{"patent_id": "10-2019-0101988", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0104283", "출원번호": "10-2019-0101988", "발명의 명칭": "머신러닝 기반의 세탁기 언밸런스 에러 검출 방법 및 세탁기", "출원인": "엘지전자 주식회사", "발명자": "이상현"}}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "세탁기가 동작하는 동안 상기 세탁기에 구비된 모터의 구동 전류와 RPM(Revolution per Minute)의 데이터를 획득하는 단계;상기 획득한 데이터로부터 입력데이터를 추출하는 단계;상기 추출된 입력데이터를 포 유동 식별 모델에 입력하고, 상기 포 유동 식별 모델의 출력값을 통해 내조에 삽입된 포의 유동 상태를 판단하는 단계; 및상기 포의 유동 상태가 비 유동 상태로 판단되는 경우 상기 구동 전류와 RPM의 데이터에 기반하여 언밸런스 에러(Unbalance Error)를 검출하는 단계;를 포함하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 세탁기의 동작구간은,세탁구간, 헹굼구간 또는 탈수구간 중 적어도 하나를 포함하며,상기 구동 전류와 RPM의 데이터의 획득은,미리 설정된 속도를 유지하는 상기 세탁구간 또는 상기 탈수구간 중 상기 포가 상기 내조에 밀착되지 않는 구간에서 획득할 수 있는 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 입력데이터를 추출하는 단계는,상기 획득된 데이터의 프로파일을 분석하고, 상기 프로파일에서 일정한 주기성을 갖는 안정화 구간으로부터 상기 입력데이터를 샘플링하는 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 언밸런스 에러(Unbalance Error)를 검출하는 단계는,상기 구동 전류와 RPM의 데이터에 근거하여 언밸런스값을 측정하는 단계; 및상기 언밸런스값이 미리 설정된 임계값을 초과하는 경우 상기 언밸런스 에러가 발생한 것으로 판단하는 단계;를 포함하는 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,공개특허 10-2019-0104283-3-상기 언밸런스값이 미리 설정된 임계값 미만인 경우 특수 코스로 운행 코스를 변경하는 단계;를 더 포함하되, 상기 특수 코스는 포 분산 과정을 수행하지 않고, 상기 언밸런스 에러가 발생하더라도 상기 모터를 단락시키지않는 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서, 상기 언밸런스 에러가 발생하는 경우 상기 언밸런스 에러에 관한 메시지를 사용자 단말로 전송하는 단계;를 더 포함하는 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 사용자 단말로부터 상기 언밸런스 에러에 관한 메시지의 응답을 수신하고, 상기 응답에 따라 상기 세탁기의 동작을 제어하는 단계;를 더 포함하는 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 상기 세탁기의 동작을 제어하는 단계는,상기 세탁기의 운행을 종료시키거나 상기 세탁기의 동작을 특수 코스로 변경하도록 상기 세탁기를 제어하며,상기 특수 코스는 포 분산 과정을 수행하지 않고, 상기 언밸런스 에러가 발생하더라도 상기 모터를 단락시키지않는 코스인 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6 항에 있어서, 상기 언밸런스 에러에 관한 메시지는, 상기 포의 상태를 촬영한 이미지, 상기 언밸런스 에러의 발생 여부에 관한 정보 또는 상기 언밸런스 에러의 발생 시기에 관한 정보 중 적어도 하나를 포함하는 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제4 항에 있어서, 상기 언밸런스 에러가 발생하는 경우, 상기 세탁기의 스피커를 통해 안내 메시지를 송출하는 단계;를 더 포함하는 것을 특징으로 하는 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법.공개특허 10-2019-0104283-4-청구항 11 머신러닝 기반의 세탁기에 있어서,포를 수용하는 내조;프로세서;를 포함하고,상기 프로세서는, 상기 세탁기가 동작하는 동안 상기 세탁기에 구비된 모터의 구동 전류와 RPM의 데이터를 획득하고, 미리 학습된포 유동 식별 모델에 상기 획득한 데이터를 적용하여, 상기 포 유동 식별 모델의 출력값을 통해 내조에 삽입된포의 유동 상태를 판단하고, 상기 포의 유동 상태가 비 유동 상태로 판단되는 경우 상기 구동 전류와 RPM의 데이터에 기반하여 언밸런스 에러를 검출하는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 세탁기의 동작구간은,세탁구간, 헹굼구간 또는 탈수구간 중 적어도 하나를 포함하며,상기 구동 전류와 RPM의 데이터의 획득은,미리 설정된 속도를 유지하는 상기 세탁구간 또는 상기 탈수구간 중 상기 포가 상기 내조에 밀착되지 않는 구간에서 획득할 수 있는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11 항에 있어서,상기 프로세서는,상기 획득된 데이터의 프로파일을 분석하고, 상기 프로파일에서 일정한 주기성을 갖는 안정화 구간으로부터 상기 입력데이터를 샘플링하는 것을 특징으로하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11 항에 있어서,편심량 감지부;를 더 포함하고,상기 편심량 감지부는, 상기 구동 전류와 RPM의 데이터에 근거하여 언밸런스값을 측정하고, 상기 프로세서는, 상기 언밸런스값이 미리 설정된 임계값을 초과하는 경우 상기 언밸런스 에러가 발생한 것으로판단하는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서,상기 제어부는,상기 언밸런스값이 미리 설정된 임계값 미만인 경우 특수 코스로 운행 코스를 변경하고,상기 특수 코스는 포 분산 과정을 수행하지 않고, 상기 언밸런스 에러가 발생하더라도 상기 모터를 단락시키지공개특허 10-2019-0104283-5-않는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14 항에 있어서,통신 모듈;을 더 포함하고,상기 통신 모듈은, 상기 언밸런스 에러가 발생하는 경우 상기 언밸런스 에러에 관한 메시지를 사용자 단말로 전송하는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 프로세서는,상기 통신 모듈을 통해 상기 사용자 단말로부터 상기 언밸런스 에러에 관한 메시지의 응답을 수신하고, 상기 응답에 따라 상기 세탁기의 동작을 제어하는 신호를 생성하는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서,상기 세탁기의 동작을 제어하는 신호는,상기 세탁기의 종료 신호 또는 상기 세탁기의 동작을 특수 코스로 변경하는 신호를 포함하고,상기 특수 코스는 포 분산 과정을 수행하지 않고, 상기 언밸런스 에러가 발생하더라도 상기 모터를 단락시키지않는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16 항에 있어서,상기 언밸런스 에러에 관한 메시지는, 상기 포의 상태를 촬영한 이미지, 상기 언밸런스 에러의 발생 여부에 관한 정보 또는 상기 언밸런스 에러의 발생 시기에 관한 정보 중 적어도 하나를 포함하는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제14 항에 있어서,스피커;를 더 포함하고,상기 스피커는, 상기 세탁기의 상기 언밸런스 에러의 안내 메시지를 송출하는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "머신러닝 기반의 세탁기 언밸런스 에러 검출 방법 및 세탁기가 개시된다. 본 발명의 일 실시예에 따른 언밸런스 에러 검출 방법은, 세탁기 또는 서버의 AI 장치에 구비된 포 유동 식별 모델을 이용하여 포 유동 여부를 식별하 고, 비 유동 상태인 경우 언밸런스에 관한 데이터를 바탕으로 언밸런스값을 측정하여 언밸런스 에러를 검출한다. 별도의 추가 부품없이 언밸런스 에러를 보다 정확하게 검출할 수 있다는 이점이 있다. 본 발명의 언밸런스 에러를 검출하는 AI 장치는 드론(Unmanned Aerial Vehicle, UAV), 로봇, 증강 현실 (Augmented Reality, AR) 장치, 가상 현실(virtual reality, VR) 장치, 5G 서비스와 관련된 장치 등과 연계될 수 있다."}
{"patent_id": "10-2019-0101988", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법 및 세탁기에 관한 것으로서, 보다 구체적으로는 탈 수 동작 단계에서 언밸런스 에러(Unbalance Error)를 예측할 수 있는 머신러닝 기반의 스마트 세탁기에 관한 것 이다."}
{"patent_id": "10-2019-0101988", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 세탁기는 의복, 침구 등의 세탁물에 물리적 작용 및/또는 화학적 작용을 가하여 포를 처리하는 각종 장치를 의미한다. 세탁기는 세탁수가 담기는 외조와, 포가 담기며 상기 외조 내에 회전 가능하게 설치되는 내조 를 포함한다. 일반적인 세탁기의 세탁방법은 내조를 회전시켜서 포를 세탁하는 세탁 과정, 및 내조의 원심력을 이용하여 포를 탈수하는 탈수 과정을 포함한다. 이때, 세탁기가 세탁물의 무게만 감지하게 되면, 세탁물의 상태는 알지 못하기 때문에 무게에 따른 행정을 진행 하게 된다. 만약 탈수 행정의 진입 전 언밸런스값을 낮추기 위한 포풀림 행정을 진행하여 일정한 값 이하가 되 면 탈수 행정에 진입하게 되는데, 세탁기 내부를 가득 채우는 이불과 같은 세탁물의 경우, 포풀림 행정을 수행 하더라도 언밸런스 문제를 해결하지 못한다."}
{"patent_id": "10-2019-0101988", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 필요성 및/또는 문제점을 해결하는 것을 목적으로 한다. 또한, 본 발명은, 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법 및 세탁기를 구현하는 것을 목적으로 한다. 또한, 본 발명은, 포 유동 유무를 식별하고, 언밸런스 에러(Unbalance Error, UBE) 발생이 예측되면, 단말을 통 해 고객에게 인지시킬 수 있는 머신러닝 기반의 세탁기를 구현하는 것을 목적으로 한다. 또한, 본 발명은, 포 유동 유무를 식별하고, 언밸런스 에러 발생이 예측되면, 탈수 프로파일를 변경하여 운전시 간을 감축시킬 수 있는 머신러닝 기반의 세탁기를 구현하는 것을 목적으로 한다."}
{"patent_id": "10-2019-0101988", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 머신러닝 기반의 세탁기 언밸런스 에러 검출 방법은 세탁기가 동작하는 동안 상기 세 탁기에 구비된 모터의 구동 전류와 RPM(Revolution per Minute)의 데이터를 획득하는 단계;상기 획득한 데이터 로부터 입력데이터를 추출하는 단계;상기 추출된 입력데이터를 포 유동 식별 모델에 입력하고, 상기 포 유동 식 별 모델의 출력값을 통해 내조에 삽입된 포의 유동 상태를 판단하는 단계; 및 상기 포의 유동 상태가 비 유동 상태로 판단되는 경우 상기 구동 전류와 RPM의 데이터에 기반하여 언밸런스 에러(Unbalance Error)를 검출하는 단계;를 포함한다. 또한, 상기 세탁기의 동작구간은, 세탁구간, 헹굼구간 또는 탈수구간 중 적어도 하나를 포함하며, 상기 구동 전 류와 RPM의 데이터의 획득은, 미리 설정된 속도를 유지하는 상기 세탁구간 또는 상기 탈수구간 중 상기 포가 상 기 내조에 밀착되지 않는 구간에서 획득할 수 있다. 또한, 상기 입력데이터를 추출하는 단계는, 상기 획득된 데이터의 프로파일을 분석하고, 상기 프로파일에서 일 정한 주기성을 갖는 안정화 구간으로부터 상기 입력데이터를 샘플링할 수 있다. 또한, 상기 언밸런스 에러(Unbalance Error)를 검출하는 단계는,상기 구동 전류와 RPM의 데이터에 근거하여 언 밸런스값을 측정하는 단계; 및 상기 언밸런스값이 미리 설정된 임계값을 초과하는 경우 상기 언밸런스 에러가 발생한 것으로 판단하는 단계;를 포함할 수 있다. 또한, 상기 언밸런스값이 미리 설정된 임계값 미만인 경우 특수 코스로 운행 코스를 변경하는 단계;를 더 포함 하되, 상기 특수 코스는 포 분산 과정을 수행하지 않고, 상기 언밸런스 에러가 발생하더라도 상기 모터를 단락 시키지 않을 수 있다. 또한, 상기 언밸런스 에러가 발생하는 경우 상기 언밸런스 에러에 관한 메시지를 사용자 단말로 전송하는 단 계;를 더 포함할 수 있다. 또한, 상기 사용자 단말로부터 상기 언밸런스 에러에 관한 메시지의 응답을 수신하고, 상기 응답에 따라 상기 세탁기의 동작을 제어하는 단계;를 더 포함할 수 있다.또한, 상기 세탁기의 동작을 제어하는 단계는, 상기 세탁기의 운행을 종료시키거나 상기 세탁기의 동작을 특수 코스로 변경하도록 상기 세탁기를 제어하며, 상기 특수 코스는 포 분산 과정을 수행하지 않고, 상기 언밸런스 에러가 발생하더라도 상기 모터를 단락시키지 않는 코스일 수 있다. 또한, 상기 언밸런스 에러에 관한 메시지는, 상기 포의 상태를 촬영한 이미지, 상기 언밸런스 에러의 발생 여부 에 관한 정보 또는 상기 언밸런스 에러의 발생 시기에 관한 정보 중 적어도 하나를 포함할 수 있다. 또한, 상기 언밸런스 에러가 발생하는 경우, 상기 세탁기의 스피커를 통해 안내 메시지를 송출하는 단계;를 더 포함할 수 있다. 본 발명의 다른 실시예에 따른 머신러닝 기반의 세탁기는 머신러닝 기반의 세탁기에 있어서,포를 수용하는 내조;프로세서;를 포함하고,상기 프로세서는, 상기 세탁기가 동작하는 동안 상기 세탁기에 구비된 모터의 구동 전류와 RPM의 데이터를 획득하고, 미리 학습된 포 유동 식별 모델에 상기 획득한 데이터를 적용하여, 상기 포 유동 식별 모델의 출력값을 통해 내조에 삽입된 포의 유동 상태를 판단하고, 상기 포의 유동 상태가 비 유동 상 태로 판단되는 경우 상기 구동 전류와 RPM의 데이터에 기반하여 언밸런스 에러를 검출하는 것을 특징으로 하는 머신러닝 기반의 세탁기."}
{"patent_id": "10-2019-0101988", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 머신러닝 기반의 스마트 세탁기의 효과에 대해 설명하면 다음과 같다. 본 발명은 포 유동유무를 식별할 수 있다. 또한, 본 발명은 언밸런스 에러(Unbalance Error, UBE) 발생이 예측되면, 단말을 통해 고객에게 인지시킬 수 있 다. 또한, 본 발명은 언밸런스 에러의 발생이 예측되면, 탈수 프로파일을 변경하여 운전시간을 감축시킬 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과ㄹ로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2019-0101988", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0101988", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 이하, 5G 시나리오와 5G 통신(5th Generation Mobile Communication)을 이용하는 AI 프로세싱된 정보를 필요로 하는 장치를 설명하기로 한다. 5G 시나리오 5G의 세 가지 주요 요구 사항 영역은 개선된 모바일 광대역 (Enhanced Mobile Broadband, eMBB) 영역, 다량의 머신 타입 통신 (massive Machine Type Communication, mMTC) 영역 및 초-신뢰 및 저 지연 통신 (Ultra-reliable and Low Latency Communications, URLLC) 영역을 포함한다. 일부 사용 예(Use Case)는 최적화를 위해 다수의 영역들이 요구될 수 있고, 다른 사용 예는 단지 하나의 핵심 성능 지표 (Key Performance Indicator, KPI)에만 포커싱될 수 있다. 5G는 이러한 다양한 사용 예들을 유연하 고 신뢰할 수 있는 방법으로 지원하는 것이다. eMBB는 기본적인 모바일 인터넷 액세스를 훨씬 능가하게 하며, 풍부한 양방향 작업, 클라우드 또는 증강현실에 서 미디어 및 엔터테인먼트 애플리케이션을 커버한다. 데이터는 5G의 핵심 동력 중 하나이며, 5G 시대에서 처음 으로 전용 음성 서비스를 볼 수 없을 수 있다. 5G에서, 음성은 단순히 통신 시스템에 의해 제공되는 데이터 연 결을 사용하여 응용 프로그램으로서 처리될 것이 기대된다. 증가된 트래픽 양(volume)을 위한 주요 원인들은 콘 텐츠 크기의 증가 및 높은 데이터 전송률을 요구하는 애플리케이션 수의 증가이다. 스트리밍 서비스 (오디오 및 비디오), 대화형 비디오 및 모바일 인터넷 연결은 더 많은 장치가 인터넷에 연결될수록 더 널리 사용될 것이다. 이러한 많은 응용 프로그램들은 사용자에게 실시간 정보 및 알림을 푸쉬하기 위해 항상 켜져 있는 연결성이 필 요하다. 클라우드 스토리지 및 애플리케이션은 모바일 통신 플랫폼에서 급속히 증가하고 있으며, 이것은 업무 및 엔터테인먼트 모두에 적용될 수 있다. 그리고, 클라우드 스토리지는 상향링크 데이터 전송률의 성장을 견인하는 특별한 사용 예이다. 5G는 또한 클라우드의 원격 업무에도 사용되며, 촉각 인터페이스가 사용될 때 우수한 사용자 경험을 유지하도록 훨씬 더 낮은 단-대-단(end-to-end) 지연을 요구한다. 엔터테인먼트 예를 들어, 클라 우드 게임 및 비디오 스트리밍은 모바일 광대역 능력에 대한 요구를 증가시키는 또 다른 핵심 요소이다. 엔터테 인먼트는 기차, 차 및 비행기와 같은 높은 이동성 환경을 포함하는 어떤 곳에서든지 스마트폰 및 태블릿에서 필 수적이다. 또 다른 사용 예는 엔터테인먼트를 위한 증강현실 및 정보 검색이다. 여기서, 증강현실은 매우 낮은 지연과 순간적인 데이터 양을 필요로 한다. 또한, 가장 많이 예상되는 5G 사용 예 중 하나는 모든 분야에서 임베디드 센서를 원활하게 연결할 수 있는 기능 즉, mMTC에 관한 것이다. 2020년까지 잠재적인 IoT 장치들은 204 억 개에 이를 것으로 예측된다. 산업 IoT는 5G 가 스마트 도시, 자산 추적(asset tracking), 스마트 유틸리티, 농업 및 보안 인프라를 가능하게 하는 주요 역 할을 수행하는 영역 중 하나이다. URLLC는 주요 인프라의 원격 제어 및 자체-구동 차량(self-driving vehicle)과 같은 초 신뢰 / 이용 가능한 지 연이 적은 링크를 통해 산업을 변화시킬 새로운 서비스를 포함한다. 신뢰성과 지연의 수준은 스마트 그리드 제 어, 산업 자동화, 로봇 공학, 드론 제어 및 조정에 필수적이다. 다음으로, 다수의 사용 예들에 대해 보다 구체적으로 살펴본다. 5G는 초당 수백 메가 비트에서 초당 기가 비트로 평가되는 스트림을 제공하는 수단으로 FTTH (fiber-to-the- home) 및 케이블 기반 광대역 (또는 DOCSIS)을 보완할 수 있다. 이러한 빠른 속도는 가상현실과 증강현실뿐 아 니라 4K 이상(6K, 8K 및 그 이상)의 해상도로 TV를 전달하는데 요구된다. VR(Virtual Reality) 및 AR(Augmented Reality) 애플리케이션들은 거의 몰입형(immersive) 스포츠 경기를 포함한다. 특정 응용 프로그램 은 특별한 네트워크 설정이 요구될 수 있다. 예를 들어, VR 게임의 경우, 게임 회사들이 지연을 최소화하기 위 해 코어 서버를 네트워크 오퍼레이터의 에지 네트워크 서버와 통합해야 할 수 있다. 자동차(Automotive)는 차량에 대한 이동 통신을 위한 많은 사용 예들과 함께 5G에 있어 중요한 새로운 동력이 될 것으로 예상된다. 예를 들어, 승객을 위한 엔터테인먼트는 동시의 높은 용량과 높은 이동성 모바일 광대역을 요구한다. 그 이유는 미래의 사용자는 그들의 위치 및 속도와 관계없이 고품질의 연결을 계속해서 기대하기 때 문이다. 자동차 분야의 다른 활용 예는 증강현실 대시보드이다. 이는 운전자가 앞면 창을 통해 보고 있는 것 위 에 어둠 속에서 물체를 식별하고, 물체의 거리와 움직임에 대해 운전자에게 말해주는 정보를 겹쳐서 디스플레이 한다. 미래에, 무선 모듈은 차량들 간의 통신, 차량과 지원하는 인프라구조 사이에서 정보 교환 및 자동차와 다 른 연결된 디바이스들(예를 들어, 보행자에 의해 수반되는 디바이스들) 사이에서 정보 교환을 가능하게 한다. 안전 시스템은 운전자가 보다 안전한 운전을 할 수 있도록 행동의 대체 코스들을 안내하여 사고의 위험을 낮출 수 있게 한다. 다음 단계는 원격 조종되거나 자체 운전 차량(self-driven vehicle)이 될 것이다. 이는 서로 다 른 자체 운전 차량들 사이 및 자동차와 인프라 사이에서 매우 신뢰성이 있고, 매우 빠른 통신을 요구한다. 미래 에, 자체 운전 차량이 모든 운전 활동을 수행하고, 운전자는 차량 자체가 식별할 수 없는 교통 이상에만 집중하 도록 할 것이다. 자체 운전 차량의 기술적 요구 사항은 트래픽 안전을 사람이 달성할 수 없을 정도의 수준까지 증가하도록 초 저 지연과 초고속 신뢰성을 요구한다. 스마트 사회(smart society)로서 언급되는 스마트 도시와 스마트 홈은 고밀도 무선 센서 네트워크로 임베디드될 것이다. 지능형 센서의 분산 네트워크는 도시 또는 집의 비용 및 에너지-효율적인 유지에 대한 조건을 식별할 것이다. 유사한 설정이 각 가정을 위해 수행될 수 있다. 온도 센서, 창 및 난방 컨트롤러, 도난 경보기 및 가전 제품들은 모두 무선으로 연결된다. 이러한 센서들 중 많은 것들이 전형적으로 낮은 데이터 전송 속도, 저전력 및 저비용이다. 하지만, 예를 들어, 실시간 HD 비디오는 감시를 위해 특정 타입의 장치에서 요구될 수 있다. 열 또는 가스를 포함한 에너지의 소비 및 분배는 고도로 분산화되고 있어, 분산 센서 네트워크의 자동화된 제어 가 요구된다. 스마트 그리드는 정보를 수집하고 이에 따라 행동하도록 디지털 정보 및 통신 기술을 사용하여 이 런 센서들을 상호 연결한다. 이 정보는 공급 업체와 소비자의 행동을 포함할 수 있으므로, 스마트 그리드가 효 율성, 신뢰성, 경제성, 생산의 지속 가능성 및 자동화된 방식으로 전기와 같은 연료들의 분배를 개선하도록 할 수 있다. 스마트 그리드는 지연이 적은 다른 센서 네트워크로 볼 수도 있다. 건강 부문은 이동 통신의 혜택을 누릴 수 있는 많은 응용 프로그램을 보유하고 있다. 통신 시스템은 멀리 떨어 진 곳에서 임상 진료를 제공하는 원격 진료를 지원할 수 있다. 이는 거리에 대한 장벽을 줄이는데 도움을 주고, 거리가 먼 농촌에서 지속적으로 이용하지 못하는 의료 서비스들로의 접근을 개선시킬 수 있다. 이는 또한 중요 한 진료 및 응급 상황에서 생명을 구하기 위해 사용된다. 이동 통신 기반의 무선 센서 네트워크는 심박수 및 혈압과 같은 파라미터들에 대한 원격 모니터링 및 센서들을 제공할 수 있다. 무선 및 모바일 통신은 산업 응용 분야에서 점차 중요해지고 있다. 배선은 설치 및 유지 비용이 높다. 따라서, 케이블을 재구성할 수 있는 무선 링크들로의 교체 가능성은 많은 산업 분야에서 매력적인 기회이다. 그러나, 이 를 달성하는 것은 무선 연결이 케이블과 비슷한 지연, 신뢰성 및 용량으로 동작하는 것과, 그 관리가 단순화될 것이 요구된다. 낮은 지연과 매우 낮은 오류 확률은 5G로 연결될 필요가 있는 새로운 요구 사항이다. 물류(logistics) 및 화물 추적(freight tracking)은 위치 기반 정보 시스템을 사용하여 어디에서든지 인벤토리 (inventory) 및 패키지의 추적을 가능하게 하는 이동 통신에 대한 중요한 사용 예이다. 물류 및 화물 추적의 사 용 예는 전형적으로 낮은 데이터 속도를 요구하지만 넓은 범위와 신뢰성 있는 위치 정보가 필요하다. 본 명세서에서 후술할 본 발명은 전술한 5G의 요구 사항을 만족하도록 각 실시예를 조합하거나 변경하여 구현될 수 있다. 도 1을 참조하면, AI 시스템은 AI 서버, 로봇, 자율주행 차량, XR 장치, 스마트폰 또는 가전 중에서 적어도 하나 이상이 클라우드 네트워크와 연결된다. 여기서, AI 기술이 적용된 로봇, 자율주행 차량, XR 장치, 스마트폰 또는 가전 등을 AI 장치(11 내지 15)라 칭할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, AI 시스템을 구성하는 각 장치들(11 내지 15, 20)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(11 내지 15, 20)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않고 직접 서 로 통신할 수도 있다. AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. AI 서버는 AI 시스템을 구성하는 AI 장치들인 로봇, 자율주행 차량, XR 장치, 스마트폰 또 는 가전 중에서 적어도 하나 이상과 클라우드 네트워크을 통하여 연결되고, 연결된 AI 장치들(11 내지 15)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이 때, AI 서버는 AI 장치(11 내지 15)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(11 내지 15)에 전송할 수 있다. 이 때, AI 서버는 AI 장치(11 내지 15)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치(11 내 지 15)로 전송할 수 있다. 또는, AI 장치(11 내지 15)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결 과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. AI+로봇 로봇은 AI 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로 봇, 무인 비행 로봇 등으로 구현될 수 있다. 로봇은 동작을 제어하기 위한 로봇 제어 모듈을 포함할 수 있고, 로봇 제어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 로봇은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 로봇의 상태 정보를 획득하거나, 주 변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결정하거나, 사용자 상호작용에 대한 응답을 결정하거나, 동작을 결정할 수 있다. 여기서, 로봇은 이동 경로 및 주행 계획을 결정하기 위하여, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 로봇은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있다. 예컨대, 로봇은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 동작을 결정할 수 있다. 여기서, 학습 모델은 로봇에서 직접 학습되거나, AI 서 버 등의 외부 장치에서 학습된 것일 수 있다. 이 때, 로봇은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 로봇은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적어 도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계획 에 따라 로봇을 주행시킬 수 있다. 맵 데이터에는 로봇이 이동하는 공간에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예 컨대, 맵 데이터에는 벽, 문 등의 고정 객체들과 화분, 책상 등의 이동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 로봇은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있 다. 이 때, 로봇은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정 보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. AI+자율주행 자율주행 차량은 AI 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있다. 자율주행 차량은 자율주행 기능을 제어하기 위한 자율주행 제어 모듈을 포함할 수 있고, 자율주행 제어 모 듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 자율주행 제어 모듈은 자율주행 차량 의 구성으로써 내부에 포함될 수도 있지만, 자율주행 차량의 외부에 별도의 하드웨어로 구성되어 연결 될 수도 있다. 자율주행 차량은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 자율주행 차량의 상태 정보 를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결 정하거나, 동작을 결정할 수 있다. 여기서, 자율주행 차량은 이동 경로 및 주행 계획을 결정하기 위하여, 로봇과와 마찬가지로, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 특히, 자율주행 차량은 시야가 가려지는 영역이나 일정 거리 이상의 영역에 대한 환경이나 객체는 외부 장 치들로부터 센서 정보를 수신하여 인식하거나, 외부 장치들로부터 직접 인식된 정보를 수신할 수 있다. 자율주행 차량은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행 할 수 있다. 예컨대, 자율주행 차량은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 주행 동선을 결정할 수 있다. 여기서, 학습 모델은 자율주행 차량 에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이 때, 자율주행 차량은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 자율주행 차량은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중 에서 적어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계획에 따라 자율주행 차량을 주행시킬 수 있다. 맵 데이터에는 자율주행 차량이 주행하는 공간(예컨대, 도로)에 배치된 다양한 객체들에 대한 객체 식별 정 보가 포함될 수 있다. 예컨대, 맵 데이터에는 가로등, 바위, 건물 등의 고정 객체들과 차량, 보행자 등의 이동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 자율주행 차량은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주 행할 수 있다. 이 때, 자율주행 차량은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득 하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다.AI+XR XR 장치는 AI 기술이 적용되어, HMD(Head-Mount Display), 차량에 구비된 HUD(Head-Up Display), 텔레비전, 휴대폰, 스마트 폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지, 차량, 고정형 로봇이 나 이동형 로봇 등으로 구현될 수 있다. XR 장치는 다양한 센서들을 통해 또는 외부 장치로부터 획득한 3차원 포인트 클라우드 데이터 또는 이미지 데이터를 분석하여 3차원 포인트들에 대한 위치 데이터 및 속성 데이터를 생성함으로써 주변 공간 또는 현실 객 체에 대한 정보를 획득하고, 출력할 XR 객체를 렌더링하여 출력할 수 있다. 예컨대, XR 장치는 인식된 물체 에 대한 추가 정보를 포함하는 XR 객체를 해당 인식된 물체에 대응시켜 출력할 수 있다. XR 장치는 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있다. 예컨대, XR 장치는 학습 모델을 이용하여 3차원 포인트 클라우드 데이터 또는 이미지 데이터에서 현 실 객체를 인식할 수 있고, 인식한 현실 객체에 상응하는 정보를 제공할 수 있다. 여기서, 학습 모델은 XR 장치 에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이 때, XR 장치는 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등 의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. AI+로봇+자율주행 로봇은 AI 기술 및 자율주행 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인 먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. AI 기술과 자율주행 기술이 적용된 로봇은 자율주행 기능을 가진 로봇 자체나, 자율주행 차량과 상호작 용하는 로봇 등을 의미할 수 있다. 자율주행 기능을 가진 로봇은 사용자의 제어 없이도 주어진 동선에 따라 스스로 움직이거나, 동선을 스스로 결정하여 움직이는 장치들을 통칭할 수 있다. 자율주행 기능을 가진 로봇 및 자율주행 차량은 이동 경로 또는 주행 계획 중 하나 이상을 결정하기 위 해 공통적인 센싱 방법을 사용할 수 있다. 예를 들어, 자율주행 기능을 가진 로봇 및 자율주행 차량은 라이다, 레이더, 카메라를 통해 센싱된 정보를 이용하여, 이동 경로 또는 주행 계획 중 하나 이상을 결정할 수 있다. 자율주행 차량과 상호작용하는 로봇은 자율주행 차량(100b100a)와과 별개로 존재하면서, 자율주행 차량 의 내부 또는 외부에서 자율주행 기능에 연계되거나, 자율주행 차량에 탑승한 사용자와 연계된 동작을 수행할 수 있다. 이 때, 자율주행 차량과 상호작용하는 로봇은 자율주행 차량을를 대신하여 센서 정보를 획득하여 자율주행 차량에 제공하거나, 센서 정보를 획득하고 주변 환경 정보 또는 객체 정보를 생성하여 자율주행 차량에 제공함으로써, 자율주행 차량의 자율주행 기능을 제어하거나 보조할 수 있다. 또는, 자율주행 차량과 상호작용하는 로봇은 자율주행 차량에 탑승한 사용자를 모니터링하거나 사 용자와의 상호작용을 통해 자율주행 차량의 기능을 제어할 수 있다. 예컨대, 로봇은 운전자가 졸음 상 태인 경우로 판단되는 경우, 자율주행 차량의 자율주행 기능을 활성화하거나 자율주행 차량의 구동부의 제어를 보조할 수 있다. 여기서, 로봇이 제어하는 자율주행 차량의 기능에는 단순히 자율주행 기능뿐만 아니라, 자율주행 차량의 내부에 구비된 네비게이션 시스템이나 오디오 시스템에서 제공하는 기능도 포함될 수 있다. 또는, 자율주행 차량과 상호작용하는 로봇은 자율주행 차량의 외부에서 자율주행 차량에 정보 를 제공하거나 기능을 보조할 수 있다. 예컨대, 로봇은 스마트 신호등과 같이 자율주행 차량에 신호 정 보 등을 포함하는 교통 정보를 제공할 수도 있고, 전기 차량의 자동 전기 충전기와 같이 자율주행 차량과 상호작용하여 충전구에 전기 충전기를 자동으로 연결할 수도 있다.AI+로봇+XR 로봇은 AI 기술 및 XR 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇, 드론 등으로 구현될 수 있다. XR 기술이 적용된 로봇은 XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇을 의미할 수 있다. 이 경우, 로봇은 XR 장치와 구분되며 서로 연동될 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇은 카메라를 포함하는 센서들로부터 센서 정보를 획득 하면, 로봇 또는 XR 장치는 센서 정보에 기초한 XR 영상을 생성하고, XR 장치는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 로봇은 XR 장치를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 예컨대, 사용자는 XR 장치 등의 외부 장치를 통해 원격으로 연동된 로봇의 시점에 상응하는 XR 영상을 확인할 수 있고, 상호작용을 통하여 로봇의 자율주행 경로를 조정하거나, 동작 또는 주행을 제어하거나, 주 변 객체의 정보를 확인할 수 있다. AI+자율주행+XR 자율주행 차량은 AI 기술 및 XR 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있다. XR 기술이 적용된 자율주행 차량은 XR 영상을 제공하는 수단을 구비한 자율주행 차량이나, XR 영상 내에서 의 제어/상호작용의 대상이 되는 자율주행 차량 등을 의미할 수 있다. 특히, XR 영상 내에서의 제어/상호작용의 대상이 되는 자율주행 차량은 XR 장치와 구분되며 서로 연동될 수 있다. XR 영상을 제공하는 수단을 구비한 자율주행 차량은 카메라를 포함하는 센서들로부터 센서 정보를 획득하고, 획득한 센서 정보에 기초하여 생성된 XR 영상을 출력할 수 있다. 예컨대, 자율주행 차량은 HUD를 구비하여 XR 영상을 출력함으로써, 탑승자에게 현실 객체 또는 화면 속의 객체에 대응되는 XR 객체를 제공할 수 있다. 이 때, XR 객체가 HUD에 출력되는 경우에는 XR 객체의 적어도 일부가 탑승자의 시선이 향하는 실제 객체에 오버 랩되도록 출력될 수 있다. 반면, XR 객체가 자율주행 차량의 내부에 구비되는 디스플레이에 출력되는 경우 에는 XR 객체의 적어도 일부가 화면 속의 객체에 오버랩되도록 출력될 수 있다. 예컨대, 자율주행 차량은 차로, 타 차량, 신호등, 교통 표지판, 이륜차, 보행자, 건물 등과 같은 객체와 대응되는 XR 객체들을 출력할 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 자율주행 차량은 카메라를 포함하는 센서들로부터 센서 정 보를 획득하면, 자율주행 차량 또는 XR 장치는 센서 정보에 기초한 XR 영상을 생성하고, XR 장치는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 자율주행 차량은 XR 장치 등의 외부 장치를 통해 입 력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 확장현실 기술 확장현실(XR: eXtended Reality)은 가상현실(VR: Virtual Reality), 증강현실(AR: Augmented Reality), 혼합현 실(MR: Mixed Reality)을 총칭한다. VR 기술은 현실 세계의 객체나 배경 등을 CG 영상으로만 제공하고, AR 기술 은 실제 사물 영상 위에 가상으로 만들어진 CG 영상을 함께 제공하며, MR 기술은 현실 세계에 가상 객체들을 섞 고 결합시켜서 제공하는 컴퓨터 그래픽 기술이다. MR 기술은 현실 객체와 가상 객체를 함께 보여준다는 점에서 AR 기술과 유사하다. 그러나, AR 기술에서는 가상 객체가 현실 객체를 보완하는 형태로 사용되는 반면, MR 기술에서는 가상 객체와 현실 객체가 동등한 성격으로 사용된다는 점에서 차이점이 있다. XR 기술은 HMD(Head-Mount Display), HUD(Head-Up Display), 휴대폰, 태블릿 PC, 랩탑, 데스크탑, TV, 디지털 사이니지 등에 적용될 수 있고, XR 기술이 적용된 장치를 XR 장치(XR Device)라 칭할 수 있다.이하 명세서에서는 AI 프로세싱된 정보를 필요로 하는 장치 및/또는 AI 프로세서가 필요로 하는 5G 통신(5th generation mobile communication)을 단락 A 내지 단락 G를 통해 설명하기로 한다. A. UE 및 5G 네트워크 블록도 예시 도 2는 본 명세서에서 제안하는 방법들이 적용될 수 있는 무선 통신 시스템의 블록 구성도를 예시한다. 도 2를 참조하면, AI 모듈을 포함하는 장치(AI 장치)를 제1 통신 장치로 정의(도 2의 910)하고, 프로세서 가 AI 상세 동작을 수행할 수 있다. AI 장치와 통신하는 다른 장치(AI 서버)를 포함하는 5G 네트워크를 제2 통신 장치(도 2의 920)하고, 프로세서 가 AI 상세 동작을 수행할 수 있다. 5G 네트워크가 제 1 통신 장치로, AI 장치가 제 2 통신 장치로 표현될 수도 있다. 예를 들어, 상기 제 1 통신 장치 또는 상기 제 2 통신 장치는 기지국, 네트워크 노드, 전송 단말, 수신 단말, 무선 장치, 무선 통신 장치, 차량, 자율주행 기능을 탑재한 차량, 커넥티드카(Connected Car), 드론(Unmanned Aerial Vehicle, UAV), AI(Artificial Intelligence) 모듈, 로봇, AR(Augmented Reality) 장치, VR(Virtual Reality) 장치, MR(Mixed Reality) 장치, 홀로그램 장치, 공공 안전 장치, MTC 장치, IoT 장치, 의료 장치, 핀 테크 장치(또는 금융 장치), 보안 장치, 기후/환경 장치, 5G 서비스와 관련된 장치 또는 그 이외 4차 산업 혁명 분야와 관련된 장치일 수 있다. 예를 들어, 단말 또는 UE(User Equipment)는 휴대폰, 스마트 폰(smart phone), 노트북 컴퓨터(laptop computer), 디지털 방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네 비게이션, 슬레이트 PC(slate PC), 태블릿 PC(tablet PC), 울트라북(ultrabook), 웨어러블 디바이스(wearable device, 예를 들어, 워치형 단말기 (smartwatch), 글래스형 단말기 (smart glass), HMD(head mounted display)) 등을 포함할 수 있다. 예를 들어, HMD는 머리에 착용하는 형태의 디스플레이 장치일 수 있다. 예를 들어, HMD는 VR, AR 또는 MR을 구현하기 위해 사용될 수 있다. 예를 들어, 드론은 사람이 타지 않고 무선 컨트 롤 신호에 의해 비행하는 비행체일 수 있다. 예를 들어, VR 장치는 가상 세계의 객체 또는 배경 등을 구현하는 장치를 포함할 수 있다. 예를 들어, AR 장치는 현실 세계의 객체 또는 배경 등에 가상 세계의 객체 또는 배경을 연결하여 구현하는 장치를 포함할 수 있다. 예를 들어, MR 장치는 현실 세계의 객체 또는 배경 등에 가상 세계 의 객체 또는 배경을 융합하여 구현하는 장치를 포함할 수 있다. 예를 들어, 홀로그램 장치는 홀로그래피라는 두 개의 레이저 광이 만나서 발생하는 빛의 간섭현상을 활용하여, 입체 정보를 기록 및 재생하여 360도 입체 영 상을 구현하는 장치를 포함할 수 있다. 예를 들어, 공공 안전 장치는 영상 중계 장치 또는 사용자의 인체에 착 용 가능한 영상 장치 등을 포함할 수 있다. 예를 들어, MTC 장치 및 IoT 장치는 사람의 직접적인 개입이나 또는 조작이 필요하지 않는 장치일 수 있다. 예를 들어, MTC 장치 및 IoT 장치는 스마트 미터, 벤딩 머신, 온도계, 스마트 전구, 도어락 또는 각종 센서 등을 포함할 수 있다. 예를 들어, 의료 장치는 질병을 진단, 치료, 경감, 처치 또는 예방할 목적으로 사용되는 장치일 수 있다. 예를 들어, 의료 장치는 상해 또는 장애를 진단, 치료, 경감 또는 보정할 목적으로 사용되는 장치일 수 있다. 예를 들어, 의료 장치는 구조 또는 기능을 검사, 대체 또 는 변형할 목적으로 사용되는 장치일 수 있다. 예를 들어, 의료 장치는 임신을 조절할 목적으로 사용되는 장치 일 수 있다. 예를 들어, 의료 장치는 진료용 장치, 수술용 장치, (체외) 진단용 장치, 보청기 또는 시술용 장치 등을 포함할 수 있다. 예를 들어, 보안 장치는 발생할 우려가 있는 위험을 방지하고, 안전을 유지하기 위하여 설치한 장치일 수 있다. 예를 들어, 보안 장치는 카메라, CCTV, 녹화기(recorder) 또는 블랙박스 등일 수 있다. 예를 들어, 핀테크 장치는 모바일 결제 등 금융 서비스를 제공할 수 있는 장치일 수 있다. 도 2를 참고하면, 제 1 통신 장치와 제 2 통신 장치은 프로세서(processor, 911,921), 메모리 (memory, 914,924), 하나 이상의 Tx/Rx RF 모듈(radio frequency module, 915,925), Tx 프로세서(912,922), Rx 프로세서(913,923), 안테나(916,926)를 포함한다. Tx/Rx 모듈은 트랜시버라고도 한다. 각각의 Tx/Rx 모듈(91 5)는 각각의 안테나을 통해 신호를 전송한다. 프로세서는 앞서 살핀 기능, 과정 및/또는 방법을 구현한다. 프로세서 는 프로그램 코드 및 데이터를 저장하는 메모리 와 관련될 수 있다. 메모리는 컴퓨터 판독 가능 매체로서 지칭될 수 있다. 보다 구체적으로, DL(제 1 통신 장치에서 제 2 통신 장치로의 통신)에서, 전송 (TX) 프로세서는 L1 계층(즉, 물리 계층)에 대한 다양한 신호 처리 기능을 구현한다. 수신(RX) 프로세서는 L1(즉, 물리 계층)의 다양한 신호 프로세싱 기능을 구현한다.UL(제 2 통신 장치에서 제 1 통신 장치로의 통신)은 제 2 통신 장치에서 수신기 기능과 관련하여 기술된 것과 유사한 방식으로 제 1 통신 장치에서 처리된다. 각각의 Tx/Rx 모듈는 각각의 안테나을 통 해 신호를 수신한다. 각각의 Tx/Rx 모듈은 RF 반송파 및 정보를 RX 프로세서에 제공한다. 프로세서 는 프로그램 코드 및 데이터를 저장하는 메모리 와 관련될 수 있다. 메모리는 컴퓨터 판독 가능 매체로서 지칭될 수 있다. 본 발명의 일 실시예에 의하면, 상기 제1 통신 장치는 차량이 될 수 있으며, 상기 제2 통신 장치는 5G 네트워크 가 될 수 있다. B. 무선 통신 시스템에서 신호 송/수신 방법 도 3은 무선 통신 시스템에서 신호 송/수신 방법의 일례를 나타낸 도이다. 도 3을 참고하면, UE는 전원이 켜지거나 새로이 셀에 진입한 경우 BS와 동기를 맞추는 등의 초기 셀 탐색 (initial cell search) 작업을 수행한다(S201). 이를 위해, UE는 BS로부터 1차 동기 채널(primary synchronization channel, P-SCH) 및 2차 동기 채널(secondary synchronization channel, S-SCH)을 수신하여 BS와 동기를 맞추고, 셀 ID 등의 정보를 획득할 수 있다. LTE 시스템과 NR 시스템에서 P-SCH와 S-SCH는 각각 1 차 동기 신호(primary synchronization signal, PSS)와 2차 동기 신호(secondary synchronization signal, SSS)로 불린다. 초기 셀 탐색 후, UE는 BS로부터 물리 브로드캐스트 채널(physical broadcast channel, PBCH) 를 수신하여 셀 내 브로드캐스트 정보를 획득할 수 있다. 한편, UE는 초기 셀 탐색 단계에서 하향링크 참조 신 호(downlink reference Signal, DL RS)를 수신하여 하향링크 채널 상태를 확인할 수 있다. 초기 셀 탐색을 마 친 UE는 물리 하향링크 제어 채널(physical downlink control channel, PDCCH) 및 상기 PDCCH에 실린 정보에 따라 물리 하향링크 공유 채널(physical downlink shared Channel, PDSCH)을 수신함으로써 좀더 구체적인 시스 템 정보를 획득할 수 있다(S202). 한편, BS에 최초로 접속하거나 신호 전송을 위한 무선 자원이 없는 경우 UE는 BS에 대해 임의 접속 과정(random access procedure, RACH)을 수행할 수 있다(단계 S203 내지 단계 S206). 이를 위해, UE는 물리 임의 접속 채널 (physical random access Channel, PRACH)을 통해 특정 시퀀스를 프리앰블로서 전송하고(S203 및 S205), PDCCH 및 대응하는 PDSCH를 통해 프리앰블에 대한 임의 접속 응답(random access response, RAR) 메시지를 수신할 수 있다(S204 및 S206). 경쟁 기반 RACH의 경우, 추가적으로 충돌 해결 과정(contention resolution procedure)를 수행할 수 있다. 상술한 바와 같은 과정을 수행한 UE는 이후 일반적인 상향링크/하향링크 신호 전송 과정으로서 PDCCH/PDSCH 수 신(S207) 및 물리 상향링크 공유 채널(physical uplink shared Channel, PUSCH)/물리 상향링크 제어 채널 (physical uplink control channel, PUCCH) 전송(S208)을 수행할 수 있다. 특히 UE는 PDCCH를 통하여 하향링크 제어 정보(downlink control information, DCI)를 수신한다. UE는 해당 탐색 공간 설정(configuration)들에 따 라 서빙 셀 상의 하나 이상의 제어 요소 세트(control element set, CORESET)들에 설정된 모니터링 기회 (occasion)들에서 PDCCH 후보(candidate)들의 세트를 모니터링한다. UE가 모니터할 PDCCH 후보들의 세트는 탐색 공간 세트들의 면에서 정의되며, 탐색 공간 세트는 공통 탐색 공간 세트 또는 UE-특정 탐색 공간 세트일 수 있 다. CORESET은 1~3개 OFDM 심볼들의 시간 지속기간을 갖는 (물리) 자원 블록들의 세트로 구성된다. 네트워크는 UE가 복수의 CORESET들을 갖도록 설정할 수 있다. UE는 하나 이상의 탐색 공간 세트들 내 PDCCH 후보들을 모니 터링한다. 여기서 모니터링이라 함은 탐색 공간 내 PDCCH 후보(들)에 대한 디코딩 시도하는 것을 의미한다. UE 가 탐색 공간 내 PDCCH 후보들 중 하나에 대한 디코딩에 성공하면, 상기 UE는 해당 PDCCH 후보에서 PDCCH를 검 출했다고 판단하고, 상기 검출된 PDCCH 내 DCI를 기반으로 PDSCH 수신 혹은 PUSCH 전송을 수행한다. PDCCH는 PDSCH 상의 DL 전송들 및 PUSCH 상의 UL 전송들을 스케줄링하는 데 사용될 수 있다. 여기서 PDCCH 상의 DCI는 하향링크 공유 채널과 관련된, 변조(modulation) 및 코딩 포맷과 자원 할당(resource allocation) 정보를 적어 도 포함하는 하향링크 배정(assignment)(즉, downlink grant; DL grant), 또는 상향링크 공유 채널과 관련된, 변조 및 코딩 포맷과 자원 할당 정보를 포함하는 상향링크 그랜트(uplink grant; UL grant)를 포함한다. 도 3을 참고하여, 5G 통신 시스템에서의 초기 접속(Initial Access, IA) 절차에 대해 추가적으로 살펴본다. UE는 SSB에 기반하여 셀 탐색(search), 시스템 정보 획득, 초기 접속을 위한 빔 정렬, DL 측정 등을 수행할 수 있다. SSB는 SS/PBCH(Synchronization Signal/Physical Broadcast channel) 블록과 혼용된다. SSB는 PSS, SSS와 PBCH로 구성된다. SSB는 4개의 연속된 OFDM 심볼들에 구성되며, OFDM 심볼별로 PSS, PBCH, SSS/PBCH 또는 PBCH가 전송된다. PSS와 SSS는 각각 1개의 OFDM 심볼과 127개의 부반송파들로 구성되고, PBCH는 3개의 OFDM 심볼과 576개의 부반송파들로 구성된다. 셀 탐색은 UE가 셀의 시간/주파수 동기를 획득하고, 상기 셀의 셀 ID(Identifier)(예, Physical layer Cell ID, PCI)를 검출하는 과정을 의미한다. PSS는 셀 ID 그룹 내에서 셀 ID를 검출하는데 사용되고, SSS는 셀 ID 그 룹을 검출하는데 사용된다. PBCH는 SSB (시간) 인덱스 검출 및 하프-프레임 검출에 사용된다. 336개의 셀 ID 그룹이 존재하고, 셀 ID 그룹 별로 3개의 셀 ID가 존재한다. 총 1008개의 셀 ID가 존재한다. 셀 의 셀 ID가 속한 셀 ID 그룹에 관한 정보는 상기 셀의 SSS를 통해 제공/획득되며, 상기 셀 ID 내 336개 셀들 중 상기 셀 ID에 관한 정보는 PSS를 통해 제공/획득된다 SSB는 SSB 주기(periodicity)에 맞춰 주기적으로 전송된다. 초기 셀 탐색 시에 UE가 가정하는 SSB 기본 주기는 20ms로 정의된다. 셀 접속 후, SSB 주기는 네트워크(예, BS)에 의해 {5ms, 10ms, 20ms, 40ms, 80ms, 160ms} 중 하나로 설정될 수 있다. 다음으로, 시스템 정보 (system information; SI) 획득에 대해 살펴본다. SI는 마스터 정보 블록(master information block, MIB)와 복수의 시스템 정보 블록(system information block, SIB)들로 나눠진다. MIB 외의 SI는 RMSI(Remaining Minimum System Information)으로 지칭될 수 있다. MIB는 SIB1(SystemInformationBlock1)을 나르는 PDSCH를 스케줄링하는 PDCCH의 모니터링을 위한 정보/파라미터 를 포함하며 SSB의 PBCH를 통해 BS에 의해 전송된다. SIB1은 나머지 SIB들(이하, SIBx, x는 2 이상의 정수)의 가용성(availability) 및 스케줄링(예, 전송 주기, SI-윈도우 크기)과 관련된 정보를 포함한다. SIBx는 SI 메시 지에 포함되며 PDSCH를 통해 전송된다. 각각의 SI 메시지는 주기적으로 발생하는 시간 윈도우(즉, SI-윈도우) 내에서 전송된다. 도 3을 참고하여, 5G 통신 시스템에서의 임의 접속(Random Access, RA) 과정에 대해 추가적으로 살펴본다. 임의 접속 과정은 다양한 용도로 사용된다. 예를 들어, 임의 접속 과정은 네트워크 초기 접속, 핸드오버, UE-트 리거드(triggered) UL 데이터 전송에 사용될 수 있다. UE는 임의 접속 과정을 통해 UL 동기와 UL 전송 자원을 획득할 수 있다. 임의 접속 과정은 경쟁 기반(contention-based) 임의 접속 과정과 경쟁 프리(contention free) 임의 접속 과정으로 구분된다. 경쟁 기반의 임의 접속 과정에 대한 구체적인 절차는 아래와 같다. UE가 UL에서 임의 접속 과정의 Msg1로서 임의 접속 프리앰블을 PRACH를 통해 전송할 수 있다. 서로 다른 두 길 이를 가지는 임의 접속 프리앰블 시퀀스들이 지원된다. 긴 시퀀스 길이 839는 1.25 및 5 kHz의 부반송파 간격 (subcarrier spacing)에 대해 적용되며, 짧은 시퀀스 길이 139는 15, 30, 60 및 120 kHz의 부반송파 간격에 대 해 적용된다. BS가 UE로부터 임의 접속 프리앰블을 수신하면, BS는 임의 접속 응답(random access response, RAR) 메시지 (Msg2)를 상기 UE에게 전송한다. RAR을 나르는 PDSCH를 스케줄링하는 PDCCH는 임의 접속(random access, RA) 무선 네트워크 임시 식별자(radio network temporary identifier, RNTI)(RA-RNTI)로 CRC 마스킹되어 전송된다. RA-RNTI로 마스킹된 PDCCH를 검출한 UE는 상기 PDCCH가 나르는 DCI가 스케줄링하는 PDSCH로부터 RAR을 수신할 수 있다. UE는 자신이 전송한 프리앰블, 즉, Msg1에 대한 임의 접속 응답 정보가 상기 RAR 내에 있는지 확인한 다. 자신이 전송한 Msg1에 대한 임의 접속 정보가 존재하는지 여부는 상기 UE가 전송한 프리앰블에 대한 임의 접속 프리앰블 ID가 존재하는지 여부에 의해 판단될 수 있다. Msg1에 대한 응답이 없으면, UE는 전력 램핑 (power ramping)을 수행하면서 RACH 프리앰블을 소정의 횟수 이내에서 재전송할 수 있다. UE는 가장 최근의 경 로 손실 및 전력 램핑 카운터를 기반으로 프리앰블의 재전송에 대한 PRACH 전송 전력을 계산한다. 상기 UE는 임의 접속 응답 정보를 기반으로 상향링크 공유 채널 상에서 UL 전송을 임의 접속 과정의 Msg3로서 전송할 수 있다. Msg3은 RRC 연결 요청 및 UE 식별자를 포함할 수 있다. Msg3에 대한 응답으로서, 네트워크는 Msg4를 전송할 수 있으며, 이는 DL 상에서의 경쟁 해결 메시지로 취급될 수 있다. Msg4를 수신함으로써, UE는 RRC 연결된 상태에 진입할 수 있다.C. 5G 통신 시스템의 빔 관리(Beam Management, BM) 절차 BM 과정은 SSB 또는 CSI-RS를 이용하는 DL BM 과정과, SRS(sounding reference signal)을 이용하는 UL BM 과정으로 구분될 수 있다. 또한, 각 BM 과정은 Tx 빔을 결정하기 위한 Tx 빔 스위핑과 Rx 빔을 결정하기 위 한 Rx 빔 스위핑을 포함할 수 있다. SSB를 이용한 DL BM 과정에 대해 살펴본다. SSB를 이용한 빔 보고(beam report)에 대한 설정은 RRC_CONNECTED에서 채널 상태 정보(channel state information, CSI)/빔 설정 시에 수행된다. - UE는 BM을 위해 사용되는 SSB 자원들에 대한 CSI-SSB-ResourceSetList를 포함하는 CSI-ResourceConfig IE를 BS로부터 수신한다. RRC 파라미터 csi-SSB-ResourceSetList는 하나의 자원 세트에서 빔 관리 및 보고을 위해 사 용되는 SSB 자원들의 리스트를 나타낸다. 여기서, SSB 자원 세트는 {SSBx1, SSBx2, SSBx3, SSBx4, 쪋}으로 설 정될 수 있다. SSB 인덱스는 0부터 63까지 정의될 수 있다. - UE는 상기 CSI-SSB-ResourceSetList에 기초하여 SSB 자원들 상의 신호들을 상기 BS로부터 수신한다. - SSBRI 및 참조 신호 수신 전력(reference signal received power, RSRP)에 대한 보고와 관련된 CSI-RS reportConfig가 설정된 경우, 상기 UE는 최선(best) SSBRI 및 이에 대응하는 RSRP를 BS에게 보고한다. 예를 들 어, 상기 CSI-RS reportConfig IE의 reportQuantity가 'ssb-Index-RSRP'로 설정된 경우, UE는 BS으로 최선 SSBRI 및 이에 대응하는 RSRP를 보고한다. UE는 SSB와 동일한 OFDM 심볼(들)에 CSI-RS 자원이 설정되고, 'QCL-TypeD'가 적용 가능한 경우, 상기 UE는 CSI-RS와 SSB가 'QCL-TypeD' 관점에서 유사 동일 위치된(quasi co-located, QCL) 것으로 가정할 수 있다. 여기 서, QCL-TypeD는 공간(spatial) Rx 파라미터 관점에서 안테나 포트들 간에 QCL되어 있음을 의미할 수 있다. UE 가 QCL-TypeD 관계에 있는 복수의 DL 안테나 포트들의 신호들을 수신 시에는 동일한 수신 빔을 적용해도 무방하 다. 다음으로, CSI-RS를 이용한 DL BM 과정에 대해 살펴본다. CSI-RS를 이용한 UE의 Rx 빔 결정(또는 정제(refinement)) 과정과 BS의 Tx 빔 스위핑 과정에 대해 차례대로 살 펴본다. UE의 Rx 빔 결정 과정은 반복 파라미터가 'ON'으로 설정되며, BS의 Tx 빔 스위핑 과정은 반복 파라미터 가 'OFF'로 설정된다. 먼저, UE의 Rx 빔 결정 과정에 대해 살펴본다. - UE는 'repetition'에 관한 RRC 파라미터를 포함하는 NZP CSI-RS resource set IE를 RRC 시그널링을 통해 BS 로부터 수신한다. 여기서, 상기 RRC 파라미터 'repetition'이 'ON'으로 세팅되어 있다. - UE는 상기 RRC 파라미터 'repetition'이 'ON'으로 설정된 CSI-RS 자원 세트 내의 자원(들) 상에서의 신호들을 BS의 동일 Tx 빔(또는 DL 공간 도메인 전송 필터)을 통해 서로 다른 OFDM 심볼에서 반복 수신한다. - UE는 자신의 Rx 빔을 결정한다. - UE는 CSI 보고를 생략한다. 즉, UE는 상가 RRC 파라미터 'repetition'이 'ON'으로 설정된 경우, CSI 보고를 생략할 수 있다. 다음으로, BS의 Tx 빔 결정 과정에 대해 살펴본다. - UE는 'repetition'에 관한 RRC 파라미터를 포함하는 NZP CSI-RS resource set IE를 RRC 시그널링을 통해 BS 로부터 수신한다. 여기서, 상기 RRC 파라미터 'repetition'이 'OFF'로 세팅되어 있으며, BS의 Tx 빔 스위핑 과 정과 관련된다. - UE는 상기 RRC 파라미터 'repetition'이 'OFF'로 설정된 CSI-RS 자원 세트 내의 자원들 상에서의 신호들을 BS의 서로 다른 Tx 빔(DL 공간 도메인 전송 필터)을 통해 수신한다. - UE는 최상의(best) 빔을 선택(또는 결정)한다. - UE는 선택된 빔에 대한 ID(예, CRI) 및 관련 품질 정보(예, RSRP)를 BS으로 보고한다. 즉, UE는 CSI-RS가 BM 을 위해 전송되는 경우 CRI와 이에 대한 RSRP를 BS으로 보고한다. 다음으로, SRS를 이용한 UL BM 과정에 대해 살펴본다. - UE는 'beam management'로 설정된 (RRC 파라미터) 용도 파라미터를 포함하는 RRC 시그널링(예, SRS-Config IE)를 BS로부터 수신한다. SRS-Config IE는 SRS 전송 설정을 위해 사용된다. SRS-Config IE는 SRS-Resources의 리스트와 SRS-ResourceSet들의 리스트를 포함한다. 각 SRS 자원 세트는 SRS-resource들의 세트를 의미한다. - UE는 상기 SRS-Config IE에 포함된 SRS-SpatialRelation Info에 기초하여 전송할 SRS 자원에 대한 Tx 빔포밍 을 결정한다. 여기서, SRS-SpatialRelation Info는 SRS 자원별로 설정되고, SRS 자원별로 SSB, CSI-RS 또는 SRS에서 사용되는 빔포밍과 동일한 빔포밍을 적용할지를 나타낸다. - 만약 SRS 자원에 SRS-SpatialRelationInfo가 설정되면 SSB, CSI-RS 또는 SRS에서 사용되는 빔포밍과 동일한 빔포밍을 적용하여 전송한다. 하지만, SRS 자원에 SRS-SpatialRelationInfo가 설정되지 않으면, 상기 UE는 임의 로 Tx 빔포밍을 결정하여 결정된 Tx 빔포밍을 통해 SRS를 전송한다. 다음으로, 빔 실패 복구(beam failure recovery, BFR) 과정에 대해 살펴본다. 빔포밍된 시스템에서, RLF(Radio Link Failure)는 UE의 회전(rotation), 이동(movement) 또는 빔포밍 블로키지 (blockage)로 인해 자주 발생할 수 있다. 따라서, 잦은 RLF가 발생하는 것을 방지하기 위해 BFR이 NR에서 지원 된다. BFR은 무선 링크 실패 복구 과정과 유사하고, UE가 새로운 후보 빔(들)을 아는 경우에 지원될 수 있다. 빔 실패 검출을 위해, BS는 UE에게 빔 실패 검출 참조 신호들을 설정하고, 상기 UE는 상기 UE의 물리 계층으로 부터의 빔 실패 지시(indication)들의 횟수가 BS의 RRC 시그널링에 의해 설정된 기간(period) 내에 RRC 시그널 링에 의해 설정된 임계치(threshold)에 이르면(reach), 빔 실패를 선언(declare)한다. 빔 실패가 검출된 후, 상 기 UE는 PCell 상의 임의 접속 과정을 개시(initiate)함으로써 빔 실패 복구를 트리거하고; 적절한(suitable) 빔을 선택하여 빔 실패 복구를 수행한다(BS가 어떤(certain) 빔들에 대해 전용 임의 접속 자원들을 제공한 경우, 이들이 상기 UE에 의해 우선화된다). 상기 임의 접속 절차의 완료(completion) 시, 빔 실패 복구가 완료 된 것으로 간주된다. D. URLLC (Ultra-Reliable and Low Latency Communication) NR에서 정의하는 URLLC 전송은 상대적으로 낮은 트래픽 크기, 상대적으로 낮은 도착 레이트(low arrival rate), 극도의 낮은 레이턴시 요구사항(requirement)(예, 0.5, 1ms), 상대적으로 짧은 전송 지속기간(duration)(예, 2 OFDM symbols), 긴급한 서비스/메시지 등에 대한 전송을 의미할 수 있다. UL의 경우, 보다 엄격(stringent)한 레이턴시 요구 사항(latency requirement)을 만족시키기 위해 특정 타입의 트래 픽(예컨대, URLLC)에 대한 전송이 앞서서 스케줄링된 다른 전송(예컨대, eMBB)과 다중화(multiplexing)되어야 할 필요가 있다. 이와 관련하여 한 가지 방안으로, 앞서 스케줄링 받은 UE에게 특정 자원에 대해서 프리엠션 (preemption)될 것이라는 정보를 주고, 해당 자원을 URLLC UE가 UL 전송에 사용하도록 한다. NR의 경우, eMBB와 URLLC 사이의 동적 자원 공유(sharing)이 지원된다. eMBB와 URLLC 서비스들은 비-중첩(non- overlapping) 시간/주파수 자원들 상에서 스케줄될 수 있으며, URLLC 전송은 진행 중인(ongoing) eMBB 트래픽에 대해 스케줄된 자원들에서 발생할 수 있다. eMBB UE는 해당 UE의 PDSCH 전송이 부분적으로 펑처링(puncturing) 되었는지 여부를 알 수 없을 수 있고, 손상된 코딩된 비트(corrupted coded bit)들로 인해 UE는 PDSCH를 디코딩 하지 못할 수 있다. 이 점을 고려하여, NR에서는 프리엠션 지시(preemption indication)을 제공한다. 상기 프리 엠션 지시(preemption indication)는 중단된 전송 지시(interrupted transmission indication)으로 지칭될 수 도 있다. 프리엠션 지시와 관련하여, UE는 BS로부터의 RRC 시그널링을 통해 DownlinkPreemption IE를 수신한다. UE가 DownlinkPreemption IE를 제공받으면, DCI 포맷 2_1을 운반(convey)하는 PDCCH의 모니터링을 위해 상기 UE는 DownlinkPreemption IE 내 파라미터 int-RNTI에 의해 제공된 INT-RNTI를 가지고 설정된다. 상기 UE는 추가적으 로 servingCellID에 의해 제공되는 서빙 셀 인덱스들의 세트를 포함하는 INT-ConfigurationPerServing Cell에 의해 서빙 셀들의 세트와 positionInDCI에 의해 DCI 포맷 2_1 내 필드들을 위한 위치들의 해당 세트를 가지고설정되고, dci-PayloadSize에 의해 DCI 포맷 2_1을 위한 정보 페이로드 크기를 가지고 설졍되며, timeFrequencySect에 의한 시간-주파수 자원들의 지시 입도(granularity)를 가지고 설정된다. 상기 UE는 상기 DownlinkPreemption IE에 기초하여 DCI 포맷 2_1을 상기 BS로부터 수신한다. UE가 서빙 셀들의 설정된 세트 내 서빙 셀에 대한 DCI 포맷 2_1을 검출하면, 상기 UE는 상기 DCI 포맷 2_1이 속 한 모니터링 기간의 바로 앞(last) 모니터링 기간의 PRB들의 세트 및 심볼들의 세트 중 상기 DCI 포맷 2_1에 의 해 지시되는 PRB들 및 심볼들 내에는 상기 UE로의 아무런 전송도 없다고 가정할 수 있다. 예를 들어, UE는 프리 엠션에 의해 지시된 시간-주파수 자원 내 신호는 자신에게 스케줄링된 DL 전송이 아니라고 보고 나머지 자원 영 역에서 수신된 신호들을 기반으로 데이터를 디코딩한다. E. mMTC (massive MTC) mMTC(massive Machine Type Communication)은 많은 수의 UE와 동시에 통신하는 초연결 서비스를 지원하기 위한 5G의 시나리오 중 하나이다. 이 환경에서, UE는 굉장히 낮은 전송 속도와 이동성을 가지고 간헐적으로 통신하게 된다. 따라서, mMTC는 UE를 얼마나 낮은 비용으로 오랫동안 구동할 수 있는지를 주요 목표로 하고 있다. mMTC 기술과 관련하여 3GPP에서는 MTC와 NB(NarrowBand)-IoT를 다루고 있다. mMTC 기술은 PDCCH, PUCCH, PDSCH(physical downlink shared channel), PUSCH 등의 반복 전송, 주파수 호핑 (hopping), 리튜닝(retuning), 가드 구간(guard period) 등의 특징을 가진다. 즉, 특정 정보를 포함하는 PUSCH(또는 PUCCH(특히, long PUCCH) 또는 PRACH) 및 특정 정보에 대한 응답을 포함 하는 PDSCH(또는 PDCCH)가 반복 전송된다. 반복 전송은 주파수 호핑(frequency hopping)을 통해 수행되며, 반복 전송을 위해, 제 1 주파수 자원에서 제 2 주파수 자원으로 가드 구간(guard period)에서 (RF) 리튜닝(retunin g)이 수행되고, 특정 정보 및 특정 정보에 대한 응답은 협대역(narrowband)(ex. 6 RB (resource block) or 1 RB)를 통해 송/수신될 수 있다. F. 5G 통신을 이용한 AI 기본 동작 도 4는 5G 통신 시스템에서 사용자 단말과 5G 네트워크의 기본동작의 일 예를 나타낸다. UE는 특정 정보 전송을 5G 네트워크로 전송한다(S1).그리고, 상기 5G 네트워크는 상기 특정 정보에 대한 5G 프 로세싱을 수행한다(S2).여기서, 5G 프로세싱은 AI 프로세싱을 포함할 수 있다. 그리고, 상기 5G 네트워크는 AI 프로세싱 결과를 포함하는 응답을 상기 UE로 전송한다(S3). G. 5G 통신 시스템에서 사용자 단말과 5G 네트워크 간의 응용 동작 이하, 도 2 및 도 3과 앞서 살핀 무선 통신 기술(BM 절차, URLLC, mMTC 등)을 참고하여 5G 통신을 이용한 AI 동 작에 대해 보다 구체적으로 살펴본다. 먼저, 후술할 본 발명에서 제안하는 방법과 5G 통신의 eMBB 기술이 적용되는 응용 동작의 기본 절차에 대해 설 명한다. 도 4의 S1 단계 및 S3 단계와 같이, UE가 5G 네트워크와 신호, 정보 등을 송/수신하기 위해, UE는 도 4의 S1 단 계 이전에 5G 네트워크와 초기 접속(initial access) 절차 및 임의 접속(random access) 절차를 수행한다. 보다 구체적으로, UE는 DL 동기 및 시스템 정보를 획득하기 위해 SSB에 기초하여 5G 네트워크와 초기 접속 절차 를 수행한다. 상기 초기 접속 절차 과정에서 빔 관리(beam management, BM) 과정, 빔 실패 복구(beam failure recovery) 과정이 추가될 수 있으며, UE가 5G 네트워크로부터 신호를 수신하는 과정에서 QCL(quasi-co location) 관계가 추가될 수 있다. 또한, UE는 UL 동기 획득 및/또는 UL 전송을 위해 5G 네트워크와 임의 접속 절차를 수행한다. 그리고, 상기 5G 네트워크는 상기 UE로 특정 정보의 전송을 스케쥴링하기 위한 UL grant를 전송할 수 있다. 따라서, 상기 UE는 상기 UL grant에 기초하여 상기 5G 네트워크로 특정 정보를 전송한다. 그리고, 상기 5G 네트워크는 상기 UE로 상기 특정 정보에 대한 5G 프로세싱 결과의 전송을 스케쥴링하기 위한 DL grant를 전송한다. 따라서, 상기 5G네트워크는 상기 DL grant에 기초하여 상기 UE로 AI 프로세싱 결과를 포함하는 응답을 전송할 수 있다. 다음으로, 후술할 본 발명에서 제안하는 방법과 5G 통신의 URLLC 기술이 적용되는 응용 동작의 기본 절차에 대 해 설명한다. 앞서 설명한 바와 같이, UE가 5G 네트워크와 초기 접속 절차 및/또는 임의 접속 절차를 수행한 후, UE는 5G 네 트워크로부터 DownlinkPreemption IE를 수신할 수 있다. 그리고, UE는 DownlinkPreemption IE에 기초하여 프리 엠션 지시(pre-emption indication)을 포함하는 DCI 포맷 2_1을 5G 네트워크로부터 수신한다. 그리고, UE는 프 리엠션 지시(pre-emption indication)에 의해 지시된 자원(PRB 및/또는 OFDM 심볼)에서 eMBB data의 수신을 수 행(또는 기대 또는 가정)하지 않는다. 이후, UE는 특정 정보를 전송할 필요가 있는 경우 5G 네트워크로부터 UL grant를 수신할 수 있다. 다음으로, 후술할 본 발명에서 제안하는 방법과 5G 통신의 mMTC 기술이 적용되는 응용 동작의 기본 절차에 대해 설명한다. 도 4의 단계들 중 mMTC 기술의 적용으로 달라지는 부분 위주로 설명하기로 한다. 도 4의 S1 단계에서, UE는 특정 정보를 5G 네트워크로 전송하기 위해 5G 네트워크로부터 UL grant를 수신한다. 여기서, 상기 UL grant는 상기 특정 정보의 전송에 대한 반복 횟수에 대한 정보를 포함하고, 상기 특정 정보는 상기 반복 횟수에 대한 정보에 기초하여 반복하여 전송될 수 있다. 즉, 상기 UE는 상기 UL grant에 기초하여 특 정 정보를 5G 네트워크로 전송한다. 그리고, 특정 정보의 반복 전송은 주파수 호핑을 통해 수행되고, 첫 번째 특정 정보의 전송은 제 1 주파수 자원에서, 두 번째 특정 정보의 전송은 제 2 주파수 자원에서 전송될 수 있다. 상기 특정 정보는 6RB(Resource Block) 또는 1RB(Resource Block)의 협대역(narrowband)을 통해 전송될 수 있 다. 앞서 살핀 5G 통신 기술은 후술할 본 발명에서 제안하는 방법들과 결합되어 적용될 수 있으며, 또는 본 발명에 서 제안하는 방법들의 기술적 특징을 구체화하거나 명확하게 하는데 보충될 수 있다. 도 5는 본 발명의 일 실시예에 따른 세탁기의 블록도이다. 도 5를 참조하면, 본 발명의 실시 예에 따른 세탁기(WM)는 제어부, 하드웨어부, AI 장치, 통신 모듈(미도시) 및 사용자 인터페이스를 포함한다. 제어부는 사용자 인터페이스를 통해서 입력되는 정보에 따라 하드웨어를 제어함으로써, 세탁기 (WM) 전반의 구동을 제어한다. 또한, 제어부는 영상 획득부를 통해서 획득되는 세탁물 이미지를 바 탕으로 하드웨어의 동작을 제어한다. 보다 구체적으로 제어부는 세탁물 이미지로부터 포 분류 정보 또는 포 분산 정보를 획득하고, 포 분류 정보 또는 포 분산 정보를 바탕으로 하드웨어의 동작을 제어할 수 있다. 포 분류 정보는 세탁물의 종류, 재질 등에 대한 정보로써 특히 세탁물의 함수율 정보를 지칭할 수 있다. 포 분산 정보는 내조에 안착된 세탁물의 배치 정도 또는 높이 정보를 지칭할 수 있다. 제어부는 포 분류 정보를 학습하여 탈수 과정에서 발생할 수 있는 내조의 진동 정도를 예측하고, 내 조의 진동 정도에 따라 탈수 과정에서 모터의 RPM(Revolution Per Minute)을 가변시킬 수 있다. 예 를 들어, 제어부는 포 분류 정보가 단락 유발이 우려되는 세탁물로 판단될 경우에, 탈수 과정에서 모터 의 RPM을 낮추도록 제어할 수 있다. 하드웨어는 세탁조, 모터, 급수 밸브 및 히터 등을 포함할 수 있다. 세탁조는 세탁수를 수용하는 외조, 및 외조의 내측에 배치되어 세탁물이 안착되며 모터로 부터 제공받는 회전력을 이용하여 회전하는 내조를 포함한다. 급수 밸브는 세탁수의 공급을 제어한 다. 히터는 세탁조 내의 급수의 가열한다. 센싱부는 영상 획득부, 편심량 감지부, 전류 감지부을 포함할 수 있다. 영상 획득부는 내조에 안착된 세탁물의 이미지를 획득한다. 영상 획득부는 2D 또는 3D 카메라 중에서 적어도 어느 하나를 이용할 수 있으며, 세탁기(WM)의 덮개에 배치될 수 있다. 사용자 인터페이스는 전원 입력부, 시작 입력부, 코스 선택부, 옵션 선택부, 디스플 레이부 및 스피커를 포함할 수 있다. 전원 입력부는 세탁기(WM)의 메인 전원의 온/오프를 제어하기 위한 수단을 제공한다. 시작 입력부는 세탁 과정, 헹굼 과정 또는 탈수 과정 등의 시작을 제어하기 위한 수단을 제공한다. 코스 선택부는 세탁 과정, 헹굼 과정 또는 탈수 과정의 종류를 선택할 수 있는 수단을 제공한다. 옵션 선택부는 세탁 과정, 헹굼 과정 또는 탈수 과정을 진행하기 위한 세부적인 옵션들을 선택할 수 있는 수단을 제공한다. 예를 들어, 옵션 선택부는 물 온도, 시간, 예약 등의 옵션들을 선택하기 위한 수단이 될 수 있다. 디스플레이부(45 0)는 세탁기(WM)의 동작 상태를 표시하거나, 사용자가 코스 선택부를 통해서 선택한 코스 정보 또는 옵션 선택부를 통해서 선택한 옵션 정보 등을 표시할 수 있다. 스피커는 세탁기(WM)의 동작 상태 또는 특 정 이벤트에 대한 상황을 음성 신호로 출력한다. 특정 이벤트는 포 이미지를 바탕으로 포분산 제어 또는 RPM 제어와 상황이 될 수 있다. 전류 감지부는 모터에 흐르는 전류, 즉 구동 전류(Id)를 감지한다. 전류 감지부는 홀 센서, 인 코더 등 다양한 예가 가능하다. 전류 감지부는 모터에 흐르는 전류(Id)를 주기적으로 감지하여, 이를 제어부에 입력한다. 제어부는 전류 감지부에서 감지된 전류에 기초하여 세탁물의 양을 감지할 수 있다. 세탁기(WM)는 내조에 투입된 세탁물의 치우친 정도(편심), 즉 내조의 언밸런스(Unbalance, UB)를 감 지하는 편심량 감지부를 더 포함할 수 있다. 편심량 감지부는, 내조의 회전 속도 변화량, 즉 모 터의 회전 속도 변화량에 기초하여 언밸런스 감지를 수행할 수 있다. 이를 위해 모터의 회전 속도를 감지하는 속도 감지부(미도시)가 별도로 구비되거나 또는 전류 감지부에서 감지되는 모터의 구동 전 류(Id)에 기초하여 회전 속도를 연산하고 이를 기반으로 하여 언밸런스를 감지할 수도 있다. 이러하 편심량 감 지부는 제어부 내에 구비되는 것도 가능하다. 통신 모듈(미도시)은 세탁기(WM)에 의한 세탁 과정에서 센싱된 정보, 감지된 에러 정보 등을 외부 전자 기기로 전송할 수 있다. 예를 들어, 외부 전자 기기는 블루투스 장치, 자율주행 차량, 로봇, 드론, AR 기기, 모바일 기 기, 가전 기기 등을 포함할 수 있다. 도 6은 본 발명의 일 실시예에 따른 AI 장치의 블록도이다. 도 6을 살펴보면, AI 장치는 AI 프로세싱을 수행할 수 있는 AI 모듈을 포함하는 전자 기기 또는 AI 모듈을 포함하는 서버 등을 포함할 수 있다. 또한, AI 장치는 도 5에 도시된 세탁기(WM)의 적어도 일부의 구성으 로 포함되어 AI 프로세싱 중 적어도 일부를 함께 수행하도록 구비될 수도 있다. AI 프로세싱은 도 5에 도시된 세탁기(WM)의 제어부와 관련된 모든 동작들을 포함할 수 있다. 예를 들어, 세탁기(WM)는 세탁물 이미지 또는 포 분류 정보 또는 포 분산 정보를 AI 프로세싱 하여 처리/판단, 제어 신호 생성 동작을 수행할 수 있다. AI 장치는 AI 프로세싱 결과를 직접 이용하는 클라이언트 디바이스이거나, AI 프로세싱 결과를 다른 기기 에 제공하는 클라우드 환경의 디바이스일 수도 있다. AI 장치는 신경망을 학습할 수 있는 컴퓨팅 장치로서, 서버, 데스크탑 PC, 노트북 PC, 태블릿 PC 등과 같은 다양한 전자 장치로 구현될 수 있다. AI 장치는 AI 프로세서, 메모리 및/또는 통신부를 포함할 수 있다. AI 프로세서는 메모리에 저장된 프로그램을 이용하여 신경망을 학습할 수 있다. 특히, AI 프로세서 는 세탁기(WM)의 관련 데이터를 인식하기 위한 신경망을 학습할 수 있다. 여기서, 세탁기(WM)의 관련 데이 터를 인식하기 위한 신경망은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있으며, 인간의 신경망의 뉴런(neuron)을 모의하는, 가중치를 갖는 복수의 네트워크 노드들을 포함할 수 있다. 복수의 네트워크 모드들은 뉴런이 시냅스(synapse)를 통해 신호를 주고받는 뉴런의 시냅틱 활동을 모의하도록 각각 연결 관계에 따라 데이 터를 주고받을 수 있다. 여기서 신경망은 신경망 모델에서 발전한 딥러닝 모델을 포함할 수 있다. 딥 러닝 모델 에서 복수의 네트워크 노드들은 서로 다른 레이어에 위치하면서 컨볼루션(convolution) 연결 관계에 따라 데이 터를 주고받을 수 있다. 신경망 모델의 예는 심층 신경망(DNN, deep neural networks), 합성곱 신경망(CNN, convolutional deep neural networks), 순환 신경망(RNN, Recurrent Boltzmann Machine), 제한 볼츠만 머신 (RBM, Restricted Boltzmann Machine), 심층 신뢰 신경망(DBN, deep belief networks), 심층 Q-네트워크(Deep Q-Network)와 같은 다양한 딥 러닝 기법들을 포함하며, 컴퓨터비젼, 음성인식, 자연어처리, 음성/신호처리 등의 분야에 적용될 수 있다.한편, 전술한 바와 같은 기능을 수행하는 프로세서는 범용 프로세서(예를 들어, CPU)일 수 있으나, 인공지능 학 습을 위한 AI 전용 프로세서(예를 들어, GPU)일 수 있다. 메모리는 AI 장치의 동작에 필요한 각종 프로그램 및 데이터를 저장할 수 있다. 메모리는 비 휘발 성 메모리, 휘발성 메모리, 플래시 메모리(flash-memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드 라이브(SDD) 등으로 구현할 수 있다. 메모리는 AI 프로세서에 의해 액세스되며, AI 프로세서에 의 한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 또한, 메모리는 본 발명의 일 실시예에 따른 데이터 분류/인식을 위한 학습 알고리즘을 통해 생성된 신경망 모델(예를 들어, 딥 러닝 모델)을 저장할 수 있다. 한편, AI 프로세서는 데이터 분류/인식을 위한 신경망을 학습하는 데이터 학습부를 포함할 수 있다. 데 이터 학습부는 데이터 분류/인식을 판단하기 위하여 어떤 학습 데이터를 이용할지, 학습 데이터를 이용하여 데이터를 어떻게 분류하고 인식할지에 관한 기준을 학습할 수 있다. 데이터 학습부는 학습에 이용될 학습 데이터를 획득하고, 획득된 학습데이터를 딥러닝 모델에 적용함으로써, 딥러닝 모델을 학습할 수 있다. 데이터 학습부는 적어도 하나의 하드웨어 칩 형태로 제작되어 AI 장치에 탑재될 수 있다. 예를 들어, 데이터 학습부는 인공지능(AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 범용 프로세서(CPU) 또 는 그래픽 전용 프로세서(GPU)의 일부로 제작되어 AI 장치에 탑재될 수도 있다. 또한, 데이터 학습부 는 소프트웨어 모듈로 구현될 수 있다. 소프트웨어 모듈(또는 인스트럭션(instruction)을 포함하는 프로그램 모 듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록 매체 (non-transitory computer readable media)에 저장될 수 있다. 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 애플리케이션에 의해 제공될 수 있다. 데이터 학습부는 학습 데이터 획득부 및 모델 학습부를 포함할 수 있다. 학습 데이터 획득부는 데이터를 분류하고 인식하기 위한 신경망 모델에 필요한 학습 데이터를 획득할 수 있 다. 모델 학습부는 획득된 학습 데이터를 이용하여, 신경망 모델이 소정의 데이터를 어떻게 분류할지에 관한 판 단 기준을 가지도록 학습할 수 있다. 이 때 모델 학습부는 학습 데이터 중 적어도 일부를 판단 기준으로 이 용하는 지도 학습(supervised learning)을 통하여, 신경망 모델을 학습시킬 수 있다. 또는 모델 학습부는 지도 없이 학습 데이터를 이용하여 스스로 학습함으로써, 판단 기준을 발견하는 비지도 학습(unsupervised learning)을 통해 신경망 모델을 학습시킬 수 있다. 또한, 모델 학습부는 학습에 따른 상황 판단의 결과가 올바른지에 대한 피드백을 이용하여 강화 학습(reinforcement learning)을 통하여, 신경망 모델을 학습시킬 수 있다. 또한, 모델 학습부는 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient decent)을 포함하는 학습 알고리즘을 이용하여 신경망 모델을 학습시킬 수 있다. 지도 학습은 일련의 학습 데이터와 그에 상응하는 레이블(label, 목표 출력값)을 이용하여 학습을 이루어지며, 지도 학습에 기초한 신경망 모델은 훈련 데이터(training data)로부터 함수를 추론해내는 형태의 모델일 수 있 다. 지도 학습은 일련의 학습 데이터와 그에 상응하 목표 출력값을 수신하고, 입력되는 데이터에 대한 실제 출 력값과 목표 출력값을 비교하는 학습을 통해 오류를 찾아내고, 해당 결과를 근거로 모델을 수정할 수 있다. 지 도 학습은 결과물의 형태에 따라 다시 회귀(regression), 분류(classification), 검출(detection), 시멘틱 세 그멘테이션(semantic segmentation) 등으로 구분될 수 있다. 지도 학습을 통해 도출된 함수는 다시 새로운 결과 값을 예측하는데 사용될 수 있다. 이처럼, 지도 학습에 기초한 신경망 모델은 수많은 학습 데이터의 학습을 통 해, 신경망 모델의 파라미터를 최적화할 수 있다. 신경망 모델이 학습되면, 모델 학습부는 학습된 신경망 모델을 메모리에 저장할 수 있다. 모델 학습부 는 학습된 신경망 모델을 AI 장치와 유선 또는 무선 네트워크로 연결된 서버의 메모리에 저장할 수도 있다. 데이터 학습부는 인식 모델의 분석 결과를 향상시키거나, 인식 모델의 생성에 필요한 리소스 또는 시간을 절약하기 위해 학습 데이터 전처리부(미도시) 및 학습 데이터 선택부(미도시)를 더 포함할 수도 있다. 학습 데이터 전처리부는 획득된 데이터가 상황 판단을 위한 학습에 이용될 수 있도록, 획득된 데이터를 전처리 할 수 있다. 예를 들어, 학습 데이터 전처리부는, 모델 학습부가 이미지 인식을 위한 학습을 위하여 획득된 학습 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 또한, 학습 데이터 선택부는, 학습 데이터 획득부에서 획득된 학습 데이터 또는 전처리부에서 전처리된 학 습 데이터 중 학습에 필요한 데이터를 선택할 수 있다. 선택된 학습 데이터는 모델 학습부에 제공될 수 있 다. 예를 들어, 학습 데이터 선택부는, 세탁기(WM)의 촬영수단을 통해 획득한 영상 중 특정 영역을 검출함으로 써, 특정 영역에 포함된 객체에 대한 데이터만을 학습 데이터로 선택할 수 있다. 또한, 데이터 학습부는 신경망 모델의 분석 결과를 향상시키기 위하여 모델 평가부(미도시)를 더 포함할 수 도 있다. 모델 평가부는, 신경망 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 분석 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 인식 모델을 평가하기 위한 기 정의된 데이터일 수 있다. 일 예로, 모델 평가부는 평가 데이터에 대한 학습된 인식 모델의 분석 결과 중, 분석 결과가 정확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정되 임계치를 초과 하는 경우, 소정 기준을 만족하지 못한 것으로 평가할 수 있다. 통신부는 AI 프로세서에 의한 AI 프로세싱 결과를 외부 전자 기기로 전송할 수 있다. 예를 들어, 외부 전자 기기는 블루투스 장치, 자율주행 차량, 로봇, 드론, AR 기기, 모바일 기기, 가전 기기 등을 포함할 수 있 다. 한편, 도 6에 도시된 AI 장치는 AI 프로세서와 메모리, 통신부 등으로 기능적으로 구분하여 설 명하였지만, 전술한 구성요소들이 하나의 모듈로 통합되어 AI 모듈로 호칭될 수도 있음을 밝혀둔다. 도 7은 본 발명의 일 실시예에 따른 인공 신경망을 나타내는 도면이다. 구체적으로, 도 7(a)는 인공 신경망의 일반적인 구조를 나타내는 도면이며, 도 7(b)는 인공 신경망 중 인코딩 후 디코딩을 하며 복원(Reconstruction) 단계를 거치는 오토인코더(autoencoder)를 나타내는 도면이다. 인공 신경망은 일반적으로 입력층(input layer), 은닉층(hidden lyaer) 및 출력층(output layer)로 구성되어 있으며 각 층에 포함된 뉴런들이 가중치를 통해 연결될 수 있다. 가중치와 뉴런값의 선형 결합과 비선형 활성화 함수를 통해 인공 신경망은 복잡한 함수를 근사화할 수 있는 형태를 가질 수 있다. 인공 신경망 학습의 목적은 출력층에서 계산된 출력과 실제 출력의 값 차이를 최소화시키는 가중치를 찾는데 있다. 심층 신경망은 입력층과 출력층 사이에 여러 개의 은닉층들로 이루어진 인공 신경망을 의미할 수 있다. 많은 은 닉층을 이용함으로써 복잡한 비선형 관계들을 모델링할 수 있으며, 이처럼 층의 개수를 늘림으로써 고도화된 추 상화가 가능한 신경망 구조를 딥러닝(Deep Learning)이라고 부른다. 딥러닝은 매우 방대한 양의 데이터를 학습 하여, 새로운 데이터가 입력될 경우 학습 결과를 바탕으로 확률적으로 가장 높은 답을 선택할 수 있다. 따라서, 딥러닝은 입력에 따라 적응적으로 동작할 수 있으며, 데이터에 기초하여 모델을 학습하는 과정에서 특성인자를 자동으로 찾아낼 수 있다. 딥러닝 기반의 모델은 도 6에서 전술한 심층 신경망(DNN, deep neural networks), 합성곱 신경망(CNN, convolutional deep neural networks), 순환 신경망(RNN, Recurrent Boltzmann Machine), 제한 볼츠만 머신 (RBM, Restricted Boltzmann Machine), 심층 신뢰 신경망(DBN, deep belief networks), 심층 Q-네트워크(Deep Q-Network)와 같은 다양한 딥 러닝 기법들을 포함할 수 있으나, 이에 제한되지 않는다. 또한, 딥러닝 이외의 머 신 러닝(Machine Learning) 방법도 포함할 수 있다. 예컨대, 딥러닝 기반의 모델을 적용하여 입력 데이터의 특 징을 추출하고, 추출된 특징에 기초하여 입력 데이터를 분류하거나 인식할 때는 머신 러닝 기반의 모델을 적용 할 수도 있다. 머신 러닝 기반의 모델은 서포트 벡터 머신(Support Vector Machine, SVM), 에이다부스트 (AdaBoost) 등을 포함할 수 있으나, 이에 한정되지 않는다. 도 7(a)를 참조하면, 본 발명의 일 실시예에 따른 인공 신경망은 입력층, 은닉층, 출력층 및 가중치를 포함할 수 있다. 예를 들어, 도 1은 입력층의 크기가 3, 제1 및 제2 은닉층의 크기가 4, 출력층의 크기가 1인 인공 신 경망의 구조를 나타낸다. 구체적으로 은닉층에 포함된 뉴런들은 입력층에 포함된 뉴런들과 가중치에 포함된 개 별 가중치와의 선형결합으로 연결될 수 있다. 출력층에 포함된 뉴런들은 은닉층에 포함된 뉴런들과 가중치에 포 함된 개별 가중치와의 선형 결합으로 연결될 수 있다. 그리고, 인공 신경망은 출력층에서 계산된 출력과 실제 출력의 값 차이를 최소화시키는 찾을 수 있다. 또한, 본 발명의 일 실시예에 따른 인공 신경망은 입력층의 크기가 10, 출력층의 크기가 4이고, 은닉층의 크기 를 한정하지 않는 인공 신경망 구조를 가질 수 있다. 이때, 입력층에는 세탁기(WM)의 동작과 관련된 데이터에 기초하여 학습 데이터로 결정된 데이터가 입력 데이터로 입력될 수 있다. 예를 들어, 세탁기(WM)의 동작과 관련된 rRPM(request RPM), cRPM(current RPM), Iq(q축 전류, 구동 전류), UB(편심값), 자이로 3축 및 가속도 3축 의 데이터가 입력층에 입력될 수 있다. 도 7(b)를 참조하면, 본 발명의 일 실시예에 따른 인공 신경망은 오토인코더(autoencoder)를 포함할 수 있다. 오토인코더는 원본 데이터를 인공 신경망에 입력하여 인코딩하고, 인코딩된 데이터를 디코딩함으로써 복원 (Reconstruction)하면 복원 데이터와 입력 데이터는 어느 정도 차이가 발생할 수 있는데, 이러한 차이를 이용하 는 인공 신경망이다. 예를 들어, 오토인코더는 입력층의 크기와 출력층의 크기가 각각 5로 동일하고, 제1 은닉 층의 크기가 3, 제2 은닉층의 크기가 2, 제3 은닉층의 크기가 3일 수 있으며 이와 은닉층의 노드수가 중간층으 로 갈수록 점진적으로 감소하고 출력층에 가까워질수록 점진적으로 증가하는 구조일 수 있다. 도면 7(b)에 도시 된 오토인코더는 예시적인 도면이며, 본 발명의 실시예는 이에 한정되지 않는다. 오토인코더는 원본 데이터의 입력값과 복원 데이터의 출력값을 비교하여 그 차이가 크다면 해당 데이터는 학습되지 않은 것으로 판단할 수 있고, 입력값과 출력값의 차이가 작다면 해당 데이터는 기학습된 것으로 판단할 수 있다. 따라서, 오토인코더를 이용하면 데이터의 신뢰도를 높일 수 있다. 이때, 입력값과 출력값을 비교하는 방식으로, 평균제곱오차(Mean Square Error, MSE)를 이용할 수 있다. 평균제 곱오차의 값이 커질수록 학습되지 않은 데이터일 가능성이 높은 것으로 판단할 수 있으며, 평균제곱오차의 값이 작을수록 미리 학습된 데이터일 가능성이 높은 것으로 판단할 수 있다. 도 8 및 도 9는 세탁기의 구동 프로파일의 일례를 나타낸 도면이다. 도 8을 참조하면, 도 8(a)은 세탁기(WM)의 내조와 내부의 포 유동이 없는 세탁물의 구동 프로파일을 나타 낸다. 예를 들어, 이불과 같이 부피가 큰 세탁물은 세탁기(WM)의 내조를 가득 채우고, 이로 인해 포 유동 이 거의 없거나 상대적으로 적게 관찰될 수 있다. 내조를 가득 채우는 세탁물의 경우 포 유동 식별과 관련된 데이터를 분석하면, 일반적인 세탁물과 다른 결 과값을 획득할 수 있다. 이때, 포 유동의 식별과 관련된 데이터는 세탁기(WM)에 구비된 모터의 구동 전류, RPM 등을 포함할 수 있다. 도 8(b)을 살펴보면, 그래프의 x축은 시간, y축은 세탁기(WM)의 포 유동 식별과 관련된 데이터 중 어느 하나에 해당한다. 본 발명의 일 실시예에 있어서 포 유동 식별 단계에서, 데이터 분석을 위한 구간은 안정화 구간, 데이터 추출 구간, 분류 구간으로 구분할 수 있다. 이때, 안정화 구간은 세탁기(WM)가 동작하는 동안 y축의 값이 일정한 주 기적인 특징을 나타내는데 까지 소요되는 구간을 지칭하고, 데이터 추출 구간은 일정한 주기적인 특징을 나타내 며 딥 러닝 모델에 입력데이터로서 분류되는 데이터를 추출하는 구간을 지칭하고, 분류 구간은 딥 러닝 모델을 통해 세탁물이 포 유동 유무를 식별하는 구간을 지칭한다. 도 9를 참조하면, 도 9(a)는 세탁기(WM)의 내조와 내부의 일반적인 세탁물의 구동 프로파일을 나타낸다. 이처럼, 정상적으로 동작하는 세탁기(WM)의 경우 회전하는 내조 내부에서 내조의 회전에 따라 상승낙 하 운동을 할 수 있는 세탁물을 관찰할 수 있다. 도 9(b)를 살펴보면, 일반적인 세탁물의 경우 포 유동 식별과 관련된 데이터 분석 그래프에서 주기성을 나타내지 않는다. 일반적인 세탁물은 상승낙하 운동에 따라 포 유동이 발생하게 되며, 낙하의 충격에 따라서 RPM의 변동이 일어난다. 또한, 이러한 RPM의 변동에 따라서 전류의 제어 값이 변경되어 예측 불가능한 구동 전류 패턴이 나타난다. 따라서, RPM와 구동 전류를 포함하는 포 유동의 식별 과 관련된 데이터가 데이터 분석 그래프에서 주기성을 나타내는 지 여부를 판단하여 세탁물포 유동 유무를 판별 할 수 있다. 도 10은 본 발명의 일 실시예에 따른 딥 러닝 모델을 이용한 언밸런싱 불량 예측 방법의 일례를 나타낸 도면이 다. 구체적으로, 도 10은 포 유동 식별을 위한 인공 신경망 모델을 학습하는 방법 및 학습된 포 유동 식별 모델 을 이용하여 포 유동 유무를 식별하는 방법을 나타낸다. 세탁기(WM)는 내조가 회전하는 동작을 수행하는동안 포 유동의 식별과 관련된 제어 정보를 획득할 수 있다. 이처럼 획득된 RPM과 구동 전류는 시간에 따른 데이터 프로파일로 획득할 수 있다(도 8(b), 도 9(b) 참조). 이때, 데이터 프로파일의 데이터 추출 구간에서 세탁기(WM)는 딥 러닝 학습을 위한 입력 데이터를 샘플링 (Sampling)할 수 있다. 샘플링된 데이터는 인공 신경망 모델의 입력층에 인가되고, 포 유동 가능 상태 및 포 유 동 불가능 상태에 관한 출력값은 상기 신경망 모델의 출력층에 인가된다. 이와 같은 학습을 반복하여 AI 장치 는 포 유동 식별 모델을 생성할 수 있고, 이를 AI 장치의 메모리에 저장할 수 있다. 이때, 학습 된 포 유동 식별 모델은 세타기에 구비된 AI 장치의 메모리 외에 서버로 해당 딥 러닝 모델을 전송함 으로써 서버에 저장할 수도 있다. 이때, 인공 신경망 모델은 적어도 하나의 히든 레이어를 포함할 수 있으며, 본 발명은 인공 신경망의 구조에 한 정되지 않는다. 이처럼 학습된 포 유동 식별 모델은 세탁물의 포 유동 여부의 식별에 이용될 수 있다. 구체적으로, 세탁 기(WM)가 동작하는 동안 세탁기(WM)의 포 유동 식별과 관련된 데이터가 입력층에 인가될 수 있다. 이때, 세탁기 (WM)의 포 유동 식별과 관련된 데이터는 구동 전류, RPM 등을 포함할 수 있다. 세탁기(WM)는 포 유동 식별 모델 의 출력값에 근거하여 세탁기(WM)의 포 유동 유무를 판단할 수 있다. 도 11은 본 발명의 일 실시예에 따른 언밸런싱 불량 예측의 순서도를 나타낸 도면이고, 도 12는 본 발명의 일 실시예에 따른 언밸런싱 불량을 감지하여 사용자 단말로 안내하는 일 례를 나타내는 도면이다. 도 11을 참조하면, 우선, 세탁기(WM)는 사용자 인터페이스를 통해 세탁기(WM)의 동작 코스에 관한 정보를 수신 할 수 있다(S1210). 세탁기(WM)의 코스는 모 세탁 모드(Cotton Washing Mode)와 일반 모드(Normal Mode)를 포 함할 수 있다. 본 발명의 일 실시예에서 세탁기(WM)의 코스는 특수 코스를 포함할 수 있다. 특수 코스는 세탁기 (WM)의 탈수 과정에 있어서, 일반적인 세탁물의 탈수 과정과 달리 포 분산 과정을 제외하고 탈수를 지속적으로 진행하는 코스를 지칭한다. 세탁기(WM)는 포 유동 식별 모델에 입력될 데이터를 추출하고, 포 유동 식별 모델에 입력할 수 있 다(S1215, S1220). 이때, 입력데이터는 내조의 회전 동작에 있어서 일정한 시간동안 동일한 속도로 회전하 는 구간을 포함하는 동작에서 추출될 수 있다. 예를 들어, 텀블링 과정, 포 분산 과정, 108 과정 등에서 추출될 수 있다. 세탁기(WM)는 포 유동 식별 모델의 출력값에 따라 포 유동의 유무를 판단할 수 있다(S1225). 포 유동이 존재하지 않거나 미리 설정된 기준값 미만인 경우 언밸런스 에러가 발생하는지 판단하고, 정상적인 포 유동이 존재하는 것으로 판단되는 경우 기존의 동작 상태를 지속할 수 있다(S1230,1235). 이때, 기존의 동작 상태를 유지하는 경우 언밸런스 에러의 발생 여부를 탐지하지 않고, 세탁기(WM)의 제어부의 프로세싱을 단순화 할 수 있는 효과가 있다. 포 유동이 존재하지 않거나 미리 설정된 기준값 미만인 경우 언밸런스 에러가 존재하는지 여부를 판단할 수 있 다. 예를 들어, 하나의 큰 세탁물이 세탁기(WM)의 내조를 가득 채우고 있는 경우, 서로 다른 복수개의 세 탁물로 인해 세탁기(WM)의 내조가 가득찬 경우 등이 있다. 이처럼 포 유동이 원활하지 않은 세탁물이 공급 된 경우 세탁물의 재질 또는 종류에 따라서 언밸런스 에러가 발생할 수 있다. 예를 들어, 2 가지 종류의 이불을 세탁하는 경우로서 A이불은 압축률이 큰 겨울이불이고, 다른 B이불은 압축률 이 작은 여름이불인 경우에 압축률이 큰 A이불로 인해서 내조의 일 측면에 세탁기 내조의 평균적인 압력에 비하여 상대적으로 큰 압력이 인가될 수 있다. 이때, 세탁조는 지속적으로 언밸런스 에러가 발생하는 것으로 판단하고, 언밸런스 에러수(Unbalance Error Count, UBE CNT)가 점진적으로 증가할 수 있다(도 12 참조). 이때, 언밸런스 에러가 발생하면 세탁기(WM)는 모터의 구동을 정지한 후 세탁, 헹굼 또는 탈수 과정을 재 시도할 수 있다. 세탁기(WM)는 미리 설정된 임계값 이상의 언밸런스 에러가 발생되면, 언밸런스 에러에 관한 메시지를 사용자 단 말로 전송할 수 있다(S1240). 이때, 사용자 단말은 블루투스 장치, 자율주행 차량, 로봇, 드론, AR 기기, 모바 일 기기, 가전 기기 등을 포함할 수 있다. 세탁기(WM)는 언밸런스 에러가 발생한 것으로 판단되는 경우 특수 코스로 변경할 수 있다(S1245). 특수 코스는 미리 설정된 임계값 이상의 언밸런스 에러가 감지되더라도, 언밸런스 에러가 감지된 해당 동작 과정을 반복하거 나 이전 과정으로 되돌아가지 않고 다음 동작으로 넘어갈 수 있다. 특히, 본 발명의 일 실시예에서 특수 코스는 언밸런스 에러가 감지되더라도, RPM을 점진적으로 증가시킴으로써 신속하게 세탁물의 탈수를 종료시킬 수 있다.이처럼 특수 코스를 이용함으로써, 세탁 시간 및 소모 전류를 절감할 수 있는 이점이 있다. 도 12는 언밸런스 에러가 점진적으로 증가하는 것을 관측하고, 이를 통해 원활하지 않은 포 유동으로 인한 언밸 런스 에러를 검출하는 방법을 나타낸다. 구체적으로, 제1 구간에서 언밸런스 에러수가 점진적으로 증가한다. 이 와 같은 언밸런스 에러수의 점진적인 증가는 도 11에서 전술한 바와 같이, 세탁기(WM)의 내조의 일면에 세 탁물의 압력이 지속적으로 인가되기 때문이다. 본 발명의 다양한 실시예에서 세탁기(WM)의 각각의 동작 과정 별로 미리 설정된 언밸런스 에러수의 임계값이 설 정되어 있으며, 언밸런스 에러수가 임계값을 초과하는 경우 세탁기(WM)는 다음 과정으로 건너뛰거나(Skip) 세탁 기(WM)의 동작을 종료할 수 있다. 구체적으로, 본 발명의 일 실시예에서 세탁기(WM)의 헹굼 과정 구간에서 미리 설정된 임계값 이상의 언밸런스 에러가 감지되는 경우 헹굼 과정을 중단하고 탈수 과정을 수행할 수 있다. 또한 본 발명의 일 실시에에서는 세탁기(WM)의 탈수 과정 구간에서 미리 설정된 임계값 이상의 언밸런스 에러가 감지 되는 경우 세탁기(WM)의 구동을 종료할 수 있다. 도 12의 일 례에서 제1 구간(P1)은 헹굼 과정 구간, 제2 구간(P2)은 탈수 과정 구간을 나타낸다. 예를 들어, 제 1 구간(P1)에서 세탁물은 언밸런스 에러가 약 12분부터 지속적으로 증가하고, 에러수가 40회에 이르렀을 때 헹 굼 과정을 종료하고 다음 과정을 넘어간다. 이때, 세탁기(WM)는 언밸런스 에러의 지속적인 증가를 통한 해당 헹 굼 과정의 건너뛰기 사실을 사용자 단말로 전송한다. 이후에, 제2 구간(P2)에서 세탁기(WM)의 언밸런스 에러가 약 24분부터 지속적으로 증가하고, 세탁기(WM)는 약 71분에 모든 동작을 종료하고 이러한 언밸런스 에러 발생으 로 인한 세탁기(WM)의 종료 사실을 사용자 단말로 전송한다. 도 13 및 도 14는 본 발명의 일 실시예에 따른 언밸런스 에러를 검출하거나, 언밸런스 에러가 예측되는 경우의 특수 코스의 동작 프로파일을 나타낸다. 본 발명의 일 실시예에서 세탁기(WM)는 내재된 세탁물이 포 유동이 없는 것으로 판단하고, 언밸런스 에러가 발 생하는 경우 탈수 과정을 변경하여 수행할 수 있다. 구체적으로, 언밸런스 에러가 예측되는 경우 포 분산 과정 을 수행할 필요가 없으므로, 포 분산 과정에서의 언밸런스 감지로 인한 단락을 하지 않고, 단락 전 RPM을 유지 할 수 있다. 또한, 본 발명의 일 실시예에서 단락 전 RPM을 유지할 뿐만 아니라, 언밸런스값의 변화에 대응하여 모터의 RPM을 제어할 수도 있다. 도 13을 살펴보면, 제3 구간(P3)에서 80RPM으로 탈수 과정을 수행하던 중 제1 지점(D1)에서 단락이 발생한다. 이때, 제1 지점(D1)에서 단락이 발생하더라도 모터의 동작은 정지하지 않고, 80RPM으로 탈수 과정을 지속 한다. 또한, 언밸런스값의 변화량에 근거하여 언밸런스값이 포화(saturation)되었다고 판단되거나, 언밸런스값 이 5분 이상 변동이 적은 경우 다음 탈수 과정을 수행할 수 있다. 예를 들어, 세탁기(WM)는 탈수 동작을 시작하 고 AB행정에서 언밸런스값이 포화된 것으로 판단되면 MS행정으로 진입할 수 있다. 이와 함께 모터의 RPM도 최초의 80RPM에서 90RPM까지 상승한다. 도 14를 살펴보면, 초기 탈수 과정에서 언밸런스가 감지되는 경우, 모터의 동작을 중단시키지 않고, 일정 한 시간동안 언밸런스값의 포화여부를 판단한 후 모터의 RPM을 상승하여 다음 탈수 행정을 수행하는 세탁 기(WM)의 RPM 정보 프로파일을 볼 수 있다. 도 15는 본 발명의 일 실시예에 따른 사용자의 모바일 기기로 언밸런스 에러 발생 메시지를 전송하고, 모바일 기기를 통해 메시지를 표시하는 일례를 나타내는다. 도 15를 참조하면, 세탁기(WM)는 세탁, 헹굼 또는 탈수 과정에서 언밸런스 에러를 감지하는 경우 감지된 언벨런 스 에러에 관한 정보를 포함하는 메시지를 사용자의 모바일 기기를 포함하는 사용자 단말로 전송할 수 있다. 이 때, 언밸런스 에러에 관한 정보는 세탁기 내조의 세탁물의 상태를 촬영한 이미지, 언밸런스 에러 발생 사 실, 언밸런스 에러 발생 시간, 언밸런스 에러에 대한 사용자의 응답을 수신하는 적어도 하나의 메뉴 등을 포함 할 수 있다. 본 발명의 다양한 실시예에서 세탁기(WM)는 통신 모듈을 통해서 세탁물의 포 유동이 감지되지 않는 경우 사용자 단말로 세탁기(WM)의 코스 변경과 관련된 메시지를 전송할 수 있다. 사용자는 해당 메시지에 대한 응답으로 세 탁기(WM)의 동작 코스를 변경하는 메시지를 세탁기(WM)로 전송할 수 있다. 사용자의 응답에 따라 세탁기(WM)는 특수 코스로 변경하여 세탁, 헹굼 또는 탈수 과정을 수행할 수 있다. 이때 사용자 단말은 사용자의 발화 음성을인식하거나 터치 스크린에 입력된 사용자의 터치 신호 입력하는 방식으로 사용자의 선택을 수신하여 응답을 세 탁기(WM)로 전달할 수 있다. 이때, 사용자 단말은 모바일 기기, 자동차, AI 스피커 등을 포함할 수 있다. 본 발명의 일 실시예에서 세탁기(WM)는 통신 모듈을 통해서 세탁물의 언밸런스 에러에 관한 메시지를 사용자 단 말로 전송할 수 있다. 언밸런스 에러가 발생하는 경우, 전술한 본 발명의 실시예들과 같이 특수 코스로 변경하 여 세탁을 지속할 수도 있으며, 사용자 단말로 언밸런스 에러에 관한 정보를 전송하고, 사용자의 응답에 따라 세탁기(WM)를 종료시킬 수도 있다. 또한, 본 발명의 일 실시예에서 세탁기(WM)는 스피커를 통해 언밸런스 에러에 관한 메시지를 음향으로 송출할 수 있거나, 디스플레이부를 통해 언밸런스 에러에 관한 메시지를 표시할 수 있다. 도 16은 본 발명의 일 실시예에 따른 언밸런스 에러가 발생하는 경우 사용자 단말로 안내 메시지를 전송 방법을 나타낸다. 도 16을 참조하면, 본 발명의 일 실시예에서 AI 장치는 세탁기(WM)에 구비되어 있는 경우뿐만 아니라, 외부 의 서버에 구비되어 있을 수도 있다. 외부의 서버는 세탁기(WM)로부터 수신한 모터의 구동 전류 또는 RPM에 관 한 정보를 수신할 수 있다. 이때, 서버의 AI 장치는 세탁기(WM)의 모터의 구동 전류 또는 RPM에 관한 정보 바탕으로 포 유동 식별 모델을 학습시키고, 포 유동 식별 모델에 이용하여 포 유동 유무를 판 단할 수 있다. 포 유동이 감지되지 않는 경우 서버는 세탁기(WM)를 포함하는 사용자의 단말로 포 유동 미발생에 관한 메시지를 전송할 수 있다. 이때, 서버는 적어도 하나의 세탁기(WM)로부터 포 유동 식별 모델의 학습 데이터를 수신할 수 있고, 포 유동 식별 모델을 반복하여 학습하여 언밸런스 에러의 검출 및 그 대응 방법에 이용할 수 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것도 포함한다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항 의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함 된다. 부호의 설명도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2019-0101988", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 발명에 대한 실시예를 제공 하고, 상세한 설명과 함께 본 발명의 기술적 특징을 설명한다. 도 1은 AI 장치의 일 실시예를 나타내는 개념도이다. 도 2는 본 명세서에서 제안하는 방법들이 적용될 수 있는 무선 통신 시스템의 블록 구성도를 예시한다. 도 3은 무선 통신 시스템에서 신호 송/수신 방법의 일례를 나타낸 도이다. 도 4는 5G 통신 시스템에서 사용자 단말과 5G 네트워크의 기본동작의 일 예를 나타낸다. 도 5는 본 발명의 일 실시예에 따른 세탁기의 블록도이다. 도 6은 본 발명의 일 실시예에 따른 AI 장치의 블록도이다. 도 7은 본 발명의 일 실시예에 따른 인공 신경망을 나타내는 도면이다. 도 8 및 도 9는 세탁기의 구동 프로파일의 일례를 나타낸 도면이다. 도 10은 본 발명의 일 실시예에 따른 딥 러닝 모델을 이용한 언밸런싱 불량 예측 방법의 일례를 나타낸 도면이 다. 도 11는 본 발명의 일 실시예에 따른 언밸런싱 불량 예측의 순서도를 나타낸 도면이고, 도 12는 본 발명의 일 실시예에 따른 언밸런싱 불량을 감지하여 사용자 단말로 안내하는 일 례를 나타내는 도면이다. 도 13 및 도 14는 본 발명의 일 실시예에 따른 언밸런스 에러를 검출하거나, 언밸런스 에러가 예측되는 경우의 특수 코스의 동작 프로파일을 나타낸다. 도 15는 본 발명의 일 실시예에 따른 사용자의 모바일 기기로 언밸런스 에러 발생 메시지를 전송하고, 모바일기기를 통해 메시지를 표시하는 일례를 나타내는다. 도 16은 본 발명의 일 실시예에 따른 언밸런스 에러가 발생하는 경우 사용자 단말로 안내 메시지를 전송 방법을 나타낸다. 본 발명에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 발명에 대한 실시예를 제공 하고, 상세한 설명과 함께 본 발명의 기술적 특징을 설명한다."}
