{"patent_id": "10-2021-7024094", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0097828", "출원번호": "10-2021-7024094", "발명의 명칭": "AI 예측에 기반한 지능형 터미널 에너지 절약 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "선 하이"}}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 지능(artificial intelligence, AI) 예측에 기반한 방법으로서,단말에서 APP(application)-related 동작(operation) 데이터를 수집(collect)하는 과정과,백그라운드(background)에서 APP을 제한하기 위한 타이밍 및 제한 측정(restriction measurement)을 예측하기위해 상기 APP-related 동작 데이터에 대한 AI 분석을 수행(carry out)하는 과정과,상기 예측된 타이밍에 상기 백그라운드에서 상기 APP을 제한하기 위해 상기 제한 측정을 채택(adopt)하는 과정을 포함하는 방법."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 APP이 포그라운드(foreground)에서 동작하는 경우, 중앙 처리 장치(central processing unit, CPU)/더블데이터 속도(double data rate, DDR)/그래픽 처리 장치 (graphics processing unit, GPU)의 최적 주파수(optimum frequency)를 결정 및 기록하는 과정과,상기 포그라운드에 있는 APP의 전력 소비가 비정상인 경우, 상기 CPU/DDR/GPU의 주파수를 상기 최적 주파수로설정하거나 사용자에게 상기 APP의 업그레이드를 요청하는 과정을 더 포함하는 방법."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항 중에서 어느 한 항에 있어서, 상기 백그라운드에서 APP을 제한하기 위한 타이밍 및 제한 측정을 예측하는 과정은,상기 APP을 사용하는 사용자 습관(user habit) 및 현재(current) 시나리오에 따라 미래(future)의 상기 APP을사용하는 주기를 예측 및 분류하는 과정과,분류 결과에 따라 상기 백그라운드에서 상기 APP의 전력 소비를 제한하기 위해 대응하는(corresponding) 제한측정을 채택하는 과정을 포함하는 방법."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 미래의 상기 APP을 사용하는 주기를 예측하고 분류하는 과정은,상기 APP을 사용하는 사용자 습관 및 상기 현재 시나리오에 따라 사용자가 다음(next time)에 상기 포그라운드에서 상기 APP을 다시(again) 사용하는 때인 시간 T를 예측하는 과정과,T>T1인 경우(if T>T1), 상기 APP을 상기 미래에 거의 사용되지 않음(rarely used)을 나타내는 클래스 1로 분류하는 과정과, 그렇지 않으면(or otherwise),T>T2인 경우(if T>T2), 상기 APP을 상기 미래에 가끔 사용됨(occasionally used)을 나타내는 클래스 2로 분류하는 과정과, 그렇지 않으면(or otherwise),T>T3인 경우(if T>T3), 상기 APP을 상기 미래에 일반적으로 사용됨을(normally used) 나타내는 클래스 3으로 분류하는 과정과, 그렇지 않으면(or otherwise),상기 APP을 상기 미래에 자주 사용됨을(frequently used) 나타내는 클래스 4로 분류하는 과정을 포함하고,공개특허 10-2021-0097828-3-T1, T2, 및 T3은 미리 설정된 시간 기준이고, T1>T2>T3>0인 방법."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 분류 결과에 따라 상기 백그라운드에서 상기 APP의 전력 소비를 제한하기 위해 대응하는제한 측정을 채택하는 과정은,클래스 1의 APP에 대해, 클래스 1의 상기 APP을 즉시 동결하기 위해 상기 백그라운드에 대응하는(corresponding) 제한 측정을 결정하는 과정과,클래스 2의 APP에 대해, 시간 t1 후에 클래스 2의 상기 APP을 동결하기 위해 상기 백그라운드에 대응하는 제한측정을 결정하는 과정과,클래스 3의 APP에 대해, 시간 t1+t2 후에 클래스 2의 상기 APP을 동결하기 위해 상기 백그라운드에 대응하는 제한 측정을 결정하는 과정과,클래스 4의 APP에 대해, 클래스 4의 상기 APP을 동결하지 않도록 상기 백그라운드에 대응하는 제한 측정을 결정하는 과정을 포함하고,t1 및 t2는 미리 설정된 시간인 방법."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 또는 제2항 중에서 어느 한 항에 있어서, 상기 APP-related 동작 데이터는, 상기 APP의 런타임(runtime)동안의 시스템 상태 변경 정보 및 APP 전력 소비 정보를 포함하고,상기 시스템 상태 변경 정보는 네트워크 상태 변경, 블루투스 상태 변경, GPS(global positioning system) 상태변경, 위치 정보 변경, 또는 CPU/DDR/GPU 주파수 중에서 적어도 하나를 포함하고,상기 APP 전력 소비 정보는 포그라운드 전력 소비, 백그라운드 전력 소비, 상기 포그라운드에서의 실행의 수(anumber of runs), 상기 백그라운드에서의 실행의 수, 포그라운드 런타임, 또는 백그라운드 런타임 중에서 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "인공 지능(artificial intelligence, AI) 예측에 기반한 장치로서,데이터 수집 모듈(data collection module)과, 데이터 분석 모듈(data analysis module)과, 결정 실행 모듈(decision execution module)을 포함하고,상기 데이터 수집 모듈은, 단말에서 APP(application)-related 동작(operation) 데이터를 수집(collect)하도록구성되고,상기 데이터 분석 모듈은, APP을 제한하기 위한 타이밍 및 제한 측정(restriction measurement)을 예측하기 위해 상기 APP-related 동작 데이터에 대한 AI 분석을 수행(carry out)하고, 상기 결정 실행 모듈에 대응하는(corresponding) 명령을 전송하도록 구성되고,상기 결정 실행 모듈은, 상기 데이터 분석 모듈에서 전송된 명령을 수신하고, 상기 예측된 타이밍에 상기 백그라운드에서 상기 APP을 제한하기 위해 상기 제한 측정을 채택(adopt)하도록 구성되는 장치."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 데이터 분석 모듈은,상기 APP이 포그라운드(foreground)에서 동작하는 경우, 중앙 처리 장치(central processing unit, CPU)/더블공개특허 10-2021-0097828-4-데이터 속도(double data rate, DDR)/그래픽 처리 장치 (graphics processing unit, GPU)의 최적 주파수(optimum frequency)를 결정 및 기록하고,상기 포그라운드에 있는 APP의 전력 소비가 비정상인 경우, 상기 CPU/DDR/GPU의 주파수를 상기 최적 주파수로설정하거나 사용자에게 상기 APP의 업그레이드를 요청하도록 더 구성되는 장치."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항 또는 제8항 중에서 어느 한 항에 있어서, 상기 데이터 분석 모듈은,상기 APP을 사용하는 사용자 습관(user habit) 및 현재(current) 시나리오에 따라 미래(future)의 상기 APP을사용하는 주기를 예측 및 분류하고,분류 결과에 따라 상기 백그라운드에서 상기 APP의 전력 소비를 제한하기 위해 대응하는 제한 측정을 채택하도록 더 구성되는 장치."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 데이터 분석 모듈은,상기 APP을 사용하는 사용자 습관 및 상기 현재 시나리오에 따라 사용자가 다음(next time)에 상기 포그라운드에서 상기 APP을 다시(again) 사용하는 때인 시간 T를 예측하고,T>T1인 경우(if T>T1), 상기 APP을 상기 미래에 거의 사용되지 않음(rarely used)을 나타내는 클래스 1로 분류하고, 그렇지 않으면(or otherwise),T>T2인 경우(if T>T2), 상기 APP을 상기 미래에 가끔 사용됨(occasionally used)을 나타내는 클래스 2로 분류하고, 그렇지 않으면(or otherwise),T>T3인 경우(if T>T3), 상기 APP을 상기 미래에 일반적으로 사용됨을(normally used) 나타내는 클래스 3으로 분류하고, 그렇지 않으면(or otherwise),상기 APP을 상기 미래에 자주 사용됨을(frequently used) 나타내는 클래스 4로 분류하도록 더 구성되고,T1, T2, 및 T3은 미리 설정된 시간 기준이고, T1>T2>T3>0인 장치."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 데이터 분석 모듈은,클래스 1의 APP에 대해, 클래스 1의 상기 APP을 즉시 동결하기 위해 상기 백그라운드에 대응하는(corresponding) 제한 측정을 결정하고,클래스 2의 APP에 대해, 시간 t1 후에 클래스 2의 상기 APP을 동결하기 위해 상기 백그라운드에 대응하는 제한측정을 결정하고,클래스 3의 APP에 대해, 시간 t1+t2 후에 클래스 2의 상기 APP을 동결하기 위해 상기 백그라운드에 대응하는 제한 측정을 결정하고,클래스 4의 APP에 대해, 클래스 4의 상기 APP을 동결하지 않도록 상기 백그라운드에 대응하는 제한 측정을 결정하도록 더 구성되고,t1 및 t2는 미리 설정된 시간인 장치."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항 또는 제8항 중에서 어느 한 항에 있어서, 상기 APP-related 동작 데이터는, 상기 APP의 런타임(runtime)공개특허 10-2021-0097828-5-동안의 시스템 상태 변경 정보 및 APP 전력 소비 정보를 포함하고,상기 시스템 상태 변경 정보는 네트워크 상태 변경, 블루투스 상태 변경, GPS(global positioning system) 상태변경, 위치 정보 변경, 또는 CPU/DDR/GPU 주파수 중에서 적어도 하나를 포함하고,상기 APP 전력 소비 정보는 포그라운드 전력 소비, 백그라운드 전력 소비, 상기 포그라운드에서의 실행의 수(anumber of runs), 상기 백그라운드에서의 실행의 수, 포그라운드 런타임, 또는 백그라운드 런타임 중에서 적어도 하나를 포함하는 장치."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서, 상기 제한 측정은,CPU/DDR/GPU 주파수 제한 또는 메모리 사용 제한 중에서 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2021-7024094", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서, 상기 제한 측정은,CPU/DDR/GPU 주파수 제한 또는 메모리 사용 제한 중에서 적어도 하나를 포함하는 장치."}
{"patent_id": "10-2021-7024094", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시(disclosure)는 인공 지능(artificial intelligence, AI) 예측에 기반한 지능형 단말(intelligent terminal) 에너지 절약 방법을 개시한다. 본 개시의 실시 예들에 따를 때, 단말에서 APP(application)-related 동작(operation) 데이터를 수집(collect)하는 과정과, 백그라운드(background)에서 APP을 제한하기 위한 타이밍 및 제한(restriction) 측정을 예측하기 위해 상기 APP-related 동작 데이터에 대한 AI 분석을 수행(carry out) 하는 과정과, 상기 예측된 타이밍에 상기 백그라운드에서 상기 APP을 제한하기 위해 상기 제한 측정을 채택 (adopt)하는 과정을 포함한다. 방법에 대응하여, AI 예측에 기반한 지능형 단말 에너지 절약 장치를 더 개시한다. 본 개시에 기재된 방안(scheme)을 이용하여, 사용자 경험에 영향을 주지 않고, 휴대용 지능형 단말에 서 애플리케이션들의 전력 소비를 줄일 수 있으며, 배터리 수명을 연장할 수 있다."}
{"patent_id": "10-2021-7024094", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공 지능 기술 분야에 관한 것으로, 특히 인공 지능 예측 기반의 지능형 단말 에너지 절약 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-7024094", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 폰, 태블릿 컴퓨터와 같은 지능형 단말이 점점 더 자주 사용됨에 따라 전력 소비 문제가 점점 더 두드러 진다. 따라서 단말의 전력 소비를 줄이고 배터리 수명을 연장하는 것은 사용자 경험 향상에 의미가 있다. 현재 지능형 단말에는 많은 수의 애플리케이션(APP)들이 있으며 애플리케이션의 품질은 다양하다. 일반적으로 지능형 터미널의 전력 중 상당 부분이 애플리케이션에서 소비된다. 애플리케이션이 소비하는 전력은 포그라운드 (foreground)와 백그라운드(background)의 두 부분으로 구성되며 포그라운드는 사용자와의 상호 측정을 담당하 고 백그라운드는 다양한 서비스를 실행하는 역할을 한다. 일부 애플리케이션은 백그라운드에서 빈번한 활동을 수행하며 대부분의 경우 불필요하지만 많은 양의 전력을 낭비하고 배터리 수명을 단축한다. 한편, 일부 애플리 케이션은 자주 업데이트되며 일부 애플리케이션 버전은 이러한 애플리케이션 버전이 포그라운드(foreground)에 서 사용될 때 상당히 높은 전력 소비를 보인다. 따라서 사용자 경험(user experience)에 영향을 주지 않고 지능형 단말(intelligent terminal)에서 전력을 절 약하고 전력 소비를 줄이는 것이 의미가 있다."}
{"patent_id": "10-2021-7024094", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시(disclosure)의 일 측면(aspect)은 AI 예측(prediction)에 기반하여, 사용자 경험(user experience)에 영향을 주지 않으면서, 휴대용 지능형 단말기에서 애플리케이션의 전력 소비를 줄이고, 배터리 수명을 연장하기 위한 지능형 단말(intelligent terminal) 에너지 절약 방법 및 장치를 제공한다."}
{"patent_id": "10-2021-7024094", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 인공 지능(artificial intelligence, AI) 예측에 기반한 지능형 단말 에너지 절약 방법을 개시하고, 단말에서 APP(application)-related 동작(operation) 데이터를 수집(collect)하는 과정과, 백그라운드(background)에서 APP을 제한하기 위한 타이밍 및 제한 측정(restriction measurement)을 예측하기 위해 상기 APP-related 동작 데이터에 대한 AI 분석을 수행(carry out)하는 과정과, 상기 예측된 타이밍에 상기 백그라운드에서 상기 APP을 제한하기 위해 상기 제한 측정을 채택(adopt)하는 과정을 포함한다. 바람직하게, 방법은, 상기 APP이 포그라운드(foreground)에서 동작하는 경우, 중앙 처리 장치(central processing unit, CPU)/더블 데이터 속도(double data rate, DDR)/그래픽 처리 장치 (graphics processing unit, GPU)의 최적 주파수 (optimum frequency)를 결정 및 기록하는 과정과, 상기 포그라운드에 있는 APP의 전력 소비가 비정상인 경우, 상기 CPU/DDR/GPU의 주파수를 상기 최적 주파수로 설정하거나 사용자에게 상기 APP의 업그레이드를 요청하는 과정을 더 포함한다. 바람직하게, 상기 백그라운드에서 APP을 제한하기 위한 타이밍 및 제한 측정을 예측하는 과정은, 상기 APP을 사용하는 사용자 습관(user habit) 및 현재(current) 시나리오에 따라 미래(future)의 상기 APP을 사용하는 주기를 예측 및 분류하는 과정과, 분류 결과에 따라 상기 백그라운드에서 상기 APP의 전력 소비를 제한하기 위해 대응하는(corresponding) 제한 측정을 채택하는 과정을 포함한다. 바람직하게, 상기 미래의 상기 APP을 사용하는 주기를 예측하고 분류하는 과정은, 상기 APP을 사용하는 사용자 습관 및 상기 현재 시나리오에 따라 사용자가 다음(next time)에 상기 포그라운드 에서 상기 APP을 다시(again) 사용하는 때인 시간 T를 예측하는 과정과, T>T1인 경우(if T>T1), 상기 APP을 상기 미래에 거의 사용되지 않음(rarely used)을 나타내는 클래스 1로 분류 하는 과정과, 그렇지 않으면(or otherwise), T>T2인 경우(if T>T2), 상기 APP을 상기 미래에 가끔 사용됨(occasionally used)을 나타내는 클래스 2로 분류 하는 과정과, 그렇지 않으면(or otherwise), T>T3인 경우(if T>T3), 상기 APP을 상기 미래에 일반적으로 사용됨을(normally used) 나타내는 클래스 3으로 분 류하는 과정과, 그렇지 않으면(or otherwise), 상기 APP을 상기 미래에 자주 사용됨을(frequently used) 나타내는 클래스 4로 분류하는 과정을 포함하고, T1, T2, 및 T3은 미리 설정된 시간 기준이고, T1>T2>T3>0일 수 있다. 바람직하게, 상기 분류 결과에 따라 상기 백그라운드에서 상기 APP의 전력 소비를 제한하기 위해 대응하는 제한 측정을 채택하는 과정은, 클래스 1의 APP에 대해, 클래스 1의 상기 APP을 즉시 동결하기 위해 상기 백그라운드에 대응하는 (corresponding) 제한 측정을 결정하는 과정과, 클래스 2의 APP에 대해, 시간 t1 후에 클래스 2의 상기 APP을 동결하기 위해 상기 백그라운드에 대응하는 제한 측정을 결정하는 과정과, 클래스 3의 APP에 대해, 시간 t1+t2 후에 클래스 2의 상기 APP을 동결하기 위해 상기 백그라운드에 대응하는 제 한 측정을 결정하는 과정과, 클래스 4의 APP에 대해, 클래스 4의 상기 APP을 동결하지 않도록 상기 백그라운드에 대응하는 제한 측정을 결정 하는 과정을 포함하고, t1 및 t2는 미리 설정된 시간일 수 있다. 바람직하게, 상기 APP-related 동작 데이터는, 상기 APP의 런타임(runtime) 동안의 시스템 상태 변경 정보 및 APP 전력 소비 정보를 포함하고, 상기 시스템 상태 변경 정보는 네트워크 상태 변경, 블루투스 상태 변경, GPS(global positioning system) 상태 변경, 위치 정보 변경, 또는 CPU/DDR/GPU 주파수 중에서 적어도 하나를 포함하고, 상기 APP 전력 소비 정보는 포그라운드 전력 소비, 백그라운드 전력 소비, 상기 포그라운드에서의 실행의 수(a number of runs), 상기 백그라운드에서의 실행의 수, 포그라운드 런타임, 또는 백그라운드 런타임 중에서 적어 도 하나를 포함할 수 있다. 본 개시는 인공 지능(artificial intelligence, AI) 예측에 기반한 지능형 단말 에너지 절약 장치를 더 개시하 고, 데이터 수집 모듈(data collection module)과, 데이터 분석 모듈(data analysis module)과, 결정 실행 모듈 (decision execution module)을 포함하고, 상기 데이터 수집 모듈은, 단말에서 APP(application)-related 동작(operation) 데이터를 수집(collect)하도록 구성되고, 상기 데이터 분석 모듈은, APP을 제한하기 위한 타이밍 및 제한 측정(restriction measurement)을 예측하기 위 해 상기 APP-related 동작 데이터에 대한 AI 분석을 수행(carry out)하고, 상기 결정 실행 모듈에 대응하는 (corresponding) 명령을 전송하도록 구성되고, 상기 결정 실행 모듈은, 상기 데이터 분석 모듈에서 전송된 명령을 수신하고, 상기 예측된 타이밍에 상기 백그 라운드에서 상기 APP을 제한하기 위해 상기 제한 측정을 채택(adopt)하도록 구성될 수 있다. 바람직하게, 상기 데이터 분석 모듈은, 상기 APP이 포그라운드(foreground)에서 동작하는 경우, 중앙 처리 장치(central processing unit, CPU)/더블 데이터 속도(double data rate, DDR)/그래픽 처리 장치 (graphics processing unit, GPU)의 최적 주파수 (optimum frequency)를 결정 및 기록하고, 상기 포그라운드에 있는 APP의 전력 소비가 비정상인 경우, 상기 CPU/DDR/GPU의 주파수를 상기 최적 주파수로 설정하거나 사용자에게 상기 APP의 업그레이드를 요청하도록 더 구성될 수 있다. 바람직하게, 상기 데이터 분석 모듈은, 상기 APP을 사용하는 사용자 습관(user habit) 및 현재(current) 시나리오에 따라 미래(future)의 상기 APP을 사용하는 주기를 예측 및 분류하고, 분류 결과에 따라 상기 백그라운드에서 상기 APP의 전력 소비를 제한하기 위해 대응하는 제한 측정을 채택하도록 더 구성될 수 있다. 바람직하게, 상기 데이터 분석 모듈은, 상기 APP을 사용하는 사용자 습관 및 상기 현재 시나리오에 따라 사용자가 다음(next time)에 상기 포그라운드 에서 상기 APP을 다시(again) 사용하는 때인 시간 T를 예측하고, T>T1인 경우(if T>T1), 상기 APP을 상기 미래에 거의 사용되지 않음(rarely used)을 나타내는 클래스 1로 분류 하고, 그렇지 않으면(or otherwise), T>T2인 경우(if T>T2), 상기 APP을 상기 미래에 가끔 사용됨(occasionally used)을 나타내는 클래스 2로 분류 하고, 그렇지 않으면(or otherwise), T>T3인 경우(if T>T3), 상기 APP을 상기 미래에 일반적으로 사용됨을(normally used) 나타내는 클래스 3으로 분 류하고, 그렇지 않으면(or otherwise), 상기 APP을 상기 미래에 자주 사용됨을(frequently used) 나타내는 클래스 4로 분류하도록 더 구성되고, T1, T2, 및 T3은 미리 설정된 시간 기준이고, T1>T2>T3>0일 수 있다. 바람직하게, 상기 데이터 분석 모듈은, 클래스 1의 APP에 대해, 클래스 1의 상기 APP을 즉시 동결하기 위해 상기 백그라운드에 대응하는 (corresponding) 제한 측정을 결정하고, 클래스 2의 APP에 대해, 시간 t1 후에 클래스 2의 상기 APP을 동결하기 위해 상기 백그라운드에 대응하는 제한 측정을 결정하고, 클래스 3의 APP에 대해, 시간 t1+t2 후에 클래스 2의 상기 APP을 동결하기 위해 상기 백그라운드에 대응하는 제 한 측정을 결정하고, 클래스 4의 APP에 대해, 클래스 4의 상기 APP을 동결하지 않도록 상기 백그라운드에 대응하는 제한 측정을 결정 하도록 더 구성되고, t1 및 t2는 미리 설정된 시간일 수 있다. 바람직하게, 상기 APP-related 동작 데이터는, 상기 APP의 런타임(runtime) 동안의 시스템 상태 변경 정보 및 APP 전력 소비 정보를 포함하고, 상기 시스템 상태 변경 정보는 네트워크 상태 변경, 블루투스 상태 변경, GPS(global positioning system) 상태 변경, 위치 정보 변경, 또는 CPU/DDR/GPU 주파수 중에서 적어도 하나를 포함하고, 상기 APP 전력 소비 정보는 포그라운드 전력 소비, 백그라운드 전력 소비, 상기 포그라운드에서의 실행의 수(a number of runs), 상기 백그라운드에서의 실행의 수, 포그라운드 런타임, 또는 백그라운드 런타임 중에서 적어 도 하나를 포함할 수 있다."}
{"patent_id": "10-2021-7024094", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 기술적인 방안(technical schemes)에서 알 수 있듯이, 본 개시는 AI 예측에 기반한 지능형 장치 에너지 절약 방법 및 장치, AI 기술을 통해 지능형 단말에서 실행되는 각 APP들의 특성을 학습하고, 각 APP들의 사용 주기를 분류하고, 각각의 APP들이 전경과 배경에서 실행되는 시간을 예측한다. 자주 사용하지 않거나 최근에 사용하지 않지만 백그라운드에서 실행되는 일부 APP들의 경우, 방법 및 장치는 APP들이 백그라운드에서 실행되는 것을 직접 제한하고, 그리고 비정상적인 전력 소비가 발생하는 포그라운드의 일부 APP들의 경우, 방법 및 장치는 사용하는 리소스들을 제한하여 에너지 절약 및 전력 소비 감소의 목적을 달 성한다."}
{"patent_id": "10-2021-7024094", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적(object), 기술적인 방안들(technical schemes) 및 장점들(advantages)을 보다 명확하게 하기 위해 도면을 참조하여 이하의 실시 예들에 따라 본 발명을 더 설명한다. 실제(practical) 애플리케이션 시나리오에서 일부 APP들은 사용자가 인식하지 못한 채로 지능형 단말 (intelligent terminal)의 백그라운드(background)에서 실행되므로 전력을 낭비한다. 그러나 백그라운드에서 APP들을 제한해도 사용자 경험에는 영향을 미치지 않는다. 이러한 분석을 바탕으로, 본 개시에서는 백그라운드 에서 불필요한 APP들의 활동을 효율적으로 제한하고 포그라운드(foreground)에서 APP의 비정상적인 전력 소비를 줄임으로써, 사용자 경험(user experience)에 영향을 미치지 않으면서 에너지를 절약하고 전력 소비를 줄이며 배터리 수명을 개선하는 것을 제안한다. 현재, AI 기술은 매우 인기가 있다. 본 개시는 주로(mainly) AI 기술을 사용하여 지능형 단말에서 에너지 절약 을 달성한다. 구체적으로, 본 개시는 AI 예측(AI prediction)에 기반한 지능형 단말 에너지 절약 방법 및 장치 를 제공하고, 사용자의 지능형 단말의 사용 습관(habit)을 기록하고 학습하여 AI 기술을 통한 AI 예측 모델(AI prediction model)을 획득하고, AI 예측 모델에 따라 현재(current) 시나리오 모드를 기반으로 지능형 단말의 포그라운드 및 백그라운드에서 실행되는 APP들을 제한하는 것이 사용자 경험에 영향을 미치는지 여부를 결정하 고, 사용자 경험에 영향을 미치지 않는 경우, 전력 소비를 줄이는 목적을 달성하기 위해 포그라운드 및 백그라 운드에서 실행되는 APP들에 대응하는(corresponding) 제한 측정(restriction measurement)을 채택한다. 본 개시에서 제공하는 AI 예측(AI prediction) 기반 지능형 단말 에너지 절약 장치(intelligent terminal energy saving device)의 구조는 도 1과 같다. 이 장치는 데이터 수집 모듈(data collection module), 데이터 분석 모듈(data analysis module), 및 결정 실행 모듈(decision execution module)을 포함한다. 지능형 단말을 위한 에너지 절약 장치에서 각 모듈의 기능들(functions) 및 동작들(operations)은 도 2에 나타난 AI 예측에 기 반한 지능형 단말 에너지 절약 방법의 흐름에 관한 개략도와 결합하여 더 설명될 것이다. 1. 데이터 수집 모듈은 APP-related 동작(operation) 데이터를 수집한다. 수집해야 하는 데이터는 다음을 포함한다: APP 런타임(run time) 동안의 시스템 상태 변경 정보 및 APP 전력 소 비 정보, 여기서(in which): 시스템 상태 변경 정보는 포함하나, 이에 국한되지는 않는다: 네트워크 상태 변경, 블루투스 상태 변경, GPS 상 태 변경, 위치 정보 변경, 또는 CPU/DDR/GPU 주파수. APP 전력 소비 정보는 포함하나, 이에 국한되지는 않는다: 포그라운드 전력 소비, 백그라운드 전력 소비, 상기 포그라운드에서의 실행의 수(a number of runs), 상기 백그라운드에서의 실행의 수, 포그라운드 런타임, 또는 백그라운드 런타임. 수집된 데이터는, 데이터 분석 모듈이 APP의 동작 특성(operating characteristics)을 결정하기 위해 AI를 사용 하여 분석을 수행하기 위하여, 데이터 분석 모듈로 전송된다. 2. 데이터 분석 모듈은 데이터 수집 모듈에서 수집된 APP-related 동작 데이터에 대한 AI 분석 및 예측을 수행 한다. 도 3과 같이, AI 예측의 원리(principle)는 다음과 같다: AI 훈련 및 학습을 수행하기 위해 데이터 수집 모듈에 의해 수집된 지능형 단말을 이용하여, 사용자에 관한 히 스토리 데이터를 사용하여 AI 예측 모델을 구축하는 과정과, AI 예측 모델을 획득한 후, 미래(future)의 알려지 지 않은 속성(unknown attribute)들을 자동으로 예측하기 위해 데이터 수집 모듈에서 수집된 새로운 데이터를 AI 예측 모델에 입력하는 과정을 포함한다. 포그라운드에서 실행되는 APP의 경우, AI 예측 모델은 APP의 시스템 상태 변화 특성들과 행동 특성들을 분석하 여 포그라운드에서 실행되는 APP의 전력 소비가 정상(normal)인지 여부를 결정하고, APP이 포그라운드에서 실행 될 때, CPU/DDR/GPU의 최적 주파수를 결정하고 분석 결과를 사용하여 데이터베이스를 업데이트한다. APP의 전력 소비가 이전 버전보다 현저히 높을 경우, AI 예측 모델은 CPU/DDR/GPU의 최적 주파수(optimum frequency)를 설 정하도록 결정 실행 모듈에 알린다. 백그라운드에서 실행되는 APP의 경우, AI 예측 모델은 APP 사용 습관 및 현재 시나리오의 특성들에 따라 미래의 백그라운드 APP을 사용하는 주기를 예측 및 분류하고, 분류 결과에 따라 백그라운드 APP의 전력 소비를 제한한 다. 구체적으로, 미래의 백그라운드 미래의 백그라운드 APP을 사용하는 주기를 예측하고 분류하는 방법은: APP 을 사용하는 습관 및 현재 시나리오의 특성들에 따라 사용자가 다음에 포그라운드에서 APP을 다시 사용하는 때 인 시간 T(이하 \"APP-to-foreground-again\")를 예측하는 과정과, 미리 설정된 시간 기준에 따라 미래의 APP이 사용되는 주기를 예측 및 분류하는 과정을, 도 4와 같이, 포함한다: APP-to-foreground-again 시간이 T>T1인 경우, 상기 APP은 상기 미래에 거의 사용되지 않음(rarely used)을 나 타내는 클래스 1로 분류된다, 그렇지 않으면(or otherwise), APP-to-foreground-again 시간이 T>T2인 경우, 상기 APP은 상기 미래에 가끔 사용됨(occasionally used)을 나 타내는 클래스 2로 분류된다, 그렇지 않으면(or otherwise), APP-to-foreground-again 시간이 T>T3인 경우, 상기 APP은 상기 미래에 일반적으로 사용됨을(normally used) 나타내는 클래스 3으로 분류된다, 그렇지 않으면(or otherwise), 상기 APP은 상기 미래에 자주 사용됨을(frequently used) 나타내는 클래스 4로 분류된다; 여기서 T1, T2 및 T3은 미리 설정된 시간 기준이고, T1>T2>T3>0이다. 사용 주기의 분류에 따라 다른 클래스마다 다른 제한 측정을 채택할 수 있으며, 현재 APP이 백그라운드에서 실 행될 때, 사용자 경험(user experience)에 영향을 주지 않고 APP 제한을 시작할 시간이 결정된다. 한편 (meanwhile), 버전에 비정상인 전력 소비가 있는지 여부를 결정하기 위하여, APP의 다른 버전들의 전력 소비가 비교될 수 있다.위의 4가지 AI 예측 클래스들에 대응하여, 본 개시는 다른 백그라운드 제한 측정을 채택하고, 도 5는 AI 예측, 분류, 및 백그라운드 제한 측정 간의 대응 관계에 대한 개략도를 보여준다: 클래스 1의 경우, 미래에 거의 사용되지 않도록, 대응하는 백그라운드 제한 측정은 즉시 동결(freeze)하는 것이다; 클래스 2의 경우, 미래에 가끔 사용되도록, 대응하는 백그라운드 제한 측정은 일정 시간 t1 후에 이를 동결하는 것이다; 클래스 3의 경우, 미래에 일반적으로 사용되도록, 대응하는 백그라운드 제한 측정은 일정 시간 t1+t2 후에 이를 동결하는 것이다; 및 클래스 4의 경우, 미래에 자주 사용되도록, 대응하는 제한 측정은 이를 동결하지 않는 것이다; 여기서 t1과 t2는 미리 설정된 시간이다. 3. 결정 실행 모듈은 AI 분석 결과에 따른 결정을 실행하는 역할을 한다. 데이터 분석 모듈에 대한 설명에서 볼 수 있듯이, APP 제한이 사용자 경험에 영향을 미치는지 여부를 결정하기 위해 AI 예측 모델은 현재 동작 시나리오(operating scenario)의 특성들에 따라 백그라운드 APP들을 분석한다. 앱 제한이 사용자 경험에 영향을 미치는지 여부를 결정하고, 그렇지 않다면, AI 예측 모델은 결정 실행 모듈에 제한 명령을 보낼 때를 예측하고, 그런 다음(then) AI 예측 모델은 결정 실행 모드에 제한 명령을 보낼 때를 예 측하고, 예측 결과에 따라 결정 실행 모듈에 제한 명령을 전송하고, 결정 실행 모듈이 제한 명령을 수신한 후, 대응하는 APP를 제한한다. 명령어가 다양하기 때문에, 제한 측정에는 다음이 포함될 수 있다, 하지만 이에 국한 되지는 않는다: 킬링(killing), 동결(freezing), CPUSet 제한(대형 및 소형 코어들), CPU/DDR/GPU 주파수 제한, 메모리 사용량 제한 등이 포함될 수 있다. 백그라운드에서 실행되는 APP의 경우, AI 예측 모델에 따라 APP 사용 주기를 구분하여 방안(scheme) 선택을 위 한 세부 절차는 도 5와 같다: 거의 사용되지 않는 APP(예: 클래스 1)의 경우 동결 동작(즉, 킬링 프로세스)이 실행된다; 자주 사용되는 APP(예: 클래스 4)의 경우 제한되지 않는다; 위의 두 가지 경우에 해당하지 않는 APP(예: 평균(average) 주기로 사용되는 APP, 예: 클래스 2 및 클래스 3)의 경우, 동결 동작이 수행된다. 그런 다음, 동결 동작이 수행되는 백그라운드 APP의 경우, AI가 예측한 대기 시간에 도달하면 동결 동작을 수행 한다. 포그라운드에서 실행되는 APP의 경우, 데이터 분석 모듈이 결정하는 경우, 분석을 통해, 현재 버전의 APP에 비 정상적인 전력 소비가 있는 경우, 데이터 분석 모듈은 결정 실행 모듈에 명령을 전송하고, 결정 실행 모듈은 사 용자에게 APP을 업그레이드하라는 메시지를 표시(prompt)하고, 한편(meanwhile), APP 릴리저(releaser)에게 APP 수리를 알리기 위해, 이를 빅 데이터 센터에 보고하고, APP이 포그라운드에서 실행될 때, CPU/DDR/GPU 주파 수를 시나리오에 대응하는 최적의 주파수로 설정(set)한다. 포그라운드 및 백그라운드 APP들에 대한 리소스 제한 측정을 실행한 후, APP들에 의해 소비되는 리소스들이 제 한되어 있기 때문에, 따라서, 포그라운드 및 백그라운드에서 실행되는 APP들의 전력 소비가 효율적으로 줄어들 수 있으며, 배터리 수명이 연장될 수 있고, 따라서 에너지 절약 목적이 달성될 수 있다. 본 개시의 방안(scheme)은 3가지의 바람직한 실시 예들을 참조하여 더 설명될 것이다: 실시 예 I: 사용자가 애플리케이션 APP1을 새로 설치하고 일상 생활에서 가끔(occasionally) APP1을 사용하고, 사용 후, APP1이 백그라운드로 돌아 간다고 가정한다. 그러나 실제로 APP1은 여전히 오랫동안 실행되어 전력을 낭비한다. 데이터 수집 모듈은 APP1의 동작 특성 데이터 값을 기록하고, APP1의 동작 특성 데이터 값을 데이터 분석 모듈 로 전송하여 분석을 수행한다. 분석 후, 데이터 분석 모듈은 APP1이 백그라운드에서 높은 전력 소비가 있고, 사 용자가 APP을 사용하지 않고 있고, APP은 즉시 동결될 수 있음을 발견한다. 분석 결과에 따라, 데이터 분석 모 듈은 결정 실행 모듈에 제한 명령을 전송하여, 결정 실행 모듈이 백그라운드에서 동작하는 APP1을 즉시 동결시키고, 전력 소비를 효율적으로 줄이고, 본 개시의 에너지 절약의 이점을 구현한다. 실시 예 II: 사용자가 단말에서 운영 체제(operating system, OS)를 업그레이드한 후, 사용자는 단말이 이전보다 더 많은 열 을 발생시키고, 배터리 소모가 빨라진다는 것을 발견한다(find)고 가정한다. 사용자는 이유를 알지 못하고, 단 말의 OS가 좋지 않다고 생각할 수 있다. 본 개시의 데이터 수집 모듈은 OS 업그레이드 전후의 백그라운드에서 APP2의 전력 소비의 평균 값(average values of power consumption)을 기록하고, APP2의 전력 소비의 평균 값을 데이터 분석 모듈로 전송한다. 데이 터 분석 모듈이 APP2의 전력 소비의 평균 값에 대한 AI 학습 및 분석을 수행한 후, OS 업그레이드된 후, 백그라 운드에서 APP2의 전력 소비의 평균 값이 업그레이드 전보다 훨씬 높은 것을 발견하고(find), 따라서, 새로운 OS 에서 실행할 때 소프트웨어 버전이 비정상적인 전력 소비를 가진다는 결론을 내릴 수 있다. 데이터 분석 모듈은 결정 실행 모듈에 명령을 전송하고, 결정 실행 모듈은 사용자에게 APP2를 업그레이드를 하기 위해 알린다. 사용 자가 APP2를 업그레이드한 후, 비정상적인 열 문제가 제거되고, 배터리의 전력 소비가 정상이 된다. 실시 예 III: 사용자가 밤에 휴식을 취한 후, 그는 PUSH, 내비게이션, 및 쇼핑 애플리케이션들과 같은 일반적인(general) 애 플리케이션들의 실행을 알아 차리지 못하므로, 전력을 절약하기 위하여 휴대폰의 애플리케이션들의 실행을 제한 할 수 있다. 한편, 블루투스, GPS, 호흡 등(breathing light)과 같은 일부 주변(peripheral) 장치들이 꺼지면 전력이 더 절약된다. 전술한 내용은 본 개시의 바람직한 실시 예들일 뿐이며, 본 발명을 한정하려는 의도는 아니다. 본 발명의 사상 (spirit)과 원칙(principle)을 벗어나지 않는 범위에서 어떠한 수정(modification), 균등한 대체(equivalent substitution), 및 개선(improvement)도 본 발명의 보호 범위에 포함되어야 한다."}
{"patent_id": "10-2021-7024094", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시에 따른 AI 예측(AI prediction) 기반 지능형 단말(intelligent terminal) 에너지 절약 장치의 구조에 관한 개략도이다. 도 2는 본 개시에 따른 AI 예측에 기반한 지능형 단말 에너지 절약 방법의 흐름에 관한 개략도이다. 도 3은 본 개시에 따른 AI 예측의 원리(principle)에 관한 개략도이다. 도 4는 본 개시에 따른 APP-to-foreground-again의 시간을 예측 및 분류하는 AI에 관한 개략도이다. 도 5는 AI 예측 클래스들 및 백그라운드(background) 제한 측정(restriction measurement) 간의 대응 관계에 대한 개략도이다."}
