{"patent_id": "10-2022-0158566", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0076891", "출원번호": "10-2022-0158566", "발명의 명칭": "인간 고속 학습 제어를 통한 인간 고속 학습 유도 방법, 컴퓨터 장치, 및 컴퓨터 프로그램", "출원인": "한국과학기술원", "발명자": "이상완"}}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 장치에서 수행되는 고속 학습 유도 방법에 있어서,상기 컴퓨터 장치는 메모리에 포함된 컴퓨터 판독가능한 명령들을 실행하도록 구성된 적어도 하나의 프로세서를포함하고,상기 고속 학습 유도 방법은,인간 학습자와 인공지능 시스템의 학습에 상대방이 가진 서로 다른 학습 특성을 활용하는 것으로,상기 적어도 하나의 프로세서의 의해, 상기 인간 학습자의 의사결정 불확실성(uncertainty)을 추정하는 단계;및상기 적어도 하나의 프로세서의 의해, 상기 불확실성을 기초로 상기 학습에 활용되는 학습 데이터의 시퀀스(sequence)를 결정하는 단계를 포함하는 고속 학습 유도 방법."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 고속 학습 유도 방법은,상기 인간 학습자의 학습에 상기 인공지능 시스템이 추정한 불확실성 정보가 이용되고,상기 인공지능 시스템의 학습에 상기 인간 학습자의 경험 기반 학습 특성이 이용되는 것을 특징으로 하는 고속 학습 유도 방법."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 추정하는 단계는,상기 인공지능 시스템을 통해 레이블이 없는 데이터(unlabeled data)를 이용하여 상기 인간 학습자의 불확실성정보를 추정하는 것을 특징으로 하는 고속 학습 유도 방법."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 추정하는 단계는,상기 인간 학습자에 대해 구성된 앙상블 기계학습 모델을 기반으로, 입력되는 데이터에 대한 상기 인간의 불확실성 기대 값을 추정하는 단계를 포함하는 고속 학습 유도 방법."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 앙상블 기계학습 모델은 주어진 데이터에 대한 응답을 매칭하여 얻은 가상 데이터 셋을 교차 검증 방식으로 학습하여 구성된 것공개특허 10-2024-0076891-3-을 특징으로 하는 고속 학습 유도 방법."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 결정하는 단계는,상기 불확실성을 이용하여 레이블이 있는 데이터(labeled data)에 대한 데이터 시퀀스를 결정하는 것을 특징으로 하는 고속 학습 유도 방법."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 결정하는 단계는,상기 불확실성에 대해 데이터 공간에서의 전체 불확실성의 변화량을 계산하는 단계; 및레이블이 있는 데이터에 대해 상기 변화량이 최소인 데이터 시퀀스를 결정하여 상기 인간 학습자에게 제공하는단계를 포함하는 고속 학습 유도 방법."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제공하는 단계는,학습 데이터 인덱스와 현재 시점의 상태가 주어지면 다음 시점의 상태와 전체 불확실성 변화량을 보상(reward)으로 반환하여 강화 학습을 통해 전체 불확실성 변화량이 최소인 데이터 시퀀스를 찾는 단계를 포함하는 고속 학습 유도 방법."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "고속 학습 유도 방법을 컴퓨터에 실행시키기 위해 컴퓨터 판독가능한 기록 매체에 저장되는 컴퓨터 프로그램에있어서,상기 고속 학습 유도 방법은,인간 학습자와 인공지능 시스템의 학습에 상대방이 가진 서로 다른 학습 특성을 활용하는 것으로,상기 인간 학습자의 의사결정 불확실성을 추정하는 단계; 및상기 불확실성을 기초로 상기 학습에 활용되는 학습 데이터의 시퀀스를 결정하는 단계를 포함하는, 컴퓨터 프로그램."}
{"patent_id": "10-2022-0158566", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨터 장치에 있어서,메모리에 포함된 컴퓨터 판독가능한 명령들을 실행하도록 구성된 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는,인간 학습자와 인공지능 시스템의 학습에 상대방이 가진 서로 다른 학습 특성을 활용하는 것으로,상기 인간 학습자의 의사결정 불확실성을 추정하는 과정; 및상기 적어도 하나의 프로세서의 의해, 상기 불확실성을 기초로 상기 학습에 활용되는 학습 데이터의 시퀀스를결정하는 과정공개특허 10-2024-0076891-4-을 처리하는 컴퓨터 장치."}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인간 고속 학습 제어를 통한 인간 고속 학습 유도 방법, 컴퓨터 장치, 및 컴퓨터 프로그램이 개시된다. 인간 고 속 학습 유도 방법은, 인간 학습자와 인공지능 시스템의 학습에 상대방이 가진 서로 다른 학습 특성을 활용하는 것으로, 상기 인간 학습자의 의사결정 불확실성(uncertainty)을 추정하는 단계; 및 상기 불확실성을 기초로 상기 학습에 활용되는 학습 데이터의 시퀀스(sequence)를 결정하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명은 인간과 인공지능 시스템이 상호작용하여 학습하는 기술에 관한 것이다."}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인간 및 인공지능은 공통적으로 학습을 통해 지식의 성장을 이룩하는 객체(agent)로서 각자가 지닌 학습 지능에 의하여 지식을 획득한다. 즉, 학습이란 지능에 의하여 발생하는 현상으로서 지능의 특성이 다를 경우 학습을 통해 획득할 수 있는 지식의 범위나 수준도 달라진다. 일반적으로, 인간 또는 인공지능이 각자 단독으로 학습 할 때 기대되는 지식의 수준은 학습 능력의 한계로 인하여 높지 않다. 그러나, 동일한 환경이나 데이터를 통해 서라도 인간 및 인공지능이 획득할 수 있는 지식은 다를 것이므로 어떤 과업의 달성 목표를 상향하기 위해 인간 과 인공지능의 협력을 가정할 수 있다. 인간과 인공지능이 상호 협력하여 함께 학습하거나 특정 과업을 공동으로 수행하여 과업의 달성 목표를 높이는 인간-인공지능 상호작용(Human-AI interaction) 개념은 인공지능의 전통적인 연구분야로서 현재에 이르기까지 꾸준히 발전해 오고 있다. 가령, 의료영상을 진단하기 위해 의사와 의료 인공지능이 협력할 경우 의사 또는 인 공지능 시스템이 단독으로 판독하는 경우에 비해 정확도가 향상될 수 있다. 그러나, 이와 같은 전통적인 인간-인공지능 상호작용을 통해 달성할 수 있는 학습 또는 과업의 성능은 인간과 인공지능 시스템이 가진 초기 정보의 총량에 종속적이다. 상호작용의 기저 원리는 두 학습 객체가 가진 정보의 상호 교환에 있으므로 상호작용 시스템에 새로운 외부 정보가 유입되지 않는 한 상호작용으로 영득하는 각 학습 객체의 목표 달성 정도 내지는 시스템 전체의 성능 수준은 일정한 한계에 이른다. 나아가, 상호작용이 지속되 면 오히려 정보 소실에 의한 성능의 감소가 발생한다."}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "인간과 인공지능이 가진 서로 다른 학습 특성을 상대방의 학습에 상호 활용하도록 하여 정보의 증폭을 유도할 수 있는 방법 및 장치를 제공한다."}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "컴퓨터 장치에서 수행되는 고속 학습 유도 방법에 있어서, 상기 컴퓨터 장치는 메모리에 포함된 컴퓨터 판독가 능한 명령들을 실행하도록 구성된 적어도 하나의 프로세서를 포함하고, 상기 고속 학습 유도 방법은, 인간 학습 자와 인공지능 시스템의 학습에 상대방이 가진 서로 다른 학습 특성을 활용하는 것으로, 상기 적어도 하나의 프 로세서의 의해, 상기 인간 학습자의 의사결정 불확실성(uncertainty)을 추정하는 단계; 및 상기 적어도 하나의 프로세서의 의해, 상기 불확실성을 기초로 상기 학습에 활용되는 학습 데이터의 시퀀스(sequence)를 결정하는 단계를 포함하는 고속 학습 유도 방법을 제공한다. 일 측면에 따르면, 상기 고속 학습 유도 방법은, 상기 인간 학습자의 학습에 상기 인공지능 시스템이 추정한 불 확실성 정보가 이용되고, 상기 인공지능 시스템의 학습에 상기 인간 학습자의 경험 기반 학습 특성이 이용될 수 있다. 다른 측면에 따르면, 상기 추정하는 단계는, 상기 인공지능 시스템을 통해 레이블이 없는 데이터(unlabeled data)를 이용하여 상기 인간 학습자의 불확실성 정보를 추정할 수 있다. 또 다른 측면에 따르면, 상기 추정하는 단계는, 상기 인간 학습자에 대해 구성된 앙상블 기계학습 모델을 기반 으로, 입력되는 데이터에 대한 상기 인간의 불확실성 기대 값을 추정하는 단계를 포함할 수 있다. 또 다른 측면에 따르면, 상기 앙상블 기계학습 모델은 주어진 데이터에 대한 응답을 매칭하여 얻은 가상 데이터 셋을 교차 검증 방식으로 학습하여 구성될 수 있다. 또 다른 측면에 따르면, 상기 결정하는 단계는, 상기 불확실성을 이용하여 레이블이 있는 데이터(labeled dat a)에 대한 데이터 시퀀스를 결정할 수 있다. 또 다른 측면에 따르면, 상기 결정하는 단계는, 상기 불확실성에 대해 데이터 공간에서의 전체 불확실성의 변화 량을 계산하는 단계; 및 레이블이 있는 데이터에 대해 상기 변화량이 최소인 데이터 시퀀스를 결정하여 상기 인 간 학습자에게 제공하는 단계를 포함할 수 있다. 또 다른 측면에 따르면, 상기 제공하는 단계는, 학습 데이터 인덱스와 현재 시점의 상태가 주어지면 다음 시점 의 상태와 전체 불확실성 변화량을 보상(reward)으로 반환하여 강화 학습을 통해 전체 불확실성 변화량이 최소 인 데이터 시퀀스를 찾는 단계를 포함할 수 있다. 고속 학습 유도 방법을 컴퓨터에 실행시키기 위해 컴퓨터 판독가능한 기록 매체에 저장되는 컴퓨터 프로그램에 있어서, 상기 고속 학습 유도 방법은, 인간 학습자와 인공지능 시스템의 학습에 상대방이 가진 서로 다른 학습 특성을 활용하는 것으로, 상기 적어도 하나의 프로세서의 의해, 상기 인간 학습자의 의사결정 불확실성을 추정 하는 단계; 및 상기 적어도 하나의 프로세서의 의해, 상기 불확실성을 기초로 상기 학습에 활용되는 학습 데이 터의 시퀀스를 결정하는 단계를 포함하는, 컴퓨터 프로그램을 제공한다. 컴퓨터 장치에 있어서, 메모리에 포함된 컴퓨터 판독가능한 명령들을 실행하도록 구성된 적어도 하나의 프로세 서를 포함하고, 상기 적어도 하나의 프로세서는, 인간 학습자와 인공지능 시스템의 학습에 상대방이 가진 서로 다른 학습 특성을 활용하는 것으로, 상기 인간 학습자의 의사결정 불확실성을 추정하는 과정; 및 상기 적어도 하나의 프로세서의 의해, 상기 불확실성을 기초로 상기 학습에 활용되는 학습 데이터의 시퀀스를 결정하는 과정 을 처리하는 컴퓨터 장치를 제공한다."}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 인간과 인공지능이 가진 서로 다른 학습 특성을 상대방의 학습에 상호 활용하도록 하여 정보의 증폭을 유도함으로써 제한된 학습 환경에서 인간과 인공지능의 학습 수준을 극대화할 수 있다."}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 본 발명의 실시예들은 인간과 인공지능 시스템이 상호작용하여 학습하는 기술에 관한 것이다. 본 명세서에서 구체적으로 개시되는 것들을 포함하는 실시예들은 인간과 인공지능이 가진 서로 다른 학습 특성 을 상대방의 학습에 상호 활용하도록 하여 기존의 방법으로는 달성하지 못하는 정보 증폭을 유도하여 제한된 학 습 환경에서 인간과 인공지능의 학습 수준을 극대화하는 새로운 공학 기술을 다룬다. 도 1은 본 발명의 일실시예에 따른 컴퓨터 장치의 예를 도시한 블록도이다. 예를 들어, 본 발명의 실시예들에 따른 인간 고속 학습 유도 시스템은 도 1을 통해 도시된 컴퓨터 장치에 의해 구현될 수 있다. 도 1에 도시된 바와 같이 컴퓨터 장치는 본 발명의 실시예들에 따른 인간 고속 학습 유도 방법을 실행하기 위한 구성요소로서, 메모리, 프로세서, 통신 인터페이스 그리고 입출력 인터페이스를 포함 할 수 있다. 메모리는 컴퓨터에서 판독 가능한 기록매체로서, RAM(random access memory), ROM(read only memory) 및 디스크 드라이브와 같은 비소멸성 대용량 기록장치(permanent mass storage device)를 포함할 수 있다. 여기서 ROM과 디스크 드라이브와 같은 비소멸성 대용량 기록장치는 메모리와는 구분되는 별도의 영구 저장 장치로 서 컴퓨터 장치에 포함될 수도 있다. 또한, 메모리에는 운영체제와 적어도 하나의 프로그램 코드가저장될 수 있다. 이러한 소프트웨어 구성요소들은 메모리와는 별도의 컴퓨터에서 판독 가능한 기록매체로 부터 메모리로 로딩될 수 있다. 이러한 별도의 컴퓨터에서 판독 가능한 기록매체는 플로피 드라이브, 디 스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 실시예에서 소프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매체가 아닌 통신 인터페이스를 통 해 메모리에 로딩될 수도 있다. 예를 들어, 소프트웨어 구성요소들은 네트워크를 통해 수신되는 파 일들에 의해 설치되는 컴퓨터 프로그램에 기반하여 컴퓨터 장치의 메모리에 로딩될 수 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리 또는 통신 인터페이스에 의해 프로세서로 제공될 수 있다. 예 를 들어 프로세서는 메모리와 같은 기록 장치에 저장된 프로그램 코드에 따라 수신되는 명령을 실행 하도록 구성될 수 있다. 통신 인터페이스은 네트워크를 통해 컴퓨터 장치가 다른 장치와 서로 통신하기 위한 기능을 제 공할 수 있다. 일례로, 컴퓨터 장치의 프로세서가 메모리와 같은 기록 장치에 저장된 프로그램 코드에 따라 생성한 요청이나 명령, 데이터, 파일 등이 통신 인터페이스의 제어에 따라 네트워크를 통해 다른 장치들로 전달될 수 있다. 역으로, 다른 장치로부터의 신호나 명령, 데이터, 파일 등이 네트워크 를 거쳐 컴퓨터 장치의 통신 인터페이스를 통해 컴퓨터 장치로 수신될 수 있다. 통신 인 터페이스를 통해 수신된 신호나 명령, 데이터 등은 프로세서나 메모리로 전달될 수 있고, 파일 등은 컴퓨터 장치가 더 포함할 수 있는 저장 매체(상술한 영구 저장 장치)로 저장될 수 있다. 통신 방식은 제한되지 않으며, 네트워크가 포함할 수 있는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방송망)을 활용하는 통신 방식뿐만 아니라 기기들 간의 근거리 유선/무선 통신 역시 포함될 수 있다. 예를 들어, 네트워크는, PAN(personal area network), LAN(local area network), CAN(campus area network), MAN(metropolitan area network), WAN(wide area network), BBN(broadband network), 인터넷 등의 네트워크 중 하나 이상의 임의의 네트워크를 포함할 수 있다. 또한, 네트워크는 버스 네트워크, 스타 네 트워크, 링 네트워크, 메쉬 네트워크, 스타-버스 네트워크, 트리 또는 계층적(hierarchical) 네트워크 등을 포 함하는 네트워크 토폴로지 중 임의의 하나 이상을 포함할 수 있으나, 이에 제한되지 않는다. 입출력 인터페이스는 입출력 장치와의 인터페이스를 위한 수단일 수 있다. 예를 들어, 입력 장치는 마이크, 키보드, 카메라 또는 마우스 등의 장치를, 그리고 출력 장치는 디스플레이, 스피커와 같은 장치를 포함 할 수 있다. 다른 예로 입출력 인터페이스는 터치스크린과 같이 입력과 출력을 위한 기능이 하나로 통합 된 장치와의 인터페이스를 위한 수단일 수도 있다. 입출력 장치는 컴퓨터 장치와 하나의 장치로 구 성될 수도 있다. 또한, 다른 실시예들에서 컴퓨터 장치는 도 1의 구성요소들보다 더 적은 혹은 더 많은 구성요소들을 포함 할 수도 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 예를 들어, 컴퓨 터 장치는 상술한 입출력 장치 중 적어도 일부를 포함하도록 구현되거나 또는 트랜시버 (transceiver), 카메라, 각종 센서, 데이터베이스 등과 같은 다른 구성요소들을 더 포함할 수도 있다. 이하에서는 인간 고속 학습 제어를 통한 정보 증폭 기술의 구체적인 실시예를 설명하기로 한다. 본 실시예에 따른 컴퓨터 장치에는 컴퓨터로 구현된 인간 고속 학습 유도 시스템이 구성될 수 있다. 컴퓨 터 장치의 프로세서는 이하의 인간 고속 학습 유도 방법을 수행하기 위한 구성요소로 구현될 수 있다. 실시예에 따라 프로세서의 구성요소들은 선택적으로 프로세서에 포함되거나 제외될 수도 있다. 또한, 실시예에 따라 프로세서의 구성요소들은 프로세서의 기능의 표현을 위해 분리 또는 병 합될 수도 있다. 이러한 프로세서 및 프로세서의 구성요소들은 이하의 인간 고속 학습 유도 방법이 포함하는 단계들을 수행하도록 컴퓨터 장치를 제어할 수 있다. 예를 들어, 프로세서 및 프로세서의 구성요소들은 메모리가 포함하는 운영체제의 코드와 적어도 하나의 프로그램의 코드에 따른 명령(instruction)을 실행하 도록 구현될 수 있다. 여기서, 프로세서의 구성요소들은 컴퓨터 장치에 저장된 프로그램 코드가 제공하는 명령에 따라 프로 세서에 의해 수행되는 서로 다른 기능들(different functions)의 표현들일 수 있다. 프로세서는 컴퓨터 장치의 제어와 관련된 명령이 로딩된 메모리로부터 필요한 명령을 읽어들일 수 있다. 이 경우, 상기 읽어들인 명령은 프로세서가 이후 설명될 학습 과정을 실행하도록 제어하기 위한명령을 포함할 수 있다. 본 발명의 배경이 되는 기초 기술은 다음과 같다. 인간과 인공지능(기계학습 모형) 시스템은 아직 통합되지 않 은 각각의 고유한 학습 특성을 가지고 있다. 본 발명은 인간과 인공지능의 다양한 고유 학습 능력 중 다음의 학습 능력을 상대방의 학습에 교환 활용하는 사상에 기초를 두고 있다. 인간의 고속 학습: 학습이란 통상 어떤 자극(데이터)과 결과(정답)에 지속적으로 노출될 때 자극과 결과에 대한 인과관계 불확실성을 점진적으로 감소시키는 점진적인 과정으로 이루어진다. 그러나, 점진적인 학습은 때 때로 동물(인간)의 생존에 불리하다. 인간은 인과적 불확실성이 높은 자극을 접할 때 학습율을 급격히 높임으 로서 불확실성을 해소하는 고속 학습 메커니즘을 가지고 있다. 고속 학습 과정을 통해 인간은 단 하나 또는 소 수의 학습데이터만으로도 광범위한 지식을 획득할 수 있으나, 기계학습에서는 인간과 같은 고속 학습이 불가능 하며 학습을 위해 여전히 많은 양의 학습데이터를 필요로 한다. 인공지능(기계학습 모형)의 인간 불확실성 근사: 신경망 알고리즘은 이론적으로 단 한 층으로 이루어진 모 형이라도 층을 구성하는 신경 유닛의 개수가 증가할수록 어떠한 함수도 표현할 수 있을 만큼 고도의 비선형적 특성(feature)를 근사할 수 있음이 입증된 바 있다. 이와 같은 성질을 응용하면 소수의 샘플만으로도 특정 인 간 학습자의 광범위한 지식 불확실성을 추정할 수 있다. 일반적으로 인간과 인공지능이 상호 협력하는 시스템의 성능은 인간과 인공지능이 각자 가진 정보의 총량을 초 과하지 못한다. 그러나, 인간과 인공지능은 서로 다른 지능 특성들을 가지고 있으며, 예를 들어 다음과 같은 고유한 학습 능력을 상대방의 학습에 활용하는 것을 가정한다. 인간은 단 한번의 경험만으로도 빠르게 학습하는 고속 학습 능력이 있다: 인공지능의 학습에 인간의 고속 학습 능력을 활용한다. 인공지능(기계학습 모형)은 인간의 의사결정 불확실성을 추정할 수 있다: 인간의 학습에 인공지능이 추정한 불확실성 정보를 활용한다. 상기하는 인간의 고속 학습 능력과 인공지능의 불확실성 추정 능력을 학습 상대방(각각 인공지능 및 인간)의 학 습에 활용하고 이러한 인간-인공지능 공동 학습을 통해 인간과 인공지능이 학습 정보를 교환할 경우, 주어진 학 습 데이터의 한계를 뛰어넘어 인간과 인공지능 모두의 학습을 고도화할 수 있다. 상술하는 인간-인공지능 고도화 하에서 인간과 인공지능이 가진 정보의 총량이 초기 정보의 총량을 초과하는 정 보의 증폭이 발생할 수 있다. 구체적으로, 본 발명 기술은 인공지능(기계학습 모형)이 학습한 지식을 인간에게 전달함에 있어 인간의 불확실 성 추정을 통해 인간의 고속 학습을 유도하는 방식으로 지식을 전달한다. 고속 학습으로 고도화된 인간의 지식을 다시 인공지능에 피드백하여 인공지능의 학습에 적용하면 인공지능이 인 간에게 제공한 정보량보다 많은 정보를 다시 받게 되는 효과가 발생하여 인공지능의 성능이 향상되는 정보 증폭 이 일어난다. 본 발명은 (A) 인간의 학습을 고속으로 유도하는 방법론, (B) 고속으로 학습한 인간의 지식을 인공지능의 학습 에 활용하여 정보의 증폭을 유도하는 기술, (C) 위 (A) 와 (B)의 과정을 반복함으로써 정보의 한계를 효율적으 로 극복하는 기술을 포함한다. 본 발명은 인간의 고속 학습을 직접 제어하는 것과 인간-인공지능의 고유한 학습능력을 교환 활용하는 것이 핵 심 사상으로, 인간과 인공지능의 상호작용 상황에서 두 객체의 단순한 정보 교환이 아닌 학습 능력 자체의 교환 효과를 유도하여 두 학습 객체가 환경 또는 제한된 학습데이터로부터 정보를 증폭적으로 획득하여 학습 효과를 극대화하는 기술이다. 도 2는 본 발명의 일실시예에 있어서 인간-인공지능 상호작용에 따른 정보 증폭 과정을 도시한 것이다. 도 2를 참조하면, 본 발명에 따른 인간 고속 학습 유도 시스템은 인간 학습자와 인공지능 시스템(기 계학습 모형)의 서로 다른 학습 특성을 상대방(상호작용하는 인간과 인공지능 시스템에서 각각 함께 상호 작용하는 반대측 인공지능 시스템과 인간)의 학습에 적용함으로서 인간 학습자와 인공지능 시스템이 제한된 정보의 양을 초월하여 증폭 학습하는 것이다. 본 발명은 전통적인 인간-인공지능 상호작용에서와 같이 단순히 인간과 인공지능이 가진 정보를 상호전달하는 방식이 아닌, 인공지능 시스템의 비선형 근사 능력을 인간 학습자의 고속 학습 유도에 적용하고(인공 지능에 의한 인간 학습의 증폭) 고속 학습된 인간 학습자의 피드백을 통해 다시 인공지능 시스템의 고도 학습을 유도함으로써(인간에 의한 인공지능 정보의 증폭) 인간 학습자와 인공지능 시스템이 주 어진 본래 정보의 총량을 넘어 학습을 수행할 수 있다. 이러한 학습 개념은 변조기(modulator)를 통해 인공지능이 인간 학습자에게 전달(송신)한 정보 보다 많은 정보를 인간 학습자가 수신받게 되는 효과를 유도하여 적은 양의 학습데이터만으로 다량의 학습 데이터를 학습한 것과 같은 학습 성취도를 가능하게 한다. 한편, 인공지능의 비선형 근사 특성을 통해 고 도 학습된 인간 학습자의 피드백으로 인공지능 시스템의 재귀적 학습에 이용할 경우 인공지능의 추가적인 성능 향상이 가능하다. 즉, 인간의 고속 학습은 정보를 증폭하는 효과로 이어질 수 있으며 이 재귀적 상호작용 하에서 인간 학습자는 정보 증폭기(Information amplifier)로 해석될 수 있다. 본 발명은 개별 인간 학습자 및 개별 인공지능 시스템에 대하여 맞춤형(정밀) 불확실성 측정을 기반 으로 하며, 의료영상 등 연속적인 데이터 표현이 가능한 모든 실용 데이터에 적용할 수 있다. 또한, 본 발명은 레이블이 정확한 소수의 데이터와 레이블이 불완전한 다수의 데이터가 있을 때, 인간 또는 인공지능 시스템이 단독으로 추출할 수 없는 정보를 추출할 수 있고, 인공지능 시스템의 정보를 인간(21 0)의 학습에 증폭되도록 적용하는 단방향 적용뿐만 아니라 인간과 인공지능이 상호작용하여 두 시스 템의 성능을 모두 고도화하는 디자인에 적용할 수 있다. 본 발명의 핵심 요소는 인간과 인공지능의 상호작용 단계에서 인간의 고속 학습을 유도하는 시 스템(도 2에서 인간과 인공지능의 상호작용을 매개하는 변조기에 해당됨)이며, 이를 통해 정보 의 증폭으로 이어지는 인간-인공지능 상호작용이 가능하다. 도 3은 본 발명의 일실시예에 있어서 인간 고속 학습 제어 시스템의 구성요소를 도시한 블록도이다. 도 3을 참조하면, 인간과 인공지능의 상호작용 단계에서 인간의 고속 학습을 유도하는 변조기 는 인간 불확실성 추정 모듈, 불확실성 변화 시뮬레이션 모듈, 및 불확실성 변조 정책 모듈 을 포함할 수 있다. 변조기는 인간 학습 시퀀스 생성기(human learning sequence generator)에 해당되는 것으로, 인간의 불확 실성을 최소화할 수 있는 학습 데이터 시퀀스를 생성하는 역할을 한다. 본 발명에 따른 인간 고속 학습 제어 시스템에는 기능적 동작 단위로서 인간 학습자와 기계학습 모델(22 0)이 있으며, 인간 학습자와 기계학습 모델 사이의 정보 교환을 매개하는 변조기가 포함될 수 있다. 기능적 동작 단위들의 기능 수행을 위한 객체인 레이블이 있는 데이터(labeled data)와 레이블이 없는 데이터(unlabeled data)가 있다. 인간 불확실성 추정 모듈은 인간 학습자의 불확실성을 측정 및 추정하는 역할을 하는 것으로, 소수의 샘플링만으로 취급하는 데이터 공간 전 범위에 대한 인간 학습자의 현재 불확실 정도를 추정할 수 있다. 불확실성 변화 시뮬레이션 모듈은 특정 영역에서 학습이 이루어질 때 인간 학습자의 불확실성에 대해 데이터 공간에서 일어날 전체적 불확실성 변화량을 계산할 수 있다. 불확실성 변조 정책 모듈은 전체 불확실성을 최소화하는 학습 데이터 시퀀스를 찾아내는 강화학습 기반 정 책 모듈로서, 불확실성 변화 시뮬레이션 모듈과 상호작용하여 최적의 학습 시퀀스를 결정하는 역할을 한다. 다시 말해, 변조기는 레이블이 없는 데이터와 레이블이 있는 데이터(즉, 정답이 제시되어 학습데이터 로 사용될 수 있는 데이터)가 주어지면, 먼저 레이블이 없는 데이터를 이용하여 인간 학습자의 불확실성 정보를 추정하는 기능을 수행한다. 다음으로, 변조기는 인간 학습자의 불확실성 정보를 바 탕으로 어떤 순서로 레이블이 있는 데이터를 인간 학습자에게 학습데이터로 제시할 때 고속 학습 효 과가 일어날지를 예측하여 고속 학습 효과 기대치가 가장 높은 데이터 시퀀스를 인간 학습자에게 제공하는 기능을 수행한다. 본 발명에 따른 인간 고속 학습 제어 과정을 구체적으로 설명하면 다음과 같다. 도 4는 본 발명의 일실시예에 있어서 인간-인공지능 상호작용에 따른 학습 데이터 시퀀스 생성 과정을 설명하기 위한 예시 도면이다.전체 시스템은 하나의 라운드 단위로 동작하며, 하나의 라운드는 인간 학습자와 기계학습 모델이 변 조기와 상호 작용하여 학습하는 일련의 과정으로 구성될 수 있다. 실시예에 따라서는 다수의 라운드로 동 작하는 시스템을 고려할 수 있으며, 동일한 동작 단위로 구성하는 라운드가 반복적으로 진행될 경우 인간 학습 자와 기계학습 모델의 학습 정도(지식)가 지속적으로 향상(증폭)될 수 있다. 이하에서는 설명의 편의를 위해 r-1라운드에서 인간 학습자의 불확실성을 추정하고 동시에 불확실성 추정 결과를 통해 기계학습 모델을 학습시키는 상황을 가정하기로 한다. 아울러, r-1 라운드에서 얻은 인간 학 습자의 불확실성 정보를 이용하여 r라운드에서 레이블이 있는 데이터를 사용하여 인간 학습자의 고속 학습을 유도한다. 인간 불확실성 추정 모듈 특정 사람이 특정 데이터 x에 관한 답 y를 '어느 정도'로 확신하는지를 정량화한 지표를 불확실성이라고 정의한 다. 따라서, 불확실성은 특정 사람 h 및 데이터 x에 대한 함수로 간주할 수 있다. 불확실성은 주로 데이터 자 체의 노이즈 등과 같은 원인에 의해 발생하는 데이터 불확실성(aleatoric uncertainty)과 학습의 불완전성에 의 해 발생하는 인식적 불확실성(epistemic uncertainty)으로 나누어진다. 인식적 불확실성은 특정 사람 h에게 데 이터 x가 제시되었을 때의 응답 의 변화 정도(variance)로 이해할 수 있다. 즉, x에 대한 불확실성이 높은 사람에게 x에 대한 답을 요청한다면 동일한 x라도 매번 응답이 상이할 수 있으며, 그 응답의 변동이 크다면 인 식적 불확실성이 크다고 할 수 있다. 그러나, 인식적 불확실성을 직접 측정하는 것은 실무적으로는 매우 어렵 다. 데이터 x에 대해 시간차를 두고 여러 차례의 질의를 거쳐 얻은 응답 데이터의 분산을 통해 구하여야 하므 로 불확실성 측정 대상 데이터가 다수일 경우 이 과정은 매우 번거롭기 때문이다. 본 발명에서의 불확실성 예측 알고리즘은 특정 사람 h에게 응답을 요청할 수 있는 데이터 x들에 대해서 각각 1 번만의 질의를 통해 얻은 응답 들을 매칭하여 얻은 가상 데이터셋 을 생성하고 이를 교차 검증(cross- validation) 방식으로 앙상블 기계학습 모델에 학습한 것이다. 이와 같이 학습된 앙상블 기계학습 모델은 새로 운 데이터 x*에 대한 특정 사람 h의 인식적 불확실성을 예측할 수 있다. 이는 사람 h의 인식적 불확실성이 큰 측정 데이터에서는 의 우도(likelihood)가 상대적으로 작으므로 을 학습한 앙상블 모델 전체의 출력 분 산이 증가하는 원리에 근거한다. 구체적인 과정은 다음과 같다. 을 통해 학습하는 앙상블 기계학습 모델이 M개의 개별 모델로 구성되고 m 번째(m=1,…, M) 개별 모델을 라 하면 개별 모델은 을 이루는 데이터의 일부만을 무작위 선택하여 학습한다(앙상블 전체 모델의 기준으로는 교차 검증 방식의 학습이 된다.) 이때, 기계학습 모델의 구체적인 구 현 알고리즘은 인공 신경망이나 가우시안 과정(Gaussian process) 등 다양한 알고리즘이 가능할 수 있다. 훈련 된 앙상블 모델이 새로운 데이터 x*에 대해 출력하는 평균 기대값은 다음과 같다. [수학식 1]"}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이때, r-1이란 r-1 라운드에서 샘플링한 데이터 을 이용하여 학습하였음을 의미하고, 는 앙상블 전체 모델 을 의미한다. 이 평균 출력은 사람 h가 x*에 대해 평균적으로 보고하게 될 응답을 예측한 것으로 볼 수 있다. 다만, 특수한 사례에 한정하여, 예를 들어 분류 문제를 다루는 과제에서 x에 대한 출력이 엔트로피(entropy)로 표현되는 경우 그 평균은 일종의 데이터 불확실성을 의미한다. 따라서, 분류 문제에 한정할 때 수학식 1의 의 미는 사람 h가 x*에 대해 인지하는 데이터 불확실성이다. 이때, 앙상블의 개별 모델의 출력 분산(variance)에 일정한 상수 알파(α, alpha)를 곱하여 보정하면 사람 h의 인식적 불확실성을 예측한 결과가 되며, 수학식 2와 같이 정의될 수 있다.[수학식 2]"}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, 는 불확실성을 함수로 나타내기 위한 약속 표기이며, E는 인식적 불확실성을 의미한다. 도 4의 추 정 불확실성(estimated uncertainty) 그래프는 의 예시를 나타낸 함수 그래프이다. 불확실성 변화 시뮬레이션 모듈 불확실성 변화 시뮬레이션 모듈은 특정 사람 h의 현재 불확실성 분포를 알게 되고(인간 불확실성 추정 모 듈에 의해 추정 가능), 이때 어떤 데이터 x를 h에게 제시하여 학습을 유도했을 때, 전체 데이터 공간에서 정의되는 불확실성(전체 불확실성 분포 양상이라 칭하며 도 4의 추정 불확실성(estimated uncertainty)으로 나 타낸 것과 같이 데이터 공간을 정의역으로 하는 함수 그래프로 표현 가능)이 어떻게 변화할지(도 4에서 적색 화 살표로 표시된 특정 데이터를 학습하였을 때 학습 후의 전체 불확실성 분포 양상(청색 점선)과 전체 불확실성 감소량(빗금으로 표시된 면적))를 추정하는 것이다. 인식적 불확실성은 학습이 진행됨에 따라 감소하며, 여러 연구에 따르면 불확실성의 감소 정도는 학습 효과의 정도와 높은 상관관계를 가진다. 특정 사람 h의 특정 데이터 학습에 따른 불확실성 변화 양상은 실제 학습 전후 불확실성 측정을 통해 알 수 있 다. 그러나, 광범위한 데이터 범위에 걸쳐 불확실성 측정을 하는 것은 현실적으로 불가능하며, 본 발명에서의 주요 목적은 학습에 가장 도움이 될 학습 데이터를 사전에 예측하여 사람 h에게 제시하는 것이다. 따라서, 어 떤 데이터를 학습했을 때의 불확실성 변화 양상을 측정이 아닌 사전 예측의 방법으로 추정해야 한다. 본 기능 요소를 설계하기 위해 도입한 주요 가정은 다음과 같다. 1. 불확실성은 데이터 공간에 대해 연속적으로 정의할 수 있다. 즉, 특정 위치의 데이터 불확실성이 추정되면, 주변의 잠재적인 데이터 불확실성은 추정된 데이터들의 불확실성 추정 값에서 내삽(interpolation) 또는 외삽 (extrapolation)에 의하여 연속적으로 이어지는 어떤 값으로 추정할 수 있다. 2. 학습이 불확실성 감소에 미치는 영향력은 학습 데이터와 그 주변부 데이터에서 가장 크다. 그 영향력의 크 기는 학습 데이터에서 멀어질수록 감소한다. 영향력은 일종의 힘으로 해석할 수 있으므로 주어지는 영향력만큼 반드시 불확실성이 감소하는 것은 아니다. 3. 학습에 의한 불확실성 감소 영향력에 의해 실제로 불확실성이 감소하는 정도는 학습 전에 데이터의 불확실성 값의 절대값에 비례한다. 즉, 학습이 일어나기 전의 데이터 불확실성이 높을 경우 동일한 영향력에 대해 불확 실성이 감소하는 정도가 더욱 크다. 4. 상기한 내용을 종합하면 특정 학습데이터를 학습했을 때, 특정 데이터 영역 x의 불확실성 감소량은 학습데이 터와의 거리, 특정 데이터 영역 x의 사전 불확실성 크기에 관계된다. 불확실성 변화 시뮬레이션 모듈은 일련의 학습 데이터 집합이 시퀀스 형태로 사람 h에게 주어지는 상황을 가정했을 때 h에게 주어지는 순서대로 불확실성 변화를 차례대로 반영하여 시퀀스가 종료되었을 때를 비롯하여 시퀀스가 진행 중인 상태 내부의 어떤 시점의 전체 불확실성 양상과 변화량을 계산(예측)할 수 있으며, 수학식 3과 같이 정의할 수 있다.[수학식 3]"}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3은 상기한 가정을 만족하는 불확실성 변화에 대한 하나의 예시일 뿐, 다양한 형태의 식으로 정의될 수 있다. 즉, 불확실성 변화 시뮬레이션 모듈은 인간의 불확실성 정보가 있을 때, 특정 데이터의 학습을 하 면 그 불확실성의 변화를 측정 없이 예측할 수 있다. 수학식 3에서 불확실성 함수 표기 의 위첨자로 표기된 P는 데이터 불확실성과 인식적 불확실성을 모두 더한 전체 불확실성을 나타내는 표기이다. A는 데이터 불확실성을 나타낸다. 첨자 내부의 t는 학습 데이터가 시퀀 스로 주어질 때 시퀀스 내부의 시점을 나타내는 변수이다. 불확실성 변화 시뮬레이션 모듈이 처음 동작할 때, 먼저 불 인간 불확실성 추정 모듈과 상호작용 하여 시스템 전체가 접근 가능한 데이터 전체 집합 X에 대한 사람 h의 현재 불확실성 정보를 받아온다. 참고로, 무한한 크기의 가능한 전체 X에 대한 h의 불확실성 정보가 있을 경우 도 4의 좌측 그래프와 같이 함수 그래프로 나타날 수 있을 것이나, 실제로는 유한한 데이터 X에 대해서만 정보를 받아오게 되므로 곡선이 아닌 데이터가 정의된 부분에서만 불확실성이 표시되는 점의 형태 불연속 그래프가 될 것이다. 유한한 데이터 집합 X에 대해 데이터 불확실성 (데이터 불확실성이 정의될 수 있는 과제에 한정)과 인식적 불확실성 정보를 받아오 면 그것을 초기값이라 하고 다음과 같이 각각 와 로 표시할 수 있다. 초기값 표현에서 윗 첨자 0은 시퀀스의 초기인 0시점을 의미(따라서 시퀀스 내부에서 t시점에서의 추정 불확실 성을 t로 표현할 수 있다)하고, A는 데이터 불확실성을 나타내는 약속 표기이다. 컴퓨터 시스템에서 X를 이루 는 각 구성 데이터 x별로 변수를 정의하고 해당 변수에 와 를 저장함으로써 표본 데이터 공간에 대한 초기 불확실성을 나타낼 수 있다. 시퀀스 형태로 학습 데이터가 주어질 때 첫번째 학습데이터 xT가 주어질 경우 수학식 3의 첫번째 식에 의하여 각 변수들의 불확실성이 업데이트된다. 이때 d2(xT, x)란 학습데이터 xT와 불확 실성 측정을 원하는 데이터 공간 상의 포인트 x와의 유클리드 거리를 의미한다. 유클리드 거리 가정은 일종의 예시이며, 유클리드 거리를 포함하는 다양한 거리 척도에 의해 불확실성 변화 요소가 결정될 수 있다(수학식 3 의 β와 c는 사전에 설정된 초매개변수로서 환경과 설정에 따라 다르다). 이때, 의 다음 t+1시점에서의 값 은 일정한 제한 조건을 만족하면서 변화하게 되는데, 그 제한 조건은 수학식 3의 두번째 s.t 표기 부분을 따른 다. 즉, 전체 불확실성은 데이터 불확실성을 하한 값으로 갖게 된다고 가정되므로 이 보다 낮은 값을 가질 수 는 없다고 가정한다. 시점 t와 t+1 사이에서 전체 데이터 집합 X에 대해 변화하는 불확실성의 양은 수학식 3의 3번째로 정의된 바와 같이 일종의 보상으로 정의되어 추후 상호작용하게 될 불확실성 변조 정책 모듈에 제 공된다. 즉, 불확실성의 변화량이 클 경우 높은 보상이 되어 불확실성 변조 정책 모듈에 주어진다. 불확실성 변조 정책 모듈 불확실성 변조 정책 모듈은 강화학습 알고리즘으로서 인간의 불확실성을 가장 최소화할 수 있는 학습 시퀀 스를 찾는 역할을 수행한다. 불확실성 변조 정책 모듈의 동작 구조는 일반적인 강화학습의 알고리즘을 따 르고 있으므로 다양한 강화학습 알고리즘(예를 들어, A2C, Reinforcer 등)이 구현 요소로 적용될 수 있다. 강 화학습에 적용되는 기본 요소를 불확실성 변조 정책 모듈에 대응하면 다음과 같다. 1. State(상태): h에게 학습 데이터로 제시될 데이터 후보군 중 이미 학습이 완료된 데이터와 그렇지 아니하는 데이터를 표기한 매트릭스를 의미한다. 다만, 매트릭스는 표기의 예시에 불과하다. 예를 들어, 학습 데이터로제시될 후보가 1번부터 9번까지의 인덱스를 갖는 데이터이고 시퀀스 시점 3에서 현재까지 1, 5, 6번 인덱스의 데이터가 이미 학습데이터로 제시된 상태라고 하면 이 상태는 1,0,0,0,1,1,0,0,0으로 표기된 매트릭스나 리스트 등 그 밖에 다양한 방법으로 표기할 수 있다. 2. Action(행동): 학습데이터 후보 중 현 시점에서 h에게 학습데이터로 제시할 데이터의 인덱스를 의미한다. 3. Reward(보상): 특정 행동을 하였을 때 발생하는 h의 전체 불확실성의 감소량을 의미한다. 불확실성 변조 정책 모듈은 불확실성 변화 시뮬레이션 모듈을 환경(environment) 모델로 하여 환경 모델과 상호작용하는 강화 학습 알고리즘이다. 환경 모델에 행동으로 학습 데이터 인덱스와 현재 시점 t의 상 태를 제공하면 환경 모델은 그 다음 t+1 시점의 상태(이전 상태에서 행동으로 받은 학습 데이터의 인덱스를 학 습 완료로 표기한 데이터 구조를 반환)와 전체 불확실성 변화량을 보상으로 반환한다(도 4의 우측 도시 참조). 불확실성 변조 정책 모듈은 환경 모델과의 반복적인 상호작용을 통해 인간의 불확실성을 가장 최소화할 수 있는 시퀀스를 정책으로 학습한다. 인간의 불확실성은 동일한 학습 데이터 군이라도 그 학습 시퀀스에 따라 전 체 불확실성의 변화량이 다르므로 다수의 학습 데이터 후보가 존재하는 상황에서 이를 해석적으로 찾아내기는 어렵다. 따라서, 최적의 시퀀스를 찾기 위해서는 시퀀스를 근사적으로 찾는 강화학습 알고리즘이 필요하다. 그러나, 불확실성 변조 정책 모듈은 불확실성을 최소화하는 학습 시퀀스를 강화학습 요소에 대응하여 근사 적으로 찾아내는 특징을 포함하고 있다. 본 발명에 따른 인간 고속 학습 유도 시스템은 인간의 불확실성에 의한 고속 학습 원리에 기반하여 학습 데이터가 적을 때 인간의 학습을 고도화하여 잠재된 데이터의 분포를 추정할 수 있는 인간의 인지적 능력을 극 대화한다. 이러한 기술은 인간 불확실성 추정을 위한 (인간이 직접 수행할 수 없는 비선형성 추정)기계학습 기 술과 인간의 고유한 고속 학습을 공학적으로 유도하는 기계학습 기술을 융합 공학 기술이 적용되고, 나아가 고 속 학습한 인간의 피드백을 통해 인공지능의 정보를 증폭하고 (인공지능이 할 수 없는 고속 학습 능력의 이용) 그 증폭된 정보의 양을 정량화하는 융합 기술에 해당된다. 한 가지 실시예로, 의료영상을 판독하는 의사와 인공지능 시스템이 상호작용 할 때, 의료영상을 학습하기 위한 양질의 학습데이터가 부족하거나 의사의 학습에 시간 등 학습 자원의 소요가 클 때 본 발명에 따른 인간 고속 학습 유도 시스템을 적용하여 학습하면 의사 또는 인공지능 시스템이 단독으로 학습하거나 전통적인 인간- 인공지능 상호작용 방법에 의해 학습하는 경우에 비하여 증폭 학습이 가능하여 의사 및 인공지능 시스템의 학습 및 판독 성능이 크게 향상될 수 있다. 또는, 의사와 인공지능의 상호작용의 반복을 통해 학습 성능의 추가적인 향상을 유도하거나 인공지능 시스템을 이용한 의사의 학습 고도화라는 단방향 학습 프레임워크로도 적용할 수 있다. 본 발명에 따른 인간 고속 학습 유도 시스템의 적용이 가능한 기술 분야는 다음과 같다. 교육 및 학습 분야: 인간과 인공지능 시스템의 학습을 극대화할 수 있는 교육 컨텐츠는 불확실성이 높고 적 절한 학습데이터를 확보하기 어려운 분야이므로 교육과 학습이 필요한 대부분의 분야에서 이 기술을 응용할 수 있다. 예를 들어, 맞춤형 교육 컨텐츠 개발 등은 단기간에 학습자의 전반적인 학습 영역을 가장 효율적으로 학 습할 수 있도록 하는 목적을 가지고 있다. 이 시스템은 개별 사용자의 불확실성에 기반한 교육 및 학습 최적화 에 직접적인 응용이 가능하다. 전문가 시스템 분야: 전문가의 교육 및 학습을 비롯하여 소비자의 요구에 따라서 세부 전문가를 정밀하게 교육 및 추천하여야 할 필요가 있는 분야에서 전문가의 추천, 전문가의 역량 향상 등에 폭넓게 사용할 수 있다. 예를 들어, 고도의 전문 분야에 특화된 의료기관에서는 해당 분야 전문 의사의 교육 또는 인공지능 시스템의 학 습에 적용할 데이터가 부족하다. 이 경우 본 발명을 통한 고효율 정밀 교육이 가능하다. 디지털 헬스/진단 보조 시스템: 본 발명은 인간 전문가(의사)의 도움으로 최소 학습 자원을 이용하여 의료 진단을 위한 인공지능 시스템을 고도화하는 최적화 문제에 직접 적용될 수 있다. 의료용 인공지능에서 양질의 학습 데이터를 확보하기 어려운 문제는 지속적으로 제기되어 왔으나 해결이 어려운 문제이며, 본 발명은 데이터 부족의 문제에 직접 대응이 가능하여 인공지능 응용 의료 시스템의 성능 개선에 활용 가능하다. 인간-인공지능 상호작용이 필요한 모든 분야: 사용자와 인공지능 시스템이 끊임없이 상호작용하여야 하는 분야, 예를 들어 자율주행시스템 등에서 잠재적으로 본 발명을 활용하여 단기간에 신뢰도 있는 과업 달성이 가 능할 수 있다. 상기한 기술 분야 이외에도, 헬스케어 소프트웨어 및 하드웨어 제품군을 가진 분야, 인간-컴퓨터 상호작용(HCI) 서비스 분야, IoT 시스템, 스마트 교육 분야, 의료 및 법률 분야 등 전문가 활용이 필요한 분야로서 인간과 인 공지능의 상호작용이 요구되는 모든 분야에 본 발명의 적용이 가능하다. 이처럼 본 발명의 실시예들에 따르면, 인간과 인공지능이 가진 서로 다른 학습 특성을 상대방의 학습에 상호 활 용하도록 하여 정보의 증폭을 유도함으로써 제한된 학습 환경에서 인간과 인공지능의 학습 수준을 극대화할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 프로세서, 콘트롤 러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 컴퓨 터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분 산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 이때, 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하는 것일 수도 있다. 또한, 매체는 단일 또는 수 개의 하드웨어가 결합된 형태의 다양한 기록수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트 워크 상에 분산 존재하는 것일 수도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같 은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체의 예시로, 어플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어 를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다."}
{"patent_id": "10-2022-0158566", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2022-0158566", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 있어서 컴퓨터 장치의 내부 구성의 일례를 설명하기 위한 블록도이다. 도 2는 본 발명의 일실시예에 있어서 인간-인공지능 상호작용에 따른 정보 증폭 과정을 도시한 것이다. 도 3은 본 발명의 일실시예에 있어서 인간 고속 학습 제어 시스템의 구성요소를 도시한 블록도이다. 도 4는 본 발명의 일실시예에 있어서 인간-인공지능 상호작용에 따른 학습 데이터 시퀀스 생성 과정을 설명하기 위한 예시 도면이다."}
