{"patent_id": "10-2023-0096321", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0015210", "출원번호": "10-2023-0096321", "발명의 명칭": "암 환자 의료데이터를 기초로 한 의료 서비스 제공 시스템", "출원인": "이진원", "발명자": "이진원"}}
{"patent_id": "10-2023-0096321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "임상연구심의위원회의 승인을 통해 환자의 의료데이터를 추출하는 의료데이터 추출부; 상기 의료데이터 추출부에 의해 추출된 상기 환자의 의료데이터를 전처리 과정을 통해 질환별 또는 병원별로 독립된 데이터를 구축하는의료데이터 구축부; 상기 의료데이터 구축부에 의해 구축된 데이터를 질환별로 지능형 스프트웨어의 학습 모델을 형성하는 모델 형성부; 및 상기 모델 형성부에 의해 형성된 학습 모델을 기초로 하여 의료기관에 상기 환자에 대한 맞춤형 서비스에 대한 정보를 제공하는 정보 제공부;를 포함하는 것을 특징으로 하는 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템."}
{"patent_id": "10-2023-0096321", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템은, 임상연구심의위원회의 승인 을 통해 환자의 의료데이터를 추출하는 의료데이터 추출부; 상기 의료데이터 추출부에 의해 추출된 상기 환자의 의료데이터를 전처리 과정을 통해 질환별 또는 병원별로 독립된 데이터를 구축하는 의료데이터 구축부; 상기 의 료데이터 구축부에 의해 구축된 데이터를 질환별로 지능형 스프트웨어의 학습 모델을 형성하는 모델 형성부; 및 상기 모델 형성부에 의해 형성된 학습 모델을 기초로 하여 의료기관에 상기 환자에 대한 맞춤형 서비스에 대한 정보를 제공하는 정보 제공부;를 포함하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2023-0096321", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 암 환자 의료데이터를 기초로 한 의료 서비스 제공 시스템에 관한 것이다."}
{"patent_id": "10-2023-0096321", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷 통신 기술의 발달로 질병에 대한 진단을 의료기관에 직접 찾아가 확인하기 이전에 인터넷 등을 통해 자 신의 질환과 신체 상태의 문제점을 예측하고자 하는 현대인이 늘고 있다. 그러나 검색 포털에서 검색하는 방식으로 정확한 질병을 진단하기는 어려우며, 이에 따라 많은 현대인들이 의료 기관에 가야 할 시기를 놓치거나 웹에 서 정확하지 않은 정보를 접하게 될 가능성이 있어 이로 인한 문제가 예 상되고 있다. 한편 현대 의료계는 질병위험 점수법 등 통계적 방법 뿐 아니라 머신러닝 등의 인공지능 기법에 기반하여 환자 의 상태를 진단하기 위한 노력이 이루어지고 있다. 그러나 이러한 인공지능 등의 기술을 기반으로 사용자가 자신의 단말기 등을 이용해 간편하게 자신의 건강상태 를 진단하고 질병에 대하여 예측할 수 있도록 지원하는 방법은 전무한 실정이다. 따라서, 사용자가 자신의 건강상태에 대한 데이터를 기초로 하여 맞춤형 의료 서비스를 제공 받을 수 있도록 하 는 시스템에 대한 연구가 시급한 실정이다."}
{"patent_id": "10-2023-0096321", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 환자의 의료데이터, 즉, 진료정보, 영상정보, 유전체정보, 생활습관정보 등을 기초로 하여 질 환별 지능형 소프트웨어의 학습 모델을 형성하고, 이를 기초로 환자에게 맞춤형 의료 서비스를 제공하기 위한 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0096321", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템은, 임상연구심의위원회의 승인 을 통해 환자의 의료데이터를 추출하는 의료데이터 추출부; 상기 의료데이터 추출부에 의해 추출된 상기 환자의 의료데이터를 전처리 과정을 통해 질환별 또는 병원별로 독립된 데이터를 구축하는 의료데이터 구축부; 상기 의 료데이터 구축부에 의해 구축된 데이터를 질환별로 지능형 스프트웨어의 학습 모델을 형성하는 모델 형성부; 및 상기 모델 형성부에 의해 형성된 학습 모델을 기초로 하여 의료기관에 상기 환자에 대한 맞춤형 서비스에 대한 정보를 제공하는 정보 제공부;를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템의 상기 모델 형성부는, 예측, 진단, 치료, 예후 및 시각화 중 적어도 하나에 대한 학습 모델을 포함하는 것을 특징으로 할 수 있다.본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템의 상기 의료데이터는, 진료정 보, 영상정보, 유전체정보, 생활습관정보, 심전도 및 심장음 중 적어도 하나를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템의 상기 정보 제공부는, 맞춤형 서비스에 대한 정보를 시각화하여 제공하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2023-0096321", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템에 의하면, 환자의 진료정보, 영상정보, 유전체정보, 생활습관정보 등을 통해 질환, 질병, 건강상태, 기대여명 등 환자에게 맞춤형 의료 서비 스를 제공할 수 있다."}
{"patent_id": "10-2023-0096321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 구체적인 실시예를 상세하게 설명한다. 다만, 본 발명의 사상은 제시되 는 실시예에 제한되지 아니하고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서 다른 구성요 소를 추가, 변경, 삭제 등을 통하여, 퇴보적인 다른 발명이나 본 발명 사상의 범위 내에 포함되는 다른 실시예 를 용이하게 제안할 수 있을 것이나, 이 또한 본원 발명 사상 범위 내에 포함된다고 할 것이다. 또한, 각 실시예의 도면에 나타나는 동일한 사상의 범위 내의 기능이 동일한 구성요소는 동일한 참조부호를 사 용하여 설명한다. 도 1은 본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템을 설명하기 위한 블록 구성도이다. 도 1을 참조하면, 본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템은 의료 데이터 추출부, 의료데이터 구축부, 모델 형성부 및 정보 제공부를 포함할 있다. 상기 의료데이터 추출부는 임상연구심의위원회의 승인을 통해 환자의 의료데이터를 추출하는 구성요소일 수 있다. 상기 의료데이터는 진료정보, 영상정보, 유전체정보, 생활습관정보, 심전도 및 심장음 중 적어도 하나를 포함할 수 있으나, 반드시 이에 한정되는 것은 아니며 이외의 다양한 환자의 건강 상태를 표현할 수 있는 정보를 모두 포함하는 개념일 수 있다. 상기 의료데이터 구축부는 상기 의료데이터 추출부에 의해 추출된 상기 환자의 의료데이터를 전처리 과정을 통해 질환별 또는 병원별로 독립된 데이터를 구축하는 구성요소일 수 있다. 상기 모델 형성부는 상기 의료데이터 구축부에 의해 구축된 데이터를 질환별로 지능형 스프트웨어의 학습 모델을 형성하는 구성요소일 수 있다. 상기 모델 형성부는 심뇌혈관질환, 심장질환, 유방암, 대장암, 전립선암, 치매, 뇌전증 및 소아희귀난치성 유전질환 중 적어도 하나 별로 학습 모델을 형성할 수 있다. 정보 제공부는 상기 모델 형성부에 의해 형성된 학습 모델을 기초로 하여 의료기관에 상기 환자에 대 한 맞춤형 서비스에 대한 정보를 제공하기 위한 구성요소일 수 있다. 상기 정보 제공부는 상기 모델 형성부에 의해 형성된 학습 모델을 기초로 하여 환자의 질병, 질환, 건강상태 또는 기대여명에 대한 맞춤형 정보를 제공할 수 있다. 상기 모델 형성부는 예측, 진단, 치료, 예후 및 시각화 중 적어도 하나에 대한 학습 모델을 포함할 수 있 다. 상기 정보 제공부는 맞춤형 서비스에 대한 정보를 시각화하여 제공할 수 있다. 도 2는 본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템을 설명하기 위한 전체 적인 개념도이다. 도 2를 참조하면, 본 발명에 따른 시스템은 통합 공통 플랫폼으로 정의될 수 있으며, 클라우드 플랫폼 위 에서 구동되는 학습 영역(개발 zone에 속함)과 서비스 연계 영역(서비스 zone)을 포함할 수 있다. 여기서, 학습 영역은 지능형 소프트웨어를 통해 알고리즘을 모델화하는 영역으로 학습 영역의 결과물을 학습 모 델이라 정의되며, 서비스 연계 영역은 학습 모델을 서비스화하여 제공하기 위한 연계 영역으로 해당 영역으로 옮겨진 학습 모델(서비스 모델)을 API 방식 등으로 연계하여 각 병원의 로컬 영역으로 배포될 수 있게 된다. 즉, 본 발명에 따른 시스템은 8개 질환 별로 지능형 소프트웨어의 학습 모델을 만들고 검증하는 과정을 거 쳐 실제 서비스할 수 있는 상태로 배포할 수 있는 서비스 모델까지 만들어 주는 역할을 할 수 있다. 본 발명에 따른 시스템은 지능형 소프트웨어의 학습 모델을 만들 수 있는 환경을 제공하고, 만들어진 학습 모델을 서비스 단계에 이르는 개발 과정에서의 중개 공간으로서 SW개발 기업과 병원 간의 원활한 연결 및 소통 이 이루어지도록 조율하는 기능을 할 수 있다. 본 발명에 따른 시스템은 환자 및 의사에게는 사용자 권한을 부여하고, 인증 소프트웨어를 지원하게 되며, 의료기관에게는 특정 질환 연구를 위한 데이터의 표준화 시스템을 제공하게 된다. 표준화 시스템은 데이터 표준화 프로토콜을 활용하고 다기관 협력연구를 통한 빅데이터 인공지능의 저변을 확대 시키게 된다. 한편, 본 발명에 따른 시스템은 클라우드 공급기관에게는 의료 데이터 뱅크 구축의 노하우를 제공하고, 데 이터 추가 고도화를 수행하게 한다. 본 발명에 따른 시스템은 인공지능 기술개발을 위한 오픈 플랫폼 및 오픈 데이터셋을 부각시키고, 비의료 분야의 인공지능 기술 개발을 위한 기존의 오픈 플랫폼 및 오픈 데이터셋은 다수 존재하여 전세계의 인공지능 전문가들이 이를 통해 다양한 솔루션을 제시하고 공유와 경쟁을 통해 알고리즘의 개발과 개선을 촉진시킬 수 있 다. 본 발명에 따른 시스템은 인공지능 학습용 의료데이터 연계 통합 플랫폼이라고 볼 수 있으며, 의료 인공지 능 검증 시스템의 확장이자 데이터셋 구축 기반의 기술이라 할 수 있다. 의료 인공지능 소프트웨어 개발 및 검증의 동향이 단일기관 폐쇄형 데이터셋 기반 검증에서 다기관 오픈형 데이 터셋 기반으로 바뀌는 추세이고, 다기관의 데이터셋을 구축하고 이를 인공지능 개발 및 검증에 활용하기 위한 의료데이터 연계통합 플랫폼이 필수적이며, 같은 인공지능 모델도 데이터 (전)처리기법에 따라 성능이 상이해지 는 것이 일반적이다. 따라서 표준화, 비식별화, 클렌징, 레이블링 등의 데이터셋 구축에 대한 선행 기술 개발 및 고도화가 성공적인 지능형 의료 소프트웨어 개발에 필수적이다. 개발된 의료 소프트웨어의 활용을 위해 의료데이터의 소유권 문제, 개인정보 보호법 등의 법·제도적 문제를 해 결한 학습용 공공 의료데이터가 필요할 것이다. 한편, 본 발명에 따른 시스템에서 사용되는 환자의 의료데이터는 전술한 정보 이외에 특정 질병과 유관하 다고 판단되는 사용자의 개인정보를 포함할 수 있으며, 예를 들어, 신체적 특징 정보, 유전 정보, 식생활 정보 및 생활 패턴 정보를 포함할 수 있다. 신체적 특징 정보는 성별, 키, 몸무게, 체지방률 등이 해당될 수 있다. 다양한 실시 예에 따라 상기 신체적 특징 정보는 윗몸일으키기, 팔굽혀펴기, 턱걸이 등의 체력측정 정보를 포함 할 수 있다. 또한, 상기 신체적 특징 정보는 사용자 의 통증 관련 정보(예, 속쓰림, 두통, 저림 증상, 오환 등의 여부)를 포 함할 수 있다. 또한, 상기 신체적 특징 정보는 과거 투병 이력, 임상검사 및 치료와 관련된 정보를 포함할 수 있다. 유전 정보는 사용자의 유전형, 특정 질환에 대한 가족력이 있는지 여부, 알레르기 보유 여부 등 특정 질환과 관 련된 선천적 요인에 관한 것일 수 있다. 또한, 식생활 정보는 일정 기간(예, 1주일)동안 평균 음주 횟수, 섭취 열량, 식단, 아침식사 여부 등 식생활과 관련된 정보들이 해당될 수 있다. 상기 생활 패턴 정보는 일정 기간(예, 1주일)동안 운동 횟수, 시행하는 운동의 종류, 업무 분류(실내 근무 여부 에 따른 분류, 감정노동 강도별 분류, 근무 시 운동량에 따른 분류 등), 흡연여부와 같이 식생활 이외의 생활패 턴에 관한 정보를 포함할 수 있다. 정보 제공부는 상기 모델 형성부에 의해 형성된 학습 모델을 기초로 하여 맞춤형 의료 서비스를 제공 하기 위해, 기계학습 이외에 로지스틱 회귀분석법 등의 기법을 사용할 수도 있다. 상기 정보 제공부는 기계학습법, 로지스틱 회귀분석법 등의 방법을 통해 질병을 예측하고, 예측 정보를 추 적관리하며, 환자의 실제 질병 보유 여부 , 치료 관련 정보 등을 주기적으로 수집하여 이를 기반으로 질병 예측 에 대한 결과에 대한 수정작업을 수행할 수 있다. 상기 정보 제공부 는 질병 예측의 방식으로 해당 질병을 현재 보유하고 있을 확률 정보, 해당 질병이 발병 할 확률 정보, 환자의 예후 예측 정보 등을 제시할 수 있다. 특히, 상기 정보 제공부 는 특정 질병에 대한 기간별 발병 위험을 수치적으로 나타낼 수 있다. 한편, 환자의 의료데이터는 익명화 처리가 될 수 있다. 익명화는 의료데이터를 개인 식별 불가능하도록 처리하는 과정을 의미하며, 기본 동작으로는 개인식별자(주민등 록번호, 주소, 환자 ID 등)이 들어갈 수 있는 필드에서 해당 정보를 찾아 비식별 처리하는 동작일 수 있다. 만약, 고해상도 의료 영상 (MRI, CT)를 3D로 처리하는 경우, 안면(사람의 얼굴모양) 인식 가능성을 없애는 처리 를 의미할 수 있다. 환자의 의료데이터는 데이터 에러 클랜징 소프트웨어에 의해 각종 에러(노이즈에 의한 데이터 오류, 실수에 의 한 데이터 오류 등)가 정리될 수 있다. 본 발명에 따른 시스템은 기술적 측면에서 의료 인공지능 데이터뱅크 구축 및 활성화, 인공지능 기반 지능 형 의료 소프트웨어 개발을 촉진시킬 수 있다. 본 발명은 의료데이터 생성, 수집, 축적, 수집, 분석에서 활용에 이르는 다양한 원천 기술 확보 및 융합 연구를 통한 새로운 패러다임 도출을 촉진시키고, 환자에 관한 동태적인 데이터를 확보함으로써 체계화된 임상 정보 데 이터베이스를 구축해 향후 다양한 연구에 활용이 기대되게 할 수 있다. 또한, 의료데이터 통합적 활용 인프라 개발을 통해 유관기관 간 교류 증진 및 ICT 융합 의료데이터 분석기술 및 솔루션 개발의 선도적 위치를 확보 가능하게 할 수 있으며, 예방, 진단, 치료, 관리에 최적화된 임상결정지원시 스템 자원 및 도구로 활용될 수 있다. 또한, 조기 진단시스템을 고도화하여 단순 치료제 개발의 한계에서 벗어나 효율성 제고 및 의료서비스의 질을 향상시킬 수 있다. 또한, 본 발명에 따른 시스템은 국가 재정의 효율적 집행 및 의료비 절감을 통한 의료의 질을 향상시킬 수 있는 동시에 조기 예측을 통한 자기 주도적 예방이 가능하도록 할 수 있다. 자신의 건강검진 정보를 이용해 질환 발병 위험도를 확인하여 가정에서 자기 주도적 건강관리의 실질적인 행동 변화 동기를 부여하고, 불필요한 검사를 감소시켜 환자가 부담하는 의료비용의 절감 효과를 기대할 수 있다. 상기에서는 본 발명에 따른 실시예를 기준으로 본 발명의 구성과 특징을 설명하였으나 본 발명은 이에 한정되지"}
{"patent_id": "10-2023-0096321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "않으며, 본 발명의 사상과 범위 내에서 다양하게 변경 또는 변형할 수 있음은 본 발명이 속하는 기술분야의 당 업자에게 명백한 것이며, 따라서 이와 같은 변경 또는 변형은 첨부된 특허청구범위에 속함을 밝혀둔다.도면 도면1 도면2"}
{"patent_id": "10-2023-0096321", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템을 설명하기 위한 블록 구성도. 도 2는 본 발명에 따른 환자의 의료데이터를 기초로 한 맞춤형 의료 서비스 제공 시스템을 설명하기 위한 전체 적인 개념도."}
