{"patent_id": "10-2023-0110115", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0028901", "출원번호": "10-2023-0110115", "발명의 명칭": "초점 거리 결정 방법 및 상기 방법을 수행하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이상원"}}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,프로세서; 렌즈를 포함하는 카메라; 및상기 프로세서에 의해 실행 가능한 명령어를 포함하는 메모리를 포함하고,상기 프로세서는,상기 명령어가 실행될 때, 상기 렌즈를 이용하여 복수의 원본 영상들을 획득하고;상기 복수의 원본 영상들을 이용하여, 합성 영상을 생성하고;상기 복수의 원본 영상들 중 하나 이상의 원본 영상 및 상기 합성 영상을 AF(auto focus) 모델에 입력하여, 상기 렌즈의 초점 거리를 결정하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 복수의 원본 영상들 중에서 선택된 기준 프레임의 원본 영상과 나머지 프레임의 원본 영상들과의 오차를계산하고;상기 오차가 설정된 임계값 이내인 원본 영상들 및 상기 기준 프레임의 원본 영상을 이용하여, 상기 합성 영상을 생성하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는,상기 기준 프레임의 원본 영상의 픽셀 값과 상기 나머지 프레임의 원본 영상들의 픽셀 값을 이용하여, 상기 오차를 계산하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는,공개특허 10-2025-0028901-3-상기 복수의 원본 영상들을 프레임 정렬(frame alignment)하여 보정하고;상기 보정된 복수의 원본 영상들을 이용하여, 상기 합성 영상을 생성하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 AF 모델은,상기 복수의 원본 영상 중 하나 이상 및 상기 복수의 원본 영상으로부터 생성된 합성 영상을 입력 받아, 상기합성 영상에 대한 초점 거리를 출력하고, 복수의 레이어들을 포함하는 CNN(convolution neural network)인,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 AF 모델은,상기 합성 영상의 대비를 검출하여 상기 초점 거리를 결정하거나, 또는 상기 합성 영상의 위상 차를 이용하여상기 초점 거리를 결정하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "전자 장치에 있어서,프로세서; 렌즈를 포함하는 카메라; 및상기 프로세서에 의해 실행 가능한 명령어를 포함하는 메모리를 포함하고,상기 프로세서는,상기 명령어가 실행될 때, 상기 렌즈를 이용하여 복수의 원본 영상들을 획득하고;상기 복수의 원본 영상들을 이용하여, 합성 영상을 생성하고;상기 합성 영상을 AF(auto focus) 모델에 입력하여, 상기 렌즈의 초점 거리를 결정하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 복수의 원본 영상들 중에서 선택된 기준 프레임의 원본 영상과 나머지 프레임의 원본 영상들과의 오차를계산하고;상기 오차가 설정된 임계값 이내인 원본 영상들 및 상기 기준 프레임의 원본 영상을 이용하여, 상기 합성 영상공개특허 10-2025-0028901-4-을 생성하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는,상기 기준 프레임의 원본 영상의 픽셀 값과 상기 나머지 프레임의 원본 영상들의 픽셀 값을 이용하여, 상기 오차를 계산하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 프로세서는,상기 복수의 원본 영상들을 프레임 정렬(frame alignment)하여 보정하고;상기 보정된 복수의 원본 영상들을 이용하여, 상기 합성 영상을 생성하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 AF 모델은,상기 복수의 원본 영상 중 하나 이상 및 상기 복수의 원본 영상으로부터 생성된 합성 영상을 입력 받아, 상기합성 영상에 대한 초점 거리를 출력하고, 복수의 레이어들을 포함하는 CNN인,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 AF 모델은,상기 합성 영상의 대비를 검출하여 상기 초점 거리를 결정하거나, 또는 상기 합성 영상의 위상 차를 이용하여상기 초점 거리를 결정하는,전자 장치."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "렌즈를 이용하여 복수의 원본 영상들을 획득하는 동작;상기 복수의 원본 영상들을 이용하여, 합성 영상을 생성하는 동작; 및상기 합성 영상을 AF(auto focus) 모델에 입력하여, 상기 렌즈의 초점 거리를 결정하는 동작을 포함하는,공개특허 10-2025-0028901-5-초점 거리 결정 방법."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 합성 영상을 생성하는 동작은,상기 복수의 원본 영상들 중에서 선택된 기준 프레임의 원본 영상과 나머지 프레임의 원본 영상들과의 오차를계산하는 동작; 및상기 오차가 설정된 임계값 이내인 원본 영상들 및 상기 기준 프레임의 원본 영상을 이용하여, 상기 합성 영상을 생성하는 동작을 포함하는,초점 거리 결정 방법."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 오차를 계산하는 동작은,상기 기준 프레임의 원본 영상의 픽셀 값과 상기 나머지 프레임의 원본 영상들의 픽셀 값을 이용하여, 상기 오차를 계산하는 동작을 포함하는,초점 거리 결정 방법."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 합성 영상을 생성하는 동작은,상기 복수의 원본 영상들을 프레임 정렬(frame alignment)하여 보정하는 동작; 및상기 보정된 복수의 원본 영상들을 이용하여, 상기 합성 영상을 생성하는 동작을 포함하는,초점 거리 결정 방법."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 AF 모델은,상기 복수의 원본 영상 중 하나 이상 및 상기 복수의 원본 영상으로부터 생성된 합성 영상을 입력 받아, 상기합성 영상에 대한 초점 거리를 출력하고, 복수의 레이어들을 포함하는 CNN인,초점 거리 결정 방법."}
{"patent_id": "10-2023-0110115", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2025-0028901-6-제13항에 있어서,상기 초점 거리를 결정하는 동작은,상기 AF 모델을 이용하여, 상기 합성 영상의 대비를 검출하여 상기 초점 거리를 결정하거나, 또는 상기 합성 영상의 위상 차를 이용하여 상기 초점 거리를 결정하는,초점 거리 결정 방법."}
{"patent_id": "10-2023-0110115", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "초점 거리 결정 방법 및 상기 방법을 수행하는 전자 장치가 개시된다. 일 실시예에 따른 전자 장치는 프로세서, 렌즈를 포함하는 카메라 및 상기 프로세서에 의해 실행 가능한 명령어를 포함하는 메모리를 포함하고, 상기 프로 세서는, 상기 명령어가 실행될 때, 상기 렌즈를 이용하여 복수의 원본 영상들을 획득하고, 상기 복수의 원본 영 상들을 이용하여, 합성 영상을 생성하고, 상기 복수의 원본 영상들 중 하나 이상의 원본 영상 및 상기 합성 영상 을 AF(auto focus) 모델에 입력하여, 상기 렌즈의 초점 거리를 결정할 수 있다."}
{"patent_id": "10-2023-0110115", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 개시는 초점 거리 결정 방법 및 상기 방법을 수행하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0110115", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대비 검출 방식(contrast detection autofocus, CDAF)과 위상차 검출 방식(phase detection autofocus, PDAF) 을 이용하여, 카메라에서 자동으로 초점을 맞출 수 있다. CDAF 방법은 영상 내의 대비(contrast)를 계산하는 메트릭(metric)을 정의하고, 대비가 최댓값인 렌즈의 위치에 서 초점이 맞았다고 판단한다. 위상차 검출 방식인 PDAF 방법은 렌즈를 통해 들어오는 빛을 두 갈래로 나누어서 비교하고, 두 빛의 위상이 같 을 때 초점이 맞았다고 판단한다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련된 종래 기술(prior art)로서 적용될 수 있는지에 대하여 어떠한 주장이 나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0110115", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들에 따른 전자 장치는 프로세서, 렌즈를 포함하는 카메라 및 상기 프로세서에 의해 실행 가능한 명령어를 포함하는 메모리를 포함하고, 상기 프로세서는, 상기 명령어가 실행될 때, 상기 렌즈를 이용하여 복수 의 원본 영상들을 획득하고, 상기 복수의 원본 영상들을 이용하여, 합성 영상을 생성하고, 상기 복수의 원본 영 상들 중 하나 이상의 원본 영상 및 상기 합성 영상을 AF(auto focus) 모델에 입력하여, 상기 렌즈의 초점 거리 를 결정할 수 있다. 상기 프로세서는, 상기 복수의 원본 영상들 중에서 선택된 기준 프레임의 원본 영상과 나머지 프레임의 원본 영 상들과의 오차를 계산하고, 상기 오차가 설정된 임계값 이내인 원본 영상들 및 상기 기준 프레임의 원본 영상을 이용하여, 상기 합성 영상을 생성할 수 있다. 상기 프로세서는, 상기 기준 프레임의 원본 영상의 픽셀 값과 상기 나머지 프레임의 원본 영상들의 픽셀 값을 이용하여, 상기 오차를 계산할 수 있다. 상기 프로세서는, 상기 복수의 원본 영상들을 프레임 정렬(frame alignment)하여 보정하고, 상기 보정된 복수의 원본 영상들을 이용하여, 상기 합성 영상을 생성할 수 있다. 상기 AF 모델은, 상기 복수의 원본 영상 중 하나 이상 및 상기 복수의 원본 영상으로부터 생성된 합성 영상을 입력 받아, 상기 합성 영상에 대한 초점 거리를 출력하고, 복수의 레이어들을 포함하는 CNN(convolution neural network)일 수 있다. 상기 AF 모델은, 상기 합성 영상의 대비를 검출하여 상기 초점 거리를 결정하거나, 또는 상기 합성 영상의 위상 차를 이용하여 상기 초점 거리를 결정할 수 있다. 다양한 실시예들에 따른 전자 장치는 프로세서, 렌즈를 포함하는 카메라 및 상기 프로세서에 의해 실행 가능한 명령어를 포함하는 메모리를 포함하고, 상기 프로세서는, 상기 명령어가 실행될 때, 상기 렌즈를 이용하여 복수 의 원본 영상들을 획득하고, 상기 복수의 원본 영상들을 이용하여, 합성 영상을 생성하고, 상기 합성 영상을AF(auto focus) 모델에 입력하여, 상기 렌즈의 초점 거리를 결정할 수 있다. 상기 프로세서는, 상기 복수의 원본 영상들 중에서 선택된 기준 프레임의 원본 영상과 나머지 프레임의 원본 영 상들과의 오차를 계산하고, 상기 오차가 설정된 임계값 이내인 원본 영상들 및 상기 기준 프레임의 원본 영상을 이용하여, 상기 합성 영상을 생성할 수 있다. 상기 프로세서는, 상기 기준 프레임의 원본 영상의 픽셀 값과 상기 나머지 프레임의 원본 영상들의 픽셀 값을 이용하여, 상기 오차를 계산할 수 있다. 상기 프로세서는, 상기 복수의 원본 영상들을 프레임 정렬(frame alignment)하여 보정하고, 상기 보정된 복수의 원본 영상들을 이용하여, 상기 합성 영상을 생성할 수 있다. 상기 AF 모델은, 상기 복수의 원본 영상 중 하나 이상 및 상기 복수의 원본 영상으로부터 생성된 합성 영상을 입력하여, 상기 합성 영상에 대한 초점 거리를 출력하고, 복수의 레이어들을 포함하는 CNN일 수 있다. 상기 AF 모델은, 상기 합성 영상의 대비를 검출하여 상기 초점 거리를 결정하거나, 또는 상기 합성 영상의 위상 차를 이용하여 상기 초점 거리를 결정할 수 있다. 다양한 실시예들에 따른 초점 거리 결정 방법은 렌즈를 이용하여 복수의 원본 영상들을 획득하는 동작, 상기 복 수의 원본 영상들을 이용하여, 합성 영상을 생성하는 동작 및 상기 합성 영상을 AF(auto focus) 모델에 입력하 여, 상기 렌즈의 초점 거리를 결정하는 동작을 포함할 수 있다. 상기 합성 영상을 생성하는 동작은, 상기 복수의 원본 영상들 중에서 선택된 기준 프레임의 원본 영상과 나머지 프레임의 원본 영상들과의 오차를 계산하는 동작 및 상기 오차가 설정된 임계값 이내인 원본 영상들 및 상기 기 준 프레임의 원본 영상을 이용하여, 상기 합성 영상을 생성하는 동작을 포함할 수 있다. 상기 오차를 계산하는 동작은, 상기 기준 프레임의 원본 영상의 픽셀 값과 상기 나머지 프레임의 원본 영상들의 픽셀 값을 이용하여, 상기 오차를 계산하는 동작을 포함할 수 있다. 상기 합성 영상을 생성하는 동작은, 상기 복수의 원본 영상들을 프레임 정렬(frame alignment)하여 보정하는 동 작 및 상기 보정된 복수의 원본 영상들을 이용하여, 상기 합성 영상을 생성하는 동작을 포함할 수 있다. 상기 AF 모델은, 상기 복수의 원본 영상 중 하나 이상 및 상기 복수의 원본 영상으로부터 생성된 합성 영상을 입력 받아, 상기 합성 영상에 대한 초점 거리를 출력하고, 복수의 레이어들을 포함하는 CNN일 수 있다. 상기 초점 거리를 결정하는 동작은, 상기 AF 모델을 이용하여, 상기 합성 영상의 대비를 검출하여 상기 초점 거 리를 결정하거나, 또는 상기 합성 영상의 위상 차를 이용하여 상기 초점 거리를 결정할 수 있다."}
{"patent_id": "10-2023-0110115", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "실시예들에 대한 특정한 구조적 또는 기능적 설명들은 단지 예시를 위한 목적으로 개시된 것으로서, 다양한 형 태로 변경되어 구현될 수 있다. 따라서, 실제 구현되는 형태는 개시된 특정 실시예로만 한정되는 것이 아니며, 본 명세서의 범위는 실시예들로 설명한 기술적 사상에 포함되는 변경, 균등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성요소 를 다른 구성요소로부터 구별하는 목적으로만 해석되어야 한다. 예를 들어, 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다.어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 설명된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함 으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들 을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 해당 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되 는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 실시예들을 첨부된 도면들을 참조하여 상세하게 설명한다. 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부여하고, 이에 대한 중복되는 설명은 생략하기로 한 다. 도 1은 다양한 실시예들에 따른 전자 장치의 개략적인 블록도이다. 도 1을 참조하면, 다양한 실시예들에 따른 전자 장치는 메모리, 프로세서, 카메라를 포함 할 수 있다. 전자 장치는 휴대폰, 스마트 폰, 태블릿, 전자북 장치, 랩탑, 퍼스널 컴퓨터, 또는 서버와 같은 다양한 컴 퓨팅 장치, 스마트 시계, 스마트 안경, HMD(Head-Mounted Display), 또는 스마트 의류와 같은 다양한 웨어러블 기기, 스마트 스피커, 스마트 TV, 또는 스마트 냉장고와 같은 다양한 가전장치, 스마트 자동차, 스마트 키오스 크, IoT(Internet of Things) 기기, WAD(Walking Assist Device), 드론, 또는 로봇을 포함할 수 있다. 메모리는 전자 장치의 구성요소(예: 프로세서)에 의해 사용되는 다양한 데이터를 저장할 수 있 다. 예를 들어, 데이터는 카메라에 의해 촬영된 복수의 원본 영상들, 복수의 원본 영상들을 이용하여 생성한 합성 영상을 포함할 수 있다. 또한, 데이터는 소프트웨어(예: AF 모델) 및 소프트웨어와 관련된 명령에 대한 입력 데이터 및/또는 출력 데이터를 포함할 수 있다. 메모리는 추후 상세히 설명할 AF 모델의 파라미터(예: 가중치(weight) 및 바이어스(bias))를 저장할 수 있다. 메모리에 저장된 모델 파라미터는 프로세서로 로딩되어 프로세서에서 AF 모델이 구현될 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 운영 체제, 미들 웨어 또는 어플리케이션을 포함 할 수 있다. 프로세서는 전자 장치에 포함된 컴포넌트들의 동작을 제어하거나 주어진 데이터를 처리하는 장치로, 예를 들어, 중앙 처리 장치(CPU; Central Processing Unit)일 수 있으나, 전술한 예에 한정되지 않는다. 일 실시 예에 따르면, 프로세서는 메인 프로세서 및 메인 프로세서와 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세 서 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 일 실시 예에 따르면, 보조 프로세서는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공 지능 모델(예: AF 모델)은 기계 학습을 통해 생성될 수 있다. 예를 들어, 인공지능 모델은 전자 장치 , 별개의 학습 장치 또는 별개의 서버에 의하여 학습될 수 있다. 예를 들어, 학습 알고리즘은 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지 도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 이들 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 일례로, 카메라는 외부 환경을 촬영하여, 원본 영상 및/또는 복수의 원본 영상들을 획득할 수 있다. 예를 들어, 카메라는 설정된 시간 동안 설정된 프레임(frame)에 따라 복수의 원본 영상들을 획득할 수 있 다. 카메라에서 촬영된 복수의 원본 영상들은 각기 다른 시간에 촬영된 영상들이며, 예를 들어, 미리 설 정된 시간 간격으로 촬영된 연사 영상일 수 있다. 카메라는 하나 이상의 렌즈를 포함할 수 있다. 카메라 는 초점 거리에 따라 외부 환경을 촬영하기 위한 렌즈의 위치를 결정할 수 있다. 예를 들어, 복수의 원본 영상은 CMOS 이미지 센서로부터 얻은 연사 원 영상(burst raw image) 데이터일 수 있다. 복수의 원본 영상은 센서를 통해 획득할 수 있는 다양한 데이터들을 포함할 수 있다. 예를 들어, 복수 의 원본 영상은 2PD(photodiode), QPD(quad photodiode)를 통해 획득되는 위상차를 계산할 수 있는 영상, 위상 차가 없는 일반 영상을 포함할 수 있다. 전자 장치는 AF 모델을 이용하여, 렌즈의 초점 거리를 결정할 수 있다. 예를 들어, 전자 장치 는 하나 이상의 원본 영상 및/또는 합성 영상을 AF 모델에 입력하여, 렌즈에 대한 초점 거리를 결정할 수 있다. 전자 장치는 초점 거리에 따라 렌즈의 위치를 결정할 수 있다. 전자 장치는 결정된 렌즈의 위치에 따라, 카메라의 렌즈를 제어할 수 있다. 전자 장치는 복수의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 예를 들어, 전자 장치는 복수의 원본 영상들을 병합(merge)하여, 합성 영상을 생성할 수 있다. 전자 장치는 복수의 원본 영상들의 각 위치에서 픽셀값의 평균에 따라 합성 영상을 생성할 수 있다. 전자 장치는 복수의 원본 영상들의 전부 또는 일부를 이용하여 합성 영상을 생성할 수 있다. 예를 들어, 전자 장치는 복수의 원본 영상들 중에서 설정된 프레임의 원본 영상들을 합성하여 합성 영상을 생성할 수 있다. 예를 들어, 12 프레임의 원본 영상들이 획득된 경우, 전자 장치는 마지막 4 프레임의 원본 영상들 을 이용하여 합성 영상을 생성할 수 있다. 일례로, 전자 장치는 복수의 원본 영상들의 오차를 설정된 임계값과 비교하여, 합성 영상을 생성할 원본 영상들을 결정할 수 있다. 예를 들어, 전자 장치는 복수의 원본 영상들 중에서 선택된 기준 프레임의 원 본 영상과 나머지 프레임의 원본 영상들과의 오차를 계산할 수 있다. 전자 장치는 기준 프레임의 원본 영 상의 각 픽셀값(예: 강도(intensity))과 나머지 프레임의 원본 영상의 각 픽셀값의 차이의 평균으로 오차를 계 산할 수 있다. 예를 들어, 전자 장치는 기준 프레임의 원본 영상의 각 픽셀의 위치와 동일한 위치에서 나 머지 프레임의 원본 영상의 픽셀값을 비교할 수 있다. 전자 장치는 기준 프레임의 원본 영상과 나머지 프레임의 원본 영상들과의 오차를 설정된 임계값과 비교하 여, 합성 영상을 생성하기 위한 원본 영상들을 결정할 수 있다. 예를 들어, 전자 장치는 오차들 중에서 가장 작은 오차로부터 설정된 범위 이내의 오차에 대응하는 프레임의 원본 영상들을 합성 영상을 생성하기 위한 원본 영상으로 결정할 수 있다. 일례로, AF 모델은 복수의 원본 영상들 중 하나 이상의 원본 영상 및/또는 합성 영상을 이용하여, 초점 거 리를 결정할 수 있다. 예를 들어, AF 모델은 복수의 원본 영상들 중 하나 이상의 원본 영상 및/또는 합성 영상을 이용하여 CDAF(contrast detection AF) 또는 PDAF(phase detection AF)에 따라 초점 거리를 결정할 수 있다. 전자 장치는 복수의 원본 영상들을 이용하여, PDAF에 따라 초점 거리를 결정할 수 있다. 예를 들어, 전자 장치는 렌즈의 위치를 변경시키면서 복수의 원본 영상들을 촬영할 수 있다. AF 모델은 복수의 렌즈 위치에서 각각 촬영된 복수의 원본 영상들 중 하나 이상의 원본 영상을 이용하여, 영상의 선명도를 계산할 수 있다. AF 모델은 영상의 선명도가 최대가 되는 렌즈 위치를 초점 거리로 결정할 수 있다. 예를 들어, 전자 장치는 렌즈의 위치를 변경시키면서 복수의 원본 영상들을 촬영하고, 각 렌즈의 위치에서 촬영한 복수의 원본 영상들을 합성하여 합성 영상을 생성할 수 있다. AF 모델은 각 렌즈의 위치에 대응하 는 합성 영상을 이용하여, 선명도가 최대가 되는 렌즈의 위치를 초점 거리로 결정할 수 있다. 예를 들어, 전자 장치는 각각 두 개 이상의 영상을 포함하는 복수의 원본 영상들을 획득할 수 있다. AF 모델은 각각 두 개 이상의 영상을 포함하는 복수의 원본 영상들 중 하나 이상을 이용하여, PDAF에 따라 두 개 이상의 영상의 위상차를 계산할 수 있다. AF 모델은 계산된 위상차를 이용하여, 렌즈의 이동 방향 및 이동량을 결정할 수 있다. 렌즈의 이동 방향 및 이동량에 따른 렌즈의 위치는 초점 거리에 대응할 수 있다.전자 장치는 복수의 원본 영상들을 획득한 렌즈의 위치에서 결정된 렌즈의 이동 방향 및 이동량에 따라 렌 즈를 제어할 수 있다. 전자 장치는 각각 두 개 이상의 영상을 포함하는 복수의 원본 영상들을 합성하여, 두 개 이상의 영상을 포 함하는 합성 영상을 생성할 수 있다. AF 모델은 PDAF에 따라 합성 영상에 포함된 두 개 이상의 영상의 위 상차를 계산할 수 있다. AF 모델은 계산된 위상차를 이용하여, 렌즈의 이동방향 및 이동량을 결정할 수 있다. 렌즈의 이동 방향 및 이동량에 따른 렌즈의 위치는 초점 거리에 대응할 수 있다. 전자 장치는 복 수의 원본 영상들을 획득한 렌즈의 위치에서 결정된 렌즈의 이동 방향 및 이동량에 따라 렌즈를 제어할 수 있다. 일례로, AF 모델은 복수의 원본 영상들 중 하나 이상 및/또는 합성 영상을 입력하여 초점 거리를 출력하도 록 학습된 모델을 포함할 수 있다. 예를 들어, AF 모델은 복수의 원본 영상들 중 하나 이상의 원본 영상 을 입력하여, 초점 거리를 출력하도록 학습될 수 있다. 예를 들어, AF 모델은 복수의 원본 영상들을 이용 하여 생성된 합성 영상을 입력하여 초점 거리를 출력하도록 학습될 수 있다. AF 모델을 학습시키기 위한 학습 데이터는 복수의 원본 영상들 중 하나 이상 및/또는 합성 영상을 포함할 수 있다. 복수의 원본 영상들과 합성 영상에 대한 정답(ground truth)는 다양한 방법을 통해 결정될 수 있다. 예를 들어, 복수의 원본 영상들과 합성 영상에 대한 정답은 여러 대의 카메라를 활용한 멀티뷰 스테레오 (Multiview stereo) 영상에서 추정된 깊이(depth)를 활용하거나, 복수의 렌즈 위치에서 획득한 복수의 원본 영 상들을 이용하여 CDAF 방법에 따라 계산한 초점 거리를 포함할 수 있다. AF 모델은 CNN(convolution neural network)을 포함할 수 있으나, 전술한 예시에 한정되지 않고 다양한 기계학습 기반 모델(예: MobileNet-v2, VGGNet, ResNet, MCUNet 등)을 포함할 수 있다. AF 모델은 CDAF, PDAF와 같은 비기계학습 기반 모델을 포함할 수 있다. 일례로, 전자 장치는 복수의 원본 영상들에 대하여 프레임 정렬(frame alignment)을 수행하여, 복수의 원 본 영상들을 보정할 수 있다. 전자 장치는 이미지 정렬을 위한 공지된 다양한 방법들을 이용하여, 복수의 원본 영상들을 영역 정합(regional registration) 시킬 수 있다. 전자 장치는 보정된 복수의 원본 영상들 을 이용하여, 합성 영상을 생성할 수 있다. 프레임 정렬을 수행하여 보정된 복수의 원본 영상들에 따라 합성 영상을 생성하는 경우, 각 프레임의 원본 영상 들 간의 오차가 줄어들 수 있다. 복수의 원본 영상들을 보정하는 경우, AF 모델이 출력하는 초점 거리의 오차가 줄어들 수 있다. AF 모델은 합성 영상을 이용하여 초점 거리를 출력함으로써, 초점 거리의 오차를 감소시킬 수 있다. 예를 들어, AF 모델이 CDAF 또는 PDAF에 따라 초점 거리를 출력하는 경우, 저조도에서 영상의 노이즈 및 블러(blur)에 의하여 AF 모델이 출력하는 초점 거리의 오차가 커진다. 저조도에서 복수의 원본 영상들을 획득하고, AF 모델이 복수의 원본 영상들을 합성한 합성 영상을 이용하여 초점 거리를 출력하는 경우, 초 점 거리의 오차가 줄어들 수 있다. 예를 들어, 복수의 원본 영상들을 합성하면, 아래 수학식 1과 같이 합성 영상의 노이즈는 감소될 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0110115", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예를 들어, AWGN(additive white Gaussian noise)를 가정하면, n 개의 프레임의 평균을 이용하여 생성한 합성 영상의 분산은 위 수학식 1과 같이 1/n 으로 감소될 수 있다. 수학식 1에서, 는 복수의 원본 영상들의 평균 을 이용하여 생성한 합성 영상, 는 i번째 프레임의 원본 영상, 는 복수의 원본 영상들의 표준 편차를 나타 낼 수 있다. 위와 같이, AF 모델이 CDAF 또는 PDAF에 기반하여 입력된 영상의 초점 거리를 계산하는 경우, 합성 영상은 복수의 원본 영상들에 비하여 노이즈가 감소되기 때문에, AF 모델이 출력하는 초점 거리의 오차가 감소할 수 있다.아래 표 1은 제1 방법, 제2 방법, 제3 방법을 통해 계산된 초점 거리와 레이저 포인트를 이용하여 측정한 초점 거리의 정확도를 나타낸 표이다. 표 1 전체 조도 == 0 <= 1 <= 2 <= 4 MAE RMSE 제1 방법 0.3190.645 0.787 0.922 1.652 2.928 제2 방법 0.3760.723 0.851 0.957 1.277 2.385 제3 방법 0.3550.709 0.844 0.950 1.369 2.460 제1 방법, 제2 방법 및 제3 방법은 AF 모델이 CDAF에 따라 초점 거리를 계산한 경우를 나타낸다. 제1 방 법은 AF 모델이 하나의 원본 영상을 이용하여 초점 거리를 계산하는 방법, 제2 방법은 복수의 원본 영상들 을 이용하여 생성한 합성 영상을 이용하여 초점 거리를 계산하는 방법, 제3 방법은 복수의 원본 영상들 중에서 오차가 설정된 임계값 미만인 원본 영상들을 이용하여 합성한 합성 영상을 이용하여 초점 거리를 계산하는 방법 을 나타낸다.위 표 1과 같이, 제2 방법, 제3 방법의 MAE(mean absolute error) 및 RMSE(root mean square error)는 제1 방법의 MAE 및 RMSE보다 감소됨을 확인할 수 있다. 아래 표 2는 저조도에서 제1 방법, 제2 방법 및 제3 방법을 통해 계산한 초점 거리의 정확도를 나타낸 표이다. 표 2 저조도 (5~10lux)== 0 <= 1 <= 2 <= 4 MAE RMSE 제1 방법0.321 0.571 0.714 0.929 1.536 2.130 제2 방법0.357 0.643 0.821 0.964 1.250 1.783 제3 방법0.357 0.679 0.821 0.964 1.214 1.21 표 2와 같이, 저조도에서 제2 방법 또는 제3 방법에 따라 계산된 초점 거리의 정확도는 제1 방법에 비하여 높은 것을 확인할 수 있다.위와 같이, 전자 장치는 복수의 원본 영상들에 비하여 노이즈가 감소된 합성 영상을 이용하여 초점 거리를 계산함으로써, 초점 거리의 오차를 감소시킬 수 있다. AF모델이 기계학습 모델에 기반하여 학습되는 경우에도, 합성 영상의 노이즈가 복수의 원본 영상들에 비하여 감 소하기 때문에, AF 모델은 출력하는 초점 거리의 오차가 감소될 수 있다. 예를 들어, AF 모델을 학습시키는 과정에서 노이즈가 감소된 합성 영상을 이용하여 계산된 정답의 정확도 가 높기 때문에, AF 모델의 정확도를 높일 수 있다. 표 3 전체 조도 == 0<= 1<= 2<= 4MAE RMSE 제1 방법 0.2980.6320.8040.9071.8143.251 제2 방법 0.3230.6650.8150.9261.5622.616 제3 방법 0.3370.660.830.9431.422.285 표 3에서, 제1 방법은 하나의 원본 영상을 AF 모델의 입력으로 하고, 하나의 원본 영상으로 계산된 정답을 이용하여 AF 모델을 학습시키는 방법, 제2 방법은 하나의 원본 영상을 AF 모델의 입력으로 하고, 복 수의 원본 영상을 합성한 합성 영상으로 계산된 정답을 이용하여 AF 모델을 학습시키는 방법, 제3 방법은 복수의 원본 영상들을 합성한 합성 영상을 AF 모델의 입력으로 하고, 복수의 원본 영상을 합성한 합성 영 상으로 계산된 정답을 이용하여 AF 모델을 학습시키는 방법을 나타낸다.표 3과 같이, 제3 방법으로 학습된 AF 모델을 이용하여 출력된 초점 거리의 정확도가 제1 방법, 제2 방법으로 학습된 AF 모델을 이용하 여 출력된 초점 거리의 정확도보다 높은 것을 확인할 수 있다. 도 2a 및 도 2b는 다양한 실시예들에 따른 전자 장치가 AF 모델을 이용하여 초점 거리를 결정하 는 동작을 나타낸 도면이다.도 2a를 참조하면, 전자 장치는 카메라를 이용하여 복수의 원본 영상들을 획득할 수 있다. 전자 장 치는 복수의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 전자 장치는 합성 영 상을 AF 모델에 입력하여, 초점 거리를 출력할 수 있다. 도 2a는 합성 영상을 AF 모델에 입력하여 초점 거리를 결정하는 전자 장치의 동작을 도시 하고 있으나, 이에 한정되지 않는다. 예를 들어, 전자 장치는 복수의 원본 영상들 중 하나 이상의 원본 영상 및 합성 영상을 AF 모델 에 입력하여 초점 거리를 결정할 수 있다. AF 모델이 기계학습 기반 모델인 경우, AF 모델 은 입력된 복수의 원본 영상들 중 하나 이상의 원본 영상 및 합성 영상을 이용하여 초점 거리 를 출력하도록 학습될 수 있다. 도 2b를 참조하면, 전자 장치는 복수의 렌즈 위치에서 복수의 원본 영상들(211, 212, 213, 214)을 획득할 수 있다. 예를 들어, 전자 장치는 렌즈의 위치가 제1 위치일 때, 복수의 원본 영상들을 획득하고, 제1 위치에 서 획득한 복수의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 예를 들어, 전자 장치는 렌즈의 위치가 제2 위치일 때, 복수의 원본 영상들을 획득하고, 제1 위치에 서 획득한 복수의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 예를 들어, 전자 장치는 렌즈의 위치가 제3 위치일 때, 복수의 원본 영상들을 획득하고, 제1 위치에 서 획득한 복수의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 예를 들어, 전자 장치는 렌즈의 위치가 제4 위치일 때, 복수의 원본 영상들을 획득하고, 제1 위치에 서 획득한 복수의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 전자 장치는 합성 영상들(221, 222, 223, 224)을 AF 모델에 입력하여, 초점 거리를 결정할 수 있다. 예를 들어, AF 모델은 CDAF에 따라 각 렌즈의 위치에 대응하는 합성 영상들(221, 222, 223, 224)의 선명도 를 계산하고, 선명도가 최대인 렌즈의 위치를 결정할 수 있다. 예를 들어, AF 모델은 각 렌즈의 위치(예: 제1 위치, 제2 위치, 제3 위치, 제3 위치)에서 획득한 복수의 원본 영상들(211, 212, 213, 214)을 합성한 합성 영상들(221, 222, 223, 224)을 입력하여, 초점 거리를 출력하도록 학습될 수 있다. 도 3은 다양한 실시예들에 따른 초점 거리 결정 방법의 동작 흐름도이다. 도 3을 참조하면, 일 실시 예에 따른 전자 장치는 동작에서 렌즈를 이용하여 복수의 원본 영상들을 획득할 수 있다. 일례로, 전자 장치는 동작에서 복수의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 예를 들어, 전자 장치는 복수의 원본 영상들의 동일한 위치의 픽셀값들의 평균을 이용하여, 합성 영상을 생성할 수 있다. 전자 장치는 복수의 원본 영상들의 전부 또는 일부를 이용하여, 합성 영상을 생성할 수 있다. 예를 들어, 전자 장치는 복수의 원본 영상들 중에서 설정된 개수(예: 마지막 프레임으로부터 설정된 프레임 이내의 원 본 영상들)의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 예를 들어, 전자 장치는 복수의 원본 영상들의 오차 및 설정된 임계값에 기초하여, 합성 영상을 생성할 수 있다. 전자 장치는 기준 프레임(예: 마지막 프레임)의 원본 영상을 기준으로, 나머지 프레임의 원본 영상 들과 오차를 계산할 수 있다. 예를 들어, 전자 장치는 기준 프레임의 원본 영상의 각 위치의 픽셀값과 나 머지 프레임의 원본 영상의 각 위치의 픽셀값의 차이의 평균을 이용하여, 오차를 계산할 수 있다. 전자 장치 는 계산된 오차 중에서 가장 값이 작은 오차를 기준 오차로 설정할 수 있다. 전자 장치는 오차가 기 준 오차에서 설정된 범위 이내인 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 일례로, 전자 장치는 동작에서 복수의 원본 영상들 중 하나 이상의 원본 영상 및 합성 영상을 AF 모 델에 입력하여, 렌즈의 초점 거리를 결정할 수 있다. 일례로, AF 모델은 CDAF 또는 PDAF 방법을 이용하여, 초점 거리를 결정할 수 있다. 예를 들어, AF 모델이 CDAF에 따라 초점 거리를 결정하는 경우, 복수의 원본 영상들 중 하나 이상의 원본 영상 및 합성 영상의 선명도를 계산할 수 있다. AF 모델은 하나 이상의 원본 영상의 선명도 및 합성 영상 의 선명도에 기초하여, 해당 렌즈의 위치에서의 선명도를 계산할 수 있다. 예를 들어, AF 모델은 하나 이 상의 원본 영상의 선명도 및 합성 영상의 선명도의 평균(또는 가중 평균)으로 렌즈 위치에 따른 선명도를 계산 할 수 있다. AF 모델은 각 렌즈의 위치에서 계산된 선명도에 기초하여, 초점 거리를 결정할 수 있다. 예를 들어, AF 모델이 PDAF에 따라 초점 거리를 결정하는 경우, 복수의 원본 영상들 중 하나 이상의 원본 영상 및 합성 영상으로부터 각각 렌즈의 이동 방향 및 렌즈의 이동량을 검출할 수 있다. AF 모델은 하나 이상의 원본 영상으로부터 검출된 렌즈의 이동 방향 및 렌즈의 이동량과 합성 영상으로부터 검출된 렌즈의 이동 방향 및 렌즈의 이동량을 이용하여, 초점 거리를 결정할 수 있다. 예를 들어, 하나 이상의 원본 영상으로부터 검출된 렌즈의 이동 방향과 합성 영상으로부터 검출된 렌즈의 이동 방향이 동일한 경우, AF 모델은 하나 이상의 원본 영상으로부터 검출된 렌즈의 이동량과 합성 영상으로부 터 검출된 렌즈의 이동량의 평균(또는 가중 평균)을 이용하여 초점 거리를 결정할 수 있다. 예를 들어, 하나 이상의 원본 영상으로부터 검출된 렌즈의 이동 방향과 합성 영상으로부터 검출된 렌즈의 이동 방향이 상이한 경우, AF 모델은 합성 영상으로부터 검출된 렌즈의 이동 방향 및 렌즈의 이동량에 따라 초 점 거리를 결정할 수 있다. 예를 들어, 하나 이상의 원본 영상으로부터 검출된 렌즈의 이동 방향과 합성 영상 으로부터 검출된 렌즈의 이동 방향이 상이한 경우, 전자 장치는 카메라를 이용하여, 복수의 원본 영상을 재촬영하고, 재촬영된 복수의 원본 영상을 이용하여 초점 거리를 결정할 수 있다. 도 4는 다양한 실시예들에 따른 AF 모델을 학습시키는 동작 흐름도이다. 도 4에서, AF 모델은 전자 장치에 의하여 학습되는 예를 설명하나, 도 4에 도시된 실시예에 한정되지 않고, AF 모델은 전자 장치와 별개의 학습 장치, 외부 전자 장치, 서버에 의하여 학습될 수 있 다. 전자 장치는 동작에서 렌즈를 이용하여 복수의 원본 영상들을 획득할 수 있다. 전자 장치는 동작에서 복수의 원본 영상들을 이용하여 합성 영상을 생성할 수 있다. 전자 장치는 동작에서 복수의 원본 영상들 및 합성 영상에 대한 초점 거리를 획득할 수 있다. 동작 에서 획득된 초점 거리는 AF 모델을 학습시키기 위한 학습 데이터의 라벨 또는 정답을 나타낼 수 있 다. 예를 들어, 초점 거리는 멀티뷰 스테레오 영상에서 추정한 깊이를 활용하여 계산되거나, 복수의 렌즈 위치 에서 촬영한 복수의 원본 영상들 또는 합성 영상을 이용하여 CDAF에 따라 계산된 초점 거리를 포함할 수 있다. 동작을 통해 학습 데이터의 라벨 또는 정답에 해당하는 초점 거리가 획득됨으로써, AF 모델의 학습 이 용이하게 수행될 수 있다. 전자 장치는 동작에서 복수의 원본 영상들 중 하나 이상의 원본 영상을 AF 모델에 입력하여 렌 즈의 초점 거리를 결정할 수 있다. 전자 장치는 동작에서 획득한 초점 거리 및 AF 모델에 의하여 결정된 초점 거리를 이용하여, AF 모델을 학습시킬 수 있다. 예를 들어, 동작 및 동작에 따라 학습된 AF 모델은 복수의 원본 영상들 중 하나 이상의 원본 영 상을 입력하여, 초점 거리를 출력하도록 학습된 모델을 나타낼 수 있다. 전자 장치는 동작에서 복수의 원본 영상들 중 하나 이상의 원본 영상 및 합성 영상을 AF 모델에 입력하여 렌즈의 초점 거리를 결정할 수 있다. 전자 장치는 동작에서 획득한 초점 거리 및 AF 모델에 의하여 결정된 초점 거리를 이용하여, AF 모델을 학습시킬 수 있다.예를 들어, 동작 및 동작에 따라 학습된 AF 모델은 복수의 원본 영상들 중 하나 이상의 원본 영 상 및 합성 영상을 입력하여, 초점 거리를 출력하도록 학습된 모델을 나타낼 수 있다. 전자 장치는 동작에서 합성 영상을 AF 모델에 입력하여 렌즈의 초점 거리를 결정할 수 있다. 전자 장치는 동작에서 획득한 초점 거리 및 AF 모델에 의하여 결정된 초점 거리를 이용하여, AF 모델을 학습시킬 수 있다. 예를 들어, 동작 및 동작에 따라 학습된 AF 모델은 합성 영상을 입력하여, 초점 거리를 출력하 도록 학습된 모델을 나타낼 수 있다. 도 4에 도시된 동작들(420, 425), 동작들(430, 435), 동작들(440, 445) 중 어느 하나가 수행되어 AF 모델(11 5)이 학습될 수도 있다. 또한, 실시예에 따라서는, 동작들(420, 425), 동작들(430, 435), 동작들(440, 445) 중 둘 이상이 함께 수행되어 AF 모델이 학습될 수 있으며, 이때 함께 수행되는 동작들에 미리 정해진 가중 치가 적용되어 동일 또는 상이한 비율로 AF 모델의 학습에 영향을 미칠 수 있다. 도 5는 다양한 실시예들에 따른 전자 장치가 복수의 원본 영상들로부터 계산한 오차를 나타낸 도면이다. 전자 장치는 복수의 원본 영상들(510-1, 쪋, 510-11) 중에서 선택된 기준 프레임(예: 마지막 프레임)의 원 본 영상(510-11)과 나머지 프레임의 원본 영상(510-1, 쪋, 510-10)과의 오차를 계산할 수 있다. 복수의 원본 영상들이 연속으로 촬영될 때, 조도의 변화, 피사체의 움직임으로 인하여 복수의 원본 영상들은 각각 차이가 있 을 수 있다. 합성 영상을 생성하는 데 활용할 기준 프레임의 영상은 복수의 원본 영상들(510-1, 쪋, 510-11) 중에서 미리 정해진 조건에 부합하는 영상으로 선택될 수 있다. 예를 들어, 미리 정해진 조건에 부합하는 영상 은 가장 높은 선명도(sharpness)를 가지는 영상을 포함할 수 있으나, 이외에도 영상 내 피사체가 흔들림 없이 선명하게 촬영된 영상을 선택하기 위한 다양한 조건의 영상(예: 가장 적은 노이즈를 가지는 영상)이 제한 없이 포함될 수 있다. 경우에 따라서는, 연속으로 영상을 촬영하는 경우 마지막에 촬영된 영상이 가장 흔들림 없이 선명하게 촬영된 영상일 수 있으며, 이 경우 마지막 프레임의 영상이 기준 프레임의 영상으로 선택될 수 있다. 전자 장치는 기준 프레임의 원본 영상(510-11)과 나머지 프레임의 원본 영상(510-1, 쪋, 510-10)의 오차를 계산할 수 있다. 예를 들어, 전자 장치는 첫 프레임의 원본 영상(510-1)은 제외하고, 오차를 계산할 수 있다. 도 5에서, 기준 프레임의 원본 영상(510-11)와 10번째 프레임의 원본 영상(510-10)의 오차는 0.0308임을 확인할 수 있다. 10번째 프레임의 원본 영상(510-10)의 오차는 원본 영상들(510-2, 쪋, 510-10)의 오차들 중 가장 작 은 것을 확인할 수 있다. 전자 장치는 10번째 프레임의 원본 영상(510-10)의 오차를 기준 오차로 결정할 수 있다. 전자 장치는 원본 영상의 오차가 기준 오차로부터 설정된 값(예: 0.001) 또는 범위(예: 5%) 이 내인 원본 영상(510-8, 510-9, 510-10) 및 기준 프레임의 원본 영상(510-11)을 이용하여, 합성 영상을 생성할 수 있다. 이처럼, 가장 선명하게 촬영된 기준 프레임의 원본 영상과 해당 기준 프레임의 원본 영상과 오차가 임계값 이내인 원본 영상들에 기초하여 합성 영상을 생성함으로써, 전자 장치는 피사체가 흔들림 없이 선 명하게 촬영된 합성 영상을 효과적으로 획득할 수 있으며, 해당 합성 영상을 이용하여 AF 모델로부터 높은 정확 도의 렌즈의 초점 거리를 획득할 수 있다. 도 6은 다양한 실시예들에 따른 초점 거리 결정 방법의 동작 흐름도이다. 도 6을 참조하면, 일 실시 예에 따른 전자 장치는 동작에서, 렌즈를 이용하여 복수의 원본 영상들을 획득할 수 있다. 전자 장치는 동작에서 복수의 원본 영상들을 이용하여, 합성 영상을 생성할 수 있다. 동작, 동작에 관하여, 도 3의 동작, 동작에 관한 설명이 실질적으로 동일하게 적용될 수 있다. 전자 장치는 동작에서 합성 영상을 AF 모델에 입력하여, 렌즈의 초점 거리를 결정할 수 있다. 예를 들어, AF 모델은 CDAF 또는 PDAD에 따라 합성 영상으로부터 초점 거리를 결정할 수 있다. 예를 들어, AF 모델은 합성 영상을 입력하여 초점 거리를 출력하도록 학습된 모델을 나타낼 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 소프트웨어 애플리 케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처 리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경우도 있지만,"}
{"patent_id": "10-2023-0110115", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하 나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단 독으로 또는 조합하여 저장할 수 있으며 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구 성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 위에서 설명한 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 또는 복수의 소프트웨어 모듈로서 작동하 도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2023-0110115", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 이를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2a 도면2b 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2023-0110115", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들에 따른 전자 장치의 개략적인 블록도이다. 도 2a 및 도 2b는 다양한 실시예들에 따른 전자 장치가 AF 모델을 이용하여 초점 거리를 결정하는 동작을 나타 낸 도면이다. 도 3은 다양한 실시예들에 따른 초점 거리 결정 방법의 동작 흐름도이다. 도 4는 다양한 실시예들에 따른 AF 모델을 학습시키는 동작 흐름도이다. 도 5는 다양한 실시예들에 따른 전자 장치가 복수의 원본 영상들로부터 계산한 오차를 나타낸 도면이다. 도 6은 다양한 실시예들에 따른 초점 거리 결정 방법의 동작 흐름도이다."}
