{"patent_id": "10-2023-0111428", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0130587", "출원번호": "10-2023-0111428", "발명의 명칭": "현장 근로자를 위한 쉼터 시스템", "출원인": "최석환", "발명자": "최석환"}}
{"patent_id": "10-2023-0111428", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "현장에 설치 가능한 근로자를 위한 쉼터 시스템에 있어서:차량으로 이동 가능한 트레일러(11) 상에 부스를 탑재한 본체(10);상기 본체(10)의 내부에 적어도 일부의 가구를 접철되는 구조로 지지하는 접이가구(20);상기 본체(10)의 내부에 공조기(32)와 표시기(36)를 지지하는 편의부재(30); 및제어기(41)를 기반으로 현장의 작업/휴식 상태를 감시하는 감시부재(40);를 포함하여 이루어지는 것을 특징으로하는 현장 근로자를 위한 쉼터 시스템."}
{"patent_id": "10-2023-0111428", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 본체(10)는 고정부스(12)에 가동부스(13)를 인출 가능하게 지지하고, 신축구동기(15)를 통하여 내부 공간의 신축을 유발하는 것을 특징으로 하는 현장 근로자를 위한 쉼터 시스템."}
{"patent_id": "10-2023-0111428", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 접이가구(20)는 일측의 힌지체(23)로 가구의 판부(21)의 접철을 유발하고, 타측의 힌지체(23)로 가구의 다리부(22)의 접철을 유발하는 것을 특징으로 하는 현장 근로자를 위한 쉼터 시스템."}
{"patent_id": "10-2023-0111428", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 편의부재(30)는 근로자의 건강 상태를 검진하는 검진기(34)를 더 구비하는 것을 특징으로 하는 현장 근로자를 위한 쉼터 시스템."}
{"patent_id": "10-2023-0111428", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 감시부재(40)는 현장의 온도와 우천을 검출하는 기상검출기(43), 현장의 진동과 소음을 검출하는 위험검출기(45), 드론을 가동하여 현장의 작업 관련 정보를 획득하는 이동검출기(47)를 구비하는 것을 특징으로 하는 현장 근로자를 위한 쉼터 시스템."}
{"patent_id": "10-2023-0111428", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 현장에 설치 가능한 근로자를 위한 쉼터 시스템에 있어서: 차량으로 이동 가능한 트레일러 상에 부스를 탑재한 본체; 상기 본체의 내부에 적어도 일부의 가구를 접철되는 구조로 지지하는 접이가구 ; 상기 본체의 내부에 공조기와 표시기를 지지하는 편의부재; 및 제어기를 기반으로 현 장의 작업/휴식 상태를 감시하는 감시부재;를 포함하여 이루어지는 것을 특징으로 한다. 이에 따라, 각종 산업현장에서 이동식 구조를 기반으로 반복적인 사용이 가능하면서 근로자의 휴식과 안전 모니 터링이 가능한 편의 공간으로 활용되므로 실질적인 활용성과 생산성 증대를 유발하는 효과가 있다."}
{"patent_id": "10-2023-0111428", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 현장 근로자 쉼터에 관한 것으로서, 보다 구체적으로는 각종 산업현장에서 이동식 구조를 기반으로 근로자의 휴식을 위한 편의 공간으로 활용되는 현장 근로자를 위한 쉼터 시스템에 관한 것이다."}
{"patent_id": "10-2023-0111428", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "각종 공사현장에서 작업자의 고령화, 극심한 기후변화, 장시간 작업 등의 요인에 의해 안전사고가 많이 발생한 다. 이에 향후 관련법에 따라서 일정 규모 이상의 사업장에서 근로자를 위한 휴게시설의 설치가 의무화된다. 일 부 사업장에서 근로자 휴게시설을 갖추고 있더라도 시설이 열악하거나 창고와 같은 다른 용도로 사용하는 경우 도 많다. 더구나 옥외 사업장에 한시적으로 설치되는 휴게시설은 사업주의 경영부담으로 작용할 수도 있다.근로자 휴게시설과 관련하여 참조할 수 있는 선행기술문헌으로서 한국 등록특허공보 제0959310호(선행문헌 1), 한국 등록특허공보 제2502329호(선행문헌 2) 등이 알려져 있다. 선행문헌 1은 일정간격 이격되어 형성되는 의자, 의자의 사이에 형성되는 지지대, 지지대에 삽입되어 설치되는 테이블을 포함하는 아고라로서, 중량체에 여러 형태의 지지대를 수용하여 추후 교체시 중량체를 그대로 사용하 여 다양한 형태로 활용한다. 이에, 시공시간이 단축되고 현장시공시 별도의 인력이 필요치 않아 인건비를 절감 하는 효과를 기대한다. 선행문헌 2는 건축물의 유지 보수 현장에 제1시설과 제2시설을 포함하여 구성되어, 저수조 내지 저장 탱크가 없 이도 오수와 하수를 배출하여 작업자들의 샤워 및 생리 현상을 해결하고, 작업 중 휴식시간에는 거주민들의 시 선을 의식할 필요 없는 독립된 공간에서 충분한 휴식을 취하는 등 작업자의 편익을 제공하면서 작업환경을 개선 하는 효과를 기대한다. 그러나, 선행문헌 1은 휴식 공간의 확장이 어렵고 선행문헌 2는 이동성을 반영하지 않으며, 어느 선행문헌이나 근로자 안전성에 대한 고려가 미흡하다는 한계성을 드러낸다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 제0959310호 \"이동식 파고라\" (공개일자 : 2010.05.20.) (특허문헌 0002) 한국 등록특허공보 제2502329호 \"건축물의 유지 보수 현장 작업자용 휴식 및 개인위생 관리 시 설\" (공개일자 : 2023.02.23.)"}
{"patent_id": "10-2023-0111428", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 종래의 문제점들을 개선하기 위한 본 발명의 목적은, 각종 산업현장에서 이동식 구조를 기반으로 반복적인 사용이 가능하면서 근로자의 휴식과 안전 모니터링이 가능한 편의 공간으로 활용되는 현장 근로자를 위한 쉼터 시스템를 제공하는 데 있다."}
{"patent_id": "10-2023-0111428", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명은 현장에 설치 가능한 근로자를 위한 쉼터 시스템에 있어서: 차량으로 이동 가능한 트레일러 상에 부스를 탑재한 본체; 상기 본체의 내부에 적어도 일부의 가구를 접철되는 구조로 지 지하는 접이가구; 상기 본체의 내부에 공조기와 표시기를 지지하는 편의부재; 및 제어기를 기반으로 현장의 작 업/휴식 상태를 감시하는 감시부재;를 포함하여 이루어지는 것을 특징으로 한다. 본 발명의 세부 구성에 의하면, 상기 본체는 고정부스에 가동부스를 인출 가능하게 지지하고, 신축구동기를 통 하여 내부 공간의 신축을 유발하는 것을 특징으로 한다. 본 발명의 세부 구성에 의하면, 상기 접이가구는 일측의 힌지체로 가구의 판부의 접철을 유발하고, 타측의 힌지 체로 가구의 다리부의 접철을 유발하는 것을 특징으로 한다. 본 발명의 세부 구성에 의하면, 상기 편의부재는 근로자의 건강 상태를 검진하는 검진기를 더 구비하는 것을 특 징으로 한다. 본 발명의 세부 구성에 의하면, 상기 감시부재는 현장의 온도와 우천을 검출하는 기상검출기, 현장의 진동과 소 음을 검출하는 위험검출기, 드론을 가동하여 현장의 작업 관련 정보를 획득하는 이동검출기를 구비하는 것을 특 징으로 한다."}
{"patent_id": "10-2023-0111428", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명에 의하면, 각종 산업현장에서 이동식 구조를 기반으로 반복적인 사용이 가능하면서 근로자 의 휴식과 안전 모니터링이 가능한 편의 공간으로 활용되므로 실질적인 활용성과 생산성 증대를 유발하는 효과가 있다."}
{"patent_id": "10-2023-0111428", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면에 의거하여 본 발명의 실시예를 상세하게 설명하면 다음과 같다. 본 발명은 현장에 설치 가능한 근로자를 위한 쉼터 시스템에 관하여 제안한다. 각종 옥외 산업현장에서 이동식 구조를 기반으로 하는 쉼터 시스템을 대상으로 하지만 반드시 이에 국한되는 것은 아니다. 본 발명에 따른 본체는 차량으로 이동 가능한 트레일러 상에 부스를 탑재한 구조를 이루고 있다. 도 1을 참조하면, 본체를 구성하는 트레일러에 부스가 탑재된 상태를 나타낸다. 트레일러는 차량에 기계적/전기적으로 연결 가능한 구조이면서 현장에서 분리된 상태로 외부의 상용전원(도시 생략)에 연결 가능하 다. 부스는 근로자의 휴식 공간을 제공하도록 방수/단열 구조이면서, 도시에는 생략하나, 출입구, 창문, 계단 등을 갖춘다. 본 발명의 세부 구성에 의하면, 상기 본체는 고정부스에 가동부스를 인출 가능하게 지지하고, 신축 구동기를 통하여 내부 공간의 신축을 유발하는 것을 특징으로 한다. 도 1에서, 본체를 구성하는 고정부스, 가동부스, 신축구동기 등이 나타난다. 고정부스는 트레일러의 전체 길이에 걸쳐 상면에 긴밀하게 고정된다. 가동부스는 고정부스의 측면에 슬라이딩 모션으로 인출 가능하게 지지된다. 가동부스는 고정부스의 일측면 또는 양측면에서 가동부스보다 짧은 길이에 걸치도록 형성된다. 신축구동기는 일측 또는 양측의 가동부스에 유압실린더, 래크-피니언, 볼스크류 중의 어느 하나의 방식으로 연결 가능하다. 한편, 본체의 일측으로 적어도 2개소에 다리조절기를 구비하는 것이 좋다. 다리조절기는 아우트리 거(outrigger)처럼 인출 가능한 다리에 구동기를 연결하여 구성된다. 구동기는 유압실린더, 래크-피니언, 볼스 크류 중의 어느 하나의 방식을 적용할 수 있다. 또한, 본 발명에 따르면 접이가구가 상기 본체의 내부에 적어도 일부의 가구를 접철되는 구조로 지지하 는 구조를 이루고 있다. 도 1 및 도 2를 참조하면, 접이가구가 본체의 내부에 탑재되는 상태를 나타낸다. 접이가구는 근로 자의 휴식에 필요한 의자, 탁자, 간이침대 등을 포함한다. 특히 고정부스에서 가동부스를 출입시키는 경우에 접철 구조의 접이가구는 주변 물품과의 간섭을 피할 수 있다. 접이가구는 고정부스보다 가 동부스에 적용하는 것이 선호된다. 물론 본체에 탑재되는 의자, 탁자, 간이침대에 모두 접철 구조를 적 용할 필요는 없다. 본 발명의 세부 구성에 의하면, 상기 접이가구는 일측의 힌지체로 가구의 판부의 접철을 유발하고, 타측의 힌지체로 가구의 다리부의 접철을 유발하는 것을 특징으로 한다. 도 2 및 도 3을 참조하면, 접이가구를 구성하는 판부, 다리부, 힌지체, 고정체 등이 나타 난다. 판부는 의자의 좌판, 탁자의 상판처럼 근로자의 신체와 접촉하는 부분이다. 다리부는 판부의 저면에 연결되어 수평을 유지하는 부분이다. 일측의 힌지체는 부스의 벽면과 판부 사이에 연결되고, 타 측의 힌지체는 판부와 다리부 사이에 연결된다. 고정체는 부스의 벽면과 판부의 단부에 암 수로 맞물림 가능하게 설치된다. 차량으로 이동하는 동안에는 접이가구를 최소로 접어서 고정체를 이용 하여 고정한다. 근로자 쉼터를 제공할 때에는 부호 20′처럼 최대로 펼쳐서 사용한다. 한편, 부스의 벽면에 안내레일과 슬라이더(도시 생략)를 설치하고 슬라이더 상에 힌지체를 결합할 수 있다. 이 경우 접이가구의 접철 기능은 유지하면서 인접한 접이가구의 간격을 조절하기 용이하다.또한, 본 발명에 따르면 편의부재가 상기 본체의 내부에 공조기와 표시기를 지지하는 구조를 이루고 있다. 도 1 및 도 2에서, 편의부재가 본체에 공조기와 표시기를 탑재한 상태를 나타낸다. 공조기(3 2)는 협의적으로 에어컨, 히터, 공기청정기를 의미하지만, 광의적으로 냉장고, 냉온수기 등을 포함한다. 표시기 는 LCD, OLED 등의 디스플레이로서 휴식을 위한 영상 외에 제반 가동 상태를 표시한다. 이외에 편의부재 에 PC, 샤워실 등을 포함할 수 있다. 본 발명의 세부 구성에 의하면, 상기 편의부재는 근로자의 건강 상태를 검진하는 검진기를 더 구비하는 것을 특징으로 한다. 도 2에서, 편의부재를 구성하는 검진기, 수거기 등이 본체의 내부에 나타난다. 검진기는 근로자의 체온, 혈압, 맥박, 뇌파, 산소포화도 등의 생체신호를 검출한다. 이외에 검진기에 체중계, 체성분 측정기 등을 보조적으로 포함할 수 있다. 수거기는 근로자의 휴식과 검진 과정에서 발생하는 오염물/악취물 을 보관하도록 설치된다. 또한, 본 발명에 따르면 감시부재가 제어기를 기반으로 현장의 작업/휴식 상태를 감시하는 구조를 이루 고 있다. 도 1 및 도 4를 참조하면, 감시부재가 제어기를 기반으로 구성되는 상태를 나타낸다. 제어기는 마 이크로프로세서, 메모리, 입출력인터페이스를 갖춘 마이컴 회로로 구성된다. 제어기는 외부의 서버(도시 생 략)와 유무선으로 연결되어 자기학습형 인공지능(AI) 제어를 수행할 수 있다. 서버는 해당 현장의 기상, 지형, 건축물 정보를 제공한다. 제어기는 근로자 등의 스마트폰 앱과 연결되어 정보의 입출력을 처리할 수 있다. 본 발명의 세부 구성에 의하면, 상기 감시부재는 현장의 온도와 우천을 검출하는 기상검출기, 현장의 진동과 소음을 검출하는 위험검출기, 드론을 가동하여 현장의 작업 관련 정보를 획득하는 이동검출기를 구비하는 것을 특징으로 한다. 도 1 및 도 4에서, 감시부재를 구성하는 기상검출기, 위험검출기, 이동검출기가 나타난다. 기 상검출기는 온도센서, 강우센서 등을 사용하여 현장의 기상을 측정하는 외에 서버로부터 광역의 기상 정보 를 수신한다. 위험검출기는 진동센서, 소음센서, 가스센서, 카메라 등을 사용하여 현장의 위험요소를 검출 한다. 이동검출기는 드론을 사용하여 현장을 이동하면서 현장과 근로자의 동태를 모니터링한다. 제어기를 중심으로 하는 작동의 일예로서, 본체가 현장에 도착하면 신축구동기를 가동하여 가동부 스를 인출하고, 다리조절기를 통하여 본체의 수평을 유지한 상태에서 접이가구와 편의부재(3 0)를 가동하며, 이동검출기 등 가동하여 현장의 위험 요소를 검출하면서 근로자의 긴급 휴식을 판단한다. 근로자의 체온이 높거나, 안전 장구의 착용이 미흡하거나, 지반침하나 폭우/폭풍이 우려되는 경우 경보한다. 이 외에 제어기는 근로자가 주기적으로 휴식을 갖도록 통지할 수 있다. 제어기는 서버 등과 연계하여 날씨, 지형, 작업 진도 등을 고려한 최적의 휴식 정보를 제공하는 동시에 모 든 현장에서 취합되는 제반 정보에 대한 인공지능 학습(딥러닝)을 거쳐 갱신된 정보를 생성한다. 본 발명은 기재된 실시예에 한정되는 것이 아니고, 본 발명의 사상 및 범위를 벗어나지 않고 다양하게 수정 및 변형할 수 있음이 이 기술의 분야에서 통상의 지식을 가진 자에게 자명하다. 따라서 그러한 변형예 또는 수정예 들은 본 발명의 청구범위에 속한다 해야 할 것이다."}
{"patent_id": "10-2023-0111428", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 시스템의 외형을 나타내는 모식도 도 2는 본 발명에 따른 시스템의 내부 구조를 나타내는 모식도 도 3은 본 발명에 따른 시스템의 접이 가구를 나타내는 모식도 도 4는 본 발명에 따른 시스템의 회로 연결을 나타내는 블록도"}
