{"patent_id": "10-2023-0052008", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0150220", "출원번호": "10-2023-0052008", "발명의 명칭": "스캔 파라미터를 이용하는 자기 공명 영상 처리 방법 및 장치", "출원인": "주식회사 에어스 메디컬", "발명자": "김지욱"}}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자기 공명 영상 처리에 의해 수행되는 자기 공명 영상 처리 방법에 있어서, 저품질의 학습 이미지, 상기 학습 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹, 고품질의 라벨 이미지 및 상기 라벨 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를포함하는 제2 파라미터 그룹을 획득하는 단계; 및상기 학습 이미지, 상기 제1 파라미터 그룹, 상기 라벨 이미지 및 상기 제2 파라미터 그룹을 이용하여 인공 신경망 모델을 학습시키는 단계;를 포함하고,상기 인공 신경망 모델은 저품질의 이미지를 기초로 고품질의 이미지를 출력하도록 학습되고,상기 제1 파라미터 그룹 및 상기 제2 파라미터 그룹은,상기 학습 이미지 및 상기 라벨 이미지와 데이터 차원이 서로 다른 것을 특징으로 하는 자기 공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 스캔 파라미터는,자기 공명 신호의 제1 k-스페이스 데이터의 라인들이 반복 획득될 때의 반복된 횟수인 여기횟수(number ofexcitation), 상기 제1 k-스페이스 데이터의 위상 인코딩 방향으로 샘플링된 라인의 개수를 미리 설정된 기준값으로 나눈 값인 페이즈 레졸루션(phase resolution) 및 상기 제1 k-스페이스 데이터의 풀 샘플링된 신호 라인의개수를 서브 샘플링된 신호 라인의 개수로 나눈 값을 의미하는 가속화 지수(acceleration factor) 중 적어도 하나를 포함하는 것을 특징으로 하는 자기 공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 학습 이미지는 자기 공명 신호가 서브 샘플링 되어 획득되고, 상기 라벨 이미지는 상기 자기 공명 신호가 풀 샘플링 되어 획득되는 것을 특징으로 하는 자기 공명 영상 처리방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 학습 이미지의 여기횟수는 상기 라벨 이미지의 여기횟수보다 작은 것을 특징으로 하는 자기 공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 학습 이미지의 페이즈 레졸루션은 상기 라벨 이미지의 페이즈 레졸루션보다 작은 것을 특징으로 하는 자기공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0150220-3-제1항에 있어서,상기 인공 신경망 모델을 학습시키는 단계는,상기 제1 파라미터 그룹의 크기 및 상기 제2 파라미터 그룹의 크기가 상기 인공 신경망 모델의 특정 레이어의채널 수에 대응되도록 전처리하는 단계;를 포함하는 것을 특징으로 하는 자기 공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 전처리하는 단계는,상기 제1 파라미터 그룹 및 상기 제2 파라미터 그룹을 전처리 인공 신경망 모델에 입력하여 각각 제1 어텐션 데이터 및 제2 어텐션 데이터를 생성하는 단계를 포함하고,상기 인공 신경망 모델을 학습시키는 단계는,상기 제1 어텐션 데이터 및 상기 제2 어텐션 데이터를 인공 신경망 모델에 입력하는 단계;를 포함하는 것을 특징으로 하는 자기 공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 전처리 인공 신경망 모델은 완전 연결 계층(fully connected layer)을 포함하는 것을 특징으로 하는 자기공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,입력 이미지 및 상기 입력 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제3 파라미터그룹을 상기 인공 신경망 모델에 입력하여 복원 이미지를 생성하는 단계; 를 더 포함하고,상기 제3 파라미터 그룹은,상기 입력 이미지와 데이터 차원이 서로 다른 것을 특징으로 하는 자기 공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "자기 공명 영상 처리 장치에 의해 수행되는 자기 공명 영상 처리 방법에 있어서,저품질의 학습 이미지, 상기 학습 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹, 고품질의 라벨 이미지 및 상기 라벨 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를포함하는 제2 파라미터 그룹을 이용하여 학습된 인공 신경망 모델에 입력 이미지 및 상기 입력 이미지를 획득할때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제3 파라미터 그룹을 입력하는 단계; 및상기 인공 신경망 모델로부터 복원 이미지를 출력하는 단계를 포함하고,상기 인공 신경망 모델은 저품질의 이미지를 기초로 고품질의 이미지를 출력하도록 학습되고,상기 제1 파라미터 그룹, 상기 제2 파라미터 그룹 및 상기 제3 파라미터 그룹은,상기 학습 이미지, 상기 라벨 이미지 및 상기 입력 이미지와 데이터 차원이 서로 다른 것을 특징으로 하는 자기공명 영상 처리 방법."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2023-0150220-4-자기 공명 영상 처리 방법을 실행하기 위한 자기 공명 영상 처리 장치에 있어서,자기 공명 영상 처리 프로그램이 저장된 메모리; 및상기 프로그램을 실행하는 프로세서를 포함하고,상기 프로세서는 상기 프로그램의 실행에 따라, 저품질의 학습 이미지, 상기 학습 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹, 고품질의 라벨 이미지 및 상기 라벨 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를포함하는 제2 파라미터 그룹을 이용하여 인공 신경망 모델을 학습시키고,상기 인공 신경망 모델은 저품질의 이미지를 기초로 고품질의 이미지를 출력하도록 학습되고,상기 제1 파라미터 그룹 및 상기 제2 파라미터 그룹은,상기 학습 이미지 및 상기 라벨 이미지와 데이터 차원이 서로 다른 것을 특징으로 하는 자기 공명 영상 처리 장치."}
{"patent_id": "10-2023-0052008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 내지 제9항 중 어느 한 항에 따른 방법을 실행하는 프로그램이 저장된 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 자기 공명 영상 처리에 의해 수행되는 자기 공명 영상 처리 방법은 저품질의 학습 이미지, 상기 학습 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹, 고 품질의 라벨 이미지 및 상기 라벨 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제2 파라 미터 그룹을 획득하는 단계 및 상기 학습 이미지, 상기 제1 파라미터 그룹, 상기 라벨 이미지 및 상기 제2 파라 미터 그룹을 이용하여 인공 신경망 모델을 학습시키는 단계를 포함하고, 상기 인공 신경망 모델은 저품질의 이미 지를 기초로 고품질의 이미지를 출력하도록 학습되고, 상기 제1 파라미터 그룹 및 상기 제2 파라미터 그룹은, 상 기 학습 이미지 및 상기 라벨 이미지와 데이터 차원이 서로 다른 것을 특징으로 한다."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자기 공명 영상 처리 방법 및 장치에 관한 것으로서, 구체적으로 스캔 파라미터를 이용하여 인공 신 경망을 학습시킴으로써 자기 공명 영상을 획득하는 자기 공명 영상 처리 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 의료용 영상 장치는 환자의 신체 정보를 획득하여 영상을 제공하는 장치이다. 의료용 영상 장치는 X 선 촬영 장치, 초음파 진단 장치, 컴퓨터 단층 촬영 장치, 자기 공명 영상(Magnetic Resonance Imaging, MRI) 촬영 장치 등이 있다. 여기서, 자기 공명 영상은 인체에 해가 없는 자장과 비전리 방사선을 이용하여 체내의 수소 원자핵에 핵자기 공 명 현상을 일으켜 원자핵의 밀도 및 물리/화학적 특성을 영상화한 것이다. 자기 공명 영상 촬영 장치는 영상 촬 영 조건이 상대적으로 자유롭고, 연부 조직에서의 다양한 진단 정보를 포함하고 우수한 대조도를 가지는 영상을 제공해주기 때문에 의료용 영상을 이용한 진단 분야에서 중요한 위치를 차지하고 있다. 한편 촬영자는 원하는 데이터를 획득하기 위해, 촬영 조건을 나타내는 파라미터들을 특정하게 세팅한 후 자기 공명 영상 촬영을 수행할 수 있다. 파라미터가 달라지면 획득되는 자기 공명 신호가 달라지는 바, 영상 복원을 위해 수행되어야 하는 작업들이 달라질 수 있다. 즉 자기 공명 신호 뿐만 아니라 촬영에 사용된 파라미터를 고 려하여 영상 복원 작업이 수행될 필요가 있다. 그러나 자기 공명 신호로 생성된 자기 공명 영상과 촬영에 사용 된 파라미터의 데이터 차원이 서로 달라 이들을 하나의 인공 신경망 모델로 학습시키기 위한 방법이 요구된다."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 자기 공명 영상과 상기 자기 공명 영상과 데 이터 차원이 서로 다르며, 상기 자기 공명 영상의 촬영시 사용되는 스캔 파라미터들을 이용하여 자기 공명 영상 을 복원하는, 스캔 파라미터를 이용하는 자기 공명 영상 처리 방법 및 장치에 관한 것이다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예에 따르면 자기 공명 영상 처리에 의해 수행되는 자기 공명 영상 처리 방법은 저품질의 학습 이미지, 상기 학습 이미지가 획득될 때 적용된 적어 도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹, 고품질의 라벨 이미지 및 상기 라벨 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제2 파라미터 그룹을 획득하는 단계 및 상기 학습 이미지, 상기 제1 파라미터 그룹, 상기 라벨 이미지 및 상기 제2 파라미터 그룹을 이용하여 인공 신경망 모델을 학습시 키는 단계를 포함하고, 상기 인공 신경망 모델은 저품질의 이미지를 기초로 고품질의 이미지를 출력하도록 학습 되고, 상기 제1 파라미터 그룹 및 상기 제2 파라미터 그룹은, 상기 학습 이미지 및 상기 라벨 이미지와 데이터 차원이 서로 다른 것을 특징으로 한다. 한 실시예로서, 상기 스캔 파라미터는, 상기 자기 공명 신호의 제1 k-스페이스 데이터의 라인들을 반복 획득할 때의 반복된 횟수인 여기횟수(number of excitation), 상기 제1 k-스페이스 데이터의 위상 인코딩 방향으로 샘 플링된 라인의 개수를 미리 설정된 기준값으로 나눈 값인 페이즈 레졸루션(phase resolution) 및 상기 제1 k-스 페이스 데이터의 풀 샘플링된 신호 라인의 개수를 서브 샘플링된 신호 라인의 개수로 나눈 값을 의미하는 가속 화 지수(acceleration factor) 중 적어도 하나를 포함할 수 있다. 한 실시예로서, 상기 학습 이미지는 자기 공명 신호가 서브 샘플링 되어 획득되고, 상기 라벨 이미지는 상기 자 기 공명 신호가 풀 샘플링 되어 획득될 수 있다. 한 실시예로서, 상기 학습 이미지의 여기횟수는 상기 라벨 이미지의 여기횟수보다 작을 수 있다. 한 실시예로서, 상기 학습 이미지의 페이즈 레졸루션은 상기 라벨 이미지의 페이즈 레졸루션보다 작을 수 있다. 한 실시예로서, 상기 인공 신경망 모델을 학습시키는 단계는, 상기 제1 파라미터 그룹의 크기 및 상기 제2 파라 미터 그룹의 크기가 상기 인공 신경망 모델의 특정 레이어의 채널 수에 대응되도록 전처리하는 단계를 포함하는 것을 포함할 수 있다. 한 실시예로서, 상기 전처리하는 단계는, 상기 제1 파라미터 그룹 및 상기 제2 파라미터 그룹을 전처리 인공 신 경망 모델에 입력하여 각각 제1 어텐션 데이터 및 제2 어텐션 데이터를 생성하는 단계를 포함하고, 상기 인공 신경망 모델을 학습시키는 단계는, 상기 제1 어텐션 데이터 및 상기 제2 어텐션 데이터를 인공 신경망 모델에 입력하는 단계를 포함할 수 있다. 한 실시예로서, 상기 전처리 인공 신경망 모델은 완전 연결 계층(fully connected layer)을 포함할 수 있다. 한 실시예로서, 입력 이미지 및 상기 입력 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제3 파라미터 그룹을 상기 인공 신경망 모델에 입력하여 복원 이미지를 생성하는 단계를 더 포함하고, 상기 제3 파라미터 그룹은, 상기 입력 이미지와 데이터 차원이 서로 다를 수 있다. 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예에 따르면 자기 공명 영상 처리 장치에 의해 수행되는 자기 공명 영상 처리 방법은 저품질의 학습 이미지, 상기 학습 이미지가 획득될 때 적용 된 적어도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹, 고품질의 라벨 이미지 및 상기 라벨 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제2 파라미터 그룹을 이용하여 학습된 인공 신경망 모델에 입력 이미지 및 상기 입력 이미지를 획득할 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제3 파 라미터 그룹을 입력하는 단계 및 상기 인공 신경망 모델로부터 복원 이미지를 출력하는 단계를 포함하고, 상기 인공 신경망 모델은 저품질의 이미지를 기초로 고품질의 이미지를 출력하도록 학습되고, 상기 제1 파라미터 그 룹, 상기 제2 파라미터 그룹 및 상기 제3 파라미터 그룹은, 상기 학습 이미지, 상기 라벨 이미지 및 상기 입력 이미지와 데이터 차원이 서로 다른 것을 특징으로 한다. 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예에 따르면 자기 공명 영상 처리 방법을 실행하기 위한 자기 공명 영상 처리 장치는 자기 공명 영상 처리 프로그램이 저장된 메모리 및 상기 프 로그램을 실행하는 프로세서를 포함하고, 상기 프로세서는 상기 프로그램의 실행에 따라, 저품질의 학습 이미지, 상기 학습 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹, 고 품질의 라벨 이미지 및 상기 라벨 이미지가 획득될 때 적용된 적어도 하나의 스캔 파라미터를 포함하는 제2 파 라미터 그룹을 이용하여 인공 신경망 모델을 학습시키고, 상기 인공 신경망 모델은 저품질의 이미지를 기초로 고품질의 이미지를 출력하도록 학습되고, 상기 제1 파라미터 그룹 및 상기 제2 파라미터 그룹은, 상기 학습 이 미지 및 상기 라벨 이미지와 데이터 차원이 서로 다른 것을 특징으로 한다."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단에 의하면, 본 발명은 2차원의 자기 공명 영상과, 이를 촬영할 때 사용된 1차 원의 스캔 파라미터를 함께 이용하여 인공 신경망의 학습을 수행하므로, 상기 인공 신경망을 이용하여 획득된 자기 공명 영상의 정확도가 향상될 수 있다. 또한 학습에 사용되는 스캔 파라미터의 값을 조정함으로써, 사용자가 원하는 데이터가 강조되도록 자기 공명 영 상을 복원할 수 있는바, 사용자 편의성이 증대될 수 있다."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서가 실시예들의 모든 요소들을 설명하는 것은 아니며, 본 발명이 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한다. 명세서에서 사용되는 ‘부’(part, portion)라는 용어는 소프트 웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 ‘부’가 하나의 요소(unit, element)로 구현 되거나, 하나의 ‘부’가 복수의 요소들을 포함하는 것도 가능하다. 본 명세서에서 '영상'은 이산적인 이미지 요소들(예를 들어, 2차원 이미지에 있어서의 픽셀들 및 3차원 이미지 에 있어서의 복셀들)로 구성된 다차원(multi-dimensional) 데이터를 의미할 수 있다. 예를 들어, 영상은 자기 공명 영상 촬영 장치, 컴퓨터 단층 촬영(CT) 장치, 초음파 촬영 장치, 또는 엑스레이 촬영 장치 등의 의료 영상 장치에 의해 획득된 의료 영상을 포함할 수 있다. 본 명세서에서 '대상체(object)'는 촬영의 대상이 되는 것으로서, 사람, 동물, 또는 그 일부를 포함할 수 있다. 예를 들어, 대상체는 신체의 일부(장기 또는 기관 등; organ) 또는 팬텀(phantom) 등을 포함할 수 있다. 팬텀은 생물의 밀도와 실효 원자 번호에 아주 근사한 부피를 갖는 물질을 의미하는 것으로, 신체와 유사한 성질을 갖는 구형(sphere)의 팬텀을 포함할 수 있다. 자기 공명 영상(Magnetic Resonance Image, MRI) 시스템은 특정 세기의 자기장에서 발생하는 RF(Radio Frequency) 신호에 대한 자기 공명(Magnetic Resonance, MR) 신호의 세기를 명암 대비로 표현하여 대상체의 단 층 부위에 대한 이미지를 획득하는 시스템이다.MRI 시스템은 주자석이 정자장(static magnetic field)을 형성하도록 하고, 정자장 속에 위치한 대상체의 특정 원자핵의 자기 쌍극자 모멘트 방향을 정자장 방향으로 정렬시킨다. 경사자장 코일은 정자장에 경사 신호를 인가 하여, 경사자장을 형성시켜, 대상체의 부위 별로 공명 주파수를 다르게 유도할 수 있다. RF 코일은 영상 획득을 원하는 부위의 공명 주파수에 맞추어 자기 공명 신호를 조사할 수 있다. 또한, RF 코일은 경사자장이 형성됨에 따라, 대상체의 여러 부위로부터 방사되는 서로 다른 공명 주파수의 자기 공명 신호들을 수신할 수 있다. MRI 시스템은 이러한 단계를 통해 수신된 자기 공명 신호들에 영상 복원 기법을 적용하여 영상을 획득한다. 또한, MRI 시스템은 다채널 RF 코일에 의해 수신되는 복수의 자기 공명 신호에 대하여 직렬적 또는 병렬적 신호 처리 를 수행하여 복수의 자기 공명 신호를 영상 데이터로 재구성할 수도 있다. 이하에서는 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치에 대하여 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치의 구성을 보여주는 구성도이다. 도 1을 참조하면, 자기 공명 영상 처리 장치는, 자체적으로 자기 공명 신호를 감지하여 자기 공명 영상을 획득할 수 있는 MRI 시스템뿐만 아니라, 외부에서 획득된 영상을 처리하는 영상 처리 장치, 자기 공명 영상에 대한 프로세싱 기능을 구비한 스마트폰, 태블릿 PC, PC, 스마트 TV, 마이크로 서버, 클라우드 서버, 기타 가전 기기 및 기타 모바일 또는 비 모바일 컴퓨팅 장치일 수 있으나 이에 제한되지 않는다. 또한, 자기 공명 영상 처 리 장치는 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 디 바이스일 수 있다. 또한, 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치는 의료기관에서 이용하는 의료 영상 저 장 전송 시스템(PACS: Picture Archiving and Communication System) 또는 자기 공명 영상 처리 장치와 통신하여 의료 영상 데이터를 송수신하고, 인공신공망 모델을 활용하여 자기 공명 영상 데이터를 복원하는 자기 공명 영상 처리 장치에 관한 것일 수 있다. 그리고, 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치는 클라우드 컴퓨팅 시스템(Cloud Computing System)의 형태로 구현될 수 있다. 클라우드 컴퓨팅은 인터넷상의 서버를 통하여 데이터 저장, 네트 워크, 콘텐츠 사용 등IT 관련 서비스를 종합적으로 사용할 수 있는 컴퓨팅 환경이다. 이와 다르게, 자기 공명 영상 처리 장치는 서버 컴퓨팅, 엣지 컴퓨팅, 서버리스 컴퓨팅 등의 자기 공명 영상 처리 방법을 수행할 수 있는 다양한 형태의 컴퓨팅 시스템으로 구현될 수도 있다. 구체적으로, 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치는 각각 통신 모듈, 메모리, 프로세서 및 데이터베이스를 포함할 수 있다. 통신 모듈은 통신망과 연동하여 자기 공명 영상 처리 장치에 통신 인터페이스를 제공하는데, 자기 공 명 영상 처리 장치는 통신 모듈을 이용하여 후술할 클라이언트 단말, PACS 단말 및 PACS 서버와 데이 터를 송수신할 수 있다. 여기서, 통신 모듈은 다른 네트워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치일 수 있다. 예를 들어, 통신 모듈은 랜(LAN), WCDMA(Wideband Code Division Multiple Access), LTE(Long Term Evolution), WiBro(Wireless Broadband Internet), 5세대 이동통신(5G), 초광역대 무선 통신(Ultra Wide- Band), 지그비(ZigBee), RF(Radio Frequency)통신, 무선랜(Wireless LAN), 와이파이(Wireless Fidelity), NFC(Near Field Communication), 블루투스, 적외선 통신 등을 통해 통신할 수 있다. 다만, 이는 예시적인 것으"}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "로서, 본 발명이 적용되는 실시예에 따라 당해 기술분야에서 적용 가능한 다양한 유무선 통신 기술이 이용될 수 있다. 한편, 본 발명에서 ‘단말’은 휴대성 및 이동성이 보장된 무선 통신 장치일 수 있으며, 예를 들어 스마트폰, 태블릿 PC 또는 노트북 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치일 수 있다. 또한 ‘ 단말’은 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드, 및 반지 등의 웨어러블 기기일 수도 있다. 또한, ‘단말’은 네트워크를 통해 다른 단말 또는 서버 등에 접속할 수 있는 PC 등의 유선 통신 장 치인 것도 가능하다. 의료기관에는 일반적으로 의료 영상 데이터 촬영 기기와 연동되어 촬영 기기를 제어하거나 의료 영상 데이터 전 송을 관리하는 클라이언트 단말과 의료진이 의료 영상 데이터를 보거나 가공 및 관리할 수 있는 PACS 프로그램 이 설치된 PACS 단말이 배치될 수 있다. 클라이언트 단말은 사용자 로그인, 워크리스트 및 영상 처리 내역을 출 력하기 위한 사용자 인터페이스(UI)를 제공하는 프로그램이 설치된 단말일 수 있다. PACS 단말은 PACS 서버에저장된 의료 영상 데이터, 개인 정보 데이터를 자기 공명 영상 처리 장치로 전송하고, 인공신경망 모델을 통해 복원된 의료 영상 데이터를 수신하여 PACS서버에 저장하거나, 디스플레이에 출력하기 위한 사용자 인터페 이스를 제공하는 프로그램이 설치된 단말일 수 있다. 메모리는 자기 공명 영상 처리 프로그램이 기록된 저장 매체일 수 있다. 또한, 메모리는 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행할 수 있다. 여기서, 메모리는 휘발성 저 장 매체(volatile storage media) 또는 비휘발성 저장 매체(non-volatile storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 프로세서는 자기 공명 영상 처리 장치에서 자기 공명 영상 처리 프로그램이 수행하는 전체 과정을 제 어할 수 있다. 프로세서가 수행하는 과정의 각 단계에 대해서는 후술하기로 한다. 여기서, 프로세서는 프로세서(processor)와 같이 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 여기서, '프로세서(processor)'는, 예를 들어 프로그램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로서, 마이크로프로세서(microprocessor), 중앙처리장치 (central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망 라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 데이터베이스는 자기 공명 영상 처리 장치가 프로그램을 실행하기 위해 필요한 각종 데이터가 저장된 것일 수 있다. 예를 들어, 데이터베이스에는 후술할 인공 신경망의 학습 데이터, 자기 공명 신호 데이터, k-스 페이스 데이터 및 자기 공명 영상 데이터 등이 저장된 것일 수 있다. 이하 도 2 내지 도 6을 통해 가속화 촬영을 수행함으로써 자기 공명 영상을 획득하는 방법에 대해 상세히 설명 한다. 도 2a 및 도 2b는 본 발명의 일 실시예에 따른 k-space 영역에서 자기 공명 영상 처리 방법을 보여주는 도면이 고, 도 3a 및 도 3b는 본 발명의 일 실시예에 따른 이미지 영역에서 자기 공명 영상 처리 방법을 보여주는 도면 이고, 도 4는 본 발명의 일 실시예에 따른 서브 샘플링과 풀 샘플링의 차이점을 설명하기 위한 개략도이고, 도 5는 본 발명의 일 실시예에 따른 제1 인공 신경망 모델을 이용하여 제1 k-스페이스 데이터로부터 제2 k-스페이 스 데이터를 획득하는 것을 보여주는 개략도이고, 도 6은 본 발명의 일 실시예에 따른 제2 인공 신경망 모델을 이용하여 제1 자기 공명 영상으로부터 제2 자기 공명 영상을 획득하는 것을 보여주는 개략도이다. 본 명세서에서, 서브 샘플링된 자기 공명 신호를 이용하여 자기 공명 영상을 획득하는 촬영을 가속화 찰영이라 호칭한다. 가속화 촬영이란 일반 촬영과 대비하여 획득하는 자기 공명 신호가 감소된 촬영을 의미할 수 있다. 예를 들어 일반 촬영은 풀 샘플링된 자기 공명 신호를 획득하는 것일 수 있고, 가속화 촬영은 서브 샘플링된 자기 공명 신 호를 획득하는 것을 의미할 수 있다. 예를 들어 일반 촬영이란 100%의 자기 공명 신호를 획득하기 위해 1시간이 소요되는 촬영일 수 있고, 가속화 촬영이란 50%의 자기 공명 신호를 획득하기 위해 30분이 소요되는 촬영일 수 있다. 이에 따라 일반 촬영을 통해 고품질의 자기 공명 영상을 획득할 수 있고, 가속화 촬영을 통해 상대적으로 저품질의 자기 공명 영상을 획득할 수 있다. 저품질의 자기 공명 영상은 고품질의 자기 공명 영상에 비해 해상 도가 낮은 이미지를 지칭하거나, 노이즈를 더 많이 포함한 이미지를 지칭할 수 있다. 한 예로서, 가속화 촬영이란 임상적으로 사용되는 촬영에 비해 여기횟수(number of excitations, NEX)를 줄인 촬영일 수 있다. 한 예로서, 가속화 촬영이란 임상적으로 사용되는 촬영에 비해 페이즈 레졸루션(Phase resolution)을 줄인 촬영일 수 있다. 한 예로서, 가속화 촬영이란 임상적으로 사용되는 촬영에 비해 가속화 지 수(Acceleration factor)를 높이고 병렬 영상 기법을 적용한 촬영일 수 있다. 또한 가속화 촬영된 영상이란, 실 제 자기공명영상 촬영 장치를 통해 촬영된 영상 뿐만 아니라 컴퓨터 시뮬레이션을 통해 일반 촬영된 영상을 가 속화 촬영된 영상과 동일하거나 유사하도록 처리한 영상일 수 있다. 도 2a 및 도 2b를 참조하면 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치에 의해 수행되는 자기 공명 영상 처리 방법에 있어서, S110 단계에 앞서 가속화 촬영을 통해 서브 샘플링된 자기 공명 신호를 획득하 는 단계가 수행될 수 있다. 도 4를 참조하면, 서브 샘플링된 자기 공명 신호는 나이키스트 샘플링 레이트보다 낮은 샘플링 레이트로 샘플링된 자기 공명 신호일 수 있다. 또한, 서브 샘플링된 자기 공명 영상은 나이키스트 샘플링 레이트보다 낮 은 샘플링 레이트로 자기 공명 신호를 샘플링하여 획득된 영상이다. 한편, 풀 샘플링된 자기 공명 영상은 나이 키스트 샘플링 레이트 이상의 샘플링 레이트로 k-스페이스 데이터를 샘플링하여 획득된 영상일 수 있다. 예를 들어, 풀 샘플링된 자기 공명 신호의 라인(line) 수가 n개이고 서브 샘플링된 자기 공명 신호의 라인 (line) 수가 n/2개일 수 있다. 여기서 샘플링 라인의 감소된 정도가 1/2 배수이면 자기 공명 영상 촬영의 가속 화 지수가 2라고 할 수 있다. 샘플링 라인의 감소된 정도가 1/3 배수, 1/4 배수이면 가속화 지수는 각각 3, 4라 고 할 수 있다. 그리고, 서브 샘플링 방법은 균일 서브 샘플링과 비균일 서브 샘플링으로 나뉠 수 있다. 균일 서브 샘플링은 샘 플링되는 라인의 간격을 일정하게 유지하여 샘플링을 수행하는 것일 수 있다. 반면, 비균일 서브 샘플링은 일반 적으로 샘플링 데이터의 중앙 부분으로 갈수록 샘플링되는 라인의 간격을 좁혀 샘플링을 많이 하고, 중앙 부분 에서 멀어질수록 샘플링되는 라인의 간격을 넓히면서 샘플링을 적게하는 것을 의미할 수 있다. 한편, 자기 공명 영상 처리 장치는 MRI 시스템에 포함되어, RF 코일로부터 수신한 자기 공명 신호에 기초하여, 서브 샘플링된 자기 공명 신호에 대응되는 입력 데이터를 획득할 수 있다. 또한, 자기 공명 영상 처리 장 치는 외부의 자기 공명 영상 촬영 장치, 외부 서버 및 데이터 베이스 중 적어도 어느 하나로부터 서브 샘플링된 자기 공명 신호에 대응되는 입력 데이터를 획득할 수도 있다. 다시 도 2a 및 도 2b를 참조하면, 서브 샘플링된 자기 공명 신호로부터 병렬 영상 기법을 이용하여 제1 k- 스페이스 데이터를 획득하는 단계(S110)가 수행될 수 있다. 여기서, 병렬 영상 기법은 서브 샘플링된 자기 공명 신호 및/또는 k-스페이스 데이터로부터 풀 샘플링된 k-스페이스 데이터 및/또는 자기 공명 영상과 같이 정확도 높은 k-스페이스 데이터 및/또는 자기 공명 영상을 획득하기 위한 일종의 영상 복원 기법이다. 병렬 영상 기법에 따른 영상 복원의 수행에 있어, 공지 기술인 SPACE RIP(Sensitivity Profiles From an Array of Coils for Encoding and Reconstruction in Parallel), SMASH(Simultaneous acquisition of spatial harmonics), PILS(Partially Parallel Imaging With Localized Sensitivitie), GRAPPA(Generalized Autocalibrating Partially Parallel Acquisitions), SPIRiT(iterative Self-consistent Parallel Imaging Reconstruction)등의 병렬 영상 기법에 적용될 수 있는 것이라면 제한 없이 적용이 가능하다. 단계(S110) 다음으로, 제1 k-스페이스 데이터로부터 제1 인공 신경망 모델을 이용하여 제2 k-스페이 스 데이터를 획득하는 단계(S120)가 수행될 수 있다. 도 5를 참조하면, 제1 인공 신경망 모델은 통계적 기계 학습 결과를 이용하여, 적어도 하나의 서브 샘플링 된 제1 k-스페이스 데이터와 적어도 하나의 풀 샘플링된 제1 k-스페이스 데이터의 상관 관계를 학습 하는 알고리즘의 집합일 수 있다. 제1 인공 신경망 모델은 적어도 하나의 뉴럴 네트워크를 포함할 수 있다. 뉴럴 네트워크는 DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), MLP(Multilayer Perceptron), CNN(Convolutional Neural Network), U-net과 같은 방식의 네트워크 모델들을 포함할 수 있으나, 이에 한정되지 않는다. 예를 들어, 제1 인공 신경망 모델은 뉴럴 네트워크를 이용하여 적어도 하나의 서브 샘플링된 제1 k-스페이 스 데이터 및 적어도 하나의 풀 샘플링된 제1 k-스페이스 데이터의 상관 관계를 위상 인코딩 방향 (Ky)에 따라 스택되는 적어도 하나의 샘플링 라인의 픽셀들을 단위로 학습하여 구축된 모델일 수 있다. 도 4를 참조하면, 위상 인코딩 방향(Ky)이란 자기 공명 신호를 샘플링하는 과정에서 샘플링된 라인이 스택 (stack)되는 방향과 평행하게 연장된 방향일 수 있다. 그리고 리드아웃 방향(Kx)이란 샘플링된 라인이 연장된 방향일 수 있다. 한편 Kz방향은 코일의 축방향이거나 후술할 위상 인코딩 방향(Ky) 및 리드아웃 방향(Kx)과 각 각 직교하는 제1방향(Kz)으로 명명될 수 있다. 한편, 서브 샘플링된 자기 공명 신호가 복수개인 경우 제1 k-스페이스 데이터 및 제2 k-스페이스 데이터 는 각각 복수개로 획득될 수 있다. 즉, 자기 공명 신호를 수신하는 RF 코일이 복수개인 경우 각각의 채널 별로 수신되는 복수개의 자기 공명 신호에 대응하여 생성된 복수개의 복원 영상이 제1 자기 공명 영상이 되는 것이다. 또한, 제1 인공 신경망 모델은 서브 샘플링된 제1 k-스페이스 데이터 및 풀 샘플링된 제1 k-스페이스 데이 터 이외에도 다양한 추가 데이터를 이용하여 구축될 수 있다. 예를 들어, 추가 데이터로서 제1 k-스페이스 데이터에 대응되는, 실수 데이터, 허수 데이터, 크기 데이터, 위상 데이터 중 적어도 어느 하나가 이용될 수 있다. 본 발명의 실시예에 따르면 제1 인공 신경망 모델은 도 7a 내지 도 9를 통해 후술하는 방법에 따라 학습되 어, 저품질의 제1 k-스페이스 데이터로부터 고품질의 제2 k-스페이스 데이터를 생성할 수 있다. 도 3a 및 도 3b를 참조하면, 임의의 k-스페이스 데이터로부터 역 퓨리에(IFFT) 연산을 이용하여 제1 자기 공명 영상을 획득하는 단계(S210)가 수행될 수 있다. 그라파 및/또는 인공 신경망 모델은 완전한 k-스페이스 형 태의 영상 데이터를 역 퓨리에 변환하여 복원 영상인 제1 자기 공명 영상을 생성할 수 있다. 단계(S210) 다음으로, 제1 자기 공명 영상으로부터 제2 인공 신경망 모델을 이용하여 제2 자기 공명 영상을 획득하는 단계(S220)가 수행될 수 있다. 도 6을 참조하면, 제2 인공 신경망 모델은 통계적 기계 학습 결과를 이용하여, 적어도 하나의 서브 샘플링 된 자기 공명 영상과 적어도 하나의 풀 샘플링된 자기 공명 영상 간의 상관 관계를 학습하는 알고리즘의 집합일 수 있다. 제2 인공 신경망 모델은 적어도 하나의 뉴럴 네트워크를 포함할 수 있다. 뉴럴 네트워크는 DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), MLP(Multilayer Perceptron), CNN(Convolutional Neural Network)과 같은 방식의 네트워크 모델들을 포함할 수 있으나, 이에 한정되지 않는다. 예를 들어, 제2 인공 신경망 모델은 뉴럴 네트워크를 이용하여 적어도 하나의 서브 샘플링된 자기 공명 영 상 및 적어도 하나의 풀 샘플링된 자기 공명 영상 간의 상관 관계를 위상 인코딩 방향(Ky)에 따라 스택되는 적 어도 하나의 샘플링 라인의 픽셀들을 단위로 학습하여 구축된 모델일 수 있다. 또한, 제2 인공 신경망 모델은 서브 샘플링된 자기 공명 영상 및 풀 샘플링된 자기 공명 영상 이외에도 다 양한 추가 데이터를 이용하여 구축될 수 있다. 예를 들어, 추가 데이터로서 제1 자기 공명 영상에 대응되 는 k-스페이스 데이터, 실수 영상 데이터, 허수 영상 데이터, 크기 영상 데이터, 위상 영상 데이터 중 적어도 어느 하나가 이용될 수 있다. 이하에서는 제2 인공 신경망 모델이 추가적으로 스캔 파라미터를 이용하여 학습 및 복원을 수행하는 방법 에 대해 설명한다. 도 7a는 본 발명의 일 실시예에 따른 제2 인공 신경망 모델을 학습시키는 방법을 보여주는 개략도이다. 본 명세서에서 저품질의 자기 공명 영상을 학습 이미지로 호칭하고, 고품질의 자기 공명 영상을 라벨 이미 지로 호칭한다. 예를 들어, 학습 이미지는 자기 공명 신호가 서브 샘플링 되어 획득된 것이고, 라벨 이미지는 자기 공명 신호가 풀 샘플링 되어 획득된 것을 의미할 수 있다. 예를 들어, 학습 이미지의 여기횟수는 라벨 이미지의 여기횟수보다 작을 수 있다. 예를 들어, 학습 이미지의 페이즈 레졸루션은 라벨 이미지의 페이즈 레졸루션보다 작을 수 있다. 학습 이미지와 라벨 이미지의 차이점은 다양 할 수 있으며 이에 제한되지 않는다. 한편, 학습 이미지 및 라벨 이미지를 획득하기 위해 한번의 촬영이 수행되고, 한번의 촬영을 통해 획 득한 자기 공명 신호를 이용하여 전처리를 수행함으로써 학습 이미지 및 라벨 이미지를 생성할 수 있 다. 도 7a를 참조하면, 제2 인공 신경망 모델은 학습 이미지와 라벨 이미지 뿐 아니라, 학습 이미지 의 자기 공명 영상 촬영에 사용된 적어도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹 및 라 벨 이미지의 자기 공명 영상 촬영에 사용된 적어도 하나의 스캔 파라미터를 포함하는 제2 파라미터 그룹 을 함께 이용하여 학습될 수 있다. 예를 들어 제2 인공 신경망 모델은 제1 파라미터 그룹을 기 초로 생성된 제1 어텐션 데이터를 학습 이미지와 함께 학습 데이터로서 입력받을 수 있다. 그리고 제 2 인공 신경망 모델은 제2 파라미터 그룹을 기초로 생성된 제2 어텐션 데이터를 라벨 이미지 와 함께 라벨 데이터로서 입력받을 수 있다. 이로써 제2 인공 신경망 모델은 저품질의 학습 이미지와 고품질의 라벨 이미지간 상관 관계를 학습할 수 있다. 스캔 파라미터란, 자기 공명 영상을 촬영하는 과정에서 세팅되는 환경 변수들을 의미하며, 스캔 파라미터의 값 에 따라 획득되는 자기 공명 신호가 달라질 수 있고, 복원되는 자기 공명 영상 또한 달라질 수 있다. 구체적으 로 스캔 파라미터를 설정함으로써 자기 공명 영상의 촬영 시간, 해상도, 노이즈 등을 조절할 수 있다. 예를 들어 스캔 파라미터는 여기횟수(number of excitation, NEX), 페이즈 레졸루션(phase resolution) 및 가 속화 지수(acceleration factor)를 포함할 수 있으며 이는 예시적인 것일 뿐 이에 제한되지 않는다. 구체적으로 여기횟수란, k-스페이스에서 자기 공명 신호의 라인들을 반복 획득할 때의 반복된 횟수를 의미한다. 여기횟수는 Number of Averages로 지칭될 수 있다. 여기횟수가 증가함에 따라 자기 공명 영상의 촬영 시간이 비 례하여 증가할 수 있다. 예를 들어 여기횟수가 2 이상인 경우에, 여기횟수를 줄여서 세팅하고 자기 공명 영상을 촬영하는 경우 촬영 시간이 단축될 수 있다. 페이즈 레졸루션이란, k-스페이스에서 위상 인코딩 방향으로 샘플링된 라인의 개수를 미리 설정된 기준값으로 나눈 값을 의미한다. 예를 들어 페이즈 레졸루션은 0.5, 0.8, 1.0 등의 값을 가질 수 있다. 페이즈 레졸루션이 증가함에 따라 자기 공명 영상의 촬영 시간이 비례하여 증가할 수 있다. 따라서 페이즈 레졸루션을 줄여서 세팅 하고 자기 공명 영상을 촬영하는 경우 촬영 시간이 단축될 수 있다. 가속화 지수란, 병렬 영상 기법에서 사용되는 용어로서 k-스페이스에서 풀 샘플링된 신호 라인의 개수를 가속화 촬영을 통해 샘플링된 신호 라인의 개수로 나눈 값을 의미한다. 예를 들어 가속화 지수가 2라는 것은 위상 인코 딩 방향으로 자기 공명 신호를 샘플링하여 라인을 획득할 때, 풀 샘플링 신호 라인의 개수 대비 절반의 신호 라 인의 개수를 획득하는 것을 의미할 수 있으며, 예를 들어 2줄 간격으로 라인을 획득하는 것을 의미할 수 있다. 가속화 지수가 증가함에 따라 자기 공명 영상의 촬영 시간이 비례하여 감소할 수 있다. 도 7a에서 제1 파라미터 그룹 및 제2 파라미터 그룹은 각각 학습 이미지 및 라벨 이미지를 획득할 때의 여기횟수, 페이즈 레졸루션, 가속화 지수에 대한 값을 포함하므로 크기가 3일 수 있다. 이는 예시 적인 것일 뿐, 제1 파라미터 그룹의 크기 및 제2 파라미터 그룹의 크기는 각각이 포함하는 스캔 파라 미터의 종류에 따라 달라질 수 있다. 따라서 본 개시의 제2 인공 신경망 모델은 2차원 자기 공명 영상만을 이용하여 학습하는 것이 아니라 해당 자기 공명 영상을 획득할 때에 사용된 추가 데이터, 즉 스캔 파라미터를 함께 이용하여 학습된다. 이로써 이미 지 간 상관 관계에 스캔 파라미터의 상관 관계를 데이터로 이용하게 되어 복원의 정확도가 향상될 수 있다. 본 개시의 실시예에 따르면, 자기 공명 영상 촬영에 적용된 스캔 파라미터 값에 따라 자기 공명 영상을 복원하 는 과정에서 수행되어야 하는 태스크가 결정될 수 있다. 예를 들어 제1 파라미터 그룹에 포함된 스캔 파라 미터 값에 따라 학습 이미지에 적용되는 전처리 알고리즘 및 후처리 알고리즘 중 적어도 하나가 결정될 수 있다. 또한 제2 파라미터 그룹에 포함된 스캔 파라미터 값에 따라 라벨 이미지에 적용되는 전처리 알 고리즘 및 후처리 알고리즘 중 적어도 하나가 결정될 수 있다. 예를 들어 여기횟수, 페이즈 레졸루션, 가속화 지수에 따라 복원 과정에서 디노이징(denoising), 수퍼 레졸루션(super resolution) 등의 태스크가 수행될 수 있다. 따라서 자기 공명 영상 처리 과정에서 스캔 파라미터를 고려하여 복원 이미지를 생성하면, 영상 복원의 정확도 가 향상될 수 있다. 한편 도 7a에서 적어도 하나의 스캔 파라미터를 포함하는 제1 파라미터 그룹 및 제2 파라미터 그룹은 전처리 인공 신경망 모델을 통해 각각 제1 어텐션 데이터 및 제2 어텐션 데이터로 변형되는 것으로 도시되었다. 이러한 변형 과정은 반드시 인공 신경망 모델이 사용되는 것으로 제한되는 것은 아니다. 즉 1차원 형태인 제1 파라미터 그룹 및 제2 파라미터 그룹을 2차원인 자기 공명 영상과 함께 하나의 제2 인공 신경망 모델에 입력하기 위한 다양한 방법이 사용될 수 있다. 또한 제1 파라미터 그룹 및 제2 파라미터 그룹은 학습 이미지 및 라벨 이미지와 다른 형태 로 제2 인공 신경망 모델에 반영될 수 있다. 예를 들어 본 개시에서는 차원이 서로 다른 데이터를 하나의 모델에서 학습시키기 위한 예시적인 방법으로, 모델을 구성하는 레이어들 중 일부 레이어에 데이터를 반영하는 방법을 설명하나, 이에 제한되는 것은 아니다. 이에 대하여 도 8a 및 도 8b를 통해 후술한다. 도 7b는 본 발명의 일 실시예에 따른 학습된 제2 인공 신경망 모델을 이용하여 복원 이미지를 출력하는 방법을 보여주는 개략도이다. 도 7b를 참조하면, 학습이 완료된 제2 인공 신경망 모델은 입력 이미지 촬영에 사용된 적어도 하나의 스캔 파라미터를 포함하는 제3 파라미터 그룹을 함께 이용하여 복원 이미지를 생성할 수 있다. 이때 제3 파라미터 그룹은 전처리 인공 신경망을 통해 제3 어텐션 데이터로 변환될 수 있다. 본 개시에 따르면 사용자는 저품질의 자기 공명 영상과 해당 자기 공명 영상을 촬영할 때 사용한 스캔 파라미터 를, 학습이 완료된 제2 인공 신경망 모델에 입력하여 복원 이미지를 생성한다. 이때 사용자가 자기 공명 영상, 즉 입력 이미지를 변경하는 것은 어려우나 스캔 파라미터는 자기 공명 영상을 촬영하는 과정에서 세팅되는 환경 변수들을 의미하므로 스캔 파라미터의 수치들을 변경하여 입력할 수 있다. 즉 사용자는 입력 이미지를 기초로 생성된 복원 이미지의 결과를 확인하고, 원하는 복원 이미지를 얻기 위해 입 력 이미지에 대응되는 스캔 파라미터의 수치들을 변경할 수 있다. 따라서 사용자는 제2 인공 신경망 모델 에 입력되는 제3 파라미터 그룹을 조절함으로써, 사용자가 원하는 정도의 복원 이미지를 출력하도록 설정할 수 있다. 도 7a 및 도 7b에서 전처리 인공 신경망 모델이 제2 인공 신경망 모델과 분리되어 도시되었으나, 이는 예 시적인 것일 뿐 전처리 인공 신경망 모델 및 제2 인공 신경망 모델은 하나의 인공지능 모델로 구현될 수 있다. 또한 전처리 인공 신경망 모델 및 제2 인공 신경망 모델 각각은 복수의 인공지능 모델들로 구현될 수도 있다. 도 8a 및 도 8b는 본 발명의 일 실시예에 따른 스캔 파라미터를 제2 인공 신경망 모델에 입력하는 방법을 보여 주는 개략도이다. 본 개시에 따르면, 제1 파라미터 그룹, 제2 파라미터 그룹, 제3 파라미터 그룹은 1차원 데이터이고, 학습 이미 지, 라벨 이미지, 입력 이미지는 2차원 데이터으로서 데이터 차원이 서로 다를 수 있다. 서로 차원이 다른 데이터를 하나의 인공 신경망 모델에 입력하기 위해 다양한 방법이 사용될 수 있다. 도 7a를 참조하면, 제1 파라미터 그룹 및 제2 파라미터 그룹은 각각 데이터 차원이 1차원이고, 학습 이미지 및 라벨 이미지의 데이터 차원은 각각 2차원이다. 따라서 1차원의 데이터를 변형하여 인공 신경망 모델에 입력하거나 또는 2개의 1차원 데이터를 결합하여 2차원의 데이터를 생성하고, 이를 인공 신경망 모델에 입력할 수 있다. 도 8a를 참조하면, 제1 파라미터 그룹은 스캔 파라미터들의 값을 나열한 1차원 데이터이고, 제1 파라미터 그룹에 대응되는 학습 이미지는 2차원 데이터이다. 따라서 차원이 다른 데이터들을 연결(concatenate)하여 하나의 인공 신경망 모델에 입력할 수 없으므로, 제1 파라미터 그룹을 변형할 필요가 있다. 한 실시예로서, 제1 파라미터 그룹을 전처리 인공 신경망 모델에 입력하여 제1 어텐션 데이터를 생성 할 수 있다. 제1 어텐션 데이터는 제1 파라미터 그룹에 포함된 스캔 파라미터들이 제2 인공 신경망 모델의 특정 레이어 채널들에 곱해질 가중치를 나타낼 수 있다. 예를 들어 전처리 인공 신경망 모델은 완 전 연결 계층(fully connected layer)으로 구성될 수 있다. 제2 인공 신경망 모델의 일부 레이어에 채널의 축을 따라 제1 어텐션 데이터를 곱한다. 예를 들어, 상기 일부 레이어는 제2 인공 신경망 모델의 뒷부분에 위치한 레이어를 포함할 수 있다. 전처리 인공 신경망 모델은 어느 하나로 제한되는 것은 아니지만, 제1 어텐션 데이터의 길이와 제1 어텐션 데이터가 곱해질 레이어의 채널의 수가 같도록 설계될 수 있다. 도 8a에서 전처리 인공 신경망 모델이 제2 인공 신경망 모델과 분리되어 도시되었으나, 이는 예시적인 것 일 뿐 전처리 인공 신경망 모델 및 제2 인공 신경망 모델은 하나의 인공지능 모델로 구현될 수 있다. 또한 전처리 인공 신경망 모델 및 제2 인공 신경망 모델 각각은 복수의 인공지능 모델들로 구현될 수도 있다. 한편 도 8a은 제1 파라미터 그룹에 대해 예시적으로 설명하였으나, 전술한 내용은 제2 파라미터 그룹(54 0)에도 유사하게 적용될 수 있다. 즉 제2 파라미터 그룹이 전처리 인공 신경망 모델에 입력되어 제2 어텐 션 데이터가 생성되고, 제2 어텐션 데이터가 제2 인공 신경망 모델에 입력될 수 있다. 또한, 제1 파라미터 그룹 및 제2 파라미터 그룹이 함께 전처리 인공 신경망 모델에 입력되고, 어텐션 데이터가 출력될 수 도 있다. 한 실시예로서 제2 인공 신경망 모델은 U-net 아키텍처를 갖는 모델을 포함할 수 있다. 도 8b를 참조하면 제2 인공 신경망 모델의 U-net 아키텍처를 대략적으로 나타낸 것이다. 좌측의 점선 박스는 수축 경로 (contracting path), 우측의 점선 박스는 확장 경로(expanding path)에 대응될 수 있다. 이 경우, 제2 인공 신 경망 모델은 완전 연결 계층(fully connected layer)을 포함하지 않는 구조를 가질 수 있다.본 개시에 따르면, 스캔 파라미터를 제2 인공 신경망 모델에 반영하기 위해 1차원의 스캔 파라미터를 완전 연결 계층에 통과시킴으로써 1차원의 어텐션 데이터를 획득할 수 있다. 획득한 어텐션 데이터를 제2 인공 신경 망 모델을 구성하는 채널에 반영할 수 있다. 구체적으로 제2 인공 신경망 모델d이 U-net 구조를 갖는 경우, 확장 경로(Expanding path)에 포함된 특정 레이어에 채널의 축을 따라 어텐션 데이터를 곱할 수 있다. 도 8b에 도시된 채널의 개수는 6개이나 이는 예시적인 것이다. 도시되지 않은 다른 실시예로서, 제2 인공 신경망 모델의 학습 과정에서 1차원의 제1 어텐션 데이터와 제2 어텐션 데이터를 별도의 모델(예를 들어 별도의 완전 연결 계층)에 입력하여 2차원의 컨벌루션(convolution) 필 터를 생성할 수 있다. 생성된 컨벌루션 필터와 제2 인공 신경망 모델의 특정 레이어를 컨벌루션 연산함으 로써 스캔 파라미터를 제2 인공 신경망 모델에 반영할 수 있다. 또 다른 실시예로서, 제2 인공 신경망 모델이 2차원의 자기 공명 영상으로 학습됨으로써 제2 인공 신경망 모델을 구성하는 노드 및 연결 가중치가 결정되며, 결정된 값들을 스캔 파라미터를 이용하여 수정됨에 따 라 스캔 파라미터가 제2 인공 신경망 모델에 반영될 수 있다. 도 9는 본 발명의 일 실시예에 따른 스캔 파라미터를 이용한 자기 공명 영상 처리 방법의 순서를 보여주는 순서 도이다. 도 9를 참조하면, 자기 공명 영상 처리 장치는 저품질의 학습 이미지, 학습 이미지를 획득할 때 사용된 스캔 파 라미터를 포함하는 제1 파라미터 그룹, 고품질의 라벨 이미지 및 라벨 이미지를 획득할 때 사용된 스캔 파라미 터를 포함하는 제2 파라미터 그룹을 획득할 수 있다(S310). 전술한 바와 같이 학습 이미지는 라벨 이미지에 비 해 샘플링 개수가 적거나, 여기횟수가 작거나, 페이즈 레졸루션이 작을 수 있다. 자기 공명 영상 처리 장치는 학습 이미지, 제1 파라미터 그룹, 라벨 이미지 및 제2 파라미터 그룹을 이용하여 인공 신경망 모델을 학습시킬 수 있다(S320). 예를 들어 인공 신경망 모델은 도 3, 도 6, 도 7a, 도 7b, 도 8a 및 도 8b의 인공 신경망 모델에 대응될 수 있다. 인공 신경망 모델은 저품질의 이미지를 기초로 고품질의 이미지를 출력하도록 학습될 수 있다. 그리고 제1 파라 미터 그룹, 제2 파라미터 그룹 및 제3 파라미터 그룹의 데이터 차원은 1차원, 학습 이미지, 라벨 이미지 및 입 력 이미지와 데이터 차원은 2차원으로서, 서로 다른 데이터 차원을 가질 수 있다. 이때 자기 공명 영상 처리 장치는 제1 파라미터 그룹의 크기 및 제2 파라미터 그룹의 크기가 인공 신경망 모델 의 특정 레이어의 채널 수에 대응되도록 전처리할 수 있다. 구체적으로, 자기 공명 영상 처리 장치는 제1 파라미터 그룹 및 상기 제2 파라미터 그룹을 전처리 인공 신경망 모델에 입력하여 각각 제1 어텐션 데이터 및 제2 어텐션 데이터를 생성하고, 제1 어텐션 데이터 및 제2 어텐션 데이터를 인공 신경망 모델에 입력할 수 있다. 이때 전처리 인공 신경망은 도 8a의 완전 연결 계층을 의미할 수 있다. 그리고 제1 어텐션 데이터 및 제2 어텐션 데이터는 도 8b에 설명된 방법에 따라 인공 신경망 모델에 반영 될 수 있다. 자기 공명 영상 처리 장치는 입력 이미지 및 입력 이미지를 획득할 때 사용된 스캔 파라미터를 포함하는 제3 파 라미터 그룹을 학습이 완료된 인공 신경망 모델에 입력하여 복원 이미지를 생성할 수 있다(S330). 제3 파라미터 그룹 또한 전술한 바와 같이 도 8a의 완전 연결 계층을 통해 제3 어텐션 데이터로 변형될 수 있고, 제3 어텐션 데이터가 인공 신경망 모델에 반영될 수 있다."}
{"patent_id": "10-2023-0052008", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2023-0052008", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치의 구성을 보여주는 구성도이다. 도 2a 및 도 2b는 본 발명의 일 실시예에 따른 k-space 영역에서 자기 공명 영상 처리 방법을 보여주는 도면이 다. 도 3a 및 도 3b는 본 발명의 일 실시예에 따른 이미지 영역에서 자기 공명 영상 처리 방법을 보여주는 도면이다. 도 4는 본 발명의 일 실시예에 따른 서브 샘플링과 풀 샘플링의 차이점을 설명하기 위한 개략도이다. 도 5는 본 발명의 일 실시예에 따른 제1 인공 신경망 모델을 이용하여 제1 k-스페이스 데이터로부터 제2 k-스페 이스 데이터를 획득하는 것을 보여주는 개략도이다. 도 6은 본 발명의 일 실시예에 따른 제2 인공 신경망 모델을 이용하여 제1 자기 공명 영상으로부터 제2 자기 공 명 영상을 획득하는 것을 보여주는 개략도이다. 도 7a는 본 발명의 일 실시예에 따른 제2 인공 신경망 모델을 학습시키는 방법을 보여주는 개략도이다. 도 7b는 본 발명의 일 실시예에 따른 학습된 제2 인공 신경망 모델을 이용하여 복원 이미지를 출력하는 방법을 보여주는 개략도이다. 도 8a 및 도 8b는 본 발명의 일 실시예에 따른 스캔 파라미터를 제2 인공 신경망 모델에 입력하는 방법을 보여 주는 개략도이다. 도 9는 본 발명의 일 실시예에 따른 스캔 파라미터를 이용한 자기 공명 영상 처리 방법의 순서를 보여주는 순서 도이다."}
