{"patent_id": "10-2023-0122075", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0013075", "출원번호": "10-2023-0122075", "발명의 명칭": "누출 탐지 시스템", "출원인": "삼성전자주식회사", "발명자": "송준영"}}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시설물의 내부의 열화상 이미지 또는 열화상 영상을 촬영하는 열화상 카메라 모듈; 및상기 열화상 카메라 모듈로부터 전송된 상기 열화상 이미지 또는 열화상 영상을 분석하여 상기 시설물의 내부상태를 판단하는 누출 분석 모듈을 포함하고,상기 누출 분석 모듈은,상기 열화상 이미지 또는 열화상 영상을 입력 받는 입력부;상기 열화상 이미지 또는 열화상 영상으로부터 시설물의 내부 상태를 판단하는 분석부; 및판단된 상기 시설물의 내부 상태를 출력하는 출력부를 포함하고,상기 분석부는 상기 열화상 이미지 또는 열화상 영상과 상기 시설물의 내부 상태 간의 상관 관계를 학습한 인공신경망인 것을 특징으로 하는 누출 탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 누출 분석 모듈은,상기 누출 분석 모듈의 상기 출력부가 출력한 상기 시설물의 내부 상태와 실제 시설물의 내부 상태를 비교하여역전파(back propagation)를 수행하는 것을 특징으로 하는 누출 분석 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 분석부는 상기 열화상 이미지 또는 열화상 영상과 상기 시설물의 내부의상태 간의 상관 관계를 학습하기이전에, 실화상 이미지 또는 실화상 영상을 학습 데이터로 이용한 사전 학습을 거친 인공 신경망인 것을 특징으로 하는 누출 탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 분석부는 비전 트랜스포머(vision transformer, ViT)를 포함하는 것을 특징으로 하는 누출 탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 분석부는 선형 분류기를 포함하는 것을 특징으로 하는 누출 탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2025-0013075-3-제5항에 있어서,상기 분석부의 상기 선형 분류기는 한 층(layer)으로 구성되는 것을 특징으로 하는 누출 탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 누출 분석 모듈은, 상기 시설물의 내부 상태를 정상 상태 또는 누출 상태 중 어느 하나로 판단하는 것을특징으로 하는 누출 탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 누출 상태는, 상기 시설물의 내부에 가스 누출 또는 액상 누출이 발생한 상태인 것을 특징으로 하는 누출탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 열화상 카메라 모듈은 상기 시설물의 내부에서 이동할 수 있는 이동식 장치에 탑재되고, 상기 누출 분석모듈은 상기 열화상 카메라 모듈과는 상이한 장소에 구비되는 것을 특징으로 하는 누출 탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 열화상 카메라 모듈 및 상기 누출 분석 모듈은 상기 시설물의 내부에서 이동할 수 있는 이동식 장치에 탑재된 것을 특징으로 하는 누출 탐지 시스템."}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 기술적 사상은, 시설물의 내부의 열화상 이미지 또는 열화상 영상을 촬영하는 열화상 카메라 모듈; 및 상기 열화상 카메라 모듈로부터 전송된 상기 열화상 이미지 또는 열화상 영상을 분석하여 상기 시설물의 내부 상 태를 판단하는 누출 분석 모듈을 포함하고, 상기 누출 분석 모듈은, 상기 열화상 이미지 또는 열화상 영상을 입 력 받는 입력부; 상기 열화상 이미지 또는 열화상 영상으로부터 시설물의 내부 상태를 판단하는 분석부; 및 판단 된 상기 시설물의 내부 상태를 출력하는 출력부를 포함하고, 상기 분석부는 상기 열화상 이미지 또는 열화상 영 상과 상기 시설물의 내부 상태 간의 상관 관계를 학습한 인공 신경망인 것을 특징으로 하는 누출 탐지 시스템을 제공한다."}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 기술적 사상은 누출 탐지 시스템에 관한 것으로, 특히 열화상 이미지 또는 열화상 영상을 이용하는 누출 탐지 시스템에 관한 것이다."}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "반도체 설비가 설치된 시설물의 내부에서는 배관 부식이나 설비 오작동 등 다양한 원인으로 가스 누출 또는 액 상 누출이 발생할 위험이 있다. 액상 누출은 설비 시스템에 오작동을 일으키거나 작업자의 안전에 위협이 되는 문제가 있다. 설비 시스템 오작동 방지 또는 작업자의 안전 보장을 위해 조기에 누출을 발견하고 누출을 처리하 는 후속 조치가 필수적으로 요구된다."}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 기술적 사상이 해결하고자 하는 과제는, 열화상 이미지 또는 열화상 영상을 이용하여 시설물의 내부 의 누출을 탐지할 수 있는 누출 탐지 시스템을 제공하는 것이다. 또한, 본 발명의 기술적 사상이 해결하고자 하는 과제는, 이상에서 언급한 과제에 제한되지 않으며, 다른 과제 들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있다."}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위하여 본 발명의 기술적 사상은 시설물의 내부의 열화상 이미지 또는 열화상 영상을 촬영하는 열화상 카메라 모듈; 및 상기 열화상 카메라 모듈로부터 전송된 상기 열화상 이미지 또는 열화상 영상 을 분석하여 시설물의 내부 상태를 판단하는 누출 분석 모듈을 포함하고, 상기 누출 분석 모듈은, 상기 열화상 이미지 또는 열화상 영상을 입력 받는 입력부; 상기 열화상 이미지 또는 열화상 영상으로부터 상기 시설물의 내 부 상태를 판단하는 분석부; 및 판단된 상기 시설물의 내부 상태를 출력하는 출력부를 포함하고, 상기 분석부는 상기 열화상 이미지 또는 열화상 영상과 상기 시설물의 내부 상태 간의 상관 관계를 학습한 인공 신경망인 것을 특징으로 하는 누출 탐지 시스템을 제공한다. 일 실시예에 따르면, 상기 누출 분석 모듈은, 상기 누출 분석 모듈의 상기 출력부가 출력한 상기 시설물의 내부 상태와 실제 시설물의 내부 상태를 비교하여 역전파(back propagation)을 수행하는 것을 특징으로 하는 누출 분 석 시스템을 제공한다. 일 실시예에 따르면, 상기 분석부는 상기 열화상 이미지 또는 열화상 영상과 상기 시설물의 내부 상태 간의 상 관 관계를 학습하기 이전에, 실화상 이미지 또는 실화상 영상을 학습 데이터로 이용한 사전 학습을 거친 인공 신경망인 것을 특징으로 하는 누출 탐지 시스템을 제공한다. 일 실시예에 따르면, 상기 분석부는 비전 트랜스포머(vision transformer, ViT)를 포함하는 것을 특징으로 하는 누출 탐지 시스템을 제공한다. 일 실시예에 따르면, 상기 분석부는 선형 분류기를 포함하는 것을 특징으로 하는 누출 탐지 시스템을 제공한다. 일 실시예에 따르면, 상기 분석부의 상기 선형 분류기는 한 층(layer) 으로 구성되는 것을 특징으로 하는 누출 탐지 시스템을 제공한다. 일 실시예에 따르면, 상기 누출 분석 모듈은, 상기 시설물의 내부 상태를 정상 상태 또는 누출 상태 중 어느 하 나로 판단하는 것을 특징으로 하는 누출 탐지 시스템을 제공한다. 일 실시예에 따르면, 상기 누출 상태는, 상기 시설물의 내부에 가스 누출 또는 누액이 발생한 상태인 것을 특징 으로 하는 누출 탐지 시스템을 제공한다. 일 실시예에 따르면, 상기 열화상 카메라 모듈은 시설물의 내부에서 이동할 수 있는 이동식 장치에 탑재되고, 상기 누출 분석 모듈은 상기 열화상 카메라 모듈과는 상이한 장소에 구비되는 것을 특징으로 하는 누출 탐지 시 스템을 제공한다. 일 실시예에 따르면, 상기 열화상 카메라 모듈 및 상기 누출 분석 모듈은 시설물의 내부에서 이동할 수 있는 이 동식 장치에 탑재된 것을 특징으로 하는 누출 탐지 시스템을 제공한다."}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 기술적 사상에 의한 예시적인 실시예들에 의하면, 열화상 이미지 또는 열화상 영상을 이용하여 시설 물의 내부의 누출을 탐지할 수 있는 누출 탐지 시스템을 제공할 수 있다."}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과가 상술한 효과들로 제한되는 것은 아니며, 언급되지 않은 효과들은 본 명세서 및 첨부된 도면들"}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면을 참조하여 본 발명의 실시예들을 상세히 설명한다. 도면상의 동일한 구성요소에 대해서는 동 일한 참조 부호를 사용하고, 이들에 대한 중복된 설명은 생략한다. 도 1a는 본 발명의 기술적 사상에 의한 예시적인 실시예들에 따른 누출 탐지 시스템을 설명하기 위한 도면 이다. 도 1a를 참조하면, 누출 탐지 시스템은 열화상 이미지 또는 열화상 영상을 촬영하는 열화상 카메라를 탑재 한 이동식 장치, 촬영된 열화상 이미지 또는 열화상 영상을 바탕으로 시설물의 내부 상태를 판단하는 누출 분석 모듈 및 누출 분석 모듈에 대해 열화상 이미지 또는 열화상 영상과 시설물의 내부 상태 사이의 상관 관계를 학습시키는 인공지능 학습 모듈을 포함할 수 있다. 본 명세서 내에서, 시설물의 내부 상태는 시설물의 내부에 누출이 발생하지 않은 상태 또는 시설물의 내부에 누 출이 발생한 상태 중 어느 하나로 제한될 수 있다. 이하에서, 누출이 발생하지 않은 시설물의 내부 상태는 \"정 상 상태\"로 지칭될 수 있으며, 누출이 발생한 시설물의 내부 상태는 \"누출 상태\"로 지칭될 수 있다. 예시적인 실시예들에서, 시설물의 내부에 발생할 수 있는 상기 누출은 가스 누출 또는 액상 누출을 포함할 수 있다. 가스 누출로 발생하는 가스는 다양한 가스를 포함할 수 있고, 예를 들어 산성 가스 또는 염기성 가스를 포함할 수 있 으며, 액상 누출로 발생하는 누액은 다양한 액체를 포함할 수 있고, 예를 들어, 물, 산성 용액, 염기성 용액 또 는 불순물을 포함할 수 있다. 예시적인 실시예들에서, 상기 시설물은 반도체 설비가 배치된 시설물을 포함할 수 있다. 이동식 장치는 시설물의 내부를 이동하며, 점검이 요구되는 영역으로 이동할 수 있다. 예를 들어, 이동식 장치는 이동이 가능한 로봇일 수 있다. 예시적인 실시예들에서, 이동식 장치는 자율 주행이 가능할 수 있다. 예를 들어, 사용자가 이동식 장치에 점검이 요구되는 시설물의 맵(map)을 입력하고, 사용자에 의 해 입력된 시설물의 맵을 바탕으로 이동식 장치가 시설물의 내부에서 이동할 수 있다. 이동식 장치는 별도의 서버와 연결되어, 사용자가 원하는 영역으로 이동하도록 설정될 수 있다. 이동식 장치는 열화상 카메라 모듈을 포함할 수 있다. 열화상 카메라 모듈은 시설물의 열화상 이미지 또는 열화상 영상을 촬영하는 열화상 카메라일 수 있다. 열화상 카메라 모듈은, 예를 들어, 고속 카메라 또는 열화상 카메라일 수 있다. 예시적인 실시예들에서, 열화상 카메라 모듈은 특히, 시설물의 바 닥을 중점적으로 촬영할 수 있다. 시설물의 바닥을 중점적으로 촬영하기 위해서, 열화상 카메라 모듈의 촬 영 각도는 시설물의 바닥과 평행하지 않고, 시설물의 바닥을 향해 기울어져 있을 수 있다. 다시 말해, 열화상 카메라 모듈은 시설물의 바닥을 마주볼 수 있다. 누출 분석 모듈은 입력부, 분석부 및 출력부를 포함할 수 있다. 입력부로 열화상 카 메라 모듈에 의해 촬영된 열화상 이미지 또는 열화상 영상이 입력될 수 있고, 분석부는 상기 열화상 이미지 또는 열화상 영상을 분석하여 시설물의 내부 상태를 판단할 수 있다. 출력부는 시설물의 내부 상태 를 정상 상태 또는 누출 상태 중 어느 하나로 출력할 수 있으며, 예를 들면, 정상 상태를 \"0\"으로, 누출 상태를 \"1\"으로 출력할 수 있다. 예시적인 실시예들에서, 누출 분석 모듈은 이동식 장치가 아닌 별도의 장소 에서, 별도의 서버에 구비될 수 있다. 예시적인 실시예들에서, 분석부는 프로세서(processor)와 같이 데이터를 처리할 수 있는 모든 종류의 장치 를 포함할 수 있다. 여기서, \"프로세서\"는, 예를 들어 프로그램 내에 포함된 코드 또는 명령으로 표현된 기능을수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 하드 웨어에 내장된 데이터 처리 장치의 일 예로써, 마이크로프로세서(microprocessor), 중앙처리장치(central processing unit, CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application- specific integrated circuit), FPGA(field programmable gate array)등의 처리 장치를 망라할 수 있으나, 본 발명의 범위가 이에 제한되는 것은 아니다. 인공지능 학습 모듈은 누출 분석 모듈, 구체적으로는 분석부에 대해 열화상 이미지 또는 열화상 영상과 시설물의 내부 상태 사이의 상관 관계를 학습시키는 장치일 수 있다. 예시적인 실시예들에서, 인공지능 학습 모듈은 다양한 형태의 전자 장치로서, 소정의 연산 리소스를 이용하여 인공 신경망을 학습시키는 과 정에 수반되는 프로세스를 처리할 수 있는 장치를 의미할 수 있다. 예를 들면, 인공지능 학습 모듈은 휴대 용 이동 통신 장치 (예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러 블 장치, 또는 가전 장치를 포함할 수 있으나 이에 제한되지는 않는다. 상기 컴퓨팅 장치는 I/O, 메모리, 프로 세서 등을 포함할 수 있다. 인공지능 학습 모듈은 이동식 장치가 아닌 별도의 장소에서 구비될 수 있 으나, 이에 제한되지 않고, 이동식 장치에 구비될 수도 있다. 도 1b는 본 발명의 기술적 사상에 의한 예시적인 실시예들에 따른 누출 탐지 시스템을 설명하기 위한 도면 이다. 누출 탐지 시스템은 상술한 누출 탐지 시스템과 대체로 유사하게 구성되므로, 이하에서는 누출 탐지 시스템과 누출 탐지 시스템의 차이점을 중점적으로 설명한다. 도 1b를 참조하면, 누출 탐지 시스템은 열화상 이미지 또는 열화상 영상을 촬영하는 열화상 카메라를 탑재 한 이동식 장치, 촬영된 열화상 이미지 또는 열화상 영상을 바탕으로 상태를 판단하는 누출 분석 모듈 및 누출 분석 모듈에 대해 열화상 이미지 또는 열화상 영상과 시설물의 내부 상태 사이의 상관 관계 를 학습시키는 인공지능 학습 모듈을 포함할 수 있다. 이동식 장치는 시설물의 내부를 이동하며, 점검이 요구되는 영역으로 이동할 수 있다. 예를 들어, 이동식 장치는 이동이 가능한 로봇일 수 있다. 예시적인 실시예들에서, 이동식 장치는 자율 주행이 가능할 수 있다. 예를 들어, 사용자가 이동식 장치에 점검이 요구되는 시설물의 맵(map)을 입력하고, 사용자에 의 해 입력된 시설물의 맵을 바탕으로 이동식 장치가 시설물의 내부에서 이동할 수 있다. 누출 분석 모듈은 입력부, 분석부 및 출력부를 포함할 수 있다. 입력부로 열화상 카 메라 모듈에 의해 촬영된 열화상 이미지 또는 열화상 영상이 입력될 수 있고, 분석부는 상기 열화상 이미지 또는 열화상 영상을 분석하여 시설물의 내부 상태를 판단할 수 있다. 출력부는 시설물의 내부 상태 를 정상 상태 또는 누출 상태 중 어느 하나로 출력할 수 있으며, 예를 들면, 정상 상태를 \"0\"으로, 누출 상태를 \"1\"으로 출력할 수 있다. 예시적인 실시예들에서, 누출 분석 모듈은 이동식 장치에 구비될 수 있다. 인공지능 학습 모듈은 누출 분석 모듈, 구체적으로는 분석부에 대해 열화상 이미지 또는 열화상 영상과 시설물의 내부 상태 사이의 상관 관계를 학습시키는 장치일 수 있다. 이하에서는, 누출 분석 모듈이 열화상 카메라 모듈이 촬영한 열화상 이미지 또는 열화상 영상에 기반 하여 시설물의 내부 상태를 판단하는 방법을 중심으로 설명한다. 도 2는 누출 분석 모듈이 시설물의 내부 상태를 판단하는 방법을 설명하기 위한 도면이다. 도 3은 누출 분 석 모듈을 학습시키는 과정을 설명하기 위한 도면이다. 도 4는 누출 분석 모듈을 학습시키는 방법을 설명하기 위한 도면이다. 도 5는 누출 분석 모듈을 테스트하는 방법을 설명하기 위한 도면이다. 도 2를 참조하면, 누출 분석 모듈이 시설물의 내부 상태를 판단하는 방법은, 사전 학습된 누출 분석 모듈 을 제공하는 단계(S10), 상기 사전 학습된 누출 분석 모듈을 이용해, 누출 분석 모듈을 학습시 키는 단계(S20) 및 누출 분석 모듈을 테스트하는 단계(S30)를 포함할 수 있다. 이하에서는, 사전 학습된 누출 분석 모듈을 제공하는 단계(S10) 및 누출 분석 모듈을 학습시키는 단 계(S20)에 대해 구체적으로 설명한다. 도 3을 참조하면, 예시적인 실시예들에서, 누출 분석 모듈에 포함되는 분석부는 다양한 구조의 인공 신경망일 수 있으며, 열화상 카메라 모듈로부터 촬영된 적어도 하나의 열화상 이미지 또는 열화상 영상과 적어도 하나의 시설물의 내부 상태 간의 상관 관계를 학습할 수 있다. 본 명세서 내에서, \"인공 신경망\"은, 기 계학습 기술과 인지과학에서, 생물학적 신경망의 구조에 기초하여 구현된 통계학적 학습 알고리즘 또는 그 알고 리즘을 실행하는 구조를 지칭한다. 즉, 인공 신경망은, 생물학적 신경망에서와 같이 시냅스의 결합으로 네트워크를 형성한 인공 뉴런인 노드(node)들이 시냅스의 가중치를 반복적으로 조정하여, 특정 입력에 대응한 올바른 출력과 추론된 출력 사이의 오차가 감소되도록 학습함으로써, 문제 해결 능력을 가지는 기계학습 모델을 나타낸 다. 분석부를 학습시키기 위해서, 교사 신호(정답)의 입력에 의해서 문제의 해결에 최적화되도록 학습하는 지 도 학습(supervised learning) 방법을 사용할 수 있다. 이 때, 분석부의 학습은 인공지능 학습 모듈(30 0)에 의해 수행될 수 있다. 인공지능 학습 모듈에 대한 보다 구체적인 구성은 도 1a 및 도 1b에서 설명한 바와 같다. 분석부를 학습시키기 위한 적어도 하나의 열화상 이미지 또는 열화상 영상은 제1 학습 데이터으로 지 칭될 수 있으며, 적어도 하나의 시설물의 내부 상태는 제2 학습 데이터로 지칭될 수 있다. 예시적인 실시 예들에서, 분석부의 학습을 위한 제1 학습 데이터와 제2 학습 데이터 간에 상관 관계가 정의될 수 있다. 예를 들어, 제1 학습 데이터와 제2 학습 데이터 간에 상관 관계는 사용자에 의해 정의될 수 있으나, 이에 제한되지 않는다. 예시적인 실시예들에서, 시설물의 내부에 누출이 발생하게 되면, 시설물의 내부 중 누출이 발생한 부분의 온도는 시설물의 내부 중 나머지 부분의 온도와 비교할 때 상이하므로, 열화상 이미지 또는 열화상 영상을 통해 시설물의 내부에 누출이 발생한 것을 알 수 있다. 예를 들면, 시설물의 내부에 누출이 발생한 부분의 온도가 시설물의 내부 중 나머지 부분의 온도에 비해 낮으므로, 열화상 이미지 또는 열화상 영상 을 통해 시설물의 내부에 누출이 발생한 것을 알 수 있다. 따라서, 제1 학습 데이터 중, 누출이 발생하지 않은 정상 상태의 시설물의 내부의 열화상 이미지 또는 열 화상 영상을, 제2 학습 데이터 중 정상 상태와 연결시킬 수 있다. 또한, 제1 학습 데이터 중, 누출이 발생한 시설물의 내부의 열화상 이미지 또는 열화상 영상을, 제2 학습 데이터 중 누출 상태와 연결시킬 수 있다. 예를 들어, 제1 학습 데이터 중 열화상 이미지 또는 열화상 영상 1-1은, 제2 학습 데이터 중 시설물의 누출 상태와 대응될 수 있다. 예를 들어, 제1 학습 데이터 중 열화상 이미지 또는 열화상 영상 2-1은, 제2 학습 데이터 중 시설물의 정상 상태와 대응될 수 있다. 분석부는 열화상 카메라 모듈로부터 촬영된 적어도 하나의 열화상 이미지 또는 열화상 영상과 적어도 하나의 시설물의 내부 상태 간의 상관 관계를 학습하기 전, 사전 학습을 수행한 인공 신경망일 수 있다. 상기 사전 학습은 실화상 이미지 또는 실화상 영상을 이용하여 수행될 수 있다. 사전 학습을 수행한 분석부를 분석부의 학습에 이용하는 경우, 분석부의 학습에 걸리는 시간 및 분석부의 학습에 이용되는 제 1 학습 데이터 및 제2 학습 데이터의 양이, 사전 학습을 수행하지 않은 분석부를 분석부의 학습에 이용하는 경우에 비해 현저히 감소할 수 있다. 도 4를 참조하면, 누출 분석 모듈을 학습시키는 단계(S20)는, 열화상 이미지 또는 열화상 영상을 입력부 에 입력하는 단계, 입력부로부터 전달된 열화상 이미지 또는 열화상 영상으로부터 분석부가 시 설물의 내부 상태를 판단하는 단계, 출력부가 시설물의 내부 상태를 출력하는 단계를 포함할 수 있다. 예시적인 실시예들에서, 분석부는 트랜스포머를 포함할 수 있다.트랜스포머는 비전 트랜스포머 (vision transformer, ViT)로 이루어질 수 있으며, 구체적으로, 특징 인코더(feature encoder)를 포함하고, ImageNet-21k과 같은 대용량 자연 영상 데이터, 즉 실화상 이미지 또는 실화상 영상을 이용하여 사전 학습된 비 전 트랜스포머로 이루어질 수 있다. 비전 트랜스포머 모델은 이미지를 소정의 패치 단위로 분할하여 시퀀스의 형태로 구성한 후, 이 이미지 패치 시퀀스를, 기존의 트랜스포머 모델의 트랜스포머 인코더에 입력으로 인가하 여, 그에 따른 출력 값으로부터 클래스를 분류해 내는 특징을 갖는 모델이다. 비전 트랜스포머 모델은 기존의 합성곱 신경망과 달리, 트랜스포머 인코더를 통해, 분할된 이미지 패치들에 대한 셀프 어텐션(self attention) 을 수행한다는 점에서, 입력 이미지를 소정의 이미지 패치들로 분할하였을 때, 각 이미지 패치 간의 연관성을 고려할 수 있어서, 기존의 합성곱 신경망보다 높은 예측 성능을 가질 수 있다. 다만 이는 예시적인 것으로, 열 화상 이미지 또는 열화상 영상과 시설물의 내부 상태 간의 상관 관계를 학습할 수 있는 트랜스포머라면 분석부 에 포함될 수 있다. 예시적인 실시예들에서, 분석부는 분류기를 포함할 수 있다. 분류기는 선형 분류기(liner classifier)로 이루어질 수 있으나, 이는 예시적인 것으로, 열화상 이미지 또는 열화상 영상과 시설물의 내부 상태 간의 상관 관계를 분류할 수 있는 분류기라면 분석부에 포함될 수 있다. 상기 선형 분류기는 한 층(layer)으로 구성되는 선형 분류기를 포함할 수 있으나, 이에 제한되는 것은 아니고, 복수 개의 층으로 구성 되는 선형 분류기도 포함할 수 있다. 예시적인 실시예들에서, 분류기는 하나로 구성될 수 있으나, 복수로 구성 될 수도 있다. 복수로 구성될 경우, 복수의 기준에 따른 클래스를 분류하도록 기학습되어 동작할 수 있다. 분류기가 많을수록, 누출 분석 모듈로부터 출력되는 시설물의 내부 상태와 실제 시설물의 내부 상태 간의 유사도가 더욱 높아질 수 있다. 누출 분석 모듈을 학습시키는 단계(S20)는, 출력부로부터 출력된 시설물의 내부 상태를 통해, 실제 시설물의 내부 상태와 일치하는 지 확인함으로써 역전파(back propagation) 알고리즘을 수행하는 단계를 더 포 함할 수 있다. 즉, 예시적인 실시예들에서, 누출 분석 모듈은, 누출 분석 모듈의 출력부가 출력 한 시설물의 내부 상태와 실제 시설물의 내부 상태를 비교하여 역전파(back propagation)를 수행할 수 있다. 구체적으로, 출력부로부터 출력된 시설물의 내부 상태가 실제 시설물의 내부 상태와 일치하지 않는 경우, 입력부에 입력된 열화상 이미지 또는 열화상 이미지와 실제 시설물의 내부 상태 사이의 상관 관계를 다시 학습할 수 있다. 상기 역전파 알고리즘을 통해 얻은 정보에 기초하여, 다시 누출 분석 모듈을 학습시키도 록 구성될 수 있다. 구체적으로, 역전파 알고리즘을 통해 분류기의 가중치와 편향의 값이 변할 수 있고, 분류기가 더욱 실제 시설물의 내부 상태와 유사한 값을 도출할 수 있다. 누출 분석 모듈의 학습을 통해, 분석부는 열화상 카메라 모듈로부터 촬영된 적어도 하나의 열화 상 이미지 또는 열화상 영상과 적어도 하나의 시설물의 내부 상태 간의 상관 관계를 학습할 수 있다. 예시적인 실시예들에서, 누출 분석 모듈은 제1 시설물 내의 열화상 이미지 또는 열화상 영상과 제1 시설물 의 내부 상태 간의 상관 관계를 학습한 후, 제2 시설물 내의 열화상 이미지 또는 열화상 영상과 제2 시설물의 내부 상태 간의 상관 관계를 학습할 수 있다. 이 때, 제1 시설물 내의 열화상 이미지 또는 열화상 영상과 제1 시설물의 내부 상태 간의 상관 관계를 학습하기 위한 과정에 소요되는 시간 및 데이터의 양에 비해, 제2 시설물 내의 열화상 이미지 또는 열화상 영상과 제2 시 설물의 내부 상태 간의 상관 관계를 학습하기 위한 과정에 소요되는 시간 및 데이터의 양이 적을 수 있다. 다시 말해, 제2 시설물 내의 열화상 이미지 또는 열화상 영상과 제2 시설물의 내부 상태 간의 상관 관계를 학습 전에, 제1 시설물 내의 열화상 이미지 또는 열화상 영상과 제1 시설물의 내부 상태 간의 상관 관계의 학습을 거 침으로써, 제2 시설물 내의 열화상 이미지 또는 열화상 영상과 제2 시설물의 내부 상태 간의 상관 관계의 학습 에 소요되는 시간 및 데이터의 양이 줄어들 수 있다. 실험예로서, 제1 시설물의 내부 상태를 판단하는 누출 분석 모듈의 학습에 소요되는 시간 및 데이터와 제2 시설물의 내부 상태를 판단하는 누출 분석 모듈의 학습에 소요되는 시간 및 데이터를 비교하였다. 이 때, 제2 시설물의 내부 상태를 판단하는 누출 분석 모듈은, 제1 시설물의 내부 상태를 판단하는 학습을 거친 누출 분석 모듈임을 전제로 한다. 제1 시설물의 내부 상태를 판단하는 누출 분석 모듈의 경우, 제1 학습 데이터로서, 열화상 이미지 또는 열화상 영상 598개를 사용하였으며, 제2 학습 데이터로서, 정상 상태의 데이터 251개와 누출 상태의 데이터 247 개를 사용하였다. 제2 시설물의 내부 상태를 판단하는 누출 분석 모듈의 경우, 제1 학습 데이터로서 상기 제1 시설물의 내부 상태를 판단하는 누출 분석 모듈이 학습한 열화상 이미지 또는 영상의 개수인 598개보 다 적은 약 465개의 열화상 이미지 또는 영상을 사용하였다. 제2 학습 데이터로서, 정상 상태의 데이터 259개와, 상기 제1 시설물의 내부 상태를 판단하는 누출 분석 모듈이 학습한 누출 상태의 데이터보다 적은 누출 상태의 데이터 206개를 사용하였다. 제2 시설물의 내부 상태를 판단하는 누출 분석 모듈의 경우, 제1 시설물의 내부 상태를 판단하는 누출 분 석 모듈에 비해, 동일한 훈련 시간 내에서 정확도(accuracy)와 f1 점수가 크게 상승하는 추세를 보였다. 다시 말해, 특정 정확도와 f1 점수를 달성하기 위해 걸리는 시간이, 제2 시설물의 내부 상태를 판단하는 누출 분석 모듈이 제1 시설물의 내부 상태를 판단하는 누출 분석 모듈에 비해 짧았다. 이하에서는, 도 5를 참조하여, 누출 분석 모듈을 테스트하는 단계(S30)에 대해 상세히 설명한다. 도 5를 참조하면, 열화상 카메라 모듈로부터 촬영된 적어도 하나의 열화상 이미지 또는 열화상 영상과 적 어도 하나의 시설물의 내부 상태 간의 상관 관계를 학습한 분석부는, 입력부로부터 전달된 열화상 이 미지 또는 열화상 영상으로부터 시설물의 내부 상태를 판단할 수 있고, 시설물의 내부 상태를 출력부로 전 달할 수 있다. 이로써, 누출 분석 모듈은 열화상 이미지 또는 열화상 동영상의 입력에 따라 시설물의 내부 상태 정보를 출력할 수 있다. 분석부는 트랜스포머 및 분류기를 포함할 수 있으며, 전술한 바와 같이, 트랜스포머는, 특 징 인코더(feature encoder)를 포함하고, ImageNet-21k과 같은 대용량 자연 영상 데이터, 즉 실화상 이미지 또는 실화상 영상을 이용하여 사전 학습된 비전 트랜스포머일 수 있고, 분류기는 선형 분류기를 포함할 수 있다. 누출 분석 모듈을 테스트하는 단계(S30)의 경우, 누출 분석 모듈을 학습시키는 단계(S20)와 거의 유 사한 단계로 이루어질 수 있으나, 누출 분석 모듈을 학습시키는 단계(S20)와 달리 역전파를 수행하지 않을 수 있다. 도 6은 본 발명의 기술적 사상에 의한 예시적인 실시예들에 따른 누출 탐지 시스템(10, 20)을 이용하여 누출을 탐지하는 방법을 설명하기 위한 도면이다. 누출 탐지 시스템(10, 20)을 이용하여 누출을 탐지하는 방법은, 열화상 카메라 모듈을 탑재한 이동식 장치 가 시설물의 내부를 탐색하며, 열화상 카메라 모듈이 열화상 이미지 또는 열화상 영상을 촬영하는 단 계(S100), 촬영된 상기 열화상 이미지 또는 열화상 영상을 누출 분석 모듈에 입력하는 단계(S200), 누출 분석 모듈이 열화상 이미지 또는 열화상 영상으로부터 시설물의 상태를 판단하는 단계(S300) 및 누출 분석 모듈이 시설물의 상태를 출력하는 단계(S400)를 포함할 수 있다. 구체적으로, 누출 분석 모듈의 입력부가 촬영된 상기 열화상 이미지 또는 열화상 영상을 입력받을 수 있고, 누출 분석 모듈의 분석부가 트랜스포머 및 분류기를 통해 상기 열화상 이미지 또는 열화상 영 상으로부터 시설물의 내부 상태가 정상 상태 또는 누출 상태 중 어느 상태인지 판단할 수 있으며, 누출 분석 모 듈의 출력부가 분석부으로부터 판단된 시설물의 내부 상태를, 정상 상태(예를 들어, 0) 또는 누 출 상태(예를 들어, 1) 중 어느 하나로 출력할 수 있다. 본 발명의 예시적인 실시예들에 의하면, 이동식 장치에 의해 시설물의 내부를 이동하며 시설물의 내부의 열화상 이미지 또는 열화상 영상을 촬영할 수 있으며, 누출 분석 모듈에 의해 촬영된 열화상 이미지 또는 열화상 영상으로부터 시설물의 내부 상태를 알 수 있으므로, 사용자가 직접 시설물의 내부 상태를 점검하지 않 더라도, 시설물의 내부 상태를 용이하게 탐지할 수 있는 효과가 있다. 이상에서와 같이 도면과 명세서에서 예시적인 실시예들이 개시되었다. 본 명세서에서 특정한 용어를 사용하여 실시예들을 설명되었으나, 이는 단지 본 개시의 기술적 사상을 설명하기 위한 목적에서 사용된 것이지 의미 제"}
{"patent_id": "10-2023-0122075", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한이나 청구범위에 기재된 본 개시의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술분야의 통 상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 개시의 진정한 기술적 보호범위는 첨부된 청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2023-0122075", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명의 기술적 사상에 의한 예시적인 실시예들에 따른 누출 탐지 시스템을 설명하기 위한 도면이다. 도 1b는 본 발명의 기술적 사상에 의한 예시적인 실시예들에 따른 누출 탐지 시스템을 설명하기 위한 도면이다. 도 2는 누출 분석 모듈이 시설물의 내부 상태를 판단하는 방법을 설명하기 위한 도면이다. 도 3은 누출 분석 모듈을 학습시키는 과정을 설명하기 위한 도면이다. 도 4는 누출 분석 모듈을 학습시키는 방법을 설명하기 위한 도면이다. 도 5는 누출 분석 모듈을 테스트하는 방법을 설명하기 위한 도면이다. 도 6은 본 발명의 기술적 사상에 의한 예시적인 실시예들에 따른 누출 탐지 시스템을 이용하여 누출을 탐지하는 방법을 설명하기 위한 도면이다."}
