{"patent_id": "10-2021-0139242", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0055636", "출원번호": "10-2021-0139242", "발명의 명칭": "스마트 홈 통합 플랫폼 시스템 및 방법", "출원인": "주식회사 산들정보통신", "발명자": "김현주"}}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트 홈 통합 플랫폼 시스템에 있어서, 다수의 가입자에 대한 댁내 시스템 식별정보, 댁내 데이터 및 분석정보, 이벤트 발생정보, 응급상황 현황정보를포함하는 데이터를 저장하는 데이터베이스 서버;댁내 시스템으로부터 제공되는 댁내 데이터를 제공받아 분석함과 아울러 상기 댁내 데이터 및 분석정보를 상기데이터베이스 서버에 저장하고, 상기 분석정보를 토대로 어느 한 댁내 시스템이 설치된 댁내의 응급상황을 검지하고 그에따른 응급상황 통지정보를 생성하여 외부로 출력하는 데이터 분석 서버;상기 데이터 분석 서버로부터 응급상황 통지정보가 제공되면, 상기 응급상황 통지정보에 포함된 댁내 시스템 식별정보에 대응되게 미리 정해진 클라이언트 시스템 또는 단말기들로 응급상황 통지정보를 제공하여 응급상황을전파함과 아울러 상기 클라이언트 시스템 또는 단말기로부터의 요청에 따라 응급상황에 대한 대응정보를 생성하여 상기 응급상황현황정보에 부가하여 저장하는 지능형 응급 시스템;을 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼 시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 지능형 응급 시스템은, 상기 응급상황의 전파후에 상기 클라이언트 시스템 또는 단말기로부터의 요청에 따라 신고정보를 생성하여 사회안전망 서비스 제공자 시스템으로 전송하고,상기 사회안전망 서비스 제공자 시스템으로 신고정보를 전송한 후에는 응급상황 현황정보를 생성하여 상기 데이터베이스 서버에 기록하며, 상기 응급상황을 전파받은 클라이언트 시스템 또는 단말기들로 상기 응급상황 현황정보를 전송하여 신고사실을전파하고,상기 응급상황을 전파받은 클라이언트 단말기들 중 어느 하나로부터의 요청에 따라 상기 사회안전망 서비스 제공자 시스템으로 신고정보를 다시 전송함을 특징으로 하는 스마트 홈 통합 플랫폼 시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 공공 데이터를 제공하는 공공 데이터 서비스 시스템으로부터 상기 공공 데이터를 제공받아 상기 데이터베이스서버에 제공하여 기록하는 공공데이터 연동 API부;를 더 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 집합 주택 또는 대단위 주택에 설치된 관리실 시스템과 연결되어, 상기 댁내 데이터 중 전기 및 가스, 수도 중하나 이상을 포함하는 사용량 검침 데이터를 상기 관리실 시스템으로 제공하는 관리비 연동 API부;를 더 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼 시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2023-0055636-3-제1항에 있어서, 스마트 시티 시스템과 연결되어, 상기 댁내 데이터 중 일부를 상기 스마트 시티 시스템으로 제공하는 스마트 시티 연동 API부;를 더 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼 시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 데이터 분석 서버가 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 거주자의 생활패턴을 검출하여 거주자 생활패턴정보로 저장하며, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 사용량 검침 데이터, 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에구비된 전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출정보, 상기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼 시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 데이터 분석 서버가 현재의 댁내 데이터가 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 검출한 거주자의 생활패턴과 미리 정해둔 범위를 벗어나면, 응급상황으로 검지함을 특징으로 하는 스마트 홈 통합 플랫폼 시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 데이터 분석 서버가 상기 댁내 데이터가 거주자의 생활 반응이 없는 것을 지시하거나상기 댁내 데이터가 거주자의 넘어짐, 움직임 없음, 응급한 생체정보, 화재발생을 지시하는 온도, 가스누출을지시하는 공기질 중 어느 하나에 해당되면 응급상황으로 검지하며, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 검침 데이터, 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에 구비된전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출정보, 상기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함하며, 상기 생활반응이 없는 것은 검침 데이터가 미리 정해둔 수치이하이거나 상기 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보가 미리 정해둔 수치이하인 것임을 특징으로 하는 스마트 홈 통합 플랫폼 시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서, 상기 데이터베이스 서버에 기록된 데이터를 모니터링 데이터로 분석하여 미리 정해진 클라이언트 단말기들로 제공하는 통합 모니터링 시스템을 더 포함하며, 상기 모니터링 데이터는 실시간 응급상황 검지결과 및 에너지 사용량 통계정보, 미리 정해둔 거주자에 대한 실시간 댁내 데이터 중 하나 이상을 포함함을 특징으로 하는 스마트 홈 통합 플랫폼 시스템."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "스마트 홈 통합 플랫폼 처리 방법에 있어서, 공개특허 10-2023-0055636-4-댁내 시스템으로부터 제공되는 댁내 데이터를 제공받아 분석함과 아울러 상기 댁내 데이터 및 분석정보를 상기데이터베이스 서버에 저장하는 단계; 상기 분석정보를 토대로 어느 한 댁내 시스템이 설치된 댁내의 응급상황을 검지하고 그에따른 응급상황 통지정보를 생성하는 단계;상기 응급상황 통지정보가 생성되면, 상기 응급상황 통지정보에 포함된 댁내 시스템 식별정보에 대응되게 미리정해진 클라이언트 시스템 또는 단말기들로 응급상황 통지정보를 제공하여 응급상황을 전파하는 단계;상기 클라이언트 시스템 또는 단말기로부터의 요청에 따라 응급상황에 대한 대응정보를 생성하여 응급상황 현황정보에 부가하여 상기 데이터베이스 서버에 저장하는 단계;를 포함하며, 상기 데이터베이스 서버에는 다수의 가입자에 대한 댁내 시스템 식별정보, 댁내 데이터 및 분석정보, 이벤트 발생정보, 응급상황 현황정보를 포함하는 데이터를 저장함을 특징으로 하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 응급상황의 전파후에 상기 클라이언트 시스템 또는 단말기로부터의 요청에 따라 신고정보를 생성하여 사회안전망 서비스 제공자 시스템으로 전송하고,상기 사회안전망 서비스 제공자 시스템으로 신고정보를 전송한 후에는 응급상황 현황정보를 생성하여 상기 데이터베이스 서버에 기록하며, 상기 응급상황을 전파받은 클라이언트 시스템 또는 단말기들로 상기 응급상황 현황정보를 전송하여 신고사실을전파하고,상기 응급상황을 전파받은 클라이언트 단말기들 중 어느 하나로부터의 요청에 따라 상기 사회안전망 서비스 제공자 시스템으로 신고정보를 다시 전송하는 단계;를 더 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 공공 데이터를 제공하는 공공 데이터 서비스 시스템으로부터 상기 공공 데이터를 제공받아 상기 데이터베이스서버에 제공하여 기록하는 단계;를 더 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 집합 주택 또는 대단위 주택에 설치된 관리실 시스템과 연결되어, 상기 댁내 데이터 중 전기 및 가스, 수도 중하나 이상을 포함하는 사용량 검침 데이터를 상기 관리실 시스템으로 제공하는 단계;를 더 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서, 스마트 시티 시스템과 연결되어, 상기 댁내 데이터 중 일부를 상기 스마트 시티 시스템으로 제공하는 단계;를더 포함하는 것을 특징으로 하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서, 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 거주자의 생활패턴을 검출하여 거주자 생활패턴정보로 저장하는 단계;를 더 포함하며, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 사용량 검침 데이터, 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에공개특허 10-2023-0055636-5-구비된 전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출정보, 상기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함함을 특징으로하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 현재의 댁내 데이터가 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 검출한 거주자의 생활패턴과 미리 정해둔 범위를 벗어나면, 응급상황으로 검지함을 특징으로 하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서, 상기 댁내 데이터가 거주자의 생활 반응이 없는 것을 지시하거나상기 댁내 데이터가 거주자의 넘어짐, 움직임 없음, 응급한 생체정보, 화재발생을 지시하는 온도, 가스누출을지시하는 공기질 중 어느 하나에 해당되면 응급상황으로 검지하며, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 검침 데이터, 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에 구비된전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출정보, 상기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함하며, 상기 생활반응이 없는 것은 검침 데이터가 미리 정해둔 수치이하이거나 상기 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보가 미리 정해둔 수치이하인 것임을 특징으로 하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서, 상기 데이터베이스 서버에 기록된 데이터를 모니터링 데이터로 분석하여 미리 정해진 클라이언트 단말기들로 제공하는 단계;를 더 포함하며, 상기 모니터링 데이터는 실시간 응급상황 검지결과 및 에너지 사용량 통계정보, 미리 정해둔 거주자에 대한 실시간 댁내 데이터 중 하나 이상을 포함함을 특징으로 하는 스마트 홈 통합 플랫폼 처리 방법."}
{"patent_id": "10-2021-0139242", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따르는 스마트 홈 통합 플랫폼 시스템은, 다수의 가입자에 대한 댁내 시스템 식별정보, 댁내 데이터 및 분석정보, 이벤트 발생정보, 응급상황 현황정보를 포함하는 데이터를 저장하는 데이터베이스 서버; 댁내 시스 템으로부터 제공되는 댁내 데이터를 제공받아 분석함과 아울러 상기 댁내 데이터 및 분석정보를 상기 데이터베이 (뒷면에 계속)"}
{"patent_id": "10-2021-0139242", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 홈 서비스 기술에 관한 것으로, 더욱 상세하게는 본 발명은 댁내에 설치된 많은 수의 전자 장 비를 통해 댁내에서 일어나는 다양한 상태를 센싱한 데이터를 제공받아 분석하여 의미있는 정보를 생성하고 그 에 따른 정보를 처리하는 외부의 시스템들로 전달하여 스마트 홈 서비스가 안정적이고 효율적으로 제공될 수 있 게 하는 스마트 홈 서비스 플랫폼 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0139242", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 산업의 발전은 유비쿼터스(ubiquitous) 시대의 도래에 따른 홈 네트워킹을 이용한 스마트 홈 서비스 기술 의 중요성이 부각되고 있다. 상기 스마트 홈 서비스 기술은 가정내의 조명, 냉난방, 방재, 방범, 오락 및 통신 기능을 하나로 통합하여 제어함으로써 가정을 안락하고, 안전하며, 편리하게 해주는 동시에 에너지 효율을 극대 화하여 생활수준의 향상을 도모하는 기술이다. 최근 초고속 통신망과 인터넷 사용 인구의 급격한 증가에 따라 가정내 전자식 기기나 설비의 제어와 감시에 인 터넷을 이용하려는 움직임이 크게 일고 있다. 물론, 인터넷이 보급되기 이전에도 외부에서 가정내의 기기들을 제어하고자 하는 노력이 있었으나, 통신 방식 등의 한계로 인하여 많은 제약이 있었다. 그러나 전력선 통신이나 무선통신 등 다양한 유무선 통신 기술이 활발히 보급되면서 네트워크 기반의 스마트 홈 서비스 기술에 대한 관심과 수요가 증대하게 되었다. 상기의 스마트 홈 서비스의 주요 기능으로는 무인경비 기능, 방범 및 방재 기능, 주요시설 모니터링 기능, 원격 검침 기능, 주차 관제 기능 등이 있다. 상기 무인경비 기능은 세대 내에서 현관 또는 공동 현관의 방문자 영상 확인 및 출입을 통제하는 기능이다. 그리고 방범 및 방재 기능은 침입자가 있거나 가스누출 또는 화재 발생시 경보 발생과 동시에 경비실에 통보하는 기능이다. 또한 주요시설 모니터링 기능은 놀이터, 주차장 등의 원격지 의 상황을 네트워크를 통하여 실시간 확인이 가능하게 하는 기술이다. 또한 원격 검침 기능은 각 세대별 가스, 수도, 난방 등의 실시간 또는 누적 사용량 조회 및 소요비용이 산출하는 기술이며, 상기 주차 관제 기능은 경비 실은 물론 각 세대에서 차량 출입 확인과 통제를 가능하게 하는 것이다. 이처럼 스마트 홈 서비스는 댁내 생활의 중요한 정보를 제공하고 자동화에 의한 편리함을 제공해 주기 위하여 많은 전자 장비들이 개발되었다. 이에따라 댁내에 설치된 많은 수의 전자 장비를 통해 댁내에서 일어나는 다양한 상태를 센싱한 데이터를 제공받 아 분석하여 의미있는 정보를 생성하고 그에 따른 적절한 조치 등을 취할 수 있도록 핸들링할 수 있는 플랫폼 기술의 개발이 절실하게 요망되었다. 또한 집합주택은 물론이고 스마트 시티 등의 넓은 영역에 산재된 주택들로부터 수집되는 방대한 양의 데이터를 제공받아 분석하여 의미있는 정보를 생성하고 그에 따른 조치가 이루어질 수 있도록 다양한 클라이언트와 소통 하는 플랫폼 기술의 개발이 절실하게 요망되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2021-0105151호 (특허문헌 0002) 한국공개특허 제10-2021-0103870호"}
{"patent_id": "10-2021-0139242", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 댁내에 설치된 많은 수의 전자 장비를 통해 댁내에서 일어나는 다양한 상태를 센싱한 데이터를 제공 받아 분석하여 의미있는 정보를 생성하고 그에 따른 정보를 처리하는 외부의 시스템들로 전달하여 스마트 홈 서 비스가 안정적이고 효율적으로 제공될 수 있게 하는 스마트 홈 서비스 플랫폼 시스템 및 방법을 제공하는 것을 그 목적으로 한다. 또한 본 발명의 다른 목적은 집합 주택은 물론이고 도시 단위의 넓은 영역에 산재된 주택들로부터 수집되는 방 대한 양의 데이터를 제공받아 분석하여 의미있는 정보를 생성하고 그에 따른 정보를 처리하는 외부의 시스템들 로 전달하여 스마트 홈 서비스가 안정적이고 효율적으로 제공되게 함과 아울러, 응급상황이 발생되면 다양한 클 라이언트에게 전파함과 아울러 응급상황에 대한 신속한 대응 및 현황정보가 공유되게 하여 응급상황에 대한 구 난조치가 빠르고 신뢰도 높게 이루어질 수 있게 하는 스마트 홈 서비스 플랫폼 시스템 및 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0139242", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명에 따른 스마트 홈 통합 플랫폼 시스템은, 다수의 가입자에 대한 댁내 시 스템 식별정보, 댁내 데이터 및 분석정보, 이벤트 발생정보, 응급상황 현황정보를 포함하는 데이터를 저장하는 데이터베이스 서버; 댁내 시스템으로부터 제공되는 댁내 데이터를 제공받아 분석함과 아울러 상기 댁내 데이터 및 분석정보를 상기 데이터베이스 서버에 저장하고, 상기 분석정보를 토대로 어느 한 댁내 시스템이 설치된 댁 내의 응급상황을 검지하고 그에따른 응급상황 통지정보를 생성하여 외부로 출력하는 데이터 분석 서버; 및 상기 데이터 분석 서버로부터 응급상황 통지정보가 제공되면, 상기 응급상황 통지정보에 포함된 댁내 시스템 식별정 보에 대응되게 미리 정해진 클라이언트 시스템 또는 단말기들로 응급상황 통지정보를 제공하여 응급상황을 전파 함과 아울러 상기 클라이언트 시스템 또는 단말기로부터의 요청에 따라 응급상황에 대한 대응정보를 생성하여상기 응급상황 현황정보에 부가하여 저장하는 지능형 응급 시스템;을 포함한다. 특히 상기 지능형 응급 시스템이, 상기 응급상황의 전파후에 상기 클라이언트 시스템 또는 단말기로부터의 요청 에 따라 신고정보를 생성하여 사회안전망 서비스 제공자 시스템으로 전송;함을 특징으로 한다. 또한, 공공 데이터를 제공하는 공공 데이터 서비스 시스템으로부터 상기 공공 데이터를 제공받아 상기 데이터베 이스 서버에 제공하여 기록하는 공공데이터 연동 API부;를 더 포함할 수 있다. 또한, 집합 주택 또는 대단위 주택에 설치된 관리실 시스템과 연결되어, 상기 댁내 데이터 중 전기 및 가스, 수 도 중 하나 이상을 포함하는 사용량 검침 데이터를 상기 관리실 시스템으로 제공하는 관리비 연동 API부;를 더 포함할 수 있다. 또한, 스마트 시티 시스템과 연결되어, 상기 댁내 데이터 중 일부를 상기 스마트 시티 시스템으로 제공하는 스 마트 시티 연동 API부;를 더 포함할 수 있다. 또한, 상기 데이터 분석 서버가, 상기 댁내 데이터를 상기 데이터베이스 서버에 저장하여 빅데이터를 구성함을 특징으로 한다. 또한, 상기 데이터 분석 서버가, 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 거주자의 생활패턴을 검출 하여 거주자 생활패턴정보로 저장하며, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 사용량 검침 데이터, 댁내에 구비된 전자기기 의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에 구비된 전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출 정보, 상기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함하는 것을 특 징으로 한다. 또한, 상기 데이터 분석 서버가, 현재의 댁내 데이터가 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 검 출한 거주자의 생활패턴과 미리 정해둔 범위를 벗어나면, 응급상황으로 검지함을 특징으로 한다. 또한, 상기 데이터 분석 서버가, 상기 댁내 데이터가 거주자의 생활 반응이 없는 것을 지시하거나 상기 댁내 데 이터가 거주자의 넘어짐, 움직임 없음, 응급한 생체정보, 화재발생을 지시하는 온도, 가스누출을 지시하는 공기 질 중 어느 하나에 해당되면 응급상황으로 검지하며, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 검침 데이터, 댁내에 구비된 전자기기의 사용 빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에 구비된 전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출정보, 상 기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함하며, 상기 생활반응이 없는 것은 검침 데이터가 미리 정해둔 수치이하이거나 상기 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문 열림 횟수정보가 미리 정해둔 수치이하인 것임을 특징으로 한다. 또한, 상기 지능형 응급 알람 시스템은, 상기 사회안전망 서비스 제공자 시스템으로 신고정보를 전송한 후에는 응급상황 현황정보를 생성하여 상기 데이터베이스 서버에 기록하며, 상기 응급상황을 전파받은 클라이언트 시스템 또는 단말기들로 상기 응급상황 현황정보를 전송하여 신고사실을 전파함을 특징으로 한다. 또한, 상기 지능형 응급 알람 시스템은, 상기 응급상황을 전파받은 클라이언트 시스템 또는 단말기들 중 어느 하나로부터의 요청에 따라 상기 응급상황 현황정보에 대응정보를 부가하여 저장하며, 상기 대응정보는 확인자, 확인시간 및 대응내용 중 하나 이상을 포함함을 특징으로 한다. 또한, 상기 데이터베이스 서버에 기록된 데이터를 모니터링 데이터로 분석하여 미리 정해진 클라이언트 단말기 들로 제공하는 통합 모니터링 시스템을 더 포함하며, 상기 모니터링 데이터는 실시간 응급상황 검지결과를 포함 함을 특징으로 한다. 또한, 상기 데이터베이스 서버에 기록된 데이터를 모니터링 데이터로 분석하여 미리 정해진 클라이언트 단말기 들로 제공하는 통합 모니터링 시스템을 더 포함하며, 상기 모니터링 데이터는 실시간 응급상황 검지결과 및 에너지 사용량 통계정보, 미리 정해둔 거주자에 대한 실시간 댁내 데이터 중 하나 이상을 포함함을 특징으로 한다. 또한, 상기 지능형 응급 알람 시스템은, 상기 사회안전망 서비스 제공자 시스템으로 신고정보를 전송한 후에, 상기 응급상황을 전파받은 클라이언트 단말기들 중 어느 하나로부터의 요청에 따라 상기 사회안전망 서비스 제 공자 시스템으로 신고정보를 다시 전송함을 특징으로 한다. 본 발명의 다른 측면에 따른 스마트 홈 통합 플랫폼 처리 방법은, 댁내 시스템으로부터 제공되는 댁내 데이터를 제공받아 분석함과 아울러 상기 댁내 데이터 및 분석정보를 상기 데이터베이스 서버에 저장하는 단계; 상기 분석정보를 토대로 어느 한 댁내 시스템이 설치된 댁내의 응급상황을 검지하고 그에따른 응급상황 통지정 보를 생성하는 단계; 상기 응급상황 통지정보가 생성되면, 상기 응급상황 통지정보에 포함된 댁내 시스템 식별정보에 대응되게 미리 정해진 클라이언트 시스템 또는 단말기들로 응급상황 통지정보를 제공하여 응급상황을 전파하는 단계; 상기 클라이언트 시스템 또는 단말기로부터의 요청에 따라 응급상황에 대한 대응정보를 생성하여 응급상황 현황 정보에 부가하여 상기 데이터베이스 서버에 저장하는 단계;를 포함하며, 상기 데이터베이스 서버에는 다수의 가입자에 대한 댁내 시스템 식별정보, 댁내 데이터 및 분석정보, 이벤트 발 생정보, 응급상황 현황정보를 포함하는 데이터를 저장함을 특징으로 한다. 또한, 상기 응급상황의 전파후에 상기 클라이언트 시스템 또는 단말기로부터의 요청에 따라 신고정보를 생성하 여 사회안전망 서비스 제공자 시스템으로 전송하는 단계;를 더 포함할 수 있다. 또한, 공공 데이터를 제공하는 공공 데이터 서비스 시스템으로부터 상기 공공 데이터를 제공받아 상기 데이터베 이스 서버에 제공하여 기록하는 단계;를 더 포함할 수 있다. 또한, 집합 주택 또는 대단위 주택에 설치된 관리실 시스템과 연결되어, 상기 댁내 데이터 중 전기 및 가스, 수 도 중 하나 이상을 포함하는 사용량 검침 데이터를 상기 관리실 시스템으로 제공하는 단계;를 더 포함할 수 있 다. 또한, 스마트 시티 시스템과 연결되어, 상기 댁내 데이터 중 일부를 상기 스마트 시티 시스템으로 제공하는 단 계;를 더 포함할 수 있다. 또한, 상기 댁내 데이터를 상기 데이터베이스 서버에 저장하여 빅데이터를 구성하는 단계;를 더 포함할 수 있다. 또한, 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 거주자의 생활패턴을 검출하여 거주자 생활패턴정보 로 저장하는 단계;를 더 포함하며, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 사용량 검침 데이터, 댁내에 구비된 전자기기 의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에 구비된 전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출 정보, 상기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함함을 특징으로 한다. 또한, 현재의 댁내 데이터가 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 검출한 거주자의 생활패턴과 미리 정해둔 범위를 벗어나면, 응급상황으로 검지함을 특징으로 한다. 또한, 상기 댁내 데이터가 거주자의 생활 반응이 없는 것을 지시하거나 상기 댁내 데이터가 거주자의 넘어짐, 움직임 없음, 응급한 생체정보, 화재발생을 지시하는 온도, 가스누출을 지시하는 공기질 중 어느 하나에 해당되면 응급상황으로 검지하며, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 검침 데이터, 댁내에 구비된 전자기기의 사용 빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에 구비된 전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출정보, 상 기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함하며, 상기 생활반응이 없는 것은 검침 데이터가 미리 정해둔 수치이하이거나 상기 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문 열림 횟수정보가 미리 정해둔 수치이하인 것임을 특징으로 한다. 또한, 상기 사회안전망 서비스 제공자 시스템으로 신고정보를 전송한 후에는 응급상황 현황정보를 생성하여 상 기 데이터베이스 서버에 기록하는 단계; 및 상기 응급상황을 전파받은 클라이언트 시스템 또는 단말기들로 상기 응급상황 현황정보를 전송하여 신고사실을 전파하는 단계;를 더 포함할 수 있다. 또한, 상기 지능형 응급 알람 시스템은, 상기 응급상황을 전파받은 클라이언트 시스템 또는 단말기들 중 어느 하나로부터의 요청에 따라 상기 응급상황 현황정보에 대응정보를 부가하여 저장하며, 상기 대응정보는 확인자, 확인시간 및 대응내용 중 하나 이상을 포함함을 특징으로 한다. 또한, 상기 데이터베이스 서버에 기록된 데이터를 모니터링 데이터로 분석하여 미리 정해진 클라이언트 단말기 들로 제공하는 단계;를 더 포함하며, 상기 모니터링 데이터는 실시간 응급상황 검지결과를 포함함을 특징으로 한다. 또한, 상기 데이터베이스 서버에 기록된 데이터를 모니터링 데이터로 분석하여 미리 정해진 클라이언트 단말기 들로 제공하는 단계;를 더 포함하며, 상기 모니터링 데이터는 실시간 응급상황 검지결과 및 에너지 사용량 통계정보, 미리 정해둔 거주자에 대한 실 시간 댁내 데이터 중 하나 이상을 포함함을 특징으로 한다. 또한, 상기 안전망 서비스 제공자 시스템으로 신고정보를 전송한 후에, 상기 응급상황을 전파받은 클라이언트 단말기들 중 어느 하나로부터의 요청에 따라 상기 사회안전망 서비스 제 공자 시스템으로 신고정보를 다시 전송하는 단계;를 더 포함할 수 있다."}
{"patent_id": "10-2021-0139242", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 댁내에 설치된 많은 수의 전자 장비를 통해 댁내에서 일어나는 다양한 상태를 센싱한 데이터를 제공 받아 분석하여 의미있는 정보를 생성하고 그에 따른 정보를 처리하는 외부의 시스템들로 전달하여 스마트 홈 서 비스가 안정적이고 효율적으로 제공될 수 있게 하는 효과를 제공한다. 또한 본 발명은 집합 주택은 물론이고 도시 단위의 넓은 영역에 산재된 주택들로부터 수집되는 방대한 양의 데 이터를 제공받아 분석하여 의미있는 정보를 생성하고 그에 따른 정보를 처리하는 외부의 시스템들로 전달하여 스마트 홈 서비스가 안정적이고 효율적으로 제공되게 함과 아울러, 응급상황이 발생되면 다양한 클라이언트에게 전파함과 아울러 응급상황에 대한 신속한 대응 및 현황정보가 공유되게 하여 응급상황에 대한 구난조치가 빠르 고 신뢰도 높게 이루어질 수 있게 하는 효과를 제공한다."}
{"patent_id": "10-2021-0139242", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 스마트 홈 통합 서비스 플랫폼 시스템은 댁내에 설치된 많은 수의 전자 장비를 통해 댁내에서 일어나 는 다양한 상태를 센싱한 데이터를 제공받아 분석하여 의미있는 정보를 생성하고 그에 따른 정보를 처리하는 외 부의 시스템들로 전달하여 스마트 홈 서비스가 안정적이고 효율적으로 제공될 수 있게 한다. 또한 본 발명의 스마트 홈 서비스 플랫폼 시스템은 집합 주택은 물론이고 도시 단위의 넓은 영역에 산재된 주택 들로부터 수집되는 방대한 양의 데이터를 제공받아 분석하여 의미있는 정보를 생성하고 그에 따른 정보를 처리 하는 외부의 시스템들로 전달하여 스마트 홈 서비스가 안정적이고 효율적으로 제공되게 함과 아울러, 응급상황 이 발생되면 다양한 클라이언트에게 전파함과 아울러 응급상황에 대한 신속한 대응 및 현황정보가 공유되게 하 여 응급상황에 대한 구난조치가 빠르고 신뢰도 높게 이루어질 수 있게 한다. 이러한 본 발명에 따른 스마트 홈 서비스 통합 플랫폼 시스템 및 방법을 도면을 참조하여 상세히 설명한다. <스마트 홈 서비스 시스템의 구성> 도 1은 본 발명의 바람직한 실시예에 따른 스마트 홈 서비스 시스템의 구성도를 도시한 것이다. 상기 도 1을 참조하면, 상기 스마트 홈 서비스 시스템은 다수의 댁내에 설치되는 댁내 시스템들(1001~100N)과 공공 데이터 서비스 시스템과 스마트 홈 통합 플랫폼 시스템과 클라이언트 그룹으로 구성된다. 상기 댁내 시스템들(1001~100N) 각각은 그 구성 및 동작이 유사하므로 어느 한 댁내 시스템의 구성 및 동 작만을 설명한다. 상기 댁내 시스템에는 다수의 댁내 데이터 수집단말기(1021~102M)와 홈 데이터 허브 와 네트워크 서버가 포함된다. 상기 댁내 시스템이 설치된 댁내에는 가스, 수도, 전기에 대한 검침기들, 전등, 텔레비전, 냉장고, 정수 기, 식기세척기 등의 가전기기, 온도, 습도, 미세 먼지 농도 등을 센싱하는 에어컨디셔너, 공기청정기 등의 가 전기기, 사용자의 움직임을 센싱하거나 촬상하는 모니터링 단말기, 사용자의 생체정보를 센싱하거나 사용자의 넘어짐 등을 감지하는 각종 웨어러블 센서 등 다양한 종류의 전자기기가 설치된다. 상기 전자기기들은 댁내 데 이터 수집단말기들(1021~102M)로 역할하며, 상기 댁내 데이터 수집단말기들(1021~102M) 각각은 검침정보, 온/오 프정보, 문열림, 사용횟수, 사용량, 온도, 습도, 미세먼지농도 등 자신의 고유 기능에 부합되는 다양한 댁내 데 이터를 수집하고, 그 수집된 댁내 데이터를 홈 데이터 허브를 통해 스마트 홈 통합 플랫폼 시스템으 로 제공한다. 또한 상기 댁내 데이터 수집단말기들(1021~102M)로 역할하는 전자기기들은 홈 데이터 허브를 통해 제공되 는 각종 제어명령에 따른 동작을 이행하여, 전자기기들의 원격 제어를 가능하게 구현될 수 있다. 상기 홈 데이터 허브는 상기 댁내 데이터 수집단말기들(1021~102M)과 외부에 위치하는 스마트 홈 통합 플 랫폼 시스템 사이를 인터페이스한다. 상기 네트워크 서버는 상기 댁내 시스템과 홈 데이터 허브를 통해 연결되어 상기 댁내 데이터 들을 저장함과 아울러 외부의 스마트 홈 통합 플랫폼 시스템으로부터 제공되는 정보를 저장하고 미도시된 사용자 단말기를 통해 사용자에게 저장된 각종 정보를 제공하여 안내하거나 상기 사용자 단말기를 통한 사용자 제어명령을 상기 댁내 데이터 수집단말기들(1021~102M) 또는 홈 데이터 허브로 제공할 수도 있다. 상기 공공 데이터 서비스 시스템은 날씨나 생활환경, 공공안내정보 등에 대한 공공 데이터를 생성하여 상 기 스마트 홈 통합 플랫폼 시스템으로 제공한다. 상기 스마트 홈 통합 플랫폼 시스템은 빅 데이터 및 인공지능기반 데이터 분석 서버와 응급 알람 시 스템과 데이터베이스 서버와 통합 모니터링 시스템과 공공 데이터 연동 API와 관리비 연동 API와 스마트 시티 연동 API와 플랫폼 오픈 API를 포함하여 구성된다. 또한 상기 스마트 홈 통 합 플랫폼 시스템에는 상기 스마트 홈 서비스를 위해 다른 시스템과의 연동이 요구되면 해당 시스템과의 연동 API가 더 구비될 수 있으며 이는 본 발명에 의해 당업자에게 자명하다. 상기 빅 데이터 및 인공지능기반 데이터 분석 서버는 상기 다수의 댁내 시스템(1001~100N)으로부터 제공되 는 댁내 데이터를 제공받아 빅 데이터 및 인공지능 기반 데이터 분석처리를 이행하여 유의미한 정보를 생성하고, 생성된 유의미한 정보 및 댁내 데이터 전체, 또는 분석된 일부 댁내 데이터를 데이터베이스 서버에 저장한다. 상기한 빅 데이터 및 인공지능 기반 데이터 분석 서버는 정보수집 기능, 지능형 Rule 엔진, 지능형 분석 및 판단기능, 라이프로그 수집 및 빅데이터화 기능을 포함하여, 빅데이터의 관리, 빅데이터의 분석, 서비스 관 리, 레거시 시스템 연계 관리에 대한 기능을 수행한다. 또한 상기 빅 데이터 및 인공지능기반 데이터 분석 서버는 상기 다수의 댁내 시스템(1001~100N)으로부터 제공되는 댁내 데이터를 분석하여 응급상황을 검지하고, 응급상황이 검지되면 응급 알람 시스템으로 응급 상황을 통지한다. 상기 응급상황 통지를 위한 응급상황 통지정보에는 해당 댁내 데이터를 제공한 댁내 시스템에 대한 식별정보가 포함된다. 또한 상기 응급상황 검지이유에 대한 정보를 상기 데이터베이스 서버에 상기 댁내 시스템 식별정보에 대응되게 저장한다. 여기서, 상기 응급상황으로 검지되는 경우는, 실내온도 또는 공기 질이 정상범위를 벗어나는 경우, 에너지 사용량이 정상범위를 벗어나는 경우, 전자제품의 사용량이나 온오프, 문의 개폐횟수 등이 정상범위를 벗어나는 경우, 웨어러블 센서를 통해 사용자의 심장박동수가 비정상으로 체크 되거나 사용자의 넘어짐, 장시간 이동량이 없는 경우 등이 될 수 있다. 좀더 설명하면, 상기 빅 데이터 및 인공지능기반 데이터 분석서버는 미리 정해둔 시간동안 수집된 댁내 데 이터를 토대로 거주자의 생활패턴을 검출하여 거주자 생활패턴정보로 저장하고, 현재의 댁내 데이터가 미리 정 해둔 시간동안 수집된 댁내 데이터를 토대로 검출한 거주자의 생활패턴과 미리 정해둔 범위를 벗어나면, 응급상 황으로 검지할 수 있다. 여기서, 상기 댁내 데이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 사용량 검침 데이터, 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에 구비된 전자기기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기 가 센싱한 거주자 움직임 검출정보, 상기 거주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함될 수 있다. 또한 상기 빅 데이터 및 인공지능기반 데이터 분석서버는 상기 댁내 데이터가 거주자의 생활 반응이 없는 것을 지시하거나, 상기 댁내 데이터가 거주자의 넘어짐, 움직임 없음, 응급한 생체정보, 화재발생을 지시하는 온도, 가스누출을 지시하는 공기질 중 어느 하나에 해당되면 응급상황으로 검지할 수 있다. 여기서, 상기 생활 반응이 없는 것은 검침 데이터가 미리 정해둔 수치이하이거나 상기 댁내에 구비된 전자기기의 사용빈도, 사용시 간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보가 미리 정해둔 수치이하인 것일 수 있다. 상기 응급 알람 시스템은 상기 빅데이터 및 인공지능기반 데이터 분석 서버로부터 특정 댁내 시스템 에 대한 응급상황이 통지되면, 해당 댁내 시스템에 대한 댁내 데이터 및 응급상황 검지이유에 대한 정보를 독출 하여 클라이언트 그룹에 등록된 클라이언트 단말기들 중 미리 설정된 클라이언트 단말기들로 응급상황의 발생을 통지한다. 또한 상기 응급 알람 시스템은 응급상황의 발생을 통지받은 어느 한 클라이언트의 요청에 따라 상기 응급 상황에 대한 구난을 위해 119 등과 같은 긴급구난 서비스 제공자 시스템으로 응급상황 신고정보를 제공하여, 응 급상황에 대한 구난조치를 요청할 수 있다. 또한 상기 응급 알람 시스템은 응급상황 신고정보의 전송시에 상기 데이터베이스 서버에 응급상황 신고여부정보를 기록한 응급상황 현황정보를 저장하며, 상기 응급상황 현황정보에는 댁내 시스템 식별정보, 응급상황 검지이유, 응급상황 신고여부정보, 응급상황 해소여부정보, 응급 상황 신고횟수정보 등이 포함될 수 있다. 또한 상기 응급 알람 시스템은 응급상황의 발생을 통지받은 어느 한 클라이언트 단말기의 요청에 따라 상 기 응급상황이 통지된 댁내에 대한 응급상황 현황정보를 상기 데이터베이스 서버로부터 독출하여 해당 클 라이언트 단말기로 제공하여, 응급상황에 대한 신고여부는 물론이고 응급상황 검지이유, 해소여부 등을 클라이 언트가 손쉽게 확인할 수 있게 한다. 또한 상기 응급 알람 시스템은 응급상황 신고된 응급상황에 대해서도 클라이언트 단말기를 통한 클라이언 트의 요청에 따라 응급상황 신고를 재차 수행할 수 있게 하여, 클라이언트가 응급상황에 대한 처리 누락이나 지 체된 경우에도 적극적으로 대응할 수 있게 한다. 상기 데이터베이스 서버는 댁내 시스템에 대한 식별정보 및 주소 정보, 연계 클라이언트 단말기 식별정보, 연락처 정보, 거주자 정보 등으로 구성되는 서비스 가입자 정보가 저장된다. 또한 상기 데이터베이스 서버에는 상기 빅 데이터 및 인공지능기반 데이터 분석 서버가 제공하는 댁 내 데이터, 댁내 데이터를 분석한 의미있는 정보들, 응급상황 인지정보, 응급상황 검지이유정보 등을 저장하며,각 정보에는 댁내 시스템 식별정보가 더 포함된다. 또한 상기 데이터베이스 서버는 상기 응급 알람 시스템이 제공하는 응급상황 현황정보를 저장하며, 상기 응급상황 현황정보에는 댁내 시스템 식별정보, 응급상황 검지이유, 응급상황 신고여부정보, 응급상황 해소 여부정보, 응급상황 신고횟수정보 등이 포함될 수 있다. 또한 상기 데이터베이스 서버는 공공 데이터 연동 API가 제공하는 공공 데이터를 저장한다. 상기 통합 모니터링 시스템은 상기 데이터베이스 서버에 기록된 다수의 서비스 가입자의 댁내 데이터 를 독출하여 이상상태 검출정보, 통계정보 등을 생성하여 통합 모니터링을 이행하는 클라이언트의 클라이언트 단말기로 제공하여 클라이언트에게 안내한다. 또한 관리비 연동 API는 상기 다수의 서비스 가입자의 댁내에 설치된 가스, 수도, 전기에 대한 검침기들로 부터의 검침데이터를 데이터베이스에서 독출하여 관리실 시스템으로 제공하여 관리비의 부가 기능을 이행 할 수 있게 한다. 또한 상기 스마트 시티 연동 API는 데이터베이스 서버에 저장된 데이터 중 스마트 시티 시스템이 요 구하는 연동 데이터를 독출하여 스마트 시티 시스템으로 제공한다. 상기 플랫폼 오픈 API은 데이터베이스 서버에 저장된 데이터 중 개발자 시스템이 요구하는 연동 데 이터를 독출하여 개발자 시스템으로 제공한다. 상기 클라이언트 그룹은 상기 사회 안정망에 속하는 긴급구난 서비스 제공자 시스템과 단지 관리자, 사회 복지사, 지정 보호자, 유관 기관의 단말기들, 집합주택에 대한 관리실 시스템, 스마트 시티 시스템, 개발자 시 스템 등이 포함될 수 있다. 상기 클라이언트 그룹에 스마트 홈 서비스를 위한 새로운 시스템의 연결이 요 구되면 해당 시스템이 더 포함될 수 있으며, 이는 본 발명에 의해 당업자에게 자명하다. 상기한 바와 같이 구성되는 스마트 홈 시스템의 스마트 홈 통합 플랫폼 시스템의 기능 구성을 좀더 설명한 다. <스마트 홈 통합 플랫폼 시스템> 도 2는 본 발명에 따른 상기 스마트 홈 통합 플랫폼 시스템의 기능 구성도를 도시한 것이다. 상기 도 2를 참조하면, 상기 스마트 홈 통합 플랫폼 시스템은 안심외출, 응급안전관리, 건강관리, 고독사예방, 통합관 제, 응급 알람 시스템, 데이터 수집 및 데이터 연동, 인공지능기반 응급상황판단 기능을 포함할 수 있다. 상기 안심외출 기능의 경우에는 부재시 댁내 데이터를 통해 외부인의 침입을 검지하여 경보출력, 알람 메시지 전송 또는 긴급 출동요청 등의 방범 서비스를 제공하는 것이다. 상기 응급안전관리 기능의 경우에는 댁내 데이터를 통해 화재나 가스 누출 등의 검지하여 응급상황을 빠르게 검 지하여 적절한 조치를 취할 수 있게 하는 것이다. 상기 건강관리 기능의 경우에는 댁내 데이터에 포함된 거주자의 움직임량 및 생활반응, 생체데이터 등을 토대로 거주자의 건강관리 서비스를 제공하는 것이다. 상기 고독사예방 기능의 경우에는 댁내 데이터에 포함된 에너지 사용량, 전자기기의 사용량, 사용패턴, 거주자 의 움직임량 및 생활반응, 생체데이터 등을 토대로 거주자의 고독사를 예방하는 서비스를 제공하는 것이다. 상기 통합관제 기능의 경우에는 종합현황, 응급상황 모니터링, 에너지 사용량, 날씨/생활환경, 장비상태, 통계 등의 서비스를 제공하는 것이다. 상기 응급알람 기능의 경우에는 응급상황관리, 응급상황전파, 응급상황 연동 API, 응급상황통계, SMS/MMS/SNS 연동, 응급실 검색 등의 서비스를 제공하는 것이다. 상기 데이터 수집 및 데이터 연동 기능은 데이터 수집, 스마트 시티 연동 API, 공공데이터 연동 API, 플랫폼 오 픈 API, 관리비 연동 API 등을 포함한다. 상기 인공지능 기반 응급상황 판단 기능은 인공지능학습, 응급상황판단, 에너지 사용량 패턴 분석, IOT 데이터 기반 생활 패턴 분석 기능을 포함한다. 상기한 바와 같이 구성되는 스마트 홈 시스템의 스마트 홈 통합 플랫폼 시스템의 기능 중 주요 구성에 대 해 좀더 설명한다. <스마트 홈 통합 플랫폼 시스템의 주요기능> 도 3은 본 발명에 따른 상기 스마트 홈 통합 플랫폼 시스템의 주요 기능에 대한 상세 구성도를 도시한 것 이다. 상기 도 3을 참조하면, 상기 스마트 홈 통합 플랫폼 시스템의 빅데이터 및 인공지능기반 데이터 분석 서버 는 검침 데이터(에너지 사용량)을 분석하여 생활 패턴 이상 유무를 판단하고, 검침 데이터 기반의 응급상 황을 판단하는 인공지능학습 및 응급상황 판단을 이행하고 IoT 가진 데이터를 기반으로 패턴(TV 작동, 냉장고 문열림 등)을 분석하여 실증 대상자의 생활 패턴 이상 유무를 판단하는 기능을 제공한다. 상기 통합 모니터링 시스템은 실증 대상자 실시간 모니터링 기능, 날씨, 미세먼지, 보건 지수 등의 공공 데이터를 활용한 주거환경 모니터링 기능, 응급상황 발생시 실시간으로 표출하는 기능, 대상 단지별 응급상황 및 에너지 사용량 통계정보를 생성하는 기능을 제공한다. 상기 지능형 응급 알람 시스템은 응급상황 발생시 응급상황을 전파하고, 응급상황 단계 및 처리 등을 관리 하고, 응급상황을 사회안정망과 연동하는 스마트 시티 표준 연동 API를 제공하고, 응급상황을 SMS/MMS/SNS/메신 저 등을 통해 통보하는 기능을 제공한다. 상기 스마트 홈 통합 플랫폼 시스템의 데이터 수집/연동 API(310~316)는 검침 및 IoT 디바이스 등의 데이 터를 수집하는 API, 날씨나 미세먼지 등의 공공 데이터를 연동하는 API, 스마트 시티 플랫폼 데이터 연동 API, 데이터 연동 RESTful 서버 등을 제공한다. <통합 모니터링 시스템의 기능 구성> 이제 본 발명에 따른 스마트 홈 통합 플랫폼 시스템의 통합 모니터링 시스템의 기능 구성을 도 4 및 도 5를 참조하여 설명한다. 상기 도 4를 참조하면, 통합 관제 시스템은 크게 종합현황, 모니터링, 데이터, 통계, 시스템 설정 기능부로 나눌 수 있다. 상기 종합현황 기능부는 종합현황을 제공한다. 상기 모니터링 기능부는 전체 모니터링, 단지 또는 동 단위의 그룹 모니터링, 개별 모니터링, 단지 에너지 모니 터링을 제공한다. 상기 데이터 기능부는 이벤트 발생이력, 호흡, IoT, IoT 온습도, 검침, 이벤트, 이벤트 온드 등의 데이터 이력, 홈 데이터 허브에 의한 알람 로그 등을 제공한다. 상기 통계 기능부는 일별 또는 월별 이벤트 발생통계, 일별 또는 월별 장비 오류 통계, 일별 또는 월별 단지 에 너지 사용량, 전체 또는 개별에 대한 대상자 리포트 등을 제공한다. 상기 시스템 설정 기능부는 설치현황, 사용자 또는 그룹에 대한 사용자 설정, 단지 도는 세대, 장비에 대한 대 상자 설정 등을 제공한다. 상기한 본 발명에 따른 스마트 홈 통합 플랫폼 시스템의 통합 모니터링 시스템은 실증 대상자의 활동 량, 에너지 사용량을 실시간 모니터링하는 실시간 모니터링 서비스, 응급상황시에는 119 문자신고를 응급상황이 아닌 경우에는 후속조치를 할 수 있도록 돕는 응급상황 발생알림 서비스, 이벤트 발생이력과 발생통계, 대상자 가전사용 움직임, 에너지 사용량 분석을 통해 대상자의 상태와 추세 등에 대한 대상자 리포팅, 단지별 에너지 사용량 통계 등의 분석 리포팅 서비스, 날씨, 미세먼지, 보건지수 등 공공 데이터 연동으로 외부환경과 연계한 모니터링 및 케어 서비스를 제공하는 공공 데이터 연동 서비스를 제공한다. 도 6은 본 발명에 따른 종합 현황 안내화면을 예시한 도면으로, 상기 종합현황 안내화면에는 전체세대에 대한 실시간 현황, 이벤트 현황, 공공 데이터 등이 포함된다. 상기 전체세대에 대한 실시간 현황에는 응급세대, 위험 세대, 주의세대, 동작오류세대에 대한 정보가 포함되고, 이벤트 현황에는 이벤트 발생현황이 포함된다. <지능형 응급 알람 시스템의 서비스 흐름> 이제 본 발명에 따른 스마트 홈 통합 플랫폼 시스템의 지능형 응급 알람 시스템의 서비스 흐름을 도 7을 참조하여 설명한다. 상기 도 7을 참조하면, 상기 지능형 응급 알람 시스템은 상황 발생, 상황전파, 상황인지후 대응, 상황확인 및 종료의 서비스 흐름을 가진다. 상기 상황 발생은 댁내에서의 쓰러짐, 화재, SOS 발생 등이 될 수 있다. 상기 상황 전파는 카카오톡 등과 같은 메신저, SNS, SMS, MMS 등을 통해 아파트 관리인의 단말기나 요양보호사 또는 보호자의 단말기로 등록되는 비상연락처 등록번호로 응급상황 발생을 통지함과 아울러 아파트 관리실 시스 템으로 응급알람 팝업 출력, 스피커로 알람음 발생, 경광등, 비프음 출력, 경광등 점멸 등을 이행하는 것이 될 수 있다. 그리고 상황인지후 대응은, 119 문자신고 또는 전화 또는 방문 등이 될 수 있다. 그리고 상황확인 및 종료는 119 문자신고 또는 기타 대응이 될 수 있으며, 이 경우, 대응자, 대응시간, 대응내 용을 기록하는 것 등이 될 수 있다. 상기 대응내용은 병원이송, 이상없음, 장비오작동, 장비고장 등이 될 수 있 다. 상기한 본 발명에 따른 지능형 응급 알람 과정을 도 8 및 도 9를 참조하여 좀더 상세히 설명한다. 상기 도 8은 본 발명의 바람직한 실시예에 따른 지능형 응급 알람 과정의 흐름도를 도시한 것이다. 빅 데이터 및 인공지능기반 데이터 분석 서버는 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 거주 자의 생활패턴을 검출하여 거주자 생활패턴정보를 생성하여 데이터베이스 서버에 저장하며, 상기 댁내 데 이터는 전기 및 가스, 수도 중 하나 이상을 포함하는 사용량 검침 데이터, 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보, 상기 댁내에 구비된 전자기 기가 센싱한 온도, 공기질 센싱정보, 상기 댁내에 구비된 전자기기가 센싱한 거주자 움직임 검출정보, 상기 거 주자의 웨어러블 기기가 센싱한 거주자 생체정보, 움직임 정보 중 하나 이상을 포함한다. 상기 빅 데이터 및 인 공지능기반 데이터 분석서버는 현재의 댁내 데이터가 미리 정해둔 시간동안 수집된 댁내 데이터를 토대로 검출한 거주자의 생활패턴과 미리 정해둔 범위를 벗어나면, 응급상황으로 검지할 수 있다. 또한 상기 빅 데이터 및 인공지능기반 데이터 분석 서버는 상기 댁내 데이터가 거주자의 생활 반응이 없는 것을 지시하거나 상 기 댁내 데이터가 거주자의 넘어짐, 움직임 없음, 응급한 생체정보, 화재발생을 지시하는 온도, 가스누출을 지 시하는 공기질 중 어느 하나에 해당되면 응급상황으로 검지한다. 여기서, 상기 생활반응이 없는 것은 검침 데이 터가 미리 정해둔 수치이하이거나 상기 댁내에 구비된 전자기기의 사용빈도, 사용시간, 사용횟수에 대한 정보, 상기 댁내에 구비된 전자기기의 문열림 횟수정보가 미리 정해둔 수치이하인 것이 될 수 있다. 상기 빅 데이터 및 인공지능기반 데이터 분석 서버는 응급상황이 검지되면 상기 지능형 응급알람 시스템 으로 응급상황의 발생을 통지한다. 상기 지능형 응급알람 시스템은 응급상황의 발생이 통지되면(300 단계), 통합 모니터링 시스템 및 해당 댁내 데이터를 제공한 댁내 시스템 식별정보에 대응되게 미리 저장된 클 라이언트 단말기들, 관리실 시스템으로 응급상황 발생을 알리는 알림 메시지를 전송하여 응급상황 발생을 전파 한다(302,304,306단계). 상기 통합 모니터링 시스템 및 관리실 시스템은 상기 응급상황 알림 메시지를 팝 업으로 출력함과 아울러, 비상 알람음, 경광등 점멸 등을 이행하여 응급상황의 신속한 전파가 가능하게 한다. 상기 클라이언트 단말기로의 알림 메시지 전송은 SMS,MMS, 메신저 서비스, SNS 등 다양한 방식으로 이루어질 수 있다. 상기 알림 메시지에는 상황인지 링크정보가 포함된다. 상기 지능형 응급알람 시스템은 응급상황의 발생의 통지시마다 해당 응급상황의 핸들링을 위한 상황인지 링크정보를 생성하고, 상기 상황인지 링크정보를 상기 알림메시지에 부가하여 전송한다. 상기 지능형 응급알람 시스템은 응급상황 발생의 통지후에 상기 상황인지 링크정보를 통한 클라이언트측의 접속이 발생하면(308단계), 상기 상황인지 링크정보에 대응되는 웹 페이지를 통해 응급상황 안내함과 아울러 다 양한 대응방식 중 어느 하나를 선택하도록 안내하는 안내정보를 출력한다(310단계). 상기 안내정보에는 112,119 신고, 전화확인, 직접방문확인, 관리실 호출, 담당 관리자 호출 등의 방식으로 대응할 수 있으며, 어느 한 방식 으로 대응할 것인지를 안내한다. 상기의 안내에 따라 어느 한 클라이언트가 클라이언트 단말기를 통해 대응요청정보를 입력하면(312단계), 상기 지능형 응급알람 시스템은 대응방식이 112,119 신고인지를 체크한다(314단계). 상기 대응방식이 112, 119 신고이면 112, 119 신고정보를 생성하여 112,119 센터 등인 긴급구난 서비스 제공자 시스템으로 전송하며, 이는 112,119 센터로 직접 신고문자를 보내는 방식으로 변형될 수도 있다. 이러한 신고후 상기 지능형 응급알람 시스 템은 신고완료정보를 해당 댁내 데이터를 제공한 댁내 시스템 식별정보에 대응되게 미리 저장된 클라이언 트 단말기들, 관리실 시스템으로 전송하여 신고완료 사실을 전파한다(316단계). 상기한 바와 다르게 대응방식이 112,119 신고가 아니면, 상기 지능형 응급알람 시스템은 응급상황 현황정 보를 데이터베이스 서버에서 독출하여 클라이언트 단말기로 제공하여 클라이언트에게 안내한다(318단계). 상기 응급상황 현황정보는 응급상황 검지이유정보와 대응이력정보, 대응결과정보를 포함하며, 이는 지능형 응급 알람 시스템이 응급상황의 통지에 생성하며, 응급상황에 대한 대응방식의 선택에 따른 신고정보, 대응종료 정보가 제공될 때마다 실시간으로 갱신한다. 상기 지능형 응급알람 시스템은 상기 응급상황 현황정보의 제공후에, 다시 클라이언트 단말기로부터 대응 요청정보가 제공되면(320단계), 대응방식이 112,119 신고인지를 체크한다(314단계). 상기 대응방식이 112, 119 신고이면 112, 119 신고정보를 생성하여 112,119 센터 등인 긴급구난 서비스 제공자 시스템으로 전송하며, 이는 112,119 센터로 직접 신고문자를 보내는 방식으로 변형될 수도 있다. 이러한 신고후 상기 지능형 응급알람 시스 템은 신고완료정보를 해당 댁내 데이터를 제공한 댁내 시스템 식별정보에 대응되게 미리 저장된 클라이언 트 단말기들, 관리실 시스템으로 전송하여 신고완료 사실을 전파한다(316단계). 상기의 대응요청후에, 상기 지능형 응급알람 시스템은 상황종료정보의 입력을 통합 모니터링 시스템 및 해 당 댁내 데이터를 제공한 댁내 시스템 식별정보에 대응되게 미리 저장된 클라이언트 단말기들, 관리실 시스템으 로 전송하여 안내한다(326단계). 상기의 안내에 따라 통합 모니터링 시스템 및 해당 댁내 데이터를 제공한 댁내 시스템 식별정보에 대응되게 미 리 저장된 클라이언트 단말기들, 관리실 시스템 중 어느 하나를 통해 클라이언트가 상황종료정보의 입력을 지시 하면(526단계), 상기 지능형 응급알람 시스템은 확인자정보, 대응내용정보를 제공받아 저장하고 응급상황 의 종료처리를 이행한다(528~534단계). 상기 도 9는 본 발명의 바람직한 실시예에 따른 지능형 응급 알람 과정의 다른 형태의 흐름도를 도시한 것이다. 빅 데이터 및 인공지능기반 데이터 분석 서버는 응급상황이 검지되면 상기 지능형 응급알람 시스템으 로 응급상황의 발생을 통지한다. 상기 지능형 응급알람 시스템은 응급상황의 발생이 통지되면(600단계), 통합 모니터링 시스템 및 해당 댁내 데이터를 제공한 댁내 시스템 식별정보에 대응되게 미리 저장된 클라이언트 단말기들, 관리실 시스템으로 응급상황 발생을 알리는 알림 메시지를 전송하여 응급상황 발생을 전파한다(602단 계). 상기 지능형 응급알람 시스템은 응급상황의 발생의 통지시마다 해당 응급상황의 핸들링을 위한 응급상황인 지 링크정보를 생성하고, 상기 상황인지 링크정보를 상기 알림메시지에 부가하여 전송한다. 상기 지능형 응급알람 시스템은 응급상황 발생의 통지후에 상기 상황인지 링크정보를 통한 클라이언트측의 접속이 발생하면(604계), 상기 상황인지 링크정보에 대응되는 웹 페이지를 통해 응급상황을 안내한다(606단계). 상기의 안내후에 상기 지능형 응급알람 시스템은 해당 응급상황에 대한 대응요청정보가 이미 입력되었는지 를 체크한다(608단계). 해당 응급상황에 대한 대응요청정보가 이미 입력되었으면, 상기 지능형 응급알람 시스템 은 대응요청정보의 입력을 안내하는 메시지를 해당 클라이언트 단말기로 전송하여 클라이언트에게 안내한 다(609단계). 상기 대응방식에는 112,119 신고, 전화확인, 직접방문확인, 관리실 호출, 담당 관리자 호출 등의 방식 등이 포함된다. 상기의 안내에 따라 어느 한 클라이언트가 클라이언트 단말기를 통해 대응요청정보를 입력하면(610단계), 상기 지능형 응급알람 시스템은 대응방식이 112,119 신고인지를 체크한다(612단계). 상기 대응방식이 112, 119 신고이면 112, 119 신고정보를 생성하여 112,119 센터 등인 긴급구난 서비스 제공자 시스템으로 전송하며, 이는 112,119 센터로 직접 신고문자를 보내는 방식으로 변형될 수도 있다. 도한 상기 지능형 응급알람 시스템은 해당 댁내 데이터를 제공한 댁내 시스템 식별정보에 대응되게 미리 저장된 클라이언트 단말기들, 관리실 시스템 으로 신고완료 사실을 전파한다(614단계). 이러한 신고후 상기 지능형 응급알람 시스템은 신고완료정보를 응급상황 대응현황정보에 저장하고(616단계), 응급상황에 대한 대응을 종료한다. 상기한 바와 달리 응급상황에 대한 대응요청정보가 이미 입력되었으며, 그 응 대응요청이 112,119 신고인지 체 크한다(620단계). 상기 대응요청이 112,119 신고이면 상기 지능형 응급알람 시스템은 응급상황에 대한 대 응을 종료한다(634단계). 상기한 바와 달리 이미 입력된 대응요청정보가 112, 119 신고가 아니면 응급상황 현황정보를 클라이언트 단말기 를 통해 클라이언트에게 안내한다(622단계). 상기 응급상황 현황정보는 응급상황 검지이유정보와 대응이력정보, 대응결과정보를 포함하며, 이는 지능형 응급알람 시스템이 응급상황의 통지에 생성하며, 응급상황에 대한대응방식의 선택에 따른 신고정보, 대응종료정보가 제공될 때마다 실시간으로 갱신한다. 상기 지능형 응급알람 시스템은 상기 응급상황 현황정보의 제공후에, 다시 클라이언트 단말기로부터 대응 요청정보가 제공되면(624단계), 이전 대응방식으로 대응이 이루어지지 않을 것으로 판단하여 더 높은 수준의 대 응을 요청하는지, 즉 112,119 신고방식으로 대응할 것인지를 체크한다(626,628단계). 상기 대응방식이 112, 119 신고이면 112,119 신고가 중복하여 다시 이루어짐을 안내한 후에 112, 119 신고정보를 생성하여 112,119 센터 등인 긴급구난 서비스 제공자 시스템으로 전송하며, 이는 112,119 센터로 직접 신고문자를 보내는 방식으로 변 형될 수도 있다. 도한 상기 지능형 응급알람 시스템은 해당 댁내 데이터를 제공한 댁내 시스템 식별정보에 대응되게 미리 저장된 클라이언트 단말기들, 관리실 시스템으로 신고완료 사실을 전파한다(614단계). 이러한 신고후 상기 지능형 응급알람 시스템은 신고완료정보를 응급상황 대응현황정보에 저장하고(616단계), 응급상황에 대한 대응을 종료한다. <응급상황 전파대상 확대> 도 10은 응급상황을 전파하는 대상을 확대하여 응급상황 서비스 범위를 확장하는 과정을 예시한 것이다. 상기 도 10을 참조하면, 응급상황을 전파받을 보호자는 보호자 연락처 추가를 통해 주소지를 선택하여 보호자 연락처를 추가하는 방식으로, 응급상황을 전파받을 클라이언트로 추가될 수 있다. 특히 본 발명은 응급상황 발생시 아파트 당직자에게 전화로 먼저 상황확인을 이행하도록 유도하여 불필요한 119 출동 등이 발생되지 않게 할 수 있다. 또한 개인정보 보호를 미리 지정된 관리실용 PC에서만 보호자 연락처에 접근할 수 있도록 제한될 수 있다. <데이터 수집/연동 API(310~316)> 도 11은 본 발명의 바람직한 실시예에 따른 스마트 홈 통합 플랫폼 시스템의 데이터 수집/연동 API(310~316)의 주요 기능을 도시한 도면이다. 상기 도 11을 참조하면, 상기 데이터 수집/연동 API(310~316)는 대시보드, 데이터, 조건검색, 엑셀 다운로드 기능을 제공한다. 상기 대시보드 기능은 금일 데이터건수, 실시간 수집 데이터 그래프 정보를 제공한다. 상기 데이터 기능은 수집된 데이터를 테이블로 확인할 수 있게 하는 기능 으로, 수집데이터는 호흡 IoT/ IoT 온습도/ 검침/이벤트/온도 이벤트로 구분하여 확인할 수 있게 한다. 상기 조 검검색 기능은 시간, 날짜, 세대를 원하는 조건으로 선택한 후에 데이터 조회를 가능하게 한다. 상기 엑셀 다운 로드 기능은 조회한 데이터를 엑셀 파일로 다운로드할 수 있게 하는 기능이다. 이상의 설명에서 본 발명은 특정의 실시예와 관련하여 도시 및 설명하였지만, 특허청구범위에 의해 나타난 발명 의 사상 및 영역으로부터 벗어나지 않는 한도 내에서 다양한 개조 및 변화가 가능 하다는 것을 당 업계에서 통 상의 지식을 가진 자라면 누구나 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2021-0139242", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시예에 따르는 스마트 홈 시스템의 구성도, 도 2는 본 발명의 바람직한 실시예에 따르는 스마트 홈 서비스 플랫폼의 기능을 도시한 도면, 도 3은 도 1의 스마트 홈 통합 플랫폼 시스템의 각부의 기능을 도시한 도면, 도 4는 도 1의 통합 모니터링 시스템의 구성도, 도 5는 본 발명의 바람직한 실시예에 따르는 통합 모니터링 시스템의 기능구성도, 도 6은 본 발명의 바람직한 실시예에 따르는 통합 모니터링 화면을 예시한 도면, 도 7은 본 발명의 바람직한 실시예에 따르는 지능형 응급알람 시스템의 기능구성도, 도 8 및 도 9는 본 발명의 바람직한 실시예에 따르는 지능형 응급알람 시스템의 처리 절차도, 도 10은 본 발명의 바람직한 실시예에 따르는 응급상황 전파대상 확대시의 처리 과정을 개략적으로 도시한 도면, 도 11은 본 발명의 바람직한 실시예에 따르는 데이터 수집 및 연동과정을 개략적으로 도시한 도면이다."}
