{"patent_id": "10-2021-0105842", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0023940", "출원번호": "10-2021-0105842", "발명의 명칭": "웨어러블 전자 장치 및 웨어러블 전자 장치에서 양치질 정보 제공 방법", "출원인": "삼성전자주식회사", "발명자": "김현성"}}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웨어러블 전자 장치에 있어서,모션 센서;오디오 센서;디스플레이;메모리; 및상기 모션 센서, 상기 오디오 센서, 상기 메모리와 전기적으로 연결된 프로세서를 포함하고,상기 프로세서는, 상기 모션 센서를 통해 모션 센싱 정보를 획득하고, 상기 오디오 센서를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득하고, 상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하고, 상기 양치질 핸드 모션 유형에 대응된 오디오 신호 패턴을 식별하고, 상기 양치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센싱 정보 및 상기 오디오 신호에 대응된 양치질 핸드 모션을 식별하도록 설정된 웨어러블 전자장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 양치질 핸드 모션 유형은 제1 양치질 핸드 모션 유형 및 제2 양치질 핸드 모션 유형을 포함하고,상기 프로세서는,상기 양치질 핸드 모션 유형이 상기 제1 양치질 핸드 모션 유형인 경우 상기 제1 양치질 핸드 모션 유형에 대응된 제1 오디오 신호 패턴을 식별하고, 상기 양치질 핸드 모션 유형이 상기 제2 양치질 핸드 모션 유형인 경우 상기 제2 양치질 핸드 모션 유형에 대응된 제2 오디오 신호 패턴을 식별하도록 설정된 웨어러블 전자 장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제1 양치질 핸드 모션 유형은 수평 방향의 양치질 핸드 모션 유형을 포함하고, 상기 제2 양치질 핸드 모션유형은 수직 방향의 양치질 핸드 모션 유형을 포함하는 웨어러블 전자 장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 모션 센서는 가속도 센서, 자이로 센서, 지자기 센서를 포함하고,상기 모션 센싱 정보는 상기 가속도 센서에 의해 센싱된 가속도 값, 상기 자이로 센서에 의해 센싱된 상기 전자장치의 회전 방향 또는 회전각 값, 상기 지자기 센서에 의해 센싱된 지자기 방향 정보를 기반으로 획득된 핸드자세 정보, 핸드 모션에 대한 주파수 특성 정보, 핸드 모션의 크기 및 방향 정보 중 적어도 하나를 포함하는 웨공개특허 10-2023-0023940-3-어러블 전자 장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,상기 모션 센싱 정보를 기반으로 지정된 주기적인 움직임 패턴을 식별하고, 상기 지정된 주기적인 움직임 패턴이 식별된 경우 양치질 시작을 식별하도록 설정된 웨어러블 전자 장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,터치 센서를 더 포함하고,상기 프로세서는,상기 양치질 시작이 식별되면 상기 터치 센서로부터 획득된 터치 센싱 정보를 기반으로 상기 모션 센서의 센싱축을 보정하도록 설정된 웨어러블 전자 장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 프로세서는,상기 모션 센싱 정보 및/또는 상기 오디오 신호가 지정된 시간 동안 획득되지 않으면 양치질 종료를 식별하도록설정된 웨어러블 전자 장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 양치질 종료 식별에 기반하여, 상기 양치질 시작부터 상기 양치질 종료까지 양치질과 연관된 정보를 상기디스플레이에 표시하도록 설정된 웨어러블 전자 장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,통신 모듈을 더 포함하고,상기 프로세서는,상기 통신 모듈을 통해 상기 양치질과 연관된 정보를 외부 전자 장치로 전송하도록 설정된 웨어러블 전자 장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,공개특허 10-2023-0023940-4-상기 프로세서는,머신 러닝 기반의 분류기 모델을 이용한 학습에 의해 미리 획득된 양치질 핸드 모션 유형 정보와 상기 모션 센싱 정보로부터 추출된 특징 정보를 비교하여 상기 양치질 핸드 모션 유형을 식별하도록 설정된 웨어러블 전자장치."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "웨어러블 전자 장치에서 양치질 정보 제공 방법에 있어서,모션 센서를 통해 모션 센싱 정보를 획득하는 동작;오디오 센서를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득하는 동작;상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하는 동작; 상기 양치질 핸드 모션 유형에 대응하여 오디오 신호 패턴을 식별하는 동작; 및상기 양치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센싱 정보 및 상기 오디오 신호에대응된 양치질 핸드 모션을 식별하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 양치질 핸드 모션 유형은 제1 양치질 핸드 모션 유형 및 제2 양치질 핸드 모션 유형을 포함하고,상기 양치질 핸드 모션 유형이 상기 제1 양치질 핸드 모션 유형인 경우 상기 제1 양치질 핸드 모션 유형에 대응된 제1 오디오 신호 패턴을 식별하는 동작; 및상기 양치질 핸드 모션 유형이 상기 제2 양치질 핸드 모션 유형인 경우 상기 제2 양치질 핸드 모션 유형에 대응된 제2 오디오 신호 패턴을 식별하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제1 양치질 핸드 모션 유형은 수평 방향의 양치질 핸드 모션 유형을 포함하고, 상기 제2 양치질 핸드 모션유형은 수직 방향의 양치질 핸드 모션 유형을 포함하는 방법."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 모션 센서는 가속도 센서, 자이로 센서, 지자기 센서를 포함하고,상기 모션 센싱 정보는 상기 가속도 센서에 의해 센싱된 가속도 값, 상기 자이로 센서에 의해 센싱된 상기 전자장치의 회전 방향 또는 회전각 값, 상기 지자기 센서에 의해 센싱된 지자기 방향 정보를 기반으로 획득된 핸드자세 정보, 핸드 모션에 대한 주파수 특성 정보, 핸드 모션의 크기 및 방향 정보 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,공개특허 10-2023-0023940-5-상기 모션 센싱 정보를 기반으로 지정된 주기적인 움직임 패턴을 식별하는 동작; 및상기 지정된 주기적인 움직임 패턴이 식별된 경우 양치질 시작을 식별하는 동작을 더 포함하는 방법"}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 양치질 시작이 식별되면 터치 센서로부터 획득된 터치 센싱 정보를 기반으로 상기 모션 센서의 센싱 축을보정하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 모션 센싱 정보 및/또는 상기 오디오 신호가 지정된 시간 동안 획득되지 않으면 양치질 종료를 식별하는동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 양치질 종료 식별에 기반하여, 상기 양치질 시작부터 상기 양치질 종료까지 양치질과 연관된 정보를 디스플레이에 표시하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,통신 모듈을 통해 상기 양치질과 연관된 정보를 외부 전자 장치로 전송하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0105842", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도하나의 동작은,모션 센서를 통해 모션 센싱 정보를 획득하는 동작;오디오 센서를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득하는 동작;상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하는 동작; 상기 양치질 핸드 모션 유형에 대응하여 오디오 신호 패턴을 식별하는 동작; 및상기 양치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센싱 정보 및 상기 오디오 신호에대응된 양치질 핸드 모션을 식별하는 동작을 포함하는 저장 매체."}
{"patent_id": "10-2021-0105842", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따르면, 웨어러블 전자 장치는 모션 센서, 오디오 센서, 디스플레이, 메모리, 및 상기 모션 센 서, 상기 오디오 센서, 상기 메모리와 전기적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 모션 센 서를 통해 모션 센싱 정보를 획득하고, 상기 오디오 센서를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득하고, 상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하고, 상기 양치질 핸드 모션 유형에 대 응된 오디오 신호 패턴을 식별하고, 상기 양치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센싱 정보 및 상기 오디오 신호에 대응된 양치질 핸드 모션을 식별하도록 설정될 수 있으며, 다른 실시예도 가능 할 수 있다."}
{"patent_id": "10-2021-0105842", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시예들은 웨어러블 전자 장치 및 웨어러블 전자 장치에서 양치질 정보 제공 방법에 관한 것이다."}
{"patent_id": "10-2021-0105842", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 전자 장치에 다양한 기능이 탑재될 수 있다. 예를 들면, 통신 기능뿐만 아니라, 게임과 같은 엔터테인 먼트 기능, 음악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹을 위한 통신 및 보안 기능 또는 일정 관리 나 전자 지갑과 같은 다양한 기능이 하나의 전자 장치에 집약되고 있다. 이러한 전자 장치는 사용자가 편리하게 휴대하고 착용할 수 있도록 소형화되고 있다. 전자, 통신 기술이 발달하면서, 이러한 전자 장치는 신체에 착용 한 상태에서도 큰 불편함 없이 사용할 수 있을 정도로 소형화, 경량화되고 있다. 일상 생활에서 사용하기 편리하고 휴대 또는 착용 가능한 형태의 전자 기기로서 웨어러블 전자 장치의 활용도가 높아지고 있다. 예를 들면, 웨어러블 전자 장치는 안경, 시계, 반지 등과 같은 액세서리, 의복 또는 신체 이식 형태 등의 다양한 형태로 구현될 수 있으며, 주변 환경에 대한 상세 정보나 개인의 신체 변화를 실시간으로 수 집하여 제공할 수 있다."}
{"patent_id": "10-2021-0105842", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "사용자들은 주변 환경에 대한 상세 정보나 개인의 신체 정보로서 양치질과 연관된 정보를 얻기 원할 수 있다. 종래 스마트 칫솔과 같은 장치를 통해 사용자의 양치질과 연관된 정보를 제공받을 수 있었다. 그러나 스마트 칫 솔은 주기적으로 교체가 필요할 수 있고, 사용자는 장소와 상황에 따라 다른 칫솔을 이용할 수 있어서 시간과 장소에 구애받지 않고 양치질과 연관된 정보를 얻기에는 불편함이 있을 수 있다. 또한 종래 제공받을 수 있는 양치질과 연관된 정보는 양치질 상황의 인식 정확도가 낮아 신뢰도가 낮을 수 있다. 따라서 사용자가 일상 생활에서 사용하기 편리하고 휴대 또는 착용 가능한 형태의 웨어러블 전자 장치를 통해 양치질과 연관된 정보를 얻을 수 있다면 편리할 수 있을 것이다. 또한 진보된 센싱 방식을 통해 양치질 상황을 보다 정확하게 인식할 수 있다면 보다 신뢰도 높은 양치질과 연관된 정보를 제공할 수 있을 것이다. 다양한 실시예에 따라 일상 생활에서 모션 및 소리 감지를 통해 양치질과 연관된 다양하고 정확한 정보를 확인 할 수 있는 웨어러블 전자 장치 및 방법을 제공하고자 한다. 다양한 실시예에 따라 사용자의 양치질 시 양치질 모션의 유형(예: 수직 방향 양치질 또는 수평 방향 양치질)을 정확히 인식할 수 있고, 양치질 모션의 유형을 기반으로 다양하고 구체적인 양치질에 관한 가이드 정보를 제공 할 수 있는 웨어러블 전자 장치 및 방법을 제공하고자 한다."}
{"patent_id": "10-2021-0105842", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따른 웨어러블 전자 장치는 모션 센서, 오디오 센서, 디스플레이, 메모리, 및 상기 모션 센서, 상기 오디오 센서, 상기 메모리와 전기적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 모션 센서를 통해 모션 센싱 정보를 획득하고, 상기 오디오 센서를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득 하고, 상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하고, 상기 양치질 핸드 모션 유형에 대응된 오디오 신호 패턴을 식별하고, 상기 양치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센 싱 정보 및 상기 오디오 신호에 대응된 양치질 핸드 모션을 식별하도록 설정될 수 있다. 다양한 실시예에 따른 웨어러블 전자 장치에서 양치질 정보 제공 방법은 모션 센서를 통해 모션 센싱 정보를 획 득하는 동작, 오디오 센서를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득하는 동작, 상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하는 동작, 상기 양치질 핸드 모션 유형에 대응하여 오디오 신호 패턴을 식별하는 동작, 및 상기 양치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센싱 정 보 및 상기 오디오 신호에 대응된 양치질 핸드 모션을 식별하는 동작을 포함할 수 있다. 다양한 실시예에 따른 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프 로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도 하나의 동작은, 모션 센서를 통해 모션 센싱 정보를 획득하는 동작, 오디오 센서를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득하는 동작, 상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하는 동작, 상기 양치질 핸드 모션 유형에 대응하여 오디오 신호 패턴을 식별하는 동작, 및 상기 양 치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센싱 정보 및 상기 오디오 신호에 대응된 양치질 핸드 모션을 식별하는 동작을 포함할 수 있다."}
{"patent_id": "10-2021-0105842", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예에 따르면 웨어러블 장치를 통해 일상 생활에서 모션 및 소리 감지를 통해 양치질과 연관된 다양 하고 보다 정확한 정보를 확인하도록 할 수 있다. 다양한 실시예에 따르면 사용자의 양치질 시 웨어러블 전자 장치를 통해 양치질 모션의 유형(예: 수직 방향 양 치질 또는 수평 방향 양치질 또는 다른 유형의 양치질)을 보다 정확히 인식할 수 있고, 양치질 모션의 유형을 기반으로 다양하고 구체적인 양치질에 관한 가이드 정보를 제공할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0105842", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전에 정 의된 용어들은 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따 라서, 본 문서에서 정의된 용어일지라도 본 발명의 실시예들을 배제하도록 해석될 수 없다. 도 1은 일 실시예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈 , 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리 , 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자11)가 생략되거나, 하나 이상의 다른 구 성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈 , 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 1eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버 는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 일 실시예에 따른 웨어러블 전자 장치의 블록도이다. 도 2를 참조하면, 일 실시예에 따른 웨어러블 전자 장치(예: 도 1의 전자 장치)는 모션 센서, 생체 센서, 터치 센서, 오디오 모듈, 통신 모듈, 프로세서, 메모리, 디스플레 이, 전력 관리 모듈, 및 배터리의 일부 또는 전부를 포함할 수 있다. 일 실시예에 따른 모션 센서(또는 관성 센서)는 전자 장치의 모션 또는 전자 장치를 착용한(또 는 소지한) 사용자 신체(예: 팔, 손가락, 또는 손목)의 모션을 센싱할 수 있다. 예를 들면, 모션 센서는 가속도(acceleration sensor) 센서 및/또는 자이로(gyro) 센서를 포함할 수 있고, 지자기 센서를 더 포함할 수 있다. 가속도 센서는 전자 장치 또는 전자 장치를 착용한 사용자의 신체의 움직임에 의한 가속도나 충격을 센싱할 수 있다. 자이로 센서는 전자 장치 또는 전자 장치를 착용한 사용자의 신체의 움직임 에 의한 전자 장치의 회전 방향 또는 회전각을 센싱할 수 있다. 지자기 센서는 지자기의 방향을 센싱할 수 있다. 예를 들면, 프로세서는 가속도 센서를 이용하여 전자 장치 또는 전자 장치를 착용한 사용 자의 신체의 움직임 여부를 식별할 수 있고, 자이로 센서를 이용하여 신체의 움직임에 의한 회전 방향 또는 회 전각을 식별할 수 있다. 예를 들면, 지자기 센서를 이용하여 신체의 모션의 진행 방향을 식별할 수 있다. 일 실시예에 따른 생체 센서는 적어도 하나의 생체 센서를 포함할 수 있다. 생체 센서는 사용자의 생체 신 호를 센싱할 수 있는 센서일 수 있다. 일 실시예에 따른 생체 센서는 사용자의 생체 신호를 센싱하여 측정 된 생체 신호 또는 사용자의 생체 신호를 센싱하여 측정된 생체 신호 기반의 정보(값 또는 수치)(예: 혈중 산소 포화도 수치, 체온 수치, 심전도, 흥분 상태 수치, 수화도 또는/및 탈수도 수치)를 프로세서에 제공할 수 있다. 예를 들면, 생체 센서는 PPG(photoplethysmography) 센서를 포함할 수 있으며, 이외에 체온 센서 (body temperature), ECG(electrocardiogram) 센서, EDA(electrodermal activity) 센서, 또는/및 SWEAT 센서 를 더 포함할 수 있다. 이외에도 생체 센싱과 연관된 다른 센서를 더 포함할 수 있다. 일 실시예에 따른 생체 센서는 사용자의 생체 신호를 센싱하여 측정된 생체 신호 또는 사용자의 생체 신호를 센싱하여 측정된 생 체 신호 기반의 정보(예: 값 또는 수치)(예: 혈중 산소 포화도 수치, 체온 수치, 심전도, 흥분 상태 수치, 수화 도 또는/및 탈수도 수치)를 프로세서에 제공할 수 있다.일 실시예에 따른 터치 센서는 터치를 감지할 수 있다. 예를 들면, 터치 센서는 사용자의 신체 접촉 에 의한 터치를 감지할 수 있다. 일 실시예에 따른 터치 센서는 디스플레이에 포함되거나 별개의 구 성요소로 전자 장치에 포함될 수 있다. 일 실시예에 따른 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시예에 따르면, 오디오 모듈은, 마이크(미도시)을 통해 소리를 획득하거나, 정보를 소리로 변환하여 스피커(미도시)를 통해 출력할 수 있다. 일 실시예에 따른 통신 모듈은 외부 전자 장치(예: 도 1의 외부의 전자 장치)와 통신할 수 있다. 일 실시예에 따르면 통신 모듈은 프로세서의 제어에 기반하여 전자 장치에서 획득된 정보(또는 데 이터)를 외부 전자 장치로 전송하거나, 외부 전자 장치로부터의 정보(또는 데이터)를 수신할 수 있다. 예를 들면, 통신 모듈은 셀룰러 통신 모듈, UWB(ultra wide band) 통신 모듈, 블루투스(Bluetooth) 통신 모듈, 또는/및 WiFi(wireless fidelity) 통신 모듈을 포함할 수 있으며, 이 외에 외부의 전자 장치와 통신 가능한 다른 모듈을 더 포함할 수 있다. 일 실시예에 따른 프로세서는 모션 센서, 생체 센서, 터치 센서, 오디오 모듈(또는 오디오 센서), 통신 모듈, 메모리, 디스플레이, 및/또는 전력 관리 모듈과 전기적으로 연결 될 수 있다. 일 실시예에 따른 프로세서는 모션 센서로부터 모션 센싱 정보를 획득할 수 있다. 모션 센서는 항상 온된 상태이거나, 지정된 설정 정보에 의해 온되거나, 사용자 입력에 의해 온된 상태일 수 있다. 모션 센 싱 정보는 가속도 센서에 의해 센싱된 가속도 정보, 자이로 센서에 의해 센싱된 회전 방향 또는 회전각 정보, 지자기 센서에 의해 센싱된 지자기 센싱 정보를 포함할 수 있다. 예를 들면, 가속도 정보는 전자 장치 또 는 전자 장치를 착용한 사용자의 신체의 움직임 시 가속도 센서에 의해 센싱된 가속도 값을 포함할 수 있 다. 회전 방향 또는 회전각 정보는 전자 장치 또는 전자 장치를 착용한 사용자의 신체의 움직임 시 자이로 센서에 의해 센싱된 전자 장치의 회전 방향 또는 회전각 값을 포함할 수 있다. 지자기 센싱 정보는 지자기의 방향을 포함할 수 있다. 일 실시예에 따른 프로세서는 상기 획득된 모션 센싱 정보를 기반으로 양치질 시작을 식별(또는 양치질 핸 드 모션을 감지)할 수 있다. 일 실시예에 따른 프로세서는 미리 저장된 적어도 하나의 양치질 핸드 모션 정보(또는 적어도 하나의 양치질 핸드 모션 패턴)(예: 제1 양치질 핸드 모션 정보(또는 패턴) 및/또는 제2 양치 질 핸드 모션 정보(또는 패턴))를 이용하여 상기 획득된 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되 는지 및/또는 제2 양치질 핸드 모션 패턴에 대응되는지 식별할 수 있다. 예를 들면, 프로세서는 머신 러닝 기반의 분류기 모델을 이용한 학습에 의해 미리 획득된 양치질 핸드 모션 유형 정보를 이용하여 상기 획득된 모 션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되는지 및/또는 제2 양치질 핸드 모션 패턴에 대응되는지 식 별할 수 있다. 일 실시예에 따른 프로세서는 상기 획득된 모션 센싱 정보가 제1 양치질 핸드 모션 패턴 및/또는 제2 양치 질 핸드 모션 패턴에 대응되는 경우 양치질이 시작된 것을 식별(또는 양치질 핸드 모션을 감지)할 수 있다. 예 를 들면, 제1 양치질 핸드 모션 패턴은 제1 방향(수평 방향)의 양치질 패턴(또는 치아를 좌우로 양치질하는 패 턴)을 포함할 수 있다. 제2 양치질 핸드 모션 패턴은 제2 방향(수직 방향)의 양치질 패턴(또는 치아를 상하로 양치질 하는 패턴)을 포함할 수 있다. 일 실시예에 따르면 제1 양치질 핸드 모션 패턴 및/또는 제2 양치질 핸드 모션 패턴은 머신 러닝 기법에 의해 미리 학습된(pre-training) 분류기 모델(classifier model)에 의해 획득될 수 있다. 일 실시예에 따른 프로세서는 양치질 시작 식별(또는 양치질 핸드 모션 감지)에 응답하여 오디오 모듈 을 온하고(예: 오디오 센서를 온시키고) 오디오 모듈로부터 오디오 신호를 획득할 수 있다. 일 실시 예에 따른 프로세서는 양치질 시작 식별 후, 모션 센서로부터 모션 센싱 정보를 획득하면서 오디오 모듈로부터 오디오 신호를 획득할 수 있다. 일 실시예에 따른 프로세서는 양치질 시작 식별(또는 양치질 핸드 모션 감지) 후, 획득된 제1 모션 센싱 정보 및 제1 모션 센싱 정보에 대응된(또는 제1 모션 센싱 정보와 동시에 획득된) 제1 오디오 신호를 기반으로 제1 모션 센싱 정보 및 제1 오디오 신호에 대응된 양치질 핸드 모션을 식별할 수 있다. 예를 들면, 양치질 핸드 모션 유형은 제1 양치질 핸드 모션 및/또는 제2 양치질 핸드 모션을 포함할 수 있다. 제1 양치질 핸드 모션은 제1 방향(수평 방향)의 양치질(또는 치아를 좌우로 양치질)에 대응된 모션일 수 있다. 제2 양치질 핸드 모션은제2 방향(수직 방향)의 양치질(또는 치아를 상하로 양치질)을 포함할 수 있다. 예를 들면, 양치질 핸드 모션 유 형은 제3 양치질 핸드 모션으로서 원을 그리는 형태의 양치질(또는 치아에 원을 그리는 형태의 양치질)을 더 포 함하거나, 상기 예들 외에 다른 방식의 양치질 핸드 모션을 더 포함할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되고, 제1 모션 센 싱 정보에 대응된 제1 오디오 신호가 제1 양치질 핸드 모션 패턴과 연관된 제1 양치질 소리 패턴(예: 제1 오디 오 신호 패턴)에 대응되는지 식별할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되고, 제1 오디오 신호가 제1 양치질 핸드 모션 패턴과 연관된 제1 양치질 소리 패턴(예: 제1 오디오 신호 패턴)에 대응되면 제1 모션 센싱 정보 및 제1 오디오 신호가 제1 양치질 핸드 모션에 대응되는 것으로 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되나, 제1 오디오 신호가 제1 양치질 핸드 모션 패턴과 연관된 제1 양치질 소리 패턴(예: 제1 오디오 신호 패턴)에 대응되지 않는 경우 제1 모션 센싱 정보를 무시하거나, 제1 모션 센싱 정보 및 제1 오 디오 신호가 제1 양치질 핸드 모션에 대응되지 않는 것으로 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제2 양치질 핸드 모션 패턴에 대응되는 경우, 제1 모 션 센싱 정보에 대응된 제1 오디오 신호가 제2 양치질 핸드 모션 패턴과 연관된 제2 양치질 소리 패턴(예: 제2 오디오 신호 패턴)에 대응되는지 식별할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제2 양치 질 핸드 모션 패턴에 대응되고, 제1 오디오 신호가 제2 양치질 핸드 모션 패턴과 연관된 제2 양치질 소리 패턴 (예: 제2 오디오 신호 패턴)에 대응되는 경우 제1 모션 센싱 정보 및 제1 오디오 신호가 제2 양치질 핸드 모션 에 대응되는 것으로 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제2 양치질 핸드 모션 패턴에 대응되나, 제1 오디오 신호가 제2 양치질 핸드 모션 패턴과 연관된 제2 양치질 소 리 패턴(예: 제2 오디오 신호 패턴)에 대응되지 않는 경우 제1 모션 센싱 정보를 무시하거나, 제2 양치질 핸드 모션이 발생하지 않은 것으로 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보 및 제1 오디오 신호 이후에 획득되는 제2 모션 센싱 정 보 및 제2 오디오 신호가 존재하는 경우 제1 모션 센싱 정보 및 제1 오디오 신호의 처리 방식과 유사한 방식으 로 제2 모션 센싱 정보 및 제2 오디오 신호에 대응된 양치질 핸드 모션을 식별할 수 있다. 또한 제2 모션 센싱 정보 및 제2 오디오 신호 이후의 제3 모션 센싱 정보 및 제3 오디오 신호가 존재하는 경우 제3 모션 센싱 정보 및 제3 오디오 신호에 대응된 양치질 핸드 모션을 식별할 수 있다. 일 실시예에 따른 프로세서는 모션 센 싱 정보 및 오디오 신호가 지정된 시간 기간 동안 감지되지 않는 경우 양치질이 종료된 것으로 판단(확인 또는 식별)하고, 양치질 핸드 모션 식별 동작을 종료할 수 있다. 다른 실시예에 따르면, 프로세서는 모션 센싱 정보 및 오디오 신호가 지속적으로 감지되더라도, 상기 모션 센싱 정보 및 오디오 신호가 사용자의 다른 행동 패턴(예: 사용자의 보행)과 연관되는 경우 양치질이 종료된 것으로 판단(확인 또는 식별)하고, 양치질 핸드 모 션 식별 동작을 종료할 수 있다. 일 실시예에 따른 프로세서는 양치질 시작부터 양치질 종료까지의 양치질과 연관된 정보를 획득 및 저장할 수 있다. 예를 들면, 프로세서는 양치질 시작부터 양치질 종료까지의 양치질 시간, 양치질 시간 동안의 양 치질 핸드 모션 패턴(예: 제1 양치질 핸드 모션-> 제2 양치질 핸드 모션-> 제1 양치질 핸드 모션 또는 제2 양치 질 핸드 모션-> 제1 양치질 핸드 모션-> 제2 양치질 핸드 모션), 양치질 시간 동안의 제1 및/또는 제2 양치질 핸드 모션 횟수, 및/또는 미리 정해진 권장 양치질 기준에 기반한 양치질 스코어(score)를 저장할 수 있다. 이 외에 양치질과 연관된 다른 정보를 더 획득 및 저장할 수 있다. 일 실시예에 따른 프로세서는 양치질 시작부터 양치질 종료까지의 양치질과 연관된 정보를 디스플레이 를 통해 표시할 수 있고, 양치질과 연관된 정보를 기반으로 양치질과 연관된 가이드(또는 알림)을 더 제공 할 수 있다. 예를 들면, 양치질과 연관된 가이드(또는 알림)은 권장 양치질 시간의 미달(또는 초과)를 알리는 메시지, 권장 제1 양치질 모션 횟수 및/또는 권장 제2 양치질 모션 횟수의 미달(또는 초과)를 알리는 메시지, 및/또는 권장 양치질 기준의 미달(또는 초과)를 알리는 메시지를 포함할 수 있다. 일 실시예에 따른 프로세서 는 복수의 양치질이 수행된 경우 복수의 양치질 히스토리에 기반한 양치질 이력 정보를 제공할 수도 있다. 일 실시예에 따른 프로세서는 양치질 시작부터 양치질 종료까지의 양치질과 연관된 정보, 양치질과 연관된 가이드(또는 알림) 및/또는 양치질 이력 정보를 통신 모듈을 통해 외부의 전자 장치에 전송할 수 있 다. 예를 들면, 외부의 전자 장치는 사용자의 전자 장치과 연동되는 다른 전자 장치(예: 스마트폰 또 는 타 웨어러블 전자 장치)이거나, 사용자의 가족의 다른 전자 장치이거나, 사용자와 연계된 치과 병원의 서버 장치일 수 있으며, 외부의 전자 장치는 이 외에 다른 유형의 전자 장치일 수도 있다.일 실시예에 따른 메모리(예: 도 1의 메모리)는 전자 장치의 적어도 하나의 구성요소(예: 프로 세서 또는 다른 구성요소)에 의해 사용되는 다양한 제어 데이터 또는 획득된 정보를 저장할 수 있다. 일 실시예에 따르면 메모리는 전자 장치의 프로세서의 동작을 수행하기 위한 인스트럭션들을 저장 할 수 있다. 다양한 실시예에 따르면 메모리는 ROM(read only memory), RAM(random access memory), 또는 플래시 메모리와 같은 다양한 형태로 구현될 수 있으며, 구현 형태에는 제한이 없을 수 있다. 일 실시예에 따른 디스플레이는 프로세서의 제어에 기반하여 데이터 또는 화면을 표시할 수 있다. 예 를 들면, 디스플레이는 프로세서의 제어에 기반하여 양치질 시작부터 양치질 종료까지의 양치질과 연 관된 정보, 양치질과 연관된 가이드 또는 알림 및/또는 양치질 이력 정보 중 적어도 일부를 표시하는 화면을 표 시할 수 있다. 일 실시예에 따른 전력 관리 모듈은 배터리와 연결될 수 있으며, 외부로부터 수신된 전력을 이용하여 배터리를 충전할 수 있고, 배터리로부터의 전력이 전자 장치의 각 구성요소에서 이용될 수 있도 록 제어할 수 있다. 다양한 실시예에 따른 웨어러블 전자 장치(예: 도 1의 전자 장치, 또는 도 2의 전자 장치)는 모션 센 서(예: 도 1의 센서 모듈 또는 도 2의 모션 센서), 오디오 센서(예: 도 1의 입력 모듈, 또는 도 2의 오디오 모듈), 디스플레이(예: 도 1의 디스플레이 모듈, 또는 도 2의 디스플레이), 메모리 (예: 도 1의 메모리 또는 도 2의 메모리), 및 상기 모션 센서, 상기 오디오 센서, 상기 메모리와 전 기적으로 연결된 프로세서(예: 도 1의 프로세서 또는 도 2의 프로세서)를 포함하고, 상기 프로세서는, 상기 모션 센서를 통해 모션 센싱 정보를 획득하고, 상기 오디오 센서를 통해 상기 모션 센싱 정보 에 대응된 오디오 신호를 획득하고, 상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하고, 상기 양 치질 핸드 모션 유형에 대응된 오디오 신호 패턴을 식별하고, 상기 양치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센싱 정보 및 상기 오디오 신호에 대응된 양치질 핸드 모션을 식별하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 양치질 핸드 모션 유형은 제1 양치질 핸드 모션 유형 및 제2 양치질 핸드 모션 유형을 포함하고, 상기 프로세서는, 상기 양치질 핸드 모션 유형이 상기 제1 양치질 핸드 모션 유형인 경우 상 기 제1 양치질 핸드 모션 유형에 대응된 제1 오디오 신호 패턴을 식별하고, 상기 양치질 핸드 모션 유형이 상기 제2 양치질 핸드 모션 유형인 경우 상기 제2 양치질 핸드 모션 유형에 대응된 제2 오디오 신호 패턴을 식별하도 록 설정될 수 있다. 다양한 실시예에 따르면, 상기 제1 양치질 핸드 모션 유형은 수평 방향의 양치질 핸드 모션 유형을 포함하고, 상기 제2 양치질 핸드 모션 유형은 수직 방향의 양치질 핸드 모션 유형을 포함할 수 있다. 다양한 실시예에 따르면, 상기 모션 센서는 가속도 센서, 자이로 센서, 지자기 센서를 포함하고, 상기 모션 센 싱 정보는 상기 가속도 센서에 의해 센싱된 가속도 값, 상기 자이로 센서에 의해 센싱된 상기 전자 장치의 회전 방향 또는 회전각 값, 상기 지자기 센서에 의해 센싱된 지자기 방향 정보를 기반으로 획득된 핸드 자세 정보, 핸드 모션에 대한 주파수 특성 정보, 핸드 모션의 크기 및 방향 정보 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 모션 센싱 정보를 기반으로 지정된 주기적인 움직임 패턴을 식 별하고, 상기 지정된 주기적인 움직임 패턴이 식별된 경우 양치질 시작을 식별하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 웨어러블 전자 장치는 터치 센서를 더 포함하고, 상기 프로세서는, 상기 양치질 시작이 식별되면 상기 터치 센서로부터 획득된 터치 센싱 정보를 기반으로 상기 모션 센서의 센싱 축을 보정하 도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 모션 센싱 정보 및/또는 상기 오디오 신호가 지정된 시간 동안 획득되지 않으면 양치질 종료를 식별하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 양치질 종료 식별에 기반하여, 상기 양치질 시작부터 상기 양 치질 종료까지 양치질과 연관된 정보를 상기 디스플레이에 표시하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 웨어러블 전자 장치는 통신 모듈을 더 포함하고, 상기 프로세서는, 상기 통신 모 듈을 통해 상기 양치질과 연관된 정보를 외부 전자 장치로 전송하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 머신 러닝 기반의 분류기 모델을 이용한 학습에 의해 미리 획득된 양 치질 핸드 모션 유형 정보와 상기 모션 센싱 정보로부터 추출된 특징 정보를 비교하여 상기 양치질 핸드 모션유형을 식별하도록 설정될 수 있다. 도 3a는 일 실시예에 따른 제1 웨어러블 전자 장치의 예를 나타낸 도면이고, 도 3b는 일 실시예에 따른 제2 웨 어러블 전자 장치의 예를 나타낸 도면이다. 도 3a 및 도 3b를 참조하면, 일 실시예에 따른 웨어러블 전자 장치는 제1 웨어러블 전자 장치 또는 제2 웨어러블 전자 장치를 포함할 수 있다. 예를 들면, 제1 웨어러블 전자 장치는 사용자의 손목에 착용되는 스마트 워치 형태일 수 있고, 제2 웨어러블 전자 장치는 사용자의 손가락에 착용되는 링 형태일 수 있다. 이외에 웨어러블 전자 장치는 사용자의 핸드 모션 감지가 용이한 위치(예: 손목 또는 손가락 이 외 다른 신체 부위)에 착용되거나 삽입 또는 부착될 수 있는 다른 형태일 수도 있다. 예를 들면, 웨어러블 전자 장치는 장갑형 전자 장치, 문신형 전자 장치, 신체 삽입형 전자 장치를 포함할 수 있다. 일 실시예에 따르 면 제1 웨어러블 전자 장치 또는 제2 웨어러블 전자 장치의 외형은 상기 도 3a 및 3b에 도시된 디자 인(또는 외형)과 다른 디자인으로 구현될 수 있음은 자명하다. 도 4는 일 실시예에 따른 제2 웨어러블 전자 장치의 내부 구성 예를 나타낸 도면이다. 도 4를 참조하면, 일 실시예에 따른 제2 웨어러블 전자 장치는 모션 센서, 생체 센서, 터치 센 서, 오디오 모듈, 통신 모듈, 프로세서, 메모리, 전력 관리 모듈, 및 배터리 를 포함할 수 있다. 일 실시예에 따른 제2 웨어러블 전자 장치는 적어도 하나의 FPCB(flexible printed circuit board)을 포함할 수 있으며, 적어도 하나의 FPCB상에 모션 센서, 생체 센서, 터치 센서, 오디오 모듈, 통신 모듈, 프로세서, 메모리, 전력 관리 모듈, 및 배터리 중 적어도 일부 또는 전부가 배치될 수 있다. 일 실시예에 따르면, 모션 센서, 생체 센서 , 터치 센서, 오디오 모듈, 통신 모듈, 프로세서, 메모리, 전력 관리 모듈 , 및 배터리의 동작은 도 2의 전자 장치의 모션 센서, 생체 센서, 터치 센서, 오디오 모듈, 통신 모듈, 프로세서, 메모리, 전력 관리 모듈, 및 배터리와 동 일한 동작을 수행할 수 있다. 일 실시예에 따른 제2 웨어러블 전자 장치 내의 모션 센서, 생체 센서 , 터치 센서, 오디오 모듈, 통신 모듈, 프로세서, 메모리, 전력 관리 모듈 , 및 배터리의 적어도 일부의 배치 위치는 다른 위치일 수도 있다. 도 5는 일 실시예에 따른 웨어러블 전자 장치에서 양치질 정보 제공 동작을 나타낸 흐름도이다. 도 5를 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 도 2의 웨어러블 전자 장치, 도 3a의 제1 웨어러블 전자 장치, 도 3b의 제2 웨어러블 전자 장치)의 프로세서(예: 도 1의 프로세서 , 도 2의 프로세서, 또는 도 4의 프로세서, 이하 도 2의 프로세서를 예를 들어 설명함)는 510 내지 580 동작 중 적어도 하나의 동작을 수행할 수 있다. 510 동작에서, 일 실시예에 따른 프로세서는 모션 센서로부터 획득되는 모션 센싱 정보를 기반으로 양치질 시작(또는 양치질 세션 시작)을 식별(또는 양치질 핸드 모션을 감지)할 수 있다. 일 실시예에 따른 모션 센서는 항상 활성화된 상태이거나, 지정된 설정 정보에 의해 활성화되거나, 사용자 입력에 의해 활성화될 수 있으며, 활성화된 상태에서 모션 센싱 동작을 수행하여 모션 센싱 정보를 프로세서에 제공할 수 있다. 예를 들면, 모션 센서는 프로세서에 의한 구동 신호(예: 클럭)에 의해 웨이크 업(예: 저전력 구동) (활성화된 상태가)될 수 있으며, 웨이크업 상태에서 모션 센싱(모니터링) 동작을 수행할 수 있다. 일 실시예에 따르면 모션 센싱 정보는 가속도 센서에 의해 센싱된 가속도 정보, 자이로 센서에 의해 센싱된 회전 방향 또는 회전각 정보, 지자기 센서에 의해 센싱된 지자기 센싱 정보를 포함할 수 있다. 예를 들면, 가속도 정보는 전자 장치 또는 전자 장치를 착용한 사용자의 신체의 움직임 시 가속도 센서에 의해 센싱된 가속도 값을 포함할 수 있다. 회전 방향 또는 회전각 정보는 전자 장치 또는 전자 장치를 착용한 사용자의 신체의 움직임 시 자이로 센서에 의해 센싱된 전자 장치의 회전 방향 또는 회전각 값을 포함할 수 있다. 지자기 센싱 정보는 지자기의 방향을 포함할 수 있다. 예를 들면, 프로세서는 가속도 센서에 의해 센싱된 가속도 값, 자이로 센서에 의해 센싱된 전자 장치의 회전 방향 또는 회전각 값, 지자기 센서에 의해 센싱된 지자 기의 방향 정보를 통해 양치질 시의 핸드 자세, 핸드 모션에 대한 주파수 특성, 핸드 모션의 크기 및 방향 정보 를 획득(또는 추출)할 수 있다. 일 실시예에 따른 프로세서는 상기 획득된 양치질 시의 핸드 자세, 핸드 모션에 대한 주파수 특성, 핸드 모션의 크기 및 방향 정보를 기반으로 양치질 시작(또는 양치질 세션 시작)을 식별(또는 양치질 핸드 모션을 감지)할 수 있다. 예를 들면, 프로세서는 미리 저장된 적어도 하나의 양치질 핸드 모션 정보(또는 적어도 하나의 양치질 핸 드 모션 패턴)(예: 제1 양치질 핸드 모션 정보(또는 패턴) 및/또는 제2 양치질 핸드 모션 정보(또는 패턴))를 이용하여 상기 획득된 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되는지 및/또는 제2 양치질 핸드 모 션 패턴에 대응되는지 식별할 수 있다. 일 실시예에 따른 프로세서는 상기 획득된 모션 센싱 정보가 제1 양치질 핸드 모션 패턴 및/또는 제2 양치질 핸드 모션 패턴에 대응되는 경우 양치질이 시작된 것을 식별(또는 양치질 핸드 모션을 감지)할 수 있다. 예를 들면, 제1 양치질 핸드 모션 패턴은 제1 방향(수평 방향)의 양치질 패턴(또는 치아를 좌우로 양치질하는 패턴)을 포함할 수 있다. 제2 양치질 핸드 모션 패턴은 제2 방향(수직 방 향)의 양치질 패턴(또는 치아를 상하로 양치질 하는 패턴)을 포함할 수 있다. 일 실시예에 따르면 제1 양치질 핸드 모션 패턴 및/또는 제2 양치질 핸드 모션 패턴은 머신 러닝 기법에 의해 미리 학습된(pre-training) 분류 모델(classifier model)에 의해 획득될 수 있다. 520 동작에서, 일 실시예에 따른 프로세서는 양치질 시작 식별(또는 양치질 핸드 모션 감지)에 응답하여 모션 센서로부터 제1 모션 센싱 정보를 획득하고, 오디오 모듈로부터 제1 모션 센싱 정보에 대응된 제1 오디오 신호를 획득할 수 있다. 일 실시예에 따르면, 프로세서는 양치질 시작 식별(또는 양치질 핸드 모션 감지)에 응답하여 오디오 모듈을 온 상태(예: 오디오 센서가 온 상태)가 되도록 제어할 수 있다. 530 동작에서, 일 실시예에 따른 프로세서는 제1 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별 할 수 있다. 예를 들면, 양치질 핸드 모션 유형은 제1 양치질 핸드 모션 및/또는 제2 양치질 핸드 모션을 포함 할 수 있다. 제1 양치질 핸드 모션은 제1 방향(수평 방향)의 양치질(또는 치아를 좌우로 양치질)에 대응된 모션 일 수 있다. 제2 양치질 핸드 모션은 제2 방향(수직 방향)의 양치질(또는 치아를 상하로 양치질)을 포함할 수 있다. 예를 들면, 양치질 핸드 모션 유형은 제3 양치질 핸드 모션으로서 원을 그리는 형태의 양치질(또는 치아 에 원을 그리는 형태의 양치질)을 더 포함하거나, 상기 예들 외에 다른 방식의 양치질 핸드 모션을 더 포함할 수 있다. 예를 들면, 프로세서는 미리 저장된 적어도 하나의 양치질 핸드 모션 정보(또는 적어도 하나의 양치질 핸 드 모션 패턴)(예: 제1 양치질 핸드 모션 정보(또는 패턴) 및/또는 제2 양치질 핸드 모션 정보(또는 패턴))를 이용하여 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되는지 또는 제2 양치질 핸드 모션 패턴에 대 응되는지 식별할 수 있다. 일 실시예에 따른 프로세서는 상기 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되는 경우 제1 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 제1 양치질 핸드 모션으로 결정 (확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 상기 제1 모션 센싱 정보가 제2 양치질 핸드 모션 패턴에 대응되는 경우 제1 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 제2 양치질 핸드 모션으로 결정(확인 또는 식별)할 수 있다. 540 동작에서, 일 실시예에 따른 프로세서는 양치질 핸드 모션 유형에 대응된 오디오 신호 패턴 유형을 식 별할 수 있다. 예를 들면, 제1 양치질 핸드 모션에 대응된 오디오 신호 패턴은 제1 오디오 신호 패턴을 포함할 수 있고, 제2 양치질 핸드 모션에 대응된 오디오 신호 패턴은 제2 오디오 신호 패턴을 포함할 수 있다. 일 실시 예에 따른 프로세서는 양치질 핸드 모션 유형이 제1 양치질 핸드 모션인 경우 제1 오디오 신호 패턴 유형 을 식별할 수 있고, 양치질 핸드 모션 유형이 제2 양치질 핸드 모션인 경우 제2 오디오 신호 패턴 유형을 식별 할 수 있다. 예를 들면, 제1 오디오 신호 패턴 유형 및/또는 제2 오디오 신호 패턴 유형은 머신 러닝 기법을 통 해 오디오 신호 패턴 분석 모델을 학습시켜 모델링하고, 오디오 신호 패턴 분석 모델을 통해 획득된 유형일 수 있다. 550 동작에서, 일 실시예에 따른 프로세서는 양치질 핸드 모션 유형과 오디오 신호 패턴 유형을 기반으로 제1 모션 센싱 정보 및 제1 오디오 신호에 대응된 양치질 핸드 모션을 식별할 수 있다. 예를 들면, 프로세서는 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되고, 제1 모션 센싱 정보 에 대응된 제1 오디오 신호가 제1 양치질 핸드 모션 패턴과 연관된 제1 오디오 신호 패턴에 대응되는지 식별할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되고, 제1 오디 오 신호가 제1 양치질 핸드 모션 패턴과 연관된 제1 오디오 신호 패턴에 대응되면 제1 모션 센싱 정보 및 제1 오디오 신호가 제1 양치질 핸드 모션에 대응되는 것으로 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프 로세서는 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되나, 제1 오디오 신호가 제1 오디오 신 호 패턴에 대응되지 않는 경우 제1 모션 센싱 정보를 무시하거나, 제1 모션 센싱 정보 및 제1 오디오 신호가 제 1 양치질 핸드 모션에 대응되지 않는 것으로 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제2 양치질 핸드 모션 패턴에 대응되는 경우, 제1 모 션 센싱 정보에 대응된 제1 오디오 신호가 제2 양치질 핸드 모션 패턴과 연관된 제2 오디오 신호 패턴에 대응되는지 식별할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제2 양치질 핸드 모션 패턴에 대응되 고, 제1 오디오 신호가 제2 오디오 신호 패턴에 대응되는 경우 제1 모션 센싱 정보 및 제1 오디오 신호가 제2 양치질 핸드 모션에 대응되는 것으로 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보가 제2 양치질 핸드 모션 패턴에 대응되나, 제1 오디오 신호가 제2 오디오 신호 패턴에 대응되지 않는 경우 제1 모션 센싱 정보를 무시하거나, 제2 양치질 핸드 모션이 발생하지 않은 것으로 판단(확인 또는 식 별)할 수 있다. 560 동작에서, 일 실시예에 따른 프로세서는 양치질 종료를 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 제1 모션 센싱 정보 및 제1 오디오 신호 이후 지정된 시간 기간 내에 모션 센싱 정보 및 오디오 신호가 획득되지 않으면, 또는 양치질과 관련한 오디오 신호가 획득되지 않고 사용자의 보행과 같은 이 동 상황이 인식되면, 양치질이 종료된 것으로 판단(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서 는 제1 모션 센싱 정보 및 제1 오디오 신호 이후 지정된 시간 기간 내에 다음 모션 센싱 정보 및 오디오 신호가 획득되면, 양치질이 종료되지 않은 것으로 판단(확인 또는 식별)할 수 있다. 570 동작에서, 일 실시예에 따른 프로세서는 양치질이 종료되지 않은 경우 다음 모션 센싱 정보 및 오디오 신호에 대한 양치질 핸드 모션 식별 동작을 수행하고, 560 동작으로 되돌아갈 수 있다. 예를 들면, 프로세서 는 제1 모션 센싱 정보 및 제1 오디오 신호 이후(또는 다음)의 제2 모션 센싱 정보 및 제2 오디오 신호가 존재하는 경우 제1 모션 센싱 정보 및 제1 오디오 신호의 처리 방식과 유사한 방식(예: 520 내지 550 동작과 유 사한 방식)으로 제2 모션 센싱 정보 및 제2 오디오 신호에 대응된 양치질 핸드 모션을 식별할 수 있다. 또한 프 로세서는 제2 모션 센싱 정보 및 제2 오디오 신호 이후(또는 다음)의 제3 모션 센싱 정보 및 제3 오디오 신호가 존재하는 경우 제3 모션 센싱 정보 및 제3 오디오 신호에 대응된 양치질 핸드 모션을 식별할 수 있다. 일 실시예에 따른 프로세서는 모션 센싱 정보 및 오디오 신호가 지정된 시간 기간 동안 감지되지 않을 때 까지 지속되는 모션 센싱 정보 및 오디오 신호에 대해 양치질 핸드 모션을 식별할 수 있다. 580 동작에서, 일 실시예에 따른 프로세서는 양치질이 종료된 경우 양치질 시작부터 양치질 종료까지의 양 치질과 연관된 정보를 디스플레이에 표시할 수 있다. 예를 들면, 양치질 시작부터 양치질 종료까지의 양치 질과 연관된 정보는 양치질 시작부터 양치질 종료까지의 양치질 시간, 양치질 시간 동안의 양치질 핸드 모션 이 력(예: 제1 양치질 핸드 모션-> 제2 양치질 핸드 모션-> 제1 양치질 핸드 모션 또는 제2 양치질 핸드 모션-> 제 1 양치질 핸드 모션-> 제2 양치질 핸드 모션), 양치질 시간 동안의 제1 및/또는 제2 양치질 핸드 모션 횟수, 및 /또는 미리 정해진 권장 양치질 기준에 기반한 양치질 스코어(score)를 포함할 수 있으며, 이 외에 양치질과 연 관된 다른 정보를 더 표시할 수 있다. 일 실시예에 따른 프로세서는 580 동작의 양치질 종료 전까지 510 내지 570 동작과 연관된 정보를 디스플레이에 표시하거나 양치질 시작부터 양치질 종료 전까지 양치질과 연관된 정보 중 적어도 일부를 표시할 수도 있다. 일 실시예에 따른 프로세서는 양치질과 연관된 정보를 기반으로 양치질과 연관된 가이드 또는 알림을 더 표시할 수 있다. 예를 들면, 양치질과 연관된 가이드 또는 알 림은 권장 양치질 시간의 미달 또는 초과를 알리는 메시지, 권장 제1 및/또는 제2 양치질 모션 횟수의 미달 또 는 초과를 알리는 메시지, 및/또는 권장 양치질 기준의 미달 또는 초과를 알리는 메시지를 포함할 수 있다. 일 실시예에 따른 프로세서는 복수의 양치질이 수행된 경우 복수의 양치질 이력에 기반한 양치질 이력 정보를 표시할 수도 있다. 일 실시예에 따른 프로세서는 양치질 시작부터 양치질 종료까지의 양치질과 연관된 정 보, 양치질과 연관된 가이드 또는 알림 및/또는 양치질 이력 정보를 통신 모듈을 통해 외부의 전자 장치 에 전송할 수 있다. 예를 들면, 외부의 전자 장치는 사용자의 전자 장치과 연동되는 다른 전자 장치(예: 스마트폰 또는 타 웨어러블 전자 장치)이거나, 사용자의 가족의 다른 전자 장치이거나, 사용자와 연계 된 치과 병원의 서버 장치일 수 있으며, 외부의 전자 장치는 이 외에 다른 유형의 전자 장치일 수도 있다. 다양한 실시예에 따르면, 웨어러블 전자 장치(예: 도 1의 전자 장치, 도 2의 웨어러블 전자 장치, 도 3a의 제1 웨어러블 전자 장치, 도 3b의 제2 웨어러블 전자 장치)에서 양치질 정보 제공 방법은 모션 센서(예: 도 1의 센서 모듈 또는 도 2의 모션 센서)를 통해 모션 센싱 정보를 획득하는 동작, 오디오 센서(예: 도 1의 입력 모듈, 또는 도 2의 오디오 모듈)를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득하는 동작, 상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하는 동작, 상기 양치질 핸 드 모션 유형에 대응하여 오디오 신호 패턴을 식별하는 동작, 및 상기 양치질 핸드 모션 유형과 상기 오디오 신 호 패턴을 기반으로 상기 모션 센싱 정보 및 상기 오디오 신호에 대응된 양치질 핸드 모션을 식별하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 양치질 핸드 모션 유형은 제1 양치질 핸드 모션 유형 및 제2 양치질 핸드 모션 유형을 포함하고, 상기 방법은 상기 양치질 핸드 모션 유형이 상기 제1 양치질 핸드 모션 유형인 경우 상기 제1양치질 핸드 모션 유형에 대응된 제1 오디오 신호 패턴을 식별하는 동작, 및 상기 양치질 핸드 모션 유형이 상 기 제2 양치질 핸드 모션 유형인 경우 상기 제2 양치질 핸드 모션 유형에 대응된 제2 오디오 신호 패턴을 식별 하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 제1 양치질 핸드 모션 유형은 수평 방향의 양치질 핸드 모션 유형을 포함하고, 상기 제2 양치질 핸드 모션 유형은 수직 방향의 양치질 핸드 모션 유형을 포함할 수 있다. 다양한 실시예에 따르면, 상기 모션 센서는 가속도 센서, 자이로 센서, 지자기 센서를 포함하고, 상기 모션 센 싱 정보는 상기 가속도 센서에 의해 센싱된 가속도 값, 상기 자이로 센서에 의해 센싱된 상기 전자 장치의 회전 방향 또는 회전각 값, 상기 지자기 센서에 의해 센싱된 지자기 방향 정보를 기반으로 획득된 핸드 자세 정보, 핸드 모션에 대한 주파수 특성 정보, 핸드 모션의 크기 및 방향 정보 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 모션 센싱 정보를 기반으로 지정된 주기적인 움직임 패턴을 식별하 는 동작, 및 상기 지정된 주기적인 움직임 패턴이 식별된 경우 양치질 시작을 식별하는 동작을 더 포함할 수 있 다. 다양한 실시예에 따르면, 상기 방법은 상기 양치질 시작이 식별되면 터치 센서로부터 획득된 터치 센싱 정보를 기반으로 상기 모션 센서의 센싱 축을 보정하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 모션 센싱 정보 및/또는 상기 오디오 신호가 지정된 시간 동안 획득되지 않으면 양치질 종료를 식별하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 양치질 종료 식별에 기반하여, 상기 양치질 시작부터 상기 양치질 종료까지 양치질과 연관된 정보를 디스플레이에 표시하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 통신 모듈을 통해 상기 양치질과 연관된 정보를 외부 전자 장치로 전송하 는 동작을 더 포함할 수 있다. 도 6은 일 실시예에 따른 양치질 시작부터 양치질 종료까지의 양치질 세션 예를 나타낸 도면이다. 도 6을 참조하면, 일 실시예에 따른 프로세서는 양치질 시작 판단(예: 세션 시작 판단)부터 양치질 종료 판단(예: 세션 종료 판단)까지를 양치질 세션으로 식별할 수 있으며, 양치질 시작부터 양치질 종료까지 모 션 센싱 정보와 오디오 센싱 정보를 분석할 수 있다. 일 실시예에 따른 프로세서는 양치질 세션 시작 식별 후, 제1 모션 센싱 정보 및 제1 오디오 신호에 의한 양치질 핸드 모션, 제2 모션 센싱 정보 및 제2 오디오 신호에 의한 양치질 핸드 모션, 제3 모션 센싱 정보 및 제3 오디오 신호에 의한 양치질 핸드 모션, 제4 모션 센싱 정보 및 제4 오디오 신호에 의한 양치질 핸드 모션, 및 제5 모션 센싱 정보 및 제5 오디오 신호에 의한 양치질 핸드 모션을 각각 식별할 수 있다. 일 실시예에 따르면, 프로세서는 제1 모션 센 싱 정보를 통해 제1 양치질 핸드 모션 유형(예: 수평 모션)을 식별하고, 제1 양치질 핸드 모션 유형에 대응된 제1 오디오 신호 패턴 유형을 식별하고, 제1 모션 센싱 정보 및 제1 오디오 신호가 제1 양치질 핸드 모션 유형과 제1 오디오 신호 패턴 유형에 대응되는 경우 제1 모션 센싱 정보 및 제1 오디오 신호가 제1 양치질 핸드 모션에 대응됨을 판단할 수 있다. 일 실시예에 따르면, 프로세서는 제2 모션 센싱 정보를 통해 제2 양치질 핸드 모션 유형(예: 수직 모션)을 식별하고, 제2 양치질 핸드 모션 유형에 대응된 제2 오디오 신호 패턴 유형을 식별하고, 제2 모션 센싱 정보 및 제2 오디오 신호가 제2 양치질 핸드 모션 유형과 제2 오디오 신 호 패턴 유형에 대응되는 경우 제2 모션 센싱 정보 및 제2 오디오 신호가 제2 양치질 핸드 모션에 대응됨 을 판단할 수 있다. 일 실시예에 따르면, 프로세서는 사용자의 양치질에 기반한 모션 센싱 정보 및 오디오 신호 패턴을 학습할 수 있다. 예를 들면, 프로세서는 사용자가 수평 방향으로 양치질하는 경우의 모션 센 싱 정보 및 오디오 신호 패턴, 사용자가 수직 방향으로 양치질하는 경우의 모션 센싱 정보 및 오디오 신호 패턴 을 학습할 수 있고, 학습에 기반하여 제1 양치질 핸드 모션 유형과 제1 오디오 신호 패턴 유형 및 제2 양치질 핸드 모션 유형과 제2 오디오 신호 패턴 유형을 획득 및 저장 후 이용할 수 있다. 일 실시예에 따르면, 프로세 서는 치아의 각 부분별(예: 윗니, 아랫니, 어금니, 앞니, 또는 다른 부분)로 수직 방향으로 양치질하는 경 우와 수평 방향으로 양치질 하는 경우 각각의 모션 센싱 정보 및 오디오 신호 패턴을 학습할 수도 있다. 예를 들면, 프로세서는 윗니를 수직 방향으로 양치질 하는 경우, 아랫니를 수직 방향으로 양치질 하는 경우, 어 금니를 수직 방향으로 양치질 하는 경우, 앞니를 수직 방향으로 양치질 하는 경우, 또는 다른 부분을 수직 방향 으로 양치질 하는 경우 각각에 대한 모션 센싱 정보 및 오디오 신호 패턴을 학습하고, 학습에 기반하여 윗니, 아랫니, 어금니, 앞니, 또는 다른 부분 각각에 대응된 제1 양치질 핸드 모션 유형과 제1 오디오 신호 패턴 유형 을 획득(또는 저장)하여 이용할 수 있다. 예를 들면, 프로세서는 윗니를 수평 방향으로 양치질 하는 경우,아랫니를 수평 방향으로 양치질 하는 경우, 어금니를 수평 방향으로 양치질 하는 경우, 앞니를 수평 방향으로 양치질 하는 경우, 또는 다른 부분을 수평 방향으로 양치질 하는 경우 각각에 대한 모션 센싱 정보 및 오디오 신호 패턴을 학습하고, 학습에 기반하여 윗니, 아랫니, 어금니, 앞니, 또는 다른 부분 각각에 대응된 제2 양치 질 핸드 모션 유형과 제2 오디오 신호 패턴 유형을 획득(또는 저장)하여 이용할 수 있다. 일 실시예에 따르면, 프로세서는 사용자의 현재 양치질 동작(또는 모션)에 대응되는 양치질 핸드 모션 유 형과 오디오 신호 패턴 유형을 식별하고, 식별된 양치질 핸드 모션 유형과 오디오 신호 패턴 유형에 따라 사용 자의 양치질 동작과 연관된 정보(또는 사용가 치아의 어느 부분(예: 윗니, 아랫니, 어금니, 앞니, 또는 다른 부 분)을 얼만큼 양치질 했는지를 나타내는 정보)를 획득할 수 있다. 일 실시예에 따르면, 프로세서는 사용자가 치아의 어느 부분(예: 윗니, 아랫니, 어금니, 앞니, 또는 다른 부분)을 얼만큼 양치질 했는지를 나타내는 정보를 포함하는 사용자 인터페이스(user interface)(예: 화면)을 디 스플레이에 표시할 수 있다. 일 실시예에 따르면, 프로세서는 사용자가 치아의 어느 부분(예: 윗니, 아랫니, 어금니, 앞니, 또는 다른 부분)을 얼만큼 양치질 했는지를 나타내는 정보를 통신 모듈을 통해 외 부 전자 장치(서버 또는 기 등록된 다른 사용자의 전자 장치)로 전송할 수도 있다. 예를 들면, 전자 장치 의 사용자가 아동(예: 지정된 나이 미만의 사용자)인 경우, 사용자가 치아의 어느 부분(예: 윗니, 아랫니, 어금 니, 앞니, 또는 다른 부분)을 얼만큼 양치질 했는지를 나타내는 정보를 사용자의 보호자(예: 부모)의 전자 장치 에 전송할 수 있다. 일 실시예에 따른 프로세서는 제5 모션 센싱 정보 및 제5 오디오 신호 이후 일정 기간 동안 모션 센 싱 정보 및 오디오 신호가 획득되지 않거나 모션 센싱 정보 및 오디오 신호가 지속적으로 감지되더라도, 모션 센싱 정보 및 오디오 신호가 양치질이 아닌 사용자의 다른 행동 패턴(예: 사용자의 보행)과 연관되는 경우 양치 질이 종료된 것으로 판단할 수 있다. 일 실시예에 따른 프로세서는 양치질이 종료된 것으로 판단된 경우 양치질과 연관된 정보를 출력할 수 있다. 도 7은 일 실시예에 따른 웨어러블 전자 장치에서 양치질 핸드 모션 유형 식별 동작을 나타낸 흐름도이다. 도 7을 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 도 2의 웨어러블 전자 장치, 도 3a의 제1 웨어러블 전자 장치, 도 3b의 제2 웨어러블 전자 장치)의 프로세서(예: 도 1의 프로세서 , 도 2의 프로세서, 또는 도 4의 프로세서, 이하 도 2의 프로세서를 예를 들어 설명함)는 710 내지 750 동작 중 적어도 하나의 동작을 수행할 수 있다. 710 동작에서, 일 실시예에 따른 프로세서는 모션 센서로부터 모션 센싱 정보와 터치 센서로부 터 터치 센싱 정보를 획득할 수 있다. 720 동작에서, 일 실시예에 따른 프로세서는 모션 센서로부터 모션 센싱 정보를 기반으로 지정된 주 기적인 움직임 패턴 발생을 식별할 수 있다. 예를 들면, 지정된 주기적인 움직임 패턴은 양치질 시 움직임 패턴 을 학습하여 획득된 패턴일 수 있다. 예를 들면, 일 실시예에 따른 프로세서는 지정된 주기적인 움직임 패 턴 발생 시 양치질이 시작된 것으로 식별할 수 있다. 730 동작에서, 일 실시예에 따른 프로세서는 터치 센서로부터의 터치 센싱 정보를 기반으로 모션 센 서의 센싱 축을 보정할 수 있다. 예를 들면, 일 실시예에 따른 프로세서는 모션 센서에 포함된 가속도 센서, 자이로 센서, 지자기 센서 중 적어도 하나의 센서의 센싱 축을 보정할 수 있다. 예를 들면, 전자 장치가 링 형태의 제2 웨어러블 디바이스인 경우 손가락에 착용하였을 때 제2 웨어러블 디바이스 가 손가락을 축으로 회전 가능성이 높을 수 있으며, 제2 웨어러블 디바이스의 자세의 변경이 빈번하 여 제2 웨어러블 디바이스의 자세를 정확하게 식별하기 어려울 수 있다. 따라서 링 형태의 제2 웨어러블 디바이스의 경우 계산하기 힘들기 때문에, 터치 센서를 통해 모션 센서의 센싱 축을 보정할 수 있다. 예를 들면, 전자 장치가 링 형태의 제2 웨어러블 디바이스인 경우 손가락에 착용되었을 때 제2 웨어 러블 디바이스의 착용 상태 및 착용 위치를 검출하고 이를 기반으로 모션 센서의 센싱 축을 보정할 수 있다. 예를 들면, 프로세서는 터치 센서를 통해 센싱된 터치 센싱 정보를 기반으로 제2 웨어러블 디바 이스가 손가락에 착용되었을 때, 미리 설정된 착용 기준점에 대해 얼만큼 회전된 상태인지를 식별하고, 회 전된 상태를 기반으로 회전 매트릭스(Rotation Matrix)를 구성하여 모션 센서의 각 축을 회전하여 보정함 으로써 축 정보를 보정할 수 있다. 740 동작에서, 일 실시예에 따른 프로세서는 모션 센싱 정보로부터 양치질 핸드 모션과 연관된 특징 정보 를 추출할 수 있다. 예를 들면, 프로세서는 가속도 센서에 의해 센싱된 가속도 값, 자이로 센서에 의해 센 싱된 전자 장치의 회전 방향 또는 회전각 값, 지자기 센서에 의해 센싱된 지자기의 방향 정보를 통해 핸드 자세, 핸드 모션에 대한 주파수 특성, 핸드 모션의 크기 및 방향 정보를 획득(또는 추출)할 수 있다. 예를 들면, 양치질과 연관된 핸드 자세는 손등이 몸체를 기준으로 위쪽(하늘 방향)을 향하거나 몸체를 기준으로 좌측 또는 우측을 향하는 자세일 수 있다. 예를 들면, 양치질과 연관된 핸드 모션의 크기는 양치질의 속도에 따라 상 이할 수 있으나 지정된 크기 이하일 수 있다. 예를 들면, 양치질과 연관된 핸드 모션의 방향은 치아의 형태에 따라 몸체를 기준으로 수평방향(또는 전후 방향 또는 좌우 방향)이거나 몸체를 기준으로 수직 방향(또는 위 아 래 방향)일 수 있다. 예를 들면, 양치질과 연관된 핸드 모션의 방향은 수평 방향과 수직방향을 포함하면서 원을 그리는 경우의 방향 정보를 포함할 수 있다. 예를 들면, 양치질과 연관된 핸드 모션에 대한 주파수 특성은 지정 된 주파수 성분(예: 10Hz이상의 주파수 성분)을 포함할 수 있다. 지정된 주파수 성분은 양치질 시 잇몸 및 구강 의 위쪽 또는 아랫쪽에 칫솔이 닿으면서 발생되는 고주파 신호 성분일 수 있다. 750 동작에서, 일 실시예에 따른 프로세서는 머신 러닝 기반의 분류기(classifier)를 이용하여 양치질 핸 드 모션과 연관된 특징 정보에 대응된 양치질 핸드 모션 유형을 식별할 수 있다. 예를 들면, 프로세서는 머신 러닝 기반의 분류기(classifier)를 이용하여 미리 획득된 적어도 하나의 양치질 핸드 모션 정보(또는 적어 도 하나의 양치질 핸드 모션 패턴)(예: 제1 양치질 핸드 모션 정보(또는 패턴) 및/또는 제2 양치질 핸드 모션 정보(또는 패턴))와 양치질 핸드 모션과 연관된 특징 정보를 비교하고, 양치질 핸드 모션과 연관된 특징 정보가 제1 양치질 핸드 모션 패턴에 대응되는지 또는 제2 양치질 핸드 모션 패턴에 대응되는지 식별할 수 있다. 일 실 시예에 따른 프로세서는 상기 제1 모션 센싱 정보가 제1 양치질 핸드 모션 패턴에 대응되는 경우 제1 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 제1 양치질 핸드 모션으로 결정(확인 또는 식별)할 수 있다. 일 실시예에 따른 프로세서는 상기 제1 모션 센싱 정보가 제2 양치질 핸드 모션 패턴에 대응되는 경우 제1 모 션 센싱 정보에 대응된 양치질 핸드 모션 유형을 제2 양치질 핸드 모션으로 결정(확인 또는 식별)할 수 있다. 도 8a는 일 실시예에 따른 수평 방향 양치질 시 제1 가속도 센서 데이터 그래프의 일 예를 나타낸 도면이고, 도 8b는 일 실시예에 따른 수평 방향 양치질 시 제1 가속도 센서 데이터에 대한 FFT(fast fourier transform) 변환 그래프를 나타낸 도면이다. 도 8a를 참조하면, 일 실시예에 따른 수평 방향 양치질 시 프로세서는 제1 가속도 센서 데이터 그래프 를 획득할 수 있다. 제1 가속도 센서 데이터 그래프에서 가로축은 시간(ms)일 수 있고, 세로축은 가 속도 센서값(m/s2)일 수 있다. 일 실시예에 따르면 수평 방향 양치질 시 제1 가속도 센서 데이터 그래프는 z축 가속도 센서 데이터 곡선, y축 가속도 센서 데이터 곡선, x축 가속도 센서 데이터 곡선을 포함할 수 있다. 도 8b를 참조하면, 일 실시예에 따른 프로세서는 제1 가속도 센서 데이터 그래프에 대해 FFT(fast fourier transform)을 통한 주파수 분석을 수행하여 제1 FFT 그래프를 획득할 수 있다. 제1 FFT 그래프 에서 가로축은 주파수(Hz)일 수 있고, 세로축은 FFT값일 수 있다. 제1 FFT 그래프에 따르면, 수평 방 향으로 양치질 시 제1 주파수(예: 약 6Hz)이하의 저주파 성분이 주로 포함될 수 있다. 도 9a는 일 실시예에 따른 수직 방향 양치질 시 제2 가속도 센서 데이터 그래프의 일 예를 나타낸 도면이고, 도 9b는 일 실시예에 따른 수직 방향 양치질 시 제2 가속도 센서 데이터에 대한 FFT 변환 그래프를 나타낸 도면이 다. 도 9a를 참조하면, 일 실시예에 따른 수직 방향 양치질 시 프로세서는 제2 가속도 센서 데이터 그래프 를 획득할 수 있다. 제2 가속도 센서 그래프에서 가로축은 시간(ms)일 수 있고, 세로축은 가속도 센 서값(m/s2)일 수 있다. 일 실시예에 따르면 수직 방향 양치질 시 제2 가속도 센서 데이터 그래프는 z축 가 속도 센서 데이터 곡선, y축 가속도 센서 데이터 곡선, x축 가속도 센서 데이터 곡선을 포함할 수 있다. 도 9b를 참조하면, 일 실시예에 따른 프로세서는 제2 가속도 센서 데이터 그래프에 대해 FFT(fast fourier transform)을 통한 주파수 분석을 수행하여 제2 FFT 그래프를 획득할 수 있다. 제2 FFT 그래프 에서 가로축은 주파수(Hz)일 수 있고, 세로축은 FFT값일 수 있다. 제2 FFT 그래프에 따르면, 수직 방 향으로 양치질 시 제2 주파수(예: 약 10Hz)이상의 고주파 성분이 일부분 포함될 수 있다. 예를 들면 고주파 성 분은 양치질 시 잇몸 및 구강의 위쪽 또는 아래쪽에 칫솔이 닿으면서 발생되는 주파수 성분일 수 있다. 도 10a는 일 실시예에 따른 머리 말리기 시 제3 가속도 센서 데이터 그래프의 일 예를 나타낸 도면이고, 도 10b 는 일 실시예에 따른 머리 말리기 시 제3 가속도 센서 데이터에 대한 FFT 변환 그래프를 나타낸 도면이다. 도 10a를 참조하면, 일 실시예에 따른 머리 말리기 시 프로세서는 제3 가속도 센서 데이터 그래프를 획득할 수 있다. 제3 가속도 센서 그래프에서 가로축은 시간(ms)일 수 있고, 세로축은 가속도 센서값 (m/s2)일 수 있다. 일 실시예에 따르면 머리 말리기 시 제3 가속도 센서 데이터 그래프는 z축 가속도 센 서 데이터 곡선, y축 가속도 센서 데이터 곡선, x축 가속도 센서 데이터 곡선을 포함할 수 있다. 도 10b를 참조하면, 일 실시예에 따른 프로세서는 제3 가속도 센서 데이터 그래프에 대해 FFT(fast fourier transform)을 통한 주파수 분석을 수행하여 제3 FFT 그래프를 획득할 수 있다. 제3 FFT 그래프 에서 가로축은 주파수(Hz)일 수 있고, 세로축은 FFT값일 수 있다. 제3 FFT 그래프에 따르면, 주파 수 성분은 수평 방향으로 양치질을 수행한 것과 비슷하게 8Hz 이하의 저주파 대역에서 주로 나타나고 있으나, 핸드 모션에 의한 움직임의 크기가 양치질 시보다 상대적으로 크게 나타나기 때문에, 프로세서가 머리기 말리기 모션을 양치질 핸드 모션으로 식별하지 않을 수 있다. 도 11a는 일 실시예에 따른 손씻기 시 제4 가속도 센서 데이터 그래프의 일 예를 나타낸 도면이고, 도 11b는 일 실시예에 따른 손씻기 시 제4 가속도 센서 데이터에 대한 FFT 변환 그래프를 나타낸 도면이다. 도 11a를 참조하면, 일 실시예에 따른 손씻기 시 프로세서는 제4 가속도 센서 데이터 그래프를 획득 할 수 있다. 제4 가속도 센서 그래프에서 가로축은 시간(ms)일 수 있고, 세로축은 가속도 센서값(m/s2)일 수 있다. 일 실시예에 따르면 손씻기 시 제4 가속도 센서 데이터 그래프는 z축 가속도 센서 데이터 곡선 , x축 가속도 센서 데이터 곡선, y축 가속도 센서 데이터 곡선을 포함할 수 있다. 도 11b를 참조하면, 일 실시예에 따른 프로세서는 제4 가속도 센서 데이터 그래프에 대해 FFT(fast fourier transform)을 통한 주파수 분석을 수행하여 제4 FFT 그래프를 획득할 수 있다. 제4 FFT 그래프 에서 가로축은 주파수(Hz)일 수 있고, 세로축은 FFT값일 수 있다. 제4 FFT 그래프에 따르면, 주파 수 성분은 수평 방향으로 양치질을 수행한 것과 비슷하게 8Hz 이하의 저주파 대역에서 주로 나타나고 있고, 핸 드 모션에 의한 움직임의 크기도 양치질 시와 크게 차이가 나지 않을 수 있으며, 프로세서는 이러한 경우 핸드 자세 정보 또는 핸드 모션 방향 정보를 고려하여 손씻기 시의 모션을 양치질 핸드 모션으로 식별하지 않을 수 있다. 도 12는 일 실시예에 따른 머신 러닝 기반의 분류기 모델을 설명하기 위한 도면이다. 도 12를 참조하면, 일 실시예에 따른 머신 러닝 기반의 분류기 모델은 프로세서에서 실행되는 소프 트웨어 모듈이거나 전기적 회로를 포함하는 하드웨어 모듈일 수 있다. 예를 들면, 머신 러닝 기반의 분류기 모 델은 센서 신호 전처리부(sensor signal pre-processing), 특징 추출부(feature extraction), 양치질 핸드 모션 패턴 학습부, 분류기 모델링부, 및 분류기 모델 중 적어도 일부 또는 전부를 포함할 수 있다. 일 실시예에 따르면 센서 신호 전처리부(sensor signal pre- processing), 특징 추출부(feature extraction), 양치질 핸드 모션 패턴 학습부, 분류기 모 델링부, 및 분류기 모델은 각각 프로세서에 의해 실행되는 소프트웨어 프로그램이거나 전기적 회로를 포함하는 하드웨어 모듈일 수 있다. 일 실시예에 따른 센서 신호 전처리부는 모션 센서에 의해 획득된 센서 신호에 대한 전처리를 수행 하여 센서 데이터를 획득할 수 있다. 예를 들면, 센서 신호 전처리부는 모션 센서를 통해 감지된 센 서 신호로부터 가속도 및 자이로 센서 데이터를 획득하고, 센서 축을 보정하고, 노이즈 제거를 위한 필터링을 수행할 수 있다. 일 실시예에 따른 특징 추출부는 가속도 및 자이로 센서 데이터로부터 특징 정보를 추출할 수 있다. 예를 들면, 가속도 및 자이로 센서 데이터로부터 핸드 자세 정보, 핸드 모션에 대한 주파수 특성 정보, 핸드 모션의 움직임에 대한 크기 및 방향 정보를 획득할 수 있다. 일 실시예에 따른 양치질 핸드 모션 패턴 학습부는 추출된 특징 정보를 기반으로 머신 러닝 기법을 통해 양치질 핸드 모션 패턴을 학습할 수 있다. 일 실시예에 따른 분류기 모델링부는 양치질 핸드 모션 학습 결과를 기반으로 양치질 핸드 모션을 유형별 로 분류하는 분류기를 모델링하고, 분류기 모델링 정보를 제공할 수 있다.일 실시예에 따른 분류기 모델은 특징 추출부로부터 추출된 특징 정보와 분류기 모델링부로 부터 제공받은 분류기 모델링 정보를 기반으로 상기 추출된 특징 정보에 대응된 양치질 핸드 모션 유형을 식별 할 수 있다. 예를 들면, 분류기 모델링부는 추출된 특징 정보가 제1 양치질 모션 패턴에 대응되는지 제2 양치질 모션 패턴에 대응되는지 식별하거나, 상기 추출된 특징 정보가 양치질 모션 패턴이 아닌 다른 핸드 모션 패턴에 대응되는지 식별할 수 있다. 예를 들면, 다른 핸드 모션 패턴은 달리기 모션, 머리 말리기 모션, 또는 손씻기 모션을 포함할 수 있다. 예를 들면, 분류기 모델링부는 추출된 특징 정보가 제1 양치질 모션 패턴 또는 제2 양치질 모션 패턴을 포함하는 경우 양치질 모션이 감지된 것으로 판단할 수 있다. 일 실시예에 따르면. 특징 추출부(feature extraction) 및 양치질 핸드 모션 패턴 학습부의 동작은 Pre-training 동작(training phase)으로서 전자 장치의 프로세서가 아닌 외부의 전자 장치 또는 외 부의 서버에서 수행될 수 있다. 특징 추출부(feature extraction) 및 양치질 핸드 모션 패턴 학습부 의 동작이 외부에서 수행되는 경우 미리 학습된 학습 결과가 전자 장치에 제공되고 전자 장치 는 미리 학습된 학습 결과와 분류기 모델을 이용한 인식 동작(recognition phase)을 수행할 수 있다. 도 13은 일 실시예에 따른 웨어러블 전자 장치에서 양치질 핸드 모션 유형에 대응된 오디오 신호 패턴 유형을 이용한 양치질 소리 식별 동작을 나타낸 흐름도이다. 도 13을 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 도 2의 웨어러블 전자 장치, 도 3a의 제1 웨어러블 전자 장치, 도 3b의 제2 웨어러블 전자 장치)의 프로세서(예: 도 1의 프로세서 , 도 2의 프로세서, 또는 도 4의 프로세서, 이하 도 2의 프로세서를 예를 들어 설명함)는 1310 내지 1340 동작 중 적어도 하나의 동작을 수행할 수 있다. 1310 동작에서, 일 실시예에 따른 프로세서는 모션 센싱 정보를 기반으로 식별된 양치질 핸드 모션 유형에 대응된 오디오 신호 구간을 식별할 수 있다. 예를 들면, 프로세서는 전체 오디오 신호 구간 중 식별된 양 치질 핸드 모션 유형(예: 제1 양치질 핸드 모션 유형 또는 제2 양치질 핸드 모션 유형) 별로 각 양치질 핸드 모 션 유형에 대응된 오디오 신호 구간(예: 제1 오디오 신호 구간 또는 제2 오디오 신호 구간)을 구분(예: 세그멘 테이션(segmentation))하여 식별할 수 있다. 1320 동작에서, 일 실시예에 따른 프로세서는 양치질 핸드 모션 유형에 대응된 오디오 신호 구간의 볼륨이 지정된 임계 볼륨 이상인지 확인할 수 있다. 예를 들면, 임계 볼륨은 양치질 소리 인식이 가능한 범위에서 다양 한 값으로 지정될 수 있다. 예를 들면, 사용자가 양치질 중에 입을 닫고 양치질을 하는 경우 양치질 소리의 볼 륨이 현저히 낮아 양치질 소리 인식이 불가능할 수 있기 때문에 양치질 소리 인식이 가능한 범위의 임계 볼륨 설정이 필요할 수 있다. 일 실시예에 따른 프로세서는 오디오 신호 구간의 볼륨이 지정된 볼륨 이상이 아 니면, 오디오 신호 구간에 대한 처리를 종료할 수 있다. 일 실시예에 따른 프로세서는 오디오 신호 구간의 볼륨이 지정된 볼륨 이상이면 1330 동작으로 진행할 수 있다. 1330 동작에서, 일 실시예에 따른 프로세서는 양치질 핸드 모션 유형에 대응된 오디오 신호 구간의 주파 수 성분의 특징 정보를 추출할 수 있다. 예를 들면, 프로세서는 시간 도메인(time domain)의 오디오 신호 를 FFT(fast fourier transform)를 통해 주파수 도메인(frequency domain)의 오디오 신호로 변환하고, 주파수 도메인의 오디오 신호로부터 주파수 성분의 특징 정보(예: 단측 진폭 스펙트럼 (single-sided amplitude spectrum)에 대한 국소 최대값(Local Maxima))를 추출할 수 있다. 1340 동작에서, 일 실시예에 따른 프로세서는 양치질 핸드 모션 유형에 대응된 오디오 신호 구간의 주파수 성분의 특징 정보를 기반으로 오디오 신호 구간의 오디오 신호가 양치질 핸드 모션 유형에 대응된 오디오 신호 패턴에 대응되는지 식별할 수 있다. 예를 들면, 프로세서는 제1 양치질 핸드 모션 유형에 대응된 오디오 신호 구간의 주파수 성분이 제1 양치질 핸드 모션 유형에 대응된 제1 오디오 신호 패턴에 대응되는지 식별하거 나, 제2 양치질 핸드 모션 유형에 대응된 오디오 신호 구간의 주파수 성분이 제2 양치질 핸드 모션 유형에 대응 된 제2 오디오 신호 패턴에 대응되는지 식별할 수 있다. 예를 들면, 프로세서는 양치질 핸드 모션 유형에 대응된 오디오 신호 구간의 주파수 성분의 특징 정보를 미리 학습 시키고, 학습 결과에 기반한 오디오 신호 패 턴 분석 모델을 획득할 수 있다. 일 실시예에 따른 프로세서는 오디오 신호 패턴 분석 모델을 통해 양치질 핸드 모션 유형에 대응된 오디오 신호 구간의 오디오 신호가 양치질 핸드 모션 유형에 대응된 오디오 신호 패턴 에 대응되는지 식별할 수 있다. 일 실시예에 따른 프로세서는 양치질 핸드 모션 유형에 대응된 오디오 신 호 구간의 오디오 신호가 양치질 핸드 모션 유형에 대응된 오디오 신호 패턴에 대응되는 경우 그 오디오 신호를 양치질 핸드 모션 유형에 대응된 양치질 소리로 결정(확인 또는 식별)할 수 있다.도 14a는 일 실시예에 따른 수평 방향 양치질 시 획득된 오디오 신호 그래프의 일 예를 나타낸 도면이고, 도 14b는 일 실시예에 따른 수직 방향 양치질 시 획득된 오디오 신호 그래프의 일 예를 나타낸 도면이고, 도 14c는 일 실시예에 따른 손씻기 시 획득된 오디오 신호 그래프의 일 예를 나타낸 도면이다. 도 14a를 참조하면, 일 실시예에 따른 수평 방향 양치질 시 프로세서는 제1 오디오 신호 그래프를 획득할 수 있다. 제1 오디오 신호 그래프에서 가로축은 시간(ms)일 수 있고, 세로축은 오디오 신호 세기 (amplitude)일 수 있다. 일 실시예에 따르면 수평 방향 양치질 시 칫솔과 치아 간 마찰이 일어나는 시간동안 소 리가 날 수 있으며, 칫솔과 치아 간 마찰이 일어나는 시간이 수직 방향 양치질 시보다 길어 긴 시간 간격(예: 제1 시간 간격)으로 오디오 신호가 발생할 수 있다. 도 14b를 참조하면, 일 실시예에 따른 수직 방향 양치질 시 프로세서는 제2 오디오 신호 그래프를 획득할 수 있다. 제2 오디오 신호 그래프에서 가로축은 시간(ms)일 수 있고, 세로축은 오디오 신호 세기 (amplitude)일 수 있다. 일 실시예에 따르면 수직 방향 양치질 시 칫솔이 잇몸에 걸리거나 구강의 위쪽 또는 아 래쪽에 닿으면서 소리가 날 수 있으며, 수평 방향의 양치질보다 칫솔과 치아 간 마찰이 일어나는 시간이 짧아 짧은 시간 간격(예: 제2 시간 간격)으로 오디오 신호가 발생할 수 있다. 도 14c를 참조하면, 일 실시예에 따른 양치질이 아닌 다른 모션 시(예: 손씻기) 프로세서는 제3 오디오 신 호 그래프를 획득할 수 있다. 제3 오디오 신호 그래프에서 가로축은 시간(ms)일 수 있고, 세로축은 오디오 신호 세기(amplitude)일 수 있다. 일 실시예에 따르면 손씻기 시 손을 씻는 모션과는 상관없이 물소리에 대한 오디오 신호가 입력되어 수평 방향 양치질 또는 수직 방향 양치질과 매우 다른 패턴의 오디오 신호가 발생 할 수 있다. 일 실시예에 따르면 전자 장치의 프로세서는 상기한 바와 같은 다양한 핸드 모션에 따른 다양한 오디 오 신호 패턴을 학습하여 양치질 핸드 모션의 유형에 따른 오디오 신호 패턴을 미리 획득할 수 있다. 또는 전자 장치는 통신을 통해 외부의 전자 장치(또는 서버)로부터 기 학습된 양치질 핸드 모션의 유형에 따른 오디 오 신호 패턴 정보를 획득하여 메모리에 저장하거나, 제조 시 기 학습된 양치질 핸드 모션의 유형에 따른 오디오 신호 패턴 정보가 메모리에 탑재(또는 저장)되도록 구현될 수도 있다. 일 실시예에 따르면 양치질 모션의 유형에 따른 오디오 신호 패턴 획득 시 다양한 모델링 방식이 이용될 수 있 다. 예를 들면, 프로세서는 GMM-HMM(gaussian mixture model - hidden markov model) 혼합 모델을 이용하 여 양치질 핸드 모션 유형에 따른 오디오 신호 패턴을 획득할 수 있다. 도 15a는 일 실시예에 따른 수평 방향과 수직 방향의 모션이 혼합된 양치질 시의 오디오 신호에서 단측 진폭 스 펙트럼에서의 다양한 Local Maxima 주파수 특징 중 가장 우수한 두 가지 주파수 성분에 대해 GMM 모델을 이용하 여 학습한 결과를 나타낸 그래프이고, 도 15b는 일 실시예에 따른 손씻기 시의 오디오 신호에서 단측 진폭 스펙 트럼에서의 다양한 Local Maxima 주파수 특징 중 가장 우수한 두 가지 주파수 성분에 대해 GMM 모델을 이용하여 학습한 결과를 나타낸 그래프이다. 도 15a 및 도 15b를 참조하면, 가로축은 제1 주파수 성분(F1)을 나타낼 수 있고 세로축은 제2 주파수 성분(F2) 를 나타낼 수 있다. '+'로 표시된 특징 분포를 보면, 도 15a와 같은 수평 방향과 수직 방향의 모션을 혼합하여 양치질 시의 특징 분포(+)가 도 15b와 같은 손 씻기 시의 특징 분포(+)와 다소 유사하게 나타날 수 있다. 도 15a 및 도 15b에서 6개의 GMM 모델에 대한 학습 결과들(1510 및 1520)도 각각 서로 유사하게 나타날 수 있다. 이는 곧 오디오 신호에서 관측되는 특징 또는 상태가 비슷하다고 볼 수 있으며, 이러한 비슷한 정보를 가지고 HMM을 통해 시계열 패턴을 분석하다 보면 결국 양치질과 손 씻기 소리를 구분하는 데에 오인식이 발생할 우려가 클 수 밖에 없을 것이다. 따라서 수평 방향과 수직 방향의 모션을 혼합하여 양치질 시 주파수 특징 분포를 이용 하는 경우 다른 핸드 모션(예: 손씻기)와 구분이 어려워 양치질 감지에 오류가 발생할 수 있다. 도 16a는 일 실시예에 따른 수평 방향으로 양치질 시의 오디오 신호에서 단측 진폭 스펙트럼에서의 다양한 Local Maxima 주파수 특징 중 가장 우수한 두 가지 주파수 성분에 대해 GMM 모델을 이용하여 학습한 결과를 나 타낸 그래프이고, 도 16b는 일 실시예에 따른 수직 방향으로 양치질 시의 오디오 신호에서 단측 진폭 스펙트럼 에서의 다양한 Local Maxima 주파수 특징 중 가장 우수한 두 가지 주파수 성분에 대해 GMM 모델을 이용하여 학 습한 결과를 나타낸 그래프이다. 도 16a 및 도 16b를 참조하면, 가로축은 제1 주파수 성분(F1)을 나타낼 수 있고 세로축은 제2 주파수 성분(F2) 를 나타낼 수 있다. '+'로 표시된 특징 분포를 보면, 도 16a와 같은 수평 방향으로 양치질 시의 특징 분포(+) 및 도 16b와 같은 수직 방향으로 양치질 시의 특징 분포(+)는 각각 도 15b와 같은 손 씻기 시의 특징 분포(+)와매우 다르게 나타날 수 있다. 도 16a 및 도 16b에서 6개의 GMM 모델에 대한 학습 결과들(1610 및 1620)도 각각 도 15b의 6개의 GMM 모델에 대한 학습 결과과 매우 다르게 나타날 수 있다. 따라서 수평 방향과 수직 방향의 모션을 혼합하여 양치질 시 주파수 특징 분포를 이용하는 경우보다 본 개시의 다양한 실시예들에서 설명된 바와 같이 수평 방향과 수직 방향의 모션을 각각 별도로 인식하여 주파수 특징 분포를 이용하는 경우 다른 핸드 모션(예: 손씻기)와 구분이 용이하여 양치질 감지에 오류를 줄일 수 있다. 도 17a는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제1 정보 표시의 예를 나타낸 도면이다. 도 17a를 참조하면, 일 실시 예에 따른 웨어러블 전자 장치(예: 도 1의 전자 장치, 도 2의 웨어러블 전자 장치, 도 3a의 제1 웨어러블 전자 장치)의 프로세서(예: 도 1의 프로세서, 또는 도 2의 프 로세서, 이하 도 2의 프로세서를 예를 들어 설명함)는 디스플레이(예: 도 1의 디스플레이 모듈 , 또는 도 2의 디스플레이)에 양치질과 연관된 제1 정보를 표시하도록 제어할 수 있다. 예를 들면, 양치질과 연관된 제1 정보는 사용자가 양치질을 시작하고부터 카운트되는 양치질 시간 카운트 정보 (예: 115 seconds)를 포함할 수 있다. 도 17b는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제2 정보 표시 예를 나타낸 도면이다. 도 17b를 참조하면, 일 실시 예에 따른 프로세서는 디스플레이 에 양치질과 연관된 제2 정보 를 표시하도록 제어할 수 있다. 예를 들면, 양치질과 연관된 제2 정보는 사용자가 양치질을 시작하고 나 서 종료했을 때까지의 총 양치질 시간(예: 양치질한 시간 65초)를 포함할 수 있다. 도 17c는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제3 정보 표시 예를 나타낸 도면이다. 도 17c를 참조하면, 일 실시 예에 따른 프로세서는 디스플레이 에 양치질과 연관된 제3 정보 를 표시하도록 제어할 수 있다. 예를 들면, 양치질과 연관된 제3 정보는 사용자가 양치질을 시작하고 나 서 종료했을 때까지의 총 양치질 시간이 권장 시간보다 짧은 경우 이를 안내하는 메시지(예: 양치질한 시간이 너무 짧습니다. 조금 더 양치질을 해보는 건 어떨까요?)를 포함할 수 있다. 도 17d는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제4 정보 표시 예를 나타낸 도면이다. 도 17d를 참조하면, 일 실시 예에 따른 프로세서는 디스플레이 에 양치질과 연관된 제4 정보 를 표시하도록 제어할 수 있다. 예를 들면, 양치질과 연관된 제4 정보는 사용자의 양치질 핸드 모션 유형 수행 횟수에 기반하여 식별된 권장 양치질 방법 준수 여부를 안내하는 메시지(예: 권장되는 양치질 방법으로 양 치질을 해보는 건 어떨까요? 또는 권장 양치질 방법에 맞지 않게 양치질이 수행되었습니다.)를 포함할 수 있다. 도 17e를 참조하면, 일 실시 예에 따른 프로세서는 디스플레이 에 양치질과 연관된 제5 정보 를 표시하도록 제어할 수 있다. 예를 들면, 양치질과 연관된 제5 정보는 사용자에 의해 수행된 양치질 핸 드 모션 유형에 기반하여 제1 양치질 핸드 모션의 양치질이 부족함을 안내하는 메시지(예: 좌측 바깥쪽 치아의 좌우 방향 양치질이 부족합니다. 또는 좌우 방향의 양치질을 더 해보는 건 어떨까요?)를 포함할 수 있다. 도 17f를 참조하면, 일 실시 예에 따른 프로세서는 디스플레이 에 양치질과 연관된 제6 정보 를 표시하도록 제어할 수 있다. 예를 들면, 양치질과 연관된 제6 정보는 사용자에 의해 수행된 양치질 핸 드 모션 유형에 기반하여 제2 양치질 핸드 모션의 양치질이 부족함을 안내하는 메시지(예: 앞니 바깥쪽 치아의 상하 방향 양치질이 부족합니다. 또는 상하 방향의 양치질을 더 해보는 건 어떨까요?)를 포함할 수 있다. 다양한 실시예에 따르면 상기 도 17a 내지 17f에 도시된 예 외에 양치질과 연관된 다른 정보들이 더 표시될 수 있음을 당업자에게 자명할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들 면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어 러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한정 하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도 면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",\"A 또는 B 중 적어도 하나,\"\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,\"및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하 는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사 용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구 성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들 면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시예는 기기(machine)(예: 전자 장치)에 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체 는, 비일시적(non-transitory) 저장매체의 형태 로 제공될 수 있다. 여기서, ‘비일시적’은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복 수의 개체를 포함할 수 있다. 다양한 실시예에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또 는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통 합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수 의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정 된 것으로서, 상기 적어도 하나의 동작은, 모션 센서를 통해 모션 센싱 정보를 획득하는 동작, 오디오 센서를 통해 상기 모션 센싱 정보에 대응된 오디오 신호를 획득하는 동작, 상기 모션 센싱 정보에 대응된 양치질 핸드 모션 유형을 식별하는 동작, 상기 양치질 핸드 모션 유형에 대응하여 오디오 신호 패턴을 식별하는 동작, 및 상 기 양치질 핸드 모션 유형과 상기 오디오 신호 패턴을 기반으로 상기 모션 센싱 정보 및 상기 오디오 신호에 대 응된 양치질 핸드 모션을 식별하는 동작을 포함할 수 있다. 그리고 본 명세서와 도면에 발명된 본 발명의 실시예들은 본 발명의 실시예에 따른 기술 내용을 쉽게 설명하고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 발명된 실시예들 이외에도 본 발명의 다양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범위 에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0105842", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2는 일 실시예에 따른 웨어러블 전자 장치의 블록도이다. 도 3a는 일 실시예에 따른 제1 웨어러블 전자 장치의 예를 나타낸 도면이다. 도 3b는 일 실시예에 따른 제2 웨어러블 전자 장치의 예를 나타낸 도면이다. 도 4는 일 실시예에 따른 제2 웨어러블 전자 장치의 내부 구성 예를 나타낸 도면이다. 도 5는 일 실시예에 따른 웨어러블 전자 장치에서 양치질 정보 제공 동작을 나타낸 흐름도이다. 도 6은 일 실시예에 따른 양치질 시작부터 양치질 종료까지의 양치질 세션 예를 나타낸 도면이다. 도 7은 일 실시예에 따른 웨어러블 전자 장치에서 양치질 핸드 모션 유형 식별 동작을 나타낸 흐름도이다. 도 8a는 일 실시예에 따른 수평 방향 양치질 시 제1 가속도 센서 데이터 그래프의 일 예를 나타낸 도면이다. 도 8b는 일 실시예에 따른 수평 방향 양치질 시 제1 가속도 센서 데이터에 대한 FFT 변환 그래프를 나타낸 도면 이다. 도 9a는 일 실시예에 따른 수직 방향 양치질 시 제2 가속도 센서 데이터 그래프의 일 예를 나타낸 도면이다. 도 9b는 일 실시예에 따른 수직 방향 양치질 시 제2 가속도 센서 데이터에 대한 FFT 변환 그래프를 나타낸 도면 이다. 도 10a는 일 실시예에 머리 말리기 시 제3 가속도 센서 데이터 그래프의 일 예를 나타낸 도면이다. 도 10b는 일 실시예에 따른 머리 말리기 시 제3 가속도 센서 데이터에 대한 FFT 변환 그래프를 나타낸 도면이다. 도 11a는 일 실시예에 따른 손씻기 시 제4 가속도 센서 데이터 그래프의 일 예를 나타낸 도면이다. 도 11b는 일 실시예에 따른 손씻기 시 제4 가속도 센서 데이터에 대한 FFT 변환 그래프를 나타낸 도면이다. 도 12는 일 실시예에 따른 머신 러닝 기반의 분류기 모델을 설명하기 위한 도면이다. 도 13은 일 실시예에 따른 웨어러블 전자 장치에서 양치질 핸드 모션 유형에 대응된 오디오 신호 패턴 유형을 이용한 양치질 소리 식별 동작을 나타낸 흐름도이다. 도 14a는 일 실시예에 따른 수평 방향 양치질 시 획득된 오디오 신호 그래프의 일 예를 나타낸 도면이다. 도 14b는 일 실시예에 따른 수직 방향 양치질 시 획득된 오디오 신호 그래프의 일 예를 나타낸 도면이다. 도 14c는 일 실시예에 따른 손씻기 시 획득된 오디오 신호 그래프의 일 예를 나타낸 도면이다. 도 15a는 일 실시예에 따른 수평 방향과 수직 방향의 모션이 혼합된 양치질 시의 오디오 신호에서 단측 진폭 스 펙트럼에서의 다양한 Local Maxima 주파수 특징 중 가장 우수한 두 가지 주파수 성분에 대해 GMM 모델을 이용하 여 학습한 결과를 나타낸 그래프이다. 도 15b는 일 실시예에 따른 손씻기 시의 오디오 신호에서 단측 진폭 스펙트럼에서의 다양한 Local Maxima 주파 수 특징 중 가장 우수한 두 가지 주파수 성분에 대해 GMM 모델을 이용하여 학습한 결과를 나타낸 그래프이다.도 16a는 일 실시예에 따른 수평 방향으로 양치질 시의 오디오 신호에서 단측 진폭 스펙트럼에서의 다양한 Local Maxima 주파수 특징 중 가장 우수한 두 가지 주파수 성분에 대해 GMM 모델을 이용하여 학습한 결과를 나 타낸 그래프이다. 도 16b는 일 실시예에 따른 수직 방향으로 양치질 시의 오디오 신호에서 단측 진폭 스펙트럼에서의 다양한 Local Maxima 주파수 특징 중 가장 우수한 두 가지 주파수 성분에 대해 GMM 모델을 이용하여 학습한 결과를 나 타낸 그래프이다. 도 17a는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제1 정보 표시 예를 나타낸 도면이다. 도 17b는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제2 정보 표시 예를 나타낸 도면이다. 도 17c는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제3 정보 표시 예를 나타낸 도면이다. 도 17d는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제4 정보 표시 예를 나타낸 도면이다. 도 17e는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제5 정보 표시 예를 나타낸 도면이다. 도 17f는 일 실시예에 따른 웨어러블 전자 장치에서 양치질과 연관된 제6 정보 표시 예를 나타낸 도면이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다."}
