{"patent_id": "10-2019-0045662", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0122676", "출원번호": "10-2019-0045662", "발명의 명칭": "비 접촉 센서를 이용한 신체 상태 정보 획득 방법", "출원인": "광주과학기술원", "발명자": "서호건"}}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비 접촉 센서를 이용하여 획득한 제1 데이터 및 접촉 센서를 이용하여 획득한 제2 데이터를 이용하여 인공 신경망을 트레이닝 함으로서 예측 모델을 생성하는 단계;진단용 비접촉 센서를 이용하여 제3 데이터를 시계열적으로 획득하는 단계; 및상기 제3 데이터의 구간 데이터를 상기 예측 모델에 시계열적으로 입력하여, 상기 제2 데이터와 같은 유형의 제4 데이터를 실 시간으로 추론하는 단계를 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 제3 데이터의 구간 데이터를 상기 예측 모델에 시계열적으로 입력하는 단계는,상기 시계열적으로 획득되는 제3 데이터 중 제1 프레임의 구간 데이터를 상기 예측 모델에 입력하는 단계; 및상기 시계열적으로 획득되는 제3 데이터 중 상기 제1 프레임의 다음 프레임인 제2 프레임의 구간 데이터를 상기예측 모델에 입력하는 단계를 포함하고,상기 제1 프레임 및 상기 제2 프레임은 서로에게 중첩되는 중첩 구간을 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 제4 데이터를 실 시간으로 추론하는 단계는,상기 제1 프레임의 구간 데이터에 기초하여 상기 예측 모델이 출력한 상기 제1 프레임의 출력 데이터 및 상기제2 프레임의 구간 데이터에 기초하여 상기 예측 모델이 출력한 상기 제2 프레임의 출력 데이터를 합성하는 단계를 더 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터를 합성하는 단계는,상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터에 가중치를 부여하여 상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터를 합성하는 단계를 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 중첩 구간에서, 상기 중첩 구간의 종점으로 갈수록 상기 제2 프레임의 출력 데이터에 부여되는 가중치는증가하고 상기 제1 프레임의 출력 데이터에 부여되는 가중치는 감소하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법.공개특허 10-2020-0122676-3-청구항 6 제 3항에 있어서,상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터를 합성하는 단계는,상기 제2 프레임과 중첩되지 않는 제1 프레임의 일부 구간에서, 상기 제2 프레임의 출력 데이터의 반영 없이,상기 제1 프레임의 출력 데이터를 반영하는 단계를 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3항에 있어서,상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터를 합성하는 단계는,상기 제1 프레임과 중첩되지 않는 제2 프레임의 일부 구간에서, 상기 제1 프레임의 출력 데이터의 반영 없이,상기 제2 프레임의 출력 데이터를 반영하는 단계를 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 중첩 구간의 종점(end point)에서 상기 제2 프레임의 출력 데이터에 부여되는 가중치는, 상기 제1 프레임과 중첩되지 않는 제2 프레임의 일부 구간에서 상기 제2 프레임의 출력 데이터에 부여되는 가중치와 동일한비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 3항에 있어서,상기 제4 데이터를 실 시간으로 추론하는 단계는,다중 프로세서 중 제1 프로세서가, 상기 예측 모델을 이용하여 상기 제1 프레임의 구간 데이터를 처리함으로써,상기 제1 프레임의 출력 데이터를 획득하는 단계; 및상기 다중 프로세서 중 제2 프로세서가, 상기 예측 모델을 이용하여 상기 제2 프레임의 구간 데이터를 처리함으로써, 상기 제2 프레임의 출력 데이터를 획득하는 단계를 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서,상기 제1 데이터는,비 접촉 센서를 이용하여 무선 신호를 발진한 경우, 사람으로부터 반사된 무선 신호에 대응하는 데이터이고,상기 제2 데이터는,접촉 센서를 이용하여 획득된, 맥박 및 호흡 중 적어도 하나에 대응하는 데이터인비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10항에 있어서,상기 제4 데이터에 기초하여 무 호흡 여부를 결정하고, 상기 무 호흡이 결정되면 호흡 유도 장치에 자극 수행공개특허 10-2020-0122676-4-명령을 전송하는 단계를 더 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있어서,상기 예측 모델을 생성하는 단계는,상기 비 접촉 센서를 이용하여 획득한 제1 데이터, 상기 접촉 센서를 이용하여 획득한 제2 데이터 및 상태 정보를 이용하여 상기 인공 신경망을 트레이닝 함으로써 상기 예측 모델을 생성하는 단계를 포함하고,제4 데이터를 실 시간으로 추론하는 단계는,상기 제3 데이터를 상기 예측 모델에 입력하여, 상기 제2 데이터와 같은 유형의 제4 데이터 및 상태 정보를 추론하는 단계를 포함하고,상기 상태 정보는,호흡 또는 무호흡 여부, 사람의 동작에 의한 신체 움직임 및 부재 중 적어도 하나를 포함하는비 접촉 센서를 이용한 신체 상태 정보 획득 방법."}
{"patent_id": "10-2019-0045662", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "비 접촉 센서를 이용한 신체 상태 정보 획득 방법이 개시된다. 본 발명의 실시 예에 따른 비 접촉 센서를 이용한 신체 상태 정보 획득 방법은, 비 접촉 센서를 이용하여 획득한 제1 데이터 및 접촉 센서를 이용하여 획득한 제2 데이터를 이용하여 인공 신경망을 트레이닝 함으로서 예측 모델을 생성하는 단계, 진단용 비접촉 센서를 이용하 여 제3 데이터를 시계열적으로 획득하는 단계, 및, 상기 제3 데이터의 구간 데이터를 상기 예측 모델에 시계열적으로 입력하여, 상기 제2 데이터와 같은 유형의 제4 데이터를 실 시간으로 추론하는 단계를 포함한다."}
{"patent_id": "10-2019-0045662", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 비 접촉 센서로부터 수신되는 신호를 이용하여 신체 상태를 실 시간으로 진단할 수 있는, 비 접촉 센서를 이용한 신체 상태 정보 획득 방법에 관한 것이다."}
{"patent_id": "10-2019-0045662", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능(artificial intelligence)은 인간의 지능으로 할 수 있는 사고, 학습, 자기계발 등을 컴퓨터가 할 수 있도록 하는 방법을 연구하는 컴퓨터 공학 및 정보기술의 한 분야로, 컴퓨터가 인간의 지능적인 행동을 모방할 수 있도록 하는 것을 의미한다. 또한, 인공지능은 그 자체로 존재하는 것이 아니라, 컴퓨터 과학의 다른 분야와 직간접으로 많은 관련을 맺고 있다. 특히 현대에는 정보기술의 여러 분야에서 인공지능적 요소를 도입하여, 그 분야의 문제 풀이에 활용하려 는 시도가 매우 활발하게 이루어지고 있다. 한편, 인공지능을 이용하여 주변의 상황을 인지 및 학습하고 사용자가 원하는 정보를 원하는 형태로 제공하거나 사용자가 원하는 동작이나 기능을 수행하는 기술이 활발하게 연구되고 있다. 한편 인공지능 기법을 적용하여 호흡, 맥박 등의 신체 상태를 진단하려는 노력이 계속되고 있다. 다만 종래의 인공지능 기법으로는 호흡, 맥박 등의 신체 상태를 실시간으로 진단하기가 어려운 문제가 있었다."}
{"patent_id": "10-2019-0045662", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위한 것으로, 본 발명의 목적은, 비 접촉 센서로부터 수신되는 신호를 이 용하여 신체 상태를 실 시간으로 진단할 수 있는, 비 접촉 센서를 이용한 신체 상태 정보 획득 방법을 제공하기 위함이다."}
{"patent_id": "10-2019-0045662", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 비 접촉 센서를 이용한 신체 상태 정보 획득 방법은, 비 접촉 센서를 이용하여 획득 한 제1 데이터 및 접촉 센서를 이용하여 획득한 제2 데이터를 이용하여 인공 신경망을 트레이닝 함으로서 예측 모델을 생성하는 단계, 진단용 비접촉 센서를 이용하여 제3 데이터를 시계열적으로 획득하는 단계, 및, 상기 제 3 데이터의 구간 데이터를 상기 예측 모델에 시계열적으로 입력하여, 상기 제2 데이터와 같은 유형의 제4 데이터를 실 시간으로 추론하는 단계를 포함한다. 이 경우 상기 제3 데이터의 구간 데이터를 상기 예측 모델에 시계열적으로 입력하는 단계는, 상기 시계열적으로 획득되는 제3 데이터 중 제1 프레임의 구간 데이터를 상기 예측 모델에 입력하는 단계, 및, 상기 시계열적으로 획득되는 제3 데이터 중 상기 제1 프레임의 다음 프레임인 제2 프레임의 구간 데이터를 상기 예측 모델에 입력 하는 단계를 포함하고, 상기 제1 프레임 및 상기 제2 프레임은 서로에게 중첩되는 중첩 구간을 포함 할 수 있다. 이 경우 상기 제4 데이터를 실 시간으로 추론하는 단계는, 상기 제1 프레임의 구간 데이터에 기초하여 상기 예 측 모델이 출력한 상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 구간 데이터에 기초하여 상기 예측 모 델이 출력한 상기 제2 프레임의 출력 데이터를 합성하는 단계를 더 포함 할 수 있다. 이 경우 상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터를 합성하는 단계는, 상기 제1 프레 임의 출력 데이터 및 상기 제2 프레임의 출력 데이터에 가중치를 부여하여 상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터를 합성하는 단계를 포함할 수 있다. 이 경우 상기 중첩 구간에서, 상기 중첩 구간의 종점으로 갈수록 상기 제2 프레임의 출력 데이터에 부여되는 가 중치는 증가하고 상기 제1 프레임의 출력 데이터에 부여되는 가중치는 감소할 수 있다. 한편 상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터를 합성하는 단계는, 상기 제2 프레임과 중첩되지 않는 제1 프레임의 일부 구간에서, 상기 제2 프레임의 출력 데이터의 반영 없이, 상기 제1 프레임의 출력 데이터를 반영하는 단계를 포함 할 수 있다. 한편 상기 제1 프레임의 출력 데이터 및 상기 제2 프레임의 출력 데이터를 합성하는 단계는, 상기 제1 프레임과 중첩되지 않는 제2 프레임의 일부 구간에서, 상기 제1 프레임의 출력 데이터의 반영 없이, 상기 제2 프레임의 출력 데이터를 반영하는 단계를 포함 할 수 있다. 이 경우 상기 중첩 구간의 종점(end point)에서 상기 제2 프레임의 출력 데이터에 부여되는 가중치는, 상기 제1 프레임과 중첩되지 않는 제2 프레임의 일부 구간에서 상기 제2 프레임의 출력 데이터에 부여되는 가중치와 동일 할 수 있다. 한편 상기 제4 데이터를 실 시간으로 추론하는 단계는, 다중 프로세서 중 제1 프로세서가, 상기 예측 모델을 이 용하여 상기 제1 프레임의 구간 데이터를 처리함으로써, 상기 제1 프레임의 출력 데이터를 획득하는 단계, 및, 상기 다중 프로세서 중 제2 프로세서가, 상기 예측 모델을 이용하여 상기 제2 프레임의 구간 데이터를 처리함으 로써, 상기 제2 프레임의 출력 데이터를 획득하는 단계를 포함할 수 있다. 한편 상기 제1 데이터는, 비 접촉 센서를 이용하여 무선 신호를 발진한 경우, 사람으로부터 반사된 무선 신호에 대응하는 데이터이고, 상기 제2 데이터는, 접촉 센서를 이용하여 획득된, 맥박 및 호흡 중 적어도 하나에 대응 하는 데이터일 수 있다. 이 경우 상기 제4 데이터에 기초하여 무 호흡 여부를 결정하고, 상기 무 호흡이 결정되면 호흡 유도 장치에 자 극 수행 명령을 전송하는 단계를 더 포함할 수 있다. 한편 상기 예측 모델을 생성하는 단계는, 상기 비 접촉 센서를 이용하여 획득한 제1 데이터, 상기 접촉 센서를 이용하여 획득한 제2 데이터 및 상태 정보를 이용하여 상기 인공 신경망을 트레이닝 함으로써 상기 예측 모델을 생성하는 단계를 포함하고, 제4 데이터를 실 시간으로 추론하는 단계는, 상기 제3 데이터를 상기 예측 모델에 입력하여, 상기 제2 데이터와 같은 유형의 제4 데이터 및 상태 정보를 추론하는 단계를 포함하고, 상기 상태 정 보는, 호흡 또는 무호흡 여부, 사람의 동작에 의한 신체 움직임 및 부재 중 적어도 하나를 포함할 수 있다."}
{"patent_id": "10-2019-0045662", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또 는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명을 구현함에 있어서 설명의 편의를 위하여 구성요소를 세분화하여 설명할 수 있으나, 이들 구성요소가 하나의 장치 또는 모듈 내에 구현될 수도 있고, 혹은 하나의 구성요소가 다수의 장치 또는 모듈들에 나뉘어져서 구현될 수도 있다. 도 1은 본 발명의 실시 예에 따른, 인공 신경망의 학습 장치의 구성을 나타낸 블록도이다. 학습 장치는 데이터 마이닝, 데이터 분석, 지능형 의사 결정 및 기계 학습 알고리즘을 위해 이용될 정보를 수신, 분류, 저장 및 출력하도록 구성될 수 있다. 여기서, 기계 학습 알고리즘은 딥 러닝 알고리즘을 포함할 수 있다. 도 1을 참조하면, 학습 장치는 입력부, 메모리, 전원 공급부 및 프로세서를 포함할 수 있다. 입력부는, 비 접촉 센서, 접촉 센서 또는 비 접촉 센서를 이용하여 획득한 비 접촉 신호 및 접촉 센서를 이용하여 획득한 접촉 신호를 보유하는 기타 다른 장치 등과 통신할 수 있다. 그리고 입력부는 인공 신경망을 트레이닝 하기 위한 훈련 데이터를 수신할 수 있다. 메모리는 모델 저장부 및 데이터베이스 등을 포함할 수 있다. 모델 저장부는 트레이닝 중인 또는 트레이닝 된 모델(또는 인공 신경망, 231a)을 저장하며, 트레이닝을 통 하여 모델이 업데이트되면 업데이트 된 모델을 저장할 수 있다. 도 1에 도시된 인공 신경망(231a)은 복수의 은닉층을 포함하는 인공 신경망의 하나의 예시일 뿐이며, 본 발명의 인공 신경망이 이에 한정되는 것은 아니다. 인공 신경망(231a)은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 인공 신경 망(231a)의 일부 또는 전부가 소프트웨어로 구현되는 경우, 인공 신경망(231a)을 구성하는 하나 이상의 명령어 는 메모리에 저장될 수 있다. 데이터베이스는 모델 학습을 위하여 이용되는 학습 데이터(또는 훈련 데이터), 모델의 학습 히스토리 등을 저장한다. 프로세서는 학습 장치의 전반적인 동작을 제어할 수 있다. 한편 머신 러닝(machine learning)은 인공지능의 한 분야로, 컴퓨터에 명시적인 프로그램 없이 배울 수 있는 능 력을 부여하는 연구 분야이다. 구체적으로 머신 러닝은, 경험적 데이터를 기반으로 학습을 하고 예측을 수행하고 스스로의 성능을 향상시키는 시스템과 이를 위한 알고리즘을 연구하고 구축하는 기술이라 할 수 있다. 머신 러닝의 알고리즘들은 엄격하게 정해진 정적인 프로그램 명령들을 수행하는 것이라기보다, 입력 데이터를 기반으로 예측이나 결정을 이끌어내기 위해 특정한 모델을 구축하는 방식을 취한다. 용어 ‘머신 러닝’은 용어 ‘기계 학습’과 혼용되어 사용될 수 있다. 인공신경망은 생물학적 뉴런의 동작원리와 뉴런간의 연결 관계를 모델링한 것으로 노드(node) 또는 처리 요소 (processing element)라고 하는 다수의 뉴런들이 레이어(layer) 구조의 형태로 연결된 정보처리 시스템이다. 인공 신경망은 일반적으로 다음의 세가지 인자, 즉 다른 레이어의 뉴런들 사이의 연결 패턴 연결의 가 중치를 갱신하는 학습 과정 이전 레이어로부터 수신되는 입력에 대한 가중 합으로부터 출력값을 생성하는 활성화 함수에 의해 정의될 수 있다. 인공 신경망은, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), MLP(Multilayer Perceptron), CNN(Convolutional Neural Network)와 같은 방식의 네트 워크 모델들을 포함할 수 있으나, 이에 한정되지 않는다. 인공신경망은 계층 수에 따라 단층 신경망(Single-Layer Neural Networks)과 다층 신경망(Multi-Layer Neural Networks)으로 구분된다. 일반적인 단층 신경망은, 입력층과 출력층으로 구성된다. 또한 일반적인 다층 신경망은 입력층(Input Layer)과 하나 이상의 은닉층(Hidden Layer), 출력층(Output Layer)으로 구성된다. 입력층은 외부의 자료들을 받아들이는 층으로서, 입력층의 뉴런 수는 입력되는 변수의 수와 동일하며, 은닉층은 입력층과 출력층 사이에 위치하며 입력층으로부터 신호를 받아 특성을 추출하여 출력층으로 전달한다. 출력층은 은닉층으로부터 신호를 받고, 수신한 신호에 기반한 출력 값을 출력한다. 뉴런간의 입력신호는 각각의 연결강도 (가중치)와 곱해진 후 합산되며 이 합이 뉴런의 임계치보다 크면 뉴런이 활성화되어 활성화 함수를 통하여 획득 한 출력값을 출력한다. 한편 입력층과 출력 층 사이에 복수의 은닉층을 포함하는 심층 신경망은, 기계 학습 기술의 한 종류인 딥 러닝 을 구현하는 대표적인 인공 신경망일 수 있다. 인공 신경망은 훈련 데이터(training data)를 이용하여 학습(training)될 수 있다. 여기서 학습이란, 입력 데이 터를 분류(classification)하거나 회귀분석(regression)하거나 군집화(clustering)하는 등의 목적을 달성하기 위하여, 학습 데이터를 이용하여 인공 신경망의 파라미터(parameter)를 결정하는 과정을 의미할 수 있다. 인공 신경망의 파라미터의 대표적인 예시로써, 시냅스에 부여되는 가중치(weight)나 뉴런에 적용되는 편향(bias)을 들 수 있다. 한편 인공 신경망의 학습 방식 중 지도 학습에 대하여 설명한다. 지도 학습은 훈련 데이터로부터 하나의 함수를 유추해내기 위한 기계 학습의 한 방법이다. 지도 학습에서는, 훈련 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습시킨다. 여기서 레이블이란, 훈련 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결 과 값)을 의미할 수 있다. 본 명세서에서는 훈련 데이터가 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과값)을 레이블 또 는 레이블링 데이터(labeling data)이라 명칭 한다. 또한 본 명세서에서는, 인공 신경망의 학습을 위하여 훈련 데이터에 레이블을 설정하는 것을, 훈련 데이터에 레 이블링 데이터를 레이블링(labeling) 한다고 명칭 한다. 이 경우 훈련 데이터와 훈련 데이터에 대응하는 레이블)은 하나의 트레이닝 셋(training set)을 구성하고, 인공 신경망에는 트레이닝 셋의 형태로 입력될 수 있다. 인공 신경망은 훈련 데이터와 레이블링 데이터를 이용하여, 훈련 데이터와 레이블링 데이터의 연관 관계에 대한 함수를 유추할 수 있다. 그리고, 인공 신경망에서 유추된 함수에 대한 평가를 통해 인공 신경망의 파라미터가 결정(최적화)될 수 있다. 프로세서는 훈련 데이터 또는 트레이닝 셋(training set)을 이용하여 인공 신경망(231a)을 훈련(training, 또는 학습)시킬 수 있다. 구체적으로 프로세서는 다양한 학습 기법을 이용하여 인공 신경망(231a)을 반복적으로 학습시킴으로써, 인 공 신경망(231a)의 최적화된 모델 파라미터들을 결정할 수 있다 본 명세서에서는 훈련 데이터를 이용하여 학습됨으로써 파라미터가 결정된 인공 신경망을 학습 모델, 학습된 모 델(a trained model) 또는 예측 모델이라 칭할 수 있다. 전원공급부는 프로세서의 제어 하에서, 외부의 전원, 내부의 전원을 인가 받아 학습 장치에 포 함된 각 구성요소들에 전원을 공급할 수 있다. 도 2는 본 발명의 실시 예에 따른, 인공 신경망의 트레이닝 방법을 설명하기 위한 도면이다. 인공 신경망을 트레이닝 하기 위한 훈련 데이터는, 비 접촉 센서를 이용하여 획득한 제1 데이터를 포함할 수 있다. 여기서 비 접촉 센서는, 사람의 신체에 접촉하거나 사람의 신체의 움직임에 의한 압력을 직접적으로 받는 것 없 이, 신체의 움직임을 감지할 수 있는 센서일 수 있다. 구체적으로 비 접촉 센서는, 무선 신호를 발진하고, 발진된 무선 신호가 사람의 신체를 맞고 반사되면, 사람으 로부터 반사된 무선 신호를 수신할 수 있는 센서일 수 있다. 여기서 무선 신호는 전자기파 신호일 수 있다. 이 경우 비 접촉 센서는 와이파이 신호, 블르투스 신호, 초광대 역통신(UWB) 신호 중 적어도 하나를 발진 및 수신할 수 있다. 한편 비 접촉 센서를 이용하여 획득한 제1 데이터는, 비 접촉 센서를 이용하여 획득되는 무선 신호를 나타 내는 데이터일 수 있다. 예를 들어 도 1에서는, 비 접촉 센서를 이용하여 획득되는 무선 신호를 표현한 시간-거리별 반사 신호 2차원 데 이터를 도시하였다. 비 접촉 센서를 통하여 획득되는 무선 신호는 시계열적으로 수집된다. 따라서 시간-거 리별 반사 신호 2차원 데이터의 세로 축은 거리(반사 시간)을 나타내고 가로 축은 시간을 나타내어, 시간 의 변화에 따른 반사 신호의 거리 및 세기를 가시화 할 수 있다. 다만 이에 한정되지 아니하며, 비 접촉 센서를 이용하여 획득한 제1 데이터는 다양한 형식으로 무선 신호를 표현할 수 있다. 한편 비 접촉 센서에서 수신하는 무선 신호는, 무선 신호가 반사되는 면적, 무선 신호의 반사 각도, 비접촉 센 서와 반사면 까지의 거리, 신체의 이동 방향 등에 따라, 수신되는 무선 신호의 파형, 진폭, 발진 후 다시 수신 되기까지의 시간, 신호의 주파수 등이 달라질 수 있다. 그리고 제1 데이터는 무선 신호에서 나타나는 특성 을 그대로 나타낼 수 있다. 따라서 비 접촉 센서를 이용하여 획득한 제1 데이터를 통하여, 호흡 또는 무호흡 여부, 자세, 사람의 움직 임, 호흡 신호, 맥박 신호, 움직임 상태, 호흡량, 호흡 주기, 사람의 존재 또는 부재 여부 등의 특성이 유추될수 있다. 한편 특성을 그래프의 거리, 길이, 폭, 간격, 색상 등으로 표현하는 시간-거리별 반사 신호 2차원 데이터 이미지 자체가 훈련 데이터로 사용될 수 있지만 이에 한정되지 않는다. 시간-거리별 반사 신호 2차원 데이터 이미지가 훈련 데이터로 사용되는 경우에는, 이후에 진단용 비접촉 센서를 이용하여 획득된 제3 데이터 역시 시간-거리별 반사 신호 2차원 데이터 이미지로 변환되어 예측 모델에 입력될 수 있다. 한편 무선 신호는 시간이 흐름에 따라 계속적으로 수신될 수 있으며, 따라서 비 접촉 센서를 이용하여 획득한 제1 데이터는 시계열적으로 수집되는 데이터일 수 있다. 한편 인공 신경망을 트레이닝 하기 위한 훈련 데이터는, 접촉 센서를 이용하여 획득한 제2 데이터를 포함 할 수 있다. 여기서 접촉 센서는, 사람의 신체에 접촉하여 사람의 맥박 및 호흡 중 적어도 하나를 감지할 수 있는 센서일 수 있다. 예를 들어 비 접촉 센서는, 사람의 호흡을 감지할 수 있는 호흡 마스크, 흉부 벨트, 웨어러블 센서일 수 있으며, 사람의 맥박을 감지할 수 있는 맥박 센서 등의 웨어러블 센서일 수 있다. 한편 접촉 센서를 이용하여 획득한 제2 데이터는, 접촉 센서를 이용하여 획득되는 호흡 신호 또는 맥 박 신호를 나타내는 데이터일 수 있다. 제2 데이터 역시 호흡 신호나 맥박 신호를 다양한 형식으로 표현할 수 있다. 한편 호흡 신호나 맥박 신호는 시간이 흐름에 따라 계속적으로 수신될 수 있으며, 따라서 접촉 센서를 이용하여 획득한 제2 데이터는 시계열적으로 수집되는 데이터일 수 있다. 한편 프로세서는 비 접촉 센서를 이용하여 획득한 제1 데이터 및 접촉 센서를 이용하여 획득한 제2 데이터를 이용하여 인공 신경망을 트레이닝 할 수 있다. 구체적으로 프로세서는 비 접촉 센서를 이용하여 획득한 제1 데이터를 입력으로, 접촉 센서를 이용하 여 획득한 제2 데이터를 출력으로 이용하여 인공 신경망을 트레이닝 할 수 있다. 여기서 제2 데이터 는 인공 신경망이 비 접촉 센서를 이용하여 획득한 데이터를 이용하여 추론해야 하는 정답(또는 결과 값)일 수 있다. 따라서 프로세서는 비 접촉 센서를 이용하여 획득한 제1 데이터에 레이블링 데이터(제2 데이터(13 0))를 레이블링 하여 인공 신경망에 제공할 수 있다. 이 경우 인공 신경망은 제1 데이터와 제2 데이터를 이용하여, 제1 데이터와 제2 데이터의 연관 관계에 대한 함수를 유추할 수 있다. 그리고, 인공 신경망에서 유추된 함수에 대한 평가를 통해 인공 신경 망의 파라미터(가중치(weight), 편향(bias) 등)가 결정(최적화)될 수 있다. 한편 인공 신경망에 제공되는 제1 데이터 및 제2 데이터는 서로 시간적으로 대응할 수 있다. 구체적으로, 인공 신경망에 제공되는 제2 데이터는, 인공 신경망에 함께 제공되는 제1 데이터와 시간 적으로 싱크 된 데이터일 수 있다. 예를 들어 호흡을 하고 있는 사람을 비 접촉 센서로 측정하여 제1 데이터를 획득하고, 동시에, 접촉 센서 를 이용하여 측정함으로써 제2 데이터를 획득할 수 있다. 그리고 프로세서는 시간 동기화된 제1 데이터 및 제2 데이터를 인공 신경망에 제공하여 인공 신 경망을 트레이닝 할 수 있다. 다시 말해서, 프로세서는 동일 시점의 제1 데이터를 입력으로, 동일 시점의 제2 데이터를 출력 으로 이용하여 인공 신경망을 트레이닝 할 수 있다. 한편 프로세서는 사람의 다양한 상태, 다양한 자세, 또는 사람의 부재 상황에서 측정된 제1 데이터 및 제2 데이터를 이용하여 인공 신경망을 트레이닝 할 수 있다. 또한 프로세서는 다양한 환경(복수의 사람이 존재, 텔레비전 음향 등의 노이즈)에서 측정된 제1 데이터 및 제2 데이터를 이용하여 인공 신경망을 트레이닝 할 수 있다.또한 프로세서는 특정 사람을 측정한 제1 데이터 및 제2 데이터를 이용하여 인공 신경망을 트레 이닝 함으로써 개인화된 예측 모델을 생성하거나, 복수의 사람을 측정한 제1 데이터 및 제2 데이터를 이용하여 인공 신경망을 트레이닝 함으로써 글로벌한 예측 모델을 생성할 수도 있다. 한편 인공 신경망을 트레이닝 하기 위한 훈련 데이터는 상태 정보를 더 포함할 수 있다. 여기서 상태 정보는, 호흡 또는 무 호흡 여부, 사람의 동작에 의한 신체 움직임, 사람의 부재 중 적어도 하나에 대한 정보를 포함할 수 있다. 여기서 사람의 동작에 의한 신체 움직임은, 사람의 호흡이나 맥박에 의한 움직임 외에 다른 요인에 의한 움직임 을 의미할 수 있다. 예를 들어 사람의 동작에 의한 움직임은 사람의 자세 변경을 포함할 수 있다. 또한 사람의 부재는, 측정 공간 내에 사람이 존재 하지 않는 것을 의미할 수 있다. 한편 프로세서는 비 접촉 센서를 이용하여 획득한 제1 데이터, 접촉 센서를 이용하여 획득한 제2 데 이터 및 상태 정보를 이용하여 인공 신경망을 트레이닝 할 수 있다. 구체적으로 프로세서는 비 접촉 센서를 이용하여 획득한 제1 데이터를 입력으로, 접촉 센서를 이용하 여 획득한 제2 데이터 및 상태 정보를 출력으로 이용하여 인공 신경망을 트레이닝 할 수 있다. 여기서 제2 데이터와 상태 정보는 인공 신경망이 비 접촉 센서를 이용하여 획득한 데이터를 이용하여 추론 해야 하는 정답(또는 결과 값)일 수 있다. 따라서 프로세서는 비 접촉 센서를 이용하여 획득한 제1 데이터에 레이블링 데이터(제2 데이터 및 상태 정보)를 레이블링 하여 인공 신경망에 제공할 수 있다. 한편 인공 신경망에 제공되는 제1 데이터 및 상태 정보는 시간적으로 서로 대응할 수 있다. 예를 들어 프로세서는 동일 시점의 제1 데이터를 입력으로, 동일 시점의 사람의 부재를 출력으로 이 용하여 인공 신경망을 트레이닝 할 수 있다. 한편 이와 같이 트레이닝 된 인공 신경망을 인공 지능 모델 또는 예측 모델이라 명칭 할 수 있다. 도 3은 본 발명의 실시 예에 따른, 예측 모델이 탑재된, 비 접촉 센서를 이용한 신체 상태 정보 획득 시스템을 설명하기 위한 도면이다. 비 접촉 센서를 이용한 신체 상태 정보 획득 시스템은, 진단용 비 접촉 센서, 통신부, 메모리 , 전원 공급부 및 프로세서를 포함할 수 있다. 진단용 비 접촉 센서는 신체 상태 정보 획득 시스템이 설치된 환경에서, 사람의 신체에 접촉하거나 사람의 신체의 움직임에 의한 압력을 직접적으로 받는 것 없이, 신체의 움직임을 감지할 수 있다. 진단용 비 접촉 센서에는, 앞서 설명한 비 접촉 센서에 대한 설명이 그대로 적용될 수 있다. 한편 트레이닝 된 인공 신경망(631a), 즉 예측 모델은, 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조 합으로 구현될 수 있다. 인공 신경망(631a)의 일부 또는 전부가 소프트웨어로 구현되는 경우, 인공 신경망 (631a)을 구성하는 하나 이상의 명령어는 메모리에 저장될 수 있다. 통신부는 호흡 유도 장치나 기타 장치와 통신하여, 동작 명령이나 기타 데이터를 전송할 수 있다. 프로세서는 비 접촉 센서를 이용한 신체 상태 정보 획득 시스템의 전반적인 동작을 제어할 수 있다. 도 4은 본 발명의 실시 예에 따른, 비 접촉 센서를 이용한 신체 상태 정보 획득 시스템의 동작 방법을 설 명하기 위한 도면이다. 프로세서는 진단용 비 접촉 센서를 이용하여 제3 데이터를 획득할 수 있다. 또한 프로세서는 제3 데이터를 예측 모델에 시계열적으로 입력하여, 제4 데이터를 실 시간으로 추론할 수 있다(420, 430). 여기서 실 시간의 의미는, 진단용 비 접촉 센서에서 연속적으로 획득하는 제3 데이터에 대하여 제4 데이터를 연속적으로 출력하는 것을 의미할 수 있다. 이와 관련해서는 도 5 내지 도 11을 참고하여 더욱 구체적으로 설명한다. 도 5는 제3 데이터를 설명하기 위한 도면이다. 진단용 비 접촉 센서는 무선 신호를 발진하고, 발진된 무선 신호가 반사되면 사람으로부터 반사된 무선 신 호를 수신할 수 있다. 이 경우 프로세서는 수신된 무선 신호를 나타내는 데이터인 제3 데이터를 획득할 수 있다. 도 5에서는 무선 신호의 1회 발진 시 수신되는 무선 신호를 도시하였다. 한편 진단용 비 접촉 센서에서는 시간이 흐름에 따라 계속적으로 무선 신호를 발진 및 수신하기 때문에, 진단용 비 접촉 센서를 이용하여 획득한 제3 데이터는 시계열적으로 수집되는 데이터일 수 있다. 여기서 계속적으로 무선 신호를 발진 및 수신한다는 것의 의미는, 일정한 주기에 따라 연속적으로 무선 신호를 발진 및 수신하는 것을 의미할 수 있다. 한편 제3 데이터는 앞서 설명한 제1 데이터와 같은 유형의 데이터일 수 있다. 예를 들어 제1 데이터가 와 이파이 신호에 대응하는 데이터인 경우, 제3 데이터 역시 와이파이 신호에 대응하는 데이터일 수 있다. 다른 예 를 들어 제1 데이터가 특정 비 접촉 센서에 대응하는 데이터인 경우, 제3 데이터는 특정 비 접촉 센서와 동일한 사양의 센서에 대응하는 데이터일 수 있다. 한편 앞서 설명한, 비 접촉 센서에서 수신하는 무선 신호에 대한 설명은, 진단용 비 접촉 센서에서 수신하 는 무선 신호에도 적용될 수 있다. 또한 앞서 설명한, 제1 데이터에 대한 설명은, 제3 데이터에도 적용될 수 있다. 즉 진단용 비 접촉 센서에서 수신하는 무선 신호는, 무선 신호가 반사되는 면적, 무선 신호의 반사 각도, 비접촉 센서와 반사면 까지의 거리, 신체의 이동 방향 등에 따라, 수신되는 무선 신호의 파형, 진폭, 발진 후 다시 수신되기까지의 시간, 신호의 주파수 등이 달라질 수 있다. 그리고 제3 데이터는 무선 신호에서 나타 나는 특성을 그대로 나타낼 수 있다. 따라서 진단용 비 접촉 센서를 이용하여 획득한 제3 데이터를 통하여, 호흡 또는 무호흡 여부, 자세, 사람의 움직임, 움직임 상태, 호흡 신호, 호흡량, 호흡 주기, 맥박 신호, 사람의 존재 또는 부재 여부 등의 특 성이 유추될 수 있다. 한편 프로세서는 제3 데이터를 예측 모델에 입력하여, 제4 데이터를 추론할 수 있다. 여기서 제4 데이터는 앞서 설명한 제2 데이터와 같은 유형의 데이터일 수 있다. 예를 들어 제2 데이터가 호흡 신호인 경우 제4 데이터 역시 호흡 신호일 수 있으며, 제2 데이터가 맥박 신호인 경우 제4 데이터 역시 맥박 신 호일 수 있다. 한편 앞서 제3 데이터는 시계열적으로 수집되는 데이터임을 설명하였다. 그리고 프로세서는 시계열적으로 수집되는 제3 데이터를, 시간 순서를 유지하면서 예측 모델에 입력할 수 있다. 도 6은 본 발명의 실시 예에 따른, 제3 데이터의 구간 데이터를 예측 모델에 입력하는 방식을 설명하기 위한 도 면이다. 프로세서는 시계열적으로 수집되는 제3 데이터 중 일정 시간 구간의 데이터를 예측 모델에 입력 할 수 있다. 이 경우 예측 모델은, 상기 일정 시간 구간에 대응하는 시간 구간의 제4 데이터를 출력할 수 있다. 그리고 프로세서는 제3 데이터의 구간 데이터를 예측 모델에 시계열 적으로 입력할 수 있다. 구체적 으로 프로세서는 복수의 구간 데이터를 예측 모델에 시계열적으로 입력할 수 있다. 예를 들어 프로세서는 제3 데이터의 제1 구간 데이터를 예측 모델에 입력하고, 제3 데이터의 제 2 구간 데이터를 예측 모델에 입력할 수 있다. 이 경우 제2 구간 데이터는 제1 구간 데이터로부터 시간적으로 이후의 데이터일 수 있으며, 제1 구간과 제2 구간의 크기(시간)는 동일할 수 있다. 이 경우 예측 모델은 시계열 적으로 입력되는 제3 데이터의 구간 데이터를 수신하여, 구간 출력 데이터를 시계 열적으로 출력할 수 있다. 구체적으로 예측 모델은 제3 데이터의 제1 구간 데이터가 입력되면 동일한 구간에 대한 제1 구간 출력 데 이터를 출력하고, 제3 데이터의 제2 구간 데이터가 입력되면 동일한 구간에 대한 제2 구간 출력 데이터를출력할 수 있다. 이와 같은 방식으로 예측 모델은 구간 출력 데이터를 시계열 적으로 출력할 수 있으며, 시계열적으로 출력되는 구간 출력 데이터들을 병합하면, 호흡 또는 맥박 신호를 연결시킨 제4 데이터가 완성될 수 있다. 도 7 내지 도 8은 복수의 구간 데이터를 시계열적으로 입력하는 경우 발생될 수 있는 문제점을 설명하기 위한 도면이다. 앞서 제1 구간 데이터 및 제1 구간 데이터에 비하여 시간적으로 이후의 데이터인 제2 구간 데이터를 설명한 바 있다. 앞으로는 제1 구간 데이터를 제1 프레임의 구간 데이터, 제2 구간 데이터를 제2 프레임의 구간 데이터로 명칭하 여 설명한다. 예측 모델이 무선 신호를 이용하여 호흡 신호를 정확하게 측정하기 위해서는, 일정 시간 영역 이상의 데이터가 필요하다. 따라서 구간 데이터 들 각각은 일정 시간 영역 이상의 데이터를 포함할 수 있다. 예를 들어 제3 데이터의 구간 데이터는, 10초 동안의 무선 신호를 나타내는 데이터일 수 있다. 이 경우 제1 프 레임의 구간 데이터, 제2 프레임의 구간 데이터 및 n 프레임의 구간 데이터는 모두 10초 동안의 무선 신호를 나 타낼 수 있다. 한편 진단용 비 접촉 신호가 실 시간으로 무선 신호를 발진 및 수신 함에 따라, 제3 데이터 역시 실 시간으로 획득되고 있다. 그리고 본 발명은 제3 데이터(무선 신호)를 이용하여 제4 데이터(호흡 신호 또는 맥박 신호)를 실시 간으로 생성해 내는 것을 목표로 한다. 다만 일정 시간 영역의 데이터를 취득하고 난 후에 예측 모델에 입력하는 경우, 일정 시간 영역의 데이터를 취 득하는 동안에는 호흡 및 맥박 신호를 획득할 수 없는 문제가 발생하다. 예를 들어 제3 데이터 중 제1 프레임의 구간 데이터가 시점(start point) 25초부터 종점(end point) 32초 까지의 데이터인 경우, 시점(time point) 32초에서 제1 프레임의 구간 데이터가 모두 확보되어 예측 모델 에 입력된다. 따라서 예측 모델은 시점(time point) 32초 이후에나 시점(time point) 25초에서의 호흡 신호 또 는 맥박 신호를 추론해낼 수 있다. 다른 예를 들어 제3 데이터 중 제2 프레임의 구간 데이터가 시점(start point) 32초부터 종점(end point) 39초까지의 데이터인 경우, 시점(time point) 39초에서 제2 프레임의 구간 데이터가 모두 확보되어 예측 모델에 입력된다. 따라서 예측 모델은 시점(time point) 39초 이후에나 시점(time point) 32초에서의 호흡 신호 또는 맥박 신호를 추론해낼 수 있다. 거기에 시스템 및 예측 모델의 연산시간이 오래 걸리면 추가적인 시간지연이 발생하여 실시간으로 호흡 또 는 맥박을 모니터링하는 데 장애가 된다. 즉 예축 모델에 입력하는 데이터 시간 영역이 클수록 분석의 정확도는 향상될 수 있으나, 해당 시간 영역만큼 데이터가 채워질 때까지 시간 지연이 발생하며, 데이터 시간 영역이 클 수록 데이터 처리 시간 (T)도 더 많이 필요해진다. 이로 인해 추출된 호흡 패턴과 사람의 실제 호흡 시점 사이에 시간차가 커지게 되며, 이는 호흡 또는 맥박 측정 의 실 시간 성에 방해가 되는 요소일 수 있다. 또한 예측 모델은 제3 데이터(무선 신호)의 제1 프레임의 구간 데이터를 입력 받아 제4 데이터(호흡 또는 맥박 신호)의 제1 프레임의 출력 데이터를 추론할 수 있으며, 제3 데이터(무선 신호)의 제2 프레임의 구간 데이터를 입력 받아 제4 데이터(호흡 또는 맥박 신호)의 제2 프레임의 출력 데이터를 추론할 수 있다. 다만 제1 프레임의 구간 데이터와 제2 프레임의 구간 데이터는 시간적으로 중첩되는 중첩 영역이 없 기 때문에, 도 8a에서 도시하는 바와 같이, 제1 프레임의 출력 데이터와 제2 프레임의 출력 데이터 사이에도 시간적으로 중첩되는 중첩 영역이 존재하지 않는다. 이에 따라 도 8b를 참고하면, 제1 프레임의 출력 데이터와 제2 프레임의 출력 데이터의 경계(731, 741) 부분에 큰 오차가 발생할 수 있으며, 추출되는 호흡 또는 맥박 패턴이 불일치 하기 때문에 제2 프레임의출력 데이터를 제1 프레임의 출력 데이터에 맞추는 별도의 보정이 필요한 문제가 발생한다. 그리고 이러한 보정 역시, 호흡 또는 맥박 측정의 실 시간 성에 방해가 되는 요소일 수 있다. 따라서 본 발명은, 제1 프레임과 제2 프레임을 중첩하고, 출력 데이터에 가중치를 부여하는 방식으로 호흡 또는 맥박 측정의 실 시간 성을 보장한다. 도 9 내지 도 10은 호흡 또는 맥박 측정의 실 시간 성을 위한 시스템의 동작 방법을 설명하기 위한 도면이다. 프로세서는 시계열적으로 획득되는 제3 데이터 중 제1 프레임의 구간 데이터를 예측 모델에 입력할 수 있다. 그리고 나서 프로세서는 시계열적으로 획득되는 제3 데이터 중 제1 프레임의 다음 프레임인 제2 프레 임의 구간 데이터를 예측 모델에 입력할 수 있다. 이 경우 제2 프레임는 제1 프레임보다 시간적으로 이후의 프레임일 수 있다. 또한 제2 프레임과 제1 프레임의 시간 간격은 데이터 처리 시간(T)(제3 데이터(무선 신호)를 입력한 후 예측 모델이 제4 데이 터(호흡 또는 맥박 신호)를 출력하기까지의 시간)과 동일할 수 있다. 예를 들어 데이터 처리 시간(T)이 1초인 경우, 제3 데이터 중 제1 프레임의 구간 데이터가 시점(start point) 25초부터 종점(end point) 32초까지의 데이터이며, 제3 데이터 중 제2 프레임의 구간 데이터는 시 점(start point) 26초부터 종점(end point) 33초까지의 데이터일 수 있다. 한편 제1 프레임 및 제2 프레임은 서로에게 중첩되는 중첩 구간을 포함할 수 있다. 구체적으로, 제2 프레임의 일부 구간은 제1 프레임의 일부 구간과 중첩될 수 있다. 또한 제1 프레임 의 일부 구간은 제2 프레임의 일부 구간과 중첩될 수 있다. 예를 들어 제3 데이터 중 제1 프레임의 구간 데이터가 시점(start point) 25초부터 종점(end point) 32초 까지의 데이터인 경우, 제3 데이터 중 제2 프레임의 구간 데이터는 시점(start point) 27초부터 종점(end point) 34초까지의 데이터일 수 있다. 이 경우 제1 프레임과 제2 프레임 사이에는 중첩 구간이 존재할 수 있다. 예를 들어 제1 프레임(91 0)의 구간 데이터와 제2 프레임의 구간 데이터 각각은, 시점(start point) 27초부터 종점(end point) 32 초까지의 중첩 구간의 데이터를 포함할 수 있다. 한편 프로세서는 제1 프레임의 구간 데이터에 기초하여 예측 모델이 출력한 제1 프레임의 출력 데이 터 및 제2 프레임의 구간 데이터에 기초하여 예측 모델이 출력한 제2 프레임의 출력 데이터를 획득할 수 있다. 이 경우 프로세서는 제1 프레임의 출력 데이터 및 제2 프레임의 출력 데이터를 합성할 수 있다. 구체적으로 도 10a를 참고하면, 출력 데이터(930, 940)에서도 제1 프레임 및 제2 프레임은 서로에게 중첩되는 중첩 구간(a)을 포함할 수 있다. 예를 들어, 앞서, 제3 데이터 중 제1 프레임의 구간 데이터가 시점(start point) 25초부터 종점(end point) 32초까지의 데이터인 경우, 제3 데이터 중 제2 프레임의 구간 데이터는 시점(start point) 27초부 터 종점(end point) 34초까지의 데이터일 수 있다고 설명한 바 있다. 이 경우 출력 데이터인 제4 데이터 중 제1 프레임의 출력 데이터 역시 시점(start point) 25초부터 종점 (end point) 32초까지의 데이터일 수 있으며, 제4 데이터 중 제2 프레임의 출력 데이터는 시점(start point) 27초부터 종점(end point) 34초까지의 데이터일 수 있다. 그리고 프로세서는 제1 프레임의 출력 데이터에, 제1 프레임과 중첩되지 않는 제2 프레임의 일 부 구간(c)의 출력 데이터를 합성할 수 있다. 다만 이는 합성 방식의 일 예일뿐으로, 제1 프레임의 출력 데이터 와 제2 프레임의 출력 데이터는 다양한 방식으로 합성될 수 있다. 동일한 방식으로, 프로세서는 제2 프레임의 구간 데이터에 기초하여 예측 모델이 출력한 제2 프레임 의 출력 데이터 및 제3 프레임의 구간 데이터에 기초하여 예측 모델이 출력한 제3 프레임의 출력 데이터를 획득할 수 있다. 그리고 제3 프레임의 출력 데이터 역시, 앞서 기 합성된 출력 데이터에 합성될 수 있다. 그리고 이와 같은 방식 을 반복함에 따라 제4 데이터(맥박 신호 또는 호흡 신호)가 시계열적으로, 그리고 연속적으로 생성될 수 있다. 즉 입력 데이터가 버퍼에 저장되는 것으로 가정하여 설명하면, 본 발명은, 데이터 처리 시간 동안 버퍼 내 가장 오래된 데이터들을 지우고 최신의 데이터를 채운 후, 데이터 처리가 끝남과 동시에 버퍼 내 데이터를 예측 모델 에 새롭게 입력하는 방식을 취한다. 따라서 본 발명에 따르면, 다음 호흡 패턴 추출까지의 시간 지연을 데이터 처리 시간(T) 수준으로 줄일 수 있는 장점이 있다. 이에 따라 추출된 호흡 패턴과 사람의 실제 호흡 시점 사이의 시간차를 최소화 할 수 있기 때문에, 호흡 또는 맥박을 실 시간으로 측정할 수 있는 장점이 있다. 한편 본 발명은 제1 프레임과 제2 프레임의 중첩 구간이 존재하기 때문에, 제1 프레임의 구간 데이터와 제2 프 레임의 구간 데이터가 상당 부분 동일하다. 따라서 도 8에서 설명한 제1 프레임과 제2 프레임의 중첩 구간이 존재하지 않는 경우에 비해, 출력 데이터 간의 경계 부분의 오차가 작을 수 있다. 다만 예측 모델에 입력되는 입력 데이터가 완전히 동일하지는 않기 때문에, 인공 신경망의 한계 상, 예측 모델 의 출력 값 역시 다소 바뀔 수 있다. 따라서 제1 프레임의 출력 데이터와 제2 프레임의 출력 데이터 사이에는 다소 간의 차이가 발생할 수 있다. 예 를 들어 동일 시점에서, 제1 프레임의 출력 데이터는 0.4의 호흡 상태를 나타내는데 반해 제2 프레임의 출력 데 이터는 0.3의 호흡 상태를 나타낼 수 있다. 따라서 제1 프레임의 출력 데이터와 제2 프레임의 출력 데이터를 적절하게 합성할 수 있는 방안이 요구된다. 따라서 프로세서는 제1 프레임의 출력 데이터 및 제2 프레임의 출력 데이터에 가중치를 부여하 여, 제1 프레임의 출력 데이터 및 제2 프레임의 출력 데이터를 합성할 수 있다. 구체적으로 중첩 구간(a)에서, 중첩 구간(a)의 종점(end point)으로 갈수록, 제2 프레임의 출력 데이터에 부여되는 가중치는 증가하고 제1 프레임의 출력 데이터에 부여되는 가중치는 감소할 수 있다. 반대로 중첩 구간(a)에서, 중첩 구간(a)의 시점(start point)으로 갈수록, 제2 프레임의 출력 데이터에 부 여되는 가중치는 감소하고 제1 프레임의 출력 데이터에 부여되는 가중치는 증가할 수 있다. 예를 들어 출력 데이터인 제4 데이터 중 제1 프레임의 출력 데이터 역시 시점(start point) 25초부터 종점 (end point) 32초까지의 데이터일 수 있으며, 제4 데이터 중 제2 프레임의 출력 데이터는 시점(start point) 27초부터 종점(end point) 34초까지의 데이터일 수 있다. 이 경우 중첩 구간(a)은 시점(start point) 27초부터 종점(end point) 32초까지일 수 있다. 그리고 중첩 구간(a)에서 종점(end point)인 32초로 갈수록 제2 프레임의 출력 데이터에 부여되는 가중치 는 증가하고, 제1 프레임의 출력 데이터에 부여되는 가중치는 감소할 수 있다. 반대로 중첩 구간(a)에서 시점(start point)인 27초로 갈수록 제2 프레임의 출력 데이터에 부여되는 가중 치는 감소하고, 제1 프레임의 출력 데이터에 부여되는 가중치는 증가할 수 있다. 그리고 프로세서는 제1 프레임의 출력 데이터에 제1 가중치를 적용하고, 제2 프레임의 출력 데이터에 제2 가중치를 부여하여 제1 프레임의 출력 데이터 및 제2 프레임의 출력 데이터를 합성할 수 있다. 그리고 제1 가중치와 제2 가중치의 합은 1일 수 있다. 예를 들어 시점(start point)인 27초에서, 제1 프레임의 출력 데이터에 부여되는 가중치는 1, 제2 프레임 의 출력 데이터에 부여되는 가중치는 0일 수 있다. 다른 예를 들어 29초 지점에서, 제1 프레임의 출력 데이터에 부여되는 가중치는 0.4, 제2 프레임의 출력 데이터에 부여되는 가중치는 0.6일 수 있다. 또 다른 예를 들어 종점(end point)인 32초에서, 제1 프레임의 출력 데이터에 부여되는 가중치는 0, 제2 프레임의 출력 데이터에 부여되는 가중치는 1일 수 있다. 이와 같은 가중치 부여 방식은 인공 신경망의 특성을 반영하여 더 정확한 추론을 하기 위함이다. 구체적으로 예측 모델이 하나의 프레임의 중앙 부분을 추론하는 경우에는, 프레임의 좌측 및 우측의 입력 데이 터를 모두 가지고 있기 때문에, 프레임의 중앙 부분에 대한 예측의 정확도가 높을 수 있다. 다만 프레임의 좌측 끝의 경우에는, 더 좌측의 입력 데이터가 존재하지 않는다. 또한 프레임의 우측 끝의 경우 에는, 더 우측의 입력 데이터가 존재하지 않는다. 따라서 프레임의 좌우 끝으로 갈수록 예측의 정확도가 낮아질 수 있다. 한편 중복 구간(a)의 시점(start point)에서, 제1 프레임의 출력 데이터는 예측 모델이 시점(start point)의 좌 측에 대한 입력 데이터를 가지고 예측한 데이터이다. 반면에 제2 프레임의 출력 데이터는 예측 모델이 시점 (start point)의 좌측에 대한 입력 데이터 없이 예측한 데이터이다. 이러한 경우 제1 프레임의 출력 데이터의 정확도가, 제2 프레임의 출력 데이터의 정확도보다 높을 수 있다. 반면에 중복 구간(a)의 종점(end point)에서, 제1 프레임의 출력 데이터는 예측 모델이 종점(end point)의 우측 에 대한 입력 데이터 없이 예측한 데이터이다. 반면에 제2 프레임의 출력 데이터는 예측 모델이 종점(end point)의 우측에 대한 입력 데이터를 가지고 예측한 데이터이다. 이러한 경우 제2 프레임의 출력 데이터의 정확 도가, 제1 프레임의 출력 데이터의 정확도보다 높을 수 있다. 따라서 본 발명은, 중첩 구간의 시점으로 갈수록 제1 프레임의 출력 데이터에 적용되는 가중치를 증가시키고, 중첩 구간의 종점으로 갈수록 제2 프레임의 출력 데이터에 적용되는 가중치를 증가시킴으로써, 예측의 정확도를 향상시킬 수 있다. 또한 본 발명은 중첩 구간에서 가중치 함수를 활용함으로써 끝단을 일치 시키기 위한 별도의 보정 없이도 신호 의 연속성을 유지하면서 중첩 영역을 합성할 수 있는 장점이 있다. 한편 도 10b, 10c에서는 가중치가 선형적으로 변화하는 것으로 도시하였으나 이에 한정되지 않는다. 한편 제2 프레임과 중첩되지 않는 제1 프레임의 일부 구간(b)에서, 프로세서는 제2 프레임의 출력 데이터의 반 영 없이 제1 프레임의 출력 데이터를 반영하여 합성을 수행할 수 있다. 이를 수학적으로 표현하면, 제2 프레임과 중첩되지 않는 제1 프레임의 일부 구간(b)에서, 제1 프레임의 출력 데 이터에 부여되는 가중치는 1이며, 제2 프레임의 출력 데이터에 부여되는 가중치는 0이다. 또한 제1 프레임과 중첩되지 않는 제2 프레임의 일부 구간(c)에서, 프로세서는 제1 프레임의 출력 데이터의 반 영 없이 제2 프레임의 출력 데이터를 반영하여 합성을 수행할 수 있다. 이를 수학적으로 표현하면, 제1 프레임과 중첩되지 않는 제2 프레임의 일부 구간(c)에서, 제2 프레임의 출력 데 이터에 부여되는 가중치는 1이며, 제1 프레임의 출력 데이터에 부여되는 가중치는 0이다. 즉 제1 프레임은 제2 프레임에 비하여 시간적으로 이전의 프레임이며, 예측 모델은 제2 프레임의 예측 시 구간 a에 대한 예측을 수행하지 않았다. 따라서 구간 a에서는 제1 프레임의 출력 데이터만이 반영되어 제4 데이터로 써 출력될 수 있다. 또한 제2 프레임은 제1 프레임에 비하여 시간적으로 이후의 프레임이며, 예측 모델은 제1 프레임의 예측 시 구 간 c에 대한 예측을 수행하지 않았다. 따라서 구간 c에서는 제2 프레임의 출력 데이터만이 반영되어 제4 데이터 로써 출력될 수 있다. 한편 중첩 구간(a)의 종점(end point)에서 제2 프레임의 출력 데이터에 부여되는 가중치는, 제1 프레임과 중첩되지 않는 제2 프레임의 일부 구간(c)에서 제2 프레임의 출력 데이터에 부여되는 가중치와 동일할 수 있다. 예를 들어 제1 프레임과 중첩되지 않는 제2 프레임의 일부 구간(c)에서, 제2 프레임의 출력 데이터에 부여되는 가중치는 1일 수 있다. 또한 중첩 구간(a)의 종점(end point)에서 제2 프레임의 출력 데이터에 부여되는 가중치는 1일 수 있다. 즉 본 발명은, 중첩 구간이 끝나는 지점의 제2 프레임의 가중치와 중첩 구간 이후의 제2 프레임의 가중치를 동 일하게 함으로써, 중첩 구간이 끝나는 지점에서도 끝단을 일치 시키기 위한 별도의 보정 없이도 신호의 연속 성 을 유지할 수 있는 장점이 있다. 한편 앞서 설명한 방식으로 프로세서는 제3 프레임의 출력 데이터, 제4 프레임의 출력 데이터, 제n 프레임의 출 력 데이터를 계속적으로 출력하고, 이들을 합성함으로써, 제4 데이터(호흡 또는 맥박 신호)를 지속적으로 생성할 수 있다. 도 11은 본 발명의 실시 예에 따른 다중 프로세서를 이용한 데이터 처리 방법을 설명하기 위한 도면이다. 예측 모델이 입력 데이터를 이용하여 출력 데이터를 출력 하는 과정은 프로세서의 데이터 처리에 의해 수행되는 것이다. 프로세서의 데이터 처리 속도가 증가하는 경우, 다음 호흡 또는 맥박 신호를 추출하는데 걸리는 시간도 감소할 수 있다. 예를 들어 본 발명에서, 프로세서가 제3 데이터(무선 신호) 및 예측 모델을 이용하여 제4 데이터(호흡 또는 맥 박 신호)를 출력하기까지 데이터 처리에 걸리는 시간이 1초라면, 모니터에는 호흡 또는 맥박 신호가 1초마다 갱 신이 되어 출력될 수 있다. 따라서, 데이터 처리를 위한 복수의 프로세서를 같은 시간 간격으로 순차적으로 작동 시키면, 호흡 또는 맥박 신호를 추출하는데 걸리는 시간을 해당 시간 간격만큼 단축시킬 수 있다. 구체적으로 프로세서는 다중 프로세서를 포함할 수 있다. 그리고 다중 프로세서 중 제1 프로세서는, 예측 모델을 이용하여 제1 프레임의 구간 데이터를 처리함으로 써, 제1 프레임의 출력 데이터를 획득할 수 있다. 또한 다중 프로세서 중 제2 프로세서는, 예측 모델을 이용하여 제2 프레임의 구간 데이터를 처리함으로써, 제2 프레임의 출력 데이터를 획득할 수 있다. 프로세서가 두 개인 경우에는, 두 개의 프로세서가 교번적으로 순차적으로 입력되는 구간 데이터를 처리할 수 있다. 예를 들어 제1 프로세서는 제3 프레임의 구간 데이터를 처리함으로써 제3 프레임의 출력 데이터 를 획득할 수 있으며, 제2 프로세서는 제4 프레임의 구간 데이터를 처리함으로써 제4 프레임의 출 력 데이터를 획득할 수 있다. 한편 다중 프로세서의 프로세서 개수는 두 개에 한정되지 않으며, 세 개 이상의 프로세서가 순차적으로 동작하 여, 순차적으로 입력되는 구간 데이터를 처리할 수 있다. 단일 프로세서를 사용하는 경우, 하나의 프로세서의 데이터 처리 속도가 2초라고 가정하면, 호흡 또는 맥박 신 호가 2초마다 갱신이 되어 출력될 수 있다. 다만 두 개의 프로세서를 사용한다고 가정하는 경우, 새로운 데이터를 1초 마다 입력할 수 있기 때문에, 호흡 또는 맥박 신호가 1초마다 갱신이 되어 출력될 수 있다. 즉, 추출된 호흡 패턴과 사람의 실제 호흡 시점 사이의 시간차가 더욱 줄어들기 때문에, 호흡 또는 맥박 측정을 실 시간으로 수행할 수 있게 한다. 한편 도 2에서는, 비 접촉 센서를 이용하여 획득한 제1 데이터, 접촉 센서를 이용하여 획득한 제2 데이터 및 상태 정보를 이용하여 인공 신경망을 트레이닝 할 수 있다고 설명한 바 있다. 이 경우 프로세서는 제3 데이터(무선 신호)를 예측 모델에 입력하여, 제2 데이터와 같은 유형의 제4 데이 터 및 상태 정보를 추론할 수 있다. 예를 들어 프로세서는 사람의 호흡 신호와 함께, 무 호흡 여부, 사람의 부재 여부 등을 획득할 수 있다. 호흡 신호만으로는, 현재 상태의 정확한 판단이 어려운 경우가 있다. 제4 데이터만으로는, 호흡 신호가 없는 것 이 무호흡에 의한 것인지 또는 사람의 부재에 의한 것인지 판단하지 못할 수 있다. 다만 본 발명에 따르면, 무선 신호를 이용하여 상태 정보를 파악함으로써, 더욱 정확한 예측을 수행할 수 있는 장점이 있다. 도 12는 무호흡으로 판단된 경우의 동작 방법을 설명하기 위한 도면이다. 제4 데이터, 또는 제4 데이터 및 상태 정보에 기초하여, 프로세서는 무 호흡 여부를 결정할 수 있다. 그리고 무 호흡이 결정되는 경우, 프로세서는 호흡 유도 장치에 자극 수행 명령을 전송할 수 있다. 호흡 유도 장치는 사람의 신체에 부착되어 기도 부근을 전기적 자극(경피적 전기 신경 자극 (transcutaneous electrical nerve stimulation, TENS))하는 장치로써, 자극을 통하여 기도를 여는 것이 가능 하다.종래에는 수면 중 무 호흡 증상을 진단하기 위하여 수면 다원 검사를 수행하였으나, 이는 1회에 50만원 이상의 비용이 소요되며, 평소 수면환경과 다른 병원 내의 수면실에서 각종 접촉센서를 머리와 몸에 부착하고 수면을 취해야 한다는 점에서 환자입장에서 매우 불편하였다. 다만 본 발명에 따르면, 사람의 주변에 비 접촉식 센서를 설치하는 것 만으로 호흡 또는 맥박 패턴을 획득할 수 있고, 무 호흡 등의 장애 발생까지 감지할 수 있는 장점이 있다. 따라서 가정 내에서, 적은 비용으로, 사람의 수면이나 활동을 방해하지 않고, 맥박 또는 호흡 상태와 장애 발생 까지 감지할 수 있다. 또한 본 발명은 딥 러닝 알고리즘을 사용함으로써, 비접촉 센서의 신호에 대해서 별도의 신호처리가 불필요하다. 또한 사전에 다양한 상황에 대하여 딥 러닝 알고리즘을 트레이닝 함으로써, 종래의 신호처리로 분석이 어렵던 (예: 수면자가 2명 이상인 경우, 주변 소음이 존재하는 경우, 애견이 활동하는 경우 등) 호흡 또는 맥박 상태를 추출해 낼 수 있는 장점이 있다. 또한 본 발명은 맥박 및 호흡 상태를 실 시간으로 측정하면서, 사람의 상태에 이상이 생긴 경우 즉각적인 조치 가 가능한 장점이 있다. 예를 들어 무 호흡 발생한 즉시, 무선으로 기도 부근의 패치(호흡 유도 장치)에 신호를 보내어, 전기적 자극을 통해 기도를 확보하는 비침습적 치료가 가능하다. 한편 본 발명의 적용 범위는 호흡 유도 장치의 동작에 한정되지 않으며, 다른 스마트 수면 기기와 연동하여 동 작할 수 있다. 예를 들어 무호흡이나 수면 장애 발생 시, 시스템은 배개나 침대를 움직임으로써 호흡 상태 를 즉각적으로 유도하는 것도 가능하다. 또한 무 맥박 또는 무 호흡 등의 긴급 상황 발생 시, 시스템은 병원 내 간호 데스크, 원격 진료 병원, 119 안전 신고 센터, 보호자 등에 통지를 즉각적으로 전송할 수 있다. 또한 시스템은 수집한 호흡 신호나 맥박 신호를 원격 진료 병원에 전송하여, 원격 진료를 용이하게 할 수 있는 장점이 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다. 또한, 상기 컴 퓨터는 서버의 프로세서를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석 되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2019-0045662", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른, 인공 신경망의 학습 장치의 구성을 나타낸 블록도이다. 도 2는 본 발명의 실시 예에 따른, 인공 신경망의 트레이닝 방법을 설명하기 위한 도면이다. 도 3은 본 발명의 실시 예에 따른, 예측 모델이 탑재된, 비 접촉 센서를 이용한 신체 상태 정보 획득 시스템을 설명하기 위한 도면이다. 도 4은 본 발명의 실시 예에 따른, 비 접촉 센서를 이용한 신체 상태 정보 획득 시스템의 동작 방법을 설명하기 위한 도면이다. 도 5는 제3 데이터를 설명하기 위한 도면이다. 도 6은 본 발명의 실시 예에 따른, 제3 데이터의 구간 데이터를 예측 모델에 입력하는 방식을 설명하기 위한 도 면이다. 도 7 내지 도 8은 복수의 구간 데이터를 시계열적으로 입력하는 경우 발생될 수 있는 문제점을 설명하기 위한 도면이다. 도 9 내지 도 10은 호흡 또는 맥박 측정의 실 시간 성을 위한 시스템의 동작 방법을 설명하기 위한 도면이다. 도 11은 본 발명의 실시 예에 따른 다중 프로세서를 이용한 데이터 처리 방법을 설명하기 위한 도면이다. 도 12는 무호흡으로 판단된 경우의 동작 방법을 설명하기 위한 도면이다."}
