{"patent_id": "10-2021-0045162", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0139036", "출원번호": "10-2021-0045162", "발명의 명칭": "선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트", "출원인": "한국전력공사", "발명자": "최호진"}}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 디바이스를 포함하는 클라이언트; 및인공지능 시스템으로 구현되는 서버;를 포함하고,상기 클라이언트는,상기 서버를 통해 분류하고 싶은 데이터를 상기 서버에 제공하며, 상기 서버는,상기 클라이언트로부터 제공받은 데이터를 처리하고 그 결과를 클라이언트에게 반환해주며, 이 때 상기 클라이언트로부터 제공받은 데이터에 대해서 도메인에 맞게 분류를 하고, 분류 결과와 그에 대한 시각설명을 함께 제공하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에대한 히트맵 생성 장치."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 서버는,상기 클라이언트로부터 받은 데이터를 인공 신경망 모델을 이용하여 분류하는 인공 신경망 분류기;상기 인공 신경망 분류기가 분류한 결과에 대한 시각설명을 생성하는 관련성 스코어 계산 모듈; 및상기 인공 신경망 분류기에서 계산된 각 레이어별 관련성 스코어를 계산하는 과정에서 해당 레이어에 속한 적어도 하나 이상의 활성 함수 값들 각각에 대하여 선택할지 여부를 결정하는 역할을 수행하는 뉴런 선택 모듈;을포함하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 상기 인공 신경망 분류기는,순방향 신경망, 합성곱 신경망, 및 순환 신경망 중 적어도 어느 하나를 포함하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 상기 관련성 스코어 계산 모듈은,상기 인공 신경망 분류기의 예측 결과와 내부적으로 학습된 가중치 값들 및 활성 함수 값들을 이용하여 관련성스코어를 인공 신경망의 레이어별로 계산하며,이를 위해 인공 신경망에서 가장 마지막 레이어부터 입력 레이어까지 분류 방향과 반대로 역전파(Backpropagation)를 수행하며, 또한 마지막에 계산되는 입력 레이어에서의 관련성 스코어는 입력된 데이터의 차원과동일한 차원을 갖도록 계산되는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치.공개특허 10-2022-0139036-2-청구항 5 제 1항에 있어서, 상기 서버는,이미지가 입력되면, 관련성 스코어도 동일하게 입력된 이미지와 같은 차원의 히트맵으로 계산하며, 계산한 히트맵 내 각 픽셀의 의미는 해당 픽셀이 분류 예측 결과에 얼마만큼 기여하였는지를 나타내는 관련성 스코어인 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서, 상기 관련성 스코어 계산 모듈은,역방향 전파로써 계산이 진행되며, 모든 숨겨진 층을 역으로 추적하여 관련성 스코어를 계산하여 히트맵 시각설명을 제공하되,상기 히트맵 시각설명은,입력 데이터와 같은 크기로써 생성되며, 히트맵을 구성하는 각 픽셀은 0 이상의 관련성 스코어가 부여되고, 픽셀에 부여된 관련성 스코어의 값이 클수록 제1 지정된 색에 가까운 색으로, 0에 가까울수록 제2 지정된 색에 색으로 표현되는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측결과에 대한 히트맵 생성 장치."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서, 상기 관련성 스코어 계산 모듈은,아래의 수학식1을 바탕으로 선택적 레이어별 관련성 스코어 전파를 이용하여 관련성 스코어를 계산하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치.(수학식 1)여기서 는 번째 숨겨진 층에서의 번째 활성 함수 출력값, 는 번째 숨겨진 층의 번째 뉴런에서 번째 숨겨진 층의 번째 뉴런을 연결하는 가중치, 는 번째 숨겨진 층의 번째 뉴런에 해당하는 바이어스 값,는 포워드 패스 과정에서 이전 레이어(l)에 특정 뉴런(j번째)과 연결된 다음 레이어()의 뉴런(k번째) 사이의 값을 계산하는 과정에서 나오는 중간 값,는 다음 레이어()에서의 k 번째 뉴런의 포워드 패스 값을 계산하기 위해 연결된 모든 이전 레이어()의 뉴런들의 값과 가중치, 바이어스(b) 값들을 합친 값."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서, 상기 관련성 스코어 계산 모듈은,공개특허 10-2022-0139036-3-아래의 수학식 2를 바탕으로, 상기 수학식 1의 값과 레이어별 관련성 전파를 이용하여 번째 숨겨진 층의 번째뉴런에서 번째 숨겨진 층의 번째 뉴런으로 전달되는 관련성 스코어를 계산하는 것을 특징으로 하는 선택적레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치.(수학식 2)여기서 는 앞 레이어의 특정 뉴런의 활성 함수 값을 선택할지에 대한 여부를 결정하는 출력층에 대한 뉴런의기울기,에서 R값은 관련성(relevance) 값을 나타내며, 관련성 전파 과정에서 각 레이어 사이에서 계산되는 값,는 번째 레이어의 k번째 뉴런에서 번째 레이어의 j번째 뉴런으로의 관련성 값."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7항에 있어서, 상기 관련성 스코어 계산 모듈은,수학식 3을 바탕으로, 번째 숨겨진 층의 모든 뉴런에서 번째 숨겨진 층의 번째 뉴런으로 전달되는 관련성스코어를 계산하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의예측 결과에 대한 히트맵 생성 장치.(수학식 3)여기서, 은 최종적으로 l번째 레이어의 j번째 뉴런의 관련성 값을 계산한 값."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8항 또는 제 9항에 있어서,상기 계산된 뉴런의 기울기()가 음수인 경우 관련성 스코어를 갖지 않으며, 상기 계산된 뉴런의 기울기()가 양수인 경우 관련성 스코어를 그대로 갖게 되는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "클라이언트가 서버를 통해 분류하고 싶은 데이터를 상기 서버에 제공하며, 상기 서버가, 상기 클라이언트로부터제공받은 데이터를 처리하고 그 결과를 클라이언트에게 반환해주며, 이 때 상기 클라이언트로부터 제공받은 데이터에 대해서 도메인에 맞게 분류를 하고, 분류 결과와 그에 대한 시각설명을 함께 제공하는 선택적 레이어별관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 방법에 있어서, 상기 서버가,상기 데이터에 대해 미리 정의된 분류 집합중 하나의 분류로 예측하는 인공 신경망 분류를 수행하는 단계; 상기 분류 결과와 분류 과정에서 계산된 인공 신경망 내 가중치 행렬 및 활성 함수 값들을 활용하여 인공 신경망의 각 레이어별로 관련성 스코어를 계산하고, 입력층에서의 관련성 스코어를 히트맵을 통해 시각화하여 시각공개특허 10-2022-0139036-4-설명을 생성하는 단계; 및 상기 각 레이어의 관련성 스코어를 계산하는 과정 중 활성 함수를 사용할 뉴런과 사용하지 않을 뉴런을 선택하는 뉴런 선택 단계;를 포함하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 방법."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서, 상기 데이터에 대해 미리 정의된 분류 집합중 하나의 분류로 예측하는 인공 신경망 분류를수행하는 단계에서,상기 인공 신경망 기반 데이터의 정확한 분류를 위하여,상기 서버가,정답이 포함된 복수의 데이터를 이용하여 인공 신경망을 학습하는 단계; 및 학습된 인공 신경망 모델을 이용하여 새로운 데이터를 분류하는 단계;를 더 포함하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 방법."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11항에 있어서, 상기 뉴런 선택 단계는,상기 서버가,출력층에 대한 해당 뉴런의 기울기가 양수일 경우 해당 뉴런을 선택하고, 해당 뉴런의 기울기가 음수일 경우 해당 뉴런을 선택하지 않는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 방법."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 11항에 있어서, 상기 서버는,아래의 수학식1을 바탕으로 선택적 레이어별 관련성 스코어 전파를 이용하여 관련성 스코어를 계산하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 방법.(수학식 1)여기서 는 번째 숨겨진 층에서의 번째 활성 함수 출력값, 는 번째 숨겨진 층의 번째 뉴런에서 번째 숨겨진 층의 번째 뉴런을 연결하는 가중치, 는 번째 숨겨진 층의 번째 뉴런에 해당하는 바이어스 값,는 포워드 패스 과정에서 이전 레이어(l)에 특정 뉴런(j번째)과 연결된 다음 레이어()의 뉴런(k번째) 사이의 값을 계산하는 과정에서 나오는 중간 값,는 다음 레이어()에서의 k 번째 뉴런의 포워드 패스 값을 계산하기 위해 연결된 모든 이전 레이어()의 뉴런들의 값과 가중치, 바이어스(b) 값들을 합친 값.공개특허 10-2022-0139036-5-청구항 15 제 14항에 있어서, 상기 서버는,아래의 수학식 2를 바탕으로, 상기 수학식 1의 값과 레이어별 관련성 전파를 이용하여 번째 숨겨진 층의 번째뉴런에서 번째 숨겨진 층의 번째 뉴런으로 전달되는 관련성 스코어를 계산하는 것을 특징으로 하는 선택적레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 방법.(수학식 2)여기서 는 앞 레이어의 특정 뉴런의 활성 함수 값을 선택할지에 대한 여부를 결정하는 출력층에 대한 뉴런의기울기,에서 R값은 관련성(relevance) 값을 나타내며, 관련성 전파 과정에서 각 레이어 사이에서 계산되는 값,는 번째 레이어의 k번째 뉴런에서 번째 레이어의 j번째 뉴런으로의 관련성 값."}
{"patent_id": "10-2021-0045162", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14항에 있어서, 상기 서버는,수학식 3을 바탕으로, 번째 숨겨진 층의 모든 뉴런에서 번째 숨겨진 층의 번째 뉴런으로 전달되는 관련성스코어를 계산하는 것을 특징으로 하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의예측 결과에 대한 히트맵 생성 방법.(수학식 3)여기서, 은 최종적으로 l번째 레이어의 j번째 뉴런의 관련성 값을 계산한 값."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치에 관한 것으로, 사용자 디바이스를 포함하는 클라이언트; 및 인공지능 시스템으로 구현되는 서버;를 포함하 고, 상기 클라이언트는, 상기 서버를 통해 분류하고 싶은 데이터를 상기 서버에 제공하며, 상기 서버는, 상기 클 라이언트로부터 제공받은 데이터를 처리하고 그 결과를 클라이언트에게 반환해주며, 이 때 상기 클라이언트로부 터 제공받은 데이터에 대해서 도메인에 맞게 분류를 하고, 분류 결과와 그에 대한 시각설명을 함께 제공한다."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치 및 방법에 관한 것으로, 보다 상세하게는 딥러닝을 사용한 이미지 분류 및 감정 분류 모델에서의 예측 결 과에 대한 시각적 설명을 제공함으로써, 기존의 해석이 어려운 딥러닝 모델의 설명력을 높일 수 있도록 하는, 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 주어진(또는 제시되거나 제공받은) 이미지나 텍스트를 분류하는 것은 사용자 혹은 시스템으로부터 주어진 이미지 혹은 텍스트에 대해 미리 정의된 분류 집합 내에서 어떤 분류에 해당하는지 예측하는 것을 말한 다. 최근 인공지능 기술이 발전하면서 인공 신경망 모델을 이용해 주어진 데이터셋으로부터 특성을 학습하는 딥 러 닝 방식이 여러 분류 문제에서 많이 사용되고 있으며, 여러 분야에서 좋은 성능을 보여주고 있다. 그런데 인공 신경망에는 학습된 모델의 예측 결과만 출력하기 때문에 예측이 실패한 경우 사용자는 이유를 알 수 없다는 문제점이 있어서 신뢰도 문제나 투명성 문제가 발생할 수 있다. 이러한 문제를 해결하기 위해서는 인 공 신경망 기반의 학습된 모델로부터 예측 결과의 이유에 대한 설명을 제공해야 한다."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 발명의 배경기술은 대한민국 공개특허 10-2020-0058297호(2020.05.27. 공개, 설명 가능한 소수샷 영상 분류 방법 및 장치)에 개시되어 있다. 이는 적대적 생성 신경망과 소수샷 학습을 이용해 영상을 분류하고 그에 대한 설명이 가능한 방법을 제안하는 것이나, 영상 분류 태스크와 소수샷 분류 문제에 한해 설명을 제공하므로, 일반 적으로 많이 쓰이는 깊은 인공 신경망에 대해서는 적용되지 못하며, 텍스트 분류와 같이 순환 신경망(Recurrent Neural Network)을 이용하는 문제에 대해서도 적용되지 못하는 문제점이 있다."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "본 발명의 다른 배경기술은 대한민국 공개특허 10-2017-7030274호(2017.12.06. 공개, 인공 신경망들에 대한 관 련성 스코어 할당)에 개시되어 있다. 이는 레이어별 관련성 전파(layer-wise relevance propagation)를 통해 관련성 스코어(relevance score)를 계산하고, 이를 활용하여 예측 결과에 대한 설명을 제공하려고 시도하는 것 이다. 이렇게 생성된 설명은 히트맵(Heatmap)을 통해 제공되는데, 이 히트맵의 각 픽셀에는 관련성 스코어가 부 여되며, 이 관련성 스코어는 값이 높을수록 해당 픽셀이 인공 신경망의 예측에 대해 주요한 기여를 했다고 판단"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "되는 것이다. 그러나 상기 배경기술로 만들어진 히트맵을 활용하는 데에는 한계가 존재한다. 첫째, 설명의 목적 이 되는 종류(Target class)와 관계없는 부분도 높은 관련성 스코어를 갖는, 즉 노이즈가 많다는 문제점이 있다. 즉, 히트맵에서는 설명의 목적이 되는 대상(Target object)이 아닌 영역에 위치한 픽셀은 낮은 값을 가져"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 5, "content": "야 한다. 그러나 상기 배경기술에서 만들어진 히트맵에서는 설명의 목적이 되는 대상이 아닌 영역에 위치한 픽 셀에도 높은 관련성 스코어가 부여된다. 이는 레이어별 관련성 전파를 이용해 만들어진 히트맵의 설명력이 낮음"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 6, "content": "을 의미하고, 사람이 판단하기에 정확한 설명을 제공한다고 할 수 없다. 또한 상기 배경기술은 레이어별 관련성 전파를 이용하면 설명의 목적이 되는 종류가 달라져도 거의 비슷한 형태의 히트맵이 생성되는데, 즉, 이는 설명 하려는 대상이 달라지는데도 제공되는 설명이 비슷하다는 것을 의미하므로 정확한 설명이 제공된다고 할 수 없 다."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 본 발명은 상기와 같은 문제점을 해결하기 위해 창작된 것으로서, 딥러닝을 사용 한 이미지 분류 및 감정 분류 모델에서의 예측 결과에 대한 시각적 설명을 제공함으로써, 기존의 해석이 어려운 딥러닝 모델의 설명력을 높일 수 있고, 인공지능 기반 시스템의 신뢰도를 향상시킬 수 있으며, 또한 상기 시각 적 설명 생성에서 기존의 알고리즘 보다 적은 노이즈를 생성하여 좀 더 깨끗한 히트맵을 제공하여 설명력을 향 상시킬 수 있도록 하는, 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대 한 히트맵 생성 장치 및 방법을 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치는, 사용자 디바이스를 포함하는 클라이언트; 및 인공지능 시스템으로 구현되는 서버;를 포함하고, 상기 클라이언트는, 상기 서버를 통해 분류하고 싶은 데이터를 상기 서버에 제공하며, 상기 서버는, 상기 클라이언트로부터 제공받은 데이터를 처리하고 그 결과를 클라이언트에게 반환해주며, 이 때 상기 클라이 언트로부터 제공받은 데이터에 대해서 도메인에 맞게 분류를 하고, 분류 결과와 그에 대한 시각설명을 함께 제 공하는 것을 특징으로 한다. 본 발명에 있어서, 상기 서버는, 상기 클라이언트로부터 받은 데이터를 인공 신경망 모델을 이용하여 분류하는 인공 신경망 분류기; 상기 인공 신경망 분류기가 분류한 결과에 대한 시각설명을 생성하는 관련성 스코어 계산 모듈; 및 상기 인공 신경망 분류기에서 계산된 각 레이어별 관련성 스코어를 계산하는 과정에서 해당 레이어에 속한 적어도 하나 이상의 활성 함수 값들 각각에 대하여 선택할지 여부를 결정하는 역할을 수행하는 뉴런 선택 모듈;을 포함하는 것을 특징으로 한다. 본 발명에 있어서, 상기 인공 신경망 분류기는, 순방향 신경망, 합성곱 신경망, 및 순환 신경망 중 적어도 어느 하나를 포함하는 것을 특징으로 한다.본 발명에 있어서, 상기 관련성 스코어 계산 모듈은, 상기 인공 신경망 분류기의 예측 결과와 내부적으로 학습 된 가중치 값들 및 활성 함수 값들을 이용하여 관련성 스코어를 인공 신경망의 레이어별로 계산하며, 이를 위해 인공 신경망에서 가장 마지막 레이어부터 입력 레이어까지 분류 방향과 반대로 역전파(Back propagation)를 수 행하며, 또한 마지막에 계산되는 입력 레이어에서의 관련성 스코어는 입력된 데이터의 차원과 동일한 차원을 갖 도록 계산되는 것을 특징으로 한다. 본 발명에 있어서, 상기 서버는, 이미지가 입력되면, 관련성 스코어도 동일하게 입력된 이미지와 같은 차원의 히트맵으로 계산하며, 계산한 히트맵 내 각 픽셀의 의미는 해당 픽셀이 분류 예측 결과에 얼마만큼 기여하였는 지를 나타내는 관련성 스코어인 것을 특징으로 한다. 본 발명에 있어서, 상기 관련성 스코어 계산 모듈은, 역방향 전파로써 계산이 진행되며, 모든 숨겨진 층을 역으 로 추적하여 관련성 스코어를 계산하여 히트맵 시각설명을 제공하되, 상기 히트맵 시각설명은, 입력 데이터와 같은 크기로써 생성되며, 히트맵을 구성하는 각 픽셀은 0 이상의 관련성 스코어가 부여되고, 픽셀에 부여된 관 련성 스코어의 값이 클수록 제1 지정된 색에 가까운 색으로, 0에 가까울수록 제2 지정된 색에 색으로 표현되는 것을 특징으로 한다. 본 발명에 있어서, 상기 관련성 스코어 계산 모듈은, 아래의 수학식1을 바탕으로 선택적 레이어별 관련성 스코 어 전파를 이용하여 관련성 스코어를 계산하는 것을 특징으로 한다. (수학식 1)"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "여기서 는 번째 숨겨진 층에서의 번째 활성 함수 출력값, 는 번째 숨겨진 층의 번째 뉴런에서 번째 숨겨진 층의 번째 뉴런을 연결하는 가중치, 는 번째 숨겨진 층의 번째 뉴런에 해당하는 바이어스 값, 는 포워드 패스 과정에서 이전 레이어(l)에 특정 뉴런(j번째)과 연결된 다음 레이어( )의 뉴런(k번째) 사 이의 값을 계산하는 과정에서 나오는 중간 값, 는 다음 레이어( )에서의 k 번째 뉴런의 포워드 패스 값을 계산하기 위해 연결된 모든 이전 레이어( )의 뉴 런들의 값과 가중치, 바이어스(b) 값들을 합친 값. 본 발명에 있어서, 상기 관련성 스코어 계산 모듈은, 아래의 수학식 2를 바탕으로, 상기 수학식 1의 값과 레이 어별 관련성 전파를 이용하여 번째 숨겨진 층의 번째 뉴런에서 번째 숨겨진 층의 번째 뉴런으로 전달되 는 관련성 스코어를 계산하는 것을 특징으로 한다. (수학식 2)"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "여기서 는 앞 레이어의 특정 뉴런의 활성 함수 값을 선택할지에 대한 여부를 결정하는 출력층에 대한 뉴런의 기울기, 에서 R값은 관련성(relevance) 값을 나타내며, 관련성 전파 과정에서 각 레이어 사이에서 계산되는 값, 는 번째 레이어의 k번째 뉴런에서 번째 레이어의 j번째 뉴런으로의 관련성 값. 본 발명에 있어서, 상기 관련성 스코어 계산 모듈은, 수학식 3을 바탕으로, 번째 숨겨진 층의 모든 뉴런에 서 번째 숨겨진 층의 번째 뉴런으로 전달되는 관련성 스코어를 계산하는 것을 특징으로 한다. (수학식 3)"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "여기서, 은 최종적으로 l번째 레이어의 j번째 뉴런의 관련성 값을 계산한 값. 본 발명에 있어서, 상기 계산된 뉴런의 기울기( )가 음수인 경우 관련성 스코어를 갖지 않으며, 상기 계산된 뉴런의 기울기( )가 양수인 경우 관련성 스코어를 그대로 갖게 되는 것을 특징으로 한다. 본 발명의 다른 측면에 따른 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 방법은, 클라이언트가 서버를 통해 분류하고 싶은 데이터를 상기 서버에 제공하며, 상기 서버 가, 상기 클라이언트로부터 제공받은 데이터를 처리하고 그 결과를 클라이언트에게 반환해주며, 이 때 상기 클 라이언트로부터 제공받은 데이터에 대해서 도메인에 맞게 분류를 하고, 분류 결과와 그에 대한 시각설명을 함께 제공하는 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 방법에 있어서, 상기 서버가, 상기 데이터에 대해 미리 정의된 분류 집합중 하나의 분류로 예측하는 인공 신경 망 분류를 수행하는 단계; 상기 분류 결과와 분류 과정에서 계산된 인공 신경망 내 가중치 행렬 및 활성 함수 값들을 활용하여 인공 신경망의 각 레이어별로 관련성 스코어를 계산하고, 입력층에서의 관련성 스코어를 히트 맵을 통해 시각화하여 시각설명을 생성하는 단계; 및 상기 각 레이어의 관련성 스코어를 계산하는 과정 중 활성 함수를 사용할 뉴런과 사용하지 않을 뉴런을 선택하는 뉴런 선택 단계;를 포함하는 것을 특징으로 한다. 본 발명에 있어서, 상기 데이터에 대해 미리 정의된 분류 집합중 하나의 분류로 예측하는 인공 신경망 분류를 수행하는 단계에서, 상기 인공 신경망 기반 데이터의 정확한 분류를 위하여, 상기 서버가, 정답이 포함된 복수 의 데이터를 이용하여 인공 신경망을 학습하는 단계; 및 학습된 인공 신경망 모델을 이용하여 새로운 데이터를 분류하는 단계;를 더 포함하는 것을 특징으로 한다. 본 발명에 있어서, 상기 뉴런 선택 단계는, 상기 서버가, 출력층에 대한 해당 뉴런의 기울기가 양수일 경우 해 당 뉴런을 선택하고, 해당 뉴런의 기울기가 음수일 경우 해당 뉴런을 선택하지 않는 것을 특징으로 한다. 본 발명에 있어서, 상기 서버는, 아래의 수학식1을 바탕으로 선택적 레이어별 관련성 스코어 전파를 이용하여 관련성 스코어를 계산하는 것을 특징으로 한다. (수학식 1)"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 5, "content": "여기서 는 번째 숨겨진 층에서의 번째 활성 함수 출력값, 는 번째 숨겨진 층의 번째 뉴런에서 번째 숨겨진 층의 번째 뉴런을 연결하는 가중치, 는 번째 숨겨진 층의 번째 뉴런에 해당하는 바이어스 값, 는 포워드 패스 과정에서 이전 레이어(l)에 특정 뉴런(j번째)과 연결된 다음 레이어( )의 뉴런(k번째) 사 이의 값을 계산하는 과정에서 나오는 중간 값, 는 다음 레이어( )에서의 k 번째 뉴런의 포워드 패스 값을 계산하기 위해 연결된 모든 이전 레이어( )의 뉴 런들의 값과 가중치, 바이어스(b) 값들을 합친 값. 본 발명에 있어서, 상기 서버는, 아래의 수학식 2를 바탕으로, 상기 수학식 1의 값과 레이어별 관련성 전파를 이용하여 번째 숨겨진 층의 번째 뉴런에서 번째 숨겨진 층의 번째 뉴런으로 전달되는 관련성 스코어를계산하는 것을 특징으로 한다. (수학식 2)"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 6, "content": "여기서 는 앞 레이어의 특정 뉴런의 활성 함수 값을 선택할지에 대한 여부를 결정하는 출력층에 대한 뉴런의 기울기, 에서 R값은 관련성(relevance) 값을 나타내며, 관련성 전파 과정에서 각 레이어 사이에서 계산되는 값, 는 번째 레이어의 k번째 뉴런에서 번째 레이어의 j번째 뉴런으로의 관련성 값. 본 발명에 있어서, 상기 서버는, 수학식 3을 바탕으로, 번째 숨겨진 층의 모든 뉴런에서 번째 숨겨진 층의 번째 뉴런으로 전달되는 관련성 스코어를 계산하는 것을 특징으로 한다. (수학식 3)"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 7, "content": "여기서, 은 최종적으로 l번째 레이어의 j번째 뉴런의 관련성 값을 계산한 값."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 본 발명은 딥러닝을 사용한 이미지 분류 및 감정 분류 모델에서의 예측 결과에 대 한 시각적 설명을 제공함으로써, 기존의 해석이 어려운 딥러닝 모델의 설명력을 높일 수 있고, 인공지능 기반 시스템의 신뢰도를 향상시킬 수 있으며, 또한 상기 시각적 설명 생성에서 기존의 알고리즘 보다 적은 노이즈를 생성하여 좀 더 깨끗한 히트맵을 제공하여 설명력을 향상시킬 수 있도록 한다."}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명에 따른 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치 및 방법의 일 실시예를 설명한다. 이 과정에서 도면에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료성과 편의상 과장되게 도시되어 있 을 수 있다. 또한, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자 의 의도 또는 관례에 따라 달라질 수 있다. 그러므로 이러한 용어들에 대한 정의는 본 명세서 전반에 걸친 내용 을 토대로 내려져야 할 것이다. 본 발명은 변형된 형태의 레이어별 관련성 전파를 이용해서 히트맵을 생성함으로써, 설명의 목적이 되는 종류와 관련 없는 부분에는 낮은 값의 관련성 스코어가 부여되고, 설명의 목적이 되는 종류가 달라지면 그에 따라 다른 설명을 제공하게 함으로써 사람이 좀 더 이해할 수 있는 수준의 설명을 제공하는 특징이 있다. 도 1은 본 발명의 일 실시예에 따른 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치의 개략적인 구성을 보인 예시도이다. 도 1에 도시된 바와 같이, 본 실시예에 따른 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모 델의 예측 결과에 대한 히트맵 생성 장치는, 클라이언트와 서버를 포함한다. 상기 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치 는 인공지능 시스템으로 구현된다. 상기 클라이언트는 사용자 디바이스를 포함하고, 상기 서버는 인공 신경망 분류기, 관련성 스코어 계산 모듈, 및 뉴런 선택 모듈을 포함한다. 상기 클라이언트는 인공지능 시스템이 처리할 데이터를 제공하는 사용자로써, 상기 사용자 디바이스 를 통해 이미지 또는 텍스트 등, 분류하고 싶은 데이터를 제공한다. 상기 서버는 사용자(즉, 클라이언트의 사용자 디바이스)로부터 제공받은 데이터를 처리하고 그 결과를 다 시 사용자(즉, 클라이언트의 사용자 디바이스)에게 반환해주며, 상기 사용자로부터 제공받은 데이터에 대해서 도메인에 맞게 분류를 하고, 분류 결과와 그에 대한 시각설명을 함께 출력한다. 상기 클라이언트와 서버간의 통신은 도면에는 구체적으로 도시되어 있지 않지만 무선 통신방식으로 수행되며, 이에 한정되지 않고, 클라이언트와 서버 사이에는 유선 통신방식으로도 통신이 이루어질 수 있다. 상기 인공 신경망 분류기는 사용자로부터 받은 데이터를 인공 신경망 모델을 이용하여 분류한다. 예컨대 입력 데이터가 이미지일 경우, 상기 인공 신경망 분류기는 이미지에 미리 정의된 분류 집합 중 어 떤 집합에 속하는지 분류한다. 이 때 분류를 위해 상기 인공 신경망 분류기는 보통 순방향 신경망 혹은 합 성곱 신경망, 및 순환 신경망 중 어느 하나를 사용할 수 있다. 상기 관련성 스코어 계산 모듈은 상기 인공 신경망 분류기가 분류한 결과에 대한 시각설명을 생성하 는 모듈로써, 상기 인공 신경망 분류기의 예측 결과와 내부적으로 학습된 가중치 값들 및 활성 함수 값들 을 이용하여 관련성 스코어를 인공 신경망의 레이어별로 계산하게 된다. 이를 위해 인공 신경망에서 가장 마지 막 레이어부터 입력 레이어까지 분류 방향과 반대로 역전파(Back propagation)를 수행하며 수반된다. 또한 마지막에 계산되는 입력 레이어에서의 관련성 스코어는 입력된 데이터의 차원과 동일한 차원을 갖도록 계 산된다. 예컨대 28x28의 흑백 이미지가 입력으로 주어지면, 관련성 스코어도 동일하게 28x28 차원의 히트맵으로 계산되 며, 계산된 히트맵 내 각 픽셀의 의미는 해당 픽셀이 분류 예측 결과에 얼마만큼 기여하였는지가 된다. 가령, 입력이 문장 혹은 문서 형태일 경우에는 각 단어별로 관련성 스코어가 계산되며, 이것의 의미는 상기 인공 신경 망 분류기가 예측한 분류 결과에 영향을 많이 준 단어를 찾을 수 있게 되는 것을 의미한다. 상기 뉴런 선택 모듈은 상기 인공 신경망 분류기에서 계산된 각 레이어별 관련성 스코어를 계산하는 과정에서 해당 레이어에 속한 여러 활성 함수 값들 각각에 대하여 선택할지 여부를 결정하는 역할을 수행한다. 도 2는 상기 도 1에 있어서, 관련성 스코어 계산 모듈에 대한 동작을 설명하기 위한 예시도이다. 여기서 상기 관련성 스코어 계산 모듈의 경우, 기본적으로 역방향 전파로써 계산이 진행되며, 모든 숨겨진 층을 역으로 추적하여 관련성 스코어를 계산하여 히트맵 시각설명을 제공한다. 상기 히트맵 시각설명은 입력 데이터와 같은 크기로써 생성되며, 히트맵을 구성하는 각 픽셀은 0 이상의 관련성 스코어가 부여된다. 상기 도 2의 도면에서는 픽셀에 부여된 관련성 스코어의 값이 클수록 빨간색(제1 지정된 색)에 가까운 색으로, 0에 가까울수록 흰색(제2 지정된 색)에 가까운 색으로 표현된다. 따라서 분류 결과에 영향을 준 픽셀 집합은 최종 결과 예측에 영향을 준 영역이 되고, 결국 분류 결과에 대한 시각적인 설명이 된다. 예컨대 상기 도 2의 입력 데이터가 “뱀” 이미지일 경우, 이에 대한 예측 결과는 “뱀”으로 분류된다. 이에 대한 분류 근거가 상기 도 2에서의 히트맵 시각설명으로써 제공되며, 예측 결과에 영향을 준 픽셀 집합을 확인해 보면, 뱀의 몸통 무늬와 뱀의 꽈리 모양이 빨간색을 띠며 높을 관련성 스코어를 가지고 있는 것을 알 수있다. 상기의 히트맵 시각설명을 생성하기 위해서는 주어진 인공 신경망의 예측값으로부터 시작하여 신경망 의 진행 방향에 역으로 하여 관련성 스코어 계산을 진행한다. 이러한 관련성 스코어 계산은 선택적 레이어별 관 련성 전파(Selective Lyaer-wise Relevance Propagation)을 통해 계산될 수 있다. 도 2의 도면 부호(220, 230)는 선택적 레이어별 관련성 전파를 통해 역으로 전파되며 계산되는 각 층에서 뉴런 들의 관련성 스코어 값을 나타낸다. 여기서 도면 부호(흰색에 가까운 관련성 스코어)는 선택적 레이어별 관련성 전파과정 중 부여된 관련성 스코어가 0에 가까운 뉴런이고, 도면 부호(빨간색에 가까운 관련성 스 코어)는 선택적 레이어별 관련성 전파과정 중 부여된 관련성 스코어가 큰 뉴런이다. 도 3은 상기 도 2에 있어서, 관련성 스코어 계산 과정의 일부를 설명하기 위하여 보인 예시도로서, 설명의 편의 를 위해 선택적 레이어별 관련성 전파과정 중 숨겨진층 과 숨겨진층 에 한하여 표현하였다. 각 층의 뉴런들에 부여된 관련성 스코어가 앞 레이어에 전파되는 과정에서 사용되는 것은 앞 레이어의 활성 함 수 값과 인공 신경망의 가중치인데, 선택적 레이어별 관련성 전파에서는 앞 레이어의 활성 함수 값 중 일부를 선택해서 관련성 스코어를 전파시킨다. 수학식 1"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 2"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 수학식 1에서 는 번째 숨겨진 층에서의 번째 활성 함수 출력값이고, 는 번째 숨겨진 층의 번째 뉴 런에서 번째 숨겨진 층의 번째 뉴런을 연결하는 가중치이며, 는 번째 숨겨진 층의 번째 뉴런에 해 당하는 바이어스 값이 된다. 상기 수학식 1의 과정은 순방향 신경망에서의 계산과정이며, 활성 함수는 RELU(Rectified Linear Unit)함수와 같은 단조 증가 함수를 사용한다. 여기서, 는 포워드 패스(forward pass) 과정에서 이전 레이어( )에 특정 뉴런(j번째)과 연결된 다음 레이어 (l+1)의 뉴런(k번째) 사이의 값을 계산하는 과정에서 나오는 중간 값이다(즉, 이전 레이어( )의 j번째 뉴런 값과 다음 레이어( )의 k 번째 뉴런 사이에 연결된 가중치 를 와 곱하고 와 더한 값). 는 다음 레이어( )에서의 k 번째 뉴런의 포워드 패스(forward pass) 값을 계산하기 위해 연결된 모든 이전 레이어( )의 뉴런들의 값과 가중치, 바이어스(b) 값들을 합친 값이다. 에서 R값은 relevance(관련성) 값을 나타내며, 관련성 전파 과정에서 각 레이어 사이에서 계산되는 값이 다(즉, 번째 레이엉의 k 번째 뉴련의 관련성 값을 나타냄). 는 번째 레이어의 k번째 뉴런에서 번째 레이어의 j번째 뉴런으로의 관련성 값을 나타낸다(즉,"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "값과, 값, z 값을 이용해서 계산됨). 상기 수학식 1의 값과 레이어별 관련성 전파를 이용하여 번째 숨겨진 층의 번째 뉴런에서 번째 숨겨진 층 의 번째 뉴런으로 전달되는 관련성 스코어를 계산하는 식은 수학식 2와 같다. 수학식 3"}
{"patent_id": "10-2021-0045162", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, 은 최종적으로 l번째 레이어의 j번째 뉴런의 관련성 값을 계산한 값이다. 번째 숨겨진 층의 모든 뉴런에서 번째 숨겨진 층의 번째 뉴런으로 전달되는 관련성 스코어는 수학식 3과 같이 계산될 수 있다. 상기 수학식 2와 수학식 3에서 앞 레이어의 특정 뉴런의 활성 함수 값을 선택할지에 대한 여부를 결정하는 출력 층에 대한 뉴런의 기울기는 뉴런 선택 모듈에서 계산되는데, 이 값은 수학식 2의 로써 나타난다. 상기 계산된 기울기가 음수인 경우(340, 의 값이 0이 됨)에는 도 3의 도면 부호와 같이 관련성 스코어(즉, 흰색에 가까운 관련성 스코어)를 갖지 않게 되고, 계산된 기울기가 양수인 경우(350, 의 값 이 1이 됨)에는 도면 부호와 같이 전파된 관련성 스코어(즉, 빨간색에 가까운 관련성 스코어)를 그대로 갖 게 된다. 상기 계산된 기울기가 양수인 도면 부호에는 도면 부호과 같이 뒤 레이어에서의 관련성 스코어가 전 달되는 것을 볼 수 있지만, 기울기가 음수인 도면 부호에는 뒤 레이어에서 전달되는 관련성 스코어가 없는 것을 볼 수 있다. 상기와 같이 본 실시예는 선택적 레이어별 관련성 전파 방법을 통해 기존의 딥러닝을 사용한 이미지 분류 및 감 정 분류 모델에서의 예측 결과에 대한 시각적 설명을 제공함으로써, 기존의 해석이 어려운 딥러닝 모델의 설명 력을 높일 수 있고, 더 나아가 인공지능 기반 시스템의 신뢰도를 향상시킬 수 있다. 또한 상기의 시각적 설명 생성에서 기존의 알고리즘 보다 적은 노이즈를 생성함으로써, 좀 더 깨끗한 히트맵을 제공하여 설명력을 향상시 키는 효과가 있다. 도 4와 도 5는 본 발명의 일 실시예에 따른 선택적 레이어별 관련성 전파 방법(SLRP)으로부터 생성된 히트맵과 다른 유사 알고리즘을 통해 생성된 히트맵을 정량적으로 비교 실험한 결과 그래프를 보인 예시도이다. 도 4에서는 최대 패치 마스킹(Maximal Patch Masking)을 이용하여 히트맵의 성능을 비교하는 것으로서, 패치 크 기별 성능이 많이 감소할수록 히트맵의 성능이 좋을 것을 나타낸다. 이에 도시된 바와 같이, 본 실시예에서 제 안한 알고리즘이 가장 좋은 성능을 보여줌을 알 수 있다. 도 5에서는 포인팅 게임(Point Game)이라는 방법을 통해 히트맵 성능을 비교하는 것으로서, 이에 도시된 바와 같이 남아있는 에너지 대비 포인팅 정확도가 높을수록 히트맵 성능이 좋을 것을 나타내며, CLRP 알고리즘과 비 슷한 성능으로 본 실시에에 따른 SLRP의 성능이 높은 것을 알 수 있다. 상기의 정량적 실험을 통해 본 실시예에서 제안하는 알고리즘으로부터 생성된 히트맵이 최신의 알고리즘보다 정 략적으로도 좋은 성능을 보여줌을 알 수 있으며, 이에 따라 본 실시예에 따른 알고리즘을 딥러닝 모델에 적용함 으로써 기존보다 높은 정확도의 설명을 생성할 수 있게 된다. 또한 본 실시예는 레이어별 관련성 전파 시, 관련성 스코어를 앞 레이어로 전파시키는 과정에서는 앞 레이어의 활성 함수 값을 모두 사용하는데, 본 실시예에서 히트맵 생성 과정에서는 관련성 스코어를 하위 레이어로 전파 시키는 과정에서 앞 레이어의 활성 함수 값 중 일부만을 사용함으로써, 노이즈가 적은 히트맵이 생성된다. 또한, 설명의 목적이 되는 종류에 따라 다른 히트맵이 생성되는 효과가 있다. 이상으로 본 발명은 도면에 도시된 실시예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기 술이 속하는 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점 을 이해할 것이다. 따라서 본 발명의 기술적 보호범위는 아래의 특허청구범위에 의해서 정하여져야 할 것이다. 또한 본 명세서에서 설명된 구현은, 예컨대, 방법 또는 프로세스, 장치, 소프트웨어 프로그램, 데이터 스트림 또는 신호로 구현될 수 있다. 단일 형태의 구현의 맥락에서만 논의(예컨대, 방법으로서만 논의)되었더라도, 논의된 특징의 구현은 또한 다른 형태(예컨대, 장치 또는 프로그램)로도 구현될 수 있다. 장치는 적절한 하드웨어, 소프트웨어 및 펌웨어 등으로 구현될 수 있다. 방법은, 예컨대, 컴퓨터, 마이크로프로세서, 집적 회 로 또는 프로그래밍 가능한 로직 디바이스 등을 포함하는 프로세싱 디바이스를 일반적으로 지칭하는 프로세서 등과 같은 장치에서 구현될 수 있다. 프로세서는 또한 최종-사용자 사이에 정보의 통신을 용이하게 하는 컴퓨터, 셀 폰, 휴대용/개인용 정보 단말기(personal digital assistant: \"PDA\") 및 다른 디바이스 등과 같은 통신 디바이스를 포함한다."}
{"patent_id": "10-2021-0045162", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 선택적 레이어별 관련성 전파를 통한 이미지 분류 및 감정분류 모델의 예측 결과에 대한 히트맵 생성 장치의 개략적인 구성을 보인 예시도. 도 2는 상기 도 1에 있어서, 관련성 스코어 계산 모듈에 대한 동작을 설명하기 위한 예시도. 도 3은 상기 도 2에 있어서, 관련성 스코어 계산 과정의 일부를 설명하기 위하여 보인 예시도. 도 4와 도 5는 본 발명의 일 실시예에 따른 선택적 레이어별 관련성 전파 방법(SLRP)으로부터 생성된 히트맵과 다른 유사 알고리즘을 통해 생성된 히트맵을 정량적으로 비교 실험한 결과 그래프를 보인 예시도."}
