{"patent_id": "10-2021-0138480", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0055137", "출원번호": "10-2021-0138480", "발명의 명칭": "온도 센서, 온도 센서 동작 방법, 및 화재 경보 시스템", "출원인": "주식회사 로제타텍", "발명자": "조영진"}}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "온도를 측정하는 제1 센서;상기 온도를 측정하고, 상기 제1 센서와 상이한 제2 센서;상기 제1 센서 및 상기 제2 센서에서 측정된 데이터를 처리하는 처리부; 상기 처리부에서 생성한 데이터들을 저장하는 센싱 메모리부; 및상기 데이터들을 기초로 고장 여부를 자가 검진하는 판단부를 포함하는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 처리부는 상기 제1 센서에서 측정된 제1 데이터와 상기 제2 센서에서 측정된 제2 데이터를 생성하고,상기 판단부는 상기 제1 데이터와 상기 제2 데이터의 차이가 제1 기준값 이하일 때 고장으로 판단하는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 센싱 메모리부는 상기 제1 기준값 및 자가 검진 데이터를 저장하고, 상기 자가 검진 데이터는 상기 제1 데이터와 상기 제2 데이터의 차이에 대한 정보를 포함하는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서,상기 제2 데이터가 화재 판단의 기준이 되는 화재 판단 기준값 이상일 때, 상기 판단부는 화재 정보를생성하고, 상기 화재 정보를 포함하는 화재 감지 신호를 중계기에 송신하는 센싱 통신부를 더 포함하는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 처리부는 소정의 시간 간격마다 상기 제1 센서 및 상기 제2 센서 각각으로부터 측정한 온도들을 데이터화하여 복수의 데이터들을 생성하는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 판단부는 상기 복수 개의 데이터들의 편차의 절대값이 제2 기준값 이상 일 때, 화재 판단의 기준이 되는화재 판단 기준값을 재설정하는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 판단부에서 상기 화재 판단 기준값을 재설정하는 경우, 상기 복수 개의 데이터들 중 편차가 가장 큰 데이터를 상기 화재 판단 기준값에 더하여 보정 기준값을 생성하는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2023-0055137-3-제7 항에 있어서,상기 센싱 메모리부는 상기 제2 기준값, 상기 화재 판단 기준값, 상기 보정 기준값, 및 자기 보상 데이터를 저장하고, 상기 자기 보상 데이터는 상기 복수의 데이터들 중 편차가 가장 큰 데이터인 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,외부로부터의 동기화 신호를 수신하는 통신부 및 상기 통신부를 제1 시간마다 활성화시키는 동기화 회로를 더포함하고,상기 제2 센서는 상기 동기화 회로에 구비되는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 동기화 회로는 상기 동기화 신호를 근거로 외부의 장치와 내부 시간이 동기화되고,상기 제1 시간은 상기 내부 시간을 근거로 카운팅되는 온도 센서."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "각각이 온도를 감지하여 화재 정보를 생성하고, 서로 통신을 수행하는 복수의 온도 센서들;상기 복수의 온도 센서들 각각과 통신을 수행하고, 상기 화재 정보를 수신하는 중계기; 및상기 중계기와 통신을 수행하는 서버를 포함하고,상기 복수의 온도 센서들 각각은 자가 검진 데이터 및 자기 보상 데이터를 생성하고, 상기 자가 검진 데이터 및상기 자기 보상 데이터를 상기 서버로 제공하고,상기 복수의 온도 센서들 각각은,온도를 측정하는 제1 센서;상기 온도를 측정하고, 상기 제1 센서와 상이한 제2 센서;상기 제1 센서 및 상기 제2 센서에서 측정된 데이터를 처리하는 처리부; 상기 처리부에서 생성한 데이터들을 저장하는 센싱 메모리부; 및상기 데이터들을 기초로 고장 여부를 자가 검진하는 판단부를 포함하는 화재 경보 시스템."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 서버는, 건축물을 가상으로 구현하여 모델링 정보를 제공하는 디지털트윈 산출부;외부 서버로부터 빅데이터를 수신하는 빅데이터 수신부;상기 복수의 온도 센서들로부터 수신한 상기 화재 정보를 수집하고, 저장하는 서버 메모리;상기 모델링 정보, 상기 빅데이터, 및 상기 화재 정보를 근거로 분석 데이터를 생성하는 서버 분석부;상기 분석 데이터를 근거로 상기 화재 지수를 산출하는 화재 지수 산출부; 및상기 화재 지수가 소정의 설정값을 초과하면 화재 상황을 판단하는 제어부를 포함하는 화재 경보 시스템."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11 항에 있어서,공개특허 10-2023-0055137-4-상기 복수의 온도 센서들 각각은,상기 화재 정보, 데이터, 및 주소값들을 저장하는 센싱 메모리부; 및상기 화재 정보, 상기 데이터, 및 상기 주소값들을 상기 중계기에 송신하는 센싱 통신부를 더 포함하는 화재 경보 시스템."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12 항에 있어서,상기 복수의 온도 센서들은 상기 자가 검진 데이터를 근거로 상기 복수의 온도 센서들 각각의 고장 여부를 판단하고, 상기 고장 여부에 따라 상기 화재 정보를 보정하거나, 교체 알림 신호를 생성하는 화재 경보 시스템."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12 항에 있어서,상기 복수의 온도 센서들은 상기 자기 보상 데이터를 근거로 상기 복수의 감지기들 각각의 화재 판단 기준값을재설정하고, 상기 재설정 여부에 따라 상기 화재 정보를 보정하거나, 교체 알림 신호를 생성하는 화재 경보 시스템."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1 센서가 온도를 측정하여 제1 데이터를 생성하는 단계;상기 제1 센서와 상이한 제2 센서가 상기 온도를 측정하여 제2 데이터를 생성하는 단계; 및상기 제1 데이터와 상기 제2 데이터를 비교하여 고장을 판별하는 자가 검진 단계를 포함하는 온도 센서 동작 방법."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 제1 데이터와 상기 제2 데이터를 비교하여 고장을 판별하는 자가 검진 단계는 상기 제1 데이터와 상기 제2데이터의 차이를 제1 기준값과 비교하는 단계를 포함하는 온도 센서 동작 방법."}
{"patent_id": "10-2021-0138480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16 항에 있어서,화재 판단의 기준이 되는 화재 판단 기준값을 재설정하는 자기 보상 단계를 더 포함하고,상기 자기 보상 단계는,소정의 시간 간격마다 상기 제1 센서 및 상기 제2 센서 각각으로부터 측정한 온도들을 데이터화하여 복수의 데이터들을 생성하는 단계; 및상기 복수의 데이터들의 편차의 절대값이 제2 기준값 이상 일 때, 상기 복수 개의 데이터들 중 편차가 가장 큰데이터를 상기 화재 판단 기준값에 더하여 보정 기준값을 생성하는 단계를 포함하는 온도 센서 동작 방법."}
{"patent_id": "10-2021-0138480", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 온도 센서는 온도를 측정하는 제1 센서, 상기 온도를 측정하고 상기 제1 센서와 상 이한 제2 센서, 상기 제1 센서 및 상기 제2 센서에서 측정된 데이터를 처리하는 처리부, 상기 처리부에서 생성한 데이터들을 저장하는 센싱 메모리부, 및 상기 데이터들을 기초로 고장 여부를 자가 검진하는 판단부를 포함할 수 있다."}
{"patent_id": "10-2021-0138480", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 화재 감지 신뢰성이 향상된 온도 센서, 온도 센서 동작 방법, 및 화재 경보 시스템에 관한 것이다."}
{"patent_id": "10-2021-0138480", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온도 센서는 화재가 발생한 경우, 온도를 통해 화재를 감지하는 장치이다. 온도 센서는 설치되면 고장 여부를 알기 어렵고, 온도 센서의 고장은 화재를 감지하지 못하는 직접적인 위험을 야기한다. 또한 온도 센서가 고장나면, 화재가 아닌 온도에도 화재로 감지할 수 있다. 화재가 발생하지 않았음에도 화재 경보가 울려 온도 센서 및 화재 경보 시스템에 대한 신뢰성이 떨어질 수 있다. 디지털 트윈이란, 현실 세계의 물리적 대상을 디지털 세계의 디지털 대상으로 복제하여, 현실 세계의 문제 해결, 또는 수정 및 개선 등을 위한 다양한 모의를 디지털 세계에서 실행하여, 최적의 해답을 찾아 현실 세계에 적용하는 기술이다."}
{"patent_id": "10-2021-0138480", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 화재 감지 신뢰성이 향상된 온도 센서, 온도 센서 동작 방법, 및 화재 경보 시스템을 제공하는 것을 일 목적으로 한다."}
{"patent_id": "10-2021-0138480", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 온도 센서는 온도를 측정하는 제1 센서, 상기 온도를 측정하고 상기 제1 센서와 상 이한 제2 센서, 상기 제1 센서 및 상기 제2 센서에서 측정된 데이터를 처리하는 처리부, 상기 처리부에서 생성 한 데이터들을 저장하는 센싱 메모리부, 및 상기 데이터들을 기초로 고장 여부를 자가 검진하는 판단부를 포함 할 수 있다. 상기 처리부는 상기 제1 센서에서 측정된 제1 데이터와 상기 제2 센서에서 측정된 제2 데이터를 생성하고, 상기 판단부는 상기 제1 데이터와 상기 제2 데이터의 차이가 제1 기준값 이하일 때 고장으로 판단할 수 있다. 상기 센싱 메모리부는 상기 제1 기준값 및 자가 검진 데이터를 저장하고, 상기 자가 검진 데이터는 상기 제1 데 이터와 상기 제2 데이터의 차이에 대한 정보를 포함할 수 있다. 상기 제2 데이터가 화재 판단의 기준이 되는 화재 판단 기준값 이상일 때, 상기 판단부는 화재 정보를 생성하고, 상기 화재 정보를 포함하는 화재 감지 신호를 중계기에 송신하는 센싱 통신부를 더 포함할 수 있다. 상기 처리부는 소정의 시간 간격마다 상기 제1 센서 및 상기 제2 센서 각각으로부터 측정한 온도들을 데이터화 하여 복수의 데이터들을 생성할 수 있다. 상기 판단부는 상기 복수 개의 데이터들의 편차의 절대값이 제2 기준값 이상 일 때, 화재 판단의 기준이 되는 화재 판단 기준값을 재설정할 수 있다. 상기 판단부에서 상기 화재 판단 기준값을 재설정하는 경우, 상기 복수 개의 데이터들 중 편차가 가장 큰 데이 터를 상기 화재 판단 기준값에 더하여 보정 기준값을 생성할 수 있다. 상기 센싱 메모리부는 상기 제2 기준값, 상기 화재 판단 기준값, 상기 보정 기준값, 및 자기 보상 데이터를 저 장하고, 상기 자기 보상 데이터는 상기 복수의 데이터들 중 편차가 가장 큰 데이터일 수 있다. 외부로부터의 동기화 신호를 수신하는 통신부 및 상기 통신부를 제1 시간마다 활성화시키는 동기화 회로를 더 포함하고, 상기 제2 센서는 상기 동기화 회로에 구비될 수 있다. 상기 동기화 회로는 상기 동기화 신호를 근거로 외부의 장치와 내부 시간이 동기화되고, 상기 제1 시간은 상기 내부 시간을 근거로 카운팅될 수 있다. 본 발명의 일 실시예에 따른 화재 경보 시스템은 각각이 온도를 감지하여 화재 정보를 생성하고, 서로 통신을 수행하는 복수의 온도 센서들, 상기 복수의 온도 센서들 각각과 통신을 수행하고, 상기 화재 정보를 수신하는 중계기, 및 상기 중계기와 통신을 수행하는 서버를 포함하고, 상기 복수의 온도 센서들 각각은 자가 검진 데이 터 및 자기 보상 데이터를 생성하고, 상기 자가 검진 데이터 및 상기 자기 보상 데이터를 상기 서버로 제공하고, 상기 복수의 온도 센서들 각각은 온도를 측정하는 제1 센서, 상기 온도를 측정하고, 상기 제1 센서와 상이한 제2 센서, 상기 제1 센서 및 상기 제2 센서에서 측정된 데이터를 처리하는 처리부, 상기 처리부에서 생 성한 데이터들을 저장하는 센싱 메모리부, 및 상기 데이터들을 기초로 고장 여부를 자가 검진하는 판단부를 포 함할 수 있다. 상기 서버는 건축물을 가상으로 구현하여 모델링 정보를 제공하는 디지털트윈 산출부, 외부 서버로부터 빅데이 터를 수신하는 빅데이터 수신부, 상기 복수의 온도 센서들로부터 수신한 상기 화재 정보를 수집하고, 저장하는 서버 메모리, 상기 모델링 정보, 상기 빅데이터, 및 상기 화재 정보를 근거로 분석 데이터를 생성하는 서버 분석부, 상기 분석 데이터를 근거로 상기 화재 지수를 산출하는 화재 지수 산출부, 및 상기 화재 지수가 소정의 설정값을 초과하면 화재 상황을 판단하는 제어부를 포함할 수 있다. 상기 복수의 온도 센서들 각각은 상기 화재 정보, 데이터, 및 주소값들을 저장하는 센싱 메모리부 및 상기 화재 정보, 상기 데이터, 및 상기 주소값들을 상기 중계기에 송신하는 센싱 통신부를 더 포함할 수 있다. 상기 복수의 온도 센서들은 상기 자가 검진 데이터를 근거로 상기 복수의 온도 센서들 각각의 고장 여부를 판단 하고, 상기 고장 여부에 따라 상기 화재 정보를 보정하거나, 교체 알림 신호를 생성할 수 있다. 상기 복수의 온도 센서들은 상기 자기 보상 데이터를 근거로 상기 복수의 감지기들 각각의 화재 판단 기준값을 재설정하고, 상기 재설정 여부에 따라 상기 화재 정보를 보정하거나, 교체 알림 신호를 생성할 수 있다. . 본 발명의 일 실시예에 따른 온도 센서 동작 방법은 제1 센서가 온도를 측정하여 제1 데이터를 생성하는 단계, 상기 제1 센서와 상이한 제2 센서가 상기 온도를 측정하여 제2 데이터를 생성하는 단계, 및 상기 제1 데이터와 상기 제2 데이터를 비교하여 고장을 판별하는 자가 검진 단계를 포함할 수 있다. 상기 제1 데이터와 상기 제2 데이터를 비교하여 고장을 판별하는 자가 검진 단계는 상기 제1 데이터와 상기 제2 데이터의 차이를 제1 기준값과 비교하는 단계를 포함할 수 있다. 화재 판단의 기준이 되는 화재 판단 기준값을 재설정하는 자기 보상 단계를 더 포함하고, 상기 자기 보상 단계 는 소정의 시간 간격마다 상기 제1 센서 및 상기 제2 센서 각각으로부터 측정한 온도들을 데이터화하여 복수의 데이터들을 생성하는 단계 및 상기 복수의 데이터들의 편차의 절대값이 제2 기준값 이상 일 때, 상기 복수 개의 데이터들 중 편차가 가장 큰 데이터를 상기 화재 판단 기준값에 더하여 보정 기준값을 생성하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0138480", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술된 바에 따르면, 온도 센서는 제1 센서 및 제2 센서 각각으로부터 측정되는 데이터를 비교하여 온도 센서의 고장 여부를 주기적으로 판단할 수 있다. 고장난 온도 센서가 감지되는 경우, 사용자는 온도 센서를 교체할 수 있다. 화재 경보 시스템은 화재 발생에 대비할 수 있다. 즉, 온도 센서들은 재설정 여부에 따라 화재 정보를 보 정하거나, 고장 여부에 따라 교체 알림 신호를 생성할 수 있다. 따라서, 신뢰성이 향상된 화재 경보 시스템을 제공할 수 있다."}
{"patent_id": "10-2021-0138480", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서, 어떤 구성요소(또는 영역, 층, 부분 등)가 다른 구성요소 “상에 있다”, “연결된다”, 또는 “결합된다”고 언급되는 경우에 그것은 다른 구성요소 상에 직접 배치/연결/결합될 수 있거나 또는 그들 사이 에 제3의 구성요소가 배치될 수도 있다는 것을 의미한다. 동일한 도면부호는 동일한 구성요소를 지칭한다. 또한, 도면들에 있어서, 구성요소들의 두께, 비율, 및 치수는 기술적 내용의 효과적인 설명을 위해 과장된 것이다. “및/또는”은 연관된 구성요소들이 정의할 수 있는 하나 이상의 조합을 모두 포함한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유 사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다.또한, “아래에”, “하측에”, “위에”, “상측에” 등의 용어는 도면에 도시된 구성요소들의 연관관계를 설 명하기 위해 사용된다. 상기 용어들은 상대적인 개념으로, 도면에 표시된 방향을 기준으로 설명된다. \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 본 명세서에서 사용된 모든 용어 (기술 용어 및 과학 용어 포함)는 본 발명이 속하는 기술 분야의 당업자에 의해 일반적으로 이해되는 것과 동일한 의미를 갖는다. 또한, 일반적으로 사용되는 사전 에서 정의된 용어와 같은 용어는 관련 기술의 맥락에서 갖는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하고, 여기서 명시적으로 정의되지 않는 한 너무 이상적이거나 지나치게 형식적인 의미로 해석되어서는 안된다. 이하, 도면을 참조하여 본 발명의 실시예들을 설명한다. 도 1은 본 발명의 일 실시예에 따른 화재 경보 시스템을 도시한 것이다. 도 1을 참조하면, 화재 경보 시스템는 화재 상황을 감지할 수 있다. 화재 경보 시스템는 복수의 온도 센서들, 중계기, 수신기, 및 제1 서버를 포함할 수 있다. 복수의 온도 센서들은 화재가 발생했는지 여부를 감지하는 시스템일 수 있다. 도 1에서는 예시적으로 5 개 의 온도 센서들을 도시하였으나, 이에 제한되지 않는다. 복수의 온도 센서들 각각은 화재 발생을 감지할 수 있다. 복수의 온도 센서들 각각은 제1 화재 감지 신호(SG-1)를 인접한 온도 센서 및/또는 중계기에 송신할 수 있다. 제1 화재 감지 신호(SG-1)는 제1 신호(SG-1a) 및 제2 신호(SG-1b)를 포함할 수 있다. 제1 신호(SG-1a)는 화재 발생을 감지한 온도 센서가 생성한 신호 일 수 있다. 제2 신호(SG-1b)는 온도 센서에서 증폭된 신호 일 수 있다. 제1 화재 감지 신호(SG-1)를 송수신하는 방법으로는 RF(Radio Frequency) 통신 방식이 이용될 수 있다. 상기 RF 통신 방식은 무선 주파수를 방사하여 정보를 교환하는 통신 방법일 수 있다. 주파수를 이용한 광대역 통신 방식 으로 기후 및 환경의 영향이 적어 안정성이 높을 수 있다. 상기 RF 통신 방식은 음성 또는 기타 부가기능을 연 동할 수 있으며 전송속도가 빠를 수 있다. 예를 들어, RF 통신 방식은 447MHz 내지 924MHz 대역의 주파수를 이 용할 수 있다. 다만, 이는 예시적인 것으로 본 발명의 일 실시예에서 Ethernet, Wifi, LoRA, M2M, 3G, 4G, LTE, LTE-M, Bluetooth, 또는 WiFi Direct 등과 같은 통신 방식이 이용될 수 있다. 본 발명의 일 실시예에서, 상기 RF통신 방식은 LBT(Listen Before Transmission)통신 방법을 포함할 수 있다. 이는 선택한 주파수가 다른 시스템에 의해 사용되고 있는지를 파악하여 점유되어 있다고 판단될 때는 다른 주파 수를 다시 선택하는 주파수 선택 방식이다. 예를 들어, 송신을 의도하는 노드는 먼저 매체에 대해 청취(Liste n)를 하고, 그것이 휴지 상태에 있는 지를 판정한 다음, 송신(Transmission)에 앞서 백오프 프로토콜을 흘려 보 낼 수 있다. 이와 같은 LBT 통신 방식을 이용하여 데이터를 분산처리 함으로써, 동일 대역대에서 신호간의 충돌 을 방지할 수 있다. 중계기는 복수의 온도 센서들과 상기 RF 통신할 수 있다. 예를 들어, 중계기는 40 개의 온도 센 서들과 통신할 수 있다. 중계기는 복수의 온도 센서들로부터 제1 화재 감지 신호(SG-1)를 수신 할 수 있다. 중계기는 제1 화재 감지 신호(SG-1)를 제2 화재 감지 신호(SG-2)로 변환할 수 있다. 중계기 는 제2 화재 감지 신호(SG-2)를 수신기에 송신할 수 있다. 중계기는 복수의 온도 센서들 각각과 시간이 동기화될 수 있다. 이에 대해서는 후술된다. 제2 화재 감지 신호(SG-2)를 송신하는 방법으로는 상기 RF 통신 방식이 이용될 수 있다. 즉, 중계기 및 수 신기는 상기 RF 통신할 수 있다. 수신기는 중계기로부터 제2 화재 감지 신호(SG-2)를 수신할 수 있다. 수신기는 제2 화재 감지 신호(SG-2a)를 제3 화재 감지 신호(SG-3)로 변환할 수 있다. 수신기는 제3 화재 감지 신호(SG-3)를 제1 서 버에 송신할 수 있다. 제3 화재 감지 신호(SG-3)를 송신하는 방법으로는 상기 RF 통신 방식이 이용될 수 있다. 즉, 수신기 및 제 1 서버는 상기 RF 통신할 수 있다.제1 서버는 수신기로부터 수신한 제3 화재 감지 신호(SG-3)를 근거로 화재 상황을 판단할 수 있다. 제1 서버는 제3 화재 감지 신호(SG-3)의 유효성을 판단할 수 있다. 제1 서버는 외부의 제2 서버로부터 빅 데이터를 수신할 수 있다. 상기 빅 데이터는 제2 서버의 메모리에 저장되어 있을 수 있다. 다만, 이는 예시적인 것으로 본 발명의 일 실시예에 따른 상기 빅 데이터는 제1 서버 의 서버 메모리에 저장될 수도 있다. 상기 빅 데이터는 화재 발생 여부를 판단하기 위한 주변 환경 데이터를 포함할 수 있다. 예를 들어, 상기 주변 환경 데이터는 날짜 별 화재 발생확률에 대응하는 데이터, 시각 별 화재 발생확률에 대응하는 데이터, 공간 별 화재 발생확률에 대응하는 데이터, 기온 별 화재 발생확률에 대응하는 데이터, 습도 별 화재 발생확률에 대응하 는 데이터, 날씨 별 화재 발생확률에 대응하는 데이터, 업종 별 화재 발생확률에 대응하는 데이터, 및 사용자 별 화재 발생확률 에 대응하는 데이터 중 적어도 하나를 포함할 수 있다. 예를 들어, 상기 날짜 별 화재 발생확률에 대응하는 데이터는 요일 별 화재 발생확률 및 달 별 화재 발생확률을 포함할 수 있다. 상기 시각 별 화재 발생확률에 대응하는 데이터는 새벽, 아침, 오후, 저녁, 또는 심야 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 공간 별 화재 발생확률에 대응하는 데이터는 도심, 산간, 해변, 또는 농촌 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 기온 별 화재 발생확률에 대응하는 데이터는 봄, 여름, 가을, 또는 겨울로 구분된 화재 발생확률을 포함할 수 있다. 상기 습도 별 화재 발생확률에 대응하는 데이터는 특정 습도 수치 별 화재 발생 확률을 포함할 수 있다. 상기 날씨 별 화재 발생확률에 대응하는 데이터 는 맑은 날, 흐린 날, 또는 비 오는 날 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 업종 별 화재 발 생확률에 대응하는 데이터는 가정, 식당, 공장, 또는 사무실 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 사용자 별 화재 발생확률은 연령, 직업, 또는 성별 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 빅 데이터는 주기적으로 업데이트될 수 있다. 제1 서버는 비화재보를 판단할 수 있는 인공지능 모델을 포함하는 알고리즘을 포함할 수 있다. 제1 서버는 상기 빅 데이터 및 복수의 온도 센서들 각각이 감지한 값을 근거로 제3 화재 감지 신호 (SG-3)의 유효성을 상황 별로 상이한 기준으로 판단할 수 있다. 예를 들어, 제1 서버는 상기 빅 데이터를 이용하여 상기 복수의 온도 센서들이 감지한 값이 유효하지 않은 데이터인지 여부를 판단할 수 있다. 제1 서버 제3 화재 감지 신호(SG-3)를 유효한 신호로 판단한 경우, 복수의 관계자들에게 경고 메시지 및 위치 정보를 송신할 수 있다. 복수의 관계자들은, 예를 들어, 소방서, 화재가 발생한 곳의 관계자들, 국민안전처(또는 국민의 안전에 관 련된 공공기관) 등을 포함할 수 있다. 복수의 관계자들은 유선 전화, 스마트폰, 또는 기타 휴대 단말기 등 을 통하여 텍스트 메시지, 영상 메시지, 또는 음성 메시지의 형태로 화재 경고 메시지를 수신할 수 있다. 제1 서버는 단말기(MD)에 상기 화재 경고 메시지를 송신할 수 있다. 제1 서버가 제3 화재 감지 신호(SG-3)를 유효하지 않은 신호로 판단한 경우, 제3 화재 감지 신호(SG-3)를 무시할 수 있다. 따라서, 비화재보를 방지할 수 있다. 상기 비화재보라 함은 화재가 아님에도 불구하고 화재로 간주하여 화재 경보 시스템가 동작하는 것을 의미한다. 또한, 제1 서버가 제3 화재 감지 신호(SG-3)를 유효하지 않은 신호로 판단한 경우, 제1 서버는 복수 의 온돈 센서들의 알람이 울리지 않도록 하는 제어 신호를 복수의 센서들(SM)에 전송할 수 있다. 도 2는 본 발명의 일 실시예에 따른 온도 센서를 도시한 사시도이고, 도 3은 본 발명의 일 실시예에 따른 온도 센서 동작 방법을 도시한 흐름도이다. 도 1 내지 도 3을 참조하면, 온도 센서는 복수의 제공되고, 복수의 온도 센서들 각각은 서로 다른 고 유한 어드레스 정보를 포함할 수 있다. 온도 센서는 제1 센서(SS1), 센싱 메모리부(MM), 센싱 통신부 (ATN), 증폭부(AMP), 전지부(TT1), 제2 센서(SS2)를 포함하는 동기화 회로(RTC), 처리부(CC), 및 판단부(JD)를 포함할 수 있다. 제1 센서(SS1)는 온도를 감지할 수 있다. 제1 센서(SS1)는 온도를 감지하여 화재 정보를 생성할 수 있다. 화재 정보는 제1 센서(SS1)에서 측정된 값을 포함할 수 있다. 도 2에서는 예시적으로 온도 센서만을 도시하였으나, 이에 제한되지 않는다. 예를 들어, 온도 센서는 온도뿐 아니라 연기, 습도, 및 가스 중 적어도 하나를 감지하는다른 센서를 더 포함할 수 있다. 센싱 메모리부(MM)에는 상기 어드레스 정보가 저장될 수 있다. 센싱 메모리부(MM)에는 중계기에 화재 감지 신호(SG-1)를 신속하게 전송하기 위한 최적의 신호 전송 경로가 저장될 수 있다. 센싱 메모리부(MM)는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 상기 휘발성 메모리는 DRAM, SRAM, 플레시 메모리, 또는 FeRAM을 포함할 수 있다. 상기 비휘발성 메모리는 SSD 또는 HDD를 포함할 수 있다. 센싱 통신부(ATN)는 중계기에 화재 감지 신호(SG-1)를 송신할 수 있다. 센싱 통신부(ATN)는 인접한 다른 온도 센서들에도 화재 감지 신호(SG-1)를 송신할 수 있다. 화재 감지 신호(SG-1)는 제1 센서(SS1)에서 생 성된 상기 화재 정보 및 상기 어드레스 정보를 포함할 수 있다. 센싱 통신부(ATN)는 제1 센서(SS1)로부터 화재 발생 신호를 수신한 경우, 인접한 복수의 온도 센서 중 적 어도 하나에 제1 신호(SG-1a)를 전송할 수 있다. 센싱 통신부(ATN)는 제1 센서(SS1)로부터 상기 화재 발생 신호 를 수신한 경우, 중계기에 제2 신호(SG-1b)를 전송할 수 있다. 온도 센서와 중계기가 서로 멀리 떨어져 중계기가 직접적으로 화재 감지 신호(SG-1)를 수신하기 어려운 경우, 센싱 통신부(ATN)는 인접한 다른 온도 센서에 화재 감지 신호(SG-1)를 송신함으로써 중계기 로 신호 전달을 안정적으로 수행할 수 있다. 센싱 통신부(ATN)는 다른 인접한 온도 센서로부터 화재 감지 신호(SG-1)를 수신할 수 있다. 증폭부(AMP)는 화재 감지 신호(SG-1)를 증폭할 수 있다. 센싱 통신부(ATN)는 다른 온도 센서로부터 화재 감지 신호(SG-1)를 수신할 수 있다. 수신한 화재 감지 신호(SG-1)는 인접한 다른 온도 센서로부터 전달 받 는 과정에서 전송 거리 및 노이즈 등에 의해 전송률 및/또는 정확성이 저하될 수 있다. 증폭부(AMP)는 품질이 저하된 화재 감지 신호(SG-1)를 증폭할 수 있다. 따라서, 화재 감지 신호(SG-1)의 전송률 및/또는 정확성이 향 상될 수 있다. 센싱 통신부(ATN)는 중계기에 증폭된 화재 감지 신호(SG-1)를 전송할 수 있다. 센싱 통신부 (ATN)는 인접한 복수의 온도 센서들 중 적어도 하나에 증폭된 화재 감지 신호(SG-1)를 전송할 수 있다. 증 폭된 화재 감지 신호(SG-1)는 복수의 온도 센서들 및 중계기 사이에 전달되는 신호의 정확성, 전송률, 및 전송 거리 등을 증가시킬 수 있다. 전지부(TT1)는 제1 센서(SS1), 센싱 메모리부(MM), 센싱 통신부(ATN), 증폭부(AMP), 동기화 회로(RTC), 처리부 (CC), 및 판단부(JD)에 전원을 공급할 수 있다. 본 발명의 일 실시예에 따른 센싱 통신부(ATN)는 RF 통신 방식을 이용할 수 있다. 상기 RF 통신 방식은 전력 소 모가 적을 수 있다. 온도 센서의 전력 사용이 최소화될 수 있다. 온도 센서는 저전력 구동이 가능하 다. 따라서, 전지부(TT1)는 제1 센서(SS1), 센싱 메모리부(MM), 센싱 통신부(ATN), 증폭부(AMP), 동기화 회로 (RTC), 처리부(CC), 및 판단부(JD)에 전원을 안정적으로 오래 공급할 수 있다. 또한, 본 발명에 따르면, 복수의 온도 센서들은 전력을 거의 소모하지 않는 절전모드 및 화재 상황에서 동 작하는 노말모드로 구분되어 동작하여 복수의 온도 센서들 각각의 전력 사용을 최소화할 수 있다. 따라서, 복수의 온도 센서들 각각은 저전력 구동이 가능하다. 동기화 회로(RTC)는 제1 시간 마다 센싱 통신부(ATN)를 활성화시킬 수 있다. 센싱 통신부(ATN)는 수신기로 부터 동기화 신호를 수신할 수 있다. 동기화 회로(RTC)의 내부 시간은 상기 동기화 신호를 근거로 수신기 의 내부 시간과 동기화될 수 있다. 즉, 동기화 회로(RTC)는 수신기의 동기화 회로의 시간과 동기화될 수 있다. 제1 시간은 내부 시간을 근거로 카운팅될 수 있다. 동기화 회로(RTC)는 제2 센서(SS2)를 포함할 수 있다. 제2 센서(SS2)는 온도를 감지할 수 있다. 제2 센서(SS2) 는 동기화 회로(RTC)에 실장되어 제공되어 온도 센서는 별도의 센서를 구비하지 않아도 후술될 자가 검진 단계를 진행할 수 있다. 또한, 별도의 센서를 구비하지 않음으로 인해 온도 센서의 크기가 작아질 수 있고, 가격 경쟁력을 갖는 온도 센서를 제공할 수 있다. 제1 센서(SS1)에서 측정된 온도는 제1 데이터로 변환될 수 있다. 제1 센서(SS1)는 제1 데이터를 생성할 수 있다 (S100). 제2 센서(SS2)에서 측정된 온도는 제2 데이터로 변환될 수 있다. 제2 센서(SS2)는 제2 데이터를 생성할 수 있다(S200). 처리부(CC)는 제1 데이터 및 제2 데이터를 비교하고, 처리할 수 있다. 처리부(CC)는 제1 데이터 및 제2 데이터 의 차이에 대한 정보를 갖는 자가 검진 데이터를 생성할 수 있다. 센싱 메모리부(MM)는 처리부(CC)에서 생성한데이터들을 저장할 수 있다. 예를 들어, 센싱 메모리부(MM)는 제1 데이터, 제2 데이터, 및 자가 검진 데이터 등 을 저장할 수 있다. 판단부(JD)는 처리부(CC)로부터 생성된 데이터들을 기초로 고장 여부를 자가 검진할 수 있다. 판단부(JD)는 자 가 검진 데이터와 제1 기준값을 비교할 수 있다(S310). 판단부(JD)는 자가 검진 데이터가 제1 기준값 이하인 경 우 제1 센서(SS1) 또는 제2 센서(SS2)를 고장으로 판단할 수 있다(S320). 판단부(JD)는 자가 검진 데이터가 제1 기준값 초과인 경우, 자가 검진 단계를 종료할 수 있다. 자가 검진 데이터는 오차 범위를 나타내는 값일 수 있 다. 본 발명에 따르면, 판단부(JD)는 온도 센서를 고장으로 판단한 경우, 수신기에 교체 알림 신호를 송 신하도록 제어할 수 있다. 수신기는 상기 교체 알림 신호를 송신한 경우, 사용자에게 온도 센서의 고 장을 알릴 수 있다. 온도 센서가 화재 상황이 아닌 온도에도 화재로 감지하는 현상을 방지할 수 있다. 따 라서, 신뢰성이 향상된 온도 센서를 제공할 수 있다. 또한, 본 발명에 따르면, 온도 센서는 제1 센서(SS1) 및 제2 센서(SS2) 각각으로부터 측정되는 데이터를 비교하여 온도 센서의 고장 여부를 주기적으로 판단할 수 있다. 온도 센서가 고장난 것으로 판단되는 경우, 사용자는 온도 센서를 교체할 수 있다. 화재 경보 시스템(10, 도 1 참조)는 화재 발생에 대비할 수 있다. 즉, 온도 센서들은 고장 여부에 따라 교체 알림 신호를 생성하고, 사용자에게 송신할 수 있다. 따라 서, 신뢰성이 향상된 화재 경보 시스템을 제공할 수 있다. 도 4는 본 발명의 일 실시예에 따른 온도 센서의 자가 보상 방법을 도시한 흐름도이다. 도 2 및 도 4를 참조하면, 처리부(CC)는 제1 센서(SS1)로부터 제1 데이터를 생성하고, 제2 센서(SS2)로부터 제2 데이터를 생성할 수 있다(S410). 판단부(JD)는 제1 데이터를 화재 판단 기준값과 비교할 수 있다(S420). 화재 판단 기준값은 사전에 정의된 소정 의 값일 수 있다. 판단부(JD)는 제1 데이터가 화재 판단 기준값을 초과할 때, 화재가 발생하였다고 판단하여 화 재 정보(FI, 도 5 참조)를 생성할 수 있다(S430). 화재 정보(FI, 도 5 참조)가 생성된 이후에는 자기 보상 단계 는 종료될 수 있다. 센싱 통신부(ATN)는 화재 정보(FI, 도 5 참조)를 포함하는 화재 감지 신호(SG-1, 도 1 참조)를 중계기(200, 도 1 참조) 및/또는 수신기(300, 도 1 참조)에 송신할 수 있다. 제1 데이터가 화재 판단 기준값 이하일 때는, 화재가 발생하지 않았다고 판단할 수 있고, 소정의 시간 간격마다 온도를 근거로 복수의 데이터들을 생성할 수 있다(S440). 복수의 데이터들은 제1 센서(SS1)로부터 산출된 제1 데이터 및 제2 센서(SS2)로부터 산출된 제2 데이터를 포함할 수 있다. 즉, 처리부(CC)는 소정의 시간 간격마다 제1 센서(SS1) 및 제2 센서(SS2) 각각으로부터 측정한 온도들을 데이터화하여 복수의 데이터들을 생성할 수 있 다. 판단부(JD)는 데이터들 각각의 편차의 절대값을 제2 기준값과 비교할 수 있다(S450). 판단부(JD)는 각각의 편차 의 절대값이 제2 기준값 이상일 때, 온도 센서의 고장으로 판단하고, 화재 판단 기준값을 재설정할 수 있 다(S460). 판단부(JD)는 데이터들 각각의 편차가 제2 기준값 미만일 경우에는 자기 보상 단계는 종료될 수 있다. 제2 기준값은 자기 보상 단계에 진입할 건지 즉, 화재 판단 기준값을 재설정할지 판단의 기준이 되는 값일 수 있다. 자기 보상 데이터는 복수의 데이터들 중 편차의 절대값이 가장 큰 데이터로 정의될 수 있다. 화재 판단 기준값을 재설정할 때는 기존의 화재 판단 기준값에 자기 보상 데이터를 더하여 보정 기준값을 생성 할 수 있다. 보정 기준값은 재설정된 화재 판단 기준값일 수 있다. 센싱 메모리부(MM)는 제2 기준값, 화재 판단 기준값, 보정 기준값, 자기 보상 데이터를 저장할 수 있다. 온도 센서에 문제가 없다면, 제1 센서(SS1)가 측정한 제1 데이터 및 제2 센서(SS2)가 측정한 제2 데이터 각각의 편차의 절대값이 제2 기준값 미만일 수 있다. 상기 편차의 절대값이 제2 기준값 이상인 경우, 즉 제1 데 이터 및 제2 데이터 사이의 편차들 중 일부의 값이 일정 범위에 포함되지 않는 값을 가지는 경우 온도 센서 는 보상이 필요한 상태일 수 있다. 본 발명과 달리, 화재가 발생하지 않았으나 온도를 민감하게 인식하여 순간적으로 높은 온도를 감지할 수 있다. 온도 센서가 민감하게 연기를 인식하는 경우, 화재 판단 기준이 낮아져 화재가 발생하지 않았음에도 화재 가 발생한 것으로 판단될 수 있다. 하지만, 본 발명에 따르면, 자기 보상 단계를 통해 온도 센서의 보상필요 여부가 주기적으로 판단될 수 있고, 자기 보상 데이터를 이용하여 화재 판단 기준값이 재설정됨으로써, 온 도 센서의 민감도가 조절될 수 있다. 따라서, 온도 센서의 신뢰도가 향상될 수 있다. 본 발명에 따르면, 온도 센서들은 자가 검진 단계를 통해 스스로 고장 여부를 주기적으로 판단할 수 있다. 사용자는 고장난 온도 센서를 교체하여 화재 발생에 대비할 수 있다. 또한, 자기 보상 단계를 통해 복수의 온도 센서들의 화재 판단 기준값을 재설정하여 민감도가 높아진 온도 센서들의 감도가 조정될 수 있 다. 즉, 온도 센서들은 재설정 여부에 따라 화재 정보(FI, 도 5 참조)를 보정할 수 있다. 따라서, 신뢰성 이 향상된 화재 경보 시스템을 제공할 수 있다. 도 5는 본 발명의 일 실시예에 따른 제1 서버의 동작을 도시한 도면이다. 도 5를 참조하면, 제1 서버는 디지털트윈 산출부, 빅데이터 수신부, 서버 메모리, 서버 분 석부, 화재 지수 산출부, 및 제어부를 포함할 수 있다. 디지털트윈 산출부는 건축물 및 장소를 가상으로 구현할 수 있다. 디지털트윈 산출부는 서버 메모리 에 모델링 정보(BIM)를 디지털트윈의 형식으로 제공할 수 있다. 상기 건축물 및 장소는 복수의 온도 센서 들이 배치된 건축물일 수 있다. 빅데이터 수신부는 외부 서버(BS)로부터 빅데이터(BD)를 수신할 수 있다. 외부 서버(BS)는 제2 서버(BS)로 지칭될 수 있다. 빅데이터(BD)는 건축물 및 장소에 대한 정보를 포함할 수 있다. 예를 들어, 빅데이터(BD)는 영 화관에 대한 정보, 전통 시장 건물에 대한 정보, 박물관에 대한 정보, 육군 본부에 대한 정보, 공군 본부에 대 한 정보, 창고에 대한 정보, 사격장에 대한 정보, 군 막사에 대한 정보, 및 화력 발전소에 대한 정보 등을 포함 할 수 있다. 빅데이터(BD)는 화재 가능 원인(FC)에 대해 판단하기 위한 주변 환경 데이터를 더 포함할 수 있다. 예를 들어, 상기 주변 환경 데이터는 날짜 별 화재 발생확률에 대응하는 데이터, 시각 별 화재 발생확률에 대응하는 데이터, 장소 별 화재 발생확률에 대응하는 데이터, 기온 별 화재 발생확률에 대응하는 데이터, 습도 별 화재 발생확률에 대응하는 데이터, 날씨 별 화재 발생확률에 대응하는 데이터, 업종 별 화재 발생확률에 대응하는 데 이터, 계절 별 화재 발생확률에 대응하는 데이터, 및 사용자 별 화재 발생확률에 대응하는 데이터 중 적어도 하 나를 포함할 수 있다. 예를 들어, 상기 날짜 별 화재 발생확률에 대응하는 데이터는 요일 별 화재 발생확률 및 월 별 화재 발생확률을 포함할 수 있다. 상기 시각 별 화재 발생확률에 대응하는 데이터는 새벽, 아침, 오후, 저녁, 또는 심야 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 공간 별 화재 발생확률에 대응하는 데이터는 도심, 산간, 해변, 또는 농촌 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 기온 별 화재 발생확률에 대응하는 데이터는 특정 기온 별 화재 지수를 포함할 수 있다. 상기 습도 별 화재 발생확률에 대응하는 데이터는 특정 습도 수치 별 화재 지수를 포함할 수 있다. 상기 날씨 별 화재 발생확률에 대응하는 데이터는 맑은 날, 흐린 날, 또는 비 오는 날 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 업종 별 화재 발생확률에 대응하는 데이터는 가 정, 식당, 공장, 또는 사무실 등으로 구분된 화재 발생확률을 포함할 수 있다. 상기 계절 별 화재 발생확률에 대응하는 데이터는 봄, 여름, 가을, 또는 겨울로 구분된 화재 발생확률을 포함할 수 있다. 상기 사용자 별 화재 발생확률은 연령, 직업, 또는 성별 등으로 구분된 화재 발생확률을 포함할 수 있다. 서버 메모리는 디지털트윈 산출부로부터 송신된 모델링 정보(BIM), 빅데이터 수신부로부터 송신 된 빅데이터(BD), 및 복수의 온도 센서들로부터 송신된 화재 정보(FI)를 포함할 수 있다. 또한, 서버 메모 리는 관계자들의 정보(예를 들어, 연락처, 주소, 또는 이름)가 저장될 수 있다. 서버 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 휘발성 메모리는 DRAM, 또는 SRAM 을 포함할 수 있다 비휘발성 메모리는 플래시 메모리, FeRAM, SSD 또는 HDD를 포함할 수 있다. 서버 분석부는 서버 메모리로부터 모델링 정보(BIM), 빅데이터(BD), 화재 정보(FI)를 수신할 수 있고, 이를 근거로 분석 데이터(DATA)를 생성할 수 있다. 서버 분석부는 분석 데이터(DATA)를 화재 지수 산출부에 제공할 수 있다. 또한, 서버 분석부는 모델링 정보(BIM), 빅데이터(BD), 및 화재 정보(FI)를 근거로 화재 가능 원인(FC)을 산출할 수 있다. 서버 분석부는 모델링 정보(BIM) 및 빅데이터(BD)를 근거로 모델링 정보(BIM)에 대응되는 건축물 및 장소에 발생할 수 있는 화재의 원인들을 산출할 수 있다. 예를 들어, 상기 화재의 원인들은 통신/전 기 배선, 가스버너, 담뱃불, 전자제품 누전 등을 포함할 수 있다. 화재 가능 원인(FC)은 화재의 연소 특성에 따라 분류될 수 있다. 예를 들어, 화재 가능 원인(FC)은 일반가연물 화재, 유류 및 가스 화재, 전기 화재, 금속 화재, 식용유 화재 등의 원인들로 분류될 수 있다. 화재 지수 산출부는 분석 데이터(DATA)를 근거로 화재 지수(FP)를 산출할 수 있다. 화재 지수 산출부(45 0)는 화재가 발생하기 전에 화재의 발생 가능성을 예측할 수 있는 화재 지수(FP)를 산출할 수 있고, 화재 발생 시 화재 발생 정도에 따른 화재 지수(FP)를 산출할 수 있다. 화재 경보 시스템(FAS)은 화재가 발생하기 전, 화 재 발생 가능성을 차단할 수 있고, 화재 발생 시에도 신속하고 적절한 조치를 통해 화재를 조기에 진압할 수 있 다. 화재 지수 산출부는 화재 지수(FP)를 제어부에 제공할 수 있다. 제어부는 화재 지수(FP)가 소정의 설정값을 초과하면 화재가 발생한 것으로 판단할 수 있다. 제어부 는 사용자의 단말기(MD, 도 1 참조)에 알람을 송신할 수 있다. 사용자는 알람을 통해 화재를 인지하고, 신속하 게 조치 및 대피할 수 있다. 또한, 사용자의 화재에 대한 현장 대응력이 향상될 수 있다. 따라서, 신뢰성이 향 상된 화재 경보 시스템을 제공할 수 있다. 이상에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자 또는 해당 기술 분야에 통상의 지식을 갖는 자라면, 후술될 특허청구범위에 기재된 본 발명의 사상 및 기술 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 따라서, 본 발명의 기술적 범위는 명세서의 상세한 설명에 기재된 내용으로 한정되는 것이 아니라 특허청구범위에 의해 정하여져야만 할 것이다."}
{"patent_id": "10-2021-0138480", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 화재 경보 시스템을 도시한 것이다. 도 2는 본 발명의 일 실시예에 따른 온도 센서를 도시한 사시도이다. 도 3은 본 발명의 일 실시예에 따른 온도 센서 동작 방법을 도시한 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 온도 센서의 자가 보상 방법을 도시한 흐름도이다. 도 5는 본 발명의 일 실시예에 따른 제1 서버의 동작을 도시한 도면이다."}
