{"patent_id": "10-2024-7035376", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0174099", "출원번호": "10-2024-7035376", "발명의 명칭": "의료용 이식편 처리의 결함을 인식하기 위한 시스템, 디바이스 및 방법", "출원인": "케레시스 리미티드", "발명자": "크리스찬슨 발더"}}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이식 산물들(graft products)의 물질 성분들을 식별하는 시스템에 있어서:이식 산물의 이미지 데이터를 획득하도록 구성된 이미지 캡처 디바이스; 및인공 신경망을 사용하여 이미지 데이터를 처리하도록 구성된 프로세서를 포함하며, 인공 신경망은 이미지 데이터로부터 이식 산물의 물질들을 로컬화하고 분류하도록 구성되는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 이미지 캡처 디바이스는 자외선 광원, 광학 필터 및 이미지 센서를 포함하는, 이식 산물들의물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 자외선 광원은 파장이 365nm 내지 395nm인 광을 방출하도록 구성되는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 광학 필터는 435nm의 컷온 파장으로 구성된 장파장 통과 필터를 포함하는, 이식 산물들의 물질성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 광학 필터는 435nm보다 큰 파장들에 대해 85%의 투과율을 갖는, 이식 산물들의 물질 성분들을식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 프로세서는 이미지 데이터를 복수의 이미지 타일들로 분할하도록 구성되는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 복수의 이미지 타일들 각각은 동일한 크기를 갖는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 이식 산물은 근막 및 살 중 적어도 하나를 포함하는 원치 않는 물질들을 갖는 물고기 피부를포함하는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 인공 신경망은 컨볼루션 신경망을 포함하는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 컨볼루션 신경망은 스텝식 수축 경로를 포함하고, 스텝식 수축 경로의 각 스텝은:제1 수축 컨볼루션 층;공개특허 10-2024-0174099-3-제2 수축 컨볼루션 층;제1 수축 컨볼루션 층 다음의 제1 수축 정류 층;제2 수축 컨볼루션 층 다음의 제2 수축 정류 층;제2 수축 정류 층 다음의 출력을 저장하는 저장 연산부; 및저장 연산부 다음의 풀링 층을 포함하는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 컨볼루션 신경망은 스텝식 확장 경로를 포함하고, 스텝식 확장 경로의 각 스텝은:제1 확장 컨볼루션 층;제2 확장 컨볼루션 층;제1 확장 컨볼루션 층 다음의 제1 확장 정류 층;제2 확장 컨볼루션 층 다음의 제2 확장 정류 층;제2 확장 정류 층 다음의 업샘플링 층; 및업샘플링 층의 출력을 스텝식 수축 경로의 저장된 출력과 스택하는 연결 연산부를 포함하는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 스텝식 수축 경로와 스텝식 확장 경로는 동일한 수의 스텝들을 포함하는, 이식 산물들의 물질성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 스텝식 수축 경로와 스텝식 확장 경로 각각은 6개의 스텝들을 포함하는, 이식 산물들의 물질성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서, 출력 스텝은:제1 출력 컨볼루션 층;제2 출력 컨볼루션 층;제1 출력 컨볼루션 층 다음의 제1 출력 정류 층;제2 출력 컨볼루션 층 다음의 제2 출력 정류 층; 및제2 출력 정류 층 다음의 시그모이드 층을 포함하는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서, 컨볼루션 신경망은 이식 산물의 각 물질 피처의 영역을 정의하는 이미지를 출력하도록 구성되는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제2항에 있어서, 광학 필터는 400nm 내지 600nm의 컷온 파장으로 구성되는, 이식 산물들의 물질 성분들을 식별하는 시스템."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제6항에 있어서, 프로세서는 이미지 데이터를 복수의 이미지 타일들로 분할하기 전에 이미지 데이터의 크기를조정도록 구성되는, 이식 산물들의 물질 성분들을 식별하는 시스템.공개특허 10-2024-0174099-4-청구항 18 이식 산물들의 물질 성분들을 식별하는 방법에 있어서:이미지 캡처 디바이스로 이식 산물의 이미지 데이터를 캡처하는 단계; 및이미지 데이터로부터 이식 산물의 물질들을 로컬화하고 분류하기 위해 인공 신경망을 사용하여 이미지 데이터를처리하도록 프로세서를 사용하는 단계를 포함하는, 이식 산물들의 물질 성분들을 식별하는 방법."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 이식 산물의 이미지 데이터를 캡처하는 단계는: 자외선 광원으로 이식 산물을 조사하는 단계;이미지 캡처 디바이스의 광학 필터로 이식 산물에 의해 방출 및 반사된 광을 필터링하는 단계; 및이미지 캡처 디바이스의 이미지 센서를 사용하여 필터링된 광을 캡처하는 단계를 더 포함하는, 이식 산물들의물질 성분들을 식별하는 방법."}
{"patent_id": "10-2024-7035376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "컴퓨터 실행 가능한 명령들을 저장한 비일시적 하드웨어 저장 디바이스로서, 컴퓨터 실행 가능한 명령들은 컴퓨터의 하나 이상의 프로세서들에 의해 실행될 때, 적어도:이미지 캡처 디바이스로 이식 산물의 이미지 데이터를 캡처하는 것; 및인공 신경망을 사용하여 이미지 데이터를 처리하도록 프로세서를 사용하여 이미지 데이터에서 이식 산물의 물질들을 로컬화하고 분류하는 것을 실행하도록 컴퓨터를 구성하는, 컴퓨터 실행 가능한 명령들을 저장한 비일시적하드웨어 저장 디바이스."}
{"patent_id": "10-2024-7035376", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이식 산물의 물질 성분을 식별하는 시스템 및 방법은 이식 산물의 이미지 데이터를 얻기 위한 이미지 캡처 디바 이스와 인공 신경망으로 이미지 데이터를 처리하는 프로세서, 인공 신경망은 이미지 데이터로부터 이식 산물의 물질을 로컬화 및 분류하는 프로세서를 포함한다. 이미지 캡처 디바이스는 이식 산물의 자외선 형광 이미징을 위한 광학 필터 및 자외선 광원을 포함할 수 있다. 인공 신경망은 캡처된 이미지 데이터를 사용하여 이식 산물에서 원치 않는 물질, 예를 들어, 근막 또는 물고기 피부의 살과 같은 후속 제거를 위해 원치 않는 물질을 식별할 수 있다."}
{"patent_id": "10-2024-7035376", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 상처 치료 및/또는 기타 조직 치유 적용을 위한 스캐폴드 물질(scaffold material) 또는 이식 산물 (graft product)의 처리에서 물질 성분들을 식별하는 시스템 및 방법에 관한 것이며, 특히 물고기 피부(piscine skin)를 사용하는 것과 관련이 있다."}
{"patent_id": "10-2024-7035376", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 다양한 인체, 동물 및 합성 물질들이 조직 결함을 보강, 복구 또는 교정하기 위한 의료 시술에 설명되거나 사용되고 있다. 척추동물의 세포외 기질(ECM)은 세포를 둘러싸고 지지하는 복잡한 구조적 실체이며, 피부 이식 산물에 특히 유리한 스캐폴드 물질을 제공하는 것으로 밝혀졌다. ECM은 구조 단백질의 복잡한 혼합물로 구성되 어 있으며, 그 중 가장 풍부한 것은 콜라겐과 기타 특수 단백질 및 프로테오글리칸이다. 물고기 피부는 대부분 온전한 천연 생물학적 ECM 성분들의 세포성 스캐폴드를 포함하는 스캐폴드 물질로 처리될 수 있다. 가장 효과적으로 되도록, 피부 ECM의 고유한 3차원 구조, 구성 및 기능이 본질적으로 변경되지 않고 세포 이동, 부착, 증식 및 분화를 지원하는 스캐폴드를 제공하여 조직의 복구 및/또는 교체를 용이하게 해야한 다. 이러한 산물들은 감염, 알레르기 반응 등의 부작용을 방지하기 위해 사용 전에 다양한 처리 단계들을 통해 의료용 피부 대체물로 적합하게 준비되어야 한다. 이러한 처리의 중요한 부분은 건조된 피부 내부에서 원치 않는 특정 물질, 즉 근막과 모든 살의 잔여물을 철저 히 제거하는 것이다. 근막은 주로 미적인 이유로 제거될 수 있지만, 환자의 경우 생선 단백질에 알레르기 반응 을 일으킬 수 있기 때문에 모든 살의 잔여물을 제거하는 것이 중요한다. 제거 처리들은 일반적으로 수작업으로 수행되며, 전문 기술자가 날카로운 도구를 사용하여 피부에서 근막과 살 잔여물들을 조심스럽게 긁어낸다. 이러 한 처리는 물고기 피부의 ECM을 손상시키지 않고 원치 않는 물질을 제거하기 위해 정밀하게 수행되어야 하며, 기술자가 피부를 시각적으로 검사하여 필요한 스크래핑의 적절한 정도를 추정해야 한다. 이러한 작업은 시간이 많이 걸리고, 비용이 많이 들고, 육체적으로 힘들고, 지루하며, 물고기 피부에서 원치 않는 물질을 찾고 식별하 는 데 있어 사람의 실수가 발생할 수 있다. 또한, 숙련된 기술자가 원치 않는 물질을 제거할 때 제거 공정의 물리성 및 시간적 부담으로 인해 기술자는 종종 피로를 느끼기 때문에 제거 과정의 정확성과 일관성이 크게 떨어 질 수 있다. 본 개시의 발명자들은 물고기 피부에서 원치 않는 물질들을 적절하게 식별하고 분류해야 할 상당한 필요성이 품 질 관리 개선, 공정 자동화 및 제조 공정 규모 확대에 여전히 큰 장애물로 남아 있음을 확인했다. 제조 공정에 서 수동 평가의 높은 비용은 물고기 피부에서 형성된 이식 산물의 가용성을 제한하거나 그렇지 않으면 이러한 산물을 더 많은 사람들이 사용할 수 없게 만들 수 있다. 또한 이러한 공정의 수동적 특성은 필연적으로 부정확 성을 초래한다. 인간의 평가가 아닌 자동화된 시스템에 의해서만 달성될 수 있는 수준의 정확성과 일관성을 요 구하는 엄격한 의료 안전 요건들로 인해, 발명자들은 물고기 피부의 성분들을 자동으로 정확하게 찾고 식별하는 시스템 및 방법에 대한 필요성이 점점 더 중요해지고 있음을 확인했다. 불행히도, 이 작업의 어려움은 서로 다른 질감들을 가지고 있지만, 수반되는 물고기 피부와 원치 않는 물질들이 시각적으로 비슷하고 종종 같은 우윳빛 흰색을 공유한다는 사실로 인해 더욱 악화된다. 이러한 장애물로 인해 기존 이미지 인식 접근 방식에 의한 평가는 매우 의심스러운 결과를 초래한다. 따라서 시각적 분석을 사용하여 흰색 근막과 흰색 살 잔여물의 얇은 부분들을 흰색의 깨끗하게 된 피부의 얇은 층과 구별하는 것은 여전히 복잡 하고 어려운 과제이다. 현재 이 과정에서 오류를 방지할 수 있는 개선된 시스템이나 방법은 없으며, 사람의 시 각적 검사에 의존해야 하는 품질 관리도 아직 해결되지 않은 문제로 남아 있다. 따라서 물고기 피부에서 불필요한 물질들을 식별, 분류, 제거하는 작업은 정량적인 정밀도가 아니라 주관적이고 때로는 자의적인 직관, 선호도, 사용자 경험의 문제로 남아 있다. 따라서 물고기 피부를 사용하여 이식 산물을 준비하는 것은 수많은 오류와 비효율성의 영향을 받을 수 있다. 이식 산물(graft products)의 물질 성분들을 식별하고 구별하기 위한 시스템이 제공된다. 이 시스템은 이식 산 물의 이미지 데이터를 획득하도록 구성된 이미지 캡처 디바이스와 인공 신경망을 사용하여 이미지 데이터를 처 리하도록 구성된 프로세서를 포함하며, 인공 신경망은 이미지 데이터로부터 이식 산물의 물질들을 로컬화 (localize) 및 분류하도록 구성된다. 이식 산물의 물질 성분들을 식별하고 구별하기 위한 방법이 또한 제공된다. 이 방법은 이미지 캡처 디바이스로 이식 산물의 이미지를 캡처하고, 프로세서를 사용하여 인공 신경망을 사용하여 이미지 데이터를 처리하여 이식 산물의 이미지에서 이식 산물의 물질들을 로컬화하고 분류하는 단계를 포함한다. 또한, 컴퓨터 실행 가능한 명령들을 저장한 비일시적 하드웨어 저장 디바이스가 제공되며, 컴퓨터 실행 가능한 명령들은 컴퓨터의 하나 이상의 프로세서들에 의해 실행될 때, 이미지 캡처 디바이스로 이식 산물의 이미지를 캡처하고, 인공 신경망을 사용하여 이미지 데이터를 처리하도록 프로세서를 사용하여 이식 산물의 이미지에서 이식 산물의 물질들을 로컬화하고 분류하도록 컴퓨터를 구성한다. 이식 산물의 물질 성분들을 식별하는 시스템 및 방법의 바람직한 실시예들은 자외선 형광 이미징을 활용하는 새 로운 아키텍처를 유리하게 활용하는데, 실시예들에서는 이미지 캡처를 위해 가시 스펙트럼에서 물질의 형광을 활용하고, 특별히 적용된 컨볼루션 신경망들과 결합하여 이식 산물의 물질 성분들을 로컬화하고 분류한다. 이들 또는 다른 개시된 실시예들의 시스템 및 방법은 이식 산물에서 원치 않는 물질들을 제거하는 데 있어 품질 관리 를 제공하기 위해 물고기 피부의 물질 성분들에 대한 포괄적인 특징 맵을 개발할 수 있다. 이 시스템 및 방법은 자동화된 처리 도구들과 함께 종합적인 특징 맵을 사용하여 이식 산물에서 원치 않는 물질들을 자동으로 제거할 수 있다."}
{"patent_id": "10-2024-7035376", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "개요 본 개시의 다른 실시예들에 대한 더 나은 이해는 유사한 참조 문자들이 유사한 요소들을 참조하는 첨부된 도면 과 함께 읽은 다음 설명으로부터 얻어질 수 있다. 본 개시는 다양한 수정들 및 대체 구성들을 허용할 수 있지만, 특정 예시적인 실시예들이 도면에 도시되어 있으 며 아래에 설명되어 있다. 그러나 본 개시를 개시된 특정 실시예들로 한정하려는 의도는 없으며, 오히려 본 개 시의 정신과 범위 내에 속하는 모든 수정, 대체 구성, 조합 및 균등물을 포함하도록 의도되었다는 것을 이해해 야 한다. 본 출원에서 용어가 설명된 의미를 갖는 것으로 명시적으로 정의되지 않는 한, 해당 용어의 의미를 명시적 또는 간접적으로 그 통상적 의미 이상으로 제한하려는 의도가 없음을 이해해야 한다. 본 출원의 목적상, 바람직한 실시예에서 \"이식 산물(graft product)\"이라는 용어는 \"물고기 피부\", \"어류 피 부\", \"세포성 어류 피부\"를 포함하고 또는 이와 유사한 것으로서 Kerecis의 KerecisTM 오메가3 Wound, 대서양 대구(Gadus morhua)의 Kerecis™ 오메가3 세포성 어류 피부, 및 기타 모든 어류 피부 이식 또는 전술한 것과 유 사한 것을 포함할 수 있다. 이러한 이식 산물은 생물학적 구조와 오메가3 다중불포화 지방산(polyunsaturated fatty acids)(PUFAs)을 포함한 생물학적 활성 화합물을 유지하지만, 알레르기성 및 기타 원치 않는 성분들을 제 거하고, 특히 이식 받는 환자로부터 면역 반응을 일으킬 수 있는 조직을 제거하는 처리를 거치게 된다. 이식 산 물의 준비에 사용되는 어류 피부는 근막, 살, 또는 비늘과 같은 기타 원치 않는 물질과 마찬가지로 두께가 다양 할 수 있다. 어류 피부의 두께는 약 0.35mm 내지 2.25mm일 수 있으며, 그 위에 원치 않은 물질의 두께는 약 0.15mm 내지 1.75mm일 수 있다. 어류 피부로부터 이식 산물을 준비하기 위해서는 이식 산물로 사용될 피부 또는 조직으로부터 실질적으로 모든 근막, 살, 또는 기타 원치 않는 물질들을 제거해야 할 필요가 있을 수 있다. 바 람직한 실시예로 설명되었지만, 이식 산물은 대서양 대구(Gadus morhua)에 한정되지 않고, 피부 이식 또는 피부 대체 물질에 사용되는 임의의 다른 수확된 어종, 예를 들어 나일 틸라피아(Oreochromis niloticus) 또는 다른 어종을 포함할 수 있다. 다른 실시예들에서, \"이식 산물\"은 비어류 공급원으로부터 준비될 수 있으며, 이들에는 돼지 피부 이식 산물을 포함하여 수확된 포유류 피부, 또는 인간 동종이식 또는 자가 이식 또는 사체 피부 이식 산물이 포함되지만, 이에 국한되지는 않는다. 이식 산물은 궁극적으로 무세포화(acellularized) 또는 탈세포화 (decellularized) 이식 산물로 준비될 수 있고 또는 세포 피부 이식 산물(즉, 피부 세포가 생존 가능하거나 온전한 상태로 남아있는 이식 산물)일 수 있다. 또한, 이식 산물은 피부 이식 산물로 사용될 비피부 조직(non- skin tissue), 예를 들어 태반 이식물을 포함할 수 있으며, 여기서 이식 산물로 사용될 조직에서 원하지 않는 제2 조직 또는 부분이 제거될 수 있다. 또한, 이식 산물은 생물학적, 합성, 또는 하이브리드 피부 대체물을 포 함할 수 있으며, 이식 산물로 사용하기 전에 원하지 않는 조직, 부분 또는 물질을 제거하기 위해 이식 산물을 검사한다. 마지막으로, 이식 산물은 자가 이식, 동종 이식, 또는 이종 이식 산물을 포함할 수 있고, 인간 환자 에게 사용되는 피부 이식 산물에 국한되지 않으며, 말, 소, 원숭이, 토끼, 생쥐, 쥐, 기니피그, 또는 피부 이식 산물이 적용될 포유류 또는 비포유류를 포함한 기타 비인간 종에 사용되거나 사용되도록 준비되는 자가 이식, 동종 이식 또는 이종 이식 산물도 포함할 수 있다. 본 설명에서 \"컨볼루션 신경망\"은 이미지 등의 분석을 수행하기 위한 인공 신경망으로, 이미지의 픽셀 단위 평 가를 위해 구성된 컨볼루션 커널의 공유 가중치 아키텍처를 기반으로 한다. 컨볼루션 신경망은 자동화된 학습 또는 트레이닝(예컨대, 트레이닝 데이터세트를 사용)을 통해 커널 가중치 및 편향을 조정하고 개선할 수 있다. 실시예들에서, 컨볼루션 신경망은 수축 경로 또는 인코더를 포함하고, 그 뒤에 대칭 확장 경로 또는 디코더를 포함할 수 있으며, 그에 따라 네트워크는 컨볼루션 층들을 포함하고 밀집 층들이 없는 엔드 투 엔드 완전 컨볼 루션 신경망이 될 수 있다. 다양한 실시예들 및 이와 함께 사용하기 위한 구성 요소들 위에서 설명한 바와 같이, 예를 들어 물고기 피부로부터, 일반적으로 이식 산물을 준비할 때, 근막 및 살과 같 은 특정 물질이 면역 반응 및 결과와 같은 원치 않는 반응 또는 결과를 초래하거나, 또는 산물의 미적 또는 품 질에 해로운 영향을 미칠 수 있는 것으로 밝혀졌다. 예를 들어, 물고기 피부의 경우, 물고기 피부의 근막과 살 의 일부 또는 층들은 이들 성분들의 두께가 얇고 우윳빛 흰색을 공유하기 때문에 물고기 피부의 무세포 기질과 확실하게 구분하기가 매우 어려울 수 있다. 기존의 이미징 접근법을 사용하여 이러한 별개의 물질 성분들을 정 확하게 분류하고 로컬화하는 데 어려움이 있기 때문에, 예컨대, 물고기 피부를 긁어내는 동안 또는 이식 산물 준비 후, 이식 산물의 성분 평가는 수동으로 수행되고 비용이 많이 들며, 시각적으로 유사한 물고기 피부의 물 질 성분들 사이를 정확하게 구별하는 데 적합하지 않아 부정확한 경우가 많다. 또한, 물고기 피부의 수동 평가는 정확하고 재현 가능하며 신속한 방식으로 물고기 피부의 유형, 양, 및 배열에 관한 실행 가능한 정보를 얻을 수 없다. 앞서 언급한 바를 감안할 때, 기존 2D 이미지 인식 접근 방식의 한계들과 물질 성분들의 비용이 많이 들고 시간 이 많이 걸리는 수동 식별을 포함하여, 이식 산물의 물질 성분들의 위치, 양, 및 배열을 식별, 평가, 및 결정하 는 기존 접근 방식의 문제점과 단점을 해결하는, 이식 산물의 물질 성분들을 식별하기 위한 시스템 및 방법이 필요하다. 발명자들은 기술자 또는 자동화된 처리 시스템에 실행 가능하고 정량화 가능한 통찰력을 제공하기 위 해 이식 산물의 물질 성분들 사이를 구별하는 데 있어 정확성, 속도, 및 일관성을 향상시키는 물질 식별 시스템 의 필요성을 확인했다. 본 개시에 따른 이식 산물의 물질 성분들을 식별하는 시스템 및 방법의 실시예들은, 정확도가 제한되고 수행하 는 데 엄청난 시간과 노력이 필요한 물고기 피부의 근막 및 살과 같은 이식 산물의 물질 성분들을 구별, 식별, 및 로컬화하는 기존 접근 방식들의 결함을 유리하게 극복한다. 시스템 및 방법의 실시예에서, 자외선 형광 이미징과 개선된 신경망 구조가 시너지 효과를 발휘하여 이식 산물, 바람직하게는 물고기 피부의 물질 성분들을 분류하고 로컬화한다. 자외선 형광 이미징은 이식 산물을 조명하도 록 구성된 자외선 광원을 사용하고 가시 스펙트럼에서 물질 성분들로부터 유도된 형광의 RGB(즉, 적색, 녹색, 청색) 이미지를 캡처, 저장, 및 처리하도록 구성된 이미지 캡처 디바이스를 사용하여 제공될 수 있다. 다양한 실시예들에서, 자외선 광원은 약 365nm 내지 395nm의 파장을 갖는 광을 이식 산물에 조사하도록 구성될 수 있다. 일 양상에서, 자외선 광원은 395nm의 고정된 중심 대역을 가질 수 있으며, 예를 들어, 395nm의 고정된 중 심 대역을 갖는 발광 다이오드를 가질 수 있다. 바람직하게는, 자외선 광원의 파장은 이식 산물을 실질적으로 가열하지 않고 이식 산물을 조사하도록 구성된다. 이미지 캡처 디바이스는 카메라 또는 이와 유사한 디바이스와 같은 센서 디바이스와 통합될 수 있으며, 캡처된 이미지를 수신, 저장, 처리, 및/또는 전송하도록 구성된 컴퓨 팅 디바이스의 애플리케이션을 사용하여 이미지 데이터를 처리할 수 있다. 그리고 캡처된 또는 전송된 이미지들 은 평가되어 이식 산물의 물질 성분들을 분류하고 로컬화할 수 있다. 이식 산물의 물질 성분들을 식별하는 시스템 및 방법은 인공 신경망과 결합하여 물고기 피부에서 유도된 형광의 RGB 이미지를 활용하여 물고기 피부의 근막 및 살과 같은 공간의 물질 성분들을 분할, 매핑, 및 식별한다. 시스템 및 방법은 이미지, 예를 들어 RGB 이미지를 캡처하도록 구성된 이미지 캡처 디바이스와, 인공 신경망, 바람 직하게는 컨볼루션 신경망을 사용하여 이미지 데이터를 처리하도록 구성된 프로세서를 포함하며, 인공 신경망은 이미지 데이터에서 이식 산물의 물질들을 로컬화하고 분류하도록 구성된다. 캡처된 이미지는 본 개시에서 당업 자에게 이해될 수 있는 바와 같이, RGB 또는 트루컬러 이미지, 또는 물고기 피부의 자외선 유도 형광을 캡처하 는 다른 적절한 유형의 컬러 이미지일 수 있다. 이 시스템 및 방법은 물고기 피부의 물질 성분들에 대한 시각적 평가를 수동으로 시행할 필요성을 완화시킨다. 이미지 캡처 디바이스는 캡처된 이미지를 형성하기 위해 들어오는 광을 필터링하는 광학 필터를 통합할 수 있다. 대안적으로, 광학 필터는 이미지 캡처 디바이스와 분리되어 있지만(이미지 캡처 디바이스와 통합되지 않 음), 들어오는 광이 이미지 캡처 디바이스로 들어가기 전에 광학 필터를 통과하도록 배치될 수 있다. 다양한 실 시예들에서, 광학 필터는 장파장을 투과하면서 단파장을 반사시키는 장파장 통과 필터를 포함할 수 있다. 일 양 상에서, 장파장 통과 필터의 컷온 파장은 약 375nm 내지 675nm, 400nm 내지 600nm, 400nm 내지 500nm, 425nm 내지 625nm 또는 일부 실시예들의 경우 약 435nm 범위일 수 있다. 광학 필터는 선택된 파장에서 약 85%의 투과 율을 가질 수 있다. 물리적 광학 필터 없이 캡처된 이미지는 광으로 너무 포화되어 이식 산물의 물질 성분들 사이를 구별하는 것이 불가능해지기 때문에, 광학 필터는 이미지 캡처 디바이스의 하드웨어 구성 요소 또는 물 리적 필터로 반드시 존재해야 할 수 있다. 또한, 이미지 캡처 디바이스에서 획득한 이미지 데이터의 디지털 처 리를 통해 광학 필터링 또는 추가적인 광학 필터링이 제공될 수 있다. 시스템 및 방법 실시예들은 캡처된 이미지의 픽셀 단위 평가를 제공하여 이식 산물의 각 위치에서 물리적 물질 을 표시하고 분류할 수 있다. 다양한 실시예들에서, 각 픽셀은 약 200 내지 800μm2 사이의 크기, 약 300 내지 600μm2 사이의 크기, 또는 일부 실시예의 경우 약 400μm2 크기의 이식 산물의 영역에 대응하도록 구성될 수 있 다. 대안적으로, 적어도 200 픽셀/mm2의 픽셀 해상도, 보다 구체적으로 적어도 400 픽셀/mm2 , 적어도 600 픽셀 /mm2 , 적어도 800 픽셀/mm2 , 적어도 1000 픽셀/mm2 , 적어도 1500 픽셀/mm2, 또는 적어도 2000 픽셀/mm2이 사 용될 수 있다. 바람직하게, 개시된 시스템 및 실시예들에 따른 캡처된 이미지의 픽셀 단위 평가는 매우 적은 양 의 원치 않는 물질도 감지할 수 있으며, 결과물인 이식 산물들의 품질과 정확성을 높일 수 있다는 장점이 있다. 시스템 및 방법은 인공 신경망에 입력하기 위해 캡처된 이미지를 복수의 이미지 타일들로 분할하는 것을 포함할 수 있다. 이미지 타일들은 동일한 크기, 예를 들어 512x512 픽셀들일 수 있으며, 캡처된 이미지는 이미지 타일 들의 분할을 가능하게 하기 위해 필요에 따라 크기가 조정될 수 있다. 바람직하게는, 복수의 이미지 타일들은 적어도 20개의 개별 타일들, 적어도 25개의 개별 타일들, 적어도 30개의 개별 타일들, 적어도 35개의 개별 타일 들, 또는 일부 실시예들의 경우 35개의 개별 타일들을 포함한다. 이미지 타일들은 또한 컨볼루션 신경망이 트레 이닝 데이터세트들의 피드백에 기초하여 각자의 컨볼루션 층들에서 커널, 커널 편향, 또는 커널 가중치를 조정 하도록 허용함으로써, 학습 인공 신경망을 트레이닝 및 재트레이닝하는 데 사용될 수 있다. 일 양상에서, 시스템 및 방법은 각 이미지 타일을 컨텍스트화하기 위한 스텝식 수축 경로 또는 인코더의 제1 단 계를 제공하며, 스텝식 수축 경로는 복수의 수축 스텝들을 포함한다. 스텝식 수축 경로의 각 스텝은 캡처된 이 미지의 각 픽셀을 필터링하여 추가 층들에 입력하기 위한 피처 맵을 형성하도록 구성된 제1 컨볼루션 층과, 이 어서 제1 컨볼루션 층으로부터 피처 맵들의 각 픽셀에 대해 피처의 존재 여부를 결정하는 제1 정류 층 (rectifier layer)을 포함할 수 있다. 각 스텝은 제2 컨볼루션 층과, 이어서 제2 정류 층을 더 포함할 수 있으 며, 제1 정류 층은 제2 컨볼루션 층에 입력을 제공한다. 복수의 스텝들 각각은 또한 제2 정류 층으로부터의 결 과적인 수축된 출력 또는 수축된 피처 맵(예컨대, 이식 산물의 물질 성분들의 결과적인 피처 맵)을 저장하는 것 을 포함할 수 있다. 풀링 층(pooling layer)이 후속 층들 및/또는 스텝들에 대한 입력으로서 저장된 수축된 피 처 맵의 두드러진 피처들을 선택하기 위해 스텝식 수축 경로의 각 스텝에 제공될 수 있다. 다양한 실시예들에 따라, 설명된 인공 신경망의 정류 층들은 비선형 정류 층들을 포함할 수 있다. 비선형 정류 층들은 예를 들어, 0보다 작은 값에 대해서는 0을 반환하지만 0보다 큰 값에 대해서는 입력 값을 직접 반환하는 임계값 연산을 포함할 수 있다. 따라서, 비선형 정류 층들은 선행 컨볼루션 층에서 계산된 값을 취하고 그 값을 출력으로 변환하는 활성화 함수들을 포함할 수 있다. 바람직하게는, 정류 층은 비선형 정류기(ReLu) 유형 활성 화를 포함할 수 있다. 제2 양상에서, 시스템 및 방법은 캡처된 이미지의 피처들을 정밀하게 로컬화하기 위한 대칭 스텝식 확장 경로 또는 디코더의 제2 단계를 제공하며, 스텝식 확장 경로는 복수의 확장 스텝들을 포함한다. 대칭 스텝식 확장 경 로의 각 스텝은 제1 컨볼루션 층과 이어서 제1 정류 층 및 제2 컨볼루션 층과 이어서 제2 정류 층을 포함할 수있으며, 제1 정류 층은 제2 컨볼루션 층에 입력을 제공한다. 각 스텝은 제2 정류 층 다음에 업샘플링 층을 더 포함할 수 있으며, 업샘플링 층은 업샘플링된 피처 맵을 형성한다. 대칭 스텝식 확장 경로의 각 스텝은 업샘플 링된 피처 맵과 저장된 수축된 피처 맵의 연결 또는 스택 연산(concatenation or stacking operation)을 포함 할 수 있다. 연결 연산을 위해 선택된 업샘플링된 피처 맵과 저장된 수축된 피처 맵은 공통적이거나 동일한 크 기를 갖는 것에 기초하여 선택될 수 있다. 제3 양상에서, 시스템 및 방법은 출력 연산 또는 스텝의 제3 단계를 제공하며, 이는 제1 컨볼루션 층과 이이서 제1 정류 층 및 제2 컨볼루션 층과 이어서 제2 정류 층을 포함한다. 출력 연산은 제2 정류기 층 다음에 이어지 는 시그모이드 층을 더 포함한다. 이미지 캡처 디바이스 및/또는 컴퓨팅 디바이스는 위에서 언급한 스텝들 및 본 명세서에 설명된 다른 스텝들을 로컬하게 수행하도록 구성될 수 있다. 컴퓨팅 디바이스는 저장소, 프로세서, 전원, 및 인터페이스를 포함할 수 있다. 저장소의 명령들은 본 명세서에 설명된 바와 같이 하나 이상의 신경망을 활용하여 이미지를 캡처하고, 이 식 산물의 물질 성분들을 분류하고, 로컬화하기 위해 프로세서에 의해 실행될 수 있다. 실시예들에서, 상기 스 텝들은 로컬하게 수행되지만, 본원에 설명된 스텝들 중 하나 이상은 클라우드 컴퓨팅에 의해 수행될 수 있으며, 캡처된 이미지는 원격 서버로 전송되고, 원격 서버에 위치한 프로세서는 이식 산물의 물질 성분들을 분류 및 로 컬화하도록 구성될 수 있음을 이해할 수 있을 것이다. 도 1a는 가장 기본적인 형태로 간주될 수 있는 본 개시의 실시예에 따라 이식 산물의 물질 성분들을 식별 하기 위한 시스템의 개략도이다. 시스템은 이식 산물을 조명하도록 구성된 자외선 광원과 이식 산물의 이미지를 캡처하도록 구성된 이미지 캡처 디바이스를 포함한다. 캡처된 이미지는 이식 산물의 유도 형광(induced fluorescence)을 포함한다. 이미지 캡처 디바이스는 이미지 캡처 디바이스 로 들어오는 미리 결정된 파장 아래의 입사광을 필터링하도록 구성된 광학 필터를 포함할 수 있다. 도 1b는 이식 산물의 물질 성분들식별하기 위한 시스템의 또 다른 실시예의 개략도이다. 시스템(15 0)은 제1 자외선 광원 및 제2 자외선 광원 - 각 자외선 광원(121, 123)은 이식 산물을 조명하도 록 구성됨 -, 및 이식 산물의 이미지를 캡처하도록 구성된 이미지 캡처 디바이스를 포함한다. 일 실 시예에서, 이미지 캡처 디바이스는 소니 IMX219 8메가픽셀 센서 또는 이와 동등한 이미징 디바이스를 포함 할 수 있다. 8 메가픽셀 센서가 사용될 수 있지만, 12 메가픽셀 센서, 20 메가픽셀 센서, 또는 30 또는 40 메가 픽셀 센서와 같은 더 큰 메가픽셀 센서를 사용하여 더 높은 해상도를 얻을 수 있다. 이미지 캡처 디바이스(13 0)는, 이식 산물이 이식 산물이 놓여 있는 컨베이어에 의해 이미지 캡처 디바이스의 이미징 방 향에 대해 직접 횡단 방향으로 이송될 때, 이식 산물의 정지 이미지 또는 비디오 이미지, 또는 둘 다를 획득하 도록 구성될 수 있다. 특정 실시예들에서, 이식 산물은 클립, 바, 흡입 디바이스 및/또는 플렉시글라스 시 트와 같은 투명 커버와 같은 구속 요소들에 의해 제자리 또는 컨베이어 상에 고정될 수 있다. 컨베이어 벨트일 수 있는 컨베이어는 컨베이어 구동 시스템을 포함할 수 있는 컨베이어 제어 디바이스 에 의해 제어된다. 컨베이어 제어 디바이스는 컨베이어의 속도 및 방향을 변경할 수 있다. 또한, 컨베이어 제어 디바이스는 컴퓨팅 디바이스에 의해 제어된다. 캡처된 이미지는 이식 산물의 유 도 형광을 포함한다. 이미지 캡처 디바이스는 이미지 캡처 디바이스로 들어오는 미리 결정된 파장 아래의 입사광을 필터링하도록 구성된 광학 필터를 포함할 수 있거나, 또는 시스템이 포함할 수 있다. 시스 템은 컴퓨터 또는 컴퓨팅 디바이스를 포함하며, 이는 이하에서 더 상세히 설명될 것이다(예를 들어, 아래 도 8에 도시된 실시예에서). 컴퓨팅 디바이스는 이미지 캡처 디바이스로부터 이미지 데이터, 예를 들어 정지 이미지 데이터 또는 비디 오 이미지 데이터의 형태로 이미지 데이터를 수신한다. 컴퓨터 디바이스는 또한 제1 자외선 광원 및 제2 자외선 광원을 제어할 수 있다. 컴퓨팅 디바이스와 제1 및 제2 자외선 광원들(121, 123)과 이미지 캡 처 디바이스와 컨베이어 제어 디바이스 사이의 하드 와이어 연결들이 다양한 실시예들에 포함될 수 있지만, 이러한 구성 요소들 사이의 데이터는 블루투스와 같은 무선 통신을 통해 전송될 수도 있다. 또한, 도 1b는 컴퓨팅 디바이스와 제1 및 제2 자외선 광원들(121, 123)과 이미지 캡처 디바이스와 컨베이어 제 어 디바이스 사이의 데이터 연결(유선 또는 무선)을 갖는 실시예를 도시하지만, 컴퓨팅 디바이스는 제1 및 제2 자외선 광원들(121, 123) 또는 컨베이어 제어 디바이스의 제어를 반드시 필요로 하지는 않는다. 특히 중요한 것은 컴퓨팅 디바이스가 이미지 캡처 디바이스로부터 이미지 데이터를 수신한다 는 것이다. 본 명세서에 더 설명된 바와 같이, 컴퓨팅 디바이스는 입력 및 출력, 하나 이상의 프로세서들, 및 메모리 저장소를 포함한다. 또한, 다른 실시예에서, 컴퓨팅 디바이스는 이미지 캡처 디바이스에 물리적으로 결합되어, 컴퓨팅 디바이스와 이미지 캡처 디바이스가 일체형 유닛으로 제공된다. 도 1b의 실시예에서, 제1 자외선 광원은 컨베이어의 평면으로부터 수직 방향에 대하여 각도(a1)로 자 외선 광을 방출하도록 배치된다. 제2 자외선 광원은 각도(a1)와 유사한 각도로 자외선 광을 방출하지만, 반대쪽 컨베이어에 배치될 수 있다. 또는 제2 자외선 광원은 각도(a1)와 상이한 각도(b1)로 배치될 수 있다. 각도(a1) 및 각도(b1)는 수직 방향에 대하여 0° 내지 60° 또는 0° 내지 45°의 범위, 일부 실시예 들에서는 0° 내지 30° 또는 30° 내지 60°의 범위, 또는 특정 실시예에서는 약 45°의 범위에 있을 수 있다. 마찬가지로, 제 2 자외선 광원은 컨베이어의 평면 위의 높이(h1)에 배치된다. 제1 자외선 광원 은 컨베이어의 평면 위의 유사한 높이에 배치될 수 있다. 또는 제1 자외선 광원은 제2 자외선 광원 의 제1 높이(h1)와 상이한 제2 높이(h2)로 배치될 수 있다. 높이(h1) 및 높이(h2)는 4cm 내지 12cm 또는 6cm 내지 10cm의 범위, 또는 특정 실시예에서는 약 8cm의 범위일 수 있다. 또한, 이미지 캡처 디바이스는 컨베 이어의 평면 위의 높이(hc)에 배치된다. 다양한 실시예들에서, 높이(hc)는 이미지 캡처 디바이스의 요건들 에 따라 결정될 수 있는 바와 같이 60cm 미만 또는 30cm 미만, 특히 12cm 미만 또는 6cm 미만, 또는 2cm 내지 8cm 사이, 특히 4cm 내지 6cm 사이이거나 약 5cm, 특히 약 5.3cm일 수 있다. 일부 실시예들에서, 이미지 캡처 디바이스의 구성 요소들은 환경으로부터의 외부 광을 제한하거나 이미지 캡처 디바이스의 구성 요소들을 지지하 기 위해 하우징 또는 프레임에 제공되거나 둘러싸여 있을 수 있다. 이미지 캡처 디바이스로부터 이미지 데이터를 수신하면, 컴퓨팅 디바이스는 컴퓨팅 디바이스의 메모 리 저장소에 이미지 데이터를 저장한다. 컴퓨팅 디바이스의 하나 이상의 프로세서들은 인공 신경망에 입력 하기 위해 캡처된 이미지를 복수의 이미지 타일들로 분할할 수 있다. 이미지 타일들은 동일한 크기, 예를 들어 512x512 픽셀들일 수 있으며, 캡처된 이미지는 이미지 타일들의 분할을 가능하게 하기 위해 필요에 따라 크기가 조정될 수 있다. 바람직하게는, 복수의 이미지 타일들은 적어도 20개의 개별 타일들, 적어도 25개의 개별 타일 들, 적어도 30개의 개별 타일들, 적어도 35개의 개별 타일들, 또는 일부 실시예들의 경우 35개의 개별 타일들을 포함한다. 이미지 타일들은 또한 컨볼루션 신경망이 트레이닝 데이터세트들의 피드백에 기초하여 각자의 컨볼루 션 층들에서 커널, 커널 편향, 또는 커널 가중치를 조정하도록 허용함으로써, 학습 인공 신경망을 트레이닝 및 재트레이닝하는 데 사용될 수 있다. 도 1c는 이식 산물의 물질 성분들식별하기 위한 시스템의 또 다른 실시예의 개략도이다. 시스템(17 0)은 적어도 제1 이미지 캡처 디바이스 및 제2 이미지 캡처 디바이스를 포함하는 복수의 이미지 캡처 디바이스들을 포함하며, 각 이미지 캡처 디바이스(131, 133)는 이식 산물의 이미지를 캡처하도록 구성된다. 자외선 광원은 확산된 원형 광 또는 다른 형상(예를 들어, 사각형, 막대형 등)의 확산된 광의 형태로 시스템에 제공될 수 있으며, 자외선 광원은 이식 산물을 조명한다. 복수의 이미지 캡처 디바이스들(131, 133) 각각은 본 개시의 다른 실시예들에서 상세히 논의되는 바와 같이, 대응하는 광학 필터 를 포함하거나 제공될 수 있다. 일 실시예에서, 이미지 캡처 디바이스들(131, 133) 각각은 12메가픽셀 센서 또는 이에 상응하는 이미징 디바이 스를 포함할 수 있다. 이미지 캡처 디바이스들(131, 133)은 이식 산물의 정지 이미지 또는 비디오 이미지, 또는 둘 모두를 획득하도록 구성될 수 있으며, 각 이미지 캡처 디바이스(131, 133)에 의해 캡처된 이미지 데이터는 신경망에 의해 개별적으로 처리되거나 처리 전에 병합될 수 있다. 두 개 이상의 이미지 캡처 디바이스들(131, 133)의 사용은 이식 산물을 이동할 필요 없이 한 번에 이식 산물을 이미징할 수 있도록 구성될 수 있 다. 도 2a 및 도 2b는 본 개시에 따른 이식 산물의 캡처 이미지에서 이미지 타일들(202, 204)의 예들을 포함한다. 예시된 실시예에서, 이미지 타일들(202, 204)은 근막, 살, 및 피부를 포함하는 물질 성분들을 나타낸다. 이미지 캡처 디바이스의 자외선 형광과 광학 필터의 결합 효과의 결과로 근막은 진한 파란색 또는 자주색으로, 살 은 진한 노란색으로, 피부는 밝은 파란색으로 보일 수 있다. 그러나, 캡처된 이미지들의 이미지 타일들(202, 204)에서 근막, 살, 및 피부를 정확하게 구별하고 로컬화하는 것은 색상이 유사하고 그 위에 있는 개별 물질 성 분들 간의 대비가 부족하기 때문에 여전히 어려운 과제이다. 따라서, 본 개시에 따른 이미지 타일들에서 물질들 의 유리한 로컬화 및 분류를 위해서는 인공 신경망과의 협력이 필요하다. 도 3은 본 개시의 실시예들에 따라 이식 산물의 각 위치에서 물리적 물질을 표시하고 분류하기 위해 캡처된 이 미지를 픽셀 단위로 평가하는 방법의 흐름도이다. 초기 스텝에서, 이식 산물이 시스템에 제공되 고 자외선 광 하에서 이식 산물의 이미지가 캡처된다. 캡처된 이미지를 평가하기 위해, 캡처된 이미지는 동일한크기의 복수의 이미지 타일들로 분할될 수 있다. 도 2a 및 도 2b의 예시적인 예들에서, 각 이미지 타일은 적색, 녹색 및 청색 각각에 대해 512x512 픽셀의 치수를 가지므로, 각 이미지 타일은 512x512x3 행렬을 형성한 다. 행렬의 각 항목은 0에서 255 까지의 8비트 값을 가질 수 있다. 각 이미지 타일은 물고기 피부의 캡처된 이 미지에 표시된 성분 물질들을 분류하고 로컬화하기 위해 인공 신경망에 입력될 수 있다. 일 양상에서, 인공 신경망은 컨볼루션 신경망을 포함할 수 있으며, 이 방법은 제1 단계에서 각 이미지 타일을 컨텍스트화하기 위해 컨볼루션 신경망의 스텝식 수축 경로 또는 인코더에 각 이미지 타일을 입력하는 것을 포함할 수 있다. 도 4에 도시된 바와 같이, 스텝식 수축 경로는 복수의 수축 스텝들(410, 422, 424)을 포 함할 수 있으며, 각 스텝은 추가 층들에 입력하기 위한 피처 맵들을 형성하기 위해 캡처된 이미지의 각 픽셀을 필터링하도록 구성된 제1 수축 컨볼루션 층과, 이어서 제1 수축 컨볼루션 층으로부터 피처 맵들의 각 픽셀에 대해 피처의 존재 여부를 결정하는 제1 수축 정류 층를 포함할 수 있다. 각 스텝은 제2 수축 컨볼 루션 층과 이어서 제2 수축 정류 층을 더 포함할 수 있으며, 제1 수축 정류 층은 제2 수축 컨볼 루션 층에 입력을 제공한다. 복수의 스텝들 각각은 또한 제2 수축 정류 층으로부터의 결과적인 수축 된 출력 또는 수축된 피처 맵, 예를 들어 이식 산물의 물질 성분들의 피처 맵을 저장하는 것을 포함할 수 있다. 풀링 층이 후속 층들에 대한 입력으로서 저장된 수축된 피처 맵의 두드러진 피처들을 선택하기 위해 스텝 식 수축 경로의 각 스텝에 제공될 수 있다. 수축 경로의 스텝은 다음 스텝(422, 424)의 제1 수축 컨 볼루션 층에 입력으로 제공되는 이전 스텝으로부터의 수축된 피처 맵을 사용하여 여러 번 반복될 수 있다. 도 4에 도시된 바와 같이, 수축 경로는 복수의 스텝들, 바람직하게는 6 스텝들로 구성될 수 있다. 제2 양상에서, 시스템 및 방법은 캡처된 이미지의 피처들을 정밀하게 로컬화하기 위해 각 이미지 타일을 대칭 스텝식 확장 경로 또는 디코더에 입력하는 것을 포함하는 컨볼루션 신경망의 제2 단계를 포함하며, 스텝식 확장 경로는 복수의 확장 스텝들(510, 522, 524)을 포함할 수 있다. 대칭 스텝식 확장 경로의 각 스 텝은 제1 확장 컨볼루션 층과 이어서 제1 확장 정류 층 및 제2 확장 컨볼루션 층과 이어서 제2 확장 정류 층을 포함할 수 있으며, 제1 확장 정류 층은 제2 확장 컨볼루션 층에 대한 입력 을 제공할 수 있다. 각 스텝은 제2 확장 정류 층 다음에 업샘플링 층를 더 포함할 수 있으며, 업샘 플링 층은 업샘플링된 피처 맵을 형성한다. 대칭 스텝식 확장 경로의 각 스텝은 수축 경로의 스 텝으로부터 저장된 수축된 피처 맵과 업샘플링된 피처 맵의 연결 또는 스택 연산을 포함할 수 있다. 연결 연산을 위해 선택된 업샘플링된 피처 맵과 저장된 수축된 피처 맵은 공통적이거나 동일한 크기를 갖는 것 에 기초하여 선택될 수 있다. 확장 경로의 스텝은 다음 스텝(522, 524)의 제1 확장 컨볼루션 층(51 2)에 입력으로 제공되는 이전 스텝으로부터의 확장된 피처 맵을 사용하여 여러 번 반복될 수 있다. 도 5에 도시 된 바와 같이, 확장 경로는 복수의 스텝들을 포함할 수 있으며, 바람직하게는 수축 경로와 동일 한 수의 스텝들, 예를 들어 6개의 스텝들을 포함할 수 있다. 도 4 및 도 5의 비교에서 알 수 있듯이, 수축 경로와 확장 경로는 실질적으로 대칭적인 경로들이다. 일 양상에서, 일부 실시예들의 컨볼루션 신경망은 도 10에 도시된 바와 같이 U자형 아키텍처를 가질 수 있다. 도 10의 도면에서, 스텝들(1410, 1422, 1424, 1510, 1522, 1524)은 도 4 및 도 5의 스텝들(410, 422, 424, 510, 522, 524)에 대응할 수 있으며, 수축 경로 및 확장 경로는 U자형 아키텍처의 대칭 측면들을 형성한다. 도 10의 실시예에서는 이해를 돕기 위해 4-스텝 심층 네트워크만을 도시하였음에 유의하여야 한다. 바람직하게는, 본 개시의 인공 신경망들은 다른 실시예들에서 상세히 설명된 바와 같이, 더 큰 6-스텝 심층 네 트워크를 포함한다. 제3 양상에서, 시스템 및 방법은 업-샘플링된 피처 맵 및 저장된 수축된 피처 맵으로부터 연결되거나 스택된 출 력을 출력 스텝에 입력하는 것을 포함하는 신경망의 제3 단계를 제공한다. 도 6에 도시된 바와 같이, 출력 스텝은 제1 출력 컨볼루션 층과 이어서 제1 출력 정류 층 및 제2 출력 컨볼루션 층과 이어 서 제2 출력 정류 층을 포함할 수 있다. 출력 스텝은 제2 출력 정류 층 다음에 시그모이드 층 을 포함할 수 있다. 시그모이드 층는 모든 픽셀 값들을 0과 1 사이의 값들로 매핑하도록 구성된 활성 화 함수를 포함할 수 있으며, 이를 통해 각 픽셀에 대해 원치 않는 물질이 존재하는지 여부를 이진 방식으로 결 정할 수 있다. 출력 스텝은 이식 산물의 물질 성분들을 식별하고 로컬화하는 분류된 이미지의 형태로 출력하는 것을 제공한다. 분류된 이미지는 근막 및 살과 같은 원치 않는 물질을 물고기 피부와 구별하는 오버레이를 갖는 캡처된 이미지 를 포함할 수 있다. 도 7a 및 도 7b는 도 2a 및 도 2b의 RGB 이미지들에 대응하는 캡처된 이미지들(702, 704)을 도시하며, 캡처된 이미지들(702, 704)은 설명된 실시예들의 이미지 캡처 디바이스에 의해 캡처된다. 본 개시의 인공 신경망은, 캡처된 이미지들(702, 704)로부터 원치 않는 물질 및 물고기 피부의 예측된 분류 및 로컬화를포함하는 오버레이 이미지(706, 708)를 준비하도록 구성될 수 있다. 오버레이 이미지들(706, 708)에서, 물고기 피부로 분류된 픽셀들은 채워져 검게 나타나는 반면, 원치 않는 물질들로 분류된 픽셀들은 열려 있거 나 투명한 영역으로 남아 있다. 전술한 바와 같이, 시그모이드 층은 이러한 목적을 위해 모든 픽셀 값들을 0과 1 사이의 값들로 매핑하도록 구성될 수 있으며, 0.5 미만의 모든 값들은 검게 표시되고 0.5 이상의 모든 값 들은 하얗게 또는 투명으로 표시되어 예측의 이진 이미지를 반환한다. 살과 근막을 각각 피부와 그리고 서로 구 별하는 것과 같은 다른 다중 클래스 실시예들에서, 최종 컨볼루션 연산은 결함의 클래스들의 수와 동일한 수의 필터들을 사용할 수 있고, 시그모이드 층은 각 픽셀에 대한 클래스별 스코어(score-per-class)를 반환하기 위해 아그맥스(argmax) 또는 소프트맥스(softmax) 활성화 기능으로 대체될 수 있다. 분류된 이미지들(714, 71 6)은 캡처된 이미지들(702, 704) 및 오버레이 이미지들(706, 708)의 조합을 포함한다. 당업자에게 명백한 바와 같이, 분류된 이미지들(714, 716)은 원치 않는 물질이 남아 있는 각 픽셀을 드러낸다. 도 3의 방법으로 돌아가서, 분류된 이미지들(714, 716)은 이식 산물들로부터 원치 않는 물질들의 제거 를 안내하는 데 사용될 수 있다. 다양한 실시예들에서, 원치 않는 물질의 제거는 수동으로 또는 자동화된 기계 또는 프로세스에 의해 수행될 수 있다. 바람직하게는, 방법은 반복적인 공정으로서 반복되어 원치 않 는 물질이 없는 물고기 피부를 준비하도록 보장할 수 있다. 본 개시에 따른 방법 및 시스템의 실시예들은 분류된 이미지들(714, 716)을 사용자에게 표시하도록 구성된 사용 자 인터페이스를 더 포함할 수 있다. 분류된 이미지들은 프로세서에 의해 라벨링되어, 예를 들어, 제거할 원치 않는 물질의 위치를 강조하도록 구성된 경계 상자, 태그, 또는 색상의 변경을 포함하는 라벨링된 이미지를 출력 할 수 있다. 유사한 방식으로, 사용자 인터페이스는 사용자가 시간에 따른 진행 상황을 이해할 수 있도록, 이식 산물에서 원치 않는 물질을 제거하는 스텝들에 의해 선택된 일련의 분류된 이미지들 간의 비교를 제공할 수 있 다. 사용자 인터페이스의 다양한 실시예들은 키보드, 제어판, 컴퓨터 마우스 또는 이와 유사한 디바이스들과 같 은 통상적인 제어 디바이스를 포함하여 디스플레이 화면, 터치 스크린, 스피커, 가청 경보, 표시등 등을 포함하 여 사용자와의 상호작용을 용이하게 하기 위한 다양한 입력 및 출력 디바이스들을 포함할 수 있다. 도 8은 본 개시의 실시예에 따른 이식 산물의 물질 성분들을 식별하기 위한 컴퓨팅 디바이스를 포함 하는 시스템의 도면이다. 시스템은 이식 산물을 조명하도록 구성된 자외선 광원과 이식 산 물의 이미지를 캡처하도록 구성된 이미지 캡처 디바이스를 포함한다. 이미지 캡처 디바이스는 이미지 캡처 디바이스로 들어오는 미리 결정된 파장 아래의 입사광을 필터링하도록 구성된 광학 필터를 포 함할 수 있다. 컴퓨팅 디바이스는 전원, 프로세서, 통신 모듈, 및 저장소를 포함할 수 있다. 저장소는, 프로세서에 의해 실행될 때, 프로세서로 하여금 본 명세서에 설명된 스텝들 중 하나 이상을 수행하도록 하는, 특히 이미지 데이터를 수신하고 이미지 데이터로부터 이식 산물의 물질을 로컬화 및 분류하도록 하는, 비일시적 형태로 저장된 이식 산물의 물질 성분들을 식별하기 위한 시스템을 동작시키기 위한 명령들을 포함할 수 있다. 컴퓨팅 디바이스는 도 1 내지 도 7의 실시예들과 관련하여 전술한 인공 신경망 을 적용하도록 구성된 하나 이상의 인공지능 모듈들을 포함할 수 있다. 실시예들에서, 컴퓨팅 디바이스는 이미지 캡처 디바이스를 동작시켜 RGB 이미지 데이터와 같은 이미지 데 이터를 캡처하고, 상기한 바와 같이 인공지능 모듈에 저장된 인공 신경망을 이용하여 캡처된 이미지 데이 터를 로컬적으로 및 실질적으로 실시간으로 처리하여 분류된 및 로컬화된 이미지들을 출력하도록 구성될 수 있 다. 도 4 및 도 5와 관련하여 전술한 바와 같이, 본 개시의 실시예들에 따른 인공 신경망은, 캡처된 이미지의 각 픽 셀을 필터링하여 추가 층들에 입력하기 위한 피처 맵을 형성하도록 구성된 복수의 컨볼루션 층들(412, 416, 512, 516, 612, 616)을 포함할 수 있다. 도 9a는 입력 행렬, 커널, 및 결과를 포함하는 컨볼루 션 연산의 도면이다. 본 개시의 다양한 실시예들에 따른 입력 행렬은 이식 산물로부터 캡처된 이미지 데이터를 포함할 수 있다. 실시예에서, 이미지 데이터는 캡처된 이미지의 각 픽셀 위치에 대한 색상 강도 값들 , 예를 들어 0 내지 255 범위의 8비트 값을 포함할 수 있다. 도 9a에서는 이해를 용이하게 하기 위해 단지 4x4 크기를 갖는 단순화된 2차원 입력 행렬로 도시되어 있지만, 개시된 실시예들에서의 이미지 데이터는 RGB 이미지에서 적색, 녹색 및 청색의 각 강도에 대한 색상 강도 값들을 포함하는 3차원 행렬을 구성하는 것이 바람직할 수 있다. 일 실시예에서, 캡처된 이미지의 이미지 데이터는 3280x2190 해상도의 8메가픽셀 이미지를 포함할 수 있다. 캡 처된 이미지는 3584x2560으로 크기가 조정되어 동일한 크기의 이미지 타일들의 생성을 용이하게 할 수 있는데,예를 들어 크기가 조정된 이미지를 512x512 픽셀 크기의 정확히 35개 개별 이미지 타일들로 잘라낸다. 이 예에 서, 개별 이미지 타일들은 512x512x3의 크기를 갖는 3차원 입력 행렬을 포함하며, 512x512는 이미지의 픽셀 위 치들을 포함하고 3차원의 3개의 개별 값들은 이미지 데이터의 적색, 녹색, 청색 색상의 강도들이 된다. 도 9a를 참조하면, 커널은 출력 결과에서 입력 행렬의 피처들을 증진시키기 위해 입력 행렬 에 적용될 수 있다. 커널은 입력 행렬의 색상 강도 값들을 변환하기 위한 복수의 미리 결 정된 가중치 값들을 포함할 수 있다. 예시된 입력 행렬과 관련하여 논의된 바와 같이, 도 9a에서는 2 차원 행렬로 도시되어 있지만, 개시된 실시예들에서의 커널은 3차원 입력 행렬에 대응하는 3차원 행렬을 포함하는 것이 바람직할 수 있다. 커널은 고정된 경로 및 폭으로 입력 행렬에 적용된다. 본 개시의 3 차원 행렬의 경우, 커널은 색상 차원을 통해 앞쪽에서 뒤쪽으로 이동하고 미리 결정된 폭으로 왼쪽에서 오른쪽 으로, 위쪽에서 아래쪽으로 이동할 수 있다. 도 9a의 2차원 도면에 따르면, 커널은 제1 위치로부터 제2 위치, 제3 위치, 및 제4 위치로 이동될 수 있다. 각 위치(940, 942, 944, 946)에 대한 컨볼루션 연산 결과의 항목은 입력 행렬의 색상 강도 값 들과 커널의 미리 결정된 가중치 값들 사이의 연산에 기초하여 계산된다. 도 9a의 예시적인 예 에 따르면, 커널의 제1 위치에 대한 컨볼루션 연산 결과의 항목은 다음과 같이 계산될 수 있다: 45*0+12*(-1)+5*0+22*(-1)+10*5+35*(-1)+88*0+26*(-1)+51*0=-45 결과의 항목은 인공 신경망의 추가 층들에 입력하기 위해 각자의 경로에서 수축된 피처 맵 또는 확장 된 피처 맵과 같은 피처 맵들을 누적적으로 형성할 수 있다. 도 9a의 도시된 실시예에 따른 예에서, 3차원 행렬 에 대한 컨볼루션 연산은 적색, 녹색, 및 청색의 각 입력 행렬에 대해 한 번씩, 도시된 컨볼루션 연산을 세 번 반복하는 것으로 생각될 수 있다. 이러한 컨볼루션 연산의 예로서, 도 9a의 실시예는 적색, 녹색, 및 청색의 각 입력 행렬에 대해 세 번 반복되며 단일 필터 채널을 포함하고 피처 맵에 대응한다. 추가 필터 채널들이 제공되 는 경우 추가 피처 맵들이 생성되어 이미지 데이터에서 피처들을 검출하는 데 있어 감도와 디테일이 향상된다. 그리고 피처 맵들은 도 4 내지 도 6에 도시된 바와 같이 정류된 비선형 유닛 층을 통해 배치되어 컨볼루션의 스 코어에 기초하여 이미지의 특정 위치에 피처가 존재하는지 여부를 결정할 수 있다. 풀링(pooling)을 사용하여 피처 맵들에서 가장 큰 값들을 선택하고 이를 후속 층들에 대한 입력들로 사용하여 가장 두드러진 피처들을 더 욱 증진시킬 수 있다. 본 개시의 방법 및 시스템에서, 제1 수축 스텝은 각 컨볼루션 층에 64개의 필터 채널들을 포함할 수 있으며, 필 터 채널들의 수는 각 수축 스텝에서 두 배로 된다. 따라서, 6개의 수축 스텝들이 있는 경우, 최종 수축 스텝의 컨볼루션 층들은 4,096개의 필터 채널들을 포함할 수 있다. 그런 다음 제1 확장 스텝은 최종 확장 스텝이 제1 수축 스텝과 각 컨볼루션 층에서 동일한 수의 필터 채널들을 가질 때까지 각 컨볼루션 층에서 필터 채널들의 수 를 절반으로 줄일 수 있다. 출력 스텝은 식별하고자 하는 물질의 클래스들의 수와 동일한 수의 필터 채널들을 포함할 수 있으며, 이러한 필터 채널들은 신경망의 출력으로 제공되는 이미지들로 데이터를 수집하는 역할을 한 다. 예를 들어, 이식 산물의 피부와 원치 않는 물질 사이를 구별하는 것은 데이터를 단일 이미지로 수집하여 흑 백 이미지로 출력하기 위해 단 하나의 필터만을 필요로 할 수 있지만, 살, 근막 및 피부를 구별하는 거은 3개의 필터들을 필요로 한다. 본 개시의 다양한 양상들에 따라, 인공 신경망은 자동화된 학습 또는 트레이닝, 예를 들어 사용자 주석이 달린 이미지들에 기초한 트레이닝 데이터세트들을 사용하여 커널 가중치들을 조정 및 개선할 수 있다. 이러한 방식으 로, 미리 결정된 가중치 값들, 경로, 및 컨볼루션 연산들의 폭을 포함하는 커널들의 구성은 인 공 신경망의 의사 결정 부분을 포함할 수 있다. 다른 양상에서, 인공 신경망의 의사 결정 부분은 개시된 실시예 들 및 특징들로부터 이해될 수 있는 바와 같이 추가 파라미터들을 갖는 정류된 비선형 유닛 층 및 커널들의 구 성을 포함할 수 있다. 도 9b는 입력 행렬, 커널, 및 결과를 포함하는 또 다른 컨볼루션 연산의 3차원 도면이다. 컨볼루션 연산에서와 같이, 이미지 데이터는 캡처된 이미지의 각 픽셀 위치에 대한 색상 강도 값들을 포함하는 단순화된 2차원 입력 행렬로 표시되고, 커널은 입력 행렬의 색상 강도 값들을 변 환하기 위한 복수의 미리 결정된 가중치 값들을 포함하는 단순화된 2차원 행렬로 표시된다. 커널은 고정된 경로 및 폭으로 입력 행렬에 적용될 수 있다. 도 9b의 2차원 도면에 따르면, 커널은 제 1 위 치에만 도시되어 있다. 도 9b의 도시된 실시예에 따른 예에서, 3차원 행렬에 대한 컨볼루션 연산은, 커널의 각 위치에 대한 컨볼루션을 포함하여, 적색, 녹색, 및 청색의 각 입력 행렬에 대해 한 번씩, 세 번에 걸쳐, 설명된 컨볼루션 연산을 반복하는 것으로부터 구상될 수 있다. 다른 실시예들에서 논의된 바와 같이, 결과의 항목은 누적적으 로 피처 맵들을 형성할 수 있고, 피처 맵들은 정류된 비선형 유닛 층, 추가 컨볼루션 층들, 및 풀링 층들과 같 은 추가 층들을 통해 배치될 수 있다. 도 11은 이식 산물의 물질 성분들을 자동으로 식별하고 그로부터 원치 않는 물질들을 제거하기 위한 시스 템의 다른 실시예의 개략도이다. 시스템은 제1 자외선 광원 및 제2 자외선 광원 - 각 자외선 광원(1121, 1123)은 이식 산물을 조명하도록 구성됨 -, 및 이식 산물의 이미지를 캡처하도 록 구성된 이미지 캡처 디바이스를 포함한다. 이미지 캡처 디바이스는, 이식 산물이 이식 산물 이 놓여 있는 컨베이어에 의해 이미지 캡처 디바이스의 이미징 방향에 대해 직접 횡단 방향 으로 이송될 때, 이식 산물의 정지 이미지 또는 비디오 이미지, 또는 둘 다를 획득하도록 구성될 수 있다. 컨베이어 벨트일 수 있는 컨베이어는 컨베이어 구동 시스템을 포함할 수 있는 컨베이어 제어 디바이스 에 의해 제어된다. 컨베이어 제어 디바이스는 컨베이어의 속도 및 방향을 변경할 수 있다. 또한, 컨베이어 제어 디바이스는 컴퓨팅 디바이스에 의해 제어될 수 있다. 캡처된 이미지는 이식 산물 의 유도 형광을 포함한다. 이미지 캡처 디바이스는 이미지 캡처 디바이스로 들어오는 미리 결정된 파장 아래의 입사광을 필터링하도록 구성된 광학 필터를 포함할 수 있거나, 또는 시스템이 포함할 수 있다. 시스템은 컴퓨터 또는 컴퓨팅 디바이스를 포함한다. 컴퓨팅 디바이스는 이미지 캡처 디바이스로부터 이미지 데이터, 예를 들어 정지 이미지 데이터 또는 비디 오 이미지 데이터의 형태로 이미지 데이터를 수신한다. 컴퓨팅 디바이스는 인공 신경망을 사용하여 이미 지 데이터를 처리하도록 구성될 수 있으며, 인공 신경망은 본 명세서의 다른 실시예들에서 설명된 바와 같이 이 미지 데이터로부터 이식 산물의 물질들을 로컬화 및 분류하도록 구성될 수 있다. 이미지 데이터로부터 이식 산 물의 물질들의 로컬화 및 분류에 기초하여, 컴퓨팅 디바이스는 이식 산물로부터 원치 않는 물질들을 제거하기 위해 스크래핑 또는 절단 디바이스를 제어할 수 있다. 스크래핑 또는 절단 디바이스 의 실시예들은 블레이드(blade), 왕복 평면, 커터 헤드, 압출 다이, 워터 제트, 에어 제트, 또는 이식 산 물으로부터 얇은 물질 층을 분리하기 위한 다른 유사한 디바이스를 포함할 수 있다. 바람직하게는, 절단 디바이스는 이식 산물의 로컬화된 위치들에서만 물질을 제거할 수 있다. 도 11에 도시된 바와 같이, 절단 디바이스는 복수의 절단 요소들을 포함하는 회전하는 커터 헤드를 포함한다. 절단 디바이스는 컨베이어에 대하여 고정된 위치를 가질 수도 있고, 컨베이어를 향하거나 컨베이어로부터 멀어지는 이미징 방향을 따라, 이식 산물의 이송 방향에 수직인 방향을 따라, 또는 양쪽 방향들을 따라 컨베이어 위의 미리 결정된 영역에서 이동하도록 구성될 수도 있다. 대안적으로, 절단 디바이스는 미리 결정된 위치들에서 원치 않는 물질들을 제거하기 위해 이미징 방향, 이송 방향에 수직인 방향, 또는 양쪽 방향들을 따라 컨베이어에 걸쳐 분포된 복수의 절단 요소들을 포함하거나, 복수의 고정 위치들 사이에서만 움직일 수 있다. 다양한 배치들에서, 컴퓨팅 디바이스는 절 단 디바이스를 재배치하거나 특정 위치들에서만 절단 디바이스의 절단 요소들을 활성화하는 것과 같이, 이식 산물의 특정 로컬화된 영역들에서만 이식 산물로부터 원치 않는 물질을 제거하여 이식 산물의 원하 는 물질의 손상을 방지하도록 절단 디바이스를 제어할 수 있다. 일부 실시예들에서, 이식 산물들은 기계적 클램핑 암(mechanical clamping arms), 컨베이어의 또 는 컨베이어 내의 흡입 디바이스를 사용하거나 또는 유사한 디바이스를 사용하는 것과 같은 구속 디바이스들에 의해 컨베이어에 고정되어, 이식 산물에 대한 절단 디바이스의 작동을 용이하게 할 수 있다. 따라서, 컨베이어 및 임의의 구속 디바이스들의 제어를 통해 이식 산물의 위치 및 절단 디바이스 는 과도한 스크래핑, 절단 또는 압력으로 피부를 손상시키지 않고 이식 산물로부터 근막 및 살을 정밀하 게 제거하도록 컴퓨팅 디바이스에 의해 코디네이팅 및 조정될 수 있다. 본 명세서에 추가로 설명된 바와 같이, 이식 산물의 물질 성분들을 자동으로 식별하고 원치 않는 물질들 을 그로부터 제거하는 것은 반복적인 시스템 또는 방법을 포함할 수 있다. 따라서, 이식 산물은 시스템 으로 반복적으로 입력 및 출력될 수 있다. 이러한 목적을 위해, 이식 산물은 수동으로 이송되거나 컨베이어를 통해 이송되는 등, 절단 디바이스로부터 이미지 캡처 디바이스로 이송될 수 있다. 다른 실시예들에서, 시스템은 단일 처리 경로를 따라 복제될 수 있으며, 이식 산물이 복수의 이미지 캡 처 디바이스들 및 절단 디바이스들을 통과하여 처리를 완료하도록 할 수 있다. 다른 실시예들에서, 시스템에는 절단 디바이스 다음에 추가적인 이미지 캡처 디바이스가 제공될 수 있고, 따라서 후속동작을 결정하기 전에 절단 또는 스크래핑 동작의 효과가 평가될 수 있다. 도 12는 시스템을 사용하여 수행될 수 있는 바와 같이 이식 산물의 물질 성분들을 자동으로 식별하고 그 로부터 원치 않는 물질들을 제거하는 방법의 흐름도이다. 이 방법은 이식 산물을 이미지 캡처 디바이스로 이송하는 컨베이어에 이식 산물을 제공하고, 적어도 하나의 자외선 광원을 사용하여 이식 산물을 조명하 고, 이식 산물의 이미지 데이터를 캡처하고, 이미지 데이터를 컴퓨팅 디바이스로 전송하고, 인공 신경망을 사용하여 컴퓨팅 디바이스에 의해 이미지 데이터를 처리하는 단계들을 포함할 수 있으며, 인공 신경망은 본원의 다른 실시예들에서 설명되는 바와 같이 이미지 데이터로부터 이식 산물의 물질들을 로컬 화하고 분류하도록 구성될 수 있다. 방법은 이식 산물에 원치 않는 물질들이 존재하는지 여부를 결정하는 단계를 더 포함할 수 있다. 원치 않 는 물질들이 식별되지 않는 경우, 방법은 이식 산물을 이송하거나 사용자에게 이식 산물에 원치 않는 물질들이 없다는 표시를 제공하는 등, 이식 산물을 출력하는 것으로 진행될 수 있다. 이식 산물에서 원치 않는 물 질들이 식별되는 경우, 방법은 이식 산물을 절단 디바이스로 이송하고, 인공 신경망으로부터 이식 산물의 물질들의 로컬화 및 분류에 기초하여, 이식 산물이 절단 디바이스에 의해 또는 절단 디바이스로 이송됨에 따라 원치 않는 물질들로 분류된 이식 산물의 특정 영역들에서 절단 디바이스를 위치시키거나 또는 활성화하기 위해 컴퓨팅 디바이스로부터의 위치 정보를 사용하는 등, 이식 산물로부터 원치 않는 물질들을 제거하기 위해 스크래 핑 또는 절단 디바이스를 제어함으로써 진행될 수 있다. 절단 디바이스의 작동에 이어, 방법은 동일한 시 스템을 사용하거나 처리 라인에서 동일한 시스템의 일부 또는 전체 구성 요소들을 복제하여 반복할 수 있다 . 일부 실시예들에서, 이전 단계에서 모든 원치 않는 물질들이 성공적으로 제거된 경우, 이식 산물을 이 미지 캡처 디바이스로 이송하는 컨베이어에 이식 산물을 제공하고, 적어도 하나의 자외선 광원을 사용하 여 이식 산물을 조명하고, 이식 산물의 이미지 데이터를 캡처하고, 이미지 데이터를 컴퓨팅 디바이 스로 전송하고, 인공 신경망을 사용하여 컴퓨팅 디바이스에 의해 이미지 데이터를 처리하는 단계들 만이 반복될 수 있다. 본 개시의 실시예들은 아래에서 더 자세히 논의되는 바와 같이, 예를 들어 하나 이상의 프로세서들 및 시스템 메모리와 같은 컴퓨터 하드웨어를 포함하는 특수 목적 또는 범용 컴퓨터 시스템을 포함하거나 활용할 수 있다. 본 개시의 범위 내의 실시예들은 또한 컴퓨터 실행 가능한 명령들 및/또는 데이터 구조들을 전달하거나 저장하 기 위한 물리적 및 기타 컴퓨터 판독 가능한 매체들을 포함한다. 이러한 기계 판독 가능한 매체들은 범용 또는 특수 목적 컴퓨터 시스템에 의해 액세스될 수 있는 모든 이용 가능한 매체들이 미디어가 될 수 있다. 컴퓨터 실 행 가능한 명령들 및/또는 데이터 구조들을 저장하는 컴퓨터 판독 가능한 매체들은 컴퓨터 저장 매체들이다. 컴 퓨터 실행 가능한 명령들 및/또는 데이터 구조들을 전달하는 컴퓨터 판독 가능한 매체들은 전송 매체들이다. 따 라서, 예를 들어, 본 개시의 실시예들은 적어도 두 가지의 별개의 다른 종류의 컴퓨터 판독 가능한 매체들: 즉, 컴퓨터 저장 매체들 및 전송 매체들을 포함할 수 있다. 컴퓨터 저장 매체들은 컴퓨터 실행 가능한 명령들 및/또는 데이터 구조들을 저장하는 물리적 저장 매체들을 말 한다. 물리적 저장 매체들에는 RAM, ROM, EEPROM, 솔리드 스테이트 드라이브(\"SSD\"), 플래시 메모리, 상변화 메 모리(\"PCM\"), 광 디스크 저장소, 자기 디스크 저장소 또는 기타 자기 저장 디바이스와 같은 컴퓨터 하드웨어, 또는 본 개시의 개시된 기능들을 구현하기 위해 범용 또는 특수 목적 컴퓨터 시스템에 의해 액세스 및 실행될 수 있는 프로그램 코드를 컴퓨터 실행 가능한 명령들 또는 데이터 구조들의 형태로 저장하는 데 사용될 수 있는 기타 하드웨어 저장 디바이스(들)가 포함된다. 전송 매체들에는 컴퓨터 실행 가능한 명령들 또는 데이터 구조들의 형태로 프로그램 코드를 전달하는 데 사용될 수 있고 범용 또는 특수 목적의 컴퓨터 시스템에 의해 액세스될 수 있는 네트워크 및/또는 데이터 링크가 포함 될 수 있다. \"네트워크\"는 컴퓨터 시스템 및/또는 모듈 및/또는 기타 전자 디바이스들 간에 전자 데이터를 전송 할 수 있는 하나 이상의 데이터 링크들로 정의될 수 있다. 네트워크 또는 기타 통신 연결(유선, 무선 또는 유선 과 무선의 조합)을 통해 정보가 컴퓨터 시스템으로 전송되거나 제공되는 경우, 컴퓨터 시스템은 해당 연결을 전 송 매체들로 간주할 수 있다. 상기한 것들의 조합들도 또한 컴퓨터-판독가능 매체의 범위 내에 포함되어야 한다. 또한, 다양한 컴퓨터 시스템 구성 요소들에 도달하면 컴퓨터 실행 가능한 명령들 또는 데이터 구조들의 형태로 프로그램 코드가 전송 매체로부터 컴퓨터 저장 매체로(또는 그 반대로) 자동으로 전송될 수 있다. 예를 들어, 네트워크 또는 데이터 링크를 통해 수신된 컴퓨터 실행 가능한 명령들 또는 데이터 구조들은 네트워크 인터페이 스 모듈(예컨대, \"NIC\") 내의 RAM에 버퍼링될 수 있고, 그리고 컴퓨터 시스템 RAM 및/또는 컴퓨터 시스템에서휘발성이 적은 컴퓨터 저장 매체로 최종적으로 전송될 수 있다. 따라서, 컴퓨터 저장 매체는 또한 (또는 주로) 전송 매체를 활용하는 컴퓨터 시스템 구성 요소들에 포함될 수 있음을 이해해야 한다. 컴퓨터 실행 가능한 명령들은 예를 들어, 하나 이상의 프로세서들에 의해 실행될 때 범용 컴퓨터 시스템, 특수 목적 컴퓨터 시스템, 또는 특수 목적 처리 디바이스로 하여금 특정 기능 또는 기능들의 그룹을 수행하도록 하는 명령들 및 데이터를 포함할 수 있다. 컴퓨터 실행 가능한 명령들은 예를 들어 바이너리, 어셈블리 언어와 같은 중간 형식의 명령들 또는 소스 코드일 수 있다. 본 출원의 개시는, 제한되는 것은 아니지만, 개인용 컴퓨터, 데스크톱 컴퓨터, 랩톱 컴퓨터, 메시지 프로세서, 핸드 헬드 디바이스, 다중 프로세서 시스템, 마이크로프로세서 기반 또는 프로그래밍 가능한 소비자 전자 장치, 네트워크 PC, 미니컴퓨터, 메인프레임 컴퓨터, 모바일폰, PDA, 태블릿, 페이저, 라우터, 스위치 등을 포함하는 다양한 유형들의 컴퓨터 시스템 구성들을 갖는 네트워크 컴퓨팅 환경에서 실행될 수 있다. 본 개시는 또한 네트 워크를 통해 (유선 데이터 링크, 무선 데이터 링크, 또는 유선 및 무선 데이터 링크의 조합에 의해) 링크된 로 컬 및 원격 컴퓨터 시스템이 모두 작업들을 수행하는 분산 시스템 환경에서도 실행될 수 있다. 따라서, 분산 시 스템 환경에서, 컴퓨터 시스템은 복수의 구성 컴퓨터 시스템들을 포함할 수 있다. 분산된 시스템 환경에서 프로 그램 모듈들은 로컬 및 원격 메모리 저장 디바이스들 모두에 위치될 수 있다. 본 출원의 개시는 또한 클라우드 컴퓨팅 환경에서도 실행될 수 있다. 클라우드 컴퓨팅 환경은 분산이 요구되지 는 않지만 분산이 가능하다. 분산되는 경우, 클라우드 컴퓨팅 환경들은 한 조직 내에 국제적으로 분산될 수 있 고 및/또는 여러 조직들에 걸쳐 구성요소들을 보유할 수 있다. 이러한 설명과 다음의 클레임에서 \"클라우드 컴 퓨팅\"은 구성 가능한 컴퓨팅 리소스들(예컨대, 네트워크, 서버, 저장소, 애플리케이션, 및 서비스)의 공유 풀에 대한 온-디맨드 네트워크 액세스를 가능하게 하는 모델로 정의된다. \"클라우드 컴퓨팅\"의 정의는 적절히 배포되 었을 때 이러한 모델로부터 얻을 수 있는 다른 수많은 장점들에 국한되지 않는다. 클라우드 컴퓨팅 모델은 온-디맨드 셀프 서비스, 광범위한 네트워크 액세스, 리소스 풀링, 빠른 탄력성, 측정된 서비스 등과 같은 다양한 특성들로 구성될 수 있다. 클라우드 컴퓨팅 모델은 또한 서비스형 소프트웨어 (\"SaaS\"), 서비스형 플랫폼(\"PaaS\"), 서비스형 인프라(\"IaaS\")와 같은 다양한 서비스 모델들의 형태로도 제공될 수 있다. 클라우드 컴퓨팅 모델은 또한 프라이빗 클라우드, 커뮤니티 클라우드, 퍼블릭 클라우드, 하이브리드 클라우드 등과 같은 다양한 배포 모델들을 사용하여 배포될 수 있다. 클라우드 컴퓨팅 환경과 같은 일부 실시예들은 각각 하나 이상의 가상 머신들을 실행할 수 있는 하나 이상의 호 스트들을 포함하는 시스템을 포함할 수 있다. 작동 중에, 가상 머신은 운영 컴퓨팅 시스템을 에뮬레이션하여 운 영 시스템 및 하나 이상의 다른 애플리케이션들도 지원하게 된다. 일부 실시예들에서, 각 호스트는 가상 머신의 뷰로부터 추출된 물리적 리소스들을 사용하여 가상 머신들에 대한 가상 리소스들을 에뮬레이션하는 하이퍼바이 저를 포함한다. 하이퍼바이저는 또한 가상 머신들 간에 적절한 격리를 제공한다. 따라서, 임의의 주어진 가상 머신의 관점에서 볼 때, 하이퍼바이저는 가상 머신이 물리적 리소스와 인터페이스하고 있다는 환상을 제공하지 만, 실제로는 가상 머신은 단지 물리적 리소스의 외관(예컨대, 가상 리소스)과만 인터페이스하고 있는 것이다. 물리적 리소스의 예로는 처리 용량, 메모리, 디스크 공간, 네트워크 대역폭, 미디어 드라이브 등이 있다. 개시된 실시예들에 따라 이식 산물들의 물질 성분들을 식별하는 시스템 및 방법을 제공함으로써, 기존의 2D 이 미지 인식 및 수동 식별 접근 방식이 비용이 많이 들고 시간이 많이 소요되며 이식 산물 내에서 근막, 살 및 피 부와 같은 시각적으로 유사한 물질들을 구별하는 데 어려움이 있는 여러 문제들이 해결된다. 개시된 실시예들은 기술자 또는 자동화된 처리 시스템에 실행 가능하고 정량화 가능한 통찰력을 제공하기 위해 이식 산물의 물질 성분들 사이를 구별하는 데 있어 향상된 정확성, 속도, 및 일관성을 식별하고 제공하는 시스템 및 방법을 유리 하게 제공한다. 본 개시의 다양한 특징들은 참조로 여기에 명시적으로 포함된 첨부된 어펜딕스에 설명된 바와 같이, 본 개시에 따른 이식 산물들의 물질 성분들을 식별하는 방법의 특정 예를 참조함으로써 더 잘 이해될 수 있다. 제공된 예 는 본 개시에 따른 원칙들의 단일 적용의 예시적인 성격이며, 제한하기 위한 것이 아니다. 특히, 어펜딕스는 4x4x3 프레임의 형태로 입력 이미지를 처리하기 위한 신경망의 규모를 대폭 축소하여 예시하며, 단순화를 위해 많은 값들이 가정되어 있다. 본 개시의 임의의 실시예 하에서 반드시 그러한 모든 목적들 또는 장점들이 달성될 필요는 없다. 당업자는 본 개시가 가르치거나 제안된 다른 목적들 또는 장점들을 달성하지 않고도, 가르친 대로 하나의 장점 또는 장점들 의 그룹을 달성하거나 최적화하기 위해 구체화되거나 수행될 수 있음을 인식할 것이다. 당업자는 설명된 상이한 실시예들에서 다양한 구성 요소들의 상호 교환성을 인식할 것이다. 설명된 변형들 외에 도, 본 개시의 원칙들에 따라 이식 산물의 물질 성분들을 식별하는 시스템 또는 방법을 구성하거나 사용하기 위 해 당업자에 의해 각 특징에 대한 다른 등가물들이 혼합 및 조합될 수 있다. 따라서, 설명된 실시예들은 근막, 살, 비늘, 피부 또는 이식 산물의 임의의 다른 적절한 물질에 대한 물질 식별 및 로컬화에 적응될 수 있다. 실시예들 및 피처들의 결합 가능성 본 개시는 다양한 예들, 실시예들, 및 특징들을 제공하며, 명시적으로 언급되지 않거나 상호 배타적인 경우를 제외하고, 본 명세서에 설명된 다른 예들, 실시예들, 또는 특징들과 결합 가능한 것으로 이해되어야 한다. 상기 외에도, 추가 실시예들 및 예들은 다음을 포함한다: 1. 이식 산물들의 물질 성분들을 식별하기 위한 시스템으로서, 이 시스템은 이식 산물의 이미지 데이터를 획득 하도록 구성된 이미지 캡처 디바이스; 및 인공 신경망을 사용하여 이미지 데이터를 처리하도록 구성된 프로세서 를 포함하며, 인공 신경망은 이미지 데이터로부터 이식 산물의 물질들을 로컬화하고 분류하도록 구성된다. 2. 상기 항목 1 또는 하기의 항목 3 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 이미지 캡처 디 바이스는 자외선 광원, 광학 필터 및 이미지 센서를 포함한다. 3. 상기 항목 1 및 항목 2 또는 하기의 항목 4 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 자외 선 광원은 파장이 365nm 내지 395nm인 광을 방출하도록 구성된다. 4. 상기 항목 1 내지 항목 3 또는 하기의 항목 5 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 광 학 필터는 435nm의 컷온 파장으로 구성된 장파장 통과 필터를 포함한다. 5. 상기 항목 1 내지 항목 4 또는 하기의 항목 6 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 광 학 필터는 435nm보다 큰 파장들에 대해 85%의 투과율을 갖는다. 6. 상기 항목 1 내지 항목 5 또는 하기의 항목 7 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 프 로세서는 이미지 데이터를 복수의 이미지 타일들로 분할하도록 구성된다. 7. 상기 항목 1 내지 항목 6 또는 하기의 항목 8 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 복 수의 이미지 타일들 각각은 동일한 크기를 갖는다. 8. 상기 항목 1 내지 항목 7 또는 하기의 항목 9 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 복 수의 이미지 타일들은 35개의 이미지 타일들을 포함한다. 9. 상기 항목 1 내지 항목 8 또는 하기의 항목 10 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 이식 산물은 근막 및 살 중 적어도 하나를 포함하는 원치 않는 물질들을 갖는 물고기 피부를 포함한다. 10. 상기 항목 1 내지 항목 9 또는 하기의 항목 11 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 인공 신경망은 컨볼루션 신경망을 포함한다. 11. 상기 항목 1 내지 항목 10 또는 하기의 항목 12 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 컨볼루션 신경망은 스텝식 수축 경로를 포함하고, 스텝식 수축 경로의 각 스텝은: 제1 수축 컨볼루션 층; 제2 수축 컨볼루션 층; 제1 수축 컨볼루션 층 다음의 제1 수축 정류 층; 제2 수축 컨볼루션 층 다음의 제2 수축 정 류 층; 제2 수축 정류 층 다음의 출력을 저장하는 저장 연산부; 및 저장 연산부 다음의 풀링 층을 포함한다. 12. 상기 항목 1 내지 항목 11 또는 하기의 항목 13 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 컨볼루션 신경망은 스텝식 확장 경로를 포함하고, 스텝식 확장 경로의 각 스텝은: 제1 확장 컨볼루션 층; 제2 확장 컨볼루션 층; 제1 확장 컨볼루션 층 다음의 제1 확장 정류 층; 제2 확장 컨볼루션 층 다음의 제2 확장 정 류 층; 제2 확장 정류 층 다음의 업샘플링 층; 및 업샘플링 층의 출력을 스텝식 수축 경로의 저장된 출력과 스 택하는 연결 연산부를 포함한다. 13. 상기 항목 1 내지 항목 12 또는 하기의 항목 14 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 스텝식 수축 경로와 스텝식 확장 경로는 동일한 수의 스텝들을 포함한다. 14. 상기 항목 1 내지 항목 13 또는 하기의 항목 15 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 스텝식 수축 경로와 스텝식 확장 경로는 각각 6개의 스텝들을 포함한다. 15. 상기 항목 1 내지 항목 14 또는 하기의 항목 16 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 출력 스텝은: 제1 출력 컨볼루션 층; 제2 출력 컨볼루션 층; 제1 출력 컨볼루션 층 다음의 제1 출력 정류 층; 제2 출력 컨볼루션 층 다음의 제2 출력 정류 층; 및 제2 출력 정류 층 다음의 시그모이드 층을 포함한다. 16. 상기 항목 1 내지 항목 15 또는 하기의 항목 17 내지 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 컨볼루션 신경망은 이식 산물의 각 물질 피처의 영역을 정의하는 이미지를 출력하도록 구성된다. 17. 상기 항목 1 내지 항목 16 또는 하기의 항목 18 및 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 광학 필터는 400nm 내지 600nm의 컷온 파장으로 구성된다. 18. 상기 항목 1 내지 항목 17 또는 하기의 항목 19의 어느 하나 또는 조합에 따른 시스템으로서, 복수의 이미 지 타일들 각각은 512x512 픽셀의 동일한 치수를 갖는다. 19. 상기 항목 1 내지 항목 18의 어느 하나 또는 조합에 따른 시스템으로서, 이미지 데이터는 복수의 이미지 타 일들로 분할되기 전에 크기가 조정된다. 20. 이식 산물들의 물질 성분들을 식별하는 방법으로서, 상기 방법은: 이미지 캡처 디바이스로 이식 산물의 이 미지 데이터를 캡처하는 단계; 및 이미지 데이터로부터 이식 산물의 물질들을 로컬화하고 분류하기 위해 인공 신경망을 사용하여 이미지 데이터를 처리하도록 프로세서를 사용하는 단계를 포함한다. 21. 상기 항목 20 또는 하기의 항목 22 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 이식 산물의 이미지 데이터를 캡처하는 단계는: 자외선 광원으로 이식 산물을 조사하는 단계; 이미지 캡처 디바이스의 광학 필터로 이식 산물에 의해 방출 및 반사된 광을 필터링하는 단계; 및 이미지 캡처 디바이스의 이미지 센서를 사 용하여 필터링된 광을 캡처하는 단계를 더 포함한다. 22. 상기 항목 20 및 항목 21 또는 하기의 항목 23 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 자 외선 광원은 파장이 365nm 내지 395nm인 광을 방출하도록 구성된다. 23. 상기 항목 20 내지 항목 22 또는 하기의 항목 24 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 광학 필터는 435nm의 컷온 파장으로 구성된 장파장 통과 필터를 포함한다. 24. 상기 항목 20 내지 항목 23 또는 하기의 항목 25 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 광학 필터는 435nm보다 큰 파장들에 대해 85%의 투과율을 갖는다. 25. 상기 항목 20 내지 항목 24 또는 하기의 항목 26 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 프로세서를 사용하여 이미지 데이터를 복수의 이미지 타일들로 분할하는 단계를 더 포함한다. 26. 상기 항목 20 내지 항목 25 또는 하기의 항목 27 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 복수의 이미지 타일들 각각은 동일한 크기를 갖는다. 27. 상기 항목 20 내지 항목 26 또는 하기의 항목 28 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 복수의 이미지 타일들은 35개의 이미지 타일들을 포함한다. 28. 상기 항목 20 내지 항목 27 또는 하기의 항목 29 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 이식 산물은 근막 및 살 중 적어도 하나를 포함하는 원치 않는 물질들을 갖는 물고기 피부를 포함한다. 29. 상기 항목 20 내지 항목 28 또는 하기의 항목 30 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 인공 신경망은 컨볼루션 신경망을 포함한다. 30. 상기 항목 20 내지 항목 29 또는 하기의 항목 31 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 복수의 이미지 타일들 각각을 인공 신경망의 스텝식 수축 경로에 입력하는 단계를 더 포함하고, 수축 경로의 각 스텝은: 제1 수축 컨볼루션 층; 제2 수축 컨볼루션 층; 제1 수축 컨볼루션 층 다음의 제1 수축 정류 층; 제2 수 축 컨볼루션 층 다음의 제2 수축 정류 층; 제2 수축 정류 층 다음의 출력을 저장하는 저장 연산부; 및 저장 연 산부 다음의 풀링 층을 포함한다. 31. 상기 항목 20 내지 항목 30 또는 하기의 항목 32 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 복수의 이미지 타일들 각각을 인공 신경망의 대칭적인 스텝식 확장 경로에 입력하는 단계를 더 포함하고, 스텝 식 확장 경로의 각 스텝은: 제1 확장 컨볼루션 층; 제2 확장 컨볼루션 층; 제1 확장 컨볼루션 층 다음의 제1 확 장 정류 층; 제2 확장 컨볼루션 층 다음의 제2 확장 정류 층; 제2 확장 정류 층 다음의 업샘플링 층; 및 업샘플 링 층의 출력을 스텝식 수축 경로의 저장된 출력과 스택하는 연결 연산부를 포함한다. 32. 상기 항목 20 내지 항목 31 또는 하기의 항목 33 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 스텝식 수축 경로와 스텝식 확장 경로는 동일한 수의 스텝들을 포함한다. 33. 상기 항목 20 내지 항목 32 또는 하기의 항목 34 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 스텝식 수축 경로와 스텝식 확장 경로는 각각 6개의 스텝들을 포함한다. 34. 상기 항목 20 내지 항목 33 또는 하기의 항목 35 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 복수의 이미지 타일들 각각을 인공 신경망의 출력 스텝에 입력하는 단계를 더 포함하고, 출력 스텝은: 제1 출력 컨볼루션 층; 제2 출력 컨볼루션 층; 제1 출력 컨볼루션 층 다음의 제1 출력 정류 층; 제2 출력 컨볼루션 층 다 음의 제2 출력 정류 층; 및 제2 출력 정류 층 다음의 시그모이드 층을 포함한다. 35. 상기 항목 20 내지 항목 34 또는 하기의 항목 36 내지 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 인공 신경망의 출력 스텝에 따라 이식 산물의 각 물질 피처의 영역을 정의하는 이미지를 출력하는 단계를 더 포 함한다. 36. 상기 항목 20 내지 항목 35 또는 하기의 항목 37 및 항목 38의 어느 하나 또는 조합에 따른 방법으로서, 광 학 필터는 400nm 내지 600nm의 컷온 파장으로 구성된다. 37. 상기 항목 20 내지 항목 36 또는 하기의 항목 38의 어느 하나 또는 조합에 따른 시스템으로서, 복수의 이미 지 타일들 각각은 512x512 픽셀의 동일한 치수를 갖는다. 38. 상기 항목 20 내지 항목 37의 어느 하나 또는 조합에 따른 시스템으로서, 이미지 데이터는 복수의 이미지 타일들로 분할되기 전에 크기가 조정된다. 39.컴퓨터 실행 가능한 명령들을 저장한 비일시적 하드웨어 저장 디바이스로서, 컴퓨터 실행 가능한 명령들은 컴퓨터의 하나 이상의 프로세서들에 의해 실행될 때, 적어도: 이미지 캡처 디바이스로 이식 산물의 이미지 데이 터를 캡처하는 것과; 인공 신경망을 사용하여 이미지 데이터를 처리하도록 프로세서를 사용하여 이미지 데이터 에서 이식 산물의 물질들을 로컬화하고 분류하는 것을 실행하도록 컴퓨터를 구성한다. 이식 산물들의 물질 성분들을 식별하는 시스템 또는 방법이 특정 바람직한 실시예들 및 예들에 개시되었지만, 당업자에게는 본 개시가 개시된 실시예들을 넘어 이식 산물들의 물질 성분들을 식별하는 시스템 또는 방법의 다 른 대체 실시예들 및/또는 용도들 및 명백한 수정들과 균등물에까지 확장된다는 것이 이해될 것이다. 개시된 이 식 산물들의 물질 성분들을 식별하는 본 시스템 또는 방법의 범위는 위에서 설명한 개시된 실시예들에 의해 제 한되어서는 안 되며, 뒤따르는 청구항의 공정한 해석에 의해서만 결정되어야 한다.도면 도면1a 도면1b 도면1c 도면2a 도면2b 도면3 도면4 도면5 도면6 도면7a 도면7b 도면8 도면9a 도면9b 도면10 도면11 도면12"}
{"patent_id": "10-2024-7035376", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 이러한 및 다른 특징들, 양상들, 및 장점들은 다음의 설명, 첨부된 청구범위, 및 첨부된 도면을 참조 하면 더욱 잘 이해될 것이다. 도 1a는 본 개시의 실시예에 따라 이식 산물의 물질 성분들을 식별하는 시스템의 도면이다. 도 1b는 본 개시의 또 다른 실시예에 따라 이식 산물의 물질 성분들을 식별하는 시스템의 도면이다. 도 1c는 본 개시의 또 다른 실시예에 따라 이식 산물의 물질 성분들을 식별하는 시스템의 도면이다. 도 2a는 본 개시의 실시예에 따라 이미지 캡처 디바이스에 의해 캡처된 이식 산물의 이미지 타일이다.도 2b는 본 개시의 또 다른 실시예에 따라 이미지 캡처 디바이스에 의해 캡처된 이식 산물의 또 다른 이미지 타 일이다. 도 3은 본 개시의 실시예에 따라 이식 산물의 물질 성분들을 식별하는 방법의 흐름도이다. 도 4는 도 3의 실시예에 따른 인공 신경망의 수축 경로를 나타낸 도면이다. 도 5는 도 3의 실시예에 따른 인공 신경망의 최종 출력 단계를 나타낸 도면이다. 도 6은 도 3의 실시예에 따른 인공 신경망의 확장 경로를 나타낸 도면이다. 도 7a는 도 3의 실시예에 따른 복수의 이미지 타일들, 오버레이 이미지 및 분류된 이미지 중 하나를 포함하는 도면이다. 도 7b는 도 3의 실시예에 따른 복수의 이미지 타일들, 오버레이 이미지 및 분류된 이미지 중 또 다른 하나를 포 함하는 도면이다. 도 8은 컴퓨팅 디바이스를 포함하는 본 개시의 실시예에 따라 이식 산물의 물질 성분들을 식별하는 시스템의 도 면이다. 도 9a는 본 개시의 실시예에 따른 컨볼루션 연산의 도면이다. 도 9b는 본 개시의 실시예에 따른 또 다른 컨볼루션 연산의 도면이다. 도 10은 본 개시의 실시예에 따른 인공 신경망의 대칭 경로들을 도시한 도면이다. 도 11은 본 개시의 다른 실시예에 따라 이식 산물의 물질 성분들을 식별하고 제거하는 시스템의 도면이다. 도 12는 본 개시의 실시예에 따라 이식 산물의 물질 성분들을 식별하고 제거하는 방법의 흐름도이다."}
