{"patent_id": "10-2015-0113885", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0019710", "출원번호": "10-2015-0113885", "발명의 명칭": "RF 신호 송신을 위한 전자 장치의 동작 방법 및 그 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이영민"}}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하우징, 상기 하우징 내에 포함되거나, 상기 하우징의 일부에 의하여 형성된 안테나; 상기 안테나와 전기적으로연결된 전력 증폭기(power amplifier); 상기 전력 증폭기와 전기적으로 연결된 라디오 주파수(radio frequency,RF) 송신 회로; 상기 RF 송신회로 및 PA와 전기적으로 연결된 프로세서; 및 상기 프로세서와 전기적으로 연결된메모리를 포함하는 전자 장치를 제조하는 방법에 있어서,상기 PA에 제1 입력 파워를 인가하고 상기 제1 입력 파워에 기인한 상기 PA의 제1 출력 파워를 측정하여 제1 데이터 포인트를 획득하는 동작;상기 PA에 제2 입력 파워를 인가하고 상기 제2 입력 파워에 기인한 상기 PA의 제2 출력 파워를 측정하여 제2 데이터 포인트를 획득하는 동작; 상기 제1 및 제2 데이터 포인트들을 이용하여, 복수의 데이터 포인트들을 선형적으로(linearly) 내삽하여(byinterpolation) 생성하는 동작; 및상기 복수의 데이터 포인트들을 상기 메모리에 저장하는 동작을 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 데이터 포인트, 상기 제2 데이터 포인트 및 상기 복수의 데이터 포인트들은, 상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 별로 저장되는, 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 데이터 포인트, 상기 제2 데이터 포인트 및 상기 복수의 데이터 포인트들은, 상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 마다 설정된 복수의 PA 동작 전압 별로 저장되는, 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "전자 장치에 있어서,하우징;상기 하우징 내에 포함되거나, 상기 하우징의 일부에 의하여 형성된 안테나;상기 안테나와 전기적으로 연결된 전력 증폭기(power amplifier, PA);상기 PA와 전기적으로 연결된 라디오 주파수(radio frequency, RF) 송신 회로;상기 RF 송신 회로 및 상기 PA와 전기적으로 연결된 프로세서; 및상기 프로세서와 전기적으로 연결된 메모리를 포함하며,상기 메모리는, 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 저장하고, 상기 정보는 제1 입력 파워에 기초한 제1 데이터 포인트, 제2 입력 파워에 기초한 제2 데이터 포인트 및 상기 제1 및 제2 데이터 포인트 사이에 선형적(linearly)으로 내삽되어(by interpolation) 생성된 제1 복수의 데이터 포인트들(afirst plurality of data points)을 포함하며,상기 메모리는, 실행 시에, 상기 프로세서가,상기 안테나를 통한 신호의 송신 시에 필요한, 상기 PA의 출력 파워를 선택하고,상기 제1 데이터 포인트, 상기 제2 데이터 포인트, 또는 상기 제1 복수의 데이터 포인트들 중 적어도 하나를 이공개특허 10-2017-0019710-3-용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하고,상기 입력 파워에 기초하여 상기 RF 송신회로의 출력 파워를 제어하도록 하는 인스트럭션들을 저장하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 정보는, 제 3 입력 파워에 기초한 제 3 데이터 포인트, 제 4 입력 파워에 기초한 제 4 데이터 포인트, 및상기 제 3 및 제 4 데이터 포인트들 사이에 선형적으로 형성된 제 2 복수의 데이터 포인트들(a secondplurality of data points)을 포함하며,상기 제 2 복수의 데이터 포인트들의 출력 값의 적어도 일부는, 상기 제 1 복수의 데이터 포인트들의 출력 값보다 작은 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제 1 데이터 포인트, 상기 제 2 데이터 포인트, 또는 상기 제 1 복수의 데이터 포인트 들은, 상기 PA의 제1 파워 모드와 연관되고,상기 제 3 데이터 포인트, 상기 제4 데이터 포인트, 또는 상기 제 2 복수의 데이터 포인트들은, 상기 PA의 제 2파워 모드와 연관된 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 정보는, 제 5 입력 파워에 기초한 제 5 데이터 포인트, 제 6 입력 파워에 기초한 제 6 데이터 포인트, 및상기 제 5 및 제 6 데이터 포인트들 사이에 선형적으로 형성된 제 3 복수의 데이터 포인트들(a third pluralityof data points)을 포함하며,상기 제 3 복수의 데이터 포인트들의 출력 값의 적어도 일부는, 상기 제 2 복수의 데이터 포인트들의 출력 값보다 작은 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제 5 데이터 포인트, 상기 제 6 데이터 포인트, 또는 상기 제 3 복수의 데이터 포인트 들은, 상기 PA의 제3 파워 모드와 연관된 것을 특징으로 하는 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항에 있어서,상기 메모리는,상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 별로 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 저장하는, 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 메모리는, 상기 프로세서가상기 PA의 복수의 파워 모드들 중 상기 선택된 PA의 출력 파워에 대응하는 제1 파워 모드를 확인하도록 하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2017-0019710-4-제10항에 있어서,상기 메모리는, 상기 프로세서가상기 제1 파워 모드에 대응하여 상기 메모리에 저장된 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는상기 제1 복수의 데이터 포인트 들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하도록 하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 메모리는, 상기 프로세서가상기 제1 파워 모드에 대응하는 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 제1 복수의 데이터포인트들 중 상기 PA 출력 파워에 대응하는 데이터 포인트를 확인하고,상기 데이터 포인트가 확인되면, 상기 확인된 데이터 포인트에 대응하는 입력 파워로 상기 PA의 입력 파워를 결정하도록 하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 메모리는, 상기 프로세서가상기 데이터 포인트가 확인되지 않으면, 상기 제1 데이터 포인트와 상기 제2 데이터 포인트 사이의 변화율에 기초하여 상기 PA의 입력 파워를 결정하도록 하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제4항에 있어서,상기 메모리는,상기 PA의 특성에 기초하여 설정된 PA의 복수의 파워 모드들 마다 설정된 복수의 PA 동작 전압 별로 상기 PA의입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 저장하는, 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 메모리는, 상기 프로세서가상기 PA의 복수의 파워 모드들 중 상기 선택된 PA의 출력 파워에 대응하는 제1 파워 모드를 확인하고,상기 제1 파워 모드에 설정된 복수의 PA 동작 전압 중 상기 선택된 PA 출력 파워에 대응하는 제1 PA 동작 전압을 확인하도록 하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 PA 및 상기 프로세서와 전기적으로 연결된 전압 조정기를 더 포함하고,상기 메모리는, 상기 프로세서가상기 확인된 제1 PA 동작 전압이 상기 PA에 공급되도록 상기 전압 조정기를 제어하도록 하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,공개특허 10-2017-0019710-5-상기 메모리는, 상기 프로세서가상기 제1 PA 동작 전압에 대응하여 상기 메모리에 저장된 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 제1 복수의 데이터 포인트들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의입력 파워를 결정하도록 하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "RF 신호 전송을 위한 전자 장치의 동작 방법에 있어서,상기 전자 장치에 포함되는 안테나를 통한 신호의 송신 시에 필요한, 상기 전자 장치에 포함된 PA의 출력 파워를 선택하는 동작;상기 전자 장치에 포함되는 메모리에 저장된 제1 데이터 포인트, 제2 데이터 포인트 또는 복수의 데이터 포인트들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하는 동작; 및상기 입력 파워에 기초하여 상기 전자 장치에 포함되는 RF 송신 회로의 출력 파워를 제어하는 동작을 포함하고,상기 복수의 데이터 포인트들은 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트 사이에 선형적으로 내삽되어 생성되는, 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들은,상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 별로 저장되는, 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 PA의 복수의 파워 모드들 중 상기 선택된 PA의 출력 파워에 대응하는 제1 파워 모드를 확인하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 PA의 입력 파워를 결정하는 동작은,상기 제1 파워 모드에 대응하여 상기 메모리에 저장된 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는상기 복수의 데이터 포인트 들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하는, 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서,상기 PA의 입력 파워를 결정하는 방법은,상기 제1 파워 모드에 대응하는 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들 중 상기 PA 출력 파워에 대응하는 제3 데이터 포인트를 확인하는 동작; 및상기 제3 데이터 포인트가 확인되면, 상기 제3 데이터 포인트에 대응하는 입력 파워로 상기 PA의 입력 파워를결정하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "공개특허 10-2017-0019710-6-제22항에 있어서,상기 PA의 입력 파워를 결정하는 동작은,상기 제3 데이터 포인트가 확인되지 않으면, 상기 제1 데이터 포인트와 상기 제2 데이터 포인트 사이의 변화율에 기초하여 상기 PA의 입력 파워를 결정하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제18항에 있어서,상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들은,상기 PA의 특성에 기초하여 설정된 PA의 복수의 파워 모드들 마다 설정된 복수의 PA 동작 전압 별로 저장되는,방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서,상기 PA의 복수의 파워 모드들 중 상기 선택된 PA의 출력 파워에 대응하는 제1 파워 모드를 확인하는 동작; 및상기 제1 파워 모드에 설정된 복수의 PA 동작 전압들 중 상기 선택된 PA 출력 파워에 대응하는 제1 PA 동작 전압을 확인하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제25항에 있어서,상기 확인된 제1 동작 전압으로 상기 PA에 전압을 공급하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서,상기 PA의 입력 파워를 결정하는 동작은,상기 제1 PA 동작 전압에 대응하여 상기 메모리에 저장된 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력파워를 결정하는, 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "전자 장치에서 RF 신호 송신을 위한 파워를 공급하기 위한 방법에 있어서,PA(power amplifier)의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 중 RF 신호 송신을 위하여 선택된 출력 파워에 대응하는 제1 파워 모드를 확인하는 동작;상기 제1 파워 모드에 대응하여 저장된 적어도 두 개의 제1 데이터 포인트들에 관한 정보를 이용하여 상기 출력파워에 대응하는 입력 파워를 결정하는 동작; 및상기 결정된 입력 파워를 상기 PA로 공급하는 동작을 포함하는 파워 공급 방법."}
{"patent_id": "10-2015-0113885", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "전자 장치에 있어서,공개특허 10-2017-0019710-7-RF 신호의 파워를 증폭시켜 출력하는 PA(power amplifier);상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 별로 적어도 두 개의 포인트들에 대한 정보를저장하는 메모리; 및상기 PA의 복수의 파워 모드들 중 RF 신호 송신을 위하여 선택된 출력 파워에 대응하는 제1 파워 모드를 확인하고, 상기 제1 파워 모드에 대응하여 상기 메모리에 저장된 적어도 두 개의 제1 데이터 포인트들에 관한 정보를이용하여 상기 출력 파워에 대응하는 입력 파워를 결정하고, 상기 결정된 입력 파워가 상기 PA로 공급되도록 제어하는 프로세서를 포함하는 전자 장치."}
{"patent_id": "10-2015-0113885", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "RF 신호 전송을 위한 전자 장치의 동작 방법이 개시된다. 상기 방법은, 상기 전자 장치에 포함되는 안테나를 통 한 신호의 송신 시에 필요한, 상기 전자 장치에 포함된 PA의 출력 파워를 선택하는 동작, 상기 전자 장치에 포함 되는 메모리에 저장된 제1 데이터 포인트, 제2 데이터 포인트 또는 제1 복수의 데이터 포인트들 중 적어도 하나 를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하는 동작 및 상기 입력 파워에 기초 하여 상기 전자 장치에 포함되는 RF 송신 회로의 출력 파워를 제어하는 동작을 포함하고, 상기 복수의 데이터 포 인트들은 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트 사이에 선형적으로 내삽되어 생성될 수 있다. 다양 한 실시예들이 가능하다."}
{"patent_id": "10-2015-0113885", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 RF 신호 전송을 위한 전자 장치의 동작 방법 및 그 전자 장치에 관한 것이다."}
{"patent_id": "10-2015-0113885", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신을 통해 통신을 수행하는 통신 장치는 송신 신호의 전력을 높이기 위한 RF 전력 증폭기를 비롯하여 많 은 집적 회로(IC)들을 포함한다. 상기 통신 장치에 포함되는 RF 전력 증폭기(PA: power amplifier)는 RF(radio frequency) 신호를 증폭함으로써 안테나를 통하여 증폭된 RF 신호가 송신되도록 할 수 있다. 이와 같 이 전력 증폭기는 비교적 저전력을 가지는 RF 신호를 증폭하는 데에 이용될 수 있다. 이와 같은 전력 증폭기 및 RF 프론트-엔드(front-end)(예: 스위치, 디플렉서 등)는 아날로그 회로이므로 각 통 신 장치 별로 특성이 상이하다. 따라서, RF 신호 전송을 위한 특성을 맞추기 위하여 아날로그 회로 별로 상이 한 특성을 동일하게 보정 해야 한다. 예를 들어, RF 신호 전송을 위해 필요한 RF 파워는 송신기의 이득(gain) 과 전력 증폭기의 이득을 조정한 후 입력 파워에 대응하는 출력 파워를 측정하는 방식으로 RF 신호 전송을 위한 보정(calibration)을 진행한다."}
{"patent_id": "10-2015-0113885", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래에는 RF 신호 송신을 위한 전력 증폭기의 특성을 보정하기 위하여 전력 증폭기의 파워 모드 별로 파워 모드 에 대응하는 전체 출력 파워에 대해 보정을 수행하였다. 이는 APT(average power tracking) 기술을 접합했을 때고 동일하게 적용되어, APT 구현을 위해 파워 모드 별로 전압을 다르게 주거나 별도의 APT 테이블을 구성하여 보정을 수행하였다. 이와 같이, 전체 출력 파워에 대한 보정을 수행할 경우, 필요하지 않은 출력 파워 및 파워 모드에서까지 보정을 수행해야만 하였기 때문에 보정 수행 시간이 길어지고, 불필요한 이득 테이블(gain table) 및 입력 파워 값 등의 저장이 필요하였다. 본 발명의 다양한 실시예들은 전술한 문제점 또는 다른 문제점을 해결하기 위한 RF 신호 송신을 위한 전자 장치 의 동작 방법 및 그 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2015-0113885", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 전자 장치는, 하우징, 상기 하우징 내에 포함되거나, 상기 하우징의 일부에 의하여 형성된 안테나, 상기 안테나와 전기적으로 연결된 전력 증폭기(power amplifier, PA), 상기 PA와 전기적 으로 연결된 라디오 주파수(radio frequency, RF) 송신 회로, 상기 RF 송신 회로 및 상기 PA와 전기적으로 연결 된 프로세서 및 상기 프로세서와 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 저장하고, 상기 정보 는 제1 입력 파워에 기초한 제1 데이터 포 인트, 제2 입력 파워에 기초한 제2 데이터 포인트 및 상기 제1 및 제2 데이터 포인트 사이에 선형적(linearly) 내삽되어(by interpolation) 생성된 복수의 데이터 포인트들(a first plurality of data points)을 포함하며, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 안테나를 통한 신호의 송신 시에 필요한, 상기 PA의 출력 파 워를 선택하고, 상기 제1 데이터 포인트, 상기 제2 데이터 포인트, 또는 상기 복수의 데이터 포인트들 중 적어 도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하고, 상기 입력 파워에 기초하여 상기 RF 송신회로의 출력 파워를 제어하도록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, RF 신호 전송을 위한 전자 장치의 동작 방법은, 상기 전자 장치에 포함되는 안테나를 통한 신호의 송신 시에 필요한, 상기 전자 장치에 포함된 PA의 출력 파워를 선택하는 동작, 상기 전자 장치에 포함되는 메모리에 저장된 제1 데이터 포인트, 제2 데이터 포인트 또는 복수의 데이터 포인트들 중 적어 도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하는 동작 및 상기 입력 파워 에 기초하여 상기 전자 장치에 포함되는 RF 송신 회로의 출력 파워를 제어하는 동작을 포함하고, 상기 복수의 데이터 포인트들은 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트 사이에 선형적으로 내삽되어 생성될 수 있다. 본 발명의 다양한 실시예에 따르면, 전자 장치에서 RF 신호 송신을 위한 파워를 공급하기 위한 방법은, 상기 PA 의 특성에 기초하여 설정된 PA(power amplifier)의 복수의 파워 모드들 중 RF 신호 송신을 위하여 선택된 상기 PA의 출력 파워에 대응하는 제1 파워 모드를 확인하는 동작, 상기 제1 파워 모드에 대응하여 저장된 적어도 두 개의 제1 데이터 포인트들에 관한 정보를 이용하여 상기 출력 파워에 대응하는 입력 파워를 결정하는 동작 및 상기 결정된 입력 파워를 상기 PA로 공급하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 전자 장치는, RF 신호 송신을 위하여 파워를 증폭시켜 출력하는 PA(power amplifier), 상기 PA의 특성에 기초하여 설정된 PA의 복수의 파워 모드들 별로 적어도 두 개의 데이터 포인트들 에 대한 정보를 저장하는 메모리 및 상기 PA의 복수의 파워 모드들 중 RF 신호 송신을 위하여 선택된 출력 파워 에 대응하는 제1 파워 모드를 확인하고, 상기 제1 파워 모드에 대응하여 상기 메모리에 저장된 적어도 두 개의 제1 데이터 포인트들에 관한 정보를 이용하여 상기 출력 파워에 대응하는 입력 파워를 결정하고, 상기 결정된 입력 파워가 상기 PA로 공급되도록 제어하는 프로세서를 포함할 수 있다."}
{"patent_id": "10-2015-0113885", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예들에 의하여, 전력 증폭기를 포함하는 전자 장치는 각 파워 모드 별로 전체 출력 파워 에 대해 보정을 수행하지 않고, 적어도 두 개의 출력 파워에 대하여 보정을 수행할 수 있다. 전자장치는 적어도 두 개의 출력 파워에 대한 보정을 통해 전체 출력 파워에 대응하는 입력 파워를 산출하여 RF 신호 송신을 위해 산출된 입력 파워를 전력 증폭기에 공급할 수 있다. 이와 같이 적어도 두 개의 출력 파워에 대한 보정만을 수 행함으로써 보정 수행 시간을 줄일 수 있고, 불필요한 이득 테이블(gain table) 및 입력 파워 값 등을 저장하지 않을 수 있다. 아울러, RF 신호 송신을 위한 출력 파워가 변화하더라도, 보정 수행 결과를 이용하여 변화된 출 력 파워에 대응하는 입력 파워를 산출하여 RF 신호 송신을 수행할 수 있다."}
{"patent_id": "10-2015-0113885", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요 소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상 의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으 며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션 (workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어,모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다 양한 실시예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포함할 수 있 다. 어떤 실시예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전 자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1을 참조하여, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이스 를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(110-170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/또 는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신 에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨 어, 어플리케이션 프로그래밍 인터페이스(application programming interface(API)), 및/또는 어플 리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API(14 5)의 적어도 일부는, 운영 시스템(operating system(OS))으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따 라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치(10 1)의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위를 부여 할 수 있다. 예컨대, 미들웨어는 상기 적어도 하나에 부여된 우선 순위에 따라 상기 하나 이상의 작업 요 청들을 처리함으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링 또는 로드 밸런싱 등을 수행할 수 있다. API는, 예를 들면, 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위 한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페 이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light- emitting diode(LED)) 디스플레이, 유기 발광 다이오드(organic light-emitting diode(OLED)) 디스플레이, 또 는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이 미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전 자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또 는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용할 수 있다. 또한, 무선 통신은, 예를 들면, 무선 통신을 포함 할 수 있다. 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), 또는 GNSS(global navigation satellite system) 등 중 적어도 하나를 포함할 수 있다. GNSS 는 사용 지역 또는 대역폭 등에 따라, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system 중 적어도 하나를 포함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 혼용되어 사용(interchangeably used)될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크 (telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치 (102,104), 또는 서버에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어떤 기능이나 서비스 를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시 키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치(102, 104), 또는 서버)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(102, 104), 또는 서버)는 요청된 기능 또는 추 가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또 는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 상기 프로세서는 다른 구성요소들(예: 상기 메모리, 상기 입출력 인터페이스, 상기 통신 인터페 이스 등의 적어도 하나)로부터 획득된 정보 중 적어도 일부를 처리하고, 이를 다양한 방법으로 이용할 수 있다. 예를 들면, 상기 프로세서는 상기 전자 장치가 다른 전자 장치(예: 전자 장치(102, 104) 또는 서버)와 연동하도록 상기 전자 장치의 적어도 일부 기능을 제어할 수 있다. 상기 프로세서는 상기 통신 인터페이스에 통합될 수 있다. 일 실시예에 따르면, 프로세서의 적어도 하나의 구성은 서 버에 포함될 수 있으며, 상기 서버로부터 프로세서에서 구현되는 적어도 하나의 동작을 지원받 을 수 있다. 일 실시예에 따르면, 메모리는 상기 프로세서를 동작하도록 하는 인스트럭션들을 포함할 수 있다. 예를 들어, 상기 메모리는 상기 프로세서가 상기 전자 장치의 다른 구성요소들을 제어하고, 다 른 전자 장치(102, 104) 또는 서버와 연동하도록 하는 인스트럭션들을 포함할 수 있다. 상기 프로세서 는 상기 메모리에 저장된 상기 인스트럭션들에 기초하여 상기 전자 장치의 다른 구성 요소들을 제어하고, 다른 전자 장치(102, 104) 또는 서버와 연동할 수 있다. 이하에서는 상기 전자 장치의 각 구성요소들을 주체로 상기 전자 장치의 동작을 설명하기로 한다. 또한, 상기 각 구성요소들에 의한 동작 을 수행하도록 하는 인스트럭션들은 상기 메모리에 포함될 수 있다. 상술한 다른 구성요소들(예: 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이 , 통신 인터페이스 등)은 상기 전자 장치의 하우징 내에 포함될 수 있다. 또한, 도시되지는 않 았으나 RF 신호 송수신을 위한 안테나는 상기 하우징 내에 포함되거나 상기 하우징의 일부에 의하여 형성될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 전자 장치는 RF 신호 송신을 위한 RF 신호의 파워를 증폭시켜 출 력하는 전력 증폭기(power amplifier, 이하 'PA'라 함)를 포함할 수 있다. 이하에서 입력 파워는 상기 PA에 입 력되는 RF 신호의 입력 파워를 나타내고, 출력 파워는 상기 PA에서 출력되는 RF 신호의 출력 파워를 나타낼 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 전자 장치는 프로세서에서 생성된 신호를 RF 신호로 변환하 는 RF(radio frequency) 송신 회로를 포함할 수 있다. 예를 들어, 상기 RF 송신 회로는 CP(communication processor)에서 생성된 신호를 제공 받아 RF 신호로 상향 변조하여 상기 PA로 전송할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화 에 대한 정보를 저장할 수 있다. 예를 들어, 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보는 제1 입력 파워에 기초한 제1 데이터 포인트, 제2 입력 파워에 기초한 제2 데이터 포인트 및 상기 제1 및 제2 데이터 포인트 사이에 선형적 (linearly) 내삽되어(by interpolation) 생성된 복수의 데이터 포인트들을 포함할 수 있다. 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트는 상기 PA에 대한 보정 수행 시 획득될 수 있다. 상기 제1 입력 파워와 상 기 제2 입력 파워는 데이터 포인트들 사이의 변화율에 대한 정보를 산출하기 위하여 미리 설정된 크기 만큼 차 이가 나도록 상기 제1 입력 파워 및 상기 제2 입력 파워가 설정될 수 있다. 예를 들어, 상기 제1 데이터 포인트는 상기 제1 입력 파워를 상기 PA에 공급하고, 이에 따라 상기 PA에서 출력 되는 제1 출력 파워를 측정함으로써 획득될 수 있다. 이와 마찬가지로, 상기 제2 데이터 포인트는 상기 제2 입 력 파워를 상기 PA에 공급하고, 이에 따라 상기 PA에서 출력되는 제2 출력 파워를 측정함으로써 획득될 수 있다. 상기 복수의 데이터포인트들은 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트를 이용하여 생성될 수 있다. 상기 복수의 데이터 포인트들은 상기 제1 데이터 포인트와 상기 제2 데이터 포인트 사이의 변화율, 예를 들어 입력 파워의 변화량과 이에 대응하는 출력 파워의 변화량에 기초하여 생성될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보는 상기 제1 데이터 포인트, 상기 제2 데이터 포인트만을 포함할 수도 있다. 또한, 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보는 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트 외에 상기 제1 입력 파워와 상기 제2입력 파워와 상이한 입력 파워에 기초하여 획득되는 적어도 하나의 데이터 포인트를 더 포함할 수도 있다. 또한, 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보는 상기 제1 데이터 포인트, 제2 데이터 포 인트 및 상기 제1 데이터 포인트와 상기 제2 데이터 포인트 사이의 변화율에 대한 정보(예: 기울기 정보)를 포 함할 수 있다. 상기 프로세서는 상기 제1 데이터 포인트와 상기 제2 데이터 포인트 사이의 변화율에 대한 정보가 생성되 어 있는 경우, 생성된 변화율에 대한 정보를 이용하여 상기 입력 파워를 결정할 수 있다. 상기 프로세서 는 상기 변화율에 대한 정보에 따른 각 데이터 포인트들 간의 선형성을 이용하여 상기 입력 파워를 결정할 수 있다. 다만, 상기 프로세서는 상기 변화율에 대한 정보가 생성되어 있지 않은 경우, RF 신호 송신 시 상기 제1 데이터 포인트와 상기 제2 데이터 포인트를 이용하여 상기 변화율에 대한 정보를 생성하고, 생성된 변화율에 대 한 정보를 이용하여 입력 파워를 결정할 수도 있다. 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보는 상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 별로 저장될 수 있다. 또한, 상기 복수의 파워 모드들 중 가장 높은 파워를 제공하는 파워 모드에 대해서는 상기 PA의 특성에 따라 설정된 비선형 구간에 대응하는 적어도 하나의 데이터 포인트가 더 저 장될 수 있다. 비선형 구간에서 PA의 출력 파워에 대응하는 입력 파워를 결정하기 위해서는 선형 구간과 다른 방식이 적용되어야 하므로 상기 비선형 구간에 대응하는 적어도 하나의 데이터 포인트가 더 저장될 수 있다. 또한, 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보는 상기 PA의 복수의 파워 모드들 마다 설정 된 복수의 PA 동작 전압 별로 저장될 수도 있다. 상기 복수의 파워 모드들 마다 설정되는 복수의 PA 동작 전압 은 상기 PA에서 소모되는 전력을 최소화하기 위하여 상기 PA의 특성에 기초하여 설정될 수 있다. 상기 복수의 PA 동작 전압 중 기준 PA 동작 전압에 대응하여서는 입력 파워에 대한 출력 파워의 변화율에 대한 정보를 생성하기 위하여 적어도 두 개의 데이터 포인트가 저장될 수 있다. 상기 복수의 PA 동작 전압 중 상기 기준 PA 동작 전압을 제외한 나머지 PA 동작 전압에 대해서는 PA의 이득은 상이하나, PA의 특성에 따라 상기 기 준 PA 동작 전압에 대해 생성된 입력 파워에 대한 출력 파워의 변화율에 대한 정보를 이용할 수 있으므로 적어 도 하나의 데이터 포인트가 저장될 수 있다. 상기 파워 모드들 별로 상기 입력 파워와 출력 파워 사이의 변화율에 대한 정보는 동일하므로, 상기 적어도 두 개의 데이터 포인트를 이용하여 생성되는 입력 파워에 대한 출력 파워의 변화율에 대한 정보가 동일한 파워 모 드에 설정된 나머지 PA 동작 전압에 대응하여 저장된 데이터 포인트에 적용될 수 있다. 따라서, 나머지 PA 동 작 전압에 대해서는 적어도 하나의 데이터 포인트만 저장되어도 입력 파워를 결정할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 프로세서는 상기 안테나를 통한 RF 신호의 송신 시에 필요한 상 기 PA의 출력 파워를 선택할 수 있다. 상기 프로세서는 상기 전자 장치와 연결된 네트워크의 특성에 기초하여 상기 PA의 출력 파워를 선택할 수 있다. 예를 들어, 상기 프로세서는 상기 RF 신호 송신을 위하 여 필요한 파워, 채널 등과 같은 정보를 상기 전자 장치와 연결 가능한 기지국으로부터 수신하고, 상기 RF 신호 송신을 위하여 필요한 정보에 기초하여 상기 PA의 출력 파워를 선택할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 프로세서는 상기 메모리에 저장된 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 이용하여 상기 선택된 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정할 수 있다. 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보가 상기 PA의 복수의 파워 모드들 별로 저장되어 있는 경우, 상기 프로세서는 상기 메모리에 저장된 정보를 이용하기 위하여 상기 PA의 복수의 파워 모드들 중에서 상기 선택된 PA의 출력 파워에 대응하는 제1 파워 모드를 확인할 수 있다. 상기 PA는 RF 신호 송신 시 필요한 PA의 출력 파워에 따라 상기 복수의 파워 모드들 중 하나의 파워 모드로 동 작할 수 있다. 상기 PA의 특성에 따라 복수의 파워 모드들 별로 적어도 하나 이상의 출력 파워가 대응될 수 있 다. 상기 프로세서는 상기 RF 신호 송신 시 필요한 출력 파워를 선택하고, 상기 복수의 파워 모드들 중 상기 선택된 출력 파워에 대응하는 파워 모드를 확인할 수 있다. 상기 프로세서는 상기 PA가 상기 확인된 파워 모드로 동작할 수 있도록 제어할 수 있다. 또한, 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보가 상기 PA의 복수의 파워 모드들 마다 설정 된 복수의 PA 동작 전압 별로 저장되어 있는 경우, 상기 프로세서는 상기 메모리에 저장된 정보를 이용하기 위하여 상기 제1 파워 모드를 확인하고, 상기 제1 파워 모드에 설정된 복수의 PA 동작 전압 중 상기 선 택된 PA 출력 파워에 대응하는 제1 PA 동작 전압을 확인할 수 있다. 상기 프로세서는 상기 제1 PA 동작 전압이 확인되면, 상기 제1 PA 동작 전압이 상기 PA에 공급되도록 상기 전자 장치에 포함된 전압 조정기를 제어할 수 있다. 상기 전압 조정기는 상기 전자 장치에 포함되며, 상기 PA가 동작할 수 있도록 상기 PA에 PA 동작 전압을 제공할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 프로세서는 상기 제1 파워 모드에 대응하여 상기 메모리에 저장된 제1 데이터 포인트, 제2 데이터 포인트 또는 복수의 데이터 포인트 들 중 적어도 하나를 이용하여, 상기 PA 출력 파워에 대응하는 상기 PA의 입력 파워를 결정할 수 있다. 상기 프로세서는 상기 입력 파워의 변 화에 따른 출력 파워의 변화에 대한 정보가 제1 데이터 포인트, 제2 데이터 포인트 및 복수의 데이터 포인트들 을 모두 포함하고 있는 경우, 제1 데이터 포인트, 제2 데이터 포인트 또는 복수의 데이터 포인트 들 중 적어도 하나를 이용하여, 상기 PA 입력 파워를 결정할 수 있다. 예를 들어, 상기 프로세서는 상기 PA의 입력 파워를 결정하기 위하여 상기 제1 파워 모드에 대응하는 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들 중 상기 PA 출력 파워에 대응하 는 제3 데이터 포인트를 확인할 수 있다. 상기 프로세서는 상기 제3 데이터 포인트를 확인하는 동작을 통 해 상기 메모리에 기 저장된 정보를 직접 활용할 수 있는지를 판단할 수 있다. 상기 프로세서는 상기 제3 데이터 포인트가 확인되면, 상기 메모리에 기 저장된 정보를 이용하여 상 기 제3 데이터 포인트에 대응하는 입력 파워로 상기 PA의 입력 파워를 결정할 수 있다. 상기 프로세서는 상기 제3 데이터 포인트가 확인되지 않으면, 상기 제1 데이터 포인트와 상기 제2 데이터 포인트 사이의 변화율에 대한 정보에 기초하여 상기 PA의 입력 파워를 결정할 수 있다. 예를 들어, 상기 프로 세서는 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트 중 적어도 하나에 상기 변화율에 대한 정보를 적용함으로써 상기 선택된 PA의 출력파워에 대응하는 입력 파워를 산출해 낼 수 있다. 상기 프로세서는 산출된 입력 파워로 상기 PA의 입력 파워를 결정할 수 있다. 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트 사이의 변화율에 대한 정보는 상기 프로세서에 의하여 RF 신호 송신 시 생성될 수도 있고, 미리 생성되어 상기 메모리에 저장될 수도 있다. 본 발명의 다양한 실시예에 따르면, 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보가 제1 데이터 포인트 및 제2 데이터 포인트와 같은 보정이 수행된 적어도 두 개의 데이터 포인트들만을 포함하고 있는 경우, 상기 프로세서는 위에서 설명한 바와 같이, 상기 데이터 포인트들 사이의 변화율에 대한 정보를 이용하여 상기 입력 파워를 결정할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 프로세서는 상기 제1 파워 모드를 확인하는 동작에서, 상기 제1 파워 모드가 상기 PA의 복수의 파워 모드들 중 가장 높은 파워를 공급하는 모드인지를 확인할 수 있다. 가장 높은 파워를 공급하는 모드에서는 상기 PA의 특성에 따라 입력 파워와 출력 파워 사이의 관계가 비선형적으로 나타나는 비선형 구간이 존재할 수 있다. 따라서, 상기 선택된 PA의 출력 파워가 가장 높은 파워를 공급하는 모드에 대응하고, 상기 PA의 출력 파워가 상 기 가장 높은 파워를 공급 하는 모드의 비선형 구간에 대응되는 경우, 상기 프로세서는 상기 메모리 에 저장된 비선형 구간에 대응하는 적어도 하나의 데이터 포인트를 더 이용하여 상기 PA의 출력 파워에 대응하 는 입력 파워를 결정할 수 있다. 예를 들어, 상기 프로세서는 선형 구간에 대응하는 상기 적어도 두 개의 데이터 포인트들과 비선형 구간에 대응하는 상기 적어도 하나의 데이터 포인트 사이의 변화율에 대한 정보를 이용하여 상기 PA의 입력 파워를 결 정할 수 있다. 상기 프로세서는 상기 선형 구간에 대응하는 적어도 두 개의 데이터 포인트 들 중 상기 비 선형 구간에 가장 근접한 데이터 포인트를 선택할 수 있다. 상기 프로세서는 상기 선택된 데이터 포인트 와 상기 비선형 구간에 대응하는 적어도 하나의 데이터 포인트 사이의 변화율에 대한 정보를 이용하여 상기 PA 의 입력 파워를 결정할 수 있다. 상기 변화율에 대한 정보 역시 RF 신호 송신 시 생성될 수도 있고, 미리 생성 되어 상기 메모리에 저장될 수도 있다. 또한, 상기 프로세서는 선형 구간과 마찬가지로, 비선형 구간에 대하여도 상기 메모리에 기 저장된 데이터 포인트들에 대한 정보를 이용하여 상기 PA의 입력 파워를 결정할 수 있다. 예를 들어, 상기 PA의 출력 파워가 상기 메모리에 저장된 비선형 구간에 대응하는 하나의 데이터 포인트에 대응되는 경우, 상기 프로세서는 상기 적어도 하나의 데이터 포인트를 통해 별도의 연산 없이 상기 PA의 입력 파워를 결정할 수 있 다. 본 발명의 다양한 실시예에 따르면, 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보가 상기 복수 의 PA 동작 전압 별로 저장되어 있는 경우, 상기 프로세서는 상기 제1 PA 동작 전압에 대응하여 상기 메모 리에 저장된 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 이용하여 상기 PA의 입 력 파워를 결정할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 프로세서는 상기 선택된 PA의 출력 파워에 대응하는 제1 PA 동작 전압과 기준 PA 동작 전압을 비교할 수 있다. 상기 기준 PA 동작 전압에 대응하여 적어도 두 개의 데이터 포인 트들이 저장될 수 있다. 상기 기준 PA 동작 전압에 대응하는 상기 적어도 두 개의 데이터 포인트들을 이용하여 입력 파워와 출력 파워 사이의 변화율에 대한 정보가 생성될 수 있다. 상기 변화율에 대한 정보는 상기 기준 PA 동작 전압에 대응하여 상기 메모리에 저장될 수 있다. 또한, 상기 변화율에 대한 정보는 상기 적어도 두 개의 데이터 포인트들을 이용하여 RF 신호 송신 시 생성될 수도 있다. 상기 프로세서는 상기 제1 PA 동작 전압과 상기 기준 PA 동작 전압이 동일한 경우, 상기 기준 PA 동작 전 압에 대응하는 상기 적어도 두 개의 데이터 포인트들을 이용하여 상기 입력 파워를 결정할 수 있다. 예를 들어, 상기 프로세서는 상기 PA의 입력 파워를 결정하기 위하여 상기 제1 PA 동작 전압에 대응하는 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들 중 상기 PA 출력 파워에 대응하 는 제4 데이터 포인트를 확인할 수 있다. 상기 프로세서는 상기 제4 데이터 포인트를 확인하는 동작을 통 해 상기 메모리에 기 저장된 정보를 직접 활용할 수 있는지를 판단할 수 있다. 상기 프로세서는 상기 제4 데이터 포인트가 확인되면, 상기 메모리에 기 저장된 정보를 이용하여 상 기 제4 데이터 포인트에 대응하는 입력 파워로 상기 PA의 입력 파워를 결정할 수 있다. 이에 반하여, 상기 프로세서는 상기 제4 데이터 포인트가 확인되지 않으면, 상기 제1 데이터 포인트와 상 기 제2 데이터 포인트 사이의 변화율에 대한 정보에 기초하여 상기 PA의 입력 파워를 결정할 수 있다. 예를 들 어, 상기 프로세서는 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트 중 적어도 하나에 상기 변화율에 대한 정보를 적용함으로써 상기 선택된 PA의 출력파워에 대응하는 입력 파워를 산출해 낼 수 있다. 상기 프로 세서는 산출된 입력 파워로 상기 PA의 입력 파워를 결정할 수 있다. 상기 제1 PA 동작 전압과 상기 기준 PA 동작 전압이 상이한 경우, 상기 프로세서는 하나의 파워 모드에서 는 입력 파워와 출력 파워 사이의 변화율에 대한 정보가 동일하게 설정된 PA의 특성을 이용하여 상기 PA의 입력 파워를 결정할 수 있다. 예를 들어, 상기 프로세서는 상기 기준 PA 동작 전압과 상이한 제1 PA 동작 전압에 대응하여 상기 메모리 에 저장된 적어도 하나의 제3 데이터 포인트에 관한 정보를 더 이용하여 상기 PA의 입력 파워를 결정할 수 있다. 상기 프로세서는 상기 적어도 두 개의 데이터 포인트들 사이의 변화율에 대한 정보(예: 기울기 정보)를 상 기 적어도 하나의 제3 데이터 포인트에 적용함으로써 상기 선택된 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정할 수 있다. 상기 제1 PA 동작 전압과 상기 기준 PA 동작 전압은 동일한 파워 모드에 대하여 설정 되었으므로, 상기 기준 PA 동작 전압에 대응하는 데이터 포인트들을 통해 생성된 변화율에 대한 정보를 상기 제 3 데이터 포인트에 적용하여 입력 파워를 결정할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 프로세서는 결정된 PA의 입력 파워에 기초하여 상기 RF 송신 회 로의 출력파워를 제어할 수 있다. 이에 따라 상기 프로세서는 상기 결정된 PA의 입력 파워가 상기 PA에 공급되도록 제어할 수 있다. 본 발명의 다양한 실시예에 따르면, 전자 장치는, 하우징, 상기 하우징 내에 포함되거나, 상기 하우징의 일부에 의하여 형성된 안테나, 상기 안테나와 전기적으로 연결된 전력 증폭기(power amplifier, PA), 상기 PA와 전기적 으로 연결된 라디오 주파수(radio frequency, RF) 송신 회로, 상기 RF 송신 회로 및 상기 PA와 전기적으로 연결 된 프로세서 및 상기 프로세서와 전기적으로 연결된 메모리를 포함하며, 상기 메모리는, 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 저장하고, 상기 정보는 제1 입력 파워에 기초한 제1 데이터 포인 트, 제2 입력 파워에 기초한 제2 데이터 포인트 및 상기 제1 및 제2 데이터 포인트 사이에 선형적(linearly)으 로 내삽되어(by interpolation) 생성된 제1 복수의 데이터 포인트들(a first plurality of data points)을 포함하며, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 안테나를 통한 신호의 송신 시에 필요한, 상기 PA의 출력 파워를 선택하고, 상기 제1 데이터 포인트, 상기 제2 데이터 포인트, 또는 상기 제1 복수의 데이터 포인트 들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하고, 상기 입력 파워에 기초하여 상기 RF 송신회로의 출력 파워를 제어하도록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 정보는, 제 3 입력 파워에 기초한 제 3 데이터 포인트, 제 4 입력 파 워에 기초한 제 4 데이터 포인트, 및 상기 제 3 및 제 4 데이터 포인트들 사이에 선형적으로 형성된 제 2 복수 의 데이터 포인트들(a second plurality of data points)을 포함하고, 상기 제 2 복수의 데이터 포인트들의 출 력 값의 적어도 일부는, 상기 제 1 복수의 데이터 포인트들의 출력 값보다 작을 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 제 1 데이터 포인트, 상기 제 2 데이터 포인트, 또는 상기 제 1 복수 의 데이터 포인트 들은, 상기 PA의 제 1 파워 모드와 연관되고, 상기 제 3 데이터 포인트, 상기 제4 데이터 포 인트, 또는 상기 제 2 복수의 데이터 포인트들은, 상기 PA의 제 2 파워 모드와 연관될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 정보는, 제 5 입력 파워에 기초한 제 5 데이터 포인트, 제 6 입력 파 워에 기초한 제 6 데이터 포인트, 및 상기 제 5 및 제 6 데이터 포인트들 사이에 선형적으로 형성된 제 3 복수 의 데이터 포인트들(a third plurality of data points)을 포함하며, 상기 제 3 복수의 데이터 포인트들의 출 력 값의 적어도 일부는, 상기 제 2 복수의 데이터 포인트들의 출력 값보다 작을 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 제 5 데이터 포인트, 상기 제 6 데이터 포인트, 또는 상기 제 3 복수 의 데이터 포인트 들은, 상기 PA의 제 3 파워 모드와 연관될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는, 상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 별로 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는, 상기 프로세서가 상기 PA의 복수의 파워 모드들 중 상기 선 택된 PA의 출력 파워에 대응하는 제1 파워 모드를 확인하도록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는, 상기 프로세서가 상기 제1 파워 모드에 대응하여 상기 메모 리에 저장된 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 제1 복수의 데이터 포인트 들 중 적어 도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하도록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는, 상기 프로세서가 상기 제1 파워 모드에 대응하는 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 제1 복수의 데이터 포인트들 중 상기 PA 출력 파워에 대응하 는 데이터 포인트를 확인하고, 상기 데이터 포인트가 확인되면, 상기 확인된 데이터 포인트에 대응하는 입력 파 워로 상기 PA의 입력 파워를 결정하도록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는, 상기 프로세서가 상기 데이터 포인트가 확인되지 않으면, 상기 제1 데이터 포인트와 상기 제2 데이터 포인트 사이의 변화율에 기초하여 상기 PA의 입력 파워를 결정하도 록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는, 상기 PA의 특성에 기초하여 설정된 PA의 복수의 파워 모드 들 마다 설정된 복수의 PA 동작 전압 별로 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보를 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는, 상기 프로세서가 상기 PA의 복수의 파워 모드들 중 상기 선 택된 PA의 출력 파워에 대응하는 제1 파워 모드를 확인하고, 상기 제1 파워 모드에 설정된 복수의 PA 동작 전압 중 상기 선택된 PA 출력 파워에 대응하는 제1 PA 동작 전압을 확인하도록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 전자 장치는 상기 PA 및 상기 프로세서와 전기적으로 연결된 전압 조정기를 더 포함하고, 상기 메모리는, 상기 프로세서가 상기 확인된 제1 PA 동작 전압이 상기 PA에 공급되도록 상기 전 압 조정기를 제어하도록 하는 인스트럭션들을 저장할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는, 상기 프로세서가 상기 제1 PA 동작 전압에 대응하여 상기 메모리에 저장된 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 제1 복수의 데이터 포인트들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하도록 하는 인스트럭션 들을 저장할 수 있다.도 2는 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 한 실시예에 따르면, 프로그램 모듈(예: 프로 그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제(operating system(OS)) 및/ 또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프로그램)을 포함할 수 있다. 운 영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비안(symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface (API)), 및/또는 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적 어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자 장치(102, 104), 서버 등)로부터 다운로드(download) 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포 함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이 버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter- process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능들 을 어플리케이션으로 제공할 수 있다. 한 실시예에 따르면, 미들웨어(예: 미들웨어)는 런타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀 티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매 니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출 력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기(life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하 여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어플리케 이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있 다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매 니저는 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있 다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공될 그 래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용 자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시예에 따르면, 전자 장치(예: 전자 장치)가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니 저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨 어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제 공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이 젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일 , 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리(health care)(예: 운동량 또 는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 전자 장치 (102, 104)) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의 상, \"정보 교환 어플리케이션\")을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전 달(notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 (예: 전자 장치(102, 104))로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치(102, 104))의 적어 도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비 스(예: 통화 서비스 또는 메시지 서비스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시예에 따르면, 어플리케이션은 외부 전자 장치(예: 전자 장치(102, 104))의 속성(에 따라 지정된 어 플리케이션(예: 모바일 의료 기기의 건강 관리 어플리케이션 등)을 포함할 수 있다. 한 실시예에 따르면, 어플 리케이션은 외부 전자 장치(예: 서버 또는 전자 장치(102, 104))로부터 수신된 어플리케이션을 포함 할 수 있다. 한 실시예에 따르면, 어플리케이션은 프리로드 어플리케이션(preloaded application) 또는 서 버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시예에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적 어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프로 세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이상의 기 능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등 을 포함할 수 있다. 도 3은 본 발명의 다양한 실시예에 따른 전자 장치의 구조를 도시한다. 도 3은 본 발명의 다양한 실시예에 따른 전자 장치의 구조를 간략히 나타낸 블록도이다. 본 발명의 다양 한 실시예에 따르면, 상기 전자 장치는 프로세서, PA, RF 송신 회로, 전압 조정기, 안테나 및 스위치를 포함할 수 있다. 상기 전자 장치에 포함된 각 구성 요소들은 상호 간에 전 기적으로 연결될 수 있다. 상기 안테나는 RF 신호 송수신을 수행하며, 하우징 내에 포함되거나 상기 하우징의 일부에 의하여 형성될 수 있다. 상기 PA는 상기 안테나와 스위치를 통하여 전기적으로 연결될 수 있다. 상기 RF 송신 회로는 상기 프로세서 및 상기 PA와 전기적으로 연결될 수 있다. 상기 RF 송신 회로는 상기 프로세서에서 생성된 신호를 RF 신호로 변환하여 상기 PA로 전송할 수 있다. 상기 전압 조정기는 상기 PA의 동작을 위해 PA 동작 전압을 제공할 수 있다. 상기 전압 조정기(33 0)는 상기 프로세서에 의해 결정된 PA 동작 전압을 상기 PA에 공급할 수 있다. 상기 프로세서는 상기 안테나를 통한 RF 신호의 송신 시에 필요한 상기 PA의 출력 파워를 선택할 수 있다. 상기 프로세서는 메모리에 저장된 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대 한 정보를 이용하여 상기 선택된 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정할 수 있다. 또한, 상기 프로세서는 상기 선택된 PA의 출력 파워에 기초하여 상기 PA에 공급될 PA 동작 전압을 결 정하고, 상기 결정된 PA 동작 전압이 상기 PA에 제공될 수 있도록 상기 전압 조정기를 제어할 수 있 다. 상기 프로세서는 상기 메모리에 저장된 적어도 두 개의 데이터 포인트들 및 상기 데이터 포인트들 사이에 선형적으로 내삽되어 생성된 복수의 데이터 포인트들을 이용하여 상기 PA의 입력 파워를 결정할 수 있다. 또한, 상기 프로세서는 상기 메모리에 저장된 보정이 수행된 데이터 포인트들을 이용하여 생 성되는 데이터 포인트들 사이의 변화율에 대한 정보를 생성하고, 생성된 변화율에 대한 정보를 이용하여 입력 파워를 결정할 수 있다. 상기 프로세서는 상기 결정된 PA의 입력 파워에 기초하여 상기 RF 송신 회로의 출력 파워를 제 어할 수 있다. 상기 프로세서는 상기 결정된 PA의 입력 파워가 상기 PA에 공급되도록 제어할 수 있다. 상기 PA의 출력 파워는 상기 프로세서, 상기 RF 송신 회로 및 상기 PA의 이득에 의하여 결정되므로, 상기 프로세서는 상기 결정된 PA의 입력 파워가 상기 PA에 공급되도록 상기 전자 장치에 포함된 각 구성 요소들을 제어할 수 있다. 예를 들어, 상기 전자 장치는 상기 결정된 PA의 입력 파워가 상기 PA에 공급되도록 각 구성요소들을 제어하기 위한 코드 값을 조정할 수 있다. 도 4는 일 비교예에 따른 PA에 대한 보정 방법을 설명하기 위한 도면이다. 일 비교예에 따른 PA에 대한 보정 방법은, 각 파워 모드 별로 설정된 입력 파워들을 하나의 코드(예: 1 dBm)씩 변화시키면서 출력 파워를 측정함으로써 보정을 수행할 수 있다. 도 4와 같이, 제1 파워 모드에 대응하여, 상기 PA의 특성에 기초하여 상기 제1 파워 모드에 설정된 입력 파워들에 대하여 출력 파워를 측정함으로써 보정을 수행할 수 있다. 제2 파워 모드, 제3 파워 모드 및 제4 파워 모드 역시 제1 파워 모드와 동일한 방식으로, 상기 PA의 특성 또는 사용자의 설정 에 기초하여 각 파워 모드 별로 설정된 입력 파워 들에 대하여 1 코드씩 변화 시키면서 보정을 수행할 수 있다. 상기 보정 수행 과정을 통하여 각 파워 모드 별로 설정된 출력 파워에 대응하는 입력 파워에 대한 정보가 획득 될 수 있다. 이와 같이 모든 파워 모드 별로 설정된 입력 파워들에 대해 보정을 수행함으로써, 보정 수행에 많은 시간이 소 모되고, 많은 양의 보정 수행 결과에 관한 데이터가 저장되어야 했다. 또한, 상기 PA의 각 파워 모드 별로 설정된 출력 파워의 범위에는 속하나 보정이 수행되지 않은 출력 파워에 대 응하는 입력 파워는, 보정이 수행된 출력 파워에 대응하는 입력 파워에 기초하여 결정되므로, 정확하게 결정될 수가 없다. 따라서, RF 신호 송신을 위한 출력 파워가 보정이 수행되지 않은 출력 파워로 선택되면, 선택된 출 력 파워에 대응하는 입력 파워를 정확히 결정하지 못하는 문제점이 발생될 수 있다. 도 5는 본 발명의 다양한 실시예에 따른 PA의 각 파워 모드 별 입력 파워와 출력 파워의 관계를 나타내는 그래 프이다. 도 5에서는 전자 장치에 포함되는 PA의 복수의 파워 모드들에 대응하는 입력 파워와 출력 파워의 관계를 나타내는 그래프를 도시한다. 상기 전자 장치는 상기 PA가 상기 PA의 특성에 기초하여 설정된 복수의 파 워 모드들 중 하나의 파워 모드로 동작하도록 제어할 수 있다. 예를 들어, 상기 전자 장치는 상기 복수의 파워 모드들 중 RF 신호 송신 시 필요한 출력 파워에 대응하는 파워 모드를 확인할 수 있다. 상기 전자 장치 는 상기 PA가 상기 출력 파워에 대응하는 파워 모드로 동작하도록 제어할 수 있다. 상기 복수의 파워 모 드들은 상기 PA의 특성에 기초하여 결정될 수 있다. 도 5에서는 상기 PA가 4 개의 파워 모드로 동작 가능한 경 우를 상정하도록 한다. 공급 가능한 파워의 크기에 따라 제1 파워 모드, 제2 파워 모드, 제3 파워 모드 및 제4 파워 모드로 구분하도록 한다. PA의 특성에 따라 각각의 파워 모드들에서는 입력 파워와 출력 파워 사이의 변화율에 대한 정보(예: 기울기 정 보)가 동일할 수 있다. 따라서, 각 파워 모드들 마다 입력 파워와 출력 파워의 관계가 도 5의 그래프와 같이 선형적으로 표현될 수 있다. 다만, 상기 복수의 파워 모드들 중 가장 높은 파워를 공급하는 제1 파워 모드에서 는 상기 PA에서 출력 가능한 최대 파워를 출력하기 위하여 상기 입력 파워와 출력 파워의 관계가 비선형 적으로 나타나는 비선형 구간이 존재할 수 있다.기존에는 각 파워 모드 별로 설정된 모든 입력 파워들에 대하여 출력 파워를 측정하여 보정을 수행해야 했다. 이로 인하여 보정 수행 시간이 길어 지고, 많은 양의 보정 수행 결과 데이터가 메모리에 저장되어야 했다. 또 한, 보정이 수행되지 않은 출력 파워에 대해서는 대응하는 입력 파워를 결정하기 위해서는 추가적인 보정을 수 행해야 하는 불편함이 초래되었다. 이에 반하여 본 발명의 다양한 실시예에 따르면, 각 파워 모드들 마다 모든 입력 파워가 아닌 두 개의 입력 파 워에 대하여만 보정을 수행할 수 있다. 전자 장치는 상기 두 개의 입력 파워에 대한 보정 수행 결과를 이용하여 모든 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 상술한 바와 같이, 각 파워 모드들 마다 입력 파워와 출력 파워의 관계를 선형적으로 나타낼 수 있으므로, 상기 전자 장치는 상기 입력 파워와 출력 파워의 선형적 관계를 이용하여 보정이 수행되지 않은 출력 파워에 대 해서도 대응하는 입력 파워를 결정할 수 있다. 도 5에서는 각 파워 모드들 마다 선형 구간에 대해서는 두 개의 데이터 포인트들만을 획득한 것으로 설명하였으 나, 이는 설명의 목적을 위한 일 예일 뿐이며 이에 제한되는 것은 아니다. 상기 입력 파워를 결정하기 위하여 각 파워 모드 별로 최소한 두 개의 데이터 포인트가 필요할 뿐, 두 개 이상의 데이터 포인트들을 이용하여 입력 파워를 결정할 수도 있다. 따라서, 상기 PA의 특성 및 보정 시의 설정에 따라 두 개 이상의 데이터 포인트들이 획득되어 상기 전자 장치의 메모리에 저장될 수도 있다. 도 5를 참조하면, 제1 파워 모드에 대응하여서는 세 개의 데이터 포인트(510a, 510b, 510c)가 저장될 수 있다. 상술한 바와 같이, PA의 복수의 파워 모드들 중 가장 높은 파워를 공급하는 제1 파워 모드에서는 비선형 구간이 존재할 수 있다. 상기 비선형 구간에서는 선형 구간과는 다른 방식으로 입력 파워가 결정되므로, 상기 비선형 구간에 대응하는 데이터 포인트(510c)가 선형 구간에 대응하는 데이터 포인트들(510a, 510b)과 더불어 저장될 수 있다. 일 실시예에 따르면, 비선형 구간이 존재하는 파워 모드에 있어, 선형 구간의 데이터 포인트중 적어도 하나는 비선형 구간에 근접할 수 있다. 제2 파워 모드, 제3 파워 모드 및 제4 파워 모드 각각에 대응하여서는 각각 두 개의 데이터 포인트(520a, 520b, 530a, 530b, 540a, 540b)가 저장될 수 있다. 상기 전자 장치는 각 파워 모드에 대응하여 메모리에 저장된 두 개의 데이터 포인트들을 이용하여 각 파워 모드를 통해 출력 가능한 모든 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 예를 들어, 상기 전자 장치는 각 파워 모드 별로 상기 두 개의 데이터 포인트들을 이용하여 복수의 데이터 포인트들을 선형적으로 내삽하여 생성할 수 있다. 상기 전자 장치는 각 파워 모드 별로 상기 두 개의 데 이터 포인트들 또는 상기 복수의 데이터 포인트들 중 적어도 하나를 이용하여 입력 파워를 결정할 수 있다. 또한, 상기 전자 장치는 상기 각 파워 모드 별로 상기 두 개의 데이터 포인트들 사이의 변화율에 대한 정 보를 생성하고, 생성된 변화율에 대한 정보를 상기 두 개의 데이터 포인트들 사이에 적용하여 상기 출력 파워에 대응하는 입력 파워를 결정할 수도 있다. 상기 두 개의 데이터 포인트들은 위에서 설명한 바와 같이 선형적 특 성을 가지므로, 상기 전자 장치는 상기 선형적 특성을 이용하여 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 다만, 제1 파워 모드는 위에서 언급한 바와 같이, 상기 입력 파워와 상기 출력 파워의 관계가 비선형 적으로 나 타나는 비선형 구간이 존재할 수 있다. 이에 따라, 전자 장치는 제1 파워 모드에 대응하여 선형 구간에 대응하는 상기 두 개의 데이터 포인트들(510a, 510b) 및 비선형 구간에 대응하는 상기 한 개의 데이터 포인트 (510c)를 이용하여 제1 파워 모드를 통해 출력 가능한 모든 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 이와 같이, 상기 전자 장치는 각 파워 모드 별로 최소의 보정(calibration) 수행으로 각 파워 모드 별로 출력 가능한 모든 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 도 6a는 본 발명의 다양한 실시예에 따른 PA 동작 전압을 조정하는 방법을 설명하기 위한 도면이다. 본 발명의 다양한 실시예에 따른 PA는 RF 신호 송신을 위하여 RF 신호의 파워를 증폭시켜 출력할 수 있다. 상 기 PA가 상기 RF 신호의 파워를 증폭시키기 위해서는 일정한 PA 동작 전압이 상기 PA에 공급되어야 한다. 이와 같이, 상기 PA의 동작에 따라 전력 소모가 발생하게 되는데, 상기 PA가 포함되는 전자 장치가 배터리와 같 은 용량이 제한된 전원을 통해 동작하게 되는 경우, 상기 PA의 전력 소모를 줄일 필요가 있다. 상기 PA의 전력 소모를 줄이기 위하여, 상기 PA에 공급되는 PA 동작 전압을 감소시키면, 상기 PA에서 소모되는 전력이 감소될 수 있다. 다만, PA의 동작에 영향을 주지 않는 범위 내에서 상기 PA의 동작 전압이 조정될 필요 가 있다. 도 6a에서는, Vcc1이 상기 PA 동작 전압으로 상기 PA에 공급되는 경우 상기 PA를 통해 최대 제1 전력(W1) 을 가지는 RF 신호가 출력 가능하고, 상기 Vcc1 보다 낮은 전압인 Vcc2가 상기 PA 동작 전압으로 상 기 PA에 공급되는 경우 상기 PA를 통해 최대 제2 전력(W2)을 가지는 RF 신호가 출력 가능한 것으로 상정하도록 한다. 또한, 상기 PA를 통하여 출력되는 상기 RF 신호의 최대 전력은 상기 제2 전력(W2)보다 작고, 현재 Vcc1이 상기 PA 동작 전압으로 설정된 경우를 상정하도록 한다. 이 경우, 상기 RF 신호는 상기 Vcc2가 상기 PA 동작 전압으로 설정되어 상기 PA에 공급되더라도 상기 PA를 통하여 출력될 수 있다. 그럼에도 상기 Vcc1이 상기 PA 동작 전압으로 설정되어 상기 PA에 공급되면, 상기 PA에서는 불필요한 전력 소모가 발생할 수 있다. 따라서, 상기 RF 신호를 출력하는 과정 에서 소모되는 전력을 감소시키기 위해서는 상기 PA 동작 전압이 현재 설정된 Vcc1 보다 낮은 Vcc2로 재설정될 필요가 있다. 이와 같이, 상기 PA에 대한 보정을 수행하는 과정에 있어서, 상기 RF 신호 송신을 위해 필요한 출력 파워 에 따라 상기 PA에서 소모되는 전력을 감소시키기 위하여 상기 PA의 동작 전압이 상이하게 설정될 수 있다. 이 와 같은 PA 동작 전압은 파워 모드 별로 상기 PA의 특성에 기초하여 설정될 수 있다. 이와 같이 PA 동작 전압을 조정함으로써 PA에서 소모되는 전력을 감소시킬 수 있다. 도 6b는 본 발명의 다양한 실시예에 따른 각 파워 모드 및 PA 동작 전압 별 입력 파워와 출력 파워의 관계를 나 타내는 그래프이다. 도 6b에서는 전자 장치에 포함되는 PA의 복수의 파워 모드들 마다 설정된 복수의 PA 동작 전압 각각에 대 응하는 입력 파워와 출력 파워의 관계를 나타내는 그래프를 도시한다. 상기 PA에서 소모되는 전력를 감소 시키 기 위하여 복수의 파워 모드들 마다 상기 PA의 특성에 기초하여 복수의 PA 동작 전압이 설정될 수 있다. 도 6b에서는 각 파워 모드 별로 2 개의 PA 동작 전압이 설정된 것으로 상정하도록 한다. 또한, 각 파워 모드 별로 제1 PA 동작 전압에 대응하여서는 입력 파워와 출력 파워 사이의 변화율에 대한 정보를 생성하기 위하여 두 개의 데이터 포인트가 저장되고, 제2 PA 동작 전압에 대응하여서는 한 개의 데이터 포인트가 저장된 것으로 상정하도록 한다. 상기 제2 PA 동작 전압은 상기 PA의 특성에 기초하여 PA에서 소모되는 전력을 줄이기 위해 조정되는 PA 동작 전압일 수 있다. 도 5에서 설명한 바와 같이, 가장 높은 파워를 공급하는 제1 파워 모드에서는 비선형 구간이 존재할 수 있으므 로, 상기 제1 파워 모드에 설정된 제1 PA 동작 전압에 대응하여서는 비선형 구간에 해당하는 한 개의 데이터 포 인트(650c)가 추가적으로 저장될 수 있다. 이에 따라 도 5에서 설명한 것과 같이, 제1 파워 모드의 제1 PA 동작 전압에 대응하여 선형 구간에 해당하는 두 개의 데이터 포인트(650a, 650b) 및 비선형 구간에 해당하는 한 개의 데이터 포인트(650c)가 저장될 수 있다. 또한, 제2 파워 모드의 제1 PA 동작 전압에 대응하여 두 개의 데이터 포인트(660a, 660b)가 저장되고, 제3 파워 모드의 제1 PA 동작 전압에 대응하여 두 개의 데이터 포인트(670a, 670b)가 저장되며, 제4 파워 모드의 기준 PA 동작 전압에 대응하여 두 개의 데이터 포인트(680a, 680b)가 저장될 수 있다. 또한, 각 파워 모드 별로 설정된 제2 PA 동작 전압에 대응하여서는 하나의 데이터 포인트 만을 이용하여 입력 파워를 결정할 수 있다. 각 파워 모드 별로 입력 파워와 출력 파워 사이의 변화율에 대한 정보가 동일하므로, 상기 제1 PA 동작 전압에 대응하는 두 개의 데이터 포인트를 이용하여 생성되는 입력 파워와 출력 파워 사이의 변화율에 대한 정보를 상기 제2 PA 동작 전압에 대응하여 저장된 하나의 데이터 포인트에 적용할 수 있다. 따 라서, 하나의 데이터 포인트 만을 상기 제2 PA 동작 전압에 대응하여 저장하더라도 출력 파워에 대응하는 입력 파워가 결정될 수 있다. 이에 따라 도 6b에 도시된 바와 같이, 제1 파워 모드의 제2 PA 동작 전압에 대응하여 한 개의 데이터 포인트 (650d)가 저장되고, 제2 파워 모드의 제2 PA 동작 전압에 대응하여 한 개의 데이터 포인트(660c)가 저장되고, 제3 파워 모드의 제2 PA 동작 전압에 대응하여 한 개의 데이터 포인트(670c)가 저장되고, 제4 파워 모드의 제2 PA 동작 전압에 대응하여 한 개의 데이터 포인트(680c)가 저장될 수 있다. 이와 같은 각 파워 모드 별 한 개의 데이터 포인트는 상기 두 개의 데이터 포인트에 대응하는 출력 파워 보다 낮은 출력 파워에 대응되도록 획득될 수 있다. 이와 같이, 상기 전자 장치는 각 파워 모드 별로 설정된 복수의 PA 동작 전압 별로 최소의 보정 (calibration) 수행으로, 각 PA 동작 전압 별로 출력 가능한 모든 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 도 7은 본 발명의 다양한 실시예에 따른 전자 장치의 제조 방법에 대한 흐름도이다. RF 신호 송신 시 필요한 PA의 출력 파워에 대응하는 입력 파워를 결정하는 데에 이용되는 상기 메모리에 저장된 데이터 포인트들은 상기 전자 장치의 제조 과정에서 수행되는 보정을 통해 획득될 수 있다. 상기 전자 장치의 제조 과정에서 상기 데이터 포인트들을 획득하고, 상기 획득된 데이터 포인트들을 이용하여 복수의 데이터 포인트들 및 상기 데이터 포인트들 사이의 변화율에 대한 정보를 생성하여 저장하는 방법은 하기 와 같이 수행될 수 있다. 710 동작에서, 상기 전자 장치는 상기 PA에 제1 입력 파워를 인가하고 상기 제1 입력 파워에 기인한 상기 PA의 제1 출력 파워를 측정하여 제1 데이터 포인트를 획득할 수 있다. 720 동작에서, 상기 전자 장치는 상기 PA에 제2 입력 파워를 인가하고 상기 제2 입력 파워에 기인한 상기 PA의 제2 출력 파워를 측정하여 제2 데이터 포인트를 획득할 수 있다. 상기 710 및 상기 720 동작에서, 상기 제1 입력 파워 및 상기 제2 입력 파워를 상기 PA에 인가함에 따라 다른 전자 장치에 포함되는 PA의 출력 파워와 상기 제1 출력 파워 및 제2 출력 파워가 동일해 질 수 있도록 상기 전 자 장치에 포함되는 각 구성 요소의 설정을 보정할 수 있다. 730 동작에서, 상기 전자 장치는 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트를 이용하여, 복수의 데이터 포인트들을 선형적으로(linearly) 내삽하여(by interpolation) 생성할 수 있다. 740 동작에서, 상기 전자 장치는 상기 생성된 복수의 데이터 포인트들을 상기 메모리에 저장할 수 있 다. 이와 같이, 상기 전자 장치는 제조 과정에서 수행되는 보정 시, 제1 데이터 포인트 및 제2 데이터 포 인트만을 획득하여 저장함으로써 보정 수행 시간이 감소될 수 있다. 또한, 상기 전자 장치는 보정 시 획 득한 제1 데이터 포인트 및 제2 데이터 포인트를 이용하여 생성된 복수의 데이터 포인트들을 이용하여 상기 PA 를 통해 출력 가능한 모든 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 일 실시예에서, 상기 전자 장치는 상기 730 동작에서 상기 복수의 데이터 포인트들이 아닌 상기 제1 데이 터 포인트 및 상기 제2 데이터 포인트 사이의 변화율에 대한 정보를 생성하고, 상기 740 동작에서 상기 변화율 에 대한 정보를 저장할 수도 있다. 상기 전자 장치는 상기 생성된 변화율에 대한 정보를 통해서도 상기 PA를 통해 출력 가능한 모든 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 일 실시예에서, 상기 전자 장치는 상기 730 동작 및 상기 740 동작을 수행하지 않을 수도 있다. 상기 전 자 장치는 보정 시 획득한 제1 데이터 포인트 및 제2 데이터 포인트만을 상기 메모리에 저장할 수 있 다. 이에 따라, 상기 전자 장치는 RF 신호 송신 시 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트를 이용하여 상기 변화율에 대한 정보를 생성하고, 생성된 변화율에 대한 정보를 이용하여 입력 파워를 결정할 수 도 있다. 도 8은 본 발명의 다양한 실시예에 따른 RF 신호 전송을 위한 전자 장치 동작 방법의 흐름도이다. 810 동작에서, 상기 전자 장치는 RF 신호의 송신 시에 필요한 상기 PA의 출력 파워를 선택할 수 있다. 상 기 전자 장치는 상기 전자 장치와 연결된 네트워크의 특성에 기초하여 상기 PA의 출력 파워를 선택할 수 있다. 820 동작에서, 상기 전자 장치는 상기 메모리에 저장된 상기 PA의 입력 파워의 변화에 따른 출력 파 워의 변화에 대한 정보를 이용하여 상기 선택된 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정할 수 있다. 예를 들어, 상기 전자 장치는 상기 메모리에 저장된 상기 PA의 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보에 포함되는 데이터 포인트들 중 상기 선택된 PA 출력 파워에 대응하는 데이터 포인트를 통해 PA 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 또한, 상기 전자 장치는 상기 데이터 포인트들을 이용하여 상기 PA 출력 파워에 대응하는 입력 파워를 산 출하고, 산출된 입력 파워를 상기 PA 출력 파워에 대응하는 입력 파워로 결정할 수도 있다.830 동작에서, 상기 전자 장치는 결정된 PA의 입력 파워에 기초하여 상기 RF 송신 회로의 출력파워를 제어 할 수 있다. 이에 따라 상기 전자 장치는 상기 결정된 PA의 입력 파워가 상기 PA에 공급되도록 제어할 수 있다. 도 9는 본 발명의 다양한 실시예에 따른 전자 장치에 의한 RF 신호 전송을 위하여 PA에 파워를 공급하는 방법의 흐름도이다. 910 동작에서, 상기 전자 장치는 RF 신호 송신을 위하여 복수의 파워 모드 중에서 선택된 PA의 출력 파워 에 대응하는 파워 모드를 선택할 수 있다. 상기 전자 장치는 상기 PA의 복수의 파워 모드 별로 보정이 수 행되어 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보가 상기 PA의 복수의 파워 모드들 별로 저 장되어 있는 경우, PA의 입력 파워를 결정하기 위하여 상기 PA의 출력 파워에 대응하는 파워 모드를 선택할 수 있다. 920 동작에서, 상기 전자 장치는 상기 선택된 파워 모드에 대응하여 저장된 적어도 두 개의 데이터 포인트 들에 관한 정보를 이용하여 상기 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 예를 들어, 상기 전자 장치는 상기 적어도 두 개의 데이터 포인트들 사이의 변화율에 대한 정보를 상기 적 어도 두 개의 데이터 포인트들 중 적어도 하나에 적용하여 상기 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 상기 변화율에 대한 정보는 상기 전자 장치가 상기 적어도 두 개의 데이터 포인트들을 이용하여 미리 생성 하여 상기 메모리에 저장할 수 있다. 이 경우, 상기 전자 장치는 상기 메모리에 저장된 상기 변화율에 대한 정보를 이용하여 상기 입력 파워를 결정할 수 있다. 또한, 상기 변화율에 대한 정보는 RF 송신 시, 상기 전자 장치에 의하여 생성될 수 있다. 이 경우, 상기 전자 장치는 상기 RF 송신 시 상기 메모리에 저장된 상기 적어도 두 개의 데이터 포인트들을 이용하 여 상기 변화율에 대한 정보를 생성하는 별도의 연산을 더 수행할 수 있다. 930 동작에서, 상기 전자 장치는 상기 결정된 입력 파워를 상기 PA로 공급할 수 있다. 상기 결정된 입력 파워가 상기 PA로 공급됨에 따라 RF 신호 송신을 위하여 선택된 PA의 출력 파워가 상기 PA에서 출력될 수 있다. 도 10은 본 발명의 다양한 실시예에 따른 전자 장치에의한 PA 동작 전압이 조정되는 경우 입력 파워를 결정하 는 방법의 흐름도이다. 1010 동작에서, 상기 전자 장치는 RF 신호 송신을 위하여 선택된 PA의 출력 파워에 대응하는 파워 모드를 선택할 수 있다. 1020 동작에서, 상기 전자 장치는 상기 입력 파워의 변화에 따른 출력 파워의 변화에 대한 정보가 상기 PA 의 복수의 파워 모드들 마다 설정된 복수의 PA 동작 전압 별로 저장되어 있는 경우, 상기 선택된 파워 모드에 설정된 복수의 PA 동작 전압들 중 상기 PA의 출력 파워에 대응하는 제1 PA 동작 전압을 확인할 수 있다. 1030 동작에서, 상기 전자 장치는 상기 제1 PA 동작 전압이 상기 적어도 두 개의 데이터 포인트들의 획득 시 이용된 기준 PA 동작 전압과 동일한지 여부를 확인할 수 있다. 상기 기준 PA 동작 전압에 대응하여 적어도 두 개의 데이터 포인트들이 저장될 수 있다. 상기 기준 PA 동작 전 압에 대응하는 상기 적어도 두 개의 데이터 포인트들을 이용하여 입력 파워와 출력 파워 사이의 변화율에 대한 정보가 생성될 수 있다. 1040 동작에서, 상기 전자 장치는 상기 제1 PA 동작 전압과 상기 기준 PA 동작 전압이 동일한 경우, 상기 기준 PA 동작 전압에 대응하는 상기 적어도 두 개의 데이터 포인트들을 이용하여 상기 입력 파워를 결정할 수 있다. 1050 동작에서, 상기 전자 장치는 상기 제1 PA 동작 전압과 상기 기준 PA 동작 전압이 상이한 경우, 상기 제1 PA 동작 전압으로 상기 PA 에 공급되는 전압이 조정되도록 할 수 있다. 상기 전자 장치는 상기 PA에 서 소모되는 전력을 감소시키기 위하여 상기 PA에 공급되는 전압을 상기 제1 PA 동작 전압으로 조정할 수 있다. 1060 동작에서, 상기 전자 장치는 상기 적어도 두 개의 데이터 포인트들 및 상기 메모리에 저장된 적 어도 하나의 제3 데이터 포인트에 관한 정보를 더 이용하여 상기 PA의 입력 파워를 결정할 수 있다. 상기 전자 장치는 하나의 파워 모드에서는 입력 파워와 출력 파워 사이의 변화율에 대한 정보가 동일하게 설정된 PA의 특성을 이용하여 상기 PA의 입력 파워를 결정할 수 있다. 예를 들어, 상기 전자 장치는 상기 적어도 두 개의 제1 데이터 포인트들 사이의 변화율에 대한 정보(예: 기울기 정보)를 상기 적어도 하나의 제3 데이터 포인트에 적용함으로써 상기 선택된 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정할 수 있다. 1070 동작에서, 상기 전자 장치는 상기 결정된 입력 파워를 상기 PA로 공급할 수 있다. 상기 결정된 입력 파워가 상기 PA로 공급됨에 따라 RF 신호 송신을 위하여 선택된 PA의 출력 파워가 상기 PA에서 출력될 수 있다. 본 발명의 다양한 실시예에 따르면, RF 신호 전송을 위한 전자 장치의 동작 방법은, 상기 전자 장치에 포함되는 안테나를 통한 신호의 송신 시에 필요한, 상기 전자 장치에 포함된 PA의 출력 파워를 선택하는 동작, 상기 전자 장치에 포함되는 메모리에 저장된 제1 데이터 포인트, 제2 데이터 포인트 또는 복수의 데이터 포인트들 중 적어 도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정하는 동작 및 상기 입력 파워 에 기초하여 상기 전자 장치에 포함되는 RF 송신 회로의 출력 파워를 제어하는 동작을 포함하고, 상기 복수의 데이터 포인트들은 상기 제1 데이터 포인트 및 상기 제2 데이터 포인트 사이에 선형적으로 내삽되어 생성될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들은, 상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 별로 저장될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 방법은, 상기 PA의 복수의 파워 모드들 중 상기 선택된 PA의 출력 파 워에 대응하는 제1 파워 모드를 확인하는 동작을 더 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 PA의 입력 파워를 결정하는 동작은, 상기 제1 파워 모드에 대응하여 상기 메모리에 저장된 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트 들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 PA의 입력 파워를 결정하는 방법은, 상기 제1 파워 모드에 대응하는 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들 중 상기 PA 출력 파워에 대응하는 제3 데이터 포인트를 확인하는 동작 및 상기 제3 데이터 포인트가 확인되면, 상기 제3 데이터 포인트 에 대응하는 입력 파워로 상기 PA의 입력 파워를 결정하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 방법은, 상기 PA의 입력 파워를 결정하는 동작은, 상기 제3 데이터 포 인트가 확인되지 않으면, 상기 제1 데이터 포인트와 상기 제2 데이터 포인트 사이의 변화율에 기초하여 상기 PA 의 입력 파워를 결정하는 동작을 더 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들은, 상기 PA의 특성에 기초하여 설정된 PA의 복수의 파워 모드들 마다 설정된 복수의 PA 동작 전압 별 로 저장될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 방법은, 상기 PA의 복수의 파워 모드들 중 상기 선택된 PA의 출력 파 워에 대응하는 제1 파워 모드를 확인하는 동작 및 상기 제1 파워 모드에 설정된 복수의 PA 동작 전압들 중 상기 선택된 PA 출력 파워에 대응하는 제1 PA 동작 전압을 확인하는 동작을 더 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 방법은, 상기 확인된 제1 동작 전압으로 상기 PA에 전압을 공급하는 동작을 더 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 PA의 입력 파워를 결정하는 동작은, 상기 제1 PA 동작 전압에 대응하 여 상기 메모리에 저장된 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 또는 상기 복수의 데이터 포인트들 중 적어도 하나를 이용하여, 상기 PA의 출력 파워에 대응하는 상기 PA의 입력 파워를 결정할 수 있다. 도 11은 본 발명의 다양한 실시예에 따른 PA에 대한 보정 수행 방법의 흐름도이다. 도 11 및 도 12에서는 PA에 대한 보정 수행 방법을 설명하도록 한다. 상기 PA에 대한 보정은, 상기 PA, 상기 전자 장치 및 보정을 수행하는 제1 전자 장치가 서로 연결된 상태에서 수행될 수 있다. 상기 전자 장치 는 상기 제1 전자 장치로부터 보정이 수행됨에 따라 획득되는 출력 파워 및 상기 출력 파워에 대응하는 입 력 파워에 관한 적어도 두 개의 데이터 포인트들을 획득할 수 있다. 1110 동작에서, 제1 전자 장치는 PA의 모든 파워 모드에 대한 보정이 완료되었는지 확인할 수 있다. 상술한 바 와 같이, PA는 PA의 특성에 기초하여 설정된 복수의 파워 모드 중 하나의 파워 모드로 동작할 수 있다. 이에 따라, 보정은 PA의 모든 파워 모드에 대해 수행될 수 있다. 1120 동작에서, 상기 제1 전자 장치는 상기 PA의 모든 파워 모드에 대한 보정이 완료된 경우, 보정을 통해 획득 한 데이터 포인트들 이용하여 PA의 출력 파워 별로 대응되는 입력 파워를 확인하는 동작을 수행할 수 있다. 예 를 들어, 상기 보정을 획득된 데이터 포인트들 사이의 선형적 관계를 이용하여 상기 PA의 출력 파워 별로 대응 되는 입력 파워가 확인될 수 있다. 이를 통하여, 상기 제1 전자 장치는 확인된 PA의 출력 파워 별로 결정되는 입력 파워가 제대로 결정되는지 확인할 수 있으며, PA 출력 파워 별로 결정되는 입력 파워에 대한 정보를 상기 전자 장치로 송신할 수 있다. 또한, 일 실시예에서, 1120 동작은 수행되지 않을 수도 있다. 보정을 수행한 제1 전자 장치는 보정 수행을 통 해 획득되는 적어도 두 개의 데이터 포인트들 만을 상기 전자 장치로 송신할 수 있다. 1130 동작에서, 상기 제1 전자 장치는 PA의 모든 파워 모드에 대한 보정이 완료되지 않은 경우, 보정을 진행할 파워 모드를 선택할 수 있다. 1140 동작에서, 상기 제1 전자 장치는 선택한 파워 모드가 상기 PA의 복수의 파워 모드들 중 가장 높은 전력을 제공하는 하이 파워 모드인지를 확인할 수 있다. 상기 하이 파워 모드에서는 상기 PA에서 출력 가능한 최대 파 워를 출력하기 위하여 PA의 특성에 따라 비선형 구간이 존재할 수 있다. 또한, 상기 비선형 구간에서는 선형 구간과 다른 방식으로 입력 파워가 결정되므로, 비선형 구간에 대해 별도로 보정을 수행할 필요가 있다. 1150 동작에서, 상기 제1 전자 장치는 선택한 파워 모드가 하이 파워 모드인 경우, PA의 특성에 따라 설정된 선 형 구간 및 비선형 구간에 대해 보정을 진행할 수 있다. 1160 동작에서, 상기 제1 전자 장치는 선택한 파워 모드가 하이 파워 모드가 아닌 경우 비선형 구간이 존재하지 않으므로, 선형 구간에 대해서만 보정을 진행할 수 있다. 1150 동작 및 1160 동작에서 진행 되는 보정은, PA에 적어도 두 개의 입력 파워를 인가하고, 인가된 적어도 두 개의 입력 파워에 대해 PA에서 출력되는 출력 파워를 측정함으로써 수행될 수 있다. 상기 측정되는 출력 파워 가 다른 전자 장치의 PA에 상기 적어도 두 개의 입력 파워가 인가됨에 따라 출력되는 출력 파워가 동일해 질 수 있도록 상기 전자 장치에 포함되는 각 구성 요소의 설정이 보정될 수 있다. 제1 전자 장치는 각 구성 요 소의 설정을 보정함으로써 획득되는 출력 파워 및 상기 출력 파워에 대응하는 입력 파워에 관한 데이터 포인트 들을 상기 전자 장치로 송신할 수 있다. 1170 동작에서, 상기 제1 전자 장치는 보정을 통해 획득된 적어도 2개 이상의 데이터 포인트들을 이용하여 상기 데이터 포인트들 사이의 변화율에 대한 정보를 산출할 수 있다. 상기 변화율에 대한 정보는 상기 데이터 포인 트들 각각에 대응하는 입력 파워의 변화량과 출력 파워의 변화량에 대한 정보를 포함할 수 있다. 예를 들어, 상기 변화율에 대한 정보는 수학식 1과 같은 입력 파워의 변화량에 대한 출력 파워의 변화량을 나타내는 기울기 정보를 포함할 수 있다. 수학식 1"}
{"patent_id": "10-2015-0113885", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기에서 m은 변화율에 대한 정보(예: 기울기 정보)를 나타내고, I1은 제1 데이터 포인트에 대응하는 입력 파워, I2는 제2 데이터 포인트에 대응하는 입력 파워, O1은 제1 데이터 포인트에 대응하는 출력 파워, O2는 제2 데이터 포인트에 대응하는 출력 파워이다. 제1 전자 장치는 1170 동작을 통해 산출된 변화율에 대한 정보를 획득된 데이터 포인트들과 함께 상기 전자 장 치로 송신할 수 있다. 상기 전자 장치는 RF 신호 송신 시 필요한 PA의 출력 파워에 대응하는 입력 파워를 결정하기 위하여 상기 데이터 포인트들 및 상기 메모리에 저장된 변화율에 대한 정보를 이용할 수있다. 또한, 일 실시예에서, 1170 동작은 수행되지 않을 수도 있다. 상기 제1 전자 장치는 보정을 통해 획득된 적어 도 2개 이상의 데이터 포인트들만을 상기 전자 장치로 송신할 수 있다. 이 경우, 상기 전자 장치는 RF 송신 시, 상기 PA의 출력 파워에 대응하는 입력 파워를 결정하기 위하여, 상기 데이터 포인트들을 이용하여 상기 변화율에 대한 정보를 계산할 수 있다. 상기 전자 장치는 상기 계산된 변화율을 이용하여 상기 입력 파워를 결정할 수도 있다. 도 12는 본 발명의 다양한 실시예에 따른 PA에 대한 보정 수행 방법의 흐름도이다. 1210 동작에서, 제1 전자 장치는 PA의 모든 파워 모드에 대한 보정이 완료되었는지 확인할 수 있다. 상술한 바 와 같이, PA는 PA의 특성에 기초하여 설정된 복수의 파워 모드 중 하나의 파워 모드로 동작할 수 있다. 이에 따라, 보정은 PA의 모든 파워 모드에 대해 수행될 수 있다. 1220 동작에서, 제1 전자 장치는 보정이 수행 시 PA에 공급되는 기준 PA 동작 전압을 각 파워 모드 별로 변경하 여 적어도 하나의 입력 파워에 대하여 보정을 수행할 수 있다. 또한, 각 파워 모드 별로 PA 동작 전압을 추가 적으로 더 변경하여 보정을 수행할 수 있다. 변경되는 PA 동작 전압들은 PA의 특성에 따라 RF 신호 전송을 위 한 출력 파워에 영향을 주지 않는 범위에서 설정될 수 있다. 예를 들어, 제1 전자 장치는 제1 파워 모드에 대하여 PA 동작 전압을 Vcc1으로 변경하여 보정을 수행할 수 있다. 또한, 제1 전자 장치는 PA에서 소모되는 전력을 감소시키기 위하여, 각 출력 파워 별로 최적화된 PA 동작 전압 을 공급하기 위하여 상기 PA의 특성에 따라 결정되는 추가적인 PA 동작 전압에 대해 보정을 더 수행할 수 있다. 예를 들어, 상기 Vcc1과는 상이한 Vcc2로 PA 동작 전압을 변경하여 추가적인 보정을 더 수행할 수 있다. 또한, PA의 특성에 따라 다양하게 PA 동작 전압을 변경하여 추가적인 보정을 더 수행할 수도 있다. 상기 제1 파워 모 드를 제외한 다른 파워 모드들에 대해서도 동일한 방식으로 PA 동작 전압을 변경 또는 추가하여 보정이 더 수행 될 수 있다. 이와 같이 적어도 하나의 입력 파워에 대하여 보정을 통해 적어도 하나의 데이터 포인트들을 획득하면, 기준 PA 동작 파워에서 보정을 수행하여 획득한 적어도 두 개의 데이터 포인트들 사이의 변화율에 대한 정보를 상기 적 어도 하나의 데이터 포인트에 적용하여 입력 파워를 결정할 수 있다. 상기 PA 동작 전압이 다른 경우, PA의 동 일한 파워 모드라도 이득이 서로 상이할 수는 있으나, 변화율에 대한 정보는 동일하므로, PA 동작 전압을 변경 하여 획득한 적어도 하나의 데이터 포인트에 기준 PA 동작 파워에서 획득한 적어도 두 개의 데이터 포인트들 사 이의 변화율에 대한 정보를 적용할 수 있다. 1230 동작에서, 상기 제1 전자 장치는 상기 PA의 모든 파워 모드에 대한 보정이 완료된 경우, 보정을 통해 획득 한 데이터 포인트들 이용하여 PA의 출력 파워 및 PA 동작 전압 별로 대응되는 입력 파워를 확인하는 동작을 수 행할 수 있다. 예를 들어, 상기 보정을 획득된 데이터 포인트들 사이의 선형적 관계를 이용하여 상기 PA의 출력 파워 및 PA 동작 전압 별로 대응되는 입력 파워가 확인될 수 있다. 이를 통하여, 상기 제1 전자 장치는 확인된 PA의 출력 파워 별로 결정되는 입력 파워가 제대로 결정되는지 확인할 수 있으며, PA 출력 파워 및 PA 동작 전 압 별로 결정되는 입력 파워에 대한 정보를 상기 전자 장치로 송신할 수 있다. 또한, 일 실시예에서, 1230 동작은 수행되지 않을 수도 있다. 보정을 수행한 제1 전자 장치는 보정 수행을 통 해 데이터 포인트들 만을 상기 전자 장치로 송신할 수 있다. 1240 동작에서, 상기 제1 전자 장치는 PA의 모든 파워 모드에 대한 보정이 완료되지 않은 경우, 보정을 진행할 파워 모드를 선택할 수 있다. 1250 동작에서, 상기 제1 전자 장치는 선택한 파워 모드가 상기 PA의 복수의 파워 모드들 중 가장 높은 전력을 제공하는 하이 파워 모드인지를 확인할 수 있다. 상기 하이 파워 모드에서는 상기 PA에서 출력 가능한 최대 파 워를 출력하기 위하여 PA의 특성에 따라 비선형 구간이 존재할 수 있다. 또한, 상기 비선형 구간에서는 선형 구간과 다른 방식으로 입력 파워가 결정되므로, 비선형 구간에 대해 별도로 보정을 수행할 필요가 있다. 1260 동작에서, 상기 제1 전자 장치는 선택한 파워 모드가 하이 파워 모드인 경우, PA의 특성에 따라 설정된 선 형 구간 및 비선형 구간에 대해 보정을 진행할 수 있다. 1270 동작에서, 상기 제1 전자 장치는 선택한 파워 모드가 하이 파워 모드가 아닌 경우 비선형 구간이 존재하지 않으므로, 선형 구간에 대해서만 보정을 진행할 수 있다.1280 동작에서, 상기 제1 전자 장치는 보정을 통해 획득된 데이터 포인트들을 이용하여 상기 데이터 포인트들 사이의 변화율에 대한 정보를 산출할 수 있다. 또한, 일 실시예에서, 1280 동작은 수행되지 않을 수도 있다. 상기 제1 전자 장치는 메모리에 보정을 통 해 획득된 적어도 두 개 이상의 데이터 포인트들만을 상기 전자 장치로 송신할 수 있다. 이 경우, 상기 전자 장치는 RF 송신 시, 상기 PA의 출력 파워에 대응하는 입력 파워를 결정하기 위하여, 상기 데이터 포 인트들을 이용하여 상기 변화율에 대한 정보를 계산할 수 있다. 상기 전자 장치는 상기 계산된 변화율을 이용하여 상기 입력 파워를 결정할 수도 있다. 이와 같이, 제1 전자 장치는 설정된 모든 입력 파워에 대하여 보정을 수행하지 않을 수 있다. 상기 전자 장치 는 상기 제1 전자 장치로부터 수신한 적어도 두 개의 데이터 포인트들을 이용하여 PA의 출력 파워에 대응 하는 입력 파워를 결정할 수 있다. 전자 장치는 상기 적어도 두 개의 데이터 포인트들 사이의 변화율에 대한 정보에 따른 데이터 포인트들 간의 선형성을 이용하여 PA의 출력 파워에 대응하는 입력 파워를 결정할 수 있다. 본 발명의 다양한 실시예에 따르면, 하우징, 상기 하우징 내에 포함되거나, 상기 하우징의 일부에 의하여 형성 된 안테나, 상기 안테나와 전기적으로 연결된 전력 증폭기(power amplifier), 상기 전력 증폭기와 전기적으로 연결된 라디오 주파수(radio frequency, RF) 송신 회로, 상기 RF 송신회로 및 PA와 전기적으로 연결된 프로세서 및 상기 프로세서와 전기적으로 연결된 메모리를 포함하는 전자 장치를 제조하는 방법은, 상기 PA에 제1 입력 파워를 인가하고 상기 제1 입력 파워에 기인한 상기 PA의 제1 출력 파워를 측정하여 제1 데이터 포인트를 획득 하는 동작, 상기 PA에 제2 입력 파워를 인가하고 상기 제2 입력 파워에 기인한 상기 PA의 제2 출력 파워를 측정 하여 제2 데이터 포인트를 획득하는 동작, 상기 제1 및 제2 데이터 포인트들을 이용하여, 복수의 데이터 포인트 들을 선형적으로(linearly) 내삽하여(by interpolation) 생성하는 동작 및 상기 복수의 데이터 포인트들을 상기 메모리에 저장하는 동작을 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 및 상기 복수의 데이터 포인트들은, 상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 별로 저장될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 제1 데이터 포인트, 상기 제2 데이터 포인트 및 상기 복수의 데이터 포인트들은, 상기 PA의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 마다 설정된 복수의 PA 동작 전 압 별로 저장될 수 있다. 도 13은 다양한 실시예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP(application processor)), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈 , 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터 를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드 웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서 는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서는 도 13에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프 로세서 는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 1의 통신 모듈들과 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들 면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈 및 RF(radio frequency) 모듈를 포함할 수 있 다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하 여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈 은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다.WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜 시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또 는 안테나 등을 포함할 수 있다. 다른 실시예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈 , GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱(memory stick) 등을 더 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통 하여 전자 장치와 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지 된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(1340A), 자이로 센서 (1340B), 기압 센서(1340C), 마그네틱 센서(1340D), 가속도 센서(1340E), 그립 센서(1340F), 근접 센서 (1340G), 컬러(color) 센서(1340H)(예: RGB(red, green, blue) 센서), 생체 센서(1340I), 온/습도 센서 (1340J), 조도 센서(1340K), 또는 UV(ultra violet) 센서(1340M) 중의 적어도 하나를 포함할 수 있다. 추가적 으로 또는 대체적으로(additionally or alternatively), 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서(electroencephalogram sensor), ECG 센서 (electrocardiogram sensor), IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈 은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel),(디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정 전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널 은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이는 패널, 홀로그램 장치, 또는 프로젝터를 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패 널은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린 은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 디스플레이는패널, 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 추가적으로 또는 대체적으로(additionally and alternatively), 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure digital) 카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈(138 0)의 적어도 일부 구성요소는, 예를 들면, 입출력 인터페이스에 포함될 수 있다. 오디오 모듈은, 예를 들 면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시예에 따르면, 전력 관 리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리는, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있 고, 진동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치 는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들 면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(mediaFloTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 구성요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면,\"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로 그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구 현될 수 있다. 상기 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digitalversatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장 치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시예에 따른 모듈, 프로그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서 에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로 서, 상기 적어도 하나의 동작은, PA(power amplifier)의 특성에 기초하여 설정된 상기 PA의 복수의 파워 모드들 중 RF 신호 송신을 위하여 선택된 출력 파워에 대응하는 제1 파워 모드를 확인하는 동작, 상기 제1 파워 모드에 대응하여 저장된 적어도 두 개의 제1 데이터 포인트들에 관한 정보를 이용하여 상기 출력 파워에 대응하는 입력 파워를 결정하는 동작 및 상기 결정된 입력 파워를 상기 PA로 공급하는 동작을 포함할 수 있다. 그리고 본 문서에 개시된 실시예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 문서에서 기재 된 기술의 범위를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 문서의 기술적 사상에 근거한 모든 변 경 또는 다양한 다른 실시예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0113885", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른 전자 장치를 포함하는 네트워크 환경을 도시한다. 도 2는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 도 3은 본 발명의 다양한 실시예에 따른 전자 장치의 구조를 도시한다. 도 4는 일 비교예에 따른 PA(power amplifier)에 대한 보정 방법을 설명하기 위한 도면이다. 도 5는 본 발명의 다양한 실시예에 따른 PA의 각 파워 모드 별 입력 파워와 출력 파워의 관계를 나타내는 그래 프이다. 도 6a는 본 발명의 다양한 실시예에 따른 PA 동작 전압을 조정하는 방법을 설명하기 위한 도면이다. 도 6b는 본 발명의 다양한 실시예에 따른 각 파워 모드 및 PA 동작 전압 별 입력 파워와 출력 파워의 관계를 나 타내는 그래프이다. 도 7은 본 발명의 다양한 실시예에 따른 전자 장치의 제조 방법에 대한 흐름도이다. 도 8은 본 발명의 다양한 실시예에 따른 RF 신호 전송을 위한 전자 장치 동작 방법의 흐름도이다. 도 9는 본 발명의 다양한 실시예에 따른 전자 장치에 의한 RF 신호 전송을 위하여 PA에 파워를 공급하는 방법의 흐름도이다. 도 10은 본 발명의 다양한 실시예에 따른 전자 장치에 의한 PA 동작 전압이 조정되는 경우 입력 파워를 결정하 는 방법의 흐름도이다.도 11은 본 발명의 다양한 실시예에 따른 PA에 대한 보정 수행 방법의 흐름도이다. 도 12는 본 발명의 다양한 실시예에 따른 PA에 대한 보정 수행 방법의 흐름도이다. 도 13은 본 발명의 다양한 실시예에 따른 전자 장치의 블록도이다."}
