{"patent_id": "10-2023-0114262", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0153891", "출원번호": "10-2023-0114262", "발명의 명칭": "단말의 전력 소모 감소를 위한 학습을 수행하는 방법 및 전자 장치", "출원인": "삼성전자주식회사", "발명자": "송주환"}}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수개의 단말의 C-DRX 동작을 추론하는 전자 장치에 있어서, 송수신부(910); 및상기 전자 장치에 저장된 하나 이상의 인스트럭션들을 실행하는 적어도 하나의 프로세서(920)를 포함하고,상기 적어도 하나의 프로세서(920)는,상기 복수개의 단말의 정보 및 기지국의 정보를 획득하고, 상기 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말들 사이의 관계 벡터를 획득하고, 상기 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득하고, 상기 복수개의 단말들 각각에 대응되는 에이전트를 포함하는 제3 인공신경망 모델에 상기 단말 사이의 관계 벡터, 상기 기지국 벡터 및 상기 복수개의 단말의 정보를 입력하여, 상기 각각의 에이전트의 C-DRX 동작을 추론하도록 상기 제3 인공신경망 모델을 강화학습(reinforcement learning)하고, 상기 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 상기 제3 인공신경망 모델에 입력하여, 상기 제1 단말의 C-DRX 동작을 추론하는, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수개의 단말에 대한 정보는,CQI(channel quality indicator) 정보, SINR(signal to interference-plus-noise ratio) 정보,MCS(modulation and coding selection) 레벨 정보, 잔여 비트(remained bits) 정보 및 처리량(throughput) 정보 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 기지국의 정보는,전체 처리량(throughput) 정보 및 RLC 실패(radio link control failure) 정보 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 제1 단말의 C-DRX 동작은,C-DRX 지속 시간(on-duration time), C-DRX 주기(cycle), C-DRX 비활성 타이머(inactivity timer) 중 적어도하나의 파라미터를 이용하여 결정되는, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 제1 인공신경망 모델은,소정의 제1 시점의 상기 복수개의 단말의 정보 및 상기 제1 시점으로부터 소정의 시간 이전의 제2 시점의 복수개의 단말의 정보를 입력 받아, 각 단말의 정보를 벡터로 변환하고, 상기 변환된 벡터를 이용하여 상기 관계 벡공개특허 10-2024-0153891-3-터를 어텐션 스코어(attention score)로 연산하고, 상기 제2 인공신경망 모델은,소정의 제3 시점의 상기 기지국의 정보 및 상기 제1 시점으로부터 소정의 시간 이전의 제4 시점의 기지국의 정보를 입력받아, 각 단말의 정보를 기지국 벡터로 변환하는, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제3 인공신경망 모델은 LSTM(long short term model)을 더 포함하고상기 적어도 하나의 프로세서(920)는,상기 LSTM을 이용하여 상기 제2 시점에서 제1 에이전트의 동작에 따라, 상기 제1 시점에서 상기 제1 에이전트가선택할 수 없는 동작은 마스킹처리하여 상기 제3 인공신경망 모델을 강화학습하는, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(920)는,상기 각 에이전트의 별로 계산된 그래디언트(gradient)를 상기 복수개의 단말의 수만큼 업데이트하여 상기 제3인공신경망 모델을 강화학습하는, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,상기 제3 인공신경망 모델은 소정의 지연시간 임계값(latency threshold)을 만족시키고, 각 에이전트에 대응되는 단말의 소비 전력이 최소화되도록 학습된 것인, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(920)는,상기 제1 단말의 C-DRX 동작에 대한 적어도 하나의 마스킹 동작을 상기 제3 인공신경망에 더 입력하여 상기 제1단말의 C-DRX 동작을 추론하는, 전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,상기 제3 인공신경망 모델은, 상기 복수개의 단말과는 상이한 제2 단말의 정보가 획득되는 경우, 상기 제2 단말에 대응되는 에이전트를 생성하고, 상기 제2 단말의 정보에 대해 상기 제2 단말에 대응되는 에이전트 동작이 강화학습으로 더 학습된 것인,전자 장치."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "C-DRX 동작을 추론하는 방법에 있어서, 복수개의 단말의 정보 및 기지국의 정보를 획득하는 단계;상기 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관계 벡터를 획득하는 단계;상기 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득하는 단계;공개특허 10-2024-0153891-4-각 단말에 대응되는 에이전트를 포함하는 제3 인공신경망 모델에 상기 단말 사이의 관계 벡터, 상기 기지국 벡터 및 상기 복수개의 단말의 정보를 입력하여, 각 에이전트의 C-DRX 동작을 추론하도록 상기 제3 인공신경망 모델을 강화학습(reinforcement learning)하는 단계; 및상기 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 상기 제3 인공신경망 모델에 입력하여, 상기 제1 단말의 C-DRX 동작을 추론하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 복수개의 단말에 대한 정보는,CQI(channel quality indicator) 정보, SINR(signal to interference-plus-noise ratio) 정보,MCS(modulation and coding selection) 레벨 정보, 잔여 비트(remained bits) 정보 및 처리량(throughput) 정보 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항 또는 제12항에 있어서,상기 기지국의 정보는,전체 처리량(throughput) 정보 및 RLC 실패(radio link control failure) 정보 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항 내지 제13항 중 어느 한 항에 있어서,상기 제1 단말의 C-DRX 동작은,C-DRX 지속 시간(on-duration time), C-DRX 주기(cycle), C-DRX 비활성 타이머(inactivity timer) 중 적어도하나를 이용하여 결정되는, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항 내지 제14항 중 어느 한 항에 있어서,상기 제1 인공신경망 모델은,소정의 제1 시점의 상기 복수개의 단말의 정보 및 상기 제1 시점으로부터 소정의 시간 이전의 제2 시점의 복수개의 단말의 정보를 더 입력 받아, 각 단말의 정보를 벡터로 변환하고, 상기 변환된 벡터를 이용하여 상기 관계벡터를 어텐션 스코어(attention score)로 연산하고,상기 제2 인공신경망 모델은소정의 제3 시점의 상기 기지국의 정보 및 상기 제3 시점으로부터 소정의 시간 이전의 제4 시점의 상기 기지국의 정보를 더 입력받아, 각 단말의 정보를 기지국 벡터로 변환하는, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제3 인공신경망 모델은 LSTM(long short term model)을 더 포함하고,상기 제3 인공신경망 모델을 강화학습하는 단계는,상기 LSTM을 이용하여 상기 제2 시점에서 제1 에이전트의 동작에 따라, 상기 제1 시점에서 상기 제1 에이전트가선택할 수 없는 동작은 마스킹처리하여 상기 제3 인공신경망을 강화학습하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항 내지 제16항 중 어느 한 항에 있어서,공개특허 10-2024-0153891-5-상기 제3 인공신경망 모델을 강화학습하는 단계는, 상기 각 에이전트의 별로 계산된 그래디언트(gradient)를 상기 복수개의 단말의 수만큼 업데이트하여 상기 제3인공신경망 모델을 강화학습하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항 내지 제17항 중 어느 한 항에 있어서,상기 제3 인공신경망 모델은 소정의 지연시간 임계값(latency threshold)을 만족시키고, 각 에이전트에 대응되는 단말의 소비 전력이 최소화되도록 학습된 것인, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항 내지 제18항 중 어느 한 항에 있어서,상기 제1 단말의 C-DRX 동작을 추론하는 단계는,상기 제1 단말의 C-DRX 동작에 대한 적어도 하나의 마스킹 동작을 상기 제3 인공신경망에 더 입력하여 상기 제1단말의 C-DRX 동작을 추론하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항 내지 제19항 중 어느 한 항에 있어서,상기 제3 인공신경망 모델은, 상기 복수개의 단말과는 상이한 제2 단말의 정보가 획득되는 경우, 상기 제2 단말에 대응되는 에이전트를 생성하고, 상기 제2 단말의 정보에 대해 상기 제2 단말의 에이전트 동작이 강화학습으로 더 학습된 것인, 방법."}
{"patent_id": "10-2023-0114262", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제11항 내지 제20항 중 어느 한 항의 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2023-0114262", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 전자 장치는 송수신부; 및 전자 장치에 저장된 하나 이상의 인스트럭션들을 실행 하는 적어도 하나의 프로세서를 포함하고, 적어도 하나의 프로세서는, 복수개의 단말의 정보 및 기지국의 정보를 획득하고, 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관계 벡터를 획득하고, 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득하고, 각 단말에 대응되는 에이전트 를 포함하는 제3 인공신경망 모델에 단말 사이의 관계 벡터, 기지국 벡터 및 복수개의 단말의 정보를 입력하여 각 에이전트의 C-DRX 동작을 추론하도록 제3 인공신경망 모델을 강화학습시키고, 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 제3 인공신경망 모델에 입력하여, 제1 단말의 C-DRX 동작을 추론한다."}
{"patent_id": "10-2023-0114262", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 실시예들은 단말의 전력 소모 감소를 위한 습을 수행하는 방법 및 이에 의한 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0114262", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수(‘Sub 6GHz’) 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불리는 초고주파 대역(‘Above 6GHz’)에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part)의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다."}
{"patent_id": "10-2023-0114262", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 C-DRX 동작을 추론하는 전자 장치에 있어서, 송수신부; 및 상기 전자 장치에 저장 된 하나 이상의 인스트럭션들을 실행하는 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로 세서는, 상기 하나 이상의 인스트럭션이 실행될 때, 복수개의 단말의 정보 및 기지국의 정보를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상기 하나 이상의 인스트럭션이 실행될 때, 상기 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관계 벡터를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상기 하나 이상의 인스트럭션이 실행될 때, 상기 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지 국 벡터를 획득할 수 있다. 상기 적어도 하나의 프로세서는, 상기 하나 이상의 인스트럭션이 실행될 때, 각 단 말에 대응되는 에이전트를 포함하는 제3 인공신경망 모델에 상기 단말 사이의 관계 벡터, 상기 기지국 벡터 및 상기 복수개의 단말의 정보를 입력하여 각 에이전트의 C-DRX 동작을 추론하도록 상기 제3 인공신경망 모델을 강 화학습(reinforcement learning)시킬 수 있다. 상기 적어도 하나의 프로세서는, 상기 하나 이상의 인스트럭션이 실행될 때, 상기 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 제3 인공신경망 모델에 입력하여, 상기 제1 단말의 C-DRX 동작을 추론한다. 본 개시의 일 실시예에 따른 C-DRX 동작을 추론하는 방법은, 복수개의 단말의 정보 및 기지국의 정보를 획득하 는 단계; 상기 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관계 벡터를 획득하 는 단계; 상기 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득하는 단계; 각 단말 에 대응되는 에이전트를 포함하는 제3 인공신경망 모델에 상기 단말 사이의 관계 벡터, 상기 기지국 벡터 및 상 기 복수개의 단말의 정보를 입력하여 각 에이전트의 동작을 추론하도록 상기 제3 인공신경망 모델을 강화학습 (reinforcement learning)시키는 단계; 및 상기 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 제3 인공신 경망 모델에 입력하여, 상기 제1 단말의 C-DRX 동작을 추론하는 단계를 포함한다. 일 실시예에 따른 컴퓨터 판독 가능한 기록 매체는, 하나 이상의 프로그램 코드(code)를 포함할 수 있다. 하나 이상의 프로그램 코드는 전자 장치에서 실행될 때, 복수개의 단말의 정보 및 기지국의 정보를 획득하는 단계; 상기 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관계 벡터를 획득하는 단계; 상기 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득하는 단계; 각 단말에 대응되 는 에이전트를 포함하는 제3 인공신경망 모델에 상기 단말 사이의 관계 벡터, 상기 기지국 벡터 및 상기 복수개 의 단말의 정보를 입력하여 각 에이전트의 동작을 추론하도록 상기 제3 인공신경망 모델을 강화학습 (reinforcement learning)시키는 단계; 및 상기 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 제3 인공신 경망 모델에 입력하여, 상기 제1 단말의 C-DRX 동작을 추론하는 단계를 수행한다."}
{"patent_id": "10-2023-0114262", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서, \"a, b 또는 c 중 적어도 하나\" 표현은 \" a\", \" b\", \" c\", \"a 및 b\", \"a 및 c\", \"b 및 c\", \"a, b 및 c 모두\", 혹은 그 변형들을 지칭할 수 있다. 본 개시에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의 미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 명세서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 또한, 본 명세서에서 사용되는 '제1' 또는 '제2' 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용할 수 있지만, 상기 구성 요소들은 상기 용 어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으 로만 사용된다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소 프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해서 설 명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 또한, 각각의 도면에서 사용된 도면 부호는 각각의 도면을 설명하기 위한 것일 뿐, 상이한 도면들 각각 에서 사용된 상이한 도면 부호가 상이한 요소를 나타내기 위한 것은 아니다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 “직접적으로 연결” 또는 “물리적 으로 연결”되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 “전기적으로 연결”되어 있는 경우 도 포함한다. 본 개시에서, “송신(transmit)”, “수신(receive)” 및 “통신(communicate)” 이라는 용어들은 직접 통신 및 간접 통신을 모두 포함한다. 또한 어떤 부분이 어떤 구성요소를 “포함(include, comprise)”한다 고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포 함할 수 있는 것을 의미한다. 본 개시 전체에서, 특별히 반대되는 기재가 없는 한 “또는(or)”은 포괄적(inclusive)이며 배타적(exclusive) 이지 않다. 따라서, 명백히 달리 표시되거나 문맥상 달리 표시되지 않는 한, “A 또는 B”는 “A, B, 또는 둘 모두”를 나타낼 수 있다. 본 개시에서, “~중 적어도 하나” 또는 “하나 이상의 ~”라는 문구는, 열거된 항목 들 중 하나 이상의 항목들의 서로 다른 조합이 사용될 수도 있고, 열거된 항목들 중 임의의 하나의 항목만이 필 요한 경우를 의미할 수도 있다. 예를 들어, “A, B, 및 C 중 적어도 하나”는 다음의 조합들 중 임의의 것을 포 함할 수 있다: A, B, C, A 및 B, A 및 C, B 및 C, 또는 A 및 B 및 C. “제어기(controller, 컨트롤러)”는 적어도 하나의 동작을 제어하는 임의의 디바이스, 시스템 또는 그 부분을 나타낼 수 있다. 제어기는 하드웨어, 하드웨어 및 소프트웨어의 조합, 또는 펌웨어로 구현될 수 있다. 특정 제 어기에 연관된 기능은, 국부적 또는 원격의 집중형 또는 분산형일 수 있다. 또한, 컴퓨터 판독 가능한 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘ 비일시적 저장 매체’는 실재(tangible)하는 장치이고, 일시적인 전기적 또는 다른 신호들을 전송하는 유선, 무 선, 광학적, 또는 다른 통신 링크들을 배제할 수 있다. 한편, 이 ‘비일시적 저장 매체’는 데이터가 저장 매체 에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 예를 들어, ‘비일시적 저장 매체’는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 컴퓨터 판독 가능한 매체는 컴퓨터에 의해 액 세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함 할 수 있다. 컴퓨터 판독 가능한 매체는, 데이터가 영구적으로 저장될 수 있는 매체와 데이터가 저장되고 나중 에 덮어쓰기 될 수 있는 매체, 이를테면 재기입 가능한 광 디스크 또는 소거 가능한 메모리 디바이스를 포함한 다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예를 들어, compact disc read only memory (CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예를 들어, 플레이 스토어TM)를 통해 또는 두 개의 사용 자 장치들(예를 들어, 스마트폰) 간에 직접, 온라인으로 배포(예를 들어, 다운로드 또는 업로드)될 수 있다. 온 라인 배포의 경우에, 컴퓨터 프로그램 제품(예를 들어, 다운로더블 앱(downloadable app))의 적어도 일부는 제 조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다."}
{"patent_id": "10-2023-0114262", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기타 특정 단어들 및 문구들에 대한 정의는 본 개시의 전체에 걸쳐 제공될 수 있다. 본 개시가 속하는 기술분야 의 통상의 지식을 가진 자는, 다양한 경우들에서, 정의된 단어들 및 문구들이 과거 및 장래의 사용들에도 적용 될 수 있음을 이해할 수 있을 것이다. 본 명세서에서 후술하는 각 구성 요소는 자신의 주요 기능 외에 다른 구성 요소가 수행하는 기능의 일부 또는 전부를 추가적으로 수행할 수 있으며, 각 구성 요소의 주요 기능 중 일부는 전적으로 다른 구성 요소에 의해 수 행될 수 있다. 설명의 편의를 위하여, 본 개시에서는 3GPP NR(New Radio: 5세대 이동통신 표준) 규격에서 정의하고 있는 용어 및 명칭들을 사용할 수 있다. 하지만, 본 개시가 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격 에 따르는 시스템에도 동일하게 적용될 수 있다. 또한 단말이라는 용어는 핸드폰, 스마트폰, IoT 기기들, 센서 들뿐만 아니라 또 다른 무선 통신 기기들을 나타낼 수 있다. 기지국은 단말의 자원할당을 수행하는 주체로서, gNode B, gNB, eNode B, eNB, Node B, BS (Base Station), 무 선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말은 UE (User Equipment), MS (Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기능을 수행할 수 있는 멀티미디어시 스템을 포함할 수 있다. 이하 설명에서 사용되는 신호를 지칭하는 용어, 채널을 지칭하는 용어, 제어 정보를 지칭하는 용어, 네트워크 객체(network entity)들을 지칭하는 용어, 장치의 구성 요소를 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시에서 사용되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 이하 설명에서, 물리 채널(physical channel)과 신호(signal)는 데이터 혹은 제어 신호와 혼용하여 사용될 수 있다. 예를 들어, PDCCH(physical downlink control channel)는 데이터가 전송되는 물리 채널을 지칭하는 용어 이지만, PDCCH는 데이터를 지칭하기 위해서도 사용될 수 있다. 즉, 본 개시에서, '물리 채널을 송신한다'는 표 현은 '물리 채널을 통해 데이터 또는 신호를 송신한다'는 표현과 동등하게 해석될 수 있다. 이하 본 개시에서, 상위 시그널링은 기지국에서 물리 계층의 하향링크 데이터 채널을 이용하여 단말로, 또는 단 말에서 물리 계층의 상향링크 데이터 채널을 이용하여 기지국으로 전달되는 신호 전달 방법을 뜻한다. 상위 시 그널링은 RRC(radio resource control) 시그널링 또는 MAC(media access control) 제어 요소(control element, CE)로 이해될 수 있다. 본 개시에서, 인공신경망(artificial neural network, ANN)은 인간이 뇌를 통해 문제를 처리하는 방법과 비슷한 방법으로 문제를 해결하기 위해 컴퓨터에서 채택하고 있는 구조를 의미할 수 있다. 인공 신경망은 간략히 신경 망(neural network)으로 표현될 수 있다. 또한, 인공 신경망은 시냅스의 결합으로 네트워크를 형성한 인공 뉴런 이, 학습을 통해 시냅스의 결합 세기를 변화시켜 문제 해결 능력을 가지는 모델 전반을 가리킬 수 있다. 본 개시에서, 인공신경망 모델은 특정 목적을 위해 생성(학습)된 신경망으로, 목표로 하는 동작(특정 목적을 달 성하기 위한 동작)을 수행하도록 생성(학습)된 신경망을 의미할 수 있다. 또한, 본 개시에서 용어 인공신경망 모델은 신경망 모델 또는 인공지능 모델(AI model)로 대체되어 사용될 수 있다. 본 개시에서, 특징(feature)은 인공신공망 모델이 신경망 모델이 추론(inference)을 수행하기 위해 입력 데이터 로부터 추출하는 것을 의미할 수 있다. 또한, 본 개시에서 용어 특징은 특징 값, 특징 벡터로 대체되어 사용될 수 있다. 본 개시에서, 강화학습(reinforcement learning)은 주어진 환경에서 최대한 많은 보상을 받도록 인공신경망 모 델을 학습시키는 방법을 의미할 수 있다. 보다 구체적으로, 강화학습은 에이전트가 주어진 환경 및/또는 상태에 서 어떤 동작 또는 행동(action)을 수행했을 때, 어떤 보상(reward)를 얻는지를 경험한 결과에 기초하여, 가장 큰 보상을 얻을 수 있도록 행동하기 위한 정책을 마련하는 학습방법을 의미할 수 있다. 본 개시에서, 신경망 모델 또는 파라미터의 업데이트(update)는 신경망 모델이 새롭게 학습되는 경우, 신경망 모델 또는 파라미터를 업데이트한다고 표현할 수 있다. 본 개시에서, 추론(inference)은 학습된 신경 모델이 입력 데이터에 따라 결과 값을 출력하는 동작을 의미할 수 있다. 또한, 본 개시에서 추론은 용어 예측(prediction)과 대체되어 사용될 수 있다. 도 1은 일 실시예에 따른 무선 통신 시스템을 나타낸다. 도 1을 참조하면, 일 실시예에 따른 무선 통신 시스템은 기지국 및 복수의 단말(110,...,130)을 포함할 수 있다. 도 1에서는 하나의 기지국만을 도시하지만 무선 통신 시스템은 기지국과 동일 또는 유사한 다 른 기지국을 더 포함할 수 있다. 일 실시예에 따른 기지국은 복수의 단말(110, ... ,130)과 데이터를 송수신할 수 있다. 기지국은 복 수의 단말(110,...,130)에 대해 자원할당을 수행하며, 무선 접속을 제공할 수 있다. 또한, 기지국은 신호 를 송신할 수 있는 거리에 기초하여, 일정한 지리적 영역으로 정의되는 커버리지(coverage)를 가질 수 있다. 일 실시예에 따른 복수의 단말(110,...,130) 각각은 사용자에 의해 사용되는 장치로써, 기지국과 무선 채 널을 통해 통신을 수행한다. 여기서, 하향링크(downlink, DL)는 기지국에서 복수의 단말(110,...,130)로 향하는 링크를 의미할 수 있고, 상향링크(uplink, UL)는 복수의 단말(110,...,130)에서 기지국으로 향하는 링크를 의미할 수 있다. 복수의 단말(110,...,130) 중 적어도 하나의 단말은 독립적으로, 예를 들어 사용자의 관여 없이 운영될 수 있다. 예를 들어, 복수의 단말(110,...,130) 중 적어도 하나는 기계 타입 통신(machine type communication, MTC)을 수행하는 장치로써, 사용자에 의해 휴대 되지 않을 수도 있다. 복수의 단말(110,...,130) 각각은 단말 (terminal) 외 '사용자 장비(user equipment, UE)', '이동국(mobile station)', '가입자국(subscriber station)', '원격 단말(remote terminal)', '무선 단말(wireless terminal)', 또는 '사용자 장치(user device)' 또는 이와 동등한 기술적 의미를 가지는 다른 용어로 지칭될 수 있다. 일 실시예에 따른 기지국, 복수의 단말(110,...,130)은 밀리미터 파(mmWave) 대역(예: 28GHz, 30GHz, 38GHz, 60GHz)에서 무선 신호를 송신 및 수신할 수 있다. 이때, 채널 이득의 향상을 위해, 일 실시예에 따른 기 지국, 복수의 단말(110,...,130)은 빔포밍(beamforming)을 수행할 수 있다. 여기서, 빔포밍은 송신 빔포밍 및 수신 빔포밍을 포함할 수 있다. 복수의 단말(110,...,130)이 기지국과 무선 통신을 수행함에 따라, 다수의 데이터 트래픽이 발생할 수 있 다. 이에 따라, 복수의 단말(100,..,130) 각각은 활성 상태에서 무선 통신을 수행하면 전력을 소모한다. 따라서, 무선 통신에서의 데이터 트래픽이 증가되는 5G 또는 6G 환경에서는 단말에서의 전력 소모를 감소시키는 방법이 필요하다. 이하에서는 설명의 편의를 위해, C-DRX(connected discontinuous reception)가 적용되는 하나의 단말을 기준으로 C-DRX를 설명하지만, 복수의 단말(110,...,130) 각각에서 C-DRX가 적용될 수 있으며, C-DRX의 적용 방 법은 각 단말 마다 상이할 수 있다. C-DRX는 기지국과 단말 간에 무선링크가 설정되어 있는 RRC 연결(RRC Connected) 상태에서, 단말 이 기지국으로부터 데이터를 비연속적으로 수신하는 동작이다. 일 실시예에서, C-DRX가 적용되는 경 우, 단말은 특정 시점에서 수신기를 온(on)하여 제어 채널(control channel)을 모니터링하고, 일정 기간 동안 수신되는 데이터가 없으면 수신기를 오프(off)하여 단말의 전력 소모를 줄일 수 있다. C-DRX 동작은 다양한 파라미터 및 타이머에 기초하여 MAC 계층(media access control layer)에 의해 제어될 수 있다. 일 실시예에서, MAC 계층은 논리 채널과 전송 채널 간의 맵핑 기능, 스케쥴링 정보 보고 기능, HARQ를 통한 에 러 정정 기능, 다이나믹 스케쥴링을 통한 단말간 우선 순위를 조절하는 기능, 전송 포맷을 선택하는 기능, 또는 패딩(padding) 기능 들 중 적어도 하나의 기능을 수행할 수 있다. 일 실시예에서, C-DRX가 단말에 적용된 경우, 단말은 특정 시간 동안 기지국으로부터 전송 받을 데이터가 없다고 판단하면, 단말의 상태를 대기 상태로 전환할 수 있다. 또한, 단말은 소정의 간격인 DRX 주기 동안 대기 상태를 유지할 수 있다. DRX 주기 동안 기지국은 단 말에게 데이터를 전송하지 않을 수 있고, 이에 따라 단말은 DRX 주기 동안 전력을 소모하지 않을 수 있다. 따라서, C-DRX 기술을 적용하여, 단말은 전력 소모를 감소시킬 수 있다. C-DRX 적용을 위해, 단말은 기지국으로부터 C-DRX 파라미터를 수신 받거나, 단말이 직접 C-DRX 파라미터를 결정할 수 있다. 여기서, C-DRX 파라미터는 C-DRX를 단말에 적용하기 위한 설정 파라미터를 포함할 수 있다. 일 실시예에서, C-DRX 파라미터는 onDurationTimer, drx-RetransmissionTimerUL, drx-InactivityTimer, drx- RetransmissionTimer, longDRX-CycleStartOffset, shortDRX-Cycle, drxShortCycleTimer, 또는 drx- RetransmissionTimerDL 중 적어도 하나를 포함할 수 있다. C-DRX의 파라미터 명칭은 상술한 예시에 한정되는 것 은 아니며, 파라미터의 기능에 대응되는 다양한 명칭이 이용될 수 있다. 일 실시예에서, drx-RetransmissionTimerDL는 하향링크 HARQ 절차에서 하향링크 재전송을 수신하기 위하여 단말 이 깨어있는 최대 시간을 설정하기 위한 파라미터일 수 있다. 일 실시예에서, drx-RetransmissionTimerUL는 상향링크 HARQ 절차에서 상향링크 재전송 승인(grant)을 수신하 기 위하여 단말이 깨어있는 최대 시간을 설정하기 위한 파라미터를 의미할 수 있다. 예를 들어, drx-onDurationTimer, drx-InactivityTimer, drx-RetransmissionTimerDL 및 drx- RetransmissionTimerUL는 시간, 서브프레임(subframe) 개수, 및 슬롯 개수 중 적어도 하나로 설정될 수 있다. ra-ContentionResolutionTimer는 랜덤 액세스 절차에서 PDCCH(physical downlink channel)를 모니터링 위한 파 라미터를 의미할 수 있다. 도 2는 일 실시예에 따른 단말의 전력 소모 감소를 위한 C-DRX 파라미터 및 시간에 따른 단말의 동작을 나타낸 다. 도 2의 x축은 시간을 나타내고, y축은 단말이 소모하는 전력을 나타낼 수 있다. 도 2를 참조하면, 일 실시예에 따른 단말은 C-DRX 주기 마다 단말을 대기상태에서, 단말이 다시 데이터를 전송하는 활성 상태로 전환할 수 있다. C-DRX 주기는 단말이 대기상태에서 깨어나서 PDCCH를 모니터링 하는 주기를 의미할 수 있다. 예를 들 어, 단말이 PDCCH를 모니터링 한 후, 다음 PDCCH를 모니터링 하기까지의 시간 간격 또는 온 듀레이션(on duration)의 발생 주기를 의미할 수 있다. 일 실시예에 따른, C-DRX 주기는 short DRX 주기와 long DRX 주기의 2 종류의 주기를 포함할 수 있다. 이 때, Short DRX 주기는 선택적(option)으로 적용될 수 있다. 여기서 C-DRX 주기는 onDurationTimer와 동일한 기능을 수행하는 파라미터일 수 있다. 일 실시예에 따른 C-DRX의 지속시간(on-durationTime, 230)는 C-DRX 주기내에서, 단말이 활성 상태 에 있는 최소 시간을 설정하기 위한 파라미터일 수 있다. 예를 들어, 단말이 C-DRX 주기에 도달하여, 데이터를 전송하기 시작한 시간 이후로 C-DRX의 지속시간 동안 단말은 데이터를 기지국에 전송 할 수 있다. 일 실시예에서, 단말은 C-DRX 지속시간 동안 데이터를 기지국에 전송하고, C-DRX 지속시간 이후에는 데이터를 전송하지 않는 대기상태로 진입할 수 있다. 여기서, C-DRX 지속시간은 drx-ondurationTimer와 동일한 기능을 하는 파라미터일 수 있다. 일 실시예에서, 단말이 새로운 상향링크 전송 또는 하향링크 전송을 지시하는 PDCCH를 수신하는 경우, C- DRX 비활성 타이머(inactivity timer, 250)는 단말이 추가적으로 활성 상태에 있는 시간을 설정하기 위한 파라미터를 의미할 수 있다. 따라서, 단말은 C-DRX 주기에서 C-DRX 지속시간 이후 C-DRX의 비활 성 타이머 동안 데이터를 전송하지 않더라도 활성 상태를 유지할 수 있다. 따라서, C-DRX 지속시간 및 C-DRX의 비활성 타이머는 C-DRX 주기보다 길게 설정될 수 없다. 비활성 시간(inactive time)은 단말이 C-DRX 동작 중 PDCCH를 모니터링하지 않도록 설정되는 시간 또는 PDCCH를 수신하지 않도록 설정되는 시간을 의미할 수 있다. C-DRX 동작을 수행하는 전체 시간에서 활성 시간 (active time)을 제외한 나머지 시간이 비활성 시간이 될 수 있다. 일 실시예에 따른 단말은, 활성 시간 동안 PDCCH를 모니터링하지 않으면, 슬립(sleep) 또는 비활성 상태로 진입하여 전력 소모를 줄일 수 있다. 일 실시예에 따른 단말은 C-DRX 주기, C-DRX 지속시간 및 C-DRX의 비활성 타이머 중 적어 도 하나의 파라미터를 이용하여 C-DRX 동작을 결정하고, 결정된 C-DRX 동작을 수행할 수 있다. 또한, C-DRX 동 작을 수행함으로써, 단말은 전력 소모를 감소시킬 수 있다. 일 실시예에서, C-DRX 동작을 위한 적어도 하나의 파라미터는 인공신경망을 이용하여 단말의 트래픽을 예 측함으로써 동적으로 조절될 수 있다. 따라서, 인공신경망을 이용한 C-DRX 동작을 결정하는 방법은 기지국(10 0)과의 연결을 유지하면서 단말의 전력 소모를 최소화할 수 있다. 일 실시예에서, 인공신경망을 이용한 C-DRX 동작 결정 방법에서, 하나의 단말 뿐 아니라, 기지국에 연결된 복수의 단말(110,...,130) 각각의 상호작용 및 기지국의 스케쥴링 정보가 고려될 수 있다. 이하에서는, 일 실시예에 따른 전자 장치가, 복수의 단말(110,...,130) 사이의 관계 정보와 기지국 정보를 수신하고, 수신된 입력으로 하여, 인공신경망을 강화 학습시키는 방법을 설명한다. 도 3은 일 실시예에 따른 글로벌 네트워크의 인공신경망 모델을 나타내는 블록도이다. 도 3을 참조하면, 일 실시예에서, 전자 장치는 글로벌 네트워크(global network, 300)를 포함할 수 있다. 또한, 일 실시예에 따른 글로벌 네트워크는 제1 인공신경망 모델(제1 AI 모델, 310), 제2 인공신경망 모델(제2AI 모델, 330) 및 제3 인공신경망 모델(제3 AI 모델, 350)을 포함할 수 있다. 도 3에서는 설명의 편의를 위해, 전자 장치에 제1 인공신경망 모델, 제2 인공신경망 모델 및 제3 인공신경망 모델을 포함하는 것으로 도시하였지만 이에 한정되지 않는다. 예를 들어, 전자 장치는 추가 환경 정보를 입력 받아 학습되는 제4 인공신경망 모델을 더 포함할 수 있다. 또한, 도 3에서는 설명의 편의를 위해 제1 인공신경망 모델, 제2 인공신경망 모델 및 제3 인공신경망 모델이 별개의 인공신경망 모델로 동작하는 것으로 나타나 있지만, 하나의 글로벌 네트워크 내에서 각 구성의 일부가 결합되어 동작할 수도 있다. 일 실시예에서, 제1 인공신경망 모델과 제2 인공신경망 모델은 각 입력 정보에 기초하여 동일한 크기 의 벡터인 인코딩 특징을 출력할 수 있다. 이를 위해, 제1 인공신경망 모델과 제2 인공신경망 모델은 서로 동일한 구조를 가질 수도 있고, 서로 상이한 구조를 가질 수도 있다. 일 실시예서, 글로벌 네트워크는 제1 단말 정보 내지 제k 단말 정보 및 기지국 정보를 입력 받아, 각 단말 에 대응되는 복수의 에이전트의 동작 또는 행동을 강화 학습시켜 에이전트에 대한 확률 분포(p(x))를 출력할 수 있다. 일 실시예에 따른 제1 단말 정보 내지 제k 단말 정보는 각 단말에 대한 채널 정보 및 트래픽 정보 중 적어도 하 나를 포함할 수 있다. 예를 들어, 제1 단말 정보 내지 제k 단말 정보는 CQI(channel quality indicator) 정보, SINR(signal to interference-plus-noise ratio) 정보, MCS(modulation and coding selection) 레벨 정보, 잔 여 비트(remained bits) 정보 및 처리량(throughput) 정보 중 적어도 하나를 포함할 수 있다. 일 실시예에 따른 제1 단말 정보 내지 제k 단말 정보는, 단말의 전력 소모를 감소시키기 위해, 각 단말이 C-DRX 동작을 수행하기 위한 C-DRX 파라미터를 결정하기 위한 정보를 포함할 수 있다. 또한, 일 실시예에 따른 제1 단말 정보 내지 제k 단말 정보는 소정의 제1 시점에서 수집된 각 단말의 정보를 포 함할 수 있고, 제1 시점으로부터 소정의 시간이 지난 이후에 수집된 각 단말의 정보를 더 포함할 수 있다. 여기서, 일 실시예에 따른 기지국 정보는 전체 처리량(total throughput) 정보, RLC(radio link control) 실패 정보 중 적어도 하나를 포함할 수 있다. 글로벌 네트워크는 제1 단말 정보 내지 제k 단말 정보를 입력 받아 단말 간의 관계를 나타내는 특징을 추 출하고, 추출된 단말 간의 관계 특징을, 에이전트의 동작을 학습하기 위한 환경으로 이용할 수 있다. 또한, 글 로벌 네트워크는 기지국 정보를 입력 받아 기지국의 특징을 추출하고, 단말 간의 관계 특징과 결합하 여 결합된 특징을, 에이전트의 동작을 학습하기 위한 환경으로 이용할 수 있다. 일 실시예에 따른 각각의 에이전트들은, 각 단말의 정보를 추가 입력으로 하여, 손실 함수(lose function)를 기 반으로 그래디언트(gradient)를 각각 연산할 수 있다. 또한, 글로벌 네트워크는 연산된 그래디언트를 이용 하여 전체 인공신경망을 업데이트할 수 있다. 일 실시예에서, 글로벌 네트워크는 에이전트의 수, 예를 들 어 단말의 개수(k) 만큼 업데이트될 수 있다. 일 실시예에 따른, 제1 인공신경망 모델 및 제2 인공신경망 모델은 전체 글로벌 네트워크에서 인코더로 동작할 수 있고, 제3 인공신경망 모델은 전체 글로벌 네트워크에서 디코더로 동작할 수 있 다. [표 1]은 일 실시예에 따른 글로벌 네트워크가 멀티 에이전트를 이용하여 강화학습되는 알고리즘을 나타내 는 의사 코드(pseudocode)이다.표 1 Require: require. if training then Start environment simulator, generating arrival traffic and the status of the RBs; Initialize the agent policy corresponding to each UE k and the policy for global agent; Initialize the trajectory buffer for each agent k; for each episode do while not done do Extract state and reward for each UE k from the simulator; for each agent k do Select an action using for each UE k; Store trajectory (, , ) in trajectory buffer ; end for if size of is horizon then Observe the next state ; Evaluate for each agent k; Gradient update from each agent k to global agent ; Clear the trajectory buffer for each agent k; end if t=t+1; end while end for Save the policy and value function parameters; else Load the policy for each UE k; Based on the observed state, output the action; end if=0 일 실시예에 따른 글로벌 네트워크는 기지국에 포함된 전자 장치에 포함될 수 있고, 기지국과 상이한 별도의 전자 장치에 포함될 수도 있다. 도 4는 일 실시예에 따른 단말 사이의 정보를 인코딩하는 인공신경망을 나타내는 블록도이다. 도 4를 참조하면, 제1 인공신경망 모델은 인코더 모듈 및 트랜스포머 모듈을 포함할 수 있다. 다만, 도 4는 예시적인 것에 불과하여 이에 한정되지 않는다. 예를 들어, 제1 인공신경망 모델은 인코더 모듈만을 포함하거나, 인코더 모듈에 추가적인 신경망을 포함할 수 있다. 일 실시예에 따른 제1 인공신경망 모델이 인코더 모듈만을 포함하는 경우, 제1 단말 정보 내지 제k 단말 정보를 입력받아, 입력 받은 각 단말 정보를 저차원 특징 벡터로 변환하고, 변환된 벡터를 결합하여 제1 인코딩 특징(encoding feature)을 출력할 수 있다. 일 실시예에 따른 인코더 모듈은 제1 단말 정보 내지 제k 단말 정보를 입력받을 수 있고, 인코더 모 듈은 입력 받은 제1 단말 정보 내지 제k 단말 정보를 이용하여 LSTM(long short term model) 임베딩을 수행할 수 있다. 인코더 모듈이 수행하는 LSTM 임베딩은 예시적인 것이며, 임베딩을 수행하는 방법은 이에 제한되 지 않는다. 예를 들어, 인코더 모듈은 순환 신경망(RNN) 임베딩 또는 합성곱 신경망(CNN) 임베딩을 수행할 수 있다. 다시 말해, 일 실시예에 따른 인코더 모듈은 입력 정보를 기초로 저차원 벡터로 변환하는 임베딩 을 수행할 수 있다. 여기서, LSTM은 순환 신경망(RNN)의 한 종류로서, 주로 순차적인 데이터, 시계열 데이터, 자연어 처리 등에서 장기 의존 관계를 모델링하는 데 이용되는 인공신경망을 의미할 수 있다. 또한, LSTM 임베딩은 LSTM 네트워크의 입력된 데이터를 저차원의 벡터로 표현하는 작업을 의미할 수 있다. 따라서, 일 실시예에 따른 인코더 모듈은 순차적 입력데이터인 소정의 시간 별 제1 단말 정보 내지 제k 단 말 정보를 입력받아, 각 단말 정보를 저차원 특징 벡터로 표현할 수 있다. 예를 들어, 인코더 모듈은 시각 t1에서 제1 단말 정보, 시각 t2에서 제1 단말 정보, 시각 t3에서 제1 단말 정보를 입력 받아 제1 단말의 과거 정보를 압축하여 하나의 제1 단말 벡터로 표현할 수 있다. 마찬 가지로, 인 코더 모듈은 제2 단말에 대해서도 시각 t1에서 제2 단말 정보, 시각 t2에서 제2 단말 정보, 시각 t3에서 제 2 단말 정보를 입력 받아 제2 단말의 과거 정보를 압축하여 하나의 제2 단말 벡터로 표현할 수 있다. 일 실시예에 따른 인코더 모듈은 소정의 시간 별 제1 단말 정보 내지 제k 단말 정보를 입력 받아, 제1 단 말 벡터를 내지 제k 단말 벡터를 출력할 수 있기 때문에, 각 단말 벡터에는 각 단말의 시간 정보도 압축되어 포 함될 수 있다. 일 실시예에 따른 제1 인공신경망 모델은 LSTM 임베딩을 수행하는 인코더를 포함하는 경우, 각 단말 의 시간 관계에 따른 단말 정보도 글로벌 네트워크의 강화학습에 이용될 수 있다. 이에 따라, 일 실시예에 따른 글로벌 네트워크는 시간에 따라, 정확한 단말의 C-DRX 동작을 추론할 수 있다. 일 실시예에서, 트랜스포머(transformer, 313) 모듈은 제1 단말 벡터를 내지 제k 단말 벡터를 입력받아, 각 단 말 사이의 관계 벡터인 제1 인코딩 특징을 출력할 수 있다. 여기서, 트랜스포머는 인공신경망의 일종으로, 셀프 어텐션(self-attention) 매커니즘을 이용하여 각 입력 시퀀 스 내의 각 토큰 간의 관계를 고려하여, 상대적인 중요도를 연산할 수 있다. 토큰은 텍스트나 시퀀스 데이터를 작은 단위로 분할한 요소를 의미할 수 있다. 일 실시예에서, 트랜스포머 모듈은 셀프 어텐션 매커니즘을 이용하여, 단말 사이의 관계 또는 영향도를 연 산할 수 있고, 트랜스포머 모듈은 연산된 단말 사이의 관계 또는 영향도로 제1 인코딩 특징을 추출할 수 있다. 일 실시예에서, 제1 인공신경망 모델은 트랜스포머를 포함하는 경우, 각 단 말 사이의 관계 정보도 글로벌 네트워크의 강화학습에 이용될 수 있다. 이에 따라, 일 실시예에 따른 글로벌 네트워크는 단 말 사이의 관계성에 따라, 정확한 단말의 C-DRX 동작을 추론할 수 있는 효과를 포함하는 다양한 효과를 달성할 수 있다. 도 5는 일 실시예에 따른 기지국 정보를 인코딩하는 인공신경망을 나타내는 블록도이다. 도 5를 참조하면, 제2 인공신경망 모델은 인코더 모듈 및 트랜스포머 모듈을 포함할 수 있다. 다만, 도 5는 예시적인 것에 불과하여 이에 한정되지 않는다. 예를 들어, 제2 인공신경망 모델은 인코더 모듈만을 포함하거나, 인코더 모듈에 추가적인 신경망을 포함할 수 있다. 일 실시예에서, 제2 인공신경망 모델이 인코더 모듈만을 포함하는 경우, 기지국 정보를 입력받아, 입 력 받은 기지국 정보를 저차원 특징 벡터로 변환하여 제2 인코딩 특징(encoding feature)을 출력할 수 있다. 일 실시예에서, 인코더 모듈은 기지국 정보를 입력받을 수 있고, 인코더 모듈은 입력 받은 기지국 정 보를 이용하여 LSTM임베딩을 수행할 수 있다. 인코더 모듈이 수행하는 LSTM 임베딩은 예시적인 것이며, 임 베딩을 수행하는 방법은 이에 제한되지 않는다. 예를 들어, 인코더 모듈은 순환 신경망(RNN) 임베딩 또는 합성곱 신경망(CNN) 임베딩을 수행할 수 있다. 일 실시예에 따른 인코더 모듈은 입력 정보를 기초로 저차 원 벡터로 변환하는 임베딩을 수행할 수 있다. 일 실시예에 따른 인코더 모듈은 순차적 입력데이터인 소정의 시간 별 기지국 정보를 입력받아, 각 기지국 정보를 저차원 특징 벡터로 표현할 수 있다. 예를 들어, 인코더 모듈은 시각 t1에서 기지국 정보, 시각 t2에서 기지국 정보, 시각 t3에서 기지국 정보를 입력 받아 기지국의 과거 정보를 압축하여 하나의 기지국 벡터로 표현할 수 있다. 일 실시예에서, 인코더 모듈은 소정의 시간 별 기지국 정보를 입력 받아, 기지국 벡터를 출력할 수 있기 때문에, 기지국 벡터에는 각 시간별 기지국의 정보도 압축되어 포함될 수 있다. 일 실시예에서, 트랜스포머 모듈은 기지국 벡터를 입력받아, 제2 인코딩 특징을 출력할 수 있다. 트랜스포 머 모듈은 기지국 벡터에 대해 중요 시간에 따른 영향도를 연산할 수 있고, 트랜스포머 모듈은 연산 된 시간에 따른 영향도로 제2 인코딩 특징을 추출할 수 있다. 도 6은 일 실시예에 따른 인공신경망을 강화학습하는 동작을 나타내는 블록도이다. 도 6을 참조하면, 제3 인공신경망 모델은 LSTM 모듈, masking 모듈을 포함할 수 있다. 일 실시 예에 따른 제3 인공신경망 모델은 제1 인공신경망 모델 및 제2 인공신경망 모델로부터 제1 인코 딩 특징 및 제2 인코딩 특징을 획득하고, 제1 인코딩 특징, 제2 인코딩 특징 및 제1 단말 정보를 이용하여 제1 단말에 대응되는 제1 에이전트의 C-DRX 동작에 대한 확률 분포(p(x))를 출력할 수 있다. 다만, 도 6은 예시적인 것에 불과하며 이에 제한되지 않는다. 예를 들어, 제3 인공신경망 모델은 masking 모듈을 포함하지 않고, LSTM 모듈만을 포함할 수 있다. 일 실시예에 따른 제1 단말 정보는 도 4의 인코더 모듈과 동일하거나 유사한 모듈을 이용하여, 인코딩된 특징의 형태로 제3 인공신경망 모델에 입력될 수 있다. 일 실시예에 따른 LSTM 모듈은 LSTM 디코더를 포함할 수 있다. 예를 들어, LSTM 모듈은 도 3 및 도 4 의 인코더 모듈에서 LSTM 임베딩이 수행된 경우, 제1 인코딩 특징, 제2 인코딩 특징을 LSTM 디코더에 입력하여, 현재 단말의 정보 및 과거 C-DRX 동작 정보를 고려하여 학습이 진행될 수 있다. 이때, 일 실시예에 따른 LSTM 모듈은 masking 모듈과 연결되어, 제1 에이전트의 C-DRX 동작에 대한 확률 값을 출력할 수 있다. 여기서, masking 모듈는 이전 단말의 C-DRX 동작에 따라, 현재 선택할 수 없는 동작은 마스킹 처리할 수 있다. 일 실시예에 따른 제3 인공신경망 모델은 강화학습을 위하여, 보상 함수를 포함할 수 있다. 예를 들어, 제 3 인공신경망 모델은 소정의 지연시간 임계값(latency threshold)을 만족시키고, 제1 에이전트에 대응되는 단말의 소비 전력이 최소화되도록 제1 에이전트의 동작을 학습시키는 보상 함수를 포함할 수 있다. 이에 따라, 제1 에이전트는 단말의 소비 전력이 최소화되면서도 마스킹된 제한 조건은 수행하지 않도록 학습된 C-DRX 동작을 출력할 수 있다. 일 실시예에서, 상술한 방법과 같은 방법으로, 제3 인공신경망 모델에는 k개의 단말에 대응되는 k개의 에 이전트가 존재하고, 제3 인공신경망 모델은 각 에이전트에 대응되는 단말의 정보, 제1 인코딩 특징 및 제2 인코딩 특징을 이용하여 각 에이전트의 C-DRX 동작에 대한 확률분포를 출력할 수 있다. 또한, 일 실시예에 따른 제3 인공신경망 모델은 각 에이전트를 통해 계산된 손실 함수를 이용하여 그래디 언트를 연산하고, 그래디언트 업데이트를 수행할 수 있다. 예를 들어, k개의 단말이 존재하는 경우 k개의 에이 전트가 존재할 수 있고, 제3 인공신경망 모델은 k번 업데이트가 수행될 수 있다. 여기서, 일 실시예에 따른 각 에이전트가 제3 인공신경망 모델을 업데이트 하는 방법은 비동기적 (asynchronous)으로 이루어 질 수 있다. 이에 따라, 제3 인공신경망 모델은 각 단말이 처한 다양한 환경 정보를 그래디언트 업데이트를 통해 빠른 시간 안에 학습할 수 있는 효과를 포함하는 다양한 효과가 있을 수 있 다. 일 실시예에 따른 글로벌 네트워크는 복수의 단말(110,...,130)과는 상이한 제3 단말의 정보가 획득되는 경우, 제3 단말에 대응되는 에이전트를 생성하고, 상기 제3 단말의 정보에 대해 상기 제3 단말에 대응되는 에어 전트 동작이 강화학습으로 더 학습될 수 있다. 글로벌 네트워크에 제3 단말 정보가 더 획득되는 경우, 즉, 기지국의 커버리지에 새로운 트래픽을 가 진 제3 단말이 기지국와 무선통신을 수행하는 경우에는 제3 단말의 정보를 더 이용하여, 글로벌 네트워크 가 학습될 수 있다.도 7은 일 실시예에 따른 단말의 동작을 추론하는 동작을 나타낸다. 도 7을 참조하면, 추론 모듈은 학습이 완료된 글로벌 네트워크 및 제1 단말 정보를 이용하여, 제1 단 말의 C-DRX 동작(action)을 출력할 수 있다. 일 실시예에 따른 추론 모듈은 강화학습을 수행하는 전자 장 치 또는 기지국 에 포함될 수 있고, 복수의 단말(110,...,130) 각각에 포함될 수 있다. 도 7에서는 설명의 편의를 위해 추론 모듈이 제1 단말의 C-DRX 동작을 추론하는 것으로 설명하지만, 이에 제한되지 않는다. 예를 들어, 추론 모듈은 제2 단말 정보를 입력 받아, 제2 단말의 C-DRX 동작을 추론할 수 있다. 일 실시예에 따른 추론 모듈은 각 에이전트에 의해 학습이 완료된 글로벌 네트워크가 복제된 (duplicated) 구성을 가질 수 있다. 이에 따라, 추론 모듈은 모든 단말의 상황, 기지국의 상황 및 단말 간 의 관계성이 학습된 글로벌 네트워크를 이용하여, 제1 단말의 정보를 입력으로 하여 제1 단말이 전력 소모 감소를 위한 C-DRX 동작을 추론할 수 있다. 일 실시예에서, 제1 단말 정보는 일 실시예에 따른 제1 단말 정보는 도 4의 인코더 모듈과 동일하거나 유 사한 모듈을 이용하여, 인코딩된 특징의 형태로 추론 모듈에 입력될 수 있다. 일 실시예에서, 추론 모듈은 학습이 완료되어 복제된 글로벌 네트워크에 제1 단말 정보를 입력받아, C-DRX 동작을 수행하기 위한 C-DRX 파라미터 값을 결정할 수 있다. 여기서, 일 실시예에 따른 C-DRX 파라미터는 C-DRX 지속 시간, C-DRX 비활성 타이머, C-DRX 주기 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 추론 모듈은 제1 단말 정보를 인코딩하여, 글로벌 네트워크의 특징 벡터와 결합할 수 있다. 추론 모듈은 결합된 특징 벡터를 이용하여 C-DRX 지속 시간, C-DRX 비활성 타이머, C- DRX 주기를 차례로 출력하여 C-DRX 동작을 추론할 수 있다. 도 7에서는 C-DRX 지속 시간, C-DRX 비활성 타이머, C-DRX 주기 순으로 각 파라미터를 출력하 는 것으로 도시되어 있으나, 이에 한정되지 않는다. 예를 들어, 추론 모듈은 먼저 C-DRX 주기에 대한 파라미터를 출력하고, C-DRX 지속 시간, C-DRX 비활성 타이머에 대한 파라미터를 출력할 수 있다. 일 실시예에서, 추론 모듈은 C-DRX 지속 시간 파라미터 중에서 가장 전력 소모를 줄일 수 있는 파라 미터 값(예를 들어, 가장 확률 값이 큰 값)인 제1 C-DRX 지속시간을 제1 단말의 C-DRX 지속시간으로 결정 할 수 있다. 일 실시예에서, 추론 모듈은 C-DRX 비활성 타이머 값 중에서 소정의 기준, 정책, 결정된 제1 C-DRX 지속시간 등에 의해 제1 C-DRX 비활성 타이머를 마스킹(masking)할 수 있다. 추론 모듈은 마스 킹된 제1 C-DRX 비활성 타이머를 제외하고, 가장 전력 소모를 줄일 수 있는 파라미터 값(예를 들어, 가장 확률 값이 큰 값)인 제2 C-DRX 비활성 타이머를 제1 단말의 C-DRX 비활성 타이머로 결정할 수 있다. 또한, 일 실시예에 따른 추론 모듈은 C-DRX 주기 값 중에서 소정의 기준, 정책, 결정된 제1 C-DRX 지 속시간, 제2 C-DRX 비활성 타이머 등에 의해 제1 C-DRX 주기 및 제2 C-DRX 주기를 마스킹 할 수 있다. 추론 모듈은 마스킹된 제1 C-DRX 주기 및 제2 C-DRX 주기를 제외하고, 가장 전력 소모를 줄일 수 있는 파라미터 값(예를 들어, 가장 확률 값이 큰 값)인 제3 C-DRX 주기를 제1 단말의 C- DRX 주기로 결정할 수 있다. 일 실시예에서, 추론 모듈은 결정된 제1 C-DRX 지속시간, 제2 C-DRX 비활성 타이머, 제3 C-DRX 주기를 이용하여, 제1 단말의 C-DRX 동작을 추론할 수 있다. 일 실시예에서, 각 단말의 단말 정보, 글로벌 네트워크, 추론 모듈을 이용하여, 기지국의 커버 리지 내에 있는 복수의 단말(110,...,130)은 각 단말의 C-DRX 동작을 획득할 수 있다. 일 실시예에 따른 추론 모듈을 포함하는 전자 장치는 기지국에 포함될 수 있고, 별도의 외부 전자 장 치일 수도 있고, 각 단말에 포함될 수도 있다. 전자 장치가 기지국에 포함되거나 별도의 외부 전자 장치로 동작하는 경우, 추론된 각 단말의 동작은 유, 무선 통신을 통해 각 단말에게 전달될 수 있다. 도 8은 일 실시예에 따른 전자장치가 단말의 전력 소모 감소를 위한 추론 방법을 나타내는 흐름도이다. 도 8을 참조하면, 전자 장치는 복수개의 단말의 정보 및 기지국의 정보를 획득할 수 있다(S810). 여기서, 상기 복수개의 단말에 대한 정보는, CQI(channel quality indicator) 정보, SINR(signal to interference-plus-noise ratio) 정보, MCS(modulation and coding selection) 레벨 정보, 잔여 비트 (remained bits) 정보 및 처리량(throughput) 정보 중 적어도 하나를 포함할 수 있다. 또한, 일 실시예에 따른 상기 기지국의 정보는, 전체 처리량(throughput) 정보 및 RLC 실패(radio link control failure) 정보 중 적어도 하나를 포함할 수 있다. 일 실시예에 따른 전자 장치는 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관 계 벡터를 획득할 수 있다(S830). 여기서, 일 실시예에 따른 제1 인공신경망 모델은 소정의 제1 시점의 상기 복수개의 단말의 정보 및 상기 제1 시점으로부터 소정의 시간 이전의 제2 시점의 복수개의 단말의 정보를 입력 받아, 각 단말의 정보를 벡터로 변 환할 수 있다. 또한, 일 실시예에 따른 제1 인공신경망 모델은 상기 변환된 벡터를 이용하여 관계 벡터를 어텐 션 스코어(attention score)로 연산할 수 있다. 일 실시예에 따른 전자 장치는 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득할 수 있다(S850). 여기서, 일 실시예에 따른 제2 인공신경망 모델은 소정의 제3 시점의 상기 기지국 정보 및 상기 제3 시점으로부 터 소정의 시간 이전의 제4 시점의 기지국 정보를 입력받아, 각 단말의 정보를 기지국 벡터로 변환할 수 있다. 일 실시예에 따른 전자 장치는 각 단말에 대응되는 에이전트를 포함하는 제3 인공신경망 모델에 단말 사이의 관 계 벡터, 기지국 벡터 및 복수개의 단말의 정보를 입력하여 각 에이전트의 동작을 추론하도록 제3 인공신경망 모델을 강화학습 할 수 있다(S870). 일 실시예에 따른 제3 인공신경망 모델은 LSTM(long short term model)을 더 포함할 수 있다. 또한, 일 실시예 에 따른 제3 인공신경망은 LSTM을 이용하여 상기 제2 시점에서 제1 에이전트의 동작에 따라, 상기 제1 시점에서 상기 제1 에이전트가 선택할 수 없는 동작은 마스킹처리하여 강화학습될 수 있다. 여기서, 일 실시예에 따른 제3 인공신경망 모델은 각 에이전트의 별로 계산된 그래디언트(gradient)를 상기 복 수개의 단말의 수만큼 업데이트하여 강화학습될 수 있다. 또한, 일 실시예에 따른 제3 인공신경망 모델은 소정의 지연시간 임계값(latency threshold)을 만족시키고, 각 에이전트에 대응되는 단말의 소비 전력이 최소화되도록 학습될 수 있다. 일 실시예에 따른 전자 장치는 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 제3 인공신경망 모델에 입력 하여, 제1 단말의 C-DRX 동작을 추론할 수 있다(S890). 여기서, 일 실시예에 따른 제1 단말의 C-DRX 동작은, C-DRX 지속 시간(on-duration time), C-DRX 주기(cycle), C-DRX 비활성 타이머(inactivity timer) 중 적어도 하나의 파라미터를 이용하여 결정될 수 있다. 또한, 일 실시예에 따른 제3 인공신경망 모델은, 상기 복수개의 단말과는 상이한 제2 단말의 정보가 획득되는 경우, 상기 제2 단말에 대응되는 에이전트를 생성하고, 상기 제2 단말의 정보에 대해 상기 제2 단말의 에이전트 동작이 강화학습으로 더 학습된 것일 수 있다. 도 9는 일 실시예에 따른 전자 장치를 나타낸다. 도 9를 참조하면, 일 실시예에 따른 전자 장치는 송수신부, 프로세서 및 메모리를 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치의 구성은 도 9에 도시된 바에 한정되지 않으며, 도 9에 도시되지 않은 구성을 추가로 포함하거나 도 9에 도시된 구성 중 일부를 생략할 수도 있다. 예를 들면, 도 9에서는 프로세서 동작에 의해 전자 장치가 글로벌 네트워크를 학습하고, C-DRX 동작을 추론하는 것으로 도시되어 있으나, 프로세서의 동작은 메모리에 저장된 소프트웨어로 구현되 어 저장될 수도 있다. 또한, 도 9에는 도시되어 있지 않지만 전자 장치는 사용자로부터 마스킹을 위한 임계 지연시간 값을 입력 받을 수 있는 입력부, 추론된 C-DRX 동작을 출력할 수 있는 출력부를 더 포함할 수 있다. 또한 프로세서의 동작은 메모리에 저장된 소프트웨어 모듈로 구현될 수도 있다. 예컨대, 소프트웨어 모듈은 메모리에 저장될 수 있고, 프로세서에 의해 실행됨으로써 동작될 수 있다. 송수신부는 전자 장치와 외부의 다른 전자 장치 사이의 유선 또는 무선 통신 채널의 수립 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 일 실시 예에 따르면, 송수신부는 유선 통신 또는 무선 통 신을 통해 데이터를 수신하거나 학습이 완료된 글로벌 네트워크 또는 추론된 단말의 C-DRX 동작 정보를 송 신할 수 있다. 또는, 송수신부은 외부의 다른 기지국을 제어하는 서버를 포함하는 전자 장치에 대해 데이 터를 송신 또는 수신할 수 있다. 일 실시예에 따른 송수신부가 수신하는 데이터는 복수개의 단말에 대한 정보를 포함할 수 있다. 여기서, 복수개의 단말에 대한 정보는, CQI 정보, SINR 정보, MCS 레벨 정보, 잔여 비트 정보 및 처리량 정보 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면, 송수신부는 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또 는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있고, 그 중 해당하는 통신 모듈을 이용하여 근거리 통신 네트 워크 (예: 블루투스, WiFi direct 또는 IrDA(infrared data association)) 또는 원거리 통신 네트워크(예: 셀 룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN))를 통하여 외부 전자 장치와 통신할 수 있다. 프로세서는 전자 장치에 포함된 구성들과 전기적으로 연결되어, 전자 장치에 포함된 구성들의 제어 및/또 는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 일 실시 예에 따르면, 프로세서는 다른 구성들 중 적어도 하나로부터 수신된 명령 또는 데이터를 메모리에 로드하여 처리하고, 결과 데이터를 메모리 에 저장할 수 있다. 또한, 도 9에서는 설명의 편의를 위해 프로세서가 하나의 프로세서로 동작하는 것으로 표현하였으나, 전자 장치의 기능을 개념적으로 구분한 각 부에 포함되는 적어도 일부의 모듈의 기능을 복수의 프로세서로 구현 될 수 있다. 이 경우, 프로세서는 하나의 프로세서로 동작하는 것이 아니라, 복수의 프로세서가 별개 의 하드웨어로 구현되어 각 동작을 수행하도록 구현될 수 있다. 이에 한정되지 않는다. 메모리는 프로세서와 전기적으로 연결되고 전자 장치에 포함된 구성들의 동작과 관련된 명령 또는 데 이터를 저장할 수 있다. 다양한 실시 예에 따르면, 메모리는 각 단말의 정보, 기지국 정보, C-DRX 지연시 간 임계값 내지 상기 전자 장치의 동작들에 대한 인스트럭션들(instructions) 등을 저장할 수 있다. 일 실시 예에 따르면, 메모리는 전자 장치의 기능을 개념적으로 구분된 모듈들이 프로세서에 의 해 실행되는 소프트웨어로 구현되는 경우 그러한 소프트웨어 모듈을 실행하기 위한 인스트럭션들을 저장할 수도 있다. 일 실시예에 따른 전자 장치는 송수신부 및 상기 전자 장치에 저장된 하나 이상의 인스트럭션들을 실행하는 적 어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션들이 실 행될 때, 상기 복수개의 단말의 정보 및 기지국의 정보를 획득할 수 있다. 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션들이 실행될 때, 상기 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관계 벡터를 획득할 수 있다. 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션들이 실 행될 때, 상기 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득할 수 있다. 상기 적 어도 하나의 프로세서는 상기 하나 이상의 인스트럭션들이 실행될 때, 각 단말에 대응되는 에이전트를 포함하는 제3 인공신경망 모델에 상기 단말 사이의 관계 벡터, 상기 기지국 벡터 및 상기 복수개의 단말의 정보를 입력하 여 각 에이전트의 C-DRX 동작을 추론하도록 상기 제3 인공신경망 모델을 강화학습(reinforcement learning)시킬 수 있다. 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션들이 실행될 때, 상기 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 제3 인공신경망 모델에 입력하여, 상기 제1 단말의 C-DRX 동작을 추론할 수 있다. 상기 복수개의 단말에 대한 정보는, CQI(channel quality indicator) 정보, SINR(signal to interference- plus-noise ratio) 정보, MCS(modulation and coding selection) 레벨 정보, 잔여 비트(remained bits) 정보 및 처리량(throughput) 정보 중 적어도 하나를 포함할 수 있다. 상기 기지국의 정보는, 전체 처리량(throughput) 정보 및 RLC 실패(radio link control failure) 정보 중 적어 도 하나를 포함할 수 있다. 상기 제1 단말의 C-DRX 동작은, C-DRX 지속 시간(on-duration time), C-DRX 주기(cycle), C-DRX 비활성 타이머 (inactivity timer) 중 적어도 하나의 파라미터를 이용하여 결정될 수 있다. 상기 제1 인공신경망 모델은, 소정의 제1 시점의 상기 복수개의 단말의 정보 및 상기 제1 시점으로부터 소정의 시간 이전의 제2 시점의 복수개의 단말의 정보를 입력 받아, 각 단말의 정보를 벡터로 변환하고, 상기 변환된 벡터를 이용하여 상기 관계 벡터를 어텐션 스코어(attention score)로 연산할 수 있다. 상기 제2 인공신경망 모델은, 소정의 제3 시점의 상기 기지국 정보 및 상기 제1 시점으로부터 소정의 시간 이전 의 제4 시점의 기지국 정보를 입력받아, 각 단말의 정보를 기지국 벡터로 변환할 수 있다. 상기 제3 인공신경망 모델은 LSTM(long short term model)을 더 포함할 수 있다. 상기 적어도 하나의 프로세서 는 상기 하나 이상의 인스트럭션들이 실행될 때, 상기 LSTM을 이용하여 상기 제2 시점에서 제1 에이전트의 동작 에 따라, 상기 제1 시점에서 상기 제1 에이전트가 선택할 수 없는 동작은 마스킹처리하여 상기 제3 인공신경망 모델을 강화학습시킬 수 있다. 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션들이 실행될 때, 상기 각 에이전트의 별로 계산된 그래디언트(gradient)를 상기 복수개의 단말의 수만큼 업데이트하여 상기 제3 인공신경망 모델을 강화학습시킬 수 있다. 상기 제3 인공신경망 모델은 소정의 지연시간 임계값(latency threshold)을 만족시키고, 각 에이전트에 대응되 는 단말의 소비 전력이 최소화되도록 학습된 것일 수 있다. 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션들이 실행될 때, 상기 제1 단말의 C-DRX 동작에 대 한 적어도 하나의 마스킹 동작을 상기 제3 인공신경망에 더 입력하여 상기 제1 단말의 C-DRX 동작을 추론할 수 있다. 상기 제3 인공신경망 모델은, 상기 복수개의 단말과는 상이한 제2 단말의 정보가 획득되는 경우, 상기 제2 단말 에 대응되는 에이전트를 생성하고, 상기 제2 단말의 정보에 대해 상기 제2 단말에 대응되는 에이전트 동작이 강 화학습으로 더 학습된 것일 수 있다. 일 실시예에 따른 C-DRX 동작을 추론하는 방법에 있어서, 상기 방법은 복수개의 단말의 정보 및 기지국의 정보 를 획득하는 단계; 상기 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관계 벡터 를 획득하는 단계; 상기 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득하는 단계; 각 단말에 대응되는 에이전트를 포함하는 제3 인공신경망 모델에 상기 단말 사이의 관계 벡터, 상기 기지국 벡 터 및 상기 복수개의 단말의 정보를 입력하여 각 에이전트의 동작을 추론하도록 상기 제3 인공신경망 모델을 강 화학습(reinforcement learning)하는 단계; 및 상기 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 제3 인 공신경망 모델에 입력하여, 상기 제1 단말의 C-DRX 동작을 추론하는 단계를 포함할 수 있다. 상기 복수개의 단말에 대한 정보는, CQI(channel quality indicator) 정보, SINR(signal to interference- plus-noise ratio) 정보, MCS(modulation and coding selection) 레벨 정보, 잔여 비트(remained bits) 정보 및 처리량(throughput) 정보 중 적어도 하나를 포함할 수 있다. 상기 기지국의 정보는, 전체 처리량(throughput) 정보 및 RLC 실패(radio link control failure) 정보 중 적어 도 하나를 포함할 수 있다. 상기 제1 단말의 C-DRX 동작은, C-DRX 지속 시간(on-duration time), C-DRX 주기(cycle), C-DRX 비활성 타이머 (inactivity timer) 중 적어도 하나를 이용하여 결정될 수 있다. 상기 제1 인공신경망 모델은, 소정의 제1 시점의 상기 복수개의 단말의 정보 및 상기 제1 시점으로부터 소정의 시간 이전의 제2 시점의 복수개의 단말의 정보를 더 입력 받아, 각 단말의 정보를 벡터로 변환하고, 상기 변환 된 벡터를 이용하여 상기 관계 벡터를 어텐션 스코어(attention score)로 연산하고, 상기 제2 인공신경망 모델 은 소정의 제3 시점의 상기 기지국 정보 및 상기 제3 시점으로부터 소정의 시간 이전의 제4 시점의 기지국 정보 를 더 입력받아, 각 단말의 정보를 기지국 벡터로 변환할 수 있다. 상기 제3 인공신경망 모델은 LSTM(long short term model)을 더 포함하고, 상기 제3 인공신경망 모델을 강화학 습하는 단계는, 상기 LSTM을 이용하여 상기 제2 시점에서 제1 에이전트의 동작에 따라, 상기 제1 시점에서 상기 제1 에이전트가 선택할 수 없는 동작은 마스킹처리하여 상기 제3 인공신경망을 강화학습하는 단계를 포함할 수 있다. 상기 제3 인공신경망 모델을 강화학습하는 단계는, 상기 각 에이전트의 별로 계산된 그래디언트(gradient)를 상 기 복수개의 단말의 수만큼 업데이트하여 상기 제3 인공신경망 모델을 강화학습하는 단계를 포함할 수 있다. 상기 제3 인공신경망 모델은 소정의 지연시간 임계값(latency threshold)을 만족시키고, 각 에이전트에 대응되 는 단말의 소비 전력이 최소화되도록 학습된 것일 수 있다. 상기 제1 단말의 C-DRX 동작을 추론하는 단계는, 상기 제1 단말의 C-DRX 동작에 대한 적어도 하나의 마스킹 동 작을 상기 제3 인공신경망에 더 입력하여 상기 제1 단말의 C-DRX 동작을 추론하는 단계를 포함할 수 있다. 상기 제3 인공신경망 모델은, 상기 복수개의 단말과는 상이한 제2 단말의 정보가 획득되는 경우, 상기 제2 단말 에 대응되는 에이전트를 생성하고, 상기 제2 단말의 정보에 대해 상기 제2 단말의 에이전트 동작이 강화학습으 로 더 학습된 것일 수 있다. 일 실시예에 따른 컴퓨터 판독 가능한 기록 매체는, 하나 이상의 프로그램 코드(code)를 포함할 수 있다. 하나 이상의 프로그램 코드는 전자 장치에서 실행될 때, 복수개의 단말의 정보 및 기지국의 정보를 획득하는 단계; 상기 복수개의 단말의 정보를 제1 인공신경망 모델의 입력으로 하여, 단말 사이의 관계 벡터를 획득하는 단계; 상기 기지국의 정보를 제2 인공신경망 모델의 입력으로 하여, 기지국 벡터를 획득하는 단계; 각 단말에 대응되 는 에이전트를 포함하는 제3 인공신경망 모델에 상기 단말 사이의 관계 벡터, 상기 기지국 벡터 및 상기 복수개 의 단말의 정보를 입력하여 각 에이전트의 동작을 추론하도록 상기 제3 인공신경망 모델을 강화학습 (reinforcement learning)하는 단계; 및 상기 복수개의 단말 중 제1 단말의 정보를 학습이 완료된 제3 인공신경 망 모델에 입력하여, 상기 제1 단말의 C-DRX 동작을 추론하는 단계를 수행한다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비 일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미 할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하 지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운 로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다."}
{"patent_id": "10-2023-0114262", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 기지국 및 단말을 나타낸다. 도 2는 본 개시의 일 실시예에 따른 단말의 전력 소모 감소를 위한 C-DRX 파라미터 및 시간에 따른 단말의 동작 을 나타낸다. 도 3은 본 개시의 일 실시예에 따른 기지국의 인공신경망 모델을 나타내는 블록도이다. 도 4는 본 개시의 일 실시예에 따른 단말 사이의 정보를 인코딩하는 인공신경망을 나타내는 블록도이다. 도 5는 본 개시의 일 실시예에 따른 기지국 정보를 인코딩하는 인공신경망을 나타내는 블록도이다. 도 6은 본 개시의 일 실시예에 따른 단말의 동작을 학습하는 동작을 나타내는 블록도이다. 도 7은 본 개시의 일 실시예에 따른 단말의 동작을 추론하는 동작을 나타낸다. 도 8은 본 개시의 일 실시예에 따른 단말의 전력 소모 감소를 위한 방법을 나타내는 흐름도이다. 도 9는 본 개시의 일 실시예에 따른 전자 장치를 나타낸다."}
