{"patent_id": "10-2021-0085378", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0003824", "출원번호": "10-2021-0085378", "발명의 명칭": "슬라이딩 및 폴딩 동작이 가능한 전자 장치", "출원인": "삼성전자주식회사", "발명자": "강기욱"}}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제1 하우징;상기 제1 하우징에 대하여 제1 방향으로 슬라이딩 가능하게 결합되는 제2 하우징; 일단이 상기 제1 하우징 및 상기 제2 하우징 중 하나에 고정되어 상기 제2 하우징의 슬라이딩에 따라 상기 전자장치의 외부로 보여지는 부분인 정보 표시 영역이 증감하는 플렉서블(flexible) 디스플레이; 및상기 제2 하우징을 상기 제1 하우징에 대해 회전 가능하게 연결하는 힌지 장치;를 포함하고,상기 힌지 장치의 회전축은,상기 제1 하우징에 대한 상기 제2 하우징의 회전 과정에서 상기 제1 방향으로 이동할 수 있도록 상기 제1 방향으로 연장되어 형성된 수용부에 삽입되는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 힌지 장치는,상기 수용부가 형성된 제1 힌지부와,상기 제1 힌지부에 대하여 회전 가능하도록 상기 제1 힌지부에 연결되는 제2 힌지부를 포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 힌지 장치는,상기 제1 힌지부에 형성된 제1 기어와 상기 힌지 장치의 제2 힌지부에 형성된 제2 기어가 맞물리는 구조를 포함하고,상기 제2 기어가 맞물려 회전하면 상기 회전축이 상기 제1 방향을 따라 이동하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제1 기어 및 상기 제2 기어 중 적어도 하나는,상기 제1 방향으로 연장된 기어인 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 제1 기어는 래크 기어(rack gear)이고, 상기 제2 기어는 피니언 기어(pinion gear)인 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 디스플레이는,공개특허 10-2023-0003824-3-상기 전자 장치의 외부로 노출되는 표시 영역과 상기 전자 장치 내부에 수납되는 수납 영역 및 상기 표시 영역과 상기 수납 영역을 연결하고 밴딩된 영역인 밴딩 영역 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 디스플레이를 지지하는 지지 부재;를 더 포함하고,상기 지지 부재는,상기 표시 영역의 제1 영역을 지지하는 제1 지지부, 상기 표시 영역의 제2 영역, 상기 디스플레이의 밴딩 영역 및 상기 디스플레이의 수납 영역을 지지하는 제2 지지부, 및 상기 표시 영역의 제1 영역과 상기 표시 영역의 제2 영역을 연결하는 제3 영역을 적어도 일부 지지하는 제3 지지부를 포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제2 지지부는,상기 디스플레이의 폭 방향으로 연장되어 상기 폭 방향에 대해 수직한 상기 디스플레이의 길이 방향을 따라 배열된 복수의 바(bar)를 포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 지지 부재의 제1 지지부와 제2 지지부는 상기 디스플레이에 고정되고,상기 지지 부재의 제3 지지부는 상기 디스플레이에 고정되는 제1 서브 지지부와 상기 디스플레이에 대하여 분리되는 제2 서브 지지부를 포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 힌지 장치는,상기 제1 힌지부와 상기 제2 힌지부가 상기 제2 하우징의 슬라이딩에 따라 함께 이동하도록 구성되고,상기 제1 하우징에 형성된 힌지 가이드에 의해 상기 제1 힌지부의 슬라이딩이 제한되고, 상기 제1 힌지부의 슬라이딩이 제한된 상태에서 상기 제2 힌지부가 상기 제1 힌지부에 대해 회전함으로써 상기 제2 하우징이 상기 제1 하우징에 대해 회전하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 제2 하우징에 결합되는 서브 하우징;을 더 포함하고,상기 디스플레이의 수납 영역은,상기 디스플레이가 상기 제2 하우징과 상기 서브 하우징에 의해 형성된 수납 공간에 수납된 영역인 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 지지 부재의 움직임을 가이드하는 가이드 레일;을 더 포함하고,공개특허 10-2023-0003824-4-상기 가이드 레일은,적어도 일부분이 절곡되고 상기 수납 공간으로 연장되도록 형성되는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 제1 지지부는,상기 제3 지지부와 인접한 말단에 상기 제1 방향에 대하여 수직하게 형성된 제1 작용부와 상기 제1 방향에 대하여 경사지게 형성된 제1 경사부를 포함하고,상기 제3 지지부의 제2 서브 지지부는,상기 제1 지지부와 인접한 말단에 상기 제1 작용부와 대응하도록 형성된 제2 작용부와 상기 제1 경사부와 대응하도록 형성된 제2 경사부를 포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 힌지 장치는,상기 제1 힌지부가 상기 제1 하우징에 대해 고정된 위치에 배치되고,상기 제2 하우징에 형성된 힌지 가이드와 상기 힌지 가이드에 적어도 일부가 삽입된 상기 제2 힌지부의 걸림에의해 상기 제2 힌지부에 대한 상기 제2 하우징의 슬라이딩이 제한되고, 상기 제2 하우징의 슬라이딩이 제한된상태에서 상기 제2 힌지부가 상기 제1 힌지부에 대해 회전함으로써 상기 제2 하우징이 상기 제1 하우징에 대해회전하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제3 지지부의 제2 서브 지지부는,상기 제1 지지부에 돌출 형성된 제1 부분과 상기 제1 부분과 대응되도록 형성된 지지홈을 포함하는 제2 부분을포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제2 부분은,상기 제3 지지부의 제1 서브 지지부에 일체로 형성되는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 제2 부분은,상기 지지홈과 대응하는 부분에서 상기 제1 방향에 대하여 경사진 방향으로 상기 제1 서브 지지부에서 돌출 형성된 경사 지지부를 포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제1 하우징에 결합되는 서브 하우징을 더 포함하고,상기 서브 하우징은,상기 제2 하우징의 슬라이딩에 따라 상기 제1 방향으로 이동하는 상기 경사 지지부가 수용되도록 상기 제1 방향공개특허 10-2023-0003824-5-으로 연장되어 형성된 경사 지지부 수용홈을 더 포함하는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제14항에 있어서,상기 제1 하우징에 결합되는 서브 하우징;을 더 포함하고,상기 디스플레이의 수납 영역은,상기 디스플레이가 상기 제1 하우징과 상기 서브 하우징에 의해 형성된 수납 공간에 수납된 영역인 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 지지 부재의 움직임을 가이드하는 가이드 레일;을 더 포함하고,상기 가이드 레일은,적어도 일부분이 절곡되고 상기 수납 공간으로 연장되도록 형성되는 전자 장치."}
{"patent_id": "10-2021-0085378", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 제1 방향으로 슬라 이딩 가능하게 결합되는 제2 하우징, 일단이 상기 제1 하우징 및 상기 제2 하우징 중 하나에 고정되어 상기 제2 하우징의 슬라이딩에 따라 상기 전자 장치의 외부로 보여지는 부분인 정보 표시 영역이 증감하는 플렉서블 (flexible) 디스플레이 및 상기 제2 하우징을 상기 제1 하우징에 대해 회전 가능하게 연결하는 힌지 장치를 포함 할 수 있고, 상기 힌지 장치의 회전축은, 상기 제1 하우징에 대한 상기 제2 하우징의 회전 과정에서 상기 제1 방 향으로 이동할 수 있도록 상기 제1 방향으로 연장되어 형성된 수용부에 삽입될 수 있다. 이 밖에도 다양한 실시 예가 가능할 수 있다."}
{"patent_id": "10-2021-0085378", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들은, 슬라이더블 동작과 폴딩 동작을 모두 수행할 수 있는 슬라이딩 및 폴딩 동작이 가능한 전자 장치에 대한 것이다."}
{"patent_id": "10-2021-0085378", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디스플레이는 휴대용 전자 장치에 있어서 핵심적인 기능을 담당할 수 있다. 디스플레이는 정보를 시각적으로 표 시할 수 있다. 디스플레이의 디자인, 크기 및 품질과 같은 요소들은 소비자들의 전자 장치 선택에 중요하게 작 용할 수 있다. 최근 디스플레이 기술 발전으로 플렉서블 디스플레이가 시장에 출시되고 있다. 이러한 플렉서블 디스플레이를 이용하면 표시되는 화면 크기가 가변되는 형태의 디스플레이도 구현될 수 있다. 예를 들어, 슬라이딩을 통해 화 면 크기가 증감하거나, 특정 기구물에 롤링(rolling)되거나, 폴딩(folding)을 통해 변형되는 디스플레이를 포함 하는 새로운 개념의 전자 장치도 개발되고 있다."}
{"patent_id": "10-2021-0085378", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "변형이 가능한 디스플레이를 이용한 다양한 전자 장치를 구현하기 위해서는 변형되는 디스플레이를 안정적으로 지지할 수 있는 새로운 구조가 필요하다. 예를 들어, 폴딩 디스플레이를 사용하는 경우 디스플레이 들뜸, 디스플레이 파손, 디스플레이 변형과 같은 다양 한 문제를 해소할 수 있는 지지 구조가 필요하다. 더불어, 반복적인 동작에도 구동 특성이 쉽게 변하지 않는 비교적 단순한 매커니즘을 사용할 필요가 있다."}
{"patent_id": "10-2021-0085378", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 제1 방향으로 슬 라이딩 가능하게 결합되는 제2 하우징, 일단이 상기 제1 하우징 및 상기 제2 하우징 중 하나에 고정되어 상기 제2 하우징의 슬라이딩에 따라 상기 전자 장치의 외부로 보여지는 부분인 정보 표시 영역이 증감하는 플렉서블(flexible) 디스플레이 및 상기 제2 하우징을 상기 제1 하우징에 대해 회전 가능하게 연결하는 힌지 장치를 포 함할 수 있고, 상기 힌지 장치의 회전축은, 상기 제1 하우징에 대한 상기 제2 하우징의 회전 과정에서 상기 제1 방향으로 이동할 수 있도록 상기 제1 방향으로 연장되어 형성된 수용부에 삽입될 수 있다."}
{"patent_id": "10-2021-0085378", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따르면, 새로운 개념의 전자 장치를 제시함으로써 새로운 수요를 창출할 수 있다. 변형 가능한 디스플레이를 이용하여 휴대가 간편하면서도 많은 정보를 표시할 수 있는 전자 장치를 제공 할 수 있다. 디스플레이 변형 과정에서 디스플레이에 가해지는 데미지를 줄여 디스플레이의 내구성을 향상시킬 수 있고 디스 플레이의 들뜸 현상을 해소할 수 있다."}
{"patent_id": "10-2021-0085378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“또는 B 중 적어도 하나,”\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,”및 “B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열 된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어와 함께 또는 이런 용어 없이, “커플드” 또는 “커넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성 요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a 및 도 2b는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 다양한 상태를 설명하기 위한 도면이다. 도 2c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 다양한 실시예에 따르면, 도 2a 내지 도 2c에 도시된 전자 장치는 도 1에서 설명한 전자 장치 중 하 나일 수 있다. 도 2a 및 도 2b를 참조하면, 전자 장치는 슬라이딩 방식을 통해 디스플레이의 정보 표시 영역이 증가하거나 감소하도록 구현된 전자 장치일 수 있다. 여기서 정보 표시 영역은, 디스플레이에서 전자 장치 외부로 보여지는 부분일 수 있다. 디스플레이에 출력되는 정보는 정보 표시 영역을 통해 사용자에게 시각적으로 전달될 수 있다. 다양한 실시예에 따르면, 전자 장치는 슬라이딩 동작에 의해 정보 표시 영역이 증감할 수 있다. 일 실시예에서, 전자 장치의 슬라이딩 동작은 제1 하우징에 대한 제2 하우징의 슬라이딩을 의미할 수 있다. 제2 하우징은 제1 하우징에 대하여 도 2a 및 도 2b를 기준으로 +X 방향 또는 도 2a 및 도 2b를 기준으로 -X 방향으로 슬라이딩될 수 있다. 다양한 실시예에 따르면, 전자 장치는 슬라이딩 동작에 의해 기준 상태(예: 도 2a에 도시된 상태)에서 슬 라이딩 상태(예: 도 2b에 도시된 상태)로 변경될 수 있다. 기준 상태는 제1 하우징의 말단과 제2 하우징의 말단이 실질적으로 일치한 상태를 의미할 수 있다. 예를 들어, 도 2a에 도시된 것과 같이, 제2 하우징이 제1 하우징에 대해 돌출되거나, 제1 하우징 이 제2 하우징에 대해 돌출되지 않은 상태를 의미할 수 있다. 기준 상태는 제1 하우징과 제2 하 우징이 정렬된 상태를 의미할 수 있다. 기준 상태는 닫힌(closed) 상태 또는 슬라이드 인(slide-in) 상태 로 이해될 수 있다. 슬라이딩 상태는 기준 상태에서 제2 하우징이 제1 하우징에 대해 슬라이딩된 상태를 의미할 수 있다. 슬라이딩 상태에서 디스플레이의 정보 표시 영역은 기준 상태에서 디스플레이의 정보 표시 영역 보다 클 수 있다. 슬라이딩 상태는 열린(opened) 상태 또는 슬라이드 아웃(slide-out) 상태로 이해될 수 있다. 슬라이딩 동작에 따라 정보 표시 영역이 가변되는 형태의 디스플레이를 “슬라이더블 디스플레이”라 정의할 수 있다. 또한, 디스플레이는 후술하는 롤러(예: 도 3a의 롤러)에 가이드되어 일부 구간이 밴 딩될 수 있다. 롤러에 가이드되어 일부 영역이 휘어지는 디스플레이를 “롤러블 디스플레이”라 정의할 수 있다. 이하에서 설명되는 디스플레이는 “슬라이더블 또는 롤러블 디스플레이”로 이해될 수 있다. 일 실시예에 따르면, 제1 하우징에 대한 제2 하우징의 슬라이딩은 반자동적으로 수행될 수 있다. 예 를 들어, 슬라이딩 방향으로 탄성력을 제공하는 부재(미도시)에 의해 제1 하우징에 대한 제2 하우징 의 슬라이딩이 수행될 수 있다. 이 경우, 제1 하우징에 대한 제2 하우징의 슬라이딩이 일부 이루어지 면, 제1 하우징 및/또는 제2 하우징에 제공되는 탄성력에 의해 제2 하우징의 슬라이딩이 이루어질 수 있다. 일 실시예에 따르면, 제1 하우징에 대한 제2 하우징의 슬라이딩은 자동적으로 수행될 수 있다. 예를 들어, 제2 하우징은 모터(미도시)에 의해 제1 하우징에 대해 슬라이딩될 수 있다. 전자 장치에 포함된 다양한 버튼 및 센서를 통해 입력되는 신호에 따라 제2 하우징을 슬라이딩시키는 모터가 작동할 수 있다. 다양한 실시예에 따르면, 제1 하우징은 적어도 하나의 서브 하우징(211, 212, 213)과 가이드 하우징 을 포함할 수 있다. 예를 들어, 도 3b에 도시된 것과 같이, 제1 하우징은 제1 서브 하우징, 제2 서브 하우징 및 제3 서브 하우징과 가이드 하우징을 포함할 수 있다. 일 실시예에서, 제3 서브 하우 징과 제2 서브 하우징 사이에는 디스플레이의 일부분을 수용하기 위한 수용 공간(예: 도 3a의 수용 공간)이 마련될 수 있다. 일 실시예에서, 가이드 하우징은, 한 쌍 마련되어 전자 장치의 양 측방향(예: 도 3b의 +Y 방향 및 -Y 방향)에서 제1 서브 하우징, 제2 서브 하우징 및 제3 서브 하 우징의 조립체에 결합될 수 있다. 가이드 하우징은 가이드 레일(214-1)을 포함할 수 있다. 가이드 레 일(214-1)은 제2 하우징 및 지지 부재의 슬라이딩 운동을 가이드하기 위해 가이드 하우징에 형 성된 홈일 수 있다. 제2 하우징 및 지지 부재에 형성된 돌기(예: 도 4의 가이드 돌기)가 가이드 레일(214-1)에 삽입된 상태로 슬라이딩됨으로써, 가이드 레일(214-1)이 제2 하우징과 지지 부재의 슬 라이딩을 가이드할 수 있다. 다양한 실시예에 따르면, 제2 하우징은 디스플레이의 일부분을 지지할 수 있다. 디스플레이의 적어도 일부는 제2 하우징에 고정되어, 제2 하우징이 제1 하우징에 대해 슬라이딩될 때, 제2 하 우징을 따라 움직일 수 있다. 다양한 실시예에 따르면, 지지 부재는 디스플레이의 일부분을 지지할 수 있다. 지지 부재는 절 곡 가능한 구조를 포함할 수 있다. 예를 들어, 지지 부재는 슬라이딩 방향(예: 도 3b의 X 축 방향)과 수직 한 방향(예: 도 3b의 Y 축 방향)으로 연장되어 형성된 복수의 바(bar)(예: 도 4의 제1 지지 부재)가 슬라 이딩 방향을 따라 연결된 구조를 포함할 수 있다. 이 밖에도 절곡이 가능한 다양한 구조로 지지 부재를 구 성할 수 있다. 예를 들어, 지지 부재는 절곡될 수 있는 플레이트(plate)일 수 있고, 절곡을 허용할 수 있 도록 복수의 홈이 형성된 구조를 가질 수 있다. 지지 부재는 제2 하우징에 연결되어, 제2 하우징 과 함께 제1 하우징에 대해 슬라이딩될 수 있다. 다양한 실시예에 따르면, 디스플레이는 휘어짐이 가능한 유연 디스플레이일 수 있다. 일 실시예에서, 디스플레이는 유연한 소재의 기판을 포함할 수 있다. 예를 들어, 디스플레이는 폴리이미드 (polyimide; PI) 또는 폴리에틸렌 테레프탈레이트(polyethylene terephthalate; PET)와 같은 유연 소재의 고분 자 물질로 형성된 기판을 포함할 수 있다. 또한, 매우 얇게 형성된 유리 소재의 기판을 포함할 수 있다. 디스플 레이는 제2 하우징 및 지지 부재에 의해 지지되며, 제1 하우징에 대한 제2 하우징의 슬라이딩을 통해 외부로 보여지는 부분인 정보 표시 영역이 증감할 수 있다. 일 실시예에서, 디스플레이 는 터치 감지 회로(예: 터치 센서)를 더 포함할 수 있다. 또한, 디스플레이는 터치의 세기(압력)를 측정할 수 있는 압력 센서 및/또는 자기장 방식의 펜 입력 장치(예: 스타일러스 펜)를 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 예컨대, 디지타이저는 펜 입력 장치로부터 인가된 전자기 유도 방식의 공 진 주파수를 검출할 수 있도록 유전체 기판 상에 배치되는 코일 부재를 포함할 수 있다. 다양한 실시예에 다르면, 후면 커버는 제1 하우징에 결합되어 전자 장치의 후면 외관을 이룰 수 있다. 예를 들어, 도 3b에 도시된 것과 같이, 후면 커버는 도 3b의 Z 축 방향에서 제1 하우징에 결합 될 수 있다. 후면 커버는 투명, 불투명 또는 반투명 소재로 형성될 수 있다. 도 3a는, 본 문서에 개시된 다양한 실시예에 따른 도 2a에 도시된 전자 장치를 A-A선을 따라 절개한 단면도이다. 도 3b는, 본 문서에 개시된 다양한 실시예에 따른 도 2b에 도시된 전자 장치를 B-B선을 따라 절개 한 단면도이다. 다양한 실시예에 따르면, 디스플레이는 복수의 영역을 포함할 수 있다. 이하에서 설명되는 복수의 영역은 전자 장치에서 디스플레이의 상태 또는 디스플레이가 위치한 부분에 따라 구분된 영역일 수 있 다. 예를 들어, 디스플레이는 전자 장치의 외부로 디스플레이가 노출되는 영역인 표시 영역 (230A), 전자 장치의 내부에 수납된 영역인 수납 영역(230C) 및 표시 영역(230A)과 수납 영역(230C)을 연결하고 밴딩된 영역인 밴딩 영역(230B)을 포함할 수 있다. 일 실시예에서, 디스플레이의 수납 영역(230C) 은 디스플레이의 일부가 제1 하우징에 포함된 수용 공간에 수용된 영역일 수 있다. 일 실시예에 서, 디스플레이를 둘러싸는 하우징의 형상에 따라 밴딩 영역(230B)의 일부도 전자 장치 외부로 시인 될 수 있다. 전자 장치가 슬라이딩됨에 따라, 표시 영역(230A)과 수납 영역(230C)의 크기는 가변될 수 있다. 예를 들어, 기준 상태(예: 도 3a에 도시된 상태)에서 표시 영역(230A)의 크기는 슬라이딩 상태(예: 도 3b에 도시된 상태)에서 표시 영역(230A)의 크기보다 작을 수 있다. 기준 상태에서 수납 영역(230C)의 크기는 슬라이딩 상태 에서 수납 영역(230C)의 크기보다 클 수 있다. 디스플레이의 각 영역은 설명의 편의를 위해 구분한 것에 불과하며 실제 시각적으로 구별되는 영역이 아닐 수 있다. 다양한 실시예에 따르면, 제2 하우징이 도 3a 및 도 3b를 기준으로 +X 방향으로 슬라이딩되면, 제2 하우징 에 연결된 디스플레이가 움직이며 표시 영역(230A)이 증가하고, 수납 영역(230C)이 줄어들 수 있다. 디스플레이를 지지하는 지지 부재는 밴딩 영역(230B)에서 롤러를 따라 구부러질 수 있다. 도 4a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 사시도이다. 도 4b는, 도 4a에 도시된 전자 장치 가 슬라이딩된 상태의 사시도이다. 도 4c는, 도 4b에 도시된 전자 장치가 폴딩된 상태의 사시도이다. 도 4d는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 폴딩 동작을 측면에서 바라본 도면이다. 이하에서 설명되는 전자 장치는 도 2a 내지 도 2c 및 도 3a 내지 도 3b를 통해 설명한 전자 장치와 유사하게 슬라이딩 가능하게 결합된 제1 하우징(예: 도 2a의 제1 하우징)과 제2 하우징(예: 도 2a의 제2 하우징)을 포함하고, 제2 하우징의 슬라이딩에 따라 디스플레이(예: 도 2a의 디스플레 이)의 정보 표시 영역(401A)(예: 도 2a의 정보 표시 영역)이 가변되는 형태의 전자 장치일 수 있다. 이하에서 설명되는 전자 장치의 동작 및 구조는 앞서 설명한 전자 장치와 유사한 구성을 포함하므로 위 설명을 참조하여 이해할 수 있다. 도 4a 및 도 4b에 도시된 것과 같이, 제2 하우징이 제1 하우징에 대해 슬라이딩함으로써, 정보가 표 시되는 부분(정보 표시 영역(401A)) 또는 디스플레이가 전자 장치 외부로 시인되는 부분의 면적이 증 가할 수 있다. 이하에서는, 정보 표시 영역(401A)이 확장되는 방향의 슬라이딩을 제1 방향(예: 도 4b의 +X 방향) 슬라이딩이라 한다. 제1 방향과 반대 방향인 제2 방향(예: 도 4b의 -X 방향)으로의 슬라이딩은 정보 표시 영역(401A)이 축소되는 방향의 슬라이딩일 수 있다. 정보 표시 영역(401A)이 축소되는 방향의 슬라이딩을 제2 방향 슬라이딩이라 할 수 있다. 이하에서 설명되는 전자 장치는 제2 하우징이 제1 하우징에 대하여 회전할 수 있도록 구성될 수 있다. 제2 하우징이 제1 하우징에 대해 회전하면, 디스플레이의 일부 영역이 변형(예: 밴딩)될 수 있다. 도 4c 및 도 4d에 도시된 것과 같이, 제1 하우징에 대한 제2 하우징의 회전에 따라 제1 하 우징에 배치되는 디스플레이 영역과 제2 하우징에 배치되는 디스플레이 영역이 소정 각도 를 이룰 수 있다. 제1 하우징에 대한 제2 하우징의 회전은 제1 하우징과 제2 하우징의 폴 딩(folding)으로 이해될 수 있다. 따라서, 이하의 전자 장치는 슬라이더블 또는 롤러블 전자 장치이면서 동시에 폴딩될 수 있는 전자 장치를 의미할 수 있다. 도 4d를 참조하면, 제2 하우징과 제1 하우징은 다양한 각도를 이룰 수 있다. 일 실시예에서, 제2 하 우징에 대한 제1 하우징의 회전은 외력이 제공되지 않은 상태에서 정지할 수 있다. 예를 들어, 제1 하우징과 제2 하우징을 회전 가능하게 연결하는 구성(예: 도 5a의 힌지 장치)의 마찰력으로 인 하여 제1 하우징에 대한 제2 하우징의 회전이 정지할 수 있다. 제1 하우징에 대하여 제2 하우징이 소정 각도를 이룬 상태에서 제1 하우징은 지면에 대하여 제2 하우징을 소정 각도로 지지하는 지지대로 기능할 수 있다. 이와 같은 상태에서 제2 하우징에 배치된 디스플레이에 정보를 표시할 수 있다. 제2 하우징 전면에 배치된 카메라(예: 도 1의 카메라 모듈 )를 이용하여 셀피(selfie) 촬영을 수행하거나, 알림을 표시하거나, 제1 하우징에 배치된 디스플레이 에는 조작 UI를 표시하고 제2 하우징에 배치된 디스플레이에는 컨텐츠(예: 게임, 영상)를 표시 할 수 있다. 이 밖에도 다양한 방식으로 본 문서에 개시된 전자 장치를 활용할 수 있다. 도 5a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 5b는, 본 문서에 개시된 다 양한 실시예에 따른 전자 장치의 일부 구성 요소를 분리하여 도시한 도면이다. 도 6a 내지 도 6e는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 슬라이딩 및 폴딩 동작을 설명하기 위한 도면이다. 도 5a 및 도 5b를 참조하면, 전자 장치는 제1 하우징, 제2 하우징, 서브 하우징, 가이드 레일 , 롤러, 힌지 장치 및 지지 부재를 포함할 수 있다. 제2 하우징은 제1 하우징 에 대하여 슬라이딩 가능하게 결합될 수 있다. 서브 하우징은 제2 하우징에 결합되어 지지 부재(47 0)를 지지할 수 있다. 또한, 서브 하우징과 제2 하우징 사이에 형성된 수납 공간에는 디스플레이(예: 도 4a의 디스플레이)의 일부가 수납될 수 있다. 가이드 레일은 제1 하우징에 대하여 제2 하우징 이 슬라이딩되는 과정에서 지지 부재의 움직임을 가이드할 수 있다. 도 5a에 도시된 것과 같이 가이 드 레일은 별도로 형성되어 서브 하우징의 측면 또는 제2 하우징의 내측면에 배치될 수 있다. 어떤 실시예에서는 가이드 레일이 서브 하우징의 측면 또는 제2 하우징의 내측면에 형성될 수 있다. 롤러는 디스플레이의 밴딩 영역(예: 도 6a의 밴딩 영역(430B))을 지지하는 지지 부재를 지지할 수 있다. 힌지 장치는 제2 하우징에 대한 제1 하우징의 회전을 구현하는 구성 요소일 수 있다. 힌지 장치에 의해 제2 하우징이 제1 하우징에 대해 회전할 수 있다. 지지 부재는 디 스플레이를 지지할 수 있다. 각 구성 요소의 더 자세한 설명은 전자 장치의 동작을 설명하면서 추가하도록 한다. 먼저, 도 5a, 5b 및 도 6a 내지 도 6c를 참조하여, 전자 장치의 슬라이딩 동작에 대해 설명하도록 한다. 전자 장치의 슬라이딩 동작은 도 2a 내지 도 2c 및 도 3a 내지 도 3b를 통해 설명한 전자 장치와 유 사할 수 있다. 이하에서는 도 6a에 도시된 상태를 슬라이드 인(slide-in) 상태라 하고, 도 6c에 도시된 상태를 슬라이드 아웃 (slide-out) 상태로 정의하여 호칭하도록 한다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치에 포함된 디스플레이는 전자 장치의 슬라이 딩 동작에 따라 일부 구간이 변형(예: 밴딩)될 수 있는 유연(flexible) 디스플레이일 수 있다. 디스플레이 는 복수의 영역을 포함할 수 있다. 여기서 디스플레이의 복수의 영역은 설명의 편의를 위해 구분한 것이며 디스플레이가 복수의 영역으로 분절되어 구현되거나 시각적으로 구분되는 복수의 영역을 포함한다 는 의미는 아니다. 일 실시예에서, 디스플레이는 표시 영역(430A), 밴딩 영역(430B) 및 수납 영역(430C)을 포함할 수 있다. 표시 영역(430A)은 전자 장치의 외부로 디스플레이가 시인되는 영역을 의미할 수 있 다. 수납 영역(430C)은 전자 장치의 내부 공간에 수납된 영역일 수 있다. 디스플레이의 수납 영역 (430C)이 배치된 전자 장치의 내부 공간은 제2 하우징과 제2 하우징에 결합되는 서브 하우징 에 의해 형성된 공간일 수 있다. 밴딩 영역(430B)은 표시 영역(430A)과 수납 영역(430C)을 연결하는 영역 일 수 있다. 밴딩 영역(430B)에서 디스플레이의 변형이 일어날 수 있다. 경우에 따라서는, 밴딩 영역 (430B)의 일부분도 전자 장치 외부에서 시인될 수 있다. 따라서, 밴딩 영역(430B)의 일 영역도 표시 영역 (430A)이 될 수 있다. 디스플레이의 표시 영역(430A)은 다시 제1 영역(431A), 제2 영역(432A) 및 제3 영 역(433A)으로 구분될 수 있다. 제1 영역(431A) 내지 제3 영역(433A)의 구분은 디스플레이를 지지하는 지지 부재에 의해 개념적으로 구분된 영역일 수 있다. 다양한 실시예에 따르면, 디스플레이는 지지 부재에 의해 지지될 수 있다. 지지 부재는 제1 지 지부, 제2 지지부 및 제3 지지부를 포함할 수 있다. 일 실시예에서, 지지 부재의 양 단은 가이드 레일에 삽입될 수 있다. 지지 부재에 결합된 디스 플레이의 양 단은 가이드 레일과 제2 가이드 리브 사이에 배치될 수 있다. 도 5b를 참조하면, 제2 하우징의 내측면에는 제2 하우징의 내측 방향으로 돌출된 부분인 제2 가이드 리브가 형성될 수 있다. 제2 가이드 리브는 디스플레이의 일부를 덮을 수 있다. 제2 가이드 리브가 디스플레이 의 일부를 덮기 때문에 디스플레이가 슬라이딩 과정에서 이탈되지 않을 수 있다. 일 실시예에서, 제1 지지부는 디스플레이에서 변형이 일어나지 않는 부분을 지지할 수 있다. 디스플 레이에서 변형이 일어나지 않는 부분은 표시 영역(430A)의 제1 영역(431A)일 수 있다. 제1 영역(431A)은 전자 장치의 슬라이딩 과정에서 변형이 일어나지 않는 영역일 수 있다. 제1 지지부는 플레이트 형상 으로 형성될 수 있다. 디스플레이의 제1 영역(431A)과 제1 지지부는 고정 부재(미도시)를 통해 고정될 수 있다. 예를 들어, 고정 부재는 접착성 물질일 수 있다. 고정 부재에 의해 디스플레이의 제1 영역 (431A)과 제1 지지부가 상호 고정될 수 있다. 일 실시예에서, 제1 지지부는 제1 하우징에 고정 될 수 있다. 제1 영역(431A)은 제1 지지부에 고정되고, 제1 지지부는 제1 하우징에 고정되므로 제1 영역(431A)은 제1 하우징에 고정될 수 있다. 일 실시예에서, 제1 지지부는 가이드 레일에 삽입될 수 있다. 예를 들어, 도 6a 및 도 6b에 도시된 것과 같이 슬라이드 인 상태 또는 슬라이드 인 상태와 슬 라이드 아웃의 중간 상태에서 제1 지지부는 가이드 레일에 삽입될 수 있다. 일 실시예에서, 제2 지지부는 표시 영역(430A)의 제2 영역(432A), 밴딩 영역(430B) 및 수납 영역(430C)을 지지할 수 있다. 제2 지지부가 지지하는 디스플레이의 영역은 전자 장치의 슬라이딩 과정에서 변형이 일어나는 부분일 수 있다. 변형이 일어나는 디스플레이의 영역을 지지할 수 있도록 제2 지지부 는 밴딩 가능하게 구성될 수 있다. 예를 들어, 제2 지지부는 디스플레이의 폭 방향(예: 도 5b의 Y 축 방향)으로 연장되고 디스플레이의 길이 방향(예: 도 5b의 X 축 방향)으로 배열되는 복수의 바(bar)를 포함할 수 있다. 디스플레이의 폭 방향과 디스플레이의 길이 방향은 서로 수직한 방향을 의미할 수 있다. 복수의 바는 각각 디스플레이와 고정 부재(미도시)를 통해 고정될 수 있다. 예를 들어, 고정 부재는 접착 물질일 수 있다. 제2 지지부는 가이드 레일에 의해 움직임이 가이드될 수 있다. 가이드 레일 은 제2 하우징의 슬라이딩 방향(예: 제1 방향(예: 도 6a의 +X 방향) 또는 제2 방향(예: 도 6a의 -X 방향))으로 연장될 수 있다. 또한, 가이드 레일은 일부 구간이 절곡되어 수납 공간으로 연장될 수 있다. 가이드 레일이 절곡된 부분에 가이드된 제2 지지부는 디스플레이의 밴딩 영역(430B)을 지지할 수 있다. 절곡되어 연장된 가이드 레일에 가이드된 제2 지지부에 의해 디스플레이가 지지됨으로 써, 디스플레이가 밴딩될 수 있다. 가이드 레일이 수납 공간으로 연장되고, 가이드 레일에 가이 드된 제2 지지부가 디스플레이를 지지함으로써 디스플레이가 수납 공간에서 인출될 수 있다. 일 실시예에서, 가이드 레일은 제2 하우징의 양 측면에 배치될 수 있다. 일 실시예에서, 제3 지지부는 제1 지지부와 제2 지지부 사이에 배치되어 디스플레이 표시 영역(430A)의 제3 영역(433A)의 일부를 지지할 수 있다. 표시 영역(430A)의 제3 영역(433A)은 제1 영역(431A) 과 제2 영역(432A)을 연결하는 영역일 수 있다. 제3 지지부에 대한 자세한 설명은 전자 장치의 폴딩 동작을 설명하는 부분에서 자세히 다루도록 한다. 도 6a 내지 도 6c에 도시된 것과 같이, 제2 하우징이 제1 하우징에 대해 제1 방향으로 슬라이딩되면, 수납 공간에 수납된 디스플레이의 일부가 수납 공간에서 출납되어 전자 장치 외부로 시인될 수 있다. 다시 설명하면 디스플레이의 표시 영역(430A)은 증가하고 디스플레이의 수납 영역(430C)은 줄어들 수 있다. 이 과정에서 가이드 레일에 의해 가이드되는 제2 지지부는 가이드 레일의 형상에 의해 디 스플레이의 밴딩 영역(430B)을 밴딩 가능하게 지지할 수 있다. 또한 밴딩 영역(430B)을 지지하는 제2 지지 부는 롤러에 의해 지지될 수 있다. 디스플레이와 제2 지지부는 상호 고정되므로 디스플레 이의 이동과 제2 지지부의 이동은 함께 이루어질 수 있다. 제2 하우징의 제1 방향 슬라이딩은 예를 들어, 별도의 기구물의 구조(예: 힌지 장치와 힌지 가이드의 걸림 구조)에 의해 제한될 수 있다. 이하에서는 제2 하우징이 제한 위치까지 슬라이딩된 상태(예: 도 6c에 도시된 상태)를 폴딩 시작 상 태라 정의하도록 한다. 폴딩 시작 상태에 대한 설명은 후술하도록 한다. 도 6a 내지 도 6c에 도시된 것과 같이, 제2 하우징이 제1 하우징에 대해 제2 방향으로 슬라이딩되면, 표시 영역(430A)이 줄어들고 수납 영역(430C)이 증가할 수 있다. 다시 설명하면 제2 하우징의 제2 방향 슬 라이딩에 의하여 표시 영역(430A)에 해당했던 디스플레이의 일 영역이 밴딩 영역(430B)이 되고, 수납 공간 으로 이동되어 수납 영역(430C)이 될 수 있다. 디스플레이의 변형 및 이동은 디스플레이에 고정된 제 2 지지부의 이동에 따라 수행될 수 있다. 다음으로 도 5a, 5b 및 도 6c 내지 도 6e를 참조하여, 전자 장치의 폴딩 동작을 설명하도록 한다. 전자 장 치의 폴딩 동작은 전자 장치에 포함된 힌지 장치에 의해 구현될 수 있다. 먼저, 제1 회전 방향 으로 제2 하우징이 제1 하우징에 대해 회전할 때의 동작을 설명한다. 제1 회전 방향은 제1 하우징 과 제2 하우징이 접히는 방향으로 회전하는 방향을 의미한다. 도 5b를 참조하면, 힌지 장치는 제1 힌지부와 제2 힌지부를 포함할 수 있다. 일 실시예에서, 힌 지 장치는 복수 개 마련될 수 있다. 도 5b에서는 힌지 장치가 제2 하우징의 한쪽 측면에 인접하 게 배치되는 것으로 도시되었으나, 힌지 장치는 나머지 한쪽 측면에도 인접하게 배치될 수 있다. 힌지 장 치는 제2 힌지부는 제1 힌지부에 대하여 회전 가능하게 설치될 수 있다. 제1 힌지부에는힌지 장치의 회전축이 삽입되는 수용부가 형성될 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치는 폴딩 과정에서 회전축이 전자 장치의 슬라이딩 방향(예: 제1 방향 또는 제2 방향)으로 이동할 수 있다. 슬라이딩 방향으로 이동하는 회전축을 수용할 수 있도록 회전축을 수용하 는 수용부도 제1 방향 또는 제2 방향으로 연장되어 형성될 수 있다. 수용부에 삽입된 회전축은 슬라이딩 방향으로 이동할 수 있다. 일 실시예에서, 제1 힌지부에 형성된 제1 기어와 제2 힌지부에 형성된 제2 기어는 서로 연 동 가능하게 맞물릴 수 있다. 제1 기어는 제1 힌지부와 일체로 형성될 수 있고, 제1 힌지부와 별도로 형성되어 제1 힌지부에 결합될 수 있다. 제2 기어는 제2 힌지부와 일체로 형성될 수 있 고, 제2 힌지부와 별도로 형성되어 제2 힌지부에 결합될 수 있다. 일 실시예에서, 제1 기어와 제2 기어는 제2 힌지부의 회전과 제1 힌지부에 대한 제2 힌지 부의 선형 이동이 동시에 이루어지도록 구성될 수 있다. 다시 설명하면 제1 기어와 제2 기어는 제2 힌지부의 회전축이 선형 이동하면서 제2 힌지부가 제1 힌지부에 대해 회전할 수 있도 록 구성될 수 있다. 예를 들어, 제1 기어 및 제2 기어 중 하나는 제1 방향 또는 제2 방향으로 연장되 는 모양으로 형성된 기어일 수 있다. 도 5b 및 도 6c에 도시된 것과 같이, 제1 힌지부의 제1 기어는 제1 방향 또는 제2 방향으로 연장된 기어일 수 있다. 제2 힌지부의 제2 기어는 제1 기어와 맞물 리고 적어도 일부가 원형으로 구성된 기어일 수 있다. 예를 들어, 제1 기어와 제2 기어는 래크 앤 피 니언 기어(rack and pinion gear)일 수 있다. 제1 기어는 래크 기어이고, 제2 기어는 피니언 기어일 수 있다. 이와 같은 제1 기어 및 제2 기어의 형상에 의해 제1 힌지부에 대해 제2 힌지부가 회전하면서 제2 힌지부가 제1 힌지부에 대해 선형 이동하여 제2 힌지부와 연결된 회전축이 수용부에서 이동할 수 있다. 일 실시예에서, 힌지 장치는 제2 하우징의 슬라이딩을 따라 제2 하우징과 함께 제1 하우징(41 0)에 대해 이동할 수 있다. 힌지 장치는 다양한 연결 관계를 통해 제2 하우징과 함께 이동할 수 있다. 예를 들어, 제2 힌지부는 제2 하우징에 결합된 가이드 레일에 형성되거나 가이드 레일 에 결합됨으로써 제2 하우징에 고정될 수 있다. 제1 힌지부의 제1 기어와 제2 힌지부(52 0)의 제2 기어가 서로 맞물린 상태이므로 제2 힌지부가 제2 하우징을 따라 이동하면 제1 힌지부 도 제2 하우징을 따라 이동할 수 있다. 일 실시예에서, 제1 하우징에 형성된 힌지 가이드 에 의해 제1 힌지부의 이동이 가이드될 수 있다. 힌지 가이드는 제1 방향 또는 제2 방향으로 연장되 어 형성될 수 있다. 예를 들어, 힌지 가이드에 의해 제1 힌지부의 이동이 제한될 수 있다. 힌지 가이 드에 의해 제1 힌지부의 이동이 제한되면 제1 힌지부와 맞물린 제2 힌지부의 이동이 중단 되고, 제2 힌지부와 고정된 제2 하우징의 슬라이딩이 중단될 수 있다. 힌지 가이드에 의해 제1 힌지부의 이동이 제한된 지점에서의 전자 장치의 상태를 폴딩 시작 상태로 이해할 수 있다. 예를 들 어, 도 6c에 도시된 전자 장치에서 제1 힌지부가 힌지 가이드에 의해 이동이 제한되므로 도 6c 에 도시된 전자 장치는 폴딩 시작 상태에 있는 것으로 이해될 수 있다. 일 실시예에서, 제1 하우징에 대한 제2 하우징의 회전은 전자 장치가 폴딩 시작 상태에 도달한 경우에 가능할 수 있다. 예를 들어, 도 6c 및 도 6d에 도시된 것과 같이, 제2 하우징이 제1 하우징에 대하여 소정 거리만큼 슬라이딩된 뒤, 제2 하우징이 제1 하우징에 대해 회전할 수 있다. 제1 하우징과 제2 하우징 에 걸림 구조가 형성될 수 있다. 예를 들어, 도 5b를 참조하면 제1 하우징의 내측면에는 제1 하우징 의 내측 방향으로 돌출된 부분인 제1 가이드 리브가 형성될 수 있다. 도 5b를 참조하면 제2 하우징 의 내측면에는 제2 하우징의 내측 방향으로 돌출된 부분인 제2 가이드 리브가 형성될 수 있다. 제2 하우징이 제1 하우징에 대해 제1 방향으로 충분히 슬라이딩되지 않은 상태에서 제1 가이드 리브 와 제2 가이드 리브는 오버랩(overlap)될 수 있다. 다시 설명하면 제1 가이드 리브가 제2 가이 드 리브의 적어도 일부를 덮은 상태가 될 수 있다. 제1 가이드 리브와 제2 가이드 리브가 오버 랩된 상태에서 제1 가이드 리브와 제2 가이드 리브의 걸림구조로 인해, 제2 하우징은 제1 하우 징에 대해 회전하지 못할 수 있다. 제2 하우징이 제1 하우징에 대하여 제1 방향으로 소정 거리 만큼 슬라이딩하여 전자 장치가 폴딩 시작 상태에 도달한 경우, 도 5b에 도시된 것과 같이, 제1 가이드 리 브가 형성되지 않은 부분(411A)에 제2 가이드 리브가 배치될 수 있다. 이 상태에서는 제1 가이드 리 브와 제2 가이드 리브가 오버랩되지 않으므로 제1 가이드 리브와 제2 가이드 리브 사이에걸림이 없어 제2 하우징이 제1 하우징에 대해 회전할 수 있다. 이상에서는 제1 하우징과 제2 하우징 사이에 걸림 구조가 형성되는 것으로 설명하였으나, 서로 상대 이동 가능하게 배치된 제1 하우징과 제2 하우징 사이에 걸림 구조가 존재하지 않을 수 있다. 이 경우, 전자 장치가 폴딩 시작 상태에 도달하지 않더라도 제2 하우징이 제1 하우징에 대해 폴딩 될 수 있다. 일 실시예에서, 도 5b 및 도 6d를 참조하면, 제2 하우징에 형성된 제2 가이드 리브는 디스플레이 를 지지할 수 있다. 폴딩 상태에서 제2 가이드 리브가 디스플레이를 지지함으로써, 디스플레이 의 들뜸 현상이 완화될 수 있다. 또한, 제2 하우징은 제2 가이드 리브가 형성되지 않은 구간 (421A)를 포함할 수 있다. 폴딩 과정에서 디스플레이에는 변형이 일어날 수 있다. 변형이 일어나는 지점에 제2 가이드 리브가 존재하는 경우 제2 가이드 리브와 디스플레이 사이에 간섭이 발생할 수 있다. 따라서, 폴딩 과정에서 디스플레이의 변형이 일어나는 부분과 대응되는 부분(421A)에는 제2 가이드 리브가 존재하지 않을 수 있다. 도 6c 및 도 6d을 참조하면 폴딩 과정에서 제2 힌지부가 제1 힌지부에 대해 회전함으로써, 제2 하우 징이 제1 하우징에 대해 회전할 수 있다. 또한, 제2 힌지부가 제1 힌지부에 대해 회전하면 제2 힌지부 및 제2 힌지부에 연결된 회전축이 제1 방향으로 이동할 수 있다. 폴딩 과정에서, 표 시 영역(430A)의 일부는 변형될 수 있다. 예를 들어, 제1 지지부과 제3 지지부의 사이 부분에서 변형 이 시작될 수 있다. 일 실시예에서, 지지 부재의 제3 영역(433A)을 지지하는 제3 지지부는 제1 서브 지지부(473-1)와 제2 서브 지지부(473-2)를 포함할 수 있다. 제2 서브 지지부(473-2)는 제1 지지부, 제2 지지부 또는 제1 서브 지지부(473-1)와 다르게 디스플레이와 고정되지 않은 부분일 수 있다. 따라서, 디스플레이가 변 형되면 제2 서브 지지부(473-2)는 디스플레이에 대해 분리될 수 있다. 어떤 실시예에서는 도 5b에 도시된 것과 같이, 제2 서브 지지부(473-2)의 길이(예: 도 5b의 Y축 길이)가 다른 지지부(예: 제1 지지부, 제2 지지부, 제1 서브 지지부(473-1))의 길이보다 작을 수 있다. 이는 제2 서브 지지부(473-2)와 힌지 장치의 간섭을 고려하여 결정된 것일 수 있다. 한편, 디스플레이는 0이 아닌 곡률 반경으로 밴딩될 수 있다. 지지 부재에 의해 움직임이 일부 구속 된 디스플레이가 소정의 곡률 반경을 가진 상태에서 변형되므로 디스플레이에 인장 응력이 발생할 수 있다. 본 문서에 개시된 다양한 실시예에서는 제3 영역(433A)을 지지하는 제3 지지부의 제2 서브 지지부 (473-2)가 디스플레이에 대해 분리되고, 제3 영역(433A)과 연결된 제2 영역(432A)은 제2 지지부에 의 해 지지될 수 있다. 디스플레이의 폴딩에 따라 제3 영역(433A)에 발생하는 인장 응력에 의해 제2 영역 (432A)의 일부가 표시 영역(430A)에서 수납 영역(430C)으로 전환될 수 있다. 다시 설명하면 디스플레이의 폴딩 과정에서 디스플레이의 일부는 수납 공간으로 인입될 수 있다. 디스플레이의 제1 영역(431A)은 제1 지지부에 고정되어 유동이 불가능하지만, 디스플레이의 제2 영역(432A)은 제2 지지부에 고 정되고 제2 지지부는 일부 구간이 절곡되어 수납 공간으로 연장된 가이드 레일에 의해 가이드되어 이 동할 수 있다. 디스플레이의 제2 영역(432A) 일부가 제2 지지부에 지지된 상태로 수납 공간으로 인입 되면서 제3 영역(433A)에 발생하는 인장 응력을 완충할 수 있다. 폴딩 시작 상태의 도 6c에서는 수납 영역 (430C)이 작거나 없지만, 폴딩이 진행되면 도 6d 및 도 6e에 도시된 것과 같이 수납 영역(430C)이 존재할 수 있 다. 일 실시에에 따르면, 디스플레이의 폴딩 과정에서 회전축이 이동하기 때문에 회전축이 고정된 상태에서 폴딩되는 경우와 비교하여 디스플레이의 곡률 반경을 일정한 수준으로 유지하면서 디스플레이 에 무리를 주지 않는 자연스러운 폴딩을 구현할 수 있다. 다양한 실시예에 따르면, 도 6e에 도시된 것과 같이, 제2 하우징은 제1 하우징과 이루는 각도가 90도 가 될 때까지 제1 하우징에 대해 폴딩될 수 있다. 이 각도는 예시에 불과하며 제2 하우징과 제1 하우 징은 다양한 각도로 폴딩될 수 있다. 다음으로 제2 하우징이 제1 하우징에 대해 제2 회전 방향으로 회전하는 동작에 대해 설명한다. 제2 회전 방향은 제1 하우징과 제2 하우징이 펼쳐지는 방향으로의 회전을 의미한다. 제2 하우징을 제1 하우징에 대해 제2 힌지부는 제1 힌지부에 대해 회전하고, 그에 따라 회 전축은 제2 방향으로 이동할 수 있다. 회전이 진행되면, 제3 지지부가 제1 지지부에 근접할 수있다. 도 6c를 참조하면, 제1 지지부에서 제3 지지부와 인접한 말단에는 제1 작용부와 제1 경 사부가 형성될 수 있다. 제1 작용부는 제1 방향에 대하여 수직하게 형성된 부분일 수 있고, 제1 경 사부는 제1 방향에 대하여 경사지게 형성된 부분일 수 있다. 또한, 제3 지지부의 제2 서브 지지부 (473-2)에서 제1 지지부에 인접한 말단에는 제1 작용부와 대응되는 제2 작용부(473-21)와 제1 경사 부와 대응되는 제2 경사부(473-22)가 형성될 수 있다. 제2 작용부(473-21)는 제1 방향에 대해 수직하게 형성된 부분이고, 제2 경사부(473-22)는 제1 방향에 대해 경사지게 형성된 부분일 수 있다. 제3 지지부가 제1 지지부에 근접하면 제1 경사부와 제2 경사부(473-22)가 접촉되기 시작할 수 있다. 제1 경사부 와 제2 경사부(473-22)는 제1 방향에 대해 경사지게 형성되고 서로 대응되도록 형성되므로 제2 경사부 (473-22)는 제1 경사부를 자연스럽게 덮을 수 있다. 도 6c에 도시된 것과 같이, 제2 회전 방향으로의 폴 딩이 완료되면 제2 경사부(473-22)가 제1 경사부를 완전히 덮게 되고, 제1 작용부와 제2 작용부 (473-21)가 서로 마주본 상태로 맞물릴 수 있다. 이 상태에서 제2 하우징을 제2 방향으로 슬라이딩시키면, 제1 작용부가 제2 작용부(473-21)를 밀어냄으로써, 제1 지지부가 제3 지지부를 제2 방향으로 가압할 수 있다. 이에 의해 제3 지지부가 제2 지지부를 제2 방향으로 가압하고, 제2 지지부에 고정된 디스플레이가 수용 공간으로 인입될 수 있다. 한편, 제2 회전 방향으로 회전하는 과정에서 가이드 레일에 제1 지지부의 일부가 삽입될 수 있다. 도 5b에 도시된 것과 같이(도 5b의 460A 참조), 가이드 레일의 일부분이 절개되는 모양으로 형성됨으로써, 가 이드 레일과 제1 지지부의 정렬이 다소 불량하더라도 제1 지지부가 가이드 레일에 정상적 으로 삽입될 수 있다. 이와 같이 가이드 레일의 일부분이 절개되는 경우에는 제3 지지부의 제1 서브 지지부(473-1)의 폭(예: 도 5b의 X 축 방향 길이)을 제2 지지부에 포함된 복수의 바의 폭(예: 도 5b의 X 축 방향 길이)보다 크게 형성할 수 있다. 전자 장치의 폴딩 과정에서 제1 서브 지지부(473-1)는 적어도 일 부가 가이드 레일에 삽입된 상태를 유지할 필요가 있다. 제1 서브 지지부(473-1)가 폴딩 과정에서 가이드 레일에서 이탈되면 폴딩 과정에서 디스플레이가 수납 공간으로 인입되는 동작이 원활하게 수행되지 않을 수 있기 때문이다. 제1 서브 지지부(473-1)의 폭을 증가시키면 가이드 레일에 일부 절개된 부분 (460A)이 존재하더라도 제1 서브 지지부(473-1)의 일부는 가이드 레일에 삽입된 상태를 유지할 수 있으므 로 폴딩 과정에서 디스플레이가 수납 공간으로 인입되는 동작이 정상적으로 수행될 수 있다. 도 7은, 회전축이 고정되도록 구성된 전자 장치와 본 문서에 개시된 다양한 실시예에 따른 전자 장치와 같이 회 전축이 이동할 수 있도록 구성된 전자 장치를 비교한 도면이다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 경우, 폴딩 과정에서 회전축이 이동할 수 있다. 예를 들어, 도 5b 및 도 6c 내지 도 6e를 통해 설명한 것과 같이, 제1 힌지부의 제1 기어와 제2 힌지부 의 제2 기어의 연동에 의하여 제2 힌지부가 제1 힌지부에 대해 회전하는 과정에서 회전축 이 이동할 수 있다. 도 7의 (a)는 회전축이 고정된 전자 장치를 폴딩시킨 경우이고, 도 7의 (b)는 본 문서에 개시된 다양한 실 시예의 전자 장치와 같이 회전축이 이동할 수 있도록 구성된 전자 장치를 폴딩시킨 경우이다. 도 7의 (b) 에서 제1 하우징의 말단과 제2 하우징의 말단 사이 거리(L2)는 도 7의 (a)에서 제1 하우징의 말 단과 제2 하우징의 말단 사이 거리(L1) 보다 크다. 이를 통해, 회전축이 이동 가능하게 구성된 경우 에 디스플레이의 정보 표시 영역(예: 도 4a의 정보 표시 영역(401A)을 더 크게 확보할 수 있음을 확인할 수 있 다. 도 8a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 제1 힌지부 및 제1 힌지부와 디스플레이 사이의 거리를 결정하는 방법을 설명하기 위한 도면이다. 도 8b는, 본 문서에 개시된 다양한 실시예에 따른 제2 하우징 의 단면 형상을 결정하는 방법을 설명하기 위한 도면이다. 일 실시예에서, 전자 장치의 안정적인 폴딩이 가능하도록 제2 힌지부의 반지름과 회전축과 디스플레 이 사이의 거리 관계를 고려하여 제2 힌지부의 형상과 회전축과 디스플레이 사이의 거리를 결정할 수 있다. 예를 들어, 도 8a를 참조하면, 전자 장치가 90도 폴딩하는 과정에서 회전축은 제2 힌지부 지름의 1/4 만큼 이동할 수 있다. 제2 힌지부의 반지름을 a라 하면 회전축의 이동 거리는 (aπ)/2로 표현될 수있다. 폴딩이 시작될 때, 디스플레이의 변형이 일어나는 지점에서 회전축까지의 거리를 b라고 할 때, (aπ)/2 = b를 만족하도록 제2 힌지부의 형상과 회전축에서 디스플레이까지의 거리를 결정할 수 있다. 이 경우 폴딩 시작 시 디스플레이의 작용점(C1)과 90도 폴딩시 디스플레이의 작용점(C2)가 일 치하게 되어 안정적인 폴딩 동작이 가능할 수 있다. 일 실시예에서, 제1 하우징과 제2 하우징의 사이 부분이 폴딩 과정에서 밀착된 상태로 유지될 수 있 도록 제2 하우징의 단면 형상을 결정할 수 있다. 제2 하우징의 단면 형상은 폴딩 과정에서 제2 힌지 부의 이동 궤적을 고려하여 결정할 수 있다. 예를 들어, 도 8b를 참조하면, 전자 장치가 폴딩되기 전, 제1 하우징과 제2 하우징이 접하는 부분 중 일 지점을 Q1라고 하고 전자 장치가 90도 폴딩된 뒤 Q1에 대응되는 지점을 Q2라 정의하도록 한다. 또한, 전자 장치가 폴딩되기 전 제2 힌지부의 반경 중 Q1의 연직 상방에 위치하는 지점을 P1이라 하고, 전자 장치가 90도 폴딩된 뒤 P1에 대응되는 지점을 P2라 정의하도록 한다. P1가 P2 지점까지 이동하는 동안 궤적은 사이클로 이드 곡선(P1-P2)로 나타날 수 있다. 이 사이클로이드 곡선(Q1-Q2)에 대하여 Q1에서 P1의 거리 차이만큼 오프셋 시킨 사이클로이드 곡선(P1-P2)을 제2 힌지부의 단면 형상으로 결정하면 전자 장치가 폴딩되는 과정에서 제1 하우징과 제2 하우징이 밀착된 상태로 유지될 수 있다. 다음으로 본 문서에 개시된 전자 장치의 다른 실시예에 대해 설명하도록 한다. 도 9 및 도 10a 내지 도 11c에 도시된 전자 장치는 도 5a 및 도 5b에서 설명한 전자 장치와 유사하게 슬라이딩과 폴딩이 가능한 전자 장치일 수 있다. 이하 설명에서는 앞에서 설명한 구성 요소와 실질적으로 동일한 구성 요소에 대해서는 동일한 부재 번 호를 사용하여 설명한다. 도 9는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 9를 참조하면, 전자 장치는 제1 하우징, 제2 하우징, 서브 하우징, 가이드 레일, 롤러 , 힌지 장치 및 지지 부재를 포함할 수 있다. 다양한 실시예에 따르면, 제2 하우징은 제1 하우징에 대하여 슬라이딩 가능하게 결합될 수 있다. 서 브 하우징은 제1 하우징에 결합되어 지지 부재를 지지할 수 있다. 서브 하우징은 제1 커버 및 제2 커버를 포함할 수 있다. 일 실시예에서 제2 커버와 서브 하우징 사이에는 롤러 이 배치될 수 있다. 또한, 서브 하우징과 제1 하우징 사이에 형성된 수납 공간에는 디스플레이 (예: 도 4a의 디스플레이)의 일부가 수납될 수 있다. 가이드 레일은 제1 하우징에 대하여 제2 하우징이 슬라이딩되는 과정에서 지지 부재의 움직임을 가이드할 수 있다. 도 9에 도시된 것과 같이 가이드 레일은 별도로 형성되어 서브 하우징의 측면 또는 제1 하우징의 내측면에 배치될 수 있 다. 어떤 실시예에서는 가이드 레일이 서브 하우징의 측면 또는 제1 하우징의 내측면에 형성될 수 있다. 롤러는 디스플레이의 밴딩 영역(예: 도 6a의 밴딩 영역(430B))을 지지하는 지지 부재 를 지지할 수 있다. 힌지 장치는 제2 하우징에 대한 제1 하우징의 회전을 구현하는 구성 요소일 수 있다. 다양한 실시예에 따르면, 힌지 장치는 제1 힌지부, 제2 힌지부 및 회전축을 포함할 수 있 다. 제1 힌지부는 서브 하우징에 형성될 수 있다. 서브 하우징은 제1 하우징에 고정 배치되므 로 서브 하우징에 형성된 제1 힌지부는 제1 하우징에 대한 제2 하우징의 슬라이딩과 무관 하게 고정될 수 있다. 제1 힌지부는 제1 기어와 수용부를 포함할 수 있다. 제1 기어는 제2 하우징의 슬라이딩 방향(예: 도 9의 X축 방향)으로 연장되어 형성될 수 있다. 수용부에는 회전축 이 삽입될 수 있다. 제2 힌지부에 대한 제1 힌지부의 회전 과정에서 회전축이 슬라이딩 방 향으로 유동할 수 있도록 수용부는 슬라이딩 방향으로 연장되어 형성될 수 있다. 도 9를 참조하면, 회전축 이 삽입되는 수용부는 가이드 레일에도 형성될 수 있다. 회전축은 서브 하우징에 형 성된 수용부와 가이드 레일에 형성된 회전축에 모두 삽입된 상태로 배치될 수 있다. 일 실시예에서, 제2 힌지부는 회전축과 결합될 수 있다. 제2 힌지부는 회전축과 별도로 형 성되어 회전축과 결합되거나 제2 힌지부와 일체로 형성될 수 있다. 제2 힌지부는 제2 기어(52 1)를 포함할 수 있다. 제2 힌지부의 제2 기어는 제1 힌지부의 제1 기어에 맞물릴 수 있다.일 실시예에서, 회전축은 가이드 레일에 형성된 수용부를 경유하여 제2 하우징의 내측면에 형성된 힌지 가이드에 삽입될 수 있다. 제1 하우징에 대한 제2 하우징의 슬라이딩은 힌지 가이 드에 회전축이 걸릴 때가지 이루어질 수 있다. 힌지 가이드에 회전축이 걸린 상태에서는 제1 하우징에 고정된 제1 힌지부에 대하여 제2 하우징이 이동할 수 없으므로 제1 하우징에 대한 제2 하우징의 슬라이딩이 더 이상 이루어지지 않을 수 있다. 다양한 실시예에 따르면 지지 부재는 제1 지지부, 제2 지지부 및 제3 지지부를 포함할 수 있다. 일 실시예에서, 제1 지지부는 디스플레이에서 변형이 일어나지 않는 부분을 지지할 수 있다. 제1 지 지부는 플레이트 형상으로 형성될 수 있다. 디스플레이와 제1 지지부는 고정 부재(미도시)를 통 해 고정될 수 있다. 예를 들어, 고정 부재는 접착성 물질일 수 있다. 일 실시예에서, 제2 지지부는 디스플레이에서 변형이 일어나는 부분을 지지할 수 있다. 변형이 일어 나는 디스플레이의 영역을 지지할 수 있도록 제2 지지부는 밴딩 가능하게 구성될 수 있다. 예를 들어, 제2 지지부는 디스플레이의 폭 방향(예: 도 9의 Y 축 방향)으로 연장되고 디스플레이의 길이 방향(예: 도 9의 X 축 방향)으로 배열되는 복수의 바(bar)를 포함할 수 있다. 복수의 바는 각각 디스플레 이와 고정 부재(미도시)를 통해 고정될 수 있다. 예를 들어, 고정 부재는 접착 물질일 수 있다. 제2 지지 부는 가이드 레일에 의해 움직임이 가이드될 수 있다. 일 실시예에서, 제3 지지부는 제1 지지부와 제2 지지부 사이에 배치될 수 있다. 제3 지지부는 디스플레이에 고정되는 부분인 제1 서브 지지부(473-1)와 디스플레이와 고정되지 않는 부분인 제2 서브 지 지부(473-2)를 포함할 수 있다. 일 실시예에서, 제2 서브 지지부(473-2)는 제1 지지부에 돌출 형성된 제1 부분(473-2A)과 제1 서브 지지부(473-1)에 돌출 형성된 제2 부분(473-2B)을 포함할 수 있다. 제1 부분(473- 2A)과 제2 부분(473-2B)은 모두 디스플레이와 고정되지 않은 부분일 수 있다. 어떤 실시예에서는 도 9에 도시된 것과 같이 제1 부분(473-2A)은 제1 지지부의 중간 부분에 형성될 수 있다. 제2 부분(473-2B) 중 제 1 부분(473-2A)과 마주하는(또는 대응하는) 부분에는 지지홈이 형성될 수 있다. 또한, 지지홈과 대응 하는 부분에서 제1 서브 지지부(473-1)에서 제1 방향(예: 도 9의 +X 방향)으로 경사지게 돌출 형성된 경사 지지 부가 포함될 수 있다. 따라서, 제1 지지부가 제3 지지부에 접근하면 제1 지지부에 형성된 제1 부분(473-2A)이 제1 서브 지지부(473-1)에 형성된 경사 지지부에 근접할 수 있다. 폴딩 과정에서 제1 부분(473-2A)은 경사 지지부를 가압할 수 있다. 제1 부분(473-2A)이 경사 지지부를 가압하면 경사 지 지부가 포함된 제1 서브 지지부(473-1)가 가압되고, 제1 서브 지지부(473-1)는 제2 지지부를 가압할 수 있다. 일 실시예에서, 서브 하우징은 제1 하우징에 대한 제2 하우징의 슬라이딩에 따라 이동하는 경사 지지부가 수용될 수 있도록 형성된 경사 지지부 수용홈을 포함할 수 있다. 도 9에 도시된 전자 장치는 디스플레이가 제2 하우징에 고정되고 디스플레이가 일부 수납되는 수납 영역이 제1 하우징과 서브 하우징 사이에 위치한다는 점을 제외하고는 도 5a에 도시된 전자 장치의 슬라이딩 동작과 유사하다. 따라서, 전자 장치의 슬라이딩 동작에 대한 설명은 도 6a 내지 도 6c의 설명을 참조하도록 한 다. 도 10a 내지 도 10c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 폴딩되는 과정에서 힌지 장치(50 0)의 동작을 보여주는 도면이다. 전자 장치가 폴딩되는 모습은 도 5a에 설명한 전자 장치와 유사하므로 전체적 인 모습은 도 6c 및 도 6e를 참조할 수 있다. 제2 하우징이 제1 하우징에 대해 회전하면, 제2 힌지부가 제1 힌지부에 대해 회전할 수 있 다. 이 때, 제1 기어와 제2 기어의 연동으로 인하여 회전축이 이동할 수 있다. 도 10a에 도시된 것과 같이 폴딩 전 상태에서 제2 서브 지지부(473-2)의 제1 부분(473-2A)은 제2 부분(473- 2B)의 지지홈에 삽입된 상태일 수 있다. 이 상태에서 제1 부분(473-2A)은 경사 지지부에 오버랩될 수 있다. 폴딩이 시작되면 제1 부분(473-2A)이 경사 지지부를 가압할 수 있다. 폴딩에 의해 제1 지지부 가 회전하면 제1 지지부에 돌출 형성된 제1 부분(473-2A)이 경사 지지부를 가압할 수 있다. 도 10b 및 도 10c에 도시된 것과 같이, 제1 부분(473-2A)은 디스플레이에 대해 분리될 수 있다. 제1 부분(473- 2A)이 경사 지지부를 가압(F1)하면 경사 지지부의 형상으로 인하여 경사 지지부는 제2 지지부 를 가압(F2)할 수 있다. 제2 지지부는 가이드 레일을 따라 이동하고, 제2 지지부에 고정된 디스플레이가 이동할 수 있다. 제2 지지부의 이동으로 디스플레이의 수납 영역이 증가할 수 있다(도 6d 및 도 6e의 수납 영역(430C) 증가 참조). 다시 설명하면, 디스플레이의 폴딩 과정에서 디스플레 이의 일부는 수납 공간으로 인입될 수 있다. 제2 지지부는 일부 구간이 절곡되어 수납 공간으로 연장 된 가이드 레일에 의해 가이드되어 이동할 수 있다. 디스플레이의 일부가 제2 지지부에 지지된 상태로 수납 공간으로 인입되면서 디스플레이 변형에 의해 발생하는 인장 응력을 완충할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치(예: 도 4a의 전자 장치)는, 제1 하우징(예: 도 4b의 제 1 하우징), 상기 제1 하우징에 대하여 제1 방향으로 슬라이딩 가능하게 결합되는 제2 하우징(예: 도 4b의 제2 하우징), 일단이 상기 제1 하우징 및 상기 제2 하우징 중 하나에 고정되어 상기 제2 하우징의 슬라이 딩에 따라 상기 전자 장치의 외부로 보여지는 부분인 정보 표시 영역이 증감하는 플렉서블(flexible) 디스플레 이(예: 도 4b의 디스플레이) 및 상기 제2 하우징을 상기 제1 하우징에 대해 회전 가능하게 연결하는 힌지 장치(예: 도 5b의 힌지 장치)를 포함할 수 있고, 상기 힌지 장치의 회전축(예: 도 5b의 회전축)은, 상기 제1 하우징에 대한 상기 제2 하우징의 회전 과정에서 상기 제1 방향으로 이동할 수 있도록 상기 제1 방향 으로 연장되어 형성된 수용부(예: 도 5b의 수용부)에 삽입될 수 있다. 또한, 상기 힌지 장치는, 상기 수용부가 형성된 제1 힌지부(예: 도 5b의 제1 힌지부)와, 상기 제1 힌지부 에 대하여 회전 가능하도록 상기 제1 힌지부에 연결되는 제2 힌지부(예: 도 5b의 제2 힌지부)를 포함할 수 있다. 또한, 상기 힌지 장치는, 상기 제1 힌지부에 형성된 제1 기어(예: 도 5b의 제1 기어)와 상기 힌지 장치의 제2 힌지부에 형성된 제2 기어(예: 도 5b의 제2 기어)가 맞물리는 구조를 포함할 수 있고, 상기 제2 기어 가 맞물려 회전하면 상기 회전축이 상기 제1 방향을 따라 이동할 수 있다. 또한, 상기 제1 기어 및 상기 제2 기어 중 적어도 하나는, 상기 제1 방향으로 연장된 기어일 수 있다. 또한, 상기 제1 기어는 래크 기어(rack gear)일 수 있고, 상기 제2 기어는 피니언 기어(pinion gear)일 수 있다. 또한, 상기 디스플레이는, 상기 전자 장치의 외부로 노출되는 표시 영역(예: 도 6a의 표시 영역(430A))과 상기 전자 장치 내부에 수납되는 수납 영역(예: 도 6a의 수납 영역(430C)) 및 상기 표시 영역과 상기 수납 영역을 연 결하고 밴딩된 영역인 밴딩 영역(예: 도 6a의 밴딩 영역(430B)) 중 적어도 하나를 포함할 수 있다. 또한, 상기 디스플레이를 지지하는 지지 부재(예: 도 5a의 지지 부재)를 더 포함할 수 있고, 상기 지지 부 재는, 상기 표시 영역의 제1 영역을 지지하는 제1 지지부(예: 도 5a의 제1 지지부), 상기 표시 영역의 제2 영역, 상기 디스플레이의 밴딩 영역 및 상기 디스플레이의 수납 영역을 지지하는 제2 지지부(예: 도 5a의 제2 지지부), 및 상기 표시 영역의 제1 영역과 상기 표시 영역의 제2 영역을 연결하는 제3 영역을 적어도 일부 지지하는 제3 지지부(예: 도 5a의 제3 지지부)를 포함할 수 있다. 또한, 상기 제2 지지부는, 상기 디스플레이의 폭 방향으로 연장되어 상기 폭 방향에 대해 수직한 상기 디스플레 이의 길이 방향을 따라 배열된 복수의 바(bar)를 포함할 수 있다. 또한, 상기 지지 부재의 제1 지지부와 제2 지지부는 상기 디스플레이에 고정될 수 있고, 상기 지지 부재의 제3 지지부는 상기 디스플레이에 고정되는 제1 서브 지지부(예: 도 5b의 제1 서브 지지부(473-1))와 상기 디스플레 이에 대하여 분리되는 제2 서브 지지부(예: 도 5b의 제2 서브 지지부(473-2))를 포함할 수 있다. 또한, 상기 힌지 장치는, 상기 제1 힌지부와 상기 제2 힌지부가 상기 제2 하우징의 슬라이딩에 따라 함께 이동 하도록 구성될 수 있고, 상기 제1 하우징에 형성된 힌지 가이드(예: 도 5b의 힌지 가이드)에 의해 상기 제 1 힌지부의 슬라이딩이 제한되고, 상기 제1 힌지부의 슬라이딩이 제한된 상태에서 상기 제2 힌지부가 상기 제1 힌지부에 대해 회전함으로써 상기 제2 하우징이 상기 제1 하우징에 대해 회전할 수 있다. 또한, 상기 제2 하우징에 결합되는 서브 하우징(예: 도 5a의 서브 하우징)을 더 포함할 수 있고, 상기 디 스플레이의 수납 영역은, 상기 디스플레이가 상기 제2 하우징과 상기 서브 하우징에 의해 형성된 수납 공간에 수납된 영역일 수 있다. 또한, 상기 지지 부재의 움직임을 가이드하는 가이드 레일(예: 도 5a의 가이드 레일)을 더 포함할 수 있고, 상기 가이드 레일은, 적어도 일부분이 절곡되고 상기 수납 공간으로 연장되도록 형성될 수 있다. 또한, 상기 제1 지지부는, 상기 제3 지지부와 인접한 말단에 상기 제1 방향에 대하여 수직하게 형성된 제1 작용 부(예: 도 6c의 제1 작용부)와 상기 제1 방향에 대하여 경사지게 형성된 제1 경사부(예: 도 6c의 제1 경 사부)를 포함할 수 있고, 상기 제3 지지부의 제2 서브 지지부는, 상기 제1 지지부와 인접한 말단에 상기 제1 작용부와 대응하도록 형성된 제2 작용부(예: 도 6c의 제2 작용부(473-21))와 상기 제1 경사부와 대응하도록 형성된 제2 경사부(예: 도 6c의 제2 경사부(473-22))를 포함할 수 있다. 또한, 상기 힌지 장치는, 상기 제1 힌지부(예: 도 9의 제1 힌지부)가 상기 제1 하우징에 대해 고정된 위치 에 배치될 수 있고, 상기 제2 하우징에 형성된 힌지 가이드(예: 도 9의 힌지 가이드)와 상기 힌지 가이드 에 적어도 일부가 삽입된 상기 제2 힌지부(예: 도 9의 제2 힌지부)의 걸림에 의해 상기 제2 힌지부에 대한 상기 제2 하우징의 슬라이딩이 제한되고, 상기 제2 하우징의 슬라이딩이 제한된 상태에서 상기 제2 힌지부가 상 기 제1 힌지부에 대해 회전함으로써 상기 제2 하우징이 상기 제1 하우징에 대해 회전할 수 있다. 또한, 상기 제3 지지부의 제2 서브 지지부는, 상기 제1 지지부에 돌출 형성된 제1 부분(예: 도 9의 제1 부분 (473-2A))과 상기 제1 부분과 대응되도록 형성된 지지홈(예: 도 9의 지지홈)을 포함하는 제2 부분(예: 도 9의 제2 부분(473-2B))을 포함할 수 있다. 또한, 상기 제2 부분은, 상기 제3 지지부의 제1 서브 지지부에 일체로 형성될 수 있다. 또한, 상기 제2 부분은, 상기 지지홈과 대응하는 부분에서 상기 제1 방향에 대하여 경사진 방향으로 상기 제1 서브 지지부에서 돌출 형성된 경사 지지부를 포함할 수 있다. 또한, 상기 제1 하우징에 결합되는 서브 하우징을 더 포함할 수 있고, 상기 서브 하우징은, 상기 제2 하우징의 슬라이딩에 따라 상기 제1 방향으로 이동하는 상기 경사 지지부(예: 도 9의 경사 지지부)가 수용되도록 상 기 제1 방향으로 연장되어 형성된 경사 지지부 수용홈(예: 도 9의 경사 지지부 수용홈)을 더 포함할 수 있 다. 또한, 상기 제1 하우징에 결합되는 서브 하우징을 더 포함할 수 있고, 상기 디스플레이의 수납 영역은, 상기 디 스플레이가 상기 제1 하우징과 상기 서브 하우징에 의해 형성된 수납 공간에 수납된 영역일 수 있다. 또한, 상기 지지 부재의 움직임을 가이드하는 가이드 레일을 더 포함할 수 있고, 상기 가이드 레일은, 적어도 일부분이 절곡되고 상기 수납 공간으로 연장되도록 형성될 수 있다. 그리고 본 명세서와 도면에 개시된 본 문서에 개시된 실시예들은 본 문서에 개시된 실시예에 따른 기술 내용을 쉽게 설명하고 본 문서에 개시된 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 문서에 개시된 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 문서에 개시된 다양한 실시예의 범위는 여기에 개시 된 실시예들 이외에도 본 문서에 개시된 다양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변 형된 형태가 본 문서에 개시된 다양한 실시예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0085378", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2a 및 도 2b는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 다양한 상태를 설명하기 위한 도면이다. 도 2c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 3a는, 본 문서에 개시된 다양한 실시예에 따른 도 2a에 도시된 전자 장치를 A-A선을 따라 절개한 단면도이다. 도 3b는, 본 문서에 개시된 다양한 실시예에 따른 도 2b에 도시된 전자 장치를 B-B선을 따라 절개한 단면도이다. 도 4a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 사시도이다. 도 4b는, 도 4a에 도시된 전자 장치가 슬라이딩된 상태의 사시도이다. 도 4c는, 도 4b에 도시된 전자 장치가 폴딩된 상태의 사시도이다. 도 4d는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 폴딩 동작을 측면에서 바라본 도면이다. 도 5a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 5b는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 일부 구성 요소를 분리하여 도시한 도면이다. 도 6a 내지 도 6e는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 슬라이딩 및 폴딩 동작을 설명하기 위한 도면이다. 도 7은, 회전축이 고정되도록 구성된 전자 장치와 본 문서에 개시된 다양한 실시예에 따른 전자 장치와 같이 회 전축이 이동할 수 있도록 구성된 전자 장치를 비교한 도면이다. 도 8a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 제1 힌지부 및 제1 힌지부와 디스플레이 사이의 거리를 결정하는 방법을 설명하기 위한 도면이다. 도 8b는, 본 문서에 개시된 다양한 실시예에 따른 제2 하우징의 단면 형상을 결정하는 방법을 설명하기 위한 도 면이다. 도 9는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 10a 내지 도 10c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 폴딩되는 과정에서 힌지 장치(50 0)의 동작을 보여주는 도면이다."}
