{"patent_id": "10-2022-0154068", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0072459", "출원번호": "10-2022-0154068", "발명의 명칭": "인공 지능 검사 및 머신 비전 검사를 지원하는 하이브리드 제품 결함 검사 장치, 제품 결함", "출원인": "주식회사 로운시스템", "발명자": "강도원"}}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 결함 검사 명령에 대한 라이브러리를 제공하는 명령 라이브러리 제공부; 사용자의 입력에 기초하여 복수의 검사 명령의 시계열적인 조합을 포함하는 검사 레시피를 생성하는 검사 레시피 생성부; 생성된 검사 레시피를 순차적으로 수행하는 프로그래밍 코드를 생성하는 프로그래밍 코드 생성부; 및생성된 프로그래밍 코드에 의한 검사 레시피에 따라 카메라로부터 취득된 수집 데이터로부터 제품 결함을 검출하는 결함 검사부를 포함하는 제품 결함 검사 장치."}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 결함 검사부는 정형적 제품 결함 및 비정형적 제품 결함을 검출하고,정형적 결함은 룰(rule) 기반의 검사 레시피에 의해 검출되고,비정형적 결함은 머신러닝 기반의 결함 판정 학습 모델에 의해 검출되는 제품 결함 검사 장치."}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 결함 검사부는, 검사 대상의 제품에 대하여 카메라로부터 취득된 수집 데이터로부터 제품의 결함을 검출하는 카메라 모드와 시뮬레이션을 위하여 카메라로부터 취득된 샘플 데이터로부터 제품의 결함을 검출하는 시뮬레이션 프로세스를 수행하는 시뮬레이션 모드 중 하나의 모드를 사용자의 선택에 따라 선택적으로 제공하는 제품결함 검사 장치."}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 검사 레시피 생성부는 GUI(Graphic User Interface) 화면에 대한 사용자의 드래그 앤 드롭(drag anddrop) 조작에 의해 검사 레시피를 생성하는 제품 결함 검사 장치."}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,복수의 결함 검사 명령은, 수집 데이터의 좌표를 기준 위치에 대한 좌표로 변환하는 좌표 변환 명령;제품 형상의 에지(edge)를 검출하여 에지의 패턴 매칭을 통하여 기준 위치를 설정하는 위치 설정 명령;길이, 원, 각도 및 호와 관련된 크기를 측정하는 측정 명령;마스터 이미지를 기준으로 형상을 비교하는 형상 비교 명령;바코드, 매트릭스 코드 및 QR 코드 중 하나 이상을 포함하는 식별 코드를 검출하는 코드 검출 명령; 및 등록된 문자를 인식하고, 문자를 판별하는 문자 인식 및 판별 명령 을 포함하는 제품 결함 검사 장치.공개특허 10-2024-0072459-3-청구항 6 제1항에 있어서,상기 명령 라이브러리 제공부는 복수의 결함 검사 명령에 대한 상세 설정(길이, 호 반지름, 원 반지름, 각도의양품 범위 설정)을 제공하는 제품 결함 검사 장치."}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 머신러닝 기반의 결함 판정 학습 모델은,파이썬 프레임워크로 생성된 머신러닝 기반의 제1 결함 판정 학습 모델을 제공하는 단계; 및제1 결함 판정 학습 모델을 ONNXOpen Neural Network eXchange)에 의해 윈도우 운영체제 상에서 런타임 동작이가능한 머신러닝 기반의 제2 결함 판정 학습 모델로 변환하는 단계를 포함하는 단계들에 의해 구축되는 제품 결함 검사 장치."}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,제2 결함 판정 학습 모델은 윈도우 운영체제로 동작하는 범용 PC 상에서 제품 결함 이미지를 포함하는 샘플 데이터에 의해 학습되고, 검사 대상 제품의 수집 데이터를 범용 PC 상의 제2 결함 판정 학습 모델에 입력함으로써 제품 결함이 검출되는제품 결함 검사 장치."}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제품 결함 검사 장치에 의해 제품 결함을 검사하기 위한 제품 결함 검사 방법으로서,복수의 결함 검사 명령에 대한 라이브러리를 제공하는 명령 라이브러리 제공 단계; 사용자의 입력에 기초하여 복수의 검사 명령의 시계열적인 조합을 포함하는 검사 레시피를 생성하는 검사 레시피 생성 단계; 생성된 검사 레시피를 순차적으로 수행하는 프로그래밍 코드를 생성하는 프로그래밍 코드 생성 단계; 및생성된 프로그래밍 코드에 의한 검사 레시피에 따라 카메라로부터 취득된 수집 데이터로부터 제품 결함을 검출하는 결함 검사 단계를 포함하는 제품 결함 검사 방법."}
{"patent_id": "10-2022-0154068", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 기재된 제품 결함 검사 방법을 컴퓨터에 의해 수행시키기 위해 기록 매체에 저장된 프로그램."}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 의하면, 복수의 결함 검사 명령에 대한 라이브러리를 제공하는 명령 라이브러리 제공부; 사용자의 입력에 기초하여 복수의 검사 명령의 시계열적인 조합을 포함하는 검사 레시피를 생성하는 검사 레시피 생성부; 생성된 검사 레시피를 순차적으로 수행하는 프로그래밍 코드를 생성하는 프로그래밍 코드 생성부; 및 생 성된 프로그래밍 코드에 의한 검사 레시피에 따라 카메라로부터 취득된 수집 데이터로부터 제품 결함을 검출하는 결함 검사부를 포함하는 제품 결함 검사 장치가 제공될 수 있다."}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 제품 결함 검사 기술에 관한 것으로, 보다 상세하게는 인공 지능 검사 및 머신 비전 검사를 지원하는 하이브리드 제품 결함 검사 장치, 제품 결함 검사 방법 및 기록 매체에 저장된 프로그램에 관한 것이다."}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 자동차, 전자기기, 디스플레이, 반도체, 식음료, 스포츠 등 산업 분야 전반에, 머신 비전(machine vision), 로봇, 센서, PLC, 컴퓨터 등의 요소가 결합되어 산업 자동화(industrial automation)가 점차 가속화 되고 있다. 머신 비전이란, 물체를 검사하거나 측정하기 위해, 사람이 육안으로 판단하던 기존의 방식을 대신하여, 카메라 (시각 인식), CPU, SW를 통해 산업을 자동화시켜주는 것을 의미한다. 머신 비전은 최종 소비자에 의해 활용되기 보다 산업용으로 많이 활용된다. 효율성을 극대화시키기 위해 머신 비전은 더 작은 객체를 인식해야 하고, 고속 으로 움직이는 물체를 인식해야 하며, 단일 객체가 아닌 복수의 객체에 대한 판독이 동시에 가능해야 한다. 머신 비전용 카메라를 통해 추출된 이미지는 비전 소프트웨어를 통하여 해석된다. 비전 소프트웨어는 추출한 이 미지로부터 객체의 패턴(Pattern)을 매칭하거나, 점, 선 또는 면을 피팅(Fitting)하거나, 컬러를 구분하거나, 대상을 측정(Gauging)하기도 하고, 로봇 가이드를 위해 위치정보를 제공하거나, 객체에 표시된 1D, 2D 바코드를 판독하거나 광학문자판독(OCR)을 수행하기도 한다. 이러한 과정을 통해 물체가 검사, 측정 또는 판독되어 산업 의 자동화가 구현될 수 있다."}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래 기술에서는 머신 비전을 이용한 제품 결함 검사 장치를 제조 설비에 설치하기 위해서는 해당 제조 설비, 제조 공정에 따라 설계된 레시피에 의해 검사를 수행하는 프로그램을 개발자가 작성하고, 설계 레시피에 따라 개발된 검사 프로그램을 제품 결함 검사 장치에 설치하고 카메라 장치, 조명 장치 등의 다른 장치들과의 연결 및 상세 설정을 일일이 수행할 필요가 있었다. 또한, 인공 지능을 이용한 머신 비전을 지원하는 제품 결함 검사 장치의 경우에, 엣지 단말(범용 PC)이 카메라, 조명과 연결되고 카메라부터 취득된 이미지 데이터를 비전 검사 클라우드 서버로 전송하며, 비전 검사 클라우드 서버에서 인공 지능을 이용하여 제품 결함을 검사한 결과를 엣지 단말에 전송하도록 구성되어 있다. 이러한 종 래 기술의 인공 지능을 이용한 머신 비전을 지원하는 제품 결함 검사 장치는 클라우드 서버에서 인공 지능 알고 리즘을 제공하기 때문에, 엣지 단말에서 검사 레시피 또는 검사 알고리즘의 수정이 어렵고, 클라우드 서버로의 전송 및 검사 결과 데이터의 수신까지의 시간 지연에 따라 실시간으로 결함 검사를 수행하기 어려웠다. 본 발명은 상기와 같은 종래 기술의 문제점을 해결하기 위하여 도출된 것으로서, 본 발명이 해결하기 위한 과제 는, 검사 레시피 및 결함 검사 알고리즘의 수정 및 변경이 용이하고, 결함 검사를 실시간으로 수행할 수 있는 하이브리드 제품 결함 검사 장치, 제품 결함 검사 방법 및 프로그램을 제공하는 것이다."}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 수단으로서, 본 발명의 일 실시예에 따른 제품 결함 검사 장치는, 복수의 결함 검 사 명령에 대한 라이브러리를 제공하는 명령 라이브러리 제공부; 사용자의 입력에 기초하여 복수의 검사 명령의 시계열적인 조합을 포함하는 검사 레시피를 생성하는 검사 레시피 생성부; 생성된 검사 레시피를 순차적으로 수 행하는 프로그래밍 코드를 생성하는 프로그래밍 코드 생성부; 및 생성된 프로그래밍 코드에 의한 검사 레시피에 따라 카메라로부터 취득된 수집 데이터로부터 제품 결함을 검출하는 결함 검사부를 포함할 수 있다. 일 실시예에서, 상기 결함 검사부는 정형적 제품 결함 및 비정형적 제품 결함을 검출하고, 정형적 결함은 룰 (rule) 기반의 검사 레시피에 의해 검출되고, 비정형적 결함은 머신러닝 기반의 결함 판정 학습 모델에 의해 검 출될 수 있다. 일 실시예에서, 상기 결함 검사부는, 검사 대상의 제품에 대하여 카메라로부터 취득된 수집 데이터로부터 제품 의 결함을 검출하는 카메라 모드와 시뮬레이션을 위하여 카메라로부터 취득된 샘플 데이터로부터 제품의 결함을 검출하는 시뮬레이션 프로세스를 수행하는 시뮬레이션 모드 중 하나의 모드를 사용자의 선택에 따라 선택적으로 제공할 수 있다. 일 실시예에서, 상기 검사 레시피 생성부는 GUI(Graphic User Interface) 화면에 대한 사용자의 드래그 앤 드롭 (drag and drop) 조작에 의해 검사 레시피를 생성할 수 있다. 일 실시예에서, 복수의 결함 검사 명령은, 수집 데이터의 좌표를 기준 위치에 대한 좌표로 변환하는 좌표 변환 명령; 제품 형상의 에지(edge)를 검출하여 에지의 패턴 매칭을 통하여 기준 위치를 설정하는 위치 설정 명령; 길이, 원, 각도 및 호와 관련된 크기를 측정하는 측정 명령; 마스터 이미지를 기준으로 형상을 비교하는 형상 비교 명령; 바코드, 매트릭스 코드 및 QR 코드 중 하나 이상을 포함하는 식별 코드를 검출하는 코드 검출 명령; 및 등록된 문자를 인식하고, 문자를 판별하는 문자 인식 및 판별 명령을 포함할 수 있다. 일 실시예에서, 상기 명령 라이브러리 제공부는 복수의 결함 검사 명령에 대한 상세 설정(길이, 호 반지름, 원 반지름, 각도의 양품 범위 설정)을 제공할 수 있다. 일 실시예에서, 상기 머신러닝 기반의 결함 판정 학습 모델은, 파이썬 프레임워크로 생성된 머신러닝 기반의 제 1 결함 판정 학습 모델을 제공하는 단계; 및 제1 결함 판정 학습 모델을 ONNXOpen Neural Network eXchange)에 의해 윈도우 운영체제 상에서 런타임 동작이 가능한 머신러닝 기반의 제2 결함 판정 학습 모델로 변환하는 단계 를 포함하는 단계들에 의해 구축될 수 있다. 일 실시예에서, 제2 결함 판정 학습 모델은 윈도우 운영체제로 동작하는 범용 PC 상에서 제품 결함 이미지를 포 함하는 샘플 데이터에 의해 학습되고, 검사 대상 제품의 수집 데이터를 범용 PC 상의 제2 결함 판정 학습 모델 에 입력함으로써 제품 결함이 검출될 수 있다. 상술한 과제를 해결하기 위한 다른 수단으로서, 본 발명의 일 실시예에 따른 제품 결함 검사 방법은, 제품 결함 검사 장치에 의해 제품 결함을 검사하기 위한 제품 결함 검사 방법으로서, 복수의 결함 검사 명령에 대한 라이 브러리를 제공하는 명령 라이브러리 제공 단계; 사용자의 입력에 기초하여 복수의 검사 명령의 시계열적인 조합 을 포함하는 검사 레시피를 생성하는 검사 레시피 생성 단계; 생성된 검사 레시피를 순차적으로 수행하는 프로 그래밍 코드를 생성하는 프로그래밍 코드 생성 단계; 및 생성된 프로그래밍 코드에 의한 검사 레시피에 따라 카 메라로부터 취득된 수집 데이터로부터 제품 결함을 검출하는 결함 검사 단계를 포함할 수 있다. 상술한 과제를 해결하기 위한 다른 수단으로서, 본 발명의 일 실시예에 따른 프로그램은, 상기 결함 검사 방법 을 컴퓨터에 의해 수행시키기 위해 기록 매체에 저장된 프로그램을 포함할 수 있다."}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 복수의 결함 검사 명령에 대한 라이브러리를 제공하고, 사용자의 입력에 기초하 여 복수의 검사 명령의 시계열적인 조합을 포함하는 검사 레시피를 생성하며, 생성된 검사 레시피를 순차적으로 수행하는 프로그래밍 코드를 생성하고, 생성된 프로그래밍 코드에 의한 검사 레시피에 따라 카메라로부터 취득 된 수집 데이터로부터 제품 결함을 검출함으로써, 검사 레시피 및 결함 검사 알고리즘의 수정 및 변경이 용이하 고, 결함 검사를 실시간으로 수행할 수 있는 하이브리드 제품 결함 검사 장치, 제품 결함 검사 방법 및 프로그 램이 제공될 수 있다."}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명하기로 한다. 본 발명의 실시예들은 당해 기술 분야에서 통상의 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위하 여 제공되는 것이며, 하기 실시예는 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 하기 실시예에 한정되는 것은 아니다. 오히려, 이들 실시예는 본 개시를 더욱 충실하고 완전하게 하고, 당업자에게 본 발명의 사상을 완전하게 전달하기 위하여 제공되는 것이다. 여기에 설명되는 다양한 실시예는 예를 들어, 소프트웨어, 하드웨어 또는 이들의 조합된 것을 이용하여 컴퓨터 또는 이와 유사한 장치로 읽을 수 있는 기록매체 내에서 구현될 수 있다. 하드웨어적인 구현에 의하면, 여기에 설명되는 실시예는 ASICs (application specific integrated circuits), DSPs (digital signal processors), DSPDs (digital signal processing devices), PLDs (programmable logic devices), FPGAs (field programmable gate arrays, 프로세서(processors), 제어기(controllers), 마이크로 컨 트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기능 수행을 위한 전기적인 유닛 중 적어도 하나를 이용하여 구현될 수 있다. 소프트웨어적인 구현에 의하면, 절차나 기능과 같은 실시예들은 적어도 하나의 기능 또는 작동을 수행하게 하는 별개의 소프트웨어 모듈과 함께 구현될 수 있다. 소프트웨어 코드는 적절한 프로그램 언어로 쓰여진 소프트웨어 어플리케이션에 의해 구현될 수 있다. 도 1은 본 발명의 일 실시예에 따른 제품 결함 검사 장치와 다른 관련 장치와의 연결 관계를 나타내는 도면이다. 도 1을 참조하면, 제품 결함 검사 장치는 조명 장치, 카메라 장치, 전원 공급 장치, 피검 사체 이송 장치, 저장 장치, 표시 장치 및 단말기과 연결될 수 있다. 조명 장치는 피검사체(미도시)의 상부 측에 설치되고, 해당 피검사체의 복수의 면들 및 상부 표면에 광을 조사하는 기능을 수행하는 바, 해당 피검사체의 제1 면과 상부 표면에 광을 조사할 수 있다. 조명 장치는 도면에 도시되지 않았지만, 별도의 지그(jig) 또는 지지대 등을 통해 해당 피검사체의 4개의 측면들과 상부 표면에 광이 조사되도록 해당 피검사체의 각 측면 상부로 일정거리 이격되어 일정 각도로 기울어 져 설치될 수 있다. 조명 장치는 해당 피검사체에 면광을 조사할 수 있도록 다수의 LED(Light Emitting Diode)가 어레이 형태 로 이루어짐이 바람직하지만, 이에 국한하지 않으며, 예컨대, 형광등, 백열등, 할로겐등, 수은등, 네온관등, 나 트륨등, 메탈 할라이드 램프 또는 EL(Electro-Luminescent) 램프 중 적어도 하나를 포함하여 이루어질 수도 있 다. 또한, 조명 장치는 예컨대, 액정 디스플레이(Liquid Crystal Display, LCD), 발광다이오드 디스플레이 (Light Emitting Diode, LED), 박막 트랜지스터 액정 디스플레이(Thin Film Transistor-Liquid Crystal Display, TFT LCD), 유기 발광 다이오드(Organic Light Emitting Diode, OLED), 플렉시블 디스플레이(Flexible Display), 플라즈마 디스플레이 패널 (Plasma Display Panel, PDP), 표면 얼터네이트 라이팅(ALiS), 디지털 광 원 처리(DLP), 실리콘 액정(LCoS), 표면 전도형 전자방출소자 디스플레이(SED), 전계방출 디스플레이(FED), 레 이저 TV(양자 점 레이저, 액정 레이저), 광유전성 액체 디스플레이(FLD), 간섭계 변조기 디스플레이(iMoD), 두 꺼운 필름 유전체 전기(TDEL), 양자점 디스플레이(QD-LED), 텔레스코픽 픽셀 디스플레이(TPD), 유기발광 트랜지 스터(OLET), 및/또는 레이저 형광 디스플레이(LPD) 중에서 적어도 하나를 포함하여 이루어질 수도 있으며, 이에한정되는 것은 아니고 해당 피검사체에 면광을 조사할 수 있는 것이라면, 어떠한 것이라도 포함할 수 있다. 피검사체는 다수의 면들을 가진 다면체 형태의 물품으로 이루어질 수 있고, 다수의 면들(예컨대, 좌측면, 우측 면, 전면, 후면, 평면, 저면 등)을 가진 다면체 형태의 물체(또는 물품)라면 어느 것이든 적용가능하다. 카메라 장치는 해당 피검사체의 진행 방향에 수직으로 일정거리 이격되어 설치되어 있으며, 조명 장치 로부터 출력된 각 광이 해당 피검사체에 순차적으로 조사된 상태에서 라인(Line) 단위로 해당 피검사체의 상부 표면 영상을 스캔(Scan)하여 이미지 데이터 또는 동영상 데이터를 포함하는 수집 데이터를 획득하는 기능 을 수행한다. 카메라 장치는 조명 장치가 광을 조사한 상태에서 해당 피검사체의 촬상면을 촬영하고, 촬영된 해당 피검사체의 라인스캔 영상을 제어모듈로 전송한다. 이러한 카메라 장치은 영역(Area) 단위로 영상을 획득하지 않으며, 하나의 라인(Line) 즉 일차원 선형 구 조의 CMOS(Complementary Metal Oxide Semiconductor) 또는 CCD(Charge Coupled Device) 이미지 센서를 통해 라인(Line) 단위로 스캔하여 2차원 이미지를 획득하는 방식의 카메라로서, 카메라 장치에 의해 해당 피검 사체의 영상이 생성되기 위해서는 카메라 장치 혹은 해당 피검사체가 일정한 속도로 이동될 수 있다. 제품 결함 검사 장치는 본 발명의 일 실시예에 따른 인공 지능 검사 및 머신 비전 검사를 지원하는 하이브 리드 제품 결함 검사 장치이다. 제품 결함 검사 장치는 카메라로부터 취득된 피검사체의 수집 데이터를 바 탕으로 룰베이스(Rule base) 기반의 머신비전(Machine Vision) 알고리즘 또는 인공 지능의 결함 검사 판정 알고 리즘을 이용하여 해당 피검사체의 결함 검사를 수행하는 기능을 수행할 수 있다. 제품 결함 검사 장치에서 룰베이스 기반의 머신비전 알고리즘은 예컨대, 패턴 매칭(Pattern Matching), 점 /선/면 피팅(Fitting), 에지(Edge), 컬러(Color), 및/또는 위치(Location) 알고리즘 중 적어도 하나의 알고리 즘을 포함할 수 있다. 제품 결함 검사 장치에서 수행하는 해당 피검사체의 외형 검사는 예컨대, 제품에 결함이 없는 양품과 제품 에 결함이 있는 불량품으로 판정할 수 있고, 불량품은 예컨대, 스크래치, 찍힘, 이물, 및/또는 마킹 상태 불량 중 적어도 하나의 제품 결함을 포함할 수 있다. 제품 결함 검사 장치는 카메라 장치로부터 획득된 해당 피검사체의 수집 데이터 및/또는 해당 피검사 체의 외형 검사 결과 정보 중 적어도 하나의 정보를 유선 및/또는 무선 통신방식으로 단말기 및/또는 외부 의 서버(Server)(미도시)에 전송할 수 있다. 제품 결함 검사 장치는 카메라 장치로부터 획득된 해당 피검사체의 수집 데이터 및/또는 해당 피검사 체의 외형 검사 결과 정보 중 적어도 하나의 정보를 디스플레이 화면에 표시되도록 표시 장치에 관련 데이 터를 전송할 수 있다. 전원 공급 장치은 전술한 각 장치들 즉, 조명 장치, 카메라 장치, 제품 결함 검사 장치, 피검사체 이송 장치, 저장장치 및/또는 표시 장치 등의 동작에 필요한 전원을 공급하는 기능을 수행하는 바, 계속적인 전원 공급을 위해 상용 교류(AC) 전원(예컨대, AC 220V 또는 380V 등)을 직류(DC) 및/또 는 교류(AC) 전원으로 변환되도록 구현함이 바람직하지만, 이에 국한하지 않으며, 통상의 휴대용 배터리 (Battery)를 포함하여 구현할 수도 있다. 전원 공급 장치에는 외부의 전원 충격으로부터 부품을 보호하고 일정한 전압을 출력하는 기능을 수행하는 전원 관리부(미도시)를 포함할 수 있다. 상기 전원 관리부는 ESD(Electro Static Damage) 보호기, 전원 감지기, 정류기 및 전원 차단기 등을 포함하여 이루어질 수 있다. ESD 보호기는 정전기 또는 급격한 전원 충격으로부터 전장 부품을 보호하도록 구성한다. 전원 감지기는 허용 전 압 범위 외의 전압이 유입될 경우 상기 전원 차단기에 차단신호를 보내고, 허용 전압 범위 내에서 전압 변화에 따라 승압 또는 강압 신호를 정류기에 전달하도록 구성한다. 정류기는 입력 전압의 변동을 최소하여 일정한 전 압이 공급되도록 전원 감지기의 신호에 따라 승압 또는 강압의 정류 동작을 수행하도록 구성한다. 전원 차단기 는 상기 전원 감지기로부터 전달되는 차단 신호에 따라 배터리로부터 공급되는 전원을 차단하도록 구성한다. 피검사체 이송 장치은 제품 결함 검사 장치과 연결되어 있으며, 제품 결함 검사 장치의 제어에 따라 해당 피검사체를 안착하여 일방향으로 이송시키는 기능을 수행한다. 이러한 피검사체 이송 장치은 산 업분야에서 널리 이용되는 컨베이어 롤러(Conveyor Roller) 또는 컨베이어 벨트(Conveyor Belt) 등을 비롯한 다양한 구조의 2차원 이송장치를 선택하여 적용하면 가능하므로, 본 발명에서는 구체적인 구조 및 그 작용 설명은 생략하기로 한다. 저장 장치는 제품 결함 검사 장치과 연결되어 있으며, 제품 결함 검사 장치의 제어에 따라 카메 라 장치로부터 획득된 해당 피검사체의 수집 데이터를 저장하는 기능을 수행한다. 저장 장치는 제품 결함 검사 장치을 통해 실행되는 적어도 하나의 프로그램 코드와, 프로그램 코드가 이용하는 적어도 하나의 데이터 셋트를 저장하여 유지하는 기능을 수행할 수도 있다. 저장 장치는 예컨대, 플래시 메모리 타입(Flash Memory type), 하드디스크 타입(Hard Disk type), 멀티미 디어 카드 마이크로 타입(Multimedia Card Micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 데이터 전송에 사용되는 통신망은 대용량, 장거리 음성 및 데이터 서비스가 가능한 대형 통신망의 고속 기간 망 인 통신망이며, 인터넷(Internet) 또는 고속의 멀티미디어 서비스를 제공하기 위한 와이파이(WiFi), 와이기그 (WiGig), 와이브로(Wireless Broadband Internet, Wibro), 와이맥스(World Interoperability for Microwave Access, Wimax) 등을 포함하는 차세대 무선 통신망일 수 있다. 인터넷은 TCP/IP 프로토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(Hyper Text Transfer Protocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(Network Information Service) 등을 제공하는 전 세계적인 개방형 컴퓨터 네트워크 구조를 의미한다. 인터넷은 유선 또는 무선 인터넷일 수도 있고, 이외에도 유선 공중망, 무선 이동 통신망, 또는 휴대 인터넷 등과 통합된 코어망일 수도 있다. 표시 장치는 제품 결함 검사 장치과 연결되어 있으며, 제품 결함 검사 장치의 제어에 따라 카메 라 장치로부터 획득된 해당 피검사체의 수집 데이터 및/또는 결함 검사 결과 데이터 중 적어도 하나의 정 보를 디스플레이 화면에 표시하는 기능을 수행한다. 표시 장치는 예컨대, 액정 디스플레이(Liquid Crystal Display, LCD), 발광다이오드 디스플레이(Light Emitting Diode, LED), 박막 트랜지스터 액정 디스플레이(Thin Film Transistor-Liquid Crystal Display, TFT LCD), 유기 발광 다이오드(Organic Light Emitting Diode, OLED), 플렉시블 디스플레이(Flexible Display), 플 라즈마 디스플레이 패널 (Plasma Display Panel, PDP), 표면 얼터네이트 라이팅(ALiS), 디지털 광원 처리 (DLP), 실리콘 액정(LCoS), 표면 전도형 전자방출소자 디스플레이(SED), 전계방출 디스플레이(FED), 레이저 TV (양자 점 레이저, 액정 레이저), 광유전성 액체 디스플레이(FLD), 간섭계 변조기 디스플레이(iMoD), 두꺼운 필 름 유전체 전기(TDEL), 양자점 디스플레이(QD-LED), 텔레스코픽 픽셀 디스플레이(TPD), 유기발광 트랜지스터 (OLET), 레이저 형광 디스플레이(LPD), 3차원 디스플레이(3D display) 중에서 적어도 하나를 포함할 수 있지만, 이에 한정되는 것은 아니고 외부의 영상, 문자 또는 문서 데이터 중 적어도 하나의 데이터를 표시하거나 해당 피검사체의 외형 이미지 정보를 디스플레이(Display)할 수 있는 것이라면, 어떠한 것이라도 포함할 수 있다. 단말기는 미리 설치된 제품 결함 검사 관련 어플리케이션을 통해 제품 결함 검사 장치로부터 전송된 해당 피검사체의 수집 데이터 및/또는 검사 결과 데이터 중 적어도 하나의 정보를 디스플레이 화면에 표시되도 록 서비스를 제공하는 기능을 수행한다. 단말기는 무선 인터넷 또는 휴대 인터넷을 통하여 통신하는 다양한 이동 단말을 포함하고, 이외에도 팜 (Palm) PC, 스마트폰(Smart phone), 스마트 패드(Smart Pad), 스마트 노트(Smart Note), 모바일 게임기(Mobile play-station), 통신 기능이 있는 DMB(Digital Multimedia Broadcasting)폰, 태블릿 PC, 아이패드(iPad) 등 통 신모듈에 접속하기 위한 사용자 인터페이스를 갖는 모든 유무선 가전/통신 장치를 포괄적으로 의미할 수 있다. 단말기는 사용자가 원하는 다양한 어플리케이션(Application) 프로그램을 다운로드받아 자유롭게 사용하고 삭제가 가능한 오픈 운영체계를 기반으로 한 정보 처리 단말을 포함할 수 있다. 단말기는 일반적으로 사용 되는 음성/영상통화, 인터넷 데이터통신 등의 기능뿐만 아니라, 모바일 오피스 기능을 갖춘 모든 모바일 폰 또 는 음성통화 기능이 없으나 인터넷 접속 가능한 모든 인터넷폰 또는 테블릿(Tablet) PC를 포함하는 통신기기로 이해함이 바람직하다.도 2는 본 발명의 일 실시예에 따른 제품 결함 검사 장치의 구성을 도시하는 블록도이다. 도 2를 참조하면, 제품 결함 검사 장치는 명령 라이브러리 제공부, 검사 레시피 생성부, 프로그 래밍 코드 생성부 및 결함 검사부를 포함할 수 있다. 명령 라이브러리 제공부는 복수의 결함 검사 명령에 대한 라이브러리를 제공할 수 있다. 복수의 결함 검사 명령은, 수집 데이터의 좌표를 기준 위치에 대한 좌표로 변환하는 좌표 변환 명령, 제품 형상의 에지(edge)를 검출하여 에지의 패턴 매칭을 통하여 기준 위치를 설정하는 위치 설정 명령, 길이, 원, 각도 및 호와 관련된 크 기를 측정하는 측정 명령, 마스터 이미지를 기준으로 형상을 비교하는 형상 비교 명령, 바코드, 매트릭스 코드 및 QR 코드 중 하나 이상을 포함하는 식별 코드를 검출하는 코드 검출 명령, 등록된 문자를 인식하고, 문자를 판별하는 문자 인식 및 판별 명령을 포함할 수 있다. 명령 라이브러리 제공부는 복수의 결함 검사 명령에 대한 상세 설정을 제공할 수 있다. 상세 설정은 예를 들면, 길이, 호 반지름, 원 반지름, 각도 관련된 크기 및 양품에 해당하는 범위 설정 등을 포함할 수 있다. 검사 레시피 생성부는 사용자의 입력에 기초하여 복수의 검사 명령의 시계열적인 조합을 포함하는 검사 레 시피를 생성할 수 있다. 사용자는 명령 라이브러리 제공부에서 제공되는 명령 중 하나 또는 복수의 명령을 선택하여 검사 레시피를 설정할 수 있고, 검사 레시피는 복수의 명령들의 시계열적으로 수행되는 조합을 포함할 수 있다. 검사 레시피 생성부는 GUI(Graphic User Interface) 화면에 대한 사용자의 드래그 앤 드롭(drag and drop) 조작에 의해 검사 레시피를 생성할 수 있다. 프로그래밍 코드 생성부는 생성된 검사 레시피를 순차적으로 수행하는 프로그래밍 코드를 생성할 수 있다. 프로그래밍 코드 생성부는 명령 라이브러리 제공부에서 제공되는 명령에 대응하는 프로그래밍 코드를 저장하고 있고, 사용자가 생성한 검사 레시피의 명령 순서에 따라 대응하는 프로그래밍 코드를 조합하여 전체 검사 레시피를 수행하기 위한 프로그래밍 코드를 생성할 수 있다. 프로그래밍 코드는 범용 PC에서 동작 가능한 프로그래밍 언어(예를 들면, C++ 등)에 의해 작성될 수 있다. 결함 검사부는 생성된 프로그래밍 코드에 의한 검사 레시피에 따라 카메라로부터 취득된 수집 데이터로부 터 제품 결함을 검출할 수 있다. 결함 검사부는 정형적 제품 결함 및 비정형적 제품 결함을 검출하고, 정형적 결함은 룰(rule) 기반의 검사 레시피에 의해 검출되고, 비정형적 결함은 머신러닝 기반의 결함 판정 학습 모델에 의해 검출될 수 있다. 결함 검사부는, 검사 대상의 제품에 대하여 카메라로부터 취득된 수집 데이터로부터 제품의 결함을 검출하 는 카메라 모드와 시뮬레이션을 위하여 카메라로부터 취득된 샘플 데이터로부터 제품의 결함을 검출하는 시뮬레 이션 프로세스를 수행하는 시뮬레이션 모드 중 하나의 모드를 사용자의 선택에 따라 선택적으로 제공할 수 있다. 결함 검사부가 제공하는 머신러닝 기반의 결함 판정 학습 모델은, 파이썬 프레임워크로 생성된 머신러닝 기반의 제1 결함 판정 학습 모델을 제공하는 단계와, 제1 결함 판정 학습 모델을 ONNXOpen Neural Network eXchange)에 의해 윈도우 운영체제 상에서 런타임 동작이 가능한 머신러닝 기반의 제2 결함 판정 학습 모델로 변환하는 단계를 포함하는 단계들에 의해 구축될 수 있다. 제2 결함 판정 학습 모델은 윈도우 운영체제로 동작하는 범용 PC 상에서 제품 결함 이미지를 포함하는 샘플 데 이터에 의해 학습되고, 검사 대상 제품의 수집 데이터를 범용 PC 상의 제2 결함 판정 학습 모델에 입력함으로써 제품 결함이 검출될 수 있다. 결함 검사부가 제공하는 제2 결함 판정 학습 모델은 범용 PC에서 런타임 동작이 가능하며, 클라우드 서버 를 거치지 않고 범용 PC에서 샘플 데이터의 학습 및 테스트 데이터의 추론에 의한 결함 검출을 실시간으로 수행 할 수 있다. 도 3은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 시뮬레이션 모드의 실행 화면의 일예이다. 도 3을 참조하면, 화면의 가장 좌측 메뉴에서는 기능 박스를 제공한다. 기능 박스에서는 카메라 모드 및 시뮬레 이션 모드 중 어느 하나의 모드를 설정할 수 있다. 기능 박스는 또한 지능 기술, 위치 기술, 측정 기술, 형상 기술, 코드 기술, 문자 기술, 로봇 기술에 대한 복수 의 명령을 제공할 수 있다. 지능 기술은 제2 결함 판정 학습 모델에 의한 지능 학습 및 지능 적용(결함 판정) 명령을 포함한다. 위치 기술은 좌표 위치 및 패턴 위치 명령을 포함한다. 측정 기술은 길이, 원, 각도, 호 측정 명령을 포함한다. 코드 기술은 바코드, 데이터코드, QR코드 명령을 포함한다. 문자 기술은 문자 인식 및 문자 판별 명령을 포함한다. 로봇 기술은 로봇 설정 및 로봇 계산 명령을 포함한다. 사용자가 기능 박스의 특정 명령을 드래그 앤 드롭 조작에 의해 그 우측에 표시되는 명령어 박스 내에 위치시키 면 명령의 시계열적인 조합에 의해 검사 레시피가 생성될 수 있다. 생성된 검사 레시피에 따라 자동적으로 검사 레시피를 수행하기 위한 프로그래밍 코드가 생성될 수 있다. 프로그래밍 코드 생성후에, 시뮬레이션을 위한 카 메라 이미지를 선택하고, 시뮬레이션 모드를 실행시키면 시뮬레이션 모드의 검사 결과가 표시될 수 있다. 도 3의 가장 우측 화면을 참조하면, 시뮬레이션 모드의 검사 결과가 표시되고, 패턴 위치, 원 측정, 각도 측정, 호 측정, 길이 측정 명령에 대응하는 결과(검출값 및 양품 여부)가 표시될 수 있다. 또한, 검사 결과로서 시뮬 레이션 모드의 검사 대상 제품의 전체 투입수와 양품수, 불량품수, 시뮬레이션에 걸린 총 시간 등이 표시될 수 있다. 도 4는 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 지능 학습의 실행 화면의 일예 이다. 범용 PC에서 복수의 캐슈넛, 해이즐넛 및 월넛 이미지를 학습 데이터로 하여 인공지능 모델(머신러닝 모델)을 분류기로서 학습 시키면 인공 지능 판정 모델이 구축될 수 있다. 구축된 인공 지능 판정 모델을 이용하여 테스 트 데이터에 대하여 이미지 분류를 수행하면, 도 4에 도시된 바와 같이 캐슈넛, 해이즐넛 및 월넛의 이미지를 검출하고, 검출된 대상 이미지에 박스 마크와 분류 정확도 퍼센트가 표시될 수 있다. 도 5는 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 라이브러리 명령을 나타내는 도 면이다. 도 5를 참조하면, 사용자가 시뮬레이션 모드를 설정한 후에, 패턴 위치, QR 코드, 원 측정, 바코드, 패턴 위치, 길이 측정(0~2), 호 측정명령을 순차적으로 선택하여 검사 레시피를 생성하면, 대응하는 검사 레시피가 표시될 수 있다. 도 6은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 인공 지능 알고리즘에 의한 제 품 결함 검사 화면의 일예이다. 도 6을 참조하면, 공병의 종류를 분류하는 인공 지능 분류 모델에 의해 복수의 공병 이미지에 대하여 공병의 종 류가 적색 박스와 함께 표시될 수 있다. 인공 지능 알고리즘에 의하면, 학습 라벨링 및 모델 학습이 용이하고, 직관적인 학습 데이터 라벨링이 가능하다. 또한, GPU 기반의 학습 모델 연산이 가능하고, 좌표 기술과 좌표 호 환성을 제공할 수 있다. 도 7은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 좌표 변환 명령을 설명하는 이 미지이다. 좌표 변환 명령을 실행하면, 이미지 상의 좌표를 기준 위치를 중심으로 하는 좌표로 변환할 수 있다. 좌표 변환 명령은 단일 기능에서 설정 가능하고, 실제 좌표 연산 및 저장 기능을 갖고 있고, 로봇 인터페이스에 적용 가능 하다. 도 8은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 위치 설정 명령을 설명하는 이 미지이다. 도 8을 참조하면, 위치 설명 명령은 에지 기반의 패턴 매칭 기능을 제공할 수 있다. 또한, 기준 정보를 제공하 여 다른 기능에 기준 좌표를 제공하고, 좌표 설정 기능을 통한 좌표 기술의 호환이 가능하다. 또한, 에지 임계 값, 방향을 통한 패턴 검출 기능을 제공하고, 결과 목록 작업명 변경이 가능하다. 도 9는 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 측정 명령을 설명하는 이미지이 다. 도 9를 참조하면, 측정 명령은 길이, 원, 각도, 호와 관련된 크기를 측정하는 기능을 제공한다. 또한, 기준 정 보를 제공하여 다른 기능에 기준 좌표를 제공하고, 좌표 설정 기능을 통한 좌표 기술의 호환이 가능하다. 또한, 측정 명령은 방향을 통한 검출 기능을 제공하고, 결과 목록 작업명 변경이 가능하다. 도 10은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 형상 비교 명령을 설명하는 이 미지이다. 도 10을 참조하면, 형상 비교 명령은 마스터 이미지를 기준으로 비교 기능을 제공할 수 있다. 또한, 기준 정보 를 제공하여 다른 기능에 기준 좌표를 제공하고, 좌표 설정 기능을 통한 좌표 기술 호환이 가능하다. 또한, 유 사도 파라미터를 통한 사용자 조정 기능을 제공하고, 결과 목록 작업명 변경이 가능하다. 도 11은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 코드 검출 명령을 설명하는 이 미지이다. 도 11을 참조하면, 코드 검출 명령은 바코드, 매트릭스 코드, QR 코드 인식 기능을 제공할 수 있다. 코드 검출 명령은 등록 영역 사용자 기능을 제공하고, 바코드 품질, 이미지 품질 파라미터를 제공하며, 매트릭스 코드 임 계값 파라미터를 제공할 수 있다. 또한, QR코드의 직관적인 인식 기능을 제공하고, 결과 목록 작업명 변경도 가 능하다. 도 12는 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 문자 인식 및 판별 명령을 설 명하는 이미지이다. 도 12를 참조하면, 문자 인식 및 판별 명령은 문자 등록 및 문자 학습 기능을 제공하고, 사용자 등록 영역 사용 자 기능을 제공할 수 있다. 또한, 위치 설정을 통한 문자 위치를 제공하고, 결과 목록 작업명 변경 기능을 제공 할 수 있다. 도 13은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 제품 결함 검사 방법의 흐름도 이다. 도 13을 참조하면, 제품 결함 검사 방법은 명령 라이브러리 제공 단계(S110), 검사 레시피 생성 단계(S120), 프 로그래밍 코드 생성 단계(S130) 및 결함 검사 단계(S140)를 포함할 수 있다. 명령 라이브러리 제공 단계(S110)에서는, 명령 라이브러리 제공부가 복수의 결함 검사 명령에 대한 라이브 러리를 제공할 수 있다. 검사 레시피 생성 단계(S120)에서는, 검사 레시피 생성부가 사용자의 입력에 기초하여 복수의 검사 명령의 시계열적인 조합을 포함하는 검사 레시피를 생성할 수 있다. 프로그래밍 코드 생성 단계(S130)에서는, 프로그래밍 코드 생성부가 생성된 검사 레시피를 순차적으로 수 행하는 프로그래밍 코드를 생성할 수 있다. 결함 검사 단계(S140)에서는, 결함 검사부가 생성된 프로그래밍 코드에 의한 검사 레시피에 따라 카메라로 부터 취득된 수집 데이터로부터 제품 결함을 검출할 수 있다. 명령 라이브러리 제공 단계(S110), 검사 레시피 생성 단계(S120), 프로그래밍 코드 생성 단계(S130) 및 결함 검 사 단계(S140)의 각 단계들에 대한 설명에 대하여는 명령 라이브러리 제공부, 검사 레시피 생성부, 프로그래밍 코드 생성부 및 결함 검사부에 대하여 상술한 설명이 참조될 수 있다. 이상에서 설명된 단계 또는 프로세스는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합에 의해 실행될 수 있다. 예를 들어, 실시예들에서 설명된 단계 또는 프로세스는, 예를 들어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크 로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 실행될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에 서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가"}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "사용되는 것으로 설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처 리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세 서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에 는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬 (ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치 가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리 터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이 다."}
{"patent_id": "10-2022-0154068", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2022-0154068", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 제품 결함 검사 장치와 다른 관련 장치와의 연결 관계를 나타내는 도면이다. 도 2는 본 발명의 일 실시예에 따른 제품 결함 검사 장치의 구성을 도시하는 블록도이다. 도 3은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 시뮬레이션 모드의 실행 화면의 일예이다. 도 4는 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 지능 학습의 실행 화면의 일예 이다. 도 5는 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 라이브러리 명령을 나타내는 도 면이다. 도 6은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 인공 지능 알고리즘에 의한 제 품 결함 검사 화면의 일예이다. 도 7은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 좌표 변환 명령을 설명하는 이 미지이다. 도 8은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 위치 설정 명령을 설명하는 이 미지이다. 도 9는 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 측정 명령을 설명하는 이미지이 다. 도 10은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 형상 비교 명령을 설명하는 이 미지이다.도 11은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 코드 검출 명령을 설명하는 이 미지이다. 도 12는 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 문자 인식 및 판별 명령을 설 명하는 이미지이다. 도 13은 본 발명의 일 실시예에 따른 제품 결함 검사 장치에 의해 제공되는 제품 결함 검사 방법의 흐름도 이다."}
