{"patent_id": "10-2017-0052971", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0119342", "출원번호": "10-2017-0052971", "발명의 명칭": "전개 가능한 커넥터 모듈을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "조현제"}}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향을 향하는 제 2 면을 포함하는하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및상기 하우징의 상기 리세스 내에 배치되며, 외부 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스외부로 전개 가능한 커넥터 모듈;을 포함하고, 상기 커넥터 모듈은,제 1 부분이 상기 리세스 내측에 결합되고, 적어도 하나의 회전 부분의 회전을 통해 제 2 부분이 상기 리세스외부로 전개하는 전개부;상기 전개부 내에 배치된 마그넷;상기 마그넷과 대면 배치되며, 상기 마그넷과 자기 결합을 유도하는 적어도 하나의 금속; 및상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연결되는 커넥터부를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 전개부는 상기 커넥터 모듈을 지지하는 복수 개의 부분들과 상기 부분 사이에 형성된 복수 개의 회전 부분들을 포함하고, 상기 회전 부분들 각각은 복수 회의 전개를 통해 상기 리세스 외부로 상기 커넥터 모듈의 적어도 일부를 확장시키고, 상기 커넥터부의 위치를 반전시키는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 커넥터부는 상기 커넥터 모듈의 제 1 영역 내에 배치되고, 상기 마그넷은 상기 커넥터 모듈의 상기 제 1영역의 양 측에 위치하는 제 2 영역 내에 배치되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서, 상기 커넥터 모듈은,상기 커넥터 모듈이 상기 리세스로부터 확장되고 상기 커넥터부가 노출되어 상기 외부 장치와 결합 가능하도록전개된 제 1 차 전개; 및 상기 커넥터 모듈의 제2 부분이 하나의 축을 중심으로 회전 분리되어 상기 분리된 각각의 영역 사이의 각도를 조절하는 제 2 차 전개를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 커넥터 모듈은,공개특허 10-2018-0119342-3-상기 전개부의 상기 적어도 제1 부분이 상기 리세스 내측에 고정되도록 지지하고, 상기 커넥터 모듈 내부 부품들과의 높이를 보정하는 지지부를 더 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서, 상기 전개부는,내부에 적어도 하나의 금속을 포함하고, 외부로 노출된 제 1 전개부; 및상기 제 1 전개부로부터 연장되고, 상기 제 1 전개부와 함께 상기 마그넷 및 상기 커넥터부가 실장되는 내부 공간을 형성하는 제 2 전개부를 포함하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서, 상기 제 1 전개부는,상기 지지부와 결합하는 제 1 부분;상기 제 1 부분으로부터 연장되고, 제 1 회전부분을 통해 상기 제 1 부분에 대하여 회전하는 제 2 부분;상기 제 2 부분으로부터 연장되고, 제 2 회전부분을 통해 상기 제 2 부분에 대하여 회전하는 제 3 부분; 및상기 제 2 전개부와 결합하는 제 4 부분을 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서, 상기 제 2 전개부는,상기 제 1 전개부의 제 4 부분과 결합하는 제 1 부분;상기 제 1 부분으로부터 연장되고, 상기 커넥터부의 접점부가 노출되도록 적어도 하나의 홀을 포함하는 제 2 부분; 및상기 제 2 부분으로부터 연장되고, 상기 지지부과 결합하는 제 3 부분을 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6항에 있어서, 상기 금속부는,상기 제 1 전개부 내측에 배치된 제 1 금속 및 상기 리세스 상면에 배치된 제 2 금속을 포함하고,상기 제 1 금속 및 상기 제 2 금속은 상기 마그넷을 사이에 두고 서로 대면 배치되는 것을 특징으로 하는 전자장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8항에 있어서,상기 제 1 전개부 및 상기 제 2 전개부는 플라스틱 또는 패브릭 소재를 포함한 재질로 구성된 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2018-0119342-4-제 10항에 있어서, 상기 제 1 전개부는,상기 제 1 회전 부분의 상기 길이 방향으로 배치된 제 1 가상축을 가지면서, 상기 제 2 부분은 상기 제 1 가상축을 중심으로 상기 제 1 부분에 대하여 상대적으로 회전 운동하며,상기 제 2 회전 부분의 상기 길이 방향으로 배치된 제 2 가상축을 가지면서, 상기 제 3 부분은 상기 제 2 가상축을 중심으로 상기 제 2부분에 대하여 상대적으로 회전 운동하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 제 1 전개부는 상기 제 3 회전 부분의 상기 길이 방향으로 배치된 제 3 가상축을 가지면서, 상기 제 4 부분은 상기 제 1 가상축을 중심으로 상기 제 3 부분에 대하여 상대적으로 회전 운동하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 6항에 있어서,상기 커넥터부는 상기 외부 장치와 전기적 연결을 제공하는 인쇄 회로기판 및 상기 인쇄 회로기판 상에 배치되고, 외부로 돌출된 접점부를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 접점부는 상기 외부 전자 장치와 전기적 접점을 형성하기 위한 복수 개의 접점들을 포함하고,상기 제 2 전개부의 적어도 일부는 상기 복수 개의 접점들이 외부로 노출될 수 있도록 상기 복수 개의 접점들과대면되는 위치에 적어도 하나의 개구를 형성하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13항에 있어서, 상기 마그넷은,상기 커넥터 모듈의 제 1 영역에 적어도 일부가 배치된 제 1 금속 및 상기 커넥터 모듈의 상기 제 1 영역의 양측에 위치하는 제 2 영역 내에 배치되는 제 2 금속과 자기적 인력을 유도할 수 있도록, 상기 제 1 영역 및 상기제 2 영역에 걸쳐 배치된 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 7 항에 있어서, 상기 1 차 전개에서,상기 제 1 전개부의 상기 제 2 부분 또는 제 3 부분은 상기 하우징의 제 2 면과 동일 평면 상에 위치하고, 상기 제 2 부분의 상면에 배치된 상기 커넥터부는 제 1 방향을 향하도록 노출된 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16항에 있어서, 상기 제 2 차 전개에서,상기 제 1 전개부의 상기 제 2 부분에 대하여 상기 제 2 전개부가 소정의 기울기를 가지도록 경사각을공개특허 10-2018-0119342-5-형성하고,상기 제 1 전개부의 상기 제 2 부분 내측에 배치된 적어도 하나의 자석은 상기 제 2 전개부 내측에 배치된 마그넷과 이격 배치된 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 15항에 있어서,상기 제 1 전개부 및 상기 제 2 전개부는 상기 리세스의 길이 방향에 대응하도록 상기 제 1 영역 및 상기 제 2영역에 걸쳐 배치되고, 상기 제 1 금속은 상기 제 1 전개부 내부에 배치되며, 상기 제 1 영역 및 상기 제 2 영역에 걸쳐 배치되는 것을특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치에 있어서, 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향을 향하는 제 2 면을 포함하는하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및상기 하우징의 상기 리세스 내에 배치되며, 외부 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스외부로 전개 가능한 커넥터 모듈;을 포함하고, 상기 커넥터 모듈은,제 1 부분이 상기 리세스 내측에 결합되고, 적어도 하나의 회전 부분의 회전을 통해 제 2 부분이 상기 리세스외부로 전개하는 전개부;상기 전개부 내에 배치된 제 1 자성체;상기 마그넷과 대면 배치되며, 상기 제 1 자성체과 자기 결합을 유도하는 제 2 자성체; 및상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연결되는 커넥터부;를 포함하고,상기 하우징의 상기 제 1 면에는 상기 리세스와 접하는 영역에 적어도 하나의 홈이 배치되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2017-0052971", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치에 있어서, 디스플레이를 포함하는 제1 전자 장치; 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향을 향하는 제 2 면을 포함하는하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및상기 하우징의 상기 리세스 내에 배치 가능하며, 상기 제1 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스 외부로 전개 가능한 커넥터 모듈;을 포함하고, 상기 커넥터 모듈은,적어도 하나의 회전 부분의 회전을 통해 일부분이 상기 리세스 외부로 전개하는 전개부;상기 전개부 내에 배치된 마그넷;상기 마그넷과 대면 배치되며, 상기 마그넷과 자기 결합을 유도하는 적어도 하나의 금속; 및상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연결되는 커넥터부를 포함하는 것을 특징으로 하는 전자 장치.공개특허 10-2018-0119342-6-"}
{"patent_id": "10-2017-0052971", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 전자 장치는, 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향을 향하는 제 2 면을 포함하는 하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개 방된 리세스를 포함하는 하우징; 및 상기 하우징의 상기 리세스 내에 배치되며, 외부 전자 장치와의 전기적 결합 (뒷면에 계속)"}
{"patent_id": "10-2017-0052971", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 휴대시 전자 장치 내측에 배치되고, 외부 전자 장치와 결합시 외부로 확장 가능한 커넥터 모듈을 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2017-0052971", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치라 함은, 가전제품으로부터, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영 상/음향 장치, 데스크톱/랩톱 컴퓨터, 차량용 내비게이션 등, 탑재된 프로그램에 따라 특정 기능을 수행하는 장 치를 의미할 수 있다. 예를 들면, 이러한 전자 장치들은 저장된 정보를 음향이나 영상으로 출력할 수 있다. 전 자 장치의 집적도가 높아지고, 초고속, 대용량 무선통신이 보편화되면서, 최근에는, 이동통신 단말기와 같은 하 나의 전자 장치에 다양한 기능이 탑재될 수 있다. 예를 들면, 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼트 기능, 음악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹 등을 위한 통신 및 보안 기능, 일정 관리나 전자 지갑 등의 기능이 하나의 전자 장치에 집약되고 있는 것이다. 이러한 전자 장치는 사용자가 편리하게 휴대할 수 있도록 소형화되고 있으며, 소비자의 니즈에 부합하기 위하여 미려한 디자인을 가지도록 제작되고 있다. 상기와 같은 전자 장치에 있어서, 입력 장치 기반의 전자 장치는 표시 장치 기반의 전자 장치와 서로 탈착 가능 한 구조로 마련되며, 상기 전자 장치들의 상호 결합을 위한 다양한 방식의 결합 구조를 적용하게 된다. 상기 결 합 구조는 회전식과 슬라이딩식, 스윙식으로 구분할 수 있다. 특히, 회전식 구조는 제조가 용이하고 고장이 적 으며 사용이 편리하므로 전자 장치에 가장 많이 적용되는 방식 중의 하나이다."}
{"patent_id": "10-2017-0052971", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치에 사용하는 회전 결합 구조는 입력 장치 기반의 전자 장치에 표시 장치 기반의 전자 장치를 연결 후 보관 및 이동시 연결 상태를 유지하기 위하여 커넥터부가 외부로 노출되도록 제작되어 있다. 이에 따라, 전자 장치의 외부면에 절개 형상이 존재하여 외관 형상이 제한적이고 제품 미관상 좋지 않으며 휴대용이 일반화된 전 자 장치를 잡을 때, 그립감이 좋지 못하다. 또한, 전자 장치의 회전 결합 구조는 별도로 배치된 커넥터부가 외부로 노출되어 있어 전기적인 쇼트가 발생할 우려가 있으며, 오염 가능성이 있다. 본 발명의 일 실시예에 따른 커넥터 모듈을 포함하는 전자 장치는, 외부면에 상시적으로 배치되지 않도록, 전자 장치 일측에 배치된 리세스 내에 상기 커넥터 모듈을 배치하여, 심플하고 클린한 외적 디자인의 표현이 가능하 며 휴대시 그립감에도 도움을 제공하고자 한다. 또한, 본 발명의 일 실시예에 따른 커넥터 모듈을 포함하는 전자 장치는, 복수 회의 편리한 전개 방식으로 동작 하여, 표시부를 포함한 전자 장치의 결합 및 편리한 각도 조절을 제공하고자 한다."}
{"patent_id": "10-2017-0052971", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 전자 장치는, 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향 을 향하는 제 2 면을 포함하는 하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및 상기 하우징의 상기 리세스 내에 배치되며, 외부 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스 외부로 전개 가능한 커넥터 모듈;을 포함하고, 상기 커넥터 모듈은, 적어도 제1 부분이 상기 리세스 내측에 결합되고, 적어도 하나의 회전 부분의 회전을 통해 제2부분이 상기 리세 스 외부로 전개하는 전개부; 상기 전개부 내에 배치된 마그넷; 상기 마그넷과 대면 배치되며, 상기 마그넷과 자기 결합을 유도하는 적어도 하나의 금속; 및 상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연 결되는 커넥터부를 포함할 수 있다. 본 발명의 일 실시예에 따른 전자 장치는, 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향 을 향하는 제 2 면을 포함하는 하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및 상기 하우징의 상기 리세스 내에 배치되며, 외부 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스 외부로 전개 가능한 커넥터 모듈;을 포함하고, 상기 커넥터 모듈은, 제 1 부분이 상기 리세스 내측에 결합되고, 적어도 하나의 회전 부분의 회전을 통해 제 2 부분이 상기 리세스 외부로 전개하는 전개부; 상기 전개부 내에 배치된 제 1 자성체; 상기 마그넷과 대면 배치되며, 상기 제 1 자성 체과 자기 결합을 유도하는 제 2 자성체; 및 상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연 결되는 커넥터부;를 포함하고, 상기 하우징의 상기 제 1 면에는 상기 리세스와 접하는 영역에 적어도 하나의 홈 이 배치될 수 있다. 본 발명의 일 실시예에 따른 전자 장치는 디스플레이를 포함하는 제1 전자 장치; 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향을 향하는 제 2 면을 포함하는 하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및 상기 하우징의 상기 리세스 내에 배치 가능하며, 상기 제1 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스 외부로 전개 가능한 커 넥터 모듈;을 포함하고, 상기 커넥터 모듈은, 적어도 하나의 회전 부분의 회전을 통해 일부분이 상기 리세스 외부로 전개하는 전개부; 상기 전개부 내에 배치 된 마그넷; 상기 마그넷과 대면 배치되며, 상기 마그넷과 자기 결합을 유도하는 적어도 하나의 금속; 및 상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연결되는 커넥터부를 포함할 수 있다."}
{"patent_id": "10-2017-0052971", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 커넥터 모듈을 포함하는 전자 장치는, 상기 전자 장치 외부에 상시적으로 노출되지 않도록 전자 장치 내측으로 실장 가능한 커텍터 모듈을 구성하여, 심플하고 클린한 외적 디자인을 표현할 수 있 다. 또한, 본 발명의 일 실시예에 따른 커넥터 모듈을 포함하는 전자 장치는, 전자 장치 외부면에 피팅 라인을 최소 화하여 사용자가 전자 장치를 휴대하는 경우에 안정적인 그립감을 제공할 수 있다. 또한, 본 발명의 일 실시예에 따른 커넥터 모듈을 포함하는 전자 장치는, 복수 회의 편리한 전개 방식으로 동작 하여, 표시부를 포함한 전자 장치의 결합 및 편리한 회전과 각도 조절을 제공할 수 있다."}
{"patent_id": "10-2017-0052971", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예들이 첨부된 도면을 참조하여 기재된다. 실시예 및 이에 사용된 용어들은 본 문 서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 및 /또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사 한 참조 부호가 사용될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 문서에서, \"A 또는 B\" 또는 \"A 및/또는 B 중 적어도 하나\" 등의 표현은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 해당 구성요소들을, 순서 또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요 소들을 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에 \"(기능적으로 또는 통신적으로) 연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다. 본 문서에서, \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, 하드웨어적 또는 소프 트웨어적으로 \"~에 적합한,\" \"~하는 능력을 가지는,\" \"~하도록 변경된,\" \"~하도록 만들어진,\" \"~를 할 수 있 는,\" 또는 \"~하도록 설계된\"과 상호 호환적으로(interchangeably) 사용될 수 있다. 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로 세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장 치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하 나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 플렉서블하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전 자 장치)를 지칭할 수 있다. 도 1은 본 발명의 다양한 실시예에 따른, 전개(unfold) 가능한 커넥터 모듈을 포함한 휴대용 전자 장치 의 사시도이다. 도 1에서, 3축 직교 좌표계의 'X'는 상기 전자 장치의 길이 방향, 'Y'는 상기 전자 장치의 폭 방향, 'Z'는 상기 전자 장치의 두께 방향을 의미할 수 있다. 또한, 본 발명의 일 실시예에서, 'Z'는 제 1방향(+Z) 및 제 2 방향(-Z)을 의미할 수 있다. 도 1에 도시된 바와 같이, 상기 전자 장치는 제 1 전자 장치, 상기 제 1 전자 장치 내에 배치된 커넥터 모듈과 탈부착이 가능한 제 2 전자 장치를 포함할 수 있다. 상기 커넥터 모듈은 상기 제 1 전자 장치에 대하여 상기 제 2 전자 장치를 회전 가능하도록 결합시키는 구조로서 상기 제 1 전자 장치 일부 영역 내에 실장 배치될 수 있다. 다양한 실시예에 따른, 제 1 전자 장치는 데이터 입력부를 포함할 수 있으며, 예를 들어, 상기 데이터 입 력부는 상기 제 1 전자 장치 내에 데이터를 전달하기 위한 타이핑(typing) 등의 입력 작업을 보조하는 키 패드 기기(keypad device)일 수 있다. 상기 제 1 전자 장치의 제 1 방향(+Z)을 향하는 상면의 일부 분에는 복수의 입력키들이 구비될 수 있으며, 마우스의 기능을 대신할 수 있는 터치 패드 또한 구비 될 수 있다. 사용자는 상기 제 1 전자 장치를 활용하여 제 2 전자 장치에 표시되거나 저장되는 데이 터 입력 작업을 보다 빠르고 편리하게 수행할 수 있다. 다양한 실시예에 따른, 상기 제 2 전자 장치는 컴퓨팅 시스템과 영상 표시 수단이 하나의 장치로 통합된 포터블 기기(portable device)일 수 있으며, 예를 들어, 태블릿 컴퓨터일 수 있다. 상기 제 2 전자 장치 내부에는 데이터 입력부, 데이터 출력부 및/또는 데이터 입출력부를 포함할 수 있다. 예를 들어, 상기 데이터 입력부는 터치 패드와 같은 입력 장치가 채용될 수 있고, 상기 데이터 출력부는 디스플레이 장치와 같은 표시부 가 채용될 수 있으며, 상기 데이터 입출력부는 터치 스크린과 같은 기기가 채용될 수 있다. 다양한 실시예에 따른, 상기 제 2 전자 장치는 투명 윈도우를 포함하는 하우징을 포함하고, 상 기 하우징 내부에는 상기 투명 윈도우를 통하여 외부 정보를 표시하기 위한 디스플레이가 배치될 수 있다. 상기 하우징은 각종 전자 부품 등을 수용하기 위한 것으로서, 적어도 일부분이 도전성 재질로 이루 어질 수 있다. 예를 들어, 상기 하우징은 상기 제 2 전자 장치의 외측면을 형성하는 측벽들을 포함할 수 있으며, 상기 제 2 전자 장치의 외관으로 드러나는 부분은 도전성을 가진 금속 재질로 제작될 수 있다. 상기 하우징의 내부로는 인쇄 회로부(미도시) 및/또는 배터리(미도시)가 수용될 수 있다. 예를 들어, 상기 인쇄 회로부에는 프로세서, 통신 모듈, 각종 인터페이스, 전력 관리 모듈 등이 집적회로 칩 형태로 장착될 수 있다. 또 한 예로, 제어 회로 또한 집적회로 칩으로 구성되어 상기 인쇄 회로부에 장착될 수 있다. 예를 들어, 상기 제어 회로는 상술한 프로세서 또는 통신 모듈의 일부일 수 있다. 상기 하우징 내부에는 상기 배터리 를 수용함으로써 전원을 확보할 수 있다. 다양한 실시예에 따른, 상기 제 1 전자 장치의 제 1 방향(+Z)을 향하는 상단 영역에는 상기 제 2 전 자 장치와의 결합을 위한 커넥터 모듈이 배치될 수 있다. 상기 커넥터 모듈은 상기 제 1 전자 장치의 길이 방향(+X,-X)을 따라 길게 형성될 수 있다. 상기 사용자에 의하여 상기 제 1 전자 장치가 사용될 때, 상기 제 1 전자 장치에 배치된 상기 커넥터 모듈의 적어도 일부는 상기 제 2 전자 장치 의 일단부에 삽입되며, 상기 제 1 전자 장치와 상기 제 2 전자 장치가 전기적으로 연결될 수 있 다. 상기 제 2 전자 장치는 상기 제 1 전자 장치에 고정적으로 결합되지 않고 분리 가능하도록 결합 되기 때문에, 상기 제 2 전자 장치는 사용자가 원하는 경우, 손쉽게 상기 제 2 전자 장치로부터 분리 되어 사용할 수 있다. 또 다른 예로, 휴대 및/또는 보관시 상기 커넥터 모듈을 통해 상기 제 1 전자 장치 와 제 2 전자 장치가 결합한 상태로 유지할 수 있다. 상기 제 1 전자 장치와 상기 제 2 전자 장치 간의 전개 가능한 커넥터 구조에 대한 자세한 설명 은 후술하기로 한다. 도 2 는 본 발명의 다양한 실시예에 따른, 휴대용 전자 장치의 제 2 전자 장치의 사시도이다. 도 2 에 나타난 제 2 전자 장치 구조는 도 1 의 제 2 전자 장치의 구조의 일부 또는 전부일 수 있다. 도 2를 참조하면, 상기 제 2 전자 장치의 하단부 내측에는 적어도 하나의 커넥터 구조를 포함할 수 있다. 예를 들어, 상기 제 2 전자 장치의 하측 중심부에 배치된 테두리면(edge surface)에는 접속 단자 가 내측으로 삽입된 커넥터 구조가 형성될 수 있다. 상기 커넥터 구조는 전술된 커넥터 모듈(예를 들 어, 도 1의 커넥터 모듈)의 적어도 일부가 삽입 가능한 홈 형상으로 구성되고, 상기 접속 단자들은 상기 커넥터 모듈의 접속 단자들의 수 및 형상에 대응하도록 구비될 수 있다. 상기 제 2 전자 장치의 커넥 터 구조는 제 1 전자 장치(예를 들어, 도 1 의 전자 장치)로부터 돌출된 커넥터 모듈의 접속 단 자와 전기적으로 연결될 수 있다. 다양한 실시예에 따른, 상기 제 2 전자 장치의 상기 커넥터 구조의 내측 또는 주변부에는 마그넷 (magnet)(미도시)이 실장될 수 있으며, 상기 제 1 전자 장치 테두리 영역에 배치된 마그넷 또는 금속과 자 기적으로 결합할 수 있다. 상기 자기적 결합은 상기 제 1 전자 장치 및 상기 제 2 전자 장치와의 흔 들림 없는 강한 결속을 유도할 수 있다. 본 발명의 일 실시예에서, 상기 커넥터 구조은 상기 제 2 전자 장치의 하단부 테두리 영역에 한 개 형성되어 있으나, 이에 한정된 것은 아니며 상기 제 2 전자 장치의 상단부 및/또는 측면 영역에 형성될 수도 있으며, 하단부에 복수 개로 형성될 수 있다. 이에 따라 상기 제 1 전자 장치의 커넥터 모듈과 연결되는 제 2 전자 장치는 길이 방향이 상하 방향을 향하거나, 좌우 방향을 향하는 등 다양 한 결합 배치에 따른 방향 전환을 제공할 수 있다. 도 3은 본 발명의 다양한 실시예에 따른, 휴대용 전자 장치 내의 커넥터 모듈을 부품별로 나타낸 분해 사시도이다. 도 4는 본 발명의 다양한 실시예에 따른, 휴대용 전자 장치의 측면을 영역별로 절단한 단면도 이다. 도 3 및 도 4 에 나타난 제 1 전자 장치 구조는 도 1 의 제 1 전자 장치의 구조의 일부 또는 전부일 수 있다. 도 3을 참조하면, 휴대용 전자 장치는 홈 형상의 리세스를 포함한 제 1 전자 장치 및 상기 리세스 내측에 배치된 커넥터 모듈을 포함할 수 있다. 도 3에서, 3축 직교 좌표계의 'X'는 상기 제 1 전자 장치의 길이 방향, 'Y'는 상기 제 1 전자 장치의 폭 방향, 'Z'는 상기 제 1 전자 장치의 두께 방향을 의미할 수 있다. 또한, 본 발명의 일 실시예에서, '+Z'는 제 1 방향, '-Z'는 제 2 방향, '+Y'는 제 3 방향, '+X,-X'는 제 4 방향 및 '-Y'는 제 5 방향을 의미할 수 있다. 다양한 실시예에 따른, 상기 제 1 전자 장치는 제 1 방향(+Z)으로 향하는 제 1 면, 상기 제 1 방향 (+Z)과 반대인 제 2 방향(-Z)을 향하는 제 2 면 및 상기 제 1 면 및 상기 제 2 면 사이의 공간 을 둘러싸는 측면을 포함하는 하우징을 포함할 수 있다. 다양한 실시예에 따른, 상기 제 1 전자 장치 는 제 1 면 상단 영역에 상기 커넥터 모듈이 배치될 수 있는 적어도 한 방향으로 개방된 리세스(recess)를 포함할 수 있다. 일 실시예에 따른, 상기 일측이 개방된 리세스는 상기 제 1 전자 장치의 상단 영역의 테두리면(edge surface)에 상기 제 1 전자 장치의 길이 방향(제 4 방향 (+X,-X))으로 형성될 수 있다. 일 실시예에 따른, 상기 리세스의 적어도 일측은 개방된 상태로 구현될 수 있다. 예를 들면, 상기 리세스 의 중심을 기준으로, 상기 제 1 방향(+Z)과 수직인 제 3 방향(+Y)을 향하는 일면 및 상기 제 1 방향(+Z)과 수직인 제 4 방향(+X,-X)을 향하는 일면은 상기 하우징과 단턱면을 형성할 수 있다. 또 다른 예로, 상기 개방된 리세스의 중심을 기준으로, 상기 제 3 방향(+Y)과 반대 방향인 제 5 방향(-Y) 및 제 1 방향(+Z)은 개방된 형태로 구성될 수 있으며, 상기 개방된 방향으로 상기 커넥터 모듈이 전개될 수 있다. 다양한 실시예에 따른, 일측이 개방된 리세스 내부에는 커넥터 모듈이 배치될 수 있다. 상기 커넥터 모듈은 하우징 내측으로 수납되거나 외부로 전개 가능한 전개부(310,320), 상기 제 2 전자 장치(예를 들어, 도 1 및 도 2의 제 2 전자 장치)와 결합하는 커넥터부, 자성에 의한 상호 작용(예를 들면, 자기적 인력)을 유도하는 적어도 하나의 금속(330,350) 및 마그넷(magnet)을 포함할 수 있다. 다양한 실시예에 따른, 상기 커넥터 모듈은 길이 방향(제 4 방향((+X,-X))을 기준으로, 상기 커넥터부 가 배치된 중심부인 제 1 영역(S1) 및 상기 상기 커넥터부 양측에 복수 개의 마그넷이 배치된 중심부 이외의 제 2 영역(S2)을 포함할 수 있다. 다양한 실시예에 따른, 상기 전개부(310,320)는 상기 리세스 내부에 수납된 수납 상태(M0), 상기 전개부 (310,320)가 상기 리세스 외부로 1 차 적으로 전개(unfold)하는 제 1 차 전개 동작(M1) 및 상기 제 1 차 전개 동작(M1) 이후 상기 전개부(310,320)가 추가적으로(2차적으로) 전개하는 제 2 차 전개 동작(M2)으로 구분 될 수 있다. 이하, 우선적으로 수납 상태(M0)에 관하여(도 10의 수납 상태(M0) 참조) 구체적으로 설명한다. 상기 수납 상태(M0)에서, 상기 커넥터 모듈의 전개부(310,320)는 적어도 일부가 노출된 상태로 리세스 내측에 배치될 수 있다. 예를 들어, 상기 전개부(310,320)의 제 1 방향(+Z)을 향하는 면 및/또는 상기 제 5 방향(-Y)을 향하는 면은 상기 하우징 외부로 노출될 수 있다. 다양한 실시예에 따른, 상기 전개부(310,320)로 둘러싸인 내부 공간에는 적어도 하나의 금속(330,350), 자석 및/또는 커넥터부 등의 부품이 실장될 수 있으며, 상기 여러 부품 등을 감싸도록 복수 개의 플렉서 블한 플레이트로 구성될 수 있다. 예를 들어, 상기 전개부(310,320)은 절곡되거나 굴곡진 형상으로 상기 커넥터 모듈의 외부면을 형성할 수 있다. 일 실시예에 따른, 상기 전개부(310,320)는 상기 커넥터 모듈 외면의 적어도 일부를 형성하는 제 1 전개부 및 상기 제 1 전개부로부터 연장되고, 상기 커넥터 모듈 외면의 나머지 일부를 형성하는 제 2 전개부를 포함할 수 있다. 상기 제 1 전개부는 제 1 차 전개 동작(M1)으로 전환시, 회전 가능한 일부 영역을 포함할 수 있으며, 상기 제 2 전개부는 제 2 차 전개 동작(M2)으로 전환시, 회전 가능한 일부 영역 을 포함할 수 있다. 다양한 실시예에 따른, 상기 제 1 전개부는 상기 커넥터 모듈의 외면 중 제 1 방향(+Z)을 향하는 면 및/또는 상기 제 5 방향(-Y)을 향하는 면의 대부분을 구성하여, 상기 하우징 외부로 노출될 수 있다. 상기 제 1 전개부 내측에는 제 1 금속을 배치하여, 후술될 마그넷과 자기적으로 결합한 상태를 유지 할 수 있다. 상기 제 2 전개부는 상기 제 1 전개부로부터 연장되어, 상기 하우징의 리세스 내측과 접촉되고 외부로 노출되지 않도록 배치될 수 있다. 다만, 상기 제 2 전개부는 상기 제 1 차 전개 동작(M1) 또는 제 2 차 전개 동작(M2)에서 외부로 노출된 상태를 유지할 수 있다. 도 4a는 상기 제 1 전자 장치의 리세스 내에 수납 상태로 안착된 커넥터 모듈의 측면을 나타낸 도면이며, 도 4b는 상기 도 4a의 제 1 영역(S1)을 A-A'방향으로 절단한 단면도이고, 도 4c는 상기 도 4a의 제 2 영역을 B-B'방향으로 절단한 단면도이다. 다양한 실시예에 따른, 상기 제 1 전개부 및 상기 제 2 전개부에 의하여 둘러싸인 내측 일부 공간에 는 커넥터부 및 마그넷이 배치될 수 있다. 도 4b를 참고하면, 상기 제 1 영역(S1)을 기준으로, 상기 커넥터 모듈의 중심부에는 커넥터부가 배치 될 수 있다. 상기 커넥터부는 접점부 및 인쇄 회로기판을 포함할 수 있다. 예를 들어, 상기 커 넥터부는 상기 제 2 전자 장치(도 1 및 도 2의 제 2 전자 장치)와 전기적으로 연결하기 위한 복수 개 의 접점들(361a)을 포함하는 접점부를 포함할 수 있으며, 상기 제 2 전개부는 상기 접접들(361a)이 수납 상태(M0)에서 제 2 방향(-Z)을 향하면서 안착될 수 있도록 상기 접점들(361a)과 대면되는 위치에 개구를 형성할 수 있다. 또 한 예로, 상기 하우징의 상기 제 2 면 내측은 상기 제 2 전개부의 개구를 관통한 접점들(361a)이 손상 없이 삽입될 수 있는 적어도 하나의 홀이 배치될 수 있다. 또 다른 예로, 상기 인 쇄 회로기판은 제 1 전자 장치와 전기적으로 연결 가능한 플렉서블 인쇄 회로기판일 수 있다. 다양한 실시예에 따른, 상기 제 1 영역(S1)의 커넥터부의 중심과 동일 선상(C1-C1')에 배치된 커넥터 모듈 은, 상부로부터 제 2 방향(-Z)을 향하여, 제 1 금속이 내측에 배치된 제 1 전개부, 커넥터부 , 제 2 전개부, 하우징의 제 2 면으로 적층 배치될 수 있다. 또 다른 예로, 상기 제 1 영 역(S1)의 상기 지지부의 중심과 동일 선상(C2-C2')에 배치된 결합 구조는, 상부로부터 제 2 방향(-Z)을 향 하여 제 1 금속이 내측에 배치된 제 1 전개부 일측, 제 2 전개부, 지지부, 제 1 전개부 타측 및 하우징의 제 2 면으로 적층 배치될 수 있다.일 실시예에 따른, 상기 지지부는 상기 제 1 전개부 및 제 2 전개부 사이에 배치되어, 상기 제 1 전개부의 일측을 상기 하우징 내측에 고정시키며, 상기 제 2 전개부의 높이를 보정할 수 있다. 예를 들어, 상기 지지부는 상기 제 1 전개부 또는 상기 제 2 전개부의 길이 방향에 대응 되는 크기로 형성되며, 상기 지지부의 상측에는 제 2 전개부 접촉 배치되고, 하측에는 제 1 전개부 가 접촉 배치될 수 있다. 상기 제 1 전개부가 1 차적으로 전개를 하기 위해서 상기 제 1 전개부(31 0)의 제 1 부분은 상기 하우징에 고정되어 위치하고, 나머지 부분이 전개(un-fold)되는 구조로 구현 될 수 있다. 상기 제 1 부분은 상기 지지부를 통하여 상기 하우징 내측에 고정될 수 있다. 도 4c를 참고하여 상기 제 2 영역(S2)을 기준으로, 상기 리세스의 중심 이외의 양 주변부에는 마그넷(34 0)이 배치될 수 있으며, 상기 마그넷은 제 1 전개부와 대응되는 길이 방향으로 막대 형태를 포함할 수 있다. 예를 들어, 상기 마그넷은 수납 상태(M0)에서 제 1 전개부 및/또는 제 2 전개부가 접 힌 상태로 유지될 수 있도록 하우징 내측에 배치된 금속들과 자기적 결합 상태를 유지할 수 있다. 상기 마 그넷의 상부 및 하부에 별도의 금속과 각각 자기적 결합을 통하여 커넥터 모듈의 수납 상태를 효과적 으로 제공할 수 있다. 다양한 실시예에 따른, 상기 제 2 영역(S2)의 마그넷의 중심과 동일 선상(D1-D1')에 배치된 커넥터 모듈 은, 상부로부터 제 2 방향(-Z)을 향하여 제 1 금속이 내측에 배치된 제 1 전개부, 마그넷, 제 2 전개부, 제 2 금속 및 하우징의 제 2 면으로 적층 배치될 수 있다. 또 다른 예로, 상 기 제 2 영역(S2)의 상기 지지부의 중심과 동일 선상(D2-D2')에 배치된 커넥터 모듈은, 상부로부터 제 2 방향(-Z)을 향하여 제 1 금속이 내측에 배치된 제 1 전개부 일측, 제 2 전개부, 지지부 , 제 1 전개부 타측 및 하우징의 제 2 면으로 적층 배치될 수 있다. 상기 지지부는 상기 제 1 전개부 및 제 2 전개부 사이에 배치되어, 상기 제 1 전개부의 일측이 상기 하우징 내측에 고정시키며, 상기 제 2 전개부의 높이를 보정할 수 있다. 다양한 실시예에 따른, 상기 마그넷은 제 1 전개부 및 제 2 전개부에 의해 둘러싸인 내부 공간 에 고정 배치되며, 복수의 제 2 영역(S2)에 복수 개로 구성될 수 있다. 상기 커넥터 모듈의 상면에서 바라 볼 때, 상기 마그넷은 상기 커넥터부를 사이에 두고, 서로 대면 배치될 수 있다. 각각의 마그넷(34 0)은 서로 대응되는 형태로 제 2 영역(S2)에 배치된 금속과 자기적 인력을 통한 결합을 유도할 수 있다. 다양한 실시예에 따른, 상기 커넥터 모듈은 상기 마그넷의 상부에 제 1 금속 및 상기 마그넷 의 하부에 제 2 금속을 포함할 수 있다. 상기 제 1 금속 및 제 2 금속은 마그넷을 사이에 두고 서로 대면 배치될 수 있다. 일 실시예에 따른, 상기 제 1 금속은 제 1 전개부의 제 3 부분 내측에 배치되며, 상기 제 1 전 개부의 길이 방향에 대응하는 긴 막대 형상일 수 있다. 상기 제 1 금속은 후술한 커넥터 모듈의 제 2 차 전개 동작(M2)에서 마그넷과 분리될 수 있다. 일 실시예에 따른, 상기 제 2 금속는 하우징의 리세스 바닥면에 고정 배치되며, 상기 리세스 의 길이 방향에 대응하는 긴 막대 형상일 수 있다. 상기 제 2 금속은 후술할 커넥터 모듈의 제 1 차 전개 동작(M1)에서 마그넷과 분리될 수 있다. 상기 제 2 금속은 제 2 차 전개 동작(M2)이 이루 어진 후에도, 외부에 노출되지 않도록 플라스틱 또는 패브릭(fabric) 등의 커버에 의하여 보호될 수 있다. 다양한 실시예에 따른, 상기 제 1 전개부는 복수 개의 회전 부분들(315,316,317)을 포함한 플레이트일 수 있다. 상기 제 1 전개부는 플라스틱 또는 패브릭(fabric) 등의 재질로 구성될 수 있으며, 상기 마그넷 또는 금속(330,350) 사이에 배치되어, 사용자가 손쉽게 탈착을 유도할 수 있다. 수납 상태(M0)에서, 상기 제 1 전개부는 적어도 일부 영역이 외부로 노출된 상태로 커넥터 모듈을 형 성하고, 상기 지지부과 고정 결합되는 제 1 부분, 상기 제 1 부분으로부터 연장되며, 외부로 노 출된 제 2 부분, 제 3 부분 및 상기 제 3 부분으로부터 연장되며, 상기 제 2 전개부와 결 합되는 제 4 부분을 포함할 수 있다. 상기 제 1 부분과 상기 제 2 부분 사이에는 180도 이상으 로 회전 가능한 제 1 회전부분을 포함하고, 상기 제 2 부분과 제 3 부분 사이에는 180도 이상으 로 회전 가능한 제 2 회전부분을 포함할 수 있다. 상기 제 3 부분과 상기 제 4 부분 사이에는 90도 이상으로 회전 가능한 제 3 회전부분을 포함할 수 있다. 예를 들어, 상기 제 1 회전부분 및 제 2 회전부분은 제 1 차 전개 동작(M1)에서 상기 제 1 전개부 의 제 2 부분 및 제 3 부분이 펼쳐지도록 회전하며, 상기 제 3 회전부분은 제 2 차 전개 동작(M2)에서 상기 제 1 전개부의 제 4 부분이 펼쳐지도록 회전할 수 있다. 다양한 실시예에 따른, 상기 제 2 전개부는 복수 개의 절곡 및/또는 굴곡진 형상의 부분들을 포함한 플레 이트일 수 있다. 상기 제 2 전개부는 플라스틱 또는 패브릭(fabric) 등의 재질로 구성될 수 있으며, 상기 마그넷 또는 금속(330,350) 사이에 배치되어, 사용자가 손쉽게 탈착을 유도할 수 있다. 수납 상태(M0)에서, 상기 제 2 전개부는 리세스 내측에 삽입되어 노출되지 않은 상태로 커넥터 모듈 을 형성하고, 상기 제 1 전개부의 제 4 부분과 고정 결합된 제 1 부분, 상기 제 1 부분 으로부터 연장되고 마그넷 및/또는 커넥터 모듈의 적어도 일부를 수용하는 제 2 부분 및 상기 제 2 부분으로부터 연장되고, 상기 지지부와 대면 배치되는 제 3 부분을 포함할 수 있다. 상기 제 2 전개부는 상기 제 1 전개부의 회전에 의하여, 제 1 차 전개 동작(M1)에서 리세스로부 터 분리되어 외부로 노출될 수 있다. 본 발명의 일 실시예에 따르면, 상기 커넥터 모듈이 상기 제 1 전자 장치의 리세스 내측 공간에 삽입 배치되기 때문에, 전면 및/또는 측면 방향에서 상기 제 1 전자 장치를 바라볼 때, 상기 커넥터 모듈 이 상기 하우징의 각 영역과 단절되지 않고 매끄럽게 이어지도록(seamless) 구현되어 구조의 단순화 를 가져올 수 있다. 이에 따라, 전자 장치가 전체적으로 피팅 라인이 없는 깔끔하고 미려한 외관을 형성할 수 있으며, 사용자가 전자 장치를 휴대시에도 돌출되지 않은 커넥터 모듈로 인하여 깔끔하고 미려한 외관을 형성할 수 있다. 이하, 상기 커넥터 모듈의 제 1 차 전개 동작(M1)을 구체적으로 설명한다. 도 5는 본 발명의 다양한 실시예에 따른, 제 1 전자 장치 커넥터 모듈의 제 1 차 전개 동작(M1)을 나 타낸 사시도이다. 도 6a 내지 도 6c는 본 발명의 다양한 실시예에 따른, 제 1 전자 장치 커넥터 모듈(40 0)의 제 1 차 전개(M1) 동작에서 제 1 영역(도 4a의 제 1 영역(S1))을 절단한 단면도이다. 도 5 및 도 6 에 나 타난 제 1 전자 장치 및 커넥터 모듈은 도 3 및 도 4의 제 1 전자 장치, 커넥터 모듈의 일 부 또는 전부일 수 있다. 도 5 및 도 6 에서, 3축 직교 좌표계의 'X'는 상기 제 1 전자 장치의 길이 방향, 'Y'는 상기 제 1 전자 장 치의 폭 방향, 'Z'는 상기 제 1 전자 장치의 두께 방향을 의미할 수 있다. 또한, 본 발명의 일 실시 예에서, '+Z'는 제 1 방향, '-Z'는 제 2 방향, '+Y'는 제 3 방향, '+X,-X'는 제 4 방향 및 '-Y'는 제 5 방향을 의미할 수 있다. 도 5 및 도 6을 참조하면, 상기 전자 장치는 일측이 개방된 형상의 리세스를 포함한 제 1 전자 장치 및 상기 리세스 내측에 배치된 커넥터 모듈을 포함할 수 있다. 예를 들어, 상기 제 1 전자 장치(10 0)는 제 1 방향(+Z)으로 향하는 제 1 면, 상기 제 1 방향(+Z)과 반대인 제 2 방향(-Z)을 향하는 제 2 면 및 상기 제 1 면 및 상기 제 2 면 사이의 공간을 둘러싸는 측면을 포함하는 하우징 을 포함할 수 있다. 상기 하우징의 상기 제 1 면의 전단 영역에는 상기 커넥터 모듈이 배 치될 수 있다. 상기 커넥터 모듈은 외부 장치(예를 들어, 도 1의 제 2 전자 장치)와 전기적 결합을 위하여 커넥터부가 노출되도록 순차적으로 전개(unfold)될 수 있다. 다양한 실시예에 따른, 상기 커넥터 모듈은 하우징 내측으로 수납되거나 외부로 전개 가능한 전개부 (410,420), 상기 제 2 전자 장치(예를 들어, 도 1 및 도 2의 제 2 전자 장치)와 결합하는 커넥터부, 자성에 의한 상호 작용을 유도하는 적어도 하나의 금속(430,450) 및 마그넷(magnet)을 포함할 수 있다. 다양한 실시예에 따른, 상기 제 1 전개부는 복수 개의 회전 부분들(415,416,417)을 포함한 플레이트일 수 있다. 상기 제 1 전개부는 플라스틱 또는 패브릭(fabric) 등의 재질로 구성될 수 있으며, 상기 마그넷 또는 금속(430,450) 사이에 배치되어, 사용자가 손쉽게 탈착을 유도할 수 있다. 예를 들어, 상기 제 1 전개부는 적어도 일부 영역이 외부로 노출된 상태로 커넥터 모듈을 형성하고, 상기 지지부과 고정 결합되는 제 1 부분, 상기 제 1 부분으로부터 연장되며, 외부로 노출된 제 2 부분, 제 3 부분 및 상기 제 3 부분으로부터 연장되며, 상기 제 2 전개부와 결합되는 제 4 부분을 포함할 수 있다. 상기 제 1 부분과 상기 제 2 부분 사이에는 180도 이상으로 회전 가능한 제 1 회전부분을 포함하고, 상기 제 2 부분과 제 3 부분 사이에는 180도 이상으로 회전 가 능한 제 2 회전부분을 포함할 수 있다. 상기 제 3 부분과 상기 제 4 부분 사이에는 90도 이상으 로 회전 가능한 제 3 회전부분을 포함할 수 있다. 또 다른 예로, 상기 제 2 전개부는 리세스 내 측으로부터 전개되어 적어도 일부가 노출된 상태로 커넥터 모듈을 형성하고, 상기 제 1 전개부의 제 4 부분과 고정 결합된 제 1 부분, 상기 제 1 부분으로부터 연장되고 마그넷 및/또는 커넥 터 모듈의 적어도 일부를 수용하는 제 2 부분 및 상기 제 2 부분으로부터 연장되고, 상기 지지 부와 대면 배치되는 제 3 부분을 포함할 수 있다. 다양한 실시예에 따른, 제 1 차 전개 동작(M1)에서, 상기 커넥터 모듈의 상기 제 1 전개부의 제 1 회 전부분은 제 1 가상축(P1)을 형성하며, 상기 제 1 전개부는 상기 제 1 가상축(P1)을 중심으로 회전할 수 있다. 또한, 상기 제 1 전개부의 제 2 회전부분은 제 2 가상축(P2)을 형성하며, 상기 제 1 전개부 는 상기 제 2 가상축(P2)을 중심으로 회전할 수 있다. 다양한 실시예에 따른, 상기 제 1 전개부의 일부 영역(예를 들어, 제 2 부분, 제 3 부분)이 서 로 다른 축(예: 상기 제 1가상축(A1)과 상기 제 2가상축(A2))을 중심으로 회전함에 따라, 상기 제 1 전자 장치 외부로 확장될 수 있다. 상기 제 1 전개부의 상기 제 2 부분 또는 제 3 부분은 상기 제 1 부분에 대하여 0~270도 사이에서 회전할 수 있다. 설명의 편의를 위하여, 상기 0~270도를 나타내는 각도는 상기 제 1 부분에 대한 상기 제 2 부분의 각도 및/또는 상기 제 2 부분에 대한 상기 제 3 부분 의 각도로 정의할 수 있다. 다양한 실시예에 따른, 상기 제 1 차 전개 동작(M1)(도 10의 제 1 차 전개 동작(M1) 참조)는 상기 제 1 부분 에 대한 상기 제 2 부분의 각도가 90도 초과에서 270도 미만인 제 1 동작(도 6a, M11), 상기 제 2 부분에 대한 상기 제 3 부분의 각도가 90도 초과에서 180도 미만인 제 2 동작(도 6b, M12)인 것으로 정의하여 설명토록 한다. 상기 제 1 동작(M11) 및 상기 제 2 동작(M12)은 순차적으로 이루어질 수도 있으며, 동 시에 이루어질 수도 있다. 상기 제 1 동작(M11) 및 제 2 동작(M12)이 완료된 후, 외부로 노출된 커넥터부 와 외부 전자 장치(예를 들어, 도 1 의 제 2 전자 장치)가 전기적으로 결속되는 제 3 동작(도 6c, M13)이 진행될 수 있다. 다양한 실시예에 따른, 상기 제 1 동작(M11)에서, 상기 제 1 전개부의 제 1 부분과 제 2 부분은 서로 소정의 각도(예를 들어, 90도 초과 270도 미만)을 가지도록 배치될 수 있다. 상기 제 1 전개부에 고 정된 상기 제 2 전개부 및 내부 공간에 배치된 마그넷(예를 들어, 도 4의 마그넷) 및 커넥터부 는 상기 제 1 전개부의 회전에 대응하여 움직일 수 있다. 예를 들어, 상기 제 2 전개부는 회전에 따 라 순차적으로 외부에 노출되는 면적이 증가하여, 제 1 동작(M11)이 완료되면, 전체적으로 외부에 노출될 수 있 다. 또 다른 예로, 상기 마그넷((예를 들어, 도 4의 마그넷)은 회전에 따라, 제 2 금속과의 자기적 결합력이 감소하여, 제 1 동작(M11)이 진행되면서 상기 마그넷((예를 들어, 도 4의 마그넷)으로부터 자기 력이 미치지 않는 영향권으로 제 2 금속이 위치할 수 있다. 상기 제 1 동작(M11)은, 사용자가 손쉽게 제 1 전개부를 상기 리세스로부터 벗어날 수 있도록, 상기 하우징의 제 1 면의 상기 리세스 와 맞닿는 영역에는 홈을 배치할 수 있다. 사용자는 손가락 등을 상기 홈에 삽입한 후, 상기 제 1 전개부를 제 5 방향(-Y)을 향하도록 밀어, 간단하게 상기 제 1 전개부의 제 1 회전부분이 상 기 제 1 가상축(P1)을 따라 회전시킬 수 있다. 다양한 실시예에 따른, 상기 제 2 동작(M12)에서, 상기 제 1 전개부의 제 2 부분과 제 3 부분은 서로 소정의 각도(예를 들어, 90도 초과 180도 미만)을 가지도록 배치될 수 있다. 상기 제 1 전개부에 고 정된 상기 제 2 전개부 및 내부 공간에 배치된 마그넷(예를 들어, 도 4의 마그넷), 커넥터부는 상기 제 1 전개부의 회전에 대응하여 움직일 수 있다. 예를 들어, 상기 제 2 전개부의 상기 커넥터부 는 회전에 따라 복수 개의 접점들(461a)이 상기 제 1 방향(+Z)을 향하는 방향으로 이동할 수 있다. 이는 전술된 외부 전자 장치(예를 들어, 도 1의 제 2 전자 장치)와의 유리한 결속을 위한 배치 관계를 설정할 수 있다. 상기 제 2 동작(M12)은 제 1 동작(M11)에 의하여 외부에 노출된 커넥터 모듈의 제 1 전개부(41 0)가 전체적으로 외부로 노출된 상태를 유지하며 진행할 수 있다. 다양한 실시예에 따른, 상기 제 2 동작(M12)이 완료되면, 상기 제 1 전개부의 제 3 부분은 상기 제 1 전자 장치의 제 2 면과 함께 동일 평면상(예를 들면, 바닥면)에 나란하게 위치할 수 있다. 상기 제 1 전개부의 제 1 부분은 제 1 전자 장치 내에 고정되어 제 3 부분이 안정적으로 제 1 전자장치와 소정의 거리를 유지하도록 보조할 수 있다. 상기 제 3 부분은 상기 제 1 부분과 서로 평 행하게 위치할 수 있다. 상기 제 1 전개부의 제 2 부분은 상기 제 1 부분 및 제 3 부분을 연결하고, 상기 제 1 부분 및 제 3 부분과 소정의 각도를 유지하여, 상기 제 3 부분 바닥면에 들뜨는 현상없이 안정적으로 밀착될 수 있도록 보조할 수 있다. 이에 따라, 제 3 부분과 수직 방향으로 배 치된 커넥터부의 접접들(461a)이 안정적으로 상기 제 1 방향(+Z) 향할 수 있다. 다양한 실시예에 따른, 상기 제 3 동작(M13)에서, 상기 커넥터 모듈의 커넥터부와 외부 전자 장치 (200, 도 1의 제 2 전자 장치)가 서로 전기적 결속이 이루어질 수 있다. 예를 들면, 상기 커넥터부의 접점들(461a)과 상기 외부 전자 장치의 일측에 배치된 커넥터 구조의 접점들이 서로 상호적으로 결합 하여 제 1 전자 장치의 전기적 신호를 외부 전자 장치로 전달할 수 있다. 또 한 예로, 상기 커넥터부 의 접점들(461a)의 주변 영역과 상기 외부 전자 장치 커넥터 구조의 주변 영역에는 마그넷과 금 속(미도시)이 배치되어 두 전자 장치의 물리적 결합을 강하게 유지할 수 있다. 또 다른 예로, 상기 결속 구조의 마그넷이 배치된 제 2 영역(S2)과 대면되는 외부 전자 장치의 영역에 적어도 하나의 금속이 배치되어 두 전자 장치의 물리적 결합을 강하게 유지할 수도 있다. 이하, 커넥터 모듈의 제 2 차 전개 동작(M2)을 설명한다. 도 7은 본 발명의 다양한 실시예에 따른, 제 1 전자 장치 커넥터 모듈의 제 2 차 전개 동작(M2)을 나 타낸 사시도이다. 도 8은 본 발명의 다양한 실시예에 따른, 제 1 전자 장치 커넥터 모듈의 제 2 차 전개 동작(M2)에서 제 2 영역(도 4a의 제 2 영역(S2))을 절단한 단면도이다. 도 7 및 도 8 에 나타난 제 1 전자 장치 및 커넥터 모듈은 도 3 및 도 4의 제 1 전자 장치, 커넥터 모듈의 일부 또는 전부일 수 있다. 도 7 및 도 8에서, 3축 직교 좌표계의 'X'는 상기 제 1 전자 장치의 길이 방향, 'Y'는 상기 제 1 전자 장 치의 폭 방향, 'Z'는 상기 제 1 전자 장치의 두께 방향을 의미할 수 있다. 또한, 본 발명의 일 실시 예에서, '+Z'는 제 1 방향, '-Z'는 제 2 방향, '+Y'는 제 3 방향, '+X,-X'는 제 4 방향 및 '-Y'는 제 5 방향을 의미할 수 있다. 도 7 및 도 8을 참조하면, 상기 전자 장치는 일측이 개방된 형상의 리세스를 포함한 제 1 전자 장치 및 상기 리세스 내측에 배치된 커넥터 모듈을 포함할 수 있다. 예를 들어, 상기 제 1 전자 장치(10 0)는 제 1 방향(+Z)으로 향하는 제 1 면, 상기 제 1 방향(+Z)과 반대인 제 2 방향(-Z)을 향하는 제 2 면 및 상기 제 1 면 및 상기 제 2 면 사이의 공간을 둘러싸는 측면을 포함하는 하우징 을 포함할 수 있다. 상기 하우징의 상기 제 1 면의 전단 영역에는 상기 커넥터 모듈이 배 치될 수 있다. 상기 커넥터 모듈은 외부 장치(예를 들어, 도 1의 제 2 전자 장치)와 전기적 결합이 이루어진 상태에서, 사용자가 편하게 외부 장치의 표시부를 바라볼 수 있도록 다양한 각도를 설정할 수 있다. 다양한 실시예에 따른, 상기 커넥터 모듈은 하우징 내측으로 수납되거나 외부로 전개 가능한 전개부 (510,520), 상기 제 2 전자 장치(예를 들어, 도 1 및 도 2의 제 2 전자 장치)와 결합하는 커넥터부, 자성에 의한 상호 작용을 유도하는 적어도 하나의 금속(530,450) 및 마그넷(magnet)을 포함할 수 있다. 다양한 실시예에 따른, 상기 제 1 전개부는 복수 개의 회전 부분들(515,516,517)을 포함한 플레이트일 수 있다. 상기 제 1 전개부는 플라스틱 또는 패브릭(fabric) 등의 재질로 구성될 수 있으며, 상기 마그넷 또는 금속(530,550) 사이에 배치되어, 사용자가 손쉽게 탈착을 유도할 수 있다. 예를 들어, 상기 제 1 전개부는 적어도 일부 영역이 바닥면에 지지된 상태로 커넥터 모듈을 형성하고, 상기 지지부과 고정 결합되는 제 1 부분, 상기 제 1 부분으로부터 연장되며, 외부로 노출된 제 2 부분, 제 3 부분 및 상기 제 3 부분으로부터 연장되며, 상기 제 2 전개부와 결합되는 제 4 부분을 포함할 수 있다. 상기 제 1 부분과 상기 제 2 부분 사이에는 180도 이상 으로 회전 가능한 제 1 회전부분을 포함하고, 상기 제 2 부분과 제 3 부분 사이에는 180도 이상 으로 회전 가능한 제 2 회전부분을 포함할 수 있다. 상기 제 3 부분과 상기 제 4 부분 사이에는 90도 이상으로 회전 가능한 제 3 회전부분을 포함할 수 있다. 또 다른 예로, 상기 제 2 전개부는 리 세스 내측으로부터 전개되어 적어도 일부가 노출된 상태로 커넥터 모듈을 형성하고, 상기 제 1 전개 부의 제 4 부분과 고정 결합된 제 1 부분, 상기 제 1 부분으로부터 연장되고 마그넷및/또는 커넥터 모듈의 적어도 일부를 수용하는 제 2 부분 및 상기 제 2 부분으로부터 연장되고, 상기 지지부와 대면 배치되는 제 3 부분을 포함할 수 있다. 다양한 실시예에 따른, 상기 커넥터 모듈의 상기 제 1 전개부의 제 3 회전부분은 제 3 가상축 (P3)을 형성하며, 상기 제 1 전개부의 제 4 부분은 상기 제 3 가상축(P3)을 중심으로 회전할 수 있다. 다양한 실시예에 따른, 상기 제 1 전개부의 일부 영역(예를 들어, 제 4 부분)이 상기 제 3 가상축 (P3)을 중심으로 회전함에 따라, 상기 커넥터 모듈와 결합된 외부 전자 장치는 사용자가 다양한 각도 에서 바라볼 수 있도록 움직일 수 있다. 상기 제 1 전개부의 상기 제 4 부분은 상기 제 3 부분 에 대하여 0~90도 사이에서 회전할 수 있다. 설명의 편의를 위하여, 상기 0~90도를 나타내는 각도는 상기 제 3 부분에 대한 상기 제 4 부분의 각도로 정의할 수 있다. 예를 들어, 상기 제 2 차 전개 동작(M2) (도 10의 제 2 차 전개 동작(M2) 참조)는 상기 제 3 부분에 대한 상기 제 4 부분의 각도가 0도 초과에서 90도 미만인 동작(도 8)인 것으로 정의하여 설명토록 한다. 상기 제 2 차 전개 동작(M2)은 상기 제 1 차 전개(제 1 동작(M11) 내지 제 3 동작(M13)) 이후에 순차적으로 이루어질 수 있으나, 이에 한정된 것은 아니며, 상기 제 1 차 전개(M1)와 동시에 이루어질 수도 있다. 다양한 실시예에 따른, 상기 제 1 전개부에 고정된 상기 제 2 전개부 및 내부 공간에 배치된 마그넷 및 커넥터부는 상기 제 1 전개부의 회전에 대응하여 움직일 수 있다. 다양한 실시예에 따른, 상기 제 2 차 전개 동작(M2)에서, 상기 제 3 부분 내에 배치된 제 1 금속과 상기 제 2 전개부 내에 배치된 마그넷의 분리가 진행될 수 있다. 예를 들어, 제 2 차 전개 동작(M2) 전, 상기 제 1 금속과 상기 마그넷은 서로 대면 배치된 상태로 상호 자기력에 따라 결합한 상태이다. 이후, 사용자의 동작에 의한 상기 마그넷의 회전이 이루어지고, 상기 제 1 금속과의 자기적 결합력이 감소하고, 상기 제 2 차 전개 동작(M2)이 진행함에 따라, 상기 마그넷으로부터 자기력이 미치지 않는 영향 권으로 제 1 금속이 위치할 수 있다. 상기 제 2 차 전개 동작(M2)은, 사용자가 손쉽게 제 2 전개부의 일부 영역이 상기 제 1 전개부로부터 소정의 거리만큼 벗어날 수 있도록, 사용자는 손가락 등을 사용하여 상기 제 2 전개부를 밀 수 있다. 사용자는 상기 제 2 전개부를 상기 제 5 방향(-Y)을 향하도록 밀거 나, 외부 전자 장치를 상기 제 5 방향(-Y)을 향하도록 밀어, 간단하게 상기 제 1 전개부의 제 3 회전부분 이 상기 제 3 가상축(P3)을 따라 회전시킬 수 있다. 사용자는 모니터 등의 제 2 전자 장치의 표시부 를 사용자가 시청하기 편한 위치에 도달할 수 있도록 제 1 전자 장치에 대하여 90~180도를 갖는 외부 장치 각도를 자유롭게 조절할 수 있다. 도 9는 본 발명의 다양한 실시예에 따른, 제 1 전자 장치와 제 2 전자 장치가 커넥터 모듈을 통 해 결합된 후, 서로 대면된 상태를 나타낸 사시도이다. 도 9 에 나타난 제 1 전자 장치, 제 2 전자 장치 및 커넥터 모듈은 도 3 내지 도 8의 제 1 전자 장치, 제 2 전자 장치, 커넥터 모듈 (300,400,500)의 일부 또는 전부일 수 있다. 도 9를 참조하면, 상기 전자 장치는 개방된 형상의 리세스(예를 들어, 도 3의 리세스)를 포함한 제 1 전자 장치, 상기 리세스 내측에 배치된 커넥터 모듈 및 제 2 전자 장치를 포함할 수 있다. 상기 제 1 전자 장치와 상기 제 2 전자 장치는 커넥터 모듈을 통하여 서로 전기적으로 결합한 상태로, 상기 전자 장치를 사용하지 않고 보관 또는 운반하는 중에 있을 때, 서로 포개진 상태로 유지할 수 있다. 예를 들어, 상기 제 2 전자 장치의 표시부(예를 들어, 도 1의 투명 윈도우)는 제 1 전자 장치 의 제 1 면(예를 들어, 도 1의 제 1 면)과 전체적으로 마주하도록 배치될 수 있다. 다양한 실시예에 따른, 상기 제 1 전자 장치의 제 1 면에는 복수 개의 마찰 패드들(예를 들어, 도 1 의 마찰 패드들)이 배치되어 있다. 예를 들어, 상기 복수 개의 마찰 패드들은 고무 등과 같은 탄성 재질을 포함할 수 있으며, 상기 복수 개의 마찰 패드들은 상기 제 1 전자 장치와 상기 제 2 전자 장 치 간의 미끄러짐을 방지하고, 소정의 간격을 제공하여, 충격에 대한 안정적인 상호간의 배치를 유지할 수 있다. 또 다른 예로, 상기 제 1 전자 장치 및 상기 제 2 전자 장치 각각의 내부에는 상기 복수 개의 마찰 패드들과 대응되는 위치에 마그넷이 포함될 수 있다. 상기 제 1 전자 장치와 상기 제 2 전자 장 치에 내재된 복수 개의 마그넷들은 서로 자기적인 인력이 작용하여 안정적인 상호간의 배치를 보조할 수 있다. 다양한 실시예에 따르면, 도 5 내지 도 8에 전술한 바와 같이, 상기 커넥터 모듈(400,500,600)의 상기 제 1 전 개부의 일부 영역(예를 들어, 제 2 부분, 제 3 부분)이 서로 다른 축(예: 상기 제 1 가상축(P 1)과 상기 제 2 가상축(P2))을 중심으로 회전할 수 있으며, 전개되는 방향과 반대 방향으로 상기 제 2 전자 장 치는 상기 제 1 전자 장치의 제 1 면을 향하여 이동할 수 있다. 상기 제 1 전개부의 상기 제 2 부분 또는 제 3 부분은 상기 제 1 부분에 대하여 0~270도 사이에서 회전할 수 있다. 예를 들어, 상기 제 1 차 전개 동작(M1) 반대로 상기 제 1 부분에 대한 상기 제 2 부분의 각도 및 상 기 제 2 부분에 대한 상기 제 3 부분의 각도가 감소하면서, 상기 제 1 동작(M11) 및 제 2 동작(M12) 의 역순으로 회전할 수 있다. 만약, 제 2 차 전개 동작(M2)가 이미 이루어진 후라면, 상기 제 3 부분에 대 한 상기 제 4 부분의 각도가 감소하면서, 상기 제 3 동작(M13)의 역순으로 회전할 수 있다. 상기 제 1 동 작(M11), 상기 제 2 동작(M12) 및/또는 제 2 차 전개 동작(M2)은 역순으로 이루어질 수도 있으며, 동시에 이루 어질 수도 있다. 상기 제 1 전자 장치에 대한 상기 제 2 전자 장치의 완전한 폴딩이 이루어질 수 있 다. 구체적인 각 동작의 각도 관련 내용은 전술한바, 상기 전개 구성 및 동작을 인용한다. 이상 설명한 바와 같이, 본 발명의 일 실시예에 따른 휴대용 전자 장치에 의하면, 전개 가능한 커넥터 모듈 에 의하여 제 1 전자 장치 및 제 2 전자 장치 간의 결합이 수행될 수 있으며, 그 결합 각도는 사용자가 원하는 다양한 상태로 제공될 수 있다. 또한, 휴대시 상기 커넥터 모듈이 상기 제 1 전자 장치 의 리세스 내측 공간에 삽입 배치되기 때문에, 전면 및/또는 측면 방향에서 상기 제 1 전자 장치를 바라볼 때, 상기 커넥터 모듈이 상기 하우징의 각 영역과 단절되지 않고 매끄럽게 이어지도록(seamless) 구현되어 구조의 단순화를 가져올 수 있다. 이에 따라, 전자 장치가 전체적으로 피팅 라인이 없는 깔끔하고 미 려한 외관을 형성할 수 있다. 본 발명의 일 실시예에 따른 전자 장치는, 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향 을 향하는 제 2 면을 포함하는 하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및 상기 하우징의 상기 리세스 내에 배치되며, 외부 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스 외부로 전개 가능한 커넥터 모듈;을 포함하고, 상기 커넥터 모듈은, 적어도 제 1 부분이 상기 리세스 내측에 결합되고, 적어도 하나의 회전 부분의 회전을 통해 제 2부분이 상기 리 세스 외부로 전개하는 전개부; 상기 전개부 내에 배치된 마그넷; 상기 마그넷과 대면 배치되며, 상기 마그넷과 자기 결합을 유도하는 적어도 하나의 금속; 및 상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연결되는 커넥터부를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 전개부는 상기 커넥터 모듈을 지지하는 복수 개의 부분과 상기 부분 사이 에 형성된 복수 개의 회전 부분을 포함하고, 상기 회전 부분들은 복수 회의 전개를 통해 상기 리세스 외부로 상 기 커넥터 모듈의 적어도 일부를 확장시키고, 상기 커넥터부의 위치를 반전시킬 수 있다. 본 발명의 일 실시예에 따르면, 상기 커넥터부는 상기 커넥터 모듈의 제 1 영역 내에 배치되고, 상기 마그넷은 상기 커넥터 모듈의 상기 제 1 영역의 양 측에 위치하는 제 2 영역 내에 배치될 수 있다. 본 발명의 일 실시예에 따르면, 상기 전자 장치는, 상기 커넥터 모듈이 상기 리세스로부터 확장되고 상기 커넥 터부가 노출되어 상기 외부 장치와 결합 가능하도록 전개된 제 1 차 전개; 및 상기 커넥터 모듈의 일부분이 하 나의 축을 중심으로 회전 분리되어 상기 분리된 각각의 영역 사이의 각도를 조절하는 제 2 차 전개를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 전개부의 상기 적어도 일부분이 상기 리세스 내측에 고정되도록 지지하고, 상기 커넥터 모듈 내부 부품들과의 높이를 보정하는 지지부를 더 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 전개부는, 내부에 적어도 하나의 금속을 포함하고, 외부로 노출된 제 1 전 개부; 및 상기 제 1 전개부로부터 연장되고, 상기 제 1 전개부와 함께 상기 마그넷 및 상기 커넥터부가 실장되 는 내부 공간을 형성하는 제 2 전개부를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 제 1 전개부는, 상기 지지부와 결합하는 제 1 부분; 상기 제 1 부분으로부터 연 장되고, 제 1 회전부분을 통해 상기 제 1 부분에 대하여 회전하는 제 2 부분; 상기 제 2 부분으로부터 연장되고, 제 2 회전부분을 통해 상기 제 2 부분에 대하여 회전하는 제 3 부분; 및 상기 제 2 전개부와 결합하는 제 4 부분을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 제 2 전개부는, 상기 제 1 전개부의 제 4 부분과 결합하는 제 1 부분; 상기 제 1 부분으로부터 연장되고, 상기 커넥터부의 접점부가 노출되도록 적어도 하나의 홀을 포함하는 제 2 부분; 및 상기 제 2 부분으로부터 연장되고, 상기 지지부과 결합하는 제 3 부분을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 금속부는, 상기 제 1 전개부 내측에 배치된 제 1 금속 및 상기 리세스 상 면에 배치된 제 2 금속을 포함하고, 상기 제 1 금속 및 상기 제 2 금속은 상기 마그넷을 사이에 두고 서로 대면 배치될 수 있다. 본 발명의 일 실시예에 따르면, 상기 제 1 전개부 및 상기 제 2 전개부는 플라스틱 또는 패브릭 소재를 포함한 재질로 구성될 수 있다. 본 발명의 일 실시예에 따르면, 상기 제 1 전개부는, 상기 제 1 회전 부분의 상기 길이 방향으로 배치된 제 1 가상축을 가지면서, 상기 제 2 부분은 상기 제 1 가상축을 중심으로 상기 제 1 부분에 대하여 상대적으로 회전 운동하며, 상기 제 2 회전 부분의 상기 길이 방향으로 배치된 제 2 가상축을 가지면서, 상기 제 3 부분은 상기 제 2 가상축을 중심으로 상기 제 2부분에 대하여 상대적으로 회전 운동할 수 있다. 본 발명의 일 실시예에 따르면, 상기 제 1 전개부는 상기 제 3 회전 부분의 상기 길이 방향으로 배치된 제 3 가 상축을 가지면서, 상기 제 4 부분은 상기 제 1 가상축을 중심으로 상기 제 3 부분에 대하여 상대적으로 회전 운 동할 수 있다. 본 발명의 일 실시예에 따르면, 상기 제 2 전개부는 상기 복수 개의 접접들이 외부로 노출될 수 있도록 상기 접 점들과 대면되는 위치에 적어도 하나의 개구를 형성하고, 상기 마그넷은, 상기 커넥터 모듈의 제 1 영역에 적어 도 일부가 배치된 제 1 금속 및 상기 커넥터 모듈의 상기 제 1 영역의 양 측에 위치하는 제 2 영역 내에 배치되 는 제 2 금속과 자기적 인력을 유도할 수 있도록, 상기 제 1 영역 및 상기 제 2 영역에 걸쳐 배치될 수 있다. 본 발명의 일 실시예에 따르면, 상기 커넥터부는 상기 외부 장치와 전기적 연결을 제공하는 인쇄 회로기판 및 상기 인쇄 회로기판 상에 배치되고, 외부로 돌출된 접점부를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 접점부는 상기 외부 전자 장치와 전기적 접점을 형성하기 위한 복수 개의 접점들을 포함하고, 상기 제 2 전개부의 적어도 일부는 상기 복수 개의 접점들이 외부로 노출될 수 있도록 상기 복수 개의 접점들과 대면되는 위치에 적어도 하나의 개구를 형성할 수 있다. 본 발명의 일 실시예에 따르면, 상기 마그넷은, 상기 커넥터 모듈의 제 1 영역에 적어도 일부가 배치된 제 1 금 속 및 상기 커넥터 모듈의 상기 제 1 영역의 양 측에 위치하는 제 2 영역 내에 배치되는 제 2 금속과 자기적 인 력을 유도할 수 있도록, 상기 제 1 영역 및 상기 제 2 영역에 걸쳐 배치될 수 있다. 본 발명의 일 실시예에 따르면, 상기 1 차 전개에서, 상기 제 1 전개부의 상기 제 2 부분 또는 제 3 부분은 상 기 하우징의 제 2 면과 동일 평면 상에 위치하고, 상기 제 2 부분의 상면에 배치된 상기 커넥터부는 제 1 방향 을 향하도록 노출될 수 있다. 본 발명의 일 실시예에 따르면, 상기 제 2 차 전개에서, 상기 제 1 전개부의 상기 제 2 부분에 대하여 상기 제 2 전개부가 소정의 기울기를 가지도록 경사각을 형성하고, 상기 제 1 전개부의 상기 제 2 부분 내측에 배치된 적어도 하나의 자석은 상기 제 2 전개부 내측에 배치된 마그넷과 이격 배치될 수 있다. 본 발명의 일 실시예에 따르면, 상기 제 1 전개부 및 상기 제 2 전개부는 상기 리세스의 길이 방향에 대응하도 록 상기 제 1 영역 및 상기 제 2 영역에 걸쳐 배치되고, 상기 제 1 금속은 상기 제 1 전개부 내부에 배치되며, 상기 제 1 영역 및 상기 제 2 영역에 걸쳐 배치될 수 있다. 본 발명의 일 실시예에 따른 전자 장치는, 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향 을 향하는 제 2 면을 포함하는 하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및 상기 하우징의 상기 리세스 내에 배치되며, 외부 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스 외부로 전개 가능한 커넥터 모듈;을 포함하고, 상기 커넥터 모듈은, 제 1 부분이 상기 리세스 내측에 결합되고, 적어도 하나의 회전 부분의 회전을 통해 제 2 부분이 상기 리세스 외부 로 전개하는 전개부; 상기 전개부 내에 배치된 제 1 자성체; 상기 마그넷과 대면 배치되며, 상기 제 1 자성체과 자기 결합을 유도하는 제 2 자성체; 및 상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연결되는 커넥터부;를 포함하고, 상기 하우징의 상기 제 1 면에는 상기 리세스와 접하는 영역에 적어도 하나의 홈이 배치될 수 있다. 본 발명의 일 실시예에 따른 전자 장치는, 디스플레이를 포함하는 제1 전자 장치; 제 1 방향을 향하는 제 1 면 및 상기 제 1 방향과 반대인 제 2 방향을 향하는 제 2 면을 포함하는 하우징으로서, 상기 하우징은 상기 제 1 면의 일측에 적어도 상기 제 1 방향으로 개방된 리세스를 포함하는 하우징; 및 상기 하우징의 상기 리세스 내에 배치 가능하며, 상기 제1 전자 장치와의 전기적 결합을 위해 적어도 일부가 상기 리세스 외부로 전개 가능한 커 넥터 모듈;을 포함하고, 상기 커넥터 모듈은, 적어도 하나의 회전 부분의 회전을 통해 일부분이 상기 리세스 외 부로 전개하는 전개부; 상기 전개부 내에 배치된 마그넷; 상기 마그넷과 대면 배치되며, 상기 마그넷과 자기 결 합을 유도하는 적어도 하나의 금속; 및 상기 전개부의 전개에 의해 외부로 노출되어 상기 외부 장치와 연결되는 커넥터부를 포함할 수 있다. 이상에서 설명한 본 발명의 다양한 실시예의 전자장치는 전술한 실시 예 및 도면에 의해 한정되는 것은 아니고,"}
{"patent_id": "10-2017-0052971", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명의 기술적 범위 내에서 여러 가지 치환, 변형 및 변경이 가능함은 본 발명이 속하는 기술분야에서 통상 의 지식을 가진 자에게 있어 명백할 것이다."}
{"patent_id": "10-2017-0052971", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른, 전개 가능한 커넥터 모듈을 포함한 휴대용 전자 장치의 사시 도이다. 도 2 는 본 발명의 다양한 실시예에 따른, 휴대용 전자 장치의 제 2 전자 장치의 사시도이다. 도 3은 본 발명의 다양한 실시예에 따른, 휴대용 전자 장치 내의 커넥터 모듈을 부품별로 나타낸 분해 사시도이다. 도 4는 본 발명의 다양한 실시예에 따른, 전자 장치의 측면을 영역별로 절단한 단면도이다. 도 4a는 상기 제 1 전자 장치의 리세스 내에 수납 상태로 안착된 커넥터 모듈의 측면을 나타낸 도면이며, 도 4b는 상기 도 4a의 제 1 영역(S1)을 A-A'방향으로 절단한 단면도이고, 도 4c는 상기 도 4a의 제 2 영역을 B- B'방향으로 절단한 단면도이다. 도 5는 본 발명의 다양한 실시예에 따른, 제 1 전자 장치 커넥터 모듈의 제 1 차 전개 동작(M1)을 나타낸 사시도이다. 도 6a 내지 도 6c는 본 발명의 다양한 실시예에 따른, 제 1 전자 장치 커넥터 모듈의 제 1 차 전개 (M1) 동작에서 제 1 영역(도 4a의 제 1 영역(S1))을 절단한 단면도이다. 도 7은 본 발명의 다양한 실시예에 따른, 제 1 전자 장치 커넥터 모듈의 제 2 차 전개 동작(M2)을 나 타낸 사시도이다. 도 8은 본 발명의 다양한 실시예에 따른, 제 1 전자 장치 커넥터 모듈의 제 2 차 전개 동작(M2)에서 제 2 영역(도 4a의 제 2 영역(S2))을 절단한 단면도이다. 도 9는 본 발명의 다양한 실시예에 따른, 제 1 전자 장치와 제 2 전자 장치가 커넥터 모듈을 통 해 결합된 후, 서로 대면된 상태를 나타낸 사시도이다. 도 10은 본 발명의 다양한 실시예에 따른, 전자 장치의 커넥터 모듈의 전개 동작에 관한 흐름도이다."}
