{"patent_id": "10-2020-0041324", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0123756", "출원번호": "10-2020-0041324", "발명의 명칭": "유전자와 화합물과 질병의 관련문헌 추출시스템", "출원인": "광주과학기술원", "발명자": "이현주"}}
{"patent_id": "10-2020-0041324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 쿼리가 자연어로 입력되는 입력부;입력된 자연어를 개체로 인식하는 개체명 인식부;상기 개체명 인식부에서 인식된 개체를 이용하여, 유전자와 화합물과 질병과 관련되는 문헌을 제공하는 인공지능 학습모델;상기 인공지능학습모델에서 추출된 문헌을 후처리하는 후처리부; 및 상기 후처리부에서 처리되어 걸러진 문헌이 출력되는 출력부가 포함되는 유전자와 화합물과 질병의 관련문헌 추출시스템."}
{"patent_id": "10-2020-0041324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 인공지능 학습모델은 인공지능 학습장치에서 출력되는 결과물이고, 상기 인공지능 학습장치에는, 유전자와 화합물과 질병의 명칭을 문장별로 전처리하여 입력하는 전처리부;전처리된 입력정보를, 단어벡터 및 개체타입벡터으로 밀집벡터로 제작하는 임베딩부;상기 임베딩부의 출력결과를 학습하여 상기 인공지능 학습모델을 출력하는 학습부가 포함되는 유전자와 화합물과 질병의 관련문헌 추출시스템."}
{"patent_id": "10-2020-0041324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 전처리부는, 어느 문헌에서, 상기 유전자와 상기 화합물이 단일의 문장에 함께 포함되는 유전자/화합물 문장부와, 상기 질병이 포함되는 문장의 질병 문장부를,서로 정렬하여 상기 임베딩부로 출력하는 유전자와 화합물과 질병의 관련문헌 추출시스템."}
{"patent_id": "10-2020-0041324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 출력부는, 유전자와 화합물이 단일의 어느 문장에 포함되고 질병이 상기 단일의 어느 문장 또는 다른 문장에 포함되는 문헌을 포함하는 포지티브; 및상기 쿼리로 입력된 유전자, 화합물, 및 질병이 모두 포함되지만, 포지티브는 아닌 문헌을 포함하는네거티브를, 구분하여 표시하는 유전자와 화합물과 질병의 관련문헌 추출시스템."}
{"patent_id": "10-2020-0041324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 후처리부는, 공개특허 10-2021-0123756-4--인식된 언급이, 인식된 언급이 개체명으로 정규화된 후에, 사전에서 개체의 동의어로 포함되지 않은 경우. -어떤 언급이 두개 이상의 개체 타입으로 인식되는 경우,-유전자, 화합물, 또는 질병을 포함하는 문장이, 공부(study)의 하위어(hyponym)를 포함하는 경우,-부정어의 의미를 가지는 단어를 포함하는 경우, 및-유전자 명과 화합물 명이 파싱트리에 의존하여 접속사로 연결되는 경우에는 상기 포지티브로 검색된 문헌을 상기 포지티브에서 제외하는 유전자와 화합물과 질병의 관련문헌 추출시스템."}
{"patent_id": "10-2020-0041324", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 유전자와 화합물과 질병의 관련문헌 추출시스템에는, 사용자 쿼리가 자연어로 입력되는 입력부; 입력된 자연어를 개체로 인식하는 개체명 인식부; 상기 개체명 인식부에서 인식된 개체를 이용하여, 유전자와 화 합물과 질병과 관련되는 문헌을 제공하는 인공지능 학습모델; 상기 인공지능학습모델에서 추출된 문헌을 후처리 하는 후처리부; 및 상기 후처리부에서 처리되어 걸러진 문헌이 출력되는 출력부가 포함된다."}
{"patent_id": "10-2020-0041324", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 유전자와 화합물과 질병의 관련문헌 추출시스템에 관한 것이다."}
{"patent_id": "10-2020-0041324", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "특정의 질병을 대상으로 하는 약품개발 및 유전자의 연구에 있어서, 유전자와 화합물과 질병의 상호관계를 함께 인식하는 것은 중요한 일이다. 또한, 질병의 발생 및 진행에 있어서, 유전자와 화합물의 상호작용 및 그 매커니 즘은 방대한 실험에 의해서 알려져 있고, 다수의 공지문헌 데이터베이스(예를 들어, PebMed)에 의해서 공지되어 있다. 연구자들이 상기 공지문헌 데이터베이스에서 자기가 원하는 문헌을 추출해서 연구에 참조하는 것은 중요한 일이 다. 종래 대다수의 문헌 추출 시스템은 공지문헌 데이터베이스로부터, 유전자, 화합물, 및 질병 중의 두 개의 개체 가 인용되는 문헌만을 추출하여 볼 수 있을 뿐이이다. 예를 들어, 출원번호 10-2014-0015578, '유전자와 질병간 의 관계를 포함하는 문장 검색엔진'에는 그러한 기술이 개시되어 있다. 유전자, 화합물, 및 질병 모두의 관계를 이용하여 문서를 추출하는 기술로는, 출원번호 10-2010-0105299, '다차 원 인덱스를 이용하여 대용량 생명공학 문헌으로부터 유전자 질병 화합물 관계를 추출하는 방법'가 개시된 바가 있다. 그러나, 이 기술은 인덱싱 기술을 이용하는 것으로서 그 효과가 높지는 않다. 선행기술문헌 특허문헌 (특허문헌 0001) 출원번호 10-2014-0015578, '유전자와 질병간의 관계를 포함하는 문장 검색엔진' (특허문헌 0002) 출원번호 10-2010-0105299, '다차원 인덱스를 이용하여 대용량 생명공학 문헌으로부터 유전자 질병 화합물 관계를 추출하는 방법'"}
{"patent_id": "10-2020-0041324", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기되는 배경하에서 제안되는 것으로서, 유전자 화합물 질병의 관계를 잘 보여주는 문헌을 추출하는 유전자와 화합물과 질병의 관련문헌 추출시스템을 제안한다."}
{"patent_id": "10-2020-0041324", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 유전자와 화합물과 질병의 관련문헌 추출시스템에는, 사용자 쿼리가 자연어로 입력되는 입력부; 입력된 자연어를 개체로 인식하는 개체명 인식부; 상기 개체명 인식부에서 인식된 개체를 이용하여, 유전자와 화합물과 질병과 관련되는 문헌을 제공하는 인공지능 학습모델; 상기 인공지능학습모델에서 추출된 문헌을 후처 리하는 후처리부; 및 상기 후처리부에서 처리되어 걸러진 문헌이 출력되는 출력부가 포함된다."}
{"patent_id": "10-2020-0041324", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 특정 유전자와 특정 화합물과 특정 질병과의 세 가지 관계(triplet relationship)를 더 잘 이용할 수 있다."}
{"patent_id": "10-2020-0041324", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 구체적인 실시예를 상세하게 설명한다. 다만, 본 발명의 사상은 이하의 실시예에 제한되지 아니하고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에 포함되는 다른 실 시예를 구성요소의 부가, 변경, 삭제, 및 추가 등에 의해서 용이하게 제안할 수 있을 것이나, 이 또한 본 발명 사상의 범위 내에 포함된다고 할 것이다. 도 1은 실시예에 따른 유전자와 화합물과 질병의 관련문헌 추출시스템의 구성도이다. 도 1을 참조하면, 실시예에 따른 유전자와 화합물과 질병의 관련문헌 추출시스템에는, 사용자가 쿼리를 입력하 는 입력부, 입력된 자연어를 인식하는 개체명 인식부, 상기 개체명 인식부에서 인식된 개체를 이용하 여 유전자와 화합물과 질병과 관련되는 문헌을 제공하는 인공지능학습모델, 상기 인공지능학습모델에서 추출된 문헌을 후처리하는 후처리부, 및 상기 후처리부에서 처리되어 걸러진 문헌이 출력되는 출력부 가 포함된다. 상기 출력부는 유전자 및 화합물이 단일의 어느 한 문장에 포함되어 있고, 상기 질병이 다른 문장에 포함되 는 문헌을 추출할 수 있다. 여기서 문장은 마침표 단위로 끝나는 하나의 문장을 지칭한다. 이하 문장의 의미는 동일하다. 이와 같이 유전자 및 화합물이 어느 하나의 문장에 포함되고, 질병이 다른 문장에 포함되는 문헌을 검색하는 것으로서 가장 적합한 문헌을 검색할 수 있다. 실시예에 따른 유전자와 화합물과 질병의 관련문헌 추출시스템을 더 상세하게 설명한다. 사용자는 상기 입력부를 통하여, 유전자, 화합물, 및 질병의 명칭을 자신이 알고 있는 단어로 입력한다. 입 력된 단어는 상기 개체명 인식부에서 각각의 개체명 인식툴(NER tool)에 의해서 인식될 수 있다. 상기 유전자의 개체명 인식에는 GNormPlus가 사용될 수 있고, 상기 화합물의 개체명 인식에는 tmChem가 사용될 수 있고, 상기 질병의 개체명 인식에는 Dnorm이 사용될 수 있다. 인식된 유전자, 화합물, 및 질병의 개체명은, 인공지능학습모델로 입력되고, 상기 인공지능 학습모델은 적합한 문헌은 출력할 수 있다. 상기 인공지능학습모델의 학습장치는 도 2에 개시된다. 도 2를 참조하면, 딮러닝을 이용하는 인공지능 학습장치에는, 유전자와 화합물과 질병의 명칭을 문장별로 전처리하여 입력하는 전처리부, 전처리된 입력정보를, 단어벡터 및 개체타입벡터으로 밀집벡터로 제작하는 임베딩부, Bi-LSTM 층으로 예시되는 학습부가 포함된다. 상기 학습부를 통하여 학습된 학습모델 이 더 제공될 수 있다. 상기 학습모델은 상기 인공지능 학습모델에 저장될 수 있다. 상기 전처리부는, 어느 한 문헌에서, 유전자와 화합물이 단일의 문장에 포함되는 유전자/화합물 문장부 와, 질병이 포함되는 질병 문장부를 서로 정렬하여 입베딩부로 출력한다. 문헌의 데이터 베이스로는 Pubmed의 MEDLINE가 사용될 수 있다. 상기 임베딩부는, 두 개의 벡터를 사용할 수 있다. 첫번째는 워드 표현 벡터(word vector)로서, 상기 MEDLINE의 데이터베이스가 소정의 기법에 의해서 전처리된, 크기 200의 워드 벡터가 사용될 수 있다. 여기서 전 처리 기법으로는 'Mikolov T, Chen K, Corrado G, Dean J. Efficient estimation of word representations in vector space. arXiv preprint arXiv:13013781. 2013'가 사용될 수 있다. 두번째는 개체 타입 표현 벡터(entity type vector)로서, 상기 개체명 인식부로부터 얻어진 각 단어의 개체명을 나타낼 수 있다. 상기 임베딩부에서 밀집벡터로 만들어진 다음에, 학습부에서 학습된 후에, 학습모델을 제공할 수 있다. 상기 학습모델은 실시예에 따른 유전자와 화합물과 질병의 관련문헌 추출시스템의 상기 인공지능 학 습모델로 제공되어 질문자의 쿼리에 대응하여 결과물을 추출할 수 있다. 상기 학습모델은 포지티브 및 네거티브의 문헌을 추출할 수 있다. 상기 포지티브는 유전자와 화합 물이 단일의 어느 문장에 포함되고, 질병이 상기 단일의 어느 문장 또는 다른 문장에 포함되는 문헌을 의미할 수 있다. 상기 네거티브는 포지티브는 아니지만, 쿼리로 입력된 유전자, 화합물, 및 질병이 모두 포함되는 문헌 을 의미할 수 있다. 다시 도 1로 돌아가서, 상기 인공지능 학습모델은 사용자의 쿼리에 대응하여 문헌을 출력할 수 있다. 출력된 문헌에는 상기 포지티브로 검색되었지만, 잘못된 포지티브 문헌이 있다. 잘못된 포지티브 문헌을 추가로 걸러내 는 후처리부가 더 포함될 수 있다. 상기 후처리부가 추가로 걸러내는 규칙은 다음과 같다. 첫째: 인식된 언급(언급은 문헌에서 개체로 인식된 실제 단어를 의미할 수 있고, 이하 동일하다)은, 인식된 언 급이 개체명으로 정규화된 후에, 사전에서 개체의 동의어로 포함되지 않은 경우. 둘째: 어떤 언급이 두개 이상의 개체 타입으로 인식되는 경우. 예를 들어, 동일단어가 개체명 인식부에서 유전 자 및 화합물로 함께 인식되는 경우. 셋째: 유전자, 화합물, 또는 질병을 포함하는 문장이, 워드넷으로부터 공부(study)의 하위어(hyponym)를 포함하 는 경우. 이 경우에는 리서치의 목적으로서 실험이 아닐 수 있음. 넷째: 부정어, 예를 들어, not, never 등의 단어를 포함하는 경우. 다섯째: 유전자 명과 화합물 명이 파싱트리에 의존하여 접속사로 연결되는 경우. 이 경우에 대부분의 문헌은 유 전자와 화합물이 서로 작용하지 않음. 위와 같이 다섯가지의 규칙에 해당하는 문헌은 상기 포지티브에서 문헌을 제거할 수 있다. 다른 경우로, 해 당하는 문헌은 네거티브로 할당할 수 있다. 다른 경우로, 포지티브의 점수를 낮게 할 수도 있다. 상기 후처리부에서 처리된 결과는 출력부를 통하여 출력될 수 있다. 출력은, 이미 설명한 바와 같이, 포 지티브 및 네거티브로 출력될 수 있다. 상기 포지티브 및 네거티브에 포함되는 각 문헌은 점수를 가질 수 있다. 상기 점수는 상기 학습모델로 부터 주어질 수 있다. 도 3은 실시예의 효과를 설명하는 도면이다. 도 3은 질병의 종류를 알츠하이머(A), 고혈압(B), 유방암(C), 전립선암(D)의 경우에, 실시예의 시스템인 DigChem과, 종래 알려진, CTD, WDD, 및 DrugBank가 검색한 문헌의 갯수를 보인다. 도 3에 따르면, DrugBank는 작업자가 구분해 놓은 것으로서, 가장 우수한 결과를 보일 수 있다. 이에 대비하여, 실시예는 CTD 및 WDD에 비해서는 우수한 결과를 보이는 것을 알 수 있다. 산업상 이용가능성 본 발명에 따르면 유전자와 화합물과 질병의 관계를 연구하는 연구자에게 큰 도움이 되고, 나아가서, 의학산업 의 발전에 기여할 수 있다."}
{"patent_id": "10-2020-0041324", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 유전자와 화합물과 질병의 관련문헌 추출시스템의 구성도. 도 2는 인공지능학습모델의 학습장치를 보이는 도면. 도 3은 실시예의 효과를 설명하는 도면."}
