{"patent_id": "10-2021-0092496", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0011805", "출원번호": "10-2021-0092496", "발명의 명칭": "배터리 커버 체결 구조를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김기원"}}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 방향을 향하는 제1 하우징;상기 제1 방향과 반대되는 제2 방향을 향하도록 상기 제1 하우징과 체결되고, 상기 제2 방향을 향해 개방된 배터리 배치 공간 및 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간의 둘레를 따라 이격되어 형성되는복수의 제1 삽입부를 포함하는 제2 하우징; 및상기 배터리 배치 공간을 덮도록 상기 제2 하우징과 체결되는 커버를 포함하고,상기 커버는,제1 재질로 형성되는 제1 커버; 및제2 재질로 형성되고, 상기 제1 커버와 상기 제2 방향에서 결합되는 제2 커버를 포함하고,상기 제1 커버는,상기 복수의 제1 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되어 상기 제2 하우징 및커버를 체결시키는 복수의 제1 후크 구조를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 후크 구조는,일측이 자유단으로 형성되고 타측이 고정단으로 형성되는 외팔보;상기 외팔보가 형성되도록 상기 제1 커버의 일부가 절개된 절개부; 및상기 외팔보에서 상기 제1 방향으로 돌출되어 형성되는 제1 후크부를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제1 후크부는 상기 외팔보의 상기 자유단에 형성되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 제1 후크부는 상기 외팔보의 상기 고정단에 형성되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 외팔보의 상기 고정단은 상기 제1 커버의 다른 영역보다 두께가 작게 형성되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 제2 커버의 상기 제2 방향을 향하는 면에는 상기 자유단에 대응되는 위치에 가이드부가 형성되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0011805-3-제6항에 있어서,상기 가이드부가 상기 제1 방향으로 가압되면, 상기 외팔보가 상기 고정단을 기준으로 상기 제1 방향으로 돌출되도록 휘면서 상기 제1 후크부 및 제1 삽입부 간의 체결이 해제되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 가이드부는, 시각 또는 촉각에 의해 구별 가능하도록 형성되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,상기 제2 커버의 상기 제1 방향을 향하는 면에는 상기 절개부에 대응되는 위치에 상기 절개부의 적어도 일부를따라 함몰되는 홈부가 형성되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서,상기 제2 하우징은, 상기 제2 하우징의 외곽부에 상기 제2 하우징의 둘레를 따라 이격되어 형성되는 복수의 제2삽입부를 더 포함하고,상기 제1 커버는, 상기 복수의 제2 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제2 삽입부에 삽입되어 상기 제2 하우징 및 커버를 체결시키는 복수의 제2 후크부를 더 포함하는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 복수의 제1 후크 구조의 적어도 일부 및 상기 복수의 제2 후크부의 적어도 일부는 상기 제1 커버의 중심을기준으로 상기 제1 커버의 둘레 방향을 따라 서로 교대로 배치되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제3항에 있어서,상기 제1 후크 구조는, 각각의 상기 제1 후크부와의 사이에 각각의 상기 절개부가 위치되도록 각각의 상기 제1후크부와 인접한 위치에서 상기 제1 방향으로 돌출되어 형성되는 복수의 제3 후크부를 더 포함하고,상기 제2 하우징의 상기 제1 삽입부에는 상기 제1 후크부 및 제3 후크부가 삽입되고, 상기 제1 삽입부는 상기제3 후크부와 체결 가능하도록 형성된, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 외팔보의 상기 자유단이 상기 제1 방향으로 가압되면, 상기 외팔보가 상기 고정단을 기준으로 상기 제1 방향으로 돌출되도록 휘면서 상기 제1 후크부가 상기 제3 후크부로부터 멀어지고, 상기 제3 후크부의 구동 공간이확보되면서 상기 제3 후크부 및 제1 삽입부 간의 체결이 해제 가능해지는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 제2 재질은 상기 제1 재질보다 강성이 낮은, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 제1 커버 및 제2 커버는 이중사출 공정을 통해 일체로 형성되는, 전자 장치.공개특허 10-2023-0011805-4-청구항 16 후측을 향해 개방된 배터리 배치 공간 및 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간의 둘레를따라 이격되어 형성되는 복수의 제1 삽입부를 포함하는 하우징; 및상기 배터리 배치 공간을 덮도록 상기 하우징의 후측에 체결되는 커버를 포함하고,상기 커버는,제1 재질로 형성되는 제1 커버; 및제2 재질로 형성되고, 상기 제1 커버의 후측에 결합되는 제2 커버를 포함하고,상기 제1 커버는,상기 복수의 제1 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되어 상기 하우징 및 커버를 체결시키는 복수의 제1 후크 구조를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제1 후크 구조는,일측이 자유단으로 형성되고 타측이 고정단으로 형성되는 외팔보;상기 외팔보가 형성되도록 상기 제1 커버의 일부가 절개된 절개부; 및상기 외팔보에서 전측으로 돌출되어 형성되는 제1 후크부를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제2 커버의 후면에는 상기 자유단에 대응되는 위치에 가이드부가 형성되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 가이드부가 전측 방향으로 가압되면, 상기 외팔보가 상기 고정단을 기준으로 전측 방향으로 돌출되도록 휘면서 상기 제1 후크부 및 제1 삽입부 간의 체결이 해제되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1 방향을 향하는 제1 하우징;상기 제1 방향과 반대되는 제2 방향을 향하도록 상기 제1 하우징과 체결되고, 상기 제2 방향을 향해 개방된 배터리 배치 공간을 포함하는 제2 하우징; 및상기 배터리 배치 공간을 덮도록 상기 제2 하우징과 체결되는 커버를 포함하고,상기 제2 하우징은,상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간의 둘레를 따라 이격되어 형성되는 복수의 제1삽입부; 및상기 제2 하우징의 외곽부에 상기 제2 하우징의 둘레를 따라 이격되어 형성되는 복수의 제2 삽입부를 더 포함하고,상기 커버는,제1 재질로 형성되는 제1 커버; 및상기 제1 재질보다 강성이 낮은 제2 재질로 형성되고, 상기 제1 커버와 상기 제2 방향에서 결합되는 제2 커버를포함하고,공개특허 10-2023-0011805-5-상기 제1 커버는,상기 복수의 제1 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되어 상기 제2 하우징 및커버를 체결시키는 복수의 제1 후크 구조; 및 상기 복수의 제2 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제2 삽입부에 삽입되어 상기 제2 하우징 및커버를 체결시키는 복수의 제2 후크부를 포함하고,상기 제1 후크 구조는,일측이 자유단으로 형성되고 타측이 고정단으로 형성되는 외팔보;상기 외팔보가 형성되도록 상기 제1 커버의 일부가 절개된 절개부; 및상기 외팔보에서 상기 제1 방향으로 돌출되어 형성되는 제1 후크부를 포함하고,상기 외팔보의 상기 자유단이 상기 제1 방향으로 가압되면, 상기 외팔보가 상기 고정단을 기준으로 상기 제1 방향으로 돌출되도록 휘면서 상기 제1 후크부 및 제1 삽입부 간의 체결이 해제되는, 전자 장치."}
{"patent_id": "10-2021-0092496", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시 예에 있어서, 전자 장치는, 제1 방향을 향하는 제1 하우징; 상기 제1 방향과 반대되는 제 2 방향을 향하도록 상기 제1 하우징과 체결되고, 상기 제2 방향을 향해 개방된 배터리 배치 공간 및 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간의 둘레를 따라 이격되어 형성되는 복수의 제1 삽입부를 포함하는 제2 하우징; 및 상기 배터리 배치 공간을 덮도록 상기 제2 하우징(21 2)과 체결되는 커버를 포함하고, 상기 커버는, 제1 재질로 형성되는 제1 커버; 및 제2 재질로 형 성되고, 상기 제1 커버와 상기 제2 방향에서 결합되는 제2 커버를 포함하고, 상기 제1 커버는, 상기 복수의 제1 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되어 상기 제2 하우징 및 커버를 체결시키는 복수의 제1 후크 구조를 포함할 수 있다."}
{"patent_id": "10-2021-0092496", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 배터리 커버 체결 구조를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0092496", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "배터리로부터 전력을 공급받는 전자 장치는, 배터리 배치 공간이 형성된 하우징과 배터리 배치 공간을 덮는 배 터리 커버를 포함한다. 또한, 배터리의 교체를 위하여, 배터리 커버는 하우징에 착탈 가능하도록 형성된다. 예를 들어, 배터리 커버와 하우징은 스크류 체결 구조, 리브 체결 구조, 회전 잠금 구조 또는 후크 체결 구조를 통해 서로 착탈 가능하게 체결될 수 있다."}
{"patent_id": "10-2021-0092496", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "배터리 커버와 하우징이 스크류 또는 리브를 통해 체결되는 경우, 스크류 또는 리브와 같은 별도의 부품 또는 구조가 포함되게 되므로, 전자 장치의 사이즈가 증가될 수 있다. 배터리 커버와 하우징이 회전 잠금 구조를 통 해 체결되는 경우, 파트가 분할됨에 따라 심미성이 저하될 수 있으며, 배터리 커버를 회전시키기 위한 별도의 도구가 요구될 수 있다. 배터리 커버와 하우징이 후크 체결 구조를 통해 체결되는 경우, 체결력이 너무 강하면 체결을 해제하기 위해 별도의 도구가 요구되어 해체 시 제품 외관이 손상될 수 있고, 체결력이 너무 약하면 외 부 충격에 의해 배터리 커버가 하우징으로부터 의도치 않게 분리될 수 있다. 다양한 실시 예에 따르면, 배터리 배치 공간의 주변부에 후크부를 추가 배치하여 하우징과 배터리 커버의 체결 력을 개선할 수 있으며, 외부 충격에 의하여 배터리 커버가 하우징으로부터 이탈되는 것을 방지할 수 있다. 다양한 실시 예에 따르면, 배터리 커버의 이중 사출 구조를 통해 사용자가 배터리 커버를 분리하고자 하는 경우 에 배터리 커버를 쉽게 분리하게 할 수 있고, 일반적인 사용 상태에서는 배터리 커버의 체결력을 유지하여 그에 따른 안정성을 확보할 수 있다. 다양한 실시 예에 따르면, 배터리를 외부 충격으로부터 보호할 수 있으며, 배터리와 단자의 컨택을 안정적으로 유지시킬 수 있다."}
{"patent_id": "10-2021-0092496", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시 예에 있어서, 전자 장치는, 제1 방향을 향하는 제1 하우징; 상기 제1 방향과 반대되는 제2 방향을 향하도록 상기 제1 하우징과 체결되고, 상기 제2 방향을 향해 개방된 배터리 배치 공간 및 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간의 둘레를 따라 이격되어 형성되는 복 수의 제1 삽입부를 포함하는 제2 하우징; 및 상기 배터리 배치 공간을 덮도록 상기 제2 하우 징과 체결되는 커버를 포함하고, 상기 커버는, 제1 재질로 형성되는 제1 커버; 및 제2 재질로 형성되고, 상기 제1 커버와 상기 제2 방향에서 결합되는 제2 커버를 포함하고, 상기 제1 커버 는, 상기 복수의 제1 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되 어 상기 제2 하우징 및 커버를 체결시키는 복수의 제1 후크 구조를 포함할 수 있다. 다양한 실시 예에 있어서, 전자 장치는, 후측을 향해 개방된 배터리 배치 공간 및 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간의 둘레를 따라 이격되어 형성되는 복수의 제1 삽입부 를 포함하는 하우징; 및 상기 배터리 배치 공간을 덮도록 상기 하우징의 후측에 체결되 는 커버를 포함하고, 상기 커버는, 제1 재질로 형성되는 제1 커버; 및 제2 재질로 형성되고, 상 기 제1 커버의 후측에 결합되는 제2 커버를 포함하고, 상기 제1 커버는, 상기 복수의 제1 삽입 부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되어 상기 하우징 및 커버 를 체결시키는 복수의 제1 후크 구조를 포함할 수 있다. 다양한 실시 예에 있어서, 전자 장치는, 제1 방향을 향하는 제1 하우징; 상기 제1 방향과 반대되는 제2 방향을 향하도록 상기 제1 하우징과 체결되고, 상기 제2 방향을 향해 개방된 배터리 배치 공간 을 포함하는 제2 하우징; 및 상기 배터리 배치 공간을 덮도록 상기 제2 하우징과 체결되는 커 버를 포함하고, 상기 제2 하우징은, 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간 의 둘레를 따라 이격되어 형성되는 복수의 제1 삽입부; 및 상기 제2 하우징의 외곽부에 상기 제2 하우징의 둘레를 따라 이격되어 형성되는 복수의 제2 삽입부를 더 포함하고, 상기 커버는, 제1 재질로 형성되는 제1 커버; 및 상기 제1 재질보다 강성이 낮은 제2 재질로 형성되고, 상기 제1 커버 와 상기 제2 방향에서 결합되는 제2 커버를 포함하고, 상기 제1 커버는, 상기 복수의 제1 삽입 부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되어 상기 제2 하우징 및 커 버를 체결시키는 복수의 제1 후크 구조; 및 상기 복수의 제2 삽입부와 대응되는 위치에 형성 되고, 상기 복수의 제2 삽입부에 삽입되어 상기 제2 하우징 및 커버를 체결시키는 복수의 제2 후크부를 포함하고, 상기 제1 후크 구조는, 일측이 자유단(24111b)으로 형성되고 타측이 고정단 (24111a)으로 형성되는 외팔보; 상기 외팔보가 형성되도록 상기 제1 커버의 일부가 절개된 절개부; 및 상기 외팔보에서 상기 제1 방향으로 돌출되어 형성되는 제1 후크부를 포함하 고, 상기 외팔보의 상기 자유단(24111b)이 상기 제1 방향으로 가압되면, 상기 외팔보가 상기 고 정단(24111a)을 기준으로 상기 제1 방향으로 돌출되도록 휘면서 상기 제1 후크부 및 제1 삽입부 간의 체결이 해제될 수 있다."}
{"patent_id": "10-2021-0092496", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에 따르면, 하우징과 배터리 커버의 체결력을 개선할 수 있다. 다양한 실시 예에 따르면, 외부 충격에 의하여 배터리 커버가 하우징으로부터 이탈되는 것을 방지할 수 있다. 다양한 실시 예에 따르면, 배터리 커버의 이중 사출 구조를 통하여 사용자가 배터리 커버를 분리하고자 하는 경 우에 배터리 커버를 쉽게 분리하게 할 수 있다. 다양한 실시 예에 따르면, 일반적인 사용 상태에서는 배터리 커버의 체결력을 유지하여 그에 따른 안정성을 확 보할 수 있다. 다양한 실시 예에 따르면, 배터리를 외부 충격으로부터 보호할 수 있으며, 배터리와 단자의 컨택을 안정적으로 유지시킬 수 있다."}
{"patent_id": "10-2021-0092496", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예들을 첨부된 도면들을 참조하여 상세하게 설명한다. 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부여하고, 이에 대한 중복되는 설명은 생략하기로 한 다. 도 1은, 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치(10 1)에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가 될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테 나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다.인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다 른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또 는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청 할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있 다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로 서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구 들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \" 제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분 하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤 (예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이 런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시 예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포 함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circui t)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치 들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2a는 일 실시 예에 따른 전자 장치의 사시도이다. 도 2b는 일 실시 예에 따른 전자 장치의 분해 사시도이다. 도 2c는 일 실시 예에 따른 전자 장치에서 커버가 분리된 상태를 도시하는 사시도이다. 도 2a 내지 도 2c를 참조하면, 일 실시 예에 따른 전자 장치(예: 도 1의 전자 장치)는 대상물의 위치 를 추적하기 위한 장치일 수 있다. 예를 들어, 전자 장치는 대상물(예: 사물 또는 동물)에 부착되어, 사 용자에게 대상물의 위치를 알려줄 수 있다. 전자 장치는 타 전자 장치(예: 도 1의 전자 장치(102 또는 104))와 통신 가능할 수 있다. 예를 들어, 타 전자 장치(102 또는 104)는 스마트폰, PC, 스마트워치 및/또는 태블릿일 수 있다. 다만, 이는 예시적인 것으로, 전자 장치와 통신 가능한 타 전자 장치(102 또는 104)가 이에 한정되는 것은 아니다. 전자 장치는 타 전자 장치(102 또는 104)로 대상물의 위치에 대한 정보를 전 달할 수 있고, 사용자는 타 전자 장치(102 또는 104)를 통해 대상물의 위치를 확인할 수 있다. 전자 장치(20 0)는 음향을 발생시켜, 사용자가 대상물의 위치를 인지하도록 할 수 있다. 다만, 이는 예시적인 것으로, 전자 장치의 종류가 이에 한정되는 것은 아니다. 일 실시 예에서, 전자 장치는 하우징, 인쇄 회로 기판, 음향 발생부, 커버 및 관통 홀을 포함할 수 있다. 일 실시 예에서, 하우징은 전자 장치의 외형을 형성할 수 있다. 하우징은 내부에 부품(예: 인 쇄 회로 기판 및/또는 음향 발생부)을 배치하기 위한 공간을 형성할 수 있다. 하우징은 제1 하 우징 및 제2 하우징을 포함할 수 있다. 제1 하우징은 전자 장치의 전측(예: +z축 방향) 외형을 형성하고, 제2 하우징은 전자 장치의 후측(예: -z축 방향) 외형을 형성할 수 있다. 제1 하우 징은 전면 방향(예: +z축 방향)을 향하도록 배치될 수 있다. 제2 하우징은 제1 하우징과 반대 방향을 향하도록 배치될 수 있다. 예를 들어, 제2 하우징은 후면 방향(예: -z축 방향)을 향하도록 배치될 수 있다. 제1 하우징 및 제2 하우징은 실질적으로 서로 대응되는 형상으로 형성될 수 있다. 제1 하 우징 및 제2 하우징은 내부에 부품이 배치되기 위한 공간이 형성되도록 서로 체결될 수 있다. 도 2a 내지 도 2c에는 제1 하우징 및 제2 하우징이 모서리가 둥근 사각형 형상을 갖는 것으로 도시되었으나, 이는 예시적인 것으로, 제1 하우징 및 제2 하우징의 형상이 이에 한정되는 것은 아니 다. 일 실시 예에서, 제2 하우징은 배터리 배치 공간, 제1 삽입부 및 제2 삽입부를 포함할 수 있다. 일 실시 예에서, 배터리 배치 공간은 제2 하우징의 후측(예: -z축 방향)에 형성될 수 있다. 배터리 배치 공간은 후측(예: -z축 방향)을 향해 개방되도록 형성될 수 있다. 배터리 배치 공간에는 배터리(B)가 삽입 및 배치될 수 있다. 배터리 배치 공간은 적용되는 배터리(B)와 실질적으로 대응되는 형상 으로 형성될 수 있다. 예를 들어, 배터리(B)는 코인 형상의 배터리(B)일 수 있다. 다만, 이는 예시적인 것으 로, 적용되는 배터리(B)의 종류 및/또는 형상이 이에 한정되는 것은 아니다. 일 실시 예에서, 제1 삽입부는 후술하는 제1 후크부(예: 도 2g의 제1 후크부)가 삽입되는 공간일 수 있다. 제1 삽입부는 제1 후크 구조의 적어도 일부와 체결되기 위한 구조일 수 있다. 제1 삽입 부는 제1 후크부와 체결되기 위한 형상으로 형성될 수 있다. 예를 들어, 제1 삽입부는 제1 후크부와 체결 가능하도록, 대응되는 후크 형상(예: 도 2i의 후크 형상(2122a))을 형성할 수 있다. 제1 삽입부에 제1 후크부가 삽입됨으로써, 제1 삽입부와 제1 후크부가 서로 체결될 수 있다. 제1 삽입부는 복수 개 형성될 수 있다. 복수 개의 제1 삽입부는 배터리 배치 공간의 주변부에 배터리 배치 공간의 둘레를 따라 이격되어 형성될 수 있다. 배터리 배치 공간의 주변부 는, 배터리 배치 공간의 둘레와 인접한 영역을 의미할 수 있다. 예를 들어, 배터리 배치 공간의 주변부는, 제2 하우징의 둘레보다 배터리 배치 공간의 둘레에 더 가까운 영역을 의미할 수 있다. 예를 들어, 도 2c에 도시된 바와 같이, 5개의 제1 삽입부는 배터리 배치 공간의 주변부에 배터리 배치 공간의 둘레를 따라 이격되어 배치될 수 있다. 다만, 이는 예시적인 것으로, 제1 삽입부의 개수 및/또는 위치가 이에 한정되는 것은 아니다. 일 실시 예에서, 제2 삽입부는 후술하는 제2 후크부(예: 도 2d의 제2 후크부)가 삽입되는 공간일 수 있다. 제2 삽입부는 제2 후크부와 체결되기 위한 형상으로 형성될 수 있다. 예를 들어, 제2 삽입부는 제2 후크부와 체결 가능하도록, 대응되는 후크 형상을 형성할 수 있다. 제2 삽입부 에 제2 후크부가 삽입됨으로써, 제2 삽입부와 제2 후크부가 서로 체결될 수 있다. 제 2 삽입부는 복수 개 형성될 수 있다. 복수 개의 제2 삽입부는 제2 하우징의 외곽부에 제2 하 우징의 둘레를 따라 이격되어 형성될 수 있다. 제2 하우징의 외곽부는, 제2 하우징의 둘레와 인접한 영역을 의미할 수 있다. 예를 들어, 제2 하우징의 외곽부는, 배터리 배치 공간의 둘레보다 제2 하우징의 둘레에 더 가까운 영역을 의미할 수 있다. 제2 삽입부는 제1 삽입부보다 제2 하우징의 중심을 기준으로 더 외측에 형성될 수 있다. 예를 들어, 8개의 제2 삽입부는 제2 하우징 의 외곽부에 제2 하우징의 둘레를 따라 이격되어 배치될 수 있다. 다만, 이는 예시적인 것으로, 제2 삽입부의 개수 및/또는 위치가 이에 한정되는 것은 아니다. 일 실시 예에서, 인쇄 회로 기판에는 전자 장치의 작동을 위한 부품들이 장착될 수 있다. 예를 들어, 인쇄 회로 기판에는 프로세서, 메모리, 통신 모듈, 위치 추적 모듈 및/또는 인터페이스가 장착될 수 있다. 다만, 이는 예시적인 것으로 인쇄 회로 기판에 장착되는 부품이 이에 한정되는 것은 아니다. 일 실시 예에서, 음향 발생부(예: 도 1의 음향 출력 모듈)는 전자 장치의 외부로 음향을 출력할 수 있다. 음향 발생부는 인쇄 회로 기판에 연결될 수 있다. 예를 들어, 음향 발생부는 스피커 및/또는 부저(buzzer)를 포함할 수 있다. 일 실시 예에서, 커버는 배터리 배치 공간을 덮도록 제2 하우징의 후측(예: -z축 방향)에 체결 될 수 있다. 커버는 제2 하우징에 착탈 가능하도록 체결될 수 있다. 커버는 후술하는 제1 후 크 구조(예: 도 2d의 제1 후크 구조) 및 제2 후크부를 통하여 제2 하우징과 착탈 가능하도록 체결될 수 있다. 예를 들어, 제1 후크부 및 제2 후크부가 각각 제1 삽입부 및 제2 삽입부 에 삽입됨으로써, 커버 및 제2 하우징이 서로 체결될 수 있다. 또한, 제1 후크부 및 제2 후크부가 각각 제1 삽입부 및 제2 삽입부로부터 분리됨으로써, 커버와 제2 하우징 간의 체결이 해제될 수 있다. 커버는 제2 하우징과 실질적으로 대응되는 형상으로 형성될 수 있다. 다만, 이는 예시적인 것으로, 커버의 형상이 이에 한정되는 것은 아니다. 일 실시 예에서, 커버는 제1 커버 및 제2 커버를 포함할 수 있다. 일 실시 예에서, 제1 커버는 제2 하우징과 직접 체결되는 구성일 수 있다. 제2 커버는 제1 커버 와 후측(예: -z축 방향)에서 결합될 수 있다. 제2 커버는 실질적으로 전자 장치의 후측(예: -z 축 방향) 외관을 형성하는 구성일 수 있다. 제1 커버 및 제2 커버는 실질적으로 서로 대응되는 형상 으로 형성될 수 있다. 일 실시 예에서, 관통 홀은 전자 장치의 일측을 관통하도록 형성될 수 있다. 예를 들어, 관통 홀 은 전자 장치의 일 코너 부근을 관통하도록 형성될 수 있다. 관통 홀은 전자 장치를 대상물에 연결하기 위한 체결 부재(예: 고리)가 통과되는 구멍일 수 있다. 관통 홀은 적어도 제1 하우징 , 제2 하우징 및 커버를 관통하여 형성될 수 있다. 다만, 도 2a에 도시된 관통 홀은 예시 적인 것으로, 관통 홀의 위치, 크기 및/또는 형상이 이에 한정되는 것은 아니다. 도 2d는 일 실시 예에 따른 커버의 사시도이다. 도 2e는 도 2d의 A-A 선을 따른 단면 사시도이다. 도 2d 및 도 2e를 참조하면, 일 실시 예에서 제1 커버는 제1 재질로 형성되고, 제2 커버는 제2 재질 로 형성될 수 있다. 제2 재질은 제1 재질과 상이한 재질일 수 있다. 예를 들어, 제2 재질은 제1 재질보다 강 성이 낮은 재질일 수 있다. 예를 들어, 제2 재질은 제1 재질보다 높은 탄성을 갖는 재질일 수 있다. 예를 들 어, 제2 재질은 탄성력 및 복원력이 높은 재질일 수 있다. 예를 들어, 제2 재질은 우레탄 및/또는 고무 (rubber) 재질을 포함할 수 있다. 예를 들어, 제1 재질은 폴리카보네이트(polycarbonate, PC)재질을 포함할 수 있다. 다만, 이는 예시적인 것으로, 제1 재질 및/또는 제2 재질의 종류가 이에 한정되는 것은 아니다. 일 실시 예에서, 제1 커버 및 제2 커버는 이중사출 공정을 통해 일체로 형성될 수 있다. 예를 들어, 커버는 제2 커버가 제1 커버의 후면(예: -z축 방향 면)을 덮는 형태로, 이중사출 공정을 통해 일체로 형성될 수 있다. 이와 같은 구성에 의하면, 커버는 심리스한 형상으로 형성될 수 있다. 다만, 이 는 예시적인 것으로, 제1 커버 및 제2 커버는 별도 파트로 형성되고, 체결 구조를 통하여 결합될 수 도 있다. 일 실시 예에서, 제1 커버는 제1 후크 구조 및 제2 후크부를 포함할 수 있다. 일 실시 예에서, 제1 후크 구조는 적어도 일부가 제2 하우징(예: 도 2c의 제2 하우징)의 제1 삽입부 (예: 도 2c의 제1 삽입부)에 삽입되어, 제1 삽입부와 체결되는 구성일 수 있다. 제1 후크 구조 는 복수 개 형성될 수 있다. 제1 후크 구조는 제1 삽입부와 대응되는 개수로 형성될 수 있 다. 제1 후크 구조는 제1 삽입부와 실질적으로 대응되는 위치에 형성될 수 있다. 커버가 제 2 하우징에 체결된 상태를 기준으로, 복수의 제1 후크 구조는 배터리 배치 공간(예: 도 2c의 배터리 배치 공간)의 주변부에 배터리 배치 공간의 둘레를 따라 이격되어 형성될 수 있다. 예를 들어, 도 2d에 도시된 바와 같이, 5개의 제1 후크 구조는 도 2c에 도시된 5개의 제1 삽입부와 대응되는 위치 에 형성될 수 있다. 다만, 이는 예시적인 것으로, 제1 후크 구조의 개수 및/또는 위치가 이에 한정되는 것은 아니다. 일 실시 예에서, 제2 후크부는 적어도 일부가 제2 하우징(예: 도 2c의 제2 하우징)의 제2 삽입부(예: 도 2c의 제2 삽입부 2123)에 삽입되어, 제2 삽입부와 체결되는 구성일 수 있다. 제2 후크부 는 복수 개 형성될 수 있다. 제2 후크부는 제2 삽입부와 대응되는 개수로 형성될 수 있다. 제2 후크부는 제2 삽입부와 실질적으로 대응되는 위치에 형성될 수 있다. 커버가 제2 하우징 에 체결된 상태를 기준으로, 복수의 제2 후크부는 제2 하우징의 외곽부에 제2 하우징의 둘레를 따라 이격되어 형성될 수 있다. 제2 후크부는 제1 커버의 외곽부에 제1 커버의 둘레를 따라 이격되어 형성될 수 있다. 예를 들어, 도 2d에 도시된 바와 같이, 8개의 제2 후크부는 8개의 제2 삽입부와 각각 대응되는 위치에 형성될 수 있다. 다만, 이는 예시적인 것으로, 제2 후크부의 개수 및/또는 위치가 이에 한정되는 것은 아니다. 일 실시 예에서, 제2 후크부는 제1 커버의 전면(예: +z축 방향 면)에서 전측 방향(예: +z축 방향)으 로 돌출되어 형성될 수 있다. 제2 후크부의 헤드(2412a)는 실질적으로 제1 커버의 중심을 향하는 방향으로 형성될 수 있다. 제2 후크부의 일 측면(2412b)은 경사지게 형성될 수 있다. 예를 들어, 제2 후크부의 일 측면(2412b)은, 제2 후크부의 외측 폭이 내측 폭보다 더 길어지는 방향으로 경사지게 형성될 수 있다. 예를 들어, 제2 후크부의 x-y 평면에 대한 단면은 외측의 길이가 내측이 길이보다 긴 사다리꼴 형상으로 형성될 수 있다. 제2 후크부의 일 측면(2412b)이 경사지게 형성되는 경우, 제2 후크 부와 제2 삽입부 간의 체결 해제가 용이해질 수 있다. 예를 들어, 일정한 힘이 가해지는 경우, 제 2 후크부는 제2 삽입부로부터 분리될 수 있다. 일 실시 예에서, 복수의 제1 후크 구조의 적어도 일부 및 복수의 제2 후크부의 적어도 일부는 제1 커버의 중심을 기준으로 제1 커버의 둘레 방향을 따라 서로 교대로 배치될 수 있다. 예를 들어, 제1 커버의 둘레 방향으로, 인접한 2개의 제1 후크 구조의 사이에 제2 후크부가 배치될 수 있다. 예를 들어, 제1 커버의 둘레 방향으로, 인접한 2개의 제2 후크부의 사이에 제1 후크 구조가배치될 수 있다. 이와 같은 배치에 의하면, 커버의 둘레 방향을 따라 체결력을 고르게 분배할 수 있다. 다만, 이는 예시적인 것으로, 복수의 제1 후크 구조 및 복수의 제2 후크부의 배치가 이에 한정되는 것은 아니다. 예를 들어, 도 2d와 같이, 일부 인접한 2개의 제2 후크부의 사이에는 제1 후크 구조(241 1)가 형성되지 않을 수도 있다. 도 2f는 일 실시 예에 따른 제1 후크 구조의 사시도이다. 도 2g는 도 2f의 B-B 선을 따른 단면 사시도이 다. 도 2f 및 도 2g를 참조하면, 일 실시 예에서, 제1 후크 구조는 외팔보, 절개부 및 제1 후 크부를 포함할 수 있다. 일 실시 예에서, 외팔보는 일측이 자유단(24111b)으로 형성되고 타측이 고정단(24111a)으로 형성될 수 있다. 외팔보는 절개부에 의해 형성될 수 있다. 절개부는 외팔보가 형성되도록 제1 커버의 일부가 절개되는 영역일 수 있다. 즉, 외팔보는 고정단(24111a)을 제외한 제1 커버 의 일부 영역(예: 절개부)이 절개됨으로써 형성될 수 있다. 예를 들어, 절개부는 \"U\"자형 또는 각진 \"U\"자형으로 형성될 수 있다. 외팔보는 고정단(24111a)이 자유단(24111b)보다 상대적으로 제 1 커버의 외측에 위치되는 방향으로 형성될 수 있다. 외팔보의 길이 방향은 실질적으로 제1 커버 의 외측에서 중심을 향하는 방향일 수 있다. 일 실시 예에서, 외팔보의 고정단(24111a)의 적어도 일부는 제1 커버의 다른 영역(예: 고정단 (24111a)을 제외한 영역)보다 두께가 작게 형성될 수 있다. 예를 들어, 고정단(24111a)의 전면(예: +z축 방향 면)은 후측 방향(예: -z축 방향)으로 단차지게 함몰될 수 있다. 다만, 이는 예시적인 것으로, 고정단(24111a) 의 형상 및/또는 두께가 이에 한정되는 것은 아니다. 예를 들어, 고정단(24111a)은 그 두께가 연속적으로 작아 지도록 형성될 수도 있다. 일 실시 예에서, 제1 후크부는 외팔보의 전면(예: +z축 방향 면)에서 전측 방향(예: +z축 방향) 으로 돌출되어 형성될 수 있다. 제1 후크부의 헤드(24113a)는 실질적으로 제1 커버의 중심을 향하 는 방향으로 형성될 수 있다. 제1 후크부는 적어도 일부가 제2 하우징(예: 도 2c의 제2 하우징)의 제1 삽입부(예: 도 2c의 제1 삽입부)에 삽입되어, 제1 삽입부와 체결되는 구성일 수 있다. 제1 후 크부는 실질적으로 외팔보의 자유단(24111b)에 또는 자유단(24111b)과 인접하게 형성될 수 있다. 예를 들어, 제1 후크부는 외팔보의 자유단(24111b)의 전면(예: +z축 방향 면)에서 전측 방향(예: -z축 방향)으로 돌출되어 형성될 수 있다. 다만, 이는 예시적인 것으로, 제1 후크부는 외팔보의 자유단(24111b)과 고정단(24111a) 사이에 형성될 수도 있다. 일 실시 예에서, 제2 커버는 전면(예: +z축 방향 면)에는 홈부가 형성될 수 있다. 홈부는 제 1 커버의 절개부에 대응되는 위치에 형성될 수 있다. 홈부는 절개부의 적어도 일부 를 따라 형성될 수 있다. 예를 들어, 홈부는 \"U\"자형 또는 각진 \"U\"자형으로 형성될 수 있다. 홈부 는 제2 커버는 전면(예: +z축 방향 면)에서 후측 방향(예: -z축 방향)으로 함몰되어 형성될 수 있다. 홈부가 형성된 영역은 제2 커버의 다른 영역(예: 홈부가 형성되지 않은 영역)보다 두 께가 작을 수 있다. 도 2h는 일 실시 예에 따른 커버의 후면 사시도이다. 도 2h를 참조하면, 일 실시 예에서, 제2 커버의 후면(예: -z축 방향 면)에는 가이드부가 형성될 수 있다. 제1 커버 및 제2 커버가 결합된 상태를 기준으로, 가이드부는 외팔보(예: 도 2f의 외팔 보)의 자유단(예: 도 2f의 자유단(24111b))에 대응되는 위치에 형성될 수 있다. 가이드부는 제1 후크 구조와 대응되는 개수로 형성될 수 있다. 예를 들어, 도 2h와 같이, 가이드부는 5개 형성될 수 있다. 다만, 이는 예시적인 것으로, 가이드부의 개수 및/또는 위치가 이에 한정되는 것은 아니다. 일 실시 예에서, 가이드부는 시각 및/또는 촉각에 의해 구별 가능하도록 형성될 수 있다. 예를 들어, 도 2h와 같이, 가이드부는 제2 커버의 후면(예: -z축 방향 면)에서 후측 방향(예: -z축 방향)으로 돌출 되어 형성될 수 있다. 다만, 이는 예시적인 것으로, 가이드부의 형상이 이에 한정되는 것은 아니다. 예 를 들어, 가이드부는 제2 커버의 후면(예: -z축 방향 면)에서 전측 방향(예: +z축 방향)으로 함몰되어 형성될 수도 있다. 도 2i는 일 실시 예에 따른 전자 장치의 부분 단면도이다. 이하에서는 도 2i를 참조하여, 제1 후크부 및 제1 삽입부 간의 체결을 해제하는 과정을 설명하도록 한다. 제1 후크부 및 제1 삽입부 간의 체결은 상대적으로 강하게 형성되어, 이하에서 설명하는 구동을 통하여 그 체결이 해제되도록 구성될 수 있다. 일 실시 예에서, 사용자는 제2 커버의 후면(예: -z축 방향 면)에 형성된 가이드부를 통하여, 커버 를 분리하기 위해 가압해야 할 위치를 파악할 수 있다. 즉, 가이드부는 사용자에게 커버의 분 리를 위해 가압해야 할 위치를 안내할 수 있다. 사용자는 커버를 하우징(예를 들어, 제2 하우징 )으로부터 분리하기 위하여, 가이드부를 전측 방향(예: +z축 방향)으로 가압할 수 있다. 가이드부 가 전측 방향(예: +z축 방향)으로 가압되면, 가이드부와 접촉하고 있는 자유단(24111b)에 가압력이 전달되게 되고, 자유단(24111b)이 전측 방향(예: +z축 방향)으로 눌려질 수 있다. 따라서, 외팔보는 고 정단(24111a)을 기준으로 전측 방향(예: +z축 방향)으로 돌출되도록 휘어질 수 있다. 외팔보가 휘어지 게 되면, 자유단(24111b)에 위치된 제1 후크부가 전측 방향(예: +z축 방향) 및/또는 외측 방향(예: 도 2i를 기준으로 +y축 방향)으로 이동될 수 있다. 결과적으로, 제1 후크부 및 제1 삽입부의 후크 형상(2122a)이 서로 멀어지게 되면서, 제1 후크부 및 제1 삽입부 간의 체결이 해제될 수 있다. 일 실시 예에서, 외팔보의 고정단(24111a)의 두께가 다른 영역(예: 고정단(24111a)을 제외한 영역)에서 의 두께보다 작게 형성됨으로써, 외팔보는 더욱 용이하게 휘어질 수 있다. 또한, 제2 커버가 제1 커버보다 강성이 낮거나 탄성이 높은 재질로 형성된다는 점에서, 가이드부가 가압될 때 제2 커버 가 제1 커버보다 쉽게 변형될 수 있으므로, 가이드부에 가해지는 가압력이 외팔보의 자 유단(24111b)으로 원활하게 전달될 수 있다. 또한, 제2 커버에 형성된 홈부로 인하여, 제2 커버 의 절개부에 대응되는 영역의 두께가 다른 영역(예: 홈부가 형성되지 않은 영역)의 두께보다 작게 형성되므로, 가이드부가 가압될 때 가이드부에 인접한 영역의 변형 정도가 증가될 수 있고, 이에 따라 가이드부에 가해지는 가압력이 외팔보의 자유단(24111b)으로 원활하게 전달될 수 있다. 도 2a 내지 도 2i를 통해 설명한 바와 같이, 일 실시 예에 따른 전자 장치는 제1 후크 구조 및 제2 후크부를 통해 커버가 하우징으로부터 체결 또는 분리될 수 있다. 사용자는 커버를 하우 징으로부터 분리하기 위하여, 커버의 외곽부에 일정한 힘을 가하여 제2 후크부를 제2 삽입부 로부터 분리하고, 가이드부에 일정한 힘을 가하여 제1 후크부를 제1 삽입부로부터 분 리할 수 있다. 예를 들어, 제2 후크부 및 제2 삽입부 간의 체결력은, 제1 후크부 및 제1 삽입부 간의 체결력보다 약하게 형성될 수 있다. 예를 들어, 사용자는 1차적으로 제2 후크부를 제 2 삽입부로부터 분리하고, 2차적으로 제1 후크부를 제1 삽입부로부터 분리할 수 있다. 이 와 같은 2중 체결 구조에 의하면, 비교 예에 따른 1중 체결 구조(예: 전자 장치의 외곽부에만 후크부가 있는 구 조)에 비하여, 전자 장치의 외곽부에 위치한 제2 후크부 및 제2 삽입부 간의 체결력을 상대적 을 약하게 형성할 수 있다. 따라서, 사용자가 커버를 분리하기 위해 무리한 힘을 가하지 않아도 되므로, 사용자가 커버를 분리하는 과정에서 전자 장치의 외관이 파손되는 것을 방지할 수 있다. 또한, 제1 후크부 및 제1 삽입부가 제2 후크부 및 제2 삽입부보다 상대적으로 더 내측에 위치하 기 때문에, 제1 후크부 및 제1 삽입부 간의 체결은 외부 충격으로부터 상대적으로 보호될 수 있다. 예를 들어, 외부 충격에 의하여 설령 제2 후크부 및 제2 삽입부 간의 체결이 해제되는 경우 에도, 제1 후크부 및 제1 삽입부 간의 체결은 해제되지 않고 유지될 수 있다. 따라서, 외부 충격 에 의하여 의도치 않게 커버가 하우징으로부터 분리되는 것이 방지될 수 있다. 아울러, 제1 후크부 및 제1 삽입부가 배터리 배치 공간에 인접하게 위치되기 때문에, 외부 충격에 의하여 설령 제2 후크부 및 제2 삽입부 간의 체결이 해제되는 경우에도, 제1 후크부 및 제1 삽입부 간의 체결을 통해 배터리 배치 공간이 커버에 의해 안정적으로 덮여질 수 있으므로, 배터리 (B)와 단자의 컨택이 안정적으로 유지될 수 있다. 또한, 커버의 외측에 위치한 제2 커버가 강성이 낮거나 탄성이 높은 재질로 형성된다는 점에서, 제2 커버가 외부 충격을 흡수할 수 있고, 그에 따라 전자 장치가 외부 충격으로부터 보호될 수 있다. 일 실시 예에 따른 전자 장치에서, 가이드부를 통하여 사용자에게 가압해야 할 위치를 표시함으로써, 사용자로 하여금 커버를 분리하고자 하는 경우에 커버를 하우징으로부터 쉽게 분리하게 할 수 있다. 또한, 커버와 하우징 간의 2중 체결 구조에 의하여, 사용자의 일반적인 동작 또 는 외부 충격에 의해, 커버가 의도치 않게 분리되는 것을 제한할 수 있으며, 그에 따라 일반적인 사용 상 태에서는 커버의 체결력을 유지하여 전자 장치의 안정성을 확보할 수 있다. 아울러, 스크류와 같은 별도의 구성이 요구되지 않으므로, 부품 수를 줄여 전자 장치의 실장성을 향상시키고, 전자 장치의 크기를 줄일 수 있다. 도 2j는 일 실시 예에 따른 커버의 후면 사시도이다. 도 2j를 참조하면, 일 실시 예에 따른 커버(240')의 가이드부(2422')는 제2 커버(242')의 후면(예: -z축 방향 면)의 일부 영역이 거칠기가 다르도록 형성될 수 있다. 예를 들어, 가이드부(2422')는 식각 또는 부식 공정에 의하여, 다른 영역(예: 가이드부(2422')가 형성되지 않은 영역)보다 거칠기가 다르도록 형성될 수 있다. 일 실 시 예에 따른 커버(240')의 가이드부(2422')는 제2 커버(242')의 후면(예: -z축 방향 면)의 일부 영역이 다른 영역(예: 가이드부(2422')가 형성되지 않은 영역)보다 색깔 및/또는 패턴이 다르도록 형성될 수 있다. 다만, 이는 예시적인 것으로, 가이드부(2422')의 형상 및/또는 종류가 이에 한정되는 것은 아니다. 도 3a는 일 실시 예에 따른 커버의 사시도이다. 도 3b는 일 실시 예에 따른 전자 장치의 부분 단면도이다. 도 3a 및 도 3b에 따른 전자 장치를 설명함에 있어서, 도 2a 내지 도 2i에 따른 전자 장치와 실질적 으로 동일한 구성에 대하여는 구체적인 설명을 생략하도록 한다. 도 3a 및 도 3b를 참조하면, 일 실시 예에서, 제1 후크부는 실질적으로 외팔보의 고정단(34111 a)에 또는 고정단(34111a)과 인접하게 형성될 수 있다. 예를 들어, 제1 후크부는 외팔보의 고정 단(34111a)의 전면(예: +z축 방향 면)에서 전측 방향(예: -z축 방향)으로 돌출되어 형성될 수 있다. 제1 후크 부의 헤드(34113a)는 실질적으로 제1 커버의 중심을 향하는 방향으로 형성될 수 있다. 일 실시 예에서, 외팔보의 고정단(34111a)의 적어도 일부는 제1 커버의 다른 영역(예: 외팔보 의 고정단(34111a)을 제외한 영역)보다 두께가 작게 형성될 수 있다. 예를 들어, 고정단(34111a)의 전 면(예: +z축 방향 면)은 후측 방향(예: -z축 방향)으로 단차지게 함몰될 수 있다. 고정단(34111a)의 두께가 얇 아지는 위치는 제1 후크부가 형성되는 위치보다 제1 커버의 중심을 기준으로 상대적으로 더 외측에 위치될 수 있다. 다만, 이는 예시적인 것으로, 고정단(34111a)의 형상 및/또는 두께가 이에 한정되는 것은 아 니다. 예를 들어, 고정단(34111a)은 그 두께가 연속적으로 작아지도록 형성될 수도 있다. 일 실시 예에서, 사용자는 커버를 하우징(예를 들어, 제2 하우징)으로부터 분리하기 위하여, 가 이드부를 전측 방향(예: +z축 방향)으로 가압할 수 있다. 가이드부가 전측 방향(예: +z축 방향)으 로 가압되면, 가이드부와 접촉하고 있는 자유단(34111b)에 가압력이 전달되게 되고, 자유단(34111b)이 전 측 방향(예: +z축 방향)으로 눌려질 수 있다. 따라서, 외팔보는 고정단(34111a)을 기준으로 전측 방향 (예: +z축 방향)으로 돌출되도록 휘어질 수 있다. 외팔보가 휘어지게 되면, 고정단(34111a)에 위치된 제1 후크부가 전측 방향(예: +z축 방향) 및/또는 외측 방향(예: 도 3b를 기준으로 +y축 방향)으로 이동 될 수 있다. 결과적으로, 제1 후크부 및 제1 삽입부의 후크 형상(3122a)이 서로 멀어지게 되면서, 제1 후크부 및 제1 삽입부 간의 체결이 해제될 수 있다. 예를 들어, 도 3a 및 도 3b에 따른 실시 예는 타 구성과의 간섭으로 인하여 자유단(34111b)에 제1 후크부를 형성하기 어려운 경우에 적용될 수 있다. 한편, 외팔보가 휘어지는 과정에서, 외팔보의 자유단(34111b)이 제2 하우징 과 간섭되지 않도록, 제2 하우징에는 자유단(34111b)과 대응되는 위치에 외팔보가 휘어질 수 있는 공간을 제공하는 홈이 형성될 수 있다. 도 4a는 일 실시 예에 따른 커버의 사시도이다. 도 4b는 일 실시 예에 따른 전자 장치의 부분 단면도이다. 도 4a 및 도 4b에 따른 전자 장치를 설명함에 있어서, 도 2a 내지 도 2i에 따른 전자 장치와 실질적 으로 동일한 구성에 대하여는 구체적인 설명을 생략하도록 한다. 도 4a 및 도 4b를 참조하면, 일 실시 예에서, 제1 커버는 제1 후크 구조 및 제2 후크부 를 포함할 수 있다. 제2 하우징은 제1 삽입부 및 제2 삽입부(미도시)(예: 도 2c의 제2 삽입부)를 포함할 수 있다. 일 실시 예에서, 제1 후크 구조는 외팔보, 절개부, 제1 후크부 및 제3 후크부 를 포함할 수 있다. 외팔보, 절개부 및 제1 후크부는 도 2f 및 도 2g를 통해 설 명한 것과 실질적으로 동일한 것으로, 지나친 반복 기재를 피하기 위해 도 2f 및 도 2g를 통해 설명한 것을 원 용하도록 한다. 일 실시 예에서, 제3 후크부는 제1 후크부와 인접한 위치에 형성될 수 있다. 제3 후크부(4411 4)와 제1 후크부 사이에는 절개부가 위치될 수 있다. 제3 후크부는 제1 후크부 보다 제1 커버의 중심에 더 가깝게 위치될 수 있다. 예를 들어, 제3 후크부는 제1 후크부 와의 사이에 절개부가 위치되고 제1 후크부와 인접하도록, 외팔보의 길이 방향의 연장선 상에 위치될 수 있다. 제3 후크부는 제1 커버의 전면(예: +z축 방향 면)에서 전측 방향(예: +z축 방향)으로 돌출되어 형성될 수 있다. 제3 후크부의 헤드(44114a)는 실질적으로 제1 후크부의 헤 드(44113a)와 동일한 방향으로 형성될 수 있다. 예를 들어, 제3 후크부의 헤드(44114a)는 실질적으로 제1 커버의 중심을 향하는 방향으로 형성될 수 있다. 제3 후크부는 제1 후크부와 대응되는 개수로 형성될 수 있다. 일 실시 예에서, 제1 삽입부는 제1 후크 구조의 적어도 일부가 삽입되는 공간을 제공할 수 있다. 예를 들어, 제1 삽입부에는 제1 후크부 및 제3 후크부가 삽입될 수 있다. 제1 삽입부 는 제3 후크부와 체결되기 위한 형상으로 형성될 수 있다. 예를 들어, 제1 삽입부는 제3 후크부와 체결 가능하도록, 대응되는 후크 형상(4122a)을 형성할 수 있다. 일 실시 예에서, 제1 삽입부는 제1 삽입 공간 및 제2 삽입 공간을 포함할 수 있다. 제1 삽입 공간은 제1 후크부가 삽입되기 위한 공간일 수 있다. 제2 삽입 공간은 제3 후크부 가 삽입되는 공간일 수 있다. 제2 삽입 공간은 제3 후크부와 체결되기 위한 형상으로 형 성될 수 있다. 예를 들어, 제2 삽입 공간은 제3 후크부와 체결 가능하도록, 대응되는 후크 형상 (4122a)을 형성할 수 있다. 제2 삽입 공간에 제3 후크부가 삽입됨으로써, 제1 삽입부와 제3 후크부가 서로 체결될 수 있다. 일 실시 예에서, 커버가 제2 하우징에 체결된 상태를 기준으로, 제1 삽입 공간은 제1 후크 구 조와 대응되는 위치에 형성되고, 제2 삽입 공간은 제3 후크부와 대응되는 위치에 형성될 수 있다. 제2 삽입 공간은 제1 삽입 공간과 인접하게 형성될 수 있다. 제2 삽입 공간은 제1 삽입 공간보다 제2 하우징의 중심에 더 가깝게 위치될 수 있다. 도 4b를 참조하면, 일 실시 예에서, 커버가 하우징(예를 들어, 제2 하우징)에 체결된 상태에서, 제1 후크부 및 제3 후크부가 서로 인접하게 위치되기 때문에, 제1 후크부가 제3 후크부 를 외측(예: 도 4b를 기준으로 +y축 방향)에서 지지함으로써 제1 후크부가 제3 후크부의 구동을 제한할 수 있다. 예를 들어, 제1 후크부의 헤드(44113a)가 제3 후크부의 외측(예: 도 4b 를 기준으로 +y축 방향)에서 제3 후크부와 인접하게 위치되기 때문에, 제3 후크부의 외측 방향 (예: 도 4b를 기준으로 +y축 방향)으로의 이동이 제한될 수 있다. 따라서, 제1 후크부가 제3 후크부 를 외측(예: 도 4b를 기준으로 +y축 방향)에서 지지하고 있는, 제3 후크부 및 제1 삽입부 간의 체결이 해제되는 것이 방지될 수 있다. 일 실시 예에서, 사용자는 커버를 하우징(예를 들어, 제2 하우징)으로부터 분리하기 위하여, 가 이드부를 전측 방향(예: +z축 방향)으로 가압할 수 있다. 가이드부가 전측 방향(예: +z축 방향)으 로 가압되면, 가이드부와 접촉하고 있는 자유단(44111b)에 가압력이 전달되게 되고, 자유단(44111b)이 전 측 방향(예: +z축 방향)으로 눌려질 수 있다. 따라서, 외팔보는 고정단(44111a)을 기준으로 전측 방향 (예: +z축 방향)으로 돌출되도록 휘어질 수 있다. 외팔보가 휘어지게 되면, 자유단(44111b)에 위치된 제1 후크부가 전측 방향(예: +z축 방향) 및/또는 외측 방향(예: 도 4b를 기준으로 +y축 방향)으로 이동 될 수 있다. 제1 후크부가 전측 방향(예: +z축 방향) 및/또는 외측 방향(예: 도 4b를 기준으로 +y축 방 향)으로 이동되면서, 제1 후크부와 제3 후크부가 서로 멀어지게 되고, 이에 따라 제1 삽입부 내에서 제3 후크부의 구동 공간이 확보될 수 있다. 즉, 제3 후크부가 외측 방향(예: 도 4b를 기준으로 +y축 방향)으로 이동 가능한 공간이 확보되면서, 제3 후크부 및 제1 삽입부간의 체 결이 해제 가능해질 수 있다. 이와 같은 상태에서, 일정한 힘이 가해지는 경우, 제3 후크부가 제1 삽입 부로부터 분리될 수 있다. 제3 후크부 및 제1 삽입부 간의 체결력은 상대적으로 약하게 형성될 수 있다. 이와 같은 구조에 의하면, 사용자는 가이드부를 가압하여 제3 후크부를 지지하고 있던 제1 후크부를 외측(예: 도 4b를 기준으로 +y축 방향)으로 이동시킨 후에, 일정한 힘을 가하여 제3 후크부를 제1 삽입부로부터 분리할 수 있다. 도 4a 및 도 4b에 따른 실시 예에서는 3중 체결 구 조를 통하여, 커버 및 하우징 간의 체결력이 더욱 강화될 수 있다. 한편, 도 2a 내지 도 2i, 도 3a, 도 3b, 도4a 및 도 4b를 통해 설명한 실시 예서는 외팔보(24111, 34111, 44111)의 자유단(24111b, 34111b, 44111b)이 고정단(24111a, 34111a, 44111a)보다 제2 커버(242, 342, 442)의 중심에 더 가깝게 형성되는 것으로 도시 및 설명되었으나, 이는 예시적인 것으로 외팔보(24111, 34111, 44111) 의 방향이 이에 한정되는 것은 아니다. 예를 들어, 외팔보(24111, 34111, 44111)는 자유단(24111b, 34111b, 44111b)이 고정단(24111a, 34111a, 44111a)보다 제2 커버(242, 342, 442)의 외측에 더 가깝게 형성될 수도 있 으며, 이 경우 제1 후크부(24113, 34113, 44113)의 헤드(24113a, 34113a, 44113a) 및/또는 제3 후크부 의 헤드(44114a)는 제2 커버(242, 342, 442)의 외측을 향하는 방향으로 형성될 수 있다. 다양한 실시 예에 있어서, 전자 장치는, 제1 방향을 향하는 제1 하우징; 상기 제1 방향과 반대되는 제2 방향을 향하도록 상기 제1 하우징과 체결되고, 상기 제2 방향을 향해 개방된 배터리 배치 공간 및 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간의 둘레를 따라 이격되어 형성되는 복 수의 제1 삽입부를 포함하는 제2 하우징; 및 상기 배터리 배치 공간을 덮도록 상기 제2 하우 징과 체결되는 커버를 포함하고, 상기 커버는, 제1 재질로 형성되는 제1 커버; 및 제2 재 질로 형성되고, 상기 제1 커버와 상기 제2 방향에서 결합되는 제2 커버를 포함하고, 상기 제1 커버 는, 상기 복수의 제1 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되 어 상기 제2 하우징 및 커버를 체결시키는 복수의 제1 후크 구조를 포함할 수 있다. 다양한 실시 예에 있어서, 상기 제1 후크 구조는, 일측이 자유단(24111b)으로 형성되고 타측이 고정단 (24111a)으로 형성되는 외팔보; 상기 외팔보가 형성되도록 상기 제1 커버의 일부가 절개된 절개부; 및 상기 외팔보에서 상기 제1 방향으로 돌출되어 형성되는 제1 후크부를 포함할 수 있다. 다양한 실시 예에 있어서, 상기 제1 후크부는 상기 외팔보의 상기 자유단(24111b)에 형성될 수 있다. 다양한 실시 예에 있어서, 상기 제1 후크부는 상기 외팔보의 상기 고정단(34111a)에 형성될 수 있다. 다양한 실시 예에 있어서, 상기 외팔보의 상기 고정단(24111a)은 상기 제1 커버의 다른 영역보다 두께가 작게 형성될 수 있다. 다양한 실시 예에 있어서, 상기 제2 커버의 상기 제2 방향을 향하는 면에는 상기 자유단(24111b)에 대응되 는 위치에 가이드부가 형성될 수 있다. 다양한 실시 예에 있어서, 상기 가이드부가 상기 제1 방향으로 가압되면, 상기 외팔보가 상기 고 정단(24111a)을 기준으로 상기 제1 방향으로 돌출되도록 휘면서 상기 제1 후크부 및 제1 삽입부 간의 체결이 해제될 수 있다. 다양한 실시 예에 있어서, 상기 가이드부는, 시각 또는 촉각에 의해 구별 가능하도록 형성될 수 있다. 다양한 실시 예에 있어서, 상기 제2 커버의 상기 제1 방향을 향하는 면에는 상기 절개부에 대응되 는 위치에 상기 절개부의 적어도 일부를 따라 함몰되는 홈부가 형성될 수 있다. 다양한 실시 예에 있어서, 상기 제2 하우징은, 상기 제2 하우징의 외곽부에 상기 제2 하우징의 둘레를 따라 이격되어 형성되는 복수의 제2 삽입부를 더 포함하고, 상기 제1 커버는, 상기 복수의 제2 삽입부와 대응되는 위치에 형성되고, 상기 복수의 제2 삽입부에 삽입되어 상기 제2 하우징 및 커버를 체결시키는 복수의 제2 후크부를 더 포함할 수 있다. 다양한 실시 예에 있어서, 상기 복수의 제1 후크 구조의 적어도 일부 및 상기 복수의 제2 후크부의 적어도 일부는 상기 제1 커버의 중심을 기준으로 상기 제1 커버의 둘레 방향을 따라 서로 교대로 배치될 수 있다. 다양한 실시 예에 있어서, 상기 제1 후크 구조는, 각각의 상기 제1 후크부와의 사이에 각각의 상 기 절개부가 위치되도록 각각의 상기 제1 후크부와 인접한 위치에서 상기 제1 방향으로 돌출되어 형성되는 복수의 제3 후크부를 더 포함하고, 상기 제2 하우징의 상기 제1 삽입부에는 상기 제1 후크부 및 제3 후크부가 삽입되고, 상기 제1 삽입부는 상기 제3 후크부와 체결 가능하도록 형성될 수 있다.. 다양한 실시 예에 있어서, 상기 외팔보의 상기 자유단(44111b)이 상기 제1 방향으로 가압되면, 상기 외 팔보가 상기 고정단(44111a)을 기준으로 상기 제1 방향으로 돌출되도록 휘면서 상기 제1 후크부 가 상기 제3 후크부로부터 멀어지고, 상기 제3 후크부의 구동 공간이 확보되면서 상기 제3 후크 부 및 제1 삽입부 간의 체결이 해제 가능해질 수 있다. 다양한 실시 예에 있어서, 상기 제2 재질은 상기 제1 재질보다 강성이 낮을 수 있다. 다양한 실시 예에 있어서, 상기 제1 커버 및 제2 커버는 이중사출 공정을 통해 일체로 형성될 수 있 다. 다양한 실시 예에 있어서, 전자 장치는, 후측을 향해 개방된 배터리 배치 공간 및 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간의 둘레를 따라 이격되어 형성되는 복수의 제1 삽입부 를 포함하는 하우징; 및 상기 배터리 배치 공간을 덮도록 상기 하우징의 후측에 체결되 는 커버를 포함하고, 상기 커버는, 제1 재질로 형성되는 제1 커버; 및 제2 재질로 형성되고, 상 기 제1 커버의 후측에 결합되는 제2 커버를 포함하고, 상기 제1 커버는, 상기 복수의 제1 삽입 부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되어 상기 하우징 및 커버 를 체결시키는 복수의 제1 후크 구조를 포함할 수 있다. 다양한 실시 예에 있어서, 상기 제1 후크 구조는, 일측이 자유단(24111b)으로 형성되고 타측이 고정단 (24111a)으로 형성되는 외팔보; 상기 외팔보가 형성되도록 상기 제1 커버의 일부가 절개된 절개부; 및 상기 외팔보에서 전측으로 돌출되어 형성되는 제1 후크부를 포함할 수 있다. 다양한 실시 예에 있어서, 상기 제2 커버의 후면에는 상기 자유단(24111b)에 대응되는 위치에 가이드부 가 형성될 수 있다. 다양한 실시 예에 있어서, 상기 가이드부가 전측 방향으로 가압되면, 상기 외팔보가 상기 고정단 (24111a)을 기준으로 전측 방향으로 돌출되도록 휘면서 상기 제1 후크부 및 제1 삽입부 간의 체결 이 해제될 수 있다. 다양한 실시 예에 있어서, 전자 장치는, 제1 방향을 향하는 제1 하우징; 상기 제1 방향과 반대되는 제2 방향을 향하도록 상기 제1 하우징과 체결되고, 상기 제2 방향을 향해 개방된 배터리 배치 공간 을 포함하는 제2 하우징; 및 상기 배터리 배치 공간을 덮도록 상기 제2 하우징과 체결되는 커 버를 포함하고, 상기 제2 하우징은, 상기 배터리 배치 공간의 주변부에 상기 배터리 배치 공간 의 둘레를 따라 이격되어 형성되는 복수의 제1 삽입부; 및 상기 제2 하우징의 외곽부에 상기 제2 하우징의 둘레를 따라 이격되어 형성되는 복수의 제2 삽입부를 더 포함하고, 상기 커버는, 제1 재질로 형성되는 제1 커버; 및 상기 제1 재질보다 강성이 낮은 제2 재질로 형성되고, 상기 제1 커버 와 상기 제2 방향에서 결합되는 제2 커버를 포함하고, 상기 제1 커버는, 상기 복수의 제1 삽입 부와 대응되는 위치에 형성되고, 상기 복수의 제1 삽입부에 삽입되어 상기 제2 하우징 및 커 버를 체결시키는 복수의 제1 후크 구조; 및 상기 복수의 제2 삽입부와 대응되는 위치에 형성 되고, 상기 복수의 제2 삽입부에 삽입되어 상기 제2 하우징 및 커버를 체결시키는 복수의 제2 후크부를 포함하고, 상기 제1 후크 구조는, 일측이 자유단(24111b)으로 형성되고 타측이 고정단 (24111a)으로 형성되는 외팔보; 상기 외팔보가 형성되도록 상기 제1 커버의 일부가 절개된 절개부; 및 상기 외팔보에서 상기 제1 방향으로 돌출되어 형성되는 제1 후크부를 포함하 고, 상기 외팔보의 상기 자유단(24111b)이 상기 제1 방향으로 가압되면, 상기 외팔보가 상기 고 정단(24111a)을 기준으로 상기 제1 방향으로 돌출되도록 휘면서 상기 제1 후크부 및 제1 삽입부 간의 체결이 해제될 수 있다.도면 도면1 도면2a 도면2b 도면2c 도면2d 도면2e 도면2f 도면2g 도면2h 도면2i 도면2j 도면3a 도면3b 도면4a 도면4b"}
{"patent_id": "10-2021-0092496", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는 일 실시 예에 따른 전자 장치의 사시도이다. 도 2b는 일 실시 예에 따른 전자 장치의 분해 사시도이다. 도 2c는 일 실시 예에 따른 전자 장치에서 커버가 분리된 상태를 도시하는 사시도이다. 도 2d는 일 실시 예에 따른 커버의 사시도이다. 도 2e는 도 2d의 A-A 선을 따른 단면 사시도이다.도 2f는 일 실시 예에 따른 제1 후크 구조의 사시도이다. 도 2g는 도 2f의 B-B 선을 따른 단면 사시도이다. 도 2h는 일 실시 예에 따른 커버의 후면 사시도이다. 도 2i는 일 실시 예에 따른 전자 장치의 부분 단면도이다. 도 2j는 일 실시 예에 따른 커버의 후면 사시도이다. 도 3a는 일 실시 예에 따른 커버의 사시도이다. 도 3b는 일 실시 예에 따른 전자 장치의 부분 단면도이다. 도 4a는 일 실시 예에 따른 커버의 사시도이다. 도 4b는 일 실시 예에 따른 전자 장치의 부분 단면도이다."}
