{"patent_id": "10-2021-0036804", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0089599", "출원번호": "10-2021-0036804", "발명의 명칭": "알루미늄 소재 제어형 코팅 시스템", "출원인": "이완성", "발명자": "이완성"}}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "알루미늄 소재 제어형 코팅 시스템으로서,스핀들 컨베이어에 결합된 지그를 회전시키고 증설된 라인을 따라 이동하도록 스핀들 컨베이어를 구동시키는 스핀들 컨베이어 구동 장치;상기 지그에 결합된 제품으로부터 이물을 제거하는 이오나이저, 상기 제품에 도료를 분사하여 제품에 베이스 코팅막을 형성하는 스프레이부 및 베이스 코팅된 제품을 건조시키는 제1 건조기가 구비된 제1 코팅 라인;상기 지그가 장착된 지그바가 투입되어 상기 지그에 결합된 제품에 대해 진공 증착 공정을 수행하는 증착기가구비된 증착 라인;지그에 결합된 제품으로부터 이물을 제거하는 전처리부, 상기 제품을 도금조에 침지하여 코팅막을 형성하는 코팅부 및 제품을 건조시키는 제2 건조기가 구비된 제2 코팅 라인;상기 제1 코팅 라인, 상기 증착 라인 및 상기 제2 코팅 라인 중 적어도 하나에 해당하는 공정이 수행된 제품에대해 신뢰성을 시험하는 신뢰성 시험 장비; 상기 이오나이저와 상기 스프레이부 및 상기 전처리부와 상기 코팅부의 일 영역에 구비되어 유해가스를 흡입하고 정화 장치를 거쳐 기체를 배기하는 배기장치; 및제품 정보 및 상기 신뢰성 시험 장비에 의해 측정된 측정 결과에 기초하여, 상기 스핀들 컨베이어 구동 장치의동작과 상기 제1 코팅 라인, 상기 증착 라인 및 상기 제2 코팅 라인에 구비된 장치들 중 적어도 하나의 동작을제어하는 지능형 코팅 및 증착 제어 장치를 포함하는 것인, 알루미늄 소재 제어형 코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 전처리부는, 상기 제품의 표면의 이물질을 제거하기 위한 소둔 공정을 수행하고, 상기 소둔 공정 이후 상기 제품의 표면의산화철을 제거하기 위한 산세 공정을 수행하고, 상기 제품의 표면의 산화철을 제거한 이후 불순물을 제거하기위한 산수세 공정을 수행하는 것인,알루미늄 소재 제어형 코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제2 코팅 라인은,레일부를 따라 상기 지그에 결합된 제품을 전해액이 포함된 도금조로 이동시키는 이동 장치를 포함하되, 상기 이동 장치는,상기 레일부의 무동력 구간인 제1구간, 상기 도금조에 상기 제품이 침지되는 제2구간 및 동력 구간인 제3구간의이동 경로를 따라 상기 제품을 코팅시키는 것인, 알루미늄 소재 제어형 코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 배기 장치는,흡입팬이 구비된 흡입덕트를 포함하고, 전처리기를 통해 1차 필터를 수행하고, 코팅액을 흡착하는 정화 장치를거쳐 상기 기체를 배기하되, 공개특허 10-2022-0089599-3-상기 지능형 코팅 및 증착 제어 장치는,상기 제1 코팅 라인, 상기 증착 라인 및 상기 제2 코팅 라인에 구비된 장치들 중 적어도 하나의 동작의 제어 신호를 고려하여 상기 배기 장치의 구동을 제어하는 것인, 알루미늄 소재 제어형 코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 지능형 코팅 및 증착 제어 장치는,상기 제품 정보 중 제품의 크기 정보에 기초하여 상기 스핀들 컨베이어의 스핀들 회전 속도 및 이동 속도 중 적어도 하나를 조절하되,상기 제품의 크기가 증가함에 따라 상기 스핀들 회전 속도를 증가시키거나, 상기 이동 속도를 감소시키도록 상기 스핀들 컨베이어 구동 장치를 제어하는 것인, 알루미늄 소재 제어형 코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 스프레이부는,상기 스핀들 컨베이어의 길이 방향을 따라 소정의 간격으로 이격되게 구비된 복수개의 스프레이를 포함하고,상기 지능형 코팅 및 증착 제어 장치는,상기 제품 정보 중 제품의 형상 정보에 기초하여 상기 스프레이부의 분사 각도를 조절하되,상기 제품의 길이에 대해 미리 설정된 범위에 따라 상기 복수개의 스프레이를 그룹핑하여, 그룹 별로 상기 복수개의 스프레이의 분사 각도를 상이하게 조절하도록 상기 스프레이부를 제어하는 것인, 알루미늄 소재 제어형 코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 신뢰성 시험 장비는,상기 제1 코팅 라인의 베이스 코팅 공정이 수행된 제품에 대해 도막 두께를 측정하고,상기 지능형 코팅 및 증착 제어 장치는,상기 신뢰성 시험 장비로부터 수신한 측정 결과에 기초하여, 도막 두께가 제1 기준 범위에 해당하는 경우 상기스프레이부의 분사 속도를 증가시키도록 상기 스프레이부를 제어하고, 도막 두께가 제2 기준 범위에 해당하는경우 상기 제1 코팅 라인의 베이스 코팅 공정이 수행된 제품에 대해 상기 제1 코팅 라인의 베이스 코팅 공정을한 번 더 반복하도록 상기 스핀들 컨베이어 구동 장치를 제어하는 것인, 알루미늄 소재 제어형 코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 신뢰성 시험 장비는,상기 지능형 코팅 및 증착 제어 장치에 의해 도막 마모도가 미리 설정된 정상 범위로 판단된 경우, 상기 제1 코팅 라인에 포함된 탑 코팅 공정이 수행된 제품에 대해 도막 내마모도를 더 측정하고,상기 지능형 코팅 및 증착 제어 장치는,상기 신뢰성 시험 장비로부터 수신한 측정 결과에 기초하여, 도막 내마모도가 미리 설정된 정상 범위인 경우 포장 라인으로 이동하도록 상기 스핀들 컨베이어 구동 장치를 제어하고, 도막 내마모도가 미리 설정된 불량 범위인 경우 불량 검수 라인으로 이동하도록 상기 스핀들 컨베이어 구동 장치를 제어하는 것인, 알루미늄 소재 제어형 코팅 시스템.공개특허 10-2022-0089599-4-청구항 9 제1항에 있어서,상기 신뢰성 시험 장비는,상기 제1 건조기의 UV 조사량을 측정하는 UV 조사량 측정기를 더 포함하고,상기 지능형 코팅 및 증착 제어 장치는,상기 UV 조사량 측정기로부터 수신한 측정 결과에 기초하여, 상기 제1 건조기의 UV 조사량을 조절하거나, 상기스핀들 컨베이어의 이동 속도를 조절하는 것인, 알루미늄 소재 제어형 코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 지능형 코팅 및 증착 장치는,상기 제품 정보 및 상기 신뢰성 시험 장비에 의해 측정된 측정 결과를 수신하는 수신부;상기 제품 정보 및 상기 측정 결과에 대한 기준 정보를 저장하는 데이터베이스부;상기 제품 정보 및 상기 측정 결과를 상기 기준 정보와 비교하여 판단하는 판단부; 및상기 비교하여 판단한 판단 결과에 기초하여 상기 스핀들 컨베이어 구동 장치의 동작과 상기 제1 코팅 라인, 상기 증착 라인 및 상기 제2 코팅 라인에 구비된 장치들 중 적어도 하나의 동작을 제어하는 제어부,를 포함하되,상기 제어부는,미리 설정된 배풍량에 기반하여 상기 배기 장치의 구동을 제어하기 위한 제어하는 것인, 알루미늄 소재 제어형코팅 시스템."}
{"patent_id": "10-2021-0036804", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "알루미늄 소재 제어형 코팅 시스템에 관한 것으로서, 알루미늄 소재 제어형 코팅 시스템은 스핀들 컨베이어에 결 합된 지그를 회전시키고 증설된 라인을 따라 이동하도록 스핀들 컨베이어를 구동시키는 스핀들 컨베이어 구동 장 치, 상기 지그에 결합된 제품으로부터 이물을 제거하는 이오나이저, 상기 제품에 도료를 분사하여 제품에 베이스 (뒷면에 계속)"}
{"patent_id": "10-2021-0036804", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 알루미늄 소재 제어형 코팅 시스템에 관한 것이다."}
{"patent_id": "10-2021-0036804", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "알루미늄(Al) 소재는 치수 정밀도가 높고, 경량(經粮)인 주물 제작에 있어서는 철(Iron)에 비해 짧은 시간에 대 량생산이 가능하다. 또한, 높은 주조성, 낮은 밀도, 높은 생산성, 낮은 수축율 및 상대적으로 높은 강도 등의 특성으로 인해 다양한 산업분야에서 폭넓게 사용된다. 알루미늄은 그다지 가혹하지 않은 환경에서도 부식이 발생하여 기계적 성질이 저하되는 결과를 초래할 수 있기 때문에 내식성을 증대시키고 신뢰성을 보장할 수 있는 방안이 필요하다. 알루미늄의 사용분야는 항공기, 철도 및 자동차 등의 수송용 장치 분야에서부터 전기, 전자, 일반기계 등에까지 다양하다. 구체적으로는 트랜스미션 하우징, 엔진실린더 및 블럭, 연료 측정 장치 등의 케이스류 및 복잡한 형 상의 수송용 기기 부품에서 많이 사용된다. 또한, IT 산업의 발전과 함께 알루미늄은 휴대용 컴퓨터, 태블릿 PC 및 스마트 폰 등 휴대용 전자기기의 케이스에도 많이 사용되고 있다. 한편, 모든 공정이 수행된 이후에 불량 검수가 수행됨으로써, 공정 진행 중에 개선 가능성이 있는 제품마저 결 과적으로 불량품이 되버리는 경우가 종종 발생하여 불량률이 증가하는 문제점이 있다. 본원의 배경이 되는 기술은 한국등록특허공보 제10-2198289호에 개시되어 있다."}
{"patent_id": "10-2021-0036804", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 제품의 형태 및 크기에 따라 그에 적합한 코팅 공정 등이 이루어질 수 있는 알루미늄 소재 제어형 코팅 시스템을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 코팅 및 증착 공정이 완료되기 전에 개선 가능성 이 존재하는 중간 불량 제품(또는 임시 불량 제품)이 공정 완료 후에 종국적으로 불량품이 되는 것을 방지할 수 있는 알루미늄 소재 제어형 코팅 시스템을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 알루미늄 소재의 코팅 및 도색 공정 시 발생하는 유해가스를 배출하기 위한 알루미늄 소재 제어형 코팅 시스템을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 내전압성, 내식성 및 내열충격성이 우수한 산화 피막을 형성할 수 있는 알루미늄 소재 제어형 코팅 시스템을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2021-0036804", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템은, 스핀들 컨베이어에 결합된 지그를 회전시키고 증설된 라인을 따라 이동하도록 스핀들 컨베이어를 구 동시키는 스핀들 컨베이어 구동 장치, 상기 지그에 결합된 제품으로부터 이물을 제거하는 이오나이저, 상기 제 품에 도료를 분사하여 제품에 베이스 코팅막을 형성하는 스프레이부 및 베이스 코팅된 제품을 건조시키는 제1 건조기가 구비된 제1 코팅 라인, 상기 지그가 장착된 지그바가 투입되어 상기 지그에 결합된 제품에 대해 진공 증착 공정을 수행하는 증착기가 구비된 증착 라인, 지그에 결합된 제품으로부터 이물을 제거하는 전처리부, 상 기 제품을 도금조에 침지하여 코팅막을 형성하는 코팅부 및 제품을 건조시키는 제2 건조기가 구비된 제2 코팅 라인, 상기 제1 코팅 라인, 상기 증착 라인 및 상기 제2 코팅 라인 중 적어도 하나에 해당하는 공정이 수행된 제품에 대해 신뢰성을 시험하는 신뢰성 시험 장비, 상기 이오나이저와 상기 스프레이부 및 상기 전처리부와 상 기 코팅부의 일 영역에 구비되어 유해가스를 흡입하고 정화 장치를 거쳐 기체를 배기하는 배기장치 및 제품 정 보 및 상기 신뢰성 시험 장비에 의해 측정된 측정 결과에 기초하여, 상기 스핀들 컨베이어 구동 장치의 동작과 상기 제1 코팅 라인, 상기 증착 라인 및 상기 제2 코팅 라인에 구비된 장치들 중 적어도 하나의 동작을 제어하 는 지능형 코팅 및 증착 제어 장치를 포함할 수 있다. 또한, 상기 전처리부는, 상기 제품의 표면의 이물질을 제거하기 위한 소둔 공정을 수행하고, 상기 소둔 공정 이 후 상기 제품의 표면의 산화철을 제거하기 위한 산세 공정을 수행하고, 상기 제품의 표면의 산화철을 제거한 이 후 불순물을 제거하기 위한 산수세 공정을 수행할 수 있다. 또한, 상기 제2 코팅 라인은, 레일부를 따라 상기 지그에 결합된 제품을 전해액이 포함된 도금조로 이동시키는 이동 장치를 포함하되, 상기 이동 장치는, 상기 레일부의 무동력 구간인 제1구간, 상기 도금조에 상기 제품이 침지되는 제2구간 및 동력 구간인 제3구간의 이동 경로를 따라 상기 제품을 코팅시킬 수 있다. 또한, 상기 배기 장치는, 흡입팬이 구비된 흡입 덕트를 포함하고, 전처리기를 통해 1차 필터를 수행하고, 코팅 액을 흡착하는 정화 장치를 거쳐 상기 기체를 배기하되, 상기 지능형 코팅 및 증착 제어 장치는, 상기 제1 코팅 라인, 상기 증착 라인 및 상기 제2 코팅 라인에 구비된 장치들 중 적어도 하나의 동작의 제어 신호를 고려하여 상기 배기 장치의 구동을 제어할 수 있다. 또한, 상기 지능형 코팅 및 증착 제어 장치는, 상기 제품 정보 중 제품의 크기 정보에 기초하여 상기 스핀들 컨 베이어의 스핀들 회전 속도 및 이동 속도 중 적어도 하나를 조절하되, 상기 제품의 크기가 증가함에 따라 상기 스핀들 회전 속도를 증가시키거나, 상기 이동 속도를 감소시키도록 상기 스핀들 컨베이어 구동 장치를 제어할 수 있다. 또한, 상기 스프레이부는, 상기 스핀들 컨베이어의 길이 방향을 따라 소정의 간격으로 이격되게 구비된 복수개 의 스프레이를 포함하고, 상기 지능형 코팅 및 증착 제어 장치는, 상기 제품 정보 중 제품의 형상 정보에 기초 하여 상기 스프레이부의 분사 각도를 조절하되, 상기 제품의 길이에 대해 미리 설정된 범위에 따라 상기 복수개 의 스프레이를 그룹핑하여, 그룹 별로 상기 복수개의 스프레이의 분사 각도를 상이하게 조절하도록 상기 스프레 이부를 제어할 수 있다. 또한, 상기 신뢰성 시험 장비는, 상기 제1 코팅 라인의 베이스 코팅 공정이 수행된 제품에 대해 도막 두께를 측 정하고, 상기 지능형 코팅 및 증착 제어 장치는, 상기 신뢰성 시험 장비로부터 수신한 측정 결과에 기초하여, 도막 두께가 제1 기준 범위에 해당하는 경우 상기 제2 스프레이부의 분사 속도를 증가시키도록 상기 제2 스프레 이부를 제어하고, 도막 두께가 제2 기준 범위에 해당하는 경우 상기 제1 코팅 라인의 베이스 코팅 공정이 수행 된 제품에 대해 상기 제1 코팅 라인의 베이스 코팅 공정을 한 번 더 반복하도록 상기 스핀들 컨베이어 구동 장 치를 제어할 수 있다. 또한, 상기 신뢰성 시험 장비는, 상기 제2 코팅 라인의 탑 코팅 공정이 수행된 제품에 대해 도막 마모도를 측정 하고, 상기 지능형 코팅 및 증착 제어 장치는, 상기 신뢰성 시험 장비로부터 수신한 측정 결과에 기초하여, 도 막 마모도가 미리 설정된 불량 범위인 경우, 상기 제2 코팅 라인의 탑 코팅 공정이 수행된 제품에 대해 불량 검 수 라인으로 이동하도록 상기 스핀들 컨베이어 구동 장치를 제어할 수 있다. 또한, 상기 신뢰성 시험 장비는, 상기 지능형 코팅 및 증착 제어 장치에 의해 도막 마모도가 미리 설정된 정상 범위로 판단된 경우, 상기 제2 코팅 라인의 탑 코팅 공정이 수행된 제품에 대해 도막 내마모도를 더 측정하고, 상기 지능형 코팅 및 증착 제어 장치는, 상기 신뢰성 시험 장비로부터 수신한 측정 결과에 기초하여, 도막 내마 모도가 미리 설정된 정상 범위인 경우 포장 라인으로 이동하도록 상기 스핀들 컨베이어 구동 장치를 제어하고, 도막 내마모도가 미리 설정된 불량 범위인 경우 불량 검수 라인으로 이동하도록 상기 스핀들 컨베이어 구동 장 치를 제어할 수 있다. 또한, 상기 신뢰성 시험 장비는, 상기 제1 건조기 및 상기 제2 건조기의 UV 조사량을 측정하는 UV 조사량 측정 기를 더 포함하고, 상기 지능형 코팅 및 증착 제어 장치는, 상기 UV 조사량 측정기로부터 수신한 측정 결과에 기초하여, 상기 제1 건조기 및 상기 제2 건조기의 UV 조사량을 조절하거나, 상기 스핀들 컨베이어의 이동 속도 를 조절할 수 있다. 또한, 상기 지능형 코팅 및 증착 장치는, 상기 제품 정보 및 상기 신뢰성 시험 장비에 의해 측정된 측정 결과를 수신하는 수신부, 상기 제품 정보 및 상기 측정 결과에 대한 기준 정보를 저장하는 데이터베이스부, 상기 제품 정보 및 상기 측정 결과를 상기 기준 정보와 비교하여 판단하는 판단부 및 상기 비교하여 판단한 판단 결과에 기초하여 상기 스핀들 컨베이어 구동 장치의 동작과 상기 제1 코팅 라인, 상기 증착 라인 및 상기 제2 코팅 라 인에 구비된 장치들 중 적어도 하나의 동작을 제어하는 제어부를 포함하되, 상기 제어부는, 미리 설정된 배풍량 에 기반하여 상기 배기 장치의 구동을 제어하기 위한 제어할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2021-0036804", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 제품의 크기 정보 또는 형상 정보에 기초하여 스핀들 컨베이어와 코팅 라인 및 증착 라인에 구비된 다양한 장치들의 동작을 제어함으로써, 제품의 형태 및 크기에 따라 그에 적합한 코팅 공정 등이 이루어질 수 있는 효과가 있다. 전술한 본원의 과제 해결 수단에 의하면, 각 공정을 완료한 제품에 대해 신뢰성을 측정한 결과에 기초하여 스핀 들 컨베이어와 코팅 라인 및 증착 라인에 구비된 다양한 장치들의 동작을 제어함으로써, 제품의 신뢰성 또는 불 량률을 개선시키는 효과가 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2021-0036804", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 다양한 1차 성형 제작된 금속 및 비금속 제품에 대해 도장 작업으로서의 코팅 및 증착 공정을 수행하는 시스템에 관한 것이며, 예시적으로 알루미늄 소재에 대해 적용될 수 있다. 또한, 본원의 코팅 공정 및 증착 공정에는 당 분야에서 통상적으로 수행되는 기법 및 각종 설비들이 적용될 수 있으므로, 각 공정이 수행되는 구체적인 방법과 이를 수행하는 각종 설비들의 구체적인 동작들에 대한 상세한 설명은 생략하기로 한다. 또한, 본원에 의해 수행되는 코팅 공정 및 증착 공정은 필요에 따라 세부 공정이 추가 또는 생략될 수 있음은 물론이다. 한편, 본원에 의해 수행되는 제품의 코팅은 제품 정보에 따라 제1코팅 공정(스프레이 공정) 및 증착 공정과 제2 코팅 공정(도금 공정) 및 건조 공정으로 구분되어 수행될 수 있다. 알루미늄 소재 제어형 코팅 시스템은 제품이 제1공정이 수행되어야하는 경우, 제1코팅 공정(스프레이 공정) 및 증착 공정과 건조 공정을 이용하여 코팅을 수행할 수 있다. 반면, 알루미늄 소재 제어형 코팅 시스템은 제품이 제2공정이 수행되어야하는 경우, 제2공정(도금 공정) 및 건조 공정을 이용하여 제품의 코팅을 수행할 수 있다. 도 1은 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 개략적인 구성도이고, 본원의 일 실시 예에 따른 알루미늄 소재 제어형 코팅 시스템의 개략적인 구성을 나타내기 위한 블록도이다. 도 1 및 도 2를 참조하면, 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템은 제1 코팅 라인 , 증착 라인 및 제2 코팅 라인, 신뢰성 시험 장비, 지능형 코팅 및 증착 제어 장치 및 배 기장치를 포함한다. 예시적으로, 도 1을 참조하면, 제1 코팅 라인은 이오나이징 부스, 스프레이 부스, 배기장치 및 건조 부스를 포함하고, 코팅 및 증착 공정을 거치는 제품은 스핀들 컨베이어(C)를 통해 이오나이징 부스, 스프레이 부스 및 건조 부스로 이동할 수 있다. 여기서, 각 부스(Booth)는 물리적인 구획물로 인해 구획되거나 개념적으로 구분된 공간을 의미할 수 있고, 각 부스에서는 서로 다른 공정(세부 공정)이 수행될 수 있다. 도 2를 참조하면, 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템은 스핀들 컨베이어 구동 장치 를 포함한다. 스핀들 컨베이어 구동 장치는 스핀들 컨베이어(C)에 결합된 지그를 회전시키고 증설된 라 인(예를 들어, 제1 코팅 라인 등)을 따라 이동하도록 스핀들 컨베이어(C)를 구동시킬 수 있다. 보다 구체적으로, 스핀들 컨베이어 구동 장치는 소정의 간격으로 구비된 스핀들을 회전시킴으로써 스핀들에 결합(장착)된 지그 및 지그에 결합된 제품이 회전하도록 스핀들 컨베이어(C)를 구동시킬 수 있다. 여기서, 소정의 간격으로 구비된 스핀들은 스핀들 라인으로 달리 지칭될 수 있다. 또한, 스핀들 컨베이어 구동 장치는, 상기 스핀들 라인에 투입된 제품에 대해 각 라인의 해당 공정이 단계 적으로 수행되도록 증설된 라인(예를 들어, 제1 코팅 라인 등)을 따라 상기 스핀들 라인이 이동하도록 스핀 들 컨베이어(C)를 구동시킬 수 있다. 한편, 스핀들 컨베이어 구동 장치는 후술하는 지능형 코팅 및 증착 제어 장치에 의해 그 동작이 제어될 수 있으나, 이와 관련하여 보다 구체적인 내용은 후술하기로 한다. 도 1을 참조하면, 스핀들 컨베이어(C) 및 스핀들 컨베이어 구동 장치는 제1 코팅 라인에 구비될 수 있 다. 또한, 스핀들 컨베이어(C)는 제1 코팅 라인에 구비된 이오나이징 부스, 스프레이 부스 및 건조 부스를 순차적으로 통과하도록 구비될 수 있다. 이 경우, 스핀들 컨베이어(C)에 결합된 제품은 먼저 이오나이징 부스에 서 이오나이징 단계를 거친 후, 스프레이 부스에서 코팅 단계를 거치고, 그 다음 건조 부스에서 건조 단계를 거 치게 된다. 한편, 도 2 및 도 3을 참조하면, 제1 코팅 라인에는 이오나이저, 스프레이부, 제1 건조기 및 제1 배기장치가 구비될 수 있다. 또한, 도면에 도시하진 않았으나, 제1코팅 라인에는 지그에 결합된 제 품을 향하여 도료를 분사하여 탑 코팅(Top Coating) 수행하는 제2이오나이저, 제2스프레이부, 제2건조기 및 제2 배기장치가 포함될 수 있다. 이오나이저는 지그에 결합된 제품으로부터 이물을 제거하는 것이다. 이오나이저는 각각 제1 코팅 라인 의 이오나이징 부스에 구비될 수 있다. 이오나이저는 복수개의 이오나이저 건(Ionizer gun)을 의미할 수 있다. 복수개의 이오나이저 건은 이오나이 징 부스를 통과하는 스핀들 컨베이어(C)의 일측에 컨베이어의 진행 방향을 따라 소정의 간격으로 구비될 수 있 다. 복수개의 이오나이 건은 스핀들 컨베이어(C)에 결합되어 회전하는 제품(P)을 향하여 이온화된 공기를 고압 으로 분사할 수 있고, 이에 의해, 제품(P) 표면의 정전기 및 이물질이 제거될 수 있다. 또한, 스프레이부는 지그에 결합된 제품을 향하여 도료를 분사하여 제품을 베이스 코팅(Base Coating)하고, 제2 스프레이부는 지그에 결합된 제품을 향하여 도료를 분사하여 탑 코팅(Top Coating)하는 것이다. 스프레이부 및 제2 스프레이부는 서로 다른 공간의 스프레이 부스에 구비될 수 있다. 본원의 일 실시예에 따르면, 이오나이저 및 스프레이부가 설치된 위치에서 대향되는 영역에는 제1 배기 장치가 구비될 수 있다. 또한, 제2이오나이저 및 제2스프레이부가 설치된 위치에서 대향된 영역에는 제2배 기장치가 구비될 수 있다. 제1 배기장치 및 제2배기장치는 흡입덕트에 흡입팬이 구비된 장치일 수 있다. 제1 배기장치 및 제2배기 장치는 복수의 이오나이저들에 의해 부유 및 비상되는 대전입자, 먼지를 포함한 이물질이 분사된 공기를 흡입할 수 있다. 한편, 도 3은 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 코팅 라인을 나타내기 위한 개 략적인 도면이다. 보다 구체적으로, 도 3은 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 스프레이 부스의 일부를 나타내는 도면이다. 도 3을 참조하면, 스프레이부(스프레이부 및 제2 스프레이부)는 스핀들 컨베이어(C)의 길이 방향을 따라 소 정의 간격으로 이격되게 구비된 복수개의 스프레이를 포함할 수 있다. 여기서, 스핀들 컨베이어(C)의 길이 방향 이란, 스핀들 컨베이어(C)의 진행 방향을 의미할 수 있다. 다시 말해, 복수개의 스프레이는 스프레이 부스를 통 과하는 스핀들 컨베이어(C)의 일측에 컨베이어의 진행 방향을 따라 소정의 간격으로 구비될 수 있다. 한편, 복 수개의 스프레이는, 예를 들어, 스프레이 건(Spray Gun) 형태로 마련될 수 있으나, 이에 한정되는 것은 아니고, 다양한 형태로 구비될 수 있다. 복수개의 스프레이(스프레이 건)는 스핀들 컨베이어(C)에 결합되어 회전하는 제품(P)을 향하여 UV 코팅액 등의 도료를 분사할 수 있고, 이에 의해, 제품(P) 표면에는 도료가 코팅될 수 있다. 이 때, 스프레이부에 포함되 는 복수개의 스프레이는 베이스 코팅을 위한 도료를 분사할 수 있고, 제2 스프레이부에 포함되는 복수개의 스프 레이는 탑 코팅을 위한 도료를 분사할 수 있다. 여기서, 베이스 코팅을 위한 도료 및 탑 코팅을 위한 도료는 당 분야에서 통상적으로 사용되는 도료 중에서 각 역할(기능) 및 제품 정보(제품에 대한 고객의 요구사항 또는 주 문사항을 포함함)에 맞게 선택될 수 있다.한편, 도 3에 도시되지는 않았으나, 스프레이부 및 제2 스프레이부는 복수개의 스프레이(스프레이 건)의 분 사구의 방향을 수직 방향(높이 방향 또는 12시-6시 방향) 또는 수평 방향(길이 방향 또는 9시-3시 방향)으로 조 절할 수 있는 구동 장치를 포함할 수 있다. 이러한 구동 장치에 의해 복수개의 스프레이(스프레이 건)의 분사 각도가 조절될 수 있으며, 상기 구동 장치는 후술하는 지능형 코팅 및 증착 제어 장치에 의해 제어될 수 있 다. 또한, 복수개의 스프레이(스프레이 건)의 설치 위치와 대향된 방향에는 배기장치가 구비될 수 있다. 배기장 치는 흡입팬이 구비된 흡입덕트를 포함할 수 있다. 배기장치는 복수개의 스프레이(스프레이 건)에서 분 사되는 유해물질(예를 들어, 톨루엔 등 유해가스)를 흡입할 수 있다. 본원의 다른 일 실시예에 따르면, 코팅라인이 진행되는 영역되는 복수의 스프레이건의 설치 위치와 대향된 방향 에 포집부가 구비된 포집장치(미도시)가 포함된 배기장치가 구비될 수 있다. 포집장치(미도시) 알루미늄 소 재에 도포되지 않고 비산되는 잉여의 코팅액을 포집하여 재사용할 수 있도록 흡입 및 포집하는 것일 수 있다. 일예로, 포집장치(미도시)는 흡입덕트의 입구와 흡입팬 사이의 흡입통로에 흡입되는 코팅액 또는 도료를 포집하 기 위한 포집부(미도시)를 포함할 수 있다. 다른 일예로, 포집부(미도시)는 일정간격 배치된 고정핀에 다수의 비즈가 회전 가능하도록 형성된 구조일 수 있으나, 이에 한정되는 것은 아니다. 또한, 제1 건조기는 베이스 코팅된 제품을 건조시키고, 제2 건조기는 탑 코팅된 제품을 건조시키는 것이다. 제1 건조기 및 제2 건조기는 각각 다른 공간의 건조 부스에 구비될 수 있다. 건조 부스는 적외선 건조기(예를 들어, IR Oven)가 구비된 IR 건조 부스(IR Oven Room) 및 자외선 건조기(예를 들어, UV Ramp)가 구비된 UV 건조 부스(UV Ramp Room)를 포함할 수 있다. 즉, 스핀들 컨베이어(C)에 결합된 제 품(P)은 스핀들 컨베이어(C)가 구동됨에 따라 상기 IR 건조 부스 및 UV 건조 부스를 통과함으로써, 적외선 및 자외선을 조사받게 되고, 이에 의해 건조가 이루어질 수 있다. 한편, 도 1을 참조하면, 증착 라인에는 하나 이상의 증착기가 구비될 수 있다. 증착기는 지그(Jig)가 장착 된 지그바(Jig bar)가 투입되어 지그에 결합된 제품에 대해 진공 증착 공정을 수행할 수 있다. 또한, 증착 라인은 공정의 순서(흐름)상 제1 코팅 라인의 베이스 코팅(Base Coating)과 과 탑 코팅(Top Coating)의 사이에 구비될 수 있다. 즉, 제1 코팅 라인의 모든 공정을 완료한 제품이 결합된 지그는 제1 코 팅 라인의 스핀들 라인으로부터 탈착(분리)되어 지그바에 소정의 간격을 두고 복수개 장착(결합)될 수 있고, 복수의 지그바가 증착기에 투입될 수 있으며, 증착기가 구동됨에 따라 지그에 결합된 제품에 대해 진공 증착 공정이 수행될 수 있다. 진공 증착 공정이 완료된 이후, 지그(진공 증착 공정을 완료한 제품이 결합된 상태의 지그)는 지그바로부터 탈 착(분리)되어 탑 코팅(Top Coating) 라인의 스핀들 라인에 장착(결합)될 수 있고, 탑 코팅(Top Coating) 라인의 스핀들 라인에 장착된 지그에 결합된 제품에 대해 탑 코팅(Top Coating) 라인의 모든 공정이 수행될 수 있다. 한편, 지그, 지그바, 증착기 등의 부품 및 장치와 진공 증착 기법에는 당 분야에서 통상적으로 사용되는 다양한 지그, 지그바, 증착기 및 진공 증착 기술이 적용될수 있으므로, 보다 상세한 설명은 생략하기로 한다. 또한, 도 2를 참조하면(도 1에는 미도시), 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템은 신 뢰성 시험 장비를 포함할 수 있다. 신뢰성 시험 장비는 제1 코팅 라인, 증착 라인 및 제2 코팅 라인 중 적어도 하나에 해당하는 공정이 수행된 제품에 대해 신뢰성을 시험할 수 있다. 또한, 신뢰성 시험 장비는, 예를 들어, 도막의 두께를 측정하는 기기, 도막의 마모도를 측정하는 기기, 도 막의 내마모도를 측정하는 기기, 촬영 장치 등일 수 있으나, 이에 한정되는 것은 아니고, UV 조사량을 측정하는 기기 등의 기타 측정기 및 센서 등을 폭넓게 포함하는 개념으로 이해함이 바람직하다. 한편, 신뢰성 시험 장비에 의해 측정된 측정 결과는 후술하는 지능형 코팅 및 증착 제어 장치로 수집될 수 있다. 도 1 및 도 2를 참조하면, 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템은 지능형 코팅 및 증 착 제어 장치를 포함한다. 지능형 코팅 및 증착 제어 장치는 제품 정보 및 신뢰성 시험 장비에 의 해 측정된 측정 결과에 기초하여, 스핀들 컨베이어 구동 장치의 동작과 제1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 장치들 중 적어도 하나의 동작을 제어할 수 있다. 여기서, 제1 코팅 라인 및 증착 라인 에 구비된 장치들은 앞서 설명한 이오나이저, 스프레이(부), 건조기, 증착기 등을 의미할 수 있으나, 이에 한정되는 것은 아니다. 또한, 제2 코팅 라인에 구비된 장치들은 이후에 설명될 이동장치, 건조부, 배기부 등을 의미할 수 있으나, 이에 한정되는 것은 아니다. 또한, 지능형 코팅 및 증착 제어 장치는 이오나이저와 스프레이부 및 제2이오나이저와 제2스프레이 부와 대향되게 설치되어 유해가스를 흡입하고 정화 장치를 거쳐 기체를 배출하는 배기장치의 구동을 제어할 수 있다. 지능형 코팅 및 증착 제어 장치는 미리 설정된 배풍량에 기반하여 배기장치의 구동을 제어할 수 있다. 일예로, 배풍량은 구비된 후드의 형식에 의해 달리 설정되며, 지능형 코팅 및 증착 제어 장치는 설치된 후드의 형식을 고려하여 배풍량을 설정할 수 있다. 제품 정보는 주문자 또는 고객이 코팅 및 증착을 주 문(또는 의뢰)한 제품에 관한 정보를 의미한다. 제품 정보는 제품의 크기 정보 및 형상 정보를 포함할 수 있다. 제품의 형상 정보는 제품의 길이 정보를 포함할 수 있다. 여기서, 제품의 길이(높이)는 제품을 지그에 결합한 후 지그를 스핀들에 결합(장착)될 때 스핀들의 회전축 방향을 의미할 수 있다. 도 3을 참조하면, 스핀들의 회전 축 방향은 스핀들 컨베이어(C)의 진행 방향의 수직 방향일 수 있다. 또한, 제품의 형상 정보는, 예를 들어, 사각통형(사각기둥형), 육각통형(육각기둥형), 원통형(원기둥형) 등의 전체적인 형태 정보를 포함할 수 있다. 제품의 크기 정보는 제품의 길이 방향에 수직한 방향으로 자른 단면적의 넓이 또는 제품이 지그 및 스핀들에 결 합된 상태에서 회전축으로부터 제품의 가장 멀리 떨어진 부분(지점)까지의 거리를 의미할 수 있다. 도 3을 참조 하여 예를 들면, 제품(P)이 원통형(원기둥형)인 경우, 제품(P)의 크기 정보는 제품(P)의 길이 방향에 수직한 방 향으로 자른 단면적인 원의 넓이 또는 그 원의 반지름을 의미할 수 있다. 즉, 상기 원의 넓이가 넓어질수록 또 는 상기 원의 반지름이 길어질수록 제품의 크기가 증가한다고 볼 수 있다. 또한, 제품의 크기가 증가할수록 제 품이 한 바퀴 회전하는데 걸리는 시간이 증가하게 된다. 도 4는 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 제2 코팅 라인의 개략적인 구성도이다. 도 1 및4를 참조하면, 제2 코팅 라인은 전처리 부스, 코팅 부스, 건조 부스, 배기장치를 포함하고, 전처리 및 코팅을 거치는 제품은 레일부 및 이동 장치를 통해 전처리 부스, 코팅 부스 및 건조 부스로 이동 할 수 있다. 여기서, 각 부스(Booth)는 물리적인 구획물로 인해 구획되거나 개념적으로 구분된 공간을 의미할 수 있고, 각 부스에서는 서로 다른 공정(세부 공정)이 수행될 수 있다. 예시적으로, 도 2를 참조하면, 제2 코팅 라인은 전처리부, 코팅부, 건조부 및 배기부를 포 함할 수 있다. 또한, 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템은 레일부를 포함한다. 레일부 는 복수의 구간을 포함하고, 이동 장치에 결합 또는 수납부에 수납된 제품을 이동시키고 증설된 라인 (예를 들어, 제2코팅 라인 등)을 따라 이동하도록 이동 공간을 제공할 수 있다. 또한, 레일부 및 이동 장치는 제2코팅 라인에 구비될 수 있다. 레일부는 제2코팅 라인 에 구비된 전처리 부스, 코팅 부스 및 건조 부스를 순차적으로 통과하도록 구비될 수 있다. 이 경우, 이동 장치 에 결합 또는 수납부에 수납된 제품은 먼저 전처리 부스에서 전처리 단계를 거친 후, 코팅 부스에서 코팅 단계를 거치고, 그 다음 건조 부스에서 건조 단계를 거치게 된다. 전처리부는 제품의 표면의 이물질을 제거하기 위한 소둔 공정을 수행할 수 있다. 소둔 공정은 금속 제품의 연화, 결정 조직의 조정 또는 내부 응력(변형력) 제거를 위해 적당한 온도로 가열한 후 천천히 냉각하는 단계를 의미할 수 있다. 소둔 공정(소둔로 공정) 단계에서는, 제품(부재)을 수납부(445, 철재 PLALET)에 넣어 소둔로 기계에 넣는 1단계, 적정온도 및 적정시간에 맞춰 소둔하는 2단계 및 소둔이 완료된 이후에 자연냉각 후 후속공정 진행을 수 행하는 3단계를 포함할 수 있다. 여기서, 2단계 작업 단계에서는 제품(부재)의 정보 및 제품(부재)의 크기 정보 에 기반하여 미리 설정된 적정 온도 및 적정 시간에 맞추어 소둔 공정이 수행될 수 있다. 또한, 전처리부는 소둔 공정(소둔로 공정) 단계 이후에 제품의 금속 표면에 묻은 구리스나 기름 등을 제거 하기 위한 알칼리 탈지 작업을 수행할 수 있다. 알칼리 탈지 작업에서는 소둔로 공정이 끝난 부재를 이동 장치 에 결합 또는 수납부에 수납된 제품을 탈지조에 침지시키는 1단계, 액속에 잠길 때 탈지조에서 미리 설정된 횟수(예를 들어, 2회 내지 3회) 사방(상, 하, 좌, 우, 앞, 뒤)으로 교반 후 침지시키는 2단계 및 미리 설정된 시간 간격으로 탈지조에서 제품(부재)을 들어올려 탈지 여부를 확인하는 3단계 및 탈지가 끝난 후 레일부의 제3구간의 미리 설정된 영역에서 탈지액이 완전히 흘러 내리게 하는 4단계 및 탈지 처리가 완료된 부재를 수세조로 옮기는 5단계를 포함할 수 있다. 또한, 전처리부는 알칼리 탈지 작업이 완료된 제품의 탈지 수세 작업을 수행할 수 있다. 탈지 수세 작업에 서는 알칼리 탈지 공정이 끝난 부재를 이동 장치에 결합 또는 수납부에 수납된 제품을 수세조에 침지 시키는 1단계, 수새액에 잠길 때 수세조에서 미리 설정된 횟수(예를 들어, 2회 내지 3회) 사방(상, 하, 좌, 우, 앞, 뒤)으로 교반 후 침지시키는 2단계 및 미리 설정된 시간 간격으로 수세조에서 제품(부재)을 들어올려 탈지 여부를 확인하는 3단계 및 탈지가 끝난 후 레일부의 제3구간의 미리 설정된 영역에서 수새액이 완전 히 흘러 내리게 하는 4단계 및 탈지 처리가 완료된 부재를 산세조로 옮기는 5단계를 포함할 수 있다. 또한, 전처리부는 탈지 수세 작업 이후에 제품(금속 제품)의 표면의 산화철을 제거하기 위한 산세 공정을 수행할 수 있다. 산세 공정에서는 수세 공정이 끝난 부재를 이동 장치에 결합 또는 수납부에 수납된 제품을 산세조에 침지시키는 1단계, 산세액에 잠길 때 산세조에서 미리 설정된 횟수(예를 들어, 2회 내지 3회) 사방(상, 하, 좌, 우, 앞, 뒤)으로 교반 후 침지시키는 2단계 및 미리 설정된 시간 간격으로 산세조에서 제품 (부재)을 들어올려 산세 여부를 확인하는 3단계 및 산세가 끝난 후 레일부의 제3구간의 미리 설정된 영역에서 산세액이 완전히 흘러 내리게 하는 4단계 및 산세 처리가 완료된 부재를 수세조로 옮기는 5단계를 포 함할 수 있다. 또한, 전처리부는 산세 공정 이후에 제품(금속 제품)의 표면의 불순물을 제거하기 위한 산수세 공정을 수행 할 수 있다. 산수세 공정에서는 산세 공정이 끝난 부재를 이동 장치에 결합 또는 수납부에 수납된 제 품을 수세조에 침지시키는 1단계, 수세액에 잠길 때 수세조에서 미리 설정된 횟수(예를 들어, 2회 내지 3회) 사 방(상, 하, 좌, 우, 앞, 뒤)으로 교반 후 침지시키는 2단계 및 미리 설정된 시간 간격으로 수세조에서 제품(부 재)을 들어올려 수세 여부를 확인하는 3단계 및 수세가 끝난 후 레일부의 제3구간의 미리 설정된 영 역에서 수세액이 완전히 흘러 내리게 하는 4단계 및 수세 처리가 완료된 부재를 도금조로 옮기는 5단계를 포함 할 수 있다. 이하에서는 설명의 편의상 알칼리 탈지 공정, 탈지 수세 공정 산세 공정 및 산수세 공정 중에서 알칼리 탈지 공 정에서 수행되는 레일부와 이동 장치의 실시예를 설명하고자 한다. 알칼리 탈지 공정, 탈지 수세 공 정 산세 공정 및 산수세 공정을 포함하는 전처리의 모든 공정에서 이하에서 설명될 알칼리 탈지 공정과 동일 내 지 유사하게 하기의 실시예가 수행될 수 있다. 본원의 일 실시예에 따르면, 전처리부에서 수행되는 알칼리 탈지 공정, 탈지 수세 공정 산세 공정 및 산수 세 공정 중 1단계는 레일부의 무동력 구간인 제1구간에 의해 수행될 수 있다. 예시적으로, 레일부의 제1구간은 이동 장치가 초기 구간에서, 전처리를 위한 용액인 알칼리 탈 지가 수용된 탈지조를 향해 하강 즉, 중력을 이용한 낙하(미끄럼틀) 방식으로 제품이 이동되는 이동 경로 를 제공할 수 있다. 달리 말해, 제1구간에서는 이동 장치에서 동력이 발생하지 않고, 제품(부재)을 초기 구간에서 제2구간으로 이동시킬 수 있다. 또한, 전처리부에서 수행되는 알칼리 탈지 공정의 2단계는 제품(부재)이 탈지조에 침지될 수 있는 제2 구간에 의해 수행될 수 있다. 초기 구간에서 제1구간을 거쳐 제2구간에 이동 장치가 도달 하는 경우, 지능형 코팅 및 증착 제어 장치는 이동 장치의 구동을 제어하기 위한 제어 신호를 생성할 수 있다. 예를 들어, 지능형 코팅 및 증착 제어 장치는 이동 장치가 제2구간에서 일시적으로 정지한 이후, 이동 장치에 결합 또는 수납부에 수납된 제품이 탈지조 내부에서 이물질이 완전하게 제거될 수 있도록 미리 설정된 횟수(예를 들어, 2회 내지 3회) 동안 사방(상, 하, 좌, 우, 앞, 뒤)으로 교반 후 침지되도 록 이동 장치의 구동을 제어하기 위한 제어 신호를 생성할 수 있다. 보다 구체적으로, 지능형 코팅 및 증착 제어 장치는 이동 장치가 제2구간에서 일시적으로 정지하 기 위한 제1 구동 신호를 생성할 수 있다. 또한, 지능형 코팅 및 증착 제어 장치는 이동 장치가 제3구 간과 인접해 있는 제2구간의 일단과 제1구간과 인접해 있는 제2구간의 타단으로 이동하기 위한 제2구동 신호를 생성할 수 있다. 달리 말해, 지능형 코팅 및 증착 제어 장치는 이동 장치가 앞 또는 뒤로 교번하며 움직이도록 구동을 제어하기 위한 제어 신호를 생성할 수 있다. 또한, 지능형 코팅 및 증착 제어 장치는 이동 장치에 결합 또는 수납부에 수납된 제품이 탈지조 내부에서 이물질이 완전하게 제거될 수 있도록 이동 장치에 연결된 체인(줄)이 상하 방향으로 이동 가능하도록 제어 신호를 생성할 수 있다. 달리 말해, 지능형 코팅 및 증착 제어 장치는 제품(부재)이 탈지 조의 하측 및 상측 방향으로 교번할 수 있도록 이동 장치에 연결된 체인(줄)의 길이를 조절하기 위한제어 신호를 생성할 수 있다. 또한, 지능형 코팅 및 증착 제어 장치는 전처리부에서 수행되는 알칼리 탈지 공정의 3단계에서 이동 장 치가 제3구간에서 미리 설정된 위치에서 일시적으로 정지한 이후, 소정의 각도를 이루며 알칼리 탈지 액이 제거될 수 있도록 하기 위한 제어 신호를 생성할 수 있다. 예를 들어, 지능형 코팅 및 증착 제어 장치(6 0)는 이동 장치에 결합 또는 수납부에 수납된 제품이 소정의 각도를 이루기 하기 위해, 제3구간(44 3)으로 이동 장치를 이동시키기 위한 제어 신호를 생성할 수 있다. 제3단계는 이전 공정에서 사용된 제1전 처리 용액이 이후 공정에서의 전처리 용액의 통 내부에 유입되지 않게 하기 위함일 수 있다. 일예로, 제3구간은 제1구간과는 상이한 구간으로 이동 장치가 상승해야하기 때문에, 이동 장치 는 지능형 코팅 및 증착 제어 장치로부터 수신한 제어 신호에 기반하여, 구동될 수 있다. 본원의 일 실시예에 따르면, 코팅 부스에서는 앞서 설명된 전처리 부스와 동일한 방법으로 제품(부재)에 코팅이 수행될 수 있다. 이하 설명된 내용이라고 하더라도, 코팅부에서는 앞서 전처리부에서 수행되는 1단계 내지 5단계와 동일하게 동작될 수 있다. 예시적으로, 코팅부는 복수의 구간을 포함하는 레일부, 지그에 결합된 제품을 전해액이 포함된 도금조 및 레일부를 따라 제품을 이동시키는 이동 장치를 포함할 수 있다. 레일부는 무동력 구간인 제1구간, 도금조에 제품이 침지되는 제2구간 및 동력 구간인 제3 구간의 이동 경로를 따라 제품을 코팅시킬 수 있다. 예시적으로, 도 4를 참조하면, 이동 장치는 전처리부에 의해 전처리가 수행된 제품을 코팅하기 위해 코팅 부스로 이동시킬 수 있다. 이동 장치를 초기 위치에서 레일부의 무동력 구간인 제1구간을 통과 시킨 이후, 제2구간에 서 도금조에 제품을 침지시킬 수 있다. 이동 장치는 도금조에 제품이 침지된 경우, 미리 설정된 횟수 동안 교반(agitation)한 이후 제3구간에서 제품이 소정의 각도를 이루어 전해액이 제거되길 기다리기 위해 미리 설정된 거리만큼 이동할 수 있다. 또한, 이동 장치는 코팅부 즉 코팅 부스에서 코팅이 완료된 제품을 건조부로 이동시킬 수 있다. 건조부는 코팅이 완료된 제품을 건조하기 위한 건조 부스로서, 건조 부스는 적외선 건조기(예를 들어, IR Oven)가 구비된 IR 건조 부스(IR Oven Room) 및 자외선 건조기(예를 들어, UV Ramp)가 구비된 UV 건조 부스(UV Ramp Room)를 포함할 수 있다. 다만, 건조 부스의 구성이 이에 한정되는 것은 아니며, 제품의 특성, 제품의 정보에 따라 건조 부스에서는, 자 연 건조, 냉각 건조 등을 이용해 제품을 건조시킬 수 있다. 본원의 다른 일 실시예에 따르면, 제2코팅 라인은 전처리(화학 처리)공정, 탈수 및 연마 공정, 착색 공정 및 실링 공정, 건조 공정 순으로 공정이 진행될 수 있다. 제2코팅 라인에서 수행되는 공정은, 레일부(44 0)를 따라 이동하는 이동장치에 의해 복수의 단계가 진행될 수 있다. 일예로, 신뢰성 시험 장비는 도금조에서 착색된 도금 상태와 미리 설정된 기준 정보와의 매칭을 위한 이미지 정보를 획득할 수 있다. 달리 말해, 신뢰성 시험 장비에 포함된 촬영 장치는, 제3구간에서 제품이 소정의 각도를 이루어 전해액(도금액)이 제거되길 기다리는 제품(부재)의 이미지를 획득할 수 있다. 판단부(6 3)는 제품 정보 및 신뢰성 시험 장비에 의해 획득된 이미지 정보와 기준 정보를 비교하고, 지능형 코팅 및 증착 제어 장치는 판단부의 판단 결과에 기반하여, 이동 장치의 구동을 제어하기 위한 제어 신호 를 생성할 수 있다. 예를 들어, 판단부에서 제품 정보에 포함된 제1착색 정보와 이미지 정보에서 획득된 착색 정보가 일치하지 않는다고 판단한 경우, 지능형 코팅 및 증착 제어 장치는 이동 장치가 제2구간으로 이동하여 도 색 공정을 재 수행하도록 제어 신호를 생성할 수 있다. 판단부는 인공지능 기반의 학습 모델을 이용하여 제1착색 정보와 이미지 정보에서 획득된 착색 정보의 매칭 을 확인할 수 있다. 인공지능 기반의 학습 모델은 종래에 기 존재하거나 개발되는 다양한 이미지 분석 알고리즘 이 적용될 수 있다. 반면, 판단부에서 제품 정보에 포함된 제1착색 정보와 이미지 정보에서 획득된 착색 정보고 일치하는 경우, 지능형 코팅 및 증착 제어 장치는 이동 장치가 제3구간을 따라 건조 부스로 이동하도록 제어 신호를 생성할 수 있다. 본원의 일 실시예에 따르면, 이오나이저 및 스프레이부가 설치된 위치에서 대향되는 영역에는 제1 배기 장치가 구비될 수 있다. 또한, 제2이오나이저 및 제2스프레이부가 설치된 위치에서 대향된 영역에는 제2배 기장치가 구비될 수 있다. 제1 배기장치 및 제2배기장치는 흡입덕트에 흡입팬이 구비된 장치일 수 있다. 제1 배기장치 및 제2배기 장치는 복수의 이오나이저들에 의해 부유 및 비상되는 대전입자, 먼지를 포함한 이물질이 분사된 공기를 흡입할 수 있다. 한편, 도 6은 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 지능형 코팅 및 증착 제어 장치 의 개략적인 블록도이다. 도 6을 참조하면, 본원의 일 실시예에 따른 지능형 코팅 및 증착 제어 장치는 수신부, 데이터베이스부 , 판단부 및 제어부를 포함할 수 있다. 수신부는 제품 정보 및 신뢰성 시험 장비에 의해 측정된 측정 결과를 수신할 수 있다. 보다 구체적으로, 제품 정보는 외부 사용자 단말(미도시)을 통해 입력되거나 외부 사용자 단말(미도시)에 저장된 정 보가 지능형 코팅 및 증착 제어 장치의 수신부를 통해 수신된 것일 수 있다. 즉, 지능형 코팅 및 증착 제어 장치는 외부 사용자 단말(미도시) 및 신뢰성 시험 장비와 네트워크를 통 해 통신 연결되어 제품 정보, 측정 결과 등의 정보를 송수신할 수 있다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷 (Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않 는다. 또한, 사용자 단말(미도시)은 예를 들면, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치 및 데스크탑 컴퓨터, 스마트 TV 등 유선 통신 장치를 포함할 수 있다. 또한, 지능형 코팅 및 증착 제어 장치는 스핀들 컨베이어 구동 장치의 동작과 제1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 장치들 중 적어도 하나의 동작을 제어하는 제어 신호를 생성하여, 상 기 네트워크를 기반으로 스핀들 컨베이어 구동 장치를 포함하는 각종 장치들에 전송할 수 있다. 데이터베이스부는 제품 정보 및 신뢰성 시험 장비에 의해 측정된 측정 결과에 대한 기준 정보를 저장할 수 있다. 여기서, 기준 정보는 제품 정보 및 상기 측정 결과에 대해 미리 설정된 스핀들 컨베이어 구동 장치 의 동작 또는 제1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 각종 장치들 중 적어도 하 나의 동작에 관한 정보를 의미할 수 있다. 보다 구체적으로, 제품 정보에 대한 기준 정보는, 제품의 크기 정보에 따라 미리 설정된 스핀들 컨베이어 구동 장치의 회전 속도 또는 이동 속도에 관한 정보를 포함할 수 있다. 또한, 제품 정보에 대한 기준 정보는, 제 품의 크기 정보에 따라 미리 설정된 이동 장치의 이동 속도, 이동 길이 및 구동 시간에 관한 정보를 포함 할 수 있다. 또한, 제품 정보에 대한 기준 정보는, 제품의 형상 정보에 따라 미리 설정된 스프레이부(또는 복수개의 스프레 이)의 그룹핑 및 분사 각도에 관한 정보를 포함할 수 있다. 또한, 제품 정보에 대한 기준 정보는, 침지 시간 및 용액(예를 들어, 전처리 용액 전해액)의 온도에 관한 정보를 포함할 수 있다. 또한, 제품 정보에 대한 기준 정보는, 건물 내부에 설치된 배기통로, 후드형식, 후드의 제어풍속, 덕트내 이동 속도, 배풍량, 송풍기의 용량, 후드, 덕트, 공기정화장치 배풍기, 컨트롤 패널 등의 재질, 규격, 능력 등의 정 보를 포함할 수 있다.또한, 신뢰성 시험 장비에 의해 측정된 측정 결과에 대한 기준 정보는 측정 항목(예를 들어, 도막의 두께, 도막의 마모도, 도막의 내마모도 등)에 대해 미리 설정된 기준 범위, 정상 범위 및 불량 범위 중 적어도 하나를 포함할 수 있다. 또는, 신뢰성 시험 장비에 의해 측정된 측정 결과에 대한 기준 정보는 측정 항목(예를 들어, UV 조사량 등)에 대해 제품 정보와 연계되어 미리 설정된 기준 측정치(측정값)를 포함할 수 있다. 또한, 신뢰성 시험 장비에 의해 측정된 측정 결과에 대한 기준 정보는 측정 항목(예를 들어, 이미지 정보 등)에 대해 제품 정보와 연계되어 미리 설정된 기준 측정치(측정값)를 포함할 수 있다. 판단부는 제품 정보 및 신뢰성 시험 장비에 의해 측정된 측정 결과를 기준 정보와 비교하여 판단할 수 있다. 구체적으로, 수신부에 의해 수신된 제품 정보가 기준 정보의 제품 정보와 일치하는지 여부를 판단할 수 있다. 또한, 수신부에 의해 수신된 신뢰성 시험 장비에 의해 측정된 측정 결과가 기준 정보의 기준 범위, 정상 범위 또는 불량 범위에 속하는지 여부를 판단하거나, 상기 측정 결과가 미리 설정된 기준 측정치보 다 크거나 작은지 여부 혹은 많거나 적은지 여부를 판단할 수 있다. 제어부는 판단부에 의해 비교하여 판단한 결과에 기초하여 스핀들 컨베이어 구동 장치의 동작과 제 1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 장치들 중 적어도 하나의 동작을 제어할 수 있 다. 구체적으로, 제어부는 수신부에 의해 수신된 제품 정보에 대응되는 기준 정보의 미리 설정된 스핀들 컨 베이어 구동 장치의 동작 또는 제1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 각종 장 치들 중 적어도 하나의 동작에 관한 정보에 대응되도록 스핀들 컨베이어 구동 장치의 동작 또는 제1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 각종 장치들 중 적어도 하나의 동작을 제어할 수 있다. 또한, 제어부는 수신부에 의해 수신된 신뢰성 시험 장비에 의해 측정된 측정 결과가 기준 범위, 정 상 범위 또는 불량 범위에 속하는지 여부에 따라 스핀들 컨베이어 구동 장치의 동작 또는 제1 코팅 라인 , 증착 라인 및 제2 코팅 라인에 구비된 각종 장치들 중 적어도 하나의 동작을 상이하게 제어할 수 있다. 또한, 제어부는 수신부에 의해 수신된 신뢰성 시험 장비에 의해 측정된 측정 결과가 미리 설정된 기준 측정치보다 크거나(많거나) 작은지(적은지) 여부에 따라 스핀들 컨베이어 구동 장치의 동작 또는 제1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 각종 장치들 중 적어도 하나의 동작을 상이하게 제어할 수 있다. 또한, 제어부는 제1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 각종 장치들의 구동 정 보에 기반하여 배기장치의 구동을 제어할 수 있다. 또한, 제어부는 제1 코팅 라인, 증착 라인 및 제2 코팅 라인에 구비된 각종 장치들의 구동 정보를 고려하여, 배기장치의 구동 방식을 달리할 수 있다. 예를 들어, 구동 방식은, 배기장치의 구동 시간, 패턴, 빠르기, 흡입팬의 회전 속도, 후드의 제어풍 속 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 앞서 개략적으로 살펴본 지능형 코팅 및 증착 제어 장치의 알루미늄 소재 제어형 코팅 시스템 제어와 관 련하여 아래에서 보다 구체적으로 설명하기로 한다. 지능형 코팅 및 증착 제어 장치는 제품 정보 중 제품의 크기 정보에 기초하여 스핀들 컨베이어(C)의 스핀들 회전 속도 및 이동 속도 중 적어도 하나를 조절할 수 있다. 이 때, 제품의 크기가 증가함에 따라 스핀들 회전 속도를 증가시키거나, 이동 속도를 감소시키도록 스핀들 컨베이어 구동 장치를 제어할 수 있다. 예를 들어, 제품이 원통형(원기둥형)인 경우, 제품의 크기 정보는 반지름일 수 있다. 이 때, 반지름이 커질수록 제품의 크기가 증가한다고 볼 수 있다. 제품의 크기가 증가할수록 한 바퀴 회전하는데 걸리는 시간 즉, 제품 표 면 전체에 도료가 도포되는데 걸리는 시간이 증가하게 된다. 따라서, 스핀들 컨베이어(C)의 이동 속도 및 도료 의 분사 속도(단위시간 당 분사량)가 동일한 경우, 제품의 크기가 증가할수록 스핀들의 회전 속도가 증가할 필 요성이 있다. 즉, 제품의 크기가 증가함에 따라 스핀들 회전 속도를 증가시킴으로써, 제품의 크기와 상관없이 제품 표면 전체 에 동일한 횟수만큼 도료를 도포시킬 수 있는 효과가 있다.한편, 제품 표면 전체에 동일한 횟수만큼 도료를 도포시키더라도, 도료의 분사 속도(단위시간 당 분사량)가 동 일한 경우에는 제품의 크기가 증가함에 따라 도막의 두께가 상대적으로 얇아질 수 있다. 지능형 코팅 및 증착 제어 장치는 스핀들 컨베이어(C)의 이동 속도를 감소시킴으로써 제품 표면의 동일한 영역에 도료가 분사(도 포)되는 시간이 증가하고, 이로써 원하는 도막의 두께를 확보할 수 있게 된다. 따라서, 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템은 코팅 공정에 있어서 제품의 크기에 적합한 도막의 두께를 갖도록 설비들을 자동으로 조절할 수 있고, 제품의 크기와 상관없이 균일한 도막 두께를 확보할 수 있는 효과가 있다. 또한, 지능형 코팅 및 증착 제어 장치는 제품 정보 중 제품의 형상 정보에 기초하여 스프레이부의 분사 각도를 조절할 수 있다. 이 때, 제품의 길이에 대해 미리 설정된 범위에 따라 복수개의 스프레이를 그룹핑하여, 그룹 별로 복수개의 스프레이의 분사 각도를 상이하게 조절하도록 스프레이부를 제어할 수 있다. 앞서 설명한 바와 같이, 제품의 형상 정보는 제품의 길이 정보를 포함할 수 있다. 또한, 제품의 길이 정보에 따 라 스프레이부(또는 복수개의 스프레이)의 그룹핑에 관한 정보 및 분사 각도에 관한 정보가 기준 정보로서 미리 설정될 수 있다. 도 5는 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 스프레이부(2 2)의 분사 각도가 조절되는 다양한 예를 나타내기 위한 개략적인 도면이다. 도 5의 (a)를 참조하여 예를 들면, 제품의 길이가 미리 설정된 범위 이상인 경우, 복수개의 스프레이는 3개씩 그룹핑되고, 제품의 전체 길이를 3등분한 영역을 향하여 각각 분사되도록 3개의 분사 각도가 설정되고, 그룹 별 로 상이한 분사 각도를 갖도록 조절될 수 있다. 즉, 3개의 스프레이마다 분사 각도가 변경되는 것으로 이해될 수 있으며, 분사 각도는 미리 설정된 3개의 분사 각도로 번갈아 변경될 수 있다. 다른 예로, 도 5의 (b)를 참조하면, 제품의 길이가 미리 설정된 범위 이상인 경우, 복수개의 스프레이는 3개씩 그룹핑되고, 제품의 전체 길이를 3등분한 영역을 향하여 각각 분사되도록 3개의 분사 각도가 설정되고, 하나의 그룹에 속하는 3개의 스프레이가 상기 설정된 3개의 분사 각도를 각각 갖도록 조절될 수 있다. 즉, 연속되는 스 프레이는 서로 다른 분사 각도를 가지되, 3개의 스프레이마다 동일한 분사 각도를 반복해서 갖도록 조절될 수 있다. 한편, 도 5의 (b)의 경우, 그룹핑되는 스프레이의 개수 및 미리 설정된 분사 각도의 개수가 동일할 수 있다. 한편, 위에서는 복수개의 스프레이가 3개씩 그룹핑되고, 3개의 분사 각도를 갖는 경우에 대해 예시하였으나, 이 에 한정되는 것은 아니고, 제품의 길이에 따라 그룹핑되는 스프레이의 개수 및 미리 설정되는 분사 각도의 개수 가 달라질 수 있다. 예를 들어, 제품의 길이가 제1 범위(0.5~10cm) 이상인 경우에는 복수개의 스프레이가 제품의 길이를 2등분한 영 역을 향하여 각각 분사되도록 2개의 분사 각도가 미리 설정될 수 있고, 제1 범위 이상인 제2 범위(10~20cm) 이 상인 경우에는 복수개의 스프레이가 제품의 전체 길이를 3등분한 영역을 향하여 각각 분사되도록 3개의 분사 각 도가 미리 설정될 수 있다. 본원의 일 실시예에 따르면, 지능형 코팅 및 증착 제어 장치는 스프레이부(또는 복수개의 스프레이)의 그룹 핑 및 분사량에 기반하여 배기장치의 구동을 제어할 수 있다. 예를 들어, 지능형 코팅 및 증착 제어 장치 는 스프레이부(또는 복수개의 스프레이)에서 분사되는 분사량이 미리 설정된 범위 이상인 경우, 제1제어 신 호를 생성하여 배기장치의 구동을 제어할 수 있다. 반면, 지능형 코팅 및 증착 제어 장치는 스프레이부 (또는 복수개의 스프레이)에서 분사되는 분사량이 미리 설정된 범위 이하인 경우, 제2제어 신호를 생성하여 배 기장치의 구동을 제어할 수 있다. 일예로, 제1제어 신호는 제2제어 신호보다 흡입팬의 회전속도가 빠른 것 일 수 있다. 한편, 지능형 코팅 및 증착 제어 장치는 수신부를 통해 수신한 제품의 크기 정보 및 형상 정보를 판단 부를 통해 데이터베이스부에 저장된 기준 정보와 비교하고, 제품 정보와 대응되는(제품 정보와 연계되 어 저장된) 스핀들 컨베이어 구동 장치의 동작에 관한 정보와 스프레이부의 동작에 관한 정보에 기초하 여 제어부는 스핀들 컨베이어 구동 장치의 동작과 스프레이부의 동작을 제어할 수 있다. 또한, 전술한 바와 같이, 지능형 코팅 및 증착 제어 장치는 신뢰성 시험 장비에 의해 측정된 측정 결과 에 기초하여 스핀들 컨베이어 구동 장치의 동작과 제1 코팅 라인, 증착 라인 및 제2 코팅 라인(4 0)에 구비된 장치들(예를 들어, 이오나이저, 스프레이(부), 건조기, 이동장치 등) 중 적어도 하나의 동작을 제 어할 수 있다.신뢰성 시험 장비는 제1 코팅 라인의 베이스 코팅 공정이 수행된 제품에 대해 도막 두께를 측정할 수 있다. 신뢰성 시험 장비는 제1 코팅 라인의 스프레이 부스를 통과한 제품에 대해 도막 두께를 측정하거 나, 제1 코팅 라인의 건조 부스를 통과한 제품에 대해 도막 두께를 측정할 수 있다. 지능형 코팅 및 증착 제어 장치는 신뢰성 시험 장비로부터 수신한 측정 결과에 기초하여, 도막 두께가 제1 기준 범위에 해당하는 경우 제2 스프레이부의 분사 속도를 증가시키도록 제2 스프레이부를 제어할 수 있다. 또한, 지능형 코팅 및 증착 제어 장치는 도막 두께가 제2 기준 범위에 해당하는 경우 제1 코팅 라인의 공정이 수행된 제품에 대해 제1 코팅 라인의 베이스 코팅 공정을 한 번 더 반복하도록 스핀들 컨베이어 구 동 장치를 제어할 수 있다. 여기서, 제1 기준 범위 및 제2 기준 범위는 앞서 설명한 기준 범위에 포함되는 개념으로 이해될 수 있다. 또한, 제2 기준 범위는 제1 기준 범위 이상으로 미리 설정될 수 있다. 예를 들어, 제1 기준 범위는 0.5~1mm이고, 제2 기준 범위는 1~1.5mm로 미리 설정될 수 있다. 또한, 제1 기준 범위 및 제2 기준 범위는 제품 정보 중 도막 두께 정보 및 그 오차 범위를 고려하여 제품 정보에 따라 다르게 설정될 수 있다. 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템에 의해 수행되는 제1 전체 코팅 및 증착 공정은 제1 코팅 라인에 대응되는 베이스 공정, 증착 라인에 대응되는 증착 공정 및 제1코팅 라인에 대응 되는 탑 코팅 공정이 순차적으로 진행되는 것을 확인할 수 있다. 이를 고려하면, 미리 설정된 도막 두께의 제1 기준 범위는 탑 코팅 공정만으로 원하는 도막 두께로 조절 가능한 수준의 오차 범위를 포함하는 것이고, 제2 기준 범위는 베이스 공정 및 탑 코팅 공정을 모두 이용하여 원하는 도막 두께로 조절 가능한 수준의 오차 범위를 포함하는 것으로 이해될 수 있다. 다시 말해, 제1 기준 범위는 탑 코팅 공정 수행 시에 도막 두께를 일부 증가시킴으로써 원하는 도막 두께를 갖 도록 할 수 있는 정도의 미세한 오차 범위를 포함하고, 제2 기준 범위는 베이스 코팅 공정이 더 필요한 상태의 상대적으로 큰 오차 범위를 포함하는 것으로 이해될 수 있다. 따라서, 지능형 코팅 및 증착 제어 장치는 도막 두께가 제1 기준 범위에 해당하는 경우 탑 코팅 공정을 수 행하는 제2 스프레이부의 분사 속도(단위시간 당 분사량)를 증가시킴으로써 탑 코팅을 보다 두껍게 수행하여 원 하는 도막 두께를 맞출 수 있다. 또한, 지능형 코팅 및 증착 제어 장치는 도막 두께가 제2 기준 범위에 해당하는 경우 베이스 코팅 공정을 한 번 더 반복하도록 스핀들 컨베이어 구동 장치를 제어함으로써, 도막 두께를 다시 측정하였을 때 제1 기 준 범위에 해당하거나, 원하는 도막 두께(도막 두께 범위)에 해당하도록 하여 불량품으로 될 가능성을 사전에 차단할 수 있다. (참고로, 베이스 코팅 공정 수행 후의 원하는 도막 두께(도막 두께 범위)와 탑 코팅 공정 수행 후의 원하는 도막 두께(도막 두께 범위)는 다른 두께를 의미한다.) 한편, 도막 두께가 제1 기준 범위 또는 제2 기준 범위에 해당하는지 여부는, 지능형 코팅 및 증착 제어 장치 의 판단부에 의해 판단될 수 있으며, 판단 결과에 기초하여 스핀들 컨베이어 구동 장치 또는 제2 스프레이부의 동작은 지능형 코팅 및 증착 제어 장치의 제어부에 의해 제어될 수 있다. 또한, 신뢰성 시험 장비는 제1 건조기 및 제2 건조기의 UV 조사량을 측정하는 UV 조사량 측정기를 더 포함할 수 있다. 이러한 UV 조사량 측정기는, 예를 들어, 제1 코팅 라인 및 제2 코팅 라인의 건조 부스 중 UV 건조 부스(UV Ramp Room)에 각각 구비되어 UV 건조 부스 내의 UV 조사량을 측정할 수 있다. 지능형 코팅 및 증착 제어 장치는 UV 조사량 측정기로부터 수신한 측정 결과에 기초하여, 제1 건조기 및 제2 건조기의 UV 조사량을 조절하거나, 스핀들 컨베이어(C)의 이동 속도를 조절할 수 있다. 보다 구체적으로, 지능형 코팅 및 증착 제어 장치는 UV 조사량이 제품(P)의 제품 정보와 연계되어 미리 설 정된 UV 조사량에 비해 적은 경우, 제1 건조기 및 제2 건조기의 UV 조사량을 증가시키도록 제1 건조기 및 제2 건조기를 제어하거나, 스핀들 컨베이어(C)의 이동 속도를 감소시키도록 스핀들 컨베이어 구동 장치 를 제어할 수 있다. 또한, UV 조사량이 제품(P)의 제품 정보와 연계되어 미리 설정된 UV 조사량에 비해 많은 경우, 제1 건조기 및 제2 건조기의 UV 조사량을 감소시키도록 제1 건조기 및 제2 건조기를 제어하거나, 스핀들 컨베이어(C)의 이동 속도를 증가시키도록 스핀들 컨베이어 구동 장치를 제어할 수 있다. 예를 들어, 제품 정보 중 크기 정보에 있어서, 제품의 크기가 증가함에 따라 요구되는 UV 조사량이 증가할 수 있다. 즉, 제품의 크기가 증가함에 따라 미리 설정된 UV 조사량이 증가할 수 있으며, 이러한 제품 정보와 연계 되어 미리 설정된 UV 조사량 또한 앞서 설명한 기준 정보에 포함되는 개념으로 이해할 수 있다. 지능형 코팅 및 증착 제어 장치는 UV 조사량을 증가시키기 위해 제1 건조기 및 제2 건조기의 단위시간 당 UV 조사량을 증가시키거나, 스핀들 컨베이어(C)의 이동 속도를 감소시킴으로써 UV 조사시간을 증가시켜 UV 조사량을 증가시킬 수 있다. UV 조사량을 감소시키는 방법은 이와 반대로 이해될 수 있으므로, 구체적인 설명은 생략한다. 다시 말해, 지능형 코팅 및 증착 제어 장치는 UV 조사량 측정기로부터 측정된 UV 조사량을 수신부를 통 해 수신하고, 데이터베이스부에 저장된 기준 정보로서 제품 정보와 연계되어 미리 설정된 UV 조사량과 상기 측정된 UV 조사량을 판단부를 통해 비교하고, 제어부를 통해 제1 건조기 및 제2 건조기의 UV 조사 량의 증감 또는 스핀들 컨베이어 구동 장치의 이동 속도를 조절할 수 있다. 또한, 신뢰성 시험 장비는 제1 코팅 라인의 탑 코팅 공정이 수행된 제품에 대해 도막 마모도를 측정할 수 있다. 여기서, 도막 마모도를 측정하는 신뢰성 시험 장비의 일 예로는, 러빙 테스터가 있다. 지능형 코팅 및 증착 제어 장치는 신뢰성 시험 장비로부터 수신한 측정 결과에 기초하여, 도막 마모도 가 미리 설정된 불량 범위인 경우, 제1 코팅 라인의 탑 코팅 공정이 수행된 제품에 대해 불량 검수 라인으 로 이동하도록 스핀들 컨베이어 구동 장치를 제어할 수 있다. 여기서, 미리 설정된 불량 범위는 앞서 설명 한 기준 정보에 포함되는 개념으로 이해할 수 있다. 제1 코팅 라인 즉, 탑 코팅 공정까지 완료된 제품에 대해 측정한 도막 마모도가 불량 범위에 해당하는 경우, 지능형 코팅 및 증착 제어 장치는 해당 제품이 불량 검수 라인으로 이동시킴으로써 불량품을 즉시 분 리하여 검수하고, 불량품을 한 데 모아 불량의 원인을 파악할 수 있도록 한다. 이로써, 정상 제품에 불량품이 섞여 들어가는 현상을 방지하고, 파악된 불량 원인의 피드백을 통해 다음 제품의 품질을 더욱 제고시킬 수 있다. 또한, 신뢰성 시험 장비는 지능형 코팅 및 증착 제어 장치에 의해 도막 마모도가 미리 설정된 정상 범 위로 판단된 경우, 제1 코팅 라인의 탑 코팅 공정이 수행된 제품에 대해 도막 내마모도를 더 측정할 수 있 다. 여기서 도막 내마모도를 측정하는 신뢰성 시험 장비의 일 예로는, RCA 시험기가 있다. 지능형 코팅 및 증착 제어 장치는 신뢰성 시험 장비로부터 수신한 측정 결과에 기초하여, 도막 내마모 도가 미리 설정된 정상 범위인 경우 포장 라인으로 이동하도록 스핀들 컨베이어 구동 장치를 제어할 수 있 다. 또한, 측정된 도막 내마모도가 미리 설정된 불량 범위인 경우 불량 검수 라인으로 이동하도록 스핀들 컨베 이어 구동 장치를 제어할 수 있다. 다시 말해, 수신부는 제1 코팅 라인의 탑 코팅 공정이 수행된 제품에 대해 도막 내마모도를 측정한 측 정 결과를 수신하고, 판단부는 도막 내마모도가 미리 설정된 정상 범위 또는 불량 범위에 해당하는지 여부 를 판단하며, 제어부는 도막 내마모도가 미리 설정된 정상 범위인 경우 포장 라인으로 이동하도록 스핀들 컨베이어 구동 장치를 제어하고, 도막 내마모도가 미리 설정된 불량 범위인 경우 불량 검수 라인으로 이동 하도록 스핀들 컨베이어 구동 장치를 제어할 수 있다. 여기서, 미리 설정된 정상 범위 및 불량 범위는 앞서 설명한 기준 정보에 포함되는 개념으로 이해할 수 있다. 즉, 도막 마모도 및 도막 내마모도가 모두 정상 범위인 제품만 포장 라인으로 이동하게 되며, 도막 마모도가 정 상 범위이더라도 도막 내마모도가 불량 범위인 경우 최종적으로 불량품으로 판단되어 불량 검수 라인으로 이동 하게 된다. 본원의 다른 일 실시예에 따르면, 제1 코팅 라인 및 증착 라인의 공정 또는 제2 코팅 라인의 공정이 모두 수행 된 제품은 신뢰성 시험 장비에 의해 도막 마모도 및 도막 내마모도가 측정되고 측정 결과에 기초하여 불량 검수 라인 또는 포장 라인으로 이동하여 이후 공정이 수행된다. 본원의 일 실시예에 따르면, 도막 마모도 뿐만 아니라, 도막 내마모도를 더 측정함으로써 제품의 품질 및 신뢰 성을 보다 향상시킬 수 있으며, 이러한 단계적인 신뢰성 측정 과정 및 불량품 및 정상품의 분리가 자동화됨으로 써 불량 검수의 정확성 또한 높아지는 효과가 있다. 본원의 일 실시예에 따르면, 도면에 도시하진 않았으나, 배기장치는 이오나이저와 스프레이부 및 제2이오나이저와 제2스프레이부에 대향되게 설치되어 유해가스를 흡입하고 정화 장치를 거쳐 기체를 배기할 수 있다. 또한, 배기장치는 미리 설정된 배풍량에 기반하여 생성되는 제어 신호를 지능형 코팅 및 증착 제어장치로부터 제공받아 구동이 제어될 수 있다. 또한, 배기장치는 흡입팬이 구비된 흡입덕트를 포함할 수 있다. 또한, 배기장치는 전처리기를 통해 1차 필터를 수행할 수 있다 .예를 들어, 1차필터는 UV 필터일 수 있다. 또한, 1차필터는 백필터일 수 있다. 백필터 는 여과재, 지지대, 탈진기구, 먼지호퍼, 셀, 송풍기 등을 포함할 수 있다. 또한, 배기장치는 코팅액을 흡 착하는 흡착탑이 구비된 공기정화장치를 거쳐 배풍기를 통해 기체(공기)를 배기할 수 있다. 본원의 일 실시예에 따르면, 배기장치는 제1코팅라인 및 제2코팅라인 각각에 구비될 수 있다. 배기장치(7 0)는 제1코팅라인에 구비되는 제1 배기장치 및 제2코팅라인에 구비되는 배기부를 포함할 수 있다. 이때, 지능형 코팅 및 증착 제어 장치는 제1코팅라인에 구비된 장치들 중 적어도 어느 하나의 동작을 제어 하는 제어 신호를 고려하여 제1 배기장치의 구동을 제어할 수 있다. 한편, 지능형 코팅 및 증착 제어 장치 는 제2코팅라인에 구비된 장치들 중 적어도 어느 하나의 동작을 제어하는 제어 신호를 고려하여 배기부(4 4)의 구동을 제어할 수 있다. 달리 말해, 지능형 코팅 및 증착 제어 장치는 코팅 라인의 상황을 고려하여 복수의 배기 장치의 구동을 제어할 수 있다. 예를 들어, 제2코팅 라인에 구비된 배기부는 제품이 용액(일예로, 전처리 용액, 도금 용액, 전해액)에 침지되면서 발생하는 유해 가스를 흡입할 수 있다. 또한, 배기장치의 배기 및 처리순서는 후드, 덕트, 전처리기(백필터), 공기정화장치, 배풍기 및 배기 순서 로 진행될 수 있으나, 이에 한정되는 것은 아니다. 한편, 배기장치는 복수의 센서를 포함할 수 있다. 복수의 센서는, 배기장치에 포함된 구성품(구성부 품)의 상태 정보를 센싱할 수 있다. 또한, 복수의 센서는 공기정화장치에 구비된 흡착탑의 상태 정보를 센싱할 수 있다. 지능형 코팅 및 증착 제어 장치는 배기장치에 포함된 복수의 센서로부터 수집된 복수의 상태 정보를 고려하여 상기 배기장치의 구동을 제어할 수 있다. 또한, 지능형 코팅 및 증착 제어 장치는 미 리 설정된 상태 정보와 수집되는 상태 정보를 비교하고, 미리 설정된 상태와 비교 결과 이상이 있는 경우, 사용 자 단말(미도시)로 알람 메시지를 제공할 수 있다. 또한, 환경정보 수집부(미도시)는 이오나이징 부스, 스프레이 부스, 전처리 부스, 코팅 부스 및 건조 부스 내부 의 상태 정보를 수집할 수 있다. 지능형 코팅 및 증착 제어 장치는 복수의 부스 내부의 상태 정보를 고려하 여 배기장치의 구동을 제어할 수 있다. 예를 들어, 환경정보 수집부(미도시)는 복수의 부스 내부의 유해가 스 검출량, 온도, 습도, 먼지량, 산소 등의 정보를 수집할 수 있다. 지능형 코팅 및 증착 제어 장치는 환경 정보 수집부(미도시)에서 수집된 복수의 부스 내부의 상태 정보를 고려하여 배기장치의 구동을 제어할 수 있다."}
{"patent_id": "10-2021-0036804", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2021-0036804", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 개략적인 구성도이다. 도 2는 본원의 다른 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 개략적인 구성을 나타내기 위한 블 록도이다. 도 3은 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 제1 코팅 라인의 개략적인 구성도이다. 도 4는 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 제2 코팅 라인의 개략적인 구성도이다. 도 5는 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 스프레이부의 분사 각도가 조절되는 다양한 예를 나타내기 위한 개략적인 도면이다. 도 6은 본원의 일 실시예에 따른 알루미늄 소재 제어형 코팅 시스템의 지능형 코팅 및 증착 제어 장치의 개략적 인 블록도이다."}
