{"patent_id": "10-2023-0022235", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0129429", "출원번호": "10-2023-0022235", "발명의 명칭": "음성 및 상황 인지 기반 상담 운용 서버 및 그 동작 방법", "출원인": "주식회사 위엔", "발명자": "김남하"}}
{"patent_id": "10-2023-0022235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "음성 및 상황 인지 기반 상담 운용 서버에 있어서,상담 내용에 포함된 단어들의 감정 점수를 사용하여, 상기 상담 내용에 포함된 긍정 단어의 감정 점수의 총합과부정 단어의 감정 점수 총합의 차를 상기 상담 내용에 포함된 단어의 개수로 나누어 평균 감정 점수를산출하고, 미리 정해진 감정 각성 점수를 기초로 상기 상담 내용에서 감정을 자극하거나 활성화하는 정도를 나타내는 감정 강도를 산출하고, 상기 상담 내용의 감정 점수의 빈도와 분포를 고려한 엔트로피를 나타내는 감정다양성을 산출하고, 상기 평균 감정 점수, 감정 강도 및 감정 다양성의 곱으로부터 상담 내용 점수를 산출하는상담내용 분석부;상담이 진행되는 현장의 환경 요소인 소음강도, 조명강도, 온도, 습도 및 미리 정해진 쾌적소음, 쾌적조명, 쾌적온도 및 쾌적 습도의 비율을 사용하여 상담 지속 지수를 산출하는 상황 분석부; 및상기 상담 내용 점수 또는 상기 상담 지속 지수 중 적어도 어느 하나가 미리 정해진 임계 범위를 벗어나는 경우진행중인 상담을 ARS 상담, 인공지능 상담원 상담, 상담원 변경 또는 상담 종료 중 어느 하나의 동작으로 상담전환 결정하는 상담 전환부;를 포함하는,음성 및 상황 인지 기반 상담 운용 서버."}
{"patent_id": "10-2023-0022235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 상담 내용 분석부는,상기 상담 내용에 포함된 긍정 단어 및 부정단어에 대해 미리 정해진 감정 각성 점수의 합을 상기 상담 내용에포함된 긍정 단어 및 부정 단어 개수의 합으로 나누어 상기 감정 강도를 산출하는,음성 및 상황 인지 기반 상담 운용 서버."}
{"patent_id": "10-2023-0022235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 상담 내용 분석부는,상기 상담 내용에 포함된 단어들 중 감정 점수가 i인 단어의 비율을 뜻하는 및 의 곱의 총합에 -1을곱하여 상기 감정 다양성을 산출하는,음성 및 상황 인지 기반 상담 운용 서버."}
{"patent_id": "10-2023-0022235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 상황 분석부는,상담 시각 및 상담 계절에 따라 상기 상담이 진행되는 현장의 환경 요소에 가중치를 부여하여 상기 상담 지속지수를 산출하는,공개특허 10-2024-0129429-3-음성 및 상황 인지 기반 상담 운용 서버."}
{"patent_id": "10-2023-0022235", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 상담 전환부의 상담 전환 결정에 따라, 인공지능 언어 모델을 활용하여 고객의 문의에 대한 응대를 진행하는 AI 챗봇으로 자동 상담을 진행하고, 상기 AI 챗봇은 자연어 이해 모듈 및 대화 관리 모듈을 포함하는 자동상담부; 및상기 상담내용 분석부가 상기 상담 내용으로부터 분석한, 감정 점수, 감정 강도 및 감정 다양성과 이를 통해 산출된 상담 내용 점수 및 상기 상황 분석부의 상담 환경 분석과 관련된 소음, 조명, 온도 및 습도 정보를 저장하고, 상담원 이름, 상담자 또는 고객 이름, 성별, 연령대, 상담지역, 상담 시간, 상담 시각, 상담 내용 점수, 자동상담 전환 여부에 따라 적어도 하나 이상의 카테고리로 상담 이력을 저장하여 관리하는상담이력데이터베이스;를 더 포함하는,음성 및 상황 인지 기반 상담 운용 서버."}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 음성 및 상황 인지 기반 상담 운용 서버 및 그 동작 방법을 개시한다. 음성 및 상황 인지 기반 상담 운용 서버는 상담 내용에 포함된 단어들의 감정 점수를 사용하여, 상담 내용에 포함된 긍정 단어의 감정 점수의 총합과 부정 단어의 감정 점수 총합의 차를 상담 내용에 포함된 단어의 개수로 나누어 평균 감정 점수를 산출하 (뒷면에 계속)"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 음성 및 상황 인지 기반 상담 운용 서버 및 그 동작 방법에 관한 것으로, 더욱 상세하게는 상담 진행 시 상담자 및 고객의 상담 내용과 음성을 분석하여 상담의 계속 진행 여부를 결정할 수 있는 음성 및 상황 인지 기반 상담 운용 서버 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 전화 또는 대면 상담의 진행에 있어 상담원의 정신 건강에 대한 우려가 깊어지고 있다. 이른바 감정 노동 이라 불려지며, 상담원의 특성상 상담자 또는 고객의 상담 또는 불만 접수에 있어 불합리한 상담에 대한 적극적 대처를 할 수 없는 경우가 많다. 상담 내용이 부적절하거나 상담원의 감정 상태에 따라 더 이상 상담을 진행할 수 없는 경우에도 상담원은 상담 연결을 임의로 종료할 수 없거나, 임의로 종료하는 경우 근로 인사 평가에 불합리한 영향을 미칠 수 있어, 상담 원은 그와 관련된 규정이 있는 경우에도 감정 노동을 강행하는 경우가 다수 있다. 이는 최근 사회적 문제로 대두되었으나, 부적절한 상담 내용에 대한 명확한 기준이 없고, 서비스를 제공하는 사 업주 입장에서는 고객 응대를 위한 원활한 상담 진행을 요구하고 있어 그 절충점을 찾기 어려운 실정이다. 상담 내용을 녹음하여 해당 상담이 부절적하였는지에 대해 사후 평가하고 조치할 수 있는 법안들이 시행되고 있 지만, 정량적인 평가 방법이 존재하지 않으며, 상담원이 자신의 근로 지속에 대한 위험을 안은채 조사를 진행하 게 된다는 점에서 활성화 되지 못하는 제도로 알려져 있다. 이에 따라, 상담원이 상담을 진행하며 생성되는 상담의 내용 및 상담 상황을 판단하여 상담원이 적절한 수준의 상담을 진행하고 있는지 판단하고, 부적절한 상담이 진행되는 경우 상담원을 보호하기 위한 조치에 대한 연구가 요구된다. 선행기술문헌 특허문헌(특허문헌 0001) 국내특허공보 제10-2251145 호"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 목적은, 음성 및 상황 인지 기반 상담 운용 서버 및 그 동작 방 법을 제공하는 데 있다."}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 측면은, 음성 및 상황 인지 기반 상담 운용 서버를 제공한다. 음성 및 상황 인지 기반 상담 운용 서버는, 음성 및 상황 인지 기반 상담 운용 서버에 있어서, 상담 내용에 포 함된 단어들의 감정 점수를 사용하여, 상담 내용에 포함된 긍정 단어의 감정 점수의 총합과 부정 단어의 감정 점수 총합의 차를 상담 내용에 포함된 단어의 개수로 나누어 평균 감정 점수를 산출하고, 미리 정해진 감정 각 성 점수를 기초로 상담 내용에서 감정을 자극하거나 활성화하는 정도를 나타내는 감정 강도를 산출하고, 상담 내용의 감정 점수의 빈도와 분포를 고려한 엔트로피를 나타내는 감정 다양성을 산출하고, 평균 감정 점수, 감정 강도 및 감정 다양성의 곱으로부터 상담 내용 점수를 산출하는 상담내용 분석부, 상담이 진행되는 현장의 환경 요소인 소음강도, 조명강도, 온도, 습도 및 미리 정해진 쾌적소음, 쾌적조명, 쾌적온도 및 쾌적 습도의 비율을 사용하여 상담 지속 지수를 산출하는 상황 분석부 및 상담 내용 점수 또는 상담 지속 지수 중 적어도 어느 하나 가 미리 정해진 임계 범위를 벗어나는 경우 진행중인 상담을 ARS 상담, 인공지능 상담원 상담, 상담원 변경 또 는 상담 종료 중 어느 하나의 동작으로 상담 전환 결정하는 상담 전환부를 포함할 수 있다. 이때, 상담 내용 분석부는 상담 내용에 포함된 긍정 단어 및 부정단어에 대해 미리 정해진 감정 각성 점수의 합 을 상담 내용에 포함된 긍정 단어 및 부정 단어 개수의 합으로 나누어 감정 강도를 산출할 수 있다. 또한, 상담 내용 분석부는 상담 내용에 포함된 단어들 중 감정 점수가 i인 단어의 비율을 뜻하는 및"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "의 곱의 총합에 -1을 곱하여 감정 다양성을 산출할 수 있다. 또한, 상황 분석부는 상담 시각 및 상담 계절에 따라 상담이 진행되는 현장의 환경 요소에 가중치를 부여하여 상담 지속 지수를 산출할 수 있다. 또한, 상담 전환부의 상담 전환 결정에 따라, 인공지능 언어 모델을 활용하여 고객의 문의에 대한 응대를 진행 하는 AI 챗봇으로 자동 상담을 진행하고, AI 챗봇은 자연어 이해 모듈 및 대화 관리 모듈을 포함하는 자동 상담 부 및 상담내용 분석부가 상담 내용으로부터 분석한, 감정 점수, 감정 강도 및 감정 다양성과 이를 통해 산출된 상담 내용 점수 및 상황 분석부의 상담 환경 분석과 관련된 소음, 조명, 온도 및 습도 정보를 저장하고, 상담원 이름, 상담자 또는 고객 이름, 성별, 연령대, 상담지역, 상담 시간, 상담 시각, 상담 내용 점수, 자동상담 전환 여부에 따라 적어도 하나 이상의 카테고리로 상담 이력을 저장하여 관리하는 상담이력데이터베이스를 더 포함할 수 있다."}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따른 음성 및 상황 인지 기반 상담 운용 서버 및 그 동작 방법을 이용할 경우에는 상담 내용 및 상담원과 고객의 음성을 기초로 상담 내용이 부적절한 경우 인공지능 상담으로 상담 방법을 변경함으로 써 상담원에게 적절한 상담 환경을 제공할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 실시예를 설명함에 있어서 본 발명이 속하는 기술 분야에 익히 알려져 있고 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴 퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field-Programmable Gate Array) 또 는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~ 부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들 은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 발명의 실시예들을 구체적으로 설명함에 있어서, 특정 시스템의 예를 주된 대상으로 할 것이지만, 본 명세서 에서 청구하고자 하는 주요한 요지는 유사한 기술적 배경을 가지는 여타의 통신 시스템 및 서비스에도 본 명세"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "서에 개시된 범위를 크게 벗어나지 아니하는 범위에서 적용 가능하며, 이는 당해 기술분야에서 숙련된 기술적 지식을 가진 자의 판단으로 가능할 것이다. 도 1은 본 발명의 일 실시예에 따른 음성 및 상황 인지 기반 상담 운용 서버의 구동 환경을 나타낸 예시도이다. 도 1을 참조하면, 음성 및 상황 인지 기반 상담 운용 서버(이하, '서버'라고 함)는 상담원이 상담을 진행 하며 생성되는 상담 내용 및 상담이 진행되는 상담 상황을 분석하여, 고객 또는 상담자의 상담 내용 또는 상담 상황이 부적절한 경우 상담을 전환하여 자동응답 또는 인공지능 기반 전자 상담원이 상담을 계속하도록 상담을 전환할 수 있다. 여기서, 상담원은 상담 단말을 사용하여 상담자 또는 고객의 상담을 수행하는 사람으로서, 대면 또는 비대 면 상담을 진행할 수 있다. 예를 들어, 상담원은 CS 담당자, 콜센터 직원, 전화 상담원, 원격 상담원 및 서비스 또는 제품의 안내원 등 제공되는 서비스에 대한 안내 및 사후 관리를 담당하는 사람일 수 있다. 여기서, 상담자 또는 고객은 사용자 단말을 사용하여 서버 및 서버와 연결된 상담원과 상담을 진 행하는 사람으로서, 대면 또는 비대면 상담을 진행할 수 있다. 예를 들어, 상담자 또는 고객은 서비스 또는 제 품의 수요 주체로서 상담원을 통해 안내, 사후관리 또는 문의를 위해 상담을 요청한 사람일 수 있다. 이하, 설 명의 편의를 위해 상담자 또는 고객을 '고객'으로 표현하여 설명한다. 여기서 자동응답 또는 인공지능 기반 상담은 서버가 주체가 되어 자동으로 진행하는 상담으로서, 상담 내 용 또는 상담 환경이 적절하지 못하여 상담원의 상담을 자동 상담으로 전환해야 할 때, 사람이 진행하는 상담 대신 서버가 진행하는 상담을 의미하고, 미리 정해진 내용에 대한 상담 또는 언어 모델을 통해 학습된 인 공지능 상담원이 진행하는 상담을 포함한다. 또한, 상담 내용은 상담을 진행하는 과정에서 상담원, 상담자 또는 고객이 사용하는 단어, 어휘 및 문장 들로 구성된 특정 서비스 또는 제품에 대한 상담 내용을 의미한다. 또한, 상담 상황은 상담을 진행할 때 상담원, 상담자 또는 고객이 상담을 진행하는 상담 환경을 의미하는 것으 로, 소음, 조명 강도, 온도, 습도와 같은 상담 공간 환경을 포함한다. 또한, 상담 음량, 상담 시간, 상담 내용 의 길이, 고객 언어의 높낮이, 고객이 사용하는 단어의 수준, 고객의 기존 상담 이력, 고객에 대한 상담 평가 이력 등 상담 내용 및 상담이 진행되는 주관적 상담 환경 정보를 포함한다. 한편, 사용자 단말 및 상담 단말은 통신 가능한 데스크탑 컴퓨터(desktop computer), 랩탑 컴퓨터 (laptop computer), 노트북(notebook), 스마트폰(smart phone), 태블릿 PC(tablet PC), 모바일폰(mobile phone), 스마트 워치(smart watch), 스마트 글래스(smart glass), e-book 리더기, PMP(portable multimedia player), 휴대용 게임기, 네비게이션(navigation) 장치, 디지털 카메라(digital camera), DMB(digital multimedia broadcasting) 재생기, 디지털 음성 녹음기(digital audio recorder), 디지털 음성 재생기(digital audio player), 디지털 동영상 녹화기(digital video recorder), 디지털 동영상 재생기(digital video player), PDA(Personal Digital Assistant) 등일 수 있다. 서버는 상담 내용에 기초하여, 상담 내용에 기초한 상담 전환 점수를 산출하여 상담 전환 점수가 미리 정 해진 임계 값을 초과하는 경우, 상담원의 상담 지속이 어려운 것으로 판단하고, 진행중인 상담을 종료하거나 상 담을 자동상담으로 전환할 수 있다. 예를 들어, 서버는 음성 인식 기술을 사용하여, 상담자의 발화에 포함된 각 단어를 긍정 또는 부정으로 표 시하고 문장 내 단어의 긍정 또는 부정 점수를 계산하여 문장의 전반적인 긍정 또는 부정 점수를 결정할 수 있다. 또한, 서버는 상담자의 발화에 포함된 각 단어를 디지털화하여 임베딩 벡터로 표현하고 이를 이용하여 문 장의 전체적인 긍정 또는 부정 점수를 결정할 수 있다. 또한, 서버는 상담자의 발화에 포함된 특정 어휘를 감지하여 문장의 전반적인 긍정 또는 부정 점수를 결정 합니다. 일 예로, 상담자가 비속어, 언어폭력, 욕설이 포함된 문장 또는 단어를 사용하면 시스템이 문장의 긍정 또는 부정 점수를 결정할 수 있다. 이에 따라, 서버는 긍정 또는 부정으로 판정된 문장을 임의 제거, 상담의 자동 종료 또는 상담을 자동 상 담으로 전환 결정할 수 있다. 이를 통해, 상담원은 부적절한 상담자와 계속된 상담을 피할 수 있으며, 상담자와의 상담 회피에 대한 객관적인 평가 및 회피의 근거를 제공함으로써 상담원의 근로 계속 및 정신 건강 완화를 기대할 수 있다. 도 2는 음성 및 상환 인지 기반 상담 운용 서버를 설명하기 위한 개략도이다. 도 2를 참고하면, 음성 및 상환 인지 기반 상담 운용서버(이하, '서버'라고 함)는 상담내용 분석부, 상황 분석부 및 상담 전환부를 포함할 수 있다. 상담내용 분석부는 상담원과 고객이 서로 대화하면서 생성하는 상담 내용을 분석하여 상담 내용이 상담 지 속에 적절한지 여부를 판단할 수 있다. 예를 들어, 상담내용 분석부는 상담원에 대한 고객의 상담 내용을 음성인식 기술을 통해 인식하고, 상담 내용에 포함된 단어, 어휘, 문장 등 상담 내용의 구성이 상담을 지속하기 에 적절한지 판단할 수 있다. 예를 들어, 상담내용 분석부는 상담 내용에 포함된 단어들의 감정 점수(EVS, Emotional Valence Score)를 사용하여 상담 내용을 분석할 수 있다. 예컨대, EVS는 1~9사이의 값을 가질 수 있으며 1은 매우 부정적인 단어, 5는 중립적 단어, 9는 매우 긍정적인 단어를 의미할 수 있다. 또한, 감정 점수는 미리 생성된 각 단어의 감정 점수를 사용할 수 있고, 일 예로, 한글 단어의 경우 텍스트 마 이닝을 통한 한국어 감정 점수 데이터베이스, 영문의 경우 ANEW(Affective Norms for English Words) 어휘집과 같은 미리 정의된 감정 어휘집을 사용할 수 있다. 예컨대, 상담내용 분석부는 상담 내용의 각 단어들을 감정 점수 데이터베이스 또는 감정 어휘집을 통해 검 색하고, 검색된 각 단어들의 감정 점수를 합산하여 아래 수학식과 같이 상담 내용 점수(CCS, Counseling Content Score)를 산출할 수 있다. 수학식 1"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "즉, 상담내용 점수는 긍정 단어의 감정점수 의 총합과 부정 단어의 감정점수 의 총합의 차에서 해당 상담 내용에 포함된 단어의 개수로 나눈 것을 의미한다. 예를 들어, 일련의 상담 내용에 포함된 단어가 \"희망(Hope)\" (EVS=8), \"두려움(Fear)\" (EVS=2), \"불안 (Anxiety)\" (EVS=3), \"격려(Encouragement)\" (EVS=7), \"우울증(Depression)\" (EVS=2) 일 때, 상담내용 분석부 는 아래 수학식 2와 같이 상담 내용 점수를 산출할 수 있다.수학식 2"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이처럼 상담 내용 점수(CCS)가 0보다 큰 경우, 상담내용 분석부는 전체적 상담 내용은 긍정적인 것으로 판 단될 수 있고, 이에 따라 상담을 계속 진행할 수 있다. 또한, 상담내용 분석부는 감정 강도(Emotional Intensity) 및 감정 다양성(Emotional Diversity)을 반영 하여 상담 내용 점수를 산출할 수 있다. 여기서 감정 강도는 상담 내용에서 감정을 자극하거나 활성화하는 정도를 의미하는 것이고, 감정 다양성은 상담 내용에서 표현되는 감정의 다양성과 풍부성을 의미하는 것이다. 상담 내용의 감정 강도를 계산하기 위해 한글 단어의 경우 텍스트 마이닝을 통한 한국어 감정 점수 데이터베이 스, 영문의 경우 ANEW(Affective Norms for English Words) 어휘집과 같은 미리 정의된 감정 어휘집을 사용하 여 긍정적이거나 부정적인 감정 점수를 가진 내용의 모든 단어의 평균 감정 각성 점수(EAS, Emotional Arousal Score)를 산출할 수 있다. 여기서 긍정 단어 및 부정 단어의 감정 각성 점수는 각 단어에 대해 미리 정의될 수 있으며, 이에 제한되지 않고 새로운 단어집으로 직접 생성될 수 있다. 일 예로, 감정 각성 점수의 범위는 1에서 9까지이며, 여기서 1은 낮은 각성을 나타내고 9는 높은 각성을 나타낼 수 있다. 예컨대, \"일하는(working)\"과 같은 중립적 단어는 문장내에서 감정을 자극하거나 활성화 하는 비중이 낮은 단어이므로, 감정 각성 점수가 4로 결정될 수 있고, \"희망이 없는(hopeless)\"과 같은 부정적이면서 감정을 직접적으로 나타내는 단어는 감정 각성 점수가 6.75와 같이 높게 결정될 수 있다. 또한, \"희망찬(hopeful)\"과 같은 긍정적이면서 감정을 직접적으로 나타내는 단어는 감정 각성 점수가 6.75와 같이 높게 결정 될 수 있다. 이때, 감정 강도(EI, Emotional Intensity)는 아래 수학식과 같이 계산할 수 있다. 수학식 3"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "즉, 감정 강도는 상담 내용에 포함된 긍정 단어 및 부정단어에 대해 미리 정해진 감정 각성 점수의 합을 상기 상담 내용에 포함된 긍정 단어 및 부정 단어 개수의 합으로 나눈 값을 의미한다. 한편, 감정 각성 점수(EAS)단어나 자극과 관련된 정서적 활성화 또는 각성의 수준을 측정하는 점수로서, 일반적 으로 EAS 값이 높을수록 단어나 자극이 강한 감정적 반응이나 활성화를 유도할 가능성이 높다는 것을 나타낸다. 또한, 상담내용 분석부는 상담 내용의 감정 다양성(ED, Emotional Diversity)을 반영하기 위해 상담 내용 의 감정 점수의 빈도와 분포를 고려한 엔트로피를 측정할 수 있으며, 이는 아래의 수학식을 통해 산출될 수 있 다. 수학식 4 여기서, 는 상담 내용에 포함된 단어들 중EVS가 i인 단어의 비율을 의미한다. 즉, 상담 내용에서 EVS가 i인 단어들의 분포를 분석함으로써, 상담 내용 내의 감정 분포를 추정할 수 있다. 즉, 감정 다양성은 상담 내용에 포함된 단어들 중 감정 점수가 i인 단어의 비율을 뜻하는 와 를 곱한 값의 총 합에 -1을 곱하여 산출할 수 있다. 이를 통해, 상담 내용 분석부는 감정 점수(EVS), 감정 강도(EI) 및 감정 다양성(ED)를 사용하여 아래 수학 식과 같이 상담 내용 점수를 산출할 수 있다. 수학식 5"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 7, "content": "도 3은 상담 내용 점수 계산을 설명하기 위한 예시도이다. 도 3을 참조하면, ANEW 어휘집을 사용하여 각 단어에 대한 EVS, EAS 및 감정 다양성을 산출할 수 있다. 예를 들어, \"나는 내 직업에 대해 정말 답답하고 절망적입니다. 열심히 일했지만 아무것도 내 뜻대로 되지 않는 것 같습니다. 나 자신과 내 능력을 의심하기 시작했습니다.\"라는 예문의 상담 내용이 존재할 때, 상담내용 점수 는 아래와 같이 계산될 수 있다. 도 3 및 위 예시 문장을 참조하면, EVS가 1인 단어는 1개, EVS가 2인 단어는 2개, EVS가 5인 단어는 2개, EVS가 7인 단어는 1개를 포함하고, 나머지 EVS 를 갖는 단어는 0개이다. 도 3과 수학식 4를 통해, 예시의 상담 내용에 대한 ED를 각 산출할 수 있다. 수학식 6"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "또한, 도 3을 참조하면, 예시 상담 내용에서 평균 EVS를 산출할 수 있다. 예를 들어, 예시 문장에서 평균 EVS는 (2+1+5+5+2+7)/6=3.67로 산출된다. 한편, 도 3과 수학식 3을 참조하면, EI는 다음과 같이 산출될 수 있다. 수학식 7"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "이를 사용하여, 위 예시 문장의 상담 내용 점수를 산출하면 아래와 같다. 수학식 8"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "즉, 상담 내용 분석부는 EVS 평균이 3.67, 감정강도가 5.89, 감정 다양성이 1.91인 경우, EVS는 5 미만인 경우 부정적 단어가 다수 포함됨을 의미하므로 3.67의 점수는 부정적 단어가 긍정적 단어보다 많음을 의미하고, 감정 강도(EAS)는 5를 초과하는 경우 감정이 강하게 표출됨을 의미하므로, 5.89는 다소 높은 감정의 표출 정도 를 나타내며, 감정 다양성은 1.91로 높지 않은 감정 다양성을 보여줘, 일관된 감정의 방향을 나타낸 것으로 해 석할 수 있다. 이를 종합하여, 상담 내용 분석부는 상담 내용 점수 73.58로부터, 상담 내용이 '부정적 감정으로 일관되어 다소 강한 감정 표현'이 포함된 것으로 결정할 수 있다. 이에 제한되지 않으며, 상담내용 분석부는 EVS가 중립인 5, EI 가 중립인 5, ED가 일반적인 수준인 1.5라 고 가정했을 때의 CSS 값인 75를 기준으로 그 이하인 경우 해당 문장은 부정적이라고 판단하고, 그 값을 초과 하는 경우 해당 문장이 긍정적이라고 판단할 수 있다. 또한, 상담 내용 분석부는 상담자의 발화에 포함된 각 단어를 디지털화하여 임베딩 벡터로 표현하고 이를 이용하여 문장의 전체적인 긍정 또는 부정 점수를 결정할 수 있다. 임베딩은 자연어를 컴퓨터가 처리할 수 있는 숫자들의 나열인 벡터로 변환한 결과를 말하며, 단어 임베딩은 말 뭉치의 컨텍스트(context)를 기반으로 의미론적 의미를 포착하여 이를 벡터로 표현한 것이다. 상담내용 분석부는 단어 임베딩을 생성하기 위해 BERT(Pre-training of Deep Bidirectional Transformers for Language Understanding)와 같은 사전 훈련된 언어 모델을 사용하거나 대규모의 텍스트 데이터 코퍼스에서 자체 임베딩 모델을 훈련할 수 있다. 이를 통해, 단어 임베딩이 완료되고 나면, 문장의 모든 단어에 대한 평균 임베딩 벡터를 계산함으로써 문장 임베딩 벡터를 생성할 수 있다. 상담내용 분석부는 문장 임베딩 벡터로부터 상담내용의 긍정 및 부정을 분석할 수 있다. 예를 들어, 문장 임베딩 벡터를 사용하여 문장의 감정 점수를 산출하기 위해 긍정 및 부정 문장의 레이블이 지정된 데이터 세트 에서 미리 훈련된 언어 모델을 사용할 수 있다. 일 예로, 상담내용 분석부는 임베딩 벡터를 사용하여 상담 내용 점수(CCS)를 문장 감정 점수(SEVS, Sentence Emotional Valence Score)를 사용하여 아래의 수학식과 같이 산출할 수 있다. 수학식 9"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "여기서, SEVS는 문장 감정 점수로, 상담 내용에 포함된 문장을 임베딩 벡터를 사용하여 감정 점수에 대응시킨 점수이고, EI는 감점 강도, ED는 감정 다양성을 의미한다. 예를 들어, \"오늘 기분이 훨씬 나아졌다\"라는 문장에서 SEVS가 0.8, EI가 5.5, ED가 0.6인 경우, CSS는 0.8*6.5*1.6=8.32로 산출될 수 있다. 이 경우 상담 내용 분석부는 SEVS가 0.8, 감정강도가 5.5 감정 다양 성이 0.6이므로, SEVS는 0.5 미만인 경우 부정적 단어가 다수 포함됨을 의미하므로 0.8의 점수는 긍정적 단어가 부정적 단어보다 많음을 의미하고, 감정 강도(EAS)는 5를 초과하는 경우 감정이 강하게 표출됨을 의미하므로, 5.5는 다소 높은 감정의 표출 정도를 나타내며, 감정 다양성은 1.6로 높지 않은 감정 다양성을 보여줘, 일관된 감정의 방향을 나타낸 것으로 해석할 수 있다. 이를 종합하여, 상담 내용 분석부는 상담 내용 점수 8.32로부터, 상담 내용이 '긍정적 감정으로 일관되어 다소 강한 감정 표현'이 포함된 것으로 결정할 수 있다.한편, 상황 분석부는 사용자의 상담 환경에 따라 해당 상담을 지속할 것인지 여부를 판단할 수 있다. 예를 들어, 상담을 진행할 때, 상황 분석부는 고객이 사용하는 사용자 단말로부터 고객이 상담을 진행하는 상황에 대한 정보 및 상담원이 사용하는 상담 단말로부터 상담 진행 상황에 대한 환경 정보를 수신할 수 있 다. 예컨대, 환경 정보로서 노이즈의 강도, 조명 강도, 온도 편차 및 습도 편차가 포함될 수 있다. 일 예로, 주변 소음은 상담 중 주의 산만과 간섭의 주요 원인이 되어 상담원과 고객이 효과적으로 의사소통하기 어려울 수 있 다. 또한, 높은 소음 수준은 상담원과 고객 사이의 의사소통에 부정적인 영향을 미치고 스트레스를 증가시키며 생산성을 감소시킬 수 있으며, 이러한 스트레스는 결과적으로 상담원에게 부정적인 정신적 영향으로 반영될 수 있다. 또한, 편안하고 자연스러운 상담 환경을 조성하기 위해서는 적절한 조명이 필요되는데, 조명의 강도와 같은 광 도는 눈의 피로, 두통, 기타 신체적 불편을 야기할 수 있으며, 이는 상담원과 고객이 상담에 집중하는 것을 더 어렵게 만들 수 있다. 한편, 조명은 기분과 컨디션에 영향을 미칠 수 있고, 이것은 상담의 효과에 직접적인 영 향을 미칠 수 있다. 나아가, 인지 수행에 있어 최적의 온도 범위는 정해져 있으며, 이를 벗어나는 지나친 추위 또는 더위는 불편감을 느끼게 함은 물론 상담원과 고객의 주의를 산만하게 할 수 있다. 또한, 기온은 상담시 발 생하는 내용과 무관하게 기분과 정신을 결정할 수 있는 요소가 될 수 있다. 아울러, 높은 습도는 신체적 불편함을 유발할 수 있고 습도가 낮으면 피부 건조, 목구멍, 코막힘 등을 유발할 수 있다. 이는 상담원 및 고객의 인지 능력과 편안함에 영향을 미치는 환경적 요소가 될 수 있다. 이를 고려하여, 상황 분석부는 상담이 진행되는 현장의 환경 요소인 소음강도, 조명강도, 온도, 습도 및 미리 정해진 쾌적소음, 쾌적조명, 쾌적온도 및 쾌적 습도의 비율을 사용하여 아래의 수학식을 통해 상담 지속 지수(CCI, Counseling Continuation Index)를 산출할 수 있다. 수학식 10"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "여기서, 쾌적 소음, 쾌적 조명, 쾌적 온도 및 쾌적 습도는 상담을 진행할 때 적절한 소음, 조명, 온도 및 습도 로서 미리 정해진 값이 될 수 있으며, 소음강도, 조명강도, 온도 및 습도는 사용자 단말 또는 상담 단말 을 통해 고객 또는 상담원의 상담 환경에서 직접 측정된 정보일 수 있다. 또한, a, b, c, d는 각 환경 요소 에 대한 가중치를 의미한다. 일 예로, a, b, c, d는 상담을 진행하는 상담 시각 및 상담 계절에 따라 변경될 수 있다. 일 예로, 일반적으로 많은 사람이 근로 활동을 하는 낮시간은 소음 강도와 조명 강도가 높을 수 있고, 근로활동 이 적은 밤 시간은 소음 강도와 조명 강도가 상담 환경에 큰 영향을 미치므로, a, b에 높은 가중치를 부여하고, 여름과 겨울과 같이 온도 편차와 습도 편차가 크게 발생하는 계절에는 c, d에 높은 가중치를 부여할 수 있다. 또한, 적절한 CCI 값은 0.8에서 1.2 사이의 범위가 될 수 있으며, 이에 미달되거나 이를 초과하는 CCI는 적절하 지 않은 상담 환경이 조성되어 있음을 의미할 수 있다. 일 예로, 봄 계절 낮시간에 상담이 진행되어, 쾌적 소음, 쾌적 조명, 쾌적 온도 및 쾌적 습도가 각각 50dB, 500lux, 20°C, 50%이고, 사용자 단말을 통해 측정된 고객이 상담을 진행하고 있는 환경의 소음강도, 조명 강도, 온도 및 습도가 각각 65dB, 300lux, 18°C, 40%라고 가정하고, 가중치 a, b, c, d에서 a=2, b=c=d=1인경 우 아래와 같이 CCI가 산출된다.수학식 11"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "즉, CCI는 0.045로 산출되었고, 이는 낮시간에 높은 소음(65dB)으로 인해 상담 지속이 부적절함을 의미할 수 있 다. 이처럼 상황 분석부는 상담원과 고객의 상담이 진행되는 환경 정보를 사용하여 상담의 계속 여부를 결정할 수 있다. 한편, 상담 전환부는 상담내용 분석부 및 상황 분석부의 분석 결과에 따라, 상담내용 점수 또는 상담 지속 지수 중 적어도 어느 하나가 미리 정해진 임계 범위를 벗어나는 경우 상담을 자동 상담으로 전환할 수 있다. 예를 들어, 상담 전환부는 상담내용 분석부가 상담원과 고객의 상담 결과에 따라 상담 내용에 포함된 단어, 문장에 욕설, 비속어 등이 포함되어 있어, 감정 점수가 지나치게 낮거나, 감정 강도가 높다고 판단하면, 그 판단 결과에 따라 상담을 중단할 수 있다. 또한, 상담 전환부는 상황 분석부의 상담 환경, 즉, 상담원 또는 고객이 상담을 진행하고 있는 공간 의 환경, 예컨대, 소음, 광도, 온도 및 습도와 같은 주변 환경의 분석에 따라, 해당 환경에서 상담을 계속 진행 하는 것이 적절하지 않다고 판단한 경우, 그 판단 결과에 따라 상담을 중단할 수 있다. 이때, 상담 전환부는 상담원과 고객의 상담을 중단하고, 상담 방법을 전환하여 ARS 상담, 인공지능 상담원 상담, 다른 상담원으로 변경 및 상담 종료와 같이 상담을 전환할 수 있다. 한편, 상담 전환부는 상담 내용 점수(CCS) 및 상담 지속 지수(CCI)를 함께 고려하여 상담을 종료 또는 상 담을 전환할 수 있다. 예를 들어, 상담 전환부는 아래 수학식과 같이 상담 내용 점수에 상담 지속 지수를 곱하여 상담 전환 결정 지수(CCDI, Counseling Conversion Determination Index)를 산출할 수 있다. 수학식 12"}
{"patent_id": "10-2023-0022235", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "즉 상담 지속 지수는, 상담의 내용과는 독립적으로 상담원 및 고객이 상담을 진행하는 독립적인 상담 환경에 관 련된 지수이고, 상담 내용 점수는 상담 내용에 포함된 문구들에 따른 고객의 감정을 추정하기 위한 점수이다. 따라서, 상담 전환부는 상담 내용 점수에 상담 지속 지수를 곱함으로써, 상담 지속지수가 상담에 적합하지 않은 범위에 존재하는 경우, 상담을 중단할 수 있다. 예컨대, 적절한 CCI 값의 범위가 0.8~1.2이고, CSS의 기준 값이 75인 경우 CCDI의 값이 미리 정해진 범위인 60~90을 벗어나는 경우 상담을 임의로 중단하고, 상담 종료 또 는 자동상담 전환을 할 수 있다. 도 4는 음성 및 상환 인지 기반 상담 운용 서버를 설명하기 위한 다른 개략도이다. 도 4를 참조하면, 음성 및 상환 인지 기반 상담 운용 서버(이하, '서버'라고 함)는 상담내용 분석부, 상황 분석부, 상담 전환부, 자동 상담부 및 상담이력데이터베이스을 포함할 수 있다. 여기서, 상담내용 분석부, 상황 분석부, 상담 전환부는 도 2를 참조하여 설명한 상담내용 분석 부, 상황 분석부, 상담 전환부와 동일한 구성이므로, 이하 중복되지 않는 구성을 중심으로 설명 한다.자동 상담부는 상담 전환부의 상담 전환 결정에 따라 자동 상담을 진행할 수 있다. 자동 상담은 ARS 상담, 인공지능 상담원 상담과 같이 사람이 진행하지 않는 상담을 의미한다. 예컨대, ARS 상담은 고객의 문의를 접수하고, 다른 상담원 등이 답변을 제시할 수 있는 예상 시간을 제공할 수 있으며, 또는 정형화된 질문에 대한 답변을 곧바로 제공할 수 있다. ARS 상담은 상담자 또는 고객이 접속된 경우 미리 정해진 규칙 또는 템플릿을 기반으로 응답을 생성하고, 그에 대응하는 답변을 곧바로 제공할 수 있어, 고객의 대기 시간을 발생시키지 않는 다는 장점이 있다. 또한, 응답에는 고객의 이름, 연락처, 특정 서비스 또는 상품에 대한 구체적인 내용이 포함 되어 고객의 개인 맞춤형 답변을 제공할 수도 있다. 또한 인공지능 상담은 예컨대, AI 챗봇과 같이 인공지능 언어 모델을 활용하여 고객의 문의에 대한 응대를 진행 할 수 있다. 예컨대, 인공지능 상담은 자연어처리(NLP, natural language processing) 또는 기계학습(ML, Machine learning)과 같은 인공지능 언어 모델을 활용하여 고객의 문의를 이해하고 상담을 진행할 수 있다. 이 때, 인공지능 상담은 고객의 상담 내용을 이해하고 해석할 수 있는 자연어 이해(NLU, natural language understanding) 모듈 및 대화 관리 모듈을 포함할 수 있다. 일 예로, 자동 상담을 위한 인공지능 상담 모델은 일반적인 문의 및 특정 문의에 대한 응답을 포함하여 다수의 고객 상담 데이터를 기초로 모델을 학습할 수 있다. 이 학습은 자연어 처리 모델을 통해 점차 고도화되고 고객 의 질문에 대한 패턴을 인식함으로써 고객의 문의 사항을 이해할 수 있다. 이를 통해 자동 상담부는 상담원의 상담 진행 지속이 불가능한 경우 인공지능 상담을 통해 지속적인 상담 을 계속함으로써, 상담자 또는 고객의 만족을 유지하면서 상담원의 감정 노동 강도를 완화하고, 정신 건강을 확 보할 수 있다. 한편, 상담이력데이터베이스는 사용자 단말 및 상담 단말을 통해 상담원 및 상담자 또는 고객이 진행하는 상담에 관한 정보들을 저장 및 관리할 수 있다. 예를 들어, 상담이력데이터베이스는 상담내용 분석부가 상담 내용으로부터 분석한, 감정 점수, 감정 강도 및 감정 다양성과 이를 통해 산출된 상담 내용 점수(CCS)를 저장할 수 있다. 또한, 상담이력데이터베이스 는 상황 분석부의 상담 환경 분석과 관련된 정보, 예컨대, 상담이 진행되는 상태의 상담원 또는 고객 의 상담 환경(예: 소음, 조명, 온도 및 습도) 정보를 저장할 수 있다. 또한, 상담이력데이터베이스는 상담 이력을 하나 이상의 분류로 구분하여 저장할 수 있다. 예를 들어, 상담이력데이터베이스는 상담원 이름, 상담자 또는 고객 이름, 성별, 연령대, 상담지역, 상담 시간, 상담 시각, 상담 내용 점수, 자동상담 전환 여부에 따라 적어도 하나 이상의 카테고리로 상담 이력을 저 장하여 관리할 수 있다. 도 5는 도 1에 따른 음성 및 상황 인지 기반 상담 운용 서버에 대한 하드웨어 구성도이다. 도 5를 참조하면, 음성 및 상황 인지 기반 상담 운용 서버는, 적어도 하나의 프로세서(processor, 510) 및 적어도 하나의 프로세서가 적어도 하나의 단계를 수행하도록 지시하는 명령어들(instructions)을 저장하는 메모리(memory, 520)를 포함할 수 있다. 여기서 적어도 하나의 프로세서는 중앙 처리 장치(central processing unit, CPU), 그래픽 처리 장치 (graphics processing unit, GPU), 또는 본 발명의 실시예들에 따른 방법들이 수행되는 전용의 프로세서를 의미 할 수 있다. 메모리 및 저장 장치 각각은 휘발성 저장 매체 및 비휘발성 저장 매체 중에서 적어도 하 나로 구성될 수 있다. 예를 들어, 메모리는 읽기 전용 메모리(read only memory, ROM) 및 랜덤 액세스 메 모리(random access memory, RAM) 중에서 적어도 하나로 구성될 수 있다. 또한, 음성 및 상황 인지 기반 상담 운용 서버는, 무선 네트워크를 통해 통신을 수행하는 송수신 장치 (transceiver, 530)를 포함할 수 있다. 또한, 음성 및 상황 인지 기반 상담 운용 서버는 입력 인터페이스 장치, 출력 인터페이스 장치, 저장 장치 등을 더 포함할 수 있다. 맞춤형 매트리스 추천 플랫폼 운용 서버에 포함된 각각의 구성 요소들은 버스(bus, 1070)에 의해 연결되어 서로 통신을 수행할 수 있다. 본 발명에 따른 방법들은 다양한 컴퓨터 수단을 통해 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독 으로 또는 조합하여 포함할 수 있다. 컴퓨터 판독 가능 매체에 기록되는 프로그램 명령은 본 발명을 위해 특별 히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다.컴퓨터 판독 가능 매체의 예에는 롬(ROM), 램(RAM), 플래시 메모리(flash memory) 등과 같이 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함될 수 있다. 프로그램 명령의 예에는 컴파일러 (compiler)에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터(interpreter) 등을 사용해서 컴퓨 터에 의해 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 본 발명의 동작을 수행하 기 위해 적어도 하나의 소프트웨어 모듈로 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 상술한 방법 또는 장치는 그 구성이나 기능의 전부 또는 일부가 결합되어 구현되거나, 분리되어 구현될 수 있다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특 허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0022235", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 특정한 바람직한 실시예들의 상기에서 설명한 바와 같은 또한 다른 측면들과, 특징들 및 이득들은 첨 부 도면들과 함께 처리되는 하기의 설명으로부터 보다 명백하게 될 것이다. 도 1은 본 발명의 일 실시예에 따른 음성 및 상황 인지 기반 상담 운용 서버의 구동 환경을 나타낸 예시도이다. 도 2는 음성 및 상환 인지 기반 상담 운용 서버를 설명하기 위한 개략도이다. 도 3은 상담 내용 점수 계산을 설명하기 위한 예시도이다. 도 4는 음성 및 상환 인지 기반 상담 운용 서버를 설명하기 위한 다른 개략도이다. 도 5는 도 1에 따른 음성 및 상황 인지 기반 상담 운용 서버에 대한 하드웨어 구성도이다. 상기 도면들을 통해, 유사 참조 번호들은 동일한 혹은 유사한 엘리먼트들과, 특징들 및 구조들을 도시하기 위해 사용된다는 것에 유의해야만 한다."}
