{"patent_id": "10-2015-0075280", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0139776", "출원번호": "10-2015-0075280", "발명의 명칭": "오디오 신호의 잡음을 제거하기 위한 방법 및 그 전자 장치", "출원인": "삼성전자주식회사", "발명자": "허승윤"}}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 상대 전자 장치와의 음성 통화 서비스를 제공하는 통신 모듈; 적어도 하나의 잡음 제거 변수를 저장하는 메모리; 상기 통신 모듈을 통해 상기 상대 전자 장치와의 호를 설정한 경우, 상기 메모리에서 수신 신호 세기에 대응하는 잡음 제거 변수를 선택하고, 상기 수신 신호에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을제거하도록 제어하는 프로세서를 포함하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 메모리는, 전계 강도별로 잡음 제거 변수를 저장하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 잡음 제거 변수는, 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨 및 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 프로세서는, 상기 전자 장치의 송신 전력 레벨에 대응하는 전계 강도를 검출하고, 상기 메모리에서 상기전계 강도에 대응하는 잡음 제거 레벨을 선택하고, 상기 전계 강도에 대응하는 잡음 제거 레벨에 기반하여 오디오 신호의 잡음을 제거하는 프로세서를 포함하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 프로세서는, 상기 전자 장치의 수신 신호 품질에 대응하는 전계 강도를 검출하고, 상기 메모리에서 상기전계 강도에 대응하는 잡음 제거 레벨을 선택하고, 상기 전계 강도에 대응하는 잡음 제거 레벨에 기반하여 오디오 신호의 잡음을 제거하는 프로세서를 포함하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 수신 신호 품질은, 수신 신호 세기, 비트 에러율, 프레임 에러율, 신호대 잡음 비 중 적어도 하나를 포함하는 장치.공개특허 10-2016-0139776-3-청구항 7 제 1항에 있어서,상기 수신 신호에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하는 오디오 처리 모듈을 더포함하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "전자 장치에 있어서, 상대 전자 장치와의 음성 통화 서비스를 제공하는 통신 모듈; 각각의 전계 강도에 대한 잡음 제거 변수를 저장하는 메모리; 상기 통신 모듈을 통해 상기 상대 전자 장치와의 호를 설정한 경우, 상기 전자 장치의 전계 강도를 검출하고,상기 전계 강도의 변경에 대한 응답으로 상기 전계 강도에 대응하도록 잡음 제거 변수를 변경하고, 상기 전계강도에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하도록 제어하는 프로세서를 포함하는장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,상기 잡음 제거 변수는, 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨 및 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8항에 있어서,상기 프로세서는, 상기 전자 장치의 송신 전력 레벨 또는 수신 신호 품질에 기반하여 상기 전자 장치의 전계 강도를 검출하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10항에 있어서,상기 수신 신호 품질은, 수신 신호 세기, 비트 에러율, 프레임 에러율, 신호대 잡음 비 중 적어도 하나를 포함하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8항에 있어서,상기 전계 강도에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하는 오디오 처리 모듈을 더포함하는 장치."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "전자 장치의 동작 방법에 있어서, 공개특허 10-2016-0139776-4-상대 전자 장치와의 호를 설정하는 동작; 수신 신호 세기에 대응하는 잡음 제거 변수를 선택하는 동작; 상기 수신 신호에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서, 상기 잡음 제거 변수는, 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨 및 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13항에 있어서,상기 잡음 제거 변수를 선택하는 동작은, 상기 전자 장치의 송신 전력 레벨에 대응하는 전계 강도를 검출하는 동작; 상기 전자 장치의 메모리에서 상기 전계 강도에 대응하는 잡음 제거 레벨을 선택하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13항에 있어서,상기 잡음 제거 변수를 선택하는 동작은, 상기 전자 장치의 수신 신호 품질에 대응하는 전계 강도를 검출하는 동작;상기 전자 장치의 메모리에서 상기 전계 강도에 대응하는 잡음 제거 레벨을 선택하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16항에 있어서,상기 수신 신호 품질은, 수신 신호 세기, 비트 에러율, 프레임 에러율, 신호대 잡음 비 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "전자 장치의 동작에 있어서, 상대 전자 장치와의 호를 설정하는 동작; 상기 전자 장치의 전계 강도를 검출하는 동작; 상기 전계 강도의 변경에 대한 응답으로 상기 전계 강도에 대응하도록 잡음 제거 변수를 변경하는 동작; 상기 전계 강도에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,공개특허 10-2016-0139776-5-상기 잡음 제거 변수는, 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨 및 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18항에 있어서,상기 전계 강도를 검출하는 동작은, 상기 전자 장치의 송신 전력 레벨 또는 수신 신호 품질에 기반하여 상기 전자 장치의 전계 강도를 검출하는 동작을 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20항에 있어서,상기 수신 신호 품질은, 수신 신호 세기, 비트 에러율, 프레임 에러율, 신호대 잡음 비 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2015-0075280", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 전자 장치에서 오디오 신호의 잡음을 제거하기 위한 장치 및 방법에 관한 것이다. 이때, 전자 장치는, 전자 장치는, 상대 전자 장치와의 음성 통화 서비스를 제공하는 통신 모듈과 적어도 하나의 잡음 제거 변수를 저장하는 메모리와 상기 통신 모듈을 통해 상기 상대 전자 장치와의 호를 설정한 경우, 상기 메모리에서 수신 신호 세기에 대응하는 잡음 제거 변수를 선택하고, 상기 수신 신호에 대응하는 잡음 제거 변수 에 기반하여 오디오 신호의 잡음을 제거하도록 제어하는 프로세서를 포함할 수 있다. 다른 실시 예들도 가능할 수 있다."}
{"patent_id": "10-2015-0075280", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 전자 장치에서 오디오 신호의 잡음을 제거하기 위한 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2015-0075280", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 GSM (global system for mobile communication) 통신 방식과 같이 TDMA(time division multiple access) 방식을 사용하는 경우, 해당 전자 장치에 할당된 통신 구간(송신 구간 및 수신 구간)에서 데이터를 송 수신할 수 있다. 이에 따라, 전자 장치는 해당 전자 장치에 할당된 통신 구간에서 통신 구간 외의 나머지 구간 보다 많은 전력을 소모할 수 있다. 특히, 전자 장치는 통신 구간 중 수신 구간보다 송신 구간에서 보다 많은 전 력을 소모할 수 있다. TDMA 방식을 사용하는 전자 장치는 송신 구간에서 많은 전력을 소모함에 따라 특정 주파수의 TDMA 잡음(TDMA noise)이 발생할 수 있다."}
{"patent_id": "10-2015-0075280", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는 TDMA 잡음의 저감을 위해 자동 이득 제어(AGC: automatic gain control) 및 잡음 억제(NS: noise suppression) 방식을 사용할 수 있다. TDMA 잡음은 전자 장치의 송신 전력이 커질수록 더욱 심해져서 통화품질을 저해시키는 문제점이 유발하게 된다. 예를 들어, 전자 장치는 전자 장치가 위치한 무선 환경의 특성(예: 전계 강도)에 따라 송신 전력을 다르게 사용 할 수 있다. 이에 따라, 전자 장치의 TDMA 잡음은 무선 환경의 특성에 따라 다르게 나타날 수 있다. 하지만, 전자 장치는 무선 환경의 특성에 상관없이 자동 이득 제어 및 잡음 억제를 위한 변수가 고정되므로 무 선 환경 특성에 기반하여 TDMA 잡음을 효율적으로 제거하기 위한 방안을 필요로 한다. 본 발명의 다양한 실시 예는 전자 장치에서 무선 환경 특성(예: 전계 강도)에 기반하여 오디오 신호의 잡음을 적응적으로 제거하기 위한 장치 및 방법을 제공할 수 있다."}
{"patent_id": "10-2015-0075280", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, 전자 장치는, 상대 전자 장치와의 음성 통화 서비스를 제공하는 통신 모듈 과 적어도 하나의 잡음 제거 변수를 저장하는 메모리와 상기 통신 모듈을 통해 상기 상대 전자 장치와의 호를 설정한 경우, 상기 메모리에서 수신 신호 세기에 대응하는 잡음 제거 변수를 선택하고, 상기 수신 신호에 대응 하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하도록 제어하는 프로세서를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는, 상대 전자 장치와의 음성 통화 서비스를 제공하는 통신 모듈 과 각각의 전계 강도에 대한 잡음 제거 변수를 저장하는 메모리와 상기 통신 모듈을 통해 상기 상대 전자 장치 와의 호를 설정한 경우, 상기 전자 장치의 전계 강도를 검출하고, 상기 전계 강도의 변경에 대한 응답으로 상기 전계 강도에 대응하도록 잡음 제거 변수를 변경하고, 상기 전계 강도에 대응하는 잡음 제거 변수에 기반하여 오 디오 신호의 잡음을 제거하도록 제어하는 프로세서를 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치의 동작 방법은, 상대 전자 장치와의 호를 설정하는 동작과 수신 신호 세기에 대응하는 잡음 제거 변수를 선택하는 동작과 상기 수신 신호에 대응하는 잡음 제거 변수에 기반하 여 오디오 신호의 잡음을 제거하는 동작을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치의 동작 방법은, 상대 전자 장치와의 호를 설정하는 동작과 상기 전자 장치의 전계 강도를 검출하는 동작과 상기 전계 강도의 변경에 대한 응답으로 상기 전계 강도에 대응하도 록 잡음 제거 변수를 변경하는 동작과 상기 전계 강도에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡 음을 제거하는 동작을 포함할 수 있다."}
{"patent_id": "10-2015-0075280", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에 따른 전자 장치 및 그 동작 방법은, 전자 장치의 무선 환경 특성(예: 전계 강도)에 기반하여 잡음 제거를 위한 변수를 적응적으로 설정하여 오디오 신호의 잡음을 제거함으로써, 오디오 신호에 대한 잡음 제거 효율을 높일 수 있다."}
{"patent_id": "10-2015-0075280", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시 예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1\", \"제 2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요 소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상술한 어떤 구성요소가 상술한 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성 요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다른 구 성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 어떤 구성요소 와 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도 록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 AP(application processor))를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), PDA(personal digital assistant), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예 에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 통신 기능을 포함하는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널(security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 통신 기능을 포함하는 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정 기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위 성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things)(예: 전구, 각종 센서, 전 기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동 기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 통신 기능을 포함하는 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양 한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들 에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 다양한 실시 예에 따른 전자 장치의 블록도를 도시하고 있다. 도 1을 참조하면 전자 장치는 프로세서, 메모리, 디스플레이, 입력 모듈, 오디오 처 리 모듈 및 통신 모듈을 포함할 수 있다. 전자 장치는 적어도 하나의 프로세서를 포함할 수 있다. 프로세서는 중앙처리전자 장치 (CPU), 어플리케이션 프로세서 (AP), 또는 커뮤니케이션 프로세서 (CP)를 포함할 수 있다. 한 실시 예에 따르면, 프로세서는 통신 모듈을 통해 상대 전자 장치와 호(call)를 연결하도록 제어할 수 있다. 한 실시 예에 따르면, 프로세서는 상대 전자 장치와 호가 연결된 경우, 전계 강도 확인 모듈과 잡음 제거 제어 모듈을 이용하여 오디오 신호의 잡음을 제거하도록 오디오 처리 모듈을 제어할 수 있다. 전계 강도 확인 모듈은 수신 신호 세기에 대응하는 전자 장치의 전계 강도를 확인할 수 있다. 한 실시 예에 따르면, 전계 강도 확인 모듈은 통신 모듈을 통해 수신한 신호(예: RF(radio frequency) 신호)의 세기에 기반하여 전계 강도를 확인할 수 있다. 예를 들어, 전계 강도 확인 모듈은 신 호 세기 측정 모듈(미 도시)를 통해 측정한 수신 신호 세기에 기반하여 전자 장치의 전계 강도를 확인할 수 있다. 여기서, 신호의 세기는, RSSI(Received signal strength indicator) 및 RSRP(reference signal received power) 등을 나타낼 수 있다. 한 실시 예에 따르면, 전계 강도 확인 모듈은 통신 모듈을 통해 수신한 신호(예: RF(radio frequency) 신호)의 품질에 기반하여 전계 강도를 확인할 수 있다. 여기서, 신호의 품질은 RSRQ(reference signal received quality), RCSP(received signal code power), Ec/Io, BER(bit error rate), FER(frame error rate) 등으로 나타낼 수 있다. 한 실시 예에 따르면, 전계 강도 확인 모듈은 전자 장치의 송신 출력 레벨(TX power level)에 기반하 여 전계 강도를 확인할 수 있다. 예를 들어, 전자 장치는 전자 장치가 접속된 서빙 기지국으로부터제공받은 제어 신호에 기반하여 송신 출력 레벨을 결정할 수 있다. 잡음 제거 제어 모듈은 전계 강도 확인 모듈에서 확인한 전자 장치의 전계 강도에 기반하여 오 디오 신호의 잡음 제거를 적응적으로 제어할 수 있다. 한 실시 예에 따르면, 잡음 제거 제어 모듈은 전계 강도 확인 모듈에서 확인한 전자 장치의 전 계 강도에 기반하여 오디오 처리 모듈의 잡음 제거 변수를 선택할 수 있다. 예를 들어, 잡음 제거 제어 모 듈은 전계 강도 확인 모듈에서 전자 장치의 전계 강도를 약전계로 확인한 경우, 메모리에 저장된 잡음 제거 변수들 중 약전계에 대응하는 잡음 제거 변수를 선택할 수 있다. 예를 들어, 잡음 제거 제어 모듈은 전계 강도 확인 모듈에서 전자 장치의 전계 강도를 강전계로 확인한 경우, 메모리 에 저장된 잡음 제거 변수들 중 강전계에 대응하는 잡음 제거 변수를 선택할 수 있다. 예를 들어, 잡음 제거 변 수는 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨, 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함할 수 있다. 여기서, 자동 이득 제어 레벨은 자동 이득 제어를 위한 확장기(expande r)의 값(EXP)을 포함할 수 있다. 한 실시 예에 따르면, 잡음 제거 제어 모듈은 전계 강도 확인 모듈에서 전자 장치의 전계 강도 변화를 감지한 경우, 오디오 처리 모듈의 잡음 제거 변수를 전자 장치의 전계 강도에 대응하는 잡음 제거 변수를 변경할 수 있다. 예를 들어, 잡음 제거 제어 모듈은 전자 장치의 전계 강도를 약전계로 변경된 경우, 오디오 처리 모듈의 잡음 제거 변수를 약전계에 대응하는 잡음 제거 변수로 변경할 수 있다. 예를 들어, 잡음 제거 제어 모듈은 전자 장치의 전계 강도를 강전계로 변경된 경우, 오디오 처리 모 듈의 잡음 제거 변수를 강전계에 대응하는 잡음 제거 변수로 변경할 수 있다. 한 실시 예에 따르면, 잡음 제거 제어 모듈은 전계 강도 확인 모듈에서 확인한 전자 장치의 전 계 강도에 기반하여 잡음 제거를 선택적으로 수행하도록 오디오 처리 모듈을 제어할 수 있다. 예를 들어, 잡음 제거 제어 모듈은 전계 강도 확인 모듈에서 전자 장치의 전계 강도를 약전계로 확인한 경 우, 메모리에 저장된 잡음 제거 변수에 기반하여 잡음 제거를 수행하도록 오디오 처리 모듈을 제어할 수 있다. 예를 들어, 잡음 제거 제어 모듈은 전계 강도 확인 모듈에서 전자 장치의 전계 강도를 강전계로 확인한 경우, 잡음 제거를 수행하지 않도록 오디오 처리 모듈을 제어할 수 있다. 메모리는 전자 장치를 구성하는 구성요소에 관련된 명령 또는 데이터를 저장할 수 있다. 한 실시 예 에 따르면, 메모리는 오디오 처리 모듈에서 잡음 제거를 수행하기 위한 적어도 하나의 잡음 제거 변 수를 저장할 수 있다. 예를 들어, 메모리는 <표 1>과 같이 각각의 전계 강도에 대응하는 잡음 제거 변수를 저장할 수 있다. 표 1 약전계 narrow band 헤드셋 스피커 이어폰 블루투스 wide band 헤드셋 스피커 이어폰 블루투스 강전계 narrow band 헤드셋 스피커 이어폰 블루투스 wide band 헤드셋 스피커 이어폰 블루투스 <표 1>과 같이, 메모리는 약전계에서 오디오 신호의 잡음을 제거하기 위한 잡음 제거 변수와 강전계에서 오디오 신호의 잡음을 제거하기 위한 잡음 제거 변수를 구분하여 저장할 수 있다. 추가적으로, 메모리는 각 전계 강도에서 협대역과 광대역 및 오디오 신호 출력을 위한 장치의 특성(예: 종류)에 기반하여 잡음 제거변수를 구분하여 저장할 수 있다. 디스플레이는 사용자에게 각종 콘텐츠 (예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 예를 들어, 디스플레이는 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light- emitting diode(LED)) 디스플레이, 유기 발광 다이오드(organic light-emitting diode(OLED)) 디스플레이, 또 는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 한 실시 예에 따르면, 디스플레이는 터치 스크린을 포함할 수 있다. 이 경우, 디스플레이는 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 입력 모듈은 사용자 또는 다른 외부 기기로부터 입력된 전자 장치의 동작 제어를 위한 명령 또는 데이터를 전자 장치의 다른 구성요소(들)에 전달할 수 있다. 예를 들어, 입력 모듈은 키패드(key pad), 돔 스위치 (dome switch), 물리 버튼, 터치패드(정압/정전) 및 조그셔틀(jog & shuttle) 등을 포함할 수 있다. 오디오 처리 모듈은 스피커 및 마이크로폰을 통해 사용자와 전자 장치 사이의 오디오 인터페이스를 제공할 수 있다. 한 실시 예에 따르면, 오디오 처리 모듈은 프로세서에 의해 결정된 잡음 제거 변수에 기반하여 오디 오 신호의 잡음을 제거할 수 있다. 예를 들어, 오디오 처리 모듈은 프로세서의 잡음 제거 제어 모듈 에 의해 선택 또는 변경된 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거할 수 있다. 한 실시 예에 따르면, 오디오 처리 모듈은 프로세서의 제어에 기반하여 오디오 신호의 잡음을 선택적 으로 제거할 수 있다. 예를 들어, 오디오 처리 모듈은 프로세서의 잡음 제거 제어 모듈에서 잡 음 제거를 수행하도록 결정한 경우, 잡음 제거 제어 모듈에 의해 선택된 잡음 제거 변수에 기반하여 오디 오 신호의 잡음을 제거할 수 있다. 통신 모듈은 전자 장치와 외부 장치(예: 다른 전자 장치 또는 서버) 간의 신호를 송수신할 수 있다. 통신 모듈은 셀룰러 모듈과 비셀룰러 모듈을 포함할 수 있다. 예를 들어, 셀룰러 모듈은 TDMA 방식을 사용 하는 적어도 하나의 셀룰러 통신 프로토콜을 이용하여 전자 장치와 다른 전자 장치 및/또는 서버 간의 통 신을 가능하게 할 수 있다. 예를 들어, 비셀룰러 모듈은 근거리 무선 통신 방식을 이용하여 전자 장치와 다른 전자 장치 및/또는 서버 간의 통신을 가능하게 할 수 있다. 여기서, 근거리 무선 통신 방식은 WiFi, 블루 투스, BLE, NFC, 지그비 등 중 적어도 하나의 통신 방식을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 전계 강도 확인 모듈과 잡음 제거 제어 모듈 중 적어도 하나를 프로세서와 다른 별도의 모듈로 구성할 수 있다. 도 2는 본 발명의 다양한 실시 예에 따른 전자 장치에서 오디오 신호의 잡음을 제거하기 위한 흐름도를 도시하 고 있다. 도 2를 참조하면, 동작 201에서, 전자 장치(예: 전자 장치)는 호(call)를 설정할 수 있다. 예를 들어, 프 로세서는 통신 모듈을 통해 수신한 상대 전자 장치의 호 요청에 기반하여 상대 전자 장치와의 호를 연결할 수 있다. 예를 들어, 프로세서는 입력 모듈을 통해 제공받은 입력 정보에 기반하여 호 연결 이벤트 발생을 검출한 경우, 입력 정보에 대응하는 상대 전자 장치와의 호를 연결할 수 있다. 동작 203에서, 전자 장치는 수신 신호 세기에 기반하여 잡음 제거 변수를 설정할 수 있다. 예를 들어, 프로세서 는 수신 신호 세기에 기반하여 전자 장치의 전계 강도를 추정할 수 있다. 프로세서는 메모리 에 저장된 적어도 하나의 잡음 제거 변수 중 전자 장치의 전계 강도에 대응하는 잡음 제거 변수를 선 택할 수 있다. 여기서, 잡음 제거 변수는 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨, 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함할 수 있다. 동작 205에서, 전자 장치는 수신 신호 세기에 기반하여 설정한 잡음 제거 변수에 기반하여 오디오 신호의 잡음 을 제거할 수 있다. 예를 들어, 프로세서는 수신 신호 세기에 기반하여 설정한 잡음 제거 변수에 기반하여 상대 전자 장치로부터 제공받은 오디오 신호의 잡음을 제거하도록 오디오 처리 모듈을 제어할 수 있다. 도 3은 본 발명의 다양한 실시 예에 따른 전자 장치에서 송신 출력 레벨에 기반하여 잡음 제거 변수를 설정하기 위한 흐름도를 도시하고 있다. 이하 설명은 도 2의 동작 203에서 수신 신호 세기에 기반하여 잡음 제거 변수를 설정하기 위한 동작에 대해 설명할 수 있다.도 3을 참조하면, 동작 301에서, 전자 장치(예: 전자 장치)는 송신 전력 레벨을 확인할 수 있다. 예를 들 어, 프로세서는 전자 장치가 접속된 서빙 기지국으로부터 제공받은 제어 신호에 기반하여 결정된 송 신 전력 레벨을 확인할 수 있다. 동작 303에서, 전자 장치는 송신 출력 레벨이 기준 레벨을 초과하는지 확인할 수 있다. 여기서, 기준 레벨은 송 신 출력 레벨에 기반하여 전자 장치의 전계 강도를 구분할 수 있도록 기 정의된 송신 출력 레벨을 나타낼 수 있다. 동작 305에서, 전자 장치는 송신 출력 레벨이 기준 레벨을 초과하는 경우, 전자 장치의 전계 강도를 강전 계로 판단할 수 있다. 이에 따라, 전자 장치는 강전계에 대응하는 잡음 제거 변수를 설정할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 적어도 하나의 잡음 제거 변수 중 강전계에 대응하는 잡음 제거 변수를 선택할 수 있다. 동작 307에서, 전자 장치는 송신 출력 레벨이 기준 레벨 이하인 경우, 전자 장치의 전계 강도를 약전계로 판단할 수 있다. 이에 따라, 전자 장치는 약전계에 대응하는 잡음 제거 변수를 설정할 수 있다. 예를 들어, 프 로세서는 메모리에 저장된 적어도 하나의 잡음 제거 변수 중 약전계에 대응하는 잡음 제거 변수를 선 택할 수 있다. 도 4는 본 발명의 다양한 실시 예에 따른 전자 장치에서 수신 신호의 품질에 기반하여 잡음 제거 변수를 설정하 기 위한 흐름도를 도시하고 있다. 이하 설명은 도 2의 동작 203에서 수신 신호 세기에 기반하여 잡음 제거 변수 를 설정하기 위한 동작에 대해 설명할 수 있다. 도 4를 참조하면, 동작 401에서, 전자 장치(예: 전자 장치)는 수신 신호 품질을 확인할 수 있다. 예를 들 어, 전자 장치는 통신 모듈을 통해 수신한 신호의 세기(예: RSSI, RSRP 등)를 측정할 수 있다. 예를 들어, 전자 장치는 통신 모듈을 통해 수신한 신호의 품질(예: RSRQ, RCSP, Ec/Io, BER, FER 등)을 산출할 수 있다. 동작 403에서, 전자 장치는 수신 신호의 품질이 기준 품질보다 좋은지 확인할 수 있다. 여기서, 기준 품질은 수 신 신호의 품질에 기반하여 전자 장치의 전계 강도를 구분할 수 있도록 기 정의된 품질을 나타낼 수 있다. 동작 405에서, 전자 장치는 수신 신호의 품질이 기준 품질을 초과하는 경우, 전자 장치의 전계 강도를 강 전계로 판단할 수 있다. 이에 따라, 전자 장치는 강전계에 대응하는 잡음 제거 변수를 설정할 수 있다. 예를 들 어, 프로세서는 메모리에 저장된 적어도 하나의 잡음 제거 변수 중 강전계에 대응하는 잡음 제거 변 수를 선택할 수 있다. 동작 407에서, 전자 장치는 수신 신호의 품질이 기준 품질 이하인 경우, 전자 장치의 전계 강도를 약전계 로 판단할 수 있다. 이에 따라, 전자 장치는 약전계에 대응하는 잡음 제거 변수를 설정할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 적어도 하나의 잡음 제거 변수 중 약전계에 대응하는 잡음 제거 변수를 선택할 수 있다. 도 5는 본 발명의 다양한 실시 예에 따른 전자 장치에서 전계 강도 변화에 기반하여 잡음 제거 변수를 변경하기 위한 흐름도를 도시하고 있다. 도 5를 참조하면, 동작 501에서, 전자 장치(예: 전자 장치)는 호(call)를 설정할 수 있다. 예를 들어, 프 로세서는 통신 모듈을 통해 상대 전자 장치로부터 호 요청 신호를 수신한 경우, 호 요청 정보(예: 호 수신 화면)를 표시하도록 디스플레이를 제어할 수 있다. 프로세서는 호 요청 정보의 표시에 대한 응 답으로 입력 모듈을 통해 호 연결 입력을 검출한 경우, 상대 전자 장치와의 호를 연결할 수 있다. 예를 들 어, 프로세서는 입력 모듈을 통해 제공받은 입력 정보에 기반하여 호 연결 이벤트 발생을 검출한 경 우, 입력 정보에 대응하는 상대 전자 장치와의 호를 연결할 수 있다. 동작 503에서, 전자 장치는 전계 강도를 확인할 수 있다. 예를 들어, 프로세서는 송신 출력 레벨에 기반하 여 전자 장치의 전계 강도를 결정할 수 있다. 예를 들어, 프로세서는 수신 신호 품질에 기반하여 전 자 장치의 전계 강도를 결정할 수 있다. 여기서, 수신 신호 품질은 수신 신호 세기를 포함할 수 있다. 동작 505에서, 전자 장치는 전계 강도가 변경되었는지 확인할 수 있다. 동작 509에서, 전자 장치는 전계 강도가 변경되지 않은 경우, 기 설정된 잡음 제거 변수(전자 장치의 전계 강도 에 대응하는 잡음 제거 변수)에 기반하여 오디오 신호의 잡음을 제거할 수 있다. 예를 들어, 프로세서는오디오 처리 모듈의 잡음 제거 변수가 유지되도록 제어할 수 있다. 동작 507에서, 전자 장치는 전계 강도가 변경된 경우, 전계 강도에 대응하도록 잡음 제거 변수를 변경할 수 있 다. 예를 들어, 프로세서는 메모리에 저장된 적어도 하나의 잡음 제거 변수 중 전자 장치의 전 계 강도에 대응하는 잡음 제거 변수를 선택할 수 있다. 프로세서는 오디오 처리 모듈에서 잡음 제거 에 사용하는 잡음 제거 변수를 전자 장치의 전계 강도에 대응하는 잡음 제거 변수로 변경할 수 있다. 동작 509에서, 전자 장치는 전계 강도에 대응하는 제거 변수에 기반하여 오디오 신호의 잡음을 제거할 수 있다. 예를 들어, 오디오 처리 모듈은 프로세서에 의해 변경된 잡음 제거 변수에 기반하여 상대 전자 장치 로부터 제공받은 오디오 신호의 잡음을 제거할 수 있다. 도 6은 본 발명의 다양한 실시 예에 따른 전자 장치에서 전계 강도에 기반하여 잡음 제거를 선택적으로 수행하 기 위한 흐름도를 도시하고 있다. 도 6을 참조하면, 동작 601에서, 전자 장치(예: 전자 장치)는 호(call)를 설정할 수 있다. 예를 들어, 프 로세서는 상대 전자 장치의 요청에 기반하여 상대 전자 장치와의 호를 연결할 수 있다. 예를 들어, 프로세 서는 전자 장치의 요청에 기반하여 상대 전자 장치와의 호를 연결할 수 있다. 동작 603에서, 전자 장치는 송신 전력 레벨을 확인할 수 있다. 예를 들어, 프로세서는 전자 장치가 접속된 서빙 기지국으로부터 제공받은 제어 신호에 기반하여 결정된 송신 전력 레벨을 확인할 수 있다. 동작 605에서, 전자 장치는 송신 출력 레벨이 기준 레벨 이하인지 확인할 수 있다. 여기서, 기준 레벨은 송신 출력 레벨에 기반하여 전자 장치의 전계 강도를 구분할 수 있도록 기 정의된 기준 송신 출력 레벨을 포함 할 수 있다. 동작 607에서, 전자 장치는 송신 출력 레벨이 기준 레벨 이하인 경우, 전자 장치의 전계 강도를 약전계로 판단할 수 있다. 이에 따라, 전자 장치는 약전계에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 약전계에 대응하는 잡음 제거 변수에 기반 하여 상대 전자 장치로부터 제공받은 오디오 신호의 잡음을 제거하도록 오디오 처리 모듈을 제어할 수 있 다. 동작 609에서, 전자 장치는 송신 출력 레벨이 기준 레벨을 초과하는 경우, 전자 장치의 전계 강도를 강전 계로 판단할 수 있다. 이에 따라, 전자 장치는 오디오 신호에 대한 잡음 제거 기능을 비활성화할 수 있다. 예를 들어, 프로세서는 전자 장치의 전계 강도가 강전계인 경우, 잡음 제거를 수행하지 않아도 오디오 품 질이 유지할 수 있다고 판단하여 오디오 처리 모듈의 잡음 제거 기능을 비활성화할 수 있다. 도 7은 본 발명의 다양한 실시 예에 따른 전자 장치에서 전계 강도에 기반하여 잡음 제거를 선택적으로 수행하 기 위한 흐름도를 도시하고 있다. 도 7을 참조하면, 동작 701에서, 전자 장치(예: 전자 장치)는 호(call)를 설정할 수 있다. 예를 들어, 프 로세서는 상대 전자 장치의 요청 또는 전자 장치의 요청에 기반하여 상대 전자 장치와의 호를 연결할 수 있다. 동작 703에서, 전자 장치는 수신 신호의 품질을 확인할 수 있다. 예를 들어, 프로세서는 신호 세기 측정 모듈(미 도시)을 통해 측정한 수신 신호 세기(예: RSSI, RSRP 등)를 확인할 수 있다. 예를 들어, 프로세서(11 0)는 통신 모듈을 통해 수신한 신호의 세기에 기반하여 신호의 품질(예: RSRQ, RCSP, Ec/Io, BER, FER 등)을 산출할 수 있다. 동작 705에서, 전자 장치는 수신 신호의 품질이 기준 품질보다 좋은지 확인할 수 있다. 여기서, 기준 품질은 수 신 신호의 품질에 기반하여 전자 장치의 전계 강도를 구분할 수 있도록 기 정의된 품질을 나타낼 수 있다. 동작 707에서, 전자 장치는 수신 신호의 품질이 기준 품질 이하인 경우, 전자 장치의 전계 강도를 약전계 로 판단할 수 있다. 이에 따라, 전자 장치는 약전계에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음 을 제거할 수 있다. 예를 들어, 오디오 처리 모듈은 메모리에 저장된 잡음 제거 변수에 기반하여 상 대 전자 장치로부터 제공받은 오디오 신호의 잡음을 제거할 수 있다. 동작 709에서, 전자 장치는 수신 신호의 품질이 기준 품질을 초과하는 경우, 전자 장치의 전계 강도를 강 전계로 판단할 수 있다. 이에 따라, 전자 장치는 오디오 신호에 대한 잡음 제거 기능을 비활성화할 수 있다. 예 를 들어, 오디오 처리 모듈은 잡음 제거를 수행하지 않고 오디오 신호를 스피커를 통해 외부로 출력할 수있다. 본 발명의 다양한 실시 예에서, 전자 장치는 전계 강도에 대응하는 잡음 제어 변수를 저장할 수 있다. 예를 들 어, 전자 장치는 특정 전계 강도에서 최적의 잡음 제거 효율을 갖는 잡음 제거 변수를 검출하여 저장할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치의 동작 방법은, 상대 전자 장치와의 호를 설정하는 동작과 수신 신호 세기에 대응하는 잡음 제거 변수를 선택하는 동작과 상기 수신 신호에 대응하는 잡음 제거 변수에 기반하 여 오디오 신호의 잡음을 제거하는 동작을 포함할 수 있다. 다양한 실시 예에서, 상기 잡음 제거 변수는, 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨 및 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 상기 잡음 제거 변수를 선택하는 동작은, 상기 전자 장치의 송신 전력 레벨에 대응하는 전 계 강도를 검출하는 동작과 상기 전자 장치의 메모리에서 상기 전계 강도에 대응하는 잡음 제거 레벨을 선택하 는 동작을 포함할 수 있다. 다양한 실시 예에서, 상기 잡음 제거 변수를 선택하는 동작은, 상기 전자 장치의 수신 신호 품질에 대응하는 전 계 강도를 검출하는 동작과 상기 전자 장치의 메모리에서 상기 전계 강도에 대응하는 잡음 제거 레벨을 선택하 는 동작을 포함할 수 있다. 다양한 실시 예에서, 상기 수신 신호 품질은, 수신 신호 세기, 비트 에러율, 프레임 에러율, 신호대 잡음 비 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시 에에 따르면, 전자 장치의 동작은, 상대 전자 장치와의 호를 설정하는 동작과 상기 전자 장치의 전계 강도를 검출하는 동작과 상기 전계 강도의 변경에 대한 응답으로 상기 전계 강도에 대응하도록 잡 음 제거 변수를 변경하는 동작과 상기 전계 강도에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하는 동작을 포함할 수 있다. 다양한 실시 예에서, 상기 잡음 제거 변수는, 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨 및 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 상기 전계 강도를 검출하는 동작은, 상기 전자 장치의 송신 전력 레벨 또는 수신 신호 품 질에 기반하여 상기 전자 장치의 전계 강도를 검출하는 동작을 포함할 수 있다. 다양한 실시 예에서, 상기 수신 신호 품질은, 수신 신호 세기, 비트 에러율, 프레임 에러율, 신호대 잡음 비 중 적어도 하나를 포함할 수 있다. 도 8은 본 발명의 다양한 실시 예에 따른 약전계에서 잡음 제거에 따른 오디오 신호의 성능 변화 그래프를 도시 하고 있다. 이하 설명은 GSM 통신 방식을 사용하는 전자 장치의 송신 전력 레벨이 5(예; 약전계)이며, 백그라운 드 잡음(background noise)가 15dB로 설정된 환경에서 잡음 제거에 따른 성능 변화를 도시하고 있다. 도 8의 (a) 내지 (d)는, 전자 장치에서 자동 이득 제어 레벨(EXP), 잡음 억제 레벨(NS) 및 고역 필터 값(HPF)을 다르게 설정함에 따라 검출한 성능 변화를 나타낼 수 있다. 도 8의 (a)를 참조하면, 전자 장치는 -70dB의 자동 이득 제어 레벨, 0dB의 잡음 억제 레벨 및 300Hz의 고역 필 터 값에 기반하여 오디오 신호의 잡음(예: TDMA 잡음)을 제거할 수 있다. 이 경우, 전자 장치의 잡음 제거 성능은 송화자와 접속 교환기 사이의 음량 손실을 나타내는 송신 음향 세기 (SLR: sending loudness rating)가 5.79dB로 정상 범위(예: 8±3dB)에 포함될 수 있다. 전자 장치의 잡음 제거 성능은 호가 연결된 통화자들의 음향이 발생하지 않은 구간의 잡음을 나타내는 s-noise가 -66.15dBm 으로 정상 범위(예: ≤ -64dBm)에 포함될 수 있다. 전자 장치의 잡음 제거 성능은 잡음 제거에 따른 출력의 변 화 특성을 나타내는 SFR(sensitivity frequency response)이 정상 범위(예: 상위 기준 값 및 하위 기준 값 사이)에 포함될 수 있다. 전자 장치의 잡음 제거에 따른 평균 평가점(MOS: mean opinion score)은 3.6으로 평가될 수 있다. 예를 들어, 평균 평가점은 잡음이 제거 후 음성만을 기준으로 평가하는 절대분류 등급(ACR: absolute category rating) 중 하나로 평균 평가점이 4인 경우, 음성의 품질이 좋음(good)으로 평가하고, 평균 평가점이 3인 경우, 음성의 품질이 적당한(fair)한 것으로 평가할 수 있다.도 8의 (b)를 참조하면, 전자 장치는 도 8의 (a)의 잡음 제거 변수에서 잡음 억제 레벨을 12dB로 변경하여 오디 오 신호의 잡음(예: TDMA 잡음)을 제거할 수 있다. 예를 들어, 전자 장치는 도 8의 (a)와 동일하게 자동 이득 제어 레벨을 -70dB로 설정하고, 고역 필터 값을 300Hz로 설정할 수 있다. 이 경우, 전자 장치의 잡음 제거 성능은 송신 음향 세기(SLR)가 6.04dB로 잡음 제거로 인해 송신 음향의 손실이 발생하지만 정상 범위(예: 8±3dB)에 포함될 수 있다. 전자 장치의 잡음 제거 성능은 호가 연결된 통화자들의 음향이 발생하지 않은 구간의 잡음을 나타내는 s-noise가 -77.07dBm으로 도 8의 (a)보다 잡음을 감소 시킬 수 있다. 전자 장치의 잡음 제거 성능은 잡음 제거에 따른 출력의 변화 특성을 나타내는 SFR이 정상 범위(예: 상위 기준 값 및 하위 기준 값 사이)에 포함될 수 있다. 전자 장치의 잡음 제거에 따른 평균 평가점(MOS)은 3.7로 잡음 제거에 따른 음성 품질이 도 8의 (a)보다 향상시킬 수 있다. 도 8의 (c)를 참조하면, 전자 장치는 도 8의 (a)의 잡음 제거 변수에서 고역 필터 값을 400Hz로 변경하여 오디 오 신호의 잡음(예: TDMA 잡음)을 제거할 수 있다. 예를 들어, 전자 장치는 도 8의 (a)와 동일하게 자동 이득 제어 레벨을 -70dB로 설정하고, 잡음 억제 레벨을 0dB로 설정할 수 있다. 이 경우, 전자 장치의 잡음 제거 성능은 송신 음향 세기(SLR)가 6.68dB로 잡음 제거로 인해 송신 음향의 손실이 발생하지만 정상 범위(예: 8±3dB)에 포함될 수 있다. 전자 장치의 잡음 제거 성능은 호가 연결된 통화자들의 음향이 발생하지 않은 구간의 잡음을 나타내는 s-noise가 -72.38dBm으로 도 8의 (a)보다 잡음을 감소 시킬 수 있다. 전자 장치의 잡음 제거 성능은 잡음 제거에 따른 출력의 변화 특성을 나타내는 SFR이 정상 범위(예: 상위 기준 값 및 하위 기준 값 사이)에 포함될 수 있다. 전자 장치의 잡음 제거에 따른 평균 평가점(MOS)은 3.72로 잡음 제거에 따른 음성 품질이 도 8의 (a)보다 향상시킬 수 있다. 도 8의 (d)를 참조하면, 전자 장치는 도 8의 (a)의 잡음 제거 변수에서 자동 이득 제어 레벨을 -60dB로 변경하 여 오디오 신호의 잡음(예: TDMA 잡음)을 제거할 수 있다. 예를 들어, 전자 장치는 도 8의 (a)와 동일하게 잡음 억제 레벨을 0dB로 설정하고, 고역 필터 값을 300Hz로 설정할 수 있다. 이 경우, 전자 장치의 잡음 제거 성능은 송신 음향 세기(SLR)가 5.84dB로 잡음 제거로 인해 송신 음향의 손실이 발생하지만 정상 범위(예: 8±3dB)에 포함될 수 있다. 전자 장치의 잡음 제거 성능은 호가 연결된 통화자들의 음향이 발생하지 않은 구간의 잡음을 나타내는 s-noise가 -76.37dBm으로 도 8의 (a)보다 잡음을 감소 시킬 수 있다. 전자 장치의 잡음 제거 성능은 잡음 제거에 따른 출력의 변화 특성을 나타내는 SFR이 정상 범위(예: 상위 기준 값 및 하위 기준 값 사이)에 포함될 수 있다. 전자 장치의 잡음 제거에 따른 평균 평가점(MOS)은 3.75로 잡음 제거에 따른 음성 품질이 도 8의 (a)보다 향상시킬 수 있다. 한 실시 예에 따르면, 전자 장치는 도 8의 (a) 내지 (d)의 잡음 제거에 따른 오디오 신호의 성능에 기반하여 약 전계의 잡음 제거 변수를 -60dB의 자동 이득 제어 레벨, 0dB의 잡음 억제 레벨 및 300Hz의 고역 필터 값으로 설 정할 수 있다. 본 발명의 다양한 실시 예에서, 전자 장치는 전계 강도에 대응하는 잡음 제어 변수를 이용하여 오디오 신호의 잡음을 제거할 수 있다. 이 경우, 전자 장치는 하기 도 9와 같은 잡음 제거에 따른 오디오 신호의 성능을 향상 시킬 수 있다. 도 9는 본 발명의 다양한 실시 예에 따른 전계 특성 변화에 기반한 잡음 제거에 따른 오디오 신호의 성능 변화 그래프를 도시하고 있다. 이하 설명은 백그라운드 잡음(background noise)가 15dB로 설정된 환경에서 잡음 제거 에 따른 성능 변화를 도시하고 있다. 도 9의 (a)를 참조하면, 전자 장치는 약전계의 경우, 약전계의 잡음 제거 변수에 따라 -65dB의 자동 이득 제어 레벨, 6dB의 잡음 억제 레벨 및 350Hz의 고역 필터 값에 기반하여 오디오 신호의 잡음(예: TDMA 잡음)을 제거할 수 있다. 이 경우, 전자 장치의 잡음 제거 성능은 송신 음향 세기(SLR)가 6.54dB로 잡음 제거로 인해 송신 음향의 손실이 발생하지만 정상 범위(예: 8±3dB)에 포함될 수 있다. 전자 장치의 잡음 제거 성능은 호가 연결된 통화자들의 음향이 발생하지 않은 구간의 잡음을 나타내는 s-noise가 -77.29dBm으로 잡음을 감소시킬 수 있다.전자 장치의 잡음 제거 성능은 SFR이 정상 범위(예: 상위 기준 값 및 하위 기준 값 사이)에 포 함될 수 있다. 전자 장치의 잡음 제거에 따른 평균 평가점(MOS)은 3.74로 잡음 제거에 따른 음성 품질이 평가될 수 있다. 도 9의 (b)를 참조하면, 전자 장치는 강전계의 경우, 강전계의 잡음 제거 변수에 따라 -70dB의 자동 이득 제어 레벨, 0dB의 잡음 억제 레벨 및 300Hz의 고역 필터 값에 기반하여 오디오 신호의 잡음(예: TDMA 잡음)을 제거할 수 있다. 이 경우, 전자 장치의 잡음 제거 성능은 송신 음향 세기(SLR)가 6.17dB로 잡음 제거로 인해 송신 음향의 손실이 발생하지만 정상 범위(예: 8±3dB)에 포함될 수 있다. 전자 장치의 잡음 제거 성능은 호가 연결된 통화자들의 음향이 발생하지 않은 구간의 잡음을 나타내는 s-noise가 -75.46dBm으로 잡음을 감소시킬 수 있다. 전자 장치의 잡음 제거 성능은 SFR이 정상 범위(예: 상위 기준 값 및 하위 기준 값 사이)에 포 함될 수 있다. 전자 장치의 잡음 제거에 따른 평균 평가점(MOS)은 3.95로 잡음 제거에 따른 음성 품질이 평가될 수 있다. 상술한 바와 같이 전자 장치는 약전계와 강전계에 대응하도록 잡음 제거 변수를 적응적으로 사용하여 오디오 신 호의 잡음을 제거하여 약전계와 강전계에서 통화를 위한 음성 품질을 향상시킬 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는 수신 신호 세기에 대응하는 다수 개의 구간들을 설정하고, 각 구간에 대응하는 잡음 제거 변수를 설정할 수 있다. 예를 들어, 전자 장치는 수신 신호 세기에 기반하여 전자 장치의 무선 환경을 3개의 구간들로 구분하고, 각 구간에 대응하는 잡음 제거 변수를 설정할 수 있다. 도 10을 참조하여, 다양한 실시예에서 네트워크 환경 내의 전자 장치를 도시하고 있다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이스를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생 략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(1020 내지 1070)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시 지 및/또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리전자 장치 (central processing unit(CPU)), 어플리케이션 프로세서 (application processor(AP)), 또는 커뮤니케이션 프로세서 (communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통 신에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 한 실시예에 따르면, 메모 리는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 예를 들어, 프로그램은 커널(kernal), 미들웨어(middleware), 어플리케이션 프로그래밍 인터페이스(API: application programming interface) 또는 어플리케이션 프로그램(또는 “어플리케이션”) 등을 포함할 수 있다. 커널 , 미들웨어, 또는 API의 적어도 일부는, 운영 시스템(operating system(OS))으로 지칭될 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기 로 출력할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등) 을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통 신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버 )와 통신할 수 있다. 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용할 수 있다. 또한, 무선 통신은, 예를 들면, 근거리 통신을 포 함할 수 있다. 근거리 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), 또는 GNSS(global navigation satellite system) 등 중 적어도 하나를 포함할 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS- 232(recommended standard-232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있 다. 네트워크는 통신 네트워크(telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치(1002, 1004) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 도 11은 다양한 실시예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 10에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP, 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스 플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리 , 인디케이터, 및 모터를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드 웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서 는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서는 도 11에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프 로세서 는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 10의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈(112 0)은, 예를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈 및 RF(radio frequency) 모듈를 포함 할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하 여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈 은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. 다른 실시예에 따르면, 셀룰러 모듈 , WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개 의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 전자 장치와 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지 된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(1140A), 자이로 센서(1140B), 기압 센서(1140C), 마그네틱 센서(1140D), 가속도 센서(1140E), 그립 센서(1140F), 근접 센서 (1140G), 컬러(color) 센서(1140H)(예: RGB(red, green, blue) 센서), 생체 센서(1140I), 온/습도 센서 (1140J), 조도 센서(1140K), 또는 UV(ultra violet) 센서(1140M) 중의 적어도 하나를 포함할 수 있다. 추가적 으로 또는 대체적으로(additionally or alternatively), 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서(electroencephalogram sensor), ECG 센서 (electrocardiogram sensor), IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈 은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은 제어 회로를 더 포함할 수도 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 또는 프로젝터를 포함할 수 있다. 패널은, 도 10의 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인터페이스는, 예를 들면, 도 10에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대 체적으로(additionally and alternatively), 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure digital) 카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈(118 0)의 적어도 일부 구성요소는, 예를 들면, 도 10 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또 는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시예에 따르면, 전력 관 리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리 는, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있 다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있 고, 진동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치 는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들 면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(mediaFloTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 구성요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 도 12는 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 한 실시예에 따르면, 프로그램 모듈(예: 프 로그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제(operating system(OS)) 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프로그램)을 포함할 수 있다.운영 체제는, 예를 들면, 안드로이드(android®), iOS®, 윈도우즈(windows®), 심비안(symbian®), 타이젠 (tizen®), 또는 바다(bada®) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface (API)), 및/또는 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자 장치(1002, 1004), 서버 등)로부터 다운로드(download) 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포 함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등 을 포함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter-process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능 들을 어플리케이션으로 제공할 수 있다. 한 실시예에 따르면, 미들웨어(예: 미들웨어)는 런 타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파 워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 전자 장치(예: 전자 장치)가 전화 기능을 포함한 경우, 미들웨어는 전자 장치 의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들 웨어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미 들웨어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제공될 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일, 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리 (health care)(예: 운동량 또는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 전자 장치 (1002, 1004)) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의상, \"정보 교환 어플리케이션\")을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 외부 전자 장치(예: 서버 또는 전자 장치(1002, 1004))로부터 수신된 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 프리로드 어플리케이션 (preloaded application) 또는 서버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시예에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프로세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이 상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로 세스 등을 포함할 수 있다.본 발명의 다양한 실시 예에 따르면, 전자 장치는, 상대 전자 장치와의 음성 통화 서비스를 제공하는 통신 모듈 과 적어도 하나의 잡음 제거 변수를 저장하는 메모리와 상기 통신 모듈을 통해 상기 상대 전자 장치와의 호를 설정한 경우, 상기 메모리에서 수신 신호 세기에 대응하는 잡음 제거 변수를 선택하고, 상기 수신 신호에 대응 하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하도록 제어하는 프로세서를 포함할 수 있다. 다양한 실시 예에서, 상기 메모리는, 전계 강도별로 잡음 제거 변수를 저장 할 수 있다. 다양한 실시 예에서, 상기 잡음 제거 변수는, 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨 및 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 상기 프로세서는, 상기 전자 장치의 송신 전력 레벨에 대응하는 전계 강도를 검출하고, 상 기 메모리에서 상기 전계 강도에 대응하는 잡음 제거 레벨을 선택하고, 상기 전계 강도에 대응하는 잡음 제거 레벨에 기반하여 오디오 신호의 잡음을 제거하는 프로세서를 포함할 수 있다. 다양한 실시 예에서, 상기 프로세서는, 상기 전자 장치의 수신 신호 품질에 대응하는 전계 강도를 검출하고, 상 기 메모리에서 상기 전계 강도에 대응하는 잡음 제거 레벨을 선택하고, 상기 전계 강도에 대응하는 잡음 제거 레벨에 기반하여 오디오 신호의 잡음을 제거하는 프로세서를 포함할 수 있다. 다양한 실시 예에서, 상기 수신 신호 품질은, 수신 신호 세기, 비트 에러율, 프레임 에러율, 신호대 잡음 비 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 상기 수신 신호에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하는 오 디오 처리 모듈을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 전자 장치는, 상대 전자 장치와의 음성 통화 서비스를 제공하는 통신 모듈 과 각각의 전계 강도에 대한 잡음 제거 변수를 저장하는 메모리와 상기 통신 모듈을 통해 상기 상대 전자 장치 와의 호를 설정한 경우, 상기 전자 장치의 전계 강도를 검출하고, 상기 전계 강도의 변경에 대한 응답으로 상기 전계 강도에 대응하도록 잡음 제거 변수를 변경하고, 상기 전계 강도에 대응하는 잡음 제거 변수에 기반하여 오 디오 신호의 잡음을 제거하도록 제어하는 프로세서를 포함할 수 있다. 다양한 실시 예에서, 상기 잡음 제거 변수는, 자동 이득 제어(AGC: automatic gain control) 레벨, 잡음 억제 레벨 및 고역 필터(HPF: high pass filter) 값 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 상기 프로세서는, 상기 전자 장치의 송신 전력 레벨 또는 수신 신호 품질에 기반하여 상기 전자 장치의 전계 강도를 검출 할 수 있다. 다양한 실시 예에서, 상기 수신 신호 품질은, 수신 신호 세기, 비트 에러율, 프레임 에러율, 신호대 잡음 비 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 상기 전계 강도에 대응하는 잡음 제거 변수에 기반하여 오디오 신호의 잡음을 제거하는 오 디오 처리 모듈을 더 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면,\"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 명령어가 프로세서(예: 프로세서(120, 1020 또는 1110))에 의해 실행될 경우, 하나 이상의 프 로세서가 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리 (130, 1030 또는 1130)가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digitalversatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장 치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 문서에 서 기재된 기술의 범위를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 문서의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 다양 한 실시 예의 범위를 한정하는 것은 아니다. 따라서, 본 발명의 다양한 실시 예의 범위는, 본 발명의 다양한 실 시 예의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0075280", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시 예에 따른 전자 장치의 블록도를 도시한다. 도 2는 본 발명의 다양한 실시 예에 따른 전자 장치에서 오디오 신호의 잡음을 제거하기 위한 흐름도를 도시한 다. 도 3은 본 발명의 다양한 실시 예에 따른 전자 장치에서 송신 출력 레벨에 기반하여 잡음 제거 변수를 설정하기 위한 흐름도를 도시한다. 도 4는 본 발명의 다양한 실시 예에 따른 전자 장치에서 수신 신호의 품질에 기반하여 잡음 제거 변수를 설정하 기 위한 흐름도를 도시한다. 도 5는 본 발명의 다양한 실시 예에 따른 전자 장치에서 전계 강도 변화에 기반하여 잡음 제거 변수를 변경하기 위한 흐름도를 도시한다. 도 6은 본 발명의 다양한 실시 예에 따른 전자 장치에서 전계 강도에 기반하여 잡음 제거를 선택적으로 수행하 기 위한 흐름도를 도시한다. 도 7은 본 발명의 다양한 실시 예에 따른 전자 장치에서 전계 강도에 기반하여 잡음 제거를 선택적으로 수행하 기 위한 흐름도를 도시한다. 도 8은 본 발명의 다양한 실시 예에 따른 약전계에서 잡음 제거에 따른 오디오 신호의 성능 변화 그래프를 도시 한다. 도 9는 본 발명의 다양한 실시 예에 따른 전계 특성 변화에 기반한 잡음 제거에 따른 오디오 신호의 성능 변화 그래프를 도시한다.도 10은 다양한 실시예에서의 네트워크 환경 내의 전자 장치를 도시한다. 도 11은 본 발명의 다양한 실시예에 따른 전자 장치의 블록도를 도시한다. 도 12는 본 발명의 다양한 실시예에 따른 프로그램 모듈의 블록도를 도시한다."}
