{"patent_id": "10-2019-0095167", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0016860", "출원번호": "10-2019-0095167", "발명의 명칭": "초음파 영상 기반의 기계 학습을 통한 관상동맥 병변 진단 시스템 및 이의 진단 방법", "출원인": "재단법인 아산사회복지재단", "발명자": "강수진"}}
{"patent_id": "10-2019-0095167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "관상동맥의 허혈 병변을 진단하는 딥러닝 기반 진단 방법에 있어서, 환자의 관상동맥 병변에 대한 IVUS 영상을 획득하는 영상 획득 단계;상기 IVUS 영상을 제1 인공지능 모델에 입력하여 혈관 내강이 분리된 마스크 영상을 획득하고, 마스크 영상에서IVUS 특징을 추출하는 특징 추출 단계; 및상기 IVUS 특징을 포함하는 정보를 제2 인공지능 모델에 입력하여 FFR 예측 값을 획득하고, 허혈 병변 여부를결정하는 허혈 병변 판단 단계;를 포함하는 딥러닝 기반 진단 방법."}
{"patent_id": "10-2019-0095167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 마스크 영상은 상기 관상동맥의 외막(adventitia), 내강(lumen) 및 플라크(plaque)에 대응하는 픽셀을 융합한 것을 특징으로 하는 진단 방법."}
{"patent_id": "10-2019-0095167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 IVUS 특징은 제1 특징 및 제2 특징을 포함하고,상기 특징 추출 단계는 상기 마스크 영상을 기초로 상기 제1 특징을 추출하고, 상기 제1 특징을 기초로 상기 제2 특징을 계산하여 획득하는 단계;를 더 포함하는 딥러닝 기반 진단 방법."}
{"patent_id": "10-2019-0095167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 IVUS 특징을 포함하는 정보는 임상적(clinical) 특징을 포함하고,상기 허혈 병변 판단 단계는 상기 IVUS 특징 및 상기 임상적(clinical) 특징을 제2 인공지능 모델에 입력하여FFR 예측 값을 획득 획득하고, 허혈 병변 여부를 결정하는 딥러닝 기반 진단 방법."}
{"patent_id": "10-2019-0095167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 허혈 병변 판단 단계는 상기 FFR 예측 값이 0.80 이하인 경우, 상기 병변을 허혈 병변으로 결정하는 딥러닝 기반 진단 방법."}
{"patent_id": "10-2019-0095167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,허혈 병변 진단 방법을 실행 시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2019-0095167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "관상동맥의 허혈 병변을 진단하는 진단 장치에 있어서, 환자의 관상동맥 병변에 대한 IVUS 영상을 획득하는 영상 획득부;상기 IVUS 영상을 제1 인공지능 모델에 입력하여 혈관 내강이 분리된 마스크 영상을 획득하고, 마스크 영상에서IVUS 특징을 추출하는 특징 추출부; 및공개특허 10-2021-0016860-3-상기 IVUS 특징을 포함하는 정보를 제2 인공지능 모델에 입력하여 FFR 예측 값을 획득하고, 허혈 병변 여부를결정하는 허혈 병변 판단부;를 포함하는 딥러닝 기반 진단 장치."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 관상동맥에 대한 초음파 영상을 기초로 기계 학습 알고리즘을 통해 분획 유량 예비력, 즉 FFR(fractional flow reserve)을 예측하고, 관상동맥 병변 여부를 진단하는 진단 시스템 및 이의 진단 방법에 관한 것이다. 본 발명의 관상동맥의 허혈 병변을 진단하는 진단 방법은 환자의 관상동맥 병변에 대한 IVUS 영상 을 획득하는 단계, IVUS 영상을 제1 인공지능 모델에 입력하여 혈관 내강이 분리된 마스크 영상을 획득하는 단계, 마스크 영상에서 IVUS 특징을 추출하는 단계, 및 IVUS 특징을 포함하는 정보를 제2 인공지능 모델에 입력 하여 FFR 예측 값을 획득하고, 허혈 병변 여부를 결정하는 단계를 포함한다."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "구체적으로, 본 발명은 관상동맥에 대한 초음파 영상을 기초로 기계 학습 알고리즘을 통해 분획 유량 예비력, 즉 FFR(fractional flow reserve)을 예측하고, 관상동맥 병변 여부를 진단하는 진단 시스템 및 이의 진단 방법 에 관한 것이다."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래에는 인간 수준의 지능을 구현하는 인공 지능 시스템이 다양한 분야에서 이용되고 있다. 인공 지능 시스템 은 기존의 룰(rule) 기반 스마트 시스템과 달리 기계가 스스로 학습하고 판단하며 똑똑해지는 시스템이다. 인공 지능 시스템은 사용할수록 인식률이 향상되고 사용자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 룰 기반 스마트 시스템은 점차 딥러닝 기반 인공 지능 시스템으로 대체되고 있다. 인공 지능 기술은 기계학습(예로, 딥 러닝) 및 기계학습을 활용한 요소 기술들로 구성된다. 한편, 관내 초음파(intravascular ultrasound, IVUS)는 관상동맥 병변의 형태학적 특성을 파악하고 동맥경화를 관찰하며 시술 스텐트 적정화를 달성하기 위한 임상검사법이다. 다만, 종래의 IVUS는 협착 병변에서 허혈 유무 를 알 수 없어 시술 필요성 여부를 결정할 수 없는 한계점을 가진다. 특히, 중등도 협착 병변의 허혈 평가를 위해서는 시술 중 분획 혈류 예비능(fractional flow reserve, FFR)을 중복 시행해야 한다. 즉, 관상동맥 협착 병변의 치료 결정을 위해 FFR을 통해 심근허혈 여부를 확인하는 것이 필수적이나, FFR 검사에 약 100만원의 비용이 들고 검사시간도 소요되며, 검사 중 아데노신이라는 약물투여에 따른 합병증의 우려가 있다는 문제점이 있어왔다. 이를 해결하기 위해 최근 아데노신을 사용하지 않고도 FFR을 80% 정확도로 진단할 수 있는 iFR(instantaneous wave-free ratio)에 관심이 집중되고 있으나, iFR 역시 고가의 혈류압력선을 소모하여야 하므로 비용 절감 효과 가 미미하다는 단점이 있다. 또한, 최근 심혈관 조영술을 이용한 QFR(quantitative flow ratio)의 경우, FFR을 80-85%의 정확도로 예측하는 것으로 알려져 있으나, 서로 다른 두 개의 영상을 정합하여 3D 복원을 해야만 결과 를 얻을 수 있다는 점에서 시간적 소모가 크며 적절한 영상을 확보하지 못하는 경우가 상대적으로 많다는 단점 이 있다. 가이드라인은 시술 전 FFR 검사를 통하여 허혈성 병변을 가려낼 것을 권유하고 있으나, 실제로는 비용과 시간으 로 인해 혈관 조영술이나 IVUS 상의 협착 형태만 보고 시술을 결정하는 경우가 전체 시술 케이스의 70% 이상에 달한다. 이로 인해 불필요한 스텐트 시술이 남용되고 있어, 이에 대한 해결책의 필요성이 대두된다."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 필요성에 따른 것으로, 혈관 내 초음파 영상을 기초로 기계학습 모델을 통해 FFR < 0.80을 예 측하고, 시술 중 분획 혈류 예비능의 시행 없이 허혈을 진단하는 시스템 및 방법을 제공하는 것을 목적으로 한 다. 그러나 이러한 과제는 예시적인 것으로, 이에 의해 본 발명의 범위가 한정되는 것은 아니다."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 관상동맥의 허혈 병변을 진단하는 진단 방법은 환자의 관상동맥 병변에 대한 IVUS 영상을 획득하는 단계; 상기 IVUS 영상을 제1 인공지능 모델에 입력하여 혈관 내강이 분리된 마스크 영상을 획 득하는 단계; 상기 마스크 영상에서 IVUS 특징을 추출하는 단계; 및 상기 IVUS 특징을 포함하는 정보를 제2 인 공지능 모델에 입력하여 FFR 예측 값을 획득하고, 허혈 병변 여부를 결정하는 단계;를 포함할 수 있다. 또한, 상기 마스크 영상은 상기 관상동맥의 외막(adventitia), 내강(lumen) 및 플라크(plaque)에 대응하는 픽셀 을 융합한 것을 특징으로 할 수 있다. 또한, 상기 IVUS 특징은 제1 특징 및 제2 특징을 포함하고, 상기 IVUS 특징을 추출하는 단계는 상기 마스크 영 상을 기초로 상기 제1 특징을 추출하고, 상기 제1 특징을 기초로 상기 제2 특징을 계산하여 획득하는 단계;를 더 포함할 수 있다. 또한, 상기 IVUS 특징을 포함하는 정보는 임상적(clinical) 특징을 포함하고, 상기 허혈 병변 여부를 결정하는 단계는 상기 IVUS 특징 및 상기 임상적(clinical) 특징을 제2 인공지능 모델에 입력하여 FFR 예측 값을 획득 획 득하고, 허혈 병변 여부를 결정할 수 있다. 또한, 상기 허혈 병변 여부를 결정하는 단계는 상기 FFR 예측 값이 0.80 이하인 경우, 상기 병변을 허혈 병변으 로 결정할 수 있다. 한편, 본 발명의 일 실시예에 따른 기록매체는 허혈 병변 진단 방법을 실행 시키기 위한 프로그램을 기록한 컴 퓨터로 읽을 수 있는 기록매체일 수 있다. 전술한 것 외의 다른 측면, 특징, 이점은 이하의"}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같이 이루어진 본 발명의 일 실시예에 따르면, 본 발명의 시스템은 81%에 달하는 높은 정확도로 허 혈을 예측할 수 있다. 또한, 본 발명에 따르면 FFR 압력철선을 사용하지 않고 IVUS만으로 혈역학적 허혈 상태를 진단할 수 있어 시간 과 비용을 절약할 수 있다. 또한, 본 발명에 따르면 인공지능을 이용하여 신속하고 정확히 FFR을 예측할 수 있고, 시술 중 허혈 진단을 통 한 치료 필요성 여부를 결정할 수 있다는 점에서 무분별한 스텐트 시술을 줄일 수 있다. 물론 이러한 효과에 의해 본 발명의 범위가 한정되는 것은 아니다."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": ", 청구범위 및 도면으로부 터 명확해질 것이다."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "발명의 효과 상기한 바와 같이 이루어진 본 발명의 일 실시예에 따르면, 본 발명의 시스템은 81%에 달하는 높은 정확도로 허 혈을 예측할 수 있다. 또한, 본 발명에 따르면 FFR 압력철선을 사용하지 않고 IVUS만으로 혈역학적 허혈 상태를 진단할 수 있어 시간 과 비용을 절약할 수 있다. 또한, 본 발명에 따르면 인공지능을 이용하여 신속하고 정확히 FFR을 예측할 수 있고, 시술 중 허혈 진단을 통 한 치료 필요성 여부를 결정할 수 있다는 점에서 무분별한 스텐트 시술을 줄일 수 있다. 물론 이러한 효과에 의해 본 발명의 범위가 한정되는 것은 아니다."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "도면의 간단한 설명 도 1은 본 발명의 일 실시예예 따른 허혈 병변 진단 시스템을 도시한 시스템도이다. 도 2는 본 발명의 일 실시예에 따른 허혈 병변 진단 장치의 구성요소를 설명하기 위한 간단한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 허혈 병변 진단 방법을 설명하기 위한 간단한 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 인공지능 모델을 학습시키기 위한 세트(set) 및 기준 특성(baseline characteristics)을 설명하기 위한 도면이다. 도 5a 및 도 5b는 본 발명의 일 실시예에 따른 혈관 내강 분리 영상을 획득하는 것을 설명하기 위한 도면이다. 도 6a 및 도 6b는 본 발명의 일 실시예에 따른 IVUS 특징을 설명하기 위한 도면이다. 도 7은 본 발명의 일 실시예에 따른 각 알고리즘 별 상위 20개의 중요 특성을 설명하기 위한 도면이다. 도 8a 및 도 8b는 본 발명의 일 실시예에 따른 학습 세트와 테스트 세트에 각각 5겹 교차 유효성 검증을 수행한 결과를 도시한다. 도 9는 200개의 부트스트랩 복제본의 성능과 95 % 신뢰 구간을 도시한다. 도 10은 다양한 ML 모델을 사용한 ROC 분석의 결과를 도시한 도면이다. 도 11은 FFR 값의 범위에 따른 각 알고리즘의 오 분류 빈도를 도시한 도면이다. 도 12는 본 발명의 다양한 실시예에 따른 학습부 및 인식부를 나타내는 블록도이다."}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "발명을 실시하기 위한 구체적인 내용 이하, 본 개시의 다양한 실시예가 첨부된 도면과 연관되어 기재된다. 본 개시의 다양한 실시예는 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있다. 그러나 이는 본 개시의 다양한 실시예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 개 시의 다양한 실시예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 개시의 다양한 실시예에서 사용될 수 있는 \"포함한다.\" 또는 \"포함할 수 있다.\" 등의 표현은 개시 (disclosure)된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 개시의 다양한 실시예에서, \"포함하다.\" 또는 \"가지다.\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것 이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존 재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 다양한 실시예에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 개시의 다양한 실시예에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 실시예들의 다 양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구 성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분하 기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 개시의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1 구성요소 는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소 가 상기 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 개시의 실시예에서 \"모듈\", \"유닛\", \"부(part)\" 등과 같은 용어는 적어도 하나의 기능이나 동작을 수행하는 구성요소를 지칭하기 위한 용어이며, 이러한 구성요소는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\", \"유닛\", \"부(part)\" 등은 각각이 개별적인 특정 한 하드웨어로 구현될 필요가 있는 경우를 제외하고는, 적어도 하나의 모듈이나 칩으로 일체화되어 적어도 하나 의 프로세서로 구현될 수 있다. 본 개시의 다양한 실시예에서 사용한 용어는 단지 특정일 실시예를 설명하기 위해 사용된 것으로, 본 개시의 다 양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현 을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시의 다양한 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 개시의 다양한 실시예에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하에서, 첨부된 도면을 이용하여 본 발명의 다양한 실시예들에 대하여 구체적으로 설명한다. 도 1은 본 발명의 일 실시예예 따른 허혈 병변 진단 시스템을 도시한 시스템도이다. 도 1을 참조하면, 본 발명의 허혈 병변 진단 시스템은 허혈 병변 진단 장치 및 서버를 포함할 수 있다. 허혈 병변 진단 장치는 환자의 관상동맥에 발생한 허혈 병변을 예측 및 진단하기 위한 장치이다. 허혈 병변인지 여부는 외관상 협착성 관상동맥인지 여부로 판단하는 것이 아닌, 기능적인 협착이 있는지 여부로 판단한다. 즉, 외관상 협착이 있다고 하여도 허혈 병변으로 판단되지 않을 수 있다. FFR은 협착이 없는 동일한 동맥의 최대 관상 동맥 혈류에 대비한 협착 질환이 있는 동맥의 최대 관상 동맥 혈류의 비율로 정의된다. 따라 서 기능적인 협착에 의한 허혈 병변인지 여부는 FFR을 통해 판단할 수 있다. 이에 따라, 허혈 병변 진단 장치는 관상동맥의 분획 혈류 예비능(FFR, fractional flow reserve)의 수치 를 예측함으로써, 허혈 병변인지 여부를 진단할 수 있다. 구체적으로 FFR이 0.80 인 경우, 협착성 관상 동맥이 정상 최대 흐름에 비해 80%를 공급하는 것을 나타내며, 허혈 병변 진단 장치는 FFR이 0.80 이하일 때 관상 동맥에 기능적인 협착 있는 허혈 병변으로 판단할 수 있다. 서버는 인공지능 모델을 학습 및 갱신하고, 인공지능 모델을 통한 예측을 수행하기 위한 적어도 하나의 외 부 서버이다. 본 발명의 일 실시예에 따른 서버는 IVUS 영상에 대한 혈관 경계 영상을 추출하기 위한 제1 인공지능 모델 및 혈관의 FFR을 예측하기 위한 제2 인공지능 모델을 포함할 수 있다. 이때, 제1 인공지능 모델은 IVUS 영상이 입력되면, 혈관 내강 분리 영상 또는 마스크 영상을 출력하는 모델일 수 있다. 또한, 제2 인공지능 모델은 혈관 및 환자에 대한 다양한 특징 정보가 입력되면, 관상동맥 병변에 대한 FFR 값이 0.80 이하로 허혈성 병변인지 여부를 판단할 수 있다. 이때, 특징 정보는 IVUS 영상 상의 형태학적 특 징, 계산적 특징 및 임상적 특징을 포함할 수 있으나, 이에 한정하지 않는다. 이에 대해 자세한 내용은 추후에 설명하기로 한다. 도 1에서는 허혈 병변 진단 장치와 서버가 별도의 구성으로 구현된 것을 도시하였으나, 본 발명의 일 실시예에 따르면 하나의 구성으로 구현된 것일 수 있다. 즉, 일 실시예에 따르면, 허혈 병변 진단 장치가 제1 인공지능 모델 및 제2 인공지능 모델을 직접 학습, 갱신하는 온 디바이스(on-device) AI 장치일 수 있다. 도 2는 본 발명의 일 실시예에 따른 허혈 병변 진단 장치의 구성요소를 설명하기 위한 간단한 블록도이다. 도 2를 참조하면, 허혈 병변 진단 장치는 영상 획득부, 영상 처리부, 메모리, 통신부 및 상술한 구성요소와 전기적으로 연결되어 제어하는 프로세서를 포함할 수 있다. 영상 획득부는 다양한 소스를 통해 IVUS 영상 데이터를 획득할 수 있다. 예로, 영상 획득부는 상용 스캐너로 구현되어 관상동맥 내를 스캐닝하여 IVUS 영상을 획득할 수 있다. 영상 획득부를 통해 획득된 영 상 데이터는 영상 처리부에서 처리될 수 있다. 영상 처리부는 영상 획득부를 통해 획득한 영상 데이터에 대한 처리를 수행할 수 있다. 영상 처리부 에서는 영상 데이터에 대한 디코딩, 스케일링, 노이즈 필터링, 프레임 레이트 변환 또는 해상도 변환 등과 같은 다양한 이미지 처리를 수행할 수 있다. 메모리는 프로세서의 처리 또는 제어를 위한 프로그램 등 허혈 병변 진단 장치 전반의 동작을 위한 다양한 데이터를 저장할 수 있다. 메모리는 허혈 병변 진단 장치에서 구동되는 다수의 응용 프 로그램(application program 또는 애플리케이션(application)), 허혈 병변 진단 장치의 동작을 위한 데이 터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 또한, 이러한 응용 프로그램 중 적어도 일부는, 허혈 병변 진단 장치의 기본적인 기능을 위하여 출고 당시 부터 허혈 병변 진단 장치 상에 존재할 수 있다. 응용 프로그램은, 메모리에 저장되고, 프로세서 에 의하여 허혈 병변 진단 장치의 동작(또는 기능)을 수행하도록 구동될 수 있다. 특히, 메모리(13 0)는 일 예로, 프로세서에 포함된 롬(ROM), 램(RAM) 등의 내부 메모리로 구현되거나, 프로세서와 별 도의 메모리로 구현될 수도 있다. 통신부는 다양한 유형의 통신방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성일 수 있다. 통 신부는 와이파이칩, 블루투스 칩, 무선 통신 칩, NFC 칩 중 적어도 하나를 포함할 수 있다. 프로세서(15 0)는 통신부를 이용하여 서버 또는 각종 외부 장치와 통신을 수행할 수 있다. 특히, 와이파이 칩이나 블루투스 칩을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송 수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 무선통신 칩은 IEEE, Zigbee, 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution) 등과 같은 다양 한 통신 규격에 따라 통신을 수행하는 칩을 의미한다. NFC 칩은 135kHz, 13.56MHz, 433MHz, 860~960MHz, 2.45GHz 등과 같은 다양한 RF-ID 주파수 대역들 중에서 13.56MHz 대역을 사용하는 NFC(Near Field Communication) 방식으로 동작하는 칩을 의미한다. 프로세서는 허혈 병변 진단 장치를 전반적으로 제어하기 위한 구성이다. 구체적으로, 프로세서 는 허혈 병변 진단 장치의 메모리에 저장된 각종 프로그램을 이용하여 허혈 병변 진단 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는 CPU, 램(RAM), 롬(ROM), 시스템 버스를 포함할 수 있다. 여기서, 롬은 시스템 부팅을 위한 명령어 세트가 저장되는 구성이고, CPU는 롬에 저장된 명령어에 따라 원격제어장치의 메모리에 저장된 운영체제를 램에 복사하고, O/S를 실행시켜 시스템을 부팅시킨다. 부팅이 완료되면, CPU는 메모리에 저장된 각종 애플리케이션을 램에 복사하고, 실행시켜 각종 동작을 수행할 수 있다. 이상에서는 프로세서가 하나의 CPU만을 포함하는 것으로 설명하였지만, 구현 시에는 복수의 CPU(또 는 DSP, SoC 등)으로 구현될 수 있다. 본 발명의 일 실시예에 따라, 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로프로세서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케 이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 상기 프로세서는 특징 추출부(미도시) 및 허혈 병변 판단부(미도시)를 포함할 수 있다. 특징 추출부는 영상획득부에 의해 획득한 환자의 관상동맥 병변에 대한 IVUS 영상을 제1 인공지능 모델에 입력 하여 혈관 내강이 분리된 마스크 영상을 획득하고, 마스크 영상에서 IVUS 특징을 추출할 수 있다. 허혈 병변 판 단부는 상기 IVUS 특징을 포함하는 정보를 제2 인공지능 모델에 입력하여 FFR 예측 값을 획득하고, 허혈 병변 여부를 결정할 수 있다. 본 발명의 일 실시예에 따른 상기 특징 추출부(미도시) 및 허혈 병변 판단부(미도시)는 메모리에 저장되어 프로세서에 의해 구동되는 별도의 소프트웨어 모듈을 통해 구현될 수 있다. 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 또한, 각각의 구성은 별도의 모듈로 구현될 수도 있고, 하나의 모듈로 구현된 것일 수도 있다. 한편, 상술한 바와 같이 본 발명의 또 다른 실시예에 따르면, 특징 추출부(미도시) 및 허혈 병변 판단부(미도시)는 서버에 포함된 프로세서(미도시)에 포함된 구성일 수 있음은 물론이다. 도 3은 본 발명의 일 실시예에 따른 허혈 병변 진단 방법을 설명하기 위한 간단한 흐름도이다. 본 발명의 허혈 병변 진단 시스템은 IVUS 영상을 획득할 수 있다(S310). 이때, IVUS 영상은 관상 동맥 질환 이 있는 환자로부터 허혈 병변의 길이에 따른 복수의 프레임(예를 들어, 2,000-4,000 개의 프레임)을 포함하는 영상일 수 있다. IVUS 영상은 니트로글리세린 0.2 mg을 관상동맥 내에 투여 후, 전동식 변환기 풀백 (0.5 mm /s) 및 3.2 F 이미 징 외장 내에서 회전하는 40MHz 변환기로 구성된 상용 스캐너를 사용하여 그레이 스케일 IVUS 이미징을 수행하 여 획득할 수 있다. 허혈 병변 진단 시스템은 제1 인공지능 모델을 이용하여 혈관 내강 경계가 분리된 마스크 영상을 획득할 수 있다(S320). 이때, 제1 인공지능 모델은 IVUS 영상을 입력하면, 혈관 내강 분리 영상을 출력하도록 학습된 머신러닝 모델일 수 있다. 이때, 제1 인공지능 모델은 혈관 0.2 mm 간격(약 12 프레임마다)마다 수동으로 윤곽이 설정된 혈관 내 강 분리 영상을 학습데이터로 학습된 것일 수 있다. 구체적으로, 혈관 내강 분리는 내강과 내막(intima)의 앞쪽 가장자리 사이의 인터페이스를 사용하여 수행된 것 일 수 있다. 혈관 내강 분리는 내중막(media)와 외막(adventitia) 사이의 경계에 있는 분리된 인터페이스는 외 부 탄성막(EEM, external elastic membrane)의 위치와 거의 일치하는 것을 이용하여 수행된 것일 수 있다. 허혈 병변 진단 시스템은 혈관 경계가 자동으로 분리된 마스크 영상에서부터 다양한 IVUS 특징을 추출할 수 있다(S330). 허별 병변 진단 시스템은 IVUS 특징을 포함하는 정보를 기초로 제2 인공지능 모델을 통해 FFR 예측 값을 획득하고, 허혈 병변 여부를 결정할 수 있다(S340). 이때 IVUS 특징은 IVUS 형태학적 특징 및 IVUS 계산적 특징을 포함할 수 있다. 구체적으로, 허별 병변 진단 시스템은 마스크 영상을 기초로 IVUS 형태학적 특징 또는 제1 특징을 추출하고, 형태학적 특징을 기초로 IVUS 계산적 특징 또는 제2 특징을 계산하여 획득할 수 있다. 한편, IVUS 특징을 포함하는 정보는 임상적(clinical) 특징을 포함할 수 있고, 상기 IVUS 특징 및 임상적 (clinical) 특징을 제2 인공지능 모델에 입력하여 FFR 예측 값을 획득 획득하고, 허혈 병변 여부를 결정할 수 있다. 특히, FFR 예측 값이 0.80 이하인 경우, 허별 병변 진단 시스템은 상기 병변을 허혈 병변으로 결정할 수 있다. 이때, 임상적(clinical) 특징은 나이(age), 성별(gender), 체면적(body surface area), 병변 분절(involved segment), 근위 LAD의 침범 여부(involvement of proximal left anterior descending artery (LAD)) 및 혈관 타입(vessel type)을 포함할 수 있다. 도 4는 본 발명의 일 실시예에 따른 인공지능 모델을 학습시키기 위한 학습 세트(training set), 테스트 세트 (test set) 및 기준 특성(baseline characteristics)을 설명하기 위한 도면이다. 2009년 11월부터 2015년 7월까지 침습성 관상 동맥 조영술을 시행한 1657명의 환자에 대해서 평가하였다. 이때, 환자들은 시술 전에 IVUS와 FFR을 통해 육안으로 40~80 %의 혈관 조영술 DS로 정의되는 중간 정도의 병변 환자 로 평가된 환자일 수 있다. IVUS와 FFR이 여러 병변에 대해 측정된 경우에는, 가장 낮은 FFR 값을 가진 원발성 관상 동맥 병변을 가진 환자가 선택되었다. 이 중에서 탠덤(tandem) 병변 77명, 표적 혈관 내 스텐트가 있는 95명, 측부 평가(side-branch evaluation)된 4명, 좌 주간부 관상 동맥 협착(left main coronary artery stenosis)이 있는 49명(혈관 조영술 DS> 30 %), IVUS가 불완전한 59명, 만성 총 폐색이 있는 12명, 상처 부위가 심한 심근 및 지역 벽 운동 이상이 있는 8명, 영상 파일에 기술적인 오류가 있는 9명 총 329명을 제외한 1328명의 좌 주간부 관상 동맥 협착이 아닌 환자가 본 회고 분석의 코호트로 선정되었다. 상술한 환자들은 4:1의 비율로 각각 학습 세트 및 테스트 세트에 할당되었다. 즉, 1063명의 임의의 환자 정보가 인공지능 모델의 학습에 사용되었고, 이와 겹치지 않는 265명의 임의의 환자 정보가 인공지능 모델의 성능을 평 가하는데 사용되었다. 기준 특성(baseline characteristic)은 환자 특성 및 병변 분절(involved segment) 특성을 포함할 수 있다. 이 때, 환자 특성은 나이(age), 성별(men), 흡연 여부(current smoker), 체면적(body surface area), 최대 충혈 시 FFR(FFR at maximal hyperemia) 등을 포함할 수 있다. 병변 분절(involved segment) 특성은 협착 병변이 발 생한 관상 동맥 부위일 수 있고, LAD(left anterior descending artery), LCX(left circumflex artery) 및 RCA(right coronary artery)을 포함할 수 있다. 도 4를 참조하면, 병변 분절의 67.1%(891명)는 LAD이고, 7.5%(100명)는 LCX이고, 25.4%(337명)는 RCA이다. 본 발명의 허혈 병변 진단 시스템은 학습 세트와 테스트 세트 간 표본 차이가 크지 않도록 하여 인공지능 모델을 학습 및 테스트할 수 있다. 한편, 학습 세트에서 FFR < 0.80은 여성보다 남성에서 더 빈번했다 (38.8 % 대 24.0 %, p <0.001). 또한, 나이 가 젊을수록 (60.2 ± 9.8 대 63.4 ± 9.4 세, p <0.001), 신체 표면적이 더 클수록(1.76 ± 0.16 vs. 1.71 ± 0.16 m2, p <0.001) FFR이 0.80 이하인 경우가 빈번했다. 병변 분절(involved segment)은 근위부 LAD의 39.5 %가 FFR이 0.80 이하였고 22.9%가 FFR> 0.80(p <0.001)이었 다. 또한 LAD의 44.4 %가 FFR < 0.80이고, RCA의 14.6 %, LCX의 15.8 %가 FFR < 0.80이었다. 도 5a 및 도 5b는 본 발명의 일 실시예에 따른 혈관 내강 분리 영상을 획득하는 것을 설명하기 위한 도면이다. 도 5a는 본 발명의 일 실시예에 따른 제1 인공지능 모델을 도시한 도면이다. 제1 인공지능 모델은 ImageNet 데이터베이스에서 기 학습된 FCN(fully convolutional network)을 사용하여 IVUS 영상에 포함된 프레임을 분해할 수 있다. 이후, 제1 인공지능 모델은 상이한 스케일의 컨볼루션 레이어의 계층적 특징을 결합한 FCN-VGG16 모델에 스킵 커넥션(skip connections)을 적용한다. 스킵 커넥션을 통해 8, 16 및 32 픽셀 스트라이드의 3 가지 예측을 결합함으로써 제1 인공지능 모델은 FCN-VGG16 모델을 통해 공간 정밀도 가 개선된 아웃풋을 출력할 수 있다. 한편, 제1 인공지능 모델은 전처리 단계로써 IVUS 영상을 256 × 256 크기로 리샘플링하여 RGB 컬러 포맷으로 변환할 수 있다. 중심 이미지 및 중심 이미지와 상이한 변위 값을 가지는 인근 이미지를 단일 RGB 이미지로 병 합할 수 있고, 3개의 변위 값으로 각각 0, 1 및 2 프레임으로 사용한다. 구체적으로, 단면 영상은 (i) EEM 외부의 픽셀을 포함하는 외막 (\"0\"으로 코딩 됨), (ii) 내강 경계 내의 픽셀 을 포함하는 내강 (\"1\"로 코딩 됨), 및 iii) 내강 경계와 EEM 사이의 픽셀을 포함하는 플라크(\"2\"로 코드화 됨)로 3 분할될 수 있다. 픽셀 치수를 보정하기 위해, 그리드 선이 IVUS 이미지에서 자동으로 획득될 수 있고, 셀 간격이 계산될 수 있다. 제1 인공지능 모델, 또는 FCN-all-at-once-VGG16 모델은 전처리된 이미지쌍(예로, 24 비트 RGB 컬러 이미지 및 8 비트 회색 마스크)을 사용하여 각 변위 설정에 대해 학습된 것일 수 있다. 상술한 바와 같이 제1 인공지능 모 델은 추출된 3개의 마스크를 융합하여 하나의 마스크 영상을 출력할 수 있다. 도 5b는 본 발명의 일 실시예에 따른 혈관 내강 분리 영상을 도시한다. 도 5b를 참조하면, 본 발명의 제1 인공지능 모델에 관상 동맥의 IVUS 영상(A)를 입력하면, 관상 동맥 내강 부분 과 외막이 분리된 혈관 내강 분리 영상(B) 또는 마스크 영상을 획득할 수 있다. 도 6a 및 도 6b는 본 발명의 일 실시예에 따른 IVUS 특징을 설명하기 위한 도면이다. 도 6a 및 도 6b를 참조하면, 본 발명의 인공지능 모델의 학습을 위한 IVUS 특징(IVUS feature)을 확인할 수 있 다. IVUS 특징은 IVUS 영상(또는 마스크 영상)을 통해 확인할 수 있는 형태학적 특징 및 형태학적 특징으로부터 계산된 특징일 수 있다. 도 6a는 IVUS 영상을 통해 추출할 수 있는 혈관에 대한 80개의 형태학적 특징(angiographic features) 또는 제 1 특징의 예시를 도시한다. 예를 들어, 도 6a를 참조하면, 본 발명의 허혈 병변 진단 시스템은 ROI에서의 병변 길이 특징(No.1), 병변에서의 플라크 버든(PB, plaque burden) 길이 특징(No.2) 등의 형태학적 특징을 추출할 수 있다. 도 6b는 혈관에 대한 19개의 계산된 특징(calculated features) 또는 제2 특징의 예시를 도시한다. 예를 들어, 도 6b를 참조하면 평균 기준 내강(averaged reference lumen) 특징(No.81)은, 근위 5mm 기준 평균 내강에 대한 형태학적 특징 (No.56)과 원위 5mm 기준 평균 내강에 대한 형태학적 특징(No.63)의 평균을 계산함으로써 획득할 수 있다. 즉, 평균 기준 내강 특징(No.81)은 아래와 같은 수학식 1을 통해 계산할 수 있다. 수학식 1"}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "또 다른 예로, 협착 영역 1 특징(No.83)은 평균 기준 내강 특징(No.81)과 MLA(minimal lumen area)를 통해 계 산할 수 있다. 즉, 협착 영역 1 특징(No.83)은 아래와 같은 수학식 2를 통해 계산할 수 있다. 수학식 2"}
{"patent_id": "10-2019-0095167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "MLA(minimal lumen area)은 최소 내강 영역(smallest lumen area) 및 플라크 버든(PB) > 40%을 나타내는 프레 임을 선택하여 정의될 수 있다. MLA 부위를 포함하는 병변은 플라크 버든(PB)이 40%보다 작은 연속적인 프레임 수가 25개 미만 (<5 mm)인 PB> 40%의 분절로 정의될 수 있다. 플라크 버든(PB, Plaque burden)은 (EEM 면적 - 내강 면적)을 EEM 면적으로 나눈 값의 퍼센트(%) 값으로 계산될 수 있다. ROI(region of interest)는 구개부(ostium)로부터 병변과 10 mm 떨어진 분절까지의 분절으로 정의될 수 있다. 근위 기준은 ROI의 시작과 병변의 근위 가장자리 사이의 분절이고, 원위 기준는 병변의 원위 가장자리와 ROI의 끝 사이의 분절로 정의될 수 있다. 근위 및 원위 5 mm 기준은 병변의 근위 또는 원위의 5 mm 부분 내를 의미할 수 있다. 최악 분절(worst segment)은 MLA 부위에서 2mm 근위 및 2mm 말단인 4mm 부분으로 정의될 수 있다. 한편, 본 발명의 일 실시예에 따른 진단 시스템은 상술한 99개의 IVUS 특징(80개의 형태학적 특징 및 19개 의 계산적 특징)과 6개의 임상적 특징(clinical feature)을 합한 총 105개의 특징을 제2 인공지능 모델의 기계 학습의 학습 데이터로 사용할 수 있다. 이때, 6개의 임상적 특징은 나이(age), 성별(gender), 체면적(bodysurface area), 병변 분절(involved segment), 근위 LAD의 침범 여부(involvement of proximal left anterior descending artery (LAD)) 및 혈관 타입(vessel type)을 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 진단 시스템은 IVUS 영상에 대한 105개의 특징과 IVUS 영상에 대응하는 환자(예를 들면, 도 4의 학습 세트)의 FFR 값을 학습 데이터로 제2 인공지능 모델을 학습시킬 수 있다. 이를 통 해 학습된 제2 인공지능 모델은 IVUS 영상에 대한 105개의 특징을 입력하면, FFR 값에 대한 예측 값을 출력할 수 있다. 환자의 FFR의 획득과 관련하여, \"Equalizing\"은 가이드 카테터 끝 부분에 위치한 가이드 와이어 센서로 수행되 었고, 0.014 인치 FFR 압력 가이드 와이어를 협착부의 말초로 전진시켰다. FFR은 아데노신의 정맥 주입에 의해 유도된 최대 충혈 상태에서 측정되었다. 즉, 혈역학적으로 협착의 검출을 향상시키기 위해, 중심 정맥을 통해서 140 μg / kg / min의 200 μg / kg / min으로 증가하였다. 고혈압 압박 기록을 시행한 후, 최대 충혈 상태에서 정상 관류 압력(대동맥압)에 대한 원위(distal) 관상 동맥압의 비로 FFR을 획득할 수 있다. 한편, 본 발명의 제2 인공지능 모델은 복수의 알고리즘을 통해 구현될 수 있다. 예를 들어, 제2 인공지능 모델 은 6개의 인공지능 알고리즘의 앙상블을 통해 구현될 수 있으나, 이에 한정하지 않는다. 본 발명의 일 실시예에 따른 제2 인공지능 모델의 6개의 인공지능 알고리즘은 FFR ≤ 0.80과 FFR > 0.80을 분리 하기 위한 이항 분류기(binary classifier)의 성능으로 평가될 수 있다. 이때, 6개의 알고리즘은 L2 penalized logistic regression, ANN(Artificial Neural Network), 랜덤 포레스트(random forest), AdaBoost, CatBoost 및 SVM(Support Vector Machine)일 수 있으나 이에 한정하지 않는다. 또한, 상술한 6개의 알고리즘은 부트스트 랩 방법을 사용하여 생성된 적어도 200개의 학습-테스트 랜덤 스플릿으로 독립적으로 학습될 수 있다. 각각의 알고리즘의 FFR 예측을 위한 특징 별 중요도는 상이할 수 있다. 도 7은 본 발명의 일 실시예에 따른 각 알고리즘 별 상위 20개의 중요 특성을 설명하기 위한 도면이다. 도 7을 참조하면, FFR < 0.80 인 병변을 예측하기 위한 가장 중요한 20 개의 특징이 각 알고리즘 별로 도시되어 있다. 이러한 분류를 위해, 학습 데이터의 모든 임상적 특징 및 IVUS 특징을 도 8a, 도 8b 및 도 8과 같이 5겹 교차 유효성 검증을 사용할 수 있다. 5겹 교차 유효성 검증은 학습 세트가 서로 겹쳐지지 않게 5개의 파티션으로 나누고, 하나의 파티션이 테스트 세 트가 되면, 나머지 4개의 파티션이 학습 세트가 되어 학습 데이터로 사용되는 것을 의미한다. 이때, 5개의 파티 션이 각각 한번씩 테스트 세트가 되도록 5번 테스트를 되풀이할 수 있다. 정확도(accuracy)는 5번의 테스트에 대한 정확도에 대한 평균으로 계산된다. 변동성을 줄이기 위해 여러 번 교차 유효성 검증을 수행하고 이를 평균 화할 수 있다. 도 8a 및 도 8b는 본 발명의 일 실시예에 따른 학습 세트와 테스트 세트에 각각 5겹 교차 유효성 검증을 수행한 결과를 도시한다. 도 8a 및 도 8b를 참조하면, L2 penalized logistic regression, ANN, 랜덤 포레스트 및 CatBoost 알고리즘에 서 FFR < 0.80을 예측하는 진단 정확도가 80 %(AUC: 0.85-0.86)를 상회하는 것을 확인할 수 있다. 가능한 확률값(0에서 1까지)의 전체 범위를 고려한 ROC(Receiver Operating Characteristic Curve)는 예측력이 없는 경우 0.5 값을 나타내고, 완전한 예측 및 분류를 수행하는 경우 1의 값을 나타낸다. 한편, 본 발명의 진단 시스템은 5겹 교차검증(5-fold cross-validation)을 여러 번 수행할 수 있다. 이후 각각 의 테스트에 대한 정확도를 평균화하여 5겹 교차검증의 정확도를 계산할 수 있다. 상술한 바와 같이, 비-바이어스된 성능 평가를 위해, 학습 세트를 통해 구축된 분류기는 중첩되지 않는 테스트 세트를 적용한다. 특히 부트 스트래핑(bootstrapping)을 통해, 본 발명의 각각의 알고리즘은 4:1 비율의 200개 의 학습-테스트 무작위 데이터 스플릿으로 독립적으로 학습될 수 있다. 200 개의 부트스트랩 복제본의 평균 퍼 포먼스 및 95 % 신뢰 구간은 각 학습-테스트 세트에 대한 평균±표준 편차로 표시될 수 있다. 도 9는 200개의 부트스트랩 복제본의 성능과 95 % 신뢰 구간을 도시하고, 도 10은 다양한 ML 모델을 사용한 ROC 분석의 결과를 도시한 도면이다. 도 9 및 도 10을 참조하면, SVM 알고리즘을 제외한 나머지 알고리즘은 모두 95%의 신뢰 구간에서 70 % 이상의 전체 정확도(overall accuracy)를 확인할 수 있다. 도 11은 FFR 값의 범위에 따른 각 알고리즘의 오 분류 빈도를 도시한 도면이다. 국소 FFR 값 (0.75-0.80)을 가진 28 개의 병변을 제외 시켰을 때, 테스트 세트의 전체 정확도는 AdaBoost의 경 우 86.5 %, CatBoost의 경우 84.8 %, ANN의 경우 82.3 %, 랜덤 포레스트의 경우 84.3 %, L2 penalized logistic regression의 경우 82.3 %, SVM은 70.0 %로 나타났다. 종합하면, 병변을 FFR ≤0.80 와 FFR > 0.80 인 환자로 분류하면, SVM을 제외한 나머지 알고리즘의 전체 정확도 (overall accuracy)는 약 80 %을 나타낸다. 즉, L2 penalized logistic regression, 랜덤 포레스트, AdaBoost 및 CatBoost 알고리즘을 사용하여 200 부트 스트랩 복제의 평균 정확도는 79-80 %으로, 평균 AUC(Area Under Curve)는 0.85-0.86이다. 이때, FFR 값이 0.75에서 0.80 사이인 경우, 잘못 분류하는 빈도가 높았다. FFR이 0.75-0.80인 28개의 병변을 제외하면, AdaBoost의 경우 87 %, CatBoost의 경우 85 %, ANN의 경우 82 %, 랜덤 포레스트의 경우 84 %, L2 penalized logistic regression의 경우 82%의 정확도를 나타냈다. 도 12는 본 발명의 다양한 실시예에 따른 학습부 및 인식부를 나타내는 블록도이다. 도 12를 참조하면, 프로세서는 학습부 및 인식부 중 적어도 하나를 포함할 수 있다. 도 12의 프로세서는 도 2의 허혈 병변 진단 장치의 프로세서 또는 서버의 프로세서(미도시)에 대 응될 수 있다. 학습부는 소정의 상황 판단을 위한 기준을 갖는 인식 모델을 생성 또는 학습시킬 수 있다. 학습부 는 수집된 학습 데이터를 이용하여 판단 기준을 갖는 인식 모델을 생성할 수 있다. 일 예로, 학습부는 다양한 IVUS 영상을 학습 데이터로서 이용하여 IVUS 영상에 포함된 혈관의 내강이 어 떤 것인지 판단하는 기준을 갖는 객체 인식 모델을 생성, 학습 또는 갱신시킬 수 있다. 또 다른 예로, 학습부는 다양한 IVUS 특징, 임상적 특징 및 FFR 값 정보를 학습 데이터로서 이용하여 입 력된 특징에 대한 FFR 값을 판단하는 기준을 갖는 모델을 생성, 학습 또는 갱신시킬 수 있다. 인식부는 소정의 데이터를 학습된 인식 모델의 입력 데이터로 사용하여, 목표하는 데이터를 추정할 수 있 다. 일 예로, 인식부 다양한 IVUS 영상을 학습된 인식 모델의 입력 데이터로 사용하여 영상에 포함된 혈관 내 강이 분리된 마스크 영상을 획득(또는, 추정, 추론)할 수 있다. 다른 예로, 인식부는 다양한 IVUS 특징, 임상적 특징을 학습된 인식 모델에 적용하여 FFR 값을 추정(또는, 결정, 추론)할 수 있다. 이때, FFR 값은 우선순위에 따라 복수 개가 획득될 수도 있다. 학습부의 적어도 일부 및 인식부의 적어도 일부는, 소프트웨어 모듈로 구현되거나 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 학습부 및 인식부 중 적어 도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제 작되어 전술한 각종 전자 장치 또는 객체 인식 장치에 탑재될 수도 있다. 이때, 인공 지능을 위한 전용 하드웨 어 칩은 확률 연산에 특화된 전용 프로세서로서, 기존의 범용 프로세서보다 병렬처리 성능이 높아 기계 학습과 같은 인공 지능 분야의 연산 작업을 빠르게 처리할 수 있다. 학습부 및 인식부가 소프트웨어 모듈(또는, 인스트럭션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non- transitory computer readable media)에 저장될 수 있다. 이 경우, 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 이 경우, 학습부 및 인식부는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 학습부 및 인식부 중 하나는 허혈 병변 진단 장치에 포함 되고, 나머지 하나는 서버에 포함될 수 있다. 또한, 학습부 및 인식부는 유선 또는 무선으로 통하여, 학습부가 구축한 모델 정보를 인식부로 제공할 수도 있고, 인식부로 입력된 데이터 가 추가 학습 데이터로서 학습부로 제공될 수도 있다.한편, 상술한 본 발명의 다양한 실시예들에 따른 방법들은, 기존 전자 장치에 설치 가능한 어플리케이션 형태로 구현될 수 있다. 한편, 본 발명의 일 실시예에 따르면, 이상에서 설명된 다양한 실시예들은 소프트웨어(software), 하드웨어 (hardware) 또는 이들의 조합을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록매체 (computer readable recording medium)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 일부 경우 에 있어 본 명세서에서 설명되는 실시예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 소프트 웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 기기로 읽을 수 있는 기록매체는, 비일시적 기록매체(non-transitory computer readable recording medium)의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다 는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 이때 비일시적 컴퓨터 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있 다. 이와 같이 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 당해 기술분 야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 다른 실시예가 가능하다는 점을 이해할 것 이다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 청구범위의 기술적 사상에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2019-0095167", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예예 따른 허혈 병변 진단 시스템을 도시한 시스템도이다. 도 2는 본 발명의 일 실시예에 따른 허혈 병변 진단 장치의 구성요소를 설명하기 위한 간단한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 허혈 병변 진단 방법을 설명하기 위한 간단한 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 인공지능 모델을 학습시키기 위한 세트(set) 및 기준 특성(baseline characteristics)을 설명하기 위한 도면이다. 도 5a 및 도 5b는 본 발명의 일 실시예에 따른 혈관 내강 분리 영상을 획득하는 것을 설명하기 위한 도면이다. 도 6a 및 도 6b는 본 발명의 일 실시예에 따른 IVUS 특징을 설명하기 위한 도면이다. 도 7은 본 발명의 일 실시예에 따른 각 알고리즘 별 상위 20개의 중요 특성을 설명하기 위한 도면이다. 도 8a 및 도 8b는 본 발명의 일 실시예에 따른 학습 세트와 테스트 세트에 각각 5겹 교차 유효성 검증을 수행한 결과를 도시한다. 도 9는 200개의 부트스트랩 복제본의 성능과 95 % 신뢰 구간을 도시한다. 도 10은 다양한 ML 모델을 사용한 ROC 분석의 결과를 도시한 도면이다. 도 11은 FFR 값의 범위에 따른 각 알고리즘의 오 분류 빈도를 도시한 도면이다. 도 12는 본 발명의 다양한 실시예에 따른 학습부 및 인식부를 나타내는 블록도이다."}
