{"patent_id": "10-2023-0007568", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0115089", "출원번호": "10-2023-0007568", "발명의 명칭": "디지털 휴먼 영상 생성 장치 및 그 장치의 구동방법", "출원인": "주식회사 씨앤에이아이", "발명자": "김보형"}}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가상 디지털 휴먼의 생성을 위한 디지털 휴먼 영상 생성 툴(tool)을 저장하는 저장부; 및 사용자 단말장치의 서비스 요청시 상기 저장한 툴을 실행하여 상기 디지털 휴먼의 생성을 위한 프로젝트 생성페이지 화면을 제공하며, 상기 제공한 프로젝트 생성 페이지 화면상에서 상기 사용자 단말장치의 사용자의 입력에 기초하여 인공지능(AI)의 추론에 의해 생성되는 사용자 맞춤형 디지털 휴먼이 포함된 영상을 생성하는 제어부;를포함하는 디지털 휴먼 영상 생성 장치."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 프로젝트 화면상에서 상기 사용자와의 인터페이스에 의해 설정되는 얼굴, 스타일, 동작 및음성을 상기 생성한 디지털 휴먼에 설정하는, 디지털 휴먼 영상 생성 장치."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어부는, 상기 사용자 단말장치와의 통신에 의해 상기 프로젝트 화면상에서 복수의 디지털 휴먼의 선택이가능하도록 동작하는, 디지털 휴먼 영상 생성 장치."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는, 상기 디지털 휴먼이 지정 단어나 지정 발음을 발화하도록 설정할 때 화면상에 스마트 단어장에서 작성하여 지정하는, 디지털 휴먼 영상 생성 장치."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는, 상기 스마트 단어장에서 작성되는 지정 단어나 지정 발음을 기생성한 다른 디지털 휴먼에도 적용하고자 할 때, 상기 지정 단어와 상기 지정 발음을 내 스마트 단어장에 추가시키는, 디지털 휴먼 영상 생성장치."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "저장부가, 가상 디지털 휴먼의 생성을 위한 디지털 휴먼 영상 생성 툴을 저장하는 단계; 및 제어부가, 사용자 단말장치의 서비스 요청시 상기 저장한 툴을 실행하여 상기 디지털 휴먼의 생성을 위한 프로젝트 생성 페이지 화면을 제공하며, 상기 제공한 프로젝트 생성 페이지 화면상에서 상기 사용자 단말장치의 사용자의 입력에 기초하여 인공지능(AI)의 추론에 의해 생성되는 사용자 맞춤형 디지털 휴먼이 포함된 영상을 생성하는 단계;를포함하는 디지털 휴먼 영상 생성 장치의 구동방법."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 사용자 맞춤형 디지털 휴먼이 포함된 영상을 생성하는 단계는, 공개특허 10-2024-0115089-3-상기 프로젝트 화면상에서 상기 사용자와의 인터페이스에 의해 설정되는 얼굴, 스타일, 동작 및 음성을 상기 생성한 디지털 휴먼에 설정하는, 디지털 휴먼 영상 생성 장치의 구동방법."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 사용자 단말장치와의 통신에 의해 상기 프로젝트 화면상에서 복수의 디지털 휴먼을 선택하는 단계;를 더포함하는, 디지털 휴먼 영상 생성 장치의 구동방법."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 제어부가, 상기 디지털 휴먼이 지정 단어나 지정 발음을 발화하도록 설정할 때 화면상에 스마트 단어장에서 작성하여 지정하는 단계;를 더 포함하는, 디지털 휴먼 영상 생성 장치의 구동방법."}
{"patent_id": "10-2023-0007568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 스마트 단어장에서 작성되는 지정 단어나 지정 발음을 기생성한 다른 디지털 휴먼에도 적용하고자 할 때,상기 지정 단어와 상기 지정 발음을 내 스마트 단어장에 추가시키는 단계;를 더 포함하는, 디지털 휴먼 영상 생성 장치의 구동방법."}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 디지털 휴먼 영상 생성 장치 및 그 장치의 구동방법에 관한 것으로서, 본 발명의 일 실시예에 따른 디 지털 휴먼 영상 생성 장치는, 가상 디지털 휴먼의 생성을 위한 디지털 휴먼 영상 생성 툴을 저장하는 저장부, 및 사용자 단말장치의 서비스 요청시 (기)저장한 툴을 실행하여 디지털 휴먼의 생성을 위한 프로젝트 생성 페이지 화면을 제공하며, 제공한 프로젝트 생성 페이지 화면상에서 사용자 단말장치의 사용자의 입력에 기초하여 인공지 능(AI)의 추론에 의해 생성되는 디지털 휴먼이 포함된 영상을 생성하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 디지털 휴먼 영상 생성 장치 및 그 장치의 구동방법에 관한 것으로서, 더 상세하게는 가령 디지털 휴 먼 영상 생성 툴(tool)을 활용하여 사용자가 인공지능에 대한 이해가 없어도 손쉽게 키보드 및 마우스 클릭으로 쉽고 간편하게 디지털 휴먼을 만들 수 있는, 디지털 휴먼 영상 생성 장치 및 그 장치의 구동방법에 관한 것이다."}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "버추얼 인플루언서가 엔터테인먼트 분야에서 활용되기 시작하면서 다양한 기업에서도 대고객 업무에 가상의 디 지털 휴먼을 활용하고자 하는 움직임을 보이고 있다. 또한 각 기업들은 대중들이 좋아하는 이미지의 가상 디지 털 휴먼을 생성하고자 하는 필요성을 느끼기 시작하며 연기, 춤, 노래 등 다양한 분야에서 활용이 가능하고, 늙 거나 자기 관리를 소홀히 하여 체형 및 피부가 달라지거나 사건, 사고를 만들지도 않기에 실존 인물과는 다른 장점들을 보유하고 있다. 물론 실존 인물이 아니다 보니 동시에 다양한 분야에서 여러가지 업무를 수행할 수 있 다는 장점 또한 있어 선호되고 있다. 그런데, 디지털 휴먼을 만들기에는 복잡한 기술이 들어가 있어, 일반인이 활용하기에 한계점이 많고, 제대로 활 용을 하지 못하는 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2022-0094008호(2022.07.05) (특허문헌 0002) 한국공개특허공보 제10-2022-0116756호(2022.08.23)"}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 가령 디지털 휴먼 영상 생성 툴을 활용하여 사용자가 인공지능에 대한 이해 가 없어도 손쉽게 키보드 및 마우스 클릭으로 쉽고 간편하게 디지털 휴먼을 만들 수 있는, 디지털 휴먼 영상 생 성 장치 및 그 장치의 구동방법을 제공함에 그 목적이 있다."}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 바의 과제를 해결하기 위하여, 본 발명의 일 실시예에 따른 디지털 휴먼 영상 생성 장치는, 가상 디지털 휴먼의 생성을 위한 디지털 휴먼 영상 생성 툴(tool)을 저장하는 저장부, 및 사용자 단말장치의 서비스 요청시 상기 저장한 툴을 실행하여 상기 디지털 휴먼의 생성을 위한 프로젝트 생성 페이지 화면을 제공하며, 상기 제공 한 프로젝트 생성 페이지 화면상에서 상기 사용자 단말장치의 사용자의 입력에 기초하여 인공지능(AI)의 추론에 의해 생성되는 디지털 휴먼이 포함된 영상을 생성하는 제어부를 포함한다. 상기 제어부는, 상기 프로젝트 화면상에서 상기 사용자와의 인터페이스에 의해 설정되는 얼굴, 스타일, 동작 및 음성을 상기 생성한 디지털 휴먼에 설정할 수 있다. 상기 제어부는, 상기 사용자 단말장치와의 통신에 의해 상기 프로젝트 화면상에서 복수의 디지털 휴먼의 선택이 가능할 수 있다. 상기 제어부는, 상기 디지털 휴먼이 지정 단어나 지정 발음을 발화하도록 설정할 때 화면상의 스마트 단어장에 서 작성하여 지정할 수 있다. 상기 제어부는, 상기 스마트 단어장에서 작성되는 지정 단어나 지정 발음을 기생성한 다른 디지털 휴먼에도 적 용하고자 할 때, 상기 지정 단어와 상기 지정 발음을 내 스마트 단어장에 추가시킬 수 있다. 상기 과제를 해결하기 위한 본 발명의 일 실시예에 따른 디지털 휴먼 영상 생성 장치의 구동방법은, 저장부가 가상 디지털 휴먼의 생성을 위한 디지털 휴먼 영상 생성 툴을 저장하는 단계, 및 제어부가, 사용자 단말장치의 서비스 요청시 상기 저장한 툴을 실행하여 상기 디지털 휴먼의 생성을 위한 프로젝트 생성 페이지 화면을 제공 하며, 상기 제공한 프로젝트 생성 페이지 화면상에서 상기 사용자 단말장치의 사용자의 입력에 기초하여 인공지 능(AI)의 추론에 의해 생성되는 사용자 맞춤형 디지털 휴먼이 포함된 영상을 생성하는 단계를 포함한다. 상기 사용자 맞춤형 디지털 휴먼이 포함된 영상을 생성하는 단계는, 상기 프로젝트 화면상에서 상기 사용자와의 인터페이스에 의해 설정되는 얼굴, 스타일, 동작 및 음성을 상기 생성한 디지털 휴먼에 설정할 수 있다. 상기 구동방법은, 상기 사용자 단말장치와의 통신에 의해 상기 프로젝트 화면상에서 복수의 디지털 휴먼을 선택 하는 단계를 더 포함할 수 있다. 상기 구동방법은, 상기 제어부가 상기 디지털 휴먼이 지정 단어나 지정 발음을 발화하도록 설정할 때 화면상의 스마트 단어장에서 작성하여 지정하는 단계를 더 포함할 수 있다. 상기 구동방법은, 상기 스마트 단어장에서 작성되는 지정 단어나 지정 발음을 기생성한 다른 디지털 휴먼에도 적용하고자 할 때, 상기 지정 단어와 상기 지정 발음을 내 스마트 단어장에 추가시키는 단계를 더 포함할 수 있 다. 기타 실시예의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 디지털 휴먼이 웹 환경에서 SAAS(Software as a Service) 구조상에 구축되어 동작 하는 방식 및 각 기능들을 활용한 디지털 휴먼의 생성을 개발자의 도움을 받지않고 수행할 수 있을 것이다. 또한, 본 발명의 실시예는 사용자의 편리성을 위해 제공되는 스마트 단어장, 동작 연결 모듈 그리고 가상의 디 지털 휴먼 생성 모듈을 통한 차별화된 기술 사용 및 디지털 휴먼 생성이 가능할 수 있을 것이다. 본 발명에 따른 효과는 이상에서 예시된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명세서 내에 포함되어 있다."}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 다양한 실시 예를 첨부된 도면을 참조하여 상세히 설명한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현"}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는 기술분야에서 통상의 지 식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정 의될 뿐이다. 본 발명의 실시예를 설명하기 위한 도면에 개시된 형상, 크기, 비율, 각도, 개수 등은 예시적인 것이므로 본 발 명이 도시된 사항에 한정되는 것은 아니다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 또한, 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐 릴 수 있다고 판단되는 경우 그 상세한 설명은 생략한다. 본 명세서 상에서 언급된 '포함한다', '갖는다', '이 루어진다' 등이 사용되는 경우 '~만'이 사용되지 않는 이상 다른 부분이 추가될 수 있다. 구성 요소를 단수로 표현한 경우에 특별히 명시적인 기재 사항이 없는 한 복수를 포함하는 경우를 포함한다. 구성 요소를 해석함에 있어서, 별도의 명시적 기재가 없더라도 오차 범위를 포함하는 것으로 해석한다. 위치 관계에 대한 설명일 경우, 예를 들어, '~상에', '~상부에', '~하부에', '~옆에' 등으로 두 부분의 위치 관 계가 설명되는 경우, '바로' 또는 '직접'이 사용되지 않는 이상 두 부분 사이에 하나 이상의 다른 부분이 위치 할 수도 있다. 소자 또는 층이 다른 소자 또는 층 \"위 (on)\"로 지칭되는 것은 다른 소자 바로 위에 또는 중간에 다른 층 또는 다른 소자를 개재한 경우를 모두 포함한다. 비록 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한 되지 않는다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라 서, 이하에서 언급되는 제1 구성요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 도면에서 나타난 각 구성의 크기 및 두께는 설명의 편의를 위해 도시된 것이며, 본 발명이 도시된 구성의 크기 및 두께에 반드시 한정되는 것은 아니다. 본 발명의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하며, 당업자 가 충분히 이해할 수 있듯이 기술적으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적 으로 실시 가능할 수도 있고 연관 관계로 함께 실시 가능할 수도 있다. 도 1은 본 발명의 실시예에 따른 디지털 휴먼 영상 생성 시스템을 나타내는 도면이고, 도 2는 도 1의 디지털 휴 먼 영상생성장치에서 제공하는 디지털 휴먼 서비스의 웹 페이지(혹은 서비스 화면) 개요를 설명하기 위한 도면 이며, 도 3은 디지털 휴먼 영상을 생성하는 프로젝트 화면의 예시도이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 디지털 휴먼 영상 생성 시스템은 사용자 단말장치 , 통신망 및 디지털 휴먼 영상생성장치의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 통신망과 같은 일부 구성요소가 생략되어 사용자 단말장치 와 디지털 휴먼 영상생성장치가 다이렉트 통신(예: P2P 등)을 수행하거나, 디지털 휴먼 영상생성장치 를 구성하는 구성요소의 일부 또는 전부가 통신망을 구성하는 네트워크장치(예: 무선교환장치 등)에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명하다. 사용자 단말장치는 프로그램 개발자가 아닌 일반 사용자 등의 서비스 사용자가 쉽고 간편하게 가상 인간의 디지털 휴먼을 만들 수 있도록 도 1의 디지털 휴먼 영상생성장치의 서비스를 이용하여 웹 또는 어플리케이 션(이하, 앱) 기반의 디지털 휴먼 서비스를 이용하기 위한 단말장치를 포함한다. 가령 웹에서 사용자 단말장치 의 사용자는 소개 페이지(혹은 메인 화면)에서 영업팀에게 문의하기 버튼을 눌러 디지털 휴먼 서비스를 문 의할 수도 있다. 또한, 사용자 단말장치의 사용자는 서비스 사용하기 버튼을 눌러, 직접 생성할 수 있는 페이지(예: 로그인 페이지)로 이동한다. 로그인 페이지에서 사용자는 회원 가입 및 만약 계정이 존재한다면, 로 그인을 진행 후, 프로젝트 관리 페이지로 이동하게 된다. 여기서, 프로젝트 관리 페이지는 템플릿 영 역, 프로젝트 영역 및 히스토리 영역 등을 나타낼 수 있다. 본 발명의 일 실시예에 따라 사용자가 기존 사용자인지 또는 신규 가입자인지 여부에 기초하여 프로젝트 영역, 히스토리 영역에 표시되는 구조는 다를 수 있다. 예를 들어, 사용자가 기존 사용자인 경우, 이미 생성 중인 프 로젝트 생성 페이지로 넘어갈 수 있는 프로젝트 썸네일 등이 상기 프로젝트 영역에 표시될 수 있고, 디지털 휴 먼 생성 이력이 상기 히스토리 영역에 표시될 수 있다. 반면에, 사용자가 신규 가입자인 경우, 프로젝트 영역 및 히스토리 영역에 프로젝트 생성을 제안하는 문구가 표시될 수 있다. 또한, 구독 요금을 구매 즉 결제한 사용자 단말장치의 사용자는 프로젝트 관리 페이지의 템플릿 영역 에서 사전 디자인된 배경을 선택한 뒤, 프로젝트 생성 페이지에서 디지털 휴먼을 만들거나, 가령 히스토리 페이 지(혹은 항목)에서 이미 만든 디지털 휴먼을 다운로드 받거나 링크를 부여받을 수 있다. 또한 사용자 단말장치 의 사용자는 각 영역의 더보기 버튼을 클릭하여 클릭한 항목에 해당하는 데이터(ex 이전 저장된 히스토리, 이전 저장된 프로젝트 등의 데이터)를 불러와 정렬 및 검색을 할 수 있는 페이지로 이동할 수 있다. 프로젝트 생성 페이지에서 프로젝트를 생성한 후 사용자는 디지털 휴먼을 본 발명의 실시예에서 정의해 놓은 모듈, 가령 음성 모듈, 가상 인물 생성 모듈, 동작 연결 모듈, 발화 영상 생성 모듈, 스마트 단어장 모듈을 활용하여 개발 자가 아니더라도 웹 페이지를 통해 쉽고 자유롭게 디지털 휴먼을 만들 수가 있다. 여기서, 모듈(module)은 소프 트웨어(S/W) 모듈이며, 모듈은 규모가 큰 것을 여러 개로 나눈 조각이라고 볼 수 있다. 즉 모듈은 소프트웨어 구조를 이루는 기본적인 단위가 되는 것이다. 다시 말해 하나 또는 몇 개의 논리적인 기능을 수행하기 위한 명 령어들의 집합이라고 말할 수 있다. 따라서 음성 모듈이나, 가상 인물 생성 모듈 등은 음성 프로그램이나 가상 인물 생성 프로그램 등으로 명명될 수 있다. 도 2는 도 1의 디지털 휴먼 영상생성장치에서 사용자 단말장치로 제공하는 서비스 화면의 개요를 보 여준다. 소개 페이지는 본 발명의 실시예에 따른 휴먼 서비스의 메인 화면이 될 수 있다. 사용자 단말장치(10 0)의 사용자는 로그인 페이지에서 로그인을 통해 프로젝트 관리 페이지에 진입할 수 있고, 디지털 휴먼을 생성 하기 위한 도 3에서와 같은 화면(프로젝트 생성 페이지)에 진입할 수 있다. 물론 도 3에서와 같은 화면에 진입 하기에 앞서 템플릿 영역, 프로젝트 영역 및 히스토리 영역 등을 포함하는 프로젝트 관리 페이지에 입장할 수 있다. 템플릿 영역에서는 복수 개의 사전 디자인된 배경(ex 스포츠, 교육 등 다양한 배경)을 나열하면서 사용자 로 하여금 적어도 하나 이상의 배경을 선택하도록 할 수 있고, 히스토리 영역은 이전에 디지털 휴먼을 생성한 이력이 있는 경우 해당 기록을 보여줄 수 있다. 프로젝트 영역은 기존에 만든 이력이 있을 경우 썸네일과 제목 그리고 생성일자를 포함한 간략한 디지털 휴먼이 포함된 영상 정보를 확인할 수 있으며, 해당 영역에서 더보기 버튼을 눌러 그동안 만들어 놓은 모든 프로젝트 리스트를 확인할 수 있으며, 특정 프로젝트의 항목을 선택하는 경우 도 3에서와 같은 화면에 진입할 수 있다. 사용자 단말장치의 사용자는 도 3에서와 같은 프로젝트 화 면에 방문하여 새로운 디지털 휴먼을 생성하거나, 또는 이미 만들어 놓은 디지털 휴먼을 수정하는 등의 동작을 수행할 수 있게 된다. 사용자 단말장치의 사용자는 도 3의 프로젝트 생성 페이지를 통해 디지털 휴먼을 생 성하는 과정에서 이외에도 다양한 유형의 서비스 화면을 마주할 수 있게 된다. 대표적으로 스마트 단어장을 생 성하고, 사용자가 원하는 가상 인물(사용자 맞춤형 디지털 휴먼)을 이미지 하나로 생성하고 동작을 자유자재로 편집하며, 음성을 추가하는 화면을 마주할 수 있다. 참고로, 상기 스마트 단어장은 프로젝트 생성 페이지에서 이용되며, 전술한 내 스마트 단어장은 프로젝트 관리 페이지에서 이용되는 것으로 서로 구분되는 단어장에 해당 할 것이다. 사용자 단말장치의 사용자는 도 1의 디지털 휴먼 영상생성장치에서 제공하는 웹 사이트에 접근하여 손쉽게 가상의 디지털 휴먼을 생성하고 동작을 선택하여 실제 사람과 유사한 인물을 언제 어디서든 자유롭게 생성할 수 있게 된다. 또한, 사용자는 웹 환경을 24시간 365일 가용 가능한 리소스를 보유한 디지털 휴먼 영상생 성장치 등의 서버에 구축하여 안정성을 확보하고, 구독 플랜에 따른 구매로 사용자에게 제공되는 디지털 휴먼 또는 직접 생성한 가상 디지털 휴먼을 기준으로 영상을 손쉽게 생성 및 관리할 수 있게 된다. 상기 구독플 랜은 금액에 따라 베이직(basic), 스탠다드(standard), 프리미엄(Premium) 등으로 구분될 수 있고, 최초 가입자 의 경우 Basic과 동일하게 사용 가능한 무료 평가판(Free Trial) 모델이 가입 후 30일간 제공되어 가상인물 생 성을 수행해볼 수 있도록 제공될 수 있다. 상기 서로 다른 종류의 구독플랜은 취급가능한 영상수, 프로젝트 수 등에 있어서 차이가 있을 수 있다. 한편 사용자 단말장치는 데스크탑컴퓨터, 랩탑컴퓨터 등 PC 기반의 단말장치를 포함하며, 또 스마트폰이나 태블릿PC, 나아가 사용자들이 손목에 착용하는 웨어러블장치 등 모바일 기반의 단말장치를 포함할 수 있다. 물 론, 스마트 TV와 같은 영상표시장치를 포함할 수도 있다. 본 발명의 실시예에 따른 서비스를 이용할 수 있다면 다양한 유형의 장치가 가능하므로 어느 하나의 유형에 특별히 한정하지는 않을 것이다. 통신망은 유무선 통신망을 모두 포함한다. 가령 통신망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망(PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망은 이에 한정되는 것이 아니며, 향후 구현될 차세대 이동 통신 시스템의 접속망으로서 가령 클라우드 컴퓨팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가 령, 통신망이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데이터를 처리하거나, BTS(Base Transceiver Station), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수도 있다. 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피코(pico) 기지국과 같은 소형 기지국을 포함한다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분류상 사 용자 단말장치 등을 최대 몇 대까지 접속할 수 있느냐에 따라 구분된다. 물론 액세스포인트는 사용자 단말 장치 등과 지그비 및 와이파이(Wi-Fi) 등의 근거리 통신을 수행하기 위한 근거리 통신 모듈을 포함할 수 있다. 액세스포인트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근거리 통신은 와이파이 이외에 블루투스, 지그비, 적외선(IrDA), UHF(Ultra High Frequency) 및 VHF(Very High Frequency)와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스포인트는 데이터 패킷의 위치를 추출하고, 추출된 위치에 대한 최상의 통신 경로를 지정하며, 지정된 통신 경로를 따라 데이터 패킷을 다음 장치, 예컨대 디지털 휴먼 영상생성장치로 전달할 수 있다. 액세스포인트는 일반적인 네트워크 환경에서 여러 회선을 공유할 수 있으며, 예컨대 라우터(router), 리피터(repeater) 및 중계기 등이 포함된다. 디지털 휴먼 영상생성장치는 도 1의 사용자 단말장치에서 서비스 요청시 사용자가 쉽고 간편하게 디 지털 휴먼을 만들 수 있는 웹 또는 앱 기반의 디지털 휴먼 서비스를 제공한다. 디지털 휴먼 영상생성장치 는 사용자 단말장치의 사용자가 도 3에서와 같은 화면에서 디지털 휴먼을 쉽게 생성하고, 이에 따라 디지 털 휴먼 영상생성장치는 음성 생성, 가상의 디지털 휴먼 생성, 발화 영상 생성, 배경 렌더링, 동작 연결 등 다양한 모듈과 주요 하드웨어를 활용하여 가상의 디지털 휴먼 영상을 웹페이지 상에서 자유롭게 생성할 수 있도록 동작하게 된다. 다시 말해, 사용자가 프로젝트 생성 페이지 화면상에서 생성하고자 하는 얼굴 이미지를 선택하여 업로드하고, 발화하고자 하는 스크립트를 작성하여 음성 및 수행하고자 하는 디지털 휴먼의 동작 등을 결정해 주면 해당 데이터가 디지털 휴먼 즉 프로그램에 결합 또는 자동 설정되어 사용자들이 원하는 사용자 맞 춤형 디지털 휴먼을 제작할 수 있고, 그를 포함하는 영상 역시 쉽게 제작되는 것이다. 즉, 사용자가 원하는 가 상 인물(사용자 맞춤형 디지털 휴먼)을 이미지 하나로 생성하고 동작을 자유자재로 편집하며, 음성을 추가함으 로써 상기 영상을 생성할 수 있다. 좀더 구체적으로 디지털 휴먼 영상생성장치는 서비스를 직관적으로 보여줄 수 있는 랜딩 페이지를 소개페 이지로 적용하여 디지털 휴먼 영상 제작 방법을 소개로 담은 영상, 생성한 디지털 휴먼의 적용 사례, 이용 가이드, 요금제, 그리고 제휴사 로고를 통해 다양한 기업들에서 서비스를 사용하며 손쉽게 인공지능 휴먼(AI Human)을 생성할 수 있는 서비스임을 강조한다. 또한 소개 페이지에서 제공되는 두 가지 액션(Action) 버 튼은 영업팀에 대한 문의와 서비스 사용하기 버튼이 제공되어 사용자가 손쉽게 서비스 문의 및 서비스 사용을 진행 가능하도록 한다. 영업팀에 대한 문의는 AI 챗봇을 통해 답변을 받는 것도 얼마든지 가능하므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 예를 들어, 사용자가 AI 챗봇을 통해 답변을받는 과정에서 영업팀을 호출하는 경우에는 영업팀을 전화나 메신저 기반의 채팅으로 연결해 주는 형태로 동작 할 수도 있다. 또한, 디지털 휴먼 영상생성장치는 사용자 단말장치로 로그인 페이지를 제공하면서, 서비스 사 용하기 버튼 클릭시 실제로 사용자가 AI 휴먼(Human)을 생성할 수 있는 CNAI 스튜디오 내부 페이지로 이동하게 되며, 로그인 페이지로 이동한 후 회원가입, 로그인 또는 비밀번호 찾기가 가능하도록 동작한다. 회원가입 의 경우 이메일 주소, 비밀번호, 비밀번호 확인을 입력한 후 이용 약관에 동의하기를 선택하면 가입이 완료되며, 가입을 완료한 후 입력한 이메일 주소로 이메일 인증을 진행하게 된다. 이메일 인증이 완료되면 서비 스 사용을 할 수 있는 프로젝트 관리 페이지로 이동시킨다. 즉 프로젝트 관리 페이지를 사용자 단말 장치로 제공한다. 프로젝트 관리 페이지에서는 사용자가 본인의 이메일 확인, 비밀번호 변경, 구독한 요금제를 확인 및 업그레이드하는 기능으로 활용 가능하며, 로그아웃 진행 또한 가능하다. 참고로, 상기 프로젝"}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "트 관리 페이지는 Summary(요약) 페이지라고 지칭될 수도 있다. 도 2 및 도 3에서 볼 수 있는 바와 같이, 본 발명의 실시예에 따른 프로젝트 관리 페이지는 회원가입을 마 치고 로그인을 한 사용자에 한하여 서비스를 사용할 수 있도록 기능이 제공될 수 있다. 사용자는 추가적으로 월 간 또는 연간 구독 모델을 사전에 구매하여 서비스 사용을 진행해야 하며, 구독을 완료한 사용자만 해당 페이지 에서 제공되는 서비스인 프로젝트 생성 기능 사용이 가능하다. 디지털 휴먼 영상생성장치는 프로젝트 관리 페이지를 통한 기능은 크게 프로젝트 생성, 기존 프로젝트 관리, 히스토리 조회, 내 스마트 단어장 및 템 플릿 선택 등으로 구분될 수 있다. 즉, 프로젝트 관리 페이지는 템플릿, 프로젝트, 히스토리, 내 스마트 단어장 등으로 구성될 수 있고, 프로 젝트 관리 페이지에서는 템플릿 선택, 프로젝트 생성, 영상의 히스토리 관리에 대한 기능을 시각적으로 확 인할 수 있을 뿐만 아니라, 더 보기 기능이 존재하여 각 버튼의 더 보기 기능 클릭시 해당 영역의 상세 조회가 가능하다. 또한, 내 스마트 단어장의 경우 각 프로젝트 등에서 지정된 특정 단어(또는 문장)들을 통합적으로 관 리하기 위한 목적으로, 이미 지정된 단어 또는 문장을 확인하거나, 새로운 단어 또는 문장을 추가할 수도 있다. 즉, 상기 프로젝트 관리 페이지에서는 상기 내 스마트 단어장 관리를 수행할 수 있는 것이다. 프로젝트 관리 페이지에서 제공하는 히스토리 조회(히스토리 영역)는 사용자가 영상을 생성한 이후 손쉽게 영상을 다시 다운로드하거나 다운로드 링크를 발급받을 수 있으며, 각 프로젝트 생성 이력을 확인할 수 있도록"}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "요약 기능을 제공한다. 히스토리 조회에서는 프로젝트별 영상이 잘 생성되었는지 또는 처리중인지 실패했는지 확인이 가능하다. 따라서 사용자가 확인 가능한 상태 메시지는 총 3개로 처리중/실패/완료이다. 템플릿 기능은 파워포인트 문서 작성 기능과 유사한 형태로, 미리 디자인된 전문적인 형태의 틀을 불러오는 기 능으로 활용 가능하다. 제공되는 기본적인 템플릿으로는 단색배경, 발표 템플릿, 뉴스 인트로 템플릿, 뉴스 진 행영상 템플릿이 있으며, 사용자는 특정 템플릿을 선택시 프로젝트 생성 페이지로 이동하여 선택 템플릿이 제공 된다. 도 3은 프로젝트 생성 페이지를 보여준다. 디지털 휴먼 영상생성장치에서 제공하는 프로젝트 관리 페이지의 프로젝트 영역에서의 더보기 버튼 클릭시, 사용자가 현재까지 생성한 프로젝트를 확인하고 선택할 수 있는 페이지로 이동된다. 물론 더보기 버튼 은 전체, more 등 버튼의 명칭은 다양할 수 있다. 전체 프로젝트를 확인 가능한 페이지로 이동하면 최근 생성한 프로젝트를 기준으로 사용자가 확인할 수 있다. 각 프로젝트는 해당하는 씬(scene) 즉 장면의 프로젝트의 썸네 일 이미지가 프로젝트명과 생성된 일시가 함께 표시되어 사용자가 직관적으로 구분할 수 있으며, 프로젝트명을 기준으로 검색 기능 사용이 가능하여 특정 단어 검색시 그 단어를 포함한 모든 프로젝트를 정렬하여 검색결과를 제공할 수 있다. 부가적으로 프로젝트 관리를 위한 폴더 생성 및 구분 기능이 제공되어 디지털 휴먼 생성 프로 젝트를 사용자가 원하는 폴더로 이동시켜 관리가 가능하며, 이동하고자 하는 프로젝트를 클릭하면 페이지 우측 상단의 파일 이동 버튼을 통해 프로젝트를 폴더별로 이동하여 관리하거나 삭제 버튼을 통해 불필요한 프로젝트 에 대한 삭제 등의 관리가 가능할 수 있다. 프로젝트 관리 페이지의 히스토리 영역의 더보기(또는 전체, more 등) 버튼 클릭시, 히스토리 조회 페이지 로 이동하게 되며, 사용자가 프로젝트를 통해 생성한 결과물에 대해 시각적으로 제공한다. 페이지당 20개의 히 스토리를 테이블에 최근 영상 생성 시간을 기준으로 하여 정보들이 제공되는데, 이때 프로젝트명, 프로젝트가 위치한 폴더명, 영상 생성 상태(예: 완료, 처리중, 실패), 생성 날짜, 다운로드 그리고 다운로드 가능한 영상 링크가 제공된다. 다운로드 기능은 영상 생성 상태가 완료일 경우에 한해 활성화되어 필요시 다운로드 및 링크 복사가 가능하고, 영상 생성 상태가 처리중 혹은 실패인 상태에서는 사용을 제한한다.또한, 본 발명의 실시예에 따른 디지털 휴먼 영상생성장치는 프로젝트 생성 페이지(신규 또는 기존)를 통 해 사용자 맞춤형 디지털 휴먼을 생성하는 동작을 수행할 수 있고, 상기 사용자 맞춤형 디지털 휴먼을 포함하는 영상을 생성할 수 있다. 참고로, 상기 영상은 기선택된 배경 및 상기 사용자 맞춤형 디지털 휴먼을 포함할 수 있다. 여기서, 상기 사용자 맞춤형 디지털 휴먼을 생성하는 동작은 음성, 가상인물 생성, 동작 연결, 발화 영상 생성 등의 동작을 포함할 수 있다. 프로젝트 생성 페이지에서는 AI 휴먼 영상 제작을 위한 다양한 인공지능 기반의 모듈(또는 프로그램) 및 기능이 집약되어 있는 페이지로, 크게 음성 생성 모듈, 가상인물 생성 모듈, 발화 영상 생성 모듈, 동작 연결 모듈로 구성되어 있으며 사용자가 버튼을 클릭하고 키보드를 활용하여 손쉽게 모듈을 활 성화하여 최종적으로 사용자 맞춤형 디지털 휴먼이 포함된 영상을 생성할 수 있다. 음성 생성 모듈에서는 사용자가 입력한 스크립트를 기반으로 음성 생성 엔진을 실행시켜 특정 국가 및 성별의 음성을 생성하게 되며, 한국어를 포함한 기타 언어(ex 영어, 일본어 등)를 선택하거나, 무음을 특정 위치에 삽 입하는 기능을 추가하거나, 음성의 크기(예: 작게, 크게, 보통)를 조절하는 등 사용자의 기호에 맞게 각 기능을 선택 및 적용할 수 있다. 성별 또한 선택한 모델에 따라 자동 적용될 수 있다. 예를 들어 남성 모델을 선택하면 사전 등록된 남성의 음성을 기반으로 엔진이 음성을 생성할 수 있다. 즉, 여자 캐릭터의 경우 여자 목소리, 남 자 캐릭터의 경우 남자 목소리가 생성된다. 본 발명의 일 실시예에 따라, 남자 캐릭터의 경우 복수 개의 남성의 음성(ex 허스키한 목소리, 20대 젊은 남성의 목소리 등) 중에서 사용자 선택에 의해 어느 하나가 결정되고, 여 성 캐릭터의 경우 복수 개의 여성의 음성(ex 하이톤 목소리, 20대 젊은 여성의 목소리 등) 중에서 사용자 선택 에 의해 어느 하나가 결정될 수도 있다. 컴퓨터 분야에서 엔진은 핵심적이고 본질적인 기능을 수행하는 프로그램을 지칭한다. 한 가지 목적을 위해 공동 작용을 하는 일련의 프로그램들에 대해 전반적인 운영을 조정하거나 응용프로그램 내에서 중심적인 기능을 하고 있는 프로그램이다. 모든 선택이 완료되었다면, 음성 생성 버튼을 통해 음성을 생성하도록 리소스(resource)를 보유한 서버 즉 디지털 휴먼 영상생성장치에 요청을 보내며, 음성 길이에 비례하여 생성된 음성은 사용자 가 확인할 수 있도록 재생할 수 있다. 가상인물 생성 모듈에서는 사용자가 특별 구독료를 지불할 경우 사용할 수 있는 권한을 부여받게 되며, 이를 통해 원하는 가상인물을 생성할 수 있다. 가상인물 생성시 얼굴이 포함된 이미지 파일 한 장만으로도 가상인물 생성이 가능하며 필요시 여러 얼굴을 합성하여 가상인물 생성이 가능할 수 있다. 생성된 가상인물은 별도의 등 록 과정을 거쳐 발화 영상 생성을 위해 활용이 가능하다. 다음은 동작 연결 모듈의 동작이다. 디지털 휴먼 영상 생성하기 전 가상인물 모델을 선택하게 되는데, 이는 가 상인물 생성 모듈에서 사용자가 생성한 가상인물 또는 웹 솔루션에 제공되는 인물 중 한 명에 대해 선택할 수 있다. 선택된 모델에 따라 얼굴과 의상 스타일을 추가적으로 선택할 수 있으며, 선택을 진행하지 않을 경우 기 본으로 설정된 값에 따라 인물의 의상 스타일이 선택된다. 가상인물 모델을 선택하지 않을 경우, 기본적인 모델 이 선택되어 보여지게 되며 얼굴 및 의상 스타일 또한 기본으로 선택된다. 모델 선택 및 얼굴 그리고 의상 선정 이 완료되면 해당 인물에 적용된 동작을 선택할 수 있다. 기본적으로 제공되는 동작으로는 정자세, 좌로 손을 뻗는 자세, 우로 손을 뻗는 자세, 그리고 양손을 뻗는 자세가 있으며, 가상인물에 따라 추가적인 동작이 존재하 기도 한다. 이러한 동작들은 스크립트 내 특정 단어의 발화 시점에서 동작을 삽입하여 가상인물이 동작을 수행 하도록 동작 연결 엔진에 요청할 수 있다. 예를 들어, 음성 생성을 위해 \"안녕하세요, 씨앤에이아이의 가상인물 을 소개합니다.\"를 작성하였고, 안녕하세요 이후에 손을 흔들게 만들고 싶을 경우 안녕하세요 뒤에 손을 흔드는 동작을 선택 및 스크립트 내 삽입하고 발화 영상 생성 모듈을 활성화하는 영상 생성 버튼을 클릭하면 가상의 디 지털 휴먼이 특정 시점에 동작을 수행하는 영상으로 변환되어 생성된다. 발화 영상 생성 모듈을 통해서는 기본적으로 제공되는 가상인물 모델 또는 가상인물 생성 모듈에서 사용자가 생 성한 가상인물의 선택 및 음성 모듈에서 사용자가 입력한 스크립트의 작성을 완료한 후 영상 생성 버튼을 클릭 시 발화 영상 생성 모듈이 활성화되어 가상인물이 스크립트를 읽어주고 동작을 수행하는 디지털 휴먼이 포함된 영상이 생성된다. 영상 미리보기는, 스트리밍 기술을 활용하여 웹 환경에서 생성하고자 하는 가상의 인물이 발화하는 장면을 볼 수 있도록 사용자의 편의성을 고려하여 기능이 제공된다. 이외에도 본 발명의 실시예에 따른 디지털 휴먼 영상생성장치는 스마트 단어장 기능과 내 스마트 단어장 관리 기능을 도 1의 사용자 단말장치로 제공하며, 생성 페이지에서 스마트 단어장 버튼을 눌러 기능 사용이 가능하다. 각 프로젝트 생성 페이지별 독특한 단어 또는 발음, 발음을 잘하지 못하는 단어 또는 특정 기본 단위 등과 같은 발음 방법을 같이 추가하여 특정 단어에 대해 발음을 보다 쉽게 할 수 있도록 한다. 스마트 단 어장에 작성된 단어(ex 韓國, ㄱㄱ, ㅋㅋ)는 스크립트 내 입력되었을 때 발화하고자 하는 방식으로 변경되어 음 성(ex 한국, 고고, 크크)이 생성된다. 프로젝트별로 관리가 되는 스마트 단어장 내 단어를 내 스마트 단어장에 추가하여 전체 프로젝트에 대해서도 발화 방식이 변경되어 적용되기를 원할 경우, 하단의 적용 버튼(내 스마트 단어장 버튼)을 클릭하여 스마트 단어장에 등록된 데이터가 내 스마트 단어장(프로젝트 관리 페이지 상)에 추가 되어 전체 관리가 가능하게 된다. 스마트 단어장에 등록된 단어 및 발음을 삭제하고 싶은 경우, 삭제하고자 하 는 열을 선택한 후 '―' 버튼(버튼의 형태는 다양할 수 있음)을 클릭하여 제외가 가능하다. 프로젝트별 제공되는 스마트 단어장 기능에서 내 스마트 단어장 버튼을 클릭한 프로젝트에 한하여 해당 프로젝 트의 스마트 단어장에 포함된 단어 및 발음을 내 스마트 단어장에 기록하고, 해당 데이터가 사용자 계정별로 관 리될 수 있다. 상기 내 스마트 단어장에 등록된 단어들은 프로젝트 생성 후 모든 프로젝트에 대해 기본값으로 적용되어 각 프로젝트에서 스마트 단어장에 입력하지 않아도 서버 즉 도 1의 디지털 휴먼 영상생성장치에 서 이를 처리하여 스크립트 내 존재하는 단어를 사용자가 사전 등록한 단어 및 발음으로 변환하는 과정을 거치 게 된다. 프로젝트 관리 페이지 상 내 스마트 단어장에서 또한 프로젝트 내에 존재하는 스마트 단어장과 동일하 게 단어 및 발음을 삭제할 수 있다. 도 3은 도 1의 디지털 휴먼 영상생성장치에서 사용자 단말장치로 제공하는 프로젝트 생성 페이지를 보여준다. 프로젝트 생성 페이지 화면은 프로젝트명, 저장, 영상 생성의 버튼이 표시되는 제1 영역, 기존 에 생성된 프로젝트를 클릭하여 진입하였을 경우 기생성한 디지털 휴먼 및 배경이 표시되고, 신규 프로젝트를 생성하였을 경우 디폴트(default)로 적용된 모델 및 배경이 화면에 표시되는 제2 영역, 적용가능한 디지털 휴먼의 모델, 얼굴, 그리고 스타일 등을 시각적으로 표시하며, 선택된 모델, 얼굴, 스타일 중 적어도 어느 하나 에 따라 신규 또는 기존의 사용자 맞춤형 디지털 휴먼을 표시하는 제3 영역, 디지털 휴먼의 동작을 설정하 기 위한 동작 영역인 제4 영역을 포함할 수 있다. 참고로, 상기 제4 영역에 포함된 복수의 동작(ex 오른손으로 안내 동작, 왼손으로 안내 동작, 정자세 동작, 인사하기 동작 등) 각각은 동작이 진행되는 시간(ex 10초)이 설정될 수 있다. 상기 시간은 스크립트 내 상기 사용자가 입력한 텍스트에 기초하여 생성된 음성 길이 에 따라 변경되어 자동 적용될 수 있다. 또한, 도 3에서 볼 수 있듯이, 프로젝트 생성 페이지 화면의 제 2 영역 하단에는 생성된 디지털 휴먼이 음 성으로 표현할 텍스트(“안녕하세요, ~~ 제가 소개해드릴 내용은 AI 휴먼입니다”) 등이 기록된 스크립트, 스마 트 단어장에 대한 버튼, 미리 듣기에 대한 버튼, 자막 On에 대한 버튼 등이 표시될 수 있다. 디지털 휴먼 영상생성장치는 스크립트에 표시된 텍스트에 대해서 다른 언어(ex 영어, 일본어 등)로 기록되 도록 할 수 있고, 기록된 텍스트를 디지털 휴먼의 음성으로 미리 발화 테스트(미리 듣기)를 할 수도 있으며(재 생, 정지, 소리크기 조절 가능), 제2 영역에서 자막으로 표시되도록 할 수도 있다. 스크립트에 기록된 텍 스트에 따라 디지털 휴먼이 발화하면서 동작을 설정하는 방법은 아래와 같다. 구체적으로, 디지털 휴먼 영상생성장치는 사용자로 하여금 마우스 커서 등을 스크립트 내 텍스트 사이에 위치시킨 상태에서 제4 영역에 포함된 특정 동작을 선택하는 경우, 상기 마우스 커서가 위치하는 소정 텍 스트의 발화와 함께 디지털 휴먼이 상기 특정 동작을 수행하도록 할 수 있다. 또한, 본 발명의 일 실시예에 따라, 디지털 휴먼 영상생성장치는, 스크립트 내 텍스트 사이에 특정 문자 (ex #)가 입력되는 경우, 복수의 동작을 드롭다운 형태로 나타내고, 사용자로 하여금 특정 동작을 선택하도록 할 수 있다. 이 경우, 특정 문자가 위치하는 소정 텍스트의 발화와 함께 디지털 휴먼이 상기 특정 동작을 수행 할 수 있을 것이다. 또한, 제2 영역에서 디지털 휴먼 영상이 재생되는 표시부의 하단에는 스마트단어장 버튼이 표시된다. 해당 버튼을 선택하여 스마트 단어장 화면에 진입할 수 있으며, 해당 화면에서 스마트 단어장 기능을 사용할 수 있게 된다. 디지털 휴먼 영상생성장치는, 해당 프로젝트의 스마트 단어장에 등록된 단어(스크립트에 기록된 상 태)에 대해서는 스마트 단어장에 등록된 발음으로 발화되도록 할 수 있다. 또한, 디지털 휴먼 영상생성장치 는 사용자 계정과 연동된 내 스마트 단어장에 포함된 단어에 대해서도 내 스마트 단어장에 등록된 발음으 로 발화되도록 할 수 있다. 제3 영역에서 새로운 휴먼을 만들 때 사용자는 인물 사진 등을 업로드하여 사진 속 인물을 기반으로 인공 지능의 추론에 의해 디지털 휴먼을 생성하는 것도 얼마든지 가능할 수 있다. 가령 인공지능 프로그램은 다양한얼굴을 학습 데이터로서 학습하므로 해당 학습 결과를 근거로 사진 속 인물의 얼굴 정보를 기반으로 한 가상의 디지털 휴먼을 생성해 낼 수 있다. 상기 디지털 휴먼의 얼굴을 추론하는 모델은 사용자가 업로드한 이미지(인물 사진)를 합성 베이스가 되는 인물(ex 기보유하는 실존 모델 등)의 얼굴에 반영하여 가상의 인물을 생성하는 기 법에 해당할 수 있다. 이때, 사용자가 업로드한 이미지 100%가 적용되는 것은 아니고, 일부(ex 50%)가 상기 가 상의 인물 생성에 적용될 수 있다. 도 4는 도 1의 디지털 휴먼 영상생성장치의 세부구조를 예시한 블록다이어그램이며, 도 5는 도 4의 디지털 휴먼 생성부의 세부구조를 예시한 블록다이어그램이다. 도 4에 도시된 바와 같이, 본 발명의 실시예에 따른 도 1의 디지털 휴먼 영상생성장치는 통신 인터페이스 부, 제어부, 디지털 휴먼 생성부 및 저장부의 일부 또는 전부를 포함한다. 본 발명의 일 실시예에 따라 도면에서는 표시되지 않았지만, 배경(템플릿) 및 생성된 디지털 휴먼을 기초로 영상을 생성하는 영상 생성부가 별도로 존재할 수도 있다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 디지털 휴먼 영상 생성장치가 구성되거나, 디지털 휴먼 생성부와 같은 일부 구성요소가 제어부와 같은 다른 구성 요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 통신 인터페이스부는 도 1의 통신망을 경유하여 사용자 단말장치와 통신한다. 통신을 수행하는 과정에서 통신 인터페이스부는 변/복조, 먹싱/디먹싱, 인코딩/디코딩, 해상도를 변환하는 스케일링 등의 동작을 수행할 수 있으며, 이는 당업자에게 자명하므로 더 이상의 설명은 생략한다. 통신 인터페이스부는 도 1의 사용자 단말장치에서 물론 사용자 단말장치의 사용자는 개인 고객 이거나 기업 고객일 수 있으며, 구독 서비스를 통해 서비스를 사용자 단말장치로 제공할 수 있다. 물론 AI 휴먼을 생성하는 서비스에 한하여 구독 서비스를 제공하고, 나머지 서비스는 무료로 제공될 수 있다. 통신 인터 페이스부는 사용자 단말장치의 서비스 요청에 따라 다양한 유형의 서비스 화면을 제공할 수 있으며, 대표적으로 도 3에서와 같이 디지털 휴먼을 생성하기 위한 프로젝트 생성 페이지를 제공할 수 있을 것이다. 통 신 인터페이스부는 도 3에서와 같은 프로젝트 생성 페이지를 통해 제공되는 데이터를 수신하여 제어부 에 전달한다. 제어부는 도 4의 통신 인터페이스부, 디지털 휴먼 생성부 및 저장부의 전반적인 동작을 제 어한다. 대표적으로 제어부는 통신 인터페이스부에서 제공되는 프로젝트 생성 페이지의 데이터를 저 장부에 임시 저장시킨 후 불러내어 디지털 휴먼 생성부에 제공한다. 이에 따라 디지털 휴먼 생성부 는 디지털 휴먼의 생성 동작을 수행할 수 있으며, 생성된 디지털 휴먼 데이터는 디지털 휴먼 생성부 의 요청에 따라 제어부의 제어하에 도 1의 DB(120a)에 체계적으로 분류하여 사용자별로 저장 및 관리될 수 있다. 이를 위하여 제어부는 통신 인터페이스부를 제어할 수 있다. 디지털 휴먼 생성부는 사용자 단말장치의 사용자가 회원 가입을 마치고 로그인을 수행하여, 추가적으 로 월간 또는 연간 구독 모델을 사전에 구매하여 서비스 사용을 진행하는 경우 디지털 휴먼 생성을 위한 프로젝 트 생성 페이지를 사용자 단말장치로 제공하여 사용자가 원하는 사용자 맞춤형 디지털 휴먼을 생성하도록 하고, 상기 디지털 휴먼을 포함하는 영상을 생성할 수도 있다. 또한, 이미 만들어진 디지털 휴먼의 경우에는 수 정하거나 삭제하는 등의 동작을 허용할 수 있다. 디지털 휴먼 생성부는 사용자 단말장치의 사용자가 디지털 휴먼을 생성할 수 있도록 디지털 휴먼의 배경 등을 선택할 수 있는 템플릿을 제공하며, 또 가상의 인물을 선택하여 의상과 얼굴 등의 표정을 설정할 수 있다. 또한, 디지털 휴먼을 생성하기 위해 사진을 업로드하여 업로드한 사진의 인물 즉 사람을 근거로 인공지능 프로그램을 통해 추론에 의한 가상인물을 생성할 수 있다. 사진속 인물을 근거로 추론하여 생성되는 가상인물은 인공지능 프로그램이 많은 인물 데이터를 학습한 결과이므로 사용자는 사진 속 인물을 기반으로 하는 디지털 휴 먼을 생성하는 것도 얼마든지 가능할 수 있다. 또한 디지털 휴먼 생성부는 사용자가 스크립트를 입력하고, 무음, 동작, 음성크기를 설정하며, 선택사항으 로 스마트 단어장에 발음 등을 입력해 줄 수 있다. 이에 따라 디지털 휴먼 생성부는 음성을 생성하고, 디 지털 휴먼이 포함된 영상을 생성할 수 있다. 본 발명의 실시예에 따른 디지털 휴먼 생성부는 도 5에 도시된 바와 같이 프로젝트부, 스마트 단어장 및 내 스마트 단어장으로 구분될 수 있다. 프로젝트부, 스마트 단어장 및 내 스마트 단어장은 소프트웨어 모듈, 하드웨어 모듈 또는 그 조합에 의해 구성될 수 있을 것이다. 프로젝트부는 음성 생성, 가상인물 생성 및 동작 연결 등의 동작을 수행할 수 있다. 음성 생성을 위해 특 정 국가 및 성별의 음성을 생성하고, 한국어를 포함한 기타 언어를 선택할 수 있고, 무음을 특정 위치에 삽입하 는 기능을 수행할 수 있으며, 음성의 크기를 조절하는 등 사용자의 기호에 맞게 각 기능을 선택 및 적용할 수 있다. 가상인물 생성시 얼굴이 포함된 이미지 파일 한 장만으로도 가상인물 생성이 가능하며 필요시 여러 얼굴 을 합성하여 가상인물 생성이 가능할 수 있다. 생성된 가상인물은 별도의 등록 과정을 거쳐 발화 영상 생성을 위해 활용할 수 있다. 모델 선택 및 얼굴 그리고 의상 선정이 완료되면 해당 인물에 적용된 동작을 선택할 수 있는데, 기본적으로 제공되는 동작으로는 정자세, 좌로 손을 뻗는 자세, 우로 손을 뻗는 자세, 그리고 양손을 뻗는 자세가 있으며, 가상인물에 따라 추가적인 동작이 가능하다. 이러한 동작들은 스크립트 내 특정 단어의 발 화 시점에서 동작을 삽입하여 가상인물이 동작을 수행하도록 동작 연결 엔진에 요청함으로써 동작 연결이 완료 될 수 있다. 스마트 단어장은 프로젝트 생성 페이지에서 스마트 단어장 버튼을 눌러 기능 사용이 가능하도록 동작한다. 각 프로젝트 생성 페이지별 독특한 단어 또는 발음, 발음을 잘하지 못하는 단어 또는 특정 기본 단위 등과 같은 발음 방법을 같이 추가하여 특정 단어(ex 韓國, ㄱㄱ)에 대해 발음(ex 한국, 고고)을 보다 쉽게 할 수 있도록 동작한다. 예를 들어, 韓國이라고 기재된 단어에 대해서는 ‘한국’이라고 발음할 수 있고, ㄱㄱ라고 기재된 단 어에 대해서는 ‘고고’라고 발음할 수 있는 것이다. 스마트 단어장에 작성된 단어는 스크립트 내 입력되 었을 때 발화하고자 하는 방식으로 변경되어 음성이 생성될 수 있다. 내 스마트 단어장은 프로젝트별 제공되는 스마트 단어장 기능에서 내 스마트 단어장 적용 버튼을 클릭한 프로젝트에 한하여, 해당 프로젝트의 스마트 단어장에 포함된 단어 및 발음이 내 스마트 단어장에 추가되 어 데이터가 사용자 계정별로 관리될 수 있다. 등록된 단어들은 프로젝트 생성 후 모든 프로젝트에 대해 기본값 으로 적용되어 각 프로젝트에서 스마트 단어장에 입력하지 않아도 디지털 휴먼 영상생성장치 등의 서버에 서 이를 처리하여 스크립트 내 존재하는 단어를 사용자가 사전 등록한 단어로 변환하는 과정을 거치게 된다. 한편, 저장부는 제어부의 제어하에 처리되는 다양한 유형의 데이터를 임시 저장할 수 있다. 예를 들 어 저장부는 프로젝트 생성 페이지를 통해 제공되는 사용자 단말장치의 사용자가 생성하려는 디지털 휴먼 관련 데이터를 제공받아 임시 저장한 후 해당 데이터를 디지털 휴먼 생성부에 제공할 수 있다. 상기한 내용 이외에도 도 4의 통신 인터페이스부, 제어부, 디지털 휴먼 생성부 및 저장부 는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 본 발명의 실시예에 따른 도 4의 통신 인터페이스부, 제어부, 디지털 휴먼 생성부 및 저장부 는 서로 물리적으로 분리된 하드웨어 모듈로 구성되지만, 각 모듈은 내부에 상기의 동작을 수행하기 위한 소프트웨어를 저장하고 이를 실행할 수 있을 것이다. 다만, 해당 소프트웨어는 소프트웨어 모듈의 집합이고, 각 모듈은 하드웨어로 형성되는 것이 얼마든지 가능하므로 소프트웨어니 하드웨어니 하는 구성에 특별히 한정하지 않을 것이다. 예를 들어 저장부는 하드웨어인 스토리지(storage) 또는 메모리(memory)일 수 있다. 하지만, 소프트웨어적으로 정보를 저장(repository)하는 것도 얼마든지 가능하므로 위의 내용에 특별히 한정하지는 않을 것이다. 한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트 정보의 연산동작을, 그리고 명령어해석부는 인터프리터나 컴 파일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지 스트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 디지털 휴먼 영상생성장치 의 동작 초기에 디지털 휴먼 생성부에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로딩 한 후 이를 실행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 딥러닝 모델 같은 경우 램(RA M)도 중요하지만 GPU 메모리에 올라가 GPU를 이용하여 수행 속도를 가속화하여 실행될 수도 있다. 도 6은 도 1의 디지털 휴먼 영상생성장치의 구동과정을 나타내는 흐름도이다. 설명의 편의상 도 6을 도 1과 함께 참조하면, 본 발명의 실시예에 따른 디지털 휴먼 영상생성장치는 가상 디지털 휴먼의 생성을 위한 디지털 휴먼 영상 생성 툴을 저장한다(S600). 여기서 툴은 본 발명의 실시예에 따른 가상의 디지털 휴먼을 제작(혹은 생성)하는 제작 프로그램에 해당할 수 있다.또한, 디지털 휴먼 영상생성장치는 사용자 단말장치의 서비스 요청시 (기)저장한 툴을 실행하여 디지 털 휴먼의 생성을 위한 프로젝트 생성 페이지 화면을 제공하며, 제공한 프로젝트 생성 페이지 화면상에서 사용 자 단말장치의 사용자가 업로드하는 사진의 인물을 이용해 인공지능(AI)의 추론에 의해 생성되는 디지털 휴먼의 영상을 생성한다(S610). 물론, 상기 업로드되는 사진과 무관하게 디지털 휴먼 영상생성장치는 디지 털 휴먼 영상을 생성하기 위해 디지털 휴먼이 결정되면, 해당 디지털 휴먼에 음성, 동작, 얼굴, 스타일 등을 각 각 설정함으로써 맞춤형 디지털 휴먼을 생성하고, 상기 디지털 휴먼이 포함된 영상의 생성이 완료될 수 있다. 나아가, 본 발명의 실시예에 따른 디지털 휴먼 영상생성장치는 템플릿에서 다양한 분야의 배경을 선택할 수 있으며, 선택한 디지털 휴먼에 대하여 위에서와 같이 얼굴, 스타일, 음성, 동작을 또한 각각 설정할 수 있다 이때, 스마트 단어장 기능을 사용하여 선택한 디지털 휴먼이 특정 단어와 특정 발음을 구사 즉 발화하도록 지정 해 줄 수 있다. 예를 들어, 사용자가 원하는 단어와 발음을 지정해 줌으로써 해당 단어와 발음을 발화 방식(예: 장음 등)에 따라 디지털 휴먼이 사용하게 된다. 이의 과정에서 본 발명의 실시예에서는 내 스마트 단어장을 사 용할 수 있다. 예를 들어, 사용자는 복수의 디지털 휴먼을 생성하여 이용할 수 있다. 이때 복수의 디지털 휴먼 이 서로 특정 단어와 특정 발음을 공통적으로 발화하기를 원하는 경우 내 스마트 단어장에 등록할 수 있다. 각 각의 프로젝트에서 디지털 휴먼의 스마트 단어장을 생성할 때, 적용 버튼을 선택하게 되면 특정 프로젝트의 특 정 스마트 단어장에서 작성한 단어나 발음이 내 스마트 단어장에 등록될 수 있고, 프로젝트 관리 페이지에서 내 스마트 단어장 관리를 수행하게 된다. 상기한 내용 이외에도 도 1의 디지털 휴먼 영상생성장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 도 7은 도 1의 디지털 휴먼 영상생성장치의 디지털 휴먼 생성 과정을 나타내는 도면이다. 설명의 편의상 도 7을 도 1과 함께 참조하면, 도 1의 디지털 휴먼 영상생성장치는 사용자 단말장치와 의 통신에 의해 템플릿을 선택할 수 있다(S700). 이의 과정에서 디지털 휴먼 영상생성장치는 구독 여부를 확인할 수 있다(S710). 가령 구독 중인 경우 선택 된 템플릿을 반영할 수 있다. 그리고, 디지털 휴먼 영상생성장치는 가상의 디지털 휴먼 생성을 위한 프로젝트 생성 동작을 진행시킬 수 있다(S710). 프로젝트 생성을 통해 새롭게 생성하는 디지털 휴먼 또는 기생성된 디지털 휴먼의 얼굴, 스타일, 언어, 동작 등을 설정할 수 있다. 물론 이의 과정에서 가상인물을 생성하는 것도 얼마든지 가능할 수 있다(S730). 디지털 휴먼을 포함하는 영상을 생성할 수도 있지만, 디지털 휴먼 자체, 즉 가상인물을 생성하는 것도 사용자 요청에 따라 가능한 것이다. 이어, 디지털 휴먼 영상생성장치는 구독 여부를 확인할 수 있다(S730). 구독 중인 것으로 확인되면 사용자 단말장치의 영상 생성 요청에 따라 디지털 휴먼을 포함하는 영상을 생성할 수 있다(S740). 도 8은 도 7의 프로젝트 생성의 세부 동작을 나타내는 흐름도이다. 설명의 편의상 도 8을 도 1과 함께 참조하면, 도 1의 디지털 휴먼 영상생성장치는 도 3에 나타낸 바 있는 디지털 휴먼 생성 페이지에서 디지털 휴먼 생성을 위한 동작을 수행할 수 있다. 디지털 휴먼 영상생성장치는 사용자 단말장치와의 통신에 의해 가상 인물을 선택하거나 커스텀 가상 인물을 생성할 수 있다(S800, S805). 여기서, 가상인물 즉 디지털 휴먼은 기생성된 모델 중에 선택될 수 있지만, 사용자가 사진을 업로드하면 해당 업로드한 사진의 인물을 근거로 인공지능 프로그램이 추론에 의해 가 상의 디지털 휴먼을 생성해 줄 수 있다. 경우에 따라서는 사진없이 사용자의 입력(얼굴, 스타일, 모델 등)에 의 해 신규의 가상 인물(디지털 휴먼)이 생성될 수도 있다. 상기 인공지능 프로그램은 얼굴과 관련한 데이터를 학 습한 상태이므로 학습 결과를 근거로 추론에 의해 사진 속 인물에 의해 디지털 휴먼을 생성해 줄 수 있다. 또한 디지털 휴먼 영상생성장치는 스크립트 입력 동작을 수행한다(S810). 예를 들어 스마트 단어장에 작성 된 단어는 스크립트 내 입력되었을 때 디지털 휴먼이 발화하고자 하는 방식으로 변경되어 음성이 생성될 수 있 다. 이어 디지털 휴먼 영상생성장치는 무음, 동작, 음성크기 등을 설정할 수 있으며, 스마트 단어장에 디지털 휴먼이 발화하기를 원하는 지정된 단어와 발음 등을 작성할 수 있다(S820, S830). 상기의 과정에 따라 음성 생성이 완료된 후(S840), 화면상에서 영상 생성 버튼을 선택하게 되면 디지털 휴먼을 포함하는 영상이 생성된다(S850). 다시 말해, 화면상에서 그동안 지정한 동작, 스크립트 내 입력 데이터, 스마 트 단어장의 단어나 발음 등을 디지털 휴먼에 세팅 즉 설정하여 설정된 데이터에 따라 디지털 휴먼이 동작한다 고 볼 수 있다. 도 9는 도 8의 스마트 단어장의 세부 동작을 나타내는 도면이다. 설명의 편의상 도 9를 도 1과 함께 참조하면, 도 1의 디지털 휴먼 영상생성장치는 스마트 단어장 화면을 표시하여 디지털 휴먼에서 발화하고자 하는 특정 단어나 발음을 지정한다(S900). 이와 같이 디지털 휴먼 영상생성장치는 스마트 단어장 단어 및 발화 방법을 등록하여 현재 생성한 디지털 휴먼에 반영한다(S910). 이의 과정에서 가령 현재 생성한 디지털 휴먼 이외에도 기생성한 다른 디지털 휴먼에도 해당 단어와 발음을 발 화하고자 하는 경우 내 스마트 단어장 적용 버튼을 클릭함으로써 다른 디지털 휴먼에도 확대 적용할 수 있다 (S920). 한편, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었 다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각 각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프 로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일 시적 저장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다. 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0007568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "한정되지 아니하며, 청구범위에 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다. 이상에서, 본 발명이 구체적인 구성요소 등과 같은 특정 사항들과 한정된 실시 예 및 도면에 의해 설명되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명이 상기 실시예들에 한정되는 것은 아니며, 본 발명이 속하는 기술 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양 한 수정 및 변형을 꾀할 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 청구범위뿐만 아니라 이 청구범위와 균등하게 또는 등가적으로 변형된 모든 것들은 본 발명의 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2023-0007568", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 디지털 휴먼 영상 생성 시스템을 나타내는 도면이다. 도 2는 도 1의 디지털 휴먼 영상생성장치에서 제공하는 디지털 휴먼 서비스의 웹 페이지 개요를 설명하기 위한도면이다. 도 3은 디지털 휴먼 영상을 생성 및 관리하는 프로젝트 화면의 예시도이다. 도 4는 도 1의 디지털 휴먼 영상생성장치의 세부구조를 예시한 블록다이어그램이다. 도 5는 도 4의 디지털 휴먼 생성부의 세부구조를 예시한 블록다이어그램이다. 도 6은 도 1의 디지털 휴먼 영상생성장치의 구동과정을 나타내는 흐름도이다. 도 7은 도 1의 디지털 휴먼 영상생성장치의 디지털 휴먼 생성 과정을 나타내는 도면이다. 도 8은 도 7의 프로젝트 생성의 세부 동작을 나타내는 흐름도이다. 도 9는 도 8의 스마트 단어장의 세부 동작을 나타내는 도면이다."}
