{"patent_id": "10-2020-0064009", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0147189", "출원번호": "10-2020-0064009", "발명의 명칭": "운전자 보조 시스템과 연계한 가상 엔진음 발생시스템 및 방법", "출원인": "쌍용자동차 주식회사", "발명자": "한상재"}}
{"patent_id": "10-2020-0064009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "운전자 보조 시스템(ADAS)과 연계하여 가상 엔진음을 발생하기 위한 시스템으로서,기어 위치를 감지하는 기어위치 감지부;차량 속도를 감지하는 차속 감지부;차량 시동이 온 된 상태에서, 상기 차속 감지부를 통해 감지한 차속이 가상 엔진음 발생 조건을 만족하면, 상기기어위치 감지부에서 감지한 기어 위치가 드라이브 또는 후진상태일 경우, 차량 전방의 보행자를 감지하는 보행자 감지시스템(PDWS)과 전방 추돌을 감지하는 전방 추돌감지 시스템(FCWS)과 후방 이동물체 감지시스템(RCTA)과연계하여 선택적으로 가상 엔진음을 발생하는 가상 엔진 사운드시스템; 및상기 가상 엔진 사운드 시스템에서 출력되는 가상 엔진음을 출력하는 가상 엔진음 출력부를 포함하는 것을 특징으로 하는 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템."}
{"patent_id": "10-2020-0064009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에서, 상기 가상 엔진 사운드 시스템은 차량 속도가 미리 설정된 가상 엔진음 발생 범위이고, 기어 위치가 드라이브 위치이면 상기 보행자 감지 시스템과 전방 추돌감지 시스템과 연계하여 보행자 또는 전방 추돌이감지되는 경우에만 가상 엔진음을 발생하며, 상기 기어 위치가 후진 위치이면 상기 후방 이동물체 감지 시스템과 연계하여 차량 후방의 이동물체가 감지되는 경우에만 가상 엔진음을 발생하는 것을 특징으로 하는 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템."}
{"patent_id": "10-2020-0064009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 및 청구항 2중 어느 하나의 청구항에 기재된 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템을이용하여 가상 엔진음을 발생하는 방법으로서,(a) 가상 엔진 사운드 시스템에서 차량 시동이 온 되면 기어 위치를 확인하는 단계;(b) 상기 가상 엔진 사운드 시스템에서 확인한 기어 위치가 드라이브 위치이면, 차속 감지부를 통해 감지한 차속이 가상 엔진음 발생 조건을 만족하는지를 확인하여, 차속이 가상 엔진음 발생 조건을 만족하면 차량 전방의보행자를 감지하는 보행자 감지시스템(PDWS)과 전방 추돌을 감지하는 전방 추돌감지 시스템(FCWS)과 연계하여가상 엔진음의 발생을 제어하는 단계; 및(c) 상기 가상 엔진 사운드 시스템에서 확인한 기어 위치가 후진 위치이면, 후방 이동물체 감지시스템(RCTA)과연계하여 가상 엔진음을 발생을 제어하는 단계를 포함하는 것을 특징으로 하는 운전자 보조 시스템과 연계한 가상 엔진음 발생방법."}
{"patent_id": "10-2020-0064009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에서, 상기 (b)단계는 차량 속도가 미리 설정된 가상 엔진음 발생 범위이고, 기어 위치가 드라이브 위치이면 상기 보행자 감지 시스템과 전방 추돌감지 시스템과 연계하여 보행자 또는 전방 추돌이 감지되는 경우에만 가상 엔진음을 발생하는 것을 특징으로 하는 운전자 보조 시스템과 연계한 가상 엔진음 발생방법."}
{"patent_id": "10-2020-0064009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2021-0147189-3-청구항 3에서, 상기 (c)단계는 상기 기어 위치가 후진 위치이면 상기 후방 이동물체 감지 시스템과 연계하여 차량 후방의 이동물체가 감지되는 경우에만 가상 엔진음을 발생하는 것을 특징으로 하는 운전자 보조 시스템과 연계한 가상 엔진음 발생방법."}
{"patent_id": "10-2020-0064009", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "친환경 차량에서 운전자 보조 시스템(ADAS, Advanced Driver Assistance System)과 연계하여 현재 법규(QRTV, Quiet Road Transport Vehicles)를 만족하면서도 차량의 정숙성을 원하는 사용자의 요구도 동시에 만족시킬 수 있는 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템 및 방법에 관한 것으로서, 가상 엔진 사운드 시스템 에서 차량 시동이 온 되면 기어 위치를 확인하여, 드라이브 위치이면, 차속 감지부를 통해 감지한 차속이 가상 엔진음 발생 조건을 만족하는지를 확인하여, 차속이 가상 엔진음 발생 조건을 만족하면 차량 전방의 보행자를 감 지하는 보행자 감지시스템(PDWS)과 전방 추돌을 감지하는 전방 추돌감지 시스템(FCWS)과 연계하여 가상 엔진음의 발생을 제어하고, 기어 위치가 후진 위치이면, 후방 이동물체 감지시스템(RCTA)과 연계하여 가상 엔진음을 발생 을 제어하여, 법규를 만족하면서도 차량의 정숙성을 유지할 수 있다."}
{"patent_id": "10-2020-0064009", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 운전자 보조 시스템(ADAS)과 연계한 가상 엔진음 발생시스템 및 방법에 관한 것으로, 특히 친환경 차 량에서 운전자 보조 시스템(ADAS, Advanced Driver Assistance System)과 연계하여 현재 법규(QRTV, Quiet Road Transport Vehicles)를 만족하면서도 차량의 정숙성을 원하는 사용자의 요구도 동시에 만족시킬 수 있는 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0064009", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 하이브리드 자동차(Hybrid Electric Vehicle, HEV)나 전기 자동차(Electric Vehicle, EV)와 같은 친환경 자동차에는 동력원으로서 엔진과 모터가 탑재된다. 하이브리드 자동차(HEV)나 전기 자동차(EV)가 모터에 의해 주행하는 경우, 차량에서 발생하는 소음이 매우 낮아 지게 된다. 이에, 보행자 특히 시각 장애인은 차량이 접근 여부를 판단하기가 어렵다. 이를 개선하고자, 친환경 차량은 보행자 안전을 위해 전/후방 저속 주행 시 차량이 접근하는 것을 보행자에게 알리기 위한 경고음(엔진음)을 스피커를 통해 출력하도록 규정하고 있다. 이러한 규정에 따라 친환경 차량에서 보행자로 하 여금 차량 접근을 쉽게 인식하게 하는 가상 엔진음 시스템(Virtual Engine Sound System, VESS)이 적용되고 있 다. 가상 엔진음 시스템(VESS)은 차속, 엑셀 개도 각 또는 모터의 회전수와 같은 차량 주행정보를 이용하여 가상 엔 진음의 작동 여부 및 음량 등을 제어한다. 그러나 이러한 가상 엔진음 시스템은 가상 엔진음이 필요한 경우에는 가상 엔진음을 발생시켜 보행자나 운전자 에게 주의 환기를 요하여 안전을 도모하나, 가상 엔진음이 필요 없는 상황(전후방 이동 물체가 없는 상황)에서 도 일정 조건(예를 들어, 차량 주행 속도)을 만족하면 불필요하게 가상 엔진음을 발생하여 사용자(운전자)가 요 구인 정숙성을 만족시키지 못하는 단점이 있다. 한편, 친환경 차량에서 가상 엔진음을 발생하는 종래의 기술이 하기의 <특허문헌 1 > 내지 <특허문헌 3> 개시되 어 있다. <특허문헌 1> 에는 내비게이션 정보 수집수단에서 수집된 내비게이션 정보를 기반으로 음원 저장수단에 저장되 어 있는 음원을 소음규제에 맞게 볼륨을 조절하여 출력하도록 음원 출력수단을 제어하는 제어수단, 제어수단의 제어에 따라 음원을 출력하는 음원 출력수단을 포함한다. 이러한 구성을 통해, 차량의 주변환경 또는 운전자의 심리상태에 따라 소음의 종류 및 볼륨을 조절함으로써, 보행자가 엔진소리가 나지 않는 친환경 차량을 인지할 수 있도록 함은 물론 보행자가 소음으로 인하여 불쾌감을 갖지 않도록 하는 친환경 차량의 소음 발생 장치를 제 공한다. 그러나 이러한 선행기술은 차량 주변 환경이나 운전자의 심리상태에 따라 소음의 종류 및 볼륨을 조절하는 것은 가능하나, 가상 엔진음이 필요 없는 상황(전후방 이동 물체가 없는 상황)에서도 일정 조건(예를 들어, 차량 주 행 속도)을 만족하면 불필요하게 가상 엔진음을 발생하여 사용자(운전자)가 요구인 정숙성을 만족시키지 못하는 단점이 있다. 또한, <특허문헌 2> 에는 다른 차의 가상 엔진음의 주파수 대역별 음압과 자차의 가상 엔진음의 주파수 대역별 음압의 합이 임계치를 초과하지 않도록 자차의 가상 엔진음의 주파수 대역별 음압을 조절함으로써, 다른 차의 가상 엔진음과 자차의 가상 엔진음이 겹쳐서 보행자에게 전달되는 경우에 보행자가 불쾌감을 느끼지 않도록 하 는 가상 엔진음 제어 장치 및 그 방법을 제공한다. 이러한 종래기술도 다른 차와 자차의 주파수 대역별 음압을 조절하여 보행자가 불쾌감을 느끼지 않도록 가상 엔 진음을 발생하는 것은 가능하나, 가상 엔진음이 필요 없는 상황(전후방 이동 물체가 없는 상황)에서도 일정 조 건(예를 들어, 차량 주행 속도)을 만족하면 불필요하게 가상 엔진음을 발생하여 사용자(운전자)가 요구인 정숙성을 만족시키지 못하는 단점이 있다. 또한, <특허문헌 3> 에는 엔진회전수 비례 청각 추출 음량을 이용한 실시간 음색 제어와 함께 최적 시각 추출 가상 RPM을 이용한 변화속도 가시화제어가 엔진 진동신호를 기반으로 주행패턴학습의 인공지능으로 구현됨으로 써, 시청각의 시너지 효과 극대화를 구현한다. 아울러 인공지능으로 조화된 시청각의 실시간 변화로 간결한 차 량 동력성능 제어와 함께 빠른 응답에 대한 감(Feeling)이 운전자에게 제공되는 인공지능을 활용한 엔진동력특 성 기반 엔진 음색 제어방법 및 차량을 제공한다. 이러한 선행기술도 엔진 고유의 동력특성이 적용되면서 인공지능(Artificial Intelligence)의 시청각 제어로 시 청각 시너지 효과를 구현할 수 있으나, 가상 엔진음이 필요 없는 상황(전후방 이동 물체가 없는 상황)에서도 일 정 조건(예를 들어, 차량 주행 속도)을 만족하면 불필요하게 가상 엔진음을 발생하여 사용자(운전자)가 요구인 정숙성을 만족시키지 못하는 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 10-2013-0057851(2013.06.03. 공개)(친환경 차량의 소음 발생장치) (특허문헌 0002) 대한민국 등록특허 10-1592750(2016.02.01. 등록)(가상 엔진음 제어 장치 및 그 방법) (특허문헌 0003) 대한민국 공개특허 10-2019-0042912(2019.04.25. 공개)(인공지능을 활용한 엔진동력특성 기반 엔진 음색 제어방법 및 차량)"}
{"patent_id": "10-2020-0064009", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명은 상기와 같은 일반적인 가상 엔진음 발생장치(VESS) 및 종래기술에서 발생하는 제반 문제점을 해결하기 위해서 제안된 것으로서, 친환경 차량에서 운전자 보조 시스템(ADAS, Advanced Driver Assistance System)과 연계하여 현재 법규(QRTV, Quiet Road Transport Vehicles)를 만족하면서도 차량의 정숙성을 원하는 사용자의 요구도 동시에 만족시킬 수 있는 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템 및 방법을 제 공하는 데 그 목적이 있다."}
{"patent_id": "10-2020-0064009", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여, 본 발명에 따른 \"운전자 보조 시스템과 연계한 가상 엔진음 발생시 스템\"은, 기어 위치를 감지하는 기어위치 감지부; 차량 속도를 감지하는 차속 감지부; 차량 시동이 온 된 상태 에서, 상기 차속 감지부를 통해 감지한 차속이 가상 엔진음 발생 조건을 만족하면, 상기 기어위치 감지부에서 감지한 기어 위치가 드라이브 또는 후진상태일 경우, 차량 전방의 보행자를 감지하는 보행자 감지시스템(PDWS) 과 전방 추돌을 감지하는 전방 추돌감지 시스템(FCWS)과 후방 이동물체 감지시스템(RCTA)과 연계하여 선택적으 로 가상 엔진음을 발생하는 가상 엔진 사운드시스템; 및 상기 가상 엔진 사운드 시스템에서 출력되는 가상 엔진 음을 출력하는 가상 엔진음 출력부를 포함하는 것을 특징으로 한다. 상기에서 가상 엔진 사운드 시스템은 차량 속도가 미리 설정된 가상 엔진음 발생 범위이고, 기어 위치가 드라이 브 위치이면 상기 보행자 감지 시스템과 전방 추돌감지 시스템과 연계하여 보행자 또는 전방 추돌이 감지되는 경우에만 가상 엔진음을 발생하며, 상기 기어 위치가 후진 위치이면 상기 후방 이동물체 감지 시스템과 연계하 여 차량 후방의 이동물체가 감지되는 경우에만 가상 엔진음을 발생하는 것을 특징으로 한다. 상기한 바와 같은 목적을 달성하기 위하여, 본 발명에 따른 \"운전자 보조 시스템과 연계한 가상 엔진음 발생방 법\"은, (a) 가상 엔진 사운드 시스템에서 차량 시동이 온 되면 기어 위치를 확인하는 단계; (b) 상기 가상 엔진 사운드 시스템에서 확인한 기어 위치가 드라이브 위치이면, 차속 감지부를 통해 감지한 차 속이 가상 엔진음 발생 조건을 만족하는지를 확인하여, 차속이 가상 엔진음 발생 조건을 만족하면 차량 전방의 보행자를 감지하는 보행자 감지시스템(PDWS)과 전방 추돌을 감지하는 전방 추돌감지 시스템(FCWS)과 연계하여가상 엔진음의 발생을 제어하는 단계; (c) 상기 가상 엔진 사운드 시스템에서 확인한 기어 위치가 후진 위치이면, 후방 이동물체 감지시스템(RCTA)과 연계하여 가상 엔진음을 발생을 제어하는 단계를 포함하는 것을 특징으로 한다. 상기에서 (b)단계는 차량 속도가 미리 설정된 가상 엔진음 발생 범위이고, 기어 위치가 드라이브 위치이면 상기 보행자 감지 시스템과 전방 추돌감지 시스템과 연계하여 보행자 또는 전방 추돌이 감지되는 경우에만 가상 엔진 음을 발생하는 것을 특징으로 한다. 상기에서 (c)단계는 상기 기어 위치가 후진 위치이면 상기 후방 이동물체 감지 시스템과 연계하여 차량 후방의 이동물체가 감지되는 경우에만 가상 엔진음을 발생하는 것을 특징으로 한다."}
{"patent_id": "10-2020-0064009", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 친환경 차량에서 운전자 보조 시스템(ADAS, Advanced Driver Assistance System)과 연계하여 현재 법규(QRTV, Quiet Road Transport Vehicles)를 만족하면서도 차량의 정숙성을 원하는 사용자의 요구도 동 시에 만족시킬 수 있는 효과가 있다."}
{"patent_id": "10-2020-0064009", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 바람직한 실시 예에 따른 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템 및 방법을 첨부 된 도면을 참조하여 상세하게 설명한다. 이하에서 설명되는 본 발명에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 안 되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념으로 적절하게 정의할 수 있 다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서 본 명세서에 기재된 실시 예와 도면에 도시된 구성은 본 발명의 바람직한 실시 예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원 시점에서 이들을 대체할 수 있는 다양한 균등물과 변형 예들이 있을 수 있음을 이해하여야 한다. 도 1은 본 발명의 바람직한 실시 예에 따른 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템의 구성도로서, 보행자 감지 시스템(PDWS, Pedestrian collision Warning System), 전방 추돌감지 시스템 (FCWS, Forward Collision Warning System), 후방 이동물체 감지 시스템(RCTA, Rear Cross Traffic Alert), 기어 위치 감지부, 가상 엔진 사운드 시스템, 가상 엔진음 출력부 및 차속 감지부(7 0)를 포함할 수 있다. 기어위치 감지부는 변속 기어의 위치를 감지하여 사익 가상 엔진 사운드 시스템에 전달하는 역할을 한 다. 차속 감지부는 차량의 속도를 감지하여 상기 가상 엔진 사운드 시스템에 전달하는 역할을 한다. 보행자 감지시스템은 차량 전방의 보행자를 감지하는 역할을 하며, 전방 추돌감지 시스템은 전방 추돌 을 감지하는 역할을 하고, 후방 이동물체 감지 시스템은 차량 후방의 이동물체를 감지하는 역할을 한다. 이 러한 보행자 감지시스템과 전방 추돌감지 시스템 및 후방 이동물체 감지 시스템은 차량에 기본적으 로 구비된 운전자 보조 시스템(ADAS)을 의미한다. 가상 엔진음 사운드 시스템은 차량 시동이 온(on) 된 상태에서, 상기 차속 감지부를 통해 감지한 차속 이 가상 엔진음 발생 조건을 만족하면, 상기 기어위치 감지부에서 감지한 기어 위치가 드라이브 또는 후진 상태일 경우, 차량 전방의 보행자를 감지하는 보행자 감지시스템(PDWS)과 전방 추돌을 감지하는 전방 추돌 감지 시스템(FCWS)과 후방 이동물체 감지시스템(RCTA)과 연계하여 선택적으로 가상 엔진음을 발생하는역할을 한다. 상기 가상 엔진음 사운드 시스템과 보행자 감지시스템(PDWS), 전방 추돌감지 시스템(FCWS) 및 후방 이동물체 감지시스템(RCTA) 간에는 CAN 통신이나 인터넷 통신을 통해 감지 데이터를 송수신한다. 여기서 가상 엔진음 사운드 시스템은 차량 시동이 온 된 상태에서, 기어 위치를 먼저 검출하고, 이어 기어 위치가 특정 조건을 만족하면(예를 들어, 드라이브 위치, 후진 위치), 가상 엔진음의 발생을 제어할 수 있다. 양자는 순서상의 차이만 있을 뿐 작용이나 효과에서는 동일하다. 가상 엔진음 출력부는 상기 가상 엔진 사운드 시스템에서 출력되는 가상 엔진음을 출력하는 역할을 한 다. 이와 같이 구성된 본 발명의 바람직한 실시 예에 따른 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템이 동작을 첨부한 도면 도 2, 도 3a 및 도 3b를 참조하여 구체적으로 설명하면 다음과 같다. 먼저, 가상 엔진 사운드 시스템은 차량 시동이 온 된 상태이면, 기어 위치 감지부와 차속 감지부를 통해 각각 검출한 기어 위치와 차량 속도를 기반으로 가상 엔진음 발생 조건을 확인한다. 즉, 차량 속도가 미리 설정된 가상 엔진음 발생 범위(예를 들어, 0 ~ 30km/h)이고, 기어 위치가 드라이브(D) 위 치이면, 도 3a에 도시한 바와 같이, 상기 보행자 감지 시스템과 전방 추돌감지 시스템과 연계하여 보행 자 또는 전방 추돌이 감지되는지를 확인한다. 이 확인 결과 보행자 또는 전방 추돌이 감지되면, 가상 엔진음을 발생하여 가상 엔진음 출력부에 전달한다. 가상 엔진음 출력부는 전달되는 가상 엔진음을 스피커를 통해 외부에 출력하여 보행자 등에 차량의 존재를 인지시켜 법규를 만족하면서 사고를 방지한다. 또한, 상기 확인 결과 보행자 또는 전방 추돌이 감지되지 않으면, 가상 엔진음 발생 조건을 만족해도 가상 엔진 음을 발생하지 않는다. 이 경우에는 운전자가 요구하는 차량 정숙성을 만족시켜, 운전자 편의성 향상을 도모한 다. 한편, 기어 위치가 후진 위치이면 도 3b에 도시한 바와 같이, 상기 후방 이동물체 감지 시스템과 연계하여 차량 후방의 이동물체가 감지되는지를 확인하여, 차량 후방의 이동물체가 감지되면 가상 엔진음을 발생하여 차 량의 존재를 주변에 인지시킨다. 아울러 차량 후방의 이동 물체가 감지되지 않으면, 가상 엔진음 발생 조건을 만족해도 가상 엔진음을 발생하지 않는다. 이 경우에는 운전자가 요구하는 차량 정숙성을 만족시켜, 운전자 편 의성 향상을 도모한다. 도 4는 본 발명에 따른 \"운전자 보조 시스템과 연계한 가상 엔진음 발생방법\"을 보인 흐름도로서, (a) 가상 엔 진 사운드 시스템에서 차량 시동이 온 되면 기어 위치를 확인하는 단계(S11, S12), (b) 상기 가상 엔진 사 운드 시스템에서 확인한 기어 위치가 드라이브 위치이면, 차속 감지부를 통해 감지한 차속이 가상 엔진 음 발생 조건을 만족하는지를 확인하여, 차속이 가상 엔진음 발생 조건을 만족하면 차량 전방의 보행자를 감지 하는 보행자 감지시스템(PDWS)과 전방 추돌을 감지하는 전방 추돌감지 시스템(FCWS)과 연계하여 가상 엔진음의 발생을 제어하는 단계(S13 - S16), (c) 상기 가상 엔진 사운드 시스템에서 확인한 기어 위치가 후 진 위치이면, 후방 이동물체 감지시스템(RCTA)과 연계하여 가상 엔진음을 발생을 제어하는 단계(S17, S16, S13)를 포함한다. 이와 같이 구성된 본 발명의 바람직한 실시 예에 따른 운전자 보조 시스템과 연계한 가상 엔진음 발생방법을 구 체적으로 설명하면 다음과 같다. 먼저, 단계 S11에서 가상 엔진 사운드 시스템은 차량 시동이 온 된 상태이면, 단계 S12로 이동하여 기어 위 치 감지부를 통해 검출한 기어 위치가 가상 엔진음 발생 조건을 만족하는지를 확인한다. 즉, 차량의 기어 위치가 드라이브 위치 또는 후진 위치이면 가상 엔진음 발생 조건으로 판단을 하고, 단계 S14 로 이동하여 차량 속도가 미리 설정된 가상 엔진음 발생 범위(예를 들어, 0 ~ 30km/h)인지를 확인한다. 이 확인 결과 차량 속도가 상기 가상 엔진음 발생 범위에 속하면, 단계 S15로 이동하여 상기 보행자 감지 시스 템과 전방 추돌감지 시스템과 연계하여 보행자 또는 전방 추돌이 감지되는지를 확인한다. 이 확인 결과 보행자 또는 전방 추돌이 감지되면, 단계 S16으로 이동하여 가상 엔진음을 발생하여 가상 엔진음 출력부에 전달한다. 가상 엔진음 출력부는 전달되는 가상 엔진음을 스피커를 통해 외부에 출력하여 보행자 등에 차량의 존재를 인지시켜 법규를 만족하면서 사고를 방지한다. 또한, 상기 확인 결과 보행자 또는 전방 추돌이 감지되지 않으면, 단계 S13으로 이동하여 가상 엔진음 발생 조 건을 만족해도 가상 엔진음을 발생하지 않는다. 이 경우에는 운전자가 요구하는 차량 정숙성을 만족시켜, 운전 자 편의성 향상을 도모한다. 한편, 기어 위치가 후진 위치이면 단계 S17로 이동하여, 상기 후방 이동물체 감지 시스템과 연계하여 차량 후방의 이동물체가 감지되는지를 확인하여, 차량 후방의 이동물체가 감지되면 단계 S16으로 이동하여 가상 엔진 음을 발생하여 차량의 존재를 주변에 인지시킨다. 아울러 차량 후방의 이동 물체가 감지되지 않으면, 단계 S13 으로 이동하여 가상 엔진음 발생 조건을 만족해도 가상 엔진음을 발생하지 않는다. 이 경우에는 운전자가 요구 하는 차량 정숙성을 만족시켜, 운전자 편의성 향상을 도모한다. 이상 본 발명자에 의해서 이루어진 발명을 상기 실시 예에 따라 구체적으로 설명하였지만, 본 발명은 상기 실시"}
{"patent_id": "10-2020-0064009", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되는 것은 아니고 그 요지를 이탈하지 않는 범위에서 여러 가지로 변경 가능한 것은 이 기술분야에서 통상의 지식을 가진 자에게 자명하다."}
{"patent_id": "10-2020-0064009", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템의 구성도, 도 2는 본 발명에서 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템을 차량에 구현한 예시도, 도 3a 및 도 3b는 본 발명에서 운전자 보조 시스템과 연계한 가상 엔진음 발생시스템의 동작구현 예시도, 도 4는 본 발명에 따른 운전자 보조 시스템과 연계한 가상 엔진음 발생방법을 보인 흐름도이다."}
