{"patent_id": "10-2014-0061378", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0134552", "출원번호": "10-2014-0061378", "발명의 명칭": "정보 운용 방법 및 전자 장치", "출원인": "삼성전자주식회사", "발명자": "박정선"}}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "생체 정보 수집을 지원하는 센서 활성화와 관련된 트리거 신호를 감지하는 동작;상기 트리거 신호가 감지되면 상기 센서를 활성화하여 접촉된 물체의 생체 정보를 수집하는 동작;상기 수집된 생체 정보를 출력하는 동작;을 포함하는 정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 생체 정보를 수집하는 동작은상기 트리거 신호 감지에 따라 접촉된 물체가 사용자 신체인지 여부를 확인하는 동작;상기 물체가 사용자 신체인 경우 상기 생체 정보를 수집하는 동작;을 더 포함하는 정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 트리거 신호를 감지하는 동작은상기 센서에 인접된 영역에 배치된 터치 센서로부터 지정된 터치 신호 발생을 감지하는 동작;상기 센서에 인접된 영역에 배치된 압력 센서로부터 지정된 압력 신호 발생을 감지하는 동작;상기 센서에 인접된 영역에 배치된 버튼에 의한 접점 연결을 감지하는 동작;상기 센서에 인접된 영역에 배치된 근접 센서로부터 지정된 근접 신호 발생을 감지하는 동작; 중 적어도 하나를포함하는 정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 트리거 신호를 감지하는 동작은상기 센서가 배치된 전자 장치의 움직임 변화가 지정된 움직임 변화인지 감지하는 동작;을 포함하는 정보 운용방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 트리거 신호를 감지하는 동작은 상기 전자 장치의 전면 또는 후면의 방향이 일정 방향으로 일정 횟수 회전 변경되는지 감지하는 동작;을 포함하는 정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 트리거 신호를 감지하는 동작은상기 센서를 일정 주기로 활성화하는 동작;상기 활성화 주기 동안 상기 센서에 물체 접근에 대응하는 센서 신호가 감지되는지 확인하는 동작;을 포함하는공개특허 10-2015-0134552-3-정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 트리거 신호가 감지되면 전자 장치의 상태를 확인하는 동작;상기 전자 장치의 디스플레이 턴-온 상태 또는 전자 장치에서 실행 중인 애플리케이션의 종류에 따라 상기 트리거 신호에 따른 센서를 활성화하거나 또는 비활성화를 유지하도록 제어하는 동작;을 더 포함하는 정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 생체 정보의 저장 또는 전송 중 적어도 하나와 관련한 입력 이벤트를 수신하는 동작;상기 입력 이벤트에 대응하여 상기 생체 정보를 저장 또는 전송하는 동작;을 더 포함하는 정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 입력 이벤트 수신 시 보안 정보 입력창 또는 락 설정 화면 중 적어도 하나를 출력하는 동작;을 더 포함하는 정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,지정된 보안 정보 또는 지정된 락 해제 정보 입력 시 상기 생체 정보를 메모리에 저장하거나 지정된 장치에 전송하는 동작;을 더 포함하는 정보 운용 방법."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "생체 정보 수집을 지원하는 센서 활성화와 관련된 트리거 신호를 감지되면, 상기 센서를 활성화하여 접촉된 물체의 생체 정보를 수집하는 정보 운용 모듈;상기 수집된 생체 정보를 출력하는 디스플레이;를 포함하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 정보 운용 모듈은상기 트리거 신호 감지에 따라 접촉된 물체가 사용자 신체인지 여부를 확인하고, 상기 물체가 사용자 신체인 경우 상기 생체 정보를 수집하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 정보 운용 모듈은상기 센서에 인접된 영역에 배치된 터치 센서로부터 지정된 터치 신호 발생 감지, 상기 센서에 인접된 영역에배치된 압력 센서로부터 지정된 압력 신호 발생 감지, 상기 센서에 인접된 영역에 배치된 버튼에 의한 접점 연결 감지, 상기 센서에 인접된 영역에 배치된 근접 센서로부터 지정된 근접 신호 발생 감지 중 적어도 하나에 따라 상기 센서 활성화를 제어하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,공개특허 10-2015-0134552-4-상기 정보 운용 모듈은상기 센서가 배치된 전자 장치의 움직임 변화가 지정된 움직임으로 변화되는 경우 상기 센서를 활성화하는 전자장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 정보 운용 모듈은상기 전자 장치의 전면 또는 후면의 방향이 지정된 일정 방향으로 일정 횟수 회전하는 경우 상기 센서를 활성화하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 정보 운용 모듈은상기 센서를 일정 주기로 활성화하고 상기 활성화 주기 동안 상기 센서에 물체 접근에 대응하는 센서 신호가 감지되는지 확인하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 정보 운용 모듈은상기 트리거 신호가 감지되면 상기 전자 장치의 디스플레이 턴-온 상태 또는 전자 장치에서 실행 중인 애플리케이션의 종류에 따라 상기 센서를 활성화하거나 또는 비활성화 상태를 유지하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 정보 운용 모듈은상기 생체 정보의 저장 또는 전송 중 적어도 하나와 관련한 입력 이벤트에 대응하여 상기 생체 정보를 저장 또는 전송하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 정보 운용 모듈은상기 입력 이벤트 수신 시 보안 정보 입력창 또는 락 설정 화면 중 적어도 하나가 상기 디스플레이에 출력되도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 정보 운용 모듈은지정된 보안 정보 또는 지정된 락 해제 정보 입력 시 상기 생체 정보를 메모리에 저장하거나 지정된 장치에 전송하도록 제어하는 전자 장치."}
{"patent_id": "10-2014-0061378", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시 예에 따르면, 생체 정보 수집을 지원하는 센서 활성화와 관련된 트리거 신호를 감지하는 동작, 상기 트리거 신호가 감지되면 상기 센서를 활성화하여 접촉된 물체의 생체 정보를 수집하는 동작, 상기 수집된 생체 정보를 출력하는 동작을 포함하는 정보 운용 방법 및 이를 지원하는 전자 장치를 개시한다. 또한 본 발명은 다른 다양한 실시 예도 가능하다."}
{"patent_id": "10-2014-0061378", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시 예는 정보 운용에 관한 것이다."}
{"patent_id": "10-2014-0061378", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 폰(Smart Phone) 및 태블릿(Tablet) 등의 전자 장치는 여러 가지 다양한 애플리케이션들을 통해 사용자 에게 여러 가지 유용한 기능을 제공하고 있다. 이러한 종래 전자 장치는 기능 운용과 관련하여 메뉴나 아이콘 등을 제공하고 있다."}
{"patent_id": "10-2014-0061378", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 종래 전자 장치는 사용하고자 하는 특정 기능 운용과 관련하여 전자 장치의 메뉴 또는 아이콘 목록을 활 성화한 상태에서, 해당 기능을 메뉴 또는 아이콘 목록에서 검색하고, 검색된 기능이 요구하는 다양한 입력 제어 를 수행해야 한다. 이와 같이, 종래 전자 장치는 사용자에게 필요한 기능 운용과 관련하여 해당 기능의 전체적 또는 부분적 운용과 관계없이 복잡한 절차를 요구하는 문제가 있었다. 따라서, 다양한 실시 예는 특정 기능의 부분적 운용과 관련한 절차 처리를 간소화할 수 있는 방법 및 장치를 제 공한다. 또한, 다양한 실시 예는 특정 기능의 부분적 운용과 연계된 전체적 운용을 지원하는 방법 및 장치를 제공한다. 또한, 다양한 실시 예는 특정 기능의 부분적 운용 또는 전체적 운용에서 발생하는 정보의 관리를 장치 관련 정 보 또는 사용자 입력 정보를 기반으로 용이하게 할 수 있는 방법 및 장치를 제공한다."}
{"patent_id": "10-2014-0061378", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시 예에 따르면, 한 실시 예에 따른 정보 운용 방법은 생체 정보 수집을 지원하는 센서 활성화와 관련 된 트리거 신호를 감지하는 동작, 상기 트리거 신호가 감지되면 상기 센서를 활성화하여 접촉된 물체의 생체 정 보를 수집하는 동작, 상기 수집된 생체 정보를 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 생체 정보 수집을 지원하는 센서 활성화와 관련된 트 리거 신호를 감지되면, 상기 센서를 활성화하여 접촉된 물체의 생체 정보를 수집하는 정보 운용 모듈, 상기 수 집된 생체 정보를 출력하는 디스플레이를 포함할 수 있다."}
{"patent_id": "10-2014-0061378", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에서 개시되는 정보 운용 방법 및 전자 장치는 특정 기능의 부분적 운용과 전체적 운용을 선택적 으로 처리할 수 있다. 또한, 다양한 실시 예는 기능 운용에 따라 생성된 정보의 저장과 관리를 사용자 선택에 따라 용이하게 처리할 수 있다. 또한, 다양한 실시 예는 기능 운용에 따라 생성된 정보의 용이한 누적 처리 및 연계성을 지원할 수 있다."}
{"patent_id": "10-2014-0061378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시 예는 다양한 변경 을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들이 도면에 예시되고 관련된 상세한 설명 이 기재되어 있다. 그러나 이는 본 발명의 다양한 실시 예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 다양한 실시 예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명의 다양한 실시 예 가운데 사용될 수 있는 \"포함한다\" 또는 \"포함할 수 있다\" 등의 표현은 개시된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하 지 않는다. 또한 본 발명의 다양한 실시 예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특 징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이 상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시 예에서 \"또는\" 또는 \"A 또는/및 B 중 적어도 하나\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\" 또는 \"A 또는/및 B 중 적어도 하나\" 각각은, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시 예 가운데 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들이 본 발명의 다양한 실시 예 의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해 당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구 분 짓기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시 예의 권리 범위를 벗어나지 않으면서 제1 구 성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시 예에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명의 다양한 실시 예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시 예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미 를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시 예에서 명백하게 정의하지 않 는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시 예에 따른 전자 장치는, 센서 운용을 지원하는 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동전화기(mobile phone), 화상전화기, 전자 북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷 북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head- mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 밴드, 전자 목걸이, 기타 전자 앱세서리(appcessory), 또는 스마트 와치(smartwatch))중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 센서 운용을 지원하는 스마트 가전 제품(smart home appliance)일 수 있 다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉 장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더 (camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다.어떤 실시 예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파 스 등), 항공 전자기기(avionics), 보안 기기, 또는 산업용 또는 가정용 로봇 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 센서 운용을 지원하는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 다양한 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시 예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시 예에서 이용 되는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치) 를 지칭할 수 있다. 도 1은 다양한 실시 예에 따른 정보 운용과 관련한 전자 장치를 개략적으로 도시한다. 도 1을 참조하면, 전자 장치 100은 몸체부 101, 센서 모듈 180, 정보 운용 모듈 170을 포함할 수 있다. 추가적 으로 또는 대체적으로 전자 장치 100은 센서 처리기 190(또는 센서 허브)를 더 포함할 수 있다. 이러한 전자 장치 100은 몸체부 101 일측에 배치된 센서 모듈 180을 이용하여 사용자 생체 정보를 수집할 수 있 다. 예컨대, 전자 장치 100은 센서 모듈 180을 이용하여 사용자의 심박 정보, 산소포화도 정보, 혈류량 정보, 맥파 정보 등 생체 정보를 수집할 수 있다. 전자 장치 100은 수집한 생체 정보를 디스플레이 등을 통해 출력할 수 있다. 상술한 전자 장치 100은 생체 정보 관련 다양한 애플리케이션이 설치된 상태에서 생체 정보의 부분적 운용(예: 생체 정보 수집 및 출력 기능)과 전체적 운용(예: 생체 정보 기반으로 제공되는 건강 관련 서비스 정보 제공, 생체 정보 누적에 따른 건강 스케줄 관리, 생체 정보 기반의 환자 관리 서비스 등)을 선택적으로 처리하도록 지 원할 수 있다. 예컨대, 전자 장치 100은 지정된 이벤트가 발생하면 해당 이벤트를 생체 정보 수집과 관련한 트 리거 신호로 인식하고, 센서 모듈 180을 운용하여 사용자 생체 정보 수집 가능 여부를 결정할 수 있다. 전자 장 치 100은 생체 정보 수집이 가능한 경우로 판단되면, 센서 모듈 180을 이용하여 생체 정보 수집 및 출력을 지원 할 수 있다. 이 동작에서 전자 장치 100은 생체 정보 수집과 관련한 전체적 기능(예: 생체 정보 수집, 출력, 저 장, 또는 전송과 관련한 전체 기능)을 운용하지 않고, 생체 정보 수집과 출력 기능만을 지원할 수 있다. 이와 관련하여, 전자 장치 100은 생체 정보 수집 또는 출력 기능만을 지원하는 부분적 기능을 지원하도록 마련된 프 로그램 모듈을 기반으로 해당 기능을 지원할 수 있다. 추가적으로 또는 대체적으로 상기 전자 장치 100은 생체 정보 저장과 관련한 요청이 발생하면, 생체 정보를 사 용자 색인 정보(예: 전자 장치의 전화 번호 등)를 기반으로 누적 저장하고, 이를 기반으로 다양한 생체 정보 관 련 서비스를 제공할 수 있다. 상술한 바와 같이 전자 장치 100은 생체 정보 확인 등의 생체 정보 부분적 운용을 보다 용이하고 간단하게 처리할 수 있도록 지원하며, 추가로 생체 정보 관련 다양한 서비스 이용 또한 간편하게 이용할 수 있도록 지원한다. 이 동작에서 전자 장치 100은 생체 정보 관련 기능 전체를 운용하도록 마련된 프로 그램 모듈을 운용할 수 있다. 또는 전자 장치 100은 생체 정보 수집 또는 출력 기능과 관련한 프로그램 모듈 운 용에 따라 생체 정보를 전달 받아 저장 또는 전송을 처리하는 프로그램 모듈을 운용할 수 있다. 몸체부 101은 예컨대, 일정 두께와 폭을 가지며 금속 또는 비금속 중 적어도 하나의 재질로 형성될 수 있다. 몸 체부 101은 내부에 다양한 전자 장치 요소들(예: 정보 운용 모듈 170, 센서 처리기 190, 프로세서, 인쇄회로기 판 등)이 배치될 수 있다. 한 실시 예에 따르면, 몸체부 101 전면에는 디스플레이가 배치될 수 있다. 디스플레 이는 센서 모듈 180 운용과 관련한 다양한 정보가 표시될 수 있다. 몸체부 101 일측 예컨대 후면 일측에는 센서 모듈 180이 배치될 수 있다. 다양한 실시 예에 따르면, 몸체부 101의 측면부(예: 상하좌우 측면 중 적어도 하나)나 전면부(예: 디스플레이 가장자리 중 적어도 하나의 영역) 중 적어도 하나에 센서 모듈 180이 배치될 수 도 있다. 센서 모듈 180은 상술한 바와 같이 몸체부 101 일측 중 적어도 한 곳에 적어도 하나가 배치될 수 있다. 도시된 도면에서는 센서 모듈 180이 몸체부 101의 후면 상단 중앙부에 하나가 배치된 형태를 예시한 것이다. 한 실시예에 따르면, 센서 모듈 180은 생체 정보 수집과 관련한 특정 센서(예: 발광부 182 또는 포토다이오드 184를 포 함하는 심박 센서)를 포함할 수 있다. 발광부 182는 지정된 특정 주파수 대역의 광을 조사할 수 있다. 포토다이 오드 184는 발광부 182에서 조사된 광을 수집한다. 포토다이오드 184는 수광량을 측정하여 전자 장치 100의 센 서 처리기 190 또는 정보 운용 모듈 170 중 적어도 하나에 제공할 수 있다. 한 실시 예에 따르면, 사용자의 손 가락 등의 신체 부위가 발광부 182와 포토다이오드 184를 포함하는 심박 센서 183이 배치된 센서 모듈 180 영역 을 덮도록 배치된 후, 발광부 182에서 조사된 광은 사용자 신체 부위 일부를 투과한 후 반사되어 포토다이오드 184에 전달될 수 있다. 다양한 실시 예에 따르면, 센서 모듈 180은 심박 센서 183(예: 발광부 182, 포토다이오드 184), 또는 가드 185 를 포함할 수 있다. 가드 185는 발광부 182와 포토다이오드 184 사이에 일정 높이와 폭을 가지며 배치될 수 있 다. 가드 185는 발광부 182에서 조사된 광이 포토다이오드 184에 직접적으로 조사되는 것을 방지하는 역할을 수 행할 수 있다. 가드 185는 발광부 182를 형성하는 램프의 높이 이상의 크기를 가질 수 있다. 이에 따라, 센서 모듈 180은 발광부 182에서 조사된 광들 중 사용자 신체 부위를 거쳐 포토다이오드 184에 광이 전달됨에 따라 보다 정확한 생체 정보 획득을 지원할 수 있다. 다양한 실시 예에 따르면, 센서 모듈 180은 심박 센서 183(예: 발광부 182, 포토다이오드 184), 가드 185, 또는 트리거 신호 수집과 관련한 특정 센서(예: 터치 센서 181)을 포함할 수 있다. 터치 센서 181은 발광부 182, 포 토다이오드 184 또는 가드 185 중 적어도 하나를 감싸도록 배치될 수 있다. 도시된 도면에서 터치 센서 181은 발광부 182, 포토다이오드 184와 가드 185 전체를 감싸도록 배치된 형태를 예시한 것이다. 실시 예에 따라서, 터치 센서 181은 발광부 182, 포토다이오드 184, 또는 가드 185 중 적어도 하나를 감싸도록 배치될 수 있다. 또 는 터치 센서 181은 발광부 182, 포토다이오드 184, 또는 가드 185에 지정된 거리 이내의 인접된 영역에 배치될 수 있다. 터치 센서 181은 사용자의 신체 부위 중 적어도 일부가 센서 모듈 180에 접촉되는 것을 감지하는 트리 거 역할을 수행할 수 있다. 터치 센서 181은 사용자 신체부위가 접촉되면 그에 대응하는 이벤트(예: 트리거 신 호)를 센서 모듈 180, 센서 처리기 190, 또는 정보 운용 모듈 170 중 적어도 하나에 전달할 수 있다. 다양한 실시 예에 따르면, 터치 센서 181은 일정 크기 이상의 압력이 제공되는 경우를 감지하는 압력식 센서, 전하량 변화를 감지하는 정전용량 방식 센서, 유기체의 접촉에 따라 전류 변화를 감지하는 전류 변화 감지 센서, 입정 크기 이상의 압력 제공에 따라 분리된 접점이 연결되는 스위치 방식 센서, 또는 물체의 근접도에 따 라 전기적 변화를 감지하는 근접 센서 중 적어도 하나를 포함할 수 있다. 상술한 터치 센서 181 또는 다양한 센 서들은 센서 모듈 180 활성화와 관련한 트리거 신호(예: 지정된 크기의 압력 감지에 대응하는 이벤트, 전기적 변화 감지에 대응하는 이벤트, 물리적 변화 감지에 대응하는 이벤트 등)를 물체의 접근 또는 접촉, 가압 등에 따라 생성할 수 있다. 상기 생성된 트리거 신호는 센서 모듈 180, 센서 처리기 190, 또는 정보 운용 모듈 170 중 적어도 하나에 전달될 수 있다. 다양한 실시 예에 따르면, 트리거 신호의 수집과 관련하여, 터치 센서 181 등을 포함하지 않는 센서 모듈 180은 정보 운용 모듈 170 등의 제어에 대응하여 지정된 주기(예: 실시간 또는 일정 주기)로 발광부 182의 광 조사를 수행할 수 있다. 이 경우, 상기 트리거 신호는 포토다이오드 184가 수집 하는 광 변화량이 지정된 변화 값을 가지는 경우를 포함할 수 있다. 정보 운용 모듈 170은 센서 모듈 180에 포함된 발광부 182, 포토다이오드 184 또는 터치 센서 181 등의 제어를 수행할 수 있다. 한 실시 예에 따르면, 정보 운용 모듈 170은 전자 장치 100의 전원을 터치 센서 181에 제공하 여 물체 접근 또는 접촉에 따른 전기적 변화를 확인할 수 있다. 정보 운용 모듈 170은 전기적 변화가 지정 값 이상인 경우, 센서 모듈 180을 활성화하여 상기 물체가 사용자 신체부위인지 확인할 수 있다. 예컨대, 정보 운 용 모듈 170은 센서 모듈 180이 수집한 센서 신호(예: 광 변화량)를 확인하여 지정된 값(예: 사용자 손가락 등 의 접촉에 대응하는 광 변화량)에 대응하는지 확인할 수 있다. 정보 운용 모듈 170은 센서 모듈 180으로부터 지 정된 값이 수신되면, 생체 정보(예: 심박 정보) 검출을 위한 센서 모듈 180 제어를 수행할 수 있다. 예컨대, 정 보 운용 모듈 170은 심박 정보 검출과 관련한 광 조사를 제어할 수 있다. 정보 운용 모듈 170은 수집된 생체 정 보의 결과가 디스플레이 등을 통하여 출력되도록 제어할 수 있다. 한 실시 예에 따르면, 정보 운용 모듈 170은 터치 센서 181 등으로부터 지정된 전기적 변화가 수신되지 않으면 터치 센서 181의 물체 접근 또는 접촉 감지를 유지하도록 제어할 수 있다. 정보 운용 모듈 170은 센서 모듈 180 이 활성화되면, 터치 센서 181 등을 비활성화하도록 제어할 수 있다. 또한, 정보 운용 모듈 170은 센서 모듈 180에 의해 사용자 신체부위 확인이 수행되는 동안 터치 센서 181을 비활성화하도록 제어할 수 있다. 정보 운용 모듈 170은 사용자 신체 부위 접촉(예: 사용자 손가락 접촉)이 확인되면 터치 센서 181 등의 비활성화 상태를 유지하도록 제어하면서, 센서 모듈 180을 이용한 생체 정보 수집을 제어할 수 있다. 정보 운용 모듈 170은 사용 자 신체 부위 접촉이 아닌 경우, 센서 모듈 180을 비활성화하도록 제어하고, 터치 센서 181 등을 활성화 상태로변경할 수 있다. 이 동작에서 정보 운용 모듈 170은 지정된 시간 동안 터치 센서 181의 비활성화와 활성화 동작 이 일정 횟수 이상 반복적으로 발생하는 경우, 지정된 시간 동안 터치 센서 181을 비활성화하거나 또는 터치 센 서 181의 활성화 주기를 변경할 수 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 터치 센서 181의 비활성화 이후 센서 모듈 180으로부터 사용자 신체부위가 아닌 물체 접근 또는 접촉에 해당하는 센서 신호가 수신되면, 터치 센서 181을 비활성화하도록 제어 할 수도 있다. 정보 운용 모듈 170은 일정 시간 경과 후 터치 센서 181을 활성화하여 물체 접근 또는 접촉 여부 를 확인할 수 있다. 정보 운용 모듈 170은 일정 시간 경과 후에도 사용자 신체 부위가 아닌 물체 접근 또는 접 촉이 발생하면, 지정된 시간을 조정(예: 터치 센서 181 비활성화 시간 크기를 늘림)하도록 제어할 수 있다. 정 보 운용 모듈 170은 사용자 신체 부위 접근 또는 접촉으로 판단되면, 터치 센서 181의 활성화 주기 또는 비활성 화 주기를 초기화하도록 제어할 수 있다. 상기 정보 운용 모듈 170은 상기 터치 센서 181의 활성화 또는 비활성 화 주기 변경을 센서 모듈 180의 생체 정보 수집과 관련한 다양한 센서들 중 적어도 하나에 적용되도록 제어할 수 있다. 정보 운용 모듈 170은 센서 모듈 180의 발광부 182를 지정된 주기(예: 수밀리 초 또는 수초 주기)로 운용하면서, 지정된 기준 값(예: 물체 접근 또는 접촉에 대응하는 광 변화량)에 대응하는 센서 신호가 수집되는 지 확인할 수 있다. 정보 운용 모듈 170은 지정된 기준 값에 대응하는 센서 신호가 수집되면, 해당 물체가 사용 자 신체 부위인지 확인할 수 있다. 정보 운용 모듈 170은 해당 물체가 사용자 신체부위이면 생체 정보 검출을 위한 센서 모듈 180 운용을 제어할 수 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 지정된 기준 값에 대응하는 센서 신호가 수집되지 않으면 지정 된 주기로 센서 모듈 180을 운용하여 물체 접근 또는 접촉을 감지할 수 있다. 정보 운용 모듈 170은 지정된 기 준 값에 대응하는 센서 신호가 수집되면, 센서 모듈 180을 사용자 신체부위 접근 또는 접촉 여부를 확인하는데 이용할 수 있다. 정보 운용 모듈 170은 센서 모듈 180으로부터 제공된 센서 신호 값이 지정된 값(예: 사용자 신 체 부위 접근 또는 접촉에 대응하는 센서 신호 값)인 경우 센서 모듈 180을 생체 정보 수집에 이용할 수 있다. 정보 운용 모듈 170은 센서 신호 값이 지정된 값과 다른 경우(예: 사용자 신체 부위 접근 또는 접촉이 아닌 경 우에 해당하는 센서 신호 값이 수신된 경우) 정보 운용 모듈 170은 센서 모듈 180을 지정된 주기로 운용하도록 제어할 수 있다. 예컨대, 정보 운용 모듈 170은 물체 접근 또는 접촉을 확인하는데 운용할 수 있다. 또는 정보 운용 모듈 170은 센서 신호 값이 지정된 값과 다른 경우 지정된 시간 동안 센서 모듈 180을 비활성화하도록 제 어하고, 시간 경과 후 센서 모듈 180을 활성화하도록 제어할 수 있다. 또는 정보 운용 모듈 170은 사용자 신체 부위가 아닌 물체 접근 또는 접촉 감지가 지정된 횟수 이상 반복되는 경우 센서 모듈 180을 지정된 시간 동안 비활성화하도록 제어할 수도 있다. 센서 처리기 190은 센서 모듈 180과 직접적으로 연결될 수 있다. 예컨대, 센서 처리기 190은 센서 모듈 180과 프로세서 120 또는 센서 모듈 180과 정보 운용 모듈 170 사이에 배치될 수 있다. 센서 처리기 190은 센서 모듈 180 운용과 관련한 정보를 포함할 수 있다. 센서 처리기 190은 센서 모듈 180 활성화 또는 비활성화와 관련한 제어를 프로세서 또는 정보 운용 모듈 170과 독립적으로 처리할 수 있다. 이러한 센서 처리기 190은 트리거 신 호 수집과 관련하여, 터치 센서 181 등의 센서를 턴-온 상태로 유지하거나 일정 주기로 활성화 또는 비활성화하 도록 제어할 수 있다. 센서 처리기 190은 센서 모듈 180의 트리거 신호 수집과 관련하여, 센서 모듈 180을 활성 화 또는 비활성화되도록 제어할 수 있다. 센서 처리기 190은 트리거 신호가 수신되면 프로세서 또는 정보 운용 모듈 170에 전달할 수 있다. 상술한 동작을 기반으로 센서 처리기 190은 센서 모듈 180 운용과 관련하여 정보 운용 모듈 170 또는 프로세서와 관련한 AP(Application Processor)를 깨우지 않은 상태로 센서 모듈 180의 부분 적 운용을 지원할 수 있다. 다양한 실시 예에 따르면, 센서 처리기 190은 트리거 신호의 수집과, 센서 모듈 180 이 수집한 생체 정보의 출력까지 담당하도록 설계될 수도 있다. 상술한 바와 같이, 전자 장치 100은 트리거 신호(예: 터치 센서 181 등의 센서가 물체 접촉을 감지한 신호, 또 는 센서 모듈 180이 물체 접촉을 감지한 신호)가 수신되면, 사용자 신체인지 여부를 확인하기 위해 센서 모듈 180을 운용할 수 있다. 전자 장치 100은 사용자 신체 접촉으로 판단되면 센서 모듈 180을 기반으로 생체 정보를 수집하여 출력하는 센서 모듈 180과 관련한 기능의 부분적 운용을 지원할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 생체 정보 출력 이후 사용자 제어(예: 생체 정보 저장 또는 전송 등)와 관련한 입력 이벤트가 발생하면, 생체 정보와 관련한 애플리케이션을 활성화할 수 있다. 전자 장치 100은 활성화된 애플리케이션 및 생체 정보를 기반으로 지정된 특정 서비스를 제공하는 센서 모듈 180과 관련한 기능의 전체적 운용을 지원할 수 있다. 도 2는 다양한 실시 예에 따른 정보 운용을 수행하는 전자 장치 정보 운용 시스템을 도시한다. 도 2를 참조하면, 한 실시 예에 따르면, 정보 운용 시스템 10은 전자 장치 100, 외부 전자 장치 102, 104, 서버 장치 서버 장치 106, 네트워크 162를 포함할 수 있다. 상술한 정보 운용 시스템 10에서 네트워크 162는 전자 장치 100과 전자 장치 104 사이의 통신 채널을 형성할 수 있다. 네트워크 162는 예컨대 이동통신 채널 형성과 관련한 네트워크 장치 요소들을 포함할 수 있다. 또는 네트 워크 162는 인터넷 통신 채널 형성과 관련한 네트워크 장치 요소들을 포함할 수 있다. 네트워크 162는 전자 장 치 100과 전자 장치 104 간의 데이터 송수신을 지원할 수 있다. 또한 네트워크 162는 전자 장치 100과 서버 장 치 서버 장치 106과의 데이터 송수신을 지원할 수 있다. 한 실시 예에 따르면, 네트워크 162는 전자 장치 100이 수집한 생체 정보를 서버 장치 서버 장치 106에 전달할 수 있다. 또는 네트워크 162는 전자 장치 100이 수집한 생체 정보를 전자 장치 104에 전달할 수 있다. 서버 장치 106은 네트워크 162를 통하여 전자 장치 100 또는 전자 장치 104와 통신 채널을 형성할 수 있다. 한 실시 예에 따르면, 서버 장치 106은 전자 장치 100의 특정 애플리케이션 운용과 관련한 데이터를 제공할 수 있 다. 예컨대, 서버 장치 106은 생체 정보 관련 데이터(예: 생체 정보에 따른 약 투여 정보, 생체 정보에 따른 생 체 상태에 대한 정보, 생체 정보에 따라 처치 정보, 생체 정보에 따른 건강 관리 정보(예: 식단 정보, 운동 스 케줄 정보 등))를 전자 장치 100 또는 외부 전자 장치 104 등에 제공할 수 있다. 다양한 실시 예에 따르면, 서버 장치 106은 생체 정보 관련 서비스 지원을 위하여 정보 처리 모듈 107, 정보 저 장 모듈 109를 포함할 수 있다. 정보 처리 모듈 107은 전자 장치 100의 통신 연결 요청에 대응하여 통신 채널이 형성되도록 제어할 수 있다. 정보 처리 모듈 107은 전자 장치 100이 제공하는 생체 정보가 정보 저장 모듈 109 에 저장되도록 제어할 수 있다. 정보 처리 모듈 107은 제공되는 서비스 형태에 따라, 생체 정보에 기반한 특정 정보 예컨대 생체 관련 정보 또는 건강 관리 정보 중 적어도 하나가 전자 장치 100에 전송되도록 제어할 수 있 다. 정보 저장 모듈 109는 전자 장치 100이 제공하는 생체 정보를 저장할 수 있다. 이 동작에서 정보 저장 모듈 109 는 생체 정보를 전자 장치 100의 색인 정보와 함께 저장할 수 있다. 상기 색인 정보는 전자 장치 100의 전화 번 호 정보, 전자 장치 100 사용자 이름 또는 별명 정보, 사용자가 등록한 특정 문자 정보, 전자 장치 100의 하드 웨어 식별 정보(예: MAC 주소 정보, 시리얼 정보 등) 중 적어도 하나를 포함할 수 있다. 정보 저장 모듈 109는 생체 정보를 시간별로 누적하여 저장할 수 있다. 정보 저장 모듈 109는 누적된 생체 정보를 리스트 또는 그래프 형태로 제공할 수 있다. 생체 정보를 전화번호 별로 관리하는 경우, 서버 장치 106은 사용자의 전자 장치가 변 경되더라도 전화번호가 유지되는 경우 연속성 있는 생체 정보 관련 서비스를 제공할 수 있다. 서버 장치 106은 전자 장치 100의 생체 정보 저장과 관련하여 등록 동작을 지원할 수 있다. 예컨대, 서버 장치 106은 전자 장치 100에 등록에 필요한 사용자 정보를 입력하는 서버 페이지(또는 웹 페이지)를 제공할 수 있다. 서버 장치 106은 전자 장치 100으로부터 사용자 정보가 수집되면, 해당 정보를 등록하고, 전자 장치 100이 제공 하는 정보를 정보 저장 모듈 109에 저장할 수 있다. 서버 장치 106은 정보 저장 모듈 109에 저장되는 생체 정보 를 바탕으로 특정 생체 정보 관련 서비스(예: 현재 생체 상태 또는 누적 생체 정보에 따라 지정된 건강 관련 유 용한 정보를 제공하는 서비스)를 제공할 수 있다. 전자 장치 102는 전자 장치 100의 통신 인터페이스 160과 통신 채널을 형성할 수 있다. 예컨대, 전자 장치 102 는 통신 인터페이스 160과 근거리 통신 채널 또는 유선 통신 채널을 형성할 수 있다. 한 실시 예에 따르면, 전 자 장치 102는 통신 인터페이스 160과 블루투스 통신 채널 또는 와이파이다이렉트 통신 채널 등을 형성할 수 있 다. 전자 장치 104는 네트워크 162를 통하여 전자 장치 100과 통신 채널을 형성할 수 있다. 예컨대, 전자 장치 104는 셀룰러 통신 모듈을 포함하고, 전자 장치 100과 이동통신 채널을 형성할 수 있다. 또는 전자 장치 104는 와이파이 통신 모듈을 포함하고, 전자 장치 100과 와이파이 통신 채널을 형성할 수 있다. 다양한 실시 예에 따르면, 전자 장치 102, 또는 104는 전자 장치 100으로부터 특정 생체 정보를 수신할 수 있다. 예컨대, 전자 장치 102 또는 104는 전자 장치 100에서 측정된 생체 정보를 사용자 제어에 대응하여 수신 할 수 있다. 한 실시 예에 따르면, 전자 장치 102 또는 104 사용자가 전자 장치 100을 이용하여 생체 정보를 측 정하고, 측정된 생체 정보를 전자 장치 102 또는 104에 전송하도록 전자 장치 100을 운용할 수 있다. 전자 장치 102 또는 104는 전자 장치 100으로부터 수신된 생체 정보를 시간 및 색인 정보를 기준으로 누적 저장할 수 있다. 전자 장치 102 또는 104는 저장된 생체 정보를 서버 장치 106에 제공할 수 있다. 전자 장치 102 또는 104 는 서버 장치 106으로부터 생체 정보와 관련한 서비스 정보를 수신하여 저장 또는 출력할 수 있다.전자 장치 100은 생체 정보 수집과 관련한 센서 모듈 180을 포함할 수 있다. 전자 장치 100은 센서 모듈 180을 지정된 트리거 신호 발생에 대응하여 활성화할 수 있다. 전자 장치 100은 활성화된 센서 모듈 180을 이용하여 사용자 신체 접촉(또는 센서 모듈 180과 지정된 거리 이내 접근) 여부를 확인하고, 사용자 신체 접촉 시 생체 정보를 감지하여 출력, 저장, 또는 전송 중 적어도 하나를 처리할 수 있다. 생체 정보 전송 시 전자 장치 100은 전자 장치 102, 104, 또는 서버 장치 106 중 적어도 하나와 통신 채널을 형성할 수 있다. 도 2를 참조하면, 상기 전자 장치 100은 버스 110, 프로세서 120, 메모리 130, 입출력 인터페이스 140, 디스플 레이 150, 통신 인터페이스 160, 정보 운용 모듈 170 및 센서 모듈 180을 포함할 수 있다. 추가적으로 또는 대 체적으로 전자 장치 100은 센서 처리기 190을 더 포함할 수 있다. 상기 버스 110은 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지, 입력 이 벤트, 데이터 등의 전달)을 수행하는 회로일 수 있다. 예컨대, 버스 110은 입출력 인터페이스 140에서 입력된 입력 신호를 프로세서 120 또는 정보 운용 모듈 170 중 적어도 하나에 전달할 수 있다. 또한 버스 110은 프로세 서 120 또는 정보 운용 모듈 170의 제어 신호를 메모리 130 에 전달할 수 있다. 한 실시 예에 따르면, 버스 110 은 센서 모듈 180 활성화와 관련한 트리거 신호를 정보 운용 모듈 170(또는 프로세서 120, 센서 처리기 190 등)에 전달할 수 있다. 버스 110은 센서 모듈 180이 수집한 센서 신호를 정보 운용 모듈 170에 전달할 수 있다. 버스 110은 정보 운용 모듈 170의 제어에 대응하여 생체 정보를 메모리 130에 전달하거나, 통신 인터페이스 160 에 전달할 수 있다. 버스 110은 수집된 생체 정보를 디스플레이 150에 전달할 수 있다. 상기 프로세서 120은, 예를 들면, 상기 버스 110을 통해 전술한 다른 구성요소들(예: 상기 메모리 130, 상기 입 출력 인터페이스 140, 상기 디스플레이 150, 상기 통신 인터페이스 160, 센서 처리기 190, 또는 상기 정보 운용 모듈 170 등)로부터 명령을 수신하여, 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실 행할 수 있다. 이러한 프로세서 120은 정보 운용 모듈 170 또는 센서 처리기 190 중 적어도 하나를 포함하는 형 태로 마련되거나 또는 정보 운용 모듈 170 또는 센서 처리기 190과 독립적인 형태로 마련되고, 버스 110을 기반 으로 또는 직접적으로 메모리 130와 디스플레이 150을 제어하는 형태로 마련될 수 있다. 프로세서 120은 다양한 실시 예에 따른 트리거 신호 수집 상태 제어(예: 터치 센서 181 등의 활성화 또는 비활성화, 센서 모듈 180의 활성화 또는 비활성화 등의 제어), 사용자 신체 접촉 여부 확인, 생체 정보의 수집, 수집된 생체 정보와 관련한 정보 출력, 생체 정보의 전송, 생체 정보 관련 서비스 정보 수신 처리 등을 지원할 수 있다. 상기 메모리 130은, 상기 프로세서 120 또는 다른 구성요소들(예: 상기 입출력 인터페이스 140, 상기 디스플레 이 150, 상기 통신 인터페이스 160, 센서 처리기 190, 또는 상기 정보 운용 모듈 170 등)로부터 수신되거나 상 기 프로세서 120 또는 다른 구성요소들에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 상기 메모리 130은, 예를 들면, 커널 131, 미들웨어 132, 애플리케이션 프로그래밍 인터페이스(API: application programming interface) 133 또는 애플리케이션 134 등의 프로그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 상기 커널 131은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어 132, 상기 API 133 또는 상기 애플 리케이션 134에 구현된 동작 또는 기능을 실행하는데 사용되는 시스템 리소스들(예: 상기 버스 110, 상기 프로 세서 120 또는 상기 메모리 130, 스토리지 180, 정보 운용 모듈 170 등)을 제어 또는 관리할 수 있다. 또한, 상 기 커널 131은 상기 미들웨어 132, 상기 API 133 또는 상기 애플리케이션 134에서 상기 전자 장치 100의 개별 구성요소에 접근하여 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어 132는 상기 API 133 또는 상기 애플리케이션 134가 상기 커널 131과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어 132는 상기 애플리케이션 134로부터 수신된 작업 요청들과 관련하여, 예를 들면, 상기 애플리케이션 134 중 적어도 하나의 애플리케이션에 상기 전자 장치 100의 시스템 리소스(예: 상기 버스 110, 상기 프로세서 120 또는 상기 메모리 130, 정보 운용 모듈 170, 센서 처리기 190 등)를 사용할 수 있는 우선순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또 는 로드 밸런싱)을 수행할 수 있다. 상기 API 133은 상기 애플리케이션 134가 상기 커널 131 또는 상기 미들웨어 132에서 제공되는 기능을 제어하기 위한 인터페이스일 수 있다. API 133은 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 애플리케이션 134는 SMS/MMS 애플리케이션, 이메일 애플리케이션, 달력 애플리 케이션, 알람 애플리케이션, 건강 관리(health care) 애플리케이션(예: 운동량 또는 혈당 등을 측정하는 애플리케이션) 또는 환경 정보 애플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 애플리케이션) 등을 포함 할 수 있다. 추가적으로 또는 대체적으로, 상기 애플리케이션 134는 상기 전자 장치 100과 외부 전자 장치(예: 전자 장치 102, 104) 사이의 정보 교환과 관련된 애플리케이션일 수 있다. 상기 정보 교환과 관련된 애플리케이 션은, 예를 들어, 상기 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 애플리케 이션, 또는 상기 외부 전자 장치를 관리하기 위한 장치 관리(device management) 애플리케이션을 포함할 수 있 다. 예를 들면, 상기 알림 전달 애플리케이션은 상기 전자 장치 100 의 다른 애플리케이션(예: SMS/MMS 애플리케이 션, 이메일 애플리케이션, 건강 관리 애플리케이션 또는 환경 정보 제공 애플리케이션 등)에서 발생한 알림 정 보를 외부 전자 장치(예: 전자 장치 102, 104)로 전달하는 기능을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 알림 전달 애플리케이션은, 예를 들면, 외부 전자 장치(예: 전자 장치 102, 104)로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 상기 장치 관리 애플리케이션은, 예를 들면, 상기 전자 장치 100 과 통신하는 외부 전자 장치(예: 전자 장치 102, 104)의 적어도 일부에 대한 기능(예: 외부 전자 장치 자체(또 는, 일부 구성 부품)의 턴온/턴오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 상기 외부 전자 장치에서 동 작하는 애플리케이션 또는 상기 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제 또는 업데이트)할 수 있다. 다양한 실시 예에 따르면, 외부 전자 장치가 MP3 플레이어인 경우, 상기 애플리케이션 134는 음악 재생과 관련된 애플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장치 가 모바일 의료기기인 경우, 상기 애플리케이션 134는 건강 관리와 관련된 애플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 상기 애플리케이션 134는 생체 정보 관련 기능을 지원할 수 있다. 예컨대, 애플리케이션 134는 트리거 신호 발생에 대응하여 생체 정보 135를 수집하고, 수집된 생체 정보 135를 디스플레이 150 등에 출력하는 기능을 제공할 수 있다. 애플리케이션 134는 수집된 생체 정보를 외부 전자 장치(예: 전자 장치 102, 104) 또는 서버 장치 106에 전송하는 기능을 제공할 수 있다. 애플리케이션 134는 서버 장치 106 등으로부터 생 체 정보와 관련한 서비스 정보를 수신하고, 이를 저장하거나 출력하는 기능을 제공할 수 있다. 애플리케이션 134는 트리거 신호 수집과 관련한 터치 센서 181 또는 센서 모듈 180 중 적어도 하나의 설정을 조정하는 기능과, 센서 모듈 180 기반의 사용자 신체 접촉 여부를 확인하는 기능을 제공할 수 있다. 다양한 실시 예에 따르면, 애플리케이션 134는 통합 애플리케이션 형태로 마련될 수 있다. 예컨대, 애플리케이 션 134는 생체 정보 수집과 출력 기능을 지원하는 제1 프로그램 모듈과, 수집된 생체 정보 135의 저장과 전송 및 생체 정보와 관련한 서비스 정보의 수신과 처리를 지원하는 제2 프로그램 모듈을 포함할 수 있다. 상술한 제 1 프로그램 모듈은 생체 정보 수집과 관련하여 제1 프로그램 모듈이 메모리 130에 배치되어 생체 정보 수집 및 출력 기능을 지원할 수 있다. 제2 프로그램 모듈은 제1 프로그램 모듈 운용 중에 생체 정보 135 저장 또는 전송 과 관련한 요청이 발생하면 메모리 130에 배치될 수 있다. 생체 정보 135 저장 또는 전송 관련 기능이 완료 또 는 종료되면 제2 프로그램 모듈 기반의 기능을 종료되고, 메모리 반환이 수행될 수 있다. 다양한 실시 예에 따르면, 제1 프로그램 모듈 중 트리거 신호 처리와 관련한 제1 서브 프로그램 모듈이 메모리 130에 배치되어 운용될 수 있다. 지정된 트리거 신호가 수집되면, 제1 프로그램 모듈 중 사용자 신체 접촉 여부 확인과 관련한 제2 서브 프로그램 모듈, 생체 정보 수집과 관련한 제3 서브 프로그램 모듈, 생체 정보 출력과 관련한 제4 서브 프로그램 모듈 중 적어도 하나가 메모리 130에 배치되어 운용될 수 있다. 다양한 실시 예에 따 르면, 상기 트리거 신호 처리와 관련한 제1 서브 프로그램 모듈은 센서 처리기 190(예: 센서 허브)에 임베이디 드 형태로 배치될 수 있다. 상기 입출력 인터페이스 140은, 입출력 장치(예: 센서, 키보드 또는 터치스크린)를 통하여 사용자로부터 입력된 명령 또는 데이터를, 예를 들면, 상기 버스 110을 통해 상기 프로세서 120, 상기 메모리 130, 상기 통신 인터페 이스 160, 또는 상기 정보 운용 모듈 170, 또는 센서 처리기 190 등에 전달할 수 있다. 또한, 상기 입출력 인터 페이스 140은, 예를 들면, 상기 버스 110을 통해 상기 프로세서 120, 상기 메모리 130, 상기 통신 인터페이스 160, 상기 정보 운용 모듈 170, 또는 센서 처리기 190 등으로부터 수신된 명령 또는 데이터를 상기 입출력 장치 (예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 다양한 실시 예에 따르면, 입출력 인터페이스 140은 물리 키 버튼(예: 홈 키, 사이드 키, 전원 키 등), 죠그 키, 키패드 등을 포함할 수 있다. 입출력 인터페이스 140은 디스플레이 150에 출력되는 가상 키패드를 입력 장치로 포함할 수 있다. 입출력 인터페이스 140은 적어도 하나의 애플리케이션 실행과 관련한 입력 신호, 전원-오프된 전자 장치 100의 전원 공급을 요청하는 입력 신호 등을 생성할 수 있다. 다양한 실시 예에 따르면, 입출력 인터페이스 140은 터치 센서 181 등의 활성화 또는 비활성화와 관련한 입력 신호를 생성할 수 있다. 또는 입출력 인터페이스 140 중 적어도 일부 버튼은 터치 센서 181을 대체하여 센서 모 듈 180에 인접된 영역에 배치될 수 있다. 다양한 실시 예에 따르면, 입출력 인터페이스 140은 수집된 생체 정보 135의 저장을 요청하는 입력 이벤트, 생체 정보의 전송을 요청하는 입력 이벤트 등을 사용자 제어에 대응하여 생성할 수 있다. 다양한 실시 예에 따르면, 입출력 인터페이스 140은 오디오 처리와 관련한 기능을 수행할 수 있다. 이와 관련하 여 입출력 인터페이스 140은 스피커 및 마이크 중 적어도 하나를 단수 개 또는 복수 개 포함할 수 있다. 입출력 인터페이스 140은 예를 들면, 상기 정보 운용 모듈 170의 제어에 따라 특정 애플리케이션 실행과 관련한 오디오 데이터를 스피커를 통하여 출력할 수 있다. 상기 디스플레이 150은 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)를 표시할 수 있다. 예컨대, 디스플레이 150은 락 스크린, 대기 화면 등을 출력할 수 있다. 디스플레이 150은 특정 기능 수행 화면 예컨대 음원 재생 화면, 동영상 재생 화면, 방송 수신 화면 등을 기능 수행에 대응하여 출력할 수 있다. 한 실시 예에 따르면, 디스플레이 150은 애플리케이션의 데이터 처리 방식과 관련한 화면을 출력할 수 있다. 예를 들어, 디스 플레이 150은 전자 장치 100의 슬립 상태(예: 디스플레이 150 전원이 차단된 상태, 전자 장치 100의 프로세서 120 처리량이 일정 값 이하로 제한된 상태 등)에서 턴-오프된 화면을 가질 수 있다. 디스플레이 150은 턴-오프 된 화면 상태에서 트리거 신호 발생에 대응하여 지정된 일정 이미지나 텍스트 중 적어도 하나를 출력할 수 있다. 다양한 실시 예에 따르면, 디스플레이 150은 락(lock)이 설정된 경우 락스크린(lock-screen)을 출력할 수 있다. 디스플레이 150은 락스크린 상에 생체 정보 수집과 관련한 이미지 또는 텍스트 중 적어도 하나를 출력할 수 있다. 다양한 실시 예에 따르면, 디스플레이 150은 락이 해제된 경우 락 해제 화면(예: 대기 화면, 홈 화면, 지정된 특정 기능 화면, 실행 요청된 기능의 실행 화면 등)을 출력할 수 있다. 디스플레이 150은 락 해제된 상 태에서 출력 중인 화면에 대응하여 지정된 생체 정보 관련 이미지 또는 텍스트 중 적어도 하나를 출력할 수 있 다. 상기 통신 인터페이스 160은 상기 전자 장치 100과 외부 장치(예: 전자 장치 102, 104, 또는 서버 장치 106 중 적어도 하나) 간의 통신을 연결할 수 있다. 예를 들면, 상기 통신 인터페이스 160은 무선 통신 또는 유선 통신 을 통해서 네트워크 162에 연결되어 상기 외부 장치와 통신할 수 있다. 상기 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은, 예를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 네트워크 162는 통신 네트워크(telecommunications network)일 수 있다. 상기 통신 네트워크는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전 화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 전자 장치 100과 외부 장치 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol))은 애플리케이션 134, 애플리케이션 프로그래밍 인터페이스 133, 상기 미들웨어 132, 커널 131 또는 통신 인터페이스 160 중 적어도 하나에서 지원될 수 있다. 통신 인터페이스 160은 전자 장치 100이 복수의 통신 방식들을 지원하는 경우 복수개의 통신 모듈들을 포함할 수 있다. 예컨대, 전자 장치 100은 전자 장치 102와 직접 통신 채널을 형성할 수 있는 통신 모듈 예컨대, 근거 리 통신 모듈 또는 직접 통신 모듈을 포함할 수 있다. 근거리 통신 모듈 또는 직접 통신 모듈은 와이파이다이렉 트 통신 모듈, 블루투스 통신 모듈, 지그비 통신 모듈 등 다양한 통신 모듈 중 적어도 하나를 포함할 수 있다. 또한 직접 통신 모듈은 케이블 등의 유선 통신 모듈을 포함할 수 있다. 한 실시 예에 따르면, 통신 인터페이스 160은 전자 장치 102, 104, 또는 서버 장치 106 중 적어도 하나에 생체 정보를 전송할 수 있다. 또한, 통신 인터페이스 160은 전자 장치 104 또는 서버 장치 106 중 적어도 하나로부터 생체 정보 관련 서비스 정보를 수신할 수 있다. 통신 인터페이스 160을 통해 수신된 서비스 정보는 메모리 130 에 저장되거나 또는 디스플레이 150에 출력될 수 있다. 센서 처리기 190은 버스 110을 통해 정보 운용 모듈 170 또는 프로세서 120과 연결될 수 있다. 센서 처리기 190 은 센서 모듈 180에 직접 연결될 수 있다. 센서 처리기 190은 설정에 대응하여 센서 모듈 180 운용 중 일부 기 능 운용을 지원할 수 있다. 예컨대, 센서 처리기 190은 센서 모듈 180에 포함된 터치 센서 181의 운용을 제어하 여 트리거 신호의 발생 여부를 확인할 수 있다. 센서 처리기 190은 센서 모듈 180에 포함된 발광부 182를 제어하여 트리거 신호의 발생 여부를 확인할 수도 있다. 이 동작에서 센서 처리기 190은 앞서 설명한 바와 같이 터 치 센서 181 또는 센서 모듈 180의 활성화 또는 비활성화 주기를 조정할 수 있다. 센서 처리기 190은 트리거 신 호가 발생하면, 해당 트리거 신호를 정보 운용 모듈 170에 전달할 수 있다. 다양한 실시 예에 따르면, 센서 처 리기 190의 트리거 신호 운용과 관련한 동작은 정보 운용 모듈 170에서 처리될 수 있다. 이에 대응하여 센서 처 리기 190은 전자 장치 100에서 생략될 수 있다. 센서 모듈 180은 제1 센서 281 또는 제2 센서 282 중 적어도 하나를 포함할 수 있다. 제1 센서 281은 터치 센서 181 등의 트리거 신호를 감지하는데 이용될 수 있다. 제2 센서 282는 사용자의 신체 부위 접촉 여부 또는 생체 정보 수집에 이용될 수 있다. 예컨대, 제2 센서 282는 심박 측정 센서일 수 있다. 다양한 실시 예에 따르면, 센 서 모듈 180은 트리거 신호 감지와 관련한 제1 센서 281이 제외된 제2 센서 282만을 포함하는 구조일 수도 있다. 상기 정보 운용 모듈 170은, 다른 구성요소들(예: 상기 프로세서 120, 상기 메모리 130, 상기 입출력 인터페이 스 140, 또는 상기 통신 인터페이스 160 등)로부터 획득된 데이터를 처리할 수 있다. 예를 들면, 정보 운용 모 듈 170은 트리거 신호의 수집, 사용자 신체 접촉 여부 확인, 생체 정보 수집, 생체 정보 135의 저장, 생체 정보 의 전송 중 적어도 하나의 처리를 제어할 수 있다. 도 3은 다양한 실시 예에 따른 정보 운용 모듈을 도시한다. 도 3을 참조하면, 한 실시 예에 따른 정보 운용 모듈 170은 센서 운용 모듈 171, 정보 출력 모듈 173, 정보 관 리 모듈 175를 포함할 수 있다. 센서 운용 모듈 171은 전자 장치 100의 센서 모듈 180 운용을 제어할 수 있다. 센서 운용 모듈 171은 예컨대, 정보 운용 모듈 170 또는 센서 처리기 190에 배치되어 센서 모듈 180 운용을 제어할 수 있다. 한 실시 예에 따 르면, 제1 센서 281과 제2 센서 282를 포함하는 센서 모듈 180과 관련하여, 센서 운용 모듈 171은 제1 센서 281 을 활성화하여 물체 접촉(또는 접근) 여부를 검출할 수 있다. 이와 관련하여, 센서 운용 모듈 171은 제1 센서 281 운용과 관련한 전원 공급과, 활성화 주기 또는 비활성화 주기를 제어할 수 있다. 예컨대, 센서 운용 모듈 171은 제1 센서 281을 전자 장치 100에 전원이 공급되는 동안 턴-온 상태(또는 활성화 상태)를 유지하도록 제어 할 수 있다. 또는 센서 운용 모듈 171은 제1 센서 281을 일정 주기로 활성화 또는 비활성화할 수 있다. 센서 운용 모듈 171은 제1 센서 281의 활성화 주기 동안 물체 접촉이 감지되면 제2 센서 282를 활성화하도록 제 어할 수 있다. 센서 운용 모듈 171은 제2 센서 282를 활성화하여 사용자 신체 접촉 여부를 확인할 수 있다. 예 컨대, 센서 운용 모듈 171은 제2 센서 282가 수집한 센서 신호가 지정된 특정 센서 신호(예: 사용자 신체 접촉 시 발생하는 센서 신호)인지 확인할 수 있다. 센서 운용 모듈 171은 사용자 신체 접촉이 아닌 경우 제2 센서 282를 비활성화하도록 제어할 수 있다. 센서 운용 모듈 171은 제2 센서 282가 비활성화되면 제1 센서 281을 활 성화하여 물체 접촉 여부를 확인할 수 있다. 한 실시 예에 따르면, 제1 센서 281에 물체가 지속적으로 접촉한 상태 처리와 관련하여, 센서 운용 모듈 171은 일정 시간 내에 일정 횟수 이상 제2 센서 282에 의해 사용자 신체 접촉이 아닌 것으로 판단되면 제1 센서 281의 비활성화 주기를 조정(예: 비활성화 시간을 길게 조정)할 수 있다. 센서 운용 모듈 171은 제2 센서 282가 수집한 센서 신호에 의해 사용자 신체 접촉으로 판단되면, 제2 센 서 282를 기반으로 생체 정보 수집을 제어할 수 있다. 센서 운용 모듈 171은 제2 센서 282를 기반으로 생체 정 보가 수집되면, 수집된 생체 정보를 정보 출력 모듈 173에 제공할 수 있다. 다양한 실시 예에 따르면, 제2 센서 282만을 포함하는 센서 모듈 180을 운용하는 경우, 센서 운용 모듈 171은 일정 주기로 제2 센서 282의 활성화 또는 비활성화를 제어할 수 있다. 또는 센서 운용 모듈 171은 전자 장치 100에 전원이 공급된 상태에서 제2 센서 282를 턴-온 상태로 유지하도록 제어할 수도 있다. 센서 운용 모듈 171 은 제2 센서 282가 수집한 센서 신호가 물체 접근에 따른 신호 값(예: 물체 접촉 또는 접근에 따른 광량 변화 값)을 가지는 경우, 제2 센서 282를 기반으로 사용자 신체 부위 접촉 여부를 판단할 수 있다. 센서 운용 모듈 171은 제2 센서 282가 제공한 센서 신호 값이 사용자 신체 부위 접촉에 따른 신호 값이면 제2 센서 282를 기반 으로 생체 정보 수집을 제어할 수 있다. 센서 운용 모듈 171은 제2 센서 282가 수집한 생체 정보를 정보 출력 모듈 173에 제공할 수 있다. 상술한 동작에서, 센서 운용 모듈 171은 물체 접촉 여부 확인과 관련한 제1 동작 제어, 사용자 신체 접촉 여부 확인과 관련한 동작 제2 제어, 생체 정보 수집과 관련한 제3 동작 제어를 수행할 수 있다. 이 동작에서 센서 운용 모듈 171은 각 동작 제어별로 제2 센서 282의 발광량을 조절하는 등, 제2 센서 282의 민감도를 조정(예: 물체 확인의 민감도를 신체 확인의 민감도보다 작게, 신체 확인 민감도를 생체 정보 수집 민감도보다 작게)할 수 있다. 상기 민감도는 센서의 센싱 정도에 관한 것으로, 민감도가 큰 경우 상대적으 로 높은 정밀도를 제공할 수 있다. 다양한 실시 예에 따르면, 센서 운용 모듈 171은 제2 센서 282 운용 과정에서 물체 접촉 시 획득된 센서 신호가 사용자 신체 부위 접촉에 따른 신호 값인지 판단할 수 있다. 센서 운용 모 듈 171은 사용자 신체 접촉에 해당하는 신호 값이 검출되면, 생체 정보 수집과 관련한 제2 센서 282 운용을 제 어할 수 있다. 다양한 실시 예에 따르면, 센서 운용 모듈 171은 전자 장치 100의 상태에 따라 제1 센서 281의 활성화, 제2 센 서 282의 활성화, 생체 정보 수집, 생체 정보 출력, 생체 정보 출력 상태 변경 중 적어도 하나를 제어할 수 있 다. 예컨대, 센서 운용 모듈 171은 슬립 상태에서 제1 센서 281 또는 제2 센서 282를 활성화하여 물체 접촉 여 부를 감지할 수 있다. 센서 운용 모듈 171은 락 상태 또는 락 해제 상태에서 실행 중인 애플리케이션의 종류에 대응하여 제1 센서 281 또는 제2 센서 282의 활성화 여부를 결정할 수 있다. 예컨대, 센서 운용 모듈 171은 락 설정 상태 또는 락 해제 상태에서 통화 기능이 실행 중일 경우 제1 센서 281 또는 제2 센서 282를 비활성화하도 록 제어할 수 있다. 센서 운용 모듈 171은 통화 기능 실행 중 특정 이벤트(예: 센서 모듈 180 운용과 관련한 기 능 선택 이벤트)가 발생하면 제1 센서 281 또는 제2 센서 282를 활성화하도록 제어할 수 있다. 한 실시 예에 따 르면, 센서 운용 모듈 171은 동영상 기능이 실행 중일 경우 제1 센서 281 또는 제2 센서 282를 비활성화하도록 제어할 수 있다. 정보 출력 모듈 173은 센서 운용 모듈 171로부터 생체 정보를 수신하면, 수신된 생체 정보가 출력되도록 제어할 수 있다. 이와 관련하여, 정보 출력 모듈 173은 전자 장치 100의 디스플레이 150 상에 생체 정보와 관련한 이미 지 또는 텍스트 중 적어도 하나가 출력되도록 제어할 수 있다. 한 실시 예에 따르면, 정보 출력 모듈 173은 슬 립 상태에서 생체 정보 수집이 발생하면, 디스플레이 150 전체 영역에 생체 정보 관련 이미지 또는 텍스트를 포 함하는 레이어가 출력되도록 제어할 수 있다. 정보 출력 모듈 173은 락스크린 상태에서 생체 정보 수집이 발생 하면, 디스플레이 150 일정 영역에 생체 정보 관련 이미지 또는 텍스트가 출력되도록 제어할 수 있다. 정보 출 력 모듈 173은 락 해제 상태에서 생체 정보 수집이 발생하면, 생체 정보 관련 애플리케이션 화면을 기반으로 생 체 정보 관련 이미지 또는 텍스트가 출력되도록 제어할 수 있다. 또는 정보 출력 모듈 173은 락 해제 상태에서 생체 정보 수집이 발생하면, 디스플레이 150 상의 화면을 조정하여 일정 영역을 확보하고, 해당 영역에 생체 정 보 관련 이미지 또는 텍스트가 출력되도록 제어할 수 있다. 상술한 바와 같이, 정보 출력 모듈 173은 슬립 상태, 락스크린 상태, 락 해제 상태 등에 따라 출력될 생체 정보 관련 정보의 크기, 내용, 형상 중 적어도 하나 를 조정하여 출력되도록 제어할 수 있다. 다양한 실시 예에 따르면, 정보 출력 모듈 173은 생체 정보 출력 시, 저장 또는 전송 중 적어도 하나의 기능 선 택과 관련한 메뉴 항목이나, 아이콘 등을 출력하도록 제어할 수 있다. 또는 정보 출력 모듈 173은 생체 정보 저 장 또는 전송과 관련한 기능 실행을 특정 하드웨어 키에 할당할 수 있다. 정보 출력 모듈 173은 생체 정보 저장 을 요청하는 이벤트가 발생하면, 메모리 130에 생체 정보를 일시적으로 또는 반영구적으로 저장하도록 제어할 수 있다. 한 실시 예에 따르면, 정보 출력 모듈 173은 생체 정보 저장과 관련하여 저장된 사용자 정보를 입력하 는 입력창이 출력되도록 제어할 수 있다. 또는 정보 출력 모듈 173은 생체 정보 저장 요청 시, 설정된 보안 정 보 입력과 관련한 입력창이 출력되도록 제어할 수 있다. 또는 정보 출력 모듈 173은 전자 장치 100의 색인 정보 를 기반으로 생체 정보를 저장할 수 있다. 다양한 실시 예에 따르면, 정보 출력 모듈 173은 생체 정보 전송과 관련한 요청이 발생하면, 생체 정보를 지정 된 서버 장치 106에 전송되도록 제어할 수 있다. 또는 정보 출력 모듈 173은 생체 정보를 전송할 타 전자 장치 102, 104의 전화번호 또는 서버 장치 106의 주소 정보 입력과 관련한 인터페이스가 출력되도록 제어할 수 있다. 정보 출력 모듈 173은 해당 전화번호 또는 주소 정보가 입력되면 상기 생체 정보가 타 전자 장치 102, 104 또는 서버 장치 106 중 적어도 하나에 전송되도록 제어할 수 있다. 정보 출력 모듈 173은 전송한 생체 정보 관련 서 비스 정보를 서버 장치 106으로부터 수신하면, 이를 메모리 130에 저장하거나 디스플레이 150에 출력하도록 제 어할 수 있다. 정보 관리 모듈 175는 저장된 생체 정보의 관리를 지원할 수 있다. 정보 관리 모듈 175는 메모리 130에 저장된 생체 정보들의 리스트를 생성할 수 있다. 정보 관리 모듈 175는 생체 정보들을 기반으로 시간별 그래프를 생성 할 수 있다. 정보 관리 모듈 175는 생체 정보 값에 대응하는 서비스 정보가 저장되어 있는 경우 해당 서비스 정 보가 디스플레이 150에 출력되도록 제어할 수 있다. 다양한 실시 예에 따르면, 정보 관리 모듈 175는 사용자별 생체 정보를 누적하여 저장하고, 사용자별 리스트 또 는 그래프를 생성할 수 있다. 정보 관리 모듈 175는 생체 정보 갱신이 발생하면, 갱신된 생체 정보 관련 사용자 의 리스트 또는 그래프가 디스플레이 150에 출력되도록 제어할 수 있다. 또는 정보 관리 모듈 175는 입력 이벤 트에 대응하여 저장된 생체 정보 전체를 사용자별 및 시간별로 확인할 수 있는 화면이 디스플레이 150에 출력되도록 제어할 수 있다. 다양한 실시 예에 따르면, 정보 관리 모듈 175는 특정 생체 정보가 지정된 값(예: 심박수가 지정된 수 이상인 경우)인 경우 해당 생체 정보를 지정된 서버 장치 106에 자동으로 전송하도록 제어할 수 있다. 정보 관리 모듈 175는 전송된 생체 정보와 관련하여 서버 장치 106으로부터 수신한 서비스 정보를 메모리 130에 저장하거나 디 스플레이 150에 출력하도록 제어할 수 있다. 상술한 바와 같이, 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 생체 정보 수집을 지원하는 센서 활성화와 관련된 트리거 신호를 감지되면, 상기 센서를 활성화하여 접촉된 물체의 생체 정보를 수집하는 정보 운용 모듈, 상기 수집된 생체 정보를 출력하는 디스플레이를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 상기 트리거 신호 감지에 따라 접촉된 물체가 사용자 신체인 지 여부를 확인하고, 상기 물체가 사용자 신체인 경우 상기 생체 정보를 수집하도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 상기 센서에 인접된 영역에 배치된 터치 센서로부터 지정된 터치 신호 발생 감지, 상기 센서에 인접된 영역에 배치된 압력 센서로부터 지정된 압력 신호 발생 감지, 상기 센서에 인접된 영역에 배치된 버튼에 의한 접점 연결 감지, 상기 센서에 인접된 영역에 배치된 근접 센서로부터 지정된 근접 신호 발생 감지 중 적어도 하나에 따라 상기 센서 활성화를 제어할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 상기 센서가 배치된 전자 장치의 움직임 변화가 지정된 움직 임으로 변화되는 경우 상기 센서를 활성화할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 상기 전자 장치의 전면 또는 후면의 방향이 지정된 일정 방향 으로 일정 횟수 회전하는 경우 상기 센서를 활성화할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 상기 센서를 일정 주기로 활성화하고 상기 활성화 주기 동안 상기 센서에 물체 접근에 대응하는 센서 신호가 감지되는지 확인할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 상기 트리거 신호가 감지되면 상기 전자 장치의 디스플레이 턴-온 상태 또는 전자 장치에서 실행 중인 애플리케이션의 종류에 따라 상기 센서를 활성화하거나 또는 비활성 화 상태를 유지하도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 상기 생체 정보의 저장 또는 전송 중 적어도 하나와 관련한 입력 이벤트에 대응하여 상기 생체 정보를 저장 또는 전송할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 상기 입력 이벤트 수신 시 보안 정보 입력창 또는 락 설정 화 면 중 적어도 하나가 상기 디스플레이에 출력되도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 정보 운용 모듈은 지정된 보안 정보 또는 지정된 락 해제 정보 입력 시 상기 생 체 정보를 메모리에 저장하거나 지정된 장치에 전송하도록 제어할 수 있다. 도 4는 다양한 실시 예에 따른 정보 운용 방법을 도시한다. 도 4를 참조하면, 다양한 실시 예에 따른 정보 운용 방법과 관련하여, 동작 401에서 정보 운용 모듈 170은 트리 거 신호 수집을 위한 센서 제어를 수행할 수 있다. 예컨대, 정보 운용 모듈 170은 제1 센서 281 또는 제2 센서 282 중 적어도 하나를 활성화하도록 제어할 수 있다. 동작 403에서 정보 운용 모듈 170이 지정된 트리거 신호가 수집되는지 확인할 수 있다. 예컨대, 정보 운용 모듈 170은 활성화된 제1 센서 281 등(예: 터치 센서, 압력 센서, 버튼 등)가 수집한 센서 신호가 물체 접촉 또는 접 근 감지에 대응하는 신호 값인지 확인할 수 있다. 또는 정보 운용 모듈 170은 일정 주기로 활성화된 제2 센서 282가 제공한 센서 신호가 물체 접촉 또는 접근 감지에 대응하는 신호 값인지 확인할 수 있다. 동작 403에서 지정된 트리거 신호가 수집되지 않으면 동작 405에서 정보 운용 모듈 170은 해당 기능 수행을 제 어할 수 있다. 해당 기능 수행과 관련하여, 정보 운용 모듈 170은 전자 장치 100의 이전 상태(예: 슬립 상태, 락 상태, 특정 기능 실행 상태 등)를 유지하도록 제어할 수 있다. 또는 정보 운용 모듈 170은 특정 입력 이벤트 가 발생하면, 해당 이벤트에 대응하는 기능 처리 예컨대, 입력 이벤트 종류에 대응하여 파일 재생 기능, 웹 접 속 기능, 저장된 생체 정보 검색 기능 등을 지원할 수 있다. 동작 403에서 지정된 트리거 신호가 수집되면, 동작 407에서 정보 운용 모듈 170은 지정된 센서 신호 수집이 있 는지 확인할 수 있다. 이와 관련하여, 정보 운용 모듈 170은 지정된 트리거 신호가 수집되면 제2 센서 282를 활성화하도록 제어할 수 있다. 정보 운용 모듈 170은 활성화된 제2 센서 282를 이용하여 사용자 신체(예: 손가락) 접촉에 따른 센서 신호 값이 수집되는지 확인할 수 있다. 이 동작에서, 정보 운용 모듈 170은 지정된 시간 동안 제2 센서 282를 활성화하고, 해당 시간 내에 지정된 센서 신호가 수집되는지 확인할 수 있다. 동작 407에서 지정된 센서 신호 수집이 없는 경우, 동작 409에서, 정보 운용 모듈 170은 예컨대 실패 처리를 수 행할 수 있다. 한 실시 예에 따르면, 정보 운용 모듈 170은 지정된 시간 동안 지정된 센서 신호가 수집되지 않 으면, 제2 센서 282를 비활성화하도록 제어할 수 있다. 한 실시 예에 따르면, 정보 운용 모듈 170은 입출력 인 터페이스 140 또는 디스플레이 150 중 적어도 하나를 통해 지정된 센서 신호 수집이 되지 않은 상태에 대한 알 람(예: 오디오 정보 또는 비디오 정보 중 적어도 하나)이 출력되도록 제어할 수도 있다. 또는 정보 운용 모듈 170은 별도의 알람 출력 없이 제1 센서 281 활성화를 제어할 수 있다. 정보 운용 모듈 170은 실패 처리 이후, 동작 415를 거쳐 동작 401로 분기하여 트리거 신호 수집과 관련하여 제1 센서 281을 활성화하거나, 제2 센서 282를 트리거 신호 수집으로 운용할 수 있다. 동작 407에서 지정된 센서 신호가 수집(예: 사용자 신체 접촉에 대응하는 신호 수신)되면, 정보 운용 모듈 170 은 동작 411에서 생체 정보 측정을 수행할 수 있다. 이와 관련하여, 정보 운용 모듈 170은 생체 정보 측정과 관 련한 제2 센서 282를 운용할 수 있다. 정보 운용 모듈 170은 지정된 센서 신호 수집과 관련한 제2 센서 282의 초기화 및 광 조사와 수광, 생체 정보 측정과 관련한 제2 센서 282의 초기화 및 광 조사와 수광 동작을 처리할 수 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 동작 407에서 제2 센서 282 기반의 지정된 센서 신호 수집 여 부를 생략할 수도 있다. 이 경우, 정보 운용 모듈 170은 동작 403에서 트리거 신호가 수집되면, 동작 411에서 생체 정보 측정 동작과 관련한 제2 센서 282 운용을 제어할 수 있다. 동작 413에서, 정보 운용 모듈 170은 생체 정보 측정과 관련한 결과 처리를 제어할 수 있다. 예컨대, 정보 운용 모듈 170은 측정된 생체 정보의 출력, 저장, 또는 전송 중 적어도 하나를 지원할 수 있다. 동작 415에서, 정보 운용 모듈 170은 생체 정보 측정과 관련한 기능 종료 이벤트(예: 생체 정보 측정 후 일정 시간 경과, 생체 정보 측정 종료를 지시하는 입력 이벤트 발생 등)가 있는지 확인할 수 있다. 동작 415에서 기 능 종료 이벤트 발생이 없으면, 정보 운용 모듈 170은 동작 401 이전으로 분기하여 이하 과정을 재수행하도록 제어할 수 있다. 도 5는 다양한 실시 예에 따른 전자 장치 상태에 따른 정보 운용 방법을 도시한다. 도 5를 참조하면, 전자 장치 상태에 따른 정보 운용 방법과 관련하여, 생체 정보가 측정되면, 동작 501에서 정 보 운용 모듈 170은 전자 장치 100 상태 값을 확인할 수 있다. 예컨대, 동작 503에서 정보 운용 모듈 170은 전 자 장치 100이 슬립 상태인지 확인할 수 있다. 동작 503에서 전자 장치 100이 슬립 상태이면, 동작 505에서 정 보 운용 모듈 170은 디스플레이 150의 적어도 일부에 측정 결과가 표시되도록 제어할 수 있다. 이와 관련하여, 정보 운용 모듈 170은 슬립 상태의 디스플레이 150에 전원을 공급하고, 측정 결과에 대응하는 이미지 또는 텍스 트 중 적어도 하나가 출력되도록 제어할 수 있다. 동작 503에서 슬립 상태가 아닌 경우, 동작 507에서 정보 운용 모듈 170은 전자 장치 100이 락 상태(또는 락 스 크린 출력 상태)인지 확인할 수 있다. 동작 507에서 전자 장치 100이 락 상태인 경우, 동작 509에서 정보 운용 모듈 170은 락스크린에 측정 결과가 표시되도록 제어할 수 있다. 동작 507에서 락 상태가 아닌 경우 예컨대 락 해제 상태인 경우, 정보 운용 모듈 170은 동작 513으로 분기할 수 있다. 락스크린에 측정 결과 표시 시, 측정 결과에 대응하는 이미지와 텍스트 중 적어도 하나를 포함하는 레이어를 락스크린에 오버레이되도록 배치할 수 있다. 또는 정보 운용 모듈 170은 락스크린 화면을 재구성하여 디스플레이 150의 일부 영역에 측정 결과가 표시 되도록 제어할 수 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 측정 결과가 오디오 정보로 출력되도 록 제어할 수도 있다. 동작 505 또는 동작 509에서, 측정 결과 표시 후, 동작 511에서 정보 운용 모듈 170은 결과 적용 처리와 관련한 입력 이벤트 수신이 있는지 확인할 수 있다. 이와 관련하여, 정보 운용 모듈 170은 생체 정보의 저장 또는 전송 과 관련한 아이콘이나 가상의 키버튼을 출력하거나 또는 하드웨어 키를 할당할 수 있다. 동작 511에서 결과 적용 처리와 관련한 입력 이벤트가 수신되면, 동작 513에서, 정보 운용 모듈 170은 관련 애 플리케이션 실행 및 측정 결과 적용을 처리할 수 있다. 예컨대, 정보 운용 모듈 170은 생체 정보와 관련한 애플 리케이션을 자동 실행하고, 애플리케이션 실행 화면에 측정 결과를 출력하도록 제어할 수 있다. 여기서 정보 운 용 모듈 170은 이전 저장된 생체 정보들과 함께 현재 측정된 생체 정보가 표시되도록 제어할 수 있다. 다양한실시 예에 따르면, 정보 운용 모듈 170은 해당 아이콘이나 가상 키버튼 등이 선택되어 생체 정보 저장이 요청되 면, 메모리 130에 생체 정보가 저장되도록 제어할 수 있다. 한 실시 예에 따르면, 정보 운용 모듈 170은 생체 저장 이전에 보안 정보(예: 패스워드) 확인 절차를 수행할 수 있다. 한 실시 예에 따르면, 정보 운용 모듈 170 은 사용자 정보(예: 이름, 별명, 전화 번호 등) 입력 절차를 수행할 수 있다. 사용자 정보가 입력되면, 정보 운 용 모듈 170은 보안 정보 확인 절차를 수행할 수도 있다. 정보 운용 모듈 170은 생체 정보 전송이 요청되면, 지 정된 장치 또는 입력 정보에 대응하는 특정 장치에 생체 정보가 전송되도록 제어할 수 있다. 상술한 동작을 기 반으로 다양한 실시 예는 다른 사용자의 전자 장치를 이용하여 생체 정보를 수집하더라도 자신의 전자 장치에 생체 정보를 전송하여 저장 관리함으로써 연속성 있는 생체 정보 관련 데이터 검색 및 서비스 운용을 지원할 수 있다. 동작 511에서 결과 적용 처리와 관련한 입력 이벤트 발생이 없으면, 정보 운용 모듈 170은 동작 513을 스킵할 수 있다. 또는 정보 운용 모듈 170은 기능 종료 여부를 확인하는 도 4의 동작 415로 분기할 수 있다. 상술한 바와 같이 다양한 실시 예에 따르면, 한 실시 예에 따른 정보 운용 방법은 생체 정보 수집을 지원하는 센서 활성화와 관련된 트리거 신호를 감지하는 동작, 상기 트리거 신호가 감지되면 상기 센서를 활성화하여 접 촉된 물체의 생체 정보를 수집하는 동작, 상기 수집된 생체 정보를 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 생체 정보를 수집하는 동작은 상기 트리거 신호 감지에 따라 접촉된 물체가 사 용자 신체인지 여부를 확인하는 동작, 상기 물체가 사용자 신체인 경우 상기 생체 정보를 수집하는 동작을 포함 할 수 있다. 다양한 실시 예에 따르면, 상기 트리거 신호를 감지하는 동작은 상기 센서에 인접된 영역에 배치된 터치 센서로 부터 지정된 터치 신호 발생을 감지하는 동작, 상기 센서에 인접된 영역에 배치된 압력 센서로부터 지정된 압력 신호 발생을 감지하는 동작, 상기 센서에 인접된 영역에 배치된 버튼에 의한 접점 연결을 감지하는 동작, 상기 센서에 인접된 영역에 배치된 근접 센서로부터 지정된 근접 신호 발생을 감지하는 동작 중 적어도 하나를 포함 할 수 있다. 다양한 실시 예에 따르면, 상기 트리거 신호를 감지하는 동작은 상기 센서가 배치된 전자 장치의 움직임 변화가 지정된 움직임 변화인지 감지하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 트리거 신호를 감지하는 동작은 상기 전자 장치의 전면 또는 후면의 방향이 일 정 방향으로 일정 횟수 회전 변경되는지 감지하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 트리거 신호를 감지하는 동작은 상기 센서를 일정 주기로 활성화하는 동작, 상 기 활성화 주기 동안 상기 센서에 물체 접근에 대응하는 센서 신호가 감지되는지 확인하는 동작을 포함할 수 있 다. 다양한 실시 예에 따르면, 상기 방법은 상기 트리거 신호가 감지되면 전자 장치의 상태를 확인하는 동작, 상기 전자 장치의 디스플레이 턴-온 상태 또는 전자 장치에서 실행 중인 애플리케이션의 종류에 따라 상기 트리거 신 호에 따른 센서를 활성화하거나 또는 비활성화를 유지하도록 제어하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 상기 생체 정보의 저장 또는 전송 중 적어도 하나와 관련한 입력 이벤트 를 수신하는 동작, 상기 입력 이벤트에 대응하여 상기 생체 정보를 저장 또는 전송하는 동작을 더 포함할 수 있 다. 다양한 실시 예에 따르면, 상기 방법은 상기 입력 이벤트 수신 시 보안 정보 입력창 또는 락 설정 화면 중 적어 도 하나를 출력하는 동작을 더 포함할 수 있다. 다양한 실시 예에 따르면, 상기 방법은 지정된 보안 정보 또는 지정된 락 해제 정보 입력 시 상기 생체 정보를 메모리에 저장하거나 지정된 장치에 전송하는 동작을 더 포함할 수 있다. 도 6은 다양한 실시 예에 따른 전자 장치의 슬립 상태 기반 정보 운용과 관련한 화면 인터페이스를 도시한다. 도 6을 참조하면, 전자 장치 100은 601 상태에서와 같이 일측(예: 전자 장치 100의 후면)에 센서 모듈 180이 배 치될 수 있다. 또한, 전자 장치 100은 602 상태에서와 같이 슬립 상태(예: 디스플레이 150이 턴-오프된 상태)일 수 있다. 한 실시 예에 따르면, 603 상태에서와 같이 사용자 손가락 11이 센서 모듈 180에 접촉되면, 정보 운용 모듈 170 은 생체 정보 수집을 수행할 수 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 사용자 손가락 11이 센서 모듈 180에 접촉되면, 활성화된 제1 센서 281 또는 트리거 신호 감지로 운용되는 제2 센서 282가 제공하는 센서 신호를 기반으로 물체 접촉을 확인할 수 있다. 정보 운용 모듈 170은 물체가 접촉하면, 제2 센서 282를 활 성화하거나, 활성화된 제2 센서 282를 이용하여 사용자 손가락 11 접촉인지 확인할 수 있다. 정보 운용 모듈 170은 사용자 손가락 11 접촉에 대응하는 센서 신호가 제2 센서 282로부터 수신되면, 제2 센서 282를 생체 정보 수집으로 운용할 수 있다. 상술한 동작과 관련하여, 사용자는 센서 모듈 180에 3번을 접촉시키는 동작을 수행할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100이 사용자 손가락 접촉여부를 확인하는 절차가 생략되도록 설 정 또는 설계되는 경우, 사용자는 센서 모듈 180에 손가락을 두 번 접촉시키는 동작을 수행할 수 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 상기 트리거 신호는 가속도 센서 또는 지자기 센서 등에 의한 전자 장 치 100의 상태 변화 값일 수 있다. 이에 따라, 정보 운용 모듈 170은 예컨대, 전자 장치 100의 전면과 후면이 뒤집히는 동작이 일정 횟수(예: 후면이 사용자를 향하도록 동작하는 한번과 전면이 사용자를 향하도록 동작하는 한번) 이상 발생하면 이를 트리거 신호로 인식할 수 있다. 이에 따라, 사용자는 전자 장치 100의 후면에 배치된 센서 모듈을 확인하는 동작을 수행하여 제2 센서 282를 활성화하도록 제어할 수 있다. 또한 사용자 손가락 접촉 여부를 확인하는 동작이 생략되도록 설정 또는 설계되는 경우 사용자는 전자 장치 100의 뒤집는 동작 이후 센서 모듈 180에 손가락을 접촉시킴으로써 생체 정보 측정 기능을 이용할 수 있다. 전자 장치 100은 사용자 손가락 접촉 여부 확인 절차를 생체 정보 측정 절차에 넣거나 뺄 수 있는 설정 기능(예: 메뉴 또는 설정 화면 등)을 제 공할 수 있다. 정보 운용 모듈 170은 생체 정보가 수집되면, 상태 604에서와 같이 디스플레이 150에 생체 정보 이미지 61을 출 력할 수 있다. 추가적으로 또는 대체적으로 생체 정보 이미지 61은 생체 정보 값에 대응하는 텍스트일 수 있다. 정보 운용 모듈 170은 생체 정보 저장과 관련한 가상의 저장 버튼 63이 디스플레이 150 일측에 출력되도록 제어 할 수 있다. 또한 정보 운용 모듈 170은 생체 정보 전송과 관련한 가상의 전송 버튼 65가 디스플레이 150 일측 에 출력되도록 제어할 수 있다. 정보 운용 모듈 170은 저장 버튼 63 또는 전송 버튼 65가 선택되면, 관련 화면 이 디스플레이 150에 출력되도록 제어할 수 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 저장 버튼 63 또는 전송 버튼 65가 선택되면 락스크린이 디스 플레이 150에 출력되도록 제어할 수 있다. 정보 운용 모듈 170은 락이 해제되는 경우 저장 버튼 63 또는 전송 버튼 65 관련 화면이 디스플레이 150에 출력되도록 제어할 수 있다. 락 설정이 없는 경우, 정보 운용 모듈 170 은 락스크린 출력 동작 없이 저장 버튼 63 또는 전송 버튼 65 선택에 대응하는 화면이 디스플레이 150에 출력되 도록 제어할 수 있다. 도 7은 다양한 실시 예에 따른 전자 장치의 락 상태 기반 정보 운용과 관련한 화면 인터페이스를 도시한다. 도 7을 참조하면, 전자 장치 100은 701 상태에서와 같이 락스크린이 디스플레이 150에 출력되도록 제어할 수 있 다. 예컨대, 전자 장치 100은 락스크린 출력과 관련한 이벤트가 발생하거나 또는 슬립 상태에서 깨우기 이벤트 가 발생하는 경우 락스크린이 디스플레이 150에 출력되도록 제어할 수 있다. 한 실시 예에 따르면, 전자 장치 100은 락스크린과 관련하여 패턴 락 이미지 151이 출력되도록 제어할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100은 별도의 패턴 락이 없는 보호스크린(예: 터치 이벤트 발생에 대응하여 락이 해제되는 스크린)이 디스 플레이 150에 출력하도록 제어할 수도 있다. 또한, 전자 장치 100은 기타 정보 예컨대 시간 정보를 출력할 수도 있다. 도 6의 상태 603에서와 같이 센서 모듈 180에 사용자 손가락이 접촉되어 생체 정보가 수집되는 경우, 정보 운용 모듈 170은 703 상태에서와 같이 생체 정보 이미지 71을 출력할 수 있다. 이 동작에서 정보 운용 모듈 170은 생 체 정보 이미지 71 출력과 관련하여, 패턴 락 이미지 151의 크기와 형태, 내용 중 적어도 하나를 변경한 변경 이미지 153이 디스플레이 150에 출력되도록 제어할 수 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 생체 정보 이미지 71의 형태가 조정되어 출력되도록 제어할 수 있다. 예컨대, 정보 운용 모듈 170은 지정된 생 체 정보 이미지의 크기를 축소한 후, 크기가 축소된 생체 정보 이미지가 디스플레이 150 일측에 출력되도록 제 어할 수도 있다. 다양한 실시 예에 따르면, 정보 운용 모듈 170은 생체 정보의 저장과 관련한 저장 버튼 73 또는 생체 정보의 전 송과 관련한 전송 버튼 75 중 적어도 하나가 디스플레이 150에 출력되도록 제어할 수 있다. 정보 운용 모듈 170 은 저장 버튼 73 또는 전송 버튼 75가 선택되면, 락 해제 요청과 관련한 알람(예: 변경 이미지의 깜빡임, 락 해 제를 요청하는 텍스트 등)이 출력되도록 제어할 수 있다. 정보 운용 모듈 170은 락이 해제되면 선택된 버튼에 해당하는 기능 예컨대, 생체 정보의 저장 또는 생체 정보의 전송을 제어할 수 있다. 생체 정보 저장 시 정보 운 용 모듈 170은 자동으로(default) 메모리 130에 저장할 수 있다. 이 동작에서 정보 운용 모듈 170은 전자 장치100의 색인 정보와 생체 정보를 매칭하여 전송할 수 있다. 전송 버튼 75 선택 후 락이 해제되면 정보 운용 모듈 170은 지정된 서버 장치 106에 생체 정보를 자동으로 전송하거나 또는 확인 절차 수행 후 전송하도록 제어할 수 있다. 도 8은 다양한 실시 예에 따른 전자 장치의 정보 운용과 관련한 화면 인터페이스를 도시한다. 도 8을 참조하면, 전자 장치 100은 801 상태에서와 같이 락 해제 상태 또는 대기 화면, 홈 화면 등의 상태에서 적어도 하나의 아이콘을 포함하는 화면을 디스플레이 150 일정 영역 81에 출력할 수 있다. 다양한 실시 예에 따 르면, 전자 장치 100은 특정 기능 실행에 따른 실행 화면을 일정 영역 81에 출력할 수도 있다. 도 6의 603 상태에서와 같이 사용자 손가락이 센서 모듈 180에 접촉되면, 정보 운용 모듈 170은 생체 정보를 수 집할 수 있다. 여기서 앞서 설명한 바와 같이 정보 운용 모듈 170은 센서 모듈 180의 생체 정보 수집 기능 운용 과 관련한 트리거 신호 감지를 수행하고, 트리거 신호 감지 시 생체 정보를 수집할 수 있다. 트리거 신호 감지 동작은 센서 모듈 180에 포함된 제1 센서 281 또는 제2 센서 282 중 적어도 하나에 의한 지정된 센서 신호 수신 동작을 포함할 수 있다. 제1 센서 281은 전자 장치 100의 움직임 상태에 따른 센서 신호를 수집하는 센서, 터치 나 압력 또는 버튼 등에 의한 센서 신호를 수집하는 센서 등을 포함할 수 있다. 센서 모듈 180에 사용자 손가락으로 인식된 물체가 접촉되면, 전자 장치 100의 정보 운용 모듈 170은 803 상태 에서와 같이 생체 정보 측정 중 상태에 대응하는 정보가 디스플레이 150에 출력되도록 제어할 수 있다. 예컨대, 정보 운용 모듈 170은 생체 정보 측정 중 상태를 나타내는 상태 이미지 83이 디스플레이 150에 출력되도록 제어 할 수 있다. 정보 운용 모듈 170은 생체 정보 측정 중 상태와 관련된 상태 메시지 82(예: 생체 정보 측정과 관 련한 가이드 정보)가 디스플레이 150에 출력되도록 제어할 수 있다. 정보 운용 모듈 170은 생체 정보가 수집되면, 자동으로 또는 생체 정보 저장 요청에 대응하여 상태 805에서와 같이 수집된 생체 정보와 관련한 화면이 디스플레이 150에 출력되도록 제어할 수 있다. 예컨대, 정보 운용 모듈 170은 생체 정보 85를 디스플레이 150에 출력할 수 있다. 또한, 정보 운용 모듈 170은 생체 정보 85와 관련한 사용자 정보와 보안 정보를 입력하는 정보 입력창 86을 출력할 수 있다. 사용자 정보 입력 란에 지정된 정보(예: 전화 번호)가 기입되고, 보안 정보 입력 란에 지정된 정보(예: 설정된 패스워드)가 기입되면, 정보 운 용 모듈은 수집된 생체 정보를 메모리 130에 저장하도록 제어할 수 있다. 정보 운용 모듈 170은 생체 정보가 수집되면, 자동으로 또는 생체 정보 전송 요청에 대응하여 상태 807에서와 같이 수집된 생체 정보의 전송과 관련한 화면이 디스플레이 150에 출력되도록 제어할 수 있다. 예컨대, 정보 운 용 모듈 170은 생체 정보 87을 디스플레이 150에 출력되도록 제어할 수 있다. 정보 운용 모듈 170은 생체 정보 87과 관련하여 서버 장치 106으로부터 서버 페이지를 수신하여 출력할 수 있다. 전자 장치 100이 서버 장치 106 에 등록되어 있지 않은 경우, 서버 장치 106은 생체 정보 관련 서비스 가입과 관련한 가입 정보 입력창 88을 전 자 장치 100에 전송할 수 있다. 정보 운용 모듈 170은 도시된 바와 같이 가입 정보 입력창 88이 디스플레이 150 에 출력되도록 제어할 수 있다. 다양한 실시 예에 따르면, 전자 장치 100이 생체 정보 관련 서비스가 가입된 상태이면, 정보 운용 모듈 170은 생체 정보를 서버 장치 106에 전송하고, 서버 장치 106으로부터 809 화면에서와 같은 생체 누적 정보 리스트 89 를 수신하여 디스플레이 150에 출력되도록 제어할 수 있다. 다양한 실시 예에 다르면, 생체 누적 정보 리스트 89는 메모리 130에 저장된 생체 정보를 기반으로 정보 운용 모듈 170이 생성한 정보일 수도 있다. 도 9는 다양한 실시 예에 따른 전자 장치의 다른 예를 나타낸 블록도이다. 상기 전자 장치 900은, 예를 들면, 디스플레이 150 및 도 2에 도시된 전자 장치 100의 전체 또는 일부를 구성할 수 있다. 도 9를 참조하면, 상기 전자 장치 900은 하나 이상의 애플리케이션 프로세서(AP: application processor) 910, 통신 모듈 920, SIM(subscriber identification module) 카드 924, 메모리 930, 센서 모듈 940, 입력 장치 950, 디스플레이 960, 인터페이스 970, 오디오 모듈 980, 카메라 모듈 991, 전력관리 모듈 995, 배터리 996, 인 디케이터 997 및 모터 998을 포함할 수 있다. 상기 AP 910은 운영체제 또는 응용 프로그램을 구동하여 상기 AP 910에 연결된 다수의 하드웨어 또는 소프트웨 어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상 기 AP 910은, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시 예에 따르면, 상기 AP 910은 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신 모듈 920(예: 상기 통신 인터페이스 160)은 상기 전자 장치 900(예: 상기 전자 장치 100)과 네트워크 를 통해 연결된 다른 전자 장치들(예: 전자 장치 102, 104 또는 서버 장치 106) 간의 통신에서 데이터 송수신을 수행할 수 있다. 한 실시 예에 따르면, 상기 통신 모듈 920은 셀룰러 모듈 921, Wifi 모듈 923, BT 모듈 925, GPS 모듈 927, NFC 모듈 928 및 RF(radio frequency) 모듈 929를 포함할 수 있다. 상기 셀룰러 모듈 921은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈 921은, 예를 들면, 가입자 식별 모듈(예: SIM 카드 924)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈 921은 상기 AP 910이 제공할 수 있는 기능 중 적어도 일부 기능 을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈 921은 멀티미디어 제어 기능의 적어도 일부를 수행할 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈 921은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 상기 셀룰러 모듈 921은, 예를 들면, SoC로 구현될 수 있다. 도 9에서는 상기 셀룰러 모듈 921 (예: 커뮤니케이션 프로세서), 상기 메모리 930 또는 상기 전력관리 모듈 995 등의 구성요소들이 상기 AP 910과 별개의 구성요소로 도시되어 있으나, 한 실시 예에 따르면, 상기 AP 910이 전술한 구성요소들의 적어도 일부(예: 셀룰러 모듈 921)를 포함하도록 구현될 수 있다. 한 실시 예에 따르면, 상기 AP 910 또는 상기 셀룰러 모듈 921(예: 커뮤니케이션 프로세서)은 각각에 연결된 비 휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리할 수 있다. 또한, 상기 AP 910 또는 상기 셀룰러 모듈 921은 다른 구성요소 중 적어도 하나로 부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 상기 Wifi 모듈 923, 상기 BT 모듈 925, 상기 GPS 모듈 927 또는 상기 NFC 모듈 928 각각은, 예를 들면, 해당 하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 9에서는 셀룰러 모듈 921, Wifi 모듈 923, BT 모듈 925, GPS 모듈 927 또는 NFC 모듈 928이 각각 별개의 블록으로 도시되었으나, 한 실시 예에 따르면, 셀룰러 모듈 921, Wifi 모듈 923, BT 모듈 925, GPS 모듈 927 또는 NFC 모듈 928 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 예를 들면, 셀룰러 모듈 921, Wifi 모듈 923, BT 모듈 925, GPS 모듈 927 또는 NFC 모듈 928 각각에 대응하는 프로세서들 중 적어 도 일부(예: 셀룰러 모듈 921에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈 923에 대응하는 Wifi 프로세서) 는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈 929는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈 929는, 도시되 지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈 929는 무선 통신에서 자유 공간상의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 9에서는 셀룰러 모듈 921, Wifi 모듈 923, BT 모듈 925, GPS 모듈 927 및 NFC 모듈 928이 하나의 RF 모듈 929를 서로 공유하는 것으 로 도시되어 있으나, 한 실시 예에 따르면, 셀룰러 모듈 921, Wifi 모듈 923, BT 모듈 925, GPS 모듈 927 또는 NFC 모듈 928 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행할 수 있다. 다양한 실시 예에 따르면, 통신 모듈 920은 전자 장치 900의 생체 정보를 전자 장치 102, 104 또는 서버 장치 106 중 적어도 하나에 전송할 수 있다. 통신 모듈 920은 서버 장치 106으로부터 전송한 생체 정보와 관련한 서 비스 정보를 수신할 수 있다. 상기 서비스 정보는 생체 정보와 관련한 사용자 관심 정보 또는 유용 정보 등이 될 수 있다. 예컨대, 서비스 정보는 생체 정보 기반으로 제공되는 건강 관련 서비스 정보, 생체 정보 누적에 따 른 운동 스케줄 관리 정보, 생체 정보 기반의 환자 관리 정보, 생체 정보 기반 식단 관리 정보 등을 포함할 수 있다. 상기 SIM 카드 924는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입될 수 있다. 상기 SIM 카드 924는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또 는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리 930(예: 상기 메모리 130)은 내장 메모리 932 또는 외장 메모리 934를 포함할 수 있다. 상기 내장 메모리 932는, 예를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(onetime programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electricallyerasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 내장 메모리 932는 Solid State Drive (SSD)일 수 있다. 상기 외장 메모리 934는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini- SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 상기 외장 메모리 934는 다양한 인터페이스를 통하여 상기 전자 장치 900과 기능적으로 연결될 수 있다. 한 실시 예에 따르면, 상 기 전자 장치 900은 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 다양한 실시 예에 따르면, 메모리 930은 수집된 생체 정보 중 적어도 일부를 저장할 수 있다. 예컨대, 메모리 930은 사용자별 또는 전화번호별 생체 정보를 저장할 수 있다. 또는 메모리 930은 락 해제 또는 보안 정보의 정 상 입력이 된 시점과 관련한 생체 정보를 저장할 수 있다. 메모리 930은 저장된 생체 정보를 누적하여 생성한 리스트 또는 그래프를 저장할 수 있다. 상기 센서 모듈 940은 물리량을 계측하거나 전자 장치 900의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 상기 센서 모듈 940은, 예를 들면, 제스처 센서 940A, 자이로 센서 940B, 기압 센 서 940C, 마그네틱 센서 940D, 가속도 센서 940E, 그립 센서 940F, 근접 센서 940G, color 센서 940H(예: RGB(red, green, blue) 센서), 생체 센서 940I, 온/습도 센서 940J, 조도 센서 940K 또는 UV(ultra violet) 센 서 940M 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모듈 940은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서 (electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센서 (미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈 940은 그 안에 속 한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상술한 센서 모듈 940 중 적어도 하나의 센서는 트리거 신호 감지와 관련하여 이용될 수 있다. 또한 센서 모듈 940 중 적어도 하나의 센서는 사용자 손가락 감지와 관련하여 이용될 수 있다. 또한 센서 모듈 940 중 적어도 하나의 센서는 생체 정보(예: 심박 정보) 감지와 관련하여 이용될 수 있다. 상기 입력 장치 950은 터치 패널(touch panel) 952, (디지털) 펜 센서(pen sensor) 954, 키(key) 956 또는 초 음파(ultrasonic) 입력 장치 958을 포함할 수 있다. 상기 터치 패널 952는, 예를 들면, 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널 952는 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터치 패널 952는 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널 952는 사용자에게 촉각 반응을 제공할 수 있다. 상기 (디지털) 펜 센서 954는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 상기 키 956은, 예를 들면, 물리적인 버튼, 광학식 키 또는 키 패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치 958는 초음파 신호를 발생하는 입력 도구를 통해, 전자 장치 900에서 마이크(예: 마이크 988)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무선 인식이 가능하다. 한 실시 예에 따르면, 상기 전자 장치 900은 상기 통신 모듈 920을 이용하여 이와 연결된 외부 장치 (예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이 960(예: 상기 디스플레이 150)은 패널 962, 홀로그램 장치 964 또는 프로젝터 966을 포함할 수 있다. 상기 패널 962는, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light- emitting diode) 등일 수 있다. 상기 패널 962는, 예를 들면, 유연하게(flexible), 투명하게(transparent) 또 는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널 962는 상기 터치 패널 952와 하나의 모듈로 구성될 수 도 있다. 상기 홀로그램 장치 964는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터 966은 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치 900의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 상기 디스플레이 960은 상기 패널 962, 상기 홀로그램 장치 964, 또는 프로젝터 966을 제어하기 위한 제어 회로를 더 포함할 수 있다. 다양한 실시 예에 따르면, 디스플레이 960은 생체 정보 수집과 관련한 다양한 정보를 표시할 수 있다. 또한 디 스플레이 960은 수집된 생체 정보를 표시할 수 있다. 또한 디스플레이 960은 생체 정보와 관련한 서비스 정보를 표시할 수 있다. 상기 인터페이스 970은, 예를 들면, HDMI(high-definition multimedia interface) 972, USB(universal serial bus) 974, 광 인터페이스(optical interface) 976 또는 D-sub(D-subminiature) 978을 포함할 수 있다. 상기 인 터페이스 970은, 예를 들면, 도 2에 도시된 통신 인터페이스 160에 포함될 수 있다. 추가적으로 또는 대체적으 로, 상기 인터페이스 970은, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 상기 오디오 모듈 980은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈 980의 적어 도 일부 구성요소는, 예를 들면, 도 2에 도시된 입출력 인터페이스 140에 포함될 수 있다. 상기 오디오 모듈 980은, 예를 들면, 스피커 982, 리시버 984, 이어폰 986 또는 마이크 988 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 다양한 실시 예에 따르면, 오디오 모듈 980은 생체 정보와 관련한 오디오 정보를 출력 할 수 있다. 상기 카메라 모듈 991은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 쉬 (flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈 995는 상기 전자 장치 900의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 관 리 모듈 995는, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시 예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등 이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로가 추가 될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리 996의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리 996은 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치 900에 전원을 공급할 수 있다. 상기 배터리 996은, 예를 들면, 충전식 전지(rechargeable battery) 또는 태양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터 997은 상기 전자 장치 900 혹은 그 일부(예: 상기 AP 910)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터 998은 전기적 신호를 기계적 진동으로 변환 할 수 있다. 도시되지는 않았으나, 상기 전자 장치 900은 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(componen t)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다 양한 실시 예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요 소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 본 발명의 다양한 실시 예에 사용된 용어 “모듈”은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. “모듈”은 예를 들어, 유닛(unit), 로 직(logic), 논리 블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. “모듈”은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. “모듈”은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. “모듈”은 기계적 으로 또는 전자적으로 구현될 수 있다. 예를 들면, 본 발명의 다양한 실시 예에 따른 “모듈”은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field- programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함 할 수 있다. 다양한 실시 예에 따르면, 본 발명의 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer- readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어는, 하나 이상의 프로세서 (예: 상기 프로세서 120)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있 다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 상기 메모리 130이 될 수 있다. 상기 프로그래밍 모듈의 적 어도 일부는, 예를 들면, 상기 프로세서 120에 의해 구현(implement)(예: 실행)될 수 있다. 상기 프로그래밍 모 듈의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등을 포함할 수 있다. 다양한 실시 예에 따르면, 한 실시 예에 따른 컴퓨터 기록 매체는 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어를 포함하되, 상기 명령어는 생체 정보 수집 을 지원하는 센서 활성화와 관련된 트리거 신호를 감지하는 동작, 상기 트리거 신호가 감지되면 상기 센서를 활 성화하여 접촉된 물체의 생체 정보를 수집하는 동작, 상기 수집된 생체 정보를 출력하는 동작을 수행하도록 설 계될 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체에는 하드디스크, 플로피디스크 및 자기 테이프와 같은 마그네틱 매체 (Magnetic Media)와, CD-ROM(Compact Disc Read Only Memory), DVD(Digital Versatile Disc)와 같은 광기록 매체(Optical Media)와, 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media)와, 그 리고 ROM(Read Only Memory), RAM(Random Access Memory), 플래시 메모리 등과 같은 프로그램 명령(예: 프로그 래밍 모듈)을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함될 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 본 발명의 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 본 발명의 다양한 실시 예에 따른 모듈 또는 프로그래밍 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함 하거나, 일부가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 모듈, 프로그래밍 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리 스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다 른 동작이 추가될 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 실시 예에 따른 의 기술 내용을 쉽게 설명 하고 본 발명의 실시 예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시 예의 범위를 한정 하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시 예의 범위는 여기에 개시된 실시 예들 이외에도 본 발 명의 다양한 실시 예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시 예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0061378", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른 정보 운용과 관련한 전자 장치를 개략적으로 도시한다. 도 2는 다양한 실시 예에 따른 정보 운용을 수행하는 전자 장치 정보 운용 시스템을 도시한다. 도 3은 다양한 실시 예에 따른 정보 운용 모듈을 도시한다. 도 4는 다양한 실시 예에 따른 정보 운용 방법을 도시한다. 도 5는 다양한 실시 예에 따른 전자 장치 상태에 따른 정보 운용 방법을 도시한다. 도 6은 다양한 실시 예에 따른 전자 장치의 슬립 상태 기반 정보 운용과 관련한 화면 인터페이스를 도시한다. 도 7은 다양한 실시 예에 따른 전자 장치의 락 상태 기반 정보 운용과 관련한 화면 인터페이스를 도시한다. 도 8은 다양한 실시 예에 따른 전자 장치의 정보 운용과 관련한 화면 인터페이스를 도시한다. 도 9는 다양한 실시 예에 따른 전자 장치의 다른 예를 나타낸 블록도이다."}
