{"patent_id": "10-2022-0006598", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0110973", "출원번호": "10-2022-0006598", "발명의 명칭": "모바일 기반 개인 맞춤형 피부진단 서비스시스템", "출원인": "김세용", "발명자": "김세용"}}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에서, 상기 피부 진단 엔진은,상기 이미지 입력부를 통해 입력된 피부 이미지를 인터페이스 하는 피부 이미지 인터페이스모듈;상기 피부 이미지 인터페이스모듈을 통해 인터페이스된 피부 이미지를 실시간 전처리하는 실시간 이미지 프로세스 모듈;상기 실시간 이미지 프로세스 모듈에서 전처리된 피부 이미지 데이터를 필터링하여 분석용 피부 이미지 데이터를 추출하는 데이터 필터링 모듈;상기 데이터 필터링 모듈에서 추출된 분석용 피부 이미지 데이터를 CNN 기반 딥러닝 추론 모델을 이용하여 분석하는 딥러닝 추론 엔진;상기 딥러닝 추론 엔진에서 분석한 결과와 피부관리 웹서버로부터 수신한 DNA 분석결과를 기초로 전문가 지식베이스와 연동하여 피부상태 진단 및 조치 정보를 생성하는 피부상태 진단 및 조치 모듈; 및상기 피부상태 진단 및 조치모듈에서 생성한 피부상태 진단 및 조치 정보를 화면에 디스플레이하는 피부상태 진단 및 조치 정보 표시모듈을 포함하는 것을 특징으로 하는 모바일 기반 개인 맞춤형 피부진단 서비스시스템."}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에서, 상기 이미지 입력부는,진단용 피부 이미지를 실시간 분석용으로 제공함과 동시에 피부관리 웹 서버에 학습 데이터로 제공하는 것을 특징으로 하는 모바일 기반 개인 맞춤형 피부진단 서비스시스템."}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에서, 상기 DNA 분석기관은 사용자가 제공해준 DNA 진단키트(DNA Test Kits)를 통해 채취된 DNA를 분석하고, DNA 분석 결과를 상기 피부관리 웹 서버에 업로드하며, 상기 피부관리 웹 서버는 업로드된 DNA 분석 결과를 상기 피부 진단 엔진에 전송해주는 것을 특징으로 하는 모바일 기반 개인 맞춤형 피부진단 서비스시스템."}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에서, 상기 피부 진단 엔진은, 피부관리 웹 서버로부터 딥러닝 학습모델을 다운-로드하여 피부 진단 엔진을 업데이트하는 것을 특징으로 하는모바일 기반 개인 맞춤형 피부진단 서비스시스템."}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에서, 상기 피부관리 웹 서버는,모바일로부터 업-로드되는 피부 이미지를 학습용 빅데이터로 저장하고, 인공지능 학습 이미지를 분석하여 특징을 추출하고, 추출한 특징에 최적화된 엔진 코드를 모바일 앱에 인스톨하여 피부 진단 엔진을 업데이트하는 것을 특징으로 하는 모바일 기반 개인 맞춤형 피부진단 서비스시스템."}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에서, 상기 피부 진단 엔진은 피부 상태 및 피부질환 예측 정보를 상기 피부관리 웹 서버에 전송하고,상기 피부관리 웹 서버로부터 전문가 지식을 기반으로 생성한 치료 방법을 수신하여 화면에 표출해주는 것을 특징으로 하는 모바일 기반 개인 맞춤형 피부진단 서비스시스템.공개특허 10-2023-0110973-3-청구항 7"}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에서, 상기 피부 진단 엔진은,상기 피부상태 진단 및 조치 모듈에서 생성한 조치 정보에 따른 플라즈마 발생 에너지 레벨을 설정하는 플라즈마 발생 에너지 레벨 설정모듈; 및상기 플라즈마 발생 에너지 레벨 설정모듈에서 설정된 플라즈마 발생 에너지 레벨에 따른 플라즈마 발생 에너지제어 데이터를 생성하고, 이를 블루투스 모듈을 통해 출력되도록 제어하는 플라즈마 발생 에너지 제어모듈을 더포함하는 것을 특징으로 하는 모바일 기반 개인 맞춤형 피부진단 서비스시스템."}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7에서, 상기 피부 진단 엔진은,상기 피부관리 웹 서버와 연동하여 추출한 특징에 최적화된 엔진 코드를 수신하여 상기 딥러닝 추론 엔진의 추론 모델을 업데이트하고, 전문가 지식을 기반으로 수신한 치료 방법을 수신하여 상기 딥러닝 추론 엔진에 전달하는 딥러닝 API를 더 포함하는 것을 특징으로 하는 모바일 기반 개인 맞춤형 피부진단 서비스시스템."}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에서, 상기 딥러닝 추론 엔진은,Residule Block을 도입한 CNN 딥러닝 추론 모델을 이용하여 피부 이미지 데이터를 분석하는 것을 특징으로 하는모바일 기반 개인 맞춤형 피부진단 서비스시스템."}
{"patent_id": "10-2022-0006598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에서, 상기 피부 진단 엔진과 블루투스 통신으로 접속되고, 수신한 플라즈마 발생 에너지 제어 데이터를 기초로 피부질환 개선용 플라즈마를 발생하는 플라즈마 발생기를 더 포함하는 것을 특징으로 하는 모바일 기반 개인 맞춤형피부진단 서비스시스템.공개특허 10-2023-0110973-4-"}
{"patent_id": "10-2022-0006598", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "모바일로 업-로드된 피부 이미지를 인공지능(AI) 엔진으로 분석하여 피부 상태 및 피부질환을 예측하고, 예측 결 과와 DNA 분석 결과를 기반으로 피부 분석 결과와 치료 방법을 제공하여 사용자가 모바일을 이용하여 피부를 관 리할 수 있도록 한 모바일 기반 개인 맞춤형 피부진단 서비스시스템에 관한 것으로서, 진단용 피부 이미지를 업- 로드하는 이미지 입력부, 이미지 입력부를 통해 입력된 이미지에 대해 탑재된 인공지능 엔진을 이용하여 학습된 특징을 비교 및 분석하는 이미지 패턴 분석과 DNA 분석기관에서 제공해주는 DNA 분석 결과를 기초로 피부 상태 및 피부 질환을 예측하는 피부 진단 엔진 및 분석한 피부 진단 결과 및 치료 방법을 화면에 표출해주는 피부 이 미지 진단결과 제공부를 포함하여, 모바일 기반 개인 맞춤형 피부진단 서비스시스템을 구축한다."}
{"patent_id": "10-2022-0006598", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 모바일 기반 개인 맞춤형 피부진단 서비스시스템에 관한 것으로, 특히 모바일로 업-로드된 피부 이미 지를 인공지능(AI) 엔진으로 분석하여 피부 상태 및 피부질환을 예측하고, 예측 결과와 DNA 분석 결과를 기반으 로 피부 분석 결과와 치료 방법을 제공하여 사용자가 모바일을 이용하여 피부를 관리할 수 있도록 한 모바일 기 반 개인 맞춤형 피부진단 서비스시스템에 관한 것이다."}
{"patent_id": "10-2022-0006598", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업혁명 시대가 도래하며, 인공지능 기술 발달이 가속화되면서 다양한 영상 데이터를 활용 목적에 따라 정 밀하게 가공하고 처리할 수 있으며, 안면 인식이나 동작 인식 등 신체 정보가 포함된 영상에 대해 식별을 기초 로 하는 응용 기술도 등장하고 있다. 한편, 피부 미용 관련 분야에서는 이용자의 피부 상태 측정을 기반으로 하여 추정된 상태에 따라 피부에 적합한 화장품을 이용자에게 추천하는 피부 관리 방법 등이 활용되고 있다. 이러한 방법을 활용하기 위하여, 이용자가 피부관리장치 등이 부착된 측정기기를 별도로 구입하여야 하거나 상 당한 사용료를 지출해야 하는 등 비용적인 부담이 발생하는 경우가 많으며, 이러한 기기의 제조사마다 다른 측 정 기준에 의한 편차로 인하여 표준화된 피부 관리에 어려움이 발생하게 된다. 이와 같은 문제를 해결하기 위해, 대한민국 등록특허공보 10-2211884와 같이, 사용자 단말로 바우만 피부타입 설문지(Baumann skin type questionnaire, BSTQ)를 전송하고, 사용자 단말로부터 바우만 피부타입 설문지에 대 해 설문조사 결과 데이터를 수신하여 피부 타입을 빅데이터 기반 인공지능 기계학습을 이용하여 진단하는 기술 이 제안되었다. 그러나 이러한 종래기술은 설문지 데이터를 빅데이터 기반으로 인공지능 기계학습을 이용한 피부관리 분석을 통 해, 피부상태, 사용제품 및 환경정보에 내재된 패턴을 학습하고 제품을 추천하는 방식으로서, 실제 사용자의 피 부 이미지를 이용하는 방식이 아니고 설문 데이터를 기반으로 피부 상태를 분석하는 방식이므로, 피부 분석에 정확성이 떨어지는 단점이 있다. 또한, 피부 타입에 대해서만 분석 가능하고 피부 질환에 대해서는 분석할 수 없는 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 10-2211884호(2021.01.28. 등록)(빅 데이터 기반 인공지능 기계학습을 이용 한 피부관리 추천 서비스 제공방법)"}
{"patent_id": "10-2022-0006598", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명은 상기와 같은 일반적인 피부 관리 방법 및 종래기술에서 발생하는 제반 문제점을 해결하기 위 해서 제안된 것으로서, 모바일로 업-로드된 피부 이미지를 인공지능(AI) 엔진으로 분석하여 피부 상태 및 피부 질환을 예측하고, 예측 결과와 DNA 분석 결과를 기반으로 피부 분석 결과와 치료 방법을 제공하여 사용자가 모 바일을 이용하여 피부를 관리할 수 있도록 한 모바일 기반 개인 맞춤형 피부진단 서비스시스템을 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2022-0006598", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여, 본 발명에 따른 \"모바일 기반 개인 맞춤형 피부진단 서비스시스템\" 은, 진단용 피부 이미지를 업-로드하는 이미지 입력부; 상기 이미지 입력부를 통해 입력된 이미지에 대해 탑재된 인공지능 엔진을 이용하여 학습된 특징을 비교 및 분 석하는 이미지 패턴 분석과 DNA 분석기관에서 제공해주는 DNA 분석 결과를 기초로 피부 상태 및 피부 질환을 예 측하는 피부 진단 엔진; 및 상기 피부 진단 엔진에서 분석한 피부 진단 결과 및 치료 방법을 화면에 표출해주는 피부 이미지 진단결과 제공 부를 포함하는 것을 특징으로 한다. 상기에서 이미지 입력부는, 진단용 피부 이미지를 실시간 분석용으로 제공함과 동시에 피부관리 웹 서버에 학습 데이터로 제공하는 것을 특 징으로 한다. 상기에서 DNA 분석기관은 사용자가 제공해준 DNA 진단키트(DNA Test Kits)에 저장된 DNA를 분석하고, DNA 분석 결과를 상기 피부관리 웹 서버에 업로드하며, 상기 피부관리 웹 서버는 업로드된 DNA 분석 결과를 상기 피부 진 단 엔진에 전송해주는 것을 특징으로 한다. 상기에서 피부 진단 엔진은, 피부관리 웹 서버로부터 딥러닝 학습모델을 다운-로드하여 피부 진단 엔진을 업데이트하는 것을 특징으로 한다. 상기에서 피부관리 웹 서버는, 모바일로부터 업-로드되는 피부 이미지를 학습용 빅데이터로 저장하고, 인공지능 학습 이미지를 분석하여 특징 을 추출하고, 추출한 특징에 최적화된 엔진 코드를 모바일 앱에 인스톨하여 피부 진단 엔진을 업데이트하는 것 을 특징으로 한다. 상기에서 피부 진단 엔진은 피부 상태 및 피부질환 예측 정보를 상기 피부관리 웹 서버에 전송하고, 상기 피부 관리 웹 서버로부터 전문가 지식을 기반으로 생성한 치료 방법을 수신하여 화면에 표출해주는 것을 특징으로 한 다. 상기에서 피부 진단 엔진은, 상기 이미지 입력부를 통해 입력된 피부 이미지를 인터페이스 하는 피부 이미지 인터페이스모듈; 상기 피부 이미지 인터페이스모듈을 통해 인터페이스된 피부 이미지를 실시간 전처리하는 실시간 이미지 프로세 스 모듈; 상기 실시간 이미지 프로세스 모듈에서 전처리된 피부 이미지 데이터를 필터링하여 분석용 피부 이미지 데이터 를 추출하는 데이터 필터링 모듈; 상기 데이터 필터링 모듈에서 추출된 분석용 피부 이미지 데이터를 CNN 기반 딥러닝 추론 모델을 이용하여 분석 하는 딥러닝 추론 엔진; 상기 딥러닝 추론 엔진에서 분석한 결과와 피부관리 웹서버로부터 수신한 DNA 분석결과를 기초로 전문가 지식베 이스와 연동하여 피부상태 진단 및 조치 정보를 생성하는 피부상태 진단 및 조치 모듈; 상기 피부상태 진단 및 조치모듈에서 생성한 피부상태 진단 및 조치 정보를 화면에 디스플레이하는 피부상태 진 단 및 조치 정보 표시모듈을 포함하는 것을 특징으로 한다. 또한, 상기 피부 진단 엔진은, 상기 피부상태 진단 및 조치 모듈에서 생성한 조치 정보에 따른 플라즈마 발생 에너지 레벨을 설정하는 플라즈 마 발생 에너지 레벨 설정모듈; 상기 플라즈마 발생 에너지 레벨 설정모듈에서 설정된 플라즈마 발생 에너지 레벨에 따른 플라즈마 발생 에너지 제어 데이터를 생성하고, 이를 블루투스 모듈을 통해 출력되도록 제어하는 플라즈마 발생 에너지 제어모듈을 더 포함하는 것을 특징으로 한다. 또한, 상기 피부 진단 엔진은, 피부 관리 웹 서버와 연동하여 추출한 특징에 최적화된 엔진 코드를 수신하여 상기 딥러닝 추론 엔진의 추론 모 델을 업데이트하고, 전문가 지식을 기반으로 수신한 치료 방법을 수신하여 상기 딥러닝 추론 엔진에 전달하는 딥러닝 API를 더 포함하는 것을 특징으로 한다. 상기에서 딥러닝 추론 엔진은, Residule Block을 도입한 CNN 딥러닝 추론 모델을 이용하여 피부 이미지 데이터를 분석하는 것을 특징으로 한다. 또한, 본 발명에 따른 \"모바일 기반 개인 맞춤형 피부진단 서비스시스템\"은, 상기 피부 진단 엔진과 블루투스 통신으로 접속되고, 수신한 플라즈마 발생 에너지 제어 데이터를 기초로 피부 질환 개선용 플라즈마를 발생하는 플라즈마 발생기를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0006598", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 모바일로 업-로드된 피부 이미지를 인공지능(AI) 엔진을 이용하여 분석하여 피부 상태 및 피 부질환을 예측하고, 피부 이미지 분석 결과와 DNA 분석 결과를 기반으로 피부 분석 결과와 치료 방법을 제공하 여 사용자가 모바일을 이용하여 피부를 관리할 수 있도록 도모해주는 효과가 있다. 또한, 본 발명에 따르면 플라즈마를 발생하는 플라즈마 발생기와 모바일에 장착된 피부 진단 엔진을 블루투스 통신으로 연동시켜, 피부 진단 엔진이 없는 플라즈마 발생기에서도 모바일에서 전송된 피부 진단 결과를 기반으 로 한 플라즈마 발생 에너지 제어 데이터를 기초로 최적의 피부 질환 개선용 플라즈마를 발생하여, 사용자의 피 부 질환 개선을 도모해줄 수 있는 효과가 있다."}
{"patent_id": "10-2022-0006598", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 바람직한 실시 예에 따른 모바일 기반 개인 맞춤형 피부진단 서비스시스템을 첨부된 도면을 참 조하여 상세하게 설명한다. 이하에서 설명되는 본 발명에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 안 되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념으로 적절하게 정의할 수 있 다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서 본 명세서에 기재된 실시 예와 도면에 도시된 구성은 본 발명의 바람직한 실시 예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원 시점에서 이들을 대체할 수 있는 다양한 균등물과 변형 예들이 있을 수 있음을 이해하여야 한다. 도 1은 본 발명에서 모바일 기반 개인 맞춤형 피부진단 서비스의 개념도로서, AI 이미지 분석 기술과 DNA 분석 기술을 조합하여, 개인 피부 질환을 예측하고, 예측한 개인 피부 질환 정보를 기초로 피부 질환 개선을 위한 개 인 맞춤형 추천 및 관리 정보를 제공해준다. 여기서 개인 맞춤형 추천 및 관리는 AI 추천, 전문가 의견 및 추천, 사용자 주변 의사/병원 추천을 통한 치료 방법을 추천해줄 수 있으며, 피부질환 개선을 위한 임상 및 효과가 검증된 기능성 제품(예를 들어, BIO 펩티드및 기능성 소재)을 추천해줄 수 있으며, 지속적인 관리 및 모니터링을 통해 지속적인 관리를 수행한다. 도 2는 본 발명에 따른 \"모바일 기반 개인 맞춤형 피부진단 서비스시스템\"의 구성도로서, 크게 피부 진단 엔진 이 설치된 스마트폰과 같은 모바일, 플라즈마 발생기 및 피부관리 웹서버를 포함할 수 있다. 상기 피부관리 웹 서버는 모바일로부터 업-로드되는 피부 이미지를 학습용 빅데이터로 저장하고, 인 공지능 학습 이미지를 분석하여 특징을 추출하고, 추출한 특징에 최적화된 엔진 코드를 모바일에 내장된 피부관리 애플리케이션(앱)에 인스톨하여 피부 진단 엔진을 업데이트하는 역할을 한다. 아울러 피부관리 웹 서버는 전문 DNA 분석기관에서 사용자가 제공해준 DNA 진단키트(DNA Test Kits)에 저 장된 DNA를 분석하고, DNA 분석 결과를 업로드하면, 이를 저장하고, 업로드된 DNA 분석 결과를 상기 모바일 의 피부 진단 엔진에 전송해주는 역할을 한다. 모바일은 진단용 피부 이미지를 업-로드하는 이미지 입력부, 상기 이미지 입력부를 통해 입력된 이미지에 대해 탑재된 인공지능 엔진을 이용하여 학습된 특징을 비교 및 분석하는 이미지 패턴 분석과 DNA 분석 기관에서 제공해주는 DNA 분석 결과를 기초로 피부 상태 및 피부 질환을 예측하는 피부 진단 엔진, 및 상 기 피부 진단 엔진에서 분석한 피부 진단 결과 및 치료 방법을 화면에 표출해주는 피부 이미지 진단결과 제공부를 포함할 수 있다. 상기 이미지 입력부는 진단용 피부 이미지를 실시간 분석용으로 제공함과 동시에 피부관리 웹 서버에 학습 데이터로 제공하는 역할을 한다. 이를 위해 피부 촬영용 카메라와 영상처리모듈을 포함할 수 있다. 상기 피부 진단 엔진은 상기 피부관리 웹 서버로부터 딥러닝 학습모델을 다운-로드하여 피부 진단 엔 진을 업데이트한다. 아울러 상기 피부 진단 엔진은 피부 상태 및 피부질환 예측 정보를 상기 피부관리 웹 서버에 전송하 고, 상기 피부관리 웹 서버로부터 전문가 지식을 기반으로 생성한 치료 방법을 수신하여 화면에 표출해줄 수 있다. 이러한 피부 진단 엔진은 상기 이미지 입력부를 통해 입력된 피부 이미지를 인터페이스하는 피부 이 미지 인터페이스 모듈, 상기 피부 이미지 인터페이스 모듈을 통해 인터페이스된 피부 이미지를 실시 간 전처리하는 실시간 이미지 프로세스 모듈, 상기 실시간 이미지 프로세스 모듈에서 전처리된 피부 이미지 데이터를 필터링하여 분석용 피부 이미지 데이터를 추출하는 데이터 필터링 모듈, 상기 데이터 필 터링 모듈에서 추출된 분석용 피부 이미지 데이터를 CNN 기반 딥러닝 추론 모델을 이용하여 분석하는 딥러 닝 추론 엔진, 상기 딥러닝 추론 엔진에서 분석한 결과와 피부관리 웹서버로부터 수신한 DNA 분 석결과를 기초로 전문가 지식베이스와 연동하여 피부상태 진단 및 조치 정보를 생성하는 피부상태 진단 및 조치 모듈, 상기 피부상태 진단 및 조치모듈에서 생성한 피부상태 진단 및 조치 정보를 화면에 디스플레이 하는 피부상태 진단 및 조치 정보 표시모듈을 포함한다. 또한, 상기 피부 진단 엔진은 상기 피부상태 진단 및 조치 모듈에서 생성한 조치 정보에 따른 플라즈 마 발생 에너지 레벨을 설정하는 플라즈마 발생 에너지 레벨 설정모듈, 상기 플라즈마 발생 에너지 레벨 설정모듈에서 설정된 플라즈마 발생 에너지 레벨에 따른 플라즈마 발생 에너지 제어 데이터를 생성하고, 이를 블루투스 모듈을 통해 출력되도록 제어하는 플라즈마 발생 에너지 제어모듈을 더 포함할 수 있다. 또한, 상기 피부 진단 엔진은 상기 피부관리 웹 서버와 연동하여 추출한 특징에 최적화된 엔진 코드 를 수신하여 상기 딥러닝 추론 엔진의 추론 모델을 업데이트하고, 전문가 지식을 기반으로 수신한 치료 방 법을 수신하여 상기 딥러닝 추론 엔진에 전달하는 딥러닝 API를 더 포함할 수 있다. 상기 딥러닝 추론 엔진은 Residule Block을 도입한 CNN 딥러닝 추론 모델을 이용하여 피부 이미지 데이터 를 분석할 수 있다. 플라즈마 발생기는 상기 피부 진단 엔진과 블루투스 통신으로 접속되고, 수신한 플라즈마 발생 에너 지 제어 데이터를 기초로 피부 질환 개선용 플라즈마를 사용자의 피부에 발생하는 역할을 한다. 이와 같이 구성된 본 발명에 따른 \"모바일 기반 개인 맞춤형 피부진단 서비스시스템\"의 동작을 첨부한 도면 도 2 내지 도 8을 참조하여 구체적으로 설명하면 다음과 같다.먼저, 자가로 피부 진단을 하고자 하는 사용자는 휴대한 모바일에 피부 진단 애플리케이션을 설치한다. 여기서 피부 진단 애플리케이션에는 피부관리 웹 서버로부터 인스톨(install)된 피부 진단 엔진을 포 함한다. 상기 피부관리 웹 서버는 다수의 모바일로부터 업-로드되는 피부 이미지를 학습용 빅데이터로 저장하고, 인공지능 학습 이미지를 분석하여 특징을 추출하고, 추출한 특징에 최적화된 엔진 코드를 피부관리 애플리케이 션(앱)에 인스톨하여 피부 진단 엔진을 업데이트한다. 따라서 사용자가 피부 진단 애플리케이션을 설치하면, 피부 진단 엔진도 함께 설치된다. 사용자는 피부 상태 자가 진단을 위해 피부 이미지를 이용하는 것과 DNA 분석을 이용하는 두 가지 방법을 통해 자신의 피부의 상태를 진단해 볼 수 있다. DNA 분석을 이용한 피부 상태 진단을 위해, 모바일을 이용하여 피부관리 웹서버에 사용자로 등록을 하고, 등록된 내용을 DNA 분석기관(DNA Test Lab)에 발송한다. DNA 분석기관은 사용자 정보를 수신하면 상기 피 부관리 웹서버와 연동하여 사용자를 확인하고, 등록된 사용자이면 사용자가 등록해 놓은 주소정보를 기초 로 DNA 진단키트를 사용자에게 발송한다. 사용자는 DNA 진단키트를 수령하면 제공해주는 DNA 채취 방법에 따라 DNA 진단키트를 이용하여 DNA를 채취한 후, DNA 진단키트를 상기 DNA 분석기관에 발송한다. DNA 분석기관은 도 3에 도시한 바와 같이, DNA 진단키트를 통해 채취한 DNA를 정해진 분석방법으로 분석하고, DNA 분석 결과(피부 유전자 분석결과)를 피부관리 웹서버에 업로드한다. 상기 DNA 분석 결과는 피부질환 위험도를 미리 예측해보는 정보로 활용된다. 여기서 DNA 분석 진행 상황정보는 사용자 모바일로 전송하여, 사용자도 DNA 분석 진행 과정을 인지할 수 있도록 한다. 도 3에서 DNA 분석은 전문 DNA 분석기관에서 수행하고, 위험도 분석 및 개인 맞춤형 예측은 모바일의 피부 진단 엔진에서 수행한다. 상기 피부관리 웹 서버는 상기 전문 DNA 분석기관에서 사용자가 제공해준 DNA 진단키트(DNA Test Kits)에 채취된 DNA를 분석하고, DNA 분석 결과를 업로드하면 이를 데이터베이스에 사용자 정보와 매칭하여 저장하고, 업로드된 DNA 분석 결과를 상기 모바일의 피부 진단 엔진에 전송해준다. 아울러 사용자는 피부 진단을 위해 이미지 입력부를 이용하여 진단용 피부 이미지를 피부 진단 엔진 에 전달한다. 즉, 이미지 입력부는 피부 촬영용 카메라와 영상처리모듈을 포함하고, 피부 촬영용 카메라를 이용하여 진단할 피부를 촬영하고, 영상처리모듈에서는 피부 촬영용 카메라로부터 측정한 피부 이미지를 전처리 하고 이를 피부 진단 엔진에 전달한다. 아울러 상기 이미지 입력부는 피부 이미지 전처리된 진단용 피부 이미지를 실시간 분석용으로 상기 피부 진단 엔진에 제공함과 동시에 피부관리 웹 서버에 학습 데이터로 제공한다. 상기 피부 진단 엔진은 상기 이미지 입력부를 통해 입력된 진단용 피부 이미지에 대해 탑재된 인공지 능 엔진을 이용하여 학습된 특징을 비교 및 분석하는 이미지 패턴 분석과 상기 피부관리 웹서버를 통해 획 득한 DNA 분석기관에서 제공해주는 DNA 분석 결과를 기초로 피부 상태 및 피부 질환을 예측한다. 상기 피부 진단 엔진은 상기 피부관리 웹 서버로부터 딥러닝 학습모델을 다운-로드하여 피부 진단 엔 진을 업데이트한다. 예컨대, 상기 피부 진단 엔진은 딥러닝 API를 통해 상기 피부관리 웹 서버와 연동하여 추출한 특징에 최적화된 엔진 코드를 수신하여 딥러닝 추론 엔진의 추론 모델을 업데이트한다. 상기 딥러닝 추론 엔진은 Residule Block을 도입한 CNN 딥러닝 추론 모델을 이용하여 피부 이미지 데이터를 분석할 수 있다. 도 2는 피부 상태 분석 및 진단을 위한 분석 프로세스로서, 모바일 카메라를 통해 피부를 촬영하고, 영상처리모 듈을 통해 촬영된 사진을 캡쳐하며, 피부 진단 엔진에서 인공지능/딥러닝 기술로 피부상태를 분석하고, 인공지 능/딥러닝 분석 기술로 피부상태를 진단한다. 이를 구체적으로 설명하면 다음과 같다. 도 5 및 도 7에 도시한 바와 같이, 피부 이미지 인터페이스 모듈은 상기 이미지 입력부를 통해 입력 된 피부 이미지(500×500 RGB)를 인터페이스하고, 이렇게 인터페이스된 피부 이미지는 실시간 이미지 프로세스 모듈을 통해 실시간 전처리(Data Augmentation)가 이루어진다. 여기서 전처리는 영상 이미지를 전처리하는 과정으로서, 통상의 영상처리기법에서 일반적으로 수행하는 영상 전처리 기술이다. 다음으로, 데이터 필터링 모듈(1230에서 상기 실시간 이미지 프로세스 모듈에서 전처리된 피부 이미지 데 이터(Augmented Image(50×50))를 필터링하여 분석용 피부 이미지 데이터를 추출한다. 분석용 피부 이미지 데이 터 추출을 위해 1차 슬라이딩 윈도(Sliding Window)와 피부 탐지 기술(Binary Classification), 2차 슬라이딩 윈도(Sliding Window)를 이용할 수 있다. 이어, 딥러닝 추론 엔진에서 상기 데이터 필터링 모듈에서 추출된 분석용 피부 이미지 데이터를 CNN 기반 딥러닝 추론 모델을 이용하여 분석한다. 여기서 CNN 기반 딥러닝 추론 모델은 Softmax 분류 모델을 이용하 여 피부 이미지를 미리 설정된 6가지 유형으로 추론하여 피부염 유형을 예측한다. 다음으로, 피부상태 진단 및 조치 모듈은 상기 딥러닝 추론 엔진에서 피부 이미지를 분석한 결과와 상기 피부관리 웹서버로부터 수신한 DNA 분석결과를 기초로 전문가 지식베이스와 연동하여 피부상태 진단 및 조치 정보를 생성한다. 피부 이미지를 이용한 피부 상태 진단은 상기 예측한 피부염 유형 정보를 이용하여 추론을 통해 피부염을 진단 한다. 아울러 DNA 분석 결과를 이용한 피부상태 진단은, 도 6에 도시한 바와 같이, 개인 간의 변이를 분석하고, 분석 결과를 이용하여 미리 설정된 피부 질환 위험도 계산 알고리즘을 이용하여 피부 질환 위험도를 계산한다. 다음 으로, 계산된 피부 질환 위험도 예측 값을 이용하여 피부관리 웹서버와 연동하여 피부 질환 개선을 위한 예방 방안을 추천한다. 피부 질환 개선을 위한 예방 방안 및 조치는 상술한 도 1에서 개인 맞춤형 추천 및 관리 정보를 참조하기로 한 다. 아울러 피부상태 진단 및 조치 정보 표시모듈은 상기 피부상태 진단 및 조치모듈에서 생성한 피부상 태 진단 및 조치 정보를 화면에 디스플레이하도록 피부 이미지 진단결과 제공부에 전달한다. 상기 피부 이미지 진단결과 제공부는 상기 피부 진단 엔진에서 분석한 피부 진단 결과 및 치료 방법 을 화면에 표출해주어, 사용자가 자신의 피부 진단 상태를 인지하도록 한다. 여기서 피부 진단 엔진은 피부 상태 및 피부질환 예측 정보를 상기 피부관리 웹서버에 전송하고, 상 기 피부관리 웹 서버로부터 전문가 지식을 기반으로 생성한 치료 방법 및 피부질환 개선 방안을 수신하여 화면에 표출해줄 수 있다. 도 8은 사용자 맞춤형 피부 진단 결과 보고서의 예시이다. 맞춤형 피부 진단 결과 보고서는 피부 건강 정보, 피 부 나이 정보, 피부 건강 상세 정보 등을 포함할 수 있다. 사용자는 화면에 표출되는 피부 진단 결과 보고서를 통해 자신의 피부 상태를 인지할 수 있으며, 제공되는 치부 질환 개선 방안을 이용하여 해당 조치를 취하여 자신의 피부 질환 등을 개선할 수 있다. 여기서 피부 질환 개선을 위한 하나의 방법으로서 플라즈마를 이용할 수 있다. 예컨대, 사용자는 플라즈마 발생기는 있으나, 이러한 플라즈마 발생기는 피부 질환 개선을 위한 플라 즈마는 발생할 수 있으나, 자신의 피부 상태를 진단해주는 기능은 없다. 따라서 이러한 플라즈마 발생기의 단점을 보완하기 위해서, 상기 플라즈마 발생기와 모바일을 블루투스로 연동하고, 모바일의 피부 진단 엔진을 통해 자신의 피부 상태를 정확히 진단하고, 진단 결과에 따른 플라즈마 발생 제어정보를 생성하여 상기 플라즈마 발생기에 제공하여, 플라즈마 발생을 최적으로 제 어하면 효과적으로 피부 질환을 개선할 수 있다. 예컨대, 상기 피부 진단 엔진의 플라즈마 발생 에너지 레벨 설정모듈은 상기 피부상태 진단 및 조치 모듈에서 생성한 조치 정보에 따른 플라즈마 발생 에너지 레벨을 설정한다. 사전에 데이터베이스에 피부상 태 진단 결과에 따라 피부질환 개선을 위한 플라즈마 발생 에너지 레벨이 테이블형태로 저장된 것으로 가정한다. 이렇게 설정된 플라즈마 발생 에너지 레벨은 플라즈마 발생 에너지 제어모듈을 통해 플라즈마 발생 에너지 제어 데이터로 생성되고, 생성된 플라즈마 발생 에너지 제어 데이터는 블루투스 모듈을 통해 플라즈마 발생기 에 전송된다. 상기 플라즈마 발생기는 상기 피부 진단 엔진과 블루투스 통신으로 접속되고, 수신한 플라즈마 발생 에너지 제어 데이터를 기초로 피부 질환 개선용 플라즈마를 사용자의 피부에 발생하여, 사용자의 피부 질환 개 선기능을 수행한다. 따라서 피부 진단 엔진이 없는 단순한 플라즈마 발생기에서도 모바일과 연동하여, 사용자의 피부 질환을 최적으 로 개선할 수 있게 된다. 이상 상술한 본 발명에 따르면 모바일로 업-로드된 피부 이미지를 인공지능(AI) 엔진으로 학습된 이미지의 패턴 을 모바일에서 분석하여 피부 상태 및 피부질환을 예측하고, 피부 이미지 분석 결과와 DNA 분석 결과를 기반으 로 피부 분석 결과와 치료 방법을 제공하여 사용자가 모바일을 이용하여 피부를 관리할 수 있도록 도모해준다. 또한, 본 발명에 따르면 단순히 플라즈마만을 발생하는 플라즈마 발생기와 모바일에 장착된 피부 진단 엔진을 블루투스 통신으로 연동시켜, 피부 진단 엔진이 없는 플라즈마 발생기에서도 모바일에서 전송된 플라즈마 발생 에너지 제어 데이터를 기초로 최적의 피부 질환 개선용 플라즈마를 발생하여, 사용자의 피부 질환 개선을 도모 할 수 있다. 이상 본 발명자에 의해서 이루어진 발명을 상기 실시 예에 따라 구체적으로 설명하였지만, 본 발명은 상기 실시"}
{"patent_id": "10-2022-0006598", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되는 것은 아니고 그 요지를 이탈하지 않는 범위에서 여러 가지로 변경 가능한 것은 이 기술분야에서 통상의 지식을 가진 자에게 자명하다."}
{"patent_id": "10-2022-0006598", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에서 모바일 기반 개인 맞춤형 피부진단 서비스의 개념도, 도 2는 본 발명에서 촬영된 피부 이미지를 기초로 피부상태를 진단하는 예시도, 도 3은 본 발명에서 사용자 DNA를 이용하여 피부 질환 위험도를 분석하는 예시도, 도 4는 본 발명의 바람직한 실시 예에 따른 모바일 기반 개인 맞춤형 피부진단 서비스시스템의 구성도, 도 5는 본 발명에서 피부 이미지를 이용한 피부질환 위험도 예측 알고리즘 구성도, 도 6은 본 발명에서 DNA 분석 기술을 이용한 피부질환 위험도 예측 개념도, 도 7은 본 발명에서 딥러닝 AI 기술을 이용하여 피부 이미지를 분석하여 피부 상태를 예측하는 개념도, 도 8은 본 발명에서 모바일을 통해 제공되는 맞춤형 피부 관리 보고서의 예시도이다."}
