{"patent_id": "10-2019-0168250", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0076748", "출원번호": "10-2019-0168250", "발명의 명칭": "진료 정보 제공 장치 및 방법", "출원인": "건국대학교 글로컬산학협력단", "발명자": "정혜경"}}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "진료 정보 제공 방법에 있어서,사용자 단말로부터 진료 희망 시간을 포함하는 사용자 입력을 수신하는 단계;병원 단말로부터 진료 접수 현황 정보를 획득하고, 상기 진료 접수 현황 정보에 기초하여 상기 진료 희망 시간에서의 예상 대기 시간을 산출하는 단계; 및상기 사용자 단말로 상기 예상 대기 시간을 포함하는 진료 대기 정보를 제공하는 단계,를 포함하는, 진료 정보 제공 방법."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 진료 접수 현황 정보는,상기 병원 단말과 연계된 병원에 기 접수된 대기자의 수 정보 및 상기 대기자 각각의 진료 유형 정보를 포함하는 것인, 진료 정보 제공 방법."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 예상 대기 시간을 산출하는 단계는,상기 진료 유형 정보에 기초하여 상기 대기자 각각의 예상 진료 시간을 산출하는 단계를 포함하는 것인, 진료정보 제공 방법."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 사용자 단말로부터 진료 접수 요청을 수신하여 상기 병원 단말로 진료 접수를 요청하는 단계; 및상기 병원 단말로부터 상기 진료 접수 요청에 따른 진료 접수 처리 정보를 수신하고, 상기 진료 접수 처리 정보를 상기 사용자 단말로 전송하는 단계,를 더 포함하는 것인, 진료 정보 제공 방법."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 진료 접수 요청은,상기 사용자 단말의 사용자의 인적 사항 정보 및 상세 증상 정보를 포함하고,상기 병원 단말로 진료 접수를 요청하는 단계는,상기 사용자 단말로부터 기 확보된 인적 사항 정보가 존재하는 경우, 상기 기 확보된 인적 사항 정보를 상기 병원 단말로 전송하는 것인, 진료 정보 제공 방법."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 진료 접수 처리 정보에 기초하여 상기 예상 대기 시간이 기 설정된 임계값 이하이면, 상기 사용자 단말로공개특허 10-2021-0076748-3-알람을 전송하는 단계,를 더 포함하는, 진료 정보 제공 방법."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 진료 대기 정보를 제공하는 단계는,상기 병원 단말과 연계된 병원에 마련된 대기 공간을 촬영한 CCTV 영상을 상기 사용자 단말로 제공하는 단계를포함하는 것인, 진료 정보 제공 방법."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 병원 단말로부터 전자 처방전 정보를 획득하는 단계; 및상기 전자 처방전 정보를 상기 사용자 단말로 전송하는 단계,를 더 포함하는 것인, 진료 정보 제공 방법."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "진료 정보 제공 장치에 있어서,사용자 단말로부터 진료 희망 시간을 포함하는 사용자 입력을 수신하고, 병원 단말로부터 진료 접수 현황 정보를 획득하고, 상기 사용자 단말로 예상 대기 시간을 포함하는 진료 대기 정보를 전송하는 대기 정보 제공부; 및상기 진료 접수 현황 정보에 기초하여 상기 진료 희망 시간에서의 상기 예상 대기 시간을 산출하는 연산부,를 포함하는, 진료 정보 제공 장치."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 진료 접수 현황 정보는,상기 병원 단말과 연계된 병원에 기 접수된 대기자의 수 정보 및 상기 대기자 각각의 진료 유형 정보를 포함하고,상기 연산부는,상기 진료 유형 정보에 기초하여 상기 대기자 각각의 예상 진료 시간을 산출하는 것인, 진료 정보 제공 장치."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 사용자 단말로부터 진료 접수 요청이 수신되면, 상기 병원 단말로 진료 접수를 요청하고, 상기 병원 단말로부터 상기 진료 접수 요청에 따른 진료 접수 처리 정보가 수신되면, 상기 진료 접수 처리 정보를 상기 사용자단말로 전송하는 접수 처리부,를 더 포함하는, 진료 정보 제공 장치."}
{"patent_id": "10-2019-0168250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 진료 접수 처리 정보에 기초하여 상기 예상 대기 시간이 기 설정된 임계값 이하이면, 상기 사용자 단말로알람을 전송하는 알람 생성부,를 더 포함하는, 진료 정보 제공 장치.공개특허 10-2021-0076748-4-"}
{"patent_id": "10-2019-0168250", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "진료 정보 제공 장치 및 방법이 개시되며, 본원의 일 실시예에 따른 진료 정보 제공 방법은, 사용자 단말로부터 진료 희망 시간을 포함하는 사용자 입력을 수신하는 단계, 병원 단말로부터 진료 접수 현황 정보를 획득하고, 상 기 진료 접수 현황 정보에 기초하여 상기 진료 희망 시간에서의 예상 대기 시간을 산출하는 단계 및 상기 사용자 단말로 상기 예상 대기 시간을 포함하는 진료 대기 정보를 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2019-0168250", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 진료 정보 제공 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0168250", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 의료 장비의 첨단화, 의료와 IT 기술의 융합으로 개인별 맞춤 의료 및 등 의료산업이 급속하게 변화 해가고 있으며 이에 따라 환자들의 니즈는 점점 다양화/고차원화 되고 있다. 그러나 상술한 의료 서비스의 기술 수준 향상에 비하여 병원을 방문하는 환자들의 접수 절차가 복잡하고 접수 대기 시간, 진료 대기 시간 등이 길 어지는 불편함에 대한 개선책은 미비한 실정이다. 이러한 긴 대기시간은 병원 의료 서비스 이용자의 주요 불만 으로 나타나고 있다. 구체적으로, 환자가 병원을 방문하면 일반적으로 접수, 대기, 진료, 결제, 처방전 발행 등의 수속을 밟게 된다. 접수를 하면 진료 관련 서류 또는 접수증을 소지하고 진료 순서를 기다려 진료실에서 의사의 진료를 받게 된다. 이러한 병원에서의 수속 절차는 환자와 병원 모두에 불편을 야기하는데 환자의 경우, 접수를 위해 순번표를 받 고 일정시간 대기한 후에야 접수가 이루어지고, 접수가 완료되어 진료실에 대기자로 등록된 후에도 상당 시간을 검사 또는 진료를 받기 위해 대기하여야 하는 불편함이 있다. 그러나, 환자 입장에서 병원에 실제로 방문하기 전 해당 병원에서 진료를 받을 때까지의 정확한 대기 정보를 확인하는 루트는 거의 존재하지 않으며, 병원 방문 전 유선 전화 등을 통해 병원 근무자에게 대기자의 수나 대기 시간을 문의하더라도 병원에서 제공한 정보와 실 제 병원을 방문하여 겪게 되는 대기 시간의 편차가 큰 경우가 대부분이다. 또한, 단순히 현재 대기자가 몇 명인 지 알게 되더라도 대기자마다 진료 유형이 상이하여 대기자 각각의 진료 시간이 상이하므로 정확한 대기 시간을 예측하기 어렵다는 문제가 있다. 또한, 접수증, 검사표, 처방전 등 종이 형태로 인쇄되어 지급되는 서류들은 환자에게 휴대의 불편을 야기함은 물론 분실의 염려도 존재하는데, 특히 분실 시에는 개인 정보 유출의 문제까지 발생할 가능성이 있다. 한편, 병 원 입장에서도 접수증, 검사표 등의 서류 발급에 필요한 인력 배치가 필요하고 접수 관리 인력의 상주에 의해, 운영 예산이 증가하는 문제가 있다. 본원의 배경이 되는 기술은 한국등록특허공보 제10-1769480호에 개시되어 있다."}
{"patent_id": "10-2019-0168250", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 병원의 접수 현황에 기초하여 해당 병원 방문시 의 정확한 대기 시간 정보를 산출하여 제공하고, 병원에의 접수를 지원하는 진료 정보 제공 장치 및 방법을 제 공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 병원에 진료가 접수된 후 접수된 진료 순서가 도 래하기 전 사용자 단말을 통해 알람을 제공할 수 있는 진료 정보 제공 장치 및 방법을 제공하려는 것을 목적으 로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2019-0168250", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 진료 정보 제공 방법은, 사 용자 단말로부터 진료 희망 시간을 포함하는 사용자 입력을 수신하는 단계, 병원 단말로부터 진료 접수 현황 정 보를 획득하고, 상기 진료 접수 현황 정보에 기초하여 상기 진료 희망 시간에서의 예상 대기 시간을 산출하는 단계 및 상기 사용자 단말로 상기 예상 대기 시간을 포함하는 진료 대기 정보를 제공하는 단계를 포함할 수 있 다. 또한, 상기 진료 접수 현황 정보는, 상기 병원 단말과 연계된 병원에 기 접수된 대기자의 수 정보 및 상기 대기 자 각각의 진료 유형 정보를 포함할 수 있다.또한, 상기 예상 대기 시간을 산출하는 단계는, 상기 진료 유형 정보에 기초하여 상기 대기자 각각의 예상 진료 시간을 산출하는 단계를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 진료 정보 제공 방법은, 상기 사용자 단말로부터 진료 접수 요청을 수신하여 상 기 병원 단말로 진료 접수를 요청하는 단계 및 상기 병원 단말로부터 상기 진료 접수 요청에 따른 진료 접수 처 리 정보를 수신하고, 상기 진료 접수 처리 정보를 상기 사용자 단말로 전송하는 단계를 포함할 수 있다. 또한, 상기 진료 접수 요청은, 상기 사용자 단말의 사용자의 인적 사항 정보 및 상세 증상 정보를 포함할 수 있 다. 또한, 상기 병원 단말로 진료 접수를 요청하는 단계는, 상기 사용자 단말로부터 기 확보된 인적 사항 정보가 존 재하는 경우, 상기 기 확보된 인적 사항 정보를 상기 병원 단말로 전송할 수 있다. 또한, 본원의 일 실시예에 따른 진료 정보 제공 방법은, 상기 진료 접수 처리 정보에 기초하여 상기 예상 대기 시간이 기 설정된 임계값 이하이면, 상기 사용자 단말로 알람을 전송하는 단계를 포함할 수 있다. 또한, 상기 진료 대기 정보를 제공하는 단계는, 상기 병원 단말과 연계된 병원에 마련된 대기 공간을 촬영한 CCTV 영상을 상기 사용자 단말로 제공하는 단계를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 진료 정보 제공 방법은, 상기 병원 단말로부터 전자 처방전 정보를 획득하는 단 계 및 상기 전자 처방전 정보를 상기 사용자 단말로 전송하는 단계를 포함할 수 있다. 한편, 본원의 일 실시예에 따른 진료 정보 제공 장치는, 사용자 단말로부터 진료 희망 시간을 포함하는 사용자 입력을 수신하고, 병원 단말로부터 진료 접수 현황 정보를 획득하고, 상기 사용자 단말로 예상 대기 시간을 포 함하는 진료 대기 정보를 전송하는 대기 정보 제공부 및 상기 진료 접수 현황 정보에 기초하여 상기 진료 희망 시간에서의 상기 예상 대기 시간을 산출하는 연산부를 포함할 수 있다. 또한, 상기 진료 접수 현황 정보는, 상기 병원 단말과 연계된 병원에 기 접수된 대기자의 수 정보 및 상기 대기 자 각각의 진료 유형 정보를 포함할 수 있다. 또한, 상기 연산부는, 상기 진료 유형 정보에 기초하여 상기 대기자 각각의 예상 진료 시간을 산출할 수 있다. 또한, 본원의 일 실시예에 따른 진료 정보 제공 장치는, 상기 사용자 단말로부터 진료 접수 요청이 수신되면, 상기 병원 단말로 진료 접수를 요청하고, 상기 병원 단말로부터 상기 진료 접수 요청에 따른 진료 접수 처리 정 보가 수신되면, 상기 진료 접수 처리 정보를 상기 사용자 단말로 전송하는 접수 처리부를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 진료 정보 제공 장치는, 상기 진료 접수 처리 정보에 기초하여 상기 예상 대기 시간이 기 설정된 임계값 이하이면, 상기 사용자 단말로 알람을 전송하는 알람 생성부를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2019-0168250", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 병원의 접수 현황에 기초하여 해당 병원 방문시의 정확한 대기 시간 정보를 산출하여 제공하고, 병원에의 접수를 지원하는 진료 정보 제공 장치 및 방법을 제공할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 병원에 진료가 접수된 후 접수된 진료 순서가 도래하기 전 사용자 단 말을 통해 알람을 제공할 수 있는 진료 정보 제공 장치 및 방법을 제공할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 병원에 실제로 도착하기 전 진료 접수를 원격에서 미리 처리할 수 있 는 접수 스마트 오더 서비스를 제공할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2019-0168250", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 진료 정보 제공 장치 및 방법에 관한 것이다. 도 1은 본원의 일 실시예에 따른 진료 정보 제공 시스템의 개략적인 구성도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 진료 정보 제공 시스템은, 진료 정보 제공 장치, 사용자 단말, 보호자 단말, 병원 단말 및 약국 단말을 포함할 수 있다. 진료 정보 제공 장치, 사용자 단말, 보호자 단말, 병원 단말 및 약국 단말 상호간은 네트워크를 통해 통신할 수 있다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호간에 정보 교 환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다.사용자 단말 및 보호자 단말은 예를 들면, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC 등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치일 수 있다. 본원의 실시예에 관한 설명에서 보호자 단말은, 사용자 단말의 사용자의 보호자(부모, 자녀, 가족, 사회복지사 등)에 해당하는 주체가 보유한 단말일 수 있다. 본원의 일 실시예에 따르면, 보호자 단말은 본 원의 진료 정보 제공 장치에 의해 제공되는 어플리케이션 기반 서비스에 대한 사용자 단말의 최초 가 입시 또는 어플리케이션 기반 서비스 사용 도중 사용자 단말에 의해 인가되는 보호자 등록 입력에 기초하 여 설정되어 진료 정보 제공 장치에 등록되는 것일 수 있다. 특히 본원의 실시예에 관한 설명에서 보호자 단말은 사용자 단말에 제공되는 각종 대기 관련 정보, 접수 관련 정보, 처방 관련 정보, 알람 정보 등을 사용자 단말과 함께 획득할 수 있다. 또한, 본원의 실시예에 관한 설명에서 병원 단말은 병원에 방문한 복수의 환자의 인적 사항 정보, 진료 정 보 등을 보유하여 통합 관리하고, 소정의 사용자에 대한 진료 접수 및 진료 예약 절차 등을 처리하기 위해 병원 측이 보유하는 단말 또는 서버일 수 있다. 또한, 본원의 실시예에 관한 설명에서 약국 단말은 약국에 방문한 복수의 환자의 인적 사항 정보, 진료 정 보, 처방전 정보 등을 보유하여 통합 관리하고, 소정의 사용자에 대한 처방전 접수 절차 등을 처리하기 위해 약 국 측이 보유하는 단말 또는 서버일 수 있다. 본원에서의 진료 정보 제공 장치는 임의의 사용자(예를 들면, 어플리케이션 기반 서비스의 회원)에게 병원 또는 약국에서의 대기 정보를 제공하고 진료, 처방 등의 접수 프로세스를 지원하고 의료 관련 제반 사항 등을 사용자 단말을 통해 용이하게 관리할 수 있도록 어플리케이션 기반 서비스를 제공하는 주체일 수 있다. 예를 들 어, 진료 정보 제공 장치는 어플리케이션 기반 서비스를 제공하는 단말 또는 서버일 수 있다. 도 2는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 초기 인터페이스를 예시 적으로 나타낸 도면이다. 특히, 도 2는 진료 정보 제공 장치에 의해 제공되는 어플리케이션 기반 서비스가 사용자 단말에서 실행되는 경우 표시되는 초기 인터페이스를 나타낸 것일 수 있다. 도 2를 참조하면, 진료 정보 제공 장치에 의해 제공되는 어플리케이션 기반 서비스의 초기 인터페이스는 진료 대기 정보를 제공하는 섹션(A), 병원 방문 이력 정보를 제공하는 섹션(B), 사용자가 자주 방문하는 병원 등을 등록한 즐겨찾는 병원 정보를 제공하는 섹션(C), 전자 처방전 정보를 제공하는 섹션(D) 및 병원 검색을 위 한 검색 입력을 수신하기 위한 섹션(E) 등을 포함할 수 있으나, 이에만 한정되는 것은 아니다. 다른 예로, 진료 정보 제공 장치에 의해 제공되는 어플리케이션 기반 서비스의 초기 인터페이스에는 본원의 구현예에 따라 상술한 복수의 섹션 중 일부만 표시되거나 다른 유형의 추가적인 섹션이 표시되도록 구현될 수 있다. 도 3a는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 병원 검색 인터페이스를 예시적으로 나타낸 도면이다. 도 3a를 참조하면, 진료 정보 제공 장치는, 사용자 단말로부터 병원 검색 입력을 수신할 수 있다. 예 를 들어, 병원 검색 입력은 병원 검색 인터페이스 상에 구비되는 병원 검색창(E1)인가되는 텍스트 입력, 병원 검색 인터페이스 상에 구비되는 지도 표시(E2) 내에서 소정의 위치를 선택하는 입력 등을 포함할 수 있다. 진료 정보 제공 장치는 인가된 병원 선택 입력에 부합하는 병원의 정보(병원명, 위치, 영업 여부, 의사 정보 등)를 제공할 수 있다. 또한, 진료 정보 제공 장치는 인가된 병원 선택 입력에 부합하는 복수의 병원을 포 함하는 병원 리스트를 제공할 수 있다. 또한, 도 3a를 참조하면, 병원 검색 인터페이스에는 병원 검색 결과에 기초하여 선택된 소정의 병원에 대한 접수 절차를 진행하기 위한 사용자 입력을 수신하기 위한 버튼(F)이 표시 될 수 있다. 도 3b는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 병원 방문 이력 인터페 이스를 예시적으로 나타낸 도면이다. 도 3b를 참조하면, 진료 정보 제공 장치는, 사용자 단말의 사용자가 기 방문한 병원에 대한 정보를 포함하는 병원 방문 이력을 사용자 단말에 제공할 수 있다. 여기서, 병원 방문 이력(B1)은, 사용자가 방문 한 방문 일시 별로 분류(구획)되며, 각각의 병원 방문 이력(B1)에는 해당 병원명, 병원 위치(주소), 영업 여부정보, 의사 정보 등이 표시될 수 있다. 또한, 진료 정보 제공 장치는 사용자 단말로부터 병원 방문 이력이 존재하는 병원 중 사용자가 자주 방문하는 병원을 등록하기 위한 즐겨찾기 등록 입력(B2)을 수신할 수 있다. 예를 들어, 즐겨찾기 등록 입력(B2)이 수신되면 해당 병원이 즐겨찾기 목록에 추가되어 해당 병원에 대한 정보를 상술한 즐겨찾는 병원 정보를 제공하는 섹션(C) 상에서 확인할 수 있도록 구현될 수 있다. 본원의 일 실시예에 따른 진료 정보 제공 장치는, 사용자 단말로부터 진료 희망 시간을 포함하는 사 용자 입력을 수신할 수 있다. 또한, 진료 정보 제공 장치는, 병원 단말로부터 진료 접수 현황 정보를 획득할 수 있다. 여기서, 진 료 접수 현황 정보는, 병원 단말과 연계된 병원에 기 접수된 대기자의 수 정보 및 병원 단말과 연계 된 병원의 대기자 각각의 진료 유형 정보를 포함할 수 있다. 본원의 일 실시예에 따르면, 대기자의 진료 유형 정보는 해당 대기자의 인적 사항 정보, 질병 이력 정보, 기 방 문 이력 정보, 해당 대기자에 대한 진료 접수시 제공된 상세 증상 정보 등을 포함할 수 있다. 이러한, 대기자의 진료 유형 정보는 후술하는 진료 시간 예측 알고리즘의 생성시 학습 데이터로 활용되거나 생성된 진료 시간 예 측 알고리즘에 인가되는 입력 데이터일 수 있다. 또한, 진료 정보 제공 장치는, 진료 접수 현황 정보에 기초하여 진료 희망 시간에서의 예상 대기 시간을 산출할 수 있다. 구체적으로, 본원의 일 실시예에 따르면, 진료 정보 제공 장치는, 대기자들의 진료 유형 정보에 기초하여 대기자 각각의 예상 진료 시간을 산출할 수 있다. 또한, 진료 정보 제공 장치는, 대기자 각각의 예상 진료 시간을 합산한 결과에 기초하여 사용자 단말의 사용자의 진료 희망 시간에서의 예상 대 기 시간을 산출하는 것일 수 있다. 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 복수의 대기자(환자)로부터 수집된 진료 유형 정보에 기초하여 학습된 진료 시간 예측 알고리즘을 기초로 하여 대기자 각각의 예상 진료 시간을 산출하고, 나아가 대 기자 각각의 예상 진료 시간을 합산하여 사용자 단말의 사용자의 진료 희망 시간에서의 예상 대기 시간을 산출하는 것일 수 있다. 본원의 일 실시예에 따르면, 전술한 진료 시간 예측 알고리즘은 기계 학습(Machine Learning), 딥 러닝(Deep Learning) 등의 인공 지능 기반의 학습을 통해 생성되는 것일 수 있다. 예를 들어, 진료 시간 예측 알고리즘은 복수의 대기자(환자)로부터 수집된 진료 유형 정보를 학습 데이터(학습 파라미터)로 하고, 해당 복수의 대기자 (환자) 각각에 대하여 수집된 실제 진료 소요 시간 정보를 라벨(Label) 데이터로 하는 지도 학습 기반의 학습 방식에 의해 생성되는 것일 수 있다. 참고로, 지도 학습(Supervised Learning)은 데이터에 대한 명시적인 정답 정보인 라벨(Label)이 주어진 상태에서 학습시키는 방법을 의미할 수 있다. 본원에서는 종래에 이미 공지되었거 나 향후 개발되는 다양한 지도 학습 알고리즘 모델이 적용될 수 있다. 또한, 진료 정보 제공 장치는, 사용자 단말로 예상 대기 시간을 포함하는 진료 대기 정보를 제공할 수 있다. 도 4는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 병원 대기 공간에 대한 CCTV 영상 표시 인터페이스를 예시적으로 나타낸 도면이다. 도 4를 참조하면, 진료 정보 제공 장치는 병원 단말과 연계된 병원에 마련된 대기 공간을 촬영한 CCTV 영상(A1)을 사용자 단말로 제공할 수 있다. 또한, 도 4를 참조하면, CCTV 영상 표시 인터페이스에는 해당 병원에 대한 접수 절차를 진행하기 위한 사용자 입력을 수신하기 위한 버튼(F)이 표시될 수 있다. 또한, 진료 정보 제공 장치는, 사용자 단말로부터 진료 접수 요청을 수신할 수 있다. 또한, 진료 정 보 제공 장치는, 사용자 단말로부터 전송된 진료 접수 요청에 대응하여 병원 단말로 진료 접수 를 요청할 수 있다. 구체적으로, 본원의 일 실시예에 따르면, 진료 접수 요청은 사용자 단말의 사용자의 인적 사항 정보 및 상 세 증상 정보를 포함할 수 있다. 또한, 본원의 일 실시예에 따르면, 진료 정보 제공 장치는, 진료 접수 요청을 병원 단말로 전송할 때, 사용자 단말로부터 기 확보된 사용자의 인적 사항 정보가 존재하는 경우, 기 확보된 인적 사항 정보를 병원 단말로 전송할 수 있다. 또한, 본원의 구현예에 따라 진료 접수 요청시 기 확보된 사용자의 인적 사 항 정보의 병원 단말에 대한 전송 여부는 사용자 단말에 인가되는 기존 인적 사항 정보 활용에 대한선택 입력에 기초하여 결정되는 것일 수 있다. 병원 단말은 진료 정보 제공 장치로부터 요청된 진료 접수에 기초하여 사용자 단말의 사용자에 대한 진료 접수를 처리하고, 진료 접수 처리 정보를 생성할 수 있다. 또한, 진료 정보 제공 장치는, 병원 단말로부터 사용자의 진료 접수 요청에 따른 진료 접수 처리 정보를 수신하고, 수신된 진료 접수 처리 정 보를 사용자 단말 및 보호자 단말로 전송할 수 있다. 이하에서는 도 5a 내지 도 5c를 참조하여, 진료 정보 제공 장치가 사용자 단말로부터 진료 접수 요청 을 수신하기 위하여 제공되는 진료 접수 요청 인터페이스에 대해 설명하도록 한다. 도 5a 내지 도 5c는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 진료 접수 요청 인터페이스를 예시적으로 나타낸 도면이다. 구체적으로, 도 5a는 진료를 접수하려는 진료 대상자를 선택하고, 진료 대상자의 인적 사항을 기입하기 위한 인 터페이스이고, 도 5b는 상세 증상 정보를 기입하기 위하여 복수의 증상 목록을 제공하는 인터페이스이고, 도 5c 는 진료 항목 및 진료받고자 하는 의사를 선택하기 위한 인터페이스이다. 도 5a를 참조하면, 진료 정보 제공 장치는 기 등록된 복수의 진료 대상자 중 어느 하나를 선택하는 사용자 입력(F1)에 기초하여 선택된 진료 대상자에 대하여 기 등록된 인적 사항 정보(F2)를 표시할 수 있다. 예를 들어, 진료 대상자는 사용자 단말의 사용자 본인이거나 사용자 단말을 통해 정보가 기입된 사용자의 가족, 친지 등의 타인일 수 있다. 달리 말해, 사용자 단말의 사용자는 진료 정보 제공 장치에 진료 대상자 각각의 인적 사항 정보를 등록함으로써 추후에 등록된 정보를 활용하여 자신 또는 타인에 해당하는 진료 대상자에 대한 진료 접수를 요청할 수 있다. 도 5b를 참조하면, 진료 정보 제공 장치는 예시적으로 가려움증, 가슴답답함, 구토, 기침 등을 포함하는 기 설정된 상세 증상 선택 목록(F3)을 사용자 단말에 제공할 수 있다. 본원의 일 실시예에 따르면, 진료 정보 제공 장치가 제공하는 상세 증상 선택 목록(F3)은 사용자 단말을 통해 요청된바 있는 이전 진료 접수 요청과 연계된 정보에 기초하여 각 항목의 내용 및 각 항목 간의 표시 순서가 결정되거나 별도의 사용자 입력에 기초하여 커스터마이징되는 등 다양한 증상, 질병 등을 반영하도록 변동될 수 있다. 도 5c를 참조하면, 진료 정보 제공 장치는 진료 항목 선택 입력(F4) 및 진료받고자 하는 의사를 선택하는 입력(F5)을 수신할 수 있다. 또한, 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 접수되는 진료에 대한 각종 서류(예를 들면, 진료 확인서, 진단서, 치료 확인서, 소견서 등)에 대한 발급을 미리 요청하는 사용 자 입력(F6)을 수신할 수 있다. 달리 말해, 진료 정보 제공 장치는 사용자 입력에 기초하여 접수되는 진료 에 대한 증명 서류의 발급을 진료 접수 단계에서 병원 단말에 미리 요청함으로써 사용자가 진료 후 증명 서류 등의 발급을 위하여 별도로 서류를 요청하거나 서류를 제공받기 위하여 대기하는데 소요되는 시간을 절약 하도록 할 수 있다. 또한, 진료 정보 제공 장치는 진행중인 진료 접수 절차에서 활용된 인적 사항 정보를 저장하기 위한 사용자 입력(F7)을 수신하고, 사용자 입력(F7)에 기초하여 진행중인 진료 접수 절차에서 활용된 인적 사항 정보를 등록함으로써 이후의 진료 접수 절차에서 기 확보된 인적 사항 정보가 존재하는 경우, 기 확 보된 인적 사항 정보를 병원 단말로 전송하여 신속하게 진료 접수가 이루어질 수 있도록 할 수 있다. 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 사용자 단말의 위치 정보를 획득할 수 있다. 또 한, 진료 정보 제공 장치는 상술한 진료 접수 처리 정보 및 사용자 단말의 위치 정보에 기초하여 진 료를 위하여 병원을 방문하기 위하여 이용할 수 있는 추천 교통편 정보를 생성할 수 있다. 또한, 진료 정보 제공 장치는 생성된 추천 교통편 정보에 기초하여 예상 출발 시간을 산출할 수 있다. 또 한, 진료 정보 제공 장치는 사용자 단말 및 보호자 단말 중 적어도 하나로 생성된 추천 교통편 정보 및 예상 출발 시간에 대한 정보를 전송할 수 있다. 예를 들어, 진료 정보 제공 장치는 도시 교통 정 보 시스템(미도시)과 연계하여 획득된 교통 상황 정보에 기초하여 접수된 병원까지 이동 소요 시간이 최소가 되 도록 하는 대중 교통 유형, 환승 정보, 경로 정보, 예상 소요 시간 정보, 교통 요금 정보 등을 포함하는 추천 교통편 정보를 생성할 수 있다. 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 사용자 단말에 탑재되는 GPS 센서로부터 사용자 단말의 현재 위치 정보를 획득하고, 현재 위치로부터의 추천 교통편 정보 및 예상 출발 시간을 생성하여 제공할 수 있다. 다만, 이에만 한정되는 것은 아니며 다른 예로, 진료 정보 제공 장치는 사용자 단말(20 0)에 인가되는 소정의 지역에 대한 위치 선택 입력에 기초하여 사용자가 선택한 위치로부터의 추천 교통편 정보및 예상 출발 시간을 생성하여 제공하도록 동작할 수 있다. 본원의 일 실시예에 따르면, 사용자의 접수가 완료되고 난 후 진료 정보 제공 장치는 도 2를 통해 전술한 어플리케이션 기반 서비스가 사용자 단말에서 실행되는 경우 표시되는 초기 인터페이스의 진료 대기 정보 를 제공하는 섹션(A)에 사용자의 진료 순서가 도래할 때까지 남은 대기자의 수 정보를 표시할 수 있다. 이 때, 진료 정보 제공 장치는 사용자 단말로부터 진료 대기 정보에 대한 상세 정보를 확인하려는 사용자 입 력(예를 들면, 초기 인터페이스에서 섹션(A)를 터치하는 입력 등)이 인가되면, 상술한 진료 시간 예측 알고리즘 에 기초하여 결정된 사용자의 접수 순서에 선행하는 현재 대기자 각각의 예상 진료 시간 및 대기자 각각의 예상 진료 시간을 합산한 결과에 기초하여 결정된 예상 대기 시간을 사용자 단말에 표시할 수 있다. 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 특정 대기자의 실제 진료가 종료되면, 이를 고려하여 사용자 단말에 제공되는 예상 대기 시간을 갱신할 수 있다. 또한, 진료 정보 제공 장치는 해당 대기 자에 대한 실제 진료 소요 시간 정보를 획득하여 전술한 진료 시간 예측 알고리즘의 생성시 요구되는 라벨 (Label) 데이터로 활용함으로써 진료 시간 예측 알고리즘의 정확도를 개선할 수 있다. 또한, 진료 정보 제공 장치는 진료 접수 처리 정보에 기초하여 예상 대기 시간이 기 설정된 임계값 이하이 면, 사용자 단말로 해당 사용자의 진료 순서가 임박하였다는 것을 알리기 위한 알람을 전송할 수 있다. 본 원의 일 실시예에 따르면, 진료 정보 제공 장치는 진료 순서가 임박하였다는 것을 알리기 위한 알람에 대 한 진료 알람 인터페이스를 어플리케이션 기반 서비스의 인터페이스 상에 표시하거나 사용자 단말을 통해 진료 순서가 임박하였다는 것을 알리기 위한 알람과 연계된 음향, 진동 등이 출력되도록 할 수 있다. 또한, 진 료 정보 제공 장치는 사용자 단말뿐만 아니라 보호자 단말로 사용자의 진료 순서가 임박하였다 는 것을 알리기 위한 알람을 전송할 수 있다. 본원의 일 실시예에 따르면, 사용자 단말로 알람이 전송되기 위한 기준이 되는 기 설정된 임계값은 사용자 단말의 위치 정보에 기초하여 변동되는 것일 수 있다. 예를 들어, 사용자 단말에 탑재되는 GPS 센서 등을 통해 파악되는 사용자 단말의 위치 정보에 기초하 여 사용자 단말의 사용자가 진료실과 소정 수준 이상 근접한 장소에서 대기하는 것으로 판단되는 경우, 진 료 정보 제공 장치는 기 설정된 임계값이 작아지도록 조정할 수 있다. 이와 달리, 사용자 단말의 위치 정보에 기초하여 사용자 단말의 사용자가 병원 외부로 이탈하거나, 병원 내에서도 진료실과 소정 수준 이상 떨어진 장소에서 대기하는 것으로 판단되는 경우, 진료 정보 제공 장치 는 기 설정된 임계값이 커지도록 조정함으로써 사용자가 진료 순서가 도래하기 전에 미리 진료실 근처로 이동하도록 유도할 수 있다. 도 6은 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 진료 알람 인터페이스를 예시적으로 나타낸 도면이다. 도 6을 참조하면, 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 진료 알람 인터페이스(A2)는 예를 들어, 사용자 단말에 표시되는 현재 인터페이스에 대하여 일부 중첩되는 형태로 제공되는 푸시(Push) 알람 형태일 수 있다. 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 진료 순서가 임박하였다는 것을 알리기 위한 알람을 사용자가 확인하였는지 여부를 판단하여 반복하여 알람을 푸시하도록 동작할 수 있다. 예를 들어, 사용자 단말의 사용자가 진료 알람 인터페이스(A2)에 표시된 푸시(Push) 알람 자체를 터치하거나 별 도의 확인 표시(체크 표시)를 터치하는 입력을 인가하면 사용자가 해당 진료 알람을 확인한 것으로 판단하고 더 이상 알람이 출력되지 않도록 할 수 있다. 또한, 진료 정보 제공 장치는 사용자의 진료가 완료된 후 병원 단말로부터 전자 처방전 정보를 획득 할 수 있다. 본원의 일 실시예에 따르면, 전자 처방전 정보는 사용자 단말에 의해 처방전과 연계된 QR 코 드가 인식되면, 인식된 QR 코드에 대응하는 전자 처방전 정보가 병원 단말로부터 진료 정보 제공 장치 로 전달되는 것일 수 있다. 예를 들어, 처방전과 연계된 QR 코드는 사용자에게 지급되는 종이 형태의 일반 적인 처방전의 지면의 일 영역에 인쇄될 수 있다. 사용자 단말의 사용자는 사용자 단말에 구비된 카 메라 모듈이 인쇄된 QR 코드를 향하도록 하여 해당 QR 코드를 인식할 수 있다. 또한, 진료 정보 제공 장치는 획득된 전자 처방전 정보를 사용자 단말, 보호자 단말 및 약국 단 말로 전송할 수 있다. 또한, 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 사용자 단말의 위치 정보에 기초하여 인접한 약국 목록을 제공하고, 사용자가 제공된 약국 목록 중 소정의 약국을 선택하는 사 용자 입력을 인가하면, 선택된 소정의 약국에 배치된 약국 단말로 해당 전자 처방전 정보를 전송하도록 구현될 수 있다. 또한, 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 사용자 단말로 약국 목록을 제공하는 경우, 복수의 약국 단말로부터 획득된 접수 현황 정보(예를 들면, 약국의 대기자수 등)에 기초하 여 각각의 약국에서의 예상 대기 시간 정보를 산출하여 약국 목록과 함께 각 약국에서의 예상 대기 시간 정보를 제공할 수 있다. 도 7a는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 전자 처방전 인터페이스 를 예시적으로 나타낸 도면이다. 도 7a를 참조하면, 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 전자 처방전 인터페이스는 기존에 발급된 전자 처방전의 발급 정보(D2), 발급된 전자 처방전에 포함된 각각의 약에 대한 복약 상세 정보를 확인하기 위한 사용자 입력 버튼(D3) 등이 표시될 수 있다. 또한, 도 7a를 참조하면, 전자 처방전 인터페이스에는 처방전과 연계된 QR 코드를 인식하기 위하여 카메라 모듈 을 활성하기 위한 사용자 입력 버튼(D4)이 표시될 수 있다. 또한, 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 전자 처방전 정보에 기초하여 복약 스케쥴 정보 를 생성할 수 있다. 또한, 진료 정보 제공 장치는 생성된 복약 스케쥴 정보에 기초하여 사용자 단말 및 보호자 단말 중 적어도 하나로 알람을 전송할 수 있다. 도 7b는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 복약 알람 인터페이스를 예시적으로 나타낸 도면이다. 도 7b를 참조하면, 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 복약 알람 인터페이스는 사 용자 단말에 발급된 전자 처방전 정보에 기초하여 생성된 복약 스케쥴 정보에 따른 적어도 하나 이상의 복 약 알람 시간이 표시되고, 사용자는 사용자 입력을 통해 각각의 복약 알람을 활성화 또는 비활성화할 수 있다. 또한, 본원의 일 실시예에 따르면, 진료 정보 제공 장치는 사용자 단말에 기록된 사용자 단말의 사용자의 스케쥴 정보 및 병원 단말로부터 획득된 진료 접수 현황 정보에 기초하여 예약 추천 정보를 생성 할 수 있다. 달리 말해, 진료 정보 제공 장치는 사용자 단말의 사용자의 향후 일정 및 해당 병원의 진료 접수 내지 예약 현황을 고려하여 해당 사용자에 대하여 이후 추가적인 진료 예약이 필요한 경우, 최적화된 일정으로 예약 추천 정보를 생성하여 제공할 수 있다. 또한, 진료 정보 제공 장치는 사용자 단말, 보 호자 단말 및 병원 단말 중 적어도 하나에 생성된 예약 추천 정보를 전송할 수 있다. 본원의 일 실시 예에 따르면, 예약 추천 정보 생성을 위해 활용되는 사용자의 스케쥴 정보는 사용자 단말에 설치된 캘린더 어플리케이션, 스케쥴링 어플리케이션 등과 연동하여 획득되는 것일 수 있다. 도 8은 본원의 일 실시예에 따른 진료 정보 제공 장치의 개략적인 구성도이다. 도 8을 참조하면, 진료 정보 제공 장치는, 대기 정보 제공부, 연산부, 접수 처리부, 알람 생성부, 복약 관리부 및 예약부를 포함할 수 있다. 대기 정보 제공부는, 사용자 단말로부터 진료 희망 시간을 포함하는 사용자 입력을 수신할 수 있다. 또한, 대기 정보 제공부는 병원 단말로부터 진료 접수 현황 정보를 획득할 수 있다. 연산부는, 진료 접수 현황 정보에 기초하여 진료 희망 시간에서의 예상 대기 시간을 산출할 수 있다. 특히, 진료 접수 현황 정보는 병원 단말과 연계된 병원에 기 접수된 대기자의 수 정보 및 대기자 각각의 진료 유형 정보를 포함하고, 연산부는 대기자들의 진료 유형 정보에 기초하여 대기자 각각의 예상 진료 시 간을 산출할 수 있다. 구체적으로 본원의 일 실시예에 따르면, 연산부는 복수의 대기자(환자)로부터 수집된 진료 유형 정보에 기 초하여 학습된 상술한 진료 시간 예측 알고리즘을 기초로 하여 대기자 각각의 예상 진료 시간을 산출하고, 나아 가 대기자 각각의 예상 진료 시간을 합산하여 사용자 단말의 사용자의 진료 희망 시간에서의 예상 대기 시 간을 산출하는 것일 수 있다. 또한, 대기 정보 제공부는 사용자 단말로 예상 대기 시간을 포함하는 진료 대기 정보를 전송할 수 있 다. 또한, 본원의 일 실시예에 따르면, 대기 정보 제공부는 병원 단말과 연계된 병원에 마련된 대기 공간 을 촬영한 CCTV 영상을 사용자 단말로 제공할 수 있다.접수 처리부는, 사용자 단말로부터 진료 접수 요청이 수신되면, 병원 단말로 진료 접수를 요청 할 수 있다. 이후, 접수 처리부는 병원 단말로부터 진료 접수 요청에 따른 진료 접수 처리 정보가 수 신되면, 수신된 진료 접수 처리 정보를 사용자 단말 및 보호자 단말 중 적어도 하나로 전송할 수 있 다. 알람 생성부는, 진료 접수 처리 정보에 기초하여 예상 대기 시간이 기 설정된 임계값 이하이면, 사용자 단 말 및 보호자 단말 중 적어도 하나로 알람을 전송할 수 있다. 복약 관리부는, 사용자의 진료가 완료된 후 병원 단말로부터 전자 처방전 정보를 획득할 수 있다. 본 원의 일 실시예에 따르면, 전자 처방전 정보는 사용자 단말에 의해 처방전과 연계된 QR 코드가 인식되면, 인식된 QR 코드에 대응하는 전자 처방전 정보가 병원 단말로부터 전달되는 것일 수 있다. 또한, 복약 관리부는 전자 처방전 정보에 기초하여 복약 스케쥴 정보를 생성할 수 있다. 또한, 복약 관리 부는 생성된 복약 스케쥴 정보에 기초하여 사용자 단말 및 보호자 단말 중 적어도 하나로 알람 을 전송할 수 있다 예약부는, 사용자 단말에 기록된 사용자 단말의 사용자의 스케쥴 정보 및 병원 단말로부터 획득된 진료 접수 현황 정보에 기초하여 예약 추천 정보를 생성할 수 있다. 또한, 예약부는 사용자 단말 , 보호자 단말 및 병원 단말 중 적어도 하나에 생성된 예약 추천 정보를 전송할 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 9는 본원의 일 실시예에 따른 진료 정보 제공 방법의 동작 흐름도이다. 도 9에 도시된 진료 정보 제공 방법은 앞서 설명된 진료 정보 제공 장치에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 진료 정보 제공 장치에 대하여 설명된 내용은 진료 정보 제공 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 9를 참조하면, 단계 S901에서 대기 정보 제공부는 사용자 단말로부터 진료 희망 시간을 포함하는 사용자 입력을 수신할 수 있다. 다음으로, 단계 S902에서 대기 정보 제공부는 병원 단말로부터 진료 접수 현황 정보를 획득할 수 있 다. 다음으로, 단계 S903에서 연산부는 진료 접수 현황 정보에 기초하여 진료 희망 시간에서의 예상 대기 시간 을 산출할 수 있다. 구체적으로 단계 S903에서 연산부는 병원 단말과 연계된 병원에 기 접수된 대기 자의 각각의 진료 유형 정보에 기초하여 대기자 각각의 예상 진료 시간을 산출하고, 산출된 예상 진료 시간을 고려하여 사용자의 예상 대기 시간을 산출하는 것일 수 있다. 다음으로, 단계 S904에서 대기 정보 제공부는 사용자 단말로 예상 대기 시간을 포함하는 진료 대기 정보를 제공할 수 있다. 또한, 본원의 일 실시예에 따르면, 단계 S904에서 대기 정보 제공부는 병원 단말 과 연계된 병원에 마련된 대기 공간을 촬영한 CCTV 영상을 사용자 단말로 제공할 수 있다. 다음으로, 단계 S905에서 접수 처리부는 사용자 단말로부터 진료 접수 요청을 수신할 수 있다. 여기 서, 진료 접수 요청은 사용자 단말의 사용자의 인적 사항 정보 및 상세 증상 정보를 포함할 수 있다. 다음으로, 단계 S906에서 접수 처리부는 진료 접수 요청에 따라 병원 단말로 진료 접수를 요청할 수 있다. 본원의 일 실시예에 따르면, 단계 S906에서 접수 처리부는 사용자 단말로부터 기 확보된 인적 사항 정보가 존재하는 경우, 기 확보된 인적 사항 정보를 병원 단말로 전송할 수 있다. 다음으로, 단계 S907에서 접수 처리부는 병원 단말로부터 진료 접수 요청에 따른 진료 접수 처리 정 보를 수신할 수 있다. 다음으로, 단계 S908에서 접수 처리부는 수신한 진료 접수 처리 정보를 사용자 단말 및 보호자 단말 중 적어도 하나로 전송할 수 있다. 다음으로, 단계 S909에서 알람 생성부는 진료 접수 처리 정보에 기초하여 예상 대기 시간이 기 설정된 임 계값 이하이면, 사용자 단말 및 보호자 단말 중 적어도 하나로 알람을 전송할 수 있다. 다음으로, 단계 S910에서 복약 관리부는 병원 단말로부터 전자 처방전 정보를 획득할 수 있다. 본원 의 일 실시예에 따르면, 단계 S910에서 복약 관리부는 사용자 단말에 의해 처방전과 연계된 QR 코드 가 인식되는 경우, 인식된 QR 코드에 대응하는 전자 처방전 정보를 병원 단말로부터 수신하는 것일 수 있 다. 다음으로, 단계 S911에서 전자 처방전 정보를 사용자 단말, 보호자 단말 및 약국 단말 중 적어 도 하나로 전송할 수 있다. 다음으로, 단계 S912에서 예약부는 사용자 단말에 기록된 사용자 단말의 사용자의 스케쥴 정보 및 병원 단말로부터 획득된 진료 접수 현황 정보에 기초하여 예약 추천 정보를 생성할 수 있다. 다음으로, 단계 S913에서 예약부는 사용자 단말, 보호자 단말 및 병원 단말 중 적어도 하 나에 생성된 예약 추천 정보를 전송할 수 있다. 상술한 설명에서, 단계 S901 내지 S913은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있 다. 본원의 일 실시 예에 따른 진료 정보 제공 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이 터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매 체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같 은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저 장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어 지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 진료 정보 제공 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또는 애플 리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2019-0168250", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2019-0168250", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 진료 정보 제공 시스템의 개략적인 구성도이다. 도 2는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 초기 인터페이스를 예시적으로 나타낸 도면이다. 도 3a는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 병원 검색 인터페이스를 예시적으로 나타낸 도면이다. 도 3b는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 병원 방문 이력 인터페 이스를 예시적으로 나타낸 도면이다. 도 4는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 병원 대기 공간에 대한 CCTV 영상 표시 인터페이스를 예시적으로 나타낸 도면이다. 도 5a 내지 도 5c는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 진료 접수 요청 인터페이스를 예시적으로 나타낸 도면이다. 도 6은 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 진료 알람 인터페이스를 예시적으로 나타낸 도면이다. 도 7a는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 전자 처방전 인터페이스 를 예시적으로 나타낸 도면이다. 도 7b는 본원의 일 실시예에 따른 진료 정보 제공 장치에 의해 사용자 단말에 표시되는 복약 알람 인터페이스를 예시적으로 나타낸 도면이다. 도 8은 본원의 일 실시예에 따른 진료 정보 제공 장치의 개략적인 구성도이다. 도 9는 본원의 일 실시예에 따른 진료 정보 제공 방법의 동작 흐름도이다."}
