{"patent_id": "10-2022-0094451", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0016537", "출원번호": "10-2022-0094451", "발명의 명칭": "콘텐츠 처리 장치 및 그 방법", "출원인": "㈜기억", "발명자": "장승관"}}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부로부터 원본 콘텐츠를 입력받는 제1 입력부;출력 콘텐츠를 출력하는 제1 출력부; 및상기 원본 콘텐츠의 유해 여부를 판단하여, 상기 원본 콘텐츠가 유해하다고 판단하면 대체 콘텐츠를 상기 출력콘텐츠로 설정하고, 상기 원본 콘텐츠가 유해하지 않다고 판단하면 상기 원본 콘텐츠를 상기 출력 콘텐츠로 설정하는 제어부;를 포함하고,상기 제어부는,복수의 유해 콘텐츠에 기초하여 학습된 인공신경망을 활용하여, 상기 제1 입력부를 통해 입력되는 상기 원본 콘텐츠의 유해 여부를 실시간으로 판단하는 콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 입력부는 외부 입력장치의 출력단과 연결되고, 상기 제1 출력부는 외부 출력장치의 입력단과연결되며,상기 제어부는,상기 외부 입력장치의 출력단에서 출력되어 상기 제1 입력부로 입력된 상기 원본 콘텐츠의 유해 여부를 실시간으로 판단하고, 상기 출력 콘텐츠를 상기 제1 출력부를 통해 상기 외부 출력장치의 입력단으로 제공하는 콘텐츠처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어부는,상기 제1 입력부를 통해 입력된 상기 원본 콘텐츠를 분배하는 콘텐츠 공유 모듈;상기 인공신경망을 활용하여 상기 콘텐츠 공유 모듈로부터 분배된 상기 원본 콘텐츠의 유해 여부를 실시간으로판단하고, 상기 원본 콘텐츠가 유해하다고 판단하면 상기 대체 콘텐츠를 생성하는 콘텐츠 처리 모듈; 및상기 콘텐츠 공유 모듈에서 상기 원본 콘텐츠를 수신하고, 상기 콘텐츠 처리 모듈에서 생성한 상기 대체 콘텐츠를 수신하여, 상기 원본 콘텐츠 또는 상기 대체 콘텐츠를 상기 제1 출력부로 제공하는 콘텐츠 선택 모듈;을 포함하는 콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 원본 콘텐츠는 영상을 포함하고,상기 콘텐츠 처리 모듈은,상기 인공신경망을 활용하여, 상기 원본 콘텐츠의 영상에서 유해 요소를 포함하는 영역을 감지하고,공개특허 10-2024-0016537-3-상기 원본 콘텐츠를 가공하여 상기 영역 내에서 상기 유해 요소를 제거하거나 모자이크 처리하여 상기 대체 콘텐츠를 생성하거나, 설정된 안내 문구를 포함하도록 상기 대체 콘텐츠를 생성하는 콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 원본 콘텐츠는 오디오를 포함하고,상기 콘텐츠 처리 모듈은,상기 인공신경망을 활용하여, 상기 원본 콘텐츠의 오디오에서 유해 요소를 감지하고,상기 원본 콘텐츠를 가공하여 상기 유해 요소를 포함하는 오디오를 제거하거나 해당 오디오를 다른 오디오로 교체하여 상기 대체 콘텐츠를 생성하는 콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 원본 콘텐츠는 텍스트를 포함하고,상기 콘텐츠 처리 모듈은,상기 인공신경망을 활용하여, 상기 원본 콘텐츠의 텍스트에서 유해 요소를 감지하고,상기 원본 콘텐츠를 가공하여 상기 유해 요소를 포함하는 텍스트를 제거하거나 해당 텍스트를 다른 텍스트로 교체하여 상기 대체 콘텐츠를 생성하는 콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 원본 콘텐츠 및/또는 상기 대체 콘텐츠를 저장하는 저장부; 및제2 출력부;를 더 포함하고,상기 제어부는,상기 원본 콘텐츠가 유해하다고 판단하면, 상기 원본 콘텐츠를 상기 저장부에 저장하고, 상기 제2 출력부에 관리자 단말이 연결됨에 기초하여, 상기 저장부에 저장된 상기 원본 콘텐츠를 상기 제2 출력부를 통해 출력하는콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,제2 입력부;를 더 포함하고,상기 제어부는,상기 제2 입력부를 통해 상기 관리자 단말로부터 설정 데이터를 수신하고, 상기 설정 데이터에 기초하여 상기인공신경망을 초기화하고, 상기 복수의 유해 콘텐츠 및 상기 저장부에 저장된 상기 원본 콘텐츠에 기초하여 상기 인공신경망의 재학습을 수행하는 콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2024-0016537-4-제8항에 있어서,상기 제1 입력부, 상기 제1 출력부 및 상기 제2 출력부는 HDMI 포트를 포함하고,상기 제2 입력부는 시리얼 통신 포트를 포함하는 콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,동작 상태를 출력하는 상태 표시부;를 더 포함하고,상기 동작 상태는,장치의 정상 동작 여부, 상기 제1 입력부를 통한 콘텐츠 입력 여부, 안내 문구 설정 여부 중 적어도 하나를 포함하는 콘텐츠 처리 장치."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "외부로부터 원본 콘텐츠를 입력받는 동작;복수의 유해 콘텐츠에 기초하여 학습된 인공신경망을 활용하여, 상기 원본 콘텐츠의 유해 여부를 실시간으로 판단하는 동작;상기 원본 콘텐츠가 유해하다고 판단하면 대체 콘텐츠를 출력 콘텐츠로 설정하는 동작;상기 원본 콘텐츠가 유해하지 않다고 판단하면 상기 원본 콘텐츠를 상기 출력 콘텐츠로 설정하는 동작; 및상기 출력 콘텐츠를 출력하는 동작;을 포함하는 콘텐츠 처리 방법."}
{"patent_id": "10-2022-0094451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 원본 콘텐츠가 유해하다고 판단하면, 상기 원본 콘텐츠를 저장부에 저장하는 동작;관리자 단말이 연결됨에 기초하여, 상기 저장부에 저장된 상기 원본 콘텐츠를 출력하는 동작;상기 관리자 단말로부터 설정 데이터를 수신하고, 상기 설정 데이터에 기초하여 상기 인공신경망을 초기화하는동작; 및상기 복수의 유해 콘텐츠 및 상기 저장부에 저장된 상기 원본 콘텐츠에 기초하여 상기 인공신경망의 재학습을수행하는 동작;을 더 포함하는 콘텐츠 처리 방법."}
{"patent_id": "10-2022-0094451", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "콘텐츠 처리 장치가 개시된다. 본 개시의 콘텐츠 처리 장치는, 외부로부터 원본 콘텐츠를 입력받는 제1 입력부; 출력 콘텐츠를 출력하는 제1 출력부; 및 원본 콘텐츠의 유해 여부를 판단하여, 원본 콘텐츠가 유해하다고 판단하 면 대체 콘텐츠를 출력 콘텐츠로 설정하고, 원본 콘텐츠가 유해하지 않다고 판단하면 원본 콘텐츠를 출력 콘텐츠 로 설정하는 제어부;를 포함하고, 제어부는, 복수의 유해 콘텐츠에 기초하여 학습된 인공신경망을 활용하여, 제1 입력부를 통해 입력되는 원본 콘텐츠의 유해 여부를 실시간으로 판단할 수 있다."}
{"patent_id": "10-2022-0094451", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 콘텐츠 처리 장치에 관한 것으로, 보다 상세하게는 인공지능을 활용하여 무해한 컨텐츠 데이터(영상/ 오디오/문자)와 유해한 컨텐츠 데이터를 실시간으로 비교 및 판단하여, 유해한 컨텐츠를 처리하거나 차단하는 장치에 관한 것이다."}
{"patent_id": "10-2022-0094451", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "공공 장소 또는 사적인 장소(가정의 월패드 등등)에서 다양한 멀티미디어 정보를 제공하는 서비스 시스템이 보 급되어 있다. 이러한 공공 장소 또는 사적인 장소의 멀티미디어 서비스 시스템은 대부분 고해상도의 영상과 오 디오(음성)를 송출하여 사용자들에게 정보를 제공한다. 이러한 멀티미디어 서비스의 경우 기존의 문자 정보 서비스에 비해 사용자에게 미치는 영향력 및 파급 효과가 크기 때문에, 청소년 또는 원치 않는 사용자들에게 유해 정보가 노출되지 않도록 하는 정보 처리 또는 정보 차단 방법이 필요하다. 그러나, 인터넷 해킹 등에 의해 서비 스 시스템을 통해 유해 영상이 공공 장소에 송출되고 있고, 유해 영상에 대한 정보 처리 또는 정보 차단이 효과 적으로 이루어지지 못하여 사회, 문화적으로 심각한 문제가 되고 있다. 종래에도 해킹에 의한 유해 영상 송출을 막기 위한 차단 기술이 사용되었으나, 종래의 기술은 방화벽 등을 활용 하는 것으로, 시스템을 구축하기 위한 비용이 고가이며, 실시간으로 유해 영상을 차단하지는 못하는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 10-1997-0014315호"}
{"patent_id": "10-2022-0094451", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 전술한 문제 및 다른 문제를 해결하는 것을 목적으로 한다. 또 다른 목적은, 유해 콘텐츠에 기초하여 학습된 인공지능을 활용하여 콘텐츠의 유해 여부를 판단함으로써, 유 해 콘텐츠를 실시간으로 효과적으로 필터링하는 것일 수 있다. 또 다른 목적은, 기존의 콘텐츠 입력장치와 콘텐츠 출력장치의 입출력단 사이에 탈부착 가능한 콘텐츠 처리 장 치를 사용함으로써, 종래의 장치의 교체없이 간단하게 콘텐츠 차단 또는 교체가 가능하도록 하는 것일 수 있다. 또 다른 목적은, 필터링된 유해 콘텐츠를 관리자 단말로 출력하고 관리자 단말로부터 입력되는 신호에 기초하여 인공신경망을 초기화 및 재학습시킴으로써, 유해 콘텐츠 필터링의 정확성을 높이는 것일 수 있다. 또 다른 목적은, 시리얼 통신 포트를 통해 관리자 단말과 통신하고, 다른 무선 통신 방식을 사용하지 않음으로 써, 장치의 해킹 가능성을 줄이고 보안성을 높이는 것일 수 있다."}
{"patent_id": "10-2022-0094451", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치는, 외부로부터 원본 콘텐츠를 입력받 는 제1 입력부; 출력 콘텐츠를 출력하는 제1 출력부; 및 상기 원본 콘텐츠의 유해 여부를 판단하여, 상기 원본 콘텐츠가 유해하다고 판단하면 대체 콘텐츠를 상기 출력 콘텐츠로 설정하고, 상기 원본 콘텐츠가 유해하지 않다 고 판단하면 상기 원본 콘텐츠를 상기 출력 콘텐츠로 설정하는 제어부;를 포함하고, 상기 제어부는, 복수의 유 해 콘텐츠에 기초하여 학습된 인공신경망을 활용하여, 상기 제1 입력부를 통해 입력되는 상기 원본 콘텐츠의 유 해 여부를 실시간으로 판단할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 제1 입력부는 외부 입력장 치의 출력단과 연결되고, 제1 출력부는 외부 출력장치의 입력단과 연결되며, 제어부는, 외부 입력장치의 출력단 에서 출력되어 제1 입력부로 입력된 상기 원본 콘텐츠의 유해 여부를 실시간으로 판단하고, 출력 콘텐츠를 제1 출력부를 통해 외부 출력장치의 입력단으로 제공할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 제어부는, 제1 입력부를 통 해 입력된 원본 콘텐츠를 분배하는 콘텐츠 공유 모듈; 인공신경망을 활용하여 콘텐츠 공유 모듈로부터 분배된 원본 콘텐츠의 유해 여부를 실시간으로 판단하고, 원본 콘텐츠가 유해하다고 판단하면 대체 콘텐츠를 생성하는 콘텐츠 처리 모듈; 및 콘텐츠 공유 모듈에서 원본 콘텐츠를 수신하고, 콘텐츠 처리 모듈에서 생성한 대체 콘텐 츠를 수신하여, 원본 콘텐츠 또는 대체 콘텐츠를 제1 출력부로 제공하는 콘텐츠 선택 모듈;을 포함할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 원본 콘텐츠는 영상을 포함 하고, 콘텐츠 처리 모듈은, 인공신경망을 활용하여, 원본 콘텐츠의 영상에서 유해 요소를 포함하는 영역을 감지 하고, 원본 콘텐츠를 가공하여 영역 내에서 유해 요소를 제거하거나 모자이크 처리하여 대체 콘텐츠를 생성하거 나, 설정된 안내 문구를 포함하도록 대체 콘텐츠를 생성할 수 있다.한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 원본 콘텐츠는 오디오를 포 함하고, 콘텐츠 처리 모듈은, 인공신경망을 활용하여, 원본 콘텐츠의 오디오에서 유해 요소를 감지하고, 원본 콘텐츠를 가공하여 유해 요소를 포함하는 오디오를 제거하거나 해당 오디오를 다른 오디오로 교체하여 대체 콘 텐츠를 생성할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 원본 콘텐츠는 텍스트를 포 함하고, 콘텐츠 처리 모듈은, 인공신경망을 활용하여, 원본 콘텐츠의 텍스트에서 유해 요소를 감지하고, 원본 콘텐츠를 가공하여 유해 요소를 포함하는 텍스트를 제거하거나 해당 텍스트를 다른 텍스트로 교체하여 상기 대 체 콘텐츠를 생성할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 원본 콘텐츠 및/또는 대체 콘텐츠를 저장하는 저장부; 및 제2 출력부;를 더 포함하고, 제어부는, 원본 콘텐츠가 유해하다고 판단하면, 원 본 콘텐츠를 저장부에 저장하고, 제2 출력부에 관리자 단말이 연결됨에 기초하여, 저장부에 저장된 원본 콘텐츠 를 제2 출력부를 통해 출력할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 제2 입력부;를 더 포함하고, 제어부는, 제2 입력부를 통해 관리자 단말로부터 설정 데이터를 수신하고, 설정 데이터에 기초하여 인공신경망을 초기화하고, 복수의 유해 콘텐츠 및 저장부에 저장된 원본 콘텐츠에 기초하여 인공신경망의 재학 습을 수행할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 제1 입력부, 제1 출력부 및 제2 출력부는 HDMI 포트를 포함하고, 제2 입력부는 시리얼 통신 포트를 포함할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 장치에서, 동작 상태를 출력하는 상태 표시부;를 더 포함하고, 동작 상태는, 장치의 정상 동작 여부, 제1 입력부를 통한 콘텐츠 입력 여부, 안내 문구 설정 여부 중 적어도 하나를 포함할 수 있다. 상술한 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 방법은, 외부로부터 원본 콘텐츠를 입력 받는 동작; 복수의 유해 콘텐츠에 기초하여 학습된 인공신경망을 활용하여, 원본 콘텐츠의 유해 여부를 실시간 으로 판단하는 동작; 원본 콘텐츠가 유해하다고 판단하면 대체 콘텐츠를 출력 콘텐츠로 설정하는 동작; 원본 콘 텐츠가 유해하지 않다고 판단하면 원본 콘텐츠를 출력 콘텐츠로 설정하는 동작; 및 출력 콘텐츠를 출력하는 동 작;을 포함할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 측면에 따른 콘텐츠 처리 방법은, 원본 콘텐츠가 유해하다고 판 단하면, 원본 콘텐츠를 저장부에 저장하는 동작; 관리자 단말이 연결됨에 기초하여, 저장부에 저장된 원본 콘텐 츠를 출력하는 동작; 관리자 단말로부터 설정 데이터를 수신하고, 설정 데이터에 기초하여 인공신경망을 초기화 하는 동작; 및 복수의 유해 콘텐츠 및 저장부에 저장된 원본 콘텐츠에 기초하여 인공신경망의 재학습을 수행하 는 동작;을 더 포함할 수 있다."}
{"patent_id": "10-2022-0094451", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예 중 적어도 하나에 따르면, 유해 콘텐츠에 기초하여 학습된 인공지능을 활용하여 콘텐츠의 유 해 여부를 판단함으로써, 유해 콘텐츠를 실시간으로 효과적으로 필터링할 수 있다. 본 개시의 실시예 중 적어도 하나에 따르면, 기존의 콘텐츠 입력장치와 콘텐츠 출력장치의 입출력단 사이에 탈 부착 가능한 콘텐츠 처리 장치를 사용함으로써, 종래의 장치의 교체없이 간단하게 콘텐츠 차단 또는 교체가 가 능할 수 있다. 본 개시의 실시예 중 적어도 하나에 따르면, 필터링된 유해 콘텐츠를 관리자 단말로 출력하고 관리자 단말로부 터 입력되는 신호에 기초하여 인공신경망을 초기화 및 재학습시킴으로써, 유해 콘텐츠 필터링의 정확성을 높일 수 있다. 본 개시의 실시예 중 적어도 하나에 따르면, 시리얼 통신 포트를 통해 관리자 단말과 통신하고, 다른 무선 통신 방식을 사용하지 않음으로써, 장치의 해킹 가능성을 줄이고 보안성을 높일 수 있다. 본 개시의 적용 가능성의 추가적인 범위는 이하의 상세한 설명으로부터 명백해질 것이다. 그러나 본 개시의 사 상 및 범위 내에서 다양한 변경 및 수정은 통상의 기술자에게 명확하게 이해될 수 있으므로, 상세한 설명 및 본 개시의 바람직한 실시 예와 같은 특정 실시 예는 단지 예시로 주어진 것으로 이해되어야 한다."}
{"patent_id": "10-2022-0094451", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명한다. 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여 되거나 혼용될 수 있다. \"모듈\" 및 \"부\"는, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개 시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세 서에 개시된 실시예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술 적 사상이 제한되지 않는다. 첨부된 도면은, 본 개시의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있다. 다만, 상기 구성 요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별 하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수 있다. 다만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 도 1은, 본 개시의 일 실시예에 따른, 콘텐츠 처리 장치가 입출력 장치에 연결된 것을 나타낸 도면이고, 도 2는, 도 1의 콘텐츠 처리 장치의 블록도이다 도 1 및 도 2를 참조하면, 콘텐츠 처리 장치는, 외부의 입력 장치와 출력 장치 사이에 배치되어, 외부 입력 장치로부터 원본 콘텐츠를 입력 받고, 외부 출력 장치로 출력 콘텐츠를 출력할 수 있다. 외부 입력 장치는 일반적인 컴퓨팅 장치로서, 공공 장소에서 멀티미디어 정보를 제공하는 서비스 시스템의 정보 제공 장치일 수 있다. 외부 출력 장치는 일반적인 디스플레이 장치로서, 공공 장소에서 멀티미디어 정 보를 제공하는 서비스 시스템의 디스플레이 장치일 수 있다. 도 3을 참조하면, 외부 입력 장치와 외부 출력 장치는, 버스 정보 제공 시스템(Bus Information System)에 장착되어 버스 위치, 도착 예정 정보, 대기 정보, 환승 정보 등과 같은 정보를 제공하는 내장형 단말 장치 및 디스플레이 장치(도 3의 (a))일 수 있다. 외부 입력 장치와 외부 출력 장치는, 옥외 광고 시스 템에 장착되어 기업체 광고 정보, 날씨 정보 등을 제공하는 단말 장치 및 디스플레이 장치(도 3의 (b))일 수 있 다. 외부 입력 장치와 외부 출력 장치는, 지하철 차량에 장착되어 광고 정보, 지하철 정거장 정보, 환 승 정보 등을 제공하는 내장형 단말 장치 및 디스플레이 장치(도 3의 (c))일 수 있다. 콘텐츠 처리 장치는, 외부 입력장치의 출력단자와 연결되고, 외부 출력장치의 입력단자와 연결되 어, 외부 입력장치에서 출력되는 원본 콘텐츠의 유해 여부를 실시간으로 판단하고, 판단 결과에 기초하여, 출력 콘텐츠를 외부 출력장치의 입력단자로 제공할 수 있다. 즉, 콘텐츠 처리 장치는, 서로 연결되는 외부 입력장치와 외부 출력장치 사이에 배치되어, 외부 입력장치에서 출력되어 외부 출력장치 로 입력되는 정보가 콘텐츠 처리 장치를 경유하도록 배치될 수 있다. 이와 같이, 기존의 콘텐츠 입력장치 와 콘텐츠 출력장치의 입출력단 사이에 탈.부착 가능한 콘텐츠 처리 장치를 사용함으로써, 종래의 장치의교체없이 간단하게 콘텐츠 유해 여부를 판단할 수 있다. 콘텐츠 처리 장치는, 제1 입력부, 제1 출력부, 저장부, 전원부 및 제어부를 포 함할 수 있다. 제1 입력부는, 외부로부터 원본 콘텐츠를 입력받을 수 있다. 예를 들어, 제1 입력부는 외부 입력장치 의 출력단자와 연결되고, 외부 입력장치의 출력단자에서 출력되는 원본 콘텐츠를 입력받을 수 있다. 제1 출력부는, 외부로 출력 콘텐츠를 출력할 수 있다. 예를 들어, 제1 출력부는 외부 출력장치의 입력단자와 연결되고, 외부 출력장치의 입력단자로 출력 콘텐츠를 출력할 수 있다. 제1 입력부와 제1 출력부는 HDMI(High Definition Multimedia Interface) 포트를 포함할 수 있다. 다만, 제1 입력부 및 제1 출력부에 포함되는 포트는 이에 제한되지 않으며, 제1 입력부 및 제1 출력부는 DP(Display Port), DVI(Digital Visual Interface) 포트 등을 포함할 수 있다. 전원부는, 배터리(미도시) 및 충전 인터페이스(미도시)를 포함할 수 있다. 배터리는, 제어부의 제어에 따라, 콘텐츠 처리 장치의 동작에 이용되는 전력을 공급할 수 있다. 배터 리는, 콘텐츠 처리 장치에 구비된 다른 구성에 전력을 공급할 수 있다. 배터리는, 충전이 가능한 배터리이 거나 일회용 배터리일 수 있다. 예를 들면, 배터리는, 리튬이온 배터리 또는 리튬폴리머(Li-Polymer) 배터리일 수 있으나, 이에 제한되지 않는다. 충전 인터페이스는, 충전 단자 및 충전 회로를 포함할 수 있다. 충전 단자는 일부가 콘텐츠 처리 장치의 외부로 노출되고, 케이블 등을 통해 외부의 5V 어뎁터 등으로부터 전력을 공급받을 수 있다. 충전 단자는 2pin 타입의 단자일 수 있다. 충전 회로는 외부로부터 공급되는 전력이 배터리를 충전하도록 제어할 수 있다. 제어부는, 적어도 하나의 프로세서를 포함할 수 있다. 제어부는, 프로세서를 이용하여, 콘텐츠 처리 장치의 동작 전반을 제어할 수 있다. 여기서, 프로세서는 CPU(central processing unit)과 같은 일반적인 프로세서일 수 있다. 물론, 프로세서는 ASIC과 같은 전용 장치(dedicated device)이거나 다른 하드웨어 기반의 프로세서일 수 있다. 제어부는, 제1 입력부를 통해 입력된 원본 콘텐츠의 유해 여부를 판단할 수 있다. 제어부는, 원 본 콘텐츠의 유해 여부를 판단하여, 원본 콘텐츠가 유해하다고 판단하면 대체 콘텐츠를 출력 콘텐츠로 설정하고, 원본 콘텐츠가 유해하지 않다고 판단하면 입력된 원본 콘텐츠를 출력 콘텐츠로 설정할 수 있다. 제어부는, 콘텐츠 공유 모듈, 콘텐츠 처리 모듈 및 콘텐츠 선택 모듈을 포함할 수 있다. 콘텐츠 공유 모듈은, 제1 입력부를 통해 입력된 원본 콘텐츠를 콘텐츠 처리 모듈과 콘텐츠 선택 모듈로 각각 분배할 수 있다. 콘텐츠 공유 모듈은, 입력된 원본 콘텐츠를 프레임 단위로 제공할 수 있다. 콘텐츠 처리 모듈은, 인공신경망을 활용하여 콘텐츠 공유 모듈로부터 분배된 원본 콘텐츠의 유해 여 부를 실시간으로 판단하고, 원본 콘텐츠가 유해하다고 판단하면 대체 콘텐츠를 생성할 수 있다. 도 4를 참조하면, 콘텐츠 처리 모듈은, 인공신경망 모델을 포함한다. 인공신경망 모델은, 기계 학습 모델의 일 예로서, 기계 학습(machine learning) 기술과 인지과학에서, 생물학적 신경망의 구조에 기초하 여 구현된 통계학적 학습 알고리즘 또는 그 알고리즘을 실행하는 구조이다. 일 실시예에 따르면, 인공신경망 모델은, 생물학적 신경망과 같이 시냅스의 결합으로 네트워크를 형성한 인공 뉴런인 노드(node)들이 시냅스의 가중치를 반복적으로 조정하여, 특정 입력에 대응한 올바른 출력과 추론 된 출력 사이의 오차가 감소되도록 학습함으로써, 문제 해결 능력을 가지는 기계학습 모델을 나타낼 수 있다. 예를 들어, 인공신경망 모델은 기계 학습, 딥러닝 등의 인공지능 학습법에 사용되는 임의의 확률 모델, 뉴 럴 네트워크 모델 등을 포함할 수 있다. 인공신경망 모델은 다층의 노드들과 이들 사이의 연결로 구성된 다층 퍼셉트론(multilayer perceptron, MLP)으로 구현된다. 본 실시예에 따른 인공신경망 모델은 MLP를 포함하는 다양한 인공신경망 모델 구조들 중의 하나를 이용하여 구현될 수 있다. 도 6에 도시된 바와 같이, 인공신경망 모델은, 외부로부터 입력 신 호 또는 데이터를 수신하는 입력층, 입력 데이터에 대응한 출력 신호 또는 데이터를 출력하는 출력층, 입력층과 출력층 사이에 위치하며 입력층으로부터 신호를 받아 특성을 추출하여출력층으로 전달하는 n개(여기서, n은 양의 정수)의 은닉층(230_1 내지 230_n)을 포함할 수 있다. 여기서, 출력층은 은닉층(230_1 내지 230_n)으로부터 신호를 받아 외부로 출력할 수 있다. 인공신경망 모델의 학습 방법에는, 교사 신호(정답)의 입력에 의해서 문제의 해결에 최적화되도록 학습하 는 지도 학습(Supervised Learning) 방법과, 교사 신호를 필요로 하지 않는 비지도 학습(Unsupervised Learning) 방법이 있다. 일 실시예에 따르면, 인공신경망 모델의 입력변수는, 기설정된 학습용 유해 콘텐 츠 데이터를 포함할 수 있다. 이와 같이 상술된 입력변수가 입력층을 통해 입력되는 경우, 인공신경망 모델의 출력층에서 출 력되는 출력변수는 콘텐츠 데이터의 유해 여부 등이 될 수 있다. 이와 같이, 인공신경망 모델의 입력층과 출력층에 복수의 입력변수와 대응되는 복수의 출력변수 가 각각 매칭되고, 입력층, 은닉층(230_1 내지 230_n) 및 출력층에 포함된 노드들 사이의 시냅스 값 이 조정됨으로써, 특정 입력에 대응한 올바른 출력이 추출될 수 있도록 학습될 수 있다. 이러한 학습 과정을 통 해, 인공신경망 모델의 입력변수에 숨겨져 있는 특성을 파악할 수 있고, 입력변수에 기초하여 계산된 출력 변수와 목표 출력 간의 오차가 줄어들도록 인공신경망 모델의 노드들 사이의 시냅스 값(또는 가중치)를 조 정할 수 있다. 일 실시예에 따르면, 인공신경망 모델을 이용하여 입력된 원본 콘텐츠 데이터의 유해 여부 정보가 생성될 수 있다. 즉, 인공신경망 모델은 다양한 학습 데이터를 이용하여 원본 콘텐츠 데이터의 유해 여부를 판단 할 수 있도록 사전 학습될 수 있으며, 콘텐츠 처리 모듈은, 이러한 인공신경망 모델에 원본 콘텐츠를 입력하여 원본 콘텐츠의 유해 여부 정보 등을 출력하거나 생성할 수 있다. 도 5를 참조하면, 학습 데이터는 성적인 데이터를 포함하는 데이터일 수 있다. 예를 들어, 학습 데이터는 사람 의 성기, 엉덩이, 가슴 등과 같은 신체 특정 부위가 노출된 영상을 포함할 수 있다. 예를 들어, 학습 데이터는 사람의 성행위 또는 성적 묘사와 관련된 오디오(음성)를 포함할 수 있다. 예를 들어, 학습 데이터는 사람의 성 행위 또는 성적 묘사와 관련된 텍스트(문자)를 포함할 수 있다. 다만, 학습 데이터는 이에 제한되지 않으며, 폭 력적인 영상 또는 욕설과 같은 오디오 및 텍스트 등을 더 포함할 수 있다. 학습 데이터는, 가공된 데이터일 수 있다. 학습 데이터는 사람의 성별, 나이, 신체 부위 별로 구분되고, 성별, 나이, 신체 부위 등의 정보로 라벨링 될 수 있다. 본 발명의 일 실시예에서, 학습 데이터는 사람의 성별, 나이 및 신체 부위로 라벨링된 20,000개 이상의 콘텐츠가 사용되었다. 한편, 인공신경망은 YOLO(You Only Look Once) 알고리즘을 사용할 수 있다. 콘텐츠에 포함된 이미지에서 객체들 은 다양한 영역에 분포되어 있기 때문에, 이미지에서 객체를 추출하기 전에 객체가 어느 범위 내에 있는지를 알 기 위해 경계 상자를 먼저 확인해야 한다. YOLO는 각 이미지를 A x A 개의 그리드로 분할하고, 그리드의 신뢰도 를 계산할 수 있다. 신뢰도는 그리드 내 객체 인식 시 정확성을 반영한다. 처음에는 객체 인식과는 동떨어진 경 계 상자가 설정되지만, 신뢰도를 계산하여 경계 상자의 위치를 조정함으로써, 가장 높은 객체 인식 정확성을 가 지는 경계 상자를 얻을 수 있다. 그리드에 객체 포함 여부를 계산하기 위해, 객체 클래스 점수를 계산한다. 이 결과로 총 A x A x B 객체가 예측된다. 이 그리드의 대부분은 낮은 신뢰도를 가진다. 신뢰도를 높이기 위해 주 변의 그리드를 합칠 수 있다. 이후, 임계값을 설정해 불필요한 부분은 제거할 수 있다. YOLO 알고리즘은 하나의 신경망을 Grid 방식을 통해 전체 이미지에 적용하므로 기존 분류기 기반 탐지 기법에 비하여 매우 효율적이며, 실시간 객체 탐지가 가능한 장점을 가진다. 이와 같이, 본 발명의 일 실시예에서, YOLO 알고리즘을 기반으로 한 인공신경망 모델을 이용하여, 원본 콘텐츠의 유해 여부를 판단할 수 있다. YOLO 알고리즘에 원본 콘텐츠를 입력 하면, YOLO 알고리즘에 의해 원본 콘텐츠 내에서 객체(유해 요소)가 인식되고, 원본 콘텐츠의 유해 여부가 출력 될 수 있다. 이와 같이, 유해 콘텐츠에 기초하여 학습된 인공지능을 활용하여 콘텐츠의 유해 여부를 판단함으로 써, 유해 콘텐츠를 실시간으로 효과적으로 필터링할 수 있다. 다만, 활용되는 인공신경망의 종류는 이에 제한되 지 않으며, SSD(Single Shot MultiBox Detector), RetinaNet, RCNN(Region based CNN), FPN(Feature Pyramid Network) 알고리즘 등이 활용될 수도 있다. 콘텐츠 처리 모듈은, 영상에서 유해 요소를 감지하고, 대체 콘텐츠를 생성할 수 있다. 예를 들어, 콘텐츠 처리 모듈은, 인공신경망을 활용하여, 원본 콘텐츠에 포함된 영상에서 유해 요소를 포 함하는 영역을 감지하고, 유해 요소를 포함하는 영역이 감지되는 경우 원본 콘텐츠가 유해한 것으로 판단할 수 있다. 콘텐츠 처리 모듈은, 실시간으로 입력되는 원본 콘텐츠에 포함된 영상의 각 프레임에 대해 유해 요 소 포함 여부를 판단하고, 각 프레임에 대해 실시간으로 편집한 대체 콘텐츠를 생성할 수 있다.이를 위해, 콘텐츠 처리 모듈은, 원본 콘텐츠의 각 프레임을 스틸 이미지(정지 이미지)로 캡처하고, 캡처 된 스틸 이미지를 비디오 버퍼 메모리(미도시)에 저장하며, 캡처된 스틸 이미지에서 특정 영역을 크로핑하여, 유해 요소 포함 여부를 감지할 수 있다. 도 6을 참조하면, 콘텐츠 처리 모듈은, 원본 콘텐츠에 포함된 영상의 일부 프레임(도 5의 (a))에서 유해 요소가 포함된 것을 판단하는 경우, 해당 프레임의 이미지를 제거하거나, 해당 프레임의 이미지 내에 포함된 유 해 요소를 모자이크 처리하거나, 유해 요소에 대응하는 위치에 설정된 이미지 또는 설정된 안내 문구를 삽입하 여 대체 콘텐츠(도 5의 (b))를 생성할 수 있다. 유해 요소가 포함된 프레임의 이미지가 제거되는 경우 제거된 해당 이미지에 대응하여 검은 화면 또는 설정된 안내 문구가 포함된 이미지가 삽입될 수 있다. 콘텐츠 처리 모듈은 관리자에 의해 입력되어 미리 설정된 안내 문구를 포함한 이미지를 프레임에 삽입하거나, 전체 화면이 검은 색을 갖는 이미지를 프레임에 삽입함으로 써 대체 콘텐츠를 생성할 수 있다. 콘텐츠 처리 모듈은, 해당 프레임의 이미지를 편집함과 동시에, 해당 프레임의 오디오 신호도 함께 편집하 여 대체 콘텐츠를 생성할 수 있다. 콘텐츠 처리 모듈은, 해당 프레임에 포함된 오디오 신호를 삭제하여 대 체 콘텐츠를 생성할 수 있다. 콘텐츠 처리 모듈은, 오디오에서 유해 요소를 감지하고, 대체 콘텐츠를 생성할 수 있다. 예를 들어, 콘텐츠 처리 모듈은, 인공신경망을 활용하여, 원본 콘텐츠에 포함된 오디오 신호에서 유해 요 소를 감지하고, 유해 요소가 감지되는 경우 원본 콘텐츠가 유해한 것으로 판단할 수 있다. 콘텐츠 처리 모듈 은, 실시간으로 입력되는 원본 콘텐츠에 포함된 각 프레임 별 오디오 신호에 대해 유해 요소 포함 여부를 판단하고, 각 프레임에 대해 실시간으로 편집한 대체 콘텐츠를 생성할 수 있다. 이를 위해, 콘텐츠 처리 모듈은, 원본 콘텐츠의 각 프레임별 오디오 신호를 오디오 버퍼 메모리(미도시)에 저장하며, 저장된 각 프레임별 오디오 신호에 대해 유해 요소 포함 여부를 감지할 수 있다. 도 7을 참조하면, 콘텐츠 처리 모듈은, 원본 콘텐츠의 일부 프레임에서 오디오 신호(도 6의 (a))에 유해 요소가 포함된 것을 판단하는 경우, 해당 프레임 내에 포함된 오디오 신호를 제거(도 6의 (b))하거나, 해당 오 디오 신호를 삐소리(bleep)와 같은 특정 오디오 신호로 대체(도 6의 (c))하여 대체 콘텐츠를 생성할 수 있다. 콘텐츠 처리 모듈은, 해당 프레임의 오디오 신호를 편집함과 동시에, 해당 프레임의 이미지도 함께 편집하 여 대체 콘텐츠를 생성할 수 있다. 콘텐츠 처리 모듈은, 해당 프레임에, 관리자에 의해 입력되어 미리 설 정된 안내 문구를 포함한 이미지를 삽입하여 대체 콘텐츠를 생성할 수 있다. 콘텐츠 처리 모듈은, 텍스트(문자)에서 유해 요소를 감지하고, 대체 콘텐츠를 생성할 수 있다. 예를 들어, 콘텐츠 처리 모듈은, 인공신경망을 활용하여, 원본 콘텐츠에 포함된 텍스트 신호에서 유해 요 소를 감지하고, 유해 요소가 감지되는 경우 원본 콘텐츠가 유해한 것으로 판단할 수 있다. 콘텐츠 처리 모듈 은, 실시간으로 입력되는 원본 콘텐츠에 포함된 각 프레임 별 텍스트에 대해 유해 요소 포함 여부를 판단 하고, 각 프레임에 대해 실시간으로 편집한 대체 콘텐츠를 생성할 수 있다. 여기서 텍스트 신호에 포함되는 유 해 요소는, 정치적, 종교적 또는 사회적 비난 내용 또는 욕설과 같은 내용 등을 포함할 수 있다. 이를 위해, 콘텐츠 처리 모듈은, 원본 콘텐츠의 각 프레임별 텍스트 신호를 텍스트 버퍼 메모리(미도시)에 저장하며, 저장된 각 프레임별 텍스트 신호에 대해 유해 요소 포함 여부를 감지할 수 있다. 또는, 콘텐츠 처리 모듈은, 원본 콘텐츠의 각 프레임을 스틸 이미지로 캡처하고, 캡처된 스틸 이미지를 비디오 버퍼 메모리에 저장하며, 캡처된 스틸 이미지에서 광학 문자 인식(OCR, Optical Character Recognition)을 통해 텍스트 신호 를 추출하고, 추출된 텍스트 신호에 대해 유해 요소 포함 여부를 감지할 수 있다. 콘텐츠 처리 모듈은, 원본 콘텐츠의 일부 프레임에서 텍스트 신호에 유해 요소가 포함된 것을 판단하는 경 우, 해당 프레임 내에 포함된 텍스트 신호를 제거하거나, 해당 텍스트 신호를 \"유해한 내용을 포함하고 있습니 다.\"와 같은 특정 텍스트 신호로 대체하여 대체 콘텐츠를 생성할 수 있다. 콘텐츠 선택 모듈은, 원본 콘텐츠 또는 대체 콘텐츠 중에서 어느 한 콘텐츠를 제1 출력부로 출력하는 콘텐츠 릴레이(relay)일 수 있다. 콘텐츠 선택 모듈은, 콘텐츠 공유 모듈로부터 원본 콘텐츠를 수신 하고, 콘텐츠 처리 모듈로부터 대체 콘텐츠를 수신할 수 있다. 콘텐츠 선택 모듈은, 콘텐츠 처리 모 듈에서 대체 콘텐츠가 수신되는 경우, 콘텐츠 공유 모듈에서 수신되는 원본 콘텐츠 대신, 수신한 대체 콘텐츠를 출력할 수 있다. 콘텐츠 선택 모듈은, 콘텐츠 처리 모듈에서 대체 콘텐츠가 수신되지 않 는 경우, 콘텐츠 공유 모듈에서 수신되는 원본 콘텐츠를 출력할 수 있다. 콘텐츠 선택 모듈의 콘텐츠 출력은, 프레임 별로 수행될 수 있다. 즉, 원본 콘텐츠가 콘텐츠 공유 모듈로 입력되는 상태에서, 콘텐츠 선택 모듈은 각 프레임 별로, 대체 콘텐츠의 수신 여부를 판단하고, 대체 콘텐츠가 수신되는 프레임에는 대체 콘텐츠를 출력하며, 대체 콘텐츠가 수신되지 않는 프레임에는 원본 콘텐츠를 출력할 수 있다. 저장부는, 제어부 내의 각 신호 처리 및 제어를 위한 프로그램을 저장할 수 있다. 저장부는, 제 어부에서 처리된 데이터 및 처리 대상인 데이터를 저장할 수 있다. 예를 들면, 저장부는, 입력되는 원본 콘텐츠 및 생성된 대체 콘텐츠를 저장할 수 있다. 저장부는, 휘발성 메모리(예: DRAM, SRAM, SDRAM 등)나, 비휘발성 메모리(예: 플래시 메모리(Flash memory), 하드 디스크 드라이브(Hard disk drive; HDD), 솔 리드 스테이트 드라이브(Solid-state drive; SSD) 중 적어도 하나를 포함할 수 있다. 한편, 콘텐츠 처리 장치는, 제2 입력부 및 제2 출력부를 더 포함할 수 있다. 제2 입력부와 제2 출력부는 관리자 단말과 연결되어, 관리자 단말과 정보를 입출력할 수 있다. 제어부는, 원본 콘텐츠가 유해하다고 판단하면, 원본 콘텐츠를 저장부에 저장할 수 있다. 따라서, 저 장부에는 원본 콘텐츠의 각 프레임 중에서 유해 요소를 포함하는 프레임의 데이터(영상 및/또는 오디오)가 저장될 수 있다. 제어부는, 제2 출력부에 관리자 단말(미도시)이 연결되는 경우, 저장부에 저장 된 원본 콘텐츠를 제2 출력부를 통해 출력할 수 있다. 제2 출력부는 HDMI 포트를 포함할 수 있으나, 이에 제한되지 않으며, DP(Display Port), DVI(Digital Visual Interface) 포트 등을 포함할 수 있다. 관리자 단말은, 제2 출력부에서 출력되는 원본 콘텐츠를 출력할 수 있다. 관리자는, 관리자 단말에서 출력 되는 유해 요소를 포함하는 원본 콘텐츠를 확인하고, 해당 원본 콘텐츠가 유해 요소를 포함하는지 여부를 확인 할 수 있다. 만약, 유해 요소를 포함한다고 판단된 원본 콘텐츠가 실제로 유해 요소를 포함하지 않는 경우, 관 리자는, 관리자 단말을 통해 콘텐츠 처리 장치의 인공신경망을 초기화하고, 재학습을 수행하도록 제어할 수 있다. 제어부는, 제2 입력부를 통해 관리자 단말로부터 설정 데이터를 수신할 수 있다. 여기서, 설정 데이 터는 인공신경망의 초기화 및 재학습을 지시하는 정보를 포함할 수 있다. 제어부는, 설정 데이터를 수신하 면, 인공신경망을 초기화하고, 인공신경망의 재학습을 수행할 수 있다. 구체적으로, 제어부는, 학습된 인 공신경망 대신, 학습되지 않은 인공신경망 정보를 재 로딩할 수 있다. 제어부는, 인공신경망 정보가 초기 화되었음을 나타내는 정보를 제2 출력부를 통해 출력할 수 있다. 이 후, 제어부는, 제1 입력부 를 통해, 입력되는 학습용 데이터에 기초하여 인공신경망의 재학습을 수행할 수 있다. 인공신경망의 학습 절차 는 널리 알려진 기술에 해당하므로 구체적인 설명을 생략한다. 인공신경망을 재학습하는 경우, 인공신경망 학습에 사용하는 복수의 학습용 유해 콘텐츠 및 유해 요소를 포함한 다고 판단된 원본 콘텐츠가 사용될 수 있다. 유해 요소를 포함한다고 판단된 원본 콘텐츠는, 실제로 유해 요소 를 포함하지 않는 콘텐츠이므로, 인공신경망 재학습시, 해당 원본 콘텐츠는 유해 요소를 포함하지 않는 것으로 설정하여 재학습에 사용될 수 있다. 이와 같이, 인공신경망이 원본 콘텐츠의 유해 여부를 잘못 판단하는 경우, 인공신경망을 초기화하고, 해당 원본 콘텐츠들을 추가로 활용하여 인공신경망을 재학습시킴으로써, 유해 콘텐츠 판단의 정확성을 높일 수 있다. 한편, 관리자 단말로부터 수신되는 설정 데이터에는 시작 지연 설정 데이터 등이 더 포함될 수 있다. 제어부 는, 시작 지연 설정 데이터에 기초하여, 제1 입력부로부터 입력되는 원본 콘텐츠의 각 프레임 데이터 를 버퍼 메모리에 저장하고, 원본 콘텐츠의 유해 여부 판단을 수행할 수 있다. 한편, 관리자 단말로부터 수신되는 설정 데이터에는 안내 문구 정보가 포함될 수 있다. 제어부는, 수신한 안내 문구 정보에 기초하여, 대체 콘텐츠를 생성할 수 있다. 제2 입력부는 시리얼 통신 포트를 포함할 수 있다. 예를 들어, 제2 입력부는 RS232C, RS422, RS485 포트 등을 포함할 수 있다. 콘텐츠 처리 장치는, 관리자 단말과 유선의 시리얼 통신을 통해서 설정 데이터 등을 수신할 수 있다. 이와 같이, 콘텐츠 처리 장치는, 와이파이, LTE 등과 같은 무선 통신을 통해 외부와 통신 연결되지 않고, 필요에 따라 관리자 단말과 유선의 시리얼 통신을 통해서만 연결됨으로써, 외부로부터 장 치의 해킹 가능성을 줄여, 콘텐츠 처리 장치의 보안성을 높일 수 있다. 콘텐츠 처리 장치는, 상태 표시부를 더 포함할 수 있다. 상태 표시부는 콘텐츠 처리 장치 의 제1 입력부 및/또는 제1 출력부를 통한 입력 신호 또는 출력 신호가 있는 경우 동작할 수 있다.상태 표시부는, 콘텐츠 처리 장치의 동작 상태 정보를 출력할 수 있다. 여기서 동작 상태 정보는 콘 텐츠 처리 장치의 정상 동작 여부, 제1 입력부를 통한 콘텐츠 입력 여부, 안내 문구 설정 여부 중 적 어도 하나를 포함할 수 있다. 예를 들어, 상태 표시부는 2개의 7-segment를 포함하고, 장치의 정상 동작시 '01'을 출력하며, 콘텐츠가 입력되지 않는 경우 '02'를 출력하고, 안내 문구가 설정되지 않은 경우 '03'을 출력 할 수 있다. 이와 같이, 콘텐츠 처리 장치의 상태 표시부를 통해, 장치의 동작 상태를 직관적으로 파 악할 수 있다. 다만, 상태 표시부는 이에 제한되지 않으며, LED, LCD, OLED 등과 같은 디스플레이 장치로 구현될 수도 있다. 도 8 및 도 9는, 본 개시의 일 실시예에 따른, 콘텐츠 처리 방법을 나타낸 순서도이다. 도 8을 참조하면, S810 동작에서, 콘텐츠 처리 장치는, 외부로부터 원본 콘텐츠를 입력받을 수 있다. 콘텐 츠 처리 장치는, 외부 입력 장치의 출력단과 연결된 제1 입력부를 통해 원보 콘텐츠를 입력받을 수 있다. S820 동작에서, 콘텐츠 처리 장치는, 복수의 유해 콘텐츠에 기초하여 학습된 인공신경망을 활용하여, 원본 콘텐츠의 유해 여부를 실시간으로 판단할 수 있다. 원본 콘텐츠가 유해하다고 판단하면, S830 동작에서, 콘텐츠 처리 장치는, 대체 콘텐츠를 출력 콘텐츠로 설정할 수 있다. 대체 콘텐츠는 원본 콘텐츠를 가공하여 영상 내에서의 유해 요소를 제거하거나 모자이크 처리 하거나 설정된 안내 문구를 포함하여 생성될 수 있고, 원본 콘텐츠를 가공하여 유해 요소를 포함하는 오디오를 제거하거나 해당 오디오를 다른 오디오로 교체하여 대체 생성될 수 있다. 원본 콘텐츠가 유해하지 않다고 판단하면, S840 동작에서, 콘텐츠 처리 장치는, 원본 콘텐츠를 출력 콘텐 츠로 설정할 수 있다. 이 후, S850 동작에서, 콘텐츠 처리 장치는, 출력 콘텐츠를 제1 출력부를 통해 출력할 수 있다. 도 9를 참조하면, S910 동작에서, 콘텐츠 처리 장치는, 외부로부터 원본 콘텐츠를 입력받을 수 있다. S920 동작에서, 콘텐츠 처리 장치는, 복수의 유해 콘텐츠에 기초하여 학습된 인공신경망을 활용하여, 원본 콘텐츠의 유해 여부를 실시간으로 판단할 수 있다. 원본 콘텐츠가 유해하다고 판단하면, S930 동작에서, 콘텐츠 처리 장치는, 원본 콘텐츠를 저장부에 저장하고, S940 동작에서, 제2 출력부에 관리자 단말이 연결됨에 기초하여, 저장부에 저장된 원본 콘 텐츠를 제2 출력부를 통해 관리자 단말로 출력할 수 있다. 이 후, S950 동작에서, 콘텐츠 처리 장치는, 제2 입력부를 통해 관리자 단말로부터 설정 데이터의 수 신을 감지할 수 있다. 관리자 단말로부터 설정 데이터를 수신하면, S960 동작에서, 콘텐츠 처리 장치는, 설정 데이터에 기초하여 인공신경망을 초기화하고, S970 동작에서, 복수의 학습용 유해 콘텐츠 및 저장부에 저장된 원본 콘텐츠에 기초하여 인공신경망의 재학습을 수행할 수 있다. 앞에서 설명된 본 개시의 어떤 실시예들 또는 다른 실시예들은 서로 배타적이거나 구별되는 것은 아니다. 앞서 설명된 본 개시의 어떤 실시예들 또는 다른 실시예들은 각각의 구성 또는 기능이 병용되거나 조합될 수 있다. 예를 들면 특정 실시예 및/또는 도면에 설명된 A 구성과 다른 실시예 및/또는 도면에 설명된 B 구성이 결합될 수 있음을 의미한다. 즉, 구성 간의 결합에 대해 직접적으로 설명하지 않은 경우라고 하더라도 결합이 불가능하 다고 설명한 경우를 제외하고는 결합이 가능함을 의미한다. 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발 명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경 은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2022-0094451", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 본 개시의 일 실시예에 따른, 콘텐츠 처리 장치가 입출력 장치에 연결된 것을 나타낸 도면이다. 도 2는, 본 개시의 일 실시예에 따른, 콘텐츠 처리 장치의 블록도이다. 도 3 내지 도 7은, 본 개시의 일 실시예에 따른, 콘텐츠 처리 장치의 설명에 참조되는 도면이다. 도 8 및 도 9는, 본 개시의 일 실시예에 따른, 콘텐츠 처리 방법을 나타낸 순서도이다."}
