{"patent_id": "10-2023-0116416", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0173579", "출원번호": "10-2023-0116416", "발명의 명칭": "행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치, 방법 및 프로그램", "출원인": "주식회사 스탠다다", "발명자": "박정현"}}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말 및 관리자 단말과 통신하는 통신부;상기 통신부를 통해 상기 사용자 단말에서의 웹 브라우징 활동을 행동 데이터로 수집하고, 상기 수집된 상기 행동 데이터를 기반으로 결과 데이터를 생성하고, 상기 생성된 상기 결과 데이터를 UI 형태로 변환하고, 상기 변환된 상기 결과 데이터를 상기 관리자 단말의 화면으로 디스플레이하는 제어부를 포함하며,상기 행동 데이터는 상기 사용자의 브라우저 클릭 데이터, 스크롤 데이터, 마우스 움직임 데이터, 페이지 뷰 데이터, 검색 쿼리 데이터, 폼 입력 데이터, 세션 데이터, 사용자 행동 순서 데이터 및 장바구니 행동 데이터를포함하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 수집된 행동 데이터에서 결측치를 처리하고, 이상치를 제거하는 전처리를 수행하고,상기 전처리된 행동 데이터에서 기 설정된 조건을 만족하는 특징을 추출하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는,상기 전처리된 행동 데이터를 기반으로 인공지능 모델을 학습시키고,상기 학습된 인공지능 모델을 기반으로 상기 행동 데이터에 대한 예측을 수행하고, 상기 예측 결과를 기초로 상기 결과 데이터를 생성하는 것을 특징으로 하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어부는,상기 페이지를 전환한 사용자들의 페이지 전환 원인에 대한 공통점을 도출하고,상기 페이지를 이탈한 사용자들의 페이지 이탈 원인에 대한 공통점을 도출하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0173579-3-제2항에 있어서,상기 제어부는,상기 화면에 디스플레이된 구성의 위치, 좌표 및 크기를 추적하고,상기 추적된 구성 위에 상기 결과 데이터를 오버레이 방식으로 디스플레이 하고,상기 결과 데이터는 상기 구성의 클릭률, 상기 구성의 화면 노출 시간, 상기 구성의 노출과 전환 여부 및 상기구성의 노출과 이탈 여부를 포함하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 제어부는,상기 전처리된 행동 데이터의 데이터 세트를 학습 데이터 세트, 검증 데이터 세트 및 테스트 데이터 세트로 분할하고,상기 행동 데이터를 기초로 인공지능 모델을 설계하고, 상기 학습 데이터 세트를 기초로 인공지능 모델을 학습시키고,상기 검증 데이터 세트와 상기 테스트 데이터 세트를 기초로 상기 모델의 성능을 평가하고,상기 학습된 모델을 사용하여 새로운 사용자 데이터에 대한 예측을 수행하고, 예측 결과를 기초로 결과 데이터를 생성하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 제어부는,상기 결과 데이터를 상기 관리자 단말의 화면에 오버레이 방식으로 디스플레이 하되, 상기 결과 데이터의 특징에 따라 상기 오버레이의 설정을 변경하고,상기 오버레이의 설정은 밝기, 투명도, 색상, 크기 및 오버레이의 깜빡임 주기를 포함하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제어부는,구간별 체류시간, 구간별 전환율, 구간별 이탈율을 상기 관리자 단말의 화면으로 표시하는 것을 특징으로 하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 장치."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "장치에 의해 수행되는 방법으로,공개특허 10-2024-0173579-4-사용자 단말에서의 웹 브라우징 행동을 행동 데이터로 수집하는 단계;상기 수집된 상기 행동 데이터를 기반으로 결과 데이터를 생성하는 단계;상기 생성된 상기 결과 데이터를 UI 형태로 변환하는 단계;상기 변환된 상기 결과 데이터를 관리자 단말의 화면으로 디스플레이하는 단계를 포함하며,상기 행동 데이터는 상기 사용자의 브라우저 클릭 데이터, 스크롤 데이터, 마우스 움직임 데이터, 페이지 뷰 데이터, 검색 쿼리 데이터, 폼 입력 데이터, 세션 데이터, 사용자 행동 순서 데이터 및 장바구니 행동 데이터를포함하는,행동 데이터 분석을 이용한 사용자 행동 패턴 분석 방법."}
{"patent_id": "10-2023-0116416", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 컴퓨터와 결합되어, 제9항의 방법을 실행시키기 위하여 매체에 저장된, 프로그램."}
{"patent_id": "10-2023-0116416", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 인공지능 기반 사용자 행동 패턴 분석 장치 및 방법에 관한 것으로, 사용자가 화면에서 행동하는 행동 데이터를 외부 단말로부터 수집하고, 수집된 상기 행동 데이터를 메모리에 저장하고, 저장된 상기 행동 데이터를 학습하고, 학습된 상기 행동 데이터를 기초로 결과 데이터를 생성하고, 생성된 상기 결과 데이터를 UI 형태로 변 환하고, 변환된 상기 결과 데이터를 디스플레이하는 것을 그 요지로 한다."}
{"patent_id": "10-2023-0116416", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 사용자 행동 패턴 분석 장치에 관한 것이다. 보다 상세하게는, 본 개시는 인공지능 기반의 사용자 행 동 분석 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2023-0116416", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온라인 쇼핑몰의 로딩 속도 개선과 사용자 화면 트래킹을 통한 매출 증대 기술은 최근 발전한 기술이다. 예전에 는 웹 사이트 성능 최적화에 대한 많은 연구가 이루어졌고, 이를 위한 기술들이 개발되어 왔다. 예를 들어, 이 와 관련된 기술로 캐싱, 프리로딩, 이미지 최적화 등이 있다. 최근에는 더욱 정교한 방법들이 개발되었다. 예를 들어, CDN(Content Delivery Network) 기술을 이용하여 웹 페 이지의 로딩 속도를 개선하거나, 웹 페이지의 구성 요소를 동적으로 로딩하는 기술들이다. 그런데 종래의 기술들은 주로 로딩 시간을 단축시키는 방법에만 집중되어 있고, 사용자 경험에 대한 분석이나 개선에 미흡하여 사용자가 어떠한 이유로 쇼핑몰에 머물고 어떠한 이유로 떠나는지 원인을 알 수 없는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-2451099호(등록일: 2022.09.29.)"}
{"patent_id": "10-2023-0116416", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에 개시된 실시예는 쇼핑몰 사이트 사용자가 어떤 지점에서 스크롤을을 멈추는지 어떤 요소가 사용자의 관심을 끌고 어떤 요소가 관심없는지를 분석하고 사용자에게 분석 결과를 알려주는 인공지능 기반 사용자 행동 패턴 분석 장치를 제공하는데 그 목적이 있다. 본 개시에 개시된 실시예는 사용자의 행동 패턴을 분석하여 화면 상의 구성 위에 결과 데이터를 오버레이 방식 으로 디스플레이하여 사용자가 어느 구성에 관심있는지를 직관적으로 알 수 있는 인공지능 기반 사용자 행동 패 턴 분석 장치를 제공하는데 그 목적이 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0116416", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 외부 장치와 데이터를 송수신하는 통신부; 상기 데이터를 저장하는 메모리; 사용자가 화면에서 행동하는 행동 데이터를 상기 통신부를 통하여 수집하고, 수집된 상기 행동 데이터를 상기 메모리에 저장하고, 저장된 상기 행동 데이터를 학습하고, 학습된 상기 행동 데이터를 기초로 결과 데이터를 생성하고, 생성된 상기 결과 데이터를 UI 형태로 변환하고, 변환된 상기 결과 데이터를 디스플레이하는 제어부; 및 상기 제어부로부터의 제어 명령에 따라 그래픽 이미지를 디스플레이하는 디스플레이 를 포함한다. 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 상기 제어부는, 수집된 상기 행동 데이터를 전처 리하고, 전처리된 상기 행동 데이터로부터 특징을 추출하고, 상기 행동 데이터의 데이터 세트를 훈련 데이터 세 트, 검증 데이터 세트 및 테스트 데이터 세트로 분할하고, 상기 행동 데이터를 기초로 모델을 설계하고, 상기 훈련 데이터 세트를 기초로 상기 모델을 훈련하고, 상기 검증 데이터 세트와 상기 테스트 데이터 세트를 기초로 상기 모델의 성능을 평가하고, 상기 훈련된 모델을 사용하여 새로운 사용자 데이터에 대한 예측을 수행하고, 예 측 결과를 기초로 결과 데이터를 생성한다. 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 상기 특징은 사용자의 행동 패턴, 세션 내 활동 및 페이지 방문 순서 중 적어도 하나를 포함한다. 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 상기 제어부는, 화면에 디스플레이된 구성의 위 치, 좌표 및 크기 중 적어도 하나를 추적하고, 추적된 상기 구성 위에 상기 결과 데이터를 오버레이 방식으로 디스플레이한다. 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 상기 제어부는, 화면에 디스플레이된 구성을 소 정 시간 간격으로 추적하고, 추적된 상기 구성 위에 상기 결과 데이터를 오버레이 방식으로 디스플레이한다. 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 상기 결과 데이터는 상기 관리자 브라우저에 디 스플레이된 구성의 클릭율, 구성의 화면 노출 시간, 구성의 화면 노출과 전환 여부 및 구성의 화면 노출과 이탈 여부 중 적어도 하나를 포함한다. 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 상기 제어부는, 변환된 결과에 대응하는 사용자 가 가장 많이 본 구간을 화면의 구성 위에 오버레이하여 디스플레이한다. 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 상기 제어부는, 변환된 결과에 대응하는 사용자 가 가장 많이 이탈한 구간을 화면의 구성 위에 오버레이하여 디스플레이한다. 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법은, 사용자가 화면에서 행동하는 행동 데이터를 외부 단말로부터 수집하는 단계; 수집된 상기 행동 데이터를 메모리에 저장하는 단계; 저장된 상기 행동 데이터를 학 습하는 단계; 학습된 상기 행동 데이터를 기초로 결과 데이터를 생성하는 단계; 생성된 상기 결과 데이터를 UI 형태로 변환하는 단계; 및 변환된 상기 결과 데이터를 디스플레이하는 단계를 포함한다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프 로그램이 더 제공될 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기 록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2023-0116416", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 전술한 과제 해결 수단에 의하면, 웹 사이트 성능 최적화 기술들을 보완하고, 더욱 정교한 방법들을 도입하여 쇼핑몰의 매출을 증대하는 기술을 제공하여 쇼핑몰의 경쟁력을 높일 수 있으며, 사용자 경험을 개선하 여 재방문률을 높일 수 있는 장점이 있다. 본 개시의 전술한 과제 해결 수단에 의하면, 사용자의 행동 패턴을 분석하여 화면 상의 구성 위에 결과 데이터 를 오버레이 방식으로 디스플레이하여 사용자가 어느 구성에 관심있는지를 직관적으로 알 수 있는 장점이 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0116416", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시의 개시가 완전하도록 하고, 본 개시가 속하는 기술 분야의 통상의 기술자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 개시를 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 개시의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 개시가 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 개시의 실시예를 상세하게 설명한다. 설명에 앞서 본 명세서에서 사용하는 용어의 의미를 간략히 설명한다. 그렇지만 용어의 설명은 본 명세서의 이 해를 돕기 위한 것이므로, 명시적으로 본 개시를 한정하는 사항으로 기재하지 않은 경우에 본 개시의 기술적 사 상을 한정하는 의미로 사용하는 것이 아님을 주의해야 한다.본 명세서에서 '본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치 '는 서버 시스템뿐만 아니라 연산처 리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들로 구현될 수 있다. 예를 들어, 본 개시에 따른 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치는, 컴퓨터, 서버 장치 및 휴대용 단말기를 모두 포 함하거나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱 (laptop), 태블릿 PC, 슬레이트 PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버 및 웹 서버 등을 포함할 수 있다. 상기 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD) 등과 같은 웨어러블 장치를 포함할 수 있다. 본 개시에 따른 인공 지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공 지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인공 지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공 지능 전 용 프로세서인 경우, 인공 지능 전용 프로세서는, 특정 인공 지능 모델의 처리에 특화된 하드웨어 구조로 설계 될 수 있다. 기 정의된 동작 규칙 또는 인공 지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만들어진다는 것은, 기본 인공 지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으 로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공 지능 모델이 만들어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공 지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서 버 및/또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습 (reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공 지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공 지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 프로세서는 뉴럴 네트워크를 생성하거나, 뉴럴 네트워크를 훈련(train, 또는 학습(learn)하거나, 수신되는 입력 데이터를 기초로 연산을 수행하고, 수행 결과를 기초로 정보 신호(information signal)를 생성하거나, 뉴럴 네 트워크를 재훈련(retrain)할 수 있다. 뉴럴 네트워크는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), 퍼셉트론(perceptron), 다층 퍼셉트론(multilayer perceptron), FF(Feed Forward), RBF(Radial Basis Network), DFF(Deep Feed Forward), LSTM(Long Short Term Memory), GRU(Gated Recurrent Unit), AE(Auto Encoder), VAE(Variational Auto Encoder), DAE(Denoising Auto Encoder), SAE(Sparse Auto Encoder), MC(Markov Chain), HN(Hopfield Network), BM(Boltzmann Machine), RBM(Restricted Boltzmann Machine), DBN(Depp Belief Network), DCN(Deep Convolutional Network), DN(Deconvolutional Network), DCIGN(Deep Convolutional Inverse GraphicsNetwork), GAN(Generative Adversarial Network), LSM(Liquid State Machine), ELM(Extreme Learning Machine), ESN(Echo State Network), DRN(Deep Residual Network), DNC(Differentiable Neural Computer), NTM(Neural Turning Machine), CN(Capsule Network), KN(Kohonen Network) 및 AN(Attention Network)를 포함 할 수 있으나 이에 한정되는 것이 아닌 임의의 뉴럴 네트워크를 포함할 수 있음은 통상의 기술자가 이해할 것이다. 본 개시의 예시적인 실시예에 따르면, 프로세서는 GoogleNet, AlexNet, VGG Network 등과 같은 CNN(Convolution Neural Network), R-CNN(Region with Convolution Neural Network), RPN(Region Proposal Network), RNN(Recurrent Neural Network), S-DNN(Stacking-based deep Neural Network), S-SDNN(State-Space Dynamic Neural Network), Deconvolution Network, DBN(Deep Belief Network), RBM(Restrcted Boltzman Machine), Fully Convolutional Network, LSTM(Long Short-Term Memory) Network, Classification Network, Generative Modeling, eXplainable AI, Continual AI, Representation Learning, AI for Material Design, 자 연어 처리를 위한 BERT, SP-BERT, MRC/QA, Text Analysis, Dialog System, GPT-3, GPT-4, 비전 처리를 위한 Visual Analytics, Visual Understanding, Video Synthesis, ResNet 데이터 지능을 위한 Anomaly Detection, Prediction, Time-Series Forecasting, Optimization, Recommendation, Data Creation 등 다양한 인공 지능 구조 및 알고리즘을 이용할 수 있으며, 이에 제한되지 않는다. 이하, 첨부된 도면을 참조하여 본 개시의 실시예 를 상세하게 설명한다. 도 1은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치의 개념을도시한 도면이다. 본 발명은 인공지 능 기반 사용자 행동 패턴 분석 장치에 의하여 수행된다. 도 1을 참조하면, 인공지능 기반 사용자 행동 패턴 분석 장치는 사용자 브라우저, 어드민 브라우저 와 데이터를 송수신한다. 사용자 브라우저로부터 사용자 웹 데이터를 수집한다(S110). 수집된 사용자 웹데이터에 대응하는 로(Raw) 데이터를 DB에 저장한다(S120). 여기서, DB는 메모리를 포함한다. 데이터를 학습한다(S130). 서버는 데이터를 학습한다. 학습 결과 및 인사이트 데이터(결과 데이터)를 DB에 저장한다(S140). 인사이트 데이터는 결과 데이터를 포함한 다. 어드민 브라우저는 인사이트 데이터를 확인한다(S150). 인사이트 데이터를 확인하고 피드백을 서버에 전달한다(S160). DB는 저장된 인사이트 데이터를 서버에 전달한다(S170). 서버는 인사이트 데이터를 최종 UI 포맷으로 라이브러리로 전달한다(S180). 라이브러리는 인사이트 데이터를 저장한다(S190). 관리자 브라우저는 인사이트 데이터를 구성 요소 위에 오버레이 하여 디스플레이한다(S200). 본 발명은 사용자가 단말에서 웹 페이지 활동을 프론트단에서 행동 데이터로 수집하고 행동 데이터를 계산하여 서버로 넘겨주는 기술 및 행동 데이터를 가공하여 화면상에서 사용자의 이탈, 전환을 파악하는 기술로 구성되어 있다. 본 발명의 기술적 특징은 1) 인공지능 기반 사용자 행동 패턴을 분석, 2) 관리자 단말에 결과 데이터를 제공하 는 것이다. 서버 내 인공지능(딥러닝) 모델 학습 과정에 대하여 설명한다. 먼저 학습 데이터에 대하여 설명한다. 학습 데이터는 웹 브라우징 행동 데이터를 포함한다. 웹 브라우징 행동 데이터는 다양한 형태와 종류를 가질 수 있다. 사용자의 웹 브라우징 행동 데이터는 클릭 데이터, 스크롤 데이터, 마우스 움직임 데이터, 페이지 뷰 데이터, 검색 쿼리 데이터, 폼 입력 데이터, 세션 데이터, 사용자 행동 순서 데이터, 장바구니 행동 데이터를 포함한다. 클릭 데이터는 사용자가 어떤 요소를 클릭했는지, 어느 위치에서 클릭했는지에 대한 데이터이다. 스크롤 데이터는 사용자가 페이지를 얼마나 스크롤했는지 어느 위치에서 스크롤을 멈추었는지 등에 대한 데이터 이다. 마우스 움직임 데이터는 마우스의 움직임 경로, 움직임 속도, 마우스가 멈춰있는 위치 등의 데이터이다. 페이지 뷰 데이터는 사용자가 어떤 페이지를 보았는지, 얼마나 오래 페이지를 보았는지 등의 데이터이다. 검색 쿼리 데이터는 사용자가 입력한 검색어, 검색 결과에서 선택한 항목 등에 대한 데이터이다. 폼 입력 데이터는 사용자가 폼에 입력한 내용, 어떤 폼 요소를 선택하거나 입력했는지 등의 데이터이다. 세션 데이터는 사용자의 세션 길이, 세션 동안 방문한 페이지 수, 세션 시작/종료 시간 등의 데이터이다. 사용자 행동 순서 데이터는 사용자가 웹사이트에서 어떤 순서로 행동했는지에 대한 데이터이다. 예를 들어, 먼 저 검색을 한 후에 특정 페이지를 방문했는지, 아니면 바로 페이지를 방문했는지 등의 데이터이다. 장바구니 행동 데이터는 전자상거래 사이트에서 사용자가 장바구니에 무엇을 추가하거나 삭제했는지, 구매로 이 어졌는지 등의 데이터이다. 다음은 데이터 전처리 과정에 대한 설명이다. 이에 대한 자세한 설명은 도 4에서 후술한다. 인공지능 모델 동작 과정에 대하여 설명한다. 인공지능 모델은 입력을 받아서 처리해서 결과를 출력한다. 입력은 user_id, session_id, timestamp, page_viewed, time_spent_on_page, scroll_depth, click_coordinates, mouse_movement_path, search_query, form_input_data, clicked_element, cart_add, cart_remove를 포함한다. user_id는 사용자를 식별하는 고유 식별자이다. session_id는 각 사용자 세션을 식별하는 고유 식별자이다. Timestamp는 각 행동이 발생한 시간이다. page_viewed는 사용자가 본 페이지의 URL 또는 고유 식별자이다. time_spent_on_page는 페이지에서 보낸 시간 (초)이다. scroll_depth는 스크롤한 페이지의 깊이 (픽셀 또는 백분율)이다. click_coordinates는 사용자가 클릭한 위치의 좌표 (x, y)이다. mouse_movement_path는 마우스의 움직임 경로 (좌표의 리스트나 다른 표현 방식)이다. search_query는 사용자가 입력한 검색어이다. form_input_data는 사용자가 폼에 입력한 데이터이다. clicked_element는 사용자가 클릭한 웹페이지 요소의 식별자이다. cart_add는 사용자가 장바구니에 추가한 아이템이다. cart_remove는 사용자가 장바구니에서 제거한 아이템이다. 결과는 쇼핑몰 페이지 내의 구성(element)별 클릭율, 상세페이지의 실제 이탈 지점 및 문제점 파악, 전환 사용 자들의 특징, 이탈 사용자들의 특징을 포함한다. 여기서, 서버는 전환 사용자들의 특징과 관련하여, 어떤 점에서, 어떤 이유로, 무엇을 해서 전환을 하게 됐는지 공통점을 도출한다. 서버는 이탈 사용자들의 특징과 관련하여, 어떤 점에서, 어떤 이유로, 무엇을 해서 이탈을 하게 됐는지 공 통점을 도출한다. 도 2는 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치의 구성도를 도시한 도면이다. 도 2를 참조하면, 인공지능 기반 사용자 행동 패턴 분석 장치는 사용자 단말과 관리자 단말과 함께 데이터를 송수신한다. 사용자 단말, 관리자 단말은 스마트폰, PC, 노트북, 태블릿 PC 등과를 포같은 외부 디바이스를 포함 한다. 인공지능 기반 사용자 행동 패턴 분석 장치는 통신부, 메모리, 제어부, 디스플레이를 포함한다. 통신부는 외부 장치와 데이터를 송수신한다. 메모리는 상기 데이터를 저장한다. 제어부는 사용자가 화면에서 행동하는 행동 데이터를 상기 통신부를 통하여 수집하고, 수집된 상기 행동 데이터를 상기 메모리에 저장하고, 저장된 상기 행동 데이터를 학습하고, 학습된 상기 행동 데이터를 기초 로 결과 데이터를 생성하고, 생성된 상기 결과 데이터를 UI 형태로 변환하고, 변환된 상기 결과 데이터를 디스 플레이한다. 제어부는 결과 데이터를 UI 형태로 변환할 때, 이미지 파일, 동영상 파일 형태로 변환시킬 수 있다. 제어부는 결과 데이터를 UI 형태로 변환할 때, 재생되는 기기의 종류에 관계없이 재생될 수 있는 형태로 변환시킬 수 있다. 제어부는 결과 데이터를 UI 형태로 변환할 때, 통합 코덱을 적용하여 재생되는 기기의 종류에 관계없이 재 생될 수 있는 형태로 변환시킬 수 있다. 디스플레이는 제어부로부터의 제어 명령에 따라 그래픽 이미지를 디스플레이한다. 입력부는 사용자 입력을 수신하여 수신된 사용자 입력을 제어부로 전달한다. 카메라는 외부 이미지를 캡쳐해서 캡쳐한 이미지를 제어부로 전달한다. 딥러닝 모델은 LSTM, Transformer, CNN을 포함한다. 딥러닝 모델에 대한 자세한 설명은 도 4에서 후술한다. 제어부는 수집된 상기 행동 데이터를 전처리하고, 전처리된 상기 행동 데이터로부터 특징을 추출하고, 상 기 행동 데이터의 데이터 세트를 훈련 데이터 세트, 검증 데이터 세트 및 테스트 데이터 세트로 분할하고, 상기 행동 데이터를 기초로 모델을 설계하고, 상기 훈련 데이터 세트를 기초로 상기 모델을 훈련하고, 상기 검증 데 이터 세트와 상기 테스트 데이터 세트를 기초로 상기 모델의 성능을 평가하고, 상기 훈련된 모델을 사용하여 새 로운 사용자 데이터에 대한 예측을 수행하고, 예측 결과를 기초로 결과 데이터를 생성한다. 여기서, 특징은 사용자의 행동 패턴, 세션 내 활동 및 페이지 방문 순서를 포함한다. 여기서, 결과 데이터는 상기 관리자 브라우저에 디스플레이된 구성의 클릭율, 구성의 화면 노출 시간, 구성의 화면 노출과 전환 여부 및 구성의 화면 노출과 이탈 여부 중 적어도 하나를 포함한다. 본 발명의 기술적 특징은 사용자 행동 패턴 데이터 분석 결과를 화면의 구성에 오버레이 방식으로 디스플레이 할 수 있다. 제어부는 화면에 디스플레이된 구성의 위치, 좌표 및 크기 중 적어도 하나를 추적하고, 추적된 상기 구성 위에 상기 결과 데이터를 오버레이 방식으로 디스플레이한다. 제어부는 화면에 디스플레이된 구성을 소정 시간 간격으로 추적하고, 추적된 상기 구성 위에 상기 결과 데 이터를 오버레이 방식으로 디스플레이한다. 이에 대하여 도 5에서 후술한다. 다만, 도 2에 도시된 구성 요소들은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치를 구현하 는데 있어서 필수적인 것은 아니어서, 본 명세서 상에서 설명되는 인공지능 기반 사용자 행동 패턴 분석 장치 는 위에서 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다.통신부는 외부 장치와 통신을 가능하게 하는 하나 이상의 구성 요소를 포함할 수 있으며, 예를 들어, 방송 수신 모듈, 유선통신 모듈, 무선통신 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 입력부는 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터, 또는 사용자로부터 입력되는 정보의 입 력을 위한 것으로서, 적어도 하나의 카메라, 적어도 하나의 마이크로폰 및 사용자 입력부 중 적어도 하나를 포 함할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데이터는 분석되어 사용자의 제어명령으로 처리될 수 있다. 디스플레이는 인공지능 기반 사용자 행동 패턴 분석 장치에서 처리되는 정보를 표시(출력)한다. 예를 들어, 인공지능 기반 사용자 행동 패턴 분석 장치는 구동되는 응용 프로그램(일 예로, 어플리케이션)의 실 행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표 시할 수 있다. 메모리는 인공지능 기반 사용자 행동 패턴 분석 장치의 다양한 기능을 지원하는 데이터와, 제어부의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들(예를 들어, 음악 파일, 정지영상, 동영상 등)을 저장할 있고, 인공지능 기반 사용자 행동 패턴 분석 장치에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 본 장치의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러 한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 이러한, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입 (Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 인공지능 기반 사용자 행동 패턴 분석 장치와는 분리되어 있으나, 유선 또는 무선으로 연결된 데이터베이스가 될 수도 있으며, 데이터 베이 스 시스템으로 구현될 수도 있다. 제어부는 적어도 하나의 코어를 포함하며, 인공지능 기반 사용자 행동 패턴 분석 장치 내의 구성요소 들의 동작을 제어하기 위한 알고리즘 또는 알고리즘을 재현한 프로그램에 대한 데이터를 저장하는 메모리 및 메 모리에 저장된 데이터를 이용하여 전술한 동작을 수행하는 적어도 하나의 프로세서(미도시)로 구현될 수 있다. 이때, 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있다. 또는, 메모리와 프로세서는 단일 칩으로 구현 될 수도 있다. 또한, 제어부는 이하의 도 3 내지 도 12에서 설명되는 본 개시에 따른 다양한 실시 예들을 인공지능 기반 의 사용자 행동 분석 장치 상에서 구현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수 를 조합하여 제어할 수 있다. 도 2에 도시된 구성 요소들의 성능에 대응하여 적어도 하나의 구성요소가 추가되거나 삭제될 수 있다. 또한, 구 성 요소들의 상호 위치는 시스템의 성능 또는 구조에 대응하여 변경될 수 있다는 것은 당해 기술 분야에서 통상 의 지식을 가진 자에게 용이하게 이해될 것이다. 한편, 도 2에서 도시된 각각의 구성요소는 소프트웨어 및/또는 Field Programmable Gate Array(FPGA) 및 주문 형 반도체(ASIC, Application Specific Integrated Circuit)와 같은 하드웨어 구성요소를 의미한다. 도 3은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법의 순서도를 도시한 도면이다. 본 발명은 인 공지능 기반 사용자 행동 패턴 분석 장치에 의하여 수행된다. 인공지능 기반 사용자 행동 패턴 분석 장치는 서 버를 포함할 수 있다. 도 3을 참조하면, 상기 장치는 사용자가 화면에서 행동하는 행동 데이터를 외부 단말로부터 수집한다 (S310). 수집된 상기 행동 데이터를 메모리에 저장한다(S320). 저장된 상기 행동 데이터를 학습한다(S330). 학습된 상기 행동 데이터를 기초로 결과 데이터를 생성한다(S340). 생성된 상기 결과 데이터를 UI 형태로 변환한다(S350). 변환된 상기 결과 데이터를 디스플레이한다(S360). 도 4는 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법의 순서도를 도시한 도면이다. 본 발명은 인 공지능 기반 사용자 행동 패턴 분석 장치에 의하여 수행된다. 인공지능 기반 사용자 행동 패턴 분석 장치는 서 버를 포함한다. 도 4를 참조하면, 사용자의 행동 데이터를 수집한다. 여기서, 사용자 행동 데이터는 사용자의 브라우저 클릭, 스크롤, 검색 쿼리 등을 포함할 수 있다. 행동 데이터는 로그 파일, 데이터베이스, 또는 다른 형태로 저장될 수 있다. 수집된 상기 행동 데이터를 전처리한다(S410). 수집된 행동 데이터는 딥러닝 모델에 입력으로 사용하기 위해 전처리 과정을 거친다. 이 과정에서는 결측치 처 리, 이상치 제거, 범주형 데이터의 원-핫 인코딩 등 다양한 전처리 기법이 사용될 수 있다. 전처리된 상기 행동 데이터로부터 특징을 추출한다(S420). 전처리된 데이터에서 중요한 특징을 추출한다. 여기서 특징은 사용자의 행동 패턴, 세션 내 활동 및 페이지 방 문 순서 등을 포함할 수 있다. 상기 행동 데이터의 데이터 세트를 훈련 데이터 세트, 검증 데이터 세트 및 테스트 데이터 세트로 분할한다 (S430). 모델 훈련을 위해 데이터셋을 훈련, 검증, 테스트 세트로 분할한다. 일반적으로 데이터의 70-80%는 훈련용, 나 머지는 검증과 테스트용으로 사용된다. 상기 행동 데이터를 기초로 모델을 설계하고, 상기 훈련 데이터 세트를 기초로 상기 모델을 훈련한다(S440). 여기서, 모델은 딥러닝 모델을 포함한다. 딥러닝 모델들(LSTM, Transformer, CNN)을 설계하고, 훈련 데이터셋을 사용하여 모델을 반복해서 훈련시킨다. 이 때, 손실 함수와 옵티마이저를 선택하고, 필요에 따라 정규화 기법을 적용한다. 먼저, LSTM (Long Short-Term Memory)은 RNN의 변형으로, 장기 의존성 문제를 해결하기 위해 고안되었다. LSTM 은 세션 데이터와 같이 시간적 순서를 가진 데이터를 사용한다. 어떤 페이지를 먼저 방문했는지, 어떤 제품을 장바구니에 먼저 담았는지와 같은 정보를 학습하는 데 사용한다. 다음으로, Transformer는 Self-Attention 메커니즘을 통해 시퀀스의 각 요소가 다른 모든 요소와 어떻게 상호작 용하는지를 학습한다. CNN은 시계열 데이터를 처리하는 데 사용한다. 사용자의 마우스 움직임 패턴이나 클릭 패턴을 1차원 시계열 데 이터로 보고 이를 학습하는 데 사용한다. 상기 검증 데이터 세트와 상기 테스트 데이터 세트를 기초로 상기 모델의 성능을 평가한다(S450). 검증 데이터셋과 테스트 데이터셋을 사용하여 모델의 성능을 평가한다. 이 때, 적절한 평가 지표(전환 정확도, 전환 정밀도 등)를 선택한다. 훈련된 모델을 사용하여 새로운 사용자 데이터에 대한 예측을 수행하고, 예측 결과를 기초로 결과 데이터를 생 성한다(S460). 훈련된 모델을 사용하여 새로운 사용자 데이터에 대한 예측을 수행하고, 이를 통해 웹 브라우징 행동에 대한 결 과 데이터를 생성한다. 피드백 루프를 실행한다. 결과 데이터는 실제 비즈니스 환경에 적용되어 사용자의 브라우징 경험을 향상시키는 데 도움이 된다. 이를 통 해 얻은 결과를 다시 모델에 피드백하여 모델을 더욱 개선한다. 모델 업데이트와 유지 보수를 실행한다. 시간이 지나면서 데이터와 사용자의 행동 패턴은 변화할 수 있다. 이에 따라 모델도 주기적으로 업데이트되어야 한다. 새로운 데이터를 수집하고, 이를 이용해 모델을 재훈련시킨다. 도 5는 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법 실행 시 화면의 각 구성을 파악하는 것을 도 시한 도면이다. 도 5는 도 5(a), 도 5(b)를 포함한다. 도 5(a)는 화면의 구성을 도시한 도면이다. 도 5(b)는 화면의 구성을 파악한 것을 도시한 도면이다. 도 5(a)를 참조하면, 제어부는 화면의 구성을 디스플레이한다. 도 5(b)에 도시한 바와 같이, 제어부는 화면의 구성을 개별적으로 파악하여 파악 결과를 메모리에 저장한 다. 예를 들어, 제어부는 화면의 구성(501, 502, 503, 504)을 실시간으로 개별적으로 파악할 수 있다. 제어부는 사용자 행동 패턴 데이터 분석 결과를 화면의 구성 위에 오버레이 방식으로 디스플레이 할 수 있 다. 이에 대한 자세한 설명은 도 6, 7에서 후술한다. 첫째, 화면 상 구성의 위치, 좌표, 크기 추적 방법에 대하여 설명한다. 제어부는 화면에 디스플레이된 구성의 위치, 좌표 및 크기 중 적어도 하나를 추적하고, 추적된 상기 구성 위에 상기 결과 데이터를 도 6, 도 7과 같이 오버레이 방식으로 디스플레이한다. 구체적으로, 제어부는 구성의 트리 구조를 모두 파악해 부모 노드들의 x좌표, y좌표, 너비(width), 높이 (height) 등을 실시간으로 파악하고, 트리 안의 부모 노드들의 모든 데이터를 계산하여 실질적으로 화면에 대상 구성의 절대 좌표 값과 크기를 분석한다. 제어부는 분석된 구성에 화면 및 뷰포트(viewport) 의 너비(width), 높이 (height) 데이터와 scroll position 을 산출하여 최종적으로 화면의 어느 부분에 표시되는지 알 수 있다. 둘째, 실시간 트래킹 방법에 대하여 설명한다. 제어부는 화면에 디스플레이된 구성을 소정 시간 간격으로 추적하고, 추적된 상기 구성 위에 상기 결과 데 이터를 오버레이 방식으로 디스플레이한다. 제어부는 구성의 속성(attributes)에 utt-track 이라는 값을 넣고, 페이지가 최초로 로딩이 될 때와 DOM이 달라졌을 때를 트래킹하여 query selector를 통해 utt-track이라는 값을 가지고 있는 구성 들의 데이터를 단위 시간(0.1초단위)로 가져온다. 제어부는 0.1초 단위로 구성의 위치를 트래킹 한 다음, 그 위에 결과 데이터를 오버레이 방식으로 디스플 레이한다. 셋째, 오버레이되는 특징에 대하여 설명한다. 특징은 구성(Element)의 클릭율, 구성의 화면(viewport) 노출 시간, 구성의 노출과 전환 여부, 구성의 노출과 이탈 여부를 포함한다. 넷째, 오버레이될 때 부가적으로 조절되는 특징에 대하여 설명한다. 아래 특징들은 오버레이 되는 특징들의 정도에 따라 차등적으로 조절될 수 있다. 예를 들어, 밝기(Brightness)의 경우, 각 제품 별 “구매”버튼 상에 클릭율이 오버레이되며, 클릭율이 높을수 록 “구매” 버튼 상에 오버레이되는 영역의 밝기가 밝아질 수 있다. 투명도 (Opacity)의 경우, 이탈률 높은 구간으로 설정된 영역 중, 가장 이탈률 높은 영역의 투명도를 다른 영역 보다 낮게(진하게) 오버레이할 수 있다. 색상 (Color)의 경우, 이탈율 높은 구간으로 설정된 영역 중, 가장 이탈률 높은 영역의 색상을 다른 영역과 다 르게 오버레이할 수 있다. 크기 (Size)의 경우, 이탈율 높은 구간으로 설정된 영역 중, 가장 이탈률 높은 영역의 크기를 다른 영역과 다르 게 오버레이할 수 있다. 오버레이 주기 설정의 경우, 이탈, 클릭률 등 각각의 요소 중 기설정된 임계치 이상의 경우, 오버레이 주기(깜 빡임 주기)를 기준치 이상 짧게 하여 자주 깜빡이도록 조절할 수 있다. 위와 마찬 가지로, 제어부는 오버레이할 때 텍스트, 구성의 오프셋 값의 위치, 블랜드 모드를 실행할 수 있다. 여기서, 텍스트는 화면에 표시된 글자를 의미한다. 구성의 오프셋(Offset)은 구성의 위치 값을 상대적으로 조정할 수 있음을 의미한다. 블랜드 모드(Blend Mode)는 위에서 설명한 오버레이가 될 때 부가되는 특징을 복합적으로 적용할 수 있는 모드 를 의미한다. 도 6은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법 실행 시 사용자가 가장 많이 본 구간을 오버 레이하는 것을 도시한 도면이다. 도 6을 참조하면, 제어부는 변환된 결과 데이터에 대응하는 사용자가 가장 많이 본 구간을 화면의 구 성 위에 오버레이하여 디스플레이한다. 본 발명에 따르면, 화면의 구성 요소 중 사용자가 가장 많이 본 구간이 어느 부분인지 직관적으로 알 수 있는 장점이 있다. 도 7은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법 실행 시 가장 이탈이 많이 생긴 구간을 오버 레이하는 것을 도시한 도면이다. 도 7을 참조하면, 제어부는 변환된 결과 데이터에 대응하는 사용자가 가장 많이 이탈한 구간을 화면 의 구성위에 오버레이하여 디스플레이한다. 본 발명에 따르면, 화면의 구성 요소 중 사용자가 가장 많이 이탈한 구간이 어느 부분인지 직관적으로 알 수 있 는 장점이 있다. 도 8은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법 실행 시 구성 요소별 클릭률을 오버레이하는 것을 도시한 도면이다. 도 8은 도 8(a), 도 8(b)를 포함한다. 도 8(a)는 화면에 구성 요소를 디스플레이하는 것을 도시한 도면이다. 도 8(b)는 구성 요소 위에 구성 요소별 클릭률을 오버레이하는 것을 도시한 도면이다. 도 8(a)를 참조하면, 사용자가 구성 요소별 클릭률을 선택하는 입력을 수신하면, 도 8(b)에 도시한 바 와 같이, 제어부는 구성 요소 위에 구성 요소별 클릭률을 디스플레이한다. 본 발명에 따르면, 구성 요소별 클릭률을 선택하는 입력을 수신하면, 구성 요소별 클릭률을 즉시 알 수 있어서 사용자가 구성 요소 중 어느 부분에 관심이 있는지 직관적으로 알 수 있는 장점이 있다. 도 9는 본 개시에 따른 사용자가 트래킹 목록보기를 선택하면, 현재 페이지의 트래킹 리스트를 디스플레이하는 것을 도시한 도면이다. 도 9는 도 9(a), 도 9(b)를 포함한다. 도 9(a)는 사용자가 트래킹 목록보기를 선택하는 것을 도시한 도면이다. 도 9(b)는 현재 페이지의 트래킹 리스트를 도시한 도면이다. 도 9(a)를 참조하면, 사용자가 트래킹 목록 보기를 선택하는 입력을 수신하면, 도 9(b)에 도시한 바와 같이 제어부는 현재 페이지의 트래킹 리스트를 디스플레이한다. 도 10은 본 개시에 따른 사용자가 현재 페이지의 트래킹 리스트의 재생 버튼을 선택하면, 체류시간 동안 시청한 내용을 디스플레이하는 것을 도시한 도면이다. 도 10은 도 10(a), 도 10(b)를 포함한다. 도 10(a)는 현재 페이지의 트래킹 리스트에서 재생 버튼을 선택하는 것을 도시한 도면이다. 도 10(b)는 사용자 가 체류시간 동안 시청한 내용을 디스플레이하는 것을 도시한 도면이다. 도 10(a)를 참조하면, 현재 페이지의 트래킹 리스트에서 사용자가 재생 버튼을 선택하는 입력을 수신 하면, 도 10(b)에 도시한 바와 같이, 제어부는 사용자가 체류시간 동안 시청한 내용을 시간 순서대 로 디스플레이한다. 본 발명에 따르면, 재생 버튼을 선택하는 입력을 수신하면, 사용자가 체류시간 동안 시청한 내용을 시간 순서대 로 알 수 있어서 사용자가 구성 요소 중 어느 부분에 관심이 있는지 직관적으로 알 수 있는 장점이 있다. 도 11은 본 개시에 따른 구간별 체류시간, 구간별 전환율, 구간별 이탈률을 도시한 도면이다. 도 11은 도 11(a), 도 11(b), 도 11(c)를 포함한다. 도 11(a)는 구간별 체류 시간을 도시한 도면이다. 도 11(b)는 구간별 전환율을 도시한 도면이다. 도 11(c)는 구간별 이탈율을 도시한 도면이다. 도 11(a)를 참조하면, x축은 구간이고 y축은 구간별 체류시간을 의미한다. 도 11(b)를 참조하면, x축은 구간이고 y축은 전환율을 의미한다. 도 11(c)를 참조하면, x축은 구간이고 y축은 이탈율을 의미한다. 제어부는 구간별 체류시간, 구간별 전환율, 구간별 이탈율에 대한 색상을 다르게 디스플레이할 수 있다. 도 11(a)를 참조하면, 제어부는 스크롤 바를 디스플레이하고, 사용자의 입력을 수신하면, 입 력를 따라 스크롤 바를 움직일 수 있도록 제어할 수 있다. 도 11(b), 도 11(c)에서도 마찬가지로 적용될 수 있다. 도 12는 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치의 구성도를 도시한 도면이다. 도 12를 참조하면, 인공지능 기반 사용자 행동 패턴 분석 장치는 디바이스를 포함한다. 디바이스는 메모리, 프로세서, 송수신부 및 주변 장치를 포함할 수 있다. 또한, 일 예로, 디바이 스는 다른 구성을 더 포함할 수 있으며, 상술한 실시예로 한정되지 않는다. 보다 상세하게는, 도 10의 디바이스는 NDN 디바이스, NDN 서버, 콘텐츠 라우터 등과 같은 예시적인 하드 웨어/소프트웨어 아키텍처일 수 있다. 이때, 일 예로, 메모리는 비이동식 메모리 또는 이동식 메모리일 수 있다. 또한, 일 예로, 주변 장치는 디스플레이, GPS 또는 다른 주변기기들을 포함할 수 있으며, 상술 한 실시예로 한정되지 않는다. 또한, 일 예로, 상술한 디바이스는 상기 송수신부와 같이 통신 회로를 포함할 수 있으며, 이에 기 초하여 외부 디바이스와 통신을 수행할 수 있다. 또한, 일 예로, 프로세서는 범용 프로세서, DSP(digital signal processor), DSP 코어, 제어기, 마이크 로제어기, ASIC들(Application Specific Integrated Circuits), FPGA(Field Programmable Gate Array) 회로들, 임의의 다른 유형의 IC(integrated circuit) 및 상태 머신과 관련되는 하나 이상의 마이크로프로세서 중 적어도 하나 이상일 수 있다. 즉, 상술한 디바이스를 제어하기 위한 제어 역할을 수행하는 하드웨어적 /소프트웨어적 구성일 수 있다. 이때, 프로세서는 노드의 다양한 필수 기능들을 수행하기 위해 메모리에 저장된 컴퓨터 실행가능한 명령어들을 실행할 수 있다. 일 예로, 프로세서는 신호 코딩, 데이터 처리, 전력 제어, 입출력 처리 및 통신 동작 중 적어도 어느 하나를 제어할 수 있다. 또한, 프로세서는 물리 계층, MAC 계층, 어플리케이션 계층들을 제어할 수 있다. 또한, 일 예로, 프로세서는 액세스 계층 및/또는 어플리케이션 계층 등에서 인 증 및 보안 절차를 수행할 수 있으며, 상술한 실시예로 한정되지 않는다. 일 예로, 프로세서는 송수신부를 통해 다른 장치들과 통신을 수행할 수 있다. 일 예로, 프로세서 는 컴퓨터 실행가능한 명령어들의 실행을 통해 노드가 네트워크를 통해 다른 노드들과 통신을 수행하게 제어할 수 있다. 즉, 본 발명에서 수행되는 통신이 제어될 수 있다. 일 예로, 다른 노드들은 NDN 서버, 콘텐츠 라우터 및 그 밖의 다른 디바이스들일 수 있다. 일 예로, 송수신부는 안테나를 통해 RF 신호를 전송할 수 있으며, 다양한 통신망에 기초하여 신호를 전송할 수 있다. 또한, 일 예로, 안테나 기술로서 MIMO 기술, 빔포밍 등이 적용될 수 있으며, 상술한 실시예로 한정되지 않는다. 또한, 송수신부를 통해 송수신한 신호는 변조 및 복조되어 프로세서에 의해 제어될 수 있으며, 상 술한 실시 예로 한정되지 않는다. 본 개시의 다양한 실시 예는 모든 가능한 조합을 나열한 것이 아니고 본 개시의 대표적인 양상을 설명하기 위한 것이며, 다양한 실시 예에서 설명하는 사항들은 독립적으로 적용되거나 또는 둘 이상의 조합으로 적용될 수도 있다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2023-0116416", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치의 개념을도시한 도면이다. 도 2는 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치의 구성도를 도시한 도면이다. 도 3은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법의 순서도를 도시한 도면이다. 도 4는 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법의 순서도를 도시한 도면이다. 도 5는 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법 실행 시 화면의 각 구성을 파악하는 것을 도 시한 도면이다. 도 6은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법 실행 시 사용자가 가장 많이 본 구간을 오버 레이하는 것을 도시한 도면이다. 도 7은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법 실행 시 가장 이탈이 많이 생긴 구간을 오버 레이하는 것을 도시한 도면이다. 도 8은 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 방법 실행 시 구성 요소별 클릭률을 오버레이하는 것을 도시한 도면이다. 도 9는 본 개시에 따른 사용자가 트래킹 목록보기를 선택하면, 현재 페이지의 트래킹 리스트를 디스플레이하는 것을 도시한 도면이다. 도 10은 본 개시에 따른 사용자가 현재 페이지의 트래킹 리스트의 재생 버튼을 선택하면, 체류시간 동안 시청한 내용을 디스플레이하는 것을 도시한 도면이다. 도 11은 본 개시에 따른 구간별 체류시간, 구간별 전환율, 구간별 이탈률을 도시한 도면이다. 도 12는 본 개시에 따른 인공지능 기반 사용자 행동 패턴 분석 장치의 구성도를 도시한 도면이다."}
