{"patent_id": "10-2017-0163611", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0064216", "출원번호": "10-2017-0163611", "발명의 명칭": "용접 강도 예측 장치 및 방법", "출원인": "한국생산기술연구원", "발명자": "강문진"}}
{"patent_id": "10-2017-0163611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "용접된 모재의 용접부위를 비전 센서를 통하여 용접부 표면을 측정하는 측정 단계;측정된 상기 용접부 표면을 이용하여 용접부 형상을 도출하는 형상 도출 단계;상기 용접부 형상으로부터 상기 용접부위의 파라미터를 산출하는 파라미터 산출 단계;상기 모재의 물리적 특성을 입력값으로 획득하는 입력값 획득 단계; 및상기 파라미터 및 상기 입력값을 인공신경망에 입력하고, 상기 파라미터 및 상기 입력값에 대응되는 강도를 예측하는 강도 예측 단계;를 포함하는, 용접 강도 예측 방법."}
{"patent_id": "10-2017-0163611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "상기 강도 예측 단계는,상기 파라미터 및 상기 입력값을 인공신경망에 입력하는 입력 단계;각각 10개의 노드로 형성된 제 1 은닉층 및 제 2 은닉층을 통하여 상기 용접부의 인장강도 및 피로강도를 연산하는 연산 단계: 및상기 용접부의 인장강도 및 피로강도를 출력하는 출력 단계;를 포함하는, 용접 강도 예측 방법."}
{"patent_id": "10-2017-0163611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 파라미터는,상기 용접부위에서 용융부의 보강 덧붙임, 용접비드 두께, 실제 목두께, 각장, 용입 깊이, 토우부 각도, 용접비드 각도, 각장 각도, 보강 덧붙임 면적, 목 면적, 용입 면적 및 용접부 기공률 중 어느 하나 이상을 포함하는,용접 강도 예측 방법."}
{"patent_id": "10-2017-0163611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 입력값은,상기 모재의 상판 및 하판의 강도, 두께, 도금, 조직, 상판 언더컷, 하판 언더컷 및 상판과 하판의 갭(gap) 중어느 하나 이상을 포함하는, 용접 강도 예측 방법."}
{"patent_id": "10-2017-0163611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "용접된 모재의 용접부위를 비전 센서를 통하여 용접부 표면을 측정하는 측정부;측정된 상기 용접부 표면을 이용하여 용접부 형상을 도출하는 형상 도출부;상기 용접부 형상으로부터 상기 용접부위의 파라미터를 산출하는 파라미터 산출부;상기 모재의 물리적 특성을 입력값으로 획득하는 입력값 획득부; 및상기 파라미터 및 상기 입력값을 인공신경망에 입력하고, 상기 파라미터 및 상기 입력값에 대응되는 강도를 예측하는 강도 예측부;공개특허 10-2019-0064216-3-를 포함하는, 용접 강도 예측 장치."}
{"patent_id": "10-2017-0163611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 강도 예측부는,상기 파라미터 및 상기 입력값을 인공신경망에 입력하는 입력부;각각 10개의 노드로 형성된 제 1 은닉층 및 제 2 은닉층을 가지는 상기 인공신경망을 통하여 상기 용접부의 인장강도 및 피로강도를 연산하는 연산부: 및상기 용접부의 인장강도 및 피로강도를 출력하는 출력부;를 포함하는, 용접 강도 예측 장치."}
{"patent_id": "10-2017-0163611", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 용접 강도 예측 방법에 관한 것으로서, 용접된 모재의 용접부위를 비전 센서를 통하여 용접부 표면을 측정하는 측정 단계; 측정된 상기 용접부 표면을 이용하여 용접부 형상을 도출하는 형상 도출 단계; 상기 용접부 형상으로부터 상기 용접부위의 파라미터를 산출하는 파라미터 산출 단계; 상기 모재의 물리적 특성을 입력값으로 획득하는 입력값 획득 단계; 및 상기 파라미터 및 상기 입력값을 인공신경망에 입력하고, 상기 파라미터 및 상기 입력값에 대응되는 강도를 예측하는 강도 예측 단계;를 포함할 수 있다."}
{"patent_id": "10-2017-0163611", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 용접 강도 예측 장치 및 방법에 관한 것으로 보다 상세하게는 비전 센서로 측정된 용접부위의 형상을 인공지능 네트워크에 투입하여 용접부위의 인장강도와 피로강도를 높은 수준의 정확도로 예측하는 용접 강도 예 측 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2017-0163611", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 선박, 자동차, 산업장비 등의 각 분야에서 사용되는 복잡한 제품을 조립할 때는 매우 많은 부분에 용접을 하여 각각의 부품들을 고정시키는데, 상기한 용접 작업은 용접 로봇에 의해 이루어지거나 또는 작업자가 직접 용접기로 용접을 하게 된다. 이러한 용접 작업은 제품의 강도에 직접적으로 영향을 주는 것이기 때문에, 매우 신중하게 작업을 진행해야 함 과 아울러 용접 후에도 용접의 용접 상태를 검사해야 한다. 즉, 용접을 한 후에 실질적으로 2개의 부품을 결합 시키는 부분인 용접부의 상태를 검사함으로써 용접 강도 등을 확인하여야 한다. 용접이 완료된 제품의 검사방법으로는 방사선, 초음파, 전자기, 유체, 열, 빛 등을 이용해 재료, 기기 구조물 등의 성질과 내부 조직을 변화시키거나 파괴하지 않고 시험체 내ㅇ외면의 결함 존재 유무, 음력상태, 특성, 재 질변화, 건전도 등을 검사하는 비파괴 검사와, 검사자의 육안으로 확인이 불가능하거나 비파괴 검사장비로도 확 실한 결과를 분석하기 어려울 경우 이를 절단해서 절단부위의 용접상태를 분석함으로써 결함을 예상하고, 결함 이 추정된다면 이를 토대로 수정할 수 있도록 하는 파괴 검사가 있다. 이러한 종래의 용접 검사에 있어서, 용접 결과를 예측하기란 매우 어려운 일이며, 용접 품질을 관리하고 예측하 는 일은 더욱 더 복잡해지고, 용접 강도, 인장 강도 등을 분석하는데 있어 많은 시간과 비용을 요하고, 과정이 복잡하여 어려움이 발생하였다."}
{"patent_id": "10-2017-0163611", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 사상은, 상술한 요구에 부응하기 위하여 안출된 것으로, 비전 센서를 통하여 용접부 표면을 측정하여 용접부 형상을 도출할 수 있으며, 용접부 형상에서 산출되는 파라미터를 인공신경망에 입력할 경우, 그에 따른 기계적 특성을 높은 수준의 정확도로 예측하는데 그 목적이 있다. 그러나 이러한 과제는 예시적인 것으로서, 이 에 의해 본 발명의 범위가 한정되는 것은 아니다."}
{"patent_id": "10-2017-0163611", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 본 발명의 사상에 따른 용접 강도 예측 방법은, 용접된 모재의 용접부위를 비전 센 서를 통하여 용접부 표면을 측정하는 측정 단계; 측정된 상기 용접부 표면을 이용하여 용접부 형상을 도출하는 형상 도출 단계; 상기 용접부 형상으로부터 상기 용접부위의 파라미터를 산출하는 파라미터 산출 단계; 상기 모 재의 물리적 특성을 입력값으로 획득하는 입력값 획득 단계; 및 상기 파라미터 및 상기 입력값을 인공신경망에입력하고, 상기 파라미터 및 상기 입력값에 대응되는 강도를 예측하는 강도 예측 단계;를 포함할 수 있다. 본 발명의 사상에 따르면, 상기 강도 예측 단계는, 상기 파라미터 및 상기 입력값을 인공신경망에 입력하는 입 력 단계; 각각 10개의 노드로 형성된 제 1 은닉층 및 제 2 은닉층을 통하여 상기 용접부의 인장강도 및 피로강 도를 연산하는 연산 단계: 및 상기 용접부의 인장강도 및 피로강도를 출력하는 출력 단계;를 포함할 수 있다. 본 발명의 사상에 따르면, 상기 파라미터는, 상기 용접부위에서 용융부의 보강 덧붙임, 용접비드 두께, 실제 목 두께, 각장, 용입 깊이, 토우부 각도, 용접비드 각도, 각장 각도, 보강 덧붙임 면적, 목 면적, 용입 면적 및 용 접부 기공률 중 어느 하나 이상을 포함할 수 있다. 본 발명의 사상에 따르면, 상기 입력값은, 상기 모재의 상판 및 하판의 강도, 두께, 도금, 조직, 상판 언더컷, 하판 언더컷 및 상판과 하판의 갭(gap) 중 어느 하나 이상을 포함할 수 있다. 상기 과제를 해결하기 위한 본 발명의 사상에 따른 용접 강도 예측 장치는, 용접된 모재의 용접부위를 비전 센 서를 통하여 용접부 표면을 측정하는 측정부; 측정된 상기 용접부 표면을 이용하여 용접부 형상을 도출하는 형 상 도출부; 상기 용접부 형상으로부터 상기 용접부위의 파라미터를 산출하는 파라미터 산출부; 상기 모재의 물 리적 특성을 입력값으로 획득하는 입력값 획득부; 및 상기 파라미터 및 상기 입력값을 인공신경망에 입력하고, 상기 파라미터 및 상기 입력값에 대응되는 강도를 예측하는 강도 예측부;를 포함할 수 있다. 본 발명의 사상에 따르면, 상기 강도 예측부는, 상기 파라미터 및 상기 입력값을 인공신경망에 입력하는 입력부; 각각 10개의 노드로 형성된 제 1 은닉층 및 제 2 은닉층을 가지는 상기 인공신경망을 통하여 상기 용접 부의 인장강도 및 피로강도를 연산하는 연산부: 및 상기 용접부의 인장강도 및 피로강도를 출력하는 출력부;를 포함할 수 있다."}
{"patent_id": "10-2017-0163611", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 용접 강도 예측 장치 및 방법에 의하면, 비전 센서를 사용하여 용접부 표면의 측정만으로 용접 부 형상을 예측할 수 있으며, 용접부 형상으로 각종 파라미터들을 산출할 수 있어 용접부위를 검사하는데 있어 서 공정 시간 및 비용을 감소시킬 수 있다. 또한, 강도를 예측하는 방법으로 인공신경망을 활용하여 피용접재가 변경될 때마다 다수의 실험을 통해 결과를 확인하고 새로운 공정변수를 설정하는 반복이 필요 없으며, 최소한의 입력 자료로 높은 예측 정확도를 가질 수 있어, 공정 시간 및 비용을 감소시키고 비용과 시간 대비 용접품질을 최대화할 수 있으며, 데이터가 없는 피용 접재도 용접예측이 가능하다는 효과를 가진다. 이러한 효과에 의해 본 발명의 범위가 한정되는 것은 아니다."}
{"patent_id": "10-2017-0163611", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 여러 실시예들을 상세히 설명하기로 한다. 본 발명의 실시예들은 당해 기술 분야에서 통상의 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위하 여 제공되는 것이며, 하기 실시예는 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 하기 실시예에 한정되는 것은 아니다. 오히려 이들 실시예들은 본 개시를 더욱 충실하고 완전하게 하고, 당업자에게 본 발명의 사상을 완전하게 전달하기 위하여 제공되는 것이다. 또한, 도면에서 각 층의 두께나 크기는 설명의 편의 및 명 확성을 위하여 과장된 것이다. 이하, 본 발명의 실시예들은 본 발명의 이상적인 실시예들을 개략적으로 도시하는 도면들을 참조하여 설명한다. 도면들에 있어서, 예를 들면, 제조 기술 및/또는 공차(tolerance)에 따라, 도시된 형상의 변형들이 예상될 수 있다. 따라서, 본 발명 사상의 실시예는 본 명세서에 도시된 영역의 특정 형상에 제한된 것으로 해석되어서는 아니 되며, 예를 들면 제조상 초래되는 형상의 변화를 포함하여야 한다. 도 1 및 도 2는 본 발명에 따른 용접 강도 예측 방법을 나타내는 순서도이고, 도 3은 본 발명의 일 실시예에 따 른 용접 강도 예측 장치를 나타내는 도면이고, 도 4 내지 도 7은 본 발명의 실시예에 따른 각각의 단계를 나타 내는 도면이다. 도 1에 도시된 바와 같이, 본 발명의 용접 강도 예측 방법은, 측정 단계(S10), 형상 도출 단계(S20), 파라미터 산출 단계(S30), 입력값 획득 단계(S40) 및 강도 예측 단계(S50)를 포함할 수 있다. 측정 단계(S10)는, 용접된 모재의 용접부위를 비전 센서를 통하여 용접부 표면을 측정하는 단계로, 예컨대, 용접된 모재의 용접부위를 비전 센서를 통하여 용접부 표면을 측정하는 측정부를 포함할 수 있다. 더욱 구체적으로, 도 1 및 도 4에 도시된 바와 같이 측정 단계(S10)는 모재에 용접을 진행한 후에, 상기 모재의 상기 용접부위를 측정부에 형성된 비전 센서로 측정할 수 있다. 이때, 상기 용접부위를 비전 센서로 측정하기 위하여 상기 용접부위를 비전 센서의 하부에서 비전 센서를 사용하여 상기 모재의 용접된 부분 의 상기 용접부 표면을 정확히 측정할 수 있다. 비전 센서는, 일반적으로 레이저 비전센서가 사용되는데, 상기 레이저 비전센서장치는 통상 레이저를 발사하 는 레이저조사장치(레이저 다이오드)와 조사된 레이저가 피용접물에 맺힌 상을 촬영하여 용접선을 감지하는 카 메라로 구성될 수 있으며, 상기 용접부 표면을 정확히 측정할 수 있다. 이와 같이, 비전 센서를 사용하여 용접부 표면의 측정만으로 용접부 형상을 예측할 수 있으며, 용접부 형상으로 각종 파라미터들을 산출할 수 있어 용접부위를 검사하는데 있어서 공정 시간 및 비용을 감소시킬 수 있다. 도 1, 도 3 및 도 5에 도시된 바와 같이, 형상 도출 단계(S20)는 측정된 상기 용접부 표면을 이용하여 용접부 형상을 도출하는 단계로, 측정된 상기 용접부 표면을 이용하여 용접부 형상을 도출하는 형상 도출부를 포함 할 수 있다. 상기 용접부 형상은 상기 모재의 상판의 일부분과 하판의 일부분이 용융되어 특정한 모양으로 형성될 수 있는데, 용접부의 강도를 산출하기 위해서는 이러한 상기 용접부 형상이 매우 중요한 요소로 작용한다. 형상 도출 단계(S20)는, 측정 단계(S20)에서 비전 센서로 측정된 상기 용접부 표면을 구체화하여, 측정된 상 기 용접부 표면으로 상기 모재의 상판 및 하판 사이의 용접부 형상을 도출 할 수 있다. 형상 도출 단계(S20)는, 측정 단계(S10)에서 비전 센서로 측정된 상기 용접부 표면을 인공신경망에 입력할 수 있다. 예컨대, 상기 용접부 표면의 데이터가 인공신경망에 입력되고, 상기 용접부 표면의 데이터가 인공신경 망이 학습했던 데이터와 가장 유사한 데이터를 출력하여, 상기 용접부 표면의 데이터와 비교한다. 이때, 데이터 유사도가 일정 수치 이상일 경우 해당 데이터를 출력하게 되고, 일정 수치 미만일 경우 다시 유사한 데이터를 찾는 작업을 반복하게 된다. 도 1, 도 3 및 도 6에 도시된 바와 같이 파라미터 산출 단계(S30)는, 상기 용접부 형상으로부터 상기 용접부위 의 파라미터를 산출하는 단계로, 상기 용접부 형상으로부터 상기 용접부위의 파라미터를 산출하는 파라미터 산 출부를 포함할 수 있다. 파라미터 산출 단계(S30)는, 형상 도출 단계(S20)에서 도출된 상기 용접부 형상에서 용접 강도를 산출하기 위한 수치들을 산출하는 것으로, 상기 모재의 상판 및 하판의 용융되어 접합된 용접부위의 수치를 산출할 수 있다. 상기 파라미터는, 상기 용접부위에서 용융부의 보강 덧붙임(L1), 용접비드 두께(L2), 실제 목두께(L3), 각장 (L4, L5), 용입 깊이(L6), 토우부 각도(θ1), 용접비드 각도(θ2), 각장 각도(θ3), 보강 덧붙임 면적(A1), 목면적(A2), 용입 면적(A3) 및 용접부 기공률(N24) 중 어느 하나 이상을 포함할 수 있다. 더욱 구체적으로 도 6에 도시된 바와 같이, 상기 파라미터는, 상기 용접부위의 단면에서, 상기 모재의 상판 및 하판이 용융되어 접합된 볼록한 형상인 볼록부의 두께를 나타내는 용융부의 보강 덧붙임(L1), 접합부의 두께를 나타내는 용접비드 두께(L2), 상판과 하판이 접합되어 형성되는 목의 두께를 나타내는 실제 목두 께(L3), 상판의 용융길이와 하판의 용융길이를 나타내는 각장(L4, L5), 하판의 용융된 깊이를 나타내 는 용입 깊이(L6), 용융되어 접합된 볼록한 형상의 외각을 나타내는 토우부 각도(θ1), 용접비드의 내각을 나타 내는 용접비드 각도(θ2), 상판의 용융된 각도를 나타내는 각장 각도(θ3), 보강 덧붙임(L1)의 단면적을 나 타내는 보강 덧붙임 면적(A1), 실제 목두께(L3)를 포함하는 목의 단면적을 나타내는 목 면적(A2), 하판의 용 융된 깊이의 단면적을 나타내는 용입 면적(A3) 및 상기 용접부 표면에서 측정된 용접부 기공률(N24)을 포함할 수 있다. 도 1 및 도 3에 도시된 바와 같이 입력값 획득 단계(S40)는, 상기 모재의 물리적 특성을 입력값으로 획득하는 단계로, 상기 모재의 물리적 특성을 입력값으로 획득하는 입력값 획득부를 포함할 수 있다. 입력값 획득 단계(S40)는, 상기 모재의 상판 및 하판의 물리적 특성을 입력할 수 있으며, 또는, 다수의 용접 데이터를 통하여 모재의 물리적 특성을 추출하여 가져올 수 있다. 상기 입력값은, 상기 모재의 상판 및 하판의 강도(N1, N5), 두께(N2, N6), 도금(N3, N7), 조직(N4, N8), 상판 언더컷(N21), 하판 언더컷(N22) 및 상판과 하판의 갭(gap)(N23) 중 어느 하나 이상을 포함할 수 있 다. 파라미터 산출 단계(S30)와 입력값 획득 단계(S40)는, 상기 모재의 상판 및 하판의 강도(N1, N5), 두께 (N2, N6), 도금(N3, N7), 조직(N4, N8), 용융부의 보강 덧붙임(L1), 용접비드 두께(L2), 실제 목두께(L3), 각 장(L4, L5), 용입 깊이(L6), 토우부 각도(θ1), 용접비드 각도(θ2), 각장 각도(θ3), 보강 덧붙임 면적(A1), 목 면적(A2), 용입 면적(A3), 상판 언더컷(N21), 하판 언더컷(N22), 상판과 하판의 갭(gap)(N23), 용접 부 기공률(N24)로 나타나는 24개의 노드값을 포함할 수 있다. 상기 노드값은 강도 예측 단계(S50)의 인공신경망에 입력되는 입력층에 포함될 수 있다. 도 1, 도 3 및 도 6에 도시된 바와 같이 강도 예측 단계(S50)는, 상기 파라미터 및 상기 입력값을 인공신경망에 입력하고, 상기 파라미터 및 상기 입력값에 대응되는 강도를 예측하는 단계로, 상기 파라미터 및 상기 입력값을 인공신경망에 입력하고, 상기 파라미터 및 상기 입력값에 대응되는 강도를 예측하는 강도 예측부를 포함할 수 있다. 예컨대, 상기 노드값이 인공신경망에 입력되고, 입력된 상기 노드값이 인공신경망이 학습했던 데이터와 가장 유 사한 데이터를 출력하여, 상기 노드값의 데이터와 비교한다. 이때, 데이터 유사도가 일정 수치 이상일 경우 해 당 데이터에 상응하는 강도값을 출력하게 되고, 일정 수치 미만일 경우 다시 유사한 데이터를 찾는 작업을 반복 하게 된다. 상기 인공신경망이 학습했던 데이터는, 미리 저장된 다수의 용접 데이터를 이용하여 학습될 수 있으며, 이때, 상기 미리 저장된 다수의 용접 데이터는 미리 실험에 의해 획득되어 저장된 기존의 용접 데이터일 수 있다. 인공신경망(Artificial neural network, ANN)은 인체의 신경 세포인 뉴런(neuron)을 모장한 가상의 신경 소자, 퍼셉트론(perceptron)을 망(network)으로 연결하여, 입력과 출력을 각춘 일종의 함수를 만든 것으로 퍼셉트론이 구성하는 복잡한 회로망을 통해 복잡한 비선형 현상을 비교적 간단하게 재현하거나 예측할 수 있다. 상기 인공신경망을 이용한 예측방법은 크게 학습단계와 생산단계로 나누어진다. 상기 학습단계에서는 일련의 입 출력 관계가 공급되고 이에 따라 상기 인공신경망에서 함수관계가 규명된다. 주어진 입력변수에서 출력변수가 계산된 후 실제 주어진 출력값과 오차에 따라 각각의 함수의 가중치가 학습 알고리즘에 의해 조절되며 학습이 계속된다. 오차가 허용범위 내에 들어오면 학습이 종료되고 상기 인공신경망은 현재의 입출력 사이의 함수관계 를 기억할 수 있다. 도 2 및 도 7에 도시된 바와 같이, 강도 예측 단계(S50)는 입력 단계(S51), 연산 단계(S52) 및 출력 단계(S53) 를 포함할 수 있다. 입력 단계(S51)는, 상기 파라미터 및 상기 입력값을 인공신경망에 입력하는 단계로, 상기 파라미터 및 상기 입 력값을 인공신경망에 입력하는 입력부를 포함할 수 있다.입력 단계(S51)는, 파라미터 산출 단계(S30)와 입력값 획득 단계(S40)에서 산출된 24개의 노드값을 상기 인공신 경망에 입력되는 단계이다. 연산 단계(S52)는, 각각 10개의 노드로 형성된 제 1 은닉층(S521) 및 제 2 은닉층(S522)을 통하여 상기 용접부 의 인장강도 및 피로강도를 연산하는 단계로, 제 1 은닉층(S521) 및 제 2 은닉층(S522)을 가지는 상기 인공신경 망을 통하여 상기 용접부의 인장강도 및 피로강도를 연산하는 연산부를 포함할 수 있다. 연산 단계(S52)는, 입력 단계(S51)에서 입력된 24개의 노드를 10개의 노드를 포함하는 제 1 은닉층(S521)을 통 하여 연산하여 1차 연산값을 산출하고, 상기 1차 연산값을 10개의 노드를 포함하는 제 2 은닉층(S522)을 통하여 2차 연산값을 산출할 수 있으며, 상기 2차 연산값은 1개의 노드로 추출될 수 있다. 출력 단계(S53)는, 상기 용접부의 인장강도 및 피로강도를 출력하는 단계로, 상기 용접부의 인장강도 및 피로강 도를 출력하는 출력부를 포함할 수 있다. 출력 단계(S53)는, 상기 2차 연산값으로 추출된 1개의 노드를 인장강도 또는 피로강도로 출력할 수 있다. 도 3에 도시된 바와 같이, 출력된 상기 인장강도 및 상기 피로강도를 사용자에게 표시할 수 있는 표시부를 더 포함할 수 있다. 도 8 및 도 9는 본 발명의 일 실시예에 따른 강도 예측 실험을 하기위한 노드값 및 실험예를 나타내는 도면이다. 상기 노드값은 24개로 1번 노드값부터 24번 노드값까지 상기 모재의 상판 및 하판의 강도(N1, N5), 두께 (N2, N6), 도금(N3, N7), 조직(N4, N8), 용융부의 보강 덧붙임(L1, N9), 용접비드 두께(L2, N10), 실제 목두께 (L3, N11), 상판의 각장(L4, N12), 하판의 각장(L5, N13), 용입 깊이(L6, N14), 토우부 각도(θ1, N15), 용접비드 각도(θ2, N16), 각장 각도(θ3, N17), 보강 덧붙임 면적(A1, N18), 목 면적(A2, N19), 용입 면적 (A3, N20), 상판 언더컷(N21), 하판 언더컷(N22), 상판과 하판의 갭(gap)(N23), 상판 언더컷(N21), 하판 언더컷(N22), 상판과 하판의 갭(gap)(N23), 용접부 기공률(N24)을 포함할 수 있다. 상기 노드값을 상기 인공신경망에 입력하여 인장강도와 용접강도를 예측할 수 있다. 도 10은 도 9의 실험예에 따라 용접 강도 예측 방법에 따른 인장강도 예측결과로서 예측인장강도와 실험인장강 도의 결과값을 나타낸 그래프이다. 실험소재로는 SGAFH 590FB 2.3 mm를 사용하였다. 실험은 겹치기 이음부 형상을 사용하였으며, 용접조건으로는 용접공정은 DC, CMT, 용접속도는 3, 5, 7, 9 m/min, 용접속도 60, 80 cm/mn, Gap 0, 0.1, 0.2, 0.5, 1.0 mm를 사용하였다. CTWD는 15 mm, 작업각은 45˚로 고정하였으며, 90% Ar + 10% CO2 혼합가스를 사용하였다. 평균오차는 19MPa로 약 4.0%로 나타나고, 결정계수(R2)는 0.8199로 나타나 비교적 예측인장강도와 실험인장강도 가 일치하는 직선형으로 나타나고 있다. 특히, 인장강도가 580MPa 내지 630MPa 사이에서 대부분의 예측인장강도와 실험인장강도가 일치한 것으로 나타나, 580MPa 내지 630MPa에서 예측률이 높은 것으로 나타난다. 도 11은 도 9의 실험예에 따른 피로 강도 예측 실험 결과를 나타내는 그래프이다. 본 발명의 일 실시예에 따른 용접 강도 예측 방법에 따른 피로강도 예측결과로서, 실험소재로는 SGAFH 590FB 2.3 mm를 사용하였다. 실험은 겹치기 이음부 형상을 사용하였으며, 용접조건으로는 용접공정은 CMT, 용접속도는 5 m/min, 용접속도 80 cm/min, Gap 0 mm를 사용하였다. CTWD는 15 mm, 작업각은 45˚로 고정하였으며, 90% Ar + 10% CO2 혼합가스를 사용하였으며, 부하하중에 따른 피로수명을 사이클로 나타내었다. 도 11에 도시된 바와 같이, 하중은 피로수명에 반비례하는 그래프로 나타나며, 실험으로 나타난 피로강도 그래 프와 예측으로 나타난 피로강도 그래프가 거의 일치하는 것으로 나타난다. 도 10의 그래프에서 하중이 31MPa, 47MPa, 62MPa, 92MPa, 122MPa, 183MPa, 244MPa, 305MPa, 366MPa에서 실험 피로수명과 예측 피로수명을 표로 비교하였다. 각각의 하중에서 상용로그치로 환산하여 그래프와 같이 나타내면, 각각 2.6%, 1.8%, 2.6%, 2.4%로 실험 피로수 명과 예측 피로수명의 오차는 2.6% 이하로 나타났다.실수치의 오차 평균은 13.3%로 나타나며 상용로그치의 오차 평균은 1.3%로 나타난다. 용접조건을 변경하여 실험한 결과 실험 피로수명과 예측 피로수명의 오차 평균은 [표 1]과 같이 나타났다. 실험에 사용된 소재는 SGAFH 590FB 2.3 mm 소재이며, 용접전원은 CMT, 와이어 송급속도는 5, 7, 9 m/min, Gap 0, 0.1, 0.2, 0.5, 용접속도는 60cm/min으로 용접하였다. CTWD 15mm, 용접작업각 45˚로 고정하였으며, 90% Ar + 10% CO2 혼합가스를 사용하였다. 표 1 CMT (m/min) Gap (mm) 실수치 오차 평균(%)상용로그치 오차 평균(%) 5 m/min 0.1 mm 6.4 0.7 5 m/min 0.2 mm 4.4 0.4 5 m/min 0.5 mm 4.7 0.4 5 m/min 1.0 mm 1.7 0.1 7 m/min 0.1 mm 5.7 0.5 7 m/min 0.2 mm 4.8 0.5 7 m/min 0.5 mm 7.8 0.8 7 m/min 1.0 mm 2.4 0.2 9 m/min 0 mm 8.2 0.7 9 m/min 0.1 mm 3.7 0.3 9 m/min 0.2 mm 2.1 0.1 9 m/min 0.5 mm 2.5 0.2 9 m/min 1.0 mm 1.7 0.2 상기 실험 결과값에서 나타난 바와 같이, Gap이 커질수록 실수치 오차의 평균이 현저히 낮아지고, 상용로그치 오차의 평균은 최저 0.2%로 매우 낮게 나타난다. 이와 같이 본 발명에 따른 용접 강도 방법 및 장치에 따르면, 강도를 예측하는 방법으로 인공신경망을 활용하여 용접부 표면을 측정하는 것으로 용접부 형상을 산출할 수 있으며, 산출된 용접부 형상의 각종 파라미터들을 사 용하여, 피용접재가 변경될 때마다 다수의 실험을 통해 결과를 확인하고 새로운 공정변수를 설정하는 반복이 필 요 없으며, 최소한의 입력 자료로 높은 예측 정확도를 가질 수 있어, 공정 시간 및 비용을 감소시키고 비용과 시간 대비 용접품질을 최대화할 수 있는 효과를 가진다. 이러한 효과에 의해 본 발명의 범위가 한정되는 것은 아니다."}
{"patent_id": "10-2017-0163611", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 당해 기술분야에서 통상 의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 다른 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2017-0163611", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 도 1의 용접 강도 예측 장치를 이용한 용접 강도 예측 방법을 나타내는 순서도이다. 도 2는 본 발명의 다른 실시예에 따른 용접 강도 예측 방법을 나타내는 순서도이다. 도 3은 본 발명의 일 실시예에 따른 용접 강도 예측 장치를 나타내는 도면이다. 도 4는 본 발명의 용접 강도 예측 방법에 따른 측정 단계를 나타내는 사시도이다. 도 5는 본 발명의 일 실시예에 따른 형상 도출 단계의 용접부 형상을 나타내는 도면이다. 도 6은 본 발명의 일 실시예에 따른 파라미터 산출 단계의 용접부의 파라미터를 나타내는 단면도이다. 도 7은 본 발명의 일 실시예에 따른 강도 예측 단계의 인공신경망의 연산을 나타내는 도면이다. 도 8은 본 발명의 일 실시예에 따른 강도 예측 실험을 하기위한 노드값을 나타내는 도면이다. 도 9는 본 발명의 일 실시예에 따른 인장 강도 예측 실험예를 나타내는 도면이다. 도 10은 본 발명의 일 실시예에 따른 인장 강도 예측 실험 결과를 나타내는 그래프이다. 도 11은 본 발명의 일 실시예에 따른 피로 강도 예측 실험 결과를 나타내는 그래프이다."}
