{"patent_id": "10-2023-0085470", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0005597", "출원번호": "10-2023-0085470", "발명의 명칭": "스마트 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템", "출원인": "주식회사 한국정보기술단", "발명자": "이우용"}}
{"patent_id": "10-2023-0085470", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "교차로를 통행하는 차량을 차량 촬영장치에서 촬영한 영상정보를 분석하고 신호등의 점등시간 정보를 신호등 제어기 측으로 전송하는 신호 주기 시스템에 있어서,상기 신호등 제어기 측으로 신호등의 점등시간 정보를 전송하는 신호 시간정보 전송부;교차로 통행 방향별로 차량의 통행시간을 산정하는 방향별 신호시간 산정부; 및차량 촬영장치에서 촬영한 영상정보를 분석하는 차량 분석부를 포함하고,상기 차량 분석부는,차량 촬영장치에서 촬영한 영상정보를 분석하여 차량으로 판별하는 차량 판별부; 및상기 차량 판별부에 의해 판별된 차량에 대해서, 차량의 크기에 따라 소형차량 및 대형차량으로 분류하는 차종분류부를 포함하는 것을 특징으로 하는 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템."}
{"patent_id": "10-2023-0085470", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 차량 분석부는,상기 차량 분류부에 의해서 분류된 차량들에 대해서, 교차로의 방향별로 통행한 차량 종류들의 수를 분석하여,방향별로 소형차량 및 대형차량의 비중을 분류하는 방향별 통행 차종 분석부; 및상기 방향별 통행 차종 분석부에 따라서 방향별로 소형차량 및 대형차량 중에서 상대적으로 많이 통행한 차량에따라 방향별로 통행 가중치를 산정하는 방향별 통행시간 가중치 연산부를 포함하는 것을 특징으로 하는 교차로통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템."}
{"patent_id": "10-2023-0085470", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 방향별 신호시간 산정부는,상기 방향별 통행시간 가중치 연산부에서 산정된 통행 가중치 정보를 전송받고 교차로 통행 방향별로 통행 가중치를 반영한 교차로 통행시간을 산정하는 것을 특징으로 하는 교차로 통행 차량 분석에 따라 차량별 통행 시간차별 신호주기 시스템."}
{"patent_id": "10-2023-0085470", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 방향별 통행시간 가중치 연산부에 의해서 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 하루 동안 시간별로, 또는 주간 요일별로 방향별 통행 가중치 정보를 학습하는 기간별 통행 가중 학습부를 포함하는 것을 특징으로 하는 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템."}
{"patent_id": "10-2023-0085470", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2025-0005597-3-제 4 항에 있어서,상기 기간별 통행 가중 학습부는,산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 하루 동안 시간별로 방향별 통행 가중치 정보를 학습하는 하루 시간별 통행 가중 학습부; 및 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 주간 요일별로 방향별 통행 가중치 정보를 학습하는요일별 통행 가중 학습부를 포함하는 것을 특징으로 하는 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별신호주기 시스템."}
{"patent_id": "10-2023-0085470", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "교차로에 설치된 차량 촬영장치를 통해 촬영된 영상정보를 신호 주기 시스템으로 전송하는 교차로 통행차량 촬영단계;차량 촬영장치에서 촬영한 영상정보를 바탕으로 하여, 차량 판별부에서 차량을 판별하는 차량 판별단계;상기 차량 판별단계에 의해 판별된 차량에 대해서, 차종 분류부에 의해서 차량의 크기에 따라 소형차량 및 대형차량으로 분류하는 차량 종류 분류단계;상기 차량 종류 분류단계에 의해서 분류된 차량들에 대해서, 방향별 통행 차종 분석부에 의해서 교차로의 방향별로 통행한 차량 종류들의 수를 분석하여, 방향별로 소형차량 및 대형차량의 비중을 분류하는 방향별 차량종류분석단계;상기 방향별 차량종류 분석단계에 따라서 방향별로 소형차량 및 대형차량 중에서 상대적으로 많이 통행한 차량에 따라 방향별로 통행 가중치를, 방향별 통행시간 가중치 연산부에서 산정하는 방향별 통행시간 가중치 연산단계;상기 방향별 통행시간 가중치 연산단계에서 산정된 통행 가중치 정보를 전송받은 방향별 신호시간 산정부에서교차로 통행 방향별로 통행 가중치를 반영한 교차로 통행시간을 산정하는 방향별 신호 시간 산정단계;상기 방향별 신호 시간 산정단계에서 산정된 방향별 교차로 통행시간 정보를 신호 시간정보 전송부에서 신호등제어기 측으로 전송하는 신호등 점등시간 정보 전송단계; 및교차로 방향별 차량의 통행시간 정보를 수신받은 신호등 제어기의 제어에 의하여 신호등이 점멸되도록 하는 신호등 제어단계;를 포함하는 것을 특징으로 하는 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템 제어방법."}
{"patent_id": "10-2023-0085470", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 방향별 통행시간 가중치 연산단계에 의해서 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 기간별 통행 가중 학습부에 의해서 하루 동안 시간별로, 또는 주간 요일별로 방향별 통행 가중치 정보를 학습하는기간별 통행 가중 학습단계를 포함하는 것을 특징으로 하는 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템 제어방법."}
{"patent_id": "10-2023-0085470", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 기간별 통행 가중 학습단계는,산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 하루 시간별 통행 가중 학습부에서 하루 동안 시간별로공개특허 10-2025-0005597-4-방향별 통행 가중치 정보를 학습하는 하루 시간별 통행 가중 학습단계; 및 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 요일별 통행 가중 학습부에서 주간 요일별로 방향별통행 가중치 정보를 학습하는 요일별 통행 가중 학습단계를 포함하는 것을 특징으로 하는 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템 제어방법."}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 교차로를 통행하는 차종별로 신호를 다르게 주는 신호주기 시스템에 관한 것으로, 보다 상세하게는 교 차로 통행 차종에 대해 인공지능 분석을 통해 차종별로 서로 다른 통행 시간으로 신호를 주는 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템에 관한 것이다."}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 교차로를 통행하는 차종별로 신호를 다르게 주는 신호주기 시스템에 관한 것으로, 보다 상세하게는 교차로 통행 차종에 대해 인공지능 분석을 통해 차종별로 서로 다른 통행 시간으로 신호를 주는 교차로 통행 차 량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템에 관한 것이다."}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 교차로는 여러 방향으로 차량들이 교차하여 통행하는 곳으로, 서로 다른 방향에서 진입하는 차들이 서로 뒤섞이지 않고 순차적으로 서로 시간을 나누어 지나는 것이다. 이러한 교차로 신호 체계에서는 출근시간이나 퇴근시간에 장시간 통행시간을 부여하여 충분히 많은 차량들이 통 행함으로써 주변 도로가 밀리지 않고 혼잡하지 않게 하는 것이다. 이처럼 교차로를 통행하는 차량들이 많은 경우에는 통행 시간을 길게 해서 신호를 주기 때문에 밀리지 않는 것 이다. 이에 차량들이 통행하는 여러 방향 중에는, 산업현장으로 이어지는 도로가 있고, 주택가나 상가들이 밀집된 방 향으로 이어지는 도로가 있을 것이다. 나아가 도심으로 향하거나 빌딩숲과 같이 사무 공간으로 이어지는 도로가 있을 것이다. 또한 다른 도시로 나아 가기 위해 외곽으로 이어지는 도로가 있는 등 다양한 도로들이 교차하여 교차로를 이루게 된다. 이러한 교차로는 결국 승용차나 대형 화물차량이 서로 원하는 목적지로 향하게 되지만, 커다란 화물차의 경우 신호 대기 중에 바로 출발하지 못해서 동일한 통행 시간 동안 몇 대 지나지 못하는 것이다. 그리하여 화물차가 밀집된 방향에서는 해당 도로가 많은 화물차들로 인해 밀려서 교통체증을 유발할 우려가 있 는 것이다. 따라서 이러한 문제점을 해소하기 위한 교차로 통행 신호체계의 제공이 절실히 요구되는 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허번호 제10-1889871호(2018년 09월 20일 공고) (특허문헌 0002) 등록특허번호 제10-2540323호(2023년 06월 07일 공고) (특허문헌 0003) 등록특허번호 제10-2531281호(2023년 05월 12일 공고)"}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해소하기 위한 안출된 것으로 본 발명의 목적은, 여러 방향에서 교차로를 통행 하는 차량의 종류별로 교차로 진입방향들을 구분하고, 해당 방향으로 통행하는 차종을 구분하여 차종에 따른 통행시간을 차이를 둠으로써 차종의 차이로 교차로가 밀리지 않도록 하는 것이다. 본 발명의 다른 목적은, 화물차, 버스 등 대형 차량은 출발하는 시간, 가속하는 시간 등이 상당히 소요되기 때 문에, 소형차량에 비하여 교차로 통행 시간을 충분히 줌으로써, 비교적 느린 대형 차량이 밀려 오더라도 한 번 에 많은 대형차량이 지날 수 있도록 하는 것이다. 본 발명의 또 다른 목적은, 대형 차량과 같이 출발이 느린 차량이 많은 수가 지날 수 있도록 하여 교차로 부근 이 혼잡하지 않도록 하는 것이다."}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명에 따른 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호 주기 시스템은, 교차로를 통행하는 차량을 차량 촬영장치에서 촬영한 영상정보를 분석하고 신호등의 점등시간 정보를 신호등 제어기 측으로 전송하는 신호 주기 시스템에 있어서, 상기 신호등 제어기 측으로 신호등의 점등 시간 정보를 전송하는 신호 시간정보 전송부; 교차로 통행 방향별로 차량의 통행시간을 산정하는 방향별 신호시 간 산정부; 및 차량 촬영장치에서 촬영한 영상정보를 분석하는 차량 분석부를 포함하고, 상기 차량 분석부는, 차량 촬영장치에서 촬영한 영상정보를 분석하여 차량으로 판별하는 차량 판별부; 및 상기 차량 판별부에 의해 판별된 차량에 대해서, 차량의 크기에 따라 소형차량 및 대형차량으로 분류하는 차종 분류부를 포함하는 것을 특징으로 한다. 또한, 상기 차량 분석부는, 상기 차량 분류부에 의해서 분류된 차량들에 대해서, 교차로의 방향별로 통행한 차 량 종류들의 수를 분석하여, 방향별로 소형차량 및 대형차량의 비중을 분류하는 방향별 통행 차종 분석부; 및 상기 방향별 통행 차종 분석부에 따라서 방향별로 소형차량 및 대형차량 중에서 상대적으로 많이 통행한 차량에 따라 방향별로 통행 가중치를 산정하는 방향별 통행시간 가중치 연산부를 포함하는 것을 특징으로 한다. 또한, 상기 방향별 신호시간 산정부는, 상기 방향별 통행시간 가중치 연산부에서 산정된 통행 가중치 정보를 전 송받고 교차로 통행 방향별로 통행 가중치를 반영한 교차로 통행시간을 산정하는 것을 특징으로 한다. 또한, 상기 방향별 통행시간 가중치 연산부에 의해서 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 하루 동안 시간별로, 또는 주간 요일별로 방향별 통행 가중치 정보를 학습하는 기간별 통행 가중 학습부를 포함 하는 것을 특징으로 한다. 또한, 상기 기간별 통행 가중 학습부는, 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 하루 동안 시 간별로 방향별 통행 가중치 정보를 학습하는 하루 시간별 통행 가중 학습부; 및 산정된 교차로 통행 방향별 통 행 가중치 정보에 대해서, 주간 요일별로 방향별 통행 가중치 정보를 학습하는 요일별 통행 가중 학습부를 포함 하는 것을 특징으로 한다. 또한, 본 발명에 따른 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템 제어방법은, 교차 로에 설치된 차량 촬영장치를 통해 촬영된 영상정보를 신호 주기 시스템으로 전송하는 교차로 통행차량 촬영단 계; 차량 촬영장치에서 촬영한 영상정보를 바탕으로 하여, 차량 판별부에서 차량을 판별하는 차량 판별단계; 상 기 차량 판별단계에 의해 판별된 차량에 대해서, 차종 분류부에 의해서 차량의 크기에 따라 소형차량 및 대형차 량으로 분류하는 차량 종류 분류단계; 상기 차량 종류 분류단계에 의해서 분류된 차량들에 대해서, 방향별 통행 차종 분석부에 의해서 교차로의 방향별로 통행한 차량 종류들의 수를 분석하여, 방향별로 소형차량 및 대형차량 의 비중을 분류하는 방향별 차량종류 분석단계; 상기 방향별 차량종류 분석단계에 따라서 방향별로 소형차량 및 대형차량 중에서 상대적으로 많이 통행한 차량에 따라 방향별로 통행 가중치를, 방향별 통행시간 가중치 연산부 에서 산정하는 방향별 통행시간 가중치 연산단계; 상기 방향별 통행시간 가중치 연산단계에서 산정된 통행 가중 치 정보를 전송받은 방향별 신호시간 산정부에서 교차로 통행 방향별로 통행 가중치를 반영한 교차로 통행시간 을 산정하는 방향별 신호 시간 산정단계; 상기 방향별 신호 시간 산정단계에서 산정된 방향별 교차로 통행시간 정보를 신호 시간정보 전송부에서 신호등 제어기 측으로 전송하는 신호등 점등시간 정보 전송단계; 및 교차로 방향별 차량의 통행시간 정보를 수신받은 신호등 제어기의 제어에 의하여 신호등이 점멸되도록 하는 신호등 제 어단계를 포함하는 것을 특징으로 한다. 또한, 상기 방향별 통행시간 가중치 연산단계에 의해서 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 기간별 통행 가중 학습부에 의해서 하루 동안 시간별로, 또는 주간 요일별로 방향별 통행 가중치 정보를 학습하 는 기간별 통행 가중 학습단계를 포함하는 것을 특징으로 한다.또한, 상기 기간별 통행 가중 학습단계는, 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 하루 시간별 통행 가중 학습부에서 하루 동안 시간별로 방향별 통행 가중치 정보를 학습하는 하루 시간별 통행 가중 학습단 계; 및 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 요일별 통행 가중 학습부에서 주간 요일별로 방향별 통행 가중치 정보를 학습하는 요일별 통행 가중 학습단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같이 구성되는 본 발명은 여러 방향에서 교차로를 통행하는 차량의 종류별로 교차로 진입방향들을 인공 지능 기술을 통하여 구분하고, 해당 방향으로 통행하는 차종을 구분하여 차종에 따른 통행시간을 차이를 둠으로 써 차종의 차이로 교차로가 밀리지 않도록 하는 효과가 있는 것이다. 본 발명의 다른 효과는, 화물차, 버스 등 대형 차량은 출발하는 시간, 가속하는 시간 등이 상당히 소요되기 때 문에, 소형차량에 비하여 교차로 통행 시간을 충분히 줌으로써, 비교적 느린 대형 차량이 밀려 오더라도 한 번 에 많은 대형차량이 지날 수 있도록 하는 것이다. 본 발명의 또 다른 효과는, 대형 차량과 같이 출발이 느린 차량이 많은 수가 지날 수 있도록 하여 교차로 부근 이 혼잡하지 않도록 하는 것이다. 본 발명의 또 다른 효과는, 인공지능 학습기술을 이용하는 것으로, 교차로를 지나는 차종별 구분에 대해서 하루 동안 시간별로 인공지능 학습을 수행하고, 주간 요일별로 인공지능 학습을 수행하여, 인공지능 학습된 사항으로 하여 교차로 통행시간에 대한 신호 시간을 예측하여 작동되게 하는 것이다."}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 그 기술적 사상 또는 주요한 특징으로부터 벗어남이 없이 다른 여러 가지 형태로 실시될 수 있다. 따 라서 본 발명의 실시예들은 모든 점에서 단순한 예시에 지나지 않으며 한정적으로 해석되어서는 안 된다. 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"구비하다\", \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다."}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있을 정도로 상 세히 설명하기 위하여, 본 발명의 가장 바람직한 실시예를 첨부된 도면을 참조로 하여 상세히 설명하기로 한다. 본 발명에 따른 교차로 통행 차량 분석에 따라 차량별 통행 시간 차별 신호주기 시스템 및 시스템 제어방법은 첨부된 도 1 내지 도 5 등에서와 같이, 교차로를 통행하는 차량을 차량 촬영장치에서 촬영한 영상정보를 분 석하고 신호등의 점등시간 정보를 신호등 제어기 측으로 전송하는 신호 주기 시스템에 관한 것이다. 이러한 교차로에는 신호등을 작동시키기 위한 신호등 제어기가 설치되며, 이러한 신호등을 확인하 여 대형 화물차, 대형 버스 등 화물차량이 지나고, 또한 승용차, 소형화물차 등의 승용차량이 통행하는 것 이다. 이와 같은 신호 주기 시스템은, 교차로에 설치된 차량 촬영장치에서 촬영한 영상정보를 전송받고, 이러 한 영상정보를 인공지능 분석 기술을 이용하여 분석하여 차량을 구분하며, 이러한 차량을 종류별로 구분하여 화 물차 등 대형 차량이 지날 때와 일방승용차량이 지날 때 등을 구분하는 것이다. 이렇게 차량별로 구분된 정보를 기초로 하여 대형차, 소형차 등에 따라 신호등의 신호 시간을 서로 다르게 제공할 수 있을 것이다. 이에 신호 주기 시스템은 상기 신호등 제어기 측으로 신호등의 점등시간 정보를 전송하는 신호 시 간정보 전송부를 포함하는 것이다. 그리하여 연산된 신호등의 통행시간 정보에 의해 신호등 제어기(1 1)가 작동되는 것이다. 그리고 신호 주기 시스템은 교차로 통행 방향별로 차량의 통행시간을 산정하는 방향별 신호시간 산정부(2 2)를 구비하는 것이다. 따라서 교차로를 통행하는 차량별로 신호 시간을 산정하는 것이다. 또한 신호 주기 시스템은 차량 촬영장치에서 촬영한 영상정보를 분석하는 차량 분석부를 포함하는 것이다. 아울러 이러한 차량별 통행 시간 차별 신호주기 시스템의 제어방법에 대해서도 함께 살펴보기로 한다. 우선 교차로에 설치된 차량 촬영장치를 통해 촬영된 영상정보를 신호 주기 시스템으로 전송하는 교차로 통행차량 촬영단계(S10)를 수행하는 것이다. 그리고 이러한 상기 차량 분석부의 상세 구성을 살펴보면, 차량 촬영장치에서 촬영한 영상정보를 분석 하여 차량으로 판별하는 차량 판별부가 마련된다. 이에 신호주기 시스템의 제어방법은, 차량 촬영장치에서 촬영한 영상정보를 바탕으로 하여, 차량 판별부 에서 차량을 판별하는 차량 판별단계(S20)를 수행하는 것이다. 즉 인공지능 기술을 이용하여 영상 중에서 차량으로 인식되는 물체 정보를 구분하여 차량의 요소인 바퀴, 차체 형태 등으로 차량으로 구분하게 된다.다음으로 상기 차량 분석부는, 상기 차량 판별부에 의해 판별된 차량에 대해서, 차량의 크기에 따라 소 형차량 및 대형차량으로 분류하는 차종 분류부를 포함하는 것이다. 이에 신호주기 시스템의 제어방법은, 상기 차량 판별단계(S20)에 의해 판별된 차량에 대해서, 차종 분류부 에 의해서 차량의 크기에 따라 소형차량 및 대형차량으로 분류하는 차량 종류 분류단계(S30)를 수행하는 것이다. 즉 차종 분류부에 의하여, 대형 버스, 대형 화물차, 트레일러 차량 등을 대형 차량으로 구분하는 것이다. 또한 승용차, 소형 화물차 등은 소형 차량으로 구분하게 된다. 다음으로 상기 차량 분석부는, 상기 차량 분류부에 의해서 분류된 차량들에 대해서, 교차로의 방향별로 통행한 차량 종류들의 수를 분석하여, 방향별로 소형차량 및 대형차량의 비중을 분류하는 방향별 통행 차종 분 석부를 포함하는 것이다. 이에 신호주기 시스템의 제어방법은, 상기 차량 종류 분류단계(S30)에 의해서 분류된 차량들에 대해서, 방향별 통행 차종 분석부에 의해서 교차로의 방향별로 통행한 차량 종류들의 수를 분석하여, 방향별로 소형차량 및 대형차량의 비중을 분류하는 방향별 차량종류 분석단계(S40)를 수행하는 것이다. 대체로 소형 차량으로 승용차량 등은 출발 속도가 빠르기 때문에 대체로 교차로를 통과하는 시간이 짧게 된다. 반면 대형 차량으로 대형 버스, 대형 화물차량, 트레일러 차량 등은 출발도 천천히 출발하면서도, 가속도 느리 기 때문에 결국 교차로를 통행하는 시간도 길게 된다. 따라서 방향별 통행 차종 분석부 및 방향별 차량종류 분석단계(S40) 등에 의한 차량의 통행 분류의 일 예를 살펴보면, 소형차량이나 대형차량 등이 서로 대략 40 ~ 60% 정도 포함되는 경우 균등 통행분류로 분류한다. 이 러한 균등 통행분류의 경우 소형차량과 대형차량이 서로 비슷한 수로 통행하는 것이다. 또한 소형차량이 대체로 60 ~ 80% 정도 포함되고, 반대로 대형 차량은 20 ~ 40 % 정도 포함되는 경우에는 소형 통행분류로 분류한다. 이러한 소형 통행분류의 경우 대부분이 소형차량이 통행하는 것이다. 이러한 소형 통행분 류의 경우, 통행하는 차량들이 소형차량으로, 대체로 시내나 주택단지 등으로 향하는 경우가 상당할 것으로 예 상된다. 나아가 소형차량이 대체로 10 ~ 40 % 정도 포함되고, 반대로 대형 차량은 60 ~ 90 % 정도 포함되는 경우에는, 대형 통행분류로 분류한다. 이러한 대형 통행분류의 경우 대부분이 대형 차량이 통행하는 것이다. 이러한 대형 통행분류의 경우 대형 버스, 대형 화물차량, 트레일러 차량 등이 주로 통행하는 것으로, 대형 버스의 경우 주변 에 버스 터미널이 있을 수 있고, 대형 화물차량이나 트레일러 차량 등이 많은 경우에는 공장지대나 물류 창고 등이 주변에 위치한 경으로 볼 수 있을 것이다. 다음으로 상기 차량 분석부는, 상기 방향별 통행 차종 분석부에 따라서 방향별로 소형차량 및 대형차량 중에서 상대적으로 많이 통행한 차량에 따라 방향별로 통행 가중치를 산정하는 방향별 통행시간 가중치 연산부 를 포함하는 것이다. 이에 신호주기 시스템 제어방법은, 상기 방향별 차량종류 분석단계(S40)에 따라서 방향별로 소형차량 및 대형차 량 중에서 상대적으로 많이 통행한 차량에 따라 방향별로 통행 가중치를, 방향별 통행시간 가중치 연산부에 서 산정하는 방향별 통행시간 가중치 연산단계(S50)를 수행하는 것이다. 이러한 방향별 통행시간 가중치 연산부 및 방향별 통행시간 가중치 연산단계(S50)에 의하면, 앞서 분류한 균등 통행분류, 소형 통행분류, 및 대형 통행분류 별로, 교차로 통행 방향별로 통행할 수 있는 시간의 가중치를 정하게 된다. 예를 들면 균등 통행분류의 경우 균등 통행 가중치를 \"3\"으로 산정하고, 소형 통행분류의 경우 소형 통행 가중 치를 \"2.5\"로 산정하며, 대형 통행분류의 경우 대형 통행 가중치를 \"5\"로 산정하도록 실시될 수 있을 것이다. 이에 이러한 가중치 값은 각 가중치를 산정하는데 있어서 일 실시예로 보인 것이며, 실시되는 상황이나 구성에 따라 알맞게 정하여져 실시될 수도 있을 것이다. 이상에서와 같이 실시되는 방향별 통행시간 가중치 연산부에 의한 가중치 산정에 따라서, 상기 방향별 신호 시간 산정부는, 상기 방향별 통행시간 가중치 연산부에서 산정된 통행 가중치 정보를 전송받고 교차로 통행 방향별로 통행 가중치를 반영한 교차로 통행시간을 산정하는 것이다. 이에 신호주기 시스템 제어방법은, 상기 방향별 통행시간 가중치 연산단계(S50)에서 산정된 통행 가중치 정보를 전송받은 방향별 신호시간 산정부에서 교차로 통행 방향별로 통행 가중치를 반영한 교차로 통행시간을 산정 하는 방향별 신호 시간 산정단계(S70)를 수행하는 것이다. 이러한 방향별 신호시간 산정부 및 방향별 신호 시간 산정단계(S70)에 의하여 소형차량 및 대형차량 등에 따라 차등된 가중치를 반영하여 통행시간을 산정하는 것이다. 이에 신호등 제어기에 의해 신호등이 점등되고 소등되는 시간을 기본적인 설정값으로 하여 작동시키는 것이다. 일 예로 차량의 기본 평균 통행 시간을 2분으로 부여된 경우, 이러한 기본 평균 통행 시간에 가중치를 반영한 시간을 더하거나 차감하여 통행 시간을 산정하게 된다. 이에 대한 일 실시 예시에 대해서 살펴보면, 소형차량과 대형 차량이 비슷한 비율로 있는 균등 통행 분류의 경 우인 균등 통행 시간은 기본 평균 통행 시간 2분에 1분을 더한 총 3분의 통행시간으로 산정될 수 있을 것이다. 또한 소형 차량이 많이 통과하는 소형 통행분류의 경우인 소형 통행시간은 기본 평균 통행 시간 2분에, 30초를 더 부가하여 총 2분30초의 통행시간으로 산정될 수 있을 것이다. 나아가 대형 차량이 많이 통과하는 대형 통행분류의 경우인 대형 통행시간은 기본 평균 통행시간 2분에, 3분을 더 부가하여, 총 5분의 통행시간으로 산정될 수도 있을 것이다. 이처럼 소형차량이나 대형차량 등에 따라 차량이 교차로로 통행하게 되는 신호등 점등 시간을 차등하여 산정하 게 된다. 다음으로 신호주기 시스템의 제어방법은, 상기 방향별 신호 시간 산정단계(S70)에서 산정된 방향별 교차로 통행 시간 정보를 신호 시간정보 전송부에서 신호등 제어기 측으로 전송하는 신호등 점등시간 정보 전송단계 (S80)를 수행하는 것이다. 그리고 교차로 방향별 차량의 통행시간 정보를 수신받은 신호등 제어기의 제어에 의하여 신호등이 점멸 되도록 하는 신호등 제어단계(S90)를 수행하는 것이다. 따라서 균등 통행시간, 소형 통행시간 및 대형 통행시간 등에 따라 반영되는 통행시간으로 하여 신호등이 점등되는 것이다. 다음으로 상기 방향별 통행시간 가중치 연산부에 의해서 산정된 교차로 통행 방향별 통행 가중치 정보에 대 해서, 하루 동안 시간별로, 또는 주간 요일별로 방향별 통행 가중치 정보를 학습하는 기간별 통행 가중 학습부 를 포함하는 것이다. 이에 신호주기 시스템의 제어방법은, 상기 방향별 통행시간 가중치 연산단계(S50)에 의해서 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 기간별 통행 가중 학습부에 의해서 하루 동안 시간별로, 또는 주간 요 일별로 방향별 통행 가중치 정보를 학습하는 기간별 통행 가중 학습단계(S60)를 수행하는 것이다. 즉 인공지능 학습 기술을 적용함으로써, 하루 중 시간별로 소형차량이나 화물차량이 상대적으로 많이 지나는 것 을 학습하는 것이며, 이러한 인공지능 학습 기능에 의하여 차량에 구별되어 지나는 통행 시간을 차등하여 제어 하게 되는 것이다. 이러한 상기 기간별 통행 가중 학습부는, 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 하루 동 안 시간별로 방향별 통행 가중치 정보를 학습하는 하루 시간별 통행 가중 학습부를 구비하는 것이다.이에 상기 기간별 통행 가중 학습단계(S60)는, 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 하루 시 간별 통행 가중 학습부에서 하루 동안 시간별로 방향별 통행 가중치 정보를 학습하는 하루 시간별 통행 가 중 학습단계(S61)를 수행하는 것이다. 즉 하루 중에서 시간별로 구분하여, 통행하는 방향마다 집중되어 지나는 차량이 소형차량이 많은지, 또는 대형 차량이 많은지 등의 여부를 살필 수 있는 것이다. 다음으로 상기 기간별 통행 가중 학습부는, 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 주간 요일별로 방향별 통행 가중치 정보를 학습하는 요일별 통행 가중 학습부를 포함하는 것이다. 이에 상기 기간별 통행 가중 학습단계(S60)는, 산정된 교차로 통행 방향별 통행 가중치 정보에 대해서, 요일별 통행 가중 학습부에서 주간 요일별로 방향별 통행 가중치 정보를 학습하는 요일별 통행 가중 학습단계(S6 2)를 수행하는 것이다. 즉 한주로 볼 때 각 요일별로 집중되어 지나는 차량들에 대한 인공지능 학습 기술을 적용한 것으로, 요일별로 학습된 내용을 반영하여 차등하여 신호등 점등의 시간을 부여하게 되는 것이다."}
{"patent_id": "10-2023-0085470", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상으로 본 발명의 실시예에 대하여 상세히 설명하였으나, 이는 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있도록 일실시예를 기재한 것이므로, 상기 실시예의 기재에 의하여 본 발명의 기술적 사상이 제한적으로 해석되어서는 아니 된다."}
{"patent_id": "10-2023-0085470", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 차량별 통행 시간 차별 신호주기 시스템을 설명하기 위한 교차로에 대한 예시 도면이다. 도 2는 본 발명에 따른 차량별 통행 시간 차별 신호주기 시스템에 대한 구성도이다. 도 3은 본 발명에 따른 차량별 통행 시간 차별 신호주기 시스템에 대한 구성도로, 기간별 통행 가중 학습부를 포함한 상세 구성도이다. 도 4는 본 발명에 따른 차량별 통행 시간 차별 신호주기 시스템 제어방법에 대한 순서도이다. 도 5는 본 발명에 따른 차량별 통행 시간 차별 신호주기 시스템 제어방법에 있어서 기간별 통행 가중 학습단계 에 대한 상세 순서도이다."}
