{"patent_id": "10-2018-0132415", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0049602", "출원번호": "10-2018-0132415", "발명의 명칭": "엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템 및 방법", "출원인": "(주)엠투엠테크", "발명자": "김진기"}}
{"patent_id": "10-2018-0132415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "엘리베이터를 구동 및 제어하는 것으로, 권상기, 로프 브레이크, 조속기, 제동기, 비상정지장치, 리미트 스위치류, 도어 인터록 장치, 카 도어 스위치, 문닫힘 장치, 카 완충기, 비상 통화 장치와 마이크 및 스피커를 포함하는 엘리베이터내 주요 장치에 연결되는 엘리베이터 시스템;상기 엘리베이터내 설치하여 온습도, 진동, 소음, 승차감을 포함하는 복수의 측정요소들을 측정 또는 분석하는센서부;승객이 있는 카 내, 홀 대기층에 설치되어 각종 운행정보 및 건물내 이용정보를 제공하는 디지털 사이니지부;상기 엘리베이터 시스템 및 상기 센서부와 상기 디지털 사이니지부와 독립적 또는 외부 시스템과 연결되는 것이며, IoT 표준 스텍을 기반으로 상기 엘리베이터에 대한 운행상태, 장애 및 고장 상황을 판단하고 분석하며, 부지중 안내 서비스로서 정보 표출과 콜 및 경고, 그리고 디지털 포렌식 기능의 운행 로그를 관리하는 지능형 IoT장치부;상기 엘리베이터와 연결되는 사물 인터넷 기반 부지중 자율 안내 시스템으로, 상기 지능형 IoT 장치와 네트워크로 연결되어 상기 엘리베이터에 대한 실시간 모니터링 및 진단과 제어를 통해 고장 예측을 위한 진단 제어를 수행하는 클라우드 서버; 및,상기 클라우드 서버와 연결되어 사용자에게 다양한 엘리베이터 스마트 서비스를 제공하는 모바일 기기; 를 포함하는 것을 특징으로 하는 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템."}
{"patent_id": "10-2018-0132415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 지능성 IoT 장치부는,상기 엘리베이터 시스템와 독립적으로 연결되어 물리적인 인터페이스를 처리하는 인터페이스 처리기;상기 인터페이스 처리기의 브리지 맵을 처리하는 맵 처리기;상기 센서부와 독립적으로 연결되며, 상기 센서부의 모니터링 신호를 처리하는 센서 처리기;상기 맵 처리기 및 상기 센서 처리기를 통해 처리되는 신호를 통해 IoT 스택 기반 상기 엘리베이터 제조사의 독립적인 표준 리소스를 제어하고 로그를 관리하는 리소스 제어 관리기;상기 리소스 제어 관리기의 관리 정보에 따라 상기 엘리베이터내 비상 상황을 분석하는 분석기;상기 분석기의 분석을 통해 부지중에 승객 갇힘이나 브레이크 고장과 같이 승객 안전과 관련한 중대한 고장 발생시, 상기 엘리베이터 시스템과 상기 클라우드 서버간 통신을 통해 엘리베이터내 비상 통화 장치를 작동시키는작동제어기; 및,상기 작동 제어기에 의해 비상 통화 장치가 작동시 경고메시지를 생성하고 이를 상기 클라우드 서버로 송신하는한편, 상기 클라우드 서버의 원격제어신호를 수신하여 상기 엘리베이터 시스템에 전송하는 메세지 송수신 처리기; 를 포함하는 것을 특징으로 하는 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템."}
{"patent_id": "10-2018-0132415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 지능형 IoT 장치부에는,상기 지능형 IoT 장치부에 의해 처리되는 엘리베이터에 대한 모든 운행 데이터는 위변조가 불가능하도록 데이터무결성을 유지하면서 고장과 문제 발생시 원인 분석이 가능하게 하는 디지털 포렌식 처리기; 더 포함하는 것을공개특허 10-2019-0049602-3-특징으로 하는 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템."}
{"patent_id": "10-2018-0132415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 디지털 포렌식 처리기는,엘리베이터의 운행 상태 정보 및 안전 정보를 포함하는 엘리베이터 정보를 수신하고 제어요청 정보를 송신하는I/O 처리기; 상기 I/O 처리기로부터 엘리베이터 정보에 관한 진단 데이터를 수신받아 포렌식적으로 의미있는 데이터를 수집 및 분석하고 이를 상기 지능성 IoT 장치부로 전송하는 분석 제어기; 및 상기 분석 제어기에 의해분석된 분석 정보가 저장되는 메모리; 를 포함하는 것을 특징으로 하는 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템."}
{"patent_id": "10-2018-0132415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 메세지 송수신 처리기는, 비상 상황에 대한 현황 정보 제공과 설명 및 조치 사항에 대한 안내 음성과 영상을 엘리베이터 이용자의 모바일 단말이나 디지털 사이니지 또는 SMS 메시지로 전송하거나 또는 상기 클라우드서버 및 이에 등록되는 구조 유관 센터에 동시에 전송하도록 구성하는 것을 특징으로 하는 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템."}
{"patent_id": "10-2018-0132415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "(a) 엘리베이터의 운행 상태를 실시간으로 모니터링하는 단계;(b) 상기 (a)단계의 모니터링으로부터 엘리베이터내 주요 안전장치와 구동장치를 진단하고, 승객 갇힘이나 브레이크 고장과 같이 승객 안전과 관련한 중대한 장애, 고장 발생 여부를 판단하는 단계;(c) 상기 (b)단계의 진단 및 판단결과 엘리베이터의 안전장치와 구동장치에 대한 고장 또는 탑승객 갇힘 상황을자율 인지하는 단계;(d) 상기 (c)단계의 자율 인지로부터 탑승객 갇힘상황시 엘리베이터 이용자로부터 직접 요청받은 비상통화장치호출 서비스, 또는 잠재사용자 엘리베이터 호출 등을 포함하여 이를 인지하고 종합 판단하는 단계;(e) 상기 (d)단계의 종합판단으로부터 고장 발생이 예상시에는 관리자에게 유지 보수를 통보하고, 탑승객 갇힘상황시에는 이를 전파하면서 탑승객 안정을 위한 안내정보를 제공하는 단계; 및,(f) 상기 (e)단계의 안내서비스 제공 이후 구조 유관기관으로 통보하여 탑승객 구출이 이루어지도록 하는 단계;를 포함하는 것을 특징으로 하는 엘리베이터 사물 인터넷 기반 부지중 자율 안내 방법."}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템 및 방법을 개시한다. 이러한 본 발명은 엘리베 이터 시스템과 지능형 IoT 장치부 및 클라우드 서버 간에 상호 유기적으로 작동하도록 구성한 것이며, 이에 따라 정상인 뿐만아니라 인지 능력이 현저히 떨어지는 엘리베이터 탑승객들에게도 보다 안전하고 편리한 서비스를 제 (뒷면에 계속)"}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 승객이나 차량 또는 화물을 운반하기 위해 수직, 수평으로 움직이는 엘리베이터의 안전과 유지 관리 를 위한 엘리베이터 지능형 IoT 장치에 관한 것으로, 보다 상세하게는 로컬 현장에서 운행 중인 엘리베이터의 상태 정보를 실시간으로 수신하고 분석, 저장하여 클라우드 운영 센터로 상황을 관련 기관(예; 관리 사무실, 엘 리베이터 제조사/유지보수회사, 119상황실, 경찰서 등의 유관기관)에 전파하고, 이용자(예; 탑승객, 잠재 사용 자)에게 카내 방송, 디지털 사이니지, 모바일기기 등을 통하여 상황에 맞는 스마트 서비스를 제공하며, 특히 시 스템 고장, 장애 또는 사고 발생 시 일반 탑승객뿐 아니라 장애인, 노약자, 임산부, 유아를 위하여 비상통화장 치를 누르지 않아도 시스템이 상황을 인지하고 판단하여 안전과 관련 상황 설명 및 대처를 위한 안내 서비스를 제공하는 한편, 현장과 연결된 IoT 실시간 빅데이터 분석, 인공지능(AI) 기능을 제공하는 클라우드 센터 및 외 부 시스템(external system)과 연계하여 이용 고객의 엘리베이터 생활 안전과 엘리베이터 수명 주기 동안 유지 관리를 위한 사전 예방적 유지관리시스템(Proactive maintenance system)을 제공하는 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 엘리베이터 운행과 관련한 제어 시스템은 다양한 건물에서 탑승객들에게 보다 나은 서비스를 계속 추구하는 것으로, 상기 제어 시스템은 일반 승객 외에도 다양한 형태의 사용자 즉, 장애인, 영유아, 임산부, 노 인 등 인지 능력이 현저히 떨어지는 이들에게도 잠재적인 안전과 직결된 위험에 능동적이고 자율적인 시스템에 의하여 서비스가 실질적으로 도움되도록 제공되어야 할 필요가 있다. 그러나, 종래의 엘리베이터의 제어 시스템은 첨부된 도 1에서와 같이, 로컬 현장 단위 운영으로 서비스가 제한 되고, 노약자나 임산부 또는 유아 탑승객들에 대한 서비스 접근이 제한되며, 예상하지 못한 사고 발생 대처의 어려움이 있음은 물론, 고장이나 장애 발생시 관리자(엔지니어)의 즉각적인 처리 대응이 곤란한 문제점이 있었 다. 즉, 종래의 엘리베이터 제어 시스템은 현장에 설치되어 독립적으로 운영되므로, 엘리베이터의 운용 상태를 알기 어려웠고, 이에따라 종래에는 관리자가 지속적으로 방문하여 관리할 수 밖에 없었으며, 이에따라 종래의 엘리베 이터 시스템은 아래와 같은 문제점들에 대하여 실시간 대응이 어렵다는 것이다. 첫째, 카와 복도층간 레벨링 오차로 인해 일반인은 물론 노약자, 임산부 어린이들이 사고에 노출되는 우려가 있 다. 둘째, 카 도어와 복도 도어의 결함으로 인한 오작동 또는 열리고 닫히는 시간 문제로 탑승객이 위험에 빠질 수 도 있다. 셋째, 엘리베이터 제어 시스템의 오작동으로 인한 과속 이슈로 인해 사고 위험성이 높다. 넷째, 정전이나 갇힘 사고 등 중대 사고 발생으로 샤프트 안으로 빠지는 등 위험 상황이 발생할 수 있다. 다섯째, 적절한 시점에 수리와 점검이 이루지지 않을 경우 오작동이 발생하여 사고로 이어지는 경우가 많다. 한편, 종래에는 한 건물내에 다양한 제조사/벤더의 엘리베이터가 설치되는 관계로 그 유지 관리의 어려움이 있 었다. 즉, 제조사마다 각각 다른 고유의 인터페이스 프로토콜로 통합적인 모니터링과 진단 제어가 어려웠던 것이다. 또한, 종래에는 엘리베이터에 대한 고장이나 장애 상태를 실시간 모니터링에 상당한 어려움이 있음은 물론, 엘 리베이터 유지 관리 부품의 실시간 재고 관리 어려움으로 고객 수요에 실시간으로 대응하기 어렵고, 위치 정보 에 기반으로한 엔지니어의 즉각적인 응답, 그리고 공급망관리(SCM), 창고 관리 등 전체 물류 체계와 연계한 체 계적이고 세분화된 관리의 어려움이 있었다. 이에, 상기와 같은 문제점들로 인해, 엘리베이터의 가동 중단 시간을 최소화하고, 결함을 줄일수 있는 세부적인 정보의 관리 필요성, 끊김 없는 서비스 제공을 위한 엘리베이터 시스템과 사용자를 연결할 수 있는 안전하고 지 능적으로 연결할 수 있는 게이트웨이 디바이스 필요성, 4차 산업 혁명으로 대변되는 ICBMA(Internet, Cloud, Bigdata, Mobile, Artificial Intelligent) 등 최신 기술을 적용한 서비스 필요성, 엘리베이터의 잠재적인 고 장이나 장애에 대비한 예측 시스템의 필요성, 일반 엘리베이터 이용자에게 모바일, 디지털 사이니지 등을 통한 다양하고 편리한 서비스 요구의 증대 필요성 등이 대두되고 있는 실정이다. 선행기술문헌 등록특허공보 제10-1600288호(공고일 2016.03.07.)"}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 기존 엘리베이터 시스템(Machine room, Hoistway, Hall, Pit내에 있는 각종 기계, 전자제어 안전장치로 구성)과 지능형 IoT 장치 및 클라우드 서버 간에 상호 유기적으로 작동하도록 구성 한 것이고, 이를 통해 정상인 뿐만아니라 인지 능력이 현저히 떨어지는 엘리베이터 탑승객들에게도 보다 안전하 고 편리한 서비스를 제공받을 수 있도록 하는 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템 및 방법을 제공하려는 것이다. 본 발명이 해결하고자 하는 다른 과제는, 사물과 사물, 사물과 모바일, 모바일과 사람의 유기적인 연계를 통해, 엘리베이터의 운행중 사고 발생시 그 사고 발생 상황에 대한 설명과 대처 요령을 방송 또는 모바일 기기를 통해탑승객에게 안내하는 한편, 등록된 원격지에 사고 발생 상황을 전달하면서 탑승객 구출과 같은 비상 대응 체계 가 신속하게 가동될 수 있도록 하면서, 안전 사고에 대한 자율적인 대응이 가능하도록 하고, 탑승객의 안전과 엘리베이터에 대한 유지 관리의 예지 보전을 가능한 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템 및 방법을 제공하려는 것이다."}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 과제 해결 수단인 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템은, 엘리베이터를 구동 및 제어하는 것으로, 권상기, 로프 브레이크, 조속기, 제동기, 비상정지장치, 리미트 스위치류, 도어 인터록 장치, 카 도어 스위치, 문닫힘 장치, 카 완충기, 비상 통화 장치와 마이크 및 스피커를 포함하는 엘리베이터내 주요 장치에 연결되는 엘리베이터 시스템; 상기 엘리베이터내 설치하여 온습도, 진동, 소음, 승차감을 포함하는 복수 의 측정요소들을 측정 또는 분석하는 센서부; 승객이 있는 카 내, 홀 대기층에 설치되어 각종 운행정보 및 건물 내 이용정보를 제공하는 디지털 사이니지부; 상기 엘리베이터 시스템 및 상기 센서부와 상기 디지털 사이니지부 와 독립적 또는 외부 시스템과 연결되는 것이며, IoT 표준 스텍을 기반으로 상기 엘리베이터에 대한 운행상태, 장애 및 고장 상황을 판단하고 분석하며, 부지중 안내 서비스(예; 정보 표출, 콜 및 경고)와 디지털 포렌식 기 능의 운행 로그를 관리하는 지능형 IoT 장치부; 상기 엘리베이터와 연결되는 사물 인터넷 기반 부지중 자율 안 내 시스템으로, 상기 지능형 IoT 장치부와 네트워크로 연결되어 상기 엘리베이터에 대한 실시간 모니터링 및 진 단과 제어를 통해 고장 예측을 위한 진단 제어를 수행하는 클라우드 서버; 및, 상기 클라우드 서버와 연결되어 사용자에게 다양한 엘리베이터 스마트 서비스를 제공하는 모바일 기기; 를 포함하는 것이다. 또한, 상기 지능형 IoT 장치부는, 상기 엘리베이터 시스템와 독립적으로 연결되어 물리적인 인터페이스를 처리 하는 인터페이스 처리기; 상기 인터페이스 처리기의 브리지 맵을 처리하는 맵 처리기; 상기 센서부와 독립적으 로 연결되며, 상기 센서부의 모니터링 신호를 처리하는 센서 처리기; 상기 맵 처리기 및 상기 센서 처리기를 통 해 처리되는 신호를 통해 IoT 스택 기반 상기 엘리베이터 제조사의 독립적인 표준 리소스를 제어하고 로그를 관 리하는 리소스 제어 관리기; 상기 리소스 제어 관리기의 관리 정보에 따라 상기 엘리베이터내 비상 상황을 분석 하는 분석기; 상기 분석기의 분석을 통해 부지중에 승객 갇힘이나 브레이크 고장과 같이 승객 안전과 관련한 중 대한 고장 발생시, 상기 엘리베이터 시스템과 상기 클라우드 서버간 통신을 통해 엘리베이터내 비상 통화 장치 를 작동시키는 작동제어기; 및, 상기 작동 제어기에 의해 비상 통화 장치가 작동시 경고메시지를 생성하고 이를 상기 클라우드 서버로 송신하는 한편, 상기 클라우드 서버의 원격제어신호를 수신하여 상기 엘리베이터 시스템 에 전송하는 메세지 송수신 처리기; 를 포함하는 것이다. 또한, 상기 지능형 IoT 장치부에는 상기 지능형 IoT 장치부에 의해 처리되는 엘리베이터에 대한 모든 운행 데이 터는 위변조가 불가능하도록 데이터 무결성을 유지하면서 고장과 문제 발생시 원인 분석이 가능하게 하는 디지 털 포렌식 처리기; 를 더 포함하는 것이다. 또한, 상기 디지털 포렌식 처리기는, 엘리베이터의 운행 상태 정보 및 안전 정보를 포함하는 엘리베이터 정보를 수신하고 제어 요청 정보를 송신하는 I/O 처리기; 상기 I/O 처리기로부터 엘리베이터 정보에 관한 진단 데이터 를 수신받아 포렌식적으로 의미있는 데이터를 수집 및 분석하고 이를 상기 지능성 IoT 장치부로 전송하는 분석 제어기; 및 상기 분석 제어기에 의해 분석된 분석 정보가 저장되는 메모리; 를 포함하는 것이다. 또한, 상기 메세지 송수신 처리기는, 비상 상황에 대한 현황 정보 제공과 설명 및 조치 사항에 대한 안내 음성 과 영상을 엘리베이터 이용자의 모바일 단말이나 디지털 사이니지 또는 SMS 메시지로 전송하거나 또는 상기 클 라우드 서버 및 이에 등록되는 구조 유관 센터에 동시에 전송하도록 구성되는 것이다. 다른 일면에 따라, 엘리베이터 사물 인터넷 기반 부지중 자율 안내 방법은, (a) 엘리베이터의 운행 상태를 실시 간으로 모니터링하는 단계; (b) 상기 (a)단계의 모니터링으로부터 엘리베이터내 주요 안전장치와 구동장치를 진 단하고, 승객 갇힘이나 브레이크 고장과 같이 승객 안전과 관련한 중대한 장애, 고장 발생 여부를 판단하는 단 계; (c) 상기 (b)단계의 진단 및 판단결과 엘리베이터의 안전장치와 구동장치에 대한 고장 또는 탑승객 갇힘 상 황을 자율 인지하는 단계; (d) 상기 (c)단계의 자율 인지로부터 탑승객 갇힘상황시 엘리베이터 이용자로부터 직 접 요청받은 비상통화장치 호출 서비스, 또는 잠재사용자 엘리베이터 호출 등을 포함하여 이를 인지하고 종합 판단하는 단계; (e) 상기 (d)단계의 종합판단으로부터 고장 발생이 예상시에는 관리자에게 유지 보수를 통보하 고, 탑승객 갇힘 상황시에는 이를 전파하면서 탑승객 안정을 위한 안내정보를 제공하는 단계; 및, (f) 상기 (e)단계의 안내서비스 제공 이후 구조 유관기관으로 통보하여 탑승객 구출이 이루어지도록 하는 단계; 를 포함 하는 것이다."}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이, 본 발명은 엘리베이터를 이용하는 승객 중 정상인 뿐만아니라 인지 능력이 현저히 떨어지는 엘리베 이터 탑승객들에게도 보다 안전하고 편리한 서비스를 제공하며, 특히 중대 위험상황에서 부지중 안내 서비스를 통하여 안전하고 편리한 생활을 도모할 수 있는 것으로서 다음과 같은 효과를 기대할 수 있는 것이다. 일반인 뿐만아니라 장애인, 노약자, 임산부, 유아 등을 위한 사전예방 관리 체계 구축이 가능하여 안전한 이용 이 가능, 이용자가 인지도 하기전에 사전에 장애나 고장에 대응이 가능한 사전예방적 유지 관리 체계로 제조사 는 물론, 유지 관리 업체의 사전점검서비스를 가능하게 하여 엘리베이터를 안전하게 관리하고 유지가 가능하고, 이용자에게 모바일 등을 통한 다양하고 편리한 맞춤형 자율 안내 서비스 제공 가능하며, 사물 인터넷(IoT) 기반 의 지능형 스마트 디바이스를 통한 엘리베이터 안전 관리 체계 마련되고, 제조사/벤더 독립적인 엘리베이터 안 전 관리에 대한 감시 및 진단 처리가 가능하며, 엘리베이터 안전 사고에 대한 근원적이고 사전 예방적인 관리 체계의 기반핵심 기술 확보로 시민들의 생활 안전에 기여하고, 엘리베이터 부품별 안전 요건 필수 정보 공유로 엘리베이터 안전에 대한 정량적인 관리 체계 정립할 수 있음은 물론, 유지 관리 업체의 관리 기준 활용으로 높 은 품질 수준으로 시스템 유지 관리 기반 마련하는 효과를 기대할 수 있는 것이다. 더불어, 대기업 뿐만아니라 열악한 중소 엘리베이터 유지 보수 관리업체에 툴을 제공하고, 엘리베이터 유지 관 리 기술자들에게 스마트 워크 환경 제공으로 대 고객 신뢰도 증가시킬 수 있음은 물론, 엘리베이터 내구연한 향 상으로 년간 LCC(Life cycle cost, 생애주기관리비용) 비용 절감하고, 노후 엘리베이터에 대한 안전 진단 및 위 험 관리의 효율적인 대응이 가능한 효과를 기대할 수 있는 것이다."}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시예를 설명하기로 한다. 도 2는 본 발명의 실시예로 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템에 대한 전체적인 개념도이고, 도 3은 본 발명의 실시예로 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템에 대한 블럭 구 성도이며, 도 4는 본 발명의 실시예로 지능성 IoT 장치부에 대한 상세 블럭도를 보인 것이다. 첨부된 도 2 내지 도 4를 참조하면, 본 발명의 실시예에 따른 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템은, 엘리베이터 시스템, 센서부, 디지털 사이니지부, 지능형 IoT 장치부, 클라우드 서버 , 모바일 기기를 포함할 수 있는 것이다. 상기 엘리베이터 시스템은 엘리베이터내 주요 장치인 권상기, 로프 브레이크, 조속기, 제동기, 비상정 지장치, 리미트 스위치류, 도어 인터록 장치, 카 도어 스위치, 문닫힘 장치, 카 완충기, 비상 통화 장치와 마이 크 및 스피커 등과 연결되는 것으로서, 상기 엘리베이터를 구동 및 제어하는 것이며, 도면에는 도시하지 않았지만 엘리베이터내 비상 통화 장치와 마이크 및 스피커와 연결될 수 있는 것이다. 상기 센서부는 상기 엘리베이터내 설치하여 온습도, 진동, 소음, 승차감을 측정 또는 분석하도록 구성 한 것이다. 상기 디지털 사이니지부는 승객이 있는 카 내, 홀 대기층에 설치되어 각종 운행 정보 및 건물내 이용정보를 제공하도록 구성한 것이다. 상기 지능형 IoT 장치부는 상기 엘리베이터 시스템 및 상기 센서부와 상기 디지털 사이니지부 와 독립적 또는 외부 시스템과 연결되는 것으로, 이는 IoT 표준 스텍을 기반으로 상기 엘리베이터에 대한 운행 상태, 장애 및 고장 상황을 판단하고 분석하며, 부지중 안내 서비스로서 정보 표출이나 콜 및 경고 등은 물론 디지털 포렌식 기능의 운행 로그를 관리하도록 구성한 것이며, 인터페이스 처리기, 맵 처리기, 센서 처 리기, 리소스 제어 관리기, 분석기, 작동 제어기, 메세지 송수신 처리기, 디지털 포렌식 처리기를 포함할 수 있는 것이다. 상기 인터페이스 처리기는 상기 엘리베이터 시스템과 독립적으로 연결되어 물리적인 인터페이스를 처리 하는 것이고, 상기 맵 처리기는 상기 인터페이스 처리기의 브리지 맵을 처리하도록 구성한 것이다. 즉, 상기 맵 처리기는 상기 인터페이스 처리기와 연결되는 다양한 제조사의 엘리베이터 시스템과 연결하는 인터페이스 경로를 제공하는 것이다. 상기 센서 처리기는 상기 센서부와 독립적으로 연결되는 것으로, 상기 센서부의 모니터링 신호를 처리하도록 구성한 것이다. 상기 리소스 제어 관리기는 상기 맵 처리기 및 상기 센서 처리기를 통해 처리되는 신호를 통해 IoT 스택 기반 상기 엘리베이터 제조사의 독립적인 표준 리소스를 제어하고 디지털 포렌식 기능을 포함한 로그를 관 리하도록 구성한 것이다. 상기 분석기는 상기 리소스 제어 관리기의 관리 정보에 따라 상기 엘리베이터내 비상 상황을 분석 하도록 구성한 것이다. 상기 작동 제어기는 상기 분석기의 분석을 통해 부지중에 승객 갇힘이나 브레이크 고장과 같이 승객 안 전과 관련한 중대한 고장 발생시, 상기 엘리베이터 시스템과 상기 클라우드 서버간 통신을 통해 엘리베 이터내 비상 통화 장치를 작동시키도록 구성한 것이다. 상기 메세지 송수신 처리기는 상기 작동 제어기에 의해 비상 통화 장치가 작동시 경고메시지를 생성하 고 이를 상기 클라우드 서버로 송신하는 한편, 상기 클라우드 서버의 원격제어신호를 수신하여 상기 엘 리베이터 시스템에 전송하는 것으로, 이는 비상 상황에 대한 현황 정보 제공과 설명 및 조치 사항에 대한 안내 음성과 영상을 엘리베이터내 탑승객의 모바일 단말이나 디지털 사이니지 또는 SMS 메시지로 전송하거 나 또는 상기 클라우드 서버 및 이에 등록되는 구조 유관 센터(예; 엘리베이터 유지 관리 전문 엔지니어, 관리 사무실, 119 구조 대원, 경찰서 등)에 동시에 전송하도록 구성될 수 있는 것이다. 상기 디지털 포렌식 처리기는 상기 지능형 IoT 장치부에 의해 처리되는 엘리베이터에 대한 모든 운행 데이터는 위변조가 불가능하도록 데이터 무결성을 유지하면서 고장과 문제 발생시 원인 분석이 가능하게 하는 것으로, 이는 I/O 처리기(38a), 분석 제어기(38b), 메모리(38c)를 포함할 수 있는 것이다. 상기 I/O 처리기(38a)는 엘리베이터의 운행 상태 정보 및 안전 정보를 포함하는 엘리베이터 정보를 수신하고 제 어 요청 정보를 송신하도록 구성한 것이다. 상기 분석 제어기(38b)는 상기 I/O 처리기(38a)로부터 엘리베이터 정보에 관한 진단 데이터를 수신받아 포렌식 적으로 의미있는 데이터를 수집 및 분석하고 이를 상기 지능성 IoT 장치부로 전송하도록 구성한 것이다. 상기 메모리(38c)는 상기 분석 제어기(38b)에 의해 분석된 분석 정보를 저장하도록 구성한 것이다. 상기 클라우드 서버는 상기 엘리베이터와 연결되는 사물 인터넷 기반 부지중 자율 안내 시스템으로서, 상기 지능형 IoT 장치부와 네트워크로 연결되어 상기 엘리베이터에 대한 실시간 모니터링을 통해 고장 예측을 위한 진단 제어를 수행하도록 구성한 것이고, 상기 클라우드 서버에는 상기 구조 유관 센터내 시스템과 연동될 수 있는 것이다. 상기 모바일 기기는 상기 클라우드 서버 또는 상기 지능형 IoT 장치부와 네트워크로 연결되어 사용 자(예; 일반사용자 및 유지관리 엔지니어 등)에게 편리한 서비스를 제공할 수 있을 것이다. 이와 같이, 본 발명의 실시예에 따른 엘리베이터 사물 인터넷 기반 부지중 자율 안내 기술은 첨부된 도 2 내지 도 8에서와 같이, 우선 지능형 IoT 장치부는 엘리베이터 시스템과 센서부로부터 모니터링 신호를 수신한 후 이를 클라우드 서버에 전송함으로써, 상기 클라우드 서버는 엘리베이터의 운행 상태를 모니터링하게 된다. 즉, 상기 지능형 IoT 장치부는 인터페이스 처리기를 통해 엘리베이터의 시스템 및 센서부와 독 립적으로 연결되어 있으므로, IoT 표준 스텍을 기반으로 상기 엘리베이터에 대한 비상 상황을 판단하고 분 석하며, 부지중 콜 및 경고와 운행 로그를 관리하게 된다. 이때, 지능형 IoT 장치부에 포함되는 맵 처리기는 상기 인터페이스 처리기의 브리지 맵을 처리한 후 이를 리소스 제어 관리기에 제공하고, 상기 지능형 IoT 장치부에 포함되는 센서 처리기는 상기 센서부의 모니터링 신호를 처리한 후 이를 상기 리소스 제어 관리기에 제공하게 된다. 그러면, 상기 리소스 제어 관리기는 상기 맵 처리기 및 상기 센서 처리기를 통해 처리되는 신호를 통해 IoT 스택 기반 상기 엘리베이터 제조사의 독립적인 표준 리소스를 제어하고 로그를 관리하는 한편, 그 관 리 정보를 분석기에 제공하게 됨으로써, 상기 분석기는 상기 리소스 제어 관리기의 관리 정보에 따 라 상기 엘리베이터내 비상 상황을 분석한 후 그 분석결과에 따라 작동 제어기를 작동시키게 된다. 이때, 상기 작동 제어기는 상기 분석기에 의해 이루어지는 진단 및 판단결과에 따라 상기 엘리베이터 의 안전장치와 구동장치에 대한 고장 또는 탑승객 갇힘 상황을 자율 인지하게 되면서 엘리베이터내 비상 통화 장치를 작동시키고, 더불어 메세지 송수신 처리기는 상기 작동 제어기에 의해 비상 통화 장 치가 작동시 경고메시지를 생성하고 이를 상기 클라우드 서버로 송신하는 한편, 상기 클라우드 서버의 원격제어신호를 수신하여 상기 엘리베이터 시스템에 전송하게 됨으로써, 비상 상황에 대한 현황 정보 제공 과 설명 및 조치 사항에 대한 안내 음성과 영상을 엘리베이터내 탑승객의 모바일 단말이나 디지털 사이니 지 또는 SMS 메시지로 전송 또는 상기 클라우드 서버 및 이에 등록되는 구조 유관 센터(예; 엘리베이터 유 지 관리 전문 엔지니어 단말, 관리 사무실, 119 구조 대원, 경찰서 등)에 동시에 전송할 수 있는 것이다. 따라서, 상기 구조 유관 센터는 엘리베이터내에 갇힌 탑승객들의 구조를 신속하게 요청할 수 있는 것 이다. 한편, 상기 클라우드 서버는 상기 지능성 IoT 장치부를 통해 진단의 모니터링 신호를 전송받게 되므로, 상기와 같인 진단 신호에 따라 엘리베이터에 대한 상태 분석과 부품 수명을 예측할 수 있는 것으로, 이는 시간 중심(TBM; Time Based Monitoring) 방식이 아닌 상태 중심(CBM; Condition Based Monitoring) 방식으로서, 사 용 연한에 따라 부품을 교체하는 것이 아닌 엘리베이터 운행 데이터, 승차감, 출입문 상태 등 이상 여부를 분석 하여 그 교체 시기를 판단함으로써 관리자에 의한 엘리베이터 정밀 보수를 가능하게 하는 것이다. 이와 같이, 본 발명의 실시예에 따른 엘리베이터 사물 인터넷 기반 부지중 자율 안내 기술은, 엘리베이터내 승 객들에게 부지중에 사물과 사물, 사물과 모바일, 모바일과 사람을 연계시킨 것으로, 이를 통해 일반인 뿐만아니 라 장애인, 유아, 임신부 및 노약자 등 인지 능력이 떨어지거나 즉각적인 상황 대처가 어려운 탑승객에게 엘리 베이터 내에서 갇힘사고 등이 발생하였을 때, 엘리베이터 내의 탑승객에게 시스템 상황 설명과 대처 요령에 대 한 방송하거나, 또는 탑승객들의 모바일기기에 안내 메세지를 전송하는 한편, 엘리베이터 유지 관리 전문 엔지 니어, 관리 사무실, 119 구조대원, 경찰서 등에게 동시에 탑승객 갇힘 상황을 신속하게 전달함으로써, 승객 구 출과 같은 비상대응체계가 신속하게 이루어질 수 있도록 하는 등 안전 사고에 자율적으로 대응 가능하고, 승객 의 안전과 유지 관리의 예지 보전이 가능하게 되는 것이다. 한편, 상기의 설명에서 설명하는 엘리베이터는 사람이 탑승하는 엘리베이터로 한정하여 설명하였지만, 밴딩머신, 스카다(SCADA), 에너지 발전설비, 스마트홈 등 다양한 산업분야에도 그 적용이 가능한 것이다. 이상에서 본 발명의 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템 및 방법에 대한 기술사상을 첨부도 면과 함께 서술하였지만, 이는 본 발명의 가장 바람직한 실시예를 예시적으로 설명한 것이지 본 발명을 한정하 는 것은 아니다. 따라서, 본 발명은 상술한 특정의 실시예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어"}
{"patent_id": "10-2018-0132415", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "남이 없이 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형 실시가 가능한 것은 물론이고, 그와같은 변경은 청구범위 기재의 범위내에 있게 된다. 부호의 설명10; 엘리베이터 시스템 20; 센서부 30; 지능형 IoT 장치부 31; 인터페이스 처리기 32; 맵 처리기 33; 센서 처리기 34; 리소스 제어 관리기 35; 분석기 36; 작동 제어기 37; 메세지 송수신 처리기 38; 디지털 포렌식 처리기 38a; I/O 처리기 38b; 분석 제어기 38c; 메모리 40; 클라우드 서버 50; 구조 유관 센터 60; 디지털 사이니지부 70; 모바일 기기 100; 엘리베이터"}
{"patent_id": "10-2018-0132415", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 비상상황시 엘리베이터 관리 흐름도. 도 2는 본 발명의 실시예로 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템에 대한 전체적인 개념도. 도 3은 본 발명의 실시예로 엘리베이터 사물 인터넷 기반 부지중 자율 안내 시스템에 대한 블럭 구성도. 도 4는 본 발명의 실시예로 지능형 IoT 장치부에 대한 상세 블럭도. 도 5는 본 발명의 실시예로 지능형 IoT 장치부의 데이터 처리 흐름도. 도 6은 본 발명의 실시예로 클라우드 서버에서의 엘리베이터 원격 제어를 위한 운영 화면도. 도 7은 본 발명의 실시예로 엘리베이터 사물 인터넷 기반 부지중 자율 안내 장치의 신호 처리 흐름도. 도 8은 본 발명의 실시예로 고장 발생시 엘리베이터 사물 인터넷 기반 부지중 자율 안내 방법을 보인 흐름도."}
