{"patent_id": "10-2023-0049543", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0153495", "출원번호": "10-2023-0049543", "발명의 명칭": "골프코스 제작장치, 가상 골프 장치 및 가상 골프 시스템", "출원인": "(주)에스지엠", "발명자": "이의범"}}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자가 가상 골프 장치에서 플레이할 때에 이용할 수 있는 골프코스의 제작에 필요한 정보를 저장하는 골프코스 정보 저장부;상기 골프코스 정보 저장부에 저장되어 있는 정보를 이용하여 사용자가 골프코스를 제작할 수 있도록 하는 골프코스 제작부; 및사용자가 제작중인 골프코스 및/또는 제작한 골프코스에 대한 플레이 난이도를 평가하는 골프코스 평가부를;포함하며,상기 골프코스 정보 저장부에 저장되어 있는 정보는 골프코스를 구성하는 복수의 구성요소에 대한 정보를 포함하고, 사용자는 상기 복수의 구성요소 중 적어도 일부를 이용하여 새로운 골프코스를 제작할 수 있는 골프코스 제작장치."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 골프코스 평가부에서 평가한 플레이 난이도는 사용자에게 제공되고,사용자가 제작중인 골프코스의 플레이 난이도를 조정할 수 있도록 사용자에게 골프코스의 제작에 관한 어드바이스를 제공할 수 있는 골프코스 제작 어드바이스서를 더 포함하는 골프코스 제작장치."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 골프코스 정보 저장부에 저장되어 있는 정보는 복수의 기존 골프장의 골프코스에 대한 정보를 더포함하고, 사용자는 서로 다른 상기 복수의 기존 골프장에 속하는 서로 다른 골프코스를 선택하여 상기 선택된골프코스로 구성되는 새로운 골프장을 제작할 수 있는 골프코스 제작장치."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,사용자에게 제작 레벨을 부여하고 또한 상기 사용자 제작 레벨에 따라 사용자가 제작하는 골프코스에 대해서 플레이 난이도의 상한값을 설정하는 골프코스 제작 매니저를 더 포함하는 골프코스 제작장치."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 사용자 제작 레벨은 사용자가 상기 가상 골프 장치에서 플레이했을 때의 기록, 사용자의 골프코스 제작 경력, 사용자가 과거에 제작한 골프코스에 대해 다른 사용자가 이용한 횟수 및 사용자가 과거에 제작한 골프코스에 대한 다른 사용자의 평가 중 적어도 어느 하나에 기초하여 부여되는 골프코스 제작장치."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "사용자가 플레이하는 가상의 골프코스를 표시하는 표시부; 사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에서 상기 실제골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출과정을 수행하는 산출부; 상기 가상의 골프코스로서 사용될 수 있는 골프코스의 제작에 필요한 정보를 저장하는 골프코스 정보 저장부;공개특허 10-2024-0153495-3-및상기 골프코스 정보 저장부에 저장되어 있는 정보를 이용하여 사용자가 골프코스를 제작할 수 있도록 하는 골프코스 제작부를;포함하고,상기 골프코스 정보 저장부에 저장되어 있는 정보는 골프코스를 구성하는 복수의 구성요소에 대한 정보를 포함하고, 사용자는 상기 복수의 구성요소 중 적어도 일부를 이용하여 새로운 골프코스를 제작할 수 있는 가상 골프 장치."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "서비스 장치; 및상기 서비스 장치와 통신상으로 연결되는 적어도 하나 이상의 가상 골프 장치를; 포함하고,상기 가상 골프 장치는, 사용자가 플레이하는 가상의 골프코스를 표시하는 표시부 및 사용자가 실제 골프공을타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에서 상기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출과정을 수행하는 산출부를 포함하고,상기 서비스 장치는 상기 가상의 골프코스로서 사용될 수 있는 골프코스의 제작에 필요한 정보를 저장하는 골프코스 정보 저장부를 포함하며,상기 골프코스 정보 저장부에 저장되어 있는 정보를 이용하여 사용자가 골프코스를 제작할 수 있도록 하는 골프코스 제작부가 상기 가상 골프 장치 또는 상기 서비스 장치에 구비되며,상기 골프코스 정보 저장부에 저장되어 있는 정보는 골프코스를 구성하는 복수의 구성요소에 대한 정보를 포함하고, 사용자는 상기 복수의 구성요소 중 적어도 일부를 이용하여 새로운 골프코스를 제작할 수 있는 가상 골프 시스템."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 서비스 장치 또는 상기 가상 골프 장치는 사용자가 제작중인 골프코스 및/또는 제작한 골프코스에 대한 플레이 난이도를 평가하는 골프코스 평가부를 더 포함하는 가상 골프 시스템."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 서비스 장치 또는 상기 가상 골프 장치는, 사용자에게 제작 레벨을 부여하고 또한 상기 사용자 제작 레벨에 따라 사용자가 제작하는 골프코스에 대해서 플레이 난이도의 상한값을 설정하는 골프코스 제작 매니저를 더포함하는 가상 골프 시스템."}
{"patent_id": "10-2023-0049543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 사용자 제작 레벨은 사용자가 상기 가상 골프 장치에서 플레이했을 때의 기록, 사용자의 골프코스 제작 경력, 사용자가 과거에 제작한 골프코스에 대해 다른 사용자가 이용한 횟수 및 사용자가 과거에 제작한 골프코스에 대한 다른 사용자의 평가 중 적어도 어느 하나에 기초하여 부여되는 가상 골프 시스템."}
{"patent_id": "10-2023-0049543", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 골프코스 제작장치, 가상 골프 장치 및 가상 골프 시스템을 제공한다. 상기 골프코스 제작장치는 사용 자가 가상 골프 장치에서 플레이할 때에 이용할 수 있는 골프코스의 제작에 필요한 정보를 저장하는 골프코스 정 보 저장부, 상기 골프코스 정보 저장부에 저장되어 있는 정보를 이용하여 사용자가 골프코스를 제작할 수 있도록 하는 골프코스 제작부, 및 사용자가 제작중인 골프코스 및/또는 제작한 골프코스에 대한 플레이 난이도를 평가하 는 골프코스 평가부를 포함하며, 상기 골프코스 정보 저장부에 저장되어 있는 정보는 골프코스를 구성하는 복수 의 구성요소에 대한 정보를 포함하고, 사용자는 상기 복수의 구성요소 중 적어도 일부를 이용하여 새로운 골프코 스를 제작할 수 있다."}
{"patent_id": "10-2023-0049543", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자가 스스로 골프코스를 제작할 수 있는 골프코스 제작장치, 사용자가 제작한 골프코스를 이용할 수 있는 가상 골프 장치 및 가상 골프 시스템에 관한 것이다."}
{"patent_id": "10-2023-0049543", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 골프를 즐기는 인구가 꾸준히 증가하고 있다. 골프는 실외 골프장에서의 골프뿐만 아니라, 가상 골프 장치 등을 이용하여 실내에서 골프를 플레이 할 수 있는 스크린 골프의 인기도 높아지고 있다. 스크린 골프에서는 스 크린을 통하여 골프장의 영상이 표시되기 때문에 마치 야외에서 실제의 골프 경기를 하고 있는 듯한 리얼리티를 체감할 수 있다. 또한 야외의 골프장에서 경기하는 것에 비해 시간과 비용이 세이브되기 때문에, 스크린 골프는 시간이나 경제적인 이유 등으로 필드에서 골프를 플레이하기 어려운 바쁜 현대인들에게 인기가 높다. 스크린 골프에 있어서 사용자가 플레이하는 골프장은 주로 실제의 골프장을 모델로 하여 이를 컴퓨터 그래픽으 로 재현하여 만들어진다. 하지만 실제의 골프장의 수가 한정되어 있기 때문에 플레이 횟수가 증가할수록 동일한 골프장에서의 반복 플레이로 골프 플레이에 대한 흥미가 떨어질 수 있다. 스크린 골프는 밀폐된 실내 공간에서 서비스되는 특성상 오픈된 야외 공간에서 이루어지는 실제 골프에서 제공하기 어려운 기술적 서비스를 사용자에 게 제공할 수 있는 장점이 있으며, 이를 활용하여 사용자가 다양한 골프장에서 플레이할 수 있도록 함으로써 골 프 플레이에 대한 사용자의 흥미를 고취시킬 필요가 있다."}
{"patent_id": "10-2023-0049543", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 사정을 감안하여 발명된 것으로, 사용자가 스스로 골프코스를 제작할 수 있는 골프코스 제작 장치를 제공하는 것을 목적으로 한다. 또한 본 발명은 사용자가 제작한 골프코스를 이용할 수 있는 가상 골프 장치를 제공하는 것을 목적으로 한다. 또한 본 발명은 사용자가 제작한 골프코스를 이용할 수 있는 가상 골프 시스템을 제공하는 것을 목적으로 한다. 또한 본 발명의 다른 목적들은 이하의 설명과 첨부한 도면으로부터 명확하게 이해될 수 있다."}
{"patent_id": "10-2023-0049543", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 실시예에 따른 골프코스 제작장치는 사용자가 가상 골프 장치에서 플레 이할 때에 이용할 수 있는 골프코스의 제작에 필요한 정보를 저장하는 골프코스 정보 저장부, 상기 골프코스 정 보 저장부에 저장되어 있는 정보를 이용하여 사용자가 골프코스를 제작할 수 있도록 하는 골프코스 제작부, 및 사용자가 제작중인 골프코스 및/또는 제작한 골프코스에 대한 플레이 난이도를 평가하는 골프코스 평가부를 포 함하며, 상기 골프코스 정보 저장부에 저장되어 있는 정보는 골프코스를 구성하는 복수의 구성요소에 대한 정보 를 포함하고, 사용자는 상기 복수의 구성요소 중 적어도 일부를 이용하여 새로운 골프코스를 제작할 수 있다. 상기 골프코스 제작장치에 있어서 상기 골프코스 평가부에서 평가한 플레이 난이도는 사용자에게 제공되고, 또 한 상기 골프코스 제작장치는 사용자가 제작중인 골프코스의 플레이 난이도를 조정할 수 있도록 사용자에게 골 프코스의 제작에 관한 어드바이스를 제공할 수 있는 골프코스 제작 어드바이스서를 더 포함할 수 있다. 상기 골프코스 제작장치에 있어서, 상기 골프코스 정보 저장부에 저장되어 있는 정보는 복수의 기존 골프장의 골프코스에 대한 정보를 더 포함하고, 사용자는 서로 다른 상기 복수의 기존 골프장에 속하는 서로 다른 골프코 스를 선택하여 상기 선택된 골프코스로 구성되는 새로운 골프장을 제작할 수 있다. 상기 골프코스 제작장치는 사용자에게 제작 레벨을 부여하고 또한 상기 사용자 제작 레벨에 따라 사용자가 제작 하는 골프코스에 대해서 플레이 난이도의 상한값을 설정하는 골프코스 제작 매니저를 더 포함할 수 있다. 상기 골프코스 제작장치에 있어서, 상기 사용자 제작 레벨은 사용자가 상기 가상 골프 장치에서 플레이했을 때 의 기록, 사용자의 골프코스 제작 경력, 사용자가 과거에 제작한 골프코스에 대해 다른 사용자가 이용한 횟수 및 사용자가 과거에 제작한 골프코스에 대한 다른 사용자의 평가 중 적어도 어느 하나에 기초하여 부여될 수 있 다. 본 발명의 실시예에 따른 가상 골프 장치는 사용자가 플레이하는 가상의 골프코스를 표시하는 표시부, 사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스에서 상기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출과정을 수행하는 산출부, 상기 가상의 골프코스로서 사용될 수 있는 골프코스의 제작에 필요한 정보를 저장하는 골프코스 정보 저장부, 및 상기 골프코스 정보 저장부에 저장되어 있는 정보를 이용하여 사용자가 골프코스를 제작할 수 있도록 하는 골프코스 제작부를 포함하고, 상기 골프코스 정보 저장부에 저장되어 있는 정보는 골프코스를 구성하는 복수의 구성요소에 대한 정보를 포함하고, 사용자는 상기 복수의 구성요소 중 적어도 일부를 이용하여 새로운 골프코스를 제작할 수 있다. 본 발명의 실시예에 따른 가상 골프 시스템은 서비스 장치 및 상기 서비스 장치와 통신상으로 연결되는 적어도 하나 이상의 가상 골프 장치를 포함한다. 상기 가상 골프 장치는, 사용자가 플레이하는 가상의 골프코스를 표시 하는 표시부 및 사용자가 실제 골프공을 타격하면 타격된 실제 골프공의 상태에 근거하여 상기 가상의 골프코스 에서 상기 실제 골프공에 대응하는 가상의 골프공의 움직임을 산출하는 산출과정을 수행하는 산출부를 포함하고, 상기 서비스 장치는 상기 가상의 골프코스로서 사용될 수 있는 골프코스의 제작에 필요한 정보를 저 장하는 골프코스 정보 저장부를 포함한다. 또한 상기 골프코스 정보 저장부에 저장되어 있는 정보를 이용하여 사용자가 골프코스를 제작할 수 있도록 하는 골프코스 제작부가 상기 가상 골프 장치 또는 상기 서비스 장치에 구비되며, 상기 골프코스 정보 저장부에 저장되어 있는 정보는 골프코스를 구성하는 복수의 구성요소에 대한 정 보를 포함하고, 사용자는 상기 복수의 구성요소 중 적어도 일부를 이용하여 새로운 골프코스를 제작할 수 있다. 상기 가상 골프 시스템에 있어서, 상기 서비스 장치 또는 상기 가상 골프 장치는 사용자가 제작중인 골프코스 및/또는 제작한 골프코스에 대한 플레이 난이도를 평가하는 골프코스 평가부를 더 포함할 수 있다. 상기 가상 골프 시스템에 있어서, 상기 서비스 장치 또는 상기 가상 골프 장치는, 사용자에게 제작 레벨을 부여 하고 또한 상기 사용자 제작 레벨에 따라 사용자가 제작하는 골프코스에 대해서 플레이 난이도의 상한값을 설정 하는 골프코스 제작 매니저를 더 포함할 수 있다. 상기 가상 골프 시스템에 있어서, 상기 사용자 제작 레벨은 사용자가 상기 가상 골프 장치에서 플레이했을 때의 기록, 사용자의 골프코스 제작 경력, 사용자가 과거에 제작한 골프코스에 대해 다른 사용자가 이용한 횟수 및 사용자가 과거에 제작한 골프코스에 대한 다른 사용자의 평가 중 적어도 어느 하나에 기초하여 부여될 수 있다."}
{"patent_id": "10-2023-0049543", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사용자가 스스로 다양한 골프코스를 제작하고 플레이에 이용할 수 있어서, 다양한 골프장에 서의 플레이를 즐길 수 있고 또한 골프 플레이에 대한 사용자의 흥미를 고취시킬 수 있다."}
{"patent_id": "10-2023-0049543", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예들을 통하여 본 발명을 상세하게 설명한다. 본 발명의 목적, 특징, 장점은 이하의 실시예들을 통해 쉽게 이해될 것이다. 본 발명은 여기서 설명되는 실시예들에 한정되지 않고, 다른 형태로 구체화될 수도 있다. 여기서 소개되는 실시예들은 개시된 내용이 철저하고 완전해질 수 있도록 그리고 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 따라서, 이하의 실시예들에 의하여 본 발명이 제한되어서는 안 된다. 본 명세서에서 제1, 제2 등의 용어가 다양한 요소들(elements)을 기술하기 위해서 사용되었지만, 상기 요소들이 이 같은 용어들에 의해서 한정되어서는 안 된다. 이러한 용어들은 단지 상기 요소들을 서로 구별시키기 위해서 사용되었을 뿐이다. 또, 어떤 요소가 다른 요소 위에 있다고 언급되는 경우에 그것은 다른 요소 위에 직접 형성 될 수 있거나 또는 그들 사이에 제3의 요소가 개재될 수도 있다는 것을 의미한다. 도면들에서 요소의 크기, 또는 요소들 사이의 상대적인 크기는 본 발명에 대한 더욱 명확한 이해를 위해서 다소 과장되게 도시될 수 있다. 또, 도면들에 도시된 요소의 형상이 제조 공정상의 변이 등에 의해서 다소 변경될 수 있을 것이다. 따라서, 본 명세서에서 개시된 실시예들은 특별한 언급이 없는 한 도면에 도시된 형상으로 한정되 어서는 안 되며, 어느 정도의 변형을 포함하는 것으로 이해되어야 한다. 도 1은 본 발명의 실시예에 따른 골프코스 제작장치의 개략적인 구성을 나타내는 도면이고, 도 2는 골프코스 정 보 저장부의 상세구조를 예시적으로 나타내는 도면이며, 도 3 및 도 4는 골프코스 제작부에 있어서 골프코스를 제작하기 위한 사용자 인터페이스 화면을 예시적으로 나타내는 도면이고, 도 5는 골프코스 평가부에서 인공지능 을 이용하여 골프코스를 평가하는 방법을 설명하기 위한 도면이며, 도 6은 골프코스 평가부에서 골프코스 평가 에 사용될 수 있는 판단자료를 설명하기 위한 도면이다. 도 1을 참조하면, 골프코스 제작장치는 골프코스 정보 저장부, 골프코스 제작부, 골프코스 평가부를 포함한다. 골프코스 제작장치는 스크린 골프 등과 같은 가상 골프 플레이에서 이용할 수 있는 골프코스를 사용 자가 직접 제작할 수 있도록 하는 장치이며, 골프코스 정보 저장부는 골프코스 제작에 필요한 각종 정보를 저장한다. 골프코스 제작부는 골프코스 정보 저장부에 저장되어 있는 정보를 이용하여 사용자가 골프코스 를 제작할 수 있도록 하며, 구체적으로는 골프코스 제작 프로그램과 등과 같은 제작 툴을 포함하거나 또는 상기 제작 툴에 포함되어 있을 수 있다. 골프코스 평가부는 사용자가 제작중인 골프코스 및/또는 사용자가 제작을 완료한 골프코스에 대한 플레이 난이도를 평가한다. 도 2를 참조하면, 골프코스 정보 저장부는 복수의 정보를 종류별로 구분하여 다양한 저장영역에 저장하고 있 고, 또한 골프코스 정보 저장부는 골프장에 대한 정보를 저장하는 영역(1a)과 골프코스를 구성하는 구성요소 에 대한 정보를 저장하는 영역(1b)을 포함할 수 있다. 골프장 정보를 저장하는 영역(1a)에는 복수의 골프장에 대한 정보가 저장되어 있다. 예를 들면, 골프장 정보를 저장하는 영역(1a)에는 골프장 A, 골프장 B 등과 같이 복수의 서로 다른 골프장이 골프장별로 구분되어 저장되어 있고, 골프장 A, B가 각각 복수의 홀(골프코스)로 구 성되어 있다고 하면 골프장 A, B의 저장영역 각각에는 각 골프장을 구성하는 복수의 홀에 정보가 저장되어 있을 수 있다. 상기 골프장 A, B 등은 실제로 존재하는 골프장을 모델로 하여 컴퓨터 그래픽으로 재현한 골프장이거 나 또는 실제로 존재하는 골프장이 아니고 임의로 창작된 골프장일 수 있다. 골프코스 구성요소에 대한 정보를 저장하는 영역(1b)에는 페어웨이, 러프, 벙커, 그린영역, 워터해저드, 골프장의 나무, 잔디 등과 같이 골프코스 를 구성하는 여러가지 구성요소들에 정보가 저장되어 있다. 상기 구성요소들은 종류별로 구분되어 저장되어 있 다. 예를 들어 페어웨이, 벙커, 나무 등과 같은 구성요소가 있다고 하면, 이들은 각각 서로 다른 저장영역에 저 장되어 있고, 페어웨이/벙커/나무 저장영역에는 각각 여러가지 형상과 특징을 갖는 페어웨이들/벙커들/나무들이 저장되어 있을 수 있다. 상기 페어웨이/벙커/나무 등의 저장영역에 저장되어 있는 구성요소들은 실제로 존재하 는 골프장에 있는 것을 모델로 하여 컴퓨터 그래픽으로 재현한 것이거나 또는 실제로 존재하는 것이 아니고 임 의로 창작된 것일 수 있다. 골프코스 제작부는 사용자가 골프코스를 제작할 수 있도록 하는 수단인 골프코스 제작 프로그램과 등과 같은 제작 툴을 포함하거나 또는 상기 제작 툴에 포함되어 있을 수 있다. 도 3 및 도 4는 상기 제작 툴을 실행 하였을 때의 사용자 인터페이스 화면을 예시적으로 나타낸다. 도 3을 참조하면, 상기 제작 툴 실행 화면에는 상단에 사용자가 제작 중인 골프장의 이름이 표시되고(골프장 이름은 사용자가 명명하거나 또는 창작자인 사용자 이름 을 넣어서 명명되도록 할 수 있다), 상기 골프장 이름 아래에는 사용자가 실행가능한 커맨드가 표시된다. 상기 커맨드는 새로운 골프장을 제작할 때에 사용할 수 있는 '새로만들기', 골프장을 제작하다가 저장해놓은 경우에 상기 저장한 것을 불러올 때에 사용할 수 있는 '불러오기', 골프장을 제작하는 편집과정을 활성화할 때에 사용 할 수 있는 '편집하기' 등을 포함할 수 있다. 상기 편집과정은 새로운 골프코스를 직접 드로잉하거나 또는 프로 그램에 저장되어 있는 특정 구성요소를 불러와서 배치하거나 또는 작업 중인 내용을 수정하는 등 다양한 작업을 포함할 수 있다. '새로만들기/불러오기/편집하기' 등은 커맨드의 예로서 언급된 것이며, 여기에서 언급되지 않 은 다른 커맨드가 더 사용될 수 있다. 상기 커맨드 아래에는 현재 작업 중인 골프코스를 보여주는 메인창이 표시되고, 상기 메인창의 우측에는 현재 작업 중인 골프장을 구성하는 복수의 홀(골프코스)이 표시되는 서브창이 표시된다. 예를 들어, 현지 작업 중인 골프장인 18개 홀로 구성되어 있는 경우에 사용자는 18개 홀 각각을 모두 제작할 수 있고, 상기 서브창에는 18 개 홀이 미니맵 형태로 표시될 수 있다. 도 3에 도시되어 있는 바와 같이, 사용자가 1번홀을 제작하고 있고 나 머지 홀은 아직 미작업상태인 경우, 서브창의 1번홀이 하이라이트 되고 작업 중인 1번홀의 상세내용은 메인창에 표시되며, 아직 미작업상태인 나머지 홀은 서브창에서 공백 상태로 표시될 수 있다. 도 4에 도시되어 있는 바와 같이, 만약 사용자가 1번홀의 제작을 완료하고 2번홀을 제작하고 있고 나머지 홀은 아직 미작업상태인 경우, 서 브창의 2번홀이 하이라이트 되고 작업 중인 2번홀의 상세내용은 메인창에 표시되며, 서브창에 있어서 작업이 완 료된 1번홀은 완성된 코스가 미니맵 형태로 표시되고 미작업상태인 나머지 홀은 서브창에서 공백 상태로 표시될 수 있다. 골프코스는 골프코스 정보 저장부에 저장되어 있는 정보를 이용하여 제작될 수 있고, 또한 골프코스 정보 저 장부에 저장되어 있는 정보를 이용하지 않고도 제작될 수 있으며, 예를 들면 다음과 같은 여러가지 제작방법 이 사용될 수 있다. ① 기존 골프장에 있는 골프코스를 수집하여 새로운 골프장을 제작할 수 있다. 예를 들면, 새로운 골프장을 18 홀로 구성하되 1번홀은 골프코스 정보 저장부의 골프장 정보에 저장되어 있는 기존 골프장 A에 있는 1번홀을 그대로 가져다 사용하고, 2번홀 및 3번홀은 기존 골프장 B에서 2번홀과 10번홀을 그대로 가져다 사용하고, 3번 홀은 다른 기존 골프장의 골프코스를 가져다 사용하는 방법이 있을 수 있다(도 3에 있어서 1번홀(1H)은 이 방법 을 나타내고 있음). ② 기존 골프장에 있는 골프코스 구성요소를 이용하여 새로운 골프장을 제작할 수 있다. 즉 골프코스의 전체 윤 곽을 골프코스 정보 저장부의 골프코스 구성요소 정보에 저장되어 있는 것 중 어느 하나를 불러와서 형성하 고, 페어웨이, 벙커, 그린 등의 구성요소를 골프코스 구성요소 정보에 저장되어 있는 것을 불러와서 상기 골프 코스 윤곽에 원하는대로 배치함으로써 새로운 골프장에 있어서의 각 홀(골프코스)을 제작하는 방법이 있을 수 있다(도 4에 있어서 2번홀(2H)은 이 방법을 나타내고 있음). ③ 골프코스 정보 저장부의 정보를 이용하지 않고, 골프코스 윤곽, 페어웨이, 그린, 벙커 등의 구성요소를 사용자가 직접 작업하여 제작하는 것도 가능하다. 여기에서 '사용자의 직접 작업'이란 사용자가 전부 직접 작성 하는 것 또는 일부만 직접 작성하는 것을 포함한다. 예를 들면 그린 영역을 작업하는 경우에, 전부 직접 작성하 는 것은 그린 영역의 형태뿐만 아니라 그린 영역을 구성하는 잔디까지 그린 영역에 대한 모든 것을 사용자가 직 접 드로잉하는 것을 의미하고, 일부만 직접 작성하는 것은 그린 영역의 형태만 사용자가 드로잉하고 잔디에 대 해서는 골프코스 정보 저장부에 저장되어 있는 구성요소 정보 중에서 잔디에 관한 데이터를 불러서 드로잉된 그린 영역을 채워서 작성하는 것 등과 같이 사용자의 직접 드로잉과 골프코스 정보 저장부의 저장 데이터의 이용이 병합되는 작업 형태를 의미한다. ④ 골프코스 정보 저장부의 정보를 이용하면서도 이를 사용자가 수정하여 이용하는 방법도 가능하다. 가령 골프코스 정보 저장부에 저장되어 있는 특정 골프코스나 특정 구성요소를 현재 작업 중인 메인창으로 로드한 후에 로드된 것 중 일부를 사용자가 변형하여 골프코스를 제작할 수 있다. 구체적인 예를 들면, ①번 방법에 따 라 특정 골프코스를 불러온 후에 해당 골프코스에 벙커를 추가한다던가 해당 골프코스의 전체 윤곽을 수정한다 던가 하여 골프코스를 제작할 수 있다. 또는 ②번 방법에 따라 골프코스 윤곽을 불러오고 여기에 골프코스 구성 요소를 배치한 후에, 골프코스 윤곽이나 골프코스 구성요소를 자신이 원하는 형태로 수정하여 골프코스를 제작 할 수 있다. ⑤ ①, ②, ③, ④는 각각 따로 사용되어야 하는 것은 아니며 이들을 결합하여 골프코스를 제작하는 것도 가능 한다. 예를 들면, 18번홀로 구성되는 골프장을 제작하면서, 1-5번홀은 ①번 방법으로 형성하고, 6-10번홀은 ② 번 방법으로 형성하며, 11-15번홀은 ③번 방법으로 형성하고, 16-18번홀은 ④번 방법으로 형성할 수 있다. 이상 골프코스 제작부를 통하여 골프코스를 제작하는 여러가지 방법에 대해 설명하였는데, 이는 골프코스 제작 에 관한 몇 가지 예를 든 것이며 여기에서 언급하지 않은 다른 방법이 사용될 수도 있다. 또한 골프코스 제작부 에 있어서 화면구성이나 사용자 인터페이스 등은 도면(도 3, 4 등)에 도시되어 있는 것과 다른 형태가 될 수도 있다. 사용자가 골프코스를 제작하는 동안 제작 중인 골프코스에 대해, 또는 사용자가 골프코스 제작을 완료하였을 때 에는 완료된 골프코스에 대해, 골프코스 평가부는 플레이 난이도를 평가한다. 골프코스 평가과정은 인공지능을 이용하여 실행될 수 있다. 인공지능을 이용하는 경우, 도 5에 도시되어 있는 바와 같이, 입력 데이터를 인공지능에 입력하고 인공지능에 의하여 출력 데이터가 얻어지도록 할 수 있다. 여기 에서 인공지능은 인간의 지적 능력을 인공적으로 구현한 프로그램이며, 인공지능에는 머신러닝 기술 등이 적용 될 수 있다. 머신러닝 기술 등을 적용함으로써 규칙에 의해 정해진 결과값을 도출하는 전통적인 프로그램과는 다르게 인공지능이 많은 수의 입력 데이터를 분석하여 스스로 결과값을 도출하도록 할 수 있다. 머신러닝 등의 인공지능 모델은 복수의 층과 각 층을 구성하는 복수의 노드로 이루어진 인공신경망을 포함하고, 상기 복수의 층은 입력층, 은닉층, 출력층을 포함할 수 있다. 입력층은 분석 대상 데이터를 입력 받는 층이고, 출력층은 결 과값이 출력되는 층이며, 은닉층은 입력층과 출력층 사이의 중간층을 의미한다. 인공지능을 적용함에 있어서, 입력 데이터는 골프코스를 평가하는데 사용될 수 있는 근거자료이다. 입력 데이터 는 한 가지 종류가 아니라 다양한 종류의 복수 데이터가 될 수 있다. 예를 들면, 입력 데이터로서 골프코스의 지형적 특징과 관련한 정보가 사용될 수 있고, 지형적 특징으로는 페어웨이의 폭, 해저드나 벙커의 개수, 해저 드나 벙커의 위치, 그린 영역의 형태나 경사, 골프코스의 길이(티박스에서 홀컵까지의 거리) 등이 있을 수 있다. 구체적으로 도 6을 참조하면, 골프코스에 있어서 티샷위치(티박스)에서 홀컵까지의 거리(C1), 코스의 전 체적인 윤곽(C2), 코스에 존재하는 트러블 영역(러프, 벙커 등과 같이 해당 위치에 골프공이 놓여 있을 때에 타 격이 용이하지 않은 지역을 편의상 '트러블 영역'이라 명명함)의 개수, 면적, 위치 등과 같은 분포 특성(C3), 페어웨이의 폭(C4), 그린 영역의 경사(C5) 등에 따라 플레이 난이도가 달라질 수 있다. 티샷위치에서 홀컵까지의 거리(C1)에 따라 홀컵에 홀인할 때까지의 타격횟수가 달라질 수 있고(거리가 길수록 타격횟수가 증가될 수 있음) 또한 상기 타격횟수는 골프 플레이 스코어와 연결되기 때문에, 티샷위치에서 홀컵 까지의 거리(C1)는 골프코스의 난이도를 평가하는 근거가 될 수 있다. 코스의 전체적인 윤곽(C2)도 골프코스 난 이도를 좌우할 수 있다. 가령 전체 윤곽이 일자형태인 경우와 꺽인형태(〈)인 경우를 비교하면, 전자의 코스 에서는 계속 직선방향으로 골프공을 타격하면 되지만 후자의 코스에서는 타격방향을 바꿔가면서 골프공을 타격 해야 하고 오비(OB; Out of Bounds)가 발생할 가능성이 있기 때문에 플레이 난아도가 높아진다. 코스에 존재하 는 트러블 영역의 분포 특성(C3)은 트러블 영역으로 무엇이 있는지, 몇개나 있는지, 어디에 배치되어 있는지 등 을 나타낸다. 잔디 영역인 러프에 비해 모래 영역인 벙커에서의 타격이 어렵기 때문에, 트러블 영역이 무엇인지 에 따라 플레이 난이도가 달라질 수 있다. 또한 트러블 영역의 개수나 면적이 증가할수록 플레이 난이도가 증가 하며, 트러블 영역의 위치도 난이도에 영향을 줄 수 있다. 가령 벙커가 그린 영역 근방에 위치하는 경우와 그린 영역에서 멀리 떨어져 있는 경우를 비교하면, 전자가 후자에 비해 플레이 난이도가 높다고 볼 수 있다. 전자의 경우에는 사용자가 그린 영역에 골프공을 착지시키려고 시도하는 과정에서 골프공이 벙커에 빠지게 될 가능성이 높은 반면, 벙커가 그린 영역으로부터 멀리 떨어져 있다면 샷을 하면서 벙커를 피해갈 수 있는 가능성이 있기 때문이다. 페어웨이의 폭(C4)이 넓다면 그만큼 페어웨이 영역이 넓고 트러블 영역이 좁으므로 트러블샷을 하게 될 가능성이 낮아져서 플레이 난이도가 낮아진다. 반대로 페어웨이의 폭(C4)이 좁다면 그만큼 페어웨이 영역이 좁고 트러블 영역이 넓으므로 트러블샷을 하게 될 가능성이 높아져서 플레이 난이도가 높아진다. 따라서 페어웨 이 폭(C4)은 골프코스의 난이도를 평가하는 근거가 될 수 있다. 그린 영역의 경사(C5)에 따라 퍼팅에서 골프공 이 굴러가는 방향이나 속도가 불규칙으로 변경될 가능성이 높아지며, 사용자의 입장에서는 골프공을 퍼팅하여 홀컵에 정확하게 홀인시키기가 어려워진다. 따라서 그린 영역의 경사(C5)에 따라 플레이 난이도가 달라질 수 있 고, 이는 골프코스의 난이도를 평가하는 근거가 될 수 있다. 이상 골프코스의 플레이 난이도에 영향을 줄 수 있는 몇 가지 요인에 대해 도 6을 참조하여 설명하였으나, 여기 에서 언급되지 않은 다른 요인이 더 있을 수 있다. 예를 들면, 나무 등과 같은 장애물의 분포 특성이나 해당 골 프코스의 규정타수(파3 홀인지, 파4 홀인지, 파5 홀인지 여부) 등도 플레이 난이도에 영향을 줄 수 있다. 상기한 요인은 골프코스 자체의 내부적인 특성에 따라 플레이 난이도를 평가하는 요인이라 할 수 있는데, 이것 이외에도 플레이 난이도를 평가할 수 있는 다른 근거자료가 더 있을 수 있다. 사용자가 골프코스를 제작한 후에, 제작한 사용자 자신 또는 다른 사용자가 제작된 골프코스를 이용하여 플레이한다면 상기 플레이 기록 또 한 골프코스를 평가하기 위한 데이터로 사용될 수 있다. 사용자의 플레이 기록은 여러가지가 있을 수 있고, 그 중 평가대상 골프코스에서 사용자가 기록한 스코어(타수)의 평균값이 플레이 난이도 평가를 위한 근거자료로 사 용할 수 있다. 일반적으로 골프코스는 총 18홀로 구성되며, 골프는 각 홀에서 골프공을 홀컵에 넣을 때까지 사 용한 타수(골프공을 타격한 횟수)의 총합에 따라 승부가 결정된다. 총 18홀로 구성되는 골프코스에 있어서 규정 타수를 모두 더하면 72타가 되는데, 프로골퍼들은 60대 후반 또는 70대 초반의 타수를 기록하며 일반인들은 80 타 이내에 들어가면 상급자로 인정된다. 평가대상 골프코스에서 사용자들이 기록한 총 타수의 평균값이 크다면, 홀인을 할 때까지 그만큼 많은 횟수의 타격이 있었다는 것이고, 이는 많은 타격횟수가 필요할 정도로 코스 난이 도가 높다는 것을 의미한다. 반대로 평가대상 골프코스에서 사용자들이 기록한 총 타수의 평균값이 적다면, 홀 인을 할 때까지 그만큼 적은 횟수의 타격이 있었다는 것이고, 이는 타격횟수가 많이 필요하지 않을 정도로 코스 난이도가 낮다는 것을 의미한다. 따라서 사용자들이 기록한 총 타수의 평균값은 골프코스에 대한 플레이 난이도 를 평가하는 근거자료가 될 수 있다. 평균 타수 이외에 페어웨이 안착률, 그린 정확도, 평균 퍼팅수 등도 플레 이 난이도를 평가하기 위한 입력 데이터로 사용될 수 있다. 제작한 골프코스에 대한 사용자의 평가도 플레이 난이도를 평가할 수 있는 근거자료가 될 수 있다. 가령 가상 골프 장치가 설치되어 있는 스크린 골프장에서 사용자 제작 골프코스를 선택해서 플레이가 완료된 경우, 플레이 를 완료한 사용자에게 오늘 플레이한 골프코스에 대해 평가해달라고 요청할 수 있고, 사용자가 상기 요청에 답 변하면 상기 답변결과를 골프코스 평가를 위한 입력 데이터로 사용할 수 있다. 사용자 평가에 대해서는 단순히 플레이했던 골프코스의 전체적인 난이도를 선택(예를 들면, 매우 어려움/어려움/보통/쉬움/매우 쉬움 중에서 선 택)하는 간단한 조사 방식이 있을 수 있고, 또는 골프코스의 전체적인 난이도 평가 이외에 티샷, 어프로치, 퍼 팅 등 구체적인 타격의 세부 내용에 대한 답변을 요구하는 조사 방식 등이 있을 수 있다. 골프코스 플레이 난이도 평가를 위한 근거자료로서 골프코스의 지형특성(페어웨이 폭, 벙커개수, 그린 경사 등), 사용자의 플레이 기록, 사용자의 평가 등을 언급하였는데, 여기에서 언급되지 않은 다른 평가요인이 더 있 을 수 있다. 여기에서 언급된 평가요인은 반드시 모두 사용되어야 하는 것은 아니며 이 중 일부만을 사용하여 골프코스를 평가할 수 있고 또는 언급되지 않은 다른 항목을 더 사용하여 골프코스를 평가할 수도 있다. 여러가 지 종류의 평가요인을 인공지능의 입력 데이터로 사용함에 있어서, 입력 데이터의 종류에 따라 평가에 반영되는 비중을 서로 동일하게 하거나 또는 서로 차이나도록 구성할 수 있다. 예를 들어 입력 데이터로서 복수의 항목 A, B, C가 있고, 대상 골프코스에 대한 최종 평가점수 PT가 항목 A에 따른 평가점수 PA와 항목 B에 따른 평가점 수 PB와 항목 C에 따른 평가점수 PC를 종합하여 산출된다고 가정하면, 최종 평가점수 PT는 하기의 식에 따라 계 산되도록 할 수 있다. PT = αPA + βPB + γPC 여기에서 α, β, γ의 값을 1로 설정하면, 여러가지 종류의 입력 데이터가 모두 동일한 비중으로 골프코스를 평가하는데에 사용될 수 있다. 만약 α, β, γ의 값을 서로 다르게 설정하면, 여러가지 종류의 입력 데이터가 서로 다른 비중으로 골프코스를 평가하는데에 사용될 수 있다. 예를 들어 PA가 사용자의 가상 골프코스에서의 플레이 기록에 따른 평가점수이고, PB가 평가대상 골프코스에 대한 사용자 평가에 따른 평가점수이고, PC가 평 가대상 골프코스에 관한 지형적 특징에 따른 평가점수라고 할 때에, 제작 골프코스를 이용한 사용자가 많지 않 아서 플레이 기록이나 사용자 평가가 많지 않다면, PA 또는 PB에는 어느 정도 신뢰성이 있는 풍부한 양의 자료 가 축적될 수 없으므로, α나 β에 비하여 γ가 큰 값을 갖도록 설정될 수 있다. 예를 들어 'α=1, β=1, γ=5' 등과 같이 가중치를 서로 다르게 설정할 수 있다. 도 5를 다시 참조하면, 입력데이터가 주어지면 인공지능에 의하여 골프코스를 평가한 결과가 도출되고, 상기 평 가결과는 출력데이터로서 얻어진다. 골프코스 플레이 난이도에 대한 평가결과는, 사용자가 골프코스를 제작하는 동안 또는 골프코스 제작이 완료한 때에 사용자에게 제공될 수 있다. 본 실시예에 골프코스를 평가한다는 것은 복수의 홀로 구성되어 있는 골프장(CC; Country Club)의 플레이 난이도를 평가함을 의미하거나 또는 골프장을 구성하는 개개의 홀을 하나의 골프코스로 보고 하나의 홀에 대한 플레이 난이도를 평가함을 의미할 수 있다. 하 나의 홀(골프코스)에 대한 평가는 위에서 설명한 방법으로 인공지능 등을 이용하여 이루어질 수 있고, 복수의 홀로 이루어진 골프장에 대한 평가는 대상 골프장을 구성하는 개개의 홀에 대한 골프코스 평가를 실행한 후 이 를 종합함으로써 이루어질 수 있다. 도 7은 본 발명의 다른 실시예에 따른 골프코스 제작장치의 개략적인 구성을 나타내는 도면이고, 도 8은 골프코 스 제작부에 있어서 골프코스를 제작하기 위한 인터페이스 화면을 예시적으로 나타내는 도면이다. 도 7을 참조하면, 골프코스 제작장치는 골프코스 정보 저장부, 골프코스 제작부, 골프코스 평가부, 골 프코스 제작 어드바이서를 포함한다. 골프코스 정보 저장부는 골프코스 제작에 필요한 각종 정보를 저장 하며, 골프코스 제작부는 사용자가 골프코스를 제작할 수 있도록 하는 직접적인 수단을 제공하며, 골프코스 평가부는 사용자가 제작중인 골프코스 및/또는 사용자가 제작을 완료한 골프코스에 대한 플레이 난이도를 평 가한다. 골프코스 제작 어드바이서는 골프코스 평가부의 평가결과에 근거하여 사용자가 제작중인 골프코 스의 플레이 난이도를 조정할 수 있도록 사용자에게 골프코스의 제작에 관한 어드바이스를 제공할 수 있다. 본 실시예에 있어서 골프코스 제작 어드바이서를 제외한 나머지 구성은 전술한 실시예에서 설명한 것과 큰 차이 가 없으므로, 이에 대한 상세 설명은 생략한다. 골프코스 제작 어드바이서는 골프코스 제작을 위한 툴을 실행하였을 때에 사용자에게 적정 어드바이스를 제 공할 수 있다. 도 8은 골프코스 제작을 위한 툴을 실행했을 때의 인터페이스 화면의 예를 나타낸다. 도 8을 참 조하면, 화면 상단에 사용자가 제작 중인 골프장의 이름이 표시되고, 상기 골프장 이름 아래에는 사용자가 실행 가능한 커맨드가 표시되며, 상기 커맨드 아래에는 현재 작업 중인 골프코스를 보여주는 메인창이 표시되고, 상 기 메인창의 우측에는 현재 작업 중인 골프장을 구성하는 복수의 홀(골프코스)이 표시되는 서브창이 표시된다. 사용자가 1번홀의 제작을 완료하고 2번홀을 제작하고 있고 나머지 홀은 아직 미작업상태인 경우, 서브창의 2번 홀이 하이라이트 되고 작업 중인 2번홀의 상세내용은 메인창에 표시되며, 서브창에 있어서 작업이 완료된 1번홀 은 완성된 코스가 미니맵 형태로 표시되고 미작업상태인 나머지 홀은 서브창에서 공백 상태로 표시될 수 있다. 메인창의 하단에는 현재 제작 중인 골프코스에 대해 골프코스 평가부에서 평가한 플레이 난이도가 표시될 수 있다. 도 8에 도시되어 있는 바와 같이, 만약 사용자가 중급 정도의 난이도(B)를 갖는 골프코스를 제작하고자 하고, 현재까지 작성된 골프코스를 기준으로 평가된 플레이 난이도가 입문 정도의 난이도(D+)를 갖는다고 가정 하면, 골프코스 제작 어드바이서는 목표 난이도(B)에 도달하기 위해서 현재 작업 중인 골프코스에 어떠한 추 가 작업을 할 수 있는지를 제시할 수 있다. 즉, 벙커를 추가하거나 또는 골프코스의 거리(예를 들면 티박스에서 홀컵까지의 거리)를 증가하거나 또는 그린의 경사도를 증가하는 것 등과 같은 구체적인 방법을 제시함으로써, 사용자가 보다 용이하게 원하는 플레이 난이도의 골프코스를 제작할 수 있도록 도와줄 수 있다. 도 9는 본 발명의 또 다른 실시예에 따른 골프코스 제작장치의 개략적인 구성을 나타내는 도면이고, 도 10은 도 9의 골프코스 제작장치에서 사용자 제작 레벨 관련 동작과정을 예시적으로 나타내는 순서도이며, 도 11은 골프 코스 제작 매니저에서 인공지능을 이용하여 사용자 제작 레벨을 평가하는 방법을 설명하기 위한 도면이고, 도 12는 사용자 정보 저장부의 상세구조를 예시적으로 나타내는 도면이고, 도 13 내지 도 16은 골프코스 제작 매니 저의 동작하에서 골프코스를 제작하기 위한 사용자 인터페이스 화면을 예시적으로 나타내는 도면이다. 도 9를 참조하면, 골프코스 제작장치는 골프코스 정보 저장부, 골프코스 제작부, 골프코스 평가부, 골 프코스 제작 매니저, 사용자 정보 저장부를 포함한다. 골프코스 정보 저장부는 골프코스 제작에 필요 한 각종 정보를 저장하며, 골프코스 제작부는 사용자가 골프코스를 제작할 수 있도록 하는 직접적인 수단을 제공한다. 골프코스 평가부는 사용자가 제작중인 골프코스 및/또는 사용자가 제작을 완료한 골프코스에 대한 플레이 난이도를 평가한다. 이들 구성은 전술한 실시예(도 1을 참조하여 설명한 실시예)에서 설명한 것과 큰 차 이가 없으므로, 이에 대한 상세 설명은 생략한다. 골프코스 제작 매니저는 사용자에게 제작 레벨을 부여하고 또한 상기 사용자 제작 레벨에 따라 사용자가 제 작하는 골프코스에 대해서 플레이 난이도의 상한값을 설정하는 역할을 한다. 사용자 정보 저장부는 골프코스 제작 매니저의 동작에 필요한 여러가지 사용자 정보를 저장한다. 골프코스 제작 매니저의 동작과정은 제1 내지 제6 단계(S1-S6)를 포함한다. 도 10을 참조하면, 제1 단계(S 1)에서는 현재 골프코스를 제작하고자 하는 사용자의 제작 레벨을 파악한다. 제2 단계(S2)에서는 상기 파악된 제작레벨에 따라 사용자가 제작가능한 난이도의 상한값을 설정하고 상기 설정된 난이도 상한값을 표시한다. 제3 단계(S3)에서는 사용자가 골프코스 제작을 위한 작업을 실시한다. 제4 단계(S4)에서는 사용자가 작업하고자 하 는 골프코스에 대한 현재의 플레이 난이도와 사용자에게 허용된 난이도 상한을 비교한다. 상기 비교의 결과, 작 업 중인 플레이 난이도가 사용자에게 허용된 난이도의 상한을 초과하는 경우에는 제5 단계(S5)에서 사용자가 원 하는 작업을 불허하고, 작업 중인 플레이 난이도가 사용자에게 허용된 난이도의 상한을 초과하지 않는 경우에는 제6 단계(S5)에서 사용자가 원하는 작업을 허용한다. 제1 단계(S1)의 골프코스를 제작하는 사용자의 제작 레벨을 파악하는 과정과 관련하여, '사용자의 제작 레벨'이 라 함은 사용자가 골프코스를 제작하는데에 얼마나 숙련되어 있는지를 나타내는 지표라고 할 수 있다. 사용자의제작 레벨을 파악하는 과정은 인공지능을 이용하여 실행될 수 있다. 인공지능을 이용하는 경우, 도 11에 도시되 어 있는 바와 같이, 입력 데이터를 인공지능에 입력하고 인공지능에 의하여 출력 데이터가 얻어지도록 할 수 있 다. 인공지능에는 머신러닝 기술 등이 적용될 수 있고, 이에 따라 인공지능이 많은 수의 입력 데이터를 분석하 여 스스로 결과값을 도출하도록 할 수 있다. 인공지능을 적용함에 있어서, 입력 데이터는 사용자의 골프코스 제작 레벨을 파악하는데 사용될 수 있는 근거자 료이다. 입력 데이터는 한 가지 종류가 아니라 다양한 종류의 복수 데이터가 될 수 있다. 예를 들면, 입력 데이 터로서 사용자가 가상 골프 장치에서 플레이했을 때의 기록, 사용자의 골프코스 제작 경력, 사용자가 과거에 제 작한 골프코스에 대해 다른 사용자가 이용한 횟수, 사용자가 과거에 제작한 골프코스에 대한 다른 사용자의 평 가 등이 있을 수 있다. 사용자가 가상 골프 장치에서 플레이했을 때의 기록은 사용자의 플레이 횟수와 플레이 성적을 포함할 수 있다. 플레이 횟수가 많을수록 플레이 경험이 축적되어 골프코스에 대한 이해도가 높아진다고 할 수 있고, 좋은 플레 이 성적을 내려면 골프코스를 잘 이해하고 코스 공략법을 잘 세워야 하므로, 이러한 사용자일수록 골프코스의 특징을 잘 이해하고 골프코스 제작에 있어서의 숙련도가 높다고 볼 수 있다. 또한 사용자가 골프코스를 제작한 경험이 많을수록 골프코스 제작에 숙달된다고 볼 수 있으므로, 사용자의 골프코스 제작 경력은 사용자의 골프코 스 제작 레벨을 평가하는 근거자료가 될 수 있다. 사용자가 제작한 골프코스는 본인 및/또는 타인 사용자가 플 레이할 때에 이용하도록 할 수 있다. 만약 현재 골프코스를 제작하고자 하는 사용자가 과거에도 골프코스를 제 작한 적이 있고 또한 과거 제작한 골프코스(이하 '과거 제작 골프코스'라 명명)를 다른 사용자가 이용한 적이 있다면, 다른 사용자가 상기 과거 제작 골프코스를 이용했을 때의 자료를 골프코스 제작 레벨을 평가하는 자료 로 사용할 수 있다. 예를 들어 다른 사용자들이 상기 과거 제작 골프코스를 이용한 횟수가 많다면, 그만큼 상기 과거 제작 골프코스를 잘 만들었다는 것을 의미하므로, 해당 골프코스를 제작한 사용자의 골프코스 제작 레벨이 높다고 할 수 있다. 반대로 다른 사용자들이 상기 과거 제작 골프코스를 이용한 횟수가 작다면, 그만큼 상기 과 거 제작 골프코스를 잘 만들지 못했다는 것을 의미하고, 해당 골프코스를 제작한 사용자의 골프코스 제작 레벨 이 낮다고 할 수 있다. 또는 다른 사용자에게 상기 과거 제작 골프코스를 플레이한 후에 해당 골프코스에 평가 해줄 것을 요청할 수 있고, 다른 사용자가 상기 요청에 응답했다면 상기 평가결과를 골프코스 제작 레벨을 평가 하는 자료로 사용할 수 있다. 위와 같이, 사용자가 가상 골프 장치에서 플레이했을 때의 기록, 사용자의 골프코스 제작 경력, 사용자가 과거 에 제작한 골프코스에 대해 다른 사용자가 이용한 횟수, 사용자가 과거에 제작한 골프코스에 대한 다른 사용자 의 평가 등을 입력데이로로 이용하면 인공지능에 의하여 사용자의 골프코스 제작 레벨이 도출될 수 있고, 이는 출력데이터로 얻어질 수 있다. 도 12를 참조하면, 사용자 정보 저장부에는 복수의 사용자에 대한 정보가 저장된다. 복수의 사용자는 각 사 용자별로 다른 저장영역이 할당되어 각 사용자에게 할당된 영역에 여러가지 정보가 저장되어 있을 수 있다. 본 실시예의 골프코스 제작장치는 서버에 구비되고 복수의 사용자가 서버에 접속한 상태에서 실행되도록 할 수 있 다. 또는 본 실시예의 골프코스 제작장치를 실행시킬 수 있는 프로그램을 사용자가 서버에 접속하여 자신의 단 말기에 다운로드한 후 이를 설치함으로써 실행되도록 할 수 있다. 어느 경우에나 사용자 정보 저장부가 상기 서버에 구비되도록 할 수 있고, 사용자가 골프코스 제작장치를 사용하기 위해서 먼저 로그인을 하도록 한다면, 로그인 과정에서 사용자의 신원이 확인될 수 있고 사용자 정보 저장부에는 골프코스 제작장치를 이용하는 사 용자의 정보가 저장되도록 할 수 있다. 복수의 사용자로서 서로 다른 사용자 A, B, C 등이 있다고 할 때에, 사용자 정보 저장부에는 사용자 A에 대 한 정보를 저장하는 영역, 사용자 B에 대한 정보를 저장하는 영역, 사용자 C에 대한 정보를 저장하는 영역이 서 로 구분되어 있고, 각 사용자 저장영역에는 사용자의 신상 정보, 사용자의 플레이 정보, 사용자의 골프코스 제 작 정보 등이 저장되어 있을 수 있다. 사용자의 신상 정보에는 사용자의 개인 신상 정보가 저장되며 이는 로그 인 과정 등에 이용될 수 있다. 사용자의 플레이 정보에는 사용자가 플레이한 기록이 저장되어 있을 수 있다. 앞 에서 언급한 서버가 가상 골프 장치와 연결되어 시스템을 형성하고 있다면(후술할 도 19, 21의 가상 골프 시스 템에 대한 설명 참조), 가상 골프 장치에서 사용자가 플레이했던 기록을 서버에서 입수하여 사용자 정보 저장부 에 저장되도록 할 수 있다. 골프코스 제작 정보를 저장하는 영역에는 각 사용자가 제작한 골프코스에 대한 정보가 저장될 수 있다. 예를 들면, 사용자가 제작한 골프코스(골프장 및/또는 골프장을 구성하는 홀들)의 상세 내용, 상기 골프코스를 타인 사용자가 이용한 경우에 이용횟수, 타인 사용자가 상기 골프코스를 이용한 후에 해 당 골프코스를 평가하였다면 평가한 내용(평가등급 및/또는 평가 코멘트 등을 포함) 등에 대한 정보가 저장되어 있을 수 있다. 골프코스 제작 매니저는 사용자의 골프 제작 레벨을 파악하는 동작을 사용자가 골프코스를 제작하고자 할 때에 실시하거나 또는 사용자의 골프코스 제작과 상관없이 사전에 미리 실시할 수도 있다. 사전에 미리 사용자의 골프 제작 레벨을 파악하는 경우, 골프코스 제작 매니저는 사전에 파악된 정보를 골프코스 제 작 정보에 저장되도록 할 수 있고, 이 경우에 골프코스 제작 매니저의 동작에 있어서 제1 단계(S1)는 사용자 정보 저장부에서 현재 골프코스를 제작하려고 하는 사용자의 저장영역을 검색하고, 상기 저장영역 중 골프코 스 제작 정보가 저장되어 있는 영역에서 해당 사용자의 골프코스 제작 레벨을 추출해내는 동작으로 실행될 수 있다. 상기 골프코스 제작 레벨은 고정되어 있는 것은 아니며 골프코스 제작 레벨 판단의 근거가 되는 데이터가 변경되면 그에 맞추어 갱신되도록 할 수 있다. 제2 단계(S2)에서 사용자의 골프제작 레벨이 파악되면 이에 맞추어서 사용자가 제작 가능한 골프코스의 플레이 난이도 상한을 설정하고 이를 표시한다. 예를 들어 사용자의 골프제작 레벨을 초급, 중급, 상급의 3가지로 구분 할 수 있다고 가정하면, 초급의 제작레벨을 가진 사용자에게는 플레이 난이도가 D급(매우 쉬움)인 골프코스만 제작할 수 있도록 하고, 중급의 제작레벨을 가진 사용자에게는 플레이 난이도가 B급(보통), C급(쉬움)인 골프코 스를 제작할 수 있도록 하고, 상급의 제작레벨을 가진 사용자에게는 플레이 난이도가 A급(어려움), S급(매우 어 려움)인 골프코스를 제작할 수 있도록 설정할 수 있다. 상기 설정된 플레이 난이도는 사용자가 골프코스 제작 툴 등을 실행하여 골프코스를 제작하고 있을 때에 표시되도록 할 수 있다. 예를 들어 사용자가 복수의 홀로 구 성되는 골프장을 제작하고 있고 현재 1번홀의 제작을 완료한 후 2번홀을 제작하고자 하는 경우에, 도 13에 도시 되어 있는 바와 같이, 2번홀 제작에 있어서 해당 사용자에게 허용가능한 플레이 난이도 상한이 골프코스 제작을 위한 툴의 실행화면의 하단에 표시되도록 할 수 있다. 이와 같이 사용자의 골프제작 레벨에 따라 해당 사용자가 제작가능한 골프코스의 플레이 난이도를 제한하는 이 유는, 제작이 미숙한 사용자는 골프코스에 대한 이해도가 떨어지기 때문에, 골프코스 제작이 미숙한 사용자가 너무 어렵게 골프코스를 만들어버리면, 다른 사용자가 제작된 고난이도 골프코스를 이용할 때에 플레이하기가 까다롭기만 하고 불편하다고 생각할 수 있기 때문이다. 따라서 골프제작 레벨이 높아지면서 어느 정도 골프코스 구성에 대한 이해도가 높아진 이후에 고난이도의 골프코스를 제작할 수 있게 허용함이 바람직하다. 제3 단계(S3)에서는 사용자가 골프코스 제작을 위한 작업을 실시한다. 도 14를 참조하면, 사용자는 2번홀에 대 한 골프코스의 윤곽을 형성하고 여기에 그린영역, 페어웨이, 벙커 등을 배치하면서 제작 작업을 진행하고 있다 고 할 때에, 골프코스 평가부는 현재까지 진행된 상태에서의 골프코스 플레이 난이도를 평가하여 이를 표시 할 수 있다. 도 14에 도시되어 있는 바와 같이, 골프코스 제작 툴의 실행화면의 하단에 골프코스 평가부가 평가한 플레이 난이도(B- 등급)와 현재 골프코스를 제작 중인 사용자에 대해 골프코스 제작 매니저가 허용한 제작가능 난이도(B 등급)가 함께 표시되도록 할 수 있다. 제4 단계(S4)에서 골프코스 제작 매니저는 사용자가 작업을 진행함에 따라 작업 중인 골프코스의 현재 플레 이 난이도와 사용자에게 허용된 난이도 상한을 비교한다. 예를 들어 도 15를 참조하면, 사용자가 2번홀의 골프 코스를 제작하면서 골프코스 윤곽을 형성하고 여기에 그린영역, 페어웨이, 벙커를 배치한 상태에서 새로운 벙커 를 더 추가하고자 하는 경우를 가정한다. 사용자가 새로운 벙커를 마우스 로 드래그하여 진행 중인 골프코스에 배치하고자 할 때에, 골프코스 평가부는 새로운 벙커가 추가된 경우의 골프코스의 플레이 난이도를 평가하여 이를 골프코스 제작 매니저에게 전달하고, 골프코스 제작 매니저는 전달받은 플레이 난이도와 사용자에게 허용된 난이도 상한을 비교한다. 도 15에 도시되어 있는 바와 같이, 새로운 벙커가 추가되었을 때의 플레이 난이도가 B+ 등급이고 사용자에게 허 용된 난이도 상한이 B 등급이어서, 작업 중인 골프코스의 플레이 난이도가 사용자에게 허용된 난이도의 상한을 초과하는 경우에는 제5 단계(S5)가 실행되고, 제5 단계(S5)에서 골프코스 제작 매니저는 사용자가 원하는 작 업을 불허하고 작업이 불허되었음을 사용자에게 알려준다. 도 16에 도시되어 있는 바와 같이, 새로운 벙커가 추가되었을 때의 플레이 난이도가 B 등급이고 사용자에게 허 용된 난이도 상한이 B 등급이어서, 작업 중인 골프코스의 플레이 난이도가 사용자에게 허용된 난이도의 상한을 초과하지 않는 경우에는 제6 단계(S6)가 실행되고, 제6 단계(S6)에서 골프코스 제작 매니저는 사용자가 원하 는 작업을 허용함으로써 작업 중인 골프코스에 새로운 벙커가 추가될 수 있다. 새로운 벙커가 추가되면서 현재 작업 중인 골프코스의 플레이 난이도가 변경되었기 때문에, 기존 플레이 난이도를 변경된 플레이 난이도로 고쳐 서 표시한다. 상기한 과정(제3 내지 제6 단게(S3-S6))은 사용자가 새로운 구성 등을 추가하거나 기존 구성을 수 정하면서 골프코스의 제작을 완료할 때까지 반복될 수 있다. 이상 골프코스 제작장치에서 사용자가 새로운 골프코스를 제작하는 과정을 설명하였는데, 이와 같이 제작된 골 프코스는 스크린 골프장 등에 설치되어 있는 가상 골프 장치에서 사용자가 스크린 골프를 플레이할 때에 사용될수 있다. 도 17은 본 발명의 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 17을 참조하면, 본 발명의 실시예에 따른 가상 골프 장치는 타격 플레이트, 제어부, 감지부, 입 력부, 사운드부, 표시부를 포함한다. 타격 플레이트는 사용자가 골프공을 타격하기 위하여 위치하는 영역이다. 타격 플레이트는 플레이트형 물체가 될 수도 있고 또는 별도의 물체가 아니고 단순히 가상 골프 장치가 설치되어 있는 장소의 바닥면으로서 사용자가 위치하는 부분이 될 수도 있다. 도면에 도시되어 있지 않지만, 타격 플레이트에는 골프공이 놓여 지는 타격매트가 구비되어 있고, 또한 상기 타격매트에는 상하로 이동가능한 구조의 오토티가 설치되어 있다. 상기 오토티를 통하여 사용자에게 타격용 골프공이 자동으로 제공될 수 있다. 제어부는 가상 골프 장치의 각 구성품 사이의 전반적인 동작을 컨트롤한다. 예를 들면, 제어부는 타격 매트에 설치되어 있는 상기 오토티를 컨트롤하여, 사용자가 타격하는 시점에 맞추어 오토티에서 타격용 골프공 이 제공되도록 할 수 있다. 또한 사용자가 특정 골프코스를 선택한 경우, 해당 골프코스에서 플레이할 수 있도 록 제어부는 필요한 동작을 실행한다. 예를 들면, 제어부는 영상을 처리하는 영상처리수단을 구비하고 있고, 사용자가 특정 골프코스를 선택한 경우에 상기 영상처리수단에서 해당 골프코스 영상을 형성하여 표시부 로 전달함으로써 해당 영상이 디스플레이되도록 할 수 있다. 제어부는 산출부, 저장부, 골프코 스 정보 저장부, 골프코스 제작부를 구비하고 있다. 산출부는 사용자가 타격한 골프공의 물리적 상 태 등에 근거하여 상기 물리적 상태대로 골프공이 실제 골프장에서 움직인다고 가정했을 때의 궤적을 산출하는 산출과정을 수행한다. 저장부는 메모리나 하드 디스크 등과 같은 저장기기를 포함하며, 제어부나 산출 부 등의 동작에 필요한 각종 프로그램이나 데이터를 저장하고 있다. 골프코스 정보 저장부와 골프코스 제작부는 사용자가 직접 골프코스를 제작할 수 있도록 작동한다. 이들 구성은 전술한 골프코스 제작장치에 있어서의 대응구성과 동일/유사한 동작을 하며, 이들에 대한 상세 설명은 생략한다. 감지부는 골프클럽의 움직임이나 사용자가 타격한 골프공의 움직임 등을 감지하여 산출과정에 필요한 정보 를 파악하기 위한 것으로, 감지부로서 골프클럽이나 골프공의 움직임 등을 촬영할 수 있는 카메라나 감지센 서 등의 감지수단이 사용될 수 있다. 상기 감지수단에는 이미지 센싱, 발광/수광 센싱, 레이저 센싱 등 다양한 센싱 방식이 적용될 수 있고, 이러한 센싱 방식으로 골프클럽이나 사용자가 타격한 골프공의 상태 정보를 파악 할 수 있다. 상기 카메라나 감지센서 등은 단독으로 사용되거나 함께 사용될 수 있고, 또한 1대만 사용되거나 여러 대가 사용될 수 있다. 감지부를 통하여 얻어진 정보는 제어부에 전달되어 산출과정에 사용된다. 입력부는 사용자로부터 각종 정보를 입력받기 위한 것으로 키보드나 마우스 등이 사용될 수 있다. 예를 들 면, 로그인을 위한 아이디나 패스워드를 입력할 때, 플레이 하고자 하는 골프코스나 플레이 난이도 등을 선택할 때 등에 입력부가 사용될 수 있다. 사운드부는 스피커 등과 같은 음향기기를 포함할 수 있고, 이를 통하여 사용자에게 게임의 진행 상황을 안 내하고 게임의 진행에 따른 각종 효과음을 재생하는 역할을 한다. 표시부는 프로젝터와 스크린 등과 같은 디스플레이 동작을 위한 기기를 포함한다. 프로젝터는 골프코스와 골프공의 영상이 스크린에 디스플레이되도록 골프 관련 영상을 스크린에 투사하며, 스크린은 투사된 골프 관련 영상을 디스플레이하여 사용자에게 보여주는 역할을 한다. 도면에 도시되어 있지는 않지만, 표시부는 스크 린이외에 보조 디스플레이 역할을 하는 키오스크 등과 같은 표시기기를 더 포함할 수 있다. 본 명세서에서는 스크린에 디스플레이되는 일부 대상에 대해 편의상 '가상'이라는 용어를 붙여서 표현하는 경우 가 있을 수 있다. 이는 현실 세계에 존재하는 것이 아니고 스크린 속 영상으로 디스플레이되는 것이라는 의미로 사용되는 것이고, 예를 들어 '가상의 골프코스'란 스크린에 디스플레이되는 골프코스라는 의미이고 '가상의 골 프공'이란 스크린에 디스플레이되는 골프공이라는 의미이다. 가상 골프 장치는 스크린 골프장 등에 설치되어 스크린 골프를 플레이할 수 있도록 하는 장치이며, 사용자가 스 크린 골프를 플레이할 때에 가상 골프 장치는 다음과 같이 동작한다. 사용자가 골프공을 타격하면 감지부에 서 골프클럽의 움직임이나 사용자가 타격한 골프공의 이동속도나 이동방향 등과 같은 골프공의 상태를 나타내는 파라미터들을 감지한다. 감지부에 의하여 감지된 파라미터 정보는 제어부에 전달되고, 제어부의 산 출부는 전달된 정보에 의거하여 산출과정을 수행한다. 표시부에서는 산출과정에서 산출된 궤적대로 가 상의 골프공이 움직이는 영상을 표시하며, 이때에 가상의 골프공은 산출된 궤적으로 이동한 후 스크린 속 가상 의 골프코스의 특정지점에 착지하게 되고, 사용자는 가상의 골프공이 착지된 지점에서 넥스트 타격을 이어가게된다. 본 실시예의 가상 골프 장치에 의하면, 골프코스 정보 저장부와 골프코스 제작부가 구비됨으로써 사용 자가 직접 자신이 원하는대로 골프코스를 제작할 수 있다. 따라서 본 실시예의 가상 골프 장치는 스크린 골프를 플레이하기 위한 용도(스크린 골프를 플레이할 때에는 사용자 제작 골프코스 또는 가상 골프 장치가 구비하고 있는 기존의 골프코스를 이용할 수 있음) 및 골프코스를 제작하기 위한 용도로 함께 사용될 수 있다. 본 실시예 의 가상 골프 장치에는 골프코스 정보 저장부와 골프코스 제작부만 구비되어 있지만, 전술한 골프코스 제작장치에 있어서의 골프코스 평가부, 골프코스 제작 어드바이서 및 골프코스 제작 매니저 중 적어도 어느 하 나가 더 구비되어 있을 수 있다. 도 18은 본 발명의 다른 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 18을 참조하면, 본 실시예에 따른 가상 골프 장치는 복수의 부스(101, 102, 103)를 포함한다. 각 부스(101, 102, 103)는 모두 동일하게 구성되어 있다. 예를 들면, 첫번째 부스는 타격 플레이트(101a), 키오스크 화 면이 구비되며 전술한 제어부의 역할을 할 수 있는 시뮬레이터 기기(101b), 스크린(101c) 등을 가지고 있고, 다 른 부스(102, 103)도 동일한 구성품을 가지고 있다. 도면에 도시되어 있지는 않지만, 각 부스(101, 102, 103)에 는 타격시 골프클럽/골프공의 움직임을 감지하기 위한 카메라 등의 다른 기기가 더 구비되어 있다. 각 부스 (101, 102, 103)에서는 다수의 사용자가 번갈아가면서 골프를 플레이할 수 있다. 또는 각 부스(101, 102, 103) 에서는 사용자 혼자서 다른 부스의 사용자와 이격되어 있는 상태에서 솔로로 플레이할 수 있다. 본 실시예에 따 른 가상 골프 장치에 있어서 시뮬레이터 기기(101b)에는 전술한 바와 같은 골프코스 정보 저장부와 골프코스 제 작부가 구비되어 있을 수 있고, 이를 통하여 사용자가 직접 자신이 원하는대로 골프코스를 제작할 수 있다. 즉 본 실시예의 가상 골프 장치는 스크린 골프를 플레이하기 위한 용도(스크린 골프를 플레이할 때에는 사용자 제 작 골프코스 또는 가상 골프 장치가 구비하고 있는 기존의 골프코스를 이용할 수 있음) 및 골프코스를 제작하기 위한 용도로 함께 사용될 수 있다. 또한 본 실시예의 가상 골프 장치에는 골프코스 정보 저장부와 골프코스 제 작부 이외에도, 전술한 골프코스 제작장치에 있어서의 골프코스 평가부, 골프코스 제작 어드바이서 및 골프코스 제작 매니저 중 적어도 어느 하나가 더 구비되어 있을 수 있다. 도 19는 본 발명의 실시예에 따른 가상 골프 시스템의 개략적인 구조를 나타내는 도면이고, 도 20은 사용자 제 작 골프코스를 선택하는 메뉴 화면을 예시적으로 나타내는 도면이다. 도 19를 참조하면, 본 발명의 실시예에 따른 가상 골프 시스템은 가상 골프 장치와 서비스 장치를 포 함한다. 가상 골프 장치로서 도 17 또는 도 18 등에 도시되어 있는 것과 같은 가상 골프 장치 등이 사용될 수 있다. 가상 골프 장치는 스크린 골프를 플레이할 수 있는 스크린 골프장에 설치되며, 스크린 골프장이 여러 곳에 있는 경우에 가상 골프 장치는 각 스크린 골프장마다 설치되어 전체적으로 복수개가 구비되어 있을 수 있다. 가상 골프 장치는 서비스 장치와 유무선 통신망 등을 통하여 연결되어 있다. 서비스 장치는 복수의 스크린 골프장을 운영하는 서비스 업자가 복수의 스크린 골프장에 구비되어 있는 가상 골프 장치를 관리하기 위하여 사용하는 중앙서버를 포함할 수 있다. 서비스 장치는 저장부와 골프코스 제작장치를 포함한다. 저장부는 사용자 정보를 비롯한 여러가지 정보를 저장하고 있다. 스크린 골프 서비스를 이용하고자 하는 사용자는 상기 서비스를 제공받기 위하여 먼저 로그인을 하도록 할 수 있는데, 서비스 장치는 로그인을 할 때에 사용자의 신원을 확인하고 로그인의 승인 여부를 결정하는 역할을 할 수 있다. 저장부는 사용자의 신 원을 확인하는 데에 필요한 정보를 저장하고 있다. 저장부에는 복수의 사용자에 대한 다양한 정보가 각 사 용자별로 구분되어 저장된다. 저장부에 저장되는 사용자 정보는 사용자의 신원을 확인하기 위한 신상정보, 사용 자가 스크린 골프장에서 플레이했을 때의 정보(플레이한 골프장, 플레이 난이도, 스코어 등과 같은 플레이 결과, 플레이 결과로부터 계산되는 평균비거리, 페어웨이 안착률 등과 같은 플레이 기록 등) 등을 포함할 수 있 다. 이와 같이 저장부에 사용자 정보가 저장됨으로써, 서비스 장치에 유선 및/또는 무선상으로 연결 되어 있는 가상 골프 장치들은 저장부에 저장되어 있는 정보를 이용할 수 있고, 가상 골프 장치(10 0)들 각각에서는 사용자의 정보를 별도로 저장할 필요가 없다. 골프코스 제작장치는 골프코스 정보 저장부, 골프코스 제작부, 골프코스 평가부, 골프코스 제작 어드바이서를 포함하며, 이들은 구성은 전술한 골프코스 제작장치에 있어서의 대응구성과 큰 차이가 없으므로, 이들에 대한 상세설명은 생략한다. 골프코스 제작장치가 구비되어 있는 서비스 장치가 유선 및/또는 무선상으로 가상 골프 장치들 에 연결되어 있으므로, 사용자는 가상 골프 장치에서 자신이 원하는 골프코스를 직접 제작할 수 있다. 즉 본 실시예 따르면 가상 골프 장치는 스크린 골프를 플레이하기 위한 용도(스크린 골프를 플레이할 때에는 사용자 제작 골프코스 또는 가상 골프 장치가 구비하고 있는 기존의 골프코스를 이용할 수 있음) 및 골프코스를 제작하기 위한 용도로 함께 사용될 수 있다. 또한 본 실시예의 가상 골프 시스템에 있어서, 골프코스 제작장치 에는 전술한 골프코스 제작장치에 있어서의 골프코스 제작 매니저가 더 구비되어 있을 수 있다. 또는 골프 코스 제작장치에 골프코스 평가부, 골프코스 제작 어드바이서 및 골프코스 제작 매니저가 모두 구비되어 있을 필요는 없고, 이들 중 적어도 일부만이 구비되어 있을 수도 있다. 또한 상기한 골프코스 제작장 치가 서비스 장치에 구비되는 대신에 각각의 가상 골프 장치에 구비되도록 구성할 수도 있다. 또는 상기한 골프코스 제작장치의 전체 구성 중 일부는 서비스 장치에 구비되고 나머지는 각각의 가 상 골프 장치에 구비되도록 구성할 수도 있다. 골프코스 제작장치에서 사용자가 제작한 골프코스는 저장부에 저장될 수 있고, 저장부에 저장되 어 있는 사용자 제작 골프코스는 가상 골프 장치를 이용하는 다른 사용자가 스크린 골프 플레이시에 이용 할 수 있다. 도 20을 참조하면, 가상 골프 장치에서 스크린 골프를 플레이하는 사용자는 플레이에 앞서서 여러가지 플 레이 옵션을 선택할 수 있고, 스크린이나 또는 키오스크 등과 같은 보조 디스플레이에는 상기 플레이 옵션 선택 을 위한 메뉴화면이 표시된다. 예를 들면, 사용자는 스크린에 표시되는 거리 정보를 나타내는 단위(미터, 야드 등), 멀리건의 횟수, 컨시드의 인정 범위, 스크린에 표시하는 티의 색깔, 골프공의 크기, 골프공의 색깔, 플레 이 중에 발생하는 사운드의 크기 등을 메뉴화면에서 선택할 수 있다. 또한 사용자는 자신이 플레이할 골프장을 선택할 수 있는데, 상기 골프장은 다른 사용자가 제작한 골프장을 포함한다. 도 20에 도시되어 있는 바와 같이, 사용자 제작 골프장을 선택할 때에는 해당 골프장을 누가 제작하였는지, 해당 골프장이 얼마나 이용되었는지, 해당 골프장을 이용한 다른 사용자의 평점 등이 표시되도록 할 수 있다. 위와 같이, 특정 사용자가 제작한 골프코스는 다른 사용자가 스크린 골프를 플레이할 때에 이용할 수 있는데, 이는 특정 사용자가 창작한 일종의 저작물을 다른 사용자가 사용하는 것이라 볼 수 있다. 따라서 서비스 장치 에는 저작권자라 볼 수 있는 골프코스 제작 사용자에게 소정의 보상을 수여하는 수단이 구비되어 있을 수 있다. 상기 보상의 종류나 양은 제작된 골프코스가 다른 사용자에게 얼마나 자주 이용되었는지에 따라 달라지게 책정될 수 있다. 예를 들면, 사용자가 가상 골프 장치를 이용하여 스크린 골프를 플레이하기 위해서 사용자에게 스크린 골프장 이용료를 부과하는 경우, 골프코스를 제작한 사용자에게는 상기 이용료를 할인하거나 면제해 줄 수 있다. 또한 제작된 골프코스의 사용횟수가 많을수록 또는 제작된 골프코스을 이용한 후의 평가가 좋을수록 상기 할인비용이 커지게 하거나, 이용횟수가 매우 많거나 이용후 평가가 아주 좋은 경우에는 상기 이용료를 면 제해주거나 할 수 있다. 도 21은 본 발명의 다른 실시예에 따른 가상 골프 시스템의 개략적인 구조를 나타내는 도면이다. 도 21을 참조하면, 본 발명의 실시예에 따른 가상 골프 시스템은 가상 골프 장치와 서비스 장치와 단 말장치를 포함한다. 가상 골프 장치로서 도 17 또는 도 18 등에 도시되어 있는 것과 같은 가상 골프 장치 등이 사용될 수 있고, 가상 골프 장치는 서비스 장치와 유무선 통신망 등을 통하여 연결되어 있 다. 서비스 장치는 복수의 스크린 골프장을 운영하는 서비스 업자가 복수의 스크린 골프장에 구비되어 있 는 가상 골프 장치를 관리하기 위하여 사용하는 중앙서버를 포함할 수 있다. 서비스 장치는 여러가지 형태의 다양한 단말장치에서 접속될 수 있다. 단말장치는 유무선 통신망을 통하여 서비스 장치 에 접속할 수 있는 기기이며, 웹 브라우저(WEB Browser)가 탑재된 스마트폰, 데스크탑 컴퓨터, 태블릿 컴퓨터, 노트북 등이 단말장치로서 사용될 수 있다. 서비스 장치에는 저장부와 골프코스 제작 매니저가 구비되며, 단말장치에는 골프코스 제작 장치가 구비되고, 골프코스 제작장치는 골프코스 정보 저장부, 골프코스 제작부, 골프코스 평가부를 포함한다. 골프코스 정보 저장부, 골프코스 제작부, 골프코스 평가부는 전술한 실시예의 골프코스 제작장치에서의 대응구성과 동일/유사하게 작동하며, 이들에 대한 상세설명은 생략한다. 저장부는 사용자 정보를 비롯한 여러가지 정보를 저장하고 있고, 이는 전술한 실시예에 있어서의 저장부와 동일하거나 유사하게 작동한다. 골프코스 제작 매니저는 사용자가 골프코스를 제작함에 있어서 사용자에게 제작 레벨을 부여하고 또한 상기 사용자 제작 레벨에 따라 사용자가 제작하는 골프코스에 대해서 플레이 난이도 의 상한값을 설정하는 역할을 한다. 전술한 실시예의 골프코스 제작장치에서는 골프코스 제작 매니저와 함 께 사용자 정보 저장부가 구비되어 있었는데, 본 실시예에서는 저장부가 상기 사용자 정보 저장부의 역할을 수행할 수 있다. 골프코스 제작장치는 사용자가 자신의 단말장치로 서비스 장치에 접속하여 관련 프로그램을 다 운로드하여 실행시킴으로써, 단말장치에 구비되도록 할 수 있다. 또는 사용자가 상기 프로그램을 서비스 장치가 아닌 다른 소스에서 입수하여 단말장치에서 실행시킴으로써 골프코스 제작장치가 단말장 치에 구비되도록 할 수도 있다. 사용자는 스마트폰이나 컴퓨터 등과 같이 자신의 보유한 단말장치에 골프코스 제작장치가 구비되도록 함으로써 보다 편리하게 골프코스를 제작할 수 있다. 본 실시예에서는 골프코스 제작과 관련하여 골프코스 제작 매니저, 골프코스 정보 저장부, 골프코스 제작부, 골프코스 평가부가 구비되어 있는데, 도면에 도시되어 있지는 않지만, 서비스 장치 또 는 단말장치에는 전술한 실시예에 있어서의 골프코스 제작 어드바이서가 구비되어 있을 수 있다. 또한 여 기에서 언급되어 있는 구성은 반드시 모두 구비되어 있을 필요는 없고, 이들 중 적어도 일부만이 구비되어 있을 수도 있다. 또한 상기한 골프코스 제작장치가 단말장치뿐만 아니라 서비스 장치나 가상 골프 장 치에 구비되도록 구성할 수도 있다. 또는 상기한 골프코스 제작장치의 전체 구성 중 일부는 서비스 장치에 구비되고 나머지는 가상 골프 장치에 구비되도록 구성할 수도 있다. 위와 같이 본 발명의 구체적인 실시예들을 살펴보았지만, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점 은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0049543", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 골프코스 제작장치의 개략적인 구성을 나타내는 도면이다. 도 2는 골프코스 정보 저장부의 상세구조를 예시적으로 나타내는 도면이다. 도 3 및 도 4는 골프코스 제작부에 있어서 골프코스를 제작하기 위한 사용자 인터페이스 화면을 예시적으로 나 타내는 도면이다. 도 5는 골프코스 평가부에서 인공지능을 이용하여 골프코스를 평가하는 방법을 설명하기 위한 도면이다. 도 6은 골프코스 평가부에서 골프코스 평가에 사용될 수 있는 판단자료를 설명하기 위한 도면이다. 도 7은 본 발명의 다른 실시예에 따른 골프코스 제작장치의 개략적인 구성을 나타내는 도면이다. 도 8은 골프코스 제작부에 있어서 골프코스를 제작하기 위한 인터페이스 화면을 예시적으로 나타내는 도면이다. 도 9는 본 발명의 또 다른 실시예에 따른 골프코스 제작장치의 개략적인 구성을 나타내는 도면이다. 도 10은 도 9의 골프코스 제작장치에서 사용자 제작 레벨 관련 동작과정을 예시적으로 나타내는 순서도이다. 도 11은 골프코스 제작 매니저에서 인공지능을 이용하여 사용자 제작 레벨을 평가하는 방법을 설명하기 위한 도 면이다. 도 12는 사용자 정보 저장부의 상세구조를 예시적으로 나타내는 도면이다. 도 13 내지 도 16은 골프코스 제작 매니저의 동작하에서 골프코스를 제작하기 위한 사용자 인터페이스 화면을 예시적으로 나타내는 도면이다. 도 17은 본 발명의 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다. 도 18은 본 발명의 다른 실시예에 따른 가상 골프 장치의 개략적인 구조를 나타내는 도면이다.도 19는 본 발명의 실시예에 따른 가상 골프 시스템의 개략적인 구조를 나타내는 도면이다. 도 20은 사용자 제작 골프코스를 선택하는 메뉴 화면을 예시적으로 나타내는 도면이다. 도 21은 본 발명의 다른 실시예에 따른 가상 골프 시스템의 개략적인 구조를 나타내는 도면이다."}
