{"patent_id": "10-2023-0014639", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0122003", "출원번호": "10-2023-0014639", "발명의 명칭": "종관패턴 분류를 적용한 계절 분석 장치 및 방법", "출원인": "건국대학교 산학협력단", "발명자": "최영은"}}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "종관패턴 분류를 적용한 계절 분석 방법에 있어서,분석 대상 지역의 기상 자료를 수집하고, 상기 분석 대상 지역의 종관패턴과 연계된 복수의 파라미터를 정의하는 단계;상기 기상 자료를 이용한 주성분 분석(Principal component analysis, PCA)을 수행하여 상기 복수의 파라미터와연계된 복수의 주성분을 도출하는 단계;상기 복수의 주성분을 이용하여 상기 기상 자료에 대한 군집 분석을 수행하는 단계; 및상기 군집 분석에 따라 도출된 복수의 군집 각각의 기간별 발생 빈도를 고려하여 상기 분석 대상 지역의 종관패턴에 따른 계절 변화에 대한 분석 데이터를 생성하는 단계,를 포함하는, 분석 방법."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 분석 데이터를 생성하는 단계는,기준일 전후의 소정의 기간을 포함하는 기준 기간에 상기 복수의 군집 각각의 발생 빈도를 표시한 군집 빈도 그래프를 생성하는 단계;상기 군집 빈도 그래프에 기초하여 상기 발생 빈도가 가장 높은 군집의 유형이 전환되는 상기 기준일을 상기 복수의 군집 각각에 대응하여 정의되는 계절이 변환되는 계절 변환 시점으로 특정하는 단계; 및상기 복수의 군집 각각의 최빈 발생 시기에 대한 정보와 상기 계절 변환 시점에 따른 계절별 기간에 대한 정보를 포함하는 상기 분석 데이터를 도출하는 단계,를 포함하는 것인, 분석 방법."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 복수의 군집 각각에 대응하는 계절에 대한 식별 정보를 상기 기상 자료에 대하여 라벨링한 학습 데이터를이용하여 계절 분류 모델을 학습시키는 단계;분석 대상일에 대응하여 수집된 기상 자료인 분석 대상 자료를 획득하는 단계; 및상기 분석 대상 자료 및 상기 계절 분류 모델을 이용하여, 상기 분석 대상일에 대응하는 계절 정보를 도출하는단계,를 더 포함하는 것인, 분석 방법."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 분석 대상 자료를 획득하는 단계는,상기 분석 대상일 및 상기 분석 대상일 이전의 미리 설정된 제1기간 동안 수집된 기상 자료를 상기 분석 대상자료로서 획득하는 것이고,상기 계절 정보를 도출하는 단계는,공개특허 10-2024-0122003-3-상기 분석 대상일 및 상기 분석 대상일 이후의 미리 설정된 제2기간 중 적어도 하나에 대응하는 계절에 대한 식별 정보를 상기 계절 정보로서 출력하는 것인, 분석 방법."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 계절 정보를 도출하는 단계는,상기 분석 대상 자료를 이용한 상기 주성분 분석을 수행하여 도출되는 상기 복수의 주성분을 상기 계절 분류 모델에 입력하는 단계,를 포함하는 것인, 분석 방법."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 계절 분류 모델은,서포트 벡터 머신(Support Vector Machine, SVM) 기반의 알고리즘을 포함하는 것을 특징으로 하는, 분석 방법."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 분석 데이터를 생성하는 단계는,상기 복수의 군집 중 특정 구간에서 상기 발생 빈도의 편차가 미리 설정된 임계 수준 이하에 해당하는 둘 이상의 군집을 단일 군집으로 통합하는 단계,를 포함하는 것인, 분석 방법."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 복수의 파라미터는 해면기압, 2m 기온, 10m 동서 바람성분, 10m 남북 바람성분, 전운량, 1000hPa상대습도, 850hPa 지위고도, 850hPa 기온, 850hPa 상대습도 및 500hPa 지위고도 중 적어도 하나를 포함하는 것인, 분석 방법."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "종관패턴 분류를 적용한 계절 분석 장치에 있어서,분석 대상 지역의 기상 자료를 수집하고, 상기 분석 대상 지역의 종관패턴과 연계된 복수의 파라미터를 정의하는 수집부;상기 기상 자료를 이용한 주성분 분석(Principal component analysis, PCA)을 수행하여 상기 복수의 파라미터와연계된 복수의 주성분을 도출하는 주성분 분석부;상기 복수의 주성분을 이용하여 상기 기상 자료에 대한 군집 분석을 수행하는 군집 분석부; 및상기 군집 분석에 따라 도출된 복수의 군집 각각의 기간별 발생 빈도를 고려하여 상기 분석 대상 지역의 종관패턴에 따른 계절 변화에 대한 분석 데이터를 생성하는 계절 정의부,를 포함하는, 분석 장치."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 계절 정의부는,기준일 전후의 소정의 기간을 포함하는 기준 기간에 상기 복수의 군집 각각의 발생 빈도를 표시한 군집 빈도 그공개특허 10-2024-0122003-4-래프를 생성하고, 상기 군집 빈도 그래프에 기초하여 상기 발생 빈도가 가장 높은 군집의 유형이 전환되는 상기기준일을 상기 복수의 군집 각각에 대응하여 정의되는 계절이 변환되는 계절 변환 시점으로 특정하고, 상기 복수의 군집 각각의 최빈 발생 시기에 대한 정보와 상기 계절 변환 시점에 따른 계절별 기간에 대한 정보를 포함하는 상기 분석 데이터를 도출하는 것인, 분석 장치."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 복수의 군집 각각에 대응하는 계절에 대한 식별 정보를 상기 기상 자료에 대하여 라벨링한 학습 데이터를이용하여 계절 분류 모델을 학습시키는 학습부; 및분석 대상일에 대응하여 수집된 기상 자료인 분석 대상 자료를 획득하고, 상기 분석 대상 자료 및 상기 계절 분류 모델을 이용하여, 상기 분석 대상일에 대응하는 계절 정보를 도출하는 계절 분석부,를 더 포함하는 것인, 분석 장치."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 계절 분석부는,상기 분석 대상일 및 상기 분석 대상일 이전의 미리 설정된 제1기간 동안 수집된 기상 자료를 상기 분석 대상자료로서 획득하고, 상기 분석 대상일 및 상기 분석 대상일 이후의 미리 설정된 제2기간 중 적어도 하나에 대응하는 계절에 대한 식별 정보를 상기 계절 정보로서 출력하는 것인, 분석 장치."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 계절 분석부는,상기 분석 대상 자료를 이용한 상기 주성분 분석을 수행하여 도출되는 상기 복수의 주성분을 상기 계절 분류 모델에 입력하는 것인, 분석 장치."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 계절 분류 모델은,서포트 벡터 머신(Support Vector Machine, SVM) 기반의 알고리즘을 포함하는 것을 특징으로 하는, 분석 장치."}
{"patent_id": "10-2023-0014639", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서,상기 계절 정의부는,상기 복수의 군집 중 특정 구간에서 상기 발생 빈도의 편차가 미리 설정된 임계 수준 이하에 해당하는 둘 이상의 군집을 단일 군집으로 통합하는 것인, 분석 장치."}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "종관패턴 분류를 적용한 계절 분석 장치 및 방법이 개시되며, 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 방법은, 분석 대상 지역의 기상 자료를 수집하고, 상기 분석 대상 지역의 종관패턴과 연계된 복수의 파라미터를 정의하는 단계, 상기 기상 자료를 이용한 주성분 분석(Principal component analysis, PCA)을 수행 하여 상기 복수의 파라미터와 연계된 복수의 주성분을 도출하는 단계, 상기 복수의 주성분을 이용하여 상기 기상 자료에 대한 군집 분석을 수행하는 단계 및 상기 군집 분석에 따라 도출된 복수의 군집 각각의 기간별 발생 빈도 를 고려하여 상기 분석 대상 지역의 종관패턴에 따른 계절 변화에 대한 분석 데이터를 생성하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 종관패턴 분류를 적용한 계절 분석 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "계절의 변화는 매년 반복되는 자연현상이다. 계절은 1년을 기후 상태에 따라 구분하는 것으로, 기온, 강수량, 습도 등 기후요소가 계절별로 다르게 나타난다. 이러한 계절은 인간 생활에 직접적인 영향을 미치고, 각 지역의기후 특성을 반영하며, 지역별로 다르게 구분되기도 한다. 열대지역에서는 6개월 단위의 계절 주기가 뚜렷하여 주로 건기와 우기로 계절을 구분하고, 중위도 지역에서는 4계절로 구분한다. 계절의 시종(시작일과 종료일)과 길이는 기온을 포함한 기후의 연주기를 파악할 수 있는 지표이고, 이는 기후변 화의 영향을 받아서 변할 수 있다. 한편, 전지구적인 기온 상승으로 인한 기후 시스템의 변화는 종관패턴의 발 생 시기에 영향을 미치고, 이에 따라 계절의 시종과 길이에도 변화가 나타나고 있다. 기후변화로 인한 계절 시종의 변화를 분석한 연구들은 대부분 봄 시작일이 빨라지고 가을 시작일은 늦어져서 여 름이 길어지고, 겨울이 짧아진다는 결과를 보였다. 이러한 계절의 시종과 길이를 파악하기 위해서는 계절에 대 한 명확하고 객관적인 정의가 필요하다. 계절은 천문학적인 방법, 3개월로 구분하는 기상(후)학적 방법, 식물계 절 방법, 기온과 강수량 등 기후요소를 활용한 방법, 종관패턴의 발생빈도를 고려한 방법 등으로 정의한다. 천문학적인 계절 정의는 천체의 위치에 따른 절기로 계절을 구분하여, 열적 지연으로 인해 기상 상태를 잘 반영 하지 못하는 한계가 있고, 기상(후)학적인 방법은 계절을 통계의 편의를 위해 12월에서 2월, 3월에서 5월, 6월 에서 8월, 9월에서 11월의 3개월 단위로 나눈다. 식물계절은 식물 종의 발아일과 개화일 등 특정 생장 시점에 따라 계절을 정의하는 방법으로 식물의 성장가능기간 파악 등의 특정 목적을 위해 유용하다. 한편, 기후요소를 활용하여 계절을 정의할 때, 중위도에서는 주로 기온을 사용하는데, 기온은 장기간의 관측자 료가 축적되어 있고, 식물계절과도 상관성이 있으며, 정량화가 가능하기 때문이다. 그러나 기온은 계절의 기후 특성을 구성하는 하나의 기후요소이고, 시공간적으로 변동이 크게 나타나기 때문에 기온만을 사용하여 특정 지 역의 계절을 정의하는 것은 부적절한 측면이 있다. 특히, 우리나라는 국토가 동서보다 남북으로 길고 70%가 산지로 기온의 공간분포가 복잡하기 때문에 기온만을 이용하면 좁은 지리적 공간에서 계절이 다르게 분류될 수 있다. 공간적으로 규모가 작은 우리나라에서 지역에 따라 계절이 다른 것은 사람들을 혼동시킬 수 있다. 또한, 기온을 사용한 계절 정의는 고정된 임계값에 의해 겨 울이 사라지는 경우가 발생할 수 있으며, 시공간적 변동이 크기 때문에 좁은 지역에서 계절이 달라지거나, 임계 값을 초과하는 경우가 중복해서 발생할 수 있어 변화 시점을 정하는 것이 어렵다. 이와 대비하여, 종관패턴 분류를 이용한 계절 정의 방법은 계절별로 지배적인 종관패턴을 파악하고, 그 발생빈 도를 고려하여 계절을 정의한다. 종래에는 종관패턴 분류를 수작업으로 진행하여, 시간이 많이 소요되고 정량적 인 분류가 불가능하여 재현성이 떨어지는 측면이 있었으나, 이러한 단점을 극복하기 위해 군집분석과 같은 통계 적 기법을 적용하여 정량적으로 종관패턴을 분류하는 방법이 개발되었고, 이러한 방법론이 계절을 정의하는 연 구에도 적용되고 있다. 특히, 군집분석을 적용하면 정량적인 종관패턴 분류가 가능하여, 보다 객관적으로 계절을 정의할 수 있고, 재현 이 가능해지는 장점이 있다. 종관패턴은 기온을 포함한 다양한 기후변수를 반영하여, 특정 지역에 미치는 종관 적인 대기 상태의 영향을 파악할 수 있어 계절 정의에 더 적합하다. 계절 정의는 현재 계절의 시종과 길이를 파악하고 미래의 변화를 전망하는데 적용될 수 있다. 기온을 사용한 계 절 정의는 미래 전망에 적용하기 수월하지만 앞서 언급한 단점이 존재한다. 종관패턴을 이용하면 기온을 사용 했을 때의 단점들을 극복할 수 있다. 그러나 예보와 전망 측면에서는 단점이 존재한다. 종관패턴을 이용하여 미 래 계절 시종의 변화를 전망하기 위해서는, 미래 전망 자료의 종관패턴을 분류하고 발생빈도를 산출해야 한다. 이러한 방법은 최소 1년 이상의 장기간의 자료가 필요하기 때문에 계절 시작의 예보 용도로는 활용하기 어렵다. 이러한 한계점을 극복하기 위해 특정 날짜의 종관패턴이 어떤 계절에 속하는지 분류하는 모델을 구축하는 것이 필요하다. 본원의 배경이 되는 기술은 한국등록특허공보 제10-2396283호에 개시되어 있다."}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 기온 기반의 계절 정의 방식에서의 기온의 시공 간적 변동 문제 및 고정 임계값의 사용에 따른 한계와 종래의 종관패턴을 사용한 계절 정의 방식에서 정량적으 로 종관패턴을 분류하지 못하였고, 예보에서 활용하기 어렵다는 단점을 극복하여 종합적인 기후 특성을 반영하 는 계절을 정의하고, 계절 분류 모델을 구축할 수 있는 종관패턴 분류를 적용한 계절 분석 장치 및 방법을 제공 하려는 것을 목적으로 한다.다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계 절 분석 방법은, 분석 대상 지역의 기상 자료를 수집하고, 상기 분석 대상 지역의 종관패턴과 연계된 복수의 파 라미터를 정의하는 단계, 상기 기상 자료를 이용한 주성분 분석(Principal component analysis, PCA)을 수행하 여 상기 복수의 파라미터와 연계된 복수의 주성분을 도출하는 단계, 상기 복수의 주성분을 이용하여 상기 기상 자료에 대한 군집 분석을 수행하는 단계 및 상기 군집 분석에 따라 도출된 복수의 군집 각각의 기간별 발생 빈 도를 고려하여 상기 분석 대상 지역의 종관패턴에 따른 계절 변화에 대한 분석 데이터를 생성하는 단계를 포함 할 수 있다. 또한, 상기 분석 데이터를 생성하는 단계는, 기준일 전후의 소정의 기간을 포함하는 기준 기간에 상기 복수의 군집 각각의 발생 빈도를 표시한 군집 빈도 그래프를 생성하는 단계, 상기 군집 빈도 그래프에 기초하여 상기 발생 빈도가 가장 높은 군집의 유형이 전환되는 상기 기준일을 상기 복수의 군집 각각에 대응하여 정의되는 계 절이 변환되는 계절 변환 시점으로 특정하는 단계 및 상기 복수의 군집 각각의 최빈 발생 시기에 대한 정보와 상기 계절 변환 시점에 따른 계절별 기간에 대한 정보를 포함하는 상기 분석 데이터를 도출하는 단계를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 방법은, 상기 복수의 군집 각각에 대응하는 계절에 대한 식별 정보를 상기 기상 자료에 대하여 라벨링한 학습 데이터를 이용하여 계절 분류 모델을 학습시 키는 단계, 분석 대상일에 대응하여 수집된 기상 자료인 분석 대상 자료를 획득하는 단계 및 상기 분석 대상 자 료 및 상기 계절 분류 모델을 이용하여, 상기 분석 대상일에 대응하는 계절 정보를 도출하는 단계를 포함할 수 있다. 또한, 상기 분석 대상 자료를 획득하는 단계는, 상기 분석 대상일 및 상기 분석 대상일 이전의 미리 설정된 제1 기간 동안 수집된 기상 자료를 상기 분석 대상 자료로서 획득할 수 있다. 또한, 상기 계절 정보를 도출하는 단계는, 상기 분석 대상일 및 상기 분석 대상일 이후의 미리 설정된 제2기간 중 적어도 하나에 대응하는 계절에 대한 식별 정보를 상기 계절 정보로서 출력할 수 있다. 또한, 상기 계절 정보를 도출하는 단계는, 상기 분석 대상 자료를 이용한 상기 주성분 분석을 수행하여 도출되 는 상기 복수의 주성분을 상기 계절 분류 모델에 입력하는 단계를 포함할 수 있다. 또한, 상기 계절 분류 모델은 서포트 벡터 머신(Support Vector Machine, SVM) 기반의 알고리즘을 포함할 수 있 다. 또한, 상기 분석 데이터를 생성하는 단계는, 상기 복수의 군집 중 특정 구간에서 상기 발생 빈도의 편차가 미리 설정된 임계 수준 이하에 해당하는 둘 이상의 군집을 단일 군집으로 통합하는 단계를 포함할 수 있다. 또한, 상기 복수의 파라미터는 해면기압, 2m 기온, 10m 동서 바람성분, 10m 남북 바람성분, 전운량, 1000hPa 상 대습도, 850hPa 지위고도, 850hPa 기온, 850hPa 상대습도 및 500hPa 지위고도 중 적어도 하나를 포함할 수 있다. 한편, 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 장치는, 분석 대상 지역의 기상 자료를 수집 하고, 상기 분석 대상 지역의 종관패턴과 연계된 복수의 파라미터를 정의하는 수집부, 상기 기상 자료를 이용한 주성분 분석(Principal component analysis, PCA)을 수행하여 상기 복수의 파라미터와 연계된 복수의 주성분을 도출하는 주성분 분석부, 상기 복수의 주성분을 이용하여 상기 기상 자료에 대한 군집 분석을 수행하는 군집 분 석부 및 상기 군집 분석에 따라 도출된 복수의 군집 각각의 기간별 발생 빈도를 고려하여 상기 분석 대상 지역 의 종관패턴에 따른 계절 변화에 대한 분석 데이터를 생성하는 계절 정의부를 포함할 수 있다. 또한, 상기 계절 정의부는, 기준일 전후의 소정의 기간을 포함하는 기준 기간에 상기 복수의 군집 각각의 발생 빈도를 표시한 군집 빈도 그래프를 생성하고, 상기 군집 빈도 그래프에 기초하여 상기 발생 빈도가 가장 높은 군집의 유형이 전환되는 상기 기준일을 상기 복수의 군집 각각에 대응하여 정의되는 계절이 변환되는 계절 변환 시점으로 특정하고, 상기 복수의 군집 각각의 최빈 발생 시기에 대한 정보와 상기 계절 변환 시점에 따른 계절 별 기간에 대한 정보를 포함하는 상기 분석 데이터를 도출할 수 있다.또한, 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 장치는 상기 복수의 군집 각각에 대응하는 계절에 대한 식별 정보를 상기 기상 자료에 대하여 라벨링한 학습 데이터를 이용하여 계절 분류 모델을 학습시 키는 학습부 및 분석 대상일에 대응하여 수집된 기상 자료인 분석 대상 자료를 획득하고, 상기 분석 대상 자료 및 상기 계절 분류 모델을 이용하여, 상기 분석 대상일에 대응하는 계절 정보를 도출하는 계절 분석부를 포함할 수 있다. 또한, 상기 계절 분석부는, 상기 분석 대상일 및 상기 분석 대상일 이전의 미리 설정된 제1기간 동안 수집된 기 상 자료를 상기 분석 대상 자료로서 획득하고, 상기 분석 대상일 및 상기 분석 대상일 이후의 미리 설정된 제2 기간 중 적어도 하나에 대응하는 계절에 대한 식별 정보를 상기 계절 정보로서 출력할 수 있다. 또한, 상기 계절 분석부는, 상기 분석 대상 자료를 이용한 상기 주성분 분석을 수행하여 도출되는 상기 복수의 주성분을 상기 계절 분류 모델에 입력할 수 있다. 또한, 상기 계절 정의부는, 상기 복수의 군집 중 특정 구간에서 상기 발생 빈도의 편차가 미리 설정된 임계 수 준 이하에 해당하는 둘 이상의 군집을 단일 군집으로 통합할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 기온 기반의 계절 정의 방식에서의 기온의 시공간적 변동 문제 및 고 정 임계값의 사용에 따른 한계와 종래의 종관패턴을 사용한 계절 정의 방식에서 정량적으로 종관패턴을 분류하 지 못하였고, 예보에서 활용하기 어렵다는 단점을 극복하여 종합적인 기후 특성을 반영하는 계절을 정의하고, 계절 분류 모델을 구축할 수 있는 종관패턴 분류를 적용한 계절 분석 장치 및 방법을 제공할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 종관패턴 분류를 적용한 계절 분석 장치 및 방법에 관한 것이다. 도 1은 본원의 일 실시예에 따른 계절 분석 시스템의 개략적인 구성도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 계절 분석 시스템은 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 장치(이하, '계절 분석 장치'라 한다.), 기상 정보 데이터베이스, 기상 정보 수집 서버 및 사용자 단말을 포함할 수 있다. 계절 분석 장치, 기상 정보 데이터베이스, 기상 정보 수집 서버 및 사용자 단말 상호간은 네트워크를 통해 통신할 수 있다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호간에 정보 교 환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 사용자 단말은 예를 들면, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치일 수 있다. 예를 들어, 사용자 단말은 본원에서 개시하는 계절 분석 장치에 의해 도출된 분석 대상일에 대응하는 계절 정보를 출력하기 위한 디바이스일 수 있다. 도 2는 분석 대상 지역을 예시적으로 나타낸 도면이다. 도 2를 참조하면, 본원에서 개시하는 계절 분석 장치는 종관패턴 분류 및 계절 분류 모델 구축을 위한 기 상 자료(예를 들면, ERA5 자료, ASOS(종관 기상관측망) 자료 등)를 수집하는 지역적 범위를 20 내지 60°N, 100 내지 150°E 영역(예를 들면, 국내 기상청 분석 일기도 영역)으로 설정할 수 있으나, 이에만 한정되는 것은 아 니다. 이와 관련하여, 계절 분석 장치는 설정된 분석 대상 지역의 기상 자료를 수집할 수 있다. 예를 들어, 계절 분석 장치는 기상 정보 데이터베이스로부터 설정된 분석 대상 지역의 특정 자료 기간의 기상 자료를 획득(수신)하는 것일 수 있다. 이하에서는 도 3 내지 도 10을 참조하여 계절 분석 장치의 구체적인 기능 및 동작에 대하여 설명하도록 한 다. 도 3은 분석 대상 지역의 종관패턴과 연계된 복수의 파라미터를 이용한 주성분 분석 및 군집 분석을 통한 계절 정의 프로세스를 설명하기 위한 개념도이다. 도 3을 참조하면, 계절 분석 장치는 수집된 분석 대상 지역의 기상 자료를 이용하여 분석 대상 지역의 종 관패턴과 연계된 복수의 파라미터를 정의할 수 있다. 이와 관련하여 본원의 일 실시예에 따르면, 복수의 파라미터는 해면기압, 2m 기온, 10m 동서 바람성분, 10m 남북 바람성분, 전운량, 1000hPa 상대습도, 850hPa 지위고도, 850hPa 기온, 850hPa 상대습도 및 500hPa 지위고도 중 적어도 하나의 대기 변수를 포함할 수 있으나, 이에만 한 정되는 것은 아니다. 또한, 계절 분석 장치는 수집된 기상 자료를 이용한 주성분 분석(Principal component analysis, PCA)을 수행하여 복수의 파라미터와 연계된 복수의 주성분을 도출할 수 있다. 주성분 분석은 후술하는 군집 분석에 필 요한 자료의 차원 축소와 각 변수의 주요한 특성 추출 및 다중공선성 제거를 위해 적용될 수 있으며, 이러한 주 성분 분석은 다수의 변수를 포함하는 고차원의 자료의 경우, 차원의 증가에 따라 필요한 표본의 수, 계산시간, 전산 자원 등이 지수적으로 증가하는 현상인 차원의 저주의 발생을 방지하기 위한 차원 축소 기법으로서 적용될 수 있다. 보다 구체적으로, 계절 분석 장치는 원자료인 기상 자료의 분산을 최대한 보존하면서 고차원의 자료를 서 로 직교하는 저차원의 공간에 사용(Projection)시켜 자료를 축소할 수 있으며, 여기서 사용 공간은 원자료 공분 산 행렬(covariance matrix)의 고유값(eigenvalue)이 큰 고유 벡터(eigenvector)를 축으로 하며, 이 축을 기준 으로 변환된 자료가 주성분(PC)에 해당한다. 또한, 본원의 일 실시예에 따르면, 계절 분석 장치는 ERA5 데이터를 기상 자료로서 활용하되, ERA5 자료가 1시간 단위로 제공되는 점을 고려하여, ERA5 자료의 24시간 평균을 연산하여 일자료로 변환하고, 일자료의 노이 즈를 제거하기 위해 5일 이동평균을 적용하여 평활하고, 주성분의 경우, 입력될 변수들의 평균과 분산이 서로 다른 경우 분산이 큰 변수로 인하여 주요 PC가 결정될 수 있는 점을 고려하여 서로 단위가 다른 복수의 파라미 터를 표준화(Standardization)한 후 주성분 분석을 수행하도록 동작할 수 있다. 달리 말해, 계절 분석 장치 는 수집된 기상 자료에 5일 이동평균 및 표준화를 적용하는 전처리를 수행할 수 있다. 한편, 본원의 일 실시예에 따르면, 각각의 주성분은 설명력이 큰 순서로 나타낼 수 있으며, 이 때 계절 분석 장 치가 분석에 사용할 주성분(PC)의 수를 선정하기 위하여 총 분산에 대한 누적 설명력 비율(cumulative percentage of total variation, CPV)을 연산할 수 있다. 보다 구체적으로, 누적 설명력 비율(CPV)은 하기 식 1을 통해 연산될 수 있다. [식 1]"}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, tm은 CPV 값이고, lk는 k번째 PC의 분산이고, m은 선택된 PC의 수이고, p는 전체 차원 수를 의미할 수 있다. 보다 구체적으로 계절 분석 장치는 미리 설정된 CPV의 임계값을 의미하는 t*을 넘는 최초의 m을 선 정함으로써 주성분의 개수를 결정할 수 있으며, t*는 70%, 80%, 90% 등의 값으로 설정될 수 있다. 이와 관련하여 도 4는 주성분 분석에 의해 도출되는 복수의 주성분의 개수를 결정하는 프로세스를 설명하기 위 한 그래프이다. 구체적으로, 도 4는 각 주성분(PC) 별 고유값의 스크리 그래프를 도시한 그래프이다. 도 4를 참조하면, 본원의 일 실시예에 따른 계절 분석 장치는 13번째 주성분(13번 PC) 이후에는 각각의 주 성분이 전체 분산의 1% 미만의 설명력을 나타내기 때문에, 70%에 해당하는 8개의 주성분을 선택할 수 있다. 또한, 계절 분석 장치는 복수의 주성분을 이용하여 수집된 기상 자료에 대한 군집 분석을 수행할 수 있다. 즉, 계절 분석 장치는 산출된 주성분을 이용하여 기상 자료에 대한 군집 분석을 수행하여 종관 대기 상태 를 분류할 수 있으며, 예시적으로 군집 분석 방식은 분할(partitioning) 기반 군집 분석, 계층적(hierarchical) 군집 분석, 밀도(density) 기반 군집 분석, 격자(grid) 기반 군집 분석, 모델 기반 군집 분석 등을 적용할 수 있다. 또한, 본원의 일 실시예에 따르면, 계절 분석 장치는 알고리즘이 상대적으로 단순하여 필요한 계산 자원과 매개변수가 적고, 적용이 쉬운 장점을 가지는 K-평균(K-means) 군집 분석을 적용할 수 있다. 이와 관련하여 도 5는 군집 분석에 의해 도출되는 복수의 군집의 개수를 결정하는 프로세스를 설명하기 위한 그 래프이다.도 5를 참조하면, 계절 분석 장치에 의해 수행되는 K-평균 군집분석에서는 군집 수를 나타내는 매개변수 k 를 미리 정의해야 하고, 최적의 k 값을 정의하기 위해 갭(Gap) 통계량을 사용할 수 있다. 보다 구체적으로 갭 통계량은 원자료의 범위에 해당하는 균일 분포(uniform distribution)를 기준 분포(reference distribution)로 이용하여 기준 분포에서 산출된 군집 내 분산도의 기대값과 원자료의 군집 내 분산도를 비교하여 정의될 수 있 다. 구체적으로 도 5를 참조하면, 본원의 일 실시예에 따른 계절 분석 장치는 갭 통계량 결과를 기초로 하여 최적 군집 수를 7개로 선정할 수 있으나, 이에만 한정되는 것은 아니다. 도 6은 복수의 군집 각각에 대한 제1주성분 및 제2주성분의 분포를 나타낸 그래프이고, 도 7a 및 도 7b는 복수 의 군집 각각에 대한 제1주성분 내지 제8주성분 각각의 분포를 나타낸 그래프이다. 도 6 내지 도 7b를 참조하면, 계절 분석 장치는 8개의 주성분(제1주성분 내지 제8주성분)을 기초로 하여 7 개의 군집을 분류할 수 있으며, 각각의 군집은 본원의 실시예에 관한 설명에서 특정 계절의 특성을 반영하는 종 관 패턴에 대응될 수 있다. 또한, 도 6 내지 도 7b를 참조하면, 제1주성분(PC1)과 제2주성분(PC2)의 산포도에서 각 군집이 잘 분리되어 분 포하는 것을 확인할 수 있으며, 도 6에서는 상대적으로 군집 2와 군집 3은 일부 겹쳐지는 것을 확인할 수 있으 나, 도 7a를 참조하면, 군집 2와 군집 3은 제4주성분(PC4)에서 명확한 차이를 보이는 것을 확인할 수 있다. 달 리 말해, 주성분 분석 및 군집 분석을 통해 도출된 각각의 군집은 전체적으로 설명력이 가장 큰 제1주성분(PC 1)에 의해 구분되되, 세부적으로 나머지 주성분들의 영향을 받는 형태를 보인다. 또한, 계절 분석 장치는 도출된 복수의 군집 각각의 기간별 발생 빈도를 고려하여 분석 대상 지역의 종관 패턴에 따른 계절 변화에 대한 분석 데이터를 생성할 수 있다. 이와 관련하여 도 8은 복수의 군집 각각의 발생 빈도를 표시한 군집 빈도 그래프를 예시적으로 나타낸 도면이다. 도 8을 참조하면, 계절 분석 장치는 기준일 전후의 소정의 기간을 포함하는 기준 기간에 복수의 군집 각각 의 발생 빈도를 표시한 군집 빈도 그래프를 생성할 수 있다. 또한, 계절 분석 장치는 생성된 군집 빈도 그 래프에 기초하여 발생 빈도가 가장 높은 군집의 유형이 전환되는 기준일을 복수의 군집 각각에 대응하여 정의되 는 계절이 변환되는 계절 변환 시점으로 특정할 수 있다. 또한, 계절 분석 장치는 복수의 군집 각각의 최빈 발생 시기에 대한 정보와 계절 변환 시점에 따른 계절별 기간에 대한 정보를 포함하는 분석 데이터를 도출할 수 있다. 구체적으로 도 8을 참조하면, 각 군집의 반순별 발생빈도를 살펴보면, 각 군집은 특정 시기에 밀접하여 나타나 는 것을 확인할 수 있고, 각각의 군집이 발생빈도가 높은 시기는 서로 다르게 나타나나, 군집 2 및 군집 3은 다 른 군집들 대비 상대적으로 발생 시기가 겹치는 정도가 큰 것을 확인할 수 있다. 한편, 도 8에 도시된 7개의 군집 각각은, 군집 1은 6월 상순에서 9월 상순까지가 최빈 발생 시기이며, '여름 종 관 특성'으로 지칭할 수 있고, 군집 2는 2월 중순에서 2월 하순까지가 최빈 발생 시기이며, '겨울 종관 특성 1'로 지칭할 수 있고, 군집 3은 12월 상순에서 2월 중순까지가 최빈 발생 시기이며, '겨울 종관 특성 2'로 지칭 할 수 있고, 군집 4는 3월 상순에서 4월 상순까지가 최빈 발생 시기이며, '봄 종관 특성 1'로 지칭할 수 있고, 군집 5는 4월 중순에서 5월 하순까지가 최빈 발생 시기이며, '봄 종관 특성 2'로 지칭할 수 있고, 군집 6은 9월 중순에서 10월 중순까지가 최빈 발생 시기이며, '가을 종관 특성 1'로 지칭할 수 있고, 군집 7은 10월 하순에서 11월 하순까지가 최빈 발생 시기 이며, '가을 종관 특성 2'로 지칭할 수 있다. 한편, 본원의 일 실시예에 따르면, 계절 분석 장치는 복수의 군집 중 특정 구간에서 발생 빈도의 편차가 미리 설정된 임계 수준 이하에 해당하는 둘 이상의 군집을 단일 군집으로 통합할 수 있다. 예를 들어 앞서 설명 한 도 8의 군집 2(겨울 종관 특성 1) 및 군집 3(겨울 종관 특성 2)은 대략 12월 상순에서 2월 하순의 기간 동안 의 발생 빈도의 편차가 다른 군집 간의 발생 빈도 간 편차 대비 적은 점을 고려하여 겨울 종관 특성을 나타내는 통합된 하나의 군집으로 병합될 수 있다. 이와 관련하여 도 9는 둘 이상의 군집을 단일 군집으로 통합한 형태의 군집 빈도 그래프를 예시적으로 나타낸 도면이다. 도 9를 참조하면, 특정 구간에서 발생 빈도의 편차가 미리 설정된 임계 수준 이하에 해당하는 둘 이상의 군집을 단일 군집으로 통합한 결과, 각각의 군집이 반영하는 특정 종관패턴이 가장 탁월하게 나타나는 시기로 각각의 계절을 명확하게 정의할 수 있으며, 이에 따라 계절 분석 장치는 군집 빈도 그래프에 기초하여 발생 빈도 가 가장 높은 군집의 유형이 전환되는 기준일을 복수의 군집 각각에 대응하여 정의되는 계절이 변환되는 계절 변환 시점으로 특정할 수 있다. 예시적으로, 계절 분석 장치는 미리 설정된 임계 기간인 11일을 기준으로, 11일 간 가장 빈번하게 발생한 군집의 유형이 바뀌는 기준일을 해당 두 군집에 따른 계절의 변환이 발생한 시점으로 특정할 수 있다. 도 9를 참조하여 예시하면, 전술한 바와 같이 최빈 발생 시기 기준으로 명명한 '봄 종관 특성 1'은 3월 8일을 시작일로 하고, 4월 14일을 종료일로 하는 기간에 나타날 수 있고(최종 계절 명칭: 초봄), '봄 종관 특성 2'는 4월 15일을 시작일로 하고, 6월 5일을 종료일로 하는 기간에 나타날 수 있고(최종 계절 명칭: 늦봄), '여름 종 관 특성'은 6월 6일을 시작일로 하고, 9월 7일을 종료일로 하는 기간에 나타날 수 있고(최종 계절 명칭: 여름), '가을 종관 특성 1'은 9월 8일을 시작일로 하고, 10월 22일을 종료일로 하는 기간에 나타날 수 있고(최종 계절 명칭: 초가을), '가을 종관 특성 2'는 10월 23일을 시작일로 하고, 11월 28일을 종료일로 하는 기간에 나타날 수 있고(최종 계절 명칭: 늦가을), 겨울 종관 특성 1 및 겨울 종관 특성 2가 단일 군집으로 병합된 '겨울 종관 특성'은 11월 29일을 시작일로 하고, 3월 7을 종료일로 하는 기간에 나타날 수 있으나(최종 계절 명칭: 겨울), 각 군집에 따라 정의되는 계절의 시작일, 종료일, 계절 길이, 계절 변환 시점 등은 본원의 구현예에 따라서 다 르게 도출될 수 있음은 물론이다. 도 10은 전이 기간을 설명하기 위한 그래프이다. 구체적으로 도 10은 전이 기간이 존재하는 1979년도 기상 자료 에 대한 군집 빈도 그래프를 예시적으로 나타낸 도면이다. 도 10을 참조하면, 전이 기간은 두 가지 계절의 특성이 공존하여 계절 변환 시점이 명확하게 구분되지 않는 기 간으로서, 계절 분석 장치는 전이기간이 존재하는 년도에 대하여는 계절 변환 시점을 전이기간의 중간 날 짜로 결정할 수 있다. 한편, 국내에서는 겨울 시종의 변동성이 가장 크고, 여름 시종의 변동성이 가장 작게 나 타나는 특성을 보인다. 이하에서는 도 11 및 도 12를 참조하여 앞서 상세히 설명한 바와 같이 종관패턴을 고려하여 정의되는 복수의 군 집에 따른 계절에 따라 특정 시점의 계절 정보를 분류하는 인공지능 기반의 계절 분류 모델에 대하여 설명하도 록 한다. 도 11은 계절 분류 모델을 구축하기 위한 프로세스를 나타낸 개념도이다. 도 11을 참조하면, 계절 분석 장치는 복수의 군집 각각에 대응하는 계절에 대한 식별 정보를 기상 자료에 대하여 라벨링한 학습 데이터를 이용하여 계절 분류 모델을 구축(학습)할 수 있다. 또한, 도 11을 참조하면, 계절 분석 장치는 의사결정 트리(Decision Tree, DT), 랜덤 포레스트(Random Forest, RF), K-최근접 이웃 알고리즘(K-Nearest Neighbor, KNN) 또는 서포트 벡터 머신(Support Vector Machine, SVM) 기반의 계절 분류 모델을 구축할 수 있으나, 이에만 한정되는 것은 아니다. 예시적으로 서포트 벡터 머신 기반의 계절 분류 모델의 훈련을 위한 정규화 매개변수 C는 1로, 감마(γ)는 0.0000005를 사용할 수 있으나, 이에만 한정되는 것은 아니다. 계절 분석 장치는 분석 대상일에 대응하여 수집된 기상 자료인 분석 대상 자료를 획득할 수 있다. 예를 들 어, 계절 분석 장치는 분석 대상일 및 해당 분석 대상일 이전의 미리 설정된 제1기간(예를 들면, D-4 내지 D일의 5일 기간) 동안 수집된 기상 자료를 분석 대상 자료로서 수집할 수 있다. 또한, 본원의 일 실시예에 따르 면, 계절 분석 장치는 기상 정보 수집 서버로부터 계절 분류 모델을 이용하여 분석하고자 하는 기간 에 계측된 기상 자료를 수신하는 것일 수 있다. 계절 분석 장치는 획득한 분석 대상 자료 및 계절 분류 모델을 이용하여, 분석 대상일(D일)에 대응하는 계 절 정보를 도출할 수 있다. 보다 구체적으로, 계절 분석 장치는 분석 대상 자료를 이용한 주성분 분석을 수행하여 도출되는 복수의 주성분을 기 구축된 계절 분류 모델에 입력할 수 있다. 또한, 본원의 일 실시예에 따르면, 계절 분석 장치는 분석 대상일 및 해당 분석 대상일 이후의 미리 설정 된 제2기간 중 적어도 하나에 대응하는 계절에 대한 식별 정보를 계절 정보로서 출력할 수 있다. 도 12는 적용 알고리즘 유형에 따른 계절 분류 모델의 성능을 비교하여 나타낸 그래프이다. 도 12를 참조하면, 의사결정 트리(Decision Tree, DT), 랜덤 포레스트(Random Forest, RF), K-최근접 이웃 알 고리즘(K-Nearest Neighbor, KNN) 및 서포트 벡터 머신(Support Vector Machine, SVM) 기반의 계절 분류 모델 중 훈련 성능은 RF 및 KNN에서 높게 나타나고, 검증 성능은 SVM에서 높게 나타나는 것을 확인할 수 있다. 또한, 5일 기간의 입력 자료를 사용할 경우의 성능은 SVM이 가장 높게 나타났으며, RF의 경우, 초봄을 늦가을, 늦봄을 늦가을, 늦가을을 초봄으로 오예측하는 케이스가 일부 발생하였다. 도 13은 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 장치의 개략적인 구성도이다. 도 13을 참조하면, 계절 분석 장치는 수집부, 주성분 분석부, 군집 분석부, 계절 정의부 , 학습부 및 계절 분석부를 포함할 수 있다. 수집부는 분석 대상 지역의 기상 자료를 수집할 수 있다. 또한, 수집부는 분석 대상 지역의 종관패턴 과 연계된 복수의 파라미터를 정의할 수 있다. 이와 관련하여 본원의 일 실시예에 따르면, 복수의 파라미터는 해면기압, 2m 기온, 10m 동서 바람성분, 10m 남북 바람성분, 전운량, 1000hPa 상대습도, 850hPa 지위고도, 850hPa 기온, 850hPa 상대습도 및 500hPa 지위고도 중 적어도 하나의 대기 변수를 포함할 수 있으나, 이에만 한 정되는 것은 아니다. 주성분 분석부는 수집된 기상 자료를 이용한 주성분 분석(Principal component analysis, PCA)을 수행하 여 복수의 파라미터와 연계된 복수의 주성분을 도출할 수 있다. 군집 분석부는 복수의 주성분을 이용하여 수집된 기상 자료에 대한 군집 분석을 수행할 수 있다. 계절 정의부는 도출된 복수의 군집 각각의 기간별 발생 빈도를 고려하여 분석 대상 지역의 종관패턴에 따 른 계절 변화에 대한 분석 데이터를 생성할 수 있다. 구체적으로 계절 정의부는 기준일 전후의 소정의 기간을 포함하는 기준 기간에 복수의 군집 각각의 발생 빈도를 표시한 군집 빈도 그래프를 생성할 수 있다. 또한, 계절 정의부는 생성된 군집 빈도 그래프에 기초 하여 발생 빈도가 가장 높은 군집의 유형이 전환되는 기준일을 복수의 군집 각각에 대응하여 정의되는 계절이 변환되는 계절 변환 시점으로 특정할 수 있다. 또한, 계절 정의부는 복수의 군집 각각의 최빈 발생 시기에 대한 정보와 계절 변환 시점에 따른 계절별 기 간에 대한 정보를 포함하는 분석 데이터를 도출할 수 있다. 또한, 본원의 일 실시예에 따르면, 계절 정의부는 복수의 군집 중 특정 구간에서 발생 빈도의 편차가 미리 설정된 임계 수준 이하에 해당하는 둘 이상의 군집을 단일 군집으로 통합할 수 있다. 학습부는 복수의 군집 각각에 대응하는 계절에 대한 식별 정보를 기상 자료에 대하여 라벨링한 학습 데이 터를 이용하여 계절 분류 모델을 구축(학습)할 수 있다. 계절 분석부는 분석 대상일에 대응하여 수집된 기상 자료인 분석 대상 자료를 획득할 수 있다. 예를 들어, 계절 분석부는 분석 대상일 및 해당 분석 대상일 이전의 미리 설정된 제1기간 동안 수집된 기상 자료를 분 석 대상 자료로서 수집할 수 있다. 계절 분석부는 획득한 분석 대상 자료 및 계절 분류 모델을 이용하여, 분석 대상일에 대응하는 계절 정보 를 도출할 수 있다. 보다 구체적으로, 계절 분석부는 분석 대상 자료를 이용한 주성분 분석을 수행하여 도 출되는 복수의 주성분을 기 구축된 계절 분류 모델에 입력할 수 있다. 또한, 본원의 일 실시예에 따르면, 계절 분석부는 분석 대상일 및 해당 분석 대상일 이후의 미리 설정된 제2기간 중 적어도 하나에 대응하는 계절에 대한 식별 정보를 계절 정보로서 출력할 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 14는 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 방법에 대한 동작 흐름도이다. 도 14에 도시된 종관패턴 분류를 적용한 계절 분석 방법은 앞서 설명된 계절 분석 장치에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 계절 분석 장치에 대하여 설명된 내용은 종관패턴 분 류를 적용한 계절 분석 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 14를 참조하면, 단계 S11에서 수집부는 분석 대상 지역의 기상 자료를 수집할 수 있다. 다음으로, 단계 S12에서 수집부는 분석 대상 지역의 종관패턴과 연계된 복수의 파라미터를 정의할 수 있다.다음으로, 단계 S13에서 주성분 분석부는 수집된 기상 자료를 이용한 주성분 분석(Principal component analysis, PCA)을 수행하여 복수의 파라미터와 연계된 복수의 주성분을 도출할 수 있다. 다음으로, 단계 S14에서 군집 분석부는 복수의 주성분을 이용하여 수집된 기상 자료에 대한 군집 분석을 수행할 수 있다. 다음으로, 단계 S15에서 계절 정의부는 도출된 복수의 군집 각각의 기간별 발생 빈도를 고려하여 분석 대 상 지역의 종관패턴에 따른 계절 변화에 대한 분석 데이터를 생성할 수 있다. 구체적으로 단계 S15에서 계절 정의부는 기준일 전후의 소정의 기간을 포함하는 기준 기간에 복수의 군집 각각의 발생 빈도를 표시한 군집 빈도 그래프를 생성할 수 있다. 또한, 단계 S15에서 계절 정의부는 생성된 군집 빈도 그래프에 기초하여 발생 빈도가 가장 높은 군집의 유 형이 전환되는 기준일을 복수의 군집 각각에 대응하여 정의되는 계절이 변환되는 계절 변환 시점으로 특정할 수 있다. 또한, 단계 S15에서 계절 정의부는 복수의 군집 각각의 최빈 발생 시기에 대한 정보와 계절 변환 시점에 따른 계절별 기간에 대한 정보를 포함하는 분석 데이터를 도출할 수 있다. 또한, 본원의 일 실시예에 따르면, 단계 S15에서 계절 정의부는 복수의 군집 중 특정 구간에서 발생 빈도 의 편차가 미리 설정된 임계 수준 이하에 해당하는 둘 이상의 군집을 단일 군집으로 통합할 수 있다. 다음으로, 단계 S16에서 학습부는 복수의 군집 각각에 대응하는 계절에 대한 식별 정보를 기상 자료에 대 하여 라벨링한 학습 데이터를 이용하여 계절 분류 모델을 구축(학습)할 수 있다. 다음으로, 단계 S17에서 계절 분석부는 분석 대상일에 대응하여 수집된 기상 자료인 분석 대상 자료를 획 득할 수 있다. 구체적으로 단계 S17에서 계절 분석부는 분석 대상일 및 해당 분석 대상일 이전의 미리 설정된 제1기간 동 안 수집된 기상 자료를 분석 대상 자료로서 수집할 수 있다. 다음으로, 단계 S18에서 계절 분석부는 획득한 분석 대상 자료 및 계절 분류 모델을 이용하여, 분석 대상 일에 대응하는 계절 정보를 도출할 수 있다. 구체적으로 단계 S18에서 계절 분석부는 분석 대상일 및 해당 분석 대상일 이후의 미리 설정된 제2기간 중 적어도 하나에 대응하는 계절에 대한 식별 정보를 계절 정보로서 출력할 수 있다. 또한, 본원의 일 실시예에 따르면, 단계 S18에서 계절 분석부는 분석 대상 자료를 이용한 주성분 분석을 수행하여 도출되는 복수의 주성분을 기 구축된 계절 분류 모델에 입력할 수 있다. 상술한 설명에서, 단계 S11 내지 S18은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단 계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있 는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프 로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이 프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행 될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 종관패턴 분류를 적용한 계절 분석 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2023-0014639", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2023-0014639", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 계절 분석 시스템의 개략적인 구성도이다. 도 2는 분석 대상 지역을 예시적으로 나타낸 도면이다. 도 3은 분석 대상 지역의 종관패턴과 연계된 복수의 파라미터를 이용한 주성분 분석 및 군집 분석을 통한 계절 정의 프로세스를 설명하기 위한 개념도이다. 도 4는 주성분 분석에 의해 도출되는 복수의 주성분의 개수를 결정하는 프로세스를 설명하기 위한 그래프이다. 도 5는 군집 분석에 의해 도출되는 복수의 군집의 개수를 결정하는 프로세스를 설명하기 위한 그래프이다. 도 6은 복수의 군집 각각에 대한 제1주성분 및 제2주성분의 분포를 나타낸 그래프이다. 도 7a 및 도 7b는 복수의 군집 각각에 대한 제1주성분 내지 제8주성분 각각의 분포를 나타낸 그래프이다. 도 8은 복수의 군집 각각의 발생 빈도를 표시한 군집 빈도 그래프를 예시적으로 나타낸 도면이다. 도 9는 둘 이상의 군집을 단일 군집으로 통합한 형태의 군집 빈도 그래프를 예시적으로 나타낸 도면이다. 도 10은 전이 기간을 설명하기 위한 그래프이다. 도 11은 계절 분류 모델을 구축하기 위한 프로세스를 나타낸 개념도이다. 도 12는 적용 알고리즘 유형에 따른 계절 분류 모델의 성능을 비교하여 나타낸 그래프이다. 도 13은 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 장치의 개략적인 구성도이다. 도 14는 본원의 일 실시예에 따른 종관패턴 분류를 적용한 계절 분석 방법에 대한 동작 흐름도이다."}
