{"patent_id": "10-2023-0066415", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0170605", "출원번호": "10-2023-0066415", "발명의 명칭": "신규한 인간 인터류킨-4 수용체 결합 나노바디 및 이를 포함하는 비강 분무 제형", "출원인": "연세대학교 산학협력단", "발명자": "김주영"}}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "5번째 잔기 및 11번째 잔기로 구성된 군으로부터 선택되는 하나 이상의 아미노산 잔기의 치환을 포함하는 서열번호 1의 아미노산 서열을 포함하는 항-IL-4R 항체 또는 이의 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 5번째 잔기의 치환은 Arg으로의 치환인 것을 특징으로 하는 항-IL-4R 항체 또는 이의항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 11번째 잔기의 치환은 Tyr으로의 치환인 것을 특징으로 하는 항-IL-4R 항체 또는 이의항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 항-IL-4R 항체 또는 이의 항원 결합단편은 서열번호 2, 서열번호 3 및 서열번호 4로 구성된 군으로부터 선택되는 하나 이상의 아미노산 서열을 포함하는 것을 특징으로 하는 항체 또는 이의 항원 결합단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "104번째 잔기 및 110번째 잔기로 구성된 군으로부터 선택되는 하나 이상의 아미노산 잔기의 치환을 포함하는 서열번호 5의 아미노산 서열을 포함하는 항-IL-4R 항체 또는 이의 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 104번째 잔기의 치환은 Arg으로의 치환인 것을 특징으로 하는 항-IL-4R 항체 또는 이의 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서, 상기 110번째 잔기의 치환은 Tyr으로의 치환인 것을 특징으로 하는 항-IL-4R 항체 또는 이의 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5 항에 있어서, 상기 항-IL-4R 항체 또는 이의 항원 결합단편은 서열번호 6, 서열번호 7 및 서열번호 8로 구성된 군으로부터 선택되는 하나 이상의 아미노산 서열을 포함하는 것을 특징으로 하는 항체 또는 이의 항원 결합단편.공개특허 10-2024-0170605-3-청구항 9 제 1 항 내지 제 8 항에 있어서, 상기 항원 결합단편은 나노바디인 것을 특징으로 하는 항체 또는 이의 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서, 상기 나노바디는 볼록 스캐폴드(convex scaffold) 구조를 가지는 것을 특징으로 하는 항체또는 이의 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "서열번호 1, 2, 3, 4, 5, 6, 7 및 8로 구성된 군으로부터 선택되는 서로 같거나 서로 다른 2개의 항체 또는 항원 결합 단편; 및 링커를 포함하는 이량체(dimer) 형태의 항체 또는 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 이량체 형태의 항체는 2개의 서열번호 5로 구성된 항원 및 이를 연결하는 링커로 구성된 것을 특징으로 하는 이량체(dimer) 형태의 항체 또는 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서, 상기 이량체 형태의 항체는 2개의 서열번호 6으로 구성된 항원 및 이를 연결하는 링커로 구성된 것을 특징으로 하는 이량체(dimer) 형태의 항체 또는 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 11 항에 있어서, 상기 이량체 형태의 항체는 2개의 서열번호 7로 구성된 항원 및 이를 연결하는 링커로 구성된 것을 특징으로 하는 이량체(dimer) 형태의 항체 또는 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 11 항에 있어서, 상기 이량체 형태의 항체는 2개의 서열번호 8로 구성된 항원 및 이를 연결하는 링커로 구성된 것을 특징으로 하는 이량체(dimer) 형태의 항체 또는 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11 항 내지 제 15항 중 어느 한 항에 있어서, 상기 링커는 3개의 아미노산으로 이루어진 것을 특징으로 하는이량체(dimer) 형태의 항체 또는 항원 결합 단편."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서, 상기 링커는 서열번호 9로 구성되는 펩타이드인 것을 특징으로 하는 이량체(dimer) 형태의항체 또는 항원 결합 단편.공개특허 10-2024-0170605-4-청구항 18 제 1 항, 제 5 항 및 제 11 항 중 어느 한 항의 항체 또는 이의 항원 결합 단편을 인코딩하는 핵산 분자."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1 항, 제 5 항, 및 제 11 항 중 어느 한 항의 항체 또는 이의 항원 결합 단편; 또는 제 18 항의 핵산분자를유효성분으로 포함하는 염증성 질환 또는 자가 면역 질환의 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서, 상기 염증 또는 자가 면역 질환은 비염, 결막염, 치주염, 중이염, 인후염, 편도염, 폐렴,위궤양, 위염, 크론병, 대장염, 치질, 통풍, 강직성 척추염, 류마티스 열, 류마티스 관절염, 류마티스성 다발성근육통, 루프스, 섬유근통(fibromyalgia), 건선성 관절염, 골관절염, 견관절 주위염, 건염, 건초염, 건주위염,근육염, 다발성 근육염, 피부 근육염, 간염, 방광염, 신장염, 쇼그렌 증후군(sjogren's syndrome), 다발성 경화증, 염증성 장질환, 천식, 제1형 당뇨병, 건선, 습진, 피부경화증, 백반증, 말초성 신경염, 포도막염, 자가면역혈구감소증, 자가면역 심근염, 아토피피부염, 일차성간경변, 안구건조증, 굿파이처 증후군, 자가면역 뇌수막염,애디슨병, 자가면역성 이하선염, 이영양성 수포성 표피박리증, 부고환염, 사구체 신염, 그레이브스병, 셀리악병, 길랑바레 증후군, 하시모토병, 용혈성 빈혈, 중증 근무력증, 근위축성측색경화증, 심상천포창, 유육종증,척추관절증, 갑상선염, 혈관염, 점액수종, 악성빈혈, 항인지질증후군 및 이식편대숙주질환으로 구성된 군으로부터 선택되는 염증임을 특징으로 하는 조성물."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20 항에 있어서, 상기 비염은 비용종(nasal polyps) 또는 부비동염(sinusitis)인 것을 특징으로 하는조성물."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 21 항에 있어서, 상기 부비동염은 만성 부비동염(Chronic Sinusitis, CRS)인 것을 특징으로 하는 조성물."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22 항에 있어서, 상기 만성 부비동염은 비용종을 동반한 만성 부비동염(CRS with nasal polyp, CRSwNP)인 것을 특징으로 하는 조성물."}
{"patent_id": "10-2023-0066415", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 19 항에 있어서, 상기 조성물은 비강 투여용 조성물인 것을 특징으로 하는 조성물."}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 항-IL-4 수용체에 대한 현저한 결합력을 가져 IL-4에 의한 신호전달을 효과적으로 차단하면서도 낮은 분자량으로 인해 상피세포를 직접적으로 투과할 수 있는 항원 결합단편, 구체적으로는 나노바디(Nanobody)에 관 한 것이다. 본 발명자들은 상기 나노바디의 IL-4 수용체 결합력을 극대화시킬 수 있는 아미노산 치환 변이체 및 이들의 2가 형태(bivalent form)를 발굴하고 이의 우수한 비강상피세포 투과성 및 현저한 염증반응 치료 효과를 확인하였다. 이에, 본 발명은 전신에 투여됨으로써 발생하는 다양한 부작용을 배제한 만성 염증 질환의 치료용 조성물, 특히 비강분무제형 조성물로 유용하게 이용될 수 있다."}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 IL-4 수용체에 특이적으로 결합하는 나노바디, 이를 유효성분으로 포함하는 비강 분무제(nasal spray) 및 이를 약리성분으로 이용하여 다양한 IL-4 매개-염증성 질환을 예방 또는 치료하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "코 주위의 얼굴 뼈 속에 있는 빈 공간을 부비동이라고 하는데, 이 공간들은 작은 구멍인 자연공을 통하여 코 속 과 연결되어 있고, 이를 통해 부비동 내의 공기의 환기 및 분비물의 배설이 이루어진다. 부비동염 또는 축농증 이란, 자연공이 막혀서 부비동이 제대로 환기 및 배설되지 않아 이차적으로 부비동에 염증이 발생하고, 농성 분 비물이 고이면서 염증이 점점 심화되는 상태를 말한다. 이러한 부비동염이 3개월 이상 지속되는 경우 만성 부비 동염(Chronic Rhinosinusitis, CRS)이라고 정의된다. 이러한 만성 부비동염 중 비강 용종을 동반하는 사례는 전체 부비동염에서 최대 33%를 차지하면서 다양한 호흡 기 질환을 수반하고, 아울러 내시경 부비동 수술 후에도 예후가 좋지 않은 것으로 알려져 있다. 인터류킨-4R-α에 대한 단일클론항체인 두필루맙은 만성 부비동염에 대한 치료효과가 확인된 바 있으나, 항체의 크기 때문에 환부로의 직접적인 투여가 불가능하고, 현재 주세의 형태로만 투여가 가능하여 주사 부근 반응 (Injection Site Reaction) 또는 혈청병양 반응(Serum Sickness like Reactions)와 같이 다양한 부작용이 수반 되는 치명적인 단점을 가지고 있다. \"나노바디(Nanobody)\"는 낙타과 동물에서 발견된 중쇄 전용 항체의 항원인 식 가변부(variable region)에 해당하는데, 작은 분자량 및 높은 생산 수율을 통해 기존 일반적인 항체 치료제 가 가지던 투여방법의 제한을 비롯한 다양한 문제점에 대한 해결책을 제공할 수 있다. 한편, 인공지능 기반 구조예측(in silico affinity maturation) 기술의 경우, 나노바디와 같은 항원 결합 단편 의 구조를 예측한 뒤 수용체와의 결합 구조를 파악하고, 컴퓨터 프로그램 기반 결합력 증강 기법을 통하여 수용 체에 대한 결합력을 증가시킬 수 있는 돌연변이를 발굴하는 방법으로서 나노바디의 수용체 결합 능력을 극대화 시키는데 매우 유용하다. 이에, 본 발명자들은 기존의 두필루맙과 비교하여 월등하게 높은 IL-4 수용체 억제 효과를 보이면서도 높은 안 정성을 가지고 작은 분자량으로 인해 다양한 투여 방법, 특히 비강상피세포에 스프레이 형태로 직접 투여하여 상피세포를 투과하여 염증을 제거할 수 있는 새로운 형태의 IL-4R 억제용 항체를 발굴하고, 발굴한 항체에 대하 여 컴퓨터 프로그램 기반 결합력 증강 기법을 통하여 결합력이 극대화된 돌연변이 항체를 개발하고자 하였다. 본 명세서 전체에 걸쳐 다수의 논문 및 특허문헌이 참조되고 그 인용이 표시되어 있다. 인용된 논문 및 특허문 헌의 개시 내용은 그 전체로서 본 명세서에 참조로 삽입되어 본 발명이 속하는 기술 분야의 수준 및 본 발명의 내용이 보다 명확하게 설명된다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌 1. 대한민국등록공보 제10-1599706호"}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명자들은 IL-4 수용체의 억제제로서 부비동염을 비롯한 다양한 염증성 질환에 우수한 치료 효과를 가짐에 도, 큰 분자량으로 인하여 상피세포를 통과하지 못하여 주사제로만 투여됨으로써 많은 부작용을 수반하는 종래 항-IL-4R 항체의 문제점을 개선하고자 예의 연구 노력하였다. 그 결과, 서열번호 1 및 5의 아미노산 서열을 가 지는 항원결합 단편과, 나아가 이들의 수용체 결합력을 더욱 극대화할 수 있는 아미노산 치환 돌연변이를 포함 하는 나노바디(Nanobody)를 개발하고, 이를 비강 분무제(Nasal Spray) 제형으로 부비동의 염증 부위에 직접적으 로 국소투여할 경우 부작용 없이 염증을 효율적으로 예방 또는 치료할 수 있음을 발견함으로써, 본 발명을 완성 하게 되었다. 따라서 본 발명의 목적은 IL-4 수용체(IL-4R)에 대한 항체 또는 이의 항원 결합단편과 이를 인코딩하는 핵산 분 자를 제공하는 데 있다.본 발명의 다른 목적은 비강 분무제 제형으로도 적용 가능한 염증 질환 또는 자가 면역 질환의 예방 또는 치료 용 약학적 조성물을 제공하는 데 있다. 본 발명의 다른 목적 및 이점은 하기의 발명의 상세한 설명, 청구범위 및 도면에 의해 보다 명확하게 된다."}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 양태에 따르면, 본 발명은 5번째 잔기 및 11번째 잔기로 구성된 군으로부터 선택되는 하나 이상의 아미노산 잔기의 치환을 포함하는 서열번호 1의 아미노산 서열을 포함하는 항-IL-4R 항체 또는 이의 항원 결합 단편을 제공한다. 본 발명자들은 IL-4 수용체의 억제제로서 부비동염을 비롯한 다양한 염증성 질환에 우수한 치료 효과를 가짐에 도, 큰 분자량으로 인하여 상피세포를 통과하지 못하여 주사제로만 투여됨으로써 많은 부작용을 수반하는 종래 항-IL-4R 항체의 문제점을 개선하고자 예의 연구 노력하였다. 그 결과, 서열번호 1 및 5의 아미노산 서열을 가 지는 항원결합 단편과, 나아가 이들의 수용체 결합력을 더욱 극대화할 수 있는 아미노산 치환 돌연변이를 포함 하는 나노바디(Nanobody)를 개발하고, 이를 비강 분무제(Nasal Spray) 제형으로 부비동의 염증 부위에 직접적으 로 국소투여할 경우 부작용 없이 염증을 효율적으로 예방 또는 치료할 수 있음을 발견하였다. 본 명세서에서 용어“항체(antibody)”는 IL-4-R에 대한 항체로서, 이의 특정 에피토프를 특이적으로 인식하여 결합하는 펩타이드를 의미하며, 완전한 항체 형태뿐만 아니라 항체 분자의 항원 결합 단편(항체 단편)을 포함한 다. 완전한 항체는 2개의 전체 길이의 경쇄 및 2개의 전체 길이의 중쇄를 가지는 구조이며 각각의 경쇄는 중쇄와 다 이설파이드 결합으로 연결되어 있다. 중쇄 불변영역은 감마(γ), 뮤(μ), 알파(α), 델타(δ) 및 엡실론(ε) 타입을 가지고 서브클래스로 감마1(γ1), 감마2(γ2), 감마3(γ3), 감마4(γ4), 알파1(α1) 및 알파2(α2)를 가 진다. 경쇄의 불변영역은 카파(κ) 및 람다(λ) 타입을 가진다. 본 명세서에서 용어“항체의 항원 결합 단편”은 전체 항체 분자 내에서 유의한 항원-항체 결합 기능을 가지는 단편을 의미하며, Fab, F(ab'), F(ab')2, Fv 및 나노바디(nanobody 또는 sybody) 등을 포함한다. 항체 단편 중 Fab는 경쇄 및 중쇄의 가변영역과 경쇄의 불변영역 및 중쇄의 첫 번째 불변영역(CH1)을 가지는 구 조로 1개의 항원 결합 부위를 가진다. Fab'는 중쇄 CH1 도메인의 C-말단에 하나 이상의 시스테인 잔기를 포함 하는 힌지 영역(hinge region)을 가진다는 점에서 Fab와 차이가 있다. F(ab')2 항체는 Fab'의 힌지 영역의 시 스테인 잔기가 디설파이드 결합을 이루면서 생성된다. Fv는 중쇄 가변영역 및 경쇄 가변영역만을 가지고 있는 최소의 항체조각으로 Fv 단편을 생성하는 재조합 기술은 WO88/10649, WO88/106630, WO88/07085, WO88/07086 및 WO88/09344에 개시되어 있다. 이중쇄 Fv(two-chain Fv)는 비공유 결합으로 중쇄 가변영역과 경쇄 가변영역이 연결되어 있고 단쇄 Fv(single-chain Fv)는 일반적으로 펩타이드 링커를 통하여 중쇄의 가변영역과 단쇄의 가변 영역이 공유결합으로 연결되거나 또는 C-말단에서 바로 연결되어 있어서 이중쇄 Fv와 같이 다이머와 같은 구조 를 이룰 수 있다. 이러한 항체 단편은 단백질 가수분해 효소를 이용해서 얻을 수 있고(예를 들어, 전체 항체를 파파인으로 제한 절단하면 Fab를 얻을 수 있고 펩신으로 절단하면 F(ab')2 단편을 얻을 수 있다), 유전자 재조 합 기술을 통하여 제작할 수도 있다. 본 명세서에서 용어“중쇄”는 항원에 대한 특이성을 부여하기 위한 충분한 가변영역 서열을 갖는 아미노산 서 열을 포함하는 가변영역 도메인 VH 및 3개의 불변영역 도메인 CH1, CH2 및 CH3을 포함하는 전체길이 중쇄 및 이 의 단편을 모두 의미한다. 본 명세서에서 용어“경쇄”는 항원에 대한 특이성을 부여하기 위한 충분한 가변영역 서열을 갖는 아미노산 서 열을 포함하는 가변영역 도메인 VL 및 불변영역 도메인 CL을 포함하는 전체길이 경쇄 및 이의 단편을 모두 의미 한다. 본 명세서에서, 용어“CDR(complementarity determining region)”은 면역글로블린 중쇄 및 경쇄의 고가변 영 역(hypervariable region)의 아미노산 서열을 의미한다(Kabat et al. Sequences of Proteins of Immunological Interest, 4th Ed., U.S. Department of Health and Human Services, National Institutes of Health ). 중쇄(HCDR1, HCDR2 및 HCDR3) 및 경쇄(LCDR1, LCDR2 및 LCDR3)에는 각각 3개의 CDR이 포함되어 있으 며, 이들 CDR은 항체가 항원 또는 에피토프에 결합하는 데 있어서 주요한 접촉 잔기를 제공한다.본 발명의 항체또는 항체 단편의 범위에는 CDR 영역에 보존적 아미노산 치환을 갖는 변이체가 포함된다. 또한, 본 발명의 항 체 또는 항체 단편은, IL-4 수용체를 특이적으로 인식할 수 있는 범위 내에서 첨부한 서열목록에 기재된 아미노 산 서열의 변이체를 포함할 수 있다. 예를 들면, 항체의 결합 친화도 및/또는 기타 생물학적 특성을 보다 더 개선시키기 위하여 항체의 아미노산 서열에 추가적인 변화를 줄 수 있다. 이러한 변형은, 예를 들어 항체의 아 미노산 서열 잔기의 결실, 삽입 및/또는 치환을 포함한다. 이러한 아미노산 변이는 아미노산 곁사슬 치환체의 상대적 유사성, 예컨대, 소수성, 친수성, 전하, 크기 등에 기초하여 이루어진다. 아미노산 곁사슬 치환체의 크 기, 모양 및 종류에 대한 분석에 의하여, 아르기닌, 라이신과 히스티딘은 모두 양전하를 띤 잔기이고; 알라닌, 글라이신과 세린은 유사한 크기를 갖으며; 페닐알라닌, 트립토판과 타이로신은 유사한 모양을 갖는다는 것을 알 수 있다. 따라서, 이러한 고려 사항에 기초하여, 아르기닌, 라이신과 히스티딘; 알라닌, 글라이신과 세린; 그 리고 페닐알라닌, 트립토판과 타이로신은 생물학적으로 기능 균등물이라 할 수 있다. 분자의 활성을 전체적으로 변경시키지 않는 단백질에서의 아미노산 교환은 당해 분야에 공지되어 있다(H. Neurath, R.L.Hill, The Proteins, Academic Press, New York, 1979). 가장 통상적으로 일어나는 교환은 아미 노산 잔기 Ala/Ser, Val/Ile, Asp/Glu, Thr/Ser, Ala/Gly, Ala/Thr, Ser/Asn, Ala/Val, Ser/Gly, Thr/Phe, Ala/Pro, Lys/Arg, Asp/Asn, Leu/Ile, Leu/Val, Ala/Glu 및 Asp/Gly 간의 교환이다. 상술한 생물학적 균등 활성을 갖는 변이를 고려한다면, 본 발명의 항체를 구성하는 아미노산 서열은 서열목록에 기재된 서열과 실질적인 동일성(substantial identity)을 나타내는 서열도 포함하는 것으로 해석된다. 상기의 실질적인 동일성은, 상기한 본 발명의 서열과 임의의 다른 서열을 최대한 대응되도록 얼라인 하고, 당업계에서 통상적으로 이용되는 알고리즘을 이용하여 얼라인 된 서열을 분석한 경우에, 최소 61%의 상동성, 일특정예에 따 르면 70%의 상동성, 다른 특정예에 따르면 80%의 상동성, 또 다른 특정예에 따르면 90%의 상동성을 나타내는 서 열을 의미한다. 서열비교를 위한 얼라인먼트 방법은 당업계에 공지되어 있다. 얼라인먼트에 대한 다양한 방법 및 알고리즘은 Huang et al. Comp. Appl. BioSci. 8:155-65 및 Pearson et al. Meth. Mol. Biol. 24:307-31 등에 개시되어 있다. 본 명세서에서 용어 “IL-4”는 활성화 되지 않은 상태의 헬퍼 T 세포(naive T cell, Th0 cell)에서 Th2 세포로 의 분화를 유도하는 사이토카인(cytokine)을 지칭한다. IL-4는 활성화된 B 세포와 T 세포를 자극하거나 B 세포 를 형질세포로 분화시키는 등의 다양한 생물학적 기능을 가지며, 체액성 면역과 후천성 면역의 중요한 조절자이 다. 본 명세서에서 용어 “IL-4R”은 IL-4의 수용체를 의미하며, 리간드인 IL-4와 결합함으로서 IgE 항체 생성과 관 련된 신호전달을 유도한다. 일반적으로 IL-4의 수용체는 IL-4Rα로 알려져 있으며, 신체에서 2가지 형태의 복 합체로 존재한다. 1형(Type 1) 수용체는 일반적으로 γ사슬(γc) 및 IL-4Rα의 복합체로 존재하며, IL-4에 특 이적이다. 2형(Type2) 수용체는 일반적으로 IL-4Rα 및 IL-13Rα1의 복합체로 존재하며, IL-4 및 IL13 모두에 특이적이다. 본 명세서에서 용어“두필루맙”은 IL-4Rα에 대한 단일클론항체로서, 제품명 DUPIXENT®으로 상용화된 항체 치 료제이다. 두필루맙의 작용기전은 1형 IL-4 수용체에서 IL-4와 IL-4Rα의 결합을 차단하거나 IL-4α과 γ사슬 의 이합체화 반응(dimerization)을 차단함으로써 신호전달을 억제하고, 2형 IL-4 수용체에서는 IL-4Rα 및 IL- 13Rα1의 이합체화 반응을 차단함으로써 신호전달을 억제하는 것으로 알려져 있다. 본 발명의 항체는 단일클론 항체, 인간 항체, 인간화 항체, 키메라 항체, 단쇄 Fvs(scFV), 단쇄항체, Fab 단편, F(ab')단편, 다이설파이드-결합 Fvs(sdFV) 및 항-이디오타입(항-Id) 항체, 그리고 상기 항체들의 에피토프-결합 단편 및 나노바디(Nanobody 또는 sybody) 등을 포함하나, 이에 한정되는 것은 아니다. 본 명세서에서 용어“단일클론 항체”는, 실질적으로 동일한 항체 집단에서 수득한 단일 분자 조성의 항체분자 를 의미하며, 단일클론 항체는 특정 에피토프에 대해 단일 결합 특이성 및 친화도를 나타낸다. 본 명세서에서 용어 “나노바디”는 하나의 중쇄 가변영역만으로 구성된 단일 도메인의 항체 유사체를 의미하며,“단일 도메인 항체(VHH antibody)”또는“합성나노항체(sybody)”와 동일한 의미를 가지고, 상호 교 환적으로 사용될 수 있다. 나노바디는 완전한 기능을 가진 가장 작은 항원 결합 단편이며, 통상적으로 경쇄 및 중쇄 불변영역1(CH1)이 자연적으로 결여된 항체를 먼저 수득한 후 항체 중쇄의 가변영역을 클로닝하여 하나의 중쇄 가변영역만으로 구성된 단일 도메인 항체(Variable Domain of Heavy-chain Antibodies, VHH)를 구축할 수 있다. 나노바디는 낙타, 라마, 알파카 등의 낙타과 동물에서 추출한 항체 조각을 인공적으로 가공하여 제조할 수 있으며, 일반 항체 크기의 10분의 1수준의 크기를 가져 온도 변화 등 외부 환경에 강하고, 투여가 용이하며,생산수율이 높은 장점이 있다. 본 명세서에서 용어 “E5R”은 서열번호 1의 서열을 기준으로 5번째 아미노산인 글루탐산(E)이 아르기닌(R)으로 치환된 돌연변이를 의미한다. 본 명세서에서 용어 “A11Y”는 서열번호 1의 서열을 기준으로 11번째 아민노산이 알라닌(A)에서 티로신(Y)으로 치환된 돌연변이를 의미한다. 본 발명의 구체적인 구현예에 따르면, 상기 5번째 잔기의 치환은 Arg으로의 치환이며, 상기 11번째 잔기의 치환 은 Tyr로의 치환이다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 항-IL-4R 항체 또는 이의 항원 결합단편은 서열번호 2, 서열번 호 3 및 서열번호 4로 구성된 군으로부터 선택되는 하나 이상의 아미노산 서열을 포함한다. 본 발명의 또 다른 양태에 따르면, 본 발명은 104번째 잔기 및 110번째 잔기로 구성된 군으로부터 선택되는 하 나 이상의 아미노산 잔기의 치환을 포함하는 서열번호 5의 아미노산 서열을 포함하는 항-IL-4R 항체 또는 이의 항원 결합 단편을 제공한다. 본 발명에 따르면, 서열번호 5는 서열번호 1로 표시되는 CDR 서열을 포함하는 전장(full-length) 나노바디의 아 미노산 서열이다. 본 명세서에서 용어 “E104R”은 서열번호 5의 서열을 기준으로 104번째 아미노산인 글루탐산(E)이 아르기닌 (R)으로 치환된 돌연변이를 의미한다. 본 명세서에서 용어 “A110Y”는 서열번호 5의 서열을 기준으로 110번째 아민노산이 알라닌(A)에서 티로신(Y)으 로 치환된 돌연변이를 의미한다. 본 발명의 구체적인 구현예에 따르면, 상기 104번째 잔기의 치환은 Arg으로의 치환이고, 상기 110번째 잔기의 치환은 Tyr로의 치환이다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 항-IL-4R 항체 또는 이의 항원 결합단편은 서열번호 5, 서열번 호 6을 포함한다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 항-IL-4R 항체 또는 이의 항원 결합단편은 서열번호 6, 서열번 호 7 및 서열번호 8로 구성된 군으로부터 선택되는 하나 이상의 아미노산 서열을 포함한다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 항원 결합단편은 F(ab')2, Fab', Fab, Fv, scFv 및 나노바디 (Nanobody)로 구성된다. 보다 구체적으로는, 본 발명의 항원 결합단편은 나노바디이다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 나노바디는 볼록 스캐폴드(convex scaffold)구조를 가진다. 본 명세서에서 용어 “볼록 스캐폴드(convex scaffold)”란, 나노바디가 가지는 볼록한 모양의 형태를 의미한다. 나노바디의 CDR-H3는 평균 19개의 아미노산으로 이루어져 평균 12개의 아미노산으로 이루어진 인간 의 CDR-H3보다 길어, 볼록한 모양의 루프를 형성하여 오목한 형태의 효소나 프로테아제 등의 활성부위에 효과적 으로 결합할 수 있다. 예를 들어, 항원 결합 단편 중 하나인 scFv의 경우, 평평한 선형 에피토프와 잘 결합하 지만 이에 반해 나노바디의 경우 오목한 활성 부위에도 잘 결합할 수 있다. 다만, 나노바디의 경우 평평한 활 성 부위에도 높은 특이도로 결합할 수 있으며, 이러한 높은 친화도는 나노바디의 유연한 스캐폴드에 기인하는 것으로 알려져 있다. 나아가, 나노바디의 경우 scFv와 비교하여 비특이적 배경 결합(nonspecific backgoundbinding) 정도가 낮은 장점도 가진다. 본 발명의 또 다른 양태에 따르면, 본 발명은 서열번호 1, 2, 3, 4, 5, 6, 7 및 8으로 구성된 군으로부터 선택 되는 서로 같거나 서로 다른 2개의 항체 또는 항원 결합 단편; 및 링커를 포함하는 이량체(dimer) 형태의 항체 또는 항원 결합 단편을 제공한다. 본 명세서에서 용어 “이량체(dimer) 형태의 항체 또는 항원 결합 단편”은 2개의 서로 같거나 서로 다른 항체 또는 항원 결합 단편이 연결된 2가 나노바디(bivalent nanobody)를 의미한다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 이량체 형태의 항체는 2개의 서열번호 5로 구성된 항원 및 이 를 연결하는 링커로 구성된다. 본 명세서에서 용어“링커”는 기본적으로 공유 결합을 이용하여 서로 다른 두 개의 융합 파트너(예: 생물학적 고분자 등)를 연결할 수 있는 수단을 의미한다. 링커는 펩타이드 링커 또는 비펩타이드 링커일 수 있다. 링커가 펩타이드 링커인 경우 하나 이상의 아미노산으로 구성될 수 있다. 본 명세서에서 용어 “펩타이드 링커”는 아미노산으로 이루어진 링커로서, 구체적으로 1 내지 60개 아미노산으 로 이루어질 수 있고, 보다 구체적으로 3 내지 50개 아미노산으로 이루어질 수 있으나. 이에 제한되지 않고 2가 나노바디(Bivalent Nanobody)의 수용체 결합능력을 방해하지 않는 한 모든 길이의 링커가 사용될 수 있다. 한편, 펩타이드 링커를 구성하는 아미노산은 모든 종류의 아미노산을 사용할 수 있고, 각 펩타이드는 서로 같을 수도 있고, 서로 상이할 수도 있다. 본 명세서에서 펩타이드 링커는 구체적으로 AAA 링커일 수 있다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 이량체 형태의 항체는 2개의 서열번호 6로 구성된 항원 및 이 를 연결하는 링커로 구성된다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 이량체 형태의 항체는 2개의 서열번호 7으로 구성된 항원 및 이를 연결하는 링커로 구성된다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 이량체 형태의 항체는 2개의 서열번호 8으로 구성된 항원 및 이를 연결하는 링커로 구성된다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 링커는 3개의 아미노산으로 이루어진다. 보다 구체적으로는, 본 발명의 링커는 서열번호 9로 구성된다. 본 발명의 또 다른 양태에 따르면, 본 발명은 본 발명의 항체 또는 이의 항원 결합 단편을 인코딩하는 핵산 분 자를 제공한다. 본 명세서에서 용어“핵산 분자”는 DNA(gDNA 및 cDNA) 그리고 RNA 분자를 포괄적으로 포함하는 의미를 가지며, 핵산 분자에서 기본 구성단위인 뉴클레오타이드는 자연의 뉴클레오타이드뿐만 아니라, 당 또는 염기 부위가 변 형된 유사체(analogue)도 포함한다(Scheit, Nucleotide Analogs, John Wiley, New York; Uhlman er al., Chemical Reviews 90:543-584). 본 발명의 중쇄, 경쇄 가변영역 및 나노바디를 코딩하는 핵산 분 자의 서열은 변형될 수 있다. 상기 변형은 뉴클레오타이드의 추가, 결실, 또는 비보존적 치환 또는 보존적 치 환을 포함한다. 본 발명의 핵산 분자는 상기한 뉴클레오타이드 서열에 대하여 실질적인 동일성을 나타내는 뉴클레오타이드 서열 도 포함하는 것으로 해석된다. 상기의 실질적인 동일성은, 상기한 본 발명의 뉴클레오타이드 서열과 임의의 다 른 서열을 최대한 대응되도록 얼라인하고, 당업계에서 통상적으로 이용되는 알고리즘을 이용하여 얼라인 된 서 열을 분석한 경우에, 최소 80%의 상동성, 일 특정예에서는 최소 90%의 상동성, 다른 특정예에서는 최소 95%의 상동성을 나타내는 뉴클레오타이드 서열을 의미한다. 본 발명에 따르면, 본 발명의 항체 또는 이의 항원 결합 단편은 이를 인코딩하는 핵산 분자를 숙주 세포에서 발 현시킴으로서 재조합적으로 수득될 수 있다. 본 명세서에서 용어“발현시키다”는 대상 세포가 외래(exogenous) 유전자를 발현하게 하거나 또는 내인성 (endogenous) 유전자의 자연적 발현량을 증가시키기 위해 유전자 전달체를 이용하여 인위적으로 이를 도입함으 로써 유전자가 대상 세포 내에서 염색체외 인자로서 또는 염색체 통합 완성에 의해 복제 가능하게 되는 것을 의 미한다. 따라서, 용어“발현”은“형질전환(transformation)”, \"형질감염(transfection)\" 또는 \"형질도입 (transduction)\"과 동일한 의미이다. 보다 구체적으로는, 본 발명에서“발현시키다”는 대상 세포가 외래 유전 자를 인위적으로 발현하도록 하는 것을 의미한다. 본 명세서에서, 용어“유전자 전달체(gene carrier)”또는“유전자 전달 시스템(gene delivery system)”은 유 전자를 세포 내로 운반하는 모든 수단을 의미하며, 유전자 전달은 유전자의 세포내 침투(transduction)와 동일 한 의미를 가진다. 조직 또는 세포 수준에서, 유전자 전달은 유전자의 확산(spread)과 동일한 의미를 가진다. 따라서, 본 발명의 유전자 전달 시스템은 유전자 침투 시스템 및 유전자 확산 시스템으로 기재될 수 있다. 본 발명의 유전자 전달체를 제조하기 위해, 본 발명의 뉴클레오타이드 서열은 적합한 발현 컨스트럭트 (expression construct) 내에 존재하며, 상기 발현 컨스트럭트 내에서 본 발명의 뉴클레오타이드 서열은 발현조 절서열에 작동적으로 연결될 수 있다. 본 명세서에서, 용어“작동적으로 결합된”은 프로모터, 시그널 서열, 또는 전사조절인자 결합 위치의 어레이와 같은 핵산 발현 조절서열과 다른 핵산 서열사이의 기능적인 결합을 의 미하며, 이에 의해 상기 발현조절서열은 상기 다른 핵산 서열의 전사 및/또는 해독을 조절하게 된다. 본 발명의 유전자 전달체는 다양한 형태로 제작할 수 있는 데, 이는 (ⅰ) 내이키드(naked) 재조합 DNA 분자, (ⅱ) 플라스미드, (ⅲ) 바이러스 벡터, 그리고, (ⅳ) 상기 내이키드 재조합 DNA 분자 또는 플라스미드를 내포하 는 리포좀 또는 니오좀의 형태로 제작할 수 있다. 본 발명의 핵산분자는 상술한 본 발명의 항체, 항원 결합 단편 또는 나노바디를 유전자 형태로 대상체에 전달하 는 유전자 치료제 형태로 이용되거나, 또는 변이 항체, 항원 결합 단편 또는 나노바디를 숙주세포로부터 재조합 적으로 발현시켜 단백질 의약 형태로 생산하기 위한 용도로 사용될 수도 있다. 본 발명의 핵산 분자로서 mRNA가 사용될 경우, 항체, 항원 결합 단편 또는 나노바디의 발현(번역) 효율을 향상 시키기 위해, 예를 들어 poly(A) 테일 길이의 변화 또는 일부 아데닌 염기의 치환; 5'cap의 변형; 하나 이상의 변형 뉴클레오사이드(modified nucleoside)를 적용하는 등의 다양한 변형이 가해질 수 있다. 적용될 수 있는 변형 뉴클레오사이드는 예를 들어 N1-메틸슈도우리딘(N1-methylpseudouridine), 슈도우리딘(pseudouridine), 2-티오우리딘(2-thiouridine), 5-메틸우리딘(5-methyluridine), 5-메틸시티딘(5-methylcytidine) 및 5-메톡시 우리딘(5-methoxyuridine)을 포함하나, 이에 제한되지 않고 mRNA 분자의 면역원성을 감소시킬 수 있다고 당업계 에 알려진 어떠한 변형 뉴클레오사이드라도 적용될 수 있다. 본 발명이 환자의 체내에서 본 발명의 항체, 항원 결합 단편 또는 나노바디의 생산을 위한 mRNA 치료제로 사용될 경우, mRNA 분자의 효율적인 전달을 위해 다양한 지질-기반 유전자 전달 시스템(예를 들어 PEG-lipid, 콜레스테롤, Ganglioside GM3 등)이 사용될 수 있다. 본 발명의 구체적인 구현예에 따르면, 본 발명에서 이용되는 mRNA분자는 양 말단에 각각 5'-UTR 및 3'-UTR이 결 합되어 있으며, 보다 구체적으로는, 상기 5'-UTR은 5'-cap이 결합되어 있다. 본 명세서에서 용어“ UTR(untranslated region)는 mRNA 내에서 목적 단백질을 암호화하는 코딩 서열의 양 말단에 결합된 비번역 부위 를 의미하며, 코딩 서열의 업스트림에 존재하는 5'-UTR 및 다운스트림에 존재하는 3'-UTR이 있다. 용어“5’- cap”은 5'-UTR에 연결되어 elF4E(eukaryote translation initiation factor 4E)와 결합함으로써 40S 리보솜 서브유닛을 mRNA에 결합시켜 mRNA의 5' 시작 부위로부터 단백질 합성을 개시하는 역할을 할 뿐 아니라 핵산 분 해효소로부터 mRNA를 보호하는 역할을 하는 mRNA의 구성요소를 의미한다. 본 발명의 보다 구체적인 구현예에 따르면, 본 발명의 mRNA 분자는 3'말단에 20개 내지 400개의 염기를 포함하 는 poly(A) 테일을 추가적으로 포함한다. 본 명세서에서 용어“폴리(A) 서열”,“폴리아데닌 서열”또는“폴리 A 테일(poly(A) tail)”은 RNA 분자의 3' 말단에 위치하여 효소에 의한 분해로부터 RNA 분자를 보호하는 아데닌-반복 뉴클레오타이드 서열을 의미한다. 본 발명의 또 다른 양태에 따르면, 본 발명은 본 발명의 항체 또는 이의 항원 결합 단편; 또는 이를 인코딩하는 핵산분자를 유효성분으로 포함하는 염증성 질환 또는 자가 면역 질환의 예방 또는 치료용 약학적 조성물을 제공한다. 본 명세서에서 용어“예방”은 질환 또는 질병을 보유하고 있다고 진단된 적은 없으나, 이러한 질환 또는 질병 에 걸릴 가능성이 있는 대상체에서 질환 또는 질병의 발생을 억제하는 것을 의미한다. 본 명세서에서 용어“치료”는 (a) 질환, 질병 또는 증상의 발전의 억제; (b) 질환, 질병 또는 증상의 경감; 또 는 (c) 질환, 질병 또는 증상을 제거하는 것을 의미한다. 본 발명의 조성물을 대상체에 투여하면 IL-4 매개 신 호전달이 차단되면서 염증 질환 또는 자가 면역 질환에 의한 증상의 발전을 억제하거나, 이를 제거하거나 또는 경감시키는 역할을 한다. 따라서, 본 발명의 조성물은 그 자체로 이들 질환 치료의 조성물이 될 수도 있고, 혹 은 다른 약리성분과 함께 투여되어 상기 질환에 대한 치료 보조제로 적용될 수도 있다. 이에, 본 명세서에서 용어“치료”또는“치료제”는“치료 보조”또는“치료 보조제”의 의미를 포함한다. 본 명세서에서 용어“염증성 질환”은 염증 반응을 주 병인으로 하는 질병을 총칭하는 의미이다. 본 명세서에서 용어“자가면역질환”이란, 과도하거나 원치 않는 면역반응을 병인으로 하는 모든 질환을 총칭하 는 의미로서, 구체적으로는 자기관용의 유도 또는 계속적 유지가 정상적으로 이루어지지 않아 자기항원에 대한 면역반응이 일어나고, 이로 인해 자신의 조직이 손상받는 과정에 의해 발생되는 질환을 의미한다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 염증 또는 자가 면역 질환은 비염, 결막염, 치주염, 중이염, 인후염, 편도염, 폐렴, 위궤양, 위염, 크론병, 대장염, 치질, 통풍, 강직성 척추염, 류마티스 열, 류마티스 관 절염, 류마티스성 다발성 근육통, 루프스, 섬유근통(fibromyalgia), 건선성 관절염, 골관절염, 견관절 주위염, 건염, 건초염, 건주위염, 근육염, 다발성 근육염, 피부 근육염, 간염, 방광염, 신장염, 쇼그렌 증후군 (sjogren's syndrome), 다발성 경화증, 염증성 장질환, 천식, 제1형 당뇨병, 건선, 습진, 피부경화증, 백반증, 말초성 신경염, 포도막염, 자가면역 혈구감소증, 자가면역 심근염, 아토피피부염, 일차성간경변, 안구건조증, 굿파이처 증후군, 자가면역 뇌수막염, 애디슨병, 자가면역성 이하선염, 이영양성 수포성 표피박리증, 부고환염, 사구체 신염, 그레이브스병, 셀리악병, 길랑바레 증후군, 하시모토병, 용혈성 빈혈, 중증 근무력증, 근위축성측 색경화증, 심상천포창, 유육종증, 척추관절증, 갑상선염, 혈관염, 점액수종, 악성빈혈, 항인지질증후군 및 이식 편대숙주질환으로 구성된 군으로부터 선택된다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 비염은 비용종(nasal polyps) 또는 부비동염(Sinusitis)이다. 본 명세서에서 용어“비용종”이란, 일반적으로 중비도(중간 콧길)에서 유래된 포도송이 모양의 양성 부종성 점 막이 비강 내로 돌출된 병적 상태를 의미한다. 본 명세서에서 용어“부비동염”이란, 코 주위의 얼굴 뼈 속에 있는 부비동이라는 자연공이 막혀서 부비동이 제 대로 환기 및 배설되지 않아 이차적으로 부비동에 염증이 발생하고, 농성 분비물이 고이면서 염증이 심해지는 질환을 의미한다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 부비동염은 만성 부비동염(Chronic Sinusitis, CRS)이다. 본 명세서에서 용어“만성 부비동염”이란, 일반적으로 부비동염의 증상이 약 3개월 이상 장기적으로 지속되는 경우를 의미하나, 이에 국한되지 않고 해당 질환의 보통의 회복기간을 넘어 지속되는 모든 경우를 포함한다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 만성 부비동염은 비용종을 동반한 만성 부비동염(CRS with nasal polyp, CRSwNP)이다. 본 명세서에서 용어“비용종을 동반한 만성 부비동염(CRS with nasal polyp, CRSwNP)”란, 만성적인 부비동염과 함께 비용종(비강용종)이 나타나는 질환을 의미하며, 이와 비교하여 비용종이 동반되지 않는 경우는 “비용종을 동반하지 않는 만성 부비동염(CRS without nasal polyp, CRSsNP)”라고 지칭된다. 본 발명의 구체적인 구현예에 따르면, 본 발명의 조성물은 비강 투여용 조성물이다. 본 명세서에서 용어“비강 투여”란, 비강 또는 비강의 점막을 통하여 약물을 투여하는 방식을 의미하며, 전술 한 투여 방식은 비침습적(non-invasive)인 경로에 의한 것일 수 있다."}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 특징 및 이점을 요약하면 다음과 같다: (a) 본 발명은 항-IL-4 수용체에 대한 현저한 결합력을 가져 IL-4에 의한 신호전달을 효과적으로 차단하면서도 낮은 분자량으로 인해 상피세포를 직접적으로 투과할 수 있는 항원 결합단편, 구체적으로는 나노바디(Nanobod y)를 제공한다. (b) 나아가, 본 발명자들은 상기 나노바디의 IL-4 수용체 결합력을 극대화시킬 수 있는 아미노산 치환 변이체 및 이들의 2가 형태(bivalent form)를 발굴하고 이의 우수한 비강상피세포 투과성 및 현저한 염증반응 치료 효 과를 확인하였다 (c) 이에, 본 발명은 전신에 투여됨으로써 발생하는 다양한 부작용을 배제한 만성 염증 질환의 치료용 조성물, 특히 비강분무제형 조성물로 유용하게 이용될 수 있다."}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예를 통하여 본 발명을 더욱 상세히 설명하고자 한다. 이들 실시예는 오로지 본 발명을 보다 구체적 으로 설명하기 위한 것으로, 본 발명의 요지에 따라 본 발명의 범위가 이들 실시예에 의해 제한되지 않는다는 것은 당업계에서 통상의 지식을 가진 자에 있어서 자명할 것이다. 실시예 실험방법 및 분석방법 세포 HEK293T 및 HEK293 세포주는 한국 세포주 은행에서 구입하였다. 이러한 세포들을 10% FBS(Gibco, 26140-079) 및 페니실린/스트렙토마이신(Gibco, 15140-122)이 보충된 DMEM 고 포도당 배지(Gibco, 11995-065)에서 37℃, 5% CO2으로 배양하였다. 사용된 프라이머의 서열 프라이머 정보는 합성 나노바디 생성에 관한 논문에서 참고하였다(Zimmermann et al., 2018)1. FW_c_for : CAA GTC CAG CTG GTG GAA TCG (서열번호 10) FW_c_rev : GCC GCT AGC CGC ACA G (서열번호 11) Link2_c_for : ATA TAT GAA GAC CTC TGC GCG GC (서열번호 12) Link2_c_rev : ATG CAT GGT CTC AGC AGT AAT ACA AAG CAG TAT CTT CCG G (서열번호 13) CDR3_c : GAA GAC CTC TGC GCG GCA GCC 111 111 GGC 111 111 111 CCG CTG 111 111 111 111 TAT 222 TAC TGG GGT CAG GGC ACC CAA GTT ACC GTT TCT (서열번호 14) 5’_flank_for : CGA AAT TAA TAC GAC TCA CTA TAG GGA GAC (서열번호 15) 5’_flank_rev : TAT AGC TCT TCA ACT ACC CAT GGA TAT ATC TCC (서열번호 16) 3’_flank_for : TAT AGC TCT TCT GCA AAG CTT TAT ATG GCC TC (서열번호 17) tolAK_rev : CCG CAC ACC AGT AAG GTG TGC GGT TTC AGT TGC CGC TTT CTT TCT (서열번호 18) RT primer : CTT CAG TTG CCG CTT TCT TTC TTG (서열번호 19) Long_FX_for : ATA TGC TCT TCT AGT CAA GTC CAG CTG GTG GAA TCG (서열번호 20) Long_FX_rev : TAT AGC TCT TCA TGC AGA AAC GGT AAC TTG GGT GCC C (서열번호 21) qPCR_RD_5’_for : GGG AGA CCA CAA CGG TTT CCC (서열번호 22) qPCR_ RD_L_5_rev : GCC GCT AGC CGC ACA GCT C (서열번호 23) 무작위 볼록 스캐폴드(Convex Scaffold) DNA 라이브러리 구축 Sb-convex를 포함하는 pRDV(Addgene, 132696)가 PCR을 위한 주형으로 선택하였다. FW_c_for 및 Link2_c_rev 프 라이머는 CDR1 및 CDR2 영역을 포함하는 볼록 스캐폴드의 전자 영역(former region)을 증폭하는 데 사용하였다. Link2_c_for, FW_c_rev 및 CDR3_c 프라이머는 CDR3 영역의 무작위화로 볼록 스캐폴드의 후자 영역(latter region)을 증폭하는 데 사용하였다. 무작위 프라이머 CDR3_c는 10개의 서로 다른 트리뉴클레오티드 잔기를 포 함하며, 그 중 9개는 A, S, T, N, Y(각각 10.6%)가 풍부하고, D, E, Q, R, K, H, W(각각 5%)를 포함하며, 무극성 아미노산 F, M, V, I, L, G가 거의 없는 것을 특징으로 한다(각각 2%)1. 또 다른 트리뉴클레오타이드 잔기에는 아미노산 D와 A가 없는데, 그 이유는 전술한 두 가지의 아미노산이 β-시트의 말단에서 과소 대 표되기 때문이다2. BbsI 제한 부위는 전자(뼈대 부위, scaffold) 및 후자(무작위화 부위, randomized) 볼록 단 편의 양 말단에 존재하는데, 이들은 제한되었고(restricted), 연결(ligated)되어 3.17×1012의 다양성을 갖는 볼록 라이브러리(convex library)를 형성하였다. 인-비트로 전사 CDR3 무작위 볼록 라이브러리(CD3-randomized convex library)의 5' 및 3' 영역은 모두 전사되기 전에 플랭킹 되게(flanked) 하였다. 5' 측면 영역 및 3' 측면 영역은 각각 5'_flank_for와 5'_flank_rev 프라이머; 및 3'_flank_for 와 tolAK_rev 프라이머;를 사용하여 Sb-convex(Addgene, 132696)를 포함하는 플라스미드 pRDV5로 부터 증폭시켰다. 측면 영역(flanking regions)은 BspQI로 제한한 다음 라이브러리의 각 끝에 연결시켰다. 측 면 영역이 있는 라이브러리는 매뉴얼에 따라 T7 Ribomax™ RNA 생산 시스템(Promega, P1320)을 사용하여 전사하 였다. 리보솜 디스플레이 리보솜 디스플레이는 최소한의 노력으로 약 1012개의 서로 다른 라이브러리 구성원을 표시할 수 있는 이점을 제 공할 수 있다1. 그러나 이 방법은 시약 및 불리한 RNase 활성에 관한 몇 가지 이유로 인해 널리 적용되지 않았 다3. 기술적인 장애물을 극복하기 위해 체외 번역 키트(in vitro translation kit) PUREfrex2.1(GeneFrontier, PF213-0.25-EX)을 채택하였다1. 키트는 산화 글루타티온(GSSG)과 이황화 다리 이성 질화 효소(DsbC)가 결여되어 있으며, 이들은 이황화 결합 폴딩(disulfide bond folding)을 형성하기 위해 추가 로 지지(supported)되었다. 70ng의 RNA 라이브러리(약 1.7×1012 분자)를 입력(input)으로 사용하였으며, 실험과정은 매뉴얼을 따랐다. 리보솜 복합체 형성을 위해 시험관 내 번역 반응을 37℃에서 1시간 동안 진행하였다. 리보솜 디스플레이 전에 Dynabeads™MyOne™StreptavidinT1 비드(Invitrogen, 65601) 12ul를 WTB-BSA 완충액 (50mM Tris/acetate pH7.4, 150mM NaCl, 50mM MgAc2, BSA 보충)으로 0.5%로 두 번 세척하였다. 그런 다음 자 기 비드(magnetic bead)를 WTB-BSA 버퍼로 20분 이상 차단하였다. 리보솜 복합체(ribosomal complex)를 100ul 의 패닝 용액(500ug의 heparin과 1ul의 RNaseIn(Promega N2611)이 첨가된 WTB-D-BSA(0.1% tween20이 첨가된 WTB-BSA))에 첨가한 다음, 혼합물을 20,000xg에서 5분간 원심분리하였다. 상층액을 비오틴화된 IL-4R(Acro Biosystems, ILR-H82E9)과 혼합하고 얼음에서 2시간 동안 인큐베이션하였다. 자기 비드(magnetic bead)를 WTB-B-BSA로 3회 세척하고 패닝-IL-4R 혼합물을 비드에 첨가한 다음 얼음에서 1시간 동안 인큐베이션하였다. 그런 다음 전체 혼합물을 WTB-D(50mM Tris/아세테이트 pH7.4, 150mM NaCl, 50mM MgAc2, 0.1% Tween20이 보충됨)로 3회 세척하였다. 상층액은 15ul 용출량의 RNeasy 키트(Qiagen, 74004)를 사용하여 정제하였다. 역전사 리보솜 디스플레이에서 용출된 RNA는 매뉴얼에 따라 총 부피 30ul의 SuperiorScript III 역전사효소 (Enzynomics, RT006M)를 사용하여 역전사하였다. 생성된 cDNA를 30ul 용출량의 PCR 정제 미니 키트(Favorgen, FAGCK 001-1)를 사용하여 정제하였다. 생성된 cDNA를 30ul 용출량의 PCR 정제 미니 키트(Favorgen, FAGCK 001-1)를 사용하여 정제하였다. 1ul의 용출액을 qPCR 분석의 주형로 사용하고 29ul의 elution을 증폭에 사용하 였다. 생성된 cDNA 형태의 DNA 정제는 Long_FX_for 및 Long_FX_rev 프라이머를 사용한 PCR에 의해 증폭하였다. 총 반응 부피는 100ul이었고 반응이 끝나면 두 개의 튜브로 나누었다. qPCR qPCR 분석은 리보솜 디스플레이 및 파지 디스플레이 선택으로 인한 cDNA의 품질을 평가하여 선택 단계 동안 라 이브러리의 농축을 모니터링하는 데 사용하였다4. 실험을 위해 AccuPower® 2X Greenstar qPCR 마스터 믹스 (Bioneer, K-6251)와 함께 QuantStudio 3 Real-time PCR 기기(Applied Biosystems)를 사용하였다. PCR 프로그 램 조건은 다음과 같다: 95℃, 2분 (초기 변성) / 95℃, 10초 ; 63℃, 30초(변성, 어닐링, 연장, 측정) / 용융 곡선 단계는 기계 설명서의 기본 설정을 따랐다. 전기천공 FX 클로닝5을 사용하여 농축된(enriched) 나노바디(sybody) 라이브러리를 파지미드 벡터 pDXinit(Addgene, 110101)에 도입하였다. E. coli SS320(Lucigen, 60512-1) 350ul를 얼음 위에서 해동하고, 농축 라이브러리 (enriched library)를 포함하는 파지미드(phagemid)의 ligation mix 50ul를 SS320이 있는 전기천공 큐벳 (Biorad, 1652086)에 넣고 부드럽게 피펫팅하여 혼합하였다. 세포 혼합물은 2.4kV, 25uF 및 300Ω을 사용하는 Biorad Gene Pulser II 전기천공 시스템으로 펄스화(pulsed)하였다. 전기천공된 세포를 즉시 25ml의 SOC 배지 로 옮기고 37℃, 160rpm에서 30분 동안 배양하였다. 이어서, 회수 배양물을 200ug/ml 암피실린 및 2% 글루코스 가 보충된 2TY 배지 225ml로 옮기고, 37℃, 160rpm에서 밤새 인큐베이션하였다. 파지의 생산 및 정제 1ml의 전기천공 전배양물을 50ml의 2YT 배지(200ug/ml 암피실린 및 2% 포도당 보충)에 첨가한 다음 OD600 = 0.6 이 될 때까지 37℃, 160rpm에서 배양하였다. 그런 다음 배양액 10ml를 M13KO7 헬퍼 파지(NEB, N0315S) 30ul와 혼합하고 37℃에서 1시간 동안 진탕하지 않고 배양하였다. 인큐베이션된 배양물을 5,000xg에서 10분간 원심분 리한 후 상층액을 제거하였다. 펠렛을 50ml의 2YT 배지(200ug/ml 암피실린 및 25ug/ml 카나마이신 보충)로 재 현탁하고 37℃, 160rpm에서 밤새 인큐베이션하였다. 밤새 인큐베이션된 배양물을 6,000xg, 4℃에서 30분 동안 원심분리하였다. 40ml의 상등액을 새로운 50ml 튜브에 옮기고, 10ml의 PEG6000/NaCl을 첨가하고 튜브를 약 5회 뒤집었다. 혼합물을 얼음에서 밤새 인큐베이션한 다음, 10,000xg, 4℃에서 1시간 동안 원심분리하였다. 상층액을 제거한 후, 튜브를 PBS 40ml로 부드럽게 세척하고, 이어서 PBS 1ml로 재현탁시켰다. 재현탁된 파지를 20,000xg, 4℃에서 5분간 원심분리하고 상층액을 새 튜브에 수집하였다. 수집된 파지의 역가는 269nm 및 320nm에서 UV 가시광선 분광기를 이용하여 측정한 후 다음 식에 의해 계산하였다:"}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "파지 디스플레이 E. coli SS320을 50ml의 2YT 배지(10ug/ml 테트라사이클린 보충)에서 배양하고 파지 디스플레이 하루 전에 4℃ 에서 96웰 플레이트의 절반을 100ul의 67nM 뉴트라비딘으로 코팅하였다. - 파지 디스플레이의 첫 번째 라운드 뉴트라비딘 코팅된 플레이트를 각 웰에 대해 250ul의 TBS로 세척하고, 250ul의 TBS-BSA(0.5% BSA가 보충된 TBS)로 차단하였다. Biotinylated IL-4R을 4.9ml의 정제된 파지(1012 phages/ml)에 첨가하여 단백질 농도가 50nM이 되도록 한 후 얼음에서 2시간 동안 배양하였다. 뉴트라비딘 코팅된 플레이트를 250ul TBS-BSA-D(0.5% BSA 및 0.1% 트윈 20으로 보충된 TBS)로 세척하였다. 100ul의 파지-IL-4R 혼합물을 플레이트의 각 웰에 첨가하 고, 얼음에서 1시간 동안 인큐베이션하였다. 플레이트의 각 웰을 150ul의 TBS-D(0.1% 트윈 20이 첨가된 TBS)로 3회 세척하고, 플레이트를 각 세척 단계 후 2분 동안 페이퍼 타월 상에서 건조시켰다. 100ul의 PD 용출 완충액 (분말로 첨가된 0.25ml/ml 트립신이 첨가된 TBS)을 각 웰에 첨가하고, 플레이트를 실온에서 10분 동안 인큐베이 션하였다. 용출된 용액을 새로운 튜브에 옮기고, 튜브에 AEBSF 용액(Merck, A8456) 40ul를 첨가하였다. 1ul의 샘플을 qPCR을 통해 분석하고, 나머지 샘플을 50ml의 배양된 SS320에 첨가하였다. 혼합물을 37℃에서 1.5시간 동안 진탕하지 않고 배양한 후, 혼합물 50ml를 2YT 배지(200ug/ml 암피실린 및 2% 포도당 보충) 200ml에 옮기고 37℃, 160rpm에서 밤새 배양하였다. - 파지 디스플레이의 두 번째 라운드 1차 파지 디스플레이에서 생성된 파지를 TBS-BSA-D(5×1012 phages/ml)에서 수확하고 정제하였다. 50nM 농도의 파지 용액 100ul에 Biotinylated IL-4R을 첨가하고 얼음에서 2시간 동안 배양하였다. Dynabeads™MyOne™ StreptavidinC1 비드(Invitrogen, 65001) 12ul를 TBS-WTB-BSA 500ul로 두 번 세척한 다음, 얼음에서 WTB-BSA 500ul로 20분 이상 동안 차단하였다. 마그네틱 비드를 500ul의 TBS-BSA-D로 3회 세척한 다음, 재현탁하고 얼음 에서 파지-IL-4R 복합체 용액과 함께 1시간 동안 인큐베이션하였다. 인큐베이션 후, 혼합물을 500ul의 TBS- BSA-D로 세척한 다음, 비-바이오티닐화(non-biotinylated) IL-4R(Sino Biological, 10402-H08H) 5uM로 보충한 TBS-BSA-D인 ‘경쟁 완충제(competition buffer)’100ul로 재현탁하였고, 얼음에서 3분 동안 인큐베이션하였다. 경쟁적인 비-바이오티닐화(non-biotinylated) IL-4R은 TBS-D 500ul로 2회 세척하여 세척하였다. 비드를 PD 용 출 완충액 100ul로 재현탁하고, 실온에서 10분 동안 인큐베이션하였다. 생성된 용액에 0.8ul의 ABESF를 첨가하 여 피펫팅하여 혼합하고, 1ul의 용액을 qPCR 분석에 사용하고, 나머지 용액은 SS320의 감염에 사용하였다. E. coli SS320을 200ug/ml 암피실린 및 2% 글루코스가 보충된 2YT 배지에서 37℃, 160rpm에서 밤새 배양하였다. 비오틴화된 MBP의 생산 및 정제 플라스미드 pBXNH3CA_MBP(addgene, 132700)를 발현을 위해 E.coli BL21로 형질전환시켰다. 이를 37℃, 160rpm 에서 4시간 동안 100ug/ml 암피실린이 보충된 TB 배지에서 배양하였다. 발현 및 비오틴화(biotinylation)를 위 해 아라비노스(arabinose) 및 비오틴(biotin)을 각각 0.02% 및 100uM 농도로 첨가하였다. 그 후 발현을 위해 22℃, 160 rpm에서 밤새 배양을 진행하였다. 밤새 배양물을 초음파 처리한 후 MBP MiniExcellose® (Takara, AEx-MC-M03)를 사용하여 정제하였다. 효소 결합 면역 흡착 분석법 (ELISA) FX 클로닝 방법을 사용하여, 파지 디스플레이를 통하여 2회에 걸쳐 농축된 라이브러리(enriched library)를 pSBinit 벡터(addgene, 110100)에 클로닝하였다5. 클로닝된 플라스미드를 전기천공법을 통해 E. coli SS320에형질전환시킨 후, 37℃, 160rpm에서 밤새 배양한 다음, 플라스미드를 추출하였다. 추출된 플라스미드를 E. coli BL21(Enzynomics, CP110)로 형질전환하고 25ug/ml 클로람페니콜이 보충된 LB-한천 플레이트에 플레이팅한 다음 37℃에서 밤새 인큐베이션하였다. 25ug/ml 클로람페니콜이 보충된 1.2ml의 TB 배지를 '전배양'이라고 표시된 96-웰 딥웰 플레이트의 각 웰에 준비 하였다. 인큐베이션된 플레이트에서 95개의 콜로니를 선택하고 각 콜로니를 각 웰에 접종하고 첫 번째 웰을 MBP 나노바디 Sb_MBP#1(addgene, 132699)을 포함하는 양성 대조군 pSb_init로 채웠다. 딥 웰 플레이트는 기체 투과성으로 밀봉되었고 37℃, 300rpm에서 4시간 동안 성장시켰다. 25ug/ml 클로람페니콜이 보충된 미리 데운 TB 배지 1ml로 채워진 새로운 96웰 딥웰 플레이트는 '발현 배양'으로 표시되었다. 50ul의 '전배양'을 발현 배 양물의 해당 웰에 첨가하고 플레이트를 OD600 = 0.4~0.8이 될 때까지 37℃, 300rpm에서 2시간, 22℃, 300rpm에서 인큐베이션하였다. 충분히 성장시킨 후, 0.02%(wt/vol)의 L-(+)-아라비노스를 첨가하여 발현을 유도하고, 22℃, 150rpm에서 밤새 배양하였다. 다음날, 세포를 5,000xg, 4℃에서 15분 동안 원심분리하여 수집하였다. '전배양'의 팔레트는 DNA 정제를 위해 -20℃에 보관되었고, '발현 배양'의 팔레트는 100ul의 주변세포질 추출 완충액(20% sucrose, 50mM Tris pH8.0, 0.5mM EDTA 및 0.5ug/ml의 리소자임(DW로 표시))으로 강한 소용돌이 (intensive vortex)로 재현탁하였다. 얼음에서 30분간 인큐베이션한 후, 1mM MgCl2가 첨가된 TBS 900ul를 각 웰에 첨가하였다. 플레이트를 5,000xg, 4℃에서 15분 동안 원심분리하고 상층액을 ELISA를 위한 주변 세포질 추출액(periplasmic extraction)으로 사용하였다. 2개의 96-웰 면역 플레이트를 100ul의 5ug/ml 단백질 A(protein A) 용액으로 코팅하고 접착제 밀봉과 함께 4℃에서 밤새 인큐베이션하였다. 플레이트를 웰당 250ul 의 TBS로 세척한 다음, 웰당 150ul의 TBS-BSA로 차단하였다. 그 다음, TBS-BSA-D에 1:2,000으로 희석된 항-c- Myc 항체(Biolegend, 626802) 100ul를 웰당 첨가하고, 20분 동안 배양하였다. 250ul의 TBS-D로 3회 세척한 후, IL-4R 간의 나노바디 결합을 비교하기 위해 각 웰에 TBS-BSA-D 80ul를 첨가하고 나노바디의 IL-4R 및 MBP와 의 결합 정도를 비교하기 위하여, 동일한 주변 세포질 추출액 20ul를 나란히 첨가하였으며, 20분 동안 인큐베이 션하였다. 플레이트를 웰당 250ul의 TBS-D로 세척하고, 처음 두 개의 웰에 100ul의 50nM MBP를 첨가하고, 각각 의 웰에 100ul의 50nM 비오틴화된 IL-4R을 첨가하고, 플레이트를 20분 동안 인큐베이션하였다. 250ul TBS-D로 3회 세척한 후, TBS-BSA-D에 희석된 1:5,000 streptavidin-peroxidase(Invitrogen, 434323) 100ul를 각 웰에 첨가하고 20분 동안 배양하였다. 플레이트를 다시 TBS-D로 3회 세척하고, 100ul의 TMB 기질(biolegend, 421101)을 각 웰에 첨가하였다. 반응은 개별 웰이 파란색으로 변할 때까지 약 15분이 소요되었다. 흡광도는 플레이트 판독기로 650nm에서 측정하였다. 나노바디의 생산 및 정제 발현 벡터(pSBinit) 내의 나노바디 클론을 E. coli BL21에 형질전환시키고, 37℃, 160 rpm에서 밤새 배양하였다. 밤새 배양한 배양액 2ml를 클로람페니콜 25ug/ml가 첨가된 TB 배지 200ml에 접종하고 OD600 = 0.6 이 될 때까지 37℃, 200rpm에서 배양한 후, 배양액을 22℃, 150rpm으로 1시간 동안 이동시켰다. 발현 유도를 위해 아라비노스 0.02%를 첨가하고 37℃, 150rpm에서 밤새 배양하였다. 밤새 배양한 배양물을 5,000xg, 4℃에 서 15분 동안 원심분리하고, 팔레트를 얼음에서 20ml의 주변 세포질 추출 완충액으로 30분 동안 재현탁하였다. 인큐베이션 후, 1mM MgCl2가 첨가된 TBS 180ml를 첨가하고, 5,000xg, 4℃에서 15분 동안 원심분리하였다. 1ml의 TALON®Superflow™(Cytiva, 28957502) 슬러리를 TBS pH 8.0으로 미리 평형화(pre-equilibrated)하였다. 결합 후 비드를 세척 완충액(50mM Tris pH 8.0, 300mM NaCl, 5mM 이미다졸)으로 3회 세척한 후, 나노바디를 용 출 완충액(50nM Tris pH 8.0, 300mM NaCl, 200mM 이미다졸)으로 용출시켰다. 용출된 나노바디는 Slide-A- Lyzer® Dialysis Cassette(Thermo, 66330)을 사용하여 밤새 완충액을 교환하였다. IL-4R 억제 측정을 위한 STAT6-루시페라제 리포터 시스템 HEK293 세포주는 퓨로마이신(puromycin) 내성 렌티바이러스 시스템(lentivirus system)에 의해 human STAT6(addgene, 81950)을, blasticidin 내성 system에 의해 pSTAT6에 의해 유도된 luciferase(addgene, 3555 4)를 안정적으로 발현시켜 IL-4 신호의 STAT6 응답에 의한 조절하에 luciferase가 안정적으로 발현될 수 있도 록 하였다6,7. 5 x 104개의 리포터 세포를 96-웰 세포 배양 플레이트의 각 웰에 시딩하고 hIL-4 및 무혈청 RMPI 배지에서 두필루맙 또는 나노바디 중 하나와 함께 37℃ 및 5% CO2 환경으로 24시간 동안 배양하였다. 세포 용해(cell lysis)를 백색 96-웰 플레이트로 옮기고, 50ul의 루시퍼라제 기질(Promega, E1501)을 첨가하였다. 랜 덤 발광 단위(Random luminescence unit)는 SpectraMax®M5 발광계(Molecular Devices)로 측정하였다. 면역형광 염색 및 이미지 분석 트랜스웰의 HNE 세포를 PBS로 세척하고 500ul의 4% 파라포름알데히드(Biosesang, P2031)로 실온에서 30분 동안 고정하였다. 그런 다음 HNE 세포를 100ul(1:200)의 FOXJ1 1차 항체(GeneTex, GTX114408)와 함께 1시간 동안 인큐베이션하였고, 그 다음 100ul(1:1000)의 마우스 항-토끼 FITC와 30분 동안 인큐베이션한 후 PBS로 세 번 세 척하였다. 세포들은 405, 488nm 레이저의 매개변수(parameter) 설정을 사용하여 Zeiss LSM 700에서 사진을 촬 영했으며 Z-stack 다차원 획득 기능을 적용하였다. Z-stack 슬라이스의 이미지는 간격을 8um로 설정하여 얻었 다. 인-실리코 친화성 성숙(In-silico affinity maturation) 인공지능 기반 구조예측을 통해 나노바디의 구조를 예측한 뒤, 수용체와의 결합 구조를 파악하였다. 파악한 수 용체와의 결합 구조 및 컴퓨터 프로그램 기반 결합력 증강 기법을 통하여 수용체에 대한 결합력을 증가시킬 수 있는 치환 돌연변이 H5 A110Y와 H5 E104R를 발굴하였다. 발굴된 돌연변이 H5의 친화도를 표면 플라스몬 공명 (surface plasmon resonance, SPR)을 통하여 분석하였다. 세포 표면 항원 결합 어세이 및 리포터 세포 어세이(Cell Surface Antigen Binding & Reporter Cell Assay) H5 나노바디 및 돌연변이 H5의 세포 결합력을 세포 표면 항원 결합 어세이을 통하여 분석하였고, IL-4 및 IL-13 수용체 차단능력을 각각 IL-4 및 IL-13 리포터 어세이를 통하여 분석하였다. 수용체 차단능력을 평가하기 위한 실험은 다음과 같이 수행하였다: HEK293세포에 렌티 바이러스를 이용하여 STAT6 유전자와 인산화-STAT6에 의해 발현될 수 있는 루시퍼레이즈 유전자를 삽입하는 방법으로 리포터 세포주 를 제작하였다. 5 x 104개의 리포터 세포를 96웰 플레이트에 IL-4/IL-13 및 나노바디와 함께 처리한 후, 37℃, 5% CO2에 24시간 인큐베이션 하였다. 배양액을 모두 제거한 후 20 μl의 용해 버퍼(1 ml의 DW에 포함된 25 mM Tris pH 8.0, 4 mM EGTA, 10% glycerol, 및 10 μl의 Triton X-100)를 처리한 후, 50 μl의 루시페린 기질을 첨가하여 발광을 측정하였다. 2가 나노바디(Bivalent Nanobody) 본 발명의 나노바디의 수용체 차단 능력을 극대화 하기 위하여, H5 또는 이의 치환 돌연변이 나노바디를 펩타이 드 링커로 연결한 이량체(dimer) 형태의 2가 나노바디(Bivaelent Nanobody)를 제작하였다. 제작된 2가 나노바디 의 수용체 친화도를 표면 플라즈몬 공명(surface plasmon resonance, SPR)을 통하여 분석하였다. 아울러, 제작 된 2가 나노바디의 세포 결합력을 세포 표면 항원 결합 어세이을 통하여 분석하였고, IL-4 및 IL-13 수용체 차 단능력을 각각 IL-4 및 IL-13 리포터 어세이를 통하여 분석하였다. 본 명세서에서는 일 구현예로서 AAA 펩타이드 링커를 사용하였다. AAA (서열번호 9) 공기-액체 인터페이스 배양(Air-Liquid Interface Culture) 본 발명에서 개발된 나노바디 또는 2가 나노바디의 비강세포 투과 효율 및 염증의 예방 또는 치료효과를 확인하 기 위하여 공기-액체 인터페이스 배양(Air-Liquid Interface Culture)를 준비하였다. 공기-액체 인터페이스 배 양은 투과성 막인 미세공극 막(micro-pore membrane) 상단에 인간 비강 상피 세포(human nasal epithelial cell)를 배양하고, 비강세포의 상단에는 공기층을, 비강세포의 하단에는 액체 배양 배지를 위치시켜서 준비하였 다. 공기-액체 인터페이스 배양은 다음과 같이 수행하였다: 인간 비강 상피세포는 비염/비용종 환자로부터 얻어내었 으며, 2차 패시지(passage)의 1차 배양 비강 상피세포는 기저상피 성장 배지가 포함된 배양액에서 트랜스웰 (transwell)을 이용하여 배양하였다. 세포가 잠긴 상태로 3일간 배양한 뒤, 위쪽 부분의 배양액을 제거하여 공 기-액체 인터페이스 (ALI) 배양을 시행하였다. ALI 배양 2주 뒤 완전히 분화된 비강 상피세포를 실험에 사용하 였다. 공기-액체 인터페이스 배양(Air-Liquid Interface Culture)를 이용하여 ex-vivo 조건에서 H5의 수용체 차단 능 력 및 염증 치료 효과를 확인하였다. 염증에 대한 마커는 MUC5AC, CCl26 및 FOXJ1을 이용하였다. 아울러, 공기-액체 인터페이스 배양(Air-Liquid Interface Culture)에서 비강 상피 세포 상단에 물질을 처리한 후, 하단의 세포 배양액에서 웨스턴 블롯팅을 실시하여 세포 투과율을 확인하였다. 비강 상피세포의 밀착 연접 단백질의 분석 비강 상피 세포에 IL-4/IL-13을 처리한 후, 밀착 연접 단백질인 Zo-1 및 Occuldin의 발현량을 측정하여, IL- 4/IL-13에 의하여 염증반응이 발생한 경우 세포 투과도의 변화를 측정하였다. 나노바디 후보들의 서열 H5 CDR 서열 (서열번호 1) : DKGREYTLARAKYWYW H5 CDR 서열, E5R 돌연변이 (서열번호 2) : DKGRRYTLARAKYWYW H5 CDR 서열, A11Y 돌연변이 (서열번호 3) : DKGREYTLARYKYWYW H5 CDR 서열, E5R + A11Y 돌연변이 (서열번호 4) DKGRRYTLARYKYWYW H5 전장서열 (서열번호 5) : QVQLVESGGGSVQAGGSLRLSCAASGSISSITYLGWFRQAPGKEREGVAALSTSSGTTYYADSVKGRFTVSLDNAKNTVYLQMNSLKPEDTALYYCAAADKG REYTLARAKYWYWGQGTQVTVSAGRAGEQKLISEEDLNSAVDHHHHHH H5 전장서열, E104R 돌연변이 (서열번호 6) : QVQLVESGGGSVQAGGSLRLSCAASGSISSITYLGWFRQAPGKEREGVAALSTSSGTTYYADSVKGRFTVSLDNAKNTVYLQMNSLKPEDTALYYCAAADKG RRYTLARAKYWYWGQGTQVTVSAGRAGEQKLISEEDLNSAVDHHHHHH H5 전장서열, A110Y 돌연변이 (서열번호 7) : QVQLVESGGGSVQAGGSLRLSCAASGSISSITYLGWFRQAPGKEREGVAALSTSSGTTYYADSVKGRFTVSLDNAKNTVYLQMNSLKPEDTALYYCAAADKG REYTLARYKYWYWGQGTQVTVSAGRAGEQKLISEEDLNSAVDHHHHHH H5 전장서열, E104R + A110Y 돌연변이 (서열번호 8) : QVQLVESGGGSVQAGGSLRLSCAASGSISSITYLGWFRQAPGKEREGVAALSTSSGTTYYADSVKGRFTVSLDNAKNTVYLQMNSLKPEDTALYYCAAADKG RRYTLARYKYWYWGQGTQVTVSAGRAGEQKLISEEDLNSAVDHHHHHH 실험결과 항IL-4R 나노바디 스크리닝의 최종 과정 리보솜 디스플레이 및 2회의 파지 디스플레이 후, 약 102개의 나노바디 클론을 스크리닝하였다. 이 나노바디들 의 풀을 풍부(enrich)하게 하기 위해 IL-4R 및 MBP에 대해 ELISA를 수행하였다. 그래프의 y축은 IL-4R과 MBP 에 대한 OD 값의 배수변화도(fold-change) 나타내며, 이는 각 나노바디 클론의 IL-4R에 대한 특이성을 의미한 다. 붉은색 박스로 표시된 클론은 임계값(1.7)보다 폴드 변경 값이 더 높은, 최종적으로 선택된 나노바디들이 다. 겹치는 시퀀스를 제외하고 발명자들은 최종적으로 4개의 다른 나노바디 시퀀스인 H5, G5, E9 및 B3을 얻었 다(도 1).IL-4R에 대한 나노바디 후보들의 결합 친화도 IL-4R에 대한 4개의 최종 나노바디 후보를 리보솜 디스플레이, 파지 디스플레이 및 ELISA를 통해 선별하였다. 각각의 나노바디를 정제하고, 동일한 농도의 나노바디의 IL-4R 분자에 대한 결합 친화도를 확인하기 위해 ELISA 를 통해 조사하였다. 그 결과, H5 나노바디가 동일한 농도의 4가지 후보 중에서 IL-4R 분자에 대한 결합 친화 도가 가장 높다는 것을 알 수 있었다(도 2). 나노바디 후보의 IL-4 신호 차단 활성 3개의 나노바디 후보를 이전 ELISA 결과에 따라 선택하여 결합 친화도가 IL-4 신호 차단 기능과 관련이 있는지 조사하였다. 3가지 다른 농도의 각 나노바디의 신호 차단 기능을 두필루맙(Dupilumab)의 신호 차단 기능과 비 교하였다. 리포터 세포를 83pM의 IL-4 및 각 나노바디(또는 항체)와 함께 24시간 동안 인큐베이션하였다. 그 결과 두필루맙과 H5 나노바디가 후보 중 가장 효과적인 IL-4 신호 차단제임을 확인할 수 있었다(도 3). 두필루맙(Dupilumab)과 H5의 IL-4 신호 차단 활성의 비교 이전 결과에 따라, H5 나노바디를 최종 IL-4R 차단 나노바디로 선택하였다. 3가지 다른 농도에서 각 나노바디 의 신호 차단 활성을 두필루맙과 비교하였다. 리포터 세포를 667pM의 IL-4 및 나노바디(또는 항체)와 함께 24 시간 동안 인큐베이션하였다. H5 나노바디는 약 2배 농도에서 두필루맙과 유사한 차단 활성을 나타냄을 알 수 있었다(도 4). 두필루맙(Dupilumab)과 H5의 세포 결합 친화도의 비교 HEK293 세포에 대한 두필루맙과 H5 나노바디의 결합 친화도를 플레이트 판독기를 통해 평가하였다. 항-인간 IgG-FITC를 두필루맙의 2차 항체로 사용하였고, 항-Myc-FITC를 H5 나노바디의 2차 항체로 사용하였다. 각 항체 (나노바디)의 형광 단위를 각 2차 항체의 형광 단위로 표준화하였다. 도 4 및 도 5의 결과는 신호 차단 활성이 항체(나노바디)와 세포의 결합에 의존함을 시사한다. IL-4, 두필루맙(Dupilumab) 및 나노바디에 의한 FOXJ1 발현 조절 (도 6) FOXJ1은 forkhead box family 전사인자 중 하나로 IL-4/IL-13 신호전달에 의해 발현이 억제되고 STAT6이 인산 화된다. 도 6a는 IL-4, 두필루맙 및 H5 나노바디로 처리된 인간 비강 상피 세포(HNE)의 정사 이미지(ortho image)이다. 두필루맙 및 H5의 투여는 IL-4 신호전달을 차단하고 후속적으로 FOXJ1의 발현을 유도하는 것으로 나타났다. 도 6c는 두필루맙과 H5를 IL-4 없이 처리했을 때 FOXJ1 발현이 유도됨을 보여주고 있으며, 이는 항 체와 나노바디가 IL-4R에 대한 어떤 작용제(agonistic) 활성을 가지지 않음을 의미한다. 그러나 FOXJ1의 발현 은 IL-4 및 항-MBP 나노바디를 모두 처리했을 때 억제되는데, 이는 나노바디 스캐폴드 자체가 IL-4R에 대한 길 항 효과가 없음을 시사한다. 도 6b 및 6c는 해당 HNE 샘플의 3D 이미지이다. 인-실리코 친화성 성숙(In-silico affinity maturation)을 통해 나노바디의 수용체 결합능력을 극대화시켰다. 인공지능 기반 구조예측 방법 및 컴퓨터 프로그램 기반 결합력 증강 기법을 통하여 발굴한 H5 A110Y 돌연변이 및 H5 E104R 돌연변이의 경우, 각각 KD가 708nM 및 1.06nM으로 측정되었다. WT H5의 KD가 1,42uM인 것과 비교 할 때, 최대 2배 가량의 결합력 증가 효과를 확인할 수 있었다(도 8). H5 및 이의 치환 돌연변이와 2가 나노바디(Bivalent Nanobody)의 수용체 차단능력이 두필루맙보다 월등히 뛰어 남을 확인하였다 본 발명의 H5, H5 A110Y 돌연변이 및 H5 E104R 돌연변이와, 제작된 2가 나노바디(Bivalent Nanobody)의 세포 결합력 및 수용체 차단능력을 분석한 결과, 2가 나노바디의 경우 최대 50배 가량 결합력이 증가한 것을 확인할 수 있었다(도 11). 아울러, 2가 나노바디의 경우 분자 결합력 뿐만 아니라, 세포 결합력 및 수용체 차단능력까 지 단일 나노바디(H5, H5 A110Y 돌연변이 및 H5 E104R 돌연변이) 보다 우수함을 확인할 수 있었다(도 12a 내지 12c). 본 발명의 나노바디는 세포 투과성 및 염증의 치료 효과가 두필루맙보다 뛰어남을 확인하였다 공기-액체 인터페이스 배양(Air-Liquid Interface Culture) 실험 결과, H5가 두필루맙보다 비강 세포 투과도(도 16) 및 염증의 차단 또는 치료효과(도 14a, 도14b 및 도 15)가 월등히 뛰어남을 확인할 수 있었다. 염증에 대한 마커는 MUC5AC, CCL26 및 FOXJ1을 사용하였다. MUC5AC는 IL-4/IL-13 신호전달에 의하여 과발현되 는 마커이고, CCL26은 IL-4/IL-13 신호전달에 의하여 과발현되는 마커이며, FOXJ1은 IL-4/IL-13 신호전달에 의 하여 억제되는 마커에 해당한다. 아울러, H5 및 H5 2가 나노바디의 경우 두필루맙보다 세포 사이 투과성 (paracellular permeability)이 뛰어남을 확인할 수 있었다(도 17). 한편, 비강 상피 세포에서 밀착 연접 단백질에 해당하는 Zo-1과 Occludin의 발현을 mRNA의 수준을 측정하여 분 석한 결과, IL-4 또는 IL-13을 투여한 경우 유의하게 감소한 것을 확인하여, IL-4 또는 IL-13가 과발현되는 염 증성 질환 환자에서 세포 투과성이 상승함을 확인하였다(도 18). 상기 결과를 종합하여, 본 발명의 나노바디는 작은 분자량을 통하여 상피 세포를 쉽게 투과할 수 있다는 점 및 염증 환자에서 비강 세포의 밀착연접이 감소한 다는 점을 종합하여, 결론적으로 본 발명의 나노바디는 비강분무 제형으로 제작되어 쉽게 염증환자의 비강 상피 세포를 통과함으로써 효율적으로 염증 반응을 경감시키거나 없앨 수 있음을 확인할 수 있었다. 이상으로 본 발명의 특정한 부분을 상세히 기술하였는 바, 당업계의 통상의 지식을 가진 자에게 있어서 이러한 구체적인 기술은 단지 바람직한 구현예일 뿐이며, 이에 본 발명의 범위가 제한되는 것이 아닌 점은 명백하다. 따라서, 본 발명의 실질적인 범위는 첨부된 청구항과 그의 등가물에 의하여 정의된다고 할 것이다. 참고문헌 1.Zimmermann, I. et al. Synthetic single domain antibodies for the conformational trapping of membrane proteins. eLife 7, e34317 . 2.Bhattacharjee, N. & Biswas, P. Position-specific propensities of amino acids in the b-strand. 10 . 3.Zahnd, C., Amstutz, P. & Pluckthun, A. Ribosome display: selecting and evolving proteins in vitro that specifically bind to a target. Nat. Methods 4, 269-279 . 4.Zimmermann, I. et al. Generation of synthetic nanobodies against delicate proteins. Nat. Protoc. 15, 1707-1741 . 5.Geertsma, E. R. & Dutzler, R. A Versatile and Efficient High-Throughput Cloning Tool for Structural Biology. Biochemistry 50, 3272-3278 . 6.Mikita, T., Campbell, D., Wu, P., Williamson, K. & Schindler, U. Requirements for interleukin- 4-induced gene expression and functional characterization of Stat6. Mol. Cell. Biol. 16, 5811-5820 . 7.Yu, X. et al. A robust reporter assay for the determination of the bioactivity of IL-4R- targeted therapeutic antibodies. J. Pharm. Biomed. Anal. 199, 114033 .도면 도면1 도면2 도면3 도면4 도면5 도면6a 도면6b 도면6c 도면6d 도면7 도면8 도면9a 도면9b 도면9c 도면10 도면11 도면12a 도면12b 도면12c 도면13 도면14a 도면14b 도면15 도면16 도면17 도면18"}
{"patent_id": "10-2023-0066415", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "서열목록(첨부)"}
{"patent_id": "10-2023-0066415", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 항-IL-4R 나노바디 스크리닝의 최종적인 프로세스에 관한 것으로, Y축은 IL-4R과 MBP에 대한 OD값의 배 수 변화(fold-change)를 나타내며, 이는 각 나노바디 클론의 IL-4R 특이성을 의미하고, 붉은색 상자로 표시된 클론은 임계값(1.7)보다 폴드 변경 값이 더 높은 최종적으로 선택된 나노바디를 나타낸다. 도 2는 4개의 최종 나노바디 후보에 대하여, IL-4R 분자에 대한 결합 친화도를 확인하기 위해 각각의 나노바디 를 정제하고, 동일한 농도의 나노바디를 ELISA를 통해 조사한 결과를 도시한 것으로, H5 나노바디가 동일한 농 도의 4가지 후보 중 IL-4R 분자에 대한 결합 친화도가 가장 높은 것으로 조사되었다. 도 3은 3개의 나노바디 후보를 ELISA 결과에 따라 선택하여, 결합 친화도가 IL-4 신호 차단 기능과 관련이 있는 지 조사한 결과를 도시한 그림으로, 각 나노바디의 신호 차단 정도를 3가지 다른 농도에서 두필루맙의 신호 차 단 정도와 비교하였다. 리포터 세포를 83pM의 IL-4 및 각 나노바디(또는 항체)와 함께 24시간 동안 인큐베이션 하였으며, 그 결과 두필루맙과 H5 나노바디가 후보 중 가장 효과적인 IL-4 신호 차단 효과를 가짐을 알 수 있었 다. 도 4는 최종 IL-4R 차단 나노바디로 선택된 H5 나노바디의 신호 차단 효과를 3가지 다른 농도에서 두필루맙의 신호 차단과 비교한 결과를 도시한 그림이다. 도 5는 두필루맙과 H5 나노바디의 HEK293 세포에 대한 결합 친화도를 플레이트 판독기를 통해 평가한 결과를 도 시한 그림이다. 도 6a 내지 도6d는 IL-4, 두필루맙 및 나노바디에 의한 FOXJ1 발현의 조절을 면역형광 염색 및 이미지 분석을 수행한 결과를 도시한 그림이다. 도 7은 본 발명의 H5의 구조를 Alphafold Ⅱ 프로그램을 이용하여 나타낸 그림이다. 도 8은 H5 및 이의 치환 돌연변이인 H5 A110Y 및 H5 E104R의 수용체에 대한 친화력을 표면 플라스몬 공명 (Surface plasmon resonance, SPR) 방법으로 분석한 결과를 도시한 그림이다. 도 9a는 H5 및 이의 치환 돌연변이인 H5 A110Y 및 H5 E104R의 세포 결합력을 분석한 결과를 도시한 그림이다. 도 9b는 H5 및 이의 치환 돌연변이인 H5 A110Y 및 H5 E104R의 IL-4 수용체에 대한 결합력을 리포터 어세이로 분 석한 결과를 도시한 그림이다. 도 9c는 H5 및 이의 치환 돌연변이인 H5 A110Y 및 H5 E104R의 IL-3 수용체에 대 한 결합력을 리포터 어세이로 분석한 결과를 도시한 그림이다. 도 10은 본 발명의 이량체(dimer) 형태의 나노바디인 2가 나노바디(bivalent nanobody)의 구조를 Alphafold Ⅱ 프로그램을 이용하여 나타낸 그림이다. 도 11은 H5 나노바디, H5 WT 2개로 구성된 2가 나노바디(bivalent nanobody), H5의 A110Y 치환 돌연변이 2개로구성된 2가 나노바디(bivalent nanobody) 및 H5의 E104R 치환 돌연변이 2개로 구성된 2가 나노바디(bivalent nanobody)의 수용체에 대한 친화력을 표면 플라스몬 공명(Surface plasmon resonance, SPR) 방법으로 분석한 결과를 도시한 그림이다. 도 12a는 H5 및 이의 치환 돌연변이인 H5 A110Y 및 H5 E104R, 그리고 본원 발명의 2가 나노바디(bivalent nanobody)의 세포 결합력 어세이의 결과를 도시한 그림이다. 도 12b는 H5 및 이의 치환 돌연변이인 H5 A110Y 및 H5 E104R, 그리고 본원 발명의 2가 나노바디(bivalent nanobody)의 IL-4 수용체 차단능력을 리포터 어세이로 분 석한 결과를 도시한 그림이다. 도 12c는 H5 및 이의 치환 돌연변이인 H5 A110Y 및 H5 E104R, 그리고 본원 발명 의 2가 나노바디(bivalent nanobody)의 IL-13 수용체 차단능력을 리포터 어세이로 분석한 결과를 도시한 그림이 다. 도 13은 본 발명의 나노바디의 비강 상피세포 통과 정도 및 염증의 예방 또는 치료 효과를 확인하기 위한 공기- 액체 인터페이스 배양(Air-Liquid Interface Culture) 방법을 도시한 그림이다. 도 14a 및 14b는 공기-액체 인터페이스 배양(Air-Liquid Interface Culture)에 각각 서로 다른 농도의 H5 나노 바디를 투입한 후, IL-4/IL-13 염증신호마커(MUC5AC, CCL26 및 FOXJ1)의 mRNA 수준을 qPCR을 통하여 분석한 결 과를 도시한 그림이다. 도 15는 공기-액체 인터페이스 배양(Air-Liquid Interface Culture)에 각각 서로 다른 농도의 H5 나노바디를 투입한 후, IL-4/IL-13 염증신호마커(MUC5AC)의 발현 수준을 면역염색법(Immunostaining)을 통하여 분석한 결과 를 도시한 그림이다. 도 16은 공기-액체 인터페이스 배양(Air-Liquid Interface Culture)에서 비강 상피 위쪽에 물질을 처리한 후 아 래쪽 세포 배양액을 웨스턴 블롯팅(WB)을 통하여 확인한 결과를 도시한 그림이다. 도 17은 H5, H5 2개로 구성된 2가 나노바디(bivalent nanobody) 및 두필루맙의 세포 사이 투과도 (paracellular permeability)를 분석한 결과를 도시한 그림이다. 도 18은 IL-4/IL-13을 처리한 비강 상피에서 밀착 연접 단백질인 Zo-1 및 Occludin의 mRNA의 발현량을 분석한 결과를 도시한 그림이다."}
