{"patent_id": "10-2020-0182271", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0065630", "출원번호": "10-2020-0182271", "발명의 명칭": "안테나를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "설경문"}}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제1 하우징 및 제2 하우징을 포함하는 하우징;플렉서블 디스플레이(flexible display);적어도 하나의 접촉 구조;상기 제1 하우징 내에 배치되는 제1 프로세서; 및제1 UWB 안테나, 제2 UWB 안테나, 제3 UWB 안테나 및 제4 UWB 안테나를 포함하고,상기 제1 하우징과 상기 제2 하우징이 적어도 하나의 접촉 구조를 통해 접촉하는 제1 상태에서 상기 플렉서블디스플레이의 적어도 일부는 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나의 내부로 인입되고,상기 제1 하우징과 상기 제2 하우징이 지정된 거리 이상 이격되는 제2 상태에서 상기 플렉서블 디스플레이의 적어도 일부는 상기 전자 장치의 외부에서 시인되도록 인출되고,상기 제1 상태에서:상기 제1 프로세서는 상기 제1 하우징 내에 배치되는 상기 제1 UWB 안테나 및 상기 제2 UWB 안테나, 및 상기 제2 하우징 내에 배치되고 상기 적어도 하나의 접촉 구조를 통해 전기적으로 연결되는 상기 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신하고,상기 제2 상태에서:상기 제1 프로세서는 상기 제1 UWB 안테나 및 상기 제2 UWB 안테나, 및 상기 플렉서블 디스플레이에 배치되는상기 제4 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제1 UWB 안테나 및 상기 제2 UWB 안테나는 상기 제1 하우징 내에 제1 축을 따라 배치되고,상기 제1 UWB 안테나, 상기 제3 UWB 안테나 및 상기 제4 UWB 안테나는 상기 제1 축에 수직한 제2 축을 따라 배치되는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 제1 상태에서 상기 제1 프로세서는:상기 제1 UWB 안테나 및 상기 제2 UWB 안테나에 기반하여 상기 제1 축에 평행한 제1 방향의 측위를 수행하고,상기 제1 UWB 안테나 및 상기 제3 UWB 안테나에 기반하여 상기 제2축에 평행한 제2 방향의 측위를 수행하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "에 있어서,상기 제5 UWB 안테나는 상기 제2 상태에서 상기 제1 상태로 전환됨에 따라 상기 제1 프로세서와 작동적으로 결합하고,상기 제1 프로세서는 상기 제1 UWB 안테나, 상기 제3 UWB 안테나 및 상기 제5 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서,상기 플렉서블 디스플레이에 배치되는 제5 UWB 안테나를 더 포함하고,상기 제5 UWB 안테나는 상기 제1 축과 평행하게 상기 제4 UWB 안테나와 나란히 배치되는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 제5 UWB 안테나는 상기 제1 상태에서 상기 제2 상태로 전환됨에 따라 상기 제1 프로세서와 작동적으로 결합하고,상기 제1 프로세서는 상기 제1 UWB 안테나, 상기 제4 UWB 안테나 및 상기 제5 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 2에 있어서,상기 플렉서블 디스플레이에 배치되는 제5 UWB 안테나 및 제6 UWB 안테나를 더 포함하고,상기 제5 UWB 안테나는:상기 제2 축을 따라 상기 제4 UWB 안테나와 나란히 배치되고,상기 제2 상태에서 상기 제1 하우징에 배치되는 상기 제1 프로세서와 작동적으로 결합하고,상기 제6 UWB 안테나는: 상기 제1 축과 평행하게 상기 제5 UWB 안테나와 나란히 배치되고상기 제2 상태에서 상기 제1 하우징에 배치되는 상기 제1 프로세서와 작동적으로 결합하고상기 제1 프로세서는 상기 제4 UWB 안테나, 상기 제5 UWB 안테나 및 상기 제6 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 제1 프로세서는:UWB 통신과 관련된 어플리케이션을 실행하고,상기 제1 UWB 안테나, 상기 제2 UWB 안테나, 상기 제3 UWB 안테나 및 상기 제4 UWB 안테나 중 적어도 2개를 이용하여 외부 장치로부터 수신된 RF 신호에 기반하여, 상기 RF 신호의 RTT(round trip time) 및 AOA(angle ofarrival)를 식별하고,상기 식별되는 RTT 및 AOA에 기반하여 상기 외부 장치의 위치를 결정하도록 설정되는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2022-0065630-4-청구항 1에 있어서,상기 적어도 하나의 접촉 구조는 상기 제1 하우징의 제1 부분에 배치되는 제1 구조 및 상기 제1 하우징의 제1부분과 대향하는 제2 하우징의 제2 부분에 배치되는 제2 구조를 포함하고,상기 제1 구조는:제1 결합 부재;제1 접촉 부재; 및 상기 제1 결합 부재와 상기 제1 접촉 부재를 연결하는 제1 연결 부재를 포함하고, 상기 제2 구조는: 제2 결합 부재; 및제2 접촉 부재를 포함하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 제1 구조는 상기 제1 구조의 상기 제1 접촉 부재에 인접하여 배치되는 제1 자석을 포함하고,상기 제2 구조는 상기 제1 자석의 위치에 대응하여 상기 제2 구조의 상기 제2 접촉 부재에 인접하여 배치되는제2 자석을 포함하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,상기 제2 하우징 내에 배치되는 제2 프로세서; 및상기 플렉서블 디스플레이에 배치되는 제5 UWB 안테나 및 제6 UWB 안테나를 더 포함하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 제2 프로세서는:상기 제1 상태에서 상기 제1 UWB 안테나, 상기 제2 UWB 안테나 및 상기 제3 UWB 안테나와 작동적으로 결합하고,상기 제1 UWB 안테나, 상기 제2 UWB 안테나 및 상기 제3 UWB 안테나 중 적어도 2개에 기반하여 측위를수행하고,상기 제2 상태에서 상기 제3 UWB 안테나, 상기 제5 UWB 안테나 및 상기 제6 UWB 안테나와 작동적으로 결합하고,상기 제3 UWB 안테나, 상기 제5 UWB 안테나 및 상기 제6 UWB 안테나 중 적어도 2개에 기반하여 측위를수행하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 1에 있어서,상기 제1 하우징 또는 상기 제2 하우징 상에 배치되는 버튼을 더 포함하고,상기 버튼 입력시 상기 전자 장치는 상기 제1 상태에서 상기 제2 상태로 전환되거나, 상기 제2 상태에서 상기제1 상태로 전환되는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 1에 있어서,상기 제1 하우징의 일 면 또는 상기 제2 하우징의 일 면에 서브 디스플레이를 더 포함하는, 전자 장치.공개특허 10-2022-0065630-5-청구항 16 전자 장치에 있어서,제1 하우징 및 제2 하우징을 포함하는 하우징;플렉서블 디스플레이;적어도 하나의 접촉 구조;상기 제1 하우징 내에 배치되는 적어도 하나의 프로세서; 및제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나를 포함하고,상기 제1 하우징과 상기 제2 하우징이 적어도 하나의 접촉 구조를 통해 접촉하는 제1 상태에서 상기 플렉서블디스플레이는 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나의 내부로 인입되고,상기 제1 하우징과 상기 제2 하우징이 지정된 거리 이상 이격되는 제2 상태에서 상기 플렉서블 디스플레이는 상기 전자 장치의 외부에서 시인되도록 인출되고,상기 제1 상태에서:상기 적어도 하나의 프로세서는 상기 제1 하우징 내에 제1 축을 따라 배치되는 제1 UWB 안테나 및 제2 UWB 안테나, 및 상기 제1 축에 수직한 제2 축을 따라 상기 제2 하우징 내에 배치되고 상기 적어도 하나의 접촉 구조를통해 상기 적어도 하나의 프로세서와 전기적으로 연결되는 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 제1 UWB 안테나 및 상기 제2 UWB 안테나는 상기 제1 하우징 내에 제1 축을 따라 배치되고,상기 제1 UWB 안테나 및 상기 제3 UWB 안테나는 상기 제1 축에 수직한 제2 축을 따라 배치되는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16에 있어서,상기 제1 상태에서 상기 적어도 하나의 프로세서는:상기 제1 UWB 안테나 및 상기 제2 UWB 안테나에 기반하여 상기 제1 축에 평행한 제1 방향의 측위를 수행하고,상기 제1 UWB 안테나 및 상기 제3 UWB 안테나에 기반하여 상기 제2축에 평행한 제2 방향의 측위를 수행하는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서,상기 적어도 하나의 접촉 구조는 상기 제1 하우징의 제1 부분에 배치되는 제1 구조 및 상기 제1 하우징의 제1부분과 대향하는 제2 하우징의 제2 부분에 배치되는 제2 구조를 포함하고,상기 제1 구조는:제1 결합 부재;제1 접촉 부재; 및 상기 제1 결합 부재와 상기 제1 접촉 부재를 연결하는 제1 연결 부재를 포함하고, 상기 제2 구조는: 제2 결합 부재; 및제2 접촉 부재를 포함하는, 전자 장치. 공개특허 10-2022-0065630-6-청구항 20"}
{"patent_id": "10-2020-0182271", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "에 있어서,상기 적어도 하나의 프로세서는:UWB 통신과 관련된 어플리케이션을 실행하고,상기 제1 UWB 안테나, 상기 제2 UWB 안테나 및 상기 제3 UWB 안테나 중 적어도 2개를 이용하여 외부 장치로부터수신된 RF 신호에 기반하여, 상기 RF 신호의 RTT(round trip time) 및 AOA(angle of arrival)를 식별하고,상기 식별되는 RTT 및 AOA에 기반하여 상기 외부 장치의 위치를 결정하도록 설정되는, 전자 장치."}
{"patent_id": "10-2020-0182271", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 실시 예에 따른, 전자 장치는 제1 하우징 및 제2 하우징을 포함하는 하우징, 플렉서블 디스플 레이(flexible display), 적어도 하나의 접촉 구조, 상기 제1 하우징 내에 배치되는 제1 프로세서 및 제1 UWB 안테나, 제2 UWB 안테나, 제3 UWB 안테나 및 제4 UWB 안테나를 포함할 수 있고, 제1 상태에서 상기 제1 프로세서 (뒷면에 계속)"}
{"patent_id": "10-2020-0182271", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시 예들은 UWB 안테나를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2020-0182271", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치의 일 예로서 롤러블 전자 장치가 있다. 휴대용 전자 기기는 넓은 화면을 제공하기 위해 보다 큰 면적 을 가지도록 디스플레이를 포함할 수 있다. 그러나 디스플레이가 커질수록 전자 장치의 크기도 커지기 때문에 디스플레이의 크기에는 한계가 존재할 수 있다. 이러한 한계를 극복하기 위해 차세대 전자 장치로서 롤러블 전 자 장치는 플렉서블 디스플레이의 일부가 선택적으로 하우징 내부로 인입될 수 있다. 무선 통신 기술의 발전에 따라, 전자 장치가 외부 장치와 연결되어 다양한 기능을 제공하는 커넥티비티 (connectivity) 기술이 등장하고 있다. 예를 들어, 전자 장치는 전자 장치의 외부 장치와의 무선 통신에 기반하 여, 전자 장치 자체 또는 외부 장치(예: IoT 기기)의 위치를 검출할 수 있다. 전자 장치는 탐지된 위치에 기반 하여 외부 장치의 다양한 기능을 제어하거나, 전자 장치를 소지한 사용자에게 다양한 위치 기반 서비스를 제공 할 수 있다. 한편, 전자 장치의 위치 및/또는 외부 전자 장치의 위치를 정밀하게 검출하기 위하여 초광대역(예: UWB: ultra- wide band) 통신 기술이 적용되고 있다. 초광대역 통신 기술 적용을 위해서 측위 수행을 위한 복수 개의 UWB 안 테나를 포함할 수 있다."}
{"patent_id": "10-2020-0182271", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "롤러블 전자 장치는 디스플레이 일부가 하우징 내부로 인입된 상태(이하 제1 상태라 함)와 디스플레이 일부가 하우징 내부로부터 인출된 상태(이하 제2 상태라 함)를 가질 수 있다. 롤러블 전자 장치는 제1 상태에서 플렉서 블 디스플레이의 일부를 내부에 포함할 수 있다. 제1 상태에서 전자 장치의 내부에 위치하는 플렉서블 디스플레 이에 의해 롤러블 전자 장치는 무선 통신 기술이 발전함에 따라 다양한 기능 제공을 위한 안테나를 배치하기 위 한 하우징 내부의 공간이 부족할 수 있다. 예를 들어, 롤러블 전자 장치의 경우 UWB 안테나 배치를 위한 하우징 내부의 공간이 부족하여, 복수 개의 UWB 안테나 배치가 어려울 수 있다. 본 문서에 개시되는 다양한 실시 예들은, 전자 장치의 하우징의 내부 공간 및 플렉서블 디스플레이에 UWB 안테 나를 배치하여 복수 개의 UWB 안테나 배치하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2020-0182271", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시 예에 따른, 전자 장치는 제1 하우징 및 제2 하우징을 포함하는 하우징, 플렉서블 디스플 레이(flexible display), 적어도 하나의 접촉 구조, 상기 제1 하우징 내에 배치되는 제1 프로세서 및 제1 UWB 안테나, 제2 UWB 안테나, 제3 UWB 안테나 및 제4 UWB 안테나를 포함할 수 있고, 상기 제1 하우징과 상기 제2 하 우징이 적어도 하나의 접촉 구조를 통해 접촉하는 제1 상태에서 상기 플렉서블 디스플레이의 적어도 일부는 상 기 제1 하우징 및 상기 제2 하우징 중 적어도 하나의 내부로 인입될 수 있고, 상기 제1 하우징과 상기 제2 하우징이 지정된 거리 이상 이격되는 제2 상태에서 상기 플렉서블 디스플레이의 적어도 일부는 상기 전자 장치의 외 부에서 시인되도록 인출될 수 있고, 상기 제1 상태에서 상기 제1 프로세서는 상기 제1 하우징 내에 배치되는 상 기 제1 UWB 안테나 및 상기 제2 UWB 안테나, 및 상기 제2 하우징 내에 배치되고 상기 적어도 하나의 접촉 구조 를 통해 전기적으로 연결되는 상기 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 신호를 송 신 및/또는 수신할 수 있고, 상기 제2 상태에서 상기 제1 프로세서는 상기 제1 UWB 안테나 및 상기 제2 UWB 안 테나, 및 상기 플렉서블 디스플레이에 배치되는 상기 제4 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신할 수 있다. 본 개시의 다양한 실시 예에 따른, 전자 장치는 제1 하우징 및 제2 하우징을 포함하는 하우징, 플렉서블 디스플 레이, 적어도 하나의 접촉 구조, 상기 제1 하우징 내에 배치되는 적어도 하나의 프로세서 및 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나를 포함할 수 있고, 상기 제1 하우징과 상기 제2 하우징이 적어도 하나의 접 촉 구조를 통해 접촉하는 제1 상태에서 상기 플렉서블 디스플레이는 상기 제1 하우징 및 상기 제2 하우징 중 적 어도 하나의 내부로 인입될 수 있고, 상기 제1 하우징과 상기 제2 하우징이 지정된 거리 이상 이격되는 제2 상 태에서 상기 플렉서블 디스플레이는 상기 전자 장치의 외부에서 시인되도록 인출될 수 있고, 상기 제1 상태에서 상기 적어도 하나의 프로세서는 상기 제1 하우징 내에 제1 축을 따라 배치되는 제1 UWB 안테나 및 제2 UWB 안테 나, 및 상기 제1 축에 수직한 제2 축을 따라 상기 제2 하우징 내에 배치되고 상기 적어도 하나의 접촉 구조를 통해 상기 적어도 하나의 프로세서와 전기적으로 연결되는 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주 파수 대역의 신호를 송신 및/또는 수신할 수 있다."}
{"patent_id": "10-2020-0182271", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예들에 따르면, 전자 장치의 하우징 및 플렉서블 디스플레이 내에 복수의 UWB 안테나들을 분할 배치할 수 있다. 또한 다양한 실시 예에 따르면, 하우징 및 플렉서블 디스플레이 내에 각각 배치된 UWB 안테나를 이용하여, 제1 상태 및 제2 상태에서 사용자에게 위치 기반의 서비스를 제공할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2020-0182271", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 또 는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도 1a는 전자 장치의 제1 상태의 전면도이다. 도 1b는 전자 장치의 제1 상태의 후면도이다. 도 1c는 전자 장치의 제2 상태의 전면도이다. 도 1a, 도 1b 및 도 1c를 참고하면, 일 실시 예에서 전자 장치는 하우징, 디스플레이 및/또는 버튼을 포함할 수 있다. 도 1c를 참고하면, 일 실시 예에 따른 전자 장치는 서브 디스플레이(sub display) 및/또는 메인 플렉 서블 디스플레이(main flexible display)를 포함할 수 있다. 일 실시 예에서, 서브 디스플레이는 하 우징 또는 전자 장치의 형상이나 구조에 따라 플렉서블로 구현될 수 있다. 일 실시 예에 따르면, 서브 디스플레이가 배치된 면은 전자 장치의 전면으로 정의될 수 있으며, 전면 과 반대 방향으로 향하는 면은 전자 장치의 후면으로 정의될 수 있다. 전면과 후면 사이의 공간을 둘러싸 는 면은 전자 장치의 측면으로 정의될 수 있다. 다른 실시 예에서, 서브 디스플레이가 배치된 면이 전자 장치의 후면으로 정의되고, 후면과 반대 방향으로 향하는 면이 전자 장치의 전면으로 정의될 수 있다. 어떤 실시 예에서, 전자 장치는 서브 디스플레이를 포함하지 않을 수도 있다. 다만 이하의 설 명에서는 편의상 서브 디스플레이가 전자 장치의 전면에 배치되는 것으로 가정한다. 도 1a, 도 1b 및 도 1c를 참고하면, 일 실시 예에 따른 하우징은 전자 장치의 전면의 일부 영역, 후 면 및 측면을 형성할 수 있다. 다른 실시 예에 따르면, 하우징은 전자 장치의 측면의 일부 영역 및 후면을 형성할 수 있다. 일 실시 예에서, 하우징은 도전성 물질(예: 금속)을 포함할 수 있다. 일 실시 예에 따르면, 하우징은 제1 하우징 및 제2 하우징을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 상태(100a) 또는 제2 상태(100b)를 가질 수 있다. 일 실시 예에서, 전자 장치의 제1 상태(100a) 및 제2 상태(100b)는 제1 하우징과 제2 하우징의 상대적인 위치에 따라 결정될 수 있다. 예들 들면, 도 1b를 참고하면 제1 하우징과 제2 하우징이 인 접한 전자 장치의 상태를 제1 상태(100a)라 할 수 있다. 또 다른 예로, 메인 플렉서블 디스플레이(main flexible display)가 외부로 시각적으로 보이지 않는 상태일 수 있다. 또 다른 예를 들면, 도 1c를 참고하 면 제1 상태(100a)에서 제1 하우징이 -x 방향으로 이동하거나, 제2 하우징이 +x 방향으로 이동하여, 제1 하우징과 제2 하우징이 지정된 거리 이상 이격되는 전자 장치의 상태를 제2 상태(100b)라 할 수 있다. 또 다른 예로, 메인 플렉서블 디스플레이(main flexible display)가 외부로 시각적으로 보여 지는 상태일 수 있다. 일 실시 예에서, 전자 장치는 사용자의 조작 또는 기계적 작동에 의해서 제1 상태(100a)와 제2 상태(100b) 사이에서 변경될 수 있다. 예를 들면, 후술될 버튼에 대한 사용자의 조작에 의해서 전자 장치는 제1상태(100a)와 제2 상태(100b) 사이에서 변경될 수 있다. 일 실시 예에 따르면, 메인 플렉서블 디스플레이는 전자 장치의 상태에 따라 하우징의 외부로 인출되거나 내부로 인입될 수 있다. 예를 들면, 전자 장치가 제1 상태(100a)에서 제2 상태(100b)로 전환됨 에 따라 제1 하우징은 -x 방향으로 이동하거나, 제2 하우징이 +x 방향으로 이동하고, 메인 플렉서블 디스플레이는 하우징의 외부로 인출될 수 있다. 또 다른 예를 들면, 전자 장치가 제2 상태 (100b)에서 제1 상태(100a)로 전환됨에 따라 제1 하우징은 +x 방향으로 이동하거나, 제2 하우징이 -x 방향으로 이동하고, 메인 플렉서블 디스플레이는 하우징의 내부로 인입될 수 있다. 다양한 실시 예에서, 메인 플렉서블 디스플레이가 인출(또는 노출)된다는 것은 인출된 디스플레이의 부분 이 전자 장치의 외부에서 시인됨(viewed)을 의미할 수 있고, 메인 플렉서블 디스플레이가 인입된다는 것은 인입된 메인 플렉서블 디스플레이의 부분이 전자 장치의 외부에서 시인되지 않음을 의미할 수 있다. 일 실시 예에 따르면, 디스플레이는 사용자에게 정보를 전달하기 위하여 픽셀로부터 광을 방출할 수 있으 며, 픽셀에서 방출된 광은 디스플레이를 통하여 전자 장치의 외부로 전달될 수 있다. 일 실시 예에서, 디스플레이는 강화 유리와 같은 보호층을 포함할 수 있다. 일 실시 예에 따르면, 하우징은 일 부분에 버튼을 포함할 수 있다. 예를 들면, 제2 하우징은 전 자 장치의 전면을 형성하는 일 부분에 버튼을 포함할 수 있다. 또 다른 예를 들면, 제2 하우징 은 전자 장치의 측면을 형성하는 일 부분에 버튼을 포함할 수 있다. 또 다른 예를 들면, 버튼은 생략될 수도 있다. 일 실시 예에 따르면, 전자 장치는 사용자 입력(예: 버튼을 누르거나 터치하는 입력)에 의해서 제1 상태(100a)에서 제2 상태(100b)로 전환될 수 있다. 예를 들면, 전자 장치가 제1 상태(100a)인 경우에 전자 장치의 프로세서는 상기 사용자 입력을 인식하여 전자 장치를 제2 상태(100b)로 전환할 수 있다. 본 개시의 다양한 실시 예에서 도 1a, 도 1b 및 도 1c에 도시된 전자 장치의 형태는 디스플레이 영역을 확장할 수 있는 전자 장치의 예시를 설명하기 위한 것으로서, 전자 장치의 형태는 도 1a, 도 1b 및 도 1c에 도시된 것으로 한정되지 아니한다. 도 2는 일 실시 예에 따른 전자 장치의 블록도이다. 도 2를 참조하면, 일 실시 예에 따른 전자 장치는 UWB(ultra-wide band) 안테나, 프로세서 및/ 또는 무선 통신 회로를 포함할 수 있다. 일 실시 예에서, 무선 통신 회로는 UWB IC(integrated circuitry)를 포함할 수 있다. 일 실시 예에서 따르면, UWB 안테나는 제1 UWB 안테나, 제2 UWB 안테나, 제3 UWB 안테나 및/또는 제4 UWB 안테나를 포함할 수 있다. 일 실시 예에서, UWB 안테나는 지정된 대역의 RF(radio frequency) 신호를 송신 또는 수신하기 위한 안테나로 동작할 수 있다. 상기 지정된 대역의 RF 신호는, 예를 들 어, UWB 주파수 대역(예: 6 GHz 또는 8 GHz의 중심 주파수를 갖는 주파수 대역)에서 전달되는 UWB 신호를 포함 할 수 있다. UWB 신호는 임펄스 무선(impulse radio) 방식에 기반할 수 있다. UWB 신호는 지정된 대역폭, 예를 들어 499 MHz의 대역폭 또는 500 MHz 이상의 대역폭을 가질 수 있다. 다만 이에 제한되지 않는다. 일 실시 예에서 따르면, UWB 안테나는 전자 장치와 외부 장치와의 거리를 측정하기 위한 안테나 로 동작할 수 있다. 일 실시 예에서 따르면, UWB 안테나는 외부 장치로부터 수신되는 RF 신호의 도래각(angle of arrival, AOA)을 측정하기 위한 안테나로 동작할 수 있다. 다양한 실시 예에서, UWB 안테나는 다양한 타입의 안테나 구조를 포함할 수 있다. 예를 들어, UWB 안테나 는 패치 안테나, 다이폴 안테나, 모노폴 안테나, 슬롯 안테나, 루프 안테나, 역F형(inverted-F) 안테나, 평판형의 역F형(planar inverted-F) 안테나, 및/또는 이들 중 어느 둘 이상이 조합된 안테나 구조를 포함할 수 있다. 일 실시 예에서, 프로세서는 UWB 통신과 관련된 어플리케이션을 실행하고, UWB IC를 제어함으로써 UWB 안테나에 기반하여 외부 장치로부터 수신된 RF 신호에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 적어도 하나의 프로세서의 제어에 의해서 UWB 안테나에 급전하여, 외부 장치로부터의 RF 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에서, 프로세서는 외부 장치로부터 수신된 RF 신호에 기반하여, 상기 RF 신호의 RTT(round trip time) 및 AOA(angle of arrival)를 식별할 수 있다. 프로세서는 상기 식별되는 RTT 및 AOA에 기반하 여 외부 장치의 위치를 결정할 수 있다. 다양한 실시 예에서, 외부 장치는 예를 들어, 무선 통신이 가능한 다양한 장치들을 포함할 수 있다. 예를 들어, 외부 장치는 노트북(laptop computer), 태블릿 컴퓨터(tablet computer), 휴대폰(mobile phone), 전자 시계, 헤드폰, 및/또는 이어 버드(earbuds)와 같은 웨어러블 장치(wearable device), 또는 무선 통신이 가 능한 자동차를 포함할 수 있으나, 상술한 예에 의해 제한되지 않는다. 이하, 프로세서가 외부 장치의 위치를 결정하는 방법을 설명한다. 일 실시 예에 따르면, 프로세서는 UWB IC를 제어함으로써, 외부 장치로부터 송수신되는 RF 신호 에 기반하여 전자 장치와 외부 장치 사이의 거리를 측정할 수 있다. 프로세서는 UWB 안테나 를 이용하여, 외부 장치와 타임 스탬프(time stamp) 정보를 포함하는 메시지를 송신 및/또는 수신할 수 있다. 예를 들어, 프로세서는 UWB 안테나를 이용하여, 외부 장치로 송신 시각에 대한 정보를 포함하는 적어도 하나의 거리 측정 요청 메시지를 송신할 수 있다. 외부 장치는 상기 적어도 하나의 거리 측정 요청 메시지를 수신하는 것에 응답하여, 전자 장치로 적어도 하나의 거리 측정 응답 메시지를 송신할 수 있다. 프로세서는 UWB 안테나를 이용하여, 상기 적어도 하나의 거리 측정 응답 메시지를 수신할 수 있다. 상기 적어도 하나의 거리 측정 요청 메시지와 상기 적어도 하나의 거리 측정 응답 메시지는, 각각의 송수신 시간에 대한 시간 정보를 포함할 수 있다. 프로세서는 상기 적어도 하나의 거리 측정 요청 메시지 를 송신한 뒤, 상기 적어도 하나의 거리 측정 응답 메시지를 수신하는데 소요된 시간(RTT, round trip time)을 결정할 수 있다. 프로세서는 외부 장치가 상기 적어도 하나의 거리 측정 요청 메시지를 수신한 뒤 상 기 적어도 하나의 거리 측정 응답 메시지를 송신하는데 소요된 시간인 응답 시간(reply time)을 결정할 수 있다. 프로세서는 상기 RTT 및 상기 응답 시간에 기반하여, 전자 장치로부터 전파가 송신되어 외부 장치까지 도달하는데 걸리는 시간인 TOF(time of flight)를 결정할 수 있다(예: (RTT-reply time) ÷2). 프로세서는 상기 TOF에 기반하여, 전자 장치와 외부 장치 사이의 거리를 측정할 수 있다(예: TOF × 빛의 속력). 일 실시 예에서, 프로세서는 UWB IC을 제어함으로써 UWB 안테나를 이용하여, 외부 장치로 부터 수신되는 RF 신호의 도래각(AOA)을 측정할 수 있다. 예를 들어, 프로세서는 제1 UWB 안테나를 이용하여 수신한 제1 RF 신호 및 제2 UWB 안테나를 이용하여 수신한 제2 RF 신호의 위상 차이를 결정할 수 있다. 프로세서는 상기 결정된 RF 신호의 위상 차이, 수신된 RF 신호의 파장, 및 제1 UWB 안테나와 제2 UWB 안테나가 떨어진 물리적인 거리에 기반하여, 외부 장치로부터 수신한 RF 신호의 도래각을 결 정할 수 있다. 일 실시 예에서, 프로세서는 상기 결정된 거리 및 상기 결정된 도래각에 기반하여, 외부 장치의 위치 를 결정할 수 있다. 일 실시 예에서, 프로세서가 무선 통신 회로(예: UWB IC)를 제어하여 외부 장치의 위치를 결정하는 것으로 설명하였으나, 이에 한정되지 않고 무선 통신 회로(예: UWB IC)가 자체적으로 상기 결정된 거리 및 상기 결정된 도래각에 기반하여 외부 장치의 위치를 결정할 수 있다. 다만, 프로세서가 외부 장치의 위치를 결정하는 방법은 상술한 예에 의해 제한되지 않으며, 통상의 기술자가 사용 가능한 다양한 방법이 적용될 수 있다. 도 3a는 제1 상태 또는 제2 상태일때 UWB 안테나와 UWB IC의 전기적 연결 구조를 나타내는 도면이다. 도 3a를 참고하면, 일 실시 예에 따른 전자 장치는 UWB 안테나, UWB IC, 제1 신호선, 제2 신호선, 제3 신호선, 제4 신호선, 제5 신호선 및 접촉 구조를 포함할 수 있다. 일 실시 예에 따른 UWB 안테나는 제1 UWB 안테나, 제2 UWB 안테나, 제3 UWB 안테나 및/또 는 제4 UWB 안테나를 포함할 수 있다. 이외에 전술 한 내용과 동일하거나 실질적으로 동일한 구성요소에 대해서는 동일한 참조번호를 사용하였으며, 중복되는 설명은 생략된다. 일 실시 예에 따른 제1 UWB 안테나 및 제2 UWB 안테나는 제1 하우징 내에 제1 축을 따라서 나란 히 배치될 수 있다. 일 실시 예에서 제1 축은 도 3a의 y축과 실질적으로 평행한 축으로 참조할 수 있다. 다만,제1 UWB 안테나 및 제2 UWB 안테나의 배치 구조는 이에 한정되지 않을 수 있다. 일 실시 예에 따르면, 제3 UWB 안테나는 제2 하우징 내에 배치될 수 있고, 제3 UWB 안테나는 제 1 축에 실질적으로 수직한 제2 축을 따라 제1 UWB 안테나와 나란히 배치될 수 있다. 또 다른 예로, 제3 UWB 안테나의 적어도 일부가 제1 축에 실질적으로 수직한 제2 축을 따라 제1 UWB 안테나 또는 제2 UWB 안테나와 중첩되도록 배치될 수 있다. 일 실시 예에서 제2 축은 도 3a의 x축과 실질적으로 평행한 축 으로 참조할 수 있다. 다만, 제1 UWB 안테나 및 제3 UWB 안테나의 배치 구조는 이에 한정되지 않을 수 있다. 일 실시 예에 따른 제4 UWB 안테나는 메인 플렉서블 디스플레이에 배치될 수 있다. 일 실시 예에서, 제4 UWB 안테나는 제1 축에 실질적으로 수직한 제2 축을 따라 제1 UWB 안테나와 나란히 배치될 수 있 다. 또 다른 예로, 제4 UWB 안테나는 제1 축에 실질적으로 수직한 제2 축을 따라 제3 UWB 안테나와 나란히 배치될 수 있다. 또 다른 예로, 제4 UWB 안테나의 적어도 일부가 제1 축에 실질적으로 수직한 제2 축을 따라 제1 UWB 안테나 또는 제2 UWB 안테나와 중첩되도록 배치될 수 있다. 다만, 제1 UWB 안테나 및 제4 UWB 안테나의 배치 구조는 이에 한정되지 않을 수 있다. 일 실시 예에 따르면, 제4 UWB 안테나는 메인 플렉서블 디스플레이에 포함되는 안테나 패턴을 포함할 수 있다. 예를 들면, 메인 플렉서블 디스플레이는 복수 개의 레이어(layer)를 포함할 수 있고, 메인 플렉 서블 디스플레이의 복수 개의 레이어는 안테나 패턴을 포함하는 적어도 하나의 레이어를 포함할 수 있다. 일 예시에서, 메인 플렉서블 디스플레이에 포함되는 상기 안테나 패턴은 제5 신호선을 통해서 무선 통신 회로(예: UWB IC)와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 메인 플렉서블 디스플레이에 포함되는 안테나 패턴은 전도율이 높은 금속 재질(예: 은(Ag), 은-합금(Ag-alloy), 알루미늄(Al), 알루미늄-합금(Al-alloy), 구리(Cu), 또는 구리-합금(Cu-alloy)을 포함할 수 있다. 일 실시 예에 따르면, UWB IC는 제1 하우징 내에 배치될 수 있다. 일 실시 예에서, 제1 UWB 안테나 는 제1 신호선을 통해서 UWB IC와 전기적으로 연결될 수 있다. 제2 UWB 안테나는 제2 신 호선을 통해서 UWB IC와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 신호선, 제2 신호선, 제3 신호선, 제4 신호선 및/또는 제5 신호 선은 연성 회로 기판(FPCB)에 의해 구현될 수 있다. 예를 들면, 전자 장치는 구부러질 수 있는 특성(또는, \"플렉서블(flexible) 특성\")을 갖는 연성 회로 기판 (FPCB)을 포함할 수 있다. 일 예시에서, 상기 연성 회로 기판을 통해서 UWB IC 및 제1 UWB 안테나가 전기적으로 연결될 수 있다. 다만, 이에 한정되는 것은 아니고, 제1 신호선, 제2 신호선, 제3 신호선, 제4 신호선 및/ 또는 제5 신호선은 도전성의 연결 부재(예: CPW(coplanar waveguide) 및/또는 마이크로 스트립 선로)로 구 현될 수 있다. 일 실시 예에 따르면, 접촉 구조는 제1 구조 및 제2 구조를 포함할 수 있다. 일 실시 예에서, 제1 구조는 제3 신호선을 통해서 UWB IC와 전기적으로 연결되고, 제2 구조는 제4 신호선 을 통해서 제3 UWB 안테나와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제3 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 전자 장치가 제1 상태(100a)일 때 제3 UWB 안테나 는 접촉 구조를 통해서 UWB IC와 전기적으로 연결될 수 있다. 또 다른 예를 들면, 전자 장치 가 제2 상태(100b)일 때 제1 하우징과 제2 하우징이 서로 지정된 거리 이상 이격되어 배치됨에 따라 제3 UWB 안테나는 UWB IC와 전기적으로 연결되지 않을 수 있다. 일 실시 예에 따르면, 제4 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 제5 신호선 중 제2 부분(225b)은 제2 상태(100b)에 서 제1 상태(100a)로 전환됨에 따라 메인 플렉서블 디스플레이와 함께 제1 하우징 또는 제2 하우징 로 인입될 수 있다. 이 경우 제5 신호선 중 제1 부분(225a)은 제2 부분(225b)과 전기적으로 연결되지 않을 수 있고, 제4 UWB 안테나와 UWB IC는 전기적으로 연결되지 않을 수 있다. 또 다른 예로, 제1 상태(100a)에서 제2 상태(100b)로 전환됨에 따라 제2 부분(225b)은 제1 하우징 또는 제 2 하우징의 외부로 인출될 수 있다. 이 경우, 제5 신호선의 제1 부분(225a) 및 제2 부분(225b)은 전 기적으로 연결되고, 제4 UWB 안테나와 UWB IC는 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는 도 10a에서 후술될 디스플레이 연결 구조를 포함할 수 있다. 제2 상태(100b) 제5 신호선(22 5)의 제1 부분(225a) 및 제2 부분(225b)은 상기 디스플레이 연결 구조를 통해서 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 UWB 안테나, 제2 UWB 안테나, 및/또는 제3 UWB 안테나는 데이터 통 신을 위한 UWB 신호를 송신 또는 수신할 수 있다. 예를 들어, 근거리 통신 시에 제1 UWB 안테나는 데이터 (예: 영상 데이터) 통신을 위한 UWB 신호를 송신 또는 수신할 수 있다. 일 실시 예에 따르면, 제1 상태(100a)에서 프로세서는 UWB IC를 제어함으로써 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예를 들면, 제1 상태(100a)에서 프로세서는 UWB IC를 제어함으로써 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 예시에서, 프로세서 는 제1 UWB 안테나 및 제2 UWB 안테나에 기반하여 수신되는 RF 신호의 도래각(AOA)을 측정할 수 있다. 일 예시에서, 프로세서는 제1 UWB 안테나가 수신한 RF 신호 및 제2 UWB 안테나가 수신한 RF 신호를 이용하여 수신한 RF 신호의 위상 차이를 결정할 수 있다. 프로세서는 상기 결정된 RF 신호의 위 상 차이, 수신된 RF 신호의 파장, 및 제1 UWB 안테나와 제2 UWB 안테나가 떨어진 물리적 거리에 기반 하여, 수신한 RF 신호의 도래각을 결정할 수 있다. 프로세서는 제1 UWB 안테나가 수신한 RF 신호 및 제3 UWB 안테나가 수신한 RF 신호를 이용하여 수신한 RF 신호의 위상 차이를 결정할 수 있다. 프로세서 는 상기 결정된 RF 신호의 위상 차이, 수신된 RF 신호의 파장, 및 제1 UWB 안테나와 제3 UWB 안테나 가 떨어진 물리적 거리에 기반하여 수신한 RF 신호의 도래각을 결정할 수 있다. 일 실시 예에 따르면, 제2 상태(100b)에서 프로세서는 UWB IC를 제어함으로써 제1 UWB 안테나, 제2 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예를 들면, 프로세서는 제1 UWB 안테나, 제2 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 제2 상태(100b)에서 프로세서는 UWB IC를 제어함으로써 앞서 서술된 제1 상태 (100a)에서의 측위를 수행하는 방식과 실질적으로 동일한 방식으로 제1 UWB 안테나, 제2 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 도 3b는 스위칭 회로의 제어를 통한 UWB 안테나와 UWB IC의 전기적 연결 구조를 나타내는 도면이다. 도 3b를 참고하면, 일 실시 예에 따르면 전자 장치는 스위칭 회로, 제6 신호선 및 제7 신호선 을 포함할 수 있다. 일 실시 예에 따르면, 스위칭 회로는 제6 신호선을 통해서 제1 구조와 전기적으로 연결될 수 있 고, 제7 신호선을 통해서 제4 UWB 안테나와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는 스위칭 회로를 통해 제3 UWB 안테나 및 제4 UWB 안테나(21 4)와 UWB IC의 전기적 연결 관계를 제어할 수 있다. 예를 들면, 스위칭 회로는 제2 상태(100b)에서 제7 신호선과 연결된 스위칭 회로 내 포트를 단 락시킬 수 있고, 이 경우 스위칭 회로는 제7 신호선을 통해서 제4 UWB 안테나와 전기적으로 연 결될 수 있다. 예컨대, 스위칭 회로와 전기적으로 연결된 UWB IC는 제4 UWB 안테나와 전기적으 로 연결될 수 있다. 일 실시 예에서, 제2 상태(100b)에서 제6 신호선과 연결된 스위칭 회로내 포트는 개방될 수 있다. 또 다른 예를 들면, 스위칭 회로는 제1 상태(100a)에서 제6 신호선과 연결된 스위칭 회로내 포 트를 단락시킬 수 있고, 이 경우 스위칭 회로는 제 6 신호선을 통해서 제3 UWB 안테나와 전기적 으로 연결될 수 있다. 예컨대, 스위칭 회로와 연결된 UWB IC는 접촉 구조를 통해 제3 UWB 안테 나와 전기적으로 연결될 수 있다. 일 실시 예에서, 제2 상태(100b)에서 제7 신호선과 연결된 스위칭 회로내 포트는 개방될 수 있고, UWB IC와 제4 UWB 안테나는 전기적으로 연결되지 않을 수 있다. 도 4a는 전자 장치가 제1 상태 또는 제2 상태일때의 접촉 구조를 도시하는 도면이다. 도 4b는 일 실시 예에 따른 접촉 구조에 배치되는 자석을 도시하는 도면이다. 도 4a를 참고하면, 일 실시 예에 따른 전자 장치는 접촉 구조를 포함할 수 있다. 일 실시 예에서 접 촉 구조는 제1 구조 및/또는 제2 구조를 포함할 수 있다. 일 실시 예에 따르면, 제1 구조는 제1 결합 부재(311a), 제1 연결 부재(311b), 제1 접촉 부재(311c) 및/ 또는 제1 스프링(311d)을 포함할 수 있다. 일 실시 예에서, 제2 구조는 제2 결합 부재(312a), 제2 접촉 부 재(312c), 및/또는 제2 스프링(312d)을 포함할 수 있다. 일 실시 예에 따르면, 접촉 구조의 제1 구조는 제1 상태(100a)에서 제2 하우징을 향하는 제1 하 우징의 일면에 배치될 수 있다. 일 실시 예에서, 접촉 구조의 제2 구조는 제1 구조의 위치 에 대응하도록 제2 하우징에 배치될 수 있다. 예를 들면, 접촉 구조의 제2 구조는 제1 상태 (100a)에서 접촉 구조의 제1 구조와 접촉하여 전기적으로 연결될 수 있는 제2 하우징의 위치에 배치될 수 있다. 일 실시 예에 따르면, 제1 연결 부재(311b)는 제1 결합 부재(311a)와 결합할 수 있고, 제1 접촉 부재(311c)는 제1 연결 부재(311b)와 결합할 수 있다. 일 실시 예에서, 제3 신호선은 제1 결합 부재(311a), 제1 연결 부 재(311b) 및/또는 제1 접촉 부재(311c)를 관통하여 형성될 수 있다. 또 다른 예로, 제3 신호선은 제1 결합 부재(311a), 제1 연결 부재(311b) 및/또는 제1 접촉 부재(311c)와 전기적으로 연결될 수 있다. 일 실시 예에서, 제1 접촉 부재(311c)는 제1 연결 부재(311b)의 내부로 인입되거나 제1 연결 부재(311b)의 외부로 인출될 수 있 다. 일 실시 예에 따르면, 제3 신호선은 내부에 제1 내부 도체(centre core)(223a)를 포함할 수 있다. 일 실시 예에서, 제1 스프링(311d)은 제1 내부 도체(223a)를 감으며 배치될 수 있다. 일 실시 예에서, 제1 스프링(311 d)은 제1 상태(100a)에서 제1 구조 및 제2 구조가 접촉할 때 물리적 충격을 완화하여 접촉 구조(31 0)의 손상을 방지할 수 있다. 다른 실시 예에서, 제1 스프링(311d)은 생략될 수 있다. 일 실시 예에 따르면, 제2 결합 부재(312a)는 제2 접촉 부재(312c)와 결합할 수 있다. 일 실시 예에서, 제4 신 호선은 제2 결합 부재(312a) 및/또는 제2 접촉 부재(312c)를 관통하여 형성될 수 있다. 또 다른 예로, 제4 신호선은 제2 결합 부재(312a) 및/또는 제2 접촉 부재(312c)와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제4 신호선은 내부에 제2 내부 도체(224a)를 포함할 수 있다. 일 실시 예에서, 제2 스프링(312d)은 제2 내부 도체(224a)를 감으며 배치될 수 있다. 일 실시 예에서, 제2 스프링(312d)은 제1 상태 (100a)에서 제1 구조 및 제2 구조가 접촉할 때 물리적 충격을 완화하여 접촉 구조의 손상을 방 지할 수 있다. 일 실시 예에서, 제2 스프링(312d)은 생략될 수 있다. 일 실시 예에 따르면, 제1 결합 부재(311a) 및/또는 제1 연결 부재(311b)는 전기적으로 그라운드에 해당할 수 있고, 제3 신호선을 감쌀 수 있다. 일 실시 예에서, 제1 접촉 부재(311c), 제2 결합 부재(312a) 및 제2 접 촉 부재(312c)는 전기적으로 그라운드에 해당할 수 있고, 제4 신호선을 감쌀 수 있다. 일 실시 예에 따르면, 제3 신호선 및 제1 구조는 동축 케이블(coaxial cable)로 형성될 수 있다. 다 른 실시 예에 따르면, 제3 신호선 및 제1 구조는 동축 케이블과 유사한 구조로 형성될 수 있다. 일 실시 예에 따르면, 제4 신호선 및 제2 구조는 동축 케이블로 형성될 수 있다. 다른 실시 예에 따 르면 제4 신호선 및 제2 구조는 동축 케이블과 유사한 소형 구조로 형성될 수 있다. 일 실시 예에 따르면, 접촉 구조의 제1 구조 및 제2 구조는 전자 장치의 상태(100a, 100b)에 따라 연결 여부가 달라질 수 있다. 예를 들어, 제1 하우징 및 제2 하우징이 지정된 거리 이 상으로 이격되는 제2 상태(100b)에서 제1 구조의 제1 접촉 부재(311c) 및 제2 구조의 제2 접촉 부재 (312c)는 접촉하지 않을 수 있다. 이 경우 제1 내부 도체(223a) 및 제2 내부 도체(224a)는 전기적으로 연결되지 않고, 이에 따라 제1 구조 및 제2 구조는 연결되지 않을 수 있다. 또 다른 예를 들면, 전자 장치가 제2 상태(100b)에서 제1 상태(100a)로 전환됨에 따라 제1 하우징 및 제2 하우징이 인접한 방향으로 이동할 수 있다. 상기 이동에 따라 제1 하우징의 일 부분에 배치된 제 1 구조 및 제2 하우징의 일 부분에 배치된 제2 구조도 인접한 방향으로 이동할 수 있다. 이 경 우 제1 접촉 부재(311c) 및 제2 접촉 부재(312c)는 접촉하고 제1 구조 및 제2 구조는 전기적으로 연 결될 수 있다. 일 예시에서, 제1 상태(100a)에서 제1 구조 및 제2 구조가 전기적으로 연결됨에 따라서, UWB IC(24 0)와 제3 UWB 안테나는 전기적으로 연결될 수 있다. 예를 들면, 제1 구조 및 제2 구조가 전기적 으로 연결됨에 따라서, UWB IC와 연결된 제3 신호선은 제3 UWB 안테나와 연결된 제4 신호선 과 전기적으로 연결될 수 있다. 이에 따라, UWB IC는 제3 UWB 안테나와 전기적으로 연결될 수 있다. 도 4b를 참고하면, 일 실시 예에 따르면 접촉 구조는 복수 개의 자석들을 포함할 수 있다. 일 실시 예에서, 복수 개의 자석은 제1 결합 부재(311a) 및 제2 결합 부재(312a)와 인접하게 배치될 수 있다. 예를 들면, 전자 장치는 제1 자석, 제2 자석, 제3 자석 및/또는 제4 자석을 포함할 수 있고, 제1 자석, 제2 자석, 제3 자석 및/또는 제4 자석은 접촉 구조에 인접하게 배치될 수 있다. 제1 자석은 제1 구조의 제1 결합 부재(311a)의 +y 방향에 배치될 수 있고, 제1 자석 과 반대되는 자성을 가지는 제2 자석은 제1 자석의 위치에 대응하여 제2 구조의 제2 결합 부재(312a)의 +y 방향에 배치될 수 있다. 제3 자석은 제1 구조의 제1 결합 부재(311a)의 -y 방향에 배치될 수 있고, 제3 자석과 반대되는 자성을 가지는 제4 자석은 제3 자석의 위치에 대응하여 제2 구조의 제2 결합 부재(312a)의 -y 방향에 배치될 수 있다. 다만, 복수 개의 자석들의 개수는 제1 자석 , 제2 자석, 제3 자석 및 제4 자석에 한정되지 아니하고, 복수 개의 자석들의 위치도 실시 예에 한정되지 아니할 수 있다. 일 실시 예에 따르면, 제1 상태(100a)에서 복수 개의 자석들은 접촉 부재들(311c, 312b)의 접촉을 용이하게 할 수 있다. 예를 들면, 제1 자석 및 제2 자석은 제1 접촉 부재(311c) 및 제2 접촉 부재(312b)가 지정된 거리 이하로 가까워졌을 때, 자기력을 통해서 제1 접촉 부재(311c) 및 제2 접촉 부재(312b)의 접촉을 용이하게 할 수 있다. 도 5a는 UWB 안테나 및 UWB IC을 포함하는 하우징의 내부 구조를 나타내는 도면이다. 도 5b는 인쇄 회로 기판 상에 배치되는 UWB IC 및 UWB 안테나의 연결 구조를 도시하는 도면이다. 도 5a를 참고하면, 일 실시 예에 따른 제1 하우징은 롤러부, 제1 인쇄 회로 기판, 플레이트 , 안테나 및 IC 회로 및 후면 커버를 포함할 수 있다. 이외에 전술한 내용과 동일하거나 실질적 으로 동일한 구성요소에 대해서는 동일한 참조번호를 사용하였으며, 중복되는 설명은 생략된다. 일 실시 예에 따르면, 메인 플렉서블 디스플레이의 적어도 일부는 전자 장치가 제2 상태(100b)에서 제1 상태(100a)로 전환되는 경우 제1 하우징 내부로 인입될 수 있다. 예를 들어, 인입된 메인 플렉서블 디 스플레이는 제1 하우징 내에 배치되는 롤러부에 감아질 수 있다. 일 실시 예에서, 롤러부 는 회전축과 회전축에 결합되는 롤러를 포함할 수 있다. 롤러부에 포함되는 롤러는 예를 들어, 원통형 형 상을 가질 수 있다. 이외에 롤러는 원통형 형상에 제한되지 않고 다른 형상을 포함할 수 있다. 일 실시 예에 따르면, 제1 인쇄 회로 기판에는 복수의 전자 부품들이 배치될 수 있다. 일 실시 예에서, 제 1 인쇄 회로 기판에는 무선 통신 회로(예: 도 2의 무선 통신 회로), 프로세서(예: 도 2의 프로세서 ), 메모리, 및/또는 인터페이스가 배치될 수 있다. 일 실시 예에서, 제1 인쇄 회로 기판은 도전성 레 이어를 포함할 수 있다. 일 실시 예에 따르면, 제2 하우징은, 앞서 서술된 제1 하우징에 대응하여, 롤러부, 제2 인쇄 회로 기 판, 플레이트, 후면 커버 및/또는 안테나 회로를 포함할 수 있다. 도 5b를 참고하면, 일 실시 예에 따른 안테나 및 IC 회로에 포함되는 UWB IC는 제1 인쇄 회로 기판 에 배치될 수 있다. 다른 실시 예에서, UWB IC는 제2 인쇄 회로 기판 상에 배치될 수 있다. 일 실시 예에 따르면, 안테나 및 IC 회로는 제1 UWB 안테나, 제2 UWB 안테나 및/또는 UWB IC를 포함할 수 있다. 일 실시 예에 따르면, 안테나 및 IC 회로는 제1 UWB 안테나 및 제2 UWB 안테나를 UWB IC 와 전기적으로 연결하는 제1 연결부를 포함할 수 있다. 예를 들면, 제1 인쇄 회로 기판에 배치된 UWB IC는 제1 도전성 연결 부재를 통해서 제1 연결부와 전기적으로 연결될 수 있다. 일 예시에서 제 1 연결부는 제1 전송 선로를 통해서 제1 UWB 안테나와 전기적으로 연결되고, 제2 전송 선로 를 통해서 제2 UWB 안테나와 전기적으로 연결될 수 있다. 일 실시 예에서, UWB IC는 제3 도전성연결 부재를 통해서 제1 구조와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 안테나 회로는 제3 UWB 안테나를 포함할 수 있다. 일 실시 예에서, 안테나 회 로는 제3 UWB 안테나를 접촉 구조의 제2 구조와 전기적으로 연결하는 제2 연결부를 포함할 수 있다. 예를 들면, 제2 구조는 제2 연결부와 제4 도전성 연결 부재를 통해서 전기적으 로 연결되고, 제2 연결부는 제3 전송 선로를 통해서 제3 UWB 안테나와 전기적으로 연결될 수 있 다. 일 실시 예에 따르면, 무선 통신 회로는 제1 전송 선로를 통해서 제1 UWB 안테나에 급전할 수 있고, 제2 전송 선로를 통해서 제2 UWB 안테나에 급전할 수 있다. 무선 통신 회로는 제1 UWB 안 테나 및/또는 제2 UWB 안테나를 이용하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 제1 인쇄 회로 기판 상에 배치되는 무선 통신 회로는 제3 UWB 안테나에 급전할 수 있다. 무선 통신 회로는 제3 UWB 안테나를 이용하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 도 6은 다른 실시 예에 따른 제1 상태에서 UWB 안테나 배치 구조를 도시하는 도면이다. 도 6을 참고하면, 전자 장치는 제5 UWB 안테나, 접촉 구조를 포함할 수 있다. 일 실시 예에서 접촉 구조는 제1 접촉 구조 및 제2 접촉 구조를 포함할 수 있다. 이외에 전술한 내용과 동일하 거나 실질적으로 동일한 구성요소에 대해서는 동일한 참조번호를 사용하였으며, 중복되는 설명은 생략된다. 일 실시 예에 따르면, 제5 UWB 안테나 및 제3 UWB 안테나는 제1 축을 따라 제2 하우징 내에 배 치될 수 있다. 일 실시 예에서, 제1 축은 y축과 실질적으로 평행한 축으로 참조할 수 있다. 일 실시 예에 따르면, 제1 UWB 안테나 및 제3 UWB 안테나는 제1 축에 실질적으로 수직한 제2 축을 따 라 배치될 수 있다. 예를 들면, 제1 UWB 안테나는 제2 축을 따라 제1 하우징 내에 배치될 수 있고, 제3 UWB 안테나는 제2 축을 따라 제2 하우징 내에 배치될 수 있다. 일 실시 예에 따르면, 제1 상태(100a)에서 UWB IC는 제1 UWB 안테나, 제5 UWB 안테나 및 제3 UWB 안테나와 전기적으로 연결될 수 있다. 예를 들면, UWB IC는 제1 UWB 안테나와 제1 신호선 을 통해서 전기적으로 연결될 수 있다. 또 다른 예를 들면, UWB IC는 제1 접촉 구조를 통해서 제5 UWB 안테나와 전기적으로 연결될 수 있다. UWB IC는 제2 접촉 구조를 통해서 제3 UWB 안테나와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 상태(100a)일 때 프로세서는 UWB IC를 제어하여 제1 UWB 안테나, 제 5 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및 /또는 수신할 수 있다. 예를 들면, 프로세서는 제1 UWB 안테나, 제5 UWB 안테나 및 제3 UWB 안 테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 프로세서의 제어에 의한 측위 수행 동작은 앞서 서술된 바와 실질적으로 동일한바 생략한다. 일 실시 예에 따르면, 전자 장치는 추가 UWB 안테나(미도시) 및/또는 제4 UWB 안테나를 포함할 수 있 고, 추가 UWB 안테나 및 제4 UWB 안테나는 제1 축을 따라 메인 플렉서블 디스플레이에 배치될 수 있 다. 일 예시에서, 제1 축은 +y와 평행한 축을 의미할 수 있다. 일 실시 예에 따르면, 추가 UWB 안테나 및 제5 UWB 안테나는 제2 축을 따라 배치될 수 있다. 일 실시 예에 서, 제2 축은 +x와 평행한 축을 의미할 수 있다. 예를 들면, 추가 UWB 안테나는 제2 축을 따라 메인 플렉서블 디스플레이에 배치되고, 제5 UWB 안테나는 제2 축을 따라 제2 하우징 내에 배치될 수 있다. 일 실시 예에 따르면, 제4 UWB 안테나 및 제3 UWB 안테나는 제3 축을 따라 배치될 수 있고, 일 실시 예에서 제3 축은 +x와 평행한 축을 의미할 수 있다. 예를 들면, 제4 UWB 안테나는 제3 축을 따라 메인 플 렉서블 디스플레이에 배치되고, 제3 UWB 안테나는 제3 축을 따라 제2 하우징 내에 배치될 수 있 다. 일 실시 예에 따르면, 제2 상태(100b)일 때 프로세서는 UWB IC를 제어하여 제1 UWB 안테나, 추 가 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또 는 수신할 수 있다. 예를 들면, 프로세서는 제1 UWB 안테나, 추가 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 프로세서의 제어에 의한 측위 수행 동작은 앞서 서술된 바와 실질적으로 동일한바 생략한다. 도 7a는 다른 실시 예에 따른 제2 상태에서, 제6 UWB 안테나 및 제7 UWB 안테나가 디스플레이에 추가된 UWB 안 테나 배치 구조를 도시하는 도면이다. 도 7a를 참고하면, 일 실시 예에 따른 전자 장치는 제6 UWB 안테나, 제7 UWB 안테나 및/또는 UWB IC를 포함할 수 있다. 일 실시 예에서, 전자 장치는 제3 접촉 구조 및 제4 접촉 구조(73 2)를 포함할 수 있다. 일 실시 예에서, 제3 접촉 구조는 제1 구조(731a) 및/또는 제2 구조(731b)를 포함할 수 있고, 제4 접촉 구조는 제3 구조(732a) 및/또는 제4 구조(732b)를 포함할 수 있다. 이외에 전술한 내용 과 동일하거나 실질적으로 동일한 구성요소에 대해서는 동일한 참조번호를 사용하였으며, 중복되는 설명은 생략 된다. 일 실시 예에 따르면, 제6 UWB 안테나 및 제3 UWB 안테나는 제2 축을 따라 배치될 수 있다. 일 실시 예에서, 제6 UWB 안테나는 제2 축(예: x축)을 따라 메인 플렉서블 디스플레이에 배치되고, 제3 UWB 안테나는 제2 축을 따라 제2 하우징에 배치될 수 있다. 일 실시 예에서, 제2 축은 도 7의 x축과 평행 한 축으로 참조할 수 있다. 일 실시 예에 따르면, 제7 UWB 안테나 및 제6 UWB 안테나는 제1 축과 평행하게 메인 플렉서블 디스플 레이 내에 배치될 수 있다. 일 실시 예에서 제1 축은 도 7의 y축과 평행한 축으로 참조할 수 있다. 일 실시 예에 따르면, UWB IC는 제2 하우징에 배치될 수 있다. 일 실시 예에서, UWB IC는 제3 UWB 안테나와 제8 신호선을 통해서 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제6 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 제9 신호선 중 제2 부분(726b)은 제2 상태(100b)에 서 제1 상태(100a)로 전환됨에 따라 메인 플렉서블 디스플레이와 함께 제1 하우징 또는 제2 하우징 로 인입될 수 있다. 이 경우, 제9 신호선 중 제1 부분(726a)은 제2 부분(726b)과 전기적으로 연결되 지 않을 수 있고, 제6 UWB 안테나와 UWB IC는 전기적으로 연결되지 않을 수 있다. 또 다른 예로, 제1 상태(100a)에서 제2 상태(100b)로 전환됨에 따라 제2 부분(726b)은 제1 하우징 또는 제2 하우징의 외 부로 인출될 수 있다. 이 경우, 제9 신호선의 제1 부분(726a) 및 제2 부분(726b)은 전기적으로 연결되고, 제6 UWB 안테나와 UWB IC는 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는 도 10a에서 후술될 디스플레이 연결 구조를 포함할 수 있다. 제2 상태(100b) 제9 신호선의 제1 부분(726a) 및 제2 부분(726b)은 상기 디스플레이 연결 구조를 통해서 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제7 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 제10 신호선 중 제2 부분(727b)은 제2 상태(100b) 에서 제1 상태(100a)로 전환됨에 따라 메인 플렉서블 디스플레이와 함께 제1 하우징 또는 제2 하우징 로 인입될 수 있다. 이 경우 제10 신호선 중 제1 부분(727a)은 제2 부분(727b)과 전기적으로 연결되 지 않을 수 있고, 제7 UWB 안테나와 UWB IC는 전기적으로 연결되지 않을 수 있다. 또 다른 예로, 제1 상태(100a)에서 제2 상태(100b)로 전환됨에 따라 제2 부분(727b)은 제1 하우징 또는 제2 하우징의 외 부로 인출될 수 있다. 이 경우, 제10 신호선의 제1 부분(727a) 및 제2 부분(727b)은 전기적으로 연결되고, 제7 UWB 안테나와 UWB IC는 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는 도 10a에서 후술될 디스플레이 연결 구조를 포함할 수 있다. 제2 상태(100b) 제10 신호선의 제1 부분(727a) 및 제2 부분(727b)은 상기 디스플레이 연결 구조를 통해서 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 제1 상태(100a)에서 UWB IC는 제3 접촉 구조(73 1)를 통해서 제1 UWB 안테나와 전기적으로 연결될 수 있다. 제2 상태에서(100b)에서 UWB IC는 제1 하 우징 및 제2 하우징이 지정된 거리 이상 이격됨에 따라 제1 UWB 안테나와 전기적으로 연결되지 않을 수 있다. 일 실시 예에 따르면, 제2 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 제1 상태(100a)에서 UWB IC는 제4 접촉 구조를 통해서 제2 UWB 안테나와 전기적으 로 연결될 수 있다. 제2 상태에서(100b)에서 UWB IC는 제1 하우징 및 제2 하우징이 지정된 거리 이상 이격됨에 따라 제2 UWB 안테나와 전기적으로 연결되지 않을 수 있다. 일 실시 예에 따르면, 제1 상태(100a)에서 UWB IC는 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예 를 들면, UWB IC는 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 제2 상태(100b)에서 UWB IC는 제1 상태(100a)와 실질적으로 동일한 방식으로 제3 UWB 안테나, 제6 UWB 안테나 및 제7 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역 의 RF 신호를 송신 및/또는 수신할 수 있다. 예를 들면, UWB IC는 제2 상태(100b)에서 제3 UWB 안테나 , 제6 UWB 안테나 및 제7 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 도 7b는 다른 실시 예에 따른 제2 상태에서, 스위칭 회로, 제6 UWB 안테나 및 제7 UWB 안테나가 디스플레이 추 가된 UWB 안테나 배치 구조를 도시하는 도면이다. 도 7b를 참고하면, 일 실시 예에 따르면, 전자 장치는 스위칭 회로, 제11 신호선, 제12 신호선 , 제13 신호선 및/또는 제14 신호선을 포함할 수 있다. 일 실시 예에서, 제3 접촉 구조는 제1 구조(731a) 및/또는 제2 구조(731b)를 포함할 수 있고, 제4 접촉 구조는 제3 구조(732a) 및/또는 제4 구조(732b)를 포함할 수 있다. 일 실시 예에 따르면, UWB IC는 제11 신호선을 통해서 제6 UWB 안테나와 전기적으로 연결될 수 있고, UWB IC는 제12 신호선을 통해서 제7 UWB 안테나와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 스위칭 회로는 제13 신호선을 통해서 제2 구조(731b)와 전기적으로 연결될 수 있고, 제14 신호선을 통해서 제4 구조(732b)와 전기적으로 연결될 수 있다. 스위칭 회로는 제8 신호 선을 통해서 제3 UWB 안테나와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는 스위칭 회로를 통해 제1 UWB 안테나, 제2 UWB 안테나, 제6 UWB 안테나 및/또는 제7 UWB 안테나와 UWB IC의 전기적 연결 관계를 제어할 수 있다. 예를 들면, 스위칭 회로는 제2 상태(100b)에서 제11 신호선과 연결된 스위칭 회로 내 포트를 단 락시킬 수 있고, 이 경우 스위칭 회로는 제11 신호선을 통해서 제6 UWB 안테나와 전기적으로 연 결될 수 있다. 따라서, 스위칭 회로와 연결된 UWB IC는 제6 UWB 안테나와 전기적으로 연결될 수 있다. 또 다른 예로, 스위칭 회로는 제2 상태(100b)에서 제12 신호선과 연결된 스위칭 회로 내 포트를 단락시킬 수 있고, 이 경우, 스위칭 회로는 제12 신호선을 통해서 제7 UWB 안테나와 전 기적으로 연결될 수 있다. 따라서, 스위칭 회로와 연결된 UWB IC는 제7 UWB 안테나와 전기적으 로 연결될 수 있다. 일 실시 예에서, 제2 상태(100b)에서 제13 신호선 및/또는 제14 신호선과 연결된 스위칭 회로내 포트는 개방될 수 있다. 또 다른 예를 들면, 스위칭 회로는 제1 상태(100a)에서 제13 신호선과 연결된 스위칭 회로내 포 트를 단락시킬 수 있고, 이 경우 스위칭 회로는 제13 신호선을 통해서 제1 UWB 안테나와 전기적 으로 연결될 수 있다. 따라서, 스위칭 회로와 연결된 UWB IC는 제1 UWB 안테나와 전기적으로 연 결될 수 있다. 또 다른 예를 들어, 스위칭 회로는 제1 상태(100a)에서 제14 신호선과 연결된 스위칭 회로내 포트를 단락시킬 수 있고, 이 경우 스위칭 회로는 제14 신호선을 통해서 제2 UWB 안테나 와 전기적으로 연결될 수 있다. 따라서, 스위칭 회로와 연결된 UWB IC는 제2 UWB 안테나와 전기적으로 연결될 수 있다. 일 실시 예에서, 제2 상태(100b)에서 제11 신호선 및 제12 신호선과 연결된 스위칭 회로내 포트 는 개방될 수 있고, UWB IC와 제6 UWB 안테나 및/또는 제7 UWB 안테나는 전기적으로 연결되지 않을 수 있다. 도 8a는 제1 UWB IC 및 제2 UWB IC를 포함하는 전자 장치에서 UWB 안테나의 배치 구조를 도시하는 도면이다. 도 8a를 참고하면, 전자 장치는 제1 UWB IC, 제2 UWB IC, 제1 UWB 안테나, 제2 UWB 안테 나, 제3 UWB 안테나, 제4 UWB 안테나, 제6 UWB 안테나 및/또는 제7 UWB 안테나를 포 함할 수 있다. 일 실시 예에서, 전자 장치는 접촉 구조를 포함할 수 있고, 접촉 구조는 제1 구조 및/또는 제2 구조를 포함할 수 있다. 이외에 전술한 내용과 동일하거나 실질적으로 동일한 구성요 소에 대해서는 동일한 참조번호를 사용하였으며, 중복되는 설명은 생략된다. 일 실시 예에서, 제1 UWB IC는 도 6의 UWB IC로 참조할 수 있다. 일 실시 예에서, 제2 UWB IC 는 도 7의 UWB IC로 참조할 수 있다. 일 실시 예에 따르면, 제1 상태(100a)에서 프로세서는 제1 UWB IC를 통해 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/ 또는 수신할 수 있다. 예를 들면, 프로세서는 제1 UWB IC를 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에서, 제2 상태 (100b)일 때, 프로세서는 제1 UWB IC를 통해 제1 UWB 안테나, 제2 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예를 들 면, 프로세서는 제1 UWB IC를 통해 제1 UWB 안테나, 제2 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 제1 상태(100a)에서 프로세서는 제2 UWB IC를 통해 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/ 또는 수신할 수 있다. 예를 들면, 프로세서는 제2 UWB IC를 통해 제1 UWB 안테나, 제2 UWB 안 테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에서, 제2 상 태(100b)일 때 프로세서는 제2 UWB IC를 통해 제3 UWB 안테나, 제6 UWB 안테나 및 제7 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예 를 들면, 제2 상태(100b)에서 프로세서는 제2 UWB IC를 통해 제3 UWB 안테나, 제6 UWB 안테나 및 제7 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 프로세서는 제1 상태(100a)에서 제1 UWB IC 및 제2 UWB IC 중 적어도 하 나를 통해 측위를 수행할 수 있다. 예를 들면, 제1 상태(100a)에서 프로세서가 제2 UWB IC를 통해 측 위를 수행하는 경우 제1 UWB 안테나 및 제2 UWB 안테나와 제2 UWB IC간 데이터 전송 길이가 길 어져 손실(loss)이 발생할 수 있다. 이에 따라 프로세서는 제1 상태(100a)에서 제1 UWB IC를 통해 측 위를 수행할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 상태(100b)에서 선택적으로 제1 UWB IC 또는 제2 UWB IC(74 1)를 통해 측위를 수행할 수 있다. 예를 들면, 제2 상태(100b)에서 제2 하우징에 포함되는 제3 UWB 안테나 가 신체의 영향을 받아 RSSI(received signal strength indication)이 낮아지는 경우(예: 사용자가 제2 하우징을 손으로 파지하는 경우), 프로세서는 제1 UWB IC를 통해 제1 UWB 안테나, 제2 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 또 다른 예를 들면, 제2 상태(100b)에서 제1 하우징에 포함되는 제1 UWB 안테나 및/또는 제2 UWB 안 테나가 안테나 방사를 방해하는 외부의 방해 부재(예: 금속)의 영향으로 안테나 방사 성능이 열화되는 경 우, 프로세서는 제2 UWB IC를 통해 제3 UWB 안테나, 제6 UWB 안테나 및 제7 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 도 8b는 제1 UWB IC 및 제2 UWB IC를 포함하는 전자 장치에서 스위칭 회로가 추가된 UWB 안테나 배치 구조를 도 시하는 도면이다. 도 8b를 참고하면, 일 실시 예에 따른 전자 장치는 접촉 구조를 포함할 수 있다. 일 실시 예에서, 접 촉 구조는 제1 구조 및/또는 제2 구조를 포함할 수 있다. 이외에 전술한 내용과 동일하거나 실 질적으로 동일한 구성요소에 대해서는 동일한 참조번호를 사용하였으며, 중복되는 설명은 생략된다. 일 실시 예에 따르면, 제1 스위칭 회로는 도 3b의 스위칭 회로으로 참조할 수 있고, 제2 스위칭 회로 는 도 7b의 스위칭 회로으로 참조할 수 있다. 일 실시 예에 따르면, 전자 장치의 상태(100a, 100b)에 따른 제1 UWB IC와 제1 UWB 안테나, 제 2 UWB 안테나, 제3 UWB 안테나 및/또는 제4 UWB 안테나의 전기적 연결 관계는 도 3b의 설명과 실질적으로 동일하므로 생략한다. 다만, 제1 상태(100a)에서 제1 UWB IC가 제3 UWB 안테나와 연결되 는 경우, 도 3b와는 달리 제1 UWB IC는 접촉 구조, 제2 스위칭 회로, 제2 UWB IC, 제8 신 호선을 통해 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 전자 장치의 상태(100a, 100b)에 따른 제2 UWB IC와 제1 UWB 안테나, 제2 UWB 안테나, 제3 UWB 안테나, 제6 UWB 안테나 및/또는 제7 UWB 안테나의 전기적 연결 관 계는 도 7b의 설명과 실질적으로 동일하므로 생략한다. 다만, 제1 상태(100a)에서 제2 UWB IC가 제1 UWB 안테나와 전기적으로 연결되는 경우, 도 7b와는 달리 제2 UWB IC는 접촉 구조, 제6 신호선 , 제1 스위칭 회로, 제1 UWB IC 및 제1 신호선을 통해 전기적으로 연결될 수 있다. 또 다 른 예로, 제1 상태(100a)에서 제2 UWB IC가 제2 UWB 안테나와 전기적으로 연결되는 경우, 도 7b와는 달리 제2 UWB IC는 접촉 구조, 제6 신호선, 제1 스위칭 회로, 제1 UWB IC 및 제2 신 호선을 통해 전기적으로 연결될 수 있다. 도 9a는 다른 실시 예에 따른 제2 상태에서 제8 UWB 안테나, 제9 UWB 안테나 및 제10 UWB 안테나가 디스플레이 에 배치된 UWB 안테나 배치 구조를 도시하는 도면이다. 도 9a를 참고하면, 일 실시 예에 따르면, 전자 장치는 제8 UWB 안테나, 제9 UWB 안테나, 제10 UWB 안테나, 제15 신호선, 제16 신호선 및 제17 신호선을 포함할 수 있다. 이외에 전술한 내용과 동일하거나 실질적으로 동일한 구성요소에 대해서는 동일한 참조번호를 사용하였으며, 중복되는 설명은 생략된다. 일 실시 예에 따르면, 제8 UWB 안테나 및 제9 UWB 안테나는 제2 축을 따라 메인 플렉서블 디스플레이 에 배치될 수 있다. 일 실시 예에서, 제2 축은 도 9의 y축과 실질적으로 수직한 축으로 참조할 수 있다. 일 실시 예에 따르면, 제9 UWB 안테나 및 제10 UWB 안테나는 제1 축을 따라 메인 플렉서블 디스플레 이에 배치될 수 있다. 일 실시 예에서, 제1 축은 도 9의 y축과 실질적으로 평행한 축으로 참조할 수 있다. 일 실시 예에 따르면, 제8 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 제15 신호선 중 제2 부분(928b)은 제2 상태(100b) 에서 제1 상태(100a)로 전환됨에 따라 메인 플렉서블 디스플레이와 함께 제1 하우징 또는 제2 하우징 로 인입될 수 있다. 이 경우, 제15 신호선 중 제1 부분(928a)은 제2 부분(928b)과 전기적으로 연결되 지 않을 수 있고, 제8 UWB 안테나와 UWB IC는 전기적으로 연결되지 않을 수 있다. 또 다른 예로, 제1 상태(100a)에서 제2 상태(100b)로 전환됨에 따라 제2 부분(928b)은 제1 하우징 또는 제2 하우징의 외 부로 인출될 수 있다. 이 경우 제15 신호선의 제1 부분(928a) 및 제2 부분(928b)은 전기적으로 연결되고, 제8 UWB 안테나와 UWB IC는 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제9 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 제16 신호선 중 제2 부분(929b)은 제2 상태(100b) 에서 제1 상태(100a)로 전환됨에 따라 메인 플렉서블 디스플레이와 함께 제1 하우징 또는 제2 하우징 로 인입될 수 있다. 이 경우, 제16 신호선 중 제1 부분(929a)은 제2 부분(929b)과 전기적으로 연결되 지 않을 수 있고, 제9 UWB 안테나와 UWB IC는 전기적으로 연결되지 않을 수 있다. 또 다른 예로, 제1 상태(100a)에서 제2 상태(100b)로 전환됨에 따라 제2 부분(929b)은 제1 하우징 또는 제2 하우징의 외 부로 인출될 수 있다. 이 경우, 제16 신호선의 제1 부분(929a) 및 제2 부분(929b)은 전기적으로 연결되고, 제9 UWB 안테나와 UWB IC는 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제10 UWB 안테나는 전자 장치의 상태(100a, 100b)에 따라 UWB IC와 전기 적으로 연결되거나 연결되지 않을 수 있다. 예를 들면, 제17 신호선 중 제2 부분(930b)은 제2 상태(100b) 에서 제1 상태(100a)로 전환됨에 따라 메인 플렉서블 디스플레이와 함께 제1 하우징 또는 제2 하우징 로 인입될 수 있다. 이 경우, 제17 신호선 중 제1 부분(930a)은 제2 부분(930b)과 전기적으로 연결되 지 않을 수 있고, 제10 UWB 안테나와 UWB IC는 전기적으로 연결되지 않을 수 있다. 또 다른 예로, 제 1 상태(100a)에서 제2 상태(100b)로 전환됨에 따라 제2 부분(930b)은 제1 하우징 또는 제2 하우징의 외부로 인출될 수 있다. 이 경우 제17 신호선의 제1 부분(930a) 및 제2 부분(930b)은 전기적으로 연결되고, 제10 UWB 안테나와 UWB IC는 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 상태(100a)에서 프로세서는 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예 를 들면, 제1 상태(100a)에서 프로세서는 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 제2 상태(100b)에서 프로세서는 제8 UWB 안테나, 제9 UWB 안테나 및 제 10 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예를 들면, 제2 상태(100b)에서 프로세서는 제8 UWB 안테나, 제9 UWB 안테나 및 제10 UWB 안테 나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 도 9b는 다른 실시 예에 따른 제2 상태에서 제8 UWB 안테나, 제9 UWB 안테나, 제10 UWB 안테나 및 스위칭 회로 가 추가된 UWB 안테나 배치 구조를 도시하는 도면이다. 도 9b를 참고하면, 일 실시 예에 따르면 전자 장치는 스위칭 회로, 제18 신호선, 제19 신호선 , 또는 제20 신호선을 포함할 수 있다. 일 실시 예에 따르면, 스위칭 회로는 제18 신호선을 통해서 제8 UWB 안테나에 전기적으로 연결 될 수 있다. 제19 신호선을 통해서 제9 UWB 안테나에 전기적으로 연결될 수 있다. 스위칭 회로 는 제 20 신호선을 통해서 제10 UWB 안테나에 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 스위칭 회로는 전자 장치의 상태(100a, 100b)에 따라 제8 UWB 안테나, 제9 UWB 안테나 및/또는 제10 UWB 안테나와 UWB IC의 전기적 연결 관계를 제어할 수 있다. 일 실시 예에서, 스위칭 회로는 제2 상태(100b)에서 제18 신호선과 연결된 스위칭 회로내 포트 를 단락시킬 수 있고, 스위칭 회로와 연결된 UWB IC는 제8 UWB 안테나와 전기적으로 연결될 수 있다. 또 다른 예로, 스위칭 회로는 제1 상태(100a)에서 제18 신호선과 연결된 스위칭 회로내 포트를 개방시킬 수 있고, 이 경우 스위칭 회로와 연결된 UWB IC는 제8 UWB 안테나와 전기적으 로 연결되지 않을 수 있다. 일 실시 예에서, 스위칭 회로는 제2 상태(100b)에서 제19 신호선과 연결된 스위칭 회로내 포트 를 단락시킬 수 있고, 스위칭 회로와 연결된 UWB IC는 제9 UWB 안테나와 전기적으로 연결될 수 있다. 또 다른 예로, 스위칭 회로는 제1 상태(100a)에서 제19 신호선과 연결된 스위칭 회로내 포트를 개방시킬 수 있고, 이 경우 스위칭 회로와 연결된 UWB IC는 제9 UWB 안테나와 전기적으 로 연결되지 않을 수 있다. 일 실시 예에서, 스위칭 회로는 제2 상태(100b)에서 제20 신호선과 연결된 스위칭 회로내 포트 를 단락시킬 수 있고, 스위칭 회로와 연결된 UWB IC는 제10 UWB 안테나와 전기적으로 연결될 수 있다. 또 다른 예로, 스위칭 회로는 제1 상태(100a)에서 제20 신호선과 연결된 스위칭 회로내 포트를 개방시킬 수 있고, 이 경우 스위칭 회로와 연결된 UWB IC는 제10 UWB 안테나와 전기적으 로 연결되지 않을 수 있다. 도 10a는 제2 상태에서 스위칭 회로를 통한 제4 UWB 안테나의 연결 구조를 나타내는 도면이다. 도 10b는 제2 상태에서 스위칭 회로를 통한 제3 UWB 안테나의 연결 구조를 나타내는 도면이다. 도 10a 및 도 10b를 참고하면, 일 실시 예에 따른 전자 장치는 스위칭 회로 및 디스플레이 연결 구 조를 포함할 수 있다. 일 실시 예에서, 스위칭 회로는 제1 인쇄 회로 기판 상에 배치될 수 있 고, 디스플레이 연결 구조는 스위칭 회로와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 디스플레이 연결 구조는 메인 플렉서블 디스플레이 내에 배치되는 복수의 신 호선들과 전기적으로 연결될 수 있다. 예를 들어, 도 10a 및 도 10b를 참고하면, 상기 복수의 신호선들 중 제5 신호선은 제4 UWB 안테나와 전기적으로 연결될 수 있다. 또 다른 예를 들어, 도 10b를 참고하면, 상기 복수의 신호선들 중 디스플레이 연결 선로는 제3 UWB 안테나와 전기적으로 연 결될 수 있다. 도 10a를 참고하면, 일 실시 예에 따른 제1 상태(100a)에서 프로세서는 UWB IC가 스위칭 회로(101 0)를 통해 제3 UWB 안테나와 전기적으로 연결되도록 제어할 수 있다. 예를 들어, 프로세서는 제1 상 태(100a)에서 스위칭 회로가 접촉 부재(예: C-클립(C-clip) 및/또는 포고 핀(pogo pin), 도 3a의 접촉 구조 )에 전기적으로 연결되도록 제어할 수 있다. 이 경우, 접촉 부재를 통해서 UWB IC는 제3 UWB 안테나 와 전기적으로 연결될 수 있다. 일 실시 예에 따른 제2 상태(100b)에서, 프로세서는 UWB IC가 스위칭 회로를 통해 제4 UWB 안 테나와 전기적으로 연결되도록 제어할 수 있다. 예를 들면, 프로세서는 제2 상태(100b)에서 스위칭 회로가 디스플레이 연결 구조에 전기적으로 연결되도록 할 수 있다. 이 경우, UWB IC는 디스플레이 연결 구조와 제5 신호선을 통해 연결된 제4 UWB 안테나와 전기적으로 연결될 수 있다. 도 10b를 참고하면, 일 실시 예에 따르면, 프로세서는 제1 상태(100a)에서 스위칭 회로가 디스플레 이 연결 구조에 연결된 디스플레이 연결 선로와 전기적으로 연결되도록 할 수 있다. 일 실시 예에 서, 제1 상태일 때(100a) UWB IC는 상기 디스플레이 연결 선로를 통해서 제3 UWB 안테나와 전 기적으로 연결될 수 있다. 일 실시 예에 따르면, 프로세서는 제2 상태(100b)에서 스위칭 회로가 디스플레이 연결 구조에 연결된 제5 신호선에 전기적으로 연결되도록 할 수 있다. 이 경우 UWB IC는 제5 신호선을 통해 서 제4 UWB 안테나와 전기적으로 연결될 수 있다. 도 10c는 UWB 안테나를 이용한 UWB 시스템 동작의 흐름도이다. 일 실시 예에 따르면, 동작 1001에서 프로세서는 UWB 시스템을 동작 시킬 수 있다. 예를 들면, 프로세서 는 UWB와 연관된 어플리케이션을 실행하여 UWB 시스템을 동작 시킬 수 있다. 일 실시 예에 따르면, 동작 1002에서 프로세서는 전자 장치의 상태(100a, 100b)를 판단할 수 있다. 예를 들어, 전자 장치는 전자 장치에 포함된 적어도 하나의 센서를 이용하여 메인 플렉서블 디스플레이 의 하우징 내부로의 인입 또는 하우징 외부로의 인출을 식별할 수 있다. 프로세서는 센서 로부터 전자 장치의 상태(100a, 100b)에 대한 정보를 수신하여 전자 장치의 상태(100a, 100b)를 판단 할 수 있다. 일 실시 예에 따르면, 동작 1002에서 프로세서가 전자 장치가 제1 상태(100a)인 것으로 판단한 경우, 동작 1003에서 프로세서는 스위칭 회로를 제어하여 제3 UWB 안테나와 UWB IC를 전기적으 로 연결시킬 수 있다. 일 실시 예에서 UWB IC는 다양한 방식을 통해 제3 UWB 안테나와 전기적으로 연 결될 수 있다. 예를 들면, UWB IC는 접촉 구조(예: 도 3의 접촉 구조, C-클립(C-clip), 포고 핀 (pogo pin))를 이용하여 제3 UWB 안테나와 전기적으로 연결될 수 있다. 또 다른 예를 들면, UWB IC 는 디스플레이 연결 선로(예: 도 10b의 디스플레이 연결 선로)를 통해 제3 UWB 안테나와 전기적을 연결될 수 있다. 일 실시 예에 따르면, 동작 1004에서 프로세서는 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예를 들 면, 동작 1004에서 프로세서는 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나 중 적 어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 동작 1002에서 프로세서가 전자 장치가 제2 상태(100a)인 것으로 판단한 경우, 동작 1005에서 프로세서는 스위칭 회로를 디스플레이 연결 구조에 연결된 제5 신호선과 전기적으로 연결시킬 수 있다. 일 실시 예에서, UWB IC는 디스플레이 연결 구조 및 제5 신호선(22 5)을 통해서 제4 UWB 안테나와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 동작 1005에서 UWB IC가 제4 UWB 안테나와 전기적으로 연결된 경우 동작 1004 에서, 제2 상태일때, 프로세서는 제1 UWB 안테나, 제2 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수 대역의 RF 신호를 송신 및/또는 수신할 수 있다. 예를 들면, 동작 1004에 서 프로세서는 제1 UWB 안테나, 제2 UWB 안테나 및 제4 UWB 안테나 중 적어도 2개에 기반 하여 측위를 수행할 수 있다. 도 11은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 11을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전 자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입 력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페 이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통 신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요 소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈,또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘 발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로 세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일 부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예 에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따 르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고 리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학 습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한 정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망 (DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트 워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사 항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하 여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치 와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1102, 또는 1104) 각각은 전자 장 치와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작 들의 전부 또는 일부는 외부의 전자 장치들(1102, 1104, 또는 1108) 중 하나 이상의 외부의 전자 장치들에서 실 행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로 부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대 신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라 고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달 할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어 도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅 (MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예 를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버(110 8)는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 하우징 및 제2 하우징을 포함하는 하우징, 메인 플 렉서블 디스플레이, 적어도 하나의 접촉 구조, 상기 제1 하우징 내에 배치되는 UWB IC 및 제1 UWB 안테나, 제2 UWB 안테나, 제3 UWB 안테나 및 제4 UWB 안테나를 포함하고, 상기 제1 하우징과 상기 제2 하우징이 적어도 하나의 접촉 구조를 통해 접촉하는 제1 상태(100a)에서 상기 메인 플렉서블 디스플레이의 적어도 일부는 상기 제1 하우징 및 상기 제2 하우징 중 적어 도 하나의 내부로 인입되고, 상기 제1 하우징과 상기 제2 하우징이 지정된 거리 이상 이격되는 제2 상태(100b)에서 상기 메인 플렉서블 디스플레이의 적어도 일부는 상기 전자 장치의 외부에서 시인되 도록 인출되고, 상기 제1 상태(100a)에서 상기 UWB IC는 상기 제1 하우징 내에 배치되는 상기 제1 UWB 안테나 및 상기 제2 UWB 안테나, 및 상기 제2 하우징 내에 배치되고 상기 적어도 하나의 접 촉 구조를 통해 전기적으로 연결되는 상기 제3 UWB 안테나 중 적어도 2개에 기반하여 지정된 주파수대역의 신호를 송신 및/또는 수신할 수 있고, 상기 제2 상태(100b)에서 상기 UWB IC는 상기 제1 UWB 안테 나 및 상기 제2 UWB 안테나, 및 상기 메인 플렉서블 디스플레이에 배치되는 상기 제4 UWB 안테 나 중 적어도 2개에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 상기 제1 UWB 안테나 및 상기 제2 UWB 안테나는 상기 제1 하우징 내에 제 1 축을 따라 배치되고, 상기 제1 UWB 안테나, 상기 제3 UWB 안테나 및 상기 제4 UWB 안테나는 상기 제1 축에 수직한 제2 축을 따라 배치될 수 있다. 일 실시 예에 따르면, 상기 제1 상태(100a)에서 상기 UWB IC는 상기 제1 UWB 안테나 및 상기 제2 UWB 안테나에 기반하여 상기 제1 축에 평행한 제1 방향의 측위를 수행하고, 상기 제1 UWB 안테나 및 상기 제3 UWB 안테나에 기반하여 상기 제2축에 평행한 제2 방향의 측위를 수행할 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 제2 하우징 내에 배치되는 제5 UWB 안테나를 더 포함하 고, 상기 제5 UWB 안테나는 상기 제1 축과 평행하게 상기 제3 UWB 안테나와 나란히 배치될 수 있다. 일 실시 예에 따르면, 상기 제5 UWB 안테나는 상기 제2 상태(100b)에서 상기 제1 상태(100a)로 전환됨에 따라 상기 UWB IC와 작동적으로 결합하고, 상기 UWB IC는 상기 제1 UWB 안테나, 상기 제3 UWB 안테나 및 상기 제5 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 메인 플렉서블 디스플레이 내에 배치되는 추가 UWB 안테나 (예: 도 6의 추가 UWB 안테나)를 더 포함하고, 상기 추가 UWB 안테나는 상기 제1 축과 평행하게 상기 제4 UWB 안테나와 나란히 배치될 수 있다. 일 실시 예에 따르면, 상기 추가 UWB 안테나(예: 도 6의 추가 UWB 안테나)는 상기 제1 상태(100a)에서 상기 제2 상태(100b)로 전환됨에 따라 상기 UWB IC와 작동적으로 결합하고, 상기 UWB IC는 상기 제1 UWB 안테 나, 상기 제4 UWB 안테나 및 상기 추가 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 전자 장치는 제9 UWB 안테나 및 제10 UWB 안테나를 더 포함하고, 상기 제 9 UWB 안테나는 상기 제2 축을 따라 상기 제8 UWB 안테나와 나란히 배치되고, 상기 제2 상태(100b)에 서 상기 제1 하우징에 배치되는 상기 UWB IC와 작동적으로 결합하고, 상기 제10 UWB 안테나는 상기 제1 축과 평행하게 상기 제9 UWB 안테나와 나란히 배치되고, 상기 제2 상태(100b)에서 상기 제1 하우 징에 배치되는 상기 UWB IC와 작동적으로 결합하고, 상기 UWB IC는 상기 제8 UWB 안테나, 상기 제9 UWB 안테나 및 상기 제10 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면 상기 UWB IC는 UWB 통신과 관련된 어플리케이션을 실행하고, 상기 제1 UWB 안테나 , 상기 제2 UWB 안테나, 상기 제3 UWB 안테나 및 상기 제4 UWB 안테나 중 적어도 2개를 이용하여 외부 장치로부터 수신된 RF 신호에 기반하여, 상기 RF 신호의 RTT(round trip time) 및 AOA(angle of arrival)를 식별하고, 상기 식별되는 RTT 및 AOA에 기반하여 상기 외부 장치의 위치를 결정하도록 설정될 수 있 다. 일 실시 예에 따르면, 상기 적어도 하나의 접촉 구조는 상기 제1 하우징의 제1 부분에 배치되는 제1 구조 및 상기 제1 하우징의 제1 부분과 대향하는 제2 하우징의 제2 부분에 배치되는 제2 구조 를 포함하고, 상기 제1 구조는 제1 결합 부재(311a), 제1 접촉 부재(311c) 및 상기 제1 결합 부재 (311a)와 상기 제1 접촉 부재(311c)를 연결하는 제1 연결 부재(311b)를 포함하고, 상기 제2 구조는 제2 결 합 부재(312a), 제2 접촉 부재(312c)를 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 구조는 상기 제1 구조의 제1 접촉 부재(311c)에 인접하여 배치되는 제1 자석을 포함하고, 상기 제2 구조는 상기 제1 자석의 위치에 대응하여 상기 제2 구조의 제2 접촉 부재(312c)에 인접하여 배치되는 제2 자석을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 제2 하우징 내에 배치되는 제2 UWB IC 및 상기 메인 플 렉서블 디스플레이에 배치되는 제6 UWB 안테나 및 제7 UWB 안테나를 더 포함할 수 있다. 일 실시 예에 따르면, 제2 UWB IC는 상기 제1 상태(100a)에서 상기 제1 UWB 안테나, 상기 제2 UWB 안테나 및 상기 제3 UWB 안테나와 작동적으로 결합하고, 상기 제1 UWB 안테나, 상기 제2 UWB 안 테나 및 상기 제3 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행하고, 상기 제2 상태(100b)에서 상기 제3 UWB 안테나, 상기 제6 UWB 안테나 및 상기 제7 UWB 안테나와 작동적으로 결합하고, 상기 제3 UWB 안테나, 상기 제6 UWB 안테나 및 상기 제7 UWB 안테나 중 적어도 2개에 기반하여 측위를 수행할 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 제1 하우징 또는 상기 제2 하우징 상에 배치되는 버튼 을 더 포함하고, 상기 버튼 입력시 상기 전자 장치는 상기 제1 상태(100a)에서 상기 제2 상태 (100b)로 전환되거나, 상기 제2 상태(100b)에서 상기 제1 상태(100a)로 전환될 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 제1 하우징의 일 면 또는 상기 제2 하우징의 일 면에 서브 디스플레이를 더 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 하우징 및 제2 하우징을 포함하는 하우징, 메인 플 렉서블 디스플레이, 적어도 하나의 접촉 구조, 상기 제1 하우징 내에 배치되는 UWB IC 및 제1 UWB 안테나, 제2 UWB 안테나 및 제3 UWB 안테나를 포함하고, 상기 제1 하우징과 상기 제2 하우징이 적어도 하나의 접촉 구조를 통해 접촉하는 제1 상태(100a)에서 상기 메인 플렉서블 디 스플레이는 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나의 내부로 인입되고, 상기 제1 하우징과 상기 제2 하우징이 지정된 거리 이상 이격되는 제2 상태(100b)에서 상기 메인 플렉서블 디 스플레이는 상기 전자 장치의 외부에서 시인되도록 인출되고, 상기 제1 상태(100a)에서 UWB IC 는 상기 제1 하우징 내에 제1 축을 따라 배치되는 제1 UWB 안테나 및 제2 UWB 안테나, 및 상기 제1 축에 수직한 제2 축을 따라 상기 제2 하우징 내에 배치되고 상기 적어도 하나의 접촉 구조를 통 해 전기적으로 연결되는 제3 UWB 안테나에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 상기 제1 UWB 안테나 및 상기 제2 UWB 안테나는 상기 제1 하우징 내에 제 1 축을 따라 배치되고, 상기 제1 UWB 안테나 및 상기 제3 UWB 안테나는 상기 제1 축에 수직한 제2 축 을 따라 배치될 수 있다. 일 실시 예에 따르면, 상기 제1 상태(100a)에서 상기 UWB IC는 상기 제1 UWB 안테나 및 상기 제2 UWB 안테나에 기반하여 상기 제1 축에 평행한 제1 방향의 측위를 수행하고, 상기 제1 UWB 안테나 및 상기 제3 UWB 안테나에 기반하여 상기 제2축에 평행한 제2 방향의 측위를 수행할 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 접촉 구조는 상기 제1 하우징의 제1 부분에 배치되는 제1 구조 및 상기 제1 하우징의 제1 부분과 대향하는 제2 하우징의 제2 부분에 배치되는 제2 구조 를 포함하고, 상기 제1 구조는 제1 결합 부재(311a), 제1 접촉 부재(311c) 및 상기 제1 결합 부재 (311a)와 상기 제1 접촉 부재(311c)를 연결하는 제1 연결 부재(311b)를 포함하고, 상기 제2 구조는 제2 결 합 부재(312a), 제2 접촉 부재(312c)를 포함할 수 있다. 일 실시 예에 따르면 상기 UWB IC는 UWB 통신과 관련된 어플리케이션을 실행하고, 상기 제1 UWB 안테나 , 상기 제2 UWB 안테나, 상기 제3 UWB 안테나 및 상기 제4 UWB 안테나 중 적어도 2개를 이용하여 외부 장치로부터 수신된 RF 신호에 기반하여, 상기 RF 신호의 RTT(round trip time) 및 AOA(angle of arrival)를 식별하고, 상기 식별되는 RTT 및 AOA에 기반하여 상기 외부 장치의 위치를 결정하도록 설정될 수 있 다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1a 도면1b 도면1c 도면2 도면3a 도면3b 도면4a 도면4b 도면5a 도면5b 도면6 도면7a 도면7b 도면8a 도면8b 도면9a 도면9b 도면10a 도면10b 도면10c 도면11"}
{"patent_id": "10-2020-0182271", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 전자 장치의 제1 상태의 전면도이다. 도 1b는 전자 장치의 제1 상태의 후면도이다. 도 1c는 전자 장치의 제2 상태의 전면도이다. 도 2는 일 실시 예에 따른 전자 장치의 블록도이다. 도 3a는 제1 상태 또는 제2 상태일때 UWB 안테나와 UWB IC의 전기적 연결 구조를 나타내는 도면이다. 도 3b는 스위칭 회로의 제어를 통한 UWB 안테나와 UWB IC의 전기적 연결 구조를 나타내는 도면이다. 도 4a는 일 실시 예에 따른 전자 장치가 제1 상태 또는 제2 상태일때의 접촉 구조를 도시하는 도면이다. 도 4b는 일 실시 예에 따른 접촉 구조에 배치되는 자석을 도시하는 도면이다. 도 5a는 UWB 안테나 및 UWB IC을 포함하는 하우징의 내부 구조를 나타내는 도면이다. 도 5b는 인쇄 회로 기판 상에 배치되는 UWB IC 및 UWB 안테나의 연결 구조를 도시하는 도면이다. 도 6은 다른 실시 예에 따른 제1 상태에서 UWB 안테나 배치 구조를 도시하는 도면이다. 도 7a는 다른 실시 예에 따른 제2 상태에서, 제6 UWB 안테나 및 제7 UWB 안테나가 디스플레이에 추가된 UWB 안 테나 배치 구조를 도시하는 도면이다. 도 7b는 다른 실시 예에 따른 제2 상태에서, 스위칭 회로, 제6 UWB 안테나 및 제7 UWB 안테나가 디스플레이 추 가된 UWB 안테나 배치 구조를 도시하는 도면이다. 도 8a는 제1 UWB IC 및 제2 UWB IC를 포함하는 전자 장치에서 UWB 안테나의 배치 구조를 도시하는 도면이다. 도 8b는 제1 UWB IC 및 제2 UWB IC를 포함하는 전자 장치에서 스위칭 회로가 추가된 UWB 안테나 배치 구조를 도시하는 도면이다. 도 9a는 다른 실시 예에 따른 제2 상태에서 제8 UWB 안테나, 제9 UWB 안테나 및 제10 UWB 안테나가 디스플레이 에 배치된 UWB 안테나 배치 구조를 도시하는 도면이다. 도 9b는 다른 실시 예에 따른 제2 상태에서 제8 UWB 안테나, 제9 UWB 안테나, 제10 UWB 안테나 및 스위칭 회로 가 추가된 UWB 안테나 배치 구조를 도시하는 도면이다. 도 10a는 제2 상태에서 스위칭 회로를 통한 제4 UWB 안테나의 연결 구조를 나타내는 도면이다. 도 10b는 제2 상태에서 스위칭 회로를 통한 제3 UWB 안테나의 연결 구조를 나타내는 도면이다. 도 10c는 UWB 안테나를 이용한 UWB 시스템 동작의 흐름도이다. 도 11은 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다."}
