{"patent_id": "10-2023-0031451", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0137985", "출원번호": "10-2023-0031451", "발명의 명칭": "저전압 배터리 셀 선별 장치 및 이의 동작 방법", "출원인": "주식회사 엘지에너지솔루션", "발명자": "한사랑"}}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 배터리 트레이들 각각에 포함된 배터리 셀들의 공정 데이터 셋들을 획득하는 데이터 획득부; 상기 공정 데이터 셋들을 이용하여 상기 배터리 셀들 각각에 대한 적어도 두 종류의 파생 변수들을 포함하는 파생 변수 데이터 셋들을 생성하고, 상기 파생 변수 데이터 셋들을 표준화하는 데이터 전처리부; 및 인공지능 모델을 이용하여 상기 표준화된 파생 변수 데이터 셋들 중 지정된 범위를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별하는 선별부 를 포함하는, 저전압 배터리 셀 선별 장치."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 데이터 전처리부는, 상기 파생 변수 데이터 셋들의 사분위수(quartile)에 기초한 평균 및 표준편차를 이용하여, 상기 파생 변수 데이터 셋들을 표준화하는저전압 배터리 셀 선별 장치."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 인공지능 모델은, 정상 배터리 셀에 대한 훈련 데이터 셋들에 의해 학습되고, 복수의 파생 변수들 중 적어도 두 종류의 파생 변수들에 기초한 분포도를 이용하여, 상기 훈련 데이터 셋들에대한 분포 패턴을 학습하는, 저전압 배터리 셀 선별 장치."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서, 상기 지정된 범위는, 상기 분포 패턴에 기초하여 결정된 경계이고, 상기 선별부는, 상기 결정된 경계를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 상기 저전압 배터리 셀로 선별하는, 저전압 배터리 셀 선별 장치."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 공정 데이터 셋들은, 상기 배터리 셀들 각각에 대하여, 활성화 공정의 시간 순서에 따라 측정된 개방 회로 전압(OCV: open circuitvoltage)을 포함하는, 공개특허 10-2024-0137985-3-저전압 배터리 셀 선별 장치."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "복수의 배터리 트레이들 각각에 포함된 배터리 셀들의 공정 데이터 셋들을 획득하는 동작; 상기 공정 데이터 셋들을 이용하여 상기 배터리 셀들 각각에 대한 적어도 두 종류의 파생 변수들을 포함하는 파생 변수 데이터 셋들을 생성하는 동작; 상기 파생 변수 데이터 셋들을 표준화하는 동작; 및 인공지능 모델을 이용하여 상기 표준화된 파생 변수 데이터 셋들 중 지정된 범위를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별하는 동작을 포함하는, 저전압 배터리 셀 선별 장치의 동작 방법."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 표준화하는 동작은, 상기 파생 변수 데이터 셋들의 사분위수(quartile)에 기초한 평균 및 표준편차를 이용하여 상기 파생 변수 데이터 셋들을 표준화하는, 동작 방법."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서, 상기 인공지능 모델은, 정상 배터리 셀에 대한 훈련 데이터 셋들에 의해 학습되고, 복수의 파생 변수들 중 적어도 두 종류의 파생 변수들에 기초한 분포도를 이용하여, 상기 훈련 데이터 셋들에대한 분포 패턴을 학습하는, 동작 방법."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서, 상기 지정된 범위는, 상기 분포 패턴에 기초하여 결정된 경계이고, 상기 선별하는 동작은, 상기 결정된 경계를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 상기 저전압 배터리 셀로 선별하는, 동작 방법."}
{"patent_id": "10-2023-0031451", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 6에 있어서, 상기 공정 데이터 셋들은, 상기 배터리 셀들 각각에 대하여, 활성화 공정의 시간 순서에 따라 측정된 개방 회로 전압(OCV: open circuitvoltage)를 포함하는, 공개특허 10-2024-0137985-4-동작 방법."}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에서 개시되는 일 실시 예에 따른 저전압 배터리 셀 선별 장치는, 복수의 배터리 트레이들 각각에 포함된 배터리 셀들의 공정 데이터 셋들을 획득하는 데이터 획득부; 상기 공정 데이터 셋들을 이용하여 상기 배터리 셀 들 각각에 대한 적어도 두 종류의 파생 변수들을 포함하는 파생 변수 데이터 셋들을 생성하고, 상기 파생 변수 데이터 셋들을 표준화하는 데이터 전처리부; 및 인공지능 모델을 이용하여 상기 표준화된 파생 변수 데이터 셋들 중 지정된 범위를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별하는 선별부를 포함할 수 있다."}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 실시 예들은, 저전압 배터리 셀 선별 장치 및 이의 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 이차 전지에 대한 연구 개발이 활발히 이루어지고 있다. 여기서 이차 전지는 충방전이 가능한 전지로서, 종래의 Ni/Cd 배터리, Ni/MH 배터리 등과 최근의 리튬 이온 배터리를 모두 포함하는 의미이다. 이차 전지 중 리 튬 이온 배터리는 종래의 Ni/Cd 배터리, Ni/MH 배터리 등에 비하여 에너지 밀도가 훨씬 높다는 장점이 있다. 또 한, 리튬 이온 배터리는 소형, 경량으로 제작할 수 있어서 이동 기기의 전원으로 사용되며, 최근에는 전기 자동 차의 전원으로 사용 범위가 확장되어 차세대 에너지 저장 매체로 주목을 받고 있다. 배터리 셀을 생산하는 공정 상에서 불량(defective) 배터리 셀이 생산될 수 있다. 여기서, 불량은 저전압으로 인한 불량, 및 내부 단선으로 인한 불량 등을 포함할 수 있다. 불량 배터리 셀을 전자 제품에 탑재할 경우, 배터리의 폭발로 인한 화재가 발생할 수 있고, 이는 인명 피해 및 재산 피해로 이어지게 된다. 이에 따라, 생산된 배터리 셀들 중 불량 배터리 셀을 선별해야 할 필요성이 있다."}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래의 배터리 제조 공정 상에서는, 지정된 개수의 배터리 셀들을 하나의 트레이에 포함시켜 트레이 별로 저전 압 배터리 셀을 검출하였다. 예컨대, 트레이 별 배터리 셀들의 OCV를 측정하고, 배터리 셀들에 대한 dOCV2(OCV1-OCV2) 값의 평균과 표준편차를 이용하여 저전압 배터리 셀을 선별하였다. 그러나, 트레이 내부의 편차만 고려할 뿐 트레이들 간의 편차를 고려하지 않아 모든 트레이들에 적용할 수 있는 판단 기준이 없으므로, 트레이들 각각에 대해 검사를 수행하여 검사 시간이 많이 소모되는 문제점이 존재한다. 또한, 생산된 전체 배터리 셀들 중 저전압 배터리 셀의 비율은 약 1% 이하에 해당하므로, 트레이 별로 저전압 배터리 셀을 선별하게 되면 선별하는 데 필요한 검사 시간 대비 효율이 떨어진다는 문제점이 존재한다. 본 문서에 개시된 실시예들의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않 은 또다른 기술적 과제들은 아래의 기재들로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에서 개시되는 일 실시 예에 따른 저전압 배터리 셀 선별 장치는, 복수의 배터리 트레이들 각각에 포함 된 배터리 셀들의 공정 데이터 셋들을 획득하는 데이터 획득부; 상기 공정 데이터 셋들을 이용하여 상기 배터리 셀들 각각에 대한 적어도 두 종류의 파생 변수들을 포함하는 파생 변수 데이터 셋들을 생성하고, 상기 파생 변 수 데이터 셋들을 표준화하는 데이터 전처리부; 및 인공지능 모델을 이용하여 상기 표준화된 파생 변수 데이터 셋들 중 지정된 범위를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별 하는 선별부를 포함할 수 있다. 일 실시 예에서, 상기 데이터 전처리부는, 상기 파생 변수 데이터 셋들의 사분위수(quartile)에 기초한 평균 및 표준편차를 이용하여, 상기 파생 변수 데이터 셋들을 표준화할 수 있다. 일 실시 예에서, 상기 인공지능 모델은, 정상 배터리 셀에 대한 훈련 데이터 셋들에 의해 학습될 수 있고, 복수 의 파생 변수들 중 적어도 두 종류의 파생 변수들에 기초한 분포도를 이용하여, 상기 훈련 데이터 셋들에 대한 분포 패턴을 학습할 수 있다. 일 실시 예에서, 상기 지정된 범위는, 상기 분포 패턴에 기초하여 결정된 경계일 수 있고, 상기 선별부는, 상기 결정된 경계를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 상기 저전압 배터리 셀로 선별할수 있다. 일 실시 예에서, 상기 공정 데이터 셋들은, 상기 배터리 셀들 각각에 대하여, 활성화 공정의 시간 순서에 따라 측정된 개방 회로 전압(OCV: open circuit voltage)을 포함할 수 있다. 본 문서에서 개시되는 일 실시 예에 따른 저전압 배터리 셀 선별 장치의 동작 방법은, 복수의 배터리 트레이들 각각에 포함된 배터리 셀들의 공정 데이터 셋들을 획득하는 동작; 상기 공정 데이터 셋들을 이용하여 상기 배터 리 셀들 각각에 대한 적어도 두 종류의 파생 변수들을 포함하는 파생 변수 데이터 셋들을 생성하는 동작; 상기 파생 변수 데이터 셋들을 표준화하는 동작; 및 인공지능 모델을 이용하여 상기 표준화된 파생 변수 데이터 셋들 중 지정된 범위를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 표준화하는 동작은, 상기 파생 변수 데이터 셋들의 사분위수(quartile)에 기초한 평균 및 표준편차를 이용하여 상기 파생 변수 데이터 셋들을 표준화할 수 있다. 일 실시 예에서, 상기 인공지능 모델은, 정상 배터리 셀에 대한 훈련 데이터 셋들에 의해 학습될 수 있고, 복수 의 파생 변수들 중 적어도 두 종류의 파생 변수들에 기초한 분포도를 이용하여, 상기 훈련 데이터 셋들에 대한 분포 패턴을 학습할 수 있다. 일 실시 예에서, 상기 지정된 범위는, 상기 분포 패턴에 기초하여 결정된 경계일 수 있고, 상기 선별하는 동작 은, 상기 결정된 경계를 벗어나는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 상기 저전압 배터리 셀 로 선별할 수 있다. 일 실시 예에서, 상기 공정 데이터 셋들은, 상기 배터리 셀들 각각에 대하여, 활성화 공정의 시간 순서에 따라 측정된 개방 회로 전압(OCV: open circuit voltage)를 포함할 수 있다."}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예들에 따른 저전압 배터리 셀 선별 장치 및 이의 동작 방법은, 공정 데이터 셋들을 복수의 파생 변수들에 기초하여 변환함으로써 트레이 내부의 편차를 고려할 수 있다. 또한, 파생 변수 데이터 셋을를 표준화시킴으로써 트레이 간의 편차를 고려할 수 있다. 즉, 본 발명은 트레이 내부의 편차와 트 레이 간의 편차를 모두 고려하여 모든 트레이들에 포함된 배터리 셀들을 통합하여 관리할 수 있으므로, 저전압 배터리 셀을 선별하는 검사 시간을 단축시킬 수 있다. 이에 따라, 배터리 셀 제조 공정 중 저전압 배터리 셀을 선별하는 검사 시간을 단축함으로써, 배터리에 대한 수 요가 급증하더라도 신속한 대응을 할 수 있다. 또한, 검사 시간 단축으로 인한 비용 절감 효과도 발생할 수 있 다. 본 문서의 개시에 따른 저전압 배터리 셀 선별 장치 및 이의 동작 방법의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또다른 효과들은 본 문서의 개시에 따라 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시 예들이 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 본 문서의 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예로 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설 명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하 는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포 함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", \"첫째\", \"둘째\", \"A\", \"B\", \"(a)\" 또는 \"(b)\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사 용될 수 있으며, 특별히 반대되는 기재가 없는 한, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한 정하지 않는다. 본 문서에서, 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어 와 함께 또는 이런 용어 없이, \"연결\", \"결합\" 또는 \"접속\"된다고 언급되거나 \"커플드\" 또는 \"커넥티드\"라고 언 급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로, 또는 무선으로), 또 는 간접적으로(예: 제3 구성요소를 통하여) 연결될 수 있다는 것을 의미한다. 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되 어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그 램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory, CD-ROM)의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두 개의 사용자 장치들 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이 션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 문서에 개시된 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 본 문서에 개시된 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략 되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수 의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 본 문서에 개시된 실시 예들에 따르 면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 1은 종래 기술에 따른 불량 배터리 셀을 선별하는 방법의 문제점을 도시한다. 도 1을 참조하면, 제1 그래프는 제1 트레이에 포함된 배터리 셀들 각각의 dOCV2를 도시한다. 여기서 dOCV2(OCV1-OCV2)는 배터리 셀들 각각에 대한 OCV1과 OCV2 간의 차이(difference)일 수 있다. 여기서, OCV1은 OCV2에 비해 시간적으로 먼저 측정된 개방 회로 전압(OCV: open circuit voltage)일 수 있다. 개방 회로 전압은 대한 활성화 공정 상에서 측정될 수 있다. 활성화 공정은 배터리에 대한 조립 공정 이후에 배터리에 대한 안전 성을 확인하는 공정일 수 있다. 활성화 공정을 통해 배터리에 대한 충전 또는 방전을 반복하면서 배터리에 대해 측정된 데이터에 기초하여 배터리의 안전성을 테스트할 수 있다. 제1 트레이에 포함된 배터리 셀들에 대한 dOCV2의 평균과 표준편차에 기초하여 제1 트레이에 대한 컷 오프 (cutoff, 100)가 설정될 수 있다. 제1 트레이에 대한 컷 오프 미만인 배터리 셀들은 정상 배터리 셀로 분 류될 수 있고, 제1 트레이에 대한 컷 오프 이상인 배터리 셀들은 불량 배터리 셀로 분류될 수 있다. 여기 서, 트레이는 생산된 배터리 셀들을 일정한 개수로 분류한 묶음 단위로서 복수의 배터리 셀들을 포함하는 박스 일 수 있다. 예컨대, 3000개의 배터리 셀들이 생성되는 경우, 100개의 트레이들 각각에는 30개의 배터리 셀들이포함될 수 있다. 컷 오프는, 저전압 배터리 셀을 선별하기 위한 기준치들 중 하나일 수 있다. 컷 오프는, 트레 이 별 저전압 의심군을 제외한 배터리 셀들의 dOCV2의 평균과 표준편차(σ)에 기초하여 설정된 값일 수 있다. 예컨대, 컷 오프는 dOCV2의 평균과 4σ의 합에 기초한 값일 수 있다. 이하에서는, 불량 배터리 셀은 저전압 배터리 셀이라고 지칭될 수 있다. 다만, 이는 본 발명을 설명하기 위한 전제일 뿐, 불량 배터리 셀은 저전압 배터리 셀로 한정되는 것은 아니며 다양한 불량 유형에 해당하는 배터리 셀이라고 지칭될 수도 있다. 제2 그래프는 제2 트레이에 포함된 배터리 셀들 각각의 dOCV2를 도시한다. 제2 트레이에 포함된 배터리 셀 들에 대한 dOCV2의 평균과 표준편차에 기초하여 제2 트레이에 대한 컷 오프가 설정될 수 있다. 제2 트레이 에 대한 컷 오프 미만인 배터리 셀들은 정상 배터리 셀로 분류될 수 있고, 제2 트레이에 대한 컷 오프 이상인 배터리 셀들은 저전압 배터리 셀로 분류될 수 있다. 제1 그래프와 제2 그래프를 통합하여 도시한 제3 그래프를 참조하면, 제1 그래프 상에서 정상 배터리 셀로 분류된 배터리 셀에 대한 데이터는 제2 트레이에 대한 컷 오프 이상이므로, 이 배터리 셀은 저전압 배터리 셀로 분류될 수 있다. 마찬가지로, 제2 그래프 상에서 저전압 배터리 셀로 분류된 배터 리 셀에 대한 데이터는 제1 트레이에 대한 컷 오프 미만이므로, 이 배터리 셀은 정상 배터리로 분류 될 수 있다. 즉, 트레이들 각각은 배터리 셀들에 대한 dOCV2의 평균 및 표준편차가 상이하여 저전압을 판단하는 컷 오프가 상이할 수 있기 때문에, 트레이 구분 없이 적용 가능한 통합 기준치를 도출해낼 필요성이 있다. 도 2는 본 개시의 일 실시 예에 따른 저전압 배터리 셀 선별 장치의 블록도이다. 도 2를 참조하면, 저전압 배터리 셀 선별 장치는 사용자 단말과 유선 및/또는 무선으로 연결될 수 있다. 일 실시 예에서, 저전압 배터리 셀 선별 장치와 사용자 단말 간의 연결은 유선 및/또는 무선 네트 워크를 통한 통신 연결일 수 있다. 일 실시 예에서, 유선 네트워크는 LAN(local area network) 통신, 또는 전력 선 통신에 기초할 수 있다. 일 실시 예에서, 무선 네트워크는 근거리 통신 네트워크(예: 블루투스, WiFi(wireless fidelity) 또는 IrDA(infrared data association)), 또는 원거리 통신 네트워크(셀룰러 네트워 크, 4G 네트워크, 5G 네트워크)에 기초할 수 있다. 다른 실시 예에서, 저전압 배터리 셀 선별 장치와 사용자 단말 간의 연결은 기기 간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통한 연결일 수 있다. 일 실시 예에서, 복수의 트레이들(221, 223, 225) 각각에는 제조된 복수의 배터리 셀들이 포함될 수 있다. 일 실시 예에서, 사용자 단말은 저전압 배터리 셀 선별 장치를 제어하는 모바일 디바이스(예: 휴대폰, 랩탑 컴퓨터, 스마트 폰, 스마트 패드), 또는 PC(personal computer)일 수 있다. 일 실시 예에서, 저전압 배터리 셀 선별 장치는 통신 회로, 센서, 메모리, 및 프로세서 를 포함할 수 있다. 실시 예에 따라, 도 2에 도시된 저전압 배터리 셀 선별 장치는 도 2에서 도시된 구성 요소들 이외의 적어도 하나의 구성 요소(예: 디스플레이, 입력 장치, 또는 출력 장치)를 더 포함할 수 있 다. 일 실시 예에서, 통신 회로는 저전압 배터리 셀 선별 장치와 사용자 단말 간의 유선 통신 채널 및 /또는 무선 통신 채널을 수립하고, 수립된 통신 채널을 통해 사용자 단말과 데이터를 송수신할 수 있다. 일 실시 예에서, 센서는, 복수의 트레이들(221, 223, 225)에 포함된 배터리 셀들에 대한 공정 데이터 셋들 을 획득할 수 있다. 일 실시 예에서, 공정 데이터 셋들에는 배터리 셀의 개방 회로 전압(OCV: open circuit voltage)에 대한 데이터가 포함될 수 있다. 여기서, 공정 데이터 셋에는 배터리 셀들 각각에 대하여, 활성화 공 정의 시간 순서에 따라 측정된 개방 회로 전압(OCV: open circuit voltage)이 포함될 수 있다. 예컨대, 공정 데 이터 셋에는 배터리 셀에 대한 1차 측정 OCV(OCV1), 2차 측정 OCV(OCV2), 및 3차 측정 OCV(OCV3)가 포함될 수 있고, 각 차수는 활성화 공정의 시간 순서에 따라 구별될 수 있다. 일 실시 예에서, 메모리는 휘발성 메모리 및/또는 비휘발성 메모리를 포함할 수 있다. 일 실시 예에서, 메모리는, 저전압 배터리 셀 선별 장치의 적어도 하나의 구성요소(예: 프로세서 )에 의해 사용되는 데이터를 저장할 수 있다. 예를 들어, 데이터는 소프트웨어(또는, 이와 관련된 명령어 (instruction)), 입력 데이터 또는 출력 데이터를 포함할 수 있다. 일 실시 예에서, 명령어는 프로세서에 의해 실행 시 저전압 배터리 셀 선별 장치가 명령어에 의해 정의되는 동작들을 수행하게 할 수 있다. 일 실시 예에서, 메모리는 하나 이상의 소프트웨어들(예: 데이터 획득부, 데이터 전처리부, 선 별부, 및 모델 학습부)를 포함할 수 있다. 일 실시 예에서, 프로세서는 중앙 처리 장치, 어플리케이션 프로세서, 그래픽 처리 장치, 신경망 처리 장 치(NPU, neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서 를 포함할 수 있다. 일 실시 예에서, 프로세서는 소프트웨어(예: 데이터 획득부, 데이터 전처리부, 선별부, 및 모델 학습부)를 실행하여 프로세서에 연결된 저전압 배터리 셀 선별 장치의 적어도 하나의 다른 구성 요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 이하에서는, 도 2 내지 도 5를 참조하여, 데이터 획득부, 데이터 전처리부, 선별부, 및 모델 학 습부를 통해 저전압 배터리 셀 선별 장치가 생산된 배터리 셀들 중 저전압 배터리 셀을 선별하는 방법 을 설명한다. 데이터 획득부는 복수의 배터리 트레이들에 대한 공정 데이터 셋들을 획득할 수 있다. 데이터 획득부(24 2)는 센서를 통해 복수의 배터리 트레이들에 포함된 배터리 셀들에 대한 공정 데이터 셋들을 획득할 수 있 다. 데이터 전처리부는 미가공 데이터(raw data)를 전처리할 수 있다. 데이터 전처리부는 공정 데이터 셋 을 전처리할 수 있다. 데이터 전처리부는 공정 데이터 셋을 파생 변수 데이터 셋을 생성함으로써, 공정 데이터 셋을 전처리할 수 있다. 데이터 전처리부는 공정 데이터 셋의 OCV 값을 이용하여 공정 데이터 셋을 복수의 파생 변수들 각각 에 대한 파생 변수 데이터를 생성할 수 있다. 여기서, 파생 변수 데이터 셋은 복수의 파생 변수들 각각에 대한 파생 변수 데이터를 포함할 수 있다. 예컨대, 데이터 전처리부는 배터리 셀의 OCV 값을 이용하여 공정 데 이터 셋을 3개의 파생 변수들 각각의 형태로 변환한 파생 변수 데이터를 포함하는 파생 변수 데이터 셋을 생성 할 수 있다. 데이터 전처리부는, 공정 데이터 셋에 기초한 파생 변수 데이터 셋을 표준화함으로써, 공정 데이터 셋을 추가적으로 전처리할 수 있다. 데이터 전처리부는, 파생 변수 데이터 셋에 포함된 파생 변수 데이터들 각각에 대해 표준화를 수행하여 표준화된 파생 변수 데이터 셋을 생성할 수 있다. 일 실시 예에서, 데이터 전처리부는 배터리 셀의 공정 데이터 셋에 포함된 OCV 값들을 복수의 파생 변수들 각각에 대한 형태로 변환할 수 있다. 데이터 전처리부는 배터리 셀의 공정 데이터 셋에 포함된 OCV 값들을 복수의 파생 변수들 각각의 형태로 변환한 파생 변수 데이터를 생성할 수 있다. 여기서, 파생 변수는 배터리 셀 의 OCV 값에 기초한 변수일 수 있다. 예컨대, 파생 변수의 수는 3개일 수 있고, 3개의 파생 변수들은 수학식1 내지 수학식 3에 기초하여 표현될 수 있다. 수학식 1"}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, dOCV2는 배터리 셀에 대해 측정된 OCV1과 OCV2 간의 차이이고, μ는 트레이 별 배터리 셀들의 dOCV2의 평균이며, σ는 트레이 별 배터리 셀들의 dOCV2의 표준편차일 수 있다. 수학식 2"}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, 컷 오프(cutoff)는, 종래에 사용된 저전압 배터리 셀을 선별하기 위한 기준치들 중 하나일 수 있다. 컷 오프는 트레이 별 저전압 의심군을 제외한 배터리 셀들의 dOCV2의 평균과 표준편차에 기초하여 설정된 값일 수 있다. 예컨대, 컷 오프는 dOCV2의 평균과 4σ의 합에 대응할 수 있다. 수학식 3"}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "일 실시 예에서, 데이터 전처리부는 파생 변수 데이터 셋들의 사분위수(quartile)에 기초한 평균 및 표준 편차를 이용하여 파생 변수 데이터 셋들을 표준화할 수 있다. 데이터 전처리부는, 파생 변수 데이터 셋에 대한 IQR에 기초하여, 제1 사분위수(Q1) 내지 제3 사분위수(Q3) 내에 존재하는 파생 변수 데이터 셋들의 평균 및 표준편차를 계산하고, 계산된 평균 및 표준편차를 이용하여 파생 변수 데이터 셋을 표준화할 수 있다. 여기 서, IQR은 사분범위로서, 복수의 파생 변수들 각각에 대하여 전체 배터리 셀들에 대한 파생 변수 데이터 셋들을 오름차순으로 나열할 때 상위 25% 및 하위 25%의 데이터를 제외한 데이터의 분포 정도를 나타낼 수 있다. 파생 변수 데이터 셋은 수학식 4에 기초하여 표준화될 수 있다. 수학식 4"}
{"patent_id": "10-2023-0031451", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, X는 파생 변수 데이터 셋에 포함된 적어도 하나의 파생 변수 데이터일 수 있다. Q1은 제1 사분위수에 해당하는 파생 변수 데이터일 수 있고, Q3은 제3 사분위수에 해당하는 파생 변수 데이터일 수 있다. 및 는 각각 제1 사분위수와 제3 사분위수 내에 존재하는 파생 변수 데이터의 평균 및 표준편차일 수 있다. 데이터 전처리부가 표준화를 수행하는 이유는, 전체 데이터 셋들 중 양극단에 분포하는 데이터 셋의 경우 저전압이 아닌 다른 원인에 의한 불량 배터리 셀에 해당하는 데이터 셋일 수 있기 때문이다. 데이터 전처리부 가 전체 데이터 셋들 중 양극단에 분포하는 데이터 셋들을 배제하고 표준화를 수행함으로써, 최종적으로는 본 발명이 저전압 배터리 셀을 선별해 내는 정확도를 높일 수 있다. 데이터 전처리부는, 공정 데이터 셋의 값들에 대해 파생 변수에 기초한 파생 변수 데이터 셋으로 변환하여 트레이 내부의 편차를 반영할 수 있고, 파생 변수 데이터 셋에 대해 표준화를 수행함으로써 트레이 간의 편차도 반영할 수 있다. 이에 따라, 본 발명은 트레이 별로 분포도가 상이한 데이터를 표준화된 데이터로 통합하여 관 리할 수 있다. 이하에서는, 전처리된 데이터에 기초하여 저전압 배터리 셀을 선별하기 위한 인공지능 모델을 학습시키는 방법 과 기 학습된 인공지능 모델을 이용하여 저전압 배터리 셀을 선별하는 방법을 설명한다. 인공지능 모델 학습 방법 모델 학습부는 훈련 데이터 셋들을 이용하여 인공지능 모델을 학습시킬 수 있다. 여기서, 훈련 데이터 셋 은 정상 배터리 셀에 대한 공정 데이터 셋일 수 있다. 훈련 데이터 셋은 정상 배터리에 대한 파생 변수 데이터 셋일 수 있다. 훈련 데이터 셋은 정상 배터리에 대한 표준화된 파생 변수 데이터 셋일 수 있다. 모델 학습부는 훈련 데이터 셋들을 이용하여 정상 배터리 셀에 대한 분포 패턴을 학습할 수 있다. 예컨대, 모델 학습부는 제1 파생 변수와 제2 파생 변수에 따른 훈련 데이터 셋들의 분포에 기초하여 정상 배터리 셀들의 분포 패턴을 학습할 수 있다. 저전압 배터리 셀 선별 방법 선별부는 기 학습된 인공지능 모델을 이용하여 저전압 배터리 셀을 선별할 수 있다. 선별부는 모델 학습부에 의해 학습된 인공지능 모델을 이용하여 저전압 배터리 셀을 선별할 수 있다. 일 실시 예에서, 선별부는 학습된 분포 패턴으로부터 지정된 범위를 벗어나는 표준화된 공정 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별할 수 있다. 일 실시 예에서, 선별부는 정상 배터리 셀과 저전압 배터리 셀 간의 경계를 결정할 수 있다. 선별부 는, 학습된 분포 패턴에 기초하여 정상 배터리 셀과 저전압 배터리 셀 간의 경계를 결정할 수 있다. 선별부 는 결정된 경계에 포함되지 않은 표준화된 공정 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별 할 수 있다. 여기서, 결정된 경계란 정상 배터리 셀에 대한 분포 패턴에 기초한 영역의 경계 값일 수 있다. 결 정된 경계를 기준으로 결정된 경계 내부의 영역은 정상 배터리 셀로 판단되는 영역이고, 결정 경계 외부의 영역 은 저전압 배터리 셀로 판단되는 영역일 수 있다. 도 3은 본 개시의 일 실시 예에 따른 제1 파생 변수 및 제2 파생 변수에 기초하여 표준화된 데이터에 대한 제1 분포도를 예시한다. 도 3을 참조하면, 제1 파생 변수와 제2 파생 변수에 기초한 표준화된 데이터에 대한 제1 분포도 상에는 복 수의 배터리 셀들에 대한 표준화된 파생 변수 데이터 셋들의 분포가 표시될 수 있다. 모델 학습부는 표준화된 파생 변수 데이터들의 분포에 기초하여 정상 배터리 셀에 대한 분포 패턴을 학습 할 수 있다. 일 실시 예에서, 모델 학습부는, 제1 분포도 상의 데이터 밀집도에 기초하여 인공지능 모 델이 정상 배터리 셀에 대한 분포 패턴을 학습하도록 할 수 있다. 다른 실시 예에서, 모델 학습부는 표준 화된 파생 변수 데이터 셋들의 평균 및 표준편차에 기초하여 인공지능 모델이 정상 배터리 셀에 대한 분포 패턴 을 학습하도록 할 수 있다. 선별부는, 모델 학습부에 의해 도출된 분포 패턴으로부터 지정된 범위를 벗어나는 데이터에 해당하는 배터리 셀을 저전압으로 인한 불량 배터리 셀로 선별할 수 있다. 제1 분포도 상에는 결정된 경계가 더 표시될 수 있다. 여기서, 결정된 경계는, 학습된 분포 패턴에 기초하 여 정상 배터리 셀인지 여부를 판단할 수 있는 기준 경계 값을 의미할 수 있다. 선별부는 결정된 경계에 포함되지 않은 표준화된 파생 변수 데이터 셋에 해당하는 배터리 셀을 저전 압으로 인한 불량 배터리 셀로 선별할 수 있다. 예컨대, 선별부는, 결정된 경계를 기준으로 결정된 경계의 내부에 분포하는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀은 정상 배터리 셀로 선별할 수 있다. 도 4는 본 개시의 일 실시 예에 따른 제3 파생 변수 및 제2 파생 변수에 기초하여 표준화된 데이터에 대한 제2 분포도를 예시한다. 도 4를 참조하면, 제3 파생 변수와 제2 파생 변수에 기초한 표준화된 데이터에 대한 제2 분포도 상에는 복 수의 배터리 셀들 각각에 대한 표준화된 파생 변수 데이터 셋들의 분포가 표시될 수 있다. 전술한 도 3과 마찬가지로, 모델 학습부는 표준화된 파생 변수 데이터 셋들의 분포에 기초하여 정상 배터 리 셀에 대한 분포 패턴을 학습할 수 있다. 선별부는, 모델 학습부에 의해 도출된 분포 패턴으로부터 지정된 범위를 벗어나는 표준화된 파생 변 수 데이터 셋을 가지는 배터리 셀을 저전압으로 인한 불량 배터리 셀로 선별할 수 있다. 제2 분포도 상에는 결정된 경계가 더 표시될 수 있다. 선별부는 결정된 경계에 포함되지 않 은 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀을 저전압으로 인한 불량 배터리 셀로 선별할 수 있다. 예 컨대, 선별부는, 결정된 경계를 기준으로 결정된 경계의 내부에 분포하는 표준화된 파생 변수 데이터 셋을 가지는 배터리 셀은 정상 배터리 셀로 분류할 수 있다. 전술한 도 3 및 도 4에서 설명한 제1 분포도 및 제2 분포도는 두 가지 파생 변수들에 기초한 평면 분포도에 관 한 것이지만, 이는 설명을 위한 것일 뿐 본 발명은 이에 한정되지 않는다. 본 발명은, 세 개의 파생 변수들에 기초한 공간 분포도를 이용하여 저전압 배터리 셀을 선별할 수도 있다. 도 5는 본 개시의 일 실시 예에 따른 저전압 배터리 셀 선별 장치의 동작 방법을 나타내는 흐름도이다. 도 5를 참조하면, 동작 500에서, 데이터 획득부는 복수의 배터리 트레이들에 대한 공정 데이터 셋들을 획 득할 수 있다. 데이터 획득부는 센서를 통해 복수의 배터리 트레이들에 포함된 배터리 셀들에 대한 공정 데이터 셋들을 획득할 수 있다. 동작 502에서, 데이터 전처리부는 미가공 데이터(raw data)를 전처리할 수 있다. 데이터 전처리부는 공정 데이터 셋을 전처리할 수 있다. 데이터 전처리부는 공정 데이터 셋을 파생 변수 데이터 셋으로 변환함으로써, 공정 데이터 셋을 전처리할 수 있다. 데이터 전처리부는 공정 데이터 셋의 OCV 값을 이용하여 공정 데이터 셋을 복수의 파생 변수들 각각에 대한 파생 변수 데이터로 변환할 수 있다. 일 실시 예에서, 데이터 전처리부는 배터리 셀의 공정 데이터 셋에 포함된 OCV 값들을 복수의 파생 변수들 각각에 대한 형태로 변환할 수 있다. 데이터 전처리부는 배터리 셀의 공정 데이터 셋에 포함된 OCV 값들을 복수의 파생 변수들 각각의 형태로 변환한 파생 변수 데이터를 생성할 수 있다. 일 실시 예에서, 데이터 전처리부는 파생 변수 데이터 셋들의 사분위수(quartile)에 기초한 평균 및 표준 편차를 이용하여 파생 변수 데이터 셋들을 표준화할 수 있다. 데이터 전처리부는, 파생 변수 데이터 셋에 대한 IQR에 기초하여, 제1 사분위수(Q1) 내지 제3 사분위수(Q3) 내에 존재하는 파생 변수 데이터 셋들의 평균 및 표준편차를 계산하고, 계산된 평균 및 표준편차를 이용하여 파생 변수 데이터 셋을 표준화할 수 있다. 동작 504에서, 선별부는 기 학습된 인공지능 모델을 이용하여 저전압 배터리 셀을 선별할 수 있다. 선별부 는, 모델 학습부에 의해 학습된 인공지능 모델을 이용하여 저전압 배터리 셀을 선별할 수 있다. 일 실시 예에서, 선별부는 학습된 분포 패턴으로부터 지정된 범위를 벗어나는 표준화된 공정 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별할 수 있다. 일 실시 예에서, 선별부는 정상 배터리 셀과 저전압 배터리 셀 간의 경계를 결정할 수 있다. 선별부 는, 학습된 분포 패턴에 기초하여 정상 배터리 셀과 저전압 배터리 셀 간의 경계를 결정할 수 있다. 선별부 는 결정된 경계에 포함되지 않은 표준화된 공정 데이터 셋을 가지는 배터리 셀을 저전압 배터리 셀로 선별 할 수 있다. 이상에서 기재된 \"포함하다\", \"구성하다\", 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소를 내재할 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의 되지 않는 한, 본 문서에 개시된 실시예들이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문 맥상의 의미와 일치하는 것으로 해석되어야 하며, 본 문서에서 명백하게 정의하지 않는 한, 이상적이거나 과도 하게 형식적인 의미로 해석되지 않는다. 이상의 설명은 본 문서에 개시된 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 문서에 개시된 실시 예들이 속하는 기술 분야에서 통상의 지식을 가진 자라면 본 문서에 개시된 실시예들의 본질적인 특성에서 벗어 나지 않는 범위에서 다양한 수정 및 변형이 가능할 것이다. 따라서, 본 문서에 개시된 실시예들은 본 문서에 개 시된 실시예들의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 문 서에 개시된 기술 사상의 범위가 한정되는 것은 아니다. 본 문서에 개시된 기술사상의 보호 범위는 아래의 청구 범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술사상은 본 문서의 권리 범위에 포함되는 것으로 해석되어야 할 것이다. 도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2023-0031451", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술에 따른 저전압 배터리 셀을 선별하는 방법의 문제점을 도시한다. 도 2는 본 개시의 일 실시 예에 따른 저전압 배터리 셀 선별 장치의 블록도이다. 도 3은 본 개시의 일 실시 예에 따른 제1 파생 변수 및 제2 파생 변수에 기초하여 표준화된 데이터에 대한 제1 분포도를 예시한다. 도 4는 본 개시의 일 실시 예에 따른 제3 파생 변수 및 제2 파생 변수에 기초하여 표준화된 데이터에 대한 제2 분포도를 예시한다. 도 5는 본 개시의 일 실시 예에 따른 저전압 배터리 셀 선별 장치의 동작 방법을 나타내는 흐름도이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
