{"patent_id": "10-2023-0192832", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0108271", "출원번호": "10-2023-0192832", "발명의 명칭": "종단적 데이터에 대한 도메인 적응 방법 및 이를 이용한 장치", "출원인": "아주대학교산학협력단", "발명자": "신현정"}}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "도메인 변환을 위한 투영 행렬 및 데이터 필터링을 위한 그래프 행렬을 이용하여 제1 변환 데이터를 생성하는제1 모듈;상기 제1 변환 데이터의 도메인을 결정하는 제2 모듈; 및상기 제1 변환 데이터의 라벨을 결정하는 제3 모듈을 포함하는종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 모듈은,상기 제1 변환 데이터의 매니폴드와 비교 데이터의 매니폴드의 차이인 제1 차이 및 상기 제1 변환 데이터의 분포와 상기 비교 데이터의 분포의 차이인 제2 차이를 산출하고,상기 제1 차이 및 상기 제2 차이가 작아지도록 상기 투영 행렬을 수정하는종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 그래프 행렬은 가중치 행렬이 정규화된 행렬이고,상기 가중치 행렬은 상기 비교 데이터의 공분산 행렬의 그래프에 기초하여 설정되는종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 제2 차이는 쿨백 라이블러 발산(Kullback-Leibler divergence) 함수를 이용하여 산출되는종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 변환 데이터는 아래 수학식에 의해 산출되는(: 제1 변환 데이터, : 입력 데이터, : 투영 행렬, : 그래프 행렬)공개특허 10-2024-0108271-4-종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 제2 차이는 아래 수학식에 의해 산출되는(: 제2 차이, : 쿨백 라이블러 발산 함수, : 제1 변환 데이터의 평균에 대한 확률, : 비교데이터에 대한 확률)종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제2 모듈은,미리 정해진 수학식에 기초하여 상기 제1 변환 데이터의 도메인을 판별하고,상기 제1 변환 데이터의 도메인이 제1 시점으로 판별되면 제1 값을 출력하고, 상기 제1 변환 데이터의 도메인이제2 시점으로 판별되면 제2 값을 출력하는종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 미리 정해진 수학식은 아래와 같은(: 도메인 판별 함수, : 제1 변환 데이터 집합, : 판별 파라미터)종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 판별 파라미터는 상기 도메인 판별 함수와 도메인 라벨 세트 사이의 이진화 크로스 엔트로피(binarycross-entropy) 손실 함수를 최소화함으로써 최적화되는종단적 데이터에 대한 도메인 적응 장치.공개특허 10-2024-0108271-5-청구항 10 제9항에 있어서,상기 이진화 크로스 엔트로피 손실 함수는 아래 수학식에 의해 산출되는( : 이진화 크로스 엔트로피 손실 함수, : 도메인 판별 함수, : 도메인 라벨 세트)종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 제1 모듈은 상기 투영 행렬 및 상기 그래프 행렬을 이용하여 비교 데이터가 변환된 제2 변환 데이터를 생성하고,상기 제3 모듈은 상기 제2 변환 데이터에 기초하여 상기 비교 데이터의 클래스 및 회귀(regression)를 판단하는종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제3 모듈은 아래 수학식을 이용하여 상기 비교 데이터의 클래스 및 회귀를 판단하는(: 라벨 예측 함수, : 제2 변환 데이터, : 라벨 파라미터)종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 라벨 파라미터는 상기 라벨 예측 함수와 정답 라벨 세트 사이의 크로스 엔트로피(cross-entropy) 손실 함수를 최소화함으로써 최적화되는종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 크로스 엔트로피 손실 함수는 아래 수학식에 의해 산출되는공개특허 10-2024-0108271-6-( : 크로스 엔트로피 손실 함수, : 라벨 예측 함수, : 정답 라벨 세트)종단적 데이터에 대한 도메인 적응 장치."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "적어도 하나 이상의 프로세서에 의해 수행되는 종단적 데이터에 대한 도메인 적응 방법에 있어서,도메인 변환을 위한 투영 행렬 및 데이터 필터링을 위한 그래프 행렬을 이용하여 제1 변환 데이터를 생성하는단계;상기 제1 변환 데이터의 매니폴드와 비교 데이터의 매니폴드의 차이인 제1 차이 및 상기 제1 변환 데이터의 분포와 상기 비교 데이터의 분포의 차이인 제2 차이를 산출하는 단계; 및상기 제1 차이 및 상기 제2 차이가 작아지도록 상기 투영 행렬을 수정하는 단계를 포함하는종단적 데이터에 대한 도메인 적응 방법."}
{"patent_id": "10-2023-0192832", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 기재된 종단적 데이터에 대한 도메인 적응 방법을 실행시키도록 컴퓨터로 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본원 발명의 종단적 데이터에 대한 도메인 적응 장치는 도메인 변환을 위한 투영 행렬 및 데이터 필터링을 위한 그래프 행렬을 이용하여 제1 변환 데이터를 생성하는 제1 모듈; 상기 제1 변환 데이터의 도메인을 결정하는 제2 모듈; 및 상기 제1 변환 데이터의 라벨을 결정하는 제3 모듈을 포함할 수 있다. 본원 발명은 혁신형 만성뇌혈관질환 바이오뱅크(세부과제번호: KBN4-B02-2023-01) 지원 사업을 통해 개발된 기술 이다. 한편, 본원 발명의 모든 측면에서 질병관리청 국립보건연구원의 재산 이익은 없다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원 발명은 도메인 적응 장치에 관한 것으로, 보다 상세하게는, 종단적 데이터에 대한 도메인 적응 장치에 관 한 것이다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종단적 데이터에 대한 도메인 적응은 특정 도메인의 특성을 고려하여 모델을 향상시키는 과정이다. 이는 데이터 의 계절성, 주기성, 특별한 이벤트 등을 이해하고 반영함으로써 모델의 정확도를 높일 수 있다. 또한, 도메인 특정 특성을 고려함으로써 모델이 해당 도메인에서 보다 신뢰성 있게 예측하게 도와주며, 데이터 불균형과 실시 간 업데이트에 대한 대응도 강화된다. 도메인 적응은 모델이 도메인의 독특한 패턴을 학습하고 실시간으로 업데 이트하여 최신 정보를 반영하는 데 중요하다. 본원 발명은 혁신형 만성뇌혈관질환 바이오뱅크(세부과제번호: KBN4-B02-2023-01) 지원 사업을 통해 개발된 기 술이다. 한편, 본원 발명의 모든 측면에서 질병관리청 국립보건연구원의 재산 이익은 없다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원 발명의 일 과제는 종단적 데이터에 대한 도메인 및 라벨을 결정할 수 있는 도메인 적응 장치에 관한 것이다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 종단적 데이터에 대한 도메인 적응 장치는 도메인 변환을 위한 투영 행렬 및 데이터 필터링을 위한 그래프 행렬을 이용하여 제1 변환 데이터를 생성하는 제1 모듈; 상기 제1 변환 데이터의 도메인을 결정하 는 제2 모듈; 및 상기 제1 변환 데이터의 라벨을 결정하는 제3 모듈을 포함할 수 있다. 여기서, 상기 제1 모듈은, 상기 제1 변환 데이터의 매니폴드와 비교 데이터의 매니폴드의 차이인 제1 차이 및 상기 제1 변환 데이터의 분포와 상기 비교 데이터의 분포의 차이인 제2 차이를 산출하고, 상기 제1 차이 및 상기 제2 차이가 작아지도록 상기 투영 행렬을 수정할 수 있다. 여기서, 상기 그래프 행렬은 가중치 행렬이 정규화된 행렬이고, 상기 가중치 행렬은 상기 비교 데이터의 공분산 행렬의 그래프에 기초하여 설정될 수 있다. 여기서, 상기 제2 차이는 쿨백 라이블러 발산(Kullback-Leibler divergence) 함수를 이용하여 산출될 수 있다. 여기서, 상기 제1 변환 데이터는 아래 수학식에 의해 산출될 수 있다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "( : 제1 변환 데이터, : 입력 데이터, : 투영 행렬, : 그래프 행렬) 여기서, 상기 제2 차이는 아래 수학식에 의해 산출될 수 있다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "( : 제2 차이, : 쿨백 라이블러 발산 함수, : 제1 변환 데이터의 평균에 대한 확률, : 비교 데이터에 대한 확률) 여기서, 상기 제2 모듈은, 미리 정해진 수학식에 기초하여 상기 제1 변환 데이터의 도메인을 판별하고, 상기 제 1 변환 데이터의 도메인이 제1 시점으로 판별되면 제1 값을 출력하고, 상기 제1 변환 데이터의 도메인이 제2 시 점으로 판별되면 제2 값을 출력할 수 있다. 여기서, 상기 미리 정해진 수학식은 아래와 같을 수 있다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "( : 도메인 판별 함수, : 제1 변환 데이터 집합, : 판별 파라미터) 여기서, 상기 판별 파라미터는 상기 도메인 판별 함수와 도메인 라벨 세트 사이의 이진화 크로스 엔트로피 (binary cross-entropy) 손실 함수를 최소화함으로써 최적화될 수 있다. 여기서, 상기 이진화 크로스 엔트로피 손실 함수는 아래 수학식에 의해 산출될 수 있다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 5, "content": "( : 이진화 크로스 엔트로피 손실 함수, : 도메인 판별 함수, : 도메인 라벨 세트) 여기서, 상기 제1 모듈은 상기 투영 행렬 및 상기 그래프 행렬을 이용하여 비교 데이터가 변환된 제2 변환 데이 터를 생성하고, 상기 제3 모듈은 상기 제2 변환 데이터에 기초하여 상기 비교 데이터의 클래스 및 회귀 (regression)를 판단할 수 있다. 여기서, 상기 제3 모듈은 아래 수학식을 이용하여 상기 비교 데이터의 클래스 및 회귀를 판단할 수 있다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 6, "content": "( : 라벨 예측 함수, : 제2 변환 데이터, : 라벨 파라미터) 여기서, 상기 라벨 파라미터는 상기 라벨 예측 함수와 정답 라벨 세트 사이의 크로스 엔트로피(cross-entropy) 손실 함수를 최소화함으로써 최적화될 수 있다.여기서, 상기 크로스 엔트로피 손실 함수는 아래 수학식에 의해 산출될 수 있다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 7, "content": "( : 크로스 엔트로피 손실 함수, : 라벨 예측 함수, : 정답 라벨 세트) 일 실시예에 따른 종단적 데이터에 대한 도메인 적응 방법은 도메인 변환을 위한 투영 행렬 및 데이터 필터링을 위한 그래프 행렬을 이용하여 제1 변환 데이터를 생성하는 단계; 상기 제1 변환 데이터의 매니폴드와 비교 데이 터의 매니폴드의 차이인 제1 차이 및 상기 제1 변환 데이터의 분포와 상기 비교 데이터의 분포의 차이인 제2 차 이를 산출하는 단계; 및 상기 제1 차이 및 상기 제2 차이가 작아지도록 상기 투영 행렬을 수정하는 단계를 포함 할 수 있다. 여기서, 상기 종단적 데이터에 대한 도메인 적응 방법을 실행시키도록 컴퓨터로 판독 가능한 기록 매체에 저장 된 컴퓨터 프로그램이 제공될 수 있다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본원 발명의 일 실시예에 따르면 종단적 데이터에 대한 도메인 및 라벨을 결정할 수 있는 도메인 적응 장치가 제공될 수 있다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 기재된 실시예는 본원 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 본원 발명의 사상 을 명확히 설명하기 위한 것이므로, 본원 발명이 본 명세서에 기재된 실시예에 한정되는 것은 아니며, 본원 발 명의 범위는 본원 발명의 사상을 벗어나지 아니하는 수정예 또는 변형예를 포함하는 것으로 해석되어야 한다. 본 명세서에서 사용되는 용어는 본원 발명에서의 기능을 고려하여 가능한 현재 널리 사용되고 있는 일반적인 용 어를 선택하였으나 이는 본원 발명이 속하는 기술 분야에서 통상의 지식을 가진 자의 의도, 판례 또는 새로운 기술의 출현 등에 따라 달라질 수 있다. 다만, 이와 달리 특정한 용어를 임의의 의미로 정의하여 사용하는 경우 에는 그 용어의 의미에 관하여 별도로 기재할 것이다. 따라서 본 명세서에서 사용되는 용어는 단순한 용어의 명 칭이 아닌 그 용어가 가진 실질적인 의미와 본 명세서의 전반에 걸친 내용을 토대로 해석되어야 한다. 본 명세서에 첨부된 도면은 본원 발명을 용이하게 설명하기 위한 것으로 도면에 도시된 형상은 본원 발명의 이 해를 돕기 위하여 필요에 따라 과장되어 표시된 것일 수 있으므로 본원 발명이 도면에 의해 한정되는 것은 아니 다. 본 명세서에서 본원 발명에 관련된 공지의 구성 또는 기능에 대한 구체적인 설명이 본원 발명의 요지를 흐릴 수 있다고 판단되는 경우에 이에 관한 자세한 설명은 필요에 따라 생략하기로 한다. 도 1은 일 실시예에 따른 도메인 적응 장치를 설명하기 위한 도면이다. 도 1을 참조하면, 일 실시예에 따른 도메인 적응 장치는 입력 데이터(X_t, 예를 들어 과거 데이터)의 도메인 영 역을 변환하고, 비교 데이터(X_T, 예를 들어 현재 데이터 또는 미래 데이터)와의 불일치를 최소화한 후 레이블 을 예측할 수 있다. 구체적으로, 도메인 적응 장치는 입력 데이터의 도메인을 전환할 수 있다. 이때, 도메인 적응 장치는 투영 행렬 (P)을 이용하여 입력 데이터의 도메인이 전환된 제1 변환 데이터를 생성할 수 있다. 또한, 도메인 적응 장치는 그래프 행렬(G)을 이용하여 변환 데이터로부터 원하는 특징을 추출할 수 있다. 예를 들어, 도메인 적응 장치는 그래프 행렬을 이용하여 제1 변환 데이터의 매니폴드 및/또는 분포를 추출할 수 있다. 도메인 적응 장치는 입력 데이터가 전환된 제1 변환 데이터와 비교 데이터의 매니폴드 차이 및 분포 차이가 최 소화되도록 투영 행렬을 계속적으로 변경할 수 있다. 이에, 도메인 적응 장치는 학습을 통해 최적화된 투영 행 렬을 포함하게 될 수 있다. 도메인 적응 장치는 최적화된 투영 행렬(P)을 이용하여 입력 데이터의 도메인 및 라벨을 예측할 수 있다. 구체 적으로, 도메인 적응 장치는 입력 데이터의 도메인이 과거인지 현재(또는 미래)인지를 판단할 수 있다. 또한, 도메인 적응 장치는 최적화된 투영 행렬을 이용하여 입력 데이터의 클래스 및 회귀(regression)를 판단할 수 있 다. 도 2는 일 실시예에 따른 도메인 적응 장치에 포함된 인공지능 모델의 구조를 설명하기 위한 도면이다. 도 2를 참조하면, 일 실시예에 따른 도메인 적응 장치는 제1 모듈, 제2 모듈 및 제3 모듈을 포 함할 수 있다. 도 2는 도메인 적응 장치에 세 가지 모듈이 포함되는 것을 도시하였으나, 이에 한정되지 않고 도 메인 적응 장치는 이보다 적거나 많은 구성 요소를 포함할 수 있다. 도 2의 제1 모듈, 제2 모듈 및 제3 모듈은 하나의 인공지능 모델을 구성할 수 있다. 이에, 모듈 에서 학습 데이터를 통한 학습을 통해 파라미터가 최적화되고, 최적화된 파라미터에 기초하여 인공지능 모델은 결과 데이터를 출력할 수 있다. 구체적으로, 학습을 통해 최적화된 투영 행렬을 이용하여, 인공지능 모델은 입 력 데이터의 도메인 및 라벨을 결정할 수 있다. 제1 모듈은 투영 행렬 및 그래프 행렬을 이용하여 변환 데이터를 생성하는 적어도 하나 이상의 프로세서를 포함할 수 있다. 제1 모듈은 특징 변환기(Feature transformer)로도 명칭될 수 있다. 구체적으로, 제1 모 듈은 도메인 변환을 위한 투영 행렬 및 데이터 필터링을 위한 그래프 행렬을 이용하여 입력 데이터에 대한 제1 변환 데이터를 생성할 수 있다. 도 2를 참조하면, 제1 모듈은 인풋 데이터를 입력받을 수 있다. 제1 모듈은 인풋 데이터 및 투영 행 렬(P)을 이용하여 제1 레이턴트 데이터(Latent data)를 생성할 수 있다. 이어서, 제1 모듈은 제1 레이턴트 데이터 및 그래프 행렬(G)을 이용하여 제2 레이턴트 데이터를 생성할 수 있다. 이때, 제2 레이턴트 데이터는 변 환 데이터일 수 있다. 제1 모듈은 제1 변환 데이터의 매니폴드와 비교 데이터의 매니폴드 차이를 최소화되도록 투영 행렬(P)을 계속적으로 수정할 수 있다. 또한, 제1 모듈은 제1 변환 데이터의 분포와 비교 데이터의 분포 차이를 최소 화하도록 투영 행렬(P)을 계속적으로 수정할 수 있다. 투영 행렬(P)이 계속적으로 수정되는 과정은 제1 모듈 이 포함된 인공지능 모델이 학습되는 과정으로도 이해될 수 있다. 이에 대해서는 도 4 내지 도 6을 참조하 여 이하에서 자세히 설명한다. 이때, 제1 변환 데이터는 과거 데이터가 변환된 데이터일 수 있다. 또한 이때 비교 데이터는 현재 또는 과거의 데이터일 수 있다. 구체적인 예를 들어, 제1 변환 데이터는 특정 환자의 과거 의료 데이터와 관련되고, 비교 데 이터는 특정 환자의 현재 의료 데이터와 관련될 수 있다. 또한 예를 들어, 제1 변환 데이터는 과거의 주식 데이 터와 관련되고, 비교 데이터는 현재의 주식 데이터와 관련될 수 있다. 이와 같이, 본원 발명의 도메인 적응 장 치는 종단적 데이터에 대해서는 제한 없이 적용될 수 있다.종단적 데이터(Longitudinal Data)는 주요 요인 사이에 존재하는 인과 관계를 알기 위하여 수집된 데이터를 의 미하는 것일 수 있다. 종단적 데이터는 일정한 조사 대사에 대하여 특정한 시간 간격을 두고 수집된 동일한 변 수를 포함하는 데이터일 수 있다. 종단적 데이터는 패널 데이터(Panel Data)와 시계열 데이터(Time Series Data)를 포함할 수 있다. 패널 데이터는 조사 주제와 목적에 적당한 수의 동일한 조사 응답자 집단(패널)을 대상으로, 정기적으로 해당 주제에 대한 조사를 실시하여 그 변화를 추적할 수 있도록 수집된 데이터를 의미하는 것일 수 있다. 패널 데이 터는 동일한 표본으로부터 동일한 데이터를 반복적으로 수집하기 때문에, 서로 다른 대상을 조사할 때 발생하는 오차를 줄일 수 있으며, 변화의 방향과 정도를 의미 있게 파악할 수 있다. 시계열 데이터는 모집단들의 속성을 반복적으로 수집한 데이터 또는 동일한 모집단을 대상으로 반복적인 조사를 통해 수집된 데이터를 의미하는 것일 수 있다. 또한, 시계열 데이터는 복수의 시점에서 유사한 변수가 수집된 데이터를 의미하는 것일 수 있다. 본원 발명의 도메인 장치는 종단적 데이터인 과거 데이터를 이용하여 현재 데이터 또는 미래 데이터를 예측할 수 있다. 예를 들어, 본원 발명은 환자의 과거 의료 데이터를 이용하여 현재 의료 데이터를 예측할 수 있다. 또 한 예를 들어, 본원 발명은 과거 주식 데이터를 이용하여 현재 주식 데이터를 예측할 수 있다. 그러나, 위 예시 에 한정되지 않고 본원 발명은 종단적 데이터를 이용하는 분야에는 제한 없이 적용될 수 있다. 제2 모듈은 제1 모듈이 생성한 변환 데이터의 도메인을 결정하는 적어도 하나 이상의 프로세서를 포 함할 수 있다. 제2 모듈은 도메인 판별기(Domain discriminator)로도 명칭될 수 있다. 제2 모듈은 미리 정해진 수학식에 기초하여 변환 데이터의 도메인을 판별할 수 있다. 구체적으로, 제2 모듈은 판별 파 라미터( )를 이용하여 변환 데이터의 도메인을 판별하여 제2 모듈의 결과 데이터를 출력할 수 있다. 제2 모듈에 대해서는 도 7을 참조하여 이하에서 자세히 설명한다. 제3 모듈은 제1 모듈이 생성한 변환 데이터의 라벨을 결정하는 적어도 하나 이상의 프로세서를 포함 할 수 있다. 제32 모듈은 라벨 예측기(Label predictor)로도 명칭될 수 있다. 제3 모듈은 인공지능 모델의 학습을 위한 정답 데이터의 라벨을 결정할 수 있다. 구체적으로, 제3 모듈은 비교 데이터(또는 현 재 데이터)의 클래스 및 회귀(regression)를 판단하여 제3 모듈의 결과 데이터를 출력할 수 있다. 제 3 모듈에 대해서는 도 8을 참조하여 이하에서 자세히 설명한다. 도 3은 일 실시예에 따른 변환 데이터 생성 과정을 설명하기 위한 도면이다. 도 3을 참조하면, 제1 모듈은 입력 데이터에 대한 변환 데이터 생성 과정을 확인할 수 있다. 구체적으 로, 제1 모듈은 입력 데이터에 투영 행렬(P)을 적용하여 제1 레이턴트 데이터를 생성할 수 있다. 또한, 제1 모듈은 제1 레이턴트 데이터에 그래프 행렬(G)을 적용하여 제2 레이턴트 데이터를 생성 할 수 있다. 이때, 제2 레이턴트 데이터는 제1 모듈의 결과 데이터인 변환 데이터일 수 있다. 제1 모듈은 입력 데이터에 따라 다양한 변환 데이터를 생성할 수 있다. 도 3의 예시에서는 입력 데이터 가 과거 데이터(X_t)인 것들 도시하였으나, 이에 한정되지 않고 제1 모듈은 입력 데이터가 현재 데이 터(X_T)인 경우에도 현재 데이터에 대한 변환 데이터를 생성할 수 있다. 그래프 행렬(G)은 가중치 행렬이 정규화된 행렬일 수 있다. 이때, 가중치 행렬은 비교 데이터(현재 데이터, X_T)의 공분산 행렬의 그래프에 기초하여 설정될 수 있다. 구체적으로, 그래프 행렬(G)는 아래 [수학식 1]에 의 해 산출될 수 있다. 수학식 1 ( : 비교 데이터(X_T)의 공분산 행렬의 그래프, ) 도 4는 변환 데이터의 매니폴드를 설명하기 위한 도면이다. 도 4를 참조하면, 제1 모듈은 그래프 행렬을 이용하여 변환 데이터의 매니폴드를 추출할 수 있다. 매니폴 드는 데이터의 내재적인 특성을 의미하는 것일 수 있다. 구체적으로, 매니폴드는 데이터 사이의 관계와 관련된 특징일 수 있다. 제1 모듈에서 과거 데이터의 매니폴드와 현재 데이터의 매니폴드의 차이가 최소 화되도록 투영 행렬(P)이 수정됨으로써, 수정된 투영 행렬을 거친 두 데이터가 동일한 특징 속성을 갖을 수 있 다. 도 5는 변환 데이터의 분포를 설명하기 위한 도면이다. 도 5를 참조하면, 제1 모듈은 그래프 행렬을 이용하여 변환 데이터의 분포를 추출할 수 있다. 분포는 데이 터의 외재적인 특성을 의미하는 것일 수 있다. 구체적으로, 분포는 데이터 사이의 거리와 관련된 특징일 수 있 다. 제1 모듈에서 과거 데이터의 분포와 현재 데이터의 분포의 차이가 최소화되도록 투영 행렬 (P)이 수정됨으로써, 수정된 투영 행렬을 거친 두 데이터가 동일한 특징 속성을 갖을 수 있다. 도 6은 변환 데이터의 분포의 차이를 산출하는 과정을 설명하기 위한 도면이다. 도 6을 참조하면, 제1 모듈은 과거 데이터의 변환 데이터인 제1 변환 데이터(Z_t)와 현재 데이터의 변환 데이터인 제2 변환 데이터(Z_T)로부터 각각의 평균 벡터의 분포(Distribution of mean vectors)를 산출할 수 있다. 제1 모듈은 쿨백 라이블러 발산(Kullback-Leibler divergence) 함수를 이용하여 제1 변환 데이터의 분포와 제2 변환 데이터의 분포의 차이를 산출할 수 있다. 구체적으로, 변환 데이터들의 분포 차이는 아래 [수학식 2]에 의해 산출될 수 있다. 수학식 2"}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "( : 제2 차이, : 쿨백 라이블러 발산 함수, : 제1 변환 데이터의 평균에 대한 확률, : 비교 데이터에 대한 확률) 제1 모듈은 분포 차이가 0에 수렴하도록 계속적으로 투영 행렬(P)을 변경할 수 있다. 이에, 제1 모듈(10 0)이 포함된 인공지능 모델이 분포 차이가 0이 되도록 계속적으로 학습될 수 있다. 도 7은 일 실시예에 따른 제2 모듈을 설명하기 위한 도면이다. 도 7을 참조하면, 제2 모듈은 미리 정해진 수학식에 기초하여 변환 데이터의 도메인을 판별할 수 있다. 제 2 모듈은 변환 데이터의 도메인이 제1 시점으로 판별되면 제1 값을 출력하고, 변환 데이터의 도메인이 제2 시점으로 판별되면 제2 값을 출력할 수 있다. 예를 들어, 제2 모듈은 변환 데이터의 도메인이 과거로 판별 되면 0을 출력하고, 변환 데이터의 도메인이 현재 또는 미래로 판별되면 1을 출력할 수 있으나, 이에 한정되지 않는다. 제2 모듈은 아래 [수학식 3]에 기초하여 도메인을 판별할 수 있다. 수학식 3"}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "( : 도메인 판별 함수, : 제1 변환 데이터 집합, : 판별 파라미터) 이때, 판별 파라미터는 도메인 판별 함수와 도메인 라벨 세트 사이의 이진화 크로스 엔트로피(binary cross- entropy) 손실 함수를 최소화함으로써 최적화될 수 있다. 구체적으로, 이진화 크로스 엔트로피 손실 함수는 아 래 [수학식 4]에 의해 산출될 수 있다. 수학식 4"}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "( : 이진화 크로스 엔트로피 손실 함수, : 도메인 판별 함수, : 도메인 라벨 세트) 도 8은 일 실시예에 따른 제3 모듈을 설명하기 위한 도면이다. 도 8을 참조하면, 제3 모듈은 비교 데이터(현재 데이터)에 대한 클래스 및 회귀(regression)를 판단할 수 있다. 제1 모듈이 투영 행렬 및 그래프 행렬을 이용하여 비교 데이터(X_T)에 대한 변환 데이터(Z_T)를 생 성할 수 있다. 제3 모듈은 제1 모듈이 생성한 변환 데이터(Z_T)에 기초하여 비교 데이터의 클래스 및 회귀를 판단할 수 있다. 이때, 클래스는 불연속적인 파라미터와 관련되며, 회귀는 연속적인 파라미터와 관련된 것일 수 있다. 예를 들어, 비교 데이터가 환자의 의료 데이터와 관련된 경우, 클래스는 성별(남/여)일 수 있고, 회귀는 환자의 기대 수명(예, 80살)일 수 있다. 또한 예를 들어, 비교 데이터가 주식과 관련된 시계열적인 데이터인 경우, 클래스는 주식의 상승 또는 하락일 수 있고, 회귀는 주식의 예상 가격일 수 있다. 제3 모듈은 아래 [수학식 5]를 이용하여 비교 데이터의 클래스 및 회귀를 판단할 수 있다. 수학식 5"}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "( : 라벨 예측 함수, : 제2 변환 데이터, : 라벨 파라미터) 이때, 라벨 파라미터는 라벨 예측 함수와 정답 라벨 세트 사이의 크로스 엔트로피(cross-entropy) 손실 함수를 최소화함으로써 최적화될 수 있다. 구체적으로, 크로스 엔트로피 손실 함수는 아래 [수학식 6]에 의해 산출될 수 있다. 수학식 6 ( : 크로스 엔트로피 손실 함수, : 라벨 예측 함수, : 정답 라벨 세트) 도 9는 일 실시예에 따른 종단적 데이터에 대한 도메인 적응 방법의 순서도이다. 도 9를 참조하면, 일 실시예에 따른 종단적 데이터에 대한 도메인 적응 방법은 투영 행렬 및 그래프 행렬을 이 용하여 제1 변환 데이터를 생성하는 단계(S100), 제1 차이 및 제2 차이를 산출하는 단계(S200), 투영 행렬을 수 정하는 단계(S300) 및 변환 데이터의 도메인 및 라벨을 결정하는 단계(S400)를 포함할 수 있다. 도 9는 단계 S100 내지 S400이 순차적으로 수행되는 것을 도시하였으나, 이에 한정되지 않고 일부 단계가 병합되어 동시에 수행되거나, 일부 단계가 생략되거나 새로운 단계가 추가될 수도 있다. 투영 행렬 및 그래프 행렬을 이용하여 제1 변환 데이터를 생성하는 단계(S100)는 제1 모듈이 입력 데이터 에 투영 행렬 및 그래프 행렬을 적용하여 변환 데이터를 생성하는 단계일 수 있다. 예를 들어, 제1 모듈은 과거 데이터(X_t)에 기초하여 제1 변환 데이터를 생성할 수 있다. 또한 예를 들어, 제1 모듈은 현재 데이 터(X_T)에 기초하여 제2 변환 데이터를 생성할 수 있다. 제1 차이 및 제2 차이를 산출하는 단계(S200)는 제1 모듈이 제1 변환 데이터 및 비교 데이터(현재 데이 터)의 매니폴드 차이인 제1 차이와 분포 차이인 제2 차이를 산출하는 단계일 수 있다. 이때, 제1 모듈은 쿨백 라이블러 발산 함수를 이용하여 분포 차이인 제2 차이를 산출할 수 있다. 투영 행렬을 수정하는 단계(S300)는 단계 S200에서 산출한 제1 차이 및 제2 차이가 0에 수렴하도록 계속적으로 투영 행렬의 값을 변경하는 단계일 수 있다. 단계 S300에 의하여, 제1 모듈이 포함된 인공지능 모델이 학 습될 수 있다. 변환 데이터의 도메인 및 라벨을 결정하는 단계(S400)는 제2 모듈 및 제3 모듈에 의해 변환 데이터의 시점과 관련된 도메인과 라벨(클래스 및 회귀를 포함함)을 결정하는 단계일 수 있다. 단계 S100 내지 S400에 대한 내용은 위의 설명과 중복될 수 있어, 자세한 설명은 생략한다. 도 10 및 도 11은 종래와 본원 발명의 도메인 적응 장치의 성능을 비교한 결과이다. 도 10을 참조하면, 종래 기술(DANN)과 본원 발명(PA)의 AUC 성능을 비교하였을 때, 모든 면에서 본원 발명의 성 능이 종래 기술보다 뛰어난 것을 확인할 수 있다. 도 11을 참조하면, 종래 기술 대비 본원 발명의 성능이 적게는 1.79%, 많게는 8.34% 더 향상된 것을 확인할 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2023-0192832", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2023-0192832", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 도메인 적응 장치를 설명하기 위한 도면이다. 도 2는 일 실시예에 따른 도메인 적응 장치에 포함된 인공지능 모델의 구조를 설명하기 위한 도면이다. 도 3은 일 실시예에 따른 변환 데이터 생성 과정을 설명하기 위한 도면이다. 도 4는 변환 데이터의 매니폴드를 설명하기 위한 도면이다. 도 5는 변환 데이터의 분포를 설명하기 위한 도면이다. 도 6은 변환 데이터의 분포의 차이를 산출하는 과정을 설명하기 위한 도면이다. 도 7은 일 실시예에 따른 제2 모듈을 설명하기 위한 도면이다. 도 8은 일 실시예에 따른 제3 모듈을 설명하기 위한 도면이다. 도 9는 일 실시예에 따른 종단적 데이터에 대한 도메인 적응 방법의 순서도이다. 도 10 및 도 11은 종래와 본원 발명의 도메인 적응 장치의 성능을 비교한 결과이다."}
