{"patent_id": "10-2018-0164797", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0081527", "출원번호": "10-2018-0164797", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "이원우"}}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메모리; 및상기 메모리에 저장된 복수의 프레임 중 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부 영역이 중첩된 파노라마 이미지를획득하고,상기 파노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정하며,상기 파노라마 이미지 전체 또는 상기 기설정된 형상의 영역에서 객체를 식별하는 프로세서;를 포함하는 전자장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 픽셀 값 차이가 최소인 영역을 중첩하여 상기 파노라마 이미지를 획득하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는,상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 모션 값을 획득하고,상기 획득된 모션 값에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부영역을 중첩하여 상기 파노라마 이미지를 획득하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는,상기 인접 프레임 간 픽셀 값 차이 및 상기 인접 프레임 간 모션 값에 기초하여 상기 획득된 모션 값을 변환하며,상기 변환된 모션 값에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부영역을 중첩하여 상기 파노라마 이미지를 획득하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각에 대하여 회전, 위치 이동 또는 크기 변경 중 적어도 하나의 이미지 처리를 수행하고, 이미지 처리가 수행된 프레임의 일부 영역을 중첩하여 상기 파노라마 이미지를 획득하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2020-0081527-3-제5항에 있어서,디스플레이;를 더 포함하고,상기 프로세서는,상기 제1 프레임을 디스플레이하도록 상기 디스플레이를 제어하며,상기 파노라마 이미지에서 상기 객체가 식별되면, 상기 파노라마 이미지에서 상기 객체가 식별된 위치 정보 및상기 이미지 처리 정보에 기초하여 상기 제1 프레임에서 상기 객체가 디스플레이된 영역에 GUI(graphical userinterface), 문자, 영상, 비디오, 3D 모델 중 적어도 하나를 포함하는 객체를 디스플레이하도록 상기 디스플레이를 제어하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 적어도 하나의 제2 프레임은, 상기 제1 프레임 이전에 촬영된 프레임이며,상기 프로세서는,상기 파노라마 이미지 및 상기 제1 프레임 이후에 촬영된 제3 프레임의 픽셀 정보에 기초하여 상기 파노라마 이미지의 일부 영역 및 상기 제3 프레임의 일부 영역을 중첩하여 상기 파노라마 이미지를 업데이트하고, 상기 업데이트된 파노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정하며, 상기 업데이트된 파노라마 이미지 또는 상기 업데이트된 파노라마 이미지 내의 상기 기설정된 형상의 영역에서 객체를 재식별하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제3 프레임은, 상기 제1 프레임 바로 다음에 촬영된 프레임이며,상기 프로세서는,상기 제3 프레임의 크기에 대한 상기 제1 프레임 및 상기 제3 프레임의 중첩 영역의 비율이 기설정된 비율 미만이면 상기 업데이트된 파노라마 이미지 또는 상기 업데이트된 파노라마 이미지 내의 상기 기설정된 형상의 영역내에서 상기 객체를 재식별하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는,상기 파노라마 이미지에서 복수의 객체가 식별되면, 상기 파노라마 이미지에서 복수의 영역 각각의 중첩 프레임의 개수 또는 상기 복수의 영역 각각에 포함된 프레임의 촬영 시점 중 적어도 하나에 기초하여 복수의 영역 각각에 가중치를 부여하고, 상기 복수의 영역 각각의 가중치에 기초하여 상기 복수의 객체 중 적어도 하나를 식별하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,카메라;를 더 포함하고,상기 프로세서는,상기 카메라를 통해 연속 촬영을 수행하여 상기 복수의 프레임을 획득하는, 전자 장치."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치의 제어 방법에 있어서,공개특허 10-2020-0081527-4-복수의 프레임 중 제1 프레임 및 적어도 하나의 제2 프레임의 픽셀 정보에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부 영역이 중첩된 파노라마 이미지를 획득하는 단계;상기 파노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정하는 단계; 및상기 파노라마 이미지 전체 또는 상기 기설정된 형상의 영역에서 객체를 식별하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 획득하는 단계는,상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 픽셀 값 차이가 최소인 영역을 중첩하여 상기 파노라마 이미지를 획득하는, 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 획득하는 단계는,상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 모션 값을 획득하고,상기 획득된 모션 값에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부영역을 중첩하여 상기 파노라마 이미지를 획득하는, 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 획득하는 단계는,상기 인접 프레임 간 픽셀 값 차이 및 상기 인접 프레임 간 모션 값에 기초하여 상기 획득된 모션 값을 변환하며,상기 변환된 모션 값에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부영역을 중첩하여 상기 파노라마 이미지를 획득하는, 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 획득하는 단계는,상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각에 대하여 회전, 위치 이동 또는 크기 변경 중 적어도 하나의 이미지 처리를 수행하고, 이미지 처리가 수행된 프레임의 일부 영역을 중첩하여 상기 파노라마 이미지를 획득하는, 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제1 프레임을 디스플레이하는 단계; 및상기 파노라마 이미지에서 상기 객체가 식별되면, 상기 파노라마 이미지에서 상기 객체가 식별된 위치 정보 및상기 이미지 처리 정보에 기초하여 상기 제1 프레임에서 상기 객체가 디스플레이된 영역에 GUI(graphical userinterface), 문자, 영상, 비디오, 3D 모델 중 적어도 하나를 포함하는 객체를 디스플레이하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,공개특허 10-2020-0081527-5-상기 적어도 하나의 제2 프레임은, 상기 제1 프레임 이전에 촬영된 프레임이며,상기 파노라마 이미지 및 상기 제1 프레임 이후에 촬영된 제3 프레임의 픽셀 정보에 기초하여 상기 파노라마 이미지의 일부 영역 및 상기 제3 프레임의 일부 영역을 중첩하여 상기 파노라마 이미지를 업데이트하는 단계;상기 업데이트된 파노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정하는 단계; 및상기 업데이트된 파노라마 이미지 전체 또는 상기 업데이트된 파노라마 이미지 내의 상기 기설정된 형상의 영역에서 객체를 재식별하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제3 프레임은, 상기 제1 프레임 바로 다음에 촬영된 프레임이며,상기 객체를 재식별하는 단계는,상기 제3 프레임의 크기에 대한 상기 제1 프레임 및 상기 제3 프레임의 중첩 영역의 비율이 기설정된 비율 미만이면 상기 업데이트된 파노라마 이미지 또는 상기 업데이트된 파노라마 이미지 내의 상기 기설정된 형상의 영역내에서 상기 객체를 재식별하는, 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 객체를 식별하는 단계는,상기 파노라마 이미지에서 복수의 객체가 식별되면, 상기 파노라마 이미지에서 복수의 영역 각각의 중첩 프레임의 개수 또는 상기 복수의 영역 각각에 포함된 프레임의 촬영 시점 중 적어도 하나에 기초하여 복수의 영역 각각에 가중치를 부여하는 단계; 및상기 복수의 영역 각각의 가중치에 기초하여 상기 복수의 객체 중 적어도 하나를 식별하는 단계;를 포함하는,제어 방법."}
{"patent_id": "10-2018-0164797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 전자 장치에 구비된 카메라를 통해 연속 촬영을 수행하여 상기 복수의 프레임을 획득하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2018-0164797", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 본 전자 장치는 메모리 및 메모리에 저장된 복수의 프레임 중 제1 프레임 및 적어도 하나 의 제2 프레임 각각의 픽셀 정보에 기초하여 제1 프레임의 일부 영역 및 적어도 하나의 제2 프레임 각각의 일부 영역이 중첩된 파노라마 이미지를 획득하고, 파노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정 하며, 파노라마 이미지 전체 또는 기설정된 형상의 영역에서 객체를 식별하는 프로세서를 포함한다. 특히, 파노 라마 이미지의 생성 방법의 적어도 일부는 기계학습, 신경망 또는 딥러닝 알고리즘 중 적어도 하나에 따라 학습 된 인공지능 모델을 이용할 수 있다."}
{"patent_id": "10-2018-0164797", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어 방법에 대한 것으로, 더욱 상세하게는 객체를 식별하는 전자 장치 및 그 제어 방법에 대한 것이다. 또한, 본 개시는 기계 학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 인공 지능 (Artificial Intelligence, AI) 시스템 및 그 응용에 관한 것이다."}
{"patent_id": "10-2018-0164797", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래에는 인간 수준의 지능을 구현하는 인공 지능 시스템이 다양한 분야에서 이용되고 있다. 인공 지능 시스템 은 기존의 룰(rule) 기반 스마트 시스템과 달리 기계가 스스로 학습하고 판단하며 똑똑해지는 시스템이다. 인공 지능 시스템은 사용할수록 인식률이 향상되고 사용자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 룰 기반 스마트 시스템은 점차 딥러닝 기반 인공 지능 시스템으로 대체되고 있다. 인공 지능 기술은 기계학습(예로, 딥러닝) 및 기계학습을 활용한 요소 기술들로 구성된다. 기계학습은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘 기술이며, 요소기술은 딥러닝 등의 기계학 습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 기술로서, 언어적 이해, 시각적 이해,추론/예측, 지식 표현, 동작 제어 등의 기술 분야로 구성된다. 인공 지능 기술이 응용되는 다양한 분야는 다음과 같다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리 하는 기술로서, 자연어 처리, 기계 번역, 대화시스템, 질의 응답, 음성 인식/합성 등을 포함한다. 시각적 이해 는 사물을 인간의 시각처럼 인식하여 처리하는 기술로서, 객체 인식, 객체 추적, 영상 검색, 사람 인식, 장면 이해, 공간 이해, 영상 개선 등을 포함한다. 추론 예측은 정보를 판단하여 논리적으로 추론하고 예측하는 기술 로서, 지식/확률 기반 추론, 최적화 예측, 선호 기반 계획, 추천 등을 포함한다. 지식 표현은 인간의 경험정보 를 지식데이터로 자동화 처리하는 기술로서, 지식 구축(데이터 생성/분류), 지식 관리(데이터 활용) 등을 포함 한다. 동작 제어는 차량의 자율 주행, 로봇의 움직임을 제어하는 기술로서, 움직임 제어(항법, 충돌, 주행), 조 작 제어(행동 제어) 등을 포함한다. 최근 카메라가 구비된 글래스 장치와 같이 다양한 유형의 장치가 개발되고 있다. 다만, 글래스 장치의 카메라를 이용하여 촬영하는 경우, 머리 또는 신체 움직임에 따라 영상에 흔들림이 발생할 수 있다. 예를 들어, 도 1에 도시된 바와 같이, 글래스 장치는 카메라를 구비할 수 있으며, 사용자의 움직임에 따라 카메라에서 촬영되는 영 상에 흔들림이 발생할 수 있다. 영상 흔들림은 실시간 영상 분석이 필요한 AR 서비스에 장애를 초래할 수 있으며, 객체 식별 및 추적이 어려운 문제가 있다. 그에 따라, 영상 흔들림을 제거하기 위한 안정화 방법이 개발되고 있으나, 종래에는 영상 프레임 별로 파라미터 를 설정해줘야 하며, 영상 내 빠른 움직임이 있는 경우 과도한 크롭(crop)으로 영상 데이터를 소실할 수 있는 문제가 있었다."}
{"patent_id": "10-2018-0164797", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 필요성에 따른 것으로, 본 개시의 목적은 연속된 복수의 프레임에서 객체 식별 성능을 향상시 켜 모션이 안정된 객체를 포함하는 증강 현실(Augmented Reality) 기능을 제공하기 위한 전자 장치 및 그 제어 방법을 제공함에 있다."}
{"patent_id": "10-2018-0164797", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이상과 같은 목적을 달성하기 위한 본 개시의 일 실시 예에 따르면, 전자 장치는 메모리 및 상기 메모리에 저장 된 복수의 프레임 중 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부 영역이 중첩된 파노라마 이미지를 획득하고, 상기 파 노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정하며, 상기 파노라마 이미지 전체 또는 상기 기 설정된 형상의 영역에서 객체를 식별하는 프로세서를 포함한다. 또한, 상기 프로세서는 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 픽셀 값 차이가 최소인 영역을 중첩하여 상기 파노라마 이미지를 획득할 수 있다. 그리고, 상기 프로세서는 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인 접 프레임 간 모션 값을 획득하고, 상기 획득된 모션 값에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어 도 하나의 제2 프레임 각각의 일부 영역을 중첩하여 상기 파노라마 이미지를 획득할 수 있다. 또한, 상기 프로세서는 상기 인접 프레임 간 픽셀 값 차이 및 상기 인접 프레임 간 모션 값에 기초하여 상기 획 득된 모션 값을 변환하며, 상기 변환된 모션 값에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나 의 제2 프레임 각각의 일부 영역을 중첩하여 상기 파노라마 이미지를 획득할 수 있다. 그리고, 상기 프로세서는 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 상 기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각에 대하여 회전, 위치 이동 또는 크기 변경 중 적어도 하 나의 이미지 처리를 수행하고, 이미지 처리가 수행된 프레임의 일부 영역을 중첩하여 상기 파노라마 이미지를 획득할 수 있다. 또한, 디스플레이를 더 포함하고, 상기 프로세서는 상기 제1 프레임을 디스플레이하도록 상기 디스플레이를 제 어하며, 상기 파노라마 이미지에서 상기 객체가 식별되면, 상기 파노라마 이미지에서 상기 객체가 식별된 위치 정보 및 상기 이미지 처리 정보에 기초하여 상기 제1 프레임에서 상기 객체가 디스플레이된 영역에GUI(graphical user interface), 문자, 영상, 비디오, 3D 모델 중 적어도 하나를 포함하는 객체를 디스플레이 하도록 상기 디스플레이를 제어할 수 있다. 그리고, 상기 적어도 하나의 제2 프레임은 상기 제1 프레임 이전에 촬영된 프레임이며, 상기 프로세서는 상기 파노라마 이미지 및 상기 제1 프레임 이후에 촬영된 제3 프레임의 픽셀 정보에 기초하여 상기 파노라마 이미지 의 일부 영역 및 상기 제3 프레임의 일부 영역을 중첩하여 상기 파노라마 이미지를 업데이트하고, 상기 업데이 트된 파노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정하며, 상기 업데이트된 파노라마 이미지 또는 상기 업데이트된 파노라마 이미지 내의 상기 기설정된 형상의 영역에서 객체를 재식별할 수 있다. 또한, 상기 제3 프레임은 상기 제1 프레임 바로 다음에 촬영된 프레임이며, 상기 프로세서는 상기 제3 프레임의 크기에 대한 상기 제1 프레임 및 상기 제3 프레임의 중첩 영역의 비율이 기설정된 비율 미만이면 상기 업데이트 된 파노라마 이미지 또는 상기 업데이트된 파노라마 이미지 내의 상기 기설정된 형상의 영역 내에서 상기 객체 를 재식별할 수 있다. 그리고, 상기 프로세서는 상기 파노라마 이미지에서 복수의 객체가 식별되면, 상기 파노라마 이미지에서 복수의 영역 각각의 중첩 프레임의 개수 또는 상기 복수의 영역 각각에 포함된 프레임의 촬영 시점 중 적어도 하나에 기초하여 복수의 영역 각각에 가중치를 부여하고, 상기 복수의 영역 각각의 가중치에 기초하여 상기 복수의 객 체 중 적어도 하나를 식별할 수 있다. 또한, 카메라를 더 포함하고, 상기 프로세서는 상기 카메라를 통해 연속 촬영을 수행하여 상기 복수의 프레임을 획득할 수 있다. 한편, 본 개시의 일 실시 예에 따르면, 전자 장치의 제어 방법은 복수의 프레임 중 제1 프레임 및 적어도 하나 의 제2 프레임의 픽셀 정보에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부 영역이 중첩된 파노라마 이미지를 획득하는 단계, 상기 파노라마 이미지 내에서 최대 크기의 기설정된 형 상의 영역을 결정하는 단계 및 상기 파노라마 이미지 전체 또는 상기 기설정된 형상의 영역에서 객체를 식별하 는 단계를 포함한다. 또한, 상기 획득하는 단계는 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 픽셀 값 차이가 최소인 영역을 중첩하여 상기 파노라마 이미지를 획득할 수 있다. 그리고, 상기 획득하는 단계는 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하 여 인접 프레임 간 모션 값을 획득하고, 상기 획득된 모션 값에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부 영역을 중첩하여 상기 파노라마 이미지를 획득할 수 있다. 또한, 상기 획득하는 단계는 상기 인접 프레임 간 픽셀 값 차이 및 상기 인접 프레임 간 모션 값에 기초하여 상 기 획득된 모션 값을 변환하며, 상기 변환된 모션 값에 기초하여 상기 제1 프레임의 일부 영역 및 상기 적어도 하나의 제2 프레임 각각의 일부 영역을 중첩하여 상기 파노라마 이미지를 획득할 수 있다. 그리고, 상기 획득하는 단계는 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하 여 상기 제1 프레임 및 상기 적어도 하나의 제2 프레임 각각에 대하여 회전, 위치 이동 또는 크기 변경 중 적어 도 하나의 이미지 처리를 수행하고, 이미지 처리가 수행된 프레임의 일부 영역을 중첩하여 상기 파노라마 이미 지를 획득할 수 있다. 또한, 상기 제1 프레임을 디스플레이하는 단계 및 상기 파노라마 이미지에서 상기 객체가 식별되면, 상기 파노 라마 이미지에서 상기 객체가 식별된 위치 정보 및 상기 이미지 처리 정보에 기초하여 상기 제1 프레임에서 상 기 객체가 디스플레이된 영역에 GUI(graphical user interface), 문자, 영상, 비디오, 3D 모델 중 적어도 하나 를 포함하는 객체를 디스플레이하는 단계를 더 포함할 수 있다. 그리고, 상기 적어도 하나의 제2 프레임은 상기 제1 프레임 이전에 촬영된 프레임이며, 상기 파노라마 이미지 및 상기 제1 프레임 이후에 촬영된 제3 프레임의 픽셀 정보에 기초하여 상기 파노라마 이미지의 일부 영역 및 상기 제3 프레임의 일부 영역을 중첩하여 상기 파노라마 이미지를 업데이트하는 단계, 상기 업데이트된 파노라 마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정하는 단계 및 상기 업데이트된 파노라마 이미지 또 는 상기 업데이트된 파노라마 이미지 내의 상기 기설정된 형상의 영역에서 객체를 재식별하는 단계를 더 포함할 수 있다. 또한, 상기 제3 프레임은 상기 제1 프레임 바로 다음에 촬영된 프레임이며, 상기 객체를 재식별하는 단계는 상 기 제3 프레임의 크기에 대한 상기 제1 프레임 및 상기 제3 프레임의 중첩 영역의 비율이 기설정된 비율 미만이면 상기 업데이트된 파노라마 이미지 또는 상기 업데이트된 파노라마 이미지 내의 상기 기설정된 형상의 영역 내에서 상기 객체를 재식별할 수 있다. 그리고, 상기 객체를 식별하는 단계는 상기 파노라마 이미지에서 복수의 객체가 식별되면, 상기 파노라마 이미 지에서 복수의 영역 각각의 중첩 프레임의 개수 또는 상기 복수의 영역 각각에 포함된 프레임의 촬영 시점 중 적어도 하나에 기초하여 복수의 영역 각각에 가중치를 부여하는 단계 및 상기 복수의 영역 각각의 가중치에 기 초하여 상기 복수의 객체 중 적어도 하나를 식별하는 단계를 포함할 수 있다. 또한, 상기 전자 장치에 구비된 카메라를 통해 연속 촬영을 수행하여 상기 복수의 프레임을 획득하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2018-0164797", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 본 개시의 다양한 실시 예에 따르면, 전자 장치는 연속된 복수의 프레임으로부터 파노라마 이미지 를 생성하고, 프레임들간 모션 차이가 최소화되는 영역으로부터 객체를 식별함에 따라 빠른 카메라의 움직임 하 에서도 객체 식별의 정확도를 향상시킴으로써 사용자에게 모션이 안정된 객체를 포함하는 증강 현실(Augmented Reality) 기능을 제공할 수 있다."}
{"patent_id": "10-2018-0164797", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 본 명세서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 2a는 전자 장치의 구성의 일 예를 나타내는 블럭도이다. 도 2a에 따르면, 전자 장치는 메모리 및 프로세서를 포함한다. 본 명세서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, AR(Augmented Reality) 글래스 장치일 수 있다. AR 글래스 장치는 증강 현실 기능을 제공하는 장치일 수 있다. 증강 현실이란 사용자로 하여금 실제적 환 경에 가상 오브젝트(object)를 오버랩하여 보여주는 기술이다. 예를 들어, 글래스를 통하여 바라보게 되는 실제 환경 위에 가상의 오브젝트를 오버랩하여 디스플레이 함으로써, 사용자는 가상의 오브젝트를 현실 세계의 일부 로 인식하게 된다. 증강 현실을 이용하면, 사용자가 바라보는 실제 영상에 가상 오브젝트를 오버랩하여 디스플 레이함으로써, 실제 환경과 가상 화면의 구분을 모호하게 하여, 실감나는 영상을 제공할 수 있게 된다. 다만, 이에 한정되는 것은 아니며, 전자 장치는 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장치는 액세 서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted- device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식 형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 그 밖에, 전자 장치는 복수의 프레임에서 객체를 식별할 수 있는 장치라면 어떠한 장치라도 무방하다. 메모리는 복수의 프레임을 저장할 수 있다. 여기서, 복수의 프레임은 전자 장치에 구비된 카메라에 의해 촬영된 복수의 프레임일 수 있다. 특히, 전자 장치가 AR 글래스 장치인 경우, 복수의 프레임을 촬영 하는 동안 사용자의 움직임으로 인해 흔들림이 발생한 상태일 수 있다. 복수의 프레임은 하나의 장면(scene)을 촬영한 영상일 수 있다. 예를 들어, 복수의 프레임은 교차로를 촬영한 영상일 수 있다. 다만, 촬영 시 사용자의 움직임으로 인해 복수의 프레임에 포함된 교차로는 프레임 내에서 서 로 위치가 다를 수 있다. 가령, 제1 프레임에서 교차로의 중심이 프레임의 정가운데라고 하더라도 제2 프레임에 서 교차로의 중심은 프레임의 정가운데가 아닐 수도 있다. 다만, 이에 한정되는 것은 아니며, 복수의 프레임은 복수의 장면을 촬영한 영상일 수 있다. 이 경우, 프로세서 는 복수의 장면 각각에 기초하여 복수의 프레임을 복수의 그룹으로 구분할 수 있다. 복수의 그룹 각각은 하나의 장면을 촬영한 영상일 수 있다. 다만, 이에 한정되는 것은 아니며, 전자 장치는 외부 장치에 의해 촬영된 복수의 프레임을 수신하고, 메모 리는 수신된 복수의 프레임을 저장할 수도 있다. 메모리는 하드디스크, 비휘발성 메모리 및 휘발성 메모리 등으로 구현될 수 있으며, 데이터를 저장할 수 있는 구성이라면 어떠한 구성이라도 가능하다. 프로세서는 전자 장치의 동작을 전반적으로 제어한다. 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프 로세서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙 처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤 러(controller), 어플리케이션 프로세서(application processor(AP)), GPU(graphics-processing unit) 또는 커 뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 프 로세서는 메모리에 저장된 컴퓨터 실행가능 명령어(computer executable instructions)를 실행함으 로써 다양한 기능을 수행할 수 있다. 프로세서는 메모리에 저장된 복수의 프레임 중 제1 프레임 및 적어도 하나의 제2 프레임의 픽셀 정보 에 기초하여 제1 프레임의 일부 영역 및 적어도 하나의 제2 프레임 각각의 일부 영역이 중첩된 파노라마 이미지 를 획득할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 복수의 프레임 중 제1 프레임의 픽셀 정보 및 제2 프레임의 픽셀 정보에 기초하여 제1 프레임의 일부 영역 및 제2 프레임의 일부 영역이 중첩된 파노라마 이미지를 획득할 수 있다. 좀더 구체적으로, 제1 프레임 및 제2 프레임 각각은 1920 × 1080의 해상도의 이미지이며, 제1 프레임 의 (21, 1)의 픽셀부터 (1920, 1080)의 픽셀까지의 제1 사각형 영역과 제2 프레임의 (1, 1)의 픽셀부터 (1900, 1080)의 픽셀까지의 제2 사각형 영역의 픽셀 값이 모두 일치하면, 프로세서는 제1 프레임의 제1 사각형 영 역과 제2 프레임의 제2 사각형 영역이 중첩되도록 파노라마 이미지를 획득할 수 있다. 이는 실제 촬영 과정에서 제1 프레임의 촬영 시점과 제2 프레임의 촬영 시점 간의 차이가 매우 작더라도 사용자 움직임의 영향으로 촬영 각도가 변경될 수 있기 때문이다. 이상에서는 설명의 편의를 위하여 두 개의 프레임을 중첩하는 것으로 설명하였으나, 프로세서는 세 개 이 상의 이미지를 중첩하여 파노라마 이미지를 획득할 수도 있다. 프로세서는 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 픽셀 값 차이가 최소인 영역을 중첩하여 파노라마 이미지를 획득할 수도 있다. 실제 촬영 과정에서 제1 프레임의 촬 영 시점과 제2 프레임의 촬영 시점 간의 차이가 매우 작더라도 광량의 변화 등으로 픽셀 값이 달라질 수 있기 때문이다. 가령, 상술한 예에서 제1 프레임의 제1 사각형 영역과 제2 프레임의 제2 사각형 영역은 픽셀 값이 모 두 일치하지 않을 수 있다. 따라서, 프로세서는 제1 프레임을 제2 프레임 상에서 픽셀 단위로 이동시키면 서 중첩된 영역 간의 픽셀 값의 차이가 최소인 영역을 획득하고, 픽셀 값의 차이가 최소가 되도록 제1 프레임과제2 프레임을 중첩시켜 파노라마 이미지를 획득할 수도 있다. 프로세서는 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 모션 값을 획득하고, 획득된 모션 값에 기초하여 제1 프레임의 일부 영역 및 적어도 하나의 제2 프레임 각각의 일부 영역을 중첩하여 파노라마 이미지를 획득할 수도 있다. 상술한 예에서, 프로세서는 제1 프레임의 픽셀 정 보 및 제2 프레임의 픽셀 정보에 기초하여 제1 프레임 및 제2 프레임 간 모션 값이 (20, 0)임을 획득할 수 있다. 그리고, 프로세서는 모션 값에 기초하여 제1 프레임 및 제2 프레임이 중첩된 파노라마 이미지를 획 득할 수 있다. 다만, 이에 한정되는 것은 아니며, 모션 값은 촬영 당시 획득된 값일 수도 있다. 예를 들어, 전자 장치는 카메라를 더 포함하고, 프로세서는 카메라를 통해 연속 촬영을 수행하여 복수의 프레임을 획득할 수 있다. 이때, 전자 장치는 센서를 더 포함하고, 프로세서는 복수의 프레임 각각의 촬영 시점을 기준으로 센 서를 통해 전자 장치의 모션을 감지할 수 있다. 프로세서는 감지된 전자 장치의 모션에 기초하 여 인접한 프레임 간 모션 값을 획득할 수도 있다. 한편, 프로세서는 인접 프레임 간 픽셀 값 차이 및 인접 프레임 간 모션 값에 기초하여 획득된 모션 값을 변환하며, 변환된 모션 값에 기초하여 제1 프레임의 일부 영역 및 적어도 하나의 제2 프레임 각각의 일부 영역 을 중첩하여 파노라마 이미지를 획득할 수 있다. 예를 들어, 프로세서는 연속적인 복수의 프레임에서 인접 프레임 간 모션 값들을 안정화하여 모션 값을 변환할 수 있다. 모션 값을 변환함에 따라 인접한 모션 값들의 편 차를 줄일 수 있다. 이때, 프로세서는 인접 프레임 간 픽셀 값에 기초하여 모션 값들을 안정화할 수 있다. 특히, 프로세서 는 모션 안정화 모델에 기초하여 모션 값 각각을 안정화할 수 있다. 여기서, 모션 안정화 모델은 인접 프 레임 간 픽셀 값 차이에 기초하여 모션 값을 안정화하도록 인공지능 알고리즘을 통해 학습하여 획득된 모델일 수 있다. 이상과 같이, 프로세서는 각 모션 값마다 안정화 동작을 수행하여, 인접한 모션 값들의 편차를 줄일 수 있다. 인접한 모션 값들의 편차를 줄임에 따라 복수의 프레임의 재생 시에 느껴지던 흔들림을 최소화할 수 있다. 변환된 모션 값을 이용하여 파노라마 이미지를 획득하는 방법은 변환 전의 모션 값을 이용하여 파노라마 이미지 를 획득하는 방법과 동일하므로 구체적인 설명은 생략한다. 프로세서는 파노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정할 수 있다. 예를 들어, 프 로세서는 파노라마 이미지 내에서 복수의 프레임과 가로, 세로 비율이 동일한 최대 크기의 사각형 영역을 식별할 수 있다. 다만, 이에 한정되는 것은 아니며, 기설정된 형상의 영역은 다각형 영역, 원형 영역 등과 같이 다양한 형태의 영역일 수 있으며, 특별한 형상에 한정되는 것은 아니다. 하기에서는 설명의 편의를 위하여 대부 분의 기설정된 형상의 영역을 사각형 영역으로서 설명한다. 프로세서는 파노라마 이미지 전체 또는 기설정된 형상의 영역에서 객체를 식별할 수 있다. 예를 들어, 프 로세서는 파노라마 이미지에서 객체를 식별하고, 식별된 영역 중 기설정된 형상의 영역 내의 영역만을 최 종 식별 영역으로 결정할 수도 있다. 한편, 프로세서는 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 제1 프레임 및 적어도 하나의 제2 프레임 각각에 대하여 회전, 위치 이동 또는 크기 변경 중 적어도 하나의 이미지 처리를 수 행하고, 이미지 처리가 수행된 프레임의 일부 영역을 중첩하여 파노라마 이미지를 획득할 수 있다. 여기서, 전자 장치는 디스플레이를 더 포함하고, 프로세서는 제1 프레임을 디스플레이하도록 디스플 레이를 제어하며, 파노라마 이미지에서 객체가 식별되면, 파노라마 이미지에서 객체가 식별된 위치 정보 및 이 미지 처리 정보에 기초하여 제1 프레임에서 객체가 디스플레이된 영역에 GUI(graphical user interface), 문자, 영상, 비디오, 3D 모델 중 적어도 하나를 포함하는 객체를 디스플레이하도록 디스플레이를 제어할 수 있다. 즉, 프로세서는 객체의 식별은 파노라마 이미지 내에서 수행하고, 현재 디스플레이 중인 프레임에 식별된 영역 에 객체를 표시할 수 있다. 여기서, 객체는 가상의 2D/3D 컨텐츠일 수 있다. 한편, 적어도 하나의 제2 프레임은 제1 프레임 이전에 촬영된 프레임이며, 프로세서는 파노라마 이미지 및 제1 프레임 이후에 촬영된 제3 프레임의 픽셀 정보에 기초하여 파노라마 이미지의 일부 영역 및 제3 프레임의 일부 영역을 중첩하여 파노라마 이미지를 업데이트하고, 업데이트된 파노라마 이미지 내에서 최대 크기의 기설 정된 형상의 영역을 결정하며, 상기 업데이트된 파노라마 이미지 또는 업데이트된 파노라마 이미지 내의 기설정된 형상의 영역에서 객체를 재식별할 수 있다. 즉, 프로세서는 복수의 프레임 각각을 기준으로 파노라마 이미지를 생성하기 때문에 프로세서는 복수 의 프레임과 동일한 개수의 파노라마 이미지를 생성할 수 있다. 그리고, 프로세서는 현재 프레임에 대응되 는 파노라마 이미지를 생성하기 위해서, 현재 프레임 바로 이전의 프레임에 대응되는 파노라마 이미지에 현재 프레임을 중첩할 수 있다. 즉, 프로세서는 현재 프레임이 변경되면, 파노라마 이미지를 업데이트하는 방식 으로 파노라마 이미지를 획득할 수 있다. 업데이트 시에, 프로세서는 파노라마 이미지에서 가장 오래된 프 레임을 제거할 수 있다. 여기서, 제3 프레임은 제1 프레임 바로 다음에 촬영된 프레임이며, 프로세서는 제3 프레임의 크기에 대한 제1 프레임 및 제3 프레임의 중첩 영역의 비율이 기설정된 비율 미만이면 제3 프레임은 제1 프레임 및 제2 프레 임에서는 보이지 않았던 새로운 장면에 대한 영상을 획득한 것이므로 새로 나타날 수 있는 객체를 인식하기 위 해 업데이트된 파노라마 이미지 또는 업데이트된 파노라마 이미지 내의 기설정된 형상의 영역 내에서 객체를 재 식별할 수 있다. 또는, 프로세서는 제3 프레임의 크기에 대한 제1 프레임 및 제3 프레임의 중첩 영역의 비 율이 기설정된 비율 이상이면 제3 프레임은 제1 프레임과 유사한 장면에 대한 영상을 획득한 것이고, 장면에 변 화가 적으므로 업데이트된 파노라마 이미지 내에서 객체를 재식별하지 않을 수도 있다. 이 경우, 프로세서(12 0)는 업데이트되기 전의 파노라마 이미지에서 식별된 객체 정보를 그대로 이용할 수 있다. 즉, 카메라로 촬영한 영상의 모션을 기반으로 객체 식별 동작의 횟수를 최소화함에 따라, 입력 영상이 제공될 때마다 객체 식별을 수 행하는 기존의 방법에 비해 전자 장치의 전력 소모가 감소될 수 있다. 한편, 프로세서는 파노라마 이미지에서 복수의 객체가 식별되면, 객체 식별 결과로 얻는 식별의 신뢰도 값 및 파노라마 이미지에서 복수의 영역 각각의 중첩 프레임의 개수 또는 복수의 영역 각각에 포함된 프레임의 촬 영 시점 중 적어도 하나에 기초하여 복수의 영역 각각에 가중치를 부여하고, 복수의 영역 각각의 가중치에 기초 하여 복수의 객체 중 적어도 하나를 식별할 수 있다. 예를 들어, 프로세서는 파노라마 이미지에서 복수의 객체가 식별되면, 복수의 객체 각각의 위치에 중첩 프 레임의 개수를 식별하고, 중첩 프레임의 개수가 가장 많은 영역에서 식별된 객체를 최종 객체로 식별할 수 있다. 또는, 프로세서는 파노라마 이미지에서 복수의 객체가 식별되면, 복수의 객체 각각의 위치에 중첩된 프레임의 촬영 시점을 식별하고, 촬영 시점이 가장 나중인 프레임에 높은 가중치를 부여하는 방식으로 복수의 객체 각각에 대한 가중치를 부여하며, 가중치가 가장 높은 객체를 최종 객체로 식별할 수도 있다. 이러한 객체 식별 방법은 오래된 프레임으로부터 얻은 객체 식별 결과를 필터링하여 객체 식별 시 발생하는 오 류를 줄일 수 있다. 예를 들어, 제1 프레임에서 지나가던 자동차가 영상 내에 존재하고, 제1 프레임 이후 획득 된 제3 프레임에서는 자동차가 존재하지 않았다면, 제1 프레임과 제3 프레임 및 이후 획득된 프레임들을 포함하 여 획득한 파노라마 이미지로부터 얻은 객체 식별의 결과들 중에서, 현재 시점에서 존재하지 않는 자동차는 최 종 객체 식별 결과에서 제외할 수 있다. 도 2b는 전자 장치의 세부 구성의 일 예를 나타내는 블럭도이다. 전자 장치는 메모리 및 프로세 서를 포함할 수 있다. 또한, 도 2b에 따르면, 전자 장치는 통신 인터페이스, 디스플레이, 사용자 인터페이스, 입출력 인터페이스, 카메라, 스피커, 마이크를 더 포함할 수도 있다. 도 2b에 도시된 구성요소들 중 도 2a에 도시된 구성요소와 중복되는 부분에 대해서는 자세한 설명을 생략 하도록 한다. 메모리는 프로세서에 포함된 롬(ROM)(예를 들어, EEPROM(electrically erasable programmable read- only memory)), 램(RAM) 등의 내부 메모리로 구현되거나, 프로세서와 별도의 메모리로 구현될 수도 있다. 이 경우, 메모리는 데이터 저장 용도에 따라 전자 장치에 임베디드된 메모리 형태로 구현되거나, 전 자 장치에 탈부착이 가능한 메모리 형태로 구현될 수도 있다. 예를 들어, 전자 장치의 구동을 위한 데이터의 경우 전자 장치에 임베디드된 메모리에 저장되고, 전자 장치의 확장 기능을 위한 데이터의 경우 전자 장치에 탈부착이 가능한 메모리에 저장될 수 있다. 한편, 전자 장치에 임베디드된 메모리 의 경우 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이 브(solid state drive(SSD)) 중 적어도 하나로 구현되고, 전자 장치에 탈부착이 가능한 메모리의 경우 메 모리 카드(예를 들어, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 등), USB 포트에 연결 가능한 외부 메 모리(예를 들어, USB 메모리) 등과 같은 형태로 구현될 수 있다. 메모리는 전자 장치를 구동시키기 위한 O/S(Operating System) 소프트웨어 모듈, 모션 안정화 모듈, 파노라마 이미지 생성 모듈 및 객체 식별 모듈 등과 같이 다양한 데이터를 저장한다. 프로세서는 메모리에 저장된 각종 프로그램을 이용하여 전자 장치의 동작을 전반적으로 제어한 다. 구체적으로, 프로세서는 RAM, ROM, 메인 CPU, 제1 내지 n 인터페이스(124-1 ~ 124-n), 버 스를 포함한다. RAM, ROM, 메인 CPU, 제1 내지 n 인터페이스(124-1 ~ 124-n) 등은 버스를 통해 서로 연결 될 수 있다. ROM에는 시스템 부팅을 위한 명령어 세트 등이 저장된다. 턴온 명령이 입력되어 전원이 공급되면, 메인 CPU는 ROM에 저장된 명령어에 따라 메모리에 저장된 O/S를 RAM에 복사하고, O/S를 실행시 켜 시스템을 부팅시킨다. 부팅이 완료되면, 메인 CPU는 메모리에 저장된 각종 어플리케이션 프로그램 을 RAM에 복사하고, RAM에 복사된 어플리케이션 프로그램을 실행시켜 각종 동작을 수행한다. 메인 CPU는 메모리에 액세스하여, 메모리에 저장된 O/S를 이용하여 부팅을 수행한다. 그리고, 메모리에 저장된 각종 프로그램, 컨텐츠 데이터 등을 이용하여 다양한 동작을 수행한다. 제1 내지 n 인터페이스(124-1 내지 124-n)는 상술한 각종 구성 요소들과 연결된다. 인터페이스들 중 하나는 네 트워크를 통해 외부 장치와 연결되는 네트워크 인터페이스가 될 수도 있다. 한편, 프로세서는 그래픽 처리 기능(비디오 처리 기능)을 수행할 수 있다. 예를 들어, 프로세서는 연 산부(미도시) 및 렌더링부(미도시)를 이용하여 아이콘, 이미지, 텍스트 등과 같은 다양한 객체를 포함하는 화면 을 생성할 수 있다. 여기서, 연산부(미도시)는 수신된 제어 명령에 기초하여 화면의 레이아웃에 따라 각 객체들 이 표시될 좌표값, 형태, 크기, 컬러 등과 같은 속성값을 연산할 수 있다. 그리고, 렌더링부(미도시)는 연산부 (미도시)에서 연산한 속성값에 기초하여 객체를 포함하는 다양한 레이아웃의 화면을 생성할 수 있다. 또한, 프 로세서는 비디오 데이터에 대한 디코딩, 스케일링, 노이즈 필터링, 프레임 레이트 변환, 해상도 변환 등과 같은 다양한 이미지 처리를 수행할 수 있다. 한편, 프로세서는 오디오 데이터에 대한 처리를 수행할 수 있다. 구체적으로, 프로세서는 오디오 데 이터에 대한 디코딩이나 증폭, 노이즈 필터링 등과 같은 다양한 처리가 수행될 수 있다. 통신 인터페이스는 다양한 유형의 통신방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성이다. 통신 인터페이스는 와이파이 모듈, 블루투스 모듈, 적외선 통신 모듈 및 무선 통신 모듈 등을 포함한다. 여기서, 각 통신 모듈은 적어도 하나의 하드웨어 칩 형태로 구현될 수 있다. 프로세서는 통신 인터페이스를 이용하여 각종 외부 장치와 통신을 수행할 수 있다. 여기서, 외부 장 치는 TV와 같인 디스플레이 장치, set-top box와 같은 영상 처리 장치, 외부 서버, 리모컨과 같은 제어 장치, 블루투스 스피커와 같은 음향 출력 장치, 조명 장치, 스마트 청소기, 스마트 냉장고와 같은 가전 기기, IOT 홈 매니저 등과 같은 서버 등을 포함할 수 있다. 와이파이 모듈, 블루투스 모듈은 각각 WiFi 방식, 블루투스 방식으로 통신을 수행한다. 와이파이 모 듈이나 블루투스 모듈을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송수 신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 적외선 통신 모듈은 시 광선과 밀리미터파 사이에 있는 적외선을 이용하여 근거리에 무선으로 데이터를 전 송하는 적외선 통신(IrDA, infrared Data Association)기술에 따라 통신을 수행한다. 무선 통신 모듈은 상술한 통신 방식 이외에 지그비(zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE-A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 통신을 수행하는 적어도 하나의 통신 칩을 포함할 수 있다. 그 밖에 통신 인터페이스는 LAN(Local Area Network) 모듈, 이더넷 모듈, 또는 페어 케이블, 동축 케이블 또는 광섬유 케이블 등을 이용하여 통신을 수행하는 유선 통신 모듈 중 적어도 하나를 포함할 수 있다. 일 예에 따라 통신 인터페이스는 리모컨과 같은 외부 장치 및 외부 서버와 통신하기 위해 동일한 통신 모 듈(예를 들어, Wi-Fi 모듈)을 이용할 수 있다. 다른 예에 따라 통신 인터페이스는 리모컨과 같은 외부 장치 및 외부 서버와 통신하기 위해 상이한 통신 모듈(예를 들어, Wi-Fi 모듈)을 이용할 수 있다. 예를 들어, 통신 인터페이스는 외부 서버와 통신하기 위 해 이더넷 모듈 또는 WiFi 모듈 중 적어도 하나를 이용할 수 있고, 리모컨과 같은 외부 장치와 통신하기 위해 BT 모듈을 이용할 수도 있다. 다만 이는 일 실시 예에 불과하며 통신 인터페이스는 복수의 외부 장치 또는 외부 서버와 통신하는 경우 다양한 통신 모듈 중 적어도 하나의 통신 모듈을 이용할 수 있다. 한편, 전자 장치는 구현 예에 따라 튜너 및 복조부를 추가적으로 포함할 수 있다. 튜너(미도시)는 안테나를 통해 수신되는 RF(Radio Frequency) 방송 신호 중 사용자에 의해 선택된 채널 또는 기 저장된 모든 채널을 튜닝하여 RF 방송 신호를 수신할 수 있다. 복조부(미도시)는 튜너에서 변환된 디지털 IF 신호(DIF)를 수신하여 복조하고, 채널 복호화 등을 수행할 수도 있다. 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel) 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이 내에는 a- si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 한편, 디스플레이는 터치 센서와 결합된 터치 스크린, 플 렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등으로 구현될 수 있다. 또한, 본 발명의 일 실시 예에 따른, 디스플레이는 영상을 출력하는 디스플레이 패널뿐만 아니라, 디스플 레이 패널을 하우징하는 베젤을 포함할 수 있다. 특히, 본 발명의 일 실시 예에 따른, 베젤은 사용자 인터렉션 을 감지하기 위한 터치 센서(미도시)를 포함할 수 있다. 사용자 인터페이스는 버튼, 터치 패드, 마우스 및 키보드와 같은 장치로 구현되거나, 상술한 디스플레이 기능 및 조작 입력 기능도 함께 수행 가능한 터치 스크린으로도 구현될 수 있다. 여기서, 버튼은 전자 장치 의 본체 외관의 전면부나 측면부, 배면부 등의 임의의 영역에 형성된 기계적 버튼, 터치 패드, 휠 등과 같 은 다양한 유형의 버튼이 될 수 있다. 입출력 인터페이스는 HDMI(High Definition Multimedia Interface), MHL (Mobile High-Definition Link), USB (Universal Serial Bus), DP(Display Port), 썬더볼트(Thunderbolt), VGA(Video Graphics Array) 포트, RGB 포트, D-SUB(D-subminiature), DVI(Digital Visual Interface) 중 어느 하나의 인터페이스일 수 있 다. 입출력 인터페이스는 오디오 및 비디오 신호 중 적어도 하나를 입출력 할 수 있다. 구현 예에 따라, 입출력 인터페이스는 오디오 신호만을 입출력하는 포트와 비디오 신호만을 입출력하는 포 트를 별개의 포트로 포함하거나, 오디오 신호 및 비디오 신호를 모두 입출력하는 하나의 포트로 구현될 수 있다. 전자 장치는 디스플레이를 포함하지 않는 장치로 구현되어, 별도의 디스플레이 장치로 영상 신호를 전송할 수 있다. 카메라는 사용자의 제어에 따라 정지 영상 또는 동영상을 촬상하기 위한 구성이다. 카메라는 특정 시 점에서의 정지 영상을 촬영할 수 있으나, 연속적으로 정지 영상을 촬영할 수도 있다. 스피커는 입출력 인터페이스에서 처리된 각종 오디오 데이터뿐만 아니라 각종 알림 음이나 음성 메시 지 등을 출력하는 구성요소일 수 있다. 마이크는 사용자 음성이나 기타 소리를 입력받아 오디오 데이터로 변환하기 위한 구성이다. 마이크는 활성화 상태에서 사용자의 음성을 수신할 수 있다. 예를 들어, 마이크는 전자 장치의 상측이나 전면 방향, 측면 방향 등에 일체화된 일체형으로 형성될 수 있다. 마이크는 아날로그 형태의 사 용자 음성을 수집하는 마이크, 수집된 사용자 음성을 증폭하는 앰프 회로, 증폭된 사용자 음성을 샘플링하여 디 지털 신호로 변환하는 A/D 변환회로, 변환된 디지털 신호로부터 노이즈 성분을 제거하는 필터 회로 등과 같은다양한 구성을 포함할 수 있다. 한편, 전자 장치는 마이크를 포함하는 외부 장치로부터 사용자 음성 신호를 수신할 수 있다. 이 경우, 수 신된 사용자 음성 신호는 디지털 음성 신호일 수있으나, 구현 예에 따라 아날로그 음성 신호일 수 있다. 일 예 로, 전자 장치는 Bluetooth 또는 Wi-Fi 등의 무선 통신 방법을 통해 사용자 음성 신호를 수신할 수 있다. 여기서, 외부 장치는 원격 제어 장치 또는 스마트폰으로 구현될 수 있다. 전자 장치는 외부 장치로부터 수신된 음성 신호의 음성 인식을 위해, 외부 서버로 해당 음성 신호를 전송 할 수 있다. 이 경우, 외부 장치 및 외부 서버와의 통신을 위한 통신 모듈은 하나로 구현되거나, 별개로 구현될 수 있다. 예 를 들어, 외부 장치와는 Bluetooth 모듈을 이용하여 통신하고, 외부 서버와는 이더넷 모뎀 또는 Wi-Fi모듈을 이 용하여 통신할 수 있다. 한편, 전자 장치는 음성을 수신하여 문장으로 변환할 수 있다. 예를 들어, 전자 장치는 마이크 를 통해 수신된 디지털 음성 신호에 직접 STT(Speech To Text) 기능을 적용하여 텍스트 정보로 변환할 수 있다. 또는, 전자 장치는 음성 인식 서버로 수신된 디지털 음성 신호를 전송할 수 있다. 이 경우, 음성 인식 서 버는 STT(Speech To Text)를 이용하여 디지털 음성 신호를 텍스트 정보로 변환할 수 있다. 이 경우, 음성 인식 서버는 텍스트 정보에 대응되는 검색을 수행하기 위하여 다른 서버 또는 전자 장치로 텍스트 정보를 전송할 수 있으며, 경우에 따라서는 직접 검색을 수행하는 것도 가능하다. 도 2c는 전자 장치에 저장된 복수의 모듈의 일 예를 나타내는 블럭도이다. 메모리는 O/S 소프트웨어 모듈, 모션 안정화 모듈, 파노라마 이미지 생성 모듈, 객체 식별 모듈 및 정합 모듈 를 저장할 수 있다. O/S 소프트웨어 모듈은 전자 장치의 전반적인 동작을 수행하기 위한 모듈이다. 예를 들어, O/S 소프 트웨어 모듈은 전자 장치를 턴 온, 턴 오프하는 경우에 이용될 수 있으며, 대기 상태인 경우에 메모 리 관리와 같은 동작 정보를 포함할 수 있다. 모션 안정화 모듈은 복수의 프레임 간 모션 값을 안정화하기 위한 모듈이다. 또한, 모션 안정화 모듈(11 2)은 복수의 프레임 간 모션 값을 안정화할 뿐만 아니라 이미지 처리를 통해 동영상 재생 시 흔들림을 제거하기 위한 모듈이다. 파노라마 이미지 생성 모듈은 모션 안정화 모듈을 통해 모션 값이 안정화된 복수의 프레임을 중첩하 여 파노라마 이미지를 생성하는 모듈이다. 또한, 파노라마 이미지 생성 모듈은 현재 프레임이 변경되면, 기존의 파노라마 이미지를 업데이트할 수 있다. 가령, 파노라마 이미지 생성 모듈은 가장 오래된 프레임을 파노라마 이미지로부터 제거하고, 새로운 프레임을 파노라마 이지에 중첩할 수 있다. 객체 식별 모듈은 파노라마 이미지 생성 모듈을 통해 생성된 파노라마 이미지로부터 객체를 식별하는 모듈이다. 객체 식별 모듈은 파노라마 이미지 전체에서 객체를 식별할 수도 있고, 파노라마 이미지 내에서 기설정된 형상의 영역을 결정한 후 기설정된 형상의 영역에서 객체를 식별할 수도 있다. 또는, 객체 식별 모듈 은 기설정된 형상의 영역에서 객체를 식별한 후, 유의미한 객체가 식별되지 않으면 파노라마 이미지 전체 에서 객체를 식별할 수도 있다. 여기서, 유의미한 객체는 객체 식별 모듈에 의해 식별되어 객체를 특정할 수 있는 객체를 의미한다. 또는, 유의미한 객체는 사용자가 설정한 객체일 수 있다. 정합 모듈은 객체를 나타내는 GUI의 디스플레이 위치를 결정하기 위한 모듈이다. 카메라에 의해 촬영 된 프레임과 사용자가 AR 글래스를 통해 바라보는 영상은 서로 다를 수 있다. 가령, 카메라의 화각이 넓은 경우, 카메라에 의해 촬영된 프레임은 사용자가 AR 글래스를 통해 바라보는 영상보다 더 넓은 영역을 포함 할 수 있다. 정합 모듈은 객체를 나타내는 GUI가 사용자가 바라보는 영상의 객체를 가리키도록 AR 글래스 의 디스플레이에서 디스플레이될 위치를 산출할 수 있다. 예를 들어, 정합 모듈은 카메라의 화 각에 따라 촬영된 프레임과 사용자가 AR 글래스를 통해 바라보는 영상 간의 기설정된 비율을 이용하여 객체를 나타내는 GUI의 디스플레이 위치를 획득할 수 있다. 이상과 같은 방법을 통해 프로세서는 연속된 복수의 프레임으로부터 파노라마 이미지를 생성하고, 생성된 파노라마 이미지로부터 객체를 식별할 수 있다. 이하에서는 도면을 통해 전자 장치의 동작을 좀더 구체적으로 설명한다. 도 3은 본 개시의 일 실시 예에 따른 모션 안정화를 설명하기 위한 도면이다. 도 3에서 Ct는 모션 값들을 나타 내고, Ct*은 변환된 모션 값들을 나타낸다. 복수의 모션 값들은 복수의 프레임에서 인접한 프레임 간 모션 값들의 편차가 낮아지도록 변환될 수 있다. 예를 들어, 도 3의 좌측에 Ct로 도시된 바와 같이, 모션 값들을 나타내는 함수가 로우-패스 필터링되면 도 3의 좌측 에 Ct*과 같이 모션 값들이 변환될 수 있다. 모션 값이 변환된 복수의 프레임을 재생하는 경우는 모션 값을 변 환하기 전의 복수의 프레임을 재생하는 경우보다 흔들림이 작아질 수 있다. 다만, 도 3의 좌측은 각 프레임의 특성을 반영하지 않은 종래 기술에 따른 모션 값을 변환한 결과를 나타낸다. 가령, 모션 값들은 중첩된 영역의 정합 정도를 나타내는 제1 함수 및 모션 값에 대한 제2 함수에 기초하여 변환 될 수 있다. 또한, 종래에는 제1 함수 및 제2 함수가 모든 모션 값에 동일하게 적용되었다. 이에 대해, 프로세서는 도 3의 우측에 도시된 바와 같이, 모션 안정화 모델에 기초하여 모션 값 각각을 안 정화할 수 있다. 여기서, 모션 안정화 모델은 인접 프레임 간 픽셀 값 차이에 기초하여 모션 값을 안정화하도록 인공지능 알고리즘을 통해 학습하여 획득된 모델일 수 있다. 즉, 모션 안정화 모델을 이용하는 경우, 각 프레임 의 특성을 반영하여 제1 함수 및 제2 함수가 결정될 수 있다. 즉, 모션 값들 각각에 대해 서로 다른 함수가 적 용될 수 있다. 여기서, 서로 다른 함수는 함수 내의 파라미터가 서로 다른 것을 의미한다. 이 경우, 영상의 변화가 심한 경우에 종래보다 개선된 안정화 성능을 나타낸다. 가령, 복수의 프레임 중 흔들림 이 심한 구간과 흔들림이 없는 구간이 있다고 할 때, 종래기술에 의하면 이러한 점이 반영되지 않고, 하나의 함 수에 기초하여 안정화를 수행하게 된다. 그에 따라, 흔들림이 심한 구간은 흔들림이 작아질 수 있으나, 흔들림 이 없는 구간은 흔들림이 생길 수도 있다. 이에 대해, 모션 안정화 모델을 이용하는 경우, 모션 값들 각각에 대 해 생성된 함수에 기초하여 안정화를 수행하게 된다. 그에 따라, 흔들림이 심한 구간은 흔들림이 작아질 수 있 고, 흔들림이 없는 구간은 흔들림이 없는 상태를 유지할 수 있게 된다. 도 4a 및 도 4b는 본 개시의 일 실시 예에 따른 파노라마 이미지의 생성 방법을 설명하기 위한 도면들이다. 프로세서는 복수의 프레임 중 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 제1 프레임의 일부 영역 및 적어도 하나의 제2 프레임 각각의 일부 영역이 중첩된 파노라마 이미지를 획득할 수 있 다. 예를 들어, 프로세서는 도 4a에 도시된 바와 같이, 제1 프레임 및 N개의 제2 프레임을 이용하여 파노 라마 이미지를 획득할 수 있다. 즉, 프로세서는 N+1개의 프레임을 중첩하여 파노라마 이미지를 획득할 수 있다. 여기서, 제1 프레임은 현재 프레임이고, 제2 프레임은 제1 프레임 이전의 프레임일 수 있다. 제1 프레임 및 N개의 제2 프레임은 연속된 프레임일 수 있다. 프로세서는 변환된 모션 값(Ct*) 및 모션 값(Ct)에 기초하여 전달함수(△Ht)를 획득할 수 있으며, 전달함 수에 기초하여 제1 프레임 및 N개의 제2 프레임을 중첩할 수 있다. 프로세서는 파노라마 이미지 내에서 최대 크기의 사각형 영역을 결정할 수 있다. 종래에는 복수의 프 레임 전체에서 중첩된 사각형 영역을 이용하였기 때문에 해상도가 낮아졌으나, 본원에 의하면 파노라마 이 미지를 생성하고, 파노라마 이미지에서 최대 크기의 사각형 영역을 이용하기 때문에 해상도가 종래기술보 다 높아질 수도 있다. 또한, 사각형 영역은 프레임의 해상도보다도 높아질 수도 있다. 프로세서는 도 4b에 도시된 바와 같이, 제1 프레임을 사각형 영역으로 변환할 수 있다. 도 5a 및 도 5b는 본 개시의 일 실시 예에 따른 기준 프레임 별 파노라마 이미지의 생성 방법을 설명하기 위한 도면들이다. 도 5a 및 도 5b에서는 설명의 편의를 위해서 제1 프레임 및 2개의 제2 프레임을 이용하여 파노라마 이미지를 획득하는 것으로 설명한다. 프로세서는 도 5a에 도시된 바와 같이, 제1 프레임(t-1 프레임) 및 2개의 제2 프레임(t-2, t-3 프레임)을 이용하여 제1 파노라마 이미지를 획득할 수 있다. 여기서, t-1, t-2, t-3은 프레임 간의 선후를 설명하기 위한 것으로 시간적인 의미를 포함하는 것은 아니다. 즉, 도 5a는 제1 프레임(t-1 프레임)을 변환하기 위해 제1 파노 라마 이미지를 생성하는 도면이다. 프로세서는 제1 프레임의 픽셀 정보 및 2개의 제2 프레임의 픽셀 정보에 기초하여 제1 프레임 및 2개의 제 2 프레임이 중첩된 제1 파노라마 이미지를 획득할 수 있다. 그리고, 프로세서는 제1 프레임(t-1 프레임)을 제1 파노라마 이미지 내에서 최대 크기의 사각형 영역으로 대체할 수 있다. 한편, 프로세서는 도 5b에 도시된 바와 같이, 제1 프레임(t 프레임) 및 2개의 제2 프레임(t-1, t-2 프레임)을 이용하여 제2 파노라마 이미지를 획득할 수 있다. 이때, 프로세서는 세 개의 프레임을 분석하여 중첩할 수도 있으나, 제1 파노라마 이미지를 이용할 수도 있다. 즉, 프로세서는 제1 파노라마 이미지에서 t-3 프레임 중 중첩되지 않은 부분을 제거한 후, t 프레임을 중 첩하여 제2 파노라마 이미지를 획득할 수도 있다. 이러한 방법을 통해 실시간으로 파노라마 이미지를 생성할 수 있다. 프로세서는 제1 프레임(t 프레임)을 제2 파노라마 이미지 내에서 최대 크기의 사각형 영역으로 대체할 수 있다. 프로세서는 복수의 프레임 전체에 대하여 동일한 작업을 반복하여 흔들림을 최소화할 수 있다. 도 6은 본 개시의 일 실시 예에 따른 객체 식별 및 객체 식별 결과를 디스플레이하는 방법을 설명하기 위한 도 면이다. 도 6에서 stage 1 및 5는 전자 장치의 디스플레이를 통해 디스플레이되는 영상을 나타낸다. 예를 들 어, 전자 장치가 AR 글래스 장치인 경우, 프로세서는 카메라를 제어하여 stage 1 및 5와 같은 프레임을 촬영하고, 촬영된 프레임을 디스플레이하도록 디스플레이를 제어할 수 있다. 프로세서는 후 술할 stage 2 내지 4와 같은 동작을 수행하는 중에도 stage 1 및 5와 같은 프레임을 디스플레이하도록 디스플레 이를 제어할 수 있다. 프로세서는 stage 1의 프레임을 이미지 처리하고, 이미지 처리된 프레임을 이전 파노라마 이미지에 추가로 중첩하여 stage 2와 같은 파노라마 이미지를 생성할 수 있다. 예를 들어, 프로세서는 stage 1의 프레임을 시계 방향으로 30도 회전하여 이전 파노라마 이미지에 추가로 중첩할 수 있다. 프로세서는 stage 3과 같이 파노라마 이미지에서 객체를 식별할 수 있다. 그리고, 프로세서는 파노라 마 이미지에서 객체가 식별된 위치 정보를 stage 1의 프레임에 대한 이미지 처리 정보에 기초하여 변환할 수 있 다. 예를 들어, 프로세서는 파노라마 이미지에서 객체가 식별된 위치 정보를 stage 4의 프레임과 같이 시 계 반대 방향으로 30도 회전할 수 있다. 이때, 프로세서는 파노라마 이미지에서 객체가 식별된 위치 정보 만을 이미지 처리 정보에 기초하여 변환할 수도 있으나, 파노라마 이미지에서 객체가 식별된 위치 정보를 이미 지 처리된 stage 1의 프레임과 함께 이미지 처리 정보에 기초하여 변환할 수도 있다. 프로세서는 stage 5의 프레임과 같이 stage 1의 프레임에서 객체가 디스플레이된 영역에 GUI(graphical user interface, 610, 620)를 디스플레이하도록 디스플레이를 제어할 수 있다. 이상과 같이 파노라마 이미지를 이용함에 따라 객체 인식 성능이 향상될 수 있다. 특히, 사용자의 움직임이 있 더라도 이전 프레임과의 정합을 통해 객체 인식 성능이 향상될 수 있다. 도 7a 및 도 7b는 본 개시의 일 실시 예에 따른 객체의 재식별 동작을 설명하기 위한 도면들이다. 프로세서는 파노라마 이미지 및 제1 프레임 이후에 촬영된 제3 프레임의 픽셀 정보에 기초하여 파노라마 이미지의 일부 영역 및 제3 프레임의 일부 영역을 중첩하여 파노라마 이미지를 업데이트하고, 업데이트된 파노 라마 이미지 내에서 최대 크기의 사각형 영역을 결정하며, 결정된 사각형 영역에서 객체를 재식별할 수 있다. 여기서, 제3 프레임은 제1 프레임 바로 다음에 촬영된 프레임이다. 이때, 프로세서는 도 7a에 도시된 바와 같이, 제3 프레임의 크기에 대한 제1 프레임 및 제3 프레임 의 중첩 영역의 비율이 기설정된 비율 미만이면 업데이트된 파노라마 이미지 내에서 객체를 재식별할 수 있다. 다만, 프로세서는 도 7b에 도시된 바와 같이, 제3 프레임의 크기에 대한 제1 프레임 및 제3 프레임 의 중첩 영역의 비율이 기설정된 비율 이상이면 재식별 동작을 수행하지 않을 수 있다. 즉, 프로세서(12 0)는 흔들림이 적다고 판단된 경우 또는 이전 프레임들과 현재 프레임 사이의 변화가 적다고 판단된 경우, 객체 의 재식별 동작을 수행하지 않을 수 있다. 이러한 동작을 통해 프로세서의 처리를 최소화할 수 있으며, 실시간 객체 식별이 가능할 수 있다. 도 8은 본 개시의 일 실시 예에 따른 최종 객체의 식별 방법을 설명하기 위한 도면이다. 먼저, 도 8은 3개의 프레임(810-1, 810-2, 810-3)이 중첩된 파노라마 이미지 및 파노라마 이미지 내에서 최대 크기의 사각형 영역을 나타내는 도면이다. 3개의 프레임의 촬영 시점은 810-1, 810-2, 810-3의 순으로 가정한다. 즉, 810-3 프레임이 가장 마지막에 파노라마 이미지에 중첩된 것으로 가정한다. 프로세서는 파노라마 이미지에서 복수의 객체가 식별되면, 파노라마 이미지에서 복수의 영역 각각의 중첩 프레임의 개수 또는 복수의 영역 각각에 포함된 프레임의 촬영 시점 중 적어도 하나에 기초하여 복수의 영역 각 각에 가중치를 부여하고, 복수의 영역 각각의 가중치에 기초하여 복수의 객체 중 적어도 하나를 식별할 수 있다. 예를 들어, 제1 객체 및 제2 객체는 제3 객체 및 제4 객체보다 중첩된 프레임이 많으므로 가중치가 높을 수 있다. 그리고, 제4 객체는 프레임의 촬영 시점을 기준으로 제3 객체보다 가중치가 높을 수 있다. 제1 객체 및 제2 객체는 가중치가 동일할 수 있다. 다만, 프로세서는 객체의 크 기를 더 고려하여 가중치를 부여할 수도 있다. 이 경우, 제1 객체는 제2 객체보다 가중치가 높을 수 있다. 이러한 방법을 통해 프로세서는 복수의 객체 중 최종 객체를 식별할 수 있다. 다만, 이에 한정되는 것은 아니며, 프로세서는 파노라마 이미지에서 복수의 객체를 식별할 수도 있다. 도 9는 본 개시의 일 실시 예에 따른 타 전자 장치의 구성을 나타내는 블록도이다. 여기서, 타 전자 장치 는 인공지능 알고리즘을 통해 모션 값을 안정화하는 장치일 수 있다. 도 9를 참조하면, 타 전자 장치는 학습부 및 응답부 중 적어도 하나를 포함할 수 있다. 학습부는 학습 데이터를 이용하여 모션 값을 안정화하기 위한 인공지능 모델을 생성 또는 학습시킬 수 있 다. 학습부는 수집된 학습 데이터를 이용하여 판단 기준을 갖는 판단 모델을 생성할 수 있다. 응답부는 소정의 데이터를 학습된 인공지능 모델의 입력 데이터로 사용하여, 복수의 모션 값들을 안정화할 수 있다. 본 개시의 일 실시 예로, 학습부 및 응답부는 타 전자 장치에 포함될 수 있으나, 이는 일 실시 예에 불과할 뿐, 전자 장치 내부에 탑재될 수 있다. 구체적으로, 학습부의 적어도 일부 및 응답부 의 적어도 일부는, 소프트웨어 모듈로 구현되거나 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치 에 탑재될 수 있다. 예를 들어, 학습부 및 응답부 중 적어도 하나는 인공 지능(artificial intelligence, AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또 는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각종 전자 장치에 탑재될 수도 있다. 이때, 인공 지능을 위한 전용 하드웨어 칩은 확률 연산에 특화된 전용 프로세서로서, 기존의 범용 프로세서보다 병렬처리 성능이 높아 기계 학습과 같은 인공 지능 분야의 연산 작업을 빠르게 처리할 수 있 다. 학습부 및 응답부가 소프트웨어 모듈(또는, 인스트럭션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non- transitory computer readable media)에 저장될 수 있다. 이 경우, 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 이 경우, 학습부 및 응답부는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 학습부 및 응답부 중 하나는 전자 장치에 포함되고, 나머지 하나는 타 전자 장치에 포함될 수 있다. 또한, 학습부 및 응답부는 유선 또는 무선으로 통하여, 학습부가 구축한 모델 정보를 응답부로 제공할 수도 있고, 학습부로 입력된 데이터가 추가 학습 데이터로서 학습부로 제공될 수도 있다. 도 10은 본 개시의 일 실시 예에 따른 학습부를 나타내는 블록도이다. 도 10을 참조하면, 일부 실시 예에 따른 학습부는 학습 데이터 획득부(910-1) 및 모델 학습부(910-4)를 포 함할 수 있다. 또한, 학습부는 학습 데이터 전처리부(910-2), 학습 데이터 선택부(910-3) 및 모델 평가부 (910-5) 중 적어도 하나를 선택적으로 더 포함할 수 있다. 학습 데이터 획득부(910-1)는 모션 값 안정화를 위한 인공지능 모델에 필요한 학습 데이터를 획득할 수 있다. 본 개시의 실시 예로, 학습 데이터 획득부(910-1)는 복수의 모션 값 및 변환된 복수의 모션 값을 학습 데이터로 서 획득할 수 있다. 학습 데이터는 학습부 또는 학습부의 제조사가 수집 또는 테스트한 데이터가 될 수도 있다.모델 학습부(910-4)는 학습 데이터를 이용하여, 인공지능 모델이 모션 값들을 안정화하는 기준을 갖도록 학습시 킬 수 있다. 예로, 모델 학습부(910-4)는 학습 데이터 중 적어도 일부를 지도 학습(supervised learning)을 통 하여, 인공지능 모델을 학습시킬 수 있다. 또는, 모델 학습부(910-4)는, 예를 들어, 별다른 지도 없이 학습 데 이터를 이용하여 스스로 학습함으로써, 모션 값을 안정화하기 위한 기준을 발견하는 비지도 학습(unsupervised learning)을 통하여, 인공지능 모델을 학습시킬 수 있다. 또한, 모델 학습부(910-4)는, 예를 들어, 학습에 따른 응답 제공의 결과가 올바른 지에 대한 피드백을 이용하는 강화 학습(reinforcement learning)을 통하여, 인공지 능 모델을 학습시킬 수 있다. 또한, 모델 학습부(910-4)는, 예를 들어, 오류 역전파법(error back- propagation) 또는 경사 하강법(gradient descent)을 포함하는 학습 알고리즘 등을 이용하여 인공지능 모델을 학습시킬 수 있다 또한, 모델 학습부(910-4)는 입력 데이터를 이용하여 모션 값 안정화를 엔티위하여 어떤 학습 데이터를 이용해 야 하는지에 대한 선별 기준을 학습할 수도 있다. 모델 학습부(910-4)는 미리 구축된 인공지능 모델이 복수 개가 존재하는 경우, 입력된 학습 데이터와 기본 학습 데이터의 관련성이 큰 인공지능 모델을 학습할 인공지능 모델로 결정할 수 있다. 이 경우, 기본 학습 데이터는 데이터의 타입별로 기 분류되어 있을 수 있으며, 인공지능 모델은 데이터의 타입별로 미리 구축되어 있을 수 있 다. 인공지능 모델이 학습되면, 모델 학습부(910-4)는 학습된 인공지능 모델을 저장할 수 있다. 이 경우, 모델 학습 부(910-4)는 학습된 인공지능 모델을 타 전자 장치의 메모리에 저장할 수 있다. 또는, 모델 학습부(910- 4)는 학습된 인공지능 모델을 타 전자 장치와 유선 또는 무선 네트워크로 연결되는 서버 또는 전자 장치의 메모리에 저장할 수도 있다. 학습부는 인공지능 모델의 응답 결과를 향상시키거나, 인공지능 모델의 생성에 필요한 자원 또는 시간을 절약하기 위하여, 학습 데이터 전처리부(910-2) 및 학습 데이터 선택부(910-3)를 더 포함할 수도 있다. 학습 데이터 전처리부(910-2)는 모션 값을 안정화하는 학습에 획득된 데이터가 이용될 수 있도록, 획득된 데이 터를 전처리할 수 있다. 즉, 학습 데이터 전처리부(910-2)는 획득된 데이터를 기 설정된 포맷으로 가공할 수 있 다. 예를 들어, 학습 데이터 전처리부(910-2)는 복수의 모션 값을 복수의 구간으로 구분할 수 있다. 학습 데이터 선택부(910-3)는 학습 데이터 획득부(910-1)에서 획득된 데이터 또는 학습 데이터 전처리부(910- 2)에서 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 선택된 학습 데이터는 모델 학습부 (910-4)에 제공될 수 있다. 학습 데이터 선택부(910-3)는 기 설정된 선별 기준에 따라, 획득되거나 전처리된 데 이터 중에서 학습에 필요한 학습 데이터를 선택할 수 있다. 또한, 학습 데이터 선택부(910-3)는 모델 학습부 (910-4)에 의한 학습에 의해 기 설정된 선별 기준에 따라 학습 데이터를 선택할 수도 있다. 학습부는 인공지능 모델의 응답 결과를 향상시키기 위하여, 모델 평가부(910-5)를 더 포함할 수도 있다. 모델 평가부(910-5)는 인공지능 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 응답 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부(910-4)로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이 터는 인공지능 모델을 평가하기 위한 기 정의된 데이터일 수 있다. 한편, 학습된 인공지능 모델이 복수 개가 존재하는 경우, 모델 평가부(910-5)는 각각의 학습된 인공지능 모델에 대하여 소정 기준을 만족하는지를 평가하고, 소정 기준을 만족하는 모델을 최종 인공지능 모델로서 결정할 수 있다. 이 경우, 소정 기준을 만족하는 모델이 복수 개인 경우, 모델 평가부(910-5)는 평가 점수가 높은 순으로 미리 설정된 어느 하나 또는 소정 개수의 모델을 최종 인공지능 모델로서 결정할 수 있다. 도 11은 본 개시의 일 실시 예에 따른 응답부를 나타내는 블록도이다. 도 11을 참조하면, 일부 실시 예에 따른 응답부는 입력 데이터 획득부(920-1) 및 응답 결과 제공부(920- 4)를 포함할 수 있다. 또한, 응답부는 입력 데이터 전처리부(920-2), 입력 데이터 선택부(920-3) 및 모델 갱신부(920-5) 중 적어 도 하나를 선택적으로 더 포함할 수 있다. 입력 데이터 획득부(920-1)는 모션 값 안정화를 위해 필요한 데이터를 획득할 수 있다. 응답 결과 제공부(920- 4)는 입력 데이터 획득부(920-1)에서 획득된 입력 데이터를 입력 값으로 학습된 인공지능 모델에 적용하여 모션 값을 안정화할 수 있다. 응답 결과 제공부(920-4)는 후술할 입력 데이터 전처리부(920-2) 또는 입력 데이터 선택부(920-3)에 의해 선택된 데이터를 입력 값으로 인공지능 모델에 적용하여 응답 결과를 획득할 수 있다. 응답 결과는 인공지능 모델에 의해 결정될 수 있다. 일 실시 예로, 응답 결과 제공부(920-4)는 입력 데이터 획득부(920-1)에서 획득한 모션 값을 안정화하는 인공지 능 모델을 적용하여 대화로부터 모션 값을 안정화할 수 있다. 응답부는 인공지능 모델의 응답 결과를 향상시키거나, 응답 결과의 제공을 위한 자원 또는 시간을 절약하 기 위하여, 입력 데이터 전처리부(920-2) 및 입력 데이터 선택부(920-3)를 더 포함할 수도 있다. 입력 데이터 전처리부(920-2)는 모션 값을 안정화하기 위해 획득된 데이터가 이용될 수 있도록, 획득된 데이터 를 전처리할 수 있다. 즉, 입력 데이터 전처리부(920-2)는 응답 결과 제공부(920-4)가 획득된 데이터를 기 정의 된 포맷으로 가공할 수 있다. 입력 데이터 선택부(920-3)는 입력 데이터 획득부(920-1)에서 획득된 데이터 또는 입력 데이터 전처리부(920- 2)에서 전처리된 데이터 중에서 응답 제공에 필요한 데이터를 선택할 수 있다. 선택된 데이터는 응답 결과 제공 부(920-4)에게 제공될 수 있다. 입력 데이터 선택부(920-3)는 응답 제공을 위한 기 설정된 선별 기준에 따라, 획득되거나 전처리된 데이터 중에서 일부 또는 전부를 선택할 수 있다. 또한, 입력 데이터 선택부(920-3)는 모 델 학습부(910-4)에 의한 학습에 의해 기 설정된 선별 기준에 따라 데이터를 선택할 수도 있다. 모델 갱신부(920-5)는 응답 결과 제공부(920-4)에 의해 제공되는 응답 결과에 대한 평가에 기초하여, 인공지능 모델이 갱신되도록 제어할 수 있다. 예를 들어, 모델 갱신부(920-5)는 응답 결과 제공부(920-4)에 의해 제공되 는 응답 결과를 모델 학습부(910-4)에게 제공함으로써, 모델 학습부(910-4)가 인공지능 모델을 추가 학습 또는 갱신하도록 요청할 수 있다. 도 12는 본 개시의 일 실시 예에 따른 전자 장치 및 외부의 서버(S)가 서로 연동함으로써 데이터를 학습하 고 판단하는 예시를 나타내는 도면이다. 도 12를 참조하면, 외부의 서버(S)는 대화로부터 모션 값을 안정화하기 위한 기준을 학습할 수 있으며, 전자 장 치는 서버(S)에 의한 학습 결과에 기초하여 모션 값을 안정화할 수 있다. 이 경우, 서버(S)의 모델 학습부(910-4)는 도 10에 도시된 학습부의 기능을 수행할 수 있다. 즉, 서버(S) 의 모델 학습부(910-4)는 모션 값을 안정화하기 위하여 어떤 필터를 이용할지, 이상의 정보를 이용하여 모션 값 을 어떻게 안정화할지에 관한 기준을 학습할 수 있다. 또한, 전자 장치의 응답 결과 제공부(920-4)는 입력 데이터 선택부(920-3)에 의해 선택된 데이터를 서버 (S)에 의해 생성된 인공지능 모델에 적용하여 모션 값을 안정화할 수 있다. 또는, 전자 장치의 응답 결과 제공부(920-4)는 서버(S)에 의해 생성된 인공지능 모델을 서버(S)로부터 수신하고, 수신된 인공지능 모델을 이 용하여 모션 값을 안정화할 수 있다. 도 13은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 먼저, 복수의 프레임 중 제1 프레임 및 적어도 하나의 제2 프레임의 픽셀 정보에 기초하여 제1 프레임의 일부 영역 및 적어도 하나의 제2 프레임 각각의 일부 영역이 중첩된 파노라마 이미지를 획득한다(S1310). 그리고, 파 노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정한다(S1320). 그리고, 파노라마 이미지 전체 또 는 기설정된 형상의 영역에서 객체를 식별한다(S1330). 여기서, 획득하는 단계(S1310)는 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 픽셀 값 차이가 최소인 영역을 중첩하여 파노라마 이미지를 획득할 수 있다. 그리고, 획득하는 단계(S1310)는 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 인접 프레임 간 모션 값을 획득하고, 획득된 모션 값에 기초하여 제1 프레임의 일부 영역 및 적어도 하나의 제2 프레 임 각각의 일부 영역을 중첩하여 파노라마 이미지를 획득할 수 있다. 여기서, 획득하는 단계(S1310)는 인접 프레임 간 픽셀 값 차이 및 인접 프레임 간 모션 값에 기초하여 획득된 모션 값을 변환하며, 변환된 모션 값에 기초하여 제1 프레임의 일부 영역 및 적어도 하나의 제2 프레임 각각의 일부 영역을 중첩하여 파노라마 이미지를 획득할 수 있다. 한편, 획득하는 단계(S1310)는 제1 프레임 및 적어도 하나의 제2 프레임 각각의 픽셀 정보에 기초하여 제1 프레 임 및 적어도 하나의 제2 프레임 각각에 대하여 회전, 위치 이동 또는 크기 변경 중 적어도 하나의 이미지 처리를 수행하고, 이미지 처리가 수행된 프레임의 일부 영역을 중첩하여 파노라마 이미지를 획득할 수 있다. 여기서, 제1 프레임을 디스플레이하는 단계 및 파노라마 이미지에서 객체가 식별되면, 파노라마 이미지에서 객 체가 식별된 위치 정보 및 이미지 처리 정보에 기초하여 제1 프레임에서 객체가 디스플레이된 영역에 GUI(graphical user interface), 문자, 영상, 비디오, 3D 모델 중 적어도 하나를 포함하는 객체를 디스플레이 하는 단계를 더 포함할 수 있다. 한편, 적어도 하나의 제2 프레임은 제1 프레임 이전에 촬영된 프레임이며, 파노라마 이미지 및 제1 프레임 이후 에 촬영된 제3 프레임의 픽셀 정보에 기초하여 파노라마 이미지의 일부 영역 및 제3 프레임의 일부 영역을 중첩 하여 파노라마 이미지를 업데이트하는 단계, 업데이트된 파노라마 이미지 내에서 최대 크기의 기설정된 형상의 영역을 결정하는 단계 및 업데이트된 파노라마 이미지 또는 업데이트된 파노라마 이미지 내의 기설정된 형상의 영역에서 객체를 재식별하는 단계를 더 포함할 수 있다. 여기서, 제3 프레임은 제1 프레임 바로 다음에 촬영된 프레임이며, 객체를 재식별하는 단계는 제3 프레임의 크 기에 대한 제1 프레임 및 제3 프레임의 중첩 영역의 비율이 기설정된 비율 미만이면 업데이트된 파노라마 이미 지 또는 업데이트된 파노라마 이미지 내의 기설정된 형상의 영역 내에서 객체를 재식별할 수 있다. 그리고, 객체를 식별하는 단계는 파노라마 이미지에서 복수의 객체가 식별되면, 파노라마 이미지에서 복수의 영 역 각각의 중첩 프레임의 개수 또는 복수의 영역 각각에 포함된 프레임의 촬영 시점 중 적어도 하나에 기초하여 복수의 영역 각각에 가중치를 부여하는 단계 및 복수의 영역 각각의 가중치에 기초하여 복수의 객체 중 적어도 하나를 식별하는 단계를 포함할 수 있다. 한편, 전자 장치에 구비된 카메라를 통해 연속 촬영을 수행하여 복수의 프레임을 획득하는 단계를 더 포함할 수 있다. 이상과 같은 본 개시의 다양한 실시 예에 따르면, 전자 장치는 연속된 복수의 프레임으로부터 파노라마 이미지 를 생성한 후, 객체를 식별함에 따라 객체 식별의 정확도를 향상시킬 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 전자 장치에 설치 가능한 어플리케이션 형태 로 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 전자 장치에 대한 소프트웨어 업그레이드, 또 는 하드웨어 업그레이드 만으로도 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들은 전자 장치에 구비된 임베디드 서버, 또는 전자 장치 및 디스플레이 장치 중 적어도 하나의 외부 서버를 통해 수행되는 것도 가능하다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기 기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시 예들에 따른 전자 장치(예: 전자 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임 시적으로 저장됨을 구분하지 않는다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는유사하게 수행할 수 있다. 다양한 실시 예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동 작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2018-0164797", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2018-0164797", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 이해를 돕기 위한 도면이다. 도 2a는 전자 장치의 구성의 일 예를 나타내는 블럭도이다. 도 2b는 전자 장치의 세부 구성의 일 예를 나타내는 블럭도이다. 도 2c는 전자 장치에 저장된 복수의 모듈의 일 예를 나타내는 블럭도이다. 도 3은 본 개시의 일 실시 예에 따른 모션 안정화를 설명하기 위한 도면이다. 도 4a 및 도 4b는 본 개시의 일 실시 예에 따른 파노라마 이미지의 생성 방법을 설명하기 위한 도면들이다. 도 5a 및 도 5b는 본 개시의 일 실시 예에 따른 기준 프레임 별 파노라마 이미지의 생성 방법을 설명하기 위한 도면들이다. 도 6은 본 개시의 일 실시 예에 따른 객체 식별 및 객체 식별 결과를 디스플레이하는 방법을 설명하기 위한 도 면이다. 도 7a 및 도 7b는 본 개시의 일 실시 예에 따른 객체의 재식별 동작을 설명하기 위한 도면들이다. 도 8은 본 개시의 일 실시 예에 따른 최종 객체의 식별 방법을 설명하기 위한 도면이다. 도 9는 본 개시의 일 실시 예에 따른 타 전자 장치의 구성을 나타내는 블록도이다. 도 10은 본 개시의 일 실시 예에 따른 학습부를 나타내는 블록도이다. 도 11은 본 개시의 일 실시 예에 따른 응답부를 나타내는 블록도이다. 도 12는 본 개시의 일 실시 예에 따른 전자 장치 및 외부의 서버가 서로 연동함으로써 데이터를 학습하고 판단 하는 예시를 나타내는 도면이다. 도 13은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
