{"patent_id": "10-2022-0036328", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0139859", "출원번호": "10-2022-0036328", "발명의 명칭": "어지럼 관련 질환 예측 방법 및 시스템", "출원인": "주식회사 스파이더코어", "발명자": "추교윤"}}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "보행 피처 생성부가 복수의 환자들 각각에 대해 상기 환자가 보행하는 동안 상기 환자에 부착된 IMU(InertialMeasurement Unit) 센서를 통해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관련되는 복수의 보행 피처들을 생성하는 단계;제1 전처리부가 상기 복수의 환자들 각각에 대해 상기 환자의 상기 복수의 보행 피처들 및 상기 환자의 신체 정보들에 상응하는 복수의 바이오 피처들을 포함하는 입력 벡터를 생성하고, 어지럼과 관련되는 제1 내지 제n(n은2 이상의 양의 정수) 질환들 중에서 상기 환자가 갖고 있는 질환을 상기 입력 벡터에 대한 라벨로 결정하는 단계;머신 러닝 모듈이 상기 복수의 환자들에 대한 상기 입력 벡터 및 상기 입력 벡터에 대한 상기 라벨의 쌍들을 학습 데이터로 사용하여 인공 신경망이 상기 환자의 상기 입력 벡터에 기초하여 상기 제1 내지 제n 질환들 중에서상기 환자가 갖고 있는 질환을 출력하도록 상기 인공 신경망을 학습시켜 질환 예측 모델을 생성하는 단계;상기 보행 피처 생성부가 목표 환자가 보행하는 동안 상기 목표 환자에 부착된 상기 IMU 센서를 통해 측정되는측정값들을 사용하여 상기 목표 환자의 보행과 관련되는 복수의 목표 환자 보행 피처들을 생성하는 단계;제2 전처리부가 상기 복수의 목표 환자 보행 피처들 및 상기 목표 환자의 신체 정보들에 상응하는 복수의 목표환자 바이오 피처들을 포함하는 목표 환자 입력 벡터를 생성하는 단계; 및상기 머신 러닝 모듈이 상기 질환 예측 모델과 상기 목표 환자 입력 벡터에 기초하여 상기 목표 환자의 어지럼과 관련되는 질환을 예측하는 단계를 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 IMU 센서는 상기 환자가 보행 시에 착용하는 왼쪽 신발에 부착되는 제1 IMU 센서 및 상기 환자가 보행 시에 착용하는 오른쪽 신발에 부착되는 제2 IMU 센서를 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 IMU 센서는 3축 가속도 센서, 3축 자이로 센서, 및 3축 지자기 센서를 포함하는 어지럼관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 복수의 보행 피처들은 왼발 발목 관절이 몸 안쪽 및 몸 바깥쪽으로 움직이는 각도의 범위를 나타내는 왼발 내외번(inversion-eversion) 관절가동범위 및 오른발 발목 관절이 몸 안쪽과 몸 바깥쪽으로움직이는 각도의 범위를 나타내는 오른발 내외번 관절가동범위를 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서, 상기 복수의 보행 피처들은 보행 시 왼발의 유각기 시간(swing time)과 오른발의 유각기 시간의 비율을 나타내는 보행 불균형 지수(Gait Asymmetry; GA)를 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 상기 복수의 보행 피처들은 보행 시 왼발 걸음걸이와 오른발 걸음걸이의 가변성(variability)과 불균형(asymmetry)을 합성한 변수에 상응하는 국면협응지수(Phase Coordination Index; PCI)를 포함하는어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 복수의 보행 피처들은 분당 걸음 수(cadence)를 포함하는 어지럼 관련 질환 예측 방법.공개특허 10-2023-0139859-3-청구항 8 제1 항에 있어서, 상기 복수의 보행 피처들은 왼발 발목 관절이 발등이 하퇴(lower leg)에 가까워지는 방향 및발등이 하퇴로부터 멀어지는 방향으로 움직이는 각도의 범위를 나타내는 왼발 배측굴곡(dorsi-flexion)-저측굴곡(plantar-flexion) 관절가동범위 및 오른발 발목 관절이 발등이 하퇴에 가까워지는 방향 및 발등이 하퇴로부터 멀어지는 방향으로 움직이는 각도의 범위를 나타내는 오른발 배측굴곡-저측굴곡 관절가동범위를 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서, 상기 복수의 바이오 피처들은 키(height)를 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서, 상기 입력 벡터에 대한 라벨이 되는 상기 제1 내지 제n 질환들은 적어도 하나의 전정계(vestibular system)와 관련되는 질환 및 적어도 하나의 전정계와 무관한 질환을 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서, 상기 입력 벡터에 대한 라벨이 되는 상기 제1 내지 제n 질환들은 근골격계이상(Musculoskeletal disorder)을 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항에 있어서, 상기 보행 피처 생성부가 상기 복수의 보행 피처들을 생성하는 단계는,상기 복수의 환자들 각각에 대해 상기 환자가 선호 속도로 보행하는 동안 상기 IMU 센서를 통해 측정되는 측정값들을 사용하여 복수의 제1 보행 피처들을 생성하는 단계;상기 복수의 환자들 각각에 대해 상기 환자가 상기 선호 속도보다 느린 속도로 보행하는 동안 상기 IMU 센서를통해 측정되는 측정값들을 사용하여 상기 복수의 제1 보행 피처들에 대응되는 복수의 제2 보행 피처들을 생성하는 단계;상기 복수의 환자들 각각에 대해 상기 환자가 상기 선호 속도보다 빠른 속도로 보행하는 동안 상기 IMU 센서를통해 측정되는 측정값들을 사용하여 상기 복수의 제1 보행 피처들에 대응되는 복수의 제3 보행 피처들을 생성하는 단계; 및상기 복수의 제1 보행 피처들, 상기 복수의 제2 보행 피처들, 및 상기 복수의 제3 보행 피처들을 모두 포함하여상기 복수의 보행 피처들로 출력하는 단계를 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1 항에 있어서, 상기 제1 전처리부가 상기 복수의 환자들 각각에 대해 상기 환자의 상기 복수의 보행 피처들및 상기 환자의 상기 복수의 바이오 피처들을 포함하는 상기 입력 벡터를 생성하고, 상기 제1 내지 제n 질환들중에서 상기 환자가 갖고 있는 질환을 상기 입력 벡터에 대한 상기 라벨로 결정하는 단계는,상기 제1 전처리부가 상기 복수의 환자들 각각에 대해 상기 환자의 상기 복수의 보행 피처들, 상기 환자의 상기복수의 바이오 피처들, 및 상기 환자에 대해 수행된 복수의 안진검사(Nystagmus Test)들의 결과에 상응하는 복수의 안진검사 결과 피처들을 포함하는 상기 입력 벡터를 생성하고, 상기 제1 내지 제n 질환들 중에서 상기 환자가 갖고 있는 질환을 상기 입력 벡터에 대한 상기 라벨로 결정하는 단계를 포함하는 어지럼 관련 질환 예측방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서, 상기 복수의 안진검사 결과 피처들은 비디오 안진검사기를 통해 온도안진검사(caloric test)를 수행하여 측정되는 좌측 긴장성 편위(tonic deviation)의 크기와 우측 긴장성 편위의 크기 사이의 비율을포함하는 어지럼 관련 질환 예측 방법.공개특허 10-2023-0139859-4-청구항 15 제13 항에 있어서, 상기 복수의 안진검사 결과 피처들은 자발안진검사(spontaneous nystagmus test)를 수행하여측정되는 자발안진 발생 유무를 포함하는 어지럼 관련 질환 예측 방법."}
{"patent_id": "10-2022-0036328", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "복수의 환자들 각각에 대해 상기 환자가 보행하는 동안 상기 환자에 부착된 IMU(Inertial Measurement Unit) 센서를 통해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관련되는 복수의 보행 피처들을 생성하고, 목표환자가 보행하는 동안 상기 목표 환자에 부착된 상기 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 목표환자의 보행과 관련되는 복수의 목표 환자 보행 피처들을 생성하는 보행 피처 생성부;상기 복수의 환자들 각각에 대해 상기 환자의 상기 복수의 보행 피처들 및 상기 환자의 신체 정보들에 상응하는복수의 바이오 피처들을 포함하는 입력 벡터를 생성하고, 어지럼과 관련되는 제1 내지 제n(n은 2 이상의 양의정수) 질환들 중에서 상기 환자가 갖고 있는 질환을 상기 입력 벡터에 대한 라벨로 결정하는 제1 전처리부;상기 복수의 목표 환자 보행 피처들 및 상기 목표 환자의 신체 정보들에 상응하는 복수의 목표 환자 바이오 피처들을 포함하는 목표 환자 입력 벡터를 생성하는 제2 전처리부; 및상기 복수의 환자들에 대한 상기 입력 벡터 및 상기 입력 벡터에 대한 상기 라벨의 쌍들을 학습 데이터로 사용하여 인공 신경망이 상기 환자의 상기 입력 벡터에 기초하여 상기 제1 내지 제n 질환들 중에서 상기 환자가 갖고 있는 질환을 출력하도록 상기 인공 신경망을 학습시켜 질환 예측 모델을 생성하고, 상기 질환 예측 모델과상기 목표 환자 입력 벡터에 기초하여 상기 목표 환자의 어지럼과 관련되는 질환을 예측하는 머신 러닝 모듈을포함하는 어지럼 관련 질환 예측 시스템."}
{"patent_id": "10-2022-0036328", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "어지럼 관련 질환 예측 방법에서, 보행 피처 생성부가 복수의 환자들 각각에 대해 환자가 보행하는 동안 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 복수의 보행 피처들을 생성하고, 제1 전처리부가 환자의 복수의 보행 피처들 및 환자의 복수의 바이오 피처들을 포함하는 입력 벡터를 생성하고, 어지럼과 관련되는 제1 (뒷면에 계속)"}
{"patent_id": "10-2022-0036328", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 어지럼과 관련되는 질환을 예측하는 방법 및 시스템에 관한 것으로, 보다 상세하게는 환자의 보행 인 자(gait parameter) 및 신체 정보에 기초하여 상기 환자가 갖고 있는 어지럼과 관련되는 질환을 예측하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0036328", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "어지럼이란 공간감이나 균형감에 문제가 발생하여 움직임이 없음에도 불구하고 주위 환경이나 자신이 움직이는 것 같은 느낌을 받는 이상 감각을 의미한다. 어지럼은 중추성 어지럼과 말초성 어지럼으로 분류할 수 있는데, 중추성 어지럼은 중추신경계부터 소뇌, 뇌간, 전정신경핵까지의 구조에 이상이 생겨 발생하는 어지럼을 의미하고, 말초성 어지럼은 전정신경 또는 미로에 발 생하는 원인으로 유발되는 어지럼을 의미한다. 이와 같이 어지럼은 신체 각 부분의 다양한 원인으로 인해 발생 될 수 있다. 일반적으로 어지럼의 발생 원인을 파악하기 위해서 안진검사, 전정유발근전위검사, 동적자세검사, 회전의자검사, 두부충동검사, 자세검사 등과 같은 다양한 전정기능 검사가 사용된다. 그러나 상술한 바와 같이, 어지럼은 신체 각 부분의 다양한 원인으로 인해 발생될 수 있으므로, 전정계 (vestibular system)에 대한 평가만으로는 어지럼 발생 원인을 정확하게 파악하기 어렵다는 문제점이 있다. 또한, 종래에는 어지럼 발생 원인을 판단하는 정량적인 기준이 없이 검사를 진행하는 의사의 주관적인 기준에 따라 어지럼 발생 원인을 판단하므로, 어지럼을 유발하는 질환의 종류를 정확하게 진단하는 데에 한계가 있다."}
{"patent_id": "10-2022-0036328", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 목적은 인공지능(Artificial Intelligence; AI) 기반으로 환자가 갖고 있는 어지럼과 관련되는 질 환을 예측할 수 있는 방법을 제공하는 것이다.본 발명의 다른 목적은 인공지능 기반으로 환자가 갖고 있는 어지럼과 관련되는 질환을 예측할 수 있는 시스템 을 제공하는 것이다."}
{"patent_id": "10-2022-0036328", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 본 발명의 일 목적을 달성하기 위하여, 본 발명의 일 실시예에 따른 어지럼 관련 질환 예측 방법에서, 보행 피처 생성부가 복수의 환자들 각각에 대해 상기 환자가 보행하는 동안 상기 환자에 부착된 IMU(Inertial Measurement Unit) 센서를 통해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관련되는 복수의 보행 피처 들을 생성하고, 제1 전처리부가 상기 복수의 환자들 각각에 대해 상기 환자의 상기 복수의 보행 피처들 및 상기 환자의 신체 정보들에 상응하는 복수의 바이오 피처들을 포함하는 입력 벡터를 생성하고, 어지럼과 관련되는 제 1 내지 제n(n은 2 이상의 양의 정수) 질환들 중에서 상기 환자가 갖고 있는 질환을 상기 입력 벡터에 대한 라벨 로 결정하고, 머신 러닝 모듈이 상기 복수의 환자들에 대한 상기 입력 벡터 및 상기 입력 벡터에 대한 상기 라 벨의 쌍들을 학습 데이터로 사용하여 인공 신경망이 상기 환자의 상기 입력 벡터에 기초하여 상기 제1 내지 제n 질환들 중에서 상기 환자가 갖고 있는 질환을 출력하도록 상기 인공 신경망을 학습시켜 질환 예측 모델을 생성 하고, 상기 보행 피처 생성부가 목표 환자가 보행하는 동안 상기 목표 환자에 부착된 상기 IMU 센서를 통해 측 정되는 측정값들을 사용하여 상기 목표 환자의 보행과 관련되는 복수의 목표 환자 보행 피처들을 생성하고, 제2 전처리부가 상기 복수의 목표 환자 보행 피처들 및 상기 목표 환자의 신체 정보들에 상응하는 복수의 목표 환자 바이오 피처들을 포함하는 목표 환자 입력 벡터를 생성하고, 상기 머신 러닝 모듈이 상기 질환 예측 모델과 상 기 목표 환자 입력 벡터에 기초하여 상기 목표 환자의 어지럼과 관련되는 질환을 예측한다. 일 실시예에 있어서, 상기 IMU 센서는 상기 환자가 보행 시에 착용하는 왼쪽 신발에 부착되는 제1 IMU 센서 및 상기 환자가 보행 시에 착용하는 오른쪽 신발에 부착되는 제2 IMU 센서를 포함할 수 있다. 일 실시예에 있어서, 상기 IMU 센서는 3축 가속도 센서, 3축 자이로 센서, 및 3축 지자기 센서를 포함할 수 있 다. 일 실시예에 있어서, 상기 복수의 보행 피처들은 왼발 발목 관절이 몸 안쪽 및 몸 바깥쪽으로 움직이는 각도의 범위를 나타내는 왼발 내외번(inversion-eversion) 관절가동범위 및 오른발 발목 관절이 몸 안쪽과 몸 바깥쪽으 로 움직이는 각도의 범위를 나타내는 오른발 내외번 관절가동범위를 포함할 수 있다. 일 실시예에 있어서, 상기 복수의 보행 피처들은 보행 시 왼발의 유각기 시간(swing time)과 오른발의 유각기 시간의 비율을 나타내는 보행 불균형 지수(Gait Asymmetry; GA)를 포함할 수 있다. 일 실시예에 있어서, 상기 복수의 보행 피처들은 보행 시 왼발 걸음걸이와 오른발 걸음걸이의 가변성 (variability)과 불균형(asymmetry)을 합성한 변수에 상응하는 국면협응지수(Phase Coordination Index; PCI) 를 포함할 수 있다. 일 실시예에 있어서, 상기 복수의 보행 피처들은 분당 걸음 수(cadence)를 포함할 수 있다. 일 실시예에 있어서, 상기 복수의 보행 피처들은 왼발 발목 관절이 발등이 하퇴(lower leg)에 가까워지는 방향 및 발등이 하퇴로부터 멀어지는 방향으로 움직이는 각도의 범위를 나타내는 왼발 배측굴곡(dorsi-flexion)-저측 굴곡(plantar-flexion) 관절가동범위 및 오른발 발목 관절이 발등이 하퇴에 가까워지는 방향 및 발등이 하퇴로 부터 멀어지는 방향으로 움직이는 각도의 범위를 나타내는 오른발 배측굴곡-저측굴곡 관절가동범위를 포함할 수 있다. 일 실시예에 있어서, 상기 복수의 바이오 피처들은 키(height)를 포함할 수 있다. 일 실시예에 있어서, 상기 입력 벡터에 대한 라벨이 되는 상기 제1 내지 제n 질환들은 적어도 하나의 전정계 (vestibular system)와 관련되는 질환 및 적어도 하나의 전정계와 무관한 질환을 포함할 수 있다. 일 실시예에 있어서, 상기 입력 벡터에 대한 라벨이 되는 상기 제1 내지 제n 질환들은 근골격계이상 (Musculoskeletal disorder)을 포함할 수 있다. 일 실시예에 있어서, 상기 보행 피처 생성부가 상기 복수의 보행 피처들을 생성하는 단계는, 상기 복수의 환자 들 각각에 대해 상기 환자가 선호 속도로 보행하는 동안 상기 IMU 센서를 통해 측정되는 측정값들을 사용하여 복수의 제1 보행 피처들을 생성하는 단계, 상기 복수의 환자들 각각에 대해 상기 환자가 상기 선호 속도보다 느 린 속도로 보행하는 동안 상기 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 복수의 제1 보행 피처들에 대응되는 복수의 제2 보행 피처들을 생성하는 단계, 상기 복수의 환자들 각각에 대해 상기 환자가 상기 선호 속도보다 빠른 속도로 보행하는 동안 상기 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 복수의 제1 보행 피처들에 대응되는 복수의 제3 보행 피처들을 생성하는 단계, 및 상기 복수의 제1 보행 피처들, 상기 복수의 제 2 보행 피처들, 및 상기 복수의 제3 보행 피처들을 모두 포함하여 상기 복수의 보행 피처들로 출력하는 단계를 포함할 수 있다. 일 실시예에 있어서, 상기 제1 전처리부가 상기 복수의 환자들 각각에 대해 상기 환자의 상기 복수의 보행 피처 들 및 상기 환자의 상기 복수의 바이오 피처들을 포함하는 상기 입력 벡터를 생성하고, 상기 제1 내지 제n 질환 들 중에서 상기 환자가 갖고 있는 질환을 상기 입력 벡터에 대한 상기 라벨로 결정하는 단계는, 상기 제1 전처 리부가 상기 복수의 환자들 각각에 대해 상기 환자의 상기 복수의 보행 피처들, 상기 환자의 상기 복수의 바이 오 피처들, 및 상기 환자에 대해 수행된 복수의 안진검사(Nystagmus Test)들의 결과에 상응하는 복수의 안진검 사 결과 피처들을 포함하는 상기 입력 벡터를 생성하고, 상기 제1 내지 제n 질환들 중에서 상기 환자가 갖고 있 는 질환을 상기 입력 벡터에 대한 상기 라벨로 결정하는 단계를 포함할 수 있다. 상기 복수의 안진검사 결과 피처들은 비디오 안진검사기를 통해 온도안진검사(caloric test)를 수행하여 측정되 는 좌측 긴장성 편위(tonic deviation)의 크기와 우측 긴장성 편위의 크기 사이의 비율을 포함할 수 있다. 상기 복수의 안진검사 결과 피처들은 자발안진검사(spontaneous nystagmus test)를 수행하여 측정되는 자발안진 발생 유무를 포함할 수 있다. 상술한 본 발명의 일 목적을 달성하기 위하여, 본 발명의 일 실시예에 따른 어지럼 관련 질환 예측 시스템은 보 행 피처 생성부, 제1 전처리부, 제2 전처리부, 및 머신 러닝 모듈을 포함한다. 상기 보행 피처 생성부는 복수의 환자들 각각에 대해 상기 환자가 보행하는 동안 상기 환자에 부착된 IMU(Inertial Measurement Unit) 센서를 통 해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관련되는 복수의 보행 피처들을 생성하고, 목표 환자가 보행하는 동안 상기 목표 환자에 부착된 상기 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 목표 환자의 보행과 관련되는 복수의 목표 환자 보행 피처들을 생성한다. 상기 제1 전처리부는 상기 복수의 환자들 각각에 대해 상기 환자의 상기 복수의 보행 피처들 및 상기 환자의 신체 정보들에 상응하는 복수의 바이오 피처들을 포 함하는 입력 벡터를 생성하고, 어지럼과 관련되는 제1 내지 제n(n은 2 이상의 양의 정수) 질환들 중에서 상기 환자가 갖고 있는 질환을 상기 입력 벡터에 대한 라벨로 결정한다. 상기 제2 전처리부는 상기 복수의 목표 환자 보행 피처들 및 상기 목표 환자의 신체 정보들에 상응하는 복수의 목표 환자 바이오 피처들을 포함하는 목표 환 자 입력 벡터를 생성한다. 상기 머신 러닝 모듈은 상기 복수의 환자들에 대한 상기 입력 벡터 및 상기 입력 벡 터에 대한 상기 라벨의 쌍들을 학습 데이터로 사용하여 인공 신경망이 상기 환자의 상기 입력 벡터에 기초하여 상기 제1 내지 제n 질환들 중에서 상기 환자가 갖고 있는 질환을 출력하도록 상기 인공 신경망을 학습시켜 질환 예측 모델을 생성하고, 상기 질환 예측 모델과 상기 목표 환자 입력 벡터에 기초하여 상기 목표 환자의 어지럼 과 관련되는 질환을 예측한다."}
{"patent_id": "10-2022-0036328", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따른 어지럼 관련 질환 예측 시스템 및 어지럼 관련 질환 예측 방법은 인공지능 (Artificial Intelligence; AI) 기반으로 환자의 보행 인자와 기초적인 신체 정보만을 사용하여 환자가 갖고 있 는 어지럼과 관련되는 질환을 정확하게 예측할 수 있다."}
{"patent_id": "10-2022-0036328", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본문에 개시되어 있는 본 발명의 실시예들에 대해서, 특정한 구조적 내지 기능적 설명들은 단지 본 발명의 실시 예를 설명하기 위한 목적으로 예시된 것으로, 본 발명의 실시예들은 다양한 형태로 실시될 수 있으며 본문에 설 명된 실시예들에 한정되는 것으로 해석되어서는 아니 된다.본 발명은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 본문에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로 사용될 수 있다. 예를 들어, 본 발명의 권리 범위로부터 이탈되지 않은 채 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성요소들 간의 관 계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃하는\"과 \"~에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미이다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미인 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 도면상의 동일 한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 도 1은 본 발명의 일 실시예에 따른 어지럼 관련 질환 예측 시스템을 나타내는 도면이다. 도 1에 도시된 어지럼 관련 질환 예측 시스템은 어지럼과 관련되는 질환을 갖고 있는 복수의 환자들 각각으 로부터 측정된 보행 인자(gait parameter)와 상기 복수의 환자들 각각의 신체 정보를 학습 데이터로 사용하여 인공 신경망(artificial neural network)을 학습시켜 상기 환자가 갖고 있는 어지럼과 관련되는 질환을 예측하 는 질환 예측 모델을 생성한 후, 상기 질환 예측 모델을 사용하여 목표 환자가 갖고 있는 어지럼과 관련되는 질 환을 예측한다. 도 2는 본 발명의 일 실시예에 따른 어지럼 관련 질환 예측 방법을 나타내는 순서도이다. 도 2에 도시된 어지럼 관련 질환 예측 방법은 도 1의 어지럼 관련 질환 예측 시스템을 통해 수행될 수 있다. 이하, 도 1 및 2를 참조하여 어지럼 관련 질환 예측 시스템의 구성 및 동작과 어지럼 관련 질환 예측 시스 템에 의해 수행되는 어지럼 관련 질환 예측 방법에 대해 상세히 설명한다. 도 1을 참조하면, 어지럼 관련 질환 예측 시스템은 IMU(Inertial Measurement Unit) 센서, 보행 피처 생성부, 신체 정보 데이터베이스, 제1 전처리부, 머신 러닝(machine learning) 모듈, 및 제2 전처리부를 포함한다. IMU 센서는 상기 복수의 환자들 각각에 대해 상기 환자가 보행하는 동안 상기 환자에 부착되어 상기 환자 가 보행하는 동안 다양한 종류의 측정값들을 생성한다. 일 실시예에 있어서, IMU 센서는 상기 환자가 보행 시에 착용하는 왼쪽 신발에 부착되는 제1 IMU 센서 (L_IMU) 및 상기 환자가 보행 시에 착용하는 오른쪽 신발에 부착되는 제2 IMU 센서(R_IMU)를 포함할 수 있다. 일 실시예에 있어서, 제1 IMU 센서 및 제2 IMU 센서 각각은 x축, y축, 및 z축 방향의 가속도를 측정 하는 3축 가속도 센서 및 x축, y축, 및 z축 방향의 각속도를 측정하는 3축 자이로(gyro) 센서를 포함할 수 있다. 실시예에 따라서, 상기 3축 가속도 센서 및 상기 3축 자이로 센서의 오차를 보상하기 위해, 제1 IMU 센서 및 제2 IMU 센서 각각은 3축 지자기 센서(magnetometer)를 더 포함할 수 있다. 이 경우, 제1 IMU 센서는 상기 3축 가속도 센서, 상기 3축 자이로 센서, 및 상기 3축 지자기 센서를 통해 상기 환자의 보행 시에 상기 환자의 왼발의 움직임을 나타내는 9가지 측정값들을 생성하고, 제2 IMU 센서 는 상기 3축 가속도 센서, 상기 3축 자이로 센서, 및 상기 3축 지자기 센서를 통해 상기 환자의 보행 시에 상기 환자의 오른발의 움직임을 나타내는 9가지 측정값들을 생성할 수 있다. 보행 피처 생성부는 상기 복수의 환자들 각각에 대해, 상기 환자가 일정 구간을 보행하는 동안 상기 환자 에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관련되는 복수의 보행 인자 들을 계산하고, 상기 복수의 보행 인자들을 복수의 보행 피처들(G_Fs)로 생성할 수 있다(단계 S100). 일 실시예에 있어서, 보행 피처 생성부로부터 생성되는 복수의 보행 피처들(G_Fs)은 왼발 발목 관절이 몸 안쪽 및 몸 바깥쪽으로 움직이는 각도의 범위를 나타내는 왼발 내외번(inversion-eversion) 관절가동범위 및 오 른발 발목 관절이 몸 안쪽과 몸 바깥쪽으로 움직이는 각도의 범위를 나타내는 오른발 내외번 관절가동범위를 포 함할 수 있다. 일 실시예에 있어서, 보행 피처 생성부로부터 생성되는 복수의 보행 피처들(G_Fs)은 보행 시 왼발의 유각 기 시간(swing time)과 오른발의 유각기 시간의 비율을 나타내는 보행 불균형 지수(Gait Asymmetry; GA)를 포함 할 수 있다. 일 실시예에 있어서, 보행 피처 생성부로부터 생성되는 복수의 보행 피처들(G_Fs)은 보행 시 왼발 걸음걸 이와 오른발 걸음걸이의 가변성(variability)과 불균형(asymmetry)을 합성한 변수에 상응하는 국면협응지수 (Phase Coordination Index; PCI)를 포함할 수 있다. 일 실시예에 있어서, 보행 피처 생성부로부터 생성되는 복수의 보행 피처들(G_Fs)은 분당 걸음 수 (cadence)를 포함할 수 있다. 일 실시예에 있어서, 보행 피처 생성부로부터 생성되는 복수의 보행 피처들(G_Fs)은 왼발 발목 관절이 발 등이 하퇴(lower leg)에 가까워지는 방향 및 발등이 하퇴로부터 멀어지는 방향으로 움직이는 각도의 범위를 나 타내는 왼발 배측굴곡(dorsi-flexion)-저측굴곡(plantar-flexion) 관절가동범위 및 오른발 발목 관절이 발등이 하퇴에 가까워지는 방향 및 발등이 하퇴로부터 멀어지는 방향으로 움직이는 각도의 범위를 나타내는 오른발 배 측굴곡-저측굴곡 관절가동범위를 포함할 수 있다. 실시예에 따라서, 보행 피처 생성부로부터 생성되는 복수의 보행 피처들(G_Fs)은 보행 속도, 왼발 활보 길 이(stride length), 오른발 활보 길이, 왼발 걸음 길이(step length), 오른발 걸음 길이, 왼발 단하지 지지기 (single limb support), 오른발 단하지 지지기, 왼발 양하지 지지기(double limb support), 오른발 양하지 지 지기, 왼발 발끝 밀기 시간(stance phase), 및 오른발 발끝 밀기 시간을 더 포함할 수 있다. 일반적으로 IMU 센서를 통해 생성되는 측정값들을 사용하여 다양한 종류의 보행 인자(gait parameter)를 계산하 는 방법은 널리 알려져 있으므로, 여기서는 보행 피처 생성부가 상기 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관련되는 복수의 보행 피처들(G_Fs) 각각을 계산하는 방법에 대한 상세한 설명은 생략한다. 신체 정보 데이터베이스는 상기 복수의 환자들 각각에 대한 다양한 종류의 신체 정보들을 저장한다. 일 실시예에 있어서, 신체 정보 데이터베이스는 상기 복수의 환자들 각각에 대한 키(height), 성별, 몸무 게, 나이, BMI(Body Mass Index) 수치 등을 저장할 수 있다. 또한, 신체 정보 데이터베이스는 상기 복수의 환자들 각각이 갖고 있는 어지럼과 관련되는 질환을 저장할 수 있다. 제1 전처리부는 신체 정보 데이터베이스에 저장된 상기 복수의 환자들 각각의 신체 정보들을 복수의 바이오 피처들(B_Fs)로서 독출할 수 있다. 일 실시예에 있어서, 복수의 바이오 피처들(B_Fs)은 상기 환자의 키(height)를 포함할 수 있다. 실시예에 따라서, 복수의 바이오 피처들(B_Fs)은 상기 환자의 성별, 몸무게, 나이, 및 BMI 수치를 더 포함할 수 있다. 또한, 제1 전처리부는 신체 정보 데이터베이스에 저장된 상기 복수의 환자들 각각이 갖고 있는 어지 럼과 관련되는 질환(DS)을 독출할 수 있다. 이후, 제1 전처리부는 상기 복수의 환자들 각각에 대해, 상기 환자의 복수의 보행 피처들(G_Fs) 및 상기 환자의 복수의 바이오 피처들(B_Fs)을 포함하는 입력 벡터(IN_VEC)를 생성하고, 어지럼과 관련되는 제1 내지 제 n(n은 2 이상의 양의 정수) 질환들(DS1~DSn) 중에서 상기 환자가 갖고 있는 질환(DS)을 입력 벡터(IN_VEC)에 대 한 라벨(LB)로 결정할 수 있다(단계 S200). 일 실시예에 있어서, 제1 내지 제n 질환들(DS1~DSn)은 적어도 하나의 전정계(vestibular system)와 관련되는 질 환 및 적어도 하나의 전정계와 무관한 질환을 포함할 수 있다. 예를 들어, 제1 내지 제n 질환들(DS1~DSn)은 어지럼증(Dizziness), 양성체위성 돌발현훈(Benign Paroxysmal Positional Vertigo; BPPV), 메니에르병(Meniere's disease), 전정신경염(Vestibular neuritis), 돌발성 난청 (Sudden Sensory Neural Hearing Loss with Vertigo; SSNHLV), 전정편두통(Vestibular migraine), 전정기능장 애(Vestibulopathy), 근골격계이상(Musculoskeletal disorder), 및 중추성 어지럼증(Central dizziness) 등을 포함할 수 있다. 일 실시예에 있어서, 제1 전처리부는 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들(B_Fs)의 크기의 범위를 동일하게 맞추기 위해, 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들(B_Fs)에 대해 스케일링 (scaling)을 수행한 후 입력 벡터(IN_VEC)를 생성할 수 있다. 예를 들어, 제1 전처리부는 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들(B_Fs)에 대해 정규화 (normalization)를 수행한 후, 정규화된 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들(B_Fs)을 포함하는 입력 벡터(IN_VEC)를 생성할 수 있다. 또는, 제1 전처리부는 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들(B_Fs)에 대해 표준화 (standardization)를 수행한 후, 표준화된 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들(B_Fs)을 포함하 는 입력 벡터(IN_VEC)를 생성할 수 있다. 제1 전처리부로부터 생성되는 상기 복수의 환자들에 대한 입력 벡터(IN_VEC) 및 라벨(LB)의 쌍들은 학습 데이터로서 머신 러닝 모듈에 제공될 수 있다. 머신 러닝 모듈은 상기 복수의 환자들에 대한 입력 벡터(IN_VEC) 및 입력 벡터(IN_VEC)에 대한 라벨(LB)의 쌍들을 학습 데이터로 사용하여 인공 신경망이 상기 환자의 입력 벡터(IN_VEC)에 기초하여 제1 내지 제n 질환들 (DS1~DSn) 중에서 상기 환자가 갖고 있는 질환을 출력하도록 상기 인공 신경망을 학습시켜 질환 예측 모델을 생 성할 수 있다(단계 S300). 도 3은 도 1의 머신 러닝 모듈에 포함되는 인공 신경망의 일 예를 나타내는 도면이다. 일 실시예에 있어서, 상기 인공 신경망은 one-hot 인코딩 방식으로 인코딩된 결과 데이터를 생성할 수 있다. 이 경우, 도 3에 도시된 바와 같이, 상기 인공 신경망은 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들 (B_Fs)의 개수와 동일한 개수의 입력 노드들을 포함하는 입력층(INPUT LAYER), 복수의 노드들을 포함하는 적어 도 하나의 은닉층(HIDDEN LAYER), 및 n개의 출력 노드들을 포함하는 출력층(OUTPUT LAYER)을 포함할 수 있다. 입력 벡터(IN_VEC)에 포함되는 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들(B_Fs) 각각은 상기 인공 신 경망의 상기 입력층에 포함되는 상기 입력 노드들 각각에 입력되고, 상기 인공 신경망은 상기 출력층에 포함되 는 상기 출력 노드들로부터 출력되는 값을 통해 제1 내지 제n 질환들(DS1~DSn) 중의 하나를 나타낼 수 있다. 도 3에는 예시적으로 상기 인공 신경망이 하나의 은닉층을 포함하는 것으로 도시되어 있으나, 본 발명은 이에 한정되지 않으며, 실시예에 따라서 상기 인공 신경망은 복수의 은닉층들을 포함할 수도 있다. 머신 러닝 모듈은 상기 인공 신경망이 입력 벡터(IN_VEC)에 포함되는 복수의 보행 피처들(G_Fs) 및 복수의 바이오 피처들(B_Fs)에 기초하여 입력 벡터(IN_VEC)를 제1 내지 제n 질환들(DS1~DSn) 중에서 입력 벡터(IN_VE C)에 대한 라벨(LB)에 해당하는 질환으로 분류하도록 상기 인공 신경망을 학습시킬 수 있다. 예를 들어, 입력 벡터(IN_VEC)에 대한 라벨(LB)이 제1 내지 제n 질환들(DS1~DSn) 중에서 제i(i는 n 이하의 양의 정수) 질환(DSi)에 해당하는 경우, 머신 러닝 모듈은 입력 벡터(IN_VEC)에 포함되는 복수의 보행 피처들 (G_Fs) 및 복수의 바이오 피처들(B_Fs)이 상기 인공 신경망의 상기 입력층에 포함되는 상기 입력 노드들에 입력 되는 경우, 상기 인공 신경망의 상기 출력층에 포함되는 i번째 출력 노드는 1을 출력하고 나머지 출력 노드들은 0을 출력함으로써 입력 벡터(IN_VEC)를 제i 질환(DSi)으로 분류하도록 상기 인공 신경망을 학습시킬 수 있다. 머신 러닝 모듈은 상기 복수의 환자들에 대한 입력 벡터(IN_VEC) 및 입력 벡터(IN_VEC)에 대한 라벨(LB)의 쌍들을 사용하여 상기 학습을 완료한 후, 학습이 완료된 상기 인공 신경망을 상기 질환 예측 모델로 결정할 수 있다. 상술한 바와 같이, 제1 내지 제n 질환들(DS1~DSn)은 적어도 하나의 전정계(vestibular system)와 관련되는 질환 및 적어도 하나의 전정계와 무관한 질환을 포함하므로, 머신 러닝 모듈에 의해 생성되는 상기 질환 예측 모델은 환자의 전정계 관련 질환뿐만 아니라 전정계와 무관한 질환도 예측할 수 있다. 다시 도 1 및 2를 참조하면, 어지럼 관련 질환 예측 시스템은 제1 전처리부 및 머신 러닝 모듈을 통해 상기 질환 예측 모델을 생성한 후, 상기 질환 예측 모델을 사용하여 진단 대상이 되는 목표 환자가 갖고 있는 어지럼과 관련되는 질환을 예측할 수 있다. 구체적으로, 보행 피처 생성부는 IMU 센서를 사용하여 상기 복수의 환자들 각각에 대해 복수의 보행 피처들(G_Fs)을 생성하는 방법과 동일한 방법으로, 질환을 예측하고자 하는 상기 목표 환자가 일정 구간을 보행 하는 동안 상기 목표 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 목표 환자의 보 행과 관련되는 복수의 보행 인자들을 계산하고, 상기 복수의 보행 인자들을 복수의 목표 환자 보행 피처들 (TG_Fs)로 생성할 수 있다(단계 S400). 따라서 상기 복수의 환자들 각각에 대해 생성되는 복수의 보행 피처들(G_Fs)과 상기 목표 환자에 대해 생성되는 복수의 목표 환자 보행 피처들(TG_Fs)은 서로 일대일로 대응될 수 있다. 제2 전처리부는 보행 피처 생성부로부터 생성되는 복수의 목표 환자 보행 피처들(TG_Fs)을 수신할 수 있다. 또한, 제2 전처리부는 상기 목표 환자에 대한 다양한 종류의 신체 정보들에 상응하는 복수의 목표 환자 바 이오 피처들(TB_Fs)을 수신할 수 있다. 상기 복수의 환자들 각각에 대한 복수의 바이오 피처들(B_Fs)과 상기 목표 환자에 대한 복수의 목표 환자 바이 오 피처들(TB_Fs)은 서로 일대일로 대응될 수 있다. 도 1에는 제2 전처리부가 어지럼 관련 질환 예측 시스템의 외부로부터 상기 목표 환자에 대한 복수의 목표 환자 바이오 피처들(TB_Fs)을 수신하는 것으로 도시되어 있으나, 본 발명은 이에 한정되지 않는다. 실시예에 따라서 상기 목표 환자에 대한 신체 정보들은 신체 정보 데이터베이스에 미리 저장되고, 제2 전 처리부는 신체 정보 데이터베이스에 저장된 상기 목표 환자에 대한 신체 정보들을 복수의 목표 환자 바이오 피처들(TB_Fs)로서 독출할 수도 있다. 이후, 제2 전처리부는 제1 전처리부가 상기 복수의 환자들 각각에 대해 상기 환자의 복수의 보행 피 처들(G_Fs) 및 상기 환자의 복수의 바이오 피처들(B_Fs)을 포함하는 입력 벡터(IN_VEC)를 생성하는 방법과 동일 한 방법으로, 상기 목표 환자의 복수의 목표 환자 보행 피처들(TG_Fs) 및 상기 목표 환자의 복수의 목표 환자 바이오 피처들(TB_Fs)을 포함하는 목표 환자 입력 벡터(TIN_VEC)를 생성할 수 있다(단계 S500). 일 실시예에 있어서, 제2 전처리부는 복수의 목표 환자 보행 피처들(TG_Fs) 및 복수의 목표 환자 바이오 피처들(TB_Fs)의 크기의 범위를 동일하게 맞추기 위해, 복수의 목표 환자 보행 피처들(TG_Fs) 및 복수의 목표 환자 바이오 피처들(TB_Fs)에 대해 스케일링(scaling)을 수행한 후 목표 환자 입력 벡터(TIN_VEC)를 생성할 수 있다. 예를 들어, 제2 전처리부는 복수의 목표 환자 보행 피처들(TG_Fs) 및 복수의 목표 환자 바이오 피처들 (TB_Fs)에 대해 정규화(normalization)를 수행한 후, 정규화된 복수의 목표 환자 보행 피처들(TG_Fs) 및 복수의 목표 환자 바이오 피처들(TB_Fs)을 포함하는 목표 환자 입력 벡터(TIN_VEC)를 생성할 수 있다. 또는, 제2 전처리부는 복수의 목표 환자 보행 피처들(TG_Fs) 및 복수의 목표 환자 바이오 피처들(TB_Fs)에 대해 표준화(standardization)를 수행한 후, 표준화된 복수의 목표 환자 보행 피처들(TG_Fs) 및 복수의 목표 환 자 바이오 피처들(TB_Fs)을 포함하는 목표 환자 입력 벡터(TIN_VEC)를 생성할 수 있다.제2 전처리부는 상기 목표 환자에 대해 생성된 목표 환자 입력 벡터(TIN_VEC)를 머신 러닝 모듈에 제 공할 수 있다. 머신 러닝 모듈은 상기 질환 예측 모델과 목표 환자 입력 벡터(TIN_VEC)에 기초하여 상기 목표 환자의 어 지럼과 관련되는 질환을 예측할 수 있다(단계 S600). 일 실시예에 있어서, 머신 러닝 모듈은 상기 질환 예측 모델을 사용하여 목표 환자 입력 벡터(TIN_VEC)를 제1 내지 제n 질환들(DS1~DSn) 중의 하나로 분류하여 상기 분류된 질환을 상기 목표 환자가 갖고 있는 질환으로 예측할 수 있다. 예를 들어, 머신 러닝 모듈은 목표 환자 입력 벡터(TIN_VEC)를 상기 질환 예측 모델에 입력한 후, 상기 질 환 예측 모델로부터 출력되는 결과에 기초하여 상기 목표 환자가 갖고 있는 어지럼과 관련되는 질환을 제1 내지 제n 질환들(DS1~DSn) 중의 하나로 결정할 수 있다. 한편, 도 1에는 제1 전처리부 및 제2 전처리부가 별도의 구성 요소인 것으로 도시되어 있으나, 본 발 명은 이에 한정되지 않는다. 실시예에 따라서 제1 전처리부 및 제2 전처리부는 일체로 구현되어 상술한 제1 전처리부의 동작 및 제2 전처리부의 동작을 모두 수행할 수도 있다. 도 1 내지 3을 참조하여 상술한 바와 같이, 본 발명의 실시예들에 따른 어지럼 관련 질환 예측 시스템 및 어지럼 관련 질환 예측 방법은 인공지능(Artificial Intelligence; AI) 기반으로 환자의 보행 인자와 기초적인 신체 정보만을 사용하여 상기 환자가 갖고 있는 어지럼과 관련되는 질환을 정확하게 예측할 수 있으며, 전정계 관련 질환뿐만 아니라 전정계와 무관한 질환도 예측할 수 있다. 일 실시예에 있어서, 어지럼 관련 질환 예측 시스템은 상기 복수의 환자들 각각이 다양한 속도로 보행하는 동안 복수의 보행 인자들을 계산하고, 보행 속도 별로 계산된 상기 복수의 보행 인자들을 종합적으로 고려하여 상기 질환 예측 모델을 생성할 수 있다. 예를 들어, 보행 피처 생성부는 상기 복수의 환자들 각각에 대해, 상기 환자가 선호하는 선호 속도로 보행 하는 동안 상기 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관련되 는 복수의 보행 인자들을 계산하고, 상기 복수의 보행 인자들을 복수의 제1 보행 피처들로 생성할 수 있다. 또한, 보행 피처 생성부는 상기 복수의 환자들 각각에 대해, 상기 환자가 상기 선호 속도보다 느린 속도로 보행하는 동안 상기 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관 련되는 복수의 보행 인자들을 계산하고, 상기 복수의 보행 인자들을 복수의 제2 보행 피처들로 생성할 수 있다. 또한, 보행 피처 생성부는 상기 복수의 환자들 각각에 대해, 상기 환자가 상기 선호 속도보다 빠른 속도로 보행하는 동안 상기 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 환자의 보행과 관 련되는 복수의 보행 인자들을 계산하고, 상기 복수의 보행 인자들을 복수의 제3 보행 피처들로 생성할 수 있다. 이 때, 상기 복수의 제1 보행 피처들, 상기 복수의 제2 보행 피처들, 및 상기 복수의 제3 보행 피처들은 동일한 종류의 보인 인자들로 구성될 수 있다. 따라서 상기 복수의 제1 보행 피처들, 상기 복수의 제2 보행 피처들, 및 상기 복수의 제3 보행 피처들은 서로 일대일로 대응될 수 있다. 이후, 보행 피처 생성부는 상기 복수의 제1 보행 피처들, 상기 복수의 제2 보행 피처들, 및 상기 복수의 제3 보행 피처들을 모두 포함하여 복수의 보행 피처들(G_Fs)로 출력할 수 있다. 이 경우, 보행 피처 생성부는 IMU 센서를 사용하여 상기 복수의 환자들 각각에 대해 복수의 보행 피 처들(G_Fs)을 생성하는 방법과 동일한 방법으로, 상기 목표 환자가 다양한 속도로 보행하는 동안 상기 목표 환 자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 보행 속도 별로 상기 목표 환자의 보행과 관 련되는 복수의 보행 인자들을 계산하고, 상기 속도 별로 계산된 상기 복수의 보행 인자들을 복수의 목표 환자 보행 피처들(TG_Fs)로 생성할 수 있다. 예를 들어, 보행 피처 생성부는 상기 목표 환자가 선호하는 선호 속도로 보행하는 동안 상기 목표 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 목표 환자의 보행과 관련되는 복수의 보행 인 자들을 계산하고, 상기 복수의 보행 인자들을 복수의 제1 목표 환자 보행 피처들로 생성할 수 있다. 또한, 보행 피처 생성부는 상기 목표 환자가 상기 선호 속도보다 느린 속도로 보행하는 동안 상기 목표 환 자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 목표 환자의 보행과 관련되는 복수의 보 행 인자들을 계산하고, 상기 복수의 보행 인자들을 복수의 제2 목표 환자 보행 피처들로 생성할 수 있다. 또한, 보행 피처 생성부는 상기 목표 환자가 상기 선호 속도보다 빠른 속도로 보행하는 동안 상기 목표 환 자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 상기 목표 환자의 보행과 관련되는 복수의 보 행 인자들을 계산하고, 상기 복수의 보행 인자들을 복수의 제3 목표 환자 보행 피처들로 생성할 수 있다. 이 때, 상기 복수의 제1 목표 환자 보행 피처들, 상기 복수의 제2 목표 환자 보행 피처들, 및 상기 복수의 제3 목표 환자 보행 피처들은 동일한 종류의 보인 인자들로 구성될 수 있다. 따라서 상기 복수의 제1 목표 환자 보 행 피처들, 상기 복수의 제2 목표 환자 보행 피처들, 및 상기 복수의 제3 목표 환자 보행 피처들은 서로 일대일 로 대응될 수 있다. 이후, 보행 피처 생성부는 상기 복수의 제1 목표 환자 보행 피처들, 상기 복수의 제2 목표 환자 보행 피처 들, 및 상기 복수의 제3 목표 환자 보행 피처들을 모두 포함하여 복수의 목표 환자 보행 피처들(TG_Fs)로 출력 할 수 있다. 이와 같이, 어지럼 관련 질환 예측 시스템은 상기 환자가 상기 선호 속도로 보행하는 동안 상기 환자에 부 착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 생성되는 상기 복수의 제1 보행 피처들, 상기 환자가 상기 선호 속도보다 느린 속도로 보행하는 동안 상기 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 생성되는 상기 복수의 제2 보행 피처들, 및 상기 환자가 상기 선호 속도보다 빠른 속도로 보행하는 동 안 상기 환자에 부착된 IMU 센서를 통해 측정되는 측정값들을 사용하여 생성되는 상기 복수의 제3 보행 피 처들을 모두 사용하여 상기 인공 신경망을 학습시켜 상기 질환 예측 모델을 생성함으로써, 질환 예측의 정확도 를 더욱 향상시킬 수 있다. 도 4는 본 발명의 다른 실시예에 따른 어지럼 관련 질환 예측 시스템을 나타내는 도면이다. 도 4를 참조하면, 어지럼 관련 질환 예측 시스템은 IMU(Inertial Measurement Unit) 센서, 보행 피처 생성부, 신체 정보 데이터베이스, 제1 전처리부, 머신 러닝(machine learning) 모듈, 제2 전처리부, 및 안진검사(Nystagmus Test) 데이터베이스를 포함한다. 도 4에 도시된 어지럼 관련 질환 예측 시스템은 도 1에 도시된 어지럼 관련 질환 예측 시스템에서 안진 검사 데이터베이스를 더 포함하여 구성될 수 있다. 도 5는 본 발명의 다른 실시예에 따른 어지럼 관련 질환 예측 방법을 나타내는 순서도이다. 도 5에 도시된 어지럼 관련 질환 예측 방법은 도 2에 도시된 어지럼 관련 질환 예측 방법에서 일부 단계들 (S200, S500)의 동작을 변형하여 구성될 수 있다. 도 5에 도시된 어지럼 관련 질환 예측 방법은 도 4의 어지럼 관련 질환 예측 시스템을 통해 수행될 수 있다. 도 4의 어지럼 관련 질환 예측 시스템에 포함되는 IMU 센서, 보행 피처 생성부, 신체 정보 데이 터베이스, 제1 전처리부, 머신 러닝 모듈, 및 제2 전처리부의 구성 및 동작은 도 1의 어지 럼 관련 질환 예측 시스템에 포함되는 IMU 센서, 보행 피처 생성부, 신체 정보 데이터베이스 , 제1 전처리부, 머신 러닝 모듈, 및 제2 전처리부의 구성 및 동작과 동일하다. 도 1의 어지럼 관련 질환 예측 시스템에 포함되는 IMU 센서, 보행 피처 생성부, 신체 정보 데이 터베이스, 제1 전처리부, 머신 러닝 모듈, 및 제2 전처리부의 구성 및 동작(단계 S100, S200, S300, S400, S500, 및 S600)에 대해서는 도 1 내지 3을 참조하여 상세히 설명하였으므로, 여기서는 도 4 의 어지럼 관련 질환 예측 시스템의 구성 및 동작에 대한 중복되는 설명은 생략하고, 어지럼 관련 질환 예 측 시스템에 포함되는 안진검사 데이터베이스와 관련되는 동작에 대해서만 상세히 설명한다. 안진검사 데이터베이스는 상기 복수의 환자들 각각에 대해 수행된 복수의 안진검사(Nystagmus Test)들의 결과를 저장한다. 일 실시예에 있어서, 안진검사 데이터베이스는 상기 복수의 환자들 각각에 대해 수행된 온도안진검사 (caloric test) 결과, 자발안진검사(spontaneous nystagmus test) 결과 등을 저장할 수 있다. 제1 전처리부는 안진검사 데이터베이스에 저장된 상기 복수의 환자들 각각에 대해 수행된 상기 복수 의 안진검사들의 결과를 복수의 안진검사 결과 피처들(N_Fs)로서 독출할 수 있다. 일 실시예에 있어서, 복수의 안진검사 결과 피처들(N_Fs)은 비디오 안진검사기를 통해 온도안진검사를 수행하여 측정되는 좌측 긴장성 편위(tonic deviation)의 크기와 우측 긴장성 편위의 크기 사이의 비율을 포함할 수 있다. 일 실시예에 있어서, 복수의 안진검사 결과 피처들(N_Fs)은 자발안진검사를 수행하여 측정되는 자발안진 발생 유무를 포함할 수 있다. 한편, 제1 전처리부는 신체 정보 데이터베이스에 저장된 상기 복수의 환자들 각각의 신체 정보들을 복수의 바이오 피처들(B_Fs)로서 독출할 수 있다. 또한, 제1 전처리부는 신체 정보 데이터베이스에 저장된 상기 복수의 환자들 각각이 갖고 있는 어지 럼과 관련되는 질환(DS)을 독출할 수 있다. 보행 피처 생성부가 상기 복수의 환자들 각각에 대한 복수의 보행 피처들(G_Fs)을 생성한 후(단계 S100), 제1 전처리부는 상기 복수의 환자들 각각에 대해, 상기 환자의 복수의 보행 피처들(G_Fs), 상기 환자의 복 수의 바이오 피처들(B_Fs), 및 상기 환자의 복수의 안진검사 결과 피처들(N_Fs)을 포함하는 입력 벡터(IN_VEC) 를 생성하고, 어지럼과 관련되는 제1 내지 제n 질환들(DS1~DSn) 중에서 상기 환자가 갖고 있는 질환(DS)을 입력 벡터(IN_VEC)에 대한 라벨(LB)로 결정할 수 있다(단계 S210). 도 1 내지 3을 참조하여 상술한 바와 같이, 제1 내지 제n 질환들(DS1~DSn)은 적어도 하나의 전정계(vestibular system)와 관련되는 질환 및 적어도 하나의 전정계와 무관한 질환을 포함할 수 있다. 예를 들어, 제1 내지 제n 질환들(DS1~DSn)은 어지럼증(Dizziness), 양성체위성 돌발현훈(Benign Paroxysmal Positional Vertigo; BPPV), 메니에르병(Meniere's disease), 전정신경염(Vestibular neuritis), 돌발성 난청 (Sudden Sensory Neural Hearing Loss with Vertigo; SSNHLV), 전정편두통(Vestibular migraine), 전정기능장 애(Vestibulopathy), 근골격계이상(Musculoskeletal disorder), 및 중추성 어지럼증(Central dizziness) 등을 포함할 수 있다. 제1 전처리부로부터 생성되는 상기 복수의 환자들에 대한 입력 벡터(IN_VEC) 및 라벨(LB)의 쌍들은 학습 데이터로서 머신 러닝 모듈에 제공될 수 있다. 머신 러닝 모듈은 상기 복수의 환자들에 대한 입력 벡터(IN_VEC) 및 입력 벡터(IN_VEC)에 대한 라벨(LB)의 쌍들을 학습 데이터로 사용하여 인공 신경망이 상기 환자의 입력 벡터(IN_VEC)에 기초하여 제1 내지 제n 질환들 (DS1~DSn) 중에서 상기 환자가 갖고 있는 질환을 출력하도록 상기 인공 신경망을 학습시켜 질환 예측 모델을 생 성할 수 있다(단계 S300). 한편, 도 1 내지 3을 참조하여 상술한 바와 같이, 보행 피처 생성부는 질환을 예측하고자 하는 목표 환자 에 대한 복수의 목표 환자 보행 피처들(TG_Fs)을 생성하여 제2 전처리부에 제공할 수 있다(단계 S400). 또한, 제2 전처리부는 상기 목표 환자에 대한 다양한 종류의 신체 정보들에 상응하는 복수의 목표 환자 바 이오 피처들(TB_Fs)을 수신하고, 상기 목표 환자에 대해 수행된 복수의 안진검사들의 결과에 상응하는 복수의 목표 환자 안진검사 결과 피처들(TN_Fs)을 수신할 수 있다. 상기 복수의 환자들 각각에 대한 복수의 바이오 피처들(B_Fs)과 상기 목표 환자에 대한 복수의 목표 환자 바이 오 피처들(TB_Fs)은 서로 일대일로 대응될 수 있다. 마찬가지로, 상기 복수의 환자들 각각에 대한 복수의 안진검사 결과 피처들(N_Fs)과 상기 목표 환자에 대한 복 수의 목표 환자 안진검사 결과 피처들(TN_Fs)은 서로 일대일로 대응될 수 있다. 도 1에는 제2 전처리부가 어지럼 관련 질환 예측 시스템의 외부로부터 상기 목표 환자에 대한 복수의 목표 환자 바이오 피처들(TB_Fs) 및 복수의 목표 환자 안진검사 결과 피처들(TN_Fs)을 수신하는 것으로 도시되 어 있으나, 본 발명은 이에 한정되지 않는다. 실시예에 따라서 상기 목표 환자에 대한 신체 정보들은 신체 정보 데이터베이스에 미리 저장되고, 제2 전 처리부는 신체 정보 데이터베이스에 저장된 상기 목표 환자에 대한 신체 정보들을 복수의 목표 환자 바이오 피처들(TB_Fs)로서 독출할 수도 있다. 마찬가지로, 상기 목표 환자에 대해 수행된 복수의 안진검사들의 결과는 안진검사 데이터베이스에 미리 저 장되고, 제2 전처리부는 안진검사 데이터베이스에 저장된 상기 목표 환자에 대해 수행된 복수의 안진 검사들의 결과를 복수의 목표 환자 안진검사 결과 피처들(TN_Fs)로서 독출할 수도 있다. 이후, 제2 전처리부는 제1 전처리부가 상기 복수의 환자들 각각에 대해 상기 환자의 복수의 보행 피 처들(G_Fs), 상기 환자의 복수의 바이오 피처들(B_Fs), 및 상기 환자의 복수의 안진검사 결과 피처들(N_Fs)을 포함하는 입력 벡터(IN_VEC)를 생성하는 방법과 동일한 방법으로, 상기 목표 환자의 복수의 목표 환자 보행 피 처들(TG_Fs), 상기 목표 환자의 복수의 목표 환자 바이오 피처들(TB_Fs), 및 상기 목표 환자의 복수의 목표 환 자 안진검사 결과 피처들(TN_Fs)을 포함하는 목표 환자 입력 벡터(TIN_VEC)를 생성할 수 있다(단계 S510). 제2 전처리부는 상기 목표 환자에 대해 생성된 목표 환자 입력 벡터(TIN_VEC)를 머신 러닝 모듈에 제 공할 수 있다. 머신 러닝 모듈은 상기 질환 예측 모델과 목표 환자 입력 벡터(TIN_VEC)에 기초하여 상기 목표 환자의 어 지럼과 관련되는 질환을 예측할 수 있다(단계 S600). 일 실시예에 있어서, 머신 러닝 모듈은 상기 질환 예측 모델을 사용하여 목표 환자 입력 벡터(TIN_VEC)를 제1 내지 제n 질환들(DS1~DSn) 중의 하나로 분류하여 상기 분류된 질환을 상기 목표 환자가 갖고 있는 질환으로 예측할 수 있다. 예를 들어, 머신 러닝 모듈은 목표 환자 입력 벡터(TIN_VEC)를 상기 질환 예측 모델에 입력한 후, 상기 질 환 예측 모델로부터 출력되는 결과에 기초하여 상기 목표 환자가 갖고 있는 어지럼과 관련되는 질환을 제1 내지 제n 질환들(DS1~DSn) 중의 하나로 결정할 수 있다. 한편, 도 4에는 제1 전처리부 및 제2 전처리부가 별도의 구성 요소인 것으로 도시되어 있으나, 본 발 명은 이에 한정되지 않는다. 실시예에 따라서 제1 전처리부 및 제2 전처리부는 일체로 구현되어 상술한 제1 전처리부의 동작 및 제2 전처리부의 동작을 모두 수행할 수도 있다. 도 1 내지 5를 참조하여 상술한 바와 같이, 본 발명의 실시예들에 따른 어지럼 관련 질환 예측 시스템 및 어지럼 관련 질환 예측 방법은 환자에 대해 수행된 복수의 안진검사들의 결과를 추가로 사용하여 상기 질환 예 측 모델을 생성하므로, 질환 예측의 정확도를 더욱 향상시킬 수 있다. 산업상 이용가능성 본 발명은 목표 환자의 보행 인자와 기초적인 신체 정보만으로 상기 목표 환자가 갖고 있는 어지럼과 관련되는 질환을 예측하는 데에 유용하게 이용될 수 있다. 상술한 바와 같이, 본 발명의 바람직한 실시예를 참조하여 설명하였지만 해당 기술 분야에서 통상의 지식을 가 진 자라면 하기의 특허청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명 을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2022-0036328", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 어지럼 관련 질환 예측 시스템을 나타내는 도면이다. 도 2는 본 발명의 일 실시예에 따른 어지럼 관련 질환 예측 방법을 나타내는 순서도이다. 도 3은 도 1의 머신 러닝 모듈에 포함되는 인공 신경망의 일 예를 나타내는 도면이다. 도 4는 본 발명의 다른 실시예에 따른 어지럼 관련 질환 예측 시스템을 나타내는 도면이다. 도 5는 본 발명의 다른 실시예에 따른 어지럼 관련 질환 예측 방법을 나타내는 순서도이다."}
