{"patent_id": "10-2022-7027825", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0119745", "출원번호": "10-2022-7027825", "발명의 명칭": "콘텐츠를 검색하는 방법, 장치, 기기 및 컴퓨터 판독 가능 저장 매체", "출원인": "바이두 온라인 네트웍 테크놀러지", "발명자": "지앙, 푸춘"}}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "콘텐츠를 검색하는 방법에 있어서,타겟 검색항에 대한 검색 요청을 수신한 것에 응답하여, 복수의 역사 검색 요청에 관련된 복수의 역사 검색 기록을 획득하는 단계 - 각 역사 검색 기록은 해당 역사 검색 요청에 대한 역사 검색항을 포함함 - ; 상기 복수의 역사 검색 기록에서 상기 타겟 검색항에 매칭되는 제1 역사 검색 기록을 결정하는 단계; 상기 복수의 역사 검색 기록 사이의 관계를 기반으로, 상기 복수의 역사 검색 기록에서 상기 제1 역사 검색 기록과 관련되는 제2 역사 검색 기록을 결정하는 단계; 및 상기 제2 역사 검색 기록에 대응되는 검색 결과를 기반으로, 상기 타겟 검색항에 대한 확장 결과를 결정하는 단계; 를 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 역사 검색 기록에 포함된 복수의 역사 검색항을 기반으로, 상기 복수의 역사 검색 기록의 카테고리를 결정하는 단계; 및 상기 카테고리를 기반으로, 상기 복수의 역사 검색 기록 사이의 관계를 결정하는 단계; 를 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 복수의 역사 검색 기록의 각 역사 검색 기록은 핵심 엔티티를 더 포함하고, 상기 복수의 역사 검색 기록의 카테고리를 결정하는 단계는,상기 복수의 역사 검색항에서 해당 핵심 엔티티를 제거하고, 상기 복수의 역사 검색항 각각의 나머지 부분을 획득하는 단계; 상기 적어도 나머지 부분을 기반으로 상기 복수의 역사 검색항과 관련된 수요 정보를 결정하는 단계; 및 상기 수요 정보를 기반으로 상기 복수의 역사 검색 기록의 카테고리를 결정하는 단계; 를 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 복수의 역사 검색 기록은 복수의 카테고리를 구비하고, 상기 복수의 역사 검색 기록 사이의 관계를 결정하는 단계는,검색 로그에서 상기 복수의 역사 검색항에 대한 검색 시간 또는 검색 결과를 결정하는 단계; 상기 검색 시간 또는 상기 검색 결과를 기반으로, 상기 복수의 카테고리 사이의 관련 정도를 결정하는 단계; 및 상기 복수의 카테고리 사이의 관련 정도를 기반으로, 상기 복수의 역사 검색 기록 사이의 관계를 결정하는단계; 를 포함하는,공개특허 10-2022-0119745-3-것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,검색 로그에서 상기 복수의 역사 검색항에 대한 검색 시간 또는 검색 결과를 결정하는 단계; 상기 검색 시간 또는 상기 검색 결과를 기반으로, 상기 복수의 역사 검색 기록 사이의 관련 정도를 결정하는 단계; 및 상기 복수의 역사 검색 기록 사이의 관련 정도를 기반으로, 상기 복수의 역사 검색 기록 사이의 관계를 결정하는 단계; 를 더 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 복수의 역사 검색 기록의 각 역사 검색 기록은 핵심 엔티티 및 각 역사 검색 기록의 카테고리를 더 포함하고, 상기 제2 역사 검색 기록을 결정하는 단계는,상기 복수의 역사 검색 기록 사이의 상기 관계를 기반으로, 상기 제1 역사 검색 기록의 제1 카테고리와 관련된제2 카테고리를 결정하는 단계; 및 상기 복수의 역사 검색 기록에서 제2 카테고리를 구비한 제2 역사 검색 기록을 결정하는 단계 - 상기 제2 역사검색 기록은 상기 제1 역사 검색 기록의 핵심 엔티티를 포함함 - ; 를 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제2 역사 검색 기록을 결정하는 단계는,상기 복수의 역사 검색 기록 사이의 관계를 기반으로, 상기 제1 역사 검색 기록과 관련된 1개 세트의 역사 검색기록을 결정하는 단계 - 상기 제1 역사 검색 기록과 상기 1개 세트의 역사 검색 기록의 각 역사 검색 기록은 관련 정도를 구비함 - ; 및 상기 관련 정도를 기반으로, 상기 1개 세트의 역사 검색 기록에서 상기 제2 역사 검색 기록을 결정하는 단계;를 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 복수의 역사 검색 기록을 획득하는 단계는,검색 로그에서, 1개 세트의 역사 검색 요청에 대한 1개 세트의 역사 검색항을 결정하는 단계; 상기 1개 세트의 역사 검색항에서 복수의 엔티티를 결정하는 단계 - 각 엔티티는 해당 역사 검색항과 관련된 대상을 식별함 - ; 상기 1개 세트의 역사 검색항에서 상기 복수의 엔티티가 나타난 횟수를 기반으로, 상기 복수의 엔티티에서 핵심엔티티를 결정하는 단계; 상기 1개 세트의 역사 검색항에서 상기 핵심 엔티티를 포함한 복수의 역사 검색항을 선택하는 단계; 및 상기 복수의 역사 검색항 및 상기 핵심 엔티티에 따라 상기 복수의 역사 검색 기록을 생성하는 단계; 를 포함하공개특허 10-2022-0119745-4-는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 핵심 엔티티를 결정하는 단계는,상기 1개 세트의 역사 검색항에서 단일 엔티티를 포함한 역사 검색항 세트를 결정하는 단계; 상기 역사 검색항 세트에서 적어도 하나의 역사 검색항을 결정하는 단계 - 상기 적어도 하나의 역사 검색항 세트에 포함된 단일 엔티티가 상기 역사 검색항에서 나타난 횟수는 제1 역치 횟수를 초과함 - ; 및 상기 적어도 하나의 역사 검색항에 포함된 단일 엔티티를 핵심 엔티티로 결정하는 단계; 를 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 핵심 엔티티를 결정하는 단계는,상기 1개 세트의 역사 검색항에서 상기 복수의 엔티티가 나타난 횟수를 기반으로, 상기 복수의 엔티티에서 나타난 횟수가 제2 역치 횟수를 초과한 고주파 엔티티를 결정하는 단계; 및 상기 해당 역사 검색항에서 상기 고주파 엔티티의 가중치가 역치 가중치를 초과하는 것을 결정하고, 상기 고주파 엔티티를 상기 핵심 엔티티로 결정하는 단계 - 상기 가중치는 상기 해당 역사 검색항에서 상기 고주파 엔티티의 중요성을 가리킴 - ; 를 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 가중치는,상기 해당 역사 검색항에서 상기 고주파 엔티티의 위치, 및 상기 고주파 엔티티의 길이와 상기 해당 역사 검색항의 길이 사이의 관계; 중 적어도 하나를 기반으로결정되는,것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 타겟 검색항에 대한 확장 결과를 결정하는 단계는,상기 제2 역사 검색 기록의 역사 검색항에 대한 검색 결과를 획득하는 단계; 및 상기 검색 결과를 상기 확장 결과로 결정하는 단계; 를 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 타겟 검색항에 대한 확장 결과를 결정하는 단계는,상기 제2 역사 검색 기록의 역사 검색항에 대한 역사 검색 결과를 획득하는 단계; 공개특허 10-2022-0119745-5-상기 역사 검색 결과에서 이미 사용자에 의해 액세스된 부분 역사 검색 결과를 결정하는 단계; 및 상기 부분 역사 검색 결과를 상기 확장 결과로 결정하는 단계; 를 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 타겟 검색항에 대한 확장 결과를 결정하는 단계는,사용자가 상기 제2 역사 검색 기록의 역사 검색항을 검색할 경우 생성된 정보 흐름을 획득하는 단계; 및 상기 정보 흐름을 기반으로, 상기 확장 결과를 결정하는 단계; 를 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 확장 결과를 제공하는 단계; 및 상기 확장 결과 및 상기 타겟 검색항에 대한 타겟 검색 결과를 제공하는 단계; 중 적어도 하나를 더 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 확장 결과 및 상기 타겟 검색 결과를 제공하는 단계는,상기 확장 결과의 제1 점수를 결정하는 단계 - 상기 제1 점수는 상기 확장 결과와 상기 제2 역사 검색 기록의역사 검색항의 관련도를 가리킴 - ; 상기 타겟 검색 결과의 제2 점수를 결정하는 단계 - 상기 제2 점수는 상기 타겟 검색 결과와 상기 타겟 검색항의 관련도를 가리킴 - ; 상기 제1 점수 및 상기 제2 점수를 기반으로, 상기 확장 결과 및 상기 타겟 검색 결과의 우선 순위를 결정하는단계; 및 상기 우선 순위를 기반으로 상기 확장 결과 및 상기 타겟 검색 결과를 제공하는 단계; 를 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,상기 제2 역사 검색 기록에 대응되는 검색 결과를 획득하는 타겟 데이터 소스를 구축하는 단계를 더 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 타겟 데이터 소스를 구축하는 단계는,복수의 최초 데이터 소스의 복수의 파일의 점수를 결정하는 단계 - 각 파일의 상기 점수는 상기 파일의 품질을가리킴 - ; 및 상기 복수의 파일에서 점수가 역치 점수를 초과하는 파일을 상기 타겟 데이터 소스의 파일로 결정하는 단계; 를포함하는, 공개특허 10-2022-0119745-6-것을 특징으로 하는 콘텐츠를 검색하는 방법."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "콘텐츠를 검색하는 장치에 있어서,타겟 검색항에 대한 검색 요청을 수신한 것에 응답하여, 복수의 역사 검색 요청에 관련된 복수의 역사 검색 기록을 획득하도록 구성된 역사 검색 기록획득 모듈 - 각 역사 검색 기록은 해당 역사 검색 요청에 대한 역사 검색항을 포함함 - ; 상기 복수의 역사 검색 기록에서 상기 타겟 검색항에 매칭되는 제1 역사 검색 기록을 결정하도록 구성된 타겟검색항 매칭 모듈; 상기 복수의 역사 검색 기록 사이의 관계를 기반으로, 상기 복수의 역사 검색 기록에서 상기 제1 역사 검색 기록과 관련되는 제2 역사 검색 기록을 결정하도록 구성된 역사 검색 기록 결정 모듈; 및 상기 제2 역사 검색 기록에 대응되는 검색 결과를 기반으로, 상기 타겟 검색항에 대한 확장 결과를 결정하도록구성된 확장 결과 결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 복수의 역사 검색 기록에 포함된 복수의 역사 검색항을 기반으로, 상기 복수의 역사 검색 기록의 카테고리를 결정하도록 구성된 카테고리 결정 모듈; 및 상기 카테고리를 기반으로, 상기 복수의 역사 검색 기록 사이의 관계를 결정하도록 구성된 역사 검색 기록 관계결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 복수의 역사 검색 기록의 각 역사 검색 기록은 핵심 엔티티를 더 포함하고, 상기 카테고리 결정 모듈은,상기 복수의 역사 검색항에서 해당 핵심 엔티티를 제거하고, 상기 복수의 역사 검색항 각각의 나머지 부분을 획득하도록 구성된 나머지 부분 결정 모듈;적어도 상기 나머지 부분을 기반으로 상기 복수의 역사 검색항과 관련된 수요 정보를 결정하도록 구성된 수요정보 결정 모듈; 및 상기 수요 정보를 기반으로 상기 복수의 역사 검색 기록의 카테고리를 결정하도록 구성된 역사 검색 기록 카테고리 결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제20항에 있어서,상기 복수의 역사 검색 기록에는 복수의 카테고리가 구비되고, 상기 역사 검색 기록 관계 결정 모듈은,검색 로그에서 상기 복수의 역사 검색항에 대한 검색 시간 또는 검색 결과를 결정하도록 구성된 제1 검색 시간또는 검색 결과 결정 모듈; 상기 검색 시간 또는 상기 검색 결과를 기반으로, 상기 복수의 카테고리 사이의 관련 정도를 결정하도록 구성된공개특허 10-2022-0119745-7-관련 정도 결정 모듈; 및 상기 복수의 카테고리 사이의 관련 정도를 기반으로, 상기 복수의 역사 검색 기록 사이의 관계를 결정하도록 구성된 관련 정도를 기반으로 하는 관계 결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제19항에 있어서,검색 로그에서 상기 복수의 역사 검색항에 대한 검색 시간 또는 검색 결과를 결정하도록 구성된 제2 검색 시간또는 검색 결과 구성 모듈; 상기 검색 시간 또는 상기 검색 결과를 기반으로, 상기 복수의 역사 검색 기록 사이의 관련 정도를 결정하도록구성된 관련 정도 결정 모듈; 및 상기 복수의 역사 검색 기록 사이의 관련 정도를 기반으로, 상기 복수의 역사 검색 기록 사이의 관계를 결정하도록 구성된 관련 정도를 기반으로 하는 관계 결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제19항에 있어서,상기 복수의 역사 검색 기록의 각 역사 검색 기록은 핵심 엔티티 및 각 역사 검색 기록의 카테고리를 더 포함하고, 상기 역사 검색 기록 결정 모듈은,상기 복수의 역사 검색 기록 사이의 상기 관계를 기반으로, 상기 제1 역사 검색 기록의 제1 카테고리와 관련된제2 카테고리를 결정하도록 구성된 제2 카테고리 결정 모듈; 및 상기 복수의 역사 검색 기록에서 제2 카테고리를 구비한 제2 역사 검색 기록을 결정하도록 구성된 카테고리를구비한 제2 역사 검색 기록 결정 모듈 - 상기 제2 역사 검색 기록은 상기 제1 역사 검색 기록의 핵심 엔티티를포함함 - ; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제19항에 있어서,상기 역사 검색 기록 결정 모듈은,상기 복수의 역사 검색 기록 사이의 관계를 기반으로, 상기 제1 역사 검색 기록과 관련된 1개 세트의 역사 검색기록을 결정하도록 구성된 1개 세트의 역사 검색 기록 결정 모듈 - 상기 제1 역사 검색 기록과 상기 1개 세트의역사 검색 기록의 각 역사 검색 기록은 관련 정도를 구비함 - ; 및 상기 관련 정도를 기반으로, 상기 1개 세트의 역사 검색 기록에서 상기 제2 역사 검색 기록을 결정하도록 구성된 관련 정도를 기반으로 하는 역사 검색 기록 결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제19항에 있어서,상기 역사 검색 기록 획득 모듈은,검색 로그에서, 1개 세트의 역사 검색 요청에 대한 1개 세트의 역사 검색항을 결정하도록 구성된 제1 역사 검색항 결정 모듈; 상기 1개 세트의 역사 검색항에서 복수의 엔티티를 결정하도록 구성된 엔티티 결정 모듈 - 각 엔티티는 해당 역공개특허 10-2022-0119745-8-사 검색항과 관련된 대상을 식별함 - ; 상기 1개 세트의 역사 검색항에서 상기 복수의 엔티티가 나타난 횟수를 기반으로, 상기 복수의 엔티티에서 핵심엔티티를 결정하도록 구성된 제1 핵심 엔티티 결정 모듈; 상기 1개 세트의 역사 검색항에서 상기 핵심 엔티티를 포함한 복수의 역사 검색항을 선택하도록 구성된 선택 모듈; 및 상기 복수의 역사 검색항 및 상기 핵심 엔티티에 따라 상기 복수의 역사 검색 기록을 생성하도록 구성된 생성모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서,상기 제1 핵심 엔티티 결정 모듈은,상기 1개 세트의 역사 검색항에서 단일 엔티티를 포함한 역사 검색항 세트를 결정하도록 구성된 역사 검색항 세트 결정 모듈; 상기 역사 검색항 세트에서 적어도 하나의 역사 검색항을 결정하도록 구성된 제2 역사 검색항 결정 모듈 - 상기적어도 하나의 역사 검색항 세트에 포함된 단일 엔티티가 상기 역사 검색항에서 나타난 횟수는 제1 역치 횟수를초과함 - ; 및 상기 적어도 하나의 역사 검색항에 포함된 단일 엔티티를 핵심 엔티티로 결정하도록 구성된 단일 엔티티에 대한핵심 엔티티 결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제26항에 있어서,상기 핵심 엔티티 결정 모듈은,상기 1개 세트의 역사 검색항에서 상기 복수의 엔티티가 나타난 횟수를 기반으로, 상기 복수의 엔티티에서 나타난 횟수가 제2 역치 횟수를 초과한 고주파 엔티티를 결정하도록 구성된 고주파 엔티티 결정 모듈; 및 상기 해당 역사 검색항에서 상기 고주파 엔티티의 가중치가 역치 가중치를 초과하는 것을 결정하고, 상기 고주파 엔티티를 상기 핵심 엔티티로 결정하도록 구성된 제2 핵심 엔티티 결정 모듈 - 상기 가중치는 상기 해당 역사 검색항에서 상기 고주파 엔티티의 중요성을 가리킴 - ; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제28항에 있어서,상기 제2 핵심 엔티티 결정 모듈은, 상기 해당 역사 검색항에서 상기 고주파 엔티티의 위치를 결정하도록 구성된 위치 결정 모듈; 및 상기 고주파 엔티티의 길이와 상기 해당 역사 검색항의 길이 사이의 관계를 결정하도록 구성된 길이 관계 결정모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제19항에 있어서,상기 확장 결과 결정 모듈은,공개특허 10-2022-0119745-9-상기 제2 역사 검색 기록의 역사 검색항에 대한 검색 결과를 획득하도록 구성된 제1 검색 결과 획득 모듈; 및 상기 검색 결과를 상기 확장 결과로 결정하도록 구성된 검색 결과에 대한 확장 결과 결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제19항에 있어서,상기 확장 결과 결정 모듈은,상기 제2 역사 검색 기록의 역사 검색항에 대한 역사 검색 결과를 획득하도록 구성된 제2 검색 결과 획득 모듈; 상기 역사 검색 결과에서 이미 사용자에 의해 액세스된 부분 역사 검색 결과를 결정하도록 구성된 부분 역사 검색 결과 결정 모듈; 및 상기 부분 역사 검색 결과를 상기 확장 결과로 결정하도록 구성된 부분 역사 검색 결과 확장 모듈; 을포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제19항에 있어서,상기 확장 결과 결정 모듈은,사용자가 상기 제2 역사 검색 기록의 역사 검색항을 검색할 경우 생성된 정보 흐름을 획득하도록 구성된 정보흐름 모듈; 및 상기 정보 흐름을 기반으로, 상기 확장 결과를 결정하도록 구성된 정보 흐름에 대한 확장 결과 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제19항에 있어서, 상기 확장 결과를 제공하도록 구성된 제1 제공 장치; 및 상기 확장 결과 및 상기 타겟 검색항에 대한 타겟 검색 결과를 제공하도록 구성된 제2 제공 장치; 중 적어도 하나를 더 포함하는, 것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제33항에 있어서,상기 제2 제공 장치는,상기 확장 결과의 제1 점수를 결정하도록 구성된 제1 점수 결정 모듈 - 상기 제1 점수는 상기 확장 결과와 상기제2 역사 검색 기록의 역사 검색항의 관련도를 가리킴 - ; 상기 타겟 검색 결과의 제2 점수를 결정하도록 구성된 제2 점수 결정 모듈 - 상기 제2 점수는 상기 타겟 검색결과와 상기 타겟 검색항의 관련도를 가리킴 - ; 상기 제1 점수 및 상기 제2 점수를 기반으로, 상기 확장 결과 및 상기 타겟 검색 결과의 우선 순위를 결정 하도록 구성된 우선 순위 결정 모듈; 및 상기 우선 순위를 기반으로 상기 확장 결과 및 상기 타겟 검색 결과를 제공하도록 구성된 확장 결과 및 검색 결과 제공 모듈; 을 포함하는,공개특허 10-2022-0119745-10-것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제19항에 있어서, 상기 제2 역사 검색 기록에 대응되는 검색 결과를 획득하는 타겟 데이터 소스를 구축하도록 구성된 타겟 데이터소스 구축 모듈을 더 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제35항에 있어서,상기 타겟 데이터 소스 구축 모듈은,복수의 최초 데이터 소스의 복수의 파일의 점수를 결정하도록 구성된 파일 점수 결정 모듈 - 각 파일의 상기 점수는 상기 파일의 품질을 가리킴 - ; 및 상기 복수의 파일에서 점수가 역치 점수를 초과하는 파일을 상기 타겟 데이터 소스의 파일로 결정하도록 구성된타겟 데이터 소스 파일 결정 모듈; 을 포함하는,것을 특징으로 하는 콘텐츠를 검색하는 장치."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "전자 기기에 있어서,하나 또는 복수의 프로세서; 및 하나 또는 복수의 프로그램을 저장하는 저장 장치; 를 포함하고, 상기 하나 또는 복수의 프로그램이 상기 하나 또는 복수의 프로세서에 의해 수행될 경우, 상기 하나 또는 복수의 프로세서가 제1항 내지 제18항 중 어느 한 항의 방법을 구현하는,것을 특징으로 하는 전자 기기."}
{"patent_id": "10-2022-7027825", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "컴퓨터 프로그램이 저장되어 있는 컴퓨터 판독 가능 저장 매체에 있어서,상기 컴퓨터 프로그램이 프로세서에 의해 수행될 경우, 제1항 내지 제18항 중 어느 한 항의 방법이 구현되는,것을 특징으로 하는 컴퓨터 프로그램이 저장되어 있는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-7027825", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 콘텐츠를 검색하는 방법, 장치, 기기 및 컴퓨터 판독 가능 저장 매체를 제공하는 바, 데이터 처리 분야에 관한 것이다. 당해 방법에서, 타겟 검색항에 대한 검색 요청을 수신한 것에 응답하여, 복수의 역사 검색 요청에 관련된 복수의 역사 검색 기록을 획득하고, 각 역사 검색 기록은 해당 역사 검색 요청 에 대한 역사 검색항을 포함한다. 그리고, 복수의 역사 검색 기록에서 타겟 검색항에 매칭되는 제1 역사 검색 기 록을 결정함으로, 복수의 역사 검색 기록 사이의 관계를 기반으로, 복수의 역사 검색 기록에서 제1 역사 검색 기 록과 관련되는 제2 역사 검색 기록을 결정한다. 당해 방법은 제2 역사 검색 기록에 대응되는 검색 결과를 기반으 로, 타겟 검색항에 대한 확장 결과를 결정하는 단계를 더 포함한다. 당해 방법을 통해, 사용자의 검색 수요를 만 족할 수 있는 확장 결과를 제공하고, 검색 품질 및 효과를 향상시키고, 사용자 체험을 개진할 수 있다."}
{"patent_id": "10-2022-7027825", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 주로 데이터 처리 분야에 관한 것으로, 더 구체적으로, 콘텐츠를 검색하는 방법, 장치, 기 기 및 컴퓨터 판독 가능 저장 매체에 관한 것이다."}
{"patent_id": "10-2022-7027825", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보 기술의 신속한 발전에 따라, 많은 사용자 및 웹 사이트는 액세스 가능한 정보를 대량으로 제공하고, 웹 사 이트에 의해 제공된 데이터량이 점점 많아지므로, 개별 사용자에 있어서, 각 웹 사이트 또는 정보원에서 관련 정보를 찾기가 매우 어렵게 된다. 정보 검색의 어려움을 해결하기 위해, 사용자가 정보를 찾을 수 있도록 많은 검색 엔진이 나타났다. 검색 엔진 이 대량의 웹 사이트에서 각 정보를 로컬에 수집할 수 있으므로, 가공을 통해 각 정보 데이터 베이스를 구축한 다. 사용자가 콘텐츠를 찾고 싶을 경우, 검색 엔진에 검색 콘텐츠를 입력하여 찾으려는 콘텐츠를 쉽고 빠르게획득할 수 있다. 그러나, 검색 엔진을 사용하여 콘텐츠를 찾는 프로세스에는 해결해야 할 문제가 아직도 많이 존재한다."}
{"patent_id": "10-2022-7027825", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 예시적인 실시예에 따르면, 콘텐츠를 검색하는 수단을 제공한다."}
{"patent_id": "10-2022-7027825", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 제1 측면에 따르면, 콘텐츠를 검색하는 방법을 제공한다. 당해 방법은, 타겟 검색항에 대한 검색 요 청을 수신한 것에 응답하여, 복수의 역사 검색 요청에 관련된 복수의 역사 검색 기록을 획득하는 단계를 포함하 고, 각 역사 검색 기록은 해당 역사 검색 요청에 대한 역사 검색항을 포함한다. 당해 방법은, 복수의 역사 검색 기록에서 타겟 검색항에 매칭되는 제1 역사 검색 기록을 결정하는 단계를 더 포함한다. 당해 방법은, 복수의 역 사 검색 기록 사이의 관계를 기반으로, 복수의 역사 검색 기록에서 제1 역사 검색 기록과 관련되는 제2 역사 검 색 기록을 결정하는 단계를 더 포함한다. 당해 방법은 제2 역사 검색 기록에 대응되는 검색 결과를 기반으로, 타겟 검색항에 대한 확장 결과를 결정하는 단계를 더 포함한다. 본 발명의 제2 측면에 따르면, 콘텐츠를 검색하는 장치를 제공한다. 당해 장치는, 타겟 검색항에 대한 검색 요 청을 수신한 것에 응답하여, 복수의 역사 검색 요청에 관련된 복수의 역사 검색 기록을 획득하도록 구성된 역사 검색 기록획득 모듈 - 각 역사 검색 기록은 해당 역사 검색 요청에 대한 역사 검색항을 포함함 - ; 복수의 역사 검색 기록에서 타겟 검색항에 매칭되는 제1 역사 검색 기록을 결정하도록 구성된 타겟 검색항 매칭 모듈; 복수 의 역사 검색 기록 사이의 관계를 기반으로, 복수의 역사 검색 기록에서 제1 역사 검색 기록과 관련되는 제2 역 사 검색 기록을 결정하도록 구성된 역사 검색 기록 결정 모듈; 및제2 역사 검색 기록에 대응되는 검색 결과를 기반으로, 타겟 검색항에 대한 확장 결과를 결정하도록 구성된 확장 결과 결정 모듈; 을 포함한다. 본 발명의 제3 측면에 따르면, 전자 기기를 제공하고, 상기 전자 기기는, 하나 또는 복수의 프로세서; 및 하나 또는 복수의 프로그램을 저장하는 저장 장치; 를 포함하고, 하나 또는 복수의 프로그램이 하나 또는 복수의 프 로세서에 의해 수행될 경우, 하나 또는 복수의 프로세서가 본 발명의 제1 측면에 따른 방법을 구현한다. 본 발명의 제4 측면에 따르면, 컴퓨터 프로그램이 저장되어 있는 컴퓨터 판독 가능 저장 매체를 제공하고, 당해 컴퓨터 프로그램이 프로세서에 의해 수행될 경우 본 발명의 제1 측면에 따른 방법이 구현된다."}
{"patent_id": "10-2022-7027825", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예를 더 상세하게 설명한다. 도면에는 본 발명의 일부 실시예를 나타냈지 만, 이해해야 할 것은, 본 발명은 각종 방식을 통해 구현될 수 있고, 실시예에 한정된다고 해석해서는 안된다.반대로, 당해 실시예를 제공하는 것은 본 발명을 더 투철 및 완전하게 이해하기 위한 것이다. 이해해야 할 것은, 본 발명의 도면 및 실시예는 예시적인 것일 뿐, 본 발명의 보호 범위를 한정하기 위한 것이 아니다. 본 발명 실시예의 설명에서, 용어 \"포함\" 및 당해 유사한 용어는 개방적인 포함으로 이해해야 한다. 즉, \"포함 하나 한정되지 않는다\"로 이해해야 한다. 용어 \"쪋기반으로\"는 \"적어도 부분적으로 기반\"으로 이해해야 한다. 용어 \"일 실시예\" 또는 \"당해 실시예\"는 \"적어도 하나의 실시예\"로 이해해야 한다. 용어 \"제1\", \"제2\" 등은 부 동하거나 같은 대상을 가리킬 수 있다. 아래는 기타 명확하고 함축적인 정의를 포함할 수 있다. 검색 엔진에서, 사용자는 검색항을 제출하고, 검색 엔진은 웹 라이브러리에 대해 검색하며, 검색 엔진은 검색항 에 매칭되는 결과를 획득하고, 결과를 정렬한 후 사용자에게 리턴한다. 검색항에 의해 명확히 표현된 정보 수요 이외에, 사용자는 관련 정보를 동시에 수요하는 경우가 늘 있다. 따라서 전통 검색 엔진 제품에는, 일정한 추천 기능을 구비하고, 현재 검색항에 관련 검색항을 추천하여, 사용자의 당해 관련 정보 수요를 만족한다. 예를 들 면, 도1은 전통 수단에 따라 추천 결과를 제공하는 예시의 개략도이다. 사용자가 검색 엔진에 \"유**\"를 입 력한 후 2개의 추천 블록102 및 104가 제공된다. 블록102에 일부 추천 검색항을 제공하고, 블록104에도 일부 추 천 검색항을 제공한다. 그러나, 전통 수단에서 제공된 추천 검색항은 사용자의 관련 수요를 직접 만족할 수 없고, 사용자가 검색항을 클릭해야 하고, 새로운 검색 페이지에서 수요에 만족되는 파일 자원을 인공으로 선별한다. 또한, 전통 수단의 검색항 텍스트는 보편적으로 비교적 짧고, 추천 콘텐츠로서의 흡인력이 약하고, 검색항은 사용자가 콘텐츠를 생 성하는 방식을 통해 생성되고, 당해 품질 및 안전성을 보장하기 어렵다. 본 발명의 실시예에 따르면, 콘텐츠를 검색하는 개진 수단을 제공한다. 당해 수단에서, 타겟 검색항에 대한 검 색 요청을 수신하였을 경우, 복수의 역사 검색 요청에 관련된 복수의 역사 검색 기록을 먼저 획득하고, 각 역사 검색 기록은 해당 역사 검색 요청에 대한 역사 검색항을 포함하고, 복수의 역사 검색 기록에서 타겟 검색항에 매칭되는 제1 역사 검색 기록을 결정한다. 복수의 역사 검색 기록 사이의 관계를 통해, 복수의 역사 검색 기록 에서 제1 역사 검색 기록과 관련되는 제2 역사 검색 기록을 결정하고, 제2 역사 검색 기록에 대응되는 검색 결 과를 기반으로, 타겟 검색항에 대한 확장 결과를 결정한다. 당해 방법을 통해, 사용자의 검색 수요를 만족할 수 있는 확장 결과를 제공하고, 검색 품질 및 효과를 향상시키며, 사용자 체험을 개진할 수 있다. 도2는 본 발명 복수의 실시예의 구현 가능한 환경의 개략도이다. 당해 예시 환경에서, 당해 예시 환 경은 단말 기기 및 컴퓨팅 기기를 포함한다. 컴퓨팅 기기는 단말 기기에서의 검색 요 청을 기반으로 사용자에게 검색 요청에 대한 확장 결과를 제공한다. 단말 기기는 검색하는데 사용되는 애플리케이션 또는 프로그램을 운행할 수 있다. 예를 들면 검색 엔진 응 용을 운행할 수 있다. 단말 기기는 사용자에 의해 입력된 타겟 검색항을 수신한다. 예를 들면 사용자 에 의해 입력된 \"벤츠 C200은 얼마예요\"를 수신하고, 단말 기기는 당해 타겟 검색항에 대한 검색 요 청을 생성하고 검색 요청을 컴퓨팅 기기에 송신한다. 단말 기기는 개인용 컴퓨터, 서버 컴퓨터, 휴대 또는 랩톱 기기, 모바일 기기(예를 들면 휴대폰, 개인 휴 대 정보 단말기(PDA), 미디어 플레이어 등), 다중 처리기 시스템, 전자제품, 미니 컴퓨터, 대형 컴퓨터, 상기 시스템 또는 기기 중 어느 하나를 포함하는 분산 컴퓨팅 환경 등을 포함하나 이에 한정되지 않는다. 컴퓨팅 기기는 개인용 컴퓨터, 서버 컴퓨터, 휴대 또는 랩톱 기기, 다중 처리기 시스템, 전자제품, 미니 컴퓨터, 대형 컴퓨터, 상기 시스템 또는 기기 중 어느 하나를 포함하는 분산 컴퓨팅 환경, 클라우드 플랫폼의 가상 컴퓨터 또는 기타 기기 등을 포함하나 이에 한정되지 않는다. 컴퓨팅 기기가 단말 기기에서의 검색 요청을 수신한 후, 컴퓨팅 기기는 검색 요청의 타겟 검색항에 대한 검색 결과를 생성할 뿐만 아니라, 검색 요청의 타겟 검색항에 따라 컴퓨팅 기기 에서 확장 결과를 획득할 수도 있다. 컴퓨팅 기기는 복수의 역사 검색 기록을 획득하고, 타겟 검색항과 복수의 역사 검색 기록의 역사 검색항을 매칭시키고 매칭되는 역사 검색 기록을 찾는다. 도2는 컴퓨팅 기기가 기타 기기에서 복수의 역사 검색 기록을 수신하는 것을 내타내고, 본 발명에 대 한 구체적인 한정이 아니라, 예시일 뿐이다. 복수의 역사 검색 기록은 컴퓨팅 기기 또는 검색 요청 을 수신하였을 경우 컴퓨팅 기기에 의해 생성될 수도 있다. 복수의 역사 검색 기록은 검색 로그의 로그 데이터에 의해 결정된 것이다. 복수의 역사 검색 기록의 각 역사 검색 기록은 해당 역사 검색 요청에 대한 역사 검색항을 포함한다. 일부 실시예에서, 각 역사 검색항은핵심 엔티티를 더 포함하고, 당해 핵심 엔티티는 로그 데이터의 역사 검색항에 대해 엔티티 인식을 수행하고, 복수의 인식된 엔티티에서 엔티티가 역사 검색항에 나타난 횟수에 따라 결정된 것이다. 후보 또는 추가로, 각 역사 검색항은 당해 역사 검색항에 대응되는 수요의 카테고리를 더 포함한다. 일부 실시예에서, 각 역사 검색 기록은 역사 검색항 이외에, 당해 역사 검색항에 관련된 역사 검색항 및 관련된 역사 검색항의 관련 정도를 더 포함한다. 일부 실시예에서, 컴퓨팅 기기는 복수의 역사 검색 기록에서 타겟 검색항과 같은 역사 검색항을 찾는 다. 예를 들면, 역사 검색항이 \"벤츠 C200은 얼마예요\"인 역사 검색 기록을 찾는다. 일부 실시예에서, 컴퓨팅 기기는 복수의 역사 검색 기록에서 타겟 검색항과의 매칭 정도가 역치 정도보다 높은 역사 검색항을 찾는다. 상기 예시는 본 발명을 설명하기 위한 것일 뿐, 본 발명에 대한 구체적인 한정이 아니다. 컴퓨팅 기기가 타겟 검색항에 매칭되는 제1 역사 검색 기록을 찾았을 경우, 컴퓨팅 기기는 복수의 역 사 검색 기록 사이의 관계를 획득할 수 있고, 컴퓨팅 기기는 복수의 역사 검색 기록 사이의 관계를 기반으로 제1 역사 검색 기록과 관련된 제2 역사 검색 기록을 결정한다. 예를 들면, 제2 역사 검색 기록의 역사 검색항이 \"벤츠 C200의 사진\"인 것을 결정한다. 후보 또는 추가로, 컴퓨팅 기기는 기타의 하나 또는 복수 의 역사 검색 기록을 결정할 수도 있다. 일부 실시예에서, 복수의 역사 검색 기록 사이의 관계는 복수의 역사 검색 기록의 복수의 카테고리 사이의 관련 정도이다. 일부 실시예에서, 복수의 역사 검색 기록 사이의 관계는 복수의 역사 검색 기록 사이의 관련 정도이다. 컴퓨팅 기기는 제2 역사 검색 기록의 역사 검색항을 기반으로 확장 결과를 결정하고, 컴퓨팅 기기 는 확장 결과 및 타겟 검색항에 의해 획득된 타겟 검색 결과 중 적어도 하나를 사용자에 제공한 다. 상기 도2는 본 발명 복수의 실시예의 구현 가능한 환경의 개략도이다. 아래는 도3과 결합하여 본 발명의 일부 실시예에 따른 콘텐츠를 검색하는 방법의 흐름도를 설명한다. 방법은 도2의 컴퓨팅 기기 또는 기타 임의의 적합한 기기에 의해 구현될 수 있다. 단계302에서, 컴퓨팅 기기는 타겟 검색항에 대한 검색 요청을 수신하였는지 여부를 결정한다. 검색 요청을 수신하였을 경우, 단계304에서, 컴퓨팅 기기는 복수의 역사 검색 요청과 관련된 복수의 역사 검색 기록을 획득한다. 여기서, 각 역사 검색 기록은 해당 역사 검색 요청에 대한 역사 검색항을 포함한다. 일부 실시예에서, 복수의 역사 검색 기록의 각 역사 검색 기록은 역사 검색항을 포함한다. 일부 실시예에 서, 복수의 역사 검색 기록의 각 역사 검색 기록은 역사 검색항 및 역사 검색항에 대응되는 핵심 엔티티를 포함한다. 일부 실시예에서, 복수의 역사 검색 기록의 각 역사 검색 기록은 역사 검색항, 역사 검색항에 대응되는 핵심 엔티티 및 해당 수요 카테고리를 포함한다. 일부 실시예에서, 복수의 역사 검색 기록의 각 역사 검색 기록은 역사 검색항, 해당 역사 검색항 및 역사 검색항과 해당 역사 검색항 사이의 관련 정도를 포함 한다. 상기 예시는 본 발명을 설명하기 위한 것일 뿐, 본 발명에 대한 구체적인 한정이 아니다. 일부 실시예에서, 복수의 역사 검색 기록은 컴퓨팅 기기의 기타 서버 또는 컴퓨터에 의해 획득된 것 이다. 일부 실시예에서, 복수의 역사 검색 기록은 컴퓨팅 기기에서 이미 생성되었다. 일부 실시예에 서, 복수의 역사 검색 기록은 사용자가 검색할 경우 컴퓨팅 기기에 의해 온라인으로 생성된 것 이다. 컴퓨팅 기기가 복수의 역사 검색 기록을 획득하는 프로세스는 도4와 결합하여 설명한다. 단계306에서, 컴퓨팅 기기는 복수의 역사 검색 기록에서 타겟 검색항에 매칭되는 제1 역사 검색 기록 을 결정한다. 컴퓨팅 기기는 복수의 역사 검색 기록 및 타겟 검색항을 획득한 후, 복수의 역사 검색 기록에서 복수의 역사 검색 기록에 매칭되는 제1 역사 검색 기록을 찾을 수 있다. 일부 실시예에서, 타겟 검색항과 제1 역사 검색 기록의 역사 검색항은 완전히 같다. 일부 실시예에서, 타겟 검색항이 제1 역사 검 색 기록의 역사 검색항에 매칭되는 정도는 미리 설정된 매칭 역치보다 높다. 상기 예시는 본 발명을 설명하기 위한 것일 뿐, 본 발명에 대한 구체적인 한정이 아니다. 단계308에서, 컴퓨팅 기기는 복수의 역사 검색 기록 사이의 관계를 기반으로, 복수의 역사 검색 기록 에서 제1 역사 검색 기록과 관련된 제2 역사 검색 기록을 결정한다. 일부 실시예에서, 컴퓨팅 기기는 제2 역사 검색 기록을 획득하는 것 이외에, 제1 역사 검색 기록과 관련된 기타 역사 검색 기록을 획득할 수도 있다. 일부 실시예에서, 복수의 역사 검색 기록의 각 역사 검색 기록은 역사 검색항 및 핵심 엔티티를 포함하고, 또는, 각 역사 검색 기록이 역사 검색항과 핵심 엔티티 및 각 역사 검색 기록의 카테고리를 포함할 경우, 복수 의 역사 검색 기록 사이의 관계는 복수의 카테고리 사이의 관련 정도이다. 컴퓨팅 기기는 복수의 역 사 검색 기록 사이의 관계를 기반으로, 제1 역사 검색 기록의 제1 카테고리와 관련된 제2 카테고리를 결정 하고, 컴퓨팅 기기는 복수의 역사 검색 기록에서 제2 카테고리를 구비한 제2 역사 검색 기록을 결정 하고, 제2 역사 검색 기록은 제1 역사 검색 기록의 핵심 엔티티를 포함한다. 상기 방법을 통해, 신속하고 정확 하게 매칭 정도가 높은 제2 역사 검색 기록을 찾을 수 있다. 각 역사 검색 기록의 카테고리에 있어서, 컴퓨팅 기기는 복수의 역사 검색 기록에 포함된 복수의 역 사 검색항을 이용하여 복수의 역사 검색 기록의 카테고리를 결정하고, 컴퓨팅 기기는 카테고리를 기 반으로, 복수의 역사 검색 기록 사이의 관계를 결정한다. 상기 방식을 통해, 더 신속하고 정확하게 카테고 리 및 복수의 역사 검색 기록 사이의 관계를 결정할 수 있다. 카테고리 및 카테고리와 관련된 복수의 역사 검색 기록 사이의 관계를 결정하는 프로세스는 뒤에서 도5과 결정하여 설명한다. 일부 실시예에서, 컴퓨팅 기기가 복수의 역사 검색 기록을 획득하였을 경우 복수의 역사 검색 기록 사이의 관계를 획득할 수 있다. 당해 관계는 복수의 역사 검색 기록의 각 역사 검색 기록과 해당 역 사 검색 기록 사이의 관련 정도를 설명한다. 컴퓨팅 기기는 복수의 역사 검색 기록 사이의 관계를 기 반으로, 제1 역사 검색 기록과 관련된 1개 세트의 역사 검색 기록을 결정할 수 있고, 제1 역사 검색 기록과 1개 세트의 역사 검색 기록의 각 역사 검색 기록은 관련 정도를 구비하고, 컴퓨팅 기기는 관련 정도를 기반으 로, 1개 세트의 역사 검색 기록에서 제2 역사 검색 기록을 결정한다. 당해 방법을 통해, 신속하고 정확하게 매 칭 정도가 높은 제2 역사 검색 기록을 찾을 수 있다. 각 역사 검색 기록과 해당 역사 검색 기록 사이의 관련 정 도를 결정하는 프로세스는 아래에서 도6과 결합하여 설명한다. 단계310에서, 컴퓨팅 기기는 제2 역사 검색 기록에 대응되는 검색 결과를 기반으로, 타겟 검색항에 대한 확장 결과를 결정한다. 일부 실시예에서, 제2 역사 검색 기록을 획득한 후, 컴퓨팅 기기는 제2 역사 검색 기록의 역사 검색항에 대한 검색 결과를 획득한다. 일부 실시예에서, 컴퓨팅 기기는 제2 역사 검색 기록의 역사 검색항을 이용하 여 다시 검색함으로, 당해 검색 결과를 실시간으로 획득한다. 후보 방식으로서, 일부 실시예에서, 컴퓨팅 기기 는 제2 역사 검색 기록의 역사 검색항에 관한 역사 검색 결과를 찾을 수도 있다. 예를 들면, 컴퓨팅 기기 는 검색 로그에서 상기 역사 검색 결과를 찾을 수 있다. 이해해야 할 것은, 상기 예시는 본 발명을 설명하 기 위한 것일 뿐, 본 발명에 대한 구체적인 한정이 아니다, 컴퓨팅 기기는 다양한 방식을 통해 제2 역사 검색 기록의 역사 검색항에 대한 검색 결과를 획득할 수 있다. 그리고, 컴퓨팅 기기는 제2 역사 검색 기록의 검색항에 의해 획득된 검색 결과를 확장 결과로 결정한 다. 당해 방식을 통해, 신속하고 자동적으로 사용자에 적합한 정보를 확장할 수 있다. 일부 실시예에서, 제2 역사 검색 기록을 획득한 후, 컴퓨팅 기기는 제2 역사 검색 기록을 이용하고 검색하 여 제2 역사 검색 기록의 역사 검색항에 대한 역사 검색 결과를 획득할 수 있다. 예를 들면, 컴퓨팅 기기 는 검색 로그에서 당해 역사 검색 결과를 찾을 수 있고, 컴퓨팅 기기가 역사 검색 결과에서 이미 사용자 에 의해 액세스된 일부 역사 검색 결과를 결정하였을 경우, 컴퓨팅 기기는 일부 역사 검색 결과를 확 장 결과로 결정한다. 당해 방식을 통해, 더 정확하게 사용자와 관련된 확장 결과를 결정할 수 있다. 일부 실시예에서, 제2 역사 검색 기록을 획득한 후, 컴퓨팅 기기는 사용자가 제2 역사 검색 기록의 역사 검색항을 검색할 경우 생성된 정보 흐름을 획득할 수도 있다. 일부 실시예에서, 당해 정보 흐름은 로그 기 록에서 기록된, 사용자가 제2 역사 검색 기록의 역사 검색항을 사용하여 검색할 경우 사용자에 제공된 역사 정 보 흐름이다. 역사 정보 흐름은 뉴스, 각 네트워크 정보, 푸시 광고 등일 수 있고, 컴퓨팅 기기는 당해 정 보 흐름을 기반으로, 사용자가 검색할 경우 열람한 정보 흐름을 확장 결과로 결정한다. 예를 들면, 제2 역사 검색 기록을 수행하는 사용자가 정보를 검색할 때 네트워크 서버에서 푸시된 정보 흐름을 검열하 였을 경우, 당해 검열된 정보 흐름을 확장 결과로 한다. 후보 또는 추가로, 검열된 정보 흐름에는 사용자 에 의해 구축된 관심 포인트 태그가 존재해야 한다. 당해 방식을 통해, 확장 결과의 소스를 확장시키고, 더 많은 확장 결과를 제공할 수 있다. 일부 실시예에서, 확장 결과를 획득한 후, 컴퓨팅 기기는 단말 기기에 확장 결과를 제공하 고, 또는 컴퓨팅 기기는 단말 기기에 확장 결과 및 타겟 검색항에 대한 타겟 검색 결과를 제공 한다. 당해 방식을 통해, 사용자는 확장 결과 및 타겟 검색 결과를 신속히 획득할 수 있다. 일부 실시예에서, 사용자에 확장 결과 및 타겟 검색 결과를 제공할 경우, 컴퓨팅 기기는 확장 결과의 제1 점수를 결정하고, 제1 점수는 확장 결과와 제2 역사 검색 기록의 역사 검색항의 관련도를 가리킨다. 당해 점수는 신경망 모델을 통해 생성된 것이다. 신경망 모듈에 확장 결과 중의 각 결과의 사용 자 클릭 분포, 사용자 조회수 예측, 타이틀, 콘텐츠, 길이 및 제2 역사 검색 기록의 역사 검색항 등 정보를 입 력하여 각 결과의 점수를 결정한다. 당해 신경망 모델은 샘플 사용자 클릭 분포, 샘플 사용자 조회수 예측, 샘 플 검색 결과항, 샘플 검색항, 확장 결과의 타이틀, 콘텐츠, 길이 등 정보 및 샘플 점수를 통해 결정된 것이다. 컴퓨팅 기기는 타겟 검색 결과의 제2 점수를 결정할 수도 있고, 제2 점수는 타겟 검색 결과와 타겟 검색항 의 관련도를 가리키고, 상기 신경망 모델에 타겟 검색 결과의 각 결과의 타이틀, 콘텐츠 길이, 타겟 검색항 등 정보를 입력하여 타겟 검색 결과를 결정하는 점수이기도 하다. 컴퓨팅 기기는 제1 점수 및 제2 점수를 기반으로, 확장 결과 및 타겟 검색 결과의 우선 순위를 결정 하고, 컴퓨팅 기기는 우선 순위에 따라 확장 결과 및 타겟 검색 결과를 제공한다. 후보 또는 추가로, 컴퓨팅 기기는 확장 결과의 디스플레이에 일부 한정 조건을 설정할 수도 있다. 예를 들면 제공된 미 리 설정된 수량의 결과에는 제1 수량의 확장 결과만 있을 수 밖에 없고, 또는 확장 결과의 연속 수량 등을 설정한다. 상기 예시는 본 발명을 설명하기 위한 것일 뿐, 본 발명에 대한 구체적인 한정이 아니다. 당업 자는 수요에 따라 설정할 수 있다. 상기 방법을 통해, 사용자에 관련도가 더 높고 더 정확한 타겟 검색 결과 및 추천 결과를 제공할 수 있다. 일부 실시예에서, 컴퓨팅 기기는 제2 역사 검색 기록에 대응되는 검색 결과를 획득하는 타겟 데이터 소스 를 구축할 수도 있다. 일부 실시예에서, 당해 타겟 데이터 소스는 기타 기기에 의해 생성될 수 있고, 컴퓨팅 기 기는 기타 기기에서 당해 타겟 데이터 소스를 획득한다. 타겟 데이터 소스를 구축하여, 타겟 데이터 소스 의 품질을 향상시킬 수 있음으로, 사용자에 고품질 콘텐츠를 제공할 수 있다. 일부 실시예에서, 컴퓨팅 기기는 타겟 데이터 소스를 구축할 경우, 먼저 복수의 최초 데이터 소스의 복수 의 파일의 점수를 결정하고, 각 파일의 점수는 파일의 품질을 가리킨다. 파일을 채점하는 방식은, 자동 링크 분 석 방법을 기반으로 하는 사이트 채점 및 전문가에 의해 표시된 사이트 채점을 포함하는 미디어 사이트 채점; 전문가에 의해 표시된 작가 등록, 빅데이터를 통해 분석된 작가 인지도, 좋아요, 리뷰 등 독자의 피드백 정보를 통해 종합해 낸 작가 선호도를 포함하는 언론가 채점; 및 미디어 텍스트, 사진, 비디오의 풍부 정도를 포함한다. 그리고, 컴퓨팅 기기는 복수의 파일에서 점수가 역치 점수를 초과하는 파일을 타겟 데이터 소스의 파일로 결정한다. 당해 방식을 통해, 절단 동작을 통해 우수한 품질의 후보 결과를 획득한다. 상기에서는 도3을 결합하여 본 발명의 일부 실시예에 따른 콘텐츠를 검색하는 방법의 흐름도를 설명하였고, 아래는 도4와 결합하여 도3의 단계304에서 복수의 역사 검색 기록을 획득하는 프로세스를 상세하게 설명한다. 도4는 본 발명의 일 실시예에 따른 복수의 역사 검색 기록을 획득하는 방법의 흐름도이다. 도4 의 방법은 도2의 컴퓨팅 기기 또는 기타 임의의 적합한 기기로 수행될 수 있다. 단계402에서, 컴퓨팅 기기는 검색 로그에서 1개 세트의 역사 검색 요청에 대한 1개 세트의 역사 검색항을 결정한다. 통상적으로, 검색 로그에는 모든 사용자의 검색 로그항이 저장되어 있을 수 있다. 따라서, 검색 로그 에서 1개 세트의 역사 검색항을 결정할 수 있다. 단계404에서, 컴퓨팅 기기는 1개 세트의 역사 검색항에서 복수의 엔티티를 결정하고, 각 엔티티는 해당 역 사 검색항에 관련된 대상을 식별한다. 컴퓨팅 기기는 1개 세트의 역사 검색항의 각 역사 검색항에 대해 엔 티티 인식을 수행한다. 예를 들면, 개체명 인식 방법을 통해 엔티티를 인식한다. 단계406에서, 컴퓨팅 기기는 1개 세트의 역사 검색항에서 복수의 엔티티가 나타난 횟수를 기반으로, 복수 의 엔티티에서 핵심 엔티티를 결정한다. 일부 실시예에서, 컴퓨팅 기기는 1개 세트의 역사 검색항에서 단일 엔티티를 포함한 역사 검색항 세트를 결정하고, 컴퓨팅 기기는 역사 검색항 세트에서 적어도 하나의 역사 검색항을 결정하고, 적어도 하나의 역 사 검색항 세트에 포함된 단일 엔티티가 역사 검색항에서 나타난 횟수는 제1 역치 횟수를 초과한다. 컴퓨팅 기 기는 적어도 하나의 역사 검색항에 포함된 단일 엔티티를 핵심 엔티티로 결정한다. 당해 방법을 통해, 신 속하고 정확하게 핵심 엔티티를 결정할 수 있다. 예를 들면, 1개 세트의 역사 검색항에서 엔티티 \"벤츠 C200\"을 역사 검색항으로 하는 수량이 4이고, 역치 횟수 가 3일 경우, \"벤츠 C200\"를 핵심 엔티티로 할 수 있다. 일부 실시예에서, 핵심 엔티티를 결정할 경우, 컴퓨팅 기기는 1개 세트의 역사 검색항에서 복수의 엔티티 가 나타난 횟수를 기반으로, 복수의 엔티티에서 나타난 횟수가 제2 역치 횟수를 초과한 고주파 엔티티를 결정한 다. 컴퓨팅 기기는 해당 역사 검색항에서 고주파 엔티티의 가중치가 역치 가중치를 초과하는 것을 결정하 고, 고주파 엔티티를 핵심 엔티티로 결정하며, 여기서 가중치는 해당 역사 검색항에서 고주파 엔티티의 중요성 을 가리킨다. 상기 방법을 통해, 신속하고 정확하게 핵심 엔티티를 결정할 수 있다. 일부 실시예에서, 컴퓨팅 기기는 해당 역사 검색항에서 고주파 엔티티의 위치를 통해 가중치를 결정한다. 일부 실시예에서, 컴퓨팅 기기는 고주파 엔티티의 길이와 해당 역사 검색항의 길이 사이의 관계에 따라 가 중치를 결정한다. 일부 실시예에서, 컴퓨팅 기기는 상기 방법의 조합 및 임의의 기타 적합한 정보를 이용 하여 가중치를 결정할 수도 있다. 상기 예시는 본 발명에 대한 구체적인 한정이 아니라, 본 발명을 설명하기 위 한 것 뿐이다. 상기 방식에 따라 조합하거나 또는 기타 방식으로 가중치를 획득할 수도 있다. 상기 방법을 통해, 정확하고, 신속하게 가중치를 결정할 수 있다. 단계408에서, 컴퓨팅 기기는 1개 세트의 역사 검색항에서 핵심 엔티티를 포함한 복수의 역사 검색항을 선 택한다. 핵심 엔티티를 결정한 후, 컴퓨팅 기기는 핵심 엔티티를 이용하여 핵심 엔티티만 포함하는 역사 검색항을 결정한다. 단계410에서, 컴퓨팅 기기가 복수의 역사 검색항 및 핵심 엔티티에 따라 복수의 역사 검색 기록을 생 성하는 바, 복수의 역사 검색 기록의 각 역사 검색 기록은 적어도 역사 검색항 및 해당 핵심 엔티티를 포 함한다. 일부 실시예에서, 상기 복수의 역사 검색 기록은 기타 기기에 의해 검색 로그에 따라 생성될 수 있고, 컴 퓨팅 기기는 기타 기기에서 복수의 역사 검색 기록을 수신한다. 상기 방법을 통해, 검색 로그에서 신속하고 정확하게 핵심 엔티티를 포함한 복수의 역사 검색 기록을 결정할 수 있음으로, 추천 결과가 더 정확하도록 할 수 있다. 상기에서는 도4를 결합하여 본 발명의 일부 실시예에 따른 콘텐츠를 획득하는 방법의 흐름도를 설명하였고, 아래는 도5와 결합하여 도3의 단계308에서 역사 검색 기록 사이의 카테고리 및 관계를 결정하는 프 로세스를 상세하게 설명한다. 도5는 본 발명의 일 실시예에 따른 역사 검색 기록의 카테고리 및 관계를 결정하 는 방법의 흐름도이다. 도5의 방법은 도2의 컴퓨팅 기기 또는 기타 임의의 적합한 기기를 사용 하여 수행될 수 있다. 단계502에서, 복수의 역사 검색 기록의 각 역사 검색 기록은 역사 검색항 이외에, 핵심 엔티티를 더 포함 한다. 컴퓨팅 기기는 복수의 역사 검색항에서 해당 핵심 엔티티를 제거하고, 복수의 역사 검색항 각각의 나머지 부분을 획득한다. 예를 들면, 복수의 역사 검색항이 \"벤츠 C200은 얼마예요\", \"벤츠 C200의 가격\", \"벤 츠 C200의 사진\"일 경우, 핵심 엔티티는 \"벤츠 C200\"이고, 나머지 부분은 \"얼마예요\", \"…의 가격\", \"…의 사진\"이다. 단계504에서, 컴퓨팅 기기는 적어도 나머지 부분을 기반으로 복수의 역사 검색항과 관련된 수요 정보를 결 정한다. 컴퓨팅 기기는 나머지 부분을 사용자의 수요 정보로 결정한다. 예를 들면, 나머지 부분 \"얼마예요?\",\"…의 가격\", \"…의 사진\"을 수요 정보로 결정한다. 단계506에서, 컴퓨팅 기기는 수요 정보를 기반으로 복수의 역사 검색 기록의 카테고리를 결정한다. 일부 실시예에서, 컴퓨팅 기기는 클러스터 동작을 사용하여 수요 정보를 처리하여 복수의 역사 검색 기록 의 카테고리를 결정한다. 예를 들면, k-means 방법을 사용하여 수요 정보를 처리한다. 일부 실시예에서, 컴퓨팅 기기는 기타 적합한 방식을 통해 수요 정보의 카테고리를 결정할 수도 있다. 예를 들면, 인공으로 분류한다. 상기 예시는 본 발명을 설명하기 위한 것일 뿐, 본 발명에 대한 구체적인 한정이 아니다. 상기 방식을 통해, 복수의 역사 검색항의 수요 카테고리를 정확하게 결정할 수 있고, 복수의 역사 검색 기록에 대한 분류를 구현할 수도 있다. 단계508에서, 컴퓨팅 기기는 검색 로그에서 복수의 역사 검색항에 대한 검색 시간 또는 검색 결과를 결정 한다. 각각의 카테고리를 결정한 후, 컴퓨팅 기기는 각 카테고리 사이의 관련 관계를 결정해야 한다. 따라 서, 컴퓨팅 기기는 검색 로그에서 복수의 역사 검색항에 대한 로그 기록을 다시 결정한 후, 당해 로그 기록의 검색 시간 및 검색 결과를 결정한다. 단계510에서, 컴퓨팅 기기는 검색 시간 또는 검색 결과를 기반으로, 복수의 카테고리 사이의 관련 정도를 결정한다. 컴퓨팅 기기는 로그에서 같은 사용자가 미리 설정된 시간 내에 부동한 카테고리를 구비한 2번의 역사 검색 기록을 당해 2개의 카테고리 사이의 관련 정도가 1이 추가된 것으로 결정하고, 후보 또는 추가로, 2 번의 역사 검색 기록의 역사 검색항의 핵심 엔티티는 같다. 예시에서, 사용자가 미리 설정된 시간 내에 \" 벤츠 C200의 가격\" 및 \"벤츠 C200의 사진\"을 검색하였을 경우, \"가격\"에 대응되는 카테고리와 \"사진\"에 대응되 는 카테고리 사이의 관련 정도가 1인 것을 결정할 수 있다. 이리하여, 복수의 카테고리 사이의 관련 정도를 결 정할 수 있다. 단계512에서, 컴퓨팅 기기는 복수의 카테고리 사이의 관련 정도를 기반으로, 복수의 역사 검색 기록 사이의 관계를 결정한다. 각 카테고리 사이의 관련 정도를 통해, 복수의 역사 검색 기록 사이의 관계를 결 정할 수 있다. 예를 들면, 1개의 역사 검색 기록이 제1 카테고리를 구비할 경우, 제1 카테고리를 통해 당해 관 련 정도가 비교적 높은 하나 또는 복수의 기타 카테고리를 결정할 수 있고, 당해 제1 역사 검색 기록의 핵심 엔 티티를 통해 하나 또는 복수의 기타 카테고리를 결합하여 당해 역사 검색 기록과 관련된 기타 역사 검색 기록을 결정할 수 있다. 상기 방법을 통해, 신속하고 정확하게 복수의 카테고리 사이의 관련 정도를 결정함으로, 검색할 때 추천 결과의 정확성을 확보할 수 있다. 상기에서는 도5를 결합하여 본 발명의 일부 실시예에 따른 역사 검색 기록의 카테고리 및 관계를 결정하는 방법 의 흐름도를 설명하였고, 아래는 도6와 결합하여 도3의 단계308에서 역사 검색 기록 사이의 관계를 결정하 는 프로세스를 상세하게 설명한다. 도6은 본 발명의 일 실시예에 따른 역사 검색 기록 사이의 관계를 결정하는 방법의 흐름도이다. 도6의 방법은 도2의 컴퓨팅 기기 또는 기타 임의의 적당한 기기에 의해 수 행될 수 있다. 단계602에서, 컴퓨팅 기기는 검색 로그에서 복수의 역사 검색항에 대한 검색 시간 또는 검색 결과를 결정 한다. 검색 로그에는 사용자의 많은 검색 로그항이 저장되어 있고, 당해 검색 로그항을 통해 복수의 역사 검색 항의 검색 시간 및 검색 결과를 결정할 수 있다. 단계604에서, 컴퓨팅 기기는 검색 시간 또는 검색 결과를 기반으로, 복수의 역사 검색 기록 사이의 관련 정도를 결정한다. 컴퓨팅 기기는 같은 사용자가 미리 설정된 시간 내에 2개의 검색항을 수행하거나 또는 2개 검색항의 검색 결과에 같은 결과항을 구비한 것을 기반으로 2개의 검색 기록 사이의 관련성을 결정한 다. 예를 들면, 사용자가 미리 설정된 시간 내에 2개의 역사 검색항을 수행할 경우, 2개의 검색항을 포함 한 2개의 역사 검색 기록 사이의 관련 정도를 1씩 증가시킨다. 2개의 역사 검색항에 대응되는 검색 결과에 미리 설정된 수량의 같은 결과항이 있을 경우, 2개의 역사 검색 기록 사이의 관련 정도를 1씩 증가시킬 수 있다. 상 기 예시는 본 발명에 대한 구체적인 한정이 아니라, 본 발명을 설명하기 위한 것일 뿐이다. 후보 또는 추가로, 관련 정도를 통해 한정할 수 있고, 위에서만 2개의 역사 검색항이 관련되는 것을 결정할 경우, 2개의 역사 검색 항이 속하는 분야를 통해 당해 관련 정도를 결정해야 한다. 단계606에서, 컴퓨팅 기기는 복수의 역사 검색 기록 사이의 관련 정도를 기반으로, 복수의 역사 검색 기록 사이의 관계를 결정한다. 컴퓨팅 기기는 결정된 관련 정도를 기반으로, 복수의 역사 검색 기록 사이의 관련 관계를 결정한다. 일부 실시예에서, 복수의 역사 검색 기록 및 복수의 역사 검색 기록 사이의 관련 관계는 기타 기기에 의해 생성될 수 있고, 컴퓨팅 기기는 기타 기기에서 획득한다. 일부 실시예에서, 사용자의 검색 및 열람 시퀀스에 따라, 중요한 키워드를 추출하고, 사용자의 관심 포인트 태 그를 구축할 수 없다. 당해 방법을 통해, 신속하고 정확하게 복수의 역사 검색 기록 사이의 관련 관계를 결정할 수 있어, 신속하고 정 확하게 확장 결과를 결정할 수 있다. 상기에서는 도6을 결합하여 본 발명의 일부 실시예에 따른 역사 검색 기록 사이의 관계를 결정하는 방법의 흐름도를 설명하였고, 아래는, 도7과 결합하여 본 발명의 일 실시예에 따른 콘텐츠를 검색하는 장치의 블 록도를 상세하게 설명한다. 장치는 우수한 품질의 결과 선별 모듈, 관련 수요 마이닝 모듈, 추천 결과 매칭 모듈 및 검색 결과와 추천 결과 혼합 정렬 모듈을 포함한다. 사용자가 검색어를 제출한 후, 관련 수요 마이닝 모듈 은 최초 검색어를 기반으로, 관련 수요를 마이닝하고, 관련 수요의 구체적인 표현 형식은 검색어 형식일 수 있고, 키워드 세트, 시맨틱 벡터 등 형식일 수도 있다. 마이닝된 관련 수요를 기반으로, 추천 결과 매칭 모 듈은 우수한 품질의 결과 선별 모듈에 의해 선별된 결과를 검색하고, 관련 수요를 만족하는 자원을 찾아 추천 결과로 하고; 마지막으로 검색 결과와 추천 결과 혼합 정렬 모듈은 추천 결과와 검색 엔진에 의 해 검색된 정상 결과를 혼합 정렬하고, 최종 결과 리스트를 형성하고, 사용자에 리턴한다. 관련 수요 마이닝 모듈은 사용자의 최초 검색어를 기반으로 관련 수요를 마이닝하고, 사용된 기술 방법은 아래의 몇 종을 포함한다. 콘텐츠를 기반으로 하는 마이닝 방법은, 먼저 검색항의 콘텐츠를 분할하고, 검색 핵 심 엔티티 및 수요 차원과 같은 2종의 개념을 정의한다. 검색의 핵심 주체는 검색 프로세스에서 사용자가, 검색 시퀀스에서 추출할 수 있는 주체 문자열이고, 당해 주체 문자열은 사용자의 핵심 요구를 나타낼 수 있다. 예를 들면 검색항이 \"벤츠 C200은 얼마예요\"일 경우, 핵심 주체는 \"벤츠 C200\"이고, \"얼마예요\"는 사용자가 핵심 주 체에 대한 수요의 특성화이고, 당해 수요는 가격을 문의하는 것이다. 주체인 \"벤츠 C200\"에 대해 다양한 수요 차원이 존재한다. 예를 들면, 벤츠 C200의 사진, 벤츠 C200의 성능 및 기름 소모, 벤츠 C200의 판매량 등이 존 재한다. 콘텐츠를 기반으로 마이닝된 사상은 핵심 엔티티가 변하지 않도록 보장하는 경우, 사용자에 검색항 자 체 차원과 강하게 관련된 부동한 수요 차원의 문장을 추천한다. 핵심 주체를 마이닝 할 경우, 먼저 검색 로그에서 역사 검색항 세트를 획득하고, 개체명 인식(NER) 및 고주파 서브 문자열을 통계하는 방식을 통해 핵심 엔티티를 결정하고, 핵심 엔티티는, 1) 핵심 엔티티 자체가 검색항으 로서 비교적 높은 수량을 구비하고; 2) 핵심 엔티티가 서브 문자열로서 복수의 역사 검색항에 자주 나타나고; 3) 주체 문자열을 포함한 모든 검색항에서, 주체 문자열의 평균 용어의 가중치 비율이 비교적 높은; 3개의 조건 을 만족한다. 수요 차원을 마이닝할 경우, 수요 차원은 핵심 엔티티의 속성이고, 같은 핵심 엔티티의 검색항을 모으고, 핵심 엔티티를 제거한 나머지 문자열을 수요로 한다. 초보적으로 획득된 수요 서브 문자열의 부동한 설명은 같은 수 요일 수 있다. 예를 들면, \"벤츠 C200은 얼마예요\" 와 \"벤츠 C200의 가격\"의 수요는 같다. 클러스터 방법을 통 해 수요 서브 문자열을 클러스터하고, 부동한 수요 카테고리에 대한 분할을 구현한다. 또한 부동한 카테고리의 동시 출현 관련을 통해, 부동한 차원 사이의 관련 행렬을 계한하여, 차원 사이의 긴밀 관계를 나타낸다. 역사 검색항은 핵심 엔티티 및 수요 정보의 분할, 마이닝된 수요 카테고리 관련 행렬을 통해, 강한 관련 수요의 검색항을 현재 검색항의 관련 확장 수요 세트로 한다. 사용자 검색 빅데이터의 마이닝 방법에 따라 확장 역사 검색항을 결정할 수도 있다. 모든 사용자에 의해 검색된 검색항으로 노드에 한 장의 관련도를 구축하고, 여기서 도면의 에지는, 검색 행위(동시 출현, 같은 검색 결과를 구비한 검색항 등) 및 분야 관련(같은 분야, 강한 관련을 구비한 부동한 분야)을 포함한다. 도면의 마이닝 방법 을 기반으로, 현재 검색항과 강하게 관련된 검색항 세트를 마이닝하고, 현재 검색항의 관련 확장 수요로 한다. 또한 사용자의 검색 및 열람 시퀀스에 따라, 핵심 키워드를 추출하고, 사용자 관심 포인트 태그를 구축한다. 추천 결과 매칭 모듈은 마이닝된 관련 수요를 기반으로, 데이터 베이스에서 관련 수요를 만족할 수 있는 결과를 매칭하고, 사용된 기술 방법은 아래의 몇 종을 포함한다. 검색 시스템의 검색을 기반으로 하는 매칭 방 법은, 확장 검색항을 사용하여 검색 시스템을 검색하고, 확장 검색항에 매칭되는 만족한 결과를 획득하고, 관련 강도에 따라 모든 결과를 통합하여, 검색항의 추천 결과로 한다. 사용자 검색 빅데이터를 기반으로 하는 매칭 방법은, 동시 출현 등 사용자 행위에 따라, 확장 검색항에 관련된 문장을 마이닝하고, 검색항의 추천 결과로 한 다. 사용자 검색 및 정보 흐름 열람 빅데이터를 기반으로 하는 매칭 방법은, 사용자 검색 및 정보 흐름 열람 데 이터에서 사용자의 관심 포인트 태그를 마이닝 및 통계하고, 관심 포인트 매칭을 통해 문장을 리콜하고, 사용자 의 맞춤형 추천 결과로 한다. 타겟 검색 결과 및 확장 결과 혼합 정렬 모듈은 주로 검색 결과 채점, 추천 결과 채점, 혼합 정렬을 포함 한다. 검색 결과 채점은, 주로 역사 클릭 분포, 사용자 조회수 예측 등 특징의 융합 모델을 기반으로 채점한다. 추천 결과 채점은 역사 클릭 분포, 사용자 조회수 예측을 기반으로 채점한다. 혼합 정렬할 경우, 검색 결과 채점, 추천 결과 채점을 기반으로 높은 데부터 낮은 데까지의 순서로 정렬한다. 또한, 다양성 제어도 수행하는바, 추천 결과 밀도를 기반으로 하는 다양성 제어, 및 같은 테마의 추천 결과 밀 도의 다양성 제어를 포함한다. 우수한 품질의 결과 선별 모듈은 일부 기본 품질 요소를 기반으로, 파일 자원을 채점하고, 채점을 기반으 로 절단을 수행하고, 우수한 품질의 후보 결과를 획득한다. 기본 품질 요소는, 자동 링크 분석 방법을 기반으로 하는 사이트 채점 및 전문가에 의해 표시된 사이트 채점을 포함하는 미디어 사이트 채점; 전문가에 의해 표시된 작가 등록, 빅데이터를 통해 분석된 작가 인지도, 좋아요, 리뷰 등 독자의 피드백 정보를 통해 종합해 낸 작가 선호도를 포함하는 언론가 채점; 및 미디어 텍스트, 사진, 비디오의 풍부 정도를 포함한다. 도8은 본 발명의 실시예에 따른 콘텐츠를 검색하는 장치의 개략적인 블록도이다. 도8에 도시된 바와 같이, 장치는, 타겟 검색항에 대한 검색 요청을 수신한 것에 응답하여, 복수의 역사 검색 요청에 관련된 복수의 역사 검색 기록을 획득하도록 구성된 역사 검색 기록 획득 모듈을 포함하고, 각 역사 검색 기록은 해당 역 사 검색 요청에 대한 역사 검색항을 포함한다. 장치는, 복수의 역사 검색 기록에서 타겟 검색항에 매칭되 는 제1 역사 검색 기록을 결정하도록 구성된 타겟 검색항 매칭 모듈을 더 포함한다. 장치는, 복수의 역사 검색 기록 사이의 관계를 기반으로, 복수의 역사 검색 기록에서 제1 역사 검색 기록과 관련되는 제2 역사 검색 기록을 결정하도록 구성된 역사 검색 기록 결정 모듈을 더 포함한다. 장치는, 제2 역사 검색 기 록에 대응되는 검색 결과를 기반으로, 타겟 검색항에 대한 확장 결과를 결정하도록 구성된 확장 결과 결정 모듈 을 더 포함한다. 일부 실시예에서, 역사 검색 기록 획득 모듈은, 검색 로그에서 1개 세트의 역사 검색 요청에 대한 1개 세 트의 역사 검색항을 결정하도록 구성된 제1 역사 검색항 결정 모듈; 1개 세트의 역사 검색항에서 복수의 엔티티 를 결정하도록 구성된 엔티티 결정 모듈 - 각 엔티티는 해당 역사 검색항에 관련된 대상을 식별함 - ; 1개 세트 의 역사 검색항에서 복수의 엔티티가 나타난 횟수를 기반으로, 복수의 엔티티에서 핵심 엔티티를 결정하도록 구 성된 제1 핵심 엔티티 결정 모듈; 1개 세트의 역사 검색항에서 핵심 엔티티를 포함한 복수의 역사 검색항을 선 택하도록 구성된 선택 모듈; 및 복수의 역사 검색항 및 핵심 엔티티에 따라 복수의 역사 검색 기록을 생성하도 록 구성된 생성 모듈; 을 포함한다. 일부 실시예에서, 제1 핵심 엔티티 결정 모듈은, 1개 세트의 역사 검색항에서 단일 엔티티를 포함한 역사 검색 항 세트를 결정하도록 구성된 역사 검색항 세트 결정 모듈; 역사 검색항 세트에서 적어도 하나의 역사 검색항을 결정하도록 구성된 제2 역사 검색항 결정 모듈 - 적어도 하나의 역사 검색항 세트에 포함된 단일 엔티티가 역사 검색항에서 나타난 횟수는 제1 역치 횟수를 초과함 - ; 및 적어도 하나의 역사 검색항에 포함된 단일 엔티티를 핵심 엔티티로 결정하도록 구성된 단일 엔티티에 대한 핵심 엔티티 결정 모듈; 을 포함한다. 일부 실시예에서, 핵심 엔티티 결정 모듈은, 1개 세트의 역사 검색항에서 복수의 엔티티가 나타난 횟수를 기반 으로, 복수의 엔티티에서 나타난 횟수가 제2 역치 횟수를 초과한 고주파 엔티티를 결정하도록 구성된 고주파 엔 티티 결정 모듈; 및 해당 역사 검색항에서 고주파 엔티티의 가중치가 역치 가중치를 초과하는 것을 결정하고, 고주파 엔티티를 핵심 엔티티로 결정하도록 구성된 제2 핵심 엔티티 결정 모듈 - 가중치는 해당 역사 검색항에 서 고주파 엔티티의 중요성을 가리킴 - ; 을 포함한다. 일부 실시예에서, 제2 핵심 엔티티 결정 모듈은, 해당 역사 검색항에서 고주파 엔티티의 위치 결정하도록 구성 된 위치 결정 모듈 및 고주파 엔티티의 길이와 해당 역사 검색항의 길이 사이의 관계를 결정하도록 구성된 길이 관계 결정 모듈; 을 포함한다. 일부 실시예에서, 장치는 복수의 역사 검색 기록에 포함된 복수의 역사 검색항을 기반으로, 복수의 역사 검색 기록의 카테고리를 결정하도록 구성된 카테고리 결정 모듈; 및 카테고리를 기반으로, 복수의 역사 검색 기 록 사이의 관계를 결정하도록 구성된 역사 검색 기록 관계 결정 모듈; 을 더 포함한다. 일부 실시예에서, 복수의 역사 검색 기록의 각 역사 검색 기록은 핵심 엔티티를 더 포함하고, 카테고리 결정 모 듈은, 복수의 역사 검색항에서 해당 핵심 엔티티를 제거하여, 복수의 역사 검색항 각각의 나머지 부분을 획득하 도록 구성된 나머지 부분 결정 모듈; 적어도 나머지 부분을 기반으로 복수의 역사 검색항과 관련된 수요 정보를 결정하도록 구성된 수요 정보 결정 모듈; 및 수요 정보를 기반으로 복수의 역사 검색 기록의 카테고리를 결정하 도록 구성된 역사 검색 기록 카테고리 결정 모듈; 을 포함한다. 일부 실시예에서, 복수의 역사 검색 기록은 복수의 카테고리를 구비하고, 역사 검색 기록 관계 결정 모듈은, 검 색 로그에서 복수의 역사 검색항에 대한 검색 시간 또는 검색 결과를 결정하도록 구성된 제1 검색 시간 또는 검 색 결과 결정 모듈; 검색 시간 또는 검색 결과를 기반으로, 복수의 카테고리 사이의 관련 정도를 결정하도록 구 성된 관련 정도 결정 모듈; 및 복수의 카테고리 사이의 관련 정도를 기반으로, 복수의 역사 검색 기록 사이의 관계를 결정하도록 구성된 관련 정도를 기반으로 하는 관계 결정 모듈; 을 포함한다. 일부 실시예에서, 장치는, 검색 로그에서 복수의 역사 검색항에 대한 검색 시간 또는 검색 결과를 결정하 도록 구성된 제2 검색 시간 또는 검색 결과 구성 모듈; 검색 시간 또는 검색 결과를 기반으로, 복수의 역사 검 색 기록 사이의 관련 정도를 결정하도록 구성된 관련 정도 결정 모듈; 및 복수의 역사 검색 기록 사이의 관련 정도를 기반으로, 복수의 역사 검색 기록 사이의 관계를 결정하도록 구성된 관련 정도를 기반으로 하는 관계 결 정 모듈; 을 더 포함한다. 일부 실시예에서, 복수의 역사 검색 기록의 각 역사 검색 기록은 핵심 엔티티 및 각 역사 검색 기록의 카테고리 를 더 포함하고, 여기서 역사 검색 기록 결정 모듈은, 복수의 역사 검색 기록 사이의 관계를 기반으로, 제 1 역사 검색 기록의 제1 카테고리와 관련된 제2 카테고리를 결정하도록 구성된 제2 카테고리 결정 모듈; 및 복 수의 역사 검색 기록에서 제2 카테고리를 구비한 제2 역사 검색 기록을 결정하도록 구성된 카테고리를 구비한 제2 역사 검색 기록 결정 모듈 - 제2 역사 검색 기록은 제1 역사 검색 기록의 핵심 엔티티를 포함함 - ; 을 포 함한다. 일부 실시예에서, 역사 검색 기록 결정 모듈은, 복수의 역사 검색 기록 사이의 관계를 기반으로, 제1 역사 검색 기록과 관련된 1개 세트의 역사 검색 기록을 결정하도록 구성된 1개 세트의 역사 검색 기록 결정 모듈 - 제1 역사 검색 기록과 1개 세트의 역사 검색 기록의 각 역사 검색 기록은 관련 정도를 구비함 - ; 및 관련 정도 를 기반으로, 1개 세트의 역사 검색 기록에서 제2 역사 검색 기록을 결정하도록 구성된 관련 정도를 기반으로 하는 역사 검색 기록 결정 모듈; 을 포함한다. 일부 실시예에서, 확장 결과 결정 모듈은 제2 역사 검색 기록의 역사 검색항에 대한 검색 결과를 획득하도 록 구성된 제1 검색 결과 획득 모듈; 및 검색 결과를 확장 결과로 결정하도록 구성된 검색 결과에 대한 확장 결 과 결정 모듈; 을 포함한다. 일부 실시예에서, 확장 결과 결정 모듈은, 제2 역사 검색 기록의 역사 검색항에 대한 역사 검색 결과를 획 득하도록 구성된 제2 검색 결과 획득 모듈; 역사 검색 결과에서 이미 사용자에 의해 액세스된 부분 역사 검색 결과를 결정하도록 구성된 부분 역사 검색 결과 결정 모듈; 및 부분 역사 검색 결과를 확장 결과로 결정하도록 구성된 부분 역사 검색 결과 확장 모듈; 을 포함한다. 일부 실시예에서, 확장 결과 결정 모듈은, 사용자가 제2 역사 검색 기록의 역사 검색항을 검색할 경우 생성된 정보 흐름을 획득하도록 구성된 정보 흐름 모듈; 및 정보 흐름을 기반으로, 확장 결과를 결정하도록 구성된 정 보 흐름에 대한 확장 결과 모듈; 을 포함한다. 일부 실시예에서, 장치는, 확장 결과를 제공하도록 구성된 제1 제공 장치; 및 확장 결과 및 타겟 검색항에 대한 타겟 검색 결과를 제공하도록 구성된 제2 제공 장치; 중 적어도 하나를 더 포함한다. 일부 실시예에서, 제2 제공 장치는, 확장 결과의 제1 점수를 결정하도록 구성된 제1 점수 결정 모듈 - 제1 점수 는 확장 결과와 제2 역사 검색 기록의 역사 검색항의 관련도를 가리킴 - ; 타겟 검색 결과의 제2 점수를 결정하 도록 구성된 제2 점수 결정 모듈 - 제2 점수는 타겟 검색 결과와 타겟 검색항의 관련도를 가리킴; 제1 점수 및 제2 점수를 기반으로, 확장 결과 및 타겟 검색 결과의 우선 순위를 결정하도록 구성된 우선 순위 결정 모듈; 및 우선 순위를 기반으로 확장 결과 및 타겟 검색 결과를 제공하도록 구성된 확장 결과 및 검색 결과 제공 모듈; 을 포함한다. 일부 실시예에서, 장치는, 제2 역사 검색 기록에 대응되는 검색 결과를 획득하는 타겟 데이터 소스를 구축 하도록 구성된 타겟 데이터 소스 구축 모듈을 더 포함한다. 일부 실시예에서, 타겟 데이터 소스 구축 모듈은, 복수의 최초 데이터 소스의 복수의 파일 점수를 결정하도록 구성된 파일 점수 결정 모듈 - 각 파일의 점수는 파일의 품질을 가리킴 - ; 및 복수의 파일에서 점수가 역치 점 수를 초과한 파일을 타겟 데이터 소스의 파일로 결정하도록 구성된 타겟 데이터 소스 파일 결정 모듈; 을 포함 한다. 도9는 본 발명의 실시예를 수행하는 전자 기기의 개략적인 블록도이다. 기기는 도1의 단말 기기 및 컴퓨팅 기기를 구현하는데 사용될 수 있다. 도시된 바와 같이, 기기는, 읽기 전용 메모리 (ROM)에 저장되어 있는 컴퓨터 프로그램 명령 또는 저장 유닛에서 랜덤 엑세스 메모리(RAM)에로 로딩된 컴퓨터 프로그램 명령에 따라, 각 적당한 동작 및 처리를 수행할 수 있는 컴퓨팅 유닛을 포함한다. RAM에는, 기기의 동작에 수요되는 각 프로그램 및 데이터를 더 저장할 수 있다. 컴퓨팅 유닛, ROM 및 RAM 은 버스를 통해 서로 연결된다. 입력/출력(I/O) 인터페이스도 버스에 연결된다.I/O 인터페이스에 연결되는 기기 중의 복수의 부품은, 키보드, 마우스 등과 같은 입력 유닛; 각 유형의 디스플레이, 스피커 등과 같은 출력 유닛; 자기 디스크, 광 디스크 등과 같은 저장 유닛; 및 네트워크 카드, 모뎀, 무선 통신 송수신기 등과 같은 통신 유닛; 을 포함한다. 통신 유닛은 기기 가 인터넷과 같은 컴퓨터 네트워크 및/또는 각 텔레콤 네트워크를 통해, 기타 기기와 정보/테이터를 교환 하는 것을 허락한다. 컴퓨팅 유닛은 각 처리 및 계산 기능을 구비한 범용/전용 처리 컴포넌트일 수 있다. 컴퓨팅 유닛의 일부 예시는 중앙 처리 장치(CPU), 그래프 처리 장치(GPU), 각 전용 인공지능 계산 칩, 각 기계 학습 모델 알고 리즘을 운행하는 컴퓨팅 유닛, 디지털 신호 처리 장치(DSP), 임의의 적합한 프로세서, 제어기 및 마이크로 제어 기 등을 포함하나 이에 한정되지 않는다. 컴퓨팅 유닛은 상기 설명한 각 방법 및 처리를 수행한다. 예를 들면, 방법 300, 400, 500 및 600을 수행한다. 예를 들면, 일 실시예에서, 방법 300, 400, 500 및 600은 컴퓨 터 소프트웨어 프로그램으로 구현될 수 있고, 유형적으로 저장 유닛과 같은 기계 판독 가능 매체에 포함된 다. 일 실시예에서, 컴퓨터 프로그램의 일부 또는 전부는 ROM 및/또는 통신 유닛에 의해 전자 기기 에 로딩 및/또는 설치될 수 있다. 컴퓨터 프로그램이 RAM에 로딩되고 컴퓨팅 유닛에 의해 수행 될 경우, 상기 설명한 방법 300, 400, 500 및 600의 하나 또는 복수의 단계를 수행할 수 있다. 대안적으로, 기 타 실시예에서, 컴퓨팅 유닛은 기타 임의의 적합한 방식(예를 들면, 펌웨어)으로 본 발명의 실시예에 따른 방법 300, 400, 500 및 600을 수행할 수 있도록 구성된다.. 본 명세서에서 설명한 기능은 적어도 부분적으로 하나 또는 복수의 하드웨어 논리 부품에 의해 수행된다. 예를 들면, 무제한적으로, 사용 가능한 시범 유형의 하드웨어 논리 부품은, 필드 프로그램 가능 게이트 어레이 (FPGA), 주문형 집적 회로(ASIC), 특정 용도 표준 제품(ASSP), 시스템 온 칩(SOC), 복합 프로그래머블 논리 소 자(CPLD) 등이 있다. 본 발명의 방법을 구현하기 위한 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의 조합으로 프로그래 밍할 수 있다. 당해 프로그램 코드는 범용 컴퓨터, 전용 컴퓨터 또는 기타 프로그래밍 가능한 데이터 처리 장치 의 프로세서 또는 제어기에 제공하여, 프로그램 코드가 프로세서 또는 제어기에 의해 수행될 경우, 흐름도 및/ 또는 블록도에서 규정한 기능/동작이 수행된다. 프로그램 코드는 완전히 기계에서 수행될 수 있고, 부분적으로 기계에서 수행될 수 있으며, 독립 소프트웨어 패키지로서 부분적으로 기계에서 수행되고, 부분적으로 원적 기계 에서 수행되거나, 완전히 원격 기계 또는 서버에서 수행될 수 있다. 본 발명의 앞뒤 설명에서, 기계 판독 가능 매체는 유형 매체일 수 있고, 명령 수행 시스템, 장치 또는 기기에서 사용하거나 명령 수행 시스템, 장치 또는 기기와 결합하여 사용하는 프로그램을 포함 또는 저장할 수 있다. 기 계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 저장 매체일 수 있다. 기계 판독 가능 매 체는, 전자, 자기, 광학, 전자기, 적외선 또는 반도체 시스템, 장치 또는 기기, 또는 상기 내용의 임의의 적합 한 조합을 포함하나 이에 한정되지 않는다. 기계 판독 가능 저장 매체의 더 구체적인 예시는, 하나 또는 복수의 전선을 기반으로 한 전기적 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 랜덤 엑세스 메모리(RAM), 읽기 전용 메 모리(ROM), 지울 수 있는 프로그래밍 가능한 읽기 전용 메모리(EPROM 또는 플래시 메모리), 광섬유, 휴대용 컴 팩트 디스크 읽기 전용 메모리(CD-ROM), 광학 저장 기기, 자기 저장 기기, 또는 상기 내용의 임의의 적합한 조 합을 포함한다. 이외에, 특정 순서로 각 동작을 설명하였으나, 이런 동작을 나타낸 특정 순서 또는 순차 순서로 수행할 것을 요 구하거나, 모든 도면에서 나타난 동작을 수행하고, 원하는 결과를 획득하도록 요구한다고 이해해야 한다. 일정 한 환경에서, 멀티 태스크와 병렬 처리는 유리한 것이다. 동시에, 상기 설명은 몇 가지의 구체적인 구현 세부를 포함하지만, 본 발명 범위를 한정하는 것으로 이해해서는 안된다. 단독 실시예의 앞뒤 설명에서 설명한 일부 특 징은 조합하여 개별 구현에 구현될 수 있다. 반대로, 개별적으로 구현된 앞뒤 설명에서 설명한 각 특징은 단독 또는 임의의 적합한 서브 조합의 방식으로 복수의 구현에 구현된다. 이미 구조 특징 및/또는 방법 논리 동작에 특정된 언어로 본 테마를 설명하였으나, 첨부된 청구범위에서 한정된 주제는 상기 설명의 특정 특징 또는 동작에 한정되지 않는다는 점을 이해해야 한다. 반대로, 상기 특정 특징과 동작은 청구범위를 구현하는 예시 형식일 뿐이다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2022-7027825", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면과 결합하여 이하의 상세한 설명을 참조하면, 본 발명의 각 실시예의 상기 또는 기타 특징, 장점 및 측면은 더 뚜렷해진다. 도면에서 동일 또는 유사한 도면 부호는 동일 또는 유사한 요소를 표시한다. 도1은 전통 수단에 따라 추천 결과를 제공하는 예시의 개략도이다. 도2는 본 발명 복수의 실시예의 구현 가능한 환경의 개략도이다. 도3은 본 발명의 일 실시예에 따른 콘텐츠를 검색하는 방법의 흐름도이다. 도4는 본 발명의 일 실시예에 따른 복수의 역사 검색 기록을 획득하는 방법의 흐름도이다. 도5는 본 발명의 일 실시예에 따른 역사 검색 기록의 카테고리 및 관계를 결정하는 방법의 흐름도이다. 도6은 본 발명의 일 실시예에 따른 역사 검색 기록 사이의 관계를 결정하는 방법의 흐름도이다. 도7은 본 발명의 일 실시예에 따른 콘텐츠를 검색하는 장치의 블록도이다. 도8은 본 발명의 일 실시예에 따른 콘텐츠를 검색하는 장치의 블록도이다. 도9는 본 발명의 복수의 실시예를 수행할 수 있는 기기의 블록도이다."}
