{"patent_id": "10-2021-0105474", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0023386", "출원번호": "10-2021-0105474", "발명의 명칭": "디스플레이 모듈 출력 방법 및 상기 방법을 수행하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이영수"}}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디스플레이 출력 방법에 있어서,동일한 태스크에서 실행되는 복수의 활동을 식별하는 단계;상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식별하는 단계;상기 페어 정보에 기초하여, 적어도 하나 이상의 활동을 디스플레이 모듈에 출력하는 단계를 포함하는, 디스플레이 모듈 출력 방법."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 페어 정보에 기초하여, 상기 디스플레이 모듈에 상기 활동을 출력할 영역에 따라 구분되는 복수의 활동 기록 그룹에 상기 복수의 활동을 설정하는 단계 및상기 복수의 활동 기록 그룹에서 상기 디스플레이 모듈에 출력할 활동을 결정하는 단계를 더 포함하는, 디스플레이 모듈 출력 방법."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 복수의 활동 기록 그룹은,상기 복수의 활동 기록 그룹에 설정된 활동들의 가시성(visibility) 및 수명 주기(lifecycle)를 결정하는, 디스플레이 모듈 출력 방법."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 복수의 활동을 설정하는 단계는,상기 페어 정보에 기초하여 상기 복수의 활동이 설정될 상기 활동 기록 그룹을 결정하는, 디스플레이 모듈 출력방법."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 페어 정보를 식별하는 단계는,전자 장치와 통신 가능한 서버로부터 수신한 상기 페어 정보, 상기 태스크에 미리 설정된 상기 페어 정보 및 사용자의 입력에 따라 설정된 상기 페어 정보 중 적어도 어느 하나를 식별하는, 디스플레이 모듈 출력 방법."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 디스플레이 모듈에 출력되는 적어도 하나 이상의 활동에 기초하여, 상기 디스플레이 모듈의 상측에 표시되는 인디케이터를 출력하는 단계를 더 포함하는, 디스플레이 모듈 출력 방법.공개특허 10-2023-0023386-3-청구항 7 제1항에 있어서,상기 디스플레이 모듈의 정보 및 상태에 따라 상기 복수의 활동을 출력할 수 있는 출력 영역을 식별하는 단계를더 포함하고,상기 하나 이상의 활동을 디스플레이 모듈에 출력하는 단계는,상기 출력 영역에 대응하여, 상기 적어도 하나 이상의 활동을 상기 디스플레이 모듈에 출력하는, 디스플레이 모듈 출력 방법."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "디스플레이 모듈 출력 방법을 수행하는 전자 장치에 있어서,디스플레이 모듈 및프로세서를 포함하고,상기 프로세서는,동일한 태스크에서 실행되는 복수의 활동을 식별하고, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를식별하고, 상기 페어 정보에 기초하여, 적어도 하나 이상의 활동을 상기 디스플레이 모듈에 출력하는, 전자 장치."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는,상기 디스플레이 모듈에 상기 활동을 출력할 영역에 따라 구분되는 복수의 활동 기록 그룹에 상기 복수의 활동을 설정하고, 상기 복수의 활동 기록 그룹에서 상기 디스플레이 모듈에 출력할 활동을 결정하는, 전자 장치."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는,상기 복수의 활동 기록 그룹에 설정된 활동들의 가시성(visibility) 및 수명 주기(lifecycle)를 결정하는, 전자장치."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 프로세서는,상기 페어 정보에 기초하여 상기 복수의 활동이 설정될 상기 활동 기록 그룹을 결정하는, 전자 장치."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 프로세서는,상기 전자 장치와 통신 가능한 서버로부터 수신한 상기 페어 정보, 상기 태스크에 미리 설정된 상기 페어 정보및 사용자의 입력에 따라 설정된 상기 페어 정보 중 적어도 어느 하나를 식별하는, 전자 장치."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,공개특허 10-2023-0023386-4-상기 프로세서는,상기 디스플레이 모듈에 출력되는 적어도 하나 이상의 활동에 기초하여, 상기 디스플레이 모듈의 상측에 표시되는 인디케이터를 출력하는, 전자 장치."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서,상기 프로세서는,상기 디스플레이 모듈 영역의 변화에 따라 상기 복수의 활동을 출력할 수 있는 출력 영역을 식별하고, 상기 출력 영역에 대응하여, 상기 적어도 하나 이상의 활동을 상기 디스플레이 모듈에 출력하는, 전자 장치."}
{"patent_id": "10-2021-0105474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "디스플레이 모듈 출력 방법을 수행하는 전자 장치에 있어서,디스플레이 모듈 및프로세서를 포함하고,상기 프로세서는,사용자의 입력에 기초하여 태스크의 상태 정보를 설정하고, 동일한 태스크에서 실행되는 복수의 활동을 식별하고, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식별하고, 상기 페어 정보 및 상기 상태 정보에 기초하여, 적어도 하나 이상의 활동을 상기 디스플레이 모듈에 출력하는, 전자 장치."}
{"patent_id": "10-2021-0105474", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "디스플레이 모듈 출력 방법 및 상기 방법을 수행하는 전자 장치가 개시된다. 다양한 실시예들에 따른 디스플레 이 출력 방법은 동일한 태스크에서 실행되는 복수의 활동을 식별하는 단계, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식별하는 단계, 상기 페어 정보에 기초하여, 적어도 하나 이상의 활동을 디스플레이 모듈에 출력하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0105474", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 개시는 디스플레이 모듈 출력 방법, 및 상기 방법을 수행하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0105474", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 전자 장치는 어플리케이션, 프로그램의 동작에 따른 활동(activity)를 스택(stack) 형식으로 쌓는 구조 로 관리한다. 스택 형식으로 쌓은 활동 중에서 최상위의 활동을 화면(display)에 출력되도록 한다. 전자 장치는 멀티 윈도우(multi-window) 기능을 제공하고, 서로 다른 어플리케이션이 동시에 실행되는 경우, 디 스플레이를 분할하여 동시에 여러 어플리케이션을 표시한다."}
{"patent_id": "10-2021-0105474", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시예들에 따르면, 하나의 태스크(task)에서 수행되는 복수의 활동을 분할하여 디 스플레이 모듈에 출력할 수 있는 디스플레이 모듈 출력 방법 및 디스플레이 모듈 출력 방법을 수행하는 컴퓨팅 장치를 제공할 수 있다. 본 문서에 개시되는 다양한 실시예들에 따르면, 하나의 태스크에서 수행되는 복수의 활동을 활동 기록 그룹 (activity record group)에 설정하여, 복수의 활동을 디스플레이 모듈에 출력하면서, 각각의 활동 기록 그룹의 활동의 가시성(visibility) 및 수명 주기(lifecycle)를 결정할 수 있는 디스플레이 모듈 출력 방법 및 디스플레 이 출력 방법을 수행하는 컴퓨팅 장치를 제공할 수 있다. 본 문서에 개시되는 다양한 실시예들에 따르면, 다양한 전자 장치의 폼팩터(form factor)에 따라 복수의 활동을 디스플레이에 출력할 수 있는 디스플레이 모듈 출력 방법 및 디스플레이 출력 방법을 수행하는 컴퓨팅 장치를 제공할 수 있다."}
{"patent_id": "10-2021-0105474", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들에 따른 디스플레이 모듈 출력 방법은 동일한 태스크에서 실행되는 복수의 활동을 식별하는 단 계, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식별하는 단계, 상기 페어 정보에 기초하여, 적어도 하나 이상의 활동을 디스플레이 모듈에 출력하는 단계를 포함할 수 있다. 다양한 실시예들에 따른 디스플레이 모듈 출력 방법을 수행하는 전자 장치는 디스플레이 모듈 및 프로세서를 포 함하고, 상기 프로세서는, 동일한 태스크에서 실행되는 복수의 활동을 식별하고, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식별하고, 상기 페어 정보에 기초하여, 적어도 하나 이상의 활동을 상기 디스플레이 모 듈에 출력할 수 있다. 다양한 실시예들에 따른 디스플레이 모듈 출력 방법을 수행하는 전자 장치는 디스플레이 모듈 및 프로세서를 포 함하고, 상기 프로세서는, 사용자의 입력에 기초하여 태스크의 상태 정보를 설정하고, 동일한 태스크에서 실행 되는 복수의 활동을 식별하고, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식별하고, 상기 페어 정 보 및 상기 상태 정보에 기초하여, 적어도 하나 이상의 활동을 상기 디스플레이 모듈에 출력할 수 있다."}
{"patent_id": "10-2021-0105474", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시예들에 따르면, 복수의 활동을 디스플레이 모듈에 출력할 수 있고, 복수의 활동 을 활동 기록 그룹에 설정하여 복수의 활동의 가시성 및 수명 주기를 보장할 수 있다. 본 문서에 개시되는 다양한 실시예들에 따르면, 어플리케이션과 같은 태스크에서 복수의 활동을 디스플레이 모 듈에 분할하여 출력하도록 설정 또는 지원하지 않는 경우에도, 디스플레이 모듈 출력 방법 및 디스플레이 출력 방법을 수행하는 컴퓨팅 장치를 이용하여 복수의 활동을 디스플레이 모듈에 출력할 수 있다. 본 문서에 개시되는 다양한 실시예들에 따르면, 전자 장치의 다양한 폼팩터에 따라 복수의 활동을 디스플레이 모듈에 출력하도록 할 수 있고, 디스플레이 모듈이 사용에 따라 확장, 축소, 및/또는 변경과 같이 변하는 경우 에 따라 복수의 활동을 디스플레이 모듈에 출력하도록 할 수 있다."}
{"patent_id": "10-2021-0105474", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예들을 첨부된 도면들을 참조하여 상세하게 설명한다. 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부여하고, 이에 대한 중복되는 설명은 생략하기로 한 다.도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나 와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키(예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가 적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상 기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전 자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제 공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 다양한 실시예들에 따른 전자 장치(예: 도 1의 전자 장치)의 동작 흐름도이다.도 2를 참조하면, 다양한 실시예들에 따른 전자 장치는 동작 S201에서 동일한 태스크(task)에서 실행되는 복수 의 활동(activity)을 식별할 수 있다. 일례로, 태스크는 전자 장치가 프로세서(예: 도 1의 프로세서)가 실행할 수 있는 프로그램(예: 도 1의 프로그램)을 의미할 수 있다. 일례로, 태스크는 전자 장치가 실행할 수 있는 어플리케이션(예: 도 1의 어플리케이션)에 해당할 수 있다. 다양한 실시예들에 따른 전자 장치는 동작 S202에서 페어(pair) 정보를 식별할 수 있다. 일례로, 페어 정보는 복수의 활동 간의 관계를 의미할 수 있다. 다양한 실시예들에 따른 페어 정보는 복수의 활동 간의 선후 관계(from-to)를 나타낼 수 있다. 일례로, 선후 관계는 특정 활동으로부터 다른 활동이 실행되는 경우, 이전에 실행된 활동을 소스(source), 소스로부터 실행되 는 다른 활동을 타겟(target)으로 하는 관계를 의미할 수 있다. 예를 들어, 활동 1(activity 1)에서 사용자의 입력에 따라 활동 2(activity 2)가 동작하는 경우, 페어 정보는 활동 1을 소스(source), 활동 2를 타겟(target)으로 설정될 수 있다. 다양한 실시예들에 따른 전자 장치는 전자 장치와 통신 가능한 서버(예: 도 1의 서버)로부터 페어 정보를 수신할 수 있다. 일례로, 전자 장치는 서버로부터 복수의 활동에 대하여 정의된 페어 정보를 수신하여, 전자 장치의 메모리(또는 저장소, repository)(예: 도 1의 메모리)에 저장할 수 있다. 전자 장치는 메모리에 저장된 페어 정보를 식별할 수 있다. 다양한 실시예들에 따른 페어 정보는 태스크에 미리 설정될 수 있다. 일례로, 어플리케이션의 xml, json과 같 은 메타 데이터(meta data)에 복수의 활동 간의 페어 정보를 정의할 수 있다. 전자 장치는 어플리케이션의 메 타 데이터에 정의된 페어 정보를 식별할 수 있다. 일례로, 전자 장치는 태스크의 패키지 네임(package name) 및 클래스 네임(class name)을 이용하여 태스크를 식 별하고, 태스크에서 수행되는 복수의 동작을 디스플레이 모듈에 출력할 수 있다. 전자 장치는 패키지 네임 및 클래스 네임을 이용하여 태스크를 식별하고, 해당 클래스 네임에서 수행되는 활동들은 페어 정보가 정의되어 있 지 않은 경우에도, 복수의 활동을 디스플레이 모듈에 출력할 수 있다. 예를 들어, 태스크의 패키지 네임이 \"com.wemakeprice\"이고, 클래스 네임인 경우, 해당 태스크를 식별하고, 클 래스 네임 \"com.wemakeprice.MainTabActivity\"에서 수행되는 복수의 활동을 디스플레이 모듈에 출력할 수 있다. 예를 들어, 태스크의 클래스 네임의 활동은 디스플레이 모듈의 좌측 영역에 출력하고, 클래스 네임의 활동에서 실행되는 활동은 디스플레이 모듈의 우측 영역에 출력되도록 할 수 있다. 아래 표 1은 전자 장치가 식별할 수 있는 패키지 네임 및 클래스 네임의 예시이다. 표 1 App Name Package name ClassName Wish com.contextlogic.wis hcom.contextlogic.wish.activity.browse.BrowseActiv ity SHEIN com.zzkko com.zzkko.bussiness.login.ui.MainTabsActivity 위메프 com.wemakeprice com.wemakeprice.MainTabActivity 네이버카페 com.nhn.android.nave rcafecom.nhn.android.navercafe.feature.section.HomeAct ivity 티몬 com.tmon com.tmon.main.MainActivity WhatsApp com.whatsapp com.whatsapp.HomeActivity WhatsApp business com.whatsapp.w4bcom.whatsapp.HomeActivity 쿠팡 com.coupang.mobilecom.coupang.mobile.domain.home.main.activity.Main Activity Signal org.thoughtcrime.sec uresmsorg.thoughtcrime.securesms.MainActivity Line jp.naver.line.androi djp.naver.line.android.activity.main.MainActivity com.wuba com.wuba.home.activity.HomeActivity Gmarket com.ebay.kr.gmarketcom.ebay.kr.gmarket.eBayKoreaGmarketActivity Auction com.ebay.kr.auctioncom.ebay.kr.auction.eBayKoreaAuctionActivity Knox Messenger com.sds.mysinglesqua recom.sds.mysinglesquare.main.activity.MainActivitycom.alibaba.android. rimetcom.alibaba.android.rimet.biz.LaunchHomeActivity 微博 (Weibo) com.sina.weibo com.sina.weibo.MainTabActivity com.achievo.vipshopcom.achievo.vipshop.homepage.activity.MainActivit y com.zhihu.androidcom.zhihu.android.app.ui.activity.MainActivity com.duowan.kiwi com.duowan.kiwi.homepage.Homepage com.coolapk.marketcom.coolapk.market.view.main.MainActivity com.immomo.momo com.immomo.momo.maintab.MaintabActivity com.xtc.watch com.xtc.account.activity.bind.NeedBindActivity com.eg.android.Alipa yGphonecom.eg.android.AlipayGphone.AlipayLogin com.jv.samsungeshopcom.jv.samsungeshop.ui.MainActivity com.smzdm.client.and roidcom.smzdm.client.android.app.HomeActivity com.taobao.movie.and roidcom.taobao.movie.android.app.home.activity.MainAc tivity com.taobao.etao com.taobao.etao.app.home.view.NewHomeActivity com.netease.gl com.netease.gl.ui.activity.welcome.WelcomeActivit y com.secoo com.secoo.app.mvp.ui.activity.MainActivity com.ss.android.artic le.newscom.ss.android.article.news.activity.MainActivity com.netease.newsread er.activitycom.netease.nr.phone.main.MainActivity com.dragon.read com.dragon.read.pages.main.MainFragmentActivity com.tencent.wereadcom.tencent.weread.WeReadFragmentActivity com.chaoxing.mobilecom.chaoxing.mobile.main.ui.MainTabActivity com.hupu.games com.hupu.games.home.homepage.HomePageActivity com.xs.fm com.dragon.read.pages.main.MainFragmentActivity com.wuba com.wuba.housecommon.list.activity.HouseInfoListF ragmentActivity com.xingin.xhs com.xingin.xhs.index.v2.IndexActivityV2 com.sankuai.meituancom.meituan.android.pt.homepage.activity.MainActi vity com.dianping.v1 com.dianping.v1.NovaMainActivity com.tencent.newscom.tencent.news.activity.SplashActivity com.wuba com.wuba.housecommon.category.activity.HouseCateg oryListFragmentActivity com.duowan.kiwi com.duowan.kiwi.homepage.Homepage com.xunmeng.pinduodu ocom.xunmeng.pinduoduo.ui.activity.HomeActivity 다양한 실시예들에 따른 페어 정보는 사용자의 입력에 따라 설정될 수 있다. 일례로, 전자 장치는 사용자의 입 력에 기초하여 복수의 활동 간의 페어 정보를 설정할 수 있다. 예를 들어, 태스크 내의 활동 1에서 활동 2가 실행된 경우, 사용자의 입력에 기초하여 활동 1을 소스, 활동 2를 타겟으로 하는 페어 정보가 설정될 수 있다. 전자 장치는 사용자의 입력에 따라 설정된 페어 정보를 식별할 수 있다.다양한 실시예들에 따른 전자 장치는 동 작 S203에서 하나 이상의 활동을 디스플레이 모듈에 출력할 수 있다. 일례로, 전자 장치는 페어 정보에 기초하여 활동을 디스플레이 모듈에 출력할 수 있다. 예를 들어, 활동 1을 소스, 활동 2를 타겟으로 하는 페어 정보 를 식별한 경우, 전자 장치는 디스플레이 모듈에 활동 1과 활동 2를 동시에 출력할 수 있다. 도 3은 다양한 실시예들에 따라 디스플레이 모듈에 출력되는 활동을 나타낸 도면이다. 도 3에 도시된 전자 장 치(예: 도 1의 전자 장치)는 폴더블(foldable) 디스플레이에 출력되는 활동을 나타내고 있으나, 후술하는 바와 같이 이에 한정되지 않고 다양한 폼팩터의 전자 장치의 디스플레이 모듈에 하나 이상의 활동이 출력될 수 있다. 도 3은 다양한 실시예에 따른 전자 장치가 활동 A1(activity 1)에서 활동 A2(activity 2)가 실행된 경우 디스플레이 모듈에 출력되는 활동을 나타낸 도면이다. 도 3의 (a)는 활동 A1과 활동 A2 간의 페어 정보가 정의되지 않은 경우, 전자 장치의 디스플레이 모듈의 출력 화면을 나타낸 도면이다. 전자 장치는 활동 A1에서 활동 A2가 실행되고, 활동 A1과 활동 A2 사이의 페어 정보 가 정의되지 않은 경우, 활동 A2가 디스플레이 모듈에 출력되도록 할 수 있다. 도 3의 (b)는 활동 A1이 소스, 활동 A2가 타겟으로 페어 정보가 설정된 경우, 전자 장치의 디스플레이 모듈의 출력 화면을 나타낸 도면이다. 전자 장치는 페어 정보에 기초하여, 디스플레이 모듈의 좌측에 활동 A1, 우측에 A2를 분할하여 출력할 수 있다. 일례로, 전자 장치는 디스플레이 모듈에 출력되는 복수의 활동의 가시성 및 수명 주기를 결정할 수 있다. 도 3 (b)에서, 전자 장치는 활동 A1 및 활동 A2가 디스플레이 모듈에 출력되도록 할 수 있다. 전자 장치 는 활동 A1 및 활동 A2의 수명 주기를 결정하여, 활동 A1으로부터 실행된 활동 A2 뿐만 아니라, 기존에 실행된 활동 A1도 동작하도록 할 수 있다. 예를 들어, 활동 A1 영역에서 터치 입력과 같은 사용자의 입력을 수신하여, 활동 A1에서 태스크가 동작할 수 있 고, 활동 A2 영역에서도 사용자의 입력을 수신하여, 활동 A2에서도 태스크가 동시에 동작할 수 있다. 도 3의 (c)는 전자 장치가 디스플레이 모듈의 좌측 영역과 우측 영역에 각각 다른 활동을 출력하는 것을 나타낸 도면이다. 도 3의 (c)를 참조하면, 전자 장치가 디스플레이 모듈의 좌측 절반 영역과 우측 절반 영역에 서로 다른 활 동을 출력하고 있음을 확인할 수 있다. 도 3 (c)에서 출력되는 활동들은 동일한 태스크에서 실행되는 활동이다. 도 3의 (c)는 쇼핑 어플리케이션에서 실행되는 복수의 활동을 디스플레이 모듈에 분할하여 출력하는 전자 장치 를 나타내고 있으나, 쇼핑 어플리케이션에 한정되지 않고, 전자 장치는 메신저, 게임, 메일, 채팅 어 플리케이션과 같이 다양한 태스크에서 실행되는 복수의 활동을 디스플레이 모듈에 분할하여 출력할 수 있다. 도 3 (b) 및 (c)를 참조하면, 다양한 실시예들에 따른 전자 장치는 디스플레이 모듈에 출력되는 적어도 하나 이 상의 활동에 기초하여 디스플레이 모듈의 상측에 표시되는 인디케이터(미도시)를 출력할 수 있다. 일례로, 전자 장치는 디스플레이 모듈의 좌측 영역에 출력되는 인디케이터와 우측 영역에 출력되는 인디케이터 의 폰트 컬러를 다르게 설정할 수 있다. 예를 들어, 활동 A1과 활동 A2의 배경색이 상이할 수 있다. 전자 장 치는 디스플레이 모듈의 좌측 영역의 상측에 출력되는 인디케이터의 폰트 컬러는 활동 A1의 배경색에 따라 결정 하고, 디스플레이 모듈의 우측 영역의 상측에 출력되는 인디케이터의 폰트 컬러는 활동 A2의 배경색에 따라 결 정할 수 있다. 도 4는 다양한 실시예들에 따른 활동 기록 그룹을 나타낸 도면이다. 도 4의 (a)는 다양한 실시예들에 따른 활동 기록 그룹을 나타내고 있다. 일례로, 활동 기록 그룹 (ActivityRecordGruop)은 활동을 디스플레이 모듈(예: 도 1의 디스플레이 모듈)에 출력할 영역에 따 라 구분될 수 있다. 도 4의 (a)에서 활동 기록 그룹은 활동을 디스플레이 모듈에 출력할 영역인 좌측 영 역(LEFT), 중간 영역(CENTER), 우측 영역(RIGHT)으로 구분할 수 있다. 활동 기록 그룹(402-1)은 디스플레이 모 듈의 좌측 영역에 활동을 출력하도록 할 수 있다. 활동 기록 그룹(402-2)은 디스플레이 모듈의 우측 영역, 활 동 기록 그룹(402-3)은 디스플레이 모듈의 중간 영역에 각각 활동을 출력할 수 있다. 도 4의 (a)에서 활동 기록 그룹의 영역(bounds)은 각각 디스플레이 모듈에서 활동이 출력되는 특정 경계(bound) 내의 영역으로 설정될 수 있다. 예를 들어, 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력하도록 결정된 활동은 활동 기록 그룹(402-1)의 영역에 대응하는 디스플레이 모듈의 영역에 출력될 수 있다.도 4의 (a)에 설정된 활동을 출력할 영역은 예시적인 것으로, 좌상단 영역(LEFT-TOP), 좌하단 영역(LEFT- BOTTOM), 우상단 영역(RIGHT-TOP), 및/또는 우하단 영역(RIGHT-BOTTOM)과 같이 다양하게 활동을 출력할 영역이 설정될 수 있다. 도 4의 (a)를 참조하면, 다양한 실시예들에 따른 전자 장치는 페어 정보에 기초하여, 디스플레이 모듈에 활동을 출력할 영역에 따라 구분되는 복수의 활동 기록 그룹에 복수의 활동을 설정할 수 있다. 예를 들어, 활동 1이 소스, 활동 2가 타겟인 페어 정보를 식별한 경우, 전자 장치는 활동 기록 그룹(402-1)에 활동 1을 추가하고, 활동 기록 그룹(402-2)에 활동 2를 추가할 수 있다. 일례로, 페어 정보는 후술하는 바와 같이 소스 활동 및 타겟 활동이 설정될 활동 기록 그룹에 관한 정보를 포함할 수 있다. 전자 장치는 소스 활동 및 타겟 활동이 설정될 활동 기록 그룹에 관한 정보를 이용하여 소스 활동 및 타겟 활동을 각각 활동 기록 그룹에 설정할 수 있다. 일례로, 태스크에서 복수의 활동이 실행되는 경우, 전자 장치는 페어 정보에 기초하여, 각각의 활동이 활 동 기록 그룹에 포함되도록 할 수 있다. 일례로, 전자 장치는 페어 정보에 기초하여, 활동 기록 그룹에 설정된 활동이 다른 활동 기록 그룹에 설정되도 록 할 수 있다. 예를 들어, 전자 장치는 활동 기록 그룹(402-1)에 설정된 활동을 활동 기록 그룹(402-2)에 설 정되도록 할 수 있다. 즉, 전자 장치는 페어 정보에 기초하여 활동의 활동 기록 그룹을 변경할 수 있다. 다양한 실시예들에 따른 활동 기록 그룹 관리 모듈은 복수의 활동 기록 그룹들을 관리할 수 있다. 일례로, 활동 기록 그룹 관리 모듈은 각각의 활동 기록 그룹들이 독립적으로 가시성 및 수명 주기를 가지도록 제어할 수 있다. 일례로, 하나의 태스크에 하나의 활동 기록 그룹 관리 모듈이 정의될 수 있다. 다양한 실시예들에 따른 전자 장치는 복수의 활동 기록 그룹 각각에 정책을 적용할 수 있다. 일례로, 활 동 기록 그룹 관리 모듈은 각각의 활동 기록 그룹에 정책을 적용하여, 각각의 활동 기록 그룹이 독립적으로 가시성 및 수명 주기를 가지도록 제어할 수 있다. 일례로, 각각의 활동 기록 그룹에 적용되는 정책은 가시성 정책(visibility policy), 활동 수명 주기 정책 (activity lifecycle policy), 배치 전파(configuration propagation), 오더링 정책(ordering policy), 활동 클리어 정책(activity clear policy), 키 이벤트 전달 및 윈도우 집중(focus window with key event dispatch), 경계 변경 케이스(cases that effects app bounds such as resolution change), 기능 설정을 위한 메타 데이터 정의(define metadata for feature configuration)이 해당할 수 있다. 일례로, 가시성 정책은 활동 기록 그룹 내부 z-order 순으로 활동의 가시성을 관리하는 로직에 해당할 수 있다. 전자 장치는 활동 기록 그룹별로 순회하는 활동 기록을 제약할 수 있고, 디스플레이 모듈에 출력되지 않는 활동 (behindFullscreen)을 갱신하여 가시성(visible)을 계산하도록 할 수 있다. 일례로, 활동 수명 주기 정책은 활동 기록 그룹 내부의 z-order 순으로 가시성 및 수명 주기를 관리하는 로직에 해당할 수 있다. 전자 장치는 활동 수명 주기 정책을 각각의 활동 기록 그룹에 적용하여, 태스크 내부에 서 복수의 활동이 동작 상태(multi-resume)가 되도록 할 수 있다. 일례로, 배치 전파는 활동 기록 그룹의 경계값(bounds)을 활동 기록의 윈도우 배치(WindowConfiguration)의 경 계값(bounds)에 설정하는 정책을 의미할 수 있다. 일례로, 오더링 정책은 Task.mChildren과 ActivityRecordGruop.mChildren의 오더링 싱크(sync)에 필요한 정책 일 수 있다. 일례로, 활동 클리어 정책은 복수의 활동이 실행된 이후, 중간에 실행된 활동이 종료된 경우에 종료된 활동에서 실행된 활동을 제거하는 로직에 해당할 수 있다. 예를 들어, 활동 A1, A2, A3, A4 순으로 활동이 실행되고, 활 동 A2가 종료되면 A2로부터 실행된 활동 A3, 활동 A3로부터 실행된 A4가 함께 제거될 수 있다. 일례로, 키 이벤트 전달 및 윈도우 집중은 마지막으로 입력을 수신하는 활동에 따라 집중 윈도우를 이동하고, 입력(key event)를 전달하는 정책을 의미할 수 있다. 일례로, 입력은 디스플레이의 터치 모듈에 입력되는 터치 활동(touch activity)일 수 있다. 일례로, 윈도우 집중 정책에는 집중 윈도우 종료 시, 다음 집중 윈도우를 결 정하는 로직도 포함될 수 있다.일례로, 경계 변경 케이스는 활동 기록 그룹의 경계값이 변경되는 경우에 대한 상황을 처리하는 로직에 해당할 수 있다. 예를 들어, 디스플레이의 해상도(resolution)이 변경되는 경우, 활동 기록 그룹의 경계값이 변경되고, 활동 기록은 변경된 경계값에 맞게 화면을 구성할 수 있다. 일례로, 기능 설정을 위한 메타 데이터 정의는 복수의 활동을 디스플레이 모듈에 출력하는 기능 설정을 위한 메 타 데이터를 정의하고, 설정을 파싱(parsing)하고 관리하기 위한 객체에 필요한 정책에 해당할 수 있다. 메타 데이터를 정의하고 지원할 기능을 선택할 수 있다. 다양한 실시예들에 따른 활동 기록 그룹 관리 모듈은 활동 기록 그룹를 생성할 수 있다. 다양한 실시예들에 따른 전자 장치는 복수의 활동 기록 그룹에서 디스플레이 모듈에 출력할 활동을 결정할 수 있다. 일례로, 전자 장치는 페어 정보를 이용하여 디스플레이 모듈에 출력할 활동을 결정할 수 있다. 일례 로, 페어 정보는 소스에 해당하는 활동을 기록할 활동 기록 그룹과 타겟에 해당하는 활동할 활동 기록 그 룹에 관한 정보를 포함할 수 있다. 예를 들어, 활동 1로부터 활동 2가 실행되고, 활동 2로부터 활동 3이 실행된 경우, 전자 장치는 활동 1이 소스, 활동 2가 타겟인 페어 정보, 활동 2가 소스, 활동 3이 타겟인 페어 정보를 식별할 수 있다. 전자 장치는 페어 정보를 이용하여, 활동 기록 그룹(402-1)에 활동 1을 설정하고, 활동 기록 그룹(402-2)에 활동 2 및 활동 3을 설정할 수 있다. 전자 장치는 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력할 활동으로 활동 1, 활동 기 록 그룹(402-2)에서 디스플레이 모듈에 출력할 활동으로 활동 3을 결정할 수 있다. 예를 들어, 활동 1로부터 활동 2가 실행되고, 활동 2로부터 활동 3이 실행된 경우, 전자 장치는 활동 1이 소스, 활동 2가 타겟인 페어 정보, 활동 2가 소스, 활동 3이 타겟인 페어 정보를 식별할 수 있다. 전자 장치는 페어 정보를 이용하여, 활동 기록 그룹(402-1)에 활동 1 및 활동 2를 설정하고, 활동 기록 그룹(402-2)에 활동 3을 설정할 수 있다. 전자 장치는 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력할 활동으로 활동 2, 활동 기 록 그룹(402-2)에서 디스플레이 모듈에 출력할 활동으로 활동 3을 결정할 수 있다. 도 4의 (b)는 다양한 실시예들에 따른 태스크와 활동 기록, 활동 기록 그룹, 활동 기록 그룹 관 리 모듈의 관계를 나타낸 도면이다. 도 4의 (b)를 참조하면, 다양한 실시예들에 따른 활동 기록(ActivityRecord)은 태스크에서 실행되는 활동들에 관한 정보를 포함할 수 있다. 전자 장치는 활동 기록에 포함된 활동들에 관한 정보를 이용하여, 디스플레이 모듈에 하나 이상의 활동을 출력할 수 있다. 일례로, 활동 기록에 포함되는 정보는 활동 상태(AcitvityState), 가시성(Visible), 활동 그룹 (ActivityGroup), 소스 활동(SourceActivity), 타겟 활동(TargetActivities)을 포함할 수 있다. 일례로, 활동 상태(ActivityState)는 활동의 수명 주기의 기반이 되는 정보로, 활동이 화면에 보여지는 상태 (resumed), 다른 활동에 가려지는 상태(stopped), 종료 중인 상태(finishing)과 같이, 활동의 현재 상태에 관한 정보에 해당할 수 있다. 일례로, 가시성(Visible)은 활동이 화면에 보여지는지, 즉 디스플레이 모듈에 출력되는지에 관한 정보에 해당할 수 있다. 복수의 활동을 디스플레이 모듈에 출력하기 위하여, 복수의 활동 기록 그룹 각각에서 활동의 가 시성(Visible)을 관리할 수 있다. 일례로, 활동 그룹(ActivityGroup)은 해당 활동이 속한 활동 기록 그룹에 관한 정보에 해당할 수 있다. 일례로, 활동 1이 도 4의 활동 기록 그룹(402-1)에 설정된 경우, 활동 1의 활동 그룹은 활동 기록 그룹(402- 1)이 될 수 있다. 일례로, 소스 활동(SourceActivity)는 해당 활동의 소스가 되는 활동에 관한 정보에 해당할 수 있다. 예를 들 어, 활동 2가 활동 1로부터 실행된 경우, 활동 2의 소스 활동은 활동 1이 될 수 있다. 일례로, 타겟 활동(TargetActivities)는 해당 활동의 타겟이 되는 다른 활동에 관한 정보에 해당할 수 있다. 일례로, 활동 1로부터 활동 2가 실행된 경우, 활동 1의 타겟 활동은 활동 2가 될 수 있다. 상기에서 설명한 활동 기록에 관한 내용을 종합하면, 태스크가 동작하면서 실행되는 활동들은 활동 기록에 기록될 수 있다. 활동 기록에 기록된 각각의 활동에 대하여 활동 상태, 가시성, 활동 그룹, 소스 활동, 타겟 활동에 관한 정보를 포함할 수 있다.다양한 실시예들에 따른 활동 기록에 포함되는 활동에 관한 정보는 활동 기록 그룹에 포함된 활동에 관한 정보에 따라 결정될 수 있다. 예를 들어, 전자 장치는 활동 기록 그룹(402-1)에 설정된 활동 1의 가시성 및 수명 주기를 결정할 수 있다. 활동 기록에 포함된 활동 1에 관한 정보는 활동 기록 그룹(402-1)에 설 정된 활동 1의 정보에 따라 결정될 수 있다. 다양한 실시예들에 따른 전자 장치는, 활동 기록에 기초하여 복수의 활동을 디스플레이 모듈에 출력할 수 있다. 전자 장치는 활동 기록에 포함된 활동의 활동 상태 및 가시성에 따라 복수의 활동을 디스플레이 모 듈에 출력할 수 있다. 일례로, 전자 장치는 활동 기록에 포함된 활동에 관한 정보를 이용하여, 활동 상태가 디스플레이 모듈에 보여지는 상태(resumed)이고, 가시성(visible)이 디스플레이 모듈에 출력되는 상태인 활동을 디스플레이 모듈에 출력할 수 있다. 일례로, 전자 장치는 디스플레이 모듈에 출력되는 활동의 활동 그룹(ActivityGroup) 정보를 이용하여, 활동이 속한 활동 기록 그룹의 영역(bounds)에 대응하는 디스플레이 모듈의 영역에 활동을 출력할 수 있다. 도 5는 다양한 실시예들에 따른 전자 장치(예: 도 1의 전자 장치)의 동작을 나타낸 도면이다. 다양한 실시예들에 따른 전자 장치는 활동 1(Activity 1)에서 활동 2(Activity 2)를 실행(동작 S505)할 수 있다. 전자 장치는 동작 S505에서 동일한 태스크에서 실행되는 복수의 활동을 식별할 수 있다. 일례로, 전자 장치는 활동 스타터(ActivityStarter)에서 복수의 활동을 식별할 수 있다. 다양한 실시예들에 따른 전자 장치는 페어 정보가 존재하는지 여부를 판단(동작 S510)할 수 있다. 일례로, 전자 장치의 복수의 활동 사이에 정의된 페어 정보가 저장되어 있는지를 여부를 확인하기 위한 요청이 활동 스타터에 서 메모리(예: 도 1의 메모리)(또는 저장소, Repository)로 전달될 수 있다. 다양한 실시예들에 따른 전자 장치는 복수의 활동 사이에 정의된 페어 정보를 식별(동작 S515) 할 수 있다. 일 례로, 활동 스타터(ActivityStarter)는 메모리에 저정된 복수의 활동 사이에 정의된 페어 정보를 식 별할 수 있다. 다양한 실시예들에 따른 전자 장치는 복수의 활동에 대하여 활동 기록 그룹(예: 도 4의 활동 기록 그룹 )을 설정(reparentGroup)(동작 S520)할 수 있다. 일례로, 전자 장치의 활동 스타터에서 활동 기록 그룹로 페어 정보를 기반으로 복수의 활동 각각이 특정 활동 기록 그룹에 속하도록 지정할 수 있다. 다양한 실시예들에 따른 전자 장치는 각각의 활동 기록 그룹에 활동을 설정(addChild)(동작 S525)할 수 있 다. 다양한 실시예들에 따른 전자 장치는 활동 분할 모드에 진입(enterSplitActivityMode)(동작 S530)할 수 있다. 일례로, 활동 분할 모드에 진입하는 것은, 디스플레이 모듈에 출력되는 활동의 위치, 크기, 가시성(visibilit y)에 관한 정보를 활동 기록 그룹 단위로 갱신하도록 요청하는 것을 의미할 수 있다. 일례로, 활동 기록 그룹 으로부터 태스크(예: 도 4의 태스크)로 활동 분할 모드에 진입을 요청할 수 있다. 다양한 실시예들에 따른 전자 장치는 활동의 위치와 크기를 변경(동작 S535)할 수 있다. 일례로, 활동의 위치 와 크기를 변경하는 것은 복수의 활동이 디스플레이 모듈에 출력되기 위한 위치와 크기를 보장 (ensureActivityConfiguration)하는 것을 의미할 수 있다. 일례로, 태스크에서 활동의 위치와 크기를 각 각의 활동이 속하는 활동 기록 그룹에 맞게 변경하도록 활동 기록으로 요청할 수 있다. 다양한 실시예들에 따른 전자 장치는 활동 기록 그룹의 영역을 설정(setGruopBounds)(동작 S540)할 수 있 다. 일례로, 전자 장치는 활동 기록에 기록된 활동들에 대하여, 활동의 위치 및 크기를 활동이 속하는 활 동 기록 그룹의 영역값(또는 경계값, bounds)에 따라 설정할 수 있다. 다양한 실시예들에 따른 전자 장치는 활동의 가시성을 보장(ensureActivityVisible)(동작 S545)할 수 있다. 일 례로, 태스크에서 활동 스택(ActivityStack)으로, 디스플레이 모듈에 출력되는 복수의 활동의 가시성 을 보장하기 위한 요청을 전송할 수 있다. 다양한 실시예들에 따른 전자 장치는 활동의 가시성을 보장하기 위한 요청을 처리(동작 S550)할 수 있다. 일례 로, 활동 가시성 모듈(EnsureActivityVisibleHelper)은 활동 스택으로부터 디스플레이 모듈에 출력 되는 복수의 활동의 가시성을 보장하기 위한 요청을 처리할 수 있다.다양한 실시예들에 따른 전자 장치는 디스플레이 모듈에 출력되는 복수의 활동의 가시성을 보장하기 위한 요청 을 처리한 결과를 전송(동작 S555)할 수 있다. 일례로, 동작 S545의 요청을 처리한 결과는 활동 가시성 모듈 로부터 활동 기록 그룹 관리 모듈(예: 도 4의 활동 기록 그룹 관리 모듈 )(ActivityRecordGruops)로 전송될 수 있다. 일례로, 전자 장치는 복수의 활동의 가시성을 보장하기 위한 요청을 처리한 결과를 이용하여, 활동 기록 그룹 단위로 가시성 및 수명 주기를 결정할 수 있다. 일례로, 활동 기록 그룹 관리 모듈은 복수의 활동 기록 그룹 각각에서 가시성 및 수명 주기를 결정하도록 할 수 있다. 다양한 실시예들에 따른 전자 장치는 활동의 가시 상태를 설정 (setActivityVisibilityStateInSplitActivityMode)(동작 S560)할 수 있다. 전자 장치는 설정된 활동의 가시 상태에 따라, 활동 가시 상태를 변경(makeVisibleifNeeded)(동작 S565)할 수 있다. 일례로, 전자 장치는 활동 가시 상태를 변경하기 위한 요청을 활동 기록으로 전송하여, 활동 기록 내에 기록된 활동의 가시 상 태가 변경되도록 할 수 있다. 다양한 실시예들에 따른 전자 장치는 복수의 활동 사이에 정의된 페어 정보가 없음을 식별(동작 S570)할 수 있 다. 일례로, 활동 1과 활동 2 사이에 정의된 페어 정보가 식별되지 않는 경우, 전자 장치는 활동 2가 디스플레 이 모듈에 출력되도록 할 수 있다. 도 6은 다양한 실시예들에 따라 디스플레이 모듈(예: 도 1의 디스플레이 모듈)에 출력되는 활동을 나타낸 도면이다. 전자 장치의 초기 화면(Home)에서 태스크 A가 실행되면, 도 6 (a)와 같이 활동 a가 디스플레이 모듈 전체 에 출력될 수 있다. 활동 a에서 활동 a를 취소, 종료하는 동작이 실행되는 경우, 전자 장치의 초기 화면 이 출력될 수 있다. 일례로, 활동 a로부터 활동 b가 실행되면, 도 6 (b)와 같이 디스플레이 모듈 좌측 영역에 활동 a, 우측 영역에 활동 b가 출력될 수 있다. 일례로, 활동 b가 출력되는 디스플레이 영역에서 활동 b를 취소, 종료하는 동작이 실행되는 경우, 도 6 (a)와 같이 활동 a가 출력될 수 있다. 일례로, 도 6 (b)의 활동 a에서 활동 c가 실행되면, 도 6 (c)와 같이 디스플레이 모듈 좌측 영역에 활동 a, 우 측 영역에 활동 c가 출력될 수 있다. 일례로, 활동 c가 출력되는 디스플레이 영역에서 활동 c를 취소, 종료하 는 동작이 실행되는 경우, 도 6 (b)와 같이 활동 a 및 활동 b가 출력될 수 있다. 일례로, 도 6 (b)의 활동 b에서 활동 d가 실행되면, 도 6 (d)와 같이 디스플레이 모듈 좌측 영역에 활동 a, 우 측 영역에 활동 d가 출력될 수 있다. 일례로, 활동 d가 출력되는 디스플레이 영역에서 활동 d를 취소, 종료하 는 동작이 실행되는 경우, 도 6 (b)와 같이 활동 a 및 활동 b가 출력될 수 있다. 일례로, 도 6 (b)에서 태스크 B가 실행되면, 활동 e가 디스플레이 모듈 전체에 표시될 수 있다. 일례로, 활동 e가 출력되는 디스플레이 영역에서 활동 e를 취소, 종료하는 동작이 실행되는 경우, 도 6 (b)와 같이 활동 a 및 활동 b가 출력될 수 있다. 일례로, 도 6에서, 복수의 활동들이 실행될 때 디스플레이 모듈의 좌측 영역에는 활동 a가 출력되고, 활동 b, 활동 c 및 활동 d는 디스플레이 모듈의 우측 영역에 출력될 수 있다. 예를 들어, 활동 a, 활동 b, 활동 c 및 활동 d 사이에 정의된 페어 정보는 활동 a가 디스플레이 모듈의 좌측 영 역에 출력되도록 설정될 수 있다. 일례로, 도 6 (b), (c) 및 (d)에서 활동 a가 출력되는 디스플레이 영역에서 활동 a를 취소, 종료하는 동작이 실 행되는 경우, 전자 장치의 초기 화면이 출력될 수 있다. 도 7은 다양한 실시예들에 따른 활동 기록 그룹 및 활동 기록 그룹에 설정된 활동을 나타낸 도면이다. 도 7에 서 활동 기록 그룹(402-1)은 디스플레이 모듈에 출력되는 영역이 좌측 영역(LEFT)이고, 활동 기록 그룹(402- 2)은 디스플레이 모듈에 출력되는 영역이 우측 영역(RIGHT)임을 나타내고 있다. 도 7의 (a), (b), (c)는 각각 도 6의 (b), (c), (d)에서 활동 기록 그룹에 설정된 활동들을 나타낸 도면 이다. 일례로, 도 7의 (a)에는 활동 a(Activity a)가 활동 기록 그룹(402-1), 활동 b(Activity B)가 활동 기록 그룹 (402-2)에 설정되어 있다. 일례로, 전자 장치(예: 도 1의 전자 장치)는 페어 정보에 기초하여, 활동 a 및 활동 b를 각각의 활동 기록 그룹(402-1, 402-2)에 설정할 수 있다. 일례로, 도 7의 (a)에서 전자 장치는 각각의 활동 기록 그룹(402-1, 402-2)에서 디스플레이 모듈에 출력될 활동 을 결정할 수 있다. 예를 들어, 전자 장치는 도 7 (a)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력 될 활동은 활동 a, 활동 기록 그룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 b로 결정할 수 있다. 일례로, 도 7의 (b)에는 활동 a가 활동 기록 그룹(402-1), 활동 b 및 활동 c(Activity c)가 활동 기록 그룹 (402-2)에 설정되어 있다. 일례로, 전자 장치는 활동 a와 활동 c 사이에 정의된 페어 정보에 기초하여, 활동 a 로부터 실행된 활동 c를 활동 기록 그룹(402-2)에 설정할 수 있다. 전자 장치는 도 7 (b)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 a, 활동 기록 그 룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 c로 결정할 수 있다. 일례로, 도 7의 (c)에는 활동 a가 활동 기록 그룹(402-1), 활동 b 및 활동 d(Activity d)가 활동 기록 그룹 (402-2)에 설정되어 있다. 일례로, 전자 장치는 활동 b와 활동 d 사이에 정의된 페어 정보에 기초하여, 활동 b 로부터 실행된 활동 d를 활동 기록 그룹(402-2)에 설정할 수 있다. 전자 장치는 도 7 (c)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 a, 활동 기록 그 룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 d로 결정할 수 있다. 도 8은 다양한 실시예들에 따라 디스플레이 모듈에 출력되는 활동을 나타낸 도면이다. 전자 장치의 초기 화면(Home)에서 태스크 A가 실행되면, 도 8 (a)와 같이 활동 a가 디스플레이 모듈 전체 에 출력될 수 있다. 활동 a에서 활동 a를 취소, 종료하는 동작이 실행되는 경우, 전자 장치의 초기 화면이 출 력될 수 있다. 일례로, 활동 a로부터 활동 b가 실행되면, 도 8 (b)와 같이 디스플레이 모듈 좌측 영역에 활동 a, 우측 영역에 활동 b가 출력될 수 있다. 일례로, 활동 b가 출력되는 디스플레이 영역에서 활동 b를 취소, 종료하는 동작이 실행되는 경우, 도 8 (a)와 같이 활동 a가 출력될 수 있다. 일례로, 활동 a가 출력되는 디스플레이 영역에서 활동 a를 취소, 종료하는 동작이 실행되는 경우, 전자 장치의 초기 화면이 출력될 수 있다. 일례로, 도 8 (b)의 활동 a에서 활동 c가 실행되면, 도 8 (c)와 같이 디스플레이 모듈 좌측 영역에 활동 a, 우 측 영역에 활동 c가 출력될 수 있다. 일례로, 활동 c가 출력되는 디스플레이 영역에서 활동 c를 취소, 종료하 는 동작이 실행되는 경우, 도 8 (b)와 같이 활동 a 및 활동 b가 출력될 수 있다. 일례로, 도 8 (b)의 활동 b에서 활동 d가 실행되면, 도 8 (d)와 같이 디스플레이 모듈 좌측 영역에 활동 b, 우 측 영역에 활동 d가 출력될 수 있다. 일례로, 활동 d가 출력되는 디스플레이 영역에서 활동 d를 취소, 종료하 는 동작이 실행되는 경우, 도 8 (b)와 같이 활동 a 및 활동 b가 출력될 수 있다. 일례로, 활동 b가 출력되는 디스플레이 영역에서 활동 b를 취소, 종료하는 동작이 실행되는 경우, 도 8 (a)와 같이 활동 a가 출력될 수 있 다. 일례로, 도 8 (d)의 활동 b에서 활동 f가 실행되면, 도 8 (e)와 같이 디스플레이 모듈 좌측 영역에 활동 f, 우 측 영역에 활동 d가 출력될 수 있다. 일례로, 활동 f가 출력되는 디스플레이 영역에서 활동 f를 취소, 종료하 는 동작이 실행되는 경우, 도 8 (d)와 같이 활동 b 및 활동 d가 출력될 수 있다. 일례로, 활동 d가 출력되는 디스플레이 영역에서 활동 d를 취소, 종료하는 동작이 실행되는 경우, 도 8 (f)와 같이 활동 f가 출력될 수 있 다. 일례로, 도 8 (d)의 활동 b에서 활동 e가 실행되면, 도 8 (g)와 같이 디스플레이 모듈 좌측 영역에 활동 b, 우 측 영역에 활동 e가 출력될 수 있다. 일례로, 활동 e가 출력되는 디스플레이 영역에서 활동 e를 취소, 종료하 는 동작이 실행되는 경우, 도 8 (d)와 같이 활동 b 및 활동 d가 출력될 수 있다. 일례로, 활동 b가 출력되는 디스플레이 영역에서 활동 b를 취소, 종료하는 동작이 실행되는 경우, 도 8 (a)와 같이 활동 a 가 출력될 수 있 다. 도 9는 다양한 실시예들에 따른 활동 기록 그룹 및 활동 기록 그룹에 설정된 활동을 나타낸 도면이다. 도 9에서 활동 기록 그룹(402-1)은 디스플레이 모듈에 출력되는 영역이 좌측 영역(LEFT)이고, 활동 기록 그룹 (402-2)은 디스플레이 모듈에 출력되는 영역이 우측 영역(RIGHT)임을 나타내고 있다.도 9의 (a), (b), (c), (d), (e), (f)는 각각 도 8의 (b), (c), (d), (e), (f), (g)에서 활동 기록 그룹에 설 정된 활동들을 나타낸 도면이다. 일례로, 도 9의 (a)에는 활동 a(Activity a)가 활동 기록 그룹(402-1), 활동 b(Activity B)가 활동 기록 그룹 (402-2)에 설정되어 있다. 일례로, 전자 장치는 페어 정보에 기초하여, 활동 a 및 활동 b를 각각의 활동 기록 그룹(402-1, 402-2)에 설정할 수 있다. 일례로, 전자 장치는 각각의 활동 기록 그룹(402-1, 402-2)에서 디스플레이 모듈에 출력될 활동을 결정할 수 있 다. 예를 들어, 전자 장치는 도 9 (a)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 a, 활동 기록 그룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 b로 결정할 수 있다. 일례로, 도 9의 (b)에는 활동 a가 활동 기록 그룹(402-1), 활동 b 및 활동 c(Activity c)가 활동 기록 그룹 (402-2)에 설정되어 있다. 일례로, 전자 장치는 활동 a와 활동 c 사이에 정의된 페어 정보에 기초하여, 활동 a 로부터 실행된 활동 c를 활동 기록 그룹(402-2)에 설정할 수 있다. 전자 장치는 도 9 (b)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 a, 활동 기록 그 룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 c로 결정할 수 있다. 일례로, 도 9의 (c)에는 활동 a 및 활동 b가 활동 기록 그룹(402-1), 활동 d(Activity d)가 활동 기록 그룹 (402-2)에 설정되어 있다. 일례로, 전자 장치는 페어 정보에 기초하여, 활동이 속하는 활동 기록 그룹을 변경 할 수 있다. 도 9 (c)와 같이 전자 장치는 활동 b와 활동 d 사이에 정의된 페어 정보에 기초하여, 도 9의 (a) 에서 활동 b가 이전에 속한 활동 기록 그룹(402-2)과 다른 활동 기록 그룹(402-1)으로 변경하고, 활동 b로부터 실행된 활동 d를 활동 기록 그룹(402-2)에 설정할 수 있다. 전자 장치는 도 9 (c)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 b, 활동 기록 그 룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 d로 결정할 수 있다. 일례로, 도 9의 (d)에는 활동 a, 활동 b, 활동 f(Activity f)가 활동 기록 그룹(402-1), 활동 d가 활동 기록 그룹(402-2)에 설정되어 있다. 일례로, 전자 장치는 활동 b와 활동 f 사이에 정의된 페어 정보에 기초하여, 활 동 b로부터 실행된 활동 f를 활동 기록 그룹(402-1)에 설정할 수 있다. 전자 장치는 도 9 (d)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 f, 활동 기록 그 룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 d로 결정할 수 있다. 일례로, 도 9의 (e)에는 활동 a, 활동 b, 활동 f가 활동 기록 그룹(402-1)에 설정되어 있다. 활동 d가 종료되 어, 활동 기록 그룹(402-2)에서 제외되었음을 확인할 수 있다. 전자 장치는 도 9 (e)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 f 로 결정할 수 있다. 활동 기록 그룹(402-2)에 설정된 활동이 없기 때문에, 전자 장치는 디스플레이 모듈 전체에 활동 f를 출 력할 수 있다. 일례로, 도 9의 (f)에는 활동 a, 활동 b, 가 활동 기록 그룹(402-1), 활동 d 및 활동 e(Activity e)가 활동 기 록 그룹(402-2)에 설정되어 있다. 일례로, 전자 장치는 활동 b와 활동 e 사이에 정의된 페어 정보에 기초하여, 활동 b로부터 실행된 활동 e를 활동 기록 그룹(402-2)에 설정할 수 있다. 전자 장치는 도 9 (f)에서 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 b, 활동 기록 그 룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 e로 결정할 수 있다. 상기의 도 6 내지 도 9에 관한 설명에서, 활동 기록 그룹(402-1, 402-2)에 설정된 활동들은 수명 주기가 보장될 수 있다. 전자 장치는 디스플레이 모듈에 출력되는 상태(resumed), 다른 활동에 가려진 상태(stopped), 종료 중인 상태(finishing)과 같이 활동 기록 그룹(402-1, 402-2)에 포함된 활동의 활동 상태에 관한 정보를 결정함 으로써, 다른 활동에 가려진 상태의 활동과 같이 디스플레이 모듈에 출력되지 않는 활동에 대해서도 수명 주기 를 보장할 수 있다. 일례로, 전자 장치는 활동 기록 그룹(402-1, 402-2)에 포함된 활동들의 가시성을 결정할 수 있다. 전자 장치는 복수의 활동 기록 그룹(402-1, 402-2) 각각에 대하여 활동의 가시성을 결정함으로써, 도 6 내지 도 9에서 설명 한 바와 같이 디스플레이 모듈에 복수의 활동을 출력할 수 있다. 예를 들어, 도 7의 (c)에서 전자 장치는 활동 기록 그룹(402-1)에서 디스플레이 모듈에 출력될 활동은 활동 a, 활동 기록 그룹(402-2)에서 디스플레이 모듈에 출력될 활동은 활동 d로 결정할 수 있다. 활동 기록에 기록된 활동 a, b, d에서 활동 a 및 활동 d가 디스플레이 모듈에 출력되는 상태(resumed)로 결정될 수 있고, 활동 b는 다른 활동에 가려진 상태(stopped)로 결정될 수 있다. 디스플레이 모듈에 출력되는 활동 a 및 활동 d의 크기 및 위치는 각각의 활동이 속한 활동 기록 그룹(402-1, 402-2)의 경계값(bounds)에 따라 결정될 수 있다. 상기의 도 6 내지 도 9를 참조하면, 다양한 실시예들에 따른 전자 장치는 페어 정보에 기초하여 복수의 활동이 설정될 활동 기록 그룹을 결정할 수 있다. 일례로, 페어 정보는 소스 활동과 타겟 활동이 설정될 활동 기록 그 룹에 관한 정보를 포함할 수 있다. 예를 들어, 도 6의 (d)와 도 8의 (d)는 활동 a로부터 활동 b가 실행되고, 활동 b로부터 활동 d가 실행된 경우 전자 장치가 디스플레이 모듈에 출력하는 활동을 나타내고 있다. 도 6의 (d)의 경우, 전자 장치는 활동 a 및 활동 d를 출력하고 있으나, 도 8의 (d)에서 전자 장치는 활동 b 및 활동 d를 출력하고 있음을 확인할 수 있다. 도 7의 (c)와 도 9의 (c)는 각각 도 6의 (d)와 도 8의 (d)에서 활동 기록 그룹에 설정된 활동들을 나타낸다. 도 7의 (c)에서 활동 a가 활동 기록 그룹(402-1)에 설정되고, 활동 b 및 활동 d가 활동 기록 그룹(402-2)에 설 정됨에 반하여, 도 9의 (c)에서 활동 a 및 활동 b가 활동 기록 그룹(402-1)에 설정되고, 활동 d가 활동 기록 그 룹(402-2)에 설정됨을 확인할 수 있다. 상기의 예시에서, 동일한 활동이 동일한 순서로 실행되더라도 페어 정보에 따라 복수의 활동이 설정되는 활동 기록 그룹이 달라질 수 있다. 예를 들어, 도 6의 (c)에서 활동 b와 활동 d에 관한 페어 정보에서, 활동 b 및 활동 d는 활동 기록 그룹(402-2)에 설정되도록 정의될 수 있다. 도 8의 (c)의 활동 b와 활동 d에 관한 페어 정보에서, 활동 b는 활동 기록 그룹(402-1), 활동 d는 활동 기록 그룹(402-2)에 설정되도록 정의될 수 있다. 도 10은 다양한 실시예들에 따른 전자 장치의 폼팩터를 나타낸 도면이다. 다양한 실시예들에 따르면, 전자 장치의 폼팩터가 도 10 (a)와 같이 슬라이드블, 롤러블, 폴딩, 플렉스와 같은 다양한 폼팩터가 적용될 수 있다. 다양한 실시예들에 따른 전자 장치는 디스플레이 모듈의 정보 및 상태에 따라 복수의 활동을 출력할 수 있는 출 력 영역을 식별할 수 있다. 일례로, 슬라이더블 또는 롤러블 타입의 전자 장치는, 디스플레이 모듈의 정보를 이용하여, 디스플레이 모듈의 확장 상태에 따라 출력 영역을 식별할 수 있다. 일례로, 폴딩 타입, 플렉스 타입의 전자 장치는 디스플레이 모 듈의 정보를 이용하여, 디스플레이 모듈의 접힘 상태 또는 펼침 상태에 따라 출력 영역을 식별할 수 있다. 도 10의 (b)는 다양한 실시예들에 따른 전자 장치의 폼팩터를 나타낸 도면이다. 일례로, 전자 장치는 디스플레 이 모듈의 정보를 이용하여 디스플레이 모듈의 접힘 상태 또는 펼첨 상태를 식별하여, 복수의 활동을 출력할 수 있는 출력 영역을 식별할 수 있다. 폴딩 타입의 전자 장치는 도 10 (b)에 도시된 Tri Fold, Z Fold, Half Fold, Double Parallel Reverse Fold, Double Parallel Fold, Single Open Gate Fold, Double Gate Fold, Roll Fold(4 Panel), Accordian Fold(4 Panel), Half Fold then Half Fold, Half Fold then Tri Fold와 같이 다앙한 타입의 폼팩터가 적용될 수 있다. 도 11 내지 도 14는 다양한 실시예들에 따른 전자 장치의 폼팩터에 대응하여 디스플레이 모듈에 출력되는 복수 의 활동을 나타낸 도면이다. 도 11 내지 도 14를 참조하면, 다양한 실시예들에 따른 전자 장치는 출력 영역에 대응하여 하나 이상의 활동을 디스플레이 모듈에 출력할 수 있다. 도 11은 롤러블 또는 슬라이더블 타입의 디스플레이 모듈을 포함하는 전자 장치에서 출력되는 활동을 나타낸 도 면이다. 도 11 (a)는 확장되지 않은 기본 상태의 디스플레이 모듈(160a)에서 활동 A1이 디스플레이 모듈에 출력되는 상 태를 나타낸 도면이다. 도 11의 (b)를 참조하면, 다양한 실시예들에 따른 전자 장치는 출력 영역의 변화에 따라 하나 이상의 활동을 디 스플레이 모듈에 출력할 수 있다. 도 11 (b)는 도 11 (a)에서 확장된 상태의 디스플레이 모듈(160b)를 나타낸 다. 전자 장치는 확장된 디스플레이 모듈(160b)의 좌측 영역에 활동 A1을 출력하고, 확장된 디스플레이 모듈 (160b)의 우측 영역에 활동 A2를 출력할 수 있다.도 11의 (c)를 참조하면, 다양한 실시예들에 따른 전자 장치는 출력 영역의 변화에 따라, 활동 기록 그룹에 설 정된 활동을 변경할 수 있다. 도 11 (c)는 도 11 (b)에서 확장된 상태의 디스플레이 모듈(160c)를 나타낸다. 도 11 (b)의 경우, 디스플레이 모듈의 좌측 영역에 대응하는 활동 기록 그룹은 활동 A1, 디스플레이 모듈의 우 측 영역에 대응하는 활동 기록 그룹은 활동 A2를 포함할 수 있다. 일례로, 도 11의 (c)에서 활동 A2는 이전의 도 11 (b)와 다른 활동 기록 그룹에 설정될 수 있다. 예를 들어, 도 11 (c)에서, 활동 A2는 확장된 디스플레이 모듈(160c)의 우상단(Right-Top)에 대응하는 활동 기록 그룹에 설 정될 수 있다. 전자 장치는 디스플레이 모듈이 확장함에 따라 출력 영역의 변화를 식별하고, 활동 A2를 다른 활동 기록 그룹에 포함되도록 설정할 수 있다. 즉, 전자 장치는 기존에 실행되고 있던 활동들로부터 새로운 활동이 실행되는 경우 외에도, 디스플레이 모듈 이 확장, 축소, 펼침, 접힘에 따른 디스플레이 모듈의 상태 변화에 의한 출력 영역의 변화에 대응하 여, 복수의 활동의 활동 기록 그룹을 변경할 수 있다. 일례로, 전자 장치는 출력 영역의 변화에 대응하여 하나 이상의 활동을 디스플레이 모듈에 출력하도록 할 수 있다. 일례로, 전자 장치는 출력 영역의 변화에 대응하여, 활동 기록에 포함된 활동에 관한 정보를 변경할 수 있다. 전자 장치는, 디스플레이 모듈의 출력 영역이 변화함에 따라 활동 기록 그룹에 포함된 활동의 가시성 및 수명 주기를 결정할 수 있다. 전자 장치는 활동 기록 그룹에 포함된 활동의 가시성 및 수명 주기가 변경되면, 활동 기록에 포함된 활동에 관한 정보를 결정할 수 있다. 예를 들어, 도 11의 (b)에서 활동 기록에 포함된 활동 A2의 영역은 우측 영역(또는 중간 영역), 활동 A2가 속한 활동 기록 그룹은 디스플레이 모듈의 우측 영역에 대응하는 활동 기록 그룹에 해당할 수 있다. 디스플레이 모 듈의 출력 영역이 변경되는 도 11의 (c)에서 활동 기록에 포함된 활동 A2의 영역은 우상단 영역, 활동A2 가 속 한 활동 기록 그룹은 디스플레이 모듈의 우상단 영역에 대응하는 활동 기록 그룹에 해당할 수 있다. 예를 들어, 도 11의 (b)에서 활동 기록에 포함된 활동 A3의 활동 상태를 다른 활동에 가려진 상태(stopped)일 수 있고, (c)에서 A3의 활동 상태는 디스플레이 모듈에 출력되는 상태(resumed)일 수 있다. 즉, 전자 장치는 디스플레이 모듈의 출력 영역이 확장됨에 따라, 활동 A2, A3의 가시성, 수명 주기, 영역과 같 은 활동에 관한 정보를 변경할 수 있다. 도 11의 (c)에서 전자 장치는 확장된 디스플레이 모듈(160c)의 좌측 영역에 활동 A1을 출력하고, 확장된 디스플 레이 모듈(160c)의 우상단 영역에 활동 A2, 확장된 디스플레이 모듈(160c)의 우하단(Right-Bottom) 영역에 활동 A3를 출력할 수 있다. 활동 A3는 확장된 디스플레이 모듈의 우하단 영역에 대응하는 활동 기록 그룹에 설정된 것일 수 있다. 일례로, 활동 기록 그룹의 경계값(bounds)는 디스플레이 모듈의 정보에 기초하여 결정될 수 있다. 예를 들어, 상기 도 11에서 디스플레이 모듈의 좌측, 우측, 우상단, 우하단 영역에 대응하는 활동 기록 그룹의 경계값들은 디스플레이 모듈이 크기에 따라 결정될 수 있다. 도 12는 다양한 실시예들에 따른 플렉스 타입의 전자 장치에서 출력되는 활동을 나타낸 도면이다. 도 12에서 전자 장치는 펼침 상태의 디스플레이 모듈(160d)에 활동 A1을 출력할 수 있다. 전자 장치는 굽힘 또 는 접힘 상태의 디스플레이 모듈(160e)의 상단 영역에 활동 A1, 하단 영역에 활동 A2를 출력할 수 있다. 예를 들어, 상단 영역에 대응하는 활동 기록 그룹은 활동 A1을 포함하고, 하단 영역에 대응하는 활동 기록 그룹 은 활동 A2을 포함할 수 있다. 전자 장치는 펼침 상태에서는 상단 영역에 대응하는 활동 기록 그룹에 포함된 활동 A1만 디스플레이 모듈(160d)에 출력되도록 할 수 있다. 활동 A1만 출력되기 때문에, 전자 장치는 디스플 레이 모듈(160d) 전체에 활동 A1을 출력할 수 있다. 디스플레이 모듈의 상태가 변경되어 굽힘 상태가 되는 경우, 전자 장치는 상단 영역에 대응하는 활동 기록 그룹 에 포함된 활동 A1, 하단 영역에 대응하는 활동 기록 그룹에 포함된 활동 A2가 디스플레이 모듈(160e)에 출력되 도록 할 수 있다. 각각의 활동은 활동이 속한 활동 기록 그룹에 설정된 경계값에 대응하는 디스플레이 모듈 (160e)의 위치에 출력될 수 있다. 도 13은 다양한 실시예들에 따른 z 폴딩 타입의 전자 장치에서 출력되는 활동을 나타낸 도면이다. 도 13에서 전자 장치는 접힘 상태의 디스플레이 모듈(160f)에 활동 A1을 출력할 수 있다. 전자 장치는 펼침 상 태의 디스플레이 모듈(160g)의 좌측 영역에 활동 A1, 중간 영역에 활동 A2, 우측 영역에 활동 A3를 출력할 수 있다. 도 14는 다양한 실시예들에 따른 폴딩 타입의 전자 장치에서 출력되는 활동을 나타낸 도면이다. 도 14에서 전자 장치는 접힘 상태에서 제1 디스플레이 모듈(160h)에 활동 A2를 출력할 수 있다. 전자 장치는 펼침 상태에서 제2 디스플레이 모듈(160i)의 우측 영역에 활동 A1, 좌측 영역에 활동 A2를 출력할 수 있다. 도 14에서 제1 디스플레이 모듈(160h)는 접힘 상태에서 외부로 시각적으로 노출되는 디스플레이 모듈에 해당할 수 있고, 제2 디스플레이 모듈(160i)는 제1 디스플레이 모듈(160h)의 반대면에 구비된 디스플레이 모듈에 해당 할 수 있다. 도 15는 다양한 실시예들에 따른 태스크(예: 도4의 태스크)의 상태 정보를 나타낸 도면이다. 일례로, 태 스크의 상태 정보는, 태스크에서 실행되는 복수의 활동을 디스플레이 모듈(예: 도 1의 디스플레이 모듈)에 출력할지 여부를 나타내는 정보를 의미할 수 있다. 일례로, 전자 장치는 사용자의 입력에 기초하여 태스 크의 상태 정보를 설정할 수 있다. 일례로, 전자 장치는 태스크의 상태 정보에 기초하여, 단일 활동 또는 복수의 활동을 디스플레이 모듈에 출력할 수 있다. 도 15의 (a) 및 (b)는 다양한 실시예들에 따른 전자 장치가 태스크의 상태 정보를 표시 및/또는 설정하기 위한 UI에 해당할 수 있다. 도 15에 도시된 전자 장치의 UI는 태스크의 상태 정보를 설정하기 위한 일 예 시로, 도 15에 도시된 UI와 다른 다양한 UI를 제공하여, 사용자에게 태스크의 상태 정보를 제공하고, 태스크의 상태 정보를 설정하기 위한 사용자의 입력을 수신할 수 있다. 도 15의 (a)를 참조하면, 전자 장치는 태스크에서 실행되는 복수의 활동을 디스플레이 모듈에 출력할지 여 부를 표시 및/또는 설정하기 위한 메뉴를 디스플레이 모듈에 제공할 수 있다. 도 15의 (a)와 같이, 전자 장치 는 태스크의 상태 정보를 사용자가 설정하기 위하여, 앱 화면 나눠서 보기(A)와 같은 메뉴를 UI로 제공할 수 있다. 도 15의 (b)는 도 15의 (a)에서 사용자로부터 앱 화면 나눠서 보기(A)에 대한 입력을 수신하였을 때, 전자 장치 가 제공하는 UI를 나타낸 도면이다. 도 15의 (b)에서, 어플리케이션 A의 상태 정보는 비활성화된 상태(B), 어플리케이션 B의 상태 정보는 활성화된 상태(C)임을 확인할 수 있다. 비활성화된 상태(B)는 Activity-split off 상태, 활성화된 상태(C)는 Activity- split on 상태로 호칭될 수 있다. 일례로, 전자 장치는 태스크의 상태 정보에 기초하여, 하나의 활동 또는 복수의 활동을 디스플레이 모듈에 출력할 수 있다. 일례로, 전자 장치는 사용자의 입력에 기초하여, 태스크의 상태 정보를 변경할 수 있다. 전자 장치는 어플리케이션 A에서 활동 A1으로부터 활동 A2가 실행되고, 활동 A1과 활동 A2 사이의 페어 정 보가 정의되어 있는 경우에도, 어플리케이션 A의 비활성화(B)된 상태 정보에 기초하여, 활동 A2를 디스플레이 모듈에 출력할 수 있다. 즉, 전자 장치는 태스크의 상태 정보가 비활성화된 상태(B)인 경우, 태스크에서 복수의 활동이 실행되고, 복수의 활동 사이에 정의된 페어 정보를 식별한 경우에도, 단일 활동을 디스플레이 모듈에 출력할 수 있다. 전자 장치는 어플리케이션 B에서 활동 B1으로부터 활동 B2가 실행되고, 활동 B1과 활동 B2 사이의 페어 정 보가 정의되어 있는 경우, 어플리케이션 B의 활성화(C)된 상태 정보에 기초하여, 활동 B1 및 활동 B2를 디스플 레이 모듈에 출력할 수 있다. 도 15에서 전자 장치는 사용자로부터 수신한 입력에 기초하여, 태스크의 상태 정보를 설정 및/또는 변경할 수 있다. 일례로, 태스크가 전자 장치에 신규로 설치되는 경우, 태스크의 상태 정보는 활성화된 상태 또 는 비활성화된 상태로 설정될 수 있다. 일례로, 신규로 설치된 태스크의 상태 정보의 초기값은 사용자의 설정 또는 전자 장치에 미리 설정된 초기값에 따라 결정될 수 있다. 일례로, 전자 장치에 태스크가 신규로 설치된 경우, 전자 장치는 태스크의 상태 정보를 설정하기 위 한 UI를 사용자에게 제공할 수 있다. 전자 장치는 사용자로부터 수신한 입력에 기초하여 신규로 설치된 태스크의 상태 정보를 설정할 수 있다.일례로, 전자 장치는 태스크의 상태 정보가 비활성화(B)된 상태인 경우, 페어 정보에 기초하여 태스크에서 실행되는 복수의 활동을 복수의 활동 기록 그룹(예: 도 4의 활동 기록 그룹)에 설정할 수 있다. 예를 들 어, 태스크에서 페어 정보가 정의된 복수의 활동이 실행되고, 태스크의 상태 정보가 비활성화(B) 상태에서 활성 화(C) 상태로 변경되는 경우, 전자 장치는 태스크의 상태 정보 및 페어 정보에 기초하여 복수의 활동을 디 스플레이 모듈에 출력할 수 있다. 다양한 실시예들에 따른 디스플레이 모듈 출력 방법은, 동일한 태스크(예: 도 5의 태스크)에서 실행 되는 복수의 활동을 식별하는 단계, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식별하는 단계, 상 기 페어 정보에 기초하여, 적어도 하나 이상의 활동을 디스플레이 모듈에 출력하는 단계를 포함할 수 있다. 상기 디스플레이 모듈 출력 방법은, 상기 페어 정보에 기초하여, 상기 디스플레이 모듈에 상기 활동을 출 력할 영역에 따라 구분되는 복수의 활동 기록 그룹(예: 도 5의 활동 기록 그룹)에 상기 복수의 활동 을 설정하는 단계 및 상기 복수의 활동 기록 그룹에서 상기 디스플레이 모듈에 출력할 활동을 결정하 는 단계를 더 포함할 수 있다. 상기 복수의 활동 기록 그룹은, 상기 복수의 활동 기록 그룹에 설정된 활동들의 가시성(visibility) 및 수명 주기(lifecycle)를 결정할 수 있다. 상기 복수의 활동을 설정하는 단계는, 상기 페어 정보에 기초하여 상기 복수의 활동이 설정될 상기 활동 기록 그룹을 결정할 수 있다. 상기 페어 정보를 식별하는 단계는, 전자 장치와 통신 가능한 서버로부터 수신한 상기 페어 정보, 상 기 태스크에 미리 설정된 상기 페어 정보 및 사용자의 입력에 따라 설정된 상기 페어 정보 중 적어도 어느 하나를 식별할 수 있다. 상기 디스플레이 모듈 출력 방법은, 상기 디스플레이 모듈에 출력되는 적어도 하나 이상의 활동에 기초하 여, 상기 디스플레이 모듈의 상측에 표시되는 인디케이터를 출력할 수 있다. 상기 디스플레이 모듈 출력 방법은, 상기 디스플레이 모듈의 정보 및 상태에 따라 상기 복수의 활동을 출 력할 수 있는 출력 영역을 식별하는 단계를 더 포함하고, 상기 하나 이상의 활동을 디스플레이 모듈에 출 력하는 단계는, 상기 출력 영역에 대응하여, 상기 적어도 하나 이상의 활동을 상기 디스플레이 모듈에 출 력할 수 있다. 다양한 실시예들에 따른 디스플레이 모듈 출력 방법을 수행하는 전자 장치는 디스플레이 모듈 및 프 로세서를 포함하고, 상기 프로세서는, 동일한 태스크(예: 도 5의 태스크)에서 실행되는 복 수의 활동을 식별하고, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식별하고, 상기 페어 정보에 기 초하여, 적어도 하나 이상의 활동을 상기 디스플레이 모듈에 출력할 수 있다. 상기 프로세서는, 상기 디스플레이 모듈에 상기 활동을 출력할 영역에 따라 구분되는 복수의 활동 기 록 그룹(예: 도 5의 활동 기록 그룹)에 상기 복수의 활동을 설정하고, 상기 복수의 활동 기록 그룹 에서 상기 디스플레이 모듈에 출력할 활동을 결정할 수 있다. 상기 프로세서는, 상기 복수의 활동 기록 그룹에 설정된 활동들의 가시성(visibility) 및 수명 주기 (lifecycle)를 결정할 수 있다. 상기 프로세서는, 상기 페어 정보에 기초하여 상기 복수의 활동이 설정될 상기 활동 기록 그룹을 결 정할 수 있다. 상기 프로세서는, 상기 전자 장치와 통신 가능한 서버로부터 수신한 상기 페어 정보, 상기 태스 크에 미리 설정된 상기 페어 정보 및 사용자의 입력에 따라 설정된 상기 페어 정보 중 적어도 어느 하나를 식별할 수 있다. 상기 프로세서는, 상기 디스플레이 모듈에 출력되는 적어도 하나 이상의 활동에 기초하여, 상기 디스 플레이 모듈의 상측에 표시되는 인디케이터를 출력할 수 있다. 상기 프로세서는, 상기 디스플레이 모듈 영역의 변화에 따라 상기 복수의 활동을 출력할 수 있는 출력 영 역을 식별하고, 상기 출력 영역에 대응하여, 상기 적어도 하나 이상의 활동을 상기 디스플레이 모듈에 출력할 수 있다. 다양한 실시예들에 따른 디스플레이 모듈 출력 방법을 수행하는 전자 장치는, 디스플레이 모듈 및 프 로세서를 포함하고, 상기 프로세서는, 사용자의 입력에 기초하여 태스크의 상태 정보를 설정하고, 동 일한 태스크에서 실행되는 복수의 활동을 식별하고, 상기 복수의 활동 간의 관계에 관한 페어(pair) 정보를 식 별하고, 상기 페어 정보 및 상기 상태 정보에 기초하여, 적어도 하나 이상의 활동을 상기 디스플레이 모듈(16 0)에 출력할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2021-0105474", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 다양한 실시예들에 따른 전자 장치의 동작 흐름도이다. 도 3은 다양한 실시예들에 따라 디스플레이 모듈에 출력되는 활동을 나타낸 도면이다. 도 4는 다양한 실시예들에 따른 활동 기록 그룹을 나타낸 도면이다. 도 5는 다양한 실시예들에 따른 전자 장치의 동작을 나타낸 도면이다. 도 6은 다양한 실시예들에 따라 디스플레이 모듈에 출력되는 활동을 나타낸 도면이다. 도 7은 다양한 실시예들에 따른 활동 기록 그룹 및 활동 기록 그룹에 설정된 활동을 나타낸 도면이다. 도 8은 다양한 실시예들에 따라 디스플레이 모듈에 출력되는 활동을 나타낸 도면이다. 도 9는 다양한 실시예들에 따른 활동 기록 그룹 및 활동 기록 그룹에 설정된 활동을 나타낸 도면이다. 도 10은 다양한 실시예들에 따른 전자 장치의 폼팩터를 나타낸 도면이다. 도 11 내지 도 14는 다양한 실시예들에 따른 전자 장치의 폼팩터에 대응하여 디스플레이 모듈에 출력되는 복수 의 활동을 나타낸 도면이다. 도 15는 다양한 실시예들에 따른 태스크의 상태 정보를 나타낸 도면이다."}
