{"patent_id": "10-2024-7041711", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0016194", "출원번호": "10-2024-7041711", "발명의 명칭": "멀티 PRACH 전송 설정 방법, 장치", "출원인": "베이징 시아오미 모바일 소프트웨어 컴퍼니 리미", "발명자": "찌앙, 씨아오웨이"}}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "네트워크측 기기에 의해 수행되는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법에 있어서, 제1 멀티 PRACH 전송 설정 및 제2 멀티 PRACH 전송 설정 중의 적어도 하나를 포함하는 멀티 PRACH 전송 설정을단말 기기에 송신하는 단계 - 상기 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 단말 기기에 의해 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및 상기 제2 멀티PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송 중의 적어도 하나를 수신하는 단계; 를 포함하는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함하는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH 순서(PDCCH order)를 상기 단말 기기에 송신하는 단계를포함하고, 상기 PDCCH order에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는상기 제1 멀티 PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 공개특허 10-2025-0016194-3-상기 전환에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated를 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 빔 실패 회복 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 빔 실패 회복 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함하는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 상기 제2 멀티 PRACH 전송 설정을 상기 단말 기기에 송신하는 단계를 포함하는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 브로드캐스트 시그널링은 시스템 메시지 블록1(SIB1)을 포함하는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함하는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2025-0016194-4-제8항에 있어서,상기 제2 멀티 PRACH 전송 설정을 상기 단말 기기에 송신하는 단계는, 공공 랜덤 액세스 채널(RACH) 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함되는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 RACH 설정을 단말 기기에 송신하는 단계는, SIB1의 최초 BWP 설정의 제1 랜덤 액세스 공공 설정(RACH-ConfigCommon)을 상기 단말 기기에 송신하는 단계를포함하고, 상기 제1 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 RACH 설정을 단말 기기에 송신하는 단계는, RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 제2 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제8항에 있어서,상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전용 RACH 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 전용 RACH 설정에는 상기 제2 멀티 PRACH전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 전용 RACH 설정을 상기 단말 기기에 송신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 빔 실패 회복 설정(BeamFailureRecoveryConfig)을 상기 단말기기에 송신하는 단계를 포함하고, 상기 BeamFailureRecoveryConfig에는 상기 전용 RACH 설정에 설정된 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,공개특허 10-2025-0016194-5-상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated에는 상기 전용 RACH 설정에 설정된 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, RACH-ConfigDedicated를 상기 단말 기기에 송신하는 단계를포함하고, 상기 RACH-ConfigDedicated의 CBRA 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 특징 그룹(feature combination)의 RACH 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 featurecombination의 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함하고, 상기 CoverageEnhancement feature은 상기 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용되는,것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "단말 기기에 의해 수행되는 멀티 PRACH 전송 설정 방법에 있어서,네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계 - 상기 멀티 PRACH 전송 설정은 제1 멀티PRACH 전송 설정 및 제2 멀티 PRACH 전송 설정 중의 적어도 하나를 포함하고, 상기 제1 멀티 PRACH 전송 설정은CFRA의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및 상기 제2 멀티 PRACH 전송 설정에 따라시작된 CBRA 멀티 PRACH 전송 중의 적어도 하나를 상기 네트워크측 기기에 송신하는 단계; 를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서,상기 CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및공개특허 10-2025-0016194-6-PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함하는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서,상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 PDCCH에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 PDCCH order를 수신하는 단계를 포함하고, 상기 PDCCH order에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제22항에 있어서,상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제22항에 있어서,상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 전환에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제22항에 있어서,상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 빔 실패 회복 설정을수신하는 단계를 포함하고, 상기 빔 실패 회복 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서,상기 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함하는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "공개특허 10-2025-0016194-7-제21항에 있어서,상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송설정을 수신하는 단계를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제28항에 있어서,상기 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함하는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제28항에 있어서,상기 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함하는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제28항에 있어서,상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 RACH 설정을 수신하는 단계를 포함하고, 상기 RACH 설정에는 상기 제2 멀티PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제31항에 있어서,상기 RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함되는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제31항에 있어서,상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 SIB1의 최초 BWP 설정의 제1 RACH-ConfigCommon을 수신하는 단계를 포함하고,상기 제1 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제31항에 있어서,공개특허 10-2025-0016194-8-상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 수신하는단계를 포함하고, 상기 제2 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제28항에 있어서,상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 전용 RACH 설정을 수신하는 단계를 포함하는, 상기 전용 RACH 설정에는 상기제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제35항에 있어서,상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 빔 실패 회복 설정(BeamFailureRecoveryConfig)을 수신하는 단계를 포함하고, 상기 BeamFailureRecoveryConfig에는 상기 전용RACH 설정에 설정된 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제35항에 있어서,상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 전용 RACH-ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated에는 상기 전용 RACH 설정에 설정된상기 제2 멀티 PRACH 전송 설정이 운송되어 있는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제35항에 있어서,상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는단계를 포함하고, 상기 RACH-ConfigDedicated의 CBRA 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어있는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제37항에 있어서,상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 feature combination의 RACH 설정을 수신하는 단계를 포함하고, 상기 featurecombination의 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법.공개특허 10-2025-0016194-9-청구항 40 제39항에 있어서,상기 feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함하고, 상기 CoverageEnhancement feature은 상기 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용되는,것을 특징으로 하는 멀티 PRACH 전송 설정 방법."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "멀티 PRACH 전송 설정 장치에 있어서,제1 멀티 PRACH 전송 설정 및 제2 멀티 PRACH 전송 설정 중의 적어도 하나를 포함하는 멀티 PRACH 전송 설정을단말 기기에 송신하는 송신 모듈 - 상기 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀티 PRACH 전송 설정에 사용되고, 상기 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 단말 기기에 의해 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및 상기 제2 멀티PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송 중의 적어도 하나를 수신하는 수신 모듈; 를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 장치."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "멀티 PRACH 전송 설정 장치에 있어서,네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 수신 모듈 - 상기 멀티 PRACH 전송 설정은 제1멀티 PRACH 전송 설정 및 제2 멀티 PRACH 전송 설정 중의 적어도 하나를 포함하고, 상기 제1 멀티 PRACH 전송설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및 상기 제2 멀티 PRACH 전송 설정에 따라시작된 CBRA 멀티 PRACH 전송 중의 적어도 하나를 상기 네트워크측 기기에 송신하는 송신 모듈; 을 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 장치."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "네트워크측 기기에 있어서,프로세서; 및 컴퓨터 프로그램이 저장되어 있는 메모리; 를 포함하고, 상기 프로세서는 상기 메모리에 저장된 컴퓨터 프로그램을 수행하여, 상기 네트워크측 기기가 제1항 내지 제20항 중 어느 한 항의 방법을 수행하도록 하는, 것을 특징으로 하는 네트워크측 기기."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "단말 기기에 있어서,프로세서; 및 컴퓨터 프로그램이 저장되어 있는 메모리; 를 포함하고, 상기 프로세서는 상기 메모리에 저장된 컴퓨터 프로그램을 수행하여, 상기 단말 기기가 제21항 내지 제40항 중어느 한 항의 방법을 수행하도록 하는, 것을 특징으로 하는 단말 기기."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "공개특허 10-2025-0016194-10-통신 장치에 있어서,프로세서 및 인터페이스 회로를 포함하고, 상기 인터페이스 회로는 코드 명령을 수신하여 상기 프로세서에 송신하고, 상기 프로세서는 상기 코드 명령을 실행하여 제1항 내지 제20항 중 어느 한 항의 방법을 수행하는, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "통신 장치에 있어서,프로세서 및 인터페이스 회로를 포함하고, 상기 인터페이스 회로는 코드 명령을 수신하여 상기 프로세서에 송신하고, 상기 프로세서는 상기 코드 명령을 실행하여 제21항 내지 제40항 중 어느 한 항의 방법을 수행하는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체에 있어서,상기 명령이 수행될 경우, 제1항 내지 제20항 중 어느 한 항의 방법이 구현되는,것을 특징으로 하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2024-7041711", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체에 있어서,상기 명령이 수행될 경우, 제21항 내지 제40항 중 어느 한 항의 방법이 구현되는,것을 특징으로 하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2024-7041711", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 멀티 PRACH 전송 설정 방법, 장치, 기기 및 저장 매체를 제공하고, 통신"}
{"patent_id": "10-2024-7041711", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 속한다. 당해 방 법은 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하는 멀티 PRACH 전송 설정을 단말 기 기에 송신하는 단계 - 상기 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 (뒷면에 계속) 대 표 도 - 도1"}
{"patent_id": "10-2024-7041711", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2025-0016194 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 단말 기기에 의해 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신하는 단계; 를 포함한다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. CPC특허분류 H04W 72/0453 (2023.01) H04W 74/0838 (2024.01) H04W 74/0866 (2013.01)명 세 서 청구범위 청구항 1 네트워크측 기기에 의해 수행되는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법에 있어서, 제1 멀티 PRACH 전송 설정 및 제2 멀티 PRACH 전송 설정 중의 적어도 하나를 포함하는 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계 - 상기 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA) 의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 단말 기기에 의해 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송 중의 적어도 하나를 수신하는 단계; 를 포함하는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 2 제1항에 있어서, 상기 CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함하는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 3 제2항에 있어서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH 순서(PDCCH order)를 상기 단말 기기에 송신하는 단계를 포함하고, 상기 PDCCH order에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 4 제2항에 있어서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 전용 랜덤 액세스 설정(RACH- ConfigDedicated)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 5 제2항에 있어서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 전환에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated를 상기 단말 기기에 송신하는 단계를 포 함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 6 제2항에 있어서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 빔 실패 회복 설정을 상기 단말 기기에 송신하는 단계 를 포함하고, 상기 빔 실패 회복 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 7 제6항에 있어서, 상기 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함하는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 8 제1항에 있어서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 상기 제2 멀티 PRACH 전송 설정을 상기 단말 기기에 송신하 는 단계를 포함하는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 9 제8항에 있어서, 상기 브로드캐스트 시그널링은 시스템 메시지 블록1(SIB1)을 포함하는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 10 제8항에 있어서, 상기 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함하는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 11 제8항에 있어서, 상기 제2 멀티 PRACH 전송 설정을 상기 단말 기기에 송신하는 단계는, 공공 랜덤 액세스 채널(RACH) 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH 설정에는 상기 제 2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 12 제11항에 있어서, 상기 RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함되는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 13 제11항에 있어서, 상기 RACH 설정을 단말 기기에 송신하는 단계는, SIB1의 최초 BWP 설정의 제1 랜덤 액세스 공공 설정(RACH-ConfigCommon)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 제1 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 14 제11항에 있어서, 상기 RACH 설정을 단말 기기에 송신하는 단계는, RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 상기 단말 기기에 송신하는 단계를 포함하 고, 상기 제2 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 15 제8항에 있어서, 상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전용 RACH 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 전용 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 16 제15항에 있어서, 상기 전용 RACH 설정을 상기 단말 기기에 송신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 빔 실패 회복 설정(BeamFailureRecoveryConfig)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 BeamFailureRecoveryConfig에는 상기 전용 RACH 설정에 설정된 상기 제 2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 17 제15항에 있어서,상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated에는 상기 전용 RACH 설정에 설정된 상 기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 18 제15항에 있어서, 상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, RACH-ConfigDedicated를 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CBRA 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 19 제17항에 있어서, 상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 특징 그룹(feature combination)의 RACH 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 feature combination의 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 20 제19항에 있어서, 상기 feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함하고, 상기 Coverage Enhancement feature은 상기 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는 데 사용되는, 것을 특징으로 하는 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법. 청구항 21 단말 기기에 의해 수행되는 멀티 PRACH 전송 설정 방법에 있어서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계 - 상기 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및 제2 멀티 PRACH 전송 설정 중의 적어도 하나를 포함하고, 상기 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사 용됨 - ; 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송 중의 적어도 하나를 상기 네트워크측 기기에 송신하는 단계; 를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 22 제21항에 있어서, 상기 CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 23 제22항에 있어서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 PDCCH에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 PDCCH order를 수신하는 단 계를 포함하고, 상기 PDCCH order에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 24 제22항에 있어서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH- ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 25 제22항에 있어서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 전환에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신 하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 26 제22항에 있어서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 빔 실패 회복 설정을 수신하는 단계를 포함하고, 상기 빔 실패 회복 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 27 제26항에 있어서, 상기 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 28 제21항에 있어서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 29 제28항에 있어서, 상기 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 30 제28항에 있어서, 상기 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 31 제28항에 있어서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 RACH 설정을 수신하는 단계를 포함하고, 상기 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 32 제31항에 있어서, 상기 RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함되는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 33 제31항에 있어서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 SIB1의 최초 BWP 설정의 제1 RACH-ConfigCommon을 수신하는 단계를 포함하고, 상기 제1 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 34 제31항에 있어서,상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 수신하는 단계를 포함하고, 상기 제2 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 35 제28항에 있어서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 전용 RACH 설정을 수신하는 단계를 포함하는, 상기 전용 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 36 제35항에 있어서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 빔 실패 회복 설정 (BeamFailureRecoveryConfig)을 수신하는 단계를 포함하고, 상기 BeamFailureRecoveryConfig에는 상기 전용 RACH 설정에 설정된 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 37 제35항에 있어서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 전용 RACH- ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated에는 상기 전용 RACH 설정에 설정된 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 38 제35항에 있어서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CBRA 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 39 제37항에 있어서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 상기 네트워크측 기기에서 송신된 feature combination의 RACH 설정을 수신하는 단계를 포함하고, 상기 feature combination의 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법.청구항 40 제39항에 있어서, 상기 feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함하고, 상기 Coverage Enhancement feature은 상기 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는 데 사용되는, 것을 특징으로 하는 멀티 PRACH 전송 설정 방법. 청구항 41 멀티 PRACH 전송 설정 장치에 있어서, 제1 멀티 PRACH 전송 설정 및 제2 멀티 PRACH 전송 설정 중의 적어도 하나를 포함하는 멀티 PRACH 전송 설정을 단말 기기에 송신하는 송신 모듈 - 상기 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스 (CFRA)의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세 스(CBRA)의 멀티 PRACH 전송 설정에 사용되고, 상기 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정 에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 단말 기기에 의해 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송 중의 적어도 하나를 수신하는 수신 모듈; 를 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 장치. 청구항 42 멀티 PRACH 전송 설정 장치에 있어서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 수신 모듈 - 상기 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및 제2 멀티 PRACH 전송 설정 중의 적어도 하나를 포함하고, 상기 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설 정에 사용됨 - ; 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송 중의 적어도 하나를 상기 네트워크측 기기에 송신하는 송신 모듈; 을 포함하는, 것을 특징으로 하는 멀티 PRACH 전송 설정 장치. 청구항 43 네트워크측 기기에 있어서, 프로세서; 및 컴퓨터 프로그램이 저장되어 있는 메모리; 를 포함하고, 상기 프로세서는 상기 메모리에 저장된 컴퓨터 프로그램을 수행하여, 상기 네트워크측 기기가 제1항 내지 제20 항 중 어느 한 항의 방법을 수행하도록 하는, 것을 특징으로 하는 네트워크측 기기. 청구항 44 단말 기기에 있어서, 프로세서; 및 컴퓨터 프로그램이 저장되어 있는 메모리; 를 포함하고, 상기 프로세서는 상기 메모리에 저장된 컴퓨터 프로그램을 수행하여, 상기 단말 기기가 제21항 내지 제40항 중 어느 한 항의 방법을 수행하도록 하는, 것을 특징으로 하는 단말 기기. 청구항 45 통신 장치에 있어서, 프로세서 및 인터페이스 회로를 포함하고, 상기 인터페이스 회로는 코드 명령을 수신하여 상기 프로세서에 송신하고, 상기 프로세서는 상기 코드 명령을 실행하여 제1항 내지 제20항 중 어느 한 항의 방법을 수행하는, 것을 특징으로 하는 통신 장치. 청구항 46 통신 장치에 있어서, 프로세서 및 인터페이스 회로를 포함하고, 상기 인터페이스 회로는 코드 명령을 수신하여 상기 프로세서에 송신하고, 상기 프로세서는 상기 코드 명령을 실행하여 제21항 내지 제40항 중 어느 한 항의 방법을 수행하는, 것을 특징으로 하는 통신 장치. 청구항 47 명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체에 있어서, 상기 명령이 수행될 경우, 제1항 내지 제20항 중 어느 한 항의 방법이 구현되는, 것을 특징으로 하는 컴퓨터 판독 가능 저장 매체. 청구항 48 명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체에 있어서, 상기 명령이 수행될 경우, 제21항 내지 제40항 중 어느 한 항의 방법이 구현되는, 것을 특징으로 하는 컴퓨터 판독 가능 저장 매체. 발명의 설명 기 술 분 야 본 발명은 통신 기술 분야에 관한 것으로, 특히 멀티 물리 랜덤 액세스 채널(Physical Random Access Channel, PRACH) 전송 설정 방법, 장치, 기기 및 저장 매체에 관련된 것이다."}
{"patent_id": "10-2024-7041711", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 시스템에서, 업링크 커버리지가 차하면 단말 기기 및 네트워크측 기기 사이의 통신 품질을 영향한다. 업링 크 커버리지의 영향 요소 중의 하나는 PRACH 채널이다. 단말 기기는 랜덤 액세스의 한 번의 시도에서 1개의 첫 번째 메시지(Msg1)만 전송할 수 있음으로, PRACH 채널의 커버리지는 비교적 차하다. 따라서, 네트워크측 기기가 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 비경쟁을 기반으로 하는 랜덤 액세스(CFRA) 멀티 PRACH 전송 및/또는 경쟁을 기반으로 하는 랜덤 액세스(CBRA) 멀티 PRACH 전송을 수신하도록 하고, PRACH 채널의 커버 리지를 향상시키는 \"멀티 PRACH 전송 설정\"의 방법이 시급하다. 본 발명에서 멀티 PRACH 전송 설정 방법, 장치, 기기 및 저장 매체를 제공함으로, 네트워크측 기기는 단말 기기 에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 본 발명 일 측면의 실시예에 따른 멀티 물리 랜덤 액세스 채널(PRACH) 전송 설정 방법은 네트워크측 기기에 의 해 수행되고, 상기 방법은, 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하는 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계 - 상기 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 PRACH 전 송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 단말 기기에 의해 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신하는 단계; 를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 CFRA이 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH 순서(PDCCH order)를 상기 단말 기기에 송신하는 단계 - 상기 PDCCH order에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있음 - ; 를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 전용 랜덤 액세스 설정(RACH- ConfigDedicated)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 전환에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated를 상기 단말 기기에 송신하는 단계를 포 함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 상기 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 빔 실패 회복 설정을 상기 단말 기기에 송신하는 단계 를 포함하고, 상기 빔 실패 회복 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 상기 제2 멀티 PRACH 전송 설정을 상기 단말 기기에 송신하 는 단계를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 제2 멀티 PRACH 전송 설정을 상기 단말 기기에 송신하는 단계는, 공공 랜덤 액세스 채널(RACH) 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH 설정에는 상기 제 2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포 함된다. 선택적으로, 본 발명의 일 실시예에서, 상기 RACH 설정을 단말 기기에 송신하는 단계는, SIB1의 최초 BWP 설정의 제1 랜덤 액세스 공공 설정(RACH-ConfigCommon)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 제1 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 RACH 설정을 단말 기기에 송신하는 단계는, RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 상기 단말 기기에 송신하는 단계를 포함하 고, 상기 제2 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전용 RACH 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 전용 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 전용 RACH 설정을 상기 단말 기기에 송신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 빔 실패 회복 설정(BeamFailureRecoveryConfig)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 BeamFailureRecoveryConfig에는 상기 전용 RACH 설정에 설정된 상기 제 2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated에는 상기 전용 RACH 설정에 설정된 상 기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, RACH-ConfigDedicated를 상기 단말 기기에 송신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CBRA 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 특징 그룹(feature combination)의 RACH 설정을 상기 단말 기기에 송신하는 단계를 포함하고, 상기 feature combination의 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함하고, 상기 Coverage Enhancement feature는 상기 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용된다. 본 발명 다른 측면의 실시예에 따른 멀티 PRACH 전송 설정 방법은 단말 기기에 의해 수행되고, 상기 방법은, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계 - 상기 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하고, 상기 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 상기 네트워크측 기기에 송신하는 단계; 를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단 계는, 상기 PDCCH에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 PDCCH order를 수신하는 단 계를 포함하고, 상기 PDCCH order에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단 계는, 상기 PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH- ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단 계는, 상기 전환에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신 하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CFRA 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단 계는, 상기 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 상기 네트워크측 기기에서 송신된 빔 실패 회복 설정을 수신하는 단계를 포함하고, 상기 빔 실패 회복 설정에는 상기 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단 계는, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수신하는 단계를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수 신하는 단계는, 상기 네트워크측 기기에서 송신된 RACH 설정을 수신하는 단계를 포함하고, 상기 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포 함된다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수 신하는 단계는, 상기 네트워크측 기기에서 송신된 SIB1의 최초 BWP 설정의 제1 RACH-ConfigCommon을 수신하는 단계를 포함하고, 상기 제1 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수 신하는 단계는, 상기 네트워크측 기기에서 송신된 RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 수신하는 단계를 포함하고, 상기 제2 RACH-ConfigCommon에는 상기 RACH 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수 신하는 단계는, 상기 네트워크측 기기에서 송신된 전용 RACH 설정을 수신하는 단계를 포함하고, 상기 전용 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수 신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 빔 실패 회복 설정 (BeamFailureRecoveryConfig)을 수신하는 단계를 포함하고, 상기 BeamFailureRecoveryConfig에는 상기 전용 RACH 설정에 설정된 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수 신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 전용 RACH- ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated에는 상기 전용 RACH 설정에 설정된 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수 신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, 상기 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는 단계를 포함하고, 상기 RACH-ConfigDedicated의 CBRA 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 네트워크측 기기에서 송신된 상기 제2 멀티 PRACH 전송 설정을 수 신하는 단계는, 상기 네트워크측 기기에서 송신된 feature combination의 RACH 설정을 수신하는 단계를 포함하고, 상기 feature combination의 RACH 설정에는 상기 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 상기 feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함하고, 상기 Coverage Enhancement feature는 상기 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature를 지시하는데 사용된다. 본 발명 또 다른 측면의 실시예에 따른 멀티 PRACH 전송 설정 장치는, 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하는 멀티 PRACH 전송 설정을 단말 기기에 송신하는 송신 모듈 - 상기 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀 티 PRACH 전송 설정에 사용되고, 상기 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되며, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨 - ; 상기 단말 기기에 의해 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신하는 수신 모듈; 을 포함한다. 본 발명 또 다른 측면의 실시예에 따른 멀티 PRACH 전송 설정 장치는, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 수신 모듈 - 상기 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하고, 상기 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 상기 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨 -; 상기 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 상기 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 상기 네트워크측 기기에 송신하는 송신 모듈; 을 포함한다. 본 발명 또 다른 측면의 실시예에 따른 단말 기기는, 프로세서 및 컴퓨터 프로그램이 저장되어 있는 메모리를 포함하고, 상기 프로세서는 상기 메모리에 저장된 컴퓨터 프로그램을 수행하여, 상기 장치가 상기 일 측면의 실 시예에 따른 방법을 수행하도록 한다. 본 발명 또 다른 측면의 실시예에 따른 네트워크측 기기는, 프로세서 및 컴퓨터 프로그램이 저장되어 있는 메모 리를 포함하고, 상기 프로세서는 상기 메모리에 저장된 컴퓨터 프로그램을 수행하여, 상기 장치가 상기 다른 측 면의 실시예에 따른 방법을 수행하도록 한다. 본 발명 또 다른 측면의 실시예에 따른 통신 장치는, 프로세서 및 인터페이스 회로를 포함하고; 상기 인터페이스 회로는, 코드 명령을 수신하여 상기 프로세서에 전송하는데 사용되고; 상기 프로세서는, 상기 코드 명령을 수행하여 일 측면의 실시예에서 제공된 방법을 수행하는데 사용된다. 본 발명 또 다른 측면의 실시예는 프로세서 및 인터페이스 회로를 포함하는 통신 장치를 제공하고; 상기 인터페이스 회로는, 코드 명령을 수신하여 상기 프로세서에 전송하는데 사용되고; 상기 프로세서는, 상기 코드 명령을 수행하여 다른 측면의 실시예에서 제공된 방법을 수행하는데 사용된다. 본 발명 또 다른 측면의 실시예는 명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 명령이 수행될 경우, 일 측면 실시예에서 제공된 방법이 구현된다. 본 발명 또 다른 측면의 실시예는 명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 명령이 수행될 경우, 다른 측면 실시예에서 제공된 방법이 구현된다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신하고, 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하고, 여기서, 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 PRACH 전송 설정에 사용되고, 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀티 PRACH 전송 설정에 사용되고; 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 제2 멀티 PRACH 전송 설정에 따라 시작 된 CBRA 멀티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신한 후, 단말 기기는 멀티 PRACH 전송 설정에 따라 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 시작하고, 랜 덤 액세스의 실패 확률을 감소시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으 로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다."}
{"patent_id": "10-2024-7041711", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서 예시적인 일 실시예에 대해 상세히 설명한다. 당해 예시는 도면에서 나타나고, 하기의 설명이 도면에 관한 것일 경우, 다른 표시가 없으면, 상이한 도면에서 동일한 수자는 동일한 또는 비슷한 요소를 표시한다. 하 기의 예시적인 일 실시예에 설명한 실시 형태는 본 발명과 일치한 모든 실시 형태를 대표하는 것은 아니다. 반 면, 그들은 첨부된 청구범위에서 상세히 설명한 본 발명의 일부 측면과 일치한 장치 및 방법의 예일 뿐이다. 본 발명에서 사용하는 용어는 본 발명을 제한하려는 것이 아니라, 단지 특정 실시예를 설명하기 위한 것이다. 콘텍스트에서 기타 함의를 표시하는 명확한 설명이 있지 않은 한, 본 발명 실시예와 첨부된 청구항에서 사용하 는 홀수 형식의 \"하나의\" , \"상기\" 및 \"당해\"는 다수의 형식도 포함한다. 본 설명서에서 사용하는 용어 \"및/또 는\"은 하나 또는 복수의 관련된 열거 프로젝트의 어느 하나 또는 모든 가능한 조합을 포함하는 점을 더 이해해 야 한다. 이해해야 할 것은, 본 발명 실시예에서 용어 \"제1\", \"제2\", \"제3\" 등으로 각 정보를 설명할 수 있으나, 당해 정 보들은 당해 용어에 한정되지 않는다. 단지 동일한 유형의 정보를 구분하기 위한 것이다. 예를 들면, 본 발명 범위를 벗어나지 않은 상황에서, 제1 정보는 제2 정보로 불릴 수 있고, 유사하게, 제2 정보는 제1 정보로 불릴 수도 있다. 언어 환경에 따라 결정된다. 예를 들면, 여기서 사용하는 용어 \"만약\"은 \"...경우\", \"...때\" 또는 \"결정된 것에 응답하여\"로 해석될 수도 있다. 본 발명의 실시예에 언급된 망 요소 또는 네트워크 기능는, 독립적인 하드웨어 기기를 통해 구현될 수 있고, 하 드웨어 기기의 소프트웨어를 통해 구현될 수 있고, 본 발명의 실시예에서 이에 대해 한정하지 않는다. 아래는 도면을 참조하여 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법, 장치, 기기 및 저장 매체를 상세 히 설명한다. 도1은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 네트워크측 기 기에 의해 수행되고, 도1에 도시된 바와 같이, 당해 방법은, 단계101 내지 102를 포함할 수 있다. 단계101에서, 멀티 PRACH 전송 설정을 단말 기기에 송신하고, 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설 정 및/또는 제2 멀티 PRACH 전송 설정을 포함하고, 여기서, 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하 는 랜덤 액세스(CFRA)의 멀티 PRACH 전송 설정에 사용되며, 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀티 PRACH 전송 설정에 사용된다. 단계102에서, 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 제2 멀 티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신한다. 설명해야 할 것은, 본 발명의 일 실시예에서, 단말 기기는 RAN(Radio Access Network, 무선 접속망)을 통해 하 나 또는 복수의 핵심망과 통신할 수 있고, 단말은 사물 인터넷 단말일 수 있다. 예를 들면 센서 기기, 휴대폰(또는 \"셀룰러\"전화) 및 사물 인터넷 단말을 구비한 컴퓨터일 수 있다. 예를 들면, 고정식, 휴대식, 포켓식, 핸 드 헬드, 컴퓨터에 내장된 장치 또는 차량 탑재 장치일 수 있다. 예를 들면, 스테이션(Station, STA), 가입자 유닛(subscriber unit), 가입자 지국(subscriber station), 이동국(mobile station), 모바일(mobile), 원격 지 국(remote station), 접속 포인트, 원격 단말(remote terminal), 접속 단말(access terminal), 사용자 장치 (user terminal) 또는 사용자 에이전트(user agent)일 수 있다. 또한, 단말 기기는 무인 항공기의 기기일 수도 있다. 또한, 단말 기기는 차량 탑재 기기일 수 있다. 예를 들면, 무선 통신 기능을 구비한 주행 컴퓨터, 또는 외장 주행 컴퓨터의 무선 단말일 수 있다. 또한, 단말 기기는 노변 기기일 수 있다. 예를 들면, 무선 통신 기능 을 구비한 가로등, 신호등 또는 기타 노변 기기 등일 수도 있다. 여기서, 본 발명의 일 실시예에서, 단말 기기가 프리앰블(preamble)을 송신할 경우, 예를 들면 preamble 시간 영역 repetition을 수행할 수 있다. 즉 시간 영역에서 복수의 preamble을 연속으로 송신하고, 여기서, 한 번의 PRACH 전송은 복수의 preamble을 연속으로 송신하는 것을 한 번에 전체적으로 전송하는 것을 가리키고, 멀티 PRACH 전송은 여러 번의 PRACH 전송을 수행하는 것이다. 본 발명의 일 실시예에서, CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 본 발명의 일 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH 순서(PDCCH order)를 단말 기기에 송신하는 단계를 포함하고, 여기서, PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 단말 기기에 송신하는 단계를 포함하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전환에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated를 단말 기기에 송신하는 단계를 포함하고, 여 기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 예시적으로, 본 발명의 일 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 빔 실패 회복 설정을 단말 기기에 송신하는 단계를 포함하고, 여기서, 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 나아가, 본 발명의 일 실시예에서, 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함한다. 본 발명의 일 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계를 포함한다. 본 발명의 일 실시예에서, 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함한다. 본 발명의 일 실시예에서, 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함한다. 본 발명의 일 실시예에서, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 공공 랜덤 액세스 채널(RACH) 설정을 단말 기기에 송신하는 단계를 포함하고, 여기서, RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함된다. 본 발명의 일 실시예에서, RACH 설정을 단말 기기에 송신하는 단계는, SIB1의 최초 BWP 설정의 제1 랜덤 액세스 공공 설정(RACH-ConfigCommon)을 단말 기기에 송신하는 단계를 포함하 고, 여기서, 제1 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 본 발명의 일 실시예에서, RACH 설정을 단말 기기에 송신하는 단계는, RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 단말 기기에 송신하는 단계를 포함하고, 여 기서, 제2 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 본 발명의 일 실시예에서, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전용 RACH 설정을 단말 기기에 송신하는 단계를 포함하고, 여기서, 전용 RACH 설정에는 제2 멀티 PRACH 전송 설 정이 운송되어 있다. 본 발명의 일 실시예에서, 전용 RACH 설정을 단말 기기에 송신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 빔 실패 회복 설정(BeamFailureRecoveryConfig)을 단말 기기 에 송신하는 단계를 포함하고, 여기서, BeamFailureRecoveryConfig에는 전용 RACH 설정에 설정된 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 단말 기기에 송신하는 단계를 포함하고, 여기서, RACH-ConfigDedicated에는 전용 RACH 설정에 설정된 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, RACH-ConfigDedicated를 단말 기기에 송신하는 단계를 포함하고, 여 기서, RACH-ConfigDedicated의 CBRA 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는 단계는, 특징 그룹(feature combination)의 RACH 설정을 단말 기기에 송신하는 단계를 포함하고, 여기서, feature combination의 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함 하고, 여기서, Coverage Enhancement feature는 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용된다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신하고, 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하고, 여기서, 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 PRACH 전송 설정에 사용되고, 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀티 PRACH 전송 설정에 사용되고; 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 제2 멀티 PRACH 전송 설정에 따라 시작 된 CBRA 멀티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신한 후, 단말 기기는 멀티 PRACH 전송 설정에 따라 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 시작하고, 랜 덤 액세스의 실패 확률을 감소시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으 로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도2는 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 네트워크측 기 기에 의해 수행되고, 도2에 도시된 바와 같이, 당해 방법은, 단계201 내지 202를 포함할 수 있다. 단계201에서, PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH 순서(PDCCH order)를 단말 기기에 송신하고, 여 기서, PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 단계202에서, 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신한다. 여기서, 본 발명의 일 실시예에서, CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 나아가, 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 PRACH 전송 설정을 지 시하는데만 사용되고, 당해 제1 멀티 PRACH 전송 설정은 어느 하나의 고정 멀티 PRACH 전송 설정을 구체적으로 가리키지 않는다. 예를 들면, CFRA의 트리거링 방식이 변화될 경우, 당해 제1 멀티 PRACH 전송 설정도 따라서 변화된다. 예시적으로, 본 발명의 일 실시예에서, CFRA의 트리거링 방식이 PDCCH에 의한 트리거링일 경우, 네트워크측 기 기는 PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH order를 단말 기기에 송신할 수 있다. PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있으므로, 즉 PDCCH order에 CFRA를 기반으로 하는 멀티 PRACH 전송 설정 이 운송되어 있으므로, 단말 기기는 제1 멀티 PRACH 전송 설정에 따라 CFRA 멀티 PRACH 전송을 시작할 수 있고, 네트워크측 기기는 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신할 수 있다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH 순서(PDCCH order)를 단말 기기에 송신하고, 여기서, PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있고; 단말 기 기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 구체적으로 PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH order를 단말 기기에 송신함으로, 제1 멀티 PRACH 전송 설정을 단말 기기에 송신하고, 제1 멀티 PRACH 전송 설정 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도3은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 네트워크측 기 기에 의해 수행되고, 도3에 도시된 바와 같이, 당해 방법은, 단계 301 내지 302를 포함할 수 있다. 단계S301에서, PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 전용 랜덤 액세스 설정(RACH- ConfigDedicated)을 단말 기기에 송신하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전 송 설정이 운송되어 있다. 단계302에서, 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신한다. 여기서, 본 발명의 일 실시예에서, CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 예시적으로, 본 발명의 일 실시예에서, CFRA의 트리거링 방식이 PScell 첨부 또는 변경에 의한 트리거링일 경우, 네트워크측 기기는 PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated를단말 기기에 송신할 수 있다. RACH-ConfigDedicated에 제1 멀티 PRACH 전송 설정이 운송되어 있으므로, 즉 RACH-ConfigDedicated에 CFRA를 기반으로 하는 멀티 PRACH 전송 설정이 운송되어 있으므로, 단말 기기는 제1 멀 티 PRACH 전송 설정에 따라 CFRA 멀티 PRACH 전송을 시작할 수 있고, 네트워크측 기기는 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신할 수 있다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 단말 기기에 송신하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있고; 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작 된 CFRA 멀티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 구체적으로 PScell 첨부 또는 변경에 의해 트리거 링된 CFRA에 응답하여, 당해 트리거링 방식에 대응되는 RACH-ConfigDedicated를 단말 기기에 송신함으로, 제1 멀티 PRACH 전송 설정을 단말 기기에 송신하고, 제1 멀티 PRACH 전송 설정 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀 티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채 널의 커버리지를 향상시킨다. 도4는 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 네트워크측 기 기에 의해 수행되고, 도4에 도시된 바와 같이, 당해 방법은, 단계 401 내지 402를 포함할 수 있다. 단계401에서, 전환에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated를 단말 기기에 송신하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 단계402에서, 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신한다. 여기서, 본 발명의 일 실시예에서, CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 예시적으로, 본 발명의 일 실시예에서, CFRA의 트리거링 방식이 전환에 의한 트리거링일 경우, 네트워크측 기기 는 전환에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated를 단말 기기에 송신할 수 있다. RACH- ConfigDedicated에 제1 멀티 PRACH 전송 설정이 운송되어 있으므로, 즉 RACH-ConfigDedicated에 CFRA를 기반으 로 하는 멀티 PRACH 전송 설정이 운송되어 있으므로, 단말 기기는 제1 멀티 PRACH 전송 설정에 따라 CFRA 멀티 PRACH 전송을 시작할 수 있고, 네트워크측 기기는 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신할 수 있다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 전환에 의해 트리거링된 CFRA에 응답하여, 전환에 의해 트리 거링된 CFRA에 응답하여, RACH-ConfigDedicated를 단말 기기에 송신하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있고; 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 구체적으로 전환에 의해 트리거링된 CFRA에 응답하여, 당해 트리거링 방식에 대응되는 RACH-ConfigDedicated를 단말 기기에 송신함으로, 제1 멀티 PRACH 전 송 설정을 단말 기기에 송신하고, 제1 멀티 PRACH 전송 설정 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전 송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리 지를 향상시킨다. 도5는 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 네트워크측 기 기에 의해 수행되고, 도5에 도시된 바와 같이, 당해 방법은, 단계 501 내지 502를 포함할 수 있다. 단계501에서, 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 빔 실패 회복 설정을 단말 기기에 송신하고, 여기서, 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 단계502에서, 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신한다. 여기서, 본 발명의 일 실시예에서, CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 여기서, 본 발명의 일 실시예에서, 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함한다. 예시적으로, 본 발명의 일 실시예에서, CFRA의 트리거링 방식이 빔 실패 회복에 의한 트리거링일 경우, 네트워 크측 기기는 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 빔 실패 회복 설정을 단말 기기에 송신할 수 있 다. 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있으므로, 즉 빔 실패 회복 설정에 CFRA를 기 반으로 하는 멀티 PRACH 전송 설정이 운송되어 있으므로, 단말 기기는 제1 멀티 PRACH 전송 설정에 따라 CFRA 멀티 PRACH 전송을 시작할 수 있고, 네트워크측 기기는 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시 작된 CFRA 멀티 PRACH 전송을 수신할 수 있다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 빔 실패 회복 설정을 단말 기기에 송신하고, 여기서, 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있고; 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 구체적으로 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 당해 트리거링 방식에 대응되는 빔 실패 회복 설정을 단말 기기에 송신함으로, 제1 멀티 PRACH 전송 설정을 단말 기기에 송신하고, 제1 멀티 PRACH 전송 설정 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함 으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도6은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 네트워크측 기 기에 의해 수행되고, 도6에 도시된 바와 같이, 당해 방법은, 단계 601 내지 602를 포함할 수 있다. 단계601에서, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 제2 멀티 PRACH 전송 설정을 단말 기기에 송신 한다. 단계602에서, 단말 기기에 의해 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신한다. 여기서, 본 발명의 일 실시예에서, 제1 멀티 PRACH 전송 설정은 CBRA를 기반으로 하는 멀티 PRACH 전송 설정을 지시하는데만 사용되고, 당해 제2 멀티 PRACH 전송 설정은 어느 하나의 고정 멀티 PRACH 전송 설정을 구체적으 로 가리키지 않는다. 예를 들면, CFRA의 트리거링 방식이 변화될 경우, 당해 제2 멀티 PRACH 전송 설정도 따라 서 변화된다. 나아가, 본 발명의 일 실시예에서, 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함한다. 본 발명의 일 실시예에서, 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함한다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하고; 단말 기기에 의해 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀 티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 구체적으로 브로드캐스트 시그널링 또는 전용 시그널링을 통 해 제2 멀티 PRACH 전송 설정을 단말 기기에 송신함으로, 제2 멀티 PRACH 전송 설정 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도7은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 네트워크측 기 기에 의해 수행되고, 도7에 도시된 바와 같이, 당해 방법은, 단계 701 내지 702를 포함할 수 있다. 단계701에서, 공공 랜덤 액세스 채널(RACH) 설정을 단말 기기에 송신하고, 여기서, RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 단계702에서, 단말 기기에 의해 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신한다. 여기서, 본 발명의 일 실시예에서, RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함된다. 본 발명의 일 실시예에서, 네트워크측 기기는 RACH 설정을 단말 기기에 송신할 경우, SIB1의 최초 BWP 설정의 제1 랜덤 액세스 공공 설정(RACH-ConfigCommon)을 단말 기기에 송신할 수 있고, 여기서, 제1 RACH- ConfigCommon에는 RACH 설정이 운송되어 있다. 예시적으로, 제1 RACH-ConfigCommon의 제1 은 제2 RACH-ConfigCommon과 구별하는데만 사용되고, 당해 제1 RACH-ConfigCommon은 SIB1의 최초 BWP 설정의 RACH-ConfigCommon만 지시한다. 본 발명의 일 실시예에서, 네트워크측 기기는 RACH 설정을 단말 기기에 송신할 경우, RRCReconfiguration 메시 지의 BWP 설정의 제2 RACH-ConfigCommon을 단말 기기에 송신할 수 있고, 여기서, 제2 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 예시적으로, 제2 RACH-ConfigCommon의 제2는 제1 RACH-ConfigCommon과 구별하는데만 사용되고, 당해 제2 RACH- ConfigCommon은 RRCReconfiguration 메시지의 BWP 설정의 RACH-ConfigCommon을 지시하는데만 사용된다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, RACH 설정을 단말 기기에 송신하고, 여기서, RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있고; 단말 기기에 의해 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 구체적으로 RACH 설정을 단말 기기에 송신하여, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신함으로, 제2 멀티 PRACH 전송 설정 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널 의 커버리지를 향상시킨다. 도8은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 네트워크측 기 기에 의해 수행되고, 도8에 도시된 바와 같이, 당해 방법은, 단계 801 내지 802를 포함할 수 있다. 단계801에서, 전용 RACH 설정을 단말 기기에 송신하고, 여기서, 전용 RACH 설정에는 제2 멀티 PRACH 전송 설정 이 운송되어 있다. 단계802에서, 단말 기기에 의해 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신한다. 여기서, 본 발명의 일 실시예에서, 전용 RACH 설정을 단말 기기에 송신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 빔 실패 회복 설정(BeamFailureRecoveryConfig)을 단말 기기 에 송신하고, 여기서, BeamFailureRecoveryConfig에는 전용 RACH 설정에 설정된 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기는 제2 멀티 PRACH 전송 설정을 단말 기기에 송신할 경우, PScell 첨 부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 단말 기기 에 송신할 수 있고, 여기서, RACH-ConfigDedicated에는 전용 RACH 설정에 설정된 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기는 제2 멀티 PRACH 전송 설정을 단말 기기에 송신할 경우, 전환에 의 해 트리거링된 CBRA에 응답하여, RACH-ConfigDedicated를 단말 기기에 송신할 수 있다, 여기서, RACH- ConfigDedicated의 CBRA 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기는 제2 멀티 PRACH 전송 설정을 단말 기기에 송신할 경우, 특징 그룹(feature combination)의 RACH 설정을 단말 기기에 송신할 수 있고, 여기서, feature combination의 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함 하고, 여기서, Coverage Enhancement feature는 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용된다. 예시적으로, feature combination은, 커버리지 증강(Coverage Enhancement); 레드캡(Reduced capability, RedCap); 스몰 데이터 전송(Small Data Transmission, SDT); 및 슬라이스(Slice); 중의 적어도 하나를 포함한다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 전용 RACH 설정을 단말 기기에 송신하고, 여기서, 전용 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있고; 단말 기기에 의해 제2 멀티 PRACH 전송 설정에 따라 시작 된 CBRA 멀티 PRACH 전송을 수신한다. 본 발명의 실시예에서, 구체적으로 전용 RACH 설정을 단말 기기에 송신함 으로, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하고, 제2 멀티 PRACH 전송 설정 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도9는 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 단말 기기에 의해 수행되고, 도9에 도시된 바와 같이, 당해 방법은, 단계 901 내지 902를 포함할 수 있다. 단계901에서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하고, 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하고, 여기서, 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용된다. 단계902에서, 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 제2 멀티 PRACH 전송 설 정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 여기서, 본 발명의 일 실시예에서, CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, PDCCH에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 PDCCH order를 수신하는 단계를 포함하 고, 여기서, PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 예시적으로, 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated 를 수신하는 단계를 포함하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운 송되어 있다. 나아가, 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 전환에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는 단계 를 포함하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 빔 실패 회복 설정을 수신하는 단계를 포함하고, 여기서, 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함한다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 단계는, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수 신하는 단계를 포함한다. 본 발명의 일 실시예에서, 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함한다. 본 발명의 일 실시예에서, 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함한다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 네트워크측 기기에서 송신된 RACH 설정을 수신하는 단계를 포함하고, 여기서, RACH 설정에는 제2 멀티 PRACH 전 송 설정이 운송되어 있다. 본 발명의 일 실시예에서, RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함된다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 네트워크측 기기에서 송신된 SIB1의 최초 BWP 설정의 제1 RACH-ConfigCommon을 수신하는 단계를 포함하고, 여기 서, 제1 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 네트워크측 기기에서 송신된 RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 수신하는 단계 를 포함하고, 여기서, 제2 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 네트워크측 기기에서 송신된 전용 RACH 설정을 수신하는 단계를 포함하고, 여기서, 전용 RACH 설정에는 제2 멀 티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 빔 실패 회복 설정 (BeamFailureRecoveryConfig)을 수신하는 단계를 포함하고, 여기서, BeamFailureRecoveryConfig에는 전용 RACH 설정에 설정된 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 전용 RACH- ConfigDedicated를 수신하는 단계를 포함하고, 여기서, RACH-ConfigDedicated에는 전용 RACH 설정에 설정된 제 2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는 단계 를 포함하고, 여기서, RACH-ConfigDedicated의 CBRA 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 네트워크측 기기에서 송신된 feature combination의 RACH 설정을 수신하는 단계를 포함하고, 여기서, feature combination의 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함 하고, 여기서, Coverage Enhancement feature는 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용된다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하 고, 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하고, 여기서, 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 제2 멀티 PRACH 전송 설정은 CBRA의 멀 티 PRACH 전송 설정에 사용되고; 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 본 발명의 실시예에 서, 단말 기기는 수신된 멀티 PRACH 전송 설정에 따라 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 시작하고, 랜덤 액세스의 실패 확률을 감소시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방 법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도10은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 단말 기기에 의해 수행되고, 도10에 도시된 바와 같이, 당해 방법은, 단계 1001 내지 1002를 포함할 수 있다. 단계1001에서, PDCCH에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 PDCCH order를 수신하고, 여기서, PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 단계1002에서, 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 여기서, 단계1001 내지 단계1002에 관련된 기타 상세한 설명은 상기 실시예의 설명을 참조할 수 있고, 본 발명 의 실시예에서 더는 설명하지 않는다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, PDCCH에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기 에서 송신된 PDCCH order를 수신하고, 여기서, PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있고; 제 1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 본 발명의 실시예 에서, 구체적으로 PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH order에 운송된 제1 멀티 PRACH 전송 설정 에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신함으로, CFRA 멀티 PRACH 전송 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단 말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수 신하고, PRACH 채널의 커버리지를 향상시킨다. 도11은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 단말 기기에 의해 수행되고, 도11에 도시된 바와 같이, 당해 방법은, 단계 1101 내지 1102를 포함할 수 있다. 단계1101에서, PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 RACH- ConfigDedicated를 수신하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운 송되어 있다. 단계1102에서, 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 여기서, 단계1101 내지 단계1102에 관련된 기타 상세한 설명은 상기 실시예의 설명을 참조할 수 있고, 본 발명 의 실시예에서 더는 설명하지 않는다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에 는 제1 멀티 PRACH 전송 설정이 운송되어 있고; 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 을 네트워크측 기기에 송신한다. 본 발명의 실시예에서, 구체적으로 PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated의 CFRA 설정에 운송된 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신함으로, CFRA 멀티 PRACH 전송 송신 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널 의 커버리지를 향상시킨다. 도12는 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 단말 기기에 의해 수행되고, 도12에 도시된 바와 같이, 당해 방법은, 단계 1201 내지 1202를 포함할 수 있다. 단계1201에서, 전환에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 단계1202에서, 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 여기서, 단계1201 내지 단계1202에 관련된 기타 상세한 설명은 상기 실시예의 설명을 참조할 수 있고, 본 발명 의 실시예에서 더는 설명하지 않는다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 전환에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에 서 송신된 RACH-ConfigDedicated를 수신하고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있고; 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기 에 송신한다. 본 발명의 실시예에서, 구체적으로 전환에 의해 트리거링된 CFRA에 응답하여, 단말 기기는 RACH- ConfigDedicated의 CFRA 설정에 운송된 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트 워크측 기기에 송신함으로, CFRA 멀티 PRACH 전송 송신 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도13은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 단말 기기에 의해 수행되고, 도13에 도시된 바와 같이, 당해 방법은, 단계1304 내지 1302를 포함할 수 있다. 단계1301에서, 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 빔 실패 회복 설 정을 수신하고, 여기서, 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 단계1302에서, 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 본 발명의 일 실시예에서, 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함한다. 여기서, 단계1301-단계1302에 관련된 기타 상세한 설명은 상기 실시예의 설명을 참조할 수 있고, 본 발명의 실 시예에서 더는 설명하지 않는다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 네트워크 측 기기에서 송신된 빔 실패 회복 설정을 수신하고, 여기서, 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정 이 운송되어 있고; 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신한 다. 본 발명의 실시예에서, 구체적으로 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 단말 기기는 빔 실패 회복 설정에 운송된 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송을 네트워크측 기기에 송신 함으로, CFRA 멀티 PRACH 전송 송신 정확성을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도14는 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 단말 기기에 의해 수행되고, 도14에 도시된 바와 같이, 당해 방법은, 단계1401 내지 1402를 포함할 수 있다. 단계1401에서, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신한다. 단계1402에서, 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 여기서, 본 발명의 일 실시예에서, 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함한다. 본 발명의 일 실시예에서, 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함한다. 여기서, 단계1401 내지 단계1402에 관련된 기타 상세한 설명은 상기 실시예의 설명을 참조할 수 있고, 본 발명 의 실시예에서 더는 설명하지 않는다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 네트워크 측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하고; 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 본 발명의 실시예에서, 구체적으로 브로드캐스트 시그널링 또는 전 용 시그널링을 통해 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하함으로, 제2 멀티 PRACH 전 송 설정 송신의 정확성을 향상시키고, 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송의 정확성 을 향상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도15는 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 단말 기기에 의해 수행되고, 도15에 도시된 바와 같이, 당해 방법은, 단계1501 내지 1502를 포함할 수 있다. 단계1501에서, 네트워크측 기기에서 송신된 RACH 설정을 수신하고, 여기서, RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 단계1502에서, 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 본 발명의 일 실시예에서, RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함된다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 네트워크측 기기에서 송신된 SIB1의 최초 BWP 설정의 제1 RACH-ConfigCommon을 수신하는 단계를 포함하고, 여기 서, 제1 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 네트워크측 기기에서 송신된 RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 수신하는 단계 를 포함하고, 여기서, 제2 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 여기서, 단계1501 내지 단계1502에 관련된 기타 상세한 설명은 상기 실시예의 설명을 참조할 수 있고, 본 발명 의 실시예에서 더는 설명하지 않는다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 네트워크측 기기에서 송신된 RACH 설정을 수신하고, 여기서, RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있고; 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 본 발명의 실시예에서, 구체적으로 RACH 설정을 단말 기기에 송신함 으로, 단말 기기는 RACH 설정에 운송된 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트 워크측 기기에 송신에 송신하고, 제2 멀티 PRACH 전송 설정 송신의 정확성을 향상시킬 수 있다. 본 발명에서 \" 멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 도16은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이고, 당해 방법은 단말 기기에 의해 수행되고, 도16에 도시된 바와 같이, 당해 방법은, 단계1601 내지 1602를 포함할 수 있다. 단계1601에서, 네트워크측 기기에서 송신된 전용 RACH 설정을 수신하고, 여기서, 전용 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 단계1602에서, 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 빔 실패 회복 설정 (BeamFailureRecoveryConfig)을 수신하는 단계를 포함하고, 여기서, BeamFailureRecoveryConfig에는 전용 RACH설정에 설정된 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 전용 RACH- ConfigDedicated를 수신하는 단계를 포함하고, 여기서, RACH-ConfigDedicated에는 전용 RACH 설정에 설정된 제 2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 전환에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는 단계 를 포함하고, 여기서, RACH-ConfigDedicated의 CBRA 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는 단계는, 네트워크측 기기에서 송신된 feature combination의 RACH 설정을 수신하는 단계를 포함하고, 여기서, feature combination의 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함 하고, 여기서, Coverage Enhancement feature는 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용된다. 여기서, 단계1601 내지 단계1602에 관련된 기타 상세한 설명은 상기 실시예의 설명을 참조할 수 있고, 본 발명 의 실시예에서 더는 설명하지 않는다. 상기에 기재된 바와 같이, 본 발명의 실시예에서, 네트워크측 기기에서 송신된 전용 RACH 설정을 수신하고, 여 기서, 전용 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있고; 제2 멀티 PRACH 전송 설정에 따라 시작 된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신한다. 본 발명의 실시예에서, 구체적으로 네트워크측 기기에 서 송신된 전용 RACH 설정을 수신하고, 단말 기기는 전용 RACH 설정에 운송된 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신함으로, 제2 멀티 PRACH 전송 설정 송신의 정확성을 향 상시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신 하고, PRACH 채널의 커버리지를 향상시킨다. 도17은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 장치의 구조 개략도이고, 도17에 도시된 바와 같이, 당 해 장치는, 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하는 멀티 PRACH 전송 설정을 단말 기기에 송신하는 송신 모듈 - 제1 멀티 PRACH 전송 설정은 비경쟁을 기반으로 하는 랜덤 액세스(CFRA)의 멀티 PRACH 전송 설정에 사용되고, 제2 멀티 PRACH 전송 설정은 경쟁을 기반으로 하는 랜덤 액세스(CBRA)의 멀티 PRACH 전송 설정에 사용되고, 여기서, 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨 - ; 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신하는 수신 모듈; 을 포함한다. 상기에 기재된 바와 같이, 본 발명 실시예의 멀티 PRACH 전송 설정 장치에서, 송신 모듈을 통해 멀티 PRACH 전 송 설정을 단말 기기에 송신할 수 있고, 수신 모듈은 단말 기기에 의해 제1 멀티 PRACH 전송 설정에 따라 시작 된 CFRA 멀티 PRACH 전송 및/또는 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 수신할 수 있다. 본 발명의 실시예에서, 멀티 PRACH 전송 설정을 단말 기기에 송신한 후, 단말 기기는 멀티 PRACH 전송 설 정에 따라 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 시작하고, 랜덤 액세스의 실패 확률을 감소시 킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 네트워크측 기기는 멀티 PRACH 전송 설정 장치에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 그다음, 본 발명의 일 실시예에서, CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 본 발명의 일 실시예에서, 송신 모듈이, 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경우, 구체적으로, PDCCH에 의해 트리거링된 CFRA에 응답하여, PDCCH 순서(PDCCH order)를 단말 기기에 송신하는데 사용되고, 여기 서, PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경우, 구체적으로, PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 단말 기기에 송신하는데 사용되고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경우, 구체적으로, 전환에 의해 트리거링된 CFRA에 응답하여, RACH-ConfigDedicated를 단말 기기에 송신하는데 사용되고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경우, 구체적으로, 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 빔 실패 회복 설정을 단말 기기에 송신하는데 사용되고, 여 기서, 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 빔 실패 회복 설정은, 중의 적어도 하나를 포함한다 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig). 본 발명의 일 실시예에서, 송신 모듈이, 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경우, 구체적으로, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용된 다. 본 발명의 일 실시예에서, 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함한다. 본 발명의 일 실시예에서, 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함한다. 본 발명의 일 실시예에서, 송신 모듈이, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경 우, 구체적으로, 공공 랜덤 액세스 채널(RACH) 설정을 단말 기기에 송신하는데 사용되고, 여기서, RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함된다. 본 발명의 일 실시예에서, 송신 모듈이, RACH 설정을 단말 기기에 송신하는데 사용될 경우, 구체적으로, SIB1의 최초 BWP 설정의 제1 랜덤 액세스 공공 설정(RACH-ConfigCommon)을 단말 기기에 송신하는데 사용되고, 여기서, 제1 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, RACH 설정을 단말 기기에 송신하는데 사용될 경우, 구체적으로, RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 단말 기기에 송신하는데 사용되고, 여기서, 제2 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경 우, 구체적으로, 전용 RACH 설정을 단말 기기에 송신하는데 사용되고, 여기서, 전용 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, 전용 RACH 설정을 단말 기기에 송신하는데 사용될 경우, 구체적 으로, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 빔 실패 회복 설정(BeamFailureRecoveryConfig)을 단말 기기 에 송신하는데 사용되고, 여기서, BeamFailureRecoveryConfig에는 전용 RACH 설정에 설정된 제2 멀티 PRACH 전 송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경 우, 구체적으로, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 전용 랜덤 액세스 설정(RACH-ConfigDedicated)을 단말 기기에 송신하는데 사용되고, 여기서, RACH-ConfigDedicated에는 전용 RACH 설정에 설정된 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경 우, 구체적으로, 전환에 의해 트리거링된 CBRA에 응답하여, RACH-ConfigDedicated를 단말 기기에 송신하는데 사용되고, 여기서, RACH-ConfigDedicated의 CBRA 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, 송신 모듈이, 제2 멀티 PRACH 전송 설정을 단말 기기에 송신하는데 사용될 경 우, 구체적으로, 특징 그룹(feature combination)의 RACH 설정을 단말 기기에 송신하는데 사용되고, 여기서, feature combination의 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 본 발명의 일 실시예에서, feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함 하고, 여기서, Coverage Enhancement feature는 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용된다. 도18은 본 발명의 실시예에 따른 멀티 PRACH 전송 설정 장치의 구조 개략도이고, 도18에 도시된 바와 같이, 당 해 장치는, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정을 수신하는 수신 모듈 - 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및/또는 제2 멀티 PRACH 전송 설정을 포함하고, 여기서, 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정에 사용되고, 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용됨- ; 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 제2 멀티 PRACH 전송 설정에 따라 시작 된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신하는 송신 모듈; 을 포함한다. 상기에 기재된 바와 같이, 본 발명 실시예의 멀티 PRACH 전송 설정 장치에서, 수신 모듈을 통해 네트워크측 기 기에서 송신된 멀티 PRACH 전송 설정을 수신할 수 있고, 멀티 PRACH 전송 설정은 제1 멀티 PRACH 전송 설정 및/ 또는 제2 멀티 PRACH 전송 설정을 포함하고, 여기서, 제1 멀티 PRACH 전송 설정은 CFRA의 멀티 PRACH 전송 설정 에 사용되고, 제2 멀티 PRACH 전송 설정은 CBRA의 멀티 PRACH 전송 설정에 사용되고; 송신 모듈은 제1 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 제2 멀티 PRACH 전송 설정에 따라 시작된 CBRA 멀티 PRACH 전송을 네트워크측 기기에 송신할 수 있다. 본 발명의 실시예에서, 단말 기기는 수신된 멀티 PRACH 전송 설정에 따라 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 시작하고, 랜덤 액세스의 실패 확률을감소시킬 수 있다. 본 발명에서 \"멀티 PRACH 전송 설정\"에 대해 처리 방법을 제공함으로, 멀티 PRACH 전송 설정 장치는 단말 기기에 의해 멀티 PRACH 전송 설정에 따라 시작된 CFRA 멀티 PRACH 전송 및/또는 CBRA 멀티 PRACH 전송을 수신하고, PRACH 채널의 커버리지를 향상시킨다. 선택적으로, 본 발명의 일 실시예에서, CFRA의 트리거링 방식은, 물리 다운링크 제어 채널(PDCCH)에 의한 트리거링; 전환에 의한 트리거링; 빔 실패 회복에 의한 트리거링; 및 PScell 첨부 또는 변경에 의한 트리거링; 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정 을 수신하는데 사용될 경우, 구체적으로, PDCCH에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 PDCCH order를 수신하는데 사용되고, 여기서, PDCCH order에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정 을 수신하는데 사용될 경우, 구체적으로, PScell 첨부 또는 변경에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated 를 수신하는데 사용되고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정 을 수신하는데 사용될 경우, 구체적으로, 전환에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는데 사 용되고, 여기서, RACH-ConfigDedicated의 CFRA 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정 을 수신하는데 사용될 경우, 구체적으로, 빔 실패 회복에 의해 트리거링된 CFRA에 응답하여, 네트워크측 기기에서 송신된 빔 실패 회복 설정을 수신하는 데 사용되고, 여기서, 빔 실패 회복 설정에는 제1 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 빔 실패 회복 설정은, 빔 실패 회복 설정(BeamFailureRecoveryConfig); 빔 실패 회복 세컨더리 셀 설정(BeamFailureRecoverySCellConfig); 및 빔 실패 회복 서비스 셀 설정(BeamFailureRecoveryServingCellConfig); 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 멀티 PRACH 전송 설정 을 수신하는데 사용될 경우, 구체적으로, 브로드캐스트 시그널링 또는 전용 시그널링을 통해 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수 신하는데 사용된다. 선택적으로, 본 발명의 일 실시예에서, 브로드캐스트 시그널링은 시스템 메시지 블록 SIB1을 포함한다. 선택적으로, 본 발명의 일 실시예에서, 전용 시그널링은, 무선 자원 제어(RRC) 재 설정(RRCReconfiguration) 메시지; RRC 회복(RRCResume) 메시지; RRC 릴리스(RRCRelease) 메시지; 및 RRC 구축(RRCSetup) 메시지; 중의 적어도 하나를 포함한다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는데 사용될 경우, 구체적으로, 네트워크측 기기에서 송신된 RACH 설정을 수신하는데 사용되고, 여기서, RACH 설정에는 제2 멀티 PRACH 전송 설 정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, RACH 설정은 각 부분 대역폭에서 단독 설정된 공공 RACH 자원에 포함된 다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는데 사용될 경우, 구체적으로, 네트워크측 기기에서 송신된 SIB1의 최초 BWP 설정의 제1 RACH-ConfigCommon을 수신하는데 사용되고, 여기서, 제1 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는데 사용될 경우, 구체적으로, 네트워크측 기기에서 송신된 RRCReconfiguration 메시지의 BWP 설정의 제2 RACH-ConfigCommon을 수신하는데 사 용되고, 여기서, 제2 RACH-ConfigCommon에는 RACH 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는데 사용될 경우, 구체적으로, 네트워크측 기기에서 송신된 전용 RACH 설정을 수신하는데 사용되고, 여기서, 전용 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는데 사용될 경우, 구체적으로, 빔 실패 회복에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 빔 실패 회복 설정 (BeamFailureRecoveryConfig)을 수신하는데 사용되고, 여기서, BeamFailureRecoveryConfig에는 전용 RACH 설정 에 설정된 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는데 사용될 경우, 구체적으로, PScell 첨부 또는 변경에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 전용 RACH- ConfigDedicated를 수신하는데 사용되고, 여기서, RACH-ConfigDedicated에는 전용 RACH 설정에 설정된 제2 멀 티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는데 사용될 경우, 구체적으로, 전환에 의해 트리거링된 CBRA에 응답하여, 네트워크측 기기에서 송신된 RACH-ConfigDedicated를 수신하는데 사 용되고, 여기서, RACH-ConfigDedicated의 CBRA 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, 수신 모듈이, 네트워크측 기기에서 송신된 제2 멀티 PRACH 전송 설정을 수신하는데 사용될 경우, 구체적으로, 네트워크측 기기에서 송신된 feature combination의 RACH 설정을 수신하는데 사용되고, 여기서, feature combination의 RACH 설정에는 제2 멀티 PRACH 전송 설정이 운송되어 있다. 선택적으로, 본 발명의 일 실시예에서, feature combination은 커버리지 증강 특징(Coverage Enhancement feature)을 포함하고, 여기서, Coverage Enhancement feature는 CBRA의 멀티 PRACH 전송을 서포트하는 Coverage Enhancement feature을 지시하는데 사용된다. 도19는 본 발명의 실시예에 따른 네트워크측 기기의 블록도이다. 예를 들면, 네트워크측 기기는 네 트워크측 기기로 제공될 수 있다. 도19를 참조하면, 네트워크측 기기는 처리 컴포넌트를 포함하고, 나아가 적어도 1개의 프로세서 및 메모리로 대표한 메모리 자원을 더 포함하고, 메모리 자원은 처리 컴포 넌트에 의해 수행될 수 있는 응용 프로그램과 같은 명령을 저정한다. 메모리에 저장된 응용 프로그 램은 하나 또는 하나 이상의 각 명령에 대응되는 각 모듈을 포함할 수도 있다. 또한, 처리 컴포넌트는 명령을 수행하도록 구성되어, 도1에 도시된 바와 같이 상기 네트워크측 기기에 적용되는 임의의 방법을 수행한다. 네트워크측 기기는 네트워크측 기기의 전원 관리를 수행하도록 구성된 전원 컴포넌트를 더 포함할 수 있고, 1개의 유선 또는 무선 네트워크 인터페이스는 네트워크측 기기를 네트워크 및 1개 의 입력/출력(I/O) 인터페이스에 연결하도록 구성된다. 네트워크측 기기는 메모리에 저장된 작동 시스템을 작동할 수 있다. 예를 들면 Windows Server TM, Mac OS XTM, Unix TM,Linux TM, Free BSDTM 또 는 비슷한 시스템이 있다. 도20은 본 발명의 일 실시예에 따른 단말 기기 UE2000의 블록도이다. 예를 들면, UE는 휴대폰, 컴퓨터, 디지털 방송 사용자 기기, 메시징 기기, 게임 콘솔, 태블릿 기기, 의료 기기, 피트니스 기기, 개인 휴대 단말기 등일 수 있다. 도20을 참조하면, UE는 하나 또는 복수의 컴포넌트를 포함하는데, 처리 컴포넌트, 메모리, 전원 컴포넌트, 멀티미디어 컴포넌트, 오디오 컴포넌트, 입력/출력(I/O) 인터페이스, 센서 컴포넌트 및 통신 컴포넌트가 포함된다. 처리 컴포넌트는 일반적으로 디스플레이, 전화 통화, 데이터 통신, 카메라 동작 및 기록 동작과 관련되는 UE의 전체 동작을 제어한다. 처리 컴포넌트는 하나 또는 복수의 프로세서를 포함하여 명령을 수행하여, 상기 방법의 전부 또는 일부 단계를 완성한다. 이외에, 처리 컴포넌트는 하나 또는 복수의 모 듈을 포함할 수 있어, 처리 컴포넌트와 기타 컴포넌트 사이의 인터랙션을 용이하게 한다. 예를 들면, 처 리 컴포넌트는 멀티미디어 모듈을 포함하여, 멀티미디어 컴포넌트와 처리 컴포넌트사이의 인 터랙션을 용이하게 한다. 메모리는 UE에서의 동작을 지원하기 위해 다양한 유형의 데이터를 저장하도록 구성된다. 이러한 데 이터의 예시에는 UE에서 작동되는 모든 애플리케이션 프로그램 또는 방법의 명령, 연락처 데이터, 전화 번호부 데이터, 메시지, 이미지, 비디오 등이 포함된다. 메모리는 모든 유형의 휘발성 또는 비 휘발성 메 모리 또는 이들의 조합으로 구현 가능하다. 예를 들면, 스태틱 랜덤 액세스 메모리(SRAM), 전기적으로 지울 수 있는 프로그래밍 가능한 읽기 전용 메모리(EEPROM), 지울 수 있는 프로그래밍 가능한 읽기 전용 메모리(EPROM), 프로그래밍 가능한 읽기 전용 메모리(PROM), 읽기 전용 메모리(ROM), 자기 메모리, 플래시 메모리, 자기 디스크 또는 광 디스크와 같은 것들이다. 전원 컴포넌트는 UE의 다양한 컴포넌트에 전력을 제공한다. 전원 컴포넌트는 전원 관리 시스 템, 하나 또는 복수의 전원 및 UE에 전력을 생성, 관리 및 분배하는 것과 관련되는 기타 컴포넌트를 포함 할 수 있다. 멀티미디어 컴포넌트는 상기 UE와 사용자 사이에 출력 인터페이스를 제공하는 스크린을 포함한다. 일부 실시예에서, 스크린은 액정 디스플레이(LCD) 및 터치 패널(TP)을 포함할 수 있다. 만약 스크린이 터치 패 널을 포함하면, 스크린은 사용자로부터 입력 신호를 수신하기 위해 터치 스크린으로 구현될 수 있다. 터치 패널 에는 터치 패널의 터치, 슬라이딩 및 제스처를 감지하는 하나 또는 복수의 터치 센서가 포함된다. 상기 터치 센 서는 터치 또는 슬라이딩 동작의 경계를 감지할 수 있을 뿐만 아니라, 상기 터치 또는 슬라이딩 동작과 관련된 웨이크 업 시간 및 압력도 감지할 수 있다. 일부 실시예에서, 멀티미디어 컴포넌트는 전면 카메라 및/또 는 후면 카메라를 포함한다. UE가 촬영 모드 또는 비디오 모드와 같은 작동 모드에 있을 경우, 전면 카메 라 및/또는 후면 카메라는 외부의 멀티미디어 데이터를 수신할 수 있다. 각 전면 카메라 및 후면 카메라는 고정 광학 렌즈 시스템이거나 초점 거리 및 광학 줌 기능을 가질 수 있다. 오디오 컴포넌트는 오디오 신호를 출력 및/또는 입력하도록 구성된다. 예를 들면, 오디오 컴포넌트(201 0)는 마이크(MIC)를 포함하고, UE가 통화 모드, 녹음 모드, 음성 인식 모드와 같은 동작 모드인 경우, 마 이크는 외부의 오디오 신호를 수신하도록 구성된다. 수신된 오디오 신호는 메모리에 저장되거나 통신 컴 포넌트를 통해 송신될 수 있다. 일부 실시예에서, 오디오 컴포넌트는 오디오 신호를 출력하기 위한 스피커를 더 포함한다. I/O 인터페이스는 처리 컴포넌트와 주변 인터페이스 모듈 사이에 인터페이스를 제공하며, 상기 주 변 인터페이스 모듈은 키보드, 클릭 휠, 버튼 등일 수 있다. 이러한 버튼에는 홈 버튼, 볼륨 버튼, 시작 버튼 및 잠금 버튼이 포함될 수 있지만 이에 한정되지 않는다. 센서 컴포넌트는 하나 또는 복수의 센서를 포함하여, UE에 다양한 측면의 상태 평가를 제공하는데 사용된다. 예를 들면, 센서 컴포넌트는 UE의 온/오프 상태, UE의 디스플레이 및 키패드와 같은 컴포넌트의 상대적 위치를 검출할 수 있고, 센서 컴포넌트는 UE 또는 UE의 컴포넌트의 위 치 변화, 사용자와 UE사이의 접촉 유무, UE의 방향 및 위치 또는 가속/감속, UE의 온도 변화 를 검출할 수 있다. 센서 컴포넌트는 근접 센서를 포함 하는데 이는 물리적 접촉이 없을 경우 주변 물체 의 존재를 감지하도록 구성된다. 센서 컴포넌트는 CMOS 또는 CCD이미징 센서와 같은 광 센서를 더 포함하 여 이미징 응용에 사용될 수 있다. 일부 실시예에서, 센서 컴포넌트는 가속도 센서, 자이로스코프 센서, 자기 센서, 압력 센서 또는 온도 센서를 더 포함할 수 있다. 통신 컴포넌트는 UE와 기타 기기 사이의 유선 또는 무선 통신을 용이하게 하도록 구성된다. UE는 통신 표준을 기반으로 하는 WiFi, 2G 또는 3G 또는 이들의 조합과 같은 무선 네트워크에 액세스할 수 있다. 예시적인 실시예에서, 통신 컴포넌트는 방송 채널을 통해 외부 방송 관리 시스템으로부터 방송 신호 또는 방송 관련 정보를 수신한다. 예시적인 실시예에서, 상기 통신 컴포넌트는 근거리 통신(NFC) 모 듈을 더 포함하여 단거리 통신을 촉진한다. 예를 들면, NFC 모듈은 무선 주파수 식별(RFID) 기술, 적외선 데이 터 협회(IrDA) 기술, 초 광대역(UWB) 기술, 블루투스(BT) 기술 및 기타 기술을 기반으로 구현될 수 있다. 예시적인 실시예에서, UE는 하나 또는 복수의 주문형 집적 회로(ASIC), 디지털 신호 프로세서(DSP), 디지 털 신호 처리 장치(DSPD), 프로그래밍 가능 논리 장치(PLD), 필드 프로그래밍 가능 게이트 어레이(FPGA), 컨트 롤러, 마이크로 컨트롤러, 마이크로 프로세서 또는 기타 전자 부품에 의해 상기 방법을 수행한다. 네트워크측 기기네트워크측 기기네트워크측 기기네트워크측 기기네트워크측 기기네트워크측 기기네트워크측 기기 상기 본 발명에서 제공하는 실시예에서, 각각 네트워크측 기기, UE의 각도에서 본 발명의 실시예에 제공된 방법 을 설명하였다. 상기 본 발명의 실시예에서 제공하는 방법의 각 기능을 구현하기 위해, 네트워크측 기기 및 UE 는 하드웨어 구조, 소프트웨어 모듈, 하드웨어 구조, 소프트웨어 모듈, 또는 하드웨어 구조와 소프트웨어 모듈 을 포함하는 형식으로 상기 각 기능을 구현한다. 상기 각 기능의 어느 하나의 기능은 하드웨어 구조, 소프트웨 어 모듈, 또는 하드웨어 구조와 소프트웨어 모듈의 방식으로 수행될 수 있다. 상기 본 발명에서 제공하는 실시예에서, 각각 네트워크측 기기, UE의 각도에서 본 발명의 실시예에 제공된 방법 을 설명한다. 상기 본 발명의 실시예에서 제공하는 방법의 각 기능을 구현하기 위해, 네트워크측 기기 및 UE는 하드웨어 구조, 소프트웨어 모듈, 하드웨어 구조, 소프트웨어 모듈, 또는 하드웨어 구조와 소프트웨어 모듈을 포함하는 형식으로 상기 각 기능을 구현한다. 상기 각 기능의 어느 하나의 기능은 하드웨어 구조, 소프트웨어 모듈, 또는 하드웨어 구조와 소프트웨어 모듈의 방식으로 수행될 수 있다. 본 발명의 실시예는 통신 장치를 제공한다. 통신 장치는 송수신 모듈 및 처리 모듈을 포함한다. 송수신 모듈은 송신 모듈 및/또는 수신 모듈을 포함하고, 송신 모듈은 송신 기능을 구현하는데 사용되고, 수신 모듈은 수신 기 능을 구현하는데 사용되며, 송수신 모듈은 송신 기능 및/또는 수신 기능을 구현할 수 있다. 통신 장치는 단말 기기(예를 들면 상기 방법 실시예의 단말 기기)일 수 있고, 단말 기기의 장치일 수 있고, 단 말 기기와 매칭되어 사용 가능한 장치일 수도 있다. 또는, 통신 장치는 네트워크 기기일 수 있고, 네트워크 기 기의 장치일 수 있고, 네트워크 기기와 매칭되어 사용 가능한 장치일 수도 있다. 본 발명의 실시예는 다른 통신 장치를 제공한다. 통신 장치는 네트워크 기기일 수 있고, 단말 기기(예를 들면 상기 방법 실시예의 단말 기기)일 수 있고, 네트워크 기기가 상기 방법을 구현하도록 서포트하는 칩, 칩 시스템, 또는 프로세서 등일 수 있고, 단말 기기가 상기 방법을 구현하도록 서포트하는 칩, 칩 시스템, 또는 프 로세서 등일 수도 있다. 당해 장치는 상기 방법의 실시예에서 설명된 방법을 구현하는데 사용되고, 구체적으로 상기 방법 실시예의 설명을 참조할 수 있다. 통신 장치는 하나 또는 복수의 프로세서를 포함할 수 있다. 프로세서는 통용 프로세서 또는 전용 프로세서 등일 수 있다. 예를 들면 기저 대역 프로세서 또는 중앙 프로세서일 수 있다. 기저 대역 프로세서는 통신 프로토콜 및 통신 데이터를 처리하고, 중앙 프로세서는 통신 장치(예를 들면, 네트워크측 기기, 기저 대역칩, 단말 기기, 단말 기기 칩, DU 또는 CU 등)를 제어하고, 컴퓨터 프로그램을 수행하고, 컴퓨터 프로그램의 데이터를 처리하는 데 사용될 수 있다. 선택적으로, 통신 장치는 컴퓨터 프로그램이 포함되어 있는 하나 또는 복수의 메모리를 더 포함할 수 있고, 프 로세서는 상기 컴퓨터 프로그램을 수행하여, 통신 장치가 상기 방법의 실시예에서 설명된 방법을 수행하도록 한 다. 선택적으로, 상기 메모리에는 데이터가 더 저장되어 있다. 통신 장치 및 메모리는 단독 설치될 수 있고, 통 합될 수도 있다. 선택적으로, 통신 장치는 트랜시버, 안테나를 더 포함할 수 있다. 트랜시버는 송수신 유닛, 트랜스폰더, 또는 송수신 회로 등으로 불리울 수 있고, 송수신 기능을 구현하는데 사용된다. 트랜시버는 수신기 및 송신기를 포함 할 수 있고, 수신기는 접수기 또는 수신 회로 등으로 불리울 수 있고, 수신 기능을 구현하는데 사용되고; 송신 기는 송신 회로 등으로 불리울 수 있고, 송신 기능을 구현하는데 사용된다. 선택적으로, 통신 장치에는 하나 또는 복수의 인터페이스 회로를 더 포함할 수 있다. 인터페이스 회로는 코드 명령을 수신하고 프로세서로 전송하는데 사용된다. 프로세서는 상기 코드 명령을 수행하고 통신 장치가 상기 방 법 실시예에서 설명된 방법을 수행하도록 한다. 통신 장치가 네트워크측 기기일 경우: 프로세서는 도1 내지 도8 중 임의의 방법을 수행하는데 사용된다. 통신 장치가 단말 기기(예를 들면 상기 방법 실시예의 단말 기기)일 경우: 프로세서는 도9 내지 도16 중 임의의 방법을 수행하는데 사용된다. 일 구현 방식에서, 프로세서는 수신 및 송신 기능을 구현하는 트랜시버를 포함할 수 있다. 예를 들면 당해 트랜 시버는 송수신 회로, 또는 인터페이스, 또는 인터페이스 회로일 수 있다. 수신 및 송신 기능을 구현하는 송수신 회로, 인터페이스 또는 인터페이스 회로는 분리된 것일 수 있고, 통합된 것일 수도 있다. 상기 송수신 회로, 인 터페이스 또는 인터페이스 회로는 코드/데이터의 판독 기록에 사용될 수 있고, 상기 송수신 회로, 인터페이스 또는 인터페이스 회로는 신호의 전송 또는 전달에 사용될 수 있다. 일 구현 방식에서, 프로세서에는 컴퓨터 프로그램이 저장되어 있을 수 있고, 컴퓨터 프로그램은 프로세서에서 수행되고, 통신 장치가 상기 방법 실시예에서 설명된 방법을 수행하도록 한다. 컴퓨터 프로그램은 프로세서에 고정될 수 있고, 당해 상황에서, 프로세서는 하드웨어에 의해 구현될 수 있다. 일 구현 방식에서, 통신 장치는 회로를 포함할 수 있고, 상기 회로는 상기 방법 실시예의 송신 또는 수신 또는 통신 기능을 구현할 수 있다. 본 발명에서 설명된 프로세서 및 트랜시버는 직접 회로(integrated circuit, IC), 시뮬레이션 IC, 주파수 직접 회로(RFIC), 혼합 신호 IC, 주문형 직접 회로(application specific integrated circuit, ASIC), 인쇄 회로 기판(printed circuit board, PCB), 전자 기기 등에 구현될 수 있다. 당해 프로세 서 및 트랜시버는 각 IC고정 기술로써 제조될 수 있다. 예를 들면 상보성 금속 산화막 반도체(complementary metal oxide semiconductor, CMOS), N형 금속 산화물 반도체(nMetal-oxide-semiconductor, NMOS), P형 금속 산 화물 반도체(positive channel metal oxide semiconductor, PMOS), 양극성 접합 트랜지스터(bipolar junction transistor, BJT), 양극 CMOS(BiCMOS), 실리콘 게르마늄(SiGe), 갈륨비고(GaAs) 등으로 제공된다. 상기 실시예에서 설명된 통신 장치는 네트워크 기기 또는 단말 기기(예를 들면 상기 방법 실시예의 단말 기기) 일 수 있지만, 본 발명에서 설명된 통신 장치의 범위는 이에 한정되지 않고, 통신 장치의 구조는 도20에 의해 한정되지 않는다. 통신 장치는 독립된 기기 또는 비교적 큰 기기의 일부분일 수 있다. 예를 들면 상기 통신 장 치는, 독립된 직접 회로 IC, 또는 칩, 또는, 칩 시스템 또는 서브 시스템; 하나 또는 복수의 IC를 구비한 세트; 선택적으로, 당해 IC 세스튼 데이터, 컴퓨터 프로그램을 저장하는 저 장 컴포넌트를 포함할 수 있고, 모뎀 같은 ASIC; 기타 기기 내에 삽입될 수 있는 모듈; 접수기, 단말 기기, 스마트 단말 기기, 셀 전화, 무선 기기, 휴대폰, 모바일 유닛, 차량 탑재 기기, 네트워 크 기기, 클라우드 기기, 인공지능 기기 등; 기타 등등일 수 있다. 통신 장치가 칩 또는 칩 시스템일 수 있는 상황에 대해, 칩은 프로세서 및 인터페이스를 포함한다. 여기서, 프 로세서의 수량은 하나 또는 다수일 수 있고, 인터페이스의 수량은 다수일 수 있다. 선택적으로, 칩은 필요한 컴퓨터 프로그램 및 데이터를 저장하는 메모리를 포함한다. 당업자는 본 발명의 실시예에서 열거된 각 설명적인 논리 블록(illustrative logical block) 및 단계(step)는 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양자의 결합을 통해 구현될 수 있다는 것을 이해할 수 있다. 당해 기 능이 하드웨어를 통해 구현되는지 소프트웨어를 통해 구현되는 지는 특정된 응용 및 전체 시스템의 설계 요구에 의해 결정된다. 당업자는 각 종 특정 응용에 대해, 각 종 방법을 사용하여 상기 기능을 구현할 수 있지만, 당해구현은 본 발명의 실시예에서 보호하려는 범위를 초과한 것으로 간주되서는 안된다. 본 발명은 명령이 저장되어 있는 판독 가능 저장 매체를 더 제공하고, 당해 명령이 컴퓨터에 의해 수행될 경우 상기 어느 하나의 방법 실시예의 기능이 구현된다. 본 발명은 컴퓨터 프로그램 제품을 더 제공하고, 당해 컴퓨터 프로그램 제품이 컴퓨터에 의해 수행될 경우 상기 어느 하나의 방법 실시예의 기능이 구현된다. 상기 실시예에서, 전부 또는 부분적으로 소프트웨어, 하드웨어, 펌웨어 또는 당해 임의의 조합을 통해 구현될 수 있다. 소프트웨어로써 구현할 경우, 전부 또는 부분적으로 컴퓨터 프로그램 제품의 형식으로 구현된다. 상기 컴퓨터 프로그램 제품은 하나 또는 복수의 컴퓨터 프로그램을 포함한다. 컴퓨터에서 상기 컴퓨터 프로그램을 로 딩 또는 수행할 경우, 전부 또는 부분적으로 본 발명의 실시예에 따른 프로세스 또는 기능을 생성한다. 상기 컴 퓨터는 통용 컴퓨터, 전용 컴퓨터, 컴퓨터 네트워크, 또는 기타 프로그래밍 가능 장치일 수 있다. 상기 컴퓨터 프로그램은 컴퓨터 판독 가능 저장 매체에 저장될 수 있고, 또는 일 컴퓨터 판독 가능 저장 매체에서 다른 컴퓨 터판독 가능 저장 매체에 전송된다. 예를 들면, 상기 컴퓨터 프로그램은 1개의 웹 사이트, 컴퓨터, 서버 또는 데이터 센터에서 유선(예를 들면 동축 케이블, 광섬유, 디지털 가입자 회선(digital subscriber line, DSL)) 또 는 무선(예를 들면 적외선, 무선, 마이크로웨이브 등) 방식을 통해 다른 웹 사이트, 컴퓨터, 서버 또는 데이터 센터에 전송할 수 있다. 상기 컴퓨터 판독 가능 저장 매체는 컴퓨터에 의해 액세스 가능한 임의의 사용 가능한 매체 또는 하나 또는 복수의 사용 가능한 매체로 통합된 서버, 데이터 센터 등 데이터 저장 기기일 수 있다. 상 기 사용 가능한 매체는 자성 매체(예를 들면, 플로핏 디스켓, 하드 디스크, 자기 테이크), 광 매체(예를 들면, 고밀도 디지털 비디오 디스크(digital video disc, DVD)), 또는 반도체 매체(예를 들면, 솔리드 스테이트 디스 크(solid state disk, SSD)) 등일 수 있다. 당업자는, 본 발명에 언급된 제1 , 제2 등 각종 수자 번호는 오직 설명의 편리를 위해 구별한 것이고, 본 발명 실시예의 범위를 한정하지 않고, 선후 순서를 나타내기도 한다. 본 발명의 적어도 하나는 하나 또는 복수로 설명될 수도 있고, 복수는 2개, 3개, 4개 또는 더 많을 수 있고, 본 발명에서 한정하지 않는다. 본 발명의 실시예에서, 기술 구성에 대해, \"제1 \", \"제2 \", \"제3 \", \"A\", \"B\", \"C\" 및 \"D\"를 통해 당해 기술 구성 중의 기술 구성을 구별하고, 당해 \"제1 \", \"제2 \", \"제3 \", \"A\", \"B\", \"C\" 및 \"D\"가 설명하는 기술 구성 사이는 선후 순서 또는 크기 순서가 존재하지 않는다. 당업자는 본 명세서를 고려하고 여기서 개시한 발명을 실시한 후, 본 발명의 기타 실시예를 쉽게 생각해낼 수 있다. 본 발명은 본 발명의 임의의 변형, 용도 또는 적응적 변경을 포괄하기 위한 것으로, 이러한 변형, 용도 또는 적응적 변경은 본 발명의 일반적인 원리를 따르며 본 명세서에 공개되지 않은 본 기술 분야의 공지 상식 또는 통상적인 기술적 수단을 포함한다. 본 명세서 및 실시예는 단지 예시적인 것이며, 본 발명의 진정한 범위 및 사상은 하기의 청구 범위에 의해 결정된다. 본 발명은 상기 이미 설명되고 첨부된 도면에 도시한 정확한 구조에 한정되지 않고, 그 범위를 벗어나지 않고 다양한 수정 및 변경이 가능하다는 점을 이해해야 한다. 본 발명의 범위는 첨부된 청구 범위에 의해서만 한정된 다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20"}
{"patent_id": "10-2024-7041711", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 추가 측면 및 우점은 아래에서 도면과 결합하여 실시예에 대한 설명에서 더 현저해지고 더 쉽게 이해 할 수 있다. 도1은 본 발명의 일 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도2는 본 발명의 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도3은 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도4는 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도5는 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도6은 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도7은 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도8은 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도9는 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도10은 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도11은 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도12는 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도13은 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도14는 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도15는 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도16은 본 발명의 또 다른 실시예에 따른 멀티 PRACH 전송 설정 방법의 개략적인 흐름도이다. 도17은 본 발명의 일 실시예에 따른 멀티 PRACH 전송 설정 장치의 구조 개략도이다. 도18은 본 발명의 다른 실시예에 따른 멀티 PRACH 전송 설정 장치의 구조 개략도이다. 도19는 본 발명의 일 실시예에 따른 네트워크측 기기의 블록도이다. 도20은 본 발명의 일 실시예에 따른 단말 기기의 블록도이다."}
