{"patent_id": "10-2023-0064976", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0167534", "출원번호": "10-2023-0064976", "발명의 명칭": "딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법 및 그 장치", "출원인": "서울대학교산학협력단", "발명자": "김도년"}}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법에 있어서,(a) DNA 구조체 설계도에 기반하여 노드 및 엣지로 구성된 DNA 구조체 그래프를 획득하는 단계;(b) 상기 DNA 구조체 그래프 및 DNA 구조체 형상 예측 모델에 기반하여 상기 DNA 구조체 설계도에 대응하는 DNA구조체 형상을 출력하는 단계;를 포함하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 DNA 구조체 형상 예측 모델은 둘 이상의 DNA 구조체 형상 예측 모델을 포함하여 구성되며,상기 (b) 단계는, 상기 둘 이상의 DNA 구조체 형상 예측 모델 각각에 대하여 상기 DNA 구조체 그래프의 입력에대한 둘 이상의 예비 DNA 구조체 형상을 획득하고,상기 둘 이상의 예비 DNA 구조체 형상 중 가장 에너지가 작은 예비 DNA 구조체 형상을 상기 DNA 구조체 형상으로 출력하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 DNA 구조체 형상 예측 모델은,(c) 복수의 학습용 DNA 구조체 설계도를 획득하고, 획득한 상기 복수의 DNA 구조체 설계도 각각에 대응하는 학습용 DNA 구조체 그래프를 생성하는 단계;(d) 구조체 시뮬레이션 프로그램에 기반하여 상기 복수의 학습용 DNA 구조체 설계도에 대응하는 정답용 DNA 구조체 형상을 획득하는 단계; 및(e) 상기 복수의 학습용 DNA 구조체 그래프, 및 상기 정답용 DNA 구조체에 기반하여 기 저장된 DNA 구조체 형상예측 모델을 학습하는 단계;를 통하여 생성된 것인, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 (c) 단계는,(f) 획득한 상기 복수의 학습용 DNA 구조체 설계도 적어도 일부에 대하여, 적어도 하나의 염기쌍 삽입, 또는 적어도 하나의 염기쌍 삭제에 기반하는 데이터 증강을 수행하여 학습용 증강 설계도를 획득하는 단계; 및(g) 상기 학습용 증강 구조체 설계도 각각에 대응하는 학습용 증강 구조체 그래프를 생성하는 단계;를포함하고,상기 (e) 단계는, 상기 복수의 학습용 DNA 구조체 그래프, 상기 학습용 증강 구조체 그래프, 및 상기 정답용DNA 구조체에 기반하여 상기 기 저장된 DNA 구조체 형상 예측 모델을 학습하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법.공개특허 10-2024-0167534-3-청구항 5 제4항에 있어서,상기 (e) 단계는, 상기 학습용 DNA 구조체 그래프에 대한 학습 및 상기 학습용 증강 구조체 그래프에 대한 학습에 서로 다른 손실 함수를 적용하여 상기 기 저장된 DNA 구조체 형상 예측 모델을 학습하는, 딥러닝에 기반하여DNA 구조체의 형상을 예측하는 방법."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 (e) 단계는, 데이터 기반 손실 및 물리적 정보 기반 손실에 기반하는 제1 손실 함수를 적용하여 상기 학습용 DNA 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 (e) 단계는, 물리적 정보 기반 손실에 기반하는 제2 손실 함수를 적용하여 상기 학습용 증강 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서,상기 DNA 구조체 형상 예측 모델은,상기 복수의 학습용 DNA 구조체 설계도를 하나의 클래스로 학습한 하나의 제1 DNA 구조체 형상 예측 모델, 및상기 제1 DNA 구조체 형상 예측 모델을 둘 이상의 세부 클래스 각각에 대하여 학습한 둘 이상의 제2 DNA 구조체형상 예측 모델들을 포함하고,상기 둘 이상의 세부 클래스 각각은, 상기 복수의 학습용 DNA 구조체 설계도가 상기 둘 이상의 세부 클래스에따라서 구분 및 포함된 것인, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치에 있어서,DNA 구조체 형상 예측 모델이 저장된 저장부;DNA 구조체 설계도에 기반하여 노드 및 엣지로 구성된 DNA 구조체 그래프를 획득하는 그래프 생성부;상기 DNA 구조체 그래프 및 기 학습된 DNA 구조체 형상 예측 모델에 기반하여 상기 DNA 구조체 설계도에 대응하는 DNA 구조체 형상을 출력하는 구조체 예측부;를 포함하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는장치."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,공개특허 10-2024-0167534-4-상기 DNA 구조체 형상 예측 모델은 둘 이상의 DNA 구조체 형상 예측 모델을 포함하여 구성되며,상기 구조체 예측부는, 상기 DNA 구조체 형상 예측 모델에 포함된 둘 이상의 DNA 구조체 형상 예측 모델들 각각에 대하여 상기 DNA 구조체 그래프의 입력에 대한 둘 이상의 예비 DNA 구조체 형상들을 획득하고,상기 둘 이상의 예비 DNA 구조체 형상들 중 가장 에너지가 작은 예비 DNA 구조체 형상을 상기 DNA 구조체 형상으로 결정하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,설계도 획득부;정답용 형상 획득부; 및 학습 처리부;를 더 포함하고,상기 DNA 구조체 형상 예측 모델은,상기 설계도 획득부가, 복수의 학습용 DNA 구조체 설계도를 획득하고,상기 그래프 획득부가, 획득한 상기 복수의 DNA 구조체 설계도 각각에 대응하는 학습용 DNA 구조체 그래프를 생성하며,정답용 형상 획득부가, 구조체 시뮬레이션 프로그램에 기반하여 상기 복수의 학습용 DNA 구조체 설계도에 대응하는 정답용 DNA 구조체 형상을 획득하고, 및상기 학습 처리부는, 상기 복수의 학습용 DNA 구조체 그래프, 및 상기 정답용 DNA 구조체에 기반하여 기 저장된DNA 구조체 형상 예측 모델을 학습하여 생성한 것인, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 설계도 획득부는, 획득한 상기 복수의 학습용 DNA 구조체 설계도 적어도 일부에 대하여, 적어도 하나의 염기쌍 삽입, 또는 적어도 하나의 염기쌍 삭제에 기반하는 데이터 증강을 수행하여 학습용 증강 설계도를 획득하고,상기 그래프 획득부는, 상기 학습용 증강 구조체 설계도 각각에 대응하는 학습용 증강 구조체 그래프를 생성하며, 및상기 학습 처리부는, 상기 복수의 학습용 DNA 구조체 그래프, 상기 학습용 증강 구조체 그래프, 및 상기 정답용DNA 구조체에 기반하여 기 저장된 DNA 구조체 형상 예측 모델을 학습하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 학습 처리부는, 상기 학습용 DNA 구조체 그래프에 대한 학습 및 상기 학습용 증강 구조체 그래프에 대한학습에 서로 다른 손실 함수를 적용하여 상기 기 저장된 DNA 구조체 형상 예측 모델을 학습하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2024-0167534-5-제12항에 있어서,상기 학습 처리부는, 데이터 기반 손실 및 물리적 정보 기반 손실에 기반하는 제1 손실 함수를 적용하여 상기학습용 DNA 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 학습 처리부는, 물리적 정보 기반 손실에 기반하는 제2 손실 함수를 적용하여 상기 학습용 증강 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행하는, 딥러닝에 기반하여 DNA 구조체의형상을 예측하는 장치."}
{"patent_id": "10-2023-0064976", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 학습 처리부는, 상기 복수의 학습용 DNA 구조체 설계도를 하나의 클래스로 학습한 하나의 제1 DNA 구조체형상 예측 모델, 및 상기 제1 DNA 구조체 형상 예측 모델을 둘 이상의 세부 클래스 각각에 대하여 학습한 둘 이상의 제2 DNA 구조체 형상 예측 모델들을 포함하여 상기 DNA 구조체 형상 예측 모델을 생성하고,상기 둘 이상의 세부 클래스는, 상기 복수의 학습용 DNA 구조체 설계도가 상기 둘 이상의 세부 클래스에 따라서구분 및 포함된 것인, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치."}
{"patent_id": "10-2023-0064976", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, (a) DNA 구조체 설계도에 기반하여 노드 및 엣지로 구성된 DNA 구조체 그래 프를 획득하는 단계; (b) 상기 DNA 구조체 그래프 및 DNA 구조체 형상 예측 모델에 기반하여 상기 DNA 구조체 설 계도에 대응하는 DNA 구조체 형상을 출력하는 단계;를 포함하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하 는 방법 및 그 장치, 그리고 DNA 구조체 형상 예측 모델을 학습하는 방법 및 그 장치를 제공할 수 있다."}
{"patent_id": "10-2023-0064976", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법 및 그 장치에 관한 것으로서, 보다 상세하게 는, 하이브리드 학습 알고리즘에 기반하여 신경망 모델을 학습하고 이에 기반하여 DNA 구조체의 형상을 예측하 는 방법 및 그 장치에 관한 것이다."}
{"patent_id": "10-2023-0064976", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능과 딥러닝(deep learning) 기술은 분자 구조의 분석 및 설계에서 패러다임을 크게 바꾸고 있다. 딥러 닝은 매우 방대한 양의 데이터를 학습하여, 새로운 데이터가 입력될 경우 학습 결과를 바탕으로 확률적으로 가 장 높은 답을 선택하는 것이다. 이러한, 딥러닝은 영상에 따라 적응적으로 동작할 수 있으며, 데이터에 기초하여 모델을 학습하는 과정에서 특 성인자를 자동으로 찾아내기 때문에 최근 인공 지능 분야에서 이를 활용하려는 시도가 늘어나고 있는 추세이다. 알파폴드(AlphaFold)나 로제타폴드(RoseTTAFold) 등은 단백질의 서열, 구조 및 기능을 예측하는 딥러닝 모델로 새로운 단백질의 설계 과정을 가속화 하고 있으며, DNA 구조체 설계 과정 가속화에도 적용하기 위한 연구가 진 행되고 있다. 하지만, DNA 구조체는 상보적인 DNA 가닥 수십-수백 개를 합성하여 나노 스케일로 만들어져, 수 나노미터의 해 상도를 지니고 있으며, 이러한 DNA 구조체는 (특히, DNA 종이접기 구조체) 단백질과 달리, 복잡한 형상을 지닐 수 있고, 상보 결합하는 염기 쌍의 수가 수천 내지 수만 단위로 매우 많아 알파폴드나 로제타폴드 등 기존의 딥 러닝 모델이 사용하는 데이터 기반의 학습으로는 예측 정확도가 매우 떨어지는 문제가 있다. 선행기술문헌 특허문헌(특허문헌 0001) KR 10-2021-7016563"}
{"patent_id": "10-2023-0064976", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 데이터 기반 손실 및 물리적 정보 기반 손실에 따른 손실 함수에 기반하는 하이브리드 학습 알고리 즘에 의하여 학습된 DNA 구조체 형상 예측 모델 및 그 전자장치를 제공하는 것을 그 목적으로 한다. 본 발명은, 학습된 DNA 구조체 형상 예측 모델을 이용하여 DNA 구조체 설계도에 대응하는 DNA 구조체 형상을 예 측하는 방법 및 그 장치를 제공하는 것을 그 목적으로 한다."}
{"patent_id": "10-2023-0064976", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따르면, (a) DNA 구조체 설계도에 기반하여 노드 및 엣지로 구성된 DNA 구조체 그래프 를 획득하는 단계; (b) 상기 DNA 구조체 그래프 및 DNA 구조체 형상 예측 모델에 기반하여 상기 DNA 구조체 설 계도에 대응하는 DNA 구조체 형상을 출력하는 단계;를 포함하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측 하는 방법을 제공할 수 있다. 여기서, 상기 DNA 구조체 형상 예측 모델은 둘 이상의 DNA 구조체 형상 예측 모델을 포함하여 구성되며, 상기 (b) 단계는, 상기 둘 이상의 DNA 구조체 형상 예측 모델 각각에 대하여 상기 DNA 구조체 그래프의 입력에 대한 둘 이상의 예비 DNA 구조체 형상을 획득하고, 상기 둘 이상의 예비 DNA 구조체 형상 중 가장 에너지가 작은 예 비 DNA 구조체 형상을 상기 DNA 구조체 형상으로 출력할 수 있다. 여기서, 상기 DNA 구조체 형상 예측 모델은, (c) 복수의 학습용 DNA 구조체 설계도를 획득하고, 획득한 상기 복 수의 DNA 구조체 설계도 각각에 대응하는 학습용 DNA 구조체 그래프를 생성하는 단계; (d) 구조체 시뮬레이션 프로그램에 기반하여 상기 복수의 학습용 DNA 구조체 설계도에 대응하는 정답용 DNA 구조체 형상을 획득하는 단 계; 및 (e) 상기 복수의 학습용 DNA 구조체 그래프, 및 상기 정답용 DNA 구조체에 기반하여 기 저장된 DNA 구조 체 형상 예측 모델을 학습하는 단계;를 통하여 생성된 것일 수 있다. 여기서, 상기 (c) 단계는, (f) 획득한 상기 복수의 학습용 DNA 구조체 설계도 적어도 일부에 대하여, 적어도 하 나의 염기쌍 삽입, 또는 적어도 하나의 염기쌍 삭제에 기반하는 데이터 증강을 수행하여 학습용 증강 설계도를 획득하는 단계; 및 (g) 상기 학습용 증강 구조체 설계도 각각에 대응하는 학습용 증강 구조체 그래프를 생성하 는 단계;를 포함하고, 상기 (e) 단계는, 상기 복수의 학습용 DNA 구조체 그래프, 상기 학습용 증강 구조체 그래 프, 및 상기 정답용 DNA 구조체에 기반하여 상기 기 저장된 DNA 구조체 형상 예측 모델을 학습할 수 있다. 여기서, 상기 (e) 단계는, 상기 학습용 DNA 구조체 그래프에 대한 학습 및 상기 학습용 증강 구조체 그래프에 대한 학습에 서로 다른 손실 함수를 적용하여 상기 기 저장된 DNA 구조체 형상 예측 모델을 학습할 수 있다. 여기서, 상기 (e) 단계는, 데이터 기반 손실 및 물리적 정보 기반 손실에 기반하는 제1 손실 함수를 적용하여 상기 학습용 DNA 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행할 수 있다. 여기서, 상기 (e) 단계는, 물리적 정보 기반 손실에 기반하는 제2 손실 함수를 적용하여 상기 학습용 증강 구조 체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행할 수 있다. 여기서, 상기 DNA 구조체 형상 예측 모델은, 상기 복수의 학습용 DNA 구조체 설계도를 하나의 클래스로 학습한 하나의 제1 DNA 구조체 형상 예측 모델, 및 상기 제1 DNA 구조체 형상 예측 모델을 둘 이상의 세부 클래스 각각 에 대하여 학습한 둘 이상의 제2 DNA 구조체 형상 예측 모델들을 포함하고, 상기 둘 이상의 세부 클래스 각각은, 상기 복수의 학습용 DNA 구조체 설계도가 상기 둘 이상의 세부 클래스에 따라서 구분 및 포함된 것일 수 있다. 본 발명의 다양한 실시 예에 따르면, DNA 구조체 형상 예측 모델이 저장된 저장부; DNA 구조체 설계도에 기반하 여 노드 및 엣지로 구성된 DNA 구조체 그래프를 획득하는 그래프 생성부; 상기 DNA 구조체 그래프 및 기 학습된 DNA 구조체 형상 예측 모델에 기반하여 상기 DNA 구조체 설계도에 대응하는 DNA 구조체 형상을 출력하는 구조체 예측부;를 포함하는, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치를 제공할 수 있다. 여기서, 상기 DNA 구조체 형상 예측 모델은 둘 이상의 DNA 구조체 형상 예측 모델을 포함하여 구성되며, 상기 구조체 예측부는, 상기 DNA 구조체 형상 예측 모델에 포함된 둘 이상의 DNA 구조체 형상 예측 모델들 각각에 대 하여 상기 DNA 구조체 그래프의 입력에 대한 둘 이상의 예비 DNA 구조체 형상들을 획득하고, 상기 둘 이상의 예 비 DNA 구조체 형상들 중 가장 에너지가 작은 예비 DNA 구조체 형상을 상기 DNA 구조체 형상으로 결정할 수 있 다. 여기서, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 장치는, 설계도 획득부; 정답용 형상 획득부; 및 학 습 처리부;를 더 포함하고, 상기 DNA 구조체 형상 예측 모델은, 상기 설계도 획득부가, 복수의 학습용 DNA 구조 체 설계도를 획득하고, 상기 그래프 획득부가, 획득한 상기 복수의 DNA 구조체 설계도 각각에 대응하는 학습용 DNA 구조체 그래프를 생성하며, 정답용 형상 획득부가, 구조체 시뮬레이션 프로그램에 기반하여 상기 복수의 학 습용 DNA 구조체 설계도에 대응하는 정답용 DNA 구조체 형상을 획득하고, 및 상기 학습 처리부는, 상기 복수의 학습용 DNA 구조체 그래프, 및 상기 정답용 DNA 구조체에 기반하여 기 저장된 DNA 구조체 형상 예측 모델을 학 습하여 생성할 수 있다. 여기서, 상기 설계도 획득부는, 획득한 상기 복수의 학습용 DNA 구조체 설계도 적어도 일부에 대하여, 적어도 하나의 염기쌍 삽입, 또는 적어도 하나의 염기쌍 삭제에 기반하는 데이터 증강을 수행하여 학습용 증강 설계도 를 획득하고, 상기 그래프 획득부는, 상기 학습용 증강 구조체 설계도 각각에 대응하는 학습용 증강 구조체 그 래프를 생성하며, 및 상기 학습 처리부는, 상기 복수의 학습용 DNA 구조체 그래프, 상기 학습용 증강 구조체 그 래프, 및 상기 정답용 DNA 구조체에 기반하여 기 저장된 DNA 구조체 형상 예측 모델을 학습할 수 있다. 여기서, 상기 학습 처리부는, 상기 학습용 DNA 구조체 그래프에 대한 학습 및 상기 학습용 증강 구조체 그래프 에 대한 학습에 서로 다른 손실 함수를 적용하여 상기 기 저장된 DNA 구조체 형상 예측 모델을 학습할 수 있다. 여기서, 상기 학습 처리부는, 데이터 기반 손실 및 물리적 정보 기반 손실에 기반하는 제1 손실 함수를 적용하 여 상기 학습용 DNA 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행할 수 있다. 여기서, 상기 학습 처리부는, 물리적 정보 기반 손실에 기반하는 제2 손실 함수를 적용하여 상기 학습용 증강 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행할 수 있다. 여기서, 상기 학습 처리부는, 상기 복수의 학습용 DNA 구조체 설계도를 하나의 클래스로 학습한 하나의 제1 DNA 구조체 형상 예측 모델, 및 상기 제1 DNA 구조체 형상 예측 모델을 둘 이상의 세부 클래스 각각에 대하여 학습 한 둘 이상의 제2 DNA 구조체 형상 예측 모델들을 포함하여 상기 DNA 구조체 형상 예측 모델을 생성하고, 상기 둘 이상의 세부 클래스는, 상기 복수의 학습용 DNA 구조체 설계도가 상기 둘 이상의 세부 클래스에 따라서 구분 및 포함된 것일 수 있다."}
{"patent_id": "10-2023-0064976", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, 데이터 기반 손실 및 물리적 정보 기반 손실에 따른 손실 함수에 기반하는 하이브리드 학습 알고리즘에 의하여 학습된 DNA 구조체 형상 예측 모델 및 이를 포함하는 장치를 제공함으로써 DNA 종이접기 구조체의 형상을 빠르고 정확하게 예측할 수 있는 효과가 있다. 본 발명의 다양한 실시 예에 따르면, DNA 구조체에 따라서 구분 및 학습된 복수의 형상 예측 모델을 포함하는 앙상블 모델 및 이를 포함하는 장치를 제공함으로써 거의 실시간으로 높은 정밀도의 단량체 DNA 종이접기 구조 체의 형상을 예측할 수 있는 효과가 있다. 본 발명의 다양한 실시 예에 따르면, 데이터 기반의 학습 방법 및 물리적 정보 기반의 학습 방법을 병합한 하이 브리드 학습 알고리즘에 기반하는 앙상블 모델 및 이를 포함하는 장치를 제공함으로써 복잡한 형상의 DNA 구조 체를 거의 실시간으로 빠르고 정확하게 예측이 가능하며, 이는 데이터가 부족한 다양한 스케일의 바이오, 나노, 매크로 구조체의 형상을 정확하게 예측할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0064976", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면을 참조하여 실시 예들을 상세하게 설명한다. 그러나, 실시 예들에는 다양한 변경이 가해 질 수 있어서 특허출원의 권리 범위가 이러한 실시 예들에 의해 제한되거나 한정되는 것은 아니다. 실시 예들에 대한 모든 변경, 균등물 내지 대체물이 권리 범위에 포함되는 것으로 이해되어야 한다. 실시 예에서 사용한 용어는 단지 설명을 목적으로 사용된 것으로, 한정하려는 의도로 해석되어서는 안 된다. 단 수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또 는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 실시 예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다.또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성요소는 동일한 참조부호를 부여 하고 이에 대한 중복되는 설명은 생략하기로 한다. 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적 인 설명이 실시 예의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 실시 예의 구성요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러 한 용어는 그 구성요소를 다른 구성요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 그 구성요소는 그 다른 구성 요소에 직접적으로 연결되거나 접속될 수 있지만, 각 구성요소 사이에 또 다른 구성요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 또한, 어떤 구성요소가 다른 구성요소에 통신으로 \"연결\" 또는 \"접속\"된다고 기재된 경우, 그 구성요소는 그 다 른 구성요소에 무선 통신 또는 유선 통신으로 연결되거나 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소 가 \"연결\" 또는 \"접속\"될 수 있다고 이해되어야 할 것이다. 어느 하나의 실시 예에 포함된 구성요소와, 공통적인 기능을 포함하는 구성요소는, 다른 실시 예에서 동일한 명 칭을 사용하여 설명하기로 한다. 반대되는 기재가 없는 이상, 어느 하나의 실시 예에 기재한 설명은 다른 실시 예에도 적용될 수 있으며, 중복되는 범위에서 구체적인 설명은 생략하기로 한다. 장치 및/또는 장치에서 처리되는 '데이터'는 '정보'의 용어로서 표현할 수 있다. 여기서, 정보는 데이터를 포함 하는 개념으로 사용될 수 있다. 본 발명은, 딥러닝에 기반하여 DNA 구조체의 형상을 예측하는 방법 및 그 장치에 관한 것이다. 보다 상세하게 설명하면, 본 발명은, 딥러닝에 기반하는 DNA 구조체 형상 예측 모델에 기반하여 DNA 구조체 설계도에 대응하는 다차원(예: 2차원, 3차원 등)의 DNA 구조체 형상을 예측하는 방법, DNA 구조체 형상 예측 모델을 학습하는 방법, 및 그 장치를 제공함에 있다. 이하, 도면들을 참조하여 본 발명의 바람직한 실시 예들을 설명할 수 있다. 본 명세서에 첨부되는 도면들은 발 명의 상세한 설명과 함께 본 발명의 기술적 사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재된 사항에만 한정되어 해석되어서는 아니 된다. 이하, 도 1을 참고하여, 장치의 구성을 개략적으로 설명할 수 있다. 도 1은 본 발명의 일 실시 예에 따른 장치의 구성을 개략적으로 도시한 개념도이다. 도 1을 참조하면, 장치는 처리부, 저장부, 및 통신부를 포함할 수 있다. 처리부는 적어도 하나의 프로세서(또는 컨트롤러)를 포함하여 구성되며, 적어도 하나의 프로그램(앱, 어플 리케이션, 툴, 플러그인, 소프트웨어 등)을 통하여 장치를 통하여 수행하는 동작들과 관련된 제어명령을 처리할 수 있다. 예를 들면, 처리부는, 형상 예측 프로그램을 통하여 형상 예측 모델을 학습하고, 획득한 DNA 구조체 설계 도에 대응하는 DNA 구조체 형상을 예측할 수 있다. 이때, 형상 예측 프로그램은 장치의 저장부 및/또 는 장치와 연결된 장치의 저장부에 저장될 수 있다. 본 발명의 다양한 실시 예에 따르면, 형상 예측 프로그램은 딥러닝(deep learning)에 기반하는 적어도 하나의 신경망 모델을 포함하여 구성될 수 있다. 보다 상세하게 설명하면, 형상 예측 프로그램은, 그래프 신경망(graph neural network, GNN)에 기반하는 형상 예측 모델(또는 DNA 구조체 형상 예측 모델)을 포함하여 구성될 수 있다. 이때, 형상 예측 모델은, DNA 종이접기(또는 오리가미) 방식으로 DNA 구조체 설계도에 대응하는 DNA 구조체 형 상을 예측하도록 구성된 신경망 모델(예: DNA 종이접기 그래프 신경망 모델)일 수 있다. 형상 예측 프로그램은, DNA 구조체 설계도를 획득하고, DNA 구조체 설계도에 기반하여 DNA 구조체 그래프를 생 성하고, DNA 구조체 그래프에 기반하여 형상 예측 모델을 학습하고, DNA 구조체 그래프에 기반하여 DNA 구조체 형상을 예측하는 등 본 발명의 실시 예들을 통해서 설명하는 동작을 수행하기 위한 프로그램(및/또는 알고리 즘)의 적어도 일부를 포함하여 구성될 수 있다.처리부는, 형상 예측 모델을 통하여 장치와 연결된 적어도 하나의 장치(예: 사용자 장치)와 데이터 처리 및/또는 처리 결과를 공유할 수 있다. 이하, 다양한 실시 예들에서, 장치가 제어명령에 따른 동작을 수행하는 것은, 장치의 적어도 하나의 제어명령 처리와 관련된 적어도 하나의 프로그램 및/또는 형상 예측 프로그램을 통하여 지정된 동작을 수행하는 것으로 이해될 수 있다. 여기서, 제어명령 처리는 장치에 설치된 상기 적어도 하나의 프로그램 또는 형상 예측 프로그램을 통해서 수행되는 것으로 설명하고 있지만, 이에 한정하지 않고, 저장부에 기 설치된 다른 프로그램 또는 임시 설 치 프로그램을 통하여 제공될 수도 있다. 일 실시 예에 따르면, 제어명령 처리는 장치와 연결된 외부 장치에서 무료 또는 유로로 제공되는 데이터베 이스의 적어도 일부에 기반하여 처리부가 수행하는 것일 수도 있다. 장치의 동작은 처리부의 데이터 처리 및 장치 제어에 기반하여 수행되며, 처리부는 장치의 입출력부 또는 통신부를 통해서 수신하는 제어명령에 기반하여 지정된 기능을 수행할 수도 있다. 또한, 처리부는 통신부를 통해서 획득하는 데이터를 처리함에 있어서, 식별된 사용자에 기반하여 처 리할 수도 있다. 예를 들면, 처리부는 통신부를 통하여 연결된 사용자 장치로부터 수신한 사용자 정 보 및/또는 장치와 연결된 입력부(또는 입출력부)를 통해서 획득한 사용자 정보에 기반하여 사용자를 식별 하고 식별된 사용자에 의하여 입력된 제어명령에 따른 동작을 수행할 수 있다. 저장부는 장치의 적어도 하나의 구성요소(예: 처리부 또는 통신부에 의해 처리되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 제어명령 처리를 위한 프로그램, 프로그램을 통해서 처리된 데 이터, 및/또는 이와 관련된 입력 데이터와 출력 데이터를 포함할 수 있다. 저장부는 제어명령 처리를 위한 인공신경망 알고리즘, 블록체인 알고리즘, 딥러닝 알고리즘, 회귀분석 알 고리즘, 및 이와 관련된 메커니즘, 연산자, 언어모델, 빅데이터 중 적어도 일부에 기반하는 인공지능 알고리즘 을 포함할 수 있다. 저장부에 저장된 형상 예측 프로그램 또는 형상 예측 모델은, 상술한 인공지능 알고리즘 적어도 일부를 포 함하여 구성될 수 있다. 형상 예측 프로그램은, 획득한 DNA 구조체 설계도에 기반하여 노드(node) 및 엣지(edge)로 구성된 DNA 구조체 그래프를 생성하기 위한 인공지능 알고리즘 적어도 일부를 포함하거나, 및/또는 이를 위한 인공지능 알고리즘과 연결될 수 있다. 또한, 형상 예측 프로그램을 구성하는 인공지능 알고리즘은 복수의 신경망 모델로 구분 형성될 수 있다. 예를 들면, 형상 예측 프로그램을 위한 인공지능 알고리즘은, 트랜스포머 레이어(transformer layer)의 어텐션 매커니즘(attention mechanism)에 기반하는 알고리즘을 포함하여 구성될 수 있다. 보다 바람직하게는, 형상 예 측 프로그램을 위한 인공지능 알고리즘은 다중 헤드 어텐션 메커니즘(multi-head attention mechanism)에 기반 하는 알고리즘을 포함하여 구성될 수 있다. 이하, 본 발명의 다양한 실시 예를 설명함에 있어서, 형상 예측 모델의 동작은 형상 예측 모델의 동작 또는 형 상 예측 모델을 포함하는 형상 예측 프로그램의 동작으로서 이해되어야 할 것이다. 저장부는, DNA 구조체 형상 예측에 사용하기 위한 적어도 하나의 DNA 구조체 설계도를 포함할 수 있다. 보다 상세하게 설명하면, 저장부는, 형상 예측 모델의 학습을 위한 학습용 DNA 구조체 설계도, 정답용 DNA 구조체 형상 중 적어도 일부가 저장될 수 있다. 이때, 학습용 DNA 구조체 설계도, 및 정답용 DNA 구조체 형상은 형상 예측 모델의 학습을 위한 데이터 셋으로 저장될 수 있다. 저장부는 입출력부 및/또는 통신부에 포함된 각각의 장치들을 통해 수신하는 신호를 통하여 지정된 제어 및 동작을 확인하고 처리하기 위한 데이터를 포함할 수 있다. 저장부와 관련하여 수행된 동작들은 처리부에 의하여 처리되며, 관련된 동작들을 처리하기 위한 데이 터, 처리 중인 데이터, 처리된 데이터, 기 설정된 데이터 등은 데이터베이스로서 저장부에 저장될 수있다. 저장부에 저장된 데이터는 식별된 사용자의 사용자 입력에 기반하여 처리부가 변경, 수정, 삭제, 및/ 또는 새로운 데이터를 생성할 수 있다. 저장부는, 장치의 장치 설정 정보가 저장될 수 있다. 장치 설정 정보는 장치 및 장치가 제 공하는 기능 및 서비스의 적어도 일부에 대한 설정 정보일 수 있다. 저장부는, 적어도 하나의 사용자에 대한 사용자 정보(또는 사용자 계정)이 저장될 수 있다. 사용자 정보는, 사용자 식별정보(예: identification, ID) 및 패스워드(password), 사용자 맞춤형 설정 정보 중 적어도 일부 정보가 저장될 수 있다. 사용자 맞춤형 설정 정보는 장치의 제어 권한, 및/또는 기능 적어도 일부에 대한 설정 정보로서, 관리자 입력에 따라서 설정 및 저장될 수 있다. 여기서, 사용자 정보 중 적어도 일부는, 형상 예측 프로그램의 데이터로서 저장될 수 있다. 저장부는, 휘발성 메모리, 비휘발성 메모리, 및/또는 이와 같이 컴퓨터 판독 가능한 기록매체를 포함하여 구성될 수 있다. 이때, 컴퓨터 판독 가능한 기록 매체는, 본 발명의 다양한 실시 예들에 기반하여 장치가 본 발명의 실시 예에 따른 동작을 수행하기 위한 컴퓨터 프로그램이 저장될 수 있다. 통신부는 장치와 적어도 하나의 다른 장치(예: 사용자 장치, 또는 장치를 제어할 수 있는 관리 자 장치)의 유선 통신 채널의 수립, 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신부는, 통신을 수행하는 과정에서 변/복조, 암호화/복호화 등의 동작을 수행할 수 있으며, 이는 당업자 에게 자명하므로 더 이상의 설명은 생략하도록 한다. 통신부는 처리부에 종속적 또는 독립적으로 운영되고, 무선 통신 및/또는 유선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통신부는 무선 통신을 지원하는 경우, 무선 통신 모듈, 예를 들면, 셀룰러 통신 모 듈, 근거리 무선 통신 모듈, GNSS(global navigation satellite system) 통신 모듈 중 적어도 일부 통신 모듈 을 포함할 수 있다. 통신부는 유선 통신을 지원하는 경우, 유선 통신 모듈, 예를 들면, LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈, CAN(controller area network) 통신 모듈, SPI(serial peripheral interface) 통신 모 듈 중 적어도 일부 통신 모듈을 포함할 수 있다. 보다 상세하게 설명하면, 통신부는 블루투스, BLE(Bluetooth Low Energy), WiFi, WiFi direct, IrDA(infrared data association), ZigBee, UWB, RF(Radio Frequency) 같은 근거리 통신 네트워크 및/또는 셀 룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 유선 및/또는 무선으로 외부 장치와 통신할 수 있다. 통신부를 구성하는 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별 도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 도 1을 참고하면, 통신부는 장치의 외부 장치와 통신을 수행하는 것으로 도시하고 있지만, 이에 한정 하지 않고, 예를 들면, 저장부, 및/또는 도 1에 구성되지 않은 장치의 다양한 구성 요소들 중 적어도 일부와의 통신을 수행할 수 있다. 더하여, 도 1을 통하여 도시하지는 않지만, 장치는 입출력부(미도시)를 더 포함할 수 있다. 입출력부는 입력부 및 출력부를 포함하여 구성될 수 있다. 입출력부는 키보드, 마우스, 마이크 등 데이터를 입 력하는 입력부(미도시), 구동부, 표시부(예: 디스플레이), 스피커 등 데이터를 출력하는 출력부(미도시) 중 적 어도 일부를 포함하여 구성될 수 있다. 이때, 표시부는, 터치 입력 가능한 터치스크린으로 구성될 수도 있다. 본 발명의 다양한 실시 예에 따르면, 장치 또는 사용자 장치는 이동통신단말기, 멀티미디어 단말기, 유선 단말기, 고정형 단말기 및 internet protocol(IP) 단말기 등을 비롯한 모든 정보통신기기의 범위의 기능 적어도 일부를 포함할 수 있다.장치는 제어명령 처리를 위한 장치로서 워크스테이션(workstation), 또는 대용량의 데이터베이스 (database) 중 적어도 일부 기능을 포함하거나, 또는 통신을 통하여 워크스테이션(workstation), 또는 대용량의 데이터베이스(database) 중 적어도 일부와 연결되도록 구성될 수 있다. 장치 또는 장치와 연결되는 사용자 장치로서, 휴대폰, 피씨(personal computer, PC), 피엠피 (portable multimedia player, PMP), 엠아이디(mobile internet device, MID), 스마트폰(smartphone), 태블릿 PC, 패블릿 PC, 노트북(notebook) 등을 예시할 수 있다. 본 발명의 다양한 실시 예에 따르면, 사용자 장치는 장치와 연결 및 통신하는 장치로 설명할 수 있다. 예 를 들면, 사용자 장치는 도면을 통하여 설명하고 있지는 않지만, 장치와 무선 통신을 통하여 연결되고, 장 치가 본 발명의 실시 예에 따른 동작을 수행하도록 사용자 입력을 송신하는 사용자의 스마트폰일 수 있다. 사용자 장치는 설치된 적어도 하나의 프로그램을 통해서 장치와 연결될 수 있고, 또는 장치가 제공하 는 온라인 상의 적어도 하나의 웹페이지를 통해서 장치와 연결될 수 있다. 이를 위하여, 장치는 서버, 및/또는 DNA 구조체 형상 예측 서비스를 제공하기 위한 터미널(terminal)의 기 능 적어도 일부를 포함하여 구성될 수 있다. 도 2는 본 발명의 일 실시 예에 따른 장치에서 형상 예측 모델이 저장된 저장부 및 형상 예측 모델에 기반하여 기능을 수행하는 처리부 및 저장부의 구성을 기능에 따라 구분하여 도시한 블록도이다. 본 발명의 다양한 실시 예들에 따르면, 상술한 바와 같이, 장치는, DNA 구조체 형상 예측을 수행하며, DNA 구조체 형상 예측을 위한 형상 예측 모델의 학습을 수행하는 형상 예측 프로그램을 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 장치의 형상 예측 프로그램은 그래프 신경망(graph neural network, GNN)에 기반하는 형상 예측 모델을 포함하여 구성될 수 있다. 즉, 장치는, 기 학습된 형상 예측 모델을 통하여 획득한 DNA 구조체 설계도에 대응하는 DNA 구조체 형상을 예측할 수 있고, 장치의 형상 예측 프로그램의 DNA 구조체 형상 예측 정확도는 형상 예측 모델의 학습을 통하여 향상될 수 있다. 먼저, 장치에서, 형상 예측 모델을 이용하여 DNA 구조체 형상을 예측하거나, 또는 형상 예측 모델을 학습 하는 처리부의 동작과 관련된 데이터가 저장된 저장부는, 상술한 바와 같이 데이터 셋 및 형상 예측 모델을 포함하여 구성될 수 있다. 또한, 장치에서 저장부에 저장된 데이터 셋 및 형상 예측 모델에 기반하여 DNA 구조체 형 상을 예측하거나, 또는 형상 예측 모델을 학습하는 처리부는 설계도 획득부, 그래프 생성부, 정 답용 형상 획득부, 학습 처리부, 및 구조체 예측부 중 적어도 하나의 요소를 포함하여 구성될 수 있다. 먼저, 형상 예측 모델의 학습을 위한 데이터 셋의 일 실시 예에 따르면, 데이터 셋은, 복수의 DNA 구조체 설계도를 포함하여 구성될 수 있다. 이때, 복수의 DNA 구조체 설계도는 지정된 비율로서 학습용 데 이터 셋과 테스트용 데이터 셋이 구분된 상태일 수 있다. 데이터 셋에 포함된 DNA 구조체 설계도 적어도 일부는 레이블이 지정된 상태일 수 있다. 보다 바람직하게 는, 데이터 셋에 포함된 DNA 구조체 설계도 각각에는 레이블이 지정된 상태일 수 있다. 이때, 데이터 셋에 포함된 DNA 구조체 설계도 각각에는, DNA 구조체 형상 정보, 예를 들면, 원자들의 3차 원 좌표가 레이블로 지정될 수 있다. 여기서, 구조체 형상 정보는 분자 동역학 시뮬레이션에 기반하는 정보를 포함하여 구성될 수 있다. 다양한 실시 예에 따르면, 데이터 셋은, 데이터 증강(data augmentation)에 기반하여 생성된 증강 구조체 설계도를 더 포함할 수도 있다. 이때, 증강 구조체 설계도는 레이블이 지정되지 않은 상태로 저장될 수 있다. 여기서, 증강 구조체 설계도를 생성하는 동작은 설계도 획득부를 통하여 수행될 수 있다. 설계도 획득부는, 데이터 셋에 저장된 DNA 구조체 설계도의 적어도 일부에 대하여 적어도 하나의 염기쌍 삽입, 또는 적어도 하나의 염기쌍 삭제에 기반하는 데이터 증강을 수행하여 학습용 증강 설계도를 획득할 수 있 다.여기서, 설계도 획득부는, 기 설정된 값 내의 에너지 변화를 만족하도록 DNA 구조체 설계도에 대한 염기쌍 삽입 또는 염기쌍 삭제를 수행할 수 있다. 더하여, 데이터 셋은, 학습용 DNA 구조체 설계도 또는, 학습용 증강 구조체 설계도에 대응하는 적어도 하 나의 정답용 DNA 구조체 형상을 포함하여 구성될 수 있다. 일 실시 예에 따르면, 정답용 DNA 구조체 형상은 학습용 DNA 구조체 그래프에 기반하여 생성된 것일 수 있다. 이를 위하여, 그래프 생성부는, DNA 구조체 설계도 또는 증강 구조체 설계도에 기반하여 DNA 구조체 그래 프 또는 증강 구조체 그래프를 생성할 수 있다. 보다 상세하게 설명하면, 형상 예측 모델의 입력으로 처리되는 DNA 구조체 그래프는, 도 3에 도시된 바와 같이, DNA 구조체 설계도의 염기쌍 및 염기쌍들의 결합 관계에 대응하여 노드 및 엣지를 포함하는 그래프로 구 성될 수 있다. 도 3은 본 발명의 일 실시 예에 따른 장치에서 DNA 구조체 설계도에 기반하여 DNA 구조체 그래프를 생성하는 동 작을 개략적으로 도시한 개념도이다. 도 3을 참고하면, DNA 구조체 그래프를 구성함에 있어서, 그래프 생성부는, DNA 구조체 설계도, 예를 들면, 데이터 셋의 학습용 DNA 구조체 설계도에 포함된 염기쌍을 위치와 방향에 대한 정보를 가진 노드로 모델링할 수 있다. 일 실시 예에 따르면, 학습용 DNA 구조체의 염기쌍 수는 1000개 내지 17000개 사이의 수로 구성될 수 있다. 하 지만, 이에 한정하지 않고, 학습용 DNA 구조체를 구성하는 염기쌍의 수는 다양하게 설계될 수 있을 것이다. 그래프 생성부는, DNA 구조체 설계도에 포함된 염기쌍들의 결합 관계에 기반하여, 염기쌍 사이의 공유 결 합을 나타내는 구조 엣지(structural edge)와 DNA의 음전하로 인한 정전기 상호 작용을 나타내는 정전기 엣지 (electrostatic edge)를 모델링할 수 있다. 여기서, 구조 엣지는 염기에 따른 고유한 기하 정보와 역학적 물성 정보를 포함하고, 정전기 엣지는 염기쌍 사 이에 형성된 반발력(또는 반발력에 대한 거리 함수) 정보를 포함하도록 구성될 수 있다. 그래프 생성부는 노드 및 엣지의 모델링에 기반하여 DNA 구조체 설계도에 대응하는 DNA 구조체 그래프를 생성할 수 있다. 상술한 바와 같이, 그래프 생성부는, DNA 구조체 설계도에 대응하는 DNA 구조체 그래프를 생성할 수 있고, 더하여 증강 구조체 설계도에 대응하는 증강 구조체 그래프를 생성할 수도 있다. 이후, 정답용 형상 획득부는, 생성한 DNA 구조체 그래프에 기반하여 정답용 DNA 구조체 형상을 획득할 수 있다. 여기서, 정답용 DNA 구조체 형상은, 3차원 평형 상태의 DNA 구조체 형상(또는 평형 상태의 최종 구성, ground- truth, GT))으로서, 멀티스케일 물리 모델(multi-scale physics-based model)에 기반하여 DNA 구조체 형상을 시뮬레이션 하는 적어도 하나의 시뮬레이션 프로그램(예: Structured NUcleic-acids Programming Interface, SNUPI)에 기반하여 생성된 것일 수 있다. 일 실시 예에 따르면, DNA 구조체 형상을 시뮬레이션 하는 적어도 하나의 프로그램은 저장부에 저장된 상 태일 수 있고, 또는 장치 외부, 예를 들면, 서버에 저장된 상태일 수 있다. DNA 구조체 형상을 시뮬레이션 하는 적어도 하나의 프로그램이 서버에 저장된 경우, 정답용 형상 획득부는, 학습용 DNA 구조체 그래프(또는 학습용 DNA 구조체 설계도)를 서버에 송신하고, 서버로부터 학 습용 DNA 구조체 그래프(또는 학습용 DNA 구조체 설계도)에 대응하는 정답용 DNA 구조체 형상을 수신할 수 있다. 더하여, 정답용 형상 획득부는, 학습용 DNA 구조체 설계도, 또는 학습용 DNA 구조체 설계도에 대응하는 학 습용 DNA 구조체 그래프에 대한 세부 클래스를 구분할 수 있다. 예를 들면, 정답용 형상 획득부 학습용 DNA 구조체 설계도에 레이블된 정보 또는, 정답용 DNA 구조체 형상 에 기반하여 학습용 DNA 구조체 설계도 또는 학습용 DNA 구조체 그래프에 대한 세부 클래스를 구분할 수 있다. 일 실시 예에 따르면, 세부 클래스는 블록(block) 구조, 굽힘(curved) 구조, 비틀림(twisted) 구조, 힌지 (hinged) 구조, 2차원 와이어프레임(wireframe) 구조 및 3차원 와이어프레임 구조의 6개 세부 클래스를 포함하 여 구성될 수 있다. 또한, 정답용 형상 획득부는, 데이터 셋에 포함된 학습용 DNA 구조체 설계도들 또는 학습용 DNA 구조 체 그래프들을 하나의 클래스(또는 하나의 세부 클래스)로 설정할 수도 있다. 학습 처리부는, 상술한 바와 같이 구성된 데이터 셋에 기반하여 형상 예측 모델의 학습을 수행 할 수 있다. 형상 예측 모델은, 도 4를 참고하면, DNA 구조체 그래프(또는 초기 구성, initial configuration)에 기반 하여 예측된 DNA 구조체 형상(3차원 평형 상태의 DNA 구조체 형상 또는 평형 구성, equilibrium configuration)을 예측하는 신경망 모델로 구성될 수 있다. 도 4는 본 발명의 일 실시 예에 따른 장치에서 형상 예측 모델의 개략적인 구성 및 동작을 나타내는 개념도이다. DNA 구조체 그래프를 입력으로 DNA 구조체 형상을 예측하는 형상 예측 모델은, 기계적 이완 블록 (mechanical relaxation block), 정전기 정제 블록(electromagnetic refinement block), 및 잔여 블록 (residual block)을 포함하여 구성될 수 있다. 도 4를 참고하면, 5개의 기계적 이완 블록과 1개의 정전기 정제 블록을 포함하여 구성된 것으로 도시하고 있으 나, 이에 한정하지 않고, 기계적 이완 블록의 수 또는 정전기 정제 블록의 수는 다양하게 변형될 수 있다. 기계적 이완 블록의 일 실시 예에 따르면, 기계적 이완 블록은 ResNet, 또는 DenseNet에서 사용되는 구조에 기 반하여 기계적 변형 에너지가 최소화되는 구조체 구성을 찾도록 설계된 요소일 수 있다. 정전기 정제 블록의 일 실시 예에 따르면, 트랜스포머 모델에서 사용되는 구조로서, 컨볼루션 레이어와 활성화 함수인 ReLU(rectified linear unit)를 포함하며, 정전기적 반발력을 반영하여 기계적으로 이완된 구조체의 구 성을 다듬도록 설계된 요소일 수 있다. 잔여 블록(residual block)의 일 실시 예에 따르면, ResNet에서 사용되는 구조에 기반하여 skip connection을 구현하며, 기계적 이완 블록과 정전기 정제 블록 간의 연결을 담당하면서 기계적 이완 블록에서 발생하는 그래 디언트 소실(vanishing gradient) 문제를 해결하도록 설계된 요소일 수 있다. 형상 예측 모델에 대하여 노드 및 엣지로 구성된 DNA 구조체 그래프(또는 DNA 구조체 그래프의 값들)가 입 력으로 처리되며, 예측된 DNA 구조체 형상이 출력으로 처리될 수 있다. 기계적 이완 블록에서 노드의 위치와 방향은 그래프 신경층(graph neural layers)을 사용하여 진행하는 잔여 블 록(residual blocks)에서 국소적, 전역적으로 업데이트하며, 레이어 간의 연결을 통해 과도한 평활화(over- smoothing)를 방지하도록 구성될 수 있다. 기계적 이완 블록, 정전기 정제 블록, 및 잔여 블록 각각에서 국소 변위 및 회전 각도의 예측 결과는 트랜스포 머 레이어(transformer layer)의 다중 헤드 어텐션 메커니즘(multi-head attention mechanism)을 기반으로 전 체 그래프에 전파하도록 구성될 수 있다. 잔여 블록 사이에서 구조체를 구성하는 노드의 위치와 방향은 게이트 반복 단위 셀(gated recurrent unit cel l)에서 점진적으로 업데이트하도록 구성되며, 상대적으로 큰 변형이 있는 구조의 경우 레이어 간의 장기 종속성 (long-term dependency)을 캡처하도록 지원할 수 있다. 상술한 바와 같이, 기계적으로 이완된 구조체의 구성 정보는 정전기 정제 블록의 입력으로 처리될 수 있다. 정전기 정제 블록은 수 나노미터(nm) 보다 상세하게는, 0 내지 3nm, 보다 바람직하게는 2.5 nm의 거리 내에서 인접한 노드 사이에 정전기 엣지를 생성하도록 구성될 수 있다. 최종적인 DNA 구조체 형상의 구성은 정전기 정 제 블록을 통하여 정전기 엣지 사이의 반복적인 계산을 수행함으로써 예측하도록 구성될 수 있다. 학습 처리부는, 상술한 바와 같이 구성된 형상 예측 모델의 학습을 수행하며, 이때, 도 5에 도시된 바와 같이, 하이브리드 데이터 기반 및 물리적 정보 기반 학습 알고리즘 (hybrid data-driven and physics- informed training algorithm)(이하, 하이브리드 학습 알고리즘)에 기반하여 형상 예측 모델의 학습을 수 행할 수 있다. 도 5는 본 발명의 일 실시 예에 따른 장치에서 하이브리드 데이터 기반 및 물리적 정보 기반 학습 알고리즘에 기반하여 형상 예측 모델의 학습을 수행하는 동작을 개략적으로 개시한 개념도이다.학습 처리부는, 학습용 DNA 구조체 그래프. 학습용 DNA 증강 그래프, 및 정답용 DNA 구조체 형상에 기반하 여 형상 예측 모델이 학습을 수행할 수 있다. 이때, 학습 처리부는, 학습용 DNA 구조체 그래프에 대하여 데이터 기반 손실(예: data driven loss)에 기 반하는 손실 함수를 이용하여 형상 예측 모델의 학습을 수행할 수 있다. 보다 바람직하게는, 학습 처리부는, 학습용 DNA 구조체 그래프에 대하여 데이터 기반 손실 및 물리적 정보 기반 손실(예: physics informed loss)에 기반하는 손실 함수를 이용하여 형상 예측 모델의 학습을 수행할 수 있다. 더하여, 학습 처리부는, 학습용 DNA 구조체 그래프에 대하여 데이터 기반 손실 또는 물리적 정보 기반 손 실에 기반하는 손실 함수를 이용하여 형상 예측 모델의 학습을 수행할 수 있다. 여기서, 데이터 기반 손실에 기반하는 손실 함수(데이터 기반 손실 함수)는 형상 예측 모델에 기반하여 예 측된 DNA 구조체 형상(평형 구성) 및 정답용 DNA 구조체 형상 사이에서 노드의 위치와 방향의 평균 제곱 오차에 대한 함수일 수 있다. 또한, 물리적 정보 기반 손실에 기반하는 손실 함수(물리적 정보 기반 손실 함수)는, 형상 예측 모델에 기 반하여 예측된 DNA 구조체 형상(평형 구성) 및 정답용 DNA 구조체 형상 사이에서 기계적 구성 및 에너지 차이에 대한 함수일 수 있다. 학습 처리부는, 형상 예측 모델의 학습을 수행함에 있어서, 학습에 사용된 설계도(또는 그래프)에 대 해 평가된 손실 함수를 최소화하는 학습을 수행하며, 이를 위하여 단계 감쇠 학습 속도 스케줄러(step decay learning rate scheduler)가 있는 옵티마이저(예: Adam, 또는 AdamW 등)를 사용하여 형상 예측 모델(또는 형상 예측 모델을 구성하는 GNN)의 매개변수를 최적화할 수 있다. 상술한 바와 같이, 하이브리드 학습 알고리즘에 기반하여 학습한 형상 예측 모델의 성능을 도 6 내지 도 8 을 참고하여 설명할 수 있다. 도 6은 본 발명의 일 실시 예에 따른 장치에서 하이브리드 학습 알고리즘에 따라 학습된 형상 예측 모델과 다른 방식으로 학습된 형상 예측 모델이 예측한 DNA 구조체 형상을 도시한 도면이다. 도 7은 본 발명의 일 실시 예에 따른 장치에서 하이브리드 학습 알고리즘에 따라 학습된 형상 예측 모델과 다른 방식으로 학습된 형상 예측 모 델이 예측한 DNA 구조체 형상들의 모양 점수를 도시한 그래프이다. 도 8은 본 발명의 일 실시 예에 따른 장치에 서 하이브리드 학습 알고리즘에 따라 학습된 형상 예측 모델과 다른 방식으로 학습된 형상 예측 모델이 예측한 DNA 구조체 형상들의 에너지 레벨을 도시한 그래프이다. 도 6 내지 도 8에 따르면, 본 발명의 실시 예에 따른 형상 예측 모델은 252개의 학습용 DNA 구조체 설계도 및 48개의 테스트용 구조체 설계도를 포함한 총 300개의 DNA 구조체 설계도로 구성된 데이터 셋, 및 하이브리드 학습 알고리즘에 기반하여 학습된 모델을 이용하였으며, 데이터 증강을 수행한(w/ augmentation) 형상 예측 모 델(w/ augmentation)을 이용하여 예측한 DNA 구조체 형상(hybrid, w/ augmentation) 및 데이터 증강을 수 행하지 않은(w/o augmentation) 형상 예측 모델(w/o augmentation)을 이용하여 예측한 DNA 구조체 형상 (hybrid, w/o augmentation)을 구분하여 결과를 도출하였다. 여기서, 데이터 증강을 수행하는 경우, 설계도 획득부는, 252개의 학습용 DNA 구조체 설계도 각각에 대하 여 2개의 학습용 증강 설계도를 생성하였다. 또한, 상술한 바와 같이, 학습 처리부는, 레이블이 지정된 설계도(학습용 DNA 구조체 설계도)의 경우 데이 터 기반 손실과 물리적 정보 기반 손실이 모두 학습에 사용되었지만, 학습용 증강 설계도에는 물리적 정보 기반 손실만 학습에 사용되었다. 이와 비교하는 DNA 구조체 형상은, 데이터 기반 접근 방식으로 학습한 형상 예측 모델을 이용하여 예측한 DNA 구조체 형상(data driven), 물리적 정보 기반 접근 방식으로 학습한 형상 예측 모델을 이용하여 예측한 DNA 구 조체 형상(physics informed), 및 SNUPI에 기반하여 예측한 DNA 구조체 형상(GT)를 포함하고 있다. 도 6 내지 도 8을 통하여 표시된 DNA 구조체 형상들은, DNA 구조체 형상(GT), DNA 구조체 형상(hybrid, w/ augmentation), DNA 구조체 형상(hybrid, w/o augmentation), DNA 구조체 형상(data driven), DNA 구조체 형상 (physics informed) 각각의 형상 예측 모델에 대하여 48개의 테스트용 DNA 구조체 그래프를 입력으로 처리함으 로써 획득한 결과물에 기반한다.도 6은, 도시된 DNA 구조체 형상(GT), DNA 구조체 형상(hybrid, w/ augmentation), DNA 구조체 형상(hybrid, w/o augmentation), DNA 구조체 형상(data driven), DNA 구조체 형상(physics informed) 각각에서 괄호 안의 값은 DNA 구조체 형상(GT)에 대한 평균 제곱근 거리(root mean square deviation, RMSD) 및 총 에너지의 비율 을 나타낸다. 여기서, 축적 막대는 10nm로 정의된다. 여기서, RMSD는, DNA 구조체 형상과 DNA 구조체 형상(GT)의 노드 사이에 대한 평균 제곱근 거리를 나타낼 수 있 다. 도 7은, DNA 구조체 형상(GT), DNA 구조체 형상(hybrid, w/ augmentation), DNA 구조체 형상(hybrid, w/o augmentation), DNA 구조체 형상(data driven), DNA 구조체 형상(physics informed) 각각에 대한 모양 점수, 예를 들면, RMSD 및 OS(orientation score)의 값을 나타내는 그래프이다. 여기서, OS는 DNA 구조체 형상 각 노드 방향 벡터의 내적으로 정의된 방향 점수를 나타낼 수 있다. 도 7에 따르면, DNA 구조체 형상(hybrid, w/ augmentation)을 예측한 형상 예측 모델(w/ augmentation)의 하이브리드 학습 알고리즘이 가장 높은 성능을 가지는 것을 확인할 수 있다. 예를 들면, DNA 구조체 형상(hybrid, w/ augmentation)을 예측한 형상 예측 모델(w/ augmentation)이 가 장 낮은 RMSD와 가장 높은 OS 값의 DNA 구조체 형상을 예측함으로써 DNA 구조체 형상(GT) 값에 가장 가까운 DNA 구조체 형상을 예측한 것을 확인할 수 있다. 도 8은, DNA 구조체 형상(GT), DNA 구조체 형상(hybrid, w/ augmentation), DNA 구조체 형상(hybrid, w/o augmentation), DNA 구조체 형상(data driven), DNA 구조체 형상(physics informed) 각각에 대한 에너지 레벨, 예를 들면, 기계적 에너지(mechanical energy) 및 정전기 에너지(electrostatic energy)의 값을 나타내는 그래 프이다. 도 8에 따르면, DNA 구조체 형상(hybrid, w/ augmentation)을 예측한 형상 예측 모델(w/ augmentation)의 하이브리드 학습 알고리즘이 DNA 구조체 형상(GT)과 가장 가까운 에너지 수준을 나타내는 것을 확인할 수 있다. 반면, 레이블된 DNA 구조체 설계도(또는 DNA 구조체 그래프)의 구조적 특징이 매우 다양하고 뚜렷할 뿐만 아니 라 유사한 특징을 지닌 설계도의 수가 한정된 상태에서 데이터 증강 및 하이브리드 학습 알고리즘에 기반하는 형상 예측 모델로서도 DNA 구조체 형상을 정확히 예측하는 것은 쉽지 않을 수 있다. 따라서 학습 처리부는, 여러 형상 예측 모델을 결합하는 앙상블 접근 방식을 적용할 수 있다. 이때, 학습 처리부 클래스에 따라 학습용 DNA 구조체 설계도(또는 학습용 DNA 구조체 그래프)가 구분된 데이터 셋 을 이용하여 클래스 각각에 대하여 별도의 독립적인 형상 예측 모델을 학습할 수 있다. 보다 상세하게 설명하면, 상술한 바와 같이, 데이터 셋에 포함된 학습용 DNA 구조체 설계도가 6개의 세부 클래스들로 구분된 경우, 학습 처리부는, 6개의 세부 클래스들 각각에 대하여 형상 예측 모델을 독립 적으로 학습하고, 데이터 셋 전체를 하나의 클래스(또는 세부 클래스)로서 형상 예측 모델을 학습함 으로써 총 7개의 학습된 형상 예측 모델을 생성할 수 있다. 학습 처리부는, 총 7개의 학습된 형상 예측 모델을 포함하는 앙상블 형상 예측 모델(이하, 앙상블 모델)을 구성할 수 있다. 이때, 앙상블 모델은, 도 9에 도시된 바와 같이, 입력된 초기 구성에 대응하여 7개의 학습된 형상 예측 모델 각 각으로 예측한 DNA 구조체 형상들(평형 구성들)을 획득하고, 가장 에너지가 낮은 구조체 형상을 최종 DNA 구조 체 형상으로 결정하도록 구성될 수 있다. 상술한 바에 따르면, 앙상블 모델은 7개의 형상 예측 모델을 포함하여 구성된 것으로 설명하고 있으나, 이에 한 정하지 않고, 앙상블 모델을 구성하는 형상 예측 모델들의 수는 세부 클래스의 수에 기반하여 변경될 수 있을 것이다. 도 9는 본 발명의 일 실시 예에 따른 장치에서 복수의 클래스에 대하여 각각 학습된 형상 예측 모델들에 기반하 여 생성된 앙상블 모델의 개략적인 구성을 도시한다. 구조체 예측부가 앙상블 모델을 이용하여 입력된 특정 DNA 구조체 설계도에 대한 DNA 구조체 형상을 예측 하는 동작에서, 에너지가 가장 낮은 형상의 DNA 구조체 형상을 최종 결과물로 출력할 수 있다. 도 9를 참고하면, 구조체 예측부는, 특정 DNA 구조체 설계도에 대응하여 앙상블 모델의 처리 결과 획득한 복수의 예비 구조체 형상들 중 에너지가 가장 낮은 CS 형상의 DNA 구조체 형상을 최종 형상으로 결정 및 출력할 수 있다. 여기서, 학습 처리부는, 앙상블 모델의 구성을 위하여 복수의 형상 예측 모델들을 학습함에 있어서, 하이 브리드 학습 알고리즘에 기반하여 형상 예측 모델들 각각의 학습을 수행할 수 있다. 상술한 바와 같이, 학습 처리부는, 앙상블 모델을 이용하여 복수(예: 수십 내지 수백 개)의 DNA 종이접기 단량체로 구성된 다면체와 같은 초분자 구조체 예측을 수행할 수 있다. 이때, 그래프 생성부는, 계층적으로 조립된 거대 어셈블리에 대한 그래프 정보를 생성함에 있어서, 단일 구조체 간 인터페이스에서의 상호 작용을 위한 인터페이스 엣지를 도입하여 생성할 수 있다. 도 10 내지 도 12를 통하여 본 발명의 실시 예에 따른 앙상블 모델을 이용하여 예측한 단일 DNA 구조체를 SNUPI 을 이용하여 예측한 단일 DBA 구조체(GT)와 비교할 수 있다. 도 10은 본 발명의 일 실시 예에 따른 장치에서 앙상블 모델과 SNUPI이 단일 DNA 구조체에 대응하여 예측한 구 조체 형상들을 비교한 도면이다. 도 11는 본 발명의 일 실시 예에 따른 장치에서 앙상블 모델과 SNUPI이 단일 DNA 구조체에 대응하여 예측한 구조체 형상들의 모양 점수를 도시한 그래프이다. 도 12는 본 발명의 일 실시 예 에 따른 장치에서 앙상블 모델과 SNUPI이 단일 DNA 구조체에 대응하여 예측한 구조체 형상들의 에너지 레벨을 도시한 그래프이다. 도 10을 참고하면, 앙상블 모델에 의해 예측된 단일 DNA 구조체 형상(컬러, colored)은 SNUPI에 의해 예측된 형 상(회색, gray)과 잘 일치했으며 블록(block) 구조, 굽힘(curved) 구조, 비틀림(twisted) 구조, 힌지(hinged) 구조, 2차원 와이어프레임 구조, 및 3차원 와이어프레임 구조의 왜곡을 포함한 모든 유형의 변형이 성공적으로 예측되었음을 확인할 수 있다. 도 11를 참고하면, 테스트용 DNA 구조체 설계도에 기반하여 DNA 구조체 형상을 예측하기 위한 앙상블 모델의 추 론 시간은 0.55 내지 1.47초 범위로 측정되었으며, 평균 0.92초로 준 실시간에 가까운 예측이었다. RMSD 및 OS 값은 평균 2.97nm와 0.97이며 표준 편차는 각각 2.59 및 0.04로 확인되었다. 이 결과는 앙상블 모델 을 사용하여 입력된 구조체 정보로부터 전체적인 DNA 구조체 형상과 국소적인 DNA의 구성을 모두 정확하게 추정 할 수 있음을 나타낸다. 또한, 도 12에 도시된 바와 같이, 앙상블 모델에 의해 예측된 에너지 수준은 GT 구조의 에너지 수준에 매우 가 깝게 표시된 것을 확인할 수 있다. GT 구조에 대한 초기 구성의 총 에너지의 비율은 평균 103.5였으며 예측된 평형 구성의 경우 1.4로 크게 감소하였다. 이러한 에너지의 큰 감소는 블록(block) 구조, 굽힘(curved) 구조, 비틀림(twisted) 구조, 힌지(hinged) 구조, 2차원 와이어프레임 구조, 및 3차원 와이어프레임 구조에서 모든 종류의 변형에 대해 관찰되었다. 종합하면, 본 발명의 실시 예에 따른 앙상블 모델은 특히 고도로 변형된 구조의 경우에도 사전 훈련된 모델보다 모양과 에너 지 수준에 대해 더 정확한 예측을 제공할 수 있다. 또한, 앙상블 모델은, GNN 모델의 비지도 학습 기능에 기반하여 앙상블 모델 또는 이를 구성하는 형상 예측 모 델들의 학습을 수행하도록 구성될 수 있다. 예를 들면, 앙상블 모델은, GNN 모델에 기반하여 그래프의 물리적 정보를 평가하도록 구성될 수 있다. 이와 관련하여 도 13 내지 도 15를 통하여 설명하면, 도 13은 본 발명의 일 실시 예에 따른 장치에서 앙상블 모델의 비지도 자체 정제 기능의 구성을 개략적으로 도시한 개념도이다. 도 14 은 본 발명의 일 실시 예에 따른 장치에서 비지도 자체 정제 기능을 포함하는 앙상블 모델이 초분자 어셈블리에 대응하여 예측한 구조체 형상들을 도시한 도면이다. 도 15는 본 발명의 일 실시 예에 따른 장치에서 비지도 자 체 정제 기능을 포함하는 앙상블 모델이 초분자 어셈블리에 대응하여 예측한 구조체 형상들의 에너지 레벨을 나 타내는 그래프이다. 도 13을 참고하면, 삼각대 구조를 가지는 초분자 어셈블리에 대한 초기 구성은 앙상블 모델에 의해 예측된 여러 DNA 구조체 형상들을 사용하여 생성되었으며, 앙상블 모델은, 초기 구성의 다양한 변형들 중 에너지가 최소화된 구성을 찾도록 구성될 수 있다. 일 실시 예에 따르면, 앙상블 모델은 초분자 어셈블리에 대응하는 초분자 구조체 형상을 예측함에 있어서, 초분 자 어셈블리를 구성하는 DNA 구조체 설계도들에 대응하는 DNA 구조체 형상들을 예측하고, 예측한 DNA 구조체 형 상들의 에너지가 최소화된 구성을 초분자 구조체 형상으로 결정하도록 구성될 수 있다.상술한 바와 같이, 앙상블 모델은 DNA 구조체 형상을 예측하는 동작을 통하여 초분자 구조체 형상을 예측하는 동작의 데이터 기반 손실을 배제하고 에너지를 최소화하도록 학습할 수 있다. 즉, 이러한 비지도 자체 정제(self-refinement) 기능은 앙상블 모델에 의해 예측된 구조체 형상들에 기반하여 에너지가 최소화 구성을 찾도록 앙상블 모델의 매개변수를 학습하도록 구성될 수 있다. 도 14은, 자체 정제 기능을 포함하는 앙상블 모델을 통하여 예측한 수십에서 수백 개의 DNA 종이접기 구조(V- brick, connector, triangle 구조) 및 이들을 연결하는 거대 구조를 도시한다. 예측된 다면체(사면체: 131nm, 육면체: 151nm, 십이면체: 217nm)의 반지름은 실험(사면체: 125nm, 육면체: 150nm, 십이면체: 210nm)와 잘 일 치하였다. 단백질 GroEL은 크기 비교를 위해 표시되었다. 도 15를 참고하면, 비지도 자체 정제 기능을 포함하는 앙상블 모델은 초분자 어셈블리의 총 에너지를 줄여 초분 자 구조체의 정확한 모양(또는 형상)을 예측할 수 있음을 확인할 수 있다. 이하, 본 발명의 일 실시 예에 따른 장치에서 앙상블 모델을 이용하여 DNA 구조체 형상을 예측하는 동작 및 앙 상블 모델을 학습하는 동작의 흐름을 설명할 수 있다. 도 16은 본 발명의 일 실시 예에 따른 장치에서 형상 예측 모델을 이용하여 구조체 형상을 예측하는 동작의 흐 름을 도시하는 흐름도이다. 1601 단계에서, 그래프 생성부는, DNA 구조체 설계도에 기반하여 노드 및 엣지로 구성된 DNA 구조체 그래 프를 획득할 수 있다. 여기서, DNA 구조체 설계도는, 설계도 획득부를 통하여 획득한 DNA 구조체 설계도일 수 있다. 또한, 구조 체 설계도는, 초분자 어셈블리에 대한 구조체 설계도일 수 있다. 그래프 생성부는, DNA 구조체 설계도에 포함된 염기쌍 및 염기쌍의 결합 관계에 기반하여 노드 및 엣지를 모델링하며, 노드 및 엣지를 포함하는 DNA 구조체 그래프를 생성할 수 있다. 여기서, 노드는 염기쌍의 위치 및 방향에 대한 정보를 포함하여 구성되며, 엣지는, 염기쌍 사이의 공유 결합을 나타내는 구조 엣지와 DNA의 음전하로 인한 정전기 상호 작용을 나타내는 정전기 엣지를 포함하여 구성될 수 있 다. 1603 단계에서, 구조체 예측부는, 상기 DNA 구조체 그래프 및 기 학습된 DNA 구조체 형상 예측 모델(형상 예측 모델)에 기반하여 상기 DNA 구조체 설계도에 대응하는 DNA 구조체 형상을 출력할 수 있다. 여기서, 상기 DNA 구조체 형상 예측 모델은 둘 이상의 DNA 구조체 형상 예측 모델을 포함하여 앙상블 모델로 구 성될 수 있다. 보다 상세하게 설명하면, 앙상블 모델은 상기 복수의 학습용 DNA 구조체 설계도를 하나의 클래스로 학습한 하나 의 제1 DNA 구조체 형상 예측 모델, 및 상기 제1 DNA 구조체 형상 예측 모델을 둘 이상의 세부 클래스 각각에 대하여 학습한 둘 이상의 제2 DNA 구조체 형상 예측 모델들을 포함할 수 있다. 여기서, 상기 둘 이상의 세부 클 래스 각각은, 상기 복수의 학습용 DNA 구조체 설계도가 상기 둘 이상의 세부 클래스에 따라서 구분 및 포함된 상태일 수 있다. 일 실시 예에 따르면, 세부 클래스는, DNA 구조체의 구조에 기반하여 구분될 수 있다. 예를 들면, 세부 클래스 는 블록(block) 구조, 굽힘(curved) 구조, 비틀림(twisted) 구조, 힌지(hinged) 구조, 2차원 와이어프레임 (wireframe) 구조 및 3차원 와이어프레임 구조 중 적어도 하나의 구조에 대하여 클래스가 구분될 수 있다. 구조체 예측부는, 상기 DNA 구조체 형상 예측 모델에 포함된 둘 이상의 DNA 구조체 형상 예측 모델들 각각 에 대하여 상기 DNA 구조체 그래프의 입력에 대한 둘 이상의 예비 DNA 구조체 형상들을 획득할 수 있다. 구조체 예측부는, 상기 둘 이상의 예비 DNA 구조체 형상들 중 가장 에너지가 작은 예비 DNA 구조체 형상을 상기 DNA 구조체 형상으로 결정할 수 있다. 도 17은 본 발명의 일 실시 예에 따른 장치에서 구조체 형상을 예측하도록 구성된 형상 예측 모델을 학습하는 동작의 흐름을 도시하는 흐름도이다. 1701 단계에서, 상기 설계도 획득부는, 복수의 학습용 DNA 구조체 설계도를 획득하고, 상기 그래프 생성부 는, 획득한 상기 복수의 DNA 구조체 설계도 각각에 대응하는 학습용 DNA 구조체 그래프를 생성할 수 있다.여기서, 설계도 획득부는, 획득한 상기 복수의 학습용 DNA 구조체 설계도 적어도 일부에 대하여, 적어도 하나의 염기쌍 삽입, 또는 적어도 하나의 염기쌍 삭제에 기반하는 데이터 증강을 수행하여 학습용 증강 설계도 를 획득할 수 있다. 이후, 그래프 생성부는, 상기 학습용 증강 구조체 설계도 각각에 대응하는 학습용 증강 구조체 그래프를 생성할 수 있다. 1703 단계에서, 정답용 형상 획득부는, 구조체 시뮬레이션 프로그램(예: SNUIPI)에 기반하여 상기 복수의 학습용 DNA 구조체 설계도에 대응하는 정답용 DNA 구조체 형상을 획득할 수 있다. 이때, 구조체 시뮬레이션 프로그램이 장치의 외부(예: 서버)에 구성된 경우, 정답용 형상 획득부는 서버로부터 상기 복수의 학습용 DNA 구조체 설계도에 대응하는 정답용 DNA 구조체 형상을 수신할 수 있다. 1705 단계에서, 학습 처리부는, 상기 복수의 학습용 DNA 구조체 그래프, 및 상기 정답용 DNA 구조체에 기 반하여 기 저장된 DNA 구조체 형상 예측 모델을 학습할 수 있다. 여기서, 상술한 바와 같이, 학습용 증강 구조체 그래프를 생성한 경우, 학습 처리부는, 상기 복수의 학습 용 DNA 구조체 그래프, 상기 학습용 증강 구조체 그래프, 및 상기 정답용 DNA 구조체에 기반하여 상기 기 저장 된 DNA 구조체 형상 예측 모델을 학습할 수 있다. 학습 처리부는, 상기 학습용 DNA 구조체 그래프에 대한 학습 및 상기 학습용 증강 구조체 그래프에 대한 학습에 서로 다른 손실 함수를 적용하여 상기 기 저장된 DNA 구조체 형상 예측 모델을 학습할 수 있다. 예를 들면, 학습 처리부는, 데이터 기반 손실 함수 및 물리적 정보 기반 손실 함수 중 적어도 일부에 기반 하는 손실 함수를 학습용 DNA 구조체 그래프에 대한 학습 또는 학습용 증강 구조체 그래프에 대한 학습에 적용 함으로써 DNA 구조체 형상 예측 모델을 학습할 수 있다. 보다 상세하게 설명하면, 학습 처리부는, 데이터 기반 손실 및 물리적 정보 기반 손실에 기반하는 제1 손 실 함수를 적용하여 상기 학습용 DNA 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습 을 수행할 수 있다. 또한, 학습 처리부는, 제1 손실 함수 및 물리적 정보 기반 손실에 기반하는 제2 손실 함수 중 적어도 일부 를 적용하여 상기 학습용 증강 구조체 그래프에 대한 상기 기 저장된 DNA 구조체 형상 예측 모델의 학습을 수행 할 수 있다. 상술한 바와 같이, 본 발명의 다양한 실시 예에 따르면, 데이터 기반 손실 및 물리적 정보 기반 손실에 따른 손 실 함수에 기반하는 하이브리드 학습 알고리즘에 의하여 학습된 DNA 구조체 형상 예측 모델 및 이를 포함하는 장치를 제공함으로써 DNA 종이접기 구조체의 형상을 빠르고 정확하게 예측할 수 있는 효과가 있다. 본 발명의 다양한 실시 예에 따르면, DNA 구조체에 따라서 구분 및 학습된 복수의 형상 예측 모델을 포함하는 앙상블 모델 및 이를 포함하는 장치를 제공함으로써 거의 실시간으로 높은 정밀도의 단량체 DNA 종이접기 구조 체의 형상을 예측할 수 있는 효과가 있다. 본 발명의 다양한 실시 예에 따르면, 데이터 기반 학습 방법 및 물리적 정보 기반 학습 방법을 병합한 하이브리 드 학습 알고리즘에 기반하는 앙상블 모델 및 이를 포함하는 장치를 제공함으로써 복잡한 형상의 DNA 구조체를 거의 실시간으로 빠르고 정확하게 예측이 가능하며, 이는 데이터가 부족한 다양한 스케일의 바이오, 나노, 매크 로 구조체의 형상을 정확하게 예측할 수 있는 효과가 있다. 본 발명에서 다양한 실시 예들을 통하여 장치가 수행하는 어떤 기능을 설명하고 있으나 해당 기능을 수행 하는 구성 요소가 장치의 구성 요소로서 기재되지 않은 경우, 장치는 그 기능을 수행하는 통상적으로 알려진 구성 요소를 포함하거나 및/또는 연결된 것으로 이해되어야 할 것이다."}
{"patent_id": "10-2023-0064976", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시 예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라 면 다양한 실시 예들을 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대 치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 특히, 흐름도를 참고하여 설명하는 경우, 복수의 단계를 구성하고 단계들을 지정된 순서에 따라서 순차적으로 실행하는 것으로 기재하고 있지만, 반드시 기재된 순서로 한정되는 것은 아니다. 다시 말해, 흐름도에 기재된 단계들 중 적어도 일부를 변경 또는 삭제하여 실행하거나 적어도 하나의 단계를 추 가하는 것도 실시 예로서 적용 가능하며, 하나 이상의 단계를 병렬적으로 실행하는 것으로도 실시 예로서 적용 가능할 것이다. 즉, 단계들이 반드시 시계열 적인 순서로 동작하는 것으로 한정되지 않으며, 본 발명의 실시 예 에 포함된다 해야 할 것이다. 그러므로, 다른 구현들, 다른 실시 예들 및 특허청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다 해야 할 것이다."}
{"patent_id": "10-2023-0064976", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 장치의 구성을 개략적으로 도시한 개념도이다. 도 2는 본 발명의 일 실시 예에 따른 장치에서 형상 예측 모델이 저장된 저장부 및 형상 예측 모델에 기반하여 기능을 수행하는 처리부 및 저장부의 구성을 기능에 따라 구분하여 도시한 블록도이다. 도 3은 본 발명의 일 실시 예에 따른 장치에서 DNA 구조체 설계도에 기반하여 DNA 구조체 그래프를 생성하는 동작을 개략적으로 도시한 개념도이다. 도 4는 본 발명의 일 실시 예에 따른 장치에서 형상 예측 모델의 개략적인 구성 및 동작을 나타내는 개념도이다. 도 5는 본 발명의 일 실시 예에 따른 장치에서 하이브리드 학습 알고리즘에 기반하여 형상 예측 모델의 학습을 수행하는 동작을 개략적으로 개시한 개념도이다. 도 6은 본 발명의 일 실시 예에 따른 장치에서 하이브리드 학습 알고리즘에 따라 학습된 형상 예측 모델과 다른 방식으로 학습된 형상 예측 모델이 예측한 DNA 구조체 형상을 도시한 도면이다. 도 7은 본 발명의 일 실시 예에 따른 장치에서 하이브리드 학습 알고리즘에 따라 학습된 형상 예측 모델과 다른 방식으로 학습된 형상 예측 모델이 예측한 DNA 구조체 형상들의 모양 점수를 도시한 그래프이다. 도 8은 본 발명의 일 실시 예에 따른 장치에서 하이브리드 학습 알고리즘에 따라 학습된 형상 예측 모델과 다른 방식으로 학습된 형상 예측 모델이 예측한 DNA 구조체 형상들의 에너지 레벨을 도시한 그래프이다. 도 9는 본 발명의 일 실시 예에 따른 장치에서 복수의 클래스에 대하여 각각 학습된 형상 예측 모델들에 기반하 여 생성된 앙상블 모델의 개략적인 구성을 도시한다. 도 10은 본 발명의 일 실시 예에 따른 장치에서 앙상블 모델과 SNUPI이 초분자 어셈블리에 대응하여 예측한 구 조체 형상들을 비교한 도면이다. 도 11는 본 발명의 일 실시 예에 따른 장치에서 앙상블 모델과 SNUPI이 초분자 어셈블리에 대응하여 예측한 구 조체 형상들의 모양 점수를 도시한 그래프이다. 도 12는 본 발명의 일 실시 예에 따른 장치에서 앙상블 모델과 SNUPI이 초분자 어셈블리에 대응하여 예측한 구 조체 형상들의 에너지 레벨을 도시한 그래프이다. 도 13은 본 발명의 일 실시 예에 따른 장치에서 앙상블 모델의 비지도 자체 정제 기능의 구성을 개략적으로 도 시한 개념도이다. 도 14은 본 발명의 일 실시 예에 따른 장치에서 비지도 자체 정제 기능을 포함하는 앙상블 모델이 초분자 어셈 블리에 대응하여 예측한 구조체 형상들을 도시한 도면이다. 도 15는 본 발명의 일 실시 예에 따른 장치에서 비지도 자체 정제 기능을 포함하는 앙상블 모델이 초분자 어셈 블리에 대응하여 예측한 구조체 형상들의 에너지 레벨을 나타내는 그래프이다. 도 16은 본 발명의 일 실시 예에 따른 장치에서 형상 예측 모델을 이용하여 구조체 형상을 예측하는 동작의 흐 름을 도시하는 흐름도이다. 도 17은 본 발명의 일 실시 예에 따른 장치에서 구조체 형상을 예측하도록 구성된 형상 예측 모델을 학습하는 동작의 흐름을 도시하는 흐름도이다."}
