{"patent_id": "10-2024-7027421", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0134205", "출원번호": "10-2024-7027421", "발명의 명칭": "측정 방법 및 장치", "출원인": "베이징 시아오미 모바일 소프트웨어 컴퍼니 리미", "발명자": "후, 즈취엔"}}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "단말 기기에 의해 수행되는 측정 방법에 있어서, 무선 링크 모니터링(RLM) 측정 또는 무선 자원 관리(RRM) 측정 중 적어도 하나를 포함하는 타겟 측정의 측정값을 획득하는 단계; 상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라, 상기 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하는 단계 - 상기 타겟 이벤트는 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함함 - ; 를 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 타겟 측정의 측정값을 획득하는 단계는, 상기 단말 기기의 서비스 셀의 다운링크 참조 신호를 측정하여, 상기 측정값을 획득하는 단계를 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 기준 정보는, 타겟 시간대 및 제1 차이 역치를 포함하고, 상기 측정값은 상기 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 참조 신호 수신 전력(RSRP), 또는, 상기 타겟시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함하고; 상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라, 상기 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하는 단계는, 적어도 하나의 상기 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하는 단계 - 상기 제1 RSRP에 대응되는참조값은, 상기 단말 기기가 상기 제1 RSRP를 측정하기 전에 측정하여 획득된 것임 - ; 적어도 하나의 상기 제1 RSRP에 대응되는 제1 차이가 모두 상기 제1 차이 역치보다 작은 것에 응답하여, 상기타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하는 단계; 를 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 측정값은 상기 타겟 시간대 후의 설정 시간 내에 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 상기 설정 시간 내에 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 더 포함하고; 적어도 하나의 상기 제1 RSRP에 대응되는 제1 차이가 모두 상기 제1 차이 역치보다 작은 것에 응답하여, 상기타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하는 단계는, 복수의 상기 제1 RSRP에 대응되는 제1 차이가 모두 상기 제1 차이 역치보다 작은 것에 응답하여, 복수의 상기제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정하는 단계; 복수의 상기 제2 RSRP에 대응되는 제2 차이가 모두 상기 제1 차이 역치보다 작은 것에 응답하여, 상기 타겟 이공개특허 10-2024-0134205-3-벤트가 릴랙스 진입 이벤트인 것을 결정하는 단계; 를 포함하는, 것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 기준 정보는, 타겟 시간대 및 제2 차이 역치를 포함하고, 상기 측정값은 상기 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 참조 신호 수신 전력(RSRP), 또는, 상기 타겟시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP; 를 포함하고,상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라, 상기 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하는 단계는, 적어도 하나의 상기 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하는 단계 - 상기 제1 RSRP에 대응되는참조값은, 상기 단말 기기가 상기 제1 RSRP를 측정하기 전에 측정하여 획득된 것임 - ; 상기 제2 차이 역치보다 크거나 같은 적어도 하나의 상기 제1 RSRP에 대응되는 제1 차이가 존재하는 것에 응답하여, 상기 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하는 단계; 를 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 측정값은 상기 타겟 시간대 후의 설정 시간 내에 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 상기 설정 시간 내에 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 더 포함하고; 상기 제2 차이 역치보다 크거나 같은 적어도 하나의 상기 제1 RSRP에 대응되는 제1 차이가 존재하는 것에 응답하여, 상기 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하는 단계는, 상기 제2 차이 역치보다 크거나 같은 적어도 하나의 상기 제1 RSRP에 대응되는 제1 차이가 존재하는 것에 응답하여, 복수의 상기 제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정하는 단계; 상기 제2 차이 역치보다 크거나 같은 적어도 하나의 상기 제2 RSRP에 대응되는 제2 차이가 존재하는 것에 응답하여, 상기 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하는 단계; 를 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서,상기 참조값은 하기의 방식을 통해 업데이트되고, 상기 단말 기기가 셀 전환을 수행하는 것에 응답하여, 상기 제1 RSRP에 따라 대응되는 참조값을 업데이트하고; 또는, 상기 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰 것에 응답하여, 상기 제1 RSRP에 따라 대응되는 참조값을 업데이트하고; 또는, 상기 타겟 시간대 내에서, 상기 제1 RSRP의 제1 차이가 제1 차이 역치보다 크거나 같은 것에 응답하여, 상기 제1 RSRP에 따라 대응되는 참조값을 업데이트하고, 또는, 상기 타겟 시간대 내에서, 상기 제1 RSRP의 제1 차이가제2 차이 역치보다 작은 것에 응답하여, 상기 제1 RSRP에 따라 대응되는 참조값을 업데이트하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2024-0134205-4-제4항에 있어서,상기 참조값은 하기의 방식을 통해 업데이트되고, 상기 단말 기기가 셀 전환을 수행하는 것에 응답하여, 상기 제2 RSRP에 따라 대응되는 참조값을 업데이트하고; 또는, 상기 제2 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰 것에 응답하여, 상기 제2 RSRP에 따라 대응되는 참조값을 업데이트하고; 또는, 상기 설정 시간 내에서, 상기 제2 RSRP의 제2 차이가 제1 차이 역치보다 크거나 같은 것에 응답하여, 상기 제2RSRP에 따라 대응되는 참조값을 업데이트하고, 또는, 상기 설정 시간 내에서, 상기 제2 RSRP의 제2 차이가 상기제2 차이 역치보다 작은 것에 응답하여, 상기 제2 RSRP에 따라 대응되는 참조값을 업데이트하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 측정값은 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제1 신호 대 간섭 플러스 잡음비(SINR)를포함하고, 상기 기준 정보는, 역치 지시 정보를 포함하고; 상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라, 상기 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하는 단계는, 상기 역치 지시 정보에 따라, 제1 품질 역치를 결정하고, 복수의 상기 제1 SINR이 모두 상기 제1 품질 역치보다큰 것에 응답하여, 상기 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하고; 또는, 상기 제1 품질 역치보다 큰적어도 하나의 상기 제1 SINR이 존재하는 것에 응답하여, 상기 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하는 단계; 또는, 상기 역치 지시 정보에 따라, 제2 품질 역치를 결정하고, 상기 제2 품질 역치보다 작거나 같은 적어도 하나의상기 제1 SINR이 존재하는 것에 응답하여, 상기 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하고; 또는, 복수의 상기 제1 SINR이 모두 상기 제2 품질 역치보다 작거나 같은 것에 응답하여, 상기 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하는 단계; 를 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 측정값은 설정 시간 내에 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 SINR을 포함하고, 상기 기준 정보는, 역치 지시 정보를 포함하고; 상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라, 상기 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하는 단계는, 상기 역치 지시 정보에 따라, 제1 품질 역치를 결정하고, 각 다운링크 참조 신호에 대응되는 복수의 상기 제2SINR이 모두 상기 제1 품질 역치보다 큰 것에 응답하여, 상기 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하고; 또는, 모두 상기 제1 품질 역치보다 큰 적어도 하나의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이존재하는 것에 응답하여, 상기 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하는 단계; 상기 역치 지시 정보에 따라, 제2 품질 역치를 결정하고, 모두 제2 품질 역치보다 작거나 같은 적어도 하나의다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재하는 것에 응답하여, 상기 타겟 이벤트가 릴랙스 퇴출이벤트인 것을 결정하고; 또는, 각 다운링크 참조 신호에 대응되는 복수의 상기 제2 SINR가 모두 상기 제2 품질역치보다 작거나 같은 것에 응답하여, 상기 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하는 단계; 를 포함하는,공개특허 10-2024-0134205-5-것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 타겟 이벤트가 릴랙스 퇴출 이벤트인 것에 응답하여, 제1 타이머의 제1 값을 판독하는 단계 - 상기 제1 타이머는 상기 단말 기기가 가장 최근에 릴랙스 퇴출 이벤트의 트리거링을 판단하는 시각을 기반으로 계시하는데사용됨 - ; 제1 값이 제1 계수 역치보다 크고, 제2 타이머가 작동하지 않은 것에 응답하여, 네트워크 기기에 릴랙스 퇴출이벤트 또는 상기 측정값 중 적어도 하나를 송신하는 단계 - 상기 제2 타이머는 상기 단말 기기가 가장 최근에릴랙스 퇴출 이벤트를 송신한 시각을 기반으로 계시하는데 사용됨 - ; 를 더 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 제3 타이머의 제2 값을 판독하는 단계 - 상기 제3 타이머는 상기 단말 기기가 가장 최근에 릴랙스 진입 이벤트의 트리거링을 판단하는 시각을 기반으로 계시하는데사용됨 - ; 제2 값이 제2 계수 역치보다 크고, 제4 타이머가 작동되지 않은 것에 응답하여, 네트워크 기기에 릴랙스 진입이벤트 또는 상기 측정값 중 적어도 하나를 송신하는 단계 - 상기 제4 타이머는 상기 단말 기기가 가장 최근에릴랙스 진입 이벤트를 송신한 시각을 기반으로 계시하는데 사용됨 - ; 를 더 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 타겟 이벤트가 릴랙스 퇴출 이벤트이고 제2 타이머가 작동되지 않은 것에 응답하여, 네트워크 기기에 릴랙스 퇴출 이벤트 또는 상기 측정값 중 적어도 하나를 송신하는 단계 - 상기 제2 타이머는 상기 단말 기기가 가장최근에 릴랙스 퇴출 이벤트를 송신한 시각을 기반으로 계시하는데 사용됨 - ;또는, 상기 타겟 이벤트가 릴랙스 진입 이벤트이고 제4 타이머가 작동되지 않은 것에 응답하여, 네트워크 기기에 릴랙스 진입 이벤트 또는 상기 측정값 중 적어도 하나를 송신하는 단계 - 상기 제4 타이머는 상기 단말 기기가 가장최근에 릴랙스 진입 이벤트를 송신한 시각을 기반으로 계시하는데 사용됨 - ;를 더 포함하는, 것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 타겟 이벤트가 릴랙스 퇴출 이벤트인 것에 응답하여, 네트워크 기기에 릴랙스 퇴출 이벤트 또는 상기 측정값 중 적어도 하나를 송신하는 단계; 상기 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 상기 네트워크 기기에 릴랙스 진입 이벤트 또는 상기측정값 중 적어도 하나를 송신하는 단계; 상기 타겟 이벤트의 보고 유형이 단말 기기인 것에 응답하여, 네트워크 기기에 상기 단말 기기에 대응되는 마스터 서비스 셀의 상기 측정값 또는 상기 타겟 이벤트 중 적어도 하나를 송신하는 단계; 상기 타겟 이벤트의 보고 유형이 셀 그룹인 것에 응답하여, 상기 네트워크 기기에 상기 단말 기기에 대응되는셀 그룹의 마스터 서비스 셀의 상기 측정값 또는 상기 타겟 이벤트 중 적어도 하나를 송신하고, 또는, 네트워크기기에 상기 단말 기기에 대응되는 셀 그룹의 프라이머리 세컨더리 서비스 셀의 상기 측정값 또는 상기 타겟 이벤트 중 적어도 하나를 송신하는 단계; 를 더 포함하는,공개특허 10-2024-0134205-6-것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 상기 단말 기기가 릴랙스 상태에서 타겟 측정을 주기적으로 수행하는 제1 측정 간격을 결정하는 단계; 네트워크 기기에 상기 제1 측정 간격에 대응되는 간격 지시 정보를 송신하는 단계 - 상기 간격 지시 정보는 상기 제1 측정 간격과 상기 네트워크 기기에 의해 설정된 제2 측정 간격 사이의 비례계수를 포함함 - ; 를 더 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,네트워크 기기에서 송신된 릴랙스 명령을 수신하는 단계; 상기 릴랙스 명령에 응답하여, 상기 단말 기기가 릴랙스 상태에 들어가도록 제어하는 단계; 를 더 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 릴랙스 명령은 타겟 비례계수를 포함하고, 상기 측정 방법은, 상기 타겟 비례계수 및 상기 네트워크 기기에 의해 설정된 제2 측정 간격에 따라, 타겟 측정 간격을 결정하는단계; 릴랙스 상태에서, 상기 타겟 측정 간격에 따라, 타겟 측정을 주기적으로 수행하는 단계; 를 더 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "네트워크 기기에 의해 수행되는 측정 방법에 있어서,단말 기기에서 송신된 타겟 이벤트 또는 측정값 중 적어도 하나를 수신하는 단계를 포함하고, 상기 측정값은 타겟 측정의 측정값이고, 상기 타겟 측정은 무선 링크 모니터링(RLM) 측정 또는 무선 자원 관리(RRM) 측정 중 적어도 하나를 포함하고; 상기 타겟 이벤트는 상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라 결정된 것이고, 상기 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함하는,것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 상기 단말 기기에 릴랙스 명령을 송신하는 단계를 더포함하고, 상기 릴랙스 명령은 상기 단말 기기가 릴랙스 상태로 들어가도록 제어하는데 사용되는, 것을 특징으로 하는 측정 방법."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "단말 기기에 적용되는 측정 장치에 있어서, 무선 링크 모니터링(RLM) 측정 또는 무선 자원 관리(RRM) 측정 중 적어도 하나를 포함하는 타겟 측정의 측정값을 획득하고; 상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라, 상기 단말 기기에 의해 트리거링된타겟 이벤트를 결정하는 처리 유닛을 포함하고, 상기 타겟 이벤트는 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤공개특허 10-2024-0134205-7-트를 포함하는,것을 특징으로 하는 측정 장치."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "네트워크 기기에 적용되는 측정 장치에 있어서,단말 기기에서 송신된 타겟 이벤트 또는 측정값 중 적어도 하나를 수신하는 송수신 유닛을 포함하고, 상기 측정값은 타겟 측정의 측정값이고, 상기 타겟 측정은 무선 링크 모니터링(RLM) 측정 또는 무선 자원 관리(RRM) 측정중 적어도 하나를 포함하고; 상기 타겟 이벤트는 상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라결정된 것이고, 상기 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함하는,것을 특징으로 하는 측정 장치."}
{"patent_id": "10-2024-7027421", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체에 있어서,상기 명령이 수행될 경우, 제1항 내지 제17항 중 어느 한 항의 방법, 또는, 제18항 또는 제19항의 방법을 수행하는,것을 특징으로 하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2024-7027421", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 이동 통신 기술에 적용 가능한 측정 방법 및 장치를 제공하고, 상기 방법은, 단말 기기RLM 측정 및/또 는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하는 단계; 측정값 및 타겟 측정에 대응되는 기준 정보에 따 라, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하는 단계 - 여기서, 타겟 이벤트는 릴랙스 진입 이벤트 또 는 릴랙스 퇴출 이벤트를 포함함 - ; 를 포함한다. 이리하여, 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기가 릴랙스 진입 이벤트를 트리거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있 음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고 하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항속력을 향상시킬 수 있다."}
{"patent_id": "10-2024-7027421", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 통신 기술 분야에 관한 것으로, 특히 측정 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2024-7027421", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "R17에 릴랙스 메커니즘을 도입한다. 즉, 릴랙스 준칙을 만족하는 단말 기기에 대해, 릴랙스 메커니즘을 수행할 수 있다. 예를 들면, 단말이 주기적으로 다운링크 참조 신호를 측정하는 측정 간격을 늘려, 단말 기기의 전력 소모를 저하시키고, 단말 기기의 항속력을 향상시킬 수 있다. 따라서, 단말 기기에 의해 트리거링된 이벤트를 측정하여, 단말 기기가 릴랙스 메커니즘을 수행할 수 있는지 여부를 결정하도록 구현하는 것은 매우 중요한 것 이다. 본 발명 제1 측면의 실시예는 단말 기기에 의해 수행되는 측정 방법을 제공하고, 상기 방법은, 무선 링크 모니 터링(RLM) 측정 및/또는 무선 자원 관리(RRM) 측정을 포함하는 타겟 측정의 측정값을 획득하는 단계; 상기 측정 값 및 상기 타겟 측정에 대응되는 기준 정보에 따라, 상기 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하 는 단계 - 상기 타겟 이벤트는 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함함 - ; 를 포함한다. 당해 기술 수단에서, 단말 기기를 통해 타겟 측정의 측정값을 획득하고, 여기서, 타겟 측정은 RLM 측정 및/또는 RRM 측정을 포함하고; 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하고, 여기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하 여, 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기가 릴랙스 진입 이벤트를 트리거 링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항속력 을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙 스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확 성 및 신뢰성을 향상시킬 수 있다. 본 발명 제2 측면의 실시예는 네트워크 기기에 의해 수행되는 다른 측정 방법을 제공하고, 상기 방법은, 단말 기기에서 송신된 타겟 이벤트 및/또는 측정값을 수신하는 단계를 포함하고, 상기 측정값은 타겟 측정의 측정값 이며, 상기 타겟 측정은 무선 링크 모니터링(RLM) 측정 및/또는 무선 자원 관리(RRM) 측정을 포함하고; 상기 타겟 이벤트는 상기 측정값 및 상기 타겟 측정에 대응되는 기준 정보에 따라 결정된 것이고, 상기 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 본 발명 제3 측면의 실시예는 측정 장치를 제공하고, 당해 측정 장치는 상기 제1 측면 방법의 단말 기기를 구현 하는 일부 또는 모든 기능을 구비한다. 예를 들면 측정 장치의 기능은 본 발명의 일부 또는 모든 실시예의 기능 을 구비하고, 본 발명의 임의의 실시예를 단독으로 수행하는 기능을 구비할 수 있다. 상기 기능은 하드웨어를 통해 구현되고, 하드웨어에 의해 해당 소프트웨어를 수행함으로 구현될 수도 있다. 상기 하드웨어 또는 소프트 웨어는 하나 또는 복수의 상기 기능에 대응되는 유닛 또는 모듈을 포함한다. 본 발명 제4 측면의 실시예는 다른 측정 장치를 제공하고, 당해 측정 장치는 상기 제2 측면 방법의 네트워크 기 기를 구현하는 일부 또는 모든 기능을 구비한다. 예를 들면 측정 장치의 기능은 본 발명의 일부 또는 모든 실시 예의 기능을 구비하고, 본 발명의 임의의 실시예를 단독으로 수행하는 기능을 구비할 수 있다. 상기 기능은 하 드웨어를 통해 구현되고, 하드웨어에 의해 해당 소프트웨어를 수행함으로 구현될 수도 있다. 상기 하드웨어 또 는 소프트웨어는 하나 또는 복수의 상기 기능에 대응되는 유닛 또는 모듈을 포함한다. 본 발명 제5 측면의 실시예에 따르면, 다른 측정 장치를 제공하고, 당해 장치는 프로세서를 포함하고, 당해 프 로세서가 메모리의 컴퓨터 프로그램을 호출할 경우, 상기 제1 측면의 방법, 또는, 상기 제2 측면의 방법을 수행 한다. 본 발명 제6 측면의 실시예에 따르면, 다른 측정 장치를 제공하고, 당해 장치는 프로세서 및 컴퓨터 프로그램이 저장되어 있는 메모리를 포함하고, 상기 컴퓨터 프로그램이 상기 프로세서에 의해 수행될 경우, 상기 제1 측면 의 방법, 또는, 상기 제2 측면의 방법을 수행한다. 본 발명 제7 측면의 실시예에 따르면, 다른 측정 장치를 제공하고, 당해 장치는 프로세서 및 인터페이스 회로를 포함하고, 당해 인터페이스 회로는 코드 명령을 수신하고 당해 프로세서에 전송하는데 사용되고, 당해 프로세서 는 상기 코드 명령을 수행하여 당해 장치가 상기 제1 측면의 방법, 또는, 상기 제2 측면의 방법을 수행하도록 하는데 사용된다. 본 발명 제8 측면의 실시예에 따르면, 통신 시스템을 제공하고, 당해 시스템은 제3 측면의 측정 장치를 포함하 고, 또는, 당해 시스템은 제4 측면의 측정 장치를 포함하고, 또는, 당해 시스템은 제5 측면의 측정 장치를 포함 하고, 또는, 당해 시스템은 제6 측면의 측정 장치를 포함하고, 또는, 당해 시스템은 제7 측면의 측정 장치를 포 함한다. 본 발명 제9 측면의 실시예에 따르면, 본 발명의 실시예는 상기 단말 기기에 사용되는 명령을 저장하는 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 명령이 수행될 경우, 상기 단말 기기는 상기 제1 측면의 방법을 수행하 고, 또는, 상기 네트워크 기기에 사용되는 명령을 저장하는 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 명령 이 수행될 경우, 상기 네트워크 기기는 상기 제2 측면의 방법을 수행한다. 본 발명 제10 측면의 실시예에 따르면, 컴퓨터 프로그램을 포함하는 컴퓨터 프로그램 제품을 제공하고, 컴퓨터 에서 수행될 경우, 컴퓨터는 상기 제1 측면의 방법, 또는, 상기 제2 측면의 방법을 수행한다. 본 발명 제11 측면의 실시예에 따르면, 칩 시스템을 제공하고, 당해 칩 시스템은 적어도 하나의 프로세서 및 인 터페이스를 포함하고, 단말 기기가 제1 측면에 언급된 기능을 구현하도록 서포트하는데 사용되고, 또는, 네트워 크 기기가 제2 측면에 언급된 기능을 구현하도록 서포트하는데 사용된다. 예를 들면, 상기 방법에 언급된 데이 터 및 정보 중의 적어도 하나를 결정 또는 처리한다. 일 가능한 설계에서, 상기 칩 시스템은 단말 기기, 네트워 크 기기에 필요한 컴퓨터 프로그램 및 데이터를 저장하는 메모리를 더 포함한다. 당해 칩 시스템은, 칩에 의해 구성될 수 있고, 칩 및 기타 분립 컴포넌트를 포함할 수도 있다. 본 발명 제12 측면의 실시예에 따르면, 컴퓨터 프로그램을 제공하고, 컴퓨터에서 수행될 경우, 컴퓨터는 상기 제1 측면의 방법, 또는, 상기 제2 측면의 방법을 수행한다."}
{"patent_id": "10-2024-7027421", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예에서 제공하는 측정 방법을 더 잘 이해하기 위해, 아래는 우선 본 발명의 실시예에 적합한 통 신 시스템을 설명한다. 본 발명의 목적, 기술 수단 및 우점을 더 명확하기 위해, 아래는 도면을 결정하여 본 발명의 실시 방식을 더 상 세히 설명한다. 아래에서 예시적인 일 실시예에 대해 상세히 설명한다. 당해 예시는 도면에서 나타나고, 하기의 설명이 도면에 관한 것일 경우, 다른 표시가 없으면, 상이한 도면에서 동일한 수자는 동일한 또는 비슷한 요소를 표시한다. 하 기의 예시적인 일 실시예에 설명한 실시 형태는 본 발명과 일치한 모든 실시 형태를 대표하는 것은 아니다. 반 면, 그들은 첨부된 청구범위에서 상세히 설명한 본 발명의 일부 측면과 일치한 장치 및 방법의 예일 뿐이다. 도 1을 참조하면, 도 1은 본 발명의 실시예에서 제공하는 통신 시스템의 아키텍처 개략도이다. 당해 통신 시스 템은 1개의 네트워크 기기 및 1개의 단말 기기를 포함하나 이에 한정되지 않고, 도 1에 도시된 기기 수량 및 형 태는 예시에만 사용되고 본 발명의 실시예에 대한 한정을 구성하지 않고, 실제 응용에서 적어도 2개의 네트워크 기기, 적어도 2개의 단말 기기를 포함할 수 있다. 도 1에 도시된 통신 시스템은 1개의 네트워크 기기 및 1 개의 단말 기기를 포함하는 것을 예로 든다. 설명해야 할 것은, 본 발명 실시예의 기술 수단은 각 종 통신 시스템에 적용될 수 있다. 예를 들면, 롱 텀 에볼 루션(long term evolution, LTE) 시스템, 5세대(5th generation, 5G) 모바일 통신 시스템, 5G 엔알(new radio, NR) 시스템, 또는 기타 미래의 신형 모바일 통신 시스템 등에 적용될 수 있다. 본 발명 실시예의 네트워크 기기는 네트워크측에서 신호를 송신 또는 수신하는 엔티티이다. 예를 들면, 네 트워크 기기는 이노드비(evolved NodeB, eNB), 수신 포인트(transmission reception point 또는 transmit receive point, TRP), NR 시스템의 지노드비(next generation NodeB, gNB), 기타 미래 모바일 통신 시스템의 기지국 또는 무선 충실도(wireless fidelity, WiFi) 시스템의 액세스 노드 등일 수 있다. 본 발명의 실시예는네트워크 기기에서 사용하는 구체적인 기술 및 구체적인 형태에 대해 한정하지 않는다. 본 발명의 실시예에서 제공하는 네트워크 기기는 집중 유닛(central unit, CU)과 분산식 유닛(distributed unit, DU)으로 구성된 것 일 수 있고, 여기서, CU는 제어 유닛(control unit)이라고 불릴 수도 있고, CU-DU를 사용한 구조는 네트워크 기 기, 예를 들면 기지국의 프로토콜층을 분할하고, 일부분 프로토콜층의 기능을 CU에 넣고 집중 제어하고, 기타 일부분 또는 전부 프로토콜층의 기능은 DU에 분산되어, CU에 의해 집중 제어 DU된다. 본 발명 실시예의 단말 기기는 휴대폰과 같이 사용자측의 신호를 수신 또는 송신하는 엔티티이다. 단말 기 기는 단말 기기(terminal), 사용자 기기(user equipment, UE), 이동국(mobile station, MS), 모바일 단말 기기 (mobile terminal, MT)등으로 불릴 수 있다. 단말 기기는 통신 기능을 구비한 자동차, 스마트 자동차, 휴대폰 (mobile phone), 웨어러블 기기, 태블릿 PC(Pad), 무선 송수신 기능을 구비한 컴퓨터, 가상 현실(virtual reality, VR) 단말 기기, 증강 현실(augmented reality, AR) 단말 기기, 산업 제어(industrial control)의 무 선 단말 기기, 자율 주행(self-driving)의 무선 단말 기기, 원격 수술(remote medical surgery)의 무선 단말 기기, 스마트 그리드(smart grid)의 무선 단말 기기, 운송 안전(transportation safety)의 무선 단말 기기, 스 마트 시티(smart city)의 무선 단말 기기, 스마트 홈(smart home)의 무선 단말 기기 등일 수 있다. 본 발명의 실시예는 단말 기기에서 사용하는 구체적인 기술 및 구체적인 기기 형태를 한정하지 않는다. 상기 통신 시스템에서, 릴랙스 준칙을 만족하는 단말 기기, 예를 들면 정지 상태(또는 저이동 상태) 및/또는 채 널 상태가 비교적 좋은 단말 기기에 대해, 당해 단말 기기는 RLM(radio link monitor, 무선 링크 모니터링), BFD(beam failure detection, 빔 실패 탐지), RRM(radio resource management, 무선 자원 관리)릴랙스 메커니 즘을 수행할 수 있다. 예를 들면, 릴랙스 준칙을 만족하는 단말 기기가 주기적으로 다운링크 참조 신호를 측정 하는 측정 간격을 늘려, 단말 기기의 전력 소모를 저하시키고, 단말 기기의 항속력을 향상시킬 수 있다. 따라서, 단말 기기에 의해 트리거링된 이벤트를 측정하여, 단말 기기가 릴랙스 메커니즘을 수행할 수 있는지 여 부를 결정하도록 구현하는 것은 매우 중요한 것이다. 여기서, 1, RLM 릴랙스 메커니즘: RLM 원리는, RRC(radio resource control, 무선 자원 제어) 연결 RRC_CONNECTED 상태의 단말 기기는, 서비스 셀(예를 들면, 활성화 BWP(bandwidth part, 부분 대역폭) 내부 inside active BWP에서 SpCell(special Cell, 특정 셀)을 측정)의 다운링크 RLM-RS(reference signal, 참조 신호)(예를 들면 SSB(synchronization signal and PBCH(physical broadcast channel, 물리 브로드캐스트 채널) block, 동기 신호 및 PBCH 블록)-RS 및/또는 CSI(channel-state information, 채널 상태 정보)-RS)를 측정함으로, 다운링크 무선 링크 품질을 모니터링하고, 단말 기기와 서비스 셀이 다운링크 동기 상태(IS)에 있는지 동기 탈조 상태(OOS)의 프로세스에 있는지를 판단한다. 구체적인 방법은 아래의 내용과 같다. 단말 기기는 주기적으로 각 RLM-RS를 측정하고, 측정하여 획득된 측정값(SINR(signal to interference plus noise ratio, 신호 대 간섭 플러스 잡음비, 또는 신호 대 잡음 간섭비라고 함)값)을 동기 역치(Qin) 및 동기 탈 조 역치(Qout)와 비교하여, 단말 기기의 IS 상태/OOS 상태를 결정하고, 물리층은 판단하여 획득된 IS 상태/OOS 상태를 상위층에 보고한다. 구체적으로, 동기 탈조 out-of-sync 평가 주기 TEvaluate_out 내에 측정값이 동기 탈조 역치 Qout보다 낮은지 여부를 평가하고, 측정값이 모두 Qout보다 낮을 경우, L1(물리층)은 상위층에 OOS 지시를 보고하고; 동기 in-sync 평가 주기 TEvaluate_in 내에 측정값이 동기 역치 Qin보다 높은지 여부를 평가하고, 임의의 측정값이 Qin보다 높을 경우, L1은 상위층에 IS 지시를 보고한다. 상위층은 보고된 OOS 지시/IS 지시에 따라 다음 동작을 결정한다. 즉, OOS 카운터가 물리층에서 N310개의 OOS 지시를 연속 보고한 것을 기록할 경우, 단말 기기는 네트워크 기기에 의해 설정된 RLF(radio link failure, 무 선 링크 실패) 타이머 T310을 시동하고; IS 카운터가 물리층에서 N311개의 IS 지시를 연속 보고한 것을 기록하 였을 경우, T310 계시를 멈추고; T310이 만기될 경우, 단말 기기는 네트워크 기기에 RLF를 보고한다. R17에 RLM에 대한 릴랙스 메커니즘을 도입한다. 즉 릴랙스 준칙을 만족하는 단말 기기, 예를 들면 정지 상태 및 /또는 비교적 좋은 채널 상태에 있는 단말 기기에 대해, 당해 단말 기기는 RLM 릴랙스 메커니즘을 수행한다. 예 를 들면, 단말 기기가 주기적으로 각 RLM-RS를 측정하는 측정 간격을 늘린다. 2, RRM 릴랙스 메커니즘: R17에 RRM에 대한 릴랙스 메커니즘을 도입한다. 즉, 정지 준칙을 만족하는 연결 상태의 단말 기기에 대해, 당해 단말 기기는 RRM 릴랙스 메커니즘을 수행한다. 예를 들면, 단말 기기가 주기적으로 측정하는 측정 간격을 늘릴 수 있다. 상기 문제에 대해, 본 발명은 측정 방법 및 장치를 제공한다. 이해해야 할 것은, 본 발명의 실시예에서 설명하는 통신 시스템은 본 발명 실시예의 기술 수단을 더 명확하게 설명하기 위한 것이고, 본 발명의 실시예에서 제공하는 기술 수단에 대한 한정으로 구성되지 않고, 당업자는, 시스템 아키텍처의 변화 발전 및 신규 업무의 출현에 따라, 본 발명의 실시예에서 제공하는 기술 수단은 유사한 기술 문제에도 적용된다는 점을 알 수 있다. 아래는 도면과 결합하여 본 발명에서 제공하는 측정 방법 및 장치를 상세히 설명한다. 도 2를 참조하면, 도 2는 본 발명의 실시예에 따른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 도 2에 도시된 바와 같이, 당해 측정 방법은 단계201 내지 202를 포함하나 이에 한정되지 않는다. 단계201에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득한다. 본 발명의 실시예에서, 단말 기기는 타겟 측정을 수행하여, 타겟 측정의 측정값을 획득할 수 있다. 여기서, 타 겟 측정은 RLM 측정 및/또는 RRM 측정을 포함할 수 있다. 선택적으로, 타겟 측정이 RLM 측정일 경우, 측정값은 다운링크 RLM-RS의 SINR값일 수 있고, 타겟 측정이 RRM 측 정일 경우, 측정값은 서비스 셀 참조 신호의 신호 강도일 수 있다. 예를 들면 RSRP(Reference Signal Receiving Power, 참조 신호 수신 전력)일 수 있다. 단계202에서, 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하고, 여기서, 타겟 이벤트는 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 본 발명의 실시예에서, 단말 기기는 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 자체에 의해 트리거링 된 타겟 이벤트를 결정할 수 있고, 여기서, 타겟 이벤트는 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함 한다. 이해해야 할 것은, 타겟 측정이 부동할 경우, 대응되는 기준 정보는 부동할 수 있고, 타겟 측정에 대응되는 기 준 정보 및 타겟 측정의 측정값으로써, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하고, 타겟 이벤트 결 정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 도 3을 참조하면, 도 3은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 3에 도시된 바와 같이, 당해 측정 방법은 단계301 내지 302를 포함하나 이에 한정되지 않는다. 단계301에서, 단말 기기의 서비스 셀의 다운링크 참조 신호에 대해 타겟 측정을 수행하여, 측정값을 획득하고, 여기서, 타겟 측정은 RLM 측정 및/또는 RRM 측정이다. 본 발명의 실시예에서, 다운링크 참조 신호는 마스터 서비스 셀의 다운링크 참조 신호 및/또는 적어도 하나의 세컨더리 서비스 셀의 다운링크 참조 신호를 포함한다. 본 발명의 실시예에서, 타겟 측정이 RLM 측정일 경우, 다운링크 참조 신호는 SSB-RS 및/또는 CSI-RS와 같은 RLM-RS일 수 있다. 단말 기기의 서비스 셀의 다운링크 RLM-RS를 측정할 수 있고, 측정하여 획득된 측정값은 SINR일 수 있다. 본 발명의 실시예에서, 타겟 측정이 RRM 측정일 경우, 다운링크 참조 신호는 SSB-RS 및/또는 CSI-RS일 수 있다. 단말 기기의 서비스 셀의 다운링크 참조 신호를 측정할 수 있고, 측정하여 획득된 측정값은 RSRP일 수 있다. 단계302에서, 측정값 및 네트워크 기기에서 송신된 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤 트를 결정하고, 여기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 본 발명의 실시예에서, 기준 정보는 네트워크 기기에서 송신된 것일 수 있다. 예를 들면 네트워크 기기는 RRC 메시지를 통해, 당해 기준 정보를 설정할 수 있다. 본 발명의 실시예에서, 단말 기기는 측정값 및 네트워크 기기에서 송신된 기준 정보에 따라, 당해 단말 기기에 의해 트리거링된 타겟 이벤트를 결정할 수 있다. 여기서, 타겟 이벤트는 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함할 수 있다. 본 발명의 임의의 실시예에서, 네트워크 기기에서 송신된 기준 정보는 마스터 서비스 셀 및/또는 세컨더리 서비 스 셀에 적용될 수 있다. 일 예시로서, 네트워크 기기는 당해 단말 기기에 1세트의 기준 정보를 송신할 수 있고, 당해 유일한 1세트의 기 준 정보는, 단말 기기에 연결된 모든 서비스 셀에 적용될 수 있다. 즉, 단말 기기에 연결된 모든 서비스 셀에 대해, 당해 기준 정보를 공유한다. 다른 예시로서, 네트워크 기기는 단말 기기에서 복수의 기준 정보를 송신 할 수 있고, 부동한 기준 정보는 부동 한 서비스 셀에 적용된다. 예를 들면, 네트워크 기기는 단말 기기에 연결된 MCG(Master Cell Group, 마스터 셀 그룹) 및 SCG(Secondary Cell Group, 세컨더리 셀 그룹) 각각에 기준 정보를 설정할 수 있다. 예를 들면, MN (마스터 노드, MasterNode) 및 SN(SecondaryNode, 세컨더리 노드) 각각은 단말 기기에 기준 정보를 송신하고, 여기서, 네트워크 기기에 의해 MCG에 설정된 기준 정보는, 마스터 서비스 셀(primary cell, PCell)에 적용된다. 즉, 단말 기기는 마스터 서비스 셀의 참조 신호를 측정할 경우, 네트워크 기기에 의해 MCG에 설정된 기준 정보 에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정할 수 있다. 마찬가지로, 네트워크 기기에 의해 SCG 에 설정된 기준 정보는, 세컨더리 서비스 셀(secondary cell, Scell)에 적용된다. 예를 들면 프라이머리 세컨더 리 서비스 셀(primary SCG cell, PScell)에 적용된다. 즉 단말 기기는 세컨더리 서비스 셀의 참조 신호를 측정 할 경우, 네트워크 기기에 의해 SCG에 설정된 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정할 수 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 도 4를 참조하면, 도 4는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 4에 도시된 바와 같이, 당해 측정 방법은 단계401 내지 403을 포함하나 이에 한정되지 않는다. 단계401에서, 타겟 측정의 측정값을 획득한다. 여기서, 타겟 측정은 RLM 측정 및/또는 RRM 측정을 포함하고, 측정값은 타겟 측정에 대응되는 기준 정보의 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 RSRP, 또는, 타겟 시간 대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함한다. 본 발명의 실시예에서, 네트워크 기기에 의해 설정된 기준 정보는 타겟 시간대를 포함할 수 있고, 단말 기기는 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여, 적어도 하나의 측정값을 획득하고, 본 발명 에서 적어도 하나의 제1 RSRP라고 기재한다. 일 예시로서, 단말 기기는 타겟 시간대 내에서 다운링크 참조 신호를 한 번 측정하여, 1개의 제1 RSRP를 획득할 수 있다. 다른 예시로서, 단말 기기는 타겟 시간대 내에서 다운링크 참조정보를 여러번 측정하여, 복수의 제1 RSRP를 획 득할 수 있다. 본 발명의 실시예에서, 단말 기기는 타겟 시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여, 적어도 하나의 제1 RSRP를 획득할 수도 있다. 일 예시로서, 단말 기기는 타겟 시간대 내에서 1개의 다운링크 참조 신호를 적어도 한 번의 측정하여, 적어도 하나의 제1 RSRP를 획득할 수 있다. 다른 예시로서, 단말 기기는 타겟 시간대 내에서 복수의 다운링크 참조 신호를 적어도 한 번 측정하여, 복수의 제1 RSRP를 획득할 수 있다. 단계402에서, 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하고, 여기서, 제1 RSRP에 대 응되는 참조값은, 단말 기기가 제1 RSRP를 측정하기 전에 측정하여 획득된 것이다. 본 발명의 실시예에서, 각 제1 RSPR은 1개의 대응되는 참조값을 구비하고, 참조값과 제1 RSPR은 일일이 대응되 는 관계이고, 제1 RSRP에 대응되는 참조값은 단말 기기가 당해 제1 RSRP를 측정하기 전에 측정하여 획득된 RSRP 일 수 있다. 예를 들면, 제1 RSRP에 대응되는 참조값은 단말 기기가 당해 제1 RSRP를 측정하기 전에 가장 최근 에 측정하여 획득된 RSRP일 수 있다. 본 발명의 실시예에서, 임의의 제1 RSRP에 대해, 단말 기기가 당해 제1 RSRP를 측정하기 전에 측정하여 획득된 RSRP를 획득할 수 있고, 본 발명에서 참조값이라고 기재한다. 본 발명의 실시예에서, 각 제1 RSRP에 대해, 당해 제1 RSRP와 대응되는 참조값 사이의 차이를 결정할 수 있고, 본 발명에서 제1 차이라고 기재한다. 예를 들면, 제1 RSRP에서 대응되는 참조값을 감해, 획득된 차이값을 제1 차이로 할 수 있고, 또는, 참조값에서 대응되는 제1 RSRP를 감해, 획득된 차이값을 제1 차이로 할 수 있다. 단계403에서, 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 모두 기준 정보의 제1 차이 역치보다 작은 것에 응답하여, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한다. 본 발명의 실시예에서, 네트워크 기기에 의해 설정된 기준 정보는 제1 차이 역치를 더 포함하고, 당해 제1 차이 역치는, 단말 기기의 이동 속도를 표시하는데 사용된다. 즉, 단말 기기가 정지 상태에 있는지 저이동 상태에 있 는지를 결정하는데 사용된다. 예를 들면, 네트워크 기기는 RRC 메시지를 통해, 타겟 시간대 및 제1 차이 역치를 설정할 수 있다. 선택적으로, 타겟 시간대를 TSearchDeltaP로 표기하고, 제1 차이 역치를 SSearchDeltaP로 표기할 수 있다. 본 발명의 실시예에서, 모든 제1 RSRP에 대응되는 제1 차이가 모두 기준 정보의 제1 차이 역치보다 작을 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정할 수 있다. 즉, 단말 기기가 릴랙 스 진입 준칙을 만족하는 것을 결정한다. 설명해야 할 것은, 모든 제1 RSRP에 대응되는 제1 차이가 모두 제1 차이 역치보다 작을 경우, 단말 기기의 이동 속도가 비교적 낮다는 것을 나타내고, 이때, 릴랙스 진입 이벤트는 저이동성 이벤트라고 할 수도 있고, 상응하 게, 릴랙스 진입 준칙은 저이동성 준칙이라고 할 수도 있다. 본 발명의 임의의 실시예에서, 각 제1 RSRP에 대응되는 참조값을 업데이트할 수도 있다. 예를 들면, 단말 기기 가 셀 전환을 수행할 경우, 각 제1 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면, 각 제1 RSRP에 대해, 당해 제1 RSRP에 대응되는 참조값을 당해 제1 RSRP로 업데이트하고; 또는, 각 제1 RSRP에 대해, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰지 여부를 판단할 수 있고, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 클 경우, 당해 제1 RSRP에 따라 당해 제1 RSRP에 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제1 RSRP에 대응되는 참조값을 당해 제1 RSRP로 업데이 트하고, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 작거나 같을 경우, 당해 제1 RSRP에 대응되는 참조값을 업데이트하지 않아도 되고; 또는, 타겟 시간대(TSearchDeltaP) 내에, 각 제1 RSRP의 제1 차이가 제1 차이 역치보다 작은지 여부를 판단하고, 어느 하나의 제1 RSRP의 제1 차이가 제1 차이 역치보다 크 거나 같을 경우, 당해 제1 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제1 RSRP에 대 응되는 참조값을 당해 제1 RSRP로 업데이트하고, 어느 하나의 제1 RSRP의 제1 차이가 제1 차이 역치보다 작을 경우, 당해 제1 RSRP에 대응되는 참조값을 업데이트하지 않아도 된다. 여기서, 제3 차이 역치는 사전 설정된 것이다. 예를 들면, 제3 차이 역치는 네트워크 기기에 의해 설정된 것일 수 있고, 또는, 당해 제3 차이 역치는 프로토콜을 통해 약정될 수도 있고, 본 발명에서 이에 대해 한정하지 않 는다. 예를 들면, 당해 제3 차이 역치는 0일 수 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 프로토콜 약정을 통해, 이벤트 Event R1(릴랙스 진입 이벤트 및 릴랙스 퇴출 이 벤트를 포함함)을 정의할 수 있다. 일 예시로서, 릴랙스 진입 이벤트, 예를 들면 저이동성 이벤트에 대해, Event R1-1로 표기할 수 있고, Event R1-1은 저이동성 준칙을 통해 결정될 수 있다. 즉, 타겟 시간대 TSearchDeltaP 내에, 단말 기기에 의해 검출된 측정 값 Srxlev와 참조값 SrxlevRef 사이의 차이가 제1 차이 역치 SSearchDeltaP보다 작을 경우, 참조 신호의 변화 폭이 크 지 않다는 것을 나타내고, 이때, 단말 기기가 저이동 상태에 있다고 판단할 수 있다. 실시예1: 저이동성 준칙: (SrxlevRef - Srxlev) < SSearchDeltaP을 만족할 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트 또는 저이동성 이벤트인 것을 결정할 수 있다. 여기서, 측정값 Srxlev의 단위는 dB이고, 참조값 Srxlev Ref의 단위는 dB이다. 여기서, 하기의 조건 중의 임의의 조건이 만족될 경우, 참조값을 측정값으로 설정한다. 단말 기기가 1개의 새로운 서비스 셀로 전환된다. Srxlev- SrxlevRef> 0. 타겟 시간대 TSearchDeltaP 내에, 저이동성 준칙: (SrxlevRef - Srxlev) < SSearchDeltaP가 만족되지 않는다. 도 5를 참조하면, 도 5는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 5에 도시된 바와 같이, 당해 측정 방법은 단계501 내지 504를 포함하나 이에 한정되지 않는다. 단계501에서, 타겟 측정의 측정값을 획득한다. 여기서, 타겟 측정은 RLM 측정 및/또는 RRM 측정을 포함하고, 측정값은 타겟 측정에 대응되는 기준 정보의 타겟 시간대(TSearchDeltaP) 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 RSRP, 또는, 타겟 시간대(TSearchDeltaP) 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP 를 포함한다. 또한, 측정값은 타겟 시간대 후의 설정 시간(T1) 내에서 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 설정 시간(T1) 내에서 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제 2 RSRP를 더 포함한다. 본 발명의 실시예에서, 단계501은 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 본 발명의 실시예에서, 설정 시간은 사전 설정된 것이다. 예를 들면, 당해 설정 시간은 네트워크 기기에 의해 설정된 것일 수 있고, 또는, 당해 설정 시간은 프로토콜을 통해 약정될 수도 있고, 본 발명에서 이에 대해 한정 하지 않는다. 선택적으로, 당해 설정 시간을 T1로 표기한다. 본 발명의 실시예에서, 단말 기기는 타겟 시간대(TSearchDeltaP) 후의 설정 시간(T1) 내에서 다운링크 참조 신호를 여러번 측정하여, 복수의 측정값을 획득할 수 있고, 본 발명에서 복수의 제2 RSRP라고 기재하고, 또는, 단말 기 기는 설정 시간(T1) 내에서 복수의 다운링크 참조 신호를 적어도 한 번 측정하여, 복수의 제2 RSRP를 획득할 수 있다. 단계502에서, 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하고; 여기서, 제1 RSRP에 대 응되는 참조값은, 단말 기기가 제1 RSRP를 측정하기 전에 측정하여 획득된 것이다. 본 발명의 실시예에서, 단계502는 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계503에서, 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 모두 기준 정보의 제1 차이 역치보다 작은 것에 응답하여, 복수의 제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정하고; 상기 제2 RSRP와 대응되는 참조값 은, 단말 기기가 상기 제2 RSRP를 측정하기 전에 측정하여 획득된 것이다. 본 발명의 실시예에서, 각 제2 RSPR은 1개의 대응되는 참조값을 구비하고, 참조값과 제2 RSPR은 일일이 대응되 는 관계이고, 제2 RSRP에 대응되는 참조값은 단말 기기가 당해 제2 RSRP를 측정하기 전에 측정하여 획득된 RSRP 일 수 있다. 예를 들면, 제2 RSRP에 대응되는 참조값은 단말 기기가 당해 제2 RSRP를 측정하기 전에 가장 최근 에 측정하여 획득된 RSRP일 수 있다. 본 발명의 실시예에서, 단말 기기는 모든 제1 RSRP에 대응되는 제1 차이가 모두 기준 정보의 제1 차이 역치보다 작은 것을 결정하였을 경우, 각 제2 RSRP에 대응되는 참조값을 획득할 수 있다. 본 발명의 실시예에서, 각 제2 RSRP에 대해, 단말 기기는 당해 제2 RSRP와 대응되는 참조값 사이의 차이를 결정 할 수 있고, 본 발명에서 제2 차이라고 기재한다. 예를 들면, 제2 RSRP에서 대응되는 참조값을 감해, 획득된 차 이값을 제2 차이로 할 수 있고, 또는, 참조값에서 대응되는 제2 RSRP를 감해, 획득된 차이값을 제2 차이로 할 수도 있다. 단계504에서, 복수의 제2 RSRP에 대응되는 제2 차이가 모두 제1 차이 역치보다 작은 것에 응답하여, 단말 기기 에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한다. 본 발명의 실시예에서, 각 제2 RSRP에 대응되는 제2 차이가 모두 제1 차이 역치보다 작을 경우, 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정할 수 있다. 즉 단말 기기가 릴랙스 진입 준칙을 만족하는 것을 결정한다. 설명해야 할 것은, 모든 제2 RSRP에 대응되는 제2 차이가 모두 제1 차이 역치보다 작을 경우, 단말 기기의 이동 속도가 비교적 낮은 것을 나타내고, 이때, 릴랙스 진입 이벤트는 저이동성 이벤트라고 할 수도 있다. 본 발명의 임의의 실시예에서, 각 제1 RSRP에 대응되는 참조값을 업데이트할 수도 있다. 예를 들면, 단말 기기 가 셀 전환을 수행할 경우, 각 제1 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면, 각 제1 RSRP에 대해, 당해 제1 RSRP에 대응되는 참조값을 당해 제1 RSRP로 업데이트하고; 또는, 각 제1 RSRP에 대해, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰지 여부를 판단할 수 있고, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 클 경우, 당해 제1 RSRP에 따라 당해 제1 RSRP에대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제1 RSRP에 대응되는 참조값을 당해 제1 RSRP로 업데이 트하고, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 작거나 같을 경우, 당해 제1 RSRP에 대응되는 참조값을 업데이트하지 않아도 되고; 또는, 타겟 시간대(TSearchDeltaP) 내에, 각 제1 RSRP의 제1 차이가 제1 차이 역치보다 작은지 여부를 판단하고, 어느 하나의 제1 RSRP의 제1 차이가 제1 차이 역치보다 크 거나 같을 경우, 당해 제1 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제1 RSRP에 대 응되는 참조값을 당해 제1 RSRP로 업데이트하고, 어느 하나의 제1 RSRP의 제1 차이가 제1 차이 역치보다 작을 경우, 당해 제1 RSRP에 대응되는 참조값을 업데이트하지 않아도 된다. 마찬가지로, 단말 기기가 셀 전환을 수행할 경우, 각 제2 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면, 각 제2 RSRP에 대해, 당해 제2 RSRP에 대응되는 참조값을 당해 제2 RSRP로 업데이트하고; 또는, 각 제2 RSRP에 대해, 당해 제2 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰지 여부를 판단할 수 있고, 당해 제2 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 클 경우, 당해 제2 RSRP에 따 라 당해 제2 RSRP에 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제2 RSRP에 대응되는 참조값을 당 해 제2 RSRP로 업데이트하고, 당해 제2 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 작거나 같을 경우, 당해 제2 RSRP에 대응되는 참조값을 업데이트하지 않아도 되고; 또는, 설정 시간(T1) 내에, 각 제2 RSRP의 제2 차이가 제1 차이 역치보다 작은지 여부를 판단하고, 어느 하나의 제2 RSRP의 제2 차이가 제1 차이 역치보다 크거나 같을 경우, 당해 제2 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제2 RSRP에 대응되는 참조값을 당해 제2 RSRP로 업데이트하고, 어느 하나의 제2 RSRP의 제2 차이가 제1 차이 역치보 다 작을 경우, 당해 제2 RSRP에 대응되는 참조값을 업데이트하지 않아도 된다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 프로토콜 약정을 통해, 이벤트 Event R1(릴랙스 진입 이벤트 및 릴랙스 퇴출 이 벤트를 포함함)을 정의할 수 있다. 일 예시로서, 릴랙스 진입 이벤트, 예를 들면 저이동성 이벤트에 대해, Event R1-1로 표기할 수 있고, Event R1-1은 저이동성 준칙을 통해 결정될 수 있다. 즉, 타겟 시간대 TSearchDeltaP 내에, 단말 기기에 의해 검출된 측정 값 Srxlev와 참조값 SrxlevRef 사이의 차이가 제1 차이 역치 SSearchDeltaP보다 작을 경우, 참조 신호의 변화 폭이 크 지 않다는 것을 나타내고, 이때, 단말 기기가 저이동 상태에 있다고 판단할 수 있다. 나아가, 설정 시간 T1 내에서, 단말 기기에 의해 검출된 측정값 Srxlev과 참조값 SrxlevRef 사이의 차이가 제1 차이 역치 SSearchDeltaP보다 작은지 여부를 결정할 수 있고, 차이가 제1 차이 역치 SSearchDeltaP보다 작을 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트 또는 저이동성 이벤트인 것을 결정할 수 있다. 실시예2: Event R1-1의 판단 조건: 설정 시간 내에서, TSearchDeltaP를 단위로 하고, 저이동성 준칙: (SrxlevRef - Srxlev) < SSearchDeltaP를 만족할 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트 또는 저 이동성 이벤트인 것을 결정할 수 있다. 여기서, 측정값 Srxlev의 단위는 dB이고, 참조값 SrxlevRef의 단위는 dB이다. 여기서, 하기의 조건 중의 임의의 조건이 만족될 경우, 참조값을 측정값으로 설정한다. 단말 기기가 1개의 새로운 서비스 셀로 전환된다. Srxlev- SrxlevRef> 0 타겟 시간대 TSearchDeltaP 내에, 저이동성 준칙: (SrxlevRef - Srxlev) < SSearchDeltaP가 만족되지 않는다. 도 6을 참조하면, 도 6은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 6에 도시된 바와 같이, 당해 측정 방법은 단계601 내지 603을 포함하나 이에 한정되지 않는다. 단계601에서, 타겟 측정의 측정값을 획득한다. 여기서, 타겟 측정은 RLM 측정 및/또는 RRM 측정을 포함하고, 측정값은 타겟 측정에 대응되는 기준 정보의 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 RSRP, 또는, 타겟 시간 대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함한다. 단계602에서, 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하고; 상기 제1 RSRP에 대응되 는 참조값은, 상기 단말 기기가 상기 제1 RSRP를 측정하기 전에 측정하여 획득된 것이다. 본 발명의 실시예에서, 단계601 내지 602는 각각 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계603에서, 기준 정보의 제2 차이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 존재 하는 것에 응답하여, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정한다. 본 발명의 실시예에서, 네트워크 기기에서 송신된 기준 정보는 타겟 시간대(TSearchDeltaP) 이외에, 제2 차이 역치 도 포함하고, 당해 제2 차이 역치는, 단말 기기의 이동 속도를 표시하는데 사용된다. 즉, 단말 기기가 정지 상 태에 있는지 저이동 상태에 있는지를 결정하는데 사용된다. 여기서, 제2 차이 역치와 제1 차이 역치는 동일할 수 있고, 또는 부동할 수도 있다. 예를 들면 제2 차이 역치는 제1 차이 역치 및 보상 오프셋값에 따라 결정될 수 있다. 일 예시로서, 네트워크 기기는 RRC 메시지를 통해, 타겟 시간대 및 제2 차이 역치를 설정할 수 있다. 선택적으 로, 타겟 시간대를 TSearchDeltaP로 표기하고, 제2 차이 역치를 SSearchDeltaP'로 표기할 수 있다. 본 발명의 실시예에서, 기준 정보의 제2 차이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제1 차 이가 존재할 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정할 수 있다. 즉 단말 기기가 릴랙스 퇴출 준칙인 것을 결정한다. 설명해야 할 것은, 제2 차이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 존재할 경우, 단말 기기의 이동 속도가 낮지 않다는 것을 표시하고, 이때, 릴랙스 퇴출 이벤트는 비저이동성 이벤트 또 는 고이동성 이벤트라고 할 수도 있다. 본 발명의 임의의 실시예에서, 각 제1 RSRP에 대응되는 참조값을 업데이트할 수도 있다. 예를 들면, 단말 기기 가 셀 전환을 수행할 경우, 각 제1 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면, 각 제1 RSRP에 대해, 당해 제1 RSRP에 대응되는 참조값을 당해 제1 RSRP로 업데이트하고; 또는, 각 제1 RSRP에 대해, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰지 여부를 판단할 수 있고, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 클 경우, 당해 제1 RSRP에 따라 당해 제1 RSRP에 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제1 RSRP에 대응되는 참조값을 당해 제1 RSRP로 업데이 트하고, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 작거나 같을 경우, 당해 제1 RSRP에 대응되는 참조값을 업데이트하지 않아도 되고; 또는, 타겟 시간대(TSearchDeltaP) 내에, 각 제1 RSRP의 제1 차이가 제1 차이 역치보다 작은지 여부를 판단하고, 어느 하나의 제1 RSRP의 제1 차이가 제1 차이 역치보다 크 거나 같을 경우, 당해 제1 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제1 RSRP에 대 응되는 참조값을 당해 제1 RSRP로 업데이트하고, 어느 하나의 제1 RSRP의 제1 차이가 제1 차이 역치보다 작을 경우, 당해 제1 RSRP에 대응되는 참조값을 업데이트하지 않아도 된다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 프로토콜 약정을 통해, 이벤트 Event R1(릴랙스 진입 이벤트 및 릴랙스 퇴출 이 벤트를 포함함)을 정의할 수 있다. 일 예시로서, 릴랙스 퇴출 이벤트, 예를 들면 비저이동성 이벤트 또는 고이동성 이벤트에 대해, Event R1-2로 표기할 수 있고, Event R1-2는 저이동성 준칙을 통해 결정될 수 있다. 즉, 타겟 시간대 TSearchDeltaP 내에, 단말 기기에서 검출된 측정값 Srxlev와 참조값 SrxlevRef 사이의 차이가 제2 차이 역치 SSearchDeltaP'보다 클 경우, 참조 신호 변화 폭이 비교적 큰 것을 나타내고, 이때, 단말 기기가 저이동 상태에 있지 않은 것을 판단할 수 있다. 실시예3에서, (SrxlevRef - Srxlev) > SSearchDeltaP'를 만족할 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트 또는 비저이동성 이벤트 또는 고이동성 이벤트인 것을 결정할 수 있다. 여기서, 측정값 Srxlev의 단위는 dB이고, 참조값 SrxlevRef의 단위는 dB이다. 여기서, 하기의 조건 중의 임의의 조건이 만족될 경우, 참조값을 측정값으로 설정한다. 단말 기기가 1개의 새로운 서비스 셀로 전환된다. Srxlev- SrxlevRef> 0. 타겟 시간대 TSearchDeltaP 내에, 저이동성 준칙: (SrxlevRef - Srxlev) > SSearchDeltaP'가 만족되지 않는다. 도 7을 참조하면, 도 7은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 7에 도시된 바와 같이, 당해 측정 방법은 단계701 내지 704를 포함하나 이에 한정되지 않는다. 단계701에서, 타겟 측정의 측정값을 획득한다. 여기서, 타겟 측정은 RLM 측정 및/또는 RRM 측정을 포함하고, 측정값은 타겟 측정에 대응되는 기준 정보의 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 RSRP, 또는, 타겟 시간 대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함한다. 또한, 측 정값은 타겟 시간대 후의 설정 시간 내에 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 설정 시간 내에 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 더 포함한다. 단계702에서, 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하고, 여기서, 제1 RSRP에 대 응되는 참조값은, 단말 기기가 제1 RSRP를 측정하기 전에 측정하여 획득된 것이다. 본 발명의 실시예에서, 단계701 내지 702 각각은 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계703에서, 기준 정보의 제2 차이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 존재 하는 것에 응답하여, 복수의 제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정하고, 여기서, 제2 RSRP에 대 응되는 참조값은, 단말 기기가 제2 RSRP를 측정하기 전에 측정하여 획득된 것이다. 여기서, 제2 RSRP에 대응되는 참조값의 설명은 본 발명 임의의 실시예를 참조할 수 있고, 여기서 더는 설명하지 않는다. 본 발명의 실시예에서, 기준 정보의 제2 차이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제1 차 이가 존재할 경우, 나아가 각 제2 RSRP에 대응되는 참조값을 획득할 수 있고, 각 제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정한다. 단계704에서, 제2 차이 역치보다 크거나 같은 적어도 하나의 제2 RSRP에 대응되는 제2 차이가 존재하는 것에 응 답하여, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정한다. 본 발명의 실시예에서, 기준 정보의 제2 차이 역치보다 크거나 같은 적어도 하나의 제2 RSRP에 대응되는 제2 차 이가 존재할 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정할 수 있다. 즉, 단말 기기가 릴랙스 퇴출 준칙을 만족하는 것을 결정한다. 설명해야 할 것은, 제2 차이 역치보다 크거나 같은 적어도 하나의 제2 RSRP에 대응되는 제2 차이가 존재할 경우, 단말 기기의 이동속도가 낮지 않은 것을 나타내고, 이때, 릴랙스 퇴출 이벤트는 비저이동성 이벤트 또는 고이동성 이벤트라고 할 수도 있다. 본 발명의 임의의 실시예에서, 각 제1 RSRP에 대응되는 참조값을 업데이트할 수도 있다. 예를 들면, 단말 기기 가 셀 전환을 수행할 경우, 각 제1 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면, 각 제1 RSRP에 대해, 당해 제1 RSRP에 대응되는 참조값을 당해 제1 RSRP로 업데이트하고; 또는, 각 제1 RSRP에 대해, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰지 여부를 판단할 수 있고, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 클 경우, 당해 제1 RSRP에 따라 당해 제1 RSRP에 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제1 RSRP에 대응되는 참조값을 당해 제1 RSRP로 업데이 트하고, 당해 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 작거나 같을 경우, 당해 제1 RSRP에 대응되는 참조값을 업데이트하지 않아도 되고; 또는, 타겟 시간대(TSearchDeltaP) 내에, 각 제1 RSRP의 제1 차이가 제2 차이 역치보다 작은지 여부를 판단하고, 어느 하나의 제1 RSRP의 제1 차이가 제2 차이 역치보다 크 거나 같을 경우, 당해 제1 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제1 RSRP에 대 응되는 참조값을 당해 제1 RSRP로 업데이트하고, 어느 하나의 제1 RSRP의 제1 차이가 제1 차이 역치보다 크거나 같을 경우, 당해 제1 RSRP에 대응되는 참조값을 업데이트하지 않아도 된다. 마찬가지로, 단말 기기가 셀 전환을 수행할 경우, 각 제2 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면, 각 제2 RSRP에 대해, 당해 제2 RSRP에 대응되는 참조값을 당해 제2 RSRP로 업데이트하고; 또는, 각 제2 RSRP에 대해, 당해 제2 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰지 여부를 판단할 수 있고, 당해 제2 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 클 경우, 당해 제2 RSRP에 따 라 당해 제2 RSRP에 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제2 RSRP에 대응되는 참조값을 당 해 제2 RSRP로 업데이트하고, 당해 제2 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 작거나 같을 경우, 당해 제2 RSRP에 대응되는 참조값을 업데이트하지 않아도 되고; 또는, 설정 시간(T1) 내에, 각 제2 RSRP의 제2 차이가 제2 차이 역치보다 작은지 여부를 판단하고, 어느 하나의 제2 RSRP의 제2 차이가 제2 차이 역치보다 작을 경우, 당해 제2 RSRP에 따라 대응되는 참조값을 업데이트할 수 있다. 예를 들면 당해 제2 RSRP에 대응되는 참조값을 당해 제2 RSRP로 업데이트하고, 어느 하나의 제2 RSRP의 제2 차이가 제2 차이 역치보다 크거 나 같을 경우, 당해 제2 RSRP에 대응되는 참조값을 업데이트하지 않아도 된다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 프로토콜 약정을 통해, 이벤트 Event R1(릴랙스 진입 이벤트 및 릴랙스 퇴출 이 벤트를 포함함)을 정의할 수 있다. 일 예시로서, 릴랙스 퇴출 이벤트, 예를 들면 비저이동성 이벤트 또는 고이동성 이벤트에 대해, Event R1-2로 표기할 수 있고, Event R1-2는 저이동성 준칙을 통해 결정될 수 있다. 즉, 타겟 시간대 TSearchDeltaP 내에, 단말 기기에서 검출된 측정값 Srxlev와 참조값 SrxlevRef 사이의 차이가 제2 차이 역치 SSearchDeltaP'보다 클 경우, 참조 신호 변화 폭이 비교적 큰 것을 나타내고, 이때, 단말 기기가 저이동 상태에 있지 않은 것을 판단할 수 있다. 나아가, 설정 시간 T1 내에, 단말 기기에 의해 검출된 측정값 Srxlev와 참조값 SrxlevRef 사이의 차이가 제2 차 이 역치 SSearchDeltaP'보다 큰지 여부를 결정할 수 있고, 차이가 제2 차이 역치 SSearchDeltaP'보다 클 경우, 단말 기기 에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트 또는 비저이동성 이벤트인 것을 결정한다. 실시예4에서, Event R1-2의 판단 조건: 설정 시간 내에, TSearchDeltaP를 단위로 하고, (SrxlevRef - Srxlev) > SSearchDeltaP'를 만족할 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트 또는 비저이동성 이벤트인 것을 결정할 수 있다. 여기서, 측정값 Srxlev의 단위는 dB이고, 참조값 SrxlevRef의 단위는 dB이다. 여기서, 하기의 조건 중의 임의의 조건이 만족될 경우, 참조값을 측정값으로 설정한다. 단말 기기가 1개의 새로운 서비스 셀로 전환된다. Srxlev- SrxlevRef> 0. 타겟 시간대 TSearchDeltaP 내에, 저이동성 준칙: (SrxlevRef - Srxlev) > SSearchDeltaP'가 만족되지 않는다. 도 8을 참조하면, 도 8은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 8에 도시된 바와 같이, 당해 측정 방법은 단계801 내지 803을 포함하나 이에 한정되지 않는다. 단계801에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고, 측정값은 복수의 다운링 크 참조 신호를 측정하여 획득된 복수의 제1 SINR을 포함한다. 본 발명의 실시예에서, 단계801은 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 본 발명의 실시예에서, 단말 기기는 복수의 다운링크 참조 신호를 적어도 한 번 측정하여, 복수의 측정값을 획 득할 수 있고, 본 발명에서 복수의 제1 SINR로 기록한다. 단계802에서, 타겟 측정에 대응되는 기준 정보의 역치 지시 정보에 따라, 제1 품질 역치를 결정한다. 본 발명의 실시예에서, 네트워크 기기에서 송신된 기준 정보는 역치 지시 정보를 포함할 수 있다. 예를 들면, 네트워크 기기는 RRC 메시지를 통해, 당해 역치 지시 정보를 설정할 수 있다. 본 발명의 실시예에서, 단말 기기는 역치 지시 정보에 따라, 제1 품질 역치를 결정할 수 있고, 여기서, 제1 품 질 역치는 참조 신호 품질을 표시하는데 사용된다. 본 발명 실시예의 구현 가능한 방식에서, 역치 지시 정보는 제1 오프셋을 포함할 수 있고, 선택적으로, 당해 제 1 오프셋은 offset1로 표기한다. 본 발명의 실시예에서, 단말 기기는 제1 오프셋에 따라, 제1 품질 역치를 결정할 수 있다. 예를 들면, 제1 오프 셋과 제1 설정 임계를 더해, 제1 품질 역치를 획득할 수 있다. 여기서, 제1 설정 임계는 관련 기술의 RLM 측정 에 대응되는 임계 Qin또는 Qout일 수 있다. 본 발명 실시예의 다른 구현 가능한 방식에서, 역치 지시 정보는 타겟 역치를 포함할 수 있다. 단말 기기는 타 겟 역치에 따라, 제1 품질 역치를 결정할 수 있다. 예를 들면, 타겟 역치를, 제1 품질 역치로 할 수 있다. 단계803에서, 복수의 제1 SINR이 모두 제1 품질 역치보다 큰 것에 응답하여, 타겟 이벤트가 릴랙스 진입 이벤트 인 것을 결정하고; 또는, 적어도 하나의 제1 품질 역치보다 큰 제1 SINR이 존해하는 것에 응답하여, 타겟 이벤 트가 릴랙스 진입 이벤트인 것을 결정한다. 본 발명 실시예의 구현 가능한 방식에서, 복수의 제1 SINR이 모두 제1 품질 역치보다 클 경우, 단말 기기에 의 해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정할 수 있다. 즉, 단말 기기가 릴랙스 진입 준칙을 만족하는 것을 결정한다. 본 발명 실시예의 다른 구현 가능한 방식에서, 제1 품질 역치보다 큰 적어도 하나의 제1 SINR이 존재할 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정할 수 있다. 즉, 단말 기기가 릴랙 스 진입 준칙을 만족하는 것을 결정한다. 설명해야 할 것은, 제1 SINR이 제1 품질 역치보다 클 경우, 참조 신호의 신호 품질이 비교적 큰 것을 결정할 수 있고, 이때, 릴랙스 진입 이벤트는 셀 신호 품질이 좋은 이벤트라고 할 수도 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 프로토콜 약정을 통해, 이벤트 Event R2(릴랙스 진입 이벤트 및 릴랙스 퇴출 이 벤트를 포함함)를 포함할 수 있다. 일 예시로서, 릴랙스 진입 이벤트, 예를 들면 셀 신호 품질이 좋은 이벤트에 대해, Event R2-1로 표기할 수 있 고, Event R2-1은 신호 품질이 좋은 준칙을 통해 결정될 수 있다. 즉 서비스 셀에 복수의 RS(즉 참조 신호)가 설정되었을 경우, 각 RS를 측정할 수 있고, 측정하여 획득된 RS에 대응되는 SINR과 역치를 비교하고, 단말 기기 가 신호 품질이 좋은 준칙을 만족하는지 여부를 결정한다. 실시예5에서, 모든 RS가 모두 측정값 SINRmeasured>제1 품질 역치(Qout + Offset1)를 만족할 경우, 단말 기기가 신 호 품질이 좋은 준칙을 만족하는 것을 결정하고, 당해 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트 또는 셀 신호 품질이 좋은 이벤트인 것을 결정한다. 실시예6에서, 임의의 RS가, 측정값 SINRmeasured>제1 품질 역치(Qout + Offset1)를 만족할 경우, 단말 기기가 신호 품질이 좋은 준칙을 만족하는 것을 결정하고, 당해 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이 벤트 또는 셀 신호 품질이 좋은 이벤트인 것을 결정한다. 도 9를 참조하면, 도 9는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 9에 도시된 바와 같이, 당해 측정 방법은 단계901 내지 903을 포함하나 이에 한정되지 않는다. 단계901에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고, 측정값은 복수의 다운링 크 참조 신호를 측정하여 획득된 복수의 제1 SINR을 포함한다. 본 발명의 실시예에서, 단계901은 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있다. 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계902에서, 타겟 측정에 대응되는 기준 정보의 역치 지시 정보에 따라, 제2 품질 역치를 결정한다. 본 발명의 실시예에서, 네트워크 기기에서 송신된 기준 정보는 역치 지시 정보를 포함할 수 있다. 예를 들면, 네트워크 기기는 RRC 메시지를 통해, 당해 역치 지시 정보를 설정할 수 있다. 본 발명의 실시예에서, 단말 기기는 역치 지시 정보에 따라, 제2 품질 역치를 결정할 수 있고, 여기서, 제2 품 질 역치는 참조 신호 품질을 표시하는데 사용된다. 본 발명 실시예의 구현 가능한 방식에서, 역치 지시 정보는 제2 오프셋을 포함할 수 있고, 선택적으로, 당해 제 2 오프셋을 offset2로 표기한다. 단말 기기는 제2 오프셋에 따라, 제2 품질 역치를 결정할 수 있다. 예를 들면, 제2 오프셋과 제2 설정 임계를 더해, 제2 품질 역치를 획득한다. 여기서, 제2 설정 임계는 관련 기술의 RLM 측정에 대응되는 임계 Qin 또는 Qout일 수 있다 여기서, 제2 오프셋과 제1 오프셋은 동일할 수 있고, 또는 부동할 수도 있고, 본 발명에서 이에 대해 한정하지 않는다. 여기서, 제1 설정 임계와 제2 설정 임계는 동일할 수 있고, 또는 부동할 수도 있고, 본 발명에서 이에 대해 한 정하지 않는다. 설명해야 할 것은, 네트워크 기기에 의해 설정된 릴랙스 진입 이벤트의 트리거링 여부를 판단하는 제1 오프셋은, 릴랙스 퇴출 이벤트의 트리거링 여부를 판단하는 제2 오프셋과 부동하고, 이때, 제1 설정 임계와 제2 설정 임계가 동일해도, 제1 품질 역치와 제2 품질 역치는 부동하다. 본 발명 실시예의 다른 구현 가능한 방식에서, 역치 지시 정보는 타겟 역치를 포함할 수 있다. 단말 기기는 타 겟 역치에 따라, 제2 품질 역치를 결정할 수 있다. 예를 들면, 타겟 역치를, 제2 품질 역치로 할 수 있다. 단계903에서, 제2 품질 역치보다 작거나 같은 적어도 하나의 제1 SINR이 존재하는 것에 응답하여, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하고; 또는, 복수의 제1 SINR이 모두 제2 품질 역치보다 작거나 같은 것에 응답하여, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정한다. 본 발명의 실시예에서, 제2 품질 역치보다 작거나 같은 적어도 하나의 제1 SINR이 존재하는 것에 응답하여, 단 말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정할 수 있다. 단말 기기릴랙스 퇴출 준칙을 만족하는 것을 결정한다. 또는, 각 제1 SINR이 모두 제2 품질 역치보다 작거나 같은 것에 응답하여, 단 말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정할 수 있다. 즉, 단말 기기가 릴랙스 퇴출 준칙을 만족하는 것을 결정한다. 설명해야 할 것은, 제1 SINR가 제2 품질 역치보다 작거나 같을 경우, 참조 신호의 신호 품질이 비교적 차함을 결정할 수 있고, 이때, 릴랙스 퇴출 이벤트는 비셀 신호 품질이 좋은 이벤트 또는 셀 신호 품질이 차한 이벤트 라고 할 수도 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 프로토콜 약정을 통해, 이벤트 Event R2(릴랙스 진입 이벤트 및 릴랙스 퇴출 이 벤트를 포함함)를 포함할 수 있다. 일 예시로서, 릴랙스 퇴출 이벤트, 예를 들면 비셀 신호 품질이 좋은 이벤트 또는 셀 신호 품질이 차한 이벤트 에 대해, Event R2-2를 표기할 수 있고, Event R2-2는 신호 품질이 좋은 준칙을 통해 결정될 수 있다. 즉 서비 스 셀에 복수의 RS(즉 참조 신호)가 설정되었을 경우, 각 RS를 측정할 수 있고, 측정하여 획득된 RS에 대응되는 SINR과 역치를 비교하고, 단말 기기가 신호 품질이 좋은 준칙을 만족하는지 여부를 결정한다. 실시예7에서, 임의의 RS가 측정값 SINRmeasured<제2 품질 역치(Qout + Offset2)를 만족할 경우, 단말 기기가 신호 품질이 준칙을 만족하지 않은 것을 결정하고, 당해 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이 벤트 또는 비셀 신호 품질이 좋은 이벤트 또는 셀 신호 품질이 차한 이벤트인 것을 결정한다. 실시예8에서, 모든 RS가 모두 측정값 SINRmeasured<제2 품질 역치(Qout + Offset2)를 만족할 경우, 단말 기기가 신 호 품질이 좋은 준칙을 만족하지 않은 것을 결정하고, 당해 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트 또는 비셀 신호 품질이 좋은 이벤트 또는 셀 신호 품질이 차한 이벤트인 것을 결정한다. 도 10을 참조하면, 도 10은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 10에 도시된 바와 같이, 당해 측정 방법은 단계1001 내지 1003을 포함하나 이에 한정되지 않는다. 단계1001에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고, 측정값은 설정 시간 내 에 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 SINR을 포 함한다. 본 발명의 실시예에서, 단계1001은 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예 는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 본 발명의 실시예에서, 설정 시간의 설명은 본 발명 임의의 실시예를 참조할 수 있고, 여기서 더는 설명하지 않 는다. 본 발명의 실시예에서, 단말 기기는 설정 시간 내에서 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신 호를 여러번 측정하여, 각 다운링크 참조 신호에 대응되는 복수의 측정값을 획득할 수 있고, 본 발명에서 복수 의 제2 SINR로 기재한다. 단계1002에서, 타겟 측정에 대응되는 기준 정보의 역치 지시 정보에 따라, 제1 품질 역치를 결정한다. 본 발명의 실시예에서, 단계1002는 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예 는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계1003에서, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제1 품질 역치보다 큰 것에 응답하여, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하고; 또는, 모두 제1 품질 역치보다 큰 적어도 하나의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재하는 것에 응답하여, 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한다. 본 발명의 실시예에서, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제1 품질 역치보다 클 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한다. 또는, 모두 제1 품질 역치보 다 큰 적어도 하나의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재할 경우, 단말 기기에 의해 트리거 링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정할 수 있다. 즉, 단말 기기가 릴랙스 진입 준칙을 만족하는 것을 결정한다. 설명해야 할 것은, 제2 SINR이 제1 품질 역치보다 클 경우, 다운링크 참조 신호의 신호 품질이 비교적 좋은 것 을 결정하고, 이때, 릴랙스 진입 이벤트는 셀 신호 품질이 좋은 이벤트라고 할 수도 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 프로토콜 약정을 통해, 이벤트 Event R2(릴랙스 진입 이벤트 및 릴랙스 퇴출 이 벤트를 포함함)를 포함할 수 있다. 일 예시로서, 릴랙스 진입 이벤트, 예를 들면 셀 신호 품질이 좋은 이벤트에 대해, Event R2-1로 표기할 수 있 고, Event R2-1은 신호 품질이 좋은 준칙을 통해 결정될 수 있다. 즉 서비스 셀에 복수의 RS(즉 참조 신호)가 설정되었을 경우, 각 RS를 측정할 수 있고, 측정하여 획득된 RS에 대응되는 SINR과 역치를 비교하여, 단말 기기 가 신호 품질이 좋은 준칙을 만족하는지 여부를 결정한다. 나아가, 설정 시간 T1 내에, 단말 기기가 신호 품질이 좋은 준칙을 만족하는지 여부를 결정할 수 있다. 실시예9에서, 설정 시간 T1 내에, 모든 RS가 모두 측정값 SINRmeasured>제1 품질 역치(Qout + Offset1)를 만족할 경 우, 단말 기기가 신호 품질이 좋은 준칙을 만족하는 것을 결정하고, 당해 단말 기기에 의해 트리거링된 타겟 이 벤트가 릴랙스 진입 이벤트 또는 셀 신호 품질이 좋은 이벤트인 것을 결정한다. 실시예10에서, 설정 시간 T1 내에, 임의의 RS가, 측정값 SINRmeasured>제1 품질 역치(Qout + Offset1)를 만족할 경 우, 단말 기기가 신호 품질이 좋은 준칙을 만족하는 것을 결정하고, 당해 단말 기기에 의해 트리거링된 타겟 이 벤트가 릴랙스 진입 이벤트 또는 셀 신호 품질이 좋은 이벤트인 것을 결정한다. 도 11을 참조하면, 도 11은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 11에 도시된 바와 같이, 당해 측정 방법은 단계1101 내지 1103을 포함하나 이에 한정되지 않는다. 단계1101에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고, 측정값은 설정 시간 내 에 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 SINR을 포 함한다. 본 발명의 실시예에서, 단계1101은 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예 는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계1102에서, 타겟 측정에 대응되는 기준 정보의 역치 지시 정보에 따라, 제2 품질 역치를 결정한다. 본 발명의 실시예에서, 단계1102는 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예 는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계1103에서, 모두 제2 품질 역치보다 작거나 같은 적어도 하나의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재하는 것에 응답하여, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정 하고; 또는, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제2 품질 역치보다 작거나 같은 것에 응답하여, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정한다. 본 발명의 실시예에서, 모두 제2 품질 역치보다 작거나 같은 적어도 하나의 다운링크 참조 신호에 대응되는 복 수의 제2 SINR이 존재할 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정할 수 있다. 또는, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제2 품질 역치보다 작거나 같을 경 우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정할 수 있다. 즉, 단말 기기가 릴랙스 퇴출 준칙을 만족하는 것을 결정한다. 설명해야 할 것은, 제2 SINR이 제2 품질 역치보다 작거나 같을 경우, 참조 신호의 신호 품질이 비교적 차함을 결정할 수 있고, 이때, 릴랙스 퇴출 이벤트는 비셀 신호 품질이 좋은 이벤트 또는 셀 신호 품질이 차한 이벤트 라고 할 수도 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 프로토콜 약정을 통해, 이벤트 Event R2(릴랙스 진입 이벤트 및 릴랙스 퇴출 이 벤트를 포함함)를 포함할 수 있다. 일 예시로서, 릴랙스 퇴출 이벤트, 예를 들면 비셀 신호 품질이 좋은 이벤트 또는 셀 신호 품질이 차한 이벤트 에 대해, Event R2-2를 표기할 수 있고, Event R2-2는 신호 품질이 좋은 준칙을 통해 결정될 수 있다. 즉 서비 스 셀에 복수의 RS(즉 참조 신호)가 설정되었을 경우, 각 RS를 측정할 수 있고, 측정하여 획득된 RS에 대응되는 SINR과 역치를 비교하고, 단말 기기가 신호 품질이 좋은 준칙을 만족하는지 여부를 결정한다. 나아가, 설정 시간 T1 내에, 단말 기기가 신호 품질이 좋은 준칙을 만족하는지 여부를 결정할 수 있다. 실시예11에서, 설정 시간 T1내에, 임의의 RS가 모두 측정값 SINRmeasured<제2 품질 역치(Qout + Offset2)를 만족할 경우, 단말 기기가 신호 품질이 좋은 준칙을 만족하지 않은 것을 결정하고, 당해 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트 또는 비셀 신호 품질이 좋은 이벤트 또는 셀 신호 품질이 차한 이벤트인 것 을 결정한다. 실시예12에서, 설정 시간 T1 내에, 모든 RS가 측정값 SINRmeasured<제2 품질 역치(Qout + Offset2)를 만족할 경우, 단말 기기는 신호 품질이 좋은 준칙을 만족하지 않고, 당해 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트 또는 비셀 신호 품질이 좋은 이벤트 또는 셀 신호 품질이 차한 이벤트인 것을 결정한다. 설명해야 할 것은, 상기 각 실시예에 저이동성 준칙 및 신호 품질이 좋은 준칙 중의 하나만 설정된 것을 예로 들고, 실제 응용할 경우, 저이동성 준칙 및 신호 품질이 좋은 준칙을 동시에 설정할 수 있다. 예를 들면, 동시 에 Event R1 및 Event R2를 설정한다. 일 예시로서, 타겟 이벤트가 릴랙스 진입 이벤트일 경우, 2개의 실시예를 동시에 만족해야 하고, 여기서, 일 실 시예는 도 4 또는 도 5에 대응되는 실시예일 수 있고, 다른 실시예는 도 8 또는 도 10에 대응되는 실시예일 수 있다. 일 구현 가능한 방식에서, 기준 정보는 타겟 시간대, 제1 차이 역치 및 역치 지시 정보를 포함할 수 있다. 일 예시에서, 측정값은 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 RSRP, 또는, 타겟 시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함한다. 측정값은 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제1 SINR를 더 포함한다. 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정할 수 있고, 적어도 하나의 제1 RSRP에 대응 되는 제1 차이가 모두 기준 정보의 제1 차이 역치보다 작은 것에 응답하여, 단말 기기가 저이동성 준칙을 만족 하는 것을 결정한다. 단말 기기가 저이동성 준칙을 만족할 경우, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는지 여부를 판단할 수도 있다. 예를 들면, 복수의 제1 SINR이 모두 제1 품질 역치(여기서, 제1 품질 역치는 역치 지시 정보에 따라 결정됨)보다 큰 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는 것을 결정하고, 또는, 적어 도 하나의 제1 품질 역치보다 큰 제1 SINR이 존해하는 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는 것을 결정한다. 단말 기기가 저이동성 준칙 및 셀 신호 품질이 좋은 준칙을 동시에 만족할 경우, 타겟 이벤트가 릴랙스 진입 이 벤트인 것을 결정한다. 다른 예시에서, 측정값은 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나 의 제1 RSRP, 또는, 타겟 시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함한다. 측정값은 설정 시간 내에 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 SINR을 포함할 수도 있다. 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정할 수 있고, 적어도 하나의 제1 RSRP에 대응 되는 제1 차이가 모두 기준 정보의 제1 차이 역치보다 작은 것에 응답하여, 단말 기기가 저이동성 준칙을 만족 하는 것을 결정한다. 단말 기기가 저이동성 준칙을 만족할 경우, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는지 여부를 판단할 수도 있다. 예를 들면, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제1 품질 역치(여기서, 제1 품질 역치는 역치 지시 정보에 따라 결정됨)보다 큰 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는 것을 결정하고, 또는, 모두 제1 품질 역치보다 큰 적어도 하나의 다운링크 참조 신호에 대응되는 복수 의 제2 SINR이 존재하는 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는 것을 결정한다. 단말 기기가 저이동성 준칙 및 셀 신호 품질이 좋은 준칙을 동시에 만족할 경우, 타겟 이벤트가 릴랙스 진입 이 벤트인 것을 결정한다. 다른 예시에서, 측정값은 타겟 시간대(TSearchDeltaP) 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 RSRP, 또는, 타겟 시간대(TSearchDeltaP) 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함한다. 또한, 측정값은 타겟 시간대 후의 설정 시간(T1) 내에서 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 설정 시간(T1) 내에서 복수의 다운링크 참조 신호 를 측정하여 획득된 복수의 제2 RSRP를 더 포함한다. 또한, 측정값은 복수의 다운링크 참조 신호를 측정하여 획 득된 복수의 제1 SINR을 더 포함한다. 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정할 수 있고, 적어도 하나의 제1 RSRP에 대응 되는 제1 차이가 모두 기준 정보의 제1 차이 역치보다 작은 것에 응답하여, 복수의 제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정하고, 복수의 제2 RSRP에 대응되는 제2 차이가 모두 제1 차이 역치보다 작은 것에 응답 하여, 단말 기기가 저이동성 준칙을 만족하는 것을 결정한다. 단말 기기가 저이동성 준칙을 만족할 경우, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는지 여부를 판단할 수도 있다. 예를 들면, 복수의 제1 SINR이 모두 제1 품질 역치값(여기서, 제1 품질 역치는 역치 지시 정보에 따 라 결정됨)보다 큰 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는 것을 결정하고, 또는, 적 어도 하나의 제1 품질 역치보다 큰 제1 SINR이 존해하는 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙 을 만족하는 것을 결정한다. 단말 기기가 저이동성 준칙 및 셀 신호 품질이 좋은 준칙을 동시에 만족할 경우, 타겟 이벤트가 릴랙스 진입 이 벤트인 것을 결정한다. 또 다른 예시에서, 측정값은 타겟 시간대(TSearchDeltaP) 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득 된 적어도 하나의 제1 RSRP, 또는, 타겟 시간대(TSearchDeltaP) 내에서 적어도 하나의 다운링크 참조 신호를 측정하 여 획득된 적어도 하나의 제1 RSRP를 포함한다. 또한, 측정값은 타겟 시간대 후의 설정 시간(T1) 내에서 다운링 크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 설정 시간(T1) 내에서 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 더 포함한다. 또한, 측정값은 설정 시간 내에서 각각 복수의 다운링 크 참조 신호의 각 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 SINR를 더 포함한다. 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정할 수 있고, 적어도 하나의 제1 RSRP에 대응 되는 제1 차이가 모두 기준 정보의 제1 차이 역치보다 작은 것에 응답하여, 복수의 제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정하고, 복수의 제2 RSRP에 대응되는 제2 차이가 모두 제1 차이 역치보다 작은 것에 응답 하여, 단말 기기가 저이동성 준칙을 만족하는 것을 결정한다. 단말 기기가 저이동성 준칙을 만족할 경우, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는지 여부를 판단할 수도 있다. 예를 들면, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제1 품질 역치보다 큰 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하는 것을 결정하고; 또는, 모두 제1 품질 역치보다 큰 적어도 하나의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재하는 것에 응답하여, 단말 기기가 셀 신 호 품질이 좋은 준칙을 만족하는 것을 결정한다. 단말 기기가 저이동성 준칙 및 셀 신호 품질이 좋은 준칙을 동시에 만족할 경우, 타겟 이벤트가 릴랙스 진입 이 벤트인 것을 결정한다. 예를 들면, Event R1-1(실시예1 또는 실시예2) 및 Event R2-1(실시예5, 실시예6, 실시예9 또는 실시예10)이 동 시에 만족될 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하고, 당해 릴 랙스 진입 이벤트는 셀 신호 품질이 좋은 이벤트 및 저이동성 이벤트일 수 있다. 예를 들면 Event R3-1로 표기 한다. 다른 예시로서, 타겟 이벤트가 릴랙스 퇴출 이벤트일 경우, 2개의 실시예를 동시에 만족할 수 있고, 또는 2개의 실시예 중의 1개만 만족할 수 있다. 여기서, 1개의 실시예는 도 6 또는 도 7에 대응되는 실시예일 수 있고, 다 른 실시예는 도 9 또는 도 11에 대응되는 실시예일 수 있다. 일 구현 가능한 방식에서, 기준 정보는 타겟 시간대, 제2 차이 역치 및 역치 지시 정보를 포함할 수 있다. 일 예시에서, 측정값은 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 RSRP, 또는, 타겟 시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함할 수 있다. 측정값은 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제1 SINR를 더 포함한 다. 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정할 수 있고, 기준 정보의 제2 차이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 존재하는 것에 응답하여, 단말 기기가 저이동성 준 칙을 만족하지 않은 것을 결정한다. 역치 지시 정보에 따라, 제2 품질 역치를 결정할 수 있고, 제2 품질 역치보다 작거나 같은 적어도 하나의 제1 SINR이 존재하는 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하지 않은 것을 결정하고; 또는, 복수의 제1 SINR이 모두 제2 품질 역치보다 작거나 같은 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙 을 만족하지 않은 것을 결정한다. 단말 기기가 저이동성 준칙 및/또는 셀 신호 품질이 좋은 준칙을 만족하지 않을 경우, 타겟 이벤트가 릴랙스 퇴 출 이벤트인 것을 결정한다. 다른 예시에서, 측정값은 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나 의 제1 RSRP, 또는, 타겟 시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함한다. 측정값은 설정 시간 내에서 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 SINR를 더 포함한다. 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정할 수 있고, 기준 정보의 제2 차이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 존재하는 것에 응답하여, 단말 기기가 저이동성 준 칙을 만족하지 않은 것을 결정한다. 역치 지시 정보에 따라, 제2 품질 역치를 결정할 수도 있고, 모두 제2 품질 역치보다 작거나 같은 적어도 하나 의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재하는 것에 응답하여, 단말 기기가 셀 신호 품질이 좋 은 준칙을 만족하지 않은 것을 결정하고; 또는, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제2 품질 역치보다 작거나 같은 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하지 않은 것을 결정 한다. 단말 기기가 저이동성 준칙 및/또는 셀 신호 품질이 좋은 준칙을 만족하지 않을 경우, 타겟 이벤트가 릴랙스 퇴 출 이벤트인 것을 결정한다. 다른 예시에서, 측정값은 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나 의 제1 RSRP, 또는, 타겟 시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함한다. 또한, 측정값은 타겟 시간대 후의 설정 시간 내에서 다운링크 참조 신호를 여러번 측정하 여 획득된 복수의 제2 RSRP, 또는, 설정 시간 내에서 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 더 포함한다. 측정값은 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제1 SINR을 더 포함한다. 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하고, 제2 차이 역치보다 크거나 같은 적어 도 하나의 제1 RSRP에 대응되는 제1 차이가 존재하는 것에 응답하여, 복수의 제2 RSRP와 대응되는 참조값 사이 의 제2 차이를 결정하고, 제2 차이 역치보다 크거나 같은 적어도 하나의 제2 RSRP에 대응되는 제2 차이가 존재 하는 것에 응답하여, 단말 기기는 저이동성 준칙을 만족하지 않은 것을 결정한다. 역치 지시 정보에 따라, 제2 품질 역치를 결정할 수 있고, 제2 품질 역치보다 작거나 같은 적어도 하나의 제1 SINR이 존재하는 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하지 않은 것을 결정하고; 또는, 복수의 제1 SINR이 모두 제2 품질 역치보다 작거나 같은 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙 을 만족하지 않은 것을 결정한다. 단말 기기가 저이동성 준칙 및/또는 셀 신호 품질이 좋은 준칙을 만족하지 않을 경우, 타겟 이벤트가 릴랙스 퇴 출 이벤트인 것을 결정한다. 또 다른 예시에서, 측정값은 타겟 시간대 내에서 다운링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 RSRP, 또는, 타겟 시간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나 의 제1 RSRP를 포함한다. 또한, 측정값은 타겟 시간대 후의 설정 시간 내에서 다운링크 참조 신호를 여러번 측 정하여 획득된 복수의 제2 RSRP, 또는, 설정 시간 내에서 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 더 포함한다. 측정값은 설정 시간 내에서 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신호 를 여러번 측정하여 획득된 복수의 제2 SINR를 더 포함한다. 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하고, 제2 차이 역치보다 크거나 같은 적어 도 하나의 제1 RSRP에 대응되는 제1 차이가 존재하는 것에 응답하여, 복수의 제2 RSRP와 대응되는 참조값 사이 의 제2 차이를 결정하고, 제2 차이 역치보다 크거나 같은 적어도 하나의 제2 RSRP에 대응되는 제2 차이가 존재 하는 것에 응답하여, 단말 기기가 저이동성 준칙을 만족하지 않은 것을 결정한다. 역치 지시 정보에 따라, 제2 품질 역치를 결정할 수도 있고, 모두 제2 품질 역치보다 작거나 같은 적어도 하나 의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재하는 것에 응답하여, 단말 기기가 셀 신호 품질이 좋 은 준칙을 만족하지 않은 것을 결정하고; 또는, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제2 품질 역치보다 작거나 같은 것에 응답하여, 단말 기기가 셀 신호 품질이 좋은 준칙을 만족하지 않은 것을 결정 한다. 단말 기기가 저이동성 준칙 및/또는 셀 신호 품질이 좋은 준칙을 만족하지 않을 경우, 타겟 이벤트가 릴랙스 퇴 출 이벤트인 것을 결정한다. 예를 들면, Event R1-2(실시예3 또는 실시예4) 또는 Event R2-2(실시예7, 실시예8, 실시예11 또는 실시예12) 중의 1개가 만족될 경우, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하고, 당 해 릴랙스 퇴출 이벤트는 비셀 신호 품질이 좋은 이벤트(셀 신호 품질이 차한 이벤트) 및/또는 비저이동성 이벤 트(고저이동성 이벤트)일 수 있다. 예를 들면 Event R3-2로 표기한다. 본 발명의 임의의 실시예에서, 네트워크 기기는 RRC 메시지를 통해 저이동성 준칙에 대응되는 기준 정보를 설정 할 수 있다. 일 예시로서, 저이동성 준칙의 기준 정보는, 타겟 시간대 TSearchDeltaP; 제1 차이 역치 SSearchDeltaP 및/또는 제2 차이 역치 SSearchDeltaP'를 포함한다. 저이동성 준칙에 대해, 단말 기기에 의해 측정하여 획득된 측정값은 L3-RSRP일 수 있다. 일 예시로서, 셀 신호 품질이 좋은 준칙의 기준 정보는 역치 지시 정보(예를 들면 Offset1 및/또는 Offset2)를 포함할 수 있다. 셀 신호 품질이 좋은 준칙에 대해, 단말 기기에 의해 측정하여 획득된 측정값은 L1-SINR일 수 있다. 본 발명의 임의의 실시예에서, 네트워크 기기는 RLM 측정 및/또는 RRM 측정 릴랙스에 사용되는 적어도 하나의 이벤트를 설정할 수 있다. 일 예시로서, 네트워크 기기는 RRM 측정 릴랙스에 사용되는 Event R1을 설정할 수 있다. 즉, Event R1에 대응되 는 릴랙스 진입 준칙을 만족할 경우, RRM 릴랙스 메커니즘을 수행할 수 있고; 네트워크 기기는 RLM 측정 릴랙스 에 사용되는 Event R2를 설정할 수 있다. 즉, Event R2에 대응되는 릴랙스 진입 준칙을 만족할 경우, RLM 릴랙 스 메커니즘을 수행할 수 있고; 네트워크 기기는 RLM 측정 릴랙스에 사용되는 Event R1 + Event R2를 설정할 수 있다. 예를 들면 Event R2 및 Event R1에 대응되는 릴랙스 진입 준칙을 동시에 만족할 경우, RRM 릴랙스 메커니 즘을 수행할 수 있고; 네트워크 기기는 RLM 측정 릴랙스 또는 RRM 측정 릴랙스에 사용되는 Event R3(Event R3- 1, Event R3-2)을 설정할 수 있다. 도 12를 참조하면, 도 12는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 12에 도시된 바와 같이, 당해 측정 방법은 단계1201 내지 1204를 포함하나 이에 한정되지 않는다. 단계1201에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득한다. 단계1202에서, 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정한다. 단계1201 내지 1202는 본 발명의 상기 도 2, 도 3, 도 6 및 도 9 중의 임의의 실시예의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계1203에서, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것에 응답하여, 제1 타이머의 제1 값을 판독하고; 여기서, 제1 타이머는 단말 기기가 가장 최근에 릴랙스 퇴출 이벤트의 트리거링을 판단하는 시각을 기반으로 계시하는데 사용된다. 본 발명의 실시예에서, 제1 타이머는, 단말 기기가 가장 최근에 릴랙스 퇴출 이벤트의 트리거링을 판단하는 시 각을 기반으로 계시하는데 사용된다. 즉, 제1 타이머는 단말 기기가 가장 최근에 릴랙스 퇴출 준칙을 만족하는 것을 판단하는 시각을 기반으로 계시한다. 본 발명의 실시예에서, 타겟 이벤트가 릴랙스 퇴출 이벤트일 경우, 제1 타이머의 값을 판독할 수 있고, 본 발명 에서 제1 값으로 기재한다. 단계1204에서, 제1 값이 제1 계수 역치보다 크고, 제2 타이머가 작동하지 않은 것에 응답하여, 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값을 송신하고; 여기서, 제2 타이머는 단말 기기가 가장 최근에 릴랙스 퇴출 이벤트를 송신하는 시각을 기반으로 계시하는데 사용된다. 본 발명의 실시예에서, 제2 타이머는, 단말 기기가 가장 최근에 릴랙스 퇴출 이벤트를 송신하는 시각을 기반으 로 계시하는데 사용된다. 즉, 단말 기기가 릴랙스 퇴출 이벤트를 트리거링하고, 네트워크 기기에 릴랙스 퇴출 이벤트를 보고하는 시각을 기반으로 계시하는데 사용된다. 여기서, 제2 타이머는 단말 기기가 네트워크 기기에 릴랙스 퇴출 이벤트를 보고할 경우 작동되고, 제1 설정 시간을 작동한 후, 계시를 정지시킨다. 본 발명의 실시예에서, 제1 계수 역치는 사전 설정된 것이다. 예를 들면, 당해 제1 계수 역치는 네트워크 기기 에 의해 설정된 것일 수 있고, 또는 프로토콜 약정을 통해 설정된 것일 수도 있고, 본 발명은 이에 대해 한정하 지 않는다. 본 발명의 실시예에서, 단말 기기가 네트워크 기기에 정보를 빈번하게 보고하는 것을 방지하기 위해, 본 발명에 서, 제1 타이머의 제1 값이 제1 계수 역치(즉 제1 타이머 타임아웃)보다 크고, 제2 타이머가 작동되지 않았을 경우, 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값을 송신할 수 있다. 즉, 단말 기기가 릴랙스 퇴출 이 벤트를 트리거링하는 지속 시간(즉 단말 기기는 릴랙스 퇴출 준칙의 지속 시간을 만족함)이 제1 계수 역치에 도 달하고, 단말 기기가 단기(즉 제1 설정 시간) 내에 네트워크 기기에 릴랙스 퇴출 이벤트를 보고하지 않았을 경 우, 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값을 보고할 수 있다. 설명해야 할 것은, 제2 타이머가 작동될 경우, 당해 단말 기기가 제1 설정 시간 내에 네트워크 기기에 릴랙스 퇴출 이벤트를 보고했었다는 것을 나타내고, 단말 기기가 빈번하게 이벤트를 계산하고 보고하는 것을 방지하기 위해, 본 발명 실시예의 구현 가능한 방식에서, 제1 값이 제1 계수 역치보다 크고, 제2 타이머가 작동될 경우, 단말 기기가 단기 내에 네트워크 기기에 릴랙스 퇴출 이벤트를 보고하였으므로, 단말 기기는 네트워크 기기에 타겟 이벤트(즉 릴랙스 퇴출 이벤트)를 보고하지 않아도 된다. 본 발명 실시예의 구현 가능한 방식에서, 제1 타이머의 제1 값이 제1 계수 역치(즉 제1 타이머가 타임아웃되지 않음)보다 작거나 같을 경우, 단말 기기는 무동작 또는 무응답일 수 있다. 예를 들면, 단말 기기는 네트워크 기 기에 타겟 이벤트(즉 릴랙스 퇴출 이벤트)를 보고하지 않아도 된다. 본 발명의 임의의 실시예에서, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트일 경우, 서비스 셀의 신호 품질이 좋지 않다는 것을 나타내고, 이때, 제2 타이머의 제한을 받지 않을 수도 있다. 즉 제1 타이머 의 제1 값이 제1 계수 역치보다 클 경우, 단말 기기는 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값을 송신할 수 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 설명해야 할 것은, 제1 타이머의 설정은, 설정 시간이 설정되지 않는 경우에 대한 것이고, 제1 타이머의 값에 따라, 네트워크 기기에 릴랙스 퇴출 이벤트를 보고할지 여부를 결정한다. 그러나, 설정 시간이 설정되고, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤트일 경우, 예를 들면, 도 7 또는 도 11에 도시된 실시예에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 퇴출 이벤 트인 것을 결정하고, 단말 기기는 제2 타이머의 작동 여부를 판단할 수 있고, 타겟 이벤트가 릴랙스 퇴출 이벤 트이고 제2 타이머가 작동되지 않았을 경우, 단말 기기는 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값 을 송신할 수 있고; 타겟 이벤트가 릴랙스 퇴출 이벤트이고 제2 타이머가 작동될 경우, 단말 기기는 네트워크 기기에 릴랙스 퇴출 이벤트를 송신하지 않아도 된다. 예를 들면, 단말 기기는 네트워크 기기에만 측정값을 송신 할 수 있다. 또는, 설정 시간이 설정된 경우, 제2 타이머의 제한을 받지 않을 수 있다. 즉, 단말 기기에 의해 트리거링된 타 겟 이벤트가 릴랙스 퇴출 이벤트일 경우, 단말 기기는 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값을 송신할 수 있다. 도 13을 참조하면, 도 13은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 13에 도시된 바와 같이, 당해 측정 방법은 단계1301 내지 1304를 포함하나 이에 한정되지 않는다. 단계1301에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득한다. 단계1302에서, 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한다. 단계1301 내지 130은 본 발명의 상기 도 2, 도 3, 도 4 및 도 8 중의 임의의 실시예의 방식으로써 구현될 수 있 고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계1303에서, 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 제3 타이머의 제1 값을 판독하고; 여기서, 제3 타이머는 단말 기기가 가장 최근에 릴랙스 진입 이벤트의 트리거링을 판단하는 시각을 기반으로 계시하는데 사용된다. 본 발명의 실시예에서, 제3 타이머는, 단말 기기가 가장 최근에 릴랙스 진입 이벤트의 트리거링을 판단하는 시 각을 기반으로 계시하는데 사용된다. 즉, 제3 타이머는 단말 기기가 가장 최근에 릴랙스 진입 준칙을 만족하는 것을 판단하는 시각을 기반으로 계시한다. 본 발명의 실시예에서, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트일 경우, 제3 타이머의 값을 판독할 수 있고, 본 발명에서 제2 값으로 기재한다. 단계1304에서, 제2 값이 제2 계수 역치보다 크고, 제4 타이머가 작동되지 않은 것에 응답하여, 네트워크 기기에 릴랙스 진입 이벤트 및/또는 측정값을 송신하고; 여기서, 제4 타이머는 단말 기기가 가장 최근에 릴랙스 진입 이벤트를 송신한 시각을 기반으로 계시하는데 사용된다. 본 발명의 실시예에서, 제4 타이머는, 단말 기기가 가장 최근에 릴랙스 진입 이벤트를 송신한 시각을 기반으로 계시하는데 사용된다. 즉, 제4 타이머는, 단말 기기가 가장 최근에 릴랙스 진입 이벤트를 트리거링하고, 네트워 크 기기가 릴랙스 진입 이벤트를 보고하는 시각을 기반으로 계시하는데 사용된다. 여기서, 제4 타이머는 단말 기기가 네트워크 기기에 릴랙스 진입 이벤트를 보고할 경우 작동되고, 제2 설정 시간이 작동된 후, 계시를 정지 시킨다. 본 발명의 실시예에서, 제2 계수 역치는 사전 설정된 것이다. 예를 들면, 당해 제2 계수 역치는 네트워크 기기 에 의해 설정된 것일 수 있고, 또는 프로토콜을 통해 약정될 수도 있고, 본 발명에서 이에 대해 한정하지 않는 다. 본 발명의 실시예에서, 단말 기기가 네트워크 기기에 정보를 빈번하게 보고하는 것을 방지하기 위해, 본 발명에 서, 제3 타이머의 제2 값이 제2 계수 역치(즉 제3 타이머 타임아웃)보다 크고, 제4 타이머가 작동되지 않았을 경우, 네트워크 기기에 릴랙스 상태에 들어가는 것 및/또는 측정값을 보고한다. 즉, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는 지속 시간(즉 단말 기기는 릴랙스 진입 준칙의 지속 시간을 만족함)이 제2 계수 역치에 도달하고, 단말 기기가 단기(즉 제2 설정 시간) 내에 네트워크 기기에 릴랙스 진입 이벤트를 보고하지 않았을 경우, 네트워크 기기에 릴랙스 상태에 들어가는 것 및/또는 측정값을 보고할 수 있다. 설명해야 할 것은, 제4 타이머가 작동될 경우, 당해 단말 기기가 제2 설정 시간 내에 네트워크 기기에 릴랙스 진입 이벤트를 보고했었다는 것을 나타내고, 단말 기기가 빈번하게 이벤트를 계산하고 보고하는 것을 방지하기 위해, 본 발명 실시예의 구현 가능한 방식에서, 제2 값이 제2 계수 역치보다 크고, 제4 타이머가 작동될 경우, 단말 기기가 단기 내에 네트워크 기기에 릴랙스 진입 이벤트를 보고하였으므로, 단말 기기는 네트워크 기기에 타겟 이벤트(즉 릴랙스 퇴출 이벤트)를 보고하지 않아도 된다. 본 발명 실시예의 구현 가능한 방식에서, 제3 타이머의 제2 값이 제2 계수 역치(즉 제3 타이머가 타임아웃되지 않음)보다 작거나 같을 경우, 단말 기기는 무동작 또는 무응답일 수 있다. 예를 들면, 단말 기기는 네트워크 기 기에 타겟 이벤트(즉 릴랙스 진입 이벤트)를 보고하지 않아도 된다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 설명해야 할 것은, 제3 타이머의 설정은, 설정 시간이 설정되지 않는 경우에 대한 것이고, 제3 타이머의 값에 따라, 네트워크 기기에 릴랙스 진입 이벤트를 보고할지 여부를 결정한다. 그러나, 설정 시간이 설정되고, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트일 경우, 예를 들면, 도 5 또는 도 10에 도시된 실시예에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤 트인 것을 결정하고, 단말 기기는 제4 타이머의 작동 여부를 판단할 수 있고, 타겟 이벤트가 릴랙스 진입 이벤 트이고 제4 타이머가 작동되지 않았을 경우, 단말 기기는 네트워크 기기에 릴랙스 진입 이벤트 및/또는 측정값 을 송신할 수 있고; 타겟 이벤트가 릴랙스 진입 이벤트이고 제4 타이머가 작동될 경우, 단말 기기는 네트워크 기기에 릴랙스 진입 이벤트를 송신하지 않아도 된다. 예를 들면, 단말 기기는 네트워크 기기에만 측정값을 송신 할 수 있다. 또는, 설정 시간이 설정된 경우, 제4 타이머의 제한을 받지 않을 수 있다. 즉, 단말 기기에 의해 트리거링된 타 겟 이벤트가 릴랙스 진입 이벤트일 경우, 단말 기기는 네트워크 기기에 릴랙스 진입 이벤트 및/또는 측정값을 송신할 수 있다. 도 14를 참조하면, 도 14는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의기술 수단과 함께 수행될 수도 있다. 도 14에 도시된 바와 같이, 당해 측정 방법은 단계1401 내지 1403을 포함하나 이에 한정되지 않는다. 단계1401에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득한다. 단계1402에서, 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하고, 여기서, 타겟 이벤트는 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 단계1401 내지 1402는 각각 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계1403에서, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것에 응답하여, 네트워크 기기에 릴랙스 퇴출 이벤트 및/또 는 측정값을 송신하고, 또는, 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 네트워크 기기에 릴랙스 진 입 이벤트 및/또는 측정값을 송신한다. 본 발명의 실시예에서, 타이머의 값에 따라, 네트워크 기기에 타겟 이벤트 및/또는 측정값을 보고할지 여부를 결정한다. 예를 들면, 단말 기기가 타겟 이벤트를 트리거링할 경우, 자동으로 네트워크 기기에 타겟 이벤트 및/ 또는 측정값을 보고한다. 즉, 타겟 이벤트가 릴랙스 퇴출 이벤트일 경우, 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값을 송신할 수 있고, 타겟 이벤트가 릴랙스 진입 이벤트일 경우, 네트워크 기기에 릴랙스 진입 이 벤트 및/또는 측정값을 송신할 수 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 도 15를 참조하면, 도 15는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 15에 도시된 바와 같이, 당해 측정 방법은 단계를 포함하나 이에 한정되지 않는다. 단계1501에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득한다. 단계1502에서, 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정한다. 단계1501 내지 1502는 각각 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계1503에서, 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 단말 기기가 릴랙스 상태에서 타겟 측정을 주기적으로 수행하는 제1 측정 간격을 결정한다. 본 발명의 실시예에서, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트일 경우, 당해 단말 기 기가 선호하는 릴랙스 상태에서 타겟 측정을 주기적으로 수행하는 제1 측정 간격을 결정한다. 예를 들면, 단말 기기가 릴랙스 상태에 들어가지 않았을 경우, 당해 단말 기기는 비교적 작은 측정 간격으로써 타겟 측정을 주기적으로 수행할 수 있다. 예를 들면 5초에 한 번씩 측정하고, 단말 기기가 릴랙스 상태에 들어 갔을 경우, 단말 기기는 비교적 큰 측정 간격으로써 타겟 측정을 주기적으로 수행할 수 있다. 예를 들면 10초에 한 번씩 측정한다. 즉, 제1 측정 간격은 10초일 수 있다. 단계1504에서, 네트워크 기기에 제1 측정 간격에 대응되는 간격 지시 정보를 송신하고, 여기서, 간격 지시 정보 는 제1 측정 간격과 네트워크 기기에 의해 설정된 제2 측정 간격 사이의 비례계수를 포함한다. 본 발명의 실시예에서, 단말 기기는 네트워크 기기에 제1 측정 간격에 대응되는 간격 지시 정보를 송신하고, 여 기서, 당해 간격 지시 정보는 제1 측정 간격과 네트워크 기기에 의해 설정된 제2 측정 간격 사이의 비례계수를 포함할 수 있다. 네트워크 기기는 간격 지시 정보를 수신한 후, 간격 지시 정보의 비례계수에 따라, 단말 기기 에 대응되는 측정 간격을 설정할 수 있다. 예를 들면 단말 기기의 측정 간격을 제1 측정 간격으로 설정한다. 여전히 상기 예시를 예로 들고, 단말 기기에서 선호하는 제1 측정 간격이 10초이고, 네트워크 기기에 의해 설정 된 제2 측정 간격이 5초일 경우, 비례계수는 2이고, 네트워크 기기는 비례계수에 따라, 제2 측정 간격을 10초로 조정할 수 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 도 16을 참조하면, 도 16은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 단말 기기에 의해 수행될 수 있다. 당해 측정 방법은 단독으로 수행될 수 있고, 본 발명의 임의의 실시예와 결합하거나 실시예의 구현 가능한 방식과 함께 수행될 수 있고, 관련 기술의 임의의 기술 수단과 함께 수행될 수도 있다. 도 16에 도시된 바와 같이, 당해 측정 방법은 단계1601 내지 1605를 포함하나 이에 한정되지 않는다. 단계1601에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득한다. 단계1602에서, 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한다. 단계1603에서, 네트워크 기기에 릴랙스 진입 이벤트 및/또는 측정값을 송신한다. 단계1601 내지 1603은 각각 본 발명 각 실시예의 임의의 방식으로써 구현될 수 있고, 본 발명의 실시예는 이에 대해 한정하지 않고, 더는 설명하지 않는다. 단계1604에서, 네트워크 기기에서 송신된 릴랙스 명령을 수신한다. 본 발명의 실시예에서, 네트워크 기기는 단말 기기에서 송신된 릴랙스 진입 이벤트를 수신한 후, 단말 기기에 릴랙스 명령을 송신할 수 있고, 당해 릴랙스 명령은 단말 기기가 릴랙스 상태에 들어가도록 제어하는데 사용된 다. 단계1605에서, 릴랙스 명령에 응답하여, 단말 기기가 릴랙스 상태에 들어가도록 제어한다. 본 발명의 실시예에서, 단말 기기는 네트워크 기기에서 송신된 릴랙스 명령을 수신한 후, 당해 릴랙스 명령에 응답하여, 릴랙스 상태에 들어갈 수 있다. 본 발명 실시예의 구현 가능한 방식에서, 릴랙스 명령은 타겟 비례계수를 더 포함할 수 있고, 여기서, 당해 타 겟 비례계수는 네트워크 기기가 단말 기기에서 송신된 간격 지시 정보의 비례계수에 따라 생성된 것일 수 있고, 또는, 당해 타겟 비례계수는 네트워크 기기에 의해 자동으로 생성된 것일 수 있고, 본 발명에서 이에 대해 한정 하지 않는다. 단말 기기는 릴랙스 상태에 들어간 후, 릴랙스 명령의 타겟 비례계수 및 네트워크 기기에 의해 설 정된 제2 측정 간격에 따라, 타겟 측정 간격을 결정할 수 있다. 예를 들면, 타겟 비례계수와 제2 측정 간격의 승적을, 타겟 측정 간격으로 할 수 있음으로, 단말 기기는 릴랙스 상태에서, 타겟 측정 간격에 따라, 타겟 측정을 주기적으로 수행할 수 있다. 본 발명 실시예의 측정 방법에서, RLM 측정 및/또는 RRM 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정 값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트 상태를 결정하고, 여 기서, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리 거링하였는지 여부를 효과적으로 결정하도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링 할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항 속력을 향상시킬 수 있다. 또한, 타겟 측정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 본 발명의 임의의 실시예에서, 단말 기기는 단말 보조 정보UEAssistanceInformation(UAI)를 통해, 네트워크 기 기에 타겟 이벤트를 보고할 수 있다. 일 예시로서, 네트워크 기기는 RRC 메시지(예를 들면 RRC Reconfiguration=> otherConfig)를 통해, 단말 기기 가 릴랙스 이벤트 검출(즉 타겟 이벤트 검출)을 수행해야 하는지 여부를 설정하고, 관련 타이머값을 설정할 수 있다. 또한, 네트워크 기기는 단말 기기가 선호하는 릴랙스 파라미터를 보고하는 것을 허용하는지 여부를 설정 할 수도 있고, 본 발명에서 제1 측정 간격에 대응되는 간격 지시 정보로 기재한다. 예를 들면, RRC 메시지는 하기의 정보를 포함할 수 있다. OtherConfig::= SEQUENCE { ... rlm-ReportConfig CHOICE { release NULL, setup SEQUENCE{ rlmReportTimer ENUMERATED {쪋}, rlmReportPreferRelax ENUMERATED {setup} } ... } 여기서, rlmReportTimer는 하기의 내용에서, UAI에 의한 빈번한 보고를 방지하는 제2 타이머 또는 제4 타이머이 고; rlmReportPreferRelax는 하기의 내용에서 UAI에 의해 보고된 파라미터이다. 여기서, 단말 기기는 획득된 측정값, 타겟 이벤트 등 정보를 측정하고, RLM 리포트(rlmReport)에 포함될 수 있 다. 일 예시로서, 단말 기기는 UAI 초기화 및 구체적인 내용을 보고할 수 있다. 단말 기기는 트리거링된 타겟 이벤트(릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트)에 따라, 보고의 여부를 결 정할 수 있고, 여기서, 보고 유형은 각 단말 기기(per UE) 또는 각 서비스 셀 그룹(per CG)일 수 있다. 여기서, 단말 기기가 per UE에 따라 보고할 경우, 마스터 서비스 셀(PCell)의 참조 신호의 SINR에 따라, 당해 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인지 릴랙스 퇴출 이벤트인지를 결정하고; 단말 기기가 per CG에 따라 보고할 경우, 마스터 서비스 셀(PCell) 또는 프라이머리 세컨더리 서비스 셀(PScell)의 참조 신호의 SINR에 따라, 당해 단말 기기에 의해 트리거링된 타겟 이벤트가 릴랙스 진입 이벤트인지 릴랙스 퇴 출 이벤트인지를 결정한다. 즉 본 발명의 임의의 실시예에서, 타겟 이벤트의 보고 유형이 단말 기기일 경우, 네트워크 기기에 단말 기기에 대응되는 마스터 서비스 셀의 측정값 및/또는 타겟 이벤트를 송신할 수 있다. 즉 타겟 이벤트의 보고 유형이 단 말 기기일 경우, 단말 기기는 마스터 서비스 셀의 다운링크 참조 신호를 측정할 수 있고, 측정값에 따라 단말 기기가 위치하는 타겟 이벤트를 결정함으로, 네트워크 기기에 보고된 정보는 마스터 서비스 셀의 측정값 및/또 는 타겟 이벤트이다. 본 발명의 임의의 실시예에서, 타겟 이벤트의 보고 유형이 셀 그룹일 경우, 네트워크 기기에 상기 단말 기기에 대응되는 셀 그룹의 마스터 서비스 셀의 측정값 및/또는 타겟 이벤트를 송신할 수 있고, 또는, 네트워크 기기에 상기 단말 기기에 대응되는 셀 그룹의 프라이머리 세컨더리 서비스 셀의 측정값 및/또는 타겟 이벤트를 송신한 다. 예를 들면, 셀 그룹이 MCG일 경우, 단말 기기는 MCG의 마스터 서비스 셀의 다운링크 참조 신호를 측정할 수 있 고, 측정값에 따라 단말 기기가 위치하는 타겟 이벤트를 결정함으로, 네트워크 기기에 보고된 정보는 단말 기기 에 대응되는 MCG의 마스터 서비스 셀의 측정값 및/또는 타겟 이벤트이다. 셀 그룹이 SCG일 경우, 단말 기기는 SCG의 프라이머리 세컨더리 서비스 셀의 다운링크 참조 신호를 측정할 수 있고, 측정값에 따라 단말 기기가 위치하는 타겟 이벤트를 결정함으로, 네트워크 기기에 보고된 정보는 단말 기 기에 대응되는 SCG의 프라이머리 세컨더리 서비스 셀의 측정값 및/또는 타겟 이벤트이다. 여기서, 저이동성 준칙 또는 셀 신호 품질이 좋은 준칙을 설정하였을 경우, UAI 메시지의 보고는 메시지로써 보 고할 수 있다. 즉, 당해 UAI 메시지는 셀 신호 품질이 좋은 이벤트 또는 비셀 신호 품질이 좋은 이벤트, 또는, 저이동성 이벤트 또는 비저이동성 이벤트를 보고하는데 사용된다. 저이동성 준칙 및 셀 신호 품질이 좋은 준칙을 동시에 설정하였을 경우, UAI 메시지의 보고는 각각 분리된 2개 의 메시지일 수 있고, 각각 보고하고, 그 중의 하나의 UAI 메시지는 셀 신호 품질이 좋은 이벤트 또는 비셀 신 호 품질이 좋은 이벤트를 보고하는데 사용되고, 다른 메시지는 저이동성 이벤트 또는 비저이동성 이벤트를 보고 하는데 사용된다. 또는, UAI 메시지의 보고는 하나의 메시지로써 보고할 수 있다. 예를 들면, 당해 UAI 메시지 는 셀 신호 품질이 좋은 이벤트 또는 비셀 신호 품질이 좋은 이벤트를 보고하는데 사용되고, 저이동성 이벤트 또는 비저이동성 이벤트를 보고하는데 사용된다. 1)UAI 초기화는, 네트워크 기기에서 단말 기기가 타겟 이벤트를 보고하는 것을 설정하였을 경우, 즉 네트워크 기기에서 단말 기 기가 릴랙스 이벤트를 보고하는 것을 설정하였을 경우, 단말 기기에서 릴랙스 퇴출 이벤트(제1 타이머 타임아웃)를 검출하고 제2 타이머가 작동되지 않았을 경우, 제2 타이머의 값을 네트워크 기기에 의해 설정된 타 이머값으로 설정하고, 제2 타이머를 작동하며; UAI 전송을 초기화하고, 다음 단계에 따라 네트워크 기기에 내용 을 보고한다. 단말 기기에서 릴랙스 진입 이벤트(제3 타이머 타임아웃)를 검출하고 제4 타이머가 작동되지 않았 을 경우, 제4 타이머의 값을 네트워크 기기에 의해 설정된 타이머값으로 설정하고, 제4 타이머를 작동하며; UAI 전송을 초기화하고, 다음 단계에 따라 네트워크 기기에 정보를 보고한다. 2)보고 내용: 단말 기기는 UEAssistanceInformation을 통해, 네트워크 기기에 RLM 리포트를 보고할 수 있고, 당해 RLM 리포트 는, 릴랙스 퇴출 이벤트, 릴랙스 진입 이벤트, 단말 기기에서 선호하는 릴랙스 파라미터(즉 제1 측정 간격에 대 응되는 간격 지시 정보), 측정값 등을 포함하나 이에 한정되지 않는다. 예를 들면, 단말 기기가 RLM 리포트를 제공하도록 설정되고, 제1 타이머가 타임아웃될 경우, 단말 기기 보고를 자동으로 트리거링하고, 보고된 타겟 이벤트는 릴랙스 퇴출 이벤트이다. 즉, 단말 기기가 위치하는 타겟 상태는 릴랙스 퇴출 상태이다. 제3 타이머가 타임아웃될 경우, 단말 기기 보고를 자동으로 트리거링하고, 보고된 타겟 이벤트는 릴랙스 진입 이벤트이다. 즉, UAI 메시지를 통해 보고할 경우, 릴랙스 퇴출 이벤트는 제2 타이머 또는 제4 타이머의 제한을 받지 않아도 된다. 단말 기기가 보고 측정 결과를 보고하도록 설정될 경우, 단말 기기는 네트워크 기기에 측정값을 보고할 수 있다. 단말 기기가 선호하는 릴랙스 파라미터(PreferRelax)를 보고하도록 설정될 경우, 단말 기기는 네트워크 기기에 제1 측정 간격에 대응되는 간격 지시 정보를 보고할 수 있다. 여기서, 타이머에 관련된 정의는 표 1에 도시된 바와 같다. 표 1 타이머 설명 시작 정지 타임아웃 제1 타이머 (퇴출)처벌 타이머Punish timer, 단 말 기기가 채널 상태의 불안정 상태에서 릴랙스 상태 진입/퇴 출을 방지; 적용 범위: 프라이머리 셀 및/ 또는 세컨더리 셀; 네트워크 기기를 통해 송신을 디스플레이하고, 또는, 프로토 콜을 기반으로 약정; 릴랙스 퇴출 준칙을 만족하는 시각릴랙스 진입 준칙을 만족; 또 는 트리거링 전환; 또는 연결 재구축 단계 초기화; UAI 단계 초 기화 제3 타이머 (진입)릴랙스 진입 준칙을 만족하는 시각릴랙스 퇴출 준칙 만족; 또는 트리거링 전환; 또는 연결 재구축 단계 초기화; UAI 단계 초 기화 제2 타이머금지 타이머Prohibit timer, UAI 보고 빈도를 한정; 적용 범위: 프라이머리 셀및/ 또는 세컨더리 셀; 네트워크 기기를 통새 송신을 디스플레이하고, 또는, 프로토 콜을 기반으로 약정; 릴랙스 퇴출 이벤트 를 포함하는 RLM 리 포트의 UAI 메시지를 전송할 경우연결 재구축 단계 초기화; 무동작 제4 타이머 릴랙스 진입 이벤트 를 포함하는 RLM 리 포트의 UAI 메시지를 전송할 경우연결 재구축 단계 초기화; 무동작 설명해야 할 것은, 표 1의 각 요소 각 대응관계는, 모두 단독 존재하는 것이고; 당해 요소, 대응관계는 예시적 으로 동일한 표에 열거되어 있지만, 표의 모든 요소, 대응관계가 반드시 표 1에 도시된 바와 같이 동시에 존재 해야 하는 것을 나타내지 않는다. 그 중의 각 요소의 값 및 각 대응되는 관계는, 표 1의 어떠한 요소값 또는 대 응관계에 의존하지 않는다. 따라서 당업자는, 당해 표 1 각 요소의 값, 각 대응관계는, 모두 독립된 실시예이다. 표 1에서, UAI에 저이동성 준칙이 설정될 경우, 단말 기기는 Prohibit timer의 제한하에, 네트워크 기기에 저이 동성 이벤트 또는 비저이동성 이벤트를 보고한다. UAI에 셀 신호 품질이 좋은 준칙이 설정되었을 경우, 단말 기기는 Prohibit timer의 제한하에, 네트워크 기기에 셀 신호 품질이 좋은 이벤트 또는 비셀 신호 품질이 좋은 이벤트를 보고한다. UAI에 저이동성 준칙 및 셀 신호 품질이 좋은 준칙이 설정되었을 경우, 단말 기기는 Prohibit timer의 제한하에, 네트워크 기기에 셀 신호 품질이 좋은 이벤트 및 저이동성 이벤트를 보고하지만, 임의의 준칙이 만족 되지 않을 경우, 릴랙스 퇴출 이벤트를 보고한다. 본 발명의 임의의 실시예에서, 단말 기기는 RRC 메시지를 통해 타겟 이벤트 및/또는 측정값을 보고한다. 여기서, 보고 유형은 per UE/CG일 수 있다. 일 예시로서, 네트워크 기기는 RRC 메시지, 예를 들면 RRC 재설정RRCReconfigurtion 메시지를 통해, 측정 설정 measConfig를 단말 기기에 통지한다. 여기서, 측정 설정은 측정 대상(measObject), 보고 설정(reportConfig) 및 측정 ID(measId)를 바인딩할 수 있다. 측정에 의해 설정된 측정 대상은 단말 기기의 서비스 셀일 수 있고; 측정에 의해 설정된 보고 설정은 이벤트를 기반으로 트리거링된 것이다. 단말 기기는 측정 설정을 수신하였을 경우, 해당 측정 프로세스를 수행할 수 있고, 측정값이 상기 이벤트에 대 응되는 조건을 만족할 경우, 자동으로 보고를 트리거링하고, 보고 정보는, 측정값을 포함하고, 및/또는 만족된 것은 이벤트의 진입 조건이다. 즉, 타겟 이벤트는 릴랙스 진입 이벤트이다. 측정값이 상기 이벤트에 대응되는 퇴출 조건을 만족할 경우, 자동으로 보고를 트리거링하고, 보고 정보는, 측정값을 포함하고, 및/또는, 만족된 것은 퇴출 조건이다. 즉, 타겟 이벤트는 릴랙스 퇴출 이벤트이다. 도 17을 참조하면, 도 17은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 당해 측정 방법은 도 1에 도시된 통신 시스템의 네트워크 기기에 의해 수행될 수 있다. 도 17에 도시된 바와 같이, 당해 측정 방법은 단계1701을 포함하나 이에 한정되지 않는다. 단계1701에서, 단말 기기에서 송신된 타겟 이벤트 및/또는 측정값을 수신하고, 여기서, 측정값은 타겟 측정의 측정값이고, 타겟 측정은 무선 링크 모니터링(RLM) 측정 및/또는 무선 자원 관리(RRM) 측정을 포함하고; 타겟이벤트는 측정값 및 타겟 측정에 대응되는 기준 정보에 따라 결정된 것이고, 타겟 이벤트는, 릴랙스 진입 이벤 트 또는 릴랙스 퇴출 이벤트를 포함한다. 본 발명 실시예의 구현 가능한 방식에서, 네트워크 기기는 단말 기기에 기준 정보를 송신할 수도 있다. 본 발명 실시예의 구현 가능한 방식에서, 네트워크 기기는 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 단말 기기에 릴랙스 명령을 송신할 수 있고, 여기서, 릴랙스 명령은 단말 기기가 릴랙스 상태에 들어가도록 제 어하는데 사용된다. 설명해야 할 것은, 상기 임의의 실시예에서 단말 기기에 의해 수행된 측정 방법에 대한 설명은, 당해 네트워크 기기에 의해 수행되는 측정 방법에도 적용되고, 당해 원리는 유사하고, 여기서 설명하지 않는다. 본 발명 실시예의 측정 방법에서, 네트워크 기기를 통해 단말 기기에서 송신된 타겟 이벤트 및/또는 측정값을 수신하고, 여기서, 측정값은 타겟 측정의 측정값이고, 타겟 측정은 RLM 측정 및/또는 RRM 측정을 포함하고; 타 겟 이벤트는 측정값 및 타겟 측정에 대응되는 기준 정보에 따라 결정된 것이고, 타겟 이벤트는, 릴랙스 진입 이 벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 이리하여, 단말 기기에 의해 타겟 측정의 측정값 및 타겟 측정에 대 응되는 기준 정보에 따라, 당해 단말 기기가 릴랙스 진입 이벤트를 트리거링하였는지 여부를 효과적으로 결정하 도록 구현할 수 있음으로, 단말 기기가 릴랙스 진입 이벤트를 트리거링할 경우, 네트워크 기기에 당해 릴랙스 진입 이벤트를 보고하여, 릴랙스 메커니즘을 수행하고, 단말 기기의 항속력을 향상시킬 수 있다. 또한, 타겟 측 정에 대응되는 기준 정보 및 타겟 측정의 측정값으로써, 단말 기기가 릴랙스 진입 이벤트를 트리거링하는지 릴 랙스 퇴출 이벤트를 트리거링하는지를 결정하고, 이벤트 결정 결과의 정확성 및 신뢰성을 향상시킬 수 있다. 설명해야 할 것은, 상기 구현 가능한 방식은 단독으로 수행될 수 있고, 결합하여 함께 수행될 수도 있고, 본 발 명의 실시예는 이에 대해 한정하지 않는다. 상기 본 발명에서 제공하는 실시예에서, 사용자 기기 및 네트워크 기기의 각도에서 본 발명의 실시예에서 제공 하는 방법을 설명한다. 상기 본 발명의 실시예에서 제공하는 방법의 각 기능을 구현하기 위해, 사용자 기기 및 네트워크 기기는 하드웨어 구조, 소프트웨어 모듈, 하드웨어 구조, 소프트웨어 모듈, 또는 하드웨어 구조와 소 프트웨어 모듈을 포함하는 형식으로 상기 각 기능을 구현한다. 상기 각 기능의 어느 하나의 기능은 하드웨어 구 조, 소프트웨어 모듈, 또는 하드웨어 구조와 소프트웨어 모듈의 방식으로 수행될 수 있다. 도 18을 참조하면, 본 발명의 실시예에 따른 측정 장치의 구조 개략도이다. 도 18에 도시된 측정 장치 는 처리 유닛 및 송수신 유닛을 포함한다. 당해 송수신 유닛은 송신 유닛 및/또는 수신 유닛을 포함하고, 송신 유닛은 송신 기능을 구현하는데 사용되고, 수신 유닛은 수신 기능을 구현하는데 사용되 고, 송수신 유닛은 송신 기능 및/또는 수신 기능을 구현할 수 있다. 측정 장치는 단말 기기일 수 있고, 단말 기기의 장치일 수도 있고, 단말 기기와 매칭하여 사용 가능한 장 치일 수 있으며, 또는, 측정 장치는 네트워크 기기일 수 있고, 네트워크 기기의 장치일 수 있고, 네트워크 기기와 매칭하여 사용 가능한 장치일 수 있다. 측정 장치가 단말 기기일 경우, 처리 유닛은, 무선 링크 모니터링(RLM) 측정 및/또는 무선 자원 관 리(RRM) 측정을 포함하는 타겟 측정의 측정값을 획득하고; 측정값 및 타겟 측정에 대응되는 기준 정보에 따라, 단말 기기에 의해 트리거링된 타겟 이벤트를 결정하는데 사용되고, 여기서, 타겟 이벤트는 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 일부 실시예에서, 처리 유닛은, 구체적으로 단말 기기의 서비스 셀의 다운링크 참조 신호를 측정하여, 측 정값을 획득하는데 사용된다. 일부 실시예에서, 기준 정보는 네트워크 기기에서 송신된 것이고, 마스터 서비스 셀 및/또는 세컨더리 서비스 셀에 적용된다. 일부 실시예에서, 측정값은 타겟 시간대 후의 설정 시간 내에서 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 설정 시간 내에서 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 포 함하고, 처리 유닛은, 구체적으로 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하 고; 상기 제1 RSRP에 대응되는 참조값은, 상기 단말 기기가 상기 제1 RSRP를 측정하기 전에 측정 획득된 것이고; 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 모두 제1 차이 역치보다 작은 것에 응답하여, 타겟 이 벤트가 릴랙스 진입 이벤트인 것을 결정한다. 일부 실시예에서, 측정값은 타겟 시간대 후의 설정 시간 내에서 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 설정 시간 내에서 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 포 함하고; 처리 유닛은, 구체적으로 복수의 제1 RSRP에 대응되는 제1 차이가 모두 제1 차이 역치보다 작은 것에 응답하여, 복수의 제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정하고; 상기 제2 RSRP에 대응되는 참 조값은, 상기 단말 기기가 상기 제2 RSRP를 측정하기 전에 측정하여 획득된 것이고; 복수의 제2 RSRP에 대응되 는 제2 차이가 모두 제1 차이 역치보다 작은 것에 응답하여, 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한 다. 일부 실시예에서, 기준 정보는, 타겟 시간대 및 제2 차이 역치를 포함하고, 측정값은 타겟 시간대 내에서 다운 링크 참조 신호를 적어도 한 번 측정하여 획득된 적어도 하나의 제1 참조 신호 수신 전력(RSRP), 또는, 타겟 시 간대 내에서 적어도 하나의 다운링크 참조 신호를 측정하여 획득된 적어도 하나의 제1 RSRP를 포함하고; 처리 유닛은, 구체적으로 적어도 하나의 제1 RSRP와 대응되는 참조값 사이의 제1 차이를 결정하고; 상기 제1 RSRP에 대응되는 참조값은, 상기 단말 기기가 상기 제1 RSRP를 측정하기 전에 측정하여 획득된 것이고; 제2 차 이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제1 차이가 존재하는 것에 응답하여, 타겟 이벤트 가 릴랙스 퇴출 이벤트인 것을 결정한다. 일부 실시예에서, 측정값은 타겟 시간대 후의 설정 시간 내에서 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 RSRP, 또는, 설정 시간 내에서 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제2 RSRP를 포 함하고; 처리 유닛은, 구체적으로 제2 차이 역치보다 크거나 같은 적어도 하나의 제1 RSRP에 대응되는 제 1 차이가 존재하는 것에 응답하여, 복수의 제2 RSRP와 대응되는 참조값 사이의 제2 차이를 결정하고; 상기 제2 RSRP에 대응되는 참조값은, 상기 단말 기기가 상기 제2 RSRP를 측정하기 전에 측정하여 획득된 것이고; 제2 차 이 역치보다 크거나 같은 적어도 하나의 제2 RSRP에 대응되는 제2 차이가 존재하는 것에 응답하여, 타겟 이벤트 가 릴랙스 퇴출 이벤트인 것을 결정한다. 일부 실시예에서, 참조값은 하기의 방식을 통해 업데이트된다. 단말 기기가 셀 전환을 수행하는 것에 응답하여, 제1 RSRP에 따라 대응되는 참조값을 업데이트하고; 또는, 제1 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰 것에 응답하여, 제1 RSRP에 따라 대응되는 참조값을 업데이트하고; 또는, 타겟 시간대 내에서, 제1 RSRP의 제1 차이가 제1 차이 역치보다 크거나 같은 것에 응답하여, 제1 RSRP에 따라 대응되는 참조 값을 업데이트하고, 또는, 타겟 시간대 내에서, 제1 RSRP의 제1 차이가 제2 차이 역치보다 작은 것에 응답하여, 제1 RSRP에 따라 대응되는 참조값을 업데이트한다. 일부 실시예에서, 참조값은 하기의 방식을 통해 업데이트된다. 단말 기기가 셀 전환을 수행하는 것에 응답하여, 제2 RSRP에 따라 대응되는 참조값을 업데이트하고; 또는, 제2 RSRP에서 대응되는 참조값을 감한 차이값이 제3 차이 역치보다 큰 것에 응답하여, 제1 RSRP에 따라 대응되는 참조값을 업데이트하고; 또는, 설정 시간 내에서, 제2 RSRP의 제2 차이가 제1 차이 역치보다 크거나 같은 것에 응답하여, 제2 RSRP에 따라 대응되는 참조값을 업 데이트하고, 또는, 설정 시간 내에서, 제2 RSRP의제2 차이가 제2 차이 역치보다 작은 것에 응답하여, 제2 RSRP 에 따라 대응되는 참조값을 업데이트한다. 일부 실시예에서, 측정값은 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제1 신호 대 간섭 플러스 잡 음비(SINR)를 포함하고, 기준 정보는, 역치 지시 정보를 포함하고; 처리 유닛은, 구체적으로 역치 지시 정보에 따라, 제1 품질 역치를 결정하는데 사용되고; 복수의 제1 SINR이 모두 제1 품질 역치보다 큰 것에 응답 하여, 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정하고; 또는, 적어도 하나의 제1 품질 역치보다 큰 제1 SINR이 존해하는 것에 응답하여, 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한다. 일부 실시예에서, 측정값은 복수의 다운링크 참조 신호를 측정하여 획득된 복수의 제1 SINR을 포함한다. 기준 정보는, 역치 지시 정보를 포함하고; 처리 유닛은, 구체적으로 역치 지시 정보에 따라, 제2 품질 역치를 결정하는데 사용되고; 제2 품질 역치보다 작거나 같은 적어도 하나의 제1 SINR가 존재하는 것에 응답하여, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하고; 또는, 복수의 제1 SINR이 모두 제2 품질 역치보다 작거나 같은 것에 응답하여, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정한다. 일부 실시예에서, 측정값은 설정 시간 내에 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 SINR을 포함하고, 기준 정보는, 역치 지시 정보를 포함하고; 처리 유닛은, 구체적으로 역치 지시 정보에 따라, 제1 품질 역치를 결정하는데 사용되고; 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제1 품질 역치보다 큰 것에 응답하여, 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정 하고; 또는, 모두 제1 품질 역치보다 큰 적어도 하나의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재하는 것에 응답하여, 타겟 이벤트가 릴랙스 진입 이벤트인 것을 결정한다. 일부 실시예에서, 측정값은 설정 시간 내에 각각 복수의 다운링크 참조 신호의 각 다운링크 참조 신호를 여러번 측정하여 획득된 복수의 제2 SINR을 포함하고, 기준 정보는, 역치 지시 정보를 포함하고; 처리 유닛은, 구체적으로 역치 지시 정보에 따라, 제2 품질 역치를 결정하는데 사용되고; 모두 제2 품질 역치보다 작거나 같 은 적어도 하나의 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 존재하는 것에 응답하여, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정하고; 또는, 각 다운링크 참조 신호에 대응되는 복수의 제2 SINR이 모두 제2 품 질 역치보다 작거나 같은 것에 응답하여, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것을 결정한다. 일부 실시예에서, 처리 유닛은 또한, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것에 응답하여, 제1 타이머의 제1 값을 판독하는데 사용되고; 여기서, 제1 타이머는 단말 기기가 가장 최근에 릴랙스 퇴출 이벤트의 트리거링 을 판단하는 시각을 기반으로 계시하는데 사용된다. 송수신 유닛은, 제1 값이 제1 계수 역치보다 크고, 제2 타이머가 작동되지 않은 것에 응답하여, 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값을 송신하는데 사용되고; 여기서, 제2 타이머는 단말 기기가 가장 최 근에 릴랙스 퇴출 이벤트를 송신한 시각을 기반으로 계시하는데 사용된다. 일부 실시예에서, 처리 유닛은 또한, 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 제3 타이머의 제1 값을 판독하는데 사용되고; 여기서, 제3 타이머는 단말 기기가 가장 최근에 릴랙스 진입 이벤트의 트리거링 을 판단하는 시각을 기반으로 계시하는데 사용된다. 송수신 유닛은 또한, 제2 값이 제2 계수 역치보다 크고, 제4 타이머가 작동되지 않은 것에 응답하여, 네 트워크 기기에 릴랙스 진입 이벤트 및/또는 측정값을 송신하고; 여기서, 제4 타이머는 단말 기기가 가장 최근에 릴랙스 진입 이벤트를 송신한 시각을 기반으로 계시하는데 사용된다. 일부 실시예에서, 송수신 유닛은 또한, 타겟 이벤트가 릴랙스 퇴출 이벤트이고 제2 타이머가 작동되지 않 은 것에 응답하여, 네트워크 기기에 릴랙스 퇴출 이벤트 및/또는 측정값을 송신하고; 여기서, 제2 타이머는 단 말 기기가 가장 최근에 릴랙스 퇴출 이벤트를 송신하는 시각을 기반으로 계시하는데 사용된다. 일부 실시예에서, 송수신 유닛은, 타겟 이벤트가 릴랙스 진입 이벤트이고 제4 타이머가 작동되지 않은 것 에 응답하여, 네트워크 기기에 릴랙스 진입 이벤트 및/또는 측정값을 송신하는데 사용되고; 여기서, 제4 타이머 는 단말 기기가 가장 최근에 릴랙스 진입 이벤트를 송신한 시각을 기반으로 계시하는데 사용된다. 일부 실시예에서, 송수신 유닛은, 상기 타겟 이벤트의 보고 유형이 단말 기기인 것에 응답하여, 네트워크 기기에 상기 단말 기기에 대응되는 마스터 서비스 셀의 측정값 및/또는 타겟 이벤트를 송신하고; 상기 타겟 이 벤트의 보고 유형이 셀 그룹인 것에 응답하여, 상기 네트워크 기기에 상기 단말 기기에 대응되는 셀 그룹의 마 스터 서비스 셀의 측정값 및/또는 타겟 이벤트를 송신하고, 또는, 네트워크 기기에 상기 단말 기기에 대응되는 셀 그룹의 프라이머리 세컨더리 서비스 셀의 측정값 및/또는 타겟 이벤트를 송신하는데 사용된다. 일부 실시예에서, 송수신 유닛은 또한, 타겟 이벤트가 릴랙스 퇴출 이벤트인 것에 응답하여, 네트워크 기 기에 릴랙스 퇴출 이벤트 및/또는 측정값을 송신하고; 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 네 트워크 기기에 릴랙스 진입 이벤트 및/또는 측정값을 송신하는데 사용된다. 일부 실시예에서, 처리 유닛은, 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 단말 기기가 릴랙스 상태에서 타겟 측정을 주기적으로 측정하는 제1 측정 간격을 결정하는데 사용된다. 송수신 유닛은 또한, 네트워크 기기에 제1 측정 간격에 대응되는 간격 지시 정보를 송신하는데 사용되고, 여기서, 간격 지시 정보는 제1 측정 간격과 네트워크 기기에 의해 설정된 제2 측정 간격 사이의 비례계수를 포 함한다. 일부 실시예에서, 송수신 유닛은 또한, 네트워크 기기에서 송신된 릴랙스 명령을 수신하는데 사용된다. 처리 유닛은 또한, 릴랙스 명령에 응답하여, 단말 기기가 릴랙스 상태에 들어가도록 제어하는데 사용된다. 일부 실시예에서, 릴랙스 명령은 타겟 비례계수를 포함하고, 처리 유닛은 또한, 타겟 비례계수 및 네트워 크 기기에 의해 설정된 제2 측정 간격에 따라, 타겟 측정 간격을 결정하고; 릴랙스 상태에서, 타겟 측정 간격에 따라, 주기적으로 타겟 측정을 수행하는데 사용된다. 측정 장치가 네트워크 기기일 경우, 송수신 유닛은, 단말 기기에서 송신된 타겟 이벤트 및/또는 측 정값을 수신하는데 사용되고, 여기서, 측정값은 타겟 측정의 측정값이고, 타겟 측정은 무선 링크 모니터링(RLM) 측정 및/또는 무선 자원 관리(RRM) 측정을 포함함하고; 타겟 이벤트는 측정값 및 타겟 측정에 대응되는 기준 정 보에 따라 결정된 것이고, 타겟 이벤트는, 릴랙스 진입 이벤트 또는 릴랙스 퇴출 이벤트를 포함한다. 일부 실시예에서, 송수신 유닛은, 단말 기기에 기준 정보를 송신하는데 사용된다. 일부 실시예에서, 송수신 유닛은, 타겟 이벤트가 릴랙스 진입 이벤트인 것에 응답하여, 단말 기기에 릴랙 스 명령을 송신하는데 사용되고, 여기서, 릴랙스 명령은 단말 기기가 릴랙스 상태에 들어가도록 제어하는데 사 용된다. 설명해야 할 것은, 상기 도 2 내지 도 16의 임의의 실시예에서 단말 기기측에 의해 수행된 방법에 대한 설명, 또는, 상기 도 17의 실시예에서 네트워크 기기측에 의해 수행된 방법에 대한 설명은 당해 실시예의 측정 장치 에도 적용되고, 당해 원리는 유사하고, 여기서 설명하지 않는다. 도 19를 참조하면, 도 19는 본 발명의 실시예에 따른 다른 측정 장치의 구조 개략도이다. 측정 장치는 단 말 기기 또는 네트워크 기기일 수 있고, 단말 기기 또는 네트워크 기기가 상기 방법을 구현하도록 서포트하는 칩, 칩 시스템, 또는 프로세서 등일 수도 있다. 당해 장치는 상기 방법의 실시예에서 설명된 방법을 구현하는데 사용될 수 있고, 구체적으로 상기 방법 실시예의 설명을 참조할 수 있다. 측정 장치는 하나 또는 복수의 프로세서를 포함할 수 있다. 프로세서는 통용 프로세서 또는 전용 프로세서 등일 수 있다. 예를 들면 기저 대역 프로세서 또는 중앙 처리 장치일 수 있다. 기저 대역 프로세 서는 통신 프로토콜 및 통신 데이터를 처리하고, 중앙 처리 장치는 측정 장치(예를 들면, 기지국, 기저 대역칩, 단말 기기, 단말 기기 칩, DU 또는 CU 등)을 제어하고, 컴퓨터 프로그램을 수행하고, 컴퓨터 프로그램의 데이터 를 처리하는데 사용될 수 있다. 선택적으로, 측정 장치는 컴퓨터 프로그램이 포함되어 있는 하나 또는 복수의 메모리를 더 포 함할 수 있고, 프로세서는 컴퓨터 프로그램을 수행하여, 측정 장치가 상기 방법의 실시예에서 설명된 방법을 수행하도록 한다. 컴퓨터 프로그램은 프로세서에 고정될 수 있고, 당해 상황에서, 프로세서는 하드웨어에 의해 구현될 수 있다. 선택적으로, 메모리에는 데이터가 더 저장되어 있다. 측정 장치 및 메모리는 단독 설치될 수 있고, 통합될 수도 있다. 선택적으로, 측정 장치는 트랜시버, 안테나를 더 포함할 수 있다. 트랜시버는 송수신 유닛, 트랜스폰더, 또는 송수신 회로 등으로 불릴 수 있고, 송수신 기능을 구현하는데 사용된다. 트랜시버 는 수신기 및 송신기를 포함할 수 있고, 수신기는 접수기 또는 수신 회로 등으로 불릴 수 있고, 수신 기 능을 구현하는데 사용되고; 송신기는 송신 회로 등으로 불릴 수 있고, 송신 기능을 구현하는데 사용된다. 선택적으로, 측정 장치에는 하나 또는 복수의 인터페이스 회로를 더 포함할 수 있다. 인터페이스 회 로는 코드 명령을 수신하고 프로세서. 프로세서에 전송하여 코드 명령을 운행하고 측정 장치 가 상기 방법 실시예에서 설명된 방법을 수행하도록 한다. 측정 장치가 단말 기기일 경우, 프로세서는, 본 발명의 상기 도 2 내지 도 16 중의 임의의 방법 실 시예를 수행하는데 사용된다. 측정 장치가 네트워크 기기일 경우, 프로세서는, 본 발명의 상기 도 17에 도시된 방법 실시예를 수 행하는데 사용된다. 설명해야 할 것은, 상기 도 2 내지 도 17의 임의의 실시예에서 측정 방법에 대한 설명은, 당해 실시예의 측정 장치에도 적용되고, 당해 원리는 유사하고, 여기서 설명하지 않는다. 일 구현 방식에서, 프로세서는 수신 및 송신 기능을 구현하는 트랜시버를 포함할 수 있다. 예를 들면 당 해 트랜시버는 송수신 회로, 또는 인터페이스, 또는 인터페이스 회로일 수 있다. 수신 및 송신 기능을 구현하는 송수신 회로, 인터페이스 또는 인터페이스 회로는 분리된 것일 수 있고, 통합된 것일 수도 있다. 상기 송수신 회로, 인터페이스 또는 인터페이스 회로는 코드/데이터의 판독 기록에 사용될 수 있고, 상기 송수신 회로, 인터 페이스 또는 인터페이스 회로는 신호의 전송 또는 전달에 사용될 수 있다. 일 구현 방식에서, 측정 장치는 회로를 포함할 수 있고, 회로는 상기 방법 실시예의 송신 또는 수신 또는 통신 기능을 구현할 수 있다. 본 발명에서 설명된 프로세서 및 트랜시버는 직접 회로(integrated circuit, IC), 시뮬레이션 IC, 주파수 직접 회로(RFIC), 혼합 신호 IC, 주문형 직접 회로(application specific integrated circuit, ASIC), 인쇄 회로 기판(printed circuit board, PCB), 전자 기기 등에 구현될 수 있다. 당해 프로세 서 및 트랜시버는 각 IC고정 기술로써 제조될 수 있다. 예를 들면 상보성 금속 산화막 반도체(complementary metal oxide semiconductor, CMOS), N형 금속 산화물 반도체(nMetal-oxide-semiconductor, NMOS), P형 금속 산 화물 반도체(positive channel metal oxide semiconductor, PMOS), 양극성 접합 트랜지스터(bipolar junction transistor, BJT), 양극 CMOS(BiCMOS), 실리콘 게르마늄(SiGe), 갈륨비고(GaAs) 등으로 제공된다. 상기 실시예에서 설명된 측정 장치는 단말 기기 또는 네트워크 기기일 수 있지만, 본 발명에서 설명된 측정 장 치의 범위는 이에 한정되지 않고, 측정 장치의 구조는 도 19에 의해 한정되지 않는다. 측정 장치는 독립된 기기 또는 비교적 큰 기기의 일부분일 수 있다. 예를 들면 상기 측정 장치는, 독립된 직접 회로 IC, 또는 칩, 또는, 칩 시스템 또는 서브 시스템; 하나 또는 복수의 IC를 구비한 세트; 선택적으로, 당해 IC 세스튼 데이터, 컴퓨터 프로그램을 저장하는 저 장 컴포넌트를 포함할 수 있고, 모뎀 같은 ASIC; 기타 기기 내에 삽입될 수 있는 모듈; 접수기, 단말 기기, 스마트 단말 기기, 셀 전화, 무선 기기, 휴대폰, 모바일 유닛, 차량 탑재 기기, 네트워 크 기기, 클라우드 기기, 인공지능 기기 등; 기타 등등일 수 있다. 측정 장치가 칩 또는 칩 시스템일 수 있는 상황에 대해, 도 20에 도시된 칩의 구조 개략도를 참조할 수 있다. 도 20에 도시된 칩은 프로세서 및 인터페이스를 포함한다. 여기서, 프로세서의 수량은 하나 또는 다수일 수 있고, 인터페이스의 수량은 다수일 수 있다. 칩이 본 발명 실시예의 단말 기기의 기능을 구현하는데 사용되는 상황에 있어서, 인터페이스는, 코드 명령을 수신하고 프로세스에 전송하는데 사용되고; 프로세서는 코드 명령을 수행하여 도 2 내지 도 16 중의 임의의 실시예에 따른 방법을 구현하는데 사용된 다. 칩이 본 발명 실시예의 네트워크 기기의 기능을 구현하는데 사용되는 상황에 있어서, 인터페이스는, 코드 명령을 수신하고 프로세스에 전송하는데 사용되고; 프로세서는 코드 명령을 수행하여 도 17의 실시예에 따른 방법을 구현하는데 사용된다. 선택적으로, 칩은 필수 컴퓨터 프로그램 및 데이터를 저장하는 메모리를 포함한다. 설명해야 할 것은, 상기 도 2 내지 도 17 중의 임의의 실시예에서 측정 방법에 대한 설명은, 당해 실시예의 칩 에적 적용되고, 당해 원리는 유사하고, 여기서 설명하지 않는다. 당업자는 본 발명의 실시예에서 열거된 각 설명적인 논리 블록(illustrative logical block) 및 단계(step)는 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양자의 결합을 통해 구현될 수 있다는 것을 이해할 수 있다. 당해 기 능이 하드웨어를 통해 구현되는지 소프트웨어를 통해 구현되는 지는 특정된 응용 및 전체 시스템의 설계 요구에 의해 결정된다. 당업자는 각 종 특정 응용에 대해, 각 종 방법을 사용하여 기능을 구현할 수 있지만, 당해 구현 은 본 발명의 실시예에서 보호하려는 범위를 초과한 것으로 간주되서는 안된다. 본 발명의 실시예는 통신 시스템을 더 제공하고, 당해 시스템은 상기 도 19의 실시예에서 단말 기기 또는 네트 워크 기기인 측정 장치 및 상기 도 20의 실시예에서 단말 기기 또는 네트워크 기기인 측정 장치를 포함한다. 본 발명은 명령이 저장되어 있는 판독 가능 저장 매체를 더 제공하고, 당해 명령이 컴퓨터에 의해 수행될 경우 상기 어느 하나의 방법 실시예의 기능이 구현된다. 본 발명은 컴퓨터 프로그램 제품을 더 제공하고, 당해 컴퓨터 프로그램 제품이 컴퓨터에 의해 수행될 경우 상기 어느 하나의 방법 실시예의 기능이 구현된다. 상기 실시예에서, 전부 또는 부분적으로 소프트웨어, 하드웨어, 펌웨어 또는 당해 임의의 조합을 통해 구현될 수 있다. 소프트웨어로써 구현할 경우, 전부 또는 부분적으로 컴퓨터 프로그램 제품의 형식으로 구현된다. 상기 컴퓨터 프로그램 제품은 하나 또는 복수의 컴퓨터 프로그램을 포함한다. 컴퓨터에서 상기 컴퓨터 프로그램을 로 딩 또는 수행할 경우, 전부 또는 부분적으로 본 발명의 실시예에 따른 프로세스 또는 기능을 생성한다. 상기 컴 퓨터는 통용 컴퓨터, 전용 컴퓨터, 컴퓨터 네트워크, 또는 기타 프로그래 가능 장치일 수 있다. 상기 컴퓨터 프 로그램은 컴퓨터 판독 가능 저장 매체에 저장될 수 있고, 또는 일 컴퓨터 판독 가능 저장 매체에서 다른 컴퓨터 판독 가능 저장 매체에 전송된다. 예를 들면, 상기 컴퓨터 프로그램은 1개의 웹 사이트, 컴퓨터, 서버 또는 데 이터 센터에서 유선(예를 들면 동축 케이블, 광섬유, 디지털 가입자 회선(digital subscriber line, DSL)) 또는 무선(예를 들면 적외선, 무선, 마이크로웨이브 등) 방식을 통해 다른 웹 사이트, 컴퓨터, 서버 또는 데이터 센 터에 전송로 전송할 수 있다. 상기 컴퓨터 판독 가능 저장 매체는 컴퓨터에 의해 액세스 가능한 임의의 사용 가 능한 매체 또는 하나 또는 복수의 사용 가능한 매체로 통합된 서버, 데이터 센터 등 데이터 저장 기기일 수 있 다. 상기 사용 가능한 매체는 자성 매체(예를 들면, 플로핏 디스켓, 하드 디스크, 자기 테이크), 광 매체(예를 들면, 고밀도 디지털 비디오 디스크(digital video disc, DVD)), 또는 반도체 매체(예를 들면, 솔리드 스테이트 디스크(solid state disk, SSD)) 등일 수 있다. 당업자는, 본 발명에 언급된 제1 , 제2 등 각종 수자 번호는 오직 설명의 편리를 위해 구별한 것이고, 본 발명 실시예의 범위를 한정하지 않고, 선후 순서를 나타내기도 한다. 본 발명의 적어도 하나는 하나 또는 복수로 설명될 수도 있고, 복수는 2개, 3개, 4개 또는 더 많을 수 있고, 본 발명에서 한정하지 않는다. 본 발명의 실시예에서, 기술 구성에 대해, \"제1 \", \"제2 \", \"제3 \", \"A\", \"B\", \"C\" 및 \"D\"를 통해 당해 기술 구성 중의 기술 구성을 구별하고, 당해 \"제1 \", \"제2 \", \"제3 \", \"A\", \"B\", \"C\" 및 \"D\"가 설명하는 기술 구성 사이는 선후 순서 또는 크기 순서가 존재하지 않는다. 이해해야 할 것은, 본 발명의 \"복수\"는 2개 또는 2개 이상을 가리키고 기타 양사도 유사하다. \" 및/또는\"은, 관 련 대상의 관련 관계를 설명하고, 3종 관계가 존재할 수 있음을 나타낸다. 예를 들면, A 및/또는 B는, A가 단독 존재하거나, A 및 B가 동시에 존재하거나, B가 단독으로 존재하는 3종 상황을 나타낸다. 문자 부호 \"/\"는 일반 적으로 전후 관련 대상이 \"또는\"의 관계임을 나타낸다. 콘텍스트에서 기타 함의를 명확히 나타낸 경우 외에, 홀 수 형식의 \"하나\", \"상기\" 및 \"당해\"도 다수 형식을 포함한다. 사용된 단어 \"만약\"은 \"...경우\" 또는 \"...때\" 또는 \"결정에 응답하여\"로 해석될 수 있다. 본 발명의 각 테이블에 도시된 대응관계는 설정될 수 있고, 사전 정의된 것일 수도 있다. 각 리스트의 정보의 값은 예시 뿐이고, 기타 값으로 설정될 수 있고, 본 발명에서 한정하지 않는다. 설정 정보와 각 파라미터의 대 응관계를 설정할 경우, 반드시 각 테이블에 도시된 모든 대응관계를 설정하도록 요구하지 않는다. 예를 들면, 본 발명의 테이블에서, 일부 행에 도시된 대응관계는 설정하지 않아도 된다. 또 예를 들면, 상기 테이블을 기반 으로 적합한 변형 및 조정을 할 수 있다. 예를 들면, 분해, 합병 등을 할 수 있다. 상기 각 테이블에서 타이틀 에 나타내는 파라미터의 명칭은 통신 장치에 의해 이해 가능한 기타 명칭을 사용할 수도 있고, 당해 파라미터의 값 또는 표시 방식도 통신 장치에 의해 이해 가능한 기타 값 또는 표시 방식을 사용할 수도 있다. 상기 각 테이 블은 구현할 경우, 가타 데이터 구조를 사용할 수도 있다. 예를 들면 배열, 대기열, 용기, 스택, 선형 목록, 포 인터, 체인 테이블, 트리, 그래프, 구조체, 클래스, 힙, 해시 테이블 또는 해시 테이블 등을 사용할 수 있다. 본 발명의 사전 정의는 정의, 사전 정의, 저장, 사전 저장, 사전 협상, 사전 설정, 경화, 또는 사전 소성으로 이해할 수 있다. 당업자가 의식해야 하는 바, 본 발명의 설명에서 제공하는 실시예에서 설명된 각 예시의 유닛 및 알로리즘 단계 는, 전자 하드웨어, 또는 컴퓨터 소프트웨어 및 전자 하드웨어의 결합으로 구현될 수 있다. 당해 기능이 하드웨 어 방식으로 수행되는지 소프트웨어 방식으로 수행되는지는, 기술 수단의 특정 응용 및 설계 단속 조건에 의해 결정된다. 당업자는 각 특정된 응용에 대해 부동한 방법으로써 설명된 기능을 구현할 수 있지만, 당해 구현은 본 발명의 범위를 초과하는 것으로 간주되서는 안된다. 당업자가 명확히 이해해야 할 것은, 설명의 편리 및 간결을 위해, 상기 설명된 시스템, 장치 및 유닛의 구체적 인 작업 프로세스는, 상기 방법 실시예의 해당 프로세스를 참조할 수 있고, 여기서 더는 설명하지 않는다. 상기 설명은, 본 발명의 구체적인 수행 방식일 뿐이고, 본 발명의 보호 범위는 이에 한정되지 않고, 임의의 본 기술 분야에 익숙한 당업자는 본 발명에서 밝혀진 기술 범위를 포함하고, 변화 또는 교체를 쉽게 생각할 수 있 고, 모두 본 발명의 보호 범위 내에 포함되어야 한다. 따라서, 본 발명의 보호 범위는 상기 청구항의 보호 범위를 기준으로 해야 한다."}
{"patent_id": "10-2024-7027421", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 실시예 또는 배경 기술의 기술 수단을 더 명확하게 설명하기 위해, 아래는 본 발명의 실시예 또는 배 경 기술에서 사용해야 하는 도면에 대해 설명한다. 도 1은 본 발명의 실시예에 따른 통신 시스템의 아키텍처 개략도이다. 도 2는 본 발명의 실시예에 따른 측정 방법의 개략적인 흐름도이다. 도 3은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 4는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 5는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 6은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 7은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 8은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 9는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 10은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 11은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 12는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 13은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 14는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 15는 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 16은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 17은 본 발명의 실시예에 따른 다른 측정 방법의 개략적인 흐름도이다. 도 18은 본 발명의 실시예에 따른 측정 장치의 구조 개략도이다. 도 19는 본 발명의 실시예에 따른 다른 측정 장치의 구조 개략도이다. 도 20은 본 발명의 실시예에 따른 칩의 구조 개략도이다."}
