{"patent_id": "10-2020-0011289", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0097500", "출원번호": "10-2020-0011289", "발명의 명칭": "화재감지장치 및 이를 포함하는 화재감지시스템", "출원인": "주식회사 소이넷", "발명자": "김용호"}}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "감시공간 및/또는 감시구역을 실시간으로 촬영하여 영상 데이터를 생성하는 촬영부;상기 영상 데이터에 대한 인공지능 분석을 기반으로 화재발생을 감지하여 화재감지 데이터를 생성하는 화재 감지부;상기 화재감지 데이터를 처리 및/또는 변환하여 이미지 및/또는 메타데이터를 포함하는 모니터링 데이터를 생성하는 데이터 처리부; 및상기 모니터링 데이터를 관제서버로 송신하는 통신부;를 포함하는, 화재감지장치."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 화재 감지부는,상기 영상 데이터로부터 영상 이미지를 획득하고, 상기 영상 이미지를 복수의 블록으로 분할하는 이미지획득부;상기 복수의 블록으로 각각 분할된 영상 이미지로부터 화염영역 및/또는 연기영역을 검출하는 영상처리부; 및상기 검출된 화염영역 및/또는 연기영역의 면적 및/또는 개수를 산출하되, 상기 산출된 화염영역 및/또는 연기영역의 면적 및/또는 개수를 화재발생 기준값과 비교하고, 비교결과로 상기 화재감지 데이터를 생성하여 출력하는 감지결과출력부;를 포함하는 것을 특징으로 하는, 화재감지장치."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 통신부는,건물정보를 상기 관제서버로 송신하고, 상기 관제서버로부터 화재대피경로 및 화재진압경로 중 적어도 하나를수신하며,상기 화재감지장치는,상기 건물정보를 이용하여 상기 화재대피경로 및/또는 상기 화재진압경로에 따라 경고방송 송출 및/또는 경고비상등 점등을 수행하고, 상기 화재대피경로 및/또는 화재진압경로를 대피자 및/또는 진압자에게 선택적으로 알리는 경로 안내부를 더 포함하는 것을 특징으로 하는, 화재감지장치."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "감시공간 및/또는 감시구역에 대한 실시간 영상데이터의 인공지능 분석을 기반으로 화재발생을 감지하여 감지결과로 모니터링 데이터를 출력하는 화재감지장치; 및상기 모니터링 데이터를 수신하고, 수신된 모니터링 데이터를 암호해제 및/또는 복호화하여 영상확인 및 관제공개특허 10-2021-0097500-3-표출하며, 현장 및/또는 관제실에 근무중인 관제 담당자의 관제단말기로 송신하여 관제단말기에서 팝업알림 및/또는 음향출력으로 감지결과를 표시하도록 감지결과를 통지하는 관제서버;를 포함하는, 화재감지시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 화재감지장치는,감시공간 및/또는 감시구역을 실시간으로 촬영하여 영상 데이터를 생성하는 촬영부;상기 영상 데이터에 대한 인공지능 분석을 기반으로 화재발생을 감지하여 화재감지 데이터를 생성하는 화재 감지부;상기 화재감지 데이터를 처리 및/또는 변환하여 이미지 및/또는 메타데이터를 포함하는 모니터링 데이터를 생성하는 데이터 처리부; 및상기 모니터링 데이터를 관제서버로 송신하는 통신부;를 포함하는, 화재감지시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 화재 감지부는,상기 영상 데이터로부터 영상 이미지를 획득하고, 상기 영상 이미지를 복수의 블록으로 분할하는 이미지획득부;상기 복수의 블록으로 각각 분할된 영상 이미지로부터 화염영역 및/또는 연기영역을 검출하는 영상처리부; 및상기 검출된 화염영역 및/또는 연기영역의 면적 및/또는 개수를 산출하되, 상기 산출된 화염영역 및/또는 연기영역의 면적 및/또는 개수를 화재발생 기준값과 비교하고, 비교결과로 상기 화재감지 데이터를 생성하여 출력하는 감지결과출력부;를 포함하는 것을 특징으로 하는, 화재감지시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 통신부는,건물정보를 상기 관제서버로 송신하고, 상기 관제서버로부터 화재대피경로 및 화재진압경로 중 적어도 하나를수신하며,상기 화재감지장치는,상기 건물정보를 이용하여 상기 화재대피경로 및/또는 상기 화재진압경로에 따라 경고방송 송출 및/또는 경고비상등 점등을 수행하고, 상기 화재대피경로 및/또는 화재진압경로를 대피자 및/또는 진압자에게 선택적으로 알리는 경로 안내부를 더 포함하는 것을 특징으로 하는, 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,공개특허 10-2021-0097500-4-상기 관제서버는,관제 담당자에게 표시수단을 이용하여 화재발생여부에 대한 의사결정을 지원하는 관제지원부;상기 의사결정의 정확성 향상을 위한 관제보완기능을 지원하는 관제보완부;설정된 시간내에 관제 담당자의 응답이 없는 상황에서 원격지원으로 화재발생여부에 의사결정을 보완하는 원격관제보완부;화재발생이 확인된 감시공간 및/또는 감시구역에 화재 알림 및 경고를 수행하는 화재알림부; 및최적의 화재대비경로 및 화재진압경로에 대하여 대피자 및 진압자에게 설정된 정보를 제공하는 경로정보제공부;를 포함하는 것을 특징으로 하는, 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 관제지원부는,상기 화재 징후가 감지된 위치에 대한 정보를 건물정보를 반영하여 2차원 또는 3차원 구역으로 이미지를 생성하는 구역이미지 생성부;상기 구역의 조도, 온도, 습도, 풍향, 퐁속 중 어느 하나 이상의 환경정보를 건물의 내부 및/또는 외부에 설치된 기상정보센서를 통해 수신하고, 감지된 상기 화재 징후를 보정하는 화재징후 보정부; 및상기 화재 징후 및 상기 환경정보를 기반으로 상기 구역을 통해 설정된 시간 내 화재 확산이 예상되는 주변 구역을 연산하여 추가 생성하는 화재확산정보 생성부;를 포함하는 것을 특징으로 하는, 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 관제보완부는,상기 영상데이터를 통해 확인되는 구역에 대응되는 위치에 설치된 센서를 통해 센서데이터를 수집하는 센서데이터 수집부;상기 영상데이터를 통해 확인된 불꽃발생 및/또는 연기발생 정보와 상기 센서데이터를 통해 수집된 이상온도 및/또는 이상습도 발생/지속 여부를 매칭하는 정보 매칭부; 및상기 매칭 결과로 최종 화재발생여부를 판독하여 관제보완기능을 수행하는 판독검증부;를 포함하는 것을 특징으로 하는, 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 경로정보제공부는,화재발생구역 및/또는 화재확산구역을 구분하는 화재구역 설정부;경고방송 송출 및/또는 경고비상등 점등을 수행하는 화재경고부; 및화재대피경로 및/또는 화재진압경로를 산출하고, 상기 화재대피경로 및/또는 화재진압경로를 대피자 및/또는 진압자에게 선택적으로 알리는 화재알림부;공개특허 10-2021-0097500-5-를 포함하는 것을 특징으로 하는, 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 화재구역 설정부는,화재발생구역에 해당하는 위치에 대한 정보를 건물의 도면 정보를 반영하여 2차원 또는 3차원 구역으로 이미지를 생성하는 화재발생구역 이미지 생성부; 및상기 화재발생구역 및 상기 화재발생구역의 인근에 위치하는 구역의 화재등급 및/또는 상기 구역 및 상기 인근구역에 영향을 미치는 풍향 및/또는 퐁속 정보를 기반으로 상기 화재발생구역을 통해 설정된 시간 내 화재 확산이 예상되는 화재확산구역을 연산하여 추가적으로 생성하고, 상기 화재발생구역과 상기 화재확산구역를 구분하는 화재확산구역 설정부;를 포함하는, 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 화재알림부는,기 설치된 경로표시장치의 표시색상 및/또는 점멸패턴을 설정하여 상기 화재대피경로 및/또는 화재진압경로를안내하는 것을 특징으로 하는, 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 화재알림부는,상기 화재발생구역, 상기 화재확산구역 및 상기 화재발생구역 및 상기 화재확산구역을 포함하는 건축구조물의이동통로 정보를 기반으로 적어도 하나의 화재대피경로를 생성하는 대피경로생성부; 상기 화재발생구역, 상기 화재확산구역 및 상기 화재발생구역 및 상기 화재확산구역을 포함하는 건축구조물의이동통로 정보를 기반으로 적어도 하나의 화재진압경로를 생성하는 진압경로생성부;상기 건축구조물 내부에 위치하는 재실자가 대피자 또는 진압자인지 여부를 확인하는 재실자특성분석부; 및상기 재실자가 대피자인 경우, 대피경로를, 상기 재실자가 진압자인 경우, 진압경로를 추천하는 경로추천부;를 포함하는 것을 특징으로 하는 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 경로정보제공부는,설정된 대피경로로의 대피자의 대피상황을 모니터링 하는 대피경로 모니터링부;상기 대피자 대피경로와 상기 화재확산구역의 실시간 및/또는 설정된 시간 내 확산 예측정보에 따른 겹침여부를실시간 확인하는 대피위험 모니터링부; 및상기 대피경로와 화재확산구역의 겹침이 예상되는 경우, 상기 대피경로를 재설정하는 대피경로 재설정부;공개특허 10-2021-0097500-6-를 더 포함하는 것을 특징으로 하는, 화재 감지 시스템."}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 화재감지장치 및 이를 포함하는 화재감지시스템에 관한 것으로, 감시공간 및/또는 감시구역을 실시간 으로 촬영하여 영상 데이터를 생성하는 촬영부; 상기 영상 데이터에 대한 인공지능 분석을 기반으로 화재발생을 감지하여 화재감지 데이터를 생성하는 화재 감지부; 상기 화재감지 데이터를 처리 및/또는 변환하여 이미지 및/ 또는 메타데이터를 포함하는 모니터링 데이터를 생성하는 데이터 처리부; 및 상기 모니터링 데이터를 관제서버로 송신하는 통신부를 포함하는, 화재감지장치를 제공한다."}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 화재감지장치 및 이를 포함하는 화재감지시스템에 관한 것으로, 더욱 상세하게는 즉각적인 현장 화재 대응을 지원하고, 인공지능 기반으로 오탐율을 감소시킬 수 있는 화재감지장치 및 이를 포함하는 화재감지시스 템에 관한 것이다."}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 화재의 감지가 필요한 빌딩에는 화재 감지 센서 및 CCTV가 설치되어 화재를 감지하게 된다. CCTV에 의한 화재 감지의 경우, 획득된 영상을 사용자가 직접 모니터링 하여야만 화재를 인지할 수 있으며, 사 용자가 자리에 없거나 자리에 있을 경우에도 화면을 보지 않을 경우 화재를 인지할 수 없다. 또한, 화재 감지 센서에 의한 경우, 건물에 설치된 센서가 직접 화재 정보로서 연기나 온도를 감지하고 해당 정보를 중앙 서버로 송신함으로써 화재 감지가 이루어질 수 있다. 그러나, 이러한 방식의 종래 화재감지시스템에서는 화재가 아닌 경우에도 화재센서의 오작동으로 인해 화재를 감지하는 경우가 종종 발생하게 되고, 중앙 서버에 오감지를 송신하여 불필요한 소방 출동이 발생하는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록 특허 제 10-1075063호"}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는 즉각적인 현장 화재 대응을 지원하고, 인공지능 기반으로 오탐율을 감소시킬 수 있는 화재감지장치 및 이를 포함하는 화재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 개인정보보호를 지원할 수 있는 화재감지장치 및 이를 포함하 는 화재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 네트워크 사용량 및 영상 저장공간을 절감할 수 있는 화재감지 장치 및 이를 포함하는 화재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 영상모니터링을 이용하여 현장에서 발생 가능한 화염이나 연기 등 화재 발생을 원격으로 감시할 수 있는 화재감지장치 및 이를 포함하는 화재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 건물의 도면 정보를 연계하여 화재발생구역의 이미지를 생성하 고 표시수단을 이용하여 화재발생여부에 대한 의사결정을 지원하여 의사결정에 대한 편의성을 향상시킬 수 있는 화재감지장치 및 이를 포함하는 화재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 화재발생구역의 내외부에 대한 환경정보를 연계 반영하고 화재 오류를 보정하여 화재발생의 정확성을 향상시킬 수 있는 화재감지장치 및 이를 포함하는 화재감지시스템을 제공 하는 것이다.또한, 본 발명이 해결하고자 하는 기술적 과제는 화재 확산 방향을 예측하고, 추가 관제 지원하여 화재 확산에 의한 추가 피해를 감소시킬 수 있는 화재감지장치 및 이를 포함하는 화재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 영상 데이터만을 토대로 화재를 감지할 경우에 발생하는 판단 오류를 방지하기 위하여 추가적으로 센서 데이터를 필요에 따라 매칭하여 검증하고, 이를 통해 화재 감지의 정 확도를 높일 수 있는 화재감지장치 및 이를 포함하는 화재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 건물의 도면 정보를 연계하여 화재발생구역과 화재확산구역을 구분함으로써 유효한 화재대피경로 및/또는 화재진압경로를 산출할 수 있는 화재감지장치 및 이를 포함하는 화 재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 화재등급, 풍향, 풍속을 기반으로 화재확산구역을 설정하여 화 재확산에 대한 예측 정확도를 향상시킬 수 있는 화재감지장치 및 이를 포함하는 화재감지시스템을 제공하는 것 이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 재실자를 분류하여 재실자에게 차별화된 정보를 제공할 수 있 는 화재감지장치 및 이를 포함하는 화재감지시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 실시간으로 대피경로와 화재확산을 모니터링하여 안전한 대피 경로와 효과적인 진압경로를 설정하여 대피자 및/또는 진압자에게 제공할 수 있는 화재감지장치 및 이를 포함하 는 화재감지시스템을 제공하는 것이다. 본 발명이 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다 른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위하여, 감시공간 및/또는 감시구역을 실시간으로 촬영하여 영상 데이터를 생성하 는 촬영부; 상기 영상 데이터에 대한 인공지능 분석을 기반으로 화재발생을 감지하여 화재감지 데이터를 생성하 는 화재 감지부; 상기 화재감지 데이터를 처리 및/또는 변환하여 이미지 및/또는 메타데이터를 포함하는 모니터 링 데이터를 생성하는 데이터 처리부; 및 상기 모니터링 데이터를 관제서버로 송신하는 통신부를 포함하는, 화 재감지장치를 제공한다. 본 발명의 실시예에 있어서, 상기 화재 감지부는, 상기 영상 데이터로부터 영상 이미지를 획득하고, 상기 영상 이미지를 복수의 블록으로 분할하는 이미지 획득부; 상기 복수의 블록으로 각각 분할된 영상 이미지로부터 화염 영역 및/또는 연기영역을 검출하는 영상처리부; 및 상기 검출된 화염영역 및/또는 연기영역의 면적 및/또는 개 수를 산출하되, 상기 산출된 화염영역 및/또는 연기영역의 면적 및/또는 개수를 화재발생 기준값과 비교하고, 비교결과로 상기 화재감지 데이터를 생성하여 출력하는 감지결과출력부를 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 통신부는, 건물정보를 상기 관제서버로 송신하고, 상기 관제서버로부터 화재 대피경로 및 화재진압경로 중 적어도 하나를 수신하며, 상기 화재감지장치는, 상기 건물정보를 이용하여 상기 화재대피경로 및/또는 상기 화재진압경로에 따라 경고방송 송출 및/또는 경고비상등 점등을 수행하고, 상기 화 재대피경로 및/또는 화재진압경로를 대피자 및/또는 진압자에게 선택적으로 알리는 경로 안내부를 더 포함할 수 있다. 상기 기술적 과제를 달성하기 위하여, 감시공간 및/또는 감시구역에 대한 실시간 영상데이터의 인공지능 분석을 기반으로 화재발생을 감지하여 감지결과로 모니터링 데이터를 출력하는 화재감지장치; 및 상기 모니터링 데이터 를 수신하고, 수신된 모니터링 데이터를 암호해제 및/또는 복호화하여 영상확인 및 관제 표출하며, 현장 및/또 는 관제실에 근무중인 관제 담당자의 관제단말기로 송신하여 관제단말기에서 팝업알림 및/또는 음향출력으로 감 지결과를 표시하도록 감지결과를 통지하는 관제서버를 포함하는, 화재감지시스템을 제공한다. 본 발명의 실시예에 있어서, 상기 화재감지장치는, 감시공간 및/또는 감시구역을 실시간으로 촬영하여 영상 데 이터를 생성하는 촬영부; 상기 영상 데이터에 대한 인공지능 분석을 기반으로 화재발생을 감지하여 화재감지 데 이터를 생성하는 화재 감지부; 상기 화재감지 데이터를 처리 및/또는 변환하여 이미지 및/또는 메타데이터를 포 함하는 모니터링 데이터를 생성하는 데이터 처리부; 및 상기 모니터링 데이터를 관제서버로 송신하는 통신부를포함할 수 있다. 본 발명의 실시예에 있어서, 상기 화재 감지부는, 상기 영상 데이터로부터 영상 이미지를 획득하고, 상기 영상 이미지를 복수의 블록으로 분할하는 이미지 획득부; 상기 복수의 블록으로 각각 분할된 영상 이미지로부터 화염 영역 및/또는 연기영역을 검출하는 영상처리부; 및 상기 검출된 화염영역 및/또는 연기영역의 면적 및/또는 개 수를 산출하되, 상기 산출된 화염영역 및/또는 연기영역의 면적 및/또는 개수를 화재발생 기준값과 비교하고, 비교결과로 상기 화재감지 데이터를 생성하여 출력하는 감지결과출력부를 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 관제지원부는, 상기 화재 징후가 감지된 위치에 대한 정보를 건물의 도면 정 보를 반영하여 2차원 또는 3차원 구역으로 이미지를 생성하는 구역이미지 생성부; 상기 구역의 조도, 온도, 습 도, 풍향, 퐁속 중 어느 하나 이상의 환경정보를 건물의 내부 및/또는 외부에 설치된 기상정보센서를 통해 수신 하고, 감지된 상기 화재 징후를 보정하는 화재징후 보정부; 및 상기 화재 징후 및 상기 환경정보를 기반으로 상 기 구역을 통해 설정된 시간 내 화재 확산이 예상되는 주변 구역을 연산하여 추가 생성하는 화재확산정보 생성 부를 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 관제보완부는, 상기 영상데이터를 통해 확인되는 구역에 대응되는 위치에 설 치된 센서를 통해 센서데이터를 수집하는 센서데이터 수집부; 상기 영상데이터를 통해 확인된 불꽃발생 및/또는 연기발생 정보와 상기 센서데이터를 통해 수집된 이상온도 및/또는 이상습도 발생/지속 여부를 매칭하는 정보 매칭부; 및 상기 매칭 결과로 최종 화재발생여부를 판독하여 관제보완기능을 수행하는 판독검증부를 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 경로정보제공부는, 화재발생구역 및/또는 화재확산구역을 구분하는 화재구역 설정부; 경고방송 송출 및/또는 경고비상등 점등을 수행하는 화재경고부; 및 화재대피경로 및/또는 화재진압경 로를 산출하고, 상기 화재대피경로 및/또는 화재진압경로를 대피자 및/또는 진압자에게 선택적으로 알리는 화재 알림부를 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 화재구역 설정부는, 화재발생구역에 해당하는 위치에 대한 정보를 건물정보를 반영하여 2차원 또는 3차원 구역으로 이미지를 생성하는 화재발생구역 이미지 생성부; 및 상기 화재발생구역 및 상기 화재발생구역의 인근에 위치하는 구역의 화재등급 및/또는 상기 구역 및 상기 인근 구역에 영향을 미치는 풍향 및/또는 퐁속 정보를 기반으로 상기 화재발생구역을 통해 설정된 시간 내 화재 확산이 예상되는 화재확산 구역을 연산하여 추가적으로 생성하고, 상기 화재발생구역과 상기 화재확산구역를 구분하는 화재확산구역 설정 부를 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 화재알림부는, 기 설치된 경로표시장치의 표시색상 및/또는 점멸패턴을 설정 하여 상기 화재대피경로 및/또는 화재진압경로를 안내할 수 있다. 본 발명의 실시예에 있어서, 상기 화재알림부는, 상기 화재발생구역, 상기 화재확산구역 및 상기 화재발생구역 및 상기 화재확산구역을 포함하는 건축구조물의 이동통로 정보를 기반으로 적어도 하나의 화재대피경로를 생성 하는 대피경로생성부; 상기 화재발생구역, 상기 화재확산구역 및 상기 화재발생구역 및 상기 화재확산구역을 포 함하는 건축구조물의 이동통로 정보를 기반으로 적어도 하나의 화재진압경로를 생성하는 진압경로생성부; 상기 건축구조물 내부에 위치하는 재실자가 대피자 또는 진압자인지 여부를 확인하는 재실자특성분석부; 및 상기 재 실자가 대피자인 경우, 대피경로를, 상기 재실자가 진압자인 경우, 진압경로를 추천하는 경로추천부를 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 경로정보제공부는, 설정된 대피경로로의 대피자의 대피상황을 모니터링 하는 대피경로 모니터링부; 상기 대피자 대피경로와 상기 화재확산구역의 실시간 및/또는 설정된 시간 내 확산 예측 정보에 따른 겹침여부를 실시간 확인하는 대피위험 모니터링부; 및 상기 대피경로와 화재확산구역의 겹침이 예 상되는 경우, 상기 대피경로를 재설정하는 대피경로 재설정부를 더 포함할 수 있다."}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 즉각적인 현장 화재 대응을 지원하고, 딥러닝의 인공지능 기반으로 오탐율을 감소 시킬 수 있다. 또한, 본 발명의 실시예에 따르면, 개인정보 마스킹, 압축, 암호화를 통해 개인정보보호를 지원할 수 있다. 또한, 본 발명의 실시예에 따르면, 이미지 및/또는 메타데이터 전송을 통해 네트워크 사용량 및 영상 저장공간 을 절감할 수 있다. 또한, 본 발명은 화재감지장치의 현장설치를 통해 영상분석 서버 비용을 절감할 수 있다. 또한, 본 발명의 실시예에 따르면, 관제서버의 인프라 변경을 최소화할 수 있다. 또한, 본 발명의 실시예에 따르면, 영상모니터링을 이용하여 현장에서 발생 가능한 화염이나 연기 등 화재 발생 을 원격으로 감시할 수 있다. 또한, 본 발명의 실시예에 따르면, 건물정보를 이용하여 화재발생구역의 이미지를 생성하고 표시수단을 이용하 여 화재발생여부에 대한 의사결정을 지원함으로써, 의사결정에 대한 편의성을 향상시킬 수 있다. 또한, 본 발명의 실시예에 따르면, 화재발생구역의 내외부에 대한 환경정보를 연계 반영하여 화재 오류를 보정 함으로써, 화재발생의 정확성을 향상시킬 수 있다. 또한, 본 발명의 실시예에 따르면, 화재 확산 방향을 예측하고, 추가 관제 지원하여 화재 확산에 의한 추가 피 해를 감소시킬 수 있다. 또한, 본 발명의 실시예에 따르면, 영상 데이터만을 토대로 화재를 감지할 경우에 발생하는 판단 오류를 방지하 기 위하여 추가적으로 센서 데이터를 필요에 따라 매칭하여 검증하고, 이를 통해 화재 감지의 정확도를 높일 수 있다. 또한, 본 발명의 실시예에 따르면, 건물 정보를 이용하여 화재발생구역과 화재확산구역을 구분함으로써 유효한 화재대피경로 및/또는 화재진압경로를 산출할 수 있다. 또한, 본 발명의 실시예에 따르면, 화재등급, 풍향, 풍속을 기반으로 화재확산구역을 설정함으로써 화재확산에 대한 예측 정확도를 향상시킬 수 있다. 또한, 본 발명의 실시예에 따르면, 재실자를 분류하여 재실자에게 차별화된 정보를 제공할 수 있다. 또한, 본 발명의 실시예에 따르면, 실시간으로 대피경로와 화재확산을 모니터링하여 안전한 대피경로와 효과적 인 진압경로를 설정하여 대피자 및/또는 진압자에게 제공할 수 있다."}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명을 설명하기로 한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 따라서 여기에서 설명하는 실시예로 한정되는 것은 아니다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유 사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉, 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연 결\"되어 있는 경우뿐 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 구비할 수 있다는 것을 의미한다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하 첨부된 도면을 참고하여 본 발명의 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 화재감지시스템의 구성을 나타내는 도면이다. 도 2는 도 1의 관제서버의 네트워크 연결을 나타내는 도면이다. 도 1 및 도 2를 참조하면, 본 발명의 일 실시예에 따른 화재감지시스템은 화재감지장치 및 관제서버 를 포함할 수 있다. 상기 화재감지장치는 감시공간 및/또는 감시구역에 대한 실시간 영상데이터의 인공지능 분석을 기반으로 화재발생을 감지하여 감지결과로 모니터링 데이터를 출력할 수 있다. 이를 위하여, 도 3을 참조하면, 상기 화재 감지장치는 촬영부, 화재 감지부, 데이터 처리부, 통신부 및 경로 안내부를 포 함할 수 있다. 상기 촬영부는 빌딩, 공장 등에 설정된 감시공간 및/또는 감시구역을 실시간으로 촬영하여 영상 데이터를 생성할 수 있다. 이를 위하여, 상기 촬영부는 카메라 기반의 영상감시장치(CCTV등을 포함)로 촬영할 수 있 다. 상기 화재 감지부는 상기 영상 데이터에 대한 인공지능 분석을 기반으로 화재발생을 감지하여 화재감지 데 이터를 생성할 수 있다. 이를 위하여, 도 4를 참조하면, 상기 화재 감지부는 상기 영상 데이터로부터 영상 이미지를 획득하고, 상기 영상 이미지를 복수의 블록으로 분할하는 이미지 획득부, 상기 복수의 블록으로 각각 분할된 영상 이미지로부터 화염영역 및/또는 연기영역을 검출하는 영상처리부 및 상기 검출된 화염영 역 및/또는 연기영역의 면적 및/또는 개수를 산출하되, 상기 산출된 화염영역 및/또는 연기영역의 면적 및/또는 개수를 화재발생 기준값과 비교하고, 비교결과로 화재감지 데이터를 생성하여 출력하는 감지결과출력부를 포함할 수 있다. 상기 이미지 획득부는 상기 촬영부로부터 영상을 입력받고, 입력받은 영상으로부터 정지 화면에 해당 하는 영상 이미지를 생성할 수 있다. 또한, 상기 이미지 획득부는 영상 이미지를 미리 설정된 복수의 블록 으로 분할할 수 있다. 이때, 상기 이미지 획득부는 영상 이미지를 미리 설정된 개수 및/또는 크기로 분할 하여 복수의 블록을 생성할 수 있다. 상기 영상처리부는 설정된 방법에 따라 영상 이미지로부터 화염 영역 및/또는 연기영역을 검출할 수 있다. 또한, 상기 영상처리부는 딥러닝 기반, 예컨대 Edge IoT 기반의 인공지능 분석을 이용하여 영상 이미지로 부터 화염 영역 및/또는 연기영역을 검출할 수 있다. 우선, 상기 영상처리부의 화염영역 검출방법부터 설명하면, 상기 영상처리부는YCbCr(휘도 신호 및 색 차 신호의 표본화 주파수 비율)(Y: 휘도, CbCr: 색)을 활용하여 영상 이미지로부터 화염 영역을 검출할 수 있다. 더 상세하게는, 상기 영상처리부는 영상 이미지를 미리 설정된 YCbCr(휘도 신호 및 색차 신호의 표 본화 주파수 비율)(Y: 휘도, CbCr: 색) 컬러 공간으로 변환할 수 있다. 또한, 상기 영상처리부는 아래의 수학식 1을 참조하여 YCbCr 컬러 공간에서 조도를 발생시키는 유해 효과를 제거할 수 있다.[수학식 1]"}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한, 상기 영상처리부는 상기 수학식 1에서 1을 만족하는 (x,y)의 지점을 화염픽셀로 규정할 수 있다. [수학식 2]"}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 수학식 2에서 τ은 상수이며 ROC(Receiver Operating Characteristics, 수신자조작특성) 분석에 의해 결 정될 수 있다. 여기서, ROC는 신호탐지이론에서 적중확률대 오경보확률에 대한 그래프이며, 예를 들면, ROC 그 래프에서 좌하단은 절대 “있음”이라고 하지 않는 구분자를 말하는데 탈루를 발생시키지 않지만 적중하지도 않 는 것을 의미할 수 있다. 이와 반대로, 우상단은 무조건 “있음”이라고 하는 경우이고, 좌상단은 완벽한 구분 을 해내는 것을 의미할 수 있다. 즉, ROC 그래프에서 좌하단으로 갈수록 보수적이며, 우상단으로 갈수록 모험적 일 수 있다. 또한, 상기 영상처리부는 영상 이미지로부터 화염 후보 영역을 분리한 후 화염 후보 영역을 영상 처리하여 화염 후보 영역으로부터 화염 영역을 확정할 수 있다. 여기서, 상기 영상처리부는 화염 판단 기준에 따라 화염 후보 영역을 분석하여 화염 영역을 확정하며, 화염 판단 기준은 화염 표면에서 관찰된 불규칙성, 화염의 거침, 화염 지역의 변화량, 화재 영역의 3차 확률 모먼트 중 적어도 하나를 포함하여 설정될 수 있다. 이때, 3 차 확률 모먼트는 아래의 수학식 3을 참조하여 구할 수 있다. [수학식 3]"}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "다음, 상기 영상처리부의 연기영역 검출방법을 설명하면, 상기 영상처리부는 영상 이미지에 랜덤 포 레스트 분류 기법을 적용하여 영상 이미지로부터 연기 후보 영역을 검출할 수 있다. 여기서, 연기는 미립자 크 기가 0.1 ~ 1μm이기 때문에 매우 가벼워 대기중에서 상승하는 특징이 있으며, 흰색, 회색, 검은색 계통이고, 밝기, 움직임 누적, 확산의 3가지 특징을 활용하여 검출하는 것이 바람직하다. 또한, 실외의 연기는 외부 환경 변수에 영향을 많이 받기 때문에, 랜덤 포레스트 분류 기법을 적용하는 것이 바람직하다. 더 상세하게는, 상기 영상처리부는 연속 촬영된 영상 이미지를 비교하여 감지 기준값 이상인 연기 후보 영 역의 블록을 관심영역으로 설정할 수 있다. 또한, 상기 영상처리부는 복수의 관심영역에 대해 서로 다른 랜덤 포레스트를 학습시키고, 학습결과 생성된 클래스를 누적하여 누적 확률 히스토그램을 생성할 수 있다. 또 한, 상기 영상처리부는 생성된 히스토그램으로부터 연기 영역을 확정할 수 있다. 이를 통해, 상기 영상처 리부는 확산되는 연기의 외곽을 검출할 수 있다. 아울러, 상기 랜덤 포레스트는 다수의 결정 트리들을 학습하는 앙상블 방법으로, 랜덤 노드 최적화(randomized node optimization)와 배깅(bootstrap aggregating bagging)을 결합한 방법과 같은CART(classification and regression tree)를 사용해 상관관계가 없는 트리들로 포레스트를 구성하는 방법이다. 이러한 랜덤 포레스트는 높은 정확성, 간편하고 빠른 학습 및 테스트 알고리즘, 임의화를 통한 일반화 등의 특징을 가질 수 있다. 상기 감지결과출력부는 검출된 화염영역 및/또는 연기영역의 블록면적 및/또는 블록개수를 산출하고 상기 산출된 화염영역 및/또는 연기영역의 블록면적 및/또는 블록개수를 화재발생 기준값과 비교한 후 블록면적 및/ 또는 블록개수가 화재발생 기준값보다 큰 경우, 화재발생 감지결과로서 화재감지 데이터를 생성할 수 있다. 또 한, 상기 감지결과출력부는 상기 화재감지 데이터를 상기 데이터 처리부로 출력할 수 있다. 상기 데이터 처리부는 상기 화재감지 데이터를 처리 및/또는 변환하여 이미지 및/또는 메타데이터를 포함 하는 모니터링 데이터를 생성할 수 있다. 구체적으로, 상기 데이터 처리부는 개인정보보호를 위하여 상기 모니터링 데이터로부터 개인정보를 검출하 고, 상기 개인정보에 개체 마스킹 및/또는 스크램블을 적용하여 상기 모니터링 데이터를 처리할 수 있다. 또한, 상기 데이터 처리부는 상기 모니터링 데이터의 이미지(화재발생 이미지)의 용량 축소를 위하여 상기 모니 터링 데이터의 압축을 지원할 수 있다. 또한, 상기 데이터 처리부는 정보보호를 위하여 상기 모니터링 데 이터의 메타데이터를 이용하여 전송 암호화를 지원할 수 있다. 상기 통신부는 상기 모니터링 데이터를 외부 장치인 상기 관제서버로 송신할 수 있다. 또한, 상기 통 신부는 상기 화재감지장치 및/또는 자체적으로 저장된 건물정보를 상기 관제서버로 송신할 수 있다. 또한, 상기 통신부는 상기 관제서버로부터 화재대피경로, 및 화재진압경로 중 적어도 하나를 수신할 수 있다. 여기서, 건물정보는 사무용 빌딩, 공장 등으로 구분되는 건물유형, 감시공간 및/또는 감시구역 의 도면(지도)정보, 내장 및/또는 외장에 대한 인테리어 정보, 시간대별 재실인원 중 적어도 하나를 포함할 수 있다. 상기 경로 안내부는 상기 건물정보를 이용하여 상기 화재대피경로 및/또는 상기 화재진압경로에 따라 경고 방송 송출 및/또는 경고비상등 점등을 수행하고, 상기 화재대피경로 및/또는 화재진압경로를 대피자 및/또는 진 압자에게 선택적으로 알릴 수 있다. 한편, 상기 화재감지장치는 화재감지(1회/10초), 온도/이산화탄소 변화 감지(10초), 작동여부 점검(1회/초), 온도/이산화탄소 증가세 1분 이상 지속 감지(1회/분) 등을 포함하는 주기 설정에 따라 작동할 수 있다. 이를 위하여, 상기 화재감지장치는 온도 및/또는 가스(기체)를 감지할 수 있는 센서와, 상기 주기 설정에 따라 설정된 동작을 작동시키는 제어장치를 더 포함할 수 있다. 예를 들면, 상기 화재감지장치는 상기 통신부를 통해 상기 관제서버에 상기 건물정보와, 이미지 를 포함하는 상기 모니터링 데이터를 설정된 시간 간격으로 전송할 수 있다. 상기 관제서버는 상기 화재감지장치에서 화재발생이 감지된 경우, 상기 모니터링 데이터를 수신하고, 수신된 모니터링 데이터를 암호해제 및/또는 복호화하여 영상확인 및 관제 표출하며, 현장 및/또는 관제실에 근 무중인 관제 담당자의 관제단말기로 송신하여 관제단말기에서 팝업알림 및/또는 음향출력으로 감지결과를 표시 하도록 감지결과를 통지할 수 있다. 이를 위하여, 상기 관제서버는 관제지원부, 관제보완부, 원 격관제보완부, 화재알림부 및 경로정보제공부를 포함할 수 있다. 상기 관제지원부는, 상기 화재감지장치에서 화재발생이 감지된 경우, 화재발생의 감지결과를 현장 및 /또는 관제실에 근무중인 관제 담당자의 관제단말기로 송신하여 관제단말기에서 팝업알림 및/또는 음향출력으로 감지결과를 표시하도록 감지결과를 통지할 수 있다. 이때, 관제 담당자가 관제단말기의 팝업창을 통해 시각화된 화재발생영역을 최종 검토한 후 현장에 보다 효율적으로 알리고 경고할 수 있도록, 관제지원부는 화재발생 에 대한 관제를 지원할 수 있다. 즉, 관제지원부는 관제 담당자가 의사결정 지원시스템을 통해 화재발생 여부를 확인할 수 있도록 지원할 수 있다. 이를 위하여, 도 6을 참조하면, 상기 관제지원부는, 상기 화재발생이 감지된 위치에 대한 정보를 건물의 도면 정보를 반영하여 2차원 또는 3차원 구역으로 생성하는 구역이미지 생성부, 상기 구역의 조도, 온도, 습도, 풍향, 퐁속 중 어느 하나 이상의 환경정보를 건물의 내부 및/또는 외부에 설치된 기상정보센서를 통해 수 신하고, 감지된 상기 화재발생을 보정하는 화재발생 보정부 및 상기 화재발생 및 상기 환경정보를 기반으 로 상기 구역을 통해 설정된 시간 내 화재 확산이 예상되는 주변 구역을 연산하여 추가 생성하는 화재확산정보 생성부를 포함할 수 있다. 상기 관제보완부는, 상기 화재감지부에서 화재발생을 감지한 경우, 화재발생여부에 대한 의사결정의 정확성 향상을 위하여, 관제보완기능을 수행할 수 있다. 이를 위하여, 도 7을 참조하면, 상기 관제보완부 는, 감시공간 및/또는 감시구역에 대한 영상데이터를 수집하는 영상데이터 수집부, 영상데이터를 통해 확 인되는 구역에 대응되는 위치에 설치된 센서를 통해 센서데이터를 수집하는 센서데이터 수집부, 상기 영상 데이터를 통해 확인된 불꽃발생 및/또는 연기발생 정보와 상기 센서데이터를 통해 수집된 이상온도 및/또는 이 상습도 발생/지속 여부를 매칭하는 정보매칭부 및 상기 매칭 결과로 최종 화재발생여부를 판독하여 관제보 완기능을 수행하는 판독검증부를 포함할 수 있다.여기서, 상기 정보매칭부는 불꽃발생에 대한 영상데이터와 불꽃에 대한 제1 센서데이터를 매칭하여 불꽃 발생 여부를 판독하는 제1 매칭기능, 연기발생에 대한 영상데이터와 연기에 대한 제2 센서데이터를 매칭하여 연 기 발생 여부를 판독하는 제2 매칭기능, 이상온도에 대한 영상데이터와 온도에 대한 제3 센서데이터를 매칭하여 이상온도를 감지하는 제3 매칭기능 중 적어도 어느 하나의 매칭기능을 수행할 수 있다. 이러한 상기 관제보완부에서는 화재발생여부를 보다 정확하게 감지하고 판독하기 위하여 CCTV등을 포함하 는 영상감시장치를 통해 수집한 영상데이터 뿐만 아니라 불꽃, 연기, 온도 및 습도 중 적어도 하나를 감지하는 센서를 통해 수집된 센서 데이터를 활용해 종합적으로 분석하여 해당 영역에 대한 화재발생여부에 대한 판단의 정확성을 상승시키고자 한다. 상기 원격관제보완부는, 현장 및/또는 관제실에서 설정된 시간 내 반응(응답)이 없는 경우와 같이 추가 대 응이 필요한 상황에서 원격지원을 통해 화재발생여부를 보완적으로 확인하도록 지원할 수 있다. 만약, 현장 및/ 또는 관제실에서 상황에 따라 설정된 시간동안 화재발생여부에 대한 의사결정이 처리되지 않은 경우, 상기 원격 관제보완부는 신속하게 화재발생에 대처하기 위하여 원격지원으로 화재발생여부에 대한 의사결정을 처리하 도록 지원할 수 있다. 예를 들면, 상기 원격관제보완부는 관제 담당자의 상급자 및/또는 동료의 관제단말기 및/또는 휴대단말기 로 화재발생의 감지결과를 통지한 후 원격지원으로 화재발생여부에 대한 의사결정을 입력받아서 처리할 수 있다. 또한, 상기 원격관제보완부는 현장 및/또는 관제실에서 관제 담당자가 부재중인 경우, 관제단말기 뿐만 아니라 휴대단말기로 화재발생의 감지결과를 통지한 후 원격지원으로 화재발생여부에 대한 의사결정을 입 력받아서 처리할 수 있다. 상기 화재알림부는, 화재발생이 확인되는 감시영역 및/또는 감시공간에 화재에 대한 알림 및/또는 경고를 수행하고, 화재대피 등의 후속조치를 지원할 수 있다. 예를 들면, 화재알림부는, 스피커를 이용하여 화재 알림방송을 송출하거나, 점등장치를 이용하여 화재알림등을 점등시킬 수 있다. 도 8을 참조하면, 상기 경로정보제공부는, 화재발생구역 및/또는 화재확산구역을 구분하는 화재구역 설정 부, 경고방송 송출 및/또는 경고비상등 점등을 수행하는 화재경고부 및 화재대피경로 및/또는 화재진 압경로를 산출하고, 상기 화재대피경로 및/또는 화재진압경로를 대피자 및/또는 진압자에게 선택적으로 알리는 경로알림부를 포함할 수 있다. 도 9를 참조하면, 상기 화재구역 설정부는, 화재발생구역에 해당하는 위치에 대한 정보를 건물의 도면 정 보를 반영하여 2차원 또는 3차원 구역으로 이미지를 생성하는 화재발생구역 이미지 생성부 및 상기 화재발 생구역 및 상기 화재발생구역의 인근에 위치하는 구역의 화재등급 및/또는 상기 구역 및 상기 인근 구역에 영향 을 미치는 풍향 및/또는 퐁속 정보를 기반으로 상기 화재발생구역을 통해 설정된 시간 내 화재 확산이 예상되는 화재확산구역을 연산하여 추가적으로 생성하고, 상기 화재발생구역과 상기 화재확산구역를 구분하는 화재확산구 역 설정부를 포함할 수 있다. 화재경고부는 스피커를 이용하여 경고방송을 출력할 수 있도록 방송신호를 송출하거나, 경고표시장치를 이 용하여 경고비상등을 점등할 수 있도록 점등신호를 송출할 수 있다. 상기 경로알림부는 화재 발생시 회적의 화재대피경로 및 화재진압경로에 대해 대피자 및 진압자에게 시각 화된 정보를 제공할 수 있다. 이를 위하여, 도 10을 참조하면, 상기 경로알림부는 화재발생구역 정보(이미 지), 화재확산구역 정보(이미지), 화재발생구역 및 화재확산구역을 포함하는 건물의 이동통로 정보를 기반으로 적어도 하나의 화재대피경로를 생성하는 대피경로 생성부, 화재발생구역 정보(이미지), 화재확산구역 정보 (이미지), 화재발생구역 및 화재확산구역을 포함하는 건축구조물의 이동통로 정보를 기반으로 적어도 하나의 화 재진압경로를 생성하는 진압경로 생성부, 건축구조물 내부에 위치하는 재실자가 대피자 또는 진압자인지 여부를 확인하는 재실자특성 분석부, 및 재실자가 대피자인 경우 대피경로를 추천하거나, 재실자가 진압자 인 경우 진압경로를 추천하는 경로추천부를 포함할 수 있다. 이러한, 경로알림부는, 기 설치된 경로표시장치의 표시색상 및/또는 점멸패턴을 설정하여 화재대피경로 및 /또는 화재진압경로를 안내할 수 있다. 한편, 상기 경로정보제공부는, 설정된 대피경로로의 대피자의 대피상황을 모니터링 하는 대피경로 모니터 링부, 상기 대피자 대피경로와 상기 화재확산구역의 실시간 및/또는 설정된 시간 내 확산 예측정보에 따른 겹침여부를 실시간 확인하는 대피위험 모니터링부 및 상기 대피경로와 화재확산구역의 겹침이 예상되는 경우, 상기 대피경로를 재설정하는 대피경로 재설정부를 더 포함할 수 있다. 또 한편, 상기 화재감지장치로부터 설정된 시간 간격으로 상기 모니터링 데이터를 수신하는 상기 관제서버 는 정상신호를 통해 신호상태 연결성을 점검하고, 상기 화재감지장치의 화재감지시 매분에서 10초 단 위로 시간이 상승하면서 정보를 수신할 수 있다. 이러한 상태가 1분 이상 지속될 경우, 상기 관제서버는 관제 담당자에게 경고(통지)할 수 있다. 또한, 관제 담당자는 경고(통지)받는 즉시 1분동안 전달된 상기 모니터 링 데이터의 이미지 상태를 확인하고, 상기 관제서버를 통해 건물의 관리자 및/또는 진압자에게 화재발생 을 알릴 수 있다. 상술한 바에 따르면, 본 발명은 즉각적인 현장 화재 대응을 지원하고, 딥러닝의 인공지능 기반으로 오탐율을 감 소시킬 수 있다. 또한, 본 발명은 개인정보 마스킹, 압축, 암호화를 통해 개인정보보호를 지원할 수 있다. 또한, 본 발명은 이미지 및/또는 메타데이터 전송을 통해 네트워크 사용량 및 영상 저장공간을 절감할 수 있다. 또한, 본 발명은 화재감지장치의 현장설치를 통해 영상분석 서버 비용을 절감할 수 있다. 또한, 본 발명은 관제서버의 인프라 변경을 최소화할 수 있다. 또한, 본 발명은 영상모니터링을 이용하여 현장에서 발생 가능한 화염이나 연기 등 화재 발생을 원격으로 감시 할 수 있다. 또한, 본 발명은 건물의 도면 정보를 연계하여 화재발생구역의 이미지를 생성하고 표시수단을 이용하여 화재발 생여부에 대한 의사결정을 지원함으로써, 의사결정에 대한 편의성을 향상시킬 수 있다. 또한, 본 발명은 화재발생구역의 내외부에 대한 환경정보를 연계 반영하여 화재 오류를 보정함으로써, 화재발생 의 정확성을 향상시킬 수 있다. 또한, 본 발명은 화재 확산 방향을 예측하고, 추가 관제 지원하여 화재 확산에 의한 추가 피해를 감소시킬 수 있다. 또한, 본 발명은 영상 데이터만을 토대로 화재를 감지할 경우에 발생하는 판단 오류를 방지하기 위하여 추가적 으로 센서 데이터를 필요에 따라 매칭하여 검증하고, 이를 통해 화재 감지의 정확도를 높일 수 있다. 또한, 본 발명은 건물 정보를 이용하여 화재발생구역과 화재확산구역을 구분함으로써 유효한 화재대피경로 및/ 또는 화재진압경로를 산출할 수 있다. 또한, 본 발명은 화재등급, 풍향, 풍속을 기반으로 화재확산구역을 설정함으로써 화재확산에 대한 예측 정확도 를 향상시킬 수 있다. 또한, 본 발명은 재실자를 분류하여 재실자에게 차별화된 정보를 제공할 수 있다. 또한, 본 발명은 실시간으로 대피경로와 화재확산을 모니터링하여 안전한 대피경로와 효과적인 진압경로를 설정 하여 대피자 및/또는 진압자에게 제공할 수 있다."}
{"patent_id": "10-2020-0011289", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0011289", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 화재감지시스템의 구성을 나타내는 도면이다. 도 2는 도 1의 관제서버의 네트워크 연결을 나타내는 도면이다. 도 3은 도 1의 화재감지장치의 구성을 상세하게 나타내는 도면이다. 도 4는 도 3의 화재 감지부의 구성을 상세하게 나타내는 도면이다. 도 5는 도 1의 관제서버의 구성을 상세하게 나타내는 도면이다. 도 6은 도 5의 관제지원부의 구성을 상세하게 나타내는 도면이다. 도 7은 도 5의 관제보완부의 구성을 상세하게 나타내는 도면이다. 도 8은 도 4의 경로정보제공부의 구성을 상세하게 나타내는 도면이다. 도 9는 도 8의 화재구역 설정부의 구성을 상세하게 나타내는 도면이다. 도 10은 도 8의 경로알림부의 구성을 상세하게 나타내는 도면이다."}
