{"patent_id": "10-2022-0015981", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0115826", "출원번호": "10-2022-0015981", "발명의 명칭": "가상 키보드 상의 터치 입력으로부터 사용자 의도를 인식하기 위한 전자 장치, 방법, 및 비일", "출원인": "삼성전자주식회사", "발명자": "김준성"}}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 터치 입력을 야기한 입력 수단의 유형을 식별하고, 상기 식별된 유형이 사용자의 손가락인지 또는 스타일러스 펜인지 여부에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 적어도 하나의 제3 캐릭터의 적어도 일부를 포함하는 복수의 미리 결정된 단어들 중에서, 상기 적어도 하나의 제3 캐릭터 다음의 캐릭터로 상기 제1 캐릭터를 포함하는 적어도 하나의 제1 단어를 식별하고, 상기 복수의 미리 결정된 단어들 중에서, 상기 적어도 하나의 제3 캐릭터 다음의 캐릭터로 상기 제2 캐릭터를포함하는 적어도 하나의 제2 단어를 식별하고, 상기 적어도 하나의 제3 캐릭터로부터 도출된 맥락(context)과 상기 적어도 하나의 제1 단어 사이의 제1 관계및 상기 맥락과 상기 적어도 하나의 제2 단어 사이의 제2 관계에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 접촉점의 위치에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 위치에 기반하여, 상기 전자 장치 내에 저장된, 상기 가상 키보드의 사용 이력에 대한 정보를 식별함으로공개특허 10-2023-0115826-3-써, 상기 터치 입력이 상기 제1 키에 대한 입력일 제1 확률 및 상기 터치 입력이 상기 제2 키에 대한 입력일 제2 확률을 식별하고, 상기 제1 확률 및 상기 제2 확률에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서, 상기 복수의 키들은, 미리 결정된 영역 내의 제3 키들 및 상기 미리 결정된 영역 밖의 제4 키들을 포함하고, 상기 제1 확률 및 상기 제2 확률은, 상기 제1 키가 상기 제3 키들 중 하나의 키인지 또는 상기 제4 키들 중 하나의 키인지 여부에 따라, 변경되는,전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 터치 입력에 응답하여, 상기 제1 키를 감싸는 키들 중 상기 맥락에 대응하는 키를 상기 제2 키로 식별하도록, 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 제1 캐릭터, 상기 제2 캐릭터, 및 상기 적어도 하나의 제3 캐릭터에 기반하여 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 없는 조건 상에서, 확대된 사이즈를 가지는 상기 제1 키 및 확대된 사이즈를 가지는 상기 제2 키를 상기 디스플레이를 통해 표시하고, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키 중 하나의 키에 대한다른(another) 터치 입력을 수신하고, 상기 다른 터치 입력이 수신된 상기 키에 의해 나타내어지는 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시하도록, 더 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 다른 캐릭터가 상기 텍스트 입력 부분 내에서 표시되기 전 상기 텍스트 입력 부분 내에서 표시된 상기 캐릭터를상기 텍스트 입력 부분으로부터 삭제하기 위한 입력이 상기 가상 키보드를 통해 수신되는지 여부에 기반하여,상기 전자 장치 내에 저장된, 상기 가상 키보드의 사용 이력에 대한 정보를 조정하도록, 더 구성되는, 전자 장치. 공개특허 10-2023-0115826-4-청구항 9"}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치의 모드가 포트레이트 모드(portrait mode)인지 또는 랜드스케이프 모드(landscape mode)인지 여부에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 제1 키의 위치와 상기 터치 입력을 야기한 사용자의 손의 위치 사이의 상대적 위치 관계에 더 기반하여,상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 터치 입력 바로 이전에 다른(another) 터치 입력이 상기 복수의 키들 중 하나의 키에 대하여 수신되었던타이밍과 상기 터치 입력이 수신되었던 타이밍 사이의 시간에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 1에 있어서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 제1 키에 의해 나타내어지는 상기 제1 캐릭터가 상기 적어도 하나의 제3 캐릭터로부터 도출된 맥락에 대응함을 식별하는 것에 기반하여, 상기 제2 키에 의해 나타내어지는 상기 제2 캐릭터를 식별하는 것을 삼가하거나(refrain from) 우회하고(bypass), 상기 제1 캐릭터를 상기 캐릭터로 식별하도록, 더 구성되는, 전자 장치."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "디스플레이를 포함하는 전자 장치를 동작하기 위한 방법에 있어서, 상기 디스플레이를 통해 표시된 가상 키보드 내의 복수의 키들 중 제1 키 상에서 접촉점(a point of contact)을가지는 터치 입력을 수신하고, 공개특허 10-2023-0115826-5-상기 터치 입력에 응답하여, 상기 제1 키에 의해 나타내어지는 제1 캐릭터, 상기 복수의 키들 중 상기 제1 키에인접한 제2 키에 의해 나타내어지는 제2 캐릭터, 및 상기 가상 키보드와 함께 표시된 텍스트 입력 부분 내에서상기 터치 입력이 수신되기 전 표시되었던 적어도 하나의 제3 캐릭터에 기반하여, 상기 제1 캐릭터 및 상기 제2캐릭터 중 하나의(a) 캐릭터를 식별하는 동작과, 상기 식별된 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시하는 동작을 포함하는, 방법."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하는 동작은, 상기 적어도 하나의 제3 캐릭터를 포함하는 복수의 미리 결정된 단어들 중에서, 상기 적어도 하나의 제3 캐릭터다음의 캐릭터로 상기 제1 캐릭터를 포함하는 적어도 하나의 제1 단어를 식별하는 동작과, 상기 복수의 미리 결정된 단어들 중에서, 상기 적어도 하나의 제3 캐릭터 다음의 캐릭터로 상기 제2 캐릭터를포함하는 적어도 하나의 제2 단어를 식별하는 동작과, 상기 적어도 하나의 제3 캐릭터로부터 도출된 맥락(context)과 상기 적어도 하나의 제1 단어 사이의 제1 관계및 상기 맥락과 상기 적어도 하나의 제2 단어 사이의 제2 관계에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하는 동작을 포함하는, 방법."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하는 동작은, 상기 접촉점의 위치에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하는 동작을 포함하는, 방법."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하는 동작은, 상기 위치에 기반하여, 상기 전자 장치 내에 저장된, 상기 가상 키보드의 사용 이력에 대한 정보를 식별함으로써, 상기 터치 입력이 상기 제1 키에 대한 입력일 제1 확률 및 상기 터치 입력이 상기 제2 키에 대한 입력일 제2 확률을 식별하는 동작과, 상기 제1 확률 및 상기 제2 확률에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하는 동작을 포함하는, 방법."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서, 상기 복수의 키들은, 미리 결정된 영역 내의 제3 키들 및 상기 미리 결정된 영역 밖의 제4 키들을 포함하고, 상기 제1 확률 및 상기 제2 확률은, 공개특허 10-2023-0115826-6-상기 제1 키가 상기 제3 키들 중 하나의 키인지 또는 상기 제4 키들 중 하나의 키인지 여부에 따라, 변경되는,방법."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 15에 있어서, 상기 터치 입력에 응답하여, 상기 제1 키를 감싸는 키들 중 상기 맥락에 대응하는 키를 상기 제2 키로 식별하는동작을 더 포함하는, 방법."}
{"patent_id": "10-2022-0015981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "하나 이상의 프로그램들을 저장하는 비일시적 컴퓨터 판독가능 저장 매체에 있어서, 상기 하나 이상의 프로그램들은, 디스플레이를 포함하는 전자 장치의 프로세서에 의해 실행될 시, 상기 디스플레이를 통해 표시된 가상 키보드 내의 복수의 키들 중 제1 키 상에서 접촉점(a point of contact)을가지는 터치 입력을 수신하고, 상기 터치 입력에 응답하여, 상기 제1 키에 의해 나타내어지는 제1 캐릭터, 상기 복수의 키들 중 상기 제1 키에인접한 제2 키에 의해 나타내어지는 제2 캐릭터, 및 상기 가상 키보드와 함께 표시된 텍스트 입력 부분 내에서상기 터치 입력이 수신되기 전 표시되었던 적어도 하나의 제3 캐릭터에 기반하여, 상기 제1 캐릭터 및 상기 제2캐릭터 중 하나의(a) 캐릭터를 식별하고, 상기 식별된 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함하는, 비일시적 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2022-0015981", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른, 디스플레이를 포함하는 전자 장치를 동작하기 위한 방법은, 상기 디스플레이를 통해 표시된 가상 키보드 내의 복수의 키들 중 제1 키 상에서 접촉점(a point of contact)을 가지는 터치 입력을 수신하는 동 작을 포함할 수 있다. 상기 방법은, 상기 터치 입력에 응답하여, 상기 제1 키에 의해 나타내어지는 제1 캐릭터, 상기 복수의 키들 중 상기 제1 키에 인접한 제2 키에 의해 나타내어지는 제2 캐릭터, 및 상기 가상 키보드와 함 께 표시된 텍스트 입력 부분 내에서 상기 터치 입력이 수신되기 전 표시되었던 적어도 하나의 제3 캐릭터에 기반 하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의(a) 캐릭터를 식별하는 동작을 포함할 수 있다. 상기 방법 은, 상기 식별된 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시하는 동작을 포함할 수 있 다."}
{"patent_id": "10-2022-0015981", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명들은, 가상 키보드(virtual keyboard) 상의 터치 입력으로부터 사용자 의도(user intent)를 인식하 기 위한 전자 장치(electronic device), 방법, 및 비일시적 컴퓨터 판독가능 저장 매체에 관한 것이다."}
{"patent_id": "10-2022-0015981", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치의 디스플레이를 통해 표시되는 가상 키보드(virtual keyboard)는, 물리적 키들의 요구 없이 캐릭터 (character)들의 입력을 인가하는 소프트웨어 구성요소일 수 있다. 상기 가상 키보드와의 인터액션 (interaction)은, 상기 디스플레이와 작동적으로 결합된 상기 전자 장치의 터치 센서를 통해 통상(mostly) 발생 할(happen) 수 있다."}
{"patent_id": "10-2022-0015981", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "복수의 캐릭터(character)들을 각각 나타내는(indicate) 가상 키보드(virtual keyboard)의 복수의 키들은, 전 자 장치의 디스플레이의 표시 영역의 한계로 인하여, 서로 인접하게 배열될(arranged) 수 있다. 이러한 배열로 인하여, 의도되지 않은(non-intended) 캐릭터가 상기 가상 키보드 상의 터치 입력에 응답하여 상기 디스플레이를 통해 표시되는 타이포그래피컬 에러(typographical error)가 발생할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2022-0015981", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0015981", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른, 전자 장치(electronic device)는, 디스플레이, 인스트럭션(instruction)들을 저장하도록 구 성된 메모리, 및 프로세서를 포함할 수 있다. 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 디스플 레이를 통해 표시된 가상 키보드 내의 복수의 키들 중 제1 키 상에서 접촉점(a point of contact)을 가지는 터 치 입력을 수신하도록 구성될 수 있다. 상기 프로세서는, 상기 터치 입력에 응답하여, 상기 제1 키에 의해 나 타내어지는 제1 캐릭터, 상기 복수의 키들 중 상기 제1 키에 인접한 제2 키에 의해 나타내어지는 제2 캐릭터, 및 상기 가상 키보드와 함께 표시된 텍스트 입력 부분 내에서 상기 터치 입력이 수신되기 전 표시되었던 적어도 하나의 제3 캐릭터에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의(a) 캐릭터를 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 식별된 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시 하도록, 구성될 수 있다. 일 실시예에 따른, 디스플레이를 포함하는 전자 장치를 동작하기 위한 방법은, 상기 디스플레이를 통해 표시된 가상 키보드 내의 복수의 키들 중 제1 키 상에서 접촉점(a point of contact)을 가지는 터치 입력을 수신하는 동작을 포함할 수 있다. 상기 방법은, 상기 터치 입력에 응답하여, 상기 제1 키에 의해 나타내어지는 제1 캐릭 터, 상기 복수의 키들 중 상기 제1 키에 인접한 제2 키에 의해 나타내어지는 제2 캐릭터, 및 상기 가상 키보드 와 함께 표시된 텍스트 입력 부분 내에서 상기 터치 입력이 수신되기 전 표시되었던 적어도 하나의 제3 캐릭터 에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의(a) 캐릭터를 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 식별된 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시하는 동작을 포 함할 수 있다. 일 실시예에 따른, 비일시적 컴퓨터 판독가능 저장 매체는, 하나 이상의 프로그램들을 저장할 수 있다. 상기 하나 이상의 프로그램들은, 디스플레이를 포함하는 전자 장치의 프로세서에 의해 실행될 시, 상기 디스플레이를 통해 표시된 가상 키보드 내의 복수의 키들 중 제1 키 상에서 접촉점(a point of contact)을 가지는 터치 입력 을 수신하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 프로세서에 의해 실행될 시, 상기 터치 입력에 응답하여, 상기 제1 키에 의해 나타내어지는 제1 캐릭터, 상기 복수의 키들 중 상기 제1 키에 인접한 제2 키에 의해 나타내어지는 제2 캐릭터, 및 상기 가상 키보드와 함 께 표시된 텍스트 입력 부분 내에서 상기 터치 입력이 수신되기 전 표시되었던 적어도 하나의 제3 캐릭터에 기 반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의(a) 캐릭터를 식별하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 프로세서에 의해 실행될 시, 상기 식별 된 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시하도록, 상기 전자 장치를 야기하는 인 스트럭션들을 포함할 수 있다."}
{"patent_id": "10-2022-0015981", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따른 전자 장치, 방법, 및 비일시적 컴퓨터 판독가능 저장 매체는, 터치 입력이 수신된 가상 키보 드 내의 제1 키에 의해 나타내어지는 제1 캐릭터 및 상기 제1 키에 인접한 제2 키에 의해 나타내어지는 제2 캐 릭터에 기반하여 상기 터치 입력을 인식함으로써, 상기 터치 입력에 의한 타이포그래피컬 에러(typographical error)의 발생을 감소시킬 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0015981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서 , 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서 는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈 , 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)과 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통 신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO(full dimensional MIMO)), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안 테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전 자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지 원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네 트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가 적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상 기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전 자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제 공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내 에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 일 실시예에 따라, 터치 입력에 응답하여 사용자에 의해 의도된 캐릭터를 식별하는 방법을 도시하는 흐 름도이다. 이러한 방법은, 도 1 내에서 도시된 전자 장치 또는 도 1 내에서 도시된 프로세서에 의해 실행될 수 있다. 도 3은 일 실시예에 따라 전자 장치의 디스플레이를 통해 표시되는 예시적인(exemplary) 가상 키보드를 도시한 다. 도 2를 참조하면, 동작 202에서, 프로세서는, 디스플레이(예: 디스플레이 모듈)를 통해 표시된 가상 키보드 내의 복수의 키들 중 제1 키 상에서 접촉점(a point of contact)을 가지는 터치 입력을 수신할 수 있다. 예를 들면, 상기 가상 키보드는, 물리적 키(physical key)들의 요구 없이 캐릭터(character)들의 입력을 인가하 는 소프트웨어 구성요소일 수 있다. 예를 들면, 상기 가상 키보드는, 상기 캐릭터들을 각각 나타내는 키들을 포함하는 복수의 키들을 포함할 수 있다. 예를 들면, 상기 캐릭터들 각각은, 의사 전달을 위해 정의된 개체(entity)일 수 있다. 예를 들면, 상기 캐릭터 들은, 글자(letter)를 포함할 수 있다. 예를 들면, 상기 캐릭터들은, 심볼(symbol), 마크(mark), 또는 사인 (sign)을 포함할 수 있다. 예를 들면, 상기 캐릭터들은, 숫자를 포함할 수 있다. 예를 들면, 상기 캐릭터들은, 이모티콘(emoticon) 또는 이모지 그래픽적 객체(emoji graphical object)와 같은, 아이콘을 포함할 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 상기 복수의 키들은, 상기 캐릭터들 중 하나의 캐릭터를 상기 디스플레이를 통해 표시하기 위한, 실 행가능한 객체(executable object)를 포함할 수 있다. 예를 들면, 상기 캐릭터는, 상기 실행가능한 객체에 대한 입력에 응답하여, 상기 디스플레이를 통해 표시될 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 상기 복수의 키들은, 미리 결정된 기능을 실행하기 위한 실행가능한 객체를 포함할 수 있다. 예를 들면, 상기 미리 결정된 기능은, 상기 가상 키보드와 함께 표시된 텍스트 입력 부분 내의 포인터(pointer)(또는 커서(cursor))의 위치를 변경하는 기능 및/또는 상기 텍스트 입력 부분 내에 표시된 캐릭터를 삭제하는 기능을 포함할 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 상기 디스플레이를 통해 표시되는 상기 가상 키보드는, 전자 장치의 설정 또는 사용자 설정에 따라, 다양한 배열들로 상기 복수의 키들을 포함할 수 있다. 예를 들어, 도 3을 참조하면, 상기 복수의 키들은, 전자 장치의 설정 또는 사용자 설정에 따라, 제1 배열로 상기 가상 키보드 내에 포함되거나, 제2 배열로 상기 가상 키보드 내에 포함되거나, 제3 배열로 상기 가상 키보드 내에 포함되거나, 제4 배열로 상기 가상 키보드 내에 포함될 수 있다. 하지만, 이에 제한되지 않는다. 일 실시예에서, 상기 가상 키보드는, 추천 단어 표시 영역과 함께, 표시될 수 있다. 예를 들면, 추천 단 어 표시 영역은, 도 4의 설명을 통해 후술될 복수의 미리 결정된 단어들 중 적어도 일부를 포함할 수 있다. 예를 들면, 추천 단어 표시 영역은, 포인터에 인접한 캐릭터 \"c\"를 포함하는 단어들인, \"cute\", \"charming\", \"cool\", 및 \"crazy\"를 포함할 수 있다. 하지만, 이에 제한되지 않는다. 다시 도 2를 참조하면, 상기 터치 입력은, 입력 수단(input means)으로부터 야기될 수 있다. 예를 들면, 상기 터치 입력은, 사용자의 손가락(finger)로부터 야기될 수 있다. 다른 예를 들면, 상기 터치 입력은, 전자 장치 와 연동되는 스타일러스 펜으로부터 야기될 수 있다. 하지만, 이에 제한되지 않는다. 상기 터치 입력은, 상기 입력 수단이 상기 디스플레이 상에 접촉된 점인 접촉점을 가질 수 있다. 예를 들면, 상기 접촉점은, 상기 입력 수단이 상기 디스플레이 상에 접촉된 영역 내의 복수의 점들 중 대표점 (representative point)일 수 있다. 예를 들어, 상기 디스플레이와 작동적으로 결합된 터치 센서가 정전용량 터치 센서(capacitive touch sensor)인 경우, 상기 접촉점은, 상기 터치 입력으로 인하여 가장 높은 또는 가장 많은 커패시턴스의 변화가 식별된 상기 디스플레이 내의 위치(position)일 수 있다. 하지만, 이에 제한되지 않 는다. 일 실시예에서, 상기 터치 입력의 상기 접촉점은, 상기 복수의 키들 중 제1 키 상에서 위치될 수 있다. 예를 들어, 도 3을 참조하면, 프로세서는, 상기 가상 키보드 내의 상기 복수의 키들 중 제1 키 상에서 접 촉점을 가지는 상기 터치 입력을 수신할 수 있다. 예를 들면, 상기 터치 입력은, 텍스트 입력 부분(text input portion)이 상기 가상 키보드와 함께 표시되는 동안, 수신될 수 있다. 예를 들면, 프로세서는, 상기 가상 키보드를 통해 수신된 적어도 하나의 다른 터치 입력에 기반하여 표시된 적어도 하 나의 제3 캐릭터 및 적어도 하나의 제3 캐릭터 옆에서 표시된 포인터를 포함하는 텍스트 입력 부분이 상기 가상 키보드와 함께 표시되는 동안, 상기 터치 입력을 수신할 수 있다. 예를 들면, 상기 가상 키보드 및 텍스트 입력 부분은, 텍스트 입력 부분을 제공하는 소프트웨어 어플 리케이션의 설정, 전자 장치의 설정, 또는 사용자 설정에 따라, 다양한 방법들(various ways)로 배열될 (arranged) 수 있다. 예를 들면, 상기 가상 키보드는, 도 3의 도시와 같이, 텍스트 입력 부분을 포함하는 사용자 인터페이스 상에 부분적으로(partially) 중첩될(superimposed on) 수 있다. 하지만, 이에 제한되 지 않는다. 다시 도 2를 참조하면, 동작 204에서, 프로세서는, 상기 터치 입력에 응답하여, 상기 제1 키에 의해 나타 내어지는 제1 캐릭터, 상기 복수의 키들 중 상기 제1 키에 인접한 제2 키에 의해 나타내어지는 제2 캐릭터, 및 상기 가상 키보드와 함께 표시된 텍스트 입력 부분(예: 도 3 내에서 도시된 텍스트 입력 부분) 내에서 상 기 터치 입력이 수신되기 전 표시되었던 상기 적어도 하나의 제3 캐릭터(예: 도 3 내에서 도시된 적어도 하나의 제3 캐릭터)에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의(a) 캐릭터를 식별할 수 있다. 예를 들어, 도 3을 참조하면, 프로세서는, 상기 터치 입력에 응답하여, 접촉점이 위치된 제1 키(30 6)에 의해 나타내어지는 상기 제1 캐릭터(예: \"h\")를 식별할 수 있다. 예를 들면, 상기 제1 캐릭터(예: \"h\")는, 접촉점이 상기 터치 입력을 야기한 사용자의 의도일 제1 확률을 고려하기 위해, 식별될 수 있다. 예를 들면, 프로세서는, 상기 터치 입력에 응답하여, 제1 키에 인접한 제2 키에 의해 나타내어 지는 상기 제2 캐릭터(예: \"u\")를 식별할 수 있다. 예를 들면, 프로세서는, 상기 터치 입력에 응답하여, 제1 키를 감싸는 제2 키, 제3 키, 제4 키, 제5 키, 제6 키, 제7 키, 및제8 키를 식별하고, 제2 키 내지 제8 키에 의해 각각 나타내어지는 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\")을 식별할 수 있다. 예를 들면, 상기 제2 캐릭터(예: \"u\") 또는 상기 캐릭터들 (예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\")은, 상기 접촉점의 위치가 상기 터치 입력을 야기한 사용자의 의 도가 아닐 제2 확률을 고려하기 위해, 식별될 수 있다. 일 실시예에서, 프로세서는, 제1 키를 감싸는 제2 키, 제3 키, 제4 키, 제5 키 , 제6 키, 제7 키, 및 제8 키에 의해 각각 나타내어지는 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\")을 식별하고, 상기 캐릭터들 중에서 상기 제2 캐릭터(예: \"u\")를 식별할 수 있다. 예를 들면, 프로세서는, 상기 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\") 중에서 적어도 하나의 제3 캐릭터로부터 도출된 맥락(context)에 대응하는 상기 제2 캐릭터(예: \"u\")를 식별할 수 있다. 프로세서 는, 상기 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\") 중에서 상기 제2 캐릭터(예: \"u\")를 식별 한 후, 상기 제1 캐릭터(예: \"h\"), 상기 제2 캐릭터(예: \"u\"), 및 적어도 하나의 제3 캐릭터에 기반하여, 제1 캐릭터(예: \"h\") 및 상기 제2 캐릭터(예: \"u\") 중 하나의 캐릭터를 식별할 수 있다. 하지만, 이에 제한되 지 않는다. 일 실시예에서, 프로세서는, 제1 키를 감싸는 제2 키, 제3 키, 제4 키, 제5 키, 제6 키, 제7 키, 및 제8 키에 의해 각각 나타내어지는 상기 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\")을 식별하고, 상기 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\") 중 상기 제2 캐릭터(예: \"u\")를 식별하는 것 없이, 상기 제1 캐릭터(예: \"h\"), 상기 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\"), 및 적어도 하나의 제3 캐릭터에 기반하여, 상기 제1 캐릭터(예: \"h\") 및 상기 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\") 중에서 하나의 캐릭터를 식별할 수 있다. 하지만, 이에 제한되지 않는다. 상기 맥락에 기반하여 상기 캐릭터를 식별하는 방법은, 도 4의 설명을 통해 보다 구체적으로 기술될 것이다. 한편, 예를 들면, 프로세서는, 상기 터치 입력에 응답하여, 상기 터치 입력이 수신되기 전 텍스트 입력 부 분 내에 포함된 적어도 하나의 제3 캐릭터를 식별할 수 있다. 예를 들면, 적어도 하나의 제3 캐릭터 는, 상기 제1 확률 및 상기 제2 확률을 식별하기 위해, 식별될 수 있다. 다시 도 2를 참조하면, 프로세서는, 상기 제1 캐릭터, 상기 제2 캐릭터, 및 상기 적어도 하나의 제3 캐릭 터에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 있다. 일 실시예에서, 프로세서는, 상기 터치 입력을 야기한 입력 수단의 유형을 식별하고, 상기 식별된 유형이 사용자의 손가락인지 또는 스타일러스 펜(stylus pen)인지 여부에 더(further) 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 예를 들면, 상기 손가락이 상기 가상 키보드 상에 접촉되 는 제1 면적은, 상기 스타일러스 펜이 상기 가상 키보드 상에 접촉되는 제2 면적보다, 넓을 수 있다. 상기 제1 면적과 상기 제2 면적 사이의 차이로 인하여, 상기 스타일러스 펜으로부터의 상기 터치 입력이 사용자의 의도와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확률은 상기 손가락으로부터의 상기 터치 입력이 사용자의 의도 와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확률보다 낮을 수 있기 때문에, 프로세서는, 입력 수단 의 유형에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 일 실시예에서, 프로세서는, 전자 장치의 모드가 포트레이트 모드(portrait mode)인지 또는 랜드스케 이프 모드(landscape mode)인지 여부에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식 별할 수 있다. 예를 들면, 상기 포트레이트 모드가 제공되는 동안 상기 가상 키보드 내의 상기 복수의 키들 각 각의 제1 사이즈는 상기 랜드스케이프 모드가 제공되는 상기 가상 키보드 내의 상기 복수의 키들 각각의 제2 사 이즈보다 작을 수 있다. 상기 제1 사이즈와 상기 제2 사이즈 사이의 차이로 인하여, 상기 포트레이트 모드 내 에서 상기 터치 입력이 사용자의 의도와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확률은 상기 랜드스케 이프 모드 내에서 상기 터치 입력이 사용자의 의도와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확률보다 높을 수 있기 때문에, 프로세서는, 전자 장치의 모드에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 일 실시예에서, 프로세서는, 상기 제1 키의 위치와 상기 터치 입력을 야기한 사용자의 손의 위치 사이의 상대적 위치 관계에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 예 를 들면, 상기 제1 키가 전자 장치를 그립한 상기 사용자의 손에 상대적으로 가깝게(relatively close to) 위치된 조건 상에서 상기 터치 입력이 상기 사용자의 의도와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확 률은 상기 제1 키가 상기 손으로부터 상대적으로 멀리(relatively far away from) 위치된 조건 상에서 상기 터 치 입력이 상기 사용자의 의도와 다르게 상기 제1 상에서 상기 접촉점을 가질 확률보다 낮기 때문에, 프로세서는, 상기 상대적 위치 관계에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 일 실시예에서, 프로세서는, 상기 터치 입력 바로 이전에 다른 터치 입력이 상기 복수의 키들 중 하나의 키(예: 도 3 내에서 도시된 적어도 하나의 제3 캐릭터 내의 \"c\")에 대하여 수신되었던 타이밍과 상기 터치 입력이 수신되었던 타이밍 사이의 시간에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 예를 들면, 상기 가상 키보드를 제1 속도로 타이핑하는 조건 상에서 상기 터치 입력이 사용자 의 의도와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확률은 상기 가상 키보드를 상기 제1 속도보다 느린 제2 속도로 타이핑하는 조건 상에서 상기 터치 입력이 상기 사용자의 의도와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확률보다 높을 수 있기 때문에, 프로세서는, 상기 시간에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 일 실시예에서, 프로세서는, 상기 접촉점의 위치에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 예를 들면, 상기 접촉점이 상기 제1 키의 센터 영역 내에서 위치되는 조건 상 에서 상기 터치 입력이 사용자의 의도와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확률은, 상기 접촉점이 상기 센터 영역 밖에서 위치되는 조건 상에서 상기 터치 입력이 사용자의 의도와 다르게 상기 제1 키 상에서 상 기 접촉점을 가질 확률보다 낮을 수 있기 때문에, 프로세서는, 상기 접촉점의 상기 위치에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 동작 206에서, 프로세서는, 상기 식별된 캐릭터를, 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시할 수 있다. 예를 들면, 상기 식별된 캐릭터가 상기 제1 캐릭터인 조건 상에서, 프로세서는 상기 터 치 입력을 상기 제1 키에 대한 입력으로 인식하고, 상기 인식에 따라 상기 제1 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 다른 예를 들면, 상기 식별된 캐릭터가 상기 제2 캐릭터인 조건 상에서, 프로세서 는, 상기 터치 입력을 상기 제1 키에 대한 입력 대신 상기 제2 키에 대한 입력으로 인식하고, 상기 인식에 따라 상기 제2 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 예를 들어, 도 3을 참조하면, 프로세서는, 동작 204의 상기 식별에 기반하여, 커서에 의해 나타내어 지는 공간에서, 제1 키에 의해 나타내어지는 상기 제1 캐릭터(예: \"h\")를 표시하거나 제2 키에 의해 나타내어지는 상기 제2 캐릭터(예: \"u\")를 표시할 수 있다. 상술한 바와 같이, 전자 장치는, 상기 터치 입력의 상기 접촉점이 위치된 상기 제1 키에 의해 나타내어지 는 상기 제1 캐릭터 뿐 아니라 상기 제1 키에 인접한 상기 제2 키에 의해 나타내어지는 상기 제2 캐릭터 및 상 기 터치 입력 이전에 상기 텍스트 입력 부분에 입력된 상기 적어도 하나의 제3 캐릭터를 이용하여, 상기 터치 입력을 인식할 수 있다. 전자 장치는, 이러한 인식을 통해, 타이포그래피컬 에러(typographical error)의 발생을 감소시킬 수 있다. 다시 말해, 전자 장치는, 상기 가상 키보드의 이용과 관련된 사용자 편의성을 강화할 수 있다. 도 4는 일 실시예에 따라, 제1 캐릭터 및 제2 캐릭터 중 하나의 캐릭터를 식별하는 방법을 도시하는 흐름도이다. 이러한 방법은, 도 1 내에서 도시된 전자 장치 또는 도 1 내에서 도시된 프로세서에 의 해 실행될 수 있다. 도 4의 동작 402 내지 동작 406은, 도 2의 동작 204 내의 세부 동작들일 수 있다. 일 실시예에서, 동작 402 내 지 동작 406은, 동작 204를 실행하는 동안, 실행될 수 있다. 하지만, 이에 제한되지 않는다. 도 4를 참조하면, 동작 402에서, 프로세서는, 상기 터치 입력이 수신되기 전 상기 텍스트 입력 부분 내에 서 표시되었던(has been displayed) 상기 적어도 하나의 제3 캐릭터의 적어도 일부를 포함하는 복수의 미리 결 정된 단어들(또는 복수의 추천 단어들) 중에서, 상기 적어도 하나의 제3 캐릭터 다음의 캐릭터로 상기 제1 캐릭 터를 포함하는 적어도 하나의 제1 단어를 식별할 수 있다. 예를 들면, 프로세서는, 상기 적어도 하나의 제3 캐릭터에 대한 자연어 처리(natural language processing)를 실행하는 것에 기반하여, 상기 적어도 하나의 제3 캐릭터의 맥락(context)을 식별할 수 있다. 예를 들면, 프로세서는, NPU(neural processing unit) 및/또는 GPU(graphics processing unit)를 이용하여, 상기 맥락을 식별할 수 있다. 프로세서는, 상기 식 별된 맥락에 기반하여, 상기 적어도 하나의 제3 캐릭터의 적어도 일부를 포함하는 상기 복수의 미리 결정된 단 어들을 식별할 수 있다. 프로세서는, 상기 복수의 미리 결정된 단어들 중에서, 상기 적어도 하나의 제3 캐릭터 다음의 캐릭터로 상기 제1 캐릭터를 포함하는 상기 적어도 하나의 제1 단어를 식별할 수 있다. 예를 들어, 도 3을 참조하면, 프로세서는, 적어도 하나의 제3 캐릭터의 맥락에 기반하여, 상기 복수의 미리 결정된 단어들로 \"cute\", \"charming\", \"cool\", 및 \"crazy\"를 식별할 수 있다. 프로세서는, \"cute\", \"charming\", \"cool\", 및 \"crazy\" 중 상기 제1 캐릭터(예: \"h\")를 포함하는 \"charming\"을 상기 적어도 하나의 제1 단어로 식별할 수 있다. 하지만, 이에 제한되지 않는다. 다시 도 4를 참조하면, 동작 404에서, 프로세서는, 상기 복수의 미리 결정된 단어들 중에서, 상기 적어도 하나의 제3 캐릭터 다음의 캐릭터로 상기 제2 캐릭터를 포함하는 적어도 하나의 제2 단어를 식별할 수 있다. 예를 들어, 도 3을 참조하면, 프로세서는, 적어도 하나의 제3 캐릭터의 맥락에 기반하여, 상기 복수 의 미리 결정된 단어들로 \"cute\", \"charming\", \"cool\", 및 \"crazy\"를 식별할 수 있다. 프로세서는, \"cute\", \"charming\", \"cool\", 및 \"crazy\" 중 상기 제2 캐릭터(예: \"u\")를 포함하는 \"cute\"를 상기 적어도 하나 의 제2 단어로 식별할 수 있다. 하지만, 이에 제한되지 않는다. 상기 예시와 달리, 적어도 하나의 제3 캐릭터 다음에 표시될 상기 캐릭터를 식별하기 위해, 제1 키를 감싸는 제2 키, 제3 키, 제4 키, 제5 키, 제6 키, 제7 키, 및 제8 키에 의해 각각 나타내어지는 캐릭터들(예: \"u\", \"y\", \"g\", \"v\", \"b\", \"n\", 및 \"j\")을 동작 204에서 식별하는 경우, 프로세서는, 적어도 하나의 제3 캐릭터의 상기 맥락에 기반하여 식별된 \"cute\", \"charming\", \"cool\", 및 \"crazy\"를 포함하는 상기 복수의 미리 결정된 단어들을, \"cu-\", \"cy-\", \"cg-\", \"cv-\", \"cb-\", \"cn- \" 및 \"cj-\"를 이용하여 검색하는 것에 기반하여, \"cute\"를 상기 적어도 하나의 제2 단어로 식별할 수 있다. 다 시 말해, 제2 키는, 제1 키를 감싸는 제2 키, 제3 키, 제4 키, 제5 키, 제6 키 , 제7 키, 및 제8 키 중에서 적어도 하나의 제3 캐릭터의 상기 맥락에 대응하는 키일 수 있다. 하지만, 이에 제한되지 않는다. 다시 도 4를 참조하면, 동작 406에서, 프로세서는, 상기 적어도 하나의 제3 캐릭터로부터 도출된 상기 맥 락과 상기 적어도 하나의 제1 단어 사이의 제1 관계 및 상기 적어도 하나의 제3 캐릭터로부터 도출된 상기 맥락 과 상기 적어도 하나의 제2 단어 사이의 제2 관계에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐 릭터를 식별할 수 있다. 예를 들면, 상기 제1 관계는 상기 터치 입력이 사용자의 의도에 따라 상기 제1 키 상 에서 상기 접촉점을 가질 확률을 나타낼 수 있고, 상기 제2 관계는 상기 터치 입력이 상기 터치 입력이 상기 의 도와 다르게 상기 제1 키 상에서 상기 접촉점을 가질 확률을 나타낼 수 있기 때문에, 프로세서는, 상기 제 1 관계 및 상기 제2 관계에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중에서 상기 적어도 하나의 제3 캐 릭터 옆에서 표시될 상기 캐릭터를 식별할 수 있다. 상술한 바와 같이, 전자 장치는, 상기 터치 입력의 상기 접촉점이 위치된 상기 제1 키에 의해 나타내어지 는 상기 제1 캐릭터가 상기 적어도 하나의 제3 캐릭터로부터 도출된 상기 맥락에 적합한지 여부 및 상기 제1 키 에 인접한 상기 제2 키에 의해 나타내어지는 상기 제2 캐릭터가 상기 맥락에 적합한지 여부에 기반하여, 상기 터치 입력을 인식할 수 있다. 전자 장치는, 이러한 인식을 통해, 사용자에 의해 의도되지 않은 위치에서 상기 터치 입력이 수신되더라도, 타이포그래피컬 에러의 발생을 감소시킬 수 있다. 다시 말해, 전자 장치(10 1)는, 상기 가상 키보드의 이용과 관련된 사용자 편의성을 강화할 수 있다. 도 5a는 일 실시예에 따라 터치 입력의 접촉점의 위치에 기반하여 제1 캐릭터 및 제2 캐릭터 중 하나의 캐릭터 를 식별하는 방법을 도시하는 흐름도이다. 이러한 방법은, 도 1 내에서 도시된 전자 장치 또는 도 1 내에 서 도시된 프로세서에 의해 실행될 수 있다. 도 5a의 동작 502 및 동작 504는, 도 2의 동작 204 내의 세부 동작들일 수 있다. 예를 들면, 동작 204는, 동작 502 및 동작 504를 포함할 수 있다. 예를 들면, 동작 204는, 동작 402 내지 동작 406, 동작 502, 및 동작 504 를 포함할 수 있다. 하지만, 이에 제한되지 않는다. 도 5b는 일 실시예에 따라 식별되는 인식 영역 및 보호 영역의 예를 도시한다. 도 5a를 참조하면, 동작 502에서, 프로세서는, 상기 접촉점의 위치에 기반하여, 전자 장치 내에 저장 된, 상기 가상 키보드의 사용 이력에 대한 정보를 식별함으로써, 상기 터치 입력이 상기 제1 키에 대한 입력일 제1 확률 및 상기 터치 입력이 상기 제2 키에 대한 입력일 제2 확률을 식별할 수 있다. 일 실시예에서, 프로세서는, 상기 터치 입력에 응답하여, 상기 접촉점의 상기 위치를 식별할 수 있다. 예 를 들면, 상기 위치는, 좌표를 통해 나타내어질 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 프로세 서는, 상기 터치 입력 이전에 수신되었던, 상기 위치의 상기 접촉점을 가지는 다른 터치 입력이 어떻게 처리되었는지를 식별하기 위해, 상기 정보를 식별할 수 있다. 예를 들면, 상기 정보는, 상기 좌표들 각각에 의해 나타내어지는 위치 상에서의 입력이 상기 좌표들 각각을 포함하는 상기 가상 키보드의 키에 대한 입력일 확률에 대한 제1 데이터 및 상기 위치 상에서의 상기 입력이 상기 키를 감싸는 다른 키들에 대한 입력일 확률에 대한 제2 데이터를 포함할 수 있다. 프로세서는, 상기 정보로부터 상기 위치에 대한 상기 제1 데이터 및 상기 제2 데이터를 획득하고, 상기 제1 데이터 및 상기 제2 데이터에 기반하여, 상기 제1 확률 및 상기 제2 확률을 식별할 수 있다. 하지만, 이에 제한되지 않는다. 동작 504에서, 프로세서는, 상기 제1 확률 및 상기 제2 확률에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 있다. 예를 들어, 상기 정보가, 상기 터치 입력 이전에 수신되었던, 상기 위치의 상기 접촉점을 가지는 제1 터치 입력 에 따라 상기 제1 키에 의해 나타내어지는 상기 제1 캐릭터를 표시한 후 상기 제1 캐릭터를 삭제하기 위한 제2 터치 입력이 상기 가상 키보드를 통해 빈번하게 수신됨을 나타내는 데이터 및 상기 제2 터치 입력이 수신된 후 상기 제1 키에 인접한 상기 제2 키에 대한 제3 터치 입력이 빈번하게 수신됨을 나타내는 데이터를 포함하는 경 우, 프로세서는, 상기 접촉점이 상기 제1 키 상에서 위치됨에도 불구하고, 상기 터치 입력을 상기 제1 키 에 대한 터치 입력으로 인식하는 대신 상기 제2 키에 대한 터치 입력으로 인식할 수 있다. 하지만, 이에 제한 되지 않는다. 다른 예를 들어, 상기 정보가, 상기 터치 입력 이전에 수신되었던, 상기 제1 터치 입력에 따라 상기 제1 키에 의해 나타내어지는 상기 제1 캐릭터를 표시한 후 상기 제1 캐릭터와 구별되는 다른(another) 캐릭터를 표시하기 위한 제4 터치 입력이 빈번하게 수신됨을 나타내는 데이터를 포함하는 경우, 프로세서는, 상기 터치 입력 을 상기 제1 키에 대한 터치 입력으로 인식할 수 있다. 하지만, 이에 제한되지 않는다. 일 실시예에서, 상기 제1 확률 및 상기 제2 확률은, 상기 제1 키가 상기 가상 키보드 상에서 어디에 위치하는지 에 따라 변경될 수 있다. 예를 들면, 상기 가상 키보드 내의 상기 복수의 키들은, 미리 결정된 영역(예: 센터 영역) 내의 제3 키들 및 상기 미리 결정된 영역 밖의 제4 키들을 포함할 수 있다. 예를 들면, 상기 미리 결정 된 영역 내의 상기 제3 키들 각각에 대한 터치 입력이 사용자의 의도에 따른 입력일 확률은, 상기 미리 결정된 영역을 감싸는 주변 영역 내의 상기 제4 키들 각각에 대한 터치 입력이 사용자의 의도에 따른 입력일 확률보다 낮을 수 있기 때문에, 상기 미리 결정된 영역이 전자 장치 내에서 정의될 수 있다. 예를 들어, 도 3을 참 조하면, 상기 미리 결정된 영역은, 센터 영역으로 정의될 수 있다. 하지만, 이에 제한되지 않는다. 일 실시예에서, 상기 미리 결정된 영역은, 상기 가상 키보드의 사용 이력에 따라 변경될 수 있다. 하지만, 이에 제한되지 않는다. 다시 도 5a를 참조하면, 일 실시예에서, 상기 제1 확률 및 상기 제2 확률은, 상기 제1 키가 상기 제3 키들 중 하나의 키인지 또는 상기 제4 키들 중 하나의 키인지 여부에 따라, 변경될 수 있다. 예를 들면, 상기 제1 키가 상기 제3 키들 중 하나의 키인 조건 상에서의 상기 제1 확률은 상기 제1 키가 상기 제4 키들 중 하나의 키인 조 건 상에서의 상기 제1 확률보다 낮을 수 있다. 다른 예를 들면, 상기 제1 키가 상기 제3 키들 중 하나의 키인 조건 상에서의 상기 제2 확률은 상기 제1 키가 상기 제4 키들 중 하나의 키인 조건 상에서의 제 상기 제2 확률 보다 높을 수 있다. 하지만, 이에 제한되지 않는다. 일 실시예에서, 도 2의 동작 204가 도 4의 동작 402 내지 동작 406 및 도 5a의 동작 502 및 동작 504를 포함하 는 경우, 프로세서는, 동작 402 내지 동작 406의 식별들에 따른 제1 결과 데이터에 제1 가중치(weight)를 적용하고, 동작 502 및 동작 504의 식별들에 따른 제2 결과 데이터에 제2 가중치를 적용할 수 있다. 예를 들면, 상기 제1 가중치 및 상기 제2 가중치는 상기 가상 키보드의 사용 이력에 따라 변경될 수 있다. 예를 들 면, 상기 제1 가중치는 상기 제2 가중치보다 높을 수 있다. 다른 예를 들면, 상기 제1 가중치는 상기 제2 가중 치와 동일할 수 있다. 또 다른 예를 들면, 상기 제1 가중치는 상기 제2 가중치보다 낮을 수 있다. 하지만, 이 에 제한되지 않는다. 프로세서는, 상기 제1 가중치가 적용된 상기 제1 결과 데이터 및 상기 제2 가중치가 적용된 상기 제2 결과 데이터에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있 다. 일 실시예에서, 프로세서는, 상기 제1 가중치가 적용된 상기 제1 결과 데이터 및 상기 제2 가중치가 적용 된 상기 제2 결과 데이터에 기반하여, 상기 가상 키보드의 인식 영역을 식별하고, 상기 식별된 인식 영역에 기 반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 예를 들어, 도 5b를 참조하면, 프로세서는, 상기 제1 가중치가 적용된 상기 제1 결과 데이터 및 상기 제2 가중치가 적용된 상 기 제2 결과 데이터에 기반하여, 배열을 가지는 상기 가상 키보드의 인식 영역을 식별할 수 있다.예를 들면, 인식 영역은, 프로세서가 상기 제1 가중치가 적용된 상기 제1 결과 데이터 및 상기 제2 가중치가 적용된 상기 제2 결과 데이터에 따라 터치 입력을 인식하는 방법을 표현한 것으로, 인식 영역은, 상기 디스플레이를 통해 표시되는 시각적 정보가 아닐 수 있다. 예를 들면, 인식 영역은, 상기 제1 가중 치가 적용된 상기 제1 결과 데이터 및 상기 제2 가중치가 적용된 상기 제2 결과 데이터에 따라, 다양한 형상들 로 식별될 수 있다. 일 실시예에서, 상기 가상 키보드 내의 상기 복수의 키들 중 하나의 키에 대한 터치 입력 의 접촉점의 위치는, 사용자의 의도를 나타내기 때문에, 인식 영역은, 보호 영역(guard area)에 기반하여, 정의될 수 있다. 예를 들면, 상기 복수의 키들 중 하나의(a) 키가 점유하는 영역의 중심 부분 상에서 접촉점을 가지는 터치 입력은, 상기 제1 가중치가 적용된 상기 제1 결과 데이터 및 상기 제2 가중치가 적용된 상기 제2 결과 데이터와 관계없이, 상기 키에 의해 나타내어지는 캐릭터를 입력하는 것이 사용자 의도임을 나타내는 터치 입력일 수 있기 때문에, 프로세서는, 상기 제1 가중치가 적용된 상기 제1 결과 데이터 및 상기 제2 가중치 가 적용된 상기 제2 결과 데이터 뿐 아니라, 상기 보호 영역에 기반하여 인식 영역을 식별할 수 있다. 예 를 들면, 상기 보호 영역은, 보호 영역과 같이, 상기 복수의 키들 각각의 중심 부분을 포함하는 원형(및/ 또는 타원형)으로 정의될 수 있다. 도 5b는 원형 및/또는 타원형을 가지는 보호 영역을 도시하고 있으나, 보호 영역의 형상은, 도 5b의 도시와 달리, 사각형으로 정의되거나, 다른 형상으로 정의될 수 있다. 다시 도 5a를 참조하면, 도 5a는 상기 접촉점의 상기 위치에 기반하여 식별된 확률(예: 상기 제1 확률 및 상기 제2 확률)에 따라 상기 캐릭터를 식별하는 동작들을 도시하고 있으나, 실시예들에 따라 상기 동작들은 다른 동 작들로 대체될 수 있다. 예를 들면, 대안적으로(alternatively), 프로세서는, 상기 접촉점의 상기 위치와 상기 제1 키의 중심점 사이의 제1 거리 및 상기 접촉점의 상기 위치와 상기 제2 키의 중심점 사이의 제2 거리에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별할 수 있다. 상술한 바와 같이, 전자 장치는, 상기 터치 입력에 응답하여 상기 텍스트 입력 부분 내에서 캐릭터를 표시 하기 전, 상기 터치 입력의 상기 접촉점의 위치에 기반하여, 상기 터치 입력을 분석할 수 있다. 전자 장치 는, 상기 분석에 기반하여 상기 터치 입력을 인식함으로써, 사용자의 의도에 부합하는 상기 터치 입력에 대한 응답을 제공할 수 있다. 예를 들면, 전자 장치는, 상기 가상 키보드의 이용과 관련된 사용자 편의성 을 강화할 수 있다. 도 6은 일 실시예에 따라 가상 키보드 내의 제1 키 및 제2 키를 확대하는 방법을 도시하는 흐름도이다. 이러한 방법은, 도 1 내에서 도시된 전자 장치 또는 도 1 내에서 도시된 프로세서에 의해 실행될 수 있다. 도 7은 일 실시예에 따라 표시된 확대된 사이즈를 가지는 제1 키 및 확대된 사이즈를 가지는 제2 키의 예를 도 시한다. 도 6의 동작 602은 도 2의 동작 204가 실행된 후 실행되거나, 동작 204 내에 포함될 수 있고, 도 6의 동작 604 는 도 2의 동작 206에 대응할 수 있다. 하지만, 이에 제한되지 않는다. 도 6을 참조하면, 동작 602에서, 프로세서는, 상기 제1 캐릭터, 상기 제2 캐릭터, 및 상기 적어도 하나의 제3 캐릭터에 기반하여 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 있는지 여부를 식별 할 수 있다. 예를 들면, 프로세서는, 상기 터치 입력이 상기 제1 캐릭터를 상기 텍스트 입력 부분 내에서 표시하기 위한 입력임을 나타내는 제1 데이터가 상기 터치 입력이 상기 제2 캐릭터를 상기 텍스트 입력 부분 내 에서 표시하기 위한 입력임을 나타내는 제2 데이터와 동일하거나, 상기 제1 데이터가 상기 제2 데이터에 대응하 는 조건 상에서, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 없음을 식별할 수 있다. 예를 들면, 동작 406의 설명을 통해 예시된 상기 제1 관계를 나타내는 상기 제1 데이터가 상기 제2 관계를 나타 내는 상기 제2 데이터와 동일한 조건 상에서, 프로세서는, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 없음을 식별할 수 있다. 다른 예를 들면, 동작 504의 설명을 통해 예시된 상기 제1 확률을 나타내는 상기 제1 데이터가 상기 제2 확률을 나타내는 상기 제2 데이터와 동일한 조건 상에서, 프로세서 는, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 없음을 식별할 수 있다. 또 다른 예를 들면, 도 5a의 설명 내에서 예시된 상기 제1 가중치가 적용된 상기 제1 결과 데이터 및 상기 제2 가중치가 적용 된 상기 제2 결과 데이터에 기반하여 식별된 상기 제1 데이터가 상기 제1 가중치가 적용된 상기 제1 결과 데이 터 및 상기 제2 가중치가 적용된 상기 제2 결과 데이터에 기반하여 식별된 상기 제2 데이터와 동일한 조건 상에 서, 프로세서는, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 없음을 식별할 수 있 다. 하지만, 이에 제한되지 않는다. 예를 들면, 프로세서는, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 없음을 식별 하는 조건 상에서, 동작 606를 실행하고, 그렇지 않으면 동작 604를 실행할 수 있다. 동작 604에서, 프로세서는, 상기 제1 캐릭터 및 상기 제2 캐릭터 중에서 식별된 상기 캐릭터를 상기 텍스 트 입력 부분 내에서 상기 디스플레이를 통해 표시할 수 있다. 예를 들면, 상기 캐릭터는, 상기 적어도 하나의 제3 캐릭터 옆에서 표시될 수 있다. 예를 들면, 동작 604는 도 2의 동작 206에 대응할 수 있다. 동작 606에서, 프로세서는, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 텍스트 입력 부분 내에서 표시될 하나의 캐릭터를 식별할 수 없음을 식별하는 것에 기반하여, 확대된 사이즈(enlarged size)를 가지는 상기 제1 키 및 확대된 사이즈를 가지는 상기 제2 키를 상기 디스플레이를 통해 표시할 수 있다. 일 실시예에서, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키의 상기 표시에 따라, 상기 가상 키보드 내의 상기 복수의 키들 중 상기 제1 키 및 상기 제2 키를 제외한 남은 키들의 사이즈는, 변경될 수 있다. 일 실시예에서, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키 의 상기 표시에 따라, 상기 남은 키들의 배열은 변경될 수 있다. 일 실시예에서, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키의 상기 표시에 따라, 상기 남은 키들의 표시는, 중단 될 수 있다. 예를 들면, 상기 남은 키들의 표시는, 동작 608이 실행된 후 재개될 수 있다. 하지만, 이에 제한 되지 않는다. 일 실시예에서, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키는, 상기 가상 키보드 상에 부분적으로 중첩될 수 있다. 예를 들면, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키는, 상기 가상 키보드 내의 상기 제1 키 및 상기 제2 키를 포함하는 영역 상에서 적어도 부분적으로 중첩될 수 있다. 예를 들어, 도 7을 참조하면, 프로세서는, 상 기 제1 캐릭터(예: \"h\") 및 상기 제2 캐릭터(예: \"u\") 중 상기 텍스트 입력 부분 내에서 표시될 하나의 캐릭터 를 식별할 수 업는 조건 상에서, 배열을 가지는 상기 가상 키보드 상에 중첩으로(as superimposed on), 상 기 확대된 사이즈를 가지는 제1 키 및 상기 확대된 사이즈를 가지는 제2 키를 상기 디스플레이를 통 해 표시할 수 있다. 일 실시예에서, 상기 확대된 사이즈를 가지는 제1 키 및 상기 확대된 사이즈를 가지 는 제2 키는, 상기 가상 키보드 내의 상기 복수의 키들에 대하여 시각적으로(visually) 강조될 수 있다. 예를 들면, 상기 확대된 사이즈를 가지는 제1 키 및 상기 확대된 사이즈를 가지는 제2 키 각각의 색 상은, 상기 복수의 키들 각각의 색상과 다를 수 있다. 예를 들면, 상기 가상 키보드는, 상기 확대된 사이즈를 가지는 제1 키 및 상기 확대된 사이즈를 가지는 제2 키가 표시되는 동안, 블러 효과(blur effect)로 표시될 수 있다. 하지만, 이에 제한되지 않는다. 다시 도 6을 참조하면, 동작 608에서, 프로세서는, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확 대된 사이즈를 가지는 상기 제2 키 중 하나의 키에 대한 다른(another) 터치 입력을 수신할 수 있다. 일 실시 예에서, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키가 표시되는 동 안, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키에 의해 점유되는 영역을 제외한 남은 영역을 통해 야기되는 터치 입력의 인식은 제한될 수 있다. 하지만, 이에 제한되지 않는다. 일 실시예에서, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키가 표시되는 동안, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키에 의해 점유되는 영역 상의 터치 입력을 식별하기 위해 이용되는 전자 장치의 터치 센서의 동작 주파수는, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키가 표시되지 않는 상태 내에서의 상기 터치 센서의 동작 주파수보다 높을 수 있다. 하지만, 이에 제한되지 않는다. 동작 610에서, 프로세서는, 상기 다른 터치 입력이 수신된 키에 의해 나타내어지는 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 예를 들면, 프로세서는, 동작 204의 실행 없이, 상기 다른 터치 입력 의 접촉점의 위치에 기반하여 식별된 상기 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 도 6은 상기 제1 캐릭터 및 상기 제2 캐릭터 중에서 상기 텍스트 입력 부분 내에서 표시될 하나의 캐릭터를 식 별할 수 없는 조건 상에서 상기 확대된 사이즈를 가지는 상기 제1 캐릭터 및 상기 확대된 사이즈를 가지는 상기 제2 캐릭터를 표시하는 동작들을 도시하고 있으나, 실시예들에 따라 상기 동작들은 다른 동작들로 대체될 수 있 다. 예를 들면, 대안적으로, 프로세서는, 상기 제1 캐릭터 및 상기 제2 캐릭터 중에서 상기 텍스트 입력 부분 내에서 표시될 하나의 캐릭터를 식별할 수 없는 조건 상에서, 동작 606 및 동작 610의 실행 없이, 상기 제 1 캐릭터 또는 상기 제2 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 예를 들면, 프로세서는, 상기 터치 입력의 상기 접촉점이 상기 제1 키 상에서 위치된다는 식별에 기반하여, 상기 제1 키에 의해 나타내어지는 상기 제1 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 다른 예를 들면, 프로세서는, 상기 적어도 하나의 제3 캐릭터로부터 도출된 상기 맥락이 상기 제1 캐릭터보다 상기 제2 캐릭터에 더 대응한다는 식별에 기반하여, 상기 제2 키에 의해 나타내어지는 상기 제2 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 하지만, 이에 제한되지 않는다. 상술한 바와 같이, 전자 장치는, 상기 터치 입력의 인식 결과, 사용자의 의도를 추정할 수 없는 조건 상에 서, 상기 텍스트 입력 부분 내에서 하나의 캐릭터를 표시하는 것 대신, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키를 표시할 수 있다. 전자 장치는, 이러한 표시를 통해, 상기 가상 키보드가 이용되는 동안, 강화된 사용자 경험을 제공할 수 있다. 도 8은 일 실시예에 따라 가상 키보드에 대한 사용 이력에 대한 정보를 조정하는(adjust) 방법을 도시하는 흐름 도이다. 이러한 방법은, 도 1 내에서 도시된 전자 장치 또는 도 1 내에서 도시된 프로세서에 의해 실행될 수 있다. 도 9는 일 실시예에 따라 텍스트 입력 부분 내에서 표시된 캐릭터를 삭제하기 위한 입력의 예를 도시한다. 도 8을 참조하면, 동작 802에서, 프로세서는, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 식별된 상기 캐릭터 를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시할 수 있다. 예를 들면, 동작 802는, 도 2의 동 작 206, 도 6의 동작 604, 및 도 6의 동작 610에 대응할 수 있다. 동작 804에서, 프로세서는, 상기 캐릭터의 상기 표시에 응답하여, 다른 캐릭터가 상기 텍스트 입력 부분 내에서 표시되기 전 상기 텍스트 입력 부분 내에서 표시된 상기 캐릭터를 삭제하기 위한 입력이 수신되는지 여 부를 식별할 수 있다. 예를 들어, 도 9를 참조하면, 프로세서는, 상기 제1 캐릭터(예: \"h\") 및 상기 제2 캐릭터(예: \"u\") 중 식별된 상기 캐릭터(예: \"u\")가 텍스트 입력 부분 내에서 표시된 상태 내에서 다른 캐 릭터가 텍스트 입력 부분 내에서 표시되기 전, 배열을 가지는 상기 가상 키보드 내의 상기 복수의 키 들 중 포인터 옆의 캐릭터를 삭제하기 위한 키에 대한 입력이 수신되는지 여부를 식별할 수 있다. 다시 도 8을 참조하면, 프로세서는, 상기 다른 캐릭터가 상기 텍스트 입력 부분 내에서 표시되기 전 상기 입력이 수신되는 조건 상에서, 동작 806을 실행하고, 상기 다른 캐릭터가 상기 텍스트 입력 부분 내에서 표시되 기 전 상기 입력이 수신되지 않는 조건 상에서, 동작 808을 실행할 수 있다. 동작 806에서, 프로세서는, 상기 입력이 수신됨을 식별하는 것에 응답하여, 상기 접촉점의 위치가 상기 식 별된 캐릭터에 대응하지 않음을 나타내는 데이터에 기반하여, 상기 가상 키보드의 사용 이력에 대한 정보를 조 정하거나(adjust) 변경하거나(change) 개선할(refine) 수 있다. 예를 들면, 상기 입력이 수신됨은, 상기 캐릭 터의 식별이 사용자의 의도와 다름을 의미할 수 있기 때문에, 프로세서는, 상기 터치 입력의 상기 접촉점 이 상기 캐릭터를 상기 텍스트 입력 부분에 입력하기 위해 야기된 것이 아님을 나타내는 상기 데이터를 획득하 고, 상기 데이터에 기반하여, 상기 정보를 조정할 수 있다. 예를 들면, 동작 806을 실행한 후 수신되는, 상기 접촉점을 가지는, 터치 입력이 상기 캐릭터를 나타내는 상기 가상 키보드의 키에 대한 터치 입력으로 인식될 확 률은 상기 조정의 결과에 따라 낮아질 수 있다. 하지만, 이에 제한되지 않는다. 동작 808에서, 프로세서는, 상기 입력이 수신되지 않음을 식별하는 것에 기반하여, 상기 접촉점의 위치가 상기 식별된 캐릭터에 대응함을 나타내는 데이터에 기반하여, 상기 가상 키보드의 상기 사용 이력에 대한 상기 정보를 조정하거나 변경하거나 개선할 수 있다. 예를 들면, 상기 입력이 수신되지 않음은, 상기 캐릭터의 식별 이 사용자의 의도에 대응함을 의미할 수 있기 때문에, 프로세서는, 상기 터치 입력의 상기 접촉점이 상기 캐릭터를 상기 텍스트 입력 부분에 입력하기 위해 야기된 것임을 나타내는 상기 데이터를 획득하고, 상기 데이 터에 기반하여, 상기 정보를 조정할 수 있다. 예를 들면, 동작 808을 실행한 후 수신되는, 상기 접촉점을 가지 는, 터치 입력이 상기 캐릭터를 나타내는 상기 가상 키보드의 키에 대한 터치 입력으로 인식될 확률은 상기 조 정의 결과에 따라 높아질 수 있다. 하지만, 이에 제한되지 않는다. 상술한 바와 같이, 전자 장치는, 상기 가상 키보드의 상기 사용 이력에 대한 상기 정보를 조정할 수 있다. 전자 장치는, 이러한 조정을 통해, 타이포그래피컬 에러의 발생을 감소시킬 수 있다. 다시 말해, 전자 장 치는, 상기 가상 키보드의 이용과 관련된 사용자 편의성을 강화할 수 있다. 도 10은 일 실시예에 따라 제2 키에 의해 나타내어지는 제2 캐릭터를 식별하는 것을 삼가하거나 우회하는 방법 을 도시하는 흐름도이다. 이러한 방법은, 도 1 내에서 도시된 전자 장치 또는 도 1 내에서 도시된 프로세서에 의해 실행될 수 있다. 도 10을 참조하면, 동작 1002에서, 프로세서는, 상기 텍스트 입력 부분 내에서 표시된 상기 적어도 하나의 제3 캐릭터로부터 도출된 맥락(context)을 식별할 수 있다. 예를 들면, 동작 1002는 상기 적어도 하나의 제3 캐릭터 옆에 표시될 캐릭터를 입력하기 위한 터치 입력(예: 동작 1004의 터치 입력)이 수신되기 전, 실행될 수 있다. 동작 1004에서, 프로세서는, 상기 적어도 하나의 제3 캐릭터 옆에 표시될 캐릭터를 상기 텍스트 입력 부분 내에서 입력하기 위한 상기 터치 입력을 수신할 수 있다. 예를 들면, 상기 터치 입력은, 상기 가상 키보드의 상기 복수의 키들 중 상기 제1 키 상에서 접촉점을 가지는 터치 입력일 수 있다. 예를 들면, 동작 1004는, 도 2의 동작 202과 동일하거나 유사할 수 있다. 동작 1006에서, 프로세서는, 상기 터치 입력에 응답하여, 상기 접촉점이 위치된 상기 제1 키에 의해 나타 내어지는 상기 제1 캐릭터가 상기 맥락에 대응하는지 여부를 식별할 수 있다. 예를 들면, 상기 제1 캐릭터가 상기 맥락에 대응함은, 상기 터치 입력을 상기 제1 키에 대한 터치 입력으로 인식하는 것이 사용자의 의도에 대 응할 확률이 상대적으로 높음을 의미할 수 있기 때문에, 프로세서는, 상기 제1 캐릭터와 상기 맥락 사이의 관계를 식별할 수 있다. 예를 들면, 프로세서는, 상기 제1 캐릭터가 상기 맥락에 대응하는 조건 상에서 동작 1008을 실행하고, 그렇지 않으면 동작 1010을 실행할 수 있다. 동작 1008에서, 프로세서는, 상기 제1 캐릭터가 상기 맥락에 대응함을 식별하는 것에 기반하여, 상기 제1 키에 의해 나타내어지는 상기 제1 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 예를 들면, 프로세 서는, 상기 제1 키에 인접한 상기 제2 키를 식별하는 것 및/또는 상기 제2 키에 의해 나타내어지는 상기 제2 캐릭터를 식별하는 것을 삼가하거나(refrain) 우회하고(bypass), 상기 제1 캐릭터를 상기 적어도 하나의 제 3 캐릭터 옆에 표시될 캐릭터로 식별하는 것에 기반하여, 상기 제1 캐릭터를 상기 텍스트 입력 부분 내에서 표 시할 수 있다. 다시 말해, 프로세서는, 상기 제2 키 및/또는 상기 제2 캐릭터의 식별 없이, 상기 제1 캐 릭터가 상기 맥락에 대응함을 식별하는 것에 응답하여, 상기 제1 캐릭터를 상기 텍스트 입력 부분 내에서 표시 할 수 있다. 동작 1010에서, 프로세서는, 상기 제1 캐릭터가 상기 맥락과 다름을 식별하는 것에 기반하여, 상기 제1 키 에 인접한 상기 제2 키에 의해 나타내어지는 상기 제2 캐릭터를 식별할 수 있다. 예를 들면, 상기 제1 캐릭터 가 상기 맥락과 다름은, 상기 터치 입력을 상기 제1 키에 대한 터치 입력으로 인식하는 것이 사용자의 의도와 다를 확률이 상대적으로 높음을 의미할 수 있기 때문에, 프로세서는, 상기 제1 캐릭터와 구별되는 다른 캐 릭터를 검색하기 위해, 상기 제1 키에 인접한 상기 제2 키를 식별하고, 상기 제2 키에 의해 나타내어지는 상기 제2 캐릭터를 식별할 수 있다. 동작 1012에서, 프로세서는, 상기 제2 캐릭터의 상기 식별에 응답하여, 상기 제1 캐릭터 및 상기 제2 캐릭 터 중에서 하나의 캐릭터를 식별할 수 있다. 예를 들면, 프로세서는, 상기 제1 캐릭터와 상기 맥락 사이 의 관계 및 상기 제2 캐릭터와 상기 맥락 사이의 관계에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하 나의 캐릭터를 식별할 수 있다. 동작 1014에서, 프로세서는, 상기 식별된 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 예를 들면, 상기 식별된 캐릭터는, 상기 적어도 하나의 제3 캐릭터 옆에서 표시될 수 있다. 상술한 바와 같이, 전자 장치는, 상기 터치 입력의 상기 접촉점이 위치된 상기 제1 키에 의해 나타내어지 는 상기 제1 캐릭터와 상기 맥락 사이의 비교를, 상기 제2 키(및/또는 상기 제2 캐릭터)의 식별 전 실행함으로 써, 상대적으로 빠른 응답 속도로, 사용자 의도에 부합하는 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 도 11은 일 실시예에 따라, 복수의 미리 결정된 단어들을 조정하는 것에 기반하여 캐릭터를 식별하는 방법을 도 시하는 흐름도이다. 이러한 방법은, 도 1 내에서 도시된 전자 장치 또는 도 1 내에서 도시된 프로세서 에 의해 실행될 수 있다. 도 11을 참조하면, 동작 1102에서, 프로세서는, 상기 텍스트 입력 부분 내에서 표시된 상기 적어도 하나의 제3 캐릭터의 적어도 일부를 포함하는 복수의 미리 결정된 단어들을 식별할 수 있다. 예를 들면, 프로세서 는, 상기 적어도 하나의 제3 캐릭터 다음에 입력될 캐릭터를 추정하기 위해, 상기 복수의 미리 결정된 단어들을 식별할 수 있다. 동작 1104에서, 프로세서는, 상기 복수의 미리 결정된 단어들을 식별한 후 또는 상기 복수의 미리 결정된 단어들을 식별하는 동안, 상기 가상 키보드의 복수의 키들 중 제1 키 상에서 접촉점을 가지는 터치 입력을 수신 할 수 있다. 예를 들면, 동작 1104는, 도 2의 동작 202와 동일하거나 유사할 수 있다. 동작 1106에서, 프로세서는, 상기 터치 입력에 응답하여, 상기 터치 입력의 상기 접촉점의 위치에 기반하 여, 상기 복수의 미리 결정된 단어들을 조정할 수 있다. 예를 들면, 프로세서는, 동작 1102에서 식별된 상기 복수의 미리 결정된 단어들 중 일부를 상기 위치에 기반하여 삭제하는 것 및/또는 동작 1102에서 식별된 상기 복수의 미리 결정된 단어들에 새로운 단어를 상기 위치에 기반하여 부가하는 것으로, 상기 복수의 미리 결 정된 단어들을 조정할 수 있다. 동작 1108에서, 프로세서는, 동작 1106을 통해 조정된 상기 복수의 미리 결정된 단어들에 기반하여 상기 가상 키보드의 상기 복수의 키들 각각의 인식 영역을 식별할 수 있다. 예를 들면, 상기 인식 영역은, 상기 디 스플레이를 통해 표시된 상기 가상 키보드의 상기 복수의 키들 각각의 사이즈와 다를 수 있다. 예를 들면, 상 기 복수의 키들 중 상기 복수의 미리 결정된 단어들 내에 포함된 캐릭터를 나타내는 키의 표시 사이즈는 상기 복수의 키들 중 상기 복수의 미리 결정된 단어들 내에 포함되지 않은 캐릭터를 나타내는 다른(another) 키의 표 시 사이즈와 동일한 반면, 상기 키의 상기 인식 영역의 사이즈는, 상기 다른 키의 상기 인식 영역의 사이즈보다 클 수 있다. 하지만, 이에 제한되지 않는다. 동작 1110에서, 프로세서는, 상기 식별된 인식 영역에 기반하여, 상기 터치 입력에 대응하는 키를 식별할 수 있다. 예를 들면, 프로세서는, 상기 터치 입력의 상기 접촉점을 포함하는 인식 영역을 가지는 키를 상 기 터치 입력에 대응하는 키로 식별할 수 있다. 하지만, 이에 제한되지 않는다. 동작 1112에서, 프로세서는, 상기 식별된 키에 의해 나타내어지는 캐릭터를 상기 텍스트 입력 부분 내에서 표시할 수 있다. 상술한 바와 같이, 전자 장치는, 상기 터치 입력을 수신한 후 상기 복수의 미리 결정된 단어들을 조정함으 로써, 사용자의 의도가 반영될 수 있는 상기 터치 입력을 상기 터치 입력 전 표시된 적어도 하나의 캐릭터(예: 상기 적어도 하나의 제3 캐릭터)로부터 도출된 맥락에 적용할 수 있다. 전자 장치는, 이러한 동작을 통해, 상기 터치 입력에 기반된, 가상 키보드와 관련된, 서비스를 제공할 수 있다. 도 12는 일 실시예에 따라, 터치 입력에 응답하여 사용자에 의해 의도된 캐릭터를 식별하기 위해 이용되는 예시 적인 소프트웨어 모듈들을 도시한다. 도 12 내에서 도시된 소프트웨어 모듈들 각각의 하나 이상의 동작들은, 도 1 내에서 도시된 프로세서에 의해, 프레임워크 및/또는 소프트웨어 어플리케이션 내에서 실행될 수 있 다. 도 12를 참조하면, 동작 1201에서, 입력 관리자(input dispatcher)는, 동작 202, 동작 1004, 또는 동작 1104에서의 상기 터치 입력의 수신을 포함하는 터치 이벤트에 대한 정보를 터치 핸들링 매니저(touch handling manager)에게 제공할 수 있다. 예를 들면, 입력 관리자는, 프레임워크 내에서 소프트웨어 어플리 케이션(예: 상기 가상 키보드)에게 상기 터치 이벤트에 대한 정보를 전달하는 소프트웨어 모듈일 수 있다. 예 를 들면, 터치 핸들링 매니저는, 입력 관리자로부터 상기 터치 이벤트에 대한 정보를 획득할 수 있 다. 동작 1202에서, 터치 핸들링 매니저는, 상기 터치 이벤트에 대한 상기 정보에 기반하여 획득된 상기 터치 입력의 위치에 대한 정보를 키 탐색자(예: \"FindMostLikelyKey\"로 참조될 수 있음)에게 제공할 수 있다. 예를 들면, 터치 핸들링 매니저는, 상기 터치 이벤트에 대한 상기 정보에 기반하여 미리 결정된 동작들을 실행하는 소프트웨어 모듈일 수 있다. 예를 들면, 키 탐색자는, 터치 핸들링 매니저로부터 상기 터치 입력의 상기 위치에 대한 상기 정보를 획득할 수 있다. 동작 1203에서, 키 탐색자는, 상기 터치 입력의 상기 위치에 대한 상기 정보에 기반하여, 상기 복수의 미 리 결정된 단어들을 식별하기 위해, 상기 터치 이벤트에 대한 정보를 예측 체크자(예: \"Check Prediction\"으로 참조될 수 있음)에게 제공할 수 있다. 예를 들면, 키 탐색자는, 터치 입력의 좌표를 상 기 가상 키보드 내의 상기 복수의 키들 중 어떤 키에 연결시킬 것인지를 식별하는 소프트웨어 모듈일 수 있다. 예측 체크자는, 키 탐색자로부터 상기 터치 이벤트에 대한 상기 정보를 획득할 수 잇다. 동작 1204에서, 예측 체크자는, 예측 생성자(예: \"Make Prediction\"으로 참조될 수 있음)에게. 상 기 터치 이벤트에 대한 정보를 제공할 수 있다. 예를 들면, 예측 체크자는, 상기 터치 입력 이전에 입력 된 단어를 이용하여, 상기 터치 입력의 위치가 상기 가상 키보드 내의 복수의 키들 중 어떤 키에 연결하기 위해 이용되었는지를 확인하기 위한 소프트웨어 모듈일 수 있다. 예를 들면, 예측 생성자는, 예측 체크자 로부터 상기 터치 이벤트에 대한 상기 정보를 획득할 수 있다. 동작 1205에서, 예측 생성자는, 상기 터치 이벤트에 대한 상기 정보에 기반하여, 맥락을 도출하고, 상기 도출된 맥락에 기반하여 식별된 상기 복수의 미리 결정된 단어들에 대한 정보를, 예측 체크자에게 제공할 수 있다. 예를 들면, 예측 생성자는, 상기 터치 입력의 위치 및 상기 터치 입력 이전에 입력된 적어도 하나의 캐릭터로부터 도출된 맥락에 기반하여, 상기 복수의 미리 결정된 단어들을 추천하는 소프트웨어 모듈일 수 있다. 예를 들면, 예측 체크자는, 상기 복수의 미리 결정된 단어들에 대한 상기 정보를 예측 생성자 로부터 획득할 수 있다. 동작 1206에서, 예측 체크자는, 상기 복수의 미리 결정된 단어들에 대한 상기 정보에 기반하여 상기 터치 입력에 대응하는 상기 가상 키보드 내의 키에 대한 정보를 키 탐색자에게 제공할 수 있다. 예를 들면, 키 탐색자는, 예측 체크자로부터 상기 키에 대한 상기 정보를 획득할 수 있다. 동작 1207에서, 키 탐색자는, 상기 키에 대한 정보를 터치 핸들링 매니저에게 제공할 수 있다. 예 를 들면, 터치 핸들링 매니저를 통해 상기 키에 의해 나타내어지는 캐릭터를 표시하기 위해, 키 탐색자 는, 상기 키에 대한 상기 정보를 터치 핸들링 매니저에게 제공할 수 있다. 예를 들면, 터치 핸들 링 매니저는, 키 탐색자로부터 상기 키에 대한 상기 정보를 획득할 수 있다. 동작 1208에서, 터치 핸들링 매니저는, 상기 키에 대한 상기 정보에 기반하여, 상기 키에 대응하는 상기 캐릭터를 식별하고, 상기 캐릭터를 표시하기 위한 정보를 텍스트 표시자(예: \"TextView\"로 참조될 수 있 음)에게 제공할 수 있다. 예를 들면, 텍스트 표시자는, 터치 핸들링 매니저로부터 상기 캐릭터를 표시하기 위한 상기 정보를 획득하는 것에 기반하여, 상기 캐릭터를 텍스트 입력 부분 내에서 표시할 수 있다. 상술한 바와 같은, 일 실시예에 따른, 전자 장치(electronic device)는, 디스플레이, 인스트럭션(instructio n)들을 저장하도록 구성된 메모리, 및 프로세서를 포함할 수 있다. 상기 프로세서는, 상기 인스트럭션들이 실 행될 시, 상기 디스플레이를 통해 표시된 가상 키보드 내의 복수의 키들 중 제1 키 상에서 접촉점(a point of contact)을 가지는 터치 입력을 수신하도록 구성될 수 있다. 상기 프로세서는, 상기 터치 입력에 응답하여, 상 기 제1 키에 의해 나타내어지는 제1 캐릭터, 상기 복수의 키들 중 상기 제1 키에 인접한 제2 키에 의해 나타내 어지는 제2 캐릭터, 및 상기 가상 키보드와 함께 표시된 텍스트 입력 부분 내에서 상기 터치 입력이 수신되기 전 표시되었던 적어도 하나의 제3 캐릭터에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의(a) 캐릭 터를 식별하도록 구성될 수 있다. 상기 프로세서는, 상기 식별된 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시하도록, 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 적어도 하나의 제3 캐릭터의 적어도 일 부를 포함하는 복수의 미리 결정된 단어들 중에서, 상기 적어도 하나의 제3 캐릭터 다음의 캐릭터로 상기 제1 캐릭터를 포함하는 적어도 하나의 제1 단어를 식별하도록 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 복수의 미리 결정된 단어들 중에서, 상기 적어도 하나의 제3 캐릭터 다음 의 캐릭터로 상기 제2 캐릭터를 포함하는 적어도 하나의 제2 단어를 식별하도록 구성될 수 있다. 일 실시예에 서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 적어도 하나의 제3 캐릭터로부터 도출된 맥락 (context)과 상기 적어도 하나의 제1 단어 사이의 제1 관계 및 상기 맥락과 상기 적어도 하나의 제2 단어 사이 의 제2 관계에 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 접촉점의 위치에 더 기반하여, 상기 제 1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 위치에 기반하여, 상기 전자 장치 내에 저장된, 상기 가상 키보드의 사용 이력에 대한 정보를 식별함으로써, 상기 터치 입력이 상기 제1 키에 대한 입 력일 제1 확률 및 상기 터치 입력이 상기 제2 키에 대한 입력일 제2 확률을 식별하도록 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 제1 확률 및 상기 제2 확률에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성될 수 있다. 일 실시예에서, 상기 복수의 키들은, 미리 결정된 영역 내의 제3 키들 및 상기 미리 결정된 영역 밖의 제4 키들 을 포함할 수 있다. 일 실시예에서, 상기 제1 확률 및 상기 제2 확률은, 상기 제1 키가 상기 제3 키들 중 하나 의 키인지 또는 상기 제4 키들 중 하나의 키인지 여부에 따라, 변경될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 터치 입력에 응답하여, 상기 제1 키를 감싸는 키들 중 상기 맥락에 대응하는 키를 상기 제2 키로 식별하도록, 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 제1 캐릭터, 상기 제2 캐릭터, 및 상기 적어도 하나의 제3 캐릭터에 기반하여 상기 제1 캐릭터 및 상기 제2 캐릭터 중 하나의 캐릭터를 식별할 수 없는 조건 상에서, 확대된 사이즈를 가지는 상기 제1 키 및 확대된 사이즈를 가지는 상기 제2 키를 상기 디스플레이 를 통해 표시하도록 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 확대된 사이즈를 가지는 상기 제1 키 및 상기 확대된 사이즈를 가지는 상기 제2 키 중 하나의 키에 대한 다른 (another) 터치 입력을 수신하도록 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실 행될 시, 상기 다른 터치 입력이 수신된 상기 키에 의해 나타내어지는 캐릭터를 상기 텍스트 입력 부분 내에서 상기 디스플레이를 통해 표시하도록, 더 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 다른 캐릭터가 상기 텍스트 입력 부분 내에 서 표시되기 전 상기 텍스트 입력 부분 내에서 표시된 상기 캐릭터를 상기 텍스트 입력 부분으로부터 삭제하기 위한 입력이 상기 가상 키보드를 통해 수신되는지 여부에 기반하여, 상기 전자 장치 내에 저장된, 상기 가상 키 보드의 사용 이력에 대한 정보를 조정하도록, 더 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 터치 입력을 야기한 입력 수단의 유형 을 식별하도록 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 식별 된 유형이 사용자의 손가락인지 또는 스타일러스 펜인지 여부에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐 릭터 중 상기 캐릭터를 식별하도록, 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치의 모드가 포트레이트 모드 (portrait mode)인지 또는 랜드스케이프 모드(landscape mode)인지 여부에 더 기반하여, 상기 제1 캐릭터 및 상 기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 제1 키의 위치와 상기 터치 입력을 야 기한 사용자의 손의 위치 사이의 상대적 위치 관계에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상 기 캐릭터를 식별하도록, 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 터치 입력 바로 이전에 다른(another) 터치 입력이 상기 복수의 키들 중 하나의 키에 대하여 수신되었던 타이밍과 상기 터치 입력이 수신되었던 타이 밍 사이의 시간에 더 기반하여, 상기 제1 캐릭터 및 상기 제2 캐릭터 중 상기 캐릭터를 식별하도록, 구성될 수 있다. 일 실시예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 제1 키에 의해 나타내어지는 상기 제1 캐릭터가 상기 적어도 하나의 제3 캐릭터로부터 도출된 맥락에 대응함을 식별하는 것에 기반하여, 상기 제2 키 에 의해 나타내어지는 상기 제2 캐릭터를 식별하는 것을 삼가하거나(refrain from) 우회하고(bypass), 상기 제1 캐릭터를 상기 캐릭터로 식별하도록, 더 구성될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어쪠)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5a 도면5b 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2022-0015981", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 일 실시예에 따라, 터치 입력에 응답하여 사용자에 의해 의도된 캐릭터를 식별하는 방법을 도시하는 흐 름도이다. 도 3은 일 실시예에 따라 전자 장치의 디스플레이를 통해 표시되는 예시적인(exemplary) 가상 키보드를 도시한 다. 도 4는 일 실시예에 따라, 제1 캐릭터 및 제2 캐릭터 중 하나의 캐릭터를 식별하는 방법을 도시하는 흐름도이다. 도 5a는 일 실시예에 따라 터치 입력의 접촉점의 위치에 기반하여 제1 캐릭터 및 제2 캐릭터 중 하나의 캐릭터 를 식별하는 방법을 도시하는 흐름도이다. 도 5b는 일 실시예에 따라 식별되는 인식 영역 및 보호 영역의 예를 도시한다. 도 6은 일 실시예에 따라 가상 키보드 내의 제1 키 및 제2 키를 확대하는 방법을 도시하는 흐름도이다. 도 7은 일 실시예에 따라 표시된 확대된 사이즈를 가지는 제1 키 및 확대된 사이즈를 가지는 제2 키의 예를 도 시한다. 도 8은 일 실시예에 따라 가상 키보드에 대한 사용 이력에 대한 정보를 조정하는(adjust) 방법을 도시하는 흐름 도이다. 도 9는 일 실시예에 따라 텍스트 입력 부분 내에서 표시된 캐릭터를 삭제하기 위한 입력의 예를 도시한다. 도 10은 일 실시예에 따라 제2 키에 의해 나타내어지는 제2 캐릭터를 식별하는 것을 삼가하거나 우회하는 방법 을 도시하는 흐름도이다. 도 11은 일 실시예에 따라, 복수의 미리 결정된 단어들을 조정하는 것에 기반하여 캐릭터를 식별하는 방법을 도 시하는 흐름도이다. 도 12는 일 실시예에 따라, 터치 입력에 응답하여 사용자에 의해 의도된 캐릭터를 식별하기 위해 이용되는 예시 적인 소프트웨어 모듈들을 도시한다."}
