{"patent_id": "10-2019-0178558", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0085487", "출원번호": "10-2019-0178558", "발명의 명칭": "오토인코더를 이용한 메타표면 통신시스템", "출원인": "성균관대학교산학협력단", "발명자": "최계원"}}
{"patent_id": "10-2019-0178558", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복소수의 행렬과 채널을 통해 송신부에서 전달한 신호와 수신부에서 받은 신호를 비교한 값을 입력받아, 인공신경망 기반 인코더를 이용하여 코딩 패턴을 만들어 내는 송신부;메타표면과 신호원으로 구성되어, 상기 송신부에서 만들어진 코딩 패턴이 적용되며, 정확히 상기 송신부로 신호를 반사하기 위해 신호원과 메타표면간의 각도를 조정하는 채널; 및복수의 수신 안테나로 구성되며, 수신된 신호들로부터 채널을 추출하여 상기 송신부의 입력값으로 전달하여 현재 통신시스템에 더 적합한 코딩 패턴을 학습시키는 수신부를 포함하는 것을 특징으로 하는 오토인코더를 이용한 메타표면 통신시스템."}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 오토인코더를 이용한 메타표면 통신시스템은 복소수의 행렬과 채널을 통해 송신부에서 전달한 신 호와 수신부에서 받은 신호를 비교한 값을 입력받아, 인공 신경망 기반 인코더를 이용하여 코딩 패턴을 만들어 내는 송신부; 메타표면과 신호원으로 구성되어, 상기 송신부에서 만들어진 코딩 패턴이 적용되며, 정확히 상기 송신부로 신호를 반사하기 위해 신호원과 메타표면간의 각도를 조정하는 채널; 및 복수의 수신 안테나로 구성되 며, 수신된 신호들로부터 채널을 추출하여 상기 송신부의 입력값으로 전달하여 현재 통신시스템에 더 적합한 코 딩 패턴을 학습시키는 수신부를 포함한다. 이때, 메타표면을 조정하는 인코더는 통신이 진행될수록 더 많은 데이터들로부터 학습할 수 있으므로 최종적으로 는 통신환경에 최적화된 코딩 패턴을 만들어 낼 수 있게 된다."}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 오토인코더를 이용한 메타표면 통신시스템에 관한 것이다."}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 기술의 발달로 많은 전자부품의 성능이 향상되었고, 대용량의 정보처리가 필요했던 AI는 이를 계기로 여러 기술과 접목하며 발달하고 있다. 더 작고 싼 저장 장치에 더 많은 데이터를 저장할 수 있게 되었고, 처리 장치 들 또한 더 작고 효율 높은 코어들이 들어가게 되어 수많은 데이터를 빠르게 처리할 수 있게 되었다. 인공지능의 발달은 다른 여러 최신 기술들에 적용되었고, 통신 기술에서는 AI를 적용하여 더 빠르고 안정적인 연결을 보장하였고, 6G의 개념에 더 다가가게 되었다. 사람들이 저장 장치들을 들고 다니지 않게 하려면 매우 높은 데이터전송률이 필요하다. 5G에서는 MIMO 통신체계에 의해 실현될 수 있으며, 기본적으로 송신기의 개수를 늘리는 것으로 속도와 안정성을 높일 수 있다. 시스템 설계의 복잡성이 변수의 수에 따라 증가하므로 이후 기술 이 발전하여도 더 많은 변수를 사용하지 못하는 한계가 있다. 특히 기존의 시스템이 고정된 모델을 가지고 있다 면 실제 환경에 적용되지 못할 가능성이 크다. 본 발명은 더 높은 적응력을 가지고 더 많은 변수를 처리할 수 있는 새로운 방식의 통신시스템을 제안한다. 밑 에서 기술할 통신시스템은 오토인코더를 기반으로 하며 송신부 전에 인코드하고 수신부를 통과한 뒤 디코드하게 되어있다. 비지도 학습방식인 오토인코더는 여러 잡음이 포함된 실제 데이터들을 통해 더 현실적인 모델 구현이 가능할 것이다. 수신부는 메타표면으로 구성되어있으며, 이는 재구성 가능한 디지털 코드 전송 장치로 신호를 여러 방향으로 퍼뜨려 더 많은 수신기와 통신을 할 수 있게 한다. 오토인코더의 사용은 기존 수학적 모델링 과 정을 생략함으로써 시스템 설계 과정을 매우 단순화할 것이다."}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에서는 오토인코더를 이용하여 컴퓨터가 수신기들에게 최고의 효율로 신호를 전달하도록 메타표면의 패 턴을 변경하는 통신시스템을 제안한다. 이 통신시스템을 이용하면 컴퓨터가 스스로 저장공간과 처리 장치를 최 대한 활용하여 다른 환경에서도 여러 수신기와 최적화된 통신이 가능한 메타표면 패턴을 찾을 수 있다."}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 발명에 따른 오토인코더를 이용한 메타표면 통신시스템은 복소수의 행렬과 채 널을 통해 송신부에서 전달한 신호와 수신부에서 받은 신호를 비교한 값을 입력받아, 인공 신경망 기반 인코더 를 이용하여 코딩 패턴을 만들어 내는 송신부; 메타표면과 신호원으로 구성되어, 상기 송신부에서 만들어진 코딩 패턴이 적용되며, 정확히 상기 송신부로 신호를 반사하기 위해 신호원과 메타표면간의 각도를 조정하는 채널; 및 복수의 수신 안테나로 구성되며, 수신된 신호들로부터 채널을 추출하여 상기 송신부의 입력값으로 전 달하여 현재 통신시스템에 더 적합한 코딩 패턴을 학습시키는 수신부를 포함한다."}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 오토인코더와 메타표면을 이용한 새로운 송신장치의 구현으로 컴퓨터가 가진 저장공간과 처리 장치를 최대한의 효율로 이용할 수 있다. 심층 오토인코더 알고리즘과 격자 배열 형태의 메타표면 송신기를 이용하면 새로운 버전의 MIMO 같은 구조를 구현할 수 있다. 본 발명을 통하여 송신 신호는 메타표면을 통해 분산되어 다 수의 장치로 전달이 가능하게 되며 데이터 크기, 속도 면에서의 확장은 물론, 새로운 통신 패턴을 발견할 가능 성도 더 커질 것이다. 오토인코더라는 비지도학습 방법은 사람이 직접 하던 수학적 시스템 설계를 컴퓨터가 대신하게 되며 더 다양한 환경에 적합하게 디자인할 수 있다. 특히 메타표면을 포함한 시스템은 송신 유닛이 늘어날수록 복잡도가 기하급 수적으로 증가하지만, 오토인코더 알고리즘으로 시스템 디자인을 간소화 할 수 있다. 또한, 오토인코더를 통한 학습이 실제 환경의 제약조건 안에서 일어나므로 각각의 환경에 맞는 특정한 시스템을 구현할 수 있다."}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 오토인코더를 이용한 메타표면 통신시스템의 도면이다. 도 1을 참조하면, 본 발명의 통신시스템은 송신부, 채널 및 수신부를 포함한다. 송신부는 입력 신호 S와 채널 C, 그리고 학습 가능한 인코더로 구성되어 있다. 채널 부분은 송신부의 인코더로 부터 받은 코딩 패턴을 적용한 메타표면을 이용하여 으로부터 받은 원신호를 특정 방향으로 반사한다. 송신부는 n개의 안테나로 구성되며 수신된 신호로부터 를 해석해낸다. 본 시스템의 모델은 다음과 같은 공식을 갖는다. [수학식 1]"}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수식와 에서 는 on/off 상태를 배열로 표현한 메타표면의 코딩 패턴으로 인코더로부터 수식처럼 입력 신호 S와 채널 C를 결합한 매트릭스를 이용해 만들어진다. 수식는 수신부에서 받은 신호로부터 와 의 형태로 채널을 추출한다는 것을 보여준다. 수식의 함수는 기본적으로 수신 안테나의 수신 전압을 계산한 것이다. 이 함수 는 x를 메타표면의 셀 상태 배열로 사용하고, 신호 발생기 T로부터 얻은 매개 변수들을 수식와 에 적용하 여 만든다. [수학식 2]"}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수식는 분산 필드 를 나타내는데, m,n은 각 메타표면 셀들의 행과 열 번호이며, Amn, amn은 T 로부터 받은 신호의 진폭과 위상이다. 은 반사된 신호의 위상과 진폭을 의미하며, 는 분산 패턴으로 로도 나타낼 수도 있다. 는 신호 발생기의 메타표면 의 각 셀에 대한 고도와 방위각을 나타내며, dx와 dy는 x와 y 방향에 대한 주기를 의미한다. [수학식 3]"}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수식은 수신 전압 를 복소수의 형태로 계산하는 방법을 보여준다. 는 i번째 수신기의 수신 전압으로 로 표현할 수 있다. 는 각 안테나의 복사 저항이며, 는 수신된 신호의 파장을 의미하 고, 는 자유공간에서의 저항을 말한다. 총 수신 전압 는 수학식 4와 같이 n개의 수신기가 받는 수신 전압을 배열로 만든 것이다. [수학식 4]"}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수식로부터 얻은 와 입력 신호 S를 이용하면 병형된 평균 제곱근 오차를 적용한 뒤 신호를 이동하는"}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "와 증폭하기 위한 를 이용하여 수식 과 같이 손실 함수를 만들 수 있다. [수학식 5]"}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "와 의 정의는 손실 함수를 미분하여 수식 와 과 같이 나타낸다. 수식 는 손실 함수를 에 대해 미분한 것으로 변수 만을 남겨 손실 함수의 최저점을 찾는데 사용한다. 이후 손실 함수를 에 대해 미분하여 수식을 이용하여 를 소거하면 수식 을 얻을 수 있다. [수학식 6]"}
{"patent_id": "10-2019-0178558", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "오토인코더 알고리즘은 비지도 학습방법으로, 임의로 변동되는 입력 신호 S를 특정한 라벨을 설정하지 않고 입 력값으로 사용할 수 있다. 수식 과 에서 설명한 것처럼 와 로 이루어진 채널 C 또한, 인코더에 입 력값으로 사용된다. 이 형태의 오토 인코더는 입력 신호 S 뿐만 아니라 채널의 매개 변수 와 도 고려하므 로 어느 채널 상황에도 적응할 수 있게 된다. - 실험을 위한 시스템 구성 전체 시스템은 파이썬 기반의 가상환경에서 실행된다. 입력 정보인 S는 numpy 라이브러리를 통해 임의의 배열을 생성하게 된다. 인코더는 텐서플로우 신경망 라이브러리로 만들어진다. 메타표면은 32 X 32의 셀을 가지며 채널 과 노이즈의 영향을 받도록 설정한다. 학습 단계에선 배치를 이용한 반복이 이루어지며, 와 를 매 배치의 마지막에 얻어 채널과 손실 함수에 사용하여 신경망을 업데이트한다. - 결과 활용예 메타표면과 인공지능은 6G의 주요 기술 중 하나이다. 본 발명에서 제시하는 시스템은 많은 노드들과 유연하게 통신해야하는 경우에 적용하면 높은 효율을 보일 수 있다. 그중 크게 이동 통신과 센서 네트워크 통신을 예로 들 수 있다. 이동 통신의 경우 도시 같은 밀집된 구역에서의 상황에 해당한다. 전달되는 정보들은 상대적으로 작을 수 있으 나 빠른 속도로 반응하고, 수많은 사용자들과 통신해야 한다. 제안된 시스템은 낮은 수준의 이동 통신 시스템에서 이러한 종류의 상황을 효과적으로 수용할 수 있다. 센서 네트워크 통신의 경우도 이동 통신과 유사하다. 센서들에게 신호를 전달하기 위해 여러 안테나를 설치할 필요 없이 메타표면 안테나를 환경에 맞게 학습시키면 여러 센서들에게 동시에 명령을 내릴 수 있게 된다. 한편, 상술한 본 발명의 실시예들은 컴퓨터에서 실행될 수 있는 프로그램으로 작성가능하고, 컴퓨터로 읽을 수 있는 기록매체를 이용하여 상기 프로그램을 동작시키는 범용 디지털 컴퓨터에서 구현될 수 있다. 상기 컴퓨터로 읽을 수 있는 기록매체는 마그네틱 저장매체(예를 들면, 롬, 플로피 디스크, 하드디스크 등), 광 학적 판독 매체(예를 들면, 시디롬, 디브이디 등) 를 포함한다. 이제까지 본 발명에 대하여 그 바람직한 실시예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통 상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고 려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2019-0178558", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 오토인코더를 이용한 메타표면 통신시스템의 도면이다."}
