{"patent_id": "10-2023-0053656", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0157793", "출원번호": "10-2023-0053656", "발명의 명칭": "ICD 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 이용한 항생제 처", "출원인": "연세대학교 산학협력단", "발명자": "박세윤"}}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "ICD(International Classification of Diseases) 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증데이터를 저장하는 메모리; 및상기 ICD 코드 기반의 감염병 분류 데이터 및 상기 항생제 적응증 데이터를 기초로 진료 데이터에 대한 항생제처방 평가를 수행하는 프로세서;를 포함하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 진료 데이터에서 질병명 또는 ICD 코드를 추출하고, 상기 진료 데이터에서 항생제 사용 내역을 추출하고,ICD 코드 기반 감염병 분류 데이터 및 항생제 적응증 데이터를 기초로 상기 추출한 질병명 또는 ICD 코드에 대응하는 항생제 적응증 정보를 확인하고, 상기 확인한 항생제 적응증 정보와 상기 항생제 사용 내역을 기초로 상기 항생제 처방 평가를 수행하는 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 ICD 코드 기반 감염병 분류 데이터는,감염병들을 신체 영역을 기준으로 복수 개의 대분류 및 각 대분류에 속하는 하나 이상의 소분류로 분류하며, 각소분류에 속하는 ICD 코드들을 포함하는 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 ICD 코드는 ICD-9, ICD-10 또는 ICD-11인 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 항생제 적응증 데이터는,상기 ICD 코드 기반 감염병 분류 데이터의 각 소분류에 속하는 ICD 코드들에 대한 항생제 적응증 정보를 포함하는 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 항생제 적응증 데이터는,상기 각 소분류에 속하는 ICD 코드들 전체가 항생제 적응증인 경우, 적응증(indicated)을 나타내고,상기 각 소분류에 속하는 ICD 코드들 전체가 항생제 비적응증인 경우, 비적응증(not indicated)을 나타내고,상기 각 소분류에 속하는 ICD 코드들 중 적어도 일부가 항생제 적응증인 경우, 부분적인 적응증(partiallyindicated)을 나타내는 인디케이션 정보를 포함하는 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0157793-3-제6항에 있어서,상기 항생제 적응증 데이터는,상기 각 소분류에 속하는 ICD 코드들의 항생제 적응증 비율을 나타내는 인디케이션 비율 정보를 포함하는 것을특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 항생제 적응증 데이터는,상기 각 소분류에 속하는 ICD 코드에 속하면서, 감염병에 해당하는 ICD 네임들에 대한 정보를 포함하는 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 프로세서는,상기 진료 데이터에서 질병명을 추출한 경우, 상기 ICD 코드 기반 감염병 분류 데이터에서 상기 추출한 질병명에 대응하는 ICD 코드들을 확인하고, 상기 항생제 적응증 데이터에서 상기 확인한 ICD 코드들에 대응하는 인디케이션 정보를 확인하여 상기 항생제처방 평가를 수행하는 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 프로세서는,상기 진료 데이터에서 ICD 코드를 추출한 경우, 상기 항생제 적응증 데이터에서 상기 추출한 ICD 코드에 대응하는 인디케이션 정보를 확인하여 상기 항생제 처방 평가를 수행하는 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서,상기 프로세서는,상기 항생제 사용 내역이 상기 확인한 항생제 적응증 정보와 부합하는지 확인하고, 부합하면 항생제 처방이 적절했음을 나타내는 항생제 처방 평가를 생성하고, 부합하지 않으면 항생제 처방이 부적절했음을 나타내는 항생제 처방 평가를 생성하는 것을 특징으로 하는 항생제 처방 평가 장치."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "장치에 의해 수행되는 방법에 있어서,진료 데이터를 입력받는 단계;상기 진료 데이터로부터 질병명 또는 ICD(International Classification of Diseases) 코드를 추출하는 단계;상기 진료 데이터로부터 항생제 사용 내역을 추출하는 단계ICD 코드 기반 감염병 분류 데이터 및 항생제 적응증 데이터를 기초로, 상기 추출한 질병명 또는 ICD 코드에 대응하는 항생제 적응증 정보를 확인하는 단계;상기 확인한 항생제 적응증 정보와 상기 항생제 사용 내역을 기초로 항생제 처방 평가를 생성하는 단계; 및항생제 처방 평가를 출력하는 단계;를 포함하는 항생제 처방 평가 방법."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2024-0157793-4-장치에 의해 수행되는 방법에 있어서,질병명 및/또는 ICD 코드를 입력받는 단계;ICD 코드 기반 감염병 분류 데이터에서 상기 입력된 질병명 및/또는 ICD 코드에 대응하는 항생제 적응증 정보를확인하는 단계; 및상기 확인한 항생제 적응증 정보를 출력하는 단계;를 포함하는 항생제 적응증 정보 제공 방법."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 ICD 코드 기반 감염병 분류 데이터는,감염병들을 신체 영역을 기준으로 복수 개의 대분류 및 각 대분류에 속하는 하나 이상의 소분류로 분류하며, 각소분류에 속하는 ICD 코드들을 포함하는 것을 특징으로 하는 항생제 적응증 정보 제공 방법."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 항생제 적응증 데이터는,상기 ICD 코드 기반 감염병 분류 데이터의 각 소분류에 속하는 ICD 코드들에 대한 항생제 적응증 정보를 포함하는 것을 특징으로 하는 항생제 적응증 정보 제공 방법."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 항생제 적응증 데이터는,상기 각 소분류에 속하는 ICD 코드들 전체가 항생제 적응증인 경우, 적응증(indicated)을 나타내고,상기 각 소분류에 속하는 ICD 코드들 전체가 항생제 비적응증인 경우, 비적응증(not indicated)을 나타내고,상기 각 소분류에 속하는 ICD 코드들 중 적어도 일부가 항생제 적응증인 경우, 부분적인 적응증(partiallyindicated)을 나타내는 인디케이션 정보를 포함하는 것을 특징으로 하는 항생제 적응증 정보 제공 방법."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 확인한 항생제 적응증 정보를 확인하는 단계는,상기 입력된 질병명 및/또는 ICD 코드에 대응하는 항생제 적응증 정보 중 인디케이션 정보를 확인하는 것을 특징으로 하는 항생제 적응증 정보 제공 방법."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 항생제 적응증 정보를 확인하는 단계는,상기 질병명이 입력된 경우, 상기 ICD 코드 기반 감염병 분류 데이터에서 상기 입력된 질병명에 대응하는 ICD코드들을 확인하는 단계; 및상기 항생제 적응증 데이터에서, 상기 확인한 ICD 코드들에 대응하는 인디케이션 정보를 확인하는 것을 특징으로 하는 항생제 적응증 정보 제공 방법."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,공개특허 10-2024-0157793-5-상기 항생제 적응증 정보를 확인하는 단계는,상기 ICD 코드가 입력된 경우, 상기 항생제 적응증 데이터에서, 상기 입력된 ICD 코드에 대응하는 항생제 적응증 정보를 확인하는 것을 특징으로 하는 항생제 적응증 정보 제공 방법."}
{"patent_id": "10-2023-0053656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제12항에 있어서,하드웨어인 컴퓨터와 결합되어, 제12항의 항생제 처방 평가 방법을 실행시키기 위한 프로그램이 저장된 컴퓨터판독 가능한 기록매체."}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 항생제 처방 평가 장치에 관한 것으로, ICD(International Classification of Diseases) 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 저장하는 메모리 및 상기 ICD 코드 기반의 감염병 분류 데이터 및 상기 항생제 적응증 데이터를 기초로 진료 데이터에 대한 항생제 처방 평가를 수행하는 프로세서를 포 함할 수 있다."}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 항생제 처방 평가 장치, 방법 및 프로그램에 관한 것이다. 보다 상세하게는, 본 개시는 ICD 코드 기 반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 이용한 항생제 처방 평가 장치, 방법 및 프로그 램에 관한 것이다."}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "ICD(International Classification of Diseases) 코드는 질병 및 질환을 분류 체계 중 하나로, 세계 보건 기구 (WHO)에서 개발한 것이다. 의료분야 연구자들은 ICD 코드를 이용하여 특정 질환을 검색 및 추출하여 연구를 수 행하고 있다. 그러나 현재까지는 ICD 코드를 이용하여 감염병을 체계적으로 분류하는 방법이 제한적이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2023-0007793호 (2023.01.13)"}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에 개시된 실시예는 ICD 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 이용한 항생제 처방 평가 장치, 방법 및 프로그램을 제공하는데 그 목적이 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 본 개시에 따른 항생제 처방 평가 장치는, ICD(International Classification of Diseases) 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 저장하는 메모리 및 상기 ICD 코드 기반의 감염병 분류 데이터 및 상기 항생제 적응증 데이터를 기초로 진료 데이터에 대 한 항생제 처방 평가를 수행하는 프로세서를 포함할 수 있다. 또한, 본 개시에 따른 항생제 처방 평가 방법은 진료 데이터를 입력받는 단계, 상기 진료 데이터로부터 질병명 또는 ICD(International Classification of Diseases) 코드를 추출하는 단계, 상기 진료 데이터로부터 항생제 사용 내역을 추출하는 단계, ICD 코드 기반 감염병 분류 데이터 및 항생제 적응증 데이터를 기초로, 상기 추출 한 질병명 또는 ICD 코드에 대응하는 항생제 적응증 정보를 확인하는 단계, 상기 확인한 항생제 적응증 정보와 상기 항생제 사용 내역을 기초로 항생제 처방 평가를 생성하는 단계 및 항생제 처방 평가를 출력하는 단계를 포 함할 수 있다. 또한, 본 개시에 따른 항생제 적응증 정보 제공 방법은 질병명 및/또는 ICD 코드를 입력받는 단계, ICD 코드 기 반 감염병 분류 데이터에서 상기 입력된 질병명 및/또는 ICD 코드에 대응하는 항생제 적응증 정보를 확인하는단계 및 상기 확인한 항생제 적응증 정보를 출력하는 단계를 포함할 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 프로그램이 저장된 컴퓨터 판독 가능한 기록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 전술한 과제 해결 수단에 의하면, ICD 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 이용하여 감염병 진료에 대한 항생제 처방 평가를 수행함으로써, 항생제 처방 평가의 정확도를 높이고, 항생제 처방 평가에 소요되는 시간을 줄이는 효과를 제공한다. 또한, ICD 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 이용하여 항생제 적응증 정보 제공을 수행함으로써, 특정 감염병에 대해 항생제 사용이 필요한지에 대해 빠른 피드백을 제공하는 효과를 제공 한다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '부, 모듈, 부재, 블록'이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블 록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제 1, 제 2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 본 명세서에서 '본 개시에 따른 장치'는 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들 이 모두 포함된다. 예를 들어, 본 개시에 따른 장치는, 컴퓨터, 서버 장치 및 휴대용 단말기를 모두 포함하거나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 상기 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱 (laptop), 태블릿 PC, 슬레이트 PC 등을 포함할 수 있다. 상기 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터베이스 서버, 파일 서버, 게임 서버, 메일 서버, 프록시 서버 및 웹 서버 등을 포함할 수 있다. 상기 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD) 등과 같은 웨어러블 장치를 포함할 수 있다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 도 1은 본 개시의 실시예에 따른 항생제 처방 평가 장치의 블록도를 나타내는 도면이다. 도 1을 참조하면, 항생 제 처방 평가 장치는 프로세서, 통신부, 메모리 및 입출력부를 포함할 수 있다. 도 1 에 도시된 구성요소들은 본 개시에 따른 항생제 처방 평가 장치를 구현하는데 있어서 필수적인 것은 아니 어서, 본 명세서 상에서 설명되는 항생제 처방 평가 장치는 위에서 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 프로세서는 본 장치 내의 구성요소들의 동작을 제어하기 위한 알고리즘 또는 알고리즘을 재현한 프로 그램에 대한 데이터를 저장하는 메모리, 및 메모리에 저장된 데이터를 이용하여 전술한 동작을 수행 하는 적어도 하나의 프로세서로 구현될 수 있다. 이때, 메모리와 프로세서는 각각 별개의 칩으 로 구현될 수 있다. 또는, 메모리와 프로세서는 단일 칩으로 구현될 수도 있다. 또한, 프로세서는 이하의 도면에서 설명되는 본 개시에 따른 다양한 실시 예들을 본 장치 상에서 구 현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수를 조합하여 제어할 수 있다. 본 개시의 실시예에 따르면, 프로세서는 ICD(International Classification of Diseases) 코드 기반의 감 염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 이용하여, 이미 수행된 감염병 관련 진료들에 대한 항생 제 처방 평가 동작을 수행할 수 있다. 구체적으로, 프로세서는 여러 종류의 감염병을 ICD 코드 기반으로 분류한 감염병 분류 데이터를 이용하여, 이미 수행된 감염병 진료에 해당하는 대상 감염병의 ICD 코드를 확인할 수 있다. 그리고 프로세서는 항생제 적응증 데이터를 이용하여, 확인한 ICD 코드에 대응하는 대상 감염병 이 항생제 적응증인지 여부를 확인할 수 있다. 그리고 프로세서는 확인한 항생제 적응증 여부와 대상 감염 병에 대한 항생제 사용 내역을 비교하여, 이미 수행된 감염병 진료에서 항생제 처방이 적절했는지 여부를 판단 하는 항생제 처방 평가를 수행할 수 있다. 또한, 본 개시의 실시예에 따르면, 프로세서는 ICD 코드 기반의 감염병 분류 데이터(CD) 및 대응하는 항생 제 적응증 데이터(ID)를 이용하여, 특정 감염병에 대응하는 항생제 적응증 정보 제공 동작을 수행할 수 있다. 구체적으로, 프로세서는 ICD 코드 기반의 감염병 분류 데이터(CD)를 이용하여, 대상 감염병에 대응하는ICD 코드를 확인할 수 있다. 그리고 프로세서는 항생제 적응증 데이터(ID)를 이용하여, 확인한 ICD 코드에 대응하는 대상 감염병이 항생제 적응증인지 여부를 확인하고, 대상 감염병의 항생제 적응증 정보를 제공할 수 있다. 여기서, ICD 코드 기반의 감염병 분류 데이터(CD)는 감염병들을 ICD 코드를 이용하여 분류한 데이터를 의미한다. 일 실시예에서, ICD 코드 기반의 감염병 분류 데이터(CD)는, 감염병들을 신체 영역을 기준으로 복수 개의 대분류로 분류할 수 있다. 예를 들어, ICD 코드 기반의 감염병 분류 데이터(CD)는 심혈관계감염, 연부조직 감염, 소화기계감염, 요로감염, 호중구감소발열, 골관절감염, 호흡기계감염, 기타의 8개의 대분류로 감염병들을 분류할 수 있다. 한편, ICD 코드 기반의 감염병 분류 데이터(CD)의 대분류 기준은 신체 영역에 한하지 않으며, 대분류 개수도 8개 미만 또는 9개 이상일 수 있다. 그리고 ICD 코드 기반의 감염병 분류 데이터(CD)는 각 대분류에 속하는 감염병들을 보다 세부적인 사항을 기준 으로 하나 이상의 소분류로 분류할 수 있다. 예를 들어, 심혈관계감염은 심장내막염(Endocarditis), 정맥염 (Phlebitis), 심낭염(Pericarditis), 기타 심장 및 혈관 장치로 인한 감염(Infection due to other cardiac and vascular devices), 심근염(Myocarditis) 등으로 분류할 수 있다. 그리고 ICD 코드 기반의 감염병 분류 데 이터(CD)는 각 소분류에 대응하는 ICD 코드들을 포함할 수 있다. 한편, 전술한 예에서는 ICD 코드 기반의 감염병 분류 데이터(CD)가 대분류 및 소분류의 2단계의 다중 분류에 따 라 감염병을 분류한 것으로 설명하였지만, 본 개시는 이에 한하지 않는다. 예를 들어, ICD 코드 기반의 감염병 분류 데이터(CD)는 1단계의 단일 분류에 따라 감염병을 분류하거나, 3단계 이상의 다중 분류에 따라 감염병을 분류하도록 구현될 수도 있다. 이 경우, ICD 코드 기반의 감염병 분류 데이터(CD)는 가장 작은 단위의 분류 항 목 각각에 대응하는 ICD 코드들을 포함할 수 있다. 본 개시에서는 상기 ICD 코드가 ICD-10인 것을 전제로 설명한다. 그러나, 본 개시는 이에 한하지 않으며, 실시 예에 따라 ICD 코드는 ICD-9 또는 ICD-11 등 ICD 코드이면 족하다. 또한, 항생제 적응증 데이터(ID)는, 특정 ICD 코드에 해당하는 감염병이 항생제 적응증에 해당하는지 여부에 대 한 데이터를 포함할 수 있다. 예를 들어, 항생제 적응증 데이터(ID)는, ICD 코드 기반의 감염병 분류 데이터의 소분류 각각에 대응하는 감염병에 대하여, 적응증(indicated), 부분적인 적응증(partially indicated) 및 비적 응증(not indicated)를 제시할 수 있다. 또한, 실시예에 따라, 항생제 적응증 데이터(ID)는 특정 ICD 코드에 해 당하는 감염병에 적절한 항생제 종류에 대한 정보를 추가적으로 포함하도록 구현될 수 있다. 프로세서의 항생제 처방 평가 동작 및 항생제 적응증 정보 제공 동작에 대한 상세한 설명은 도 3 내지 도 9에서 후술한다. 통신부는 외부 장치와 통신을 가능하게 하는 하나 이상의 구성 요소를 포함할 수 있으며, 예를 들어, 유선 통신 모듈, 무선통신 모듈 및 근거리 통신 모듈 중 적어도 하나를 포함할 수 있다. 유선 통신 모듈은, 지역 통신(Local Area Network; LAN) 모듈, 광역 통신(Wide Area Network; WAN) 모듈 또는 부가가치 통신(Value Added Network; VAN) 모듈 등 다양한 유선 통신 모듈뿐만 아니라, USB(Universal Serial Bus), HDMI(High Definition Multimedia Interface), DVI(Digital Visual Interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 다양한 케이블 통신 모듈을 포함할 수 있다. 무선 통신 모듈은 와이파이(Wifi) 모듈, 와이브로(Wireless broadband) 모듈 외에도, GSM(global System for Mobile Communication), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), UMTS(universal mobile telecommunications system), TDMA(Time Division Multiple Access), LTE(Long Term Evolution), 4G, 5G, 6G 등 다양한 무선 통신 방식을 지원하는 무선 통신 모듈을 포함할 수 있 다. 무선 통신 모듈은 신호를 송신하는 안테나 및 송신기(Transmitter)를 포함하는 무선 통신 인터페이스를 포함할 수 있다. 또한, 무선 통신 모듈은 제어부의 제어에 따라 무선 통신 인터페이스를 통해 제어부로부터 출력된 디 지털 제어 신호를 아날로그 형태의 무선 신호로 변조하는 신호 변환 모듈을 더 포함할 수 있다. 무선 통신 모듈은 신호를 수신하는 안테나 및 수신기(Receiver)를 포함하는 무선 통신 인터페이스를 포함할 수 있다. 또한, 무선 통신 모듈은 무선 통신 인터페이스를 통하여 수신한 아날로그 형태의 무선 신호를 디지털 제 어 신호로 복조하기 위한 신호 변환 모듈을 더 포함할 수 있다.근거리 통신 모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있다. 본 개시의 실시예에 따르면, 통신부는 외부 서버/장치로부터 진료 데이터들을 수신할 수 있다. 이때, 진료 데이터는 이미 수행된 진료에 대한 데이터로, 진료 번호, 환자 번호, 질병명 및 진료 내용 중 적어도 하나를 포 함할 수 있다. 또한, 상기 진료 내용은 실시예에 따라, 항생제 처방 이력을 포함할 수 있다. 또한, 통신부(12 0)는 본 장치 내에서 수행되는 프로세스를 통해 항생제 처방 평가 및/또는 항생제 적응증 정보를 외부 서 버/장치로 송신할 수 있다. 메모리는 본 장치의 다양한 기능을 지원하는 데이터와, 프로세서의 동작을 위한 프로그램을 저 장할 수 있고, 입/출력되는 데이터들(예를 들어, 음악 파일, 정지영상, 동영상 등)을 저장할 수 있고, 본 장치 에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 본 장치 의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통 신을 통해 외부 서버로부터 다운로드 될 수 있다. 이러한, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입 (Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 본 장치와는 분리되어 있으 나, 유선 또는 무선으로 연결된 데이터베이스가 될 수도 있다. 본 개시의 실시예에 따르면, 메모리는 본 장치의 항생제 처방 평가 동작 및 항생제 적응증 정보 제공 동작을 실행하기 위한 각종 명령어, 알고리즘 및 인공지능 모델을 저장할 수 있다. 또한, 메모리는 통신부 를 통해 수신한 진료 데이터들을 저장할 수 있다. 또한, 메모리는 ICD 코드 기반의 감염병 분류 데이 터(CD) 및 대응하는 항생제 적응증 데이터(ID)를 저장할 수 있다. 또한, 메모리는 항생제 처방 평가 동작 을 통해 획득한 항생제 처방 평가를 저장할 수 있다. 입출력부는 입력부, 출력부, 인터페이스부 등을 포함할 수 있다. 입력부는 촬영 대상의 정보를 입력받을 수도 있고, 본 장치의 제어를 위한 각종 제어 신호가 입력될 수도 있다. 따라서, 입력부는 외부의 제어 신호를 입력받을 수 있는 입력수단(예: 마우스, 키보드 등)이 적용될 수도 있고, 통신수단이 적용될 수도 있다. 출력부는 본 장치에서 산출, 검증, 생성된 데이터, 정보를 영상, 음성의 형태로 출력할 수 있는 수단이 적 용될 수 있다. 입력부는 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터, 또는 사용자로부터 입력되는 정보의 입력을 위한 것으로서, 적어도 하나의 카메라, 적어도 하나의 마이크로폰 및 사용자 입력부 중 적어도 하나를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데이터는 분석되어 사용자의 제어명령으로 처리될 수 있다. 사용자 입력부는 사용자로부터 정보를 입력받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력되면, 프로세 서는 입력된 정보에 대응되도록 본 장치의 동작을 제어할 수 있다. 이러한, 사용자 입력부는 하드웨 어식 물리 키(예를 들어, 본 장치의 전면, 후면 및 측면 중 적어도 하나에 위치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 소프트웨어식 터치 키를 포함할 수 있다. 일 예로서, 터치 키는, 소프트웨어적인 처리를 통해 터치스크린 타입의 디스플레이부 상에 표시되는 가상 키(virtual key), 소프트 키 (soft key) 또는 비주얼 키(visual key)로 이루어지거나, 상기 터치스크린 이외의 부분에 배치되는 터치 키 (touch key)로 이루어질 수 있다. 한편, 상기 가상키 또는 비주얼 키는, 다양한 형태를 가지면서 터치스크린 상 에 표시되는 것이 가능하며, 예를 들어, 그래픽(graphic), 텍스트(text), 아이콘(icon), 비디오(video) 또는 이 들의 조합으로 이루어질 수 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시키기 위한 것으로, 디스플레이부, 음향 출력부, 햅틱 모듈(Haptic Module) 및 광 출력부 중 적어도 하나를 포함할 수 있다. 디스플레이부는 터치 센서와 상호 레이어구조를 이루거나 일체형으로 형성됨으로써, 터치 스크린을 구현할 수 있다. 이러한 터치 스크린은, 본 장치 와 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부로써 기능함과 동시에, 본 장치와 사용 자 간에 출력 인터페이스를 제공할 수 있다. 디스플레이부는 본 장치에서 처리되는 정보를 표시(출력)한다. 예를 들어, 디스플레이부는 본 장치에 서 구동되는 응용 프로그램(일 예로, 어플리케이션)의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 음향 출력부는 통신부를 통해 수신되거나 또는 메모리에 저장된 오디오 데이터를 출력하거나, 본 장치 에서 수행되는 기능과 관련된 음향 신호를 출력할 수 있다. 이러한 음향 출력부에는 리시버(receiver), 스 피커(speaker), 버저(buzzer) 등이 포함될 수 있다. 인터페이스부는 본 장치에 연결되는 다양한 종류의 외부 기기와의 통로 역할을 수행한다. 이러한 인터페이 스부는 유/무선 헤드셋 포트(port), 외부 충전기 포트(port), 유/무선 데이터 포트(port), 메모리 카드(memory card) 포트, 식별 모듈(SIM)이 구비된 장치를 연결하는 포트(port), 오디오 I/O(Input/Output) 포트(port), 비 디오 I/O(Input/Output) 포트(port), 이어폰 포트(port) 중 적어도 하나를 포함할 수 있다. 본 장치에서 는, 상기 인터페이스부에 연결된 외부 기기와 관련된 적절한 제어를 수행할 수 있다. 한편, 도 1에 도시된 구성 요소들의 성능에 대응하여 적어도 하나의 구성요소가 추가되거나 삭제될 수 있다. 또 한, 구성 요소들의 상호 위치는 시스템의 성능 또는 구조에 대응하여 변경될 수 있다는 것은 당해 기술 분야에 서 통상의 지식을 가진 자에게 용이하게 이해될 것이다. 이와 같이, 본 개시에 따른 감염병 분류 데이터는 ICD 코드를 기반으로 체계적으로 감염병을 분류한 것이므로, 특정 감염병을 검색 및 추출하여 연구를 수행함에 용이할 수 있다. 또한, 본 개시에 따른 항생제 처방 평가 장치는 ICD 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 이용하여 감염병 진료에 대한 항생제 처방 평가를 수행함으로써, 항생제 처방 평가의 정확도를 높이고, 항생제 처방 평가에 소요되는 시간을 줄일 수 있다. 또한, 본 개시에 따른 항생제 처방 평가 장치는 ICD 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 이용하여 항생제 적응증 정보 제공을 수행함으로써, 특정 감염병에 대해 항생제 사용이 필요한 지에 대해 빠른 피드백을 제공할 수 있다. 도 2는 본 개시의 실시예에 따른 ICD 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 나 타내는 도면이다. 도 2를 참조하면, 병합 데이터(MD)는 감염병을 대분류 및 소분류로 분류하고, 각 소분류에 대 응하는 ICD 코드를 포함하는 감염병 분류 데이터(CD)를 포함할 수 있다. 예를 들어, 감염병 분류 데이터(CD)는 대분류 중 심혈관계 감염에 대하여, 소분류로 심장내막염(Endocarditis), 정맥염(Phlebitis), 심낭염 (Pericarditis), 기타 심장 및 혈관 장치로 인한 감염(Infection due to other cardiac and vascular device s)를 포함할 수 있다. 그리고 감염병 분류 데이터(CD)는 소분류 중 심장내막염(Endocarditis)에 대하여 ICD 코 드로 I38, B37.6, I33.0, I33.8, I33.9, T82.6를 포함할 수 있다. 그리고 감염병 분류 데이터(CD)는 소분류 중 정맥염(Phlebitis)에 대하여 ICD 코드로 I80.0, I80.2, I80.8, I80.9를 포함할 수 있다. 그리고 감염병 분류 데이터(CD)는 소분류 중 심낭염(Pericarditis)에 대하여 ICD 코드로 I30.0, I30.1, I30.8, I30.9, I31.9, I32.0, I32.1, I32.8를 포함할 수 있다. 그리고 감염병 분류 데이터(CD)는 소분류 중 기타 심장 및 혈관 장치로 인한 감염(Infection due to other cardiac and vascular devices)에 대하여 ICD 코드로 T82.5, T82.7를 포함 할 수 있다. 한편, 본 개시는 이에 한하지 않으며, 감염병 분류 데이터(CD)는 각 소분류의 ICD 코드에 속하는 ICD 네임들에 대한 정보를 추가적으로 더 포함할 수 있다. 각 ICD 코드에는 해당 코드에 속하면서 세부적인 질병 각각을 나타 내는 ICD 네임들이 포함될 수 있다. ICD 코드가 감염병에 해당하더라도, 해당 ICD 코드 내 ICD 네임들 중 적어 도 일부만이 감염병에 해당할 수 있다. 따라서, 감염병 분류 데이터(CD)는 각 소분류의 ICD 코드에 속하면서 감 염병에 해당하는 ICD 네임들에 대한 정보를 추가적으로 더 포함할 수 있다. 그리고 병합 데이터(MD)는 각 소분류에 포함된 ICD 코드들에 대한 항생제 적응증 관련 정보를 포함하는 항생제 적응증 데이터(ID)를 포함할 수 있다. 여기서 항생제 적응증 데이터(ID)는 항생제 적응증 관련 정보로서 각 소 분류에 속하는 ICD 코드들이 항생제 적응증 여부에 해당하는지 여부를 나타내는 인디케이션 정보를 포함할 수 있다. 예를 들어, 항생제 적응증 데이터(ID)는 각 소분류에 포함된 ICD 코드들에 대하여 적응증(indicated), 부 분적인 적응증(partially indicated) 및 비적응증(not indicated)를 제시하는 인디케이션 정보를 포함할 수 있다. 예를 들어, 인디케이션 정보는 심장내막염(Endocarditis)에 포함된 ICD 코드들에 대하여 적응증(indicate d)을 나타낼 수 있다. 그리고 인디케이션 정보는 정맥염(Phlebitis)에 포함된 ICD 코드들에 대하여 비적응증 (not indicated)을 나타낼 수 있다. 그리고 인디케이션 정보는 심낭염(Pericarditis)에 포함된 ICD 코드들에 대 하여 항생제 부분적인 적응증(partially indicated)을 나타낼 수 있다. 그리고 인디케이션 정보는 기타 심장 및 혈관 장치로 인한 감염(Infection due to other cardiac and vascular devices)에 포함된 ICD 코드들에 대하여 항생제 부분적인 적응증(partially indicated)을 나타낼 수 있다. 여기서 항생제 부분적인 적응증은, 해당 ICD 코드들 중 적어도 일부만이 항생제 적응증에 해당함을 의미한다. 또한, 항생제 적응증 데이터(ID)는 항생제 적응증 관련 정보로서, 각 소분류에 포함된 ICD 코드들에 해당되면서, 감염병에 해당하는 ICD 네임들 중 항생제 적응증에 해당하는 개수 또는 비율을 나타내는 세부 인디 케이션 정보를 포함할 수 있다. 예를 들어, 세부 인디케이션 정보는 심장내막염(Endocarditis)에 속하는 ICD 코드들에 해당하면서, 감염병에 해 당하는 ICD 네임들 11개 중에서 항생제 적응증에 해당하는 질병이 11개이고, 이에 따른 인디케이션 비율이 100% 임을 나타낼 수 있다. 그리고 세부 인디케이션 정보는 정맥염(Phlebitis)에 속하는 ICD 코드들에 해당하면서, 감염병에 해당하는 ICD 네임들 4개 중에서 항생제 적응증에 해당하는 질병이 0개이고, 이에 따른 인디케이션 비 율이 0%임을 나타낼 수 있다. 그리고 세부 인디케이션 정보는 심낭염(Pericarditis)에 속하는 ICD 코드들에 해 당하면서, 감염병에 해당하는 ICD 네임들 12개 중에서 항생제 적응증에 해당하는 질병이 2개이고, 이에 따른 인 디케이션 비율이 16.7%임을 나타낼 수 있다. 그리고 세부 인디케이션 정보는 기타 심장 및 혈관 장치로 인한 감 염(Infection due to other cardiac and vascular devices)에 속하는 ICD 코드들에 해당하면서, 감염병에 해당 하는 ICD 네임들 28개 중에서 항생제 적응증에 해당하는 질병이 27개이고, 이에 따른 인디케이션 비율이 96.4% 임을 나타낼 수 있다. 한편, 도 2에서는 설명의 편의를 위해, ICD 코드 기반의 감염병 분류 데이터(CD)와 항생제 적응증 데이터(ID)를 병합한 병합 데이터(MD)를 설명하였지만, 본 개시는 이에 한하지 않는다. 예를 들어, ICD 코드 기반의 감염병 분류 데이터(CD)와 항생제 적응증 데이터(ID)는 별개의 데이터로 구현될 수 있으며, 이 경우 항생제 적응증 데 이터(ID)는 개별적인 ICD 코드 또는 개별적인 ICD 네임 각각에 대한 인디케이션 정보 및 세부 인디케이션 정보 를 포함할 수 있다. 또한, 도 2에서는 항생제 적응증 데이터(ID)가 인디케이션 정보 및 세부 인디케션 정보를 포함하는 것으로 도시 하고 설명하였지만, 본 개시는 이에 한하지 않는다. 예를 들어, 항생제 적응증 데이터(ID)는 인디케이션 정보 또는 세부 인디케이션 정보만을 포함하도록 구현될 수도 있고, 실시예에 따라 각 감염병, ICD 코드 또는 ICD 네 임에 적절한 항생제 종류에 대한 정보를 추가적으로 포함하도록 구현될 수도 있다. 이하의 표 1에서는 본 개시의 일 실시예에 따른 병합 데이터(MD)를 나타낸다. 표 1 대분류 소분류 ICD 코드 세부 인디케이션(%) 심혈관계감염 Endocarditis I38, B37.6, I33.0, I33.8, I33.9, T82.6 11/11 (100%) 심혈관계감염 Phlebitis I80.0, I80.2, I80.8, I80.9 0/4(0%) 심혈관계감염 PericarditisI30.0, I30.1, I30.8, I30.9, I31.9, I32.0, I32.1, I32.8,2/12(16.7%) 심혈관계감염Infection due to other cardiac and vascular devicesT82.5, T82.7 27/28(96.4%) 심혈관계감염 MyocarditisD86.8, I01.2, I09.0, I40.0, I40.1, I40.8, I40.9, I41.0, I41.1, I41.2, I41.8, I51.4, I51.4, J10.83/16(18.75%) 심혈관계감염 Mediastinitis J98.5 4/4(100%) 심혈관계감염 Carditis I51.8 0/1(0%) 심혈관계감염ThrombophlebitisG08, I80.0, I80.1, I80.2, I80.3, I80.8, I80.9, I82.1, O22.2, O87.0, O87.112/12(100%) 심혈관계감염Mycotic Aneurysm I60.9, I67.1, I71.9 3/3(100%) 심혈관계감염Cerebral arteritis I67.7, I68.2 0/2(0%) 심혈관계감염 Endarteritis I77.6 1/1(100%)심혈관계감염 Meningitis A20.3, A22.8, A32.1, A39.0, A39.2 A39.3 A39.4, A39.5, A39.8, A39.9, A87.0, A87.1, A87.2, A87.8, A87.9, B00.3, B01.0, B02.1, B05.1, B26.1, B37.5, B38.4, B45.1, G00.0, G00.1, G00.2, G00.3, G00.8, G00.9, G0126/46(56.5%) 심혈관계감염 Sepsis A40.0, A40.1, A40.2, A40.20, A40.21, A40.3, A40.8, A40.9, A41.0, A41.1, A41.2, A41.3, A41.4, A41.50, A41.51, A41.52, A41.53, A41.58, A41.59, A41.8, A41.80, A41.88, A41.9, G08, I80.0, I80.1, I80.2, I80.3, I80.8, I80.9, I82.157/57(100%) 심혈관계감염 others I35.8, I39.0, I39.1, I43.0, I52.0, I52.1, I70.256/7(56.5%) 심혈관계감염 Bacteremia A49.9 1/1(100%) 연부조직감염 ImpetigoL00, L01.00, L01.01, L01.02, L01.08, L01.09, L01.1, L40.117/17(100%) 연부조직감염 Pyoderma L08.0, L08.8, L08.80, L08.81 13/13(100%) 연부조직감염 Ecthyma L08.0, 4/4(100%) 연부조직감염 Cellulitis H00.08, J34.0, K12.2, K61.0, L03, L03.00, L03.01, L03.1, L03.10, L03.11, L03.2, L03.30, L03.31, L03.32, L03.33, L03.34, L03.35, L03.36, L03.38, L03.39, L03.8, L03.9, N48.21, N73.2, N76.258/58(100%) 연부조직감염 Abscess K61.0, K61.1, K61.2, K61.3, K61.4, L02.0, L02.00, L02.01, L02.02, L02.10, L02.11, L02.12, L02.20, L02.21, L02.22, L02.30, L02.31, L02.32, L02.40, L02.41, L02.42, L02.80, L02.81, L02.82, L02.90, L02.91, L02.92101/101(100%) 연부조직감염 Erysipelas A46 1/1(100%) 연부조직감염 Necrotizing fasciitisM72.58, M72.59, M72.60, M72.61, M72.62, M72.63, M72.64, M72.65, M72.66, M72.67, M72.68, M72.6910/10(100%) 연부조직감염 Clostridial MyonecrosisA48.0 1/1(100%) 연부조직감염Animal or human biteS50.7, T00.0, T00.3, T00.9, T09.0, T14.0, T14.1, T63.0, T63.3, W54.915/19(78.9%) 연부조직감염 SSSS L00 1/1(100%) 연부조직감염Diabetic DermopathyE14.5, E14.50, E14.51, E14.58, E14.71 E14.72, E14.78, L99.813/13(100%) 연부조직감염 Pyomyositis A48.0, M60.00 3/3(100%) 소화기계감염Infectious DiarrheaA00.9, A02.0, A03.9, A04.5, A09.0 5/5(100%) 소화기계감염 Liver abscess K65.0, K75.0, K77.0 4/4(100%) 소화기계감염 PancreatitisB25.2, B26.3, K85.0, K85.00, K85.01, K85.02, K85.09, K85.10, K85.11, K85.12, K85.19, K85.1, K85.2, K85.20, K85.21, K85.22, K85.29, K85.3, K85.30, K85.31, K85.32, K85.80, K85.81, K85.82, K85.89, K85.8, K85.90, K85.91, K85.92, K85.99, K85.9, K85, K86.0, K86.1, K91.85/76(6.6%) 소화기계감염 Cholangitis K80.3, K80.30, K80.31, K83.0 8/10(80%) 소화기계감염 Cholecystitis D13.5, K80.0, K80.00, K80.01, K80.10, K80.11, K80.1, K80.4, K80.40, K80.41, K81.0, K81.1, K81.8, K81.9, K82.8, K82.80, K82.8833/33(100%) 소화기계감염Intra Abdominal InfectionA18.3, K65.0, T81.4, K65.8, K65.9, K67.0 K67.1, K67.2, K67.3, K67.825/27(92.6%) 소화기계감염 Appendicitis K35.0, K35.2, K35.3, K35.8, K65.8 29/29(100%) 소화기계감염 Colitis A04.3, A04.7, A05.3, A09.0, A09.9, A09 9/24(37.5%) 소화기계감염 Diverticular diseaseK57.00, K57.01, K57.10, K57.11, K57.20, K57.21, K57.30, K57.31, K57.32, K57.40, K57.41, K57.42, K57.50, K57.51, K57.80, K57.81, K57.82, K57.83, K57.90, K57.91, K57.02, K57.03, K57.92, K57.9315/26(57.7%)소화기계감염 DiverticulitisK57.12, K57.13, K57.22, K57.23, K57.32, K57.33, K57.43, K57.52, K57.53, K57.92, N32.3, Q43.83/21(14.3%) 소화기계감염 others A00.0, A00.1, A00.9, A01.0, A01.1, A01.2, A01.3, A01.4, A02.8, A03.0, A03.8, A03.9, A04.7, A08.4, A49.920/21(95.2%) 요로감염 UTI N39.0, O23.4, O23.9, O86.2, O86.3, P39.3 5/7(71.4%) 요로감염 Cystitis N30, N30.0, N30.1, N30.2, N30.3, N30.4, N30.8, N30.94/8(50%) 요로감염 Pyelonephritis N10, N11.1, N11.9, N15.9 6/6(100%) 요로감염 Renal abscess N13.6, N15.1 2/2(100%) 요로감염 ProstatitisN41, N41.0, N41.00, N41.01, N41.1, N41.10, N41.11, N41.2, N41.3, N41.8, N41.80, N41.88, N41.98/13(61.5%) 요로감염 Urethritis N34.0, N34.1, N34.2 3/3(100%) 요로감염 Orchitis N45.01, N45.91 2/2(100%) 요로감염 Epididymo N45.00, N45.90 2/2(100%) 요로감염 Vaginitis N76.0, N76.1, N76.2, N76.3, N76.4, N76.5, N76.85/7(71.4%) 요로감염Pelvic inflammatoryN73.0, N73.1, N73.8, N73.9, N74.8, O08.0 4/6(66.7%) 요로감염 Catheter related infectionsT83.5 1/1 (100%) 호중구감소성감염Neutropenia D70 2/2 (100%) 골관절감염 OsteomyelitisM46.20, M46.21, M46.22, M46.23, M46.24, M46.25, M46.26, M46.27, M46.28, M46.29, M86.00, M86.01, M86.02, M86.03, M86.04, M86.05, M86.06, M86.07, M86.08, M86.09, M86.10, M86.11, M86.12, M86.13, M86.14, M86.15, M86.16, M86.17, M86.18, M86.19, M86.20, M86.21, M86.22, M86.23, M86.24, M86.25, M86.26, M86.27, M86.28, M86.29, M86.30, M86.31, M86.32, M86.33, M86.34, M86.35, M86.36, M86.37, M86.38, M86.39, M86.40, M86.41, M86.42, M86.43, M86.44, M86.45, M86.46, M86.47, M86.48, M86.49, M86.50122/122(100%) 골관절감염Pyogenic arthritisM00.90, M00.91, M00.92, M00.93, M00.94, M00.95, M00.96, M00.97, M00.98, M00.9913/13(100%) 골관절감염 prosthetic joint infectionT84.5 1/1(100%) 골관절감염 Sacroiliitis M46.19 1/1(100%) 골관절감염 Infectious spondylitisM46.32, M46.33, M46.34, M46.36, M46.37, M46.50, M46.52, M46.54, M46.56, M46.57, M46.5911/11(100%) 호흡기계감염 URI A08.5, A38, A54.5, A69.1, B08.5, B37.88, G44.8, J00, J01.00, J01.01, J01.10, J01.11, J01.20, J01.21, J01.30, J01.31, J01.40, J01.41, J01.80, J01.81, J01.90, J01.91, J02.0, J02.8, J02.9, J03.00, J03.01, J03.8, J03.80, J03.81, J03.90, J03.91, J06.0, J06.8, J10.1, J11.1, J31.1, J31.2, J32.0, J32.1, J32.2, J32.3, J32.4, J32.8, J32.9,10/71(13.5%) 호흡기계감염 Pyothorax A16.5, A16.51, J86.0, J86.0, J86.9, J86.9, J86.9, J86.9, J86.99/9(100%)호흡기계감염 Pneumonia A06.5, A22.1, A37.9, A40.3, A41.58, A48.1, A48.2, A49.1, A49.2, B01.2, B05.2, B20.6, B37.1, B44.1, B48.5, B59, B95.3, B96.0, B96.1, J09, J10.0, J11.0, J12.0, J12.1, J12.2, J12.3, J12.8, J12.80, J12.88, J12.9, J13, J14, J15.0, J15.1, J15.2, J15.3, J15.4, J15.5, J15.6, J15.7, J15.8, J15.9, J16.0, J16.8, J17.0, J17.1, J17.2, J17.3, J17.8, J18.0, J18.1, J18.2, J18.8, J18.9, J20.0, J67.9, J69.0, J70.9, J82, J82.8, J84.1, J84.10, J84.18, J84.8, J84.9, J85.0, J85.1, J95.8, J98.48, J99.1, P23.0, P23.1, P23.2, P23.3, P23.4, P23.5, P23.6, P23.8, P23.976/136(55.9%) 호흡기계감염 Pleuritis J90, R09.1 3/3(100%) 호흡기계감염 Pertussis A37.0, A37.1, A37.8, A37.9 4/4(100%) 호흡기계감염 Lung abscess J85.2 9/9(100%) 기타감염 Inflammatory reaction due to other internal prosthetic devices, implants and graftsT85.7 10/13(76.9%) 기타감염 Leprosy A30.0, A30.1, A30.2, A30.3, A30.4, A30.5, A30.8, A30.9, B920/17(0%) 기타감염 Listeriosis A32.0, A32.1, A32.7, A32.8, A32.9 4/5(80%) 기타감염 Amebic infectionA06.0, A06.1, A06.2, A06.3, A06.4, A06.5, A06.6, A06.7, A06.8, A06.921/21(100%) 기타감염 Rickettsia A68.1, A69.2, A75.0, A75.1, A75.2, A75.3, A75.9, A77.0, A77.1, A77.2, A77.3, A77.8, A77.9, A78, A79.0, A79.1, A79.8, A79.9, A84.1, A84.8, A84.9, A93.80/35(0%) 기타감염 PoliomyelitisA80.0, A80.0, A80.1, A80.1, A80.2, A80.2, A80.3, A80.3, A80.4, A80.4, A80.90/11(0%) 기타감염Parasitic infectionA81.0, A81.1, A81.2, A81.8, A81.9, B58.0, B58.1, B58.2, B58.3, B58.8, B58.9, B60.0, B60.1, B60.2, B65.0, B65.1, B65.2, B65.3, B65.8, B65.9, B66.0, B66.1, B66.2, B66.3, B66.4, B66.5, B66.8, B66.9, B67.0, B67.1, B67.2, B67.3, B67.4, B67.5, B67.6, B67.7, B67.8, B67.9, B68.0, B68.1, B68.9, B69.0, B69.1, B69.8, B69.9, B70.0, B70.1, B71.0, B71.1, B71.8, B71.9, D77, N22.00/99(0%) 기타감염 STD A51.0, A51.1, A51.2, A51.3, A51.4, A51.5, A51.9, A52.0, A52.1, A52.2, A52.3, A52.7, A52.8, A52.9, A54.0, A54.1, A54.2, A54.3, A54.4, A54.5, A54.6, A54.8, A54.9, A55, A56.0, A56.1, A56.2, A56.3, A56.4, A56.8, A57, A58, A59.00, A59.01, A59.02, A59.08, A59.8, A59.9, A60.0, A60.00, A60.01, A60.03, A60.04, A60.08, A60.1, A60.9, A63.0, A63.8, A71.0, A71.1, A71.9, A74.0, A74.8, A74.9, N29.0, N51.0115/160(71.9%) 기타감염 Tetanus A33, A34, A35 3/3(100%) 기타감염 Zoonosis A20.0, A20.1, A20.1, A20.2, A20.3, A20.3, A20.7, A20.8, A20.9, A20.9, A21.0, A21.0, A21.1, A21.1, A21.2, A21.2, A21.3, A21.3, A21.7, A21.7, A21.8, A21.8, A21.9, A22.0, A22.0, A22.1, A22.2, A22.2, A22.7, A22.7, A22.8, A22.8, A22.9, A22.9, A23.0, A23.0, A23.1, A23.1, A23.2, A23.2, A23.3, A23.3, A23.8, A23.8, A23.9, A23.9, A24.0, A24.1, A24.1, A24.2, A24.2, A24.3, A24.3, A24.4, A25.0, A25.168/78(87.2%) 기타감염 Diphtheria A36.0, A36.1, A36.2, A36.3, A36.8, A36.9 6/6(100%)기타감염 Tuberculosis A15.0, A15.00, A15.01, A15.1, A15.10, A15.11, A15.2, A15.20, A15.21, A15.3, A15.30, A15.31, A15.4, A15.40, A15.41, A15.5, A15.50,A15.51, A15.6, A15.60, A15.61, A15.7, A15.70, A15.71, A15.8, A15.80, A15.81, A15.9, A15.90, A15.91, A16.2, A16.21, A16.3, A16.30,A16.31, A16.4, A16.40, A16.41, A16.5, A16.50, A16.51, A16.7, A16.70, A16.71, A16.8, A16.80, A16.81, A16.9, A16.90, A16.91, A17.0,A17.1, A17.8, A17.80, A17.81, A17.82, A17.88, A17.9, A19.0, A19.1, A19.2, A19.8, A19.9, B90.90/140(0%) 기타감염 others A38, A42.0, A42.1, A42.8, A42.9, A42.2, A42.7, A43.1, A43.8, A43.9, A43.0, A44.9, A44.0, A44.1, A44.8, B95.0,B95.1, B95.2, B95.3, B95.4, B95.5, B95.6, B95.7, B95.837/38(97.4%) 도 3은 본 개시의 실시예에 따른 항생제 처방 평가 방법을 나타내는 흐름도다. 도 4는 본 개시의 항생체 처방 평가 동작의 제1 실시예를 나타내는 도면이다. 도 5는 본 개시의 항생제 처방 평가 동작의 제2 실시예를 나타내 는 도면이다. 도 6은 본 개시의 항생제 처방 평가 동작의 제3 실시예를 나타내는 도면이다. 도 3을 참조하면, 항생제 처방 평가 장치는 진료 데이터를 입력받을 수 있다(S110). 구체적으로, 프로세서 는 통신부를 통해 외부 장치/서버로부터 진료 데이터를 수신하거나, 메모리에 기저장된 진료 데 이터를 로드할 수 있다. 이때, 진료 데이터는 이미 수행된 진료에 대한 데이터로, 진료 번호, 환자 번호, 질병 명 및 진료 내용 중 적어도 하나를 포함할 수 있다. 또한, 상기 진료 내용은 실시예에 따라, 항생제 사용 내역 을 포함할 수 있다. 그리고 항생제 처방 평가 장치는 진료 데이터로부터 질병명 또는 ICD 코드를 추출할 수 있다(S120). 그리 고 항생제 처방 평가 장치는 진료 데이터로부터 항생제 사용 내역을 추출할 수 있다(S130). 구체적으로, 프로세서는 진료 데이터로부터 질병명 또는 ICD 코드를 추출하고, 항생제 사용 내역을 추출할 수 있다. 한 편, 도 2에서는 프로세서가 진료 데이터를 입력받고, 진료 데이터로부터 질병명 또는 ICD 코드, 및 항생제 사용 내역을 추출하는 것으로 도시하고 설명하였지만, 본 개시는 이에 한하지 않는다. 예를 들어, 프로세서 는 진료 데이터 대신 질병명 또는 ICD 코드, 및 항생제 사용 내역을 입력받는 것으로 구현될 수도 있다. 그리고 항생제 처방 평가 장치는 ICD 코드 기반 감염병 분류 데이터 및 항생제 적응증 데이터를 기초로, 추출한 질병명 또는 ICD 코드에 대응하는 항생제 적응증 정보를 확인할 수 있다(S140). 구체적으로, 프로세서 는 진료 데이터로부터 질병명을 추출한 경우, ICD 코드 기반 감염병 분류 데이터에서 추출한 질병명에 대 응하는 ICD 코드들을 확인할 수 있다. 그리고 프로세서는 항생제 적응증 데이터에서, 상기 확인한 ICD 코 드들에 대응하는 인디케이션 정보를 확인할 수 있다. 또한, 프로세서는 진료 데이터로부터 ICD 코드를 추출한 경우, 항생제 적응증 데이터에서, 상기 추출한 ICD 코드에 대응하는 인디케이션 정보를 확인할 수 있다. 그리고 항생제 처방 평가 장치는 확인한 항생제 적응증 정보와 항생제 사용 내역을 기초로 항생제 처방 평 가를 생성할 수 있다(S150). 구체적으로, 프로세서는 진료 데이터의 항생제 사용 내역이 상기 확인한 인디 케이션 정보에 부합하는지 확인할 수 있다. 만약 항생제 사용 내역이 존재하며, 인디케이션 정보가 적응증 (indicated)을 나타내는 경우, 프로세서는 항생제 처방이 적절했음을 나타내는 항생제 처방 평가를 생성할 수 있다. 또한, 항생제 사용 내역이 존재하지 않으며, 인디케이션 정보가 비적응증(not indicated)를 나타내는 경우, 프로세서는 항생제 처방이 적절했음을 나타내는 항생제 처방 평가를 생성할 수 있다. 한편, 항생제 사용 내역이 존재하나, 인디케이션 정보가 비적응증(not indicated)를 나타내는 경우, 프로세서 는 항생제 처방이 부적절했음을 나타내는 항생제 처방 평가를 생성할 수 있다. 또한, 항생제 사용 내역이 존재하지 않으나, 인디케이션 정보가 적응증(indicated)를 나타내는 경우, 프로세서는 항생제 처방이 부적 절했음을 나타내는 항생제 처방 평가를 생성할 수 있다. 또한, 항생제 사용 내역과는 별개로, 인디케이션 정보가 부분적인 적응증(partially indicated)을 나타내는 경 우, 프로세서는 보다 구체적인 검증이 필요함을 나타내는 항생제 처방 평가를 생성할 수 있다. 한편, 본 개시는 이에 한하지 않으며, 프로세서는 추출한 질병명 또는 ICD 코드에 대응하는 ICD 네임을 확인하고,확인한 ICD 네임이 적응증 여부인지를 확인하여 항생제 처방 평가를 생성하도록 구현될 수도 있다. 한편, 본 개시는 이에 한하지 않으며, 항생제 적응증 데이터가 ICD 코드별 적절한 항생제 종류에 대한 정보를 포함하도록 구현된 경우, 프로세서는 항생제 사용 내역에서 사용된 항생제를 확인하고, 항생제 적응증 데 이터에서 추출한 질병명 또는 ICD 코드에 대응하는 적절한 항생제 종류를 확인하고, 양자를 비교하여 항생제 처 방이 적절한지 판단함으로써 항생제 처방 평가를 생성할 수 있다. 즉, 프로세서는 사용된 항생제가 적절한 항생제 종류에 해당하면 항생제 처방이 적절했음을 나타내는 항생제 처방 평가를 생성할 수 있고, 사용된 항생 제가 적절한 항생제 종류에 해당하지 않으면 항생제 처방이 부적절했음을 나타내는 항생제 처방 평가를 생성할 수 있다. 그리고 항생제 처방 평가 장치는 항생제 처방 평가를 출력할 수 있다(S160). 구체적으로, 프로세서는 상기 항생제 처방 평가를 메모리에 저장하거나, 통신부를 통해 외부 장치/서버로 송신하거나, 입출력 부를 통해 표시할 수 있다. 도 4를 참조하면, 프로세서는 진료 데이터를 입력받고, 진료 데이터로부터 질병명(Phlebitis), ICD 코드 (I80.9), 항생제 사용 내역(No)을 추출할 수 있다. 그리고 프로세서는 병합 데이터(MD)로부터 질병명 (Phlebitis) 및 ICD 코드(I80.9)의 인디케이션 정보가 비적응증(not indicated)임을 확인할 수 있다. 그리고 프로세서는 인디케이션 정보(not indicated)가 항생제 사용 내역(No)에 부합함을 확인하고, 항생제 처방이 적정함을 나타내는 항생제 처방 평가를 생성할 수 있다. 도 5를 참조하면, 프로세서는 진료 데이터를 입력받고, 진료 데이터로부터 질병명(Endocarditis), ICD 코 드(I38), 항생제 사용 내역(No)을 추출할 수 있다. 그리고 프로세서는 병합 데이터(MD)로부터 질병명 (Endocarditis) 및 ICD 코드(I38)의 인디케이션 정보가 적응증(indicated)임을 확인할 수 있다. 그리고 프로세 서는 인디케이션 정보(indicated)가 항생제 사용 내역(No)에 부합하지 않음을 확인하고, 항생제 처방이 부 적정함을 나타내는 항생제 처방 평가를 생성할 수 있다. 도 6을 참조하면, 프로세서는 진료 데이터를 입력받고, 진료 데이터로부터 질병명(Pericarditis), ICD 코 드(I38), 항생제 사용 내역(No)을 추출할 수 있다. 그리고 프로세서는 병합 데이터(MD)로부터 질병명 (Pericarditis) 및 ICD 코드(I30.0)의 인디케이션 정보가 부분적인 적응증(partially indicated)임을 확인할 수 있다. 그리고 프로세서는 항생제 처방에 대한 추가 검토가 필요함을 나타내는 항생제 처방 평가를 생성 할 수 있다. 도 7은 본 개시의 실시예에 따른 항생제 적응증 정보 제공 방법을 나타내는 흐름도이다. 도 8은 본 개시의 항생 제 적응증 정보 제공 동작의 제1 실시예를 나타내는 도면이다. 도 9는 본 개시의 항생제 적응증 정보 제공 동작 의 제2 실시예를 나타내는 도면이다. 도 7을 참조하면, 항생제 처방 평가 장치는 질병명 및/또는 ICD 코드를 입력받을 수 있다(S210). 구체적으 로, 프로세서는 통신부를 통해 외부 장치/서버로부터 질병명 및/또는 ICD 코드를 수신하거나, 메모리 에 기저장된 질병명 및/또는 ICD 코드를 로드하거나, 입출력부를 통해 사용자로부터 질병명 및/또는 ICD 코드를 입력받을 수 있다. 그리고 항생제 처방 평가 장치는 ICD 코드 기반 감염병 분류 데이터에서 입력된 질병명 및/또는 ICD 코드 에 대응하는 항생제 적응증 정보를 확인할 수 있다(S220). 일 실시예에서, 질병명이 입력된 경우, 프로세서 는 ICD 코드 기반 감염병 분류 데이터에서, 입력된 질병명에 대응하는 ICD 코드들을 확인할 수 있다. 그리 고 프로세서는 항생제 적응증 데이터에서, 상기 확인한 ICD 코드들에 대응하는 항생제 적응증 정보를 확인 할 수 있다. 여기서 항생제 적응증 정보는 인디케이션 정보 및 세부 인디케이션 정보 중 적어도 하나를 포함할 수 있다. 일 실시예에서, ICD 코드가 입력된 경우, 프로세서는 항생제 적응증 데이터에서, 상기 입력된 ICD 코드에 대응하는 항생제 적응증 정보를 확인할 수 있다. 한편, 도 2에서와 같이, ICD 코드 기반 감염병 분류 데이터 (CD)와 항생제 적응증 데이터(ID)가 병합된 병합 데이터(MD)로 구현된 경우, 프로세서는 병합 데이터(MD) 에서 입력된 ICD 코드를 확인하고, 확인한 ICD 코드에 대응하는 항생제 적응증 정보를 확인할 수 있다. 그리고 항생제 처방 평가 장치는 확인한 항생제 적응증 정보를 출력할 수 있다(S230). 구체적으로, 프로세 서는 확인한 항생제 적응증 정보를 메모리에 저장하거나, 통신부를 통해 외부 장치/서버로 송신 하거나, 입출력부를 통해 표시할 수 있다. 도 8을 참조하면, 프로세서는 질병명(Phlebitis) 또는 ICD 코드(I80.9)를 입력받을 수 있다. 그리고 프로 세서는 병합 데이터(MD)로부터 질병명(Phlebitis) 및 ICD 코드(I80.9)의 인디케이션 정보가 비적응증(not indicated)임을 확인할 수 있다. 그리고 프로세서는 질병명(Phlebitis) 또는 ICD 코드(I80.9)에 대한 항 생제 적응증 정보로서 인디케이션 정보(not indicated)를 출력할 수 있다. 도 9를 참조하면, 프로세서는 질병명(Pericarditis) 또는 ICD 코드(I30.0)를 입력받을 수 있다. 그리고 프 로세서는 병합 데이터(MD)로부터 질병명(Pericarditis) 또는 ICD 코드(I30.0)의 인디케이션 정보가 부분적 인 적응증(partially indicated)임을 확인할 수 있다. 그리고 프로세서는 질병명(Pericarditis) 또는 ICD 코드(I30.0)에 대한 항생제 적응증 정보로서 인디케이션 정보(partially indicated)를 출력할 수 있다. 또한, 실시예에 따라, 프로세서는 질병명(Pericarditis) 또는 ICD 코드(I30.0)에 대한 추가적인 항생제 적응증 정보로서 인디케이션 비율(16.7%)을 출력할 수 있다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2023-0053656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2023-0053656", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시예에 따른 항생제 처방 평가 장치의 블록도를 나타내는 도면이다. 도 2는 본 개시의 실시예에 따른 ICD 코드 기반의 감염병 분류 데이터 및 대응하는 항생제 적응증 데이터를 나 타내는 도면이다. 도 3은 본 개시의 실시예에 따른 항생제 처방 평가 방법을 나타내는 흐름도다. 도 4는 본 개시의 항생체 처방 평가 동작의 제1 실시예를 나타내는 도면이다. 도 5는 본 개시의 항생제 처방 평가 동작의 제2 실시예를 나타내는 도면이다. 도 6은 본 개시의 항생제 처방 평가 동작의 제3 실시예를 나타내는 도면이다. 도 7은 본 개시의 실시예에 따른 항생제 적응증 정보 제공 방법을 나타내는 흐름도이다. 도 8은 본 개시의 항생제 적응증 정보 제공 동작의 제1 실시예를 나타내는 도면이다. 도 9는 본 개시의 항생제 적응증 정보 제공 동작의 제2 실시예를 나타내는 도면이다."}
