{"patent_id": "10-2022-0048337", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0149385", "출원번호": "10-2022-0048337", "발명의 명칭": "영상정보를 이용한 외부환경정보 추정시스템 및 방법", "출원인": "한국해양과학기술원", "발명자": "윤근항"}}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "항 내지 청구항 8항 중 어느 한 항에 기재된 영상정보를 이용한 외부환경정보 추정시스템을 이용하여구성되는 것을 특징으로 하는 해상 모니터링방법."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 시스템은, 상기 시스템에서 수행되는 각각의 처리과정 및 처리결과를 출력하는 처리가 수행되도록 이루어지는 출력부; 유선 또는 무선통신 중 적어도 하나의 방식으로 통신을 행하여 각각의 사용자 단말기나 서버를 포함하는 외부기기와 각종 데이터를 송수신하는 처리가 수행되도록 이루어지는 통신부; 및 상기 시스템의 전체적인 동작을 제어하는 처리가 수행되도록 이루어지는 제어부를 더 포함하여 구성되는 것을특징으로 하는 영상정보를 이용한 외부환경정보 추정시스템."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 데이터수집부는, 상기 측정대상 지역에 대하여 각각의 측정지점에서 측정된 시간별 풍향, 풍속, 파고, 파향을 포함하는 외부환경정보 데이터와, 상기 측정대상 지역에 대하여 시간별 파도 형상 및 파랑 패턴을 확인 가능한 영상정보, 카메라와 수면 사이의 위치정보, 화각 및 PTZ(Pan, Tilt, Zoom) 정보를 포함하는 영상데이터 및 외부환경 변화에 따른선박의 선회궤적 변화를 실험을 통해 측정한 시험데이터를 포함하는 선박궤적 데이터를 각각 수집하고, 각각의 상기 외부환경정보 데이터와 상기 영상데이터 및 상기 선박궤적 데이터를 연관지어 데이터베이스 형태로저장하는 것에 의해 상기 측정대상 지역의 외부환경정보와 영상정보 및 선박궤적 정보에 관련된 데이터베이스를구축하는 처리가 수행되도록 구성되는 것을 특징으로 하는 영상정보를 이용한 외부환경정보 추정시스템. 공개특허 10-2023-0149385-3-청구항 4 제 3항에 있어서, 상기 인공지능(AI) 처리부는, 상기 데이터수집부를 통해 상기 데이터베이스에 저장된 데이터의 내용에 근거하여, 머신러닝(Machine Laerning)또는 딥러닝(Deep Learning) 기반의 인공지능(AI) 학습 알고리즘을 이용하여 상기 측정대상 지역의 상기 외부환경정보 데이터와 상기 영상데이터 및 상기 선박궤적 데이터 사이의 상관관계를 분석하고 학습하는 것에 의해,상기 영상정보 취득부를 통해 입력되는 영상으로부터 실시간으로 상기 외부환경정보 및 선박궤적 변화를 각각추정하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 수행되도록 구성되는 것을 특징으로 하는 영상정보를이용한 외부환경정보 추정시스템."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서, 상기 인공지능(AI) 처리부는, 상기 측정대상 지역에 대한 외부환경정보와 영상정보 및 선박궤적 정보의 상관관계에 대하여 미리 학습된 인공지능 분석모델을 포함하여 구성되는 것을 특징으로 하는 영상정보를 이용한 외부환경정보 추정시스템."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서, 상기 영상정보 취득부는, 카메라 또는 CCTV를 포함하는 상기 측정대상 지역의 영상을 촬영하기 위한 촬영수단을 포함하여 구성되고, 상기 촬영수단을 통해 촬영된 상기 영상데이터에는 카메라와 수면 사이의 위치정보, 화각 및 PTZ 정보가 함께포함되도록 구성됨으로써, 상기 PTZ 정보를 통해 상기 측정대상 지역의 전체 또는 일부 구역을 선택하여 상기 외부환경정보 및 상기 선회궤적을 각각 추정할 수 있도록 구성되는 것을 특징으로 하는 영상정보를 이용한 외부환경정보 추정시스템."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 2항에 있어서, 상기 출력부는, 상기 데이터수집부, 상기 인공지능(AI) 처리부, 상기 영상정보 취득부, 상기 외부환경정보 추정부 및 상기 선회궤적 추정부의 각각의 동작, 상태, 처리과정 및 처리결과를 포함하는 각종 정보를 모니터나 디스플레이를 포함하는 표시수단을 통해 시각적으로 표시하는 동시에, 스피커를 포함하는 음성출력수단을 통해 경고음이나 음성메시지를 출력하는 처리가 수행되도록 구성되는 것을 특징으로 하는 영상정보를 이용한 외부환경정보 추정시스템."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 2항에 있어서, 상기 제어부는, 상기 외부환경정보 추정부 및 상기 선회궤적 추정부를 통해 추정된 추정값이 미리 정해진 기준이나 조건을 만족하는 경우, 미리 정해진 설정에 따라 상기 출력부를 통하여 해당 내용을 표시하고 경보나 알림음을 출력하도록제어하는 동시에, 상기 통신부를 통하여 담당부서나 관리자를 포함하는 미리 정해진 연락처에 해당 사실을 전달공개특허 10-2023-0149385-4-하도록 제어하는 처리가 수행되도록 구성되는 것을 특징으로 하는 영상정보를 이용한 외부환경정보 추정시스템."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1항 내지 청구항 8항 중 어느 한 항에 기재된 영상정보를 이용한 외부환경정보 추정시스템을 이용한 외부환경정보 추정방법에 있어서, 측정대상 지역의 외부환경정보와 영상정보 및 외부환경 변화에 따른 선박의 선회궤적 정보를 포함하는 각종 데이터를 수집하여 데이터베이스를 구축하는 처리가 상기 외부환경정보 추정시스템의 데이터수집부를 통해 수행되는 데이터 수집단계; 상기 데이터베이스에 저장된 데이터를 학습하여 외부환경정보 및 선박 선회궤적을 각각 추정하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 상기 외부환경정보 추정시스템의 인공지능(AI) 처리부를 통해 수행되는 인공지능(AI) 분석모델 구축단계; 상기 인공지능(AI) 분석모델을 이용하여, 상기 외부환경정보 추정시스템의 영상정보 취득부를 통해 입력되는 영상으로부터 상기 외부환경정보를 실시간으로 추정하는 처리가 상기 외부환경정보 추정시스템의 외부환경정보 추정부를 통해 수행되는 외부환경정보 추정단계; 상기 인공지능(AI) 분석모델을 이용하여, 상기 영상정보 취득부를 통해 입력되는 영상으로부터 외부환경에 따른선박의 선회궤적을 실시간으로 추정하는 처리가 상기 외부환경정보 추정시스템의 선회궤적 추정부를 통해 수행되는 선회궤적 추정단계를 포함하여 구성되는 것을 특징으로 하는 외부환경정보 추정방법."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서, 상기 방법은, 상기 추정시스템의 통신부를 통하여 유선 또는 무선통신 중 적어도 하나의 방식으로 각각의 사용자 단말기나 서버를 포함하는 외부 기기와 각종 데이터를 송수신하는 처리가 수행되는 데이터 송수신단계; 상기 추정시스템의 영상정보 취득부로부터 입력되는 영상으로부터 추정된 각각의 추정값이 미리 정해진 조건을만족하는 경우 상기 출력부를 통해 해당 내용을 출력하는 동시에, 상기 통신부를 통해 미리 정해진 연락처에 해당 사실을 전달하는 처리가 상기 추정시스템의 제어부를 통해 수행되는 모니터링단계; 및 상기 데이터 수집단계, 상기 인공지능(AI) 분석모델 구축단계, 상기 외부환경정보 추정단계 및 상기 선회궤적추정단계, 상기 데이터 송수신단계 및 상기 모니터링단계의 각각의 처리과정 및 처리결과를 상기 추정시스템의출력부를 통해 출력하는 처리가 수행되는 출력단계를 더 포함하여 구성되는 것을 특징으로 하는 외부환경정보추정방법."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "해상 모니터링 시스템에 있어서, 각각의 선박이나 지역마다 설치되고 미리 정해진 설정에 따라 해수면의 상태에 따른 외부환경정보를 주기적으로추정하여 모니터링하는 처리가 수행되도록 이루어지는 다수의 외부환경정보 모니터링 시스템; 각각의 상기 외부환경정보 모니터링 시스템으로부터 주기적으로 모니터링 데이터를 수신하고 미리 설정된 조건에 따라 알림을 보내는 동시에, 해수면 상태에 따른 외부환경정보의 변화에 대한 빅데이터를 구축하고 사용자의요청에 따라 해당하는 각종 정보를 맞춤형으로 제공하는 처리가 수행되도록 이루어지는 관제서버; 및 각각의 사용자가 해수면의 상태 및 해수면의 상태에 따른 외부환경정보를 확인하고 원하는 정보를 요청하여 제공받기 위해 각각의 상기 외부환경정보 모니터링 시스템 및 상기 관제서버와 통신하여 각종 데이터를 송수신하는 처리가 수행되도록 이루어지는 사용자 단말기를 포함하여 구성되고, 공개특허 10-2023-0149385-5-상기 외부환경정보 모니터링 시스템은,"}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서, 상기 사용자 단말기는, PC를 포함하는 정보처리장치에 전용의 프로그램을 설치하여 구성되거나, 또는, 스마트폰이나 태블릿 PC 또는 노트북을 포함하는 개인이 휴대가능한 정보통신 단말기에 전용의 어플리케이션 프로그램을 설치하여 구성되는 것을 특징으로 하는 해상 모니터링 시스템."}
{"patent_id": "10-2022-0048337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "해상 모니터링 방법에 있어서, 해수면의 상태에 따른 외부환경정보를 추정하고 모니터링하기 위한 외부환경정보 모니터링 시스템을 각각의 선박이나 지역마다 각각 설치하는 처리가 수행되는 시스템 설치단계; 및 상기 시스템 설치단계에서 설치된 각각의 외부환경정보 모니터링 시스템으로부터 전송되는 모니터링 정보를 포함하는 각종 데이터를 중앙의 관제서버에서 수신하여 해수면의 상태에 따른 외부환경정보의 변화를 모니터링하고, 미리 설정된 조건을 만족하거나 미리 정해진 기준에 따라 이상이 발생한 것으로 판단되면 해당 사실에 대한알림을 전달하는 처리가 수행되는 모니터링단계를 포함하여 구성되고, 상기 외부환경정보 모니터링 시스템은,"}
{"patent_id": "10-2022-0048337", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 외부환경정보를 측정하기 위한 장치 및 방법에 관한 것으로, 본 발명에 따르면, 다양한 계측장비를 각 각 따로 설치해야 하는 번거로움 및 비용증가의 문제가 있는 데 더하여, 비교적 넓은 지역에 대하여 평균적인 측 정값을 얻기 위해 대량의 측정장비를 설치하기에는 현실적으로 어려운 한계가 있었던 종래기술의 외부환경정보 (뒷면에 계속)"}
{"patent_id": "10-2022-0048337", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 선박이나 해상에서 바람이나 파도의 방향 및 강도 등과 같은 외부환경정보를 측정하기 위한 장치 및 방법에 관한 것으로, 더 상세하게는, 종래, 풍향이나 풍속 또는 파고 및 파향 등의 외부환경정보를 측정하기 위 하여는 풍향계, 풍속계, 파고계 등과 같은 다양한 계측장비를 각각 따로 설치하고 각각의 측정장비로부터 측정 되는 측정값들을 지속적으로 모니터링하여야 하는 번거로움이 있는 데 더하여, 경우에 따라 그러한 각각의 장비 들을 원하는 측정위치에 설치하기 위해 별도의 부품이나 추가적인 장비가 필요함으로 인해 그만큼 비용이 증가 하게 되는 문제가 있었던 종래기술의 외부환경정보 측정장치 및 방법들의 문제점을 해결하기 위해, 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간 단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법에 관한 것이다. 또한, 본 발명은, 상기한 바와 같이 외부환경정보를 측정하기 위해 각각의 측정장비를 따로 설치하고 측정값을 모니터링 해야 함으로 인해 설치의 번거로움 및 비용증가의 문제가 있는 데 더하여, 각각의 측정장비가 설치된 지점에 대하여는 비교적 정확한 측정값을 얻을 수 있으나, 예를 들면, 선박의 운항시험을 위해 시험지역의 상태 를 파악하여 시험 가능 여부를 결정해야 하는 경우 등과 같이, 비교적 넓은 지역에 대하여 평균적인 측정값을 얻기 위해 대량의 측정장비를 설치하기에는 현실적으로 어려운 한계가 있었던 종래기술의 외부환경정보 측정장치 및 방법들의 문제점을 해결하기 위해, 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것 에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선 박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법에 관한 것이다. 아울러, 본 발명은, 상기한 바와 같이 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 외부환 경정보를 용이하게 추정할 수 있도록 하기 위해, 바람의 세기와 방향에 따라 파도의 높이와 방향이 결정되고 이 러한 두 가지 외부환경 변화에 따라 선박의 운항특성이 변화하는 점에 착안하여, 측정대상 지역에 대하여 각종 센서를 통해 측정된 각각의 측정값과 카메라나 CCTV 등을 통해 획득된 영상정보의 상관관계에 대한 학습모델을 구축하고 머신러닝(Machine Learning) 또는 딥러닝(Deep Learning) 기반한 인공지능(AI) 학습 알고리즘을 이용 하여 학습을 수행하며, 학습결과에 근거하여 카메라나 CCTV 등을 통해 획득되는 영상정보를 분석하도록 구성됨 으로써, 풍향풍속계나 파고계 등과 같은 측정장비를 설치하지 않고도 풍향, 풍속, 파고, 파향 등의 외부환경정 보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0048337", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래, 일반적으로, 운항중인 선박이나 해상의 특정 위치에서 풍향, 풍속, 파고, 파향 등의 외부환경정보를 측정 하기 위해, 대부분의 경우 풍향계, 풍속계, 파고계 등의 측정장비를 이용하여 측정하고자 하는 물리량을 각각 직접적으로 계측하는 방법이 주로 사용되고 있다. 여기서, 상기한 바와 같이 각각의 측정장비를 이용한 측정은 비교적 정확한 정보를 얻을 수 있으나, 해상의 특 정 지점에서 외부환경정보를 측정하기 위한 측정장비의 설치가 용이하지 못할 경우나 측정장비가 구비되어 있지 않은 경우는 육안으로 관측을 통해 외부환경정보를 추측하여야 한다. 그러나 이러한 방식은 전적으로 관측자의 경험에 의존하는 것이므로 정확도를 보장할 수 없으며, 이는 특히 안 전이 중요한 선박의 운항이나 정확도가 중요한 모형시험 등의 경우에 있어서 큰 문제가 될 수 있다. 이에, 상기한 바와 같이 선박의 운항이나 모형시험 등을 수행하기 위해 해상에서 풍향, 풍속, 파고 등의 외부환 경정보를 보다 용이하고 정확하게 파악할 수 있는 기술에 대한 요구가 높아지고 있다. 즉, 상기한 바와 같이 선박이나 해상에서 풍향, 풍속, 파고 등의 외부환경정보를 측정하기 위한 장치 및 방법에 대한 종래기술의 예로는, 먼저, 예를 들면, 한국 등록특허공보 제10-2365072호에 제시된 바와 같은 \"바람 예측 자료의 보정 고도화를 통한 파랑예측 모델 정확도 향상을 위한 장치 및 방법\"이 있다. 더 상세하게는, 상기한 한국 등록특허공보 제10-2365072호는, 대상해역의 파고 및 바람 관측자료를 수집하고 DB 를 구축하는 해상부이자료 DB 구축부; 인공위성을 통해 관측한 파고 및 풍속자료를 수집하고 DB를 구축하는 인 공위성자료 DB 구축부; 대기모델의 과거 풍속 및 풍향 예측자료를 수집하여 DB를 구축하고, 오차수정률 분포지 도(Correction Map)를 생성하는 대기모델 과거예측자료 DB 구축부; 대기모델 과거예측 DB 검보정을 행하는 대기 모델 예측 실시간 검보정부; 과거예측 데이터베이스를 활용하여 파랑모델을 이용하여 예측한 파랑자료 DB를 구 축 및 오차수정률 분포지도(Correction Map)를 생성하는 파랑모델 과거예측자료 DB 구축부; 파랑모델의 구동을 위한 입력자료로서 고도화된 대기모델의 바람 예측결과가 바람입력 시나리오로 적용되도록 하여 파랑예측 실시 간 검보정을 행하는 파랑예측 실시간 검보정부; 파랑모델의 실시간 예측자료가 인공위성과 해상부이 관측자료를 기반으로 보정되도록 하여 제공하는 파랑모델 실시간 예측자료 제공부를 포함하여, 인공위성을 이용하여 측정된 자료를 기반으로 수치실험을 수행하여 파랑예측 모델 정확도를 향상시킬 수 있도록 구성되는 바람 예측자료의 보정 고도화를 통한 파랑예측 모델 정확도 향상을 위한 장치 및 방법에 관한 것이다. 또한, 상기한 바와 같이 선박이나 해상에서 풍향, 풍속, 파고 등의 외부환경정보를 측정하기 위한 장치 및 방법 에 대한 종래기술의 다른 예로는, 예를 들면, 한국 등록특허공보 제10-2062792호에 제시된 바와 같은 \"회귀 분 석 기반의 추정 알고리즘에 의하여 변형된 칼만 필터 알고리즘을 적용한 파고 데이터 연산을 사용하는 간이형 파고 측정 장치\"가 있다. 더 상세하게는, 상기한 한국 등록특허공보 제10-2062792호는, 기 설치되어 있는 등부표의 상부에 추가적으로 설 치되는 것으로 파고를 측정하고 측정된 데이터를 원거리로 송신하는 파고측정 및 통신부와, 시스템에 전원을 공 급하고 풍속과 풍향 및 풍압을 감지하는 전원/센서부를 포함하는 것으로서 가속도센서를 기반으로 해상의 파고 측정을 위한 로데이터를 얻은 후 얻어진 로데이터를 변형된 칼만필터 알고리즘에 적용함으로써 안정된 파고데이 터를 얻을 수 있는 파고측정장치에 있어서, 상기 파고측정 및 통신부는, 가속도센서와 마이크로프로세서와 메모 리와 리얼타임클록(Real Time Clock-RTC)과 통신부와 GPS를 포함하고, 상기 전원/센서부는 시스템에 전원을 공 급하는 전원부와 풍속을 감지하는 풍속계와 풍향을 감지하는 풍향계 및 풍압을 감지하는 풍압센서를 포함하며, 상기 마이크로프로세서는 가속도 센서로부터의 측정값을 적분하여 위치데이터를 추출하는 위치데이터 추출부와 위치데이터 추출부에 의해 추출된 위치데이터를 기초로 파고 데이터를 연산하는 파고데이터 연산부를 포함하여, 이동하는 선박 및/또는 기 설치되어 있는 등부표에 장착하여 별도의 부이를 설치하지 않고도 보다 정밀한 해양 정보를 관측할 수 있도록 구성되는 회귀분석 기반의 추정알고리즘에 의하여 변형된 칼만필터 알고리즘을 적용한 파고데이터 연산을 사용하는 간이형 파고측정장치에 관한 것이다. 상기한 바와 같이, 종래, 선박이나 해상에서 풍향, 풍속, 파고 등의 외부환경정보를 측정하기 위해 다양한 장치 및 방법들이 제시된 바 있으나, 상기한 바와 같은 종래기술의 내용들은 다음과 같은 한계가 있는 것이었다. 즉, 상기한 바와 같이, 종래, 일반적으로, 해상에서 풍향, 풍속, 파고, 파향 등의 외부환경정보를 측정하기 위 해서는 풍향계, 풍속계, 파고계 등과 같은 다양한 측정장비를 각각 별도로 설치하고 각각의 측정장비로부터 측 정되는 측정값들을 지속적으로 모니터링하여야 하는 번거로움이 있었다. 아울러, 상기한 바와 같은 종래기술의 측정장치 및 방법들은, 경우에 따라 그러한 각각의 장비들을 원하는 측정 위치에 설치하기 위해 별도의 부품이나 추가적인 장비가 필요하며, 그로 인해 전체적인 시간과 비용이 증가하게 되는 문제도 있었다. 더욱이, 상기한 바와 같은 종래기술의 측정장치 및 방법들은, 각각의 측정장비가 설치된 지점에 대하여는 비교 적 정확한 측정값을 얻을 수 있으나, 예를 들면, 선박의 운항시험이나 모형시험 등을 위해 시험지역의 상태를 파악하고 시험 가능 여부를 결정해야 하는 경우 등과 같이, 비교적 넓은 지역에 대하여 평균적인 측정값을 얻기 위해서는 해당 지역에 다수의 측정장비를 각각 설치하여야 하므로 그만큼 시간과 비용이 증가하여 현실적으로 적용하기 어려운 한계도 있는 것이었다. 따라서 상기한 바와 같은 종래기술의 외부환경정보 측정장치 및 방법들의 한계를 해결하기 위하여는, 예를 들면, 카메라나 CCTV 등과 같이, 영상정보를 분석하는 것에 의해 특정 지점뿐만 아니라 넓은 지역에 대하여도 별도의 측정장비를 설치할 필요 없이 비교적 간단한 구성 및 저렴한 비용으로 다양한 외부환경정보를 보다 용이 하고 정확하게 추정할 수 있도록 구성되는 새로운 구성의 영상정보를 이용한 외부환경정보 추정시스템 및 방법 을 제시하는 것이 바람직하나, 아직까지 그러한 요구를 모두 만족시키는 장치나 방법은 제시되지 못하고 있는 실정이다. 선행기술문헌특허문헌 (특허문헌 0001) 한국 등록특허공보 제10-2365072호 (2022.02.18.) (특허문헌 0002) 한국 등록특허공보 제10-2062792호 (2020.01.06.)"}
{"patent_id": "10-2022-0048337", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 바와 같은 종래기술의 문제점을 해결하고자 하는 것으로, 따라서 본 발명의 목적은, 풍향이나 풍속 또는 파고 및 파향 등의 외부환경정보를 측정하기 위하여는 풍향계, 풍속계, 파고계 등과 같은 다양한 계 측장비를 각각 따로 설치하고 각각의 측정장비로부터 측정되는 측정값들을 지속적으로 모니터링하여야 하는 번 거로움이 있는 데 더하여, 경우에 따라 그러한 각각의 장비들을 원하는 측정위치에 설치하기 위해 별도의 부품 이나 추가적인 장비가 필요함으로 인해 그만큼 비용이 증가하게 되는 문제가 있었던 종래기술의 외부환경정보 측정장치 및 방법들의 문제점을 해결하기 위해, 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하 는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파 고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스 템 및 방법을 제시하고자 하는 것이다. 또한, 본 발명의 다른 목적은, 상기한 바와 같이 외부환경정보를 측정하기 위해 각각의 측정장비를 따로 설치하 고 측정값을 모니터링 해야 함으로 인해 설치의 번거로움 및 비용증가의 문제가 있는 데 더하여, 각각의 측정장 비가 설치된 지점에 대하여는 비교적 정확한 측정값을 얻을 수 있으나, 예를 들면, 선박의 운항시험을 위해 시 험지역의 상태를 파악하여 시험 가능 여부를 결정해야 하는 경우 등과 같이, 비교적 넓은 지역에 대하여 평균적 인 측정값을 얻기 위해 대량의 측정장비를 설치하기에는 현실적으로 어려운 한계가 있었던 종래기술의 외부환경 정보 측정장치 및 방법들의 문제점을 해결하기 위해, 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파 향, 파고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추 정시스템 및 방법을 제시하고자 하는 것이다. 아울러, 본 발명의 또 다른 목적은, 상기한 바와 같이 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치 하지 않고 외부환경정보를 용이하게 추정할 수 있도록 하기 위해, 바람의 세기와 방향에 따라 파도의 높이와 방 향이 결정되고 이러한 두 가지 외부환경 변화에 따라 선박의 운항특성이 변화하는 점에 착안하여, 측정대상 지 역에 대하여 각종 센서를 통해 측정된 각각의 측정값과 카메라나 CCTV 등을 통해 획득된 영상정보의 상관관계에 대한 학습모델을 구축하고 머신러닝(Machine Learning) 또는 딥러닝(Deep Learning) 기반한 인공지능(AI) 학습 알고리즘을 이용하여 학습을 수행하며, 학습결과에 근거하여 카메라나 CCTV 등을 통해 획득되는 영상정보를 분 석하도록 구성됨으로써, 풍향풍속계나 파고계 등과 같은 측정장비를 설치하지 않고도 풍향, 풍속, 파고, 파향 등의 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법을 제시하 고자 하는 것이다."}
{"patent_id": "10-2022-0048337", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위해, 본 발명에 따르면, 영상정보를 이용한 외부환경정보 추정시스템에 있 어서, 측정대상 지역의 외부환경정보와 영상정보 및 상기 외부환경정보에 따른 선박궤적 정보를 포함하는 각종 데이터를 수집하여 데이터베이스를 구축하는 처리가 수행되도록 이루어지는 데이터수집부; 상기 데이터베이스에 저장된 데이터에 대한 학습을 수행하고 학습결과에 근거하여 상기 외부환경정보 및 선박궤적 정보를 각각 추정 하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 수행되도록 이루어지는 인공지능(AI) 처리부; 상기 측정대 상 지역의 영상을 촬영하기 위한 촬영수단을 포함하여 이루어지는 영상정보 취득부; 상기 인공지능(AI) 처리부 를 통해 구축된 상기 인공지능(AI) 분석모델을 이용하여, 상기 영상정보 취득부를 통해 입력되는 영상으로부터상기 외부환경정보를 실시간으로 추정하는 처리가 수행되도록 이루어지는 외부환경정보 추정부; 및 상기 인공지 능(AI) 처리부를 통해 구축된 상기 인공지능(AI) 분석모델을 이용하여, 상기 영상정보 취득부를 통해 입력되는 영상으로부터 선박의 선회궤적 정보를 추정하는 처리가 수행되도록 이루어지는 선회궤적 추정부를 포함하여 구 성되는 것을 특징으로 하는 영상정보를 이용한 외부환경정보 추정시스템이 제공된다. 여기서, 상기 시스템은, 상기 시스템에서 수행되는 각각의 처리과정 및 처리결과를 출력하는 처리가 수행되도록 이루어지는 출력부; 유선 또는 무선통신 중 적어도 하나의 방식으로 통신을 행하여 각각의 사용자 단말기나 서 버를 포함하는 외부 기기와 각종 데이터를 송수신하는 처리가 수행되도록 이루어지는 통신부; 및 상기 시스템의 전체적인 동작을 제어하는 처리가 수행되도록 이루어지는 제어부를 더 포함하여 구성되는 것을 특징으로 한다. 또한, 상기 데이터수집부는, 상기 측정대상 지역에 대하여 각각의 측정지점에서 측정된 시간별 풍향, 풍속, 파 고, 파향을 포함하는 외부환경정보 데이터와, 상기 측정대상 지역에 대하여 시간별 파도 형상 및 파랑 패턴을 확인 가능한 영상정보, 카메라와 수면 사이의 위치정보, 화각 및 PTZ(Pan, Tilt, Zoom) 정보를 포함하는 영상데 이터 및 외부환경 변화에 따른 선박의 선회궤적 변화를 실험을 통해 측정한 시험데이터를 포함하는 선박궤적 데 이터를 각각 수집하고, 각각의 상기 외부환경정보 데이터와 상기 영상데이터 및 상기 선박궤적 데이터를 연관지 어 데이터베이스 형태로 저장하는 것에 의해 상기 측정대상 지역의 외부환경정보와 영상정보 및 선박궤적 정보 에 관련된 데이터베이스를 구축하는 처리가 수행되도록 구성되는 것을 특징으로 한다. 아울러, 상기 인공지능(AI) 처리부는, 상기 데이터수집부를 통해 상기 데이터베이스에 저장된 데이터의 내용에 근거하여, 머신러닝(Machine Laerning) 또는 딥러닝(Deep Learning) 기반의 인공지능(AI) 학습 알고리즘을 이 용하여 상기 측정대상 지역의 상기 외부환경정보 데이터와 상기 영상데이터 및 상기 선박궤적 데이터 사이의 상 관관계를 분석하고 학습하는 것에 의해, 상기 영상정보 취득부를 통해 입력되는 영상으로부터 실시간으로 상기 외부환경정보 및 선박궤적 변화를 각각 추정하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 수행되도록 구 성되는 것을 특징으로 한다. 또는, 상기 인공지능(AI) 처리부는, 상기 측정대상 지역에 대한 외부환경정보와 영상정보 및 선박궤적 정보의 상관관계에 대하여 미리 학습된 인공지능 분석모델을 포함하여 구성되는 것을 특징으로 한다. 더욱이, 상기 영상정보 취득부는, 카메라 또는 CCTV를 포함하는 상기 측정대상 지역의 영상을 촬영하기 위한 촬 영수단을 포함하여 구성되고, 상기 촬영수단을 통해 촬영된 상기 영상데이터에는 카메라와 수면 사이의 위치정 보, 화각 및 PTZ 정보가 함께 포함되도록 구성됨으로써, 상기 PTZ 정보를 통해 상기 측정대상 지역의 전체 또는 일부 구역을 선택하여 상기 외부환경정보 및 상기 선회궤적을 각각 추정할 수 있도록 구성되는 것을 특징으로 한다. 또한, 상기 출력부는, 상기 데이터수집부, 상기 인공지능(AI) 처리부, 상기 영상정보 취득부, 상기 외부환경정 보 추정부 및 상기 선회궤적 추정부의 각각의 동작, 상태, 처리과정 및 처리결과를 포함하는 각종 정보를 모니 터나 디스플레이를 포함하는 표시수단을 통해 시각적으로 표시하는 동시에, 스피커를 포함하는 음성출력수단을 통해 경고음이나 음성메시지를 출력하는 처리가 수행되도록 구성되는 것을 특징으로 한다. 아울러, 상기 제어부는, 상기 외부환경정보 추정부 및 상기 선회궤적 추정부를 통해 추정된 추정값이 미리 정해 진 기준이나 조건을 만족하는 경우, 미리 정해진 설정에 따라 상기 출력부를 통하여 해당 내용을 표시하고 경보 나 알림음을 출력하도록 제어하는 동시에, 상기 통신부를 통하여 담당부서나 관리자를 포함하는 미리 정해진 연 락처에 해당 사실을 전달하도록 제어하는 처리가 수행되도록 구성되는 것을 특징으로 한다. 더욱이, 본 발명에 따르면, 상기에 기재된 영상정보를 이용한 외부환경정보 추정시스템을 이용한 외부환경정보 추정방법에 있어서, 측정대상 지역의 외부환경정보와 영상정보 및 외부환경 변화에 따른 선박의 선회궤적 정보 를 포함하는 각종 데이터를 수집하여 데이터베이스를 구축하는 처리가 상기 외부환경정보 추정시스템의 데이터 수집부를 통해 수행되는 데이터 수집단계; 상기 데이터베이스에 저장된 데이터를 학습하여 외부환경정보 및 선 박 선회궤적을 각각 추정하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 상기 외부환경정보 추정시스템의 인공지능(AI) 처리부를 통해 수행되는 인공지능(AI) 분석모델 구축단계; 상기 인공지능(AI) 분석모델을 이용하 여, 상기 외부환경정보 추정시스템의 영상정보 취득부를 통해 입력되는 영상으로부터 상기 외부환경정보를 실시 간으로 추정하는 처리가 상기 외부환경정보 추정시스템의 외부환경정보 추정부를 통해 수행되는 외부환경정보 추정단계; 및 상기 인공지능(AI) 분석모델을 이용하여, 상기 영상정보 취득부를 통해 입력되는 영상으로부터 외 부환경에 따른 선박의 선회궤적을 실시간으로 추정하는 처리가 상기 외부환경정보 추정시스템의 선회궤적 추정 부를 통해 수행되는 선회궤적 추정단계를 포함하여 구성되는 것을 특징으로 하는 외부환경정보 추정방법이 제공 된다. 여기서, 상기 방법은, 상기 추정시스템의 통신부를 통하여 유선 또는 무선통신 중 적어도 하나의 방식으로 각각 의 사용자 단말기나 서버를 포함하는 외부 기기와 각종 데이터를 송수신하는 처리가 수행되는 데이터 송수신단 계; 상기 추정시스템의 영상정보 취득부로부터 입력되는 영상으로부터 추정된 각각의 추정값이 미리 정해진 조 건을 만족하는 경우 상기 출력부를 통해 해당 내용을 출력하는 동시에, 상기 통신부를 통해 미리 정해진 연락처 에 해당 사실을 전달하는 처리가 상기 추정시스템의 제어부를 통해 수행되는 모니터링단계; 및 상기 데이터 수 집단계, 상기 인공지능(AI) 분석모델 구축단계, 상기 외부환경정보 추정단계 및 상기 선회궤적 추정단계, 상기 데이터 송수신단계 및 상기 모니터링단계의 각각의 처리과정 및 처리결과를 상기 추정시스템의 출력부를 통해 출력하는 처리가 수행되는 출력단계를 더 포함하여 구성되는 것을 특징으로 한다. 또한, 본 발명에 따르면, 해상 모니터링 시스템에 있어서, 각각의 선박이나 지역마다 설치되고 미리 정해진 설 정에 따라 해수면의 상태에 따른 외부환경정보를 주기적으로 추정하여 모니터링하는 처리가 수행되도록 이루어 지는 다수의 외부환경정보 모니터링 시스템; 각각의 상기 외부환경정보 모니터링 시스템으로부터 주기적으로 모 니터링 데이터를 수신하고 미리 설정된 조건에 따라 알림을 보내는 동시에, 해수면 상태에 따른 외부환경정보의 변화에 대한 빅데이터를 구축하고 사용자의 요청에 따라 해당하는 각종 정보를 맞춤형으로 제공하는 처리가 수 행되도록 이루어지는 관제서버; 및 각각의 사용자가 해수면의 상태 및 해수면의 상태에 따른 외부환경정보를 확 인하고 원하는 정보를 요청하여 제공받기 위해 각각의 상기 외부환경정보 모니터링 시스템 및 상기 관제서버와 통신하여 각종 데이터를 송수신하는 처리가 수행되도록 이루어지는 사용자 단말기를 포함하여 구성되고, 상기 외부환경정보 모니터링 시스템은, 상기에 기재된 영상정보를 이용한 외부환경정보 추정시스템을 이용하여, 해당 위치에서 얻어지는 각종 데이터를 상기 관제서버로 전송하는 처리가 수행되도록 구성되는 것을 특징으로 하는 해상 모니터링 시스템이 제공된다. 여기서, 상기 사용자 단말기는, PC를 포함하는 정보처리장치에 전용의 프로그램을 설치하여 구성되거나, 또는, 스마트폰이나 태블릿 PC 또는 노트북을 포함하는 개인이 휴대가능한 정보통신 단말기에 전용의 어플리케이션 프 로그램을 설치하여 구성되는 것을 특징으로 한다. 아울러, 본 발명에 따르면, 해상 모니터링 방법에 있어서, 해수면의 상태에 따른 외부환경정보를 추정하고 모니 터링하기 위한 외부환경정보 모니터링 시스템을 각각의 선박이나 지역마다 각각 설치하는 처리가 수행되는 시스 템 설치단계; 및 상기 시스템 설치단계에서 설치된 각각의 외부환경정보 모니터링 시스템으로부터 전송되는 모 니터링 정보를 포함하는 각종 데이터를 중앙의 관제서버에서 수신하여 해수면의 상태에 따른 외부환경정보의 변 화를 모니터링하고, 미리 설정된 조건을 만족하거나 미리 정해진 기준에 따라 이상이 발생한 것으로 판단되면 해당 사실에 대한 알림을 전달하는 처리가 수행되는 모니터링단계를 포함하여 구성되고, 상기 외부환경정보 모 니터링 시스템은, 상기에 기재된 영상정보를 이용한 외부환경정보 추정시스템을 이용하여 구성되는 것을 특징으 로 하는 해상 모니터링방법이 제공된다."}
{"patent_id": "10-2022-0048337", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같이, 본 발명에 따르면, 바람의 세기와 방향에 따라 파도의 높이와 방향이 결정되고 이러한 두 가 지 외부환경 변화에 따라 선박의 운항특성이 변화하는 점에 착안하여, 측정대상 지역에 대하여 각종 센서를 통 해 측정된 각각의 측정값과 카메라나 CCTV 등을 통해 획득된 영상정보의 상관관계에 대한 학습모델을 구축하고, 머신러닝(Machine Learning) 또는 딥러닝(Deep Learning) 기반한 인공지능(AI) 학습 알고리즘을 이용하여 학습 을 수행하며, 학습결과에 근거하여 카메라나 CCTV 등을 통해 획득되는 영상정보를 분석하는 것에 의해 외부환경 정보를 추정하는 처리가 수행되도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법이 제공됨으 로써, 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부환경정보를 추 정할 수 있다. 또한, 본 발명에 따르면, 상기한 바와 같이 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법이 제공됨으로써, 풍향이나 풍속 또는 파고 및 파향 등의 외부환경정보를 측정하기 위하여는 풍향계, 풍속 계, 파고계 등과 같은 다양한 계측장비를 각각 따로 설치하고 각각의 측정장비로부터 측정되는 측정값들을 지속 적으로 모니터링하여야 하는 번거로움이 있는 데 더하여, 경우에 따라 그러한 각각의 장비들을 원하는 측정위치 에 설치하기 위해 별도의 부품이나 추가적인 장비가 필요함으로 인해 그만큼 비용이 증가하게 되는 문제가 있었 던 종래기술의 외부환경정보 측정장치 및 방법들의 문제점을 해결할 수 있다. 아울러, 본 발명에 따르면, 상기한 바와 같이 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법이 제공됨으로써, 외부환경정보를 측정하기 위해서는 각각의 측정장비를 따로 설치하고 측정값을 모니터링 해야 함으로 인해 설치의 번거로움 및 비용증가의 문제가 있는 데 더하여, 각각의 측정장비가 설치된 지점에 대 하여는 비교적 정확한 측정값을 얻을 수 있으나 비교적 넓은 지역에 대하여 평균적인 측정값을 얻기 위해 대량 의 측정장비를 설치하기에는 현실적으로 어려운 한계가 있었던 종래기술의 외부환경정보 측정장치 및 방법들의 문제점을 해결할 수 있으며, 그것에 의해, 예를 들면, 선박의 운항시험을 위해 시험지역의 상태를 파악하여 시 험 가능 여부를 결정하는 경우 등과 같이, 다양한 경우에 폭넓게 적용될 수 있다."}
{"patent_id": "10-2022-0048337", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여, 본 발명에 따른 영상정보를 이용한 외부환경정보 추정시스템 및 방법의 구체적 인 실시예에 대하여 설명한다. 여기서, 이하에 설명하는 내용은 본 발명을 실시하기 위한 하나의 실시예일 뿐이며, 본 발명은 이하에 설명하는 실시예의 내용으로만 한정되는 것은 아니라는 사실에 유념해야 한다. 또한, 이하의 본 발명의 실시예에 대한 설명에 있어서, 종래기술의 내용과 동일 또는 유사하거나 당업자의 수준 에서 용이하게 이해하고 실시할 수 있다고 판단되는 부분에 대하여는, 설명을 간략히 하기 위해 그 상세한 설명 을 생략하였음에 유념해야 한다. 즉, 본 발명은, 후술하는 바와 같이, 풍향이나 풍속 또는 파고 및 파향 등의 외부환경정보를 측정하기 위하여는 풍향계, 풍속계, 파고계 등과 같은 다양한 계측장비를 각각 따로 설치하고 각각의 측정장비로부터 측정되는 측 정값들을 지속적으로 모니터링하여야 하는 번거로움이 있는 데 더하여, 경우에 따라 그러한 각각의 장비들을 원 하는 측정위치에 설치하기 위해 별도의 부품이나 추가적인 장비가 필요함으로 인해 그만큼 비용이 증가하게 되 는 문제가 있었던 종래기술의 외부환경정보 측정장치 및 방법들의 문제점을 해결하기 위해, 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법에 관한 것이다. 아울러, 본 발명은, 후술하는 바와 같이, 외부환경정보를 측정하기 위해 각각의 측정장비를 따로 설치하고 측정 값을 모니터링 해야 함으로 인해 설치의 번거로움 및 비용증가의 문제가 있는 데 더하여, 각각의 측정장비가 설 치된 지점에 대하여는 비교적 정확한 측정값을 얻을 수 있으나, 예를 들면, 선박의 운항시험을 위해 시험지역의 상태를 파악하여 시험 가능 여부를 결정해야 하는 경우 등과 같이, 비교적 넓은 지역에 대하여 평균적인 측정값 을 얻기 위해 대량의 측정장비를 설치하기에는 현실적으로 어려운 한계가 있었던 종래기술의 외부환경정보 측정 장치 및 방법들의 문제점을 해결하기 위해, 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법에 관한 것이다. 더욱이, 본 발명은, 후술하는 바와 같이, 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 외 부환경정보를 용이하게 추정할 수 있도록 하기 위해, 바람의 세기와 방향에 따라 파도의 높이와 방향이 결정되 고 이러한 두 가지 외부환경 변화에 따라 선박의 운항특성이 변화하는 점에 착안하여, 측정대상 지역에 대하여 각종 센서를 통해 측정된 각각의 측정값과 카메라나 CCTV 등을 통해 획득된 영상정보의 상관관계에 대한 학습모 델을 구축하고 머신러닝(Machine Learning) 또는 딥러닝(Deep Learning) 기반한 인공지능(AI) 학습 알고리즘을 이용하여 학습을 수행하며, 학습결과에 근거하여 카메라나 CCTV 등을 통해 획득되는 영상정보를 분석하도록 구 성됨으로써, 풍향풍속계나 파고계 등과 같은 측정장비를 설치하지 않고도 풍향, 풍속, 파고, 파향 등의 외부환 경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법에 관한 것이다. 계속해서, 도면을 참조하여, 본 발명에 따른 영상정보를 이용한 외부환경정보 추정시스템 및 방법의 구체적인 내용에 대하여 설명한다. 더 상세하게는, 먼저, 도 1을 참조하면, 도 1은 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정 시스템의 전체적인 구성을 개략적으로 나타내는 블록도이다. 도 1에 나타낸 바와 같이, 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템은, 크게 나누어, 측정대상 지역의 외부환경정보 및 영상정보를 포함하는 각종 데이터를 수집하여 데이터베이스를 구축하 는 처리가 수행되도록 이루어지는 데이터수집부와, 데이터베이스에 저장된 데이터에 대한 학습을 수행하고 학습결과에 근거하여 외부환경정보를 추정하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 수행되도록 이루 어지는 인공지능(AI) 처리부와, 측정대상 지역의 영상을 촬영하기 위한 촬영수단을 포함하여 이루어지는 영 상정보 취득부 및 인공지능(AI) 처리부를 통해 구축된 인공지능(AI) 분석모델을 이용하여, 영상정보 취 득부를 통해 입력되는 영상으로부터 풍향, 풍속, 파고, 파향 등의 외부환경정보를 실시간으로 추정하는 처 리가 수행되도록 이루어지는 외부환경정보 추정부를 포함하여 구성될 수 있다. 더 상세하게는, 도 2를 참조하면, 도 2는 바람에 의한 파랑생성 변화를 촬영한 CCTV 영상을 나타내는 도면이다. 도 2에 나타낸 바와 같이, 상기한 데이터수집부는, 예를 들면, 풍향, 풍속, 파고, 파향 등과 같이, 측정대 상 지역의 각 지점에서 각각 측정된 시간별 측정값을 포함하는 외부환경정보 데이터와, 측정대상 지역에 대하여 시간별 파도형상 및 파랑패턴이 촬영된 영상데이터를 포함하는 각종 데이터를 수집하고, 각각의 외부환경정보 데이터와 영상데이터를 연관지어 데이터베이스 형태로 저장하는 것에 의해 측정대상 지역의 외부환경정보와 영 상정보에 대한 데이터베이스를 구축하는 처리가 수행되도록 구성될 수 있다. 또한, 도 3을 참조하면, 도 3은 풍향/풍속 및 파향/파고에 따른 선박의 선회궤적 변화를 모형시험을 통해 측정 한 결과를 나타내는 도면이다. 도 3에 나타낸 바와 같이, 상기한 데이터수집부는, 상기한 바와 같이 외부환경정보 데이터와 영상데이터를 연관지어 데이터베이스 형태로 저장하는 것에 더하여, 풍향, 풍속, 파고, 파향 등과 같은 외부환경 변화에 따른 선박의 선회궤적 변화를 실험을 통해 측정한 측정데이터를 포함하는 선박궤적 데이터를 수집하고, 각각의 외부 환경정보 데이터와 영상데이터 및 선박궤적 데이터를 연관지어 데이터베이스 형태로 저장하는 것에 의해 측정대 상 지역의 외부환경정보에 따른 및 선박궤적 변화에 대한 데이터베이스를 구축하는 처리가 수행되도록 구성될 수 있다. 즉, 상기한 시스템은, 상기한 데이터수집부가 측정대상 지역의 외부환경정보 및 영상정보에 더하여 외 부환경 변화에 따른 선박의 선회궤적 정보를 각각 수집하여 데이터베이스를 구축하는 처리가 수행되도록 구성되 고, 인공지능(AI) 처리부를 통해 구축된 인공지능(AI) 분석모델을 이용하여 영상정보 취득부를 통해 입 력되는 영상으로부터 선박의 선회궤적 변화를 추정하는 처리가 수행되도록 이루어지는 선회궤적 추정부를 더 포함하여 구성될 수 있다. 아울러, 상기한 시스템은, 도 1에 나타낸 바와 같이, 데이터수집부, 인공지능(AI) 처리부, 영상정 보 취득부, 외부환경정보 추정부 및 선회궤적 추정부에서 수행되는 각각의 처리과정 및 결과를 모 니터나 디스플레이 등과 같은 별도의 표시수단 등을 통해 출력하는 처리가 수행되도록 이루어지는 출력부와, 유선 또는 무선통신 중 적어도 하나의 방식으로 통신을 행하여 각각의 사용자 단말기나 서버 등 과 같은 외부 기기와 각종 데이터를 송수신하는 처리가 수행되도록 이루어지는 통신부 및 상기한 각 부 및 시스템의 전체적인 동작을 제어하는 처리가 수행되도록 이루어지는 제어부를 더 포함하여 구성될 수 있 다. 여기서, 상기한 인공지능(AI) 처리부는, 상기한 바와 같이 하여 데이터수집부를 통해 데이터베이스에 저장된 데이터의 내용에 근거하여, 예를 들면, 머신러닝(Machine Laerning) 또는 딥러닝(Deep Learning) 기반의인공지능(AI) 학습 알고리즘을 이용하여 측정대상 지역의 시간별 계측데이터와 영상데이터의 상관관계를 분석하 고 학습하는 것에 의해, 학습결과에 근거하여 영상정보 취득부를 통해 입력되는 영상으로부터 실시간으로 외부환경정보를 추정하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 수행되도록 구성될 수 있다. 또한, 상기한 인공지능(AI) 처리부는, 상기한 바와 같이 하여 데이터수집부를 통해 데이터베이스에 저 장된 데이터의 내용에 근거하여, 머신러닝이나 딥러닝 기반의 인공지능(AI) 학습 알고리즘을 통해 측정대상 지 역의 외부환경정보 데이터와 영상데이터 및 선박궤적 데이터에 대한 상관관계를 분석하고 학습하는 것에 의해, 학습결과에 근거하여 영상정보 취득부를 통해 입력되는 영상으로부터 실시간으로 외부환경정보에 따른 선박 궤적 변화를 추정하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 수행되도록 구성될 수 있다. 이때, 상기한 인공지능(AI) 처리부는, 상기한 바와 같이 데이터베이스의 내용에 대한 학습을 수행하여 인공 지능 분석모델을 구축하는 대신에, 측정대상 지역의 시간별 계측데이터와 영상데이터 및 선박궤적 데이터의 상 관관계에 대하여 미리 학습된 인공지능 분석모델을 포함하여 구성될 수도 있는 등, 본 발명은 필요에 따라 다양 하게 구성될 수 있는 것임에 유념해야 한다. 더욱이, 상기한 영상정보 취득부는, 예를 들면, 카메라 또는 CCTV 등과 같이, 측정대상 지역의 영상을 촬영 하기 위한 촬영수단을 포함하여 구성되고, 이때, 촬영된 영상데이터에는 팬, 틸트, 줌(Pan, Tilt, Zoom ; PTZ) 정보가 포함되도록 구성될 수 있다. 즉, 상기한 바와 같이 영상데이터에 영상의 화각과 방향에 대한 정보를 포함하도록 하여 상관관계 분석에 활용 함으로써, 카메라의 PTZ 동작을 통해 전체 구역 또는 일부 구역을 선택하여 외부환경정보 및 선회궤적을 각각 추정할 수 있다. 더 상세하게는, 상기한 인공지능 분석모델은, 측정대상 지역에 대하여 각각의 측정지점에서 측정된 시간별 풍향, 풍속, 파고, 파향을 포함하는 계측데이터와, 측정대상 지역에 대하여 각각의 측정지점 및 전체 영역에서 파도의 형상 및 파랑의 패턴을 확인 가능한 영상정보, 카메라와 수면 사이의 위치정보, 화각 및 PTZ 정보를 포 함하는 영상데이터 사이의 상관관계를 학습하는 것에 의해, 입력되는 영상으로부터 실시간으로 풍향, 풍속, 파 고, 파향 등의 외부환경정보를 각각 추정하는 처리가 수행되도록 구성될 수 있다. 또는, 상기한 인공지능(AI) 분석모델은, 측정대상 지역에 대하여 각각의 측정지점에서 측정된 시간별 풍향, 풍 속, 파고, 파향을 포함하는 계측데이터와, 측정대상 지역에 대하여 각각의 측정지점 및 전체 영역에서 파도의 형상 및 파랑의 패턴을 확인 가능한 영상정보, 카메라와 수면 사이의 위치정보, 화각 및 PTZ 정보를 포함하는 영상데이터 및 외부환경 변화에 따른 선박의 선회궤적 변화를 실험을 통해 측정한 시험데이터를 포함하는 선박 궤적 데이터 사이의 상관관계를 학습하는 것에 의해, 입력되는 영상으로부터 실시간으로 외부환경정보를 각각 추정하는 것에 더하여, 측정대상 지역의 전체 영역에서 외부환경에 따른 선박의 궤적변화를 추정하는 처리가 수 행되도록 구성될 수 있다. 즉, 도 4 및 도 5를 참조하면, 도 4는 도 1에 나타낸 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템의 인공지능을 이용한 학습 및 분석 처리과정을 개략적으로 나타내는 개념도이고, 도 5는 도 1에 나타낸 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템의 전체적인 구성을 개략적으 로 나타내는 개념도이다. 도 4 및 도 5에 나타낸 바와 같이, 상기한 외부환경정보 추정부 및 상기한 선회궤적 추정부는, 상기한 바와 같이 하여 구축된 인공지능(AI) 분석모델을 이용하여 외부환경정보 및 외부환경에 따른 선박의 궤적변화를추정하는 처리가 각각 수행되도록 구성될 수 있다. 여기서, 바람의 방향과 관계도가 높은 요소는 영상에서의 파도의 방향이며, 파도가 생성되는 곳과 그 크기가 발 전하는 방향으로부터도 바람의 방향 및 크기의 추정이 가능하다. 즉, 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템은, 예를 들면, 풍향을 예측하기 위해 수면 영역을 복수의 카메라로 나누어 촬영하고, 일정 간격(예를 들면, 1 ~ 2분 등)으로 촬영된 영상을 계 속 비교하여 파도가 커지는(바람이 불어오는) 방향을 체크하는 것에 의해 풍향을 판단하는 처리가 수행되도록 구성될 수 있다. 또한, 상기한 출력부는, 상기한 바와 같은 데이터수집부, 인공지능(AI) 처리부, 영상정보 취득부 , 외부환경정보 추정부 및 선회궤적 추정부의 각각의 동작이나 상태, 처리과정 및 결과 등의 각종 정보를 모니터나 디스플레이 등과 같은 별도의 표시수단 등을 통해 시각적으로 표시하는 동시에, 스피커 등과 같은 음성출력수단을 더 포함하여 제어부의 제어신호에 따라 경고음이나 음성메시지 등을 발생하는 처리가 수행되도록 구성될 수 있다. 아울러, 상기한 통신부는, 예를 들면, 사용자 단말기나 서버 등과 같이, 외부 기기와 유선 또는 무선통신 중 적어도 하나의 방식으로 통신을 행하여 각종 데이터를 송수신하는 처리가 수행되도록 구성될 수 있다. 더욱이, 상기한 제어부는, 예를 들면, 풍향, 풍속이나 파고 등의 추정값이 미리 정해진 특정 값이나 조건에 도달하는 경우 등과 같이, 외부환경정보 추정부 및 선회궤적 추정부에 의해 추정된 각각의 추정값이 미 리 정해진 조건이나 기준을 만족하는 경우, 미리 정해진 설정에 따라 출력부를 통하여 해당 내용을 표시하 고 경보나 알림음을 출력하도록 제어하는 동시에, 통신부를 통하여, 예를 들면, 담당부서나 관리자 등과 같 이, 미리 정해진 연락처에 해당 사실을 전달하도록 제어하는 처리가 수행되도록 구성됨으로써, 일종의 해상 모 니터링 시스템으로서 운영 가능하도록 구성될 수 있다. 더 상세하게는, 종래에는 외부환경정보를 얻기 위해 풍향풍속계와 파고계를 이용하여 측정하고자 하는 물리량을 직접적으로 계측하는 방법이 주로 사용되었으나, 이와 같은 직접측정 방법은 측정하고자 하는 지점에 각각의 계 측기기를 설치하고 모니터링해야 하며, 특히, 예를 들면, 호수의 중앙부 등과 같이, 경우에 따라 계측기기를 설 치하기 위한 추가적인 부품이나 장비가 필요할 수 있는 단점이 있었다. 또한, 계측기기를 이용한 직접측정 방법은, 계측기기가 설치된 지점에 대하여는 비교적 정확하고 정밀한 측정값 을 얻을 수 있으나, 예를 들면, 선박의 모형시험 등과 같이, 비교적 넓은 영역에 대한 평균적인 추정값을 획득 하기에는 여러 가지 제한이 있는 것이었다. 반면, 본 발명에 따르면, 도 1 내지 도 5에 나타낸 바와 같이, 바람의 세기와 그 방향에 따라 파도의 높이와 방 향이 결정되고, 이 두가지 외부환경 변화에 따라 선박의 운항특성이 달라지는 것을 목측할 수 있다는 점을 이용 하여, 기계학습 및 카메라나 CCTV 등을 통해 획득되는 영상정보와의 상관관계 분석을 통하여 인공지능(AI) 분석 모델을 구축하고 각종 정보를 추정하도록 구성됨으로써, 특정 지역에서 동일한 시험이 수행되는 경우 계측값을 이용한 학습모델을 한번만 생성하면 되고, 영상을 통한 관찰구역은 풍향풍속계 및 파고계를 설치하여 측정된 계 측지점보다 넓으므로 별도의 계측기기를 설치할 필요 없이 카메라(CCTV)로 획득된 영상정보만으로도 원하는 영 역의 풍향, 풍속, 파향 및 파고 등과 같은 외부환경정보와, 그러한 외부환경의 영향에 따른 선박의 궤적 변화를 용이하게 추정할 수 있다. 따라서 본 발명에 따르면, 선박에 설치된 CCTV 등을 이용하여 보다 간단한 구성으로 편리하게 상대 풍향풍속 및 상대 파향파고 등과 같은 외부환경 변화를 추정할 수 있고, 외부환경에 노출되어 운항중인 선박의 정상궤적 대 비 밀림궤적 등과 같은 변화량을 용이하게 추정할 수 있다. 아울러, 본 발명에 따르면, 기계학습을 통해 카메라나 CCTV로 촬영된 영상과 각각의 측정장비를 통해 측정된 측 정값 및 실험을 통해 얻어진 환경에 따른 선박의 궤적변화의 상관관계를 분석하고, 카메라의 설치위치, PTZ 정 보, 촬영구역별(국부, 전체)로 관찰이 가능하며, 바람 및 파도 등의 외부 영향을 반영한 모형시험 결과를 예측 하고 평가 가능한 장점을 가지는 것이다. 즉, 예를 들면, 특정 지역에서 선박의 운항시험이나 모형시험 등을 수행하는 경우, 시험을 진행하기 위하여는 현재 시험지역의 상태, 즉, 풍향, 풍속, 파고, 파향 등과 같은 외부환경정보가 해당 시험을 위한 조건을 모두 만족하는지를 먼저 파악하여야 하며, 이를 위하여 종래에는 각각의 측정장비를 통해 필요한 물리량들을 각각 별 도로 측정하여야 하는 번거로움이 있었으나, 본 발명에 따르면, 상기한 바와 같이 별도의 측정장비를 일일이 설 치할 필요 없이 해당 지역의 해수면 영상으로부터 각각의 외부환경정보를 용이하게 추정할 수 있다. 이때, 상기한 바와 같이 인공지능(AI)을 통해 해수면의 영상으로부터 외부환경정보를 추정하고 특정 조건을 만 족할 경우 알림을 보내는 처리가 자동으로 수행되도록 구성됨으로써, 시험조건이 만족될 때까지 계속해서 측정 을 행하고 모니터링하는 과정을 반복해야 하는 번거로움을 해소하고 시험준비를 위한 시간과 노력을 크게 절감 할 수 있다. 따라서 상기한 바와 같이 하여 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템을 구 현할 수 있으며, 이를 이용하여, 영상정보를 이용한 외부환경정보 추정방법을 용이하게 구현할 수 있다. 즉, 도 6을 참조하면, 도 6은 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템을 이용 한 외부환경정보 추정방법의 전체적인 구성을 개략적으로 나타내는 플로차트이다. 도 6에 나타낸 바와 같이, 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정방법은, 크게 나누어, 먼저, 측정대상 지역의 외부환경정보와 영상정보 및 외부환경 변화에 따른 선박의 선회궤적 정보를 포함하는 각 종 데이터를 수집하여 데이터베이스를 구축하는 처리가 상기한 데이터수집부를 통해 수행되는 데이터 수집 단계(S10)와, 데이터베이스에 저장된 데이터를 학습하여 외부환경정보 및 선박 선회궤적을 각각 추정하기 위한 인공지능(AI) 분석모델을 구축하는 처리가 상기한 인공지능(AI) 처리부를 통해 수행되는 인공지능(AI) 분석 모델 구축단계(S20)와, 구축된 인공지능(AI) 분석모델을 이용하여, 상기한 영상정보 취득부로부터 입력되는 영상으로부터 풍향, 풍속, 파고, 파향 등의 외부환경정보를 실시간으로 추정하는 처리가 상기한 외부환경정보 추정부를 통해 수행되는 외부환경정보 추정단계(S30)와, 상기한 인공지능(AI) 분석모델을 이용하여, 영상정 보 취득부로부터 입력되는 영상으로부터 외부환경에 따른 선박의 선회궤적을 실시간으로 추정하는 처리가 상기한 선회궤적 추정부를 통해 수행되는 선회궤적 추정단계(S40)를 포함하여 구성될 수 있다. 여기서, 상기한 방법은, 도 6에 나타낸 바와 같이, 상기한 영상정보 취득부로부터 입력되는 영상으로부터 추정된 각각의 추정값이 미리 정해진 조건을 만족하는 경우 상기한 출력부를 통해 해당 내용을 출력하는 동 시에, 상기한 통신부를 통해 미리 정해진 연락처에 해당 사실을 전달하는 처리가 상기한 제어부를 통해 수행되는 모니터링단계(S50)를 더 포함하여 구성될 수 있다. 또한, 상기한 방법은, 도시되지는 않았으나, 상기한 각 단계의 처리과정 및 처리결과를 상기한 출력부를 통 해 출력하는 처리가 수행되는 출력단계 및 상기한 통신부를 통하여 유선 또는 무선통신 중 적어도 하나의 방식으로 각각의 사용자 단말기나 서버 등과 같은 외부 기기와 각종 데이터를 송수신하는 처리가 수행되는 데이 터 송수신단계를 더 포함하여 구성될 수 있다. 상기한 바와 같은 구성으로부터, 본 발명에 따르면, 특정 지역에 대하여 시간별로 풍향풍속계와 파고계로 각각 측정된 바람의 방향(풍향)과 세기(풍속) 및 파도의 세기(파고) 등과 같은 외부환경정보와, 해당 지역에 대하여 측정과 동시에 촬영된 시간별 영상을 서로 연관지어 그 상관관계를 머신러닝이나 딥러닝 등과 같은 인공지능 학 습 알고리즘을 통해 학습하고, 학습결과에 근거하여 CCTV나 카메라 등을 통해 촬영된 영상으로부터 실시간으로 풍향, 풍속, 파고, 파향 등의 외부환경정보를 추정하도록 구성됨으로써, 풍향풍속계나 파고계 등과 같은 별도의 측정장비를 설치할 필요 없이 보다 간단한 구성 및 저렴한 비용으로 외부환경정보를 파악할 수 있다. 더욱이, 본 발명에 따르면, 바람 및 파도 등과 같은 외력이 존재하는 상태에서 수행된 모형시험 결과를 이용하 여, 다양한 속도 및 타각에서의 선회 등과 같은 조종시험의 결과로 측정된 모형선의 밀림거리와 방향에 대한 데 이터의 상관관계를 인공지능을 통해 분석하고 학습함으로써, 별도의 측정장비가 필요 없이 영상정보만으로 선박 의 향후 궤적의 변화정도를 예측할 수 있다. 여기서, 상기한 본 발명의 실시예에 있어서, 상기한 바와 같이 머신러닝이나 딥러닝에 기반한 인공지능 학습 알 고리즘을 통해 각종 데이터에 대한 학습을 수행하고 학습결과에 따라 영상데이터에 대한 분석을 수행하여 분석 결과를 출력하는 보다 구체적인 처리과정에 대하여는 기존의 머신러닝 또는 딥러닝 알고리즘들의 내용들을 참고 하여 당업자가 적절히 구성할 수 있는 사항이므로, 이에, 본 발명에서는, 상기한 바와 같이 종래기술의 문헌 등 을 참조하여 당업자가 용이하게 이해하고 실시할 수 있는 내용에 대하여는 그 상세한 설명을 생략하였음에 유념 해야 한다. 따라서 상기한 바와 같이 하여 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템 및 방 법을 구현할 수 있으며, 이를 이용하여, 영상정보를 이용한 해상 모니터링 시스템 및 방법을 용이하게 구현 할 수 있다. 즉, 도 7을 참조하면, 도 7은 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템을 이용 한 해상 모니터링 시스템의 전체적인 구성을 개략적으로 나타내는 도면이다. 도 7에 나타낸 바와 같이, 본 발명의 실시예에 따른 영상정보를 이용한 해상 모니터링 시스템은, 크게 나누 어, 예를 들면, 각각의 선박이나 지역마다 설치되고 미리 정해진 설정에 따라 해수면의 상태에 따른 외부환경정 보를 주기적으로 추정하여 모니터링하는 처리가 수행되도록 이루어지는 다수의 외부환경정보 모니터링 시스템 과, 각각의 외부환경정보 모니터링 시스템으로부터 주기적으로 모니터링 데이터를 수신하여 미리 설정 된 조건에 따라 알림을 보내는 동시에, 해수면에 따른 외부환경정보의 변화에 대한 빅데이터를 구축하고 사용자 의 요청에 따라 해당하는 각종 정보를 맞춤형으로 제공하는 처리가 수행되도록 이루어지는 관제서버 및 각 각의 사용자가 해수면의 상태 및 해수면의 상태에 따른 외부환경정보를 확인하고 원하는 정보를 요청하여 제공 받기 위해 각각의 외부환경정보 모니터링 시스템 및 관제서버와 통신하여 각종 데이터를 송수신하는 처 리가 수행되도록 이루어지는 사용자 단말기를 포함하여 구성될 수 있다. 여기서, 상기한 외부환경정보 모니터링 시스템은, 도 1 내지 도 5를 참조하여 상기한 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템을 이용하여, 해당 위치에서 해수면의 상태에 따라 각각의 외부환경정보를 추정하고 모니터링하여 얻어지는 각종 데이터를 관제서버로 전송하는 처리가 수행되도록 구성될 수 있다. 또한, 상기한 사용자 단말기는, 예를 들면, PC와 같은 단말장치를 이용하여 구성될 수 있고, 또는, 스마트 폰이나 태블릿 PC 또는 노트북 등과 같이, 개인이 휴대 가능한 정보통신 단말기에 전용의 어플리케이션을 설치 하여 구성될 수도 있으나, 본 발명은 반드시 이러한 구성으로만 한정되는 것은 아니며, 즉, 본 발명은 본 발명 의 취지 및 본질을 벗어나지 않는 범위 내에서 당업자에 의해 필요에 따라 다양하게 수정 및 변경하여 구성될 수 있는 것임에 유념해야 한다. 상기한 바와 같은 구성으로부터, 본 발명에 따르면, 각각의 선박이나 지역마다 외부환경정보 모니터링 시스템 을 설치하여 두고, 각각의 외부환경정보 모니터링 시스템들이 서로 통신하여 각종 데이터를 주고받도록 하는 동시에, 관제서버의 요청에 따라, 또는, 미리 정해진 설정에 따라 주기적으로 모니터링 데이터를 관제 서버로 각각 전송하도록 구성됨으로써, 예를 들면, 전국 단위의 광범위한 지역에 대하여도 대규모의 해상 모니터링 시스템 및 방법을 용이하게 구축할 수 있다. 따라서 상기한 바와 같이 하여 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템 및 방법을 구현할 수 있으며, 그것에 의해, 본 발명에 따르면, 바람의 세기와 방향에 따라 파도의 높이와 방향이 결정되고 이러한 두 가지 외부환경 변화에 따라 선박의 운항특성이 변화하는 점에 착안하여, 측정대상 지역에 대하여 각 종 센서를 통해 측정된 각각의 측정값과 카메라나 CCTV 등을 통해 획득된 영상정보의 상관관계에 대한 학습모델 을 구축하고, 머신러닝(Machine Learning) 또는 딥러닝(Deep Learning) 기반한 인공지능(AI) 학습 알고리즘을 이용하여 학습을 수행하며, 학습결과에 근거하여 카메라나 CCTV 등을 통해 획득되는 영상정보를 분석하는 것에 의해 외부환경정보를 추정하는 처리가 수행되도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방 법이 제공됨으로써, 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장 비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부 환경정보를 추정할 수 있다. 또한, 본 발명에 따르면, 상기한 바와 같이 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법이 제공됨으로써, 풍향이나 풍속 또는 파고 및 파향 등의 외부환경정보를 측정하기 위하여는 풍향계, 풍속 계, 파고계 등과 같은 다양한 계측장비를 각각 따로 설치하고 각각의 측정장비로부터 측정되는 측정값들을 지속 적으로 모니터링하여야 하는 번거로움이 있는 데 더하여, 경우에 따라 그러한 각각의 장비들을 원하는 측정위치 에 설치하기 위해 별도의 부품이나 추가적인 장비가 필요함으로 인해 그만큼 비용이 증가하게 되는 문제가 있었 던 종래기술의 외부환경정보 측정장치 및 방법들의 문제점을 해결할 수 있다. 아울러, 본 발명에 따르면, 상기한 바와 같이 카메라나 CCTV 등을 통해 획득된 측정지역의 영상정보를 분석하는 것에 의해 별도의 측정장비를 설치하지 않고 비교적 간단한 구성 및 저렴한 비용으로 풍향, 풍속, 파향, 파고, 선박영향 등과 같은 외부환경정보를 추정할 수 있도록 구성되는 영상정보를 이용한 외부환경정보 추정시스템 및 방법이 제공됨으로써, 외부환경정보를 측정하기 위해서는 각각의 측정장비를 따로 설치하고 측정값을 모니터링 해야 함으로 인해 설치의 번거로움 및 비용증가의 문제가 있는 데 더하여, 각각의 측정장비가 설치된 지점에 대 하여는 비교적 정확한 측정값을 얻을 수 있으나 비교적 넓은 지역에 대하여 평균적인 측정값을 얻기 위해 대량 의 측정장비를 설치하기에는 현실적으로 어려운 한계가 있었던 종래기술의 외부환경정보 측정장치 및 방법들의 문제점을 해결할 수 있으며, 그것에 의해, 예를 들면, 선박의 운항시험을 위해 시험지역의 상태를 파악하여 시 험 가능 여부를 결정하는 경우 등과 같이, 다양한 경우에 폭넓게 적용될 수 있다. 이상, 상기한 바와 같은 본 발명의 실시예를 통하여 본 발명에 따른 영상정보를 이용한 외부환경정보 추정시스"}
{"patent_id": "10-2022-0048337", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "템 및 방법의 상세한 내용에 대하여 설명하였으나, 본 발명은 상기한 실시예에 기재된 내용으로만 한정되는 것은 아니며, 따라서 본 발명은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 설계상의 필요 및 기타 다양한 요인에 따라 여러 가지 수정, 변경, 결합 및 대체 등이 가능한 것임은 당연한 일이라 하겠다."}
{"patent_id": "10-2022-0048337", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템의 전체적인 구성을 개략적으로 나 타내는 블록도이다. 도 2는 바람에 의한 파랑생성 변화를 촬영한 CCTV 영상을 나타내는 도면이다. 도 3은 풍향/풍속 및 파향/파고에 따른 선박의 선회궤적 변화를 모형시험을 통해 측정한 결과를 나타내는 도면 이다. 도 4는 도 1에 나타낸 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템의 인공지능을 이용 한 학습 및 분석 처리과정을 개략적으로 나타내는 개념도이다. 도 5는 도 1에 나타낸 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템의 전체적인 구성 및 처리과정을 각각 개략적으로 나타내는 개념도이다. 도 6은 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템을 이용한 외부환경정보 추정방법 의 전체적인 구성을 개략적으로 나타내는 플로차트이다. 도 7은 본 발명의 실시예에 따른 영상정보를 이용한 외부환경정보 추정시스템을 이용한 해상 모니터링 시스템의 전체적인 구성을 개략적으로 나타내는 블록도이다."}
