{"patent_id": "10-2022-7010598", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0054850", "출원번호": "10-2022-7010598", "발명의 명칭": "게임 환경을 위한 라이트필드 디스플레이 시스템", "출원인": "라이트 필드 랩 인코포레이티드", "발명자": "카라핀 조나단 션"}}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "라이트필드(LF) 디스플레이 시스템으로서,라이트필드 디스플레이 어셈블리들에 의해 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성하도록 구성된 처리엔진 ― 상기 홀로그래픽 콘텐츠는 전자기 에너지로서 디스플레이됨 ―;게임 환경 내의 라이트필드 디스플레이 어셈블리를 포함하고, 상기 라이트필드 디스플레이 어셈블리는,홀로그래픽 콘텐츠를 투사하도록 구성된 하나 이상의 디스플레이 표면들; 및상기 처리 엔진으로부터 홀로그래픽 콘텐츠를 수신하고, 전자기 에너지를 생성하여 상기 디스플레이 표면들을통해 홀로그래픽 콘텐츠로서 하나 이상의 관찰자에게 투사하도록 구성된 하나 이상의 상기 에너지 장치들을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 디스플레이 표면들은 홀로그래픽 게임 스테이션 또는 홀로그래픽 도박 테이블에포함되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 홀로그래픽 게임 스테이션은 슬롯머신, 게임 테이블 게임 또는 전자 게임인, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 디스플레이 표면들은 상기 게임 환경의 벽들에 포함되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 홀로그래픽 콘텐츠를 관찰하는 상기 하나 이상의 관찰자들에 관한 정보를 획득하도록 구성된 추적 시스템을 더 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 추적 시스템에 의해 획득된 정보는,홀로그래픽 콘텐츠에 대한 관찰자 반응, 및상기 홀로그래픽 콘텐츠를 관찰하는 상기 하나 이상의 관찰자들의 특성을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 하나 이상의 관찰자들에 관한 정보는 상기 하나 이상의 관찰자들 중 한 관찰자의 위치,상기 관찰자의 움직임, 상기 관찰자의 제스처, 관찰자의 표정, 관찰자의 나이, 상기 관찰자의 성별, 및 상기 관찰자에 의해 착용된 의복 중 임의의 것을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서, 상기 처리 엔진에 의해 생성된 상기 홀로그래픽 콘텐츠는 상기 추적 시스템에 의해 식별된 하나 이상의 관찰자들의 나이, 성별, 위치, 움직임, 제스처, 또는 얼굴 표정에 응답하여 변경되는, LF 디스플레이시스템.공개특허 10-2022-0054850-3-청구항 9 제1항에 있어서,관찰자 프로파일링 시스템을 더 포함하고, 상기 관찰자 프로파일링 시스템은,상기 LF 디스플레이 모듈들에 의해 제공된 상기 홀로그래픽 콘텐츠를 관찰하는 상기 하나 이상의 관찰자들을 식별하고,각각의 상기 하나 이상의 식별된 관찰자들에 대한 관찰자 프로파일을 생성하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 홀로그래픽 콘텐츠에 대한 관찰자 반응들 또는 상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들의 특성은 상기 관찰자 프로파일들에 포함되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 관찰자 프로파일링 시스템은 관찰자 프로파일을 생성하기 위해 상기 하나 이상의 식별된관찰자들의 소셜 미디어 계정에 액세스하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 홀로그래픽 콘텐츠는 AI 모델에 따라 변경되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서, 상기 LF 처리 엔진은 상기 게임 환경에서 식별된 하나 이상의 관찰자들의 특성에 부분적으로기초하여 상기 홀로그래픽 콘텐츠를 생성하도록 구성되고, 각각의 식별된 관찰자는, 상기 LF 디스플레이 시스템에 의해 디스플레이되되 하나 이상의 특성을 포함하는 관찰자 프로파일과 연관된 홀로그래픽 콘텐츠를관찰하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 특성은 상기 관찰자의 위치, 상기 관찰자의 움직임, 상기 관찰자의 제스처, 상기 사용자의 얼굴 표정, 상기 사용자의 성별, 상기 사용자의 나이, 및 상기 사용자의 의복 중 임의의 것을 포함하는, LF디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서, 상기 처리 엔진은프로세서를 더 포함하며, 상기 프로세서는 모델을 적용하여추적 시스템에 의해 획득된 정보를 이용하여, 상기 디스플레이된 홀로그래픽 콘텐츠를 관찰하는 상기 하나 이상의 관찰자들 중 특정 관찰자를 식별하고,상기 식별된 특정 사용자에 대한 상기 관찰자 프로파일에 기초하여 상기 특정 관찰자의 하나 이상의 특성을 식별하며,상기 식별된 특성에 기초하여 상기 특정 관찰자에 대한 선호도를 결정하고,상기 결정된 선호도에 따라 상기 LF 디스플레이 시스템에 의해 상기 특정 관찰자에게 제공하기 위한 홀로그래픽콘텐츠를 생성하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서, 상기 모델은 인공지능 모델인, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "공개특허 10-2022-0054850-4-제1항에 있어서, 상기 복수의 에너지 장치들은상기 하나 이상의 디스플레이 표면들 상에 입사하는 에너지를 감지하도록 구성된 하나 이상의 에너지 센서들을포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 하나 이상의 에너지 센서들은 상기 디스플레이 표면 상에 입사하는 전자기 에너지로부터의 라이트필드를 캡처하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 LF 디스플레이 어셈블리는 홀로그래픽 콘텐츠를 투사하고 동시에 라이트필드를 캡처하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1항에 있어서, 상기 홀로그래픽 콘텐츠는 홀로그래픽 캐릭터를 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 홀로그래픽 캐릭터가 제공될 때 감각 피드백을 제공하도록 구성되는 적어도 하나의 감각 피드백 장치를 포함한 감각 피드백 시스템을 더 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서, 상기 감각 피드백은 촉각 피드백, 오디오 피드백, 아로마 피드백, 온도 피드백, 또는 이들의임의의 조합을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 촉각 피드백은 상기 하나 이상의 관찰자들이 터치를 통해 상호작용할 수 있는, 상기 홀로그래픽 캐릭터의 표면과 일치하는 촉각 표면을 제공하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제20항에 있어서,상기 게임 환경의 상기 하나 이상의 관찰자들에 관한 정보를 획득하도록 구성된 하나 이상의 추적 장치들을 포함하는 추적 시스템을 더 포함하고,상기 컨트롤러는 상기 추적 시스템에 의해 획득된 정보에 기초하여 상기 게임 환경의 하나 이상의 관찰자들을위한 상기 홀로그래픽 캐릭터를 생성하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제1항에 있어서, 상기 홀로그래픽 콘텐츠는 제1 유형의 에너지 및 제2 유형의 에너지를 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제25항에 있어서, 상기 제1 유형의 에너지는 전자기 에너지이고, 상기 제2 유형의 에너지는 초음파 에너지인,LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 상기 제1 유형의 에너지 및 제2 유형의 에너지는 상기 LF 디스플레이 어셈블리가 홀로그래픽객체의 표면 근처에 또는 그와 일치하는 부피 촉각 표면을 제공하도록 동일한 위치에 제공되는, LF 디스플레이시스템.공개특허 10-2022-0054850-5-청구항 28 제24항에 있어서, 상기 추적 시스템에 의해 획득된 정보는, 상기 관찰자의 위치, 상기 관찰자의 움직임, 상기관찰자의 제스처, 상기 관찰자의 표정, 상기 관찰자의 시선, 관찰자의 나이, 상기 관찰자의 성별, 상기 관찰자에 의해 착용된 의복의 일부의 식별, 및 상기 관찰자의 청각적 피드백 중 임의의 것을 포함하는, LF 디스플레이시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제28항에 있어서, 상기 관찰자의 상기 추적된 정보는 상기 관찰자의 시선을 포함하고, 상기 LF 디스플레이 어셈블리는 상기 관찰자의 상기 시선과 눈 맞춤을 유지하도록 상기 홀로그래픽 캐릭터의 눈을 업데이트하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제28항에 있어서, 상기 하나 이상의 관찰자들은 제1 관찰자 및 제2 관찰자를 포함하고, 상기 추적된 반응은 상기 제1 관찰자 및 상기 제2 관찰자의 시선을 포함하며, 상기 LF 디스플레이 어셈블리는 상기 제1 관찰자와 상기제2 관찰자 사이의 눈 맞춤을 교대로 향하게 하도록 상기 홀로그래픽 캐릭터의 눈을 업데이트하도록 구성되는,LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제28항에 있어서, 상기 컨트롤러는 상기 추적 시스템 및 인공지능 모델에 의해 획득된 정보를 사용하여 상기 홀로그래픽 캐릭터를 생성하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제28항에 있어서,관찰자 프로파일링 모듈을 더 포함하고, 상기 관찰자 프로파일링 모듈은,상기 추적 시스템에 의해 획득된 상기 정보에 액세스하고,상기 정보를 처리하여 상기 게임 환경의 상기 하나 이상의 관찰자들 중 한 관찰자를 식별하며,상기 관찰자에 대한 관찰자 프로파일을 생성하도록 구성되고,상기 컨트롤러는 상기 관찰자 프로파일에 부분적으로 기초하여 상기 관찰자를 위한 상기 홀로그래픽 캐릭터를생성하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제32항에 있어서, 상기 홀로그래픽 캐릭터는 상기 관찰자에 대한 개인 비서로서 동작하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제32항에 있어서, 상기 컨트롤러는 상기 관찰자 프로파일 및 인공지능 모델을 사용하여 상기 홀로그래픽 캐릭터를 생성하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제34항에 있어서, 상기 관찰자 프로파일링 모듈은상기 관찰자의 소셜 미디어 계정으로부터의 정보를 사용하여 상기 관찰자 프로파일을 업데이트하도록 더 구성되고,상기 컨트롤러는 상기 업데이트된 관찰자 프로파일에 부분적으로 기초하여 상기 홀로그래픽 캐릭터를 생성하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제32항에 있어서, 상기 컨트롤러는 상기 업데이트된 관찰자 프로파일 및 인공지능 모델을 사용하여 상기 홀로그공개특허 10-2022-0054850-6-래픽 캐릭터를 생성하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "라이트필드(LF) 디스플레이 시스템으로서,게임 환경에서 디스플레이 영역을 갖는 홀로그래픽 디스플레이 ― 상기 홀로그래픽 디스플레이는 상기 게임 환경의 적어도 일 부분에 대응하는 홀로그래픽 객체 부피 내의 상기 게임 환경의 관찰자들에게 홀로그래픽 콘텐츠를 제공함 ―;상기 게임 환경의 상기 홀로그래픽 객체 부피 내의 하나 이상의 게임 스테이션들 ― 상기 홀로그래픽 디스플레이는 상기 하나 이상의 게임 스테이션들의 하나 이상의 시각적 측면들과 관련되고 이를 증강시키는 홀로그래픽콘텐츠를 제공함 ―; 및각각의 상기 하나 이상의 게임 스테이션들에 의해 제공되는 게임을 플레이하고 상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들에 관한 정보를 획득하도록 구성된 추적 시스템 ― 상기 정보는 홀로그래픽 콘텐츠에 대한 관찰자반응들, 및 상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들의 특성을 포함함 ―을 포함하고, 상기 관찰자들을 위한 상기 홀로그래픽 콘텐츠는 상기 추적 시스템에 의해 획득된 상기 정보에 기초하여 증강되는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제37항에 있어서, 상기 홀로그래픽 디스플레이는 상기 게임 환경에서 하나 이상의 표면들을 형성하는 복수의 LF디스플레이 모듈들이고, 각각의 LF 디스플레이 모듈은 함께했을 때 하나의 LF 디스플레이 모듈의 디스플레이 영역보다 더 큰 유효 디스플레이 영역을 갖는 이음매 없는 디스플레이 표면을 형성하도록 함께 타일링되며, 상기홀로그래픽 콘텐츠는 상기 게임 환경의 홀로그래픽 객체 부피 내의 한 위치에 제공된 적어도 하나의 홀로그래픽객체를 포함하는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제38항에 있어서, 상기 홀로그래픽 객체는 홀로그래픽 캐릭터이고, 상기 추적 시스템은관찰자로부터 상기 홀로그래픽 캐릭터와의 하나 이상의 상호작용을 수신하고,인공지능(AI) 모델을 사용하여, 상기 관찰자로부터의 하나 이상의 상호작용에 대한 홀로그래픽 캐릭터 응답을생성하도록 더 구성되는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제39항에 있어서, 상기 홀로그래픽 캐릭터는 상기 관찰자에 대한 개인 비서로서 동작하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제37항에 있어서, 상기 홀로그래픽 객체는 상기 게임 환경에서 제1 관찰자에게 제공되는 제2 관찰자의 라이브홀로그래픽 콘텐츠이고, 상기 제2 관찰자는 상기 게임 환경에서 또한 상기 게임을 플레이하는 상기 제1 관찰자로부터 원격으로 게임을 하고 있으며, 상기 LF 디스플레이 시스템은상기 제2 관찰 사용자의 이미지 데이터를 수신하고,상기 제1 관찰자 및 상기 제2 관찰자가 상이한 물리적 위치들에서 상기 게임을 동시에 플레이하는 동안, 상기제1 관찰자에게 제공하기 위해 상기 게임 환경 내에 상기 제2 관찰자의 라이브 홀로그래픽 표현을 생성하도록더 구성되는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "제37항에 있어서, 상기 홀로그래픽 콘텐츠는 홀로그래픽 캐릭터이고, 상기 추적 시스템은하나 이상의 컨텍스트 사용자 특성을 식별하고 ― 상기 하나 이상의 컨텍스트 사용자 특성은 상기 관찰자의 승또는 패, 상기 관찰자의 몸짓 언어의 하나 이상의 분류된 인스턴스, 상기 관찰자의 하나 이상의 분류된 얼굴 표정, 상기 관찰자의 발성 분석, 또는 이들의 일부 조합 중 적어도 하나를 포함함 ―,인공지능(AI) 모델을 사용하여, 상기 홀로그래픽 캐릭터로 하여금 상기 관찰자로부터의 상기 식별된 하나 이상공개특허 10-2022-0054850-7-의 컨텍스트 사용자 특성에 응답하여 하나 이상의 동작을 수행하는 것 또는 그에 응답하는 것 중 적어도 하나를수행하게 하도록 더 구성되는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "제41항에 있어서, 상기 홀로그래픽 캐릭터로부터의 응답은, 격려의 말, 흥분의 말, 애도의 말, 미소, 제스처,신체 움직임, 박수 움직임, 또는 이들의 일부 조합 중의 적어도 하나인, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "제37항에 있어서,관찰자 프로파일링 시스템을 더 포함하고, 상기 관찰자 프로파일링 시스템은,상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들의 특성 및 상기 홀로그래픽 콘텐츠에 대한 관찰자 반응들을 식별하고,상기 식별된 특성 및 반응들에 기초하여 상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들의 특성 및 선호도를 기술하는 관찰자 프로파일들을 생성하도록 구성된, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "제37항에 있어서, 상기 홀로그래픽 콘텐츠는 상기 추적 시스템에 의해 획득된 정보에 기초하여 각각의 관찰자에대해 개별적으로 증강되는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "제37항에 있어서, 상기 제1 관찰자에게 제공되는 상기 홀로그래픽 콘텐츠는 상기 게임 환경에서 제2 관찰자에게제공되는 상기 홀로그래픽 콘텐츠와 상이한, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "제45항에 있어서, 상기 홀로그래픽 콘텐츠와 관련하여 상기 제1 관찰자에게 제공되는 오디오 콘텐츠는 제2 관찰자에게 제공되는 상기 오디오 콘텐츠와 상이한, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "제37항에 있어서, 상기 게임 환경은 카지노이고, 상기 하나 이상의 게임 스테이션들은 슬롯머신 또는 도박 테이블을 포함하는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "제48항에 있어서, 상기 홀로그래픽 콘텐츠는 상기 게임 환경에서의 홀로그래픽 캐릭터이고, 상기 햅틱 표면은상기 홀로그래픽 캐릭터의 손과 일치하는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "제37항에 있어서,상기 홀로그래픽 콘텐츠의 적어도 일 부분과 일치하는 햅틱 표면을 생성하도록 구성된 복수의 초음파 스피커들을 더 포함하는, 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_51", "content": "라이트필드(LF) 디스플레이 시스템으로서,네트워크 연결을 통해, 전자기 에너지로서 하나 이상의 관찰자들에게 디스플레이하기 위한 홀로그래픽 콘텐츠를수신하도록 구성된 네트워크 인터페이스; 및게임 환경 내의 라이트필드 디스플레이 어셈블리를 포함하고, 상기 라이트필드 디스플레이 어셈블리는,홀로그래픽 콘텐츠를 투사하도록 구성된 하나 이상의 디스플레이 표면들; 및공개특허 10-2022-0054850-8-상기 네트워크 인터페이스로부터 홀로그래픽 콘텐츠를 수신하고, 상기 전자기 에너지를 생성하여 상기 디스플레이 표면들을 통해 홀로그래픽 콘텐츠로서 하나 이상의 사용자들에게 투사하도록 구성된 하나 이상의 에너지 장치들을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "제50항에 있어서,상기 홀로그래픽 콘텐츠를 상기 LF 디스플레이 어셈블리에 의해 제공될 수 있는 포맷으로 디코딩하도록 구성된디코더를 더 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_53", "content": "제50항에 있어서,컴퓨터 명령들을 저장하는 프로세서를 더 포함하고, 상기 컴퓨터 명령들은, 실행될 때, 상기 프로세서로하여금,상기 네트워크 인터페이스를 통해 상기 네트워크 연결로부터 제1 포맷으로 홀로그래픽 콘텐츠를 수신하게 하고,상기 제1 포맷의 홀로그래픽 데이터를 제2 포맷의 홀로그래픽 콘텐츠로 디코딩하게 하는, LF 디스플레이시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_54", "content": "제52항에 있어서, 상기 제1 포맷은 벡터화된 데이터 포맷이고, 상기 제2 포맷은 래스터화된 데이터 포맷인, LF디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_55", "content": "제52항에 있어서, 상기 컴퓨터 명령들은, 실행될 때, 상기 프로세서로 하여금상기 LF 디스플레이 시스템의 하드웨어 구성을 결정하게 하고,상기 하드웨어 구성에 기초하여 상기 홀로그래픽 콘텐츠를 상기 제2 포맷으로 디코딩하게 하는, LF 디스플레이시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_56", "content": "제52항에 있어서, 상기 컴퓨터 명령들은, 실행될 때, 상기 프로세서로 하여금상기 게임 환경의 레이아웃을 결정하게 하고,상기 게임 환경의 레이아웃에 기초하여 상기 홀로그래픽 콘텐츠를 상기 제2 포맷으로 디코딩하게 하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_57", "content": "제52항에 있어서, 상기 컴퓨터 명령들은, 실행될 때, 상기 프로세서로 하여금상기 LF 디스플레이 어셈블리의 구성을 결정하게 하고, 상기 구성은해상도,각도당 각도들,시야, 및디스플레이 영역 중 임의의 것을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_58", "content": "제52항에 있어서,상기 네트워크를 통해 수신된 홀로그래픽 콘텐츠의 디지털 권리를 관리하도록 구성된 저작권 관리 모듈을 더 포공개특허 10-2022-0054850-9-함하며, 상기 디지털 저작권 관리 모듈은 상기 LF 디스플레이 어셈블리로 하여금 상기 저작권 관리 모듈이 디지털 키를 갖는 홀로그래픽 콘텐츠를 투사할 수 있게 하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_59", "content": "제52항에 있어서, 상기 홀로그래픽 콘텐츠는 상기 네트워크를 통해 상기 LF 디스플레이 시스템에 연결된 홀로그래픽 콘텐츠 저장부로부터 수신되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_60", "content": "라이트필드(LF) 디스플레이 시스템으로서,게임 환경에서 하나 이상의 표면들을 형성하는 복수의 LF 디스플레이 모듈들 ― 각각의 LF 디스플레이 모듈은디스플레이 영역을 갖고, 함께했을 때 임의의 개별적인 LF 디스플레이 모듈의 영역보다 더 큰 유효 디스플레이영역을 갖는 이음매 없는 디스플레이 표면을 형성하도록 함께 타일링되고, 상기 게임 환경의 적어도 일 부분에대응하는 홀로그래픽 객체 부피 내의 상기 게임 환경의 관찰자들에게 홀로그래픽 콘텐츠를 제공함 ―; 및상기 게임 환경의 상기 홀로그래픽 객체 부피 내의 하나 이상의 게임 스테이션들 ― 상기 복수의 LF 디스플레이모듈들은 상기 하나 이상의 게임 스테이션들과 관련하여 홀로그래픽 콘텐츠를 제공함 ―을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_61", "content": "제59항에 있어서,각각의 상기 하나 이상의 게임 스테이션들에 의해 제공되는 게임을 플레이하고 상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들에 관한 정보를 획득하도록 구성된 추적 시스템을 더 포함하고, 상기 정보는 홀로그래픽 콘텐츠에대한 관찰자 반응들, 및 상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들의 특성을 포함하며, 상기 관찰자들을 위한 상기 홀로그래픽 콘텐츠는 상기 추적 시스템에 의해 획득된 상기 정보에 기초하여 증강되는, LF 디스플레이시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_62", "content": "제59항에 있어서, 상기 홀로그래픽 콘텐츠는 홀로그래픽 캐릭터이고, 상기 추적 시스템은관찰자로부터 상기 홀로그래픽 캐릭터와의 하나 이상의 상호작용을 수신하고,상기 관찰자로부터의 상기 하나 이상의 수신된 상호작용과 연관된 의도를 식별하며,인공지능(AI) 모델을 사용하여, 상기 관찰자로부터의 하나 이상의 상호작용에 대한 홀로그래픽 캐릭터 응답을생성하도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_63", "content": "제59항에 있어서,상기 홀로그래픽 콘텐츠의 적어도 일 부분과 일치하는 햅틱 표면을 생성하도록 구성된 복수의 초음파 스피커들을 더 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_64", "content": "제62항에 있어서, 상기 홀로그래픽 콘텐츠는 상기 게임 환경에서의 홀로그래픽 캐릭터이고, 상기 햅틱 표면은상기 홀로그래픽 캐릭터의 신체 부분과 일치하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_65", "content": "제59항에 있어서, 상기 홀로그래픽 콘텐츠는 홀로그래픽 캐릭터이고, 상기 추적 시스템은하나 이상의 컨텍스트 사용자 특성을 식별하고 ― 상기 하나 이상의 컨텍스트 사용자 특성은 상기 관찰자의 승또는 패, 상기 관찰자의 몸짓 언어의 하나 이상의 분류된 인스턴스, 상기 관찰자의 하나 이상의 분류된 얼굴 표정, 상기 관찰자의 발성 분석, 또는 이들의 일부 조합 중 적어도 하나를 포함함 ―,공개특허 10-2022-0054850-10-인공지능(AI) 모델을 사용하여, 상기 홀로그래픽 캐릭터로 하여금 상기 관찰자로부터의 상기 식별된 하나 이상의 컨텍스트 사용자 특성에 응답하여 하나 이상의 동작을 수행하는 것 또는 그에 응답하는 것 중 적어도 하나를수행하게 하도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_66", "content": "제64항에 있어서, 상기 홀로그래픽 캐릭터로부터의 응답은, 격려의 말, 흥분의 말, 애도의 말, 미소, 제스처,신체 움직임, 박수 움직임, 또는 이들의 일부 조합 중의 적어도 하나인, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_67", "content": "제59항에 있어서, 상기 홀로그래픽 콘텐츠는 상기 게임 환경에서 제1 관찰자에 제공되는 제2 관찰자의 라이브홀로그래픽 콘텐츠이고, 상기 제2 관찰자는 상기 게임 환경에서 상기 게임을 플레이하며, 상기 제1 관찰자로부터 원격으로 게임을 하고 있고, 상기 LF 디스플레이 시스템은상기 제2 관찰 사용자의 이미지 데이터를 수신하고,상기 제1 관찰자 및 상기 제2 관찰자가 상이한 물리적 위치들에서 상기 게임을 동시에 플레이하는 동안, 상기제1 관찰자에게 제공하기 위해 상기 게임 환경 내에 상기 제2 관찰자의 라이브 홀로그래픽 표현을 생성하도록더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_68", "content": "제59항에 있어서, 상기 게임 환경은 카지노이고, 상기 하나 이상의 게임 스테이션들은 슬롯머신 또는 도박 테이블을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7010598", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "카지노와 같은 게임 환경 내에서 홀로그래픽 콘텐츠를 디스플레이하기 위한 라이트필드(LF) 디스플레이 시스템. LF 디스플레이 시스템은, 일 실시예에서, 게임 환경 내에서 LF 디스플레이들의 어레이를 형성하도록 타일링되는 복수의 LF 디스플레이들을 포함하고, LF 디스플레이 시스템은 다양한 센서들(예를 들어, 카메라, 마이크 등)을 통해, 게임 환경, 게임 진행(예를 들어, 승, 패, 점수, 상금 등), 및 행동(예를 들어, 몸짓 언어, 얼굴 표정, 음 성 톤 등)을 통한 각각의 관찰자들의 움직임을 추적 및 기록하는 인공지능(AI) 및 머신러닝(ML) 모델들을 사용하 여, 관찰자의 경험을 사용자 맞춤화할 수 있다. 따라서, 결과는 게임 환경 내에서의 관찰된 행동에 기초하여 관 찰자들과 결합하는 AI 홀로그래픽 캐릭터들을 포함하는, 각각의 관찰자에 대해 사용자 정의되는 게임 환경이다."}
{"patent_id": "10-2022-7010598", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원의 교차 참조 본 출원은 국제출원들 PCT/US2017/042275, PCT/US2017/042276, PCT/US2017/042418, PCT/US2017/042452, PCT/US2017/042462, PCT/US2017/042466, PCT/US2017/042467, PCT/US2017/042468, PCT/US2017/042469, PCT/US2017/042470, 및 PCT/US2017/042679에 관련되며, 이들 모두는 그 전체 내용이 본원에 인용되어 포함된다."}
{"patent_id": "10-2022-7010598", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 개시는 게임 환경에 관한 것이며, 보다 구체적으로는 카지노와 같은 게임 환경 내에서 구현되는 라이트필드 디스플레이에 관한 것이다. 통상적으로, 카지노와 같은 게임 환경은 카지노 고객들을 끌어들이기 위한 고정된 테마들 또는 어트랙션들을 갖 는다. 카지노의 테마 및/또는 어트랙션들은 고객들을 유인하고 그들을 다른 카지노들로부터 분리시키도록 설계 된다. 따라서, 카지노의 테마 및/또는 어트랙션들은 사람들을 그들의 사업에 끌어들이기 위한 그들의 구체적이 고 독특한 끌림이고, 많은 시간과 돈이 이러한 테마들 및 어트랙션들에 일관되는 환상에 대해 소비된다. 그러나, 이러한 테마들 및/또는 어트랙션들은 모든 사람들에게 매력적이지는 않으며, 카지노 고객들은 대개, 특 정 테마 또는 어트랙션에 대해 친근함을 갖는다. 이로 인해, 통상적인 카지노는 특정 카지노의 테마 또는 어트 랙션에는 관심이 없는 다른 잠재적인 고객들을 종종 멀어지게 하면서, 그들의 구체적이고 독특한 끌림에 매력을 느끼는 모든 카지노 고객들 중의 일부로 제한된다. 게임 환경 내에 홀로그래픽 콘텐츠를 디스플레이하기 위한 라이트필드(LF: light field) 디스플레이 시스템이 개시된다. LF 디스플레이 시스템은, 일 실시예에서, 게임 환경 내에서 LF 디스플레이들의 어레이를 형성하도록 타일링되는 복수의 LF 디스플레이들을 포함하고, LF 디스플레이 시스템은 다양한 센서들(예를 들어, 카메라, 마 이크 등)을 통해 게임 환경, 게임 진행(예를 들어, 승, 패, 점수, 상금 등), 및 행동(예를 들어, 몸짓 언어, 얼 굴 표정, 음성 톤 등)을 통한 각각의 관찰자들의 움직임을 추적 및 기록하는 인공지능(AI: artificialintelligence) 및 머신러닝(ML: machine learning) 모델들을 사용하여, 관찰자의 경험을 사용자 맞춤화할 수 있다. 따라서, 결과는 게임 환경 내에서의 그들의 관찰된 행동에 기초하여 관찰자들과 결합하는 AI 홀로그래픽 캐릭터들을 포함하는, 각각의 관찰자에 대해 맞춤화된 게임 환경이다. 예를 들어, 관찰자가 카드 게임에서 여러 번 계속 이기는 경우, 또는 크랩을 플레이하는 동안 한 번에 주사위를 여러 번 성공적으로 던지는 경우, 홀로그 래픽 캐릭터는 그에게 응원의 박수와 코멘트로 환호할 수 있다. 다른 예들에서, 만약 관찰자가 지고 있거나, 감 정적으로 혼란스러운 것으로 보이면, 홀로그래픽 캐릭터는 위로와 격려의 말들을 제공할 수 있다. 따라서, 일 실시예에서, 시스템은 게임 환경 전체에 걸쳐 다양한 카지노 게임들을 플레이할 때, 관찰자를 격려 하는 구경꾼 또는 카지노 직원들로서 홀로그래픽 캐릭터들을 생성할 수 있다. 홀로그래픽 캐릭터들을 통해 관찰 자들을 격려하기 위해, LF 디스플레이 시스템의 추적 시스템은 관찰자로부터 홀로그래픽 캐릭터와의 상호작용들 에 대응하는 이미지 데이터 및/또는 음성 데이터를 획득한다. 이들 상호작용은 관찰자로부터 홀로그래픽 캐릭터 에 대한 구두 인사뿐만 아니라, 관찰자가 홀로그래픽 캐릭터를 무시하는 경우와 같이 관찰자가 인사에 반응하는 방식과 같은 명시적인 상호작용일 수 있다. 따라서, 시스템은 상호작용들과 연관된 감정 또는 의도를 식별하고, AI 및/또는 ML 모델을 이용하여 적절한 응답을 생성한다. 상호작용 및 관찰자에 따라, 홀로그래픽 캐릭터의 응 답은 격려의 말, 흥분의 발언, 애도의 말, 미소, 손뼉을 치는 동작, 일반적인 작은 대화 등이 될 수 있다. 따라 서, LF 디스플레이 시스템은 상이한 게임들, 승패에 대한 관찰자들의 감정 반응, 및 AI 홀로그래픽 캐릭터 상호 작용들에 걸쳐 관찰자들을 추적하고, 시간에 따른 개개인에 대한 사용자 프로파일들을 발전시켜 기존의 데이터 베이스를 발전시킬 수 있으며, 카지노의 고객들과 매칭하도록 AI 모델을 계속 진화시켜 게임 환경 내의 AI 캐릭 터들 및 다른 홀로그래픽 객체들로부터의 감정 반응들을 테스트하고 정교화하는 사회적 정보를 지속적으로 업데 이트할 수 있다."}
{"patent_id": "10-2022-7010598", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "개요 라이트필드(LF: light field) 디스플레이 시스템은 홀로그래픽 콘텐츠 또는 홀로그래픽 캐릭터들을 갖는 게임 테이블 및/또는 콘솔과 같은 홀로그래픽 콘텐츠(예를 들어, 딜러, 팀 동료, 상대방, 인공적인 컴퓨터 생성된 캐 릭터 또는 다른 물리적 위치에서 플레이하는 실제 사람인 동일한 테이블에 있는 동료 플레이어 등)를 사용자에 게 제공하도록 게임 환경, 예를 들어 카지노에서 구현된다. LF 디스플레이 시스템은 게임 환경의 가시 부피에서 하나 이상의 관찰자들에게 보이게 될 하나 이상의 홀로그래픽 객체들을 포함한 홀로그래픽 콘텐츠를 제공하도록 구성되는 LF 디스플레이 어셈블리를 포함한다. 홀로그래픽 개체는 또한 다른 감각 자극(예를 들어, 촉각, 청각, 또는 후각)으로 증강될 수 있다. 예를 들어, LF 디스플레이 시스템 내의 초음파 방출기들은 홀로그래픽 객체의 일부 또는 전부에 대한 촉각 표면을 제공하는 초음파 압력파를 방출할 수 있다. 홀로그래픽 콘텐츠는 추가적인 시각적 콘텐츠(즉, 2D 또는 3D 시각 콘텐츠)를 포함할 수 있다. 결맞은(cohesive) 경험이 인에이블되는 것을 보 장하기 위한 방출기들의 조정은 다수의 방출기 구현들에서의 시스템의 일부이다(즉, 정확한 햅틱 느낌 및 감각 자극들을 임의의 주어진 시점에 제공하는 홀로그래픽 객체들). LF 디스플레이 어셈블리는 홀로그래픽 콘텐츠를 생성하기 위한 하나 이상의 LF 디스플레이 모듈들을 포함할 수 있다. LF 디스플레이 시스템은 홀로그래픽 객체들이 생성된 게임 환경의 많은 실시예들에서 상이한 경험들을 제공하도 록 구성될 수 있다. 예를 들어, LF 디스플레이 시스템은 게임, 도박을 플레이할 때, 및/또는 게임 환경을 통해 이동할 때 사용자의 게임 경험을 격려하고, 보조하고, 향상시키는 홀로그래픽 게임(또는 홀로그래픽 콘텐츠로 증강된 게임)의 전체 생태계로서 구현될 수 있다. LF 디스플레이 시스템은 센서 융합, 인공지능(AI: artificial intelligence) 및 머신러닝(ML: machine learning)을 이용하여 사용자의 게임 성과, 움직임, 제스처(예를 들어, 몸짓 언어, 얼굴 표정, 발성 분석 등), 및/또는 홀로그래픽 디스플레이 표면들을 갖거나 이를 통해 다른 행동을 추적 및 기록함으로써 이를 달성할 수 있다. 또한, LF 디스플레이에 의해 생성되는 홀로그래픽 객체들은 사용자들이 매어 있게 하고 승패 이후에도 플레이하게 하기 위해 격려하면서 사용자들에게 말하는 반응형 캐릭 터들을 포함할 수 있다. LF 디스플레이 어셈블리는 단일 측면의 또는 다중 측면의 이음매 없는(seamless) 표면 환경을 형성할 수 있다. 예를 들어, LF 디스플레이 어셈블리는 게임 환경의 인클로저를 둘러싸는, 다중 측면의 이음매 없는 표면 환경을 형성할 수 있다. LF 디스플레이 시스템의 관찰자들은 LF 디스플레이 시스템에 의해 생성된 홀로그래픽 콘텐츠로 부분적으로 또는 완전히 변환될 수 있는 인클로저(enclosure) 내에 들어갈 수 있다. 홀로그래픽 콘텐츠는 인클 로저 내에 존재하는 물리적 객체들(예를 들어, 의자들 또는 벤치들)을 증강시키거나 향상시킬 수 있다. 또한, 관찰자들은 인클로저 내부를 자유롭게 응시하여 안경 장치 및/또는 헤드셋을 필요로 하지 않고도 홀로그래픽 콘 텐츠를 볼 수 있다. 또한, 게임 환경 인클로저는 LF 디스플레이 어셈블리의 LF 디스플레이 모듈들에 의해 커버 되는 표면들을 가질 수 있다. 예를 들어, 일부 예에서 벽, 천장 및 바닥의 일부 또는 전부가 LF 디스플레이 모 듈들로 덮여진다. LF 디스플레이 시스템은 추적 시스템 및/또는 감각 피드백 어셈블리를 통해 입력을 수신할 수 있다. 입력에 기 초하여, LF 디스플레이 시스템은 관련 구성요소들에 피드백을 제공할 뿐만 아니라 홀로그래픽 콘텐츠를 조정할 수 있다. 또한, LF 디스플레이 시스템은 각각의 관찰자에게 개인화된 콘텐츠를 제공하기 위해 각각의 관찰자를 식별하기 위한 관찰자 프로파일링 시스템을 포함할 수 있다. 관찰자 프로파일링 시스템은 홀로그래픽 콘텐츠를 개인화하기 위한, 후속 방문에 사용될 수 있는 게임 환경에 대한 관찰자의 방문에 관한 다른 정보를 더 기록할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 시스템이 적어도 하나의 유형의 에너지를 동시에 방출하면서도, 동 시에, 관찰자들에게 반응하고 반응형 경험을 생성하기 위해 적어도 하나의 유형의 에너지를 흡수할 수 있게 하 는 구성요소들을 포함할 수 있다. 예를 들어, LF 디스플레이 시스템은 관찰하기 위한 홀로그래픽 객체들뿐만 아니라 햅틱 감각을 위한 초음파를 모두 방출할 수 있고, 동시에, 관찰자들에 의한 터치 반응을 검출하기 위해 초 음파들을 흡수하는 동안 관찰자들 및 다른 장면 분석을 추적하기 위한 이미징 정보를 흡수할 수 있다. 예를 들 어, 이러한 시스템은 관찰자에 의해 가상으로 \"터치되는\" 경우, 터치 자극에 따라 그의 \"행동\"을 수정하는 홀로 그래픽 캐릭터를 투사할 수 있다. 주변 환경의 에너지 감지를 수행하는 디스플레이 시스템 구성요소들은 에너지 를 방출하고 흡수하는 양방향 에너지 구성요소를 통해 디스플레이 표면에 통합될 수 있거나, 초음파 스피커 및 카메라와 같은 이미징 캡처 장치와 같은, 디스플레이 표면과 분리되어 있는 전용 센서들일 수 있다. LF 디스플레이 시스템은 또한, 적어도 LF 디스플레이 시스템의 가시 부피 내에서 관찰자들의 이동을 추적하기 위한 시스템을 포함할 수 있다. 관찰자들의 추적된 움직임은 몰입형 게임 경험을 향상시키기 위해 사용될 수 있 다. 예를 들어, LF 디스플레이 시스템은 홀로그래픽 콘텐츠와의 관찰자 상호작용(예를 들어, 홀로그래픽 버튼을 누르는 것)을 용이하게 하기 위해 추적 정보를 사용할 수 있다. LF 디스플레이 시스템은 추적된 정보를 사용하 여 홀로그래픽 객체에 대한 손가락 위치를 모니터링할 수 있다. 예를 들어, 홀로그래픽 객체는 관찰자에 의해 \"눌러질(push)\" 수 있는 버튼일 수 있다. LF 디스플레이 시스템은 상기 버튼에 대응하고 상기 버튼과 실질적으 로 동일한 공간을 점유하는 촉각 표면을 생성하기 위해 초음파 에너지를 투사할 수 있다. LF 디스플레이 시스템 은 추적 정보를 사용하여, 관찰자에 의해 \"눌러질\" 때 상기 버튼을 동적으로 이동시키는 것에 따라 촉각 표면의 위치를 동적으로 이동시킬 수 있다. LF 디스플레이 시스템은 추적 정보를 사용하여, 눈을 마주치고/마주치거나 또는 관찰자들과 다른 방식으로 상호작용하는 홀로그래픽 객체를 렌더링할 수 있다. LF 디스플레이 시스템은 추 적 정보를 사용하여, 관찰자를 \"터치\"하는 홀로그래픽 객체를 렌더링할 수 있는데, 여기서 초음파 스피커는 홀 로그래픽 객체가 터치를 통해 관찰자와 상호작용할 수 있는 촉각 표면을 생성한다. 라이트필드 디스플레이 시스템 개요 도 1은 하나 이상의 실시예들에 따른, 홀로그래픽 객체를 나타내는 라이트필드(LF, light field) 디스플레 이 모듈의 도면이다. LF 디스플레이 모듈은 라이트필드(LF) 디스플레이 시스템의 일부이다. LF 디스플레이 시스템은 하나 이상의 LF 디스플레이 모듈들을 사용하여 적어도 하나의 홀로그래픽 객체를 포함하는 홀로그래픽 콘텐츠를 제공한다. LF 디스플레이 시스템은 하나 또는 다수의 관찰자들에게 홀로그래픽 콘텐츠를 제공할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 또한 다른 감각 콘텐츠(예를 들어, 터치, 오디오, 냄새, 온도 등)로 홀로그래픽 콘텐츠를 증강시킬 수 있다. 예를 들어, 이하에서 설명되는 바와 같이, 포커싱된 초음파 음파의 투사는 홀로그래픽 객체의 일부 또는 전부의 표면을 시뮬레이션할 수 있는 중간-공기(mid-air)의 촉감을 생성할 수 있다. LF 디스플레이 시스템은 하나 이상의 LF 디스플레이 모듈들을 포함하고, 이는 도 2 내지 도 5와 관련하여 아래에서 상세히 설명된다. LF 디스플레이 모듈은 홀로그래픽 객체들(예를 들어, 홀로그래픽 객체)을 하나 이상의 관찰자들(예를 들어, 관찰자)에 제공하는 홀로그래픽 디스플레이이다. LF 디스플레이 모듈은 에너지 장치층(예를 들 어, 방출형 전자적 디스플레이 또는 음향 투사 장치) 및 에너지 도파층(예를 들어, 광학 렌즈 어레이)을 포함한 다. 추가적으로, LF 디스플레이 모듈은 다수의 에너지 소스들 또는 검출기들을 함께 조합하여 단일 표면을 형성하기 위해, 에너지 중계(relay) 층을 포함할 수 있다. 높은 레벨에서, 에너지 장치(device) 층은 에너지(예 를 들어, 홀로그래픽 콘텐츠)를 생성한 다음, 에너지 도파층을 이용하여 하나 이상의 4차원(4D) 라이트필드 기 능들에 따른 공간 내의 영역으로 이를 유도한다. LF 디스플레이 모듈은 또한 하나 이상의 유형의 에너지를 동시에 투사 및/또는 감지할 수 있다. 예를 들어, LF 디스플레이 모듈은 가시 부피 내의 초음파 촉각 표면 뿐만 아니라 홀로그래픽 이미지를 투사할 수 있는 한편, 동시에 가시 부피로부터 이미징 데이터를 검출할 수 있 다. LF 디스플레이 모듈의 동작은 도 2 내지 도 3과 관련하여 아래에서 더 상세히 설명된다. LF 디스플레이 모듈은 하나 이상의 4D 라이트필드 기능들(예를 들어, 플렌옵틱(plenoptic) 기능으로부터 도출된)을 이용하여 홀로그래픽 객체 부피 내에 홀로그래픽 객체들을 생성한다. 홀로그래픽 객체는 3차원 (3D), 2차원(2D), 또는 이들의 일부 조합일 수 있다. 또한, 홀로그래픽 객체들은 다색(예를 들어, 풀(full) 컬 러)일 수 있다. 홀로그래픽 객체는 스크린 평면의 전방에, 스크린 평면 뒤에 투사되거나, 스크린 평면에 의해 분할될 수 있다. 홀로그래픽 객체는 홀로그래픽 객체 부피 내의 어디에서나 인식되도록 제공될 수 있 다. 홀로그래픽 객체 부피 내의 홀로그래픽 객체는 관찰자에게 공간 내에 떠있는 것처럼 보일 수 있 다. 홀로그래픽 객체 부피는 홀로그래픽 객체가 관찰자에 의해 인지될 수 있는 부피를 나타낸다. 홀로그 래픽 객체 부피는 홀로그래픽 객체가 디스플레이 영역의 평면 앞에 표시될 수 있도록 디스플레이 영 역의 표면 앞에서(즉, 관찰자를 향하여) 연장될 수 있다. 또한, 홀로그래픽 객체 부피는 디스플레이 영역의 표면 뒤에(즉, 관찰자로부터 멀어지게) 연장될 수 있어서, 홀로그래픽 객체가 마치 디스 플레이 영역의 평면 뒤에 있는 것처럼 표시될 수 있다. 즉, 홀로그래픽 객체 부피는 디스플레이 영역 으로부터 기원하는(예를 들어, 투사되는) 그리고 홀로그래픽 객체를 생성하도록 수렴하는 모든 광선을 포 함할 수 있다. 여기서, 광선은 디스플레이 표면의 전방에, 디스플레이 표면에, 또는 디스플레이 표면 뒤에 있는 지점에서 수렴할 수 있다. 보다 단순하게, 홀로그래픽 객체 부피는 홀로그래픽 객체가 관찰자에 의해 인식 될 수 있는 모든 부피를 내포한다. 가시 부피는 LF 디스플레이 시스템에 의해 홀로그래픽 객체 부피 내에 표시되는 홀로그래픽 객체들 (예를 들어, 홀로그래픽 객체)이 완전히 보일 수 있는 공간의 부피이다. 홀로그래픽 객체들은 실제 객체들 과 구별할 수 없도록 홀로그래픽 객체 부피 내에 표시될 수 있고, 가시 부피 내에서 보일 수 있다. 홀로그래픽 객체는 물리적으로 존재할 경우에 해당 객체의 표면으로부터 생성되는 것과 동일한 광선을 투사함으 로써 형성된다. 일부 경우에, 홀로그래픽 객체 부피 및 대응하는 가시 부피는 단일 관찰자를 위해 설계되도록 상대적 으로 작을 수 있다. 다른 실시예들에서, 예를 들어, 도 4 및 도 6과 관련하여 상세히 후술하는 바와 같이, LF 디스플레이 모듈들은 대규모 관찰자들(예컨대, 1명 내지 수천 명)을 수용할 수 있는 더 큰 홀로그래픽 객체 부 피 및 대응하는 가시 부피들을 생성하도록 확장 및/또는 타일링될 수 있다. 본 개시에서 제공된 LF 디스플레이 모듈들은, LF 디스플레이의 전체 표면이 홀로그래픽 이미징 광학부(holographic imaging optics)를 포함하고, 비활성 또는 데드(dead) 공간이 없으며, 베젤(bezel)이 필요하지 않도록 제조될 수 있다. 이러한 실시예들에서, LF 디스플레이 모듈들은 이미징 영역이 LF 디스플레이 모듈들 사이의 이음매(seam)에 걸쳐 연속적이도록 타일링 될 수 있고, 타일형 모듈들 사이의 접합선은 눈의 시력으로는 실질적으로 검출될 수 없다. 특히, 일부 구성들에 서, 디스플레이 표면의 일부는 홀로그래픽 이미징 광학부를 포함하지 않을 수 있지만, 이들은 본원에서 상세히 설명되지 않는다. 가시 부피의 플렉시블한 크기 및/또는 형상은 관찰자로 하여금 가시 부피 내에 제한되지 않게 할 수 있다. 예를 들어, 관찰자는 가시 부피 내에서 다른 위치로 이동할 수 있고, 대응하는 관점으로부터 홀로그래픽 객체의 상이한 뷰를 볼 수 있다. 예를 들어, 도 1을 참조하면, 관찰자는 홀로그래픽 객체 가 돌고래의 정면인 것처럼 보이도록 홀로그래픽 객체에 대해 제1 위치에 있다. 관찰자는 돌고 래의 상이한 뷰를 보기 위해 홀로그래픽 객체에 대해 다른 위치로 이동할 수 있다. 예를 들어, 관찰자 는, 관찰자가 실제 돌고래를 보고 있고, 돌고래의 상이한 측면을 보기 위해 실제 돌고래에 대한 자신 의 상대적 위치를 바꾸는 것과 같이, 돌고래의 좌측, 돌고래의 우측 등을 보도록 이동할 수 있다. 일부 실시예 들에서, 홀로그래픽 객체는 홀로그래픽 객체에 대해 시야에서 차단되지 않은 선(즉, 객체/사람에 의 해 차단되지 않음)을 갖는, 가시 부피 내의 모든 관찰자들에게 보일 수 있다. 이들 관찰자는 홀로그래픽 객체의 상이한 관점을 보기 위해 가시 부피 내에서 움직일 수 있도록, 제한되지 않을 수 있다. 따라서, LF 디스플레이 시스템은 마치 홀로그래픽 객체들이 물리적으로 존재하는 것처럼 복수의 제한되지 않은 관찰자들이 실세계 공간에서 홀로그래픽 객체들의 상이한 관점들을 동시에 볼 수 있도록, 홀로그래픽 객체들을 제공할 수 있다. 이와 달리, 일반적으로, 통상적인 디스플레이(예를 들어, 입체, 가상 현실, 증강 현실 또는 혼합 현실)에서는 콘텐츠를 보기 위해서 각각의 관찰자가 특정 종류의 외부 장치(예를 들어, 3-D 안경, 근안(near-eye) 디스플레 이, 또는 헤드마운트형 디스플레이)를 착용할 필요가 있다. 추가적으로 및/또는 대안적으로, 통상적인 디스플레 이들은 관찰자가(예를 들어, 디스플레이에 대해 고정된 위치를 갖는 의자에서) 특정 가시 위치로 제한될 것을 필요로 할 수도 있다. 예를 들어, 스테레오스코픽 디스플레이에 의해 도시된 객체를 관찰할 때, 관찰자는 객체 상에서보다는 디스플레이 표면 상에 항상 초점을 맞추고, 디스플레이는 항상 그 인식된 객체 주위를 이동하려고 시도하는 관찰자를 따르는 객체의 두 개의 뷰들만을 제공할 것인데, 이는 그 객체에 대한 인식의 왜곡을 초래할 것이다. 그러나, 라이트필드 디스플레이를 이용하면, LF 디스플레이 시스템에 의해 제공된 홀로그래픽 객체의 관찰자들은 홀로그래픽 객체를 보기 위해서 외부 장치를 착용할 필요가 없고, 특정 위치에 국한될 필요도 없다. LF 디스플레이 시스템은, 특별한 아이웨어(eyewear), 안경, 또는 헤드마운트형 액세서리에 대한 어떠한 요건도 없이, 물리적 객체가 관찰자들에게 보일 수 있는 것과 거의 동일한 방식으로 관찰자들에게 보이는 방식으로 홀 로그래픽 객체를 제공한다. 또한, 관찰자는 가시 부피 내의 임의의 위치로부터 홀로그래픽 콘텐츠를 볼 수 있다. 특히, 홀로그래픽 객체 부피 내의 홀로그래픽 객체들에 대한 잠재적인 위치들은 부피의 크기에 의해 제한 된다. 홀로그래픽 객체 부피의 크기를 증가시키기 위해서, LF 디스플레이 모듈의 디스플레이 영역의 크기가 증가될 수 있고/있거나, 다수의 LF 디스플레이 모듈들이 이음매 없는 디스플레이 표면을 형성하 는 방식으로 함께 타일링될 수 있다. 이음매 없는 디스플레이 표면은 개별적인 LF 디스플레이 모듈들의 디스플 레이 영역들보다 더 큰 유효 디스플레이 영역을 갖는다. LF 디스플레이 모듈들을 타일링(tiling)하는 것에 관한 일부 실시예들은 도 4 및 도 6과 관련하여 이하에서 설명된다. 도 1에 도시된 바와 같이, 디스플레이 영역(15 0)은 피라미드인 홀로그래픽 객체 부피를 야기하는 직사각형이다. 다른 실시예들에서, 디스플레이 영역은 소정의 다른 형상(예를 들어, 육각형)을 가질 수 있으며, 이는 또한 대응하는 가시 부피의 형상에 영향을 미친 다. 또한, 상기 설명은 LF 디스플레이 모듈과 관찰자 사이에 있는 홀로그래픽 객체 부피의 일부 내 에 홀로그래픽 객체를 제공하는 것에 초점을 맞추지만, LF 디스플레이 모듈은 디스플레이 영역 의 평면 뒤에서 홀로그래픽 객체 부피에 콘텐츠를 추가적으로 제공할 수 있다. 예를 들어, LF 디스플레이 모듈은, 디스플레이 영역이 홀로그래픽 객체가 점프하고 있는 바다의 표면인 것으로 보이게 할 수 있다. 그리고 디스플레이된 콘텐츠는 물 아래에 있는 해양 생물을 보기 위해 관찰자가 디스플레이된 표 면을 관통하여 볼 수 있도록 할 수 있다. 또한, LF 디스플레이 시스템은 디스플레이 영역의 평면의 후방 및 전방을 포함하는 홀로그래픽 객체 부피 주위로 이음매 없이 이동하는 콘텐츠를 생성할 수 있다. 도 2a는 하나 이상의 실시예들에 따른, LF 디스플레이 모듈의 일 부분의 일 단면을 도시한다. LF 디 스플레이 모듈은 LF 디스플레이 모듈일 수 있다. 다른 실시예들에서, LF 디스플레이 모듈은 디 스플레이 영역과 다른 디스플레이 영역 형상을 갖는 다른 LF 디스플레이 모듈일 수 있다. 예시된 실시예에 서, LF 디스플레이 모듈은 에너지 장치층, 에너지 중계층, 및 에너지 도파층을 포함한다. LF 디스플레이 모듈의 일부 실시예들은 여기에서 설명되는 것들과는 상이한 구성요소들을 갖는다. 예를 들 어, 일부 실시예들에서, LF 디스플레이 모듈은 에너지 중계층을 포함하지 않는다. 유사하게, 기능들 은 본원에 설명된 것과 다른 방식으로 구성요소들 중에 분배될 수 있다. 여기에서 설명되는 디스플레이 시스템은 실세계에서 일반적으로 물체를 둘러싸고 있는 에너지를 복제하는 에너 지의 방출을 제공한다. 여기서, 방출된 에너지는 디스플레이 표면 상의 모든 좌표로부터 특정 방향을 향해 지향 된다. 디스플레이 표면으로부터 지향된 에너지는 많은 광선들이 수렴될 수 있게 하며, 이에 의해, 홀로그래픽 객체들을 생성할 수 있다. 가시광의 경우, 예를 들어, LF 디스플레이는 홀로그래픽 객체 부피 내의 임의의 지점 에 수렴할 수 있는 매우 많은 수의 광선을 투사할 것이고, 따라서 이들은, 관찰자의 관점에서는, 투사되는 객체 보다 더 멀리 위치한 이 공간의 영역에 위치된 실세계 객체의 표면으로부터 온 것처럼 보일 것이다. 이런 식으 로, LF 디스플레이는 관찰자의 관점으로부터 그러한 물체의 표면을 벗어나는 반사된 광의 광선들을 생성하고 있 다. 관찰자 관점은 임의의 주어진 홀로그래픽 객체 상에서 변할 수 있고, 관찰자는 해당 홀로그래픽 객체의 상 이한 뷰를 볼 것이다. 에너지 장치층은 하나 이상의 전자 디스플레이(예를 들어, OLED와 같은 발광 디스플레이) 및 본원에 설명 된 바와 같은 하나 이상의 다른 에너지 투사 및/또는 에너지 수신 장치를 포함한다. 하나 이상의 전자 디스플레 이들은 (예를 들어, LF 디스플레이 시스템의 컨트롤러로부터) 디스플레이 명령들에 따른 콘텐츠를 디스플레이하 도록 구성된다. 하나 이상의 전자 디스플레이는 각각 개별적으로 제어되는 강도(intensity)를 갖는 복수의 픽셀 을 포함한다. 발광 LED 및 OLED 디스플레이와 같은 여러 유형의 상업용 디스플레이가 LF 디스플레이에 사용될 수 있다. 에너지 장치층은 또한, 하나 이상의 음향 투사 장치 및/또는 하나 이상의 음향 수신 장치를 포함할 수 있 다. 음향 투사 장치는 홀로그래픽 객체를 보완하는 하나 이상의 압력파를 생성한다. 생성된 압력파는 예를 들어, 가청, 초음파, 또는 이들의 일부 조합일 수 있다. 초음파 압력파들의 어레이는 (예를 들어, 홀로그래픽 객체의 표면에서) 부피 촉각 감각을 위해 사용될 수 있다. 가청 압력파는 홀로그래픽 객체를 보완할 수 있는 오디오 콘텐츠(예를 들어, 몰입형 오디오)를 제공하기 위해 사용된다. 예를 들어, 홀로그래픽 객체 가 돌고래라고 가정하면, 하나 이상의 음향 투사 장치는 관찰자가 홀로그래픽 객체를 터치할 수 있도록 돌고래의 표면과 동일하게 위치하는 촉각 표면을 생성하고, 클릭, 처핑(chirpping) 또는 채터 (chatter)와 같은 돌고래의 소리에 대응하는 오디오 콘텐츠를 제공하기 위해 사용될 수 있다. 음향 수신 장치 (예를 들어, 마이크 또는 마이크 어레이)는 LF 디스플레이 모듈의 로컬 영역 내의 초음파 및/또는 가청 압 력파를 모니터링하도록 구성될 수 있다. 에너지 장치층은 또한, 하나 이상의 이미징 센서들을 포함할 수 있다. 이미징 센서는 가시광 대역에서의 광에 민감할 수 있고, 일부 경우에는 다른 대역(예를 들어, 적외선)에서의 광에 민감할 수 있다. 이미징 센서는예를 들어 시모스(CMOS, complementary metal oxide semi-conductor) 어레이, 전하 결합 소자(CCD), 광검출기 들의 어레이, 광을 포획하는 몇몇 다른 센서, 또는 이들의 일부 조합일 수 있다. LF 디스플레이 시스템은 관찰 자들의 위치 추적을 위해 하나 이상의 이미징 센서에 의해 캡처된 데이터를 사용할 수 있다. 에너지 중계층은 에너지 장치층 및 에너지 도파층 사이에서 에너지(예를 들어, 전자기 에너지, 기계적 압력파 등)를 중계한다. 에너지 중계층은 하나 이상의 에너지 중계 요소들을 포함한다. 각각 의 에너지 중계 요소는 제1 표면 및 제2 표면을 포함하고, 이는 2개의 표면들 사이의 에너지를 중계 한다. 각각의 에너지 중계 요소의 제1 표면은 하나 이상의 에너지 장치들(예를 들어, 전자 디스플레이 또 는 음향 투사 장치)에 연결될 수 있다. 에너지 중계 요소는 예를 들어, 유리, 탄소, 광섬유, 광학 필름, 플라스 틱, 폴리머, 또는 이들의 일부 조합으로 구성될 수 있다. 추가적으로, 일부 실시예들에서, 에너지 중계 요소는 제1 표면과 제2 표면 사이를 통과하는 에너지의 확대(증가 또는 감소)를 조절할 수 있다. 중계부가 확대를 제공하는 경우, 중계부는 테이퍼(taper)라고 불리는 접합된 테이퍼형(tapered) 중계부들의 어레이의 형 태를 취할 수 있으며, 테이퍼의 일 단부의 영역은 반대쪽 단부보다 실질적으로 클 수 있다. 테이퍼의 큰 단부는 이음매 없는 에너지 표면을 형성하기 위해 함께 접합할 수 있다. 하나의 장점은 다수의 디스플레이의 베젤 과 같은 다수의 에너지 소스의 기계적인 엔벨로프(envelope)를 수용하기 위해, 각각의 테이퍼의 다수의 작은 단 부들 상에 공간이 생성된다는 것이다. 이러한 여분의 공간은 에너지 소스가 작은 테이퍼 면 위에 나란히 배치될 수 있게 하며, 각각의 에너지 소스는 작은 테이퍼 표면으로 에너지를 지향시키고 큰 이음매 없는 에너지 표면으 로 중계되도록 하는 활성(active) 영역을 가진다. 테이퍼형 중계를 사용하는 또 다른 장점은 테이퍼들의 큰 단 부에 의해 형성된 조합된 이음매 없는 에너지 표면 상에 비-이미징 데드(dead) 공간이 존재하지 않는다는 점이 다. 테두리 또는 베젤이 존재하지 않으며, 따라서 이음매 없는 에너지 표면이 함께 타일링되어, 눈의 시력에 따 라서는 실질적으로 이음매가 없는 더 큰 표면을 형성할 수 있다. 인접한 에너지 중계 요소들의 제2 표면들은 함께 모여서 에너지 표면을 형성한다. 일부 실시예들에서, 인 접한 에너지 중계 요소들의 엣지들 사이의 분리는, 예를 들어, 20/40 비전을 갖는 인간의 눈의 시력에 의해 정 의되는 바와 같은 인지 가능한 최소 윤곽보다 더 작고, 따라서 에너지 표면은 가시 부피 내의 관찰자 의 관점으로부터 효과적으로 매끄럽게(seamless) 된다. 일부 실시예들에서, 하나 이상의 에너지 중계 요소들은 에너지 국소화(energy localization)를 나타내며, 여기 서 표면들(265, 270)에 실질적으로 수직한 세로(longitudinal) 방향에서의 에너지 전달 효율은 수직한 가로 (transverse) 평면에서의 전달 효율보다 훨씬 더 높고, 에너지 밀도는 에너지 파동이 표면과 표면 사 이에서 전파될 때 이 가로 평면 내에 매우 국소화된다. 이러한 에너지의 국소화는 이미지와 같은 에너지 분배가 해상도에서의 어떠한 큰 손실 없이도 이들 표면들 사이에서 효율적으로 중계될 수 있게 한다. 에너지 도파층은 에너지 도파층 내의 도파(waveguide) 요소들을 사용하여 에너지 표면 상의 위 치(예를 들어, 좌표)로부터, 디스플레이 표면으로부터 홀로그래픽 가시 부피까지의 바깥으로의 특정 전파 경로로 에너지를 지향시킨다. 일 예로서, 전자기 에너지의 경우, 에너지 도파층 내의 도파 요소들은 가시 부피를 관통하여 상이한 전파 방향들을 따라 이음매 없는 에너지 표면 상의 위치들로부터 광을 지향 시킨다. 다양한 예들에서, 광은 홀로그래픽 객체 부피 내에 홀로그래픽 객체를 형성하기 위해 4D 라 이트필드 기능에 따라 지향된다. 에너지 도파층 내의 각각의 도파 요소는, 예를 들어, 하나 이상의 구성요소들로 구성된 렌즈릿(lenslet)일 수 있다. 일부 구성들에서, 렌즈릿은 볼록 렌즈일 수 있다. 볼록 렌즈는 구면, 비구면 또는 자유 형태인 표면 프로파일을 가질 수 있다. 추가적으로, 일부 실시예들에서, 도파 요소들의 일부 또는 전부는 하나 이상의 추가 적인 광학 요소들을 포함할 수 있다. 추가적인 광학 요소는 예를 들어, 배플(baffle), 볼록 렌즈, 오목 렌즈, 구면 렌즈, 비구면 렌즈, 자유 형태 렌즈, 액정 렌즈, 액체 렌즈, 굴절 요소, 회절 요소, 또는 이들의 일부 조 합과 같은 에너지-억제 구조일 수 있다. 일부 실시예들에서, 렌즈릿 및/또는 추가적인 광학 요소들 중 적어도 하나는 자신의 광학 출력을 동적으로 조절할 수 있다. 예를 들어, 렌즈릿은 액정 렌즈 또는 액체 렌즈일 수 있 다. 렌즈릿 및/또는 적어도 하나의 추가적인 광학 요소의 표면 프로파일의 동적 조정은 도파 요소로부터 투사되 는 광의 추가적인 지향성 제어를 제공할 수 있다. 도시된 예에서, LF 디스플레이의 홀로그래픽 객체 부피는 광선 및 광선에 의해 형성되는 경계를 갖지만, 다른 광선에 의해 형성될 수도 있다. 홀로그래픽 객체 부피는 에너지 도파층의 전방(즉, 관 찰자 쪽으로) 및 후방으로(즉, 관찰자로부터 멀리) 연장되는 연속적인 부피이다. 도시된 예에서, 광 선 및 광선은 사용자에 의해 인지될 수 있는 디스플레이 표면의 법선에 대해 가장 높은 각도로LF 디스플레이 모듈의 서로 반대되는 엣지들로부터 투사되지만, 이들은 다른 투사된 광선들일 수 있다. 광 선들은 디스플레이의 시야를 정의하고, 따라서 홀로그래픽 가시 부피에 대한 경계를 정의한다. 일부 경우 에, 광선들은 전체 디스플레이가 비네팅(vignetting) 없이 관찰될 수 있는 홀로그래픽 가시 부피(예를 들어, 이 상적인 가시 부피)를 정의한다. 디스플레이의 시야가 증가함에 따라, 광선과 광선의 수렴 지점이 디 스플레이에 더 근접할 것이다. 따라서, 더 큰 시야를 갖는 디스플레이는 관찰자가 더 가까운 가시 거리에 서 전체 디스플레이를 볼 수 있게 한다. 또한, 광선(256, 257)은 이상적인 홀로그래픽 객체 부피를 형성할 수 있다. 이상적인 홀로그래픽 객체 부피 내에 제공된 홀로그래픽 객체는 가시 부피의 임의의 위치에서 볼 수 있다. 일부 예들에서, 홀로그래픽 객체들은 가시 부피의 일부에만 제공될 수 있다. 즉, 홀로그래픽 객체 부피는 임의의 수의 가시 서브부피(예를 들어, 가시 서브부피)로 분할될 수 있다. 또한, 홀로그래픽 객체는 홀로 그래픽 객체 부피의 외부에 투사될 수 있다. 예를 들어, 홀로그래픽 객체는 홀로그래픽 객체 부피 의 외부에 제공된다. 홀로그래픽 객체가 홀로그래픽 객체 부피의 외부에 제공되기 때문에, 이는 가시 부피의 모든 위치에서 보이지 않는다. 예를 들어, 홀로그래픽 객체는 가시 서브부피의 위 치에서 보일 수 있지만, 관찰자의 위치에서는 보이지 않을 수 있다. 예를 들어, 도 2b를 참조하면, 상이한 가시 서브부피들로부터의 홀로그래픽 콘텐츠를 보는 것이 예시된다. 도 2b는 하나 이상의 실시예들에 따른 LF 디스플레이 모듈의 일 부분의 단면을 도시한다. 도 2b의 단면은 도 2a의 단면과 동일하다. 그러나, 도 2b는 LF 디스플레이 모듈로부터 투사된 상이한 광선들의 세트를 도시한 다. 광선과 광선은 여전히 홀로그래픽 객체 부피 및 가시 부피를 형성한다. 그러나, 도시 된 바와 같이, LF 디스플레이 모듈의 상부 및 LF 디스플레이 모듈의 하부로부터 투사된 광선들은 가 시 부피 내에서 다양한 가시 서브부피들(예를 들어, 가시 서브부피들(290A, 290B, 290C, 및 290D))을 형성 하도록 오버랩된다. 제1 가시 서브부피(예를 들어, 290A) 내의 관찰자는 다른 가시 서브부피들(예를 들어, 290B, 290C, 및 290D) 내의 관찰자들이 인지할 수 없는 홀로그래픽 객체 부피 내에 제공된 홀로그래픽 콘 텐츠를 인지할 수 있다. 더 간단히, 도 2a에 도시된 바와 같이, 홀로그래픽 객체 부피는 홀로그래픽 객체들이 가시 부피 내의 관찰자들(예를 들어, 관찰자)에 의해 인지될 수 있도록 LF 디스플레이 시스템에 의해 제공될 수 있는 부피 이다. 이런 식으로, 가시 부피는 이상적인 가시 부피의 일 예이고, 홀로그래픽 객체 부피는 이상적인 객체 부피의 일 예이다. 그러나, 다양한 구성들에서, 다른 예시적인 가시 부피들에서의 관찰자들이 홀로그래픽 콘텐츠를 인지할 수 있도록, 관찰자들은 다른 예시적인 홀로그래픽 객체 부피들에서 LF 디스플레이 시스템(20 0)에 의해 제공되는 홀로그래픽 객체들을 인지할 수 있다. 보다 일반적으로, \"눈-선(eye-line) 가이드라인\"은 LF 디스플레이 모듈로부터 투사된 홀로그래픽 콘텐츠를 볼 때 적용된다. 눈-선(eye-line) 가이드라인은 관찰자 의 눈 위치 및 보고 있는 홀로그래픽 객체에 의해 형성되는 선이 LF 디스플레이 표면과 교차해야 한다고 강조한 다. LF 디스플레이 모듈에 의해 제공되는 홀로그래픽 콘텐츠를 보는 경우, 관찰자의 각각의 눈은 홀로그 래픽 객체의 상이한 관점을 보게 되는데, 그 이유는 홀로그래픽 콘텐츠가 4D 라이트필드 기능에 따라 제공 되기 때문이다. 또한, 관찰자가 가시 부피 내에서 이동함에 따라, 그는 또한 가시 부피 내의 다 른 관찰자들과 마찬가지로 홀로그래픽 객체의 상이한 관점들을 볼 수 있다. 통상의 기술자에 의해 이해되 는 바와 같이, 4D 라이트필드 기능은 당업계에 잘 알려져 있으며, 본원에서는 더 상세히 설명되지 않을 것이다. 본원에 더 상세하게 설명되는 바와 같이, 일부 실시예들에서, LF 디스플레이는 하나 이상의 유형의 에너지를 투 사할 수 있다. 예를 들어, LF 디스플레이는 예를 들어, 기계적 에너지 및 전자기 에너지와 같은 2가지 유형의 에너지를 투사할 수 있다. 이러한 구성에서, 에너지 중계층은, 에너지 표면에서 함께 인터리빙 (interleaved)되되 에너지가 2개의 상이한 에너지 장치층들로 중계되도록 분리되는, 2개의 개별적인 에너 지 중계부들을 포함한다. 여기서, 하나의 중계부는 전자기 에너지를 전달하도록 구성될 수 있는 반면, 다른 중 계부는 기계적 에너지를 수송하도록 구성될 수 있다. 일부 실시예들에서, 기계적 에너지는 에너지 도파층 상의 전자기 도파 요소들 사이의 위치들로부터 투사될 수 있고, 하나의 전자기 도파 요소로부터 다른 전자기 도 파 요소로 광이 전송되는 것을 억제하는 구조들의 형성을 돕는다. 일부 실시예들에서, 에너지 도파층은 또 한 컨트롤러로부터의 디스플레이 명령들에 따른 특정 전파 경로들을 따라서 집속된 초음파를 수송하는 도파 요 소들을 포함할 수 있다. 다른 실시예들(도시되지 않음)에서, LF 디스플레이 모듈은 에너지 중계층을 포함하지 않음에 유의해 야 한다. 이 경우에, 에너지 표면은 에너지 장치층 내에 하나 이상의 인접한 전자 디스플레이를 사용 하여 형성된 방출 표면이다. 그리고 일부 실시예들에서, 인접한 전자 디스플레이들의 엣지들 사이의 구분은, 에 너지 표면이 가시 부피 내의 관찰자의 관점으로부터 효과적으로 이음매 없도록(seamless), 사람 눈의 20/40 시력에 의해 정의되는 바와 같은 최소의 인지 가능한 윤곽보다 더 작다. LF 디스플레이 모듈 도 3a는 하나 이상의 실시예들에 따른 LF 디스플레이 모듈(300A)의 사시도이다. LF 디스플레이 모듈(300A)은 LF 디스플레이 모듈 및/또는 LF 디스플레이 모듈일 수 있다. 다른 실시예들에서, LF 디스플레이 모듈 (300A)은 일부 다른 LF 디스플레이 모듈일 수 있다. 예시된 실시예들에서, LF 디스플레이 모듈(300A)은 에너지 장치층, 에너지 중계층, 및 에너지 도파층을 포함한다. LF 디스플레이 모듈(300A)은 본원에 기 술된 바와 같이 디스플레이 표면으로부터 홀로그래픽 콘텐츠를 제공하도록 구성된다. 편의상, 디스플레이 표면은 LF 디스플레이 모듈(300A)의 프레임 상의 점선으로 도시되지만, 보다 정확하게는, 프레임 의 내부 림(rim)에 의해 한정된 도파 요소들의 전방에 직접 위치된다. LF 디스플레이 모듈(300A)의 일부 실시예들은 여기에서 설명되는 것들과는 상이한 구성요소들을 갖는다. 예를 들어, 일부 실시예들에서, LF 디스 플레이 모듈(300A)은 에너지 중계층을 포함하지 않는다. 유사하게, 기능들은 본원에 설명된 것과 다른 방 식으로 구성요소들 중에 분배될 수 있다. 에너지 장치층은 에너지 장치층의 일 실시예이다. 에너지 장치층은 4개의 에너지 장치들 (도면에는 3개가 도시됨)을 포함한다. 에너지 장치들은 모두 동일한 유형(예를 들어, 모두 전자 디스플레 이들)일 수 있거나, 하나 이상의 상이한 유형들을 포함(예를 들어, 전자 디스플레이들 및 적어도 하나의 음향 에너지 장치를 포함)할 수 있다. 에너지 중계층은 에너지 중계층의 일 실시예이다. 에너지 중계층은 4개의 에너지 중계 장치들 (도면에는 3개가 도시됨)을 포함한다. 에너지 중계 장치들은 모두 동일한 유형의 에너지(예를 들어, 광)를 중계하거나, 하나 이상의 상이한 유형들(예를 들어, 광 및 소리)을 중계할 수 있다. 중계 장치들 각 각은 제1 표면 및 제2 표면을 포함하고, 에너지 중계 장치들의 제2 표면은 단일의 이음매 없는 에너지 표 면을 형성하도록 배열된다. 도시된 실시예에서, 에너지 중계 장치들 각각은 제1 표면이 제2 표면보다 더 작은 표면 영역을 갖도록 테이퍼화되며, 이는 테이퍼들의 작은 단부 상에 에너지 장치들의 기계적인 엔 벨로프들을 수용하게 한다. 이는 또한, 전체 영역이 에너지를 투사할 수 있기 때문에, 이음매 없는 에너지 표면 에 경계가 없어지게 한다. 이는, 전부피로 조합된 표면에 이음매가 없도록, 데드 스페이스(dead space) 또는 베 젤 없이 LF 디스플레이 모듈(300A)의 다수의 인스턴스들을 함께 배치함으로써, 이러한 이음매 없는 에너지 표면 이 타일링(tiled)될 수 있다는 것을 의미한다. 다른 실시예들에서, 제1 표면 및 제2 표면은 동일한 표면적을 갖 는다. 에너지 도파층은 에너지 도파층의 일 실시예이다. 에너지 도파층은 복수의 도파 요소들을 포함한다. 도 2와 관련하여 위에서 설명된 바와 같이, 에너지 도파층은 홀로그래픽 객체를 형성하기 위해 4D 플렌옵틱(plenoptic) 기능에 따라서 특정 전파 경로를 따라 이음매 없는 에너지 표면으로부터 에너지를 지향시키도록 구성된다. 도시된 실시예에서, 에너지 도파층은 프레임에 의해 한정되는 것에 유의해야 한다. 다른 실시예들에서는, 프레임이 없고/없거나, 프레임의 두께가 감소된다. 프레임의 두께 의 제거 또는 감소는 LF 디스플레이 모듈(300A)을 추가적인 LF 디스플레이 모듈과 함께 타일링하는 것을 용이하 게 할 수 있다. 도시된 실시예에서, 이음매 없는 에너지 표면 및 에너지 도파층은 평면형(planar)이다. 다른 실시예 들에서, 도시되지는 않았지만, 이음매 없는 에너지 표면 및 에너지 도파층은 하나 이상의 차원들에서 만곡될 수 있다. LF 디스플레이 모듈(300A)은 이음매 없는 에너지 표면의 표면 상에 상주하는 추가적인 에너지 소스들로 구성될 수 있고, 라이트필드에 대해 에너지 필드의 추가적인 투사를 허용한다. 일 실시예에서, 음향 에너지 필드는 이 음매 없는 에너지 표면 상의 임의의 수의 위치들에 장착된 정전기 스피커들(도시되지 않음)로부터 투사될 수 있다. 또한, LF 디스플레이 모듈(300A)의 정전기 스피커들은 듀얼 에너지 표면이 동시에 소리 필드들 및 홀 로그래픽 콘텐츠를 투사하도록, 라이트필드 디스플레이 모듈(300A) 내에 위치된다. 예를 들어, 정전기 스피커들 은 전자기 에너지의 일부 파장들에 대해 투과성인 하나 이상의 다이어프램 요소들로 형성될 수 있으며, 전도성 요소들을 이용하여 구동될 수 있다. 정전기 스피커들은 다이어프램 요소들이 도파 요소들의 일부를 덮도록 이음 매 없는 에너지 표면에 장착될 수 있다. 스피커들의 전도성 전극들은 전자기 도파들 사이의 광 전송을 억제하도록 설계되고/되거나 전자기 도파 요소들(예를 들어, 프레임) 사이의 위치들에 위치하는 구조물들과 함께 배치될 수 있다. 다양한 구성들에서, 스피커들은 가청 소리를 투사하고/하거나 햅틱 표면을 생성하는 집속 된 초음파 에너지의 여러 소스들을 투사할 수 있다. 일부 구성들에서, 에너지 장치는 에너지를 감지할 수 있다. 예를 들어, 에너지 장치는 마이크, 광 센서, 음향 트랜스듀서 등일 수 있다. 이와 같이, 에너지 중계 장치들은 또한 이음매 없는 에너지 표면으로부터 에너지 장치층으로 에너지를 중계할 수 있다. 즉, 에너지 장치들 및 에너지 중계 장치들이 에너지를 방출하고 동시에 감지(예를 들어, 라이트필드들을 방출하고 소리를 감지)하도록 구성될 때, LF 디스플레이 모듈 의 이음매 에너지 표면은 양방향성 에너지 표면을 형성한다. 보다 광범위하게, LF 디스플레이 모듈의 에너지 장치는 에너지 소스 또는 에너지 센서일 수 있다. LF 디스플레이 모듈(300A)은 사용자에게 고품질 홀로그래픽 콘텐츠의 투사를 용이하게 하기 위해 에너지 소스들 및 /또는 에너지 센서들로서 작용하는 다양한 유형들의 에너지 장치들을 포함할 수 있다. 다른 소스들 및/또는 센 서들은 열 센서들 또는 소스들, 적외선 센서들 또는 소스들, 이미지 센서들 또는 소스들, 음향 에너지를 생성하 는 기계적 에너지 트랜스듀서들, 피드백 소스들 등을 포함할 수 있다. 많은 다른 센서들 또는 소스들이 가능하 다. 또한, LF 디스플레이 모듈들은, LF 디스플레이 모듈이 커다란 집합된 이음매 없는 에너지 표면으로부터 여 러 유형의 에너지를 투사하고 감지하는 어셈블리를 형성할 수 있도록 타일링(tiled)될 수 있다. LF 디스플레이 모듈(300A)의 다양한 실시예들에서, 이음매 없는 에너지 표면은 다양한 표면 부분들을 가질 수 있으며, 각각의 표면 부분은 특정 유형의 에너지를 투사 및/또는 방출하도록 구성된다. 예를 들어, 이음매 없는 에너지 표면이 듀얼-에너지 표면일 때, 이음매 없는 에너지 표면은 전자기 에너지를 투사하는 하나 이상의 표면 부분들, 및 초음파 에너지를 투사하는 하나 이상의 다른 표면 부분들을 포함한다. 초음파 에너지를 투사하는 표면 부분들은 도파관 요소들 사이의 이음매 없는 에너지 표면 상에 위치될 수 있고/있거나 도파 관 요소들 사이의 광 투과를 억제하도록 설계된 구조물들과 함께 위치될 수 있다. 이음매 없는 에너지 표면이 양방향 에너지 표면인 예에서, 에너지 중계층은 이음매 없는 에너지 표면에서 인터리빙되는 2개의 유 형의 에너지 중계 장치들을 포함할 수 있다. 다양한 실시예들에서, 이음매 없는 에너지 표면은 특정한 도 파 요소들 아래의 표면의 부분들이 모두 에너지 소스들, 모두 에너지 센서들, 또는 에너지 소스들 및 에너 지 센서들의 혼합이 되도록, 구성될 수 있다. 도 3b는 하나 이상의 실시예들에 따른, 인터리빙된 에너지 중계 장치들을 포함하는 LF 디스플레이 모듈(300B)의 단면도이다. LF 디스플레이 모듈(300B)은 둘 이상의 유형의 에너지를 투사하기 위한 듀얼 에너지 투사 장치로서, 또는 한 유형의 에너지를 투사하고 동시에 다른 유형의 에너지를 감지하기 위한 양방향 에너지 장치 로서, 구성될 수 있다. LF 디스플레이 모듈(300B)은 LF 디스플레이 모듈 및/또는 LF 디스플레이 모듈(21 0)일 수 있다. 다른 실시예들에서, LF 디스플레이 모듈은 일부 다른 LF 디스플레이 모듈일 수 있다. LF 디스플레이 모듈(300B)은 도 3a의 LF 디스플레이 모듈(300A)의 것들과 유사하게 구성된 많은 구성요소들을 포함한다. 예를 들어, 예시된 실시예에서, LF 디스플레이 모듈(300B)은 적어도 도 3a에 관해 기술된 것들의 동 일한 기능을 포함하는, 에너지 장치층, 에너지 중계층, 이음매 없는 에너지 표면, 및 에너지 도 파층을 포함한다. 추가적으로, LF 디스플레이 모듈(300B)은 디스플레이 표면으로부터 에너지를 제공 하고/하거나 수신한다. 특히, LF 디스플레이 모듈(300B)의 구성요소들은 대안적으로, 도 3a의 LF 디스플레이 모 듈(300A)의 구성요소들과 연결되고/되거나 지향(orient)된다. LF 디스플레이 모듈(300B)의 일부 실시예들은 여 기에서 설명되는 것들과는 상이한 구성요소들을 갖는다. 유사하게, 기능들은 본원에 설명된 것과 다른 방식으로 구성요소들 중에 분배될 수 있다. 도 3b는 더 큰 영역을 갖는 양방향 에너지 표면 또는 듀얼 에너지 투사 표면 을 생성하도록 타일링될 수 있는 단일 LF 디스플레이 모듈의 설계를 예시한다. 일 실시예에서, LF 디스플레이 모듈(300B)은 양방향 LF 디스플레이 시스템의 LF 디스플레이 모듈이다. 양방향 LF 디스플레이 시스템은 디스플레이 표면으로부터 에너지를 투사함과 동시에 에너지를 감지할 수 있다. 이 음매 없는 에너지 표면은 이음매 없는 에너지 표면 상에 근접하게 인터리빙되는 에너지 투사 위치 및 에너지 감지 위치 모두를 포함한다. 따라서, 도 3b의 예에서, 에너지 중계층은 도 3a의 에너지 중계층과는 상이한 방식으로 구성된다. 편의상, LF 디스플레이 모듈(300B)의 에너지 중계층은 본원에서 \"인터리빙된 에너지 중계층\"으로 지칭될 것이다. 인터리빙된 에너지 중계층은 두 개의 레그들, 즉, 제1 에너지 중계 장치(350A) 및 제2 에너지 중계 장치 (350B)를 포함한다. 각각의 레그들은 약간 음영이 있는 영역으로서 도시되어 있다. 각각의 레그들은 플렉시블 중계 물질로 제조될 수 있고, 다양한 크기들 및 형상들의 에너지 장치들과 함께 사용하기에 충분한 길이로 형성될 수 있다. 인터리빙된 에너지 중계층의 일부 영역들에서, 두 개의 레그들은 이음매 없는 에너지 표면에 접근함에 따라 함께 조밀하게(tightly) 인터리빙(interleaved)된다. 도시된 예에서, 인터리빙된 에너지 중계 장 치들은 어두운 음영 영역으로 도시되어 있다. 이음매 없는 에너지 표면에서 인터리빙되는 동안, 에너지 중계 장치들은 상이한 에너지 장치들로부터/그에 대해 에너지를 중계하도록 구성된다. 에너지 장치들은 에너지 장치층에 존재한다. 도시된 바와 같이, 에너 지 장치(340A)는 에너지 중계 장치(350A)에 연결되고, 에너지 장치(340B)는 에너지 중계 장치(350B)에 연결된다. 다양한 실시예들에서, 각각의 에너지 장치는 에너지 소스 또는 에너지 센서일 수 있다. 에너지 도파층은 일련의 수렴 지점들을 향하여 투사된 경로들을 따라 이음매 없는 에너지 표면으로부 터 에너지 파들을 조향(steer)하기 위한 도파 요소들을 포함한다. 이 예에서, 홀로그래픽 객체는 일 련의 수렴 지점들에 형성된다. 특히, 도시된 바와 같이, 홀로그래픽 객체에서의 에너지의 수렴은 디스플레 이 표면의 관찰자 측에서 발생한다. 그러나, 다른 예에서, 에너지의 수렴은, 디스플레이 표면의 전방 및 디스플레이 표면의 후방 둘 모두에서 연장되는, 홀로그래픽 객체 부피 내의 어느 곳에도 존재할 수 있 다. 도파 요소들은 후술하는 바와 같이 에너지 장치(예를 들어, 에너지 센서)로 들어오는 에너지를 동시에 조향할 수 있다. LF 디스플레이 모듈(300B)의 일 예시적인 실시예에서, 방출형 디스플레이는 에너지 소스로서 사용되고, 이미징 센서는 에너지 센서로서 사용된다. 이런 식으로, LF 디스플레이 모듈(300B)은 홀로그래픽 콘텐츠를 투사함과 동 시에 디스플레이 표면의 전방에서 해당 부피로부터 광을 검출할 수 있다. 일 실시예에서, LF 디스플레이 모듈(300B)은 디스플레이 표면의 전방에 라이트필드를 투사하고 동시에 디 스플레이 표면의 전방으로부터 라이트필드를 캡처하도록 구성된다. 이 실시예에서, 에너지 중계 장치 (350A)는 도파 요소들 아래에 위치된 이음매 없는 에너지 표면에서의 제1 세트의 위치들을 에너지 장 치(340A)에 연결한다. 일 예에서, 에너지 장치(340A)는 소스 픽셀들의 어레이를 갖는 방출형(emissive) 디스플 레이이다. 에너지 중계 장치(340B)는 도파 요소들 아래에 위치된 이음매 없는 에너지 표면에서의 제2 세트의 위치들을 에너지 장치(340B)에 연결한다. 일 예에서, 에너지 장치(340B)는 센서 픽셀들의 어레이를 갖는 이미징 센서이다. LF 디스플레이 모듈은 특정 도파관 요소 아래에 있는 이음매 없는 에너지 표면 에서의 위치들이 모든 발광 디스플레이 위치들, 모든 이미징 센서 위치들, 또는 위치들의 일부 조합이 되 도록 구성될 수 있다. 다른 실시예들에서, 양방향 에너지 표면은 다양한 다른 형태의 에너지를 투사하고 수신할 수 있다. LF 디스플레이 모듈(300B)의 다른 예시적인 실시예에서, LF 디스플레이 모듈은 2개의 상이한 유형의 에너지를 투사하도록 구성된다. 예를 들어, 에너지 장치(340A)는 전자기 에너지를 방출하도록 구성된 방출 디스플레이이 고, 에너지 장치(340B)는 기계적 에너지를 방출하도록 구성된 초음파 변환기이다. 이와 같이, 광 및 소리는 이 음매 없는 에너지 표면에서의 다양한 위치들로부터 투사될 수 있다. 이러한 구성에서, 에너지 중계 장치 (350A)는 에너지 장치(340A)를 이음매 없는 에너지 표면에 연결하고 전자기 에너지를 중계한다. 에너지 중 계 장치는 전자기 에너지를 수송하는 데에 효율적인 특성들(예를 들어, 가변 굴절률)을 갖도록 구성된다. 에너 지 중계 장치(350B)는 에너지 장치(340B)를 이음매 없는 에너지 표면에 연결하고 기계적 에너지를 중계한 다. 에너지 중계 장치(350B)는 초음파 에너지의 효율적인 수송(예를 들어, 상이한 음향 임피던스를 갖는 물질들 의 분포)을 위한 특성들을 갖도록 구성된다. 일부 실시예들에서, 기계적 에너지는 에너지 도파층 상의 도 파 요소들 사이의 위치들로부터 투사될 수 있다. 기계적 에너지를 투사하는 위치들은 광이 하나의 전자기 도파 요소로부터 다른 전자기 도파 요소로 전송되는 것을 억제하는 역할을 하는 구조물들을 형성할 수 있다. 일 예에서, 초음파 기계적 에너지를 투사하는 공간적으로 분리된 위치들의 어레이는 중간-공기(mid-air) 중의 3차 원 햅틱 형상들 및 표면들을 생성하도록 구성될 수 있다. 표면들은 투사된 홀로그래픽 객체(예를 들어, 홀로그 래픽 객체)와 일치할 수 있다. 일부 예들에서, 어레이에 걸친 위상 지연들 및 진폭 변동들은 햅틱 형상들 의 생성을 보조할 수 있다. 다양한 실시예들에서, 양방향 LF 디스플레이 모듈은 특정 유형의 에너지 장치를 포함하는 각각의 에너지 장치층을 갖는 다수의 에너지 장치층들을 포함할 수 있다. 이러한 예들에서, 에너지 중계층들은 이음매 없는 에 너지 표면과 에너지 장치층 사이에서 적절한 유형의 에너지를 중계하도록 구성된다. 타일형 LF 디스플레이 모듈 도 4a는 하나 이상의 실시예들에 따른, 단일-측면의 이음매 없는 표면 환경을 형성하기 위해 2차원으로 타일링 (tiled)되는 LF 디스플레이 시스템의 일 부분의 사시도이다. LF 디스플레이 시스템은 어레이를 형성하도록 타일링되는 복수의 LF 디스플레이 모듈들을 포함한다. 보다 명시적으로, 어레이 내의 작은 사 각형들 각각은 타일형 LF 디스플레이 모듈을 나타낸다. 어레이는 예를 들어, 방의 표면(예를 들어, 벽)의 일부 또는 전부를 커버할 수 있다. LF 어레이는, 예를 들어, 게임 테이블 상판, 게시판, 로툰다(rotunda) 등과 같은 다른 표면들을 커버할 수 있다. 어레이는 하나 이상의 홀로그래픽 객체들을 투사할 수 있다. 예를 들어, 도시된 실시예에서, 어레이 는 홀로그래픽 객체 및 홀로그래픽 객체를 투사한다. LF 디스플레이 모듈들의 타일링은 훨씬 더 큰 가시 부피뿐만 아니라, 객체들이 어레이로부터 더 먼 거리로 투사될 수 있게 한다. 예를 들어, 도시된 실시예에서, 가시 부피는 근사적으로, LF 디스플레이 모듈의 전방(및 후방)의 국소화된 부피가 아니라, 어 레이의 전방 및 후방에 있는 전체 영역이다. 일부 실시예들에서, LF 디스플레이 시스템은 홀로그래픽 객체를 관찰자 및 관찰자에 제공 한다. 관찰자 및 관찰자는 홀로그래픽 객체의 상이한 관점들을 수신한다. 예를 들어, 관찰자 에게는 홀로그래픽 객체의 직접적인 뷰가 제공되는 반면, 관찰자에게는 홀로그래픽 객체의 더 경사진 뷰가 제공된다. 관찰자 및/또는 관찰자가 이동함에 따라, 그들은 홀로그래픽 객체의 상이한 관점들을 제공받는다. 이는 관찰자가 홀로그래픽 객체에 대해 이동함으로써 홀로그래픽 객체와 시각적으 로 상호작용할 수 있게 한다. 예를 들어, 관찰자가 홀로그래픽 객체 주위를 걸어갈 때, 관찰자 는 홀로그래픽 객체가 어레이의 홀로그래픽 객체 부피 내에 남아 있는 한, 홀로그래픽 객체의 상이한 측면들을 보게 된다. 따라서, 관찰자 및 관찰자는 마치 실제로 존재하는 것처럼 실제 공간에 서 홀로그래픽 객체를 동시에 볼 수 있다. 또한, 홀로그래픽 객체는 물리적 객체가 보이는 것과 거의 동일한 방식으로 관찰자들에게 보이기 때문에 관찰자 및 관찰자는 홀로그래픽 객체를 보기 위해 외부 장치를 착용할 필요가 없다. 또한, 여기에서, 홀로그래픽 객체는 어레이의 가시 부피가 어레이의 표 면 뒤로 연장되기 때문에, 어레이 뒤에 도시되어 있다. 이런 식으로, 홀로그래픽 객체는 어레이의 표 면보다 관찰자들로부터 더 멀리 떨어져 있는 것처럼 관찰자 및/또는 관찰자에게 제공될 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 관찰자 및 관찰자의 위치들을 추적하는 추적 시스 템을 포함할 수 있다. 일부 실시예들에서, 추적되는 위치는 관찰자의 위치이다. 다른 실시예들에서, 추적되는 위치는 관찰자의 눈의 위치이다. 눈의 위치 추적은 눈이 어디를 보고 있는지를 추적하는 시선 추적(예를 들어, 응시 위치를 결정하기 위해 방향을 사용함)과는 상이하다. 관찰자의 눈과 관찰자의 눈은 서로 다른 위치에 있다. 다양한 구성들에서, LF 디스플레이 시스템은 하나 이상의 추적 시스템들을 포함할 수 있다. 예를 들어, 도 4a의 예시된 실시예에서, LF 디스플레이 시스템은 어레이 외부에 있는 추적 시스템을 포함한다. 여기 서, 추적 시스템은 어레이에 연결된 카메라 시스템일 수 있다. 외부의 추적 시스템들은 도 5a와 관련하여 더 상세히 설명된다. 다른 예시적인 실시예들에서, 추적 시스템은 본원에 기술된 바와 같이 어레이 내에 통합될 수 있다. 예를 들어, 어레이에 포함된 LF 디스플레이 모듈의 에너지 장치(예를 들어, 에너지 장치)는 어레이의 전방에서 관찰자들의 이미지들을 캡처하도록 구성될 수 있다. 어느 경우든, LF 디 스플레이 시스템의 추적 시스템(들)은 어레이에 의해 제공되는 홀로그래픽 콘텐츠를 보는 관찰자(예 를 들어, 관찰자 및/또는 관찰자)에 관한 추적 정보를 결정한다. 추적 정보는 관찰자의 위치에 대한(예를 들어, 추적 시스템에 대한) 공간 내의 위치, 또는 관찰자의 일 부분의 위치(예를 들어, 관찰자의 한쪽 또는 양쪽 눈, 또는 관찰자의 말단부들)를 기술한다. 추적 시스템은 추적 정보 를 결정하기 위해 임의의 수의 깊이 결정 기술들을 이용할 수 있다. 깊이 결정 기술들은 예를 들어, 구조화된 광, 비행 시간, 스테레오 이미징, 일부 다른 깊이 결정 기술, 또는 이들의 몇몇 조합을 포함할 수 있다. 추적 시스템은 추적 정보를 결정하도록 구성된 다양한 시스템들을 포함할 수 있다. 예를 들어, 추적 시스템은 하나 이상의 적외선 소스들(예를 들어, 구조화된 광원들), 적외선에서의 이미지들을 캡처할 수 있는 하나 이상의 이 미징 센서들(예를 들어, 적-청-녹-적외선 카메라), 및 추적 알고리즘을 실행하는 프로세서를 포함할 수 있다. 추적 시스템은 관찰자들의 위치들을 결정하기 위해 깊이 추정 기술들을 사용할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 본원에 설명된 바와 같이 관찰자 및/또는 관찰자의 추적된 위치들, 동작들, 또는 제스처들에 기초하여 홀로그래픽 객체들을 생성한다. 예를 들어, LF 디스플레이 시스템은 어 레이 및/또는 특정 위치의 임계 거리 내에 들어오는 관찰자에 응답하여 홀로그래픽 객체를 생성할 수 있다.LF 디스플레이 시스템은 추적 정보에 부분적으로 기초하여 각각의 관찰자에 맞춤화된 하나 이상의 홀로그 래픽 객체들을 제공할 수 있다. 예를 들어, 관찰자에게는 홀로그래픽 객체가 제공될 수 있지만, 홀로 그래픽 객체는 제공되지 않을 수 있다. 유사하게, 관찰자에게는 홀로그래픽 객체가 제공될 수 있지만, 홀로그래픽 객체는 제공되지 않을 수 있다. 예를 들어, LF 디스플레이 시스템은 관찰자 및 관찰자 각각의 위치를 추적한다. LF 디스플레이 시스템은 홀로그래픽 객체가 제공되어야 하는 위 치에 대한 그들의 상대적인 위치에 기초하여 관찰자에게 보이는 홀로그래픽 객체의 관점을 결정한다. LF 디스플 레이 시스템은 결정된 관점에 대응하는 특정 픽셀들로부터 광을 선택적으로 투사한다. 따라서, 관찰자 및 관찰자는 동시에, 잠재적으로 완전히 상이한 경험을 가질 수 있다. 즉, LF 디스플레이 시스템 은 가시 부피의 가시 서브부피에 홀로그래픽 콘텐츠를 제공할 수 있다. 예를 들어, 예시된 바와 같이, 가 시 부피는 어레이의 전방 및 후방의 모든 공간으로 표현된다. 이 예에서, LF 디스플레이 시스템이 관찰자 의 위치를 추적할 수 있기 때문에, LF 디스플레이 시스템은 관찰자 주위의 가시 서브-부피에 공 간 콘텐츠(예를 들어, 홀로그래픽 객체)를, 그리고 관찰자 주위의 가시 서브-부피에 사파리 콘텐츠 (예를 들어, 홀로그래픽 객체)를 제공할 수 있다. 이와 달리, 통상적인 시스템들은 유사한 경험을 제공하 기 위해 개별 헤드셋을 사용해야 한다. 일부 실시예들에서, LF 디스플레이 시스템은 하나 이상의 감각 피드백 시스템들을 포함할 수 있다. 감각 피드백 시스템들은 홀로그래픽 객체들(420, 422)을 증강시키는 다른 감각 자극들(예를 들어, 촉각, 청각, 또는 후각)을 제공한다. 예를 들어, 도 4a의 예시된 실시예에서, LF 디스플레이 시스템은 어레이 외부의 감각 피드백 시스템을 포함한다. 일 예에서, 감각 피드백 시스템은 어레이에 연결된 정전기 스 피커일 수 있다. 외부 감각 피드백 시스템은 도 5a와 관련하여 더욱 상세히 설명된다. 다른 예시적인 실시예들 에서, 감각 피드백 시스템은 본원에 기술된 바와 같이 어레이 내에 통합될 수 있다. 예를 들어, 어레이 에 포함된 LF 디스플레이 모듈의 에너지 장치(예를 들어, 도 3b의 에너지 장치(340A))는 어레이의 전 방에서 관찰자들에게 초음파 에너지를 투사하고 및/또는 어레이의 전방에서 관찰자들로부터 이미징 정보를 수신 하도록 구성될 수 있다. 어느 경우든, 감각 피드백 시스템은 어레이에 의해 제공되는 홀로그래픽 콘텐츠 (예를 들어, 홀로그래픽 객체 및/또는 홀로그래픽 객체)를 보는 관찰자(예를 들어, 관찰자 및/ 또는 관찰자)에게 감각 콘텐츠를 제공하고/하거나 그로부터 감각 콘텐츠를 수신한다. LF 디스플레이 시스템은 어레이 외부의 하나 이상의 음향 투사 장치를 포함하는 감각 피드백 시스템을 포 함할 수 있다. 대안적으로 또는 추가적으로, LF 디스플레이 시스템은 본원에 기술된 바와 같이 어레이 내에 통합된 하나 이상의 음향 투사 장치들을 포함할 수 있다. 음향 투사 장치는 관찰자의 일 부분이 하 나 이상의 표면들의 임계 거리 내에 도달하는 경우 홀로그래픽 객체의 하나 이상의 표면들에 대해 (예를 들어, 홀로그래픽 객체의 표면에서) 부피 촉각 감각을 생성하는 초음파 압력파를 투사할 수 있다. 부피 촉각 감 각은 사용자가 홀로그래픽 객체의 표면들을 만지고 느낄 수 있게 한다. 또한, 복수의 음향 투사 장치들은 관찰 자들에게 오디오 콘텐츠(예를 들어, 몰입형 오디오)를 제공하는 가청 압력파를 투사할 수 있다. 따라서, 초음파 압력파 및/또는 가청 압력파는 홀로그래픽 객체를 보완하는 작용을 할 수 있다. 다양한 실시예들에서, LF 디스플레이 시스템은 관찰자의 추적된 위치에 부분적으로 기초하여 다른 감각 자 극들을 제공할 수 있다. 예를 들어, 도 4a에 도시된 홀로그래픽 객체는 사자이고, LF 디스플레이 시스템 은 시각적으로(즉, 홀로그래픽 객체가 으르렁거리는(roar) 것으로 보임) 및 청각적으로(즉, 하나 이 상의 음향 투사 장치들은 관찰자가 홀로그래픽 객체로부터 나오는 사자의 으르렁거림으로서 인지하는 압력파를 투사함) 으르렁거리는 홀로그래픽 객체를 가질 수 있다. 도시된 구성에서, 홀로그래픽 가시 부피는 도 2의 LF 디스플레이 시스템의 가시 부피와 유사한 방식 으로 제한될 수 있음에 유의해야 한다. 이는 관찰자가 단일의 벽면 디스플레이 유닛으로 경험하게 될 인식된 몰 입의 정도를 제한할 수 있다. 이를 해결하기 위한 한 가지 방법은 도 4b 내지 도 4f와 관련하여 아래에서 설명 되는 바와 같이 다수의 측면들을 따라 타일링되는 다수의 LF 디스플레이 모듈들을 사용하는 것이다. 도 4b는 하나 이상의 실시예들에 따른, 다중-측면의 이음매 없는 표면 환경에서의 LF 디스플레이 시스템의 일 부분의 사시도이다. LF 디스플레이 시스템은 복수의 LF 디스플레이 모듈들이 다중 측면의 이음매 없는 표면 환경을 생성하도록 타일링되는 것을 제외하고는, LF 디스플레이 시스템과 실질적으로 유사하다. 보다 구체적으로, LF 디스플레이 모듈들은 6개의 면의 집합된(aggregated) 이음매 없는 표면 환경인 어레이를 형성하 도록 타일링된다. 도 4b의 각각의 사각형에서, 복수의 LF 디스플레이 모듈은 방의 벽, 천장, 및 바닥을 모두 커 버한다. 다른 실시예들에서, 복수의 LF 디스플레이 모듈들은 벽, 바닥, 천장, 또는 이들의 일부 조합의 전부가 아닌 일부를 커버할 수 있다. 다른 실시예들에서, 복수의 LF 디스플레이 모듈들은 일부 다른 집합된 이음매 없는 표면을 형성하도록 타일링된다. 예를 들어, 벽들은 원통형의 집합된 에너지 환경이 형성되도록 만곡될 수 있 다. 또한, 도 6에 관해 후술하는 바와 같이, 일부 실시예들에서, LF 디스플레이 모듈들은 게임 환경 내의 표면 (예를 들어, 벽 등)을 형성하도록 타일링될 수 있다. LF 디스플레이 시스템은 하나 이상의 홀로그래픽 객체들을 투사할 수 있다. 예를 들어, 도시된 실시예에서, LF 디스플레이 시스템은 홀로그래픽 객체를 6개의 면의 집합된 이음매 없는 표면 환경에 의해 둘러싸인 영역으로 투사한다. 따라서, LF 디스플레이 시스템의 가시 부피는 또한 6면의 집합된 이음매 없 는 표면 환경 내에 포함된다. 도시된 구성에서, 관찰자는 홀로그래픽 객체와, 홀로그래픽 객체 를 형성하기 위해 사용되는 에너지(예를 들어, 광 및/또는 압력파)를 투사하는 LF 디스플레이 모듈의 사이 에 위치될 수 있음에 유의해야 한다. 따라서, 관찰자의 위치로 인해, 관찰자는 LF 디스플레이 모듈 로부터의 에너지로부터 형성된 홀로그래픽 객체를 인지하는 것을 방해받을 수 있다. 그러나, 도시된 구성에서, (예를 들어, 관찰자에 의해) 방해받지 않고, 홀로그래픽 객체를 형성하기 위한 에너지를 투사할 수 있는 적어도 하나의 다른 LF 디스플레이 모듈, 예를 들어, LF 디스플레이 모듈이 존재한다. 이 런 식으로, 공간 내의 관찰자들에 의한 막힘(occlusion)은 홀로그래픽 투사들의 일부 부분이 사라지게 할 수 있 지만, 그 효과는 부피의 단지 한쪽 면만 홀로그래픽 디스플레이 패널들로 채워지는 경우보다는 훨씬 더 작다. 홀로그래픽 객체는 홀로그래픽 객체 부피가 집합된 표면 뒤로 연장되기 때문에 6개의 면의 집합된 이음매 없는 표면 환경의 벽들 \"외부에\" 도시되어 있다. 따라서, 관찰자 및/또는 관찰자는 홀로그래픽 객체 를 그들이 통과할 수 있는 6면 환경의 \"외부\"로서 인지할 수 있다. 도 4a를 참조하여 전술한 바와 같이, 일부 실시예들에서, LF 디스플레이 시스템은 관찰자들의 위치들을 능 동적으로 추적하고, 추적된 위치들에 기초하여 홀로그래픽 콘텐츠를 제공하도록 상이한 LF 디스플레이 모듈들에 동적으로 지시할 수 있다. 따라서, 다중-측면의 구성은 제한되지 않은 관찰자들이 다중-측면의 이음매 없는 표 면 환경에 의해 둘러싸인 영역을 관통하여 자유롭게 이동할 수 있는 홀로그래픽 객체들을 제공하기 위한 보다 강건한(robust)(예를 들어, 도 4a에 비해) 환경을 제공할 수 있다. 특히, 다양한 LF 디스플레이 시스템들은 상이한 구성들을 가질 수 있다. 또한, 각각의 구성은, 집합적으로, 이 음매 없는 디스플레이 표면(\"집합 표면\")을 형성하는, 표면들의 특정 배향을 가질 수 있다. 즉, LF 디스플레이 시스템의 LF 디스플레이 모듈들은 다양한 집합 표면들을 형성하도록 타일링될 수 있다. 예를 들어, 도 4b에서, LF 디스플레이 시스템은 방의 벽들을 근사화하는 6개의 면의 집합 표면을 형성하도록 타일링된 LF 디스플 레이 모듈들을 포함한다. 일부 다른 예들에서, 집합 표면은 전체 표면(예를 들어, 전체 벽)이 아니라 표면의 일 부(예를 들어, 벽의 절반)에서만 발생할 수 있다. 일부 예들은 본원에서 설명된다. 일부 구성들에서, LF 디스플레이 시스템의 집합 표면은 국부화된 가시 부피를 향해 에너지를 투사하도록 구성된 집합 표면을 포함할 수 있다. 국부적인 가시 부피에 에너지를 투사하는 것은, 예를 들어, 특정 가시 부피 내의 투사된 에너지의 밀도를 증가시키고, 그 부피 내의 관찰자들에 대한 FOV를 증가시키며, 가시 부피를 디스플레이 표면에 더 가깝게 하는 것에 의해, 더 높은 품질의 가시 경험을 가능하게 한다. 예를 들어, 도 4c는 \"날개형(winged)\" 구성으로 집합 표면을 갖는 LF 디스플레이 시스템(450A)의 평면도를 도시 한다. 이 예에서, LF 디스플레이 시스템(450A)은 전면 벽, 후면 벽, 제1 측벽, 제2 측벽, 천장(도시되지 않음), 및 바닥(도시되지 않음)을 갖는 방에 위치된다. 제1 측벽, 제2 측벽, 후면 벽 , 바닥 및 천장은 모두 수직한다. LF 디스플레이 시스템(450A)은 전면 벽을 덮는 집합 표면을 형성하 도록 타일링된 LF 디스플레이 모듈들을 포함한다. 전면 벽, 및 따라서 집합 표면은 3개의 부분들, 즉, (i) 후면 벽과 근사적으로 평행한 제1 부분(즉, 중앙 표면), (ii) 제1 부분을 제1 측벽 에 연결하고 방의 중심을 향해 에너지를 투사하기 위한 각도에 위치되는 제2 부분(즉, 제1 측면), 및 (iii) 제1 부분을 제2 측벽에 연결하고 방의 중심을 향해 에너지를 투사하기 위한 각도에 위치되는 제3 부분(즉, 제2 측면)을 포함한다. 제1 부분은 방 안의 수직한 평면이고, 수평 및 수직 축을 가진다. 제 2 부분 및 제3 부분은 수평 축을 따라 방의 중심을 향해 각진다. 이 예에서, LF 디스플레이 시스템(450A)의 가시 부피(468A)는 방의 중앙에 있고, 집합 표면의 세 부분들에 의해 부분적으로 둘러싸인다. 관찰자를 적어도 부분적으로 둘러싸는 집합 표면(\"주위 표면\")은 관찰자들의 몰입 적 경험을 증가시킨다. 설명을 위해, 예를 들어, 단지 중앙 표면만을 갖는 집합 표면을 고려한다. 도 2a를 참조하면, 디스플레이 표면 의 어느 한쪽 단부로부터 투사되는 광선들은 전술한 바와 같이 이상적인 홀로그래픽 부피 및 이상적인 가시 부 피를 생성한다. 이제, 예를 들어, 중앙 표면이 관찰자를 향해 각진 2개의 측면들을 포함하는 경우를 고려한다.이 경우에, 광선 및 광선은 중앙 표면의 법선으로부터 더 큰 각도로 투사될 것이다. 따라서, 가시 부 피의 시야는 증가할 것이다. 유사하게, 홀로그래픽 가시 부피는 디스플레이 표면에 더 가까울 것이다. 추가적으 로, 2개의 제2 부분 및 제3 부분이 가시 부피에 더 가까이 경사지기 때문에, 디스플레이 표면으로부터 고정된 거리에 투사되는 홀로그래픽 객체들은 해당 가시 부피에 더 가깝다. 단순화를 위해, 단지 중앙 표면만을 갖는 디스플레이 표면은 평면형의(planar) 시야, (중앙의) 디스플레이 표면 과 가시 부피 사이의 평면형의 임계 간격, 및 홀로그래픽 객체와 가시 부피 사이의 평면형의 근접성을 갖는다. 관찰자를 향해서 각진 하나 이상의 측면들을 추가하는 것은 평면형의 시야에 비해 시야를 증가시키고, 평면형의 간격에 비해 디스플레이 표면과 가시 부피 사이의 간격을 감소시키며, 평면형의 근접성에 비해 디스플레이 표면 과 홀로그래픽 객체 사이의 근접성을 증가시킨다. 관찰자를 향해 측면들을 더 경사지게 하는 것은 시야를 더 증 가시키고, 간격을 더 감소시키며, 근접성을 더 증가시킨다. 즉, 측면들의 각진 배치는 관찰자들에 대한 몰입적 경험을 증가시킨다. 또한, 도 6과 관련하여 아래에서 설명되는 바와 같이, 편향 광학계는 LF 디스플레이 파라미터들(예를 들어, 치 수들 및 FOV)에 대한 가시 부피의 크기 및 위치를 최적화하기 위해 사용될 수 있다. 도 4d를 참조하면, 유사한 예에서, 도 4d는 \"경사진\" 구성으로 집합 표면을 갖는 LF 디스플레이 시스템(450B)의 측면도를 도시한다. 이 예에서, LF 디스플레이 시스템(450B)은 전면 벽, 후면 벽, 제1 측벽(도시되지 않음), 제2 측벽(도시되지 않음), 천장, 및 바닥을 갖는 방에 위치된다. 제1 측벽, 제2 측벽, 후면 벽, 바닥, 및 천장은 모두 수직이다. LF 디스플레이 시스템(450B)은 전면 벽을 커버하는 집합 표면을 형성하도록 타일링된 LF 디스플레이 모듈들을 포함한다. 전면 벽 및 이에 따른 집합 표면 은 3개의 부분들, 즉, (i) 후면 벽(즉, 중앙 표면)과 거의 평행한 제1 부분, (ii) 제1 부분 을 천장에 연결하고 방의 중심을 향해 에너지를 투사하도록 각진 제2 부분(즉, 제1 측면), 및 (iii) 제1 부분을 바닥으로 연결하고 방의 중심을 향해 에너지를 투사하도록 각진 제3 부분(즉, 제2 측면)을 포함한다. 제1 부분은 방 안의 수직한 평면이고, 수평 및 수직 축을 가진다. 제2 부분 및 제3 부분 은 수직축을 따라 방의 중심을 향하여 각진다. 이 예에서, LF 디스플레이 시스템(450B)의 가시 부피(468B)는 방의 중심에 있고 집합 표면의 세 부분들에 의해 부분적으로 둘러싸인다. 도 4c에 도시된 구성과 유사하게, 2개의 측면 부분들(예를 들어, 제2 부분 및 제3 부분)은 관찰자를 둘러싸고 주위 표면을 형성하도록 각진다. 주위 표면은 홀로그래픽 가시 부피 (468B) 내의 임의의 관찰자의 관점으로부터 가시 FOV를 증가시킨다. 추가적으로, 주위 표면은 투사된 객체들이 더 가깝게 보이도록 가시 부피(468B)가 디스플레이의 표면에 더 가깝게 되게 한다. 즉, 측면들의 각진 배치는 시야를 증가시키고, 간격을 감소시키며, 집합 표면의 근접성을 증가시키며, 그에 따라 관찰자들에 대한 몰입형 경험을 증가시킨다. 또한, 아래에서 설명되는 바와 같이, 가시 부피(468B)의 크기 및 위치를 최적화하기 위해 편향 광학계가 사용될 수 있다. 집합 표면의 측면 부분들의 경사진 구성은, 제3 부분이 경사지지 않은 경우보다, 홀로그래픽 콘텐츠 가 가시 부피(468B)에 더 가깝게 제공될 수 있게 한다. 예를 들어, 경사진 구성에서 LF 디스플레이 시스템으로 부터 제공된 캐릭터의 하단 말단부들(예를 들어, 다리)은, 평평한 전면 벽을 갖는 LF 디스플레이 시스템이 사용 된 경우보다, 더 가깝고 더 현실적으로 보일 수 있다. 또한, LF 디스플레이 시스템의 구성 및 그것이 위치되는 환경은 가시 부피들 및 가시 서브부피들의 형태 및 위 치들을 알려줄 수 있다. 예를 들어, 도 4e는 카지노의 바닥과 같은, 방의 전방 벽 상에 집합 표면을 갖는 LF 디스플레이 시스 템(450C)의 평면도를 도시한다. 이 예에서, LF 디스플레이 시스템(450D)은 전면 벽, 후면 벽, 제1 측 벽, 제2 측벽, 천장(도시되지 않음), 및 바닥(도시되지 않음)을 갖는 방 안에 위치된다. LF 디스플레이 시스템(450C)은 집합 표면으로부터 다양한 광선들을 투사한다. 집합 표면의 좌측으로 부터 투사된 광선들은 수평 각도 범위를 가지며, 집합 표면의 우측으로부터 투사된 광선들은 수평 각도 범 위를 가지며, 집합 표면의 중심으로부터 투사된 광선들은 수평 각도 범위를 가진다. 이러한 지 점들 사이에서, 투사된 광선들은 각도 범위의 중간 값을 취할 수 있다. 이런 식으로 디스플레이 표면에 걸쳐 투 사된 광선들에서 경사진 편향 각도를 갖는 것은 가시 부피(468C)를 생성한다. 또한, 이러한 구성은 측면 벽들 (456, 458)로 광선을 투사하여 디스플레이의 해상도를 낭비하는 것을 방지한다. 도 4f는 카지노의 바닥일 수도 있는 방의 전방 벽 상에 집합 표면을 갖는 LF 디스플레이 시스템 (450D)의 측면도를 도시한다. 이 예에서, LF 디스플레이 시스템(450E)은 전방 벽, 후방 벽, 제1 측벽 (도시되지 않음), 제2 측벽(도시되지 않음), 천장, 및 바닥을 포함한다. 이 예에서, 카지노 또는 방 은 제1 층 및 제2 층을 포함한다. 여기서, 각각의 층은 가시 서브부피(예를 들어, 가시 서브부피(470A 및 470B))를 포함한다. 하나의 층은 가시 서브부피들이 오버랩되지 않게 할 수 있다. 즉, 각각의 가시 서브부피는 해당 가시 서브부피로부터, 다른 가시 서브부피를 통과하지 않는 집합 표면으로의 시야 라인(line of sight)을 갖는다. 즉, 이러한 배향은 층들 사이의 수직 오프셋이 각각의 층으로 하여금 다른 층의 가시 서브부 피를 \"너머 볼\" 수 있게 하는, 다수의 층들, 경기장 좌석들 또는 발코니들을 생성한다. 오버랩되지 않는 가시 서브부피들을 포함하는 LF 디스플레이 시스템들은 오버랩되는 가시 부피들을 갖는 LF 디스플레이 시스템들보다 더 높은 품질의 가시 경험을 제공할 수 있다. 예를 들어, 도 4f에 도시된 구성에서, 가시 서브부피들(470A 및 470B)의 관찰자들에게 상이한 홀로그래픽 콘텐츠가 투사될 수 있다. LF 디스플레이 시스템의 제어 도 5a는 하나 이상의 실시예들에 따른, LF 디스플레이 시스템의 블록도이다. LF 디스플레이 시스템은 LF 디스플레이 어셈블리 및 컨트롤러를 포함한다. LF 디스플레이 어셈블리는 라이트필드(light field)를 투사하는 하나 이상의 LF 디스플레이 모듈들을 포함한다. LF 디스플레이 모듈은 다른 유형 의 에너지를 투사 및/또는 감지하는 통합된 에너지 소스(들) 및/또는 에너지 센서(들)를 포함하는 소스/센서 시 스템을 포함할 수 있다. 컨트롤러는 데이터 저장부, 네트워크 인터페이스, 및 LF 처리 엔 진을 포함한다. 컨트롤러는 또한, 추적 모듈, 및 관찰자 프로파일링 모듈을 포함할 수 있 다. 일부 실시예들에서, LF 디스플레이 시스템은 또한, 감각 피드백 시스템 및 추적 시스템을 포함한다. 도 1, 도 2, 도 3 및 도 4와 관련하여 설명된 LF 디스플레이 시스템들은 LF 디스플레이 시스템 의 실시예들이다. 다른 실시예들에서, LF 디스플레이 시스템은 본원에 설명된 것들보다 더 많은 또는 더 적은 모듈들을 포함한다. 유사하게, 기능들은 본원에 설명된 것과 다른 방식으로 모듈들 및/또는 다른 엔티티들 중에 분배될 수 있다. 또한, 게임 환경 내의 LF 디스플레이 시스템의 응용예가 도 6과 관련하여 아래에서 상세히 설명된다. LF 디스플레이 어셈블리는 가시 부피 내에 위치된 관찰자들에게 보일 수 있는 홀로그래픽 객체 부피 내에 홀로그래픽 콘텐츠를 제공한다. LF 디스플레이 어셈블리는 컨트롤러로부터 수신된 디스플레이 명령들 을 실행함으로써 홀로그래픽 콘텐츠를 제공할 수 있다. 홀로그래픽 콘텐츠는, LF 디스플레이 어셈블리의 집합 표면의 전방에, LF 디스플레이 어셈블리의 집합 표면 뒤에, 또는 이들의 일부 조합에 투사되는, 하나 이상의 홀로그래픽 객체들을 포함할 수 있다. 컨트롤러를 이용하여 디스플레이 명령들을 생성하는 것은 이 하에서 더 상세히 설명된다. LF 디스플레이 어셈블리는 LF 디스플레이 어셈블리에 포함된 하나 이상의 LF 디스플레이 모듈들(예를 들면, LF 디스플레이 모듈, LF 디스플레이 시스템, 및 LF 디스플레이 모듈 중 임의의 것)을 사 용하여 홀로그래픽 콘텐츠를 제공한다. 편의상, 하나 이상의 LF 디스플레이 모듈들은 본원에서 LF 디스플레이 모듈로 설명될 수 있다. LF 디스플레이 모듈은 LF 디스플레이 어셈블리를 형성하도록 타일링될 수 있다. LF 디스플레이 모듈들은 다양한 이음매 없는 표면 환경들(예를 들어, 단일 면, 다면, 영화관 벽, 만곡된 표면 등)로서 구조화될 수 있다. 즉, 타일형 LF 디스플레이 모듈들은 집합 표면을 형성한다. 전술한 바 와 같이, LF 디스플레이 모듈은 홀로그래픽 콘텐츠를 제공하는 에너지 장치층(예를 들어, 에너지 장치층 ) 및 에너지 도파층(예를 들어, 에너지 도파층)을 포함한다. 또한, LF 디스플레이 모듈은 홀로 그래픽 콘텐츠를 제공할 때 에너지 장치층과 에너지 도파층 간에 에너지를 전달하는 에너지 중계층(예를 들어, 에너지 중계층)을 포함할 수 있다. 또한, LF 디스플레이 모듈은 전술한 바와 같이 에너지 투사 및/또는 에너지 감지를 위해 구성된 다른 통합 시스템들을 포함할 수 있다. 예를 들어, 라이트필드 디스플레이 모듈은 에너지를 투사 및/또는 감지하도록 구성된 임의의 수의 에너지 장치들(예를 들어, 에너지 장치)을 포함할 수 있다. 편의상, LF 디스플레이 모 듈의 통합된 에너지 투사 시스템들 및 통합된 에너지 감지 시스템들은, 본원에서 집합적으로, 소스/센서 시스템으로서 기술될 수 있다. 소스/센서 시스템은 소스/센서 시스템이 LF 디스플레이 모듈 과 동일한 이음매 없는 에너지 표면을 공유하도록LF 디스플레이 모듈 내에 통합된다. 즉, LF 디스플 레이 어셈블리의 집합 표면은 LF 디스플레이 모듈 및 소스/센서 모듈 모두의 기능을 포함한다. 즉, 소스/센서 시스템을 갖는 LF 디스플레이 모듈을 포함하는 LF 어셈블리는 라이트필드를 투사 하면서 동시에 에너지를 투사 및/또는 감지할 수 있다. 예를 들어, LF 디스플레이 어셈블리는 전술한 바와 같이 듀얼-에너지 표면 또는 양방향 에너지 표면으로서 구성된 LF 디스플레이 모듈 및 소스/센서 시스템을 포함할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 감각 피드백 시스템을 이용하여, 생성된 홀로그래픽 콘 텐츠를 다른 감각 콘텐츠(예를 들어, 조정된 촉각, 청각, 또는 후각)로 증강한다. 감각 피드백 시스템은 컨트롤러로부터 수신된 디스플레이 명령들을 실행함으로써 홀로그래픽 콘텐츠의 투사를 증강시킬 수 있다. 일반적으로, 감각 피드백 시스템은 LF 디스플레이 어셈블리(예를 들어, 감각 피드백 시스템) 외 부에 있는 임의의 개수의 감각 피드백 장치를 포함한다. 일부 예시적인 감각 피드백 장치들은 조정된 음향 투사 및 수신 장치, 방향제 투사 장치, 온도 조절 장치, 힘 작동 장치, 압력 센서, 변환기 등을 포함할 수 있다. 일 부 경우에, 감각 피드백 시스템은 라이트필드 디스플레이 어셈블리와 유사한 기능을 가질 수 있고, 그 반대도 가능하다. 예를 들어, 감각 피드백 시스템 및 라이트필드 디스플레이 어셈블리 모두는 소 리 필드를 생성하도록 구성될 수 있다. 또 다른 예로서, 감각 피드백 시스템은, 라이트필드 디스플레이 어셈블리가 햅틱 표면을 생성하도록 구성되지 않는 동안, 햅틱 표면을 생성하도록 구성될 수 있다. 예를 들어, 라이트필드 디스플레이 시스템의 예시적인 실시예에서, 감각 피드백 시스템은 음향 투사 장치를 포함할 수 있다. 음향 투사 장치는 컨트롤러로부터 수신된 디스플레이 명령들을 실행할 때 홀로그 래픽 콘텐츠를 보완하는 하나 이상의 압력파를 생성하도록 구성된다. 생성된 압력파들은 예를 들어, 가청(소리 의 경우), 초음파(터치의 경우), 또는 이들의 일부 조합일 수 있다. 유사하게, 감각 피드백 시스템은 방향 제 투사 장치를 포함할 수 있다. 방향제 투사 장치는 컨트롤러로부터 수신된 디스플레이 명령들을 실행할 때 타 겟 영역의 일부 또는 전부에 향기를 제공하도록 구성될 수 있다. 방향제 장치들은 공기 순환 시스템(예를 들어, 덕트, 팬(fan), 또는 벤트)에 연결되어 타겟 영역 내의 기류를 조정할 수 있다. 또한, 감각 피드백 시스템(57 0)은 온도 조절 장치를 포함할 수 있다. 온도 조절 장치는 컨트롤러로부터 수신된 디스플레이 명령들을 실 행할 때 타겟 영역의 일부 또는 전부에서 온도를 증가 또는 감소시키도록 구성된다. 일부 실시예들에서, 감각 피드백 시스템은 LF 디스플레이 시스템의 관찰자들로부터 입력을 수신하도 록 구성된다. 이러한 경우에, 감각 피드백 시스템은 관찰자들로부터 입력을 수신하기 위한 다양한 감각 피 드백 장치들을 포함한다. 감각 피드백 장치들은 음향 수신 장치들(예를 들어, 마이크), 압력 센서, 조이스틱, 모션 검출기, 트랜스듀서 등과 같은 장치를 포함할 수 있다. 감각 피드백 시스템은 홀로그래픽 콘텐츠 및/또는 감각 피드백을 조정하기 위해 검출된 입력을 컨트롤러에 전송할 수 있다. 예를 들어, 라이트필드 디스플레이 어셈블리의 예시적인 실시예에서, 감각 피드백 시스템은 마이크를 포함 한다. 마이크는 하나 이상의 관찰자들에 의해 생성된 오디오(예를 들어, 그들의 대화의 콘텐츠, 말문 막힘 (gasp), 웃음 등)를 녹음하도록 구성된다. 감각 피드백 시스템은 녹음된 오디오를 관찰자 입력으로서 컨트 롤러에 제공한다. 컨트롤러는 홀로그래픽 콘텐츠를 생성하기 위해 관찰자 입력을 사용할 수 있다. 유 사하게, 감각 피드백 시스템은 압력 센서를 포함할 수 있다. 압력 센서는 관찰자에 의해 압력 센서로 인가 되는 힘을 측정하도록 구성된다. 감각 피드백 시스템은 측정된 힘을 관찰자 입력으로서 컨트롤러에 제공할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 추적 시스템을 포함한다. 추적 시스템은 타겟 영역 내의 관찰자들의 위치, 이동 및/또는 특성들을 결정하도록 구성된 임의의 수의 추적 장치들을 포함한다. 일반적 으로, 추적 장치들은 LF 디스플레이 어셈블리의 외부에 있다. 일부 예시적인 추적 장치들은 카메라 어셈블 리(\"카메라\"), 깊이 센서, 구조화된 광, LIDAR 시스템, 카드 스캐닝 시스템, 또는 타겟 영역 내의 관찰자를 추 적할 수 있는 임의의 다른 추적 장치를 포함한다. 추적 시스템은 타겟 영역의 일부 또는 전부에 빛을 비추는 하나 이상의 에너지 소스들을 포함할 수 있다. 그러나, 일부 경우에, 타겟 영역은 홀로그래픽 콘텐츠를 제공할 때 LF 디스플레이 어셈블리로부터의 자연 광 및/또는 주변광으로 조명된다. 에너지 소스는 컨트롤러로부터 수신된 명령들을 실행할 때 광을 투사한 다. 광은 예를 들어, 구조화된 광 패턴, 빛의 펄스(예를 들어, IR 플래시), 또는 이들의 일부 조합일 수 있다. 추적 시스템은 가시 대역(~380 nm 내지 750 nm), 적외선(IR) 대역(~750 nm 내지 1700 nm), 자외선 대역(10 nm 내지 380 nm), 전자기 스펙트럼의 일부 다른 부분, 또는 이들의 일부 조합의 광을 투사할 수 있다. 소스는 예를 들어, 발광 다이오드(LED), 마이크로 LED, 레이저 다이오드, TOF 깊이 센서, 튜닝가능한 레이저 등을 포함할 수 있다. 추적 시스템은 컨트롤러로부터 수신된 명령들을 실행할 때 하나 이상의 방출 파라미터를 조절할 수 있다. 방출 파라미터는 추적 시스템의 소스로부터 광이 어떻게 투사되는지에 영향을 주는 파라미터이다. 방출 파라미터는 예를 들어, 밝기, 펄스 속도(연속적인 조명을 포함하기 위함), 파장, 펄스 길이, 광이 소스 어셈블리로부터 어떻게 투사되는지에 영향을 주는 일부 다른 파라미터, 또는 이들의 일부 조합을 포함할 수 있다. 일 실시예에서, 소스는 비행 시간(time-of-flight) 동작으로 광의 펄스들을 투사한다. 추적 시스템의 카메라는 타겟 영역으로부터 반사된 광(예를 들어, 구조화된 광 패턴)의 이미지들을 캡처한 다. 카메라는 컨트롤러로부터 수신된 추적 명령들을 실행할 때 이미지들을 캡처한다. 전술한 바와 같이, 광은 추적 시스템의 소스에 의해 투사될 수 있다. 카메라는 하나 이상의 카메라들을 포함할 수 있다. 즉, 카메라는 예를 들어, 포토다이오드들의 어레이(1D 또는 2D), CCD 센서, CMOS 센서, 추적 시스템에 의해 광 투사의 일부 또는 전부를 검출하는 일부 다른 장치, 또는 이들의 일부 조합일 수 있다. 일 실시예에서, 추적 시 스템은 LF 디스플레이 어셈블리의 외부에 있는 라이트필드 카메라를 포함할 수 있다. 다른 실시예들 에서, 카메라는 LF 디스플레이 어셈블리에 포함된 LF 디스플레이 모듈의 일부로서 포함된다. 예를 들어, 전술한 바와 같이, 라이트필드 모듈의 에너지 중계 요소가 에너지 장치층에서 발광 디스플레이 및 이 미징 센서 모두를 인터리빙하는 양방향 에너지 층인 경우, LF 디스플레이 어셈블리는 라이트필드를 투사하 고 동시에 디스플레이 전방의 가시 영역으로부터의 이미징 정보를 기록하도록 구성될 수 있다. 일 실시예에서, 양방향 에너지 표면으로부터의 캡처된 이미지들은 라이트필드 카메라를 형성한다. 카메라는 캡처된 이미지들을 컨트롤러에 제공한다. 추적 시스템의 카메라는 컨트롤러로부터 수신된 추적 명령들을 실행할 때 하나 이상의 이미징 파라미 터들을 조절할 수 있다. 이미징 파라미터는 카메라가 이미지를 어떻게 캡처하는지에 영향을 주는 파라미터이다. 이미징 파라미터는 예를 들어, 프레임 레이트, 구경(aperture), 게인, 노출 길이, 프레임 타이밍, 롤링 셔터 또 는 전역 셔터 캡처 모드들, 카메라가 이미지들을 어떻게 캡처하는지에 영향을 주는 일부 다른 파라미터, 또는 이들의 일부 조합을 포함할 수 있다. 컨트롤러는 LF 디스플레이 어셈블리 및 LF 디스플레이 시스템의 임의의 다른 구성요소를 제어한 다. 컨트롤러는 데이터 저장부, 네트워크 인터페이스, 추적 모듈, 관찰자 프로파일링 모듈 , 및 라이트필드 처리 엔진을 포함한다. 다른 실시예들에서, 컨트롤러는 본원에 설명된 것들보 다 더 많은 또는 더 적은 모듈들을 포함한다. 유사하게, 기능들은 본원에 설명된 것과 다른 방식으로 모듈들 및 /또는 다른 엔티티들 중에 분배될 수 있다. 예를 들어, 추적 모듈은 LF 디스플레이 어셈블리 또는 추 적 시스템의 일부일 수 있다. 데이터 저장부는 LF 디스플레이 시스템에 대한 정보를 저장하는 메모리이다. 저장되는 정보는 디스플 레이 명령들, 추적 명령들, 방출 파라미터들, 이미징 파라미터들, 타겟 영역의 가상 모델, 추적 정보, 카메라에 의해 캡처된 이미지들, 하나 이상의 관찰자 프로파일들, 라이트필드 디스플레이 어셈블리를 위한 보정 데 이터, LF 모듈들의 해상도 및 배향을 포함하는 LF 디스플레이 시스템을 위한 구성 데이터, 원하는 가 시 부피 기하학, 3D 모델들, 장면들 및 환경들을 포함하는 그래픽 생성을 위한 콘텐츠, 재료들 및 텍스쳐들, LF 디스플레이 시스템에 의해 사용될 수 있는 다른 정보, 또는 이들의 일부 조합을 포함할 수 있다. 데이터 저장부는 읽기 전용 메모리(ROM), 동적 랜덤 액세스 메모리(DRAM), 정적 랜덤 액세스 메모리(SRAM), 또는 이들의 몇몇 조합과 같은 메모리이다. 네트워크 인터페이스는 라이트필드 디스플레이 시스템이 네트워크를 통해 다른 시스템들 또는 환경들과 통 신하게 한다. 일 예에서, LF 디스플레이 시스템은 네트워크 인터페이스를 통해 원격 라이트필드 디스 플레이 시스템으로부터 홀로그래픽 콘텐츠를 수신한다. 다른 예에서, LF 디스플레이 시스템은 네트워크 인 터페이스를 사용하여 홀로그래픽 콘텐츠를 원격 데이터 저장부에 전송한다. 추적 모듈은 LF 디스플레이 시스템에 의해 제공되는 콘텐츠를 관찰하는 관찰자들을 추적한다. 이를 위해, 추적 모듈은 추적 시스템의 소스(들) 및/또는 카메라(들)의 동작을 제어하는 추적 명령들을 생 성하고, 추적 시스템에 추적 명령들을 제공한다. 추적 시스템은 추적 명령들을 실행하고 추적 모듈 에 추적 입력을 제공한다. 추적 모듈은 타겟 영역 내의 하나 이상의 관찰자들의 위치(예를 들어, 게임 스테이션에 앉아 있거나 서 있 는 것, 카지노 층을 통과하여 걷는 것 등)를 결정할 수 있다. 결정된 위치는 예를 들어, 일부 기준점(예를 들어, 디스플레이 표면)에 대해 상대적일 수 있다. 다른 실시예들에서, 결정된 위치는 타겟 영역의 가상 모델 내에 있을 수 있다. 추적되는 위치는, 예를 들어, 관찰자의 추적된 위치 및/또는 관찰자의 일 부분의 추적된 위 치(예를 들어, 눈 위치, 손 위치 등)일 수 있다. 추적 모듈은 추적 시스템의 카메라들로부터 하나 이 상의 캡처된 이미지들을 사용하여 위치를 결정한다. 추적 시스템의 카메라들은 LF 디스플레이 시스템 주위에 분포될 수 있고, 스테레오 내의 이미지들을 캡처할 수 있으며, 추적 모듈이 관찰자들을 수동적으로추적할 수 있게 한다. 다른 실시예들에서, 추적 모듈은 관찰자들을 능동적으로 추적한다. 즉, 추적 시스템 은 타겟 영역의 일부 부분을 비추고, 타겟 영역을 이미징하며, 추적 모듈은 비행시간 및/또는 구조화 된 광 깊이 결정 기술들을 이용하여 위치를 결정한다. 추적 모듈은 결정된 위치들을 이용하여 추적 정보를 생성한다. 추적 모듈은 또한, LF 디스플레이 시스템의 관찰자들로부터의 입력들로서 추적 정보를 수신할 수 있 다. 추적 정보는 관찰자가 LF 디스플레이 시스템에 의해 제공되는 다양한 입력 옵션들에 대응하는 신체 움 직임들을 포함할 수 있다. 예를 들어, 추적 모듈은 관찰자의 신체 움직임을 추적하고, LF 처리 엔진 에 대한 입력으로서 임의의 다양한 이동을 할당할 수 있다. 추적 모듈은 추적 정보를 데이터 저장부, LF 처리 엔진, 관찰자 프로파일링 모듈, LF 디스플레이 시스템의 임의의 다른 구성요소, 또는 이들의 일부 조합에 제공할 수 있다. 추적 모듈에 대한 컨텍스트를 제공하기 위해, 사용자가 카드 게임을 플레이하면서 중요한 카드를 획득하거 나 룰렛에서 그들의 수가 당첨되는 것에 반응하는, LF 디스플레이 시스템의 예시적인 실시예를 고려한다. 예를 들어, 관찰자가 그들의 흥분을 나타내기 위해 공중에 주먹을 뻗는 것에 응답하여, 추적 시스템은 관 찰자의 손의 움직임을 기록하고, 그 기록을 추적 모듈에 전송할 수 있다. 추적 모듈은 이 기록에서 관찰자의 손의 움직임을 추적하고, 해당 입력을 LF 처리 엔진으로 전송한다. 후술하는 바와 같이, 관찰자 프로파일링 모듈은 이미지 내의 정보를, 관찰자의 손의 움직임이 긍정 반응과 연관되어 있다는 것을 나타 내는 것으로 결정하며, 이 컨텍스트에서는 관찰자가 이긴 것으로 해석될 수 있다. 따라서, LF 처리 엔진은 손, 숫자 등을 축하하기 위해 적절한 홀로그래픽 콘텐츠를 생성한다. 예를 들어, LF 처리 엔진은 장면에서 컨페티(confetti)를 투사할 수 있고, AI 홀로그래픽 캐릭터에 대한 응원 또는 축하 응답 등을 생성할 수 있다. LF 디스플레이 시스템은 관찰자들을 식별하고 프로파일링하도록 구성된 관찰자 프로파일링 모듈을 포 함한다. 관찰자 프로파일링 모듈은 LF 디스플레이 시스템에 의해 디스플레이되는 홀로그래픽 콘텐츠 를 관찰하는 관찰자(또는 관찰자들)의 프로파일을 생성한다. 관찰자 프로파일링 모듈은 관찰자 입력 및 모 니터링된 관찰자 행동, 동작, 및 반응에 부분적으로 기초하여 관찰자 프로파일을 생성한다. 관찰자 프로파일링 모듈은 추적 시스템(예를 들어, 기록된 이미지, 비디오, 소리 등)으로부터 획득된 정보에 액세스하고, 해당 정보를 처리하여 다양한 정보를 결정할 수 있다. 다양한 예들에서, 관찰자 프로파일링 모듈 은 관찰자 행동, 동작들, 및 반응들을 결정하기 위해 임의의 수의 머신 비전 알고리즘 또는 머신 히어링 (hearing) 알고리즘을 사용할 수 있다. 모니터링된 관찰자 행동은, 예를 들어, 미소, 응원, 박수, 웃음, 두려움, 비명, 흥분 레벨, 움츠림, 제스처의 다른 변화, 또는 관찰자들의 움직임 등을 포함할 수 있다. 보다 일반적으로, 관찰자 프로파일은 LF 디스플레이 시스템으로부터의 홀로그래픽 콘텐츠를 보는 관찰자에 대해 수신 및/또는 결정된 임의의 정보를 포함할 수 있다. 예를 들어, 각각의 관찰자 프로파일은 LF 디스플레이 시스 템에 의해 디스플레이되는 콘텐츠에 대해 해당 관찰자의 동작들 또는 반응들을 기록(log)할 수 있다. 관찰 자 프로파일에 포함될 수 있는 일부 예시적인 정보는 아래에서 제공된다. 일부 실시예들에서, 관찰자 프로파일은 디스플레이된 홀로그래픽 캐릭터, 배우, 장면, 게임 시나리오 등에 관한 관찰자의 반응을 기술할 수 있다. 예를 들어, 영화관의 관찰자는 대학교 로고를 표시하는 스웨트셔츠를 입고 있 다. 이 경우에, 관찰자 프로파일은 관찰자가 스웨트셔츠를 입고 있다는 것을 표시할 수 있고, 스웨트셔츠에 있 는 로고의 대학교와 관련된 홀로그래픽 콘텐츠를 선호할 수 있다. 보다 광범위하게, 관찰자 프로파일에 표시될 수 있는 관찰자의 특성들은 예를 들어, 나이, 성별, 인종, 옷, 장소에서의 가시 위치 등을 포함할 수 있다. 일부 실시예들에서, 관찰자 프로파일링 모듈은 관찰자로부터의 특성을 수신하고/하거나, 모니터링된 행동 에 기초하여 특성을 추론할 수 있다. 모니터링되는 행동은 관찰자가 특정 게임을 플레이하는 횟수, 관찰자가 그 러한 게임을 얼마나 오래 플레이하는지, 관찰자가 승, 패, 홀로그래픽 캐릭터로부터의 격려에 어떻게 반응하는 지, 또는 이들의 일부 조합을 포함할 수 있다. 일부 실시예들에서, 관찰자 프로파일은 LF 디스플레이 시스템 에 의해 디스플레이되는 홀로그래픽 콘텐츠에 대한 관찰자의 행동들 및/또는 응답들에 기초하여 직접 업데 이트될 수 있다. 일부 실시예들에서, 관찰자 프로파일은 바람직한 콘텐츠 특성에 관한 관찰자에 대한 선호도를 나타낼 수 있다. 예를 들어, 관찰자 프로파일은 관찰자가 그들의 가족 구성원 모두에게 적합한 나이 대의 홀로그래픽 콘텐츠만을 보기를 선호함을 나타낼 수 있다. 다른 예에서, 관찰자 프로파일은 (예를 들어, 벽 위에) 홀로그래픽 콘텐츠를 디스플레이하기 위한 홀로그래픽 객체 부피들 및 (예를 들어, 그들의 머리 위에) 홀로그래픽 콘텐츠를 디스플레 이하지 않기 위한 홀로그래픽 객체 부피들을 나타낼 수 있다. 관찰자 프로파일은 또한 관찰자가 그들 가까이에제공된 햅틱 인터페이스를 선호하거나, 이들을 회피하는 것을 선호함을 나타낼 수 있다. 다른 예에서, 관찰자 프로파일은 플레이된 게임의 이력 및 특정 관찰자에 대한 홀로그래픽 콘텐츠와의 상호작용 을 나타낸다. 예를 들어, 관찰자 프로파일링 모듈은 관찰자가 이전에 특정 게임을 플레이했다고 결정한다. 따라서, LF 디스플레이 시스템은 관찰자들이 게임을 플레이하는 이전의 시간과는 상이한 홀로그래픽 콘텐 츠를 디스플레이할 수 있다. 관찰자 프로파일링 모듈은 또한 관찰자 프로파일을 구현하기 위해 제3자 시스템 또는 시스템들로부터 특정 관찰자(또는 관찰자들)와 연관된 프로파일에 액세스할 수 있다. 예를 들어, 관찰자는 해당 관찰자의 소셜 미디 어 계정에 링크된 제3자 벤더를 사용하여 구매할 수 있다. 관찰자가 게임 환경에 들어갈 때, 관찰자 프로파일링 모듈은 그의 소셜 미디어 계정으로부터의 정보에 액세스하여 관찰자 프로파일을 구축(또는 증강)할 수 있 다. 일부 실시예들에서, 데이터 저장부는 관찰자 프로파일링 모듈에 의해 생성되고, 업데이트되고, 및/또 는 유지되는 관찰자 프로파일들을 저장하는 관찰자 프로파일 저장부를 포함한다. 관찰자 프로파일은 관찰자 프 로파일링 모듈에 의해 임의의 시간에 데이터 저장부에서 업데이트될 수 있다. 예를 들어, 일 실시예에서, 관찰자 프로파일 저장부는 특정 관찰자가 LF 디스플레이 시스템에 의해 제공되는 홀로그래픽 콘텐츠를 볼 때 그들의 관찰자 프로파일에 있는 특정 관찰자에 관한 정보를 수신 및 저장한다. 이 예에서, 관찰자 프로파일 링 모듈은 관찰자들을 인식할 수 있는 얼굴 인식 알고리즘을 포함하고, 관찰자들이 제시된 홀로그래픽 콘 텐츠를 바라볼 때 긍정 식별할 수 있다. 예를 들어, 관찰자가 LF 디스플레이 시스템의 타겟 영역에 진입함 에 따라, 추적 시스템은 관찰자의 이미지를 획득한다. 관찰자 프로파일링 모듈은 캡처된 이미지를 입 력하고, 얼굴 인식 알고리즘을 이용하여 관찰자의 얼굴을 식별한다. 식별된 얼굴은 프로파일 저장부 내의 관찰 자 프로파일과 연관되며, 그에 따라, 해당 관찰자에 대해 획득된 모든 입력 정보가 그들의 프로파일에 저장될 수 있다. 관찰자 프로파일링 모듈은 또한, 관찰자를 긍정적으로 식별하기 위해 카드 식별 스캐너, 음성 식별자, 무선-주파수 식별(RFID) 칩 스캐너, 바코드 스캐너 등을 이용할 수 있다. 관찰자 프로파일링 모듈이 관찰자들을 긍정 식별할 수 있기 때문에, 관찰자 프로파일링 모듈은 LF 디 스플레이 시스템에 대한 각각의 관찰자의 각각의 방문을 결정할 수 있다. 그 후, 관찰자 프로파일링 모듈 은 각각의 관찰자에 대한 관찰자 프로파일 내의 각각의 방문의 시간 및 날짜를 저장할 수 있다. 유사하게, 관찰자 프로파일링 모듈은 관찰자로부터 수신된 감각 피드백 시스템, 추적 시스템 및/또는 LF 디스플레이 어셈블리의 임의의 조합으로부터의 입력들이 발생할 때마다 그들을 저장할 수 있다. 관찰자 프 로파일 시스템은 또한 관찰자 프로파일과 함께 저장될 수 있는 컨트롤러의 다른 모듈들 또는 구성요 소들로부터 특정 관찰자에 관한 추가적인 정보를 수신할 수 있다. 그 후, 컨트롤러의 다른 구성요소들은 또한 해당 관찰자에게 제공될 후속 콘텐츠를 결정하기 위해, 저장된 관찰자 프로파일들에 액세스할 수 있다. LF 처리 엔진은, LF 디스플레이 어셈블리에 의해 실행될 때, LF 디스플레이 어셈블리로 하여금 홀로그래픽 콘텐츠를 제공하게 하는 래스터화된 포맷(\"래스터화된 데이터\")으로 4D 좌표들을 생성한다. LF 처리 엔진은 데이터 저장부로부터 래스터화된 데이터에 액세스할 수 있다. 추가적으로, LF 처리 엔진(53 0)은 벡터화된 데이터 세트로부터 래스터화된 데이터를 구성할 수 있다. 벡터화된 데이터는 이하에 설명된다. LF 처리 엔진은 또한, 홀로그래픽 객체들을 증강시키는 감각 콘텐츠를 제공하기 위해 필요한 감각 명령들 을 생성할 수 있다. 전술한 바와 같이, 감각 명령들은 LF 디스플레이 시스템에 의해 실행될 때, 햅틱 표면 들, 소리 필드들, 및 LF 디스플레이 시스템에 의해 지원되는 다른 형태의 감각 에너지를 생성할 수 있다. LF 처리 엔진은 데이터 저장부로부터의 감각 명령들에 액세스하거나, 감각 명령들을 구성하여 벡터화 된 데이터 세트를 형성할 수 있다. 종합하면, 4D 좌표들 및 감각 데이터는 홀로그래픽 및 감각 콘텐츠를 생성하 기 위해 LF 디스플레이 시스템에 의해 실행될 수 있는 디스플레이 명령들로서 홀로그래픽 데이터를 나타낸다. LF 디스플레이 시스템 내의 다양한 에너지 소스들을 통한 에너지의 흐름을 기술하는 래스터화된 데이터의 양은 매우 크다. 데이터 저장부로부터 액세스될 때 LF 디스플레이 시스템 상에 래스터화된 데이터를 디스플레이할 수 있지만, LF 디스플레이 시스템 상에서 효율적으로 전송하고 수신하며(예를 들어, 네트워 크 인터페이스를 통해), 이어서 래스터화된 데이터를 디스플레이할 수는 없다. 예를 들어, LF 디스플레이 시스템에 의한 홀로그래픽 투사를 위한 짧은 영화를 나타내는 래스터화된 데이터를 예로 들 수 있다. 이 예에서, LF 디스플레이 시스템은 수 기가비트 픽셀들을 포함하는 디스플레이를 포함하고, 래스터화된 데이 터는 디스플레이 상의 각각의 픽셀 위치에 대한 정보를 포함한다. 래스터화된 데이터의 대응하는 크기는 방대하 며(예를 들어, 영화 디스플레이 시간의 초당 수 기가바이트), 네트워크 인터페이스를 통해 상용 네트워크상에서 효율적으로 전송되도록 관리될 수 없다. 효율적인 전송의 문제는 홀로그래픽 콘텐츠의 라이브 스트리밍 을 포함하는 응용들에서 증폭될 수 있다. 데이터 저장부 상에 래스터화된 데이터를 단지 저장하는 추가적 인 문제점은, 감각 피드백 시스템 또는 추적 모듈로부터의 입력들을 이용하여 반응형 경험이 요구될 때 발생한다. 반응형 경험을 가능하게 하기 위해, LF 처리 엔진에 의해 생성된 라이트필드 콘텐츠는 감각 또는 추적 입력에 응답하여 실시간으로 변경될 수 있다. 즉, 일부 경우에, LF 콘텐츠는 단순히 데이터 저장부 로부터 판독되지 못할 수 있다. 따라서, 일부 구성들에서, LF 디스플레이 시스템에 의해 디스플레이하기 위한 홀로그래픽 콘텐츠를 나타내 는 데이터는 벡터화된 데이터 포맷(\"벡터화된 데이터\")으로 LF 처리 엔진에 전송될 수 있다. 벡터화된 데 이터는 래스터화된 데이터보다 여러 배(order)만큼 더 작을 수 있다. 또한, 벡터화된 데이터는 데이터의 효율적 인 공유를 가능하게 하는 데이터 세트 크기를 가지면서 높은 이미지 품질을 제공한다. 예를 들어, 벡터화된 데 이터는 보다 밀도 높은 데이터 세트로부터 도출된 희소 데이터 세트일 수 있다. 따라서, 벡터화된 데이터는, 조 밀한 래스터화된 데이터로부터 얼마나 희소한 벡터화된 데이터가 샘플링되는지에 기초하여, 이미지 품질과 데이 터 전송 크기 사이에 조정 가능한 균형을 가질 수 있다. 벡터화된 데이터를 생성하기 위한 조정 가능한 샘플링 은 주어진 네트워크 속도에 대한 이미지 품질의 최적화를 가능하게 한다. 결과적으로, 벡터화된 데이터는 네트 워크 인터페이스를 통해 홀로그래픽 콘텐츠의 효율적인 전송을 가능하게 한다. 벡터화된 데이터는 또한 홀 로그래픽 콘텐츠가 상용 네트워크를 통해 라이브 스트리밍될 수 있게 한다."}
{"patent_id": "10-2022-7010598", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하면, LF 처리 엔진은 데이터 저장부로부터 액세스된 래스터화된 데이터, 데이터 저장부로 부터 액세스된 벡터화된 데이터, 또는 네트워크 인터페이스를 통해 수신된 벡터화된 데이터로부터 도출된 홀로그래픽 콘텐츠를 생성할 수 있다. 다양한 구성들에서, 벡터화된 데이터는 데이터 전송 전에 인코딩될 수 있 고, LF 컨트롤러에 의한 수신 후에 디코딩될 수 있다. 일부 예들에서, 벡터화된 데이터는 데이터 압축과 관련된 추가된 데이터 보안 및 성능 향상을 위해 인코딩된다. 예를 들어, 네트워크 인터페이스에 의해 수신된 벡터화된 데이터는 홀로그래픽 스트리밍 애플리케이션으로부터 수신된 인코딩된 벡터화된 데이터일 수 있다. 일 부 예들에서, 벡터화된 데이터 내의 인코딩된 정보 콘텐츠에 액세스하기 위해, 벡터화된 데이터는 디코더, LF 처리 엔진, 또는 이들 모두를 필요로 할 수 있다. 인코더 및/또는 디코더 시스템들은 고객들에게 이용 가 능하거나 제3자 벤더들에게 라이센스 부여될 수 있다. 벡터화된 데이터는, 반응형 경험을 지원할 수 있는 방식으로 LF 디스플레이 시스템에 의해 지원되는 각각 의 감각 도메인에 대한 모든 정보를 포함한다. 예를 들어, 반응형 홀로그래픽 경험에 대한 벡터화된 데이터는 LF 디스플레이 시스템에 의해 지원되는 각각의 감각 도메인에 대한 정확한 물리적 특성을 제공할 수 있는 임의의 벡터화된 속성들을 포함할 수 있다. 벡터화된 속성들은 합성적으로 프로그램되고, 캡처되며, 컴퓨터로 평가되는 등일 수 있는 임의의 속성들을 포함할 수 있다. LF 처리 엔진은 벡터화된 데이터 내의 벡터화된 속성들을 래스터화된 데이터로 변환하도록 구성될 수 있다. 그 후, LF 처리 엔진은 LF 디스플레이 어셈블 리를 사용하여, 벡터화된 데이터로부터 변환된 홀로그래픽 콘텐츠를 투사할 수 있다. 다양한 구성들에서, 벡터화된 속성들은 하나 이상의 적색/녹색/청색/알파 채널(RGBA) + 깊이 이미지, 하나의 고해상도 중심 이미지 및 더 낮은 해상도의 다른 뷰들을 포함할 수 있는 다양한 해상도에서 깊이 정보를 갖거나 갖지 않는 다중 뷰 이 미지들, 알베도 및 반사도와 같은 재료 특성, 표면 법선, 다른 광학적 효과, 표면 식별, 기하학적 객체 좌표, 가상 카메라 좌표, 디스플레이 평면 위치, 조명 좌표, 표면에 대한 촉각적 강성(stiffness), 촉각적 연성, 촉각 적 강도, 소리 필드의 진폭 및 좌표, 환경 조건, 텍스처에 대한 기계 수용체와 관련된 체성감각 에너지 벡터, 또는 온도, 청각 및 임의의 다른 감각 도메인 속성을 포함할 수 있다. 많은 다른 벡터화된 속성들이 또한 가능 하다. LF 디스플레이 시스템은 또한 반응형 관찰 경험을 생성할 수 있다. 즉, 홀로그래픽 콘텐츠는 관찰자 위치, 제스처, 상호작용, 홀로그래픽 콘텐츠와의 상호작용, 또는 관찰자 프로파일링 모듈 및/또는 추적 모듈 로부터 도출된 다른 정보를 포함하는 입력 자극에 응답할 수 있다. 예를 들어, 일 실시예에서, LF 처리 시 스템은 네트워크 인터페이스를 통해 수신된 실시간 성능의 벡터화된 데이터를 이용하여 반응형 가시 경험을 생성한다. 다른 예에서, 홀로그래픽 객체가 관찰자 상호작용에 응답하여 즉시 특정 방향으로 이동할 필 요가 있는 경우, LF 처리 엔진은 장면의 렌더링을 업데이트하여 홀로그래픽 객체가 그 요구된 방향으로 이 동하게 할 수 있다. 이는, LF 처리 엔진으로 하여금 벡터화된 데이터 세트를 사용하여, 적절한 객체 배치 및 이동, 충돌 검출, 폐색(occlusion), 색상, 음영, 조명 등으로 관찰자 상호작용에 정확하게 응답하여, 3D 그 래픽 장면에 기초한 실시간으로 라이트필드들을 렌더링하는 것을 필요로 할 수 있다. LF 처리 엔진은 벡터 화된 데이터를 LF 디스플레이 어셈블리에 의한 표시를 위해 래스터화된 데이터로 변환한다.래스터화된 데이터는 실시간 성능을 나타내는 홀로그래픽 콘텐츠 명령들 및 감각 명령들(디스플레이 명령들)을 포함한다. LF 디스플레이 어셈블리는 디스플레이 명령들을 실행함으로써 실시간 공연의 홀로그래픽 및 감 각 콘텐츠를 동시에 투사한다. LF 디스플레이 시스템은 추적 모듈 및 관찰자 프로파일링 모듈을 이용하여 제공된 실시간 성능으로 관찰자 상호작용(예를 들어, 음성 응답, 터치 등)을 모니터링한다. 관찰자 상 호작용에 응답하여, LF 처리 엔진은 관찰자들에게 디스플레이하기 위해 추가적인 홀로그래픽 콘텐츠 및/또는 감 각 콘텐츠를 생성함으로써 대화형 경험을 생성한다. 예를 들어, 한 관찰자가 잭팟을 터뜨린 경우, 게임 환경의 천장으로부터 떨어지는 풍선들을 나타내는 복수의 홀 로그래픽 객체들을 생성하는 LF 처리 엔진을 포함한 LF 디스플레이 시스템의 예시적인 실시예를 고려 한다. 관찰자는 풍선을 나타내는 홀로그래픽 객체를 터치하기 위해 이동할 수 있다. 이에 대응하여, 추적 시스 템은 홀로그래픽 객체에 대한 관찰자의 손의 움직임을 추적한다. 관찰자의 움직임은 추적 시스템에 의해 기록되고 컨트롤러로 전송된다. 추적 모듈은 관찰자의 손의 움직임을 연속적으로 판단하고 판단 된 움직임들을 LF 처리 엔진에 전송한다. LF 처리 엔진은 장면 내의 관찰자의 손의 배치를 결정하고, 홀로그래픽 객체의 임의의 필요한 변화(위치, 색, 또는 폐색)를 포함하도록 그래픽의 실시간 렌더링을 조절한다. LF 처리 엔진은 (예를 들어, 초음파 스피커를 사용하여) 부피 햅틱 투사 시스템을 사용하여 촉 각 표면을 생성하도록 LF 디스플레이 어셈블리(및/또는 감각 피드백 시스템)에 명령한다. 생성된 촉 각 표면은 홀로그래픽 객체의 적어도 일부에 대응하고, 홀로그래픽 객체의 외부 표면의 일부 또는 전부와 실질 적으로 동일한 공간을 점유한다. LF 처리 엔진은 추적 정보를 사용하여, 관찰자가 풍선을 터치하는 시각적 및 촉각적 감각 모두를 인지하도록, 렌더링된 홀로그래픽 객체의 위치와 함께 촉각 표면의 위치를 이동시키도록 LF 디스플레이 어셈블리에 동적으로 명령한다. 보다 단순하게, 관찰자가 자신의 손이 홀로그래픽 풍선을 터치하는 것을 볼 때, 관찰자는 그들의 손이 홀로그래픽 풍선을 터치하는 것을 나타내는 햅틱 피드백을 느끼고, 동시에 풍선은 터치에 응답하여 위치 또는 움직임을 변경한다. 일부 예에서, 반응형 풍선은 네트워크 인터페이 스를 통해 라이브 스트리밍 애플리케이션으로부터 수신된 홀로그래픽 콘텐츠의 일부로서 수신될 수 있다. LF 처리 엔진은 또한, LF 디스플레이 시스템에 의해 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성 할 수 있다. 여기서 중요한 것은, 디스플레이를 위한 홀로그래픽 콘텐츠를 생성하는 것이 디스플레이를 위한 홀 로그래픽 콘텐츠에 액세스하거나, 수신하는 것과는 다르다는 것이다. 즉, 콘텐츠를 생성할 때, LF 처리 엔진 은 이전에 생성된 및/또는 수신된 콘텐츠에 액세스하는 것과 달리, 디스플레이를 위해 완전히 새로운 콘텐 츠를 생성한다. LF 처리 엔진은 추적 시스템, 감각 피드백 시스템, 관찰자 프로파일링 모듈 , 추적 모듈, 또는 이들의 일부 조합으로부터의 정보를 이용하여, 디스플레이를 위한 홀로그래픽 콘 텐츠를 생성할 수 있다. 일부 예들에서, LF 처리 엔진은 LF 디스플레이 시스템의 구성요소들(예를 들 어, 추적 정보 및/또는 관찰자 프로파일)로부터 정보를 액세스하고, 그 정보에 기초하여 홀로그래픽 콘텐츠를 생성하며, LF 디스플레이 시스템을 사용하여 생성된 홀로그래픽 콘텐츠를 응답으로서 디스플레이할 수 있 다. 생성된 홀로그래픽 콘텐츠는 LF 디스플레이 시스템에 의해 디스플레이될 때 다른 감각 콘텐츠(예를 들 어, 터치, 오디오 또는 냄새)로 증강될 수 있다. 또한, LF 디스플레이 시스템은 나중에 디스플레이될 수 있도록, 생성된 홀로그래픽 콘텐츠를 저장할 수 있다. 예를 들어, 홀로그래픽 캐릭터로부터의 응답은 관찰자의 반응 및/또는 다른 홀로그래픽 콘텐츠에 대한 반응들에 기초하여 특정 관찰자에 대해 구체적으로 생성될 수 있 다. 따라서, LF 처리 엔진은 아래에서 더 설명되는 바와 같이, 학습된 선호도들에 따라 관찰자에 대해 개 인화된 콘텐츠를 생성할 수 있다. LF 디스플레이 시스템을 위한 동적 콘텐츠 생성 일부 실시예들에서, LF 처리 엔진은 LF 디스플레이 시스템에 의해 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성하기 위해 인공지능(artificial intelligence, AI) 모델을 포함한다. AI 모델은 회귀 모델, 신경 망, 분류기, 또는 임의의 다른 AI 알고리즘을 포함하지만 이에 제한되지 않는, 지도 또는 비-지도 학습 알고리 즘을 포함할 수 있다. AI 모델은, 관찰자의 행동에 대한 정보를 포함할 수 있는, LF 디스플레이 시스템에 의해(예를 들어, 추적 시스템에 의해) 기록된 관찰자 정보에 기초하여 관찰자 선호도를 결정하는 데에 사 용될 수 있다. AI 모델은 홀로그래픽 콘텐츠를 생성하기 위해 데이터 저장부로부터의 정보에 액세스할 수 있다. 예를 들 어, AI 모델은 데이터 저장부 내의 관찰자 프로파일 또는 프로파일들로부터 관찰자 정보에 액세스할 수 있 거나, 또는 LF 디스플레이 시스템의 다양한 구성요소들로부터 관찰자 정보를 수신할 수 있다. AI 모델은 이전에 관찰된 홀로그래픽 콘텐츠에 대한 관찰자의 긍정 반응 또는 응답에 기초하여 선호도를 결정할 수 있다. 즉, AI 모델은 관찰자의 학습된 선호도에 따라 관찰자에게 개인화된 홀로그래픽 콘텐츠를 생성할 수 있다. AI모델은 또한, 데이터 저장부의 관찰자 프로파일 저장부 내의 각각의 관찰자의 학습된 선호도들을 저장할 수 있다. 관찰자들의 특성들을 식별하고, 반응을 식별하며, 및/또는 식별된 정보에 기초하여 홀로그래픽 콘텐츠를 생성하 는 데에 사용될 수 있는 AI 모델의 일 예는 노드 계층들을 갖는 콘볼루션(convolutional) 신경망 모델이며, 여 기서 현재 층의 노드들에서의 값들은 이전 층의 노드들에서의 값들의 변환이다. 모델의 변환은 현재 계층과 이 전 계층을 연결하는 가중치 및 파라미터 세트를 통해 결정된다. 예를 들어, AI 모델은 5개 층의 노드들, 즉, A, B, C, D, 및 E층들을 포함할 수 있다. A층으로부터 B층으로의 변환은 함수(W1)에 의해 주어지고, B층으로부터 C 층으로의 변환은 W2에 의해 주어지며, C층으로부터 D층으로의 변환은 W3에 의해 주어지고, D층으로부터 E층으로 의 변환은 W4에 의해 주어진다. 일부 예들에서, 변환은 또한, 모델의 이전 계층들 사이에서 변환하는 데 사용된 가중치들 및 파라미터들의 세트를 통해 결정될 수 있다. 예를 들어, D층으로부터 E층으로의 변환 W4는 A층으로부 터 B층으로의 변환 W1을 달성하기 위해 사용되는 파라미터들에 기초할 수 있다. 모델에 대한 입력은 콘볼루션 층(A) 상에 인코딩되는 시스템 추적에 의해 얻어진 이미지일 수 있고, 모델 의 출력은 출력 층(E)으로부터 디코딩되는 홀로그래픽 콘텐츠이다. 대안적으로 또는 추가적으로, 출력은 이미지 내의 관찰자의 결정된 특성일 수 있다. 이 예에서, AI 모델은 식별 계층(C) 내의 관찰자 특성을 나타내는 이미 지 내의 잠재 정보를 식별한다. AI 모델은 이미지 내의 임의의 특성, 동작, 반응 등을 식별하기 위해 콘볼루션 층(A)의 차원을 식별 층(C)의 차원으로 감소시킨다. 일부 예들에서, AI 모델은 그 다음에 홀로그래픽 콘텐츠를 생성하기 위해 식별 층(C)의 차원을 증가시킨다. 추적 시스템으로부터의 이미지는 콘볼루션 층(A)으로 인코딩된다. 콘볼루션 층(A) 내의 이미지들은 식별 층(C) 내의 다양한 특성들 및/또는 반응 정보 등과 관련될 수 있다. 이러한 요소들 간의 관련성 정보는 대응하 는 계층들 간에 일 세트의 변환들을 적용하여 인출될 수 있다. 즉, AI 모델의 콘볼루션 층(A)은 인코딩된 이미 지를 나타내고, 모델의 식별 층(C)은 미소짓는 관찰자를 나타낸다. 주어진 이미지 내의 미소짓는 관찰자들은, 콘볼루션 층(A)의 공간에서 이미지의 픽셀 값들에 변환들(W1 및 W2)을 적용함으로써 식별될 수 있다. 변환들을 위한 가중치들 및 파라미터들은 이미지에 포함된 정보와, 미소짓는 관찰자의 식별 사이의 관계를 나타낼 수 있 다. 예를 들어, 가중치들 및 파라미터들은 이미지 내의 미소짓는 관찰자를 나타내는 정보에 포함된 형상, 색상, 크기 등의 양자화(quantization)일 수 있다. 가중치들 및 파라미터들은 이력 데이터(예를 들어, 이전에 추적된 관찰자들)에 기초할 수 있다. 이미지 내의 미소짓는 관찰자들은 식별 층(C)에서 식별된다. 식별 층(C)은 이미지 내의 미소짓는 관찰자들에 대 한 잠재적인 정보에 기초하여 미소짓는 관찰자들을 식별한다. 이미지 내의 미소짓는 관찰자들을 식별하는 것은 홀로그래픽 콘텐츠를 생성하는 데에 사용될 수 있다. 홀로그래 픽 콘텐츠를 생성하기 위해, AI 모델은 식별 층(C)에서 시작하고, 식별 층(C) 내의 주어진 식별된 미소짓는 관 찰자들의 값에 변환들(W2 및 W3)을 적용한다. 변환들로 인해 출력 층(E)에서의 노드들의 세트가 생성된다. 변환 들에 대한 가중치들 및 파라미터들은 식별된 미소짓는 관찰자들 및 특정 홀로그래픽 콘텐츠 및/또는 선호도들 사이의 관계들을 나타낼 수 있다. 일부 경우에, 홀로그래픽 콘텐츠는 출력 층(E)의 노드들로부터 직접 출력되는 반면, 다른 경우에, 콘텐츠 생성 시스템은 출력 층(E)의 노드들을 홀로그래픽 콘텐츠로 디코딩한다. 예를 들어, 출력이 식별된 특성들의 세트이면, LF 처리 엔진은 그 특성들을 이용하여 홀로그래픽 콘텐츠를 생성할 수 있다. 추가적으로, AI 모델은 중간 층들로 알려진 층들을 포함할 수 있다. 중간 층들은 이미지, 특성/반응의 식별 등, 또는 홀로그래픽 콘텐츠의 생성에 대응하지 않는 층들이다. 예를 들어, 주어진 예에서, B층은 콘볼루션 층(A)과 식별 층(C) 사이의 중간 층이다. D층은 식별 층(C)과 출력 층(E) 사이의 중간 층이다. 은닉 층들은, 데이터에서 관찰되지는 않지만 특성들을 식별하고 홀로그래픽 콘텐츠를 생성할 때 이미지의 구성요소들 사이의 관계들을 지 배할 수 있는 상이한 식별의 측면들에 대한 잠재적인 표현들이다. 예를 들어, 은닉 층 내의 노드는 \"미소 짓고 웃는 사람들\"의 공통점을 공유하는 입력 값들 및 식별 값들에 대해 강한 연결들(예를 들어, 큰 가중치 값들)을 가질 수 있다. 다른 예로서, 은닉 층 내의 다른 노드는 \"소리지르고 겁먹은 사람들\"의 공통점을 공유하는 입력 값들 및 식별 값들에 대해 강한 연결들을 가질 수 있다. 물론, 신경망에는 임의의 수의 연결이 존재한다. 추가 적으로, 각각의 중간 층은, 예를 들어, 잔여 블록들, 콘볼루션 층들, 풀링 동작들, 연결들 건너뛰기, 뒤에 이어 붙이기(concatenation) 등과 같은 기능들의 조합이다. 임의의 수의 중간 층들(B)이 식별 층에 대한 콘볼루션 층 의 연결을 감소시키는 기능을 할 수 있고, 임의의 수의 중간 층들(D)이 출력 층에 대한 식별 층의 연결을 증가시키는 기능을 할 수 있다. 일 실시예에서, AI 모델은 강화 학습으로 훈련된 결정론적 방법들을 포함한다(따라서, 강화 학습 모델을 생성한 다). 모델은 입력들로서 추적 시스템으로부터의 측정들 및 출력들로서 생성된 홀로그래픽 콘텐츠에 대한 변화들을 사용하여 성능의 품질을 증가시키도록 훈련된다. 강화 학습은 기계가 수치적 보상 신호를 최대화하기 위해 '무엇을 할 것인가'(상황을 동작에 어떻게 매핑하는지)를 학습하는 머신러닝 시스템이다. 학습자(예를 들어, LF 처리 엔진)는 어떤 동작(예를 들어, 기술된 홀로그래픽 콘텐츠를 생성)을 취하도록 지시되지 않고, 대신에 동작들을 시도하여 어떤 동작들이 가장 많은 보상을 산출하는지를 발견(예를 들어, 더 많은 사람들을 응원함으로써 홀로그래픽 콘텐츠의 품질을 증가시 킴)한다. 일부 경우에, 동작들은 즉각적인 보상뿐만 아니라 그 다음 상황에도 영향을 미칠 수 있으며, 그 결과, 모든 후속 보상들에 영향을 줄 수 있다. 이러한 두 가지 특성(시행착오 검색 및 지연된 보상)은 강화 학습의 2 개의 주된 특징들이다. 강화 학습은 학습 방법을 특징짓는 것이 아니라 학습 문제를 특징 지음으로써 정의된다. 기본적으로, 강화 학습 시스템은 목표를 달성하기 위해 그 환경과 상호작용하는 학습 에이전트가 직면하는 문제의 중요한 측면들을 포 착한다. 즉, 공연자를 위한 노래를 생성하는 예에서, 강화 학습 시스템은 장소 내의 관찰자들에 대한 정보(예를 들어, 나이, 성향 등)를 캡처한다. 이러한 에이전트는 환경의 상태를 감지하고, 목표 또는 목표들을 달성하기 위해 상태에 영향을 주는(예를 들어, 관찰자들이 환호하는 팝송을 생성하는) 동작을 취한다. 가장 기본적인 형 태에서, 강화 학습의 공식은 학습자에 대한 세 가지 측면들, 즉, 감지, 동작, 목표를 포함한다. 노래의 예를 계 속하면, LF 처리 엔진은 추적 시스템의 센서들을 이용하여 환경의 상태를 감지하고, 환경 내의 관찰 자들에게 홀로그래픽 콘텐츠를 디스플레이하며, 그 노래에 대한 관찰자들의 인지의 척도인 목표를 달성한다. 강화 학습에서 발생하는 과제들 중 하나는 탐색(exploration)과 이용(exploitation) 간의 트레이드오프이다. 시 스템에서 보상을 증가시키기 위해, 강화 학습 에이전트는 과거에 시도했고 보상을 생산하는 데에 효과적인 것으 로 밝혀졌던 동작들을 선호한다. 그러나 보상을 생성하는 동작들을 발견하기 위해 학습 에이전트는 이전에 선택 하지 않은 동작들을 선택한다. 에이전트는 보상을 획득하기 위해 이미 알고 있는 정보를 '이용'하지만, 미래에 더 나은 동작 선택들을 하기 위해서 정보를 '탐색' 한다. 학습 에이전트는 다양한 동작들을 시도하고, 새 동작 들을 시도하는 동안 최상으로 보이는 것을 점진적으로 선호한다. 확률적 태스크에서, 각각의 동작은 일반적으로, 예상되는 보상에 대한 신뢰할 수 있는 추정을 얻기 위해 여러 번 시도된다. 예를 들어, LF 처리 엔 진이, 긴 시간 주기 후에 관찰자로 하여금 웃게 만드는 효과를 유도하는, LF 처리 엔진이 알고 있는 홀로그래픽 콘텐츠를 생성하는 경우, LF 처리 엔진은 관찰자가 웃을 때까지의 시간이 감소하도록 홀로그래픽 콘텐츠를 변경 할 수 있다. 또한, 강화 학습은 불확실한 환경과 상호작용하는 목표 지향적 에이전트의 전체 문제를 고려한다. 강화 학습 에 이전트는 명확한 목표를 갖고 있으며, 자신들의 환경의 측면들을 감지할 수 있고, 높은 보상(즉, 환호하는 군중)을 받을 수 있는 동작들을 선택할 수 있다. 또한, 에이전트들은 일반적으로 이들이 마주하는 환경에 대한 상당한 불확실성에도 불구하고 동작한다. 강화 학습이 계획을 포함하는 경우, 시스템은 환경 요소들이 어떻게 획득되고 개선되는지에 대한 질문뿐만 아니라, 계획 및 실시간 동작 선택 간의 상호작용을 해결한다. 강화 학습 이 진행되도록 하려면, 중요한 하위 문제들을 분리하고 연구해야 하는데, 하위 문제들은 완벽한 반응형의 목표 를 추구하는 에이전트에서 명확한 역할을 수행한다. 강화 학습 문제는 상호작용들이 처리되고 목표를 달성하기 위해 동작들이 수행되는 머신러닝 문제의 프레임을 작성하는 것이다. 학습자 및 의사 결정자는 에이전트(예를 들어, LF 처리 엔진)로 불린다. 에이전트 외부 의 모든 것을 포함하여 상호작용하는 것은 환경(예를 들어, 장소 내의 관찰자 등)이라고 불린다. 이들 둘은 연 속적으로 상호작용하며, 에이전트는 동작들(예를 들어, 홀로그래픽 콘텐츠를 생성)을 선택하고, 환경은 이러한 동작들에 응답하여 에이전트에게 새로운 상황들을 제공한다. 환경은 또한, 에이전트가 시간 경과에 따라 최대화 하려고 시도하는 특별한 숫자 값인 보상을 제공한다. 특정 상황에서, 보상은 홀로그래픽 콘텐츠에 대한 관찰자 의 긍정적인 반응을 최대화하도록 작용한다. 환경의 전부피인 사양은 강화 학습 문제점의 한 인스턴스인 태스크 를 정의한다. 더 많은 컨텍스트를 제공하기 위해, 에이전트(예를 들어, 콘텐츠 생성 시스템) 및 환경은 이산적인 시간 단계들의 시퀀스, 즉 t =0, 1, 2, 3 등의 각각에서 상호작용한다. 각각의 시간 단계 t에서, 에이전트는 환경의 상태 st의 일부 표현(예를 들어, 추적 시스템으로부터의 측정치들)을 수신한다. 상태들 st는 S 내에 있고,여기서 S는 가능한 상태들의 세트이다. 상태 st 및 시간 단계 t에 기초하여, 에이전트는 (예를 들어, 공연자가 다리찢기를 하도록 하는) 동작을 선택한다. 동작은 A(st) 내에 있으며, 여기서 A(st)는 가능한 동작들의 세트이 다. 하나의 시간 상태 후에, 자신의 동작의 결과로서 부분적으로, 에이전트는 수치적 보상 rt+1을 수신한다. 상 태 rt+1은 R 내에 있으며, 여기서 R은 가능한 보상들의 집합이다. 에이전트가 보상을 수신하면, 에이전트는 새로 운 상태 st+1에서 선택한다. 각각의 시간 단계에서, 에이전트는 상태들로부터 각각의 가능한 동작을 선택하는 확률들로의 매핑을 구현한다. 이 매핑은 에이전트의 정책이라고 부르며, πt로 표시되는데, 여기서 πt(s, a)는 st = s인 경우에 at = a일 확 률이다. 강화 학습 방법은 에이전트가 에이전트 동작들로 인해 발생한 상태들 및 보상들의 결과로서 자신의 정 책을 변경하는 방법을 지시할 수 있다. 에이전트의 목표는 시간이 경과함에 따라 수신하는 총 보상의 양을 최대 화하는 것이다. 이러한 강화 학습 프레임워크는 플렉시블하며, 여러 상이한 방식으로 많은 상이한 문제점들에 적용될 수 있다 (예를 들어 홀로그래픽 콘텐츠의 생성). 이 프레임워크는 센서, 메모리 및 제어 장치의 세부사항이 무엇이든 간 에, 목표 지향 행동을 학습하는 임의의 문제(또는 목적)가 에이전트와 그의 환경 사이를 오가는 세 개의 신호, 즉, 에이전트에 의해 행해진 선택을 나타내는 하나의 신호(동작), 선택이 이루어지는 기초를 나타내는 하나의 신호(상태), 및 에이전트의 목표를 정의하기 위한 하나의 신호(보상)로 감소될 수 있음을 제안한다. 물론, AI 모델은 임의의 개수의 머신 러닝 알고리즘을 포함할 수 있다. 사용될 수 있는 일부 다른 AI 모델들은 선형 회귀 및/또는 로지스틱 회귀, 분류 트리 및 회귀 트리, k-평균 클러스터링, 벡터 양자화 등이다. 어떤 경 우든, 일반적으로, LF 처리 엔진은 추적 모듈 및/또는 관찰자 프로파일링 모듈로부터 입력을 받 고, 머신 러닝 모델은 응답으로서 홀로그래픽 콘텐츠를 생성한다. 유사하게, AI 모델은 홀로그래픽 콘텐츠의 렌 더링을 지시할 수 있다. 일 예에서, LF 처리 엔진은 이미 존재하거나 제공된 광고 콘텐츠에 기초하여 홀로그래픽 콘텐츠를 생성할 수 있다. 즉, 예를 들어, LF 처리 엔진은 네트워크 인터페이스를 통해 네트워크 시스템으로부터 광고 를 요청할 수 있고, 네트워크 시스템은 응답으로서 홀로그래픽 콘텐츠를 제공하며, LF 처리 엔진은 광고를 포함하는 디스플레이를 위한 홀로그래픽 콘텐츠를 생성한다. 광고의 일부 예들은 제품들, 텍스트들, 비디오들 등을 포함할 수 있다. 광고들은 그 가시 부피 내의 관찰자들에 기초하여 특정 가시 부피들에 제공될 수 있다. 유사하게, 홀로그래픽 콘텐츠는 광고(예를 들어, 제품 배치)를 이용하여 영화를 증강시킬 수 있다. 가장 일반적 으로, LF 처리 엔진은 이전에 설명된 바와 같이 영화관 내의 관찰자들의 특성들 및/또는 반응들 중 임의의 것에 기초하여 광고 콘텐츠를 생성할 수 있다. 콘텐츠를 생성하는 이전 실시예들은 제한적이지 않다. 가장 광범위하게, LF 처리 엔진은 LF 디스플레이 시 스템의 관찰자들에게 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성한다. 홀로그래픽 콘텐츠는 LF 디스플 레이 시스템에 포함된 임의의 정보에 기초하여 생성될 수 있다. 홀로그래픽 콘텐츠 배포 네트워크 도 5b는 하나 이상의 실시예들에 따른, 예시적인 LF 게임 네트워크를 도시한다. 하나 이상의 LF 디스플레 이 시스템들이 LF 게임 네트워크에 포함될 수 있다. LF 게임 네트워크는 임의의 수의 LF 디스플레이 시스템들(예를 들어, 500A, 500B, 및 500C), LF 게임 생성 시스템, 및 네트워크를 통해 서로 연결되 는 네트워킹 시스템을 포함한다. 다른 실시예들에서, LF 게임 네트워크는 본원에 설명된 것들보다 더 많은 또는 더 적은 엔티티들을 포함한다. 유사하게, 기능들은 본원에 설명되는 것과는 상이한 방식으로 상이한 엔티티들 사이에 배포될 수 있다. 도시된 실시예에서, LF 게임 네트워크는 네트워크를 통해 홀로그래픽 콘텐츠를 수신하고, 카지노 또 는 다른 게임 환경(즉, 관찰자들)의 고객들에게 홀로그래픽 콘텐츠를 디스플레이할 수 있는 LF 디스플레이 시스 템들(500A, 500B, 및 500C)을 포함한다. LF 디스플레이 시스템들(500A, 500B, 및 500C)은 집합적으로 LF 디스 플레이 시스템으로 지칭된다. LF 게임 생성 시스템은 LF 디스플레이 시스템을 포함하는 카지노(또는 다른 게임 환경)에 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성하는 시스템이다. 홀로그래픽 콘텐츠는 게임 콘텐츠일 수 있거나, 카지노 층을 증강하는 홀로그래픽 콘텐츠일 수 있다. LF 게임 생성 시스템은 정보를 기록하고 홀로그래픽 콘텐츠를 생성하기 위해 임의의 수의 센서들 및/또는 프로세서들을 포함한다. 예를 들어, 센서는 이미지들을 레코딩하기 위 한 카메라, 오디오를 기록하기 위한 마이크, 물체들과의 상호작용을 기록하기 위한 압력 센서 등을 포함할 수 있다. LF 게임 생성 시스템은 기록된 정보를 조합하고, 그 정보를 홀로그래픽 및 감각 콘텐츠로서 인코딩 한다. LF 게임 생성 시스템은 인코딩된 홀로그래픽 콘텐츠를 관찰자들에게 디스플레이하기 위해 LF 디스플 레이 시스템들 중 하나 이상에 전송할 수 있다. 전술한 바와 같이, 효율적인 전송 속도를 위해, LF 디스플 레이 시스템(500A, 500B, 500C 등)에 대한 데이터가 네트워크를 통해 벡터화된 데이터로서 전송될 수 있다. 더 넓게는, LF 게임 생성 시스템은 카지노 또는 다른 게임 환경에서 LF 디스플레이 시스템에 의해 사용될 수 있는, 임의의 기록된 감각 데이터를 사용하여 게임 환경에서 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성 한다. 예를 들어, 감각 데이터는 녹음된 오디오, 기록된 이미지들, 객체들과의 기록된 상호작용들, 카드나 주사 위 같은 게임 요소들의 기록된 이미지들 또는 컴퓨터 그래픽 모델들, 카지노 입구에서 디스플레이들에 투사될 기록된 성적들 등을 포함할 수 있다. 많은 다른 유형의 감각 데이터가 사용될 수 있다. 예를 들어, 기록된 시각 적 콘텐츠는 3D 그래픽 장면, 3D 모델, 객체 배치, 텍스처, 색상, 음영, 및 조명, AI 모델을 사용하여 홀로그래 픽 형태로 변환될 수 있는 2D 필름 데이터 및 유사한 변환의 대규모 데이터 세트, 깊이 채널을 갖거나 갖지 않 는 다수의 카메라를 갖는 카메라 장비로부터의 다중 시점 카메라 데이터, 플렌옵틱(plenoptic) 카메라 데이터, CG 콘텐츠, 또는 많은 다른 유형의 콘텐츠를 포함할 수 있다. 일부 구성들에서, LF 게임 생성 시스템은 전용 인코더를 이용하여, 전술한 바와 같이 카지노에 대해 기록 된 감각 데이터를 벡터화된 데이터 포맷으로 감소시키는 인코딩 동작을 수행할 수 있다. 즉, 벡터화된 데이터에 대한 인코딩 데이터는 이미지 프로세싱, 오디오 프로세싱, 또는 네트워크를 통해 전송하기 쉬운 감소된 데 이터 세트를 초래할 수 있는 임의의 다른 계산들을 포함할 수 있다. 인코더는 산업 전문가들에 의해 사용되는 포맷들을 지원할 수 있다. 각각의 LF 디스플레이 시스템(예를 들어, 500A, 500B, 500C)은 네트워크 인터페이스를 통해 네트워크(55 2)로부터, 인코딩된 데이터를 수신할 수 있다. 이 예에서, 각각의 LF 디스플레이 시스템은 인코딩된 LF 디스플 레이 데이터를 디코딩하기 위한 디코더를 포함한다. 보다 분명하게, LF 처리 엔진은 디코더에 의해 제공되 는 디코딩 알고리즘들을 수신된 인코딩된 데이터에 적용함으로써 LF 디스플레이 어셈블리에 대한 래스터화 된 데이터를 생성한다. 일부 예들에서, LF 처리 엔진은 본원에 설명된 바와 같이 추적 모듈, 관찰자 프로 파일링 모듈, 및 감각 피드백 시스템으로부터의 입력을 사용하여 LF 디스플레이 어셈블리에 대한 래 스터화된 데이터를 추가로 생성할 수 있다. LF 디스플레이 어셈블리를 위해 생성된 래스터화된 데이터는 LF 게임 생성 시스템에 의해 기록된 홀로그래픽 콘텐츠를 재생한다. 중요하게, 각각의 LF 디스플레이 시스 템(500A, 500B, 및 500C)은 기하학적 구조, 해상도 등의 관점에서 LF 디스플레이 어셈블리의 특정 구성에 적합 한 래스터화된 데이터를 생성한다. 일부 구성들에서, 인코딩 및 디코딩 프로세스는 디스플레이하기 위해 고객들 에게 제공될 수 있거나 제3자에 의해 라이선스될 수 있는 사설 인코딩/디코딩 시스템 쌍의 일부이다. 일부 경우 에, 인코딩/디코딩 시스템 쌍은 콘텐츠 제작자들에게 공통의 프로그래밍 인터페이스를 제공할 수 있는 사설 API 로서 구현될 수 있다. 일부 구성들에서, LF 게임 네트워크 내의 다양한 시스템들(예를 들어, LF 디스플레이 시스템, LF 게 임 생성 시스템, 등)은 상이한 하드웨어 구성들을 가질 수 있다. 하드웨어 구성들은 물리적 시스템, 에너 지 소스, 에너지 센서, 햅틱 인터페이스, 감각 기능, 해상도, LF 디스플레이 모듈 구성, 또는 LF 게임 네트워크 내의 시스템의 임의의 다른 하드웨어 사양의 배열을 포함할 수 있다. 각각의 하드웨어 구성은 상이한 데 이터 포맷들로 감각 데이터를 생성하거나 이용할 수 있다. 이와 같이, 디코더 시스템은 데이터가 제공될 LF 디 스플레이 시스템을 위한 인코딩된 데이터를 디코딩하도록 구성될 수 있다. 예를 들어, 제1 하드웨어 구성을 갖 는 LF 디스플레이 시스템(예를 들어, LF 디스플레이 시스템(500A))은 제2 하드웨어 구성을 갖는 LF 필름 생성 시스템(예를 들어, LF 게임 생성 시스템)으로부터 인코딩된 데이터를 수신한다. 디코딩 시스템은 LF 디스 플레이 시스템(500A)의 제1 하드웨어 구성을 기술하는 정보에 액세스한다. 디코딩 시스템은, 디코딩된 데이터가 수신 LF 디스플레이 시스템(500A)의 LF 처리 엔진에 의해 처리될 수 있도록, 액세스된 하드웨어 구성을 사 용하여 인코딩된 데이터를 디코딩한다. LF 처리 엔진은 제2 하드웨어 구성에 기록되었음에도 불구하고 제1 하드웨어 구성을 위한 래스터화된 콘텐츠를 생성하고 제공한다. 유사한 방식으로, LF 게임 생성 시스템에 의해 기록된 홀로그래픽 콘텐츠는 하드웨어 구성들이 무엇이든지, 임의의 LF 디스플레이 시스템(예를 들어, LF 디스플레이 시스템(500B), LF 디스플레이 시스템(500C))에 의해 제공될 수 있다. 네트워크 시스템은 LF 게임 네트워크 내의 시스템들 간의 홀로그래픽 콘텐츠의 전송을 관리하도록 구 성된 임의의 시스템이다. 예를 들어, 네트워크 시스템은 LF 디스플레이 시스템으로부터 홀로그래픽 콘텐츠 에 대한 요청을 수신할 수 있고, LF 게임 생성 시스템으로부터 LF 디스플레이 시스템으로의 홀로그래픽 콘 텐츠의 전송을 용이하게 할 수 있다. 또한, 네트워크 시스템은 LF 게임 네트워크 내의 다른 LF 디스 플레이 시스템들에의 송신 및/또는 저장을 위한 홀로그래픽 콘텐츠, 관찰자 프로파일들, 홀로그래픽 콘텐 츠 등을 저장할 수 있다. 네트워크 시스템은 또한 전술한 바와 같이 홀로그래픽 콘텐츠를 생성할 수 있는 LF 처리 엔진을 포함할 수 있다. 네트워크 시스템은 홀로그래픽 콘텐츠의 디지털 저작권을 관리하기 위한 디지털 저작권 관리(digital rights management, DRM) 모듈을 포함할 수 있다. 예를 들어, LF 게임 생성 시스템은 홀로그래픽 콘텐츠를 네트워크 시스템에 전송할 수 있고, DRM 모듈은 디지털 암호화 포맷을 사용하여 홀로그래픽 콘텐츠를 암호 화할 수 있다. 다른 예에서, LF 게임 생성 시스템은 기록된 라이트필드 데이터를 DRM 모듈에 의해 관리될 수 있는 홀로그래픽 콘텐츠 포맷으로 인코딩한다. 네트워크 시스템은 각각의 LF 디스플레이 시스템이 복호화한 이후에 관찰자들에게 홀로그래픽 콘텐츠를 디스플레이할 수 있도록 디지털 암호화 키를 LF 디스플레이 시스템에 제공할 수 있다. 가장 일반적으로, 네트워크 시스템 및/또는 LF 게임 생성 시스템은 홀로그 래픽 콘텐츠를 인코딩하고, LF 디스플레이 시스템은 홀로그래픽 콘텐츠를 디코딩할 수 있다. 네트워크 시스템은 이전에 기록된 및/또는 생성된 홀로그래픽 콘텐츠에 대한 저장소로서 동작할 수 있다. 홀로그래픽 콘텐츠의 각각의 조각은, 수신될 때, 네트워크 시스템으로 하여금 트랜잭션 비용을 제공하는 LF 디스플레이 시스템에 홀로그래픽 콘텐츠를 전송하게 하는 트랜잭션 수수료와 연관될 수 있다. 예를 들 어, LF 디스플레이 시스템은 네트워크를 통해 홀로그래픽 콘텐츠에 대한 액세스를 요청할 수 있다. 상기 요청은 홀로그래픽 콘텐츠에 대한 트랜잭션 비용을 포함한다. 이에 응답하여, 네트워크 시스템은 관찰자들 에게 디스플레이하기 위한 홀로그래픽 콘텐츠를 LF 디스플레이 시스템에 전송한다. 다른 예들에서, 네트워크 시 스템은 또한 네트워크 시스템에 저장된 홀로그래픽 콘텐츠에 대한 가입 서비스로서 기능할 수 있다. 다른 예에서, LF 기록 시스템은 실시간으로 특정 성능의 라이트필드 데이터를 기록하고, 해당 성능을 나타내는 홀로그래픽 콘텐츠를 생성한다. LF 디스플레이 시스템은 홀로그래픽 콘텐츠에 대한 요청을 LF 기록 시스템 에 전송한다. 상기 요청은 홀로그래픽 콘텐츠에 대한 트랜잭션 비용을 포함한다. 이에 응답하여, LF 기록 시스템은 LF 디스플레이 시스템 상에 동시에 디스플레이하기 위한 홀로그래픽 콘텐츠를 전송한다. 네 트워크 시스템은 네트워크를 통해 트랜잭션 비용을 교환하고 및/또는 홀로그래픽 콘텐츠 데이터 흐름 을 관리하는 중개자로서 작용할 수 있다. 네트워크는 LF 게임 네트워크 내의 시스템들 사이의 통신 경로들을 나타낸다. 일 실시예에서, 네트워 크는 인터넷이지만, LAN(local area network), MAN(Metropolitan Area Network), WAN(wide area network), 모 바일, 유선 또는 무선 네트워크, 클라우드 컴퓨팅 네트워크, 사설 네트워크, 또는 가상 사설 네트워크, 및 이들 의 임의의 조합을 포함하지만 이에 제한되지 않는 임의의 네트워크일 수 있다. 또한, 링크들의 전부 또는 일부 는 SSL(secure sockets layer), 보안 HTTP 및/또는 VPN(virtual private network)과 같은 통상적인 암호화 기 술을 사용하여 암호화될 수 있다. 다른 실시예에서, 엔티티들은 전술한 것들 대신에 또는 이에 추가하여 커스텀 및/또는 전용 데이터 통신 기술들을 사용할 수 있다. 카지노 및 다른 게임 환경을 위한 라이트필드 디스플레이 시스템 도 6은 하나 이상의 실시예들에 따른, 게임 환경에서 다중 측면의 이음매 없는 표면을 형성하도록 타일링 되는 LF 디스플레이 시스템의 일 부분의 사시도이다. LF 디스플레이 시스템은 LF 디스플레이 모듈들 의 어레이를 형성하도록 타일링되는 복수의 LF 디스플레이 모듈들을 포함한다. 어레이는 예를 들어, 방의 표면의 일부 또는 전부(예를 들어, 하나 이상의 벽, 바닥 및/또는 천장)를 커버할 수 있다. 이 예에서, 관 찰자(예를 들어, 카지노 고객, 도박사 등)는 게임 환경의 게임 스테이션에서 게임(예를 들어, 크랩(crap), 룰렛, 블랙 잭, 포커, 슬롯 등)을 플레이하고, 어레이는 두 개의 홀로그래픽 캐릭터들, 즉, 홀로그 래픽 캐릭터 A 및 홀로그래픽 캐릭터 B를 투사하고 있다. 일 실시예에서, 관찰자는 홀로그래픽 캐릭터 A와 게임을 플레이하는 반면, 홀로그래픽 캐릭터 B는 카드 딜러이다. 홀로그래픽 캐릭터 A는 또한 그들이 플레이할 때 홀로그래픽 AI 구경꾼인 응원하는 관찰자일 수 있다. 다른 실시예에서, 홀로그래픽 캐릭터 A는 원격 위치로부터 관찰자와 게임을 플레이하는, 다른 사람의 홀로그래픽 표현 일 수 있다. 따라서, LF 디스플레이 시스템은 카지노 및 다른 게임 환경들과 같은 게임 시설들에서 관찰자 들을 격려하고 그들의 게임 경험을 향상시키는 홀로그래픽 게임들 및 캐릭터들의 환경 또는 생태계를 제공한다. 도 6에는 하나의 관찰자만이 도시되어 있지만, LF 디스플레이 시스템은 많은 관찰자들이 있는 라스베가스 스타일의 카지노에 배치될 수 있다는 것을 이해해야 한다. 또한, 게임 환경의 외관(예를 들어,장식, 테마 등)은 또한 각각의 관찰자의 명시적인 또는 추론된 선호도에 기초하여 각각의 개별 관찰자에 대한 홀로그래픽 콘텐츠로 사용자 맞춤화 또는 향상될 수 있다. 전술한 바와 같이, LF 디스플레이 시스템은 카메라, 마이크 등과 같은 다양한 센서를 통해, 게 임 환경, 그들의 게임 진행(예를 들어, 승, 패, 점수, 상금 등), 및 그들의 행동(예를 들어, 몸짓 언어, 얼굴 표정, 음성 톤, 소비된 음료수 등)을 통해 각각의 관찰자의 움직임을 추적하고 기록하는 인공지능(AI) 및 머신러닝(ML) 모델을 사용하여, 관찰자의 경험을 사용자 맞춤화할 수 있다. 다른 실시예에서, 전술한 바와 같이, 이미지 감지 요소들은 디스플레이 표면과 분리된 전용 센서들(예를 들어, 카메라들)일 수 있고, LF 디스플레이 모듈들은, 홀로그래픽 이미지를 투사하고 동시에 소스/센서 모듈의 일부로서 LF 디스플레 이 표면의 전방에 있는 이미징 영역을 감지하는, 양방향 에너지 중계부들을 구비할 수 있다. 이러한 실시예에서, 이미징 데이터는 홀로그래픽 콘텐츠의 투사와 동시에 LF 디스플레이 어셈블리의 집합 표면의 전방으로부터 캡처될 수 있다. 이미징 데이터는 게임 환경에서 사용자들의 3D 이미지를 캡처할 수 있고, 몇 개 의 카메라에만 발생할 수 있는 폐색(occlusion)을 회피할 수 있는, 라이트필드 비디오 데이터일 수 있다. 이러 한 풍부한 특징의 라이트필드 이미지들은 추적 모듈 또는 관찰자 프로파일링 모듈에 의해 분석될 더 완전한 데이터 세트를 제공할 수 있어서, 단지 하나의 2D 카메라가 사용되는 경우보다, 사용자의 반응, 분위기 또는 감정을 더욱 정확하게 평가할 수 있게 한다. 사용자 데이터가 하나 또는 다수의 2D 카메라들을 이용하여 수집되는지 또는 라이트필드 카메라를 이용하여 수집되는지에 관계없이, 데이터는 컨트롤러에 의해 분석되 어, 게임 환경 내에서의 그들의 관찰된 행동에 기초하여 관찰자들과 결합(engage)하는 사용자 맞춤형 AI 캐릭터(예를 들어, 홀로그래픽 캐릭터 A)를 구축할 수 있다. 예를 들어, 관찰자가 카드 게임에서 또 는 크랩을 플레이하는 동안 여러 번 계속 이기는 경우, 홀로그래픽 캐릭터 A는 그에게 응원의 박수와 코멘 트로 환호할 수 있다. 역으로, 추적 모듈 및 다양한 센서들을 통해 관찰되는 바와 같이, 관찰자가 지 고 있거나 감정적으로 혼란스러운 것으로 보이는 경우, 홀로그래픽 캐릭터 A는 위로와 격려의 말을 제공할 수 있다. 따라서, 관찰자가 헤드셋을 통해 디스플레이되는 가상 장면을 보는 것으로 제한되는 가상현실(VR: virtual reality) 환경에서와는 달리, LF 디스플레이 시스템은 더 많은 실제 홀로그래픽 캐릭터들을 이용 하여 훨씬 더 실감나는 센서 시스템을 통해 그들의 몸짓 언어, 음성 톤 등과 같은 관찰자에 의해 만들어지는 훨 씬 더 미묘한 단서들을 추적하고 그에 응답할 수 있다. 일 실시예에서, LF 처리 엔진은 관찰자를 격려하기 위한 구경꾼으로서 홀로그래픽 캐릭터 A를 생성한다. 추적 시스템은 홀로그래픽 캐릭터 A와 관찰자의 하나 이상의 상호작용에 대응하는 이 미지 데이터를 획득한다. 이러한 상호작용들은 관찰자로부터 홀로그래픽 캐릭터 A에 대한 구두 인사 와 같은 명시적인 상호작용일 수 있다. 그러나, 상호작용은 명시적인 상호작용일 필요는 없지만, 또한, 관찰자 가 예를 들어, 홀로그래픽 캐릭터 A로부터의 인사에 반응하는 방식일 수 있다. 예를 들어, 관찰자 가 홀로그래픽 캐릭터 A를 무시하거나 홀로그래픽 캐릭터 A로부터의 인사에 반응하여 회의적인 시선을 제공하는 것도 상호작용으로서 결정될 수 있다. 또한, 추적 모듈은 또한 관찰자의 위치, 관찰자의 움직임, 관찰자의 제스처, 관찰자의 표정, 관찰자의 시선, 관찰자의 나이, 관찰자의 성별, 관찰자에 의해 착용 된 의복의 식별, 및 관찰자에 대해 홀로그래픽 캐릭터 A 또는 다른 홀로그래픽 콘텐츠를 생성할 때의 관찰 자의 청각적 피드백을 사용할 수 있다. 추적 모듈 및 관찰자 프로파일 모듈은 모두, 관찰자로부 터의 상호작용과 연관된 어조, 의도, 및/또는 몸짓 언어를 식별하고 이 정보를 컨트롤러에 제공하여 적절 한 응답을 생성하도록 동작한다. 따라서, 컨트롤러는 AI 및/또는 ML 모델을 이용하여 상호작용에 반응하여 수행하도록, 홀로그래픽 캐릭터 A를 위한 응답을 생성한다. 상호작용 및 관찰자에 따라, 홀로그래픽 캐릭터 A의 응답은 격려의 말, 흥분의 말, 애도의 말, 미소, 손뼉을 치는 동작, 일반적인 작은 대화(예를 들어, \"그래서, 어디서 왔나요?\") 등 일 수 있다. 따라서, LF 디스플레이 시스템은 상이한 게임들, 승패에 대한 관찰자들의 감정 반응, 및 AI 홀로그래픽 캐릭터 상호작용들에 걸쳐 관찰자들을 추적하고, 시간에 따른 개개인에 대한, 사용자 프로파일링 모 듈과 관련하여 전술한 바와 같은 사용자 프로파일들을 발전시켜 기존의 데이터베이스를 발전시킬 수 있으 며, AI 모델을 계속 진화시켜 게임 환경 내의 AI 캐릭터들 및 다른 홀로그래픽 객체들로부터의 감정 반응들을 테스트하고 정교화하는 사회적 정보를 지속적으로 업데이트할 수 있다. 이는 게임 고객의 즐거움을 증가시키거 나, 개인화된 경험을 제공하거나, 또는 더 오랜 기간 동안 카지노 또는 다른 게임 시설에서 게임이 게임하고 돈 을 쓰도록 유지하기 위해 수행될 수 있다. 전술한 바와 같이, 관찰자 프로파일 모듈은 시간에 따라 지속적으로 업데이트되는 각각의 관찰자의 프로파 일을 유지하고 구축한다. 일 예에서, 컨트롤러는 상이한 레벨의 참여 또는 임계치에 기초하여 보상(예를들어, 무료 식사, 음료, 칩, 다양한 어트랙션에 대한 티켓 등)을 제공할 수 있다. 예를 들어, 임계 시간만큼 게 임을 플레이한 후에, 컨트롤러는 더 많이 플레이하도록 사용자에게 휴식을 위한 식사권을 생성할 수 있고, 많은 수의 무료 칩들의 인센티브로 재충전시킬 수 있다. 또 다른 예에서, 관찰자 프로파일 모듈은 관찰자 가 소비하는 음료들의 수를 모니터링할 수 있고, 해당 음료들의 수를 하나 이상의 게임 내에서의 그들의 위험 내성(risk tolerance)에 상관시킬 수 있다. 따라서, 특정 개수의 음료 섭취 이후에 특정 게임에 대한 더 높은 위험 내성을 갖는 사용자를 식별하는 것에 응답하여, 컨트롤러는 관찰자에게 다수의 음료 보상을 제공할 수 있다. 또한, 추적 시스템은, 속임수가 발생하기 전에, 그들의 프로파일 내의 정보에 기초하여 개인들의 특성을 식별하는 것을 포함하여, 속이는 사람의 추적을 돕는 것에 추가하여, 관찰자의 금속 상태에 대한 분석을 제공하 도록, 보안 시스템으로서 보강될 수 있다. 예를 들어, 전술한 바와 같이, LF 디스플레이 모듈이 라이트필 드 이미징 센서를 구비하는 경우, 예를 들어, 카드 게임을 플레이하는 관찰자에 대해 획득된 라이트필드 이미징 데이터는 적은 수의 제한된 카메라 각도로부터의 단순한 이미지 데이터보다 잠재적으로 비교적 훨씬 더 철저하고 유용할 수 있다. 이러한 라이트필드 이미징 데이터는, 예를 들어, 사용자의 얼굴 표정, 톤 또는 음성 등에 대한 데이터를 획득하는 것에 부가하여, 사용자의 3차원 모델 및 사용자의 움직임을 재구성하는데 사용될 수 있다. 그 후, 라이트필드 데이터는 플레이어가 속임수를 쓰거나(예를 들어, 카드를 카운팅하는 것, 다른 플 레이어와 통신하는 사용자를 나타내는 다른 의심되거나 반복적인 움직임들을 행하는 것 등), 그들의 움직임, 얼 굴 표정, 음성 톤, 게임 성적 등의 적어도 일부를 고려할 때 의심스러운 방식으로 행동하는 확률 또는 가능성을 식별하거나 예측하는 분류기 모델을 훈련시키는 데에 사용될 수 있다. 이러한 가능성은 플레이어 및/또는 플레 이어의 배경을 더 조사하기 위해 보안성을 경고하는 데에 사용될 수 있다. 다른 실시예들에서, 추적 시스템은 주어진 수의 예상 고객들에 대한 게임 환경 내의 영역 내에서 원하는 커버리지를 달성하기 위해, 임의의 수의 센서들 및 센서 유형들(예를 들어, 2D 이미징 카메라, 깊이 센서, 마이크, 압력 센서 등)을 포함할 수 있다. 일 실시예에서, 카드, 주사위, 마커, 휠, 및 다른 게임 객체들은 게임 스테이션에서 테이블 상판의 홀로그 래픽 디스플레이를 이용하여 투사될 수 있다. 홀로그래픽 캐릭터 B는 홀로그래픽 카드를 이동시키는 것(또 는 나눠주는 것), 섞는 것, 룰렛의 휠을 돌리는 것, 마커를 이동시키는 것 등으로 보이는 것을 포함하는, 통상 적인 딜러의 모든 기능을 수행하도록 투사될 수 있다. 일 실시예에서, 홀로그래픽 캐릭터 A는 관찰자가 위치하는 게임 환경으로부터 멀리 떨어진 위치 에서 관찰자와 동일한 게임을 플레이하는 제2 관찰자의 라이브 홀로그래픽 표현이다. 이 실시예에서, 컨트 롤러는 제2 관찰자가 위치하는 위치에서 하나 이상의 카메라들에 의해 캡처된 제2 관찰자의 이미지 데이터 를 수신한다. 따라서, LF 처리 엔진은 이러한 이미지 데이터를 획득하고, 관찰자 및 제2 관찰자가 다 른 물리적 위치로부터 게임을 동시에 플레이하는 동안에 관찰자에게 제공하기 위한, 게임 환경 내의 제2 관찰자의 라이브 홀로그래픽 표현을 생성한다. 이 예에서, 관찰자의 라이브 홀로그래픽 표현, 및 아마 도 게임 환경은 제2 관찰자의 위치에서 제2 관찰자에게 동시에 프리젠테이션하기 위해 생성되고 제공될 수 있다. 따라서, 관찰자와 제2 관찰자는 물리적으로 서로 수 백 마일 떨어져 위치할 수 있는 반면, 이들은 동일한 방에 함께 있는 것처럼 서로 동일한 게임을 플레이할 수 있다. 도 2b 및 도 4와 관련하여 전술한 바와 같이, LF 디스플레이 시스템은 추적 정보에 부분적으로 기초하여 각각의 관찰자에게 사용자 맞춤화된 하나 이상의 홀로그래픽 객체들을 제공할 수 있다. 이는 시스템으로 하여금 상이한 가시 서브부피들에 존재할 수 있는 상이한 관찰자들에게 상이한 홀로그래픽 콘텐츠를 선택적으로 제공하 게 한다. 따라서, LF 디스플레이 시스템은 게임 환경의 각각의 관찰자의 위치를 추적한다. 그 후, LF 디스플레이 시스템은 홀로그래픽 콘텐츠가 제공될 위치에 대한 그들의 상대적인 위치에 기초하여 특정 관 찰자에게 가시적이어야 하는 홀로그래픽 객체 또는 콘텐츠의 관점을 결정한다. 그 후, LF 디스플레이 시스템 은 이 결정된 관점에 대응하는 특정 픽셀들로부터 광을 선택적으로 방출한다. 일부 실시예들에서, 상이한 관찰자들은 도 2b에 도시된 바와 같이, 홀로그래픽 가시 부피의 상이한 가시 서브부피들(290A 내지 290D)에 존 재할 수 있다. 이는 동일한 게임 환경의 제1 관찰자 및 제2 관찰자로 하여금, 상이한 장식, 홀로그래픽 캐 릭터 의상 또는 복장 등을 포함하는 상이한 콘텐츠 테마들을 각각의 사용자에게 선택적으로 제공함으로써, 잠재 적으로 완전히 상이한 경험들을 동시에 가질 수 있게 한다. 또한, LF 처리 엔진은 관찰자 프로파일링 모듈 에 의해 저장된 정보에 기초하여 각각의 관찰자에 대한 테마를 선택하도록 구성될 수 있다. 일 예에서, 제 1 관찰자에게는 우주와 관련된 홀로그래픽 객체, 콘텐츠 및 장식이 제공될 수 있는 반면, 제2 관찰자에게는 사 파리 또는 정글과 관련된 홀로그래픽 객체, 콘텐츠 및 장식이 동시에 제공될 수 있다. 다른 실시예들에서, 홀로 그래픽 콘텐츠의 사용자 맞춤화는 관찰자(예를 들어, 특정 슬롯에서의 관찰자) 앞에 로컬 디스플레이에 의해 투사되고, 또는 홀로그래픽 콘텐츠는 테이블에서 일 그룹의 도박자들의 평균 나이 또는 결정된 관심을 언급할 수 있다. 다른 실시예들에서, 게임 환경은, 홀로그래픽 콘텐츠로 증강되어 관찰자의 이상적인 테마 또는 구조물(예 를 들어, 그들의 소셜 미디어 정보로부터 식별되거나 추론되는 관찰자들이 선호하는 TV쇼로 테마가 됨)에 매핑 하기 위해 게임의 외관을 변경하도록 동적으로 구성될 수 있는, 게임 스테이션들(예를 들어, 슬롯머신, 크 랩 테이블, 룰렛 등)을 포함할 수 있다. 다른 실시예에서, 게임은, 제1 게임 스테이션 유형과 연관된 게임에 관 찰자가 좌절하고 있어서 장면의 변화가 필요한 것으로 컨트롤러가 결정하는 것에 응답하여, 제1 게임 스테 이션 유형(예를 들어, 슬롯머신)으로부터 제2 게임 스테이션 유형(예를 들어, 룰렛)으로 동적으로 재구성된다. 다른 실시예에서, 게임은 게임의 홀로그래픽 버전이다. 예를 들어, 게임은 표면이 디지털 및 홀로그래픽이고 동 적으로 재구성될 수 있는, 홀로그래픽 핀볼 게임과 유사할 수 있다. 이 예에서, 홀로그래픽 게임은 실시간 엔진 및 물리계를 이용하여 임의의 테마를 가능하게 하고, 게임 경험을 실제 핀볼만큼 현실감 있게 만들 수 있다. 다 른 실시예에서, 홀로그래픽 콘텐츠는 게임의 일부를 시뮬레이션하기 위해 사용될 수 있다. 예를 들어, 몇몇 카 지노에서는, 주사위 게임에 대한 규제가 있고, 이 규제를 회피하면서 주사위 게임의 확률을 시뮬레이션하기 위 해 많은 상이한 방법이 고안되었다. 일 실시예에서, 예를 들어, 크랩(craps) 게임의 주사위는, 이러한 규제를 유사하게 우회하거나, 추가적인 주사위를 구매/제조할 필요성을 회피하거나, 그들의 공정성 등을 보장하기 위해 주사위의 크기 및 중량을 규제하기 위해, 홀로그래픽 주사위로 대체될 수 있다. 또한, LF 디스플레이 시스템은 홀로그래픽 휴게실 종업원, 컨시어지 서비스, 및 호텔 객실 종업원이나 개 인 비서를 포함하도록 게임 환경 전체에 걸쳐 배치될 수 있다. 관찰자에게 게임 경험을 제공하기 위해 획 득되고 사용되는 그와 동일한 정보는, 외식, 쇼핑, 어텐딩 쇼, 나이트라이프 및 관광을 포함하는, 호텔 및 카지 노의 다른 영역에서 관찰자의 체류를 향상시키는 데에 이용될 수 있다. 도 7은 하나 이상의 실시예들에 따른, 홀로그래픽 게임 콘텐츠를 관찰자에 제공하는 다수의 게임기들(705, 710)을 포함하는 게임 환경의 도면이다. 도 7은 제1 게임 및 제2 게임을 도시한다. 제1 게임기 및 제2 게임기은 각각, 전방 표면 상에 하나 이상의 LF 디스플레이 모듈들, 및 인접한 상부 표 면 상에 하나 이상의 LF 디스플레이 모듈들을 포함한다. 다른 실시예들에서, 게임기들(705, 710)의 기능과 일치하는 게임기는 하나의 LF 디스플레이 모듈, 또는 단지 전방 또는 상부 표면들 상에만 LF 디스플레이 모듈들을 가질 수 있다. 전술한 바와 같이, LF 디스플레이 모듈은 에너지 장치층(예를 들어, 에너지 장치층), 홀로그래픽 콘텐츠를 제공하는 에너지 도파층(예를 들어, 에너지 도파층), 및 게임기들 (705, 710)의 게임 부피 내에 게임 콘텐츠를 제공하는 게임기들(705, 710)을 포함한다. 따라서, 게임기들 (705, 710)은 하나 이상의 홀로그래픽 객체들을 하나 이상의 관찰자들에게 제공한다. 게임기들(705, 710)은 홀로그래픽 슬롯머신, 비디오 게임, 전자 게임(예를 들어, Keno), 룰렛, 블랙 잭, 크랩, 포커 등일 수 있다. 일 실시예에서, 게임기들(705, 710)은 홀로그래픽 게임 콘텐츠의 적어도 일 부분과 일치하는 햅틱 표면을 생성 하도록 구성된 하나 이상의 초음파 스피커들을 포함한다. 예를 들어, 홀로그래픽 게임 콘텐츠는 통상적인 슬롯 머신을 플레이하기 위해 사용자가 당기는 것처럼 홀로그래픽 슬롯머신 게임에 대한 홀로그래픽 슬롯머신 레버를 포함할 수 있다. 도 8은 LF 게임 네트워크 내에서 게임 환경의 홀로그래픽 콘텐츠를 디스플레이하기 위한 방법을 도시하는 흐름 도이다. 방법은 추가적인 또는 더 적은 단계들을 포함할 수 있으며, 단계들은 상이한 순서로 발생할 수 있 다. 또한, 다양한 단계들, 또는 단계들의 조합이 상기 방법의 실행 동안에 임의의 횟수로 반복될 수 있다. 시작으로서, LF 디스플레이 시스템(예를 들어, LF 디스플레이 시스템)을 포함하는 카지노 내의 카지노와 같은 게임 환경, 또는 게임 스테이션은 네트워크(예를 들어, 네트워크)를 통해 홀로그래픽 게임 콘텐츠에 대한 요청을 네트워크 시스템(예를 들어, 네트워크 시스템)에 전송한다. 일부 실시예들에서, 요청은 홀로그래픽 게임을 플레이하거나 홀로그래픽 게임 콘텐츠를 디스플레이하기에 충분한 요금(예를 들어, 거래 수 수료, 베팅, 내기 등)을 포함한다. LF 생성 시스템(예를 들어, LF 생성 시스템)은 홀로그래픽 게임의 LF 데이터를 생성 또는 검색하고, 대응 하는 홀로그래픽 게임 콘텐츠를 네트워크 시스템(예를 들어, 네트워크 시스템)에 전송한다. 네트워크 시스 템은 홀로그래픽 게임 콘텐츠를 LF 디스플레이 시스템(예를 들어, LF 디스플레이 시스템)에 전송한다. LF 디스플레이 시스템은 네트워크를 통해 네트워크 시스템으로부터 홀로그래픽 게임 콘텐츠를 수신한다. 게임 콘텐츠는 제1 데이터 포맷으로 인코딩될 수 있고, LF 디스플레이 어셈블리 상에 디스플레이하기 위해 LF 처리 엔진에 의해 제2 데이터 포맷으로 디코딩될 수 있다. 일 실시예에서, 제1 포맷은 벡터화된 데이터 포맷이 고, 제2 포맷은 래스터화된 데이터 포맷이다. LF 디스플레이 시스템은 게임 환경 또는 게임 콘솔에서의 프리젠테이션 공간 및/또는 LF 디스플레이 시스템의 구성을 결정한다. 예를 들어, LF 디스플레이 시스템은 해상도, 각도당 투사된 광선, 시야, 디스플레이 표 면 상의 편향 각도, 또는 LF 디스플레이 표면의 치수를 포함하는 LF 디스플레이의 하드웨어 구성을 기술하는 다 수의 파라미터들을 포함하는 구성 파일에 액세스할 수 있다. 또한, 구성 파일은 LF 디스플레이 패널들의 개수, 상대적 방향, 폭, 높이, 및 LF 디스플레이 패널들의 레이아웃을 포함하는 LF 디스플레이 어셈블리의 기하학적 방향에 관한 정보를 포함할 수 있다. 또한, 구성 파일은, 홀로그래픽 객체 부피, 가시 부피, 및 디스플레이 패 널에 대한 관찰자의 위치를 포함하는, 공연장의 구성 파라미터들을 포함할 수 있다. 일 예를 통해 설명하면, LF 디스플레이 시스템은 홀로그래픽 스포츠 이벤트 콘텐츠를 디스플레이하기 위한 가시 부피를 결정한다. 예를 들어, LF 디스플레이 시스템은 프리젠테이션 공간(예를 들어, 게임 환경 , 제1 게임, 제2 게임 등)의 레이아웃, 기하학적 구성, 및/또는 하드웨어 구성을 기술하는 LF 디스플레이 시스템 내의 정보에 액세스할 수 있다. 예를 들어, 레이아웃은 위치, 간격, 및 프리젠테이션 공간 내의 가시 위치들 또는 가시 부피들의 크기를 포함할 수 있다. 다양한 다른 실시예들에서, LF 디스플레이 시스 템은 장소 내의 임의의 위치에서 임의의 수 및 구성의 가시 부피들을 결정할 수 있다. LF 디스플레이 시스템은 게임 환경 내의 LF 디스플레이 시스템의 하드웨어 구성, 및 게임 환경의 특정 레이아웃 및 구성에 기초하여, LF 디스플레이 시스템 상에 제공하기 위한 홀로그래픽 콘텐츠(및 다른 감각 콘텐츠)를 생 성한다. 디스플레이하기 위한 홀로그래픽 게임 콘텐츠를 결정하는 것은 프레젠테이션 공간 또는 가시 부피 를 위한 홀로그래픽 게임 콘텐츠를 적절히 렌더링하는 것을 포함할 수 있다. LF 디스플레이 시스템은 각각의 가시 부피 내의 가시 위치들에서의 관찰자들이 적절한 홀로그래픽 게임 콘텐츠 를 인지하도록, 프리젠테이션 공간의 홀로그래픽 게임 부피에 홀로그래픽 게임 콘텐츠를 제공한다. LF 디스플레이 시스템은 관찰자들이 언제라도 홀로그래픽 게임 콘텐츠를 관찰하는 동안, 가시 부피 내의 관찰자 들에 관한 정보를 결정할 수 있다. 예를 들어, 추적 시스템은 가시 부피 내의 관찰자들의 얼굴 반응을 모니터링 할 수 있고, 관찰자 프로파일링 시스템은 가시 부피 내의 관찰자들의 특성에 관한 정보에 액세스할 수 있다. LF 디스플레이 시스템은 결정된 정보에 기초하여 디스플레이를 위한 홀로그래픽 게임 콘텐츠를 생성(또는 수정)할 수 있다. 예를 들어, LF 처리 엔진은 관찰자들이 전자 음악 축제를 즐긴다는 정보에 기초하여 홀로그래픽 게임 의 LF 디스플레이 시스템에 의해 동시에 디스플레이하기 위한 조명 쇼를 생성할 수 있다. 추가 구성 정보 본 개시의 실시예들에 대한 전술한 설명은 예시의 목적으로 제공되었지만, 개시된 정확한 형태들로 배타적으로 또는 본 개시를 제한하는 것으로 의도되는 것은 아니다. 통상의 기술자는 위의 개시 내용에 비추어 많은 수정 및 변형이 가능하다는 것을 이해할 수 있다. 본 설명의 일부 부분들은 정보에 대한 동작들의 알고리즘들 및 기호 표현들의 관점에서 본 개시의 실시예들을 기술한다. 이러한 알고리즘 설명들 및 표현들은 작업 내용을 다른 통상의 기술자들에게 효과적으로 전달하기 위 해, 데이터 처리 분야의 통상의 기술자들에 의해 통상적으로 사용된다. 이러한 동작들은, 기능적으로, 계산적으 로, 또는 논리적으로 기술되지만, 컴퓨터 프로그램들 또는 균등한 전기 회로들, 마이크로코드 등에 의해 구현되 는 것으로 이해된다. 나아가, 일반성을 잃지 않고, 이러한 동작들의 모듈들을 모듈들로 지칭하는 것이 종종 편 리하다는 것이 입증되었다. 설명된 동작들 및 그들의 연관된 모듈들은 소프트웨어, 펌웨어, 하드웨어, 또는 이 들의 임의의 조합으로 구현될 수 있다. 본원에 설명된 단계들, 동작들, 또는 프로세스들 중 임의의 것은 하나 이상의 하드웨어 또는 소프트웨어 모듈들 로, 단독으로 또는 다른 장치들과 조합하여 수행되거나 구현될 수 있다. 일 실시예에서, 소프트웨어 모듈은, 기 술된 단계들, 동작들, 또는 프로세스들 중 임의의 것 또는 전부를 수행하기 위해 컴퓨터 프로세서에 의해 실행 될 수 있는 컴퓨터 프로그램 코드를 포함하는 컴퓨터-판독가능 매체를 포함한, 컴퓨터 프로그램 제품으로 구현 된다. 본 개시의 실시예들은 또한, 본원에서의 동작들을 수행하기 위한 장치에 관한 것일 수 있다. 이 장치는 필요한 목적을 위해 특별히 구성될 수 있고/있거나, 컴퓨터에 저장된 컴퓨터 프로그램에 의해 선택적으로 활성화되거나 재구성되는 범용 컴퓨팅 장치를 포함할 수 있다. 이러한 컴퓨터 프로그램은 비-일시적, 유형의 컴퓨터 판독가능저장 매체, 또는 컴퓨터 시스템 버스에 연결될 수 있는 전자 명령들을 저장하기에 적합한 임의의 유형의 매체에 저장될 수 있다. 또한, 본 명세서에서 언급되는 임의의 컴퓨팅 시스템들은 단일 프로세서를 포함할 수 있거나, 증가된 컴퓨팅 능력을 위해 다수의 프로세서 설계들을 이용하는 아키텍처일 수 있다. 본 개시의 실시예들은 또한, 본원에 기술된 컴퓨팅 프로세스에 의해 생성되는 제품에 관한 것일 수 있다. 이러 한 제품은 컴퓨팅 프로세스로부터 발생하는 정보를 포함할 수 있으며, 여기서 해당 정보는 비-일시적인 유형의 컴퓨터 판독가능 저장 매체 상에 저장되고, 본원에 기술된 컴퓨터 프로그램 제품 또는 다른 데이터 조합의 임의 의 실시예를 포함할 수 있다. 마지막으로, 본 명세서에서 사용되는 언어는 주로 가독성 및 교육 목적을 위해 선택되었고, 본 발명의 청구 대 상을 기술하거나 제한하기 위해 선택되지 않았을 수 있다. 따라서, 본 개시의 범위는 이러한 상세한 설명에 의 해 제한되는 것이 아니라, 본원에 기초하여 발행하는 임의의 청구항들에 의해 제한되는 것으로 의도된다. 따라 서, 실시예들의 개시는 다음의 청구항들에 제공된 본 개시의 범위를 제한하는 것이 아니라 예시적인 것이다.도면 도면1 도면2a 도면2b 도면3a 도면3b 도면4a 도면4b 도면4c 도면4d 도면4e 도면4f 도면5a 도면5b 도면6 도면7 도면8"}
{"patent_id": "10-2022-7010598", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 하나 이상의 실시예들에 따른 홀로그래픽 객체를 제공하는 라이트필드 디스플레이 모듈의 도면이다. 도 2a는 하나 이상의 실시예들에 따른, 라이트필드 디스플레이 모듈의 일부분의 단면도이다. 도 2b는 하나 이상의 실시예들에 따른, 라이트필드 디스플레이 모듈의 일부분의 단면도이다. 도 3a는 하나 이상의 실시예들에 따른, 라이트필드 디스플레이 모듈의 사시도이다. 도 3b는 하나 이상의 실시예들에 따른, 인터리빙(interleaved)된 에너지 중계 장치들을 포함하는 라이트필드 디 스플레이 모듈의 단면도이다. 도 4a는 하나 이상의 실시예들에 따른, 단일 측면의 이음매 없는 표면 환경을 형성하기 위해 2차원으로 타일링 (tiled)되는 라이트필드 디스플레이 시스템의 일부의 사시도이다. 도 4b는 하나 이상의 실시예들에 따른, 다중-측면의 이음매 없는 표면 환경에서의 라이트필드 디스플레이 시스 템의 일부의 사시도이다. 도 4c는 하나 이상의 실시예들에 따른, 날개형 구성의 집합 표면을 갖는 라이트필드 디스플레이 시스템의 평면 도이다. 도 4d는 하나 이상의 실시예들에 따른, 경사진 구성의 집합 표면을 갖는 라이트필드 디스플레이 시스템의 측면 도이다. 도 4e는 하나 이상의 실시예들에 따른, 방의 전면 벽 상에 집합 표면을 갖는 라이트필드 디스플레이 시스템의 평면도이다. 도 4f는 하나 이상의 실시예들에 따른, 방의 전면 벽 상에 집합 표면을 갖는 LF 디스플레이 시스템의 측면도이 다. 도 5a는 하나 이상의 실시예들에 따른, 라이트필드 디스플레이 시스템의 블록도이다. 도 5b는 하나 이상의 실시예들에 따른, 예시적인 LF 필름 네트워크를 도시한다. 도 6은 하나 이상의 실시예들에 따른, 관찰자들에게 홀로그래픽 콘텐츠를 제공하는 게임 환경에서의 LF 디스플 레이 시스템의 도면이다. 도 7은 하나 이상의 실시예들에 따른, 홀로그래픽 게임 콘텐츠를 관찰자에게 제공하는 다수의 게임기들을 포함하는 게임 환경에서의 LF 디스플레이 시스템의 도면이다. 도 8은 LF 게임 네트워크 내에서 게임 환경의 홀로그래픽 콘텐츠를 디스플레이하기 위한 방법을 도시하는 흐름 도이다. 도면들은 단지 예시를 위해 본 발명의 다양한 실시예들을 도시한다. 통상의 기술자는 본원에 기재된 본 발명의 원리로부터 벗어남 없이 본원에 설명된 구조들 및 방법들의 대안적인 실시예들이 이용될 수 있음을 다음의 설명 으로부터 쉽게 인식할 것이다."}
