{"patent_id": "10-2018-7017807", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0088673", "출원번호": "10-2018-7017807", "발명의 명칭": "수퍼 리저버, 배터리 및 인터넷 연결이 가능한 슈퍼 스마트 SAFARI 360° 냉장고 및 냉동고", "출원인": "사파리 케르만사히 카말", "발명자": "사파리 케르만사히 카말"}}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "중앙 냉장고와 냉동고는 360 °, 다각면 및 원형으로 볼 수 있으며 수동으로 회전하고 수동으로 움직이며 센터실린더의 상부에 물과 배터리를 보관하고 내부 및 소유자 및 / 또는 소유자와 연결된 스마트 디지털 시스템으로저장할 수 있다. 인근 매장에서 메시지 및 이미지를 주고받을 수 있는 외부 카메라, 원격 제어 및 위성 전화 및소비자가 한쪽에서 제한된 액세스가 아닌 모든 측면에서 액세스할 수 있는 가능성."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "한정된 단면 사용이 제거되었기 때문에 부엌 모서리와 벽과 인접한 찬장 옆에 있는 대신 부엌과 리셉션 홀 사이에 놓을 수 있지만 모든 측면의보다 효율적이고 효율적인 사용이 사용된다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "지능형 조절 식 트랩 도어를 통한 중앙 파이프 라인을 통한 공간과 제어 가능한 관계를 고려하여 냉장고 및 /또는 냉동고의 결합 된 사용만을 고려하여 치료 시스템이 온도와 균형을 지능적으로 조정할 수 있는 능력 상기인접한 유닛들은 상기 분리된 온도 냉장고 및 상기 저장 공간의 요구되는 온도를 제어할 수 있는 복수의 도어를구비 한 다른 온도 공간 냉장고의 적어도 2개의 주요 인접 공간 및 냉동실의 2개의 주요 인접 공간을 변경하고조정한다. 서로 다른 재질의 냉각 요구로 인해 에너지 및 효율성이 절감된다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "엔진과 냉각 시스템을 중간(중간 수직 공기 덕트)으로 옮기고 중간 수직 공기 덕트 상단에 배기 팬을 설치한다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "이동식 및 회전식 지지용 냉장고는 배터리 및 백본 스탠드가 설치된 지하 근처에 주요 플랫폼을 배치한다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "주변 환경에 대한 접근이 한 쪽에서 360도까지 증가할 수 있다는 점을 감안하면 냉장고 및 냉동고의 액세스 도어는 2개의 측면 도어에서 더 많은 도어로 증가한다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "인접한 두 개의 도어가 냉장고와 다른 유형의 냉동 캐비닛 옆에 2개의 다른 인접한 도어 (나란히 설치된 냉장고및 나란히 설치된 냉동 캐비닛)로 배치된다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2018-0088673-3-다각형, 커브 및 원형 테이블을 사용하고 새 모델에서 필요한 문을 최대 360°까지 설계한다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "액티브 서포트 플랫폼의 냉장고 및 냉동실의 몸통은 수동 또는 원격 제어를 통해 중앙 메인 웰 근처로 이동하고다른 휠 및 볼 베어링은 중심축을 중심으로 회전한다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "인터넷을 통해 셀룰러 네트워크와 전화 시스템을 원격으로 열고 닫을 수 있으며 원격 전자 패널은 냉장고와 냉동고 및 기타 측면 공간의 온도를 높이거나 낮춘다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "냉장고의 내부 공간에는 카메라가 장착되어 있고 지능형 시스템을 통해 소유자의 휴대 전화로 이미지를 보내거나 소정의 상점에 연결하여 필요한 소모품 목록과 정보량을 줄이고 냉장고가 놓여져 있는 주소로 보내고 준비한다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "이 모델에는 재충전 배터리와 긴급 상황에서 네트워크 물과 독립적으로 냉장고를 사용하고 장기간 사용 환경에서 사용할 수 있도록 일정 시간 동안 사용할 수 있는 상부 저수지가 장착되어 있다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제조 트렁크 및 도어의 독립적인 다른 부분을 조립하여 운반을 용이하게 하고 한 장치에서 여러 개의 작은 장치로 무게를 줄일 수 있다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "냉장고가 고정된 위치에 있을 때, 전원과 물은 냉장고 하부의 메인 브래킷을 통해 연결된다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "모니터와 스피커는 문 양쪽과 상단 문에 위치하며 냉장고의 중앙 인텔리전트 시스템의 상태와 경보를 표시하고TV, 멀티미디어 및 위성 채널 (예 : 요리 연습)을 표시하는 데 사용된다. 또한, 휴대용 저장 장치를 시스템에연결할 수 있다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "모델에는 중앙 컴퓨터 처리 시스템과 배터리 전원이 장착되어 있으며 각 부품은 별도로 배치되어 트렁크 도어힌지 위의 네 모퉁이에 배치된다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "냉장고는 360°까지 모든 각도에서 사용할 수 있습니다. 홀과 부엌 구석에 90°보다 크거나 작은 각도로 360°공개특허 10-2018-0088673-4-미만의 각도로 배치할 수도 있다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "주 문과 선반 옆에 있는 작은 문은 슬라이딩되어 있으며 리모컨을 통해 수동 또는 자동으로 위아래로 움직일 수있다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "문을 통합하려면 상단과 하단에 특수 자물쇠를 추가한다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "구성 및 비율은 냉장고 구성품의 형태로 사용된다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "중앙 컴퓨터 시스템은 냉장고에서 제조업체로 정보를 보내고 받을 수 있으며, 소유자와 상점은 원격 진단, 문제해결 및 펌웨어 업데이트를 위해 다른 통신 시스템을 사용한다."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "음성 및 이미지 인식 기능이 있는 인공 지능 개인 비서 시스템을 이용한 사용자 인터페이스 연결."}
{"patent_id": "10-2018-7017807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "얼음 기계, 냉동기, 급속 냉동 시스템, 차와 커피 기계 및 전자레인지 사이의 공간, 조리실과 온도 조절이 가능한 케이크 및 패스트리를 보관할 수 있는 별도의 도어가 있는 특수 공간, 야채 및 기타 재료."}
{"patent_id": "10-2018-7017807", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 360°, 다각형 및 원형으로 회전 및 이동하는 수동 및 전기 원격 제어, 물 및 축전지를 중앙 실린더의 상부에서 입력 및 관찰할 수 있는 중앙 냉장고 및 냉동고, 지능형 디지털 시스템 연결 내부 및 외부 카메라로 이 동하여 메시지 및 이미지를 소유자 및 / 또는 주변 상점에 보내고 받을 수 있으며 원격 제어 및 위성 전화는 물 론 스마트한 쇼핑을 위해 네트워크에 연결할 수 있습니다. 측면 제한 액세스. 본 발명은 기계 공학 분야에 속하 며, 냉각, 냉각 보존 및 냉동을 위한 냉각 시스템 및 식품 재료 및 차 및 커피 메이커 및 제빙기용 냉수 및 온수 를 포함하는 새로운 모델의 유닛을 포함하고, 조리용 전자레인지를 갖추고있다."}
{"patent_id": "10-2018-7017807", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기계 공학 분야에 속하며, 냉각, 냉각 및 냉동 시스템 및 식료품 및 냉 / 온수 및 제빙기와 같은 냉 각 시스템을 포함하는 새로운 형태 및 모델의 유닛을 갖는다."}
{"patent_id": "10-2018-7017807", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이전 냉장고 및 냉동고 모델의 기술적 문제는 다음과 같다. -측면에서 저장된 자료에 대한 액세스를 제한한다. 이전 모델은 벽 및 / 또는 캐비닛에만 국한되었으며 한쪽에 서만 사용할 수 있다. -구식 모델에서는 식재료를 제한적으로 사용하고 일방적으로 접근할 수 있고 상대적으로 높은 깊이의 식품 재료 행에 접근할 때 소비자가 직면하는 문제에 직면했습니다. 대부분의 경우, 전면에 있는 재료는 깊게 놓인 재료에 접근하기 위해 제거되어야 하며, 그 결과 냉장고를 심각하게 사용하지 않아야 한다. 이 문제는 소비자가 높은 수준의 액세스 문제를 필요로 하지 않는다는 점에서 새로운 모델에서 해결되었다. 단순히 문을 열고 디스플레이 캐비닛에 직면하여 다양한 음식 재료의 적절하고 광범위한 깊이를 보여준다. 지역의 증가로 그들은 냉장고의 모 든 음식과 재료에 쉽게 접근할 수 있다. -관련 요구 사항에 따라 단일 도어 및 병렬형 냉장고는 온도를 1개 또는 2개의 공간으로 조정하고 다양한 냉각 조정을 방지한다. 냉장고의 넓은 영역은 공간과 도어의 수를 증가시키기 때문에 에너지 낭비를 피하고 효율성을 높이기 위해 수동으로 지능적으로 냉각하고 자동으로 여러 공간의 냉각 온도를 분리하고 조정할 수 있다."}
{"patent_id": "10-2018-7017807", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "발명의 목적 \"기술적 문제\"에 언급된 문제를 제거하고 하기 내용을 포함한다. 본 발명의 목적은 소비자에게 모든 면에서 더 많은 영역 (거의 4배)에 대한 액세스를 제공하는 것이며, 동시에 여러 사람에게 간편하게 액세스할 수 있게 한다."}
{"patent_id": "10-2018-7017807", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "-식품 재료를 적절하고 깊이 있고 연속으로 배치하면 소비자가 냉장고의 식품 재료에 더 쉽게 접근할 수 있으며 두 번째 줄의 다른 품목으로 재료를 옮길 필요가 없다. 또한, 음식 재료는 이동하지 않고 디스플레이 캐비닛에 배치된다. -이 새로운 모델은 부엌과 다른 장소의 중앙에 배치할 수 있으며 반드시 모서리와 벽 옆에 놓을 필요는 없지만 회전할 수 있기 때문에 벽이나 모서리와 같은 곳에도 배치할 수 있다. 이 점에는 제한이 없다. -이 새로운 모델의 회전 기능은 수동 또는 원격 제어로 쉽게 수행할 수 있으며, 중심축을 중심으로 회전할 수 있어 소비자가 주방이나 리셉션 홀과 같이 사전 설정된 부품을 사용할 수 있도록 미리 정해진 공간으로 회전할 수 있다. 모델을 돌리지 않고 냉장고 또는 냉동실 또는 기타 측면 부품이 앞에 있다. - 모델의 모든 배치에서 리셉션 홀과 주방 사이의 공간 중간에 있는지 여부에 관계없이 모델은 다른 시간에 사 용할 수 있으며 음식 재료를 사용하거나 출퇴근하는 데 길고 불필요한 시간을 필요로 하지 않는다."}
{"patent_id": "10-2018-7017807", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "- 냉장고와 냉동고 옆에 몇 개의 문이 있으며 음식물이 놓인다. 아이스 메이커, 워터쿨러, 급속 냉동 시스템, 차와 커피 머신, 전자 렌지뿐만 아니라 케이크, 패스트리, 과일, 채소 및 기타 조절 가능한 온도 재료를 위한 개별 문을 위한 문 사이에도 특별한 공간이 있다. 특별 공간."}
{"patent_id": "10-2018-7017807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "1) 원격 및 수동으로 원격 제어, 중앙 냉장고와 냉동고 중앙 실린더의 상단 부분에 물과 배터리 스토리지, 내부 및 외부 카메라에 연결된 지능형 디지털 시스템을 갖춘 360°, 다각형 및 원형, 회전 및 이동을 입력하고 볼 수 있으며, 원격 제어 및 위성 전화를 사용하여 스마트 쇼핑을 위해 소유자 및 / 또는 근처 상점에 메시지 및 이미 지를 보내고 네트워크에 연결할 수 있고 소비자는 한쪽에서 제한된 액세스가 아닌 모든 각도에서 액세스할 수 있다. 2）제한된 일방적 사용의 사용이 제거되었으므로 부엌의 구석과 벽과 인접한 찬장 옆에서 주방과 리셉션 홀 사 이에 놓을 수 있지만 모든 측면을 더 잘 사용할 수 있다. 3）지능형 제어 밸브는 중앙 파이프 라인을 통한 공간의 제어 가능한 관계를 고려하고 4개 이상의 주요 주변 지 역에 대한 독립온도를 변경하고 조정하며, 지능형 온도 조절 및 균형을 수행하는 프로세싱 시스템의 기능, 냉장 고 및 / 또는 냉동기 전용 통합 사용은 냉동기 내의 적어도 2개의 주 인접 공간과 냉동실의 2개의 주 인접 공간 과 다른 냉각 요건에 따라 절약하기 위해 재료를 저장하는 데 필요한 온도를 제어할 수 있는 복수의 도어를 갖 는 다른 측 공간을 포함한다 에너지 및 효율 재료. 4）엔진과 냉각 시스템을 중앙 부분(중간 수직덕트)으로 옮긴다. 5）축전지 및 백본 지지대가 설치된 장소인 인접한 지구의 하부 부분의 이동과 회전에 의해 냉장고의 주요 플랫 폼 배치가 지원된다. 6）한쪽에서 360°까지 증가할 수 있는 주변 환경의 입구가 증가하는 것을 고려하면 냉장고 및 냉동실의 액세스 도어는 두 개의 측면 도어에서 더 많은 도어로 증가한다.7）서로 다른 유형의 냉동고와 다른 두 개의 인접한 문을 서로 옆에 있는 냉동고 (나란히 있는 냉장고 및 나란 히 있는 냉동고)로 배치한다. 8）다각형 및 원형 테이블을 사용하고 최대 360°까지 새 모델에 필요한 문을 설계한다. 9）냉장고와 냉동실의 몸통은 주지지 플랫폼에서 움직이기 위해 움직일 수 있으며 중앙 메인 웰은 지구 근처에 있으며 다른 휠과 볼 베어링에 의해 수동 또는 원격 제어로 중심축을 중심으로 회전한다. 10）전화 시스템을 통해 스위치 기계의 원격 제어 및 냉장고와 냉동고 및 기타 측면 공간의 온도가 증가하거나 감소하는 원격 제어 지능형 전자 보드를 통해. 11）냉장고의 내부 공간에는 스마트 시스템을 통해 소유자의 휴대 전화로 이미지를 전송하거나 및 / 또는 소정 의 상점에 연결하여 필요한 소모품 및 감소량의 목록을 얻고 그 정보를 준비 냉장고에 준비 및 전송하기 위한 카메라가 장착된다 주소. 12）이 모델에는 재충전 배터리와 일정시간 동안 사용할 수 있는 상부 설계된 저장조가 장착되어있어 응급 상황 에서 네트워크 수력으로부터 독립적으로 그리고 관련 환경의 장기간 변위 동안 냉장고를 독립적으로 사용할 수 있다. 13）제조 몸통과 문은 하나의 단위에서 여러 개의 작은 단위로 무게와 무게를 줄이기 위해 별도의 다른 부품을 쉽게 조립하여 조립할 수 있다. 14）냉장고가 제자리에 고정되면 수력 연결은 냉장고 하부의 메인 브래킷을 통해 이루어진다. 15）모니터는 문 양쪽과 상단 문에 위치하며 냉장고의 중앙 지능형 시스템의 상태 및 경보를 표시하고 필요한 경우 요리 훈련 등과 같은 위성 채널을 표시하는 데 사용된다. 16）이 모델에는 처리 시스템과 배터리 전원이 장착되어 있으며 각 부품은 별도로 배치되어 트렁크 도어힌지 위 의 네 모서리에 배치된다. 17）냉장고는 360° 이내의 모든 각도에서 사용할 수 있다. 또한, 360° 미만의 각도로 배치할 수도 있다. 예를 들어 홀의 구석과 부엌에서 각도를 90°보다 크게 또는 작게 설정할 수 있다 18）주 문과 선반 옆에 있는 작은 문은 슬라이딩되어 있으며 리모컨을 통해 수동 또는 자동으로 위아래로 움직 일 수 있다. 19）상단 및 하단 통합 도어에 특수 잠금장치 추가 20）첨부 파일에 표시된 모든 항목 및 표."}
