{"patent_id": "10-2022-0169683", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0085313", "출원번호": "10-2022-0169683", "발명의 명칭": "객체 탐지를 이용한 블루베리 생육량 측정 시스템", "출원인": "편도길", "발명자": "편도길"}}
{"patent_id": "10-2022-0169683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "영상데이터 수집부(100), 생육상태 측정판단 서버부(200), 단말부(300)를 포함하여 구성되되,상기한 영상데이터 수집부(100)는 환경정보부(110), 과수촬영부(120), 데이터송수신부(130)를 포함하여 구성되어 있고,상기한 생육상태 측정판단 서버부(200)는 수집 데이터 저장부(210), 이미지 데이터 정제부(220), 데이터 셋 생성부(230), 생육 상태 분석부(240), 생육 상태 제공부(250)가 포함되어 구성되어 있는 객체 탐지를 이용한 블루베리 생육량 측정 시스템(1000)."}
{"patent_id": "10-2022-0169683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기한 영상데이터 수집부(100)에 웹 애플리케이션(101)이 탑재되어 있어 과수의 품종이 입력되고,웹 애플리케이션(101)은 환경정보부(110)의 하드웨어와 연동하여 센서에 의하여 측정된 온도, 토양, 습도, 토양산도, 일조량이 입력되는 기능이 수행되는 것을 특징으로 하는 객체 탐지를 이용한 블루베리 생육량 측정 시스템(1000)."}
{"patent_id": "10-2022-0169683", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기한 이미지 데이터 정제부(220)는 컬러히스토그램 평활화 모듈(221), 언샤프닝 모듈(222), 그랩 컷(Grabcut) 모듈(223), 객체 탐지 모듈(224)을 포함하여 구성되어 있는 것을 특징으로 하는 객체 탐지를 이용한 블루베리 생육량 측정 시스템(1000)."}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 농가의 과수 생산량 증가를 위해 스마트 팜을 활용한 과수의 환경 정보 및 생육 상태에 대해 데이터를 수집하고, 이 데이터에 대해 인공지능 기반으로 측정, 분석, 예측하여 생육 상태를 모니터링하며, 과수의 수확 적기를 예측하는 객체 탐지를 이용한 블루베리 생육량 측정 시스템에 관한 것이다. (뒷면에 계속)"}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 농가의 과수 생산량 증가를 위해 스마트 팜을 활용한 과수의 환경 정보 및 생육 상태에 대해 데이터 를 수집하고, 이 데이터에 대해 인공지능 기반으로 측정, 분석, 예측하여 생육 상태를 모니터링하며, 과수의 수 확 적기를 예측하는 객체 탐지를 이용한 블루베리 생육량 측정 시스템에 관한 것이다."}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "원격 감지, 클라우드 컴퓨팅 그리고 사물 인터넷 등의 새로운 디지털 기술이 농업 기술에 적용됨에 따라 스마트 팜(Smart Farm)이라는 개념이 등장하였다. 스마트 팜이란 비닐하우스, 축사 등에 위의 기술들을 접목하여 작물 과 가축의 생육 환경을 유지하는 농장을 의미한다. 스마트 팜을 위해, 작물의 생육량과 환경 요인 등의 빅데이터 수집이 요구된다. 또한 이렇게 수집한 농업용 빅 데이터를 정확히 해석하여 환경 조건이 변함에 따라 작물의 성장 정도를 예측할 수 있는 알고리즘의 개발도 필 요하다. 작물의 생육량과 환경 사이의 관계를 정량적으로 분석하기 위한 기존의 방법으로, 프로세스 기반 모델(Process Based Model)이 사용되었다. 프로세스 기반 모델은 작물의 광합성, 호흡, 바이오매스 동화, 바이오매스 분포 및 스트레스 반응 등을 포함하 는 다양한 생리학적 과정들을 각각 모듈로 구성하여 작물의 성장을 시뮬레이션한다. 시뮬레이션 결과가 모든 생 화학적 기능을 포함하는 것을 목표로 하기 때문에, 단일한 변수도 복잡한 계산을 필요로 하며, 여러 가지 지수 들의 보정이 필요하다는 단점이 있다. 또한 정확한 모델을 위해서는 작물의 각 기관의 바이오매스를 정확히 측정해야 한다. 이러한 과정으로 인해 이 미 수집된 빅데이터를 프로세스 기반 모델에 적용하는 것은 한계가 있다. 다른 예로서, 온도, 이산화탄소 농도, 광도 등을 이용하여 작물의 생육량을 예측하는 수식 기반 모델이 있으나, 재배기간 중 작물이 파괴되므로 수확시기까지 해당 작물을 사용하지 못한다는 단점이 있다. 따라서 기존의 작물의 생육량을 예측하는 다양한 모델의 한계를 극복하고 효율적인 생육량 예측을 위해서 비파 괴, 연속 측정을 통해 생육량 정보와 환경 정보를 빅데이터로 수집하고, 이를 이용하여 머신러닝을 기반으로 한 알고리즘의 개발이 요구된다. 관련된 기술로 공개특허 10-2021-0114751호(작물의 생육량 예측 방법 및 장치)는 \"적어도 하나의 프로세서에 의 해 동작하는 컴퓨팅 장치가 동작하는 방법으로서, 작물의 생체중(Fresh Weight)을 포함하는 생육 특성과 상기 작물이 재배되는 공간의 상대 습도를 포함하는 환경 요인을 주기적으로 수집하여 시계열적 데이터를 생성하는 단계, 상기 시계열적 데이터에 상기 작물의 생육 결과를 태깅하여 생성된 학습 데이터로 생육량 예측 모델을 학습시키 는 단계, 그리고 상기 생육량 예측 모델로 신규 생육 특성과 신규 환경 요인을 입력하고, 상기 작물의 생육량을 예측하는 단계를 포함하는 동작 방법\"을 제시한바 있다."}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "국내 농업은 인구의 고령화에 따른 노동력 감소로 인하여 소득이 줄어들고 있고, 농업 환경 여건의 변화 및 수 입 농산물 개방이 늘고 있으며, 세계 기후의 급격한 변화로 많은 어려움을 겪고 있다. 이에 대한 대책 중 가장 각광 받고 있는 분야는 스마트 팜 분야로서 다양한 농업 분야에서 생육 대상을 원격으로 관리, 모니터링 할 수 있는 특징을 가지고 있다. 현재 문제되고 있는 생산성 저하, 노동력 저하, 품질 저하, 질병 등의 문제를 해결할 수 있어, 전 세계 각국에 서는 대규모 인력과 자본을 투자하여 신기술 개발에 중점을 두고 있다. 현재 스마트 팜 시장은 대단위 농사에 활성화되고 있으나, 소규모 단위의 작물을 재배하는 경우에는 어려움을 겪고 있다. 스마트 팜 시스템은 정보통신기술을 활용해 농작물의 생육 상태를 최상으로 유지하는 농업 솔루션으 로, 스마트 팜 시스템을 활용하여 생산량 증가, 품질 상승, 노동 시간 감소 등의 생산 활동을 발전시킬 수 있을 것이다. 본 발명은 첫째, 스마트 팜 시스템, 사물인터넷, 인공지능 기반의 머신러닝(Machine learning) 알고리즘을 활용 하여 과수의 생육 상태 측정을 표현하고, 사물인터넷을 활용하여 생육 상태를 수집하는 시스템을 구축하며, 둘 째는, 수집된 데이터를 머신러닝 기법을 적용하여 데이터셋을 구축하고, 이와 같이 구축된 데이터셋에 대해 머 신러닝 기법을 활용하여 생육 상태를 측정, 분석하여 웹 어플리케이션을 통해 사용자에게 그 결과를 제공하게 하는 객체 탐지를 이용한 블루베리 생육량 측정 시스템을 제공하고자 한다."}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 상기한 요구 및 문제점을 해결하기 위하여, 영상데이터 수집부, 생육상태 측정판단 서버부, 단말부를 포함하여 구성되되, 상기한 영상데이터 수집부는 환경정보부, 과수촬영부, 데이터송수신부를 포함하여 구성되 어 있고, 상기한 생육상태 측정판단 서버부는 수집 데이터 저장부, 이미지 데이터 정제부, 데이터 셋 생 성부, 생육 상태 분석부, 생육 상태 제공부가 포함되어 구성되어 있는 객체 탐지를 이용한 블루 베리 생육량 측정 시스템을 제공한다. 또한 본 발명은 상기한 영상데이터 수집부에 웹 애플리케이션이 탑재되어 있어 과수의 품종이 입력되 고, 웹 애플리케이션은 환경정보부의 하드웨어와 연동하여 센서에 의하여 측정된 온도, 토양, 습도, 토양 산도, 일조량이 입력되는 기능이 수행되는 것을 특징으로 하는 객체 탐지를 이용한 블루베리 생육량 측정 시스 템을 제공한다. 또한 본 발명은 상기한 이미지 데이터 정제부는 컬러히스토그램 평활화 모듈, 언샤프닝 모듈, 그랩 컷(Grab cut) 모듈, 객체 탐지 모듈을 포함하여 구성되어 있는 것을 특징으로 하는 객체 탐지 를 이용한 블루베리 생육량 측정 시스템을 제공한다."}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템은 스마트 팜 시스템, 사물인터넷, 인공지능 기반의 머신러닝(Machine learning) 알고리즘을 활용하여 과수의 생육 상태 측정의 표현이 가능 하고 사물인터 넷을 활용하여 생육 상태를 수집하는 시스템을 구축할수 있으며, 수집된 데이터를 머신러닝 기법을 적용하여 데 이터셋을 구축하고, 이와 같이 구축된 데이터셋에 대해 머신러닝 기법을 활용하여 생육 상태를 측정, 분석할 수 있고, 더불어 블루베리(과수)의 생육 상태 분석의 정확도가 현저히 높으며, 이와 같은 결과를 웹 어플리케이션 을 통해 사용자에게 능률적으로 제공할 수 있는 작용과 효과가 나타난다."}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명을 도면을 참고하여 상세히 설명한다. 본 발명은 농가의 과수 생산량 증가를 위해 스마트 팜을 활용한 과수의 환경 정보 및 생육 상태에 대해 데이터 를 수집한다. 이 데이터에 대해 인공지능 기반으로 측정, 분석, 예측하여 생육 상태를 모니터링하며, 과수의 수 확 적기를 예측하는 알고리즘을 제안한다. 이를 위해, 라즈베리파이를 활용해 농장에서 과수의 생육 상태 정보인 온도, 토양 습도, 토양 산도, 일조량 그 리고 과수의 영상 데이터를 수집하여 하둡 분산시스템에 저장한다. 수집된 과수의 생육 환경 정보는 생육의 최적 정보로 분류, 판단하여 원-핫 인코딩(One-hot Encoding) 기법으로 저장하고, 과수의 영상 데이터는 객체 탐지기법을 활용하여 분석 및 분류한다. 따라서 본 발명은 웹 어플리케이션을 통해 생육 측정 환경에 대한 전 과정을 모니터링 할 수 있으며 최적의 수 확 예측 시기를 나타낼 수 있는 객체 탐지를 이용한 블루베리 생육량 측정 시스템에 관한 것이다. 본 발명은 영상데이터 수집부, 생육상태 측정판단 서버부, 단말부를 포함하여 구성된 객체 탐지 를 이용한 블루베리 생육량 측정 시스템을 제공한다. 본 발명의 영상데이터 수집부는 라즈베리파이(Raspberry Pi)로 사물인터넷 시스템을 구성하며 구성 기기를 활용한 생육관련 환경정보 수집 및 과수 촬영을 통한 영상 데이터를 수집하는 기능을 수행하는 장치 또는 수단 을 의미한다. 상기한 영상데이터 수집부는 환경정보부, 과수촬영부, 데이터송수신부를 포함하여 구성되 어 있다. 도 2에서 보는 바와 같이, 상기한 환경정보부는 과수의 품종, 온도, 토양, 습도, 토양 산도, 일조량을 측 정하여 입력하는 기능을 수행하는 장치 또는 수단을 의미한다. 상기한 환경정보부에는 블루베리 등과 같은 과수의 품종이 입력되고, 온도, 토양, 습도, 토양 산도, 일조 량을 측정하는 센서가 부가되어 과수원에서 측정된 정보를 입력하게 된다. 본 발명은 상기한 영상데이터 수집부에 웹 애플리케이션(100-1)이 탑재되어 있어 환경정보부의 하드 웨어와 연동하여 과수의 품종이 입력되고, 온도, 토양, 습도, 토양 산도, 일조량을 측정하여 데이터 구조로 저 장하게 된다. 도 2b에서 보는 바와 같이, 상기한 웹 애플리케이션(100-1)은 프레젠테이션 레이어, 컨트롤러 레이어 , 서비스 레이어, 데이터 액세스 레이어의 구조로 구성된다. 도 2c는 상기한 웹 애플리케이션(100-1)의 세부적인 구성도를 보여준다. 웹 애플리케이션(100-1)은 수집된 데이터에 대한 측정 요청과 해당 요청에 대한 결과 값을 제공하고 측정된 결 과를 저장하는 기능을 수행한다. 웹 애플리케이션을 통한 생육상태 측정 요청은 정확도를 높이기 위하여 사전에 정의된 양식을 통하여 처리가 이뤄진다. 수집된 데이터와 분석 및 측정 결과 값은 관계형 데이터베이스 관리시스템에 저장되고, 이후에 측정 모델의 성 능을 개선하는데 사용된다. 웹 애플리케이션은 자바 기반의 프레임워크(Web application framework)인 스프링 (Spring)을 사용하였다. 스프링은 MVC(Model-View-Controlle) 구조로 되어 있는 범용적인 웹 애플리케이션 제작 프레임워크이다. 첫째, 프레젠테이션 레이어(Presentation Layer)는 사용자가 과수의 생육측정 및 분석을 위한 데이터를 요청하 는 계층이다. Jsp, Html, Javascript, Css을 이용하여 사용자가 과수의 생육 환경과 이미지 자료가 수집된 상태 를 확인할 수 있도록 사용자 인터페이스를 제공한다. 또 프레젠테이션 레이어는 측정된 결과 값을 제공하고 결 과에 따른 사용자 요구사항 정보를 입력 받는 기능을 수행한다. 둘째, 컨트롤러 레이어(Controller Layer)는 수집된 데이터에 대한 적합성 여부를 검증하는 작업을 수행한다. 수집된 데이터는 수치 형태의 정형데이터와 영상 및 이미지 형태의 비정형 데이터 수집이 있다. 이미지 데이터 의 경우는 사이즈가 측정 기준보다 큰 경우 사전에 정의한 규격에 맞추어 이미지 데이터를 재설정하여 하둡분산 시스템에 저장한다. 셋째, 서비스 레이어(Service Layer)는 수집된 데이터를 기반으로 사용자에게 생육 측정 결과 및 요청 기능을 수행할 수 도록 구성한다. 넷째, 데이터 액세스 레이어(Data Access Layer)는 사물인터넷 기반으로 수집된 수치 형태의 생육 환경 정보는 데이터베이스에 저장하고 이미지 형태의 비정형 데이터의 경우 Blob 처리 후 파일 하둡분산시스템에 저장하고 이미지 용량, 사이즈, 확장자, 저장경로 등의 메타 데이터는 데이터베이스에 저장한다. 상기한 과수촬영부는 상기한 과수원에서 재배되고 있는 과수의 품종을 촬영한 과수 이미지 데이터를 입력 하는 장치 또는 수단을 의미한다. 상기한 데이터송수신부는 상기한 환경정보부에서 취득한 과수의 품종, 온도, 토양, 습도, 토양 산도, 일조량에 대한 정보 및 과수촬영부에서 취득한 과수 이미지 데이터를 생육상태 측정판단 서버부로 전 송하거나 생육상태 측정판단 서버부로 정보나 명령 정보를 수신하는 기능을 수행한다. 본 발명의 영상데이터 수집부는 라즈베리파이(Raspberry Pi)로 사물인터넷 시스템을 구성하며 케이스(100- 2)의 내부에 환경정보부, 과수촬영부, 데이터송수신부가 포함되어 구성되어 있다. 이와 같은 영상데이터 수집부는 과수원에 설치되어 있는바, 케이스(100-2)는 온도변화 및 풍화 작용 등에 내구성 및 내열성을 구비한 것이 안정적인 데이터 획득 및 전달을 할 수 있게 되며, 따라서 케이스는 고분자 물 질 수지로 된 것이 바람직하다. 상기한 케이스(100-2)는 폴리비닐클로라이드(PVC), 폴리에틸렌 또는 폴리프로필렌에서 선택된 하나 또는 둘 이 상의 재료를 혼합하여 조성한 고분자 물질 수지를 사용할 수 있다. 상기한 케이스(100-2)는 바람직하게는 폴리비닐클로라이드(PVC) 100중량부에 폴리에틸렌 30~70중량부, 폴리프로 필렌 10~150중량부, 폴리스티렌 10~30중량부를 혼합한 고분자 물질 수지를 사용하는 것이 강도, 내열성 및 내구 성 면에서 유용하다. 본 발명은 상기한 고분자 물질 수지에 수지 강화촉진 조성물을 포함하여 케이스의 성형과정에서 강도를 높이는 기능을 수행하고 크랙이 발생하는 것을 방지하는 기능을 수행하게 된다. 수지 강화촉진 조성물은 고분자 물질 수지 100중량부를 기준으로 1~3중량부를 혼합하는 것이 매우 효과적이다. 상기한 수지 강화촉진 조성물은 아크릴 에멀션, 폴리프로필렌 글리콜, 아크릴로니트릴(Acrylonitrile), 메틸아 크릴릭애시드(Methylacrylicacid)을 혼합하여 조성한다. 바람직하게는 상기한 수지 강화촉진 조성물은 아크릴 에멀션 100중량부에 폴리프로필렌 글리콜 10~20 중량부, 아크릴로니트릴(Acrylonitrile) 5~20 중량부, 메틸아크릴릭애시드(Methylacrylicacid) 2~10 중량부를 포함하여 조성된다. 본 발명은 상기한 고분자 물질 수지에 기능성 첨가물을 포함하여 케이스의 산성비 등에 의한 내산성 및 내염기 성을 강화시켜주는 기능을 수행한다. 상기한 기능성 첨가물은 고분자 물질 수지 100중량부에 0.1~1중량부를 혼합하여 사용하는 것이 좋다. 상기한 기능성 첨가물은 중탄산나트륨, 인산암모늄, 메틸렌비스 아크릴아마이드, 글리시딜 메타크릴레이트, 메 타그릴산을 포함하여 조성한 조성물이다. 바람직하게는, 기능성 첨가물은 중탄산나트륨 100 중량부에 인산암모늄 10~60 중량부, 메틸렌비스 아크릴아마이 드 10~30 중량부, 글리시딜 메타크릴레이트 20~80 중량부, 메타그릴산 5~40 중량부를 포함하여 조성하는 것이 효과적이다. 본 발명은 상기한 고분자 물질 수지에 천연 기능 첨가물을 포함하여 케이스가 고분자 물질 수지로서의 환경 호 르몬의 발생을 방지하고, 부식 등을 방지하는 기능을 수행하여 친환경적인 것으로 작용하도록 하게 하는 효과가 나타나게 한다.상기한 천연 기능 첨가물은 고분자 물질 수지 100중량부를 기준으로 0.001~0.005중량부를 혼합하는 것이 바람직 하다. 상기한 천연 기능 첨가물은 오약 80~120 중량부에 삼릉 80~120 중량부, 황정 10~30중량부, 수질 80~120 중량부, 속단 50~80중량부, 호초 50~150중량부, 계혈등 50~150중량부를 혼합하여 추출한 조성물을 의미한다. 본 발명은 상기한 상기한 고분자 물질 수지에 천연 강화 조성물을 포함하여 케이스의 내습성 및 온도 변화에 따 른 균열 방지 등과 같은 강도를 증진시키는 작용하도록 하는 효과가 나타나게 한다. 본 발명의 상기한 천연 강화 조성물은 복령 100중량부에 익모초 50~150중량부, 인진 10~20중량부, 위령선 50~150중량부, 토사자 50~150중량부를 혼합하여 추출한 조성물을 의미한다. 상기한 천연 기능 첨가물 및 천연 강화 조성물을 추출하는 방법으로는 상기의 혼합한 원재료 100 중량부에 75~85%[질량%] 에탄올 1000중량부를 넣고, 2~4시간 동안 환류 추출하고 여액을 rotary evaporator를 이용하여 감압, 농축하는 방법으로 추출할 수 있다. 이와 같은 추출물은 혼합한 원재료 100중량부를 기준으로 분말 형태로 5~25중량부 정도 추출될 수 있으며 이러 한 분말 형태의 추출물을 첨가하는 것이 바람직하다. 본 발명의 상기한 생육상태 측정판단 서버부는 영상데이터 수집부에서 제공하는 정보를 저장하고, 이 와 같은 정보를 변환하고, 분석하여 과수의 생육상태를 측정하고, 이와 같은 생육상태 정보를 사용자에게 과수 의 생육 상태 측정 정보 및 수확 예측 시기를 제공하는 기능을 수행한다. 상기한 생육상태 측정판단 서버부는 통상의 CPU, MCU 등의 중앙처리장치, RAM, ROM, 메모리장치, 통신장치 등의 하드웨어를 구비하고 응용 프로그램이 탑재된 장치 또는 수단을 의미한다. 본 발명의 상기한 생육상태 측정판단 서버부는 수집 데이터 저장부, 이미지 데이터 정제부, 데 이터 셋 생성부, 생육 상태 분석부, 생육 상태 제공부가 포함되어 구성되어 있다. 도 3에서 보는 바와 같이, 상기한 수집 데이터 저장부는 상기한 영상데이터 수집부에서 제공하는 생 육 환경 데이터 및 이미지 데이터를 저장하는 기능을 수행하는 모듈 또는 수단을 의미한다. 상기한 수집 데이터 저장부는 하둡을 사용한다. 기록된 데이터는 생육 환경의 텍스트 데이터와 과수의 이 미지 데이터를 범주로 분류하여 저장하는 것이 효율적이다. 제안하는 모델에서 구성한 하둡 분산시스템은 1대의 메인서버와 가상머신을 사용하여 2대의 보조 서버로 구축하 는 것이 바람직하다. 서버는 리눅스 운영체제에서 hadoop-3.2.1 버전을 이용하는 것이 좋다. 상기한 이미지 데이터 정제부는 상기한 과수의 이미지에서 입력된 이미지로부터 추출하고자 하는 과수의 주변영역을 정확하게 표기하기 위하여 컬러히스토그램 평활화 스토그램 평활화와 언샤프닝을 이용하여 과수 객 체를 강조하는 기능을 수행하는 모듈 또는 수단을 의미한다.그랩 컷(Grab cut)을 이용하여 과수의 형태만 추출한 결과를 확인하였으며, 객체 탐지로 추출된 결과를 이용하 여 이진화와 Blob 변환을 수행하여 과수 객체를 관심영역을 정의하였다. 이미지 학습에 사용한 이미지 데이터들은 서로 다른 크기의 이미지를 다수로 선별하였으며, 제안한 모델에 활용 하기 위하여 가로, 세로의 크기 32픽셀인 이미지로 재구성한다. 이와 같은 작업은 과수의 이미지 학습데이터 분 석시간과 정확도를 향상시키게 된다. 상기한 이미지 데이터 정제부는 컬러히스토그램 평활화 모듈, 언샤프닝 모듈, 그랩 컷(Grab cut) 모듈, 객체 탐지 모듈을 포함하여 구성되어 있다. 도 3b는 이미지 데이터 정제부를 통하여 블루베리 이미지가 객체 탐지된 형태를 보여준다. 상기한 데이터 셋 생성부는 상기한 영상데이터 수집부에서 취득한 정보 및 를 이미지 데이터 정제부 를 생육 환경으로 정형화된 데이터와 영상 촬영한 과수의 이미지 형태의 비정형 데이터로 분류하여 저장하 는 기능을 수행하는 모듈 또는 수단을 의미한다. 텍스트 형태의 데이터 셋은 정규화된 데이터를 통해서 만들어진다. 해당 데이터에서 생육상태 분석을 위해 과수 의 품종, 온도, 토양, 습도, 토양 산도, 일조량, 생육상태 등의 환경 정보로 추출하여 이를 통해서 특징 맵을 생성한다. 과수 이미지를 분류 작업하는 것으로 레이블을 작성하고 분석을 위해 일자별로 폴더에 저장하고, 과수의 생육 상태 이미지에 대한 학습용 과수 이미지 분류 폴더로 전처리가 적용된 과수 이미지를 저장한다. 본 발명의 상기한 생육상태 측정부는 데이터 셋 생성부에서 제공받은 환경 정보와 과수 이미지로 과 수(블루베리)의 생육상태를 측정하는 기능을 수행하는 모듈 또는 수단을 의미한다. 도 4에서 보는 바와 같이, 생육상태 측정부의 생육 분석 알고리즘은 온도, 토양 습도, 토양 산도, 일조량 을 값으로 저장된 과수의 생육 환경 데이터와, 분석에 용이한 사이즈로 가공되어 이미지 처리기법인 객체 탐지 기법을 적용하여 변환된 이미지 데이터를 합성곱 신경망으로 분석하여 최소 10개이상의 데이터에 대한 생육 상 태를 측정하여 원-핫 인코딩 방식으로 처리하는 방식으로 수행한다. 생육 환경 정보와 원-핫 인코딩으로 반환된 데이터를 과수의 Feature Information과 비교 분석하여 가장 근접한 데이터를 출력한다. 상기한 생육상태 측정부는 생육 특징 정보 생성 모듈, 합성곱 신경망 모듈, 생육 상태 분석 모 듈을 포함하여 구성되어 있다. 상기한 생육 특징 정보 생성 모듈은 과수의 생육 상태 정보 테이블, 과수의 특징, 재배하는 토양의 환경, 온도, 토양 습도, 토양 산도, 일조량 등에 따라 각 특징 정보를 추출하고 과수 데이터를 종합하고 분석하여 생 육 상태의 최종 데이터로 매트릭스(표)를 생성하는 기능을 수행한다.과수의 생육상태 특징 정보를 통해 최적의 생육 상태를 측정하기 위해서는 수집된 과수 데이터를 활용해 Feature-Map을 생성하는 것이 필요하다. 먼저 생육 상태 분석의 정확도를 높이기 위해서 과수의 다양한 특징정보들을 사전에 정의할 필요가 있다. 과수의 생육 상태 정보 테이블, 과수의 특징, 재배하는 토양의 환경, 온도, 토양 습도, 토양 산도, 일조량 등에 따라 각 특징 정보를 추출하고 과수 데이터를 종합하고 분석하여 생육 상태의 최종 데이터로 매트릭스를 생성한 다. 도 5는 생육 상태 정보에 대한 특징 정보를 사용하여 생육 상태 매트릭스를 생성하는 과정을 보여주는 것으로 생육 상태 매트릭스를 생성하는 과정은 2단계로 이루어져 있다. 생육 특징 정보 생성 모듈은 먼저, 분석의 중요한 단계인 생육 상태에 대한 Feature-Map을 만드는 과정을 수행한다. 각 특징은 생육 상태를 판단하는 중요한 요소가 된다. 과수마다 특징 정보는 많은 차이가 존재할 수 있다. 본 발명에서는 시설작물에서 재배하는 과수 중 스마트 팜 도입의 확대와 함께 과수의 재배 면적 및 생산량이 증 가하고 있는 블루베리를 선정하고 생육 상태 분석을 위해 특징, 정보를 수집하여 Feature-Map을 생성한다. 블루베리를 재배하는 최적의 생육 상태 정보와 온도변화에 따른 생육의 특징, 블루베리가 자라는 생육환경의 조 건들과 재배 환경들이 적절한 토양 습도와 토양 산도, 일조량 등의 생육시기에 따른 정보가 과수의 특징 정보라 고 정의한다. 이렇게 수집된 데이터를 통해서 생육 상태 시기와 과수의 다양한 생육 환경 정보들을 하나의 표로 생성한다. 생 성한 표는 과수의 익음 명칭을 레이블로 표시하고 이를 코드화 한다. [표 1]은 블루베리(과수) 재배 중에 진행되는 생육 상태에 대한 조사 테이블의 실시예를 보여준다. 표 1"}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "둘째, 상기의 Featuer Map[표 1]으로 만들어진 과수의 특징정보를 분석이 가능한 데이터로 변경하는 과정을 수 행한다. 레이블은 원-핫 인코딩(One-hot Encoding) 데이터로 변환한다. 원-핫 인코딩은 텍스트 혹은 범주형 등의 데이터를 기계가 분석할 수 있는 형태로 변환하는 것으로 대상의 데이 터가 하나의 데이터만 1로 표현해주고 나머지는 0으로 변환하여 채워주는 것을 말한다. 이러한 방법으로 생육 상태 리스트 1∼n을 0과 1의 값으로 표시 할 수 있다. 또한 수치형 데이터와 범주형 데이터로 나눠서 데이터 테이블을 만든다. 실시 예로 생육 환경 정보는 범주형 데이터로 나타낸다. 범주형 데이터는 과수의 생육 전 단계를 시기로 표현한 것으로 개화기, 비대기, 수확기의 1∼3단계로 구분할 수 있다. 이와 같은 범주형 데이터로는 생육 상태에 따른 과수의 색상 정보, 토양 습도, 온도, 토양의 산도(ph) 등 이 있다. 아래의 [표 2]에서 보는 바와 같이, 상기한 데이터들을 수치로 표현하고 생육 측정치 범주에 포함 될 경우 True 로 1 이나 그렇지 않은 경우 False로 0의 값을 가지도록 표현한다. 이밖에 일조량과 같은 데이터는 수치형 자료 로 표현한다. 표 2"}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "효율적인 분석과 측정을 위해 블루베리 생육에 대한 정보를 3가지 대분류, 중분류, 소분류 코드로 구성하였다. 상기 [표 2]의 Major Code는 과일의 대분류 코드, Fruit Code는 중분류 코드, Kind Code는 소분류 코드로서 과수의 품종명을 3자리로 정의하여 일련번호로 입력된 것이다. 상기의 수치형 자료의 실시예로 시기(Period)는 범주형 데이터로 0(NULL), 1(개화기), 2(비대기), 3(수확기)로 정의하였다. 이미지 데이터의 과수 생육 상태 정보는 6개로 분리하여 각 과수의 색상 상태를 0 또는 1로 특징 정보를 처리하 였다. 과수색상은 과수를 기준으로 0(없음), 1(Immature-Green), 2(Mature-Green), 3(Green-Pink), 4(Pink-Red), 5(Red-Blue), 6(Blue)의 정의된 과수 색에 가까운 값으로 표현한다. 온도는 블루베리 생육의 적정 온도인 20-26 도씨사이일 경우 1 그렇지 않으면 0의 값으로 표현한다. 토양 습도는 65%에서 75% 사이일 경우 1 그렇지 않으면 0의 값으로 표현한다, 토양 산도는 4.3에서 4.6 사이일 경우 1 그렇지 않으면 0의 값으로 표현한다, 일조량은 수치형 데이터로 측정값 을 사용하였다. 이 과정을 통하여 데이터는 블루베리 스타의 경우 다음의 [표 3]와 같이 표현되고, 블루베리 토로의 경우 [표 4]와 같이 표현될 수 있다.표 3"}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "표 4"}
{"patent_id": "10-2022-0169683", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "상기의 [표]에서 C는 과일 색, T는 온도, H는 습도, So 토양산도, Su는 일조일을 의미한다. 이와 같이 과수의 생육 특징을 추출한 후 생육 코드의 분류 체계를 만들어 생육 환경 정보는 수집된 수치를 과 수의 이미지 데이터는 생육 상태에 따라 원-핫 인코딩 형태로 변경하였다.본 발명에 활용한 데이터 셋은 10개의 특징을 가진 10개의 데이터 즉 10x10 매트릭스로 표현되었다. 제안 모델의 정확도를 향상시키기 위하여 블루베리 과수의 생육 특징 정보를 수집했을 때 데이터가 존재하지 않 는 항목은 Null 처리하였으며, 이미지를 통한 측정도 동일 항목의 생육특징 코드를 사용한다. 최종적으로 10x10 매트릭스를 사용하여 n개의입력이 있을 때 nx10의 데이터로 표현된다. 생성한 과수의 생육 특징 정보를 활용해 데이터를 학습하고 이를 모델링한 정보를 생성한다. 분석된 모델 데이 터를 활용하여 입력값에 대하여 생육 상태 측정을 실행한다. 상기한 합성곱 신경망 모듈은 상기한 생육 특징 정보 생성 모듈에서 생성한 과수의 생육 상태 특징정 보를 도와(helping) 과수의 생육 상태를 측정하게 하는 기능을 수행한다. 상기한 합성곱 신경망 모듈은 생육 특징 정보 생성 모듈에서 제공하는 생육 상태의 특징정보를 분석 하여 생육 상태를 측정하는 방법을 가능하게 해준다. 본 발명의 상기한 합성곱 신경망 기법의 특징은 이미지에서 특징 정보를 이미지 안의 직선, 모형, 곡선 등을 특 징으로 추출하여 유사한 이미지를 찾아내는 인공 신경망의 분야를 의미한다. 도 6에서 보는 바와 같이, 본 발명의 합성곱 신경망 모듈은 블루베리 성장에 따른 크기와 색깔의 변화에 대한 기준 이미지를 설정하고, 영상데이터 수집부에서 획득한 과수(블루베리) 생육 상태에 대한 다양한 이 미지를 기준 이미지와 학습시켜 과수 생육에 대한 특징 정보를 추출한다. 이미지가 복수의 필터를 거치며 생육 상태의 특징을 추출하고 추출된 특징정보를 분류한다. 도 7은 합성곱 신경망 분석 과정을 나타낸 것으로 합성곱(Convolution)과 서브샘플링(Subsampling) 처리를 통해 Feature-Map을 생성하는 과정을 보여준다. 입력된 생육 상태에 대한 이미지를 사전에 정의한 이미지 데이터를 사용하여 이미지를 다수 생성하는 과정을 서 브샘플링이라고 한다. 이렇게 생성된 이미지에 필터를 추가하여 다시 풀링(Pooling)하고 이를 계속 반복하면 하 나의 이미지에 속해있는 곡선, 선, 모양 등의 특징을 가지는 여러 정보를 얻을 수 있다. 마지막에는 완전연결(Fully Connected) 과정을 통해 인공신경망에 입력하고 이를 학습하게 된다. 이렇게 사전에 학습한 모델을 구축하고 새로운 이미지 값이 저장되면 이를 통해 생육 상태를 분석할 수 있다. 따라서 합성곱 신경망 모듈은 영상데이터 수집부에서 제공한 과수의 이미지 정보를 이미지 데이터 정 제부에서 가공한 이미지를 설정된 기준 이미지를 기반으로 학습된 이미지를 통하여 구축한 기준 이미지와 대비하여 이미지 값으로 확정할 수 있게 된다. 이와 같이 본 발명은 상기한 생육 상태 분석 모듈은 상기의 생육 특징 정보 생성 모듈, 합성곱 신경 망 모듈에서 생성한 과수의 생육 환경 정보와 과수의 이미지 정보를 객체 검출을 활용하여 과수의 수확 시 기를 수치로 예측하는 기능을 수행한다. 즉, 본 발명의 생육 상태 분석 모듈은 생육 특징 정보 생성 모듈 및 합성곱 신경망 모듈에서 과 수의 생육 환경 정보와 과수의 이미지 정보를 이진화 데이터로 추출한 [1,0,0,1,0,0,0,1,1,1,1,48.5] 형태로 저 장한 것을 이용하여 과수 생육 상태를 측정하고 해당 데이터를 기반으로 과수의 수확 시기를 수치로 예측하는 기능을 수행할 수 있다. 또한 본 발명의 생육 상태 분석 모듈은 상기한 합성곱 신경망 모듈을 통하여 제공한 이미지 데이터만 를 활용하여 과수의 생육 상태가 어느 위치에 해당하는지를 분석하는 기능을 수행할 수 있다. 본 발명의 생육 상태 제공부는 상기의 생육 상태 분석부에서 분석하고 측정한 생육 상태 측정 후 결 과 값을 제공하는 기능을 수행하는 모듈 또는 수단을 의미한다. 상기한 생육 상태 제공부는 블루베리 과수원에서 측정된 생육 상태, 과수 색상, 기온, 작물환경 정보, 과 수 이미지 등의 정보가 입력되면 과수의 수확 시기를 예측할 수 있으며, 과수의 생육 상태를 측정한 결과를 제 공하는 기능을 수행한다. 상기한 생육 상태 제공부는 단말부와 연결되어 있으며, 사용자는 단말부를 통하여 과수의 생육 상태 및 수확 시기 등의 정보를 열람할 수 있게 된다. 도 8 및 도 8b는 생육 상태 제공부에서 제공하는 과수원에서 측정된 생육 상태, 과수 색상, 기온, 작물환 경 정보, 과수 이미지 등의 정보 및 이에 따른 과수의 생육 상태를 측정한 결과를 보여준다. 본 발명의 단말부는 상기한 생육상태 측정판단 서버부와 연결되어 있으며, 사용자가 과수원에서 측정 된 생육 상태, 과수 색상, 기온, 작물환경 정보, 과수 이미지 등의 정보 및 이에 따른 과수의 생육 상태를 열람 할 수 있게 해주는 기능을 수행한다. 상기한 단말부는 PC, 노트북, 태블릿 PC, 모바일폰, 스마트 폰 등 다양하게 사용할 수 있다. 본 발명은 상기한 구성과 기능으로 이루어진 객체 탐지를 이용한 블루베리 생육량 측정 시스템을 제공한다. 산업상 이용가능성 본 발명은 과수의 생육량 측정을 위한 장치 또는 시스템을 생산, 판매, 유통, 연구하는 산업에 유용하다. 특히, 본 발명은 객체 탐지를 이용한 블루베리 생육량 측정 시스템을 생산, 판매, 유통, 연구하는 산업에 유용 하다."}
{"patent_id": "10-2022-0169683", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 구성도. 도 2는 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 영상데이터 수집부 구성도. 도 2b는 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 영상데이터 수집부의 웹 애플리케 이션 구성도. 도 2c는 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의웹 애플리케이션의 세부적인 구성도. 도 3은 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 생육상태 측정판단 서버부 구성도. 도 3b는 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 이미지 데이터 정제부를 통하여 블 루베리 이미지가 객체 탐지된 형태를 보여주는 도면. 도 4는 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 생육상태 측정부에서의 생육 분석 알고리즘.도 5는 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 생육 상태 정보에 대한 특징 정보를 사용하여 생육 상태 매트릭스를 생성하는 과정을 보여주는 도면. 도 6은 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 합성곱 신경망 모듈에 의한 과수 생 육에 대한 특징 정보를 추출하는 과정을 보여주는 도면. 도 7은 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 합성곱 신경망 분석 과정을 나타낸 것으로 합성곱(Convolution)과 서브샘플링(Subsampling) 처리를 통해 Feature-Map을 생성하는 과정을 보여주는 도면. 도 8 및 도 8b는 본 발명에 따른 객체 탐지를 이용한 블루베리 생육량 측정 시스템의 생육 상태 제공부에서 제 공하는 과수원에서 측정된 생육 상태, 과수 색상, 기온, 작물환경 정보, 과수 이미지 등의 정보 및 이에 따른 과수의 생육 상태를 측정한 결과를 보여주는 도면."}
