{"patent_id": "10-2021-0165173", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0077932", "출원번호": "10-2021-0165173", "발명의 명칭": "생체 정보를 제공하는 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "오두선"}}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,적어도 하나의 센서; 및상기 적어도 하나의 센서와 작동적으로 연결된 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는,상기 적어도 하나의 센서를 통해 획득되는 상기 전자 장치의 움직임의 변화량이 임계 범위 내에 존재할 경우,상기 적어도 하나의 센서를 통해 상기 전자 장치의 착용 상태를 식별하고,광용적맥파(photoplethysmogram: PPG) 신호들에 기반하는 기준 값들에 상응하는 산소 포화도(saturation ofpercutaneous oxygen: SpO2)들을 포함하는 제1 그룹 및 상기 기준 값들에 상응하는 다른 SpO2들을 포함하는 제2그룹을 포함하는 다수의 그룹들 중 상기 착용 상태에 상응하는 그룹을 선택하고, 및상기 적어도 하나의 센서를 통해 제1 PPG 신호를 획득하고, 상기 제1 PPG 신호에 기반하는 제1 기준 값과 상기선택된 그룹을 사용하여 제1 SpO2를 획득하도록 구성되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는, 상기 식별된 착용 상태에 상응하는 착용 상태 정보와 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보들 각각 간의 유사도를 식별하고, 및상기 식별된 유사도들 중 최대값을 가지는 착용 상태 정보에 매핑되어 있는 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하도록 구성되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,착용 상태 정보는 사용자 신체에 의해 상기 전자 장치에 가해지는 압력, 상기 전자 장치에서 상기 사용자 신체에 의해 접촉되는 면적의 크기, 또는 상기 전자 장치가 상기 사용자 신체에 접촉되는 방향 중 적어도 하나를 정보 엘리먼트(element)들로서 포함하며, 및상기 적어도 하나의 프로세서는, 상기 식별된 착용 상태에 상응하는 착용 상태 정보에 포함되어 있는 정보 엘리먼트들과 상기 다수의 그룹들에매핑되어 있는 착용 상태 정보들 각각에 포함되어 있는 정보 엘리먼트들간의 유사도들을 식별하고,상기 다수의 그룹들 각각에 대해, 상기 식별된 정보 엘리먼트들에 대한 유사도들 각각에 정보 엘리먼트 별로 설정되어 있는 가중치를 적용하고, 및상기 다수의 그룹들 중 상기 가중치가 적용된 유사도들의 합이 최대값인 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하도록 구성되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2023-0077932-3-제3항에 있어서,상기 가중치가 적용된 유사도들의 합들 중 최대값은 설정되어 있는 최소 유사도 이상인 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 움직임은 상기 적어도 하나의 센서를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 착용 상태는 상기 적어도 하나의 센서를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG)신호, 또는 압력 신호 중 적어도 하나에 기반하여 획득되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는, 상기 착용 상태가, 상기 전자 장치에서 사용자 신체에 의해 접촉되는 면적의 크기가 임계 면적 이상인 착용 상태일 경우, 상기 제1 그룹을 선택하고, 상기 제1 기준 값과 상기 제1 그룹을 사용하여 상기 제1 SpO2를 획득하고, 및 상기 착용 상태가 제2 측정 방식에서 사용되는 단일 그룹이 생성될 때 적용되는 착용 상태일 경우, 상기 제2 그룹을 선택하고, 상기 제1 기준 값과 상기 제2 그룹을 사용하여 상기 제1 SpO2를 획득하도록 구성되며,상기 제2 측정 방식은 상기 다수의 그룹들이 사용되는 제1 측정 방식과는 다른 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는,상기 제1 SpO2를 획득한 후, 측정 방식을 상기 다수의 그룹들이 사용되는 제1 측정 방식에서 단일 그룹이 사용되는 제2측정 방식으로 전환하고,상기 제2 측정 방식에서, 상기 적어도 하나의 센서를 통해 제2 PPG 신호를 획득하고, 상기 제2 PPG 신호에 기반하는 제2 기준 값과 상기 단일 그룹을 사용하여 제2 SpO2를 획득하고, 상기 통신 회로를 통해, 상기 제1 SpO2, 상기 제1 기준 값, 상기 선택된 그룹의 식별자, 상기 제2 SpO2중 적어도 하나를 외부 전자 장치로 송신하여 상기 선택된 그룹을 업데이트하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 선택된 그룹에 포함되어 있는 상기 제1 기준 값을 상기 제2 SpO2에 상응하는 상기 제2 기준 값으로 변경함으로써 상기 선택된 그룹이 업데이트되는 전자 장치. 공개특허 10-2023-0077932-4-청구항 10 제8항에 있어서,상기 적어도 하나의 프로세서는 조건이 만족될 경우, 상기 제1 측정 방식에서 상기 제2 측정 방식으로 전환하도록 구성되며, 및상기 조건은 상기 적어도 하나의 센서를 통해 획득되는 상기 전자 장치의 움직임의 변화량이 제1 임계 범위 내에 존재하는 조건, 상기 제1 SpO2를 측정 완료한 시점 이후 설정 시간이 완료되는 조건, 또는 상기 제1 측정 방식에서 측정되는 SpO2들의 변화량이 제2 임계 범위 내에 존재하는 조건 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 움직임은 상기 적어도 하나의 센서를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 적어도 하나의 프로세서는, 상기 식별된 착용 상태에 상응하는 착용 상태 정보와 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보들 각각 간의 유사도를 식별하고, 및상기 식별된 유사도들 중 최대값을 가지는 착용 상태 정보에 매핑되어 있는 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하도록 구성되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,착용 상태 정보는 사용자 신체에 의해 상기 전자 장치에 가해지는 압력, 상기 전자 장치에서 상기 사용자 신체에 의해 접촉되는 면적의 크기, 또는 상기 전자 장치가 상기 사용자 신체에 접촉되는 방향 중 적어도 하나를 정보 엘리먼트(element)들로서 포함하며, 및상기 적어도 하나의 프로세서는, 상기 식별된 착용 상태에 상응하는 착용 상태 정보에 포함되어 있는 정보 엘리먼트들과 상기 다수의 그룹들에매핑되어 있는 착용 상태 정보들 각각에 포함되어 있는 정보 엘리먼트들간의 유사도들을 식별하고,상기 다수의 그룹들 각각에 대해, 상기 식별된 정보 엘리먼트들에 대한 유사도들 각각에 정보 엘리먼트 별로 설정되어 있는 가중치를 적용하고, 및상기 다수의 그룹들 중 상기 가중치가 적용된 유사도들의 합이 최대값인 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하도록 구성되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,공개특허 10-2023-0077932-5-상기 가중치가 적용된 유사도들의 합들 중 최대값은 설정되어 있는 최소 유사도 이상인 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제8항에 있어서,상기 적어도 하나의 프로세서는,상기 적어도 하나의 센서를 통해 획득되는 상기 전자 장치의 움직임의 변화량이 임계 범위 내에 존재함을 식별할 경우, 상기 제1 측정 방식에서 상기 전자 장치에 대한 착용 상태를 식별하도록 구성되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 움직임은 상기 적어도 하나의 센서를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제8항에 있어서,상기 착용 상태는 상기 적어도 하나의 센서를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG)신호, 또는 압력 신호 중 적어도 하나에 기반하여 획득되는 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제8항에 있어서,상기 적어도 하나의 프로세서는,상기 통신 회로를 통해, 상기 외부 전자 장치로부터 업데이트된 그룹의 식별자 및 상기 업데이트된 그룹을 수신하도록 더 구성되며, 및상기 업데이트된 그룹은 상기 제1 SpO2와 상기 제2 SpO2간의 차이가 임계 값 이하일 경우, 상기 선택된 그룹에포함되어 있는 상기 제1 기준 값을 상기 제2 SpO2에 상응하는 상기 제2 기준 값으로 변경함으로써 업데이트되는전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제8항에 있어서,상기 적어도 하나의 프로세서는, 상기 착용 상태가, 상기 전자 장치에서 사용자 신체에 의해 접촉되는 면적의 크기가 임계 면적 이상인 착용 상태일 경우, 상기 제1 그룹을 선택하고, 상기 제1 기준 값과 상기 제1 그룹을 사용하여 상기 제1 SpO2를 획득하고, 및 상기 착용 상태가 제2 측정 방식에서 사용되는 단일 그룹이 생성될 때 적용되는 착용 상태일 경우, 상기 제2 그룹을 선택하고, 상기 제1 기준 값과 상기 제2 그룹을 사용하여 상기 제1 SpO2를 획득하도록 구성되며, 상기 제2 측정 방식은 상기 다수의 그룹들이 사용되는 제1 측정 방식과는 다른 전자 장치.공개특허 10-2023-0077932-6-청구항 20 외부 전자 장치에 있어서,통신 회로; 및상기 통신 회로와 작동적으로 연결된 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는,상기 통신 회로를 통해, 전자 장치로부터 광용적맥파(photoplethysmogram: PPG) 신호들에 기반하는 기준 값들에상응하는 산소 포화도(saturation of percutaneous oxygen: SpO2)들을 포함하는 제1 그룹 및 상기 기준 값들에상응하는 다른 SpO2 들을 포함하는 제2 그룹을 포함하는 다수의 그룹들이 사용되는 제1 측정 방식에서 획득된제1 SpO2, 상기 제1 SpO2에 상응하는 제1 기준 값, 상기 다수의 그룹들 중 상기 제1 SpO2를 획득하는데 사용된그룹의 식별자, 단일 그룹이 사용되는 제2 측정 방식에서 측정된 제2 SpO2를 수신하고,상기 제1 SpO2와 상기 제2 SpO2 간의 차이가 임계 값 이하일 경우, 상기 식별자에 매핑되는 그룹에 포함되어 있는 상기 제1 기준 값을 상기 단일 그룹에서 상기 제2 SpO2에 상응하는 제2 기준 값으로 변경하여 상기 식별자에 매핑되는 그룹을 업데이트하고, 및상기 통신 회로를 통해, 상기 식별자 및 상기 업데이트된 그룹을 상기 전자 장치로 송신하도록 구성되는 외부전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 제1 SpO2를 획득하는데 사용된 그룹은 상기 다수의 그룹들 중 상기 제1 측정 방식에서 식별된 상기 전자장치의 착용 상태에 상응하는 착용 상태 정보에 매핑되어 있는 그룹인 외부 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서,상기 착용 상태는 상기 전자 장치에 포함되는 적어도 하나의 센서를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG) 신호, 또는 압력 신호 중 적어도 하나에 기반하여 획득되는 외부 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제20항에 있어서,상기 전자 장치의 측정 방식은 조건이 만족될 경우, 상기 제1 측정 방식에서 상기 제2 측정 방식으로 전환되며,및상기 조건은 상기 전자 장치의 움직임의 변화량이 제1 임계 범위 내에 존재하는 조건, 상기 전자 장치가 상기제1 SpO2를 측정 완료한 시점 이후 설정 시간이 완료되는 조건, 또는 상기 제1 측정 방식에서 측정되는 SpO2들의 변화량이 제2 임계 범위 내에 존재하는 조건 중 적어도 하나를 포함하는 외부 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,상기 움직임은 상기 전자 장치에 포함되는 적어도 하나의 센서를 통해 획득되는 가속도 신호 또는 각속도 신호중 적어도 하나에 기반하여 획득되는 외부 전자 장치.공개특허 10-2023-0077932-7-청구항 25 제20항에 있어서,상기 적어도 하나의 프로세서는,상기 제1 SpO2와 상기 제2 SpO2간의 차이가 상기 임계 값을 초과할 경우, 상기 통신 회로를 통해 상기 전자 장치로 그룹 업데이트가 수행되지 않음을 나타내는 메시지를 송신하도록 더 구성되는 외부 전자 장치."}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시 예들에 따르면, 전자 장치는 적어도 하나의 센서, 통신 회로, 및 상기 적어도 하나의 센서 및 통신 회로와 작동적으로 연결된 적어도 하나의 프로세서를 포함할 수 있고, 상기 적어도 하나의 프로세서는, 상기 적 어도 하나의 센서를 통해 획득되는 상기 전자 장치의 움직임의 변화량이 임계 범위 내에 존재할 경우, 상기 적어 (뒷면에 계속)"}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시 예들은 생체 정보를 제공하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 스마트 폰, 태블릿 개인용 컴퓨터(personal computer: PC), 웨어러블 전자 장치와 같은 휴대가 용이한 전 자 장치의 사용이 증가하고 있으며, 전자 기술의 발전에 따라 생체 신호를 측정하는 기술 또한 발전하고 있다. 예를 들면, 웨어러블 전자 장치와 같이 일상적으로 사용자가 착용할 수 있는 전자 장치를 통해 사용자의 생체 신호를 연속적으로 측정하는 기술이 개발되고 있다. 웨어러블 전자 장치는 사용자에 착용된 상태에서, 사용자의 생체 신호를 측정할 수 있는 다양한 센서들을 포함 할 수 있다. 웨어러블 전자 장치는 다양한 센서들을 통해 획득된 생체 신호들에 기반하여 적어도 한 종류 이상 의 생체 정보를 제공할 수 있다. 예를 들어, 웨어러블 전자 장치는, 광학적인 방식에 기반하여 생체 신호(예: 광용적맥파(photoplethysmogram: PPG) 신호)를 측정할 수 있고, 전기적인 방식에 기반하여 생체 신호(예: 심전 도(electrocardiography: ECG) 신호)를 측정할 수 있다. 웨어러블 전자 장치는 PPG 신호에 기반하는 생체 정보 를 제공할 수 있고, ECG 신호에 기반하는 생체 정보를 제공할 수 있다. PPG 신호에 기반하는 생체 정보는 심박 수(heart rate: HR), 체압(body pressure), 스트레스(stress) 정보(예: 스트레스 지수), 수면 상태(sleep state)에 대한 정보, 또는 산소 포화도(saturation of percutaneous oxygen: SpO2) 중 적어도 하나를 포함할 수 있다. ECG 신호에 기반하는 생체 정보는 심방 세동(atrial fibrillation) 정보를 포함할 수 있다."}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "웨어러블 전자 장치에서 SpO2는 다양한 건강 서비스들에 사용되고 있다. SpO2를 측정하는 방식들은 제1 측정 방 식 및 제2 측정 방식을 포함할 수 있다. 예를 들어, 제1 측정 방식은 연속적인(Continuous) 방식을 의미하고, 제 2 측정 방식은 온-디맨드(On-demand) 방식을 의미할 수 있다. On-demand 방식은 사용자의 요청에 따라 SpO2 를 측정하는 방식이고, Continuous 방식은 Continuous SpO2측정 모드가 온(on) 되어 있는 동안 별도의 사용자 요청 없이 SpO2를 측정하는 방식일 수 있다. SpO2는 광학적인 방식에 기반하여 측정되는 PPG 신호에 기반하여 제공될 수 있으며, PPG 신호는 내부 광원에 대 한 흡수 또는 투과의 변화율의 변화를 측정함으로써 획득되는데, 이는 포토다이오드(photodiode: PD)를 사용하 는 PPG 센서를 통해 구현될 수 있다. 하지만, 전문적인 의료 장치와 달리 웨어러블 전자 장치는 사용자 신체의 일부(예: 사용자의 손목)에 밀착 접촉 이 유지되는 것이 아니기 때문에 웨어러블 전자 장치와 사용자 신체의 일부 간의 약간의 틈을 통해 들어오는 태 양광 또는 실내등에 의한 외부 광이 PD를 통해 유입될 수 있다. 이런 PD를 통한 외부 광의 유입은 PPG 센서를 통해 획득되는 PPG 신호의 측정에 잡음을 야기할 수 있다. 예를 들어, 웨어러블 전자 장치의 경우 그 특성으로 인해 사용자 신체의 일부(예: 손목)에 착용되어 사용자 신 체를 따라 움직이거나 외력에 의해 웨어러블 전자 장치의 움직임이 발생하는 상태에서 SpO2를 측정해야 할 수 있다. 이 경우, 사용자의 요청에 따라 SpO2가 측정되는 On-demand 방식이 아닌 별도의 사용자 요청 없이 SpO2가 측정되는 Continuous 방식의 경우 사용자의 자세 또는 사용자의 움직임으로 인해 SpO2가 부정확하게 측정될 가능성이 높을 수 있다. 예를 들어, 광학적인 방식에 기반하여 측정되는 PPG 신호의 경우 사용자 신체의 일부 (예: 손목)에 조사된 광에 대응하여 반사되는 광을 이용하는 측정 방식이기 때문에, Continuous 방식이 사용될 경우 외부 광 유입으로 인해 PPG 신호의 측정에 잡음이 발생할 가능성이 높을 수 있고, 이런 잡음으로 인한 부 정확한 PPG 신호 측정은 SpO2 측정에 대한 정확도를 감소시킬 가능성이 높을 수 있다. 본 개시의 다양한 실시 예들은 Continuous 방식에 기반하여 SpO2를 측정할 경우, 부정확한 SpO2 측정이 발생될 수 있는 구간을 제거하여 SpO2 정확도를 증가시킬 수 있는 전자 장치 및 그 동작 방법을 제공하고자 한다."}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시 예들은 생체 정보를 제공하는 전자 장치 및 그 동작 방법을 제공할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 전자 장치는 적어도 하나의 센서, 통신 회로, 및 상기 적어도 하나의 센 서 및 통신 회로와 작동적으로 연결된 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 각 각이 광용적맥파(photoplethysmogram: PPG) 신호에 기반하는 기준 값과 산소 포화도(saturation of percutaneous oxygen: SpO2)의 페어(pair)들을 포함하는, 다수의 그룹들이 지원되는 제1 측정 방식에서, 상기 적어도 하나의 센서를 통해 상기 전자 장치의 착용 상태를 식별하고, 상기 다수의 그룹들 중 상기 착용 상태에 상응하는 그룹을 선택하고, 상기 적어도 하나의 센서를 통해 제1 PPG 신호를 획득하고, 상기 제1 PPG 신호에 기 반하는 제1 기준 값과 상기 선택된 그룹에 기반하여 제1 SpO2를 획득하고, 상기 제1 측정 방식에서 단일 그룹이 지원되는 제2 측정 방식으로 전환하고, 상기 제2 측정 방식에서, 상기 적어도 하나의 센서를 통해 제2 PPG 신호 를 획득하고, 상기 제2 PPG 신호에 기반하는 제2 기준 값과 상기 단일 그룹에 기반하여 제2 SpO2를 획득하고, 및 상기 통신 회로를 통해, 상기 제1 SpO2, 상기 제1 기준 값, 상기 선택된 그룹의 식별자, 상기 제2 SpO2중 적 어도 하나를 서버로 송신하도록 구성된다. 본 개시의 다양한 실시 예들에 따르면, 서버는 통신 회로, 및 상기 통신 회로와 작동적으로 연결된 적어도 하나 의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 상기 통신 회로를 통해, 광용적맥파 (photoplethysmogram: PPG) 신호에 기반하는 기준 값과 산소 포화도(saturation of percutaneous oxygen: SpO2)의 페어(pair)들을 포함하는, 다수의 그룹들이 지원되는 제1 측정 방식에서 획득된 제1 SpO2, 상기 제1 SpO2에 상응하는 제1 기준 값, 상기 다수의 그룹들 중 상기 제1 SpO2를 획득하는데 사용된 그룹의 식별자, 상기 제1 측정 방식에서 단일 그룹이 지원되는 제2 측정 방식으로 전환된 후 상기 제2 측정 방식에서 측정된 제2 SpO2를 수신하고, 상기 제1 SpO2와 상기 제2 SpO2 간의 차이가 임계 값 이하일 경우, 상기 식별자에 매핑되는 그룹에서 상기 제1 SpO2와 페어를 이루는 기준 값을 상기 수신한 제1 기준 값으로 변경하여 상기 식별자에 매핑 되는 그룹을 업데이트하고, 및 상기 통신 회로를 통해, 상기 식별자 및 상기 업데이트된 그룹을 상기 전자 장치 로 송신하도록 구성된다. 본 개시의 다양한 실시 예들에 따르면, 전자 장치는 적어도 하나의 센서, 및 상기 적어도 하나의 센서와 작동적 으로 연결된 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 상기 적어도 하나의 센서를 통해 획득되는 상기 전자 장치의 움직임의 변화량이 임계 범위 내에 존재할 경우, 상기 적어도 하나의 센서를 통해 획득되는 상기 전자 장치의 착용 상태를 식별하고, 각각이 광용적맥파(photoplethysmogram: PPG) 신호에 기반하는 기준 값과 산소 포화도(saturation of percutaneous oxygen: SpO2)의 페어(pair)들을 포함하는, 다수 의 그룹들 중 상기 착용 상태에 상응하는 그룹을 선택하고, 및 상기 적어도 하나의 센서를 통해 제1 PPG 신호 를 획득하고, 상기 제1 PPG 신호에 기반하는 제1 기준 값과 상기 선택된 그룹에 기반하여 제1 SpO2를 획득하도 록 구성된다."}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예들에 따르면, 전자 장치(예: 웨어러블 전자 장치)가 Continuous 방식에 기반하여 SpO2를 측정할 경우 부정확한 SpO2 측정이 발생될 수 있는 구간을 제거하여 SpO2 정확도를 증가시킬 수 있다. 다양한 실시 예들에 따르면, 전자 장치(예: 웨어러블 전자 장치)가 Continuous 방식에 기반하여 SpO2를 측정할 경우 부정확한 SpO2 측정이 발생될 수 있는 구간을 제거하여 SpO2 측정 성공률을 증가시킬 수 있다.다양한 실시 예들에 따르면, 전자 장치(예: 웨어러블 전자 장치)가 Continuous 방식에 기반하여 SpO2를 측정할 경우 SpO2 측정이 불가능한 상태가 확인될 경우 SpO2 측정을 수행하지 않도록 함으로써 불필요한 전류 소모를 방지할 수 있다. 다양한 실시 예들에 따르면, 전자 장치(예: 웨어러블 전자 장치)가 Continuous 방식에 기반하여 SpO2를 측정할 경우 서버와의 연동을 통해 R-커브(R-curve) 정확도를 향상시킬 수 있고, 이에 따라 SpO2 정확도가 증가될 수 있다. 다양한 실시 예들에 따르면, 전자 장치(예: 웨어러블 전자 장치)가 Continuous 방식에 기반하여 SpO2를 측정할 경우 사용자의 자세 또는 사용자의 움직임으로 인해 SpO2가 부정확하게 측정될 확률을 감소시킬 수 있다."}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 개시의 다양한 실시 예들을 첨부된 도면을 참조하여 상세히 설명한다. 그리고, 본 개시의 다양한 실시 예들을 설명함에 있어서, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 다양한 실시 예들의 요지를 불필요하게 흐릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 그리고 후술되는 용어들은 본 개시 의 다양한 실시 예들에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따 라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 본 명세서에서 사용되는 기술적 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 개시의 다양한 실시 예들을 한정하려는 의도가 아님을 유의해야 한다. 또는, 본 명세서에서 사용되는 기술적 용어는 본 명세서 에서 특별히 다른 의미로 정의되지 않는 한, 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일 반적으로 이해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해 석되지 않아야 한다. 또는, 본 명세서에서 사용되는 기술적인 용어가 본 개시의 사상을 정확하게 표현하지 못하 는 잘못된 기술적 용어일 때에는, 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것 이다. 또는, 본 개시의 다양한 실시 예들에서 사용되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또는, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 다수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 동작들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 동작들 은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 동작들을 더 포함할 수 있는 것으로 해석되어야 한 다. 또는, 본 명세서에서 사용되는 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 개시의 권리 범위를 벗어나지 않으 면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있고, 유사하게 제2 구성 요소도 제1 구성 요소로 명명될 수 있다. 어떤 구성 요소가 다른 구성 요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성 요소 에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성 요소가 존재할 수도 있다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성 요소가 존재하지 않는 것으로 이해되어야 할 것이다. 이하, 첨부된 도면을 참조하여 본 개시에 따른 다양한 실시 예들을 상세히 설명하되, 도면 부호에 관계없이 동 일하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또는, 본 개시의 다양한 실시 예들을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 개시의 요지를 흐 릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또는, 첨부된 도면은 본 개시의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 개시의 사상이 제한되는 것으로 해석되어서는 아니 됨에 유의하여야만 한다. 본 개시의 사상은 첨부된 도면들 외에 모든 변경들, 균등물들 내지 대체물들에 까지도 확장 되는 것으로 해석되어야 한다. 도 1a는 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1a를 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈 , 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리 , 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 (central processing unit: CPU) 또는 어플리케이션 프로세서(application processor: AP)) 또는 이와는 독립 적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있 다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서 는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세 서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 다수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다.센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 다수 의 구성요소들(예: 다수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다.안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 다수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 다수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다 른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르 면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 다수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또 는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청 할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있 다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로 서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부 의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망 을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워 크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 다수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다.본 문서의 다양한 실시 예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포 함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circui t)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치 들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 다수의 개체를 포함할 수 있으며, 다수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 다수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 다수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 다수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 1b는 다양한 실시 예들에 따른 전자 장치의 전면의 사시도이고, 도 1c는 도 1b의 다양한 실시 예들에 따른 전자 장치의 후면의 사시도이다. 도 1b 및 도 1c를 참조하면, 일 실시 예에 따른 전자 장치(101b)(예: 도 1a의 전자 장치)는 제1 면(또는 전면)(110A), 제2 면(또는 후면)(110B), 및 제1 면(110A) 및 제2 면(110B) 사이의 공간을 둘러싸는 측면(110 C)을 포함하는 하우징(110a)과, 하우징(110a)의 적어도 일부에 연결되고 전자 장치(101b)를 사용자 신체의 일부 (예: 사용자의 손목 및 사용자의 발목)에 탈착 가능하게 결착하도록 구성된 착용 부재(150a, 160a)를 포함할 수 있다. 다른 실시 예(미도시)에서, 하우징은 도 1b 및 도 1c의 제1 면(110A), 제2 면(110B) 및 측면(110C)들 중 일부를 형성하는 구조를 지칭할 수도 있다. 일 실시 예에 따르면, 제1 면(110A)은 적어도 일부분이 실질적으로 투명한 전면 플레이트(112a)(예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트)에 의하여 형성될 수 있다. 제2 면(110B)은 실질적으로 불투명한 후면 플레이트(107a)에 의하여 형성될 수 있다. 일 실시 예에서, 전자 장치(101b)가 제2 면(110B)에 배치된 센서 모듈(예: 도 1a의 센서 모듈)을 포 함할 때, 후면 플레이트(107a)는 적어도 부분적으로 투명한 영역을 포함할 수 있다. 예를 들어, 후면 플레이트(107a)는 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스 틸(STS), 또는 마그네슘), 또는 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 측면(110C)은, 전면 플 레이트(112a) 및 후면 플레이트(107a)와 결합하며, 금속 및/또는 폴리머를 포함하는 측면 베젤 구조(또는 측면 부재)(106a)에 의하여 형성될 수 있다. 일 실시 예에서, 후면 플레이트(107a) 및 측면 베젤 구조(106a)는 일체 로 형성되고 동일한 물질(예: 알루미늄과 같은 금속 물질)을 포함할 수 있다. 착용 부재(150a, 160a)는 다양한재질 및 형태로 형성될 수 있다. 직조물, 가죽, 러버, 우레탄, 금속, 세라믹, 또는 물질들 중 적어도 둘의 조합 에 의하여 일체형 및 다수의 단위 링크가 서로 유동 가능하도록 형성될 수 있다. 일 실시 예에 따르면, 전자 장치(101b)는 디스플레이(120a)(예: 도 1a의 디스플레이 모듈), 오디오 모듈 (105a, 108a)(예: 도 1a의 오디오 모듈), 센서 모듈(예: 도 1a의 센서 모듈), 키 입력 장치 (102a, 103a, 104a)(예: 도 1a의 입력 모듈) 및 커넥터 홀(109a) 중 적어도 하나 이상을 포함할 수 있다. 일 실시 예에서, 전자 장치(101b)는 구성요소들 중 적어도 하나(예: 키 입력 장치(102a, 103a, 104a), 커넥터 홀(109a), 또는 센서 모듈)를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 일 실시 예에 따르면, 전자 장치(101b)는 생체 신호를 측정하기 위한 다수의 전극들을 포함할 수 있으며, 다수 의 전극들 중 적어도 하나의 전극은 키 입력 장치(102a, 103a 또는 104a)의 위치, 베젤(106a)의 위치, 디스플레 이(120a) 또는 하우징(110a)의 위치 중 적어도 하나의 위치에 배치될 수 있다. 키 입력 장치 중 휠 키(102a)는 로터리 베젤을 포함할 수 있다. 예를 들어, 디스플레이(120a)는 전면 플레이트(112a)의 상당 부분을 통하여 노출될 수 있다. 디스플레이(120a) 의 형태는 상기 전면 플레이트(112a)의 형태에 상응하는 형태일 수 있으며, 원형, 타원형, 또는 다각형 등과 같 은 다양한 형태들 중 하나일 수 있다. 디스플레이(120a)는 터치 감지 회로, 터치의 세기(예: 압력)를 측정할 수 있는 압력 센서, 및/또는 지문 센서와 결합되거나 인접하여 배치될 수 있다. 일 실시 예에 따르면, 디스플레이(120a)는 생체 신호를 측정하기 위한 다수의 전극들 중 생체 신호를 측정하기 위한 적어도 하나의 투명 전극을 포함할 수 있다. 오디오 모듈(105a, 108a)은 마이크 홀(105a) 및 스피커 홀(108a)을 포함할 수 있다. 마이크 홀(105a)은 외부의 소리를 획득하기 위한 마이크가 내부에 배치될 수 있다. 일 실시 예에서, 마이크 홀(105a)에는 소리의 방향을 획득할 수 있도록 다수의 마이크들이 배치될 수 있다. 스피커 홀(108a)은 외부 스피커 및 통화용 리시버로 사용 할 수 있다. 일 실시 예에서는, 스피커 홀 없이 스피커가 포함될 수 있다(예: 피에조 스피커). 센서 모듈은 전자 장치(101b)의 내부의 작동 상태, 또는 외부의 환경 상태에 상응하는 전기 신호 또는 데 이터를 생성할 수 있다. 예를 들어, 센서 모듈은 하우징(110a)의 제2 면(110B)에 배치된 센서 모듈 (예: 심박수 모니터링(heart rate monitoring: HRM 센서)은 심전도 측정을 위해 적어도 두 개의 전극들(a1, a2)을 포함하는 심전도(electrocardiography: ECG) 센서(165a) 및 심박수 측정을 위한 광용적맥파 (photoplethysmogram: PPG) 센서(165b)를 포함할 수 있다. 전자 장치(101b)는 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, 적외선(infrared: IR) 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 더 포함할 수 있다. 키 입력 장치(102a, 103a, 104a)는, 하우징(110a)의 제1 면(110A)에 배치되고 적어도 하나의 방향으로 회전 가 능한 휠 키(102a), 및/또는 하우징(110a)의 측면(110C)에 배치된 사이드 키 버튼(103a, 104a)을 포함할 수 있다. 휠 키(102a)는 전면 플레이트(112a)의 형태에 상응하는 형태일 수 있다. 다른 실시 예에서는, 전자 장치 (101b)는 키 입력 장치(102a, 103a, 104a)들 중 일부 또는 전부를 포함하지 않을 수 있고 포함되지 않은 키 입 력 장치(102a, 103a, 104a)는 디스플레이(120a) 상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 커넥터 홀 (109a)은, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터(예를 들어, USB 커넥터)를 수용할 수 있고, 외부 전자 장치와 오디오 신호를 송수신하기 위한 커넥터를 수용할 수 있는 다른 커넥터 홀(미도시)을 포함할 수 있다. 일 실시 예에서, 전자 장치(101b)는 커넥터 홀(109a)의 적어도 일부를 덮고, 커넥터 홀에 대한 외부 이물질의 유입을 차단하는 커넥터 커버(미도시)를 더 포함할 수 있다. 착용 부재(150a, 160a)는 락킹 부재(예: 도 1c의 락킹 부재(151a, 161a))를 이용하여 하우징(110a)의 적어도 일부 영역에 탈착 가능하도록 결착될 수 있다. 락킹 부재(151a, 161a)는 예를 들면, 포고 핀(pogo pin)과 같은 결속용 부품을 포함할 수 있으며, 실시 예에 따라 착용 부재(150a, 160a)에 형성된 돌기 또는 홈(protrusion(s) or recess(es))으로 대체될 수 있다. 예를 들어, 착용 부재(150a, 160a)는 하우징에 형성된 홈 또는 돌기 에 맞물리는 방식으로 결합될 수 있다. 착용 부재(150a, 160a)는 고정 부재(152a), 고정 부재 체결 홀(153a), 밴드 가이드 부재(154a), 밴드 고정 고리(155a) 중 하나 또는 그 이상을 포함할 수 있다. 고정 부재(152a)는 하우징(110a)과 착용 부재(150a, 160a)를 사용자 신체의 일부(예: 사용자의 손목, 발목)에 고정시키도록 구성될 수 있다. 고정 부재 체결 홀(153a)은 고정 부재(152a)에 대응하여 하우징(110a)과 착용 부 재(150a, 160a)를 사용자 신체의 일부에 고정시킬 수 있다. 밴드 가이드 부재(154a)는 고정 부재(152a)가 고정 부재 체결 홀(153a)과 체결 시 고정 부재(152a)의 움직임 범위를 제한하도록 구성됨으로써, 착용 부재(150a,160a)가 사용자 신체의 일부에 밀착하여 결착되도록 할 수 있다. 밴드 고정 고리(155a)는 고정 부재(152a)와 고 정 부재 체결 홀(153a)이 체결된 상태에서, 착용 부재(150a, 160a)의 움직임 범위를 제한할 수 있다. 도 1d는 도 1b의 전자 장치를 나타내는 분리 사시도이다. 도 1d를 참조하면, 전자 장치(101b)(예: 도 1a의 전자 장치)는 측면 베젤 구조(210a), 휠 키(220a), 전면 플레이트(112a), 디스플레이(120a), 제1 안테나(250a), 제2 안테나(255a), 지지 부재(260a)(예: 브라켓), 배터 리(270a), 인쇄 회로 기판(280a), 실링 부재(290a), 후면 플레이트(293a), 및 착용 부재(295a, 297a)를 포함할 수 있다. 전자 장치(101b)의 구성요소들 중 적어도 하나는 도 1b 또는 도 1c의 전자 장치(101b)의 구성요소들 중 적어도 하나와 동일하거나, 또는 유사할 수 있으며, 중복되는 설명은 생략하기로 한다. 일 실시 예에서, 지 지 부재(260a)는 전자 장치(101b) 내부에 배치되어 측면 베젤 구조(210a)와 연결될 수 있거나, 측면 베젤 구조 (210a)와 일체로 형성될 수 있다. 일 실시 예에서, 지지 부재(260a)는 금속 재질 및/또는 비금속 (예: 폴리머) 재질로 형성될 수 있다. 지지 부재(260a)는 일면에 디스플레이(120a)가 결합되고 타면에 인쇄 회로 기판(280a) 이 결합될 수 있다. 인쇄 회로 기판(280a)에는 프로세서, 메모리, 및/또는 인터페이스가 장착될 수 있다. 일 실 시 예에서, 프로세서는 CPU, AP, 그래픽 프로세싱 유닛(graphic processing unit: GPU), 센서 프로세서, 또는 통신 프로세서 (communication processor: CP) 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 일 실시 예에서, 인터페이스 는 고화질 멀티미디어 인터페이스(high definition multimedia interface: HDMI), 범용 직렬 버스(universal serial bus: USB) 인터페이스, SD카드 인터페이스, 및/또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치(101b)를 외부 전자 장치와 전기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 배터리(270a)는, 전자 장치(101b)의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 재충전 불가능 한 1차 전지, 또는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 배터리(270a)의 적어도 일부는 인쇄 회로 기판(280a)과 실질적으로 동일 평면 상에 배치될 수 있다. 배터리(270a)는 전자 장치(101b) 내부에 일체로 배치될 수 있고, 전자 장치(101b)와 탈부착 가능하게 배치될 수도 있다. 제1 안테나(250a)는 디스플레이(120a)와 지지 부재(260a) 사이에 배치될 수 있다. 제1 안테나(250a)는 NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테 나를 포함할 수 있다. 제1 안테나(250a)는 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신 할 수 있고, 근거리 통신 신호 또는 결제 데이터를 포함하는 자기-기반 신호를 송출할 수 있다. 일 실시 예에서, 측면 베젤 구조(210a) 및/또는 상기 지지 부재(260a)의 일부 또는 그 조합에 의하여 안테나 구조가 형 성될 수 있다. 제2 회로 기판(255a)은 회로 기판(280a)과 후면 플레이트(293a) 사이에 배치될 수 있다. 제2 회로 기판(255a)은 안테나, 예를 들어, NFC 안테나, 무선 충전 안테나, 및/또는 MST 안테나를 포함할 수 있다. 제2 회로 기판 (255a)은 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신 할 수 있고, 근거리 통신 신호 또는 결제 데이터를 포함하는 자기-기반 신호를 송출할 수 있다. 일 실시 예에서, 측면 베젤 구조(210a) 및/또는 상기 후면 플레이트(293a)의 일부 또는 그 조합에 의하여 안테나 구조가 형성될 수 있다. 다양한 실시 예들에서, 전자 장치(101b)가 센서 모듈(예: 도 1a의 센서 모듈, 및 도 1b의 센서 모듈)을 포함할 때, 제2 회로 기판(255a)에 배치된 센서 회로 또는 제2 회로 기판(255a)과는 별도의 센서 소자(예: 광전 변환 소자(photoelectric conversion element)나 전극 패드)가 배치될 수 있다. 일 실시 예에서, 센서 모듈로 서 제공되는 전자 부품이 회로 기판(280a)과 후면 플레이트(293a) 사이에 배치될 수 있다. 실링 부재(290a)는 측면 베젤 구조(210a)와 후면 플레이트(293a) 사이에 위치할 수 있다. 실링 부재(290a)는, 외부로부터 측면 베젤 구조(210a)와 후면 플레이트(293a)에 의해 둘러싸인 공간으로 유입되는 습기와 이물질을 차단하도록 구성될 수 있다. 다양한 실시 예들에서, 전자 장치(예: 웨어러블 전자 장치)는 사용자의 다양한 생체 신호들을 측정할 수 있는 적어도 하나의 센서를 포함하는 센서 모듈(예: 도 1a 의 센서 모듈)을 포함하고, 센서 모듈을 통해 획득된 생체 신호들에 기반하여 적어도 한 종류 이상의 생체 정보를 제공할 수 있다. 일 실시 예에서, 광학적인 방식에 기반하여 획득되는 생체 신호는 PPG 신호일 수 있고, 전기적인 방식에 기반하여 획득되는 생체 신호는 ECG 신호 일 수 있다. 일 실시 예에서, PPG 신호에 기반하는 생체 정보는 심박수(heart rate: HR), 체압(body pressure), 스트레스 (stress) 정보(예: 스트레스 지수), 수면 상태(sleep state)에 대한 정보, 또는 산소 포화도(saturation of percutaneous oxygen: SpO2) 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, ECG 신호에 기반하는 생체 정 보는 심방 세동(atrial fibrillation) 정보를 포함할 수 있다. 다양한 실시 예들에서, SpO2는 하기 수학식 1과 같이 정의될 수 있다. <수학식 1>"}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서, Hb는 헤모글로빈(hemoglobin)의 수치(예: 농도)를 나타내며, O2Hb는 산소 헤모글로빈(oxy hemoglobin: O2Hb)의 수치(예: 농도)을 나타낼 수 있다. SpO2는 혈액 속의 헤모글로빈의 수치와 산소 헤모글로 빈의 수치의 합에 대한 산소 헤모글로빈 수치의 백분율로 결정될 수 있다. 예를 들어, SpO2 값은 건강한 사람의 경우 그 값이 100에 가까울 수 있다. 일 실시 예에서, SpO2는 광학적인 방식에 기반하는 PPG 신호에 기반하여 제공될 수 있다. PPG 신호는 PPG 센서 를 통해 획득될 수 있다. PPG 센서는 발광부 및 수광부를 포함할 수 있으며, 발광부는 적색(RED) 광(예: 약 650nm의 파장을 가지는 가시 광선)을 발생하는 RED 발광 다이이오드(light emitting diode: LED) 및 적외선 (infrared; IR) 광(예: 약 950nm의 파장을 가지는 적외선))을 발생하는 IR LED를 포함할 수 있다. PPG 센서는 발광부를 통해 RED 광 및 IR 광을 사용자 신체의 일부(예: 사용자의 피부)에 조사하고, 이렇게 조사된 RED 광 및 IR 광 중 일부가 사용자 신체의 일부로부터 반사되되는 신호를 수광부를 통해 수광하여 PPG 신호를 획득할 수 있다. PPG 신호는 RED 광이 수광된 RED PPG 신호 및 IR 광이 수광된 IR PPG 신호를 포함할 수 있다. SpO2는 PPG 센서에서 획득된 PPG 신호에 포함되는 RED PPG 신호 및 IR PPG 신호 각각의 교류(alternating current: AC) 성분 및 직류(direct current: DC) 성분에 따라 계산되는 R 값에 기반하여 측정될 수 있다. 일 실시 예에 서, SpO2는 PPG 신호에 기반하는 R 값에 기반하여 측정되는 것을 설명하지만, PPG 신호 뿐만 아니라 다른 다양 한 생체 신호들 중 어느 하나에 기반하여 생성되는 값에 기반하여 측정될 수도 있다. 일 실시 예에서, SpO2의 정확도를 향상시키기 위해 고속 푸리에 변환(fast Fourier transform: FFT)과 이산 코 사인 변환(discrete cosine transform: DCT)에 기반하는 알고리즘이 제안된 바 있으며, 이 알고리즘에 15Hz 샘 플링 레이트(sampling rate)로 64포인트-FFT(64-point FFT)를 적용할 경우 SpO2는 하기 수학식 2와 같이 표현 될 수 있다. <수학식 2> SpO2 (%) = 110-25 X R 수학식 2에서, R은 PPG 신호에 기반하는 기준 값일 수 있다. 일 실시 예에 따르면, R은 하기 수학식 3과 같이 정의될 수 있다. <수학식 3>"}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 3에서, ACRED는 RED PPG 신호의 AC 성분을 나타내고, DCRED는 RED PPG 신호의 DC 성분을 나타내고, ACIR은 IR PPG 신호의 AC 성분을 나타내고, DCIR은 IR PPG 신호의 DC 성분을 나타낼 수 있다. 도 2는 다양한 실시 예들에 따른 광 흡수율에 따른, SpO2 측정에 사용되는 AC 성분 및 DC 성분의 일 예를 도시 한 도면이다. 도 2를 참조하면, PPG 센서의 발광부에서 사용자 신체의 일부(예: 사용자의 손목)로 조사된 광(예: IR 광 또는 RED 광)의 경우 일부는 사용자 신체의 일부로 흡수되고, 일부는 반사되어 PPG 센서의 수광부를 통해 수광될 수 있다. 조사된 광이 IR 광일 경우 IR PPG 신호가 획득될 수 있고, 조사된 광이 RED 광일 경우 RED PPG 신호가 획득될 수 있으며, 수학식 3및 수학식 3에서 설명한 바와 같이 RED PPG 신호의 AC 성분인 ACRED, RED PPG 신호의 DC 성분인 DCRED, IR PPG 신호의 AC 성분인 ACIR, 및 IR PPG 신호의 DC 성분인 DCIR 에 기반하여 R 값이 획득 될 수 있고, 획득된 R 값에 기반하여 SpO2가 획득될 수 있다. 도 2의 그래프에서 세로 축은 흡수된 광량(light absorption)을 나타내며, 가로 축은 시간(time)을 나타낼 수 있다. 도 2의 그래프에서 AC 성분 및 DC 성분은 각각 IR 광이 조사될 경우의 AC 성분(예: ACIR) 및 DC 성분(예: DCIR), 또는 RED 광이 조사될 경우의 AC 성분(예: ACRED) 및 DC 성분(예: DCRED)을 나타낼 수 있다. AC 성분은 혈액에 포함된 산소의 양(예: 헤모글로빈과 결합된 산소의 양)에 따라 광의 흡수량이 변화하기 때문에 AC파형으로 나타날 수 있다(예: 가변 동맥혈 흡수(variable arterial blood absorption)). DC 성분은 사용자의 세포, 뼈와 같이 광의 흡수 정도가 변화하지 않는 성분들에 의해 결정될 수 있다(예: 상 시 동맥혈 흡수(constant arterial blood absorption), 정맥 동맥혈 흡수(venous arterial blood absorption), 및 세포, 뼈 흡수(tissue, bone absorption)). 도 3은 다양한 실시 예들에 따른 파장에 따른 광 흡수율의 일 예를 도시한 도면이다. 도 3을 참조하면, PPG 센서의 발광부에서 사용자 신체의 일부(예: 사용자의 손목)로 조사된 광의 경우 일부는 사용자 신체의 일부로 흡수되고, 일부는 반사되어 PPG 센서의 수광부를 통해 수광될 수 있다. 반사되는 광량의 변화량은 헤모글로빈과 결합한 산소에 의해 영향을 받을 수 있다. 도3의 그래프에서 세로 축은 흡광도(absorbance)를 나타내며, 가로 축은 파장(wave length)을 나타낼 수 있다. 일 실시 예에서, IR 광(650nm)과 RED 광(950nm)의 파장이 비산소 헤모글로빈(deoxy hemoglobin: DeoxyHb) 및 산소 헤모글로빈(oxy hemoglobin: OxyHb)에서 광 흡수율의 차이가 크기 때문에 두 개의 파장들을 사용하여 R 값에 기반하는 R 커브(R-Curve)가 생성될 수 있다. 일 예로, 도3의 그래프에서는, RED 광에서는 DeoxyHb의 광 흡수율이 OxyHb의 흡수율에 비해서 높고, IR 광에서는 OxyHb의 흡 수율이 DeoxyHb의 광 흡수율에 비해서 높을 수 있다. 따라서, SpO2를 측정하는 기준 장치의 경우 캘리브레 이션(calibration) 프로세스를 통해 R 값과 SpO2의 상관 관계를 나타내는 R-Curve를 생성할 수 있다. 본 개시의 다양한 실시 예들에서, SpO2를 측정하는 기준 장치를 기준 SpO2측정 장치라 칭하기로 한다. 기준 SpO2 측정 장치는 의료용 SpO2 측정 장치일 수 있다. 일 실시 예에서, 기준 SpO2 측정 장치는 반드시 의료용 SpO2 측정 장치일 필요는 없으며, 사용자의 SpO2를 정확하게 측정할 수 있는 장치라면 그 타입에는 제한이 없다. 도 4는 다양한 실시 예들에 따른 SpO2 측정에 사용되는 R-Curve의 일 예를 도시한 도면이다. 도 4를 참조하면, 도 4에 도시되어 있는 그래프는 R-Curve를 나타내며, 세로 축은 SpO2(% O2 Saturatio n)를 나타내며, 가로축은 R 값을 나타낼 수 있다. 도 4에 도시되어 있는 바와 같이, SpO2 측정에 사용되는 R- Curve는 PPG 센서에서 출력되는 PPG 신호에 기반하여 식별되는 R 값과 SpO2간의 상관 관계로 정의될 수 있 다. 일 실시 예에서, R-Curve는 R 값과 SpO2의 페어(pair)들을 포함하는 그룹으로 정의될 수 있다. 일 실 시 예에서는, R-Curve를 일 예로 하여 R 값과 SpO2간의 상관 관계를 정의하였으나, R-Curve 형태 뿐 만 아니라 테이블(table) 형태로 R 값과 SpO2의 페어들을 포함할 수도 있다. 전자 장치(예: 웨어러블 전자 장치(예: 도 1a의 전자 장치)에서 SpO2는 다양한 건강 서비스들에 사용될 수 있다. SpO2를 측정하는 방식들은 제 1 측정 방식 및 제 2 측정 방식을 포함할 수 있다. 예를 들어, 제 1 측정 방식은 연속적인(Continuous) 방식을 의미하고, 제 2 측정 방식은 온-디맨드(On-demand) 방식을 의미할 수 있다. On-demand 방식은 사용자의 요청에 따라 SpO2를 측정하는 방식일 수 있다. Continuous 방식은 Continuous 측정 모드가 온(on) 되어 있는 동안 별도의 사용자 요청 없이 연속적으로 SpO2를 측정하는 방식일 수 있으며, Continuous 방식에서는 다수의 R-Curve들이 사용될 수 있다. 예를 들어, Continuous 방식에서는 각 각이 R 값과 SpO2의 페어들을 포함하는, 다수의 그룹들이 사용될 수 있다. 예를 들어, On-demand 방식은 사용자 요청(예: 사용자가 SpO2 측정을 시작하기 위한 메뉴를 터치한 입력)이 전 자 장치로 수신되면 SpO2를 측정하는 방식이고 (예: 유효한 SpO2 측정이 완료될 때 까지 SpO2를 측정하는 방식), Continuous 방식은 SpO2 측정이 활성화된 상태에서 SpO2 측정이 비활성화 될 때까지 지정된 기간(예: 1 시간)에 기반하여 연속적으로 SpO2 측정을 수행하는 방식일 수 있다. 예를 들어, SpO2 측정이 활성화 되었다는 것은 PPG 센서, SpO2를 측정하기 위한 적어도 하나의 소프트웨어 모듈 및/또는 SpO2를 측정하기 위한 기능 중 적어도 일부가 활성화되는 것을 의미할 수 있다. 예를 들어, On-demand 방식은 사용자가 SpO2를 측정하기 위해 안정적인 자세를 취하고 있는 상태에서 SpO2를 측정할 때 이용될 수 있고, Continuous 방식은 수면 중과 같이별도의 사용자 요청 없이 연속적으로 SpO2를 측정하기 위해 이용될 수 있다 . On-demand 방식에서 사용되는 R- Curve 및 Continuous 방식에서 사용되는 R-Curve는 동일할 수 있다. On-demand 방식 및 Continuous 방식 둘 다 에서 사용되는 R-Curve 는 기준 SpO2 측정 장치를 통해 생성된 R-Curve일 수 있다. 예를 들어, On-demand 방식 및 Continuous 방식 둘 다에서 사용되는 R-Curve 는 기준 SpO2 측정 장치를 통해 사용자의 움직임이 비교적 적 은 상태에서 적절한 측정 상태(예컨대, 사용자 신체에 기준 SpO2 측정 장치의 측정 부분이 밀착된 상태)에서 SpO2를 측정하여 생성된 R-Curve일 수 있다. Continuous 방식에서는 사용자가 SpO2 측정을 의도한 상태가 아닐 때 다양한 사용 환경(예: 사용자의 자세)에서 SpO2가 연속적으로 측정될 수 있다. 따라서, 기준 SpO2 측정 장치를 통해 Continuous 방식에서 사용자가 안정적 인 자세를 취하고 있는 상태에서 생성된 R-Curve에 기반하여 웨어러블 전자 장치를 통하여 SpO2가 측정될 경우 측정된 SpO2가 부정확할 수 있다. 웨어러블 전자 장치는 전문적인 의료 장치인 기준 SpO2 측정 장치와는 달리 사용자 신체의 일부(예: 사용자의 손목)에 밀착 접촉이 유지되는 것이 아니기 때문에 웨어러블 전자 장치와 사 용자의 신체의 일부 간의 약간의 틈을 통해 들어오는 태양광 또는 실내등에 의한 외부 광이 유입될 수 있다. 이 와 같이 PPG 센서의 수광부에 포함되는 포토다이오드(photodiode: PD)에는 내부 광원에서 발생되는 광뿐만 아니 라 외부에서 야기된 광들도 입력되게 되는데 이는 PPG 신호의 측정에 잡음을 야기할 수 있다. 이하 설명의 편 의를 위해, 웨어러블 전자 장치를 사용자의 손목에 착용하는 워치(watch) 형태로 예를 들어 설명하나 웨어러블 전자 장치의 종류에는 제한이 없다. 예를 들어, 웨어러블 전자 장치는 사용자의 얼굴에 착용하는 안경 형태의 전자 장치일 수도 있다. 예를 들어, 웨어러블 전자 장치의 경우 사용자의 신체(예: 손목)에서 SpO2를 측정하기 위해 다음의 조건 및 조건 중 적어도 하나의 조건을 충족해야 할 수 있다. PPG 센서 세팅(setting) PPG 센서는 SpO2를 측정하기 위해 비교적 높은(예: 임계값 이상인) 신호대 잡음 비(signal to noise ratio: SNR)가 확보될 수 있도록 아래의 조건 중 적어도 하나를 만족하도록 세팅될 수 있다. . 100hz 이상의 RED LED 및/또는 IR LED의 샘플 레이트(sample rate) . 비교적 넓은(예: 임계값 이상인) LED 펄스 폭(pulse width) . IR LED 및 RED LED 의 비교적 큰(예: 임계값 이상인) 전류의 사용 착용 상태 . 사용자의 신체의 일부(예: 손목)의 움직임이 비교적 적은 상태에서 웨어러블 전자 장치가 사용자의 신체의 일 부에 밀착되도록 착용되는 상태 일 실시 예에서, 웨어러블 전자 장치에서 사용자 신체의 일부에 의해 접촉되는 면적의 크기가 임계 면적 이상일 경우, 웨어러블 전자 장치가 사용자 신체의 일부에 밀착되도록 착용된 상태를 나타낼 수 있다. . R-Curve 생성시 적용된(예: R-Curve 캘리브레이션(calibration) 프로세스에서 사용된) 착용 상태와 유사하거 나 실질적으로 동일한 착용 상태 일 실시 예에서, 착용 상태는 웨어러블 전자 장치가 사용자 신체의 일부에 어떤 형태로 착용되어 있는지를 나타 내는 상태일 수 있다. 일 실시 예에 따르면, 착용 상태는 웨어러블 전자 장치가 사용자 신체의 일부에 착용되는 것 자체를 나타내는 것이 아니라 웨어러블 전자 장치가 사용자 신체의 일부에 어떤 형태로 착용되어 있는지를 나타내는 상태일 수 있다. 일 실시 예에서, 착용 상태는 착용 상태는 웨어러블 전자 장치에 포함되어 있는 센서 모듈을 통해 획득되는 적어도 하나의 착용 상태 신호에 기반하여 식별될 수 있으며, 착용 상태를 나타내는 정보 를 착용 상태 정보라 칭하기로 한다. 착용 상태 정보는 적어도 하나의 정보 엘리먼트(information element)를 포함할 수 있으며, 적어도 하나의 정보 엘리먼트 각각은 착용 상태 신호에 상응하는 착용 상태를 나타낼 수 있 다. 예를 들어, 착용 상태 정보가 3개의 정보 엘리먼트들을 포함할 경우, 3개의 정보 엘리먼트들은 웨어러블 전 자 장치와 사용자 신체의 일부 간에 주어지는 압력, 웨어러블 전자 장치가 사용자 신체의 일부에 접촉되는 면적 의 크기, 웨어러블 전자 장치가 사용자 신체의 일부에 접촉되는 방향을 포함할 수 있다. 일 실시 예에서, 웨어러블 전자 장치의 착용 상태는 웨어러블 전자 장치에 의해 사용자 신체의 일부에 가해지는 압력, 및/또는 웨어러블 전자 장치의 위치 중 적어도 하나에 의해 결정될 수 있다. PPG 신호에 기반하는 생체 정보는 심박수(heart rate: HR), 체압(body pressure), 스트레스(stress) 정보(예: 스트레스 지수), 수면 상태(sleep state)에 대한 정보, 또는 SpO2 중 적어도 하나를 포함할 수 있으며, 이 중 HR과 SpO2 각각을 측정하기 위해 필요로 되는 PPG 센서 세팅 및 착용 상태에 대해서 비교하면 하기 표 1과 같이 나타낼 수 있다. <표 1>"}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "표 1에 나타낸 바와 같이, SpO2가 측정될 경우 다른 생체 정보(예: HR)가 측정될 경우에 비해 PPG 센서 세팅, 착용 상태, Calibration 측면에서 까다로운 측면이 있으며, 따라서 SpO2에 관련된 건강 서비스를 제공하기 위해 SpO2측정 모드를 항상 실행시키는것은 비효율적일 수 있다. SpO2측정 모드를 항상 실행시키지 않고 필요에 따라 SpO2 측정 모드를 실행시킨다고 할지라도, Continuous 방식이 사용될 경우 SpO2가 부정확하게 측정될 가능성이 높을 수 있다. Continuous 방식이 사용될 경우, 예를 들어, 수면으로 인해 사용자의 움직임이 매우 적을 지라도, 사용자의 수면 자세에 의해 웨어러블 전자 장치가 착용되어 있는 사용자 신체의 일부(예: 손목)의 눌림 또는 밀림에 의해 웨어러블 전자 장치의 착용 상태 (예: 착용 상태 정보의 적어도 일부)가 변할 수 있다. 이에 따라 SpO2가 부정확하게 측정될 확률이 비교적 높을 수 있다. 도 5는 다양한 실시 예들에 따른 Continuous 방식이 사용될 경우 사용자의 전자 장치 착용 상태 변경에 따른 SpO2 측정 오류의 일 예를 도시한 도면이다. 도 5를 참조하면, SpO2측정 모드에서 Continuous 방식으로 SpO2가 측정되고 있는 상태에서, PPG 센서에서 발생 되는 RED 광의 로 데이터(raw data) 및 IR 광의 로 데이터는 사용자가 전자 장치(예: 웨어러블 전자 장치)(예: 도 1a의 전자 장치)를 착용하고 있는 상태의 변경에 따라 급격하게 변경될 수 있다. 일 실시 예 에서, 착용 상태는 웨어러블 전자 장치가 사용자 신체의 일부에 어떤 압력으로 접촉되는지, 또는 얼마나 넓은 면적으로 접촉되는지, 또는 어떤 방향으로 접촉되는지, 또는 얼마나 고르게 접촉되는지를 나타낼 수 있다. . 예 를 들어, 착용 상태 변경되는 것은 사용자 신체의 일부와 웨어러블 전자 장치 간에 주어지는 압력, 웨어러블 전 자 장치가 사용자 신체의 일부에 접촉되는 면적의 크기, 웨어러블 전자 장치가 사용자 신체의 일부에 접촉되는 방향 중 적어도 일부가 변경되는 것을 의미할 수 있다. 예를 들어, 제1 착용 상태와 제2 착용 상태의 2개의 착 용 상태들이 존재할 경우, 제1 착용 상태에 상응하는, 사용자 신체의 일부와 웨어러블 전자 장치 간에 주어지는 압력, 웨어러블 전자 장치가 사용자 신체의 일부에 접촉되는 면적의 크기, 웨어러블 전자 장치가 사용자 신체의 일부에 접촉되는 방향 중 적어도 일부는 제2 착용 상태에 상응하는, 사용자 신체의 일부와 웨어러블 전자 장치 간에 주어지는 압력, 웨어러블 전자 장치가 사용자 신체의 일부에 접촉되는 면적의 크기, 웨어러블 전자 장치가 사용자 신체의 일부에 접촉되는 방향 중 적어도 일부와 다를 수 있다. 일 실시예에서, 도 5에서 참조 번호 500은 SpO2측정 모드에서 Continuous 방식으로 SpO2가 측정되고 있는 상태 에서 사용자의 착용 상태가 변경된 시점을 나타낼 수 있다. 사용자의 착용 상태 변경으로 인한 RED 광의 로 데 이터 및 IR 광의 로 데이터 의 급격한 변경으로 인해 RED PPG 신호의 AC 성분 및 IR PPG 신호의 AC 성분의 크기가 변경되며, 따라서 PPG 센서에서 측정되는 PPG 신호 역시 사용자의 착용 상태 변경에 따라 급격하게 변경될 수 있다. PPG 신호가 급격하게 변경됨에 따라 PPG 신호에 기반하여 측정되는 SpO2 역시 급격하게 변경되며, 이 는 사용자의 실제 SpO2가 아니라 사용자의 착용 상태 변경에 따라 부정확하게 측정된 SpO2일 수 있다. SpO2를 측정하는 장치(예: SpO2 측정 장치)는 PPG 센서의 구조 및 특성에 따라 R-Curve를 생성하기 위한 Calibration 프로세스를 수행해야할 수 있다. 투과형으로 SpO2를 측정하는 기준 SpO2 측정 장치(예: 의료용 SpO2 측정 장치)에서는 클립형으로 사용자 신체의 일부(예: 사용자의 손가락)에 일정한 압력이 가해지고, 사용 자 신체의 일부에 일정한 압력이 가해진 상태에서 측정된 R값과 기준 SpO2(reference SpO2: Ref SpO2)을 사용하 여 Calibration 프로세스가 수행될 수 있다. Continuous 방식에서, 안정적인 착용 상태에서 Calibration 프로세스가 수행된 R-Curve를 사용하여 SpO2가 측정 될 경우, 웨어러블 전자 장치의 사용자의 착용 상태가 불안정하게 될 경우 부정확한 SpO2가 측정될 수 있다. 웨어러블 전자 장치는 특성상 제한된 자원(예를 들어, 비교적 적은 배터리 용량, 비교적 적은 메모리 용량)으로 인해 부정확한 SpO2가 측정될 확률이 높은 상황에서 SpO2 측정하는 SpO2 측정 모드로 동작하는 것은 바람직하지 않을 수 있다. 예를 들어, 웨어러블 전자 장치에 수직 방향으로 압력이 가해질 경우 PPG 센서를 통해 광이 조사 되는 피부 및 세포의 밀도가 변경되고, 따라서 PPG 센서를 통해 획득되는 R값이 변경될 수 있다. 이렇게 변경된 R 값을 안정적인 착용 상태에서 Calibration 프로세스가 수행되어 생성된 R-Curve에 적용하여 SpO2가 측정될 경 우 부정확한 SpO2가 측정될 수 있다. 이하, 생체 정보(예: SpO2)를 제공하는 전자 장치(예: 웨어러블 전자 장치) 및 그 동작 방법의 실시 예들을 도 면들을 참고하여 자세히 설명하도록 한다. 다양한 실시 예들은 사용자의 다수의 착용 상태들에 매핑되는 다수의 R-Curve들을 미리 생성하고, 다수의 R- Curve들 중 사용자의 착용 상태에 상응하는 R-Curve를 선택하고, 선택된 R-Curve에 상응하게 SpO2를 측정하는 장치 및 방법을 제안한다. 일 실시 예에서, R-Curve는 R 값과 SpO2의 페어들을 포함하는 그룹으로 정의될 수 있 다. 일 실시 예에서는, R-Curve를 일 예로 하여 R 값과 SpO2간의 상관 관계를 정의하였으나, R-Curve 형태 뿐만 아니라 테이블 형태로 R 값과 SpO2의 페어들을 포함할 수도 있다. 일 실시 예에서, 다수의 R-Curve들은 필요에 따라 업데이트될 수 있다. 일 실시 예에서, 다수의 R-Curve들 각각에는 고유한 식별자(identifier: ID)(또는 인 덱스(index))가 할당될 수 있다. 일 실시 예에서, 다수의 테이블들 각각에는 고유한 ID(또는 인덱스)가 할당될 수 있다. 다양한 실시 예들에서, 착용 상태는 웨어러블 전자 장치가 사용자 신체의 일부(예: 사용자의 손목)에 착용된 상 태를 나타낼 수 있다. 일 실시 예에서, 착용 상태는 웨어러블 전자 장치가 사용자 신체의 일부에 어떤 압력으로 접촉되는지, 또는 얼마나 넓은 면적으로 접촉되는지, 또는 어떤 방향으로 접촉되는지, 또는 얼마나 고르게 접촉 되는지를 나타낼 수 있다. 일 실시 예에서, 착용 상태는 웨어러블 전자 장치에 포함되어 있는, 적어도 하나의 센서를 포함하는 센서 모듈을 통해 획득되는 적어도 하나의 착용 상태 신호에 기반하여 식별될 수 있으며, 착용 상태를 나타내는 정보를 착용 상태 정보라 칭하기로 한다. 착용 상태 정보는 적어도 하나의 정보 엘리먼트 (information element)를 포함할 수 있으며, 적어도 하나의 정보 엘리먼트 각각은 착용 상태 신호에 상응하는 착용 상태를 나타낼 수 있다. 예를 들어, 착용 상태 정보가 3개의 정보 엘리먼트들을 포함할 경우, 3개의 정보 엘리먼트들은 웨어러블 전자 장치와 사용자 신체의 일부 간에 주어지는 압력, 웨어러블 전자 장치가 사용자 신 체의 일부에 접촉되는 면적의 크기, 웨어러블 전자 장치가 사용자 신체의 일부에 접촉되는 방향을 포함할 수 있 다. 다양한 실시 예들에서, 웨어러블 전자 장치는 사용자의 다양한 생체 신호들을 측정할 수 있는 적어도 하나의 센 서를 포함하는 센서 모듈을 포함하고, 센서 모듈을 통해 획득된 생체 신호들에 기반하여 적어도 한 종류 이상의 생체 정보를 제공할 수 있다. 일 실시 예에서, 광학적인 방식에 기반하여 획득되는 생체 신호는 PPG 신호일 수 있고, 전기적인 방식에 기반하여 획득되는 생체 신호는 ECG 신호일 수 있다. 일 실시 예에서, PPG 신호에 기반 하는 생체 정보는 HR, 체압, 스트레스 정보(예: 스트레스 지수), 수면 상태에 대한 정보, 또는 SpO2 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, ECG 신호에 기반하는 생체 정보는 심방 세동 정보를 포함할 수 있다. 도 6은 다양한 실시 예들에 따른 전자 장치의 블록도의 일 예이다. 도 6을 참조하면, 전자 장치(예: 도 1a의 전자 장치 또는 도 1b 내지 도 1d의 전자 장치(101b))는 생 체 정보를 제공하는 장치일 수 있으며, 웨어러블 전자 장치(예: 워치(watch))일 수 있다. 일 실시 예에서, 생체 정보는 SpO2일 수 있다. 도 6을 참조하면, 전자 장치(예: 도 1a의 전자 장치 또는 도 1b 내지 도 1d의 전자 장치(101b))는 센 서 모듈(예: 도 1a의 센서 모듈 또는 도 1b의 센서 모듈), 프로세서(예: 도 1a의 프로세 서), 메모리(예: 도 1a의 메모리), 디스플레이(예: 도 1a의 디스플레이 모듈, 또는 도 1b 또는 도 1d의 디스플레이(120a)), 및 통신 회로(예: 도 1a의 통신 모듈)를 포함할 수 있다. 센서 모듈은 적어도 하나의 센서를 포함할 수 있으며, 적어도 하나의 센서를 통해 적어도 하나의 생체 신 호를 획득할 수 있다. 일 실시 예에서, 적어도 하나의 센서는 ECG 센서, PPG 센서, 심박수 측정 센서, 체온 측 정 센서와 같은 생체 센서뿐만 아니라 가속도 센서와 같이 생체 신호를 측정하기 위해 필요로 될 수 있는 다른 센서들도 포함할 수 있으며, 다수의 센서들의 타입들은 이에 한정되지 않을 수 있다. 일 실시 예에서, 적어도 하나의 센서는 가속도 센서, 자이로 센서, 또는 압력 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, PPG 센서는 발광부 및 수광부를 포함할 수 있으며, 발광부는 RED 광(예: 약 650nm의 파장을 가 지는 가시 광선)을 발생하는 RED LED 및 IR 광(예: 약 950nm의 파장을 가지는 적외선)을 발생하는 IR LED를 포 함할 수 있다. PPG 센서는 발광부를 통해 RED 광 및 IR 광을 사용자 신체의 일부(예: 사용자의 손목)에 조사하 고, 이렇게 조사된 RED 광 및 IR 광 중 일부가 사용자 신체의 일부로부터 반사되는 신호를 수광부를 통해 수광 하여 PPG 신호를 획득함으로써, 생체 내지는 생체 내부에 흐르는 혈류의 특징에 기반하여 다양한 생체 상태를 추정하는 센서일 수 있다. 일 실시 예에 따르면, PPG 센서를 이용할 경우 심박수를 비롯한 심박수에 기반한 다 양한 생체 정보를 획득할 수 있다. 예를 들어, PPG 센서는 다양한 파장들의 광들을 발생시키고 수신할 수 있어, SpO2를 측정하는데 사용될 수 있다. 일 실시 예에 따르면, 센서 모듈이 다수의 센서들을 포함할 경우, ECG 신호가 측정될 때, 가속도, SpO2도 함께 측정될 수 있다. ECG 신호 및 PPG 신호에 기반하여 혈압이 측정될 수 있으며, 예를 들어, 가속도와 SpO2에 기반하여 수면 무호흡 증상이 측정될 수 있다. 예를 들어, 가속도 센서로부터 획득되는 가속도 값에 기반하여 사용자가 호흡할 경우 사용자 흉부의 높낮이 변화 및 사용자의 뒤척임을 식별할 수 있으며, PPG 센서를 통해 획 득되는 PPG 신호에 기반하여 측정된 SpO2에 기반하여 수면 무호흡 상태를 식별할 수 있다. 일 실시 예에 따르면, 센서 모듈은 발광부 및 수광부를 포함할 수 있으며, 발광부 및 수광부를 포함하는 센서를 PPG 센서라고 칭할 수 있다. 일 실시 예에 따르면, 센서 모듈은 발광부를 통해 특정 파장 대역의 광을 사용자 신체의 일부에 조사할 수 있다. 일 실시 예에 따르면, 발광부는 일정한 세기의 광을 사용자 신체의 일부에 조사할 수 있으며, 측정 목적이나 분석하고자 하는 대상 성분의 종류에 따라 조사되는 광의 파장은 달라 질 수 있다. 일 실시 예에 따르면, 발광부는 LED, 레이저 다이오드(laser diode: LD) 중 적어도 하나를 포함할 수 있다. 예를 들어, 발광부는 동잡음(motion artifact)의 영향을 줄이기 위한 녹색(GREEN) 광이나 RED 광, 블 루(BLUE) 광, 또는 IR 광과 같은 다양한 파장들을 가지는 대역들을 사용할 수 있으며, 다수의 파장들을 동시에 온시키거나, 또는 다수의 파장들을 교차하여 온 시키는 방식으로도 발광할 수 있다. 센서 모듈은 조사된 광에 대응하여 사용자 신체의 일부로부터 반사 또는 투과된 광을 수광부를 통해 검출 할 수 있다. 센서 모듈은 수광부를 통해 사용자 신체의 일부로부터 반사되는 광에 대응하는 생체 신호를 출력할 수 있다. 일 실시 예에 따르면, 센서 모듈의 수광부는 반사되는 광을 수신하여, 광을 변환한 전기적인 신호를 이용 하여 적어도 하나의 생체 신호를 생성할 수 있는데, 이는 PPG 신호일 수 있다. 일 실시 예에 따르면, 수광부는 포토다이오드(photodiode: PD), 포토 트랜지스터(photo transistor) 또는 전하 결합 소자(charge-coupled device: CCD)를 포함할 수 있으며, 광 신호를 전기적 신호로 바꿀 수 있는 소자이면 소자의 타입은 이에 한정되 지 않을 수 있다. 일 실시 예에 따르면, 수광부의 구조는 반사형 구조 또는 투과형 구조일 수 있다. 일 실시 예에 따르면, 센서 모듈은 측정된 PPG 신호에 상응하는 전류를 수신할 수 있는데, 측정된 PPG 신 호를 디지털 신호로 변환하여 프로세서로 전달할 수 있다. 일 실시 예에 따르면, 센서 모듈는 PPG 신 호를 처리하기 위한 전류-전압 변환을 수행할 수 있으며, 프로세서로 전달하기 전에 출력되는 아날로그 전 압 신호를 디지털화하여 프로세서로 전달할 수 있다. 프로세서는 센서 모듈로부터의 생체 신호를 기반으로 생체 정보를 생성 및 제공할 수 있다. 일 실시 예에 따르면, 프로세서는 센서 모듈과 작동적으로 연결될 수 있으며, 센서 모듈의 발광부를 통 해 사용자 신체의 일부에 광을 조사하도록 제어할 수 있다. 일 실시 예에 따르면, 프로세서는 센서 모듈로부터 제공되는 생체 신호를 기반으로 사용자의 건강 상 태를 검출하거나 예측 또는 분석할 수 있다. 일 실시 예에 따르면, 프로세서는 센서 모듈에서 제공되 는 생체 신호에 기반하여 적어도 하나의 생체 정보를 제공할 수 있다. 일 실시 예에서, 센서 모듈에서 제 공되는 생체 신호는 PPG 신호일 수 있으며, PPG 신호에 기반하는 생체 정보는 HR, 체압, 스트레스 정보(예: 스 트레스 지수), 수면 상태에 대한 정보 및/또는 SpO2 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 프로세 서는 다수의 착용 상태들에 매핑되는 다수의 R-Curve들 중 전자 장치의 착용 상태에 상응하는 R- Curve를 선택하고, 선택된 R-Curve를 사용하여 SpO2가 측정되도록 제어할 수 있다. 다양한 실시 예에 따르면, 메모리는 전자 장치의 데이터(예: 생체 정보)를 저장할 수 있다. 일 실시 예에서, 메모리는 SpO2 측정을 위해 사용되는 적어도 하나의 R-Curve를 저장할 수 있다. 일 실시 예에서, 메모리는 사용자의 다수의 착용 상태들에 매핑되는 다수의 R-Curve들을 저장할 수 있다. 일 실시 예에서, R-Curve는 R 값과 SpO2의 페어들을 포함하는 그룹으로 정의될 수 있다. 일 실시 예에서는, R-Curve를 일 예로 하여 R 값과 SpO2간의 상관 관계를 정의하였으나, R-Curve 형태 뿐만 아니라 테이블 형태로 R 값과 SpO2의 페어들을 포함할 수도 있다. 일 실시 예에서, 다수의 R-Curve들은 필요에 따라 업데이트될 수 있다. 일 실시 예에서, 다수의 R-Curve들 각각에는 고유한 ID가 부여될 수 있다. 일 예로, 고유한 ID는 R-Curve인덱스 또는 테 이블 인덱스가 될 수 있다. 다양한 실시 예에 따르면, 디스플레이는 프로세서로부터 적어도 하나의 생체 정보를 전달받아 시각적 으로 표시할 수 있다. 예를 들어, 디스플레이는 생체 신호 측정을 위한 어플리케이션(예: 심전도 어플리케 이션, 건강 관리 어플리케이션) 실행 시 측정된 생체 신호를 기반으로 한 사용자 인터페이스를 표시할 수 있다. 또한 디스플레이는 프로세서의 제어 하에 생체 신호 측정 시 가이드 화면 또는 이상 상태에 대한 정 보를 출력할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 통신 회로를 통해 외부 전자 장치(예: 도 1a의 전자 장치 , 전자 장치, 또는 서버)와 통신할 수 있다. 도 7은 다양한 실시 예들에 따른 전자 장치의 소프트웨어 계층 구조를 도시한 블록도이다. 도 7을 참조하면, 전자 장치(도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 또는 도 6의 전자 장치)는 생체 정보를 제공하는 장치일 수 있으며, 웨어러블 전자 장치일 수 있다. 일 실시 예에서, 생체 정보는 SpO2일 수 있다. 전자 장치는 프로세서(예: 어플리케이션 프로세서(application processor: AP) 및/또는 센서 허브 프로세 서(sensor hub processor))(예: 도 1a의 프로세서 또는 도 6의 프로세서)와 센서 모듈(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 또는 도 6의 센서 모듈)을 포함할 수 있다. 프로세서는 어플리케이션(application)(예: 도 1a의 어플리케이션)과 운영 시스템(operating system: OS)(예: 도 1a의 운영 체제)를 실행하며, 센서 모듈에서 데이터(예: 생체 신호)를 수신하고, 센서 모듈을 제어하기 위한 제어 신호를 송신할 수 있다. 프로세서는 저전력 동작을 위해 별도의 보 조 프로세서(예: 도 1a의 보조 프로세서, 마이크로 컨트롤러(micro controller unit: MCU), 센서 허브 프 로세서)를 포함할 수 있다. 마이크로 컨트롤러는 센서 모듈을 제어하고, 센서 모듈로부터 수신한 데 이터를 지정된 방법(예: 노이즈 필터링)으로 처리하여 메인 프로세서(예: AP)로 전달할 수 있다. 또는, 메인 프로세서(예: 도 1a의 메인 프로세서, AP)가 센서 모듈을 제어하고, 센서 모듈로부터 수신한 데 이터를 처리할 수도 있다. 센서 모듈은 적어도 하나의 센서를 포함할 수 있다. 일 실시 예에서, 센서 모듈은 적어도 하나의 센 서(예: PPG 센서)를 적어도 하나의 생체 신호를획득할 수 있다. 일 실시 예에서, 생체 신호는 PPG 신호일 수 있 다. 일 실시 예에서, 센서 모듈은 적어도 하나의 센서(예: 가속도 센서, 각속도 센서, 모션 센서)를 통해 전자 장치의 움직임과 관련되는 신호를 획득할 수 있다. 일 실시 예에서, 센서 모듈은 적어도 하나의 센서(예: 압력 센서, ECG 센서, PPG 센서)를 통해 전자 장치의 착용 상태와 관련되는 신호를 획득할 수 있 다. 본 개시의 다양한 실시 예들에 따르면, 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)는 적어도 하나의 센서(예: 도 1a의 센서 모 듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈), 및 상기 적어도 하 나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모 듈)와 작동적으로 연결된 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로세서), 또 는 도 7의 프로세서)를 포함할 수 있고, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로세서), 또는 도 7의 프로세서)는, 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b 의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장 치)의 움직임의 변화량이임계 범위 내에 존재할 경우, 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈 , 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 착용 상태를 식별하고, 광용적맥파(photoplethysmogram: PPG) 신호들에 기반하는 기 준 값들에 상응하는 산소 포화도(saturation of percutaneous oxygen: SpO2)들을 포함하는 제1 그룹 및 상기 기준 값들에 상응하는 다른 SpO2들을 포함하는 제2 그룹을 포함하는 다수의 그룹들 중 상기 착용 상태에 상응하 는 그룹을 선택하고, 및 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6 의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 제1 PPG 신호를 획득하고, 상기 제1 PPG 신호에 기반하는 제1 기준 값과 상기 선택된 그룹을 사용하여 제1 SpO2를 획득하도록 구성될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로 세서), 또는 도 7의 프로세서)는, 상기 식별된 착용 상태에 상응하는 착용 상태 정보와 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보들 각각 간의 유사도를 식별하고, 및 상기 식별된 유사도들 중 최대값을 가지는 착용 상태 정보에 매핑되어 있는 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하도록 구성될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 착용 상태 정보는 사용자 신체에 의해 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 가 해지는 압력, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에서 상기 사용자 신체에 의해 접촉되는 면적의 크기, 또는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)가 상기 사용자 신체에 접촉되는 방향 중 적어도 하나를 정보 엘리먼트(element)들로서 포함할 수 있으며, 및 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로세서), 또는 도 7의 프로세서)는, 상기 식별된 착용 상태에 상응하는 착용 상태 정보에 포함되어 있는 정보 엘리먼트들과 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보들 각각에 포함되어 있는 정보 엘리먼트들간의 유사도들을 식별 하고, 상기 다수의 그룹들 각각에 대해, 상기 식별된 정보 엘리먼트들에 대한 유사도들 각각에 정보 엘리먼트 별로 설정되어 있는 가중치를 적용하고, 및 상기 다수의 그룹들 중 상기 가중치가 적용된 유사도들의 합이 최대 값인 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하도록 구성될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 가중치가 적용된 유사도들의 합들 중 최대값은 설정되어 있는 최소 유사도 이상일 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 움직임은 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 착용 상태는 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈 , 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG) 신호, 또는 압력 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로 세서), 또는 도 7의 프로세서)는 상기 착용 상태가, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에서 사용자 신체에 의 해 접촉되는 면적의 크기가 임계 면적 이상인 착용 상태일 경우, 상기 제1 그룹을 선택하고, 상기 제1 기준 값 과 상기 제1 그룹을 사용하여 상기 제1 SpO2를 획득하고, 및 상기 착용 상태가 제2 측정 방식에서 사용되는 단 일 그룹이 생성될 때 적용되는 착용 상태일 경우, 상기 제2 그룹을 선택하고, 상기 제1 기준 값과 상기 제2 그 룹을 사용하여 상기 제1 SpO2를 획득하도록 구성되며, 상기 제2 측정 방식은 상기 다수의 그룹들이 사용되는 제 1 측정 방식과는 다를 수 있다. 본 개시의 다양한 실시 예들에 따르면, 통신 회로(예: 도 1 a의 통신 모듈 또는 도 6의 통신 회로)를 더 포함하며, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로세서), 또는 도 7의 프로세서)는 상기 제1 SpO2를 획득한 후, 측정 방식을 상기 다수의 그룹들이 사용되는 제1 측정 방식에서 단일 그룹이 사용되는 제2측정 방식으로 전환하고, 상기 제2 측정 방식에서, 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 제2 PPG 신호를 획득하고, 상기 제2 PPG 신호에 기반하는 제2 기준 값과 상기 단일 그룹을 사용하여 제2 SpO2를 획득하고, 상기 통신 회로(예: 도 1 a의 통신 모듈 또는 도 6의 통신 회로)를 통해, 상기 제1 SpO2, 상기 제1 기준 값, 상기 선택된 그룹의 식별자, 상기 제2 SpO2중 적어도 하나를 외부 전자 장치 서버(예: 도 1a 의 서버 또는 도 18의 서버)로 송신하여 상기 선택된 그룹을 업데이트하도록 더 구성될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 선택된 그룹에 포함되어 있는 상기 제1 기준 값을 상기 제2 SpO2에 상응하는 상기 제2 기준 값으로 변경함으로써 상기 선택된 그룹이 업데이트될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로 세서), 또는 도 7의 프로세서)는 조건이 만족될 경우, 상기 제1 측정 방식에서 상기 제2 측정 방식으로 전환하도록 구성될 수 있으며, 및 상기 조건은 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b 의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장 치)의 움직임의 변화량이 제1 임계 범위 내에 존재하는 조건, 상기 제1 SpO2를 측정 완료한 시점 이후 설 정 시간이 완료되는 조건, 또는 상기 제1 측정 방식에서 측정되는 SpO2들의 변화량이 제2 임계 범위 내에 존재 하는 조건 중 적어도 하나를 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 움직임은 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로 세서), 또는 도 7의 프로세서)는, 상기 식별된 착용 상태에 상응하는 착용 상태 정보와 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보들 각각 간의 유사도를 식별하고, 및 상기 식별된 유사도들 중 최대값을 가지는 착용 상태 정보에 매핑되어 있는 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하도록 구성될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 착용 상태 정보는 사용자 신체에 의해 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 가 해지는 압력, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에서 상기 사용자 신체에 의해 접촉되는 면적의 크기, 또는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)가 상기 사용자 신체에 접촉되는 방향 중 적어도 하나를 정보 엘리먼트(element)들로서 포함할 수 있으며, 및 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로세서), 또는 도 7의 프로세서)는, 상기 식별된 착용 상태에 상응하는 착용 상태 정보에 포함되어 있는 정보 엘리먼트들과 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보들 각각에 포함되어 있는 정보 엘리먼트들간의 유사도들을 식별 하고, 상기 다수의 그룹들 각각에 대해, 상기 식별된 정보 엘리먼트들에 대한 유사도들 각각에 정보 엘리먼트 별로 설정되어 있는 가중치를 적용하고, 및 상기 다수의 그룹들 중 상기 가중치가 적용된 유사도들의 합이 최대 값인 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하도록 구성될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 가중치가 적용된 유사도들의 합들 중 최대값은 설정되어 있는 최소 유사도 이상일 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로 세서), 또는 도 7의 프로세서)는, 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센 서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치 )의 움직임의 변화량이 임계 범위 내에 존재함을 식별할 경우, 상기 제1 측정 방식에서 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 대한 착용 상태를 식별하도록 구성될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 움직임은 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 착용 상태는 상기 적어도 하나의 센서(예: 도 1a의 센서 모듈 , 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG) 신호, 또는 압력 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로 세서), 또는 도 7의 프로세서)는, 상기 통신 회로(예: 도 1 a의 통신 모듈 또는 도 6의 통신 회 로)를 통해, 상기 외부 전자 장치(예: 도 1a의 서버 또는 도 18의 서버)로부터 업데이트된 그 룹의 식별자 및 상기 업데이트된 그룹을 수신하도록 더 구성되며, 및 상기 업데이트된 그룹은 상기 제1 SpO2와 상기 제2 SpO2간의 차이가 임계 값 이하일 경우, 상기 선택된 그룹에 포함되어 있는 상기 제1 기준 값을 상기 제2 SpO2에 상응하는 상기 제2 기준 값으로 변경함으로써 업데이트될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 1a의 프로세서, 도 6의 프로 세서), 또는 도 7의 프로세서)는 상기 착용 상태가 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에서 사용자 신체에 의 해 접촉되는 면적의 크기가 임계 면적 이상인 착용 상태일 경우, 상기 제1 그룹을 선택하고, 상기 제1 기준 값 과 상기 제1 그룹을 사용하여 상기 제1 SpO2를 획득하고, 및 상기 착용 상태가 제2 측정 방식에서 사용되는 단 일 그룹이 생성될 때 적용되는 착용 상태일 경우, 상기 제2 그룹을 선택하고, 상기 제1 기준 값과 상기 제2 그 룹을 사용하여 상기 제1 SpO2를 획득하도록 구성되며, 기 제2 측정 방식은 상기 다수의 그룹들이 사용되는 제1 측정 방식과는 다를 수 있다. 본 개시의 다양한 실시 예들에 따르면, 외부 전자 장치(예: 도 1a의 서버 또는 도 18의 서버)는 통 신 회로(예: 도 18의 통신 회로), 및 상기 통신 회로(예: 도 18의 통신 회로)와 작동적으로 연결된 적어도 하나의 프로세서(예: 도 18의 프로세서)를 포함할 수 있고, 상기 적어도 하나의 프로세서(예: 도 18의 프로세서)는, 상기 통신 회로(예: 도 18의 통신 회로)를 통해, 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)로부터 광용적맥파(photoplethysmogram: PPG) 신호들에 기반하는 기준 값들에 상응하는 산소 포화도(saturation of percutaneous oxygen: SpO2)들을 포함하는 제1 그룹 및 상기 기준 값들에 상응하는 다른 SpO2들을 포함하는 제2 그룹을 포함하는 다수의 그룹들이 사용되는 제1 측정 방식에서 획득된 제1 SpO2, 상기 제1 SpO2에 상응하는 제1 기준 값, 상기 다수의 그룹들 중 상기 제1 SpO2를 획득하는데 사용된 그룹의 식별자, 단일 그룹이 사용되는 제2 측정 방식에서 측정된 제2 SpO2를 수신하고, 상기 제1 SpO2와 상기 제2 SpO2 간의 차이가 임계 값 이하일 경우, 상기 식별자에 매핑되는 그룹에 포함되어 있는 상기 제1 기준 값을 상기 단일 그룹에서 상기 제2 SpO2에 상응하 는 제2 기준 값으로 변경하여 상기 식별자에 매핑되는 그룹을 업데이트하고, 및 상기 통신 회로(예: 도 18의 통 신 회로)를 통해, 상기 식별자 및 상기 업데이트된 그룹을 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)로 송신하도록 구성 될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 제1 SpO2를 획득하는데 사용된 그룹은 상기 다수의 그룹들 중 상기 제1 측정 방식에서 식별된 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 착용 상태에 상응하는 착용 상태 정보에 매핑되어 있는 그룹일 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 착용 상태는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나 의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈 )를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG) 신호, 또는 압력 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 측정 방식은 조건이 만족될 경우, 상기 제 1 측정 방식에서 상기 제2 측정 방식으로 전환되며, 및 상기 조건은 상기 전자 장치(예: 도 1a의 전자 장치 , 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 움직임 의 변화량이 제1 임계 범위 내에 존재하는 조건, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)가 상기 제1 SpO2를 측정 완료한 시점 이후 설정 시간이 완료되는 조건, 또는 상기 제1 측정 방식에서 측정되는 SpO2들의 변화량이 제2 임계 범 위 내에 존재하는 조건 중 적어도 하나를 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 움직임은 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나의 센 서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈 )를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 18의 프로세서)는, 상기 제1 SpO2와 상기 제2 SpO2간의 차이가 상기 임계 값을 초과할 경우, 상기 통신 회로(예: 도 18의 통신 회로) 를 통해 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치 , 또는 도 7의 전자 장치)로 그룹 업데이트가 수행되지 않음을 나타내는 메시지를 송신하도록 더 구성될 수 있다. 도 8은 다양한 실시 예들에 따른 전자 장치의 동작 과정의 일 예를 개략적으로 도시한 흐름도이다. 도 8을 참조하면, 동작 811에서 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 프로세서(예: 도 1a의 프로세서, 도 6의 프로세서 ), 또는 도 7의 프로세서)는 Continuous SpO2 측정 모드가 온 되어 있는지를(예: 온(on) 상태에 있 는지 여부를) 확인할 수 있다. 일 실시 예에서, 사용자 입력에 기반하여 Continuous SpO2 측정 모드가 온 될 수 있다. 일 실시 예에서, Continuous SpO2 측정 모드는 지정된 시간(예: Continuous SpO2 측정 모드가 온 되도록 사용자에 의해 설정된 시간)에 온 될 수 있다. 일 실시 예에서, Continuous SpO2 측정 모드는 설정된 프로그램 에 포함되어 있는 Continuous SpO2 측정 모드를 나타내는 플래그(flag)의 값이 설정된 값, 예를 들어 \"1\"로 설 정될 경우 온 될 수 있다. 일 실시 예에서, Continuous SpO2 측정 모드는 적어도 하나의 명령어에 의해 호출될 경우 온 될 수 있다. 일 실시 예에 따르면, Continuous SpO2 측정 모드는 다양한 형태들로 온될 수 있으며, 플 래그 또는 명령어에 의해 온 되는 경우로 제한되는 것은 아니다.On-demand SpO2 측정 모드는 단일(single) R- Curve를 사용하는 SpO2 측정 모드일 수 있다. 일 실시 예에서, On-demand SpO2 측정 모드는 On-demand 방식에 기반하는 SpO2 측정 모드일 수 있다. On-demand SpO2 측정 모드에서 사용되는 R-Curve는 기준 SpO2 측정 장치에 서 Calibration 프로세스를 통해 생성된 R-Curve일 수 있다. Continuous SpO2 측정 모드는 다수의 R-Curve들을 사용하는 SpO2 측정 모드일 수 있다. 일 실시 예에서, Continuous SpO2 측정 모드는 Continuous 방식에 기반하 는 SpO2 측정 모드일 수 있다. Continuous SpO2 측정 모드에서 사용되는 다수의 R-Curve들은 기준 SpO2 측정 장치에서 Calibration 프로세스를 통해 생성된 R-Curve들일 수 있다. 일 실시 예에서, 다수의 R-Curve들 각각에 는 착용 상태 정보가 매핑될 수 있으며, 다수의 R-Curve들에 매핑되는 착용 상태 정보는 서로 다를 수 있다. 일 실시 예에서, 착용 상태 정보는 착용 상태를 나타내는 정보이며, 착용 상태는 전자 장치가 사용자 신체의 일 부에 어떤 형태로 착용되어 있는지를 나타내는 상태일 수 있다. 일 실시 예에 따르면, 착용 상태는 전자 장치 가 사용자 신체의 일부에 착용되는 것 자체를 나타내는 것이 아니라 전자 장치가 사용자 신체의 일부에 어떤 형 태로 착용되어 있는지를 나타내는 상태일 수 있다. 예를 들어, 착용 상태는 전자 장치가 사용자 신체의 일부(예: 손목)에 의해 비교적 크게 눌린 상태, 전자 장치 가 사용자 신체의 일부로부터 비교적 크게 들떠 있는 상태와 같이 전자 장치가 사용자 신체의 일부에 어떤 형태 로 착용되어 있는지를 나타낼 수 있다. 예를 들어, 전자 장치가 사용자 신체의 일부에 의해 비교적 크게 눌린 상태는 전자 장치가 사용자 신체의 일부에 접촉한 면적 전체가 비교적 크게 눌린 상태 또는 전자 장치가 사용자 신체의 일부에 접촉한 면적 중 일부가 비교적 크게 눌린 상태를 나타낼 수 있다. 일 실시 예에 따르면, 다수의 R-Curve들에 매핑되는 착용 상태 정보는 Continuous SpO2 측정 모드에서 Spo2 측 정이 불가능한 착용 상태(예: 유효한 Spo2를 획득하지 못하는 착용 상태)를 제외한 어떤 착용 상태에라도 상응 할 수 있다. 예를 들어, Spo2 측정이 불가능한 착용 상태는 R값을 획득하는데 사용되는 최소 SNR이 확보되는 것 이 불가능한 착용 상태(예: 전자 장치가 사용자 신체의 일부로부터 비교적 크게 들떠 있음으로 인해 PPG 센서의 수광부를 통해 비교적 많은 외부 광이 수광될 경우)를 나타낼 수 있다. 일 실시 예에 따르면, 착용 상태는 전자 장치에 포함되어 있는, 적어도 하나의 센서를 포함하는 센서 모듈(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)을 통 해 획득되는 적어도 하나의 착용 상태 신호에 기반하여 식별될 수 있다. 착용 상태 정보는 적어도 하나의 정보 엘리먼트를 포함할 수 있으며, 적어도 하나의 정보 엘리먼트 각각은 착용 상태 신호에 상응하는 착용 상태를 나타낼 수 있다. 예를 들어, 착용 상태 정보가 3개의 정보 엘리먼트들을 포 함할 경우, 3개의 정보 엘리먼트들은 전자 장치와 사용자 신체의 일부 간에 주어지는 압력(예: 사용자 신체에 의해 전자 장치에 가해지는 압력), 전자 장치가 사용자 신체의 일부에 접촉되는 면적의 크기(예: 전자 장치에서 사용자 신체에 의해 접촉되는 면적의 크기), 전자 장치가 사용자 신체의 일부에 접촉되는 방향을 포함할 수 있 다. 일 실시 예에서, 전자 장치와 사용자 신체의 일부 간에 주어지는 압력은 센서 모듈에 포함되어 있는 압력 센서 및/또는 PPG 센서를 통해 획득될 수 있으며, 이 경우 착용 상태 신호는 압력 신호일 수 있다. 일 실시 예에서, 전자 장치가 사용자 신체의 일부에 접촉되는 면적의 크기는 센서 모듈에 포함되어 있는 PPG 센서를 통해 획득될 수 있으며, 이 경우 착용 상태 신호는 PPG 신호 일 수 있다. 일 실시 예에서, 전자 장치가 사용자 신체의 일부 에 접촉되는 방향은 ECG 센서를 통해 획득될 수 있으며, 이 경우 착용 상태 신호는 ECG 신호 일 수 있다. 동작 811에서 확인 결과 Continuous SpO2 측정 모드가 온 되어 있지 않을 경우, 프로세서는 Continuous SpO2 측정 모드가 온 되어 있음이 확인될 때까지 동작 811을 반복할 수 있다. 동작 811에서 확인 결과 Continuous SpO2 측정 모드가 온 되어 있을 경우, 동작 813에서 프로세서는 센서 모듈을 통해 획득된 움직임 신호의 적어도 일부에 기반하여 전자 장치의 움직임이 안정 상태를 나타내는지 여부를 확인할 수 있다. 일 실시 예에서, 움직 임 신호는 전자 장치에 포함되어 있는 가속도 센서를 통해 획득되는 가속도 신호 및/또는 전자 장치에 포함되어 있는 자이로 센서를 통해 획득되는 각속도 신호를 포함할 수 있다. 일 실시 예에서, 안정 상태는 움직임이 설정 조건을 만족하는 상태를 나타낼 수 있다. 일 실시 예에서 설정 조 건은 움직임의 변화량이 임계 범위 내에 존재하는 조건을 포함할 수 있다. 일 실시 예에서, 움직임은 가속도 신 호 또는 각속도 신호 중 적어도 하나에 기반하여 식별될 수 있다. 일 실시 예에서, 설정 조건은 가속도의 임계 값 또는 임계 변화량 중 적어도 하나에 기반하는 조건을 포함할 수 있다. 일 예로, 설정 조건이 가속도의 임계 값을 기반으로 하는 조건일 경우, 설정 조건은 가속도 신호의 DC 절대 값이 임계값 미만인 조건이 될 수 있다. 다른 예로, 설정 조건이 가속도의 임계 변화량을 기반으로 하는 조건일 경우, 설정 조건은 가속도 신호의 DC 값 의 변화량이 임계 변화량 미만인 조건이 될 수 있다. 다른 실시 예에서, 설정 조건은 각속도의 임계값 또는 임 계 변화량 중 적어도 하나에 기반하는 조건을 포함할 수 있다. 일 예로, 설정 조건이 각속도의 임계값을 기반으 로 하는 조건일 경우, 설정 조건은 각속도 신호의 DC 절대 값이 임계값 미만인 조건이 될 수 있다. 다른 예로, 일 예로, 설정 조건이 각속도의 임계 변화량을 기반으로 하는 조건일 경우, 설정 조건은 각속도 신호의 DC 값의 변화량이 임계 변화량 미만인 조건이 될 수 있다. 일 실시 예에서, 설정 조건은 가속도의 임계값과 기간(duration)의 임계값을 기반으로 하는 조건을 더 포함할 수 있다. 설정 조건이 가속도의 임계값을 포함하는 경우 및 기간의 임계값을 더 포함하는 경우, 하기 표 2와 같 이 안정 상태를 결정하는 실시 예가 가능할 수 있다. <표 2>"}
{"patent_id": "10-2021-0165173", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "표 2에서, ACC_X는 가속도 신호의 X 성분을 나타내며, ACC_Y는 가속도 신호의 Y 성분을 나타내며, ACC_Z는 가속 도 신호의 Z성분을 나타낼 수 있다. 표 2에서 Case 1은 가속도 신호의 DC 절대 값인 이 가속도 임계값(예: ACC 임계값) 이상인 상태로 지속되는 기간이 임계 기간 이상인 경우를 나타내며, 따라서 Case 1은 불안정 상태 를 나타낼 수 있다. 표 2에서 Case 2는 가속도 신호의 DC 절대 값인 이 가속도 임계값 이상인 상태로 지속되는 기간이 임계 기간 미만인 경우를 나타내며, 따라서 Case 2는 안정 상태를 나타낼 수 있다.일 실시 예에서, 설정 조건은 가속도의 임계값을 기반으로 하는 조건을 더 포함할 수 있다. 설정 조건이 가속도의 임계값을 포함하는 경우, 가속도 신호의 DC 절대 값인 이 가속도 임계값 (예: ACC 임계값) 미만인 경우, 사용자 상태는 안정 상태를 나타낼 수 있다. 전자 장치의 움직임이 안정 상태를 나타내는지 여부를 확인할 수 있는 실시 예는 표2에 나타낸 바와 같은 실시 예로 한정되는 것은 아니며, 가속도, 각속도 및/또는 기간 중 적어도 일부를 포함하는 설정 조건에 의해 다양한 형태로 전자 장치의 움직임이 안정 상태를 나타내는지 여부를 확인하는 것이 가능하도록 구현될 수 있다. 일 예 로, 프로세서는 가속도 센서를 통해 획득된 가속도 신호에 기반하여 전자 장치의 사용자의 움직임(예: 수면 중 뒤척임)을 확인할 수 있다. 다른 예로, 프로세서는 자이로 센서를 통해 획득된 각속도 신호에 기반하여 전자 장 치의 사용자의 움직임(예: 수면 중 뒤척임)을 확인할 수 있다. 동작 813에서 전자 장치의 움직임이 안정 상태를 나타낼 경우(동작 813-예), 동작 815에서 프로세서는 센서 모 듈을 통해 획득되는 착용 상태 신호의 적어도 일부에 기반하여 전자 장치의 착용 상태 정보를 식별할 수 있다.착용 상태 신호에 기반하는 착용 상태 정보, 착용 상태에 포함되는 정보 엘리먼트들에 대해서는 동작 811에서 설명한 바와 동일할 수 있다. 일 실시 예에서, 전자 장치와 사용자 신체의 일부 간에 주어지는 압력은 압력 센 서 뿐만 아니라 PPG 센서를 통해서도 획득될 수 있으며, 이 경우 착용 상태 신호는 PPG 신호일 수 있다. 동작 813에서 확인 결과 전자 장치의 움직임이 안정 상태를 나타내지 않을 경우(동작 813-아니오), 프로세서는 동작 811을 반복할 수 있다. 도 8에서는 전자 장치가 전자 장치에 포함되어 있는 센서 모듈을 통해 획득된 움직임 신호의 적어도 일부 및/또 는 착용 상태 신호의 적어도 일부에 기반하여 SpO2를 측정하는 방식에 대해서 설명하였다. 하지만, 전자 장치에 포함되어 있는 센서 모듈 뿐만 아니라, 전자 장치의 외부에 존재하면서, 사용자 신체의 일부에 부착되어 있는 센서 모듈을 통해 획득된 움직임 신호의 적어도 일부 및/또는 착용 상태 신호의 적어도 일부를 전자 장치가 수 신할 수 있을 경우, 전자 장치는 도 8에서 설명한 바와 유사한 방식 또는 동일한 방식으로 수신한 움직임 신호 의 적어도 일부 및/또는 착용 상태 신호의 적어도 일부에 기반하여 SpO2를 측정할 수도 있다. 일 실시 예에서, PPG 센서의 배치 및 구조의 일 예를 도 9 및 도 10을 참조하여 설명하면 다음과 같다. 도 9는 다양한 실시 예들에 따른 PPG 센서의 배치의 일 예를 개략적으로 도시한 도면이다. 도 9를 참조하면, 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 또는 도 7의 전자 장치)의 디스플레이가 시각적으로 노출되는 면을 전면(901a)으로, 그 반대 면을 후면(901b)로 정 의하여 사용한다. 일 실시 예에 따른 전자 장치의 후면(901b)에 광학식 생체 신호 측정을 위한 발광부 및 수광부를 포함하는 PPG 센서가 배치될 수 있는데, 발광부와 실질적으로 동일한 면에 수광부 가 배치될 수 있다. 일 실시 예에서, 전자 장치의 전면(901a)에는 SpO2가 측정 중임을 나타내는 메시 지(예: \"SpO2 Measuring ...\")가 디스플레이를 통해 디스플레이 될 수 있다. 도 9에서는, SpO2가 측정 중임을 나타내는 메시지가 디스플레이되는 경우가 일 예로 도시되어 있으나, 추후 SpO2가 측정이 완료될 경우 측정된 SpO2를 나타내는 메시지가 디스플레이 될 수도 있다. 도 9에 도시된 바와 같이 발광부는 후면(901b)의 가운데에 위치할 수 있으며, 단일 소자로 구성되거나 동 일한 대역의 파장의 빛을 방출하는 다수의 소자들 또는 서로 다른 대역의 파장의 빛을 방출하는 다수의 소자들 을 포함할 수 있다. 발광부가 적어도 하나의 발광 소자(예: LED)를 포함하는 구조 및 수광부가 적어 도 하나의 수광 소자(예: PD)를 포함하는 구조는 도 11에서 설명되는 발광부(예: 발광부) 및 수광부(예: 수광부)의 구조와 유사하게 구현될 수 있으며, 이에 대한 구체적인 설명은 도 11에서 구체적으로 설명될 것이다. 도 9에서는 발광부가 전자 장치의 후면(901b)의 가운데 위치하는 경우를 예시하고 있으나, 발광부와 수광부간의 위치 관계를 고려하여 수광부의 바깥쪽에 배치될 수도 있다. 도 9에서 PPG 센서가 배치되는 후면(901b)은 평면을 이룰 수도 있으며, 사용자 신체의 일부(예: 사용자의 손 목)에 밀착되도록 볼록하게 돔 형상(dome shape)으로도 형성될 수 있다. 도9에는 후면(901b)에 발광부를 에워싸는 8개의 수광부가 포함된 경우가 도시되어 있다. 또한, 도 9에서는 후면(901b)이 평면인 경우 또는 볼록한 경우를 예로 들어 설명하였으나, 그 형태는 이에 한정되지 않을 수 있다. 도 10은 다양한 실시 예들에 따른 PPG 센서의 구조의 일 예를 개략적으로 도시한 도면이다. 도 10을 참조하면, 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 또는 도 7의 전자 장치)의 후면에는 다수의 센서들이 배치되어 있으며, 그 중 하나인 광학 센서인 PPG 센서를 이용하여 PPG 신호(또는 데이터)가 측정될 수 있다. 도 10에는, 전자 장치의 후면 및 전자 장치의 PPG 센서의 수직 절단면의 일 예가 도시되 어 있다. 도 10에 도시된 바와 같이 전자 장치의 PPG 센서의 수광부와 발광부에 따라 격벽으 로 분할된 구조를 가질 수 있으며, 이러한 격벽 구조는 PPG 신호를 측정하기 위한 통로로 이용될 수 있다. 발광부가 적어도 하나의 발광 소자(예: LED)를 포함하는 구조 및 수광부가 적어도 하나의 수 광 소자(예: PD)를 포함하는 구조는 도 11에서 설명되는 발광부(예: 발광부) 및 수광부(예: 수광부 )의 구조와 유사하게 구현될 수 있으며, 이에 대한 구체적인 설명은 도 11에서 구체적으로 설명될 것이다. 다양한 실시 예에 따르면, 전자 장치의 후면에는 PPG 센서 이외에 적어도 하나의 센서가 더 배치될 수 있다. 다양한 실시 예에 따르면, 전자 장치의 후면에는 적어도 하나의 전극이 배치될 수 있다. 적어도 하나의 전극은 필요에 따라 배치되지 않을 수도 있다. 다양한 실시 예에 따르면, 전자 장치의 내부(예: PCB 상)에 발광부(예: 적어도 하나의 LED) 및 수광부(예: 적어도 하나의 PD)가 배치되는데, 전자 장치의 후면의 적어도 일부는 실질적으로 투명한 소재로 형 성될 수 있다. 예를 들어, 후면 중 발광부와 적어도 일부 대응하는 위치 및 수광부와 적어 도 일부 대응하는, 적어도 하나의 위치가 투명한 소재(예: 글래스(glass))로 형성되어 발광부의 일부 및 수광부가 시각적으로 노출되며, 발광 경로 및 수광 경로가 형성될 수 있다. 일 실시 예에 따르면, 후면 은 실질적으로 불투명한 소재(예: 메탈, 플라스틱)로 형성되고, 발광부, 수광부 및/또는 적 어도 하나의 전극에 대응하는 위치에 적어도 하나의 개구부(미도시)를 포함할 수 있다. 예를 들어, 적어 도 하나의 개구부에는 발광부 및 수광부의 일부를 시각적으로 노출 시키는 윈도우 글래스(미도시) 및 적어도 하나의 전극이 끼움 결합될 수 있다. 다른 실시 예에 따르면, 전자 장치의 후면은 전체적으로 투명한 소재로 형성되어 적어도 일부가 불투명하게 처리될 수도 있다. 예를 들어, 발광부에 대응하는 위치 및 수광부에 대응하는 위치를 제외한 나머지 부분은 실질적으로 불투명한 잉크가 도색되어 내부의 부품(예: 회로 기판)이 가려질 수 있다. 일 실시예에 따르면, 발광부 및 수광부로부터 전자 장치의 후면의 외부로 노출된 면까 지 이어지는 측부를 둘러싸는 적어도 하나의 불투명 광학 차폐 구조(또는, 격벽)가 형성될 수 있다. 이러 한 불투명 광학 차폐 구조를 격벽이라고 칭할 수 있으며, 이러한 적어도 하나의 격벽은 발광부에서 나온 빛이 전자 장치의 내부 구조에 의해 회절 또는 반사된 뒤 수광부로 들어가지 않도록 하거나 사용자 의 피부로부터 반사된 광이 수광부로 들어가는 경로에서 누광 현상을 방지할 수 있다.. 다양한 실시 예에 따르면, 전자 장치는 적어도 하나의 전극을 통한 ECG 신호 수신 및/또는 발광부 및 수광부를 통한 PPG 신호 수신을 순차적으로 수행할 수 있다. 다양한 실시 예에 따르면, 생체 신호의 측정이 시작되면, 발광부 가 지정된 방향(예: 전자 장치 착용 시 사용자 신체의 일부 (예: 사용자의 피부를 향하는 방향)으로 발광하고, 발광된 빛이 사용자의 피부 아래의 혈류에 의해 변조될 수 있다. 변조된 빛은 수광부에 수광될 수 있다. 도 11은 다양한 실시 예들에 따른 PPG 센서를 통해 전자 장치에 가해지는 압력을 측정하는 동작의 일 예를 도시 한 도면이다. 도 11을 참조하면, 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 센서 모듈(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)에 포함되어 있는 PPG 센서는 발광부(예: 도 9의 발 광부) 및 수광부(예: 도 9의 수광부)를 포함할 수 있다. 일 실시 예에서, 발광부 및 수 광부 간의 거리 차이에 기반하여 채널(예: PD 채널) 별로 전자 장치에 가해지는 압력을 측정할 수 있다. 일 실시 예에서, PD채널은 PD 채널에 포함되는 PD에 수신되는 광의 신호, 광의 경로 및/또는 광의 세기를 의미 할 수 있다. PD 채널은 적어도 하나의 PD를 포함할 수 있으며, PD 채널에 포함되는 PD들의 개수는 가변적일 수 있다. PPG 센서는 PD 채널 별로 수신되는 광량을 계산할 수 있다. 도 11에서, 발광부는 RED LED, GREEN LED, BLUE LED 및/또는 IR LED 중 적어도 하나를 포함할 수 있으며, IR LED 를 통해 IR 광을 발생시킬 수 있다. 수광부는 PD 채널1에 상응하는 2 개의 PD들, PD 채널2에 상응하는 2 개의 PD들, PD 채널3에 상응하는 2 개의 PD들, 및 PD 채널 4에 상응하는 2 개의 PD들을 포함할 수 있다. 도 11에서는 2개의 PD들이 1개의 PD 채널에 포함되는 경우를 일 예로 하고 있으며, 따라서 각 PD 채널 별로 2개의 PD들이 매핑될 수 있고, 해당 채널에 매핑되는 PD 들에 해당 채널의 채널 번호를 도시하였 다. 도 11에 도시되어 있는 바와 같이 IR LED와 PD 간의 거리에 따라 획득되는 DC 값에 차이가 남을 알 수 있 다. 도 11에서는 IR LED와 PD 채널 1간의 거리(PD1-IR Length)가 IR LED와 PD 채널 2간의 거리 (PD2-IR Length), IR LED와 PD 채널 3의 거리(PD3-IR Length), 및 IR LED와 PD 채널 4간의 거리 (PD4-IR Length)에 비해 가장 긴 것을 알 수 있다. 일 실시 예에서, IR LED와 PD 채널 간의 거리가 짧 을 수록 해당 PD 채널을 통해 획득되는 DC 값이 클 수 있다. 도 11에서는 발광부가 IR LED을 통해 IR 광을 발생시키는 경우를 일 예로 설명하였으나, IR 광이 아닌 다른 광(예: RED 광, GREEN 광, 및/또는 BLUE 광)을 발생시킬 수도 있다. 도 12는 다양한 실시 예들에 따른 PPG 센서를 통해 획득되는 PD 채널 별 IR PPG 신호의 DC 성분 값의 일 예를 도시한 도면이다. 도 12를 참조하면, 도 11에서 설명한 바와 같이 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전 자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 센서 모듈(예: 도 1a의 센서 모듈 , 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)에 포함되어 있는 PPG 센서는 발광부(예: 도 9의 발광부 또는 도 11의 발광부) 및 수광부(예: 도 9의 수광부 또는 도 11의 수광부)를 포함할 수 있다. 발광부는 RED LED, GREEN LED, BLUE LED 및/또는 IR LED (예: 도 11 의 IR LED ) 중 적어도 하나를 포함할 수 있으며, IR LED 를 통해 IR 광을 발생시킬 수 있다. 수광부는 PD 채널 1에 상응하는 2 개의 PD들, PD 채널 2에 상응하는 2 개의 PD들, PD 채널 3에 상응하는 2 개의 PD들, 및 PD 채널 4에 상응하는 2 개의 PD들을 포함할 수 있다. 도 11에 설명한 바와 같이, IR LED 와 PD 채널 1간의 거리(PD1-IR Length)가 IR LED 와 PD 채널 2간의 거리(PD2-IR Length), IR LED 와 PD 채널 3의 거리(PD3-IR Length), 및 IR LED 와 PD 채 널 4간의 거리(PD4-IR Length)에 비해 가장 길 수 있다. 이 경우, 도 12의 그래프에 도시되어 있는 바와 같이 PD 채널 4를 통해 획득된 로 데이터(예: IR PPG 신 호의 DC 성분 값의 로 데이터)의 크기가 PD 채널 1을 통해 획득된 로 데이터의 크기, PD 채널 2 를 통해 획득된 로 데이터의 크기, 및 PD 채널 3을 통해 획득된 로 데이터의 크기에 비해 큼을 알 수 있다. 도 11에서 설명한 바와 같이 PD 채널 2와 IR LED 간의 거리 및 PD 채널 3과 IR LED 간의 거리가 동일할 수 있으며, 따라서 PD 채널 2를 통해 획득된 로 데이터의 크기와 PD 채널 3을 통해 획득된 로 데이터의 크기는 거의 유사할 수 있다. 이 경우, 그래프에 도시되어 있는 바와 같이 PD 채널 2 를 통해 획득된 로 데이터와 PD 채널 3를 통해 획득된 로 데이터가 겹쳐져 보일 수 있다. 도 13은 다양한 실시 예들에 따른 PPG 센서를 통해 획득되는 PD 채널 별 IR PPG 신호의 DC 성분 값의 변화량 의 일 예를 도시한 도면이다. 도 13을 참조하면, 도 11에서 설명한 바와 같이 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 센서 모듈(예: 도 1a의 센서 모듈 , 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)에 포함되어 있는 PPG 센서는 발광부(예: 도 9의 발광부 또는 도 11의 발광부) 및 수광부(예: 도 9의 수광부 또는 도 11의 수광부)를 포함할 수 있고, 발광부는 RED LED, GREEN LED, BLUE LED 및/또는 IR LED (예: 도 11의 IR LED ) 중 적어도 하나를 포함할 수 있으며, IR LED 를 통해 IR 광을 발생시킬 수 있다. 수광부 는 PD 채널 1에 상응하는 2 개의 PD들, PD 채널 2에 상응하는 2 개의 PD들, PD 채널 3에 상응하는 2 개의 PD들, 및 PD 채널 4에 상응하는 2 개의 PD들을 포함할 수 있다. 도 11에서 설명한 바와 같이, IR LED 와 PD 채널 1간의 거리(PD1-IR Length)가 IR LED 와 PD 채 널 2간의 거리(PD1-IR Length), IR LED 와 PD 채널 3의 거리(PD1-IR Length), 및 IR LED 와 PD 채널 4간의 거리(PD1-IR Length)에 비해 가장 길 수 있다. 이 경우, 도 13의 그래프에 도시되어 있는 바 와 같이 PD 채널 4를 통해 획득된 로 데이터(예: IR PPG 신호의 DC 성분 값의 로 데이터)의 크기가 PD 채 널 1을 통해 획득된 로 데이터의 크기, PD 채널 2 를 통해 획득된 로 데이터의 크기, 및 PD 채널 3 을 통해 획득된 로 데이터의 크기에 비해 큼을 알 수 있다. 도 11에서 설명한 바와 같이 PD 채널 2와 IR LED 간의 거리 및 PD 채널 3과 IR LED 간의 거리가 동일할 수 있으며, 따라서 PD 채널 2를 통해 획득된 로 데이터의 크기와 PD 채널 3을 통해 획득된 로 데이터의 크기는 거의 유사할 수 있다. 이 경우, 그래프에 도시되어 있는 바와 같이 PD 채널 2를 통해 획득된 로 데이터와 PD 채널 3를 통해 획득된 로 데이터가 겹쳐져 보일 수 있다. 그래프에서, 세로축은 IR PPG 신호의 DC 성분의 값의 크 기를 나타내며, 가로축은 시간을 나타낼 수 있다. 일 예로, IR PPG 신호의 DC 성분의 값은 아날로그 디지털 변 환기(analog to digital convertor : ADC) 값 형태로 표현된 값일 수 있다. 이후, 전자 장치에 수평 방향에서 F 방향(예: 도 11의 PD 채널 4에서 PD 채널 1 로의 방향)으로 힘이 가해졌을 경우(예: 전자 장치가 수평 방향에서 F 방향으로 밀렸을 경우) 그래프에 도시되어 있는 바와 같이 해당 시점 이후부터 PD 채널 1, PD 채널 2, PD 채널 3, 및 PD 채널 4을 통해 획득되는 로 데이터(1310, 1320, 1330, 1340)가 변경됨을 알 수 있다. 일 실시 예에서, 전자 장치에 수평 방향은 전자 장치의 전면(예: 도 9 의 901a) 또는 후면(예: 도 9의 901b)의 방향과 수평한 방향을 의미할 수 있다. 이렇게 전자 장치에 수평 방향에서 F 방향으로 힘이 가해졌을 경우 해당 시점 이후부터 그래프에 도시되어 있는 바와 같이 PD 채널 1, PD 채널 2, PD 채널 3, 및 PD 채널 4를 통해 획득되는 로 데이터에서 DC 편차가 제거된 데이터(예: IR PPG 신호의 DC 성분 값의 로 데이터에서 DC 편차가 제거된 IR PPG 신호의 DC성분)(1360, 1370, 1380, 1390) 역시 변경됨을 알 수 있다. PD 채널 1, PD 채널 2, PD3 채널, 및 PD 채널 4를 통해 획득되는 로 데이터에서 DC 편차를 제거하는 방식은 일반적인 DC 편차 제거 방식들 중 어느 하나를 포함 할 수 있다. 도 11에서 설명한 바와 같이 PD 채널 2와 IR LED 간의 거리 및 PD 채널 3과 IR LED 간의 거리가 동일할지라도, 전자 장치에 수평 방향에서 F 방향으로 힘이 가해질 경우, 해당 시점 이후에 PD 채널 2를 통해 획득된 로 데이터의 크기와 PD 채널 3를 통해 획득된 로 데이터의 크기가 변경될 수 있고, 따라서 도 13에 도시되어 있는 바와 같이 PD 채널 2를 통해 획득된 로 데이터에서 DC 편차가 제거된 데이터와 PD 채널 3을 통해 획득된 로 데이터에서 DC편차가 제거된 데이터는 상당히 다른 크기를 가지게 됨을 알 수 있다. 도 14는 다양한 실시 예들에 따른 PPG 센서를 통해 획득되는 PD 채널 별 IR PPG 신호의 DC 성분 값의 변화량의 다른 예를 도시한 도면이다. 도 14를 참조하면, 도 11에서 설명한 바와 같이 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전 자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 센서 모듈(예: 도 1a의 센서 모듈 , 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)에 포함되어 있는 PPG 센서는 발광부(예: 도 9의 발광부 또는 도 11의 발광부) 및 수광부(예: 도 9의 수광부 또는 도 11의 수광부)를 포함할 수 있고, 발광부는 RED LED, GREEN LED, BLUE LED 및/또는 IR LED (예: 도 11의 IR LED ) 중 적어도 하나를 포함할 수 있으며, IR LED 를 통해 IR 광을 발생시킬 수 있다. 수광부 는 PD 채널 1에 상응하는 2 개의 PD들, PD 채널 2에 상응하는 2 개의 PD들, PD 채널 3에 상응하는 2 개의 PD들, 및 PD 채널 4에 상응하는 2 개의 PD들을 포함할 수 있다. 도 11에서 설명한 바와 같이, IR LED 와 PD 채널 4간의 거리(PD4-IR Length)가 IR LED 와 PD 채 널 1간의 거리(PD1-IR Length), IR LED 와 PD 채널 2간의 거리(PD1-IR Length) 및 IR LED 와 PD 채널 3의 거리(PD1-IR Length),에 비해 가장 짧을 수 있다. 이 경우, 도 14의 그래프에 도시되어 있는 바 와 같이 PD 채널 4를 통해 획득된 로 데이터(예: IR PPG 신호의 DC 성분 값의 로 데이터)의 크기가 PD 채 널 1을 통해 획득된 로 데이터의 크기, PD 채널 2 를 통해 획득된 로 데이터의 크기, 및 PD 채널 3 을 통해 획득된 로 데이터의 크기에 비해 큼을 알 수 있다. 그래프에서, 세로축은 IR PPG 신호의 DC 성분의 값의 크기를 나타내며, 가로축은 시간을 나타낼 수 있다. 일 예로, IR PPG 신호의 DC 성분의 값의 단 위는 ADC 값 형태로 표현된 값일 수 있다. 이후, 전자 장치에 수직 방향에서 F 방향(예: 도 11의 발광부 로의 방향)으로 힘이 가해질 경우(예: 1410-1시점에 전자 장치가 수직 방향에서 F 방향으로 눌렸을 경우) 그래프에 도시되어 있는 바와 같이 해 당 시점들(1410-1 내지 1410-6) 에 PD 채널1, PD 채널2, PD 채널3 , 및 PD 채널4를 통해 획득되는 로 데이터 (1410, 1420, 1430, 1440)가 힘이 가해지기 전 대비 변경됨을 알 수 있다. 일 실시 예에서, 전자 장치에 수직 방향은 전자 장치의 전면(예: 도 9의 901a) 또는 후면(예: 도 9의 901b)의 방향과 수직한 방향을 의미할 수 있 다. 이렇게 전자 장치에 수직 방향에서 F 방향으로 힘이 가해졌을 경우 해당 시점(1410-1 내지 1410-6) 에 그래프 에 도시되어 있는 바와 같이 PD 채널 1, PD 채널 2, PD 채널 3, 및 PD 채널 4를 통해 획득되는 로 데이터 에서 DC 편차가 제거된 데이터(예: IR PPG 신호의 DC 성분 값의 로 데이터에서 DC 편차가 제거된 IR PPG 신호의 DC 성분)(1460, 1470, 1480, 1490) 역시 변경됨을 알 수 있다. PD 채널 1, PD 채널 2, PD 채널 3, 및 PD 채널 4를 통해 획득되는 로 데이터에서 DC 편차를 제거하는 방식은 일반적인 DC 편차 제거 방식들 중 어느 하나를 포함할 수 있다. 도 11에서 설명한 바와 같이 PD 채널 2와 IR LED 간의 거리 및 PD 채널 3과 IR LED 간의 거리가 동일하고, 힘이 가해지기 전(예: 1410-1 시점 이전)에는 DC편차가 제거된 PD 채널 2 을 통해 획득된 로 데이터 및 DC편차가 제거된 PD 채널 3을 통해 획득된 로 데이터는 서로 유사할 수 있다. 이후, 전자 장치 에 수직 방향에서 F 방향으로 힘이 가해질 경우, 해당 시점(1410-1 내지 1410-6)에 PD 채널 2를 통해 획득된 로 데이터의 크기와 PD 채널 3을 통해 획득된 로 데이터의 크기가 변경될 수 있고, 따라서 도 14에 도시되어 있는 바와 같이 PD 채널2를 통해 획득된 로 데이터에서 DC 편차가 제거된 데이터와 PD 채널3을 통해 획 득된 로 데이터에서 DC 편차가 제거된 데이터는 상당히 다른 크기를 가지게 됨을 알 수 있다. 다시 도 8을 참조하면, 일 실시 예에서, 착용 상태 신호는 센서 모듈에 포함되어 있는 압력 센서를 통해 획득된 압력 신호일 수 있다. 일 실시 예에서, 프로세서는 압력 센서를 통해 획득된 압력 신호에 기반하여 전자 장치와 사용자 신체의 일부(예: 사용자의 손목)간에 주어지는 압력을 확인할 수 있다. 일 실시 예에서, 착용 상태 신호는 센서 모듈에 포함되어 있는 ECG 센서를 통해 획득된 ECG 신호일 수 있다. 일 실시 예에서, 프로세서는 ECG 센서를 통해 획득된 ECG 신호에 기반하여 전자 장치가 사용자 신체의 일부(예: 사 용자의 손목)에 접촉되는 방향을 확인할 수 있다. 예를 들어, 프로세서는 ECG 센서를 통해 획득된 ECG 신호에 기반하여 전자 장치가 사용자의 손목의 상부에 접촉되어 있는지 또는 사용자의 손목의 하부에 접촉되어 있는지 확인할 수 있다. 본 개시에서는 설명의 편의상 착용 상태 신호는 PPG 신호, 압력 신호, ECG 신호를 포함하는 경우를 일 예로 하 여 설명하기로 한다. 일 실시 예에서, 착용 상태 신호에 기반하여 전자 장치의 착용 상태가 확인될 수 있으며, 전자 장치의 착용 상태를 나타내는 정보가 착용 상태 정보가 될 수 있다. 일 실시 예에서, 착용 상태 정보는 다수의 착용 상태들을 나타낼 수 있다. 예를 들어, 착용 상태 정보는 PPG 신 호, 압력 신호, ECG 신호가 나타내는 정보에 기반하는 다양한 착용 상태들을 나타낼 수 있다. 그리고, 다수의 착용 상태 정보에 상응하는 R-Curve들이 생성되어, 메모리(예: 도 1a의 메모리)에 저장될 수 있다. 일 실시 예에서, 다수의 착용 상태들 각각에 상응하는 착용 상태 정보가 존재할 수 있으며, 다수의 착용 상태 정보 각각에 상응하는 R-Curve가 생성될 수 있다. 일 실시 예에서, 총 N개의 착용 상태 정보가 존재할 수 있다 고 가정하기로 하며, 이 경우 총 N개의 착용 상태 정보 각각에 상응하는 R-Curve가 생성될 수 있다. 일 실시 예 에서, R-Curve는 R 값과 SpO2의 페어들을 포함하는 그룹으로 정의될 수 있다. 일 실시 예에서는, R-Curve를 일 예로 하여 R 값과 SpO2간의 상관 관계를 정의하였으나, R-Curve 형태 뿐만 아니라 테이블 형태로 R 값과 SpO2의 페어들을 포함할 수도 있다. 일 실시 예에서, 다수의 R-Curve들은 필요에 따라 업데이트될 수 있다. 일 실시 예 에서, 다수의 R-Curve들 각각에는 고유한 ID(또는 인덱스)가 할당될 수 있다. 일 실시 예에서, 다수의 테이블들 각각에는 고유한 ID(또는 인덱스)가 할당될 수 있다. 예를 들면, N개의 R-Curve들은 전자 장치의 제조 시점에 메모리에 저장될 수 있다. 일 실시 예에서, N개의 R-Curve들이 전자 장치의 제조 시점에 메모리에 저장되어 있 지 않을 경우, 전자 장치의 프로세서는 통신 회로를 통해 N개의 착용 상태 정보와 그에 상응하는 N개의 R-Curve 들을 서버(예: 도 1a의 서버 또는 도 18의 서버)로부터 수신할 수 있다. 서버는 N개의 착용 상태 정 보와 그에 상응하는 N개의 R-Curve들을 저장할 수 있으며, 필요에 따라(예: 전자 장치의 요청에 따라) N개의 R- Curve들에 상응하는 N개의 착용 상태 정보를 업데이트할 수 있다. 다시 도 8을 참조하면, 동작 815에서 착용 상태 정보를 식별한 전자 장치의 프로세서는 동작 817에서 메모리(예: 도 1a의 메모리 또는 도 6의 메모리)에 저장되어 있는 N개의 R-Curve들 중 동작 815에서 식별한 착용 상태 정보에 상응하는 R-Curve가 존재하는지 여부를 결정할 수 있다. 예를 들어, 메모리에 저장되 어 있는 N개의 R-Curve들은 전자 장치의 제조 시점에 메모리에 저장된 것일 수 있거나, 또는 서버로부터 수신되 어 메모리에 저장된 것일 수 있으며, N개의 R-Curve들이 메모리에 저장되는 시점 또는 N개의 R-Curve들이 메모 리에 저장되는 형태에 대한 제한은 없다. 일 실시 예에서, 프로세서는 N개의 R-Curve들 중 동작 815에서 식별한 착용 상태 정보에 상응하는 R-Curve가 존 재하는지 여부를 결정할 때 가중치(weight value)를 사용할 수 있다. 일 예로, N개의 R-Curve들 각각에는 매핑 되는 착용 상태 정보가 존재하고, 따라서 N개의 착용 상태 정보가 존재할 수 있다. 일 실시 예에서, 프로세서는 센서 모듈이 포함하는 적어도 하나의 센서의 특성에 기반하여 착용 상태 정보가 포함하는 정보 엘리먼트들 각각 에 대해 가중치를 설정할 수 있다. 일 실시 예에서, 착용 상태 정보가 3개의 정보 엘리먼트들을 포함할 경우, 3개의 정보 엘리먼트들 각각에 대해 가중치가 설정될 수 있다. 일 예로, 3개의 정보 엘리먼트들이 전자 장치와 사용자 신체의 일부 간에 주어지는 압력, 전자 장치가 사용자 신체의 일부에 접촉되는 면적의 크기, 전자 장치가 사용자 신체의 일부에 접촉되는 방향을 포함할 경우, 3개의 정보 엘리먼트들 각각에 대해 가중치가 설정될 수 있다. 일 실시 예에서, 동작 815에서 식별한 착용 상태 정보가 포함하는 정보 엘리먼트들은 N개의 착용 상태 정보 각 각이 포함하는 정보 엘리먼트들과 유사도(예: 일치율)이 다를 수 있고, N개의 착용 상태 정보 각각이 포함하는 정보 엘리먼트들에 대해 확인된 일치율과 해당 정보 엘리먼트에 설정되어 있는 가중치를 곱하여 합산함으로써 N 개의 착용 상태 정보 각각에 대한 최종 일치율을 식별할 수 있다. 프로세서는 N개의 착용 상태 정보에 대한 최 종 일치율들 중 최대값을 가지는 최종 일치율을 가지는 착용 상태 정보에 매핑되어 있는 R-Curve를 동작 815에 서 식별한 착용 상태 정보에 상응하는 R-Curve로 선택할 수 있다. 일 실시 예에서, N개의 착용 상태 정보에 대한 최종 일치율들 중 최대값이 임계값 미만일 경우, 동작 815에서 식별한 착용 상태 정보에 상응하는 R-Curve가 존재하지 않는다고 결정할 수 있다. 일 실시 예에서, 임계값은 식별된 착용 상태 정보가 N개의 R-Curve들에 매 핑되어 있는 N개의 착용 상태 정보와 일치된다고 판단될 수 있도록 만족되어야만 하는 최소의 값이 될 수 있다. 동작 815에서는 일 예로 식별한 착용 상태 정보가 포함하는 정보 엘리먼트들과 N개의 착용 상태 정보 각각이 포 함하는 정보 엘리먼트들과 일치율을 고려하였으나, 일치율 뿐만 아니라 식별한 착용 상태 정보가 포함하는 정보 엘리먼트들과 N개의 착용 상태 정보 각각이 포함하는 정보 엘리먼트들과 유사도를 나타낼 수 있는 형태에는 제 한이 없다. 일 실시 예에 따른 다수의 R-Curve들 중 착용 상태 정보에 상응하는 R-Curve를 선택하는 방식을 도 15를 참조하 여 보다 상세하게 설명하면 다음과 같다. 도 15는 다양한 실시 예들에 따른 다수의 R-Curve들 중 착용 상태 정보에 상응하는 R-Curve를 선택하는 동작의 일 예를 도시한 흐름도이다. 도 15를 참조하면, 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 프로세서(예: 도 1a의 프로세서, 도 6의 프로세서), 또는 도 7의 프로세서)의 메모리(예: 도 1의 메모리, 또는 도 6의 메모리)는 다수(예: N개)의 R- Curve들을 저장할 수 있다. 예를 들어, 메모리에 저장되어 있는 N개의 R-Curve들은 전자 장치의 제조 시점에 메 모리에 저장된 것일 수 있거나, 또는 서버로부터 수신되어 메모리에 저장된 것일 수 있으며, N개의 R-Curve들이 메모리에 저장되는 시점 또는 N개의 R-Curve들이 메모리에 저장되는 형태에 대한 제한은 없다. 일 실시 예에 따르면, N개의 R-Curve들에는 착용 상태 정보(1511-1, 1511-2, ... , 1511-N)가 매핑되어 있다. 일 실시 예에서, 착용 상태 정보는 전자 장치와 사용자 신체의 일부 간에 주어지는 압력, 전자 장치가 사용자 신체의 일부에 접촉되는 면적의 크기, 전자 장치가 사용자 신체의 일부에 접촉되는 방향을 정보 엘리먼트들로서 포함할 수 있다. R-Curve 1에는 착용 상태 정보 1(1511-1)이 매핑될 수 있고, R-Curve 2에는 착용 상태 정보 2(1511-2)가 매핑 될 수 있고, 이런 식으로 R-Curve N에는 착용 상태 정보 N이 매핑될 수 있다(1511-N). 프로세서는 Continuous SpO2 측정 모드에서 센서 모듈(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)을 통해 착용 상태 신호를 획득할 수 있고, 착용 상태 신호에 상응하는 착용 상태 정보를 식별할 수 있다. 프로세서는 식별한 착용 상태 정보가 포함하는 정보 엘리먼트들과 N개의 R-Curve N들에 매핑되어 있는 착용 상태 정보(1511-1, 1511-2, ... , 1511-N) 각각이 포함하는 정보 엘리먼트 들을 비교하여, 식별한 착용 상태 정보가 포함하는 정보 엘리먼트들과 N개의 R-Curve N들에 매핑되 어 있는 착용 상태 정보(1511-1, 1511-2, ... , 1511-N) 각각이 포함하는 정보 엘리먼트들의 유사도들(예: 일치 율들)을 식별할 수 있다. 그리고, 각 정보 엘리먼트별로 설정되어 있는 가중치를 식별된 정보 엘리먼트들의 일 치율들에 곱한 후 합산함으로써 N개의 착용 상태 정보(1511-1, 1511-2, ... , 1511-N) 각각에 대 한 최종 일치율을 식별할 수 있다. 프로세서는 N개의 착용 상태 정보(1511-1, 1511-2, ... , 1511-N)에 대한 최 종 일치율들 중 최대값을 가지는 최종 일치율을 가지는 착용 상태 정보에 매핑되어 있는 R-Curve를 식별한 착용 상태 정보에 상응하는 R-Curve로 선택할 수 있다. 일 실시 예에서, N개의 착용 상태 정보에 대한 최종 일 치율들 중 최대값이 임계값 미만일 경우, 식별한 착용 상태 정보에 상응하는 R-Curve가 존재하지 않는다고 결정 할 수 있다. 일 실시 예에서, 임계값은 식별된 착용 상태 정보가 N개의 R-Curve들에 매핑되어 있는 N개의 착용 상태 정보과 일치된다고 판단될 수 있도록 만족되어야만 하는 최소의 값이 될 수 있다. 도 15에서는, 일 예로 식별한 착용 상태 정보가 포함하는 정보 엘리먼트들과 N개의 착용 상태 정보 각각이 포함하는 정보 엘리먼트들 과 일치율을 고려하였으나, 일치율 뿐만 아니라 식별한 착용 상태 정보가 포함하는 정보 엘리먼트들과 N개의 착 용 상태 정보 각각이 포함하는 정보 엘리먼트들과 유사도를 나타낼 수 있는 형태에는 제한이 없다. 다시 도 8을 참조하면, 전자 장치의 프로세서는 동작 817에서 검사 결과 N개의 R-Curve들 중 동작 815에서 식별 한 착용 상태 정보에 상응하는 R-Curve가 존재할 경우(동작 817-예), 동작 819에서 N개의 R-Curve들 중 동작 815에서 식별한 착용 상태 정보에 상응하는 R-Curve를 SpO2 측정에 사용할 R-Curve로 선택하고, 선택한 R-Curve 에 기반하여 SpO2 측정 동작을 시작할 수 있다. 이렇게 SpO2 측정 동작을 시작함에 따라 프로세서는 센서 모듈을 통해 획득되는 PPG 신호에 기반하여 R 값을 획 득할 수 있고, 선택한 R-Curve와 획득된 R 값에 기반하여 SpO2를 측정할 수 있다. 도 8에 도시되어 있지는 않 으나, 프로세서는 선택적으로(예: 사용자의 요청에 따라, 또는 Continuous SpO2 측정 모드가 종료되는 시점, 또는 설정된 주기에 따라) 측정된 SpO2를 디스플레이(예: 도 1a의 디스플레이 모듈, 또는 도 6의 디스플레이)를 통해 출력할 수 있다. 선택한 R-Curve와 획득된 R 값에 기반하여 SpO2를 측정하는 동작은 도 4에서 설명한 방식과 유사하므로 여기서는 그 상세한 설명을 생략하기로 한다. 일 실시 예에서, N개의 R-Curve들이 제1 R-Curve 및 제2 R-Curve를 적어도 포함하고, 제1 R-Curve는 전자 장치 가 전자 장치의 사용자의 신체의 일부에 밀착되도록 착용된 상태에 상응하는 R-Curve이고, 제2 R-Curve는 On- demand 방식에서 사용되는 R-Curve가 생성될 때 적용되는 착용 상태에 상응하는 R-Curve일 수 있다. 일 예로, 프로세서는 식별한 착용 상태가 전자 장치가 전자 장치의 사용자의 신체의 일부에 밀착되도록 착용된 상태에 상 응할 경우 제1 R-Curve를 선택하고, 획득된 R 값과 선택된 제1 R-Curve에 기반하여 SpO2를 측정할 수 있다. 다 른 예로, 프로세서는 식별한 착용 상태가 On-demand 방식에서 사용되는 R-Curve가 생성될 때 적용되는 착용 상 태에 상응할 경우 제2 R-Curve를 선택하고, 획득된 R 값과 선택된 제2 R-Curve에 기반하여 SpO2를 측정할 수 있 다. 도 8에 별도로 도시하지는 않았으나, 동작 817에서 검사 결과 N개의 R-Curve들 중 동작 815에서 식별한 착용 상 태 정보에 상응하는 R-Curve가 존재하지 않을 경우(동작 817-아니오), 프로세서는 SpO2 측정 동작을 수행하지 않고 동작 811로 진행할 수 있다. . . 일 실시 예에서, 프로세서는 착용 상태 정보에 상응하는 R-Curve가 존재 하지 않음을 식별한 경우마다 SpO2 측정에 실패하였음을 나타내는 경고 메시지를 디스플레이(예: 도 1a의 디스 플레이 모듈 또는 도 6의 디스플레이) 및/또는 스피커(예: 도 1a의 음향 출력 모듈)를 통해 출 력할 수 있다. 일 실시 예에서, 프로세서는 식별한 착용 상태 정보에 상응하는 R-Curve가 존재하지 않음을 식별 하기 시작한 시점부터 설정 시간 동안 지속적으로 식별한 착용 상태 정보에 상응하는 R-Curve가 존재하지 않음 을 식별할 경우 SpO2 측정에 실패하였음을 나타내는 경고 메시지를 디스플레이 및/또는 스피커를 통해 출력할 수 있다. 일 실시 예에서, 설정 시간은 전자 장치에 따라 다르게 설정될 수 있다. 도 16은 다양한 실시 예들에 따른 전자 장치의 동작 과정의 다른 예를 도시한 흐름도이다. 도 16을 참조하면, 동작 1611에서 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치 (101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 프로세서(예: 도 1a의 프로세서, 도 6의 프로세서), 또는 도 7의 프로세서)는 Continuous SpO2 측정 모드에서 SpO2의 측정을 완료할 수 있다. 동작 1613에서 프로세서는 On-demand 방식에 기반하여 다수의 R-Curve들을 보정하는 것이 가능한 보정조 건을 만족하는지 검사할 수 있다. 일 실시 예에서, 보정 조건은 하기와 같은 조건 , 조건 , 또는 조건 , 중 적어도 하나를 포함할 수 있다. 움직임이 적은 상태 일 실시 예에서, 움직임이 적은 상태는 전자 장치의 센서 모듈(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈 , 도 6의 센서 모듈, 또는 도 7의 센서 모듈)을 통해 획득되는 움직임 신호에 기반하여 획득되 는 전자 장치의 움직임이 설정 조건을 만족하는 상태를 나타낼 수 있다. Continuous SpO2 측정 모드에서 SpO2의 측정이 완료된 후, 움직임이 적은 상태일 경우 보정 조건이 만족될 수 있다. 예를 들어, 움직임이 적은 상태에 서 사용자는 안정적인 자세에서 SpO2를 측정함으로써 정확한 SpO2측정이 가능할 수 있다. 일 실시 예에서, 움직 임 신호는 가속도 신호 또는 각속도 신호 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 설정 조건은 가속도의 임계값 또는 임계 변화량 중 적어도 하나에 기반하는 조건일 수 있다. 일 예로, 설정 조건이 가속도의 임계값을 기반으로 하는 조건일 경우, 설정 조건은 가속도 신호의 DC 절대 값이 임계값 미만인 조건이 될 수 있다. 다른 예로, 일 예로, 설정 조건이 가속도의 임계 변화량을 기반으로 하는 조 건일 경우, 설정 조건은 가속도 신호의 DC 값의 변화량이 임계 변화량 미만인 조건이 될 수 있다. 일 실시 예에 서, 설정 조건은 각속도의 임계값 또는 임계 변화량 중 적어도 하나에 기반하는 조건일 수 있다. 일 예로, 설정 조건이 각속도의 임계값을 기반으로 하는 조건일 경우, 설정 조건은 각속도 신호의 DC 절대 값이 임계값 미만인 조건이 될 수 있다. 다른 예로, 일 예로, 설정 조건이 각속도의 임계 변화량을 기반으로 하는 조건일 경우, 설 정 조건은 각속도 신호의 DC 값의 변화량이 임계 변화량 미만인 조건이 될 수 있다. 설정 시간 일 실시 예에서, 설정 시간은 미리 설정되어 있는 시간일 수 있다. 예를 들면, Continuous SpO2 측정 모드에서 SpO2의 측정이 완료된 시점에서 설정 시간이 경과될 경우 보정 조건이 만족될 수 있다. 다른 예를 들면, Continuous SpO2 측정 모드에서 SpO2의 측정이 완료된 후 사용자가 수면 시간으로 지정한 시간이 경과될 경우 보정 조건이 만족될 수 있다. 급격한 SpO2의 변화가 발생하지 않는 상태 Continuous SpO2측정 모드에서 측정된 SpO2들의 변화량이 임계 변화량 미만인 경우 급격한 SpO2의 변화가 발생 하지 않는 상태일 수 있다. Continuous SpO2측정 모드에서 측정된 SpO2들의 변화량이 임계 범위 내에 존재할 경 우 급격한 SpO2의 변화가 발생하지 않는 상태일 수 있다. 이렇게, Continuous SpO2측정 모드에서 측정된 SpO2들 의 변화량이 임계 변화량 미만이거나 또는 임계 범위 내에 존재할 경우 보정 조건이 만족될 수 있다. 일 실시 예에서, 보정 조건은 Continuous SpO2측정 모드에서 측정된 SpO2가 비교적 높은 정확도를 가진다고 판 단될 수 있는 상황에서 Continuous SpO2측정 모드에서 사용되는 R-Curve들을 보정하기 위한 조건이 될 수 있다. 동작 1613에서 확인 결과 보정 조건이 만족될 경우(동작 1613-예), 프로세서는 동작 1615에서 UI를 통해 On- demand SpO2 측정을 요청하는 On-demand SpO2 측정 요청 메시지를 디스플레이(예: 도 1a의 디스플레이 모듈 또는 도 6의 디스플레이) 및/또는 스피커(예: 도 1a의 음향 출력 모듈)를 통해 출력할 수 있다. 동작 1613에서 확인 결과 보정 조건이 만족되지 않을 경우(동작 1613-아니오), 프로세서는 더 이상의 동 작을 수행하지 않고 종료할 수 있다. 동작 1617에서 프로세서는 UI를 통해 On-demand SpO2 측정 모드를 온 시킬 것을 요청하는 On-demand SpO2 측정 모드 온 요청이 입력되는지 확인할 수 있다. 동작 1617에서 확인 결과 On-demand SpO2 측정 모드 온 요청이 입 력되었을 경우(동작 1617-예), 동작 1619에서 프로세서는 SpO2 측정 모드를 Continuous SpO2 측정 모드에서 On-demand SpO2 측정 모드로 전환할 수 있다. 동작 1617에서 확인 결과 On-demand SpO2 측정 모드 온 요청이 입력되지 않을 경우(동작 1617-아니오), 프로세서는 더 이상의 동작을 수행하지 않고 종료할 수 있다. 동작 1621에서 프로세서는 On-demand SpO2 측정 모드에서 센서 모듈을 통해 획득되는 생체 신호(예: R값)와 On- demand SpO2 측정 모드에 대해 설정되어 있는 R-Curve (예: 기준 R-Curve)에 기반하여 SpO2를 측정할 수 있다. 동작 1623에서 프로세서는 On-demand SpO2 측정 모드에서의 SpO2 측정에 성공하였는지 확인할 수 있다. 일 실시 예에서, 프로세서는 On-demand SpO2 측정 모드에서 SpO2를 측정하는 동안 움직임이 발생함을 식별하거나, 사용 자의 불안정한 자세로 인한 측정 불가 상태가 식별되거나, On-demand SpO2 측정 모드에서 센서 모듈로부터 입력 되는 생체 신호가 부정확할 경우 On-demand SpO2 측정 모드에서의 SpO2 측정에 성공에 실패하였다고 식별할 수 있다. 동작 1623에서 확인 결과 On-demand Spo2 측정 모드에서 SpO2 측정에 성공하였을 경우(동작 1623-예), 프로세서 는 동작 1625에서 통신 회로(예: 도 1 a의 통신 모듈 또는 도 6의 통신 회로)를 통해 On-demand SpO2 측정 모드에서 측정된 SpO2, On-demand SpO2 측정 모드 직전의 Continuous SpO2 측정 모드에서 측정된 SpO2, 및 그에 상응하는 R 값과, SpO2 측정 모드에서 선택된 R-Curve에 대한 인덱스를 서버(예: 도 1a의 서버 또는 도 18의 서버)로 송신할 수 있다. 동작 1623에서 확인 결과 On-demand Spo2 측정 모드에서 SpO2 측정에 성공하지 않았을 경우(동작 1623-아니오), 프로세서는 더 이상의 동작을 수행하지 않고 종료할 수 있다. 일 실시 예에서, 서버는 전자 장치로부터 수신되는 On-demand SpO2 측정 모드에서 측정된 SpO2, On-demand SpO2 측정 모드 직전의 Continuous SpO2 측정 모드에서 측정된 SpO2, 및 그에 상응하는 R 값과, Continuous SpO2 측정 모드에서 선택된 R-Curve에 대한 인덱스에 기반하여 전자 장치의 Continuous SpO2측정 모드에서 사용 되는 다수의 R-Curve들을 보정할 수 있다. 이를 도 17을 참조하여 설명하기로 한다. 도 17은 다양한 실시 예들에 따른 서버의 동작 과정을 도시한 흐름도이다. 도 17을 참조하면, 동작 1711에서 서버(예: 도 1a의 서버 또는 도 18의 서버)의 프로세서(예: 도 18 의 프로세서)는 통신 회로(예: 도 18의 통신 회로)를 통해 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)로부터 On-demand SpO2 측정 모드에서 측정된 SpO2, On-demand SpO2 측정 모드 직전의 Continuous SpO2 측정 모드에서 측정된 SpO2, 및 그에 상응하는 R 값과, SpO2 측정 모드에서 선택된 R-Curve에 대한 인덱스를 수신할 수 있다. 동작 1713에서 프로세서는 On-demand SpO2 측정 모드에서 측정된 SpO2와 Continuous SpO2 측정 모드에서 측정 된 SpO2 간의 차이가 임계 값 이하인지 확인할 수 있다. 확인 결과 On-demand SpO2 측정 모드에서 측정된 SpO2 와 Continuous SpO2 측정 모드에서 측정된 SpO2 간의 차이가 임계 값 이하일 경우(동작 1713-예), 동작 1715에 서 수신된 R-Curve 인덱스에 매핑되는 R-Curve의 R 값을 수신된, Continuous SpO2 측정 모드에서 측정된 SpO2 에 상응하는 R 값으로 변경하여 R-Curve 인덱스에 매핑되는 R-Curve를 업데이트할 수 있다. 동작 1713에서 확인결과 On-demand SpO2 측정 모드에서 측정된 SpO2와 Continuous SpO2 측정 모드에서 측정된 SpO2 간의 차이가 임계 값 이하가 아닐 경우(동작 1713-아니오), 프로세서는 더 이상의 동작을 수행하지 않고 종료할 수 있다. 예 를 들어, On-demand SpO2 측정 모드에서 측정된 SpO2와 Continuous SpO2 측정 모드에서 측정된 SpO2 간의 차이 가 임계 값 이하가 아닐 경우, 부정확한 R-Curve보정이 진행될 수 있으며, 따라서 프로세서는 더 이상의 동작을 수행하지 않고 종료할 수 있다. 동작 1717에서 프로세서는 통신 회로를 통해 전자 장치로 R-Curve 인덱스 및 업데이트된 R-Curve를 송신할 수 있다. 일 실시 예에 따르면, 서버로부터 R-Curve 인덱스 업데이트된 R-Curve를 수신한 전자 장치는 전자 장치에 저장되어 있는 R-Curve 인덱스에 상응하는 R-Curve를 수신한, 업데이트된 R-Curve로 업데이트할 수 있다. 이렇 게, 업데이트된 R-Curve는 이후 Continuous SpO2 측정 모드에서 SpO2를 측정할 때 사용될 수 있고, 따라서 사용 자에 보다 적합한 SpO2를 측정하는 것이 가능할 수 있다. 도 17에서는 전자 장치에 대한 R-Curve 업데이트 동작이 서버에서 수행되는 경우를 일 예로 하여 설명하였으나, 전자 장치(예: 웨어러블 전자 장치)에서 직접 R-Curve 업데이트 동작을 수행할 수도 있다. 도 18은 다양한 실시 예들에 따른 서버의 블록도이다. 도 18을 참조하면, 서버(예: 도 1a의 서버)는 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)와 신호들을 송수신하는 통신 회로를 포함할 수 있다. 일 실시 예에서, 통신 회로는 유선 또는 무선 통신을 지원할 수 있다. 서버는 하나 또는 두 개 이상의 단일 코어 프로세서들 또는 하나 또는 두 개 이상의 다중 코어 프로세서 들로 구현될 수 있는 프로세서와, 서버의 동작을 위한 인스트럭션들을 저장하는 메모리를 포 함할 수 있다. 서버는 네트워크 외부의 구성 요소(component)들과 통신하기 위한 유선 및/또는 무선 인터페이스를 제공 하는 인터페이스 모듈을 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치 (101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 동작 방법은, 상기 전자 장치(예: 도 1a의 전 자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 움직임의 변화량이 임계 범위 내에 존재할 경우, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 착용 상태를 식별하는 동작, 광 용적맥파(photoplethysmogram: PPG) 신호들에 기반하는 기준 값들에 상응하는 산소 포화도(saturation of percutaneous oxygen: SpO2)들을 포함하는 제1 그룹 및 상기 기준 값들에 상응하는 다른 SpO2들을 포함하는 제2 그룹을 포함하는 다수의 그룹들 중 상기 착용 상태에 상응하는 그룹을 선택하는 동작, 및 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장 치)에 포함되어 있는 적어도 하나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 제1 PPG 신호를 획득하고, 상기 제1 PPG 신호에 기반하는 제1 기준 값과 상기 선택된 그룹을 사용하여 제1 SpO2를 획득하는 동작을 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 다수의 그룹들 중 상기 착용 상태에 상응하는 그룹을 선택하는 동 작은 상기 식별된 착용 상태에 상응하는 착용 상태 정보와 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보 들 각각 간의 유사도를 식별하는 동작, 및 상기 식별된 유사도들 중 최대값을 가지는 착용 상태 정보에 매핑되 어 있는 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하는 동작을 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 착용 상태 정보는 사용자 신체에 의해 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 가 해지는 압력, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에서 상기 사용자 신체에 의해 접촉되는 면적의 크기, 또는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)가 상기 사용자 신체에 접촉되는 방향 중 적어도 하나를 정보 엘리먼트(element)들로서 포함할 수 있으며, 및 상기 다수의 그룹들 중 상기 착용 상태에 상응하는 그룹을 선택하는 동작은, 상기 식별된 착용 상태에 상응하는 착용 상태 정보에 포함되어 있는 정보 엘리먼트들과 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보들 각각에 포함되어 있는 정보 엘리먼트들간의 유사도들을 식별하는 동작, 상기 다수의 그룹들 각각에 대해, 상기 식별된 정보 엘리먼트들에 대한 유사도들 각각에 정보 엘리먼트 별로 설정되어 있는 가중치를 적용하는 동작, 및 상기 다수의 그룹들 중 상기 가중치가 적용된 유사도들의 합이 최대값인 그룹을 상기 식별된 착 용 상태에 상응하는 그룹으로 선택하는 동작을 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 가중치가 적용된 유사도들의 합들 중 최대값은 설정되어 있는 최소 유사도 이상일 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 움직임은 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나의 센 서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈 )를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 착용 상태는 상기 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하 나의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모 듈)를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG) 신호, 또는 압력 신호 중 적어도 하나 에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 다수의 그룹들 중 착용 상태에 상응하는 그룹을 선택하고, 상기 제 1 PPG 신호에 기반하는 제1 기준 값과 상기 선택된 그룹을 사용하여 상기 제1 SpO2를 획득하는 동작은, 상기 착 용 상태가 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장 치, 또는 도 7의 전자 장치)에서 사용자 신체에 의해 접촉되는 면적의 크기가 임계 면적 이상인 착용 상태일 경우, 상기 제1 그룹을 선택하고, 상기 제1 기준 값과 상기 제1 그룹을 사용하여 상기 제1 SpO2를 획득 하고, 및 상기 착용 상태가 제2 측정 방식에서 사용되는 단일 그룹이 생성될 때 적용되는 착용 상태일 경우, 상 기 제2 그룹을 선택하고, 상기 제1 기준 값과 상기 제2 그룹을 사용하여 상기 제1 SpO2를 획득하는 동작을 포함 하고, 상기 제2 측정 방식은 상기 다수의 그룹들이 사용되는 제1 측정 방식과는 다를 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 동작 방법은, 상기 제1 SpO2를 획득한 후, 측정 방식을 상기 다수 의 그룹들이 사용되는 제1 측정 방식에서 단일 그룹이 사용되는 제2측정 방식으로 전환하는 동작, 상기 제2 측 정 방식에서 제2 PPG 신호를 획득하는 동작, 상기 제2 PPG 신호에 기반하는 제2 기준 값과 상기 단일 그룹을 사 용하여 제2 SpO2를 획득하는 동작, 및 상기 제1 SpO2, 상기 제1 기준 값, 상기 선택된 그룹의 식별자, 상기 제2 SpO2중 적어도 하나를 외부 전자 장치 서버(예: 도 1a의 서버 또는 도 18의 서버)로 송신하여 상기 선택된 그룹을 업데이트하도록 하는 동작을 더 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 선택된 그룹에 포함되어 있는 상기 제1 기준 값을 상기 제2 SpO2에 상응하는 상기 제2 기준 값으로 변경함으로써 상기 선택된 그룹이 업데이트될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 조건이 만족될 경우, 상기 제1 측정 방식에서 상기 제2 측정 방식으로 전환될 수 있으며, 및 상기 조건은 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치 (101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나의 센서(예: 도 1a의 센 서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈)를 통해 획득되는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 움직임의 변화량이 제1 임계 범위 내에 존재하는 조건, 상기 제1 SpO2를 측정 완료한 시점 이후 설정 시간이 완료되는 조건, 또는 상기 제1 측정 방식에서 측정되는 SpO2들의 변화량이 제2 임계 범위 내에 존재하는 조건 중 적어도 하나를 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 움직임은 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나의 센 서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈 )를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 다수의 그룹들 중 상기 착용 상태에 상응하는 그룹을 선택하는 동 작은 상기 식별된 착용 상태에 상응하는 착용 상태 정보와 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보 들 각각 간의 유사도를 식별하는 동작, 및 상기 식별된 유사도들 중 최대값을 가지는 착용 상태 정보에 매핑되 어 있는 그룹을 상기 식별된 착용 상태에 상응하는 그룹으로 선택하는 동작을 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 착용 상태 정보는 사용자 신체에 의해 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 가해지는 압력, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에서 상기 사용자 신체에 의해 접촉되는 면적의 크기, 또는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)가 상기 사용자 신체에 접촉되는 방향 중 적어도 하나를 정보 엘리먼트(element)들로서 포함할 수 있으며, 및 상기 다수의 그룹들 중 상기 착용 상태에 상응하는 그룹을 선택하는 동작은 상기 식별된 착용 상 태에 상응하는 착용 상태 정보에 포함되어 있는 정보 엘리먼트들과 상기 다수의 그룹들에 매핑되어 있는 착용 상태 정보들 각각에 포함되어 있는 정보 엘리먼트들간의 유사도들을 식별하는 동작, 상기 다수의 그룹들 각각에 대해, 상기 식별된 정보 엘리먼트들에 대한 유사도들 각각에 정보 엘리먼트 별로 설정되어 있는 가중치를 적용 하는 동작, 및 상기 다수의 그룹들 중 상기 가중치가 적용된 유사도들의 합이 최대값인 그룹을 상기 식별된 착 용 상태에 상응하는 그룹으로 선택하는 동작을 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 가중치가 적용된 유사도들의 합들 중 최대값은 설정되어 있는 최소 유사도 이상일 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 착용 상태를 식별하는 동작은 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 움직임의 변화량이 임계 범위 내에 존재함을 식별할 경우 수행될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 움직임은 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나의 센 서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈 )를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 착용 상태는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나 의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈 )를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG) 신호, 또는 압력 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 동작 방법은 상기 외부 전자 장치(예: 도 1a의 서버 또는 도 18의 서버)로부터 상기 업데이트된 그룹의 식별자 및 상기 업데이트된 그룹을 수신하는 동작을 더 포함할 수 있으며, 및 상기 업데이트된 그룹은 상기 제1 SpO2와 상기 제2 SpO2간의 차이가 임계 값 이하일 경우, 상기 선택된 그룹에 포함되어 있는 상기 제1 기준 값을 상기 제2 SpO2에 상응하는 상기 제2 기준 값으로 변경함으로 써 업데이트될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 다수의 그룹들 중 착용 상태에 상응하는 그룹을 선택하고, 상기 제 1 PPG 신호에 기반하는 제1 기준 값과 상기 선택된 그룹을 사용하여 상기 제1 SpO2를 획득하는 동작은, 상기 착 용 상태가, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장 치, 또는 도 7의 전자 장치)에서 사용자 신체에 의해 접촉되는 면적의 크기가 임계 면적 이상인 착용 상태일 경우, 상기 제1 그룹을 선택하고, 상기 제1 기준 값과 상기 제1 그룹을 사용하여 상기 제1 SpO2를 획득 하고, 및 상기 착용 상태가 제2 측정 방식에서 사용되는 단일 그룹이 생성될 때 적용되는 착용 상태일 경우, 상 기 제2 그룹을 선택하고, 상기 제1 기준 값과 상기 제2 그룹을 사용하여 상기 제1 SpO2를 획득하는 동작을 포함 하고, 상기 제2 측정 방식은 상기 다수의 그룹들이 사용되는 제1 측정 방식과는 다를 수 있다. 본 개시의 다양한 실시 예들에 따르면, 외부 전자 장치(예: 도 1a의 서버 또는 도 18의 서버)의 동 작 방법은 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치 , 또는 도 7의 전자 장치)로부터 광용적맥파(photoplethysmogram: PPG) 신호들에 기반하는 기준 값 들에 상응하는 산소 포화도(saturation of percutaneous oxygen: SpO2)들을 포함하는 제1 그룹 및 상기 기준 값들에 상응하는 다른 SpO2들을 포함하는 제2 그룹을 포함하는 다수의 그룹들이 사용되는 제1 측정 방식에서 획 득된 제1 SpO2, 상기 제1 SpO2에 상응하는 제1 기준 값, 상기 다수의 그룹들 중 상기 제1 SpO2를 획득하는데 사 용된 그룹의 식별자, 단일 그룹이 사용되는 제2 측정 방식에서 측정된 제2 SpO2를 수신하는 동작, 상기 제1 SpO2와 상기 제2 SpO2 간의 차이가 임계 값 이하일 경우, 상기 식별자에 매핑되는 그룹에 포함되어 있는 상기 제1 기준 값을 상기 단일 그룹에서 상기 제2 SpO2에 상응하는 제2 기준 값으로 변경하여 상기 식별자에 매핑되 는 그룹을 업데이트하는 동작, 및 상기 식별자 및 상기 업데이트된 그룹을 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)로 송신 하는 동작을 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 제1 SpO2를 획득하는데 사용된 그룹은 상기 다수의 그룹들 중 상기 제1 측정 방식에서 식별된 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 착용 상태에 상응하는 착용 상태 정보에 매핑되어 있는 그룹일 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 착용 상태는 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나 의 센서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈 )를 통해 획득되는 PPG 신호, 심전도(electrocardiography: ECG) 신호, 또는 압력 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 측정 방식은 가능한 조건이 만족될 경우, 상기 제1 측정 방식에서 상기 제2 측정 방식으로 전환되며, 및 상기 조건은 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)의 움 직임의 변화량이 제1 임계 범위 내에 존재하는 조건, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)가 상기 제1 SpO2를 측정 완료 한 시점 이후 설정 시간이 완료되는 조건, 또는 상기 제1 측정 방식에서 측정되는 SpO2들의 변화량이 제2 임계 범위 내에 존재하는 조건 중 적어도 하나를 포함할 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 움직임은 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6의 전자 장치, 또는 도 7의 전자 장치)에 포함되는 적어도 하나의 센 서(예: 도 1a의 센서 모듈, 도 1b의 센서 모듈, 도 6의 센서 모듈, 또는 도 7의 센서 모듈 )를 통해 획득되는 가속도 신호 또는 각속도 신호 중 적어도 하나에 기반하여 획득될 수 있다. 본 개시의 다양한 실시 예들에 따르면, 상기 동작 방법은, 상기 제1 SpO2와 상기 제2 SpO2간의 차이가 상기 임 계 값을 초과할 경우, 상기 전자 장치(예: 도 1a의 전자 장치, 도 1b 내지 도 1d의 전자 장치(101b), 도 6 의 전자 장치, 또는 도 7의 전자 장치)로 그룹 업데이트가 수행되지 않음을 나타내는 메시지를 송신 하는 동작을 더 포함할 수 있다. 도면 도면1a 도면1b 도면1c 도면1d 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18"}
{"patent_id": "10-2021-0165173", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1b는 다양한 실시 예들에 따른 전자 장치의 전면의 사시도이다. 도 1c는 도 1b의 다양한 실시 예들에 따른 전자 장치의 후면의 사시도이다. 도 1d는 도 1b의 전자 장치를 나타내는 분리 사시도이다. 도 2는 다양한 실시 예들에 따른 광 흡수율에 따른, SpO2 측정에 사용되는 AC 성분 및 DC 성분의 일 예를 도시 한 도면이다. 도 3은 다양한 실시 예들에 따른 파장에 따른 광 흡수율의 일 예를 도시한 도면이다. 도 4는 다양한 실시 예들에 따른 SpO2 측정에 사용되는 R-Curve의 일 예를 도시한 도면이다. 도 5는 다양한 실시 예들에 따른 Continuous 방식이 사용될 경우 사용자의 착용 상태 변경에 따른 SpO2 측정 오류의 일 예를 도시한 도면이다. 도 6은 다양한 실시 예들에 따른 전자 장치의 블록도의 일 예이다. 도 7은 다양한 실시 예들에 따른 전자 장치의 소프트웨어 계층 구조를 도시한 블록도이다. 도 8은 다양한 실시 예들에 따른 전자 장치의 동작 과정의 일 예를 개략적으로 도시한 흐름도이다. 도 9는 다양한 실시 예들에 따른 PPG 센서의 배치의 일 예를 개략적으로 도시한 도면이다. 도 10은 다양한 실시 예들에 따른 PPG 센서의 구조의 일 예를 개략적으로 도시한 도면이다. 도 11은 다양한 실시 예들에 따른 PPG 센서를 통해 전자 장치에 가해지는 압력을 측정하는 동작의 일 예를 도시 한 도면이다. 도 12는 다양한 실시 예들에 따른 PPG 센서를 통해 획득되는 PD 채널 별 IR PPG 신호의 DC 성분 값의 일 예를 도시한 도면이다. 도 13은 다양한 실시 예들에 따른 PPG 센서를 통해 획득되는 PD 채널 별 IR PPG 신호의 DC 성분 값의 변화량의 일 예를 도시한 도면이다. 도 14는 다양한 실시 예들에 따른 PPG 센서를 통해 획득되는 PD 채널 별 IR PPG 신호의 DC 성분 값의 변화량의 다른 예를 도시한 도면이다. 도 15는 다양한 실시 예들에 따른 다수의 R-Curve들 중 착용 상태 정보에 상응하는 R-Curve를 선택하는 동작의 일 예를 도시한 흐름도이다. 도 16은 다양한 실시 예들에 따른 전자 장치의 동작 과정의 다른 예를 도시한 흐름도이다. 도 17은 다양한 실시 예들에 따른 서버의 동작 과정을 도시한 흐름도이다. 도 18은 다양한 실시 예들에 따른 서버의 블록도이다."}
