{"patent_id": "10-2021-0180005", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0090870", "출원번호": "10-2021-0180005", "발명의 명칭": "딥 러닝 기반 화재 감시 시스템", "출원인": "가천대학교 산학협력단", "발명자": "압두살로모프 아크말베크"}}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실시간으로 특정 공간의 가시광선 영상을 확보하는 적어도 하나 이상의 화재 감지기; 및관리하는 화재 감지기들로부터 수신된 가시광선 영상을 분석하여 화재발생 여부를 판별하되, 딥 러닝 기반의 기계학습을 통해 화염의 형상을 학습한 인공지능 엔진으로 상기 가시광선 영상을 분석하여 화재 발생 유무를 분석하는 화염 분석기;를 포함하며,상기 화염 분석기는,화염의 일부 혹은 전체가 도시된 원시 영상 데이터들을 수집하여 딥 러닝용 데이터셋으로 가공하는 떼이터셋 생성부;상기 딥 러닝용 데이터셋을 학습하여 화염의 형상을 검출할 수 있는 인공지능 알고리즘을 준비하고, 상기 화재감시기에서 전송된 가시광선 영상을 상기 인공지능 엔진을 이용하여 분석하고, 화재 발생 여부를 판단하는 화재판단부;를 포함하는 것을 특징으로 하는 딥 러닝 기반의 화재 감시 시스템."}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 데이터셋 생성부는,화염이 포함된 동영상을 수집하고, 상기 동영상을 구성하는 적어도 하나 이상의 프레임들을 추출하여 수집하는것을 특징으로 하는 딥 러닝 기반의 화재 감시 시스템."}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 데이터셋 생성부는 LabelImg 도구를 사용하여 상기 원시 영상 데이터들에 포함된 화염의 좌표 데이터를 산출하고, 상기 좌표 데이터를 상기 원시 영상 데이터에 기록하는 것을 특징으로 하는 딥 러닝 기반의 화재 감시시스템."}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 데이터셋 생성부는,상기 원시 영상 데이터를 일 방향으로 소정의 각도마다 회전시켜 적어도 둘 이상의 회전 변환 데이터를 생성하고,상기 회전 각도의 간격은 5°이상 내지 15°이하인 것을 특징으로 하는 딥 러닝 기반의 화재 감시 시스템."}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 데이터셋 생성부는,상기 원시 영상 데이터를 영상의 채도(Saturation), 명도(Brightness), 노출(Expossure) 혹은 대비(contrast)중 적어도 어느 하나 이상의 색정보를 변환하여 적어도 둘 이상의 색변환 데이터를 생성하는 것을 특징으로 하는 딥 러닝 기반 화재 감시 시스템."}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0090870-3-제 5 항에 있어서,상기 데이터셋 생성부는,채도 혹 노출을 일정하게 유지하고, 명도 혹은 대비를 각각 변환하며 서로 상이한 적어도 둘 이상의 색변환 데이터를 생성하는 것을 특징으로 하는 딥 러닝 기반 화재 감시 시스템."}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 데이터셋 생성부는,수집된 상기 원시 영상 데이터 중에서 기 설정된 해상도 이상의 원시 영상 데이터만을 딥 러닝용 데이터셋으로가공하고,상기 기 설정된 해상도는 가로 픽셀 수 및 세로 픽셀 수가 각각 600 x 600 이상인 것을 특징으로 하는 딥 러닝기반의 화재 감시 시스템."}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 데이터셋 생성부는,화염의 색상 혹은 명도 혹은 화염의 형상이 유사하되, 화염이 아닌 것이 도시된 유사 화염 데이터를 수집하여유사 화염 딥 러닝용 데이터셋을 으로 가공하고,상기 화재 판단부는 상기 딥 러닝용 데이터셋과 상기 유사 화염 딥 러닝용 데이터셋을 각각 학습하여, 상기 화재감시기에서 전송된 가시광선 영상에 화염의 유무를 판별하는 것을 특징으로 하는 딥 러닝 기반의 화재 감시시스템."}
{"patent_id": "10-2021-0180005", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,화염 객체를 검출하기 위한 상기 인공지능 엔진은 YOLOv3 알고리즘을 이용하는 것을 특징으로 하는 딥 러닝 기반의 화재 감시 시스템."}
{"patent_id": "10-2021-0180005", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 딥 러닝 기반의 화재 감시 시스템은, 실시간으로 특정 공간의 가시광선 영상을 확보하는 적어도 하나 이상의 화재 감지기 및 관리하는 화재 감지기들로부터 수신된 가시광선 영상을 분석하여 화재발생 여부를 판별하 되, 딥러닝 기반의 기계학습을 통해 화염의 형상을 학습한 인공지능 엔진으로 상기 가시광선 영상을 분석하여 화 재 발생 유무를 분석하는 화염 분석기를 포함하야 구성되고, 상기 화염 분석기는, 화염의 일부 혹은 전체가 도시 된 원시 영상 데이터들을 수집하여 딥러닝용 데이터셋으로 가공하는 떼이터셋 생성부, 상기 딥러닝용 데이터셋을 학습하여 화염의 형상을 검출할 수 있는 인공지능 알고리즘을 준비하고, 상기 화재감시기에서 전송된 가시광선 영상을 상기 인공지능 엔진을 이용하여 분석하고, 화재 발생 여부를 판단하는 화재 판단부를 포함하는 것을 특징 으로 한다."}
{"patent_id": "10-2021-0180005", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 딥 러닝 기반의 화재 감시 시스템에 관한 것이다. 구체적으로, 가시광선 영상으로부터 화재 발생 유 무를 판별하는 정확도와 신속성을 갖출 수 있도록 한 기술이다."}
{"patent_id": "10-2021-0180005", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존에는 가시광선 카메라 혹은 적외선 카메라를 채택한 폐회로 텔레비전(CCTV, Closed Circuit Television) 시 스템 혹은 온도 센서, 및 가스 센서 등을 복합적으로 구성한 센서 기반의 시스템을 이용하여 실시간으로 화재 감시하는 시스템이 전세계적으로 널리 사용되어 왔다. 최근에는 4차 산업혁명을 견인하는 인공지능(AI: Artificial Intelligence), 딥 러닝(Deep Learning), 사물 인 터넷(IoT) 등의 정보통신기술과 영상보안 등의 융합이 열기를 띠고 있다. 이러한 폐회로 텔레비전이 인공지능 기술과 융합된 최근의 화재 감지 기술은, 촬영된 영상을 각각의 프레임으로 디코딩하고, 각각의 프레임별로 이 상 객체를 탐지한다. 다시말해, 현재의 화재 감지시스템은 정확한 화염을 감지하기 위해 수신된 데이터를 디코딩하여 영상으로 만들 고 이를 기반으로 분석하고 있다. 이와 같은 방식의 화재 감시 시스템은 객체, 즉 화염을 검출하는데 많은 영상 데이터를 필요로 한다. 더욱이, 많은 리소스의 사용에도 불구하고, 화염을 인식하는 것은 신뢰도가 낮으며 화염의 특성을 전혀 파악할 수 없는문제를 가지고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제1775463호 (2017.08.31)"}
{"patent_id": "10-2021-0180005", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 화재 검출의 신뢰성과 신속한 검출을 위해 딥 러닝을 위한 데이터셋을 확보하여 화재 검출 알 고리즘을 개선하는 것이다."}
{"patent_id": "10-2021-0180005", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따르는 딥 러닝 기반의 화재 감지 시스템은, 실시간으로 특정 공간의 가시광선 영상을 확보하는 적어도 하나 이상의 화재 감지기 및 관리하는 화재 감지기들로부터 수신된 가시광선 영상을 분석하여 화재발생 여부를 판별하되, 딥 러닝 기반의 기계학습을 통해 화염의 형상을 학습한 인공지능 엔진으로 상기 가 시광선 영상을 분석하여 화재 발생 유무를 분석하는 화염 분석기를 포함하며, 상기 화염 분석기는, 화염의 일부 혹은 전체가 도시된 원시 영상 데이터들을 수집하여 딥 러닝용 데이터셋으로 가공하는 떼이터셋 생성부; 상기 딥 러닝용 데이터셋을 학습하여 화염의 형상을 검출할 수 있는 인공지능 알고리즘을 준비하고, 상기 화재 감시기에서 전송된 가시광선 영상을 상기 인공지능 엔진을 이용하여 분석하고, 화재 발생 여부를 판단하는 화재 판단부를 포함하는 것을 특징으로 한다. 본 발명의 일 실시예에 따르는 상기 데이터셋 생성부는, 화염이 포함된 동영상을 수집하고, 상기 동영상을 구성 하는 적어도 하나 이상의 프레임들을 추출하여 수집한다. 본 발명의 일 실시예에 따르는 상기 데이터셋 생성부는 LabelImg 도구를 사용하여 상기 원시 영상 데이터들에 포함된 화염의 좌표 데이터를 산출하고, 상기 좌표 데이터를 상기 원시 영상 데이터에 기록한다. 본 발명의 일 실시예에 따르는 상기 데이터셋 생성부는, 상기 원시 영상 데이터를 일 방향으로 소정의 각도마다 회전시켜 적어도 둘 이상의 회전 변환 데이터를 생성하고, 상기 회전 각도의 간격은 5°이상 내지 15°이하이다. 본 발명의 일 실시예에 따르는 상기 데이터셋 생성부는, 상기 원시 영상 데이터를 영상의 채도(Saturation), 명 도(Brightness), 노출(Expossure) 혹은 대비(contrast) 중 적어도 어느 하나 이상의 색정보를 변환하여 적어도 둘 이상의 색변환 데이터를 생성한다. 본 발명의 일 실시예에 따르는 상기 데이터셋 생성부는, 채도 혹 노출을 일정하게 유지하고, 명도 혹은 대비를 각각 변환하며 서로 상이한 적어도 둘 이상의 색변환 데이터를 생성한다. 본 발명의 일 실시예에 따르는 상기 데이터셋 생성부는, 수집된 상기 원시 영상 데이터 중에서 기 설정된 해상 도 이상의 원시 영상 데이터만을 딥 러닝용 데이터셋으로 가공하고, 상기 기 설정된 해상도는 가로 픽셀 수 및 세로 픽셀 수가 각각 600 x 600 이상인 것을 특징으로 한다. 본 발명의 일 실시예에 따르는 상기 데이터셋 생성부는, 화염의 색상 혹은 명도 혹은 화염의 형상이 유사하되, 화염이 아닌 것이 도시된 유사 화염 데이터를 수집하여 유사 화염 딥 러닝용 데이터셋을 으로 가공하고, 상기 화재 판단부는 상기 딥 러닝용 데이터셋과 상기 유사 화염 딥 러닝용 데이터셋을 각각 학습하여, 상기 화재감시 기에서 전송된 가시광선 영상에 화염의 유무를 판별할 수 있다. 본 발명의 일 실시예에 따르면, 화염 객체를 검출하기 위한 상기 인공지능 엔진은 YOLOv3 알고리즘을 이용할 수 있다."}
{"patent_id": "10-2021-0180005", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 다양한 데이터셋을 통해 학습된 인공지능 기술을 기반으로 하여 화염을 정확하고 신속하게 검출할 수 있으며, 저해상도에서의 화염의 검출 또한 용이하게 이루어질 수 있는 효과를 기대할 수 있다."}
{"patent_id": "10-2021-0180005", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유사한 기능을 지칭한다."}
{"patent_id": "10-2021-0180005", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하, 도면을 참조하여 본 발명을 실시하기 위한 구체적인 내용을 실시예에 기초하여 설명하도록 하며, 이들 실 시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있는 특정 형상, 구조, 및 특성은 일 실시예에 관련하여 본 발명의 정신 및 범위를 벗어나지 않으면서 다른 실시예로 구현될 수 있다. 따라서 후술하는 상세한 설명은 한정적인 의미로서 취하려는 것이 아니며, 본 발명의 범위는 적절하게 설명된다 면 그 청구항들이 주장하는 것과 균등한 모든 범위와 더불어 첨부된 청구항에 의해서만 한정된다. 본 발명의 일 실시예에 따르는 딥 러닝 기반의 화재 감시 시스템은, 특정 공간에 적어도 하나 이상 배치되는 화 재 감지기 및 상기 재 감지기들로부터 수신된 가시광선 영상을 기반으로 화재 감지기가 감시하 는 공간의 화재발생 여부를 인공지능 엔진을 이용하여 판단하는 화염 분석기를 포함하여 구성된다. 화재 감지기는 소정의 공간의 배치되어 가시광선 대역의 정지 영상 혹은 동영상을 촬영하여 영상신호를 생 성하는 가시광 카메라모듈을 포함한다. 실시하기에 따라, 촬영된 영상과 더불어 더욱 많은 정보를 포함할 수 있 도록 온도 분포를 도출하기 위한 적외선 카메라 모듈, 산소 혹은 이산화탄소의 농도를 검출하기 위한 가스 센서 모듈 등이 더 구비되는 것 또한 고려될 수 있다. 그리고, 화재 감시기는 영상신호를 화염 분석기로 송신하기 위한 통신모듈을 포함한다. 본 발명의 실 시예에 따르면, 영상 신호를 빠르게 송신하기 위해서 화재 감지기는 소정의 통신 케이블을 통해 화염 분석 기와 직접 연결되어 유선 통신하고 있으나, 이에 한정되지는 않으며, 소정의 무선 네트워크 망을 통해 복 수의 화재 감지기들과 화염 분석기가 상호 연결되도록 구성되어 무선 통신을 수행할 수 있다. 화염 분석기는 관리하는 화재 감지기들로부터 수신된 가시광선 영상을 분석하여 화재발생 여부를 판 별하는 구성요소이다. 이때, 딥 러닝 기반의 기계학습을 통해 화염의 형상을 학습한 인공지능 엔진으로 상기 가 시광선 영상을 분석하여 화재 발생 유무를 분석한다. 화염 분석기가 화재발생 여부를 판단하기 위한 개별 적인 기능을 수행하는 프로그래밍된 다수의 모듈을 포함한다. 이하에서는 특정 기능을 수행하는 모듈을 개별적 인 구성요소로 가정하여 순차적으로 설명하도록 한다. 데이터셋 생성부는 화염의 일부 혹은 전체가 도시된 원시 영상 데이터(raw image data)들을 수집하여 딥 러닝용 데이터셋으로 가공한다. 이외에도 데이터셋 생성부는 화재 판단부가 ‘화염’이라는 객체를 인식하고 분류하기 위해서 다양한 영상 데이터를 학습해야한다. 즉, 데이터셋 생성부는 딥 러닝에 최적화 된 데이터셋(data set)을 생성하는 것을 의미한다. 즉, 데이터셋을 생성하기에 앞서 다양한 원시 영상 데이터를 수집한다. 대표적으로 인터넷 상에 공개되어 있는 화염의 포함된 정지 영상이 주 수집 대상이며, 실시하기에 따라, 화염이 포함되어 있는 동영상도 유효한 대상이 될 수 있다. 화염이 포함된 동영상을 수집하는 경우에는, 동영상을 구성하는 적어도 하나 이상의 프레임들을 추 출하여 수집한다. 동영상으로부터 수집된 자료의 경우에는 시시각각 변하는 화염의 형상이나 색에 대한 정보를 확보할 수 있어 유용하다. 가능한 화염과의 관련성이 높고, 명확하게 도시된 영상인 것이 바람직하다. 그 외에도, 도 2에 도시된 바와 같이 데이터셋 생성부는 화염의 색상 혹은 명도 혹은 화염의 형상이 유사 하되, 화염이 아닌 것이 도시된 유사 화염 데이터를 수집한다. 이러한 예로는 네온 사인, 가로등, 차량의 헤드 라이트, 일몰 상황에서의 태양 등이 이에 속한다. 상술한 화염이 아니지만 화염과 유사한 속성을 가진 개체가 포함되어 있는 정지 영상 혹은 동영상을 수집한다. 화염과 유사한 개체에 대해서도 후술할 회전, 해상도 축소, 색정보 변환 등의 가공을 거친 후에 유사 화염 딥 러닝용 데이터셋으로 생성한다. 다만, 데이터셋 생성부는 기 설정된 해상도 이상의 원세 영상 데이터만을 수집하는 것이 바람직하다. 본 발명의 일 실시예에서는 상기 기 설정된 해상도는 가로 픽셀 수 및 세로 픽셀 수가 각각 600 x 600 이상이다. 상기의 기 설정된 해상도 보다 낮은 경우에는 화염 검출의 정확성이 다나 낮아지는 문제가 존재한다. 만약 원시 영상 데이터가 기 설정된 해상도보다 현저히 클 경우에는 원시 영상 데이터의 해상도를 600 x 600 내지 700 x 700의 크기로 축소시키는 것이 바람직하다. 이후, 데이터셋 생성부는 수집한 영상 데이터를 다양한 기법으로 변환하고, 이를 가공하여 딥 러닝용 데이 터셋을 생성한다. 이러한 실시예로 도 3을 참조하면 원시 영상 데이터를 일 방향으로 소정의 각도마다 회전시킴으로써 복수의 회 전 변환 영상 데이터를 생성한다. 이때, 화염 검출의 정확도와 화염 검출까지의 연산속도를 고려하여 최적의 회 전 각도를 결정해야 한다. 본 발명의 실시예에서는 시계 방향으로 15°씩 회전하여 새로 생성함으로써, 1개의 원시 영상 데이터에 대해 총 23개의 회전 변환 영상 데이터를 추가로 생성한다. 실시하기에 따라, 시계 방향으로 각각 90°, 180° 및 270°를 회전 변환하여 하나의 원시 영상 데이터에 대한 3개의 회전 변환 영상 데이터를 생성하는 것도 고려될 수 있다. 다만 이경우에는 화염 검출의 정확도가 15°씩 회전한 것에 비해 떨어지게 된다. 그리고, 데이터셋 생성부는 동일한 원시 영상 데이터에 대해서 채도(Saturation), 명도(Brightness), 노출 (Expossure) 혹은 대비(contrast) 중 적어도 어느 하나 이상의 색정보를 변환하여 적어도 둘 이상의 색변환 데 이터를 생성한다. 본 발명에서 개시되는 실시예에서는, 도 4에 도시된 바와 같이 색조, 채도 및 노출을 일정한 값으로 고정하고, 명도와 대비가 서로 상이한 복수의 색변환 데이터를 생성한다. 한편, 색상(Hue) 혹은 색조(Tone)를 변경하여 색 변환 데이터를 생성하는 경우에는, 화염의 색상과는 다소 차이가 발생하여 화염의 검출의 정확도가 떨어지게 된 다. 그리고 데이터셋 생성부는 LabelImg 도구를 사용하여 원시 영상 데이터들에 포함되어 있는 화염의 좌표 데 이터를 산출하고, 해당 좌표 데이터를 원시 영상 데이터에 소정의 레이블 형태로 기록한다. 이는 데이터셋을 기 반으로 화염의 형상과 밝기 등에 대해 정확하게 학습하여, 화염 검출의 정확성을 높일 수 있다. 본 발명의 일 실시예에 따르면, 도 5에 도시된 바와 같이 화염의 영역이 원시 영상 데이터의 해상도에 비해 1% ~ 10% 이하의 수준으로 현저히 작은 경우에도, 원시 영상 데이터로서 수집한다. 이때, 화염의 영역에 대해 좌표 데이터를 산출하고, 이를 원시 영상 데이터에 기록한다. 이는 인공지능 엔진이 상기의 원시 영상 데이트들이 포함된 딥 러닝용 데이터셋을 학습하면, 화염 감지기 가 획득하는 가시광선 영상의 해상도가 낮은 경우 혹은 화염 감지기가 넓은 화각으로 특정 공간을 가시광선 영상을 획득하는 경우에 대해서도, 화염의 검출능을 확보할 수 있도록 하기 위함이다. 화재 판단부는 상기 딥 러닝용 데이터셋을 학습하여 화염의 형상을 검출할 수 있는 인공지능 알고리즘을 준비하고, 상기 화재감시기에서 전송된 가시광선 영상을 상기 인공지능 엔진을 이용하여 분석하고, 화재 발생 여부를 판단한다. 앞서 설명한 바와 같이, 딥 러닝용 데이터셋과 상기 유사 화염 딥 러닝용 데이터셋을 각각 학 습하여, 화재감시기에서 전송된 가시광선 영상에 화염의 유무를 판별하게 된다. 그리고, 본 발명의 실시예에 따르면, 화염 객체를 검출하기 위한 상기 인공지능 엔진은 YOLOv3 알고리즘을 채택 한다. YOLO(You Only Look Once) 알고리즘은 1-stage detector 알고리즘 중 하나로, 입력된 영상 데이터를 동일한 크 기를 가진 그리드(경계박스)로 분할하고, 분류하고자 하는 객체의 중심이 상기 그리드에 포함되어 있음을 판단 하여, 객체를 탐지한다. 이상과 같이 본 발명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예, 및 도면에 의해 설명 되었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정 되는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정, 및 변형이 가능하다. 따라서 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청구범위 뿐만 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2021-0180005", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 딥 러닝 기반의 화재 감시 시스템의 블록도이다. 도 2는 데이터셋 생성부에서, 화염의 속성(밝기 및 색상)과 유사하되, 화염이 아닌 유사 화염 데이터의 대상이 되는 예시가 도시된 것이다. 도 3은 데이터셋 생성부에서의 원시 영상 데이터의 회전 변환에 대한 일 실시예가 도시된 것이다. 도 4은 데이터셋 생성부에서의 원시 영상 데이터의 색변환에 대한 일 실시예가 도시된 것이다. 도 5는 데이터셋 생성부에서 수집하는 원시 영상 데이터 중, 화염의 영역이 상기 원시 영상 데이터의 해상도에 비해 현저히 적은 예시를 도시한 것이다."}
