{"patent_id": "10-2023-0048788", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0152587", "출원번호": "10-2023-0048788", "발명의 명칭": "고독사 식별 방법 및 이를 수행하는 장치", "출원인": "(주)서홍테크", "발명자": "강현덕"}}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치가 인공지능 모델을 기반으로 모니터링 대상자의 고독사를 식별하는 방법에 있어서,상기 모니터링 대상자에 관한 관리 대상 정보를 획득하는 단계;상기 전자 장치와 연결된 외부 디바이스로부터 압력 분포 데이터를 획득하는 단계;상기 압력 분포 데이터가 입력되면, 상기 관리 대상 정보에 따른 상기 모니터링 대상자 별 자세 추정 정보를 출력하도록 학습된 자세 추정 모델에 상기 압력 분포 데이터를 입력함으로써, 상기 자세 추정 정보를 획득하는 단계;상기 압력 분포 데이터 및 시간 정보가 입력되면, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 출력하도록 학습된 자세 변화 예측 모델에, 상기 압력 분포 데이터 및 상기시간 정보를 입력함으로써, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화예측 정보를 획득하는 단계; 및상기 자세 추정 정보 및 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자에 대한 고독사 사고 또는낙상 사고 중 적어도 하나에 관한 이벤트 발생 여부를 식별하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 방법은,상기 이벤트 발생이 식별되는 경우, 상기 전자 장치와 연결된 다른 전자 장치 또는 서버로 이벤트 알람을 전송하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 관리 대상 정보를 획득하는 단계는,상기 모니터링 대상자의 성별, 체형 또는 관절 각도 중 적어도 하나의 인체 데이터를 획득하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 압력 분포 데이터를 획득하는 단계는,상기 외부 디바이스에 포함된 복수의 압력 센서들에 의해 측정된 각각의 압력값 및 상기 복수의 압력 센서들 각각의 위치 정보를 포함하는 위치값을 획득하는 단계; 및상기 압력값 및 상기 위치값에 기초하여 상기 외부 디바이스에 가해진 압력 분포를 행렬화함으로써, 상기 압력분포 데이터를 획득하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 이벤트 발생 여부를 식별하는 단계는,상기 획득된 자세 추정 정보에 기초하여, 미리 결정된 제1 시간 동안 상기 모니터링 대상자의 자세 고정 여부를식별하는 단계;상기 모니터링 대상자의 자세가 고정된 것으로 식별되는 경우, 상기 획득된 자세 변화 예측 정보에 기초하여,미리 결정된 제2 시간 동안 상기 모니터링 대상자의 자세 변경 가능성을 식별하는 단계; 및상기 모니터링 대상자의 자세 변경 가능성이 식별되지 않는 경우, 상기 고독사 사고에 관한 이벤트가 발생한 것으로 식별하는 단계; 를 포함하는, 방법.공개특허 10-2024-0152587-3-청구항 6 제5항에 있어서, 상기 이벤트 발생 여부를 식별하는 단계는,상기 모니터링 대상자의 자세가 고정된 것으로 식별되는 경우, 상기 고독사 사고에 관한 예비 이벤트가 발생한것으로 식별하는 단계; 를 더 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 이벤트 발생 여부를 식별하는 단계는상기 모니터링 대상자의 자세가 고정되지 않은 것으로 식별되거나, 상기 모니터링 대상자의 자세 변경 가능성이식별되는 경우, 상기 자세 추정 모델로부터 자세 추정 정보를 다시 획득하는 단계; 를 더 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 이벤트 발생 여부를 식별하는 단계는,상기 획득된 자세 추정 정보에 기초하여, 상기 모니터링 대상자의 자세가 넘어진 자세 타입에 해당하는지 여부를 식별하는 단계;상기 모니터링 대상자의 자세가 넘어진 자세 타입으로 식별되는 경우, 상기 자세 변화 예측 정보를 획득함과 함께 상기 모니터링 대상자의 이동 경로 추적 정보를 획득하는 단계; 및소정의 시간 범위 내에, 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자의 자세 변화량이 임계치이상으로 식별되고, 상기 이동 경로 추적 정보에 기초하여 상기 모니터링 대상자가 이동중인 상태로 식별되는경우, 낙상 사고에 관한 이벤트가 발생한 것으로 식별하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 이벤트 발생 여부를 식별하는 단계는,상기 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되거나, 상기 모니터링 대상자가 이동중인 상태로식별되는 경우, 낙상 사고에 관한 예비 이벤트가 발생한 것으로 식별하는 단계; 를 더 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 이벤트 발생 여부를 식별하는 단계는,상기 모니터링 대상자의 자세가 넘어진 자세 타입에 해당하지 않는 것으로 식별되는 경우, 상기 자세 추정 모델로부터 자세 추정 정보를 다시 획득하는 단계; 를 더 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 상기 이벤트 발생 여부를 식별하는 단계는,상기 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되지 않거나, 상기 모니터링 대상자가 이동중인 상태로 식별되지 않는 경우, 상기 자세 추정 모델로부터 자세 추정 정보를 다시 획득하는 단계; 를 더 포함하는,방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 이벤트 발생 여부를 식별하는 단계는,상기 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되는 시점과, 상기 모니터링 대상자가 이동중인 상태로 식별되는 시점의 차이값이 상기 소정의 시간 범위 내에 포함되지 않는 경우, 상기 자세 추정 모델로부터자세 추정 정보를 다시 획득하는 단계; 를 더 포함하는, 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서, 상기 방법은,상기 압력 분포 데이터가 입력되면, 상기 입력된 압력 분포 데이터에 대응되는, 상기 외부 디바이스에 포함된공개특허 10-2024-0152587-4-압력 센서의 위치값에 기초한 상기 모니터링 대상자의 위치 정보 및 상기 위치 정보의 이동 방향 벡터를 출력하는 이동 경로 추적 모델에 상기 압력 분포 데이터를 입력함으로써, 상기 위치 정보 및 상기 이동 방향 벡터를획득하는 단계;상기 위치 정보 및 상기 이동 방향 벡터에 기초하여 상기 모니터링 대상자의 이동 경로를 나타내는 이동 경로추적 정보를 결정하는 단계; 를 포함하는 방법."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "인공지능 모델을 기반으로 모니터링 대상자의 고독사를 식별하는 전자 장치에 있어서,네트워크 인터페이스;하나 이상의 인스트럭션을 저장하는 메모리; 및상기 하나 이상의 인스트럭션을 실행하는 적어도 하나의 프로세서; 를 포함하고,상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써,상기 모니터링 대상자에 관한 관리 대상 정보를 획득하고,상기 전자 장치와 연결된 외부 디바이스로부터 압력 분포 데이터를 획득하고,상기 압력 분포 데이터가 입력되면, 상기 관리 대상 정보에 따른 상기 모니터링 대상자 별 자세 추정 정보를 출력하도록 학습된 자세 추정 모델에 상기 압력 분포 데이터를 입력함으로써, 상기 자세 추정 정보를 획득하고,상기 압력 분포 데이터 및 시간 정보가 입력되면, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 출력하도록 학습된 자세 변화 예측 모델에, 상기 압력 분포 데이터 및 상기시간 정보를 입력함으로써, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화예측 정보를 획득하고,상기 자세 추정 정보 및 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자에 대한 고독사 사고 또는낙상 사고 중 적어도 하나에 관한 이벤트 발생 여부를 식별하는, 전자 장치."}
{"patent_id": "10-2023-0048788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 장치가 인공지능 모델을 기반으로 모니터링 대상자의 고독사를 식별하는 방법에 있어서,상기 모니터링 대상자에 관한 관리 대상 정보를 획득하는 단계;상기 전자 장치와 연결된 외부 디바이스로부터 압력 분포 데이터를 획득하는 단계;상기 압력 분포 데이터가 입력되면, 상기 관리 대상 정보에 따른 상기 모니터링 대상자 별 자세 추정 정보를 출력하도록 학습된 자세 추정 모델에 상기 압력 분포 데이터를 입력함으로써, 상기 자세 추정 정보를 획득하는 단계;상기 압력 분포 데이터 및 시간 정보가 입력되면, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 출력하도록 학습된 자세 변화 예측 모델에, 상기 압력 분포 데이터 및 상기시간 정보를 입력함으로써, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화예측 정보를 획득하는 단계; 및상기 자세 추정 정보 및 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자에 대한 고독사 사고 또는낙상 사고 중 적어도 하나에 관한 이벤트 발생 여부를 식별하는 단계; 를 포함하는, 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록 매체."}
{"patent_id": "10-2023-0048788", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 전자 장치가 인공지능 모델을 기반으로 고독사를 식별하는 방법 및 이를 수행하는 장치에 관한 것이다. 일 실시 예에 의하면, 전자 장치가 인공지능 모델을 기반으로 모니터링 대상자의 고독사를 식별하는 방 법은 상기 모니터링 대상자에 관한 관리 대상 정보를 획득하는 단계; 상기 전자 장치와 연결된 외부 디바이스로 (뒷면에 계속)"}
{"patent_id": "10-2023-0048788", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 고독사 식별 방법 및 이를 수행하는 장치에 관한 것이다. 보다 상세하게는 인공지능 모델을 기반으로 모니터링 대상자의 자세 추정 및 자세 변화 예측 정보에 기초하여 고독사 사고 또는 낙상 사고 중 적어도 하나 의 이벤트 발생 여부를 식별하는 방법 및 이를 수행하는 장치에 관한 것이다."}
{"patent_id": "10-2023-0048788", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "보건복지부에서 발표한 '2022년 고독사 실태조사 결과 발표'에 의하면, 2021년 고독사 사망자 수는 총 3,378명 으로 최근 5년간 증가 추세이고, 고독사 중 가장 많은 비중을 차지하는 연령은 50~60대이며, 연평균 90% 이상은 40대 이상의 중장년 및 노년층에서 발생하고 있다. 또한, 여러 연구 및 통계에 의하면 질병이 많이 발생하는 60대 이상의 고령층 뿐만 아니라, 실직 또는 은퇴로 인한 경제적 빈곤, 가족 관계의 어려움 등이 발생하는 40대 이상의 중장년층까지 전 연령대의 1인 가구에 대한 적극적인 모니터링 시스템이 필요한 실정이다. 현재 정부 및 지방자치단체 등에서 다양한 고독사 예방 사업을 시행 중이며, 고독사에 대한 능동적이고 적극적 인 대응을 위해서 인공지능 기반 기술을 이용하는 등 많은 기술을 적용하고 있지만, 인력 부족으로 인한 지속적 인 확인의 어려움, 법률적 제한, 오작동 등에 의한 부정확한 감지, 고성능 장치 설치 및 유지를 위한 비용 발생 등의 문제가 있다. 따라서, 주거 취약 지역 거주자에 대한 집중적인 모니터링과 전 연령대의 1인 가구에 대한 적극적인 모니터링을 위해 비용이 많이 들지 않으며, 감지의 사각지대가 없고, 정확한 성능을 보장하는 스마트 기술 기반 고독사 감 지 시스템의 개발이 요구되고 있다."}
{"patent_id": "10-2023-0048788", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시 예에 의하면, 고독사를 식별하는 방법 및 이를 수행하는 장치가 제공될 수 있다. 또한 일 실시 예에 의하면, 압력 센서를 포함하는 외부 디바이스와 연동함으로써, 전자 장치가 인공지능 모델을 기반으로 고독사 사고 또는 낙상 사고 중 적어도 하나의 이벤트 발생 여부를 식별하는 방법 및 이를 수행하는 전자 장치가 제공될 수 있다."}
{"patent_id": "10-2023-0048788", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 본 개시의 일 실시 예에 따라, 전자 장치가 인공지능 모델을 기반으로 모 니터링 대상자의 고독사를 식별하는 방법은, 상기 모니터링 대상자에 관한 관리 대상 정보를 획득하는 단계; 상 기 전자 장치와 연결된 외부 디바이스로부터 압력 분포 데이터를 획득하는 단계; 상기 압력 분포 데이터가 입력 되면, 상기 관리 대상 정보에 따른 상기 모니터링 대상자 별 자세 추정 정보를 출력하도록 학습된 자세 추정 모 델에 상기 압력 분포 데이터를 입력함으로써, 상기 자세 추정 정보를 획득하는 단계; 상기 압력 분포 데이터 및 시간 정보가 입력되면, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 출력하도록 학습된 자세 변화 예측 모델에, 상기 압력 분포 데이터 및 상기 시간 정보를 입력함으로써, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 획득하는 단계; 및 상기 자세 추정 정보 및 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자에 대한 고독사 사고 또 는 낙상 사고 중 적어도 하나에 관한 이벤트 발생 여부를 식별하는 단계; 를 포함할 수 있다. 또한, 상기 기술적 과제를 해결하기 위한 본 개시의 또 다른 일 실시 예에 따라, 인공지능 모델을 기반으로 모 니터링 대상자의 고독사를 식별하는 전자 장치에 있어서, 네트워크 인터페이스; 하나 이상의 인스트럭션을 저장 하는 메모리; 및 상기 하나 이상의 인스트럭션을 실행하는 적어도 하나의 프로세서; 를 포함하고, 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 모니터링 대상자에 관한 관리 대상 정보 를 획득하고, 상기 전자 장치와 연결된 외부 디바이스로부터 압력 분포 데이터를 획득하고, 상기 압력 분포 데 이터가 입력되면, 상기 관리 대상 정보에 따른 상기 모니터링 대상자 별 자세 추정 정보를 출력하도록 학습된 자세 추정 모델에 상기 압력 분포 데이터를 입력함으로써, 상기 자세 추정 정보를 획득하고, 상기 압력 분포 데 이터 및 시간 정보가 입력되면, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 출력하도록 학습된 자세 변화 예측 모델에, 상기 압력 분포 데이터 및 상기 시간 정보를 입력 함으로써, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 획득 하고, 상기 자세 추정 정보 및 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자에 대한 고독사 사고 또는 낙상 사고 중 적어도 하나에 관한 이벤트 발생 여부를 식별하는, 전자 장치가 제공될 수 있다. 또한, 상기 기술적 과제를 해결하기 위한 본 개시의 또 다른 실시 예에 따라, 전자 장치가 인공지능 모델을 기 반으로 모니터링 대상자의 고독사를 식별하는 방법에 있어서, 상기 모니터링 대상자에 관한 관리 대상 정보를 획득하는 단계; 상기 전자 장치와 연결된 외부 디바이스로부터 압력 분포 데이터를 획득하는 단계; 상기 압력 분포 데이터가 입력되면, 상기 관리 대상 정보에 따른 상기 모니터링 대상자 별 자세 추정 정보를 출력하도록 학습된 자세 추정 모델에 상기 압력 분포 데이터를 입력함으로써, 상기 자세 추정 정보를 획득하는 단계; 상기 압력 분포 데이터 및 시간 정보가 입력되면, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대 상자의 자세 변화 예측 정보를 출력하도록 학습된 자세 변화 예측 모델에, 상기 압력 분포 데이터 및 상기 시간 정보를 입력함으로써, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 획득하는 단계; 및 상기 자세 추정 정보 및 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자 에 대한 고독사 사고 또는 낙상 사고 중 적어도 하나에 관한 이벤트 발생 여부를 식별하는 단계; 를 포함하는, 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록 매체가 제공될 수 있다."}
{"patent_id": "10-2023-0048788", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시 예에 의하면, 고독사를 식별하는 방법 및 이를 수행하는 장치를 제공함으로써, 전처리 과정 에서 고비용 및 고성능 장치가 필요한 영상, 음성 등의 미디어 데이터 대신 저렴한 압력 센서 데이터를 이용하 여 경제적인 모니터링 시스템을 취약 계층 1인 가구에 제공할 수 있다. 또한, 일 실시 예에 의하면, 압력 데이터를 활용한 인공지능 모델 기반으로 모니터링 대상자의 현재 자세를 추 정하고, 시계열적 모델을 통한 자세 변화 예측을 통해 고독사 또는 낙상 사고를 식별한 경우, 보호자 또는 보호 기관 어플리케이션으로 알람을 송신하여 즉각적인 사고 대응을 할 수 있다."}
{"patent_id": "10-2023-0048788", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였 다. 도 1은 일 실시 예에 따른 전자 장치가 인공지능 모델을 기반으로 모니터링 대상자의 고독사 또는 낙상을 식별 하는 방법을 수행하는 과정을 개략적으로 나타낸 도면이다. 일 실시 예에 의하면, 전자 장치는 인공지능 모델을 이용하여, 외부 디바이스로부터 획득된 압력 분포 데이터를 분석함으로써, 모니터링 대상자의 고독사 또는 낙상 사고를 식별할 수 있다. 예를 들어, 전 자 장치는 복수의 압력 센서들에서 획득된 압력 데이터가 네트워크 인터페이스를 통해 전자 장 치로 전송되면, 복수의 압력 센서들 각각의 압력값 및 복수의 압력 센서들 각각의 위치 정보를 포함하는 위치값을 획득하고, 획득된 압력값 및 위치값을 포함하는 압력 분포 데이터를 자세 추정 모델 및 자세 변화 예측 모델을 이용하여 분석함으로써 고독사 또는 낙상 사고를 식별할 수 있다. 일 실시 예에 의하면, 전자 장치는 보호자, 의료기관 또는 공공기관에서 사용하는 사용자 단말에 설치된 어플리케이션과 연동함으로써, 모니터링 대상자의 고독사 또는 낙상 사고에 관한 이벤트를 보호자, 의료기관 또 는 공공기관에서 사용하는 사용자 단말로 실시간으로 전송할 수 있고, 실시간으로 전송된 정보를 통해 1인 가구 에서 발생되는 고독사 또는 낙상 사고를 예방하거나 조기에 대응할 수 있다. 일 실시 예에 의하면, 전자 장치는 사용자 입력 또는 서버로부터 모니터링 대상자의 관리 대상 정 보를 획득할 수 있고, 획득된 관리 대상 정보는 자세 추정 모델 및 자세 변화 예측 모델 의 인공지능 모델 학습에 파라미터로 사용될 수 있다. 일 실시 예에 의하면, 전자 장치가 이용하는 자세 추정 모델 및 자세 변화 예측 모델은 인공지 능 학습 알고리즘에 기초하여 학습될 수 있는 모델일 수 있다. 일 실시 예에 의하면, 전자 장치가 이용하 는 자세 추정 모델 및 자세 변화 예측 모델은 신경망 모델을 포함할 수 있다. 예를 들어, 신경망 모 델은 인공 신경망(Artificial Neural Network)으로써, 생물학적 신경망에 착안된 컴퓨팅 시스템을 지칭할 수 있 다. 인공 신경망 모델은 미리 정의된 조건에 따라 작업을 수행하는 고전적인 알고리즘과 달리, 다수의 샘플들을 고려함으로써 작업을 수행하는 것을 학습할 수 있다. 일 실시 예에 의하면, 인공 신경망 모델은 인공 뉴런(neuron)들이 연결된 구조를 가질 수 있고, 뉴런들 간의 연 결은 시냅스(synapse)로 지칭될 수 있다. 뉴런은 수신된 신호를 처리할 수 있고, 처리된 신호를 시냅스를 통해 서 다른 뉴런에 전송할 수 있다. 뉴런의 출력은 액티베이션(activation)으로 지칭될 수 있고, 뉴런 및/또는 시 냅스는 변동될 수 있는 가중치(weight)를 가질 수 있고, 가중치에 따라 뉴런에 의해 처리된 신호의 영향력이 증 가하거나 감소할 수 있다. 예를 들어, 신경망 모델은 레이어들 및 상기 레이어들의 연결 강도에 관한 가중치들로 정의되는 복수의 블록들 을 포함할 수 있다. 보다 상세하게는, 신경망 모델은 신경망 모델 내 복수의 신경망 레이어들 각각은 복수의 가 중치들(weight values, weights)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공 신경망의 학습 결과에 의해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델(예컨대 신경망 모델)에서 획득한 손실(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 수정 및 갱신될 수 있다. 본 개시에 따른 전자 장치가 이용하 는 인공지능 모델은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN(Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network), LSTM(Long Short-Term Memory) 모델 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 일 실시 예에 의하면, 전자 장치는 AI 프로그램이 탑재되어 압력 데이터들을 분석할 수 있는 스마트폰, PC, 휴대폰, 랩톱, 미디어 플레이어, 서버, 기타 모바일 또는 비모바일 컴퓨팅 장치일 수 있으나, 이에 제한되 지 않는다. 또한, 일 실시 예에 의하면 외부 디바이스는 바닥재 또는 바닥매트, 상기 바닥재 또는 바닥매 트의 일부에 체결됨으로써 적어도 하나의 압력 데이터를 획득하는 압력 센서들이 체결 가능한 구조이고, 획득된 압력 데이터를 전자 장치로 전송하는 장치일 수 있다. 또한, 일 실시 예에 의하면, 외부 디바이스 는 전도성 섬유 기반 압력 센서를 격자형으로 포함하는 바닥재 형태의 전자 장치일 수 있다. 또한, 일 실시 예에 의하면, 전자 장치는 서버와 연결될 수 있다. 일 실시 예에 의하면, 전자 장치 는 서버와 연동됨으로써, 외부 디바이스로부터 획득된 압력 분포 데이터로부터 모니터 링 대상자의 자세 추정 정보 및 자세 변화 예측 정보를 결정하며, 모니터링 대상자의 자세 추정 정보 및 자세 변화 예측 정보에 기초하여 고독사 또는 낙상 사고 중 적어도 하나에 관한 이벤트를 식별할 수 있다. 일 실시 예에 의하면, 서버는 네트워크를 통하여 전자 장치와 연결됨으로써, 전자 장치와 데 이터를 송수신할 수 있는 기타 컴퓨팅 장치를 포함할 수 있다. 일 실시 예에 의하면, 서버는 근거리 통신 망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN), 부가가치 통신망(Value Added Network; VAN), 이동 통신망(mobile radio communication network), 중 적어도 하나의 조합을 통하여 전자 장치와 연결될 수 있다. 또한, 일 실시 예에 의하면, 서버는 도 1에 도시된 각 네트워크 구성 주체(예컨대 전자 장치 및 서버)가 서로 원활하게 통신을 할 수 있도록 하는 포괄적인 의미의 데이터 통신망이며, 유선 인터넷, 무선 인터넷 및 모바일 무선 통신망 자체를 포함할 수도 있다. 도 2는 일 실시 예에 따른 전자 장치가 인공지능 모델을 기반으로 모니터링 대상자의 고독사 또는 낙상 사고를 식별하는 방법의 흐름도이다. S210에서, 전자 장치는 모니터링 대상자에 관한 관리 대상 정보를 획득할 수 있다. 예를 들어, 전자 장치는 전자 장치에 대한 사용자 입력 또는 서버로부터 모니터링 대상자의 관리 대상 정보를 획득할 수 있다. 일 실시 예에 의하면, 관리 대상 정보는 모니터링 대상자의 성별, 체형, 체중 또는 관절 각도 중 적어도 하나에 관한 인체 데이터를 포함할 수 있으나, 이에 한정되는 것은 아니다. S220에서, 전자 장치는 전자 장치와 연결된 외부 디바이스로부터 압력 분포 데이터를 획득할 수 있다. 일 실시 예에 의하면, 전자 장치는 전자 장치와 연결된 외부 디바이스로부터 복수의 압력 센서들 각각의 압력값 및 복수의 압력 센서들 각각의 위치 정보를 포함하는 위치값을 포함하는 압력 분포 데이터를 획득할 수 있다. S230에서, 전자 장치는 압력 분포 데이터가 입력되면, 관리 대상 정보에 따른 모니터링 대상자 별 자세 추정 정보를 출력하도록 학습된 자세 추정 모델에 압력 분포 데이터를 입력함으로써, 자세 추정 정보를 획득할 수 있다. 일 실시 예에 의하면, 전자 장치는 입력된 압력 분포 데이터 를 분석하여, 모니터링 대상자의 현재 자세를 복수의 타입으로 분류할 수 있다. 예를 들어, 자세 추정 정 보는 압력 분포 데이터가 획득된 시점에서의 모니터링 대상자의 자세를 추정하는 정보이고, 누운 자 세 타입, 걷는 자세 타입, 넘어진 자세 타입 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니며, 모니터링 대상자의 자세를 고유하게 식별할 수 있는 다양한 자세 타입에 대한 정보를 더 포함할 수 있다. S240에서, 전자 장치는 압력 분포 데이터 및 시간 정보가 입력되면, 시간 정보에 대응되 는 시간이 경과한 후의 모니터링 대상자의 자세 변화 예측 정보를 출력하도록 학습된 자세 변화 예측 모델 에 압력 분포 데이터 및 시간 정보를 입력함으로써, 시간 정보에 대응되는 시간이 경과한 후의 모니터링 대상자의 자세 변화 예측 정보를 획득할 수 있다. 일 실시 예에 의하면, 전자 장치는 입력된 압력 분포 데이터 및 시간 정보를 분석하여, 모니터링 대상자의 시간 정보에 대응되는 시간이 경과한 후의 자세를 복수의 타입으로 분류할 수 있다. 예를 들어, 자세 변화 예측 정보는 압력 분 포 데이터가 획득된 시점에서 시간 정보에 대응되는 소정의 시간 이후의 모니터링 대상자의 자세를 예측하는 정보이고, 자세 추정 정보와 마찬가지로 누운 자세 타입, 걷는 자세 타입, 넘어진 자세 타입 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. S250에서, 전자 장치는 자세 추정 정보 및 자세 변화 예측 정보에 기초하여 모니터링 대상자에 대한 고독사 사고 또는 낙상 사고 중 적어도 하나에 관한 이벤트 발생 여부를 식별할 수 있다. 전자 장치(100 0)가 자세 추정 정보 및 자세 변화 예측 정보에 기초하여 모니터링 대상자에 대한 고독사 사고 또는 낙상 사고 발생 여부를 식별하는 구체적인 방법은 도 7 내지 도 8을 참조하여 구체적으로 설명한다. 또한, 도 2에는 도시되지 않았지만, 또 다른 실시 예에 의하면, 전자 장치는 이벤트 발생이 식별되는 경 우, 전자 장치와 연결된 다른 전자 장치 또는 서버로 이벤트 알람을 전송할 수 있다. 예를 들어, 전자 장치는 전자 장치와 연결된 다른 전자 장치로 알람을 전송하면, 다른 전자 장치는 고독사 또는 낙상 알람 서비스를 제공하는 어플리케이션을 자동 실행함으로써, 상기 어플리케이션을 통해 제공되는 인터페이스 상 에서 이벤트 알람을 출력할 수 있다. 또한, 예를 들어, 전자 장치는 서버로 이벤트 알람을 전송함 으로써, 서버와 연동된 의료기관 또는 공공기관의 서버에 실시간으로 이벤트 알람을 전송할 수 있다. 도 3은 일 실시 예에 따른 전자 장치가 외부 디바이스로부터 획득된 압력값 및 위치값에 기초하여 압력 분포 데 이터를 획득하는 과정을 구체적으로 설명하기 위한 흐름도이다. S310에서, 전자 장치는 외부 디바이스에 포함된 복수의 압력 센서들에 의해 측정된 각각의 압 력값 및 복수의 압력 센서들 각각의 위치 정보를 포함하는 위치값을 획득할 수 있다. 일 실시 예에 의하면, 외부 디바이스는 모니터링 대상자의 신체 무게에 따른 압력이 가해졌을 때, 압력 변화량에 따른 저항치 변화를 센싱하고, 저항치 변화에 따른 전압 데이터를 압력 데이터로 획득할 수 있다. 외부 디바이스는 복수의 압력 센서들을 제어하기 위한 프로세서, 프로세서의 동작을 정의하기 위한 하나 이상의 인스트럭션이 저장되는 메모리, 압력 데이터들을 전자 장치로 전송하기 위한 네트워크 인터 페이스를 더 포함할 수도 있다. 일 실시 예에 의하면, 외부 디바이스의 프로세서는 전압 데이터 값 에 기초하여 압력값을 결정하고, 결정된 압력값을 전자 장치로 전송하도록 네트워크 인터페이스를 제어할 수 있다. 일 실시 예에 의하면, 외부 디바이스는 어레이 형태로 배치되는 복수의 압력 센서들을 제어하기 위 한 어레이 센서 제어기를 포함할 수 있다. 일 실시 예에 의하면, 어레이 센서 제어기는 디멀티플렉서, 센서 어 레이, 멀티플렉서, 증폭기, 아날로그 디지털 컨버터 및 디지털 신호 처리기를 포함할 수 있다. 어레이 센서 제 어기 내 각 구성들은 그 명칭으로부터 당업자가 직관적으로 추론할 수 있으므로 구체적인 설명은 생략하기로 한 다. S320에서, 전자 장치는 압력값 및 위치값에 기초하여, 외부 디바이스에 가해진 압력 분포를 행렬화 함으로써, 압력 분포 데이터를 획득할 수 있다. 일 실시 예에 의하면, 전자 장치는 복수의 압력 센 서들 각각의 위치값에 가해진 압력값을 M x N 행렬의 형태로 구성된 압력 분포 데이터를 획득할 수 있다. 예를 들어, 전자 장치는 소정의 주기에 기초하여, 복수의 압력 센서들로부터 압력값 및 위치 값을 획득한 후, 소정의 프레임 간격에 따른 행렬화된 압력 분포 데이터를 획득할 수 있다. 도 4는 일 실시 예에 따른 전자 장치가 자세 추정 모델 및 자세 변화 예측 모델을 학습시키는 과정을 나타내는 도면이다. 도 4를 참조하여, 전자 장치가 자세 추정 모델 및 자세 변화 예측 모델을 포함하는 인공지능 모델을 학습시키는 과정을 설명하기로 한다. 일 실시 예에 의하면, 전자 장치는 관리 대상 정보를 획득하기 전, 외부 디바이스로부터 압력 분포 학습 데이터를 획득할 수 있다. 예를 들어, 전자 장치는 인공지능 모델을 학습시키기 위한 압 력 분포 학습 데이터를 외부 디바이스에 포함된 복수의 압력 센서들로부터 획득할 수 있다. 압 력 분포 학습 데이터는 압력 분포 데이터와 동일하게 압력값 및 위치값을 포함하는 행렬화된 형태로 구성될 수 있다. 또한, 일 실시 예에 의하면, 전자 장치는 압력 분포 학습 데이터를 자세 추정 모델 및 자세 변화 예측 모델에 입력함으로써, 자세 추정 학습 정보 및 자세 변화 예측 학습 정보 를 획득할 수 있다. 일 실시 예에 의하면, 전자 장치는 자세 추정 학습 정보 및 자세 변화 예측 학습 정보가, 실제 모니터링 대상자를 촬영함으로써 획득되는 자세 추정 정보 및 자세 변화 예측 정보와 일치하도록 자세 추정 모델 및 자세 변화 예측 모델의 파라미터 또는 가중치를 수정 및 갱신함으로써, 자세 추정 모델 및 자세 변화예측 모델을 학습시킬 수 있다. 일 실시 예에 의하면, 전자 장치는 자세 추정 모델 및 자세 변화 예측 모델을 학습시키기 위해, 3차원 자세 모델 및 3차원 바닥 모델의 충돌 시뮬레이션을 수행함으로써, 시뮬레이션 압력 분 포 데이터를 획득하며, 시뮬레이션 압력 분포 데이터와 실제 외부 디바이스로부터 획득되는 압력 분 포 학습 데이터가 일치하도록, 3차원 자세 모델 및 3차원 바닥 모델의 파라미터를 수정 및 갱신 함으로써, 3차원 자세 모델 및 3차원 바닥 모델의 학습 과정을 자세 추정 모델 및 자세 변화 예측 모델 학습전 먼저 수행할 수 있다. 일 실시 예에 의하면, 전자 장치는 후술하는 도 5에 기재된 학습 방 법에 따라 학습된 3차원 자세 모델 및 3차원 바닥 모델의 충돌 시뮬레이션을 통해 획득되는 시뮬레이 션 압력 분포 데이터 및 압력 분포 학습 데이터에 기초하여, 자세 추정 모델 및 자세 변화 예측 모델의 파라미터 또는 가중치 중 적어도 하나를 수정 및 갱신할 수 있다. 일 실시 예에 의하면, 전자 장치는 상기 압력 분포 학습 데이터에 더하여 시뮬레이션 압력 분포 데 이터를 함께 이용함으로써, 압력 분포 학습 데이터 및 시뮬레이션 압력 분포 데이터가 입력됨에 따라 자세 추정 모델 및 자세 변화 예측 모델로부터 출력되는 자세 추정 학습 정보 및 자세 변 화 예측 학습 정보가 실제 압력 분포 데이터에 따른 모니터링 대상자의 자세 정보 및 자세 변화 예측 정보 에 일치하도록, 자세 추정 모델 및 자세 변화 예측 모델의 파라미터 또는 가중치 중 적어도 하나를 수정 및 갱신할 수 있다. 도 5는 일 실시 예에 따른 전자 장치가 시뮬레이션 압력 분포 데이터를 획득하는 과정을 설명하기 위한 도면이 다. 일 실시 예에 의하면, 전자 장치는 3차원 자세 모델 및 3차원 바닥 모델의 충돌 시뮬레이션을 수행함으로써, 시뮬레이션 압력 분포 데이터를 결정할 수 있다. 예를 들어, 3차원 자세 모델은 모니 터링 대상자의 관리 대상 정보에 기초하여 SMPL, DART를 포함하는 강체 동역학 모델링으로 결정될 수 있고, 3차원 바닥 모델은 NVIDIA FleX를 포함하는 연체 동역학 모델링으로 결정될 수 있다. 또한, 일 실시 예에 의하면, 3차원 자세 모델 및 3차원 바닥 모델은 복수의 입자(Particle)들이 M X N 행렬의 형태 로 구성될 수 있다. 일 실시 예에 의하면, 전자 장치는 관리 대상 정보에 기초하여 모델링된 3차원 자세 모델 및 외부 디바이스의 형태에 기초하여 모델링된 3차원 바닥 모델을 결정할 수 있다. 또한, 전자 장치 는 3차원 자세 모델 및 3차원 바닥 모델의 충돌 시뮬레이션을 수행함으로써, 모니터링 대상자 의 자세 추정 및 자세 변화 예측을 위한 시뮬레이션 압력 분포 데이터를 결정할 수 있다. 본 개시에 따른 전자 장치는 상기와 같은 방법으로 획득되는 시뮬레이션 압력 분포 데이터를 외부 디바이스로부터 획득되는 압력 분포 학습 데이터와 함께 이용하기 때문에, 압력 분포 데이터를 자세 추정 모델 및 자세 변화 예측 모델에 입력함으로써 식별되는 자세 추정 및 자세 변화 예측 과정 을 보다 정확하게 수행할 수 있다. 도 6은 일 실시 예에 의한 전자 장치가 시뮬레이션 압력 분포 데이터를 결정하는 과정을 구체적으로 설명하기 위한 흐름도이다. 일 실시 예에 의한 전자 장치가 시뮬레이션 압력 분포 데이터를 결정하는 구체적인 과정을 도 9를 참조하여 설명하기로 한다. S610에서, 전자 장치는 3차원 자세 모델을 소정의 높이에서 3차원 바닥 모델로 낙하시키는 소 프트웨어 시뮬레이션을 수행함으로써, 3차원 바닥 모델에서 3차원 자세 모델로 침투하는 침투 벡터 및 질량-스프링-댐퍼(Mass-spring-damper) 모델을 결정할 수 있다. S620에서, 전자 장치는 침투 벡터 및 질량-스프링-댐퍼 모델에 기초하여 힘벡터값을 결정할 수 있다. 예 를 들어, 힘벡터값은 3차원 자세 모델 및 3차원 바닥 모델을 구성하는 입자들 각각에서, 충돌 시뮬레 이션에 의해 발생되는 침투 벡터들의 합으로 결정되는 값을 의미한다. S630에서, 전자 장치는 3차원 자세 모델과 3차원 바닥 모델의 충돌에 의해 발생되는 마찰력을 결정할 수 있다. 일 실시 예에 의하면, 전자 장치는 3차원 자세 모델을 구성하는 각각의 입자와 3차 원 바닥 모델을 구성하는 각각의 입자가 충돌하는 과정에서 마찰 계수, 충돌 속도 값에 기초하여 마찰력을 결정할 수 있다.S640에서, 전자 장치는 결정된 힘벡터값 및 마찰력에 기초하여 3차원 바닥 모델을 구성하는 복수의 입자 각각에 가해지는 압력값을 결정할 수 있다. S650에서, 전자 장치는 결정된 압력값을 복수의 입자 각각의 위치값에 기초하여 행렬화함으로써, 시뮬레 이션 압력 분포 데이터를 결정할 수 있다. 도 7은 일 실시 예에 따른 전자 장치가 자세 추정 정보 및 자세 변화 예측 정보에 기초하여 모니터링 대상자에 대한 고독사 사고에 관한 이벤트 발생 여부를 식별하는 과정을 구체적으로 설명하기 위한 흐름도이다. S710에서, 전자 장치는 획득된 자세 추정 정보에 기초하여, 미리 결정된 제1 시간 동안 모니터링 대 상자의 자세 고정 여부를 식별할 수 있다. 일 실시 예에 의하면, 전자 장치는 미리 결정된 제1 시간 동안 자세 추정 정보가 나타내는 이미지 프레임의 변화량에 기초하여, 모니터링 대상자의 자세 고정 여부를 식 별할 수 있다. 예를 들어, 전자 장치는 자세 추정 정보가 나타내는 이미지 프레임의 변화량의 임계 치를 결정할 수 있고, 미리 결정된 제1 시간 동안 이미지 프레임의 변화량이 임계치를 넘지 않는 경우, 모니터 링 대상자의 자세가 고정되어 있는 것으로 식별할 수 있다. 일 실시 예에 의하면, 이미지 프레임의 변화량은 소정의 간격을 가지는 이미지 프레임들에서 추적 대상체를 구 성하는 픽셀들의 프레임 간의 위치 정보 변화량을 포함할 수 있다. 또한, 도 7에는 도시되지 않았지만, 일 실시 예에 의하면, 전자 장치는 모니터링 대상자에 대한 프레임 이미지들에서, 모니터링 대상자를 나타내는 픽 셀들을 추적하기 위한 객체 추적 모델을 더 이용할 수도 있다. 또한, 일 실시 예에 의하면, 전자 장치는 모니터링 대상자에 대한 이미지 정보가 아니라, 모니터링 대상 자에 대한 압력 분포 데이터에 기초하여 모니터링 대상자의 자세 추정 정보를 결정할 수도 있다. 예 를 들어, 전자 장치는 제1 시간 동안 소정의 간격으로 획득되는 압력 분포 데이터들을 포함하는 압 력 분포 스펙트럼의 변화량을 결정하고, 결정된 변화량이 임계치를 넘는지 여부에 기초하여, 모니터링 대상자의 자세 고정 여부를 식별할 수도 있다. S712에서, 전자 장치는 모니터링 대상자의 자세가 고정된 것으로 식별되는 경우, 고독사 사고에 관한 예 비 이벤트가 발생한 것으로 식별할 수 있다. 일 실시 예에 의하면, 전자 장치는 예비 이벤트가 발생한 것으로 식별한 경우에도, 보호자 어플리케이션 또는 서버를 통한 알람 전송을 통해 고독사 사고를 미연에 방지할 수 있다. 본 개시에 따른 전자 장치는 모니터링 대상자의 자세 추정 정보에 기초하여 바로 고독사 사고 여부 를 식별하는 것이 아니라, 모니터링 대상자의 자세가 고정된 것으로 식별되는 경우, 미리 고독사 예비 이벤트로 결정한 다음, 자세 변화 예측 정보에 따른 자세 변경 가능성을 결정하기 위한 추가 연산을 수행함으로써 고독사 사고 발생 여부를 식별하기 때문에, 낮은 연산 비용으로도 고독사 사고 발생 여부를 효과적으로 식별할 수 있다. S720a에서, 전자 장치는 모니터링 대상자의 자세 변화 예측 정보를 식별한 이후, S720b에서, 전자 장치는 모니터링 대상자의 자세가 고정된 것으로 식별되는 경우, 획득된 자세 변화 예측 정보에 기 초하여, 미리 결정된 제2 시간 동안 모니터링 대상자의 자세 변경 가능성을 식별할 수 있다. 일 실시 예에 의하 면, 전자 장치는 미리 결정된 제2 시간 동안 자세 변화 예측 정보가 나타내는 이미지 프레임의 변화 량에 기초하여, 모니터링 대상자의 자세 변경 가능성을 식별할 수 있다. 예를 들어, 전자 장치는 자세 변 화 예측 정보가 나타내는 이미지 프레임의 변화량의 임계치를 결정할 수 있고, 미리 결정된 제2 시간 동안 이미지 프레임의 변화량이 임계치를 넘지 않는 경우, 모니터링 대상자의 자세 변경 가능성이 없는 것으로 식별 할 수 있다. 또 다른 실시 예에 의하면, 전자 장치는 미리 결정된 제2 시간 동안 자세 변화 예측 정보가 나타내 는 압력 분포 데이터들을 포함하는 압력 분포 스펙트럼의 변화량에 기초하여, 모니터링 대상자의 자세 변 경 가능성을 식별할 수도 있다. 일 실시 예에 의하면 압력 분포 스펙트럼은 압력 분포 데이터들 및 각 압 력 분포 데이터 값이 식별되는 위치 값을 포함할 수 있다. S722에서, 전자 장치는 모니터링 대상자의 자세가 고정되지 않는 것으로 식별되거나, 모니터링 대상자의 자세 변경 가능성이 식별되는 경우, 자세 추정 모델로부터 자세 추정 정보를 다시 획득할 수 있다. 일 실시 예에 의하면, 전자 장치는 모니터링 대상자의 자세가 고정되어 있지 않거나, 자세 변경 가능성이 존재한다고 식별하는 경우, 고독사 사고의 위험이 없는 것으로 결정하고 자세 추정 모델로부터 자세 추정정보를 다시 획득할 수 있다. S730에서, 전자 장치는 모니터링 대상자의 자세 변경 가능성이 식별되지 않는 경우, 고독사 사고에 관한 이벤트가 발생한 것으로 식별할 수 있다. 일 실시 예에 의하면, 전자 장치는 모니터링 대상자의 자세가 미리 결정된 제1 시간 동안 고정되어 있다고 식별한 후, 미리 결정된 제2 시간 동안 자세 변경 가능성이 식별되 지 않는 경우, 모니터링 대상자의 고독사 사고에 관한 이벤트가 발생한 것으로 식별할 수 있다. 도 8은 일 실시 예에 따른 전자 장치가 자세 추정 정보 및 자세 변화 예측 정보에 기초하여 모니터링 대상자에 대한 낙상 사고에 관한 이벤트 발생 여부를 식별하는 과정을 구체적으로 설명하기 위한 흐름도이다. S810에서, 전자 장치는 획득된 자세 추정 정보에 기초하여, 모니터링 대상자의 자세가 넘어진 자세 타입에 해당하는지 여부를 식별할 수 있다. 일 실시 예에 의하면, 전자 장치는 획득된 자세 추정 정보 가 나타내는 이미지를 분석함으로써, 누운 자세 타입, 걷는 자세 타입 또는 넘어진 자세 타입 중 적어도 하나로 결정할 수 있으며, 결정된 자세 타입이 넘어진 자세 타입에 해당하는 경우 모니터링 대상자가 넘어진 것으로 식별할 수 있다. 일 실시 예에 의하면, 전자 장치는 자세 추정 모델로부터 자세 추정 정보를 획득할 수 있다. 일 실시 예에 의하면, 전자 장치가 이용하는 자세 추정 모델은 POSE ESTIMATION을 수행하는 POSENET 모델일 수 있다. 예를 들어, 전자 장치는 프레임 이미지상 특징점의 변화 패턴 정보가 입력되면, 모니터링 대상자의 자세 정보를 출력하는 자세 추정 모델을 이용하여, 모니터링 대상자의 자세 정보를 식 별할 수 있다. 일 실시 예에 의하면, 전자 장치가 이용하는 자세 추정 모델은 모니터링 대상자의 신체 특징을 나타 내는 특징점들을 대상자에 대한 영상으로부터 추출하고, 추출된 특징점들에 기초하여 모니터링 대상자의 포즈들 의 신뢰점수를 결정하며, 결정된 신뢰점수에 기초하여, 소정의 자세(POSE) 정보를 출력하도록 미리 학습되는 신 경망 모델일 수 있다. S812에서, 전자 장치는 모니터링 대상자의 자세가 넘어진 자세 타입에 해당하지 않는 것으로 식별되는 경 우, 자세 추정 모델로부터 자세 추정 정보를 다시 획득할 수 있다. 일 실시 예에 의하면, 전자 장치 는 모니터링 대상자의 자세가 넘어진 자세 타입에 해당하지 않는 것으로 식별되는 경우, 낙상 사고의 위 험이 없는 것으로 결정하고 자세 추정 모델로부터 자세 추정 정보를 다시 획득할 수 있다. S820에서, 전자 장치는 모니터링 대상자의 자세가 넘어진 자세 타입으로 식별되는 경우, 자세 변화 예측 정보를 획득함과 동시에 모니터링 대상자의 이동 경로 추적 정보를 획득할 수 있다. 일 실시 예에 의 하면, 전자 장치는 획득된 자세 변화 예측 정보에 기초하여 모니터링 대상자의 자세 변화량을 식별 할 수 있고, 획득된 이동 경로 추적 정보에 기초하여 모니터링 대상자가 이동중인지 여부를 식별할 수 있 다. S822에서, 전자 장치는 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되거나, 모니터링 대상자 가 이동중인 상태로 식별되는 경우, 낙상 사고에 관한 예비 이벤트가 발생한 것으로 식별할 수 있다. 일 실시 예에 의하면, 전자 장치는 자세 변화 예측 정보가 나타내는 이미지 프레임의 각 픽셀의 위 치 변화량을 식별할 수 있고, 각 픽셀의 위치 변화량이 미리 결정된 임계치 이상으로 식별되는 경우, 모니터링 대상자가 낙상 사고의 위험이 있는 것으로 식별할 수 있다. 또한, 일 실시 예에 의하면, 전자 장치는 모니터링 대상자의 이동 경로를 추적하는 이동 경로 추적 모델 로부터 획득된 이동 경로 추적 정보를 분석함으로써, 모니터링 대상자가 이동중인지 여부를 식별할 수 있다. 전자 장치가 이동 경로 추적 모델로부터 이동 경로 추적 정보를 획득하는 과정은 도 6을 참조하여 구체적으로 설명하기로 한다. S824에서, 전자 장치는 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되지 않거나, 모니터링 대 상자가 이동중인 상태로 식별되지 않는 경우, 자세 추정 모델로부터 자세 추정 정보를 다시 획득할 수 있다. 일 실시 예에 의하면, 전자 장치는 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되지 않는 경우, 모니터링 대상자가 낙상 사고의 위험이 없는 것으로 결정할 수 있다. 또 다른 일 실시 예에 의하면, 전자 장치는 모니터링 대상자가 이동중이 상태로 식별되지 않는 경우, 모니터링 대상자가 낙상 사고의 위 험이 없는 것으로 결정할 수 있다. S830에서, 전자 장치는 소정의 시간 범위 내에, 자세 변화 예측 정보에 기초하여 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되고, 이동 경로 추적 정보에 기초하여 모니터링 대상자가 이동중인 상태로 식별되는 경우, 낙상 사고에 관한 이벤트가 발생한 것으로 식별할 수 있다. 일 실시 예에 의하면, 전자 장치는 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되는 시점과 모니터링 대상자가 이동중인 상태로 식별되는 시점의 차이값이 소정의 시간 범위 내에 포함되는 경우, 낙상 사고에 관한 이벤트가 발생한 것으로 식별할 수 있다. 또 다른 실시 예에 의하면, 전자 장치는 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되는 조 건과, 모니터링 대상자가 이동중인 상태로 식별되는 조건이 동시에 만족되는 경우, 낙상 사고에 관한 이벤트가 발생한 것으로 식별할 수도 있다. S832에서, 전자 장치는 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되는 시점과, 모니터링 대 상자가 이동중인 상태로 식별되는 시점의 차이값이 소정의 시간 범위 내에 포함되지 않는 경우, 자세 추정 모델 로부터 자세 추정 정보를 다시 획득할 수 있다. 또 다른 실시 예에 의하면, 전자 장치는 모니 터링 대상자의 자세 변화량이 임계치 이상으로 식별되는 조건과, 모니터링 대상자가 이동중인 상태로 식별되는 조건이 동시에 만족되지 않는 경우 자세 추정 모델로부터 자세 추정 정보를 다시 획득할 수도 있다. 도 9는 일 실시 예에 따른 전자 장치가 이동 경로 추적 모델을 이용하여 이동 경로 추적 정보를 획득하는 과정 을 나타내는 도면이다. 일 실시 예에 의하면, 전자 장치는 압력 분포 데이터가 입력되면, 입력된 압력 분포 데이터에 대응되는, 외부 디바이스에 포함된 압력 센서의 위치값에 기초한 모니터링 대상자의 위치 정보 및 위 치 정보의 이동 방향 벡터를 출력하는 이동 경로 추적 모델에 압력 분포 데이터를 입력함 으로써, 위치 정보 및 이동 방향 벡터를 획득할 수 있다. 또한, 일 실시 예에 의하면, 전자 장치 는 위치 정보 및 이동 방향 벡터에 기초하여 상기 모니터링 대상자의 이동 경로를 나타내는 이 동 경로 추적 정보를 결정할 수 있다. 일 실시 예에 의하면, 전자 장치는 도 4를 참조하여 기술한 자세 추정 모델 및 자세 변화 예측 모델 을 학습시키는 방법으로 이동 경로 추적 모델을 학습시킬 수 있다. 또한, 일 실시 예에 의하면, 자세 변화 예측 모델 및 이동 경로 추적 모델은 모니터링 대상자의 시간 변화에 따른 자세 변화 예측 정보 및 이동 경로 추적 정보를 획득하기 위해, LSTM 과 같은 시계열 딥 러닝 모델을 이용할 수 있으나, 이에 한정되지는 않는다. 도 10은 일 실시 예에 따른 전자 장치의 블록도이다. 일 실시 예에 의하면, 전자 장치는 프로세서, 네트워크 인터페이스 및 메모리를 포함 할 수 있다. 그러나 도시된 구성 요소가 모두 필수 구성요소인 것은 아니다. 도시된 구성 요소보다 많은 구성 요소에 의해 전자 장치가 구현될 수도 있고, 그 보다 적은 구성 요소에 의해서도 전자 장치가 구현 될 수도 있다. 일 실시 예에 의하면, 사용자 입력 인터페이스는, 사용자가 전자 장치를 제어하기 위한 시퀀스를 입력하는 수단을 의미한다. 예를 들어, 사용자 입력 인터페이스에는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 조그 휠, 조그 스위치 등이 있을 수 있으나 이에 한정되는 것은 아니다. 사용자 입력 인터페이스는 전자 장치가 디스플레이 상에 출력한 화면에 대한 사용자의 입 력 시퀀스를 수신할 수 있다. 또한, 사용자 입력 인터페이스는 디스플레이를 터치하는 사용자의 터치 입 력 또는 디스플레이상 그래픽 사용자 인터페이스를 통한 키 입력을 수신할 수도 있다. 프로세서는, 통상적으로 전자 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 메 모리에 저장된 프로그램들을 실행함으로써, 사용자 입력 인터페이스, 네트워크 인터페이스, 메모리 등을 전반적으로 제어할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 모니터링 대상자에 관한 관리 대상 정보를 획득하고, 상기 전자 장치와 연결된 외부 디바이스로부터 압력 분포 데이터를 획득하고, 상기 압력 분포 데이터가 입력되면, 관리 대 상 정보에 따른 상기 모니터링 대상자 별 자세 추정 정보를 출력하도록 학습된 자세 추정 모델에 상기 압력 분 포 데이터를 입력함으로써, 상기 자세 추정 정보를 획득하고, 상기 압력 분포 데이터 및 시간 정보가 입력되면, 상기 시간 정보에 대응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 출력하도록 학습된 자세 변화 예측 모델에, 상기 압력 분포 데이터 및 상기 시간 정보를 입력함으로써, 상기 시간 정보에 대 응되는 시간이 경과한 후의 상기 모니터링 대상자의 자세 변화 예측 정보를 획득하고, 상기 자세 추정 정보 및 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자에 대한 고독사 사고 또는 낙상 사고 중 적어도 하 나에 관한 이벤트 발생 여부를 식별할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 이벤트 발생이 식별되는 경우, 상기 전자 장치와 연결된 다른 전 자 장치 또는 서버로 이벤트 알람을 전송할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 모니터링 대상자의 성별, 체형 또는 관절 각도 중 적어도 하나의 인체 데이터를 획득할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 외부 디바이스에 포함된 복수의 압력 센서들에 의해 측정된 각각 의 압력값 및 상기 복수의 압력 센서들 각각의 위치 정보를 포함하는 위치값을 획득하고, 상기 압력값 및 상기 위치값에 기초하여 상기 외부 디바이스에 가해진 압력 분포를 행렬화함으로써, 상기 압력 분포 데이터를 획득할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 관리 대상 정보를 획득하는 단계 이전, 상기 외부 디바이스로부터 압력 분포 학습 데이터를 획득하고, 3차원 자세 모델 및 3차원 바닥 모델의 충돌 시뮬레이션을 수행함으로써, 시뮬레이션 압력 분포 데이터를 결정하고, 상기 획득된 압력 분포 학습 데이터 및 상기 결정된 시뮬레이션 압력 분포 데이터의 비교결과에 기초하여, 상기 자세 추정 모델 및 상기 자세 변화 예측 모델을 학습시킬 수 있다. 일 실시 예에 의하면, 프로세서는 상기 관리 대상 정보에 기초하여 모델링된 상기 3차원 자세 모델 및 상 기 외부 디바이스의 형태에 기초하여 모델링된 상기 3차원 바닥 모델을 결정하고, 상기 3차원 자세 모델 및 상 기 3차원 바닥 모델의 충돌 시뮬레이션을 수행함으로써, 상기 모니터링 대상자의 자세 추정 및 자세 변화 예측 을 위한 시뮬레이션 압력 분포 데이터를 결정할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 3차원 자세 모델을 소정의 높이에서 상기 3차원 바닥 모델로 낙하 시키는 소프트웨어 시뮬레이션을 수행함으로써, 상기 3차원 바닥 모델에서 상기 3차원 자세 모델로 침투하는 침 투 벡터 및 질량-스프링-댐퍼 모델을 결정하고, 상기 침투 벡터 및 상기 질량-스프링-댐퍼 모델에 기초하여 힘 벡터값을 결정하고, 상기 3차원 자세 모델과 상기 3차원 바닥 모델의 충돌에 의해 발생되는 마찰력을 결정하고, 상기 힘벡터값 및 상기 마찰력에 기초하여 상기 3차원 바닥 모델을 구성하는 복수의 입자 각각에 가해지는 압력 값을 결정하고, 상기 결정된 압력값을 행렬화함으로써 시뮬레이션 압력 분포 데이터를 결정할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 획득된 자세 추정 정보에 기초하여, 미리 결정된 제1 시간 동안 상기 모니터링 대상자의 자세 고정 여부를 식별하고, 상기 모니터링 대상자의 자세가 고정된 것으로 식별되는 경우, 상기 획득된 자세 변화 예측 정보에 기초하여, 미리 결정된 제2 시간 동안 상기 모니터링 대상자의 자세 변경 가능성을 식별하고, 상기 모니터링 대상자의 자세 변경 가능성이 식별되지 않는 경우, 상기 고독사 사고에 관한 이벤트가 발생한 것으로 식별할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 모니터링 대상자의 자세가 고정된 것으로 식별되는 경우, 상기 고 독사 사고에 관한 예비 이벤트가 발생한 것으로 식별할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 모니터링 대상자의 자세가 고정되지 않은 것으로 식별되거나, 상 기 모니터링 대상자의 자세 변경 가능성이 식별되는 경우, 상기 자세 추정 모델로부터 자세 추정 정보를 다시 획득할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 획득된 자세 추정 정보에 기초하여, 상기 모니터링 대상자의 자세 가 넘어진 자세 타입에 해당하는지 여부를 식별하고, 상기 모니터링 대상자의 자세가 넘어진 자세 타입으로 식 별되는 경우, 상기 자세 변화 예측 정보를 획득함과 함께 상기 모니터링 대상자의 이동 경로 추적 정보를 획득 하고, 소정의 시간 범위 내에, 상기 자세 변화 예측 정보에 기초하여 상기 모니터링 대상자의 자세 변화량이 임 계치 이상으로 식별되고, 상기 이동 경로 추적 정보에 기초하여 상기 모니터링 대상자가 이동중인 상태로 식별 되는 경우, 낙상 사고에 관한 이벤트가 발생한 것으로 식별할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되거나, 상기 모니터링 대상자가 이동중인 상태로 식별되는 경우, 낙상 사고에 관한 예비 이벤트가 발생한 것으로 식별 할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 모니터링 대상자의 자세가 넘어진 자세 타입에 해당하지 않는 것으로 식별되는 경우, 상기 자세 추정 모델로부터 자세 추정 정보를 다시 획득할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되지 않거 나, 상기 모니터링 대상자가 이동중인 상태로 식별되지 않는 경우, 상기 자세 추정 모델로부터 자세 추정 정보 를 다시 획득할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 모니터링 대상자의 자세 변화량이 임계치 이상으로 식별되는 시점 과, 상기 모니터링 대상자가 이동중인 상태로 식별되는 시점의 차이값이 상기 소정의 시간 범위 내에 포함되지 않는 경우, 상기 자세 추정 모델로부터 자세 추정 정보를 다시 획득할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 압력 분포 데이터가 입력되면, 상기 입력된 압력 분포 데이터에 대응되는, 상기 외부 디바이스에 포함된 압력 센서의 위치값에 기초한 상기 모니터링 대상자의 위치 정보 및 상 기 위치 정보의 이동 방향 벡터를 출력하는 이동 경로 추적 모델에 상기 압력 분포 데이터를 입력함으로써, 상 기 위치 정보 및 상기 이동 방향 벡터를 획득하고, 상기 위치 정보 및 상기 이동 방향 벡터에 기초하여 상기 모 니터링 대상자의 이동 경로를 나타내는 이동 경로 추적 정보를 결정할 수 있다. 일 실시 예에 의하면, 전자 장치는 전자 장치가 다른 장치(미도시) 및 서버와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 다른 장치(미도시)는 전자 장치와 같은 컴퓨팅 장치이거나, 센싱 장치일 수 있으나, 이에 제한되지 않는다. 예를 들어, 네트워크 인터페이스는 근거리 통신부(미도시) 또는 원거리 통신부(미도시)를 포함할 수 있다. 근거리 통신부(short-range wireless communication unit)는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통 신부, 근거리 무선 통신부(Near Field Communication unit), WLAN(와이파이) 통신부, 지그비(Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 원거리 통신부는 이동 통신부 또는 방송 수신부를 포함할 수 있다. 예를 들어, 이동 통신부는 이동 통신망 상에 서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여기에서, 무선 신호는, 음성 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태의 데이터를 포함할 수 있다. 방송 수신부는, 방송 채널을 통하여 외부로부터 방송 신호 및/또는 방송 관련된 정보를 수신한다. 방송 채널은 위성 채널, 지상파 채널을 포함할 수 있다. 구현 예에 따라서 전자 장치가 방송 수신부(미도시)를 포함하지 않 을 수도 있음은 물론이다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 전자 장치로 입력되 거나 전자 장치로부터 출력되는 데이터를 저장할 수도 있다. 또한, 메모리는 전자 장치가 이용하는 인공 지능 모델에 대한 정보를 저장할 수도 있다. 일 실시 예에 의하면, 메모리는 전자 장치 가 인공 지능 모델을 학습시키는데 이용하는 학습 데이터 정보를 더 저장할 수도 있고, 인공 지능 모델에 대한 파라미터 정보를 더 저장할 수도 있다. 예를 들어, 메모리는 학습된 신경망뿐만 아니라, 이미 생성된 신경망에 기초한 모델들이 수정되는 경우, 수정된 모델들의 레이어들, 레이어들 간의 가중치에 관한 정보를 더 저장할 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 도 11은 일 실시 예에 따른 서버의 블록도이다. 서버는 네트워크 인터페이스, 데이터 베이스 및 프로세서를 포함할 수 있다. 네트워크 인터페이스는 도 10 에 도시된 전자 장치의 네트워크 인터페이스에 대응될 수 있다. 예를 들 어, 네트워크 인터페이스는 전자 장치로부터 적어도 하나의 압력 센서로부터 획득된 데이터들, 고독사 또는 낙상 사고에 관한 이벤트에 대한 정보들을 획득할 수 있다. 프로세서는 통상적으로 서버의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 서버 의 DB에 저장된 프로그램들을 실행함으로써, DB 및 네트워크 인터페이스 등을 전반적 으로 제어할 수 있다. 또한, 프로세서는 DB에 저장된 프로그램들을 실행함으로써, 도 1 내지 도 10에서의 전자 장치의 동작의 일부 또는 전부를 수행할 수 있다. 데이터 베이스는 도 10에 도시된 전자 장치의 메모리에 대응될 수 있다. 예를 들어, 데이터 베이스는 전자 장치로부터 수신된 학습 데이터, 상기 학습 데이터에 기초하여 학습되는 인공 지능 모델에 대한 정보(예컨대 신경망 모델 레이어들 및 상기 레이어들의 연결 강도에 관한 가중치 값들)들을 저장할 수도 있다. 도 12는 일 실시 예에 따른 고독사 또는 낙상 사고를 식별하는 시스템을 개략적으로 나타낸 도면이다. 일 실시 예에 의하면, 인공지능 기반 고독사 식별 시스템은 전자 장치, 서버, 외부 디바이스 , 사용자 단말을 포함할 수 있으나, 이에 한정되는 것은 아니며 고독사 식별 시스템의 동작에 필요한 추가 구성요소를 포함할 수 있으며, 더 적은 구성요소를 포함할 수도 있다. 도 12에 도시된 과정들은 고독사 식별 시스템에 의해 수행될 수도 있으나, 전자 장치에 의해서도 수 행될 수 있음은 물론이다. 일 실시 예에 의하면, 전자 장치는 고독사 식별 시스템내 장치의 전반적인 동작을 제어할 수 있다. 예를 들어, 전자 장치는 전자 장치와 연결된 서버 및 외부 디바이스의 동작을 제어함으로써, 모니터링 대상자의 고독사 또는 낙상 사고를 식별하는 과정을 수행할 수 있다. 일 실시 예에 의하면, 전자 장치는 고독사 또는 낙상 사고에 관한 이벤트 알람을 모니터링 대상자의 보호 자가 사용하는 사용자 단말로 실시간으로 전송할 수 있고, 사용자 단말을 사용하는 보호자는 전송 된 이벤트 알람을 통해 모니터링 대상자의 고독사 또는 낙상 사고의 위험을 빠르게 인지할 수 있다. 일 실시 예에 의하면, 전자 장치는 외부 디바이스로부터 압력 분포 데이터를 획득하고, 획득 된 압력 분포 데이터를 학습된 자세 추정 모델, 자세 변화 예측 모델 또는 이동 경로 추적 모델 중 적어도 하나의 인공지능 모델에 입력함으로써, 모니터링 대상자의 자세 추정 정보, 자세 변화 예 측 정보 또는 이동 경로 추적 정보 중 적어도 하나의 모니터링 정보를 획득할 수 있다. 또한, 일 실시 예에 의하면, 전자 장치는 획득된 모니터링 정보를 도 7 내지 도 8을 참조하여 설명한 고 독사 또는 낙상 사고 알고리즘을 통해 고독사 또는 낙상 사고 이벤트를 식별함으로써, 외부 서버 또는 다른 전 자 장치로 이벤트 알람을 전송할 수 있다. 본 개시에 따른 고독사 또는 낙상 사고를 식별하는 전자 장치를 포함하는 시스템은, 전처리 과정에서 고 비용 및 고성능 장치가 필요한 영상, 음성 등의 미디어 데이터 대신 저렴한 압력 센서 데이터를 이용하여, 경제 적인 모니터링 시스템을 취약 계층 1인 가구에 제공할 수 있다. 일 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 개시를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 또한, 상기 일 실시 예에 다른 방법을 수행하도록 하는 프로그램이 저장된 기록매체를 포함하는 컴퓨터 프로그 램 장치가 제공될 수 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프 와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행 될 수 있는 고급 언어 코드를 포함한다. 이상에서 본 개시의 실시예에 대하여 상세하게 설명하였지만 본 개시의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 개시의 기본 개념을 이용한 당업 자의 여러 변형 및 개량 형태 또한 본 개시의 권리범위에 속한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2023-0048788", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 전자 장치가 인공지능 모델을 기반으로 모니터링 대상자의 고독사 또는 낙상을 식별 하는 방법을 수행하는 과정을 개략적으로 나타낸 도면이다. 도 2는 일 실시 예에 따른 전자 장치가 인공지능 모델을 기반으로 모니터링 대상자의 고독사 또는 낙상 사고를 식별하는 방법의 흐름도이다. 도 3은 일 실시 예에 따른 전자 장치가 외부 디바이스로부터 획득된 압력값 및 위치값에 기초하여 압력 분포 데 이터를 획득하는 과정을 구체적으로 설명하기 위한 흐름도이다. 도 4는 일 실시 예에 따른 전자 장치가 자세 추정 모델 및 자세 변화 예측 모델을 학습시키는 과정을 나타내는 도면이다. 도 5는 일 실시 예에 따른 전자 장치가 시뮬레이션 압력 분포 데이터를 획득하는 과정을 설명하기 위한 도면이 다. 도 6은 일 실시 예에 의한 전자 장치가 시뮬레이션 압력 분포 데이터를 결정하는 과정을 구체적으로 설명하기 위한 흐름도이다. 도 7은 일 실시 예에 따른 전자 장치가 자세 추정 정보 및 자세 변화 예측 정보에 기초하여 모니터링 대상자에 대한 고독사 사고에 관한 이벤트 발생 여부를 식별하는 과정을 구체적으로 설명하기 위한 흐름도이다. 도 8은 일 실시 예에 따른 전자 장치가 자세 추정 정보 및 자세 변화 예측 정보에 기초하여 모니터링 대상자에 대한 낙상 사고에 관한 이벤트 발생 여부를 식별하는 과정을 구체적으로 설명하기 위한 흐름도이다. 도 9는 일 실시 예에 따른 전자 장치가 이동 경로 추적 모델을 이용하여 이동 경로 추적 정보를 획득하는 과정 을 나타내는 도면이다. 도 10은 일 실시 예에 따른 전자 장치의 블록도이다. 도 11은 일 실시 예에 따른 서버의 블록도이다. 도 12는 일 실시 예에 따른 고독사 또는 낙상 사고를 식별하는 시스템을 개략적으로 나타낸 도면이다."}
