{"patent_id": "10-2021-0146767", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0063922", "출원번호": "10-2021-0146767", "발명의 명칭": "직기 장치 및 직기 장치의 제어방법", "출원인": "주식회사 러닝비전", "발명자": "이광준"}}
{"patent_id": "10-2021-0146767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "위사(緯絲) 및 경사(經絲)를 이용하여 직물을 짜는 제1직기부; 상기 제1직기부에서 짜지는 직물의 결함을 검출하는 결함 검출부; 상기 제1직기부의 작동 정보를 생성하여 모니터링하며, 상기 결함 걸출부가 직물의 결함을 검출하면, 상기 제1직기부의 작동 정보 중 상기 결함이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를 추출하여 관리대상 정보를 생성하는 모니터링부; 그리고 상기 결함 검출부로부터 직물의 결함 정보를 입력받고, 상기 모니터링부로부터 상기 관리 대상 정보를 입력받아학습 모델을 생성하고 인공지능 학습하여 결함을 종류별로 분류하고, 상기 관리 대상 정보를 기초로 각 결함 발생을 방지하기 위한 관리값을 생성하는 학습부를 포함하며, 상기 모니터링부는 상기 제1직기부와 동일한 복수 개의 제2직기부의 작동 정보를 더 생성하여 모니터링하며, 상기 모니터링부가 상기 제2직기부의 작동 정보 중 상기 관리값을 벗어나는 작동 정보를 모니터링하면, 상기 제2직기부가 상기 관리값을 벗어나 작동되지 않도록 상기 제2직기부의 작동을 제어하는 제어부를 포함하는 것을특징으로 하는 직기 장치."}
{"patent_id": "10-2021-0146767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 관리값은 상기 위사의 토출 압력값, 상기 경사의 장력값 및 짜진 직물의 이송 속도값을 포함하는 것을 특징으로 하는 직기 장치."}
{"patent_id": "10-2021-0146767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 관리값은 범위값인 것을 특징으로 하는 직기 장치."}
{"patent_id": "10-2021-0146767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 결함 검출부는 상기 제2직기부에서 짜지는 직물의 결함을 더 검출하고, 상기 결함 검출부가 상기 제2직기부에서 짜지는 직물의 결함을 검출하면, 상기 모니터링부는 상기 제2직기부의작동 정보 중 상기 결함이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를 추출하여 관리 대상 정보를 추가 생성하며, 상기 학습부는 상기 직물의 결함 및 추가 생성된 상기 관리 대상 정보를 상기 학습 모델에 포함시키고 인공지능학습하여 직물의 결함 및 이에 대응되는 관리값을 갱신하는 것을 특징으로 하는 직기 장치."}
{"patent_id": "10-2021-0146767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "결함 검출부가 위사(緯絲) 및 경사(經絲)를 이용하여 직물을 짜는 제1직기부에서 짜지는 직물의 결함을 검출하는 결함 검출 단계; 모니터링부가 상기 제1직기부의 작동 정보를 생성하여 모니터링하다가, 상기 결함 걸출부가 직물의 결함을 검출하면, 상기 제1직기부의 작동 정보 중 상기 결함이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를추출하여 관리 대상 정보를 생성하는 관리 대상 정보 생성단계; 공개특허 10-2023-0063922-3-학습부가 상기 결함 검출부로부터 직물의 결함 정보를 입력받고, 상기 모니터링부로부터 상기 관리 대상 정보를입력받아 학습 모델을 생성하고 인공지능 학습하여 결함을 종류별로 분류하고, 상기 관리 대상 정보를 기초로각 결함 발생을 방지하기 위한 관리값을 생성하는 관리값 생성단계; 상기 모니터링부가 상기 제1직기부와 동일한 복수 개의 제2직기부의 작동 정보를 생성하여 모니터링하는 모니터링 단계; 그리고 상기 모니터링부가 상기 제2직기부의 작동 정보 중 상기 관리값을 벗어나는 작동 정보를 모니터링하면, 상기 제2직기부가 상기 관리값을 벗어나 작동되지 않도록 제어부가 상기 제2직기부의 작동을 제어하는 제어단계를 포함하는 것을 특징으로 하는 직기 장치의 제어방법."}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일실시예는 제직되는 직물의 불량률을 낮출 수 있는 직기 장치 및 직기 장치의 제어방법을 제공한다. 여기서, 직기 장치는 제1직기부, 결함 검출부, 모니터링부, 학습부 및 제어부를 포함한다. 제1직기부는 위사 및 경사를 이용하여 직물을 짠다. 결함 검출부는 제1직기부에서 짜지는 직물의 결함을 검출한다. 모니터링부는 제1 (뒷면에 계속)"}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 직기 장치 및 직기 장치의 제어방법에 관한 것으로, 더욱 상세하게는 제직되는 직물의 불량률을 낮출 수 있는 직기 장치 및 직기 장치의 제어방법에 관한 것이다."}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 직기장치는 실을 제직(製織) 처리하여 직물을 제조하는데 사용된다. 직물은 직기장치의 실 제직 방 식 및 구조에 따라 평면의 원단 또는 줄, 끈 형태로 제직될 수 있다. 한편, 직기 공정에서는 바탕이 되는 실이 모두 동일한 색상이고 불량 자체도 미세하기 때문에, 고속으로 이루어 지는 검사과정에서 육안으로 판별하기 어려운 문제점이 있다. 그러므로 통상적으로 제직된 직물의 검사는 제직 후, 염색공정을 진행하여 컬러를 검사함으로써 이루어지고 있다. 그런데, 이와 같이, 염색공정을 진행한 후 불 량을 판별하게 되면, 불량을 인지한 시점에는 피해액이 원가의 수 배 이상으로 증가되는 문제점이 있다. 그런데, 통상적으로 제직 공정에서는 다수 개의 직기 장치가 자동 운용되기 때문에, 작업자가 육안으로 검사를 진행하기는 어려움 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제2019-0112919호(2019.10.08. 공개)"}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위하여, 본 발명이 이루고자 하는 기술적 과제는 제직되는 직물의 불량률을 낮 출 수 있는 직기 장치 및 직기 장치의 제어방법을 제공하는 것이다. 본 발명이 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다 른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위하여, 본 발명의 일실시예는 위사(緯絲) 및 경사(經絲)를 이용하여 직물을 짜는 제1직기부; 상기 제1직기부에서 짜지는 직물의 결함을 검출하는 결함 검출부; 상기 제1직기부의 작동 정보를 생 성하여 모니터링하며, 상기 결함 걸출부가 직물의 결함을 검출하면, 상기 제1직기부의 작동 정보 중 상기 결함 이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를 추출하여 관리 대상 정보를 생성하는 모니터링부; 그리고 상기 결함 검출부로부터 직물의 결함 정보를 입력받고, 상기 모니터링부로부터 상기 관리 대상 정보를 입력받아 학습 모델을 생성하고 인공지능 학습하여 결함을 종류별로 분류하고, 상기 관리 대상 정 보를 기초로 각 결함 발생을 방지하기 위한 관리값을 생성하는 학습부를 포함하며, 상기 모니터링부는 상기 제1직기부와 동일한 복수 개의 제2직기부의 작동 정보를 더 생성하여 모니터링하며, 상기 모니터링부가 상기 제2직 기부의 작동 정보 중 상기 관리값을 벗어나는 작동 정보를 모니터링하면, 상기 제2직기부가 상기 관리값을 벗어 나 작동되지 않도록 상기 제2직기부의 작동을 제어하는 제어부를 포함하는 것을 특징으로 하는 직기 장치를 제 공한다. 본 발명의 실시예에 있어서, 상기 관리값은 상기 위사의 토출 압력값, 상기 경사의 장력값 및 짜진 직물의 이송 속도값을 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 관리값은 범위값일 수 있다. 본 발명의 실시예에 있어서, 상기 결함 검출부는 상기 제2직기부에서 짜지는 직물의 결함을 더 검출하고, 상기 결함 검출부가 상기 제2직기부에서 짜지는 직물의 결함을 검출하면, 상기 모니터링부는 상기 제2직기부의 작동 정보 중 상기 결함이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를 추출하여 관리 대상 정보를 추 가 생성하며, 상기 학습부는 상기 직물의 결함 및 추가 생성된 상기 관리 대상 정보를 상기 학습 모델에 포함시 키고 인공지능 학습하여 직물의 결함 및 이에 대응되는 관리값을 갱신할 수 있다. 한편, 상기 기술적 과제를 달성하기 위하여, 본 발명의 일실시예는 결함 검출부가 위사(緯絲) 및 경사(經絲)를 이용하여 직물을 짜는 제1직기부에서 짜지는 직물의 결함을 검출하는 결함 검출 단계; 모니터링부가 상기 제1직 기부의 작동 정보를 생성하여 모니터링하다가, 상기 결함 걸출부가 직물의 결함을 검출하면, 상기 제1직기부의 작동 정보 중 상기 결함이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를 추출하여 관리 대상 정보 를 생성하는 관리 대상 정보 생성단계; 학습부가 상기 결함 검출부로부터 직물의 결함 정보를 입력받고, 상기 모니터링부로부터 상기 관리 대상 정보를 입력받아 학습 모델을 생성하고 인공지능 학습하여 결함을 종류별로 분류하고, 상기 관리 대상 정보를 기초로 각 결함 발생을 방지하기 위한 관리값을 생성하는 관리값 생성단계; 상기 모니터링부가 상기 제1직기부와 동일한 복수 개의 제2직기부의 작동 정보를 생성하여 모니터링하는 모니터 링 단계; 그리고 상기 모니터링부가 상기 제2직기부의 작동 정보 중 상기 관리값을 벗어나는 작동 정보를 모니 터링하면, 상기 제2직기부가 상기 관리값을 벗어나 작동되지 않도록 제어부가 상기 제2직기부의 작동을 제어하 는 제어단계를 포함하는 것을 특징으로 하는 직기 장치의 제어방법을 제공한다."}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 제1직기부의 작동 정보 및 제직되는 직물의 결함을 모니터링하며, 제1직기부의 작 동 정보 중 해당 결함이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를 추출하여 관리 대상 정보를 생성한 후, 이를 인공지능 학습하여 결함을 종류별로 분류하고, 관리 대상 정보를 기초로 각 결함 발생을 방지 하지 위한 관리값을 생성하며, 제2직기부의 작동 정보 중 관리값을 벗어나는 작동 정보가 모니터링되면, 제2직 기부가 관리값을 벗어나 작동되지 않도록 제어함으로써 제직되는 직물의 결함을 줄여 직물의 불량률을 낮출 수 있다."}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 청구범위에 기재된 발명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명을 설명하기로 한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 따라서 여기에서 설명하는 실시예로 한정되는 것은 아니다. 그리고 도면에서 본 발명을 명확 하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유 사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉, 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연 결\"되어 있는 경우뿐 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 구비할 수 있다는 것을 의미한다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하 첨부된 도면을 참고하여 본 발명의 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일실시예에 따른 직기 장치를 나타낸 구성도이고, 도 2는 본 발명의 일실시예에 따른 직기 장 치의 결함 검출부에서 검출된 직물의 결함 예를 나타낸 사진이다. 도 1 및 도 2에서 보는 바와 같이, 직기 장치는 제1직기부, 결함 검출부, 모니터링부, 학습부 그리고 제어부를 포함할 수 있다. 제1직기부는 위사(緯絲) 및 경사(經絲)를 이용하여 직물을 짤 수 있다. 그리고, 결함 검출부는 제1직기부에서 짜지는 직물의 결함을 실시간으로 검출할 수 있다. 직물의 결함은 위사 불량(도 2의 (a) 참조), 올뜸 불량(도 2의 (b) 참조), 경사 불량(도 2의 (c) 참조) 중 어느 하나 이상을 포함할 수 있다. 모니터링부는 제1직기부의 작동 정보를 생성하여 모니터링할 수 있다. 모니터링부는 제1직기부 의 작동 정보를 실시간으로 생성하여 모니터링할 수 있다. 결함 검출부가 직물의 결함을 검출하면, 모니터링부는 제1직기부의 작동 정보 중 결함이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를 추출하여 관리 대상 정보를 생성할 수 있다. 도 3은 본 발명의 일실시예에 따른 직기 장치의 모니터링부가 관리 대상 정보를 생성하는 것을 설명하기 위한 예시도이다. 도 3을 더 포함하여 보는 바와 같이, 제1시점(T1)에서 결함 검출부가 제1결함을 검출하게 되면, 모니터링 부는 제1결함이 검출된 제1시점(T1)을 포함하는 관찰 시간 범위를 설정하고, 해당 관찰 시간 범위에 서의 작동 정보를 추출할 수 있다. 즉, 모니터링부는 제1시점(T1)의 이전 시점(Ta)에서부터 제1시점(T1)까지 를 관찰 시간 범위로 하여, 해당 관찰 시간 범위의 작동 정보를 모두 추출할 수 있다. 여기서, 제1결함이 검출된 시점에서 얼마만큼의 시점 을 이전 시점(Ta)으로 할지는 미리 설정될 수 있다. 결함 검출부는 실시간으로 결함을 검출하기 때문에, 제직 공정 중에 직물에 결함이 검출되는 경우, 이러한 결함의 발생은 제1직기부의 특정 오작동에 기인할 수 있다. 그리고 이와 같은 특정 오작동은 결함이 발생 하는 시점 이전의 어느 시간대에서 발생한 것일 수 있다. 그런데, 이러한 오작동이, 결함 검출 시점보다 얼마나 이전에 발생되었는지는 정확하게 알 수 없다. 따라서, 본 발명에서는 여러 백 데이터를 기초로 이러한 이전 시 점을 적절하게 미리 설정할 수 있고, 이를 통해, 관찰 시간 범위를 설정할 수 있다. 예를 들면, 직물의 결함이 검출되면, 검출된 시점에서부터 이전 10분까지를 관찰 시간 범위로 설정할 수 있다. 이와 같이, 제1시점(T1)에서 제1결함이 검출되면, 모니터링부는 제1결함이 검출된 제1시점(T1) 에서부터 특정된 이전 시점(Ta) 사이의 관찰 시간 범위에서의 작동 정보를 모두 추출할 수 있으며, 이렇게 추출 된 작동 정보를 제1관리 대상 정보(WIa)로 생성할 수 있다. 같은 방법으로, 제2시점(T2)에서 제2결함이 검출되면, 모니터링부는 제2시점(T2) 및 제2시점(T2)의 이전 시점(Tb) 사이의 관찰 시간 범위에서의 작동 정보를 모두 추출하여 제2관리 대상 정보(WIb)를 생성할 수있다. 모니터링부는 제1관리 대상 정보(WIa)를 제1결함과 짝을 지어 생성하고, 제2관리 대상 정보(WIb)를 제2결함과 짝을 지어 생성할 수 있다. 학습부는 결함 검출부로부터 직물의 결함 정보를 입력받고, 모니터링부로부터 관리 대상 정보를 입력받아 학습 모델을 생성하고 인공지능 학습하여 결함을 종류별로 분류하고, 관리 대상 정보를 기초로 각 결 함 발생을 방지하기 위한 관리값을 생성할 수 있다. 도 4는 본 발명의 일실시예에 따른 직기 장치의 작동예를 나타낸 예시도이다. 도 4를 더 포함하여 보는 바와 같이, 제1직기부가 위사 및 경사를 이용하여 직물을 짜는 공정에서는, 경사에는 양단부 방향으로 장력이 인가되게 되며, 직물의 안정적인 제직을 위해 장 력은 적정하게 관리되어야 한다. 그리고, 경사와 교차하는 방향으로 위사가 공급되는데, 위사는 토출구에서 토출되어 공급 된다. 위사의 정확한 토출을 위해 토출구에서 위사를 토출하는 토출압력은 적정하게 관리 되어야 한다. 또한, 위사 및 경사로 짜지는 직물은 일정한 이송 속도를 가지게 된다. 직물의 이송 속도는 경사의 이송 속도와 동일하고, 이러한 경사의 이송 속도에 따라 위사의 공급 속도가 조 절되어야 하기 때문에, 직물의 이송 속도는 적정하게 관리되어야 한다. 즉, 경사에 인가되는 장 력과, 위사의 토출압력과, 직물의 이송 속도는 적정하게 관리되어야 하며, 이들 중 적어도 어느 하나의 오작동은 직물의 결함 발생을 야기할 수 있다. 관리 대상 정보는 이러한 위사의 토출 압력값, 경사의 장력값 및 짜진 직물의 이송 속도값을 포함할 수 있다. 이처럼, 직물의 결함이 발생된 시점을 포함하는 관찰 시간 범위에서 추출되어 생성되는 관리 대상 정보는 해당 결함 발생을 야기한 정보일 수 있는데, 학습부는 각각의 관리 대상 정보를 기초로 각 결함 발생을 방지하 기 위한 관리값을 생성할 수 있다. 도 5는 본 발명의 일실시예에 따른 직기 장치에서 관리값을 생성하는 것을 설명하기 위한 예시도이다. 먼저, 도 5의 (a)에서 보는 바와 같이, 이전시점(Ta)과 제1시점(T1) 사이의 관찰 시간 범위에서의 장력 정보에 서, 장력이 제1장력(F1)을 유지하다가 특정 시점에서 제2장력(F2)으로 급격하게 증가한 후 다시 제1장력(F1)으 로 돌아오는 형태를 가지는 경우, 제2장력(F2)으로의 급격한 장력 증가가 직물에 결함이 발생하도록 한 원인일 수 있다. 따라서, 학습부는 이러한 장력 정보를 인공지능 학습하여 제1장력(F1)을 중심값으로 하고, 하한 값(Fa) 및 상한값(Fb)을 가지는 관리값(C1)을 생성할 수 있다. 그리고, 도 5의 (b)에서 보는 바와 같이, 이전시점(Ta)과 제1시점(T1) 사이의 관찰 시간 범위에서의 토출 압력 정보에서, 토출 압력이 제1토출 압력(F3)을 유지하다가 특정 시점에서 제2토출 압력(F4)으로 급격하게 감소한 후 다시 제1토출 압력(F3)으로 돌아오는 형태를 가지는 경우, 제2토출 압력(F4)으로의 급격한 토출 압력 감소가 직물에 결함이 발생하도록 한 원인일 수 있다. 따라서, 학습부는 이러한 토출 압력 정보를 인공지능 학습 하여 제1토출 압력(F3)을 중심값으로 하고, 상한값(Fc) 및 하한값(Fd)을 가지는 관리값(C2)을 생성할 수 있다. 또한, 도 5의 (c)에서 보는 바와 같이, 이전시점(Ta)과 제1시점(T1) 사이의 관찰 시간 범위에서의 이송 속도 정 보에서, 이송 속도가 제1 이송 속도(S1)를 유지하다가 특정 시점에서 제2 이송 속도(S2)로 급격하게 증가한 후 다시 제1 이송 속도(S1)로 돌아오는 형태를 가지는 경우, 제2이송 속도(S2)로의 급격한 이송 속도 증가가 직물 에 결함이 발생하도록 한 원인일 수 있다. 따라서, 학습부는 이러한 이송 속도 정보를 인공지능 학습하여 제1 이송 속도(S1)를 중심값으로 하고, 하한값(Sa) 및 상한값(Sb)을 가지는 관리값(C3)을 생성할 수 있다. 이처럼 관리값(C1,C2,C3)은 위사의 토출 압력값, 경사의 장력값 및 직물의 이송 속도값을 포함할 수 있으며, 이 러한 관리값(C1,C2,C3)은 범위값일 수 있다. 경사의 장력이 관리값(C1)의 범위 내에서 유지되고, 토출 압력이 관리값(C2)의 범위 내에서 유지되며, 이송 속 도가 관리값(C3)의 범위 내에서 유지되게 되면, 직물의 결함이 발생되지 않을 수 있다. 한편, 도 5를 참조로 설명한 내용은 관리값(C1,C2,C3)을 생성하는 하나의 예시로써 반드시 이러한 경우로 한정 되어 관리값이 생성되는 것은 아니다. 즉, 다른 예로, 관찰 시간 범위에서의 장력 정보에서 장력이 특정 시간동안 불규칙적이 되는 형태를 가질 수도 있을 것이다. 이러한 경우에도 학습부는 이러한 장력 정보를 인공지 능 학습하여 중심 장력값을 설정할 수 있고, 설정된 중심 장력값을 기준으로 하한값 및 상한값을 가지는 관리값 을 생성할 수 있다. 이는 토출압력 및 이송 속도의 경우에도 동일하게 적용될 수 있다. 그리고, 도 1에서 보는 바와 같이, 직기 장치는 제2직기부 및 제어부를 포함할 수 있다. 제2직기부 는 제1직기부와 동일할 수 있다. 또한, 제2직기부는 복수 개일 수 있다. 즉, 본 발명에서 제1직기부는 학습부가 인공지능 학습하여 관리값을 생성하도록 하기 위해 직물의 결 함 및 관리 대상 정보를 얻기 위한 직기를 의미하고, 제2직기부는 현장에서 직물을 짜는 직기를 의미하지 만, 제1직기부또한 현장에서 직물을 짜는 직기로 사용될 수 있으며, 이 경우, 제1직기부도 제2직기부 로 해석될 수 있다. 모니터링부는 제1직기부와 동일한 복수 개의 제2직기부의 작동 정보를 더 생성하여 모니터링할 수 있다. 그리고, 모니터링부가 제2직기부의 작동 정보 중 관리값을 벗어나는 작동 정보를 모니터링하면, 제어 부는 제2직기부가 관리값을 벗어나 작동되지 않도록 제2직기부의 작동을 제어할 수 있으며, 이 를 통해, 제직되는 직물의 결함을 줄여 직물의 불량률을 낮출 수 있다. 도 6은 본 발명의 다른 실시예에 따른 직기 장치를 나타낸 구성도이다. 본 실시예에서는 결함 검출부가 제2직기 부에서 짜지는 직물의 결함을 더 검출할 수 있으며, 다른 구성은 전술한 일실시예와 동일하므로 반복되는 내용 은 가급적 생략한다. 도 6에서 보는 바와 같이, 본 실시예에 따른 직기 장치에서는 결함 검출부(200a)는 제2직기부에서 짜지는 직물의 결함을 더 검출할 수 있다. 그리고, 결함 검출부(200a)가 제2직기부에서 짜지는 직물의 결함을 검출하면, 모니터링부는 제2직기 부의 작동 정보 중 결함이 발생한 시점을 포함하는 관찰 시간 범위에서의 작동 정보를 추출하여 관리 대상 정보를 추가 생성할 수 있다. 학습부는 직물의 결함 및 추가 생성된 관리 대상 정보를 학습 모델에 포함시키고 인공지능 학습하여 직물 의 결함 및 이에 대응되는 관리값을 갱신할 수 있다. 본 실시예에서는 제2직기부에서 획득되는 결함 정보 및 관리 대상 정보를 학습 모델에 포함시켜 학습 모델 을 업데이트 할 수 있기 때문에, 관리값이 갱신되어 더욱 정확한 관리값의 생성이 가능할 수 있고, 이를 통해 직물의 불량률을 더욱 낮출 수 있다. 이하에서는 직기 장치의 제어방법에 대해서 설명한다. 도 7은 본 발명의 일실시예에 따른 직기 장치의 제어방법을 나타낸 흐름도이다. 도 7에서 보는 바와 같이, 직기 장치의 제어방법은 결함 검출 단계(S710), 관리 대상 정보 생성단계(S720), 관 리값 생성단계(S730), 모니터링 단계(S740) 그리고 제어단계(S750)를 포함할 수 있다. 결함 검출 단계(S710)는 결함 검출부가 위사 및 경사를 이용하여 직물을 짜는 제1직기부에서 짜지는 직물의 결 함을 검출하는 단계일 수 있다. 관리 대상 정보 생성단계(S720)는 모니터링부가 제1직기부의 작동 정보를 생성하여 모니터링하다가, 결함 걸출 부가 직물의 결함을 검출하면, 제1직기부의 작동 정보 중 해당 결함이 발생한 시점을 포함하는 관찰 시간 범위 에서의 작동 정보를 추출하여 관리 대상 정보를 생성하는 단계일 수 있다. 관리값 생성단계(S730)는 학습부가 결함 검출부로부터 직물의 결함 정보를 입력받고, 모니터링부로부터 관리 대 상 정보를 입력받아 학습 모델을 생성하고 인공지능 학습하여 결함을 종류별로 분류하고, 관리 대상 정보를 기 초로 각 결함 발생을 방지하기 위한 관리값을 생성하는 단계일 수 있다. 모니터링 단계(S740)는 모니터링부가 제1직기부와 동일한 복수 개의 제2직기부의 작동 정보를 생성하여 모니터 링하는 단계일 수 있다. 제어단계(S750)는, 모니터링부가 제2직기부의 작동 정보 중 관리값을 벗어나는 작동 정보를 모니터링하면, 제2 직기부가 관리값을 벗어나 작동되지 않도록 제어부가 제2직기부의 작동을 제어하는 단계일 수 있으며, 이를 통해, 직물의 불량률을 낮출 수 있다."}
{"patent_id": "10-2021-0146767", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 후술하는 청구범위에 의하여 나타내어지며, 청구범위의 의미 및 범위 그리고 그 균등 개념으 로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0146767", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 직기 장치를 나타낸 구성도이다. 도 2는 본 발명의 일실시예에 따른 직기 장치의 결함 검출부에서 검출된 직물의 결함 예를 나타낸 사진이다. 도 3은 본 발명의 일실시예에 따른 직기 장치의 모니터링부가 관리 대상 정보를 생성하는 것을 설명하기 위한 예시도이다. 도 4는 본 발명의 일실시예에 따른 직기 장치의 작동예를 나타낸 예시도이다. 도 5는 본 발명의 일실시예에 따른 직기 장치에서 관리값을 생성하는 것을 설명하기 위한 예시도이다. 도 6은 본 발명의 다른 실시예에 따른 직기 장치를 나타낸 구성도이다. 도 7은 본 발명의 일실시예에 따른 직기 장치의 제어방법을 나타낸 흐름도이다."}
