{"patent_id": "10-2023-0026381", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0132536", "출원번호": "10-2023-0026381", "발명의 명칭": "물류센터 통합 시공 유지 관리 시스템", "출원인": "주식회사 수영로지콘", "발명자": "최영철"}}
{"patent_id": "10-2023-0026381", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "물류센터 시공품질 향상을 위한 센터 시공 품질 관리 모듈;업종별 특화된 물류센터 입지선정 및 설계와 시공 연구를 위한 센터 입지 선정 모듈;물류센터 시공 부지의 바닥 평탄도 향상 시공을 조사하는 시공 바닥 평탄도 조사 및 기록 모듈;GIS와 AHP를 인공지능과 연계하여 활용한 물류센터 입지를 선정하는 인공지능 입지 선정 연계 모듈;을 포함하는것을 특징으로 하는 물류센터 통합 시공 유지 관리 시스템."}
{"patent_id": "10-2023-0026381", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 목적은 물류센터 통합 시공 유지 관리 시스템을 제공하는 것으로, 본 발명의 구성은 물류센터 시공품 질 향상을 위한 센터 시공 품질 관리 모듈; 업종별 특화된 물류센터 입지선정 및 설계와 시공 연구를 위한 센터 입지 선정 모듈; 물류센터 시공 부지의 바닥 평탄도 향상 시공을 조사하는 시공 바닥 평탄도 조사 및 기록 모듈; GIS와 AHP를 인공지능과 연계하여 활용한 물류센터 입지를 선정하는 인공지능 입지 선정 연계 모듈;을 포함하는 것을 특징으로 한다. 공개특허10-2024-0132536 CPC특허분류 G06Q 10/06395 (2013.01) 발명자 박성배 경기도 김포시 김포한강11로 275, 309동 1402호 ( 롯데캐슬)이하림 충청남도 아산시 배방읍 장재로 46-61, 201호명 세 서 청구범위 청구항 1 물류센터 시공품질 향상을 위한 센터 시공 품질 관리 모듈; 업종별 특화된 물류센터 입지선정 및 설계와 시공 연구를 위한 센터 입지 선정 모듈; 물류센터 시공 부지의 바닥 평탄도 향상 시공을 조사하는 시공 바닥 평탄도 조사 및 기록 모듈; GIS와 AHP를 인공지능과 연계하여 활용한 물류센터 입지를 선정하는 인공지능 입지 선정 연계 모듈;을 포함하는 것을 특징으로 하는 물류센터 통합 시공 유지 관리 시스템. 발명의 설명"}
{"patent_id": "10-2023-0026381", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 물류센터 통합 시공 유지 관리 시스템에 관한 것으로, 보다 상세하게는 물류센터 시공 품질 향상, 업 종별 특화된 물류센터 입지선정과 같은 다양한 여건을 충분히 고려하여 물류센터를 구현하는 물류센터 통합 시 공 유지 관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0026381", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "물류센터를 만들기 위해서는 물류의 동선, 주변 환경, 법규 정보와 같은 다양한 여건을 고려할 필요가 있고, 이 러한 제반 여건을 고려하는 정도 또는 방법에 따라 그 건물의 형태는 다양하게 시공될 수 있다. 그런데, 아직까지는 단순히 환경적인 요소 또는 건물을 설계하기 위한 법규적인 요소만을 고려하여 물류센터 시 공을 하고 있으므로, 특수목적의 물류센터와 같은 다양한 특성을 제대로 고려하지 못하고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2113857호(2020년05월15일 등록)"}
{"patent_id": "10-2023-0026381", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 물류센터 시공 품질 향상, 업종별 특화된 물류센터 입지선정과 같은 다양한 여건을 충분히 고 려하여 물류센터를 구현하는 물류센터 통합 시공 유지 관리 시스템을 제공하고자 하는 것이다."}
{"patent_id": "10-2023-0026381", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 의하면, 물류센터 시공품질 향상을 위한 센터 시공 품질 관리 모듈; 업종별 특화된 물류센터 입지선 정 및 설계와 시공 연구를 위한 센터 입지 선정 모듈; 물류센터 시공 부지의 바닥 평탄도 향상 시공을 조사하는 시공 바닥 평탄도 조사 및 기록 모듈; GIS와 AHP를 인공지능과 연계하여 활용한 물류센터 입지를 선정하는 인공 지능 입지 선정 연계 모듈;을 포함하는 것을 특징으로 하는 물류센터 통합 시공 유지 관리 시스템이 제공된다."}
{"patent_id": "10-2023-0026381", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 물류센터 시공 품질 향상, 업종별 특화된 물류센터 입지선정, 설계 및 시공, 물류센터 바닥 평탄도 (Flat floor) 향상 시공, GIS와 AHP를 활용한 물류센터 입지 선정을 수행하여 통합적인 물류센터 통합 시공 유 지 관리 시스템을 제공 가능한 효과가 있다."}
{"patent_id": "10-2023-0026381", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 물류센터 시공품질 향상을 위한 센터 시공 품질 관리 모듈; 업종별 특화된 물류센터 입지선정 및 설 계와 시공 연구를 위한 센터 입지 선정 모듈; 물류센터 시공 부지의 바닥 평탄도 향상 시공을 조사하는 시공 바 닥 평탄도 조사 및 기록 모듈; GIS와 AHP를 인공지능과 연계하여 활용한 물류센터 입지를 선정하는 인공지능 입 지 선정 연계 모듈;을 포함하는 것을 특징으로 하는 물류센터 통합 시공 유지 관리 시스템이다. 본 발명은 물류센터 시공품질 향상 연구, 업종별 특화된 물류센터 입지선정, 설계 및 시공 연구, 물류센터 바닥 평탄도(Flat floor) 향상 시공법 연구, GIS와 AHP를 활용한 물류센터 입지 선정 연구를 통하여 다양한 요구에 부응하는 물류센터를 구현하는데 도움을 주고, 나아가 인공지능 연계로 최상의 물류센터 구현에 기여하게 된다. 본 발명은 용도에 따라 민감할 수 있는 각종 물류센터 시설의 특성을 고려하여 관련 기술에 대한 충분한 이해와 경험으로 다져진 노하우를 바탕으로 최상의 효율적인 물류센터 구현 및 관리가 가능하고, 수준높은 기술력과 가 성비 높은 경쟁력으로 소비자들에게 차별화된 물류센터 구축 서비스를 제공할 수 있게 된다."}
