{"patent_id": "10-2024-0032089", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0155758", "출원번호": "10-2024-0032089", "발명의 명칭": "용접 시스템", "출원인": "주식회사 오토스윙", "발명자": "허문영"}}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "용접과 관련한 정보를 생성하여 표시하는 용접 정보 제공 장치; 및용접 모재에 전기적 아크를 발생시키는 용접 토치를 포함하고,상기 용접 토치는,용접 위치를 식별하는 마커가 장착된 제1 패널부를 포함하는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제1 패널부는,토치 헤드 및 백 캡 사이에 위치한 가이드부의 외측에 구비되는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제1 패널부는,상기 가이드부의 외측을 감싸는 복수 개의 면 중 하나 이상에 구비되는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 가이드부 및 상기 제1 패널부 사이에 구비되어 상기 제1 패널부로 조명을 공급하는 조명부를 더 포함하는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 조명부의 개수와 상기 제1 패널부의 개수는 동일하게 구성되는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2 항에 있어서,상기 용접 정보 제공 장치는용접 작업에 대한 용접 영상을 획득하는 제1 카메라부;상기 용접 영상을 표시하는 표시부; 및제1 프로세서를 포함하고,상기 제1 프로세서는,공개특허 10-2024-0155758-3-상기 제1 카메라부가 촬영한 상기 제1 패널부의 영상 및 기설정된 용접봉과 상기 제1 패널부 사이의 거리 정보를 이용하여 마커 위치정보, 토치 방향 정보, 토치 각도 정보 및 상기 용접 모재로부터 상기 제1 카메라부까지의 거리정보 중 하나 이상을 포함하는 마커 관련 정보를 생성하고,상기 제1 카메라부와, 제1 센서부와, 상기 용접 토치에 구비된 제2 센서부 중 하나 이상으로부터 용접 위치, 용접 방향, 용접 각도, 용접 기울기, 용접 속도 및 상기 용접 모재와 상기 용접 토치 사이의 간격 중 하나 이상을포함하는 용접 상황에 대한 정보의 감지 결과를 수신하고,상기 마커 관련 정보 및 상기 용접 상황에 대한 정보를 기반으로 작업 지시, 작업 변경 및 작업 중지 중 하나이상을 포함하는 용접 가이드 정보를 생성하고,상기 용접 가이드 정보를 상기 표시부로 출력하도록 구성되는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,네트워크를 통하여 상기 용접 정보 제공 장치 및 상기 용접 토치와 연결되고, 상기 용접 정보 제공 장치로 작업자가 용접 기술을 습득하고 안전한 용접을 수행하도록 가이드 해주는 용접 교육용 콘텐츠를 제공하는 용접 관리장치를 더 포함하는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 용접 관리 장치는,상기 용접 정보 제공 장치로부터 수신한 작업자의 용접 결과 및 기설정된 숙련된 작업자의 용접 결과의 비교를통하여, 상기 용접 정보 제공 장치로 상기 작업자의 용접 결과에 대하여 조언하는 용접 어드바이스 정보를 제공하는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 용접 관리 장치는,용접 결과 영상 프레임을 수신하여 용접 어드바이스 정보를 예측하도록 미리 훈련된 심층신경망 모델을 이용하여 상기 용접 정보 제공 장치로부터 수신한 작업자의 용접 결과에 대응하는 용접 결과 영상 프레임을 수신하여용접 어드바이스 정보를 예측하는 제3 프로세서를 포함하고,상기 심층신경망 모델은,용접 결과 영상 프레임을 입력으로 하고, 용접 어드바이스 정보를 레이블로 하는 훈련데이터에 의해 지도학습방식으로 훈련된 모델인,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "다중축으로 구성되어 용접을 위해 이동하는 용접 바디;상기 용접 바디로부터 연장되어 용접 모재에 전기적 아크를 발생시키는 용접봉을 포함하고,상기 용접봉은,용접 위치를 식별하는 마커가 장착된 제2 패널부를 포함하는,공개특허 10-2024-0155758-4-용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 제2 패널부는,상기 용접봉의 일 측을 둘러싸는 용접봉 헤드의 외측에 구비되는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 패널부는,상기 용접봉 헤드의 외측을 감싸는 복수 개의 면 중 하나 이상에 구비되는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서,상기 용접봉 헤드의 외측 및 상기 제2 패널부 사이에 구비되어 상기 제2 패널부로 조명을 공급하는 조명부를 더포함하는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 조명부의 개수와 상기 제2 패널부의 개수는 동일하게 구성되는,용접 시스템."}
{"patent_id": "10-2024-0032089", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 10 항에 있어서,상기 용접 바디에 구비되어 용접 작업에 대한 용접 영상을 획득하는 제2 카메라부; 및제4 프로세서를 더 포함하고,상기 제4 프로세서는,상기 제2 카메라부가 촬영한 상기 제2 패널부의 영상 및 기설정된 상기 용접봉과 상기 제2 패널부 사이의 거리정보를 이용하여 마커 위치정보, 토치 방향 정보, 토치 각도 정보 및 상기 용접 모재로부터 상기 제1 카메라까지의 거리정보 중 하나 이상을 포함하는 마커 관련 정보를 생성하고,상기 제2 카메라부와 및 제3 센서부 중 하나 이상으로부터 용접 위치, 용접 방향, 용접 각도, 용접 기울기, 용접 속도 및 상기 용접 모재와 상기 용접봉 사이의 간격 중 하나 이상을 포함하는 용접 상황에 대한 정보의 감지결과를 수신하고,상기 마커 관련 정보 및 상기 용접 상황에 대한 정보를 기반으로 작업 지시, 작업 변경 및 작업 중지 중 하나이상을 포함하는 용접 가이드 정보를 생성하고,상기 용접 가이드 정보에 대응하여 상기 용접 바디의 이동과, 상기 용접봉의 동작을 제어하는,용접 시스템.공개특허 10-2024-0155758-5-"}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 용접 시스템에 관한 것이다. 본 개시의 일 실시 예에 따른 용접 시스템은, 용접과 관련한 정보를 생성하여 표시하는 용접 정보 제공 장치 및 용접 모재에 전기적 아크를 발생시키는 용접 토치를 포함하고, 용접 토치는, 용접 위치를 식별하는 마커가 장착 된 제1 패널부를 포함할 수 있다."}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 용접 시스템에 관한 것이다."}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "용접 기술은 제조 및 건설 분야에서 핵심적인 공정으로 자리 잡고 있다. 용접은 금속 부품을 연결하고 구조물 을 조립하는데 필수적인 작업으로, 안전성 내구성, 밀봉성 등 다양한 기능을 충족시키기 위해 매우 중요한 역할 한다. 일반적으로 용접은 숙련된 용접 작업자의 경험과 노하우에 의존하며, 용접 부위의 정확한 위치와 올바른 용접 조건 설정이 핵심 요소로 간주된다. 그러나 이러한 용접은 용접 작업의 일관성과 정확성을 보장하기에 한계가 있다. 인력 비용, 안전 문제, 용접 작업 중의 휴먼 에러 등이 문제로 제기된다."}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "전술한 배경기술은 발명자가 본 개시의 도출을 위해 보유하고 있었거나, 본 개시의 도출 과정에서 습득한 기술 정보로서, 반드시 본 개시의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내 공개특허공보 제10-2007-0005968호(2007.01.11)"}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 일 과제는, 용접 부위의 정확한 위치를 추적하고 그에 따라 용접 작업을 조절하여 용접 정확도 및 용 접 품질을 향상시키는데 있다. 본 개시의 일 과제는, 용접 작업 환경의 안전성을 향상시키고, 용접 작업자의 안전을 보장하는데 있다. 본 개시의 일 과제는, 용접 작업자를 교육하는 용접 교육용 콘텐츠를 제공하여 미래 용접 작업자의 능력을 향상 시키는데 있다. 본 개시의 일 과제는, 용접 부위의 정확한 위치 추적에 따른 용접 자동화를 통해 용접 작업을 빠르고 정확하게 처리하는데 있다. 본 개시가 해결하고자 하는 과제는 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 개시의 다른 과 제 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 개시의 실시 예에 의해보다 분명하게 이해될 것이다. 또한, 본 개시가 해결하고자 하는 과제 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 용접 시스템은, 용접과 관련한 정보를 생성하여 표시하는 용접 정보 제공 장치 및 용접 모재에 전기적 아크를 발생시키는 용접 토치를 포함하고, 용접 토치는, 용접 위치를 식별하는 마커가 장착 된 제1 패널부를 포함할 수 있다. 본 개시의 다른 실시 예에 따른 용접 시스템은, 다중축으로 구성되어 용접을 위해 이동하는 용접 바디 및 용접 바디로부터 연장되어 용접 모재에 전기적 아크를 발생시키는 용접봉을 포함하고, 용접봉은, 용접 위치를 식별하 는 마커가 장착된 제2 패널부를 포함할 수 있다. 이 외에도, 본 개시를 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램이 저장된 컴퓨터로 판독 가능한 기록매체가 더 제공될 수 있다.전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 특허청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 의하면, 본 개시의 일 과제는, 용접 부위의 정확한 위치를 추적하고 그에 따라 용접 작업을 조절하여 용접 정확도 및 용접 품질을 향상시킬 수 있다. 또한, 용접 작업 환경의 안전성을 향상시키고, 용접 작업자의 안전을 보장할 수 있다. 또한, 용접 작업자에게 안전하고 효과적인 용접 기술을 교육 및 훈련을 통하여 사고와 부상의 위험을 줄이고 정 확하고 일관성 있는 용접을 수행하도록 도울 수 있다. 또한, 용접 자동화를 통해 용접 작업을 빠르고 정확함으로써, 용접 시간과 노동을 절감할 수 있다. 본 개시의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시 예들 을 참조하면 명확해질 것이다. 그러나 본 개시는 아래에서 제시되는 실시 예들로 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있고, 본 개시의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 아래에 제시되는 실시 예들은 본 개시의 개시가 완전하도록 하며, 본 개"}
{"patent_id": "10-2024-0032089", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "시가 속하는 기술분야에서 통상의 지식을 가진 자에게 개시의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 개시를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 개시를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 또한, 본 출원서에서, \"부\"는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로세 서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다. 이하, 본 개시에 따른 실시 예들을 첨부된 도면을 참조하여 상세히 설명하기로 하며, 첨부 도면을 참조하여 설 명함에 있어, 동일하거나 대응하는 구성 요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하 기로 한다. 이하의 실시 예에서, 제1, 제2 등의 용어는 한정적인 의미가 아니라 하나의 구성 요소를 다른 구성 요소와 구별 하는 목적으로 사용되었다. 이하의 실시 예에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 이하의 실시 예에서, 포함하다 또는 가지다 등의 용어는 명세서상에 기재된 특징, 또는 구성요소가 존재함을 의 미하는 것이고, 하나 이상의 다른 특징을 또는 구성요소가 부가될 가능성을 미리 배제하는 것은 아니다. 어떤 실시 예가 달리 구현 가능한 경우에 특정한 공정 순서는 설명되는 순서와 다르게 수행될 수도 있다. 예를 들어, 연속하여 설명되는 두 공정이 실질적으로 동시에 수행될 수도 있고, 설명되는 순서와 반대의 순서로 진행 될 수 있다. 도 1은 본 개시의 일 실시 예에 따른 용접 환경의 예시도이고, 도 2는 본 개시의 일 실시 예에 따른 용접 시스 템의 예시도이다. 도 1 및 도 2를 참조하면 본 개시의 일 실시 예에 따른 용접 시스템은 용접 정보 제공 장 치, 용접 토치 및 네트워크를 포함할 수 있다. 용접 정보 제공 장치 및 용접 토치는 네트워크를 통하여 데이터를 송수신할 수 있다. 용접 정 보 제공 장치 및 용접 토치는 1대1로 매칭되어 동작될 수 있으나, 이에 한정되지 않고, 1대 n의 관계 가 가능하다. 즉, 1대의 용접 정보 제공 장치에 n대의 용접 토치들이 연결되어 구현될 수 있고, n대 의 용접 정보 제공 장치에 1대의 용접 토치들이 연결되어 구현될 수 있다. 뿐만 아니라 용접 정보 제공 장치 및 용접 토치는 별도의 서버(미도시) 또는 용접 관리 장치(도 7의 400)와 통신하여 데이터 를 송수신 할 수 있다. 본 실시 예에서 용접 토치는 통신 기능이 구비되지 않아 통신을 수행하지 않을 수 도 있다. 용접 정보 제공 장치는 용접과 관련한 정보를 생성하여 표시할 수 있다. 본 실시 예에서 용접 정보 제공 장치는 용접 헬멧을 포함할 수 있다. 본 실시 예에서 용접과 관련한 정보는 마커 관련 정보, 용접 상황에 대한 정보, 용접 가이드 정보, 용접 어드바이스 정보 등을 포함할 수 있다. 용접 정보 제공 장치는 용접 상황에 대한 정보를 작업자에게 제공할 수 있다. 구체적으로, 용접 정보 제 공 장치는 용접 정보 제공 장치에 장착된 적어도 하나의 카메라(예를 들어, 도 3의 제1 카메라부 )를 이용하여 용접 영상을 획득할 수 있다. 용접 정보 제공 장치는 획득한 용접 영상을 기반으로 합 성 영상을 생성하여 작업자에게 디스플레이 할 수 있다. 용접 정보 제공 장치는 HDR(High Dynamic Range) 기술을 이용하여 합성 영상을 생성할 수 있고, 고화질의 합성 영상을 작업자에게 디스플레이 하여 제공할 수 있 다. 작업자는 고화질 합성 영상을 통해 용접 비드의 형태 및 용접광과 인접한 부분 외의 주변 환경에 대한 정 보를 시각적으로 확인할 수 있다. 본 실시 예에서 용접 정보 제공 장치는 작업자의 시야와 동등한 위치에 카메라를 배치시켜 용접 영상을 획 득할 수 있다. 이를 통해 용접 정보 제공 장치는 작업자가 작업 현장을 직접 바라볼 때와 유사한 용접 영 상을 획득함으로써, 보다 정확한 용접 정보를 작업자에게 제공할 수 있다. 본 실시 예에서 용접 정보 제공 장치는 고화질 용접 영상을 합성하여 제공하기 위해, 2개 이상의 카메라를 통해 영상을 획득할 수 있다. 용접 정보 제공 장치는 2개 이상의 카메라를 통해 획득한 각각의 영상을 적 어도 하나의 표시부(도 3의 140)를 통해 디스플레이 할 수 있다. 본 실시 예에서 2개의 카메라 각각은 작업자 의 좌안과 우안에 대응되는 위치에 배치될 수 있다. 이때, 용접 정보 제공 장치는 카메라 각각의 셔터스 피드, ISO 감도, Gain 값을 다르게 하여 반복적으로 촬영하여 영상을 합성할 수 있다. 본 실시 예에서 용접 정 보 제공 장치는 획득한 합성 영상에 대한 대조비 처리를 통해 화질을 개선할 수 있다. 용접 정보 제공 장치는 RGB를 이용하여 선호하는 색상(예를 들어, 그린, 블루)으로 용접 정보를 표시하는 기능을 제공할 수 있다. 또한, 용접 정보 제공 장치는 돋보기 도수 보정 기능(예를 들어, 화면 확대 및 축소)을 제공할 수 있다. 또한, 본 발명의 용접 정보 제공 장치는 별도의 열화상 카메라를 이용하여 온도 합성 영상을 제공할 수 있다. 이때, 용접 정보 제공 장치는 색상으로 용접 온도를 표시할 수 있다. 본 발명의 용접 정보 제공 장치는 상술한 모든 기능에 대하여 소리(예를 들면, 안내 알람) 또는 안내 음성으 로 제공하는 기능을 지원할 수 있다. 용접 토치는 용접 모재에 전기적 아크를 발생시킬 수 있다. 용접 토치는 실시간 용접 작업에 대한 용접 위치, 용접 방향, 용접 각도, 용접 기울기, 용접 속도 및 상기 용접 모재와 상기 용접 토치 사이의 간격 중 하나 이상을 포함하는 용접 상황에 대한 정보를 적어도 하나의 센서를 통해 감지할 수 있다. 선택적 실시 예로 용접 토치는 적어도 하나의 센서를 통해 감지한 신호를 이용하여 용접 상황에 대한 정보를 산출 또는 생성할 수 있다. 용접 토치는 토치의 상태를 모니터링할 수 있고, 용접 상황에 대한 정보에 따라 토치 작 업의 설정 값을 변경할 수 있다. 용접 토치는 용접 위치를 식별하는 마커(도 5의 206-1)가 장착된 제1 패널부(도 5의 206)를 포함할 수 있 다. 제1 패널부의 하부에는 제1 조명부(도 6의 207)가 구비될 수 있다. 제1 조명부는 제1 패널부 로 조명을 공급할 수 있다. 따라서 어두운 환경에서 용접 토치의 위치를 명확히 인식할 수 있다. 제1 패널부에 포함되는 마커(206-1)는 시각적으로 식별 가능한 패턴을 포함할 수 있다. 마커(206-1)는 고 유한 식별자를 포함할 수 있다. 고유한 식별자는 마커(206-1)를 식별하고, 마커(206-1)에 연결된 정보나 작업 을 구별하는데 이용될 수 있다. 본 실시 예에서 용접 토치의 회전 각도는 제1 패널부에 포함되는 마커(206-1)를 이용하여 산출할 수 있다. 본 실시 예에서 제1 패널부의 위치 및 용접봉(도 5의 201)까지의 거리는 미리 설정되어 있을 수 있다. 본 실시 예에서 용접 정보 제공 장치는 용접 토치와 연결된 네트워크를 통해 용접 토치로 부터 작업 설정 및 작업 상태에 대한 정보를 수신할 수 있다. 용접 정보 제공 장치는 수신한 용접 정보를 기초로 작업자에게 작업 정보를 시각적 피드백을 통해 제공할 수 있다. 예를 들어, 용접 정보 제공 장치는 용접 온도 값에 대한 센싱 정보를 수신하면, 불빛, 진동, 메시지 등의 다양한 방식으로, 온도 값과 대응되는 알림을 출력할 수 있다. 이때, 알림은 용접 정보 제공 장치의 표시 부 또는 디스플레이에 제공되는 시각적인 피드백일 수 있고, 스피커(미도시)를 통한 소리(예를 들면, 안내 알람) 또는 안내 음성을 통한 청각적인 피드백일 수 있다. 한편, 온도 값에 대한 센싱 정보는 기 설정된 온도 범위를 초과하는지 여부 등에 대한 정보를 포함할 수 있다. 또한, 온도 값에 대한 센싱 정보는 용접면의 온도 값과 대응되는 수치, 등급, 레벨 등을 포함할 수 있다. 용접 정보 제공 장치는 용접 토치 및 용접면의 온도 값이 기 설정된 온도 범위를 벗어나는 것으로 판 단하면, 작업자에게 작업을 중지할 것을 가이딩 할 수 있다. 본 실시 예에서 기 설정된 온도 범위를 벗어나는 용접의 경우, 품질의 저하의 위험이 있으며, 이에 작업자가 토치의 온도 값을 조절할 수 있도록 가이딩을 제공 할 수 있다. 본 실시 예에서, 상술한 또는 후술할 가이딩이라 함은, 용접 작업 시에 작업자가 정확한 용접을 수행할 수 있도 록, 용접 정보 제공 장치가 작업자에게 요청 또는 지시하는 용접 가이드 정보를 제공하는 신호 처리를 포 함할 수 있다. 본 실시 예에서 용접 가이드 정보는 작업 지시, 작업 변경 및 작업 중지 중 하나 이상을 포함할 수 있다. 본 실시 예에서 작업 지시는 용접해야 할 특정 지점이나 경로를 표시부에 시각적으로 가이딩 하는 것을 포 함할 수 있다. 작업 변경은 예를 들어, 용접해야 할 위치가 변경되었거나, 용접 속도를 조절해야 하는 경우, 변경된 위치 또는 조절할 용접 속도를 표시부에 시각적으로 가이딩 하는 것을 포함할 수 있다. 작업 중지 는 예를 들어, 용접 작업 중 위험 상황이나 오동작이 감지되었을 때, 작업자에게 경고하거나 작업을 중지하라는 지시를 표시부에 시각적으로 가이딩 하는 것을 포함할 수 있다. 이러한 용접 가이드 정보는 시각적뿐만 아니라 청각적으로 출력될 수 있다. 용접 토치의 전류 또는 전압 상태가 비정상적인 것으로 감지되는 경우, 용접 정보 제공 장치는 경고 를 위한 시각적 피드백을 제공할 수 있다. 이때, 시각적 피드백은 작업 현장을 디스플레이 하고 있는 용접 정 보 제공 장치의 표시부 일부 영역에 위험함을 나타내는 아이콘을 제공하는 것일 수 있다. 또 다른 예로, 용접 정보 제공 장치는 표시부 화면 전체를 특정 색상(예를 들면, 레드)에 대한 채도를 증가및 감소를 반복함으로써, 시각적 피드백을 통한 작업 중지 가이딩을 제공할 수 있다. 본 실시 예에서 용접 정보 제공 장치는 용접 토치에 포함된 적어도 하나의 센서(미도시) 외에도, 용 접 정보 제공 장치에 포함된 적어도 하나의 센서(예를 들어, 도 3의 제1 센서부)를 통해서 용접 상황 에 대한 정보를 감지할 수 있다. 여기서, 용접 상황에 대한 정보는 실시간 용접 작업과 관련한 용접 위치, 용 접 방향, 용접 각도, 용접 기울기, 용접 속도 및 상기 용접 모재와 상기 용접 토치 사이의 간격 중 하나 이상을 포함할 수 있다. 선택적 실시 예로 용접 정보 제공 장치는 적어도 하나의 센서를 통해 감지한 신호를 이 용하여 용접 상황에 대한 정보를 산출 또는 생성할 수 있다. 용접 토치는 상태 변화를 검출할 수 있는 모든 형태의 센서 중 적어도 하나를 포함할 수 있다. 예를 들어, 용접 토치에 구비된 센서는, 가속도 센서(Acceleration Sensor), 자이로 센서(Gyro Sensor), 조도 센서(illuminance sensor), 근접 센서 (proximity sensor), 압력 센서(pressure sensor), 노이즈 센서(Noise Sensor), 비디오 센서(Video Sensor), 및/또는 중력 센서 등을 포함할 수 있다. 용접 토치의 조도 센서를 통해 감지된 용접 작업 영역 내의 광 정도는 제1 통신부(도 3의 110)를 통해 제1 프로세서(도 3의 160)로 전달 될 수 있고, 제1 프로세서는 용접 정보 제공 장치의 센서부(도 2의 150)를 통하지 않고, 용접 토치 의 조도 센서를 통해 전달된 광 정도를 바탕으로 제1 카메라(도 3의 122)를 제어할 수 있다. 한편, 가속도 센서는 용접 토치의 움직임을 감지하기 위한 구성요소일 수 있다. 구체적으로, 가속도 센서 는 용접 토치의 가속도, 진동, 충격 등의 동적인 힘을 측정할 수 있으므로, 용접 토치의 움직임을 측 정할 수 있다. 중력 센서는 중력이 향하는 방향을 감지하기 위한 구성요소일 수 있다. 중력 센서의 감지결과 는 가속도 센서와 함께 용접 토치의 움직임을 판단하는데 사용될 수 있다. 또한, 중력센서를 통해 용접 토치가 파지된 방향이 판단될 수 있다. 상술한 종류의 센서 외에도, 용접 토치는 자이로스코프 센서, 지자기센서, 초음파 센서, RF 센서와 같은 다양한 종류의 센서를 더 포함할 수 있고, 용접 작업 환경과 관련된 다양한 변화를 감지할 수 있다. 마찬가지로, 용접 정보 제공 장치는 용접 정보 제공 장치에 포함된 센서를 통해서 감지한 용접 상황 에 대한 정보와, 용접 토치에 포함된 센서를 통해서 감지한 용접 상황에 대한 정보에 기초하여, 용접 상황 에 대한 정보에 대응하는 가이딩을 제공할 수 있다. 용접 정보 제공 장치는 작업 중지에 대한 가이딩이 제공된 이후, 기설정된 사용자의 움직임 또는 기설정된 사용자의 음성 등을 센싱하여 용접 토치의 동작을 변경하는 가이딩을 제공할 수 있다. 용접 정보 제공 장치는 용접 토치와의 통신이 원활하지 못한 상태에서는 자체적으로 구비된 이미지 센싱을 통해 토치 및 용접면의 온도 값을 획득할 수 있다. 일 예로, 용접 정보 제공 장치는 열화상 카메 라를 통해 획득한 이미지 데이터를 기초로 토치 및 용접면의 온도 값을 획득할 수 있다. 상술한 예시는 용접 토치로부터 수신한 정보가 용접 온도 정보인 경우만을 기술한 것일 뿐, 용접 정보 제 공 장치는 다양한 용접 정보에 대한 다양한 가이딩을 제공할 수 있다. 용접 정보 제공 장치는 용접 모재로부터 용접 정보 제공 장치까지의 거리 정보와, 용접 상황에 대한 정보의 감지 결과 및 기설정된 용접봉과 제1 패널부사이의 거리 정보를 이용하여 용접 가이드 정보를 생성할 수 있다. 용접 정보 제공 장치는 용접 가이드 정보를 표시부로 출력할 수 있다. 네트워크는 용접 정보 제공 장치 및 용접 토치를 연결하는 역할을 수행할 수 있다. 이러한 네 트워크는 예컨대 LAN(local area network), WAN(wide area network), MAN(metropolitan area network), ISDN(integrated service digital network) 등의 유선 네트워크나, WLAN(wireless LAN), CDMA(code-division multiple access), 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 본 개시의 범위가 이에 한정되는 것은 아니다. 또한 네트워크는 근거리 통신 및/또는 원거리 통신을 이용하여 정보를 송수신할 수 있다. 여기 서, 근거리 통신은 Bluetooth, RFID(radio frequency identification), IrDA(infrared data association), UWB(ultra-wideband), ZigBee, Wi-Fi 기술을 포함할 수 있고, 원거리 통신은 CDMA(code-division multiple access), FDMA(frequency-division multiple access), TDMA(time-division multiple access), OFDMA(orthogonal frequency-division multiple access), SC-FDMA(single carrier frequency-division multiple access) 기술을 포함할 수 있다. 네트워크는 허브, 브리지, 라우터, 스위치와 같은 네트워크 요소들의 연결을 포함할 수 있다. 네트워크 는 인터넷과 같은 공용 네트워크 및 안전한 기업 사설 네트워크와 같은 사설 네트워크를 비롯한 하나 이상의 연결된 네트워크들, 예컨대 다중 네트워크 환경을 포함할 수 있다. 네트워크에의 액세스는 하나 이상 의 유선 또는 무선 액세스 네트워크들을 통해 제공될 수 있다. 더 나아가 네트워크는 CAN(controller area network) 통신, V2I(vehicle to infrastructure, 차량 대 도 로 인프라) 통신, V2X(vehicle to everything) 통신, 웨이브(wireless access in vehicular environment) 통신 기술과, 사물 등 분산된 구성 요소들 간에 정보를 주고받아 처리하는 IoT(Internet of Things, 사물인터넷) 망 및/또는 5G 통신을 지원할 수 있다. 도 3은 도 1의 용접 시스템 중 용접 정보 생성 장치의 구성을 개략적으로 설명하기 위하여 도시한 블록도이고, 도 4는 도 1의 용접 시스템 중 용접 정보 제공 장치의 사시도이다. 이하의 설명에서 도 1 및 도 2에 대한 설명 과 중복되는 부분은 그 설명을 생략하기로 한다. 도 3 및 도 4를 참조하면, 용접 정보 제공 장치는 제1 통신부, 제1 카메라부, 카트리지부, 표시부, 제1 센서부 및 제1 프로세서를 포 함할 수 있다. 제1 통신부는 네트워크와 연동하여 용접 정보 제공 장치 및 용접 토치 간의 송수신 신호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공할 수 있다. 제1 통신부는 용접 토치 로부터 용접 상황에 대한 정보를 수신하고, 용접 토치를 제어하기 위한 명령을 송신할 수 있다. 본 실시 예에서 용접 토치를 제어하기 위한 명령은 용접 가이드 정보를 포함할 수 있다. 본 실시 예에서 제1 통신부는 용접 가이드 정보를 용접 토치 이외의 외부 장치로 전송할 수 있다. 여기서, 외부 장치는 작업자/제3자의 스마트폰, 컴퓨터 등 통신 모듈을 포함하는 다양한 장치를 포함할 수 있다. 제1 통신부는 다양한 유형의 통신방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성일 수 있다. 제1 통신부는 와이파이칩, 블루투스 칩, 무선 통신 칩, NFC 칩 중 적어도 하나를 포함할 수 있다. 특히, 와이파이 칩이나 블루투스 칩을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송 수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 무선통신 칩은 IEEE, Zigbee, 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution) 등과 같은 다양 한 통신 규격에 따라 통신을 수행하는 칩을 의미할 수 있다. NFC 칩은 135kHz, 13.56MHz, 433MHz, 860~960MHz, 2.45GHz 등과 같은 다양한 RF-ID 주파수 대역들 중에서 13.56MHz 대역을 사용하는 NFC(Near Field Communication) 방식으로 동작하는 칩을 의미할 수 있다. 제1 카메라부는 적어도 하나의 카메라를 포함할 수 있고, 용접 작업 현장에 대한 영상을 촬영할 수 있다. 제1 카메라부는 용접 정보 제공 장치의 표시부에 인접하게 위치하는 카메라일 수 있다. 다른 실시예로서, 제1 카메라부는 탈착 가능하게 형성되어, 필요에 따라 그 위치를 바꿔 장착할 수 있다. 제1 카메라부는 전술한 바와 같이, 표시부에 인접하게 위치하도록 장착될 수 있으나, 필요에 따라 본체 의 측부로 위치를 변경하여 장착될 수도 있다. 또는, 제1 카메라부는 본체의 상부, 즉 작업자 의 머리 위로 장착될 수도 있다. 제1 카메라부는 제1 프로세서로부터 제어 명령을 수신하고, 제어 명령에 응답하여 셔터 스피트, ISO 감도, GAIN 등의 설정을 변경하여 용접 작업 현장을 촬영할 수 있다. 제1 카메라부 둘 이상의 카메라를 포함할 수 있는 데, 각각 상이한 촬영 설정을 통해 용접 작업 현장을 촬영할 수 있다. 본 실시 예에서 제1 카메라부는 열 화상 카메라를 포함할 수 있다. 용접 정보 제공 장치는 열 화상 카메라를 통해 획득한 열화상 영상을 용접 현장에 대한 영상에 합성하여 온도 영상을 획득할 수 있다. 본 실시 예에서 용접 정보 제공 장치는 제1 프로세서에 전기적으로 연결된 조명부(미도시)가 더 포함 될 수 있다. 상기 조명부(미도시)는 용접 정보 제공 장치의 외측에 위치하며, 적어도 용접 작업 영역을 향하여 광을 조사하도록 구성될 수 있다. 조명부(미도시)는 복수의 LED 모듈을 포함할 수 있다. 조명부(미도시)를 통해 조사되는 광의 출력 정도는 제1 프로세서의 제어에 의해 조절될 수 있다. 일 실시 예에 따르면, 조명부(미도시)는 제1 프로세서의 제어에 따라 제1 카메라부의 동작과 연동하여 동작할 수 있다. 카트리지부는 용접 발생시 발생되는 용접 광을 차단할 수 있다. 즉, 카트리지부는 제1 센서부, 예를 들어 이미지 센서, 포토 센서 및 광 센서 중 하나 이상을 통해 감지한 용접광 정보를 기초로 카트리지의 차광도를 증가시킬 수 있다. 이때, 카트리지부는 예컨대, 액정의 정렬 방향에 따라 흑화도가 조절될 수 있는 액정패널(LCD panel)을 포함할 수 있다. 예를 들어, 카트리지부는 VA(Vertical Align) 방식 LCD, TN(Twist Nematic)방식 LCD, IPS(In Plane Switching) 방식 LCD 등 다양한 패널로 구현될 수 있다.카트리지부의 흑화도는 용접 광의 밝기에 따라 자동으로 조절될 수 있다. 상술한 바와 같이 용접 광의 밝 기에 따라 자동으로 조절되는 경우, 제1 센서부를 이용할 수 있다. 제1 센서부는 용접광의 빛의 세 기를 감지하여 용접광 정보를 획득하고, 용접광 정보에 포함된 용접광의 세기에 대한 정보를 소정의 전기적 신 호로 제1 프로세서에 전달하면, 제1 프로세서는 용접광의 세기에 기초하여 흑화도를 제어할 수 있다. 즉, 카트리지부는 용접 작업 현장의 용접면에서 발생하는 빛의 세기 등에 대응되도록 패널의 차광도를 실 시간으로 변경할 수 있고, 제1 카메라부는 전면부에 설치된 카트리지부에 의해 용접광의 일정량이 차 폐된 용접 영상을 촬영할 수 있다. 선택적 실시 예로, 카트리지부의 차광도는 작업자가 수동으로 조정할 수 있다. 일 실시 예로, 작업자가 용접 작업을 수행하는 중에 용접 광이 너무 밝다고 판단하여, 차광도를 6, 7, 8, 9 등으로 조정할 수 있는 입력 장치(예를 들어, 조그 셔틀 등, 미도시)를 이용하여 원하는 차광도를 선택하면, 제1 프로세서는 입력 장치 에 의해 선택된 차광도에 대응하여 카트리지부의 차광 정도를 제어할 수 있다. 선택적 실시 예로, 용접 정보 제공 장치는 카트리지부에 인접하게 제1 카메라부가 위치하는 구 조일 수 있다. 또한, 용접 정보 제공 장치는 카트리지부를 포함하지 않을 수 있다. 이 경우 작업자 는 제1 카메라부를 통해 취득한 용접 영상만으로 용접 작업을 수행할 수 있고, 제1 프로세서는 제1 센서부가 감지한 용접 광의 밝기를 기반으로 용접 영상에 흑화 처리를 수행하여 표시부에 출력할 수 있다. 즉, 제1 프로세서가 흑화 처리 기능을 구비하고 있는 경우, 카트리지부를 포함하지 않을 수 있다. 표시부는 작업자에게 고화질 합성 영상을 제공할 수 있다. 구체적으로 표시부는 제1 카메라부 를 통해 획득한 영상을 합성한 합성 영상을 작업자에게 표시하는 디스플레이를 포함할 수 있다. 본 실시 예에서, 표시부는 현재 디스플레이 되는 용접 영상보다 확대된 용접 영상을 제공할 수 있고, 확대 된 용접 영상을 축소한 축소 용접 영상을 제공할 수 있다. 용접 영상의 확대 또는 축소는 제1 프로세서에 의해 결정되거나, 작업자의 요청에 의해 결정될 수 있다. 표시부에 포함된 디스플레이는 작업자가 용접광과 인접한 부분 외의 주변 환경(예를 들면, 기 작업한 용접 비드의 형태 등)에 대하여도 시각적으로 확인할 수 있도록 고화질 합성 영상을 표시할 수 있다. 또한, 표시부 는 작업자에게 용접 진행 상태에 대한 시각적 피드백(예를 들면, 용접 진행 방향)을 가이딩할 수 있다. 표시부에 포함된 디스플레이는 LCD(liquid crystal display), OLED(organic light emitting diodes), LED(light-emitting diode), LcoS(liquid crystal on silicon) 또는 DLP(digital light processing) 등과 같 은 다양한 디스플레이 기술로 구현될 수 있다. 이때 본 발명의 일 실시예에 따른 디스플레이는 불투명한 재질의 패널로 구현되고, 작업자는 유해광에 직접 노출되지 않을 수 있다. 그러나 반드시 이에 한정되는 것은 아니고, 디스플레이는 투명 디스플레이로 구비될 수 있다. 제1 센서부는 용접 현장에 대한 다양한 정보를 감지하고, 용접 상황에 대한 정보를 획득하기 위해 구성된 복수의 센서 모듈을 포함할 수 있다. 더욱이 제1 센서부는 적어도 용접 작업 영역 내에서 광 정도를 검출 하도록 구성된 광 센서를 포함할 수 있다. 선택적 실시 예로, 제1 센서부는 용접 현장에 대한 다양한 정 보를 감지하여 제1 프로세서로 전송하고, 제1 프로세서는 제1 센서부로부터 수신한 감지 결과를 기반으로 상술한 용접 상황에 대한 정보를 산출 또는 생성할 수 있다. 본 발명의 일 실시예에 따르면, 제1 센서부는 조도 센서(illuminance sensor)를 포함할 수 있고, 이때, 제 1 센서부는 용접 현장의 용접광 세기에 대한 정보를 획득할 수 있다. 제1 센서부는 조도 센서 (illuminance sensor) 외에도 근접 센서 (proximity sensor), 노이즈 센서(noise sensor, 비디오 센서(video sensor), 초음파 센서, RF 센서와 같은 다양한 종류의 센서를 더 포함할 수 있고, 용접 작업 환경과 관련된 다 양한 변화를 감지할 수 있다. 제1 프로세서는 제1 카메라부를 통해 수신한 용접 영상 프레임을 합성하여 고화질 합성 영상을 생성 할 수 있다. 제1 프로세서는 제1 카메라부가 프레임 별 촬영 조건을 상이하게 설정하고, 시간 순서 로 획득한 프레임을 병렬적으로 합성하여 합성 영상 획득할 수 있다. 구체적으로, 제1 프로세서는 제1 카 메라부의 셔터 스피드, ISO 감도 및 GAIN 등을 변경하여 촬영하도록 제1 카메라부를 제어할 수 있다. 이때, 제1 프로세서는 센싱된 용접 현장의 용접광, 주변광, 용접 토치의 움직임 정도 등 조건에 따라 촬영 조건을 상이하게 설정할 수 있다. 구체적으로, 제1 프로세서는 용접 현장의 용접광 및/또는 주변광이 높을수록 ISO 감도 및 GAIN를 감소하도록 촬영 조건을 설정할 수 있다. 또한, 용접 토치의 움직임 및/ 또는 작업 속도가 빠른 것으로 감지되면 셔터 스피드를 증가하도록 촬영 조건을 설정할 수 있다. 제1 프로세서는 기설정된 프레임 수의 영상을 병렬적으로 합성할 수 있다. 본 실시 예에서 설정된 프레임 내의 각각의 영상은 서로 상이한 촬영 조건으로 촬영된 것일 수 있다. 제1 프로세서는 제1 카메라부가 두 개 이상인 경우, 각각의 카메라의 촬영 설정 조건을 상이하게 설 정하여 촬영하도록 제어할 수 있다. 이 경우에도, 제1 프로세서는 기설정된 프레임 수의 영상을 병렬적으 로 합성할 수 있다. 제1 프로세서는 제1 카메라부가 촬영한 용접 토치에 구비된 제1 패널부의 영상을 수신하여, 마커 위치정보, 토치 방향 정보 및 용접 모재로부터 용접 정보 제공 장치까지의 거리 정보 중 하나 이상을 포함하는 마커 관련 정보를 생성할 수 있다. 본 실시 예에서, 마커 위치정보는 마커(206-1)가 용접 토치의 어느 부분에 위치하고 있는지 나타내는 정보 를 포함할 수 있다. 제1 프로세서가 마커 위치정보를 생성하는 구체적인 설명은 다음과 같다. 먼저, 제1 프로세서는 마커(206-1)를 식별할 수 있다. 제1 프로세서는 제1 카메라부에 의해 촬영된 제1 패널부에 대한 영상 프레임으로부터 마커 정보를 식별할 수 있다. 여기서 마커 정보는 패턴, 특징, 또는 식별자를 포함할 수 있다. 다음에, 제1 프로세서는 마커(206-1)에 대한 2D 이미지 위치를 산출할 수 있다. 제1 프로세서는 마커(206-1)가 제1 카메라부의 화면 상에 어디에 있는지를 나타내는 2D 이미 지 위치를 산출할 수 있다. 여기서, 마커(206-1))에 대한 2D 이미지 위치는 마커(206-1)의 중심 또는 특정 포 인트를 기준으로 하여 산출할 수 있다. 그 다음에, 제1 프로세서는 제1 카메라부에 대한 카메라 파 라미터 정보를 추정할 수 있다. 여기서 카메라 파라미터 정보는 내부 파라미터 정보 및 외부 파라미터 정보를 포함할 수 있다. 내부 파라미터 정보는 렌즈의 왜곡, 초점 거리, 이미지 센서의 해상도 등과 관련된 카메라의 내부 특성에 대한 정보를 포함할 수 있다. 외부 파라미터 정보는 카메라의 위치와 방향에 대한 정보로, 카메라 가 어떤 위치에서 어떤 방향으로 향하고 있는지 나타내는 3D 위치를 포함할 수 있다. 그 다음에, 제1 프로세서 는 마커(206-1)의 2D 위치를 3D로 변환할 수 있다. 제1 프로세서는 카메라 파라미터 정보를 이용하 여 마커(206-1)에 대한 2D 이미지 위치를 3D 공간으로 변환할 수 있다. 구체적으로, 제1 프로세서는 제1 카메라부의 위치와 방향을 고려하여 마커(206-1)에 대한 2D 이미지 상의 위치를 3D 공간으로 매핑할 수 있 다. 그 다음에 제1 프로세서는 마커(206-1)에 대한 3D 위치를 산출할 수 있다. 마커(206-1)에 대한 3D 위치는 제1 카메라부 및 마커(206-1) 사이의 상대적인 위치를 나타낼 수 있다. 마커(206-1)에 대한 3D 위 치는 X, Y, Z 좌표로 표현될 수 있다. 마커(206-1)에 대한 3D 위치는 마커(206-1)가 용접 토치의 어느 부 분에 위치하는지를 나타낼 수 있다. 그 다음에, 제1 프로세서는 마커(206-1)에 대한 3D 위치 정보를 이용 하여 마커(206-1)와 용접 토치 사이의 상대적인 위치를 산출할 수 있다. 마커(206-1)와 용접 토치 사이의 상대적인 위치는 마커(206-1)가 용접 토치의 어느 부분에 위치하는지 정확하게 나타낼 수 있다. 그 다음에, 제1 프로세서는 마커(206-1)의 위치 정보를 실시간으로 업데이트하고, 마커(206-1)의 움직임을 추적할 수 있다. 본 실시 예에서 토치 방향 정보는 용접봉이 용접 모재 상에서 어떤 방향을 향하고 있는지 나타내는 정보를 포함할 수 있다. 제1 프로세서가 토치 방향 정보를 생성하는 구체적인 설명은 다음과 같다. 먼저, 제1 프로세서는 마커(206-1)를 식별할 수 있다. 다음에, 제1 프로세서는 마커(206-1)에 대한 2D 이미지 위치를 산출할 수 있다. 그 다음에, 제1 프로세서는 제1 카메라부에 대한 카메라 파라미터 정보를 추정할 수 있다. 그 다음에, 제1 프로세서는 마커(206-1)의 2D 위치를 3D로 변환할 수 있다. 그 다음에, 제1 프로세서는 마커(206-1)의 3D 방향 벡터를 산출할 수 있다. 그 다음에, 제1 프로세서는 마커 (206-1)의 3D 위치와 제1 카메라부의 3D 위치를 이용하여 마커(206-1)로부터 제1 카메라부까지의 벡 터로서의 제1 벡터를 산출할 수 있다. 그 다음에, 마커(206-1)의 2D 위치를 사용하여, 제1 카메라부의 방 향 벡터와 수직인 벡터로서의 제2 벡터를 산출할 수 있다. 여기서, 제2 벡터는 제1 카메라부에서 마커 (206-1)를 향하는 방향일 수 있다. 그 다음에, 제1 벡터 및 제2 벡터의 외적을 이용하여 토치 방향 벡터를 산 출할 수 있다. 여기서, 외적을 구하기 위해 cross_product 함수가 이용될 수 있다. 선택적 실시 제1 프로세서는 상술한 토치 방향 정보를 이용하여 토치 각도를 산출할 수 있다. 먼저, 제1 프로세서는 정규화된 제1 벡터와 정규화된 제2 백터의 내적(dot product)를 산출할 수 있다. 다음에, 제1 프로세서는 내적 값 및 역 코사인 함수를 이용하여 각도를 산출할 수 있다. 본 실시 예에서 거리 정보는, 용접 모재로부터 용접 정보 제공 장치까지의 거리를 나타내는 정보를 포함할 수 있다. 구체적으로 거리 정보는 용접 모재로부터 제1 프로세서에 구비된 제1 카메라부까지의 거리 를 나타내는 정보를 포함할 수 있다. 본 실시 예에서 거리 정보는, 기설정된 용접봉 및 마커(206-1)가 구 비된 제1 패널부사이의 거리 정보(예를 들어, 수치적인 한정으로 10츠)와, 마커(206-1)로부터 제1 카메라 부까지의 거리 정보를 합산한 결과를 포함할 수 있다. 제1 프로세서가 거리 정보를 생성하는 구체적 인 설명은 다음과 같다. 먼저, 제1 프로세서는 제1 카메라부에 의해 촬영된 제1 패널부에 대한 영상 프레임에 이미지 처리 기술 및 비전 기술을 적용하여 마커(206-1)를 검출할 수 있다. 다음에, 제1 프로세 서는 제1 카메라부에 대한 카메라 파라미터 정보를 추정할 수 있다. 그 다음에, 제1 프로세서 는 마커(206-1)에 대한 2D 이미지 위치를 산출할 수 있다. 그 다음에, 제1 프로세서는 2D 이미지 위치 및 카메라 파라미터 정보를 이용하여 마커(206-1)로부터 제1 카메라부까지의 거리 정보를 산출할 수 있다. 마커(206-1)로부터 제1 카메라부까지의 거리는, 실제 마커 크기 및 초점 거리의 곱을, 마커의 이미지 크기 로 나눈값으로 산출될 수 있다. 여기서, 실제 마커 크기는 기설정되어 있는 마커(206-1)의 실제 크기를 나타낼 수 있다. 초점 거리는 제1 카메라부의 초점 거리를 나타낼 수 있다. 마커의 이미지 크기는 마커 이미지 로부터 산출된 마커(206-1)의 2D 이미지 크기를 나타낼 수 있다. 그 다음에, 제1 프로세서는 기설정된 용 접봉 및 마커(206-1)가 구비된 제1 패널부사이의 거리 정보와, 마커(206-1)로부터 제1 카메라부(12 0)까지의 거리 정보를 합산하여 용접 모재로부터 용접 정보 제공 장치까지의 거리 정보를 산출할 수 있다. 제1 프로세서는 제1 카메라부와, 제1 센서부에 구비된 적어도 하나의 센서와, 용접 토치에 구비된 적어도 하나의 센서 중 하나 이상으로부터 용접 위치, 용접 방향, 용접 각도, 용접 기울기, 용접 속도 및 상기 용접 모재와 상기 용접 토치 사이의 간격 중 하나 이상을 포함하는 용접 상황에 대한 정보의 감지 결과 를 수신할 수 있다. 선택적 실시 예로 제1 프로세서는 제1 카메라부와, 제1 센서부에 구비된 적어도 하나의 센서와, 용접 토치에 구비된 적어도 하나의 센서 중 하나 이상으로부터 수신한 신호를 기반 으로 하여 상술한 용접 상황에 대한 정보를 산출 또는 생성할 수 있다. 제1 프로세서는 마커 관련 정보 및 용접 상황에 대한 정보를 기반으로 작업 지시, 작업 변경 및 작업 중지 중 하나 이상을 포함하는 용접 가이드 정보를 기반으로 하여 용접 상황에 대한 정보를 가이딩 하는 용접 가이드 정보를 생성하고, 용접 가이드 정보를 표시부에 출력할 수 있다. 제1 프로세서는 메모리(미도시)에 저장된 각종 프로그램을 이용하여 용접 정보 제공 장치의 전반적인 동작을 제어할 수 있다. 메모리는 제1 프로세서와 동작 가능하게 연결되고, 제1 프로세서에서 수행 되는 동작과 연관하여 적어도 하나의 코드를 저장할 수 있다. 또한, 메모리는 제1 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행할 수 있다. 제1 프로세서는 CPU, 램(RAM), 롬(ROM), 시스템 버스를 포함할 수 있다. 여기서, 롬은 시스템 부팅을 위 한 명령어 세트가 저장되는 구성이고, CPU는 롬에 저장된 명령어에 따라 용접 정보 제공 장치의 메모리에 저장된 운영체제를 램에 복사하고, O/S를 실행시켜 시스템을 부팅시킬 수 있다. 부팅이 완료되면, CPU는 메모 리에 저장된 각종 애플리케이션을 램에 복사하고, 실행시켜 각종 동작을 수행할 수 있다. 이상에서는 제1 프로 세서가 하나의 CPU만을 포함하는 것으로 설명하였지만, 구현 시에는 복수의 CPU(또는 DSP, SoC 등)으로 구 현될 수 있다. 본 실시 예에서 제1 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세서(microprocessor), 및/또는 TCON(time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 제1 프로세서는 프로세싱 알고리즘이 내장된 SoC(system on chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(field programmable gate array) 형태로 구현될 수도 있다. 도 5 및 도 6은 도 1의 용접 시스템 중 용접 토치의 사시도이다. 이하의 설명에서 도 1 내지 도 4에 대한 설명 과 중복되는 부분은 그 설명을 생략하기로 한다. 도 5 및 도 6을 참조하면, 용접 토치는 용접봉, 토 치 헤드, 가이드부, 백 캡, 손잡이부, 제1 패널부 및 제1 조명부를 포함할 수 있다. 용접봉은 손잡이부에 구비된 버튼의 입력에 대응하여 전기적 아크를 발생시킬 수 있다. 용접봉(20 1)의 선단부는 토치 헤드의 전방으로 돌출된 상태로 고정되거나, 토치 헤드의 내부로 삽입된 상태로고정될 수 있다. 용접봉은 텅스텐 전극으로 구성될 수 있다. 토치 헤드의 일측에는 용접봉이 구비되고, 토치 헤드의 타측에는 가이드부가 구비될 수 있 다. 가이드부의 일측에는 토치 헤드가 구비되고, 가이드부의 타측에는 백 캡이 구비될 수 있다. 가이드부의 하부에는 손잡이가 구비될 수 있다. 본 실시 예에서 토치 헤드 및 백 캡 사이에 구비된 가이드부의 외측에는 제1 패널부가 구 비될 수 있다. 제1 패널부는 용접 위치를 식별하는 마커(206-1)가 구비될 수 있다. 본 실시 예에서 마커 (206-1)는 시각적 패턴 또는 표식을 포함할 수 있다. 이러한 마커(206-1)는 AR(augmented reality, 증강현실) 마커를 포함할 수 있다. 마커(206-1)는 시각적으로 식별 가능한 패턴을 포함할 수 있다. 마커(206-1)는 고유한 식별자를 포함할 수 있 다. 고유한 식별자는 마커(206-1)를 식별하고, 마커(206-1)에 연결된 정보나 작업을 구별하는데 이용될 수 있 다. 제1 카메라부는 제1 패널부에 포함되는 마커(206-1)를 촬영할 수 있다. 본 실시 예에서 제1 패널부는 가이드부의 외측을 감싸는 복수 개의 면 중 하나 이상에 구비될 수 있 다. 가이드부의 하부에는 손잡이부가 구비되어 있으므로, 제1 패널부는 가이드부의 좌측, 우측 및 상부에 3개가 구비될 수 있다. 이로써 마커(206-1) 또한 제1 패널부의 개수와 동일하게 구비될 수 있다. 본 실시 예에서, 가이드부 및 제1 패널부 사이에는 제1 조명부가 구비될 수 있다. 다시 말해 제1 패널부의 하부에는 제1 조명부가 구비될 수 있다. 제1 조명부는 제1 패널부로 조명을 공급할 수 있다. 본 실시 예에서 제1 조명부의 개수와 제1 패널부의 개수는 동일할 수 있다. 도 7은 도 1의 용접 시스템 중 용접 토치의 구성을 개략적으로 설명하기 위하여 도시한 블록도이다. 이하의 설 명에서 도 1 내지 도 6에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 7을 참조하면, 용접 토 치는 제2 통신부, 제2 센서부 및 제2 프로세서를 포함할 수 있다. 제2 통신부는 네트워크와 연동하여 용접 정보 제공 장치 및 용접 토치 간의 송수신 신호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공할 수 있다. 제2 통신부는 용접 정보 제 공 장치의 요청에 의해 용접 상황에 대한 정보를 용접 정보 제공 장치로 전송할 수 있다. 제2 통신 부는 용접 정보 제공 장치로부터 용접 토치를 제어하기 위한 명령을 수신할 수 있다. 본 실시 예에서 용접 토치를 제어하기 위한 명령은 용접 가이드 정보를 포함할 수 있다. 본 실시 예에서 제2 통신 부는 용접 가이드 정보를 용접 토치 이외의 외부 장치로 전송할 수 있다. 여기서, 외부 장치는 작업 자/제3자의 스마트폰, 컴퓨터 등 통신 모듈을 포함하는 다양한 장치를 포함할 수 있다. 제2 통신부는 근거리 무선 통신(예를 들어, 블루투스(Bluetooth), Wifi, Wifi-Direct) 또는 원거리 무선 통신(3G, HSDPA(high-speed downlink packet access) 또는 LTE(long term evolution))이 가능한 모듈을 포함할 수 있다. 제2 센서부는 센서부는 용접 토치에 포함되어 용접 온도, 용접 속도, 용접 기울기, 용접 방향 및 모제와 용접 토치 간의 간격 등을 포함하는 용접 상황에 대한 정보를 감지할 수 있다. 제2 센서부는 용접 토치를 파지한 작업자의 자세 변화, 용접면의 조도 변화, 용접 토치의 가속 도 변화 등과 같은 다양한 변화들 중 적어도 하나를 검출하고, 그에 해당하는 전기적 신호를 제2 프로세서(23 0)로 전달할 수 있다. 즉, 제2 센서부는 용접 토치를 기반으로 이루어지는 상태 변화를 감지하고, 그에 따른 감지 신호를 생성하여 제2 프로세서로 전달할 수 있다. 본 실시 예에서 제2 센서부는 다양한 센서들로 이루어질 수 있으며, 용접 토치 구동 시(또는 사용자 설정 기반) 제어에 따라 기 설정된 적어도 하나의 센서에 전원이 공급되어 용접 토치의 상태 변화를 감지 할 수 있다. 이 경우, 제2 센서부는 용접 토치의 상태 변화를 검출할 수 있는 모든 형태의 센싱 디바이스 (sensing device)들 중 적어도 하나의 디바이스를 포함하여 구성될 수 있다. 예를 들어, 제2 센서부는 가 속도 센서(Acceleration Sensor), 자이로 센서(Gyro Sensor), 조도 센서(illuminance sensor), 근접 센서 (proximity sensor), 압력 센서(pressure sensor), 노이즈 센서(Noise Sensor), 비디오 센서(Video Sensor), 중력 센서 등과 같은 다양한 센싱 디바이스들 중 적어도 하나의 센서를 포함하여 구성될 수 있다. 용접 토치 의 조도 센서를 통해 감지된 용접 작업 영역 내의 광 정도는 제2 통신부를 통해 제1 프로세서로전달될 수 있고, 제1 프로세서는 용접 정보 제공 장치의 제1 센서부를 통하지 않고, 용접 토치 의 조도 센서를 통해 전달된 광 정도를 바탕으로 조명부(미도시) 및/또는 제1 카메라부를 제어할 수 있다. 한편, 가속도 센서는 용접 토치의 움직임을 감지할 수 있다. 구체적으로, 가속도 센서는 용접 토치 의 가속도, 진동, 충격 등의 동적인 힘을 측정할 수 있으므로, 용접 토치의 움직임을 측정할 수 있다. 중력 센서는 중력이 향하는 방향을 감지하기 위한 구성요소이다. 즉, 중력 센서의 감지결과는 가속도 센서와 함 께 용접 토치의 움직임을 판단하는데 사용될 수 있다. 또한, 중력센서를 통해 용접 토치가 파지된 방 향이 판단될 수 있다. 상술한 종류의 센서 외에도, 용접 토치는 자이로스코프 센서, 지자기센서, 초음파 센서, RF 센서와 같은 다양한 종류의 센서를 더 포함할 수 있고, 용접 작업 환경과 관련된 다양한 변화를 감지할 수 있다. 제2 프로세서는 용접 정보 제공 장치의 요청에 의해, 제2 센서부가 감지한 신호 및/또는 용접 상황에 대한 정보를 용접 정보 제공 장치로 전송하도록 제어할 수 있다. 선택적 실시 예로 제2 프로세서 는 용접 상황에 대한 정보를 산출 또는 생성할 수도 있다. 제2 프로세서는 손잡이부에 구비된 버튼의 입력이 수신되면, 용접봉을 통하여 전기적인 아크를 발생시킬 수 있다. 또한 제2 프로세서는 손잡이부에 구비된 버튼의 입력이 수신되면, 조명부가 동작되도록 제어할 수 있다. 제2 프로세서는 손잡이부에 구비된 버튼의 입력 해제가 수신되면, 조명 부가 동작을 종료하도록 제어할 수 있다. 제2 프로세서는 메모리(미도시)에 저장된 각종 프로그램을 이용하여 용접 토치의 전반적인 동작을 제 어할 수 있다. 메모리는 제2 프로세서와 동작 가능하게 연결되고, 제2 프로세서에서 수행되는 동작 과 연관하여 적어도 하나의 코드를 저장할 수 있다. 또한, 메모리는 제2 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행할 수 있다. 도 8은 도 1의 용접 시스템 중 용접 정보 제공 장치의 동작을 설명하는 예시도이다. 이하의 설명에서 도 1 내 지 도 7에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 8을 참조하면, 용접 정보 제공 장치가 작업지도서를 수신하여 디스플레이 하는 것을 나타내고 있다. 용접 정보 제공 장치는 외부 장치로부터 무선통신을 통해 수신한 작업지도서를 작업자가 볼 수 있도록 표 시부에 출력할 수 있다. 제1 프로세서는 제1 통신부에 의한 작업지도서 수신이 확인되면, 이를 표시부에 디스플레이 할 수 있다. 여기서, 외부 장치는 작업자/제3자의 스마트폰, 컴퓨터 등 통신 모듈을 포함하는 다양한 전자 장치를 포함할 수 있다. 또한 외부 장치는 별도의 서버(미도시) 또는 용접 관리 장치(도 7의 400)를 포함할 수 있다. 본 실시 예에서 작업지도서는 용접 부분에 요구되는 제반 용접 조건이 상세하게 개시되어 있는 용접 절차 시방서 (welding procedure specification, WPS)나 절차 품질 기록서(procedure qualification record, PQR) 등을 포 함할 수 있다. 제1 프로세서는 작업지도서와, 마커 관련 정보를 기반으로 하여 용접 상황에 대한 정보를 가이딩 하는 용 접 가이드 정보를 생성하고, 용접 가이드 정보를 표시부에 출력할 수 있다. 작업자는 용접 정보 제공 장치의 표시부에 출력된 작업지도서를 참조하여 실질적인 용접 작업을 수행 할 수 있다. 도 9는 본 개시의 일 실시 예에 따른 용접 시스템의 동작 방법을 설명하기 위한 흐름도이다. 이하의 설명에서 도 1 내지 도 8에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 본 실시 예에 따른 용접 시스템의 동작 방법은 용접 정보 제공 장치가 용접 토치 및 주변 구성 요소들의 도움을 받아 제1 프로세서 에서 수행한다고 가정하고 설명하기로 한다. 도 9를 참조하면, S910단계에서, 제1 프로세서는 용접 토치에 구비된 마커(206-1)를 촬영하도록 제1 카메라부의 동작을 제어할 수 있다. 제1 프로세서의 제어에 의해 제1 카메라부는 용접 토치 의 제1 패널부에 포함된 마커(206-1)를 촬영할 수 있다. S920단계에서, 제1 프로세서는 제1 카메라부로부터 마커(206-1)를 촬영한 영상 프레임을 수신하여 마 커 관련 정보를 생성할 수 있다. 본 실시 예에서 마커 관련 정보는 마커 위치정보, 토치 방향 정보 및 용접 모재로부터 용접 정보 제공 장치까지의 거리 정보 중 하나 이상을 포함하는 마커 관련 정보를 생성할 수 있다. S930단계에서, 제1 프로세서는 제1 카메라부와, 제1 센서부에 구비된 적어도 하나의 센서와, 용 접 토치에 구비된 적어도 하나의 센서 중 하나 이상으로부터 용접 상황에 대한 정보의 감지 결과를 수신할 수 있다. 본 실시 예에서 용접 상황에 대한 정보는, 용접 위치, 용접 온도, 용접 방향, 용접 기울기, 용접 속 도 및 용접 모재와 용접 토치 사이의 간격 중 하나 이상을 포함할 수 있다. 선택적 실시 예로 제1 프로세서 는 제1 카메라부와, 제1 센서부에 구비된 적어도 하나의 센서와, 용접 토치에 구비된 적어 도 하나의 센서 중 하나 이상을 통해 감지한 신호를 이용하여 용접 상황에 대한 정보를 산출 또는 생성할 수 있 다. S940단계에서, 제1 프로세서는 마커 관련 정보 및 용접 상황에 대한 정보를 기반으로 용접 가이드 정보를 생성할 수 있다. 본 실시 예에서 용접 가이드 정보는 작업 지시, 작업 변경 및 작업 중지 중 하나 이상을 포함 할 수 있다. 더 나아가 용접 가이드 정보는 상술한 바와 같이 가이딩과 관련한 일련의 정보를 포함할 수 있다. S950단계에서, 제1 프로세서는 용접 가이드 정보를 표시부에 시각적 정보로 출력할 수 있다. 본 실 시 예에서 제1 프로세서는 용접 가이드 정보를 스피커에 청각적 정보로 출력할 수도 있다. 도 10은 본 개시의 다른 실시 예에 따른 용접 시스템의 예시도이다. 이하의 설명에서 도 1 내지 도 9에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 10을 참조하면, 다른 실시 예에 따른 용접 시스템 은 용접 정보 제공 장치, 용접 토치, 네트워크 및 용접 관리 장치를 포함할 수 있다. 본 실시 예에서, 용접 정보 제공 장치, 용접 토치 및 네트워크와 관련한 내용은 상술한 내용과 동 일하므로 생략하기로 한다. 용접 관리 장치는 네트워크를 통하여 용접 정보 제공 장치 및 용접 토치와 연결되고, 용접 정보 제공 장치로 작업자가 용접 기술을 습득하고 안전한 용접을 수행하도록 가이드 해주는 용접 교육용 콘텐츠를 제공할 수 있다. 본 실시 예에서 용접 교육용 콘텐츠는 용접 기술 안내, 용접 장비 사용, 용접 안전, 용접 품질 관리, 실제 용접 시나리오, 시각자료 및 비디오, 인터랙티브 학습 등과 관련한 다양한 정보를 포함할 수 있다. 본 실시 예에서 용접 관리 장치는 숙련된 작업자에 대한 용접 작업 영상 데이터를 수신하고, 숙련된 작업 자의 용접 결과 분석을 통해 추출된 노하우 정보의 중요도를 용접 교육용 콘텐츠에 적용할 수 있다. 용접 관리 장치는 용접 교육용 콘텐츠를 데이터베이스로 구축할 수 있다. 용접 관리 장치는 용접 교육용 콘텐츠에 대응하여 용접 정보 제공 장치로부터 수신한 작업자의 용접 결과를 수신할 수 있다. 용접 관리 장치는 작업자의 용접 결과 및 기설정된 숙련자의 용접 결과의 비교를 통하여, 용접 정보 제공 장치로 작업자의 용접 결과에 대하여 조언하는 용접 어드바이스 정보를 제공할 수 있다. 본 실시 예에서 용접 어드바이스 정보는 시각적 정보 및 청각적 정보 중 하나 이상을 포함할 수 있다. 본 실시 예에서 용접 어드바이스 정보는 용접 정보 제공 장치 및 작업자의 단말기(미도시, 예를 들어, 스마트폰, 컴퓨터 등) 중 하나 이상으로 출력될 수 있다. 용접 관리 장치는 각종 인공지능 알고리즘을 적용하는데 필요한 데이터를 제공하는 데이터베이스 서버일 수 있다. 용접 관리 장치는 인공지능 알고리즘을 이용하여 용접 어드바이스 정보를 예측하고, 예측한 용 접 어드바이스 정보를 용접 정보 제공 장치 및 작업자의 단말기 중 하나 이상으로 제공할 수 있다. 여기서 인공 지능(artificial intelligence, AI)은, 인간의 지능으로 할 수 있는 사고, 학습, 자기계발 등을 컴 퓨터가 할 수 있도록 하는 방법을 연구하는 컴퓨터 공학 및 정보기술의 한 분야로, 컴퓨터가 인간의 지능적인 행동을 모방할 수 있도록 하는 것을 의미할 수 있다. 또한, 인공지능은 그 자체로 존재하는 것이 아니라, 컴퓨터 과학의 다른 분야와 직간접으로 많은 관련을 맺고 있다. 특히 현대에는 정보기술의 여러 분야에서 인공지능적 요소를 도입하여, 그 분야의 문제 풀이에 활용하려 는 시도가 매우 활발하게 이루어지고 있다. 머신 러닝(machine learning)은 인공지능의 한 분야로, 컴퓨터에 명시적인 프로그램 없이 배울 수 있는 능력을 부여하는 연구 분야를 포함할 수 있다. 구체적으로 머신 러닝은, 경험적 데이터를 기반으로 학습을 하고 예측 을 수행하고 스스로의 성능을 향상시키는 시스템과 이를 위한 알고리즘을 연구하고 구축하는 기술이라 할 수 있다. 머신 러닝의 알고리즘들은 엄격하게 정해진 정적인 프로그램 명령들을 수행하는 것이라기보다, 입력 데이 터를 기반으로 예측이나 결정을 이끌어내기 위해 특정한 모델을 구축하는 방식을 취할 수 있다. 이러한 인공신경망의 머신 러닝 방법으로는 자율학습(unsupervised learning)과 지도학습(supervised learning)이 모두 사용될 수 있다. 또한, 머신 러닝의 일종인 딥러닝(deep learning) 기술은 데이터를 기반으 로 다단계로 깊은 수준까지 내려가 학습할 수 있다. 딥러닝은 단계를 높여갈수록 복수의 데이터들로부터 핵심 적인 데이터를 추출하는 머신 러닝 알고리즘의 집합을 나타낼 수 있다. 본 실시 예에서 용접 관리 장치는 서버 형태로 독립적으로 존재하거나, 용접 관리 장치가 제공하는 용접 교육용 콘텐츠 및 용접 어드바이스 정보를 포함하는 작업자에 대한 용접 교육 기능을 어플리케이션 형태로 구현하여 작업자의 단말기에 탑재할 수 있다. 작업자의 단말기는 용접 관리 장치가 제공하는 용접 교육 어플리케이션 및/또는 용접 교육 사이트에 접속 하여 용접 교육 서비스를 받을 수 있다. 도 11은 도 10의 용접 시스템 중 용접 관리 장치의 구성을 개략적으로 설명하기 위하여 도시한 블록도이다. 이 하의 설명에서 도 1 내지 도 7에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 8을 참조하면, 용접 관리 장치는 제3 통신부, 제3 프로세서 및 메모리를 포함할 수 있다. 제3 통신부는 네트워크와 연동하여 용접 정보 제공 장치, 용접 토치 및 용접 관리 장치 사이의 송수신 신호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공할 수 있다. 여기 서, 통신 인터페이스라 함은, 용접 정보 제공 장치, 용접 토치 및 용접 관리 장치를 연결하는 역할을 수행하는 매개체로써, 용접 관리 장치가 용접 정보 제공 장치 및 용접 토치 중 하나 이 상에 접속한 후 정보를 송수신할 수 있도록 접속 경로를 제공하는 경로를 포함할 수 있다. 또한 제3 통신부 는 다른 네트워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치일 수 있다. 제3 프로세서는 용접 정보 제공 장치로 작업자가 용접 기술을 습득하고 안전한 용접을 수행하도록 가 이드 해주는 용접 교육용 콘텐츠를 제공할 수 있다. 본 실시 예에서 용접 교육용 콘텐츠는 용접 기술 안내, 용 접 장비 사용, 용접 안전, 용접 품질 관리, 실제 용접 시나리오, 시각자료 및 비디오, 인터랙티브 학습 등과 관 련한 다양한 정보를 포함할 수 있다. 용접 교육용 콘텐츠 중 용접 기술 안내와 관련한 정보는 용접의 기본 원리와 다양한 용접 기술에 대한 설명을 포함할 수 있다. 용접 기술 안내와 관련한 정보의 학습을 통하여 작업자들은 어떻게 용접을 수행해야 하는지 이해할 수 있다. 용접 교육용 콘텐츠 중 용접 장비 사용과 관련한 정보는 용접 장비 및 도구의 올바른 사용 방법을 가이딩 하는 정보를 포함할 수 있다. 구체적으로 용접 장비 사용과 관련한 정보는 용접 정보 제공 장치 및 용접 토치 의 조작 방법과 유지 관리 방법을 가이딩 하는 정보를 포함할 수 있다. 용접 교육용 콘텐츠 중 용접 안전과 관련한 정보는 용접 작업 중 발생할 수 있는 위험에 대한 경고 및 안전 절 차를 가이딩 하는 정보를 포함할 수 있다. 용접 교육용 콘텐츠 중 용접 품질 관리와 관련한 정보는 용접 품질에 대한 이해를 촉진하고 품질 관리 절차 및 테스트 방법을 가이딩 하는 정보를 포함할 수 있다. 용접 교육용 콘텐츠 중 용접 실제 시나리오와 관련한 정보는 실제 용접 시나리오를 시뮬레이션 하거나 실제 작 업을 가이딩 하는 정보를 포함할 수 있다. 이를 통해 작업자는 실전에서 어떻게 대응해야 하는지 연습할 수 있 다. 용접 교육용 콘텐츠 중 시각자료 및 비디오와 관련한 정보는 용접과 관련한 그림, 그래프, 도면 및 비디오 등의 시각 자료를 포함할 수 있다. 이를 통하여 작업자에게 용접에 대한 설명을 보다 명확하게 전달할 수 있다. 용접 교육용 콘텐츠 중 인터랙티브 학습과 관련한 정보는 퀴즈, 시뮬레이션, 인터랙티브 연습 문제 등을 포함할 수 있다. 이를 통하여 작업자 자신의 용접 관련 이해도를 향상시킬 수 있다. 제3 프로세서는 숙련된 작업자에 대한 용접 작업 영상 데이터를 수신하고, 숙련된 작업자의 용접 결과 분 석을 통해 추출된 노하우 정보의 중요도를 용접 교육용 콘텐츠에 적용할 수 있다.제3 프로세서는 용접 교육용 콘텐츠에 대응하여 용접 정보 제공 장치로부터 수신한 작업자의 용접 결 과를 수신할 수 있다. 제3 프로세서는 작업자의 용접 결과 및 기설정된 숙련자의 용접 결과의 비교를 통 하여, 용접 정보 제공 장치로 작업자의 용접 결과에 대하여 조언하는 용접 어드바이스 정보를 생성하여 제 공할 수 있다. 본 실시 예에서, 제3 프로세서는 용접 교육용 콘텐츠에 포함된 실제 용접 시나리오를 용접 정보 제공 장치 로 제공할 수 있다. 제1 카메라부는 용접 토치의 제1 패널부에 구비된 마커(206-1)를 이 용하여 작업자가 수행한 용접 결과 영상 프레임을 획득할 수 있다. 제3 프로세서는 제1 카메라부가 획득한 용접 결과 영상 프레임을 수신할 수 있다. 제3 프로세서는 작업자가 수행한 용접 결과 영상 프레 임 및 기설정된 숙련자의 용접 결과 영상 프레임의 비교를 통하여, 용접 정보 제공 장치로 작업자의 용접 결과에 대하여 조언하는 용접 어드바이스 정보를 생성하여 제공할 수 있다. 제3 프로세서는 작업자의 용접 결과 및 기설정된 숙련자의 용접 결과의 비교하여 용접 작업의 정확도, 완 성도, 불량률 등을 평가하고 용접 어드 바이스 정보를 생성할 수 있다. 여기서, 용접 어드바이스 정보는 작업 자가 용접 시에 개선해야 할 부분과, 잠재적인 위험 요소와, 기술적인 조언과, 용접 품질 향상을 위한 제안 등 을 포함할 수 있다. 제3 프로세서는 용접 어드바이스 정보를 용접 정보 제공 장치 및 작업자의 단말기 중 하나 이상으로 출력할 수 있다. 선택적 실시 예로, 제3 프로세서는 용접 결과 영상 프레임을 수신하여 용접 어드바이스 정보를 예측하도록 미리 훈련된 심층신경망 모델을 이용하여 작업자의 용접 결과에 대응하는 용접 결과 영상 프레임을 수신하여 용 접 어드바이스 정보를 예측할 수 있다. 여기서, 심층신경망 모델은, 용접 결과 영상 프레임을 입력으로 하고, 용접 어드바이스 정보를 레이블로 하는 훈련데이터에 의해 지도학습 방식으로 훈련된 모델일 수 있다. 제3 프로세서 레이블링된 훈련데이터를 이용하여 초기에 설정된 심층신경망 모델을 지도학습 방식으로 훈 련할 수 있다. 여기서, 초기에 설정된 심층신경망 모델은 용접 어드바이스 정보를 예측할 수 있는 모델로 구성 되기 위해 설계된 초기 모델로서 파라미터 값들은 임의의 초기값으로 설정되어 있는 상태이다. 초기 모델은 상 술한 훈련데이터를 통해 훈련되면서 파라미터 값들이 최적화되어 용접 결과 영상 프레임에 대한 용접 어드바이 스 정보를 정확히 예측할 수 있는 예측 모델로 완성될 수 있다. 이러한 제3 프로세서는 용접 관리 장치 전체의 동작을 제어할 수 있다. 여기서, '프로세서 (processor)'는, 예를 들어 프로그램 내에 포함된 코드 또는 명령어로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로써, 마이크로프로세서, 중앙처리장치, 프로세서 코어, 멀티프로세서, ASIC, FPGA 등 의 처리 장치를 망라할 수 있으나, 본 개시의 범위가 이에 한정되는 것은 아니다. 메모리는 제3 프로세서와 동작 가능하게 연결되고, 제3 프로세서에서 수행되는 동작과 연관하여 적어도 하나의 코드를 저장할 수 있다. 또한, 메모리는 제3 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행할 수 있다. 여기서, 메모리는 자기 저장 매체 또는 플래시 저장 매체를 포함할 수 있으나, 본 개시의 범위 가 이에 한정되는 것은 아니다. 이러한 메모리는 내장 메모리 및/또는 외장 메모리를 포함할 수 있으며, DRAM, SRAM, 또는 SDRAM 등과 같은 휘발성 메모리, OTPROM, PROM, EPROM, EEPROM, mask ROM, flash ROM, NAND 플래시 메모리, 또는 NOR 플래시 메모리 등과 같은 비휘발성 메모리, SSD, CF 카드, SD 카드, Micro-SD 카드, Mini-SD 카드, xD 카드, 또는 메모리 스틱 등과 같은 플래시 드라이브, 또는 HDD와 같은 저장 장치를 포함할 수 있다. 도 12는 본 개시의 다른 실시 예에 따른 용접 환경의 예시도이다. 이하의 설명에서 도 1 내지 도 11에 대한 설 명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 12를 참조하면, 또 다른 실시 예에 따른 용접 시스템 은 용접 로봇을 포함할 수 있다. 용접 로봇은 자동 용접을 수행하는 용접 시스템으로서, 용접 공정에서 반복적이고 정확한 작업을 수행하여 용접 품질을 향상시키고 생산성을 향상시키는 데 사용될 수 있다. 용접 로봇은 프로그래밍되거나 센서 및 비전 시스템을 사용하여 용접 작업을 감독하며, 작업자의 안전을 강화하고 인력을 절약하는 역할을 할 수 있다. 본 실시 예에 따른 용접 로봇은 용접 다리, 관절부, 용접 바디, 용접 팔, 용접봉 헤 드, 용접봉, 제2 패널부 및 조명부, 제2 카메라부를 포함할 수 있다. 본 실시 예에 따른 용접 로봇은 다관절로 형성되는 구조로서, 다축계 구조일 수 있다. 다관절 구조는 다 수의 용접 다리와 관절부로 연결되어 각각 직선 운동 또는 회전 운동을 수행할 수 있다. 용접 다리는 와이어의 통과를 위한 중공을 지닌 중공형 모터(미도시), 와이어를 송급하는 송급 롤러(미도 시), 와이어의 송급 속도를 검출하는 속도 센서(미도시)를 구비할 수 있다. 중공형 모터는 추계 구동을 위한 일체형 조인트 구조일 수 있다. 중공형 모터는 중심축 상으로 일정한 직경의 관통공을 구비하여 와이어의 통과 를 허용할 수 있다. 송급 롤러는 별도의 모터(미도시)에 연결되고 마찰력에 의해 이송력을 제공할 수 있다. 속도 센서는 와이어의 이송부하를 증가시키지 않도록 비접촉 방식으로 구성될 수 있다. 본 실시 예에서 용접 다리와 관절부는 용접 바디에 포함될 수 있다. 이로부터 용접 바디 는 용접을 위해 이동할 수 있다. 용접 바디의 측면에는 용접 팔이 구비되고, 용접 팔의 일 측 에는 용접봉 헤드 및 용접봉이 구비될 수 있다. 용접봉은 용접 모재에 전기적 아크를 발생시켜 용접을 수행할 수 있다. 본 실시 예에서 용접봉 헤드 및 용접봉의 직선 이동 및 회전 이동에 의한 미세한 3차원 동작은 와이어로 연결된 모터(미도시)의 구동에 의해 동작할 수 있다. 본 실시 예에서, 용접 바디와 연결되는 용접 팔 및 용접봉 사이에는 용접봉 헤드가 구비될 수 있다. 용접봉 헤드의 외측에는 제2 패널부가 구비될 수 있다. 선택적 실시 예로 제2 패널부 는 용접 팔에 구비될 수도 있다. 제2 패널부는 용접 위치를 식별하는 마커(507-1)가 구비될 수 있다. 본 실시 예에서 마커(507-1)는 시각 적 패턴 또는 표식을 포함할 수 있다. 이러한 마커(507-1)는 AR(augmented reality, 증강현실) 마커를 포함할 수 있다. 마커(507-1)는 시각적으로 식별 가능한 패턴을 포함할 수 있다. 마커(507-1)는 고유한 식별자를 포함할 수 있 다. 고유한 식별자는 마커(507-1)를 식별하고, 마커(507-1)에 연결된 정보나 작업을 구별하는데 이용될 수 있 다. 제2 카메라부는 제2 패널부에 포함되는 마커(507-1)를 촬영할 수 있다. 본 실시 예에서 제2 패널부는 용접봉 헤드의 외측을 감싸는 복수 개의 면 중 하나 이상에 구비될 수 있다. 제2 패널부는 가이드부의 좌측, 우측, 상부 및 하부에 4개가 구비될 수 있다. 이로써 마커 (507-1) 또한 제2 패널부의 개수와 동일하게 구비될 수 있다. 본 실시 예에서, 용접봉 헤드 및 제2 패널부 사이에는 제2 조명부가 구비될 수 있다. 다시 말 해 제2 패널부의 하부에는 제2 조명부가 구비될 수 있다. 제2 조명부는 제2 패널부로 조 명을 공급할 수 있다. 본 실시 예에서 제2 조명부의 개수와 제2 패널부의 개수는 동일할 수 있다. 도 13은 도 12의 용접 시스템 중 용접 로봇의 구성을 개략적으로 설명하기 위하여 도시한 블록도이다. 이하의 설명에서 도 1 내지 도 12에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 13을 참조하면, 용 접 로봇은 제4 통신부, 제2 카메라부, 제3 센서부, 구동부 및 제4 프로세서를 포함할 수 있다. 제4 통신부는 네트워크와 연동하여 용접 로봇 및 후술하는 용접 관리 장치 간의 송수신 신 호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공할 수 있다. 제4 통신부는 용접 상 황에 대한 정보를 용접 관리 장치로 전송하고, 용접 관리 장치로부터 용접 로봇을 제어하기 위 한 명령을 송신할 수 있다. 본 실시 예에서 용접 로봇을 제어하기 위한 명령은 용접 가이드 정보를 포함 할 수 있다. 제2 카메라부는 용접봉 헤드의 외측에 구비된 제2 패널부를 촬영할 수 있다. 여기서 제2 패널 부에는 마커(507-1)가 포함되어 있으므로, 제2 카메라부는 마커 영상 프레임을 생성할 수 있다. 제2 카메라부는 예를 들어, 스마트폰(미도시)에 구비된 카메라를 포함할 수 있다. 본 실시 예에서 제2 카메라 부는 적어도 하나의 카메라를 포함할 수 있고, 용접 작업 현장에 대한 영상을 촬영할 수 있다. 본 실시 예에서 제2 카메라부는 용접 모재와 용접봉을 실시간으로 모니터링하고 영상을 촬영하는 비전 센서를 포함할 수 있다. 본 실시 예에서 마커(507-1)는 용접 작업에서 사용되는 시각적 식별자 또는 표식을 포함할 수 있다. 마커(507- 1)는 용접 위치를 식별하거나, 작업에 필요한 정보를 포함할 수 있다. 마커(507-1)는 주로 특수한 패턴, 기호,또는 식별자로 구성될 수 있다. 제3 센서부는 용접 로봇의 동작 및 용접 현장에 대한 다양한 정보를 감지하고, 용접 상황에 대한 정 보를 획득하기 위해 구성된 복수의 센서 모듈을 포함할 수 있다. 이때, 용접 상황에 대한 정보는 실시간 용접 작업에 대한 용접 위치, 용접 온도, 용접 방향, 용접 기울기, 용접 속도 및 용접 모재와 용접봉 사이의 간 격 등을 포함할 수 있다. 더욱이 제3 센서부는 적어도 용접 작업 영역 내에서 광 정도를 검출하도록 구성 된 광 센서를 포함할 수 있다. 제3 센서부는 용접 작업 중 발생하는 힘과 토크를 측정하는 힘 및 토크 센서를 포함할 수 있다. 이를 통 해 용접봉의 압력을 조절하고 용접 작업 중 발생하는 부하를 모니터링하여 용접 품질을 제어할 수 있다. 제3 센서부는 로봇의 움직임과 방향을 추적하고 제어하는 가속도계 및 자이로스코프를 포함할 수 있다. 이를 통해 로봇의 정확한 위치를 파악하고 용접 작업 중의 안정성을 유지할 수 있다. 제3 센서부는 용접 모재 와 용접봉 사이의 간격을 측정할 수 있다. 이를 통해 용접 로봇이 용접 모재에 충돌하는 것을 방지 하고 용접 지점에 정확하게 접근할 수 있다. 제3 센서부는 용접 작업 중 발생하는 가스 누출을 감지하고 모니터링 하는 가스 센서를 포함할 수 있다. 제3 센서부의 종류가 상술한 예시로 한정되지 않고, 용접 로 봇의 동작 및 용접 현장에 대한 다양한 정보를 감지하고, 용접 상황에 대한 정보를 획득할 수 있는 어떠한 센서도 포함될 수 있다. 구동부는 제4 프로세서의 제어 하에 용접 로봇을 구동할 수 있다. 구동부는 제4 프로세서 의 제어하게 용접 로봇의 위치, 속도 및 가속도를 조절하여 용접 로봇의 운동을 제어할 수 있다. 본 실시 예에서 구동부는 용접 로봇의 각 관절 또는 운동 축을 움직이고 위치, 속도, 토크 등 을 제어하는 서보 모터(미도시)를 포함할 수 있다. 더 나아가 구동부는 용접 로봇의 운동을 제어하 는 스텝 모터(미도시), 하이브리드 모터(미도시), 리니어 모터(미도시), 유압 및 공압 시스템(미도시) 등을 포 함할 수 있다. 제4 프로세서는 용접 로봇의 동작을 제어할 수 있다. 제4 프로세서는 제2 카메라부로부터 마커(507-1)를 촬영한 영상 프레임을 수신하여 마커 관련 정보를 생성할 수 있다. 여기서, 마커 관련 정보는 마커 위치정보, 토치 방향 정보 및 용접 모재로부터 용접 정보 제공 장치까지의 거리 정보 중 하나 이상을 포함 할 수 있다. 제4 프로세서는 제2 카메라부 및 제3 센서부 중 하나 이상으로부터 용접 상황에 대한 감지 결과 를 수신할 수 있다. 여기서, 용접 상황에 대한 감지 결과는 용접 위치, 용접 온도, 용접 방향, 용접 기울기, 용접 속도 및 용접 모재와 용접봉 사이의 간격 중 하나 이상을 포함할 수 있다. 제4 프로세서는 마커 관련 정보 및 용접 상황에 대한 정보를 기반으로 작업 지시, 작업 변경 및 작업 중지 중 하나 이상을 포함하는 용접 가이드 정보를 생성할 수 있다. 제4 프로세서는 용접 가이드 정보에 대응하여 용접 로봇의 동작을 제어할 수 있다. 용접 로봇 의 동작을 제어한다 함은, 용접 바디의 이동을 제어하고, 용접봉의 동작을 제어하는 것을 포함할 수 있다. 도 14는 본 개시의 또 다른 실시 예에 따른 용접 시스템의 예시도이다. 이하의 설명에서 도 1 내지 도 13에 대 한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 14를 참조하면 다른 실시 예에 따른 용접 시스템 은 네트워크, 용접 관리 장치 및 용접 로봇을 포함할 수 있다. 본 실시 예에서 용접 관리 장치는 용접 로봇의 동작을 제어하는 서버 또는 외부 장치일 수 있다. 용접 관리 장치는 용접 로봇으로부터 마커를 촬영한 영상 프레임을 수신하여 마커 관련 정보를 생성 할 수 있다. 용접 관리 장치는 용접 로봇로부터 용접 상황에 대한 정보의 감지 결과를 수신할 수 있 다. 용접 관리 장치는 마커 관련 정보 및 상기 용접 상황에 대한 정보를 기반으로 용접 가이드 정보를 생성할 수 있다. 용접 관리 장치는 용접 가이드 정보를 기반으로 용접 로봇의 동작을 제어하는 신호를 생성 하여 용접 로봇으로 전송할 수 있다. 이상 설명된 본 개시에 따른 실시 예는 컴퓨터 상에서 다양한 구성요소를 통하여 실행될 수 있는 컴퓨터 프로그 램의 형태로 구현될 수 있으며, 이와 같은 컴퓨터 프로그램은 컴퓨터로 판독 가능한 매체에 기록될 수 있다. 이 때, 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같은, 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 한편, 상기 컴퓨터 프로그램은 본 개시를 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 프로그램의 예에는, 컴파일러에 의하여 만들어지는 것 과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함될 수 있다. 본 개시의 명세서(특히 특허청구범위에서)에서 \"상기\"의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 또한, 본 개시에서 범위(range)를 기재한 경우 상기 범위에 속하는 개별적인 값을 적용한 개시를 포함하는 것으로서(이에 반하는 기재가 없다면), 개시의 상세한 설명에 상기 범위를 구성하 는 각 개별적인 값을 기재한 것과 같다. 본 개시에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 개시가 한정되는 것은 아니 다. 본 개시에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사용은 단순히 본 개시를 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 개시의 범위 가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물 의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 개시의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위 뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 개시의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2024-0032089", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 용접 환경의 예시도이다. 도 2는 본 개시의 일 실시 예에 따른 용접 시스템의 예시도이다. 도 3은 도 1의 용접 시스템 중 용접 정보 생성 장치의 구성을 개략적으로 설명하기 위하여 도시한 블록도이다. 도 4는 도 1의 용접 시스템 중 용접 정보 제공 장치의 사시도이다. 도 5 및 도 6은 도 1의 용접 시스템 중 용접 토치의 사시도이다. 도 7은 도 1의 용접 시스템 중 용접 토치의 구성을 개략적으로 설명하기 위하여 도시한 블록도이다. 도 8은 도 1의 용접 시스템 중 용접 정보 제공 장치의 동작을 설명하는 예시도이다. 도 9는 본 개시의 일 실시 예에 따른 용접 시스템의 동작 방법을 설명하기 위한 흐름도이다. 도 10은 본 개시의 다른 실시 예에 따른 용접 시스템의 예시도이다. 도 11은 도 10의 용접 시스템 중 용접 관리 장치의 구성을 개략적으로 설명하기 위하여 도시한 블록도이다. 도 12는 본 개시의 다른 실시 예에 따른 용접 환경의 예시도이다. 도 13은 본 개시의 다른 실시 예에 따른 용접 시스템 중 용접 로봇의 구성을 개략적으로 설명하기 위하여 도시 한 블록도이다. 도 14는 본 개시의 또 다른 실시 예에 따른 용접 시스템의 예시도이다."}
