{"patent_id": "10-2020-0156306", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0069309", "출원번호": "10-2020-0156306", "발명의 명칭": "얼굴인식을 통한 기분 제어 맞춤형 향 분석 장치", "출원인": "박채원", "발명자": "박채원"}}
{"patent_id": "10-2020-0156306", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 얼굴 이미지를 분석하여 상기 사용자의 기분 상태를 결정하는 인공지능 분석부;및기분 상태 데이터베이스에 기초한 기분 상태에 대응하는 가습기 향을 검출하고, 상기 검출한 가습기 향을 가습기 내에서 작동하여, 가습기 향 분사구에서 기분에 따라 설정된 향이 분사되도록 하는 프로세서를 포함하는 기분 맞춤형 향 분석 장치."}
{"patent_id": "10-2020-0156306", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 기분 상태 데이터베이스는 사용자의 눈, 코, 입의 이미지 데이터와 피로함, 걱정, 우울함, 기쁨, 분노의기본적인 기분 데이터를 포함하며:기분 데이터 베이스에 대응하는 라벤더, 카모마일, 클라리세이지, 일랑일랑 중의 향을 분출하는 기분 맞춤형 향분석 장치."}
{"patent_id": "10-2020-0156306", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 구성되고 기분 데이터에 대칭되는 다양한 향이 들어있는 공간을 서보모터로 덮개를 돌려 향을 다양하게 하도록 하며:다양한 향이 들어있는 공간의 덮개에 팬모터를 부착하여 향을 빨아들여 보다 효율적으로 분출할 수 있게 하는맞춤형 향 분석 장치."}
{"patent_id": "10-2020-0156306", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,DHT 온습도 센서, 가습기 센서를 내장하고 있는 프로세서를 포함하는 기분 맞춤형 향 분석 장치;"}
{"patent_id": "10-2020-0156306", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "상기 기분 상태 데이터베이스는 사용자의 눈, 코, 입의 이미지 데이터와 피로함, 걱정, 우울함, 기쁨, 분노의 기 본적인 기분 데이터를 포함하며 이에 기초한 기분 상태에 대응하는 가습기 향을 검출하고, 상기 검출한 라벤더, 카모마일, 클라리세이지, 일랑일랑 중의 가습기 향을 가습기 내에서 작동하여, 가습기 향 분사구에서 기분에 따 라 설정된 향이 분사되도록 하는 프로세서를 포함하는 기분 맞춤형 향 분석 장치."}
{"patent_id": "10-2020-0156306", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 대상, 바람직하게는 인간의 기분을 향상시키기에 적합한 향기 조절, 이를 함유하는 온습도 조절 맞춤 형 향 분석 장치에 주로 관한 것이다. 현재의 현대인들 중 대다수가 우울증에 시달리고 있다. 특히 코로나 시대 에 접어들면서 우울한 증상을 띠고 있는 현대인들이 많다. 본 발명은 이런 현대인들에게 각자의 감정에 따른 향 기를 제공하여 후각 정보인 후각구(olfactory bulb)와 뇌의 감정 중심부(emotional heart) 로 직접 전달되는 것으로 개인에게 긍정적인 기분 향상을 전달하기 위한 이상적인 전달 수단이다."}
{"patent_id": "10-2020-0156306", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명은 가습기의 기본 원리에 개인의 기분에 따른 맞춤형 향 분석 장치를 추가한 것이다. 가습기에는 자동"}
{"patent_id": "10-2020-0156306", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "온습도 조절의 기능이 있다.발명의 내용 허스키 렌즈를 바탕으로 사용자 이미지를 분석하여 상기 사용자의 기분 상태를 결정한다. 이를 통해 수집된 기 분 상태 데이터베이스에 기초한 기분 상태에 대응하는 가습기 향을 검출하고, 상기 검출한 가습기 향을 가습기 내에서 여러 향 중 하나를 분출하도록 서보모터와 팬모터를 활용한다. 가습기 향 분사구에서 기분에 따라 설정된 향이 분사되도록 하는 프로세서를 포함하는 기분 맞춤형 향 분석 장 치이다."}
{"patent_id": "10-2020-0156306", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "사용자의 눈, 코, 입의 이미지 데이터와 피로함, 걱정, 우울함, 기쁨, 분노의 기본적인 기분 데이터를 포함하는 상기 기분 상태 데이터베이스를 통해 이에 대응하는 라벤더, 카모마일, 클라리세이지, 일랑일랑 중의 향을 분출 한다. 향의 분출 방식은 기분 데이터에 대칭되는 다양한 향이 들어있는 공간을 서보모터로 덮개를 돌려 향을 다양하게 한다. 다양한 향이 들어있는 공간의 덮개에 팬모터를 부착하여 향을 빨아들여 보다 효율적으로 분출할 수 있게 하는 맞춤형 향 분석 장치이다. 이 맞춤형 향 분석 장치에는 온습도 센서(DHT), 가습기 센서를 내장하고 있는 프로세서를 포함하여 온습도 자동 조절 가습기의 기능 또한 띄고 있다."}
{"patent_id": "10-2020-0156306", "section": "도면", "subsection": "도면설명", "item": 1, "content": "아두이노를 중심으로 허스키 렌즈, 서보모터, 가습기 모듈, LCD 가 설치되어 있다."}
