{"patent_id": "10-2023-7011981", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0095936", "출원번호": "10-2023-7011981", "발명의 명칭": "무선 통신 시스템에서 단말 및 기지국의 피드백 수행 방법 및 장치", "출원인": "엘지전자 주식회사", "발명자": "신종웅"}}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 단말(User Equipment, UE)이 데이터를 전송하는 방법에 있어서,상기 단말이 데이터 전송을 수행하는 경우, 인공 신경망(Neural Network)을 통해 학습된 제 1 전송 웨이트가 적용된 데이터를 기지국으로 전송하는 단계;상기 기지국으로부터 상기 데이터 전송에 대한 NACK을 수신하는 단계; 및상기 단말이 상기 데이터 재-전송을 수행하는 경우, 상기 인공 신경망을 통해 학습된 제 2 전송 웨이트가 적용된 데이터를 상기 기지국으로 재-전송하는 단계;를 포함하되,상기 제 1 전송 웨이트 및 상기 제 2 전송 웨이트는 웨이트 증가(Incremental Weight, IW) 방식에 기초하여 학습되고, 상기 제 2 전송 웨이트는 상기 IW 방식에 기초하여 상기 제 1 전송 웨이트가 고정된 상태에서 상기 인공 신경망에 의해 학습되는 추가 웨이트인, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제 1 전송 웨이트는 상기 인공 신경망의 제 1 레이어에 대응되고, 상기 제 2 전송 웨이트는 상기 인공 신경망의 제 2 레이어에 대응되되,상기 제 2 레이어는 상기 데이터 및 상기 제 1 전송 웨이트가 적용된 데이터를 입력으로 받는 레이어인, 데이터전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 인공 신경망은 최소 레이트에 기초하여 상기 단말에 적용되는 전송 웨이트들을 동시에 학습하고,상기 데이터에 대한 초기 전송을 수행하는 경우, 상기 학습된 전송 웨이트들 중 상기 제 1 전송 웨이트를 제외한 다른 웨이트들을 펑처링하고,상기 데이터에 대한 재-전송을 수행하는 경우, 상기 학습된 전송 웨이트들 중 상기 제 2 전송 웨이트를 제외한다른 웨이트들을 펑처링하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 학습된 전송 웨이트들에 대한 펑처링 순서가 결정되되,상기 펑처링 순서는 전송 웨이트 값에 대한 정보 및 전송 웨이트에 기초한 성능 정보 중 적어도 어느 하나에 기초하여 결정되는, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 기지국으로부터 상기 데이터 재-전송에 대한 NACK을 수신하는 경우, 상기 인공 신경망을 통해 학습된 제 3전송 웨이트가 적용된 데이터를 기지국으로 재-전송하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,공개특허 10-2023-0095936-3-상기 제 3 전송 웨이트는 상기 제 1 전송 웨이트 및 상기 제 2 전송 웨이트는 고정된 상태에서 상기 인공 신경망에 의해 학습되는 추가 웨이트인, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 단말은 상기 기지국과 상기 인공 신경망에 기초한 웨이트 관련 정보를 사전에 공유하는, 데이터 전송방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 단말이 상기 단말이 상기 데이터 재-전송을 수행하는 경우, 상기 단말은 상기 기지국으로부터DCI(Downlink Control Information)를 통해 상기 데이터 재-전송에 대한 추가 웨이트 정보를 지시받는, 데이터전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 데이터 재-전송에 대한 추가 웨이트 정보는 웨이트 벡터 중 상기 데이터 재-전송에 대한 웨이트의 시작 위치 정보 및 상기 데이터 재-전송에 대한 웨이트의 길이 정보 중 적어도 어느 하나에 대한 정보를 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 제 2 전송 웨이트는 상기 추가 웨이트 정보에 기초하여 결정되는, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 기지국은 상기 제 1 전송 웨이트에 대응되는 제 1 수신 웨이트에 기초하여 상기 제 1 전송 웨이트가 적용된 데이터를 디코딩하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 기지국이 상기 단말로부터 상기 데이터에 대한 재-전송을 수신하는 경우, 상기 기지국은 상기 제 2 전송웨이트에 대응되는 제 2 수신 웨이트에 기초하여 상기 제 2 전송 웨이트가 적용된 데이터를 디코딩하고,상기 제 1 수신 웨이트에 기초하여 디코딩된 데이터를 상기 제 2 수신 웨이트에 기초하여 디코딩된 데이터를 함께 이용하여 데이터를 복원하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 통신 시스템에서 동작하는 단말에 있어서,적어도 하나의 송수신기;적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서에 동작 가능하도록 연결되고, 실행될 경우 상기 적어도 하나의 프로세서가 특정동작을 수행하도록 하는 명령들(instructions)을 저장하는 적어도 하나의 메모리를 포함하고,상기 특정 동작은:상기 단말이 데이터 전송을 수행하는 경우, 인공 신경망(Neural Network)을 통해 학습된 제 1 전송 웨이트가 적공개특허 10-2023-0095936-4-용된 데이터를 상기 적어도 하나의 송수신기를 통해 기지국으로 전송하고,상기 기지국으로부터 상기 데이터 전송에 대한 NACK을 수신하도록 상기 적어도 하나의 송수신기를 제어하고,상기 단말이 상기 데이터 재-전송을 수행하는 경우, 상기 인공 신경망을 통해 학습된 제 2 전송 웨이트가 적용된 데이터를 상기 적어도 하나의 송수신기를 통해 상기 기지국으로 재-전송하도록 제어하고,상기 제 1 전송 웨이트 및 상기 제 2 전송 웨이트는 웨이트 증가(Incremental Weight, IW) 방식에 기초하여 학습되고, 상기 제 2 전송 웨이트는 상기 IW 방식에 기초하여 상기 제 1 전송 웨이트가 고정된 상태에서 상기 인공 신경망에 의해 학습되는 추가 웨이트인, 데이터를 전송하는 단말."}
{"patent_id": "10-2023-7011981", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 단말은, 이동 단말기, 네트워크 및 상기 단말이 포함된 차량 이외의 자율 주행 차량 중 적어도 하나와 통신하는, 단말."}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시에서는 무선 통신 시스템에서 단말이 데이터를 전송하는 방법 및 장치를 개시한다. 본 개시에 적용 가능 한 일 실시예에 따르면, 데이터 전송 방법은 인공 신경망을 통해 학습된 제 1 전송 웨이트가 적용된 데이터를 기 지국으로 전송하는 단계, 기지국으로부터 데이터 전송에 대한 NACK을 수신하는 단계 및 인공 신경망을 통해 학습 된 제 2 전송 웨이트가 적용된 데이터를 기지국으로 재-전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이하의 설명은 무선 통신 시스템에 대한 것으로, 무선 통신 시스템에서 단말 및 기지국이 피드백을 수행하는 방 법 및 장치에 대한 것이다. 특히, 단말 및 기지국이 신경망(Neural Network)에 기초하여 HARQ(hybrid automatic repeat request) 피드백을 수행하는 방법 및 장치를 제공할 수 있다."}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 접속 시스템이 음성이나 데이터 등과 같은 다양한 종류의 통신 서비스를 제공하기 위해 광범위하게 전개되 고 있다. 일반적으로 무선 접속 시스템은 가용한 시스템 자원(대역폭, 전송 파워 등)을 공유하여 다중 사용자와 의 통신을 지원할 수 있는 다중 접속(multiple access) 시스템이다. 다중 접속 시스템의 예들로는 CDMA(code division multiple access) 시스템, FDMA(frequency division multiple access) 시스템, TDMA(time division multiple access) 시스템, OFDMA(orthogonal frequency division multiple access) 시스템, SC-FDMA(single carrier frequency division multiple access) 시스템 등이 있다. 특히, 많은 통신 기기들이 큰 통신 용량을 요구하게 됨에 따라 기존 RAT (radio access technology)에 비해 향 상된 모바일 브로드밴드(enhanced mobile broadband, eMBB) 통신 기술이 제안되고 있다. 또한 다수의 기기 및 사물들을 연결하여 언제 어디서나 다양한 서비스를 제공하는 매시브 MTC (Machine Type Communications) 뿐만 아니라 신뢰성 (reliability) 및 지연(latency) 민감한 서비스/UE를 고려한 통신 시스템이 제안되고 있다. 이를 위한 다양한 기술 구성들이 제안되고 있다."}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 단말 및 기지국이 피드백을 제공하는 방법 및 장치를 제공할 수 있다. 본 개시는 무선 통신 시스템에서 신경망에 의한 학습을 고려하여 웨이트를 순차적으로 증가시키는 방법을 제공 할 수 있다. 본 개시는 무선 통신 시스템에서 신경망 레이어를 순차적으로 증가시키는 방법을 제공할 수 있다. 본 개시는 무선 통신 시스템에서 신경망에서 웨이트를 동시에 학습한 후 펑처링을 통해 웨이트를 활용하는 방법 을 제공할 수 있다. 본 개시에서 이루고자 하는 기술적 목적들은 이상에서 언급한 사항들로 제한되지 않으며, 언급하지 않은 또 다"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "른 기술적 과제들은 이하 설명할 본 개시의 실시 예들로부터 본 개시의 기술 구성이 적용되는 기술분야에서 통 상의 지식을 가진 자에 의해 고려될 수 있다."}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 단말의 데이터 전송 방법을 제공할 수 있다. 여기서, 단말의 데이터 전송 방법 은 상기 단말이 데이터 전송을 수행하는 경우, 인공 신경망(Neural Network)을 통해 학습된 제 1 전송 웨이트가 적용된 데이터를 기지국으로 전송하는 단계, 상기 기지국으로부터 상기 데이터 전송에 대한 NACK을 수신하는 단 계 및 상기 단말이 상기 데이터 재-전송을 수행하는 경우, 상기 인공 신경망을 통해 학습된 제 2 전송 웨이트가 적용된 데이터를 상기 기지국으로 재-전송하는 단계를 포함할 수 있다. 이때, 상기 제 1 전송 웨이트 및 상기 제 2 전송 웨이트는 웨이트 증가(Incremental Weight, IW) 방식에 기초하여 학습되고, 상기 제 2 전송 웨이트는 상기 IW 방식에 기초하여 상기 제 1 전송 웨이트가 고정된 상태에서 상기 인공 신경망에 의해 학습되는 추가 웨 이트일 있다. 또한, 본 개시의 일 예로서, 무선 통신 시스템에서 동작하는 단말을 제공할 수 있다. 여기서, 단말은 적어도 하 나의 송수신기, 적어도 하나의 프로세서 및 상기 적어도 하나의 프로세서에 동작 가능하도록 연결되고, 실행될 경우 상기 적어도 하나의 프로세서가 특정 동작을 수행하도록 하는 명령들(instructions)을 저장하는 적어도 하 나의 메모리를 포함할 수 있다.이때, 상기 특정 동작은: 상기 단말이 데이터 전송을 수행하는 경우, 인공 신경 망(Neural Network)을 통해 학습된 제 1 전송 웨이트가 적용된 데이터를 상기 적어도 하나의 송수신기를 통해 기지국으로 전송하고, 상기 기지국으로부터 상기 데이터 전송에 대한 NACK을 수신하도록 상기 적어도 하나의 송 수신기를 제어하고, 상기 단말이 상기 데이터 재-전송을 수행하는 경우, 상기 인공 신경망을 통해 학습된 제 2 전송 웨이트가 적용된 데이터를 상기 적어도 하나의 송수신기를 통해 상기 기지국으로 재-전송하도록 제어하고, 상기 제 1 전송 웨이트 및 상기 제 2 전송 웨이트는 웨이트 증가(Incremental Weight, IW) 방식에 기초하여 학 습되고, 상기 제 2 전송 웨이트는 상기 IW 방식에 기초하여 상기 제 1 전송 웨이트가 고정된 상태에서 상기 인 공 신경망에 의해 학습되는 추가 웨이트일 수 있다. 또한, 본 개시의 일 예로서, 상기 단말은, 이동 단말기, 네트워크 및 상기 단말이 포함된 차량 이외의 자율 주 행 차량 중 적어도 하나와 통신할 수 있다. 또한, 본 개시가 적용되는 단말 및 기지국의 신호 송수신 방법 및 장치에서 하기의 사항들이 공통으로 적용될 수 있다. 또한, 본 개시의 일 예로서, 상기 제 1 전송 웨이트는 상기 인공 신경망의 제 1 레이어에 대응되고, 상기 제 2 전송 웨이트는 상기 인공 신경망의 제 2 레이어에 대응되되, 상기 제 2 레이어는 상기 데이터 및 상기 제 1 전 송 웨이트가 적용된 데이터를 입력으로 받는 레이어일 수 있다. 또한, 본 개시의 일 예로서, 상기 인공 신경망은 최소 레이트에 기초하여 상기 단말에 적용되는 전송 웨이트들 을 동시에 학습하고, 상기 데이터에 대한 초기 전송을 수행하는 경우, 상기 학습된 전송 웨이트들 중 상기 제 1 전송 웨이트를 제외한 다른 웨이트들을 펑처링하고, 상기 데이터에 대한 재-전송을 수행하는 경우, 상기 학습된 전송 웨이트들 중 상기 제 2 전송 웨이트를 제외한 다른 웨이트들을 펑처링할 수 있다. 또한, 본 개시의 일 예로서, 상기 학습된 전송 웨이트들에 대한 펑처링 순서가 결정되되, 상기 펑처링 순서는 전송 웨이트 값에 대한 정보 및 전송 웨이트에 기초한 성능 정보 중 적어도 어느 하나에 기초하여 결정될 수 있 다. 또한, 본 개시의 일 예로서, 상기 기지국으로부터 상기 데이터 재-전송에 대한 NACK을 수신하는 경우, 상기 인 공 신경망을 통해 학습된 제 3 전송 웨이트가 적용된 데이터를 기지국으로 재-전송할 수 있다. 또한, 본 개시의 일 예로서, 상기 제 3 전송 웨이트는 상기 제 1 전송 웨이트 및 상기 제 2 전송 웨이트는 고정 된 상태에서 상기 인공 신경망에 의해 학습되는 추가 웨이트일 수 있다. 또한, 본 개시의 일 예로서, 상기 단말은 상기 기지국과 상기 인공 신경망에 기초한 웨이트 관련 정보를 사전에 공유할 수 있다. 또한, 본 개시의 일 예로서, 상기 단말이 상기 단말이 상기 데이터 재-전송을 수행하는 경우, 상기 단말은 상기 기지국으로부터 DCI(Downlink Control Information)를 통해 상기 데이터 재-전송에 대한 추가 웨이트 정보를 지 시 받을 수 있다. 또한, 본 개시의 일 예로서, 상기 데이터 재-전송에 대한 추가 웨이트 정보는 웨이트 벡터 중 상기 데이터 재- 전송에 대한 웨이트의 시작 위치 정보 및 상기 데이터 재-전송에 대한 웨이트의 길이 정보 중 적어도 어느 하나에 대한 정보를 포함할 수 있다. 또한, 본 개시의 일 예로서, 상기 제 2 전송 웨이트는 상기 추가 웨이트 정보에 기초하여 결정될 수 있다. 또한, 본 개시의 일 예로서, 상기 기지국은 상기 제 1 전송 웨이트에 대응되는 제 1 수신 웨이트에 기초하여 상 기 제 1 전송 웨이트가 적용된 데이터를 디코딩할 수 있다. 또한, 본 개시의 일 예로서, 상기 기지국이 상기 단말로부터 상기 데이터에 대한 재-전송을 수신하는 경우, 상 기 기지국은 상기 제 2 전송 웨이트에 대응되는 제 2 수신 웨이트에 기초하여 상기 제 2 전송 웨이트가 적용된 데이터를 디코딩하고, 상기 제 1 수신 웨이트에 기초하여 디코딩된 데이터를 상기 제 2 수신 웨이트에 기초하여 디코딩된 데이터를 함께 이용하여 데이터를 복원할 수 있다. 상술한 본 개시의 양태들은 본 개시의 바람직한 실시예들 중 일부에 불과하며, 본 개시의 기술적 특징들이 반영"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "된 다양한 실시예들이 당해 기술분야의 통상적인 지식을 가진 자에 의해 이하 상술할 본 개시의 상세한 설명을 기반으로 도출되고 이해될 수 있다."}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 기초한 실시예들에 의해 하기와 같은 효과가 있을 수 있다. 본 개시에 따르면, 단말 및 기지국이 피드백을 제공할 수 있다. 본 개시에 따르면, 신경망에 의한 학습을 고려하여 웨이트를 순차적으로 증가시킴으로써 오토 인코더에서 피드 백을 효율적으로 수행할 수 있다. 본 개시에 따르면, 신경망 레이어를 순차적으로 증가시키는 방법을 통 오토 인코더에서 피드백을 효율적으로 수 행할 수 있다. 본 개시에 따르면, 신경망에서 웨이트를 동시에 학습한 후 펑처링을 통해 웨이트를 활용하여 오토 인코더에서 피드백을 효율적으로 수행할 수 있다. 본 개시의 실시 예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "다른 효과들은 이하의 본 개시의 실시 예들에 대한 기재로부터 본 개시의 기술 구성이 적용되는 기술분야에서 통상의 지식을 가진 자에게 명확하게 도출되고 이해될 수 있다. 즉, 본 개시에서 서술하는 구성을 실시함에 따"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "른 의도하지 않은 효과들 역시 본 개시의 실시 예들로부터 당해 기술분야의 통상의 지식을 가진 자에 의해 도출 될 수 있다."}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 실시 예들은 본 개시의 구성요소들과 특징들을 소정 형태로 결합한 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려될 수 있다. 각 구성요소 또는 특징은 다른 구성요소나 특 징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 개시의 실시 예를 구성할 수도 있다. 본 개시의 실시 예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시 예의 일부 구성이나 특징은 다른 실시 예에 포함될 수 있고, 또는 다른 실시 예의 대응하는 구성 또는 특징과 교체될수 있다. 도면에 대한 설명에서, 본 개시의 요지를 흐릴 수 있는 절차 또는 단계 등은 기술하지 않았으며, 당업자의 수준 에서 이해할 수 있을 정도의 절차 또는 단계는 또한 기술하지 아니하였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함(comprising 또는 including)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미 한다. 또한, 명세서에 기재된 \"...부\", \"...기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, \"일(a 또는 an)\", \"하나(one)\", \"그(the)\" 및 유사 관련어는 본 개시를 기술하는 문맥에 있어서(특히, 이하의 청구항의 문맥에서) 본 명세서에 달리 지시되거나 문맥에 의해 분명하게 반박되지 않는 한, 단수 및 복수 모두 를 포함하는 의미로 사용될 수 있다. 본 명세서에서 본 개시의 실시예들은 기지국과 이동국 간의 데이터 송수신 관계를 중심으로 설명되었다. 여기서, 기지국은 이동국과 직접적으로 통신을 수행하는 네트워크의 종단 노드(terminal node)로서의 의미가 있 다. 본 문서에서 기지국에 의해 수행되는 것으로 설명된 특정 동작은 경우에 따라서는 기지국의 상위 노드 (upper node)에 의해 수행될 수도 있다. 즉, 기지국을 포함하는 다수의 네트워크 노드들(network nodes)로 이루어지는 네트워크에서 이동국과의 통신을 위해 수행되는 다양한 동작들은 기지국 또는 기지국 이외의 다른 네트워크 노드들에 의해 수행될 수 있다. 이때, '기지국'은 고정국(fixed station), Node B, eNB(eNode B), gNB(gNode B), ng-eNB, 발전된 기지국 (advanced base station, ABS) 또는 억세스 포인트(access point) 등의 용어에 의해 대체될 수 있다. 또한, 본 개시의 실시 예들에서 단말(terminal)은 사용자 기기(user equipment, UE), 이동국(mobile station, MS), 가입자국(subscriber station, SS), 이동 가입자 단말(mobile subscriber station, MSS), 이동 단말 (mobile terminal) 또는 발전된 이동 단말(advanced mobile station, AMS) 등의 용어로 대체될 수 있다. 또한, 송신단은 데이터 서비스 또는 음성 서비스를 제공하는 고정 및/또는 이동 노드를 말하고, 수신단은 데이 터 서비스 또는 음성 서비스를 수신하는 고정 및/또는 이동 노드를 의미한다. 따라서, 상향링크의 경우, 이동국 이 송신단이 되고, 기지국이 수신단이 될 수 있다. 마찬가지로, 하향링크의 경우, 이동국이 수신단이 되고, 기 지국이 송신단이 될 수 있다. 본 개시의 실시 예들은 무선 접속 시스템들인 IEEE 802.xx 시스템, 3GPP(3rd Generation Partnership Project) 시스템, 3GPP LTE(Long Term Evolution) 시스템, 3GPP 5G(5th generation) NR(New Radio) 시스템 및 3GPP2 시 스템 중 적어도 하나에 개시된 표준 문서들에 의해 뒷받침될 수 있으며, 특히, 본 개시의 실시 예들은 3GPP TS(technical specification) 38.211, 3GPP TS 38.212, 3GPP TS 38.213, 3GPP TS 38.321 및 3GPP TS 38.331 문서들에 의해 뒷받침 될 수 있다. 또한, 본 개시의 실시 예들은 다른 무선 접속 시스템에도 적용될 수 있으며, 상술한 시스템으로 한정되는 것은 아니다. 일 예로, 3GPP 5G NR 시스템 이후에 적용되는 시스템에 대해서도 적용 가능할 수 있으며, 특정 시스템 에 한정되지 않는다. 즉, 본 개시의 실시 예들 중 설명하지 않은 자명한 단계들 또는 부분들은 상기 문서들을 참조하여 설명될 수 있 다. 또한, 본 문서에서 개시하고 있는 모든 용어들은 상기 표준 문서에 의해 설명될 수 있다. 이하, 본 개시에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 개시의 예시적인 실시 형태를 설명하고자 하는 것이며, 본 개시의 기술 구성이 실시될 수 있는 유일한 실시형태를 나타내고자 하는 것이 아니다. 또한, 본 개시의 실시 예들에서 사용되는 특정 용어들은 본 개시의 이해를 돕기 위해서 제공된 것이며, 이러한 특정 용어의 사용은 본 개시의 기술적 사상을 벗어나지 않는 범위에서 다른 형태로 변경될 수 있다. 이하의 기술은 CDMA(code division multiple access), FDMA(frequency division multiple access), TDMA(time division multiple access), OFDMA(orthogonal frequency division multiple access), SC-FDMA(single carrier frequency division multiple access) 등과 같은 다양한 무선 접속 시스템에 적용될 수 있다. 하기에서는 이하 설명을 명확하게 하기 위해, 3GPP 통신 시스템(e.g.(예, LTE, NR 등)을 기반으로 설명하지만 본 발명의 기술적 사상이 이에 제한되는 것은 아니다. LTE는 3GPP TS 36.xxx Release 8 이후의 기술을 의미할수 있다. 세부적으로, 3GPP TS 36.xxx Release 10 이후의 LTE 기술은 LTE-A로 지칭되고, 3GPP TS 36.xxx Release 13 이후의 LTE 기술은 LTE-A pro로 지칭될 수 있다. 3GPP NR은 TS 38.xxx Release 15 이후의 기술을 의미할 수 있다. 3GPP 6G는 TS Release 17 및/또는 Release 18 이후의 기술을 의미할 수 있다. \"xxx\"는 표준 문서 세부 번호를 의미한다. LTE/NR/6G는 3GPP 시스템으로 통칭될 수 있다."}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 개시에 사용된 배경기술, 용어, 약어 등에 관해서는 본 발명 이전에 공개된 표준 문서에 기재된 사항을 참조 할 수 있다. 일 예로, 36.xxx 및 38.xxx 표준 문서를 참조할 수 있다. 본 개시에 적용 가능한 통신 시스템 이로 제한되는 것은 아니지만, 본 문서에 개시된 본 개시의 다양한 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 기기들 간에 무선 통신/연결(예, 5G)을 필요로 하는 다양한 분야에 적용될 수 있다. 이하, 도면을 참조하여 보다 구체적으로 예시한다. 이하의 도면/설명에서 동일한 도면 부호는 다르게 기술하지 않는 한, 동일하거나 대응되는 하드웨어 블록, 소프트웨어 블록 또는 기능 블록을 예시할 수 있다. 도 1은 본 개시에 적용되는 통신 시스템 예시를 도시한 도면이다. 도 1을 참조하면, 본 개시에 적용되는 통신 시스템은 무선 기기, 기지국 및 네트워크를 포함한다. 여기서, 무선 기기는 무선 접속 기술(예, 5G NR, LTE)을 이용하여 통신을 수행하는 기기를 의미하며, 통신/무선/5G 기기로 지칭될 수 있다. 이로 제한되는 것은 아니지만, 무선 기기는 로봇(100a), 차량(100b-1, 100b-2), XR(extended reality) 기기(100c), 휴대 기기 (hand-held device)(100d), 가전(home appliance)(100e), IoT(Internet of Thing) 기기(100f), AI(artificial intelligence) 기기/서버(100g)를 포함할 수 있다. 예를 들어, 차량은 무선 통신 기능이 구비된 차량, 자율 주 행 차량, 차량간 통신을 수행할 수 있는 차량 등을 포함할 수 있다. 여기서, 차량(100b-1, 100b-2)은 UAV(unmanned aerial vehicle)(예, 드론)를 포함할 수 있다. XR 기기(100c)는 AR(augmented reality)/VR(virtual reality)/MR(mixed reality) 기기를 포함하며, HMD(head-mounted device), 차량에 구비된 HUD(head-up display), 텔레비전, 스마트폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지 (signage), 차량, 로봇 등의 형태로 구현될 수 있다. 휴대 기기(100d)는 스마트폰, 스마트패드, 웨어러블 기기 (예, 스마트워치, 스마트글래스), 컴퓨터(예, 노트북 등) 등을 포함할 수 있다. 가전(100e)은 TV, 냉장고, 세탁 기 등을 포함할 수 있다. IoT 기기(100f)는 센서, 스마트 미터 등을 포함할 수 있다. 예를 들어, 기지국, 네트워크는 무선 기기로도 구현될 수 있으며, 특정 무선 기기(120a)는 다른 무선 기기에게 기지국/네트워 크 노드로 동작할 수도 있다. 무선 기기(100a~100f)는 기지국을 통해 네트워크와 연결될 수 있다. 무선 기기(100a~100f)에는 AI 기술이 적용될 수 있으며, 무선 기기(100a~100f)는 네트워크를 통해 AI 서버(100g)와 연결될 수 있다. 네 트워크는 3G 네트워크, 4G(예, LTE) 네트워크 또는 5G(예, NR) 네트워크 등을 이용하여 구성될 수 있다. 무선 기기(100a~100f)는 기지국/네트워크를 통해 서로 통신할 수도 있지만, 기지국/네트워크 를 통하지 않고 직접 통신(예, 사이드링크 통신(sidelink communication))할 수도 있다. 예를 들어, 차량 들(100b-1, 100b-2)은 직접 통신(예, V2V(vehicle to vehicle)/V2X(vehicle to everything) communication)을 할 수 있다. 또한, IoT 기기(100f)(예, 센서)는 다른 IoT 기기(예, 센서) 또는 다른 무선 기기(100a~100f)와 직접 통신을 할 수 있다. 무선 기기(100a~100f)/기지국, 기지국/기지국 간에는 무선 통신/연결(150a, 150b, 150c)이 이 뤄질 수 있다. 여기서, 무선 통신/연결은 상향/하향링크 통신(150a)과 사이드링크 통신(150b)(또는, D2D 통신), 기지국간 통신(150c)(예, relay, IAB(integrated access backhaul))과 같은 다양한 무선 접속 기술(예, 5G N R)을 통해 이뤄질 수 있다. 무선 통신/연결(150a, 150b, 150c)을 통해 무선 기기와 기지국/무선 기기, 기지국과 기지국은 서로 무선 신호를 송신/수신할 수 있다. 예를 들어, 무선 통신/연결(150a, 150b, 150c)은 다양한 물리 채널을 통해 신호를 송신/수신할 수 있다. 이를 위해, 본 개시의 다양한 제안들에 기반하여, 무선 신호의 송신/ 수신을 위한 다양한 구성정보 설정 과정, 다양한 신호 처리 과정(예, 채널 인코딩/디코딩, 변조/복조, 자원 매 핑/디매핑 등), 자원 할당 과정 등 중 적어도 일부가 수행될 수 있다. 본 개시에 적용 가능한 통신 시스템 도 2는 본 개시에 적용될 수 있는 무선 기기의 예시를 도시한 도면이다. 도 2를 참조하면, 제1 무선 기기(200a)와 제2 무선 기기(200b)는 다양한 무선 접속 기술(예, LTE, NR)을 통해 무선 신호를 송수신할 수 있다. 여기서, {제1 무선 기기(200a), 제2 무선 기기(200b)}은 도 1의 {무선 기기(100x), 기지국} 및/또는 {무선 기기(100x), 무선 기기(100x)}에 대응할 수 있다. 제1 무선 기기(200a)는 하나 이상의 프로세서(202a) 및 하나 이상의 메모리(204a)를 포함하며, 추가적으로 하나 이상의 송수신기(206a) 및/또는 하나 이상의 안테나(208a)을 더 포함할 수 있다. 프로세서(202a)는 메모리 (204a) 및/또는 송수신기(206a)를 제어하며, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순 서도들을 구현하도록 구성될 수 있다. 예를 들어, 프로세서(202a)는 메모리(204a) 내의 정보를 처리하여 제1 정 보/신호를 생성한 뒤, 송수신기(206a)을 통해 제1 정보/신호를 포함하는 무선 신호를 전송할 수 있다. 또한, 프 로세서(202a)는 송수신기(206a)를 통해 제2 정보/신호를 포함하는 무선 신호를 수신한 뒤, 제2 정보/신호의 신 호 처리로부터 얻은 정보를 메모리(204a)에 저장할 수 있다. 메모리(204a)는 프로세서(202a)와 연결될 수 있고, 프로세서(202a)의 동작과 관련한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리(204a)는 프로세서(202a)에 의해 제어되는 프로세스들 중 일부 또는 전부를 수행하거나, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 수행하기 위한 명령들을 포함하는 소프트웨어 코드를 저장할 수 있다. 여기서, 프로세 서(202a)와 메모리(204a)는 무선 통신 기술(예, LTE, NR)을 구현하도록 설계된 통신 모뎀/회로/칩의 일부일 수 있다. 송수신기(206a)는 프로세서(202a)와 연결될 수 있고, 하나 이상의 안테나(208a)를 통해 무선 신호를 송신 및/또는 수신할 수 있다. 송수신기(206a)는 송신기 및/또는 수신기를 포함할 수 있다. 송수신기(206a)는 RF(radio frequency) 유닛과 혼용될 수 있다. 본 개시에서 무선 기기는 통신 모뎀/회로/칩을 의미할 수도 있다. 제2 무선 기기(200b)는 하나 이상의 프로세서(202b), 하나 이상의 메모리(204b)를 포함하며, 추가적으로 하나 이상의 송수신기(206b) 및/또는 하나 이상의 안테나(208b)를 더 포함할 수 있다. 프로세서(202b)는 메모리 (204b) 및/또는 송수신기(206b)를 제어하며, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순 서도들을 구현하도록 구성될 수 있다. 예를 들어, 프로세서(202b)는 메모리(204b) 내의 정보를 처리하여 제3 정 보/신호를 생성한 뒤, 송수신기(206b)를 통해 제3 정보/신호를 포함하는 무선 신호를 전송할 수 있다. 또한, 프 로세서(202b)는 송수신기(206b)를 통해 제4 정보/신호를 포함하는 무선 신호를 수신한 뒤, 제4 정보/신호의 신 호 처리로부터 얻은 정보를 메모리(204b)에 저장할 수 있다. 메모리(204b)는 프로세서(202b)와 연결될 수 있고, 프로세서(202b)의 동작과 관련한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리(204b)는 프로세서(202b)에 의해 제어되는 프로세스들 중 일부 또는 전부를 수행하거나, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 수행하기 위한 명령들을 포함하는 소프트웨어 코드를 저장할 수 있다. 여기서, 프로세 서(202b)와 메모리(204b)는 무선 통신 기술(예, LTE, NR)을 구현하도록 설계된 통신 모뎀/회로/칩의 일부일 수 있다. 송수신기(206b)는 프로세서(202b)와 연결될 수 있고, 하나 이상의 안테나(208b)를 통해 무선 신호를 송신 및/또는 수신할 수 있다. 송수신기(206b)는 송신기 및/또는 수신기를 포함할 수 있다 송수신기(206b)는 RF 유닛 과 혼용될 수 있다. 본 개시에서 무선 기기는 통신 모뎀/회로/칩을 의미할 수도 있다. 이하, 무선 기기(200a, 200b)의 하드웨어 요소에 대해 보다 구체적으로 설명한다. 이로 제한되는 것은 아니지만, 하나 이상의 프로토콜 계층이 하나 이상의 프로세서(202a, 202b)에 의해 구현될 수 있다. 예를 들어, 하나 이상의 프로세서(202a, 202b)는 하나 이상의 계층(예, PHY(physical), MAC(media access control), RLC(radio link control), PDCP(packet data convergence protocol), RRC(radio resource control), SDAP(service data adaptation protocol)와 같은 기능적 계층)을 구현할 수 있다. 하나 이상의 프로세서(202a, 202b)는 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들에 따라 하나 이상의 PDU(Protocol Data Unit) 및/또는 하나 이상의 SDU(service data unit)를 생성할 수 있다. 하나 이상의 프로세 서(202a, 202b)는 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들에 따라 메시지, 제어 정보, 데이터 또는 정보를 생성할 수 있다. 하나 이상의 프로세서(202a, 202b)는 본 문서에 개시된 기능, 절차, 제안 및/또는 방법에 따라 PDU, SDU, 메시지, 제어정보, 데이터 또는 정보를 포함하는 신호(예, 베이스밴드 신 호)를 생성하여, 하나 이상의 송수신기(206a, 206b)에게 제공할 수 있다. 하나 이상의 프로세서(202a, 202b)는 하나 이상의 송수신기(206a, 206b)로부터 신호(예, 베이스밴드 신호)를 수신할 수 있고, 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들에 따라 PDU, SDU, 메시지, 제어정보, 데이터 또는 정보를 획득할 수 있다. 하나 이상의 프로세서(202a, 202b)는 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 또는 마이크로 컴퓨터로 지칭될 수 있다. 하나 이상의 프로세서(202a, 202b)는 하드웨어, 펌웨어, 소프트웨어, 또는 이들의 조합에 의해 구현될 수 있다. 일 예로, 하나 이상의 ASIC(application specific integrated circuit), 하나 이상의 DSP(digital signal processor), 하나 이상의 DSPD(digital signal processing device), 하나 이상의 PLD(programmable logic device) 또는 하나 이상의 FPGA(field programmable gate arrays)가 하나 이상의 프로 세서(202a, 202b)에 포함될 수 있다. 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은펌웨어 또는 소프트웨어를 사용하여 구현될 수 있고, 펌웨어 또는 소프트웨어는 모듈, 절차, 기능 등을 포함하 도록 구현될 수 있다. 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 수행하도록 설 정된 펌웨어 또는 소프트웨어는 하나 이상의 프로세서(202a, 202b)에 포함되거나, 하나 이상의 메모리(204a, 204b)에 저장되어 하나 이상의 프로세서(202a, 202b)에 의해 구동될 수 있다. 본 문서에 개시된 설명, 기능, 절 차, 제안, 방법 및/또는 동작 순서도들은 코드, 명령어 및/또는 명령어의 집합 형태로 펌웨어 또는 소프트웨어 를 사용하여 구현될 수 있다. 하나 이상의 메모리(204a, 204b)는 하나 이상의 프로세서(202a, 202b)와 연결될 수 있고, 다양한 형태의 데이터, 신호, 메시지, 정보, 프로그램, 코드, 지시 및/또는 명령을 저장할 수 있다. 하나 이상의 메모리(204a, 204b)는 ROM(read only memory), RAM(random access memory), EPROM(erasable programmable read only memory), 플래시 메모리, 하드 드라이브, 레지스터, 캐쉬 메모리, 컴퓨터 판독 저장 매체 및/또는 이들의 조합 으로 구성될 수 있다. 하나 이상의 메모리(204a, 204b)는 하나 이상의 프로세서(202a, 202b)의 내부 및/또는 외 부에 위치할 수 있다. 또한, 하나 이상의 메모리(204a, 204b)는 유선 또는 무선 연결과 같은 다양한 기술을 통 해 하나 이상의 프로세서(202a, 202b)와 연결될 수 있다. 하나 이상의 송수신기(206a, 206b)는 하나 이상의 다른 장치에게 본 문서의 방법들 및/또는 동작 순서도 등에서 언급되는 사용자 데이터, 제어 정보, 무선 신호/채널 등을 전송할 수 있다. 하나 이상의 송수신기(206a, 206b) 는 하나 이상의 다른 장치로부터 본 문서에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도 등에서 언급되는 사용자 데이터, 제어 정보, 무선 신호/채널 등을 수신할 수 있다. 예를 들어, 하나 이상의 송수신기 (206a, 206b)는 하나 이상의 프로세서(202a, 202b)와 연결될 수 있고, 무선 신호를 송수신할 수 있다. 예를 들 어, 하나 이상의 프로세서(202a, 202b)는 하나 이상의 송수신기(206a, 206b)가 하나 이상의 다른 장치에게 사용 자 데이터, 제어 정보 또는 무선 신호를 전송하도록 제어할 수 있다. 또한, 하나 이상의 프로세서(202a, 202b) 는 하나 이상의 송수신기(206a, 206b)가 하나 이상의 다른 장치로부터 사용자 데이터, 제어 정보 또는 무선 신 호를 수신하도록 제어할 수 있다. 또한, 하나 이상의 송수신기(206a, 206b)는 하나 이상의 안테나(208a, 208b) 와 연결될 수 있고, 하나 이상의 송수신기(206a, 206b)는 하나 이상의 안테나(208a, 208b)를 통해 본 문서에 개 시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도 등에서 언급되는 사용자 데이터, 제어 정보, 무선 신 호/채널 등을 송수신하도록 설정될 수 있다. 본 문서에서, 하나 이상의 안테나는 복수의 물리 안테나이거나, 복 수의 논리 안테나(예, 안테나 포트)일 수 있다. 하나 이상의 송수신기(206a, 206b)는 수신된 사용자 데이터, 제 어 정보, 무선 신호/채널 등을 하나 이상의 프로세서(202a, 202b)를 이용하여 처리하기 위해, 수신된 무선 신호 /채널 등을 RF 밴드 신호에서 베이스밴드 신호로 변환(Convert)할 수 있다. 하나 이상의 송수신기(206a, 206b) 는 하나 이상의 프로세서(202a, 202b)를 이용하여 처리된 사용자 데이터, 제어 정보, 무선 신호/채널 등을 베이 스밴드 신호에서 RF 밴드 신호로 변환할 수 있다. 이를 위하여, 하나 이상의 송수신기(206a, 206b)는 (아날로그) 오실레이터 및/또는 필터를 포함할 수 있다. 본 개시에 적용 가능한 무선 기기 구조 도 3은 본 개시에 적용되는 무선 기기의 다른 예시를 도시한 도면이다. 도 3을 참조하면, 무선 기기는 도 2의 무선 기기(200a, 200b)에 대응하며, 다양한 요소(element), 성분 (component), 유닛/부(unit), 및/또는 모듈(module)로 구성될 수 있다. 예를 들어, 무선 기기는 통신부 , 제어부, 메모리부 및 추가 요소를 포함할 수 있다. 통신부는 통신 회로 및 송수신 기(들)을 포함할 수 있다. 예를 들어, 통신 회로는 도 2의 하나 이상의 프로세서(202a, 202b) 및/또 는 하나 이상의 메모리(204a, 204b)를 포함할 수 있다. 예를 들어, 송수신기(들)는 도 2의 하나 이상의 송 수신기(206a, 206b) 및/또는 하나 이상의 안테나(208a, 208b)을 포함할 수 있다. 제어부는 통신부, 메모리부 및 추가 요소와 전기적으로 연결되며 무선 기기의 제반 동작을 제어한다. 예를 들어, 제어 부는 메모리부에 저장된 프로그램/코드/명령/정보에 기반하여 무선 기기의 전기적/기계적 동작을 제 어할 수 있다. 또한, 제어부는 메모리부에 저장된 정보를 통신부을 통해 외부(예, 다른 통신 기 기)로 무선/유선 인터페이스를 통해 전송하거나, 통신부를 통해 외부(예, 다른 통신 기기)로부터 무선/유 선 인터페이스를 통해 수신된 정보를 메모리부에 저장할 수 있다. 추가 요소는 무선 기기의 종류에 따라 다양하게 구성될 수 있다. 예를 들어, 추가 요소는 파워 유닛/ 배터리, 입출력부(input/output unit), 구동부 및 컴퓨팅부 중 적어도 하나를 포함할 수 있다. 이로 제한되는 것은 아니지만, 무선 기기는 로봇(도 1, 100a), 차량(도 1, 100b-1, 100b-2), XR 기기(도 1, 100c), 휴대 기기(도 1, 100d), 가전(도 1, 100e), IoT 기기(도 1, 100f), 디지털 방송용 단말, 홀로그램 장치, 공공 안전장치, MTC 장치, 의료 장치, 핀테크 장치(또는 금융 장치), 보안 장치, 기후/환경 장치, AI 서버/기기(도 1, 140), 기지국(도 1, 120), 네트워크 노드 등의 형태로 구현될 수 있다. 무선 기기는 사용-예/서비스에 따라 이 동 가능하거나 고정된 장소에서 사용될 수 있다. 도 3에서 무선 기기 내의 다양한 요소, 성분, 유닛/부, 및/또는 모듈은 전체가 유선 인터페이스를 통해 상 호 연결되거나, 적어도 일부가 통신부를 통해 무선으로 연결될 수 있다. 예를 들어, 무선 기기 내에 서 제어부와 통신부는 유선으로 연결되며, 제어부와 제1 유닛(예, 130, 140)은 통신부를 통해 무선으로 연결될 수 있다. 또한, 무선 기기 내의 각 요소, 성분, 유닛/부, 및/또는 모듈은 하나 이상 의 요소를 더 포함할 수 있다. 예를 들어, 제어부는 하나 이상의 프로세서 집합으로 구성될 수 있다. 예를 들어, 제어부는 통신 제어 프로세서, 어플리케이션 프로세서(application processor), ECU(electronic control unit), 그래픽 처리 프로세서, 메모리 제어 프로세서 등의 집합으로 구성될 수 있다. 다른 예로, 메모 리부는 RAM, DRAM(dynamic RAM), ROM, 플래시 메모리(flash memory), 휘발성 메모리(volatile memory), 비-휘발성 메모리(non-volatile memory) 및/또는 이들의 조합으로 구성될 수 있다. 본 개시가 적용 가능한 휴대 기기 도 4는 본 개시에 적용되는 휴대 기기의 예시를 도시한 도면이다. 도 4는 본 개시에 적용되는 휴대 기기를 예시한다. 휴대 기기는 스마트폰, 스마트패드, 웨어러블 기기(예, 스마 트 워치, 스마트 글래스), 휴대용 컴퓨터(예, 노트북 등)을 포함할 수 있다. 휴대 기기는 MS(mobile station), UT(user terminal), MSS(mobile subscriber station), SS(subscriber station), AMS(advanced mobile station) 또는 WT(wireless terminal)로 지칭될 수 있다. 도 4를 참조하면, 휴대 기기는 안테나부, 통신부, 제어부, 메모리부, 전원공급부 (440a), 인터페이스부(440b) 및 입출력부(440c)를 포함할 수 있다. 안테나부는 통신부의 일부로 구성 될 수 있다. 블록 410~430/440a~440c는 각각 도 3의 블록 310~330/340에 대응한다. 통신부는 다른 무선 기기, 기지국들과 신호(예, 데이터, 제어 신호 등)를 송수신할 수 있다. 제어부 는 휴대 기기의 구성 요소들을 제어하여 다양한 동작을 수행할 수 있다. 제어부는 AP(application processor)를 포함할 수 있다. 메모리부는 휴대 기기의 구동에 필요한 데이터/파라미터/프로그램/코 드/명령을 저장할 수 있다. 또한, 메모리부는 입/출력되는 데이터/정보 등을 저장할 수 있다. 전원공급부 (440a)는 휴대 기기에게 전원을 공급하며, 유/무선 충전 회로, 배터리 등을 포함할 수 있다. 인터페이스부 (440b)는 휴대 기기와 다른 외부 기기의 연결을 지원할 수 있다. 인터페이스부(440b)는 외부 기기와의 연 결을 위한 다양한 포트(예, 오디오 입/출력 포트, 비디오 입/출력 포트)를 포함할 수 있다. 입출력부(440c)는 영상 정보/신호, 오디오 정보/신호, 데이터, 및/또는 사용자로부터 입력되는 정보를 입력 받거나 출력할 수 있 다. 입출력부(440c)는 카메라, 마이크로폰, 사용자 입력부, 디스플레이부(440d), 스피커 및/또는 햅틱 모듈 등 을 포함할 수 있다. 일 예로, 데이터 통신의 경우, 입출력부(440c)는 사용자로부터 입력된 정보/신호(예, 터치, 문자, 음성, 이미지, 비디오)를 획득하며, 획득된 정보/신호는 메모리부에 저장될 수 있다. 통신부는 메모리에 저 장된 정보/신호를 무선 신호로 변환하고, 변환된 무선 신호를 다른 무선 기기에게 직접 전송하거나 기지국에게 전송할 수 있다. 또한, 통신부는 다른 무선 기기 또는 기지국으로부터 무선 신호를 수신한 뒤, 수신된 무 선 신호를 원래의 정보/신호로 복원할 수 있다. 복원된 정보/신호는 메모리부에 저장된 뒤, 입출력부 (440c)를 통해 다양한 형태(예, 문자, 음성, 이미지, 비디오, 햅틱)로 출력될 수 있다. 본 개시가 적용 가능한 무선 기기 종류 도 5는 본 개시에 적용되는 차량 또는 자율 주행 차량의 예시를 도시한 도면이다. 도 5는 본 개시에 적용되는 차량 또는 자율 주행 차량을 예시한다. 차량 또는 자율 주행 차량은 이동형 로봇, 차량, 기차, 유/무인 비행체(aerial vehicle, AV), 선박 등으로 구현될 수 있으며, 차량의 형태로 한정되는 것 은 아니다. 도 5를 참조하면, 차량 또는 자율 주행 차량은 안테나부, 통신부, 제어부, 구동부(540a), 전원공급부(540b), 센서부(540c) 및 자율 주행부(540d)를 포함할 수 있다. 안테나부는 통신부의 일부 로 구성될 수 있다. 블록 510/530/540a~540d는 각각 도 4의 블록 410/430/440에 대응한다. 통신부는 다른 차량, 기지국(예, 기지국, 노변 기지국(road side unit) 등), 서버 등의 외부 기기들과 신 호(예, 데이터, 제어 신호 등)를 송수신할 수 있다. 제어부는 차량 또는 자율 주행 차량의 요소들을 제어하여 다양한 동작을 수행할 수 있다. 제어부는 ECU(electronic control unit)를 포함할 수 있다. 구 동부(540a)는 차량 또는 자율 주행 차량을 지상에서 주행하게 할 수 있다. 구동부(540a)는 엔진, 모터, 파 워 트레인, 바퀴, 브레이크, 조향 장치 등을 포함할 수 있다. 전원공급부(540b)는 차량 또는 자율 주행 차량 에게 전원을 공급하며, 유/무선 충전 회로, 배터리 등을 포함할 수 있다. 센서부(540c)는 차량 상태, 주변 환경 정보, 사용자 정보 등을 얻을 수 있다. 센서부(540c)는 IMU(inertial measurement unit) 센서, 충돌 센서, 휠 센서(wheel sensor), 속도 센서, 경사 센서, 중량 감지 센서, 헤딩 센서(heading sensor), 포지션 모 듈(position module), 차량 전진/후진 센서, 배터리 센서, 연료 센서, 타이어 센서, 스티어링 센서, 온도 센서, 습도 센서, 초음파 센서, 조도 센서, 페달 포지션 센서 등을 포함할 수 있다. 자율 주행부(540d)는 주행중인 차 선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절하는 기술, 정해진 경로를 따라 자동 으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하는 기술 등을 구현할 수 있다. 일 예로, 통신부는 외부 서버로부터 지도 데이터, 교통 정보 데이터 등을 수신할 수 있다. 자율 주행부 (540d)는 획득된 데이터를 기반으로 자율 주행 경로와 드라이빙 플랜을 생성할 수 있다. 제어부는 드라이 빙 플랜에 따라 차량 또는 자율 주행 차량이 자율 주행 경로를 따라 이동하도록 구동부(540a)를 제어할 수 있다(예, 속도/방향 조절). 자율 주행 도중에 통신부는 외부 서버로부터 최신 교통 정보 데이터를 비/주기 적으로 획득하며, 주변 차량으로부터 주변 교통 정보 데이터를 획득할 수 있다. 또한, 자율 주행 도중에 센서부 (540c)는 차량 상태, 주변 환경 정보를 획득할 수 있다. 자율 주행부(540d)는 새로 획득된 데이터/정보에 기반 하여 자율 주행 경로와 드라이빙 플랜을 갱신할 수 있다. 통신부는 차량 위치, 자율 주행 경로, 드라이빙 플랜 등에 관한 정보를 외부 서버로 전달할 수 있다. 외부 서버는 차량 또는 자율 주행 차량들로부터 수집된 정 보에 기반하여, AI 기술 등을 이용하여 교통 정보 데이터를 미리 예측할 수 있고, 예측된 교통 정보 데이터를 차량 또는 자율 주행 차량들에게 제공할 수 있다. 도 6은 본 개시에 적용되는 이동체의 예시를 도시한 도면이다. 도 6을 참조하면, 본 개시에 적용되는 이동체는 운송수단, 기차, 비행체 및 선박 중 적어도 어느 하나로 구현될 수 있다. 또한, 본 개시에 적용되는 이동체는 다른 형태로 구현될 수 있으며, 상술한 실시 예로 한정되지 않는 다. 이때, 도 6을 참조하면, 이동체( 600)은 통신부, 제어부, 메모리부, 입출력부(640a) 및 위치 측 정부(640b)를 포함할 수 있다. 여기서, 블록 610~630/640a~640b는 각각 도 3의 블록 310~330/340에 대응한다. 통신부는 다른 이동체, 또는 기지국 등의 외부 기기들과 신호(예, 데이터, 제어 신호 등)를 송수신할 수 있다. 제어부는 이동체의 구성 요소들을 제어하여 다양한 동작을 수행할 수 있다. 메모리부는 이동체의 다양한 기능을 지원하는 데이터/파라미터/프로그램/코드/명령을 저장할 수 있다. 입출력부(640 a)는 메모리부 내의 정보에 기반하여 AR/VR 오브젝트를 출력할 수 있다. 입출력부(640a)는 HUD를 포함할 수 있다. 위치 측정부(640b)는 이동체의 위치 정보를 획득할 수 있다. 위치 정보는 이동체의 절대 위 치 정보, 주행선 내에서의 위치 정보, 가속도 정보, 주변 차량과의 위치 정보 등을 포함할 수 있다. 위치 측정 부(640b)는 GPS 및 다양한 센서들을 포함할 수 있다. 일 예로, 이동체의 통신부는 외부 서버로부터 지도 정보, 교통 정보 등을 수신하여 메모리부에 저장할 수 있다. 위치 측정부(640b)는 GPS 및 다양한 센서를 통하여 이동체 위치 정보를 획득하여 메모리부 에 저장할 수 있다. 제어부는 지도 정보, 교통 정보 및 이동체 위치 정보 등에 기반하여 가상 오브젝 트를 생성하고, 입출력부(640a)는 생성된 가상 오브젝트를 이동체 내 유리창에 표시할 수 있다(651, 652). 또한, 제어부는 이동체 위치 정보에 기반하여 이동체가 주행선 내에서 정상적으로 운행되고 있는지 판단할 수 있다. 이동체가 주행선을 비정상적으로 벗어나는 경우, 제어부는 입출력부(640a)를 통해 이동체 내 유리창에 경고를 표시할 수 있다. 또한, 제어부는 통신부를 통해 주변 이동체들에게 주행 이상에 관한 경고 메세지를 방송할 수 있다. 상황에 따라, 제어부는 통신부를 통해 관계 기관에게 이 동체의 위치 정보와, 주행/이동체 이상에 관한 정보를 전송할 수 있다. 도 7은 본 개시에 적용되는 XR 기기의 예시를 도시한 도면이다. XR 기기는 HMD, 차량에 구비된 HUD(head-up display), 텔레비전, 스마트폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지(signage), 차량, 로봇 등으로 구현될 수 있다. 도 7을 참조하면, XR 기기(700a)는 통신부, 제어부, 메모리부, 입출력부(740a), 센서부(740b) 및 전원 공급부(740c)를 포함할 수 있다. 여기서, 블록 710~730/740a~740c은 각각 도 3의 블록 310~330/340에 대응할 수 있다. 통신부는 다른 무선 기기, 휴대 기기, 또는 미디어 서버 등의 외부 기기들과 신호(예, 미디어 데이터, 제 어 신호 등)를 송수신할 수 있다. 미디어 데이터는 영상, 이미지, 소리 등을 포함할 수 있다. 제어부는 XR 기기(700a)의 구성 요소들을 제어하여 다양한 동작을 수행할 수 있다. 예를 들어, 제어부는 비디오/이미지 획득, (비디오/이미지) 인코딩, 메타데이터 생성 및 처리 등의 절차를 제어 및/또는 수행하도록 구성될 수 있다. 메모리부는 XR 기기(700a)의 구동/XR 오브젝트의 생성에 필요한 데이터/파라미터/프로그램/코드/명 령을 저장할 수 있다. 입출력부(740a)는 외부로부터 제어 정보, 데이터 등을 획득하며, 생성된 XR 오브젝트를 출력할 수 있다. 입출력 부(740a)는 카메라, 마이크로폰, 사용자 입력부, 디스플레이부, 스피커 및/또는 햅틱 모듈 등을 포함할 수 있다. 센서부(740b)는 XR 기기 상태, 주변 환경 정보, 사용자 정보 등을 얻을 수 있다. 센서부(740b)는 근접 센 서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센서, RGB(red green blue) 센서, IR(infrared) 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰 및/또는 레이더 등을 포함할 수 있다. 전원공급부 (740c)는 XR 기기(700a)에게 전원을 공급하며, 유/무선 충전 회로, 배터리 등을 포함할 수 있다. 일 예로, XR 기기(700a)의 메모리부는 XR 오브젝트(예, AR/VR/MR 오브젝트)의 생성에 필요한 정보(예, 데 이터 등)를 포함할 수 있다. 입출력부(740a)는 사용자로부터 XR 기기(700a)를 조작하는 명령을 획득할 수 있으 며, 제어부는 사용자의 구동 명령에 따라 XR 기기(700a)를 구동시킬 수 있다. 예를 들어, 사용자가 XR 기 기(700a)를 통해 영화, 뉴스 등을 시청하려고 하는 경우, 제어부는 통신부를 통해 컨텐츠 요청 정보 를 다른 기기(예, 휴대 기기(700b)) 또는 미디어 서버에 전송할 수 있다. 통신부는 다른 기기(예, 휴대 기 기(700b)) 또는 미디어 서버로부터 영화, 뉴스 등의 컨텐츠를 메모리부로 다운로드/스트리밍 받을 수 있다. 제어부는 컨텐츠에 대해 비디오/이미지 획득, (비디오/이미지) 인코딩, 메타데이터 생성/처리 등의 절차를 제어 및/또는 수행하며, 입출력부(740a)/센서부(740b)를 통해 획득한 주변 공간 또는 현실 오브젝트에 대한 정보에 기반하여 XR 오브젝트를 생성/출력할 수 있다. 또한, XR 기기(700a)는 통신부를 통해 휴대 기기(700b)와 무선으로 연결되며, XR 기기(700a)의 동작은 휴 대 기기(700b)에 의해 제어될 수 있다. 예를 들어, 휴대 기기(700b)는 XR 기기(700a)에 대한 콘트롤러로 동작할 수 있다. 이를 위해, XR 기기(700a)는 휴대 기기(700b)의 3차원 위치 정보를 획득한 뒤, 휴대 기기(700b)에 대 응하는 XR 개체를 생성하여 출력할 수 있다. 도 8은 본 개시에 적용되는 로봇의 예시를 도시한 도면이다. 일 예로, 로봇은 사용 목적이나 분야에 따라 산업 용, 의료용, 가정용, 군사용 등으로 분류될 수 있다. 이때, 도 8을 참조하면, 로봇은 통신부, 제어부 , 메모리부, 입출력부(840a), 센서부(840b) 및 구동부(840c)를 포함할 수 있다. 여기서, 블록 810~830/840a~840c은 각각 도 3의 블록 310~330/340에 대응할 수 있다. 통신부는 다른 무선 기기, 다른 로봇, 또는 제어 서버 등의 외부 기기들과 신호(예, 구동 정보, 제어 신호 등)를 송수신할 수 있다. 제어부는 로봇의 구성 요소들을 제어하여 다양한 동작을 수행할 수 있다. 메모리부는 로봇의 다양한 기능을 지원하는 데이터/파라미터/프로그램/코드/명령을 저장할 수 있다. 입출력부(840a)는 로봇의 외부로부터 정보를 획득하며, 로봇의 외부로 정보를 출력할 수 있다. 입출 력부(840a)는 카메라, 마이크로폰, 사용자 입력부, 디스플레이부, 스피커 및/또는 햅틱 모듈 등을 포함할 수 있 다. 센서부(840b)는 로봇의 내부 정보, 주변 환경 정보, 사용자 정보 등을 얻을 수 있다. 센서부(840b)는 근접 센서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰, 레이더 등을 포함할 수 있다. 구동부(840c)는 로봇 관절을 움직이는 등의 다양한 물리적 동작을 수행할 수 있다. 또한, 구동부(840c)는 로봇 을 지상에서 주행하거나 공중에서 비행하게 할 수 있다. 구동부(840c)는 액츄에이터, 모터, 바퀴, 브레이 크, 프로펠러 등을 포함할 수 있다. 도 9는 본 개시에 적용되는 AI 기기의 예시를 도시한 도면이다. 일 예로, AI 기기는 TV, 프로젝터, 스마트폰, PC, 노트북, 디지털방송용 단말기, 태블릿 PC, 웨어러블 장치, 셋톱박스(STB), 라디오, 세탁기, 냉장고, 디지털 사이니지, 로봇, 차량 등과 같은, 고정형 기기 또는 이동 가능한 기기 등으로 구현될 수 있다. 도 9를 참조하면, AI 기기는 통신부, 제어부, 메모리부, 입/출력부(940a/940b), 러닝 프 로세서부(940c) 및 센서부(940d)를 포함할 수 있다. 블록 910~930/940a~940d는 각각 도 3의 블록 310~330/340 에 대응할 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 AI 기기(예, 도 1, 100x, 120, 140)나 AI 서버(도 1, 140) 등의 외부 기기들과 유무선 신호(예, 센서 정보, 사용자 입력, 학습 모델, 제어 신호 등)를 송수신할 수 있다. 이를 위해, 통신부는 메모리부 내의 정보를 외부 기기로 전송하거나, 외부 기기로부터 수신된 신호를 메모리부로 전달할 수 있다. 제어부는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 사용하여 결정되거나 생성된 정보에 기초하여, AI 기기의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 제어부는 AI 기기의 구 성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 예를 들어, 제어부는 러닝 프로세서부(940c) 또는 메모리부의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 적어도 하나의 실행 가능한 동작 중 예측되 는 동작이나, 바람직한 것으로 판단되는 동작을 실행하도록 AI 기기의 구성 요소들을 제어할 수 있다. 또 한, 제어부는 AI 장치의 동작 내용이나 동작에 대한 사용자의 피드백 등을 포함하는 이력 정보를 수 집하여 메모리부 또는 러닝 프로세서부(940c)에 저장하거나, AI 서버(도 1, 140) 등의 외부 장치에 전송할 수 있다. 수집된 이력 정보는 학습 모델을 갱신하는데 이용될 수 있다. 메모리부는 AI 기기의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예를 들어, 메모리부 는 입력부(940a)로부터 얻은 데이터, 통신부로부터 얻은 데이터, 러닝 프로세서부(940c)의 출력 데이터, 및 센싱부로부터 얻은 데이터를 저장할 수 있다. 또한, 메모리부는 제어부의 동작/실행에 필요 한 제어 정보 및/또는 소프트웨어 코드를 저장할 수 있다. 입력부(940a)는 AI 기기의 외부로부터 다양한 종류의 데이터를 획득할 수 있다. 예를 들어, 입력부는 모델 학습을 위한 학습 데이터, 및 학습 모델이 적용될 입력 데이터 등을 획득할 수 있다. 입력부(940a)는 카메 라, 마이크로폰 및/또는 사용자 입력부 등을 포함할 수 있다. 출력부(940b)는 시각, 청각 또는 촉각 등과 관련 된 출력을 발생시킬 수 있다. 출력부(940b)는 디스플레이부, 스피커 및/또는 햅틱 모듈 등을 포함할 수 있다. 센싱부는 다양한 센서들을 이용하여 AI 기기의 내부 정보, AI 기기의 주변 환경 정보 및 사용자 정보 중 적어도 하나를 얻을 수 있다. 센싱부는 근접 센서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센서, RGB 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰 및/또는 레이더 등을 포함할 수 있다. 러닝 프로세서부(940c)는 학습 데이터를 이용하여 인공 신경망으로 구성된 모델을 학습시킬 수 있다. 러닝 프로 세서부(940c)는 AI 서버(도 1, 140)의 러닝 프로세서부와 함께 AI 프로세싱을 수행할 수 있다. 러닝 프로세서부 (940c)는 통신부를 통해 외부 기기로부터 수신된 정보, 및/또는 메모리부에 저장된 정보를 처리할 수 있다. 또한, 러닝 프로세서부(940c)의 출력 값은 통신부를 통해 외부 기기로 전송되거나/되고, 메모리부 에 저장될 수 있다. 물리 채널들 및 일반적인 신호 전송 무선 접속 시스템에서 단말은 하향링크(downlink, DL)를 통해 기지국으로부터 정보를 수신하고, 상향링크 (uplink, UL)를 통해 기지국으로 정보를 전송할 수 있다. 기지국과 단말이 송수신하는 정보는 일반 데이터 정보 및 다양한 제어 정보를 포함하고, 이들이 송수신 하는 정보의 종류/용도에 따라 다양한 물리 채널이 존재한다. 도 10은 본 개시에 적용되는 물리 채널들 및 이들을 이용한 신호 전송 방법을 도시한 도면이다. 전원이 꺼진 상태에서 다시 전원이 켜지거나, 새로이 셀에 진입한 단말은 S1011 단계에서 기지국과 동기를 맞추 는 등의 초기 셀 탐색(initial cell search) 작업을 수행한다. 이를 위해 단말은 기지국으로부터 주 동기 채널 (primary synchronization channel, P-SCH) 및 부 동기 채널(secondary synchronization channel, S-SCH)을 수신하여 기지국과 동기를 맞추고, 셀 ID 등의 정보를 획득할 수 있다. 그 후, 단말은 기지국으로부터 물리 방송 채널(physical broadcast channel, PBCH) 신호를 수신하여 셀 내 방 송 정보를 획득할 수 있다. 한편, 단말은 초기 셀 탐색 단계에서 하향링크 참조 신호 (DL RS: Downlink Reference Signal)를 수신하여 하향링크 채널 상태를 확인할 수 있다. 초기 셀 탐색을 마친 단말은 S1012 단계 에서 물리 하향링크 제어 채널(physical downlink control channel, PDCCH) 및 물리 하향링크 제어 채널 정보 에 따른 물리 하향링크 공유 채널(physical downlink control channel, PDSCH)을 수신하여 조금 더 구체적인 시스템 정보를 획득할 수 있다. 이후, 단말은 기지국에 접속을 완료하기 위해 이후 단계 S1013 내지 단계 S1016과 같은 임의 접속 과정(random access procedure)을 수행할 수 있다. 이를 위해 단말은 물리 임의 접속 채널(physical random access channel, PRACH)을 통해 프리앰블 (preamble)을 전송하고(S1013), 물리 하향링크 제어 채널 및 이에 대응하는 물리 하향링크 공유 채널을 통해 프리앰블에 대한 RAR(random access response)를 수신할 수 있다(S1014). 단 말은 RAR 내의 스케줄링 정보를 이용하여 PUSCH(physical uplink shared channel)을 전송하고(S1015), 물리 하 향링크 제어채널 신호 및 이에 대응하는 물리 하향링크 공유 채널 신호의 수신과 같은 충돌 해결 절차 (contention resolution procedure)를 수행할 수 있다(S1016). 상술한 바와 같은 절차를 수행한 단말은 이후 일반적인 상/하향링크 신호 전송 절차로서 물리 하향링크 제어 채 널 신호 및/또는 물리 하향링크 공유 채널 신호의 수신(S1017) 및 물리 상향링크 공유 채널(physical uplink shared channel, PUSCH) 신호 및/또는 물리 상향링크 제어 채널(physical uplink control channel, PUCCH) 신 호의 전송(S1018)을 수행할 수 있다. 단말이 기지국으로 전송하는 제어정보를 통칭하여 상향링크 제어정보(uplink control information, UCI)라고 지 칭한다. UCI는 HARQ-ACK/NACK(hybrid automatic repeat and request acknowledgement/negative-ACK), SR(scheduling request), CQI(channel quality indication), PMI(precoding matrix indication), RI(rank indication), BI(beam indication) 정보 등을 포함한다. 이때, UCI는 일반적으로 PUCCH를 통해 주기적으로 전 송되지만, 실시 예에 따라(예, 제어정보와 트래픽 데이터가 동시에 전송되어야 할 경우) PUSCH를 통해 전송될 수 있다. 또한, 네트워크의 요청/지시에 의해 단말은 PUSCH를 통해 UCI를 비주기적으로 전송할 수 있다. 도 11은 본 개시에 적용되는 무선 인터페이스 프로토콜(radio interface protocol)의 제어평면(control plane) 및 사용자 평면(user plane) 구조를 도시한 도면이다. 도 11 을 참조하면, 엔티티 1(Entity 1)은 단말(user equipment, UE)일 수 있다. 이때, 단말이라 함은 상술한 도 1 내지 도 9에서 본 개시가 적용되는 무선 기기, 휴대 기기, 차량, 이동체, XR 기기, 로봇 및 AI 중 적어도 어느 하나일 수 있다. 또한, 단말은 본 개시가 적용될 수 있는 장치를 지칭하는 것으로 특정 장치나 기기로 한 정되지 않을 수 있다. 엔티티 2(Entity 2)는 기지국일 수 있다. 이때, 기지국은 eNB, gNB 및 ng-eNB 중 적어도 어느 하나일 수 있다. 또한, 기지국은 단말로 하향링크 신호를 전송하는 장치를 지칭할 수 있으며, 특정 타입이나 장치로 한정되지 않 을 수 있다. 즉, 기지국은 다양한 형태나 타입으로 구현될 수 있으며, 특정 형태로 한정되지 않을 수 있다. 엔티티 3(Entity 3)은 네트워크 장치 또는 네트워크 펑션을 수행하는 기기일 수 있다. 이때, 네트워크 장치는 이동성을 관리하는 코어망 노드(core network node)(e.g. MME(mobility management entity), AMF(access and mobility management function) 등)일 수 있다. 또한, 네트워크 펑션은 네트워크 기능을 수행하기 위해 구현되 는 펑션(function)을 의미할 수 있으며, 엔티티 3은 펑션이 적용된 기기일 수 있다. 즉, 엔티티 3은 네트워크 기능을 수행하는 펑션이나 기기를 지칭할 수 있으며, 특정 형태의 기기로 한정되지 않는다. 제어평면은 단말(user equipment, UE)과 네트워크가 호를 관리하기 위해서 이용하는 제어 메시지들이 전송되는 통로를 의미할 수 있다. 또한, 사용자평면은 애플리케이션 계층에서 생성된 데이터, 예를 들어, 음성 데이터 또 는 인터넷 패킷 데이터 등이 전송되는 통로를 의미할 수 있다. 이때, 제1 계층인 물리계층은 물리채널(physical channel)을 이용하여 상위 계층에게 정보 전송 서비스(information transfer service)를 제공할 수 있다. 물리 계층은 상위에 있는 매체접속제어(medium access control) 계층과는 전송채널을 통해 연결되어 있다. 이때, 전 송채널을 통해 매체접속제어 계층과 물리계층 사이에 데이터가 이동할 수 있다. 송신 측과 수신 측의 물리계층 사이는 물리채널을 통해 데이터가 이동할 수 있다. 이때, 물리채널은 시간과 주파수를 무선 자원으로 활용한다. 제2 계층의 매체접속제어(medium access control, MAC) 계층은 논리채널(logical channel)을 통해 상위계층인 무선링크제어(radio link control, RLC) 계층에 서비스를 제공한다. 제2 계층의 RLC 계층은 신뢰성 있는 데이터 전송을 지원할 수 있다. RLC 계층의 기능은 MAC 내부의 기능 블록으로 구현될 수도 있다. 제2 계층의 PDCP(packet data convergence protocol) 계층은 대역폭이 좁은 무선 인터페이스에서 IPv4 나 IPv6 와 같은 IP 패킷을 효율적으로 전송하기 위해 불필요한 제어정보를 줄여주는 헤더 압축(header compression) 기능을 수행할 수 있다. 제3 계층의 최하부에 위치한 무선 자원제어(radio resource control, RRC) 계층은 제어평면에서만 정 의된다. RRC 계층은 무선 베어러(radio bearer, RB)들의 설정(configuration), 재설정(re-configuration) 및 해제(release)와 관련되어 논리채널, 전송채널 및 물리채널들의 제어를 담당할 수 있다. RB는 단말과 네트워크 간의 데이터 전달을 위해 제2 계층에 의해 제공되는 서비스를 의미할 수 있다. 이를 위해, 단말과 네트워크의RRC 계층은 서로 RRC 메시지를 교환할 수 있다. RRC 계층의 상위에 있는 NAS(non-access stratum) 계층은 세션 관리(session management)와 이동성 관리(mobility management) 등의 기능을 수행할 수 있다. 기지국을 구성하 는 하나의 셀은 다양한 대역폭 중 하나로 설정되어 여러 단말에게 하향 또는 상향 전송 서비스를 제공할 수 있 다. 서로 다른 셀은 서로 다른 대역폭을 제공하도록 설정될 수 있다. 네트워크에서 단말로 데이터를 전송하는 하향 전송채널은 시스템 정보를 전송하는 BCH(broadcast channel), 페이징 메시지를 전송하는 PCH(paging channel), 사용자 트래픽이나 제어 메시지를 전송하는 하향 SCH(shared channel) 등이 있다. 하향 멀티캐스트 또는 방송 서비스의 트래픽 또는 제어 메시지의 경우, 하향 SCH를 통해 전송될 수도 있고, 또는 별도의 하향 MCH(Multicast Channel)을 통해 전송될 수도 있다. 한편, 단말에서 네트워크로 데이터를 전송하는 상향 전송채 널로는 초기 제어 메시지를 전송하는 RACH(random access channel), 사용자 트래픽이나 제어 메시지를 전송하는 상향 SCH(shared channel)가 있다. 전송채널의 상위에 있으며, 전송채널에 매핑되는 논리채널(logical channel)로는 BCCH(broadcast control channel), PCCH(paging control channel), CCCH(common control channel), MCCH(multicast control channel) 및 MTCH(multicast traffic channel) 등이 있다. 도 12는 본 개시에 적용되는 전송 신호를 처리하는 방법을 도시한 도면이다. 일 예로, 전송 신호는 신호 처리 회로에 의해 처리될 수 있다. 이때, 신호 처리 회로는 스크램블러, 변조기, 레이어 매퍼 , 프리코더, 자원 매퍼, 신호 생성기를 포함할 수 있다. 이때, 일 예로, 도 12의 동 작/기능은 도 2의 프로세서(202a, 202b) 및/또는 송수신기(206a, 206b)에서 수행될 수 있다. 또한, 일 예로, 도 12의 하드웨어 요소는 도 2의 프로세서(202a, 202b) 및/또는 송수신기(206a, 206b)에서 구현될 수 있다. 일 예 로, 블록 1010~1060은 도 2의 프로세서(202a, 202b)에서 구현될 수 있다. 또한, 블록 1210~1250은 도 2의 프로 세서(202a, 202b)에서 구현되고, 블록 1260은 도 2의 송수신기(206a, 206b)에서 구현될 수 있으며, 상술한 실시 예로 한정되지 않는다. 코드워드는 도 12의 신호 처리 회로를 거쳐 무선 신호로 변환될 수 있다. 여기서, 코드워드는 정보블록의 부호화된 비트 시퀀스이다. 정보블록은 전송블록(예, UL-SCH 전송블록, DL-SCH 전송블록)을 포함할 수 있다. 무 선 신호는 도 10의 다양한 물리 채널(예, PUSCH, PDSCH)을 통해 전송될 수 있다. 구체적으로, 코드워드는 스크 램블러에 의해 스크램블된 비트 시퀀스로 변환될 수 있다. 스크램블에 사용되는 스크램블 시퀀스는 초기 화 값에 기반하여 생성되며, 초기화 값은 무선 기기의 ID 정보 등이 포함될 수 있다. 스크램블된 비트 시퀀스는 변조기에 의해 변조 심볼 시퀀스로 변조될 수 있다. 변조 방식은 pi/2-BPSK(pi/2-binary phase shift keying), m-PSK(m-phase shift keying), m-QAM(m-quadrature amplitude modulation) 등을 포함할 수 있다. 복소 변조 심볼 시퀀스는 레이어 매퍼에 의해 하나 이상의 전송 레이어로 매핑될 수 있다. 각 전송 레이 어의 변조 심볼들은 프리코더에 의해 해당 안테나 포트(들)로 매핑될 수 있다(프리코딩). 프리코더(124 0)의 출력 z는 레이어 매퍼의 출력 y를 N*M의 프리코딩 행렬 W와 곱해 얻을 수 있다. 여기서, N은 안테나 포트의 개수, M은 전송 레이어의 개수이다. 여기서, 프리코더는 복소 변조 심볼들에 대한 트랜스폼 (transform) 프리코딩(예, DFT(discrete fourier transform) 변환)을 수행한 이후에 프리코딩을 수행할 수 있 다. 또한, 프리코더는 트랜스폼 프리코딩을 수행하지 않고 프리코딩을 수행할 수 있다. 자원 매퍼는 각 안테나 포트의 변조 심볼들을 시간-주파수 자원에 매핑할 수 있다. 시간-주파수 자원은 시간 도메인에서 복수의 심볼(예, CP-OFDMA 심볼, DFT-s-OFDMA 심볼)을 포함하고, 주파수 도메인에서 복수의 부 반송파를 포함할 수 있다. 신호 생성기는 매핑된 변조 심볼들로부터 무선 신호를 생성하며, 생성된 무선 신호는 각 안테나를 통해 다른 기기로 전송될 수 있다. 이를 위해, 신호 생성기는 IFFT(inverse fast fourier transform) 모듈 및 CP(cyclic prefix) 삽입기, DAC(digital-to-analog converter), 주파수 상향 변환 기(frequency uplink converter) 등을 포함할 수 있다. 무선 기기에서 수신 신호를 위한 신호 처리 과정은 도 12의 신호 처리 과정(1210~1260)의 역으로 구성될 수 있 다. 일 예로, 무선 기기(예, 도 2의 200a, 200b)는 안테나 포트/송수신기를 통해 외부로부터 무선 신호를 수신 할 수 있다. 수신된 무선 신호는 신호 복원기를 통해 베이스밴드 신호로 변환될 수 있다. 이를 위해, 신호 복원 기는 주파수 하향 변환기(frequency downlink converter), ADC(analog-to-digital converter), CP 제거기, FFT(fast fourier transform) 모듈을 포함할 수 있다. 이후, 베이스밴드 신호는 자원 디-매퍼 과정, 포스트코딩 (postcoding) 과정, 복조 과정 및 디-스크램블 과정을 거쳐 코드워드로 복원될 수 있다. 코드워드는 복호 (decoding)를 거쳐 원래의 정보블록으로 복원될 수 있다. 따라서, 수신 신호를 위한 신호 처리 회로(미도시)는 신호 복원기, 자원 디-매퍼, 포스트코더, 복조기, 디-스크램블러 및 복호기를 포함할 수 있다. 도 13은 본 개시에 적용 가능한 무선 프레임의 구조를 도시한 도면이다. NR 시스템에 기초한 상향링크 및 하향링크 전송은 도 13과 같은 프레임에 기초할 수 있다. 이때, 하나의 무선 프레임은 10ms의 길이를 가지며, 2개의 5ms 하프-프레임(half-frame, HF)으로 정의될 수 있다. 하나의 하프-프 레임은 5개의 1ms 서브프레임(subframe, SF)으로 정의될 수 있다. 하나의 서브프레임은 하나 이상의 슬롯으로 분할되며, 서브프레임 내 슬롯 개수는 SCS(subcarrier spacing)에 의존할 수 있다. 이때, 각 슬롯은 CP(cyclic prefix)에 따라 12개 또는 14개의 OFDM(A) 심볼들을 포함할 수 있다. 일반 CP(normal CP)가 사용되는 경우, 각 슬롯은 14개의 심볼들을 포함할 수 있다. 확장 CP(extended CP)가 사용되는 경우, 각 슬롯은 12개의 심볼들을 포함할 수 있다. 여기서, 심볼은 OFDM 심볼(또는, CP-OFDM 심볼), SC-FDMA 심볼(또는, DFT-s-OFDM 심볼)을 포 함할 수 있다. 표 1은 일반 CP가 사용되는 경우, SCS에 따른 슬롯 별 심볼의 개수, 프레임 별 슬롯의 개수 및 서브프레임 별 슬롯의 개수를 나타내고, 표 2는 확장된 CSP가 사용되는 경우, SCS에 따른 슬롯 별 심볼의 개수, 프레임 별 슬 롯의 개수 및 서브프레임 별 슬롯의 개수를 나타낸다. [표 1]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[표 2]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기 표 1 및 표 2에서, 는 슬롯 내 심볼의 개수를 나타내고, 는 프레임 내 슬롯의 개수 를 나타내고, 는 서브프레임 내 슬롯의 개수를 나타낼 수 있다. 또한, 본 개시가 적용 가능한 시스템에서, 하나의 단말에게 병합되는 복수의 셀들간에 OFDM(A) 뉴모놀로지 (numerology)(예, SCS, CP 길이 등)가 상이하게 설정될 수 있다. 이에 따라, 동일한 개수의 심볼로 구성된 시간 자원(예, SF, 슬롯 또는 TTI)(편의상, TU(time unit)로 통칭)의 (절대 시간) 구간이 병합된 셀들 간에 상이하게 설정될 수 있다. NR은 다양한 5G 서비스들을 지원하기 위한 다수의 numerology(또는 SCS(subcarrier spacing))를 지원할 수 있 다. 예를 들어, SCS가 15kHz인 경우, 전통적인 셀룰러 밴드들에서의 넓은 영역(wide area)를 지원하며, SCS가 30kHz/60kHz인 경우, 밀집한-도시(dense-urban), 더 낮은 지연(lower latency) 및 더 넓은 캐리어 대역폭 (wider carrier bandwidth)를 지원하며, SCS가 60kHz 또는 그보다 높은 경우, 위상 잡음(phase noise)를 극복 하기 위해 24.25GHz보다 큰 대역폭을 지원할 수 있다. NR 주파수 밴드(frequency band)는 2가지 type(FR1, FR2)의 주파수 범위(frequency range)로 정의된다. FR1, FR2는 아래 표와 같이 구성될 수 있다. 또한, FR2는 밀리미터 웨이브(millimeter wave, mmW)를 의미할 수 있다. [표 3]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "6G (무선통신) 시스템은 (i) 디바이스 당 매우 높은 데이터 속도, (ii) 매우 많은 수의 연결된 디바이스들, (iii) 글로벌 연결성(global connectivity), (iv) 매우 낮은 지연, (v) 배터리-프리(battery-free) IoT 디바이 스들의 에너지 소비를 낮추고, (vi) 초고신뢰성 연결, (vii) 머신 러닝 능력을 가지는 연결된 지능 등에 목적이있다. 6G 시스템의 비젼은 “intelligent connectivity”, “deep connectivity”, “holographic connectivity”, “ubiquitous connectivity”와 같은 4가지 측면일 수 있으며, 6G 시스템은 하기 표 4와 같은 요구 사항을 만족시킬 수 있다. 즉, 표 4는 6G 시스템의 요구 사항을 나타낸 표이다. [표 4]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "또한, 일 예로, 본 개시가 적용 가능한 통신 시스템에서 상술한 뉴모놀로지(numerology)가 다르게 설정될 수 있다. 일 예로, 상술한 FR2보다 높은 주파수 대역으로 테라헤르츠 웨이브(Terahertz wave, THz) 대역이 사용될 수 있다. THz 대역에서 SCS는 NR 시스템보다 더 크게 설정될 수 있으며, 슬롯 수도 상이하게 설정될 수 있으며, 상술한 실시 예로 한정되지 않는다. THz 대역에 대해서는 하기에서 후술한다. 도 14는 본 개시에 적용 가능한 슬롯 구조를 도시한 도면이다. 하나의 슬롯은 시간 도메인에서 복수의 심볼을 포함한다. 예를 들어, 보통 CP의 경우 하나의 슬롯이 7개의 심볼 을 포함하나, 확장 CP의 경우 하나의 슬롯이 6개의 심볼을 포함할 수 있다. 반송파(carrier)는 주파수 도메인에 서 복수의 부반송파(subcarrier)를 포함한다. RB(Resource Block)는 주파수 도메인에서 복수(예, 12)의 연속한 부반송파로 정의될 수 있다. 또한, BWP(Bandwidth Part)는 주파수 도메인에서 복수의 연속한 (P)RB로 정의되며, 하나의 뉴모놀로지 (numerology)(예, SCS, CP 길이 등)에 대응될 수 있다. 반송파는 최대 N개(예, 5개)의 BWP를 포함할 수 있다. 데이터 통신은 활성화된 BWP를 통해서 수행되며, 하나의 단말한테는 하나의 BWP만 활성화될 수 있다. 자원 그리드에서 각각의 요소는 자원요소(Resource Element, RE)로 지칭되며, 하나의 복소 심볼이 매핑될 수 있다. 6G 통신 시스템 이때, 6G 시스템은 향상된 모바일 브로드밴드(enhanced mobile broadband, eMBB), 초-저지연 통신(ultra- reliable low latency communications, URLLC), mMTC (massive machine type communications), AI 통합 통신 (AI integrated communication), 촉각 인터넷(tactile internet), 높은 스루풋(high throughput), 높은 네트워 크 능력(high network capacity), 높은 에너지 효율(high energy efficiency), 낮은 백홀 및 접근 네트워크 혼 잡(low backhaul and access network congestion) 및 향상된 데이터 보안(enhanced data security)과 같은 핵 심 요소(key factor)들을 가질 수 있다. 도 15는 본 개시에 적용 가능한 6G 시스템에서 제공 가능한 통신 구조의 일례를 도시한 도면이다. 도 15를 참조하면, 6G 시스템은 5G 무선통신 시스템보다 50배 더 높은 동시 무선통신 연결성을 가질 것으로 예 상된다. 5G의 핵심 요소(key feature)인 URLLC는 6G 통신에서 1ms보다 적은 단-대-단(end-to-end) 지연을 제공 함으로써 보다 더 주요한 기술이 될 것으로 예상된다. 이때, 6G 시스템은 자주 사용되는 영역 스펙트럼 효율과 달리 체적 스펙트럼 효율이 훨씬 우수할 것이다. 6G 시스템은 매우 긴 배터리 수명과 에너지 수확을 위한 고급 배터리 기술을 제공할 수 있어, 6G 시스템에서 모바일 디바이스들은 별도로 충전될 필요가 없을 수 있다. 또한, 6G에서 새로운 네트워크 특성들은 다음과 같을 수 있다. - 위성 통합 네트워크(Satellites integrated network): 글로벌 모바일 집단을 제공하기 위해 6G는 위성과 통 합될 것으로 예상된다. 지상파, 위성 및 공중 네트워크를 하나의 무선통신 시스템으로 통합은 6G에 매우 중요할 수 있다. - 연결된 인텔리전스(connected intelligence): 이전 세대의 무선 통신 시스템과 달리 6G는 혁신적이며, “연결 된 사물”에서 \"연결된 지능\"으로 무선 진화가 업데이트될 것이다. AI는 통신 절차의 각 단계(또는 후술할 신호 처리의 각 절차)에서 적용될 수 있다. - 무선 정보 및 에너지 전달의 완벽한 통합(seamless integration wireless information and energy transfer): 6G 무선 네트워크는 스마트폰들과 센서들과 같이 디바이스들의 배터리를 충전하기 위해 전력을 전달 할 것이다. 그러므로, 무선 정보 및 에너지 전송 (WIET)은 통합될 것이다. - 유비쿼터스 슈퍼 3D 연결(ubiquitous super 3-dimemtion connectivity): 드론 및 매우 낮은 지구 궤도 위성 의 네트워크 및 핵심 네트워크 기능에 접속은 6G 유비쿼터스에서 슈퍼 3D 연결을 만들 것이다. 위와 같은 6G의 새로운 네트워크 특성들에서 몇 가지 일반적인 요구 사항은 다음과 같을 수 있다. - 스몰 셀 네트워크(small cell networks): 스몰 셀 네트워크의 아이디어는 셀룰러 시스템에서 처리량, 에너지 효율 및 스펙트럼 효율 향상의 결과로 수신 신호 품질을 향상시키기 위해 도입되었다. 결과적으로, 스몰 셀 네 트워크는 5G 및 비욘드 5G (5GB) 이상의 통신 시스템에 필수적인 특성이다. 따라서, 6G 통신 시스템 역시 스몰 셀 네트워크의 특성을 채택한다. - 초 고밀도 이기종 네트워크(ultra-dense heterogeneous network): 초 고밀도 이기종 네트워크들은 6G 통신 시스템의 또 다른 중요한 특성이 될 것이다. 이기종 네트워크로 구성된 멀티-티어 네트워크는 전체 QoS를 개선 하고 비용을 줄인다. - 대용량 백홀(high-capacity backhaul): 백홀 연결은 대용량 트래픽을 지원하기 위해 대용량 백홀 네트워크로 특징 지어진다. 고속 광섬유 및 자유 공간 광학 (FSO) 시스템이 이 문제에 대한 가능한 솔루션일 수 있다. - 모바일 기술과 통합된 레이더 기술: 통신을 통한 고정밀 지역화(또는 위치 기반 서비스)는 6G 무선통신 시스 템의 기능 중 하나이다. 따라서, 레이더 시스템은 6G 네트워크와 통합될 것이다. - 소프트화 및 가상화(softwarization and virtualization): 소프트화 및 가상화는 유연성, 재구성성 및 프로 그래밍 가능성을 보장하기 위해 5GB 네트워크에서 설계 프로세스의 기초가 되는 두 가지 중요한 기능이다. 또한, 공유 물리적 인프라에서 수십억 개의 장치가 공유될 수 있다. 6G 시스템의 핵심 구현 기술 - 인공 지능(artificial Intelligence, AI) 6G 시스템에 가장 중요하며, 새로 도입될 기술은 AI이다. 4G 시스템에는 AI가 관여하지 않았다. 5G 시스템은 부 분 또는 매우 제한된 AI를 지원할 것이다. 그러나, 6G 시스템은 완전히 자동화를 위해 AI가 지원될 것이다. 머 신 러닝의 발전은 6G에서 실시간 통신을 위해 보다 지능적인 네트워크를 만들 것이다. 통신에 AI를 도입하면 실 시간 데이터 전송이 간소화되고 향상될 수 있다. AI는 수많은 분석을 사용하여 복잡한 대상 작업이 수행되는 방 식을 결정할 수 있다. 즉, AI는 효율성을 높이고 처리 지연을 줄일 수 있다. 핸드 오버, 네트워크 선택, 자원 스케줄링과 같은 시간 소모적인 작업은 AI를 사용함으로써 즉시 수행될 수 있 다. AI는 M2M, 기계-대-인간 및 인간-대-기계 통신에서도 중요한 역할을 할 수 있다. 또한, AI는 BCI(brain computer interface)에서 신속한 통신이 될 수 있다. AI 기반 통신 시스템은 메타 물질, 지능형 구조, 지능형 네트워크, 지능형 장치, 지능형 인지 라디오(radio), 자체 유지 무선 네트워크 및 머신 러닝에 의해 지원될 수 있다. 최근 AI를 무선 통신 시스템과 통합하려고 하는 시도들이 나타나고 있으나, 이는 어플리케이션 계층 (application layer), 네트워크 계층(network layer) 특히, 딥 러닝은 무선 자원 관리 및 할당(wireless resource management and allocation) 분야에 집중되어 왔다. 그러나, 이러한 연구는 점점 MAC 계층 및 물리 계층으로 발전하고 있으며, 특히 물리계층에서 딥 러닝을 무선 전송(wireless transmission)과 결합하고자 하는 시도들이 나타나고 있다. AI 기반의 물리계층 전송은, 근본적인 신호 처리 및 통신 메커니즘에 있어서, 전통적 인 통신 프레임워크가 아니라 AI 드라이버에 기초한 신호 처리 및 통신 메커니즘을 적용하는 것을 의미한다. 예 를 들어, 딥러닝 기반의 채널 코딩 및 디코딩(channel coding and decoding), 딥러닝 기반의 신호 추정 (estimation) 및 검출(detection), 딥러닝 기반의 MIMO(multiple input multiple output) 매커니즘 (mechanism), AI 기반의 자원 스케줄링(scheduling) 및 할당(allocation) 등을 포함할 수 있다. 머신 러닝은 채널 추정 및 채널 트래킹을 위해 사용될 수 있으며, DL(downlink)의 물리 계층(physical layer)에 서 전력 할당(power allocation), 간섭 제거(interference cancellation) 등에 사용될 수 있다. 또한, 머신 러닝은 MIMO 시스템에서 안테나 선택, 전력 제어(power control), 심볼 검출(symbol detection) 등에도 사용될 수 있다. 그러나 물리계층에서의 전송을 위한 DNN의 적용은 아래와 같은 문제점이 있을 수 있다. 딥러닝 기반의 AI 알고리즘은 훈련 파라미터를 최적화하기 위해 수많은 훈련 데이터가 필요하다. 그러나 특정 채널 환경에서의 데이터를 훈련 데이터로 획득하는데 있어서의 한계로 인해, 오프라인 상에서 많은 훈련 데이터 를 사용한다. 이는 특정 채널 환경에서 훈련 데이터에 대한 정적 훈련(static training)은, 무선 채널의 동적 특성 및 다이버시티(diversity) 사이에 모순(contradiction)이 생길 수 있다. 또한, 현재 딥 러닝은 주로 실제 신호(real signal)을 대상으로 한다. 그러나, 무선 통신의 물리 계층의 신호들 은 복소 신호(complex signal)로 표현될 수 있다. 무선 통신 신호의 특성을 매칭시키기 위해 복소(complex) 도 메인 신호를 검출하는 신경망(neural network)에 대한 연구가 더 필요하다. 이하, 머신 러닝에 대해 보다 구체적으로 살펴본다. 머신 러닝은 사람이 할 수 있거나 혹은 하기 어려운 작업을 대신해낼 수 있는 기계를 만들어 내기 위해 기계를 학습시키는 일련의 동작을 의미한다. 머신 러닝을 위해서는 데이터와 러닝 모델이 필요하다. 머신 러닝에서 데 이터의 학습 방법은 크게 3가지 즉, 지도 학습(supervised learning), 비지도 학습(unsupervised learning) 그 리고 강화 학습(reinforcement learning)으로 구분될 수 있다. 신경망 학습은 출력의 오류를 최소화하기 위한 것이다. 신경망 학습은 반복적으로 학습 데이터를 신경망에 입력 시키고 학습 데이터에 대한 신경망의 출력과 타겟의 에러를 계산하고, 에러를 줄이기 위한 방향으로 신경망의 에러를 신경망의 출력 레이어에서부터 입력 레이어 방향으로 역전파(backpropagation) 하여 신경망의 각 노드의 가중치를 업데이트하는 과정이다. 지도 학습은 학습 데이터에 정답이 라벨링된 학습 데이터를 사용하며 비지도 학습은 학습 데이터에 정답이 라벨 링되어 있지 않을 수 있다. 즉, 예를 들어 데이터 분류에 관한 지도 학습의 경우의 학습 데이터는 학습 데이터 각각에 카테고리가 라벨링된 데이터 일 수 있다. 라벨링된 학습 데이터가 신경망에 입력되고 신경망의 출력(카 테고리)과 학습 데이터의 라벨을 비교하여 오차(error)가 계산될 수 있다. 계산된 오차는 신경망에서 역방향(즉, 출력 레이어에서 입력 레이어 방향)으로 역전파 되며, 역전파에 따라 신경망의 각 레이어의 각 노드 들의 연결 가중치가 업데이트 될 수 있다. 업데이트 되는 각 노드의 연결 가중치는 학습률(learning rate)에 따 라 변화량이 결정될 수 있다. 입력 데이터에 대한 신경망의 계산과 에러의 역전파는 학습 사이클(epoch)을 구성 할 수 있다. 학습률은 신경망의 학습 사이클의 반복 횟수에 따라 상이하게 적용될 수 있다. 예를 들어, 신경망 의 학습 초기에는 높은 학습률을 사용하여 신경망이 빠르게 일정 수준의 성능을 확보하도록 하여 효율성을 높이 고, 학습 후기에는 낮은 학습률을 사용하여 정확도를 높일 수 있다 데이터의 특징에 따라 학습 방법은 달라질 수 있다. 예를 들어, 통신 시스템 상에서 송신단에서 전송한 데이터 를 수신단에서 정확하게 예측하는 것을 목적으로 하는 경우, 비지도 학습 또는 강화 학습 보다는 지도 학습을 이용하여 학습을 수행하는 것이 바람직하다. 러닝 모델은 인간의 뇌에 해당하는 것으로서, 가장 기본적인 선형 모델을 생각할 수 있으나, 인공 신경망 (artificial neural networks)와 같은 복잡성이 높은 신경망 구조를 러닝 모델로 사용하는 머신 러닝의 패러다 임을 딥러닝(deep learning)이라 한다. 학습(learning) 방식으로 사용하는 신경망 코어(neural network cord)는 크게 심층 신경망(deep neural networks, DNN), 합성곱 신경망(convolutional deep neural networks, CNN), 순환 신경망(recurrent boltzmann machine, RNN) 방식이 있으며, 이러한 러닝 모델이 적용될 수 있다. THz(Terahertz) 통신 6G 시스템에서 THz 통신이 적용될 수 있다. 일 예로, 데이터 전송률은 대역폭을 늘려 높일 수 있다. 이것은 넓 은 대역폭으로 sub-THz 통신을 사용하고, 진보된 대규모 MIMO 기술을 적용하여 수행될 수 있다. 도 16은 본 개시에 적용 가능한 전자기 스펙트럼을 도시한 도면이다. 일 예로, 도 16을 참조하면, 밀리미터 이 하의 방사선으로도 알려진 THz파는 일반적으로 0.03mm-3mm 범위의 해당 파장을 가진 0.1THz와 10THz 사이의 주 파수 대역을 나타낸다. 100GHz-300GHz 대역 범위(Sub THz 대역)는 셀룰러 통신을 위한 THz 대역의 주요 부분으 로 간주된다. Sub-THz 대역 mmWave 대역에 추가하면 6G 셀룰러 통신 용량은 늘어난다. 정의된 THz 대역 중300GHz-3THz는 원적외선 (IR) 주파수 대역에 있다. 300GHz-3THz 대역은 광 대역의 일부이지만 광 대역의 경계에 있으며, RF 대역 바로 뒤에 있다. 따라서, 이 300 GHz-3THz 대역은 RF와 유사성을 나타낸다. THz 통신의 주요 특성은 (i) 매우 높은 데이터 전송률을 지원하기 위해 광범위하게 사용 가능한 대역폭, (ii) 고주파에서 발생하는 높은 경로 손실 (고 지향성 안테나는 필수 불가결)을 포함한다. 높은 지향성 안테나에서 생성된 좁은 빔 폭은 간섭을 줄인다. THz 신호의 작은 파장은 훨씬 더 많은 수의 안테나 소자가 이 대역에서 동 작하는 장치 및 BS에 통합될 수 있게 한다. 이를 통해 범위 제한을 극복할 수 있는 고급 적응형 배열 기술을 사 용할 수 있다. 광 무선 기술(optical wireless technology) OWC(optical wireless communication) 기술은 가능한 모든 장치-대-액세스 네트워크를 위한 RF 기반 통신 외에 도 6G 통신을 위해 계획되었다. 이러한 네트워크는 네트워크-대-백홀/프론트홀 네트워크 연결에 접속한다. OWC 기술은 4G 통신 시스템 이후 이미 사용되고 있으나 6G 통신 시스템의 요구를 충족시키기 위해 더 널리 사용될 것이다. 광 충실도(light fidelity), 가시광 통신, 광 카메라 통신 및 광 대역에 기초한 FSO(free space optical) 통신과 같은 OWC 기술은 이미 잘 알려진 기술이다. 광 무선 기술 기반의 통신은 매우 높은 데이터 속 도, 낮은 지연 시간 및 안전한 통신을 제공할 수 있다. LiDAR(light detection and ranging) 또한 광 대역을 기반으로 6G 통신에서 초 고해상도 3D 매핑을 위해 이용될 수 있다. FSO 백홀 네트워크 FSO 시스템의 송신기 및 수신기 특성은 광섬유 네트워크의 특성과 유사하다. 따라서, FSO 시스템의 데이터 전송 은 광섬유 시스템과 비슷하다. 따라서, FSO는 광섬유 네트워크와 함께 6G 시스템에서 백홀 연결을 제공하는 좋 은 기술이 될 수 있다. FSO를 사용하면, 10,000km 이상의 거리에서도 매우 장거리 통신이 가능하다. FSO는 바다, 우주, 수중, 고립된 섬과 같은 원격 및 비원격 지역을 위한 대용량 백홀 연결을 지원한다. FSO는 셀룰러 기지국 연결도 지원한다. 대규모 MIMO 기술 스펙트럼 효율을 향상시키는 핵심 기술 중 하나는 MIMO 기술을 적용하는 것이다. MIMO 기술이 향상되면 스펙트 럼 효율도 향상된다. 따라서, 6G 시스템에서 대규모 MIMO 기술이 중요할 것이다. MIMO 기술은 다중 경로를 이용 하기 때문에 데이터 신호가 하나 이상의 경로로 전송될 수 있도록 다중화 기술 및 THz 대역에 적합한 빔 생성 및 운영 기술도 중요하게 고려되어야 한다. 블록 체인 블록 체인은 미래의 통신 시스템에서 대량의 데이터를 관리하는 중요한 기술이 될 것이다. 블록 체인은 분산 원 장 기술의 한 형태로서, 분산 원장은 수많은 노드 또는 컴퓨팅 장치에 분산되어 있는 데이터베이스이다. 각 노 드는 동일한 원장 사본을 복제하고 저장한다. 블록 체인은 P2P(peer to peer) 네트워크로 관리된다. 중앙 집중 식 기관이나 서버에서 관리하지 않고 존재할 수 있다. 블록 체인의 데이터는 함께 수집되어 블록으로 구성된다. 블록은 서로 연결되고 암호화를 사용하여 보호된다. 블록 체인은 본질적으로 향상된 상호 운용성 (interoperability), 보안, 개인 정보 보호, 안정성 및 확장성을 통해 대규모 IoT를 완벽하게 보완한다. 따라서, 블록 체인 기술은 장치 간 상호 운용성, 대용량 데이터 추적성, 다른 IoT 시스템의 자율적 상호 작용 및 6G 통신 시스템의 대규모 연결 안정성과 같은 여러 기능을 제공한다. 3D 네트워킹 6G 시스템은 지상 및 공중 네트워크를 통합하여 수직 확장의 사용자 통신을 지원한다. 3D BS는 저궤도 위성 및 UAV를 통해 제공될 것이다. 고도 및 관련 자유도 측면에서 새로운 차원을 추가하면 3D 연결이 기존 2D 네트워크 와 상당히 다르다. 양자 커뮤니케이션 6G 네트워크의 맥락에서 네트워크의 감독되지 않은 강화 학습이 유망하다. 지도 학습 방식은 6G에서 생성된 방 대한 양의 데이터에 레이블을 지정할 수 없다. 비지도 학습에는 라벨링이 필요하지 않다. 따라서, 이 기술은 복 잡한 네트워크의 표현을 자율적으로 구축하는 데 사용할 수 있다. 강화 학습과 비지도 학습을 결합하면 진정한 자율적인 방식으로 네트워크를 운영할 수 있다. 무인 항공기 UAV(unmanned aerial vehicle) 또는 드론은 6G 무선 통신에서 중요한 요소가 될 것이다. 대부분의 경우, UAV 기술을 사용하여 고속 데이터 무선 연결이 제공된다. 기지국 엔티티는 셀룰러 연결을 제공하기 위해 UAV에 설치 된다. UAV는 쉬운 배치, 강력한 가시선 링크 및 이동성이 제어되는 자유도와 같은 고정 기지국 인프라에서 볼 수 없는 특정 기능을 가지고 있다. 천재 지변 등의 긴급 상황 동안, 지상 통신 인프라의 배치는 경제적으로 실 현 가능하지 않으며, 때로는 휘발성 환경에서 서비스를 제공할 수 없다. UAV는 이러한 상황을 쉽게 처리할 수 있다. UAV는 무선 통신 분야의 새로운 패러다임이 될 것이다. 이 기술은 eMBB, URLLC 및 mMTC 인 무선 네트워크 의 세 가지 기본 요구 사항을 용이하게 한다. UAV는 또한, 네트워크 연결성 향상, 화재 감지, 재난 응급 서비스, 보안 및 감시, 오염 모니터링, 주차 모니터링, 사고 모니터링 등과 같은 여러 가지 목적을 지원할 수 있다. 따라서, UAV 기술은 6G 통신에 가장 중요한 기술 중 하나로 인식되고 있다. 셀-프리 통신(cell-free Communication) 여러 주파수와 이기종 통신 기술의 긴밀한 통합은 6G 시스템에서 매우 중요하다. 결과적으로, 사용자는 디바이 스에서 어떤 수동 구성을 만들 필요 없이 네트워크에서 다른 네트워크로 원활하게 이동할 수 있다. 사용 가능한 통신 기술에서 최상의 네트워크가 자동으로 선택된다. 이것은 무선 통신에서 셀 개념의 한계를 깨뜨릴 것이다. 현재, 하나의 셀에서 다른 셀로의 사용자 이동은 고밀도 네트워크에서 너무 많은 핸드 오버를 야기하고, 핸드 오버 실패, 핸드 오버 지연, 데이터 손실 및 핑퐁 효과를 야기한다. 6G 셀-프리 통신은 이 모든 것을 극복하고 더 나은 QoS를 제공할 것이다. 셀-프리 통신은 멀티 커넥티비티 및 멀티-티어 하이브리드 기술과 장치의 서로 다른 이기종 라디오를 통해 달성될 것이다. 무선 정보 및 에너지 전송 통합(wireless information and energy transfer, WIET) WIET은 무선 통신 시스템과 같이 동일한 필드와 웨이브(wave)를 사용한다. 특히, 센서와 스마트폰은 통신 중 무 선 전력 전송을 사용하여 충전될 것이다. WIET은 배터리 충전 무선 시스템의 수명을 연장하기 위한 유망한 기술 이다. 따라서, 배터리가 없는 장치는 6G 통신에서 지원될 것이다. 센싱과 커뮤니케이션의 통합 자율 무선 네트워크는 동적으로 변화하는 환경 상태를 지속적으로 감지하고 서로 다른 노드간에 정보를 교환할 수 있는 기능이다. 6G에서, 감지는 자율 시스템을 지원하기 위해 통신과 긴밀하게 통합될 것이다. 액세스 백홀 네트워크의 통합 6G에서 액세스 네트워크의 밀도는 엄청날 것이다. 각 액세스 네트워크는 광섬유와 FSO 네트워크와 같은 백홀 연 결로 연결된다. 매우 많은 수의 액세스 네트워크들에 대처하기 위해, 액세스 및 백홀 네트워크 사이에 긴밀한 통합이 있을 것이다. 홀로그램 빔포밍 빔포밍은 특정 방향으로 무선 신호를 전송하기 위해 안테나 배열을 조정하는 신호 처리 절차이다. 스마트 안테 나 또는 진보된 안테나 시스템의 하위 집합이다. 빔포밍 기술은 높은 신호 대 잡음비, 간섭 방지 및 거부, 높은 네트워크 효율과 같은 몇 가지 장점이 있다. 홀로그램 빔포밍(hologram beamforming, HBF)은 소프트웨어-정의된 안테나를 사용하기 때문에 MIMO 시스템과 상당히 다른 새로운 빔포밍 방법이다. HBF는 6G에서 다중 안테나 통신 장치에서 신호의 효율적이고 유연한 전송 및 수신을 위해 매우 효과적인 접근 방식이 될 것이다. 빅 데이터 분석 빅 데이터 분석은 다양한 대규모 데이터 세트 또는 빅 데이터를 분석하기 위한 복잡한 프로세스이다. 이 프로세 스는 숨겨진 데이터, 알 수 없는 상관 관계 및 고객 성향과 같은 정보를 찾아 완벽한 데이터 관리를 보장한다. 빅 데이터는 비디오, 소셜 네트워크, 이미지 및 센서와 같은 다양한 소스에서 수집된다. 이 기술은 6G 시스템에 서 방대한 데이터를 처리하는 데 널리 사용된다. LIS(large intelligent surface) THz 대역 신호의 경우 직진성이 강하여 방해물로 인한 음영 지역이 많이 생길 수 있는데, 이러한 음영 지역 근 처에 LIS 설치함으로써 통신 권역을 확대하고 통신 안정성 강화 및 추가적인 부가 서비스가 가능한 LIS 기술이 중요하게 된다. LIS는 전자기 물질(electromagnetic materials)로 만들어진 인공 표면(artificial surface)이 고, 들어오는 무선파와 나가는 무선파의 전파(propagation)을 변경시킬 수 있다. LIS는 매시브 MIMO의 확장으로 보여질 수 있으나, 매시브 MIMO와 서로 다른 어레이(array) 구조 및 동작 메커니즘이 다르다. 또한, LIS는 수동엘리먼트(passive elements)를 가진 재구성 가능한 리플렉터(reflector)로서 동작하는 점 즉, 활성(active) RF 체인(chain)을 사용하지 않고 신호를 수동적으로만 반사(reflect)하는 점에서 낮은 전력 소비를 가지는 장점이 있다. 또한, LIS의 수동적인 리플렉터 각각은 입사되는 신호의 위상 편이를 독립적으로 조절해야 하기 때문에, 무선 통신 채널에 유리할 수 있다. LIS 컨트롤러를 통해 위상 편이를 적절히 조절함으로써, 반사된 신호는 수신 된 신호 전력을 부스트(boost)하기 위해 타겟 수신기에서 모여질 수 있다. 테라헤르츠(THz) 무선통신 도 17은 본 개시에 적용 가능한 THz 통신 방법을 도시한 도면이다. 도 17을 참조하면, THz 무선통신은 대략 0.1~10THz(1THz=1012Hz)의 진동수를 가지는 THz파를 이용하여 무선통신 을 이용하는 것으로, 100GHz 이상의 매우 높은 캐리어 주파수를 사용하는 테라헤르츠(THz) 대역 무선통신을 의 미할 수 있다. THz파는 RF(Radio Frequency)/밀리미터(mm)와 적외선 대역 사이에 위치하며, (i) 가시광/적외선 에 비해 비금속/비분극성 물질을 잘 투과하며 RF/밀리미터파에 비해 파장이 짧아 높은 직진성을 가지며 빔 집속 이 가능할 수 있다. 또한, THz파의 광자 에너지는 수 meV에 불과하기 때문에 인체에 무해한 특성이 있다. THz 무선통신에 이용될 것으로 기대되는 주파수 대역은 공기 중 분자 흡수에 의한 전파 손실이 작은 D-밴드(110GHz~170GHz) 혹은 H-밴드 (220GHz~325GHz) 대역일 수 있다. THz 무선통신에 대한 표준화 논의는 3GPP 이외에도 IEEE 802.15 THz WG(working group)을 중심으로 논의되고 있으며, IEEE 802.15의 TG(task group)(예, TG3d, TG3e)에서 발행되는 표준문서는 본 명세서에서 설명되는 내용을 구체화하거나 보충할 수 있다. THz 무선통신은 무선 인식(wireless cognition), 센싱(sensing), 이미징(imaging), 무선 통신(wireless), THz 네비게이션(navigation) 등에 응용될 수 있다. 구체적으로, 도 17을 참조하면, THz 무선통신 시나리오는 매크로 네트워크(macro network), 마이크로 네트워크 (micro network), 나노스케일 네트워크(nanoscale network)로 분류될 수 있다. 매크로 네트워크에서 THz 무선 통신은 V2V(vehicle-to-vehicle) 연결 및 백홀/프런트홀(backhaul/fronthaul) 연결에 응용될 수 있다. 마이크 로 네트워크에서 THz 무선통신은 인도어 스몰 셀(small cell), 데이터 센터에서 무선 연결과 같은 고정된 point-to-point 또는 multi-point 연결, 키오스크 다운로딩과 같은 근거리 통신(near-field communication)에 응용될 수 있다. 하기 표 5는 THz 파에서 이용될 수 있는 기술의 일례를 나타낸 표이다. [표 5]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 7, "content": "도 18은 본 개시에 적용 가능한 THz 무선 통신 송수신기를 도시한 도면이다. 도 18을 참조하면, THz 무선통신은 THz 발생 및 수신을 위한 방법을 기준으로 분류할 수 있다. THz 발생 방법은 광 소자 또는 전자소자 기반 기술로 분류할 수 있다. 이때, 전자 소자를 이용하여 THz를 발생시키는 방법은 공명 터널링 다이오드(resonant tunneling diode, RTD)와 같은 반도체 소자를 이용하는 방법, 국부 발진기와 체배기를 이용하는 방법, 화합물 반도체 HEMT(high electron mobility transistor) 기반의 집적회로를 이용한 MMIC(monolithic microwave integrated circuits) 방법, Si- CMOS 기반의 집적회로를 이용하는 방법 등이 있다. 도 18의 경우, 주파수를 높이기 위해 체배기(doubler,tripler, multiplier)가 적용되었고, 서브하모닉 믹서를 지나 안테나에 의해 방사된다. THz 대역은 높은 주파수 를 형성하므로, 체배기가 필수적이다. 여기서, 체배기는 입력 대비 N배의 출력 주파수를 갖게 하는 회로이며, 원하는 하모닉 주파수에 정합시키고, 나머지 모든 주파수는 걸러낸다. 그리고, 도 18의 안테나에 배열 안테나 등이 적용되어 빔포밍이 구현될 수도 있다. 도 18에서, IF는 중간 주파수(intermediate frequency)를 나타내며, 트리플러(tripler), 멀리플러(multipler)는 체배기를 나타내며, PA는 전력 증폭기(power amplifier)를 나타내 며, LNA는 저잡음 증폭기(low noise amplifier), PLL은 위상동기회로(phase-locked loop)를 나타낸다. 도 19는 본 개시에 적용 가능한 THz 신호 생성 방법을 도시한 도면이다. 또한, 도 20은 본 개시에 적용 가능한 무선 통신 송수신기를 도시한 도면이다. 도 19 및 도 20을 참조하면, 광 소자 기반 THz 무선통신 기술은 광소자를 이용하여 THz 신호를 발생 및 변조하 는 방법을 말한다. 광 소자 기반 THz 신호 생성 기술은 레이저와 광변조기 등을 이용하여 초고속 광신호를 생성 하고, 이를 초고속 광검출기를 이용하여 THz 신호로 변환하는 기술이다. 이 기술은 전자 소자만을 이용하는 기 술에 비해 주파수를 증가시키기가 용이하고, 높은 전력의 신호 생성이 가능하며, 넓은 주파수 대역에서 평탄한 응답 특성을 얻을 수 있다. 광소자 기반 THz 신호 생성을 위해서는 도 19에 도시된 바와 같이, 레이저 다이오드, 광대역 광변조기, 초고속 광검출기가 필요하다. 도 19의 경우, 파장이 다른 두 레이저의 빛 신호를 합파하여 레이저 간의 파장 차이에 해당하는 THz 신호를 생성하는 것이다. 도 19에서, 광 커플러(optical coupler)는 회로 또는 시스템 간의 전기적 절연과의 결합을 제공하기 위해 광파를 사용하여 전기신호를 전송하 도록 하는 반도체 디바이스를 의미하며, UTC-PD(uni-travelling carrier photo-detector)은 광 검출기의 하나 로서, 능동 캐리어(active carrier)로 전자를 사용하며 밴드갭 그레이딩(bandgap grading)으로 전자의 이동 시 간을 감소시킨 소자이다. UTC-PD는 150GHz 이상에서 광검출이 가능하다. 도 20에서, EDFA(erbium-doped fiber amplifier)는 어븀이 첨가된 광섬유 증폭기를 나타내며, PD(photo detector)는 광신호를 전기신호로 변환할 수 있는 반도체 디바이스를 나타내며, OSA는 각종 광통신 기능(예, 광전 변환, 전광 변환 등)을 하나의 부품으로 모듈화시킨 광모듈(optical sub assembly)를 나타내며, DSO는 디지털 스토리지 오실로스코프(digital storage oscilloscope)를 나타낸다. 도 21은 본 개시에 적용 가능한 송신기 구조를 도시한 도면이다. 또한, 도 22는 본 개시에 적용 가능한 변조기 구조를 도시한 도면이다. 도 21 및 도 22를 참조하면, 일반적으로 레이저(laser)의 광학 소스(optical source)를 광파 가이드(optical wave guide)를 통과시켜 신호의 위상(phase)등을 변화시킬 수 있다. 이때, 마이크로파 컨택트(microwave contact) 등을 통해 전기적 특성을 변화시킴으로써 데이터를 싣게 된다. 따라서, 광학 변조기 출력(optical modulator output)은 변조된(modulated) 형태의 파형으로 형성된다. 광전 변조기(O/E converter)는 비선형 크 리스탈(nonlinear crystal)에 의한 광학 정류(optical rectification) 동작, 광전도 안테나(photoconductive antenna)에 의한 광전 변환(O/E conversion), 광속의 전자 다발(bunch of relativistic electrons)로부터의 방 출(emission) 등에 따라 THz 펄스를 생성할 수 있다. 상기와 같은 방식으로 발생한 테라헤르츠 펄스(THz puls e)는 펨토 세컨드(femto second)부터 피코 세컨드(pico second)의 단위의 길이를 가질 수 있다. 광전 변환기 (O/E converter)는 소자의 비선형성(non-linearity)을 이용하여, 하향 변환(Down conversion)을 수행한다. 테라헤르츠 스펙트럼의 용도(THz spectrum usage)를 고려할 때, 테라헤르츠 시스템을 위해서 고정된(fixed) 또 는 모바일 서비스(mobile service) 용도로써 여러 개의 연속적인 기가헤르츠(contiguous GHz)의 대역들(band s)을 사용할 가능성이 높다. 아웃도어(outdoor) 시나리오 기준에 의하면, 1THz까지의 스펙트럼에서 산소 감쇠 (Oxygen attenuation) 10^2 dB/km를 기준으로 가용 대역폭(Bandwidth)이 분류될 수 있다. 이에 따라 상기 가용 대역폭이 여러 개의 밴드 청크(band chunk)들로 구성되는 프레임워크(framework)가 고려될 수 있다. 상기 프레 임워크의 일 예시로 하나의 캐리어(carrier)에 대해 테라헤르츠 펄스(THz pulse)의 길이를 50ps로 설정한다면, 대역폭(BW)은 약 20GHz가 된다. 적외선 대역(infrared band)에서 테라헤르츠 대역(THz band)으로의 효과적인 하향 변환(Down conversion)은 광 전 컨버터(O/E converter)의 비선형성(nonlinearity)을 어떻게 활용하는가에 달려 있다. 즉, 원하는 테라헤르츠 대역(THz band)으로 하향 변환(down conversion)하기 위해서는 해당 테라헤르츠 대역(THz band)에 옮기기에 가 장 이상적인 비선형성(non-linearity)을 갖는 광전 변환기(O/E converter)의 설계가 요구된다. 만일 타겟으로 하는 주파수 대역에 맞지 않는 광전 변환기(O/E converter)를 사용하는 경우, 해당 펄스(pulse)의 크기 (amplitude), 위상(phase)에 대하여 오류(error)가 발생할 가능성이 높다. 단일 캐리어(single carrier) 시스템에서, 광전 변환기 1개를 이용하여 테라헤르츠 송수신 시스템이 구현될 수 있다. 채널 환경에 따라 달라지지만 멀리 캐리어(Multi carrier) 시스템에서, 캐리어 수만큼 광전 변환기가 요 구될 수 있다. 특히 전술한 스펙트럼 용도와 관련된 계획에 따라 여러 개의 광대역들을 이용하는 멀티 캐리어 시스템인 경우, 그 현상이 두드러지게 될 것이다. 이와 관련하여 상기 멀티 캐리어 시스템을 위한 프레임 구조 가 고려될 수 있다. 광전 변환기를 기반으로 하향 주파수 변환된 신호는 특정 자원 영역(예: 특정 프레임)에서 전송될 수 있다. 상기 특정 자원 영역의 주파수 영역은 복수의 청크(chunk)들을 포함할 수 있다. 각 청크 (chunk)는 적어도 하나의 컴포넌트 캐리어(CC)로 구성될 수 있다. 도 23은 본 개시에 적용 가능한 신경망을 나타낸 도면이다. 상술한 바와 같이, 새로운 통신 시스템(e.g. 6G 시스템)에서 인공 지능 기술이 도입될 수 있다. 이때, 인공지능 은 사람의 뇌를 본 따서 만든 머신러닝 모델로서 신경망(neural network)을 활용할 수 있다. 구체적으로, 디바이스는 0과 1로 이루어진 사칙연산을 처리하고, 이에 기초하여 동작 및 통신을 수행할 수 있다. 이때, 기술의 발달로 인해 디바이스가 예전보다도 더 빠른 시간에 더 적은 전력을 사용하여 많은 사칙연 산을 처리할 수 있다. 반면, 사람은 사칙연산을 디바이스만큼 빠르게 할 수 없다. 인간의 뇌는 오직 빠른 사칙 연산만을 처리하기 위해 만들어진 것이 아닐 수 있다. 그러나, 사람은 인지 및 자연어처리 등의 동작을 수행할 수 있다. 이때, 상술한 동작은 사칙연산 이상의 무언가를 처리하기 위한 동작으로 현재 디바이스로는 인간의 뇌 가 할 수 있는 수준으로 처리가 불가능할 수 있다. 따라서, 디바이스가 자연언어처리, 컴퓨터 비전 등의 영역에 서는 인간과 비슷한 성능을 낼 수 있도록 시스템을 만드는 것을 고려할 수 있다. 상술한 점을 고려하여, 신경망 은 인간의 뇌를 모방해 보자라는 아이디어에 기초하여 만들어진 모델일 수 있다. 이때, 신경망은 상술한 모티베이션(Motivation)으로 만들어진 간단한 수학적 모델일 수 있다. 여기서, 인간의 뇌는 엄청나게 많은 뉴런들과 그것들을 연결하는 시냅스로 구성될 수 있다. 또한, 각각의 뉴런들이 활성화 (activate)되는 방식에 따라서 다른 뉴런들도 활성화되는지 여부를 선택하여 동작(action)을 취할 수 있다. 신 경망은 상술한 사실들에 기초하여 수학적 모델을 정의할 수 있다. 일 예로, 뉴런들은 노드(node)이고, 뉴런들을 연결하는 시냅스가 엣지(edge)인 네트워크를 생성하는 것도 가능 할 수 있다. 이때, 각각의 시냅스의 중요도는 다른 수 있다. 즉, 엣지(edge)마다 웨이트(weight)을 따로 정의할 필요성이 있다. 일 예로, 도 23을 참조하면, 신경망은 직접적인 그래프(directed graph)일 수 있다. 즉, 정보 전파 (information propagation)는 한 방향으로 고정될 수 있다. 일 예로, 비-직접적인 엣지(undirected edge)를 가 지게 되는 경우, 또는 동일한 직접적인 엣지(directed edge)가 양방향으로 주어질 경우, 정보 전파(information propagation)는 반복(recursive)하게 일어날 수 있다. 따라서, 신경망에 의한 결과가 복잡해질 수 있다. 일 예 로, 상술한 바와 같은 신경망은 RNN(recurrent neural network)일 수 있다. 이때, RNN은 과거 데이터를 저장하 는 효과가 있기 때문에 최근 음성인식 등의 연속 데이터(sequential data)를 처리할 때 많이 사용되고 있다. 또 한, 멀티 레이어 인식(Multi-layer perceptron, MLP) 구조는 직접 샘플 그래프(directed simple graph)일 수 있다. 여기서, 같은 레이어들 안에서는 서로 연결(connection)이 없다. 즉, 셀프 루프(self-loop)와 평행한 엣지 (parallel edge)가 없고, 레이어와 레이어 사이에만 엣지가 존재할 수 있다. 또한, 서로 인접한 레이어 사이에 만 엣지를 가질 수 있다. 즉, 도 23에서, 첫 번째 레이어와 네 번째 레이어를 직접 연결하는 엣지가 없는 것이다. 일 예로, 하기에서 레이어에 대한 특별한 언급이 없다면 상술한 MLP일 수 있으나, 이에 한정되는 것은 아니 다. 상술한 경우, 정보 전파(information propagation)는 포워딩 방향(forward)으로만 발생할 수 있다. 따라서, 상술한 네트워크는 피드-포워드 네트워크(feed-forward network)일 수 있으나, 이에 한정되는 것은 아 니다. 또한, 일 예로, 실제 뇌에서는 각기 다른 뉴런들이 활성화되고, 그 결과가 다음 뉴런으로 전달될 수 있다. 상술 한 방식으로 결과 값은 최종 결정을 내리는 뉴런이 활성화시킬 수 있으며, 이를 통해 정보를 처리하게 된다. 이 때, 상술한 방식을 수학적 모델로 변경하면, 입력(input) 데이터들에 대한 활성화(activation) 조건을 함수 (function)로 표현하는 것이 가능할 수 있다. 이때, 상술한 함수를 활성화 함수(activate function)로 지칭할 수 있다. 일 예로, 가장 간단한 활성화 함수는 모든 입력 데이터를 합한 다음 임계값(threshold)과 비교하는 함수일 수 있다. 일 예로, 모든 입력 데이터의 합이 특정 값을 넘는 경우, 디바이스는 활성화로 정보를 처리할 수 있다. 반면, 모든 입력 데이터의 합이 특정 값을 넘지 못한 경우, 디바이스는 비활성화로 정보를 처리할 수 있다.또 다른 일 예로, 활성화 함수는 다양한 형태일 수 있다. 일 예로, 설명의 편의를 위해 수학식 1을 정의할 수 있다. 이때, 수학식 1에서 웨이트(w)뿐만 아니라 바이스(bais)를 고려할 필요성이 있으며, 이를 고려하면 하기 수학식 2처럼 표현될 수 있다. 다만, 바이스(b)와 웨이트(w)은 거의 동일하기 때문에 하기에서는 웨이트만을 고려하여 서술한다. 다만, 이에 한정되는 것은 아니다. 일 예로, 항상 값이 1인 를 추가한다면 가 바이 스가 되므로, 가상의 입력을 가정하고, 이를 통해 웨이트와 바이스를 동일하게 취급할 수 있으며, 상술한 실시 예로 한정되지 않는다. [수학식 1]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "[수학식 2]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "상술한 바에 기초한 모델은 처음에 노드와 엣지로 이루어진 네트워크의 모양을 정의할 수 있다. 그 후, 모델은 각 노드별로 활성화 함수를 정의할 수 있다. 또한, 모델을 조절하는 파라미터의 역할은 엣지의 웨이트를 맡게 되며, 가장 적절한 웨이트를 찾는 것이 수학적 모델의 트레이닝 목표일 수 있다. 일 예로, 하기 수학식 3 내지 수학식 6은 상술한 활성화 함수의 한 형태일 수 있으며, 특정 형태로 한정되는 것은 아니다. [수학식 3]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "[수학식 4]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "[수학식 5]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "[수학식 6]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "또한, 일 예로, 수학적 모델을 트레이닝하는 경우, 모든 파라미터가 결정된 것으로 가정하고 신경망이 어떻게 결과를 인터페이스하는지를 확인할 필요성이 있다. 이때, 신경망은 먼저 주어진 입력에 대해 다음 레이어를 활 성화를 결정하고, 결정된 활성화에 따라 다음 레이어의 활성화를 결정할 수 있다. 상술한 방식에 기초하여 마지 막 결정 레이어의 결과를 보고 인터페이스를 결정할 수 있다. 일 예로, 도 24는 본 개시에 적용 가능한 신경망에서 활성화 노드를 나타낸 도면이다. 도 24를 참조하면, 분류 (classification)를 수행하는 경우, 마지막 레이어에 분류하고 싶은 클라스(class) 개수만큼 결정 노드 (decision node)를 생성한 다음 그 중 하나를 활성화하여 값을 선택할 수 있다. 또한, 일 예로, 신경망의 활성화 함수들이 비-선형(non-linear)하고, 해당 함수들이 서로 레이어를 이루면서 복 잡하게 구성된 경우를 고려할 수 있다. 이때, 신경망의 웨이트 최적화(weight optimization)는 논-컨벡스 최적 화(non-convex optimization)일 수 있다. 따라서, 신경망의 파라미터들의 글로벌 최적화(optimum)를 찾는 것은 불가능할 수 있다. 상술한 점을 고려하여, 그라디언트 감소(gradient descent) 방법을 사용하여 적당한 값까지 수렴시키는 방법을 사용할 수 있다. 일 예로, 모든 최적화(optimization) 문제는 타겟 함수(target function)가정의되어야 풀 수 있다. 신경망에서는 마지막 결정 레이어에서 실제로 원하는 타겟 아웃풋과 현재 네트워크가 생성한 추정 아웃풋 (estimated output) 상호 간의 손실 함수(loss function)를 계산하여 해당 값을 최소화(minimize)하는 방식을 취할 수 있다. 일 예로, 손실 함수는 하기 수학식 7 내지 9와 같을 수 있으나, 이에 한정되는 것은 아니다. 여기서, d-차원의 타겟 아웃풋(dimensional target output)을 , 추정된 아웃풋 (estimated output)을 로 정의하는 경우를 고려할 수 있다. 이때, 수학식 7 내지 9는 최적화를 위한 손실 함수일 수 있다. [수학식 7]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "[수학식 8]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "[수학식 9]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "상술한 손실 함수가 주어지는 경우, 해당 값을 주어진 파라미터들에 대한 그라디언트(gradient)를 구한 다음 그 값들을 사용해 파라미터에 대한 업데이트를 수행할 수 있다. 일 예로, 백프로파게이션 알고리즘 (Back propagation algorithm)은 체인 룰을 사용해 그라디언트(gradient) 계산을 간단하게 수행할 수 있는 알고리즘일 수 있다. 상술한 알고리즘에 기초하여 각각의 파라미터의 그라디언 트를 계산할 때 평행화(parallelization)도 용이할 수 있다. 또한, 알고리즘 디자인을 통해 메모리도 절약할 수 있다. 따라서, 신경망 업데이트는 백프로파게이션 알고리즘을 사용할 수 있다. 또한, 일 예로, 그라디언트 감소 방법(Gradient descent method)을 사용하기 위해 현재 파라미터에 대한 그라이언트를 계산할 필요성이 있다. 이 때, 네트워크가 복잡해지는 경우, 해당 값은 계산이 복잡해질 수 있다. 반면, 백프로파게이션 알고리즘에서는 먼저 현재 파라미터를 사용하여 손실(loss)를 계산하고, 각각의 파라미터들이 해당 손실에 얼마만큼 영향을 미 쳤는지를 체인 룰을 통해 계산할 수 있다. 계산된 값에 기초하여 업데이트가 수행될 수 있다. 일 예로, 백프로 파게이션 알고리즘은 두 가지 페이즈(phase)로 나눌 수가 있다. 하나는 프로파게이션 페이즈(propagation phase)이며, 하나는 웨이트 업데이트 페이즈(weight update phase)일 수 있다. 이때, 프로파게이션 페이즈에서 는 훈련 입력 패턴(training input pattern)에서부터 에러 또는 각 뉴런들의 변화량을 계산할 수 있다. 또한, 일 예로, 웨이트 업데이트 페이즈에서는 앞에서 계산한 값을 사용해 웨이트를 업데이트할 수 있다. 일 예로, 구 체적인 페이즈에 대해서는 하기 표 6과 같을 수 있다. [표 6] 일 예로, 도 25는 본 개시에 적용 가능한 체인 룰을 이용하여 그라디언트를 계산하는 방법을 나타낸 도면이다. 도 25를 참조하면, 를 구하는 방법을 개시할 수 있다. 이때, 해당 값을 계산하는 대신 y-레이어(y-layer)에 서 이미 계산한 파생값(derivative)인 와 y-레이어와 x에만 관계있는 를 사용하여 원하는 값을 계산할 수 있다. 만약 x 아래에 x′이라는 파라미터가 존재하는 경우, 와 을 사용하여 을 계산할 수 있다. 따라 서, 백프로파게이션 알고리즘(backpropagation algorithm)에서 필요한 것은 현재 업데이트하려는 파라미터의 바 로 전 변수(variable)의 파생값(derivative)과 현재 파라미터로 바로 전 변수를 미분한 값 두개 뿐일 수 있다. 상술한 과정에서 아웃풋 레이어에서부터 순차적으로 내려오면서 반복될 수 있다. 즉, “output -> hidden k, hidden k -> hidden k-1, … hidden 2 -> hidden 1, hidden 1 -> input”의 과정을 거치면서 계속 웨이트가 업 데이트될 수 있다. 그라디언트를 계산한 후에 직접 그라디언트 감소(Gradient Descent)를 사용하여 파라미터만 업데이트를 수행할 수 있다. 다만, 신경망의 입력 데이터 개수가 엄청나게 많기 때문에 정확한 그라디언트(gradient)를 계산하기 위해서는 모든 훈련 데이터(training data)에 대해 그라디언트를 전부 계산할 필요성이 있다. 이때, 그 값을 평균 내어 정확한 그라디언트를 구한 다음 ‘한 번’ 업데이트를 수행할 수 있다. 다만, 상술한 방법은 비효율적이기 때문 에 SDG(stochastic Gradient Descent) 방법을 사용할 수 있다. 이때, SGD는 모든 데이터의 그라디언트를 평균 내어 그라디언트 업데이트를 수행하는 대신 (이를 ‘full batch’라고 한다), 일부의 데이터로 ‘mini batch’ 를 형성하여 한 배치(batch)에 대한 그라디언트만 계산하여 전체 파라미터를 업데이트할 수 있다. 컨벡스 최적 화(Convex optimization)의 경우, 특정 조건이 충족되면 SGD와 GD가 같은 글로벌 최적화(global optimum)로 수 렴하는 것이 증명될 수 있으나, 신경망은 컨벡스(convex)가 아니기 때문에 배치(batch)를 설정하는 방법에 따라 수렴하는 조건이 바뀔 수 있다. 복소수 값 처리 신경망(Complex valued neural networks) 복소수(Complex number)를 처리하는 신경망은 신경망 설명(neural network description)이나 파라미터 표현 등 다수의 장점이 존재할 수 있다. 다만, 복소수 값 처리 신경망(complex value neural network)을 사용하기 위해 서는 실수(real number)를 처리하는 실수 처리 신경망(real neural network)에 비해서 고려해야 할 점이 존재할 수 있다. 일 예로, 백프로파게이션을 통해 웨이트를 업데이트 하는 과정에서 활성화 함수에 대한 제약 사항을 고려할 필요가 있다. 일 예로, 예를 들면, 수학식 3의 “sigmoid function ”의 경우, t가 복수 수(complex number)인 경우, 의 경우 f(t)가 0이 되어 미분 가능하지 않다. 따라서, 실수 처리 신경망(real neural network)에서 일반적으로 사용하는 활성화 함수는 제약없이 복소수 처리 신경망에 적용할 수 없다. 더구나, “Liouville’s theorem”에 의하면 복소 도메인(complex domain)에서 미분 가능하고 바운디 드(bounded) 성질을 만족하는 함수는 상수(constant) 함수뿐일 수 있으며, “Liouville’s theorem”는 하기 표 7과 같을 수 있다. [표 7]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "일 예로, 표 7에 기초하여 “Liouville’s theorem”에 의해 하기 수학식 10이 도출될 수 있다. [수학식 10]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "여기서, r을 무한대로 하면, 일 수 있다. 따라서, 일 수 있다. 다만, 상수 함 수(constant function)를 신경망의 활성화 함수로 사용하는 것은 무의미할 수 있다. 따라서, 백프로파게이션이 가능하게 하는 복소 활성화 함수(complex activation function, f(z))에 필요한 특징은 하기 표 8과 같을 수 있다. [표 8]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "상술한 표 8과 같은 특징을 만족하는 경우, 복수 활성화 함수의 형태는 하기 수학식 11과 같을 수 있다. [수학식 11]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "여기서, 및 는 실수 처리 신경망(real neural network)에서 사용하는 “sigmoid function” , “ hyperbolic tangent function”등의 활성화 함수가 사용될 수 있다. 신경망 종류 Convolution neural network (CNN) CNN은 음성 인식이나 이미지 인식에서 주로 사용되는 신경망의 한 종류일 수 있으나, 이에 한정되는 것은 아니 다. CNN은 다차원 배열 데이터를 처리하도록 구성되어 있어, 컬러(color) 이미지와 같은 다차원 배열 처리에 특 화되어 있다. 따라서, 이미지 인식 분야에서 딥 러닝을 활용한 기법은 대부분 CNN을 기초로 수행될 수 있다. 일 예로, 일반 신경망의 경우, 이미지 데이터를 그대로 처리한다. 즉, 이미지 전체를 하나의 데이터로 생각해서 입 력으로 받아들이기 때문에, 이미지의 특성을 찾지 못하고 위와 같이 이미지의 위치가 조금만 달라지거나 왜곡된 경우에 올바른 성능을 내지 않을 수 있다. 그러나, CNN은 이미지를 하나의 데이터가 아닌, 여러 개로 분할하여 처리할 수 있다. 상술한 바를 통해, CNN은 이미지가 왜곡되더라도 이미지의 부분적 특성을 추출할 수 있어 올바른 성능을 낼 수 있다. CNN은 하기 표 9와 같은 용어로 정의될 수 있다.[표 9]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "Recurrent neural network (RNN) 도 26은 본 개시에 적용 가능한 RNN에 기초한 학습 모델을 나타낸 도면이다. 도 26을 참조하면, RNN은 숨겨진 노드(hidden node)가 방향을 가진 엣지(edge)로 연결돼 순환구조를 이루는(directed cycle) 인공신경망의 한 종 류일 수 있다. 일 예로, RNN은 음성, 문자 등 순차적으로 등장하는 데이터 처리에 적합한 모델일 수 있다. RNN 은 시퀀스 길이에 관계없이 인풋과 아웃풋을 받아들일 수 있는 네트워크 구조이기 때문에 필요에 따라 다양하고 유연하게 구조를 만들 수 있다는 장점을 가지고 있다. 일 예로, 도 26에서 (t=1,2,…) 는 숨겨진 레이어 (hidden layer)이고, x는 입력, y는 아웃풋을 나타낼 수 있다. RNN은 관련 정보와 그 정보를 사용하는 지점 사 이 거리가 멀 경우 백프로파게이션을 수행하는 경우에 그라디언트가 점차 줄어 학습능력이 저하될 수 있으며, 이를 “vanishing gradient” 문제라고 한다. 일 예로, “Vanishing gradient” 문제를 해결하기 위해서 제안 된 구조가 LSTM(long-short term memory)와 GRU(gated recurrent unit)일 수 있다. 즉, RNN은 CNN과 비교하여 피드백이 존재하는 구조일 수 있다. Autoencoder 도 27은 본 개시에 적용 가능한 오토인코더를 나타낸 도면이다. 또한, 도 28 내지 도 30은 본 개시에 적용 가능 한 터보 오토인코더를 나타낸 도면이다. 도 27을 참조하면, 신경망을 통신 시스템(communication system)에 적 용하기 위한 다양한 시도가 수행되고 있다. 이때, 일 예로, 신경망을 물리 계층(physical layer)에 적용하려는 시도는 주로 수신단(receiver)의 특정 기능을 최적화하는 것에 중점을 둘 수 있다. 구체적인 일 예로, 채널 디 코더(channel decoder)를 신경망(neural network)으로 구성하는 경우, 채널 디코더의 성능이 향상될 수 있다. 또 다른 일 예로, 복수 개의 송수신 안테나를 가진 MIMO 시스템에서 MIMO 디텍터(MIMO detector)를 신경망으로 구현하는 경우, MIMO 시스템의 성능이 향상될 수 있다. 또 다른 일 예로, 오토인코더(autoencoder)방식이 적용될 수 있다. 이때, 오토인코더는 송신단(transmitter) 및 수신단(receiver) 모두를 신경망(neural network)로 구성하여 엔드-투-엔드(end-to-end) 관점에서 최적화를 수 행하여 성능 향상을 기하는 방식일 수 있으며, 도 27과 같이 구성될 수 있다. 하기에서는 상술한 바에 기초하여 본 개시의 구체적인 실시예를 서술한다. 상술한 바와 같이, 통신 시스템은 심 층 학습(Deep Learning) 기술에 기초하여 AI 및 머신러닝(Machine Learning)을 고려하여 동작할 수 있다. 구체적으로, 채널 코딩은 머신 러닝에 기초하여 수행될 수 있다. 일 예로, 5G 통신 시스템에서는 LDPC (Low Density Parity Check Code) 코딩 및 폴라 코딩(Polar Codding)의 채널 코딩 방식으로 기존 통신 시스템 대비 새로운 채널 코딩 방식이 도입되었다. 여기서, 기존 통신 시스템은 터보 코드(Turbo code)나 TBCC(Tail-Biting Convolutional Code)를 통해 채널 코딩을 수행하였으며, LDCP 코딩 및 폴라 코딩은 상술한 코딩 방식보다 우수 한 성능을 가질 수 있었다. 다만, 상술한 코딩 방법들이 개발 및 표준에 반영되는 경우, 코딩 방법들은 AWGN(additive white gaussian noise) 채널에 최적화되어 설계될 수 있다. 일 예로, 통신에서 채널에 최적화되 지 않은 코딩 기법을 사용할 경우, 전송 오류가 발생할 확률일 높을 수 있다. 통신 시스템은 이를 정정하기 위 해 재전송(e.g. HARQ, ARQ)을 수행해야 할 수 있다. 여기서, 기지국이 재전송을 수행하는 경우, 기지국은 재전송을 위해 재전송할 데이터를 저장해야 할 수 있다. 또한, 기지국으로부터 데이터를 수신하는 단말은 먼저 수신한 데이터를 재전송된 데이터와 컴바이닝(combinin g)하기 위해 먼저 수신된 데이터를 저장해야 할 수 있다. 이를 위해, 단말 및 기지국은 메모리(memory)를 구비 해야 할 수 있다. 또한, 일 예로, 오류가 발생한 데이터의 재전송을 수행하는 경우, 통신 시스템의 스루풋(throughput)은 떨어질 수 있다. 또한, 데이터 재전송을 수행하는 경우, 자원은 재전송에 기초하여 낭비될 수 있다. 상술한 점을 고려 하여, 통신 시스템은 링크 환경에 맞은 인코더/디코더(encoder/decoder)에 기초하여 통신을 수행하여 전송 오류 발생확률을 낮추고, 재전송율 및 턴-어라운드 딜레이(Turn-around delay)를 줄일 수 있다. 하기에서는 상술한 점을 고려하여 오토 인코더(Auto Encoder, AE) 구조(Architecture)에 기초하여 동작하는 장 치가 채널 환경을 고려하여 통신을 수행하는 방법에 대해 서술한다. 여기서, 상술한 바와 같이, 오토 인코더에 기초하여 동작하는 경우, 송신단 및 수신단 각각은 신경망을 포함할 수 있다. 이때, 송신단 및 수신단은 채널 환경을 포함하여 최적의 통신 환경 및 코딩 기법을 학습할 수 있다. 오토 인코더는 학습을 통해 획득한 정보를 이용하여 인코딩 및 디코딩을 수행할 수 있다. 구체적으로, 송신단 및 수신단 모두 신경망을 포함할 수 있으며, 인코딩 및 디코딩은 페어로서 함께 고려될 수 있으며, 이를 통해 코딩이 수행되어 데이터가 전송될 수 있다. 여기서, 일 예로, 오토 인코더 구조를 가진 장치는 각각 단말 및 기지국일 수 있다. 즉, 오토 인코더 구조를 가 진 단말과 오토 인코더를 가진 기지국의 통신에서 채널 환경을 고려할 수 있다. 또한, 일 예로, 오토 인코더 구 조를 가진 단말과 오토 인코더를 가진 단말의 통신에서 채널 환경을 고려할 수 있다. 일 예로, 도 28은 본 개시에 적용 가능한 오토 인코더를 이용한 통신 체인을 나타낸 도면이다. 도 28을 참조하 면, 데이터는 오토 인코더에 기초하여 인코딩되어 송신단으로부터 수신단으로 전달될 수 있다. 그 후, 인코딩된 데이터는 수신단에서 오토 인코더에 기초하여 디코딩될 수 있다. 여기서, 데이터는 채널 환경을 고려하여 오토 인코더에 의해 인코딩될 수 있으며, 이는 상술한 바와 같다. 일 예로, 오토 인코더는 “Under-complete AE” 및 “Over-complete AE” 구조 중 어느 하나에 기초하여 동작 할 수 있다. 여기서, 도 28을 참조하면, 데이터는 U이고, 인코딩된 데이터는 X, 채널을 통해 전송된 인코딩 데 이터는 Y 및 디코딩된 데이터는 일 수 있다. 일 예로, “Under-complete AE”는 오토 인코더에 기초하여 인코딩된 X가 실제 데이터인 U보다 작은 양으로 표현된 경우일 수 있다. 여기서, 오토 인코더는 특징 압축/추출 (Feature compression/extraction) 기술을 사용할 수 있으나, 이에 한정되는 것은 아니다. 반면, “Over-complete AE”는 인코딩된 X가 실제 데이터인 U보다 많은 양으로 표현된 경우일 수 있다. 즉, 데 이터에 리던덴시(redundancy)를 추가하는 방법일 수 있다. 일 예로, 오토 인코더는 채널 코딩처럼 패리티 (Parity)를 추가하는 기술을 사용할 수 있으나, 이에 한정되는 것은 아니다. 하기에서는 “Over-complete AE”에 기초하여 동작하는 오토 인코더에 대해 서술한다. 일 예로, “Over- complete AE”에 기초하여 동작하는 오토 인코더의 경우, 코드 레이트(Code-Rate, R)는 리던덴시(Redundancy) 양을 조절할 수 있다. 즉, 상술한 도 28에서 X의 크기는 (U의 크기)/R이 될 수 있다. 또한, 코드 레이트 R은 하 기 수학식 12와 같을 수 있다. [수학식 12]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "여기서, k= |U|(=size of U)일 수 있고, n = |X|(=size of X)일 수 있다. 즉, k는 데이터의 크기이고, n은 인 코딩된 데이터의 크기일 수 있다. 일 에로, 데이터 U 정보는 인코더를 통해서 코드 레이트(R)에 반비례하는 양으로 인코딩(Over-complete)될 수 있다. 또한, 디코더는 동일한 방식에 기초하여 원래의 데이터 U 정보를 복원 할 수 있다. 일 예로, 오토 인코더를 사용하는 경우, 통신 시스템은 연결(connection) 환경 또는 상황을 고려하여 최적화된 통신 체인을 형성할 수 있다. 즉, 통신 시스템은 단말 능력(UE capability)이나 채널 특성을 고려하여 최적의 통신 채널(communication chain)을 오토 인코더를 통해 만들 수 있다. 상술한 바에 기초하여 오토 인코더가 동 작하는 경우, 통신 시스템은 더 적은 자원으로 더 짧은 시간에 통신을 수행할 수 있다. 일 예로, 대용량 전송 (e.g. Tera-bps communication)의 경우, 송신단과 수신단은 초기 연결에 시간이 걸리더라도 최적의 통신환경에 통신을 수행하여 재전송 확률을 줄일 수 있다. 송신단 및 수신단이 오토 인코더에 기초하여 통신을 수행하는 경우라도 전송 오류가 발생할 수 있다. 즉, 송신 단 및 수신단 모두 신경망에 기초하여 학습을 수행하고, 이에 기초한 데이터 전송이 수행될 수 있으며 이 과정 에서 전송 오류가 발생할 수 있다. 따라서, 송신단은 수신단으로 데이터 재전송을 수행할 필요성이 있다. 여기 서, 송신단 및 수신단 모두 오토 인코더에 기초하여 전송을 수행하므로 기존과 다르게 오토 인코더를 고려한 재 전송 방법이 필요할 수 있으며, 하기에서는 이에 대해 서술한다. 일 예로, 송신단이 전송한 데이터에 대한 오류가 발생한 경우, 송신단은 초기 전송 데이터를 다시 전송할 수 있 다.(Repetition) 또 다른 일 예로, 송신단이 전송한 데이터에 오류가 발생한 경우, 송신단은 리던던시 증가 (Incremental Redundancy, IR)에 기초하여 초기 전송과 다른 새로운 데이터를 수신단으로 전송할 수 있다. 여기 서, 수신단은 초기 전송에서 수신된 신호와 재전송에서 수신한 신호를 함께 디코딩함으로써 코딩 레이트를 낮추 어 코인 게인(coding gain)을 확보할 수 있으며, 이를 통해 디코딩 확률을 높일 수 있다. 일 예로, 도 29는 본 개시가 적용 가능한 LDPC 코드에서 IR을 지원하는 방법을 나타낸 도면이다. 일 예로, 도 29를 참조하면, LDPC에서 IR를 지원하기 위해 H1(mother matrix)의 커널 매트릭스가 설계될 수 있다. 여기서, H1는 k 정보(k information) 사이즈를 갖고, H1에 적용되는 패티리(parity)는 M1일 수 있다. 일 예로, 송신단 이 초기 전송을 수행하는 경우, 송신단은 LDPC 코드에 기초하여 데이터와 H1에 기초하여 M1을 생성할 수 있다. 그 후, H2(extended)는 row-by-row로 증가시키면서 설계될 수 있다. 즉, 송신단이 재전송을 수행하는 경우, 송 신단은 LDPC 코드에 기초하여 데이터와 k 정보 및 M1 사이즈에 기초하여 패리티 M2를 생성할 수 있다. 일 예로, 15행(row)를 설계하는 경우, 1 내지 14행까지 설계된 H를 유지하면서 새로운 하나의 행(one-row)가 추가될 수 있다. 즉, LDPC에서 IR를 지원하기 위한 설계는 네스티(nested) 구조에 기초하여 설계될 수 있다. 수신단은 상 술한 바에 기초하여 전송되는 초기 전송 데이터와 재전송 데이터를 결합하여 디코딩을 수행할 수 있다. 여기서, 도 29를 참조하면, 송신단은 초기 전송에서 X1을 전송할 수 있다. 여기서, X1은 [U, P1]일 수 있다. 또 한, 송신단은 재전송에서 X2를 전송할 수 있으며, X2는 [P2]일 수 있다. 이때, 수신단은 상술한 바와 같이 초기 전송에서 수신한 X1 및 재전송에서 수신한 X2를 모두 이용하여 디코딩을 수행할 수 있다. 하기에서는 상술한 바에 기초하여 오토 인코도 신경망(Autoencoder- neural network, AE-NN) 구조에서 재전송을 수행하는 방법에 대해 서술한다. 일 예로, AE-NN에 기초하여 데이터를 전송하는 경우, 송신단은 초기 전송 및 재전송을 수행할 수 있다. 이때, 재전송 데이터의 일부 또는 전체는 초기 전송과 상이한 새로운 데이터일 수 있 다. 또한, 수신단은 초기 전송에서 수신된 데이터 및 재전송에서 수신된 데이터를 모두 이용하여 데이터 디코딩 을 수행할 수 있다. 다만, AE-NN 구조에 기초하여 데이터 전송이 수행되므로 송신단 및 수신단은 신경망에 의해 학습된 웨이트를 고려하여 전송을 수행할 수 있으며, 재전송도 상술한 동작을 고려하여 수행될 필요성이 있다. 일 예로, 도 30 및 31은 본 개시가 적용 가능한 신경망에서 HARQ 기법을 적용하는 방법을 나타낸 도면이다. 도 30을 참조하면, AE-NN에 기초하여 데이터 전송이 수행되는 경우, 재전송은 웨이트 증가(Incremental weight, IW) 기법에 기초하여 수행될 수 있다. 구체적으로, 웨이트는 수직(vertical)으로 증가되어 학습될 수 있다. 여 기서, 일 예로, LDPC의 경우에는 기존 패리티를 이용하여 재전송을 고려한 패리티를 생성할 수 있다. 반면, IW 기법에 기초하여 재전송 웨이트를 학습하는 경우, 기존 웨이트를 이용하지 않고 재전송을 위한 웨이트를 학습할 수 있다. 즉, 기존 웨이트는 고정된 상태에서 재전송을 위한 웨이트가 학습될 수 있다. 구체적인 일 예로, AE-NN에 기초하여 데이터 전송이 수행되는 경우, 신경망(neural network)은 데이터 전송과 관련된 웨이트 값을 결정하고, 이에 기초하여 채널 코딩을 수행할 수 있다. 도 30을 참조하면, Wm은 커널 신경 망(kernel NN)의 웨이트일 수 있다. 여기서, Wm은 초기 전송에 이용되는 웨이트이고, We는 재전송에 이용되는 웨이트일 수 있다. 이때, We는 Wm으로부터 확장된(extended) 웨이트일 수 있으며, We는 Wm을 고정시키고 학습되 는 웨이트일 수 있다. 이때, We는 Wm을 고정시킨 상태에서 학습될 수 있으므로, 재전송 신호인 X1를 생성하기위해 X0를 이용하지 않을 수 있다. 일예로, 전체 W 및 We는 하기 수학식 13과 같을 수 있다. 또한, 초기 전송 및 재전송의 신호는 수학식 14와 같을 수 있다. [수학식 13]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "[수학식 14]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "구체적으로, 도 31(a)를 참조하면, 송신단은 신경망에 기초하여 데이터에 웨이트 Wm을 적용하여 인코딩된 데이 터가 X0일 수 있고, X0는 채널을 통해 수신단으로 전송할 수 있다. XO는 채널을 통해 Y0 신호로 수신단에 전달 될 수 있다. 여기서, 수신단도 송신단과 페어(pair)로 된 신경망을 구성할 수 있다. 따라서, 수신단은 Y0 신호 를 Wm에 대응되는 Hm을 통해 디코딩하고, 이에 기초하여 데이터를 추정하여 복원할 수 있다. 여기서, 수신단에 서 전송 오류가 발생하여 재전송이 수행되는 경우, 송신단의 신경망은 학습을 통해 웨이트를 생성할 수 있다. 여기서, 일 예로, 송신단의 신경망은 수신단이 디코딩을 성공하여 새롭게 발생한 데이터를 전송하는 경우라면 웨이트를 새롭게 학습할 수 있다. 다만, 전송 오류에 기초하여 데이터 재전송을 수행하는 경우에는 초기 전송 데이터를 고려해야 하므로 송신단의 신경망은 초기 전송 웨이트를 고정시키고(즉, 변경하지 않고), 추가하고자 하는 웨이트만을 학습하여 새로운 웨이트를 도출할 수 있다. 즉, 재전송에서 사용되는 웨이트는 Wm를 고정시키 고 전 단계로부터 확장된 웨이트 We1으로 결정될 수 있다. 구체적인 일 예로, 도 31(b)를 참조하면, 데이터 재 전송을 위해 확장되는 웨이트인 We1이 학습되고, 수신단에도 He1이 추가로 설계될 수 있다. 송신단은 We1을 이 용한 X1 신호를 재전송 데이터로 수신단에 전송할 수 있다. 여기서, 채널을 거친 X1 신호는 수신단에서 Y1으로 수신될 수 있다. 이때, 수신단은 초기 전송에서 수신한 Y0와 Y1을 함께 이용하여 데이터 디코딩을 수행할 수 있 으며, 이를 통해 코딩 게인이 증가할 수 있다. 상술한 점을 고려하여, 신경망에 기초하여 학습을 수행하는 경우, Wm 및 Hm을 고정시키고, We1 및 He1에 대한 학습을 수행할 수 있다. 일 예로, Wm 및 Hm을 고정시키지 않은 상태에서 We1 및 He1에 대한 학습을 수행하는 경우, Wm 및 Hm이 변경될 수 있으며 이에 따라, 수신단은 Y1을 디코딩하면서 Y0를 이용하지 못할 수 있다. 또 다른 일 예로, Wm 및 Hm을 고정시키지 않은 경우, 신경망 학습을 통해 We1 및 He1이 Wm 및 Hm과 동일하게 학습될 수 있다. 이러한 경우에 는 데이터가 반복 전송(repetition) 되는 경우와 동일할 수 있어 코딩 게인이 증가하지 않을 수 있다. 상술한 점을 고려하여, We1 및 He1에 대한 학습을 수행하는 경우, 송신단 및 수신단은 Wm 및 Hm을 고정시킨 상태에서 학습을 수행할 수 있다. 여기서, 수신단은 We1에 대응되는 Y1 신호를 He1을 통해 디코딩하고, 초기 전송에서 수신한 Y0을 Y1과 함께 이 용하여 데이터를 추정하여 복원할 수 있다. 또한, 두 번째 재전송이 수행되는 경우, 두 번째 재전송 데이터는 초기 전송 및 재 전송 데이터를 모두 고려해 야 할 수 있으므로, 송신단의 신경망은 초기 전송 웨이트 및 재전송 웨이트를 고정시키고(즉, 변경하지 않고), 추가하고자 하는 웨이트만을 학습하여 새로운 웨이트를 도출할 수 있다. 즉, 재전송에서 사용되는 웨이트는 Wm/Hm 및 We1/He1를 고정시키고 전 단계로부터 확장된 웨이트 We2 및 He2로서 학습될 수 있다. 구체적인 일 예 로, 도 31(c)를 참조하면, 데이터 재전송을 위해 확장되는 웨이트인 We2가 학습되고, 수신단에도 He2이 추가로 설계될 수 있다. 송신단은 We2를 이용한 X2 신호를 재전송 데이터로 수신단에 전송할 수 있다. 여기서, 채널을 거친 X2 신호는 수신단에서 Y2로 수신될 수 있다. 수신단은 We2에 대응되는 Y2 신호를 He2을 통해 디코딩할 수 있다. 여기서, 수신단은 이전 전송된 Y0 및 Y1를 Y2와 함께 이용하여 데이터를 추정하여 복원할 수 있다. 따라서, 초기 전송시 송신단은 X0를 전송하고, 수신단은 Y0로 디코딩을 수행할 수 있다. 초기 전송 오류에 기초 한 첫 번째 재전송시 송신단은 X1을 전송하고, 수신단은 [Y0, Y1]으로 데이터 복원을 수행할 수 있다. 또한, 첫 번째 재전송 오류에 기초한 두 번째 재전송시 송신단은 X2를 전송하고, 수신단은 [Y0, Y1, Y2]으로 데이터 복원 을 수행할 수 있다. 즉, 송신단 및 수신단은 재전송을 수행하는 경우에 기존 웨이트를 고정시키고 추가하고자 하는 웨이트만을 학습 을 통해 획득할 수 있다. 일 예로, 새로운 We/He의 학습시 이전 단계 웨이트가 바뀌게 되면 HARQ 동작에서 수신 단은 첫 번째 또는 그 전에 전송된 데이터를 사용할 수 없게 된다. 상술한 점을 고려하여, 송신단 및 수신단은 기존 웨이트를 고정시키고 확정되는 웨이트만을 학습하여 재전송에 대한 웨이트를 결정할 수 있으며, 이는 상술한 바와 같다. 도 32는 본 개시가 적용 가능한 레이어 증가 기법에 기초하여 HARQ 피드백을 지원하는 방법을 나타낸 도면이다. 도 32를 참조하면, 레이어 증가(Incremental Layer, IL) 기법에 기초하여 HARQ 피드백을 지원할 수 있다. 여기 서, 레이어는 신경망(Neural Network)의 레이어일 수 있으며, 레이어는 다른 신경망의 출력을 입력으로 받을 수 있다. 송신단은 재전송시 이전 레이어를 고려하여 재전송을 수행할 수 있다. 보다 상세하게는, 송신단이 초기 전송을 수행한은 경우, 송신단은 제1 송신단 레이어를 통해 데이터를 전송할 수 있다. 이때, 제 1 송신단 레이어는 학습을 통해 커널 웨이트(kernel weight, Wm)를 적용하여 데이터를 전송 을 수행하는 레이어일 수 있다. 여기서, 송신단은 데이터인 U를 Wm을 통해 X0 신호를 전송할 수 있으며, X0는 하기 수학식 15와 같을 수 있다. X0 신호는 채널을 통해 수신단으로 전송될 수 있다. X0 신호는 채널을 거쳐 Y0 신호로 수신단에 수신될 수 있다. 수신단은 제 1 송신단 레이어의 Wm에 대응되는 제 1 수신단 레이어의 Hm을 통 해 수신한 Y0 신호에 대한 디코딩을 수행할 수 있다. [수학식 15]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "여기서, 초기 전송이 실패한 경우, 송신단은 제 2 송신단 레이어를 통해 재전송을 수행할 수 있다. 여기서, 제 2 송신단 레이어는 We1를 적용하여 데이터 전송을 수행할 수 있다. 이때, We1은 상술한 바와 같이 Wm을 고정시 키고(즉, 변경하지 않고) 증가적(Incremental)으로 학습이 수행될 수 있다. 또한, We1에 대응되는 수신단의 He1 도 Hm이 고정된 상태에서 증가적으로 학습이 수행될 수 있다. 여기서, 송신단이 제 2 송신단 레이어를 통해 재 전송을 수행하는 경우, 재전송 신호 X1은 하기 수학식 16에 기초하여 생성될 수 있다. 즉, 제 2 송신단 레이어 는 데이터인 u와 제 1 송신단 레이어의 출력인 X0를 입력으로 하여 We1을 통해 X1 신호를 생성할 수 있다. X1 신호는 채널을 통해 수신단으로 전송될 수 있다. X1 신호는 채널을 거쳐 Y1 신호로 수신단에 수신될 수 있다. 수신단은 제 2 송신단 레이어의 We1에 대응되는 제 2 수신단 레이어의 He1을 통해 수신한 신호에 대한 디코딩을 수행할 수 있다. 여기서, 제 2 수신단 레이어의 He1은 초기 수신 신호인 Y0 신호 및 재전송 신호인 Y1 신호를 입력을 하는 레이어일 수 있으며, 이에 기초하여 디코딩을 진행할 수 있다. [수학식 16]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "또한, 일 예로, 초기 전송 및 상술한 첫 번째 재전송이 실패한 경우, 송신단은 제 3 송신단 레이어를 통해 재전 송을 수행할 수 있다. 여기서, 제 3 송신단 레이어는 We2를 적용하여 데이터 전송을 수행할 수 있다. 이때, We2 는 상술한 바와 같이 Wm 및 We1을 고정시키고(즉, 변경하지 않고) 증가적(Incremental)으로 학습이 수행될 수 있다. 또한, We2에 대응되는 수신단의 He2도 Hm 및 He1이 고정된 상태에서 증가적으로 학습이 수행될 수 있다. 여기서, 송신단이 제 3 송신단 레이어를 통해 재전송을 수행하는 경우, 재전송 신호 X2는 하기 수학식 17에 기 초하여 생성될 수 있다. 즉, 제 3 송신단 레이어는 데이터인 u와 제 1 송신단 레이어의 출력인 X0 및 제 2 송신 단 레이어의 출력인 X1을 입력으로 하여 We2을 통해 X2 신호를 생성할 수 있다. X2 신호는 채널을 통해 수신단 으로 전송될 수 있다. X2 신호는 채널을 거쳐 Y2 신호로 수신단에 수신될 수 있다. 수신단은 제 3 송신단 레이 어의 We2에 대응되는 제 3 수신단 레이어의 He2을 통해 수신한 신호에 대한 디코딩을 수행할 수 있다. 여기서, 제 3 수신단 레이어의 He2는 초기 수신 신호인 Y0 신호 및 첫 번째 재전송 신호인 Y1 신호 및 두 번째 재전송 신호인 Y2 신호를 입력을 하는 레이어일 수 있으며, 이에 기초하여 디코딩을 진행할 수 있다. [수학식 17]"}
{"patent_id": "10-2023-7011981", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "또한, 일 예로, 추가적인 재전송에서도 상술한 방법에 기초하여 재전송이 수행될 수 있으며, 상술한 실시예로 한정되지 않는다. 여기서, 수신단은 Hm, He1 및 He2의 출력을 Hz에 적용하여 데이터 U를 획득할 수 있다. 즉, 수신단은 초기 전송 및 재전송들에 대한 레이어의 출력 값을 모두 이용하여 데이터 복원을 수행할 수 있으며, 이를 통해 데이터 복원 성능을 향상시킬 수 있다. 도 33은 본 개시가 적용 가능한 펑처링 웨이트 기법을 적용하여 HARQ 피드백을 지원하는 방법을 나타낸 도면이 다. 도 33을 참조하면, 송신단은 펑처링(Puncturing Weights) 기법에 기초하여 웨이트를 설계하고, 이에 기초하여 HARQ 피드백을 지원할 수 있다. 보다 상세하게는, 펑처링 기법은 상술한 바와 같이 증가적(Incremental)으로 웨이트를 설계하지 않고, 최고 레 이트를 위한 웨이트를 신경망(Neural network)을 통해 동시에 학습하여 결정하는 방법일 수 있다. 여기서, 초기 전송에 요구되는 X0 신호는 신경망을 통해 학습된 웨이트들 중 일부만을 적용하고 나머지는 펑처링될 수 있다. 또한, 첫 번째 재전송에서 전송되는 신호 X1은 초기 전송에서 펑처링된 웨이트들의 일부를 이용하여 생성될 수 있다. 또한, 두 번째 재전송에서 전송되는 신호 X2는 초기 전송 및 첫 번째 재전송에서 펑처링된 웨이트들의 일 부를 이용하여 생성될 수 있다. 상술한 바와 같이 펑처링 웨이트 기법에 기초하여 HARQ 피드백을 지원하는 경우, 초기 설계시 최소 레이트에 대한 학습을 수행하므로 높은 레이트(Higher rate)에서 성능을 확보하기 위한 웨이트 펑처링 오더(Weights Puncturing Order)를 결정할 수 있다. 일 예로, 펑처링 웨이트를 적용하는 경우, 성능에 가장 영향이 적은 웨이트들에 기초하여 펑처링 순서가 정해질 수 있다. 또한, 일 예로, 펑처링 웨이트를 적용하는 경우, 웨이트 값이 가장 적은 값을 가지는 웨이트들에 기초하여 펑처링 순서가 정해질 수 있다. 구체적인 일 예로, 도 33을 참조하면, 송신단은 신경망을 통해 학습을 수행하여 웨이트들을 결정할 수 있다. 여 기서, 초기 전송에서는 W를 제외한 나머지 웨이트들은 펑처링될 수 있다. 송신단은 W를 이용하여 X0 신호를 생 성하여 채널을 통해 수신단으로 전송할 수 있다. 수신단은 W에 대응되는 Hm을 통해 데이터 디코딩을 수행할 수 있다. 여기서, 초기 전송이 실패한 경우, 송신단은 학습한 웨이트 중 펑처링 되었던 웨이트들(즉, W 제외) 중 일부 웨이트로 P1을 통해 X1 신호를 생성하여 채널을 통해 수신단으로 전송할 수 있다. 수신단은 P1에 대응되는 He1을 통해 데이터 디코딩을 수행할 수 있다. 여기서, 수신단은 Hm의 출력 값 및 He1의 출력 값을 입력으로 하 는 Hz를 통해 최종 데이터에 대한 디코딩을 수행할 수 있다. 즉, 수신단은 초기 전송 및 재전송을 모두 이용할 수 있다. 여기서, 재전송도 실패한 경우, 송신단은 학습한 웨이트 중 펑처링되었던 웨이트들(즉, W, P1 제외) 중 일부 웨 이트로 P2을 통해 X2 신호를 생성하여 채널을 통해 수신단으로 전송할 수 있다. 수신단은 P2에 대응되는 He2를 통해 데이터 디코딩을 수행할 수 있다. 여기서, 수신단은 Hm의 출력 값, He1의 출력 값 및 He2의 출력 값을 입 력으로 하는 Hz를 통해 최종 데이터에 대한 디코딩을 수행할 수 있다. 즉, 수신단은 초기 전송, 첫 번째 재전송 및 두 번째 재전송을 모두 이용할 수 있다. 도 34는 본 개시가 적용 가능한 채널을 증가하는 기법에 기초하여 HARQ 피드백을 지원하는 방법을 나타낸 도면 이다. 도 34를 참조하면, 신경망이 상술한 합성곱 신경망(Convolution Neural Network, CNN)인 경우에 HARQ 피드백을 지원하는 경우를 고려할 수 있다. 일 예로, CNN에서 송신단의 출력 채널들(Output channels)를 이용해서 코드 레이트를 낮출 수 있다. CNN에서 출력 채널의 수는 CNN 필터의 수에 기초하여 결정될 수 있다. 일 예로, 도 34 를 참조하면, 송신단의 출력 필터의 수는 3일 수 있다. 여기서, 출력 필터 w0, w1 및 w2를 설계하는 경우, 학습 은 상술한 증가적 웨이트 기법(IW)과 유사하게 수행될 수 있다. 즉, 신경망은 w0를 먼저 학습할 수 있다. 이때, w1 및 w2의 연결은 없을 수 있다. 그 후, 송신단은 채널(또는 필터)를 증가시키면서 학습을 수행할 수 있으며, CNN으로 구성되므로 IW 기법과 유사하게 학습이 수행될 수 있 다. 구체적으로, 신경망은 w0 및 h0를 학습할 수 있다. 또한, 증가적 기법에 기초하여 w1 및 h1을 학습하는 경우, w0 및 h0를 학습된 값으로 고정할 수 있다. 또한, W2 및 h2를 학습하는 경우, w0/h0 및 w1/h1을 학습된 값으로 고정할 수 있다. 즉, 증가적으로 학습이 수행될 수 있으며, 수신단의 Hz는 각 단계이 전송에서 사용된 출력을 합쳐서 데이터 디코딩을 수행할 수 있다. 또 다른 일 예로, 송신단은 상술한 바와 같이 CNN에 기초하여 채널(또는 필터)에 대한 학습을 수행하고, 수신단 은 CNN이 아닌 일반 신경망으로 구성하는 것도 가능할 수 있으며, 상술한 실시예로 한정되지 않는다. 또 다른 일 예로, 펑처링 웨이트 기법과 유사하게 펑처링 채널(Puncturing Channels) 기법이 적용될 수 있다. 여기서, 모든 채널의 출력을 위한 채널(또는 필터)들을 동시에 설계하고, 실제 전송에서 사용시, 필요한 채널(또는 필터)만을 사용하고 나머지는 펑처링할 수 있으며, 상술한 실시예로 한정되지 않는다. 또 다른 일 예로, 송신단은 하이브리드(Hybrid) 방식으로 IR 기법 및 펑처링 기법을 결합하여 HARQ 피드백을 지 원할 수 있다. 일 예로, 신경망을 통해 설계되는 웨이트들 또는 레이어는 그룹을 구성할 수 있다. 즉, 복수 개 의 웨이트들 또는 복수 개의 레이어들은 하나의 그룹으로 형성될 수 있다. 여기서, 신경망은 그룹 단위로 증가 적(Incremental)으로 학습을 수행할 수 있다. 구체적인 일 예로, 신경망에서 웨이트들을 row-by-row로 학습하는 경우, 학습 시간이 길어질 수 있어 지연이 발 생할 수 있다. 상술한 점을 고려하여 신경망은 웨이트들 또는 레이어들은 그룹핑되어 학습될 수 있다. 여기서, 그룹 내에 포함된 복수 개의 웨이트들 또는 레이어들 중에서 일부 웨이트들 또는 레이어들은 펑처링 기법에 기 초하여 일부만 사용될 수 있으며, 이를 통해 성능을 확보하면서 지연을 방지할 수 있다. 또한, 다중 신경망에 기초하여 HARQ 피드백을 지원할 수 있다. 일 예로, 도 35를 참조하면, 상술한 HARQ 피드백 을 지원하는 네트워크는 복수 개의 네트워크(multiple network)로 확정될 수 있다. 즉, 상술한 IL 기법(즉, 레 이어 증가 기법)은 증가되는 레이어가 하나가 아니라 복수 개의 레이어일 수 있다. 즉, 다중 신경망에 기초하여 복수 개의 네트워크에 기초하여 증가적으로 학습되는 것도 가능하며 상술한 실시예로 한정되지 않는다. 도 36은 본 개시에 적용 가능한 HARQ 피드백을 지원하는 방법을 나타낸 도면이다. 도 36을 참조하면, 신경망을 학습된 웨이트 구조는 송신단 및 수신단 모두 인지할 필요성이 있다. 즉, 송신단에 서 적용된 웨이트 구조를 수신단이 인지하고 있어야 이를 이용한 데이터 디코딩이 수행될 수 있다. 따라서, 송 신단 및 수신단의 학습이 수행되는 방법이 고려될 필요성이 있으며, 학습 방법에 따라 오프라인 학습(Off-line training) 및 온라인 학습(On-line training)으로 구별할 수 있다. 일 예로, 오프라인 학습은 송신단의 네트워 크 구조(e.g. 웨이트들, 레이어 수, 노드 수, 활성화 함수 등)를 표준화하고, 이에 기초하여 학습을 수행하는 방법일 수 있다. 또한, 온라인 학습은 학습 결과를 학습을 수행한 주체가 상대방에게 전달하는 방식일 수 있다. 즉, 송신단이 학 습을 수행한 경우, 송신단은 학습된 정보로서 네트워크 구조 및 대응 값을 수신단으로 전달할 수 있다. 반대로, 수신단이 학습을 수행한 경우, 수신단은 학습된 정보로서 네트워크 구조 및 대응 값을 송신단으로 전달할 수 있 다. 일 예로, 송신단 및 수신단은 PDCCH(Physical Downlink Control Channel)이나 PUCCH(Physical Uplink Control Channel)을 통해 상술한 정보를 교환할 수 있다. 또 다른 일 예로, 송신단 및 수신단은 상위 레이어 시 그널링을 통해 상술한 정보를 교환할 수 있으며, 상술한 실시예로 한정되지 않는다. 구체적인 일 예로, 도 36은 송신단이 단말이고, 수신단이 기지국인 경우를 고려할 수 있다. 여기서, 단말이 데 이터 전송을 수행하는 경우, 기지국은 데이터 전송을 위해 필요한 정보를 시그널링 할 수 있다. 일 예로, 기지 국은 전송 또는 재전송에서 웨이트들(또는 레이어들)의 어느 부분을 얼마만큼 사용할지 여부를 시그널링을 통해 단말로 지시할 수 있다. 일 예로, 기지국은 PDCCH을 통해 상술한 정보를 지시할 수 있다. 여기서, 기지국은 웨 이트 벡터(Weights vector)중에서 웨이트의 시작 위치(Start of weights) 및 웨이트의 길이(Length of weight, 또는 Length of transmission) 정보 중 적어도 어느 하나 이상을 시그널링 할 수 있으며, 상술한 실시예로 한정 되지 않는다. 또 다른 일 예로, 초기 전송 및 재전송과 관련된 웨이트에 대한 정보를 단말과 기지국이 사전에 교환할 수 있 다. 여기서, 웨이트에 대한 정보에는 초기 전송 및 재전송과 관련된 웨이트에 대한 정보가 포함될 수 있다. 다 만, 웨이트에 대한 정보는 학습에 기초하여 결정된 웨이트일 수 있으나, 초기 전송 및 재전송을 위한 웨이트로 서 구별이 명확하지 않을 수 있다. 즉, 웨이트는 특정 주체 또는 오프라인을 통해 학습된 전체 웨이트에 대한 정보일 수 있다. 일 예로, 상술한 바에 기초하여 단말과 기지국은 웨이트에 대한 정보를 사전에 공유하거나 상 위 레이어 시그널링을 통해 공유할 수 있으며, 상술한 실시예로 한정되지 않는다. 그 후, 기지국이 단말로 초기 전송을 수행하는 경우, 기지국은 DCI(Downlink Control Information)을 통해 초기 전송 웨이트에 대한 시작 위 치 정보 및 길이 정보 중 적어도 어느 하나를 지시할 수 있다. 단말은 DCI를 통해 지시된 웨이트에 대한 시작 위치 정보 및 길이 정보에 기초하여 초기 전송에 적용되는 기지국의 웨이트를 확인할 수 있다. 단말은 대응되는 웨이트를 통해 초기 전송에 대한 디코딩을 수행할 수 있다. 또한, 일 예로, 단말이 데이터 디코딩을 성공하면 ACK을 기지국으로 전송하고, 데이터 디코딩을 실패하면 NACK을 기지국으로 전송할 수 있다. 여기서, 기지국이 단말로부터 NACK을 수신한 경우 또는 단말로부터 응답 메시지를 수신하지 못한 경우, 기지국은 재전송을 수행할 수 있다. 이때, 기지국은 DCI를 통해 재전송을 위한 웨이트의 시작 위치 정보 및 길이 정보 중 적어도 하나를 단말로 지 시할 수 있다. 단말은 DCI를 통해 재전송에 대한 웨이트를 확인하고, 대응되는 웨이트를 통해 디코딩일 수행할 수 있다. 여기서, 단말은 초기 전송에서 수신한 신호 및 재전송에서 수신한 신호를 모두 이용하여 디코딩을 수 행할 수 있으며, 이는 상술한 바와 같다. 또 다른 일 예로, 기지국은 초기 전송시 DCI를 통해 웨이트에 대한 길이 정보만을 전송할 수 있다. 일 예로, 단 말은 초기 전송시 웨이트에 대한 시작 위치에 기초하여 웨이트에 대한 길이 정보를 이용하여 초기 전송에 대한 웨이트를 확인할 수 있다. 그 후, 단말은 재전송 웨이트를 확인하는 경우, 초기 전송과 동일한 길이를 갖는 웨 이트를 고려할 수 있다. 즉, 단말은 초기 전송 웨이트의 시작 위치로부터 길이 정보에 대응되는 웨이트부터 재 전송 웨이트가 동일한 길이만큼 할당된 것을 확인하고, 이에 기초하여 데이터 디코딩을 수행할 수 있다. 즉, 기지국은 웨이트에 대한 길이 정보만을 DCI를 통해 단말로 지시할 수 있다. 단말은 초기 전송 및 재전송에 서 웨이트에 길이는 동일한 것으로 간주하고, 초기 전송의 시작 위치에 기초하여 재전송 웨이트에 대한 위치 및 길이 정보를 확인할 수 있으나, 상술한 실시예로 한정되지 않는다. 또다른 일 예로, 단말이 기지국으로부터 수신하는 NACK이 최대 재전송 횟수를 넘어가는 경우, 단말은 인공 신 경망에 의해 학습되는 웨이트들을 리셋하고 이를 재설정할 수 있다. 일 예로, 단말은 인공 신경망에 의해 학습 된 웨이트들로 데이터 전송을 수행할 수 없으므로 상태를 천이하거나 인공 신경망에 의해 학습된 웨이트들을 리 셋하여 새롭게 설정하도록 할 수 있으며, 상술한 실시예로 한정되지 않는다. 도 37은 본 개시에 적용 가능한 HARQ 피드백 지원 방법을 나타낸 도면이다. 도 37를 참조하면, 송신단과 수신단은 HARQ 피드백을 위해 리던던시 버전(redundancy version, RV)를 설정할 수 있다. 일 예로, 송신단은 RV의 시작지점부터 필요한 크기만큼을 초기 전송으로 수행할 수 있다. 여기서, 초기 전송에 대응되는 RV 값 및 전송 길이는 시그널링 될 수 있다. 또한, 일 예로, 송신단은 출력 노드 수를 특정한 길이로 나누고, 각각의 전송은 RV 시작 번호와 길이를 시그널링 할 수 있으며, 상술한 실시예로 한정되지 않는 다. 구체적인 일 예로, 도 37에서 초기 전송은 RV0에 기초하여 수행되고, 두 번째 전송을 RV2에 기초하여 수행 될 수 있으며, 이를 통해 HARQ 피드백을 지원할 수 있다. 도 38은 본 개시에 적용 가능한 송신단 및 수신단 동작을 나타낸 도면이다. 상술한 바에 기초하여 동작하는 송신단 및 수신단에서 사용되는 활성화 함수(activation function)를 고려할 필 요성이 있다. 보다 상세하게는, 제로 입력/제로 출력(Zero-input/Zero-output, ZIZO) 활성화 함수는 수신단에서 전송되지 않는 노드에 대해서 입력을 제로 입력(또는 펑처링)으로 할당할 수 있다. 여기서, ZIZO가 아닌 활성화 함수를 사용하는 경우, 결과 값이 상이하게 나타날 수 있다. 일 예로, 도 38(a)는 활성화 함수로 sigmoid 함수 일 수 있다. 이때, sigmoid 함수를 사용하는 경우, 제로 입력에 대한 출력은 0.5일 수 있다. 즉, 제로 입력이지 만 제로 출력이 아닐 수 있다. 따라서, 사용하지 않는 노드만으로 구성된 신경망에서 두 개의 출력만으로 출력 이 1.0이 되어 신경망 결정에 영향을 미칠 수 있다. 상술한 점을 고려하여, ZIZO 활성화 함수를 사용하지 않는 경우, 머지 네트워크(merge network, HZ)의 입력을 조절할 필요성이 있다. 보다 상세하게는, 도 38(b)를 참조하면, Hz는 초기 전송에 의한 Hm의 출력을 입력으로 수신할 수 있다. 또한, Hz는 재전송에 대한 He1의 출력을 입력으로 수신할 수 있다. 여기서, 초기 전송에 대해 서는 재전송에 의한 Hz의 입력 값이 0이어야하지만 상술한 바처럼 ZIZO 활성화 함수가 아닌 경우에는 0이 아는 값이 Hz의 입력 값으로 반영될 수 있다. 상술한 점을 고려하여 멀티플렉싱을 통해 전송이 안되는 경우에는 “0 ”값을 설정하여 Hz의 입력 값으로 제공되지 않도록 할 수 있다. 또한, 멀티플렉싱을 통해 전송이 수행되는 경 우에는 “1”값을 설정하여 Hz의 입력 값으로 반영되도록 할 수 있으며, 이를 통해 ZIZO 활성화 함수를 사용하 지 않는 경우에도 동작하도록 할 수 있다. 즉, 학습은 ZIZO 활성화 함수에 기초하여 수행되거나, ZIZO 활성화 함수가 아닌 경우에는 상술한 바와 같이 Hz 입력 값을 조절할 수 있으며, 상술한 실시예로 한정되지 않는다. 또 다른 일 예로, 송신단은 반복 재전송을 수행할 수 있다. 일 예로, 상술한 바에서 송신단은 재전송시 새로운 데이터가 없는 경우, 송신단은 기존 데이터를 반복 전송할 수 있다. 즉, 수신단은 체이스 컴바이닝(chase combining)에 기초하여 동일한 데이터를 수신하여 디코딩을 수행할 수 있다. 도 39는 본 개시에 적용 가능한 단말 동작 방법을 나타낸 도면이다. 일 예로, 하기에서는 단말을 중심으로 서 술하지만 상술한 바와 같이 기지국 및 도 4 내지 도 9의 디바이스에 대해서도 동일하게 적용될 수 있다. 다만, 하기에서는 설명의 편의를 위해 단말을 중심으로 서술한다. 일 예로, 도 39를 참조하면, 단말이 데이터 전송을 수행하는 경우, 단말은 인공 신경망(Neural Network)을 통해 학습된 제 1 전송 웨이트가 적용된 데이터를 기지국으로 전송할 수 있다.(S3910) 여기서, 기지국은 단말이 전송 한 데이터에 대한 디코딩을 성공하면 ACK을 전송하고, 데이터에 대한 디코딩을 실패하면 NACK을 전송할 수 있다. 단말이 기지국으로부터 데이터 전송에 대한 NACK을 수신하는 경우(S3920), 단말은 데이터 재-전송을 수행 할 수 있다. 일 예로, 상술한 바와 같이, 단말이 데이터 재-전송을 수행하는 경우, 단말은 인공 신경망을 통해 학습된 제 2 전송 웨이트가 적용된 데이터를 기지국으로 전송할 수 있다.(S3930) 이때, 제 1 전송 웨이트 및 제 2 전송 웨이트는 웨이트 증가(Incremental Weight, IW) 방식에 기초하여 학습될 수 있다. 여기서, 제 2 전송 웨 이트는 IW 방식에 기초하여 제 1 전송 웨이트가 고정된 상태에서 인공 신경망에 의해 학습되는 추가 웨이트일 수 있다. 또한, 일 예로, 기지국은 제 1 전송 웨이트에 대응되는 제 1 수신 웨이트를 이용하여 제 1 전송 웨이 트가 적용된 데이터를 디코딩할 수 있다. 또한, 기지국은 제 2 전송 웨이트에 대응되는 제 2 수신 웨이트를 이 용하여 제 2 전송 웨이트가 적용된 데이터를 디코딩할 수 있다. 기지국은 재-전송 데이터를 수신하는 경우, 제 1 수신 웨이트를 이용하여 디코딩된 데이터 및 제 2 수신 웨이트를 이용하여 디코딩된 데이터를 모두 이용하여 데이터를 복원할 수 있으며, 이는 상술한 바와 같다. 또한, 기지국이 상술한 재-전송 데이터도 디코딩을 실패하는 경우, 기지국은 단말로 다시 NACK을 보낼 수 있다. 단말이 기지국으로부터 데이터 재-전송에 대한 NACK을 수신하는 경우, 단말은 인공 신경망을 통해 학습된 제 3 전송 웨이트가 적용된 데이터를 기지국으로 다시 전송할 수 있다. 여기서, 제 3 전송 웨이트는 제 1 전송 웨이 트 및 제 2 전송 웨이트가 고정된 상태에서 인공 신경망에 의해 학습되는 추가 웨이트일 수 있다. 또한, 기지국 은 제 3 전송 웨이트에 대응하는 제 3 수신 웨이트를 이용하여 제 3 전송 웨이트가 적용된 데이터를 디코딩할 수 있다. 기지국은 제 1 수신 웨이트를 이용하여 디코딩된 데이터, 제 2 수신 웨이트를 이용하여 디코딩된 데이 터및 제 3 수신 웨이트를 이용하여 디코딩된 데이터를 모두 이용하여 데이터를 복원할 수 있으며, 이는 상술한 바와 같다. 또한, 일 예로, 단말이 기지국으로부터 수신하는 NACK이 최대 재전송 횟수를 넘어가는 경우, 단말은 인공 신경 망에 의해 학습되는 웨이트들을 리셋하고 이를 재설정할 수 있으며, 상술한 실시예로 한정되지 않는다. 또 다른 일 예로, 제 1 전송 웨이트는 인공 신경망의 제 1 레이어에 대응되고, 제 2 전송 웨이트는 인공 신경망 의 제 2 레이어에 대응될 수 있다. 이때, 제 2 레이어는 데이터 및 제 1 전송 웨이트가 적용된 데이터를 입력으 로 받는 레이어일 수 있다. 즉, 인공 신경망에 기초하여 레이어가 증가되는 방식으로 학습이 수행될 수 있다. 또 다른 일 예로, 인공 신경망은 최소 레이트에 기초하여 단말에 적용되는 전송 웨이트들을 동시에 학습할 수 있다. 즉, 웨이트들에 대한 학습은 동시에 수행될 수 있다. 여기서, 단말이 데이터에 대한 초기 전송을 수행하 는 경우, 단말은 학습된 전송 웨이트들 중 제 1 전송 웨이트를 제외한 다른 웨이트들을 펑처링할 수 있다. 또한, 단말이 데이터에 대한 재-전송을 수행하는 경우, 단말은 제 1 전송 웨이트를 제외한 나머지 웨이트들에서 제 2 웨이트를 재-전송 데이터에 적용하고, 나머지 다른 웨이트들을 펑처링할 수 있다. 여기서, 일 예로, 인공 신경망이 최소 레이트에 기초하여 웨이트들을 동시에 학습하는 경우, 학습된 전송 웨이트들에 대한 펑처링 순서 가 결정될 수 있다. 일 예로, 펑처링 순서는 전송 웨이트 값에 대한 정보 및 전송 웨이트에 기초한 성능 정보 중 적어도 어느 하나에 기초하여 결정될 수 있다. 이때, 펑처링 순서는 전송 성능을 확보하기 위해 성능에 가장 영향이 적은 웨이트부터 펑처링이 수행될 수 있다. 또 다른 일 예로, 웨이트 값이 가장 적은 순서부터 펑처링될 수 있으며, 이는 상술한 바와 같다. 또 다른 일 예로, 단말은 기지국과 인공 신경망에 기초한 웨이트 관련 정보를 사전에 공유할 수 있다. 일 예로, 단말이 데이터 재-전송을 수행하는 경우, 단말은 기지국으로부터 DCI를 통해 데이터 재-전송에 대한 추가 웨이 트 정보를 지시 받을 수 있다. 여기서, 데이터 재-전송에 대한 추가 웨이트 정보는 웨이트 벡터 중 데이터 재- 전송에 대한 웨이트의 시작 위치 정보 및 데이터 재-전송에 대한 웨이트의 길이 정보 중 적어도 어느 하나에 대 한 정보를 포함할 수 있다. 상기 설명한 제안 방식에 대한 일례들 또한 본 개시의 구현 방법들 중 하나로 포함될 수 있으므로, 일종의 제안 방식들로 간주될 수 있음은 명백한 사실이다. 또한, 상기 설명한 제안 방식들은 독립적으로 구현될 수도 있지만, 일부 제안 방식들의 조합 (또는 병합) 형태로 구현될 수도 있다. 상기 제안 방법들의 적용 여부 정보 (또는 상기 제안 방법들의 규칙들에 대한 정보)는 기지국이 단말에게 사전에 정의된 시그널 (예: 물리 계층 시 그널 또는 상위 계층 시그널)을 통해서 알려주도록 규칙이 정의될 수 가 있다. 본 개시는 본 개시에서 서술하는 기술적 아이디어 및 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태 로 구체화될 수 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 개시의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 개시의등가적 범위 내에서의 모든 변경은 본 개시의 범위에 포함된다. 또한, 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시 예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함할 수 있 다. 산업상 이용가능성 본 개시의 실시 예들은 다양한 무선접속 시스템에 적용될 수 있다. 다양한 무선접속 시스템들의 일례로서, 3GPP(3rd Generation Partnership Project) 또는 3GPP2 시스템 등이 있다. 본 개시의 실시 예들은 상기 다양한 무선접속 시스템뿐 아니라, 상기 다양한 무선접속 시스템을 응용한 모든 기 술 분야에 적용될 수 있다. 나아가, 제안한 방법은 초고주파 대역을 이용하는 mmWave, THz 통신 시스템에도 적 용될 수 있다. 추가적으로, 본 개시의 실시예들은 자유 주행 차량, 드론 등 다양한 애플리케이션에도 적용될 수 있다."}
{"patent_id": "10-2023-7011981", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하에 첨부되는 도면들은 본 개시에 관한 이해를 돕기 위한 것으로, 상세한 설명과 함께 본 개시에 대한 실시 예들을 제공할 수 있다. 다만, 본 개시의 기술적 특징이 특정 도면에 한정되는 것은 아니며, 각 도면에서 개시 하는 특징들은 서로 조합되어 새로운 실시 예로 구성될 수 있다. 각 도면에서의 참조 번호(reference numeral s)들은 구조적 구성요소(structural elements)를 의미할 수 있다. 도 1은 본 개시에 적용 가능한 통신 시스템 예시를 나타낸 도면이다. 도 2는 본 개시에 적용 가능한 무선 기기의 예시를 나타낸 도면이다. 도 3은 본 개시에 적용 가능한 무선 기기의 다른 예시를 나타낸 도면이다. 도 4는 본 개시에 적용 가능한 휴대 기기의 예시를 나타낸 도면이다. 도 5는 본 개시에 적용 가능한 차량 또는 자율 주행 차량의 예시를 나타낸 도면이다. 도 6은 본 개시에 적용 가능한 이동체의 예시를 나타낸 도면이다. 도 7은 본 개시에 적용 가능한 XR 기기의 예시를 나타낸 도면이다. 도 8은 본 개시에 적용 가능한 로봇의 예시를 나타낸 도면이다. 도 9는 본 개시에 적용 가능한 AI(Artificial Intelligence)의 예시를 나타낸 도면이다. 도 10은 본 개시에 적용 가능한 물리 채널들 및 이들을 이용한 신호 전송 방법을 나타낸 도면이다.도 11은 본 개시에 적용 가능한 무선 인터페이스 프로토콜(Radio Interface Protocol)의 제어평면(Control Plane) 및 사용자 평면(User Plane) 구조를 나타낸 도면이다. 도 12는 본 개시에 적용 가능한 전송 신호를 처리하는 방법을 나타낸 도면이다. 도 13은 본 개시에 적용 가능한 무선 프레임의 구조를 나타낸 도면이다. 도 14는 본 개시에 적용 가능한 슬롯 구조를 나타낸 도면이다. 도 15는 본 개시에 적용 가능한 6G 시스템에서 제공 가능한 통신 구조의 일례를 나타낸 도면이다. 도 16은 본 개시에 적용 가능한 전자기 스펙트럼을 나타낸 도면이다. 도 17은 본 개시에 적용 가능한 THz 통신 방법을 나타낸 도면이다. 도 18은 본 개시에 적용 가능한 THz 무선 통신 송수신기를 나타낸 도면이다. 도 19는 본 개시에 적용 가능한 THz 신호 생성 방법을 나타낸 도면이다. 도 20은 본 개시에 적용 가능한 무선 통신 송수신기를 나타낸 도면이다. 도 21은 본 개시에 적용 가능한 송신기 구조를 나타낸 도면이다. 도 22는 본 개시에 적용 가능한 변조기 구조를 나타낸 도면이다. 도 23은 본 개시에 적용 가능한 신경망을 나타낸 도면이다. 도 24는 본 개시에 적용 가능한 신경망에서 활성화 노드를 나타낸 도면이다. 도 25는 본 개시에 적용 가능한 체인 룰을 이용하여 그라디언트를 계산하는 방법을 나타낸 도면이다. 도 26은 본 개시에 적용 가능한 RNN에 기초한 학습 모델을 나타낸 도면이다. 도 27은 본 개시에 적용 가능한 오토인코더를 나타낸 도면이다. 도 28은 본 개시에 적용 가능한 오토 인코더를 이용한 통신 체인을 나타낸 도면이다. 도 29는 본 개시가 적용 가능한 LDPC 코드에서 IR을 지원하는 방법을 나타낸 도면이다. 도 30은 본 개시가 적용 가능한 신경망에서 HARQ 기법을 적용하는 방법을 나타낸 도면이다. 도 31은 본 개시가 적용 가능한 신경망에서 HARQ 기법을 적용하는 방법을 나타낸 도면이다. 도 32는 본 개시가 적용 가능한 레이어 증가 기법에 기초하여 HARQ 피드백을 지원하는 방법을 나타낸 도면이다. 도 33은 본 개시가 적용 가능한 펑처링 웨이트 기법을 적용하여 HARQ 피드백을 지원하는 방법을 나타낸 도면이 다. 도 34는 본 개시가 적용 가능한 채널을 증가하는 기법에 기초하여 HARQ 피드백을 지원하는 방법을 나타낸 도면 이다. 도 35는 본 개시가 적용 가능한 다중 신경망에 기초하여 HARQ 피드백방법을 나타낸 도면이다. 도 36은 본 개시가 적용 가능한 HARQ 피드백을 지원하는 방법을 나타낸 도면이다. 도 37은 본 개시가 적용 가능한 HARQ 피드백 지원 방법을 나타낸 도면이다. 도 38은 본 개시가 적용 가능한 송신단 및 수신단 동작을 나타낸 도면이다. 도 39는 본 개시가 적용 가능한 단말 동작 방법을 나타낸 도면이다."}
