{"patent_id": "10-2022-0117403", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0038480", "출원번호": "10-2022-0117403", "발명의 명칭": "다수의 시계열 데이터의 정합을 수행하는 전자장치 및 그 수행 방법", "출원인": "한국전자기술연구원", "발명자": "문재원"}}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자장치에 의해 수행되는 방법에 있어서,동일 또는 상이한 특성 정보를 갖는 시계열 데이터 기반의 복수의 데이터 셋을 수집하는 단계;상기 복수의 데이터셋 중 통합 대상 데이터 셋에 대하여 각 설정된 데이터 수집 주기를 비교하는 단계;상기 데이터 수집 주기의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 주기를 결정하는 단계;상기 통합 대상 데이터 셋의 각 데이터 수집 구간을 비교하는 단계;상기 데이터 수집 구간의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 구간을 결정하는 단계;및상기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계를 포함하는,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 데이터 수집 주기의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 주기를 결정하는단계는,상기 통합 대상 데이터 셋 중 적어도 하나의 데이터 셋의 데이터 수집 주기가 동일하지 않은 경우, 소정의 통합주기 결정 방법에 기초하여 상기 통합 주기를 결정하되, 상기 소정의 통합 주기 결정 방법은 상기 통합 대상 데이터 셋의 최소 데이터 수집 주기, 최대 데이터 수집 주기, 최다 빈도 출연 데이터 셋의 주기, 평균 데이터 수집 주기 및 최대공약수에 기반한 데이터 수집 주기 중 어느 하나로 결정되는 것인,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 데이터 수집 구간의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 구간을 결정하는단계는,상기 통합 대상 데이터 셋의 각 데이터 수집 구간의 시작지점과 종료지점을 조합한 복수의 구간 중 어느 하나의구간을 상기 통합 구간으로 결정하는 것인,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계는,상기 통합 대상 데이터 셋의 각 특성 정보를 기반으로 데이터를 통합하는 기법(이하, 특성정보 기반 데이터 통공개특허 10-2024-0038480-3-합 기법) 및 심층신경망을 기반으로 상기 통합 대상 데이터 셋의 데이터 차원을 변환하여 데이터를 통합하는 기법(이하, 심층신경망 기반 데이터 통합 기법) 중 적어도 하나의 기법에 기초하여 상기 각 데이터를 통합하는 것인,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계는, 상기 특성정보 기반 데이터 통합 기법을 적용하는 경우,상기 통합 대상 데이터 셋의 각 데이터 수집 주기, 데이터 수집 구간 및 특성 정보명을 포함하는 각 컬럼별 기본 특성 정보를 추출하는 단계;상기 각 컬럼별 기본 특성 정보에 기초하여, 상기 통합 대상 데이터 셋의 적어도 하나의 데이터 셋에 대한 샘플링을 수행하는 단계; 및상기 샘플링이 완료된 통합 대상 데이터 셋에 존재하는 결측치를 처리하는 단계를 포함하는,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 각 컬럼별 기본 특성 정보에 기초하여, 상기 통합 대상 데이터 셋의 적어도 하나의 데이터 셋에 대한 샘플링을 수행하는 단계는,상기 통합 대상 데이터 셋의 각 데이터 셋을 대상으로 상기 기본 특성 정보 중 데이터 수집 주기와 상기 결정된통합 주기를 비교하여, 해당 데이터 셋의 업 샘플링 또는 다운 샘플링을 결정하는 단계;상기 해당 데이터 셋의 데이터 수집 구간을 상기 결정된 통합 구간으로 변경 설정하는 단계; 및상기 통합 구간 내에서 상기 결정된 업 샘플링 또는 다운 샘플링을 수행하는 단계를 포함하는,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 샘플링이 완료된 통합 대상 데이터 셋에 존재하는 결측치를 처리하는 단계는,상기 통합 대상 데이터 셋의 각 데이터 셋에 대한 특성 정보의 카테고리화 가능 여부에 기초하여 1차 데이터 유형을 구분하는 단계;상기 1차 데이터 유형 구분이 완료된 데이터 셋을 대상으로 소정의 2차 데이터 유형을 구분하는 단계; 및상기 구분된 2차 데이터 유형에 상응하는 결측치 처리 기법을 적용하는 단계를 포함하는,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,공개특허 10-2024-0038480-4-상기 통합 대상 데이터 셋의 각 데이터 셋에 대한 특성 정보의 카테고리화 가능 여부에 기초하여 1차 데이터 유형을 구분하는 단계는,상기 데이터의 카테고리화가 불가능한 데이터 셋의 경우, 해당 데이터 셋의 특성 정보가 문자 기반 데이터인지아니면 숫자 기반 데이터인지 여부를 확인하는 단계를 더 포함하는,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 1차 데이터 유형 구분이 완료된 데이터 셋을 대상으로 소정의 2차 데이터 유형을 구분하는 단계는,상기 카테고리화가 가능한 데이터 셋 및 상기 문자 기반 데이터로 구성된 데이터 셋의 2차 데이터 유형을, 각데이터 간의 연산이 불가한 노멀(normal) 데이터 또는 각 데이터 간의 크기 비교 연산만이 가능한 서수(ordinal) 데이터로 구분하는 것인,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 1차 데이터 유형 구분이 완료된 데이터 셋을 대상으로 소정의 2차 데이터 유형을 구분하는 단계는,상기 숫자 기반 데이터로 구성된 데이터 셋의 2차 데이터 유형을, 각 데이터 간의 순서 및 간격 정보를 포함하는 간격(Interval) 데이터 또는 각 데이터 간의 순서, 간격 및 비율 정보를 포함하는 비율(Ratio) 데이터로 구분하는 것인,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 구분된 2차 데이터 유형에 상응하는 결측치 처리 기법을 적용하는 단계는,상기 통합 대상 데이터 셋 중 데이터 수집 주기가 존재하지 않아 평균 데이터 수집 주기를 상기 데이터 수집 주기로 적용한 데이터 셋의 결측치를 0으로 처리하는 것인,다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제4항에 있어서,상기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계는, 상기 심층신경망기반 데이터 통합 기법을 적용하는 경우,상기 결정된 통합 주기 및 통합 구간에 기초하여 상기 통합 대상 데이터 셋의 주기 및 구간을 조정하는 단계;상기 조정된 통합 대상 데이터 셋을 구성하는 각 데이터 셋을 결합하는 단계; 및상기 결합된 통합 대상 데이터 셋을 미리 학습된 심층신경망 모델에 입력하여, 데이터의 차원 변환을 통해 상기통합 대상 데이터 셋에 존재하는 결측치를 처리하는 단계를 포함하는,공개특허 10-2024-0038480-5-다수의 시계열 데이터 정합 수행 방법."}
{"patent_id": "10-2022-0117403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "전자장치에 있어서,수집된 동일 또는 상이한 특성 정보를 갖는 시계열 데이터 기반의 복수의 통합 대상 데이터 셋의 각 데이터 수집 주기를 기초로 통합 주기를 결정하고, 각 데이터 수집 구간을 기초로 통합 구간을 결정하며, 상기 결정된 통합 주기 및 통합 구간에 기초하여 상기 통합 대상 데이터 셋의 각 데이터를 통합하되, 통합 과정에서 발생하는결측치를 소정의 결측치 처리 기법에 기초하여 처리하는 프로세서를 포함하는,다수의 시계열 데이터 정합 수행을 위한 전자장치."}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다수의 시계열 데이터 정합 수행 방법이 제공된다. 상기 방법은 동일 또는 상이한 특성 정보를 갖는 시계열 데이 터 기반의 복수의 데이터 셋을 수집하는 단계; 상기 복수의 데이터셋 중 통합 대상 데이터 셋에 대하여 각 설정 된 데이터 수집 주기를 비교하는 단계; 상기 데이터 수집 주기의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 주기를 결정하는 단계; 상기 통합 대상 데이터 셋의 각 데이터 수집 구간을 비교하는 단계; 상기 데이터 수집 구간의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 구간을 결정하는 단계; 및 상 기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계를 포함한다."}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다수의 시계열 데이터의 정합을 수행하는 전자장치 및 그 수행 방법에 관한 것이다."}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 기계학습 기술 및 IoT 디바이스의 보급화로 스마트팜, 스마트 팩토리 등 다양한 분야에서 센서를 이용하여 시계열 데이터를 수집하고 의미있는 정보를 추출하기 위한 시도가 계속되고 있다. 이렇게 실시간으로 쌓인 시계 열 데이터들은 그 규모가 상당하기 때문에 빅데이터 처리 방법을 통해 처리되고 활용되어야 한다. 하지만, 다양한 산업 분야에서 생성되는 시계열 데이터는 그 특성상 데이터의 기술 방법 범위의 양과 질이 다르 며, 이로 인해 서로 통합하여 활용하기가 쉽지 않다. 또한, 여러 산업에서 생성되는 불특정 데이터들을 실시간으로 통합하기 위한 표준 및 가이드라인이 존재하지 않 아 실제 활용하는데는 더욱 어려움이 존재한다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제2021-0147568호(2021.12.07)"}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 이종 시계열 데이터를 정합함에 있어, 데이터를 구성하는 개별적 특성을 바탕으로 데이터를 변환 및 정합하거나 또는 심층신경망에 기반하여 데이터의 차원을 변환하여 데이터를 정합하는, 다수의 시계열 데이터의 정합을 수행하는 전자장치 및 그 수행 방법을 제공한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 제1 측면에 따른 다수의 시계열 데이터 정 합 수행 방법은 동일 또는 상이한 특성 정보를 갖는 시계열 데이터 기반의 복수의 데이터 셋을 수집하는 단계; 상기 복수의 데이터셋 중 통합 대상 데이터 셋에 대하여 각 설정된 데이터 수집 주기를 비교하는 단계; 상기 데 이터 수집 주기의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 주기를 결정하는 단계; 상기 통 합 대상 데이터 셋의 각 데이터 수집 구간을 비교하는 단계; 상기 데이터 수집 구간의 비교 결과에 기초하여 상 기 통합 대상 데이터 셋에 대한 통합 구간을 결정하는 단계; 및 상기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계를 포함한다. 본 발명의 일부 실시예에 있어서, 상기 데이터 수집 주기의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 주기를 결정하는 단계는, 상기 통합 대상 데이터 셋 중 적어도 하나의 데이터 셋의 데이터 수집 주기 가 동일하지 않은 경우, 소정의 통합 주기 결정 방법에 기초하여 상기 통합 주기를 결정하되, 상기 소정의 통합 주기 결정 방법은 상기 통합 대상 데이터 셋의 최소 데이터 수집 주기, 최대 데이터 수집 주기, 최다 빈도 출연 데이터 셋의 주기, 평균 데이터 수집 주기 및 최대공약수에 기반한 데이터 수집 주기 중 어느 하나로 결정될 수 있다. 본 발명의 일부 실시예에 있어서, 상기 데이터 수집 구간의 비교 결과에 기초하여 상기 통합 대상 데이터 셋에 대한 통합 구간을 결정하는 단계는, 상기 통합 대상 데이터 셋의 각 데이터 수집 구간의 시작지점과 종료지점을 조합한 복수의 구간 중 어느 하나의 구간을 상기 통합 구간으로 결정할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계는, 상기 통합 대상 데이터 셋의 각 특성 정보를 기반으로 데이터를 통합하는 기법(이하, 특성정 보 기반 데이터 통합 기법) 및 심층신경망을 기반으로 상기 통합 대상 데이터 셋의 데이터 차원을 변환하여 데 이터를 통합하는 기법(이하, 심층신경망 기반 데이터 통합 기법) 중 적어도 하나의 기법에 기초하여 상기 각 데 이터를 통합할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계는, 상기 특성정보 기반 데이터 통합 기법을 적용하는 경우, 상기 통합 대상 데이터 셋의 각 데이 터 수집 주기, 데이터 수집 구간 및 특성 정보명을 포함하는 각 컬럼별 기본 특성 정보를 추출하는 단계; 상기 각 컬럼별 기본 특성 정보에 기초하여, 상기 통합 대상 데이터 셋의 적어도 하나의 데이터 셋에 대한 샘플링을 수행하는 단계; 및 상기 샘플링이 완료된 통합 대상 데이터 셋에 존재하는 결측치를 처리하는 단계를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 각 컬럼별 기본 특성 정보에 기초하여, 상기 통합 대상 데이터 셋의 적 어도 하나의 데이터 셋에 대한 샘플링을 수행하는 단계는, 상기 통합 대상 데이터 셋의 각 데이터 셋을 대상으 로 상기 기본 특성 정보 중 데이터 수집 주기와 상기 결정된 통합 주기를 비교하여, 해당 데이터 셋의 업 샘플 링 또는 다운 샘플링을 결정하는 단계; 상기 해당 데이터 셋의 데이터 수집 구간을 상기 결정된 통합 구간으로 변경 설정하는 단계; 및 상기 통합 구간 내에서 상기 결정된 업 샘플링 또는 다운 샘플링을 수행하는 단계를 포 함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 샘플링이 완료된 통합 대상 데이터 셋에 존재하는 결측치를 처리하는 단 계는, 상기 통합 대상 데이터 셋의 각 데이터 셋에 대한 특성 정보의 카테고리화 가능 여부에 기초하여 1차 데 이터 유형을 구분하는 단계; 상기 1차 데이터 유형 구분이 완료된 데이터 셋을 대상으로 소정의 2차 데이터 유 형을 구분하는 단계; 및 상기 구분된 2차 데이터 유형에 상응하는 결측치 처리 기법을 적용하는 단계를 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 통합 대상 데이터 셋의 각 데이터 셋에 대한 특성 정보의 카테고리화 가 능 여부에 기초하여 1차 데이터 유형을 구분하는 단계는, 상기 데이터의 카테고리화가 불가능한 데이터 셋의 경 우, 해당 데이터 셋의 특성 정보가 문자 기반 데이터인지 아니면 숫자 기반 데이터인지 여부를 확인하는 단계를 더 포함할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 1차 데이터 유형 구분이 완료된 데이터 셋을 대상으로 소정의 2차 데이 터 유형을 구분하는 단계는, 상기 카테고리화가 가능한 데이터 셋 및 상기 문자 기반 데이터로 구성된 데이터 셋의 2차 데이터 유형을, 각 데이터 간의 연산이 불가한 노멀(normal) 데이터 또는 각 데이터 간의 크기 비교 연산만이 가능한 서수(ordinal) 데이터로 구분할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 1차 데이터 유형 구분이 완료된 데이터 셋을 대상으로 소정의 2차 데이 터 유형을 구분하는 단계는, 상기 숫자 기반 데이터로 구성된 데이터 셋의 2차 데이터 유형을, 각 데이터 간의 순서 및 간격 정보를 포함하는 간격(Interval) 데이터 또는 각 데이터 간의 순서, 간격 및 비율 정보를 포함하 는 비율(Ratio) 데이터로 구분할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 구분된 2차 데이터 유형에 상응하는 결측치 처리 기법을 적용하는 단계 는, 상기 통합 대상 데이터 셋 중 데이터 수집 주기가 존재하지 않아 평균 데이터 수집 주기를 상기 데이터 수집 주기로 적용한 데이터 셋의 결측치를 0으로 처리할 수 있다. 본 발명의 일부 실시예에 있어서, 상기 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합하는 단계는, 상기 심층신경망 기반 데이터 통합 기법을 적용하는 경우, 상기 결정된 통합 주기 및 통합 구 간에 기초하여 상기 통합 대상 데이터 셋의 주기 및 구간을 조정하는 단계; 상기 조정된 통합 대상 데이터 셋을 구성하는 각 데이터 셋을 결합하는 단계; 및 상기 결합된 통합 대상 데이터 셋을 미리 학습된 심층신경망 모델 에 입력하여, 데이터의 차원 변환을 통해 상기 통합 대상 데이터 셋에 존재하는 결측치를 처리하는 단계를 포함 할 수 있다. 또한, 본 발명의 제2 측면에 따른 다수의 시계열 데이터 정합 수행을 위한 전자장치는 수집된 동일 또는 상이한 특성 정보를 갖는 시계열 데이터 기반의 복수의 통합 대상 데이터 셋의 각 데이터 수집 주기를 기초로 통합 주 기를 결정하고, 각 데이터 수집 구간을 기초로 통합 구간을 결정하며, 상기 결정된 통합 주기 및 통합 구간에 기초하여 상기 통합 대상 데이터 셋의 각 데이터를 통합하되, 통합 과정에서 발생하는 결측치를 소정의 결측치 처리 기법에 기초하여 처리하는 프로세서를 포함한다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 일 실시예에 의하면, 이종의 시계열 데이터의 특성 정보를 바탕으로 데이터를 변환 및 통합하 거나, 심층신경망에 기반하여 데이터의 차원을 변환하여 통합함으로써, 서로 다른 데이터 기술 주기로 저장된 다수의 데이터 셋을 결합할 수 있다."}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하에서는, 당업자의 이해를 돕기 위하여 본 발명이 제안된 배경에 대하여 먼저 서술하고, 본 발명의 실시예에 대하여 서술하기로 한다. 4차 산업의 발전으로 인한 보안, 의료, 경영, 과학 등의 성장은 다양한 데이터의 공급과 수요를 증가시켰다. 데 이터 처리, 저장, 분석 관련 국내 동향을 살펴보면 과거에는 영상, 음성과 같은 정형화된 데이터를 중심으로 한 연구가 활발히 진행되어 왔다. 하지만, 현재 데이터 시장에서는 IoT 센서의 보급으로 인한 시계열 데이터의 공 급량이 증가함에 따라 시계열 데이터의 분석에 대한 요구가 확대되고 있다. 그러나, 다양한 데이터의 분석 및 응용 연구를 수행하는 국외와는 달리, 국내는 주류 데이터 연구에 비해 시간을 기반한 복합 데이터 연구는 아직 미흡한 상태이다. 다양한 산업발전을 위해서는 서로 다른 도메인의 데이터를 통합하여 응용하는 기술이 필요하다. 예를 들어, 스 마트팜에서 환경에 따른 작물의 성장 영향력을 예측하고자 할 때는 작물이 자라는 환경의 온도, 습도, 조도와 같은 시계열 센서 데이터 정보만 아니라 사용자의 입력 혹은 영상으로 취득한 작물의 생장 정도에 대한 데이터 가 함께 필요하다. 따라서, 서로 다른 도메인의 통합 데이터를 활용한 기계학습 연구가 활발히 진행되기 위해서는 앞서 데이터의 통합이 선행되어야 한다. 일회성의 연구를 위해서는 연구자가 상황에 맞게 각 데이터를 변환하고 통합하여 활용 할 수 있지만, 여러 산업에서 생성되는 불특정 데이터를 실시간으로 통합 활용하려 할 경우, 그 방법에 대한 표 준 및 가이드라인이 부재하여 실제 활용은 어려운 실정이다. 특히, 시간을 기준으로 기술된 시계열 데이터를 분석 및 학습에 활용하기 위해서는 데이터가 순차적이면서 균일 한 간격으로 저장되어 있어야 한다. 그러나 다양한 산업군에서 수집된 시계열 데이터는 수집기의 에러 및 네트 워크 환경 문제로 인한 누락 데이터가 빈번하게 발생한다. 그리고 결측값이 정리되지 않은 상태의 데이터는 기 계학습에서 원하는 결과를 얻지 못하기 때문에 필수적으로 분석 전 결측값 처리가 필요하다. 더불어, 시간 정보 에 의존적인 데이터이므로 기술된 시간의 빈도, 기술 시간 범위 등에 의거하여 전처리를 진행하고 시간 정보를 고려하는 기계학습 알고리즘에 대한 선택이 필요하다.이러한 문제를 해소하기 위하여, 본 발명의 일 실시예에 따른 다수의 시계열 데이터의 정합을 수행하는 전자장 치 및 그 수행 방법은 이종 시계열 데이터를 정합함에 있어, 데이터를 구성하는 개별적 특성을 바탕으로 데이터 를 변환 및 정합하거나 또는 심층신경망에 기반하여 데이터의 차원을 변환하여 데이터를 정합하는 것을 목적으 로 한다. 이하에서는 도 1 내지 도 12를 참조하여 본 발명의 일 실시예에 따른 다수의 시계열 데이터의 정합을 수행하는 전자장치 및 그 수행 방법(이하, 제1 실시예)에 대해 설명하도록 한다. 또한, 도 14 내지 도 21에서는 데이터 보완 조건에 기반한 데이터 선별을 수행하는 전자장치 및 그 수행 방법(이하, 제2 실시예)에 대해 설명하도록 한다. 한편, 본 발명에서의 제1 및 제2 실시예는 각 단계에서 실시 형태에 따라 그 기술적 특징을 상호 공유하 거나 일부 적용할 수 있음은 물론이다. 즉, 제1 실시예에 따라 이종의 시계열 데이터가 통합된 후 제2 통합된 데이터를 기반으로 제2 실시예가 수행되거나, 또는 제2 실시예에 따라 데이터 선별 및 보완이 수행된 후 제1 실 시예에 따른 통합 과정이 수행될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 전자장치의 구성을 도시한 블록도이다. 본 발명의 일 실시예에 따른 전자장치는 입력부, 통신부, 표시부, 메모리 및 프로세 서를 포함한다. 입력부는 전자장치의 사용자 입력에 대응하여 입력데이터를 발생시킨다. 사용자 입력은 전자장치 가 처리하고자 하는 데이터에 관한 사용자 입력이나, 분할 주기에 대한 사용자 입력, 통합 주기 및 통합 구간에 대한 사용자 입력, 데이터 보완 조건에 관한 사용자 입력, 누락 데이터를 처리할 적어도 하나의 누락 데 이터 처리 방법에 관한 사용자 입력을 포함할 수 있다. 입력부는 적어도 하나의 입력수단을 포함한다. 입력부는 키보드(key board), 키패드(key pad), 돔 스 위치(dome switch), 터치패널(touch panel), 터치 키(touch key), 마우스(mouse), 메뉴 버튼(menu button) 등 을 포함할 수 있다. 통신부는 데이터를 수신하기 위해 서버나 데이터 수집 장치 등 외부장치와의 통신을 수행한다. 이와 같은 통신부는 유선 통신 모듈 및 무선 통신 모듈을 모두 포함할 수 있다. 유선 통신 모듈은 전력선 통신 장치, 전화선 통신 장치, 케이블 홈(MoCA), 이더넷(Ethernet), IEEE1294, 통합 유선 홈 네트워크 및 RS-485 제어 장 치로 구현될 수 있다. 또한, 무선 통신 모듈은 WLAN(wireless LAN), Bluetooth, HDR WPAN, UWB, ZigBee, Impulse Radio, 60GHz WPAN, Binary-CDMA, 무선 USB 기술 및 무선 HDMI 기술, 그밖에 5G(5th generation communication), LTE-A(long term evolution-advanced), LTE(long term evolution), Wi-Fi(wireless fidelity) 등의 기능을 구현하기 위한 모듈로 구성될 수 있다. 표시부는 전자장치의 동작에 따른 표시 데이터를 표시한다. 표시부는 이종 시계열 데이터의 통 합을 위해 필요한 표시 데이터(예를 들어, 데이터 수집 주기, 데이터 수집 구간, 통합 주기 및 통합 구간을 설 정 또는 표시하기 위한 화면), 데이터 보완 조건에 기초하여 데이터를 선별하기 위해 필요한 표시 데이터(예를 들어, 데이터 보완 조건을 설정하는 화면) 그밖에 데이터의 처리 결과를 표시하는 화면 등을 표시할 수 있다. 또는, 표시부는 누락 데이터를 처리하기 위해 필요한 표시 데이터, 예를 들면, 수집된 데이터 중 이상 데 이터를 처리하는 화면, 누락 데이터에 대한 정보를 식별하는 화면, 사용자 입력을 수신하기 위한 화면, 데이터 의 처리 결과를 표시하는 화면 등을 표시할 수 있다. 표시부는 액정 디스플레이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디스플레이, 유기 발광 다이오드(OLED; organic LED) 디 스플레이, 마이크로 전자기계 시스템(MEMS; micro electro mechanical systems) 디스플레이 및 전자 종이 (electronic paper) 디스플레이를 포함한다. 표시부는 입력부와 결합되어 터치 스크린(touch screen)으로 구현될 수 있다. 메모리는 전자장치의 동작 프로그램들을 저장한다. 여기에서, 메모리는 전원이 공급되지 않아도 저장된 정보를 계속 유지하는 비휘발성 저장장치 및 휘발성 저장장치를 통칭하는 것이다. 예를 들어, 메모리 는 콤팩트 플래시(compact flash; CF) 카드, SD(secure digital) 카드, 메모리 스틱(memory stick), 솔리 드 스테이트 드라이브(solid-state drive; SSD) 및 마이크로(micro) SD 카드 등과 같은 낸드 플래시 메모리 (NAND flash memory), 하드 디스크 드라이브(hard disk drive; HDD) 등과 같은 마그네틱 컴퓨터 기억 장치 및 CD-ROM, DVD-ROM 등과 같은 광학 디스크 드라이브(optical disc drive) 등을 포함할 수 있다. 메모리는 외부장치로부터 수집한 이종의 시계열 데이터를 저장하거나, 통합 주기 및 통합 구간을 결정하기 위한 정보, 데이터 보완 조건에 관한 데이터, 이상 데이터에 관한 정보, 누락 데이터 처리 방법에 관한 정보 등 을 저장할 수 있다. 또한, 메모리는 시계열 데이터의 통합을 위한 심층신경망 기반의 학습 모델에 관한 정 보, 또는, 누락 데이터에 대한 정보에 기초하여 적어도 하나의 누락 데이터 처리 방법을 식별하도록 학습된 모 델에 관한 정보를 저장할 수 있다. 프로세서는 프로그램 등 소프트웨어를 실행하여 전자장치의 적어도 하나의 다른 구성요소(예: 하드웨 어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 프로세서는 수집된 동일 또는 상이한 특성 정보를 갖는 시계열 데이터 기반의 복수의 통합 대상 데이터 셋 의 각 데이터 수집 주기를 기초로 통합 주기를 결정하고, 각 데이터 수집 구간을 기초로 통합 구간을 결정한다. 그리고 프로세서는 결정된 통합 주기 및 통합 구간에 기초하여 통합 대상 데이터 셋의 각 데이터를 통합하 되, 통합 과정에서 발생하는 결측치를 소정의 결측치 처리 기법에 기초하여 처리한다. 한편, 본 발명의 일 실시예에서, 프로세서는 데이터의 통합 및 데이터 보완 조건에 따른 데이터를 처리하 기 위해, 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워크(neural network), 또 는 딥러닝 알고리즘 중 적어도 하나를 이용할 수 있다. 일 예로, 인공지능(Artificial Intelligence) 알고리즘 으로서 기계학습, 신경망 네트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용할 수 있으며, 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network)과 같은 모델을 포함할 수 있다. 도 2는 본 발명의 제1 실시예에 따른 전자장치에 의해 수행되는 동작 흐름도를 도시한 도면이다. 먼저, 프로세서는 동일 또는 상이한 특성 정보를 갖는 시계열 데이터 기반의 복수의 데이터 셋을 수집한다 (S210). 여기에서 시계열이란 시간 정보를 갖고 이를 기준으로 시간 순서에 맞춰 정보가 저장된 데이터를 의미 한다. 본 발명의 일 실시예에서 시계열 데이터는 연속된 특징을 보이고 있으며, 연속된 시계열 데이터들은 시간의 흐 름에 따라 반복되거나, 공통적인 패턴을 보일 수 있다. 또한, 시계열 데이터는 주기성을 가질 수 있으며, 그 주 기들은 보통 '시간, 일, 주, 월, 년' 등의 단위를 기준으로 공통되고 반복되는 패턴을 보일 수 있다. 예를 들어, 실외 온도의 경우 공전과 자전의 영향을 받기 때문에 하루 및 년 단위의 주기성을 동시에 갖는다. 또한, 학교 실내의 이산화탄소 변화의 경우, 일과로 인한 하루 및 일주일 단위 패턴을 가질 확률이 높으며, 외 부 온도에 따라 실내 창문 개방 패턴이 달라지기 때문에 년 단위의 주기성을 가질 수도 있다. 이러한 패턴은 데 이터의 분석에 중요한 역할을 하며 데이터의 활용 시 반드시 고려해야 한다. 이처럼 시계열 데이터는 순서에 따른 정보로 시간의 영향을 받기에 시간 정보를 배제하고 분석할 시 전혀 다른 분석 결과를 얻게 된다. 즉, 다른 정형 데이터와 다르게 시간의 순서가 중요하다. 따라서, 시계열의 큰 특징인 시간 빈도와, 데이터가 기술된 시간의 범위가 중요하므로, 다수의 시계열 데이터를 통합시 시간 빈도 및 시간 범위를 모두 고려해야 한다. 한편, 본 발명의 일 실시예에서 소정의 특성 정보는 시계열 데이터의 센서에 기반한 특성 정보를 의미한다. 일 예로, 특정 도시의 기후 변화에 대해 분석하는 경우, 각 센서에 의해 센싱된 시계열 데이터는 특정 도시의 시간 에 따른 온도, 습도, 강수량, 교통량, 인구 밀집도 등이 특성 정보가 될 수 있다. 혹은 각 도시의 미세먼지 양 에 대해 비교하는 경우, 서울시, 부산시, 청주시 등이 특성 정보에 대응될 수 있다. 도 3은 본 발명의 일 실시예에서의 통합 주기를 결정하는 내용을 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에서의 결정된 통합 주기의 일 예시를 도시한 도면이다. 다음으로, 프로세서는 수집한 복수의 데이터 셋 중 통합 대상 데이터 셋에 대하여 각 설정된 데이터 수집 주기를 비교하고(S220), 데이터 수집 주기의 비교 결과에 기초하여 통합 대상 데이터 셋에 대한 통합 주기를 결 정한다(S230). 여기에서, 시간 빈도는 데이터 수집 주기로, 시간 정보가 저장되는 주기를 의미한다. 시계열은 수집하는 목적과 방식에 따라 데이터의 기술 빈도가 달라진다. 예를 들어, 같은 공간에서 온도는 3분에 한 번씩 제공되고, 습도 는 5분에 한 번씩 제공되는 데이터가 있다고 가정해보자. 그렇다면 온도 데이터의 데이터 수집 주기는 3분이고 습도 데이터는 5분이다. 이를 일괄 통합 시 데이터 시간 정보의 포인트는 [3, 5, 6, 9, 10,...]분으로 기술된다. 이런 시간의 불균일로 인해 시간 차례대로 데이터를 처리하는 기계학습 방법 활용 시 성능 저하를 초래한다. 즉, 두 개 이상의 데이터를 통합할 시 균일할 데이터 수집 주기로 정리해야 한다. 따라서, 프로세서는 입력된 복수의 데이터 셋 중 통합하고 싶은 통합 대상 데이터 셋들의 각 기술된 주기 가 동일한지를 비교하고, 통합 대상 데이터 셋 중 적어도 하나의 데이터 셋의 데이터 수집 주기가 동일하지 않 은 경우, 소정의 통합 주기 결정 방법에 기초하여 통합 주기를 결정할 수 있다. 이때, 본 발명의 일 실시예에서 소정의 통합 주기 결정 방법은 통합 대상 데이터 셋의 최소 데이터 수집 주기, 최대 데이터 수집 주기, 최다 빈도 출연 데이터 셋의 주기, 평균 데이터 수집 주기, 사용자 입력 주기 및 기타 방법을 적용할 수 있다(제1 방법). 또는, 최대공약수(GCD)에 기반한 데이터 수집 주기로 통합 주기를 결정 할 수도 있다(제2 방법). 이때, 제1 방법은 후술하는 특성정보 기반 데이터 통합 기법에 기반하여 시계열 데이 터 통합시 적용되는 통합 주기 결정 방법이고, 제2 방법은 심층신경망 기반 데이터 통합 기법에 기반하여 시계 열 데이터 통합시 적용되는 통합 주기 결정 방법이나, 반드시 이에 한정되는 것은 아니다. 도 4를 참조하면, 통합 대상 데이터 셋으로 '데이터 셋 0 내지 데이터 셋 2'가 존재하며, '데이터 셋 0'은 데이터 수집 주기가 10분이고, 데이터의 수가 720개이다. 그리고 '데이터 셋 1'은 데이터 수집 주기가 5분 이고, 데이터의 수가 2016개이며, '데이터 셋 2'는 데이터 수집 주기가 3분이고, 데이터의 수가 1920개이 다. 이 경우, 프로세서는 '데이터 셋 0 내지 데이터 셋 2'의 통합 주기로, 최소 데이터 수집 주기 적용시 통합 주기를 3분으로 결정하고, 최대 데이터 수집 주기 적용시 통합 주기를 10분으로 결정할 수 있다. 또한, 최다 빈 도 출연 데이터 셋의 주기 적용시 통합 주기를 5분으로 결정하고, 평균 데이터 수집 주기 적용시 통합 주기를 6 분으로 결정하고, 최대공약수에 기반한 데이터 수집 주기를 적용시 통합 주기를 1분으로 결정할 수 있다. 도 5는 본 발명의 일 실시예에서의 통합 구간을 결정하는 내용을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에서의 결정된 통합 구간의 일 예시를 도시한 도면이다. 다음으로, 프로세서는 통합 주기가 결정된 통합 대상 데이터 셋에 대하여 각 설정된 데이터 수집 구간을 비교하고(S240), 데이터 수집 구간의 비교 결과에 기초하여 통합 대상 데이터 셋에 대한 통합 구간을 결정한다 (S250). 한편, 본 발명은 실시예에 따라 통합 주기와 통합 구간을 결정하는 선후가 달리 적용될 수도 있음은 물 론이다. 여기에서, 시간 범위인 데이터 수집 구간은 시계열 데이터의 저장된 시작 시각과 끝나는 시각의 범위를 뜻한다. 앞서 예를 들었던 온도 데이터는 2022.01.01.~2022.02.25일까지 저장되어 있고, 습도 데이터는 2022.01.10.~2022.03.06의 범위로 이루어졌다고 가정해보자. 이때 두 데이터를 통합하면 데이터는 2022.01.01.~2022.03.06의 범위를 가질 것이며 각 데이터가 겹치지 않는 시간 범위에서는 정보가 존재하지 않기 때문에 결함이 생긴다. 따라서, 분석 성능을 높이고 다양한 응용 어플리케이션에서 활용하기 위해서는 이와 같 은 결함을 반드시 해결한 후 진행해야 한다. 도 5를 참조하면, 프로세서는 통합 대상 데이터 셋의 각 기술된 시작 구간과 종료 구간이 동일한지를 비교 하고, 통합 대상 데이터 셋의 각 데이터 수집 구간의 시작지점과 종료지점을 조합한 복수의 구간 중 어느 하나 의 구간을 통합 구간으로 결정하여, 위와 같은 문제를 해소할 수 있다. 즉, 입력된 N개의 통합 데이터 셋의 각 데이터의 시작지점 n개와 종료지점 n개의 경우의 수만큼 통합 구간이 결정될 수 있다. 또는 사용자에 의해 선택 된 어느 구간이 통합 구간으로 결정될 수도 있다. 일반적으로 서로 다른 시계열 데이터의 통합 구간 범위는 전체 시간 범위를 고려하거나 공통 시간 범위 중 하나를 선택한다. 이때, 전체 시간 범위를 고려할 경우 통합에 의한 결측값의 보완이 필요하며, 공통 범위만 통 합할 경우 공통 부분이 아니기 때문에 버려지는 데이터의 유실을 생각해야 한다. 도 6을 참조하면, 통합 대상 데이터 셋으로 '데이터 셋 0 내지 데이터 셋 2'가 존재하며, '데이터 셋 0'은 데이터 수집 구간은 2018.01.01-2018.01.05이고, '데이터 셋 1'은 데이터 수집 구간은 2018.01.02- 2018.01.08이며, '데이터 셋 2'의 데이터 수집 구간은 2018.01.03-2018.01.06이다. 이 경우, 프로세서는 '데이터 셋 0 내지 데이터 셋 2'의 통합 구간으로, 전체 시간 범위를 적용시 통 합 구간을 2018.01.01-2018.01.08로 결정하고, 공통 시간 범위를 적용시 통합 구간을 2018.01.03-2018.01.05로 결정할 수 있다. 또한, 입력된 n개의 시작지점 및 n개의 종료지점의 경우의 수를 고려한 통합 구간은 2018.01.01-2018.01.08, 2018.01.01-2018.01.06, 2018.01.02-2018.01.05. 2018.01.02-2018.01.06, 2018.01.03-2018.01.05, 2018.01.03-2018.01.08, 2018.01.01-2018.01.05, 2018.01.02-2018.01.08,2018.01.03-2018.01.06과 같이 결정될 수 있으며, 이 중 어느 하나를 선택 적용할 수 있다. 다음으로, 프로세서는 통합 주기 및 통합 구간이 결정된 통합 대상 데이터 셋의 각 데이터를 통합한다 (S260). 이때, 프로세서는 통합 대상 데이터 셋의 각 특성 정보를 기반으로 하는 데이터 통합 기법(이하, 특성정보 기반 데이터 통합 기법)과, 심층신경망을 기반으로 통합 대상 데이터 셋의 데이터 차원을 변환하여 데이터를 통 합하는 기법(이하, 심층신경망 기반 데이터 통합 기법) 중 적어도 하나의 기법에 기초하여 통합 대상 데이터 셋 의 각 데이터를 통합할 수 있다. 도 7은 본 발명의 일 실시예에서의 특성정보 기반 데이터 통합 기법을 설명하기 위한 도면이다. 일 실시예로, 특성정보 기반 데이터 통합 기법은 새로운 기술주기를 중심으로 개별 데이터의 각 컬럼(특성 정보)을 업 샘플링 또는 다운 샘플링하여 변환하고 변환된 데이터 셋을 한번에 통합하는 기법이다. 각 데이터의 컬럼들에 대해 데이터 타입 데이터 포인트간 연속성을 기반하여 데이터의 업 샘플링과 다운 샘플링을 결정할 수 있다. 구체적으로 프로세서는 통합 대상 데이터 셋의 각 데이터 수집 주기, 데이터 수집 구간 및 특성 정보명을 포함하는 각 컬럼별 특성 정보를 추출한다(S710). 그 다음, 프로세서는 각 컬럼별 특성 정보에 기초하여, 통합 대상 데이터 셋의 적어도 하나의 데이터 셋에 대한 샘플링을 수행한다(S720). 도 8은 본 발명의 일 실시예에서의 데이터 셋에 대한 샘플링 결과의 일 예시를 도시한 도면이다. 일 실시예로, 프로세서는 통합 대상 데이터 셋의 각 데이터 셋을 대상으로 기본 특성 정보 중 데이터 수집 주기와 상기 결정된 통합 주기를 비교하여, 해당 데이터 셋의 업 샘플링 또는 다운 샘플링을 결정할 수 있다. 그리고 해당 데이터 셋의 데이터 수집 구간을 결정된 통합 구간으로 변경 설정한 후, 통합 구간 내에서 상기 결 정된 업 샘플링 또는 다운 샘플링을 수행한다. 이때, 업 샘플링은 데이터의 주기 수를 기존 주기보다 늘려 더 자주 데이터가 발생하도록 하는 방법이며, 반대 로 다운 샘플링은 데이터의 주기 수를 줄이는 방법이다. 업 샘플링의 경우 데이터를 늘리는 작업이므로 필연적 으로 누락 데이터가 발생하며 이에 대한 결측치 처리 방법이 함께 필요하다. 도 8은 기존 데이터 수집 주기가 2시간인 데이터를 통합하기 위하여 1시간 주기로 업 샘플링하거나, 4시간 주기로 다운 샘플링한 결과를 나타낸 예시 도면이다. 다음으로, 프로세서는 샘플링이 완료된 통합 대상 데이터 셋에 존재하는 결측치를 처리한다(S730). 이때, 본 발명의 일 실시예는 통합 대상 데이터 셋의 각 데이터 셋에 대한 특성 정보의 카테고리화 가능 여부에 기초하여 1차 데이터 유형을 구분하고, 1차 데이터 유형 구분이 완료된 데이터 셋을 대상으로 소정의 2차 데이 터 유형을 구분한다. 그 다음, 구분된 2차 데이터 유형에 상응하는 결측치 처리 기법을 적용한다. 도 9는 본 발명의 일 실시예에서의 결측치 처리 방법을 설명하기 위한 도면이다. 먼저, 프로세서는 통합 대상 데이터 셋의 각 데이터 셋에 데이터 수집 주기가 존재하는지 여부를 판단한다 (S910). 프로세서는 판단 결과 데이터 수집 주기가 존재하는 경우, 이전 단계에서 결정된 통합 주기에 따 라 업 또는 다운 샘플링을 수행한다(S920). 그 다음, 프로세서는 해당 데이터 셋의 특성 정보의 카테고리화 가능 여부에 기초하여 1차 데이터 유형을 구분한다(S930). 만약 카테고리화가 가능한 데이터 셋의 경우(S931) 프로세서는 2차 데이터 유형을 구분한 다(S940). 이와 달리, 데이터의 카테고리화가 불가능한 데이터 셋의 경우(S932), 프로세서는 해당 데이터 셋의 특성 정보가 문자 기반 데이터(String)인지(S933), 아니면 숫자 기반 데이터(Numeric)인지 여부를 확인한 다(S934). 그 다음, 프로세서는 카테고리화가 가능한 데이터 셋 및 문자 기반 데이터로 구성된 데이터 셋의 경우 2차 데이터 유형을, 노멀(normal) 데이터 또는 서수(ordinal) 데이터로 구분한다(S951, S952). 이와 달리, 프로세서는 숫자 기반 데이터로 구성된 데이터 셋의 2차 데이터 유형을, 간격(interval) 데이 터 또는 비율(ratio) 데이터로 구분한다. 그리고 각 데이터의 구분된 2차 데이터 유형에 따라 상응하는 결측치처리 기법을 적용한다(S953, S954). 한편, 프로세서는 S905 단계에서의 판단 결과 데이터 수집 주기가 존재하지 않는 경우, 평균 데이터 수집 주기를 데이터 수집 주기로 결정하여 업 또는 다운 샘플링을 수행한다(S960). 이 경우, 프로세서는 데이터 의 유형을 1차 또는 2차로 구분하지만(S970, S980), 결측치는 0으로 일괄 처리할 수 있다(S990). 앞서 설명한 바와 같이, 본 발명의 일 실시예는 2차 데이터 유형을 노멀 데이터, 서수 데이터, 간격 데이터 및 비율 데이터로 구분할 수 있다. 다음 표 1은 본 발명의 일 실시예에서 구분된 2차 데이터 유형에 따른 수행 가 능한 연산 정보를 나타낸 것이다. 표 1 연산 노멀 데이터 서수 데이터 간격 데이터 비율 데이터 Equality ○ ○ ○ ○ Order ○ ○ ○ Add/subtract ○ ○ Multiply/divide ○ Mode ○ ○ ○ ○ Median ○ ○ ○ Arithmetic mean ○ ○ Geometric mean ○ 구체적으로, 노멀 데이터는 데이터 유형이 단순 지정된 레이블(이름)인 경우로, 각 데이터 간의 연산이 불가하 다. 노멀 데이터 간의 데이터 연산은 불가하기 때문에, 프로세서는 결측치 처리 기법으로 이미 존재하는 데이터로 채우는 방법(Equality)이나, 해당 데이터에 제일 큰 빈도로 나오는 정보로 채우는 방법(Mode)을 적용 한다. 일 실시예로, Equality 기법은 이전 스텝값 또는 이후 스텝값으로 채우는 방법이 있다. 일 실시예로, Mode 기법은 빈도를 비교하여 가장 빈도가 높은 정보로 채우는 방법에 있으며 대표적으로는 KNN(K Nearest Neighbors) 알고리즘이 있다. 다음 표 2 내지 표 4는 노멀 데이터로 분류된 예시를 나타낸 것이다. 표 2 1시 사과 2시 딸기 3시 바나나 표 2는 시간별 출하되는 과일 정보를 담은 데이터로, 1차 데이터 유형은 카테고리화가 가능한 것으로 분류되었 으며, 2차 데이터 유형으로 데이터 간의 연산이 불가한 노멀 데이터로 분류되었다. 표 3 5월 26일 맑음 5월 27일 맑음 5월 28일 비 표 3은 일별 날씨 상태를 나타내는 데이터로, 1차 데이터 유형은 카테고리화가 가능한 것으로 분류되었으며, 2 차 데이터 유형으로 데이터 간의 연산이 불가한 노멀 데이터로 분류되었다. 표 4 5월 26일 15:33:00밥 먹자 5월 26일16:00:20 여기 식당으로 가자 5월 26일16:01:15 이따 6시에 보자표 4는 시간정보가 담긴 문자 데이터로, 1차 데이터 유형은 카테고리화가 불가한 문자열 데이터로 분류되었으며, 2차 데이터 유형으로 데이터 간의 연산이 불가한 노멀 데이터로 분류되었다.서수 데이터는 데이 터의 유형이 지정된 레이블(이름)과 순서의 의미를 포함하는 경우로, 각 데이터 간의 크기 비교 연산만이 가능 하다. 즉, 서수 데이터는 이름만 지정한 데이터 유형이지만 서수 데이터와는 다르게 지정한 정보에 순서(크기) 가 존재하는 데이터 유형이다. 프로세서는 서수 데이터의 결측치 처리 기법으로 Equality, Mode뿐만 아니 라 순서(크기)를 비교하여 처리하는 방법(Order), 나열된 정보들의 중앙값으로 결측치를 채우는 방법(Median)을 적용한다. 다음 표 5 내지 표 6은 서수 데이터로 분류된 예시를 나타낸 것이다. 표 5 8월 1일 13시 금메달 8월 1일 16시 은메달 8월 2일 7시 금메달 표 5는 올림픽 메달 획득 정보가 담긴 데이터로, 데이터 수집 주기가 존재하지 않는 경우에 해당하며, 1차 데이 터 유형은 카테고리화가 가능한 것으로 분류되었으며, 2차 데이터 유형은 서수 데이터로 분류되었다. 표 6 5월 26일 중형 5월 27일 중형 5월 28일 소형 표 6은 일별 출하된 사과의 크기 데이터로, 1차 데이터 유형은 카테고리화가 가능한 것으로 분류되었으며, 2차 데이터 유형은 서수 데이터로 분류되었다.간격 데이터는 데이터 유형이 순서뿐만 아니라 간격 정보를 포함하는 경우로, 덧셈, 뺄셈, 산술평균 연산이 가능하다. 즉, 간격 데이터는 사물의 측정 양을 나타내는 데이터로, 데이 터 간격 정보가 포함되며 척도에 0이 사용될 수 있다. 이때, 0은 데이터가 없다는 것이 아닌 유의미한 정보를 포함한다. 따라서, 간격 데이터는 데이터를 비율로 비교할 수 없기 때문에 곱셈 및 나눗셈 연산이 불가하며, 프 로세서는 결측치 처리 기법으로 덧셈, 뺄셈 및 산술평균, 즉 Equality, Mode, Order, Median, Add, Subtract, Arithmetic mean, linear(특정 Interval 데이터) 기법을 적용할 수 있다. 다음 표 7 내지 표 8은 간격 데이터로 분류된 예시를 나타낸 것이다. 표 7 8월 1일 13시 20도 8월 1일 14시 21도 8월 1일 15시 21도 표 7은 시간별 서울 실외 온도 데이터로, 1차 데이터 유형은 카테고리화가 불가한 숫자열로 분류되었으며, 2차 데이터 유형은 간격 데이터로 분류되었다. 표 8 5월 26일 212명 5월 27일 175명 5월 28일 174명 표 8은 일별 버스 탑승객 수 데이터로, 1차 데이터 유형은 카테고리화가 불가한 숫자열로 분류되었으며, 2차 데 이터 유형은 간격 데이터로 분류되었다.마지막으로 비율 데이터는 각 데이터의 순서, 간격 및 비율 정보를 포함 하는 경우로, 덧셈, 뺄셈, 산술평균, 기하평균, 곱셈 및 나눗셈 연산이 가능하다. 비율 데이터는 간격 데이터와 같이 사물의 측정 양을 의미하는 데이터 유형이나, 비율 데이터와는 다르게 정보들 간의 비율 비교가 가능한 데이터 유형이다. 예를 들어, 사과 무게가 100g, 200g인 데이터가 있다면 200g의 사과 데이터는 100g의 사과 데이 터보다 2배라는 비율로 비교할 수 있다. 프로세서는 비율 데이터를 위한 결측치 처리 기법으로 Equality, Mode, Order, Median, Add, Subtract, Arithmetic mean뿐만 아니라 Multiply(곱하기), Divide(나누기)를 활용한 결측치 처리가 가능하다. 다음 표 9 내지 표 10은 비율 데이터로 분류된 예시를 나타낸 것이다. 표 9 8월 1일 16:01:00 2명 8월 1일 16:12:00 4명 8월 1일 17:00:00 3명 8월 1일 17:05:00 3명 8월 1일 17:22:00 6명 표 9는 식당 방문자 수 데이터로, 데이터 수집 주기가 존재하지 않는 경우에 해당하며, 1차 데이터 유형은 카테 고리화가 불가한 숫자열로 분류되었으며, 2차 데이터 유형은 비율 데이터로 분류되었다. 표 10 5월 26일 10kg 5월 27일 9kg 5월 28일 12kg 표 10은 일별 수확한 사과의 무게 데이터로, 1차 데이터 유형은 카테고리화가 불가한 숫자열로 분류되었으며, 2 차 데이터 유형은 비율 데이터로 분류되었다.도 10은 특성정보 기반 데이터 통합 기법에 따른 데이터 통합 결과 의 일 예시를 도시한 도면이다. 2분의 데이터 수집 주기를 갖는 Data0과, 1시간의 데이터 수집 주기를 갖는 Data1, Data2를 통합 주기 및 통합 구간을 기준으로 각 컬럼별 특성 정보에 따라 샘플링한 후 통합한 결과를 도 10에 도 시하였다. 이때, 도 10의 통합 결과의 경우 통합 주기는 4분으로, 통합 구간은 2020-09-11 00:00:00~2020-09- 11 00:16:00으로 결정되었다. 또한, 통합 주기 및 통합 구간으로 조정이 된 후 생성된 결함은 전술한 1차 및 2 차 데이터 유형에 따른 결측치 처리 기법을 통해 처리되었다. 도 11은 본 발명의 일 실시예에서의 심층신경망 기반 데이터 통합 기법을 설명하기 위한 도면이다. 도 12는 본 발명의 일 실시예에서의 심층신경망 기반 데이터 통합 기법에 따른 데이터 변환 결과 예시를 도시한 도면이다. 본 발명의 일 실시예에 따른 데이터 통합 방법 중 두번째 방법인 심층신경망 기반 데이터 통합 기법은 서로 다 른 주기의 데이터를 아예 다른 차원의 데이터로 변환함으로써 데이터 기술 주기의 불일치를 극복하는 방법이다. 구체적으로, 프로세서는 결정된 통합 주기 및 통합 구간에 기초하여 통합 대상 데이터 셋의 주기 및 구간 을 조정하고(S1110), 조정된 통합 대상 데이터 셋을 구성하는 각 데이터 셋을 결합한다(S1120). 다음으로, 프로세서는 결합된 통합 대상 데이터 셋을 미리 학습된 심층신경망 모델에 입력하여, 데이터 차 원 변환을 통해 통합 대상 데이터 셋에 존재하는 결측치를 처리한다(S1130). 일 실시예로, 본 발명에서의 심층신경망 모델은 LSTM 오토인코더가 적용될 수 있다. LSTM 오토인코더는 인코더-디코더 LSTM 구조로, 정보에 순서가 담긴 데이터를 오토인코더가 다룰 수 있게 하는 알고리즘이다. LSTM은 순서가 있는 데이터 즉, 시퀀스 데이터를 다룰 수 있는 알고리즘 vanilla RNN의 기울기 소실, 기울기 폭주의 문제점을 보완하기 위해 만들어졌다. 은닉층에서 발생한 모든 결과를 출력층으로 전달하는 Feed Forward Neural Network와 달리, RNN은 은닉층에서 다음 스텝 은닉층으로 결과를 전달하는 순환 신경망이 며, RNN의 단점을 극복하고자 RNN보다 고도화된 구조를 갖는 알고리즘이 LSTM이다. 오토인코더는 입력한 데이터에서 중요한 정보를 추출하고 추출한 정보를 바탕으로 입력 데이터와 유사한 데이터 를 재구성하여 데이터를 효율적으로 복원하는 알고리즘이다. 이때, 인코더는 입력된 데이터의 차원을 축소하여 불필요한 정보는 정리하고 필요한 정보만을 추출해 벡터로 변환한다. 그리고 디코더는 생성된 벡터에 의거하여다시 데이터를 복원해 출력하는 생성 네트워크 부분이다. 본 발명에서는 입력 데이터들의 주기를 균등하게 조정함으로써 발생된 결함을 LSTM 오토인코더를 통한 데이터 차원 변환을 통해 해결할 수 있다. LSTM 오토인코더는 입력 데이터의 특징을 학습한다. 하지만, LSTM 오토인코 더의 입력으로는 불규칙한 기술 주기의 데이터를 활용할 수 없다. 그러므로 통합을 원하는 N개의 데이터들은 강 제적으로 규칙적인 주기에 맞춰 기술되는 준비과정이 필요하다. S1110 단계에서는, 서로 다른 주기의 데이터 셋에 대해 유실값을 포함하더라도 규칙적인 주기로 기술되는 데이 터 정제(Data Refinement) 과정을 거치며, 이를 위한 새로운 통합 주기는 각 데이터의 데이터 수집 주기에 대한 최대공약수(GCD)로 강제 설정될 수 있다. 이는 최대공약수 주기가 데이터의 유실을 최소화하면서 기술 주기를 맞출 수 있는 값이기 때문이다. 각 데이터 셋을 최대공약수 기술 주기에 의거한 통합 주기로 시간 빈도를 조정한 후 결합을 진행하면 기준 주기 에 해당 정보가 존재하지 않는 부분은 결함이 생긴다. 이러한 결측치 처리를 위해, 프로세서는 최대공약수 기술 주기로 인해 발생한 결함 부분은 0으로 대체한 후, LSTM 오토인코더를 통해 데이터의 차원을 변환한다. 즉, 입력 데이터를 복원하기 위해 입력 데이터의 주요 특징을 학습하는 LSTM 오토인코더의 특성을 활용하여, 결 합된 통합 대상 데이터 셋의 특징을 학습한 모델을 생성하고, 생성된 모델을 기반으로 최적의 특징을 추출한 latent vector를 새로운 변수로 정의하여 생성한 다른 차원의 통합 데이터를 출력한다. 도 12는 데이터 수집 주기가 10분, 7분, 3분인 데이터 셋(1210~1230)의 통합 주기를 최대공약수 1분으로 적용하 고, 통합 구간을 2018.01.03~2018.01.05로 적용하여 정제 및 결합 후 LSTM 오토인코더 를 활용해 데이터 의 차원을 변환한 결과이다. 이와 같은 본 발명의 일 실시예에 의하면, 이종의 시계열 데이터의 특성 정보를 바탕으로 데이터를 변환 및 통 합하거나, 심층신경망에 기반하여 데이터의 차원을 변환하여 통합함으로써, 서로 다른 데이터 기술 주기로 저장 된 다수의 데이터 셋을 결합할 수 있다. 이하에서는 도 13 내지 도 21을 참조하여 본 발명의 제2 실시예에 따른 데이터 보완 조건에 기반한 데이터 선별 을 수행하는 전자장치 및 그 수행 방법에 대해 설명하도록 한다. 한편, 도 13 이하에서 설명하는 내용은 도 1 이하에서 설명한 제1 실시예에 따른 다수의 시계열 데이터의 정합을 수행하는 전자장치 및 그 수행 방법에 상호 적용될 수 있음은 물론이다. 먼저, 당업자의 이해를 돕기 위하여 본 발명이 제안된 배경에 대하여 먼저 서술하고, 본 발명의 실시예에 대하 여 서술하기로 한다. 산업 기술과 정보 통신 기술의 발달에 따라 데이터의 양이 폭발적으로 늘어나고, 이를 활용하는 데이터 마이닝 이나 기계학습과 같은 데이터 활용 기술의 성능도 점점 좋아지고 있다. 이때, 데이터 활용 기술을 이용하여 좋 은 결과를 얻기 위해서는 데이터가 무결하다는 전제 조건을 만족해야 한다. 그러나 실제 환경에서는 다양한 이 유로 빈번하게 누락되거나 이상 데이터가 발생하고 있다. 누락 데이터나 이상 데이터를 포함하는 데이터를 처리하는 경우, 데이터로부터 도출할 수 있는 결론에 상당한 영향을 미칠 수 있다. 누락 데이터를 처리하는 방법으로, 예를 들어, 테이블 형식으로 이루어진 데이터에서 각각의 행이 독립적인 경 우, 누락 데이터를 포함하는 행을 일괄 삭제하는 방법이 가장 널리 쓰이고 있으며 간단하게 처리가 가능하다. 그러나, 이 방법은 시간의 흐름에 의존하는 시계열 데이터의 경우 데이터가 획득된 시간이 중요하기 때문에 임 의로 특정 행을 삭제하면 데이터의 연속성을 보장하기 어렵다. 따라서, 시계열 데이터의 경우, 누락 데이터를 부분적으로 삭제하는 것보다 누락 데이터가 발생된 시점의 전후의 데이터 전부를 삭제하는 것이 바람직하다. 이렇게 일괄적으로 누락 데이터를 삭제하는 방법을 활용하는 경우, 누락 데이터의 위치에 따라 삭제되는 데이터 의 양이 달라지며, 경우에 따라 많은 데이터가 삭제될 수 있다. 그러므로 일반적으로 시계열 데이터는 누락 데이터를 최대한 보간하여 누락 값을 없애는 방법을 적용한다. 그러 나, 이 방법 또한 시계열 데이터가 어느 이상의 임계치를 넘어선 양의 누락 데이터를 포함할 경우, 무리한 보간 작업으로 인해 오히려 품질이 낮은 데이터를 생산하게 되어 복구하는 의미가 낮아질 수 있다. 또한 일괄적으로 누락 데이터를 삭제 및 보간 등으로 인해 서로 다른 복수의 데이터 결합 시 필연적으로 나타나 는 누락 데이터에 대한 고려가 없는 바, 데이터간 결합으로 인해 나타나는 누락 데이터에 대한 유연한 처리 방 법이 필요하다. 이를 위해, 본 발명의 일 실시예에 따른 데이터 보완 조건에 기반한 데이터 선별을 수행하는 전자장치 및 그 수 행 방법은, 누락 데이터에 대해 활용 가능한 정도를 가변적으로 판단할 수 있으며, 사용자가 원하는 품질에 기 반하여 시계열 데이터에 누락 데이터가 포함되더라도 취사 선택하여 데이터를 보다 효율적으로 복구 및 활용할 수 있다. 또한, 본 발명의 일 실시예는 데이터를 활용하는 목적이나 데이터의 양과 질을 고려하여 누락 데이터 를 처리할 수 있으며, 단일 데이터뿐만 아니라 복수의 단일 데이터가 결합된 데이터를 대상으로도 적용이 가능 하다. 이하 첨부된 도면을 중심으로 상세히 설명하도록 한다. 도 13은 누락 데이터를 포함하는 데이터를 도시한 도면이다. 도 13의 데이터는 각 특성 정보(Feature, N) 별로 시간(Time, T)에 따라 수집된 데이터를 테이블화 한 것으로, 10개의 서로 다른 특성 정보, 10개의 시간으로 구성된다. 데이터를 분석함에 있어서 무결성을 전제로 하지만 실제 데이터를 수집하는 과정에서 다양한 이유로 빈번하게 누락되거나 이상 데이터가 발생하고 있다. 본 발명의 일 실시예에서 누락 데이터는 숫자, 문자 등 어떤 방법으로도 변환되어 표기할 수 없는 데이터로, 정 의할 수 없거나, 존재하지 않는 데이터라고 포괄적으로 정의한다. 해당 시간에 수집된 데이터가 없거나, 수집하 였으나 서버 등 장치로 전송하는 과정에서 누락된 데이터를 의미한다. 누락 데이터의 값은 “-999”와 같은 극 단적인 값을 표기하거나 “NaN”, “NA”와 같이 정해진 문자를 표현하는 등의 다양한 방법으로 표현될 수 있다. 그러나 표준화되지 않은 누락 데이터의 표기법은 데이터가 기록된 후 정상 데이터와 비정상 데이터를 명 확하게 판단해 내기 어려운 경우가 존재한다. 따라서, 데이터를 처리하는 대표적인 라이브러리들은 누락 데이터 를 단순성과 기능상의 이유로 “NaN” 혹은 “NA” 등으로 표기한다. 본 발명에서는 이상 데이터를 “NaN” 혹은 “NA” 등으로 표기하여 누락 데이터로 치환한다. 누락 데이터를 처리하기 위해, 데이터를 일괄 삭제하는 방법을 사용하는 경우, 누락 데이터에 대한 오염 을 방지한 완벽한 데이터 셋을 얻을 수 있으나 누락 데이터의 위치에 따라 삭제하는 정도가 커서 데이터로 활용 하기에 부족할 수 있다. 예를 들어, 데이터에서 누락 데이터를 포함하는 행을 일괄적으로 삭제하게 되면, T1 행과 T10행이 남는 바, 데이터를 활용하여 유용한 정보를 얻기에 부족할 수 있다. 혹은 누락 데이터를 처리하기 위해, 데이터를 일괄 보간하는 방법을 사용하는 경우, 누락 데이터의 근접 데이터나 과거 데이터를 바탕으로 누락 데이터를 임의로 복구하면 데이터를 최대한 보존할 수 있다. 그러나, 복 구된 데이터는 정확한 데이터는 아니므로 무리한 보간을 한다면 데이터의 품질이 좋지 않아 분석 및 학습의 결 과를 오염시킬 수 있다. 예를 들어, 데이터에서 누락 데이터를 포함하는 행을 일괄적으로 보간하게 되면, N3 열의 데이터는 T1 행, T10 행에 획득된 데이터만 활용하여 보간하기 때문에, 보간하여 생성된 데이터에 대한 품질이 떨어질 수 있다. 또한, N7 열, N8 열, N10 열의 데이터의 경우에도 불규칙적으로 누락 데이터가 발생하였기 때문에 보간의 정확도를 보장할 수 없다. 따라서, N3 열, N7 열, N8 열, N10 열의 각 데이터들은 데이터를 복구할 수 있는지, 데이터를 복구하는 것이 데 이터의 품질을 더 높이는 것인지 등에 대한 판단 방법이 필요하다. 도 14는 본 발명의 제2 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 본 발명의 일 실시예에 따른 프로세서는 적어도 하나의 특성 정보에 대해 수집된 데이터 중 처리하고자 하 는 제1 데이터의 구간을 설정한다(S1410). 한편, 특성 정보는 앞서 도 13과 관련하여 설명한 바와 같이, 수집한 데이터의 내용을 의미하며, 수집된 데이터 는 적어도 하나의 특성 정보에 대해 시계열적으로 수집된 것이다. 프로세서는 서버 등 외부장치로부터 수집된 데이터를 수신할 수 있으나, 전자장치가 수집한 데이터일 수 있고, 어느 하나에 한정되지 않는다. 프로세서는 필요한 시간 구간을 기준으로 제1 데이터의 구간을 설정할 수 있다. 이때, 제1 데이터는 수집 된 데이터 중 처리하고자 하는 대상이 된다. 수집된 데이터에 대해 분석을 진행할 경우 예를 들어, 클러스트링을 적용한 데이터 패턴 분류 적용 시, 누락 데 이터가 많은 데이터는 분석에서 제외하는 것이 성능을 높일 수 있다. 그러나 어느 정도의 누락 데이터를 포함하 는 데이터일 경우에는 보간 등을 이용하여 데이터를 복구한 후 최대한 활용하는 것이 성능을 높일 수 있다. 즉 누락 데이터를 포함하는 데이터에 대해서 어느 정도까지 허용하여 선별할 것인지에 대한 기준이 필요하다. 따라 서, 제1 데이터를 적절히 설정하는 것은 수집된 데이터의 처리 품질을 높이는 데 기여할 수 있고 올바른 결과를 도출할 수 있다. 일 실시예로, 프로세서는 제1 데이터의 복수의 구간 중 각 구간에 포함되는 누락 데이터의 정도에 기초하 여 제1 데이터의 제1 구간을 설정할 수 있다. 예를 들어, 수집된 데이터를 이용하여 시간 구간을 설정하는 경우, 제1 데이터로 설정할 수 있는 구간은 복수 개 존재할 수 있다. 복수의 구간 중에서 특정 구간에 포함되는 누락 데이터의 정도가 적으면, 다른 구간에 비해서 데이터의 품질이 좋다고 평가할 수 있다. 따라서, 프로세서 는 제1 데이터의 복수의 구간 중 포함되는 누락 데이터의 정도가 가장 적은 구간을 제1 데이터의 제1 구간 으로 설정할 수 있다. 또한, 프로세서는 제1 구간에 포함된 누락 데이터의 연속된 정도나, 제1 구간에 포함된 누락 데이터의 합 산 정도에 기초하여 제1 데이터의 제1 구간을 설정할 수 있다. 예를 들어, 누락 데이터가 3개 연속된 데이터를 포함하는 구간과, 누락 데이터가 3개 있으나 각각 산포되어 보간으로 보완이 가능한 데이터를 포함하는 구간의 경우, 후자의 구간이 보다 유효한 데이터로 제1 구간으로 설정될 가능성이 높다. 또 다른 실시예로, 프로세서는 수집된 데이터 내 전체 누락 데이터의 정도를 식별하고, 전체 누락 데이터 의 정도 대비 해당 구간에 포함된 누락 데이터의 정도가 적은 구간을 제1 데이터의 제1 구간으로 설정할 수 있 다. 본 발명의 일 실시예에 따른 프로세서는 제1 데이터의 구간에 포함된 누락 데이터를 재설정하여 제2 데이 터를 생성한다(S1420). 제1 데이터의 구간에는 누락 데이터뿐 아니라, 미수집 데이터를 포함할 수 있다. 미수집 데이터는 데이터를 수 집하는 도중 누락이 된 데이터를 제외하고, 서로 다른 데이터를 시계열적으로 나열하였을 때, 데이터 수집 시작 시간이나 수집 종료 시간이 달라 수집된 데이터가 없는 경우를 의미한다. 본 발명의 일 실시예에 따르면, 누락 데이터를 재설정한다는 것은 제1 데이터의 구간에 포함된 미수집 데이터를 누락 데이터로 설정하는 것을 의미한다. 기존 누락 데이터와 미수집 데이터의 형식을 동일하게 변경함으로써 데 이터 처리 시 동일한 처리를 받도록 통일하기 위함이다. 본 발명의 일 실시예에 따른 프로세서는 보완이 필요한 데이터를 선별하기 위해 마련된 데이터 보완 조건 에 기초하여 제2 데이터를 처리한다(S1430). 본 발명의 일 실시예에 따르면, 프로세서는 제2 데이터에 포함된 누락 데이터의 비율, 기간 및 정도 중 적 어도 하나에 기초하여 데이터 보완 조건을 설정할 수 있다. 이때, 데이터 보완 조건은 적어도 하나의 특성에 따 라 수집된 데이터 중 하나의 데이터 셋에 적용될 수 있다. 예를 들어, 복수의 특성에 대해 수집한 데이터의 경 우, 각 특성에 대응하여 수집된 데이터 셋에 적용될 수 있다. 또는, 하나의 특성에 대해 2 이상의 서로 다른 조 건에서 수집한 데이터의 경우, 각 조건에 대응하여 수집된 데이터 셋에 적용될 수 있다. 이때, 프로세서는 입력부를 통해 데이터 보완 조건에 대한 사용자 입력을 수신하여 설정하거나, 통신 부를 통해 외부장치로부터 데이터 보완 조건에 대한 데이터를 수신할 수 있다. 또한, 프로세서는 수 집된 데이터 혹은 제2 데이터를 처리하는 최적화된 데이터 보완 조건을 설정하기 위한 데이터 분석, 처리, 및 결과 정보 생성 중 적어도 일부를 규칙 기반 또는 인공지능알고리즘으로서 기계학습, 신경망 네트워크, 또는 딥 러닝 알고리즘 중 적어도 하나를 이용하여 수행할 수 있다. 이때, 제2 데이터를 처리하는 것은, 제2 데이터에서 데이터 보완 조건을 만족하는 제3 데이터를 선별하거나, 제 2 데이터 혹은 선별된 제3 데이터를 삭제하거나, 보간하는 등 다양한 데이터 처리를 수행하는 것을 포함한다. 보다 구체적으로, 데이터 보완 조건에 대해서 살펴보면, 프로세서는 제2 데이터에 포함된 누락 데이터의 비율이 기 정의된 값보다 높을 경우 제2 데이터를 처리할 수 있다. 프로세서는 제2 데이터에 포함된 누락 데이터의 기간이 기 정의된 값보다 높을 경우 제2 데이터를 처리할 수 있다. 이때, 누락 데이터의 기간은 연속된 누락 데이터에 대한 기간이거나, 제2 데이터에 산포된 누락 데이 터에 대응하는 기간을 합산한 기간을 의미할 수 있다. 프로세서는 제2 데이터에 포함된 누락 데이터의 정도가 기 정의된 값보다 높을 경우 제2 데이터를 처리할 수 있다. 본 발명의 일 실시예에 따르면, 데이터를 일괄적으로 삭제하거나, 보간하지 않고, 데이터에 포함된 누락 데이터 의 상황에 기초하여 보완할 데이터를 선별하여 작업을 수행하므로, 보다 합리적이고 품질 높은 데이터 처리가 가능하다. 본 발명의 일 실시예에 따르면, 시계열 데이터를 사용자가 원하는 품질에 기반하여 누락 데이터를 포함하더라도 이를 효율적으로 취사 선택하여 양질의 데이터만 사용할 수 있다. 도 15 내지 도 18은 앞서 도 14에서 설명한 동작 흐름에 따라 수집된 데이터를 처리하는 하나의 실시예를 순서 대로 도시한 것이다. 본 실시예에서는 하나의 특성에 대해 수집된 D1 내지 D7 데이터를 처리한다. 다만, 본 발 명은 이 실시예에 한정되지 않고, 복수의 특성에 대해 수집된 데이터를 처리할 수 있으며, 그 경우 도 15 내지 도 18에 도시된 데이터가 특성 별로 존재하거나, D1 내지 D7이 각각 서로 다른 특성일 수 있다. 도 15는 본 발명의 일 실시예에 따른 수행 방법에 따라 제1 데이터의 구간을 설정하는 모습을 도시한 도면이다. 도 15는 도 14의 S1410 단계와 관련하여 서술한다. 도 15는 누락 데이터와 미수집 데이터를 포함하는 데이터를 도시한다. 프로세서는 수집 된 데이터에서 처리하고자 하는 제1 데이터의 구간을 설정할 수 있다. 본 발명의 일 실시예에 따르 면, 프로세서는 전체 누락 데이터와 미수집 데이터를 고려하여 제1 데이터의 복수의 구간 중 제1 데이터의 제1 구간을 설정할 수 있다. 예를 들어, 현재 설정된 구간의 경우, 누락 데이터 및 미수집 데이터의 개수가 7개인 반면, 한 칸씩 앞으 로 구간을 설정하면, 누락 데이터 및 미수집 데이터의 개수가 9개이다. 또한, D3 행과 같이 연속된 누락데이터 의 개수가 3개로 늘어나 데이터의 품질이 더욱 저하되는 것을 알 수 있다. 본 발명의 일 실시예에 따르면, 수집된 데이터 중 제1 데이터의 구간을 설정함으로써, 데이터 보완 조건을 만족 하는 데이터를 선별하는 전처리 과정의 일환으로 데이터 품질을 더욱 높이는 데 기여할 수 있다. 도 16은 본 발명의 일 실시예에 따른 수행 방법에 따라 제2 데이터를 생성하는 모습을 도시한 도면이다. 도 16 은 도 14의 S1420 단계와 관련하여 서술한다. 도 16은 앞서 도 15에서 설정된 제1 데이터를 가공하여 생성된 제2 데이터를 도시한다. 본 발명의 일 실 시예에 따르면, 프로세서는 제1 데이터의 구간에 포함된 누락 데이터를 재설정하여 제2 데이 터를 생성한다. 이때, 누락 데이터를 재설정한다는 것은 제1 데이터의 구간에 포함된 미수집 데이터들을 누락 데이 터로 설정하는 것을 의미한다. 기존 누락 데이터와 미수집 데이터의 형식을 동일하게 변경함 으로써 데이터 처리 시 동일한 처리를 받도록 통일하기 위함이다. 도 17은 본 발명의 일 실시예에 따른 수행 방법에 따라 데이터 보완 조건에 기초하여 제2 데이터를 처리하는 모 습을 도시한 도면이다. 도 13은 본 발명의 일 실시예에 따른 수행 방법에 따라 제2 데이터를 처리하는 모습을 도시한 도면이다. 도 17 및 도 18은 도 14의 S1430 단계와 관련하여 서술한다. 본 발명의 일 실시예에 따르면, 프로세서는 제2 데이터에 포함된 누락 데이터의 비율, 기간 및 정도 중 적어도 하나에 기초하여 데이터 보완 조건을 설정할 수 있다. 보다 구체적으로, 데이터 보완 조건에 대해서 살펴보면, 프로세서는 제2 데이터에 포함된 누락 데이 터의 비율이 기 정의된 값보다 높을 경우 제2 데이터를 처리할 수 있다. 프로세서는 제2 데이터에 포함된 누락 데이터의 기간이 기 정의된 값보다 높을 경우 제2 데이 터를 처리할 수 있다. 이때, 누락 데이터의 기간은 연속된 누락 데이터에 대한 기간이거나, 제2 데이터에 산포된 누락 데이터에 대응하는 기간을 합산한 기간을 의미할 수 있다.프로세서는 제2 데이터에 포함된 누락 데이터의 정도가 기 정의된 값보다 높을 경우 제2 데이 터를 처리할 수 있다. 이때, 프로세서가 제2 데이터를 처리하는 것은, 제2 데이터에서 데이터 보완 조건을 만족하는 제3 데이터를 선별하는 것을 포함한다. 예를 들어, 도 17에 도시된 제2 데이터에 대해 설정된 데이터 보완 조건은 누락 데이터의 개수가 2 개 이상이고, 프로세서는 데이터 보완 조건을 만족하는 데이터를 보완이 필요한 제3 데이터로 선별 할 수 있다. 이때, 데이터 보완 조건은 적어도 하나의 특성에 따라 수집된 데이터 중 하나의 데이터 셋에 적용될 수 있다. 예를 들어, 제2 데이터가 도시 별 미세먼지 양을 측정한 데이터로써, D1 행 내지 D7 행은 서로 다른 도시 에서 수집된 미세먼지 양에 대한 데이터로 가정한다. 누락 데이터의 개수가 2개 이상인 도시를 식별하는 데이터 보완 조건은 D1 행 내지 D7 행 각각에 적용되어, 프로세서는 제2 데이터 중 D3 행과 D5 행의 데이터가 데이터 보완이 필요한 제3 데이터로 선별할 수 있다. 본 발명의 일 실시예에 따른 프로세서는 선별된 제3 데이터를 삭제하거나, 보간할 수 있다. 본 실시 예에서는 선별된 제3 데이터를 삭제하였다. 프로세서는 제3 데이터 선별 및 그에 따른 처리 후 남아있는 데이터 중 누락 데이터는 보간이 필요한 데이 터로 식별한다. 프로세서는 보간이 필요한 데이터에 대해 보간을 수행하고, 복구된 데이터를 활용하여 분석을 수행할 수 있다. 본 발명의 일 실시예에 따르면, 데이터 보완 조건에 기초하여 보완이 필요한 데이터를 선별하므로, 양질의 데이 터를 제공할 수 있다. 또한, 선별된 데이터를 처리한 데이터를 기초로 분석하므로 무리한 삭제 작업이나, 보간 작업을 피할 수 있어 보다 높은 품질의 데이터 분석을 수행할 수 있다. 도 19는 본 발명의 다른 일 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 본 발명의 일 실시예에 따른 프로세서는 수집된 데이터 중 이상 데이터를 처리한다(S1910). S1910 단계에 서 프로세서의 동작은 도 14의 S1420의 단계와 관련하여 제1 데이터 중 이상 데이터를 처리하는 동작일 수 있다. 수집된 데이터는 적어도 하나의 특성 정보에 대해 시계열적으로 수집된 것이다. 예를 들어 온도 센서로부터 수 집된 온도 데이터일 수 있다. 프로세서는 서버 등 외부장치로부터 수집된 데이터를 수신할 수 있으나, 전 자장치가 수집한 데이터일 수 있고, 어느 하나에 한정되지 않는다. 본 발명의 일 실시예에 따르면, 프로세서는 수집된 데이터 중 이상 데이터를 누락 데이터로 치환하여 처리 하거나, 이상 데이터 전후로 수집된 데이터를 이용하여 적절한 데이터로 보간할 수 있다. 일 실시예로, 프로세서는 수집된 데이터 중 처리된 이상 데이터를 포함하는 누락 데이터에 대한 정보를 식 별한다(S1920). S1920 단계에서 프로세서의 동작은 도 14의 S1430의 단계와 관련하여 제1 데이터 중 처리 된 이상 데이터를 포함하는 누락 데이터에 대한 정보를 식별하고, 식별된 누락 데이터에 대한 정보에 기초하여 적어도 하나의 누락 데이터 처리 방법을 이용하여 제2 데이터에 포함된 누락 데이터를 처리하는 동작일 수 있다. 본 발명의 일 실시예에 따르면, 수집된 데이터는 이상 데이터뿐 아니라, 누락 데이터를 포함할 수 있다. 본 발 명의 일 실시예에 따르면, 누락 데이터는 S1910 단계에서 이상 데이터로부터 치환된 누락 데이터와, 수집 데이 터에 기 포함된 누락 데이터를 포함한다. 본 발명의 일 실시예에 따르면, 누락 데이터에 대한 정보는 누락 데이터의 위치에 관한 정보 및 누락 데이터의 연속성에 관한 정보 중 적어도 하나를 포함한다. 본 발명의 일 실시예에 따르면, 누락 데이터의 위치에 관한 정 보란, 예를 들어, 테이블 형식으로 이루어진 데이터에서 누락 데이터가 위치한 행, 열에 관한 정보 등을 포함한 다. 또한, 누락 데이터의 연속성에 관한 정보란 누락 데이터가 연속된 정도(시간)에 관한 정보, 누락 데이터의 분포 양상 등 누락 데이터의 경향성이나 패턴을 식별할 수 있는 정보 등을 포함한다. 따라서, 프로세서는 누락 데이터의 위치에 관한 정보 및 누락 데이터의 연속성에 관한 정보 중 적어도 하 나를 포함하는 누락 데이터에 대한 정보를 식별할 수 있다. 본 발명의 일 실시예에 따른 프로세서는 누락 데이터에 대한 정보에 기초하여 적어도 하나의 누락 데이터 처리 방법을 이용하여 누락 데이터를 처리한다(S1930). 본 발명의 일 실시예에 따른 프로세서는 누락 데이터의 위치에 관한 정보 및/또는 누락 데이터의 연속성에 관한 정보에 기초하여 누락 데이터의 보완을 수행할 수 있다. 이때, 프로세서는 누락 데이터에 대한 정보에 기초하여 적어도 하나의 구간에 대응되는 누락 데이터를 처 리할 상기 적어도 하나의 누락 데이터 처리 방법을 식별할 수 있다. 프로세서는 누락 데이터에 대한 정보 에 따라 누락 데이터의 처리 정도를 조정하는 파라미터 정보를 함께 고려하여 누락 데이터를 보완할 수 있다. 본 실시예에 따른 파라미터 정보는 누락 데이터를 포함하는 구간에 관한 정보나, 누락 데이터 처리 방법에 관한 정보, 누락 데이터 처리 조건 등을 포함할 수 있다. 일 예로, 10개의 연속된 누락 데이터를 포함하는 구간에 대해 하나의 누락 데이터 처리 방법을 적용하여 처리할 수 있다. 또 다른 예로, 10개의 연속된 누락 데이터를 포함하는 구간을 세 구간으로 나누고, 각 구간에 대해 서 로 다른 누락 데이터 처리 방법을 적용하여 처리할 수 있다. 추가로, 각 구간에 대해서도 복수의 누락 데이터 처리 방법을 적용하여 각 처리 방법에 따라 보완된 데이터 값의 평균값이나, 일정 비율을 적용하여 최종 보완 데이터 값을 도출할 수 있다. 이때, 프로세서는 누락 데이터를 처리할 지 여부를 결정하는 조건, 즉 데이터 보완 여부를 결정하는 조건 에 기초하여 누락 데이터를 처리할 수 있다. 예를 들어, 전체 데이터 중 누락 데이터가 20% 이하인 경우에만 보 완을 진행하거나, 전체 데이터 중 누락 데이터가 30%를 넘지 않고, 10개 이하의 연속되는 누락 데이터에 대해서 만 보완을 수행하는 등의 조건에 따라 누락 데이터를 처리할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 누락 데이터에 대한 정보에 따라 누락 데이터의 처리 정도를 조정하기 위한 데이터 분석, 처리, 및 결과 정보 생성 중 적어도 일부를 규칙 기반 또는 인공지능 알고리즘으로 서 기계학습, 신경망 네트워크, 또는 딥러닝 알고리즘 중 적어도 하나를 이용하여 수행할 수 있다. 또한, 사용자의 요구에 적응적으로 누락 데이터 보완을 수행하기 위해, 프로세서는 적어도 하나의 구간에 대응되는 누락 데이터를 처리할 적어도 하나의 누락 데이터 처리 방법에 관한 사용자 입력을 입력부를 통 해 수신할 수 있다. 따라서, 프로세서는 사용자가 정의한 파라미터 정보에 따라 적어도 하나의 누락 데이 터 처리 방법을 적용하여 누락 데이터를 보완할 수 있다. 이때 누락 데이터 처리 방법은, 예를 들어, “mean”, “median”, “frequent”, “ffill”, “bfill”, “ linear_interpolation”, “spline_interpolation”, “stineman_interpolation”, “KNN”, “ARIMA”, “ Randomforest”, “NAOMI”, “BRITS” 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 본 발명의 일 실시예에 따르면, 누락 데이터를 포함하는 구간의 상태에 따라 최적화된 방법을 적용하여 보완하 므로 보다 합리적이고 품질 높은 데이터 처리가 가능하다. 본 발명의 일 실시예에 따르면, 데이터 활용 용도에 따라 보간 및 치환 방법을 달리 적용할 수 있으므로, 보다 품질 높은 데이터 보완을 수행할 수 있다. 도 20는 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 본 실시예에서는 누락 데이터를 처리하는 과정에 대해서 설명하고, 도 19에서 설명한 내용과 중복되는 내용은 도 19와 동일하게 적용되는 바, 이에 대해서 구체적인 설명은 생략한다. 본 발명의 일 실시예에 따른 프로세서는 수집된 데이터(이하, 수집 데이터(a)라 한다.) 중 이상 데이터 (b)를 처리한다. 보다 구체적으로, 이상 데이터(b)는 확실 이상 데이터(b1) 및 불확실 이상 데이터(b2)를 포함한다. 확실 이상 데이터(b1)는 수집 데이터(a)의 값이 가질 수 있는 최소-최대 범위를 넘어선 값을 가지는 등 명확하게 판단되는 오류 데이터를 의미한다. 불확실 이상 데이터(b2)는 명확한 오류는 아니지만 해당 데이터 전후로 획득된 데이터 와 비교 시 확연한 차이를 보이는 등과 같이 이상 데이터인지 불확실해 보이는 이상 데이터를 의미한다. 프로세서는, 수집 데이터(a) 중 확실 이상 데이터(b1) 및 불확실 이상 데이터(b2)를 포함하는 이상 데이터 (b)를 식별하고, 확실 이상 데이터(b1) 및 불확실 이상 데이터(b2)를 각각 처리한다. 일 예로, 프로세서는 수집 데이터(a) 중 확실 이상 데이터(b1)는 누락 데이터로 치환하여 처리하거나, 불확실 이상 데이터(b2)는 누 락 데이터로 치환하여 처리하거나, 불확실 이상 데이터(b2) 전후로 수집된 데이터를 이용하여 적절한 데이터로보간할 수 있다. 이때, 프로세서는 입력부를 통해 불확실 이상 데이터(b2)의 값을 결정하는 사용자입 력을 수신할 수 있다. 본 발명의 일 실시예에 따른 프로세서는 수집 데이터(a) 중 처리된 이상 데이터를 포함하는 누락 데이터 (c)에 대한 정보를 식별한다. 본 발명의 일 실시예에 따른 프로세서는 누락 데이터(c)에 대한 정보에 기초하여 적어도 하나의 누락 데이 터 처리 방법을 이용하여 누락 데이터(c)를 처리한다. 결과적으로, 수집 데이터(a)를 처리한 처리 데이터 (d)를 획득하게 된다. 본 발명의 일 실시예에 따르면, 이상 데이터를 확실 이상 데이터 및 불확실 이상 데이터로 구별하여 처리하므로 보다 정밀하게 이상 데이터를 처리할 수 있다. 도 21은 본 발명의 다른 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 21의 동작 모습은 복수의 수집 데이터(a)를 각각 처리하여 획득한 복수의 처리 데이터(d)를 통합하는 방법에 대해서 설명한다. 본 발명의 일 실시예에 따르면, Data1, Data2, …, DataN을 포함하는 복수의 수집 데이터(a)를 통합하기 위해서, 각각의 수집 데이터에 대해 도 14 및 도 15에서 설명한 데이터 처리가 선행되어야 한다. 각 수집 데이터(a)에 대해 데이터 처리 과정을 거쳐 획득된 처리 데이터(d)는 Data1’, Data2’, …, DataN’을 포함한다. 본 발명의 일 실시예에 따른 프로세서는 획득한 처리 데이터(d)를 결합한다. 처리 데이터(d)를 결합하는 과정에 대해 표 11의 데이터를 참조하여 구체적으로 살펴본다. 표 2에 나타난 데이 터 1, 데이터 2, 데이터 3은 개별적으로 데이터 처리가 완료된 처리 데이터(d)라고 가정한다. 표 11 데이터 1 1/1일 0시 0분 ~ 1/10일 24시 0분 1분 단위로 측정 데이터 2 1/1일 3시~ 1/10일 23시 1시간 단위로 측정 데이터 3 1/1일 0시~ 1/11일 24시 3시간 단위로 측정 본 발명의 일 실시예에 따르면, 프로세서는 복수의 처리 데이터(d)의 결합구간을 표 3과 같이 설정할 수 있다. 표 12 결합구간 1 1/1일 3시~ 1/10일 23시 결합구간 2 1/1일 0시 0분 ~ 1/10일 24시 0분 본 발명의 일 실시예에 따르면, 프로세서는 결합 구간에 따라 누락 데이터를 재설정할 수 있다. 본 발명의 일 실시예에 따르면, 누락 데이터를 재설정한다는 것은 수집 데이터를 수집한 시간 구간보다 확장하여 미수집 데이터가 발생하는 경우, 미수집 데이터를 누락 데이터로 설정하는 것을 의미한다. 기존 누락 데이터와 미수집 데이터의 형식을 동일하게 변경함으로써 데이터 처리 시 동일한 처리를 받도록 통일하기 위함이다.예를 들어, 결합구간을 결합구간 1로 설정하는 경우, 데이터 1의 일부 데이터, 데이터 2의 전체 데이터, 데이터 3의 일부 데이터를 사용하게 되어 추가적인 누락 데이터의 재설정이 불필요하다. 그러나, 결합구간을 결합구간 2로 설정하는 경우, 데이터 1은 전체 데이터, 데이터 3은 일부 데이터를 사용하여 누락 데이터 설정이 불필요한 반면, 데이터 2는 1/1일 0시 이후 1/1일 3시 이전과, 1/10일 23시 이후 1/10일 24 시 이전의 데이터가 없으므로, 해당 시간에 대응하는 미수집 데이터에 대해 누락 데이터의 재설정이 필요하다. 본 발명의 일 실시예에 따르면, 프로세서는 복수의 처리 데이터(d)의 데이터 수집 주기에 기초하여 데이터 를 결합할 수 있다. 일 예로, 프로세서는 복수의 처리 데이터(d)의 데이터 수집 주기에 기초하여 데이터의 인덱싱을 다시 수행(reindexing) 할 수 있다. 보다 구체적으로, 프로세서는 복수의 처리 데이터(d)의 데이 터 수집 주기에 기초하여 복수의 처리 데이터(d) 각각을 업샘플링(upsampling) 또는 다운샘플링(downsampling) 하여 결합할 수 있다. 예를 들어, 결합 주기를 1분 단위로 할 경우 데이터 2와 데이터 3에 대한 업샘플링이 필요하고, 결합 주기를 1 시간 단위로 할 경우 데이터 1은 다운샘플링, 데이터 3은 업샘플링이 필요하다. 이때, 다운샘플링은 평균과 같은 널리 알려진 통계적 계산 방법을 활용할 수 있으나, 업샘플링은 처리 하는 방 법이 매우 다양하며, 이에 따른 데이터 복원 효과도 매우 다르기 때문에 앞서 도 21에서 서술한 누락 데이터 처 리 방법 중 적어도 하나를 적용하여 수행할 수 있다. 다만, 이는 예시에 불과한 바, 업샘플링과 다운샘플링을 수행하는 방법은 제한없이 적용 가능하다. 데이터를 결합하고 난 뒤, 프로세서는 결합한 데이터에 다시 데이터 처리를 수행할 수 있다. 이때, 데이터 처리는 데이터 처리와 동일할 수 있으며, 데이터 처리와 데이터 처리는 동일 프로세서 혹은 서로 다른 프로세서에서 수행될 수 있다. 보다 구체적으로, 프로세서는, 복수의 수집 데이 터를 각각 처리하여 복수의 처리 데이터를 획득하고, 복수의 처리 데이터를 결합하고, 결합된 데이터 중 이상 데이터를 처리하고, 결합된 데이터 중 처리된 이상 데이터를 포함하는 누락 데이터에 대한 정보를 식별하고, 누 락 데이터에 대한 정보에 기초하여 적어도 하나의 누락 데이터 처리 방법을 이용하여 누락 데이터를 처리할 수 있다. 프로세서는 누락 데이터를 처리하여 데이터를 통합할 수 있다. 본 발명의 일 실시예에 따르면, 복수의 단일 데이터가 결합된 데이터에 대해 적용할 수 있어, 데이터를 결합하 는 경우에도 품질 높은 데이터 보완을 수행할 수 있다. 이와 같은 본 발명의 일 실시예에 의하면, 주기적 특성을 지닌 시계열 데이터를 기반으로 품질 검증을 수행하여 불량 데이터를 처리함으로써, 높은 데이터 품질을 가진 데이터를 기반으로 학습 및 분석에 활용 가능하여 전체 적인 성능 결과를 향상시킬 수 있다. 또한, 데이터에 포함된 누락 데이터의 상황에 기초하여 보완할 데이터를 선별하여 작업을 수행하므로, 보다 합 리적이고 품질 높은 데이터 처리가 가능하다. 또한, 데이터 보완 조건에 기초하여 양질의 데이터를 제공하므로 무리한 삭제 작업이나, 보간 작업을 피할 수 있어 보다 높은 품질의 데이터 분석을 수행할 수 있다. 이와 더불어, 누락 데이터를 포함하는 구간의 상태에 따라 최적화된 방법을 적용하여 보완하여 보다 합리적이고 품질 높은 데이터 처리가 가능하며, 데이터 활용 용도에 따라 보간 및 치환 방법을 달리 적용할 수 있으므로, 보다 품질 높은 데이터 보완을 수행할 수 있다. 또한, 복수의 단일 데이터가 결합된 데이터에 대해 적용할 수 있어, 데이터를 결합하는 경우에도 품질 높은 데이터 보완을 수행할 수 있다. 이상에서 전술한 본 발명의 일 실시예들은, 하드웨어인 서버와 결합되어 실행되기 위해 프로그램(또는 어플리케 이션)으로 구현되어 매체에 저장될 수 있다. 상기 전술한 프로그램은, 상기 컴퓨터가 프로그램을 읽어 들여 프로그램으로 구현된 상기 방법들을 실행시키기 위하여, 상기 컴퓨터의 프로세서(CPU)가 상기 컴퓨터의 장치 인터페이스를 통해 읽힐 수 있는 C, C++, JAVA, 기 계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 상기 방법들을 실행하는 필요 한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Functional Code)를 포함할 수 있고, 상기 기능들을 상기 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수 있다. 또한, 이러한 코드는 상기 기능들을 상기 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 상기 컴퓨 터의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조되어야 하는지에 대한 메모리 참조관련 코드를 더 포함할 수 있다. 또한, 상기 컴퓨터의 프로세서가 상기 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠 한 다른 컴퓨터나 서버 등과 통신이 필요한 경우, 코드는 상기 컴퓨터의 통신 모듈을 이용하여 원격에 있는 어 떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등 에 대한 통신 관련 코드를 더 포함할 수 있다. 상기 저장되는 매체는, 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반 영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상기 저 장되는 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있지만, 이에 제한되지 않는다. 즉, 상기 프로그램은 상기 컴퓨터가 접속할 수 있는 다양한 서버 상의 다양한 기록매체 또는 사용자의 상기 컴퓨터상의 다양한 기록매체에 저장될 수 있다. 또한, 상기 매체는 네트워크로 연결된 컴퓨터 시 스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장될 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2022-0117403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2022-0117403", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 전자장치의 구성을 도시한 블록도이다. 도 2는 본 발명의 제1 실시예에 따른 전자장치에 의해 수행되는 동작 흐름도를 도시한 도면이다. 도 3은 본 발명의 일 실시예에서의 통합 주기를 결정하는 내용을 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에서의 결정된 통합 주기의 일 예시를 도시한 도면이다. 도 5는 본 발명의 일 실시예에서의 통합 구간을 결정하는 내용을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에서의 결정된 통합 구간의 일 예시를 도시한 도면이다. 도 7은 본 발명의 일 실시예에서의 특성정보 기반 데이터 통합 기법을 설명하기 위한 도면이다. 도 8은 본 발명의 일 실시예에서의 데이터 셋에 대한 샘플링 결과의 일 예시를 도시한 도면이다. 도 9는 본 발명의 일 실시예에서의 결측치 처리 방법을 설명하기 위한 도면이다. 도 10은 특성정보 기반 데이터 통합 기법에 따른 데이터 통합 결과의 일 예시를 도시한 도면이다. 도 11은 본 발명의 일 실시예에서의 심층신경망 기반 데이터 통합 기법을 설명하기 위한 도면이다. 도 12는 본 발명의 일 실시예에서의 심층신경망 기반 데이터 통합 기법에 따른 데이터 변환 결과 예시를 도시한 도면이다. 도 13은 누락 데이터를 포함하는 데이터를 도시한 도면이다. 도 14는 본 발명의 제2 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 도 15는 본 발명의 일 실시예에 따른 수행 방법에 따라 제1 데이터의 구간을 설정하는 모습을 도시한 도면이다. 도 16은 본 발명의 일 실시예에 따른 수행 방법에 따라 제2 데이터를 생성하는 모습을 도시한 도면이다. 도 17은 본 발명의 일 실시예에 따른 수행 방법에 따라 데이터 보완 건에 기초하여 제2 데이터를 처리하는 모습 을 도시한 도면이다. 도 18은 본 발명의 일 실시예에 따른 수행 방법에 따라 제2 데이터를 처리하는 모습을 도시한 도면이다. 도 19는 본 발명의 다른 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 도 20은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 21은 본 발명의 다른 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다."}
