{"patent_id": "10-2022-0085522", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0106719", "출원번호": "10-2022-0085522", "발명의 명칭": "인스턴트 메시징 대상의 검색 방법, 장치, 전자 기기 및 저장 매체", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "판, 치우통"}}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인스턴트 메시징 대상의 검색 방법에 있어서,제1 대상의 검색 요청을 수신하고, 상기 검색 요청의 유형을 결정하는 단계; 상기 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진을 기반으로 상기 제1 대상의 적어도 하나의 리콜 후보 세트를 획득하는 단계; 상기 검색 요청의 검색 키워드 및 상기 적어도 하나의 리콜 후보 세트에 따라, 상기 검색 키워드에 대응되는 적어도 하나의 후보 대상을 획득하는 단계; 각 상기 후보 대상의 특징 정보를 획득하는 단계; 및 상기 특징 정보에 따라, 각 상기 후보 대상을 정렬하여 상기 검색 요청에 응답하는 단계; 를 포함하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 방법."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 검색 요청의 검색 키워드 및 상기 적어도 하나의 리콜 후보 세트에 따라, 상기 검색 키워드에 대응되는 적어도 하나의 후보 대상을 획득하는 단계는, 상기 적어도 하나의 리콜 후보 세트를 병합하고, 병합된 상기 적어도 하나의 리콜 후보 세트 중의 같은 대상에대해 중복 제거 처리를 수행하여, 타겟 후보 세트를 획득하는 단계; 상기 검색 요청의 검색 키워드에 따라, 상기 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수행하는 단계; 및매치 결과에 따라, 상기 타겟 후보 세트에서 상기 검색 키워드에 대응되는 적어도 하나의 후보 대상을 결정하는단계; 를 포함하는, 것을 특징으로 하는 인스턴트 메시징 대상의 검색 방법."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 검색 요청의 검색 키워드에 따라, 상기 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수행하는 단계는,상기 검색 요청의 검색 키워드에 따라, 여러 가지 매치 레벨을 기반으로 상기 타겟 후보 세트 중의 각 대상의각 필드에 대해 매치 처리를 수행하는 단계를 포함하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 방법."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 특징 정보에 따라, 각 상기 후보 대상을 정렬하여 상기 검색 요청에 응답하는 단계는,상기 특징 정보에 따라, 각 상기 후보 대상의 클릭률 예측 점수를 결정하는 단계; 각 상기 후보 대상의 클릭률 예측 점수에 따라, 상기 적어도 하나의 후보 대상을 정렬하는 단계; 및 정렬 결과에 따라 상기 적어도 하나의 후보 대상을 디스플레이하여, 상기 검색 요청에 응답하는 단계; 를 포함공개특허 10-2022-0106719-3-하는, 것을 특징으로 하는 인스턴트 메시징 대상의 검색 방법."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 리콜 후보 세트의 소스는,제1 기간에서 제1 대상이 클릭한 대상; 제2 기간에서 제1 대상이 소통한 미리 설정된 수량의 대상; 및제3 기간에서 제1 대상과의 친밀도 대상; 중 적어도 하나를 포함하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 방법."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 친밀도 대상을 결정하는 단계는,각 대상을 노드로 하고, 상기 각 대상의 관계 데이터를 기반으로 관계도 모델을 구축하는 단계; 상기 관계도 모델에서 각 대상 노드와 타겟 대상 노드 사이의 유사도를 계산하는 단계 - 상기 타겟 대상 노드는상기 대상 노드의 일차 홉 대상 노드임 - ; 및유사도가 미리 설정된 임계값보다 큰 타겟 대상 노드를 상기 대상 노드의 친밀도 대상으로 하는 단계; 를 포함하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 방법."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 검색 요청의 유형이 제2 유형인 것에 응답하여, 상기 인스턴트 메시징 시스템의 서버 검색 엔진을 기반으로 상기 검색 키워드에 따라 인스턴트 메시징 대상 검색을 수행하는 단계를 더 포함하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 방법."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인스턴트 메시징 대상의 검색 장치에 있어서,제1 대상의 검색 요청을 수신하는 수신 모듈; 상기 검색 요청의 유형을 결정하는 제1 결정 모듈; 상기 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진을 기반으로 상기 제1 대상의 적어도 하나의 리콜 후보 세트를 획득하는 제1 획득 모듈; 상기 검색 요청의 검색 키워드 및 상기 적어도 하나의 리콜 후보 세트에 따라, 상기 검색 키워드에 대응되는 적어도 하나의 후보 대상을 획득하는 제2 획득 모듈; 각 상기 후보 대상의 특징 정보를 획득하는 제3 획득 모듈; 및 상기 특징 정보에 따라, 각 상기 후보 대상을 정렬하여 상기 검색 요청에 응답하는 응답 모듈; 을 포함하는, 것을 특징으로 하는 인스턴트 메시징 대상의 검색 장치."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,공개특허 10-2022-0106719-4-상기 제2 획득 모듈은,상기 적어도 하나의 리콜 후보 세트를 병합하고, 병합된 상기 적어도 하나의 리콜 후보 세트 중의 같은 대상에대해 중복 제거 처리를 수행하여, 타겟 후보 세트를 획득하고;상기 검색 요청의 검색 키워드에 따라, 상기 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수행하고; 매치 결과에 따라, 상기 타겟 후보 세트에서 상기 검색 키워드에 대응되는 적어도 하나의 후보 대상을결정하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 장치."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제2 획득 모듈은,상기 검색 요청의 검색 키워드에 따라, 여러 가지 매치 레벨을 기반으로 상기 타겟 후보 세트 중의 각 대상의각 필드에 대해 매치 처리를 수행하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 장치."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 응답 모듈은,상기 특징 정보에 따라, 각 상기 후보 대상의 클릭률 예측 점수를 결정하고; 각 상기 후보 대상의 클릭률 예측 점수에 따라, 상기 적어도 하나의 후보 대상을 정렬하고; 정렬 결과에 따라 상기 적어도 하나의 후보 대상을 디스플레이하여, 상기 검색 요청에 응답하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 장치."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 리콜 후보 세트의 소스는,제1 기간에서 제1 대상이 클릭한 대상; 제2 기간에서 제1 대상이 소통한 미리 설정된 수량의 대상; 및제3 기간에서 제1 대상과의 친밀도 대상; 중 적어도 하나를 포함하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 장치."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,각 대상을 노드로 하고, 상기 각 대상의 관계 데이터를 기반으로 관계도 모델을 구축하고, 상기 관계도 모델에서 각 대상 노드와 타겟 대상 노드 사이의 유사도를 계산하는 제2 결정 모듈을 더 포함하며, 상기 타겟 대상 노드는 상기 대상 노드의 일차 홉 대상 노드이고, 유사도가 미리 설정된 임계값보다 큰 타겟 대상 노드를 상기 대상 노드의 친밀도 대상으로 하는,것을 특징으로 하는 인스턴트 메시징 대상의 검색 장치."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항 내지 제13항 중 어느 한 항에 있어서,공개특허 10-2022-0106719-5-상기 검색 요청의 유형이 제2 유형인 것에 응답하여, 상기 인스턴트 메시징 시스템의 서버 검색 엔진을 기반으로 상기 검색 키워드에 따라 인스턴트 메시징 대상 검색을 수행하는 검색 모듈을 더 포함하는, 것을 특징으로 하는 인스턴트 메시징 대상의 검색 장치."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 기기에 있어서,적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서에 통신 가능하게 연결되는 메모리; 를 포함하고,상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제7항 중 어느 한 항의 방법을 수행하도록 하는, 것을 특징으로 하는 전자 기기."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체에 있어서, 상기 컴퓨터 명령은 컴퓨터가 제1항 내지 제7항 중 어느 한 항의 방법을 수행하도록 하는,것을 특징으로 하는 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-0085522", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "비일시적 컴퓨터 판독 가능 저장 매체에 저장된 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램이 프로세서에 의해 수행될 경우 제1항 내지 제7항 중 어느 한 항의 방법이 구현되는, 것을 특징으로 하는 컴퓨터 프로그램."}
{"patent_id": "10-2022-0085522", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인스턴트 메시징 대상의 검색 방법, 장치, 전자 기기 및 저장 매체를 제공하고, 인공지능 분야에 관한 것으로, 특히 딥러닝 분야, 클라우드 컴퓨팅 분야 및 지능 검색 분야에 관한 것이다. 구체적인 구현 수단은, 제1 대상의 검색 요청을 수신하고, 검색 요청의 유형을 결정하는 단계; 검색 요청의 유형이 제1 유형인 것에 응답하 (뒷면에 계속)"}
{"patent_id": "10-2022-0085522", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 분야에 관한 것으로, 특히 딥러닝 분야, 클라우드 컴퓨팅 분야 및 지능 검색 분야에 관한 것으로, 특히 인스턴트 메시징 대상의 검색 방법, 장치, 전자 기기 및 저장 매체에 관한 것이다."}
{"patent_id": "10-2022-0085522", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지식 경제의 시대에서, 현대 기업의 가장 중요한 생산 요소는 사람과 정보이고, 양자는 공동으로 기업의 핵심 경쟁력을 구축한다. 정보의 흐름을 더 잘 추진하고, 인원 조직을 더 잘 협조하기 위해, 현대 기업은 흔히 기업 IM(Instant Messaging, 인스턴트 메시징) 소프트웨어를 사용하여 당해 수요를 만족한다."}
{"patent_id": "10-2022-0085522", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인스턴트 메시징 대상의 검색 방법, 장치, 전자 기기 및 저장 매체를 제공하고, 인스턴트 메시징 소 프트웨어의 검색 장면에 적용될 수 있다."}
{"patent_id": "10-2022-0085522", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 제1 측면에 따르면, 인스턴트 메시징 대상의 검색 방법을 제공하고, 상기 방법은, 제1 대상의 검색 요청을 수신하고, 상기 검색 요청의 유형을 결정하는 단계; 상기 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진을 기반으 로 상기 제1 대상의 적어도 하나의 리콜 후보 세트를 획득하는 단계; 상기 검색 요청의 검색 키워드 및 상기 적어도 하나의 리콜 후보 세트에 따라, 상기 검색 키워드에 대응되는 적 어도 하나의 후보 대상을 획득하는 단계; 각 상기 후보 대상의 특징 정보를 획득하는 단계; 및 상기 특징 정보에 따라, 각 상기 후보 대상을 정렬하여 상기 검색 요청에 응답하는 단계; 를 포함한다. 본 발명의 제2 측면에 따르면, 인스턴트 메시징 대상의 검색 장치를 제공하고, 상기 장치는, 제1 대상의 검색 요청을 수신하는 수신 모듈; 상기 검색 요청의 유형을 결정하는 제1 결정 모듈; 상기 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진을 기반으 로 상기 제1 대상의 적어도 하나의 리콜 후보 세트를 획득하는 제1 획득 모듈; 상기 검색 요청의 검색 키워드 및 상기 적어도 하나의 리콜 후보 세트에 따라, 상기 검색 키워드에 대응되는 적 어도 하나의 후보 대상을 획득하는 제2 획득 모듈; 각 상기 후보 대상의 특징 정보를 획득하는 제3 획득 모듈; 및 상기 특징 정보에 따라, 각 상기 후보 대상을 정렬하여 상기 검색 요청에 응답하는 응답 모듈; 을 포함한다. 본 발명의 제3 측면에 따르면, 전자 기기를 제공하고, 상기 전자 기기는, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 가능하게 연결되는 메모리; 를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적 어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서가 상기 제1 측면의 방법을 수행하도록 한 다. 본 발명의 제4 측면에 따르면, 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 컴퓨터 명령은 상기 컴퓨터가 상기 제1 측면의 방법을 수행하는데 사용된다. 본 발명의 제5 측면에 따르면, 비일시적 컴퓨터 판독 가능 저장 매체에 저장된 컴퓨터 프로그램을 제공하고, 상 기 컴퓨터 프로그램이 프로세서에 의해 수행될 경우 상기 제1 측면의 방법이 구현된다. 이해해야 할 것은, 본 부분에서 설명하는 내용은 본 발명의 실시예의 관건 또는 중요한 특징을 식별하기 위한 것이 아니고, 본 발명의 범위를 한정하기 위한 것도 아니다. 본 발명의 기타 특징들은 이하의 명세서를 통해 용 이하게 이해될 것이다."}
{"patent_id": "10-2022-0085522", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 기술 수단에 따르면, 서버의 비교적 큰 리콜 세트로 인해 일부 리콜이 불량하고, 빅 리콜 세트로 인 해 성능이 더 늦춰지는 문제를 효과적으로 방지할 수 있음으로, 응답 소요 시간을 감소하고, 시스템 성능을 향 상시킬 수 있다. 또한, 본 발명은 후보 대상의 특징 정보를 통해 각 후보 대상을 정렬하여, 검색 결과의 정확도 를 향상시킬 수 있고, 사용자가 신속히 자신의 검색 타겟을 찾도록 도와주며, 사용자의 검색 및 근무 효율을 향 상시킬 수 있다."}
{"patent_id": "10-2022-0085522", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 결합하여 본 발명의 예시적인 실시예를 설명한다. 여기에는 이해를 돕기 위해 본 발명의 실시예의 다양한 세부 사항을 포함하고, 실시예들은 단지 예시적인 것으로 간주되어야 한다. 때문에 본 발명이 속하는 기술 분야의 통상의 기술자는 본 발명의 범위 및 사상을 벗어나지 않고 여기서 설명된 실시예에 대해 다 양한 변경과 수정을 할 수 있다는 것을 인식해야 한다. 동시에 명확성과 간결성을 위해 하기의 설명에서 공지 기능과 구조에 대한 설명은 생략한다. 설명해야 할 것은, 본 발명의 기술 수단에서, 언급된 사용자 개인 정보의 획득, 저장 및 응용 등은, 모두 관련 법률 및 법규의 규정에 해당되고, 공서양속을 위배하지 않는다. 또한, 본 발명에 언급된 사용자 개인 정보는 사 용자가 알고 동의한 상황에서 획득, 저장 및 응용된 것이다. 지식 경제의 시대에서, 현대 기업의 가장 중요한 생산 요소는 사람과 정보이고, 양자는 공동으로 기업의 핵심 경쟁력을 구축한다. 정보의 흐름을 더 잘 추진하고, 인원 조직을 더 잘 협조하기 위해, 현대 기업은 흔히 기업 IM 소프트웨어를 사용하여 당해 수요를 만족한다. 당해 도구에는 모두 검색 엔진 능력이 통합되어 있고, 연락인, 그룹, 파일 및 메시지 기록 등을 검색할 수 있고, 사용자의 검색 및 근무 효율을 대폭으로 향상시킨다. 관련 기술에서, 기업 IM의 검색 해결 수단은 일반적으로 아래의 내용을 포함한다. 서버 원격 호출 방식을 통해 검색 능력을 구현하고; 리콜 세트는 기업 내의 전체 세트를 사용하고; 정렬 전략은 관련성만 참조한다. 그러나, 관련 기술의 해결 수단은 일반적으로 서버 성능이 비교적 차하고, 응답 시간이 비교적 긴 문제, 예를 들면, 100ms～500ms사이의 응답 시간; 비교적 큰 리콜 세트로 인해 일부 리콜이 불량하고, 동시에 빅 리콜 세트 로 인해 성능이 더 늦춰지는 문제; 정렬 전략은 관련성만 참조하여, 사용자가 비교적 많은 시간을 낭비하여 자 신의 검색 타겟을 찾는 경우를 초래하고, 사용자의 검색 및 근무 효율을 저하시키는 문제; 를 포함한다. 이로하여, 본 발명은 인스턴트 메시징 대상의 검색 방법, 장치, 전자 기기 및 저장 매체를 제공한다. 아래는 도 면을 참조하여 본 발명의 실시예의 인스턴트 메시징 그룹의 검색 방법, 장치, 전자 기기 및 저장 매체를 설명한 다. 도1은 본 발명의 실시예에 제공된 인스턴트 메시징 대상의 검색 방법의 흐름도이다. 설명해야 할 것은, 본 발명 의 실시예의 인스턴트 메시징 대상의 검색 방법은 인스턴트 메시징 대상의 검색 장치에 의해 수행될 수 있고, 당해 장치는 소프트웨어 및/또는 하드웨어의 방식을 사용하여 구현될 수 있고, 서버 또는 사용자 단말 등 전자 기기에 병합될 수 있다. 도1에 도시된 바와 같이, 당해 인스턴트 메시징 대상의 검색 방법은 단계101 내지 단계105를 포함할 수 있다. 단계101에서, 제1 대상의 검색 요청을 수신하고, 검색 요청의 유형을 결정한다. 여기서, 본 발명의 실시예에 언급된 제1 대상은 인스턴트 메시징 소프트웨어를 사용하는 사용자로 이해할 수 있 다. 본 발명의 실시예에서, 검색 요청은 사용자가 인스턴트 메시징 소프트웨어에서 대상 검색을 수행하는 요청이고, 사용자는 텍스트 내용을 입력하여 검색 키워드로 사용하여 대상 검색을 수행할 수 있다. 여기서, 검색 키워드는 대상의 명칭일 수 있다. 설명해야 할 것은, 대상 검색은 연락인 또는 그룹에 대한 검색이고, 또는, 파일, 메시 지 기록 등 내용에 대한 검색일 수 있고, 여기서 구체적인 한정을 하지 않는다. 주의해야 할 것은, 상이한 검색 내용은, 상이한 유형의 검색 요청에 대응된다. 일 예시로서, 검색 요청의 유형 은 제1 유형 및 제2 유형으로 나눌 수 있다. 여기서, 당해 제1 유형은 클라이언트의 검색 엔진을 사용하여 검색 요청에 응답하는 유형으로 이해할 수 있고; 제2 유형은 서버의 검색 엔진을 사용하여 검색 요청에 응답하는 유 형으로 이해할 수 있다. 예를 들면, 사용자가 자주 사용하고, 자주 찾는 내용(예를 들면, 검색 연락인, 검색 그 룹 등)을 검색 요청의 제1 유형으로 간주할 수 있다. 즉, 클라이언트의 검색 엔진은 사용자가 자주 사용하고, 자주 찾는 내용에 대해 검색 능력을 제공할 수 있다. 또 예를 들면, 사용자가 자주 사용하지 않고, 자주 찾지 않는 내용(예를 들면, 검색 서비스 계정, 공식 계정 등)을 검색 요청의 제2 유형으로 간주할 수 있다. 즉, 서버의 검색 엔진은 사용자가 자주 사용하지 않고, 자주 찾지 않는 내용에 대해 검색 능력을 제공할 수 있다. 단계102에서, 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진 을 기반으로 제1 대상의 적어도 하나의 리콜 후보 세트를 획득한다. 선택적으로, 제1 대상이 시작한 검색 요청의 유형이 제1 유형인 것을 결정할 경우, 예를 들면, 제1 대상이 시작 한 연락인 또는 그룹 등 자주 사용하고 또는 자주 찾는 내용에 대해, 인스턴트 메시징 시스템의 클라이언트 검 색 엔진을 기반으로 검색 기능을 제공할 수 있다. 이때, 클라이언트 검색 엔진은 제1 대상의 적어도 하나의 리 콜 후보 세트를 획득할 수 있어, 검색 요청의 검색 키워드에 따라 당해 리콜 후보 세트에서 검색을 수행하는데 편리하다. 본 발명의 일부 실시예에서, 적어도 하나의 리콜 후보 세트의 소스는, 제1 기간에서 제1 대상이 클릭한 대상; 및/또는; 제2 기간에서 제1 대상과 소통한 미리 설정된 수량의 대상; 및/또는; 제3 기간에서 제1 대상과의 친밀 도 대상; 을 포함하나, 이에 한정되지 않는다. 설명해야 할 것은, 기업 IM 사용자의 검색 클릭 로그를 수집하여 분석할 경우, 평균 87% 이상의 검색 및 클릭 대상은 사용자가 지난 1년 내에(전 1분부터 일년 전까지) 소통 및 연략한 대상임을 발견했다. 즉, 사용자 사이 는 안정적인 업무 관계가 존재하고, 사용자도 당해 안정적인 관계의 연락인 또는 그룹을 검색하는 경향이 있다. 따라서 클라이언트 검색 엔진의 리콜 후보 세트의 소스는 예를 들면, 사용자가 최근 클릭한 대상(예를 들면 시 간 상한은 1개월 내일 수 있음); 사용자의 최근 300개의 소통 대상(예를 들면, 시간 상한은 1년 내일 수 있음); 서버에서 전송된 친밀도 대상(예를 들면 시간 상한은 1년 내일 수 있음)으로 구성될 수 있다. 이로하여, 클라이 언트 검색 엔진에서 제공되는 리콜 후보 세트는 비교적 작으며, 응답 소요 시간을 감소하고, 시스템 성능을 향 상시킬 수 있다. 선택적으로, 친밀도 대상은 클라이언트 검색 엔진에 의해 결정된 것일 수 있고, 또는 서버에 의해 결정된 것일 수도 있다. 일 예시로서, 서버에 의해 제1 대상의 친밀도 대상을 결정할 수 있고, 일정한 시간 간격으로 클라이 언트에 전송한다. 선택적으로, 서버는 각 대상을 노드로 할 수 있고, 각 대상의 관계 데이터를 기반으로 관계도 모델을 구축하고; 관계도 모델에서 각 대상 노드와 타겟 대상 노드 사이의 유사도를 계산하며; 여기서, 타겟 대 상 노드는 대상 노드의 일차 홉 대상 노드이고; 유사도가 미리 설정된 임계값보다 큰 타겟 대상 노드를 대상 노 드의 친밀도 대상으로 한다. 여기서, 당해 관계 데이터는 소통 데이터, 이메일 데이터, 회의 초대 데이터 및 리 포트 관계 등 정보를 포함하나 이에 한정되지 않는다. 일 예시로서, 대상이 기업 IM 소프트웨어를 사용하는 사용자인 것을 예로 들면, 사용자의 소통 데이터, 이메일 데이터, 회의 초대 데이터 및 리포트 관계 등 정보를 통해 관계도 모델을 구축할 수 있고, Node2Vec 기술을 통 해 각 사용자에 1개의 벡터를 매핑하고, 각 사용자(노드)와 해당 일차 홉 사용자(노드)의 유사도를 계산하여, 유사도가 일정한 임계값보다 큰 사용자(노드)를 친밀 대상으로 한다. 여기서, 일차 홉 사용자는 직접 소통 데이 터, 이메일 데이터, 회의 초대 데이터 및 리포트 관계 등 관계가 있었던 사용자이다. 예를 들면, A가 B, C에 이 메일을 송신하고, C가 D에 이메일을 송신할 경우, B, C는 A의 일차 홉 사용자이고, D는 A의 2차 홉 사용자(여기 서, A, D의 두 사람은 모를 수 있음)이다. 단계103에서, 검색 요청의 검색 키워드 및 적어도 하나의 리콜 후보 세트에 따라, 검색 키워드에 대응되는 적어 도 하나의 후보 대상을 획득한다. 일 구현 방식에서, 검색 요청의 검색 키워드를 이용하여 리콜 후보 세트에서 검색을 수행하여, 검색 키워드에 대응되는 적어도 하나의 후보 대상을 획득한다. 단계104에서, 각 후보 대상의 특징 정보를 획득한다. 여기서, 본 발명의 실시예에서, 당해 특징 정보는, 검색 키워드 Query, 매치 필드; 매치 필드 점수; 매치 필드 내용; 매치 필드 인덱스; 최근 한 번의 인터랙션 시간; 오늘의 메시지 수; 이번 주의 메시지 수; 최근 10, 30 및 90일의 메시지 수; 최근10, 30 및 90일의 소통 날수; 친밀도 점수; 사용자가 최근에 클릭한 것인지의 여부; 사용자 화상; 최근 50번 사용자의 검색 클릭 행위에서 검색 키워드 및 매치 필드 내용의 교차 매핑; 중 하나 또 는 하나 이상을 포함하나 이에 한정되지 않는다. 여기서, 필드는 검색 대상의 내용 블록이다. 예를 들면, 연락 인의 필드는 비고, 닉네임, 부서 등을 포함한다. 여기서, 매치 필드는 검색 키워드를 이용하여 리콜 후보 세트에서 대상 검색을 할 경우 매치된 대상의 필드이다. 매치 필드 점수는 검색 키워드를 이용하여 리콜 후보 세트에서 대상 검색을 할 경우 매치된 대상의필드의 점수이다. 매치 필드 내용은 검색 키워드를 이용하여 리콜 후보 세트에서 대상 검색을 할 경우 매치된 대상의 필드의 구체적인 내용이다. 매치 필드 인덱스는 검색 키워드를 이용하여 리콜 후보 세트에서 대상 검색 을 할 경우 매치된 대상의 필드의 인덱스 값이다. 단계105에서, 특징 정보에 따라, 각 후보 대상을 정렬하여 검색 요청에 응답한다. 선택적으로, 각 후보 대상의 특징 정보에 따라 적어도 하나의 후보 대상을 정렬하고, 정렬 결과에 따라 적어도 하나의 후보 대상을 디스플레이하여, 검색 요청에 응답한다. 예를 들면, 전의 N 위치에 정렬된 후보 대상을 디 스플레이하여 검색 요청에 응답할 수 있다. 여기서, N은 1 또는 3일 수 있고, 실제 상황에 따라 당해 N의 수치 를 결정할 수 있고, 본 발명은 이에 대해 구체적인 한정을 하지 않는다. 설명해야 할 것은, 본 발명의 클라이언트 검색 엔진은 C++를 사용하여 풀 세트의 수단을 구현할 수 있고, SDK(Software Development Kit, 소프트웨어 개발 키트)로서 각 클라이언트에 통합되고, 사용자에 검색 능력을 제공한다. 클라이언트 검색 엔진에 수요되는 특징 및 데이터는, 일정한 시간(예를 들면 1시간)에 한번씩, 인터 페이스 서비스를 통해 온라인 서버에서 로컬에 전송된다. 본 발명의 실시예에 따른 인스턴트 메시징 대상의 검색 방법은, 제1 대상의 검색 요청이 제1 유형인 것을 결정 할 경우, 클라이언트 검색 엔진을 기반으로 검색 기능을 제공할 수 있고, 클라이언트 검색 엔진 자체는 리콜 후 보 세트를 제공하여, 서버의 비교적 큰 리콜 세트로 인해 일부 리콜이 불량하고, 빅 리콜 세트로 인해 성능이 더 늦춰지는 문제를 효과적으로 방지할 수 있음으로, 응답 소요 시간을 감소하고, 시스템 성능을 향상시킬 수 있다. 또한, 본 발명은 후보 대상의 특징 정보에 따라 각 후보 대상을 정렬하여, 검색 결과의 정확도를 향상시 킬 수 있고, 사용자가 신속히 자신의 검색 타겟을 찾도록 도와주며, 사용자의 검색 및 근무 효율을 향상시킬 수 있다. 응답 소요 시간을 더 감소하고, 검색 결과의 정확도를 더 향상시키기 위해, 본 발명의 일부 실시예에서, 클라이 언트 검색 엔진에 의해 제공된 적어도 하나의 리콜 후보 세트를 병합하고 중복 제거를 한 후, 후보의 각 필드에 대해 초보적인 매치 및 필터링하여, 남은 후보 세트가 정렬 단계에 들어가도록 한다. 선택적으로, 도2에 도시된 바와 같이, 당해 인스턴트 메시징 대상의 검색 방법은 단계201 내지 단계207을 포함할 수 있으나, 이에 한정되 지 않는다. 단계201에서, 제1 대상의 검색 요청을 수신하고, 검색 요청의 유형을 결정한다. 본 발명의 실시예에서, 단계201은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계202에서, 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진 을 기반으로 제1 대상의 적어도 하나의 리콜 후보 세트를 획득한다. 본 발명의 실시예에서, 단계202는 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계203에서, 적어도 하나의 리콜 후보 세트를 병합하고, 병합된 적어도 하나의 리콜 후보 세트 중의 같은 대상 에 대해 중복 제거 처리를 수행하여, 타겟 후보 세트를 획득한다. 이해해야 할 것은, 클라이언트 검색 엔진에 의해 제공된 적어도 하나의 리콜 후보 세트에는 같은 후보 대상이 존재할 수 있다. 응답 소요 시간을 더 감소하기 위해, 리콜된 후보 세트를 병합하고, 병합된 리콜 후보 세트에 서 같은 대상에 대해 중복 제거 처리를 수행하여, 1개의 후보 세트를 획득할 수 있고, 당해 후보 세트는 타겟 후보 세트로 불리울 수 있다. 단계204에서, 검색 요청의 검색 키워드에 따라, 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수 행한다. 선택적으로, 검색 요청의 검색 키워드를 이용하여 타겟 후보 세트 중의 각 대상의 각 필드에서 검색한다. 일 예 시로서, 검색 요청의 검색 키워드에 따라, 복수의 부동한 매치 레벨을 기반으로 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수행할 수 있다. 여기서, 부동한 매치 레벨 점수는 구별된다. 예를 들면, 정밀 검색, 병음 검색, 퍼지 검색 및 이니셜 검색 등 매치 레벨을 사용하고, 검색 키워드에 따라 타 겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 및 필터링 처리를 할 수 있다. 예를 들면, Query=장, 필드(Staff_name)=장산, Result=매치(정밀 매치) Query=장, 필드(Staff_name)=리쓰, Result=필터링(매치되지 않음) Query=zhang, 필드(Staff_name)=장산, Result=매치(병음 매치) Query=장, 필드(Staff_name)=려우장, Result=매치(퍼지 매치) Query=zs, 필드(Staff_name)=장산, Result=매치(이니셜 매치). 단계205에서, 매치 결과에 따라, 타겟 후보 세트에서 검색 키워드에 대응되는 적어도 하나의 후보 대상을 결정 한다. 선택적으로, 매치 결과에 따라, 타겟 후보 세트에서 매치된 후보 대상을 검색 키워드에 대응되는 후보 대상으로 한다. 단계206에서, 각 후보 대상의 특징 정보를 획득한다. 본 발명의 실시예에서, 단계206은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계207에서, 특징 정보에 따라, 각 후보 대상을 정렬하여 검색 요청에 응답한다. 본 발명의 실시예에서, 단계207은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 본 발명의 실시예의 인스턴트 메시징 대상의 검색 방법에 따라, 클라이언트 검색 엔진에 의해 제공된 적어도 하 나의 리콜 후보 세트를 병합하고 중복 제거를 한 후, 후보의 각 필드에 대해 초보적인 매치 및 필터링하여, 남 은 후보 세트가 정렬 단계에 들어가도록 한다. 즉, 병합하고 중복 제거된 후보 대상을 정렬함으로, 응답 소요 시간을 감소하고, 검색 결과의 정확도를 향상시킬 수 있다. 정렬 효과를 더 향상시키고, 검색 결과의 정확성을 더 향상시키기 위해, 본 발명의 일부 실시예에서, 특징 정보 에 따라, 각 후보 대상의 클릭률 예측 점수를 결정할 수 있고, 각 후보 대상의 클릭률 예측 점수에 따라 적어도 하나의 후보 대상을 정렬한다. 선택적으로, 도3에 도시된 바와 같이, 당해 인스턴트 메시징 대상의 검색 방법은 단계301 내지 단계309를 포함하나 이에 한정되지 않는다. 단계301에서, 제1 대상의 검색 요청을 수신하고, 검색 요청의 유형을 결정한다. 본 발명의 실시예에서, 단계301은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계302에서, 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진 을 기반으로 제1 대상의 적어도 하나의 리콜 후보 세트를 획득한다. 본 발명의 실시예에서, 단계302는 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계303에서, 적어도 하나의 리콜 후보 세트를 병합하고, 병합된 적어도 하나의 리콜 후보 세트 중의 같은 대상 에 대해 중복 제거 처리를 수행하여, 타겟 후보 세트를 획득한다. 본 발명의 실시예에서, 단계303은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계304에서, 검색 요청의 검색 키워드에 따라, 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수 행한다. 본 발명의 실시예에서, 단계304는 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계305에서, 매치 결과에 따라, 타겟 후보 세트에서 검색 키워드에 대응되는 적어도 하나의 후보 대상을 결정 한다. 본 발명의 실시예에서, 단계305는 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계306에서, 각 후보 대상의 특징 정보를 획득한다. 본 발명의 실시예에서, 단계306은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계307에서, 특징 정보에 따라, 각 후보 대상의 클릭률 예측 점수를 결정한다. 일 구현 방식에서, 미리 훈련된 심층 신경망 모델을 이용하여 각 후보 대상의 특징 정보를 예측함으로, 각 후보 대상의 클릭률 예측 점수를 획득할 수 있다. 여기서, 당해 클릭률는 사용자의 클릭 대상이 Top1의 위치로 정렬 된 비율이다. 선택적으로, 당해 심층 신경망 모델은 와이드(wide) 모델 및 심층(deep) 모델을 융합하여 합동 훈련을 하는 프 레임워크일 수 있고, 와이드 모델의 기억 능력 및 심층 모델의 일반화 능력을 종합접으로 이용하여, 시스템에 대한 단일 모델의 정확성 및 확장성를 모두 구현한다. 당해 심층 신경망 모델을 훈련할 경우 사용된 훈련 데이 터는 사용자 역사 검색 클릭 데이터(여기서, 클릭하는 것은 포지티브 예시이고, 클릭하지 않는 것은 네거티브 예시임)일 수 있다. 모델에 사용된 일부 중요 특징을 예를 들면 아래에 도시된 바와 같다."}
{"patent_id": "10-2022-0085522", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "단말에서의 성능을 영향하지 않기 위해(클라이언트에서 사용 가능한 내용 및 중항 프로세서(CPU)는 유한함), 모 델 증류 수단을 사용하여 상기 심층 신경망 모델을 3층의 DNN(Deep Neural Networks, 심층 신경망) 모델로 증류 하여, 계산 파라미터를 몇 천만 부터 몇 천으로 저하할 수 있음으로, 클라이언트의 CUP 및 메모리 사용율은 현 저한 향상이 없고, 각 클라이언트가 현저하게 느려지고, 지연되는 현상이 없다. 모델 증류는 하나의 큰 모델 또는 복수의 모델 전체가 학습한 지식을 다른 경량 레벨의 단일 모델로 이동하는 것이므로, 배치하는데 편리하다. 즉 새로운 작은 모델로 큰 모델의 예측 결과를 학습하는 것이다. 이로하여, 모 델의 견고성은 비교적 강하고, 사용자의 검색 습관을 학습하여, 패스널의 바람직한 결과를 제공한다. 또한, 모 델이 학습하는 것은 사용자 클릭 대상이 Top1 위치로 정렬된 비율이므로, 사용자 Top1 클릭률가 현저하게 향상 되도록 할 수 있다. 단계308에서, 각 후보 대상의 클릭률 예측 점수에 따라, 적어도 하나의 후보 대상을 정렬한다. 선택적으로, 각 후보 대상의 클릭률 예측 점수에 따라, 큰 것부터 작은 것 순으로 적어도 하나의 후보 대상을 정렬한다. 단계309에서, 정렬 결과에 따라 적어도 하나의 후보 대상을 디스플레이하여, 검색 요청에 응답한다. 본 발명의 실시예에서, 단계309은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 본 발명의 실시예에 따른 인스턴트 메시징 대상의 검색 방법은, 특징 정보에 따라, 각 후보 대상의 클릭률 예측 점수을 결정하고, 각 후보 대상의 클릭률 예측 점수에 따라 적어도 하나의 후보 대상을 정렬함으로, 정렬 효과 를 더 향상시킬 수 있고, 정렬 결과에 따라 후보 대상을 사용자에 제공함으로, 검색 결과의 정확성을 더 향상시 킬 수 있다. 부동한 검색 장면에 적용되기 위해, 본 발명의 일부 실시예에서, 검색 요청이 제2 유형임을 결정하였을 경우, 서버 검색 엔진을 기반으로 검색 키워드에 따라 인스턴트 메시징 대상 검색을 수행할 수 있다. 선택적으로, 도4 에 도시된 바와 같이, 당해 인스턴트 메시징 대상의 검색 방법은 단계401 내지 단계410을 포함할 수 있으나 이 에 한정되지 않는다. 단계401에서, 제1 대상의 검색 요청을 수신하고, 검색 요청의 유형을 결정한다. 본 발명의 실시예에서, 단계401은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계402에서, 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진 을 기반으로 제1 대상의 적어도 하나의 리콜 후보 세트를 획득한다. 본 발명의 실시예에서, 단계402는 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계403에서, 적어도 하나의 리콜 후보 세트를 병합하고, 병합된 적어도 하나의 리콜 후보 세트 중의 같은 대상 에 대해 중복 제거 처리를 수행하여, 타겟 후보 세트를 획득한다. 본 발명의 실시예에서, 단계403은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계404에서, 검색 요청의 검색 키워드에 따라, 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수 행한다. 본 발명의 실시예에서, 단계404는 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계405에서, 매치 결과에 따라, 타겟 후보 세트에서 검색 키워드에 대응되는 적어도 하나의 후보 대상을 결정 한다. 본 발명의 실시예에서, 단계405은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계406에서, 각 후보 대상의 특징 정보를 획득한다. 본 발명의 실시예에서, 단계406은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계407에서, 특징 정보에 따라, 각 후보 대상의 클릭률 예측 점수를 결정한다. 본 발명의 실시예에서, 단계407은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계408에서, 각 후보 대상의 클릭률 예측 점수에 따라, 적어도 하나의 후보 대상을 정렬한다. 본 발명의 실시예에서, 단계408은 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계409에서, 정렬 결과에 따라 적어도 하나의 후보 대상을 디스플레이하여, 검색 요청에 응답한다. 본 발명의 실시예에서, 단계409는 각각 본 발명의 각 실시예 중 어느 하나의 방식으로 구현될 수 있고, 본 발명 의 실시예는 이에 대해 한정하지 않고, 더 설명하지도 않는다. 단계410에서, 검색 요청의 유형이 제2 유형인 것에 응답하여, 인스턴트 메시징 시스템의 서버 검색 엔진을 기반 으로 검색 키워드에 따라 인스턴트 메시징 대상 검색을 수행한다. 선택적으로, 검색 요청의 유형이 제2 유형일 경우, 서버 검색 엔진을 기반으로 검색 키워드에 따라 인스턴트 메 시징 대상 검색을 수행한다. 즉, 서버 검색 엔진은 사용자가 자주 사용하지 않고, 자주 찾지 않는 내용에 대해 검색 능력을 제공할 수 있다. 본 발명의 실시예에 따른 인스턴트 메시징 대상의 검색 방법은, 검색 요청의 유형이 제1 유형일 경우, 클라이언 트 검색 엔진에 의해 검색 능력을 제공하고, 검색 요청의 유형이 제2 유형일 경우, 서버 검색 엔진에 의해 검색 능력을 제공함으로, 부동한 검색 장면에 적용될 수 있다. 상기 실시예를 구현하기 위해, 본 발명은 인스턴트 메시징 대상의 검색 장치를 더 제공한다. 도5는 본 발명의 실시예에 제공된 인스턴트 메시징 대상의 검색 장치의 구조 블록도이다. 도5에 도시된 바와 같 이, 당해 인스턴트 메시징 대상의 검색 장치는 수신 모듈, 제1 결정 모듈, 제1 획득 모듈, 제2 획득 모듈, 제3 획득 모듈 및 응답 모듈을 포함한다. 여기서, 수신 모듈은, 제1 대상의 검색 요청을 수신하는데 사용되고; 제1 결정 모듈은, 검색 요청의 유형을 결정하는데 사용되고; 제1 획득 모듈은, 검색 요청의 유형이 제1 유형인 것에 응답하여, 인스턴트 메시징 시스템의 클라이언트 검색 엔진을 기반으로 제1 대상의 적어도 하나의 리콜 후보 세트를 획득하는데 사용되고; 여기서, 리콜 후보 세 트의 소스는, 제1 기간에서 제1 대상이 클릭한 대상; 제2 기간에서 제1 대상과 소통한 미리 설정된 수량의 대상; 및 제3 기간에서 제1 대상과의 친밀도 대상; 중의 적어도 하나를 포함한다. 제2 획득 모듈은, 검색 요청의 검색 키워드 및 적어도 하나의 리콜 후보 세트에 따라, 검색 키워드에 대응 되는 적어도 하나의 후보 대상을 획득하는데 사용되고; 일 예시로서, 제2 획득 모듈은 적어도 하나의 리콜 후보 세트를 병합하고, 병합된 적어도 하나의 리콜 후보 세트 중의 같은 대상에 대해 중복 제거 처리를 수행하 여, 타겟 후보 세트를 획득하며; 검색 요청의 검색 키워드에 따라, 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수행하고; 매치 결과에 따라, 타겟 후보 세트에서 검색 키워드에 대응되는 적어도 하나의 후 보 대상을 결정한다. 일 구현 방식에서, 제2 획득 모듈은, 검색 요청의 검색 키워드에 따라, 여러 가지 매치 레벨을 기반으로 타겟 후보 세트 중의 각 대상의 각 필드에 대해 매치 처리를 수행한다. 제3 획득 모듈은, 각 후보 대상의 특징 정보를 획득하는데 사용되고; 응답 모듈은, 특징 정보에 따라, 각 후보 대상을 정렬하여 검색 요청에 응답하는데 사용된다. 일 예시로서, 응답 모듈은 특징 정보에 따라, 각 후보 대상의 클릭률 예측 점수를 결정하고; 각 후보 대상의 클릭률 예측 점수에 따라, 적어도 하나의 후보 대상을 정렬하고; 정렬 결과에 따라 적어도 하나의 후보 대상을 디스플레이하여, 검색 요청에 응답한다. 일부 실시예에서, 도6에 도시된 바와 같이, 당해 인스턴트 메시징 대상의 검색 장치는, 제2 결정 모듈을 더 포함할 수 있다. 여기서, 제2 결정 모듈은 각 대상을 노드로 하고, 각 대상의 관계 데이터를 기반으로 관계도 모델을 구축하고, 관계도 모델에서 각 대상 노드와 타겟 대상 노드 사이의 유사도를 계산하는데 사용되 고; 여기서, 타겟 대상 노드는 대상 노드의 일차 홉 대상 노드이고, 유사도가 미리 설정된 임계값보다 큰 타겟 대상 노드를 대상 노드의 친밀도 대상으로 한다. 여기서, 도6의 610 내지 660은 도5의 510 내지 560과 같은 기 능 및 구조를 구비한다. 일부 실시예에서, 도7에 도시된 바와 같이, 당해 인스턴트 메시징 대상의 검색 장치는, 검색 모듈을 더 포 함할 수 있다. 여기서, 검색 모듈은 검색 요청의 유형이 제2 유형인 것에 응답하여, 인스턴트 메시징 시스 템의 서버 검색 엔진을 기반으로 검색 키워드에 따라 인스턴트 메시징 대상 검색을 수행하는데 사용된다. 여기 서, 도7의 710 내지 770은 도6의 610 내지 670과 같은 기능 및 구조를 구비한다. 상기 실시예의 장치에 있어서, 각 모듈이 동작을 수행하는 구체적인 방식은 당해 방법의 관련 실시예에서 상세 히 설명하였고, 여기서 더는 상세히 설명하지 않는다. 본 발명의 실시예에 따른 인스턴트 메시징 대상의 검색 장치는, 제1 대상의 검색 요청이 제1 유형인 것을 결정 할 경우, 클라이언트 검색 엔진을 기반으로 검색 기능을 제공할 수 있고, 클라이언트 검색 엔진 자체는 리콜 후 보 세트를 제공하여, 서버의 비교적 큰 리콜 세트로 인해 일부 리콜이 불량하고, 빅 리콜 세트로 인해 성능이 더 늦춰지는 문제를 효과적으로 방지할 수 있음으로, 응답 소요 시간을 감소하고, 시스템 성능을 향상시킬 수 있다. 또한, 본 발명은 후보 대상의 특징 정보를 통해 각 후보 대상을 정렬하여, 검색 결과의 정확도를 향상시 킬 수 있고, 사용자가 신속히 자신의 검색 타겟을 찾도록 도와주며, 사용자의 검색 및 근무 효율을 향상시킬 수 있다. 본 발명의 실시예에 따르면, 본 발명은 전자 기기 및 판독 가능 저장 매체를 더 제공한다. 도8에 도시된 바와 같이, 도8은 본 발명의 실시예에 따른 인스턴트 메시징 대상의 검색 방법을 구현하는 전자 기기의 블록도이다. 전자 기기는 다양한 형식의 디지털 컴퓨터를 나타낸다. 예를 들면, 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크스테이션, 개인 정보 단말(PAD), 서버, 블레이드 서버, 메인 프레임 및 기타 적합한 컴퓨터일 수 있다. 전자 기기는 다양한 형식의 모바일 장치를 나타낼 수 있다. 예를 들면 개인 정보 단말(PAD), 셀룰러 폰, 스마트 폰, 웨어러블 기기 및 기타 유사한 컴퓨팅 장치일 수 있다. 본 문에 나타난 컴포넌트, 이들의 연결과 관 계, 및 기능은 단지 예시적인 것이며, 본 문에서 설명 및/또는 요구한 본 발명의 구현을 한정하려는 것이 아니 다. 도8에 도시된 바와 같이, 당해 전자 기기는, 하나 또는 복수의 프로세서, 메모리 및 각 컴포넌트를 연결하기 위한 고속 인터페이스와 저속 인터페이스를 포함하는 인터페이스를 포함한다. 각 컴포넌트는 서로 다 른 버스를 이용하여 서로 연결되고, 공동 메인보드에 장착되거나 수요에 따라 기타 방식으로 장착될 수도 있다. 프로세서는 메모리 또는 메모리상에 저장되어 외부의 입력 / 출력 장치 (예를 들면, 인터페이스에 결합된 디스 플레이 기기)에 GUI의 그래픽 정보를 디스플레이하기 위한 명령을 포함하는, 전자 기기 내에서 실행 가능한 명 령을 처리할 수 있다. 기타 실시 방식에서, 필요에 따라, 복수의 프로세서 및/또는 복수의 버스를 복수의 메모 리와 같이 사용할 수 있다. 마찬가지로, 복수의 전자 기기를 연결할 수 있고, 각 전자 기기는 일부 필요한 동작 (예를 들면, 서버 어레이, 한 그룹의 블레이드 서버 또는 멀티 프로세서 시스템)을 제공한다. 도8에서는 하나의 프로세서를 예로 든다. 메모리는 본 발명에서 제공하는 비일시적 컴퓨터 판독 가능 저장 매체이다. 상기 메모리에는 적어도 하나 의 프로세서에 의해 수행 가능한 명령이 저장되어 있고, 상기 적어도 하나의 프로세서가 본 발명에서 제공하는 인스턴트 메시징 대상의 검색 방법을 수행할 수 있게 한다. 본 발명의 비일시적 컴퓨터 판독 가능 저장 매체에 는 컴퓨터 명령이 저장되어 있고, 당해 컴퓨터 명령은 컴퓨터가 본 발명에서 제공하는 인스턴트 메시징 대상의 검색 방법을 수행하게 한다. 메모리는 비일시적 컴퓨터 판독 가능 저장 매체로서, 비일시적 소프트웨어 프로그램, 비일시적 컴퓨터 실 행 가능한 프로그램 및 모듈을 저장하는데 사용된다. 예를 들면, 본 발명의 실시예 중의 인스턴트 메시징 대상 의 검색 방법에 대응되는 프로그램 명령/모듈을 저장할 수 있다. 프로세서는 메모리에 저장된 비일시 적 소프트웨어 프로그램, 명령 및 모듈을 작동시켜, 서버의 다양한 기능 응용 및 데이터 처리를 수행한다. 즉 상기 방법 실시예의 인스턴트 메시징 대상의 검색 방법을 구현한다. 메모리는 프로그램 저장 필드와 데이터 저장 필드를 포함할 수 있고, 프로그램 저장 필드는 운영체제, 적 어도 하나의 기능에 필요한 애플리케이션 프로그램을 저장할 수 있고, 데이터 저장 필드는 인스턴트 메시징 대 상의 검색 방법의 전자 기기의 사용에 의해 생성된 데이터 등을 저장할 수 있다. 이 외에, 메모리는 고속 랜덤 액세스 메모리를 포함할 수 있고, 비일시적 메모리, 예를 들면 적어도 하나의 자기 디스크 메모리, 플래시 메모리 또는 기타 비일시적 솔리드 스테이트 메모리를 더 포함할 수 있다. 일부 실시예에서, 메모리는 선 택적으로 프로세서에 대해 원격으로 설치되는 메모리를 포함하고, 이러한 원격 메모리는 네트워크를 통해 인스턴트 메시징 대상의 검색 방법의 전자 기기에 연결될 수 있다. 상기 네트워크의 구현예는 인터넷, 인트라넷, 근거리 통신망, 이동 통신망 및 이들의 조합을 포함하나 이에 한정되지 않는다. 인스턴트 메시징 대상의 검색 방법을 구현하는 전자 기기는, 입력 장치 및 출력 장치를 더 포함할 수 있다. 프로세서, 메모리, 입력 장치 및 출력 장치는 버스 또는 기타 방식을 통해 연결될 수 있고, 도8에서는 버스를 통해 연결되는 것을 예로 든다. 입력 장치는 입력된 숫자 또는 문자 정보를 수신할 수 있고, 인스턴트 메시징 대상의 검색 방법의 전자 기 기의 사용자 설정 및 기능 제어와 관련되는 키 신호 입력을 생성할 수 있고, 예를 들어, 터치 스크린, 키패드,마우스, 트랙패드, 터치패드, 포인팅 스틱, 하나 또는 복수의 마우스 버튼, 트랙볼, 조이스틱 등 입력 장치이다. 출력 장치는 디스플레이 기기, 보조 조명 장치(예를 들면LED) 및 촉각 피드백 장치(예를 들면 진동 모터)등을 포함할 수 있다. 당해 디스플레이 기기는 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레 이 및 플라즈마 디스플레이를 포함할 수 있으나 이에 한정되지 않는다. 일부 실시예에서, 디스플레이 기기는 터 치 스크린일 수 있다. 여기서 설명하는 시스템과 기술의 여러 가지 실시형태는 디지털 전자회로 시스템, 집적회로 시스템, 주문형 집 적회로(ASIC), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 실현될 수 있다. 이러한 여러 가 지 실시형태는 하나 또는 복수의 컴퓨터 프로그램에서 실시되는 것을 포함할 수 있고, 당해 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그래밍 가능 프로세서를 포함하는 프로그래밍 가능 시스템에서 수행 및/ 또는 해석되며, 당해 프로그래밍 가능 프로세서는 전용 또는 일반 프로그래밍 가능 프로세서일 수 있으며, 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치에서 데이터와 명령을 수신할 수 있고, 데이터와 명령을 당해 저장 시스템, 당해 적어도 하나의 입력 장치 및 당해 적어도 하나의 출력 장치에 전송할 수 있다. 이러한 컴퓨팅 프로그램(즉, 프로그램, 소프트웨어, 소프트웨어 애플리케이션 또는 코드)은, 프로그래밍 가능 프로세서의 기계 명령을 포함하고, 고급 절차 및/또는 객체 지향 프로그래밍 언어 및/또는 어셈블리/기계 언어 를 이용하여 이러한 컴퓨팅 프로그램을 실시할 수 있다. 본 명세서에서 사용한 용어 \"기계 판독 가능 매체\"와 \"컴퓨터 판독 가능 매체\"는 기계 명령 및/또는 데이터를 프로그래밍 가능 프로세서에 제공하는 임의의 기기 및 /또는 장치(예를 들면, 자기 디스크, 광 디스크, 메모리, 프로그래밍 가능 로직 장치(PLD))를 포함하고, 기계 판독 가능 신호인 기계 명령을 수신하는 기계 판독 가능 매체를 포함한다. 용어 \"기계 판독 가능 신호\"는 기계 명령 및/또는 데이터를 프로그래밍 가능 프로세서에 제공하는 임의의 신호를 가리킨다. 사용자와의 인터랙션을 제공하기 위해, 여기서 설명된 시스템 및 기술은 컴퓨터에서 구현할 수 있으며, 당해 컴 퓨터는 사용자에게 정보를 디스플레이하는 디스플레이 장치(예를 들면, CRT(음극선관) 또는 LCD(액정 디스플레 이)모니터); 및 키보드와 지향 장치(예를 들면, 마우스 또는 트랙볼)를 구비하고, 사용자는 당해 키보드와 당해 지향 장치를 통해 컴퓨터에 입력을 제공할 수 있다. 기타 유형의 장치도 사용자와의 인터랙션에 사용될 수 있는 바, 예를 들면 사용자에게 제공된 피드백은 임의의 형식의 감각 피드백(예를 들면, 시각적 피드백, 청각적 피드 백 또는 촉각적 피드백)일 수 있고, 임의의 형식(음향 입력, 음성 입력 또는 촉각 입력)에 의해 사용자로부터의 입력을 수신할 수 있다. 여기서 설명한 시스템과 기술을, 백그라운드 컴포넌트를 포함하는 컴퓨팅 시스템(예를 들면 데이터 서버), 또는 미들웨어 컴포넌트를 포함하는 컴퓨팅 시스템(예를 들면, 애플리케이션 서버), 또는 프론트 엔드 컴포넌트를 포 함하는 컴퓨팅 시스템(예를 들면, 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 구비한 사용자 컴퓨터에 서 실시될 수 있고, 사용자는 당해 그래픽 사용자 인터페이스 또는 당해 네트워크 브라우저를 통해 여기서 설명 한 시스템과 기술의 실시형태와 인터랙션할 수 있다), 또는 이러한 백그라운드 컴포넌트, 미들웨어 컴포넌트 또 는 프론트 엔드 컴포넌트의 임의의 조합을 포함하는 컴퓨팅 시스템에서 실시될 수 있다. 임의의 형태 또는 매체 의 디지털 데이터 통신(예를 들면, 통신 네트워크)을 통해 시스템의 컴포넌트를 서로 연결할 수 있다. 통신 네 트워크의 예시는 근거리 통신망 (LAN), 광역 통신망 (WAN), 인터넷 및 블록 체인 네트워크를 포함한다. 컴퓨터 시스템은 클라이언트와 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 떨어져 있으며, 통신 네트워크를 통해 서로 인터랙션한다. 대응하는 컴퓨터에서 운행되고 서로 클라이언트-서버 관계를 가지는 컴퓨터 프로그램에 의해 클라이언트와 서버의 관계를 생성한다. 서버는 클라우드 서버일 수 있고, 클라우드 컴 퓨팅 서버 또는 클라우드 호스트라고도 하고, 클라우드 컴퓨팅 서비스 시스템의 호스트 제품이고, 전통적인 물 리 호스트와 VPS서비스(\"Virtual Private Server\", 또는 \"VPS\")에서, 관리가 어렵고, 업무 확장성이 약한 단점 을 해결한다. 서버는 분산식 시스템의 서버 또는 블록 체인을 결합한 서버일 수도 있다. 이해해야 할 것은, 상기 다양한 형식의 흐름에 의해, 단계를 재정렬, 추가 또는 삭제할 수 있다. 예를 들면, 본 발명에 기재한 각 단계는 병행하여 또는 순차적으로 실행할 수도 있고, 서로 다른 순서로 실행할 수도 있다. 본 발명에서 개시한 기술적 수단이 원하는 결과만 구현할 수 있으면 본 문에서 이에 대해 한정하지 않는다. 상기 구체적인 실시 방식은 본 발명의 보호 범위를 한정하지 않는다. 본 발명이 속하는 기술 분야의 통상의 기 술자는 설계 요구 및 기타 요소에 의해 여러가지 수정, 조합, 서브 조합 및 대체가 이루어질 수 있음을 이해해 야 한다. 본 발명의 정신과 원칙 내에서 이루어진 모든 수정, 동등한 대체 및 개선 등은 본 발명의 보호 범위에 포함된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2022-0085522", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부된 도면은 본 기술적 수단을 더 잘 이해하는데 사용되고, 본 발명을 한정하려는 것은 아니다. 도1은 본 발명의 실시예에 제공된 인스턴트 메시징 대상의 검색 방법의 흐름도이다. 도2는 본 발명의 실시예에 제공된 다른 인스턴트 메시징 대상의 검색 방법의 흐름도이다. 도3은 본 발명의 실시예에 제공된 또 다른 인스턴트 메시징 대상의 검색 방법의 흐름도이다. 도4는 본 발명의 실시예에 제공된 또 다른 인스턴트 메시징 대상의 검색 방법의 흐름도이다. 도5는 본 발명의 실시예에 제공된 인스턴트 메시징 대상의 검색 장치의 구조 블록도이다.도6은 본 발명의 실시예에 제공된 다른 인스턴트 메시징 대상의 검색 장치의 구조 블록도이다. 도7은 본 발명의 실시예에 제공된 또 다른 인스턴트 메시징 대상의 검색 장치의 구조 블록도이다. 도8은 본 발명의 실시예의 인스턴트 메시징 대상의 검색 방법을 구현하는 전자 기기의 블록도이다."}
