{"patent_id": "10-2022-0173785", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0088239", "출원번호": "10-2022-0173785", "발명의 명칭": "이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템을 구비한 수배전반", "출원인": "김대호", "발명자": "김대호"}}
{"patent_id": "10-2022-0173785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "휴대용 장치로 구현되어, 수배전반 내부를 촬영한 적어도 하나의 열화상 이미지를 획득 및 제공하는 이동형 열화상 카메라; 및 상기 이동형 열화상 카메라가 제공하는 열화상 이미지를 인공지능 방식으로 분석하여 감시 대상 각각의 온도를검출함과 동시에 온도 변화 패턴을 추적 모니터링하고, 온도와 온도 변화 패턴 중 적어도 하나를 통해 감시 대상 각각의 상태를 진단하고 리포팅 정보를 생성 및 제공하는 분석 서버를 포함하며, 상기 리포팅 정보의 제공 단위는 상기 수배전반, 상기 수배전반을 구성하는 시설물, 상기 시설물에 구비된 적어도 하나의 장비인 것을 특징으로하는 이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템."}
{"patent_id": "10-2022-0173785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 분석 서버는 열화상 이미지와 감시 대상의 위치 및 종류간의 상관관계를 사전 학습하여어, 열화상 이미지에 포함된 감시 대상 각각의 위치 및 종류를 자동 식별하는 감시 대상 식별 모델;감시 대상의 위치에 기반하여 감시 대상이 촬영된 영역을 추출하여 관심 영상을 획득하는 영상 추출부;관심 영상의 열분포도와 온도간의 상관관계를 사전 학습하여, 감시 대상의 관심 영상에 상응하는 온도를 자동검출하는 온도 검출 모델; 감시 대상 각각의 온도 변화 패턴을 추적 모니터링하여 감시 대상 각각의 상태를 진단한 후, 감시 대상 각각의현재 온도, 온도 변화 패턴, 열화상 이미지, 상태 진단 결과 중 적어도 하나에 대한 정보를 포함하는 리포팅 정보를 생성 및 제공하는 상태 리포팅부; 및 관리자 단말과의 통신을 지원하는 통신부를 포함하는 것을 특징으로 하는 이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템."}
{"patent_id": "10-2022-0173785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 상태 리포팅부는 촬영 단계 및 감시 대상별 영상 획득 위치를 사전 정의한 가이드 정보를 저장 관리하며, 상기 가이드 정보에 따라 상기 이동형 열화상 카메라의 영상 획득 위치를 안내하는 기능을 더 포함하는 것을 특징으로 하는 이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템."}
{"patent_id": "10-2022-0173785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 상태 리포팅부는 현재 온도를 온도값, 온도 게이지 중 적어도 하나의 형태로 제공하고, 온도 변화 패턴을 기간별 최대 온도차,최대 온도, 평균 온도, 최소 온도, 온도 변화 추이 중 적어도 하나의 형태로 제공하는 것을 특징으로 하는 이동열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템."}
{"patent_id": "10-2022-0173785", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 상태 리포팅부는 감시 대상의 검출 위치를 표시하는 바운딩 박스와 감시 대상의 종류와 온도를 안내하는 텍스트 정보를 생성한후, 상기 열화상 이미지에 오버레이시켜 표시하는 기능을 더 포함하는 것을 특징으로 하는 이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템.공개특허 10-2024-0088239-3-청구항 6 제2항에 있어서, 상기 상태 리포팅부는 감시 대상 각각에 관련된 정보를 데이터베이스화하여 저장한 후, 타임라인에 따라 검색 및 열람할 수 있도록 하는 기능을 더 포함하는 것을 특징으로 하는 이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템."}
{"patent_id": "10-2022-0173785", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능형 열화상 감시 진단 수배전반에 관한 것으로, 이는 수배전반 함체; 상기 수배전반 함체의 내 부에 설치되어, 수배전반 내 감시 대상들을 촬영하여 적어도 하나의 열화상 이미지를 획득하는 다수의 고정 열화 상 카메라; 상기 열화상 이미지 각각을 인공지능 방식으로 분석하여 감시 대상 각각을 식별하고 온도를 검출하고, 온도 기반으로 감시 대상 각각의 이상 상태를 확인 및 통보하는 분석 서버를 포함하며, 상기 감시 대 상은 상기 수배전반을 구성하는 시설물에 구비된 적어도 하나의 장비인 것을 특징으로 한다."}
{"patent_id": "10-2022-0173785", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 보다 간단하고 효과적인 감시 동작이 가능하도록 하는 이동 열화상 카메라에 기반한 수배전반용 열화 상 감시 진단 시스템에 관한 것이다."}
{"patent_id": "10-2022-0173785", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 수배전반은 전력 공급자로부터 공급되는 공급 전력을 전력 수용가 측에 분배하여 제공하는 장치이 다. 수배전반은 특고압의 전력을 고압으로, 혹은, 고압의 전력을 저압으로 변환하는 변전수단을 포함할 수 있으며, 과전류나 과전압에 의해 트립되는 메인 차단기 및 분기 차단기, 서지로부터 장치를 보호하는 서지 보호장치 등 을 구비한다. 통상적으로, 수배전반 내에서 각 감시 대상들은 부스바(bus bar)에 의해 연결된다. 종래 수배전반 내 감시 대상들의 열화나 노후화를 진단하는 방법으로 온도 센서를 이용하는 방법이 제안되고 있 다. 하지만, 수배전반을 구성하는 감시 대상들은 열화 기준 온도가 모두 다르므로, 감시 대상 영역마다 온도 센서를 설치해야 하는 설치 비용의 문제와, 복수의 온도 센서들이 정상적으로 동작하는지를 관리해야 하며 열화에 의해 소손된 온도 센서를 교체해야 하는 등의 유지보수의 번거로움이 발생된다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내등록특허 제10-1529818호 (등록일자 : 2015.06.11.)"}
{"patent_id": "10-2022-0173785", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 상기와 같은 문제점을 해결하기 위한 것으로서, 본 발명은 열화상 이미지를 획득한 후, 이를 인공지능 방 식으로 분석하여 수배전반 내의 주요 감시 대상에 대한 상태를 보다 간단하고 효과적으로 감시할 수 있도록 하 는 이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템을 제공하고자 한다. 또한 이동 열화상 카메라를 이용함으로써, 최소한의 카메라를 이용하여 필요 영상을 획득할 수 있도록 하는 이 동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템을 제공하고자 한다. 더하여, 시설물 단위가 아닌 시설물내 부품 단위로 세분화하여 상태 감시 진단을 수행할 수 있도록 하는 이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템을 제공하고자 한다. 본 발명의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로 부터 본 발명이 속하는 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0173785", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 수단으로서, 본 발명의 일 실시 형태에 따르면 휴대용 장치로 구현되어, 수배전반 내부를 촬영한 적어도 하나의 열화상 이미지를 획득 및 제공하는 이동형 열화상 카메라; 및 상기 이동형 열화상 카메라가 제공하는 열화상 이미지를 인공지능 방식으로 분석하여 감시 대상 각각의 온도를 검출함과 동시에 온도 변화 패턴을 추적 모니터링하고, 온도와 온도 변화 패턴 중 적어도 하나를 통해 감시 대상 각각의 상태를 진 단하고 리포팅 정보를 생성 및 제공하는 분석 서버를 포함하며, 상기 리포팅 정보의 제공 단위는 상기 수배전반, 상기 수배전반을 구성하는 시설물, 상기 시설물에 구비된 적어도 하나의 장비인 것을 특징으로 하는 이동 열화상 카메라에 기반한 수배전반용 열화상 감시 진단 시스템을 제공한다. 상기 분석 서버는 열화상 이미지와 감시 대상의 위치 및 종류간의 상관관계를 사전 학습하여어, 열화상 이미지 에 포함된 감시 대상 각각의 위치 및 종류를 자동 식별하는 감시 대상 식별 모델; 감시 대상의 위치에 기반하여 감시 대상이 촬영된 영역을 추출하여 관심 영상을 획득하는 영상 추출부; 관심 영상의 열분포도와 온도간의 상 관관계를 사전 학습하여, 감시 대상의 관심 영상에 상응하는 온도를 자동 검출하는 온도 검출 모델; 감시 대상 각각의 온도 변화 패턴을 추적 모니터링하여 감시 대상 각각의 상태를 진단한 후, 감시 대상 각각의 현재 온도, 온도 변화 패턴, 열화상 이미지, 상태 진단 결과 중 적어도 하나에 대한 정보를 포함하는 리포팅 정보를 생성 및 제공하는 상태 리포팅부; 및 관리자 단말과의 통신을 지원하는 통신부를 포함하는 것을 특징으로 한다. 상기 상태 리포팅부는 촬영 단계 및 감시 대상별 영상 획득 위치를 사전 정의한 가이드 정보를 저장 관리하며, 상기 가이드 정보에 따라 상기 이동형 열화상 카메라의 영상 획득 위치를 안내하는 기능을 더 포함하는 것을 특 징으로 한다. 상기 상태 리포팅부는 현재 온도를 온도값, 온도 게이지 중 적어도 하나의 형태로 제공하고, 온도 변화 패턴을 기간별 최대 온도차, 최대 온도, 평균 온도, 최소 온도, 온도 변화 추이 중 적어도 하나의 형태로 제공하는 것 을 특징으로 한다. 상기 상태 리포팅부는 감시 대상의 검출 위치를 표시하는 바운딩 박스와 감시 대상의 종류와 온도를 안내하는 텍스트 정보를 생성한 후, 상기 열화상 이미지에 오버레이시켜 표시하는 기능을 더 포함하는 것을 특징으로 한 다. 상기 상태 리포팅부는 감시 대상 각각에 관련된 정보를 데이터베이스화하여 저장한 후, 타임라인에 따라 검색 및 열람할 수 있도록 하는 기능을 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0173785", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 열화상 이미지를 획득한 후, 이를 인공지능 방식으로 분석하여 수배전반 내의 주요 감시 대상에 대한 상태를 확인하도록 함으로써, 시스템 크기 및 구현 비용의 최소화를 보장할 수 있도록 한다. 또한 이동 열화상 카메라를 함께 이용하여 최소한의 카메라를 이용하여 필요 영상을 획득할 수 있도록 한다. 더하여, 시설물 단위가 아닌 시설물내 부품 단위로 세분화하여, 상태 감시 진단 동작의 해상도를 극대화할 수도 있도록 한다."}
{"patent_id": "10-2022-0173785", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있 어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되 는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 '연결'되어 있다고 할 때, 이는 '직접적으로 연결'되어 있 는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 '간접적으로 연결'되어 있는 경우도 포함한다. 또한,어떤 구성요소를 '포함'한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 1 및 도 2는 본 발명의 일 실시예에 따른 인공지능 기반 수배전반용 열화상 감시 진단 시스템을 도시한 도면 이다. 도 1에 도시된 바와 같이, 본 발명의 열화상 감시 진단 시스템은 휴대용 장치로 구현되어, 수배전반 내부 를 촬영하여 적어도 하나의 열화상 이미지를 획득 및 제공하는 이동형 열화상 카메라, 이동형 열화상 카메 라가 제공하는 열화상 이미지를 수신한 후, 이를 인공지능 방식으로 분석하여 감시 대상 각각을 식별하고 온도를 파악하고, 온도 기반으로 감시 대상 각각의 상태를 확인한 후 관리자 단말에 통보하는 분석 서버 등을 포함한다. 도 2에 도시된 바와 같이, 본 발명의 분석 서버는 열화상 이미지에 대응되는 감시 대상의 위치와 종류를 사전 학습하여, 열화상 이미지에 포함된 감시 대상 각각의 위치 및 종류를 자동 식별하는 감시 대상 식별 모델 , 감시 대상의 위치에 기반하여 감시 대상이 촬영된 영역을 추출하여 관심 영상을 획득하는 영상 추출부 , 열 분포도에 대응되는 온도간의 상관관계가 사전 학습되어, 관심 영상의 열분포도에 대응되는 감시 대상 온도를 각각 검출하는 온도 검출 모델, 감시 대상 각각의 온도 변화 패턴을 추적 모니터링하여 감시 대상 각각의 상태를 진단한 후, 감시 대상 각각의 현재 온도, 온도 변화 패턴, 열화상 이미지, 상태 진단 결과 중 적 어도 하나에 대한 정보를 포함하는 리포팅 정보를 생성 및 제공하는 상태 리포팅부, 및 관리자 단말 과의 통신을 지원하는 통신부 등을 포함한다. 본 발명의 감시 대상 식별 모델은 YOLOv5의 학습 모델을 기반으로 구축되고, 온도 검출 모델은 Faster R-CNN의 학습모델을 기반으로 구축되는 것이 가장 바람직하나, 이에 한정될 필요는 없다. 그리고 상태 리포팅부는 파일 또는 웹 페이지 형태로 리포팅 정보를 관리자 단말에 제공할 수 있도록 하나, 필요한 경우 관리자 단말에 분석 장치과의 연동을 지원하는 프로그램을 설치 및 실행하고, 프 로그램을 통해 리포팅 정보를 안내할 수도 있도록 한다. 이와 같이 본 발명은 열화상 카메라를 통해 획득된 영상 기반으로 감시 대상 각각을 식별하고 온도를 파악할 수 있도록 함으로써, 별도의 온도 센서를 구비할 필요가 없도록 한다. 더하여, 휴대형 이동형 열화상 카메라를 이용하여 상태 분석에 필요한 열화상 이미지를 획득할 수 있도록 함으 로써, 최소의 비용으로 보다 많은 수배전반의 상태 분석 동작을 수행할 수 있도록 한다. 도 3은 본 발명의 일 실시예에 따른 수배전반내 감시 대상을 설명하기 위한 도시한 도면이다. 도 3에 도시된 바와 같이, 수배전반에는 TR반, LBS&LA반, MOF&PT반, Main VCB반, 개별 VCB반, VCB&CT반, ACB반, MCCB반 등의 시설물이 내장될 수 있으며, 본 발명에서는 시설물들의 위치를 고려하여 수배전반 내에 다 수개의 열화상 카메라를 분산 배치되도록 한다. 그리고 감시 대상을 시설물 단위가 아닌 장비 단위로 세분화한 후, 이들 각각의 온도 기준치를 전기설비 안전관 리기준의 온도패턴법에 근거하여 설정하도록 한다. 즉, 본 발명에서는 시설물 단위가 아닌 장비 단위로 세분화 함으로써, 보다 수배전반의 이상 상태를 보다 세밀하게 감시, 진단, 및 모니터링할 수 있도록 한다. 더하여 감시 대상 각각의 우선순위를 설정함으로써, 가장 중요한 감시 대상의 이상 상태를 최우선하여 확인하여 감시 대상 관리자에게 안내할 수도 있도록 한다. 이와 같이, 본 발명은 수배전반의 상태를 수배전반 또는 시설물이 아닌 장비 단위로 세분화하여 모터링할 수 있 도록 한다. 다만, 이러한 경우 감시 대상의 개수가 기하급수적으로 증가하게 되는 데, 온도 센서를 이용하여 이들 감시 대 상 모두의 상태를 감지하기는 현실적으로 불가능한 문제가 있다. 즉, 기존의 온도 센서는 감시 대상의 온도를 1:1로 감지해야 하므로 감시 대상의 개수 만큼 온도 센서 개수가 증가해야 하는 문제가 발생한다. 이에 본 발명은 인공지능 방식으로 구현된 감시 대상 식별 모델과 온도 검출 모델을 새로이 제안하고, 이들을 통해 감시 대상의 종류와 개수를 영상 처리 방식으로 손쉽게 확장할 수 있도록 한다. 도 4는 본 발명의 일 실시예에 따른 분석 서버의 감시 대상 식별 및 온도 검출 방법을 설명하기 위한 도면이다. 먼저, 분석 서버는 감시 대상 각각에 상응하는 영상 획득 위치를 사전 정의한 가이드 정보를 저장 관리하 며, 가이드 정보를 통해 감시 대상별 영상 획득 위치를 관리자 단말을 통해 관리자에게 안내함으로써, 관 리자가 이를 참고하여 감시 대상 상태 분석이 필요한 영상들을 최적 상태로 획득 및 제공할 수 있도록 한다 (S1). 이에 관리자가 이동형 열화상 카메라를 위치 조정하면서 감시 대상 각각을 촬영하여 적어도 하나의 열화상 이미 지를 획득한 후, 이를 분석 서버에 제공하면(S2), 분석 서버는 적어도 하나의 열화상 이미지 중 어느 하나를 선택한 후(S3), 이를 감시 대상 식별 모델을 통해 분석하여 열화상 이미지에 존재하는 적어도 하나 의 감시 대상의 위치와 종류를 파악한다(S4). 그리고 감시 대상의 위치에 기반하여 하나의 열화상 이미지로부터 적어도 하나의 감시 대상 촬영 영역만을 추출 하여 적어도 하나의 관심 영상을 획득한다(S5). 그리고 관심 영상 중 어느 하나를 순차적으로 선택한 후(S6), 이를 온도 검출 모델을 통해 분석하여 감시 대상의 온도를 파악한다(S7). 단계 S3 내지 S7은 현재 선택된 열화상 이미지로부터 추출된 관심 영상이 모두 선택될 때까지 반복 수행되도록 한다(S8). 만약, 현재 선택된 열화상 이미지에 관련된 관심 영상 모두 선택되었으면(즉, 현재 선택된 열화상 이미지에 대 한 분석이 완료되었으면), 단계 S3로 재진입하여 새로운 열화상 이미지에 대한 분석을 반복 수행되도록 한다. 즉, 열화상 이미지 모두에 대한 분석 동작이 순차적으로 수행될 수 있도록 한다(S9). 도 5 내지 도 10은 본 발명의 일 실시예에 따른 관리자 단말에 제공되는 리포팅 정보의 예들을 도시한 도면이다. 먼저, 본 발명은 도 5와 같은 시스템 설정 페이지를 제공하여, 이를 통해 수배전반이 설치되는 건물, 수배전반 의 장비 구조도, 카메라가 촬영하는 장비 등을 등록 관리할 수 있도록 한다. 이때, 건물 정보는 건물을 관리하는 기간, 건물명, 위치 정보(주소 또는 위/경도) 등에 대한 정보를 포함하며, 특히 건물 위치 정보는 지도 서비스와 상호 연동하여 지도상에서 건물 위치를 클릭하는 방식으로 등록되어, 사 용자 편이성을 극대화하도록 한다. 수배전반 정보는 수배전반이 설치된 건물, 수배전반에 포함된 시설물 목록, 시설물에 속하는 장비 목록 등에 대 한 정보를 포함하고, 카메라 촬영 정보는 카메라 영상내 바운딩 박스와 장비간의 대응관계 등에 대한 정보를 포 함할 수 있다. 참고로, 이동형 열화상 카메라는 관리자에 의해 위치 가변되는 장치이므로, 관리자별로 이동 영상 획득 위치가 달라질 수 있다. 이에 본 발명은 도 6에 도시된 바와 같이, 이동형 열화상 카메라의 촬영 단계 및 감시 대상별 영상 획득 위치를 사전 정의한 가이드 정보를 저장 관리하며, 이를 기반으로 관리자가 이동형 열화상 카메라를 어떻게 이용하여 필요 영상을 획득해야 하는 지를 정확하고 상세하게 안내해줄 수 있도록 한다. 즉, 관리자가 자신의 주관적 판 단이 아닌 객관적 기준에 따라 감시 대상 상태 분석이 필요한 영상들을 최적의 상태로 획득 및 제공할 수 있도 록 한다. 그리고 본 발명에서는 도 7에서와 같이, 수배전반의 리포팅 단위를 건물, 시설물, 장비 단위로 세분화하여 감시 대상을 결정 및 선택할 수 있도록 한다. 그리고 감시 대상의 현재 온도, 온도 변화 패턴, 열화상 이미지, 상태 진단 결과 중 적어도 하나를 안내할 수 있도록 한다. 이때, 현재 온도는 온도값, 온도 게이지 중 적어도 하나의 형태로 제공되고, 온도 변화 패턴은 기간별 최대 온 도차, 최대 온도, 평균 온도, 최소 온도, 온도 변화 추이(그래프 또는 표) 중 적어도 하나의 형태로 제공될 수 있다. 그리고 열화상 이미지내에서의 감시 대상의 위치를 표시하는 바운딩 박스와 감시 대상의 종류와 온도를 안내하 는 텍스트 정보를 추가 생성하고, 도 7에서와 같이 이들 정보를 열화상 이미지에 오버레이시켜 표시함으로써, 관리자가 감시 대상의 발열 상태를 보다 직관적으로 인지할 수 있도록 한다. 또한 장비 목록을 통해 특정 감시 대상을 클릭하면, 해당 감시 대상에 대응되는 바운딩 박스만을 표시하거나, 바운딩 박스를 강조 표시함으로써 열화상 이미지 상에서 보다 정확하고 신속한 위치 확인이 가능하게 할 수 있 도록 한다. 상태 진단 결과는 도 9와 같이 감시 대상의 이상 여부를 알려주는 것으로, 본 발명에서는 감시 대상의 온도 뿐 아니라 감시 대상의 온도를 장기간에 걸쳐 추척 모니터링한 결과인 온도 변화 패턴에 기반해서도 감시 대상의 상태를 진단할 수 있도록 한다. 예를 들어, 감시 대상의 허용 온도가 기 설정된 허용치 이상으로 증가하는 경우 뿐 아니라, 감시 대상의 온도가 계속하여 증가 또는 감소하거나 온도 변동치가 비정상적으로 커지는 경우 등에 도 이상 상태 발생을 확인 및 통보할 수 있도록 한다. 즉, 본 발명에서는 긴 운용 기간에 걸쳐 데이터를 누적한 후, 데이터 경향성을 고려하여 감시 대상의 상태 진단 을 수행할 수 있도록 한다. 그리고 이상 상태가 확인된 감시 대상은 장비 목록의 최상단에 표출함으로써, 해당 감시 대상의 보다 빠른 상태 확인을 유도할 수 있도록 한다. 이에 더하여 본 발명은 이동형 열화상 카메라를 이용하여 이상 상태가 확인된 감시 대상에 대한 상세 영상 을 추가 획득할 수 있도록 한다. 특히, 가이드 정보의 촬영 3단계를 참고하여 해당 감시 대상의 영상 촬영 위치 를 안내해줌으로써, 이동형 열화상 카메라가 감시 대상 상태 분석이 필요한 영상들을 최적의 효율로 획득 할 수 있도록 한다. 마지막으로, 본 발명은 시스템 동작에 의해 획득된 모든 정보(즉, 온도, 열화상 이미지, 상태 진단 결과 등)를 데이터베이스화하여 저장함으로써, 도 10과 같이 차후 타임라인에 따라 이들 정보를 검색 및 열람할 수 있도록 한다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2022-0173785", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형 실시들은 본 발명의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2022-0173785", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 도 2는 본 발명의 일 실시예에 따른 인공지능 기반 수배전반용 열화상 감시 진단 시스템을 도시한 도면 이다. 도 3은 본 발명의 일 실시예에 따른 수배전반내 감시 대상을 설명하기 위한 도시한 도면이다. 도 4는 본 발명의 일 실시예에 따른 감시 대상의 이상 진단 방법을 설명하기 위한 도면이다. 도 5 내지 도 10은 본 발명의 일 실시예에 따른 관리자 단말에 제공되는 리포팅 정보의 예들을 도시한 도면이다."}
