{"patent_id": "10-2022-0131212", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0051490", "출원번호": "10-2022-0131212", "발명의 명칭": "비가시도료 마크에 기반한 재활용품 자동 분류 방법 및 장치", "출원인": "주식회사 마크애니", "발명자": "소영성"}}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "표면의 적어도 일부분에 재활용품 자동 분류 마크가 형성된 물품에 있어서,상기 자동 분류 마크는, 상기 물품의 소재에 기반하여 형성되고, 제1패턴을 포함하며,상기 제1패턴은 제1파장대역의 제1광선을 조사(照射)하면 제1발광색으로 발광하는 제1발광물질을 함유하는 제1도료로 상기 표면에 형성된 것을 특징으로 하는, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 자동 분류 마크는, 상기 제1패턴의 형상 또는 상기 제1발광색의 색상 중 적어도 하나에 의하여 상기 물품의 분류유형을 나타내도록 형성된 것인, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 자동 분류 마크는, 플라스틱, 전지, 금속, 유기소재, 생분해소재, 비닐, 캔, 종이, 종이팩, 유리, 및 페트중 적어도 하나에 속하는 상기 물품의 소재를 나타내도록 형성된 것인, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 제1파장대역은 적어도 하나의 비가시(非可視)광선 파장대역을 포함하는 것을 특징으로 하는, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 비가시광선 파장대역은, 10nm 이상 400nm 이하의 파장길이를 가지는 적어도 하나의 자외선 파장대역을 포함하는 것을 특징으로 하는, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 자동 분류 마크는 상기 제1광선의 조사 없이는 가시광선 하에서 투명한 것을 특징으로 하는, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 자동 분류 마크는 제2패턴을 더 포함하고,공개특허 10-2024-0051490-3-상기 제2패턴은 제2파장대역의 제2광선을 수광하고 제2발광색으로 발광하는 제2발광물질을 함유한 제2도료로 상기 표면에 형성된 것을 특징으로 하는, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 자동 분류 마크는 상기 물품의 표면에 인쇄된 것인, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 자동 분류 마크는 인쇄물을 상기 물품의 표면에 부착하여 형성된 것인, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 자동 분류 마크는 상기 물품을 구성하는 소재물질에 상기 제1도료를 혼입(混入)하여 형성된 것인, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 제1발광물질은, 상기 제1광선을 조사하면 제1발광색을 방사하는 형광(螢光)특성을 가지는 것을 특징으로하는, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 제1발광물질은, 상기 제1광선을 조사한 이후 제거하여도 제1발광색으로 발광을 지속하는 인광(燐光)특성을가지는 것을 특징으로 하는, 물품."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "재활용품 자동 분류 장치에 있어서,장치에 물품을 반입하는 반입부;상기 물품에 제1파장대역의 제1광선을 조사(照射)하는 광원부;상기 물품으로부터 제1발광색으로 방사되는 제1패턴을 촬영하는 촬영부;상기 제1패턴의 형상과 상기 제1발광색의 색상 중 적어도 하나에 기반하여 상기 물품의 분류유형을 결정하는 판단부; 및상기 분류유형에 따라 상기 물품을 분류 처리하는 분류부를 포함하는, 장치."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2024-0051490-4-제 13 항에 있어서,상기 반입부는 컨베이어 벨트를 포함하는 것을 특징으로 하는, 장치."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,암실을 더 포함하고, 상기 광원부와 상기 촬영부는 상기 암실 내부에 설치되는 것을 특징으로 하는, 장치."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서,상기 제1파장대역은 적어도 하나의 비가시(非可視)광선 파장대역을 포함하는 것을 특징으로 하는, 장치."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 비가시광선 파장대역은, 10nm 이상 400nm 이하의 파장길이를 가지는 적어도 하나의 자외선 파장대역을 포함하는 것을 특징으로 하는, 장치."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 13 항에 있어서, 상기 분류유형은, 상기 물품에 포함된 적어도 하나의 소재의 종류에 의하여 결정되고,상기 소재는, 플라스틱, 전지, 금속, 유기소재, 생분해소재, 비닐, 캔, 종이, 종이팩, 유리, 및 페트 중 적어도하나에 속하고,상기 분류부는, 상기 물품을 상기 소재에 기준하여 재활용 가능 물품으로 분류하여 수거하도록 구성되는 것을특징으로 하는, 장치."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "재활용품 자동 분류 마크의 형성 방법에 있어서,물품의 소재에 기반하여 분류유형을 결정하는 단계;상기 분류유형을 나타내는, 제1파장대역의 제1광선을 조사(照射)하면 제1발광색으로 발광하는 제1발광물질을 함유한 제1도료를 선택하는 단계; 및상기 물품의 표면의 적어도 일부분에 제1패턴의 형상에 따라 상기 제1도료로 자동 분류 마크를 형성하는 단계를포함하는, 방법."}
{"patent_id": "10-2022-0131212", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "재활용품 자동 분류 방법에 있어서,물품에 제1파장대역의 제1광선을 조사(照射)하는 단계;상기 물품으로부터 제1발광색으로 방사되는 제1패턴을 촬영하는 단계;공개특허 10-2024-0051490-5-상기 제1패턴의 형상과 상기 제1발광색의 색상 중 적어도 하나에 기반하여 상기 물품의 분류유형을 결정하는 단계; 및상기 분류유형에 따라 상기 물품을 분류 처리하는 단계를 포함하는, 방법"}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 재활용 분류기술에 관한 것으로, 특히 재활용품인지의 여부와 재활용품의 소재를 식별하는 마크를 이 용하여 재활용품을 자동 분류하는 기술에 대한 것이다. 상술한 기술적 과제의 해결을 위한 본 발명의 일 실시예 에 따른 표면의 적어도 일부분에 재활용품 자동 분류 마크가 형성된 물품에 있어서, 상기 자동 분류 마크는, 상 기 물품의 소재에 기반하여 형성되고, 제1패턴을 포함하며, 상기 제1패턴은 제1파장대역의 제1광선을 조사(照 射)하면 제1발광색으로 발광하는 제1발광물질을 함유하는 제1도료로 상기 표면에 형성된 것을 특징으로 할 수 있 다."}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 재활용 분류기술에 관한 것으로, 특히 재활용품인지의 여부와 재활용품의 소재를 식별하는 마크를 이 용하여 재활용품을 자동 분류하는 기술에 대한 것이다."}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 재활용품의 분리수거는 상당 부분 인력에 의존하여 배출자 또는 수거자에 의해 이루어지고 있다. 특히 재 활용 쓰레기의 수거자에게 있어서, 다양한 종류의 재활용품을 그 소재에 맞추어 적합하게 분리하는 것은 쓰레기 의 재활용율을 높이고 재활용 제품의 품질을 향상시키기 위하여 필수적인 과정이다. 따라서, 상기와 같은 분리 수거를 용이하게 할 수 있는 다양한 방법들이 제안되고 있다. 종래에 재활용 쓰레기의 용이한 분류를 위해 적용된 방법 중에는 재활용 분류기호 마크가 있다. 재활용 분류기 호는 국가표준 또는 국제표준에 의하여 지정된 재활용 제품 기호로서, 특정 물품이 어떠한 소재로 이루어졌는지 를 나타낸다. 상기 분류기호를 물품에 각인, 부착, 또는 인쇄를 통해 마크하여 제품의 배출자와 수거자가 물품 의 처분 또는 재활용 과정에 참고할 수 있도록 하는 것이다. 그러나 이러한 마크는 사람에 의해 개별적으로 인 식될 것을 전제로 한 것으로, 부착 위치가 일관적이지 않고 가시성이 낮아, 집하된 대량의 쓰레기를 처리해야 하는 상황이거나, 또는 인력이 아닌 자동화된 시스템에 의존하여야 하는 상황에서는 큰 도움이 되지 못한다. 자동화된 시스템에 의하여 재활용 쓰레기를 분류하고자 하는 종래의 방법 중에서는, 분류 대상이 되는 다양한 재활용 대상 물품 전체의 형상을 촬영한 화상을 이용하여 심층 신경망과 같은 인공지능을 학습시키고, 상기 인 공지능에 의하여 반입되는 재활용 쓰레기 중 모양이 일치하는 것을 식별하여 처리하도록 하는 방법도 존재한다. 그러나, 재활용 쓰레기 또한 본질적으로 폐기물로서 반입되는 이상, 찌그러지거나 구겨지는 등 형체가 훼손되거 나, 오염, 착색, 또는 탈색에 의하여 원래의 색상과 달라지거나, 기타 오물이 부착되는 등, 인공지능에 의한 식 별로는 학습된 형상과의 동일성을 식별하기 어려운 경우가 많게 되므로, 실제 현장에서의 적용은 매우 곤란하게 된다. 종래의 또다른 자동화 분류 기술들은 재활용 대상이 되는 물품의 물성을 이용하여 분류하는 방법을 사용하였다. 예를 들어, 특정 소재로 된 플라스틱 제품이 가지는 정전하를 이용하여 구분하거나, 특정 소재의 비중 또는 단 위 중량을 이용하여 유체 또는 기류에 의하여 분리하거나, 소재의 보편적 색상에 기준하여 구분하는 등의 방법 이 존재하였다. 그러나 이는 어디까지나 간접적인 방법으로서, 혼합, 압착, 절단, 또는 융착 등으로 인해 물성 이 기준에서 벗어난 재활용품을 구분해 내지 못하는 등의 한계가 있어 왔다."}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "상술한 바와 같은 재활용품 분류의 여러 난점을 해결하고자 한 배경기술 중 하나로, 물질의 광 특성을 이용하는 방법이 제시된 바 있다. 2017년 6월 27일자로 공개된 미국 공개특허문헌 US 2017/0210901 A1호에서 Langhals 등은 폴리머로 이루어진 물품의 형광 특성을 이용하여 물품을 구분하고자 하는 방법을 제안하였다. 통상적으로 플라스틱으로 분류되는 특정 폴리머 소재가 형성 단계에서 반드시 가지게 되는 형광 성분에 착안하여, 상기 폴 리머 소재로 이루어진 물품에 자외선을 조사한 뒤의 형광 감쇄 속도(fluorescent decay speed)에 의해 물품의 소재를 판단하여 분리하는 것이다. 또한 필요 시에는 상기 폴리머에 특정한 형광도료(fluorescent dye)를 혼입 함으로써 특정한 형광을 일으키도록 하고, 이에 의하여 물품의 소재를 판단하도록 하는 방법도 제안하였다."}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "또다른 배경기술로는 물품의 특정 위치에 식별 표지를 물리적으로 각인하는 방법이 제시된 바 있다. 2020년 12 월 3일자로 공개된 PCT 출원공개문헌 WO 2020/186234 A1에서 Sharma 등은 플라스틱으로 이루어진 물품 표면 일 부에 음각 또는 양각 수단을 이용하여 소재 정보를 알리는 물리적 마크를 배치하고, 상기 물품에 조명을 조사하 였을 때 상기 마크가 식별됨으로써 물품의 소재를 판단하여 분리하는 방법을 제안하였다."}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "발명의 내용"}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 Langhals 등의 공개문헌에 나타난 종래기술은, 폴리머 계통의 소재 중 일부 제한된 경우에 한해서만 동 작하며, 이러한 제한을 극복하고자 하는 경우 용융된 상태의 폴리머 플라스틱 원재료 단계에서부터 형광도료를 혼입하여야 하고, 또한 그 혼입 방법이 규격화되어 공유되어야 하는 한계가 있다. 또한, 용융 상태에서 성형을 통해 제조되는 폴리머 또는 플라스틱 소재 이외에, 종이, 금속, 유리와 같은 다른 재활용 대상 물질에 적용할 수 없다. 따라서, 재활용 가능한 물품의 생산 공정 전반에 용이하게 적용하는 데에 곤란함이 있다. 또한 상술한 Sharma 등의 공개문헌에 나타난 종래기술은, 제품의 표면 매질에 별도의 세공을 가하여야 하는데, 이러한 공정은 물품의 외면에 손상을 일으킬 수 있으며, 특히 병과 같이 외면의 두께가 얇은 경우 천공 등으로 인한 물품 파손의 우려가 있어, 현실적으로 적용하기 곤란하다는 문제가 있다. 또한, 비록 스티커나 레이블에 인쇄되는 마크에 비하여 내구성과 가시성 면에서의 우위를 주장하지만, 표면 일부에만 마크가 존재하여 손상의 우려가 크고, 마크 부분에 깨짐, 긁힘 등의 변형이 있는 경우 마크를 인식할 수 없으며, 또한 표면에 가공된 흔 적을 남김으로 인하여 물품의 소비자에게 있어 미관상 불편함을 준다는 곤란함이 있다. 본 발명은 상술한 종래기술들이 가진 문제점을 해결하여 보다 우수하고 편리하게 재활용품을 자동적으로 분류 처리할 수 있도록 하는 데 목적이 있다."}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제의 해결을 위한 본 발명의 일 실시예에 따른 표면의 적어도 일부분에 재활용품 자동 분류 마 크가 형성된 물품에 있어서, 상기 자동 분류 마크는, 상기 물품의 소재에 기반하여 형성되고, 제1패턴을 포함하 며, 상기 제1패턴은 제1파장대역의 제1광선을 조사(照射)하면 제1발광색으로 발광하는 제1발광물질을 함유하는 제1도료로 상기 표면에 형성된 것을 특징으로 할 수 있다. 상기 자동 분류 마크는, 상기 제1패턴의 형상 또는 상기 제1발광색의 색상 중 적어도 하나에 의하여 상기 물품 의 분류유형을 나타내도록 형성된 것일 수 있다. 상기 자동 분류 마크는, 플라스틱, 전지, 금속, 유기소재, 생분해소재, 비닐, 캔, 종이, 종이팩, 유리, 및 페트 중 적어도 하나에 속하는 상기 물품의 소재를 나타내도록 형성된 것일 수 있다. 상기 제1파장대역은 적어도 하나의 비가시(非可視)광선 파장대역을 포함하는 것을 특징으로 할 수 있다. 상기 비가시광선 파장대역은, 10nm 이상 400nm 이하의 파장길이를 가지는 적어도 하나의 자외선 파장대역을 포 함하는 것을 특징으로 할 수 있다. 상기 자동 분류 마크는 상기 제1광선의 조사 없이는 가시광선 하에서 투명한 것을 특징으로 할 수 있다. 상기 자동 분류 마크는 제2패턴을 더 포함하고, 상기 제2패턴은 제2파장대역의 제2광선을 수광하고 제2발광색으 로 발광하는 제2발광물질을 함유한 제2도료로 상기 표면에 형성된 것을 특징으로 할 수 있다. 상기 자동 분류 마크는 상기 물품의 표면에 인쇄된 것일 수 있다. 상기 자동 분류 마크는 인쇄물을 상기 물품의 표면에 부착하여 형성된 것일 수 있다. 상기 자동 분류 마크는 상기 물품을 구성하는 소재물질에 상기 제1도료를 혼입(混入)하여 형성된 것일 수 있다. 상기 제1발광물질은, 상기 제1광선을 조사하면 제1발광색을 방사하는 형광(螢光)특성을 가지는 것을 특징으로 할 수 있다. 상기 제1발광물질은, 상기 제1광선을 조사한 이후 제거하여도 제1발광색으로 발광을 지속하는 인광(燐光)특성을 가지는 것을 특징으로 할 수 있다. 상술한 기술적 과제의 해결을 위한 본 발명의 일 실시예에 따른 재활용품 자동 분류 장치는, 장치에 물품을 반 입하는 반입부, 상기 물품에 제1파장대역의 제1광선을 조사(照射)하는 광원부, 상기 물품으로부터 제1발광색으 로 방사되는 제1패턴을 촬영하는 촬영부, 상기 제1패턴의 형상과 상기 제1발광색의 색상 중 적어도 하나에 기반 하여 상기 물품의 분류유형을 결정하는 판단부, 및 상기 분류유형에 따라 상기 물품을 분류 처리하는 분류부를 포함할 수 있다. 상기 반입부는 컨베이어 벨트를 포함하는 것을 특징으로 할 수 있다. 상기 장치는, 암실을 더 포함하고, 상기 광원부와 상기 촬영부는 상기 암실 내부에 설치되는 것을 특징으로 할 수 있다. 상기 제1파장대역은 적어도 하나의 비가시(非可視)광선 파장대역을 포함하는 것을 특징으로 할 수 있다. 상기 비가시광선 파장대역은, 10nm 이상 400nm 이하의 파장길이를 가지는 적어도 하나의 자외선 파장대역을 포 함하는 것을 특징으로 할 수 있다. 상기 분류유형은, 상기 물품에 포함된 적어도 하나의 소재의 종류에 의하여 결정되고, 상기 소재는, 플라스틱, 전지, 금속, 유기소재, 생분해소재, 비닐, 캔, 종이, 종이팩, 유리, 및 페트 중 적어도 하나에 속하고, 상기 분 류부는, 상기 물품을 상기 소재에 기준하여 재활용 가능 물품으로 분류하여 수거하도록 구성되는 것을 특징으로 할 수 있다. 상술한 기술적 과제의 해결을 위한 본 발명의 일 실시예에 따른 재활용품 자동 분류 마크의 형성 방법은, 물품 의 소재에 기반하여 분류유형을 결정하는 단계, 상기 분류유형을 나타내는, 제1파장대역의 제1광선을 조사(照射)하면 제1발광색으로 발광하는 제1발광물질을 함유한 제1도료를 선택하는 단계, 및 상기 물품의 표면 의 적어도 일부분에 제1패턴의 형상에 따라 상기 제1도료로 자동 분류 마크를 형성하는 단계를 포함할 수 있다. 상술한 기술적 과제의 해결을 위한 본 발명의 일 실시예에 따른 재활용품 자동 분류 방법은, 물품에 제1파장대 역의 제1광선을 조사(照射)하는 단계, 상기 물품으로부터 제1발광색으로 방사되는 제1패턴을 촬영하는 단계, 상 기 제1패턴의 형상과 상기 제1발광색의 색상 중 적어도 하나에 기반하여 상기 물품의 분류유형을 결정하는 단계, 및 상기 분류유형에 따라 상기 물품을 분류 처리하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의한 재활용품 자동 분류 마크는 물품의 형상이 완성된 이후라면 생산, 유통, 폐기에 이르는 어느 단 계에서 적용되어도 무방하기 때문에, 필요한 영역에서 빠른 속도로 적용하여 용이하게 활용할 수 있다는 이점이 있다. 또한 본 발명에 의한 재활용품 자동 분류 마크는 물품 표면의 넓은 영역에 배치되므로, 재활용 물품이 폐기되는 과정에서 발생하는 혼합, 압착, 절단, 융착과 같은 변형에도 불구하고 소재 식별 능력을 유지한다는 이점이 있 다. 나아가, 본 발명에 의한 재활용품 자동 분류 마크는 물품 표면에 넓게 분포하면서도 비가시적으로 형성될 수 있 어, 물품의 소비자에게 있어 미관상 불편함이나 혼란을 주지 않는다는 이점이 있다. 마지막으로, 본 발명에 의한 재활용품 자동 분류 마크는 비가시적 도료를 도색할 수 있다면 플라스틱 이외의 모 든 제품에 적용이 가능하므로 거의 모든 재활용 대상 물품의 자동 분류를 가능하게 할 수 있다는 이점이 있다."}
{"patent_id": "10-2022-0131212", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. \"및/또는\"이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함하며, 또한, 달리 지시되지 않는 한 비배 타적이다. 본 출원에 항목을 열거하는 경우 그것은 본 출원 발명의 사상과 가능한 실시 방법들을 용이하게 설명 하기 위한 예시적 서술에 그치며, 따라서, 본 발명의 실시예 범위를 한정하는 의도를 가지지 아니한다. 본 명세서에서 \"A 또는 B(A or B)\"는 \"오직 A\", \"오직 B\" 또는 \"A와 B 모두\"를 의미할 수 있다. 달리 표현하면, 본 명세서에서 \"A 또는 B(A or B)\"는 \"A 및/또는 B(A and/or B)\"으로 해석될 수 있다. 예를 들어, 본 명세서에 서 \"A, B 또는 C(A, B or C)\"는 \"오직 A\", \"오직 B\", \"오직 C\", 또는 \"A, B 및 C의 임의의 모든 조합(any combination of A, B and C)\"를 의미할 수 있다. 본 명세서에서 사용되는 슬래쉬(/)나 쉼표(comma)는 \"및/또는(and/or)\"을 의미할 수 있다. 예를 들어, \"A/B\"는 \"A 및/또는 B\"를 의미할 수 있다. 이에 따라 \"A/B\"는 \"오직 A\", \"오직 B\", 또는 \"A와 B 모두\"를 의미할 수 있다. 예를 들어, \"A, B, C\"는 \"A, B 또는 C\"를 의미할 수 있다. 본 명세서에서 \"적어도 하나의 A 및 B(at least one of A and B)\"는, \"오직 A\", \"오직 B\" 또는 \"A와 B 모두\"를 의미할 수 있다. 또한, 본 명세서에서 \"적어도 하나의 A 또는 B(at least one of A or B)\"나 \"적어도 하나의 A 및/또는 B(at least one of A and/or B)\"라는 표현은 \"적어도 하나의 A 및 B(at least one of A and B)\"와 동 일하게 해석될 수 있다. 또한, 본 명세서에서 \"적어도 하나의 A, B 및 C(at least one of A, B and C)\"는, \"오직 A\", \"오직 B\", \"오직 C\", 또는 \"A, B 및 C의 임의의 모든 조합(any combination of A, B and C)\"를 의미할 수 있다. 또한, \"적어도 하나의 A, B 또는 C(at least one of A, B or C)\"나 \"적어도 하나의 A, B 및/또는 C(at least one of A, B and/or C)\"는 \"적어도 하나의 A, B 및 C(at least one of A, B and C)\"를 의미할 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 이용하여 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 출원에서 발명을 설명함에 있어, 실시예들은 설명된 기능 또는 기능들을 수행하는 단위 블록들의 측면에서 설명되거나 예시될 수 있다. 상기 블록들이란 본 출원에서 하나 또는 복수의 장치, 유닛, 모듈, 부 등으로 표현 될 수 있다. 상기 블록들은 하나 또는 복수의 논리 게이트, 집적 회로, 프로세서, 컨트롤러, 메모리, 전자 부품 또는 이에 한정되지 않는 정보처리 하드웨어의 구현 방법에 의하여 하드웨어적으로 실시될 수도 있다. 또는, 상 기 블록들은 응용 소프트웨어, 운영 체제 소프트웨어, 펌웨어, 또는 이에 한정되지 않는 정보처리 소프트웨어의 구현 방법에 의하여 소프트웨어적으로 실시될 수도 있다. 하나의 블록은 동일한 기능을 수행하는 복수의 블록들 로 분리되어 실시될 수도 있으며, 반대로 복수의 블록들의 기능을 동시에 수행하기 위한 하나의 블록이 실시될 수도 있다. 상기 블록들은 또한 임의의 기준에 의하여 물리적으로 분리되거나 결합되어 실시될 수 있다. 상기 블록들은 통신 네트워크, 인터넷, 클라우드 서비스, 또는 이에 한정되지 않는 통신 방법에 의해 물리적 위치가 특정되지 않고 서로 이격되어 있는 환경에서 동작하도록 실시될 수도 있다. 상기의 모든 실시 방법은 동일한 기 술적 사상을 구현하기 위하여 통상의 기술자가 취할 수 있는 다양한 실시예의 영역이므로, 여하의 상세한 구현 방법은 모두 본 출원상 발명의 기술적 사상 영역에 포함되는 것으로 해석되어야 한다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 또한 복수의 실시예들은 서로 배타적이 아니며,일부 실시예들이 새로운 실시예들을 형성하기 위해 하나 이상의 다른 실시예들과 조합될 수 있음을 전제로 한다. 마크의 형상 및 적용 본 발명에서는 재활용품으로서 분류될 수 있는 물품의 표면에 재활용품 자동 분류 마크를 형성하여 상기 물품을 재활용 소재 유형에 따라 자동으로 용이하게 분류할 수 있도록 한다. 도 1은 본 발명이 제안하는 자동 분류 마크의 형태에 대한 기본 개념을 나타낸 개념도이다. 먼저, 임의의 물품의 표면을 가정한다. 상기 표면에는 도료에 의하여 마킹이 형성될 수 있다. 본 발명에서 이용될 수 있는 상기 도료는 무색(無色)일 수 있고, 일반적인 가시광선 조명 하에서는 빛을 투과하여 투명하게 보일 수 있다. 상기 표면이 투명한 경우에 상기 빛은 상기 표면을 연속해서 투과 함으로써 상기 도료가 사람의 눈에 의하여 식별되지 아니할 수 있고, 그 외에 상기 표면이 반투명 하거나 불투명한 경우에는 상기 표면에서 비로소 반사되어 상기 표면의 색상만이 나타나게 될 수 있다. 그러나, 상기 도료에 특정한 파장의 광선을 조사(照射)하는 경우, 상기 도료는 특징적인 색상 또는 파장을 가진 빛을 방사할 수 있다. 이렇게 특정한 파장의 광선에 대하여 방사되는 빛을 촬영수단 에 의하여 획득함으로써, 평소에는 무색으로 보이지 않으면서도 특수한 환경에서는 식별 가능한 자동 분류 마크를 물품의 표면에 형성할 수 있게 된다. 종래의 기술에서, 물품의 고정된 위치에 재활용 분류유형을 나타내는 마크를 형성하고자 하는 경우 실제 재활용 공정에서는 상기 마크의 관측이 용이하지 않고, 또한 레이블과 같은 부착물의 표기사항을 기준으로 상기 분류유 형을 결정하고자 하는 경우 상기 부착물의 훼손 또는 탈락의 위험이 크다는 단점이 있었다. 나아가, 상기 자동 분류 마크가 표면 전체를 덮도록 형성된 경우, 제품의 외면 디자인에 막대한 영향을 주어 물품의 미관을 해칠 수 있다는 한계가 있었다. 본 발명은 상술한 한계를 상기 도료와 같이 가시광선에 대해서는 투명하고 특정 광선에 의해서만 식별되는 자동 분류 마크를 통해 극복하며, 그뿐 아니라 그 외의 다양한 영역에서 사용될 수 있는 자동 분류 마크의 기술을 제안한다. 도 2는 본 발명의 일 실시예에 의하여 표면에 자동 분류 마크가 형성된 물품을 나타내는 예시도이다. 본 발명의 적용 대상이 되는 물품은 재활용 가능한 소재로 이루어진 표면을 가진 물품일 수 있으며, 도 2에서는 음료 수 병으로 묘사되어 있다. 상기 물품의 소재는 일반적으로 재활용 가능 소재로서 분류되는 것이라면 제한되지 아니한다. 예를 들어, 상기 물품은 PET를 포함하는 플라스틱 소재이거나, 다양한 색상의 유리 소재이거나, 알루미늄, 철 등을 포함하는 금속 소재이거나, 도자기를 포함하는 세라믹 소재이거나, 또는 종이 가공품 또는 목재 가공품 소재여도 무방하고, 그 밖에 어떠한 소재로 구성되더라도 소재의 유형이 식별되는 한 본 발명의 실 시에는 영향을 주지 않는다. 마찬가지로, 도 2에서는 물품의 실시예 중 음료수 병을 대표적 예시로 하여 도시하였으나, 상기 물품은 병을 포함하는 다양한 다른 목적의 용기일 수 있고, 또는 플라스틱, 유리, 철, 세라 믹, 종이, 목재를 포함하는 재활용 가능한 재료로 구성되는 부품 또는 완제품 중 어떠한 것이더라도 표면을 특 정할 수 있는 물품이라면 본 발명의 실시에는 영향을 주지 않는다. 본 발명에 의하여 표면의 적어도 일부분에 재활용품 자동 분류 마크가 형성된 상기 물품은, 예시적으로, 표면과 레이블과 레이블 상의 표기사항을 포함할 수 있다. 상기 물품은 육안으로 일반적 환경에서 관측하였을 때는 일반적인 다른 물품과 다른 점이 발견되지 않도록 구성될 수 있다. 상기 일반적 환경이란, 예를 들어, 햇빛 또는 실내조명에 의한 가시광선 대역의 반사광이 발생하는 환경을 의미할 수 있다. 본 발명의 일 실시예에서, 상기 자동 분류 마크는 표면의 전체에 걸쳐 형성될 수 있다. 상기 자동 분 류 마크는 상기 물품의 분류유형에 기반하여 형성될 수 있으며, 본 발명의 바람직한 실시예에 따르면, 상기 분류유형은 상기 물품이 어떤 소재로 재활용되어야 하는지를 명시하는 상기 물품의 소 재에 기반한 분류유형일 수 있다. 본 발명의 바람직한 일 실시예에서, 상기 물품은 일반적 환경에서는 투명하지만 특정한 환경에 서 관측하였을 때만 관측되는 자동 분류 마크가 표면에 형성된 형태로 관측될 수 있다. 상기 특정한 환경이란, 실시예에 따라서는 자외선 램프가 상기 병에 조사되고 있는 환경을 의미하고, 상기 자동 분류 마크는 자외선 반응 형광 특성을 가진 도료를 사용하여 형성되었을 수 있다. 예를 들면, 상기 도료가 특정 파장길이의 자외선을 받았을 때에만 일정한 형광색을 방사하는 형광도료인 경우, 이를 사용하여 상기 자동분류 마크를 형성한다면, 자외선이 강하게 조사(照射)되지 않는 일반적 환경에서는 상기 형광도료의 색상 방사가 일어나지 않으므로 상기 자동 분류 마크가 표면에서 투명하게 보이는 것이 가능할 수 있 다. 본 발명의 실시예에 따라서는, 상기 물품의 소재에 따라 상기 자동 분류 마크의 형태가 달라지고, 따 라서 서로 다른 자동 분류 마크의 형태에 따라 상기 물품이 서로 다른 소재 분류유형에 의하여 자동 으로 분류되도록 구성될 수 있다. 상기 서로 다른 자동 분류 마크의 형태는 상기 표면에 형성되는 패턴과 도료에 따라 서로 구분될 수 있다. 예를 들어, 도 2의 실시예에서는, 상기 표면에 일정한 각도의 수직선을 따라 소정의 세로 간격을 두 고 별 모양의 마크를 배치함으로써 상기 자동 분류 마크가 형성되어 있고, 이러한 배치 방식을 제1패턴이 라고 칭할 수 있다. 또한 상기 마크를 표면에 형성하기 위해 사용된 특정한 유형의 형광 도료를 제1도료라고 칭 할 수 있다. 따라서, 도 2의 실시예에 나타난 상기 제1패턴을 제1도료로 형성한 자동 분류 마크는 제1패턴을 제2도료로 형성한 것(즉, 동일한 도형이지만 서로 다른 발광색을 방사하는 것), 또는 제2패턴을 제1도료로 형성한 것(즉, 동일한 발광색을 나타내나 도형의 모양 또는 배치가 다른 것), 또는 제2패턴을 제2도료로 형성한 것(다른 발광 색으로 발광하는 다른 모양과 배치의 도형)과 서로 구분되어 다른 소재를 나타내도록 구성될 수 있다. 즉, 상기 제1패턴은 본 발명의 실시예에 따라서는 적어도 둘 이상의 다양한 패턴들 가운데 선택될 수 있으며, 상기 제1도료는 본 발명의 실시예에 따라서는 적어도 둘 이상의 다양한 도료 가운데 선택될 수 있다. 본 발명의 일 실시예에 따르면, 상기 자동 분류 마크의 형태는, 통상적인 재활용 물품 분류유형, 즉 예를 들어 플라스틱, 전지, 금속, 유기소재, 생분해소재, 비닐, 캔, 종이, 종이팩, 유리, 및 페트 중 적어도 하나에 속하는 상기 물품의 소재를 나타내는 것일 수 있으며, 상기 각각의 소재마다 상기 자동 분류 마크는 다른 형태를 취할 수 있다. 본 발명의 다른 실시예에 따르면, 상기 자동 분류 마크의 형태는, 페트(PET; polyethylene terephthalate), HDPE(high-density polyethylene), LDPE(low-density polyethylene), PVC(polyvinyl chloride), 폴리프로필렌(PP; polypropylene), 폴리스티렌(PS; polystyrene), 폴리카보네이트(PC; polycarbonate), 폴리아미드(PA; polyamide), SAN(styrene acrylonitrile), PAN(acrylic plastics/polyacrylonitrile), 바이오플라스틱, ABS(acrylonitrile butadiene styrene), 나일론 폴리아미드, 기타 플라스틱, 납 전지, 알카라인 전지, 니켈 카드뮴(NiCD; nickel-cadmium) 전지, 니켈 메탈수소(NiMH; nickel-metal hydrates) 전지, 리튬 전지, 산화은(SO; silver oxide) 전지, 탄소 아연(CZ; carbon-zinc) 전지, 골판지, 판지, 포장지, 코팅지, 기타 종이, 철, 스틸, 스틸 캔, 양철, 양철 캔, 알루미늄, 알루미늄 캔, 나무, 코르크, 면, 삼베, 기타 직물, 투명 유리, 녹색 유리, 갈색 유리, 어두운 착색 유리, 밝은 착색 유리, 납유리, 크리스털, 동유리, 은유리, 금유리, 기타 유리, 종이-금속 합성물, 종이-플라스틱 합성물, 종이-알루미늄 합성 물, 종이-양철 합성물, 종이-플라스틱-알루미늄 합성물, 생분해성 플라스틱, 생분해성 비닐, 플라스틱-알루미늄 합성물, 플라스틱-양철 합성물, 플라스틱-금속 합성물, 유리-플라스틱 합성물, 유리-알루미늄 합성물, 유리-양 철 합성물, 및 유리-금속 합성물 중 적어도 하나에 속하는 상기 물품의 소재를 나타내는 것일 수 있으며, 상기 각각의 소재마다 상기 자동 분류 마크는 다른 형태를 취할 수 있다. 상기 자동 분류 마크의 형성을 위해 제1도료 및 제1패턴을 적용함에 있어서, 본 발명의 실시자는 종래에 알려진 또는 새로이 개발되는 다양한 기술을 이용하여 상기 자동 분류 마크를 분류대상이 되는 물품 에 형성할 수 있다. 본 발명에서는 상술한 바와 같이 제1발광물질을 함유한 제1도료 등을 적용하는 바, 상기 형 성의 과정을 이하 \"도색\"으로 표현하여 예시하기로 한다. 단, 형성의 수단은 그 외에도 다양하게 선택될 수 있 고 또한 수단에 따라 적합한 동사에 의하여 표현될 수 있으며, 상기 \"도색\"이라는 표현은 본 발명의 실시방법을 한정하고자 하는 의도를 갖지 아니한다. 본 발명의 일 실시예에 따르면, 상기 자동 분류 마크는 상기 물품의 표면에 상기 제1도료를 이용하여 상기 제1패턴을 인쇄함으로써 도색될 수 있다. 상기 인쇄란 상기 물품 위에 상기 도료를 정해진 방법에 의하여 위치시키는 방법으로, 도포, 분사, 전사, 및 증착과 같은 방법에 의하여 이루어질 수 있다. 상기 도료는 발광물 질을 함유하는 한 도포에 적합한 잉크 또는 페인트, 분사에 적합한 페인트 또는 스프레이/에어브러시용 잉크, 전사에 적합한 토너, 증착에 적합한 분체도장용 분말 도료와 같이 도색 방법에 적합한 형태로 제공될 수 있으며, 도색 수단과 도료의 형태의 조합은 상기 예시에 한정되지 않는다.본 발명의 다른 실시예에 따르면, 상기 자동 분류 마크는 상기 제1도료를 이용하여 상기 제1패턴이 인쇄된 인쇄물(예를 들어, 레이블)을 상기 물품의 표면에 부착하여 도색될 수 있다. 상기 인쇄물은 상기 인 쇄의 예시와 같이 도포, 분사, 전사, 및 증착과 같은 방법에 의해 상기 자동 분류 마크가 인쇄되어 있는 것으로, 제품 포장 또는 표기에 사용되는 종이 또는 비닐제 레이블, 또는 플라스틱 또는 금속제 상품 태그와 같 은 물체일 수 있다. 상기 인쇄물은 또한 상기 물품에 래핑(wrapping)방식으로 감싸지거나, 접착제 등에 의하여 접착되거나, 열 등에 의하여 융착되거나, 못, 나사, 또는 고리와 같은 수단에 의하여 고정되는 방법으로 부착될 수 있다. 상기 인쇄물의 소재, 제작 방식, 및 물품에 대한 부착 방식은 상기 예시에 한정되지 않는다. 본 발명의 또다른 실시예에 따르면, 상기 자동 분류 마크는 상기 물품을 구성하는 소재물질에 상기 제1도 료를 혼입(混入)하여 상기 제1패턴의 형태로 나타냄으로써 도색될 수 있다. 예를 들어, 상기 소재물질이 가소성 플라스틱인 경우 상기 물품(예를 들어, 병)을 형성하기 전 단계의 용융된 플라스틱에 상기 도료를 혼입하 여 실질적으로 상기 물품의 전체 영역에 상기 도료를 도색한 효과를 얻을 수 있다. 또는, 상기 물품이 금속에 의하여 도금되는 경우, 상기 도금되는 금속에 상기 도료를 혼입하여 상기 도료에 의한 도색의 효과를 획득할 수 있다. 상기 물품의 소재물질에 상기 도료를 혼입하고 또한 의도하는 바에 따라 상기 패턴의 형태로 형성하는 방 법은 상술한 실시방법을 실현하기 위한 다양한 다른 방법에 의하여 구현될 수 있으며, 상기 예시에 한정되지 않 는다. 도료의 실시방법과 다양한 실시예 이하 상기 제1도료의 실시방법과 관련하여 보다 상세히 서술한다. 본 발명의 일 실시예에서, 상기 제1도료는 제1파장대역의 제1광선을 조사(照射)하면 제1발광색으로 발광하는 제 1발광물질을 함유하는 도료로 정의될 수 있다. 상기 제1파장대역은 적어도 하나의 비가시(非可視)광선 파장대역을 포함할 수 있고, 보다 구체적으로는, 상기 비가시광선 파장대역은, 10nm 이상 400nm 이하의 파장길이를 가지는 적어도 하나의 자외선 파장대역을 포함할 수 있다. 따라서, 본 발명의 바람직한 일 실시예에서, 상기 제1광선은 상술한 대역 내의 파장길이를 가지는 자 외선으로 정의될 수 있다. 또한 상술한 일반적 환경에서의 투명성을 보장하기 위하여, 상기 제1도료는 상 기 제1광선의 조사 없이는 가시광선 하에서 투명하게 나타나는 도료일 수 있다. 상기 제1도료에 포함되는 상기 제1발광물질은 종래에 알려진, 또는 새로이 개발되는 어떠한 발광물질이더라도 무방하다. 발광 방법의 화학적 유형에 있어서, 본 발명의 실시예에 따라서, 상기 제1발광물질은 본 발명의 실시 예에 따라서 상기 제1광선을 조사하면 상기 제1광선의 에너지에 반응하여 제1발광색을 방사하는 형광(螢光; fluorescent)특성을 가지는 것일 수 있고, 또는, 상기 제1발광물질은, 상기 제1광선을 조사한 이후 상기 제1광 선을 제거하더라도 상기 제1광선의 에너지를 축적하여 방출함으로써 화학적 방법으로 결정되는 일정 시간 동안 제1발광색으로 발광을 지속하는 인광(燐光; phosphorescent)특성을 가지는 것일 수 있다. 또한 그 밖에 일정한 조건에서 발광을 일으키는 어떠한 물질이 본 발명의 실시에 사용되어도 무방하다. 또한, 발명을 실시하는 데 있어서 상기 제1파장대역 및 상기 제1광선이 반드시 자외선이어야 할 필요는 없다. 본 발명의 바람직한 일 실시예에서, 상기 제1발광물질은 자외선 파장대역의 상기 제1광선을 받아 가시광선 대역 의 제1발광색을 방사하는 물질일 수 있다. 그러나, 본 발명의 다른 실시예에서, 상기 제1발광물질은 가시광선인 제1광선을 받으면 자외선 또는 적외선 대역 등 비가시광선 파장대역에서 제1발광색을 발사하는 물질일 수 있다. 또 다른 실시예에서, 상기 제1발광물질은 매우 조밀한 파장의 빛으로 정의되는 X-레이, 알파선, 또는 감마선과 같은 방사선으로 구성된 제1광선을 받아 특정 파장대역의 제1발광색을 방사하는 방사능 민감성 마커에 속할 수 있다. 상기의 각 실시예를 통한 설명으로부터, 상기 제1발광물질은 입사광(入射光)으로서의 상기 제1광선이 상기 제1 파장대역에 속하는 경우 소정의 파장대역에 속하는 상기 제1발광색을 방사하는 특성을 가진 물질이라면 무엇이 든 본 발명의 실시를 위해 사용될 수 있고, 그러한 모든 변용이 본 발명에 포함되는 각기 다른 실시방법일 뿐이 라는 것을 통상의 기술자는 용이하게 알 수 있을 것이다. 상기 제1도료는 반드시 투명할 필요는 없다. 상기 제1도료의 투명함은 본래 투명하거나 형성된 기호 등이 없어 야 하는 표면에 상기 자동 분류 마크를 형성할 때 요구될 수 있다. 반면에, 상기 자동 분류 마크 를 사람이 관측 가능하여도 무방한 경우, 예를 들면 레이블 상에 형성되는 마크의 경우, 의도에 따라서는 가시광선 하에서 불투명 또는 반투명한 색을 발산하는 일반적 도료의 특성을 가지거나, 또는 그러한 일반 적 도료와 혼합되어 사용될 수 있다. 상기 자동 분류 마크의 가장 주요한 특징은 상기 제1발광색의 방사 가능성에 있는 바, 그 이외의 영역에 대한 변용은 모두 본 발명에 포함되는 각기 다른 실시방법일 뿐임을 통상 의 기술자는 쉽게 이해할 수 있을 것이다. 패턴의 실시방법과 다양한 실시예 이어서, 이하 상기 예시된 제1패턴의 실시방법과 관련하여 보다 상세히 서술한다. 상술하였듯, 도 2의 특정한 환경에 대한 예시도에서는 이러한 실시예를 나타내고 있어서, 상기 자동 분류 마크의 제1패턴에 대한 일 실시예를 나타내고 있다. 도 2에 나타난 본 발명의 일 실시예에 따르면, 상기 제1패턴은 물품의 표면은 물론 레이블과 표기사항에도 중첩되어 형성되어 있을 수 있다. 이렇게 물품의 외면 전체를 덮는 자동 분류 마크의 가시성을 위해, 외면의 표기사항은 상기 자 동 분류 마크를 형성하는 상기 제1도료와 달리 상기 제1광선 하에서 식별력이 낮게 되는 도료로 표기되어 있을 수 있다. 도 3은 본 발명의 일 실시예에 의하여 자동 분류 마크를 부분적으로 형성하는 방법의 예시도이다. 본 발명의 실 시예에 따라서는, 상기 자동 분류 마크는 상기 물품의 표면 특정 부분에 제한적으로 형성될 수 있다. 본 발명의 일 실시예에 의한 물품에는, 자동 분류 마크가 레이블을 제외한 (또는, 레이블 의 하면으로) 병의 표면에만 형성되어 있다. 위 실시예의 물품에서와 같이, 상기 자동 분류 마 크는 상기 레이블 등의 부착물과는 무관하게 재활용 대상이 되는 몸체 부분의 표면에만 형성될 수 있다. 본 발명의 다른 실시예에 의한 물품에는, 자동 분류 마크가 레이블에만 형성되어 있다. 위 실시 예의 물품에서와 같이, 상기 자동 분류 마크는 상기 레이블 등의 부착물에 의하여 재활용 대상 이 되는 몸체 부분의 표면에 형성될 수 있다. 본 발명의 또다른 실시예에 의한 물품에서는, 자동 분류 마크가 복수의 영역에 서로 다른 형태 로 형성되는 예시가 나타난다. 이 때 제1 자동 분류 마크(363-1)는 병뚜껑(323-1) 부분에 사용된 소재를 나타내 기 위하여 상기 병뚜껑(323-1)의 표면에 지정된 제1영역(353-1)에 부분적으로 형성된 제1패턴 및 제1형광물질에 의한 마크일 수 있다. 또한, 제2 자동 분류 마크(363-2)는 레이블(323-2) 부분에 사용된 소재를 나타내기 위하 여 상기 레이블(323-2)의 표면에 지정된 제2영역(353-2)에 부분적으로 형성된 제2패턴 및 제2형광물질에 의한 마크일 수 있다. 또한, 제3 자동 분류 마크(363-3)는 병 몸체(323-3) 부분에 사용된 소재를 나타내기 위하여 상 기 병 몸체(323-3)의 표면에 지정된 제3영역(353-3)에 부분적으로 형성된 제3패턴 및 제3형광물질에 의한 마크 일 수 있다. 위 실시예의 물품에서와 같이, 상기 자동 분류 마크는 하나의 물품을 구성하는 다 양한 부분의 각기 다른 소재를 나타내기 위하여 각각의 재활용 대상이 되는 부분의 지정 영역에 제한 적으로 형성될 수 있다. 도 4는 본 발명의 일 실시예에 의하여 자동 분류 마크의 패턴을 다양하게 구성하는 방법에 대한 예시도이다. 본 발명에 의하여 상기 자동 분류 마크를 형성하는 패턴은 자동화된 방법에 의하여 식별될 수 있는 모든 형태를 포 함하나, 그 중 유용한 일부 실시예를 도 4에서 소개한다. 본 발명의 일 실시예에서, 상기 자동 분류 마크는 물품의 표면에 일정한 간격을 두고 제1도료가 도색 된 제1패턴에 의하여 형성될 수 있다. 상기 자동 분류 마크는 상기 제1도료가 도색된 부분에 제1광선 이 조사되었을 때 상기 제1패턴의 형태로 방사되는 제1발광색에 의하여 식별될 수 있다. 따라서, 예를 들 어, 상기 자동 분류 마크와 분류유형이 구분되는 다른 마크에서는 상기 제1패턴의 형태로 제2발광색 을 방사하는 제2도료를 도색하도록 구성될 수 있다. 또한, 상기 제1패턴을 구성하는 도색 도형의 형태는 원, 사각형, 다각형, 선, 그 밖의 폐곡선모양을 포함하는 다양한 형태로 실시되어도 무방하며, 또다른 마크 는 그러한 응용의 사례를 나타낸다. 상기 실시예의 자동 분류 마크 형성 방법은 도료의 양을 절약할 수 있 는 장점이 있다. 본 발명의 다른 실시예에서, 상기 자동 분류 마크는 물품의 표면 전체에 제1도료가 고르게 도색되는 것을 제1패턴으로 하여 형성될 수 있다. 자동 분류 마크는 물품의 표면 임의의 위치에 제1광선이 조사되었 을 때 방사되는 제1발광색에 의하여 식별될 수 있으며, 따라서, 예를 들어, 상기 자동 분류 마크와 분류유형이구분되는 다른 마크는 제2발광색을 방사하는 제2도료를 도색하는 방법으로 구성될 수 있다. 상기 실시예의 자동 분류 마크 형성 방법은 전체 도색을 통하여 도색과 검출 과정이 모두 단순하게 구현되는 장점이 있다. 본 발명의 다른 실시예에서, 상기 자동 분류 마크는 제1도료가 제1도형패턴에 의하여 도색된 제1패턴(42 1)에 의하여 형성될 수 있다. 상기 자동 분류 마크은 상기 제1도료가 도색된 부분에 제1광선이 조사되었을 때의 제1발광색에 의하여 식별될 수 있고, 또는 상기 제1발광색에 의하여 상기 표면에서 관찰되는 상기 제1패턴 의 형태에 의하여서도 식별될 수 있으며, 상기 제1발광색과 상기 제1패턴의 조합에 의하여서도 식별될 수 있다. 따라서, 예를 들어, 상기 자동 분류 마크와 분류유형이 구분되는 다른 마크는 제2도형패턴의 형태로 상기 제1도료를 도색하는 방법으로 구성될 수 있다. 상기 실시예의 자동 분류 마크 형성 방법은 도형패턴의 유형을 달리함으로써 의하여 동일한 도료 또는 적은 종류의 도료를 이용하여서도 다양한 분류유형을 나타낼 수 있다는 장점이 있다. 본 발명의 또다른 실시예에서, 상기 자동 분류 마크는 제1도료가 제1도형패턴에 의하여 도색된 제1패턴 과 제2도료가 제2도형패턴에 의하여 도색된 제2패턴의 결합에 의하여 형성될 수 있다. 상기 제1패턴 은 상기 제1도료가 도색된 부분에 제1광선이 조사되었을 때의 제1발광색에 의하여 상기 표면에서 관찰되는 제1패턴의 형태와, 상기 제2도료가 도색된 부분에 제1광선이 조사되었을 때의 제2발광색에 의하여 상기 표면에 서 관찰되는 제2패턴의 형태 각각의 발광색, 형태, 또는 둘 모두에 의하여 식별될 수 있다. 따라서, 상기 자동 분류 마크와 분류유형이 구분되는 다른 마크는 도료나 도형패턴 중 적어도 하나를 달리하는 방법으로 구성될 수 있다. 예를 들어, 상기 마크와 구분되는 다른 마크는 제1도료가 제1도형패턴에 의하여 도색된 제1패 턴과 제2도료가 제3도형패턴에 의하여 도색된 제3패턴의 결합에 의하여 구성될 수 있다. 다른 예로서, 또다른 마크는 제2도료가 제3도형패턴에 의하여 도색된 제3패턴과 제4도료가 제4도형패턴에 의하여 도색된 제4패턴의 결합에 의하여 구성될 수도 있다. 상기 실시예의 자동 분류 마크 형성 방법은 도 료와 패턴의 종류에 의하여 제한될 수 있는 분류유형의 수를 더욱 다양하게 사용할 수 있다는 장점이 있다. 상기 각각의 실시예 중 어느 하나로부터 더욱 응용된 실시예에서, 복수의 도료가 사용되는 경우, 제1도료는 제1 광선을 조사하였을 때, 제2도료는 제2광선이 아닌 제2광선을 조사하였을 때 제2발광색을 방사하도록 구성될 수 도 있다. 이 때 각 도료의 특성에 있어서, 상기 제1광선과 제2광선은 서로 빛의 파장이 다르거나, 상기 제1발광 색과 상기 제2발광색의 색상이 다르거나, 또는 둘 모두가 다를 수 있다. 상기와 같은 응용된 실시예에서, 서로 다른 분류유형을 나타내는 마크는 각각 서로 다른 파장대역의 제1광선과 제2광선을 각각 조사하였을 때 어느 쪽 에서 어떠한 발광색을 방사하는지에 따라 식별될 수 있다. 상기 응용된 실시예의 자동 분류 마크 형성 방법은 서로 다른 광선에 대한 서로 다른 발광특성을 이용함으로써 분류유형의 수를 더욱 다양하게 사용할 수 있다는 장점이 있다. 상기 각각의 모든 실시예에서 도료의 또는 도형패턴에 대한 종류의 수는 제한이 없으며, 또한 도료의 성분은 본 발명의 사상을 실현하는 발광물질이 포함되는 한 어떠한 물질로 구성되어도 무방하고, 또한 도형패턴의 형태는 본 발명에 의하여 식별력을 갖출 수 있는 형태라면 어떠한 크기, 해상도, 또는 형태이더라도 무방하다. 이러한 다양한 기술적 선택에서 특정 수, 물질, 형태를 결정하는 것은, 단지 본 발명을 다양하게 실시하고자 하는 과정 에서 통상의 기술자가 취사 선택 및 변용할 수 있는 영역에 불과하다 할 것이다. 마크의 식별에 의한 자동 분류 도 5는 본 발명의 일 실시예에 따른 재활용품 자동 분류 장치의 구성을 나타내는 개념도이다. 본 발명에 의한 재활용품 자동 분류 장치는, 장치에 물품을 반입하는 반입부, 상기 물품에 제1 파장대역의 제1광선을 조사(照射)하는 광원부, 상기 물품으로부터 제1발광색으로 방사되는 제1패턴의 형태 로 나타나는 자동 분류 마크를 촬영하는 촬영부, 상기 자동 분류 마크에 포함된 제1패턴의 형상 과 상기 제1발광색의 색상 중 적어도 하나에 기반하여 상기 물품의 분류유형을 결정하는 판단부, 및 상기 분류유형에 따라 상기 물품을 분류 처리하는 분류부를 적어도 포함할 수 있다. 상기 반입부는 상기 물품을 상기 자동 분류 장치에 반입하는 기능부로, 다양한 형태로 구성될 수 있다. 도 5의 예시에서는 상기 반입부에 컨베이어 벨트가 설치되어 외부로부터 공급되는 적어도 하나의 물품을 반입하도록 도시되어 있으나, 상기 물품의 지속적이고 용이한 공급이 가능하도록 하는 어떠한 물리적 및/또는 기계적 설계도 상기 반입부의 구현으로 간주될 수 있음은 자명하다. 또한, 도 5의 예시에서는 상기 컨베이어 벨트가 상기 자동 분류 장치 전체에 걸쳐 상기 물품을 운반하도록 나타나 있으나, 이는 본 발명의 이해를 돕기 위한 예시에 불과하며, 상기 물품을 반입하여 후술하는 각부에 공급하기 위한 어떠한 시스템, 장치, 수단, 또는 방법이 사용되어도 본 발명의 구현이 가능함은 쉽게 알 수 있 을 것이다. 상기 광원부는 상기 제1파장대역의 상기 제1광선을 상기 물품에 조사하여 상기 자동 분류 마크 가 제1발광색에 의해 제1패턴의 형태로 나타나도록 할 수 있다. 상기 제1파장대역은 적어도 하나의 비가시(非可視)광선 파장대역을 포함할 수 있고, 본 발명의 바람직한 일 실시예에서는, 상기 비가시광선 파장대 역은, 10nm 이상 400nm 이하의 파장길이를 가지는 적어도 하나의 자외선 파장대역을 포함할 수 있다. 그러나 이 미 상술하였던 바와 같이, 제1파장대역은 상기 자외선 대역에 한정되지 않고, 예를 들어 가시광선 대역이거나, 적외선 또는 그보다 긴 파장대역이거나, 또는 자외선보다 짧은 방사선 파장대역에 속할 수 있다. 또한 역시 이 미 상술하였던 바와 같이, 상기 광원부는 적어도 하나의 서로 다른 파장대역에 의한 광선을 조사하는 복수 의 광원을 포함하여 구성될 수도 있다. 상기 제1발광색으로 나타나는 자동 분류 마크는 촬영부에 의하여 촬영될 수 있다. 상기 촬영부 는 상기 제1발광색을 관측할 수 있는 사양의 촬영기기를 포함하여 구성될 수 있다. 예를 들어, 상기 제1발 광색이 가시광선 대역으로 방사되는 경우, 상기 촬영부는 일반적인 가시광선 대역을 촬영하는 촬영기 기를 포함할 수 있다. 마찬가지로, 상기 제1발광색이 비가시광선 대역으로 방사되는 경우, 상기 촬영부 는 대응하는 비가시광선 대역을 촬영하는 촬영기기를 포함할 수 있다. 또한 역시 이미 상술하였던 바와 같 이, 상기 촬영부는 적어도 하나의 서로 다른 파장대역에 의한 발광색을 촬영하는 복수의 촬영기기를 포함 하여 구성될 수도 있다. 본 발명의 일 실시예에 따르면, 상기 자동 분류 장치는 외부로부터의 빛이 차단되는 암실을 더 포함 할 수 있고, 상기 광원부와 상기 촬영부는 상기 암실 내부에 설치될 수 있다. 상기 암실은 상기 물품에 상기 광원부로부터의 제1광선만이 도달하도록 하고, 또한 상기 촬영부에 상기 물품의 제1발광색만이 촬영되도록 하여, 상기 자동 분류 마크의 식별을 용이하게 하는 효과를 가질 수 있다. 본 발명의 다른 실시예에 따르면, 상기 자동 분류 마크에 사용된 도료가 형광 특성을 가진 발광물질을 포 함하는 경우, 상기 광원부와 상기 촬영부는 인접하도록 구성되고, 상기 광원부의 제1광선 조사에 의하여 즉시 방사되는 제1발광색을 상기 촬영부가 촬영하도록 구성될 수 있다. 그러나, 다른 실시예에 따르면, 상기 자동 분류 마크에 사용된 도료가 인광 특성을 가진 발광물질을 포함하는 경우, 상 기 광원부와 상기 촬영부는 인접하지 않아도 무방하며, 상기 광원부에 의한 제1광선의 조 사와 상기 촬영부에 의한 상기 물품에서 방사되는 제1발광색의 촬영은 다른 공간에서 및/또는 시차를 두고 이루어져도 무방하다. 본 발명의 또다른 실시예에 따르면, 상기 광원부는 통상적 실내조명 또는 일광(日光)으로 대체될 수 있다. 상기와 같은 실시예에서, 상기 제1도료에 포함되는 발광물질은 상기 실내조명 또는 일광에 포함되는 가시광선 및/또는 비가시광선 성분에 의하여 제1발광색을 방사하는 특성을 가지는 것으로 선택될 수 있다. 이미 상술하였던 바와 같이, 상기 조사되는 제1광선의 제1파장대역과 상기 제1발광색의 파장대역은 상이할 수 있으며, 둘 모두가 가시광선 대역이거나, 둘 중 하나가 비가시광선 대역이거나, 둘 모두가 비가시광 선 대역으로 구성될 수 있다. 따라서 상기 광원부와 상기 촬영부는 상기 자동 분류 마크를 형성 하기 위해 사용된 도료 및 상기 도료에 포함된 발광물질의 유형에 맞추어 다양한 사양의 광원 및 촬영기기에 의 하여 구성될 수 있는 것으로, 상기 암실을 포함하거나 또는 포함하지 않는 다양한 실시방법으로 변용될 수 있다. 상기 판단부는 상기 촬영부를 통하여 촬영된 상기 자동 분류 마크는 상기 제1발광색의 색 상(즉, 방사되는 빛 파장) 또는 상기 제1패턴의 형상 중 적어도 하나에 기반하여 상기 물품의 분류유형을 결정하도록 구성될 수 있다. 상기 판단부는 상기 촬영부로부터 제공받은 상기 자동 분류 마크의 화상을 컴퓨터 비전 방법에 의하여 처리하도록 구성될 수 있다. 상기 컴퓨터 비전 방법은, 인공지능 모델에 의한 방법, 알고리즘 또는 필터 에 의한 방법, 또는 디지털 워터마크 검출에 사용되는 방법을 포함할 수 있으며, 그 밖에 화상으로부터 상기 제 1패턴과 같은 특정 패턴 또는 상기 제1발광색과 같은 특정 색상을 식별할 수 있는 어떠한 종래 기술 또는 신규 한 기술에 의한 방법을 포함할 수 있다.본 발명의 일 실시예에 따르면, 상기 컴퓨터 비전 방법에는 상기 화상에 대한 기하학적 변화를 통한 패턴 검출 방법이 포함될 수 있다. 상기 기하학적 변화는 화상의 피사체에 대하여 회전, 확대, 축소, 및 각도변경 등 이른 바 RST(Rotate, Scaling, and Transform) 변화를 상쇄하여 원래의 형상을 복원하기 위한 목적을 가질 수 있다. 상기 기하학적 변화는 상기 목적의 달성을 위하여 강체 변환(rigid transform), 아핀 변환(affine transform), 및 투사 변환(projection transform)을 포함하는 적어도 하나의 기하학적 변환 함수에 의하여 실행될 수 있다. 상기 기하학적 변환 함수는 알고리즘에 의하여 사전에 지정된 형태로 실행될 수도 있고, 또는 인공지능 영상처 리 모델 등 고도화된 정보처리 기능의 적용을 통하여 결과적으로 그러한 변환이 실행된 효과를 획득할 수도 있 다. 본 발명의 다른 실시예에 따르면, 상기 컴퓨터 비전 방법에는 상기 화상에 포함된 특정 색상의 추출 방법이 포 함될 수 있다. 상기 추출 방법은 히스토그램 분석, 화상 내 최대 색상 추출, 화상 내 최소 색상 추출, 이동 평 균 색상, 경계선 검출, 색상 채널 분리, 색상 공간 변환, 및 색상 채널 기반 강조 필터링을 포함하는 적어도 하 나의 색상 강조 또는 검출 알고리즘을 포함할 수 있다. 상기 추출 방법의 적용을 전후로는 상기 색상 추출을 보 다 용이하게 하기 위하여 해상도 조정, 종횡비 조정, 레벨 조정, 양자화(quantization), 블러 필터 적용, 샤프 필터 적용, 커널 기반 필터 적용, 아날로그-디지털 변환, 및 디지털-아날로그 변환을 포함하는 적어도 하나의 화상 정보 처리 방법이 더 적용될 수 있다. 본 발명의 실시예에 따라서, 상기 패턴 검출을 위한 컴퓨터 비전 방법과 상기 색상의 추출을 위한 컴퓨터 비전 방법이 복합적으로 적용되어 특정한 제1발광색의 제1패턴을 검출하는 데 사용될 수 있음은 본 발명의 상술한 개 시들로부터 용이하게 유추할 수 있다. 앞서 마크의 형상 및 적용 방법과 관련하여 실시예와 함께 설명한 바와 같이, 상기 판단부에 의하여 식별 된 자동 분류 마크는 상기 물품에 포함된 적어도 하나의 재활용 가능 소재를 나타내는 고유한 마크일 수 있으며, 따라서 상기 판단부는 상기 소재를 기준으로 상기 물품의 분류유형을 결정하고, 이에 따 라 상기 물품을 분류 처리하도록 상기 분류부에 동작을 지시하도록 구성될 수 있다. 물론, 본 발명의 실시예 따라서, 상기 판단부는 상기 자동 분류 마크를 기반으로 재활용 이외의 어떠한 다른 목적으로 상기 물품의 분류유형을 결정하도록 구성되어도 무방하다. 예를 들면, 상기 자동 분류 마크가 물품의 배송 목적지를 나타내는 경우, 상기 판단부가 판단하는 분류유형은 목적지까지의 배송 경로에 기반하여 정 해질 수 있다. 상기 분류부는 상기 물품이 특정한 분류유형을 가진 것으로 판단되는 경우 상기 물품을 분류 처 리하여 해당 소재의 분류경로로 분류하도록 구성될 수 있다. 예를 들어, 상기 분류경로가 PET 플라스 틱을 수거하기 위한 분류경로인 경우, 상기 분류부는 상기 물품이 PET 플라스틱 소재인 것으로 상기 판단부에 의하여 판단된 경우에 한하여 동작할 수 있다. 도 5에 나타난 분류부와 분류경로의 형상은 본 발명의 이해를 돕기 위한 예시적 화상이며, 물품의 분 류처리와 관련된 어떠한 다른 종류의 시스템, 도구, 수단이 사용되더라도 본 발명의 구현에는 지장을 주지 아니 한다. 본 발명의 실시예에 따라서, 상기 분류부 및/또는 분류 경로는 둘 이상 복수 설치될 수 있다. 예를 들어, 플라스틱 재활용품을 위한 분류부와 금속 재활용품을 위한 분류부가 별도로 구성될 수 있다. 또 다른 예 를 들어, 서울시를 목적으로 하는 하나의 분류부에 의하여 서울 강북과 서울 강남에 대한 복수의 분류부로 물품 의 분류 처리가 가능하도록 구성될 수 있다. 이러한 분류 프로세스의 실시 방법 역시 본 발명의 범위 내에서 다 양하게 조합 및 변형하여 다양한 실시예를 도출할 수 있음은 자명하다. 이상 본 발명에 대하여 도면 및 실시예를 참조하여 설명하였으나, 이미 상술한 바와 같이 본 발명의 보호범위가 상기 제시된 도면 또는 실시예에 의해 한정되는 것을 의미하지는 않으며, 해당 기술 분야의 숙련된 당업자는 하 기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하 게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2022-0131212", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명이 제안하는 자동 분류 마크의 형태에 대한 기본 개념을 나타낸 개념도, 도 2는 본 발명의 일 실시예에 의하여 표면에 자동 분류 마크가 형성된 물품을 나타내는 예시도, 도 3은 본 발명의 일 실시예에 의하여 자동 분류 마크를 부분적으로 형성하는 방법의 예시도, 도 4는 본 발명의 일 실시예에 의하여 자동 분류 마크의 패턴을 다양하게 구성하는 방법에 대한 예시도, 도 5는 본 발명의 일 실시예에 따른 재활용품 자동 분류 장치의 구성을 나타내는 개념도이다."}
