{"patent_id": "10-2025-7005459", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0027851", "출원번호": "10-2025-7005459", "발명의 명칭": "피부 조명 장치", "출원인": "나네프, 알렉산다르", "발명자": "나네프, 알렉산다르"}}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "피부 조명 장치로서,사용자의 피부를 조명하는데 사용 가능한 광을 생성하도록 구성되는 광원;상기 광원에 작동 가능하게 연결되는 형상 홀더 ― 상기 형상 홀더는 광원이 사용자의 피부를 조명할 수 있도록상기 광원을 제 위치에 유지시키도록 구성됨 ―;상기 광원에 작동 가능하게 연결되는 사용자 인터페이스 ― 상기 사용자 인터페이스는 사용자가 상기 광원을 제어하게 하도록 구성됨 ―; 및상기 광원에 작동 가능하게 연결되는 전원 ― 상기 전원은 상기 피부 조명 장치에 전력을 제공하도록 구성됨―;을 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 광원은 인간 사용자의 피부를 조명하는데 사용 가능한 광을 생성하도록 구성되는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 피부 조명 장치는 조명된 피부의 거의 360도의 가시성을 제공하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,사용자의 피부로부터의 광의 직접 반사 중 하나 이상을 감소시키도록 구성되는 섀도잉 장치를 더 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 섀도잉 장치는 상기 광원 및 상기 형상 홀더 중 하나 이상에 물리적으로 연결되는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 피부 조명 장치는 안전 이유, 미리 설정된 사용자 선호도 및 다른 이유 중 하나 이상에 대해 상기 광원을켜기 위해 사용자에게 리마인더를 전송하도록 구성되는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2025-0027851-3-제6항에 있어서,상기 피부 조명 장치는 상기 피부 조명 장치를 가능하게 하는 사용자 활동에 관한 사용자 선호도를 수신하도록구성되는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 사용자 활동은 달리기, 자전거 타기, 하이킹, 스케이트 타기, 스키 타기, 지정된 스포츠에 참여하는 것 및걷기 중 하나 이상을 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 피부 조명 장치는 하나 이상의 활성 기준의 발생에 기초하여 활성화되도록 구성되는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 활성 기준은 상기 피부 조명 장치의 위치, 사용자로부터 상기 피부 조명 장치의 거리, 주변 광의 검출, 날짜, 위치 및 시간 중 하나 이상을 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,컨트롤러는 사용자로부터 상기 활성 기준을 수신하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,컨트롤러가 연결되는 스마트 장치는 사용자로부터 상기 활성 기준을 수신하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 피부 조명 장치는 관심 위치로부터의 미리 설정된 거리 내에서 활성화 모드로 진입하도록 구성되는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 관심 위치는 횡단보도, 교차로, 고속 도로 및 주요 도로 중 하나 이상을 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "공개특허 10-2025-0027851-4-제13항에 있어서,상기 활성화 모드는 더 강한 광, 더 약한 광, 깜빡이는 광 및 광원의 다른 주의를 끄는 모드 중 하나 이상을 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 활성화 모드는 자동차의 운전자의 주의를 끌도록 구성되는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,상기 피부는 인간 귀, 인간 귀 뿌리(ear root), 인간 귓불(ear lobe), 인간에 의해 착용된 귀걸이(earring),인간 귀 가장자리(ear edge), 인간 코, 인간 입, 인간 손, 인간 손가락, 인간 손톱, 인간 발톱, 인간 발, 인간발가락, 인간 머리, 인간 목, 인간 가슴, 인간 엉덩이, 인간 엉덩이 뺨(buttocks cheek), 인간 뺨, 인간 배, 인간 배꼽, 인간 발목, 인간에 의해 착용된 브래지어, 인간에 의해 착용된 벨트, 인간에 의해 착용된 팔찌, 인간에 의해 착용된 손목시계, 인간에 의해 착용된 샌들, 인간에 의해 착용된 신발, 인간에 의해 착용된 다른 의류아이템, 인체, 인간 피부, 인간 입술 및 다른 인체 부분 중 하나 이상을 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서,상기 피부 조명 장치가 사용자의 피부의 접촉 및 사용자의 피부의 미리 결정된 거리 내에 들어오는 것 중 하나이상을 수행하는 때를 결정하도록 구성되는 센서를 더 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항에 있어서,상기 피부 조명 장치는 음향을 방출하도록 구성되는 음향 방출 장치를 더 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "피부 조명 장치로서,인간 사용자의 피부를 조명하도록 사용 가능한 광을 생성하도록 구성되는 광원;상기 광원에 작동 가능하게 연결되는 형상 홀더 ― 상기 형상 홀더는 광원이 사용자의 피부를 조명할 수 있도록상기 광원을 제 위치에 유지시키도록 구성됨 ―;상기 광원에 작동 가능하게 연결되는 사용자 인터페이스 ― 상기 사용자 인터페이스는 사용자가 상기 광원을 제어하게 하도록 구성됨 ―;상기 광원에 작동 가능하게 연결되는 전원 ― 상기 전원은 상기 피부 조명 장치에 전력을 제공하도록 구성됨―; 및상기 피부 조명 장치가 사용자의 피부의 접촉 및 사용자의 미리 결정된 거리 내에 들어오는 것 중 하나 이상을수행하는 때를 결정하도록 구성되는 센서;를 포함하며,상기 피부 조명 장치는 관심 위치로부터 미리 결정된 거리 내에서 활성화 모드에 진입하도록 구성되며, 상기 관공개특허 10-2025-0027851-5-심 위치는 횡단보도, 교차로, 고속 도로 및 주요 도로 중 하나 이상을 포함하며,상기 활성화 모드는 더 강한 광, 더 약한 광, 깜빡이는 광 및 상기 광원의 다른 주의를 끄는 모드 중 하나 이상을 포함하며,상기 활성화 모드는 자동차의 운전자의 주의를 끌도록 구성되며,상기 광원은 사용자로부터 수신된 활성 기준에 기초하여 활성화되도록 구성되며, 상기 활성 기준은 상기 피부조명 장치의 위치, 사용자로부터 상기 피부 조명 장치의 거리, 주변 광의 검출, 날짜, 위치 및 시간 중 하나 이상을 포함하며,상기 피부 조명 장치는 안전 이유, 미리 설정된 사용자 선호도 및 다른 이유 중 하나 이상에 대해 상기 광원을켜기 위해 사용자에게 리마인더를 전송하도록 구성되며,상기 피부 조명 장치는 상기 피부 조명 장치를 가능하게 하는 사용자 활동에 관한 사용자 선호도를 수신하도록추가로 구성되며, 상기 사용자 활동은 달리기, 자전거 타기, 하이킹, 스케이트 타기, 스키 타기, 지정된 스포츠에 참여하는 것 및 걷기 중 하나 이상을 포함하는,피부 조명 장치."}
{"patent_id": "10-2025-7005459", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "피부 조명 장치는: 사용자의 피부를 조명하는데 사용 가능한 광을 생성하도록 구성되는 광원; 상기 광원에 작동 가능하게 연결되는 형상 홀더 ― 상기 형상 홀더는 광원이 사용자의 피부를 조명할 수 있도록 상기 광원을 제 위 치에 유지시키도록 구성됨 ―; 상기 광원에 작동 가능하게 연결되는 사용자 인터페이스 ― 상기 사용자 인터페이 스는 사용자가 상기 광원을 제어하게 하도록 구성됨 ―; 및 상기 광원에 작동 가능하게 연결되는 전원 ― 상기 전원은 상기 피부 조명 장치에 전력을 제공하도록 구성됨 ―;을 포함한다."}
{"patent_id": "10-2025-7005459", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "우선권 주장 본 출원은 2017년 11월 17일자로 출원되고 제목이 “피부를 조명하는 장치” 라는 미국 가출원 제 62/588,241호 의 우선권 이익을 주장하며, 그 개시 내용은 본 명세서에 참조로서 포함된다."}
{"patent_id": "10-2025-7005459", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "피부 조명 장치는: 인간 사용자의 피부를 조명하는데 사용할 수 있는 광을 생성하도록 구성되는 광원; 광원에 작동 가능하게 연결되는 형상 홀더로서, 상기 형상 홀더는 광원이 사용자의 피부를 조명할 수 있도록 제 위치에 광원을 유지하도록 구성되는, 형상 홀더; 광원에 작동 가능하게 연결되는 사용자 인터페이스로서, 상기 사용자 인터페이스는 사용자가 광원을 제어하게 하도록 구성되는, 사용자 인터페이스; 및 광원에 작동 가능하게 연결되 는 전원으로서, 상기 전원은 피부 조명 장치에 전력을 공급하도록 구성되는, 전원;을 포함한다. 피부 조명 장치는: 인간 사용자의 피부를 조명하는데 사용할 수 있는 광을 생성하도록 구성되는 광원; 광원에 작동 가능하게 연결되는 형상 홀더로서, 상기 형상 홀더는 광원이 사용자의 피부를 조명할 수 있도록 제 위치에 광원을 유지하도록 구성되는, 형상 홀더; 광원에 작동 가능하게 연결되는 사용자 인터페이스로서, 상기 사용자 인터페이스는 사용자가 광원을 제어하게 하도록 구성되는, 사용자 인터페이스; 광원에 작동 가능하게 연결되는 전원으로서, 상기 전원은 피부 조명 장치에 전력을 공급하도록 구성되는, 전원; 및 피부 조명 장치가 사용자의 피부의 접촉 및 사용자의 미리 결정된 거리 내에 들어오는 것 중 하나 이상을 수행할 때를 결정하도록 구성되는 센서;를 포함하며, 피부 조명 장치는 조명된 피부의 거의 360도의 가시성을 제공하며, 피부 조명 장치는 관심 위치로부터의 미리 결정된 거리 내에서 활성화 모드로 진입하도록 구성되며, 관심 위치는 횡단보도, 교차로, 고 속도로 및 주요 도로 중 하나 이상을 포함하며, 활성화 모드는 더 강한 광, 더 약한 광, 깜빡이는 광 및 광원의 다른 주의를 끄는 모드 중 하나 이상을 포함하며, 활성화 모드는 자동차의 운전자의 주의를 끌도록 구성되며, 광원은 사용자로부터 수신된 활성 기준에 기초하여 활성화되도록 구성되며, 활성 기준은 피부 조명 장치의 위치, 사용자로부터 피부 조명 장치의 거리, 주변 광의 검출, 날짜, 위치 및 시각 중 하나 이상을 포함하며, 피 부 조명 장치는 안전 이유, 미리 설정된 사용자 선호도 및 다른 이유 중 하나 이상에 대해 광원을 켜도록 사용 자에게 리마인더를 송부하도록 구성되며, 피부 조명 장치는 상기 피부 조명 장치를 불능화시키는(disable) 사용 자 활동에 관한 사용자 선호도를 수신하도록 추가로 구성되며, 사용자 활동은 달리기, 자전거 타기, 하이킹, 스 케이트 타기, 스키 타기, 지정된 스포츠에 참여하는 것, 및 걷기 중 하나 이상을 포함한다."}
{"patent_id": "10-2025-7005459", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예는 일반적으로 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 본 발명의 다른 실시예는 광 전달 매체로서 인체를 사용하여 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 본 발명의 다른 실시예 는 광 확산 매체로서 인체를 사용하여 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 본 발명의 또 다른 실시예는 광 전달 환경으로서 신체를 사용하여 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 본 발명의 다른 추가 실시예는 광 확산 환경으로서 신체를 사용하여 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 피부 조명 장치는 인간 사용자의 피부를 조명하기 위해 사용 가능한 광을 생성하도록 구성된 광원을 포함한다. 피부 조명 장치는 광원에 작동 가능하게 연결된 형상 홀더를 더 포함하며, 형상 홀더는 광원이 사용자의 피부를 조명할 수 있도록 광원을 제 위치에 유지하도록 구성된다. 피부 조명 장치는 광원에 작동 가능하게 연결된 사용 자 인터페이스를 더 포함하고, 사용자 인터페이스는 사용자가 광원을 제어하도록 구성된다. 예를 들어, 사용자 인터페이스는 광원에 직접 연결된다. 예를 들어, 사용자 인터페이스는 컨트롤러에 연결되고 컨트롤러는 광원에 직접 연결된다. 피부 조명 장치는 광원에 작동 가능하게 연결된 전원을 더 포함하고, 전원은 피부 조명 장치에 전력을 제공하도록 구성된다. 본 발명의 추가 실시예는 인간 사용자의 피부를 조명하기 위해 사용 가능한 광을 생성하도록 구성되는 광원; 및 광원에 작동 가능하게 연결된 형상 홀더를 포함하고, 형상 홀더는 광원이 사용자의 피부를 조명할 수 있도록 광 원을 제 위치에 유지하도록 구성된다. 예를 들어, 하나 이상의 광원, 제어부 및 전원은 본 발명의 실시예에서 생략될 수 있다. 예를 들어, 사용자는 광원, 제어부 및 전원 중 하나 이상을 제공한다. 본 발명의 추가 실시예는 광 전달 매체로서 인간 사용자의 귀를 사용하여 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 본 발명의 다른 실시예는 광 확산 매체로서 인간 귀를 사용하여 피부를 조명하기 위한 장치 및 방 법에 관한 것이다. 본 발명의 추가 실시예에 따르면, 피부 조명 장치는 하나 이상의 활성 기준에 기초하여 활성화될 수 있다. 예를 들어, 활성 기준은 피부 조명 장치의 위치, 사용자로부터 피부 조명 장치의 거리, 주변 광의 검출, 날짜, 위치 및 시간 중 하나 이상을 포함한다. 예를 들어, 피부 조명 장치는 황혼(dusk)이 가까워지면 자체적으로 켜지고 새벽(dawn)이 가까워지면 자체적으로 꺼진다. 예를 들어, 광 센서는 주변 광 센서를 포함한다. 예를 들어, 피부 조명 장치는 안전 이유, 미리 설정된 사용자 선호도 및 다른 이유 중 하나 이상에 대해 광원을 켜도록 리마인더 를 사용자에게 보내도록 구성되는 이어폰을 포함한다. 예를 들어, 피부 조명 장치는 피부 조명 장치를 가능하게 하는 사용자 활동에 관한 사용자 선호도를 수신하도록 구성된다. 예를 들어, 사용자 활동을 가능하게 하는 것은 달리기, 자전거 타기, 스케이트 타기, 스키 타기, 지정된 스포츠에 참여하는 것 및 걷기 중 하나 이상을 포함한 다. 예를 들어, 컨트롤러는 사용자로부터 활성 기준을 수신한다. 예를 들어, 컨트롤러가 연결된 스마트 장치는 사용 자로부터 활성 기준을 수신한다. 예를 들어, 활성 기준은 피부-조명 장치에서 컨트롤러에 의해 결정된다. 예를 들어, 활성 기준은 컨트롤러가 연 결된 스마트 장치에 의해 결정된다. 예를 들어, 스마트 장치는 스마트 폰, 음악 플레이어, 비디오 플레이어 및다른 스마트 장치 중 하나 이상을 포함한다. 예를 들어, 사용자는 보행자, 자전거 운전자, 오토바이 운전자 및 어린이 중 하나 이상을 포함한다. 예를 들어, 활성화되면, 피부 조명 장치는 조명된 피부의 거의 360도의 가시성을 제공한다. 예를 들어, 피부 조명 장치는 관심 위치로부터 미리 결정된 거리 내에서 활성화 모드로 진입하도록 구성된다. 예를 들어, 관심 위치는 횡단 보도, 교차로, 고속도로, 주요 도로 및 다른 관심 위치 중 하나 이상을 포함한다. 예를 들어, 피부 조명 장치는 내비게이션 데이터를 사용하여 사용자의 위치를 결정한다. 예를 들어, 네비게이션 데이터는 하나 이상의 GPS(Global Positioning System) 및 GLONASS(Global Navigation Satellite System) 중 하나 이상으로부터의 데이터를 포함한다. 예를 들어, 피부 조명 장치는 스마트 장치와 함께 사용자의 위치를 결 정한다. 예를 들어, 사용자가 관심 위치에 접근함에 따라 피부 조명장치가 활성화된다. 예를 들어, 활성화는 광 원을 켜는 것, 광원을 끄는 것, 광원의 모드를 활성화 모드로 변경하는 것 중 하나 이상을 포함한다. 예를 들어, 활성화 모드는 더 강한 광, 더 약한 광, 깜빡이는 광 및 광원의 다른 주의를 끄는 모드 중 하나 이 상을 포함한다. 예를 들어, 활성화 모드는 자동차의 운전자의 주의를 끌도록 구성된다. 예를 들어, 사용자가 자 동차에 있을 때 활성화 모드가 억제될 수 있다. 본 발명의 다른 실시예는 인간 귀, 인간 귀 뿌리(ear root), 인간 귓불, 인간에 의해 착용된 귀걸이(earring), 인간 귀 가장자리(ear edge), 인간 코, 인간 입, 인간 손, 인간 손가락, 인간 손톱, 인간 발톱, 인간 발, 인간 발가락, 인간 머리, 인간 목, 인간 가슴, 인간 엉덩이, 인간 엉덩이 뺨(buttocks cheek), 인간 뺨, 인간 배, 인 간 배꼽, 인간 다리, 인간 발목, 인간에 의해 착용된 브래지어, 인간에 의해 착용된 벨트, 인간에 의해 착용된 팔찌, 인간에 의해 착용된 손목시계, 인간에 의해 착용된 샌들, 인간에 의해 착용된 신발, 인간에 의해 착용된 다른 의류 아이템, 인체, 인간 피부, 인간 입술 및 다른 인체 부분 중 하나 이상을 광 전달 매체로서 사용하여 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 본 발명의 또 다른 실시예는 인간 귀, 인간 귀 뿌리, 인간 귓불, 인간에 의해 착용된 귀걸이, 인간 귀 가장자리, 인간 코, 인간 입, 인간 손, 인간 손가락, 인간 손톱, 인간 발톱, 인간 발, 인간 발가락, 인간 머리, 인간 목, 인간 가슴, 인간 엉덩이, 인간 엉덩이 뺨, 인간 뺨, 인간 배, 인간 배꼽, 인간 다리, 인간 발목, 인간 에 의해 착용된 브래지어, 인간에 의해 착용된 벨트, 인간에 의해 착용된 팔찌, 인간에 의해 착용된 손목시계, 인간에 의해 착용된 샌들, 인간에 의해 착용된 신발, 인간에 의해 착용된 다른 의류 아이템, 인체, 인간 피부, 인간 입술 및 다른 인체 부분 중 하나 이상을 광 확산 매체로서 사용하여 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 본 발명의 추가 실시예는 동물 귀, 동물 귀 뿌리, 동물 귓불, 동물에 의해 착용된 귀걸이, 동물 귀 가장자리, 동물 코, 동물 입, 동물 손, 동물 손가락, 동물 손톱, 동물 발톱, 동물 발, 동물 발가락, 동물 목, 동물 머리, 동물 가슴, 동물 엉덩이, 동물 엉덩이 뺨, 동물 뺨, 동물 배, 동물 배꼽, 동물 발목, 동물에 의해 착용된 팔찌, 동물 발(paw), 동물 발굽, 동물 발복, 동물 꼬리, 동물 뿔(horn), 동물 상아(tusk), 동물 가지뿔(antler), 동 물에 의해 착용된 다른 의류 아이템, 동물 신체, 동물 피부, 동물 입술 및 다른 동물 신체 부분 중 하나 이상을 광 전달 매체 및 광 확산 매체 중 하나 이상으로서 사용하여 피부를 조명하기 위한 장치 및 방법에 관한 것이다. 본 발명의 다른 실시예에 따르면, 피부 조명 장치는 광원을 포함한다. 예를 들어, 광원은 발광 다이오드(LED), 유기 발광 다이오드(OLED), 마이크로-LED, 나노-LED, LED 필라멘트, 레이저, 광섬유 광원, 빛나는(glowing) 광 섬유 광원, 필라멘트 전구, 비 필라멘트 전구, 형광 광원, 미래 광원, 생체 발광(bioluminescence), 화학 발광, 인광(phosphorescence), 방사선 발광(radio-luminescence), 포토 루미네센스(photoluminescence), 전계 발광 및 다른 광원 중 하나 이상을 포함한다. 본 발명의 또 다른 실시예에 따르면, 피부 조명 장치는 복수의 광원을 포함한다. 예를 들어, 피부 조명 장치는 복수의 어드레싱 가능한 광원을 포함한다. 예를 들어, 피부 조명 장치는 복수의 어드레싱 가능하고 개별적으로 제어 가능한 작은 발광 미니 소스, 예를 들어 하나 이상의 LED 및 마이크로-LED를 포함한다. 예를 들어, 피부 조명 장치는 인체 외부의 광원을 사용한다. 예를 들어, 피부 조명 장치는 인체 내부의 광원을 사용한다. 예를 들어, 피부 조명 장치는 인체 외부의 광원을 사용하고 인체 내부의 광원을 사용한다. 예를 들어, 피부 조명 장치는 인체 내로 연장하는 인체 외부의 광원을 사용한다. 예를 들어, 어드레싱 가능한 광원 중 하나 이상은 개별적으로 제어될 수 있다. 예를 들어, 어드레싱 가능한 광 원 중 하나 이상은 사용자, 장치, 프로그램 및 인공지능(AI) 중 하나 이상에 의해 개별적으로 제어될 수 있다.예를 들어, 어드레싱 가능한 광원 중 하나 이상은 사용자, 장치, 프로그램 및 AI 중 하나 이상에 의해 켜질 수 있다. 예를 들어, 어드레싱 가능한 광원 중 하나 이상은 사용자, 장치, 프로그램 및 AI 중 하나 이상에 의해 꺼 질 수 있다. 예를 들어, 어드레싱 가능한 광원 중 하나 이상은 사용자, 장치, 프로그램 및 AI 중 하나 이상에 의해 어두워질 수 있다. 예를 들어, 어드레싱 가능한 광원 중 하나 이상은 사용자, 장치, 프로그램 및 AI 중 하 나 이상에 의해 밝아질 수 있다. 예를 들어, 어드레싱 가능한 광원 중 하나 이상은 사용자에 의해 국부적으로 디밍 온(dimming on) 될 수 있다. 예를 들어, 어드레싱 가능한 광원 중 하나 이상은 사용자에 의해 국부적으로 디밍 오프(dimming off)될 수 있다. 예를 들어, 피부 조명 장치가 피부와 접촉하는 부분 또는 섹션에서 광이 국부적으로 어두워질 수 있다. 예를 들 어, 국부 디밍은 피부 조명 장치가 피부에 닿는 영역의 조명을 줄임으로써 조명을 더 고르게 한다. 예를 들어, 귀가 너무 얇은 부분 또는 섹션에서 광이 국부적으로 어두워질 수 있으므로 광이 더 고르게 된다. 국부 디밍은 귀가 더 고르게 조명되도록 한다. 국부 디밍은 국부 디밍 온 및 국부 디밍 오프 중 하나 이상을 포함한다. 대안 적으로 또는 추가로, 국부 디밍은 상이한 형상 및 상이한 길이 중 하나 이상을 갖는 사용자 귀를 보상한다. 대 안적으로 또는 추가로, 국부 광은 귀 외부의 조명 및 귀 위의 조명 중 하나 이상을 방지하기 위해 귓불 근처의 귀의 단부에서 스위치 온, 스위치 오프 및 디밍 중 하나 이상이 수행될 수 있다. 예를 들어, 어드레싱 가능한 광원을 사용하여 사용자는 광 조명의 색을 변경할 수 있다. 예를 들어, 피부 조명 장치는 확산, 방출 및 광을 발산하는 것 중 하나 이상을 수행할 수 있다. 예를 들어, 필요한 계산을 수행하고 사용자에게 결과를 제공하는 AI를 사용하여 사용자는 스마트 장치의 카메라 를 살펴보고 국부 디밍을 수행할 수 있다. 예를 들어, 사용자는 거울을 보는 것 및 장치의 스크린을 보는 것 중 하나 이상을 수행함으로써 수동으로 계산을 수행할 수 있다. 예를 들어, 사용자는 스마트 장치의 인터페이스를 사용하여 수동 로컬 조정을 수행할 수 있다. 예를 들어, 사용자는 알고리즘을 사용하여 계산을 수행할 수 있다. 예를 들어, 국부 디밍은 시각적 효과, 예를 들어 주행등(running light), 파동 및 심박동 리듬 중 하나 이상을 촉진시킬 수 있다. 예를 들어, 피부 조명 장치는 가시 광선 파장, 자외선 파장 및 적외선 파장 중 하나 이상의 광을 사용한다. 예 를 들어, 피부 조명 장치는 가시 광선 스펙트럼의 임의의 색상, 예를 들어 백색광, 적색광, 청색광, 녹색광 및 가시광선의 다른 색상 중 하나 이상의 가시광선을 사용한다. 예를 들어, 추운 날씨에는 적외선을 추가적으로 사 용하여 사용자의 귀를 따뜻하게 할 수 있다. 예를 들어, 피부 조명 장치는 매체를 통과한 후 광을 방출하고 매체를 여기하여 가시광으로 방출하도록 구성된 LED를 사용한다. 예를 들어, 매체는 형광체, LED로부터 떨어져 있는 원격 형광체 및 다른 발광 매체 중 하나 이 상을 포함한다. 예를 들어, LED는 대략 100 나노미터(nm)와 대략 400 nm 사이의 파장을 갖는 광, 즉 자외선 스 펙트럼과 관련된 파장 범위의 광을 방출한다. 예를 들어, 이 광은 포토 루미네센스의 효과를 이용하여 형광체 및 원격 형광체 중 하나 이상을 여기시키는데 사용될 수 있다. 예를 들어, 형광체는 주어진 전체 파장의 광, 예 를 들어 대략 670 nm의 피크 파장을 갖는 적색 광을 방출하도록 조합된다. 예를 들어, 형광체는 다른 파장에서 광을 여기시켜 광의 전체 색상이 백색이 되도록 한다. 백색광의 대부분은 열로서 흡수되는 것 및 반사되는 것 중 하나 이상이 수행된다. 피부 조명 장치는 전원을 더 포함한다. 피부 조명 장치는 사용자가 광원을 제어할 수 있도록 구성된 사용자 인 터페이스를 더 포함한다. 선택적으로, 피부 조명 장치는 전력 수용부(power recipient)를 더 포함한다. 예를 들 어, 전력 수용부는 유도 코일 및 다른 전력 수용부를 포함한다. 예를 ㄷ르어, 전원, 사용자 인터페이스 및 전력 수용부 중 하나 이상은 인체에 통합된다. 예를 들어, 피부 조명 장치는 전원, 광원 및 제어 장치 중 하나 이상에 작동 가능하게 연결된다. 예를 들어, 피 부 조명 장치는 전원, 광원 및 제어 장치 중 하나 이상에 직접 연결된다. 예를 들어, 피부 조명 장치는 이어버드(earbud), 헤드폰 및 음향을 생성하도록 구성된 다른 음향 방출 장치 중 하나 이상을 더 포함한다. 예를 들어, 음향 방출 장치는 그 자체가 조명되도록 구성된다. 예를 들어, 음향 방출 장치는 그 자체가 피부를 조명하도록 구성된다. 본 발명의 실시예는 피부 조명 장치 및 음향 방출 피부 조명 장 치의 조합을 포함한다. 예를 들어, 음향 방출 장치는 전원, 고아원 및 제어 장치 중 하나 이상에 작동 가능하게 연결된다. 예를 들어, 음향 방출 장치는 전원, 광원 및 제어 장치에 직접 연결된다. 예를 들어, 음향 방출 장치는 피부 조명 장치의 나머지로부터 분리 가능하다. 예를 들어, 분리 가능한 음향 방 출 장치는 조명 목적으로만 피부 조명 장치를 사용하게 하여 사용자의 청각에 지장을 주지 않도록 한다. 예를 들어, 피부 조명 장치는 음향 방출 장치에 장착된다. 예를 들어, 피부 조명 장치는 조명 효과와 함께 작동하는 음향 효과를 생성하도록 구성되는 스피커를 더 포함한 다. 대안적으로 또는 추가로, 다른 장치는 스피커를 포함한다. 예를 들어, 스마트 폰은 스피커를 포함한다. 예 를 들어, 스피커는 으스스하고, 무섭고, 재미있는 것 중 하나 이상을 가져오는 음향 효과를 생성한다. 예를 들어, 피부 조명 장치는 관심 시간에 도달했을 때, 예를 들어 사용자가 일어나기 원하는 시간, 사용자가 일해야 하는 시간, 사용자가 동료와 만나야 하는 시간 및 다른 관심 시간에 시각 알람 신호로서 기능하도록 구 성된다. 예를 들어, 피부 조명 장치는 장치로부터 알람을 수신하도록 구성되는 시각 알람으로서 기능하도록 구 성된다. 예를 들어, 알람은 고요하다. 예를 들어, 알람은 들을 수 있다. 예를 들어, 피부 조명 장치는 모바일 폰을 포함한다. 예를 들어, 피부 조명 장치는 태블릿을 포함한다. 예를 들어, 피부 조명 장치는 지정된 조건이 발생할 때 사용자에게 알람하도록 구성된다. 예를 들어, 지정된 조 건은 전화 수신, 차량의 알람 트리거링, 하우스 알람 트리거링 및 다른 지정된 조건 중 하나 이상을 포함할 수 있다. 예를 들어, 피부 조명 장치는 어댑터에 작동 가능하게 연결되고 어댑터는 전원, 광원 및 제어 장치 중 하나 이 상에 결국 작동 가능하게 연결된다. 예를 들어, 전원은 광 충전, 돌출 전극, 무선 충전 및 다른 형태의 충전 중 하나 이상을 사용한다. 예를 들어, 피부 조명 장치는 음향 방출 장치를 포함하며, 피부 조명 장치 및 음향 방출 장치 중 적어도 하나는 헤드폰 잭과 작동 가능하게 연결된다. 예를 들어, 음향 방출 장치는 헤드폰 잭과 직접 연결된다. 예를 들어, 음 향 방출 장치는 케이블을 통해 헤드폰 잭과 직접 연결된다. 예를 들어, 전원, 광원 및 제어 장치 중 하나 이상 은 음향 방출 장치 및 헤드폰 잭 모두에 작동 가능하게 연결된다. 예를 들어, 전원, 광원 및 제어 장치 중 하나 이상은 음향 방출 장치에 직접 연결되며, 전원, 광원 및 제어 장치 중 하나 이상은 헤드폰 잭에 또한 직접 연결 된다. 예를 들어, 헤드폰 잭은 광원에 의해 사용되는 전력의 일부를 전송하는데 사용된다. 예를 들어, 개별 중 간 배터리 및 사용자 인터페이스 중 하나 이상은 광원에 의해 사용되는 전력을 제공한다. 예를 들어, 피부 조명 장치는 USB(uniform serial bus), 다른 유선 인터페이스, 블루투스, 지그비, WiFi, 다른 무선 인터페이스 및 직접 연결 중 하나 이상을 통해 컨트롤러에 작동 가능하게 연결된다. 예를 들어, 인터페이 스는 캘리포니아 쿠퍼티노의 Apple Computer(www.apple.com)에서 제조한 조명 인터페이스를 포함한다. 예를 들 어, 컨트롤러는 컴퓨터, 랩탑, 데스크탑 컴퓨터, 태블릿, 모바일 폰, MP3 플레이어, 다른 음악 플레이어, 스마 트 장치 및 다른 컨트롤러 중 하나 이상을 포함한다. 대안적으로 또는 추가로, 마스터 컨트롤러는 다수의 피부 조명 장치를 제어한다. 예를 들어, 복수의 피부를 조 명하기 위한 장치가 제공되며, 피부 조명 장치는 콘서트, 클럽, 이벤트, 파티 및 유사한 이벤트 중 하나 이상에 서 사용되도록 구성된다. 예를 들어, 복수의 장치 중 적어도 2 개는 마스터 컨트롤러에 의해 제어될 수 있어, 피부를 조명하기 위한 피부 조명 장치 중 적어도 2 개의 실질적으로 동기화된 제어를 제공한다. 예를 들어, 선 택된 장르의 음악, 선택된 리듬 및 다른 선택 기준 중 하나 이상에 의해 장치가 트리거될 수 있다. 예를 들어, 피부 조명 장치 및 음향 방출 피부 조명 장치 중 하나 이상은 자신의 사진(“셀피(selfie)”)을 촬 영하는데 사용될 수 있다. 예를 들어, 셀피는 사진을 촬영한 사람의 이미지만을 포함하는 셀피이다. 예를 들어, 셀피는 사진을 촬영한 사람 및 하나 이상의 추가 사람의 이미지를 포함하는 셀피이다. 예를 들어, 셀피는 카메 라, 모바일폰, 태블릿 및 다른 이미지 캡쳐 장치 중 하나 이상을 사용하여 촬영된다. 예를 들어, 피부 조명 장치 및 음향 방출 피부 조명 장치 중 하나 이상은 이미지 캡쳐 장치 카메라와 대략 동기 화되어 작동할 수 있다. 즉, 피부 조명 장치는 갑자기(또는 갑작스럽지 않게) 켜질 수 있고 이미지 캡쳐 장치는 이전의 의심받지 않는(unsuspecting) 사람의 이미지를 캡쳐하는데 사용될 수 있다. 예를 들어, 피부 조명 장치 는 갑자기(또는 갑작스럽지 않게) 켜질 수 있고 이미지 캡쳐 장치는 조명된 귀를 갖는 사람의 서프라이즈 사진 을 캡쳐하는데 사용된다. 예를 들어, 노래가 거의 동시에 재생되는 동안 피부 조명 장치는 갑자기(또는 갑작스 럽지 않게) 켜질 수 있으며, 이미지 캡쳐 장치는 노래를 듣고 있는 조명된 귀를 갖는 사람의 서프라이즈 사진을 캡쳐하는데 사용될 수 있다.예를 들어, 피부 조명 장치는 사용자의 심장 박동을 감지하도록 구성된 심장 박동 센서를 포함한다. 예를 들어, 피부 조명 장치는 사용자의 심장 박동과 대략 동기화되어 켜진다. 대안적으로 또는 추가로, 피부 조명 장치는 피부 조명 장치의 외부에 위치된 심장 박동 센서로부터 신호를 수신하여 피부 조명 장치가 사용자의 심장 박동 과 대략 동기화되어 켜지도록 구성된다. 예를 들어, 스마트 폰, 스마트 워치 및 다른 장치 중 하나 이상은 외부 심장 박동 센서를 포함한다. 대안적으로 또는 추가로, 피부 조명 장치는 피부 조명 장치의 외부에 위치된 거짓 (false) 심장 박동 생성기로부터 거짓 심장 박동 신호를 수신하도록 구성된다. 거짓 심장 박동은 실제 생활의 심장 박동과는 관련이 없다. 대안적으로 또는 추가로, 피부 조명 장치는 독립된 특징으로서 임의의 장치로부터 의 실제 펄스 신호 없이도 거짓 심장 박동을 생성한다. 펄스 효과와 유사하게, 피부 조명 장치에 의해 임의의 다른 관심 시각 효과, 예를 들어, 번쩍임, 깜빡임, 주행 등, 스트로브 효과(strobe effect), 디밍, 국부 디밍, 재생되는 노래의 리듬에 의해/리듬으로 진동하는 (pulsating) 것 등이 제공될 수 있다. 예를 들어, AI는 피부 조명 장치를 사용하여 알람 및 신호 중 하나 이상을 생성할 수 있다. 예를 들어, AI는 Siri, Alexa, Cortana 및 다른 AI 중 하나 이상을 포함한다. 예를 들어, 장치 알림으로 인해 피부 조명 장치가 피부를 조명하게 할 수 있다. 예를 들어, 피부 조명 장치는 수신 전화, 음성 메일, 수신 문자 메시지, 수신 전자 메일(email) 메시지 및 다른 장치 알림 중 하나 이상에 의 해 트리거될 수 있다. 예를 들어, 인간의 귀, 팔, 다리, 발 및 손목 중 하나 이상이 사용자의 전화벨이 울릴 때 피부 조명 장치에 의해 조명된다. 예를 들어, 피부 조명 장치를 착용하는 동안, 사용자는 스마트 장치를 사용자의 얼굴에 향하게 하여 AI가 사용 자의 얼굴, 사용자의 귀 및 사용자의 얼굴 또는 신체의 다른 특징 중 하나 이상을 검출하게 할 수 있다. 그런 다음 AI는 검출된 특징에 따라 광을 조정할 것이다. 예를 들어, AI는 사용자의 귀가 고르게 조명되도록 광을 조 정한다. 예를 들어, 프로그램이 광을 조정한다. 예를 들어, 피부 조명 장치는 마이크로폰을 포함한다. 예를 들어, 마이크로폰은 내장형 마이크로폰 및 독립형 마이크로폰 중 하나 이상을 포함한다. 예를 들어, 피부 조명 장치는 무서운 웃음, 울음 소리, 다른 음향 및 다 른 활성화 트리거 중 하나 이상에 의해 활성화될 수 있다. 예를 들어, 피부 조명 장치는 컴퓨터, 랩톱, 데스크 탑 컴퓨터, 태블릿, 모바일 폰, MP3 플레이어, 다른 음악 플레이어 및 다른 컨트롤러 중 하나 이상에 대한 알림 에 의해 활성화된다. 예를 들어, 피부 조명 장치는 전화벨의 울림, 수신 전화, 음성 메일 메시지, 문자 메시지 및 컴퓨터, 랩톱, 데스크탑 컴퓨터, 태블릿, 모바일 폰, MP3 플레이어, 다른 음악 플레이어 및 다른 컨트롤러 중 하나 이상에 대한 다른 알림 중 하나 이상에 의해 활성화된다. 예를 들어, 피부 조명 장치의 활성화는 인체 부분 및 동물 신체 부분 중 하나 이상의 조명을 트리거한다. 예를 들어, 피부 조명 장치의 활성화는 사용자의 귀와 사용자의 다른 신체 부분의 조명을 트리거한다. 예를 들어, 본 발명은 조명되도록 구성된 코드를 더 포함한다. 예를 들어, 피부 조명 장치는 하나 이상의 미리 선택된 트리거에 의해 활성화된다. 예를 들어, 트리거는 사용자 의 분노, 비명, 으르렁거리는 소리(growl), 웃음, 윙윙거리는 소리(hum), 미리 선택된 감정, 음성 활성화 및 다 른 트리거 중 하나 이상을 포함한다. 예를 들어, 피부 조명 장치는 사용자의 코를 조명하고 피부조명 장치를 사용자의 코에 고정하는 클립을 더 포함 한다. 예를 들어, 클립은 피부 조명 장치를 사용자의 콧구멍에 고정시킨다. 예를 들어, 피부 조명 장치는 사용자의 안경의 코 패드로 구성된다. 예를 들어, 피부 조명 장치는 사용자의 코 를 조명하는데 사용된다. 예를 들어, 광원은 광을 사용자의 코로 지향시켜 이를 조명한다. 예를 들어, 광원은 안경, 안경용 연장 코드 및 안경의 템플 팁(temple tip)에 장착된다. 예를 들어, 피부 조명 장치는 사용자의 입술 및 치아 사이에 위치된다. 예를 들어, 광원은 입술 및 뺨 중 하나 이상을 조명하도록 사용자의 신체로부터 떨어져 광을 지향시킨다. 예를 들어, 광원은 모자가 피부와 닿는 곳에서 사용자의 피부를 조명하는 사용자의 모자 내부에 배치될 수 있다. 예를 들어, 광원은 사용자의 머리 주위에 완전한 원을 만든다. 예를 들어, 피부 조명 장치는 사용자의 브래지어의 가장자리에, 필수적이지는 않지만 바람직하게는 브래지어의 컵의 가장자리에 위치되어 사용자의 가슴이 조명된다. 예를 들어, 피부 조명 장치는 사용자의 젖꼭지 위에 위치 되어 가슴이 젖꼭지로부터 조명된다. 예를 들어, 메달리온(medallion)은 피부 조명 장치를 포함한다. 예를 들어, 메달리온은 사용자의 가슴 사이에 위치되어 이를 조명하도록 구성된다. 예를 들어, 패치는 피부 조명 장치를 포함한다. 예를 들어, 패치는 세척 가능한 접착제, 다른 자체 접착, 제거 가능한 재료 및 흡입 컵 중 하나 이상으로 사용자의 피부에 부착된다. 예 를 들어, 스티커는 피부 조명 장치를 포함한다. 예를 들어, 피부 조명 장치는 그물을 포함하여, 사용자의 피부 가 그물 아래에서 조명된다. 예를 들어, 그물은 그 상에 장난감 거미를 갖는다. 예를 들어, 피부 조명 장치는 사용자의 귀를 완전히 커버하지 않는 작은 헤드폰의 측면에 장착되어 사용자의 귀 의 덮이지 않는 섹션을 조명한다. 예를 들어, 음향 방출 장치는 달리기하는 사람, 조깅하는 사람, 자전거 운전자 및 다른 운동 사용자 중 하나 이 상에 의해 야간 또는 가시성이 감소된 다른 시간에 사용될 수 있다. 음향 방출 장치는 헤드폰, 신호 및 패션 중 하나 이상의 기능을 만족시킨다. 예를 들어, 피부 조명 장치는 사용자의 피부로부터 광의 직접 반사 및 광원으로부터의 직접 광 중 하나 이상을 감소시키도록 구성된 섀도잉 장치를 더 포함한다. 예를 들어, 섀도잉 장치는 광원 및 형상 홀더 중 하나 이상에 물리적으로 연결된다. 예를 들어, 섀도잉 장치는 사용자의 피부로부터의 광의 반사를 실질적으로 방지하도록 구 성된다. 예를 들어, 섀도잉 장치는 사용자의 귀에서 빛이 반사되는 것을 방지하도록 구성된다. 따라서, 섀도잉 장치는 광이 사용자 뒤에 있는 사람이 눈부시게 하는 것을 방지할 수 있다. 예를 들어, 섀도잉 장치는 핀(fin)을 포함한다. 예를 들어, 핀은 막, 발포체, 실리콘, 점탄성 실리콘 고무, 스 펀지, 가죽 및 다른 섀도잉 장치 중 하나 이상을 포함한다. 예를 들어, 섀도잉 장치는 분리 가능하다. 분리 가능한 섀도잉 장치는 다른 사용자의 다른 귀 모양 및 다른 귀 사이즈 중 하나 이상을 허용한다. 사용자는 모양 및 사이즈 중 하나 이상을 선택할 수 있다. 광을 가리거나 숨겨두면, 반사광 대신 조명된 피부에 집중되어 구경꾼의 눈부심을 방지한다. 대안적으로 또는 추가로, 섀도잉 장치는 실질적으로 반투명하다. 예를 들어, 섀도잉 장치는 적색 및 주황색 중 하나 이상으로 착색된 반투명 재료를 포함한다. 이에 의해, 피부 조명 장치는 조명된 사용자의 귀와 광학적으로 혼합된다. 예를 들어, 섀도잉 장치의 조명된 섹션은 반사되어 사용자의 피부에서 반사된 빛이 다시 사용자의 피부로 반사 될 수 있다. 예를 들어, 섀도잉 장치의 색상은 사용자의 귀의 색상과 동일하거나 유사한 것 중 하나 이상에 해 당한다. 예를 들어, 전원은 피부 조명 장치에 물리적으로 부착된다. 예를 들어, 컨트롤러는 피부 조명 장치에 물리적으 로 부착된다. 예를 들어, 전원은 소싱 케이블(sourcing cable)을 포함한다. 예를 들어, 컨트롤러는 소싱 케이블 을 포함한다. 예를 들어, 소싱 케이블은 신호 또는 전력 중 하나 이상을 전달한다. 예를 들어, 신호는 오디오 신호를 포함한다. 예를 들어, 전원은 광섬유를 포함한다. 예를 들어, 컨트롤러는 광섬유를 포함한다. 피부 조명 장치가 오디오 기능을 갖는 경우, 소싱 케이블이 이어버드에 부착되어 소싱 케이블을 사용자의 머리 앞에서 볼 수 있다. 대안적으로, 소싱 케이블은 귀의 뒤에 위치될 수 있다. 예를 들어, 피부 조명 장치는 섀도잉 장치에 장착된다. 예를 들어, 섀도잉 장치는 광원을 포함한다. 예를 들어, 형상 홀더는 섀도잉 장치를 포함한다. 예를 들어, 피부 조명 장치는 형상 홀더를 포함하지 않는다. 예를 들어, 피부 조명 장치는 광섬유 케이블을 포함한다. 예를 들어, 피부 조명 장치는 청색광, 자외선 광 및 레이저 광 중 하나 이상에 의해 조명되는 광섬유 케이블을 포함한다. 예를 들어, 광섬유 케이블은 피부 조명 장 치의 베이스까지 차폐된다. 베이스에서, 형광체는 형광체의 여기 후의 광을 백색광, 주황색광, 적색광, 다른 파 장의 광 및 파장의 조합 중 하나 이상으로 변환하도록 적용된다. 인광체는 도포, 도장, 실장, 주입 및 성형 중 하나 이상이 수행될 수 있다. 예를 들어, 피부 조명 장치는 형광체 및 원격 형광체 중 하나 이상을 포함한다. 예를 들어, 섀도잉 장치는 형광 체 및 원격 형광체 중 하나 이상을 포함한다. 예를 들어, 피부 조명 장치는 형광체의 하나의 층, 하나의 반사층 및 하나의 섀도잉 층을 포함한다. 예를 들어, 형광체 층은 광섬유 케이블과 접촉하도록 엔지니어링된다.예를 들어, 센서는 주변 광 센서, 심박 센서, 진동 센서, 터치 센서, 마이크로폰, 가속도계 센서 및 다른 센서 중 하나 이상을 포함한다. 예를 들어, 센서는 피부 조명 장치가 사용자의 피부의 접촉 및 사용자의 미리 결정된 거리 내에 들어오는 것 중 하나 이상을 수행하는 때를 결정하도록 구성되는 터치 센서를 포함한다. 예를 들어, 피부 조명 장치는 터치 센서가 피부 조명 장치가 사용자의 피부의 접촉 및 사용자의 미리 결정된 거 리 내에 들어오는 것 중 하나 이상을 수행하는 것을 결정하는 위치만을 조명한다. 예를 들어, 터치 센서는 피부 조명 장치가 사용자의 피부에 닿는 영역에서 광원을 활성화하는데 사용될 수 있다. 예를 들어, 터치 센서는 피부 조명 장치가 사용자의 피부에 닿는 광원의 강도를 낮추도록 구성되어 피부 가 더 고르게 조명될 수 있다. 예를 들어, 센서는 피부 조명 장치에 포함되지 않은 독립형 장치의 일부이다. 예를 들어, 독립형 장치는 스마트 폰, 스마트 워치, 스마트 웨어러블, 스마트 장치, 태블릿 및 다른 독립형 장치 중 하나 이상을 포함한다. 예를 들어, 센서에 의해 생성되는 데이터는 피부 조명 장치로 전송된다. 예를 들어, 센서 데이터는 무선으로 전송된 다. 예를 들어, 무선 전송은 블루투스, 지그비, WiFi, 근거리 통신(NFC) 및 다른 무선 전송 방법 중 하나 이상 을 사용하여 발생한다. 예를 들어, 주변 광 센서는 광원의 강도를 조절하는데 사용된다. 예를 들어, 심박 센서는 피부 조명 장치 펄스를 심박 센서에 의해 생성된 심박 리듬과 대략적으로 동기화시키는 데 사용된다. 예를 들어, 진동 센서는 사용자의 신체의 움직임과 동기화하여 피부 조명 장치에 전력을 공급하는데 사용된다. 예를 들어, 진동 센서는 사용자의 후두(larynx)의 진동을 검출하도록 구성되는 후두 센서를 포함한다. 예를 들 어, 후두 센서는 으르렁거리는 소리, 말하기, 비명, 웃음 및 다른 음향을 내는 것 중 하나 이상을 행하는 사용 자를 검출하고 그 다음 센서 데이터를 피부 조명 장치로 전송할 수 있다. 그런 다음, 센서 데이터를 사용하여 광원을 제어할 수 있다. 예를 들어, 피부 조명 장치는 내장형 음향 방출 장치를 더 포함하며, 마이크로폰은 핸즈프리 센서로서 사용된다. 예를 들어, 마이크로폰은 으르렁거리는 소리, 말하기, 비명, 웃음, 원하는 문구를 말하기 및 다른 음 향을 내는 것 중 하나 이상을 행하는 사용자를 검출하고 그 다음 전원 켜기, 불 켜기, 피부 조명 장치를 제어하 는 것, 음향을 생성하는 것 및 다른 원하는 행동을 취하는 것 중 하나 이상을 행할 수 있다. 예를 들어, 원하는 문구는 “사랑합니다\" 및 “나와 결혼할래?” 중 하나 이상을 포함한다. 예를 들어, 센서는 사용자 신체의 움직임, 예를 들어 조깅, 달리기, 자전거 타기, 스케이트 타기, 스키 타기, 춤 및 다른 신체 움직임 중 하나 이상과 동기화하여 광원을 제어하기 위해 이용 가능한 가속도계 센서를 포함한 다. 예를 들어, 전원, 컨트롤러, 사용자 인터페이스 및 센서 중 하나 이상은 사용자의 목 주위에 착용되도록 구성되 는 말굽 또는 목걸이 모양을 형성한다. 예를 들어, 전원, 컨트롤러, 사용자 인터페이스 및 센서 중 하나 이상은 왕관 모양을 형성하여 피부 조명 장치 가 사람의 머리를 들어 올려 사용자의 귀를 노출시킬 수 있다. 예를 들어, 광원, 형상 홀더, 섀도잉 장치 및 음향 방출 장치 중 하나 이상은 전원을 포함한다. 예를 들어, 광 원, 형상 홀더, 섀도잉 장치, 컨트롤러 및 음향 방출 장치 중 하나 이상은 사용자 인터페이스를 포함한다. 예를 들어, 광원, 형상 홀더, 섀도잉 장치 및 음향 방출 장치 중 하나 이상은 센서를 포함한다. 예를 들어, 다른 장치는 전원을 포함할 수 있다. 예를 들어, 다른 장치는 컨트롤러를 포함한다. 예를 들어, 다 른 장치는 사용자 인터페이스를 포함한다. 예를 들어, 다른 장치는 센서를 포함할 수 있다. 예를 들어, 다른 장 치는 휴대폰, 태블릿, 미디어 플레이어 및 다른 장치 중 하나 이상을 포함한다. 예를 들어, 작은 컨테이너는 전원을 포함한다. 예를 들어, 작은 컨테이너는 컨트롤러를 포함한다. 예를 들어, 작은 컨테이너는 사용자 인터페이스를 포함한다. 예를 들어, 작은 컨테이너는 센서를 포함한다. 예를 들어, 작 은 컨테이너는 사용자에 의해 운반되거나, 사용자의 주머니에 넣거나, 사용자의 옷에 클리핑될 수 있다. 예를 들어, 피부 조명 장치는 반사 표면을 더 포함한다. 반사 표면은 사용자의 피부를 향해 광을 반사한다. 예를 들어, 피부 조명 장치는 광학부를 더 포함한다. 예를 들어, 광학부는 광 분배 각도를 변경할 수 있다. 예 를 들어, 광학부는 대략 160도 분포 각도에서 대략 40도 분포 각도로 광 원뿔(cone of light)을 좁힐 수 있다. 예를 들어, 피부 조명 장치는 사용자의 귀를 조명한다. 예를 들어, 피부 조명 장치는 귀가 머리에 붙어 있는 사 용자의 귀의 뒷부분을 조명한다. 예를 들어, 귀는 귀의 뒷부분과 머리의 교차에 의해 형성된 채널에서 귀와 머 리 사이에 위치된 피부 조명 장치에 의해 조명된다. 이들 실시예는 귀의 표면의 대부분의 최적 조명을 제공한다. 예를 들어, 광원은 귀의 베이스를 돌아간다. 예를 들어, 음향 방출 장치는 사용자의 이도를 조명하도록 조명되는 이어버드를 포함한다. 예를 들어, 음향 방 출 장치는 방사상으로 장착된 조명을 포함하며, 음향 방출 장치는 이도 주위의 귀를 조명하도록 구성된다. 음향 방출 장치가 보다 복잡한 모양을 갖는 이어버드를 포함하는 경우, 광원은 이어버드의 가장자리 근처의 영역을 조명하도록 위치될 수 있어서, 광원은 귀 중앙부의 피부를 조명하지만 이어버드의 외부에 직접 보이지 않는다. 예를 들어, 피부 조명 장치는 피부를 조명하도록 사용자에 의해 착용된 초커, 목걸이, 메달리온 및 팬던트 중 하나 이상의 내측에 배치된다. 예를 들어, 광원은 초커의 가장자리 주위에 위치된다. 예를 들어, 피부 조명 장치는 머리띠를 포함하여, 머리에 머리띠를 놓은 사용자는 그의 머리, 귀 및 피부 중 하 나 이상을 불을 켠다. 예를 들어, 피부 조명 장치는 머리가 빛나도록 인공 모근에 위치될 수 있다. 음향 방출 장치를 포함하는 장치의 경우, 소싱 케이블은 이어버드에 부착될 수 있다. 그러한 경우에, 대안적으 로 또는 추가로, 소싱 케이블은 사용자의 귀 뒤에 위치될 수 있다. 예를 들어, 피부 조명 장치는 사용자의 귓불을 조명한다. 예를 들어, 피부 조명 장치는 귀걸이를 포함한다. 예를 들어, 귀걸이는 대략 버튼과 같은 모양이다. 예를 들어, 귀걸이는 사용자의 귀를 통과하는 핀(pin)을 포함한다. 예를 들어, 귀걸이는 전원, 광원, 배터리, 컨트롤러 및 사용자 인터페이스 중 하나 이상을 포함한다. 예를 들어, 광원은 귓불 근처의 버튼 측면상에 배치될 수 있다. 예를 들어, 광원은 귀걸이 핀의 일부일 수 있다. 예를 들어, 전원, 광원, 배터리, 컨트롤러 및 사용자 인터페이스 중 하나 이상은 귀걸이에 부착된 팬던트에 내 장된다. 예를 들어, 광원은 장식용 귀걸이 스토퍼를 사용하여 광을 방출한다. 예를 들어, 귀걸이 스토퍼는 교환 가능한 것과 교체 가능한 것 중 하나 이상일 수 있다. 예를 들어, 광원은 귀걸이의 버튼 부분으로부터 광을 방출한다. 예를 들어, 귀걸이는 광을 방출할 수 있다. 예를 들어, 귀걸이는 사용자의 귀를 감싸 귀의 나선을 조명할 수 있 다. 예를 들어, 버튼 귀걸이는 귀의 나선을 조명하는 것뿐만 아니라 장식 기능도 제공한다. 예를 들어, 피부 조명 장치는 귓불을 스트레칭함으로써 귓불에 부착되는 귀마개(earplug)를 포함한다. 예를 들 어, 광원은 귓불에 가장 잘 조명하기 위해 귀의 방사상 주변부에 있다. 예를 들어, 전원, 광원, 배터리, 컨트롤 러 및 사용자 인터페이스 중 하나 이상은 피부 조명 장치에 의해 형성된 빈 공간에 배치된다. 예를 들어, 피부 조명 장치는 장식용 귀걸이를 포함한다. 예를 들어, 피부 조명 장치는 용 귀걸이를 포함한다. 예를 들어, 피부 조명 장치는 귀 나선의 전방 부분에 위치된 용 귀걸이를 포함한다. 예를 들어, 광원은 귀 나선 주위의 귀의 뒤에 배치된다. 이러한 실시예는 아름다운 장식용 귀걸이 및 귀 나선을 따른 광원의 이중 목적을 갖는다. 예를 들어, 피부 조명 장치는 패치 문신을 포함한다. 예를 들어, 문신은 실질적으로 투명하고 유연한 재료를 포 함한다. 예를 들어, 타투는 실리콘 및 열가소성 엘라스토머(TPE)를 포함한다. 예를 들어, 광원은 피부 측의 사용자의 배꼽 링에 배치되어 배꼽을 둘러싸는 사용자의 피부를 조명한다. 도 1은 피부 조명 장치의 도면이다. 피부 조명 장치는 광을 생성시키도록 구성되는 광원을 포함 한다. 도시된 바와 같이, 피부 조명 장치는 다수의 광원을 포함한다. 대안적으로, 피부 조명 장치는 단지 하나의 광원을 포함할 수 있다. 광원은 사용자(미도시)의 피부를 조명하는데 사용 가능한 광을 생성하도록 구성된다. 예를 들어, 광원 은 인간 사용자의 피부를 조명하는데 사용 가능한 광을 생성하도록 구성된다. 대안적으로 또는 추가로, 광원은 비인간 사용자의 피부를 조명하기 위해 사용 가능한 광을 생성하도록 구성된다. 예를 들어, 광원은 발광 다이오드(LED), 유기 발광 다이오드(OLED), 마이크로-LED, 나노-LED, LED 필라멘 트, 레이저, 광섬유 광원, 빛나는 광섬유 광원, 필라멘트 전구, 비 필라멘트 전구, 형광 광원, 미래 광원, 생체 발광, 화학 발광, 인광, 방사선 발광, 포토 루미네센스, 전계 발광 및 다른 광원 중 하나 이상을 포함한다. 도 시된 바와 같이, 광원 각각은 LED를 포함한다. 예를 들어, 광원은 방출된 광의 빔 각도가 사용자의 귀의 후방 부분(미도시)의 일반적인 방향을 가리키도록 배치된다. 피부 조명 장치는 광원에 작동 가능하게 연결되는 형상 홀더를 더 포함하며, 형상 홀더는 조명될 사용자의 피부 근처에 광원을 제 위치에 유지시키도록 구성된다. 이 예에서, 형상 홀더는 광 원이 사용자의 피부를 조명할 수 있도록 광원을 제 위치에 유지시키도록 구성된다. 예를 들어, 형상 홀더는 사용자의 귀의 피부로부터 대략 0에서 대략 20 밀리미터(mm) 사이의 대략적인 거리에서 광원 을 제 위치에 유지시키도록 구성된다. 예를 들어, 형상 홀더는 광원을 원하는 모양으로 유지시킨다. 예를 들어, 형상 홀더는 가요성이 다. 예를 들어, 형상 홀더는 가요성이 없다. 예를 들어, 형상 홀더는 귀가 머리에 연결되는 사용자의 귀의 곡선 모양으로 광원을 유지시킨다. 예를 들어, 형상 홀더는 일반적으로 귀의 모양을 따르는 형 상 및 곡률 중 하나 이상을 갖는다. 피부 조명 장치는 광원에 작동 가능하게 연결되는 사용자 인터페이스를 더 포함하며, 사용자 인 터페이스는 사용자가 광원을 제어하게 하도록 구성된다. 예를 들어, 사용자 인터페이스는 사용자가 광원에 의해 방출되는 광량, 피부 조명 장치에 의해 사용된 전력, 어느 광원이 켜졌는지, 어느 광원이 꺼졌는지, 주어진 광원에 의해 제공된 조명도(degree of illumination), 주어진 광원에 의해 제공된 광의 색상 중 하나 이상을 조정하도록 한다. 예를 들어, 사용자 인터페이스는 버튼 및 스위치 중 하나 이상을 포함한다. 예를 들어, 사용자 인터페이스 는 터치 인터페이스를 포함한다. 피부 조명 장치는 광원에 작동 가능하게 연결된 전원을 더 포함한다. 도시된 바와 같이, 전원은 배터리를 포함한다. 선택적으로, 컨트롤러는 전원을 포함한다. 대안적으로, 전원은 컨트롤러 를 포함한다. 예를 들어, 피부 조명 장치는 사용자 인터페이스의 작동을 제어하고 필요한 소프트웨어를 포함하는 컨트롤러를 더 포함한다. 예를 들어, 컨트롤러는 인쇄 회로 기판(PCB)을 포함한다. 컨트롤러는 광원을 사용자 인터페이스에 연결시킨다. 컨트롤러는 또한 광원을 전원에 전기적으로 연결시킨다. 예를 들어, 컨트롤러는 소싱 케이블을 포함한다. 예를 들어, 컨트롤러는 스마트 장치(미 도시)를 포함한다. 예를 들어, 스마트 장치는 랩톱, 스마트 워치, 스마트 폰, 태블릿, 컴퓨터 및 다른 스마트 장치 중 하나 이상을 포함한다. 예를 들어, 피부 조명 장치는 마이크로 프로세서를 더 포함한다. 컨트롤러는 마이크로 프로세서 를 광원 중 하나 이상에 연결시킨다. 마이크로 프로세서는 디밍, 전력 조절, 스위칭 입력 및 스위칭 출력 중 하나 이상을 수행하도록 구성된다. 컨트롤러는 사용자 인터페이스를 광원중 하나 이상 에 추가로 연결시켜 광원의 사용자 제어를 가능하게 한다. 도 2a-2b는 음향을 방출하도록 구성되는 음향 방출 장치를 포함하는 피부 조명 장치의 2 개의 도면의 세트이다. 음향 방출 장치는 사용자의 귀(미도시)에 들을 수 있는 음향을 방출하기에 적합한 이어폰 을 포함한다. 이 예에서, 형상 홀더는 이어폰과 매우 유사하다. 도 2a에 도시된 바와 같이, 피부 조명 장치는 광원을 더 포함한다. 이 예에서, 피부 조명 장치 는 다수의 광원을 포함한다. 예를 들어, 광원은 마이크로 발광 다이오드(마이크로-LED)를 포함한다. 예를 들어, 마이크로-LED는 방출된 광의 빔 각도가 사용자의 귀(미도시)의 후방 부분의 일반적인 방향을 가리키도록 배치된다. 피부 조명 장치는 광원에 작동 가능하게 연결되는 형상 홀더, 광원에 작동 가능하게 연결 되는 사용자 인터페이스, 전원, 컨트롤러, 형상 홀더 와이어, 오디오 인터페이스 및 오디오 인터페이스 와이어를 더 포함한다. 이 예에서, 컨트롤러는 전원을 포함한다. 예를 들어, 전원은 배터리를 포함한다. 예를 들어, 컨트롤러는 오디오 인터페이스에 의해 생성된 오디오 신호와 광원에 전력을 높이기 위해 컨트롤러에 의해 생성된 신호 사이의 간섭에 의해 생성된 전기적 노 이즈를 감소시키기 위해 적어도 15 kHz의 주파수를 사용하는 펄스 폭 변조(PWM)를 사용하여 광원에 전력을 전송한다. 전원은 광원에 전력을 전송한다. 예를 들어, 전원은 펄스 폭 변조(PWM)를 사용하여 광원에 전력을 전송한다. 컨트롤러는 형상 홀더 와이어를 사용하여 이어폰에 작동 가능하게 연결된다. 오디오 인터페이스 는 오디오 신호를 수신하는 것 및 전송하는 것 중 하나 이상을 수행하도록 구성된 오디오 커넥터를 포함한 다. 오디오 인터페이스는 디지털 오디오 인터페이스 및 아날로그 오디오 인터페이스 중 하나 이 상을 포함한다. 예를 들어, 도시된 바와 같이, 오디오 인터페이스는 제4의 핀으로서 마이크로폰 핀을 포함 하는 아날로그 3.5 밀리미터(mm) 스테레오 잭을 포함한다. 예를 들어, 마이크로폰은 원격 제어부로서 사용 가능 할 수도 있다. 대안적으로 또는 추가로, 오디오 인터페이스는 캘리포니아 쿠퍼티노의 Apple, Inc.(www.apple.com)에서 제조한 “조명” 오디오 인터페이스 및 USB-C(Universal Serial Bus-C) 오디오 인터 페이스 중 하나 이상을 포함한다. 예를 들어, 오디오 인터페이스는 전원으로서 사용될 수도 있다. 예를 들어, 사용자 인터페이스는 인터페이스 스위치 및 터치 인터페이스 중 하나 이상을 포함한다. 사용자 인터페이스는 컨트롤러를 더 포함한다. 컨트롤러는 사용자 인터페이스9130)의 작동을 지시하고 필요한 소프트웨어를 포함한다. 사용자 인터페이스는 사용자 인터페이스 하우징에 의해 보호된다. 오디오 인터페이스에 의해 수신된 오디오 신호는 오디오 인터페이스 와이어를 통해 전송되고 컨트롤 러에 의해 수신된다. 그 후 컨트롤러는 신호를 선택적으로 처리한다. 컨트롤러는 이어서 오디오 신호를 형상 홀더 와이어를 통해 이어폰 상으로 통과시킨다. 컨트롤러는 선택적인 USB(universal serial bus) 포트를 더 포함한다. USB 포트는 전원의 충전, 통신, 펌웨어 업그 레이드, 소프트웨어 업그레이드 및 다른 목적 중 하나 이상을 위해 사용 가능하다. 도 2b는 상기 언급된 바와 같이 이 예에서 형상 홀더와 매우 유사한 음향 방출 장치에 관한 세부 사 항을 도시하는 확대도이다. 형상 홀더는 광원을 포함한다. 형상 홀더는 광원을 사용자의 귀(미도시)의 후방 측 주위의 제 위치에 유지시킨다. 형상 홀더는 광원, 컨트롤러 및 전원 사이에 전도성 연결을 제공하는 가요성 인쇄 회로(FPC)를 더 포함한다. FPC는 광원을 포함한다. 예를 들어, FPC는 형상 홀더 내부에 현수된다(suspended). 예를 들어, FPC는 광원이 사용 자의 귀 후방을 향해 광을 방출하도록 위치된다. 형상 홀더 와이어는 형상 홀더의 길이를 관통한다. 형상 홀더는 일반적으로 사용자의 귀(미도시)의 윤곽과 일치하도록 형상화된다. 예를 들어, 형상 홀더 는 실질적으로 단색인 재료를 포함한다. 예를 들어, 형상 홀더는 슬릿 및 홀 중 하나 이상을 갖는 재 료를 포함한다. 예를 들어, 형상 홀더는 투명, 반투명(translucent) 및 아투명(semi-transparent) 중 하 나 이상인 재료를 포함하며, 이에 의해 광원에 의해 방출된 광이 귀의 방향으로 형상 홀더로부터 출 사되도록 한다. 예를 들어, 음향 방출 장치는 형상 홀더 와이어를 통해 광원에 작동 가능하게 연결되는 평형 전 기자 드라이버(balanced armature driver, 280)를 더 포함하며, 평형 전기자 드라이버는 오디오 인터페이 스(도 2b에는 미도시)로부터 수신되는 오디오 신호를 수신하도록 구성된다. 평형 전기자 드라이버는 수정된 오디오 신호를 생성하도록 추가로 구성된다. 음향 방출 장치는 균형 전기자 드라이버로부터 수정된 오디오 신호를 전송하도록 구성되는 음향 채널을 더 포함한다. 음향 방출 장치는 선택적인 이 어팁을 더 포함하며, 이어팁은 사용자의 귀(미도시)에 꼭 끼워 맞춰지도록(snugly fit) 구성된다. 평형 전기자 드라이버는 형상 홀더 와이어를 통해 음향 채널에 작동 가능하게 연결된다. 도 3a-3b는 사용자의 귀 주위에 착용되도록 설계된 피부 조명 장치의 2 개의 도면의 세트이다. 예를 들어, 피부 조명 장치는 사용자의 귀의 나선 주위에 착용될 수 있다. 도 3a는 피부 조명 장치의 구성요소를 도시한다. 이 예에서, 피부 조명 장치는 다수의 광원을 포함한다. 예를 들어, 도시된 바와 같이, 광원은 LED를 포함한다. 피부 조명 장치는 광원에 작 동 가능하게 연결된 형상 홀더를 더 포함하며, 형상 홀더는 피부 조명 장치가 귀 주위의 제 위치를 유지하도록 구성된다. 피부 조명 장치는 사용자 인터페이스를 더 포함하며, 사용자 인터페이스 는 인터페이스 형상 홀더 와이어를 통해 광원에 작동 가능하게 연결되며, 사용자 인터페이스는 사용자가 광원을 제어하도록 구성된다. 피부 조명 장치는 전원을 더 포함하며, 전원은 사용자 인터페이스 형상 홀더 와이어를 통 해 형상 홀더에 작동 가능하게 연결된다. 이 예에서, 전원은 컨트롤러를 포함한다. 피부 조명 장치는 컨트롤러를 더 포함한다. 컨트롤러는 사용자 인터페이스의 작동을 지시하고 필요한 소프트웨어를 포함한다. 전원 하우징은 전원, 사용자 인터페이스 및 컨트롤러를 포함한다. 예를 들어, 전원은 배터리를 포함한다. 전원은 광원으로 전력을 전송한다. 예를 들어, 전원 은 펄스 폭 변조(PWM)를 사용하여 광원으로 전력을 전송한다. 예를 들어, 전원은 직류(DC)를 이 용하여 전력을 광원으로 전송한다. 피부 조명 장치는 광원, 컨트롤러 및 전원 사이에 전도성 연결을 제공하는 FPC를 더 포함한다. FPC는 광원을 포함한다. 예를 들어, FPC는 형상 홀더 내에 현수된다. 예를 들어, FCP는 광원이 사용자의 귀의 후방을 향해 광을 방출하도록 위치된다. 도 3b는 인간 사용자의 귀에 착용되는 귀 조명 장치를 도시한다. 도 4a-4c는 사용자의 목 주위에 밴드로서 착용되도록 설계되는 피부 조명 장치의 3 개의 도면의 세트이다. 도 4a는 사용자의 목에 착용되지 않은 시간에 사용자의 목 주위에 밴드로서 착용되도록 설계된 피부 조명 장치 의 도면을 도시한다. 피부 조명 장치는 복수의 광원을 포함한다. 이 예에서, 광원은 마이 크로-LED를 포함한다. 이 예에서, 광원은 조명 장식물을 포함한다. 이 예에서, 광원은 별 모양의 조 명 장식물을 포함한다. 별 모양의 조명 장식물은 아투명 재료 및 불투명 재료 중 하나 이상을 포함한 다. 별 모양의 조명 장식물은 또한 사용자의 피부로부터의 광의 직접 반사 및 광원으로부터의 직접 광 중 하나 이상을 감소시키도록 구성되는 섀도잉 장치로서 기능한다. 이 예에서, 형상 홀더는 피부 조명 장치와 매우 유사하다. 대안적으로 또는 추가로, 본 발명의 실시 예는 사용자의 발목 및 사용자의 손목 중 하나 이상에 착용될 수 있다. 예를 들어, 피부 조명 장치는 실리 콘을 포함한다. 예를 들어, 실리콘은 가요성이다. 예를 들어, 실리콘은 실질적으로 투명하다. 예를 들어, 피부 조명 장치는 열가소성 엘라스토머(TPE)를 포함한다. 이 예에서, 피부 조명 장치는 형상 홀더와 매우 유사하다. 또한 복수의 광원, 컨트롤러, 사용자 인터페이스, 전원 및 전원이 광원에 작동 가능하게 연결된 전도성 트랙이 도 시된다. 전도성 트랙은 피부 조명 장치 내부에 현수될 수 있다. 전원은 사용자 인터페이스의 작동을 지시하고 필요한 소프트웨어를 포함하는 컨트롤러를 더 포 함한다. 피부 조명 장치는 광원, 컨트롤러 및 전원 사이에 전도성 연결을 제공하는 가요성 인쇄 회로(FPC)를 더 포함한다. 이 예에서, 전원은 컨트롤러를 포함한다. 도 4b는 피부 조명 장치의 후면도를 도시한다. 복수의 광원이 다시 도시된다. 피부 조명 장치는 형상 홀더와 매우 유사하다. 사용자 인터페이스가 또한 도시된다. 사용자 인터페이스 하우징가 또한 도시된다. 또한 전원으로부터 광원으로 전기를 전도하도록 구성된 전도성 트랙이 도시된다. 전도성 트랙에 의해 광원에 작동 가능하게 연결된 사용자 인터페이스가 또한 도시된 다. 별 모양의 조명 장식물은 또한 사용자의 피부로부터의 광의 직접 반사 및 광원으로부터의 직접 광 중 하나 이상을 감소시키도록 구성되는 섀도잉 장치로서 기능한다. 전원은 무선으로 제어될 수 있다. 전원은 사용자 인터페이스에 포함된 버튼을 사용하여 제어될 수 있다. 도 4c는 형상 홀더와 다시 매우 유사한 피부 조명 장치를 착용한 사용자의 목의 정면도를 도시한다. 또한 광원 및 전도성 트랙이 다시 도시된다. 도 5a-5b는 사용자의 목 주위에 밴드로서 착용되도록 설계되는 피부 조명 장치의 2 개의 도면의 세트이다, 도 5a는 사용자의 목에 착용되지 않을 때의 피부 조명 장치를 도시한다. 이 예에서, 형상 홀더는 피 부 조명 장치와 매우 유사하다. 대안적으로 또는 추가로, 본 발명의 실시예는 사용자의 발목 및 사용자의 손목 중 하나 이상에 착용될 수 있다. 예를 들어, 피부 조명 장치는 실리콘을 포함한다. 예를 들어, 실리 콘은 가요성이다. 예를 들어, 실리콘은 실질적으로 투명하다. 예를 들어, 피부 조명 장치는 열가소성 엘라스토 머(TPE)를 포함한다. 피부 조명 장치는 복수의 광원(도 5b에 도시됨)을 포함한다. 이 예에서, 광원은 마이크로-LED를 포함한다. 피부 조명 장치는 사용자 인터페이스, 전원 및 컨트롤러를 더 포함한다. 예를 들어, 사용자 인터페이스는 버튼 및 스위치 중 하나 이상을 포함한다. 이 예에서, 피부 조명 장치는 차광 장치를 포함한다. 이 예에서, 차광 장치는 차광 장식물을 포함한다. 이 예에서, 차광 장치는 불꽃 모양의 차광 장식물을 포함한다. 피부 조명 장치는 광원, 전원 및 컨트롤러 사이에 전도성 연결을 제공하는 FPC를 더 포함한다. 도 5b는 FPC를 포함하는 차광 장치의 확대도이다. 차광 장치는 광원을 포함한다. 바람직하 게는, 필수적이지는 않지만, 광원은 마이크로-LED를 포함한다. 바람직하게는, 필수적이지는 않지만, FPC는 주로 선명한 색을 갖는다. 대안적으로 또는 추가로, FPC는 일반적으로 차광 장치의 형상 을 따르는 형상을 갖는다. FPC는 전원이 광원에 작동 가능하게 연결되는 전도성 트랙을 포함한다. FPC는 피부 조명 장치 내부에 현수될 수 있다. 차광 장치는 아투명 재료 및 불투명 재료 중 하나 이상을 포함한 다. 차광 장치는 사용자의 피부로부터의 광의 직접 반사 및 광원으로부터의 직접 광 중 하나 이상을 감소시키도록 구성된다. 전원은 피부 조명 장치의 작동을 용이하게 하도록 구성되는 컨트롤러를 더 포함한다. 도 6은 사용자의 콧구멍 내부에 착용되도록 설계되는 피부 조명 장치의 도면이다. 피부 조명 장치는 광원, 형상 홀더, 배터리, 컨트롤러, 전도성 트랙 및 전도성 트랙을 포함한다. 바람 직하게는, 필수적이지는 않지만, 광원은 마이크로-LED를 포함한다. 바람직하게는, 필수적이지는 않지만, 형상 홀더는 주로 투명하고 주로 반투명 재료 중 하나 이상인 재료를 포함한다. 선택적으로, 도시된 바와 같이, 전원은 차광 장치와 매우 유사하다. 피부 조명 장치는 복수의 광원을 포함한다. 이 예에서, 광원은 마이크로-LED를 포함한다. 차광 장치는 전원이 광원에 작동 가능하게 연결되는 전도성 트랙을 더 포함한다. 도 7은 사용자의 귓불에 귀 게이지로서 착용되도록 설계된 피부 조명 장치의 도면이다. 피부 조명 장치 는 광원, 이 예에서 사용자 인터페이스 하우징과 매우 유사한 형상 홀더, 사용자 인터페이 스, 전원, 컨트롤러, FPC 및 전도성 트랙을 포함한다. 도면은 형상 홀더의 3 개의 예를 도시한다. 바람직하게는, 필수적이지는 않지만, 광원은 마이크로-LED를 포함한다. 예를 들어, 사용자 인터페이스는 버튼 및 스위치 중 하나 이상을 포함한다. 도 8a-8b는 사용자의 목에 목걸이로 착용되도록 설계된 피부 조명 장치의 2 개의 도면의 세트이다. 도 8a 는 피부 조명 장치의 후면도를 도시한다. 피부 조명 장치는 다수의 목걸이 장식물을 포함한다. 예를 들어, 목걸이 장식물은 보석을 포함한다. 목걸이 장식물은 목걸이 와이어에 의해 연결된다. 이 예에서, 피부 조명 장치는 형상 홀더와 매우 유사하다. 피부 조명 장치는 광원, 사용자 인터페이스, 전원, 컨트롤러, 마이크로 프로세서, 형상 홀더 와이어, 컨트롤러 하우 징, USB 포트, FPC 및 전도성 트랙을 포함한다. 형상 홀더 와이어는 인접한 목걸이 장식물 및 컨트롤러 하우징 중 하나 이상에 전기적으로 연결한다. 바람직하게는, 필수적이지는 않지 만, 광원은 마이크로-LED를 포함한다. 예를 들어, 컨트롤러는 버튼 및 스위치(여기서는 사용자 인터 페이스로 도시됨) 중 하나 이상을 포함한다. 도 8b는 인간 사용자의 목에 착용된 피부 조명 장치의 정면도를 도시한다. 피부 조명 장치는 형상 홀 더와 매우 유사하다. 피부 조명 장치의 더 적은 요소는 도 8b에 도시된 정면도에서 볼 수 있다. 형상 홀더 와이어, 목걸이 장식물 및 목걸이 와이어를 볼 수 있다. 예를 들어, 피부 조명 장치 및 피부를 조명하기 위한 방법에 의해 사용되는 소프트웨어는 피부 조명 장치에 의 해 액세스될 수 있는 임의의 위치에 위치될 수 있다는 것이 당업자에게 이해될 것이다. 방법 및 장치의 변형의 수는 사실상 무한대라는 것이 당업자에게 또한 이해될 것이다. 따라서, 상술한 주제는 예시적인 것으로 해석되 어야 하고, 제한적인 의미로 해석되지 않아야 한다. 상기 대표적인 실시예는 예시적인 구성으로 특정 구성요소로 설명되었지만, 다른 대표적인 실시예가 상이한 구 성 및/또는 상이한 구성요소를 사용하여 구현될 수 있음이 당업자에게 이해될 것이다. 예를 들어, 특정 단계 및 특정 구성요소의 순서는 본 발명의 기능을 실질적으로 손상시키지 않으면서 변경될 수 있음이 당업자에게 이해 될 것이다.본 명세서에서 상세하게 설명된 대표적인 실시예 및 개시된 주제는 제한이 아닌 예시의 방법으로 제시되었다. 설명된 실시예의 형태 및 세부 사항에서 다양한 변경이 이루어질 수 있으며, 그 결과 동등한 실시예가 본 발명 의 범위 내에 있게 된다는 것이 당업자에게 이해될 것이다. 따라서, 상기 설명에서의 주제는 예시적인 것으로 해석되어야 하고, 제한적인 의미로 해석되지 않아야 한다."}
{"patent_id": "10-2025-7005459", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부 도면은 다양한 대표적인 실시예를 보다 완전히 설명하는데 사용될 시각적 표현을 제공하며, 본 명세서에 개시된 대표적인 실시예 및 그들의 고유한 장점을 더 잘 이해하기 위해 당업자에 의해 사용될 수 있다. 이들 도 면에서, 동일한 참조 번호는 대응하는 요소를 식별한다. 도 1은 피부 조명 장치의 도면이다. 도 2a-2b는 음향을 방출하도록 구성된 음향 방출 장치를 포함하는 피부 조명 장치의 두 개의 도면의 세트이다. 도 3a-3b는 사용자의 귀 주위에 작용되도록 설계된 피부 조명 장치의 두 개의 도면의 세트이다. 도 4a-4c는 사용자의 목 주위에 밴드로서 착용되도록 설계되는 피부 조명 장치의 3 개의 도면의 세트이다. 도 5는 사용자의 목 주위에 밴드로서 착용되도록 설계되는 피부 조명 장치의 3 개의 도면의 세트이다. 도 6은 사용자의 콧구멍 옆에 착용되도록 설계되는 피부 조명 장치의 도면이다. 도 7은 사용자의 귓불(earlobe)에 귀 게이지(ear gauge)로서 착용되도록 설계되는 피부 조명 장치의 도면이다. 도 8a-8b는 사용자의 목에 목걸이로서 착용되도록 설계되는 피부 조명 장치의 두 개의 도면의 세트이다."}
