{"patent_id": "10-2023-7036126", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0173112", "출원번호": "10-2023-7036126", "발명의 명칭": "포워딩 디바이스 구성을 위한 시드", "출원인": "퀄컴 인코포레이티드", "발명자": "엘샤피 아메드"}}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신을 위한 송신 디바이스로서, 메모리, 및상기 메모리에 커플링된 하나 이상의 프로세서들을 포함하고,상기 하나 이상의 프로세서들은, 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를선택하고; 상기 시드의 상기 표시를 상기 포워딩 디바이스에 송신하며; 상기 포워딩 디바이스를 통해 상기 신호들을 수신 디바이스에 송신하고; 상기 신호들의 측정들을 수신하도록 구성된, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 포워딩 디바이스는 재구성 가능한 지능형 표면 (reconfigurable intelligent surface) 으로서 동작하도록구성된 수동 디바이스이고, 상기 구성은 표면 구성인, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 포워딩 디바이스는 증폭 및 포워딩 중계 노드이고, 상기 구성은 빔 구성인, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 하나 이상의 프로세서들은, 상기 측정들에 적어도 부분적으로 기초하여, 상기 구성을 조정하는 것, 상이한시드를 선택하는 것, 또는 채널 추정을 수행하는 것 중 하나 이상을 행하도록 구성되는, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 구성은 상기 포워딩 디바이스의 반사 엘리먼트들 또는 안테나 엘리먼트들에 할당된 중치들을 갖는 가중 행렬 (weighting matrix) 에 대응하는, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 시드는 상기 포워딩 디바이스를 활성화 또는 비활성화하는, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 하나 이상의 프로세서들은 상기 시드와 함께 상기 포워딩 디바이스의 식별자를 송신하도록 구성되는, 송신공개특허 10-2023-0173112-3-디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서, 상기 시드는 코드북에 사용되는 열들의 세트를 표시하는, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서, 상기 하나 이상의 프로세서들은 상기 시드에 대한 신규 구성의 표시 또는 상기 시드와 연관될 하나 이상의 빔들의 표시를 송신하도록 구성되는, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서, 상기 하나 이상의 프로세서들은, 다수의 포워딩 디바이스들에 대한 빔들을 변경하는 것, 다수의 포워딩 디바이스들을 활성화하는 것, 또는 다수의 포워딩 디바이스들을 비활성화하는 것 중 하나 이상에 대한 다수의 시드들을 규정하고; 무선 리소스 제어 메시지 또는 매체 액세스 제어 엘리먼트 (MAC-CE) 에서 상기 다수의 시드들의 표시를 송신하도록 구성되는, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서, 상기 시드는 상기 구성에 대한 QCL (quasi-co-location) 정보를 표시하는, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서, 상기 하나 이상의 프로세서들은, 상기 시드를 선택하기 위해, 사용할 시드의 표시를 다른 디바이스로부터 수신하도록 구성되는, 송신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 통신을 위한 포워딩 디바이스로서, 메모리, 및상기 메모리에 커플링된 하나 이상의 프로세서들을 포함하고,상기 하나 이상의 프로세서들은, 송신 디바이스로부터, 상기 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 상기 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하고; 상기 시드에 적어도 부분적으로 기초하여 상기 구성을 생성하고; 상기 구성에 따라 상기 신호들을 반사 또는 포워딩하도록 상기 포워딩 디바이스를 구성하도록 구성된, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서, 상기 포워딩 디바이스는 재구성 가능한 지능형 표면으로서 동작하도록 구성된 수동 디바이스이고, 상기 구성은공개특허 10-2023-0173112-4-표면 구성인, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서, 상기 포워딩 디바이스는 증폭 및 포워딩 중계 노드이고, 상기 구성은 빔 구성인, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서, 상기 하나 이상의 프로세서들은, 상기 구성을 생성하기 위해, 입력으로서 상기 시드를 사용하여 상기 구성을 의사-랜덤하게 (pseudo-randomly) 생성하도록 구성되는, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서, 상기 구성은 반사 엘리먼트마다 또는 안테나 엘리먼트마다 의사-랜덤하게 생성되는, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 13 항에 있어서, 상기 구성은 상기 포워딩 디바이스의 반사 엘리먼트들 또는 안테나 엘리먼트들에 할당된 가중치들을 갖는 가중행렬에 대응하고, 상기 하나 이상의 프로세서들은, 상기 포워딩 디바이스를 구성하기 위해, 상기 가중치들에 따라 상기 반사 엘리먼트들 또는 안테나 엘리먼트들을 구성하도록 구성되는, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 13 항에 있어서, 상기 하나 이상의 프로세서들은 상기 시드에 적어도 부분적으로 기초하여 상기 포워딩 디바이스를 활성화 또는비활성화하도록 구성되는, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 13 항에 있어서, 상기 하나 이상의 프로세서들은 식별자를 수신하도록 구성되고, 상기 하나 이상의 프로세서들은, 상기 포워딩디바이스를 구성하기 위해, 상기 식별자가 상기 포워딩 디바이스와 연관되면, 상기 포워딩 디바이스를 구성하도록 구성되는, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 13 항에 있어서, 상기 시드는 코드북을 위해 사용되는 열들의 세트를 표시하고, 상기 하나 이상의 프로세서들은, 상기 포워딩 디바이스를 구성하기 위해, 상기 열들의 세트에 적어도 부분적으로 기초하여 상기 포워딩 디바이스를 구성하도록구성되는, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 13 항에 있어서, 상기 하나 이상의 프로세서들은 상기 시드에 대한 신규 구성의 표시 또는 상기 시드와 연관될 하나 이상의 빔들의 표시를 수신하도록 구성되고, 상기 하나 이상의 프로세서들은, 상기 포워딩 디바이스를 구성하기 위해, 상기신규 구성 또는 상기 하나 이상의 빔들에 적어도 부분적으로 기초하여 상기 포워딩 디바이스를 구성하도록 구성되는, 포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "공개특허 10-2023-0173112-5-제 13 항에 있어서, 상기 시드는 QCL (quasi-co-location) 정보를 표시하고, 상기 하나 이상의 프로세서들은, 상기 포워딩 디바이스를 구성하기 위해, 상기 QCL 정보에 적어도 부분적으로 기초하여 상기 포워딩 디바이스를 구성하도록 구성되는,포워딩 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "무선 통신을 위한 수신 디바이스로서, 메모리, 및상기 메모리에 커플링된 하나 이상의 프로세서들을 포함하고,상기 하나 이상의 프로세서들은, 송신 디바이스로부터, 상기 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하고; 상기 구성에 적어도 부분적으로 기초하여 상기 포워딩 디바이스로부터 반사되거나 중계된 신호들을 수신하도록 상기 수신 디바이스를 구성하도록 구성된, 수신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서, 상기 하나 이상의 프로세서들은, 상기 구성을 생성하기 위해, 입력으로서 상기 시드를 사용하여 상기 구성을 의사-랜덤하게 생성하도록 구성되는, 수신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 24 항에 있어서, 상기 구성은 상기 포워딩 디바이스의 반사 엘리먼트들 또는 안테나 엘리먼트들에 할당된 가중치들을 갖는 가중행렬에 대응하고, 상기 하나 이상의 프로세서들은, 상기 수신 디바이스를 구성하기 위해, 상기 반사 엘리먼트들또는 안테나 엘리먼트들의 가중치들에 적어도 부분적으로 기초하여 상기 수신 디바이스의 수신 빔을 구성하도록구성되는, 수신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 24 항에 있어서, 상기 시드는 코드북을 위해 사용되는 열들의 세트를 표시하고, 상기 하나 이상의 프로세서들은, 상기 수신 디바이스를 구성하기 위해, 상기 열들의 세트에 적어도 부분적으로 기초하여, 상기 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 상기 수신 디바이스의 수신 빔을 구성하도록 구성되는, 수신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 24 항에 있어서, 상기 하나 이상의 프로세서들은 상기 시드에 대한 신규 구성의 표시 또는 상기 시드와 연관될 하나 이상의 빔들의 표시를 수신하도록 구성되고, 상기 하나 이상의 프로세서들은, 상기 수신 디바이스를 구성하기 위해, 상기신규 구성 또는 상기 하나 이상의 빔들에 적어도 부분적으로 기초하여, 상기 포워딩 디바이스로부터 반사 또는중계된 신호들을 수신하도록 상기 수신 디바이스의 수신 빔을 구성하도록 구성되는, 수신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 24 항에 있어서, 상기 시드는 QCL (quasi-co-location) 정보를 표시하고, 상기 하나 이상의 프로세서들은, 상기 수신 디바이스를구성하기 위해, 상기 QCL 정보에 적어도 부분적으로 기초하여, 상기 포워딩 디바이스로부터 반사 또는 중계된공개특허 10-2023-0173112-6-신호들을 수신하도록 상기 수신 디바이스의 수신 빔을 구성하도록 구성되는, 수신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 24 항에 있어서, 상기 포워딩 디바이스는 재구성 가능한 지능형 표면 또는 증폭 및 포워딩 중계 노드로서 동작하도록 구성된 수동 디바이스인, 수신 디바이스."}
{"patent_id": "10-2023-7036126", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 양태들은 일반적으로 무선 통신에 관한 것이다. 일부 양태들에서, 송신 디바이스는 신호들 을 반사 또는 포워딩하기 위한 구성을 생성하기 위해, 재구성 가능한 지능형 표면을 갖는 수동 디바이스와 같은 포워딩 디바이스에 의해 사용될 시드의 표시를 선택할 수도 있다. 송신 디바이스는 시드의 표시를 포워딩 디 바이스에 송신할 수도 있다. 송신 디바이스는 포워딩 디바이스를 통해 신호들을 수신 디바이스에 송신할 수 도 있다. 송신 디바이스는 신호들의 측정들을 수신할 수도 있다. 다수의 다른 양태들이 기술된다."}
{"patent_id": "10-2023-7036126", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 양태들은 일반적으로 무선 통신, 그리고 포워딩 디바이스들을 구성하기 위한 장치들에 관한 것이다."}
{"patent_id": "10-2023-7036126", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무선 통신 시스템들은, 전화, 비디오, 데이터, 메시징, 및 브로드캐스트와 같은 다양한 텔레커뮤니케이션 서비 스들을 제공하기 위해 널리 배치되어 있다. 통상적인 무선 통신 시스템들은 이용가능한 시스템 리소스들 (예를 들어, 대역폭, 송신 전력 등) 을 공유함으로써 다중의 사용자들과의 통신을 지원 가능한 다중 액세스 기 술들을 채용할 수도 있다. 그러한 다중 액세스 기술들의 예들은 코드 분할 다중 액세스 (CDMA) 시스템, 시 간 분할 다중 액세스 (TDMA) 시스템, 주파수 분할 다중 액세스 (FDMA) 시스템, 직교 주파수 분할 다중 액세스 (OFDMA) 시스템, 단일-캐리어 주파수 분할 다중 액세스 (SC-FDMA) 시스템, 시간 분할 동기식 코드 분할 다중 액 세스 (TD-SCDMA) 시스템, 및 롱텀 에볼루션 (LTE) 을 포함한다. LTE/LTE-어드밴스드는 제 3 세대 파트너쉽 프로젝트 (3GPP) 에 의해 공표된 유니버셜 모바일 원격통신 시스템 (UMTS) 모바일 표준에 대한 향상물들의 세트 이다. 무선 네트워크는, 다수의 사용자 장비 (UE들) 에 대한 통신을 지원할 수 있는 다수의 기지국들 (BS들) 을 포함 할 수도 있다. UE 는 다운링크 및 업링크를 통해 BS 와 통신할 수도 있다. \"다운링크\" 또는 \"순방향 링 크\" 는 BS 로부터 UE 로의 통신 링크를 지칭하며, \"업링크\" 또는 \"역방향 링크\" 는 UE 로부터 BS 로의 통신 링 크를 지칭한다. 본 명세서에서 더 상세히 설명될 바와 같이, BS 는 노드 B, gNB, 액세스 포인트 (AP), 무선 헤드, 송신 수신 포인트 (TRP), 뉴 라디오 (NR) BS, 5G 노드 B 등등으로서 지칭될 수도 있다. 상기 다중 액세스 기술들은, 상이한 사용자 장비로 하여금 도시의, 국가의, 지방의 및 심지어 글로벌 레벨에서 통신할 수 있게 하는 공통 프로토콜을 제공하기 위해 다양한 원격통신 표준들에서 채택되었다. 5G 로서 또 한 지칭될 수도 있는 NR 은 3GPP 에 의해 공포된 LTE 모바일 표준에 대한 향상물들의 세트이다. NR 은 빔포 밍, 다중입력 다중출력 (MIMO) 안테나 기술 및 캐리어 집성을 지원하는 것 뿐만 아니라, 다운링크 (DL) 상에서 사이클릭 프리픽스 (CP) 를 갖는 직교 주파수 분할 멀티플렉싱 (OFDM)(CP-OFDM) 을 사용하여, 업링크 (UL) 상에 서 CP-OFDM 및/또는 SC-FDM (예를 들어, 이산 푸리에 변환 확산 OFDM (DFT-s-OFDM) 로서 또한 알려짐) 을 사용 하여 다른 개방 표준들과 더 우수하게 통합하는 것, 새로운 스펙트럼을 이용하는 것, 서비스들을 개선하는 것, 비용을 낮추는 것, 스펙트럼 효율을 개선하는 것에 의해 모바일 브로드밴드 인터넷 액세스를 더 우수하게 지원 하도록 설계된다. 모바일 브로드밴드 액세스에 대한 수요가 계속 증가함에 따라, LTE, NR, 및 다른 라디오 액세스 기술들에서의 추가적인 개선들이 유용한 채로 남겨진다. 일부 양태들에서, 송신 디바이스에 의해 수행되는 무선 통신의 방법이, 상기 송신 디바이스에 의해, 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하는 단계, 및 상기 송신 디바이스에 의해, 상기 시드의 표시를 상기 포워딩 디바이스에 송신하는 단계를 포함한다. 방법은, 상기 송신 디바이스에 의해, 상기 포워딩 디바이스를 통해 상기 신호들을 수신 디바이스에 송신하는 단계, 및 상기 송신 디바이스에 의해, 상기 수신 디바이스로부터 상기 신호들의 측정들을 수신하는 단계를 포함 할 수도 있다. 일부 양태들에서, 포워딩 디바이스에 의해 수행되는 무선 통신의 방법이, 송신 디바이스로부터 상기 포워딩 디 바이스에 의해, 상기 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 상기 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하는 단계를 포함한다. 방법은, 상기 포워딩 디바 이스에 의해, 상기 시드에 적어도 부분적으로 기초하여 상기 구성을 생성하는 단계, 및 상기 포워딩 디바이스에의해, 상기 구성에 따라 상기 신호들을 반사 또는 포워딩하도록 상기 포워딩 디바이스를 구성하는 단계를 포함 할 수도 있다. 일부 양태들에서, 수신 디바이스에 의해 수행되는 무선 통신의 방법이, 송신 디바이스로부터 상기 수신 디바이 스에 의해, 상기 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워 딩 디바이스에 의해 사용될 시드의 표시를 수신하는 단계, 및 상기 수신 디바이스에 의해, 상기 구성에 적어도 부분적으로 기초하여 상기 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 상기 수신 디바이스를 구성하는 단계를 포함한다. 일부 양태들에서, 무선 통신을 위한 송신 디바이스가 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세서 들을 포함하고, 하나 이상의 프로세서들은, 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하고; 시드의 표시를 포워딩 디바이스에 송신하며; 포워딩 디바이스 를 통해 신호들을 수신 디바이스에 송신하고; 신호들의 측정들을 수신하도록 구성된다. 일부 양태들에서, 무선 통신을 위한 포워딩 디바이스가 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세 서들을 포함하고, 하나 이상의 프로세서들은, 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하고; 시드에 적어도 부분적으로 기초 하여 구성을 생성하고; 구성에 따라 신호들을 반사 또는 포워딩하도록 포워딩 디바이스를 구성하도록 구성된다. 일부 양태들에서, 무선 통신을 위한 수신 디바이스가 메모리 및 상기 메모리에 커플링된 하나 이상의 프로세서 들을 포함하고, 하나 이상의 프로세서들은, 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하고; 구성에 적어도 부분적으로 기초 하여 포워딩 디바이스로부터 반사되거나 중계된 신호들을 수신하도록 수신 디바이스를 구성하도록 구성된다. 일부 양태들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는, 송신 디바이 스의 하나 이상의 프로세서들에 의해 실행될 때, 송신 디바이스로 하여금, 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하게 하고, 시드의 표시를 포워딩 디 바이스에 송신하게 하고, 포워딩 디바이스를 통해 신호들을 수신 디바이스에 송신하게 하고, 신호들의 측정들을 수신하게 하는 하나 이상의 명령들을 포함한다. 일부 양태들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는, 포워딩 디바 이스의 하나 이상의 프로세서들에 의해 실행될 때, 포워딩 디바이스로 하여금, 송신 디바이스로부터 송신된 신 호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하 게 하고, 시드에 적어도 부분적으로 기초하여 구성을 생성하게 하고, 구성에 따라 신호들을 반사 또는 포워딩하 도록 포워딩 디바이스를 구성하게 하는 하나 이상의 명령들을 포함한다. 일부 양태들에서, 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체는, 수신 디바이 스의 하나 이상의 프로세서들에 의해 실행될 때, 수신 디바이스로 하여금, 송신 디바이스로부터 송신된 신호들 을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하게 하고, 구성에 적어도 부분적으로 기초하여 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 수신 디바이스를 구성하게 하는 하나 이상의 명령들을 포함한다. 일부 양태들에서, 무선 통신을 위한 장치는 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하기 위한 수단, 시드의 표시를 포워딩 디바이스에 송신하기 위한 수단, 포워딩 디바이스를 통해 신호들을 수신 디바이스에 송신하기 위한 수단, 및 신호들의 측정들을 수신하기 위한 수단을 포함한다. 일부 양태들에서, 무선 통신을 위한 장치는 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 장치에 의해 사용될 시드의 표시를 수신하기 위한 수단, 시드에 적어도 부분적으로 기초 하여 구성을 생성하기 위한 수단, 및 구성에 따라 신호들을 반사 또는 포워딩하도록 장치를 구성하기 위한 수단 을 포함한다. 일부 양태들에서, 무선 통신을 위한 장치는, 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하기 위한 수단, 및 구성에 적어도 부 분적으로 기초하여 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 장치를 구성하기 위한 수단을 포함한다.양태들은 일반적으로, 도면들과 명세서를 참조하여 실질적으로 설명된 바와 같은 및 도면들과 명세서에 의해 예 시된 바와 같은 방법, 장치, 시스템, 컴퓨터 프로그램 제품, 비일시적인 컴퓨터 판독가능 매체, 사용자 장비, 기지국, 무선 통신 디바이스, 및/또는 프로세싱 시스템을 포함한다. 전술한 것은, 뒤이어지는 상세한 설명이 더 잘 이해될 수도 있도록 본 개시에 따른 예들의 특징들 및 기술적 이 점들을 다소 넓게 약술하였다. 추가적인 특징들 및 이점들은 이하에 설명될 것이다. 개시된 개념 및 특 정 예들은 본 개시의 동일한 목적들을 수행하기 위해 다른 구조들을 수정 또는 설계하기 위한 기초로서 용이하 게 활용될 수도 있다. 그러한 등가의 구성들은 첨부된 청구항들의 범위에서 벗어나지 않는다. 본 명세 서에서 개시된 개념들의 특성들, 그들의 조직 및 동작 방법 양자 모두는, 연관된 이점들과 함께, 첨부 도면들과 관련하여 고려될 경우에 다음의 설명으로부터 더 잘 이해될 것이다. 도면들 각각은, 청구항들의 제한들에 대한 정의로서가 아니라, 예시 및 설명의 목적으로 제공된다. 양태들이 일부 예들에 대한 예시에 의해 본 개시에서 설명되지만, 당업자는 그러한 양태들이 많은 상이한 배열 들 및 시나리오들에서 구현될 수도 있음을 이해할 것이다. 본 명세서에서 설명된 기법들은 상이한 플랫폼 타입들, 디바이스들, 시스템들, 형상들, 사이즈들, 및/또는 패키징 배열들을 사용하여 구현될 수도 있다. 예를 들어, 일부 양태들은 집적화된 칩 실시형태들 또는 다른 비-모듈-컴포넌트 기반 디바이스들 (예컨대, 최종 사용자 디바이스들, 차량들, 통신 디바이스들, 컴퓨팅 디바이스들, 산업용 장비, 소매/구매 디바이스들, 의료용 디바이스들, 또는 인공 지능 인에이블드 디바이스들) 을 통해 구현될 수도 있다. 양태들은 칩 수준 컴포넌 트, 모듈형 컴포넌트, 비모듈형 컴포넌트, 비칩 수준 컴포넌트, 디바이스 수준 컴포넌트 또는 시스템 수준 컴포 넌트에서 구현될 수도 있다. 설명된 양태들 및 특징들을 포함하는 디바이스들은 또한, 청구되고 설명된 양 태들의 구현 및 실시를 위한 추가적인 컴포넌트들 및 특징들을 포함할 수도 있다. 예를 들어, 무선 신호들 의 송신 및 수신은 아날로그 및 디지털 목적들을 위한 다수의 컴포넌트들 (예를 들어, 안테나들, 무선 주파수 (RF) 체인들, 전력 증폭기들, 변조기들, 버퍼들, 프로세서 (들), 인터리버들, 가산기들, 또는 합산기들을 포함 하는 하드웨어 컴포넌트들) 을 포함할 수도 있다. 본 명세서에 설명된 양태들은 다양한 사이즈, 형상, 및 구성의, 다양한 디바이스들, 컴포넌트들, 시스템들, 분산 배열들, 또는 엔드-사용자 디바이스들에서 실시될 수 도 있음이 의도된다."}
{"patent_id": "10-2023-7036126", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 첨부 도면을 참조하여 본 개시의 여러 양태를 보다 충분히 설명한다. 하지만, 본 개시는 많은 상 이한 형태들로 실시될 수도 있고 본 개시 전체에 걸쳐 제시된 임의의 특정 구조 또는 기능에 제한되는 것으로 해석되지 않아야 한다. 오히려, 이들 양태들은 본 개시가 철저하고 완전하게 되고, 그리고 본 개시의 범위 를 당업자에게 충분히 전달하도록 제공된다. 본 명세서에서의 교시들에 기초하여, 당업자는 본 개시의 범위 가 본 명세서에 개시된 본 개시의 임의의 양태를, 본 개시의 임의의 다른 양태와 독립적으로 구현되든 또는 조 합되든 간에, 커버하도록 의도된다는 것을 인식해야 한다. 예를 들어, 본 명세서에 제시된 임의의 수의 양 태들을 사용하여 장치가 구현될 수도 있거나 방법이 실시될 수도 있다. 추가로, 본 개시의 범위는 본 명세 서에서 제시된 본 개시의 다양한 양태들에 추가로 또는 그들 외로 다른 구조, 기능성, 또는 구조 및 기능성을 사용하여 실시되는 그러한 장치 또는 방법을 커버하도록 의도된다. 본 명세서에 개시된 본 개시의 임의의 양태는 청구항의 하나 이상의 엘리먼트들에 의해 구현될 수도 있음을 이해해야 한다. 원격통신 시스템들의 여러 양태들이 이제 다양한 장치들 및 기법들을 참조하여 제시될 것이다. 이들 장치들 및 기법들은 다양한 블록들, 모듈들, 컴포넌트들, 회로들, 단계들, 프로세스들, 알고리즘들 등 (\"엘리먼트들\" 로서 총칭됨) 에 의해 다음의 상세한 설명에서 설명되고 첨부 도면들에서 예시될 것이다. 이들 엘리먼트들 은 하드웨어, 소프트웨어, 또는 그 조합들을 이용하여 구현될 수도 있다. 그러한 엘리먼트들이 하드웨어로 구현되는지 또는 소프트웨어로 구현되는지는 전체 시스템에 부과된 설계 제약들 및 특정 애플리케이션에 의존한 다. 본 명세서에서 양태들은 5G 또는 NR 무선 액세스 기술 (RAT) 과 공통으로 연관된 전문용어를 사용하여 설명될 수도 있지만, 본 개시의 양태들은 3G RAT, 4G RAT, 및/또는 5G 에 후속하는 RAT (예를 들어, 6G) 와 같은, 다른 RAT들에 적용될 수 있음을 유의해야 한다. 도 1 은 본 개시에 따른, 무선 네트워크 의 일 예를 예시한 다이어그램이다. 무선 네트워크 는, 다른 예들 중에서, 5G (NR) 네트워크 및/또는 LTE 네트워크의 엘리먼트들일 수도 있거나 또는 이들을 포함 할 수도 있다. 무선 네트워크 는 (BS (110a), BS (110b), BS (110c), 및 BS (110d) 로서 도시된) 다 수의 기지국들 및 다른 네트워크 엔티티들을 포함할 수도 있다. 기지국 (BS) 은 사용자 장비 (UE들) 와 통신하는 엔티티이고, 또한, NR BS, 노드 B, gNB, 5G 노드 B (NB), 액세스 포인트, 송신 수신 포인트 (TRP) 등으로서 지칭될 수도 있다. 각각의 BS 는 특정 지리적 영역에 대한 통신 커버리지를 제공할 수도 있다. 3GPP 에서, 용어 \"셀\" 은, 그 용어가 사용되는 맥락에 의존하여, BS 의 커버리지 영역 및/또는 이 커버리지 영역을 서빙하는 BS 서브시스템을 지칭할 수 있다. BS 는 매크로 셀, 피코 셀, 펨토 셀, 및/또는 다른 타입의 셀을 위한 통신 커버리지를 제공할 수도 있다. 매크로 셀은 상대적으로 큰 지리적 영역 (예를 들어, 반경이 수 킬로미터임) 을 커버할 수도 있고, 서비스 가입 을 갖는 UE들에 의한 제한없는 액세스를 허용할 수도 있다. 피코 셀은 상대적으로 작은 지리적 영역을 커버 할 수도 있고, 서비스 가입을 가진 UE들에 의한 제한없는 액세스를 허용할 수도 있다. 펨토 셀은, 상대적으 로 작은 지리적 영역 (예를 들어, 홈) 을 커버할 수도 있고, 펨토 셀과 연관을 갖는 UE들 (예를 들어, 폐쇄 가 입자 그룹 (CSG) 에 있는 UE들) 에 의한 제한된 액세스를 허용할 수도 있다. 매크로 셀을 위한 BS 는 매크 로 BS 로서 지칭될 수도 있다. 피코 셀을 위한 BS 는 피코 BS 로서 지칭될 수도 있다. 펨토 셀을 위한 BS 는 펨토 BS 또는 홈 BS 로서 지칭될 수도 있다. 도 1 에 도시된 예에서, BS (110a) 는 매크로 셀 (102a) 을 위한 매크로 BS 일 수도 있고, BS (110b) 는 피코 셀 (102b) 을 위한 피코 BS 일 수도 있으며, BS (110c) 는 펨토 셀 (102c) 을 위한 펨토 BS 일 수도 있다. BS 는 하나 또는 다수의 (예를 들어, 3 개) 의 셀들을 지원할 수도 있다. 용어들 \"eNB\", \"기지국\", \"NR BS\", \"gNB\", \"TRP\", \"AP\", \"노드 B\", \"5G NB\", 및 \"셀\" 은 본 명세서에서 상호교환가능하게 사용될 수도 있다. 일부 양태들에서, 셀은 반드시 정지식일 필요는 없을 수도 있으며, 셀의 지리적 영역은 모바일 BS 의 위치에 따 라 이동할 수도 있다. 일부 양태들에서, BS들은 임의의 적절한 전송 네트워크를 사용하여 직접 물리적 접속, 또는 가상 네트워크와 같은 여러 다양한 유형들의 백홀 인터페이스들을 통해 무선 네트워크 에서 서로에 대해 및/또는 하나 이상의 다른 BS 또는 네트워크 노드 (미도시) 에 상호접속될 수도 있다. 무선 네트워크 는 또한 중계국을 포함할 수도 있다. 중계국은 업스트림 국 (예를 들어, BS 또는 UE) 로부터 데이터의 송신을 수신하고 다운스트림 국 (예를 들어, UE 또는 BS) 으로 그 데이터의 송신을 전송할 수 있는 엔티티이다. 중계국은 또한 다른 UE들을 위한 송신을 중계할 수 있는 UE 일 수도 있다. 도 1 에 도시된 예에서, 중계 BS (110d) 는 BS (110a) 와 UE (120d) 사이의 통신을 용이하게 하기 위해 매크로 BS (110a) 및 UE (120d) 와 통신할 수도 있다. 중계 BS 는 또한, 중계국, 중계 기지국, 중계기 등으로서 지칭 될 수도 있다. 무선 네트워크 는, 매크로 BS들, 피코 BS들, 펨토 BS들, 중계기 BS들 등등과 같이 상이한 타입들의 BS들 을 포함하는 이종의 네트워크일 수도 있다. 이들 상이한 타입의 BS들은 무선 네트워크 에서 상이한 송신 전력 레벨들, 상이한 커버리지 영역들, 및 간섭에 대한 상이한 영향들을 가질 수도 있다. 예를 들어, 매크로 BS들은 높은 송신 전력 레벨 (예를 들어, 5 내지 40 와트) 을 가질 수도 있는 반면, 피코 BS들, 펨토 BS 들, 및 릴레이 BS들은 더 낮은 송신 전력 레벨 (예를 들어, 0.1 내지 2 와트) 를 가질 수도 있다. 네트워크 제어기 는 BS들의 세트에 커플링할 수도 있고 이들 BS들에 대한 조정 및 제어를 제공할 수도 있 다. 네트워크 제어기 는 백홀 (backhaul) 을 통해 BS들과 통신할 수도 있다. BS들은 또한, 예를 들어, 무선 또는 유선 백홀을 통해 간접적으로 또는 직접적으로 서로 통신할 수도 있다. UE들 (예를 들어, 120a, 120b, 120c) 은 무선 네트워크 전체에 걸쳐 산재될 수도 있으며, 각각의 UE 는 정지식 또는 이동식일 수도 있다. UE 는 또한, 액세스 단말기, 단말기, 이동국, 가입자 유닛, 스테이 션 등등으로서 지칭될 수도 있다. UE 는 셀룰러 폰 (예를 들어, 스마트 폰), 개인용 디지털 보조기 (PDA), 무선 모뎀, 무선 통신 디바이스, 핸드헬드 디바이스, 랩탑 컴퓨터, 코드리스 폰, 무선 로컬 루프 (WLL) 스테이 션, 태블릿, 카메라, 게이밍 디바이스, 넷북, 스마트북, 울트라북, 의료용 디바이스 또는 장비, 생체인식 센서 들/디바이스들, 웨어러블 디바이스들 (스마트 시계들, 스마트 의류, 스마트 안경, 스마트 손목 밴드들, 스마트 보석 (예를 들어, 스마트 반지, 스마트 팔찌)), 엔터테인먼트 디바이스 (예를 들어, 뮤직 또는 비디오 디바이스, 또는 위성 무선기기), 차량용 컴포넌트 또는 센서, 스마트 미터들/센서들, 산업용 제조 장비, 글로벌 포지셔닝 시스템 디바이스, 또는 무선 또는 유선 매체를 통해 통신하도록 구성된 임의의 다른 적합한 디바이스 일 수도 있다. 일부 UE들은 머신 타입 통신 (MTC), 또는 진화된 또는 강화된 머신 타입 통신 (eMTC) UE들로 고려될 수도 있다. MTC 및 eMTC UE들은, 예를 들어, 기지국, 다른 디바이스 (예컨대, 원격 디바이스), 또는 일부 다른 엔티티와 통신할 수도 있는 로봇들, 드론들, 원격 디바이스들, 센서들, 미터들, 모니터들, 및/또는 위치 태그들을 포함한 다. 무선 노드는, 예를 들어, 유선 또는 무선 통신 링크를 통해 네트워크 (예를 들어, 인터넷과 같은 광역 네트워크 또는 셀룰러 네트워크) 에 대한 또는 네트워크로의 연결을 제공할 수도 있다. 일부 UE들은 사물 인터넷 (IoT) 디바이스들로 고려될 수도 있고/있거나 NB-IoT (협대역 사물 인터넷) 디바이스들로서 구현될 수도 있다. 일부 UE들은 CPE (Customer Premises Equipment) 로 간주될 수도 있다. UE 는, 프로세서 컴포넌트들 및/또는 메모리 컴포넌트들과 같은 UE 의 컴포넌트들을 수용하는 하우징 내부에 포함될 수도 있다. 일부 양태들에 있어서, 프로세서 컴포넌트들 및 메모리 컴포넌트들은 함께 커플링될 수도 있다. 예를 들어, 프로세서 컴포넌트들 (예를 들어, 하나 이상의 프로세서들) 및 메모리 컴포넌트들 (예를 들어, 메모 리) 은 동작적으로 커플링, 통신적으로 커플링, 전자적으로 커플링 및/또는 전기적으로 커플링될 수도 있다. 일반적으로, 임의의 수의 무선 네트워크들이 주어진 지리적 영역에서 전개될 수도 있다. 각각의 무선 네트 워크는 특정 RAT 를 지원할 수도 있고, 하나 이상의 주파수 상에서 동작할 수도 있다. RAT 는 또한, 무선 기술, 에어 인터페이스 등등으로서 지칭될 수도 있다. 주파수는 또한, 캐리어, 주파수 채널 등등으로서 지 칭될 수도 있다. 각각의 주파수는 상이한 RAT들의 무선 네트워크들 사이의 간섭을 회피하기 위해 주어진 지 리적 영역에서 단일 RAT 를 지원할 수도 있다. 일부 경우들에서, NR 또는 5G RAT 네트워크들이 전개될 수도 있다. 일부 양태들에서, (예컨대, UE (120a) 및 UE (120e) 로서 도시된) 2 이상의 UE들 은 (예컨대, 서로 통신 하기 위한 중개자로서 기지국 을 사용하지 않고) 하나 이상의 사이드링크 채널들을 사용하여 직접 통신할 수도 있다. 예를 들어, UE들 은 피어-투-피어 (P2P) 통신, 디바이스-투-디바이스 (D2D) 통신, 차량 대 만물 (V2X) 프로토콜 (예컨대, 차량 대 차량 (V2V) 프로토콜 또는 차량 대 인프라구조 (V2I) 프로토콜을 포 함할 수도 있음), 및/또는 메쉬 네트워크를 사용하여 통신할 수도 있다. 이 경우, UE 는, 기지국 에 의해 수행되는 것으로서 본 명세서의 다른 곳에서 기술된 스케줄링 동작들, 리소스 선택 동작들, 및/ 또는 다른 동작들을 수행할 수도 있다. 무선 네트워크 의 디바이스들은, 주파수 또는 파장에 기초하여 다양한 클래스들, 대역들, 채널들 등으로 세분될 수도 있는 전자기 스펙트럼을 사용하여 통신할 수도 있다. 예를 들어, 무선 네트워크 의 디바 이스들은 410 MHz 내지 7.125 GHz 에 걸쳐 있을 수도 있는 제 1 주파수 범위 (FR1) 를 갖는 동작 대역을 사용하 여 통신할 수도 있고/있거나, 24.25 GHz 내지 52.6 GHz 에 걸쳐 있을 수도 있는 제 2 주파수 범위 (FR2) 를 갖 는 동작 대역을 사용하여 통신할 수도 있다. FR1 과 FR2 사이의 주파수들은 때때로, 중간-대역 (mid-band) 주파수들로서 지칭된다. FR1 의 일부가 6 GHz 보다 크지만, FR1 은 종종 \"서브 (sub) -6 GHz\" 대역으로서 지칭된다. 유사하게, FR2 는 \"밀리미터파\" 대역으로서 국제 원격통신 연합 (ITU) 에 의해 식별되는 극고 주 파수 (extremely high frequency; EHF) 대역 (30 GHz - 300 GHz) 과는 상이함에도 불구하고 \"밀리미터파\" 대역 으로서 종종 지칭된다. 따라서, 달리 구체적으로 서술되지 않으면, 용어 \"서브-6 GHz\" 등은, 본 명세서에서 사용되는 경우, 6 GHz 미만의 주파수들, FR1 내의 주파수들, 및/또는 중간-대역 주파수들 (예컨대, 7.125 GHz 초과) 을 광범위하게 나타낼 수도 있음이 이해되어야 한다. 유사하게, 달리 구체적으로 서술되지 않으면, 용어 \"밀리미터파\" 등은, 본 명세서에서 사용되는 경우, EHF 대역 내의 주파수들, FR2 내의 주파수들, 및/또는 중간-대역 주파수들 (예컨대, 24.25 GHz 미만) 을 광범위하게 나타낼 수도 있음이 이해되어야 한다. FR1 및 FR2 에 포함된 주파수들은 수정될 수도 있고, 본 명세서에서 설명된 기법들은 이들 수정된 주파수 범위들에 적 용가능함이 고려된다. 예 는 수신 디바이스 (예를 들어, UE (120e), 기지국 ) 와 직접 또는 포워딩 디바이스 (예를 들어, 재구성 가능한 지능형 표면 (RIS)) 를 통해 신호들을 반사함으로써 통신할 수도 있는 송신 디바이스 (예를 들어, UE (120a), 기지국 ) 를 도시한다. 일부 예들에서, UE (120a) 는 통신 관리기 를 포함할 수도 있다. 본 명세서의 다른 곳에서 더 상세히 설명되는 바와 같이, 통신 관리기 는 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하고, 시드의 표시를 포워딩 디바이스에 송신하고, 신호들을 포워딩 디바이스를 통해 UE (120e) 에 송신하고, 신호들의 측정 들을 수신할 수도 있다. 일부 양태들에서, 기지국 은, 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하고, 시드의 표시를 포워딩 디바이스에 송신 하고, 신호들을 포워딩 디바이스를 통해 UE (120e) 에 송신하고, 신호들의 측정들을 수신할 수 있는 통신 관리 기 를 포함할 수도 있다. 부가적으로 또는 대안적으로, 통신 관리기 또는 통신 관리기 는 본 명세서에서 설명된 하나 이상의 다른 동작들을 수행할 수도 있다. 일부 예들에서, 포워딩 디바이스는 통신 관리기 를 포함할 수도 있다. 본 명세서의 다른 곳에서 더 상세히 설명되는 바와 같이, 통신 관리기 는 UE (120a) 로부터 송신된 신호들을 반사 또는 포워딩하기 위 한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하고, 시드에 적어도 부분적으로 기초하여 구성을 생성하고, 구성에 따라 신호들을 반사 또는 포워딩하도록 포워딩 디바이스를 구성할 수도 있다. 부가적으로 또는 대안적으로, 통신 관리기 는 본 명세서에서 설명된 하나 이상의 다른 동작들 을 수행할 수도 있다. 일부 예들에서, UE (120e) 는 통신 관리기 를 포함할 수도 있다. 본 명세서의 다른 곳에서 더 상세히 설명된 바와 같이, 통신 관리기 는 UE (120a) 로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하고, 그 구성에 적어도 부분적으로 기초하여 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 UE (120e) 를 구성할 수도 있다. 일부 양태 들에서, 기지국 의 통신 관리기 는 UE (120e) 로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하고, 그 구성에 적어도 부분적으로 기초하여 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 기지국 을 구성할 수도 있다. 부가적으로 또는 대안적으로, 통신 관리기 또는 통신 관리기 는 본 명세서에서 설명된 하나 이상 의 다른 동작들을 수행할 수도 있다. 위에 나타낸 바와 같이, 도 1 은 일 예로서 제공된다. 다른 예들은 도 1 에 관하여 설명된 것과 상이할 수 도 있다. 도 2 는 본 개시에 따른, 무선 네트워크 에서 UE 와 통신하는 기지국 의 일 예 를 예 시하는 다이어그램이다. 기지국 은 T 개의 안테나들 (234a 내지 234t) 을 구비할 수도 있고, UE 는 R 개의 안테나들 (252a 내지 252r) 을 구비할 수도 있으며, 여기서, 일반적으로 T ≥ 1 및 R ≥ 1 이 다. 기지국 에서, 송신 프로세서 는 하나 이상의 UE들에 대한 데이터를 데이터 소스 로부터 수신 하고, UE 로부터 수신된 채널 품질 표시자들 (CQI들) 에 적어도 부분적으로 기초하여 각각의 UE 에 대한 하나이상의 변조 및 코딩 방식들 (MCS) 을 선택하고, UE 에 대해 선택된 MCS (들) 에 적어도 부분적으로 기초하여 각각의 UE 에 대한 데이터를 프로세싱 (예를 들어, 인코딩 및 변조) 하고, 모든 UE들에 대해 데이터 심볼들을 제공할 수도 있다. 송신 프로세서 는 또한, (예컨대, 준정적 리소스 파티셔닝 정보 (SRPI) 에 대한) 시스템 정보 및 제어 정보 (예컨대, CQI 요청들, 허여 (grant) 들, 및/또는 상위 계층 시그널링) 를 프로세싱하 고 오버헤드 심볼들 및 제어 심볼들을 제공할 수도 있다. 송신 프로세서 는 또한, 레퍼런스 신호들 (예컨대, 셀 특정 레퍼런스 신호 (CRS) 또는 복조 레퍼런스 신호 (DMRS)) 및 동기화 신호들 (예컨대, 프라이머 리 동기화 신호 (PSS) 또는 세컨더리 동기화 신호 (SSS)) 에 대한 레퍼런스 심볼들을 생성할 수도 있다. 송 신 (TX) 다중 입력 다중 출력 (MIMO) 프로세서 는 적용가능한 경우, 데이터 심볼들, 제어 심볼들, 오버헤 드 심볼들, 및/또는 레퍼런스 심볼들에 대해 공간 프로세싱 (예를 들어, 프리코딩) 을 수행할 수도 있고, T 개 의 출력 심볼 스트림들을 T 개의 변조기들 (MOD들)(232a 내지 232t) 에 제공할 수도 있다. 각각의 변조기 는 (예컨대, OFDM 에 대해) 개별 출력 심볼 스트림을 프로세싱하여 출력 샘플 스트림을 획득할 수도 있다. 각각의 변조기 는 출력 샘플 스트림을 추가로 프로세싱 (예를 들어, 아날로그로 변환, 증폭, 필터링, 및 상향변환) 하여 다운링크 신호를 획득할 수도 있다. 변조기들 (232a 내지 232t) 로부터의 T 개 의 다운링크 신호들은 각각 T 개의 안테나들 (234a 내지 234t) 을 통해 송신될 수도 있다. UE 에서, 안테나들 (252a 내지 252r) 은 기지국 및/또는 다른 기지국들로부터 다운링크 신호들을 수신할 수도 있고, 수신된 신호들을 복조기들 (DEMOD들)(254a 내지 254r) 에 각각 제공할 수도 있다. 각각 의 복조기 는 수신된 신호를 컨디셔닝 (예를 들어, 필터링, 증폭, 하향변환, 및 디지털화) 하여 입력 샘 플들을 획득할 수도 있다. 각각의 복조기 은 (예컨대, OFDM 에 대해) 입력 샘플들을 더 프로세싱하여 수신된 심볼들을 획득할 수도 있다. MIMO 검출기 는 모든 복조기들 (254a 내지 254r) 로부터 수신된 심볼들을 획득하고, 적용가능한 경우 수신된 심볼들에 대해 MIMO 검출을 수행하며, 검출된 심볼들을 제공할 수 도 있다. 수신 프로세서 는 검출된 심볼들을 프로세싱 (예를 들어, 복조 및 디코딩) 하고, UE 를 위한 디코딩된 데이터를 데이터 싱크 에 제공하고, 디코딩된 제어 정보 및 시스템 정보를 제어기/프로 세서 에 제공할 수도 있다. 용어 \"제어기/프로세서\"는 하나 이상의 제어기들, 하나 이상의 프로세서 들, 또는 이들의 조합을 지칭할 수도 있다. 채널 프로세서는 다른 예들 중에서도 레퍼런스 신호 수신 전력 (RSRP) 파라미터, 수신 신호 강도 표시자 (RSSI) 파라미터, 레퍼런스 신호 수신 품질 (RSRQ) 파라미터, 및/또는 CQI 파라미터를 결정할 수도 있다. 일부 양태들에 있어서, UE 의 하나 이상의 컴포넌트들이 하우징 에 포함될 수도 있다. 네트워크 제어기 는 통신 유닛 , 제어기/프로세서 , 및 메모리 를 포함할 수도 있다. 네트워크 제어기 는 예를 들어, 코어 네트워크에서의 하나 이상의 디바이스들을 포함할 수도 있다. 네트워크 제어기 는 통신 유닛 을 통해 기지국 과 통신할 수도 있다. 안테나들 (예컨대, 안테나들 (234a 내지 234t) 및/또는 안테나들 (252a 내지 252r)) 은, 다른 예들 중에서도, 하나 이상의 안테나 패널들, 안테나 그룹들, 안테나 엘리먼트들의 세트들, 및/또는 안테나 어레이들을 포함할 수도 있거나, 이들 내에 포함될 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트, 및/또는 안테나 어레이는 하나 이상의 안테나 엘리먼트를 포함할 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘 리먼트들의 세트, 및/또는 안테나 어레이는 동일 평면 안테나 엘리먼트들의 세트 및/또는 비-동일 평면 안테나 엘리먼트들의 세트를 포함할 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트, 및/또는 안 테나 어레이는 단일의 하우징 내의 안테나 엘리먼트들 및/또는 다중의 하우징들 내의 안테나 엘리먼트들을 포함 할 수도 있다. 안테나 패널, 안테나 그룹, 안테나 엘리먼트들의 세트, 및/또는 안테나 어레이는 도 2 의 하 나 이상의 컴포넌트들과 같은 하나 이상의 송신 및/또는 수신 컴포넌트들에 커플링된 하나 이상의 안테나 엘리 먼트들을 포함할 수도 있다. 업링크 상에서, UE 에서, 송신 프로세서 는 데이터 소스 로부터 데이터를, 그리고 제어기/프 로세서 로부터 (예컨대, RSRP, RSSI, RSRQ, 및/또는 CQI 를 포함하는 리포트들에 대한) 제어 정보를 수신 및 프로세싱할 수도 있다. 송신 프로세서 는 또한 하나 이상의 레퍼런스 신호에 대한 레퍼런스 심볼 들을 생성할 수도 있다. 송신 프로세서 로부터의 심볼들은, 적용가능하다면, TX MIMO 프로세서 에 의해 프리코딩되고, (예컨대, DFT-s-OFDM 또는 CP-OFDM 에 대해) 변조기들 (254a 내지 254r) 에 의해 더 프 로세싱되고, 기지국 으로 송신될 수도 있다. 일부 양태들에서, UE 의 변조기 및 복조기 (예컨 대, MOD/DEMOD ) 는 UE 의 모뎀에 포함될 수도 있다. 일부 양태들에 있어서, UE 는 트랜 시버를 포함한다. 트랜시버는 안테나 (들), 변조기들 및/또는 복조기들 , MIMO 검출기 , 수 신 프로세서 , 송신 프로세서 , 및/또는 TX MIMO 프로세서 의 임의의 조합을 포함할 수도있다. 트랜시버는, (예를 들어, 도 1 내지 도 13 을 참조하여 설명된 바와 같이) 본 명세서에서 설명된 방 법들 중 임의의 방법의 양태들을 수행하기 위해 프로세서 (예컨대, 제어기/프로세서 ) 및 메모리 에 의해 사용될 수도 있다. 기지국 에서, UE 및 다른 UE들로부터의 업링크 신호들은 안테나들 에 의해 수신되고, 복조기 들 에 의해 프로세싱되고, 적용가능하다면, MIMO 검출기 에 의해 검출되고, 수신 프로세서 에 의해 더 프로세싱되어, UE 에 의해 전송된 디코딩된 데이터 및 제어 정보를 획득할 수도 있다. 수 신 프로세서 는 디코딩된 데이터를 데이터 싱크 에 제공하고, 그리고 디코딩된 제어 정보를 제어기 /프로세서 에 제공할 수도 있다. 기지국 은 통신 유닛 을 포함하고 통신 유닛 을 통해 네트워크 제어기 와 통신할 수도 있다. 기지국 은 다운링크 및/또는 업링크 통신들을 위 해 UE들 을 스케줄링하기 위한 스케줄러 를 포함할 수도 있다. 일부 양태들에서, 기지국 의 변조기 및 복조기 (예컨대, MOD/DEMOD ) 는 기지국 의 모뎀에 포함될 수도 있다. 일부 양태 들에 있어서, 기지국 은 트랜시버를 포함한다. 트랜시버는 안테나 (들), 변조기들 및/또는 복조 기들 , MIMO 검출기 , 수신 프로세서 , 송신 프로세서 , 및/또는 TX MIMO 프로세서 의 임의의 조합을 포함할 수도 있다. 트랜시버는, (예를 들어, 도 1 내지 도 13 을 참조하여 설명된 바와 같이) 본 명세서에서 설명된 방법들 중 임의의 방법의 양태들을 수행하기 위해 프로세서 (예컨대, 제어기/프로 세서 ) 및 메모리 에 의해 사용될 수도 있다. 기지국 의 제어기/프로세서 , UE 의 제어기/프로세서 , 및/또는 도 2 의 임의의 다른 컴 포넌트 (들) 는 본 명세서의 다른 곳에서 더 상세히 설명된 바와 같이 포워딩 디바이스를 구성하는 것과 연관된 하나 이상의 기법들을 수행할 수도 있다. 예를 들어, 기지국 의 제어기/프로세서 , UE 의 제어기/프로세서 , 포워딩 디바이스의 제어기/프로세서, 및/또는 도 2 의 임의의 다른 컴포넌트 (들) 는, 예를 들어, 도 8 의 프로세스 , 도 9 의 프로세스 , 도 10 의 프로세스 , 및/또는 본 명세서에 서 설명된 바와 같은 다른 프로세스들의 동작들을 수행하거나 지시할 수도 있다. 메모리들 (242 및 282) 은 기지국 및 UE 에 대한 데이터 및 프로그램 코드들을 각각 저장할 수도 있다. 일부 양태들에서, 메모리 및/또는 메모리 는 무선 통신을 위한 하나 이상의 명령들 (예컨대, 코드 및/또는 프로그램 코드) 을 저장하는 비일시적 컴퓨터 판독가능 매체를 포함할 수도 있다. 예를 들어, 하나 이상의 명령들은, 기지국 , 포워딩 디바이스, 및/또는 UE 의 하나 이상의 프로세서들에 의해 (예를 들어, 직접적으로, 또는 컴파일, 변환, 및/또는 해석 후에) 실행될 경우, 하나 이상의 프로세서들, UE , 포워딩 디바이스, 및 /또는 기지국 으로 하여금, 예를 들어, 도 8 의 프로세스 , 도 9 의 프로세스 , 도 10 의 프로 세스 및/또는 본 명세서에서 설명된 바와 같은 다른 프로세스들의 동작들을 수행하거나 지시하게 할 수 도 있다. 일부 양태들에 있어서, 명령들을 실행하는 것은, 다른 예들 중에서도, 명령들을 구동하는 것, 명 령들을 변환하는 것, 명령들을 컴파일하는 것, 및/또는 명령들을 해석하는 것을 포함할 수도 있다. 일부 양태들에서, 송신 디바이스 (예를 들어, UE , 기지국 ) 는 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하기 위한 수단, 시드의 표시를 포워 딩 디바이스에 송신하기 위한 수단, 신호들을 포워딩 디바이스를 통해 수신 디바이스에 송신하기 위한 수단, 및 /또는 수신 디바이스로부터, 신호들의 측정들을 수신하기 위한 수단을 포함한다. 일부 양태들에서, 송신 디 바이스가 본 명세서에 설명된 동작들을 수행하기 위한 수단은, 예를 들어, 통신 관리기 , 송신 프로세서 , TX MIMO 프로세서 , 변조기 , 안테나 , 복조기 , MIMO 검출기 , 수신 프로세 서 , 제어기/프로세서 , 메모리 , 스케줄러 , 통신 관리기 , 송신 프로세서 , TX MIMO 프로세서 , 변조기 , 안테나 , 복조기 , MIMO 검출기 , 수신 프로세서 , 제어기/프로세서 , 메모리 또는 스케줄러 중 하나 이상을 포함할 수도 있다. 일부 양태들에서, 포워딩 디바이스 (예를 들어, RIS ) 는 송신 디바이스로부터, 송신 디바이스로부터 송신 된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하기 위한 수단, 시드에 적어도 부분적으로 기초하여 구성을 생성하기 위한 수단, 및/또는 구성에 따라 신 호들을 반사 또는 포워딩하도록 포워딩 디바이스를 구성하기 위한 수단을 포함한다. 일부 양태들에서, 포워 딩 디바이스가 본 명세서에 설명된 동작들을 수행하기 위한 수단은, 예를 들어, 통신 관리기 , 송신 프로 세서 , TX MIMO 프로세서 , 변조기 , 안테나 , 복조기 , MIMO 검출기 , 수신 프로세서 , 제어기/프로세서 , 메모리 또는 스케줄러 중 하나 이상을 포함할 수도 있다. 일부 양태들에서, 수신 디바이스 (예를 들어, UE ) 는 송신 디바이스로부터, 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하기 위한 수단, 및/또는 구성에 적어도 부분적으로 기초하여 포워딩 디바이스로부터 반사 또는 중계된 신호들 을 수신하도록 수신 디바이스를 구성하기 위한 수단을 포함한다. 일부 양태들에서, 수신 디바이스가 본 명 세서에 설명된 동작들을 수행하기 위한 수단은, 예를 들어, 통신 관리기 , 송신 프로세서 , TX MIMO 프로세서 , 변조기 , 안테나 , 복조기 , MIMO 검출기 , 수신 프로세서 , 제어 기/프로세서 , 메모리 , 스케줄러 , 통신 관리기 , 송신 프로세서 , TX MIMO 프로세 서 , 변조기 , 안테나 , 복조기 , MIMO 검출기 , 수신 프로세서 , 제어기/프로 세서 , 메모리 또는 스케줄러 중 하나 이상을 포함할 수도 있다. 도 2 에서의 블록들이 별개의 컴포넌트들로서 예시되지만, 블록들에 관하여 상기 설명된 기능들은 단일의 하드 웨어, 소프트웨어, 또는 조합 컴포넌트에서 또는 컴포넌트들의 다양한 조합들에서 구현될 수도 있다. 예를 들어, 송신 프로세서 , 수신 프로세서 , 및/또는 TX MIMO 프로세서 에 관하여 설명된 기능들은 제어기/프로세서 의 제어에 의해 또는 그 제어 하에 수행될 수도 있다. 위에 나타낸 바와 같이, 도 2 는 일 예로서 제공된다. 다른 예들은 도 2 에 관하여 설명된 것과는 상이할 수도 있다. 도 3 은 본 개시에 따른, 수동 디바이스의 사용의 일 예 를 예시하는 다이어그램이다. 예 는 UE (예를 들어, UE ) 와 통신할 수도 있는 기지국 (BS)(예를 들어, BS ), 및 UE (예 를 들어, UE ) 와 통신할 수도 있는 BS (예를 들어, BS ) 를 도시한다. 네트워크는 처리량을 증가시키기 위해 송신기 또는 수신기에서 함께 그룹화되는 안테나들을 가질 수도 있다. 안테나들의 그룹화는 \"매시브 MIMO\"로 지칭될 수도 있다. 매시브 MIMO 는 높은 빔포밍 이득을 달성하기 위해 능동 안테나 유닛들 (AAU들) 을 사용할 수도 있다. AAU는 안테나, 라디오, 타워-장착 증폭기, 피더, 및/또는 점퍼 기능들을 단일 유닛으로 결합할 수도 있다. AAU는 각각의 안테나 포트에 대한 개별 무선 주파 수 (RF) 체인을 포함할 수도 있다. 매시브 MIMO에 배리어들이 있을 수도 있다. 신호들의 송신은 빌딩, 자연 지형, 또는 다른 차단 구조물들에 의해 차단될 수도 있다. 예를 들어, BS 는 UE 에 신호들을 송신할 수도 있지만, BS 는 UE 에 신호들을 송신하지 못할 수도 있다. 예 에 도시된 바와 같이, BS 와 UE 사 이에 어떤 타입의 차단이 존재한다. UE 는 대신에 BS 에 의해 서빙될 수도 있다. 차단으로 인한 송신 문제들을 해결하기 위해, 네트워크는 RIS로서 구성된 수동 디바이스 를 사용할 수도 있다. RIS는 그 속성들이 정적이기보다는 재구성 가능한 (reconfigurable) 엔지니어링된 재료의 2차원 표면 일 수도 있다. 엔지니어링된 재료는 표면 또는 표면의 일부의 임피던스를 변경함으로써 무선 매체의 제어를 가능하게 하는 집적 전자 회로들 및 소프트웨어를 포함할 수도 있다. 임피던스의 변화는 위상 시프트 및/또 는 반사각을 변경할 수도 있다. 산란, 흡수, 반사, 및 회절 특성은 시간에 따라 변화되고 소프트웨어에 의 해 제어될 수도 있다. RIS는 반사 렌즈로서 작용할 수도 있다. 일 예에서, RIS는 파장의 절반만큼 이격 된 저렴한 안테나들의 큰 어레이들을 포함할 수도 있다. 다른 예에서, RIS는, 엘리먼트들 (예를 들어, 정사 각형 엘리먼트들) 이 파장보다 작은 크기들 및 거리간 (inter-distance) 들을 갖는 메타물질 기반 평면 또는 등 각 (conformal) 큰 표면들을 포함할 수도 있다. 엘리먼트들 각각은 구성된 임피던스, 또는 엘리먼트로의 전 압에 의해 제어되는 다른 표면 특성들을 가질 수도 있다. RIS는 또한 \"소프트웨어-제어 메타표면\" 또는 \"지 능형 반사 표면\"으로 지칭될 수도 있다. 수동 디바이스 는, RIS로서 동작하도록 구성될 때, 그 자신의 안테나들 또는 RF 체인들을 갖지 않을 수도 있지만, BS 로부터 송신된 입사 신호들을 수동적으로 반사하기 위해 표면 상에 다수의 작은 저비용 엘리 먼트들을 포함할 수도 있다. 수동 디바이스 의 제어기는 표면의 엘리먼트들을 제어할 수도 있다. 수동 디바이스 는 신호들에 대해 특정 반사 각도를 사용하도록 구성된 스마트 디바이스일 수도 있다. BS 는 수동 디바이스 의 엘리먼트들 각각에 대한 전압을 제어함으로써 엘리먼트들의 반사 각도"}
{"patent_id": "10-2023-7036126", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(도래각, 출발각), 진폭, 무게, 위상 및/또는 폭을 제어할 수도 있다. 요약하면, 수동 디바이스 는 AAU들보다 적은 전력 소비로 전파 환경을 제어하는 것을 도울 수도 있다. 수동 디바이스들은 심지어 전파 환경에서 AAU들을 대체할 수도 있다. 수동 디바이스들을 사용하는 MIMO는 \"수동 MIMO\" 또는 \"P-MIMO\"로 지 칭될 수도 있다. 수동 디바이스 는 또한 \"수동 노드\" 또는 \"P-MIMO 디바이스\"로 지칭될 수도 있다. 일부 양태들에서, BS 는 수동 디바이스 를 트레이닝하기 위해 UE 와의 트레이닝 레퍼런스 시 퀀스들을 사용할 수도 있다. UE 는 수동 디바이스 를 통해 신호들을 수신하고 빔들의 측정들에적어도 부분적으로 기초하여 선호되는 빔을 선택 및 보고할 수도 있다. 예를 들어, UE 는 가장 높은 스펙트럼 효율 신호 대 간섭 플러스 잡음비 (SINR) 를 갖는 빔을 보고할 수도 있다. BS 는 다수의 레 퍼런스 신호 어케이전들에서 레퍼런스 신호들을 송신할 수도 있다. 수동 디바이스는 각각의 레퍼런스 신호 어케이전에 대해 상이한 비-코드북 프리코더를 사용할 수도 있다. 대안적으로 또는 추가적으로, UE 는 수동 디바이스 를 통해 BS 에 신호들을 송신할 수도 있고, BS 는 신호들에 대한 측정들을 수행할 수도 있다. UE 및 BS 는, 수동 디바이스 를 트레이닝할 때, 수동 디바이스 로부터의 명확한 시그 널링이 없는 한, 어떤 빔들이 사용되는지에 관한 정보를 갖지 않을 수도 있다. 예를 들어, 트레이닝 신호들 이 코드북-기반이거나 알려진 엘리먼트들의 행렬을 사용한다면, UE 및 BS 가 빔들 및 연관된 인덱 스들을 식별하기 위해 전체 코드북 (및 다수의 엘리먼트 인덱스들) 이 시그널링되어야 할 수도 있다. 또한, 빔들에 대한 결정론적 (비-랜덤) 탐색은, 모든 빔 방향들이 코드북에 의해 커버될 수도 있기 때문에 비효율적일 수도 있고, 따라서 탐색은 빔 방향들의 전체 리스트를 통해 진행할 수도 있다. 빔 검색은 채널 획득이 완료 되지 않고 빔들이 수동 디바이스 에서 정렬되지 않으면 특히 비효율적일 수도 있다. 즉, 수동 디바이 스 의 트레이닝 및 초기 구성이 비효율적일 수도 있고, 수동 디바이스 를 사용하는 일부 초기 통신 이 저하될 수도 있다. 저하된 통신들은 UE 및 BS 로 하여금 재송신들로 추가적인 프로세싱 리 소스들 및 시그널링 리소스들을 소비하게 할 수도 있다. 본 명세서에 설명된 다양한 양태들에 따르면, BS , UE , 또는 다른 송신 디바이스는 수동 디바이스 에 대한 구성을 의사-랜덤하게 생성하는 데 사용될 수도 있는 시드를 생성할 수도 있다. 시드는 더 많은 양의 정보를 생성하기 위해 사용되는 정보를 포함할 수도 있다. 시드는 코드, 인덱스, 하나 이상의 비 트들, 식별자, 또는 해시 또는 의사 랜덤 생성기에 대한 입력으로서 사용될 수도 있는 다른 정보를 포함할 수도 있다. 구성의 의사 랜덤 생성은 입력으로서 시드에 적어도 부분적으로 기초하여 빔 및/또는 행렬 속성들의 특정 구성을 생성하는 것을 포함할 수도 있으며, 여기서 구성은 랜덤 속성들을 갖지만, 입력과 동일한 시드를 사용하는 임의의 노드에 의해 재현될 수도 있다. 구성은 포워딩 디바이스에 대한 식별자 (ID) 및 시드의 함 수인 해시일 수도 있다. 예를 들어, 제 1 시퀀스를 갖는 시드는 의사-랜덤 생성기를 통해, 그들의 선택에서 랜덤한 빔 또는 엘리먼트 인덱스들의 제 1 리스트를 출력할 수도 있다. 제 2 의 상이한 시퀀스를 갖는 시드 는 그들의 선택에서 랜덤하고 상이한 빔 또는 엘리먼트 인덱스들의 제 2 리스트를 출력할 수도 있다. 그러 나, 제 1 시드가 다시 입력으로서 사용되면, 빔 또는 엘리먼트 인덱스들의 동일한 제 1 리스트가 다시 생성될 것이다. 송신기는 시드와 연관된 출력을 인식할 수도 있고, 원하는 구성에 따라 시드를 선택할 수도 있다. 시드를 갖는 임의의 노드는 구성 (예를 들어, 가중 행렬, 프리코딩 행렬) 을 결정하고 빔포밍을 최적화할 수 도 있다. 시드는 가중 엘리먼트 행렬 인덱스들 및/또는 빔들의 전체 리스트보다 페이로드 크기가 더 작을 수도 있다. 그 결과, 송신 디바이스, 수동 디바이스 , 및/또는 임의의 수신 디바이스는 더 적은 시그널링 리소스들을 사용하여 구성을 결정할 수도 있다. 송신 디바이스, 수동 디바이스 , 및/또는 임의의 수신 디바이스는 또한 더 빠른 빔 선택을 갖는 프로세싱 리소스들을 보존할 수도 있는데, 이는 트레이닝 또는 빔 선택이 모든 가 능한 빔들 또는 엘리먼트 구성들을 통해 시간 소모적인 토글링을 기다릴 필요가 없기 때문이다. 일부 양태들에서, 시드는 수동 디바이스 또는 다수의 다른 포워딩 디바이스들을 활성화 또는 비활성화하 기 위해 사용될 수도 있다. 다수의 포워딩 디바이스들이 활성인 경우, 빔 최적화는 결합 최적화를 포함할 수도 있다. 예를 들어, 수동 디바이스 는 다른 포워딩 디바이스가 사용하는 인덱스 또는 프리코딩 행 렬에 대한 정보에 적어도 부분적으로 기초하여 빔 (프리코딩 행렬) 을 정렬할 수도 있다. 일부 양태들에서, 시드는 QCL (quasi-co-location) 정보를 표시하기 위해 사용될 수도 있어서, 송신 디바이스 및 수신 디바이스는 시드가 사용되지 않은 경우보다 더 적은 시그널링으로 QCL 표시 패턴에 합의할 수도 있다. 위에 나타낸 바와 같이, 도 3 은 일 예로서 제공된다. 다른 예들은 도 3 에 관하여 설명된 것과 상이할 수 도 있다. 도 4 는 본 개시에 따른, 사이드링크 통신들의 일 예 를 예시한 다이어그램이다. 도 4 에 도시된 바와 같이, 제 1 UE 와 같은 송신 디바이스는 하나 이상의 사이드링크 채널들 을 통해 제 2 UE (및 하나 이상의 다른 UE들) 와 같은 수신 디바이스와 통신할 수도 있다. UE 및 UE 는 P2P 통신, D2D 통신, (예를 들어, V2V 통신, V2I 통신, 및/또는 차량-대-보행자 (V2P) 통신을 포 함할 수도 있는) V2X 통신 및/또는 메쉬 네트워킹을 위한 하나 이상의 사이드링크 채널들 을 사용하여 통신할 수도 있다. 일부 양태들에서, UE 및 UE 는 UE 와 같은 본 명세서의 다른 곳에 기 재된 하나 이상의 다른 UE들에 대응할 수도 있다. 일부 양태들에서, 하나 이상의 사이드링크 채널들 은 PC5 인터페이스를 사용할 수도 있고/있거나 고주파 대역 (예를 들어, 5.9 GHz 대역) 에서 동작할 수 있다. 추가적으로 또는 대안적으로, UE 및 UE 는 GNSS (global navigation satellite system) 타이밍 을 사용하여 송신 시간 간격들 (TTI들)(예를 들어, 프레임들, 서브프레임들, 슬롯들, 또는 심볼들) 의 타이밍을 동기화할 수도 있다. 도 4 에 추가로 도시된 바와 같이, 하나 이상의 사이드링크 채널들 은 물리 사이드링크 제어 채널 (PSCCH) , 물리 사이드링크 공유 채널 (PSSCH) 및/또는 물리 사이드링크 피드백 채널 (PSFCH) 을 포함할 수도 있다. PSCCH 는 액세스 링크 또는 액세스 채널을 통하여 기지국 과의 셀 룰러 통신들에 사용되는 물리 다운링크 제어 채널 (PDCCH) 및/또는 물리 업링크 제어 채널 (PUCCH) 과 유사하게 제어 정보를 통신하는 데 사용될 수도 있다. PSSCH 는 액세스 링크 또는 액세스 채널을 통하여 기지 국 과의 셀룰러 통신들에 사용되는 물리 다운링크 공유 채널 (PDSCH) 및/또는 물리 업링크 공유 채널 (PUSCH) 과 유사하게 데이터를 통신하는 데 사용될 수도 있다. 예를 들어, PSCCH 는 사이드링크 통신 들에 사용되는 다양한 제어 정보, 예컨대 하나 이상의 리소스들 (예를 들어, 시간 리소스들, 주파수 리소스들, 및/또는 공간 리소스들) 을 나타낼 수도 있는 사이드링크 제어 정보 (SCI) 를 반송할 수도 있고, 여기서 전송 블록 (TB) 은 PSSCH 상에서 반송될 수도 있다. TB 는 데이터를 포함할 수도 있다. PSFCH 는 사이드링크 피드백 , 이를 테면, 하이브리드 자동 반복 요청 (HARQ) 피드백 (예를 들어, 확인응답 또는 부정적 확인응답 (ACK/NACK) 정보), 송신 전력 제어 (TPC), 및/또는 스케줄링 요청 (SR) 을 통신하는 데 사용될 수도 있다. 일부 양태들에서, 하나 이상의 사이드링크 채널들 은 리소스 풀들을 사용할 수도 있다. 예를 들어, (예를 들어, SCI 에 포함됨) 스케줄링 할당은 시간에 걸쳐 특정 리소스 블록 (RB) 들을 사용하여 서브-채 널들에서 송신될 수 있다. 일부 양태들에서, 스케줄링 할당과 연관된 (예를 들어, PSSCH 상에서의) 데이터 송신들은 (예를 들어, 주파수 분할 멀티플렉싱을 사용하여) 스케줄링 할당과 동일한 서브프레임에서 인 접한 RB들을 점유할 수도 있다. 일부 양태들에서, 스케줄링 할당 및 연관된 데이터 송신들은 인접한 RB들 상에서 송신되지 않는다. 일부 양태들에서, UE 는 (예를 들어, 기지국 보다는) UE 에 의해 리소스 선택 및/또는 스케 줄링이 수행되는 송신 모드를 사용하여 동작할 수도 있다. 일부 양태들에서, UE 는 송신들을 위한 채 널 이용 가능성을 감지함으로써 리소스 선택 및/또는 스케줄링을 수행할 수 있다. 예를 들어, UE 는 다양한 사이드링크 채널들과 연관된 RSSI 파라미터 (예를 들어, 사이드링크-RSSI (S-RSSI) 파라미터) 를 측정할 수도 있거나, 다양한 사이드링크 채널들과 연관된 RSRP 파라미터 (예를 들어, PSSCH-RSRP 파라미터) 를 측정할 수도 있거나, 및/또는 다양한 사이드링크 채널들과 연관된 RSRQ 파라미터 (예를 들어, PSSCH-RSRQ 파라미터) 를 측정할 수 있고, 측정(들)에 적어도 부분적으로 기초하여 사이드링크 통신의 송신을 위한 채널을 선택할 수도 있다. 추가적으로 또는 대안적으로, UE 는 점유된 리소스들 및/또는 채널 파라미터들을 나타낼 수 있는 PSCCH 에서 수신된 SCI 를 사용하여 리소스 선택 및/또는 스케줄링을 수행할 수 있다. 추가적으로 또 는 대안적으로, UE 는 다양한 사이드링크 채널들과 연관된 채널 사용률 (CBR) 을 결정함으로써 리소스 선 택 및/또는 스케줄링을 수행할 수 있으며, 이는 (예를 들어, UE 는 특정 서브프레임 세트에 사용할 수 있 는 리소스 블록들의 최대 수를 나타냄으로써) 레이트 제어에 사용될 수 있다. 리소스 선택 및/또는 스케줄링이 UE 에 의해 수행되는 송신 모드에서, UE 는 사이드링크 그랜트를 생성할 수도 있고 SCI 에서 그랜트를 송신할 수도 있다. 사이드링크 승인은, 예를 들어, 다가오는 사 이드링크 송신에 사용될 하나 이상의 파라미터(예를 들어, 송신 파라미터), 이를테면 (예를 들어, TB를 위 한) PSSCH 상의 다가오는 사이드링크 송신에 사용될 하나 이상의 리소스 블록, 다가오는 사이드링크 송신 에 사용될 하나 이상의 서브프레임, 및/또는 다가오는 사이드링크 송신에 사용될 변조 및 코딩 스킴 (MCS) 을 표시할 수도 있다. 일부 양태들에서, UE 는 사이드링크 송신의 주기성과 같은, 반영구적 스케줄링 (SPS) 에 대한 하나 이상의 파라미터들을 나타내는 사이드링크 승인을 생성할 수도 있다. 추가적으로 또는 대안적으로, UE 는 이벤트-구동 스케줄링을 위한, 이를테면 온디맨드(on-demand) 사이드링크 메시지를 위 한 사이드링크 승인을 생성할 수도 있다. 일부 양태들에서, UE 는 RIS로서 동작하도록 구성되는 수동 디바이스 또는 AF 중계 노드와 같은 포워딩 디바이스를 통해 UE 에 통신들을 송신할 수도 있다. UE 는 포워딩 디바이스를 구성할 수도 있고, 또한, 포워딩 디바이스에 대한 구성을 생성하는 데 사용될수도 있는 시드를 송신함으로써, 포워딩 디바이스를 사용하도록 UE 를 구성할 수도 있다. 위에 나타낸 바와 같이, 도 4 는 일 예로서 제공된다. 다른 예들은 도 4 와 관련하여 설명된 것과는 상이할 수도 있다. 도 5 는 본 개시에 따른 사이드링크 통신 및 액세스 링크 통신의 일 예 를 예시한 다이어그램이다. 도 5 에 도시된 바와 같이, UE 및 UE 는 도 4 와 관련하여 전술한 바와 같이 사이드링크를 통해 서 로 통신할 수도 있다. 추가로 도시된 바와 같이, 일부 사이드링크 모드들에서, BS 는 제 1 액세스 링 크를 통해 UE 와 통신할 수도 있다. 일부 사이드링크 모드들에서, 기지국 은 통신 리소스들을 스케줄링하는 것을 돕는다. 다른 사이드링크 모드들에서, UE 는 기지국 보다는 UE 에 대 한 통신 리소스들을 스케줄링한다. UE 및 UE 는 도 1 의 UE 와 같은, 본 명세서의 다른 곳에 기술된 하나 이상의 UE들에 대응할 수도 있다. 따라서, (예를 들어, PC5 인터페이스를 통한) UE들 사이의 직접 링크는 사이드링크로 지칭될 수도 있고, (예를 들어, Uu 인터페이스를 통한) 기지국과 UE 사이의 직접 링크는 액세스 링크로 지칭될 수도 있다. 사이드링크 통신은 사이드링크를 통해 송신될 수도 있고, 액세스 링크 통신은 액세스 링크를 통해 송신될 수도 있다. 액세스 링크 통신은 (기지국 으로부터 UE 로의) 다운링크 통신 또는 (UE 로부터 기지국 으로의) 업링크 통신일 수도 있다. 일부 양태들에서, BS 는 시드를 UE 에 제공할 수도 있다. 위에 나타낸 바와 같이, 도 5 는 일 예로서 제공된다. 다른 예들은 도 5 와 관련하여 설명되었던 것과는 상 이할 수도 있다. 도 6 은 본 개시에 따른, 시드로 포워딩 디바이스를 구성하는 것의 일 예 를 예시하는 다이어그램이다. 도 6 에 도시된 바와 같이, UE 는 하나 이상의 사이드링크 채널들을 통해 UE 와 통신할 수도 있 다. UE 는 포워딩 디바이스를 통해 UE 에 신호들을 송신할 수도 있다. 포워딩 디바이스는 예 에 도시된 수동 디바이스 와 같이 RIS로서 구성된 수동 디바이스일 수도 있거나, 또는 포워딩 디바이스는 다수의 구성가능한 안테나들을 사용하여 신호들을 증폭 및 포워딩하는 AF 중계 노드일 수도 있다. UE 및 UE 는 무선 네트워크 (예컨대, 무선 네트워크 ) 에 의해 서빙될 수도 있다. 참조 번호 605 에 의해 도시된 바와 같이, UE 는 포워딩 디바이스에 대한 구성에 대응하는 시드를 생성 또는 선택할 수도 있다. 예를 들어, 구성은 수동 디바이스 의 엘리먼트들에 대한 가중치들의 세트 또 는 AF 중계 노드에 대한 안테나 가중치들의 세트를 포함할 수도 있다. 참조 번호 610 에 의해 도시된 바와 같이, UE 는 UE 와 같은 수신 디바이스에 시드를 송신할 수도 있다. 이는 시드 인덱스와 같은 시드의 표시를 송신하는 것을 포함할 수도 있다. 참조 번호 610 에 의해 도시된 바와 같이, 수동 디바이스 는 수동 디바이스 의 열들의 세트로부터 의 수직 엘리먼트들의 열 M 및 수동 디바이스 의 행들의 세트로부터의 수평 엘리먼트들의 행 N 을 나타내 는 구성을 생성하기 위해 의사-랜덤 생성기에 대한 입력으로서 시드를 사용할 수도 있다. 엘리먼트들은 RIS 빔포밍 코드북에 대응할 수도 있으며, 여기서 코드북의 크기는 M x N x L 이고, L 은 가능한 빔들의 양이다. 포워딩 디바이스의 각각의 반사 엘리먼트 또는 안테나 엘리먼트는 가중 행렬에 따라 가중치가 할당될 수도 있 다. RIS 코드북이 사용되지 않는 경우, 수동 디바이스 의 제어기는 크기 M x N 의 위상 또는 빔 행렬 을 생성할 수도 있다. 의사-랜덤 생성기에 대한 입력으로서, 제어기는 수동 디바이스 의 엘리먼트 인 덱스를 사용하여 수동 디바이스 의 엘리먼트 가중치들 또는 다른 입력들을 구별할 수도 있다. 가중치 들의 의사-랜덤 생성은 포워딩 디바이스마다, 수동 디바이스의 엘리먼트마다, 또는 AF 중계 노드의 안테나마다 이루어질 수도 있다. 참조 번호 615 에 의해 도시된 바와 같이, UE 는 시드 (또는 시드의 표시) 를 UE 에 송신할 수도 있다. 시드는 또한 다른 포워딩 디바이스들 및 수신 디바이스들에 송신될 수도 있다. 참조 번호 620 에 의해 도시된 바와 같이, 수신 디바이스로서 UE 는 수동 디바이스 에 의해 사용되는 구성을 생성하 기 위해 시드를 사용할 수도 있다. UE 는 빔포밍을 위해 및/또는 수동 디바이스 로부터 반사된 신호들을 측정하기 위해 수동 디바이스 에 대한 구성에서 엘리먼트 가중치들을 사용할 수도 있다. 시 드는 또한 수동 디바이스 가 어느 수신 어케이전들에 대해 활성인지를 UE 에 통지할 수도 있다. 참조 번호 625 에 의해 도시된 바와 같이, UE 는 수동 디바이스 에 의한 반사를 통해 UE 에 신호들 (예를 들어, 레퍼런스 신호들) 을 송신할 수도 있다. 신호들은 수동 디바이스 를 트레이닝하 기 위해 사용될 수도 있다. UE 는 신호들을 측정할 수도 있다. UE 는 측정들을 구성에 의해 표시된 빔 또는 엘리먼트 행렬과 연관시키는 트레이닝 리포트를 생성할 수도 있다. 참조 부호 630 에 의 해 도시된 바와 같이, UE 는 UE 에 트레이닝 리포트를 송신할 수도 있다. UE 는 채널 추정을 위해, 채널 레이트들을 계산하기 위해, 또는 다른 메트릭들을 결정하기 위해 트레이닝 리포트를 사용할 수도 있다. UE 는 리포트를 기지국에 송신할 수도 있고, 기지국은 채널 추정을 위해, 채널 레이트들 을 계산하기 위해, 또는 다른 메트릭들을 결정하기 위해 트레이닝 리포트를 사용할 수도 있다. 사이드링크 모드 1에 대해, 기지국은 트레이닝 리포트에 적어도 부분적으로 기초하여 사이드링크 리소스들 및 수동 디바이 스 의 사용을 스케줄링할 수도 있다. UE 또는 기지국은 트레이닝 리포트에 적어도 부분적으로 기초하여 수동 디바이스 에 대한 신규 구 성 (예를 들어, 신규 매트릭스, 신규 빔 리스트) 을 생성할 수도 있다. 신규 구성은 수동 디바이스 에 대한 구성의 일부일 수도 있는 빔들을 정제하기 위해 빔 리스트를 하향 선택하는 것을 포함할 수도 있다. 참조 번호 635 에 의해 도시된 바와 같이, UE 또는 기지국은 신규 구성에 대한 신규 시드를 생성할 수 도 있다. 신규 시드를 생성하는 것은 복수의 시드들 중에서 신규 (상이한) 시드를 선택하는 것을 포함할 수 도 있다. 수동 디바이스 의 트레이닝을 계속하거나 완료하기 위해, UE 는 참조 번호 640 에 의해 도시된 바 와 같이, 수동 디바이스 에 신규 시드를 송신할 수도 있다. 수동 디바이스 는 신규 구성을 생 성하기 위해 입력으로서 신규 시드를 사용할 수도 있다. 수동 디바이스 는 신규 구성에 따라 표면을 재구성할 수도 있다. 트레이닝을 계속하거나 신규 트레이닝을 시작하기 위해 마지막 출력의 인덱스가 시프 트될 수도 있다. 송신 디바이스가 BS 와 같은 기지국이면, 하나 이상의 시드들이 다운링크 제어 정보 (DCI) 에 표시될 수도 있다. 대안적으로 또는 추가적으로, UE 는 수동 디바이스 를 통해 UE 또는 BS 에 신호들을 송신할 수도 있다. 즉, UE 는 송신 디바이스일 수도 있고, UE 또는 BS 는 수신 디바이스일 수도 있다. 위에 나타낸 바와 같이, 도 6 은 일 예로서 제공된다. 다른 예들은 도 6 에 관하여 설명된 것과 상이할 수 도 있다. 도 7 은 본 개시에 따른, 본 개시에 따른, 다수의 포워딩 디바이스들을 사용한 트레이닝의 일 예 를 예시 하는 다이어그램이다. 예 는 BS , UE , 및 수동 디바이스 를 도시한다. 예 는 또한 수동 디바이스 및 AF 중계 노드 와 같은 다른 포워딩 디바이스들을 도시한다. 일부 양태들에서, 송신 디바이스 (예를 들어, BS , UE ) 는 다수의 포워딩 디바이스들을 트레이닝하 기 위해 동일한 시드를 사용할 수도 있다. 예를 들어, 송신 디바이스는 시드들 h1 내지 h4 (모두 동일한 시 드) 를 수동 디바이스 , UE , 수동 디바이스 , 및 AF 중계 노드 에 송신할 수도 있다. 이 디바이스들 각각은 구성을 사용하는 다른 포워딩 디바이스들 및 시드로부터 생성된 구성에 적어도 부분적 으로 기초하여 반사 또는 빔포밍할 수도 있다. 포워딩 디바이스들의 트레이닝은 트레이닝 버스트 세트들의 시퀀스를 송신하는 것을 포함할 수도 있다. 각 각의 트레이닝 버스트 세트는 레퍼런스 신호를 수신하기 위한 다수의 어케이전들을 포함할 수도 있고, 포워딩 디바이스들 중 하나 이상은 각각의 어케이전에 대해 활성화 또는 비활성화될 수도 있다. 송신 디바이스는 포워딩 디바이스들을 활성화 또는 비활성화하기 위해 시드를 사용할 수도 있고, 시드는 포워딩 디바이스 ID와 함께 송신될 수도 있다. 예를 들어, 버스트 세트 0을 트레이닝하기 위한 시드는 제 1 어케이전 동안 수동 디바이스 를 활성화하고 다른 어케이전 동안 수동 디바이스 를 비활성화할 수도 있다. 하나 초 과의 포워딩 디바이스가 트레이닝 버스트에 대해 활성화될 수도 있다. 예를 들어, 트레이닝 버스트 세트 1 에 대해 송신된 시드들은 제 1 어케이전에 대해 수동 디바이스 및 수동 디바이스 둘 다를 활성화할 수도 있다. 활성화들은 랜덤 속성들에 따라 선택될 수도 있다. 활성화 및 비활성화를 위해 시드들을 사 용하는 것은 시그널링 리소스들을 보존하면서 트레이닝 및 채널 추정을 도울 수도 있는데, 그 이유는 포워딩 디 바이스들을 활성화 또는 비활성화하기 위해 추가적인 시그널링이 필요하지 않기 때문이다. 일부 양태들에서, 송신 디바이스 (예를 들어, BS , UE ) 는 무선 리소스 제어 (RRC) 메시지에서 또는 매체 액세스 제어 엘리먼트 (MAC-CE) 에서 송신될 수도 있는 다수의 시드들 (예를 들어, h1 내지 h4) 을 규정할 수도 있다. 다수의 시드들은 빔들을 변경하거나, 다수의 포워딩 디바이스들을 활성화하거나, 또는 다수의 포워딩 디바이스들을 비활성화하기 위해 사용될 수도 있다. 송신 디바이스는 각각의 포워딩 디바이스 또는 포워딩 디바이스들의 그룹에 동일한 시드 (동일한 거동 또는 코드북/프리코딩 인덱스들) 또는 상이한 시드들(상이한 거동들 또는 코드북/프리코딩 인덱스들) 을 제공할 수도 있다. 다수의 시드들의 선택은 다수의 포 워딩 디바이스들에 대해 조정될 수도 있다. 각각의 PDSCH 통신 (즉, 다운링크 데이터 패킷) 은 DMRS를 포함할 수 있고, 기지국은 UE가 2차 통계들 (예를 들 어, 도플러 시프트, 지연 확산) 을 결정하기 위해 레퍼런스 신호들과 DMRS 사이의 연관을 UE에 표시할 필요가 있을 수도 있다. 연관은 QCL 을 포함할 수도 있다. UE는 UE의 안테나 포트들에 대한 수신 빔 또는 송신 빔을 결정하기 위해 QCL 표시를 따를 수도 있다. 일 안테나 포트 상의 심볼이 전달되는 채널의 큰 스케일 특성들이 다른 안테나 포트 상의 심볼이 전달되는 채널로부터 추론될 수 있다면, 2개의 안테나 포트들은 QCL될 수도 있다. NR에서 규정되는 QCL의 네 가지 타입이 있다: QCL-TypeA {도플러 시프트, 도플러 확산, 평균 지 연, 지연 확산}, QCL-TypeB {도플러 시프트, 도플러 확산}, QCL-TypeC {도플러 시프트, 평균 지연}, 및 QCL- TypeD {공간 Rx 파라미터}. 일부 양태들에서, BS 는, 사이드링크 모드 1에서, UE 가 수신 빔 및/또는 송신 빔을 결정하는 것을 돕기 위해 시드를 사용하여 송신 디바이스 (예를 들어, UE ) 에 QCL 표시를 시그널링할 수도 있다. 예 를 들어, 공간 QCL을 동적으로 표시하는 대신에, BS 는 UE 가 미리 규정된 패턴에 적어도 부분적으 로 기초하여 자신의 QCL 가정을 어떻게 업데이트해야 하는지를 표시하기 위해 하나 이상의 시드들을 사용할 수 도 있다. 패턴은 사이드링크 채널을 추적하기 위해 사용될 수도 있다. 시드는 공간적 관계, TCI (transmission control indicator) 상태 또는 공간적 QCL을 표시할 수도 있다. 시드는 QCL 변경을 표시하 기 위해 필요한 만큼만 클 수도 있다. 일부 양태들에서, UE 는 각각의 포워딩 디바이스에 적용된 프 리코딩 행렬을 결정할 수 없을 수도 있지만, UE 는 수신 빔 또는 송신 빔을 결정하기에 충분한 정보를 가질 수 도 있다. 빔 또는 행렬 구성을 위한 의사-랜덤 생성기에 대한 입력으로서 시드를 사용함으로써, 송신 디바이스는 포워딩 디바이스들을 트레이닝하기 위해 더 적은 오버헤드를 사용할 수도 있다. 도 8 은 본 개시에 따라, 예를 들어, 송신 디바이스에 의해 수행된 예시적인 프로세스 를 예시하는 다이 어그램이다. 예시적인 프로세스 는 송신 디바이스 (예를 들어, BS , UE , UE ) 가 포워딩 디바이스를 구성하는 것과 연관된 동작들을 수행하는 예이다. 도 8 에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하는 것을 포함할 수도 있다 (블록 810). 예를 들어, (예를 들어, 컴포넌트 관리기 또는 도 11 에 도시된 시드 컴포넌트 를 사용하여) 송 신 디바이스는, 전술된 바와 같이, 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스 에 의해 사용될 시드의 표시를 선택할 수도 있다. 도 8 에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 시드의 표시를 포워딩 디바이스에 송신 하는 것을 포함할 수도 있다 (블록 820). 예를 들어, (예를 들어, 컴포넌트 관리기 또는 도 11 에 도 시된 송신 컴포넌트 를 사용하여) 송신 디바이스는, 전술한 바와 같이, 시드의 표시를 포워딩 디바이스 에 송신할 수도 있다. 도 8 에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 포워딩 디바이스를 통해 신호들을 수신 디바이스에 송신하는 것을 포함할 수도 있다 (블록 830). 예를 들어, (예를 들어, 컴포넌트 관리기 또는 도 11 에 도시된 송신 컴포넌트 를 사용하여) 송신 디바이스는 전술한 바와 같이, 포워딩 디바이스 를 통해 수신 디바이스에 신호들을 송신할 수도 있다. 도 8 에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 신호들의 측정들을 수신하는 것을 포함 할 수도 있다 (블록 840). 예를 들어, (예를 들어, 컴포넌트 관리기 또는 도 11 에 도시된 수신 컴포 넌트 를 사용하여) 송신 디바이스는 전술된 바와 같이 신호들의 측정들을 수신할 수도 있다. 프로세스 는 본 명세서의 다른 곳에 설명된 하나 이상의 다른 프로세스와 관련하여 및/또는 하기에서 설 명된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가적인 양태들을 포함할 수도 있다. 제 1 양태에서, 포워딩 디바이스는 RIS로서 동작하도록 구성된 수동 디바이스이고, 구성은 표면 구성이다. 제 2 양태에서, 단독으로 또는 제 1 양태와 조합으로, 포워딩 디바이스는 AF 중계 노드이고, 구성은 빔 구성이 다. 제 3 양태에서, 단독으로 또는 제 1 및 제 2 양태들 중 하나 이상과 조합으로, 프로세스 는 측정들에 적 어도 부분적으로 기초하여, 구성을 조정하는 것, 상이한 시드를 선택하는 것, 또는 채널 추정을 수행하는 것 중 하나 이상을 포함한다. 제 4 양태에서, 단독으로 또는 제 1 내지 제 3 양태들 중 하나 이상과 조합으로, 구성은 포워딩 디바이스의 반 사 엘리먼트들 또는 안테나 엘리먼트들에 할당된 가중치들을 갖는 가중 행렬에 대응한다. 제 5 양태에서, 단독으로 또는 제 1 내지 제 4 양태들 중 하나 이상과 조합으로, 시드는 포워딩 디바이스를 활 성화 또는 비활성화한다. 제 6 양태에서, 단독으로 또는 제 1 내지 제 5 양태들 중 하나 이상과 조합으로, 프로세스 는 시드와 함 께 포워딩 디바이스의 식별자를 송신하는 것을 포함한다. 제 7 양태에서, 단독으로 또는 제 1 내지 제 6 양태들 중 하나 이상과 조합으로, 시드는 코드북을 위해 사용된 열들의 세트를 표시한다. 제 8 양태에서, 단독으로 또는 제 1 내지 제 7 양태들 중 하나 이상과 조합으로, 프로세스 는 시드에 대 한 신규 구성의 표시 또는 시드와 연관될 하나 이상의 빔들의 표시를 송신하는 것을 포함한다. 제 9 양태에서, 단독으로 또는 제 1 내지 제 8 양태들 중 하나 이상과 조합으로, 프로세스 는, 송신 디바 이스에 의해, 다수의 포워딩 디바이스들에 대한 빔들을 변경하는 것, 다수의 포워딩 디바이스들을 활성화하는 것, 또는 다수의 포워딩 디바이스들을 비활성화하는 것 중 하나 이상에 대한 다수의 시드들을 규정하는 것, 및 송신 디바이스에 의해, RRC 메시지 또는 MAC-CE에서 다수의 시드들의 표시를 송신하는 것을 포함한다. 제 10 양태에서, 단독으로 또는 제 1 내지 제 9 양태들 중 하나 이상과 조합으로, 시드는 구성을 위한 QCL 정보 를 표시한다. 제 11 양태에서, 단독으로 또는 제 1 내지 제 10 양태들 중 하나 이상과 조합으로, 시드를 선택하는 것은 다른 디바이스로부터, 사용할 시드의 표시를 수신하는 것을 포함한다. 도 8 은 프로세스 의 예시적인 블록들을 도시하지만, 일부 양태들에서, 프로세스 는 도 8 에 도시 된 것들보다 추가적인 블록들, 더 적은 블록들, 상이한 블록들, 또는 상이하게 배열된 블록들을 포함할 수도 있 다. 추가적으로, 또는 대안적으로, 프로세스 의 블록들 중 2 개 이상이 병렬로 수행될 수도 있다. 도 9 는 본 개시에 따라, 예를 들어, 포워딩 디바이스에 의해 수행된 예시적인 프로세스 를 예시하는 다 이어그램이다. 예시적인 프로세스 는 포워딩 디바이스 (예컨대, 수동 디바이스 , 수동 디바이스 , AF 중계 노드 ) 가 포워딩 디바이스를 구성하는 것과 연관된 동작들을 수행하는 예이다. 도 9 에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 송신 디바이스로부터 송신된 신호들을 반사 또 는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하는 것을 포함할 수도 있다 (블록 910). 예를 들어, (예를 들어, 컴포넌트 관리기 또는 도 12 에 도시된 수신 컴포넌 트 를 사용하여) 포워딩 디바이스는, 전술한 바와 같이, 송신 디바이스로부터 송신된 신호들을 반사 또 는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신할 수도 있다. 도 9 에 더 도시된 바와 같이, 일부 양태들에서, 프로세스 는 시드에 적어도 부분적으로 기초하여 구성을 생성하는 것을 포함할 수도 있다 (블록 920). 예를 들어, (예를 들어, 컴포넌트 관리기 또는 도 12 에 도시된 생성 컴포넌트 를 사용하여) 포워딩 디바이스는, 전술한 바와 같이, 시드에 적어도 부분적으 로 기초하여 구성을 생성할 수도 있다. 도 9 에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 구성에 따라 신호들을 반사 또는 포워 딩하도록 포워딩 디바이스를 구성하는 것을 포함할 수도 있다 (블록 930). 예를 들어, (예를 들어, 컴포넌 트 관리기 또는 도 12 에 도시된 구성 컴포넌트 를 사용하여) 포워딩 디바이스는, 전술한 바와 같 이, 구성에 따라 신호들을 반사 또는 포워딩하도록 포워딩 디바이스를 구성할 수도 있다. 프로세스 는 아래에 설명된 및/또는 본 명세서의 다른 곳에서 설명된 하나 이상의 다른 프로세스들과 관 련된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가의 양태들을 포함할 수도 있다. 제 1 양태에서, 포워딩 디바이스는 RIS로서 동작하도록 구성된 수동 디바이스이고, 구성은 표면 구성이다. 제 2 양태에서, 단독으로 또는 제 1 양태와 조합으로, 포워딩 디바이스는 AF 중계 노드이고, 구성은 빔 구성이 다.제 3 양태에서, 단독으로 또는 제 1 및 제 2 양태들 중 하나 이상과 조합으로, 구성을 생성하는 것은 입력으로 서 시드를 갖는 구성을 의사-랜덤하게 생성하는 것을 포함한다. 제 4 양태에서, 단독으로 또는 제 1 내지 제 3 양태들 중 하나 이상과 조합으로, 구성은 반사 엘리먼트마다 또 는 안테나 엘리먼트마다 의사-랜덤하게 생성된다. 제 5 양태에서, 단독으로 또는 제 1 내지 제 4 양태들 중 하나 이상과 조합으로, 구성은 포워딩 디바이스의 반 사 엘리먼트들 또는 안테나 엘리먼트들에 할당된 가중치들을 갖는 가중 행렬에 대응하고, 포워딩 디바이스를 구 성하는 것은 가중치들에 따라 반사 엘리먼트들 또는 안테나 엘리먼트들을 구성하는 것을 포함한다. 제 6 양태에서, 단독으로 또는 제 1 내지 제 5 양태들 중 하나 이상과 조합으로, 프로세스 는 시드에 적 어도 부분적으로 기초하여 포워딩 디바이스를 활성화 또는 비활성화시키는 것을 포함한다. 제 7 양태에서, 단독으로 또는 제 1 내지 제 6 양태들 중 하나 이상과 조합으로, 프로세스 는 식별자를 수신하는 것을 포함하고, 포워딩 디바이스를 구성하는 것은 식별자가 포워딩 디바이스와 연관되는 경우 포워딩 디바이스를 구성하는 것을 포함한다. 제 8 양태에서, 단독으로 또는 제 1 내지 제 7 양태들 중 하나 이상과 조합으로, 시드는 코드북에 사용되는 열 들의 세트를 표시하고, 포워딩 디바이스를 구성하는 것은 열들의 세트에 적어도 부분적으로 기초하여 포워딩 디 바이스를 구성하는 것을 포함한다. 제 9 양태에서, 단독으로 또는 제 1 내지 제 8 양태들 중 하나 이상과 조합으로, 프로세스 는 시드에 대 한 신규 구성의 표시 또는 시드와 연관될 하나 이상의 빔들의 표시를 수신하는 것을 포함하고, 포워딩 디바이스 를 구성하는 것은 신규 구성 또는 하나 이상의 빔들에 적어도 부분적으로 기초하여 포워딩 디바이스를 구성하는 것을 포함한다. 제 10 양태에서, 단독으로 또는 제 1 내지 제 9 양태들 중 하나 이상과 조합으로, 시드는 QCL 정보를 표시하고, 포워딩 디바이스를 구성하는 것은 QCL 정보에 적어도 부분적으로 기초하여 포워딩 디바이스를 구성하는 것을 포 함한다. 도 9 는 프로세스 의 예시적인 블록들을 도시하지만, 일부 양태들에서, 프로세스 는 도 9 에 도시 된 것들보다 추가적인 블록들, 더 적은 블록들, 상이한 블록들, 또는 상이하게 배열된 블록들을 포함할 수도 있 다. 추가적으로, 또는 대안적으로, 프로세스 의 블록들 중 2 개 이상이 병렬로 수행될 수도 있다. 도 10 은 본 개시에 따라, 예를 들어, 수신 디바이스에 의해 수행된 예시적인 프로세스 를 예시하는 다 이어그램이다. 예시적인 프로세스 는 수신 디바이스 (예를 들어, UE , BS , UE ) 가 포워딩 디바이스를 구성하는 것과 연관된 동작들을 수행하는 예이다. 도 10 에 도시된 바와 같이, 일부 양태들에서, 프로세스 는 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하는 것을 포함 할 수도 있다 (블록 1010). 예를 들어, (예를 들어, 컴포넌트 관리기 또는 도 13 에 도시된 수신 컴 포넌트 를 사용하여) 수신 디바이스는, 전술한 바와 같이, 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신할 수도 있다. 도 10 에 추가로 도시된 바와 같이, 일부 양태들에서, 프로세스 는 구성에 적어도 부분적으로 기초하여 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 수신 디바이스를 구성하는 것을 포함할 수도 있 다 (블록 1020). 예를 들어, (예를 들어, 컴포넌트 관리기 또는 도 13 에 도시된 구성 컴포넌트 를 사용하여) 수신 디바이스는, 전술한 바와 같이, 구성에 적어도 부분적으로 기초하여 포워딩 디바이스 로부터 반사 또는 중계된 신호들을 수신하도록 수신 디바이스를 구성할 수도 있다. 프로세스 는 아래에 설명된 및/또는 본 명세서의 다른 곳에서 설명된 하나 이상의 다른 프로세스들과 관 련된 임의의 단일 양태 또는 양태들의 임의의 조합과 같은 추가의 양태들을 포함할 수도 있다. 제 1 양태에서, 구성을 생성하는 것은 입력으로서 시드를 사용하여 구성을 의사-랜덤하게 생성하는 것을 포함한 다. 제 2 양태에서, 단독으로 또는 제 1 양태와 조합으로, 구성은 포워딩 디바이스의 반사 엘리먼트들 또는 안테나 엘리먼트들에 할당된 가중치들을 갖는 가중 행렬에 대응하고, 수신 디바이스를 구성하는 것은 반사 엘리먼트들 또는 안테나 엘리먼트들의 가중치들에 적어도 부분적으로 기초하여 수신 디바이스의 수신 빔을 구성하는 것을포함한다. 제 3 양태에서, 단독으로 또는 제 1 및 제 2 양태들 중 하나 이상과 조합으로, 시드는 코드북에 사용되는 열들 의 세트를 표시하고, 수신 디바이스를 구성하는 것은 열들의 세트에 적어도 부분적으로 기초하여, 포워딩 디바 이스로부터 반사 또는 중계된 신호들을 수신하도록 수신 디바이스의 수신 빔을 구성하는 것을 포함한다. 제 4 양태에서, 단독으로 또는 제 1 내지 제 3 양태들 중 하나 이상과 조합으로, 프로세스 는 시드에 대 한 신규 구성의 표시 또는 시드와 연관될 하나 이상의 빔들의 표시를 수신하는 것을 포함하고, 수신 디바이스를 구성하는 것은 신규 구성 또는 하나 이상의 빔들에 적어도 부분적으로 기초하여, 포워딩 디바이스로부터 반사 또는 중계되는 신호들을 수신하도록 수신 디바이스의 수신 빔을 구성하는 것을 포함한다. 제 5 양태에서, 단독으로 또는 제 1 내지 제 4 양태들 중 하나 이상과 조합으로, 시드는 QCL 정보를 표시하고, 수신 디바이스를 구성하는 것은, QCL 정보에 적어도 부분적으로 기초하여, 포워딩 디바이스로부터 반사 또는 중 계된 신호들을 수신하도록 수신 디바이스의 수신 빔을 구성하는 것을 포함한다. 제 6 양태에서, 단독으로 또는 제 1 내지 제 5 양태들 중 하나 이상과 조합으로, 포워딩 디바이스는 재구성 가 능한 지능형 표면 또는 증폭 및 포워딩 중계 노드로서 동작하도록 구성된 수동 디바이스이다. 도 10 은 프로세스 의 예시적인 블록들을 도시하지만, 일부 양태들에서, 프로세스 는 도 10 에 도시된 것들보다 추가적인 블록들, 더 적은 블록들, 상이한 블록들 또는 상이하게 배열된 블록들을 포함할 수도 있다. 추가적으로, 또는 대안적으로, 프로세스 의 블록들 중 2 개 이상의 블록들은 병렬로 수행될 수도 있다. 도 11 은 무선 통신을 위한 예시적인 장치 의 블록 다이어그램이다. 장치 는 송신 디바이스 (예를 들어, 기지국, UE) 일 수도 있거나, 송신 디바이스는 장치 를 포함할 수도 있다. 일부 양태들 에서, 장치 는 (예컨대, 하나 이상의 버스들 및/또는 하나 이상의 다른 컴포넌트들을 통해) 서로 통신할 수도 있는 수신 컴포넌트 및 송신 컴포넌트 를 포함한다. 나타낸 바와 같이, 장치 는 수신 컴포넌트 및 송신 컴포넌트 를 사용하여 다른 장치 (예컨대, UE, 기지국, RIS 로서 작동하도록 구성된 수동 디바이스, AF 중계 노드, 또는 다른 무선 통신 디바이스) 와 통신할 수도 있다. 추 가로 도시된 바와 같이, 장치 는, 다른 예들 중에서, 시드 컴포넌트 를 포함할 수도 있다. 일부 양태들에서, 장치 는 도 1 내지 도 7 과 관련하여 본 명세서에서 설명된 하나 이상의 동작들을 수 행하도록 구성될 수도 있다. 부가적으로 또는 대안적으로, 장치 는 도 8 의 프로세스 와 같은, 본 명세서에 설명된 하나 이상의 프로세스들을 수행하도록 구성될 수도 있다. 일부 양태들에 있어서, 도 11 에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2 와 관련하여 상기에서 설명된 송신 디바 이스의 하나 이상의 컴포넌트들을 포함할 수도 있다. 부가적으로 또는 대안적으로, 도 11 에 도시된 하나 이상의 컴포넌트들은 도 2 와 관련하여 상기에서 설명된 하나 이상의 컴포넌트들 내에서 구현될 수도 있다. 부가적으로 또는 대안적으로, 컴포넌트들의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적어도 부분적으로 구현될 수도 있다. 예를 들어, 컴포넌트 (또는 컴포넌트의 일부) 는 비일시적 컴퓨터 판 독가능 매체에 저장되고 컴포넌트의 기능들 또는 동작들을 수행하기 위해 제어기 또는 프로세서에 의해 실행가 능한 명령들 또는 코드로서 구현될 수도 있다. 수신 컴포넌트 는 장치 로부터 레퍼런스 신호들, 제어 정보, 데이터 통신, 또는 그 조합과 같은 통신들을 수신할 수도 있다. 수신 컴포넌트 는 수신된 통신들을 장치 의 하나 이상의 다른 컴포넌트들에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 (다른 예들 중에서, 필터 링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등화, 간섭 소거, 또는 디코딩과 같이) 수신된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 의 하나 이상의 다른 컴포넌트들에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 도 2 와 관 련하여 상기에서 설명된 송신 디바이스의 하나 이상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어기/ 프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 송신 컴포넌트 는 장치 에 레퍼런스 신호들, 제어 정보, 데이터 통신, 또는 그 조합과 같은 통신 들을 송신할 수도 있다. 일부 양태들에 있어서, 장치 의 하나 이상의 다른 컴포넌트들은 통신들을 생성할 수도 있고, 생성된 통신들을, 장치 로의 송신을 위해 송신 컴포넌트 에 제공할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 (다른 예들 중에서, 필터링, 증폭, 변조, 디지털-아 날로그 변환, 멀티플렉싱, 인터리빙, 맵핑, 또는 인코딩과 같이) 생성된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 로 송신할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌 트 는 도 2 와 관련하여 상기에서 설명된 송신 디바이스의 하나 이상의 안테나들, 변조기, 송신 MIMO 프 로세서, 송신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에서, 송신 컴포넌트 는 트랜시버에서 수신 컴포넌트 와 병치될 수도 있다. 시드 컴포넌트 는 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택할 수도 있다. 송신 컴포넌트 는 시드의 표시를 포워딩 디바이스에 송신 할 수도 있다. 송신 컴포넌트 는 포워딩 디바이스를 통해 신호들을 수신 디바이스에 송신할 수도 있 다. 수신 컴포넌트 는 신호들의 측정들을 수신할 수도 있다. 송신 컴포넌트 는 시드와 함께 포워딩 디바이스의 식별자를 송신할 수도 있다. 송신 컴포넌트 는 시드에 대한 신규 구성의 표시 또는 시드와 연관될 하나 이상의 빔들의 표시를 송신할 수도 있다. 시드 컴포넌트 는 다수의 포워딩 디바이스들에 대한 빔들을 변경하는 것, 다수의 포워딩 디바이스들을 활성화하는 것, 또는 다수의 포워딩 디바이스들을 비활성화하는 것 중 하나 이상에 대한 다수의 시드들을 규정 할 수도 있다. 송신 컴포넌트 는 RRC 메시지 또는 MAC-CE에서 다수의 시드들의 표시를 송신할 수도 있다. 도 11 에 도시된 컴포넌트들의 수 및 배열은 일 예로서 제공된다. 실제로, 도 11 에 도시된 것들보다 추가 적인 컴포넌트들, 더 적은 컴포넌트들, 상이한 컴포넌트들, 또는 상이하게 배열된 컴포넌트들이 존재할 수도 있 다. 더욱이, 도 11 에 도시된 2 이상의 컴포넌트들은 단일 컴포넌트 내에서 구현될 수도 있거나, 또는 도 11 에 도시된 단일 컴포넌트는 다중의 분산 컴포넌트들로서 구현될 수도 있다. 추가적으로 또는 대안적으로, 도 11 에 도시된 (하나 이상의) 컴포넌트들의 세트는 도 11 에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으로서 설명된 하나 이상의 기능들을 수행할 수도 있다. 도 12 는 무선 통신을 위한 예시적인 장치 의 블록 다이어그램이다. 장치 는 포워딩 디바이 스 (예를 들어, RIS로서 동작하도록 구성된 수동 디바이스, AF 중계 노드) 일 수도 있거나, 포워딩 디바이스는 장치 를 포함할 수도 있다. 일부 양태들에서, 장치 는 (예컨대, 하나 이상의 버스들 및/또는 하나 이상의 다른 컴포넌트들을 통해) 서로 통신할 수도 있는 수신 컴포넌트 및 송신 컴포넌트 를 포함한다. 나타낸 바와 같이, 장치 는 수신 컴포넌트 및 송신 컴포넌트 를 사용하 여 다른 장치 (예컨대, UE, 기지국, 또는 다른 무선 통신 디바이스) 와 통신할 수도 있다. 추가로 도 시된 바와 같이, 장치 는, 다른 예들 중에서도, 생성 컴포넌트 및/또는 구성 컴포넌트 를 포함할 수도 있다. 일부 양태들에서, 장치 는 도 1 내지 도 7 과 관련하여 본 명세서에서 설명된 하나 이상의 동작들을 수 행하도록 구성될 수도 있다. 부가적으로 또는 대안적으로, 장치 는 도 9 의 프로세스 와 같은, 본 명세서에 설명된 하나 이상의 프로세스들을 수행하도록 구성될 수도 있다. 일부 양태들에 있어서, 도 12 에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2 와 관련하여 전술한 포워딩 디바이스의 하나 이상의 컴포넌트들을 포함할 수도 있다. 부가적으로 또는 대안적으로, 도 12 에 도시된 하나 이상의 컴포넌트들은 도 2 와 관련하여 상기에서 설명된 하나 이상의 컴포넌트들 내에서 구현될 수도 있다. 부가적 으로 또는 대안적으로, 컴포넌트들의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적어도 부분적으로 구현될 수도 있다. 예를 들어, 컴포넌트 (또는 컴포넌트의 일부) 는 비일시적 컴퓨터 판독가능 매체에 저장되고 컴포넌트의 기능들 또는 동작들을 수행하기 위해 제어기 또는 프로세서에 의해 실행가능한 명 령들 또는 코드로서 구현될 수도 있다. 수신 컴포넌트 는 장치 로부터 레퍼런스 신호들, 제어 정보, 데이터 통신, 또는 그 조합과 같은 통신들을 수신할 수도 있다. 수신 컴포넌트 는 수신된 통신들을 장치 의 하나 이상의 다른 컴포넌트에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 (다른 예들 중에서도, 필터 링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등화, 간섭 소거, 또는 디코딩과 같이) 수신된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 의 하나 이상의 다른 컴포넌트들에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 도 2 와 관 련하여 상기에서 설명된 포워딩 디바이스의 하나 이상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어 기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 송신 컴포넌트 는 장치 에 참조 신호들, 제어 정보, 데이터 통신, 또는 그 조합과 같은 통신들을 송신할 수도 있다. 일부 양태들에 있어서, 장치 의 하나 이상의 다른 컴포넌트들은 통신들을 생성할 수도 있고, 생성된 통신들을, 장치 로의 송신을 위해 송신 컴포넌트 에 제공할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 (다른 예들 중에서도, 필터링, 증폭, 변조, 디지털-아날로그 변환, 멀티플렉싱, 인터리빙, 맵핑, 또는 인코딩과 같이) 생성된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 로 송신할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 도 2 와 관련하여 상기에서 설명된 포워딩 디바이스의 하나 이상의 안테나들, 변조기, 송신 MIMO 프 로세서, 송신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 트랜시버에서 수신 컴포넌트 와 병치될 수도 있다. 수신 컴포넌트 는 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위 해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신할 수도 있다. 생성 컴포넌트 는 시드에 적어 도 부분적으로 기초하여 구성을 생성할 수도 있다. 구성 컴포넌트 는 구성에 따라 신호들을 반사 또 는 포워딩하도록 포워딩 디바이스를 구성할 수도 있다. 구성 컴포넌트 는 시드에 적어도 부분적으로 기초하여 포워딩 디바이스를 활성화 또는 비활성화시킬 수 도 있다. 수신 컴포넌트 는 식별자를 수신하고, 식별자가 포워딩 디바이스와 연관되면 포워딩 디바 이스를 구성할 수도 있다. 수신 컴포넌트 는 시드에 대한 신규 구성의 표시 또는 시드와 연관될 하나 이상의 빔들의 표시를 수신하 고 신규 구성 또는 하나 이상의 빔들에 적어도 부분적으로 기초하여 포워딩 디바이스를 구성할 수도 있다. 도 12 에 도시된 컴포넌트들의 수 및 배열은 일 예로서 제공된다. 실제로, 도 12 에 도시된 것들보다 추가 적인 컴포넌트들, 더 적은 컴포넌트들, 상이한 컴포넌트들, 또는 상이하게 배열된 컴포넌트들이 존재할 수도 있 다. 더욱이, 도 12 에 도시된 2 이상의 컴포넌트들은 단일 컴포넌트 내에서 구현될 수도 있거나, 또는 도 12 에 도시된 단일 컴포넌트는 다중의 분산 컴포넌트들로서 구현될 수도 있다. 추가적으로 또는 대안적으로, 도 12 에 도시된 (하나 이상의) 컴포넌트들의 세트는 도 12 에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으로서 설명된 하나 이상의 기능들을 수행할 수도 있다. 도 13 은 무선 통신을 위한 예시적인 장치 의 블록 다이어그램이다. 장치 는 수신 디바이스 (예를 들어, UE) 일 수도 있거나, 수신 디바이스는 장치 를 포함할 수도 있다. 일부 양태들에서, 장 치 는 (예컨대, 하나 이상의 버스들 및/또는 하나 이상의 다른 컴포넌트들을 통해) 서로 통신할 수도 있 는 수신 컴포넌트 및 송신 컴포넌트 를 포함한다. 나타낸 바와 같이, 장치 는 수신 컴포넌트 및 송신 컴포넌트 를 사용하여 다른 장치 (예컨대, UE, 기지국, 또는 다른 무선 통신 디바이스) 와 통신할 수도 있다. 추가로 도시된 바와 같이, 장치 는, 다른 예들 중에서, 구성 컴포넌트 를 포함할 수도 있다. 일부 양태들에서, 장치 는 도 1 내지 도 7 과 관련하여 본 명세서에서 설명된 하나 이상의 동작들을 수 행하도록 구성될 수도 있다. 부가적으로 또는 대안적으로, 장치 는 도 10 의 프로세스 와 같 은, 본 명세서에 설명된 하나 이상의 프로세스들을 수행하도록 구성될 수도 있다. 일부 양태들에 있어서, 도 13 에 도시된 장치 및/또는 하나 이상의 컴포넌트들은 도 2 와 관련하여 전술한 수신 디바이스의 하 나 이상의 컴포넌트들을 포함할 수도 있다. 부가적으로 또는 대안적으로, 도 13 에 도시된 하나 이상의 컴 포넌트들은 도 2 와 관련하여 상기에서 설명된 하나 이상의 컴포넌트들 내에서 구현될 수도 있다. 부가적으 로 또는 대안적으로, 컴포넌트들의 세트의 하나 이상의 컴포넌트들은 메모리에 저장된 소프트웨어로서 적어도 부분적으로 구현될 수도 있다. 예를 들어, 컴포넌트 (또는 컴포넌트의 일부) 는 비일시적 컴퓨터 판독가능 매체에 저장되고 컴포넌트의 기능들 또는 동작들을 수행하기 위해 제어기 또는 프로세서에 의해 실행가능한 명 령들 또는 코드로서 구현될 수도 있다. 수신 컴포넌트 는 장치 로부터 레퍼런스 신호들, 제어 정보, 데이터 통신, 또는 그 조합과 같은 통신들을 수신할 수도 있다. 수신 컴포넌트 는 수신된 통신들을 장치 의 하나 이상의 다른 컴포넌트에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 (다른 예들 중에서, 필터링, 증폭, 복조, 아날로그-디지털 변환, 디멀티플렉싱, 디인터리빙, 디맵핑, 등화, 간섭 소거, 또는 디코딩 과 같이) 수신된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 의 하 나 이상의 다른 컴포넌트들에 제공할 수도 있다. 일부 양태들에 있어서, 수신 컴포넌트 는 도 2 와 관련하여 상기에서 설명된 수신 디바이스의 하나 이상의 안테나들, 복조기, MIMO 검출기, 수신 프로세서, 제어 기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다.송신 컴포넌트 는 장치 에 참조 신호들, 제어 정보, 데이터 통신, 또는 그 조합과 같은 통신들을 송신할 수도 있다. 일부 양태들에 있어서, 장치 의 하나 이상의 다른 컴포넌트들은 통신들을 생성할 수도 있고, 생성된 통신들을, 장치 로의 송신을 위해 송신 컴포넌트 에 제공할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 (다른 예들 중에서, 필터링, 증폭, 변조, 디지털-아날로그 변 환, 멀티플렉싱, 인터리빙, 맵핑, 또는 인코딩과 같이) 생성된 통신물들에 대한 신호 프로세싱을 수행할 수도 있고, 프로세싱된 신호들을 장치 로 송신할 수도 있다. 일부 양태들에 있어서, 송신 컴포넌트 는 도 2 와 관련하여 상기에서 설명된 수신 디바이스의 하나 이상의 안테나들, 변조기, 송신 MIMO 프로 세서, 송신 프로세서, 제어기/프로세서, 메모리, 또는 이들의 조합을 포함할 수도 있다. 일부 양태들에 있 어서, 송신 컴포넌트 는 트랜시버에서 수신 컴포넌트 와 병치될 수도 있다. 수신 컴포넌트 는 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위 해 포워딩 디바이스에 의해 사용될 시드의 표시를 수신할 수도 있다. 구성 컴포넌트 는 구성에 적어 도 부분적으로 기초하여 포워딩 디바이스로부터 반사되거나 중계된 신호들을 수신하도록 수신 디바이스를 구성 할 수도 있다. 수신 컴포넌트 는 시드에 대한 신규 구성의 표시 또는 시드와 연관될 하나 이상의 빔들의 표시를 수신하 고, 신규 구성 또는 하나 이상의 빔들에 적어도 부분적으로 기초하여, 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 수신 디바이스의 수신 빔을 구성할 수도 있다. 도 13 에 도시된 컴포넌트들의 수 및 배열은 일 예로서 제공된다. 실제로, 도 13 에 도시된 것들보다 추가 적인 컴포넌트들, 더 적은 컴포넌트들, 상이한 컴포넌트들, 또는 상이하게 배열된 컴포넌트들이 존재할 수도 있 다. 더욱이, 도 13 에 도시된 2 이상의 컴포넌트들은 단일 컴포넌트 내에서 구현될 수도 있거나, 또는 도 13 에 도시된 단일 컴포넌트는 다중의 분산 컴포넌트들로서 구현될 수도 있다. 추가적으로 또는 대안적으로, 도 13 에 도시된 (하나 이상의) 컴포넌트들의 세트는 도 13 에 도시된 컴포넌트들의 다른 세트에 의해 수행되는 것으로서 설명된 하나 이상의 기능들을 수행할 수도 있다. 전술한 개시는 예시 및 설명을 제공하지만, 개시된 정확한 형태들로 양태들을 제한하거나 또는 완전한 것으로 의도되지 않는다. 수정들 및 변형들이 상기 개시의 관점에서 이루어질 수도 있거나 양태들의 실시로부터 획 득될 수도 있다. 다음은 본 개시의 일부 양태들의 개요를 제공한다: 양태 1: 송신 디바이스에 의해 수행되는 무선 통신의 방법으로서, 상기 송신 디바이스에 의해, 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디바이스에 의해 사용될 시드의 표시를 선택하는 단계; 상 기 송신 디바이스에 의해, 상기 시드의 표시를 상기 포워딩 디바이스에 송신하는 단계; 상기 송신 디바이스에 의해, 상기 포워딩 디바이스를 통해 상기 신호들을 수신 디바이스에 송신하는 단계; 및 상기 송신 디바이스에 의해, 상기 수신 디바이스로부터 상기 신호들의 측정들을 수신하는 단계를 포함하는, 방법. 양태 2: 양태 1에 있어서, 상기 포워딩 디바이스는 재구성 가능한 지능형 표면으로서 동작하도록 구성된 수동 디바이스이고, 상기 구성은 표면 구성인, 방법. 양태 3: 양태 1에 있어서, 상기 포워딩 디바이스는 증폭 및 포워딩 중계 노드이고, 상기 구성은 빔 구성인, 방 법. 양태 4: 양태 1 내지 양태 3 중 어느 한 양태에 있어서, 상기 측정들에 적어도 부분적으로 기초하여, 상기 구성 을 조정하는 단계, 상이한 시드를 선택하는 단계, 또는 채널 추정을 수행하는 단계 중 하나 이상을 더 포함하는, 방법. 양태 5: 양태 1 내지 양태 4 중 어느 한 양태에 있어서, 상기 구성은 상기 포워딩 디바이스의 반사 엘리먼트들 또는 안테나 엘리먼트들에 할당된 중치들을 갖는 가중 행렬에 대응하는, 방법. 양태 6: 양태 1 내지 양태 5 중 어느 한 양태에 있어서, 상기 시드는 상기 포워딩 디바이스를 활성화 또는 비활 성화시키는, 방법. 양태 7: 양태 1 내지 양태 6 중 어느 한 양태에 있어서, 상기 시드와 함께 상기 포워딩 디바이스의 식별자를 송 신하는 단계를 더 포함하는, 방법. 양태 8: 양태 1 내지 양태 7 중 어느 한 양태에 있어서, 상기 시드는 코드북에 사용되는 열들의 세트를 표시하 는, 방법. 양태 9: 양태 1 내지 양태 8 중 어느 한 양태에 있어서, 상기 시드에 대한 신규 구성의 표시 또는 상기 시드와 연관될 하나 이상의 빔의 표시를 송신하는 단계를 더 포함하는, 방법. 양태 10: 양태들 1 내지 양태 9 중 어느 한 양태에 있어서, 상기 송신 디바이스에 의해, 다수의 포워딩 디바이 스들에 대한 빔들을 변경하는 것, 다수의 포워딩 디바이스들을 활성화하는 것, 또는 다수의 포워딩 디바이스들 을 비활성화하는 것 중 하나 이상에 대한 다수의 시드들을 규정하는 단계; 및 상기 송신 디바이스에 의해, 다수 의 시드들의 표시를 무선 리소스 제어 메시지 또는 매체 액세스 제어 엘리먼트 (MAC-CE) 에서 송신하는 단계를 더 포함하는, 방법. 양태 11: 양태 1 내지 양태 10 중 어느 한 양태에 있어서, 상기 시드는 상기 구성에 대한 QCL (quasi-co- location) 정보를 표시하는, 방법. 양태 12: 양태 1 내지 양태 11 중 어느 한 양태에 있어서, 상기 시드를 선택하는 단계는 다른 디바이스로부터, 사용할 시드의 표시를 수신하는 단계를 포함하는, 방법. 양태 13: 포워딩 디바이스에 의해 수행되는 무선 통신의 방법으로서, 송신 디바이스로부터 상기 포워딩 디바이 스에 의해, 상기 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 상기 포워딩 디바이스에 의해 사용될 시드의 표시를 수신하는 단계; 상기 포워딩 디바이스에 의해, 상기 시드에 적어 도 부분적으로 기초하여 상기 구성을 생성하는 단계; 및 상기 포워딩 디바이스에 의해, 상기 구성에 따라 상기 신호들을 반사 또는 포워딩하도록 상기 포워딩 디바이스를 구성하는 단계를 포함하는, 방법. 양태 14: 양태 13에 있어서, 상기 포워딩 디바이스는 재구성 가능한 지능형 표면으로서 동작하도록 구성된 수동 디바이스이고, 상기 구성은 표면 구성인, 방법. 양태 15: 양태 13에 있어서, 상기 포워딩 디바이스는 증폭 및 포워딩 중계 노드이고, 상기 구성은 빔 구성인, 방법. 양태 16: 양태 13 내지 양태 15 중 어느 한 양태에 있어서, 상기 구성을 생성하는 단계는 상기 시드를 입력으로 서 이용하여 상기 구성을 의사-랜덤하게 생성하는 단계를 포함하는, 방법. 양태 17: 양태 16에 있어서, 상기 구성은 반사 엘리먼트마다 또는 안테나 엘리먼트마다 의사-랜덤하게 생성되는, 방법. 양태 18: 양태 13 내지 양태 17 중 어느 한 양태에 있어서, 상기 구성은 상기 포워딩 디바이스의 반사 엘리먼트 들 또는 안테나 엘리먼트들에 할당된 가중치들을 갖는 가중 행렬에 대응하고, 상기 포워딩 디바이스를 구성하는 단계는 상기 가중치들에 따라 상기 반사 엘리먼트들 또는 안테나 엘리먼트들을 구성하는 단계를 포함하는, 방법. 양태 19: 양태 13 내지 양태 18 중 어느 한 양태에 있어서, 상기 시드에 적어도 부분적으로 기초하여 상기 포워 딩 디바이스를 활성화 또는 비활성화시키는 단계를 더 포함하는, 방법. 양태 20: 양태 13 내지 양태 19 중 어느 한 양태에 있어서, 식별자를 수신하는 단계를 더 포함하며, 상기 포워 딩 디바이스를 구성하는 단계는 상기 식별자가 상기 포워딩 디바이스와 연관되는 경우, 상기 포워딩 디바이스를 구성하는 단계를 포함하는, 방법. 양태 21: 양태 13 내지 양태 20 중 어느 한 양태에 있어서, 상기 시드는 코드북을 위해 사용되는 열들의 세트를 표시하고, 상기 포워딩 디바이스를 구성하는 단계는 상기 열들의 세트에 적어도 부분적으로 기초하여 상기 포워 딩 디바이스를 구성하는 단계를 포함하는, 방법. 양태 22: 양태 13 내지 양태 21 중 어느 한 양태에 있어서, 상기 시드에 대한 신규 구성의 표시 또는 상기 시드 와 연관될 하나 이상의 빔들의 표시를 수신하는 단계를 더 포함하고, 상기 포워딩 디바이스를 구성하는 단계는 상기 신규 구성 또는 상기 하나 이상의 빔들에 적어도 부분적으로 기초하여 상기 포워딩 디바이스를 구성하는 단계를 포함하는, 방법. 양태 23: 양태 13 내지 양태 22 중 어느 한 양태에 있어서, 상기 시드는 QCL (quasi-co-location) 정보를 표시 하고, 상기 포워딩 디바이스를 구성하는 단계는 상기 QCL 정보에 적어도 부분적으로 기초하여 상기 포워딩 디바 이스를 구성하는 단계를 포함하는, 방법.양태 24: 수신 디바이스에 의해 수행되는 무선 통신의 방법으로서, 송신 디바이스로부터 상기 수신 디바이스에 의해, 상기 송신 디바이스로부터 송신된 신호들을 반사 또는 포워딩하기 위한 구성을 생성하기 위해 포워딩 디 바이스에 의해 사용될 시드의 표시를 수신하는 단계; 및 상기 수신 디바이스에 의해, 상기 구성에 적어도 부분 적으로 기초하여 상기 포워딩 디바이스로부터 반사 또는 중계된 신호들을 수신하도록 상기 수신 디바이스를 구 성하는 단계를 포함하는, 방법. 양태 25: 양태 24에 있어서, 상기 구성을 생성하는 단계는 상기 시드를 입력으로서 이용하여 상기 구성을 의사- 랜덤하게 생성하는 단계를 포함하는, 방법. 양태 26: 양태 24 또는 25에 있어서, 구성은 포워딩 디바이스의 반사 엘리먼트들 또는 안테나 엘리먼트들에 할 당된 가중치들을 갖는 가중 행렬에 대응하고, 수신 디바이스를 구성하는 것은 반사 엘리먼트들 또는 안테나 엘 리먼트들의 가중치들에 적어도 부분적으로 기초하여 수신 디바이스의 수신 빔을 구성하는 것을 포함하는, 방법. 양태 27: 양태 24 내지 양태 26 중 어느 한 양태에 있어서, 상기 시드는 코드북을 위해 사용되는 열들의 세트를 표시하고, 상기 수신 디바이스를 구성하는 것은 상기 열들의 세트에 적어도 부분적으로 기초하여, 포워딩 디바 이스로부터 반사 또는 중계된 신호들을 수신하도록 수신 디바이스의 수신 빔을 구성하는 것을 포함하는, 방법. 양태 28: 양태 24 내지 양태 27 중 어느 한 양태에 있어서, 시드에 대한 신규 구성의 표시 또는 시드와 연관될 하나 이상의 빔들의 표시를 수신하는 단계를 더 포함하고, 수신 디바이스를 구성하는 것은 신규 구성 또는 하나 이상의 빔들에 적어도 부분적으로 기초하여, 포워딩 디바이스로부터 반사 또는 중계되는 신호들을 수신하도록 수신 디바이스의 수신 빔을 구성하는 것을 포함하는, 방법. 양태 29: 양태 24 내지 양태 28 중 어느 한 양태에 있어서, 상기 시드는 QCL (quasi-co-location) 정보를 표시 하고, 수신 디바이스를 구성하는 것은 QCL 정보에 적어도 부분적으로 기초하여, 포워딩 디바이스로부터 반사 또 는 중계된 신호들을 수신하도록 수신 디바이스의 수신 빔을 구성하는 것을 포함하는, 방법. 양태 30: 양태 24 내지 양태 29 중 어느 한 양태에 있어서, 상기 포워딩 디바이스는 재구성 가능한 지능형 표면 또는 증폭 및 포워딩 중계 노드로서 동작하도록 구성된 수동 디바이스인, 방법. 양태 31: 디바이스에서의 무선 통신을 위한 장치로서, 프로세서; 프로세서와 커플링된 메모리; 및 메모리에 저 장되고, 장치로 하여금 양태 1 내지 양태 30 중 하나 이상의 양태의 방법을 수행하게 하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 장치. 양태 32: 무선 통신을 위한 디바이스로서, 메모리, 및 메모리에 커플링된 하나 이상의 프로세서들을 포함하고, 메모리 및 하나 이상의 프로세서들은 양태 1 내지 양태 30 중 하나 이상의 양태의 방법을 수행하도록 구성되는, 디바이스. 양태 33: 무선 통신을 위한 장치로서, 양태 1 내지 양태 30 중 하나 이상의 양태의 방법을 수행하기 위한 적어 도 하나의 수단을 포함하는, 장치. 양태 34: 무선 통신을 위한 코드를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 코드는 양태 1 내지 양태 30 중 하나 이상의 양태의 방법을 수행하도록 프로세서에 의해 실행가능한 명령들을 포함하는, 비일시적 컴퓨터 판 독가능 매체. 양태 35: 무선 통신을 위한 명령들의 세트를 저장하는 비일시적 컴퓨터 판독가능 매체로서, 명령들의 세트는, 디바이스의 하나 이상의 프로세서에 의해 실행될 때, 디바이스로 하여금, 양태 1 내지 양태 30 중 하나 이상의 양태의 방법을 수행하게 하는 하나 이상의 명령을 포함하는, 비일시적 컴퓨터 판독가능 매체. 본 명세서에서 사용된 바와 같이, 용어 \"컴포넌트\"는 하드웨어 및/또는 하드웨어와 소프트웨어의 조합으로서 광 범위하게 해석되도록 의도된다. \"소프트웨어\"는, 특히 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드 웨어 디스크립션 언어, 또는 기타 등등으로서 지칭되든간에, 명령들, 명령 세트들, 코드, 코드 세그먼트들, 프 로그램 코드, 프로그램들, 서브프로그램들, 소프트웨어 모듈들, 애플리케이션들, 소프트웨어 애플리케이션들, 소프트웨어 패키지들, 루틴들, 서브루틴들, 오브젝트들, 실행가능물들, 실행 스레드들, 프로시저들, 및/또는 함 수들을 의미하도록 넓게 해석될 것이다. 본 명세서에서 사용된 바와 같이, 프로세서는 하드웨어 및/또는 하 드웨어와 소프트웨어의 조합에서 구현된다. 본 명세서에 설명된 시스템들 및/또는 방법들은 상이한 형태들 의 하드웨어 및/또는 하드웨어 및 소프트웨어의 조합으로 구현될 수도 있음이 명백할 것이다. 이러한 시스 템들 및/또는 방법들을 구현하는데 사용된 실제 특수 제어 하드웨어 또는 소프트웨어 코드는 이러한 양태들을 제한하지 않는다. 따라서, 시스템들 및/또는 방법들의 동작 및 거동은 특정 소프트웨어 코드에 대한 참조없이 본 명세서에 설명되었다 - 소프트웨어 및 하드웨어는 본 명세서의 설명에 적어도 부분적으로 기초하여, 시스 템들 및/또는 방법들을 구현하도록 설계될 수 있는 것으로 이해된다. 본 명세서에서 사용된 바와 같이, 임계치를 만족하는 것은, 컨텍스트에 의존하여, 임계치 초과, 임계치 이상, 임계치 미만, 임계치 이하, 임계치와 동일, 임계치와 동일하지 않은 값 등을 지칭할 수도 있다. 특징들의 특정 조합들이 청구항들에 기재되고 및/또는 명세서에 개시되어 있지만, 이들 조합들은 다양한 양태들 의 개시를 제한하도록 의도되지 않는다. 실제로, 이들 특징들 중 다수는 청구항들에 구체적으로 기재되지 않고 및/또는 명세서에 개시되지 않은 방식으로 조합될 수도 있다. 하기에 열거된 각각의 종속 청구항은 하 나의 청구항에만 직접 종속할 수도 있지만, 다양한 양태들의 개시는 청구항 세트에 있는 모든 다른 청구항과 조 합하여 각각의 종속 청구항을 포함한다. 본 명세서에 사용된 바와 같이, 아이템들의 리스트 \"중 적어도 하 나\" 를 지칭하는 구절은, 단일 멤버들을 포함한 그러한 아이템들의 임의의 조합을 지칭한다. 예로서, \"a, b, 또는 c 중 적어도 하나\" 는 a, b, c, a-b, a-c, b-c, 및 a-b-c 뿐 아니라 동일한 엘리먼트의 배수들과의 임 의의 조합 (예를 들어, a-a, a-a-a, a-a-b, a-a-c, a-b-b, a?c?c, b-b, b-b-b, b-b-c, c-c, 및 c-c-c 또는 a, b, 및 c 의 임의의 다른 순서화) 을 커버하도록 의도된다. 본 명세서에서 사용된 어떠한 엘리먼트, 액트, 또는 명령도 이와 같이 명시적으로 설명되지 않으면 중요하거나 필수적인 것으로 해석되지 않아야 한다. 또한, 본 명세서에서 사용된 바와 같이, 관사들 (\"a\" 및 \"an\") 은 하나 이상의 아이템들을 포함하도록 의도되고, \"하나 이상\" 과 상호교환가능하게 사용될 수도 있다. 또한, 본 명세서에서 사용되는 바와 같이, 정관사 \"the\" 는 정관사 \"the\" 와 관련하여 참조되는 하나 이상의 아이템을 포함하도록 의도되고, \"하나 이상\" 과 상호 교환가능하게 사용될 수도 있다. 또한, 본 명세서에서 사용된 바와 같이, 용어들 \"세트\" 및 \"그룹\" 은 하나 이상의 아이템 (예를 들어, 관련된 아이템들, 관련되지 않은 아이 템들, 관련된 및 관련되지 않은 아이템들의 조합) 을 포함하도록 의도되고, \"하나 이상\" 과 상호교환가능하게 사용될 수도 있다. 단 하나의 아이템이 의도된 경우, 어구 \"단 하나\" 또는 유사한 표현이 사용된다. 또 한, 본 명세서에서 사용된 바와 같이, 용어들 \"갖는다\", \"갖는\" 등은 개방형 용어인 것으로 의도된다. 또한, 구절 \"에 기초한\" 은 달리 명시적으로 언급되지 않는 한 \"적어도 부분적으로 기초한\" 을 의미하는 것으로 의도된다. 또한, 본 명세서에서 사용된 바와 같이, 용어 \"또는\" 은 연속하여 사용될 때 포괄적인 것으로 의 도되고, 달리 명시적으로 서술되지 않으면 (예컨대, \"어느 하나\" 또는 \"오직 하나\" 와 조합하여 사용되면) \"및/ 또는\" 과 상호교환가능하게 사용될 수도 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2023-7036126", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 상기 기재된 특징들이 상세히 이해될 수 있도록, 상기 간략히 요약된, 보다 구체적인 설명이 양태들 을 참조하여 이루어질 수도 있으며, 그 양태들 중 일부는 첨부된 도면들에 예시된다. 하지만, 첨부된 도면 들은 본 개시의 오직 소정의 통상적인 양태들만을 예시할 뿐이고, 따라서, 본 설명은 다른 동일하게 효과적인 양태들을 허용할 수도 있으므로, 본 개시의 범위를 제한하는 것으로 고려되서는 안된다는 점에 유의해야 한다. 상이한 도면들에서의 동일한 참조 번호들은 동일하거나 또는 유사한 엘리먼트들을 식별할 수도 있다. 도 1 은 본 개시에 따른, 무선 네트워크의 예를 예시하는 다이어그램이다. 도 2 는 본 개시에 따른, 무선 네트워크에서 사용자 장비 (UE) 와 통신하는 기지국의 예를 예시하는 다이어그램 이다. 도 3 은 본 개시에 따른, 수동 디바이스의 사용의 일 예를 예시하는 다이어그램이다. 도 4 는 본 개시에 따른, 사이드링크 통신들의 일 예를 예시하는 다이어그램이다. 도 5 는 본 개시에 따른, 사이드링크 통신들 및 액세스 링크 통신들의 일 예를 예시하는 다이어그램이다. 도 6 은 본 개시에 따른, 시드로 포워딩 디바이스를 구성하는 것의 일 예를 예시하는 다이어그램이다. 도 7 은 본 개시에 따른, 본 개시에 따른, 다수의 포워딩 디바이스들을 사용한 트레이닝의 일 예를 예시하는 다 이어그램이다. 도 8 은 본 개시에 따라, 예를 들어, 송신 디바이스에 의해 수행된 예시적인 프로세스를 예시하는 다이어그램이 다. 도 9 는 본 개시에 따라, 예를 들어, 포워딩 디바이스에 의해 수행된 예시적인 프로세스를 예시하는 다이어그램 이다. 도 10 은 본 개시에 따라, 예를 들어, 수신 디바이스에 의해 수행된 예시적인 프로세스를 예시하는 다이어그램이다. 도 11 내지 도 13 은 본 개시에 따른, 무선 통신을 위한 예시적인 장치들의 블록 다이어그램들이다."}
