{"patent_id": "10-2021-7037403", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0004094", "출원번호": "10-2021-7037403", "발명의 명칭": "내강 내 이미지 분석 방법 및 장치", "출원인": "캠브리지 엔터프라이즈 리미티드", "발명자": "울프, 아담"}}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "관상동맥의 이미지 세트를 분석하기 위한 자동화된 컴퓨터 구현 방법에 있어서,상기 방법은: 상기 이미지 세트의 각 이미지에 대해: 제1 신경망을 사용하여, 질병 조직의 존재 또는 부재에 대해 상기 이미지를 분류하는 단계; 상기 이미지가 병든 조직이 있는 것으로 분류되면, 제2 신경망을 이용하여, 인공물의 유무에 따라 상기 이미지를 분류하는 단계; 상기 분류하는 단계에 기초하여 상기 이미지 분석 여부를 결정하는 단계; 상기 이미지가 분석될 때, 제3 신경망을 사용하여, 관상동맥 조직에서 하나 이상의 관심 특징을 식별함으로써상기 이미지를 분석하는 단계; 및 식별된 각각의 관심 특징을 측정하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제2 신경망을 이용하여 상기 이미지를 분류하기 전에, 상기 이미지의 상기 관상동맥을 복수의 샘플로 샘플링 하는 단계 및 샘플 세트를 상기 제2 신경망에 입력하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 이미지를 분류하는 단계는: 상기 입력 세트의 각 샘플에서 검출 가능한 관상동맥 조직의 비율을 결정하는 단계; 및 상기 결정된 비율에 따라 이미지를 분류하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항 또는 제3항에 있어서,복수의 훈련 데이터세트 샘플을 분석하여 상기 이미지를 분류하도록 상기 제2 신경망을 훈련시키는 단계를 더포함하는 방법.공개특허 10-2022-0004094-3-청구항 5 제2항 내지 제4항 중 어느 한 항에 있어서,이미지가 인공물이 존재하는 것으로 분류되는 경우, 상기 인공물을 보정 가능 또는 보정 불가능으로 더 분류하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,제3항에 따라, 상기 이미지는 상기 결정된 비율이 50%를 초과하는 경우 보정 가능한 인공물을 갖는 것으로 분류되는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항 또는 제6항에 있어서,상기 이미지를 분석하기 전에, 보정 가능한 인공물이 있는 것으로 분류된 상기 이미지를 보정하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,보정 가능한 인공물이 있는 것으로 분류된 이미지를 보정하는 단계는 식별된 상기 인공물 아래의 상기 관상동맥조직의 세부 사항을 복구하기 위해 상기 식별된 이미지에 가변-자동 인코더 생성적 적대 네트워크를 적용하는단계를 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서,상기 이미지가 질병 조직이 없는 것으로 분류된 경우, 상기 이미지를 공백 정보로 대체하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,식별된 관심 특징 각각을 측정하는 단계는 섬유 조직 두께, 섬유 조직 강도, 플라크 조성, 내강 면적, 및 병든내강 둘레 중 임의의 하나 이상을 측정하는 단계를 포함하는 방법.공개특허 10-2022-0004094-4-청구항 11 제1항 내지 제10항 중 어느 한 항에 있어서,상기 이미지를 분석하기 전에, 보유 이미지의 상기 관상동맥을 복수의 샘플로 샘플링 하는 단계; 및 상기 관상동맥의 선형 표현에 상기 샘플을 배치하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 이미지를 분석하는 단계는: 회귀 경계 박스 기술을 사용하여, 상기 복수의 샘플 각각에서 섬유 조직과 괴사 또는 석회 조직 사이의 인터페이스를 식별하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 식별된 관심 특징을 측정하는 단계는 상기 인터페이스와 상기 샘플의 가장자리 사이의 거리를 측정하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항 내지 제13항 중 어느 한 항에 있어서,상기 관상동맥의 이미지 세트가 광간섭 단층촬영 이미지인 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제14항 중 어느 한 항에 있어서,각각의 이미지는 환자의 관상동맥의 것이고, 상기 방법은: 식별된 관심 특징 각각의 측정을 사용하여, 상기 환자가 관상동맥 질병의 특정 발현을 나타낼 징후를 결정하는단계를 더 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,관상동맥 질병의 특정 발현을 나타내는 상기 환자의 징후를 결정하는 단계는 제4 신경망을 사용하는 단계를 포함하는 공개특허 10-2022-0004094-5-방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제4 신경망은 각각의 분석된 이미지에 대한 식별된 관심 특징의 측정 및 분석되지 않은 각 이미지에 대한공백 정보를 입력으로 수신하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항 내지 제17항 중 어느 한 항에 있어서,상기 관상동맥 질병이 심근 경색이고 상기 식별된 관심 특징이 섬유 조직 두께인 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항 내지 제14항 중 어느 한 항에 있어서,상기 이미지 세트는 제1 시간에 캡처된 환자의 관상동맥 제1 이미지 서브세트 및 후속 제2 시간에 상기 환자의관상동맥 제2 이미지 서브세트를 포함하고, 및 상기 방법은: 상기 제1 이미지 서브세트에 대해 식별된 관심 특징 각각에 대해 상기 제1 측정 세트를 측정하는 단계; 상기 제2 이미지 서브세트에 대한 식별된 관심 특징 각각에 대해 측정의 제2 세트를 측정하는 단계; 및 상기 제1 및 제2 측정 세트를 사용하여, 상기 관상동맥의 모든 변화를 결정하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 제1 시간은 치료의 제1 단계이고, 상기 제2 시간은 상기 치료의 제2 단계이고, 임의의 결정된 변화에 기초하여 상기 치료의 효능을 결정하는 단계를 추가로 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "환자의 진단 방법에 있어서,상기 환자의 관상동맥의 복수의 이미지를 수신하는 단계; 상기 수신된 각 이미지에 대해: 제1 신경망을 사용하여, 질병 조직의 존재 또는 부재에 대해 상기 이미지를 분류하는 단계; 상기 이미지가 병든 조직이 있는 것으로 분류되면, 제2 신경망을 사용하여, 인공물의 유무에 따라 상기 이미지를 분류하는 단계; 상기 분류에 기초하여 상기 이미지 분석 여부를 결정하는 단계; 및 상기 이미지가 분석될 때: 공개특허 10-2022-0004094-6-처리된 상기 이미지를 제3 신경망을 이용하여, 섬유 조직과 괴사 또는 석회 조직 사이의 인터페이스를 식별하여분석하는 단계; 및 섬유 조직 두께를 측정하는 단계; 및 제4 신경망을 이용하여, 측정된 섬유 조직 두께에 기초하여 상기 상기 환자를 진단하는 단계를 포함하는 방법."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "프로세서 상에서 구현될 때, 상기 프로세서로 하여금 제1항 내지 제21항 중 어느 한 항의 방법을 수행하게 하는코드를 운반하는 비일시적 데이터 캐리어."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "관상동맥의 이미지 세트를 분석하기 위한 장치에 있어서,상기 장치는: 관상동맥의 이미지 세트를 캡처하기 위한 이미징 장치; 및 메모리에 결합된, 적어도 하나의 프로세서 - 상기 프로세서는: 상기 이미지 세트의 각 이미지에 대해: 제1 신경망을 사용하여, 질병 조직의 존재 또는 부재에 대해 상기 이미지를 분류하고; 상기 이미지가 병든 조직이 있는 것으로 분류되면, 제2 신경망을 사용하여 인공물의 유무에 따라 상기 이미지를분류하고; 상기 분류에 기초하여 상기 이미지를 분석할지 여부를 결정하고; 및 상기 이미지가 분석될 때: 제3 신경망을 사용하여, 관상동맥 조직에서 하나 이상의 관심 특징을 식별함으로써 보유 이미지를 분석하고; 및식별된 각각의 관심 특징을 측정하도록 배치됨 - 를 포함하는 장치."}
{"patent_id": "10-2021-7037403", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,상기 이미징 장치는 광간섭 단층촬영 장치인 장치."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 기술의 실시예는 예를 들어 질병, 질병 표현 또는 사건의 징후를 예측하고/하거나 약물 또는 다른 치료의 성 능을 추적하기 위해 내강 내 이미지를 분석하기 위한 장치 및 방법을 제공한다. 방법은: 관상동맥의 이미지 세 트의 각 이미지에 대해: 제1 신경망을 사용하여 병든 조직의 존재 또는 부재에 대해 이미지를 분류하는 단계; 이 미지가 병든 조직이 있는 것으로 분류되면 제2 신경망을 이용하여 인공물의 유무에 따라 이미지를 분류하는 단계; 분류하는 단계에 기초하여 이미지 분석 여부를 결정하는 단계; 이미지가 분석될 때, 제3 신경망을 사용하 여 관상동맥 조직에서 하나 이상의 관심 특징을 식별함으로써 이미지를 분석하는 단계; 및 식별된 각각의 관심 특징을 측정하는 단계를 포함한다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 예를 들어 질병, 질병 표현(disease presentation) 또는 사건의 징후(likelihood)를 예측하고/하거 나 약물 또는 다른 치료의 효능을 추적하기 위해 내강 내 이미지(intracoronary image)를 분석하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "그 유행에도 불구하고, 관상동맥 질병(coronary artery disease)(CAD)에서 임상 사건(clinical event)의 예측 은 일반적으로 인구 통계를 기반으로 한다. 보다 최근에 이러한 예측은 예를 들어 랜싯 376(Lancet, 1393- 1400)에 출판된 리패티스 등(Ripattis et al)의 \"관상 심장 질병에 대한 다중 유전자 위험 점수: 사례 통제 및 전향적 코호트 분석\" 및 써크(Circ.) 카디오바스크(Cardiovasc) 제닛 5(Genet. 5, 113-21 )에 출 판된 타나소우리스 등(Thanassoulis et)의 \"유전적 위험 점수는 심혈관 질병 및 관상동맥 칼슘과 연관된다: 플 래밍 심장 연구\"에 설명된 바와 같이 유전 위험 점수를 중첩했을 수 있다. 고해상도 내강 내 이미징(High-resolution intracoronary imaging)은 개인화된 위험 예측을 위해 환자별 특징 을 포착하는 데 사용할 수 있지만 임상의의 해석이 필요한다. 예를 들어, 제에이씨씨 카디오바스크 이미징 7(JACC Cardiovasc Imaging 7, 397-405)에 발표된 시에 등(Xie et al)의 \"프로스팩트(PROSPECT) 연구에 서 급성 동맥 증후군(acute coronary syndrome) 환자의 원인이 없는 플라크 파열(nonculprit plaque rupture) 의 임상 결과\"에 설명된 대로 내강 내 이미징은 동맥경화증의 정도와 유형에 대한 환자별 데이터를 제공하는 데 사용되었다. 그러나, 보고된 바와 같이, 자연사 연구에서 확인된 '고위험' 동맥경화 플라크의 20% 미만이 5년 동안 환자 사건을 초래했다. 저조한 성능은 검증되지 않은 고위험 이미징 특징, 관찰자 간 재현성이 좋지 않은 임상의 해석, 이미징 인공물 및 낮은 공간 해상도를 포함한 여러 요인으로 인해 발생할 수 있다. 광간섭 단층촬영( optical coherence tomography)(OCT)와 같은 고해상도 이미징의 또 다른 용도는 \"관상 플라 크의 조직 특성화 및 통합 후방 산란 혈관내 초음파를 사용한 섬유질 캡의 두께 평가\"에 설명되어 있다. 써크 제이 74(Circ J 74, 2641-2648)에 카와사키 등(Kawasaki et al)의 \"조직학 및 광간섭 단층촬영과의 비교\"에 출판되었다. OCT는 조직 구성 요소를 시각화하고 다양한 플라크 유형을 식별하는 데 사용된다. 그러 나, 방대한 이미징 데이터세트가 생성되고 상세한 임상 해석을 위해 질병의 작은 영역만 선택된다. 인트 제이 컴퓨트 어시스트 라디올 서지 10(Int J Comput Assist Radiol Surg 10, 1383-1394)에 게시된 잔드 등 (Zahnd el al)의 \"동적 프로그래밍 기반 윤곽 분할 방법을 사용한 내강 내 광간섭 단층촬영의 섬유질 캡 두께 (fibrous cap thickness) 정량화\", 또는 인트 제이 컴퓨트 어시스트 라디올 서지 디오아이:10(Int J Comput Assist Radiol Surg doi:10,1007/s11548-017-1657-7)에 게시된 잔드 등(Zahnd el al)의 \"관내 OCT 이미 지에서 내막, 중막 및 외막 층의 윤곽 분할: 건강한 벽 영역의 완전 자동 감지에 대한 적용\"에 설명된 대로 자 동화를 위한 시도가 있었다. 그러나, 이 기사에서 설명한 것처럼 임상 실습에서 볼 수 있는 인공물(artefact) 의 빈도와 다양성은 반자동 분석조차도 임상의가 영역 선택 및 해석 또는 완벽한 동맥 해부학(coronary anatomy)에 대한 제한된 분석을 필요로 함을 의미한다. 배경 정보는 다음에서 찾을 수 있다: 혈관 이미지에서 혈관의 한 위치에서 내강 경계를 자동으로 찾고 혈관의 직경을 측정하는 방법 및 장치를 설명하는 US2014/276011; 혈관내 OCT 이미지에서 추출된 특징을 사용하여 혈관 내 플라크를 자동으로 분류하는 방법 및 장치를 설명하는US2017/309018; 딥 러닝 기반 심혈관 OCT 이미지에서 취약한 플라크를 탐지하는 방법 및 시스템을 설명하는 CN108961229; 및 동맥 죽상경화 플라크(coronary atherosclerotic plaque)의 성장을 예측하는 방법을 설명하는 CN109091167. 추가 배경 정보는 US2017/0148158 에서 찾을 수 있고, 이는 혈관 구조 정보를 추출하기 위해 혈관 조영 이미지 데이터(vasculature information) 를 분석하는 시스템 및 기술을 설명하고, 여기서 혈관 조영술은 혈관과 기관의 내부 또는 내강을 시각화하기 위 해 혈관구조(vasculature)를 통해 흐르는 조영제의 X선 이미지를 얻는 것을 포함한다. 본 출원인은 고해상도 내강 내 이미징을 분석하는 새로운 자동화 방법의 필요성을 인식했다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따르면 첨부된 특허청구범위에 기재된 장치 및 방법이 제공된다. 본 발명의 다른 특징은 종속항 및 다음의 설명으로부터 명백할 것이다. 우리는 관상동맥(coronary artery)의 이미지 세트를 분석하기 위한 자동화된 컴퓨터 구현 방법을 설명하고, 방 법은: 이미지 세트 내의 3개의 이미지 세트 각각에 대해: 제1 신경망(first neural network)을 사용하여, 질병 조직(diseased tissue)의 존재 또는 부재에 대해 이미지 세트를 분류하는 단계; 세트가 병든 조직이 존재하는 것으로 분류되는 경우, 인공물(artefact)의 존재 또는 부재에 대해 제2 신경망을 사용하여 세트를 분류하는 단 계; 상기 분류에 기초하여 이미지 분석 여부를 결정하는 단계; 및 이미지가 분석될 때: 제3 신경망을 사용하여, 관상동맥 조직(coronary artery tissue)에서 하나 이상의 관심 특징을 식별함으로써 이미지를 분석하는 단계;및 식별된 각각의 관심 특징을 측정하는 단계를 포함한다. 우리는 또한 관상동맥의 이미지 세트를 분석하는 장치에 대해 설명하고, 장치는: 관상동맥의 이미지 세트를 캡 처하기 위한 이미징 장치; 및 메모리에 결합된, 적어도 하나의 프로세서 - 이는 이미지 세트 내의 이미지 세트 각각에 대해: 제1 신경망을 사용하여, 질병 조직의 존재 또는 부재에 대해 이미지 세트를 분류하고; 이미지가 병든 조직이 존재하는 것으로 분류되는 경우, 인공물(artefact)의 유무에 대해 제2 신경망을 사용하여 이미지를 분류하고; 분류에 기초하여 이미지 분석 여부를 결정하는 단계; 및 이미지가 분석될 때: 제3 신경망을 사용하여, 관상동맥 조직에서 하나 이상의 관심 특징을 식별하기 위해 이미지를 분석하고; 및 식별된 각각의 관 심 특징을 측정하도록 배치됨 - 을 포함한다. 이러한 자동화된 방법 또는 장치는 이미지 획득 후 작업자 개입이 없을 수 있으므로 광범위한 데이터세트에 적 용할 수 있다. 이미지 세트는 전체 또는 부분 풀백(pullback)일 수 있다. 이미지를 분류하기 전에 이미지의 관상동맥을 복수의 샘플로 샘플링할 수 있다. 샘플 세트, 예를 들어 3개의 샘플은 이미지를 분류하기 위해 제2 신경망의 버전에 입력될 수 있지만 샘플에 대해 훈련될 수 있다. 각 샘플은 직사각형 세그먼트일 수 있고 동맥(artery)의 내강 가장자리(lumen edge)와 정렬된 상단 가장자리를 가질 수 있 다. 제2 신경망을 사용하여 이미지를 분류하는 단계는 입력 세트의 각 샘플에서 검출 가능한 관상동맥 조직의 비율 을 결정하는 단계; 및 결정된 비율에 기초하여 이미지를 분류하는 단계를 포함한다. 제2 신경망은 지도 학습 알 고리즘을 사용하여 복수의 훈련 데이터세트 샘플을 분석하여 이미지를 분류할 수 있다. 이미지를 분류하는 단 계는, 예를 들어 임의의 하부 조직(underlying tissue)이 검출되었는지 여부에 기초하여 임의의 현재 인공물을 보정 가능 또는 보정 불가능으로 분류하는 것을 포함할 수 있다. 보정 가능한 인공물(correctable artefact)은 국소 인공물(예를 들어, 국소 내강 잔류 혈액 및 결과 국소 조직 음영(focal tissue shadow)) 또는 동맥 구조 컴포넌트(예를 들어, 이미징 장치(예를 들어, OCT 카테터(catheter))와 관심 영역 사이의 동맥 조직의 중간 노 출)에 의해 생성될 수 있고, 즉, OCT 카테터가 부분적으로 분기/분기 내에 있는 곳에서 볼 수 있음) 및 보정 불가능한 인공물이 의료 구조 컴포넌트(예를 들어, 스텐트(stent), 가이드 카테터(guide catheter))에 의해 생 성될 수 있다. 훈련을 위해 인공물이 풍부한 비교 상태와 인공물이 없는 비교 상태를 모두 생성하는 반복 환자 풀백(repeat patient pullback)에서 풍부한 데이터가 있다. 예를 들어, 관찰 가능한 조직의 결정된 비율이 50% 를 초과하지만 100% 미만인 경우, 즉 샘플의 적어도 절반이 기본 조직을 나타내는 경우 이미지는 보정 가능한 인공물을 갖는 것으로 분류될 수 있다. 이미지는 결정된 비율이 약 0%인 경우, 즉 샘플 중 기본 조직이 거의 표시되지 않는 경우 보정 불가능한 인공물이 있는 것으로 분류될 수 있다. 이미지가 보정 가능한 인공물을 포함하는 경우, 방법은 이미지를 분석하기 전에 보정 가능한 인공물로 분류된 이미지를 보정하는 단계를 더 포함할 수 있다. 이미지를 보정하는 단계는 식별된 인공물 아래에 있는 관상동맥 조직의 세부 사항을 복구하기 위해 식별된 이미지에 가변-자동 인코더 생성적 적대 네트워크(variational- autoencoder generative adversarial network)를 적용하는 단계를 포함할 수 있다. 예를 들어, 네트워크는 이 미지에 삽입할 대체 샘플을 생성할 수 있다. 대체 샘플을 생성할 수 없는 경우, 샘플은 보정 불가능한 인공물 을 포함하는 것으로 분류될 수 있다. 이미지가 병든 조직이 없는 것으로 분류되는 경우, 이미지는 공백 정보로 대체될 수 있다. 따라서 동일한 수의 입력이 이미지 세트로 유지된다. 식별된 관심 특징 각각을 측정하는 단계는 다음 중 임의의 하나 이상을 측정하는 단계를 포함할 수 있다: 섬유 질 캡(fibrous cap)/조직 두께(tissue thickness), 섬유질 조직 픽셀 강도(fibrous tissue pixel intensity) 및 두께, 플라크 조성(plaque composition), 내강 면적(lumen area) 및 병든 내강 둘레(diseased lumen circumference). 이 방법은 이미지를 분석하기 전에 이미지의 관상동맥을 내강 주변의 복수의 샘플로 샘플링하는 단계; 및 관상 동맥의 선형 표현으로 샘플을 배치하는 단계를 포함한다. 샘플링은 전술한 샘플링과 동일할 수 있다. 처리된 이미지를 분석하는 단계는 회귀 경계 박스 기술(regression bounding box technique)을 사용하여 복수의 샘플 각각에서 섬유 조직과 괴사 또는 석회 조직 사이의 인터페이스를 식별하는 단계를 추가로 포함할 수 있다. 식별 된 관심 특징을 측정하는 단계는 인터페이스와 내강 가장자리 사이의 거리를 결정하기 위해, 즉 섬유 조직의 두 께를 결정하기 위해 인터페이스와 샘플의 가장자리, 그리고 루멘 가장자리와 샘플의 가장자리 사이의 거리를 측 정하는 단계를 포함할 수 있다. 섬유 캡은 괴사/지질 조직 위에 있는 섬유 조직으로 정의될 수 있다. 섬유조직의 이 서브세트(subset)의 경우 측정은 섬유 캡의 두께일 수 있다. 관상동맥의 이미지는 광간섭 단층촬영 이미지일 수 있다. 분석의 많은 적용이 있을 수 있다. 예를 들어, 이 방법은, 예를 들어 제4 신경망을 사용하여, 괴사 코어/지질 또는 칼슘 위에 놓인 섬유 조직일 수 있는 식별된 관심 특징 각각의 측정을 사용하여, 환자가 가까운 장래에 관 상동맥 질병의 특정 발현(manifestation)을 나타내거나 급성 심장 사건(예를 들어, 심장마비)을 가질 징후 (likelihood)를 결정하는 단계를 추가로 포함할 수 있다. 관상동맥 질병은 안정형 협심증(stable angina), 비- ST 상승 심근 경색( non-ST elevation myocardial infarction)(NSTEMI) 또는 ST 상승 심근 경색(ST elevation myocardial infarction)(STEMI)일 수 있다. 이러한 제4 신경망은 독립적인 계열 분류기(independent series classifier)일 수 있다. 제4 신경망은 각각의 분석된 이미지에 대한 식별된 관심 특징의 측정값 및 분석되지 않 은 각 이미지에 대한 공백 정보(blank information)를 입력으로 수신할 수 있다. 유일한 입력(들)은 측정(들) 및 공백 정보이므로 결정은 원래 환자 또는 후퇴 맥락 또는 혼란스러운 사건 후 발견과 독립적인 환자 표현을 식별하는 단계이다. 이것은, 예를 들어 프리젠테이션 관련 인공물로 인해, 동맥 입력의 컨텍스트에서 작업자 측정 및/또는 바이어스로 인한 바이어스를 제거함으로써 편향되지 않은 데이터를 기반으로 예측을 생성한다. 또 다른 적용은 예를 들어 약물 및/또는 기타 치료에 대한 반응으로 또는 관상동맥의 연구(자연사)로서 시간 경 과에 따른 관상동맥의 변화를 결정하는 것이다. 이미지 또는 이미지 세트는 제1 단계(예를 들어, 치료의 제1 단계)에서 환자의 관상동맥에 대한 제1 이미지 세트 또는 서브세트 및 적어도 제2의 후속 단계에서 환자의 관상 동맥 적어도 제2 이미지 세트 또는 서브세트를 포함할 수 있다. 환자의 이미지는 2개 이상의 단계 또는 시점 에서 획득/캡처될 수 있고, 이미지 또는 이미지 세트는 제1 단계, 제2 단계, 제3 단계, 제4 단계 등의 환자 이 미지를 포함할 수 있다. 제1 단계의 환자 제1 이미지 서브세트는 제1 시간(예를 들어, 치료의 첫 번째 단계 또 는 첫 번째 시점)에 캡처될 수 있고, 제2 이미지 서브세트는 적어도 제2 시간에 캡처될 수 있다(예를 들어, 치 료의 제2, 제3, 제4 또는 후속 단계, 또는 제2, 제3, 제4 또는 후속적인 시점). 방법은: 제1 이미지 세트(또는 서브세트)에 대해 식별된 관심 특징 각각에 대한 제1 측정 세트를 측정하는 단계; 적어도 제2 이미지 세트(또는 서브세트)에 대한 각각의 식별된 관심 특징에 대한 적어도 제2 측정 세트를 측정하는 단계; 및 제1 및 적어도 제2 측정 세트를 사용하여, 예를 들어 치료가 적용되는 치료의 효능과 관련될 수 있는, 관상동맥의 임의의 변화를 결정하는 단계를 포함한다. 따라서, 제1는 치료의 제1 단계이고 제2는 치 료의 제2 단계이다. 결정하는 단계는 임의의 시간/단계에서 캡처된 이미지를 사용하여 임의의 수의 측정 세트를 사용하여 수행될 수 있음이 이해될 것이다. 예를 들어, 환자의 관상동맥의 이미지 세트는 치료 과정의 시작, 치료 과정 중 하나 이상의 중간 지점 및 치료 과정의 끝에서 캡처될 수 있다. 이러한 이미지 세트(또는 이미지 와 관련된 측정 세트) 중 2개 이상을 비교하여 관상동맥의 변화를 결정할 수 있다. 예를 들어, 치료의 시작과 끝에서 이미지 세트는 비교될 수 있고, 또는 시작과 중간 지점, 또는 중간 지점과 끝, 또는 중간 지점 사이, 또 는 시작, 각 중간 지점과 끝 사이에서 비교될 수 있다. 임의의 2개 이상의 시점에서 캡처된 이미지의 2개 이상 의 세트 또는 서브세트를 사용하여 관상동맥의 임의의 변화를 결정할 수 있음이 이해될 것이다. 또 다른 적용은 환자의 진단 방법은: 환자의 관상동맥의 복수의 이미지를 수신하는 단계; 수신된 각 이미지에 대해: 질병 조직의 존재 또는 부재에 대해 제1 신경망을 사용하여 이미지를 분류하는 단계; 이미지가 병든 조직 이 있는 것으로 분류되면 제2 신경망을 이용하여 인공물의 유무에 따라 이미지를 분류하는 단계; 상기 분류에 기초하여 이미지 분석 여부를 결정하는 단계; 및 이미지가 분석될 때: 제3 신경망을 사용하여 처리된 이미지를 분석하여 섬유 조직과 괴사, 지질 또는 석회 조직 사이의 인터페이스를 식별하고; 섬유 조직(fibrous tissue) 또는 캡 두께를 측정하는 단계; 및 측정된 섬유 조직/캡 두께에 기초하여 환자를 진단하는 단계를 포함한다. 예를 들어, 진단은 제4 신경망, 예를 들어 하나 이상의 심장 질병을 가진 환자로부터의 측정에 대해 훈련된 신 경망을 사용하여 수행될 수 있다. 또 다른 적용은 하나 이상의 심장 질병(예를 들어, 안정형 협심증, 비-ST 상승 심근 경색증(NSTEMI) 또는 ST 상 승 심근 경색증(STEMI))이 있는 환자를 진단하는 단계 및 진단에 기초하여 환자를 치료하는 단계를 포함하는 환 자의 치료 방법이다. 유사하게, 다른 응용은 특정 심장 질병의 징후가 높은 것으로 예측된 환자를 치료하고 예 측에 기초하여 환자를 치료하는 방법이다. 당업자에 의해 이해되는 바와 같이, 본 발명은 시스템, 방법 또는 컴퓨터 프로그램 제품으로서 구현될 수 있다. 따라서, 본 발명은 전체 하드웨어 실시예, 전체 소프트웨어 실시예, 또는 소프트웨어와 하드웨어 측면을 결합한 실시예의 형태를 취할 수 있다.또한, 본 발명은 컴퓨터 판독 가능 프로그램 코드가 구현된 컴퓨터 판독 가능 매체에 구현된 컴퓨터 프로그램 제품의 형태를 취할 수 있다. 컴퓨터가 판독가능 매체는 컴퓨터 판독 가능 신호매체 또는 컴퓨터 판독 가능 저 장매체일 수 있다. 컴퓨터 판독 가능 매체는 예를 들어 전자, 자기, 광학, 전자기, 적외선, 또는 반도체 시스 템, 장치 또는 장치, 또는 전술한 것의 임의의 적절한 조합일 수 있지만 이에 제한되지 않는다. 본 발명의 동작을 수행하기 위한 컴퓨터 프로그램 코드는 객체 지향 프로그래밍 언어 및 종래의 절차적 프로그 래밍 언어를 포함하는 하나 이상의 프로그래밍 언어의 임의의 조합으로 작성될 수 있다. 네이티브 명령어 세트 의 직접적인 기계 명령어에서 고급 컴파일 또는 해석된 언어 구성까지, 코드 구성 요소는 절차, 방법 등으로 구 현될 수 있고 추상화 수준에서 명령 또는 명령 시퀀스의 형태를 취할 수 있는 서브 컴포넌트를 포함할 수 있다. 본 발명의 실시예는 또한 프로세서 상에서 구현될 때 프로세서가 여기에서 설명된 임의의 방법을 수행하게 하는 코드를 운반하는 비일시적 데이터 캐리어( non-transitory data carrier)를 제공한다. 본 발명은 또한 예를 들어 범용 컴퓨터 시스템 또는 디지털 신호 프로세서(DSP) 상에서 여기에서 설명된 방법을 구현하기 위한 프로세서 제어 코드(processor control code)를 제공한다. 본 발명은 또한 실행할 때, 특히 비 일시적 데이터 캐리어 상에서 여기에 설명된 임의의 방법을 구현하기 위한 프로세서 제어 코드를 운반하는 캐리 어를 제공한다. 코드는 디스크, 마이크로프로세서, CD- 또는 DVD-ROM과 같은 캐리어, 비휘발성 메모리(예를 들 어, 플래시) 또는 읽기 전용 메모리(펌웨어)와 같은 프로그래밍된 메모리 또는 광학 또는 전기 신호 캐리어 같 은 데이터 캐리어에 제공될 수 있다. 여기에 설명된 기술의 실시예를 구현하기 위한 코드(및/또는 데이터)는, 파이톤(python), C 또는 어셈블리 코드와 같은 응용 특정 집적 회로(Application Specific Integrated Circuit)(ASIC) 또는 필드 프로그램 가능 게이트 어레이(Field Programmable Gate Array)(FPGA)를 설정하거나 제어하기 위한 코드 또는 Verilog(RTM) 또는 VHDL(초고속 집적 회로 하드웨어 설명 언어)과 같은 하드웨어 설명 언어용 코드와 같은, 소스, 객체 또는 기존 프로그래밍 언어(해석되거나 컴파일된)의 실행 가능한 코드를 포함 할 수 있다. 당업자가 인식하는 바와 같이, 그러한 코드 및/또는 데이터는 서로 통신하는 복수의 결합된 컴포 넌트 사이에 분산될 수 있다. 본 발명은 마이크로프로세서, 작업 메모리 및 시스템의 하나 이상의 컴포넌트에 연결된 프로그램 메모리를 포함하는 제어기를 포함할 수 있다. 또한, 본 발명의 실시예에 따른 논리 방법의 전부 또는 일부가 전술한 방법의 단계를 수행하기 위해 논리 소자 를 포함하는 논리 장치에서 적절하게 구현될 수 있다는 것이 당업자에게 명백할 것이고, 그러한 논리 요소는 예 를 들어 프로그램 가능한 논리 어레이 또는 특정 응용 프로그램 집적 회로의 논리 게이트와 같은 구성 요소를 포함할 수 있다. 이러한 논리 배치는 예를 들어 고정 또는 전송 가능한 캐리어 매체를 사용하여 저장 및 전송 될 수 있는 가상 하드웨어 디스크립터 언어를 사용하여 이러한 어레이 또는 회로에서 논리 구조를 일시적으로 또는 영구적으로 설정하기 위한 요소를 활성화하는 데 추가로 구현될 수 있다. 일 실시예에서, 본 발명은 다중 프로세서 또는 제어 회로를 사용하여 구현될 수 있다. 본 발명은 장치의 운영 체제에서 실행되거나 통합될 수 있다. 일 실시예에서, 본 발명은 기능 데이터를 갖는 데이터 캐리어의 형태로 실현될 수 있고, 상기 기능 데이터는 기 능적 컴퓨터 데이터 구조를 포함하여 컴퓨터 시스템 또는 네트워크에 로드되고 그에 의해 작동될 때 상기 컴퓨 터 시스템이 여기에 설명된 방법의 모든 단계를 수행한다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1a는 복수의 이미지(image)(이미지 또는 이미지 프레임(mage frame) 세트라고도 함)가 캡처된 동맥 (artery)을 도시한다. 도시된 바와 같이, 이미지는 동맥의 길이를 따라 일정한 간격으로 캡처된다. 이미지의 수는 단지 예시적이고 이미지가 동맥 길이의 전체 또는 일부를 따라 캡처될 수 있음을 이 해해야 한다. 따라서 세트는 동맥의 길이를 따라 전체 또는 부분 풀백(pullback)을 나타낼 수 있다. 또한, 이미지 사이의 간격은 필요에 따라 변경될 수 있다. 도 1b는 동맥에서 캡처한 이미지를 캡처하고 처리하는 시스템을 개략적으로 보여준다. 이러한 이미지는 동맥의 내강(lumen) 내에 삽입되는 광간섭 단층촬영(optical coherence tomography)(OCT) 장치를 사용하여 캡 처될 수 있고 장치가 동맥을 통해 뒤로 당겨질 때 이미지가 캡처된다. 예를 들어, 20mm/s의 속도로 후퇴하 면 약 2.5초 동안 지속되며 약 72mm의 혈관을 이미징 할 수 있다. 아래에서 더 자세히 설명되는 바와 같이, 시 스템은 동맥의 내벽을 코팅하는 플라크 영역(plaque region)의 두께를 분석하는 데 사용될 수 있다. 개략 적으로 설명된 바와 같이, 동맥경화 플라크는 일반적으로 편심하고 구성이 다양하여 조직 특징(tissue featur e)의 시각화를 어렵게 만들 수 있다. OCT 장치는 OCT 정보가 카테터(catheter)의 음영 영역(shadow region )에서 캡처되는 것을 방지하는 가이드 카테터(guide catheter)를 포함한다. 또한, 아래에서 더 자세히 설명되는 바와 같이, OCT 정보가 인공물(artefact)의 음영 영역(shadow region)에서 캡처되는 것을 또한 방지하는 하나 이상의 인공물(artefact)가 있을 수 있다. OCT 프레임은, 예를 들어, 티어니 등 (Tearney et al)의 제이. 에이엠. 콜. 카디올(J. Am. Coll. Cardiol. 59, 1058-1072 )에 출판된 \"혈관 내 광간섭 단층촬영 연구의 획득, 측정 및 보고에 대한 합의 표준: 혈관내 광간섭 단층촬영 표준화 및 검증을 위한 국제 작업 그룹의 보고서\"에 설명된 대로, 표준 기술, 예를 들어 1250~1350nm 사이의 파장을 갖는 근적외 선을 사용하여 캡처할 수 있다. 캡처된 이미지는 별도 분석 장치(separate analysis device)에서 처리되거나 분석될 수 있고, 이는 예를 들 어 OCT 장치에 대해 다른 위치에 있을 수 있거나 OCT 장치에 적어도 부분적으로 부속될 수 있다(예를 들어, 환자에 인접하게 위치됨). 별도 분석 장치를 사용하면 원시 데이터가 더 빨리 처리될 수 있도록 더 강력한 리소스에 액세스할 수 있다. 로컬 프로세서(local processor)는 무선 연결이 없는 지역에서도 사용할 수 있다는 장점이 있다. 따라서 로컬 및 원격 처리가 모두 발생할 수 있다. 분석 장치는 예를 들어 서버와 같은 컴퓨팅 장치와 같은 하드웨어로 구현되거나 클라우드에서 구현될 수 있다. 분석 장치(analysis device)는 프로세서, 사용자 인터페이스(user interface), 저장소 (storage) 및 통신 인터페이스(communications interface)와 같은 표준 컴포넌트를 포함할 수 있다. 사용자 인터페이스는 터치 감지 디스플레이 스크린, 음성 입력, 키보드 입력 등을 포함하는 임의의 표준 인 터페이스일 수 있다. 유사하게, 저장소는 RAM 및/ROM을 포함할 수 있는 통상적인 메모리일 수 있다. 통신 은 와이파이(Wi-Fi), 블루투스(Bluetooth) 또는 유선 연결과 같은 임의의 적절한 프로토콜을 통해 이루어질 수 있다. 분석 장치는 장치에서 수행될 모듈을 저장하기 위한 저장소를 더 포함한다. 예를 들어, 저장 장치(3 2)는 장치가 동작할 수 있도록 하는 운영 체제 모듈(operating system module)을 포함할 수 있다. 저장소 는 또한 아래에서 설명되는 바와 같이 이미지로부터 인공물을 제거하는 데 사용될 수 있는 인공물 모듈 (artefact module)을 포함할 수 있다. 또한, 후술하는 바와 같이 플라크 영역(예를 들어, 섬유 조직 층)과 밑에 있는 층 사이의 인터페이스를 결정하거나 획득하기 위한 측정 모듈(measurement module)이 있을 수 있 다. 또한 측정 모듈로부터의 측정을 사용하여 아래에 설명된 바와 같이 다양한 예측을 하는 예측 모듈(predict module)이 있다. 또한, 이하에 설명되는 바와 같이 각 프레임을 분류하는 데 사용되는 프레임 단위 모듈 (frame-wise module)이 있을 수 있다. 인공물 모듈, 측정 모듈, 예측 모듈 및 프레임 단위 모듈 각각은 신경망 또는 기타 적절한 인공 지능 시스템으로 구현될 수 있고, 적절한 입력이 제공되는 경우 각 각은 다른 것들과 독립적으로 작동할 수 있다. 즉, 입력은 피어 신경망(peer neural network)에서 올 필요는 없지만 다른 제품이거나 독립적으로 유용한 최종 출력을 생성할 수 있다. 도 1b의 시스템은 심층 신경망(deep neural network)을 사용하는 OCT 기반 동맥 동맥 경화 플라크 분석(OCT- based coronary atherosclerotic plaque analysis)을 위한 완전히 독립적인 모듈식 다중 측정 자동 분석 시스 템으로 간주될 수 있다. OCT 이미지를 분석하는 데 사용되는 세 가지 툴은 인공물 모듈(artefact module)(인공 물 식별자라고도 함), 측정 모듈 및 예측 모듈(프리젠테이션 예측기(presentation predictor)라고도 함)이다. 아래에서 더 자세히 설명하는 것처럼, 입력은 마이크론 수준 측정 및 컨텍스트 없는 분류를 생성하기 위해 분석 되는 전체 동맥 풀백(whole artery pullback)을 포함된다. 도 1c는 위의 시스템을 사용하여 구현할 수 있는 이 미지를 처리하거나 분석하는 방법을 보여준다. 제1 단계(S100)에서, 이미지의 입력 풀백 세트가 수신된다. 이 미지는 위에서 설명한 바와 같이 환자의 동맥 내에 있는 이미징 시스템에서 획득할 수 있다. 이미지 세트는 환 자의 동맥의 섹션을 따라 촬영된 표준 수의 이미지를 포함할 수 있고, 예를 들어 일부 공지된 장치의 경우 이것 은 270개의 이미지이지만 이것이 단지 예시적인 수라는 것을 이해할 수 있을 것이다. OCT 장치에 의해 캡처 된 동맥의 벽(wall)의 이미지를 보여주는 도 2a에 도시된 것과 같은 단일 프레임이 이미지 세트로부터추출될 수 있다(단계 S102). 일반적으로, OCT 이미지는 회색조로 캡처되지만 임상의가 이미지를 더 쉽게 검토 할 수 있도록 이미지에 잘못된 색상을 적용할 수 있다. 예를 들어, 이 이미지에는 이미지에 주황색이 적용되어 있고 이는 표준이 아닌 특정 OCT 제공업체의 선택일 뿐이다. 다른 OCT 공급자는 항상 회색 OCT 프레임을 생성한 다. 그런 다음 입력 이미지의 선택적 초기 프레임별 분류가 있어 이미지를 세 가지 범주 중 하나에 배치할 수 있다: 질병 존재(disease present), 질병 부재(disease absent)(즉, 건강한) 또는 총체적 인공물(gross artefact)(즉, 전체 프레임에 걸친 인공물). 전체 인공물은 스텐트 및/또는 가이드 카테터와 같은 큰 '구조적 (architectural)' 인공물로 인해 발생할 수 있다. 초기 프레임별 분류는 적절하게 훈련된 신경망에 의해 수행될 수 있다. 이러한 초기 프레임별 분류는 스크리닝 단계의 역할을 할 수 있고 질병으로 나타날 수 있는 주요 프 레임 구성 요소를 찾을 수 있고 포함된 경우 후속 처리에서 잘못된 측정을 유발할 수 있다. 이러한 총체적 인 공물은 아래에 설명된 샘플링을 적용한 후보다 전체 프레임의 더 큰 맥락에서 식별하는 것이 더 쉬울 수 있다. 프레임 와이즈 분류기는 3개의 그룹으로 프레임을 허용할 수 있다. 프레임별 분류는 질병의 특성과도 관련될 수 있다. 예를 들어, 샘플은 또한 관심이 없는 질병, 예를 들어 별도 의 섬유 조직 오버레이(separate fibrous tissue overlay)가 없는 병리학적 내막 비후(pathological intimal thickening)를 나타내는 것으로 분류될 수 있다. 이러한 방식으로 분류되는 프레임은 \"건강한\"이라는 우산 분 류 하에 속할 수 있다. 대안적으로, 이러한 프레임은 프레임의 정보를 측정하려는 시도가 아래에 설명된 바와 같이 수행될 때 식별될 수 있다. 시도가 실패하면, 예를 들어 조직-조직 인터페이스(즉, 섬유 조직( fibrous tissue) 및 괴사 조직(necrotic tissue))이 없기 때문에 프레임(또는 프레임 내의 샘플)이 이 분류에 따라 분류 될 수 있다. 그런 다음 프레임별 분류를 사용하여 프레임을 추가로 처리할지 여부를 결정한다(단계 S106). 프레임의 추가 처리가 필요하지 않은 경우, 방법은 프레임 세트의 다른 입력 프레임을 고려하기 위해 단계 S102로 루프백할 수 있다. 예를 들어, 건강한 것으로 분류된 프레임 또는 전체 인공물이 있는 것으로 분류된 프레임은 둘 다 유용 한 정보가 없는 것으로 간주될 수 있으므로 더 이상 처리되지 않을 수 있다. 그러나 이러한 프레임이 더 이상 처리되지 않기 전에 3개의 연속 프레임이 정상으로 분류되어야 한다는 요구 사항이 있을 수 있다. 더 이상 처리 되지 않는 이러한 프레임은 무시되거나 폐기되는 것으로 간주될 수 있다. 그러나, 이러한 버려지는 프레임은 최종 예측 단계에 프레임 집합이 입력될 때 공백으로 표시될 수 있다. 따라서 예측 모듈에 대한 입력은 질병 정도에 관계없이 모두 동일한 세로 차원이다. 질병을 포함하지 않는 프레임을 식별하는 것은 효율성/속도에 유 용할 수 있고, 즉, 형상 측정과 같은 후속 처리는 전체 후퇴보다는 질병이 있는 프레임 시퀀스에 대해서만 수행 될 수 있다. 또한 임상의에게 표시할 라벨링 프레임과 같은 이러한 총 분류의 다른 접선 용도가 있을 수 있다. 또한, 스텐트, 카테터 또는 분기/분기와 같은 지배적인 구조적 특징을 갖는 것으로 식별된 이미지는 예를 들어 스텐트 삽입 전과 3개월 후와 같이 서로 다른 시간에 찍은 동일한 동맥의 풀백을 정렬하는 데 유용할 수 있다. 질병 존재로 분류된 프레임에는 보정 가능성이 있는 국소(더 미세한) 인공물이 있을 수 있다. 따라서 이러한 프 레임은 추가로 처리된다. 다음 단계(S108)는 도 2b에 개략적으로 도시된 바와 같이 벽 용기를 가상으로 펴서 수용된 프레임을 재구성하는 것이다. 도면과 같이, 모양은 동맥을 평평하게 펼치기 위해 세로로 한 번 잘라낸 모양과 비슷한다. 이 재구성으로 인해 도 2c와 같이 일련의 균질한 정렬된 평평한 스트립(flat strip)이 생성 된다. 따라서 재구성은 수신된 프레임을 복수의 샘플(또는 스트립 (strip) 또는 세그먼트(segment) - 용어를 서로 바꿔서 사용할 수 있음)으로 샘플링하거나 추출하는 샘플링 단계로 간주될 수 있다. 샘플은 조직 인터페 이스(즉, 내강 가장자리(luminal edge)에 대한 내강일 수 있는 정렬된 기준선(baseline)을 따라 일관되게 위치 된다. 각 세그먼트는 마이크론 크기, 예를 들어 약 80μm의 폭을 가질 수 있다. 이러한 정렬은 신경망이 샘플 을 입력으로 수신할 때 네트워크가 OCT 광 수용체( light receptor) 및 그 움직임과 같은 관련 없는 특징보다는 작업(예를 들어, 동맥 질병 학습)에 집중할 수 있도록 한다. 그 다음, 샘플들 중 적어도 하나는 도 3a 내지 도 3h와 관련하여 더 상세히 설명된 바와 같이 분류될 수 있다(단계 S110). 이 지역 분류에는 각 샘플에 인공물이 있는지 여부를 결정하는 것이 포함될 수 있다. 샘플은 인공물이 없는 것, 보정 가능한 인공물이 있는 것 또는 보정 불가능한 인공물이 있는 것으로 분류될 수 있다. 다음 단계는 이러한 프레임을 추가로 처리할지 여부를 결정하는, 즉 이미지 내의 특징을 측정할지 여부를 결정하는 단계일 수 있다(단계 S112). 사용할 수 없는 프레임 및/또는 샘플을 제거하는 이러한 단계는 이미지를 청소하기 위한 전처리로 간주될 수 있 다. 각 OCT 프레임의 마이크론-크기 조직 영역은 예를 들어 세포벽을 분류하고/하거나 섬유질 세포 두께를 측정 하기 위해 아래에 설명된 바와 같이 처리될 수 있다. 도시된 바와 같이, 관련 없는 내강 공간은 효과적으로 폐기될 수 있지만 전체 기본 OCT 해상도를 사용하여 동맥 벽을 분석할 수 있다. 각각의 분절에 대해, 섬유질 캡 조직과 밑에 있는 층(예를 들어, 괴사성 코어 또는 칼슘) 사이의 인터페이스 이 결정될 수 있다. 인터페이스는 각 조직 컴포넌트에 대한 개별 측정 벡터의 하나의 특징일 수 있다. 조 직 평면의 식별은 이전에 가장자리 검출기(edge detector)로 시도되었다. 도 2d와 같이 왼쪽 세그먼트는 OCT 이 미지에서 흐릿하게 나타나는 오른쪽 세그먼트보다 가장자리가 더 정의되어 있다. 더 명확한 가장자리의 경우에 도 섬유 조직 아래의 칼슘은 내부 탄성 막(internal elastic lamina), 가이드 와이어(guide wire) 및 기타 인 공물과 가장자리-그레디언트 특성(edge-gradient properties)을 공유하므로 가장자리가 잘못 식별될 수 있다. 또한, 전형적인 가장자리가 없는 섬유질 조직과 지질이 풍부한 코어 사이의 인터페이스를 갖는 세그먼트의 경우 가장자리 검출이 효과적이지 않을 수 있다. 이 방법에서 신경망은 벡터의 인터페이스 및 기타 특징을 결정하는 데 사용될 수 있다. 예를 들어, 기르쉬크(Girschick)가 2015년에 발표한 빠른 R-CNN(Fast R-CNN)에 설명된 것과 같은 회귀 경계 박 스 접근 방식을 사용하는 신경망은 섬유 조직과 괴사 조직 사이 또는 섬유 조직과 석회 조직 사이의 인터페이스 를 식별하는 데 사용할 수 있다(각각 연성 또는 강성 가장자리 그레디언트에 대응하는). 위에서 설명한 바와 같 이 모든 샘플(즉, 네트워크 입력)은 동일한 크기이고 원본 이미지와 비교할 때 단순화된 이러한 이미지 세그먼 트의 사용은 더 간단한 신경망을 사용할 수 있음을 의미한다. 예를 들어, 신경망은 대략 15개의 층(layer)을 가질 수 있다. 도 2e를 참조하면, 관심 거리는 섬유 조직과 하부 층 사이의 내강 가장자리(lumen edge) 아래 섬유 조직의 두께 d이다. 섬유질 조직(즉, 플라크 영역)은 내강 및 인터페이스(interface)(또는 기저 측부 가장자 리(abluminal edge)에 의해 경계를 이룬다. 내강 경로 주위의 내강 및 알루미날 가장자리 둘 다를 교차하고 OCT 장치의 중심(즉, 광원의 중심)의 인덱스 위치에서 시작되는 스캔 라인에 대해 유효한 두께가 허용되었 다. 이러한 측정은 일반적인 임상의 측정을 에뮬레이트한다. 회귀 네트워크는 일반적으로 각 샘플의 상단, 즉 내강 가장자리에 가장 가까운 각 샘플의 짧은 가장자리로 선택 될 수 있는 고정된 랜드마크에 대한 측정값을 생성한다. 도 2d로 돌아가면, 회귀 네트워크는 샘플의 상부로부 터 내강 가장자리까지의 가장자리 거리 A 및 샘플의 상부로부터 섬유질 조직과 하부 층 사이의 인터페이스 (interface)(또는 기저 측부 가장자리)까지의 인터페이스 거리 B를 측정할 수 있다. 픽셀 단위의 섬유질 캡 두께는 가장자리 거리 A와 인터페이스 거리 B 간의 차이로 추정된다. 픽셀 거리(pixel distance)는 출력을 표준화하기 위해 각 장비 제조업체에 대한 각 풀백의 임상의 보정을 사용 하여 마이크론 거리로 변환되었다. 평균 캡 픽셀 강도는 내강과 조직 인터페이스 지점 사이의 스캔 라인 벡터 (즉, 거리 d)의 평균으로 취한 반면 가장자리 유형은 각 샘플 분류의 표현이다. 또한, 예를 들어 표준 20픽셀 최단 치수일 수 있는 각 세그먼트에 대한 치수에 의해 프레임에서 식별된 병든 샘플의 수(즉, 세그먼트의 수)의 곱을 사용하여 병든 내강 둘레를 계산할 수 있다. 두 측정 간의 차이를 계산할 때 단지 몇 픽셀의 오차가 섬유 질 두께의 측정에 상당한 영향을 미칠 것이라는 점을 이해할 수 있을 것이다. 신경망을 사용하면 다른 알려진 기술과 비교할 때 이러한 측정의 정확도가 향상될 수 있다. 이러한 방식으로 조직 샘플 분류와 관심 조직 평면의 외삽 매핑(extrapolative mapping)을 결합한 정확한 회귀 측정 툴(regression-measurement tool)을 사용할 수 있다. 따라서 방법은 관심 특징을 측정하는 단계를 포함할 수 있다(단계 S110). 추출된 회귀 측정 및 파생된 메트릭은 섬유질 캡 두께(FCT), 섬유질 조직 강도, 플라크 조 성, 내강 면적 및 병든 내강 둘레를 포함할 수 있다. 도 1c에서 볼 수 있듯이 인터페이스(또는 관심 있는 다른 특징)가 측정된 후 프로세스는 다른 입력 프레임을 추출하고 다음 프레임에 대해 추출 및 보정 단계를 반복하기 위해 되돌아갑니다. 이것은 완전 풀백 세트의 전체 또는 일부 프레임에 대해 반복될 수 있다. 따라서 프레임 측정 벡터는 각 풀백에 대해 단독으로 또는 조합하여 분류 가능한 특징을 생성하는 각 유형에 대해 연결될 수 있다. 도 2f는 하나의 병변에 해당하는 풀백 영역에 걸쳐 각 프레임의 샘플을 평균화하는 정렬된 샘플의 평균을 보여 준다. 도 2f는 그래프 상단에 내강 가장자리가 있는 도 2c에 표시된 것과 유사한 평균의 펼쳐진 표시이다. 화 살표는 가이드 와이어 음영 영역을 나타낸다. 도 2g는 도 2f와 동일한 영역에 대한 주의 맵(attention map)을 보여준다. 도 2f에 도시된 플롯과 같이, 주의 맵은 도 1c에 도시된 측정 단계(단계 S114)를 수행하는 신경망에 의해 생성될 수 있다. 도 2f와 2g는 모두 연 결된 측정 벡터의 예이다.각 프레임에 대한 모든 측정값이 결정되면 각 프레임의 패딩된 측정 벡터를 연결하여 풀백에 대한 유효한 측정 값을 나타내는 단일 입력 어레이(또는 풀백 측정 시퀀스)를 생성할 수 있다. 각각의 마지막 차원(채널)은 각각 의 개별 측정 유형(예를 들어, 캡 두께, 캡 인터페이스 유형, 픽셀 강도)에 대한 맵을 제공하는 것으로 간주될 수 있다. 위에서 설명한 바와 같이, 측정되지 않은 이미지(예를 들어, 깨끗한 건강한 이미지)를 나타내기 위해 공백 입력이 포함될 수 있다. 예를 들어, 순환 신경망(recurrent neural network)(RNN)은 이 상당히 작은 입력 (전체 3D 풀백에 비해)과 함께 사용되었으며, 이는 측정값을 시리즈로 명시적으로 처리함으로써 이점을 얻는다. RNN은 장단기 메모리(Long Short-Term Memory)(LSTM) 셀을 포함할 수 있고 원래 풀백의 이미지 수와 동일한 수 의 시간 단계를 갖는 아키텍처를 가질 수 있다(예를 들어, 270개의 이미지가 있는 경우 r 270개의 시간 단계). 또한 중간 셀 드롭아웃 래퍼 층(cell dropout wrapper layer)이 있을 수 있고 출력은 단일 밀집 층(single dense layer)을 통해 나올 수 있다. 예측 모듈의 성능은 근위 병변에 의해 가장 큰 영향을 받을 가능성이 높고, 이들은 급성 동맥 사건의 70%를 담 당하므로 원위부 질병은 동일한 의미를 갖지 않는다. 이것은 근위부 질병이 더 많은 심장 근육이 죽기 때문에 더 큰 심장 마비를 의미하고 근위부 LAD 병변이 치명적인 동맥 사건의 대부분을 차지하는 것으로 생각되기 때문 에 설명될 수 있다. 이 문제를 설명하는 예시 논문은 제이에이씨씨 카디오바스크. 이미징 3(JACC Cardiovasc, imaging 3), 168-175에 게재된 피이이지 등(Fiiji et al)의 \"고유 관상동맥에서 얇은 캡 섬유종종 분포 평가(Assessment of Thin-Cap Fibroatheroma Distribution in Native Coronary Arteries)\"이다. 도 3a는 단면 OCT 이미지의 세 위치가 표시된 동맥의 단면 이미지 및 측면도를 모두 보여준다. 제1 이미 지는 동맥이 병든 위치에서 촬영되어 도 3b에 도시된다. 제2 이미지는 보정 가능한 인공물 (correctable artefact), 예를 들어 도 3c에 도시된 이미지 상의 6시와 10시 위치 사이의 대부분의 광을 감쇠시 키는 소용돌이로 보이는 중간 내강 잔류 혈액(moderate lumen residual blood)이 있는 위치에서 촬영된다. 보 정 가능한 인공물은 손상된 내막 표면, 국소 잔류 내강 혈액 또는 분기점에서 혈관 벽 사이에 끼어 있고 광원을 약화시키고 인접 조직을 음영 처리하는 측가지에서 발생할 수 있다. 이러한 보정 가능한 인공물의 예는 도 4a 에서 4d에 나와 있다. 이러한 보정 가능한 인공물은 일반적으로 병든 부분의 모든 프레임의 0.90%를 구성한다. 제3 이미지는 보정 불가능한 인공물이 있는 위치에서 촬영되고 도 3d에 도시된다. 이 예에서 보정 불가능 한 인공물은 가이드 카테터 내의 획득을 포함하고 도시된 바와 같이 모든 빛은 카테터 튜브에 의해 감쇠된다. 카테터 외부의 조직에 대한 정보를 얻을 수 없으므로 보정의 근거가 되는 데이터가 없기 때문에 보정이 불가능 한다. 보정 불가능한 인공물 및 건강한, 즉 질병이 없는 혈관의 이미지는 인공물 보정 시 제1 단계에서 제외된 다. 인공물을 식별하고 보정하기 위해 신경망을 포함하는 인공물 모듈이 사용될 수 있다. 입력은 저해상도 256x256x3 프레임 트리플렛(triplet)일 수 있고 이는 주요 구성 컴포넌트(스텐트, 가이드 카테터, 가지/분기), 플라크 유형(지질, 석회화 또는 내막 비후를 포함한 정상 혈관) 및 내강 인공물(총 내강 잔류 혈액(gross luminal residual blood) 및 혈전(thrombus))의 존재 여부에 따라 분류될 수 있다. 예를 들어, 7x7x3 커널과 다른 모든 층에 대해 3x3x3이 뒤따르는 6층 컨볼루션 아키텍처가 사용될 수 있다. 아키텍처는 1,2,2,1,1의 스 트라이드(stride)와 초기 64개의 필터를 가질 수 있고, 필터 수를 두 배로 늘리면서 두 층마다 스트라이드 공간 축소(strided spatial reduction)를 반복하여, 1000개 단위의 완전히 연결된 층으로 마무리한다. 네트워크는 특 정 수의 샘플 프레임, 예를 들어 300개에 대한 감독된 훈련에 의해 훈련될 수 있고, 그 다음 임시 분류에 대한 보정으로 해당 프레임에 대한 후속 재훈련과 함께 임시적으로 프레임을 분류하는 데 자체적으로 사용된다. 상술한 바와 같이, 개별 프레임은 복수의 샘플로 재구성될 수 있다. 이것은 다수의 샘플(윈도우라고도 함)이 내강에서 동맥벽으로 바깥쪽으로 연장되는 가장 긴 가장자리를 가진 내강 주위에서 획득되는 방법을 보여주는 도 3e에 설명되어 있다. 이 예에서는 20 x 144 픽셀 창을 사용할 수 있다. 이 샘플은 나중에 측정할 수 있도 록 공간 정보 손실 없이 일반화된 훈련 목표를 제공한다. 도 3f는 도 3e에서 31, 32 및 33으로 표시된 이러한 개별인 것 중 3개를 보여준다. 샘플 인공물은 기본 조직이 감지되었는지 여부에 따라 보정 가능 또는 보정 불가능으로 간주된다. 예를 들어, 보정 불가능한 샘플에는 혈액이 내강을 완전히 채워 모든 OCT 신호를 감쇠하는 반면, 일반적으로 샘플의 절반 미만을 포함하는 국소 혈액 음영(focal blood shadowing) 또는 저조도는 복구 가능한 샘플이 포함되었다. 보정 불가능한 샘플은 종종 이미지가 캡처되는 지점에 스텐트 또는 가이드 카테터가 있기 때문에 발생한다. 이러한 지배적인 구조적 특징은 가이드 카테터의 일부만이 프레임에 나타나는 경우, 즉 가이드 카테터 팁과 같은 제한된 상황을 제외하고는 일반적으로 보정 불가능한 인공물을 초래한다. 인공물의 유형을 확인하기 위해 존재하는 인공물로 분류되는 각 샘플에 대해 일관된 자동 인코더 잠재 공간 표현을 생성하는 14개의 시각적으로 구별 가 능한 서브 클래스(실험자에 의해 식별되고 낮은 특징 상관 관계로 식별됨) 중 하나를 사용할 수도 있다. 이 14 개 클래스는 아래에 설명된 대로 해당 샘플을 복구하는 데 사용되는 생성적 적대 네트워크(generative adversarial network)에 해당한다. 예를 들어, 클래스는 \"부분 가이드와이어 음영 포함\" 및 \"광선 음영\"와 같이 이름이 지정될 수 있거나 이름이 지정되지 않을 수 있지만 서로 일관되게 구별할 수 있다. 보정 가능한 인공물이 있는 경우, 가변-자동 인코더 생성적 적대 네트워크(variational-autoencoder Generative Adversarial Network)(VA-GAN)의 생성적 암(arm)을 사용하여 샘플의 세부 정보가 복구되었고, 예를 들어 라센 등(Larsen et al)이 2015년에 발표한 \"학습된 유사성 메트릭을 사용하여 픽셀을 넘어 자동 인코딩\"에 설명되어 있다. . 각 훈련 샘플 클래스에 대한 시각적 속성 벡터는 생성기 잠재 공간(generators latent spac e)에 추가하기 위해 생성되었고, 벡터는 인공물이 있는 클래스의 모든 샘플 평균과 다른 모든 클래스 샘플의 평 균 간의 차이로 계산된다. GAN은 세부 사항과 공간 해상도를 유지하면서 측정을 위해 병에 걸린 표적(target)을 올바르게 재구성하는 데 사용되었다. 도 3g는 도 3f의 세 세그먼트의 보정을 보여준다. 보정 시도 실패로 보정 불가능한 인공물이 식별될 수 있다. 실패는 연속적인 좌우 섬유 조직 영역(예를 들어, 도 3g의 회색 영역)이 없는 보정 시도의 결과로 유추할 수 있 다. 따라서, 각 클래스에는 보정 가능한 인공물이 있는지 여부를 확인할 수 있는, 즉 보정이 작동했는지 여부 를 결정할 수 있는 첨부된 이진 분류기가 있을 수도 있다. 보정이 발생된 샘플은 도 3h와 같이 잘못된 샘플 대 신 원본 이미지에서 대체된다. 따라서 출력은 모든 샘플을 포함하는 완전한 이미지다. 개별 치수가 작은 도 3 에 표시된 것과 같은 여러 조직 샘플은 복원 결과가 양호하거나 거의 완벽할 수 있음을 의미한다. 도 4a에서 4d는 다양한 유형의 인공물을 보여준다. 도 4a는 혈액으로 인한 인공물을 보여주고 OCT 카테터 내에 서 아주 작은 플러시 되지 않은 혈액 방울로 인한 음영이 있다. 도 4b는 4시에서 5시 위치에서 그 아래에 음영 줄무늬를 드리우는 측가지(side branch) 내 동맥벽(arterial wall)의 돌출로 인한 인공물을 보여준다. 도 4c는 잔혈과 왼쪽 메인 스템(main stem)의 분기점이 결합된 인공물이다. (i) 라벨이 붙은 잔여 불분명한 혈액의 소 용돌이는 신호를 약화시켜 그 너머에 있는 구조의 양호한 시각화를 방지한다. 병든 동맥의 측정 가능한 부분은 (ii)로 표시된다. 도 4d는 또 다른 구조적 인공물이고 좌 전하행 동맥( left anterior descending artery), 중간동맥( intermediate artery), 곡굴동맥(circumflex artery) 사이 가지의 구멍에서 빛의 감쇠가 있다. 이러 한 인공물을 제거하거나 보정하면 학습을 위한 인공물을 기반으로 최소한의 특징 학습을 보장하는 동시에 예측 을 위해 조직을 가장 잘 표현할 수 있다. 도 5a ~ 5f는 안정형 협심증 환자와 비 ST 상승 심근 경색증(NSTEMI) 또는 ST 상승 심근 경색증 STEMI를 가진 환자를 구별하기 위해 도 1c의 마지막 단계에서 추출된 특징을 어떻게 사용할 수 있는지 보여준다. 도 5a는 비 교를 위해 각 그룹의 FCT 측정값의 100만(1e6) 무작위 샘플을 사용하여 NSTEMI 및 STEMI를 나타내는 환자의 섬 유질 캡 두께(fibrous cap thickness)(FCT) 측정 횟수를 보여주는 바이올린 플롯(violin plot)이다. 표시된 대로 모든 FCT 간격은 모든 환자 그룹에서 발생한다. 그러나 STEMI 환자는 전체 혈관에 걸쳐 STEMI에 대한 중 앙값 및 평균 FCT 측정값이 더 작았다. 비교는 아래 표에 나와 있다:"}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 5b는 NSTEMI를 나타내는 환자의 동맥 단면 이미지고, 도 5c는 STEMI를 나타내는 환자의 동맥을 통한 단면 이 미지다. 도 5d는 동맥의 길이에 따른 FCT 히트 맵의 플롯이고 NSTEMI를 나타내는 환자의 중앙 기준선에 정렬된 다. 표시는 도 5b의 이미지가 캡처된 위치를 나타낸다. 도 5e는 하위 섹션의 분해도와 함께 STEMI를 나타내는 환자의 동맥 길이에 따른 FCT 히트 맵의 플롯이다. 다시, 마크는 도 5c의 이미지가 캡처된 위치를 나타낸다. 도 5f는 안정형 협심증 환자의 중심 기준선에 맞춰 정렬된 동맥 길이를 따른 FCT 히트 맵의 플롯이다. 눈금 막 대는 미크론(μm)이다. 도 5d, 5e 및 5f에서 볼 수 있듯이 각 유형의 환자에 대한 특징적인 FCT 패턴이 있다. 예를 들어, STEMI 패턴 은 플라크 파열의 초점으로 작용할 수 있는 잘 구분된 얇은 영역과 두꺼운 영역 사이의 급격한 전환이 특징이다. 대조적으로, NSTEMI 및 협심증 환자 모두에서 더 점진적이거나 무작위로 분포된 FCT 전환(FCT transition)이 있다. 일반적으로 STEMI 환자는 NSTEMI 환자와 비교하여 고도로 국소화된 영역뿐만 아니라 전체 동맥을 따라 더 낮은 FCT를 보여준다. 이러한 패턴은 예측기 모듈이 심장 사건/질병의 유형을 식별할 수 있는 방법을 설명하기 위한 단순한 예일 뿐이다. RNN 네트워크는 심장 사건/질병의 유형을 가장 잘 구별하는 측정 시리즈의 자체 특징을 선택했다. 환자가 특정 유형의 심장 질병을 갖고 있다고 진단되거나 예측되면 치료 방법 이 환자에게 권장될 수 있다. 할 수 있는 또 다른 예측은 환자가 갑작스러운 심장 사건의 위험이 높은지 여부를 예측하는 것이다. 사망 징후 가 예측될 때 예측 모듈은 갑작스러운 심장 사건으로 사망한 환자의 이미지를 포함하는 적절한 데이터세트에 대 해 훈련될 필요가 있음을 인식할 것이다. 예를 들어 \"취약한 플라크(Vulnerable Plaque)에 보고된 바와 같이: 제이. 인터브. 카르디오.(J. Interv. Cardio) 15, 439-446 에 게재된 파르브 등(Farb et al)의 \"불안정 한 동맥 병변의 병리학(Pathology of Unstable Coronary Lesions)\" 조직병리학적 사례 시리즈에서 65μm 미만 의 섬유질 캡 두께는 심장 돌연사와 관련이 있다. 도 6a ~ 6h는 임상의가 OCT에서 FCT 측정으로 결정한 FCT 측정의 성능을 비교한다. 후자는 단일 동맥, 인공물 및 해상도 한계에서 소음과 플라크를 구별하는 데 어려움 이 있기 때문에 큰 데이터세트가 어렵다. 도 6a는 편심 섬유종(eccentric fibroatheroma) 지점에서 생체 외에서 사후 획득한 OCT 이미지를 보여준다. 도 6b는 도 6a와 함께 등록된 섬유종종의 조직학적 단면이고 도 6c는 도"}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "6b에 요약된 영역의 고배율 뷰이다. 도 6d는 사후 생체 획득 OCT 이미지의 공동 등록된 조각에 대한 조직학에서 수동으로 측정된 FCT와 비교하여 위 에서 설명한 방법으로 계산된 가장 작은 10개의 FCT 측정을 표시한다. 이 예에서, 사후 데이터세트는 14개의 인 간 좌전하행 동맥에서 수집되었다. 환자의 평균 연령은 71.1±11.8세였으며, 사망의 원인은 비폐쇄성 심혈관 질 병이 57.1%였고 나머지는 비심혈관 질병이었다. 연구 프로토콜은 친척의 동의를 받아 Cambridgeshire 연구 및 윤리 위원회 07/H0306/123의 승인을 받았다. OCT는 구조적 무결성을 위해 40mm의 주변 물질로 수집된 절제된 조 직에서 수확 후 48시간 이내에 수행되었으며 4°C 인산염 완충 식염수에 보관되었다. 측가지를 결찰하고 혈관을 재가온하고 가이드 카테터를 왼쪽 동맥 구멍에 봉합했다. 0.014\" 애봇 바스큘라 BMW 유니버설(Abbott Vascular BMW Universal) 또는 파일롯(Pilot) 50 가이드 와이어는 맞춤형 장비에 카테터를 전달하는 데 사용되었다. OCT 이미징은 25.0mm/s 자동 풀백을 사용하여 드래곤플라이 C7(DragonFly C7) 카테터(에스티. 주드 메디칼(St. Jude Medical))로 100mmHg에서 식염수 압력 관류로 수행되었다. 이미징 후 동맥을 24시간 이상 10% 완충 포르말린에 고정한 다음 동맥을 따라 5mm마다 관심 영역을 정의하고 400μm마다 5μm 섹션을 채취하고 소공에 대해 세로 방향을 유지하면서 레이블을 붙였다. 조직학적 섹션은 두 명의 임상의가 측정하기 전에 헤마톡실린-에오신과 Van Gieson으로 염색했으며, 각 측정값은 경험 많은 심장 병 리학자가 무작위 순서로 검토했다. 섬유질 캡 두께는, 예를 들어 비르마니 등(Virmani et al)의 아르테리오스클 러. 크롬. 바스크. 비올.(Arterioscler. Thromb. Vasc. Biol.)의 20, 1262-1275 에 에 게재된 \"갑작스 러운 동맥 사망에서 배움: 동맥경화 병변에 대한 포괄적인 형태학적 분류 체계\"에 설명된 대로 림프구 또는 대 식세포에 의해 어느 정도 침윤된 평활근 세포 층의 두께에 의해 결정되었다. 측정은 초기에 지질이 풍부한 코어에 대해 200μm 간격으로 원주 거리에 대해 수행되었고, 정확히 동일한 평면을 따라 지질 코어와 접촉하는 (탈)석회화된 영역을 포함하여 뚜렷한 평활근 평면이 감지할 수 있었다. 지질과 인접한 석회화를 나타내는 영역 은 \"취약한 플라크\"에 기술된 바와 같이 확산 또는 조각화딘 석회질 판을 나타내는 파열의 30~35% 사이로 포함 된다: 비르마니 등(Virmani et al)의 제이. 인터브. 카디올. 15, 439-446에 게재된 \"불안정한 동맥 병변 의 병리학(The Pathology of Unstable Coronary Lesions). 조직학(Histology)은 처음에 가이드 카테터에서 OCT의 엄격한 해당 거리까지의 각 5mm 간격에 대해 OCT에 공동 등록된 다음, 해당 지점에서 각 400μm에 공동 등록되었다. 각 OCT 프레임에는 아래에 설명된 바와 같이 조직학 과 비교하기 위해 트리플렛(triplet)을 형성하기 위해 양쪽에 두 개의 프레임이 수반되었고, 두 양식에 특정한 인공물에 관계없이 공동 등록에 대해 엄격하게 관찰된 시스템이 있다. 무작위로 선택된 공동 등록 조직학적 섹 션 중 155개(75%)를 사용하여 소프트웨어의 섬유질 캡 두께 측정을 교정한 다음 제외되고, 나머지는 검증 연구 의 일부를 형성하는 데 사용했다. 특정 관심 영역 분류기를 훈련하는 데 생체 외 데이터가 사용되지 않았다. 도 6e는 조직학에서 수동으로 측정한 FCT와 비교하여 위에서 설명한 방법으로 계산된 FCT 측정값 간의 차이를 보여주는 다양한 평균 FCT를 가진 블랜드-알트만(Bland-Altman) 플롯이다. FCT는 두 기술을 모두 사용하여 유사했고(86.6±65.12μm 대 91.6±53.2μm p=0.355), 측정값 간에 좋은 상관관계가 있었다(r=0.90, p<0.001). 도 6f는 동일한 사후 프레임 및 임상 시험 환자로부터 무작위로 선택된 80개의 프레임(임상인 클래스 내 상관관 계=0.84 [0.69-0.92])을 사용하여 연구 OCT 측정에 경험이 있는 다른 센터의 독립적인 컨설턴트 심장 전문의가 수동으로 FCT와 비교하여 위에서 설명한 방법으로 계산된 FCT 측정 사이의 차이를 보여주는 다양한 평균 FCT가 있는 블랜드-알트만(Bland-Altman) 플롯이다. 다시, 자동 및 수동으로 측정된 FCT는 유사했다(121.8±70.4μm 대 124.2±74.9μm p=0.2621). FCT 측정은 알고리즘에서 볼 수 없는 사후 병변의 30 OCT 프레임 외에도 100개 의 개별 동맥에서 OCT 풀백에 대해 임상의에 대해 검증되었다. 비교를 위해, 도 6g는 두 명의 다른 임상의의 FCT 측정을 표시한다. 상관관계는 양호하나 위에서 설명한 방법 을 사용하여 자동으로 획득한 FCT가 86.9%의 경우에서 조직학적 FCT에 더 가까웠다. 이 방법에 의해 제공될 수 있는 또 다른 예측은 심근 경색의 징후이다. 이것은 혈전증 및 기립 혈액 기둥과 같 은 사건 후 내강 내 특징을 생성하는 동맥경화 플라크의 파열 또는 침식으로 인해 발생할 수 있다. 범인 혈관 은 종종 스텐트 삽입되지만 스텐트 세그먼트의 상류 및 하류에 플라크가 있으면 추가 이벤트가 발생할 수 있다. 위에서 사용한 방법은 섬유질 캡의 두께만을 분석하기 때문에 컨텍스트에 독립적이고, 따라서 다단계 분류기가 사용하는 컨텍스트 독립적 특징은 혼란스러운 요소에 대한 수정을 제공할 수 있다. 도 6h는 같은 날 다른 시간에 FCT를 측정했을 때 평균 FCT의 변화를 보여주는 플롯이다. 같은 날 25명의 환자를 대상으로 반복적인 풀백을 분석한 결과 IVI2M 유도 평균 전체 동맥 FCT(154.1±22.3~158.3±25.08 p=0.41)에서 유의한 차이가 없었다. 도 7a 및 7b는 스텐트 삽입 전 및 스텐트 삽입 후 STEMI를 포함하여 가장 어려운 임상 상황에서 다단계 분류기 의 성능을 검사한다. 스텐트 시술 전과 스텐트 시술 후에 시행한 반복성 연구의 경우, 스텐트는 항진성 생체흡 수성 혈관 골격(everolimus-eluting bioresorbable vascular scaffold)이었다. 스텐트 시술 전후 또는 스텐트 시술 후 동일한 동맥에 대한 반복 연구가 수행되었다. 이 비교를 위해, 다단계 OCT 연구(PCI 전후 및 3개월에 다시)를 위해 계획된 18명의 환자(54.7±7.8세, 88.8% 남성)의 63개 전체 풀백이 반복성 연구를 위해, 무손실 TIFF 파일, 개별 다중 프레임으로 내보내졌다. 각 환자는 같은 날(PCI 전후)에 2번, 3개월에 1번, 총 3번의 풀 백을 받았다. 가이드 카테터와 스텐트가 포함된 혈관의 일치된 부분을 보여주는 이미지만 제외되었고, 후자는 포스트 PCI 풀백에서 스텐트 세그먼트를 표시하는 프레임 수, 다음으로 가장 가까운 수탁지점(fiduciary poin t)까지의 프레임 수를 카운팅 하여 수동으로 수행하고, PCI 이전 풀백에서 수탁 지점에서 스텐트 시작까지의 프 레임 수와 제외할 정확한 프레임 수를 결정한다. 스텐트 세그먼트 및 가이드 카테터를 제외하고, 인공물의 심각 도에 관계없이 이미지 배제가 이루어지지 않았다. 도 7a는 평균 FCT 측정 후 스텐트와 사전 스텐트를 보여준다. 도 7b는 스텐트 시술 후 3개월과 스텐트 시술 직후 측정한 평균 FCT를 보여준다. 결과는 아래 표에 나와 있고 위에서 설명한 자동 방법을 사용한 결과의 재 현성을 나타내는 것과 유사하다:"}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "위에서 설명한 바와 같이 신경망은 OCT 이미지의 분석에 사용된다. 도 8은 신경망을 통합한 여러 시스템의 성 능을 도 1c에서 설명한 방법과 비교한다. 제1 비교 시스템은 기준선 분류기(baseline classifier)라고 하고 관 상동맥의 원시 용적 데이터로 환자 프리젠테이션의 분류기를 생성하기 위해 최신 3D 컨볼루션-잔차 신경망을 사 용했다. 제2 비교 시스템은 국소 기준선 분류기(focussed baseline classifier)라고 하고 2단계 네트워크였다.두 분류 모두 안정형 협심증(stable angina)(SA), ST 상승 심근 경색증(STEMI) 및 비-ST 상승 심근 경색증 (NSTEMI)을 나타내는 환자에 대해 검증되었다. 다단계 분류기는 사후(post-mortem), 두 명의 임상의 및 반복성 데이터세트에 대해 추가로 검증되었다. 제1 단계에서는 위에서 설명한 것과 유사한 방식으로 인공물이 식별됐 다. 보정 가능한 인공물은 보정되었고 보정 불가능한 인공물은 제거되었다. 제2 단계에서, 일관된 측정 또는 분류를 위해 나머지 이미지를 위에서 설명한 대로 샘플링하고 정렬했다. 세 가지 방법 각각에 대해, 훈련 데이터세트(및 관련 10% 홀드아웃 테스트 비율)는 영국의 팝워스(Papworth), 브라이튼(Brighton) 및 스와지(Swansea) 병원에 기반을 둔 흉부외과 센터에서 어떤 이유로든 OCT를 받는 익명 환자의 것이다. 1087개의 동맥에서 293,490개의 이미지가 촬영되었다. 도 1c에 설명된 다단계 분류기는 다른 형식(테루모(Terumo))에 있는 176개 동맥의 47,520개 이미지를 더 사용하여 추가로 훈련되었다. 이러한 이미지 는 각 단계의 모듈식 독립성으로 인해 다단계 분류기에만 사용할 수 있었다. 즉, 최종 단계(예측자)는 형식에 의해 알 수 없거나 편향될 수 있다. 훈련 반복은 훈련 데이터세트의 90%에서 파라미터 조정, 테스트 및 10% 홀 드아웃 세트에 대한 재훈련을 통해 이루어졌다. 인공물, 관심 영역 및 측정 알고리즘은 훈련 데이터세트에서 100개 풀백(각각 270개 프레임 포함)으로 개발되었으며 적절한 경우 사후 OCT를 받는 14명의 환자의 조직학적 근거로 업데이트 되었다. 후속 검증(Subsequent validation)은 영국 에쉬포드(Ashford) 및 세인트 피터스 병원(St Peters Hospitals)의 비-ST 상승 심근 경색(NSTEMI)/안정 협심증 시험 데이터세트와 팝워스(Papworth)의 ST 상승 심근 경색(STEMI)/ 안정 협심증 데이터세트에서 수행되었다. 에쉬포드(Ashford) 및 세인트 피터스 병원(St Peters Hospitals)의 안 정형 협심증 환자는 OCT 절차 이전에 별도의 혈관 조영술에서 70% 이상의 협착증 병변과 최소 2개의 항허혈 약 물에 전형적인 증상이 있었다. NSTEMI는 전형적인 증상과 병원에 대한 99번째 백분위수 기준 이상의 트로포닌 수치로 진단되었다. 모집은 연구 윤리 서비스 위원회 사우스 이스트 코스트 서레이, 영국(South East Coast- Surrey, UK)(REC 참조: 13/LO/0238)에 의해 승인되었고 임상 시험 NCT02335086으로 등록되었다. 두 검증 데이 터세트의 환자 인구 통계는 다음과 같다: 각 훈련 테스트 데이터세트(즉, 10%)와 두 개의 검증 데이터세트에 대한 결과가 아래 및 도 8에서 비교된다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "정확도는 (TP+TN)/(실양수(Real positive)+실음수(Real negative))에서 계산할 수 있고, 여기서 TP는 참 양성 (true positive)이고 TN은 참 음성(true negative)이다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "원시 기준선 분류기(AUC 0.86, ACC 0.79, 감도 0.73)를 사용하면 좋은 기준선 성능이 관찰된다. 그러나 분석에 서는 인스턴스 크기(512x512x256)를 고려하여 훈련에 비현실적인 컴퓨팅 리소스가 필요했다. 또한 분류자가 보 정되지 않은 원시 프레임 분석을 강조하기 때문에 다양한 OCT 인공물을 무시할 수 있는 능력이 부족했다. 이러 한 주요 인공물(확산성 내강 내 인공물 감쇠 신호로 정의됨)은 협심증 환자보다 심근 경색증에서 유의하게 더 높았다(40.2% v 38.1% p=0.0333). 국소 기준선 분류기(focused baseline classifier)는 기준선 분류기에 비해 독립적인 NSTEMI/안정 협심증 데이 터세트(stable angina dataset)에 대한 감도(0.88)를 개선했지만 훈련 데이터 증대(표준 왜곡, 즉 회전 또는 뒤 집기, 밝기 조정을 통해 생성된 2934 대 9783 동맥 샘플)가 덜 필요하다. 도 1c에 설명된 다단계 분류기의 경 우, 섬유질 캡 두께를 포함하는 입력이 NSTEMI 검증 데이터세트(AUC 0.87, ACC 0.79 및 감도 0.83)에서 가장 좋 은 것으로 나타났다. 다단계 딥러닝 기반 분류기의 성능은 또한, 최적의 하이퍼 파라미터에 대한 무작위 검색과 함께 이산 기능 및 속성의 프레임 이미지와 패널을 모두 사용하여, K-최근접이웃(K-nearest neighbour), 랜덤포레스트(RandomForest), 서포트 벡터 머신을 포함하는 기존의 머신러닝 알고리즘과 비교한다. 최고의 기존 알고리즘(랜덤 포레 스트)은 제1(NSTEMI/SA) 검증 데이터세트(AUC 0.74, 민감도 0.74, 특이도 0.6)에 대해 적당히 잘 수행되었으며 최상의 추정기는 140μm에서 220μm 사이의 FCT 간격 입력으로 발생한다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "완전성을 위해, 각 훈련 데이터세트 및 검증 데이터세트의 세부 정보는 아래 표에 요약되어 있다(여기서 n은 동 맥 수이고 i는 OCT 이미지 수). 위에서 언급한 바와 같이, 두 분류기는 안정형 협심증(SA), ST 상승 심근 경색 증(STEMI) 및 비-ST 상승 심근 경색(NSTEMI)을 나타내는 환자에 대해 검증되었다. 다단계 분류기는 조직학, 2 명의 임상 관찰자와의 비교 및 같은 날 반복성 연구와 상관된 생체외 사후 부검 풀백(ex-vivo post-mortem pullbacks)을 사용하여 추가로 검증되었다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "위에서 언급한 바와 같이, 내강 내 이미지는 질병 또는 사건의 징후(likelihood)를 예측하고/하거나 약물 또는 기타 치료의 성능을 추적하기 위해 분석될 수 있다. 관상동맥 질병(CAD) 이미징은 고위험 플라크를 식별할 가능 성이 있고 2/3상 약물 연구에 널리 사용되는 대리 효능 마커(surrogate efficacy marker)이다. 그러나, 다양한 이미징 방식을 사용하여 식별된 '고위험' 병변으로 추정되는 사례 비율은 개별 플라크 관리를 변경하는 데 필요 한 비율보다 낮다. 내강 내 광간섭 단층촬영(OCT)은 매우 상세한 플라크 이미지를 제공할 수 있는 매우 고해상 도 시퀀스를 생성한다. 뿐만 아니라, 여러 OCT 파라미터는 최소 섬유질 캡 두께 FCT(<75μm), 최소 내강 면적 (MLA) <3.5mm2, 플라크 내부 지질 풀 확장 >180°, 및 대식세포, 결절, 혈관신생 또는 콜레스테롤 결정의 존재 를 포함하는, 고위험 병변과 연관된다. 이러한 OCT 특징 중 일부는 고용량 스타틴 또는 에제티미브 치료에 따 라 변하는데, 이는 플라크 안정화를 나타낼 수 있음을 시사한다. 그러나, OCT 풀백은 수백 개의 이미지와 동맥 당 수만 개의 후보 측정값을 포함하는 풍부한 데이터세트다. 결과적으로, OCT 분석은 현재 시간이 많이 소요되 는 오프라인 수동 프레임 선택 및 전문화된 핵심 실험실에서의 측정이 필요하고 관찰자 간 및 관찰자 내 변동성 으로 인해 제한된다. 완전 자동화된 측정은 인공물의 빈도가 높고 인공물과 질병의 유사성으로 인해 제한된다. 따라서, 현재의 OCT 자동 분석 시스템/방법은 임상의와 업계에서 질병 진행/불안정성을 측정하고 CAD를 사용하 여 다양한 프리젠테이션을 구별하여 보다 비용 효율적인 환자 관리를 허용하는 데 사용할 수 있다. 현재의 OCT 자동 분석 시스템/방법은 특정 치료, 특히 로수바스타틴(Rosuvastatin) 치료의 효능을 분석하는 데 사용되었다. 이미지는 기준선(치료 전)과 40mg 로수바스타틴(Rosuvastatin) 치료 13분 후에 캡처되었다. 현재 광간섭 단층촬영(OCT)은 항동맥경화증 약물의 효능을 검사하는 데 거의 사용되지 않으며, 부분적으로는 기 준선 및 후속 이미지에 대한 광범위하고 부분적인 수동 선택과 오프라인 분석으로 인해 분석이 적은 수의 프레 임으로 제한되기 때문이다. 대조적으로, 현재 OCT 자동 분석 방법의 완전 자동화된 분석은 수천 개의 개별 FCT 측정(2.0x103-1.0x106 측정/동맥, 중앙값 4.1x104)으로 구성된 전체 플라크 원주 FCT 맵을 생성할 수 있고, 섬 유질 조직과 하부 조직 사이의 픽셀 구배를 기반으로 하는 지질 함량 또는 석회화와 같은 플라크 안정성과 관련 된 다른 기능을 검사한다. 이 연구는 기준선에서 40mg/day Rosuvastatin 치료 후 13분 후에 무범 동맥 병변을 조사했다. FCT는 수동으로 선택한 프레임에서 측정되었으며 27명의 환자에서 31개의 병변에서 반자동으로 측정되었다. 원래 분석에서 최소 FCT가 증가하고, 대식세포 라인 아크와 평균 지질 아크가 모두 감소했고 9/13의 얇은 캡 섬유종(TCFA)이 비- TCFA 형태로 퇴행했다. 현재의 OCT 자동 분석 방법을 사용하면 프레임을 수동으로 선택하지 않고도 기준선에서플라크와 전체 혈관 모양을 모두 검사하고 83명의 환자를 추적할 수 있다. 병변으로 덮인 내강 표면적의 변화가 없음에도 불구하고(181.68±163.72mm2 대 223.37±199.86mm2, p=0.163), 추적 관찰 시 전체 플라크 평균 FCT(161.98±44.91μm 대 183.99±46.18μm p=0.0038)이 유의하게 증가했다. 최소 FCT/프레임도 추적 관찰 시 상당한 증가를 보였고(83.39±29.87μm 대 98.29±41.00μm, p=0.0113), 반면에 개별 프레임의 63.37%(95% 신뢰 구간(CI) 59.88-67.58)에서 추적 관찰 시 FCT가 증가했다. 가장 작은 FCT에 대한 고강도 스타틴의 효과를 결정하기 위해, 전체 동맥 FCT 수/동맥이 상이한 FCT 임계치 (threshold)에서 검사되었다. 도 9a는 치료 전 기준선과 치료 후 후속 조치(13m에서) 사이의 서로 다른 두께 임계값(75μm 및 65μm)에서 FCT 의 측정 빈도에 대한 박스 그림을 보여준다. 데이터는 중앙값이고 오차 막대는 25% 및 75% 사분위수를 나타낸 다. FCT, 지질 또는 칼슘의 전체 동맥 수가 동맥마다 상당히 다르지만, 대부분 플라크 부담이 다르기 때문에, 캡 두께가 가장 작은 지점 (<65μm (85540 vs. 87731 (no of points) or 1.9% vs. 2.1% (모든 측정 %), p<0.0001)의 수가 크게 감소했고, 로수바스타틴이 가장 얇은 섬유질 캡에 가장 큰 영향을 미친다는 것을 암시한 다. 도 9b는 치료 전 기준선과 치료 후 추적 관찰 사이의 FCT에 대한 단일 환자의 프레임별 플롯을 보여준다. 변화 하는 선은 각 프레임에 대한 평균 FCT를 나타내고, 일정한 수평선은 전체 풀백에 대한 평균 FCT를 나타낸다. 화살표는 환자의 동맥을 따라 같은 지점을 나타내며 얇은 캡 영역의 퇴행을 보여준다(즉, 섬유질 캡이 두꺼워짐). 도 9b에서 다단계 분류기는 기준선 및 후속 조치에서 전체 플라크를 따라 FCT 플롯을 직접 비교할 수 있고, 이는 FCT가 증가하거나 감소하는 플라크 영역을 나타낸다. 도 9c와 9d는 각각, 치료 전 기준선과 치료 후 추적 관찰 사이의 지질(lipid) 빈도 박스 플롯과 치료 전 기준선 과 치료 후 추적 관찰 사이의 석회화(calcification) 빈도 박스 플롯을 보여준다. 도 9c 및 9d에서 지질 비율 이 기준선에서 20.00%에서 후속 조치에서 18.06%(p<0.0025)로 작지만 상당한 감소가 있고 전체 동맥 수준에서 칼슘 증가(24588 대 38105(포인트 없음) 또는 3.1% 대 4.9%(모든 측정값의 %), p=0.016)를 볼 수 있다. 따 라서, 본 OCT 자가분석 방법은 항동맥경화 요법의 효능을 모니터링하고 환자 이벤트를 예측하는 데 사용될 수 있음을 알 수 있다. 여기에 설명된 예시적인 실시예의 적어도 일부는 전용 특수 목적 하드웨어를 사용하여 부분적으로 또는 전체적 으로 구성될 수 있다. 본 문서에서 사용되는 '컴포넌트', '모듈' 또는 '단위'와 같은 용어는, 이산 또는 통합 컴포넌트 형태의 회로, 필드 프로그램 가능 게이트 어레이(Field Programmable Gate Array)(FPGA) 또는 특정 작업을 수행하거나 관련 기능을 제공하는 애플리케이션 특정 집적 회로(Application Specific Integrated Circuit)(ASIC)와 같은 , 하드웨어 장치를 포함하나 이에 제한되지 않는다. 일부 실시예에서, 설명된 요소는 유형의 영구적인 주소 지정 가능한 저장 매체에 상주하도록 구성될 수 있고 하나 이상의 프로세서에서 실행하도 록 구성될 수 있다. 이러한 기능적 요소는 일부 실시예에서, 소프트웨어 구성요소, 객체 지향 소프트웨어 구성 요소, 클래스 구성요소 및 태스크 구성요소, 프로세스, 기능, 속성, 절차, 서브루틴, 프로그램 코드 세그먼트, 드라이버, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조, 테이블, 어레이와 같은 , 및 변수 와 같은, 컴포넌트를 포함할 수 있다. 예시적인 실시예가 본 명세서에 논의된 컴포넌트, 모듈 및 유닛을 참조 하여 설명되었지만, 그러한 기능적 요소는 더 적은 수의 요소로 결합되거나 추가의 요소로 분리될 수 있다. 선 택적 특징의 다양한 조합이 여기에서 설명되었으며, 설명된 특징은 임의의 적절한 조합으로 조합될 수 있음을 이해할 것이다. 특히, 임의의 예시적인 실시예의 특징은 그러한 조합이 상호 배타적인 경우를 제외하고 적절한 경우 임의의 다른 실시예의 특징과 조합될 수 있다. 본 명세서 전반에 걸쳐, \"포함하는\" 또는 \"포함하는\"이라는 용어는 명시된 컴포넌트(들)를 포함하지만 다른 사람의 존재를 배제하지 않는 것을 의미한다. 본 출원과 관련하여 본 명세서와 동시에 제출되거나 본 명세서 이전에 제출되고 본 명세서와 함께 공개 검사를 받을 수 있는 모든 문서 및 문서에 주의를 기울이고, 이러한 모든 문서 및 문서의 내용은 참조로 여기에 포함된 다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "본 명세서에 개시된 모든 특징(첨부된 청구범위, 요약 및 도면 포함) 및/또는 그렇게 개시된 방법 또는 프로세 스의 모든 단계는 그러한 특징 중 적어도 일부가 및/또는 단계는 상호 배타적이다."}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "본 명세서에 개시된 각 특징(첨부된 청구범위, 요약 및 도면 포함)은 달리 명시적으로 언급되지 않는 한 동일하 거나, 동등하거나 유사한 목적을 제공하는 대체 특징으로 대체될 수 있다. 따라서, 달리 명시적으로 언급되지 않는 한, 개시된 각각의 특징은 동등하거나 유사한 특징의 일반적인 시리즈의 한 예일 뿐이다.본 발명은 전술한 실시예(들)의 세부 사항으로 제한되지 않는다. 본 발명은 본 명세서에 개시된 특징의 신규 또"}
{"patent_id": "10-2021-7037403", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "는 신규 조합(첨부된 청구범위, 요약 및 도면 포함), 또는 임의의 신규 또는 신규 조합, 개시된 임의의 방법 또 는 프로세스 단계의 신규 조합으로 확장된다."}
{"patent_id": "10-2021-7037403", "section": "도면", "subsection": "도면설명", "item": 1, "content": "더 나은 이해를 위해 그리고 실시예가 어떻게 실행될 수 있는지 보여주기 위해, 이제 단지 예로서 다음과 같은 첨부된 개략도를 참조할 것이다: 도 1a는 캡처되는 동맥의 여러 이미지에 대한 개략도이다; 도 1b는 도 1a의 다중 이미지를 캡처하고 분석하기 위한 시스템의 개략적인 블록도이다; 도 1c는 도 1a의 다중 이미지를 캡처하고 분석하기 위한 방법의 흐름도이다; 도 2a는 도 1b의 시스템에 의해 포착된 동맥벽의 예시적인 이미지 프레임이다; 도 2b는 도 2a의 동맥벽의 전개의 개략도이다; 도 2c는 도 2b의 전개 단계의 결과를 보여준다; 도 2d는 도 2c의 두 샘플 세그먼트의 세부 정보를 보여준다; 도 2e는 도 2a에 겹쳐서 측정된 정보를 보여준다; 도 2f는 도 1a의 방법을 사용하여 캡처한 동맥 영역에 대한 평균값의 수평 플롯이다; 도 2g는 도 2f와 같은 동맥 영역의 주의 맵이다; 도 3a는 동맥의 종단면도 및 측면도이다; 도 3b, 3c 및 3d는 도 3a의 동맥의 세 위치에서 촬영한 이미지다; 도 3e는 세그먼트를 보여주는 인공물의 이미지다. 도 3f 및 3g는 인공물에 대한 보정 전후의 도 3e의 세 부분이다; 도 3h는 도 3f의 3개의 세그먼트를 대체하는 도 3g의 3개의 보정된 세그먼트가 있는 도 3e의 이미지다; 도 4a ~ 4d는 다양한 유형의 인공물이 있는 단면 OCT 이미지를 보여준다; 도 5a는 NSTEMI 및 STEMI 환자에 대한 섬유질 캡 두께(FCT)의 바이올린 플롯이다; 도 5b 및 5c는 각각 NSTEMI 및 STEMI를 나타내는 환자의 동맥을 통한 단면 이미지다; 도 5d, 5e 및 5f는 각각 NSTEMI, STEMI 및 안정형 협심증을 나타내는 환자에 대한 중앙 기준선에 정렬된 동맥 길이를 따른 FCT 열 지도의 플롯이다; 도 6a는 편심 섬유종종 지점에서 생체 외에서 사후 획득한 OCT 이미지를 보여준다; 도 6b는 도 6a와 함께 등록된 섬유종종의 조직학적 단면이다; 도 6c는 도 6b에 설명된 영역의 고배율 뷰이다; 도 6d는 사후 생체 획득 OCT 이미지의 공동 등록된 조각에 대한 조직학에서 수동으로 측정한 FCT와 비교하여 도 1c의 방법으로 계산된 가장 작은 10개의 FCT 측정값을 플롯한다; 도 6e는 조직학에서 수동으로 측정한 FCT와 비교하여 도 1c의 방법에 의해 계산된 FCT 측정값 간의 차이를 보여 주는 다양한 평균 FCT를 갖는 블랜드-알트만 플롯이다; 도 6f는 다양한 센터의 독립적인 심장 전문의가 수동으로 FCT와 비교한 도 1c의 방법으로 계산한 FCT 측정값 간 의 차이를 보여주는 다양한 평균 FCT를 가진 블랜드-알트만 플롯이다; 도 6g는 두 명의 다른 임상의의 FCT 측정값을 플롯한다; 도 6h는 FCT 측정이 같은 날 다른 시간에 취해진 경우 평균 FCT의 변화를 보여주는 플롯이다; 도 7a는 평균 FCT 측정 후 스텐트 및 사전 스텐트를 플롯한다; 도 7b는 스텐트 시술 후 3개월과 스텐트 시술 직후 측정된 평균 FCT를 플롯한다; 도 8은 독립적인 비-ST 상승 심근 경색 데이터세트에 적용된 세 가지 분류 모델에 대한 수신기 작동 성능 곡선 을 플롯한다; 도 9a는 치료 전 기준선과 치료 후 추적 관찰 사이의 서로 다른 두께 임계값에서 FCT의 측정 빈도에 대한 박스 플롯을 보여준다; 도 9b는 치료 전 기준선과 치료 후 추적 관찰 사이의 FCT의 단일 환자의 프레임별 플롯을 보여준다; 도 9c는 치료 전 기준선과 치료 후 추적 관찰 사이의 지질 빈도의 박스 그림을 보여준다; 및 도 9d는 치료 전 기준선과 치료 후 추적 관찰 사이의 석회화 빈도의 박스 그림을 보여준다."}
