{"patent_id": "10-2021-0005570", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0021845", "출원번호": "10-2021-0005570", "발명의 명칭": "객체 제어를 지원하는 방법, 시스템 및 비일시성의 컴퓨터 판독 가능 기록 매체", "출원인": "주식회사 브이터치", "발명자": "김석중"}}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "객체 제어를 지원하기 위한 방법으로서,제어 수단의 이동에 관한 트리거 이벤트의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는 단계, 및상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 지시 벡터의 연장선에 기초하여 특정되는 가상의 기준 지점과 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표를 연결하는 벡터를 참조하여 상기 제어대상 영역에서의 제어 위치를 결정하는 단계를 포함하는 단계를 포함하는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "객체 제어를 지원하기 위한 방법으로서,제어 수단의 이동에 관한 트리거 이벤트의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는 단계, 및상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 제어 수단의 모션 좌표를 참조하여 특정되는제1 가이드 벡터와 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표를 참조하여 특정되는 제2 가이드 벡터사이의 관계에 기초하여 보정되는 상기 지시 벡터를 참조하여 상기 제어 대상 영역에서의 제어 위치를 결정하는단계를 포함하는 단계를 포함하는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 및 제2항 중 어느 한 항에 있어서,상기 지시 벡터 결정 단계에서, 상기 제어 수단의 모션 좌표와 상기 제어 대상 영역 사이의 거리가 소정 수준이하인 경우에, 상기 제어 수단의 모션 좌표 중 상기 제어 수단의 이동에 관한 트리거 이벤트가 발생되는 시점(時點)에서의 좌표를 트리거 좌표로서 참조하여 제1 좌표를 결정하고, 상기 트리거 좌표와 상기 모션 좌표 사이의 거리, 상기 트리거 좌표와 상기 모션 좌표에 의해 특정되는 직선 구간, 상기 제1 좌표와 상기 모션 좌표 사이의 거리 및 상기 제1 좌표와 상기 모션 좌표에 의해 특정되는 직선 구간 중 적어도 하나를 참조하여 제2 좌표를 결정하고, 상기 제1 좌표 및 상기 제2 좌표에 기초하여 결정되는 벡터를 상기 지시 벡터로서 결정하는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 지시 벡터 결정 단계에서, 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리가 소정 수준 이하이거나 상기 제1 좌표 및 상기 제2 좌표에 기초하여 결정되는 벡터가 유효하지 않은 경우에, 상기 트리거 좌표 또는 상기 제1 좌표를 지나고, 상기 제어 대상 영역에 수직인 벡터를 상기 지시 벡터로 결정하는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 및 제2항 중 어느 한 항에 있어서,상기 지시 벡터 결정 단계에서, 상기 제어 수단의 모션 좌표 및 상기 제어 대상 영역과의 거리가 소정 수준 이상인 경우에, 상기 제어 수단의 모션 좌표 및 사용자의 신체 좌표에 기초하여 특정되는 벡터를 상기 지시 벡터공개특허 10-2022-0021845-3-로 결정하는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 및 제2항 중 어느 한 항에 있어서,상기 지시 벡터 결정 단계에서, 상기 제어 수단의 이동에 관한 트리거 이벤트의 발생 여부를 특정하기 위한 방향은 상기 지시 벡터의 유형에 따라 결정되는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 및 제2항 중 어느 한 항에 있어서,상기 지시 벡터 결정 단계에서, 상기 제어 수단의 이동에 관한 트리거 이벤트의 발생 여부를 특정하기 위한 방향은 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리를 참조하여 결정되는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제어 위치 결정 단계에서, 상기 위치가 변동되기 전 상기 지시 벡터가 향하는 방향의 반대 방향의 연장선상에 존재하는 소정의 지점을 상기 가상의 기준 지점으로 특정하는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,상기 제어 위치 결정 단계에서, 상기 위치가 변동되기 전 상기 제어 수단의 모션 좌표에 기초하여 특정되는 제1핑거 벡터 및 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표에 기초하여 특정되는 제2 핑거 벡터 사이의위치 및 방향의 변화 정도에 기초하여 상기 지시 벡터를 보정하는방법."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 및 제2항 중 어느 한 항에 따른 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 비일시성의 컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "객체 제어를 지원하기 위한 시스템으로서,제어 수단의 이동에 관한 트리거 이벤트의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는 지시 벡터 결정부, 및상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 지시 벡터의 연장선에 기초하여 특정되는 가상의 기준 지점과 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표를 연결하는 벡터를 참조하여 상기 제어대상 영역에서의 제어 위치를 결정하는 제어 위치 관리부를 포함하는시스템."}
{"patent_id": "10-2021-0005570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "객체 제어를 지원하기 위한 시스템으로서,제어 수단의 이동에 관한 트리거 이벤트의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의공개특허 10-2022-0021845-4-거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는 지시 벡터 결정부, 및상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 제어 수단의 모션 좌표를 참조하여 특정되는제1 가이드 벡터와 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표를 참조하여 특정되는 제2 가이드 벡터사이의 관계에 기초하여 보정되는 상기 지시 벡터를 참조하여 상기 제어 대상 영역에서의 제어 위치를 결정하는제어 위치 관리부를 포함하는시스템."}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 태양에 따르면, 객체 제어를 지원하기 위한 방법으로서, 제어 수단의 이동에 관한 트리거 이벤트의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리 중 적어도 하나를 참조하여 지시 벡터 를 결정하는 단계, 및 상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 지시 벡터의 연장선에 기초하여 특정되는 가상의 기준 지점과 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표를 연결하는 벡터를 참조하여 상기 제어 대상 영역 에서의 제어 위치를 결정하거나, 상기 위치가 변동되기 전 상기 제어 수단의 모션 좌표에 기초하여 특정되는 제1 가이드 벡터와 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표에 기초하여 특 정되는 제2 가이드 벡터 사이의 관계에 기초하여 보정되는 상기 지시 벡터를 참조하여 상기 제어 대상 영역에서 의 제어 위치를 결정하는 단계를 포함하는 방법이 제공된다."}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 객체 제어를 지원하는 방법, 시스템 및 비일시성의 컴퓨터 판독 가능 기록 매체에 관한 것이다."}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디스플레이의 터치 과정, 버튼을 누르는 과정 및 스위치를 켜고 끄는 과정에서 불가피한 접촉이 발생하게 되는 데, 바이러스(예를 들어, COVID-19) 등에 감염된 감염자의 비말이 묻은 곳에 손을 접촉한 사람이 그 손으로 자 신의 점막을 만지게 되면 접촉 감염이 일어나게 된다. 특히, 불특정 다수가 함께 접촉하는 공공 장소의 터치 디스플레이, 버튼, 스위치 등의 경우에 접촉하는 사람이 많은 만큼 그 위험성도 커지게 된다. 근래에 들어, 이러한 문제를 해결하기 위하여 비접촉식으로 객체를 제어하기 위한 다양한 방식이 소개되고 있다. 이에 관한 종래 기술의 일 예로서, 한국공개특허공보 제2016-97410호에 개시된 기술을 예로 들 수 있는데, 이에 따르면, 사용자로부터 입력 사항을 제공받기 위한 입력 인터페이스에 있어서, 표시부, 하나 이상의 감지 장치를 갖고, 상기 감지 장치를 통해 사용자의 비접촉 손 동작을 감지하는 감지부, 상기 감지부로부터 감지된 비접촉 감지 신호들을 분석하여 비접촉 동작 인식 정보를 생성하는 동작 인식부, 및 상기 생성된 비접촉 동작 인식 정 보에 따라 제어된 화면을 상기 표시부에 디스플레이하는 제어부를 포함하여 구성되는 동작 인식을 통한 비접촉 식 입력 인터페이스가 소개된 바 있다. 하지만, 위와 같은 종래 기술을 비롯하여 지금까지 소개된 기술에 의하면, 제어 수단(예를 들어, 손, 손 끝)의 위치가 변동되는 경우에, 제어 수단에 기초하여 제어 대상 영역상에서의 제어 위치(예를 들어, 커서, 포인터)를 특정하는데 이용된 지시 벡터로 제어 대상 영역상에서의 변동되는 제어 위치를 특정하고 있다. 이러한 방식의 경우에 사용자와 제어 대상 영역 사이의 위치 관계에 따라 제어 대상 영역에서의 제어 위치가 사용자의 의도보 다 더 많이 또는 더 적게 변동될 수밖에 없어 사용자에 의한 직관적인 제어가 어려운 문제가 있었다. 이에 본 발명자(들)는, 제어 수단의 위치가 변동되는 경우에 지시 벡터를 기반으로 하여 제어 대상 영역에서의 변동되는 제어 위치를 특정하기 위한 벡터를 특정하고, 이에 기초하여 제어 대상 영역에서의 변동될 제어 위치 를 특정함으로써, 사용자에 의한 직관적인 제어가 이루어질 수 있도록 하는 신규하고도 진보된 기술을 제안하는 바이다."}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 전술한 종래 기술의 문제점을 모두 해결하는 것을 그 목적으로 한다. 또한, 본 발명은, 사용자가 제어 대상 영역에서의 제어 위치를 직관적이고 정교하게 제어할 수 있도록 지원하는 것을 그 목적으로 한다. 또한, 본 발명은, 사용자의 의도에 부합되는 제어 위치를 특정하기 위한 지시 벡터가 동적으로 결정될 수 있도 록 하는 것을 또 다른 목적으로 한다."}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 대표적인 구성은 다음과 같다. 본 발명의 일 태양에 따르면, 객체 제어를 지원하기 위한 방법으로서, 제어 수단의 이동에 관한 트리거 이벤트 의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는 단계, 및 상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 지시 벡터의 연장 선에 기초하여 특정되는 가상의 기준 지점과 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표를 연결하는 벡 터를 참조하여 상기 제어 대상 영역에서의 제어 위치를 결정하는 단계를 포함하는 단계를 포함하는 방법이 제공 된다. 본 발명의 다른 태양에 따르면, 객체 제어를 지원하기 위한 방법으로서, 제어 수단의 이동에 관한 트리거 이벤 트의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는 단계, 및 상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 제어 수단의 모션 좌표를 참조하여 특정되는 제1 가이드 벡터와 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표를 참조하여 특정되는 제2 가이드 벡터 사이의 관계에 기초하여 보정된 상기 지시 벡터를 참조하여 상기 제어 대상 영역에서 의 제어 위치를 결정하는 단계를 포함하는 단계를 포함하는 방법이 제공된다. 본 발명의 또 다른 태양에 따르면, 객체 제어를 지원하기 위한 시스템으로서, 제어 수단의 이동에 관한 트리거 이벤트의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는 지시 벡터 결정부, 및 상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 지시 벡터의 연장선에 기초하여 특정되는 가상의 기준 지점과 상기 위치가 변동된 후 상기 제어 수단의 모션 좌 표를 연결하는 벡터를 참조하여 상기 제어 대상 영역에서의 제어 위치를 결정하는 제어 위치 관리부를 포함하는 시스템이 제공된다. 본 발명의 또 다른 태양에 따르면, 객체 제어를 지원하기 위한 시스템으로서, 제어 수단의 이동에 관한 트리거 이벤트의 발생 여부 및 상기 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는 지시 벡터 결정부, 및 상기 제어 수단의 위치가 변동되면, 상기 위치가 변동되기 전 상기 제어 수단의 모션 좌표를 참조하여 특정되는 제1 가이드 벡터와 상기 위치가 변동된 후 상기 제어 수단의 모션 좌표를 참조하여 특정되는 제2 가이드 벡터 사이의 관계에 기초하여 보정된 상기 지시 벡터를 참조하여 상기 제 어 대상 영역에서의 제어 위치를 결정하는 제어 위치 관리부를 포함하는 시스템이 제공된다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 비일시성의 컴퓨터 판독 가능한 기록 매체가 더 제공된다."}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 사용자가 제어 대상 영역에서의 제어 위치를 직관적이고 정교하게 제어할 수 있게 된다. 또한, 본 발명에 의하면, 사용자의 의도에 부합되는 제어 위치를 특정하기 위한 지시 벡터가 동적으로 결정될 수 있게 된다."}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이러한 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명 의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 본 명세서에 기 재되어 있는 특정 형상, 구조 및 특성은 본 발명의 정신과 범위를 벗어나지 않으면서 일 실시예로부터 다른 실 시예로 변경되어 구현될 수 있다. 또한, 각각의 실시예 내의 개별 구성요소의 위치 또는 배치도 본 발명의 정 신과 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미로서 행하여지는 것이 아니며, 본 발명의 범위는 특허청구범위의 청구항들이 청구하는 범위 및 그와 균등한 모든 범위를 포괄하는 것으로 받아들여져야 한다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유사한 구성요소를 나타낸다."}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하에서는, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있도록 하 기 위하여, 본 발명의 여러 바람직한 실시예에 관하여 첨부된 도면을 참조하여 상세히 설명하기로 한다. 객체 제어 지원 시스템의 구성 이하에서는, 본 발명의 구현을 위하여 중요한 기능을 수행하는 객체 제어 지원 시스템의 내부 구성 및 각 구성요소의 기능에 대하여 살펴보기로 한다. 도 1은 본 발명의 일 실시예에 따른 객체 제어 지원 시스템의 내부 구성을 상세하게 도시하는 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 객체 제어 지원 시스템은 지시 벡터 결정부, 제어 위 치 관리부, 통신부 및 제어부를 포함할 수 있다. 또한, 본 발명의 일 실시예에 따르면, 지시 벡터 결정부, 제어 위치 관리부, 통신부 및 제어부는 그 중 적어도 일부가 외부 시스템(미 도시됨)과 통신하는 프로그램 모듈들일 수 있다. 이러한 프로그램 모듈들은 운영 시스템, 응용 프로그램 모듈 및 기타 프로그램 모듈의 형태로 객체 제어 지원 시스템에 포함될 수 있으며, 물리적으로는 여러 가지 공 지의 기억 장치 상에 저장될 수 있다. 또한, 이러한 프로그램 모듈들은 객체 제어 지원 시스템과 통신 가 능한 원격 기억 장치에 저장될 수도 있다. 한편, 이러한 프로그램 모듈들은 본 발명에 따라 후술할 특정 업무 를 수행하거나 특정 추상 데이터 유형을 실행하는 루틴, 서브루틴, 프로그램, 오브젝트, 컴포넌트, 데이터 구조 등을 포괄하지만, 이에 제한되지는 않는다. 한편, 객체 제어 지원 시스템에 관하여 위와 같이 설명되었으나, 이러한 설명은 예시적인 것이고, 객체 제 어 지원 시스템의 구성요소 또는 기능 중 적어도 일부가 필요에 따라 후술할 디바이스 내에서 실현되 거나 이러한 디바이스 내에 포함될 수도 있음은 당업자에게 자명하다. 또한, 경우에 따라서는, 객체 제어 지원 시스템의 모든 기능과 모든 구성요소가 디바이스 내에서 전부 실행되거나 디바이스 내에 전부 포함될 수도 있다. 본 발명의 일 실시예에 따른 디바이스는 메모리 수단을 구비하고, 마이크로 프로세서를 탑재하여 연산 능 력을 갖춘 디지털 기기로서, 스마트 글래스, 스마트 워치, 스마트 밴드, 스마트 링, 스마트 넥클리스, 스마트 이어셋, 스마트 이어폰, 스마트 이어링 등과 같은 웨어러블 디바이스이거나 스마트폰, 스마트 패드, 데스크탑 컴퓨터, 서버, 노트북 컴퓨터, 워크스테이션, 피디에이(PDA), 웹 패드, 이동 전화기, 리모트 컨트롤러 등과 같 은 다소 전통적인 디바이스가 포함될 수 있으며, 디바이스는 전술한 예시뿐만 아니라 본 발명의 목적을 달 성할 수 있는 범위 내에서 얼마든지 변경될 수 있다. 또한, 본 발명의 일 실시예에 따른 디바이스는 제어 수단(예를 들어, 포인터, 사용자 눈 또는 손 끝 부위 등)을 촬영하기 위한 카메라 모듈(미도시됨)을 포함하거나 공지의 통신망을 통해 카메라 모듈(또는 카메라 모듈을 포함하는 다른 디바이스)과 통신 가능할 수 있다. 한편, 본 발명의 일 실시예에 따른 위의 디바이스에는 본 발명에 따른 객체 제어를 지원하기 위한 애플리 케이션이 포함되어 있을 수 있다. 이와 같은 애플리케이션은 외부의 애플리케이션 배포 서버(미도시됨)로부터 다운로드된 것일 수 있다. 한편, 이러한 프로그램 모듈의 성격은 후술할 바와 같은 객체 제어 지원 시스템 의 지시 벡터 결정부, 제어 위치 관리부, 통신부 및 제어부와 전반적으로 유사할 수 있다. 여기서, 애플리케이션은 그 적어도 일부가 필요에 따라 그것과 실질적으로 동일하거나 균등한 기능을 수 행할 수 있는 하드웨어 장치나 펌웨어 장치로 치환될 수도 있다. 먼저, 본 발명의 일 실시예에 따른 지시 벡터 결정부는 제어 수단의 이동에 관한 트리거 이벤트의 발생 여 부 및 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리 중 적어도 하나를 참조하여 지시 벡터를 결정하는기능을 수행할 수 있다. 본 발명의 일 실시예에 따른 제어 수단의 이동에 관한 트리거 이벤트에는 제어 수단의 이동 방향 전환, 제어 수단의 이동 정지 등이 포함될 수 있다. 보다 구체적으로, 이러한 트리거 이벤트에는 제 어 수단이 전진 후 후진을 하거나, 전진 후 정지를 하는 것이 포함될 수 있다. 이러한 전진 및 후진 등의 방향 은 제어 대상 영역, 사용자의 특정 신체 부위(예를 들어, 눈) 또는 후술할 가상의 기준 지점을 기준으로 특정되 는 것일 수 있다. 여기서, 본 발명의 일 실시예에 따른 제어 대상 영역은 사용자에 의해 제어 가능한 적어도 하나의 객체가 디스플레이되는 영역을 의미할 수 있다. 예를 들어, 지시 벡터 결정부는 제어 수단의 이동에 관한 트리거 이벤트가 발생되는 경우에, 제어 수단의 모션 좌표 중 제어 수단의 이동에 관한 트리거 이벤트가 발생되는 시점(時點)에서의 좌표를 트리거 좌표로서 참 조하여 제1 좌표를 결정할 수 있고, 트리거 좌표와 모션 좌표 사이의 거리, 트리거 좌표와 모션 좌표에 의해 특 정되는 직선 구간, 제1 좌표와 모션 좌표 사이의 거리 및 제1 좌표와 모션 좌표에 의해 특정되는 직선 구간 중 적어도 하나를 참조하여 제2 좌표를 결정할 수 있으며, 제1 좌표 및 제2 좌표에 기초하여 결정되는 벡터(이하, \"모션 벡터\"라 한다.)를 지시 벡터로서 결정할 수 있다. 보다 구체적으로, 지시 벡터 결정부는 위의 제2 좌표를 시점으로 하고 위의 제1 좌표를 종점으로 하는 모션 벡터를 결정할 수 있다. 이러한 모션 벡터의 결정 방식과 관련된 자세한 내용은 후술하기로 한다. 다른 예를 들어, 지시 벡터 결정부는 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리가 소정 수준 이하(예를 들어, 2.5cm 이하)이거나, 제어 수단의 이동에 관한 트리거 이벤트가 발생되고 위의 모션 벡터가 유 효하지 않은 경우에, 위의 트리거 좌표 또는 제1 좌표를 지나고, 제어 대상 영역에 수직인 벡터(이하, \"수직 벡 터\"라 한다.)를 지시 벡터로서 결정할 수 있다. 보다 구체적으로, 지시 벡터 결정부는 제어 수단이 전진 후 정지하는 트리거 이벤트가 발생되고 제1 좌표 (또는 제어 수단의 모션 좌표)가 제어 대상 영역과의 거리가 소정 거리 이내(보다 구체적으로, 1cm 내지 2.5c m)이며 모션 벡터가 유효하지 않은 경우에, 제1 좌표를 지나고 제어 대상 영역에 수직인 벡터를 지시 벡터(예를 들어, 제1 좌표를 시점으로 하고, 제1 좌표와 최단 거리에 존재하는 제어 대상 영역의 소정 지점을 종점으로 하 는 벡터)로서 결정할 수 있다. 또한, 지시 벡터 결정부는 제어 수단이 전진 후 후진하는 트리거 이벤트가 발생되고 제1 좌표(또는 제어 수단의 모션 좌표)가 제어 대상 영역과의 거리가 소정 거리 이내(보다 구체적으로, 1cm 내지 2.5cm)이며 위의 모션 벡터가 유효하지 않은 경우에, 트리거 좌표를 지나고 제어 대상 영 역에 수직인 벡터(예를 들어, 트리거 좌표를 시점으로 하고, 제1 좌표와 최단 거리에 존재하는 제어 대상 영역 의 소정 지점을 종점으로 하는 벡터)를 지시 벡터로서 결정할 수 있다. 또한, 지시 벡터 결정부는 제1 좌 표(또는 제어 수단의 모션 좌표)가 제어 대상 영역과의 거리가 소정 거리 이내(보다 구체적으로, 0cm 내지 1c m)이며 위의 모션 벡터가 유효하지 않은 경우에 제1 좌표를 지나고 제어 대상 영역에 수직인 벡터를 지시 벡터 (예를 들어, 제1 좌표를 시점으로 하고, 제1 좌표와 최단 거리에 존재하는 제어 대상 영역의 소정 지점을 종점 으로 하는 벡터)로서 결정할 수 있다. 또 다른 예를 들어, 지시 벡터 결정부는 제어 수단의 모션 좌표 및 제어 대상 영역과의 거리가 소정 수준 이상(예를 들어, 8cm 이상)인 경우에, 제어 수단의 모션 좌표 및 사용자의 신체 좌표에 기초하여 특정되는 벡터 (이하, \"지칭 벡터\"라 한다.)를 지시 벡터(예를 들어, 사용자의 신체 좌표를 시점으로 하고, 제어 수단의 모션 좌표를 종점으로 하는 벡터)로 결정할 수 있다. 본 발명의 일 실시예에 따른 사용자 신체 좌표는, 사용자의 눈 (예를 들어, 우세안, 양안 등), 머리, 손, 손 끝 등의 다양한 신체 부위에 관한 신체 좌표가 포함될 수 있다. 한편, 본 발명에 따른 제어 수단이 사용자의 신체 부위인 경우에는, 해당 신체 부위와 그와 동일하지 사용자의 다른 신체 부위에 기초하여 지시 벡터가 결정될 수 있다. 보다 구체적으로, 지시 벡터 결정부는 제어 수단이 사용자의 손 끝인 경우에 해당 사용자의 손 끝의 모션 좌표 및 제어 대상 영역 사이의 거리가 8cm 이상인 경우에, 해당 사용자의 눈(구체적으로, 우세안)의 좌표를 시 점으로 하고, 손 끝의 모션 좌표를 종점으로 하는 벡터를 지시 벡터로서 결정할 수 있다. 도 2는 본 발명의 일 실시예에 따라 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리에 따라 지시 벡터가 동적으로 결정되는 과정을 예시적으로 나타내는 도면이다. 도 2를 참조하면, 먼저, 본 발명의 일 실시예에 따른 제어 수단의 모션 좌표가 사용자의 손 끝의 좌표(즉, 제1 신체 좌표)이고, 그 제어 수단의 모션 좌표가 제어 대상 영역으로부터 제2 거리(예를 들어, 8cm) 이상에 존재하 는 경우에 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 눈의 좌표(즉, 제2 신체 좌표)에 기초하여 특정되는 벡터(201, 202)가 지시 벡터로서 결정될 수 있다. 예를 들어, 제어 수단의 모션 좌표가 제어 대상 영 역으로부터 제1 거리(예를 들어, 30cm) 이상에 존재하는 경우에는 사용자의 손 끝의 좌표(즉, 제1 신체 좌표)및 사용자의 우세안의 좌표(즉, 제2 신체 좌표)를 연결하는 벡터가 지시 벡터로서 결정될 수 있고, 제어 수단의 모션 좌표가 제어 대상 영역으로부터 제2 거리(예를 들어, 8cm) 이상 및 제1 거리 미만(예를 들어, 30cm)에 존재하는 경우에는 (i) 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 우세안의 좌표(즉, 제2 신체 좌표)를 연결하는 벡터 또는 (ii) 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 양안의 중 심 좌표(즉, 제2 신체 좌표)를 연결하는 벡터가 지시 벡터로서 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따라 제어 수단의 모션 좌표가 제어 대상 영역으로부터 제3 거리(예를 들어, 2.5cm) 이상이고 제2 거리(예를 들어, 8cm) 미만에 존재하는 경우에는 사용자의 손 끝의 좌표(즉, 제1 신체 좌 표) 및 사용자의 눈의 좌표(즉, 제2 신체 좌표)에 기초하여 특정되는 벡터(201, 202)와 모션 벡터 중 어느 하나의 벡터가 지시 벡터로서 결정될 수 있다. 예를 들어, 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용 자의 눈의 좌표(즉, 제2 신체 좌표)에 기초하여 특정되는 벡터(201, 202)가 결정될 수 있는 경우에는 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 눈의 좌표(즉, 제2 신체 좌표)에 기초하여 특정되는 벡터(201, 202)가 지시 벡터로서 결정되고, 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 눈의 좌표(즉, 제2 신 체 좌표)에 기초하여 특정되는 벡터(201, 202)가 결정될 수 없거나 유효하지 않은 경우에 모션 벡터가 지 시 벡터로서 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따라 제어 수단의 모션 좌표가 제어 대상 영역으로부터 제3 거리(예를 들어, 2.5cm) 미만에 존재하는 경우에는 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 눈의 좌표(즉, 제2 신체 좌표)에 기초하여 특정되는 벡터(201, 202), 모션 벡터 및 수직 벡터 중 어느 하나의 벡터가 지 시 벡터로서 결정될 수 있다. 예를 들어, 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 눈의 좌표 (즉, 제2 신체 좌표)에 기초하여 특정되는 벡터(201, 202)가 결정될 수 있는 경우에는 사용자의 손 끝의 좌표 (즉, 제1 신체 좌표) 및 사용자의 눈의 좌표(즉, 제2 신체 좌표)에 기초하여 특정되는 벡터(201, 202)가 지시 벡터로서 결정되고, 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 눈의 좌표(즉, 제2 신체 좌표)에 기초하여 특정되는 벡터(201, 202)가 결정될 수 없거나 유효하지 않은 경우에는 모션 벡터가 지시 벡터로 서 결정될 수 있다. 또한, 사용자의 손 끝의 좌표(즉, 제1 신체 좌표) 및 사용자의 눈의 좌표(즉, 제2 신체 좌 표)에 기초하여 특정되는 벡터(201, 202)와 모션 벡터가 결정될 수 없거나 유효하지 않은 경우에는, 제어 대상 영역에 수직인 벡터인 수직 벡터(예를 들어, 트리거 좌표 또는 제1 좌표를 지나는 벡터)가 지시 벡터 로서 결정될 수 있다. 다음으로, 본 발명의 일 실시예에 따른 제어 위치 관리부는 제어 수단의 위치가 변동되면, 그 위치가 변동 되기 전 지시 벡터의 연장선에 기초하여 특정되는 가상의 기준 지점과 위의 위치가 변동된 후 제어 수단의 모션 좌표를 연결하는 벡터(이하, \"연결 벡터\"라 한다.)를 참조하여 제어 대상 영역에서의 제어 위치를 결정하는 기 능을 수행할 수 있다. 예를 들어, 제어 위치 관리부는 제어 수단의 위치가 변동되면, 그 위치가 변동되기 전 지시 벡터가 향하는 방향의 반대 방향의 연장선상에 존재하는 소정의 지점을 가상의 기준 지점으로 특정하고 그 가상의 기준 지점과 위의 위치가 변동된 후 제어 수단의 모션 좌표를 연결하는 벡터를 결정할 수 있으며, 위의 연결 벡터의 연장선 과 제어 대상 영역이 교차하는 지점(또는 영역)을 제어 위치로 결정할 수 있다. 보다 구체적으로, 도 3을 참조하면, 지시 벡터가 모션 벡터이고 제어 수단의 위치가 변동되는 경우에, 제어 위 치 관리부는 그 위치가 변동되기 전 모션 벡터가 향하는 방향의 반대 방향의 연장선상에 존재하 는 소정의 지점 중 모션 벡터(예를 들어, 모션 벡터의 시점 또는 종점)로부터 40 내지 50cm 떨어진 지점을 가상 의 기준 지점으로 특정하고 그 가상의 기준 지점과 위의 위치가 변동된 후 제어 수단의 모션 좌표 를 연결하는 벡터(즉, 연결 벡터)를 결정할 수 있으며, 그 벡터 또는 그 벡터의 연장선과 제어 대상 영역이 교차하는 지점을 제어 위치로 결정할 수 있다. 또한, 도 4를 참조하면, 지시 벡터가 수직 벡터이고 제어 수단의 위치가 변동되는 경우에, 제어 위치 관리부 는 그 위치가 변동되기 전 수직 벡터가 향하는 방향의 반대 방향의 연장선상에 존재하는 소정의 지점 중 수직 벡터(예를 들어, 수직 벡터의 시점 또는 종점)로부터 40 내지 50cm 떨어진 지점을 가상의 기준 지 점으로 특정하고 그 가상의 기준 지점과 위의 위치가 변동된 후 제어 수단의 모션 좌표를 연결 하는 벡터(즉, 연결 벡터)를 결정할 수 있으며, 그 벡터 또는 그 벡터의 연장선과 제어 대상 영 역이 교차하는 지점을 제어 위치로 결정할 수 있다. 또한, 제어 위치 관리부는 제어 수단의 위치가 변동되면, 그 위치 가 변동되기 전 제어 수단의 모션 좌표 를 참조하여 특정되는 제1 가이드 벡터와 위의 위치가 변동된 후 제어 수단의 모션 좌표를 참조하여 특정되는제2 가이드 벡터 사이의 관계(예를 들어, 위치 관계)에 기초하여 보정된 지시 벡터를 참조하여 제어 대상 영역 에서의 제어 위치를 결정하는 기능을 수행할 수 있다. 예를 들어, 제어 위치 관리부는 제어 수단의 위치가 변동되면, 그 위치가 변동되기 전 제어 수단의 모션 좌표를 참조하여 특정되는 제1 가이드 벡터 및 위의 위치가 변동된 후 제어 수단의 모션 좌표를 참조하여 특정 되는 제2 가이드 벡터 사이의 위치 또는 방향의 변화 정도에 기초하여 지시 벡터를 평행 이동(예를 들어, 제1 가이드 벡터 및 제2 가이드 벡터 사이의 위치(보다 구체적으로, 각 가이드 벡터의 종점 또는 각 시점 사이의 위 치)가 변화된 만큼 평행 이동) 또는 지시 벡터가 향하는 방향(예를 들어, 제1 가이드 벡터 및 제2 가이드 벡터 사이의 방향 또는 각도가 변화된 만큼 방향)을 보정할 수 있으며, 그 보정된 지시 벡터 또는 그 보정된 지시 벡 터의 연장선과 제어 대상 영역이 교차하는 지점(또는 영역)을 제어 위치로 결정할 수 있다. 이러한 가이드 벡 터는 제어 수단(또는 사용자의 제어 의도)과 연관되는 방향을 특정하기 위하여 설정되는 벡터로서, 예를 들어, 제어 수단의 모션 좌표 및 그 모션 좌표와 연관되는 제어 수단의 다른 좌표를 연결하여 특정되는 벡터일 수 있 다. 보다 구체적으로, 제어 수단의 모션 좌표가 손의 검지 끝의 좌표인 경우에, 검지 끝을 종점으로 하고 검지 의 마디(또는 조인트)의 좌표를 시점으로 하는 벡터(예를 들어, 핑거 벡터)가 가이드 벡터로 특정되거나, 제어 수단의 모션 좌표가 손바닥 중심의 좌표인 경우에, 검지 끝을 종점으로 하고 손바닥 중심의 좌표를 시점으로 하 는 벡터가 가이드 벡터로 특정될 수 있다. 한편, 본 발명에 따른 위의 다른 좌표가 반드시 제어 수단의 다른 좌표로만 한정되지 않고, 제어 수단 외 그 제어 수단과 인접한 다른 것의 좌표로 변경될 수도 있음을 밝혀 둔다. 보다 구체적으로, 도 5를 참조하면, 지시 벡터가 모션 벡터이고 제어 수단의 위치가 변동되는 경우에, 제 어 위치 관리부는 그 위치가 변동되기 전 제어 수단의 모션 좌표(예를 들어, 손의 검지 끝의 좌표)를 참조하여 특정되는 제1 핑거 벡터(예를 들어, 검지 끝의 좌표를 종점으로 하고 검지의 마디의 좌표를 시점 으로 하는 벡터)(즉, 가이드 벡터) 및 위의 위치가 변동된 후 제어 수단의 모션 좌표를 참조하여 특정되는 제2 핑거 벡터 사이의 위치의 변화 정도 및 방향의 변화 정도를 참조하여, 모션 벡터를 평 행 이동(예를 들어, 그 위치 변화만큼 평행 이동)하고 그 모션 벡터가 향하는 방향(예를 들어, 그 방향 변 화만큼 회전 변환)을 보정함으로써 보정된 모션 벡터를 결정할 수 있다. 그 다음에, 그 보정된 모션 벡터 또는 그 보정된 모션 벡터의 연장선과 제어 대상 영역이 교차하는 지점을 제어 위치로 결정할 수 있다. 또한, 도 6을 참조하면, 지시 벡터가 수직 벡터이고 제어 수단의 위치가 변동되는 경우에, 제어 위치 관리 부는 그 위치가 변동되기 전 제어 수단의 모션 좌표(예를 들어, 손의 검지 끝의 좌표)를 참조하여 특 정되는 제1 핑거 벡터(예를 들어, 검지 끝의 좌표를 종점으로 하고 검지의 마디의 좌표를 시점으로 하는 벡터)(즉, 가이드 벡터) 및 위의 위치가 변동된 후 제어 수단의 모션 좌표를 참조하여 특정되는 제2 핑거 벡터 사이의 위치의 변화 정도 및 방향의 변화 정도를 참조하여, 수직 벡터를 평행 이동(예를 들어, 그 위치 변화만큼 평행 이동)하고 그 지시 벡터가 향하는 방향(예를 들어, 그 방향 변화만큼 회전 변환)을 보정함으로써 보정된 수직 벡터를 결정할 수 있다. 그 다음에, 그 보정된 수직 벡터 또는 그 보정된 수직 벡터의 연장선과 제어 대상 영역이 교차하는 지점을 제어 위치로 결정할 수 있다. 한편, 본 발명의 일 실시예에 따라 제어 수단의 방향이 더 변동되는 경우를 고려해 볼 수 있다. 여기서, 제어 수단의 방향은 사용자의 제어 의도와 연관되는 방향을 의미하며, 제어 수단의 모션 좌표 및 그 모션 좌표와 연 관되는 제어 수단의 다른 좌표에 기초하여 특정되거나 제어 수단의 형상에 기초하여 특정되는 것일 수 있다. 예를 들어, 제어 수단의 모션 좌표가 손의 검지 끝의 좌표인 경우에, 검지가 가리키는 방향이 제어 수단의 방향 일 수 있다. 이러한 제어 수단의 방향은 앞서 살펴본 가이드 벡터의 방향과 동일할 수도 있지만, 필요에 따라 다르게 설정될 수도 있다. 예를 들어, 본 발명의 일 실시예에 따라 제어 위치 관리부는 제어 수단의 위치 및 방향이 변동되면, 그 위 치 및 방향이 변동되기 전 제어 수단의 모션 좌표 및 제어 수단의 방향을 참조하여 특정(예를 들어, 위의 위치 및 방향이 변동되기 전 제어 수단의 모션 좌표를 시점으로 제어 수단의 방향과 동일하거나 평행한 방향으로 연 장되어 제어 대상 영역과 만나는 점을 종점으로 하여 특정되거나, 위의 위치 및 방향이 변동되기 전 제어 수단 의 모션 좌표를 시점으로 제어 수단의 방향과 동일하거나 평행한 방향으로 소정 길이만큼 연장되어 특정)되는 제1 가이드 벡터와 위의 위치 및 방향이 변동된 후 제어 수단의 모션 좌표 및 제어 수단의 방향을 참조하여 특 정(예를 들어, 위의 위치 및 방향이 변동된 후 제어 수단의 모션 좌표를 시점으로 제어 수단의 방향과 동일하거 나 평행한 방향으로 연장되어 제어 대상 영역과 만나는 점을 종점으로 하여 특정되거나, 위의 위치 및 방향이 변동되기 전 제어 수단의 모션 좌표를 시점으로 제어 수단의 방향과 동일하거나 평행한 방향으로 소정 길이만큼 연장되어 특정)되는 제2 가이드 벡터 사이의 관계(예를 들어, 위치 또는 방향 사이의 관계)에 기초하여 보정된지시 벡터를 참조하여 제어 대상 영역에서의 제어 위치를 결정하는 기능을 수행할 수 있다. 또한, 제어 위치 관리부는 사용자의 객체 제어 패턴(또는 사용자의 선호 제어 패턴)을 참조하여 위의 연결 벡터 및 위의 보정된 지시 벡터 중 해당 사용자의 객체 제어에 이용될 벡터를 결정할 수 있고, 그 벡터의 연장 선과 제어 대상 영역이 교차하는 지점을 제어 위치로 결정할 수 있다. 예를 들어, 제어 위치 관리부는 위의 연결 벡터 및 위의 보정된 지시 벡터 중 사용자에 의해 소정 수준 이 상으로 빈번 사용되는 벡터, 사용자의 피드백을 참조하여 특정되는 벡터(예를 들어, 정확도 또는 만족도가 높은 것으로 특정되는 벡터) 또는 사용자의 사용 패턴을 분석 또는 학습하여 특정되는 벡터를 해당 사용자의 객체 제 어에 이용될 벡터로 결정할 수 있다. 다음으로, 본 발명의 일 실시예에 따르면, 통신부는 지시 벡터 결정부 및 제어 위치 관리부로부 터의/로의 데이터 송수신이 가능하도록 하는 기능을 수행할 수 있다. 마지막으로, 본 발명의 일 실시예에 따르면, 제어부는 지시 벡터 결정부, 제어 위치 관리부 및 통신부 간의 데이터의 흐름을 제어하는 기능을 수행할 수 있다. 즉, 본 발명에 따른 제어부는 객체 제어 지원 시스템의 외부로부터의/로의 데이터 흐름 또는 객체 제어 지원 시스템의 각 구성요소 간의 데이터 흐름을 제어함으로써, 지시 벡터 결정부, 제어 위치 관리부 및 통신부에서 각각 고유 기 능을 수행하도록 제어할 수 있다. 모션 벡터의 결정 과정 이하에서는, 앞서 살펴본 모션 벡터를 결정하는 과정에 대하여 자세히 살펴보기로 한다. 본 발명의 일 실시예에 따른 지시 벡터 결정부는 제어 수단의 모션 좌표 중 제어 수단의 이동에 관한 트리 거 이벤트가 발생되는 시점(時點)에서의 좌표를 트리거 좌표로서 참조하여 제1 좌표를 결정하는 기능을 수행할 수 있다. 예를 들어, 지시 벡터 결정부는 제어 수단의 모션 좌표 중 제어 수단이 제어 대상 영역을 향하여 전진 후 정지하는 트리거 이벤트가 발생되는 시점에서의 좌표 즉, 트리거 좌표를 제1 좌표로 결정할 수 있다. 다른 예를 들어, 지시 벡터 결정부는 제어 수단이 제어 대상 영역을 향하여 전진 후 후진하는 트리거 이벤 트가 발생된 경우에, 그 트리거 이벤트가 발생되는 시점에서의 제어 수단의 모션 좌표 즉, 트리거 좌표를 기준 으로 소정의 이전(previous) 시점(예를 들어, 바로 직전 시점)에서의 제어 수단의 모션 좌표를 제1 좌표로 결정 할 수 있다. 여기서의, 소정의 이전 시점은 제어 수단을 촬영하는 촬영 모듈(예를 들어, 카메라)의 촬영 간격 또는 프레임 속도에 기초하여 특정되는 것일 수 있다. 또한, 트리거 이벤트가 발생되는 시점에서는 제어 수단의 흔들림이 발생될 수 있는데, 이를 보정하기 위하여 지 시 벡터 결정부는 트리거 좌표를 기준으로 특정되는 제어 수단의 적어도 하나의 모션 좌표를 참조하여 제1 좌표를 결정할 수 있다. 예를 들어, 지시 벡터 결정부는 트리거 좌표가 특정되는 시점을 기준으로 소정 시간 동안 특정되는 제어 수단의 복수의 모션 좌표를 통계 분석하여 제1 좌표를 결정할 수 있다. 본 발명의 일 실시예에 따른 통계 분석 에는 복수의 모션 좌표에 대한 평균, 가중 평균, 분산, 표준 편차 등에 기초한 분석이 포함될 수 있다. 보다 구체적으로, 지시 벡터 결정부는 트리거 좌표가 특정되는 시점을 기준으로 0.01초 내지 0.1초 동안에 특정 되는 복수의 모션 좌표의 평균 좌표를 제1 좌표로 결정할 수 있다. 다른 예를 들어, 지시 벡터 결정부는 트리거 좌표로부터 소정 거리 이내에 존재하는 제어 수단의 복수의 모션 좌표를 통계 분석하여 제1 좌표를 결정할 수 있다. 보다 구체적으로, 지시 벡터 결정부는 트리거 좌 표로부터 5 내지 10mm 이내에서 특정되는 제어 수단의 복수의 모션 좌표의 평균 좌표를 제1 좌표로 결정할 수 있다. 한편, 지시 벡터 결정부는 위의 트리거 좌표 및 그 트리거 좌표로부터 소정 거리 이내의 모션 좌표 중 적 어도 하나를 통계 분석의 대상에서 제외되도록 할 수 있다. 예를 들어, 지시 벡터 결정부는 제어 수단이 전진 후 정지하거나 제어 수단이 전진 후 후진하는 트리거 이 벤트가 발생하게 되면 그 트리거 이벤트가 발생되는 시점을 기준으로 특정되는 트리거 좌표 및 그 트리거 좌표 로부터 5mm 이내의 모션 좌표는 흔들림이 클 수 있기 때문에, 트리거 좌표 및 그 트리거 좌표로부터 5mm 이내의 모션 좌표는 통계 분석의 대상에서 제외되도록 할 수 있다.또한, 지시 벡터 결정부는 트리거 좌표 또는 제1 좌표와 제어 수단의 모션 좌표 사이의 거리를 참조하여 제2 좌표를 결정할 수 있다. 예를 들어, 지시 벡터 결정부는 트리거 좌표 또는 제1 좌표와 제어 수단의 모션 좌표 사이의 거리가 소정 수준 이상이 되는 시점에서의 제어 수단의 모션 좌표를 제2 좌표로 결정할 수 있다. 보다 구체적으로, 도 7을 참조하면, 지시 벡터 결정부는 트리거 좌표 및 제어 수단의 모션 좌표 사이의 거리가 40 내지 50mm 이상이 되는 시점에서의 제어 수단의 모션 좌표를 제2 좌표로 결정할 수 있다. 다른 예를 들어, 지시 벡터 결정부는 트리거 좌표로부터 거리가 소정 수준 이상이 되는 제어 수단의 모션 좌표 중 제1 좌표가 특정되는 시점을 기준으로 가장 근접한 시점의 모션 좌표를 제2 좌표로 결정할 수 있다. 보다 구체적으로, 도 7을 참조하면, 지시 벡터 결정부는 트리거 좌표로부터 거리가 50mm 이상인 제어 수단의 모션 좌표 중 제1 좌표가 특정되는 시점을 기준으로 가장 근접한 시점의 모션 좌표를 제2 좌 표로 결정할 수 있다. 또한, 지시 벡터 결정부는 트리거 좌표 또는 제1 좌표와 제어 수단의 모션 좌표에 의해 특정되는 직선 구 간을 참조하여 제2 좌표를 결정할 수 있다. 예를 들어, 지시 벡터 결정부는 제1 좌표(또는 트리거 좌표)가 특정되는 시점을 기준으로 시간적으로 인접 한 다른 시점에서의 제어 수단의 모션 좌표 각각을 위의 제1 좌표(또는 트리거 좌표)와 연결하여 직선 구간이 특정되는 모션 좌표 중 위의 제1 좌표(또는 트리거 좌표)로부터 가장 먼 거리에 존재하는 모션 좌표를 제2 좌표 로서 결정할 수 있다. 여기서, 제1 좌표(또는 트리거 좌표)가 특정되는 시점으로부터 위의 다른 시점까지의 시 간적으로 인접한 모든 모션 좌표가 위의 제1 좌표(또는 트리거 좌표)와 위의 다른 시점에서의 제어 수단의 모션 좌표를 연결하는 직선으로부터 소정 거리 이내에 존재하면, 직선 구간이 특정될 수 있는 것일 수 있다. 보다 구체적으로, 지시 벡터 결정부는 제1 좌표(또는 트리거 좌표)가 특정되는 시점이 제1 시점이고, 그 제1 시점을 기준으로 시간적으로 인접한 제2 시점에서의 제어 수단의 모션 좌표가 제2 모션 좌표이며, 그 제2 시점을 기준으로 시간적으로 인접한 제3 시점에서의 제어 수단의 모션 좌표가 제3 모션 좌표이고, 그 제3 시점 을 기준으로 시간적으로 인접한 제4 시점에서의 제어 수단의 모션 좌표가 제4 모션 좌표인 경우에, 제1 좌표(또 는 트리거 좌표)와 제3 모션 좌표를 연결하는 직선으로부터 제2 모션 좌표가 소정 거리 이내에 존재하는 경우에, 지시 벡터 결정부는 제1 좌표(또는 트리거 좌표), 제2 모션 좌표 및 제3 모션 좌표가 직선 구간인 것으로 특정할 수 있다. 또한, 제1 좌표(또는 트리거 좌표)와 제4 모션 좌표를 연결하는 직선으로부터 제2 모 션 좌표 및 제3 모션 좌표가 모두 소정 거리 이내에 존재하는 경우에, 지시 벡터 결정부는 제1 좌표(또는 트리거 좌표), 제2 모션 좌표, 제3 모션 좌표 및 제4 모션 좌표가 직선 구간인 것으로 특정할 수 있다. 또한, 지시 벡터 결정부는 제1 좌표(또는 트리거 좌표)가 특정되는 시점을 기준으로 시간적으로 인접한 다 른 시점에서의 제어 수단의 모션 좌표를 시간적으로 인접한 순서대로 각각 연결하여 특정될 수 있는 직선 구간 중 가장 긴 직선 구간을 특정하고, 그 가장 긴 직선 구간에 존재하는 제어 수단의 복수의 모션 좌표 중 제1 좌 표(또는 트리거 좌표)로부터 가장 먼 거리에 위치하는 모션 좌표를 제2 좌표로 결정할 수 있다. 한편, 직선 구 간에 존재하는 제어 수단의 복수의 모션 좌표 사이의 간격은 소정 거리 이내일 수 있다. 또한, 도 8을 참조하면, 지시 벡터 결정부는 제1 좌표가 특정되는 시점이 제1 시점이고, 제1 시점을 기준으로 시간적으로 인접한 제2 시점에서의 제어 수단의 모션 좌표가 제2 모션 좌표이며, 제2 시점을 기 준으로 시간적으로 인접한 제3 시점에서의 제어 수단의 모션 좌표가 제3 모션 좌표이고, 제3 시점을 기준 으로 시간적으로 인접한 제4 시점에서의 제어 수단의 모션 좌표가 제4 모션 좌표인 경우에, 제1 좌표(82 1)와 제2 모션 좌표를 연결하는 제1 직선 구간, 제1 좌표와 제3 모션 좌표를 연결하는 제2 직선 구간 및 제1 좌표와 제4 모션 좌표를 연결하는 제3 직선 구간을 특정 가능한 직선 구간으로 결정하고, 그 복수의 직선 구간(즉, 제1 직선 구간, 제2 직선 구간 및 제3 직선 구간) 중 가장 긴 직선 구간에 존재하는 제3 직선 구간 내 복수의 모션 좌표 중 제1 좌표로부터 가장 먼 거리에 존재하는 모션 좌표(82 4)를 제2 좌표로 결정할 수 있다. 한편, 지시 벡터 결정부는 트리거 좌표(또는 제1 좌표)와 제어 수단의 모션 좌표 사이의 거리를 참조하여 결정되는 좌표 및 제1 좌표(또는 트리거 좌표)와 제어 수단의 모션 좌표에 의해 특정되는 직선 구간을 참조하여 결정되는 좌표 중 제1 좌표(또는 트리거 좌표)에 가까운 좌표를 제2 좌표로서 결정할 수 있다. 예를 들어, 도 9를 참조하면, 지시 벡터 결정부는 (i) 트리거 좌표와 제어 수단의 모션 좌표 사이의 거리 가 소정 수준 이상이 되는 시점에서의 제어 수단의 모션 좌표(910, 912, 914, 916, 920, 922) 및 (ii) 제1 좌표가 특정되는 시점을 기준으로 시간적으로 인접한 다른 시점에서의 제어 수단의 모션 좌표 각각을 위의 제1 좌 표와 연결하여 직선 구간이 특정될 수 있는 모션 좌표 중 위의 제1 좌표로부터 가장 먼 거리에 위치하는 모션 좌표(911, 913, 915, 917, 921, 923)를 결정하고, 복수의 모션 좌표(910, 911, 912, 913, 914, 915, 916, 917, 920, 921, 922, 923) 중 제1 좌표에 가까운 모션 좌표(911, 913, 915, 917, 920, 922)를 제2 좌표로 결정할 수 있다. 또한, 지시 벡터 결정부는 제1 좌표 및 제2 좌표에 기초하여 결정되는 모션 벡터를 결정할 수 있다. 예를 들어, 지시 벡터 결정부는 위의 제2 좌표를 시점으로 하고, 위의 제1 좌표를 종점으로 하는 벡터를 모션 벡터로서 결정할 수 있다. 한편, 지시 벡터 결정부는 트리거 좌표 또는 제1 좌표와 제어 수단의 모션 좌표 사이의 거리가 소정 수준 이상이 되는 모션 좌표가 존재하지 않는 경우에 모션 벡터가 특정될 수 없는 것으로 결정할 수 있다. 예를 들어, 도 10을 참조하면, 지시 벡터 결정부는 트리거 좌표 또는 제1 좌표와 제어 수단의 모션 좌표에 의해 특정되는 직선 구간을 참조하여 결정되는 제2 좌표(1001, 1002)가 특정될 수 있더라도, 트리거 좌표 또는 제1 좌표와 제어 수단의 모션 좌표 사이의 거리를 참조하여 결정되는 제2 좌표가 특정될 수 없다면, 모션 벡터 가 특정될 수 없는 것으로 결정할 수 있다. 또한, 지시 벡터 결정부는 모션 벡터의 길이, 속도, 방향 및 제1 좌표의 위치 중 적어도 하나를 참조하여 모션 벡터의 유효성을 검증할 수 있다. 예를 들어, 지시 벡터 결정부는 모션 벡터의 길이를 소정 배수 스케일링한 길이가 제어 대상 영역 및 제1 좌표 사이의 길이보다 긴 경우에 해당 모션 벡터를 유효한 모션 벡터로 결정할 수 있다. 다른 예를 들어, 지시 벡터 결정부는 모션 벡터의 길이에 기초하여 유효 영역을 특정하고, 그 유효 영역 내에 제어 대상 영역이 존재하는 경우에 해당 모션 벡터를 유효한 모션 벡터로 결정할 수 있다. 보다 구체적으 로, 도 11을 참조하면, 지시 벡터 결정부는 모션 벡터의 길이를 소정 수준만큼 스케일링하여 특정되는 영 역(또는 연장되는 영역)을 유효 영역으로 특정하고, 그 유효 영역과 제어 대상 영역 사이의 공통 영역이 존재하는 경우에 해당 벡터를 유효한 모션 벡터로 결정할 수 있다. 또 다른 예를 들어, 지시 벡터 결정부는 모션 벡터의 길이가 소정 길이(예를 들어, 10 내지 20mm)보다 긴 경우에 해당 모션 벡터를 유효한 모션 벡터로 결정할 수 있다. 또 다른 예를 들어, 지시 벡터 결정부는 모션 벡터의 속도가 소정 속도(예를 들어, 10mm/s 내지 20mm/s) 이상인 경우에 해당 모션 벡터를 유효한 모션 벡터로 결정할 수 있다. 또 다른 예를 들어, 도 12를 참조하면, 지시 벡터 결정부는 모션 벡터 및 제어 대상 영역이 이루어는 각도 (구체적으로, 제어 대상 영역의 법선 벡터가 이루는 각)가 소정 각도 이내(예를 들어, -45도≤θx≤45도이고, 30도≤θy≤60도 이내)인 경우에 해당 모션 벡터를 유효한 모션 벡터로 결정할 수 있다. 또 다른 예를 들어, 지시 벡터 결정부는 위의 제1 좌표(즉, 모션 벡터의 종점)가 제어 대상 영역으로부터 소정 거리 이내(예를 들어, 100mm 이내)에 존재하는 경우에 해당 모션 벡터를 유효한 모션 벡터로 결정할 수 있 다. 한편, 도 13 및 도 14를 참조하면, 사용자의 시선 또는 헤드 포즈에 의해 특정되는 주시 벡터를 이용하여 모션 벡터의 유효성이 검증될 수도 있다. 예를 들어, 본 발명에 따른 모션 벡터를 이용하여 제어 대상 영역에서 특정되는 제1 제어 위치와 사용자의 시선 또는 헤드 포즈에 의해 특정되는 주시 벡터를 이용하여 제어 대상 영역에서 특정되는 제2 제어 위치 사이의 오 차가 소정 수준 이하인 경우에, 해당 모션 벡터가 유효한 모션 벡터로서 결정될 수 있다. 제1 실시예 이하에서는, 본 발명의 일 실시예에 따르면, 객체 제어 지원 시스템이 포함된 디바이스을 이용하는 사용자에게 본 발명에 따른 객체 제어가 지원되는 상황을 살펴보기로 한다. 본 발명의 일 실시예에 따른 제어 수단은 사용자의 손 끝(예를 들어, 검지 끝)일 수 있다. 먼저, 본 발명의 일 실시예에 따른 디바이스는 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리가 소 정 수준 이하(예를 들어, 8cm 사이)이고 제어 수단의 이동에 관한 트리거 이벤트가 발생되는 경우에, 사용자의손 끝의 모션 좌표 중 제어 대상 영역을 향해 나아가는 방향으로 전진 후 정지하는 트리거 이벤트가 발생되는 시점(時點)에서의 좌표를 트리거 좌표로서 참조하여 제1 좌표를 결정할 수 있다. 예를 들어, 사용자의 손 끝이 제어 대상 영역을 향해 나아가는 방향으로 전진 후 정지하는 트리거 이벤트가 발 생되는 경우에, 사용자의 손 끝의 모션 좌표 중 그 트리거 이벤트가 발생되는 시점에서의 좌표 즉, 트리거 좌표 가 제1 좌표로 결정될 수 있다. 그 다음에, 위의 트리거 좌표와 사용자의 손 끝의 모션 좌표 사이의 거리 및 위의 제1 좌표와 사용자의 손 끝의 모션 좌표에 의해 특정되는 직선 구간을 참조하여 제2 좌표가 결정될 수 있다. 구체적으로, 위의 트리거 좌표와 사용자의 손 끝의 모션 좌표 사이의 거리를 참조하여 결정되는 좌표 및 제1 좌 표(또는 트리거 좌표)와 사용자의 손 끝의 모션 좌표에 의해 특정되는 직선 구간을 참조하여 결정되는 좌표 중 위의 제1 좌표에 가까운 좌표가 제2 좌표로 결정될 수 있다. 그 다음에, 위의 제2 좌표를 시점으로 하고 위의 제1 좌표를 종점으로 하여 특정되는 벡터(즉, 모션 벡터)의 길 이, 속도, 방향 및 위의 제1 좌표의 위치 중 적어도 하나를 참조하여 위의 모션 벡터의 유효성이 검증될 수 있 다. 그 다음에, 위의 모션 벡터가 유효한 것으로 결정되는 경우에, 모션 벡터가 지시 벡터로 결정될 수 있고, 제어 대상 영역 중 모션 벡터의 연장선과 만나는 영역이 사용자에 의해 의도되는 제어 위치로 결정될 수 있다. 한편, 본 발명의 일 실시예에 따라 앞서 설명된 트리거 이벤트의 발생과 연관되는 방향(예를 들어, 트리거 이벤 트의 발생 여부의 기준이 되는 방향)은 지시 벡터의 유형(또는 그 지시 벡터가 특정되는 기준) 또는 제어 수단 의 모션 좌표와 제어 대상 영역 사이의 거리에 따라 결정될 수도 있다. 예를 들어, 본 발명의 일 실시예에 따른 지시 벡터 중 지칭 벡터의 경우에는 사용자의 특정 신체 부위(예를 들 어, 눈)를 기준으로 그 방향(즉, 트리거 이벤트의 발생 여부의 기준이 되는 방향)이 특정될 수 있고, 지시 벡터 중 모션 벡터의 경우에는 모션 벡터(또는 그 연장선)에 기초하여 특정되는 가상의 기준 지점을 기준으로 그 방 향(즉, 트리거 이벤트의 발생 여부의 기준이 되는 방향)이 특정될 수 있으며, 지시 벡터 중 수직 벡터의 경우에 는 제어 대상 영역을 기준으로 그 방향(즉, 트리거 이벤트의 발생 여부의 기준이 되는 방향)이 특정되거나 수직 벡터(또는 그 연장선)에 기초하여 특정되는 가상의 기준 지점을 기준으로 그 방향(즉, 트리거 이벤트의 발생 여 부의 기준이 되는 방향)이 특정될 수 있다. 다른 예를 들어, 본 발명의 일 실시예에 따른 제어 수단의 모션 좌표 및 제어 대상 영역과의 거리가 제1 거리 (예를 들어, 8cm) 이상인 경우에는 사용자의 특정 신체 부위(예를 들어, 눈)를 기준으로 그 방향(즉, 트리거 이 벤트의 발생 여부의 기준이 되는 방향)이 특정될 수 있고, 제어 수단의 모션 좌표 및 제어 대상 영역과의 거리 가 제1 거리 미만이고 제2 거리(예를 들어, 2.5cm) 이상인 경우에는 가상의 기준 지점(예를 들어, 모션 벡터(또 는 그 연장선)에 기초하여 특정되는 가상의 기준 지점)을 기준으로 그 방향(즉, 트리거 이벤트의 발생 여부의 기준이 되는 방향)이 특정될 수 있으며, 제어 수단의 모션 좌표 및 제어 대상 영역과의 거리가 제2 거리 미만 (예를 들어, 0cm 이상 제2 거리 미만)인 경우에는 제어 대상 영역을 기준으로 그 방향(즉, 트리거 이벤트의 발 생 여부의 기준이 되는 방향)이 특정되거나 가상의 기준 지점(예를 들어, 수직 벡터(또는 그 연장선)에 기초하 여 특정되는 가상의 기준 지점)을 기준으로 그 방향(즉, 트리거 이벤트의 발생 여부의 기준이 되는 방향)이 특 정될 수 있다. 한편, 본 발명에 따른 거리의 구분 방식(예를 들어, 구간의 수)이 반드시 앞서 열거된 것에만 한정되는 것은 아니면, 본 발명의 목적을 달성할 수 있는 범위 내에서 보다 세분화되는 등 다양하게 변형될 수 있음을 밝혀 둔다. 그 다음에, 도 15를 참조하면, 위의 사용자의 손 끝의 위치가 변동되는 경우에, 그 위치가 변동되기 전 모션 벡 터의 연장선에 기초하여 특정되는 가상의 기준 지점과 그 위치가 변동된 후 사용자의 손 끝의 모션 좌표를 연결 하는 벡터(즉, 연결 벡터)를 참조하여 제어 대상 영역에서의 변동될 제어 위치가 되거나, 위의 위치가 변동되기 전 사용자의 손 끝의 모션 좌표를 참조하여 특정되는 제1 가이드 벡터와 위의 위치가 변동된 후 사용자의 손 끝 의 모션 좌표를 참조하여 특정되는 제2 가이드 벡터 사이의 관계에 기초하여 보정된 위의 모션 벡터(즉, 보정된 모션 벡터)를 참조하여 제어 대상 영역에서의 변동될 제어 위치가 결정될 수 있다. 한편, 사용자의 객체 제어 패턴(또는 사용자에 기설정되는 객체 제어 방식)을 참조하여 위의 연결 벡터 및 위의 보정된 모션 벡터 중 해당 사용자의 객체 제어에 이용될 벡터가 결정될 수 있다. 제2 실시예 이하에서는, 본 발명의 일 실시예에 따르면, 객체 제어 지원 시스템이 포함된 디바이스을 이용하는 사용자에게 본 발명에 따른 객체 제어가 지원되는 다른 상황을 살펴보기로 한다. 본 발명의 일 실시예에 따른 제어 수단은 사용자의 손 끝(예를 들어, 검지 끝)일 수 있다. 먼저, 본 발명의 일 실시예에 따른 디바이스는 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리가 소 정 수준 이하(예를 들어, 2.5cm 이하)이고 제어 수단의 이동에 관한 트리거 이벤트가 발생되는 경우에, 사용자 의 손 끝의 모션 좌표 중 제어 대상 영역을 향해 나아가는 방향으로 전진 후 정지하는 트리거 이벤트가 발생되 는 시점(時點)에서의 좌표를 트리거 좌표로서 참조하여 제1 좌표를 결정할 수 있다. 그 다음에, 위의 트리거 좌표와 사용자의 손 끝의 모션 좌표 사이의 거리 및 위의 제1 좌표와 사용자의 손 끝의 모션 좌표에 의해 특정되는 직선 구간을 참조하여 제2 좌표가 결정될 수 있다. 그 다음에, 위의 제1 좌표 및 제2 좌표에 기초하여 결정되는 벡터(즉, 모션 벡터)의 길이, 속도, 방향 및 위의 제1 좌표의 위치 중 적어도 하나를 참조하여 위의 모션 벡터의 유효성이 검증될 수 있다. 그 다음에, 위의 제1 좌표 및 제2 좌표에 기초하여 결정되는 벡터(즉, 모션 벡터)가 유효하지 않은 경우에, 위 의 트리거 좌표 또는 제1 좌표를 지나고, 제어 대상 영역에 수직인 벡터(즉, 수직 벡터)가 지시 벡터로서 결정될 수 있다. 그 다음에, 다시 도 15를 참조하면, 위의 사용자의 손 끝의 위치가 변동되는 경우에, 그 위치가 변동되기 전 수 직 벡터의 연장선에 기초하여 특정되는 가상의 기준 지점과 그 위치가 변동된 후 사용자의 손 끝의 모션 좌표를 연결하는 벡터(즉, 연결 벡터)를 참조하여 제어 대상 영역에서의 변동될 제어 위치가 결정되거나, 위의 위치가 변동되기 전 사용자의 손 끝의 모션 좌표를 참조하여 특정되는 제1 가이드 벡터와 위의 위치가 변동된 후 사용 자의 손 끝의 모션 좌표를 참조하여 특정되는 제2 가이드 벡터 사이의 관계에 기초하여 보정된 위의 수직 벡터 (즉, 보정된 수직 벡터)를 참조하여 제어 대상 영역에서의 변동될 제어 위치가 결정될 수 있다. 한편, 사용자 의 객체 제어 패턴(또는 사용자에 기설정되는 객체 제어 방식)을 참조하여 위의 연결 벡터 및 위의 보정된 수직 벡터 중 해당 사용자의 객체 제어에 이용될 벡터가 결정될 수 있다. 가상의 기준 지점의 특정과 연관된 확장적인 실시예 본 발명의 일 실시예에 따른 제어 수단이 제어 대상 영역과 근접하거나 멀어지는 과정에서 트리거 이벤트의 발 생 여부 또는 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리에 따라 각각의 시점(時點)별로 지시 벡터가 결정(즉, 복수의 지시 벡터가 결정)될 수 있게 된다. 이하에서는, 이러한 경우에 가상의 기준 지점 및 제어 위 치가 결정되는 구체적인 상황을 살펴보기로 한다. 예를 들어, 도 17을 참조하면, 본 발명의 일 실시예에 따라 t시점에서의 제어 수단의 모션 좌표가 PFTt이고, t시 점에서의 가상의 기준 지점이 RPt이며, t시점에서의 제어 대상 영역에서의 제어 위치가 Ct인 경우에, t=-5 시점 에는 모션 벡터가 유효하게 결정되지 않아 이에 기초한 가상의 기준 지점이 특정되지 않고 제어 대상 영역에서 의 제어 위치 C-5도 결정되지 않을 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=-4 시점에 모션 벡터가 유효하게 결정되면 그 모션 벡터에 기초하여 가상의 기준 지점 RP-4가 특정될 수 있으며, 가상의 기준 지점 RP-4 및 제어 수단의 모션 좌표 PFT-4에 기초하여 제어 대상 영역에서의 제어 위치 C- 4가 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=-3 시점에 모션 벡터가 유효하게 결정되 면 그 모션 벡터에 기초하여 가상의 기준 지점 RP-3이 특정될 수 있으며, 가상의 기준 지점 RP-3 및 제어 수단의 모션 좌표 PFT-3에 기초하여 제어 대상 영역에서의 제어 위치 C-3이 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=-2 시점에 모션 벡터가 유효하게 결정되면 그 모션 벡터에 기초하여 가상의 기준 지점 RP-2가 특정될 수 있으며, 가상의 기준 지점 RP-2 및 제어 수단의 모션 좌표 PFT- 2에 기초하여 제어 대상 영역에서의 제어 위치 C-2가 결정될 수 있다. 그 다음에, 본 발명의 일 실 시예에 따른 t=-1 시점에 모션 벡터가 유효하게 결정되면 그 모션 벡터에 기초하여 가상의 기준 지점 RP- 1이 특정될 수 있으며, 가상의 기준 지점 RP-1 및 제어 수단의 모션 좌표 PFT-1에 기초하여 제 어 대상 영역에서의 제어 위치 C-1이 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=0 시점 에 모션 벡터가 유효하게 결정되지 않으면 이에 기초한 가상의 기준 지점이 특정되지 않고, 이전 시점에서의 유 효한 가상의 기준 지점(구체적으로, 직전 또는 최근 시점에서의 유효한 가상의 기준 지점)인 RP-1 및 제어수단의 모션 좌표 PFT0에 기초하여 제어 대상 영역에서의 제어 위치 C0가 결정될 수 있다. 또한, 본 발명의 일 실시예에 따라 이전 시점에서의 유효한 가상의 기준 지점(구체적으로, 직전 또는 최근 시점 에서의 유효한 가상의 기준 지점)에 기초하여 현재의 가상의 기준 지점이 보정되는 과정을 살펴보기로 한다. 도 18을 참조하면, 본 발명의 일 실시예에 따라 먼저, t=-5 시점에 모션 벡터가 유효하게 결정되지 않으면, 이 에 기초한 가상의 기준 지점이 특정되지 않고 제어 대상 영역에서의 제어 위치 C-5도 결정되지 않을 수 있 다. 그 다음에, 본 발명의 일 실시예에 따른 t=-4 시점에 모션 벡터가 유효하게 결정되면 그 모션 벡터에 기초 하여 가상의 기준 지점 RP-4가 특정될 수 있고, 가상의 기준 지점 RP-4 및 제어 수단의 모션 좌표 PFT-4에 기초하여 제어 대상 영역에서의 제어 위치 C-4가 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=-3 시점에 모션 벡터가 유효하게 결정되면 그 모션 벡터에 기초하여 가상의 기준 지점 RP- 3이 특정될 수 있으며, 이전 시점(또는 직전 시점)에서의 유효한 가상의 기준 지점 RP-4 및 현재의 가상의 기준 지점 RP-3에 기초하여 특정(예를 들어, 두 지점의 좌표에 대한 통계적 분석을 통해 특정될 수 있으며, 이러한 통계적 분석에는, 평균, 가중 평균, 분산, 표준 편차 등이 이용될 수 있음)되는 가상의 기준 지 점 RP'-3과 제어 수단의 모션 좌표 PFT-3에 기초하여 제어 대상 영역에서의 제어 위치 C'-3이 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=-2 시점에 모션 벡터가 유효하게 결정되면 그 모션 벡터에 기초하여 가상의 기준 지점 RP-2가 특정될 수 있으며, 이전 시점에서의 유효한 가상의 기준 지점 RP'-3 및 현재의 가상의 기준 지점 RP-2에 기초하여 특정(예를 들어, 두 지점의 좌표에 대한 통계적 분석을 통해 특정될 수 있으며, 이러한 통계적 분석에는, 평균, 가중 평균, 분산, 표준 편차 등이 이용될 수 있 음)되는 가상의 기준 지점 RP'-2와 제어 수단의 모션 좌표 PFT-2에 기초하여 제어 대상 영역에서의 제어 위치 C'-2가 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=-1 시점에 모션 벡터가 유 효하게 결정되면 그 모션 벡터에 기초하여 가상의 기준 지점 RP-1이 특정될 수 있으며, 이전 시점에서의 유효한 가상의 기준 지점 RP'-2 및 현재의 가상의 기준 지점 RP-1에 기초하여 특정(예를 들어, 두 지점의 좌표에 대한 통계적 분석을 통해 특정될 수 있으며, 이러한 통계적 분석에는, 평균, 가중 평균, 분산, 표준 편차 등이 이용될 수 있음)되는 가상의 기준 지점 RP'-1과 제어 수단의 모션 좌표 PFT-1에 기초 하여 제어 대상 영역에서의 제어 위치 C'-1이 결정될 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=0 시점에 모션 벡터가 유효하게 결정되지 않으면, 이에 기초한 가상의 기준 지점이 특정되지 않고, 이전 시점 에서의 유효한 가상의 기준 지점(구체적으로, 직전 또는 최근 시점에서의 유효한 가상의 기준 지점)인 RP'- 1 및 제어 수단의 모션 좌표 PFT0에 기초하여 제어 대상 영역에서의 제어 위치 C'0가 결정될 수 있다. 또한, 본 발명의 일 실시예에 따라 유효한 모션 벡터만을 이용하여 가상의 기준 지점이 특정되는 과정을 살펴보 기로 한다. 도 19를 참조하면, 본 발명의 일 실시예에 따라 먼저, t=-5 내지 -2 시점에 모션 벡터가 유효하게 결정되지 않 으면 이에 기초한 가상의 기준 지점이 특정되지 않고 제어 대상 영역에서의 제어 위치 C-5, C-4, C- 3 및 C-2도 결정되지 않을 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=-1 시점에 모션 벡 터가 유효하게 결정되면, 그 모션 벡터에 기초하여 가상의 기준 지점 RP-1이 특정될 수 있으며, 가상의 기 준 지점 RP-1 및 제어 수단의 모션 좌표 PFT-1에 기초하여 제어 대상 영역에서의 제어 위치 C- 1이 결정될 수 있다. 다음에, 본 발명의 일 실시예에 따른 t=0 시점에 모션 벡터가 유효하게 결정되지 않으면, 이에 기초한 가상의 기준 지점이 특정되지 않고, 이전 시점에서의 유효한 가상의 기준 지점(구체적으로, 직전 또는 최근 시점에서의 유효한 가상의 기준 지점)인 RP-1 및 제어 수단의 모션 좌표 PFT0에 기초하여 제어 대상 영역에서의 제어 위치 C0가 결정될 수 있게 된다. 다른 예를 들어, 도 20을 참조하면, 본 발명의 일 실시예에 따라 t시점에서의 제어 수단의 모션 좌표가 PFTt이고, t시점에서의 가상의 기준 지점이 RPt이고, t시점에서의 제어 대상 영역에서의 제어 위치가 Ct인 경우에, 먼저, t=-5 내지 -2 시점에 모션 벡터 및 수직 벡터(예를 들어, 제어 대상 영역과 제어 수단의 모션 좌표 사이의 거리가 소정 거리 이상에 해당되어 유효하지 않음)가 유효하게 결정되지 않아 이에 기초한 가상의 기 준 지점이 특정되지 않고, 제어 대상 영역에서의 제어 위치 C-5, C-4, C-3 및 C-2도 결 정되지 않을 수 있다. 그 다음에, 본 발명의 일 실시예에 따른 t=-1 시점에 모션 벡터가 유효하지 않고 수직 벡터가 유효(예를 들어, 제어 대상 영역과 제어 수단의 모션 좌표 사이의 거리가 소정 거리 이하에 해당)하게 결정되면 그 수직 벡터에 기초하여 가상의 기준 지점 RP-1이 특정될 수 있으며, 그 가상의 기준 지점 RP- 1 및 제어 수단의 모션 좌표 PFT-1에 기초하여 제어 대상 영역에서의 위치 C-1이 결정될 수 있 다. 다음에, 본 발명의 일 실시예에 따른 t=0 시점에 모션 벡터 및 수직 벡터(예를 들어, 제어 대상 영역과 제 어 수단의 모션 좌표 사이의 거리가 소정 거리 이상에 해당되어 유효하지 않음)가 유효하게 결정되지 않으면 이 에 기초한 가상의 기준 지점이 특정되지 않고 이전 시점에서의 유효한 가상의 기준 지점(구체적으로, 직전 또는 최근 시점에서의 유효한 가상의 기준 지점)인 RP-1 및 제어 수단의 모션 좌표 PFT0에 기초하여 제어 대상 영역에서의 제어 위치 C0가 결정될 수 있게 된다. 이상 설명된 본 발명에 따른 실시예들은 다양한 컴퓨터 구성요소를 통하여 수행될 수 있는 프로그램 명령어의 형태로 구현되어 비일시성의 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 비일시성의 컴퓨터 판독 가능한 기록 매체는 프로그램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 비일시성의 컴퓨터 판독 가능한 기록 매체에 기록되는 프로그램 명령어는 본 발명을 위하여 특별히 설계되 고 구성된 것들이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수도 있다. 비일시성 의 컴퓨터 판독 가능한 기록 매체의 예에는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM, DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨 어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니 라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 상기 하드웨어 장 치는 본 발명에 따른 처리를 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상에서 본 발명이 구체적인 구성요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명이 상기 실시예들에 한정되는 것은"}
{"patent_id": "10-2021-0005570", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "아니며, 본 발명이 속하는 기술분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형 을 꾀할 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등하게 또는 등가적으로 변형된 모든 것들은 본 발명의 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2021-0005570", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 객체 제어 지원 시스템의 내부 구성을 상세하게 도시하는 도면이다. 도 2는 본 발명의 일 실시예에 따라 제어 수단의 모션 좌표와 제어 대상 영역 사이의 거리에 따라 지시 벡터가 동적으로 결정되는 과정을 예시적으로 나타내는 도면이다. 도 3 내지 도 6은 본 발명의 일 실시예에 따라 제어 대상 영역에서 제어 위치가 변동되는 과정을 예시적으로 나 타내는 도면이다. 도 7 내지 도 12는 본 발명의 일 실시예에 따라 모션 벡터가 결정되는 과정을 예시적으로 나타내는 도면이다. 도 13 및 도 14는 본 발명의 일 실시예에 따라 지시 벡터에 의해 제어 대상 영역에서 제어 위치가 특정되는 과 정을 예시적으로 나타내는 도면이다. 도 15는 본 발명의 일 실시예에 따른 지시 벡터에 따라 제어 대상 영역에서 변동되는 제어 위치를 예시적으로 나타내는 도면이다. 도 16은 본 발명의 일 실시예에 따른 수직 벡터가 결정되는 과정을 예시적으로 나타내는 도면이다. 도 17 내지 도 20은 본 발명의 일 실시예에 따른 가상의 기준 지점이 특정되는 과정을 예시적으로 나타내는 도 면이다."}
