{"patent_id": "10-2018-0068272", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0141465", "출원번호": "10-2018-0068272", "발명의 명칭": "리니어 압축기 및 리니어 압축기의 제어 방법", "출원인": "엘지전자 주식회사", "발명자": "박대근"}}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실린더의 내부에서 왕복 운동하는 피스톤;상기 피스톤의 운동을 위하여, 구동력을 제공하는 모터;상기 모터와 관련된 모터전압 및 모터전류를 감지하는 감지부;상기 실린더의 일단에 설치되어, 실린더 내부에서 압축된 냉매의 토출을 조절하는 토출부;상기 감지부에 의해 감지된 상기 모터전압 및 모터전류 중 적어도 하나를 이용하여, 상기 피스톤의 운동과 관련된 적어도 하나의 제어파라미터를 연산하는 제어부; 및상기 제어파라미터를 입력받고, 인공신경망 기술을 이용하여 상기 피스톤의 절대위치와 관련된 보상 값을 출력하는 딥 러닝 연산부를 포함하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 피스톤의 운동과 관련된 스트로크 지령치를 생성하고,상기 연산된 제어파라미터의 변곡점을 검출함으로써, 상기 피스톤의 상사점과 상기 토출부 사이의 거리를 검출하고,검출된 거리가 상기 스트로크 지령치보다 작으면, 상기 딥 러닝 연산부의 출력을 이용하여 상기 모터를 제어하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는,검출된 거리가 상기 스크로크 지령치 이상이면, 상기 딥 러닝 연산부의 동작을 비활성화시키고, 상기 제어부에의해 연산된 제어파라미터를 이용하여 상기 모터를 제어하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는,상기 제어파라미터를 이용하여, 상기 리니어 압축기의 동작 상태가 정상인지 여부를 판단하고,상기 압축기의 동작 상태가 정상이면, 상기 딥 러닝 연산부의 출력을 이용하여 상기 모터를 제어하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는,상기 압축기의 동작 상태가 정상이 아닌 것으로 판단되면, 상기 딥 러닝 연산부의 동작을 비활성화시키고, 상기제어부에 의해 연산된 제어파라미터를 이용하여 상기 모터를 제어하는 것을 특징으로 하는 리니어 압축기.공개특허 10-2019-0141465-3-청구항 6 제1항에 있어서,상기 제어부는,상기 피스톤이 초기위치로부터 비대칭 왕복 운동을 수행하는 경우, 상기 딥 러닝 연산부의 동작을 비활성화시키고, 상기 제어부에 의해 연산된 제어파라미터를 이용하여 상기 모터를 제어하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제어부는,상기 피스톤의 상사점이 상기 토출부로부터 미리 설정된 한계 거리 이내에 형성되는 경우, 상기 딥 러닝 연산부의 동작을 비활성화시키고, 상기 제어부에 의해 연산된 제어파라미터를 이용하여 상기 모터를 제어하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제어부는,상기 딥 러닝 연산부로 상기 제어파라미터를 입력하는 시점에서, 상기 리니어 압축기의 동작 모드를 식별하고,식별된 동작 모드에 근거하여 상기 제어파라미터 중 일부를 선택하며, 선택된 일부를 상기 딥 러닝 연산부로 입력시키는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 제어부는,상기 식별된 동작 모드에 근거하여, 상기 제어파라미터에 대해 스케일링(Scaling)을 수행하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제어부는,상기 식별된 동작 모드가 변경됨에 따라, 상기 제어파라미터에 적용되는 스케일 변수를 변경시키는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "실린더의 내부에서 왕복 운동하는 피스톤;상기 피스톤의 운동을 위하여, 구동력을 제공하는 모터;상기 모터와 관련된 모터전압 및 모터전류를 감지하는 감지부;상기 실린더의 일단에 설치되어, 실린더 내부에서 압축된 냉매의 토출을 조절하는 토출부; 및상기 감지부에 의해 감지된 상기 모터전압 및 모터전류 중 적어도 하나를 이용하여, 상기 피스톤의 운동과 관련된 적어도 하나의 제어파라미터를 연산하는 제어부를 포함하고,상기 제어부는,딥러닝 알고리즘을 이용하여, 상기 연산된 제어파라미터의 보상 값을 검출하는 것을 특징으로 하는 리니어 압축공개특허 10-2019-0141465-4-기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제어부는,상기 연산된 제어파라미터의 변곡점을 검출함으로써, 상기 피스톤과 상기 토출부 사이의 거리를 산출하고,상기 딥러닝 알고리즘를 이용하여, 산출된 거리에 적용되는 보상 값을 검출하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제어부는,산출된 상기 피스톤과 상기 토출부 사이의 거리에 근거하여, 상기 피스톤이 동작 중에 상사점에 도달했는지 여부를 판단하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 제어부는,산출된 상기 피스톤과 상기 토출부 사이의 거리에 근거하여, 상기 피스톤의 상사점이 상기 토출부에 도달하도록상기 모터를 제어하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제어부에 의해 연산된 제어파라미터 및 상기 딥러닝 알고리즘에 의해 연산된 보상 값 중 적어도 하나를 저장하는 메모리를 더 포함하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제어부는,상기 보상 값이 연산 될 때마다, 현재 연산된 보상 값과, 상기 메모리에 저장된 이전에 연산된 보상 값을 비교하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 제어부는,상기 피스톤의 상사점이 상기 토출부에 도달할 때마다 상기 제어파라미터의 연산 값을 갱신하고,상기 딥러닝 알고리즘을 이용하여, 갱신된 제어파라미터의 연산 값에 대응되는 보상 값을 재검출하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제어부는,재검출된 보상 값이 이전에 검출된 보상 값보다 크면, 갱신되기 전의 제어파라미터의 연산 값과, 재검출된 보상값을 파싱(Parsing)하고, 파싱 결과를 이용하여 딥러닝 연산을 다시 수행하는 것을 특징으로 하는 리니어 압축공개특허 10-2019-0141465-5-기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 제어부는,상기 피스톤의 상사점이 상기 토출부에 도달한 후 미리 설정된 시간간격이 경과한 후에 연산된 제어파라미터를상기 딥 러닝 알고리즘에 적용하여, 상기 보상 값을 재검출하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 피스톤의 상사점은 서로 다른 시점인 제1 시점과, 제2 시점에 각각 상기 토출부에 도달하고,상기 제어부는,상기 제1 시점이 도래하기 전에, 상기 딥 러닝 알고리즘을 수행함으로써, 상기 제1 시점에 대응되는 제1 보상값을 검출하고,상기 제1 시점으로부터 상기 시간간격이 경과한 후에 연산된 제어파라미터를 상기 딥 러닝 알고리즘에적용하여, 상기 제2 시점에 대응되는 제2 보상 값을 검출하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서,상기 제어부는,상기 제1 보상 값을 이용하여, 상기 제1 시점으로부터 상기 시간간격이 경과한 후로부터, 상기 제2 시점으로부터 상기 시간간격이 경과한 후까지 상기 피스톤의 절대 위치를 검출하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제11항에 있어서,상기 제어부는,상기 딥 러닝 알고리즘을 수행하는 딥 러닝 연산부를 포함하고,상기 딥 러닝 연산부는,상기 제어부에 의해 연산되는 제어파라미터를 입력받고,인공신경망 기술을 이용하여, 상기 입력된 제어파라미터로부터 상기 피스톤의 상사점과 상기 토출부 사이의 거리와 관련된 보상 값을 추정하고,추정된 보상 값의 노이즈를 감소시키는 후처리를 수행하는 것을 특징으로 하는 리니어 압축기."}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 리니어 압축기는, 실린더의 내부에서 왕복 운동하는 피스톤, 상기 피스톤의 운동을 위하여, 구동 력을 제공하는 모터, 상기 모터와 관련된 모터전압 및 모터전류를 감지하는 감지부, 상기 실린더의 일단에 설치 되어, 실린더 내부에서 압축된 냉매의 토출을 조절하는 토출부 상기 감지부에 의해 감지된 상기 모터전압 및 모 터전류 중 적어도 하나를 이용하여, 상기 피스톤의 운동과 관련된 적어도 하나의 제어파라미터를 연산하는 제어 부 및 상기 제어파라미터를 입력받고, 인공신경망 기술을 이용하여 상기 피스톤의 절대위치와 관련된 보상 값을 출력하는 딥 러닝 연산부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 리니어 압축기 및 그의 제어 방법에 관한 것으로서, 보다 구체적으로는, 별도의 센서를 부가하지 않으면서 피스톤의 움직임을 제어하는 리니어 압축기 및 리니어 압축기의 제어 방법에 관한 것이다."}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 압축기는 기계적 에너지를 압축성 유체의 압축에너지로 변환시키는 장치로서 냉동기기, 예를 들어 냉장고나 공기조화기 등의 일부분으로 사용된다. 압축기는 크게 왕복동식 압축기(Reciprocating Compressor)와, 회전식 압축기(Rotary Compressor)와, 스크롤식 압축기(Scroll Compressor)로 구분된다. 왕복동식 압축기는, 피스톤(Piston)과 실린더(Cylinder) 사이에 작동가스가 흡입 또는 토출되는 압축공간이 형성되도록 하여 피스톤이 실린더 내부에서 직선 왕복 운동하면서 냉매 를 압축시킨다. 회전식 압축기는, 편심 회전되는 롤러(Roller)와 실린더 사이에 작동가스가 흡입 또는 토출되는 압축공간이 형성되도록 하여 롤러가 실린더 내벽을 따라 편심 회전되면서 냉매를 압축시킨다. 스크롤식 압축기 는, 선회 스크롤(Orbiting Scroll)과 고정 스크롤(Fixed Scroll) 사이에 작동가스가 흡입 또는 토출되는 압축공 간이 형성되도록 하여 신회 스크롤이 고정 스크롤을 따라 회전되면서 냉매를 압축시킨다. 왕복동식 압축기는 내부 피스톤을 실린더의 내부에서 선형으로 왕복 운동시킴으로써 냉매 가스를 흡입, 압축 및 토출한다. 왕복동식 압축기는 피스톤을 구동하는 방식에 따라 크게 레시프로(Recipro) 방식과 리니어(Linear) 방식으로 구분된다. 레시프로 방식이라 함은 회전하는 모터(Motor)에 크랭크샤프트(Crankshaft)를 결합하고, 크랭크샤프트에 피스톤 을 결합하여 모터의 회전 운동을 직선 왕복운동으로 변환하는 방식이다. 반면, 리니어 방식이라 함은 직선 운동 하는 모터의 가동자에 피스톤을 연결하여 모터의 직선 운동으로 피스톤을 왕복운동시키는 방식이다. 이러한 왕복동식 압축기는 구동력을 발생하는 전동 유닛과, 전동 유닛으로부터 구동력을 전달받아 유체를 압축 하는 압축 유닛으로 구성된다. 전동 유닛으로는 일반적으로 모터(motor)를 많이 사용하며, 상기 리니어 방식의 경우에는 리니어 모터(linear motor)를 이용한다. 리니어 모터는 모터 자체가 직선형의 구동력을 직접 발생시키므로 기계적인 변환 장치가 필요하지 않고, 구조가 복잡하지 않다. 또한, 리니어 모터는 에너지 변환으로 인한 손실을 줄일 수 있고, 마찰 및 마모가 발생하는 연 결 부위가 없어서 소음을 크게 줄일 수 있는 특징을 가지고 있다. 또한, 리니어 방식의 왕복동식 압축기(이하, 리니어 압축기(Linear Compressor)라 함)를 냉장고나 공기조화기에 이용할 경우에는 리니어 압축기에 인가되는 스트로크 전압을 변경하여 줌에 따라 압축 비(Compression Ratio)를 변경할 수 있어 냉력(Freezing Capacity) 가변 제어에도 사용할 수 있는 장점이 있다. 한편, 리니어 압축기는 피스톤이 실린더 안에서 기구적으로 구속되어 있지 않은 상태에서 왕복 운동을 하게 되 기 때문에 갑자기 전압이 과도하게 걸리는 경우에 피스톤이 실린더 벽에 부딪히거나, 부하가 커서 피스톤이 전 진하지 못하여 압축이 제대로 이루어지지 않을 수 있다. 따라서, 부하의 변동이나 전압의 변동에 대하여 피스톤 의 운동을 제어하기 위한 제어 장치가 필수적이다. 일반적으로 압축기 제어 장치는 압축기 모터에 인가되는 전압과 전류를 검출하여 센서리스 방법으로 스트로크를 추정하여 피드백 제어를 수행한다. 이때, 압축기 제어 장치는 압축기를 제어하기 위한 수단으로 트라이악 (Triac)이나 인버터(inverter)를 구비한다. 특히, 리니어 압축기는 피스톤이 실린더 안에서 기구적으로 구속되어 있지 않기 때문에, 구동 초기에서의 피스 톤의 위치와, 구동 중간에서의 피스톤의 위치가 상이한 경우가 있다. 일반적으로, 리니어 압축기의 피스톤이 상사점을 향해 이동 할 경우에 상기 피스톤에 인가되는 힘이, 하사점을 향해 이동할 경우에 상기 피스톤에 인가되는 힘보다 크므로, 피스톤은 압축기 구동이 개시된 후로 점점 토출구 로부터 밀리게 된다. 일반적인 리니어 압축기의 제어 알고리즘에 의하면, 별도의 센서 없이 피스톤의 절대 위치를 검출하는 것이 불 가능하므로, 리니어 압축기의 제어부가 압축기의 구동이 진행됨에 따라 위치가 변경되는 피스톤의 스트로크를 정확하게 검출하는 것이 어려워지는 문제점이 있다. 한편, 한국공개특허 제10-2010-0096536호(2010년 09월 02일 공개)에서는, 센서 없이 피스톤의 상사점이 토출부 에 충돌했는지 여부를 검출하는 기술이 개시되어 있다. 그러나, 한국공개특허 제10-2010-0096536호에 의하면, 피스톤의 위치를 검출하거나, 피스톤의 운동을 제어하기 위하여, 피스톤과 토출부의 충돌이 필수적으로 동반되므로, 충돌에 의한 피스톤 및 토출부 손상이 수반되는 문 제점이 있다. 뿐만 아니라, 피스톤과 토출부의 충돌에 의해 제어의 정확도가 떨어지는 단점도 존재한다."}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원발명의 기술적 과제는 위와 같은 종래 리니어 압축기의 문제점을 해결하는 것으로서, 별도의 센서를 구비하 지 않으면서도 피스톤의 절대 위치를 검출할 수 있는 리니어 압축기 및 그의 제어방법을 제공하는 것이다.특히, 본원발명의 기술적 과제는 인공신경망 기술을 이용하여, 피스톤과 토출부의 충돌을 방지하고, 피스톤의 절대위치를 검출할 수 있는 리니어 압축기 및 그의 제어방법을 제공하는 것이다. 또한, 본원발명의 기술적 과제는 딥 러닝, 머신 러닝 등의 기계 학습을 수행함으로써, 고효율 운전을 수행하는 리니어 압축기 및 그의 제어방법을 제공하는 것이다. 아울러, 본원발명의 기술적 과제는 소음의 발생이 감소되고, 제작비용이 감소된 리니어 압축기를 제공하는 것이다."}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 바와 같은 과제를 해결하기 위한 본 명세서에 개시된 리니어 압축기는, 실린더의 내부에서 왕복 운동하 는 피스톤, 상기 피스톤의 운동을 위하여, 구동력을 제공하는 모터, 상기 모터와 관련된 모터전압 및 모터전류 를 감지하는 감지부, 상기 실린더의 일단에 설치되어, 실린더 내부에서 압축된 냉매의 토출을 조절하는 토출부, 상기 감지부에 의해 감지된 상기 모터전압 및 모터전류 중 적어도 하나를 이용하여, 상기 피스톤의 운동과 관련 된 적어도 하나의 제어파라미터를 연산하는 제어부 및 상기 제어파라미터를 입력받고, 인공신경망 기술을 이용 하여 상기 피스톤의 절대위치와 관련된 보상 값을 출력하는 딥 러닝 연산부를 포함할 수 있다. 일 실시예에서, 딥 러닝 연산부는 제어부 내에 탑재될 수 있다. 즉, 제어부는 자체적으로 탑재된 딥 러닝 알고 리즘 및 인공신경망을 이용하여, 딥 러닝 연산을 수행할 수 있다. 일 실시예에서, 제어부는 딥 러닝 연산을 선택적으로 수행할 수 있다. 즉, 제어부는 딥 러닝 연산의 신뢰도가 보장되는 조건 하에서는, 딥 러닝 연산부를 활성화시키고, 딥 러닝 연산부의 출력을 이용하여 리니어 압축기의 모터를 제어할 수 있다. 반면, 제어부는 딥 러닝 연산의 신뢰도가 낮아지는 조건 하에서는, 딥 러닝 연산부를 비활성화시키고, 리니어 압축기의 모터를 제어함에 있어서, 딥 러닝 연산부의 출력을 제외시킬 수 있다. 일 실시예에서, 제어부는 상기 피스톤의 운동과 관련된 스트로크 지령치를 생성하고, 상기 연산된 제어파라미터 를 이용하여, 상기 피스톤의 상사점과 상기 토출부 사이의 거리를 검출하고, 검출된 거리가 상기 스트로크 지령 치보다 작으면, 상기 딥 러닝 연산부의 출력을 이용하여 상기 모터를 제어할 수 있다. 반면, 제어부는 검출된 거리가 상기 스크로크 지령치 이상이면, 상기 딥 러닝 연산부의 동작을 비활성화시키고, 상기 제어부에 의해 연산된 제어파라미터를 이용하여 상기 모터를 제어할 수 있다. 일 실시예에서, 제어부는 제어파라미터를 이용하여 리니어 압축기의 동작 상태가 정상인지 여부를 판단하고, 상 기 압축기의 동작 상태가 정상이면, 상기 딥 러닝 연산부의 출력을 이용하여 상기 모터를 제어할 수 있다. 일 실시예에 있어서, 제어부는 상기 압축기의 동작 상태가 정상이 아닌 것으로 판단되면, 상기 딥 러닝 연산부 의 동작을 비활성화시키고, 상기 제어부에 의해 연산된 제어파라미터를 이용하여 상기 모터를 제어하는 것을 특 징으로 한다. 일 실시예에 있어서, 제어부는 피스톤이 초기위치로부터 비대칭 왕복 운동을 수행하는 경우, 상기 딥 러닝 연산 부의 동작을 비활성화시키고, 상기 제어부에 의해 연산된 제어파라미터를 이용하여 모터를 제어하는 것을 특징 으로 한다. 일 실시예에 있어서, 제어부는 피스톤의 상사점이 상기 토출부로부터 미리 설정된 한계 거리 이내에 형성되는 경우, 상기 딥 러닝 연산부의 동작을 비활성화시키고, 상기 제어부에 의해 연산된 제어파라미터를 이용하여 상 기 모터를 제어하는 것을 특징으로 한다. 일 실시예에 있어서, 제어부는 상기 딥 러닝 연산부로 상기 제어파라미터를 입력하는 시점에서, 상기 리니어 압 축기의 동작 모드를 식별하고, 식별된 동작 모드에 근거하여 상기 제어파라미터 중 일부를 선택하며, 선택된 일 부를 상기 딥 러닝 연산부로 입력시키는 것을 특징으로 한다. 일 실시예에 있어서, 제어부는 식별된 동작 모드에 근거하여, 상기 제어파라미터에 대해 스케일링(Scaling)을 수행하는 것을 특징으로 한다. 일 실시예에 있어서, 제어부는 식별된 동작 모드가 변경됨에 따라, 상기 제어파라미터에 적용되는 스케일 변수 를 변경시키는 것을 특징으로 한다. 또한, 본 발명에서 제안하는 리니어 압축기의 제어부는, 감지부에 의해 감지된 모터전압 및 모터전류 중 적어도 하나를 이용하여, 피스톤의 운동과 관련된 적어도 하나의 제어파라미터를 연산한 후, 딥 러닝 알고리즘을 이용하여 제어파라미터의 보상 값을 검출할 수 있다. 일 실시예에 있어서, 제어부는 연산된 제어파라미터를 이용하여, 상기 피스톤과 상기 토출부 사이의 거리를 산 출하고, 상기 딥러닝 알고리즘를 이용하여, 산출된 거리에 적용되는 보상 값을 검출하는 것을 특징으로 한다. 일 실시예에 있어서, 제어부는 산출된 상기 피스톤과 상기 토출부 사이의 거리에 근거하여, 상기 피스톤이 동작 중에 상사점에 도달했는지 여부를 판단하는 것을 특징으로 한다. 일 실시예에 있어서, 제어부는 산출된 상기 피스톤과 상기 토출부 사이의 거리에 근거하여, 피스톤의 상사점이 상기 토출부에 도달하도록 상기 모터를 제어하는 것을 특징으로 한다. 일 실시예에 있어서, 제어부에 의해 연산된 제어파라미터 및 딥러닝 알고리즘에 의해 연산된 보상 값 중 적어 도 하나를 저장하는 메모리를 더 포함할 수 있다. 일 실시예에 있어서, 제어부는 보상 값이 연산 될 때마다, 현재 연산된 보상 값과, 상기 메모리에 저장된 이전 에 연산된 보상 값을 비교하는 것을 특징으로 한다. 일 실시예에 있어서, 제어부는 상기 피스톤의 상사점이 상기 토출부에 도달할 때마다 상기 제어파라미터의 연산 값을 갱신하고, 상기 딥러닝 알고리즘을 이용하여, 갱신된 제어파라미터의 연산 값에 대응되는 보상 값을 재검 출하는 것을 특징으로 한다. 일 실시예에 있어서, 제어부는 재검출된 보상 값이 이전에 검출된 보상 값보다 크면, 갱신되기 전의 제어파라미 터의 연산 값과, 재검출된 보상 값을 파싱(Parsing)하고, 파싱 결과를 이용하여 딥러닝 연산을 다시 수행하는 것을 특징으로 한다. 일 실시예에 있어서, 제어부는 피스톤의 상사점이 상기 토출부에 도달한 후 미리 설정된 시간간격이 경과한 후 에 연산된 제어파라미터를 상기 딥 러닝 알고리즘에 적용하여, 상기 보상 값을 재검출하는 것을 특징으로 한다. 일 실시예에 있어서, 상기 피스톤의 상사점은 서로 다른 시점인 제1 시점과, 제2 시점에 각각 상기 토출부에 도 달하고, 상기 제어부는 상기 제1 시점이 도래하기 전에, 상기 딥 러닝 알고리즘을 수행함으로써, 상기 제1 시점 에 대응되는 제1 보상 값을 검출할 수 있다. 또한, 제어부는 제1 시점으로부터 상기 시간간격이 경과한 후에 연 산된 제어파라미터를 상기 딥 러닝 알고리즘에 적용하여, 상기 제2 시점에 대응되는 제2 보상 값을 검출하는 것 을 특징으로 한다. 일 실시예에 있어서, 제어부는 상기 제1 보상 값을 이용하여, 상기 제1 시점으로부터 상기 시간간격이 경과한 후로부터, 상기 제2 시점으로부터 상기 시간간격이 경과한 후까지 상기 피스톤의 절대 위치를 검출하는 것을 특 징으로 한다. 일 실시예에 있어서, 제어부는 상기 제1 시점으로부터 상기 시간간격이 경과한 후로부터, 상기 제2 시점으로부 터 상기 시간간격이 경과한 후까지, 미리 설정된 주기마다 상기 딥 러닝 알고리즘을 수행하는 것을 특징으로 한 다. 일 실시예에 있어서, 상기 제어부는 상기 딥 러닝 알고리즘을 수행하는 딥 러닝 연산부를 포함하고, 상기 딥 러 닝 연산부는 상기 제어부에 의해 연산되는 제어파라미터를 입력받고, 인공신경망 기술을 이용하여, 상기 입력된 제어파라미터로부터 상기 피스톤의 상사점과 상기 토출부 사이의 거리와 관련된 보상 값을 추정하고, 추정된 보 상 값의 노이즈를 감소시키는 후처리를 수행하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본원발명에 따른 리니어 압축기 및 그의 제어방법은, 피스톤과 토출 밸브의 충돌력을 감소시킴으로써, 리니어 압축기에서 발생하는 소음을 감소시킬 수 있는 효과가 있다. 아울러 본원발명에서는, 피스톤과 토출 밸브의 충 돌을 방지함으로써, 충돌로 인한 피스톤 및 토출 밸브의 마모를 감소시킬 수 있으므로, 기구 및 부품의 수명이 늘어나게 될 수 있는 효과가 도출된다. 또한, 본원발명에 따른 리니어 압축기의 및 그의 제어 방법은, 별도의 센서를 추가하지 않으면서도, 실린더 내 에서의 피스톤의 절대 위치를 검출할 수 있으므로, 소음이 저감됨과 동시에 고효율 운전을 수행할 수 있는 효과 가 있다."}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 개시된 발명은 리니어 압축기의 제어 장치 및 리니어 압축기의 제어 방법에 적용될 수 있다. 그러 나 본 명세서에 개시된 발명은 이에 한정되지 않고, 본 발명의 기술적 사상이 적용될 수 있는 기존의 모든 압축 기의 제어 장치, 압축기의 제어 방법, 모터 제어 장치, 모터 제어 방법, 모터의 소음 테스트 장치 및 모터의 소 음 테스트 방법에도 적용될 수 있다. 또한, 본 명세서에 개시된 기술을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시 된 기술의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 기술의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 그 기술의 사상이 제한되 는 것으로 해석되어서는 아니 됨을 유의해야 한다. 이하의 도 1a에서는 일반적인 레시프로 방식의 왕복동식 압축기의 일 예가 설명된다. 위에서 설명된 것과 같이, 레시프로 방식의 왕복동식 압축기에 설치된 모터는 크랭크샤프트(1a)와 결합될 수 있 으며, 이로써 모터의 회전 운동이 직선 왕복운동을 변환될 수 있다. 도 1a에 도시된 것과 같이, 레시프로 방식의 압축기에 설치된 피스톤은, 크랭크샤프트의 사양 또는 크랭크샤프 트와 피스톤을 연결시키는 커넥팅로드의 사양에 의해 기 설정된 위치범위 내에서 직선 왕복운동을 수행할 수 있 다. 따라서, 레시프로 방식의 압축기를 설계함에 있어서, 피스톤이 상사점(TDC)단을 초과하지 않도록 크랭크샤프트 및 커넹틱로드의 사양을 결정하면, 별도로 모터 제어 알고리즘을 적용하지 않아도, 피스톤이 실린더의 일단에 배치된 토출부(2a)와 충돌하지 않는다. 이 경우, 레시프로 방식의 압축기에 설치된 토출부(2a)는 실린더에 대해 고정적으로 설치될 수 있다. 일 예로, 토출부(2a)는 밸브 플레이트로 형성될 수 있다. 다만, 이러한 레시프로 방식의 압축기는 추후 설명될 리니어 방식의 압축기와 달리, 크랭크샤프트, 커넥팅로드, 피스톤 상호간에 마찰을 발생시키므로, 마찰을 발생시키는 요소가 리니어 방식의 압축기가 보다 더 많은 문제점 이 있다. 이하의 도 1b에서는 일반적인 리니어 방식의 왕복동식 압축기의 일 예가 설명된다. 또한, 도 1c에서는 일반적인 리니어 방식의 왕복동식 압축기의 상사점 제어에 이용되는 다양한 파라미터들과 관련된 그래프가 도시된다. 도 1a 및 도 1b를 비교하면, 크랭크샤프트 및 커넥팅로드가 연결된 모터에 의해 직선 운동을 구현하는 레시프로 방식과 달리, 리니어 방식의 압축기는 직선 운동하는 모터의 가동자에 피스톤을 연결하여 모터의 직선 운동으로 피스톤을 왕복운동시키는 방식이다. 도 1b에 도시된 것과 같이, 리니어 방식의 압축기의 실린더와 피스톤 사이에는 탄성부재(1b)가 연결될 수 있다. 피스톤은 리니어 모터에 의해 직선 왕복운동을 수행할 수 있으며, 리니어 압축기의 제어부는 피스톤의 운동 방 향을 전환시키기 위해 리니어 모터를 제어할 수 있다. 보다 구체적으로, 도 1b에 도시된 리니어 압축기의 제어부는 피스톤이 토출부(2b)에 충돌하는 시점을, 피스톤이 상사점(TDC)에 도달한 시점을 판단할 수 있고, 이로써, 피스톤의 운동 방향을 전환시키기 위해 리니어 모터를 제어할 수 있다. 도 1b와 함께, 도 1c를 참조하면, 일반적인 리니어 압축기와 관련된 그래프가 도시된다. 구체적으로, 도 1c에 도시된 것과 같이, 모터전류(i)와 피스톤의 스트로크(x)의 위상차이(θ)는, 피스톤이 상사점(TDC)에 도달하는 시점에서 변곡점을 형성한다. 일반적인 리니어 압축기의 제어부는 전류센서를 이용하여 모터전류(i)을 검출하고, 전압센서를 이용하여 모터전 압(미도시)을 검출하며, 모터전류 및 모터전압에 근거하여 스트로크(x)를 추정할 수 있다. 이로서, 제어부는 모 터전류(i)와 스트로크(x)의 위상차이(θ)를 산출할 수 있고, 위상차이(θ)가 변곡점을 형성하면, 피스톤이 상사 점(TDC)에 도달한 것으로 판단하며, 이때 피스톤의 이동 방향이 전환되도록 리니어 모터를 제어할 수 있다. 이 하에서는 리니어 압축기의 제어부가 피스톤과 실린더 일단에 배치된 토출부의 충돌을 방지하기 위해, 피스톤이 상사점을 초과하지 않도록 모터를 제어하는 것을 \"종래 상사점 제어\"라고 정의한다. 종래 상사점 제어는 이하와 같다. 종래 상사점 제어에 있어서, 리니어 압축기의 제어부는 검출된 모터전류와 추정된 스트로크를 이용하여, 피스톤 의 왕복운동과 관련된 가스상수(Kg)를 실시간으로 산출할 수 있다. 구체적으로, 제어부는 이하의 수학식 1을 이용하여, 가스상수(Kg)를 산출할 수 있다. 수학식 1"}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, I(jw)는 한주기 전류의 피크 값, X(jw)는 한주기 스트로크의 피크 값, α는 모터 상수 또는 역기전력 상수, θi,x는 전류와 스트로크의 위상차, m은 피스톤의 이동 질량, w는 모터의 운전주파수, Km은 기계적 스프링 상수를 의미한다. 또한, 위와 같은 식에 의하여, 가스상수(Kg)와 관련된 수학식 2가 도출된다. 수학식 2"}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "즉, 상기 산출된 가스상수(Kg)는 모터전류와 스트로크의 위상차이에 비례할 수 있다. 따라서, 리니어 압축기의 제어부는 가스상수(Kg)나 위상차이의 변화를 모니터링하면서, 상기 가스상수(Kg)나 위 상차이가 변곡점을 형성하면, 피스톤이 상사점에 도달한 것으로 판단할 수 있다. 또한, 도 1b에 도시된 것과 같이, 위와 같은 종래 상사점 제어를 수행하는 일반적인 리니어 압축기의 경우에는, 탄성부재를 구비하는 토출부(2b)를 구비할 수 있다. 특히, 종래 리니어 압축기에 구비된 토출부(2b)는 상대적으 로 탄성력이 약한 탄성부재와 연결된다. 따라서, 토출부(2b)와 피스톤의 반발력도 상대적으로 약하므로, 실린더 내의 압축 상태가 불안정한 문제점이 있다. 이러한 문제점을 해결하기 위하여, 본 발명에 따른 리니어 압축기는 토출부(2b)에 반발력이 상당히 증가된 탄성 부재를 연결시킬 수 있다. 이 경우, 본 발명에 따른 리니어 압축기는, 토출부(2b)가 실린더에 접합되는 힘이 강 해지므로, 피스톤과 토출부(2b)가 충돌할 때, 상기 토출부(2b)와 피스톤 사이에서 발생하는 반발력도 종래의 리 니어 압축기 보다 강해진다. 본 발명에 따른 리니어 압축기의 또 다른 실시예에서는 실린더 일단에 밸브플레이트가 구비된 토출부를 포함할 수 있다. 이 경우, 밸브플레이트로 형성된 토출부를 포함하는 리니어 압축기는, 실린더와 밸브플레이트가 고정 적으로 결합되어 있기 때문에, 밸브플레이트와 피스톤 사이에서 발생하는 반발력이 종래의 리니어 압축기 보다 강해진다. 이와 같이, 피스톤에 인가되는 반발력이 종래 리니어 압축기보다 증가한 점을 이용하여, 본 발명의 리니어 압축 기에서는 별도의 센서를 추가하지 않고 피스톤의 이동을 제어할 수 있다. 본 발명에 따른 상사점 제어를 수행하는 리니어 압축기의 제어부는 감지된 모터전압 및 모터전류를 이용하여, 피스톤의 스트로크를 연산할 수 있다. 아울러, 상기 제어부는 연산된 스트로크의 추이에 근거하여, 상기 피스톤 이 상기 밸브플레이트에 충돌하지 않도록 상기 모터를 제어할 수 있다. 구체적으로, 본 발명에 따른 리니어 압축기의 제어부는 피스톤이 실린더 내에서 왕복 운동하는 중에 계속적으로 피스톤의 스트로크를 추정하여, 추정된 스트로크의 추이를 검출할 수 있다. 추정된 스트로크의 그래프와 실제 스트로크의 그래프를 비교하면, 피스톤이 실린더 일단에 설치된 토출부에 충 돌하기 전까지, 상기 추정된 스트로크와 실제 스트로크는 비례관계를 형성한다. 그러나, 피스톤이 실린더 일단 에 설치된 토출부에 충돌한 후에는, 상기 추정된 스트로크와 실제 스트로크가 반비례관계를 형성한다. 위에서 설명한 것과 같이 본 발명에 따른 리니어 압축기의 피스톤에, 종래의 리니어 압축기보다 강한 반발력이 제공됨으로써, 추정된 스트로크와 실제 스트로크가 충돌 시점으로부터 반비례관계를 형성할 수 있다. 이하의 발명의 설명에서는 위와 같은 문제점들을 해결하기 위한 본 발명의 구성 및 그에 따른 효과가 설명된다. 이하의 도 2에서는 리니어 압축기의 구성요소와 관련된 일 실시예가 설명된다. 도 2는 본 발명의 일 실시예에 따른 왕복동식 압축기의 제어 장치의 구성을 나타낸 블록도이다. 도 2에 도시한 바와 같이, 본 발명의 일 실시예에 따른 왕복동식 압축기의 제어 장치는, 모터와 관련된 모터전 압 및 모터전류를 감지하는 감지부를 포함할 수 있다. 구체적으로, 도 2를 참조하면, 상기 감지부는 모터에 인가되는 모터 전압을 검출하는 전압 검출부, 상기 모 터에 인가되는 모터 전류를 검출하는 전류 검출부를 포함할 수 있다. 전압 검출부와 전류 검출부는 검출된 모터 전압 및 모터 전류와 관련된 정보를 각각 제어부 또는 스트로크 추정부에 전달할 수 있다.아울러, 도 2에 도시된 것과 같이, 본 발명에 따른 압축기 또는 압축기의 제어장치는 상기 검출된 모터 전류와 모터 전압 및 모터 파라미터에 의해, 스트로크를 추정하는 스트로크 추정부, 상기 스트로크 추정치와 스트 로크 지령치를 비교하고, 비교 결과 그 차이를 출력하는 비교기, 및 상기 차이에 따라, 모터에 인가되는 전 압을 가변하여 스트로크를 제어하는 제어부를 포함할 수 있다. 도 2에 도시한 제어 장치의 구성요소들이 필수적인 것은 아니어서, 그보다 많은 구성요소들을 갖거나 그보다 적 은 구성요소들을 갖는 압축기 제어 장치가 구현될 수 있음은 물론이다. 한편, 본 발명의 일 실시예에 따른 압축기 제어 장치는 왕복동식 압축기에 적용할 수 있으나, 본 명세서에서는 리니어 압축기를 기준으로 설명하기로 한다. 이하, 각 구성요소들에 대해 살펴보기로 한다. 전압 검출부는 압축기 모터에 인가되는 모터전압을 검출하는 것으로서, 일 실시예에 따라, 전압 검출부(2 1)는 정류부 및 직류링크부를 포함할 수 있다. 정류부는 소정 크기의 전압을 갖는 교류 전원을 정류하여 직류 전압을 출력할 수 있으며, 직류 링크부는 두개의 커패시터를 포함할 수 있다. 또한, 전류 검출부는 모터에 인가되는 모터전류를 검출하는 것으로서, 일 실시예에 따라, 압축기 모터의 코 일에 흐르는 전류를 감지할 수 있다. 또한, 스트로크 추정부는, 상기 검출된 모터 전류와 모터 전압 및 모터 파라미터를 이용하여, 스트로크 추 정치를 연산할 수 있고, 연산된 스트로크 추정치를 비교기에 인가할 수 있다. 이때, 스트로크 추정부는 하기 수학식 1과 같은 수식을 통해, 스트로크 추정치를 연산할 수 있다. 수학식 3"}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, x는 스트로크, α는 모터 상수 또는 역기전력 상수, Vm은 모터 전압, im은 모터 전류, R은 저항, L은 인덕턴스를 의미한다. 이에 따라, 상기 비교기는 상기 스토로크 추정치와 상기 스트로크 지령치를 비교하여 그에 따른 차이 신호 를 제어부에 인가하고, 이에 의해 상기 제어부는 모터에 인가되는 전압을 가변하여 스트로크를 제어할 수 있다. 즉, 제어부는, 스트로크 추정치가 스트로크 지령치보다 크면 모터 인가전압을 감소시키고, 스트로크 추정치 가 스트로크 지령치보다 작으면 모터 인가전압을 증가시킨다. 도 2에 도시된 것과 같이, 제어부와 스트로크 추정부는 하나의 유닛으로 형성될 수 있다. 즉, 제어부 와 스트로크 추정부는 단일 프로세서 또는 컴퓨터에 대응될 수 있다. 이러한 압축기의 제어장치와 함께, 도 4a 및 도 4b에서는 본 발명에 따른 리니어 압축기의 물리적인 구성요소가 설명된다. 이하의 도 3에서는 본 발명에 따른 리니어 압축기의 단면도가 도시된다. 본 발명의 일 실시예에 따른 리니어 압축기는, 리니어 압축기 제어 장치가 적용 또는 압축기 제어 장치가 적용 가능한 리니어 압축기이면 족하되, 리니어 압축기의 종류 또는 형태를 불문한다. 도 3에 도시한 본 발명의 일 실시예에 따른 리니어 압축기는 하나의 예시일 뿐이며, 본 발명의 권리 범위를 한정하고자 하는 의도는 아니다. 일반적으로 압축기에 적용되는 모터는 고정자에 권선코일이, 가동자에 마그네트가 설치되어 권선코일과 마그네 트의 상호작용에 의해 가동자가 회전운동 또는 왕복운동을 하게 된다. 권선코일은 모터의 종류에 따라 다양하게 형성될 수 있다. 예를 들어, 회전 모터의 경우에는 고정자의 내주면에 원주방향을 따라 형성되는 다수 개의 슬롯에 집중권 또는 분포권으로 권선되어 있고, 왕복동 모터의 경우에는코일이 환형으로 감아 권선코일을 형성한 후 그 권선코일의 외주면에 원주방향을 따라 다수 장의 코어 시트 (core sheet)를 삽입하여 결합하고 있다. 특히, 왕복동 모터의 경우에는 코일을 환형으로 감아 권선코일을 형성하기 때문에 통상은 플라스틱 재질로 된 환형 보빈에 코일을 감아 권선코일을 형성하고 있다. 도 3에 도시한 바와 같이, 왕복동식 압축기는, 밀폐된 쉘의 내부공간에 프레임이 복수 개의 지지스프 링에 의해 탄력 설치되어 있다. 쉘의 내부공간에는 냉동사이클의 증발기(미도시)와 연결되는 흡 입관이 연통되도록 설치되고, 흡입관의 일측에는 냉동사이클 장치의 응축기(미도시)와 연결되는 토출 관이 연통되도록 설치되어 있다. 프레임에는 전동부(M)를 이루는 왕복동 모터의 외측고정자와 내측고정자가 고정 설치되고, 외측고정자와 내측고정자 사이에는 왕복운동을 하는 가동자(mover)가 설치되어 있다. 왕복동 모 터의 가동자(mover)에는 후술할 실린더와 함께 압축부(Cp)를 이루는 피스톤이 왕복운동을 하도록 결합되어 있다. 실린더는 왕복동 모터의 고정자와 축방향으로 중첩되는 범위에 설치되어 있다. 그리고 실 린더에는 압축공간(CS1)이 형성되고, 피스톤에는 냉매를 압축공간(CS1)으로 안내하는 흡입유로(F)가 형성되며, 흡입유로(F)의 끝단에는 그 흡입유로(F)를 개폐하는 흡입밸브가 설치되고, 실린더의 선단 면에는 그 실린더의 압축공간(CS1)을 개폐하는 토출밸브가 설치되어 있다. 참고로, 본 발명에 따른 리니어 압축기의 토출부는 다양한 형태로 형성될 수 있다. 예를 들어, 본 발명에 따른 리니어 압축기는 도 3에 도시된 것과 같이, 밸브플레이트로 형성되는 토출부를 포함 할 수 있다. 즉, 본 발명에 따른 리니어 압축기에는 기존의 레시프로 압축기에서 사용하던 토출부가 적용될 수 있다. 또 다른 예에서, 본 발명에 따른 리니어 압축기는 도 1b에 도시된 것과 같이, 탄성부재를 구비하는 토출부를 포 함할 수 있다. 즉, 본 발명에 따른 리니어 압축기는 기존의 리니어 압축기에서 사용하던 토출부도 적용될 수 있 다. 다만, 본 발명에 따른 리니어 압축기의 토출부에 구비된 탄성부재의 탄성력은, 일반적인 리니어 압축기에 구비 된 탄성부재의 탄성력 보다 크게 형성될 수 있다. 이하의 도 4에서는 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 일 실시예가 설명된다. 도 4를 참조하면, 실린더와 피스톤 및 토출부에 의해 정의되는 거리 변수들이 설명된다. 먼저, 리니어 압축기가 구동되기 전에 실린더 내에서 피스톤의 중심 위치와 토출부 사이의 거리는 X0으로 정의된 다. 리니어 압축기가 구동 중인 경우, 피스톤의 상사점과 토출부 사이의 거리는 XTDC로 정의된다. 피스톤의 상사점과 하사점 사이의 거리는 Stk로 정의된다. 리니어 압축기가 구동 후에 실린더 내에서 피스톤의 중심 위치가 밀린 거리는 Xdc로 정의된다. 구체적으로 리니어 압축기의 구동이 개시되면, 피스톤이 하사점을 향해서 이동할 때 보다, 상사점을 향해서 이 동할 때, 더 강한 부하를 인가받으므로, 제어부가 동일한 스트로크 지령 또는 전압 지령을 출력하는 경우에도 피스톤의 위치가 점점 토출부로부터 멀리 밀릴 수 있다. 도 4에서는 이와 같이 피스톤이 초기 위치로부터 밀린 거리를 Xdc로 정의한다. 아울러, 리니어 압축기의 피스톤과 관련된 제어 파라미터가 변곡점을 형성하는 시점에서, 피스톤의 상사점과 토 출부 사이의 거리는 Xv로 정의된다. Xv는 압축기의 설계에 따라 설정되는 상수일 수 있다. 예를 들어, 상기 제어 파라미터가 가스상수(Kg)에 대응되는 경우, 가스상수(Kg)의 변곡점은 이론적으로 피스톤이 토출부에 접촉했을 때 발생하므로, 상기 Xv는 0으로 설정될 수 있다. 다만, Xv는 이와 같은 값에 한정되지 않으 며, 압축기의 설계나 제어 파라미터의 변경에 따라 다르게 설정될 수 있다.피스톤의 상사점과 토출부 사이의 거리(XTDC)는 이하의 수학식 4에 의해 연산될 수 있다. 수학식 4"}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "아울러, 피스톤의 상사점과 토출부 사이의 거리(XTDC)는 이하의 수학식 5에 의해 보정될 수 있다. 수학식 5"}
{"patent_id": "10-2018-0068272", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "상기 수학식 5에서 XTDC_C는 XTDC의 업데이트 후 값을 의미한다. 또한, 상기 수학식 5에서 Xv_obj는 XTDC의 보상 값을 의미한다. Xv_obj는 가스 상수(Kg)의 추이에 의해 산출되거나, 딥 러닝 연산에 의해 추정될 수 있다. 일 예에서, 제어부는 피스톤의 이동과 관련된 제어 파라미터가 변곡점을 형성하는 시점에서 피스톤의 상사 점과 토출부 사이의 거리를 Xv_obj로 산출할 수 있다. 즉, 제어부는 모터전압 및 모터전류 중 적어도 하나를 이용하여, 상기 모터의 부하 변동을 검출할 수 있다. 제어부는 상기 모터의 부하 변동이 검출될 때마다, 상기 피스톤의 위치와 관련된 보상 값을 연산할 수 있으 며, 연산된 보상 값을 이용하여 상기 피스톤의 절대 위치를 제어 할 수 있다. 구체적으로, 제어부는 모터전압 및 모터전류를 이용하여 상기 피스톤의 스트로크를 추정할 수 있고, 추정된 스트로크에 근거하여, 상기 리니어 압축기의 구동이 개시되기 전 상기 피스톤의 초기 위치로부터 상기 피스톤이 밀린 거리(Xdc)를 연산할 수 있다. 아울러, 제어부는 추정된 스트로크 및 연산된 밀린 거리(Xdc)를 이용하여, 상기 피스톤의 상사점과 토출부 사이의 거리(XTDC)를 연산할 수 있다. 또한, 제어부는 추정된 스트로크와 감지된 모터전류를 이용하여, 상기 피스톤의 이동과 관련된 파라미터를 실시간으로 산출할 수 있다. 제어부는 산출된 파라미터가 변곡점을 형성하는 시점에, 상기 피스톤의 상사점 과 토출부 사이의 거리(XTDC)를 연산할 수 있다. 제어부는 파라미터가 변곡점을 형성하는 시점의 XTDC를 기 설정된 기준 거리를 비교하고, 비교결과에 근거하여 상기 보상 값을 연산할 수 있다. 제어부는 상기 피스톤의 상사점과 토출부 사이의 거리(XTDC)를 기 설정된 한계 거리 이하로 유지하도록 모터 를 제어할 수 있다. 예를 들어, 제어부는 계산된 XTDC가 기 설정된 한계 거리 보다 큰 경우, 스트로크 지령치를 증가시키거나, 모터전압 또는 모터전류를 증가시킬 수 있다. 제어부는 모터의 운전율을 검출하고, 검출된 운전율에 근거하여 상기 모터의 부하 변동의 발생 여부를 판단 할 수 있다. 다만, 제어부는 운전율 외에도 다양한 방법으로 모터의 부하 변동을 판단할 수 있다. 즉, 제어부는 리 니어 압축기의 출력을 변경시키기 위한 사용자 입력이 인가되면 모터의 부하 변동이 발생한 것으로 판단할 수 있다. 제어부는 모터의 초기 구동 시, 피스톤의 위치와 관련된 보상 값을 연산할 수 있다. 구체적으로 피스톤의 위치와 관련된 보상 값은, 스트로크(Stk) 추정 값의 오차와 피스톤이 초기 위치로부터 밀 린 거리(Xdc)의 연산 결과의 오차를 포함할 수 있다. 즉, 제어부가 피스톤의 상사점과 토출부 사이의 거리(XTDC)를 연산함에 있어서, 발생 가능한 오차를 줄이기 위해, 제어부는 모터의 초기 기동 시 또는 모터의 부하 변동이 발생할 때마다 피스톤의 위치와 관련된 보상 값을 연산할 수 있다. 제어부가 보상 값을 연산하는 구체적인 방법은 이하와 같다. 먼저, 제어부는 압축기의 구동이 개시되면, 피스톤의 상사점과 토출부 사이의 거리(XTDC)를 연산할 수 있다. 즉, 제어부는 제1 시점에서의 XTDC를 연산할 수 있다. 이후, 제어부는 기존의 상사점 제어에서 이용하던, 피스톤의 이동과 관련된 제어 파라미터(예를 들어, 가스 상수(Kg))의 변화를 모니터링할 수 있다. 제어부는 모니터링 중에, 상기 제어 파라미터가 변곡점을 형성하는 제2 시점에서, 피스톤의 상사점과 토출 부 사이의 거리(XTDC)를 연산할 수 있다. 이때, 제어 파라미터가 변곡점을 형성하는 시점에서 피스톤의 이론적인 위치를 Xv로 정의하고, 제2 시점에서 연산되는 XTDC를 Xv_obj로 산출할 수 있다. 다른 예에서, 제어부는 일 시점에서 산출된 제어 파라미터를 딥 러닝 연산부에 입력하고, 딥 러닝 연산부는 입력된 제어 파라미터를 이용하여 딥 러닝 연산을 수행함으로써, Xv_obj를 추정할 수 있다. 딥 러닝 연산부는 제어부에 의해 연산된 모터 전력, 피스톤의 스트로크 및 스크로크와 모터 전류의 위상차 를 이용하여, 가스 상수(Kg)가 변곡점을 형성하기 전에도 Xv_obj를 추정할 수 있다. 또한, 딥 러닝 연산부는 제어부에 의해 연산된 모터 전력, 피스톤의 스트로크 및 스크로크와 모터 전류의 위상차를 이용하여, 피스톤의 상사점이 토출부에 도래하기 전에도 Xv_obj를 추정할 수 있다. 한편, 딥 러닝 연산부는 모터 전압, 모터를 제어하는 인버터의 듀티비, 가스 상수(Kg), 압축기의 운전모드 정보, 피스톤의 운전 주파수 및 모터에 인가되는 직류 오프셋 중 적어도 하나를 더 입력받고, 입력된 정보를 이 용하여 Xv_obj를 추정할 수 있다. 이와 같이 복수의 방법으로 Xv_obj의 값을 결정한 후, 제어부는 Xv에서 Xv_obj를 감산한 결과 값을 제1 시점에 서의 XTDC에 합산함으로써, 최종적인 XTDC를 연산할 수 있다. 즉, 제어부는 Xv에서 Xv_obj를 감산함으로써, 피 스톤의 위치와 관련된 보상 값을 연산할 수 있다. 한편, 제어부는 기 설정된 시간 간격 동안 모터의 부하 변동량이 소정의 값 이하인 경우에도, 상기 피스톤 의 위치와 관련된 보상 값을 연산할 수 있다. 즉, 제어부는 모터의 부하량이 상당시간 동안 유지되는 경우 에도, 상기 피스톤의 위치와 관련된 보상 값을 연산함으로써, XTDC를 업데이트할 수 있다. 일 실시예에서, 제어부는 추정된 스트로크와 모터 전류의 위상차를 검출하고, 검출된 위상차를 이용하여 상 기 피스톤의 밀린 거리(Xdc)를 연산할 수 있다. 구체적으로, 제어부는 추정된 스트로크와 모터 전류의 위상 차를 변수로 포함하는 소정의 식을 이용하여, 피스톤의 밀린 거리(Xdc)를 연산할 수 있다. 일 예로, 제어부는 위상차를 이용하여 가스상수(Kg)와 댐핑상수(Cg)를 연산하고, 상기 가스상수, 댐핑상수 및 상기 스트로크를 이용하여 피스톤의 밀린 거리(Xdc)를 연산할 수 있다. 즉, 제어부는 가스상수(Kg)와 댐 핑상수(Cg) 및 상기 스트로크(Stk)를 변수로 포함하는 소정의 식을 이용하여 피스톤의 밀린 거리(Xdc)를 연산할수 있다. 또 다른 실시예에 있어서, 본 발명에 다른 리니어 압축기의 제어부는 검출된 부하 변동의 양이 소정의 범위 에 포함되면, 상기 피스톤의 상사점의 절대 위치를 검출할 수 있다. 제어부는 검출된 상사점의 절대 위치에 근거하여 모터를 제어할 수 있다. 즉, 제어부는 검출된 상사점의 절대 위치와 스트로크 지령치를 비교할 수 있으며, 비교결과에 근거하여 모 터 전압을 조정할 수 있다. 제어부는 검출된 상사점의 절대 위치가 토출부로부터 소정의 거리 간격 내에 진입하도록 모터를 제어할 수 있다. 제어부는 리니어 압축기의 기계적 특성과 관련된 정보를 저장하는 메모리(미도시)를 더 포함할 수 있다. 제어부는 리니어 압축기의 기계적 특성과 관련된 정보에 근거하여, 상기 피스톤의 초기 위치를 검출하며, 피스톤의 초기 위치에 근거하여, 피스톤의 상사점의 절대 위치를 검출할 수 있다. 예를 들어, 리니어 압축기의 기계적 특성과 관련된 정보는 리니어 압축기의 실린더, 피스톤, 피스톤에 구비된 스프링의 규격과 관련된 정보나, 실린더 내에서 피스톤의 초기 설치 위치와 관련된 정보를 포함할 수 있다. 제어부는 리니어 압축기의 구동 중에, 감지된 모터전압 및 모터전류를 이용하여 상기 피스톤의 스트로크 (Stk)를 추정하고, 추정된 스트로크에 근거하여, 피스톤의 초기 위치로부터, 상기 피스톤이 실린더 내에서 토출 부가 설치된 일 측과 반대 반향으로 밀린 거리(Xdc)를 검출할 수 있다. 제어부는 검출된 밀린 거리(Xdc)와 피스톤의 초기 위치에 근거하여, 피스톤의 상사점의 절대 위치를 검출할 수 있다. 제어부는 추정된 스트로크 값의 오차 및 검출된 밀린 거리(Xdc)의 오차 중 적어도 하나를 연산하고, 연산된 오차를 반영하여, 상기 피스톤의 상사점의 절대 위치를 업데이트할 수 있다. 이상에서는 수학식 1 내지 5를 이용하여, 피스톤의 위치를 검출하는 방법이 설명되었다. 위와 같은 방법에 따르는 제어부는 압축기의 구동이 개시되는 제1 시점에서는 복수의 수학식을 이용하여 피 스톤의 상사점과 토출부 사이의 거리(XTDC)를 연산할 수 있지만, 이에 대한 보상 값은 상기 제1 시점 이후인 제2 시점에서야 검출할 수 있으므로, 피스톤의 제어를 실시간으로 수행하기 어려운 문제점이 있다. 따라서, 본 발명에서 제안하는 제어부는 딥 러닝 알고리즘을 이용하여, 피스톤의 상사점과 토출부 사이의 거리에 대한 보상 값을 실시간으로 추정할 수 있다. 제어부는 제어 파라미터를 이용하여, 딥 러닝 연산에 이용될 입력 인자를 산출할 수 있다. 구체적으로, 딥 러닝 연산에 이용되는 입력 인자는, 모터에 인가되는 전력, 스트로크의 길이 및 스트로크와 전 류 또는 전압의 위상차를 포함할 수 있다. 또한, 딥 러닝 연산에 이용되는 입력 인자는, 모터에 흐르는 전류, 모터에 인가되는 전압, 가스상수(Kg), 모터 에 인가되는 전압의 직류 오프셋(DC Offset), 및 피스톤의 운전 주파수를 포함할 수 있다. 나아가, 딥 러닝 연산에 이용되는 입력 인자는, 딥 러닝 연산이 수행되는 시점에서 리니어 압축기의 운전 모드 와 관련된 식별 정보를 포함할 수 있다. 제어부는 딥 러닝 연산부를 탑재할 수 있으며, 딥 러닝 연산부는 제어부에 의해 연산된 입력 인자를 입 력받고, 미리 구축된 인공신경망을 이용하여 입력 인자와 대응되는 보상 값을 출력할 수 있다. 이와 같이 딥 러닝을 이용하여 보상 값을 추정하면, 위상차이의 변곡점이 발생하는 제2 시점이 도래하기 전에, 피스톤 제어를 실시간으로 수행할 수 있는 장점이 있다. 도 5를 참조하면, 딥 러닝 알고리즘을 탑재한 제어부가 Xdc, XTDC, Xv_obj, 가스상수(Kg) 및 댐핑상수(Cg)를 계 산하는 것과 관련된 S-domain 상의 프로세스가 도시된다. 도 5를 참조하면, 본 발명에서 제안하는 리니어 압축기는, 피스톤의 운동 또는 피스톤의 위치와 관련된 보상 값을 추정하는 딥 러 닝 연산부를 포함할 수 있다. 상기 딥 러닝 연산부는 제어부와 별도로 구현될 수도 있고, 제어부 내에 탑재될 수도 있다. 따라서, 구 현 형태에 따라 딥 러닝 연산부는 제어부와 실질적으로 동일한 구성일 수 있다. 딥 러닝 연산부는, 인공 지능 기술에 기반하여 정보들을 처리하는 역할을 수행하는 것으로, 정보의 학습, 정보 의 추론, 정보의 지각, 자연 언어의 처리 중 적어도 하나를 수행하는 하나 이상의 모듈을 포함할 수 있다. 딥 러닝 연산부는 머신 러닝(machine running) 기술을 이용하여, 리니어 압축기의 제어부 또는 메모리 내에 저 장된 정보, 리니어 압축기를 탑재한 전자기기의 동작 상태 정보, 통신 가능한 외부 저장소에 저장된 정보 등 방 대한 양의 정보(빅데이터, big data)를 학습, 추론, 처리 중 적어도 하나를 수행할 수 있다. 그리고, 딥 러닝 연산부는 상기 머신 러닝 기술을 이용하여 학습된 정보들을 이용하여, 실행 가능한 적어도 하나의 리니어 압축 기의 동작을 예측(또는 추론)하고, 상기 적어도 하나의 예측된 동작들 중 실현성이 가장 높은 동작이 실행되도 록 리니어 압축기를 제어할 수 있다. 머신 러닝 기술은 적어도 하나의 알고리즘에 근거하여, 대규모의 정보들을 수집 및 학습하고, 학습된 정보를 바 탕으로 정보를 판단 및 예측하는 기술이다. 정보의 학습이란 정보들의 특징, 규칙, 판단 기준 등을 파악하여, 정보와 정보 사이의 관계를 정량화하고, 정량화된 패턴을 이용하여 새로운 데이터들을 예측하는 동작이다. 머신 러닝 기술이 사용하는 알고리즘은 통계학에 기반한 알고리즘이 될 수 있으며, 예를 들어, 트리 구조 형태 를 예측 모델로 사용하는 의사 결정 나무(decision tree), 생물의 신경 네트워크 구조와 기능을 모방하는 인공 신경망(neural network), 생물의 진화 알고리즘에 기반한 유전자 프로그래밍(genetic programming), 관측된 예 를 군집이라는 부분집합으로 분배하는 군집화(Clustering), 무작위로 추출된 난수를 통해 함수값을 확률로 계산 하는 몬테카를로 방법(Monter carlo method) 등이 될 수 있다. 머신 러닝 기술의 한 분야로써, 딥러닝 기술은 인공 신경망(Deap Neuron Network, DNN) 알고리즘을 이용하여, 정보들을 학습, 판단, 처리 중 적어도 하나를 수행하는 기술이다. 인공 신경망(DNN)은 레이어와 레이어 사이를 연결하고, 레이어와 레이어 사이의 데이터를 전달하는 구조를 가질 수 있다. 이러한 딥러닝 기술은 병렬 연산에 최적화된 GPU(graphic processing unit)를 이용하여 인공 신경망(DNN)을 통하여 방대한 양의 정보를 학습할 수 있다. 또한, 딥 러닝 연산부를 구성하기 위해, 본 발명에 따른 리니어 압축기의 메모리는, 압축기의 구동과 관련된 학 습 데이터를 저장할 수 있다. 아울러, 제어부 또는 딥 러닝 연산부는 이렇게 저장된 학습 데이터를 주기적 으로 업데이트할 수 있다. 예를 들어, 제어부는 감지부에서 모터 전류나 모터 전압이 감지될 때마다, 감지된 모터 전류 또는 모터 전 압을 이용하여 상기 학습 데이터를 업데이트할 수 있다. 마찬가지로, 제어부는 피스톤의 운동과 관련된 제 어파라미터가 연산 될 때마다, 상기 학습 데이터를 업데이트할 수 있다. 도 6을 참조하면, 딥 러닝 연산을 수행하는 리니어 압축기의 제어방법이 설명된다. 도 6에 도시된 것과 같이, 압축기의 구동이 개시되면(S601), 제어부는 모터전류 및 모터전압을 이용하여, 피스톤의 상사점과 토출부 사이의 거리(XTDC)를 연산할 수 있다(S602). 아울러, 제어부는 딥 러닝 알고리즘을 이용하여, 상기 피스톤의 상사점과 토출부 사이의 거리(XTDC)에 대한 보상 값을 연산할 수 있다(S603). 제어부는 딥 러닝 알고리즘에 의해 획득된 보상 값을 상기 피스톤의 상사점과 토출부 사이의 거리(XTDC)에 적용함으로써, 피스톤의 상사점과 토출부 사이의 거리를 보다 정확하게 검출할 수 있다. 한편, 딥 러닝 알고리즘을 수행하는 딥 러닝 연산부는 제어부에 의해 연산된 적어도 하나의 제어 파라미터 를 입력받을 수 있다. 이때 제어 파라미터는, 모터 인가되는 전력, 피스톤의 스트로크 길이 및 모터에 흐르는 전류와 스트로크의 위상 차 중 적어도 하나를 포함할 수 있다. 스트로크 길이와, 전류와 스트로크의 위상차를 산출하는 방법은 위의 설명으로 갈음한다. 위에서 설명한 것과 같이, 제어부는 수학식 5를 이용하여, 제어 파라미터가 변곡점을 형성하는 시점에서 연 산되는 피스톤의 상사점과 토출부 사이의 거리(XTDC)인 Xv_obj 를 산출하며, 이를 통하여 피스톤의 상사점과 토출 부 사이의 거리(XTDC)에 대한 보상 값을 연산할 수 있다. 반면, 딥 러닝 연산에 의해 보상 값을 산출하는 경우, 가스상수(Kg)와 같은 제어 파라미터가 변곡점을 형성하기 전에, 미리 피스톤의 상사점과 토출부 사이의 거리(XTDC)에 대한 보상 값을 추정할 수 있다. 도 7에서는, 딥 러닝 연산을 수행하는 리니어 압축기의 또 다른 제어방법이 설명된다. 제어부는 리니어 압축기의 동작 모드에 근거하여, 피스톤의 상사점이 토출부에 도래하도록 모터를 제어할 수 있다(S701). 피스톤의 상사점이 토출부에 제1회 도래하는 시점을 제1 시점으로 정의한다. 예를 들어, 제어부는 압축기가 최대 냉력으로 동작하도록 설정된 경우, 피스톤의 상사점이 토출부에 도래하 도록 모터를 제어할 수 있다. 즉, 제어부는 압축기가 최대 냉력으로 동작하도록 설정된 경우, 피스톤이 실 린더 내에서 토출부가 설치된 일단 측으로 최대한 긴 스트로크를 가지며 이동하도록 모터의 구동을 제어할 수 있다. 이때, 제어부는 피스톤의 상사점이 토출부에 최대한 근접하면서도, 피스톤이 토출부와 충돌하지 않도록 모 터를 구동해야 하며, 이를 위해서는 실린더 내에서 피스톤의 위치와, 피스톤의 상사점과 토출부 사이의 거리 (XTDC) 및 이에 대한 오차 보상 값을 정확하게 추정해야 한다. 도 7을 참조하면, 제어부는 제1 시점으로부터 미리 설정된 시간 간격이 경과하면 피스톤의 이동과 관련된 제어 파라미터를 연산할 수 있다(S702). 예를 들어, 상기 시간 간격을 20초로 설정될 수 있다. 구체적으로, 제어부는 제1 시점으로부터 20초가 경과한 시점에서 감지된 모터전압 및 모터전류를 이용하여, 모터에 인가되는 전력, 피스톤의 스트로크 및 스트로크와 모터전류의 위상차를 산출할 수 있다. 한편, 제어부는 위와 같이 연산된 제어 파라미터를 딥 러닝 연산부에 입력할 수 있고, 딥 러닝 연산부는 입 력된 제어 파라미터를 이용하여, 피스톤의 위치와 관련된 보상 값을 획득할 수 있다(S703). 제어부는 제1 시점에서 피스톤의 상사점이 토출부에 도래한 후 제어 파라미터를 산출하고, 산출된 제어 파 라미터를 이용하여 딥 러닝 연산을 수행함으로써, 피스톤의 위치와 관련된 보상 값을 추정할 수 있다. 아울러, 제어부는 딥 러닝 알고리즘에 의해 획득된 보상 값을 이용하여, 제1 시점 이후 제2 시점에서 피스 톤의 상사점이 토출부에 도달하도록 압축기의 구동을 제어할 수 있다(S704). 이와 같이, 제어부는 피스톤의 상사점이 토출부에 도달할 때마다, 딥 러닝 연산을 수행하기 위한 제어 파라 미터를 산출하고, 제1 시점 이후 산출된 제어 파라미터는 제2 시점 이후 새로운 제어 파라미터가 산출될 때까지, 딥 러닝 연산의 입력 인자로 이용될 수 있다. 도 7에 도시된 제어 방법과 관련하여, 도 8에서는 보상 값의 변화를 나타내는 그래프가 도시된다. 도 8을 참조하면, 제1 시점(T1)과 제2 시점(T2)에 각각, 피스톤의 상사점이 토출부에 도wa달하는 최대 냉력 제 어(TDC max)가 수행된다. 제어부는 상기 제1 및 제2 시점(T1, T2)으로부터 미리 설정된 시간 간격(P)이 경과한 시점에서, 딥 러닝 연 산에 이용될 제어 파라미터를 산출할 수 있다. 즉, 제어부는 제3 시점(Ta)과 제4 시점(Tb)에서 각각 모터에 인가되는 전력, 피스톤의 스트로크 및 스트로 크와 모터전류 사이의 위상차를 산출할 수 있다. 또한, 제어부는 위와 같이 산출된 제어 파라미터를 딥 러 닝 연산부에 입력함으로써, 피스톤의 위치와 관련된 보상 값을 획득할 수 있다. 도 8을 참조하면, 제어부는 제2 시점(T2)에서, 제3 시점(Ta)에서 연산된 제어 파라미터에 대응되는 보상 값 을 이용하여 모터를 제어한다. 도 8에 도시된 것과 같이, 제1 시점(T1)에서 적용된 보상 값의 크기와, 제2 시점(T2)에서 적용된 보상 값의 크 기는 서로 상이하다.한편, 도 9에서는 딥 러닝 연산 수행하는 리니어 압축기의 또 다른 실시예가 설명된다. 도 9를 참조하면, 제어부는 상사점이 토출부에 도달하도록 모터를 제어하고(S901), 상사점이 토출부에 도달 한 후 미리 설정된 시간 간격이 경과하면 피스톤의 이동과 관련된 제어 파라미터를 연산할 수 있다(S902). 아울러, 제어부는 연산된 제어 파라미터를 이용하여, 피스톤의 상사점과 토출부 사이의 거리(Xtdc)와 관련 된 보상 값을 연산할 수 있다(S903). 예를 들어, 보상 값을 연산하는 단계(S903)는, 피스톤의 상사점이 토출부에 도달할 때마다 수행될 수 있다. 다른 예에서, 보상 값을 연산하는 단계(S903)는, 일정 주기마다 반복적으로 수행될 수 있다. 한편, 메모리는 보상 값을 연산하는 단계(S903)가 수행될 때마다, 연산된 보상 값을 저장할 수 있다. 제어부는 보상 값을 연산한 후, 현재 연산된 보상 값의 크기와, 이전에 연산된 보상 값의 크기를 비교할 수 있다(S904). 현재 연산된 보상 값의 크기가 이전에 연산된 보상 값보다 크면, 제어부는 딥 러닝 연산을 수행하여, 피스 톤의 상사점과 토출부 사이의 거리(Xtdc)와 관련된 보상 값을 재검출할 수 있다(S905). 현재 연산된 보상 값의 크기가 이전에 연산된 보상 값보다 크지 않으면, 제어부는 현재 연산된 보상 값을 그대로 적용하여, 모터의 구동을 제어할 수 있다(S906). 도 10 내지 도 14에서는 딥 러닝 연산을 활성화 또는 비활성화시키는 리니어 압축기의 제어 방법이 도시된다. 즉, 제어부는 딥 러닝 연산의 신뢰도가 보장되는 조건 하에서는, 딥 러닝 연산부를 활성화시키고, 딥 러닝 연산부의 출력을 이용하여 리니어 압축기의 모터를 제어할 수 있다. 반면, 제어부는 딥 러닝 연산의 신뢰도 가 낮아지는 조건 하에서는, 딥 러닝 연산부를 비활성화시키고, 리니어 압축기의 모터를 제어함에 있어서, 딥 러닝 연산부의 출력을 제외시킬 수 있다. 이하에서는 딥 러닝 연산의 활성화 또는 비활성화를 결정하는 복수의 조건과 관련된 실시예들이 설명된다. 먼저, 도 10을 참조하면, 제어부는 피스톤의 운동과 관련된 스트로크 지령치를 생성하고, 제어파라미터를 이용하여 피스톤의 상사점과 토출부 사이의 거리를 검출할 수 있다. 제어부는 생성된 스트로크 지령치와, 피스톤의 상사점과 토출부 사이의 거리를 비교할 수 있다(S1001). 아울러, 제어부는 검출된 거리가 상기 스트로크 지령치보다 작으면, 딥 러닝 연산부의 출력을 이용하여 모 터를 제어할 수 있다(S1002). 즉, 제어부는 제어부에 의해 산출된 피스톤의 상사점과 토출부 사이의 거리(XTDC)가 스트로크 지령치에 도달 하지 않으면, 딥 러닝 연산부가 주기적으로 피스톤의 위치와 관련된 보상 값을 출력하도록 상기 딥 러닝 연산부 를 활성화시킬 수 있다. 반면, 제어부는 검출된 거리가 스크로크 지령치 이상이면, 딥 러닝 연산부의 동작을 비활성화시키고, 제어 부에 의해 연산된 제어파라미터를 이용하여 모터를 제어할 수 있다. 이 경우, 제어부는 딥 러닝 연산부의 출력을 차단하고, 딥 러닝 연산부의 출력이 차단되기 전에 상기 딥 러 닝 연산부에서 출력된 보상 값을 이용하여, 모터를 제어할 수 있다. 도 11을 참조하면, 제어부는 제어파라미터를 이용하여 리니어 압축기의 동작 상태 및 상기 리니어 압축기를 구비하는 전자기기의 동작 상태 중 적어도 하나를 검출할 수 있다(S1101). 또한, 제어부는 검출된 동작 상태가 정상 상태(Normal State)에 대응되는지 여부를 판단할 수 있다(S1102). 구체적으로, 제어부는 모터에 인가되는 전압, 상기 모터에 흐르는 전류 및 상기 모터에서 소비되는 전력을 모니터링함으로써, 리니어 압축기가 정상 상태인지 여부를 판단할 수 있다. 예를 들어, 제어부는 모터 전압, 모터 전류, 전력이 미리 설정된 범위를 벗어나는 경우, 리니어 압축기의 동작 상태가 비정상인 것으로 판단할 수 있다. 다른 예에서, 제어부는 모터 전압, 모터 전류, 전력 중 적어도 하나가 급격하게 감소하거나 증가하는 경우, 리니어 압축기의 동작 상태가 비정상인 것으로 판단할 수 있다. 한편, 제어부는 리니어 압축기를 구비하는 전자기기인 냉장고의 동작 상태를 검출할 수도 있다. 제어부(2 5)는 냉장고 고내의 온도가 급격하게 증가 또는 감소하는 경우, 상기 냉장고의 동작 상태가 비정상인 것으로 판 단할 수 있다. 도 11을 참조하면, 압축기 및 전자기기의 동작 상태가 정상인 것으로 판단되면, 제어부는 딥 러닝 연산을 활성화시킬 수 있다(S1103). 즉, 제어부에 의해 딥 러닝 연산이 활성화되면, 제어부는 딥 러닝 연산부에 의해 추정된 보상 값을 이 용하여, 모터의 구동을 제어할 수 있다. 또한, 제어부는 압축기의 동작 상태가 정상이 아닌 것으로 판단되면, 상기 딥 러닝 연산부의 동작을 비활성 화시킬 수 있다(S1104). 이 경우, 제어부는 위에서 언급된 수학식 1 내지 5를 이용하여, 피스톤의 상사점과 토출부 사이의 거리를 산출하고, 산출된 거리에 대한 보상 값을 연산할 수 있다. 도 12를 참조하면, 제어부는 압축기가 특정 운전 모드를 수행 중인지 여부를 판단할 수 있다(S1201). 예를 들어, 제어부는 압축기의 소손을 방지하기 위한 보호 모드가 동작 중인지 여부를 판단할 수 있다. 구체적으로, 제어부는 사용자 입력에 근거하여 압축기의 복수의 운전 모드 중 딥 러닝 연산이 비활성화되어 야 할 적어도 하나의 운전 모드를 선택할 수 있다. 위와 같이, 압축기가 미리 선택된 특정 운전 모드를 수행 중이라면, 제어부는 딥 러닝 연산을 비활성화시킬 수 있다(S1202). 또한, 압축기가 상기 특정 운전 모드를 수행하는 중이 아니라면, 제어부는 딥 러닝 연산을 활성화시킬 수 있다(S1203). 도 13을 참조하면, 제어부는 압축기가 비대칭 운전 모드를 수행 중인지 여부를 판단할 수 있다(S1301). 비대칭 운전 모드란 피스톤의 초기 위치로부터 상사점과 하사점의 거리가 상이하도록 모터를 구동하는 것을 의 미한다. 압축기가 비대칭 운전 모드를 수행 중이라면, 제어부는 딥 러닝 연산을 비활성화시킬 수 있다(S1302). 또한, 압축기가 비대칭 운전 모드를 수행하는 중이 아니라면, 제어부는 딥 러닝 연산을 활성화시킬 수 있다 (S1303). 즉, 제어부는 피스톤이 초기위치로부터 비대칭 왕복 운동을 수행하는 경우, 딥 러닝 연산부의 동작을 비활 성화시키고, 미리 설정된 수학식에 의해 연산된 제어파라미터를 이용하여 모터를 제어할 수 있다. 도 14를 참조하면, 제어부는 압축기가 최대 행정 운전을 수행하는 중인지 여부를 판단할 수 있다(S1401). 여기에서, 최대 행정 운전이란, 피스톤이 토출부와 충돌하기 직전까지 이동하도록 모터를 제어하는 것을 의미한 다. 최대 행정 운전을 수행 중인 압축기의 경우, 피스톤의 상사점이 토출부에 접하도록 형성된다. 압축기가 최대 행정 운전을 수행 중이라면, 제어부는 딥 러닝 연산을 비활성화시킬 수 있다(S1402). 또한, 압축기가 최대 행정 운전을 수행하는 중이 아니라면, 제어부는 딥 러닝 연산을 활성화시킬 수 있다(S1403). 이하 도 15에서는, 리니어 압축기의 제어 방법과 관련된 일 실시예가 설명된다. 제어부는 미리 설정된 주기마다 딥 러닝 연산에 이용될 제어 파라미터를 획득할 수 있다(S1501). 이후, 상 기 획득된 제어 파라미터는 딥 러닝 연산부에 입력될 수 있다. 아울러, 제어부는 현재 압축기의 운전 모드를 확인할 수 있다(S1502). 구체적으로, 제어부는 딥 러닝 연산부로 제어파라미터를 입력하는 시점에서, 리니어 압축기의 동작 모드를 식별하고, 식별된 동작 모드에 근거하여 상기 제어파라미터 중 일부를 선택하며, 선택된 일부를 딥 러닝 연산부 로 입력시킬 수 있다. 또한, 제어부는 확인된 운전 모드에 근거하여, 제어파라미터에 대해 스케일링(Scaling)을 수행할 수 있다 (S1503). 즉, 제어부는 운전 모드에 따라 스케일링 변수를 조정할 수 있으며, 조정된 스케일링 변수를 제어파라미터에 적용할 수 있다. 도 15를 참조하면, 제어부는 딥 러닝 연산 결과에 대해 노이즈 필터링을 수행할 수 있다(S1504). 이와 같이, 딥 러닝 연산의 전처리로서 스케일링을 수행하고, 후처리로서 노이즈 필터링을 수행함으로써, 제어 부는 최종적으로 보정된 피스톤 상사점으로부터 토출부 사이의 거리(Xtdc)를 검출할 수 있다(S1505). 도 16에서는 딥 러닝 연산과 관련된 오프셋 설정 방법이 설명된다. 도 16을 참조하면, 제어부는 피스톤의 상사점이 토출부에 도달한 후 압축기의 구동 상태가 안정 상태인지 여부를 판단할 수 있다(S1601, S1602). 여기에서, 안정 상태라 함은, 제어 파라미터의 떨림이 소정 이하로 줄어드는 상태를 의미한다. 따라서, 제어부 는 제어 파라미터의 변동량을 감시함으로써, 압축기가 안정 상태에 진입하였는지 여부를 판단할 수 있다. 압축기가 안정 상태인 것으로 판단되면, 제어부는 딥 러닝 연산과 관련된 오프셋을 초기화시킬 수 있다 (S1603). 또한, 딥 러닝 연산부는 피스톤의 상사점과 토출부 사이의 거리(Xtdc)와 관련된 복수의 보상 값을 출력하고, 제 어부는 상기 복수의 보상 값을 이용하여, 복수의 보정된 Xtdc를 획득할 수 있다(S1604). 제어부는 복수의 보정된 Xtdc 중 최소 값과, 이전에 최종 Xtdc로 설정된 값을 비교할 수 있다(S1605). 상기 최소 값이 이전에 최종 Xtdc로 설정된 값 보다 크면, 제어부를 딥 러닝 연산에 대해 오프셋을 재적용시킬 수 있다(S1606). 이하에서는 리니어 압축기의 또 다른 실시예가 설명된다. 본 발명에서 제안하는 리니어 압축기의 제어부는, 감지부에 의해 감지된 모터전압 및 모터전류 중 적어도 하나를 이용하여, 피스톤의 운동과 관련된 적어도 하나의 제어파라미터를 연산한 후, 딥 러닝 알고리즘을 이용 하여 제어파라미터의 보상 값을 검출할 수 있다. 이때, 딥 러닝 연산부는 제어부 내에 탑재되는 것으로 정의할 수 있다. 즉, 제어부는 딥 러닝 알고리즘 을 구비하고, 상기 딥 러닝 알고리즘을 이용하여 Xtdc의 오차를 감소시키기 위한 보상 값을 추정할 수 있다. 구체적으로, 제어부는 연산된 제어파라미터를 이용하여, 피스톤과 상기 토출부 사이의 거리를 산출(Xtdc)하 고, 딥러닝 알고리즘를 이용하여 산출된 거리(Xtdc)에 적용되는 보상 값을 검출할 수 있다. 보상 값이 검출되면, 제어부는 수학식에 의해 최초 연산된 Xtdc를 보정하여, 최종의 Xtdc_c 값을 산출할 수 있다. 제어부는 산출된 Xtdc_c에 근거하여, 피스톤이 동작 중에 상사점에 도달했는지 여부를 판단할 수 있다. 아 울러, 제어부는 산출된 Xtdc_c에 근거하여, 피스톤의 상사점이 토출부에 도달하도록 모터를 제어할 수 있다. 한편, 제어부는 피스톤의 이동과 관련된 제어파라미터나, 딥 러닝 연산을 통해 획득된 보상 값 중 적어도 하나를 메모리에 저장할 수 있다. 또한, 제어부는 딥 러닝 연산에 의해 보상 값이 연산 될 때마다, 현재 연 산된 보상 값과,이전에 연산된 보상 값을 비교할 수 있다. 나아가, 제어부는 피스톤의 상사점이 토출부에 도달할 때마다 제어파라미터의 연산 값을 갱신할 수 있다. 메모리는 제어파라미터의 연산 값이 갱신될 때마다, 이를 저장할 수 있다. 또한, 제어부는 제어파라미터의 연산 값이 갱신될 때마다, 딥러닝 알고리즘을 이용하여 갱신된 제어파라미터의 연산 값에 대응되는 보상 값을 재검출할 수 있다. Xtdc에 대한 보상 값이 클수록 Xtdc_c의 값이 감소하므로, 압축기 구동의 신뢰성 확보를 위해, 보상 값 검증이 필요하다. 따라서, 제어부는 재검출된 보상 값이 이전에 검출된 보상 값보다 크면, 갱신되기 전의 제어파라미터의 연 산 값과, 재검출된 보상 값을 파싱(Parsing)하고, 파싱 결과를 이용하여 딥러닝 연산을 다시 수행할 수 있다. 일 실시예에 있어서, 제어부는 피스톤의 상사점이 토출부에 도달한 후 미리 설정된 시간간격이 경과한 후에 연 산된 제어파라미터를 딥 러닝 알고리즘에 적용하여, 보상 값을 재검출할 수 있다.피스톤의 상사점이 서로 다른 시점인 제1 시점과, 제2 시점에 각각 상기 토출부에 도달하는 경우, 제어부는 상기 제1 시점이 도래하기 전에, 딥 러닝 알고리즘을 수행함으로써, 제1 시점에 대응되는 제1 보상 값을 검출할 수 있다. 또한, 제어부는 제1 시점으로부터 미리 설정된 시간간격이 경과한 후에 연산된 제어파라미터를 딥 러닝 알 고리즘에 적용하여, 제2 시점에 대응되는 제2 보상 값을 검출할 수 있다. 이에, 제어부는 상기 제1 보상 값을 이용하여, 상기 제1 시점으로부터 상기 시간간격이 경과한 후로부터, 상기 제2 시점으로부터 상기 시간간격이 경과한 후까지 상기 피스톤의 절대 위치를 검출할 수 있다. 본원발명에 따른 리니어 압축기 및 그의 제어방법은, 피스톤과 토출 밸브의 충돌력을 감소시킴으로써, 리니어 압축기에서 발생하는 소음을 감소시킬 수 있는 효과가 있다. 아울러 본원발명에서는, 피스톤과 토출 밸브의 충 돌을 방지함으로써, 충돌로 인한 피스톤 및 토출 밸브의 마모를 감소시킬 수 있으므로, 기구 및 부품의 수명이 늘어나게 될 수 있는 효과가 도출된다. 또한, 본원발명에 따른 리니어 압축기의 및 그의 제어 방법은, 별도의 센서를 추가하지 않으면서도, 실린더 내 에서의 피스톤의 절대 위치를 검출할 수 있으므로, 소음이 저감됨과 동시에 고효율 운전을 수행할 수 있는 효과 가 있다."}
{"patent_id": "10-2018-0068272", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 일반적인 레시프로 방식의 왕복동식 압축기의 일 예를 나타내는 개념도. 도 1b는 일반적인 리니어 방식의 앙복동식 압축기의 일 예를 나타내는 개념도. 도 1c는 일반적인 리니어 압축기의 상사점 제어에 이용되는 다양한 파라미터들과 관련된 그래프. 도 2는 리니어 압축기의 구성요소를 나타내는 블록도. 도 3은 본 발명에 따른 리니어 압축기의 일 실시예를 나타내는 단면도. 도 4는 본 발명에 따른 리니어 압축기의 일 실시예를 나타내는 개념도. 도 5는 본 발명에 따른 리니어 압축기의 제어 프로세스를 s-domain에서 나타내는 개념도. 도 6은 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 7은 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 8은 본 발명에 따른 리니어 압축기의 제어와 관련된 그래프. 도 9는 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 10은 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 11은 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 12는 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 13은 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 14는 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 15는 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도. 도 16은 본 발명에 따른 리니어 압축기의 제어 방법을 나타내는 흐름도."}
