{"patent_id": "10-2021-0155139", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0068889", "출원번호": "10-2021-0155139", "발명의 명칭": "Ｂ２Ｂ 기반 비대면 패션 큐레이팅 서비스 제공 시스템", "출원인": "주식회사 스타일컨설트", "발명자": "오지현"}}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인종, 직업군, 선호색상 및 피부톤을 포함하는 사용자 정보를 입력하고, 주문서를 수신하여 출력하는 사용자 단말;상기 사용자 정보를 전달받은 후, 사용자의 신체치수를 측정한 신체치수 데이터를 입력하고, 원단 재료,브랜드, 색상 및 패턴을 선별하여 컨설팅 데이터로 업로드하는 컨설턴트 단말;상기 컨설팅 데이터를 수신한 후 기 구축된 인공지능 알고리즘에 의해 선택된 원단 리스트를 상기 컨설턴트 단말로 전송하고, 원단 변경이 존재하는 경우 주문서를 재작성하여 발주서를 출력하는 관리자 단말; 및적어도 하나의 인종, 직업군, 선호색상, 피부톤, 신체치수, 원단 재료, 브랜드, 색상 및 패턴을 매핑하여 빅데이터를 구축하는 빅데이터화부, 상기 인종, 직업군, 선호색상, 피부톤 및 신체치수가 질의(Query)로 입력되면,원단 재료, 브랜드, 색상 및 패턴이 결과로 출력되도록 적어도 하나의 인공지능 알고리즘을 모델링하는 모델링부, 상기 적어도 하나의 인공지능 알고리즘 중 정확도가 높은 인공지능 알고리즘을 선택하여 상기 관리자 단말에서 사용하는 인공지능 알고리즘으로 설정하는 세팅부를 포함하는 큐레이팅 서비스 제공 서버;를 포함하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 큐레이팅 서비스 제공 서버는,적어도 하나의 원단업체 단말로부터 적어도 하나의 원단을 생산 또는 판매하는 원단업체를 등록하여 원단업체풀(Pool)을 생성하고, 상기 관리자 단말에서 발주서를 작성할 때 상기 주문서 내 포함된 원단을 공급하는 원단업체를 선정하여 발주서를 작성 및 전송하도록 하는 업체관리부;를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 큐레이팅 서비스 제공 서버는,상기 적어도 하나의 원단업체 단말이 원단을 생산하는 공장의 단말인 경우, 각 공장별로 로딩(Load)된 업무부하및 스케줄을 파악하여 상기 발주서의 원단 제작을 할당할 때 상기 업무부하 및 스케줄에 기반하여 상기 발주서를 할당하는 할당부;를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 큐레이팅 서비스 제공 서버는,상기 사용자 단말 및 컨설턴트 단말의 언어가 상기 관리자 단말의 언어와 서로 다른 경우, 서로 다른 언어 간자동번역 서비스를 제공하는 통역부;공개특허 10-2023-0068889-3-를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 큐레이팅 서비스 제공 서버는,상기 발주서가 출력되고 난 후, 상기 사용자 단말에서 기재한 주소지가 국외인 경우, 상기 발주서를 수신한 원단업체 단말에서 국제배송을 신청하고 택배 수거, 택배 공항으로 이동, 국외도착, 수입신고, 통관 및 국외배송의 절차를 상기 사용자 단말로 공유하는 트래킹부;를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 큐레이팅 서비스 제공 서버는,상기 사용자 단말의 인종, 직업군, 선호색상 및 피부톤을 포함한 사용자 정보와, 상기 컨설턴트 단말로부터 업로드받은 신체치수 데이터, 원단 재료, 브랜드, 색상 및 패턴을 데이터셋(DataSet)으로 생성한 후 상기 인공지능 알고리즘을 지속적으로 재학습시키는 재학습부;를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 큐레이팅 서비스 제공 서버는,각 사용자의 국가별, 인종별, 직업별 및 선호도별 선택되는 원단 재료, 브랜드, 색상 및 패턴을 추출하여 시각화하는 시각화부;를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 큐레이팅 서비스 제공 서버는,상기 각 국가별 수요를 파악하기 위해 각 국가별 원단 재료, 브랜드, 색상 및 패턴을 추출하여 데이터베이스화하는 데이터베이스화부;를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 큐레이팅 서비스 제공 서버는,상기 원단 변경이 존재하는 피드백 데이터가 상기 관리자 단말로 전송된 경우, 상기 기 구축된 인공지능 알고리즘에 의해 선택된 원단 리스트에 발생된 오류 부분 및 오류 원인을 파악하고, 상기 파악된 오류 부분 및 오류공개특허 10-2023-0068889-4-원인을 상기 빅데이터에 업데이트한 후, 상기 오류의 패턴을 발견하고 분류를 통하여 오류율을 예측하기 위하여딥러닝을 실시하며, 상기 딥러닝으로 도출된 데이터를 상기 빅데이터로 반영하는 오류검출부;를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 큐레이팅 서비스 제공 서버는,상기 사용자의 인종, 피부톤 및 신체치수로 3D 객체를 생성하고, 상기 컨설턴트 단말에서 지정한 원단 및 스타일에 따라 가상으로 생성된 의상을 상기 3D 객체와 합성하여 VR(Virtual Contents)로 제공하는 VR제공부;를 더 포함하는 것을 특징으로 하는 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템."}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템이 제공되며, 인종, 직업군, 선호색상 및 피부톤을 포함하는 사용자 정보를 입력하고, 주문서를 수신하여 출력하는 사용자 단말, 사용자 정보를 전달받은 후, 사용자의 신체 치수를 측정한 신체치수 데이터를 입력하고, 원단 재료, 브랜드, 색상 및 패턴을 선별하여 컨설팅 데이터로 업로 (뒷면에 계속)"}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템에 관한 것으로, 국내외 이미지 컨설턴트가 사용 자 정보를 기반으로 원단을 선정하면, 인공지능 알고리즘으로 추천된 원단과 비교하여 주문서 재작성 여부를 체 크한 후 발주서를 출력하는 플랫폼을 제공한다."}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양한 정보가 넘치는 현대의 정보통신 사회에서 사용자는 원하는 정보를 탐색하고 검색하는데 필요한 비용인 탐색비용(Search Costs)은 감소한 반면 정보과잉으로 인한 선택의 역설(The Paradox of Choice) 현상이 나타나 고 있다. 다양한 콘텐츠 분야에서 빅데이터를 기반으로 하는 큐레이션 서비스가 급부상하는 가운데, 큐레이션 과 서비스 디자인의 개념으로 최근에는 소비자의 관심 정보를 제공하는 것을 큐레이션 서비스 디자인이라고 한 다. 또, 패션 라이프스타일을 분석하고 콘텐츠를 기획하고 분석하여 소비자에게 적절한 서비스 디자인을 제공 하는 것을 패션 큐레이션 서비스라고 한다. 소비자의 패션 라이프스타일을 분석하고 콘텐츠를 추천해주는 것으 로 큐레이션 서비스가 패션 산업 분야의 마케팅이나 엔터테인먼트 분야에서 각광 받고 있으며, 형식적인 콘텐츠 를 공급하는 업계도 패션 큐레이션 서비스를 적극 수용하고, 빅데이터를 기반으로 하는 개인화된 맞춤형 콘텐츠 를 제공하는 방향으로 발전하고 있다. 이때, 사용자의 선호도를 기반으로 협업필터링을 이용하여 맞춤복을 제공하거나 사용자 데이터를 기반으로 원단 을 추천하여 맞춤복을 제조하는 방법이 연구 및 개발되었는데, 이와 관련하여, 선행기술인 한국등록특허 제10- 2274836호(2021년07월07일 공고) 및 한국공개특허 제2020-0014145호(2020년02월10일 공개)에는, 사용자 단말로 부터 사용자 정보를 입력받고, 사용자 정보와 매칭되는 스타일을 생성하기 위해 기 구축된 빅데이터 내 체형표 준데이터 및 원단표준데이터를 추출하며, 사용자 단말로 생성된 맞춤복 스타일 정보를 제공하는 구성과, 소비자, 원단판매자 및 맞춤복 판매점을 연결하도록 네트워크를 구축하고, 소비자가 선택한 원단을 이용하여 맞 춤복 판매점에서 옷을 제작할 수 있도록, 원단 특성, 상품별 가격, 선호도 및 판매현황에 따른 빅데이터를 구축 하며, 소비자로부터 신체사이즈, 성별, 연령 및 직업을 포함하는 고객 데이터를 수집하고, 고객 데이터에 대응 하는 원단 및 스타일을 추출하여 고객에게 자동추천기능을 제공하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 체형정보만을 이용하여 사용자에게 원단 및 스타일을 추천해주고 있고, B2C(Business to Customer) 형태로 협업필터링(Collaborative Filtering)을 제공하고 있을 뿐이어서, B2B(Business to Business) 서비스까지 커버할 수 있는 구성이 아니다. 후자의 경우에도 신체사이즈, 성별 및 연령을 포함한 소 비자 정보를 받고 있으나 이는 피부색상이 유사한 단일민족 개념의 한국에만 적용되는 구성일 뿐, 피부색상이나 체형이 인종별로 서로 다른 전 세계적(Worldwide)으로 적용되는 구성이 아니다. 이에, 국내외의 소비자가 한국 에서 원단을 주문할 수 있는 B2B 기반의 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 사용자 단말로부터 인종, 직업군, 선호색상 및 피부톤을 포함하는 사용자 정보를 수집 한 후 컨설턴트 단말로 전송하고, 컨설턴트 단말에서 사용자의 신체치수를 측정한 신체치수 데이터를 입력하고, 원단 재료, 브랜드, 색상 및 패턴을 선별하여 관리자 단말로 전송하며, 관리자 단말은 기 구축된 빅데이터 및 인공지능 알고리즘으로 사용자 정보에 대응하는 추천 원단을 컨설턴트 단말로 전송하고, 이미지 컨설턴트 및 사 용자의 피드백에 따라 주문서가 변경되는 경우 피드백을 반영한 주문서를 재작성하여 발주를 할 수 있는, B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 인종, 직업군, 선호색상 및 피부톤을 포함하는 사용자 정보를 입력하고, 주문서를 수신하여 출력하는 사용자 단말, 사용자 정보를 전달받은 후, 사용자의 신체치수를 측정한 신체치수 데이터를 입력하고, 원단 재료, 브랜드, 색상 및 패턴을 선별하여 컨 설팅 데이터로 업로드하는 컨설턴트 단말, 컨설팅 데이터를 수신한 후 기 구축된 인공지능 알고리즘에 의해 선 택된 원단 리스트를 컨설턴트 단말로 전송하고, 원단 변경이 존재하는 경우 주문서를 재작성하여 발주서를 출력 하는 관리자 단말 및 적어도 하나의 인종, 직업군, 선호색상, 피부톤, 신체치수, 원단 재료, 브랜드, 색상 및 패턴을 매핑하여 빅데이터를 구축하는 빅데이터화부, 인종, 직업군, 선호색상, 피부톤 및 신체치수가 질의 (Query)로 입력되면, 원단 재료, 브랜드, 색상 및 패턴이 결과로 출력되도록 적어도 하나의 인공지능 알고리즘 을 모델링하는 모델링부, 적어도 하나의 인공지능 알고리즘 중 정확도가 높은 인공지능 알고리즘을 선택하여 관 리자 단말에서 사용하는 인공지능 알고리즘으로 설정하는 세팅부를 포함하는 큐레이팅 서비스 제공 서버를 포함 한다."}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 국내외의 소비자가 한국에서 원단을 주문할 수 있는 B2B 기반의 플랫폼을 기반으로, 이미지 컨설턴트와 함께 사용자에게 맞는 원단을 골라줄 수 있으면서도, 이미지 컨설턴트의 추천 리스트를 기반으로 빅데이터를 구축한 후 인공지능 알고리즘으로 추천 아이템을 추출할 수 있 는 협업필터링을 제공함으로써, 학습 및 테스트가 완료된 이후에는 이미지 컨설턴트의 개입이 없더라도 자동으 로 사용자에게 맞는 원단을 골라줄 수 있고, 이미지 컨설턴트는 추천된 원단을 검수하는 역할만 하면 되므로 인 력 및 시간의 낭비를 막을 수 있으며, 국내 침체된 패션시장에 활기를 불어넣을 새로운 판로를 개척할 수 있다."}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템을 설명하기 위한 도면 이다. 도 1을 참조하면, B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템은, 적어도 하나의 사용자 단말 , 큐레이팅 서비스 제공 서버, 적어도 하나의 컨설턴트 단말, 적어도 하나의 관리자 단말 및 원단업체 단말을 포함할 수 있다. 다만, 이러한 도 1의 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 사용자 단말은 네트워크를 통하여 큐레이팅 서비스 제공 서버와 연결될 수 있다. 그리고, 큐레이팅 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말, 적어도 하나의 컨설턴트 단말, 적어도 하나의 관리자 단말 및 원단업체 단말과 연결 될 수 있다. 또한, 적어도 하나의 컨설턴트 단말은, 네트워크를 통하여 큐레이팅 서비스 제공 서버 와 연결될 수 있다. 그리고, 적어도 하나의 관리자 단말은, 네트워크를 통하여 적어도 하나의 사용자 단말, 큐레이팅 서비스 제공 서버 및 적어도 하나의 컨설턴트 단말과 연결될 수 있다. 마지막으로, 원단업체 단말은, 네트워크를 통하여 사용자 단말, 컨설턴트 단말, 큐레이팅 서비스 제공 서버, 적어도 하나의 관리자 단말과 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스 (Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워 크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다.하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 사용자 단말은, B2B 기반 비대면 패션 큐레이팅 서비스 관련 웹 페이지, 앱 페이지, 프로그 램 또는 애플리케이션을 이용하여 원단을 주문하는 고객인 사용자(User)의 단말일 수 있다. 이때 사용자 단말 은, 큐레이팅 서비스 제공 서버를 경유하여 컨설턴트 단말로 사용자 데이터(정보)를 제공하는 단말일 수 있고, 이에 따라 큐레이팅된 원단 및 스타일을 추천받으며, 추천된 원단 및 스타일로 만들어진 의상 을 VR로 출력하는 단말일 수 있다. 여기서, 적어도 하나의 사용자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 사용자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 사용자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 큐레이팅 서비스 제공 서버는, B2B 기반 비대면 패션 큐레이팅 서비스 웹 페이지, 앱 페이지, 프로그램 또 는 애플리케이션을 제공하는 서버일 수 있다. 그리고, 큐레이팅 서비스 제공 서버는, 적어도 하나의 인종, 직업군, 선호색상, 피부톤, 신체치수, 원단 재료, 브랜드, 색상 및 패턴을 매핑하여 빅데이터를 구축하는 서버일 수 있다. 큐레이팅 서비스 제공 서버는, 인종, 직업군, 선호색상, 피부톤 및 신체치수가 질의 (Query)로 입력되면, 원단 재료, 브랜드, 색상 및 패턴이 결과로 출력되도록 적어도 하나의 인공지능 알고리즘 을 모델링하고, 적어도 하나의 인공지능 알고리즘 중 정확도가 높은 인공지능 알고리즘을 선택하여 관리자 단말 에서 사용하도록 하는 서버일 수 있다. 그리고, 큐레이팅 서비스 제공 서버는, 사용자 단말에 서 인종, 직업군, 선호색상, 피부톤을 입력하고, 컨설턴트 단말에서 신체치수, 원단 재료, 브랜드, 색상 및 패턴을 입력하는 경우, 인공지능 알고리즘으로 추천된 원단 리스트와 비교하고 차이가 발생한 경우 추천 원 단 리스트를 다시 컨설턴트 단말로 전달하는 서버일 수 있다. 이때, 큐레이팅 서비스 제공 서버는, 컨설턴트 단말에서 주문서를 수정하지 않는 경우 인공지능 알고리즘의 예측 오류나 정확도 감소로 보고 컨 설턴트 단말에서 입력한 원단으로 학습 데이터셋을 다시 만들어 재학습을 시키고, 주문서의 수정이 발생한 경우 수정된 주문서를 이용하여 발주서를 원단업체 단말로 전달하는 서버일 수 있다. 여기서, 큐레이팅 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 컨설턴트 단말은, B2B 기반 비대면 패션 큐레이팅 서비스 관련 웹 페이지, 앱 페이지, 프로 그램 또는 애플리케이션을 이용하는 이미지 메이커 또는 이미지 컨설턴트의 단말일 수 있다. 컨설턴트 단말 의 컨설턴트는 국내외 바이어나 B2B 서비스의 고객이 된다. 해외 바이어가 국내의 원단 시장을 둘러보고 이를 수입해서 사용자에게 판매를 하거나 추천을 하게 되는데, 코로나(COVID19)로 인하여 국가간 교류나 출장이 제한되거나 자제됨에 따라 바이어들은 원단이 어느 나라에, 어떤 종류의 원단이, 얼마나 존재하는지 전혀 파악 하지 못하고 있다. 이에 따라, 컨설턴트 단말은, 본 발명의 플랫폼을 통하여 원단을 추천받거나 선택하고, 이미지 컨설턴트의 고객인 사용자에게 추천을 해줄 수 있는 단말일 수 있다. 여기서, 적어도 하나의 컨설턴트 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨 터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 컨설턴트 단말은, 네트워크 를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 컨설턴트 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular),PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 적어도 하나의 관리자 단말은, B2B 기반 비대면 패션 큐레이팅 서비스 관련 웹 페이지, 앱 페이지, 프로그 램 또는 애플리케이션을 이용하여 국내외 컨설턴트 단말로부터 주문서를 수신하고, 주문서 내 원단과 기 구축된 인공지능 알고리즘에서 추천한 원단 리스트를 비교하고, 서로 다른 원단이 존재할 경우 추천 원단 리스 트로 다시 컨설턴트 단말로 전달하고 피드백이 존재하는 경우, 이에 따라 주문서 및 발주서를 생성 및 출 력하는 관리자의 단말일 수 있다. 여기서, 적어도 하나의 관리자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 관리자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 관리자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 원단업체 단말은, B2B 기반 비대면 패션 큐레이팅 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플 리케이션을 이용하여 발주서를 수신하고 발주서에 기재된 원단을 생산 또는 판매하는 원단업체의 단말일 수 있 다. 이때, 원단업체 단말은 국내 배송인 경우 국내 택배를 이용하여 원단을 제공하고, 해외 배송인 경우 국내배송-수출절차-수입절차(통관)-해외배송이 될 수 있도록 해외배송 접수를 하고 그 결과를 큐레이팅 서비스 제공 서버로 공유하는 업체의 단말일 수 있다. 여기서, 원단업체 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱 (Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 원단업체 단말은, 네트워크를 통해 원격지의 서버 나 단말에 접속할 수 있는 단말로 구현될 수 있다. 원단업체 단말은, 예를 들어, 휴대성과 이동성이 보장 되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)- 2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰 (Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반 의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 큐레이팅 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 B2B 기반 비대면 패션 큐레이팅 서비스가 구현된 일 실시예를 설명하기 위한 도면 이다. 도 2를 참조하면, 큐레이팅 서비스 제공 서버는, 빅데이터화부, 모델링부, 세팅부, 업체관 리부, 할당부, 통역부, 트래킹부, 재학습부, 시각화부, 데이터베이스화부 , 오류검출부 및 VR제공부를 포함할 수 있다. 본 발명의 일 실시예에 따른 큐레이팅 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하나의 사용자 단말, 적어도 하나의 컨설턴트 단말, 적어도 하나의 관리자 단말 및 적어도 하나 의 원단업체 단말로 B2B 기반 비대면 패션 큐레이팅 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이 지 등을 전송하는 경우, 적어도 하나의 사용자 단말, 적어도 하나의 컨설턴트 단말, 적어도 하나의 관리자 단말 및 적어도 하나의 원단업체 단말은, B2B 기반 비대면 패션 큐레이팅 서비스 애플리케이 션, 프로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트 를 이용하여 서비스 프로그램이 적어도 하나의 사용자 단말, 적어도 하나의 컨설턴트 단말, 적어도 하나의 관리자 단말 및 적어도 하나의 원단업체 단말에서 구동될 수도 있다. 여기서, 웹 브라우저는웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프(Netscape), 익스플로러 (Explorer), 크롬(Chrome) 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램(Application)을 의 미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 빅데이터화부는, 적어도 하나의 인종, 직업군, 선호색상, 피부톤, 신체치수, 원단 재료, 브랜드, 색상 및 패턴을 매핑하여 빅데이터를 구축할 수 있다. 빅데이터화부는, 로우 데이터(Raw Data)를 병렬 및 분산하여 저장할 수 있고, 로우 데이터 내에 포함된 비정형(Unstructed) 데이터, 정형(Structured) 데 이터 및 반정형 데이터(Semi-Structured)를 정제하고, 메타 데이터로 분류를 포함한 전처리를 실시할 수 있고, 전처리된 데이터를 데이터 마이닝(Data Mining)을 포함하는 분석을 실시할 수 있다. 그리고, 빅데이터화부 는, 분석된 데이터를 시각화하여 출력할 수 있다. 이때, 데이터 마이닝은, 전처리된 데이터 간의 내재된 관계를 탐색하여 클래스가 알려진 훈련 데이터 셋을 학습 시켜 새로운 데이터의 클래스를 예측하는 분류(Classification) 또는 클래스 정보 없이 유사성을 기준으로 데이 터를 그룹짓는 군집화(Clustering)를 수행할 수 있다. 물론, 이외에도 다양한 마이닝 방법이 존재할 수 있으며, 수집 및 저장되는 빅데이터의 종류나 이후에 요청될 질의(Query)의 종류에 따라 다르게 마이닝될 수도 있다. 이렇게 구축된 빅데이터는, 인공신경망 딥러닝이나 기계학습 등으로 검증과정을 거칠 수도 있다. 이때, 인공 신경망은 CNN(Convolutional Neural Network) 구조가 이용될 수 있는데, CNN은 컨볼루션 층을 이용한 네 트워크 구조로 이미지 처리에 적합하며, 이미지 데이터를 입력으로 하여 이미지 내의 특징을 기반으로 이미지를 분류할 수 있기 때문이다. 또한, 텍스트 마이닝(Text Mining)은 비정형 또는 반정형 텍스트 데이터에서 자연어 처리 기술에 기반하여 유용 한 정보를 추출, 가공하는 것을 목적으로 하는 기술이다. 텍스트 마이닝 기술을 통해 방대한 텍스트 뭉치에서 의미 있는 정보를 추출해 내고, 다른 정보와의 연계성을 파악하며, 텍스트가 가진 카테고리를 찾아내거나 단순 한 정보 검색 그 이상의 결과를 얻어낼 수 있다. 이를 이용하여, 본 발명의 일 실시예에 따른 큐레이팅 서비스 에서는, 질의로 입력되는 식별자나 자연어를 분석하고, 그 안에 숨겨진 정보를 발굴해 내기 위해 대용량 언어자 원과 통계적, 규칙적 알고리즘이 사용될 수 있다. 또한, 클러스터 분석(Cluster Analysis)은, 비슷한 특성을 가진 객체를 합쳐가면서 최종적으로 유사 특성의 그룹을 발굴하는데 사용될 수 있다. 모델링부는, 인종, 직업군, 선호색상, 피부톤 및 신체치수가 질의(Query)로 입력되면, 원단 재료, 브랜드, 색상 및 패턴이 결과로 출력되도록 적어도 하나의 인공지능 알고리즘을 모델링할 수 있다. 협업필터링 (Collaborative Filtering)은 추천 시스템 알고리즘 중에서 현재까지 가장 우수한 성능을 보인다고 알려진 기법 으로, 과거에 상품을 구매하거나 평가하는데 있어 유사 성향을 보였던 고객들은 다른 아이템에도 유사성향을 보 일 것이라고 가정하에 목표 고객과 유사한 구매 선호도를 가진 다른 고객이 구매하거나 선호하는 상품을 목표 고객에게 추천해주는 기법이다. 협업필터링은 사용자 기반의 협업필터링과 아이템 기반의 협업필터링으로 나누 어지며, 내용기반 필터링에 비해 추천되는 아이템의 다양성을 보장할 수 있는 장점이 있지만 자료의 희소성 (Sparsity)과 확장성(Scalability)이라는 문제점을 갖고 있다. 즉, 사용자들에 의해 정보가 충분히 평가되기 전까지는 새로운 정보가 추천될 수 없으며, 사용자가 늘어날수록 모든 데이터를 사용하여 선호도를 계산하는 방 식은 처리에 많은 시간이 필요하다. 시장세분화(Market Segmentation)는 소비자의 행태와 동기가 다양해지고 있는 최근 소비시장에서 중요한 마케팅 개념이다. 소비자의 구매행동이 인구통계학적, 심리적 변수 등에 따라 영향을 받기 때문에 시장세분화 변수를 추천에 활용하는 것은 중요하다. 시장을 세분화하기 위한 변수로 인구통계학적 지리적 변수, 심리적 변수, 행 동적 변수로 나누기도 하고, 추천성능을 개선하기 위해 사장세분화 변수 중 인구 통계적 변수와 행동적 변수 (Rating, Site Preference, Internet Usage, Topic)를 이용할 수도 있다. <고객 프로파일 생성> 사용자 유사집단 생성을 위해 큐레이팅 서비스 선호 평점과 고객 성별ㆍ연령 등 제한적 인구통계정보를 사용하 기 보다는, 마케팅에서 일반적으로 사용되는 시장세분화이론에 근거하여 변수를 추가하여 프로파일을 생성할 수 있다. 특히 큐레이팅 서비스 분야에서 주로 쓰이는 변수를 기준으로 큐레이팅 서비스 평점 정보와 함께 인구통 계, 라이프스타일, 서비스 선택속성, 시설 선호패턴 유형을 각각 결합하여 4 종의 프로파일을 생성할 수 있다. 시장세분화이론에 근거하여 다중 프로파일을 생성하여 추천시스템 성능을 개선할 수 있는데, 웹사이트 트래픽 정보를 사용하기 때문에 시장세분화 변수 중 인구통계와 행동 변수만을 활용할 수 밖에 없다. 본 발명의 일 실시예에서는, 설문을 활용하여 고객의 심리적 변수까지 추가하여 제공할 수 있다. 즉, 시장세분 화 변수는 인구통계 지리적ㆍ심리적ㆍ행동적 변수로 구성되는데, 이에 더하여 인구통계 지리적 변수로 사용자 기본정보(국가, 인종, 피부톤, 성별, 연령, 결혼, 학력, 소득, 거주지)를 이용할 수 있고, 심리적 변수로 식생 활 라이프스타일(편의지향, 경제지향, 유행지향, 안전지향)과 서비스 선택속성을 이용할 수 있다. 마지막 행동 변수로 큐레이션 선호패턴 정보와 선호 큐레이션 평점 정보를 이용할 수 있다. <유사도 계산> 사용자 간의 유사도를 계산하는 것은 협업필터링 구현 과정단계 중 가장 중요한 단계이다. 같은 항목에 같은 평점을 준 경우 이들의 유사도는 높으며 비슷한 취향을 갖고 있다고 볼 수 있다. 유사도 계산은 프로파일 내 변수 유사도를 각각 계산한 후 평균 결합방식을 통해 최종 프로파일 유사도 산출이 이루어진다. 사용자의 유사 성을 계산하기 위한 측정 방법은 다양하고, 변수 등의 타입에 적합한 측정 방법을 사용해야 한다. 본 발명의 일 실시예에서는 협업필터링 구현 시 가장 많이 이용되는 피어슨 상관계수와 유클리디안 거리기법을 이용할 수 있다. 즉, 0 또는 1로 구성된 이진형 변수(인구통계정보)는 유클라디안 거리기법을 활용하고, 1~5점 척도로 구 성된 연속형 변수는 피어슨 상관계수를 활용한다. 변수들을 결합하는 방법에 대하여 앙상블 방법과 유사하게 단일 변수 유사도 간 단순 평균방식을 이용할 수 있다. 즉, 변수별 유사도를 합산한 후 평균하여 최종 프로파 일 유사도를 구한다. 유사도 기법에 대하여 구체적으로 살펴보면 아래와 같다. 피어슨 상관계수는 두 개의 속성 간 상관성을 계산하여 1에 가까울수록 양의 상관관계, -1에 가까울수록 음의 상관관계가 있으며, 0은 상관관계가 없음을 보여준다. 사용자 A와 B의 유사도는 이하 수학식 1과 같이 계산할 수 있다. 수학식 1"}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 2"}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 3"}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "w(A,B)는 사용자 A와 이웃 사용자 B간의 유사도이고, RA,i는 사용자 A가 아이템 i에 대해 평가한 선호도이고, (bar)RA는 사용자 A의 선호도 평균이고, RB,i는 사용자 B가 아이템 i에 대해 평가한 선호도이며, (bar)RB는 사 용자 B의 선호도 평균이다. 유클라디안 거리는 다차원 공간에서 두 점 간의 거리를 의미한다. 범주형 속성을 가지는 변수의 경우 주로 사용되며, 해당 속성이 있으면 1 없으면 0으로 표시한다. 사용자 A와 B의 유사도는 수학식 2와 같이 계산할 수 있다. 유클라디안 거리는 거리가 가까울수록 0의 값을 갖게 되므로, 0에서 1사이의 값을 가질 수 있도록 변환식 w(A,B)를 통해 변환하여 최종 유사도를 산출한다. <사용자 선호도 예측 및 추천 매칭 생성> 사용자와 가장 유사한 이웃 집단을 구성하고, 이웃 집단의 평점을 활용하여 추천시스템 사용자가 평가하지 않은 상품의 평점을 예측한다. 단계적으로 살펴보면 아래와 같다. 첫째, k-NN(k-Nearest Neighbors) 기법으로 추천 대상 사용자와의 유사도가 높은 상위 5명의 사용자들로 이웃 집단을 구성한다. 둘째, 구성된 이웃집단 평점을 이용하여 사용자 예상 평점 계산은 수학식 1과 같다. RA,i는 아이템 i에 대한 사용자 A의 예상 평점이다. A는 사용자이고, j는 이웃 사용자이며, k는 이웃 사용자의 수이다. w(A,j)는 사용자 A와 사용자 j의 유사도이고, Rj,i는 아이템 i에 대한 사용자 j의 평점이다. \u0000 (bar)Rj는 사용자 j의 전체 평점 평균이고, (bar)RA는 사용자 A의 전체 평점 평균이다. 특정 사용자가 평가하 지 않은 원단이나 스타일에 대하여 상술한 수학식을 통하여 예상 평점을 예측할 수 있다. <성능 평가> 프로파일별 추천 성능을 평가하기 위해 추천 시스템 성능평가기법으로 주로 활용되는 절대평균오차(Mean Absolute Error, MAE)값을 이용할 수 있고, 이는 수학식 4와 같다. 수학식 4"}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "MAE는 큐레이팅 서비스에 대한 사용자의 실제 평점과 추천시스템의 예측 평점의 차이에 대한 절대 평균으로 추 천 성능을 평가하는 방식이다. MAE값이 작을수록 실제 평점과 예측 평점의 차이가 작고 예측의 정확성이 높다 고 볼 수 있다. n은 예측 아이템 수이고, yi은 아이템 예측 평점이고, xi은 아이템 실제 평점이다. 프로파일 별 추천 서비스 결과 MAE 값을 표현하는 경우, 예측 평점과 실제 평점간의 차이가 작을수록 추천 성능이 높다고 볼 수 있다. 세팅부는, 적어도 하나의 인공지능 알고리즘 중 정확도가 높은 인공지능 알고리즘을 선택하여 관리자 단말 에서 사용하는 인공지능 알고리즘으로 설정할 수 있다. 사용자 단말은, 인종, 직업군, 선호색상 및 피부톤을 포함하는 사용자 정보를 입력하고, 주문서를 수신하여 출력할 수 있다. 컨설턴트 단말은, 사용 자 정보를 전달받은 후, 사용자의 신체치수를 측정한 신체치수 데이터를 입력하고, 원단 재료, 브랜드, 색상 및 패턴을 선별하여 컨설팅 데이터로 업로드할 수 있다. 관리자 단말은, 컨설팅 데이터를 수신한 후 기 구축 된 인공지능 알고리즘에 의해 선택된 원단 리스트를 컨설턴트 단말로 전송하고, 원단 변경이 존재하는 경 우 주문서를 재작성하여 발주서를 출력할 수 있다. 업체관리부는, 적어도 하나의 원단업체 단말로부터 적어도 하나의 원단을 생산 또는 판매하는 원단업 체를 등록하여 원단업체풀(Pool)을 생성하고, 관리자 단말에서 발주서를 작성할 때 주문서 내 포함된 원단 을 공급하는 원단업체를 선정하여 발주서를 작성 및 전송하도록 한다. 할당부는, 적어도 하나의 원단업체 단말이 원단을 생산하는 공장의 단말인 경우, 각 공장별로 로딩 (Load)된 업무부하 및 스케줄을 파악하여 발주서의 원단 제작을 할당할 때 업무부하 및 스케줄에 기반하여 발주 서를 할당할 수 있다. 이때, 할당부는 예를 들어, 딥러닝 기반 다중 매칭을 이용할 수 있다. 의뢰인에게 최적의 생산 공장을 선정하는 과정은, 후보 지원 공장을 식별하는 Candidate Generation Model과, 후보 공장 중 적합성을 고려하여 지원 공장 순위를 매기는 Ranking Model로 크게 두 단계로 구성될 수 있다. 먼저 할당부 는, DB화된 공장 풀(Pool)을 탐색한다. 이때, 할당부는, 매칭을 위하여 후보 지원 공장을 선별하도 록 소프트맥스 함수를 이용해 분류(Classification)할 수 있다. 분류를 위해 사용된 훈련 데이터는 전체 의류 생산을 원하는 공장 풀을 기반으로 증가할 수 있다. 학습에 필요한 데이터 를 추출할 때 효과적인 학습을 위해 워드 임베딩에서 사용하는 네거티브 샘플링(Negative Sampling) 기법을 이용할 수 있으며, 대량의 트래픽으로 인한 학습 모델의 성능저하를 방지하기 위해 사용자마다 고정된 양의 샘플을 추출할 수 있다. 이렇게 공장 풀로 딥러닝을 이용하여 학습시키면 이 모델은 매트릭스 인수분해(Matrix Factorization) 부담으로 실제 적용이 어려운 User-User 협업 필터링을 간접적으로 구현할 수도 있다. 다음으로 후보 공장 리스트 가운 데 매칭 그룹을 결정할 수 있는 모델인 랭킹 모델(Ranking Model)을 학습시킨다. 랭킹 모델은, 후보 공장 중 원하는 후보 매칭 그룹을 생성하여 제공할 수 있는데, 각 공장의 특징 정보와, 보유기계, 공장인력의 수, 경력등의 제약 사항 정보를 랭킹 모델에 입력 데이터로 하여 딥러닝으로 학습하고, 학습한 랭킹 모델을 통해 추천 매칭 결과를 제공할 수 있도록 모델링할 수 있다. 또, 할당부는 각 공장의 생산관리 데이터에 기초하여, 기 설정된 주기, 빈도, 및 수량 미만의 작업할당량 을 가지는 공장을 자동으로 분류 및 추출하여 우선순위로 매칭시킬 수 있다. 일정관리는, 주어진 기간 내 프로 젝트를 완수시키기 위한 중요한 수단이다. 액티비티를 결정하고 선후행 관계를 정립하여 연결하는 것은 일정관 리의 가장 기본적인 단계인데, 스케줄링을 하더라도 작업할당량을 적절히 수주하지 못하여 일이 몰리거나 없는 상황이 발생할 수 있다. 이를 위하여, m 개의 공장에 n 개의 작업을 할당하는 할당문제는, 예를 들어, 헝가리 안 알고리즘(Hungarian Algorithm)을 이용할 수 있다. 이는, 할당문제를 Polynomial 시간에 해결할 수 있는 최적해 알고리즘인데, 다수의 작업과 기계가 존재하는 상황과, 각 작업을 특정 기계에서 수행하는 작업시간이나 비용이 다른 상황을 가정한다. 하나의 작업은 반드시 하나의 기계에서만 작업이 이루어진다는 가정하에, 처리 시간이나 비용의 총합이 최소가 되는 최적해를 구하도록, 각 작업들을 각 기계를 보유한 공장에 배정하는 문제 이다. 이를 할당 문제(Assignment Problem)라 하는데, 균형 할당 문제(Balanced Assignment Problem), 불균형 할당 문제(Unbalanced Assignment Problem)를 포함하므로, 할당문제는 균형과 불균형의 2가지 경우가 존재한다. 할 당 문제를 해결하는 방법으로, 헝가리안(Hungarian) 알고리즘이나, 유전자 알고리즘을 이용할 수 있지만, 불균 형 할당 문제에 대해서는 최적 해를 찾지 못할 가능성이 있기 때문에 비용이 모두 0인 가상의 행이나 열을 추가 하여 균형 할당문제로 변환시킬 수 있다. 물론, 상술한 방법 이외에도 다양한 공급사슬관리(Supply Chain Management) 알고리즘이 이용될 수 있으며, 나열된 것들로 한정되는 것은 아님은 자명하다 할 것이다. 통역부는, 사용자 단말 및 컨설턴트 단말의 언어가 관리자 단말의 언어와 서로 다른 경우, 서로 다른 언어 간 자동번역 서비스를 제공할 수 있다. 이때, 해외 수입, 무역, 패션 등의 전문분야의 용어는 서로 다를 수 밖에 없고, 동일한 객체를 지칭하는 단어라도 각 나라마다 서로 다른 용어를 쓰는 경우가 많다. 예를 들어, 바지의 경우 영국에서는 Trousers, 미국에서는 Pants, 운동화의 경우 영국에서는 Trainers, 미국에 서는 Sneakers, 조끼의 경우 영국에서는 Waistcoat, 미국에서는 Vest, 스웨터를 영국에서는 Jumper, 미국에서는 Sweater, 멜빵은 영국에서는 Braces, 미국에서는 Suspenders, 목을 덮는 옷을 영국에서는 Polo Neck, 미국에서 는 Turtle Neck, 겉옷 안에 입는 상의를 영국에서는 Vest, 미국에서는 Undershirt, 수영복을 영국에서는 Swimming Costume, 미국에서는 Bathing Suit 등 서로 사용하는 용어가 다르고, 전문적인 분야로 들어가게 되면 기계번역은 완전히 다른 용어로 번역할 가능성이 존재하므로, 각 나라별 서로 다른 용어를 매핑하여 정리하고, 정리한 데이터베이스 내에서 번역이 이루어지도록 할 수 있다. 또, 상호 간 용어의 불일치로 혼동이 없도록 이 미지를 함께 첨부하여 직관적으로 확인할 수 있도록 한다. 트래킹부는, 발주서가 출력되고 난 후, 사용자 단말에서 기재한 주소지가 국외인 경우, 발주서를 수 신한 원단업체 단말에서 국제배송을 신청하고 택배 수거, 택배 공항으로 이동, 국외도착, 수입신고, 통관 및 국외배송의 절차를 사용자 단말로 공유할 수 있다. 재학습부는, 사용자 단말의 인종, 직업군, 선호색상 및 피부톤을 포함한 사용자 정보와, 컨설턴트 단 말로부터 업로드받은 신체치수 데이터, 원단 재료, 브랜드, 색상 및 패턴을 데이터셋(DataSet)으로 생성한 후 인공지능 알고리즘을 지속적으로 재학습시킬 수 있다. 시각화부는, 각 사용자의 국가별, 인종별, 직업별 및 선호도별 선택되는 원단 재료, 브랜드, 색상 및 패턴 을 추출하여 시각화할 수 있다. 데이터베이스화부는, 각 국가별 수요를 파악하기 위해 각 국가별 원단 재료, 브랜드, 색상 및 패턴을 추출 하여 데이터베이스화할 수 있다. 오류검출부는, 원단 변경이 존재하는 피드백 데이터가 관리자 단말로 전송된 경우, 기 구축된 인공지 능 알고리즘에 의해 선택된 원단 리스트에 발생된 오류 부분 및 오류 원인을 파악하고, 파악된 오류 부분 및 오 류 원인을 빅데이터에 업데이트한 후, 오류의 패턴을 발견하고 분류를 통하여 오류율을 예측하기 위하여 딥러닝 을 실시하며, 딥러닝으로 도출된 데이터를 빅데이터로 반영할 수 있다. 이때, 오류 부분 및 오류 원인은 패션 전문가의 단말(미도시) 또는 관리자 단말에서 입력할 수 있다. VR제공부는, 사용자의 인종, 피부톤 및 신체치수로 3D 객체를 생성하고, 컨설턴트 단말에서 지정한 원단 및 스타일에 따라 가상으로 생성된 의상을 3D 객체와 합성하여 VR(Virtual Contents)로 제공할 수 있다. 이때, 3D 객체는 내국인을 대상으로 하는 경우에는 한국인 표준체형 빅데이터를 이용하여 다양한 체형의 3D 모델을 일단 표준으로 설정해두고, 이후 사용자의 신체치수가 수집되는 경우 표준 3D 모델을 변형하는 형태로 구 현하여 실시간성을 만족시킬 수 있다. 이때, 외국인을 대상으로 하는 경우에도, 각 국가의 국민 표준체형 빅데 이터를 이용하여 다양한 체형의 3D 모델을 각 국가별, 인종별, 나이별 등으로 설정해두고, 이후 사용자의 신체 치주사 수집되는 경우 표준 3D 모델을 변형하는 형태로 구현하여 실시간성을 만족시킬 수도 있다. 이렇게 만들 어진 3D 모델(아바타, 3D 객체)에 원단으로 만들어진 스타일의 옷을 시착하는 방법은 이하와 같다. <디지털 의상> 디지털 의복의 제작은 IT 기술의 발전과 더불어 가상의 캐릭터인 아바타(Avatar)와 디지털 의상의 물리적 충돌 에서 발생하는 디지털 의복의 폴리곤 변형 시뮬레이션 과정을 통하여 자연스러운 의복을 제작할 수 있다. 이는 디지털 형태의 의복에서 두께와 수축, 그리고 밀착감에 이르는 주름의 자연스러운 표현이 가능하게 되어 사실적 인 의상을 구현할 수 있다. 가상공간의 디지털 의상에서 기본적인 제작에 요구되는 네 가지의 구성요소는 의복 구조(Clothing Construction), 아바타, 시뮬레이션, 그리고 최종 렌더링으로 분류할 수 있다. 본 발명의 일 실 시예에서는 디지털 의상 구현 시 가상 의복 제작에 요구되는 원단 속성인 두께, 무게, 그리고 색상의 구성요소 를 중심으로 의복 제작 과정을 분석하고, Marvelous Designer에서 속성을 사전에 지정한 디지털 의복을 Unity3D 엔진으로 적용하는 방법을 이용할 수 있다. 두께감은 재질의 원단이 두꺼울수록 천의 처짐이 강해지고, 주름의 굴곡도가 크게 생성되는 반면 주름의 면 사 이 마찰력이 줄어들어 조밀도가 적어진다. 무게감은 재질이 무거울수록 밀도가 높아져 공기의 저항과 중력에 대한 영향을 덜 받기 때문에 작업 시 무게감을 조율하여 의상의 속성을 지정할 수 있다. 색상은 두께감과 무게 감의 속성들과 상호연관성이 적기 때문에 상황에 맞는 개별 색상의 조율을 통한 의복 자체의 디자인에 집중할 수 있다. 이하 표 1은 두께, 무게, 그리고 색상의 세가지 섬유 속성을 분석한 표이다. 표 1 속성 구성요소 설명 ThicknessStretch Relaxation of the slack Bend Bending strength for the turnaround Friction Deformation upon impact Weight WeightDensity Density of garment Air Drag Resistant strength weight Gravity Strain control on ground Color ColorPrimary Adjust primary color Reflection Reflectance value for light Opacity Control the transparency <상호작용>UI(User Interface)는 사용자 경험의 극대화를 위한 중간 매개체로 명확한 상호작용을 통한 효과적인 정보전달에 그 목적이 있다. 이에 본 발명의 일 실시예는, 상호작용의 효과적인 정보전달을 위하여 사용자가 디자인 된 버튼을 누르면 네 가지의 관련된 변화들이 실시간 VR 패션쇼에서 작동하도록 UI 디자인을 설계할 수 있다. 네 가지 구성 요소는 예를 들어, 카메라 시점, 의상, 이펙트, 그리고 배경 사운드의 변화를 상호작용 요 소로 사용할 수 있으나 이에 한정되는 것은 아니다. 카메라 시점의 변화는 HMD(Head Mounted Display)를 착용한 사용자가 가상공간 속 의상을 중심으로 시선의 방향 과 위치를 조작하는 기능으로, POV(Point of View) 버튼이 활성화되면 사용자는 실시간으로 자신을 아바타로 생 성한 3D 객체의 정면ㆍ측면ㆍ후면으로의 시점 변화를 체험할 수 있다. 이러한 변화는 향후 사용자 경험에서 재 미와 흥미를 모두 유발하여 몰입감에 영향을 줄 수 있다. 그러나 회전각도와 시점변화가 증가하면 사이버 멀미 나 흥미 요소에 부정적 평가를 예상할 수 있으므로, 의상의 변화는 VR 공간에서 디지털 의복이 새로운 의복으로 전환하는 기능으로, 세 종류의 디지털 의상을 사용자가 원하는 시점에 실시간으로 전환되도록 설계할 수 있다. 배경 이펙트의 변화는 가상 공간에서 조명의 밝기와 이펙트의 변화를 연출하는 기능으로, 사용자는 실시간 VR 공간의 조명의 색상과 파티클을 통한 효과 이펙트를 변경할 수 있다. 가상의 공간에서 조명과 이펙트를 변화시 키는 기능은 단기간 재미를 증가할 것으로 예상하지만, 기능의 반복적 사용은 흥미 및 몰입감을 저하시킬 가능 성이 있다. 마지막 사운드의 변화는 VR 공간에서 연출된 배경음으로 나오는 사운드를 변경하는 기능으로, 사용 자는 준비된 세 가지의 배경음 중 하나를 선택하고 변환할 수 있다. 이러한 배경 사운드의 변화 역시 단기간재미를 증가시킬 요소로 예상 가능하지만, 반복적 사용은 사용자의 흥미와 몰입감을 저하시킬 가능성이 있다. <디지털 의상 제작> 상호작용(Interactive) 시착 서비스에서 디지털 의상의 제작 과정은 위에서 제시된 의복의 섬유 속성을 활용하 여 디지털 의복을 제작하는 다섯 가지 단계별 파이프라인의 진행과정이다. 이 과정에서 VR 엔진에 적용하기 전"}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "에 디지털 의복 데이터를 확보하는 핵심 과정이다. 표 2는 5 단계를 요약한 도표로 단계별 제작과정에서 완성 된 결과물 이미지들을 통하여 본 발명의 일 실시예의 VR에 적용될 3D 디지털 의상의 제작과정을 설명한다. 표 2 Level Description % 1 Pattern 20 Pattern creation process for the digital clothing 2 Modeling 40 Digital modeling process based on the virtual Avatar 3 Shading 60 Digital shading process based on the lighting 4 Texturing 80 Digital texturing process based on the concept 5 Posing 100 Final posing process for simulation 첫 번째 단계는 이미지 컨설턴트가 추천한 스타일 의상의 컨셉을 중심으로, 이미지 컨설턴트 또는 인공지능 알 고리즘이 추천한 원단을 가상 원단의 패턴으로 제작하는 과정이다. 이 과정에서는 가상 의상의 두께, 무게, 색 상은 지정하지 않으며, 의상 원단의 패턴제작 프로세스를 진행한다. 이 프로세스는 전체 제작 공정의 20% 진행 과정으로 원단 조각들을 이면도의 작업창에서 조율하고 상의와 하의의 위치 및 크기를 조절한다. 두 번째 단계 는 앞서 제작한 원단을 삼차원 가상의 모델(3D 객체)에 배치하여 최종 가상 의복의 모델링 단계를 제작하는 과 정이다. 이 과정에서는 가상 의상의 두께 및 무게를 소프트웨어의 조절 기능을 통하여 원단의 성격에 맞추어 조율한다. 이 프로세스는 전체 제작 공정의 40% 진행과정으로 가상의복이 아바타 모델의 체형에 맞춘 착용을 통하여 자연스러운 피팅(Fitting)을 완성한다.세 번째 단계는 피팅을 통한 기본적인 의복의 모델을 중심으로 상 의 및 하의 원단의 색상 변화와 투명도를 조절하는 쉐이딩(Shading) 과정이다. 이 과정에서는 디지털 의복의 기본 색상 조율을 통한 60% 진행과정으로 의상의 속감과 겉감의 레이어(Layer)를 통하여 의복 재질의 주름 형태, 투명도 조절, 그리고 재질별 원단 속성의 다양한 색상 표현을 조율한다. 네 번째 단계는 기본적 색상이 완성된 가상 의복에 세부적인 2D 문양을 적용하는 텍스쳐링(Texturing) 과정이다. 이 과정에서는 디지털 의복 의 질감 텍스타일 문양의 세부 디자인 조절을 통한 80% 진행과정으로 의상의 로고 및 재질에 적용 가능한 이미 지를 추가하는 작업을 진행한다. 더불어 디지털 의상에 적용하는 이미지들의 돌발적 변형을 최소화하기 위하여 원단의 무게감 조율이 요구되는 과정이다. 다섯 번째 단계는 앞서 완성된 디지털 의상을 중심으로 최종 아바타 모델의 시뮬레이션을 통하여 포징(Posing) 단계로의 의복형태를 검증하는 과정이다. 이 과정에서는 VR 엔진으로 이식을 위하여 애니메이션에 상응하는 디 지털 의상의 구부러짐과 굴절, 그리고 빛의 반사과정을 테스트하여 예상 가능한 문제점들을 사전에 보완하는 마 무리 단계이다. <상호작용 VR 공> 가상현실 속에서 긍정적인 사용자 경험을 위하여 속도(Speed), 범위(Range), 그리고 매핑(Mapping)의 기술적 설 계가 요구된다. 이에 본 발명의 일 실시예에서는 선행 연구에서 Interactive VR에 VR 엔진을 적용하여 구현할 수 있다. 속도는 가상세계로 부터의 상호작용 응답(Feedback) 시간으로, 가상의 공간에서 최대한 신속하게 사 용자의 반응에 응답함으로 사실성을 높여서 몰입감을 향상시킨다. 또한 가상공간에서 데이터의 업로딩 속도를 최적화하여 사용자에게 긍정적 경험을 제공할 수 있다. 범위는 UI 디자인과 인터랙션 요소들이 HMD 화면에서 VR 주 매체와 적절한 범위에 UI 데이터가 노출되어야 실시간 렌더링을 통한 가상세계가 사용자의 경험에 흥미와 재미를 극대화 할 수 있다. 매핑의 경우 전체적인 HMD 화면 자체의 회전 각도를 통한 시각 요소들의 표현을 조 절하여 제한된 회전을 중심으로 사용자가 전개되는 스토리텔링에 집중케 하여 사용자 경험에 긍정적인 몰입감을 제공할 수 있다. 이상적인 사용자 경험을 증가시키기 위하여 Interactive VR 공간에서 설정되어야 하는 요소들은, 속도, 범위, 그리고 매핑이다. 적용단계 비중을 속도, 범위, 그리고 매핑을 중심으로 Unity3D 게임 엔진 시스템에 적용하는 제작할 수 있다. <Unity3D 게임 엔진> 본 발명의 일 실시예는 Interactive VR 시착 서비스를 위하여 Interactive VR 공간 설계에서 서술한 속도, 범위, 매핑의 세 가지 적용 요소들을 중심으로, Unity3D 게임 엔진에 적용되어질 디지털 데이터의 포맷 변환을 3D 모델, 애니메이션, 2D UI 디자인, 그리고 시뮬레이션 과정에 맞추어 분석할 수 있다. 표 3에서 3D 모델의 적용과정은 3D 소프트웨어를 활용하여 생산된 데이터의 효과적인 변환을 통하여 VR 엔진으로 이식하는 과정이 필요하다. 본 발명의 일 실시예에서 사용하는 추출포맷은 OBJ(Object)이다. 이 포맷을 통하여 VR 구현과정에 효과적인 속도와 범위의 기술적 설계의 최적화는 렌더링 속도의 상승 및 UI 디자인으로 변환 가능한 모델에 유 리한 포맷으로, VR 공간 설계에 긍정적 효과를 기대할 수 있다. 표 3 Format (Extension) Description 3D Model (OBJ) Optimization of technical design of speed in VR space Animation (FBX) Motion capture technology is used to design fitting room 2D UI Image (PNG)Express 2D data in VR space to apply visual icons Simulation (ABC) Optimization of real time process of costume sequence 애니메이션 적용과정은 사용자 단말의 보행 패턴을 지자기 센서, 가속도 센서 등을 이용하여 적용할 수 있 다. 워킹 사이클 동작을 모션캡쳐 기술을 활용하여 효과적으로 적용할 수도 있다. 디지털 아바타 모델의 관절 과 근육의 미세한 움직임을 수작업으로 구현하는 과정에서 발생하는 비효율적 과정을 보완하는 방법으로, 모션 캡쳐를 통하여 사용자의 신체에 모션센서를 부착하여 동작을 디지털 데이터로 변환할 수동 있다. 이를 위한 추 출포맷은 FBX(Filmbox)로 엔진으로 전환하는 과정에서 최적화가 가능하기 때문에 VR 공간 설계에 요구되는 구현 과정에서속도 향상이 기대된다. 더불어 보행을 시작하고 마치는 특정지역을 설정하여, HMD 회전각도인 매핑설 계를 중심으로 기획할 수도 있다.2D UI 이미지의 적용과정은 2D 소프트웨어를 활용하여 생산된 데이터들을 VR 공간에서 표현하는 시각적 아이콘과 의상의 텍스쳐에 적용하기 위하여 그래픽 파일은 PNG(Portable Network Graphic) 포맷으로 변환한다. 이는 알파 채널을 통한 투명도 조절에 유용하며 데이터의 용량이 다른 이미지 포 맷보다 작기 때문에 엔진의 구현과정 중속도와 범위의 요소를 중심으로 VR 설계를 진행할 수 있다. 시뮬레이션 의 적용과정은 디지털 의상 제작 소프트웨어 Marvelous Designer를 활용하여 연속성을 가진 의상 데이터의 결과 물을 ABC(Alembic)포맷으로 변환한다. 이 경우에 시뮬레이션 데이터는 변환과정에서 의상변화 데이터의 최적화 를 통한 속도의 향상과 HMD 화면각도에서 패션 의상의 공간 지정을 통한 매핑 요소의 조율을 중심으로 VR 화면 을 기획한다. 이하, 상술한 도 2의 큐레이팅 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설명하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하 다 할 것이다. 도 3을 참조하면, (a) 큐레이팅 서비스 제공 서버는 적어도 하나의 원단업체 단말로부터 원단업체가 생산공장인지 또는 판매업체인지, 생산공장이라면 원단제작기계는 어떠한 것이 있고 어떠한 원단을 제작가능한 지, 현재 발주된 물량은 어느 정도이며 어디까지 생산을 해냈는지, 판매업체라면 어떠한 원단을 취급하고 재고 는 얼마인지 등을 수집하여 원단업체풀(Pool)을 구축한다. 그리고, (b) 큐레이팅 서비스 제공 서버는 [인 종, 직업군, 선호색상, 피부톤, 신체사이즈]인 A와, [원단 재료, 브랜드, 색상, 패턴]인 B를 매핑하여 데이터셋 을 생성한 후 (c) 적어도 하나의 인공지능 알고리즘으로 A를 입력하면 B가 나오도록 학습 및 테스트를 진행한다. 적어도 하나의 인공지능 알고리즘으로 정확도가 가장 높은 인공지능 알고리즘을 선택하는데, 본 발 명의 인공지능 알고리즘은, 머신러닝, 인공지능 및 딥러닝을 모두 포함하는 것으로 정의한다. 실제로는 머신러 닝>인공지능>딥러닝과 같은 포함관계가 성립하나 본 발명은 각 카테고리를 모두 포함하는 개념으로 정의하기로 한다. (d) 큐레이팅 서비스 제공 서버는 이렇게 정확도가 가장 높은 인공지능 알고리즘이 관리자 단말에서 구동되도록 세팅하고, 관리자의 권한을 설정하며 해외 각 바이어인 컨설턴트 단말로부터 수신된 주문서를 검토하고, 인공지능 알고리즘으로 출력된 결과와 비교하여 추천 원단 리스트를 생성하여 주문서를 재검토할 것인지에 대한 피드백을 받을 수 있다. 이 과정은 도 4a 내지 도 4b에 시각화되어 있다. 이와 같은 도 2 내지 도 4의 B2B 기반 비대면 패션 큐레이팅 서비스 제공 방법에 대해서 설명되지 아니한 사항 은 앞서 도 1을 통해 B2B 기반 비대면 패션 큐레이팅 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설 명된 내용으로부터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템에 포함된 각 구 성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터 가 송수신되는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설"}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "명한 다양한 실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 큐레이팅 서비스 제공 서버는, 적어도 하나의 인종, 직업군, 선호색상, 피부톤, 신체치수, 원 단 재료, 브랜드, 색상 및 패턴을 매핑하여 빅데이터를 구축한다(S5100). 큐레이팅 서비스 제공 서버는, 인종, 직업군, 선호색상, 피부톤 및 신체치수가 질의(Query)로 입력되면, 원단 재료, 브랜드, 색상 및 패턴이 결과로 출력되도록 적어도 하나의 인공지능 알고리즘을 모델링한다(S5200). 그리고, 큐레이팅 서비스 제공 서버는, 적어도 하나의 인공지능 알고리즘 중 정확도가 높은 인공지능 알고리즘 을 선택하여 관리자 단말에서 사용하는 인공지능 알고리즘으로 설정한다(S5300). 상술한 단계들(S5100~S5300)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5300)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 B2B 기반 비대면 패션 큐레이팅 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4를 통해 B2B 기반 비대면 패션 큐레이팅 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명 된 내용으로부터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 B2B 기반 비대면 패션 큐레이팅 서비스 제공 방법은, 컴퓨터에 의해 실행 되는 애플리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로 도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 B2B 기반 비대면 패션 큐레이팅 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 B2B 기반 비대면 패션 큐레이팅 서비 스 제공 방법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2021-0155139", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.도면 도면1 도면2 도면3 도면4a 도면4b 도면5"}
{"patent_id": "10-2021-0155139", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 B2B 기반 비대면 패션 큐레이팅 서비스 제공 시스템을 설명하기 위한 도면 이다. 도 2는 도 1의 시스템에 포함된 큐레이팅 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 B2B 기반 비대면 패션 큐레이팅 서비스가 구현된 일 실시예를 설명 하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 B2B 기반 비대면 패션 큐레이팅 서비스 제공 방법을 설명하기 위한 동작 흐 름도이다."}
