{"patent_id": "10-2022-0091812", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0014270", "출원번호": "10-2022-0091812", "발명의 명칭": "합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템", "출원인": "배민효", "발명자": "배민효"}}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "소정의 명령에 따른 전사적 데이터 처리를 위한 단위 컨트랙트 시스템에 있어서, 소정의 파라미터(parameter)가 입력되고, 요구되는 데이터의 내용과 형식에 따라 결과 값이 출력되는 컨트랙트모델 유닛을 포함하는 것을 특징으로 하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 컨트랙트 모델 유닛은, 상기 단위 컨트랙트를 구성하는 구성 데이터의 집합으로 형성되는 세트 스테이트부를 포함하는 것을 특징으로하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 컨트랙트 모델 유닛은,입력되는 상기 소정의 파라미터를 상기 세트 스테이트부의 원소 데이터(elemental data)로 변환하는 잇풋 트랜잭션부; 및상기 구성 데이터의 연산을 통해 상기 구성 데이터의 집합에 대한 상태를 변환하는 스테이트 트랜잭션부를 포함하는 것을 특징으로 하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 컨트랙트 모델 유닛은,상기 요구되는 데이터의 내용과 형식에 따라 결과 값을 출력하는 아웃풋 트랜잭션부를 더 포함하는 것을 특징으로 하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 시스템은, 상기 소정의 명령에 대하여 상기 인풋 트랜잭션부, 상기 스테이트 트랜잭션부, 상기 아웃풋 트랜잭션부의 연속적인 작업을 통하여 상기 소정의 명령에 대한 오퍼레이션을 수행하는 것을 특징으로 하는, 합의 그룹의 공유를통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서, 상기 세트 스테이트부는,상기 인풋 트랜잭션부터 변환된 상기 원소 데이터를 수신받으며, 상기 스테이트 트랜잭션부를 통해 상기 구성데이터의 집합에 대한 상태가 변환되고, 상기 아웃풋 트랜잭션부를 통해 변경된 상기 구성 데이터를 결과 값으공개특허 10-2024-0014270-3-로 출력하도록 설정하는 것을 특징으로 하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 시스템은, 상기 소정의 파라미터(parameter)가 입력되는 입력부; 및 상기 결과 값을 출력하는 출력부를 포함하는 것을 특징으로 하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서, 상기 아웃풋 트랜잭션부는,요구되는 데이터의 내용과 형식에 따라 오퍼레이션 수행결과의 성공 여부 또는 변화된 구성 데이터의 집합 정보중 어느 하나에 대하여 출력 값으로 설정할 수 있는 것을 특징으로 하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 시스템은, 미리 설정된 바운더리 내 존재하는 복수 개의 노드에 상기 컨트랙트 모델 유닛의 트랜잭션 정보가 상호 공유되도록 하는 복수 개의 노드 유닛을 포함하는 것을 특징으로 하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 복수 개의 노드 유닛은, 상기 복수 개의 노드 각각이 상기 단위 컨트랙트 유닛과 상기 트랜잭션 정보를 상호 매칭 비교하여 상기 단위컨트랙트와 상기 트랜잭션 정보가 상호 매칭되는지 확인하는 것을 특징으로 하는, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템."}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 소정의 명령에 따른 전사적 데이터 처리를 위한 단위 컨트랙트 시스템에 있어서, 소정의 파라미터 (parameter)가 입력되고, 요구되는 데이터의 내용과 형식에 따라 결과 값이 출력되는 컨트랙트 모델 유닛 (contract model unit)을 포함하는 기술적 사상을 개시한다."}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원 발명은 단위 컨트랙트 시스템에 대한 컨트랙트가 수행되도록 하는 모델의 시스템에 관한 것으로서, 보다 구체적으로는 기본 모델로서 모델 내에 입력변환 함수, 상태변환 함수, 출력함수와 모델의 상태를 나타내는 데 이터의 집합로 구성되는 것으로, 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트"}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "랙트 시스템에 관한 기술분야이다."}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 컨트랙트라는 개념의 경우, 1996년 닉 자보(Nick Szabo)에 의해 탄생했지만, 스마트 컨트랙트라는 용어 및 개념이 널리 알려지게 된 계기는 이더리움(Ethereum)이라 할 수 있다. 이더리움은 2015년 네트워크가 가동을 시작한 이후 매우 안정적으로 블록체인 네트워크가 운영되고 있다. 이더 리움의 스마트 컨트랙트는 솔리디티라는 언어를 사용하여 개발되는데, 솔리디티 언어는 1) 오버플로 및 언더플 로 문제, 2) 메시지 호출과 접근 권한 제어 문제, 3) 리엔트런시 문제, 4) 짧은 주소 공격, 5) 잔액 조건 무효 화 공격, 6) 도스 공격과 같은 취약점을 가지고 있다. 스마트 컨트랙트에 대한 취약점은 취약점으로 끝나는 것이 아니라, 작게는 수억에서 많게는 수천억 규모의 실제 해킹 사건으로 이어진다. 이러한 스마트 컨트랙트의 문제는 데이터의 위변조가 불가능하고 디지털 자산의 고유성과 소유권과 자산가치를 보장해 준다는 블록체인의 이상과 목표를, 다른 무엇도 아닌, 블록체인을 다양한 용도로 활용하기 위한 목적으 로 만들어진 '스마트 컨트랙트'가 파괴하고 있다는 심각한 문제점이 있다. 스마트 컨트랙트의 성능 및 안정성을 보완하기 위한 선행 특허문헌으로 예컨대, 조건이 만족되면, 계약이 수행 되는 스마트 컨트랙트에서 사용자의 피드백에 기초하여 컨트랙트의 조건과 동작을 변경하기 위한 컨트랙트를 제 공하는 선행 특허문헌으로는, \"지능형 스마트 컨트랙트 제공방법(공개번호 제10-2021-0056745호, 이하 특허문헌 1이라 한다.)가 존재한다. 특허문헌 1의 경우, 공유자원을 이용한 서비스를 블록체인 네트워크를 통해 제공하기 위하여 필요한 하나 이상 의 스마트 컨트랙트를 포함하는 시나리오에 기초하여 서비스를 제공하는 서비스 제공단계, 사용자 단말 또는 관 리자 단말이 시나리오를 편집하는 피드백을 제공하는 피드백단계, 피드백에 기초하여 시나리오에 포함된 하나 이상의 스마트 컨트랙트의 내용을 변경하는 인공지능 학습모델을 학습시키는 학습단계, 및 인공지능 학습모델이 시나리오에 포함된 하나 이상의 스마트 컨트랙트의 내용을 변경하는 시나리오 수정단계를 포함하는, 지능형 스 마트 컨트랙트 제공방법을 제공함에 따라 스마트 컨트랙트의 조건과 동작을 변경할 수 있어서 다양한 종류의 공 유자원을 공유서비스에 제공하기 위하여 필요한 다양한 조건의 스마트 컨트랙트를 생성하고 이용할 수 있다. 신뢰성 있는 스마트 컨트랙트의 정보를 제공하기 위한 방법으로, 시드의 유출 없이 신뢰성 있는 난수를 생성하 여 정확한 난수의 생성을 통해 스마트 컨트랙트의 신뢰성을 제공하고자 하는 것으로, \"스마트 컨트랙트에서의 난수 생성 방법 및 장치(공개번호 제10-2021-0094866호, 이하 특허문헌2라 한다.)가 존재한다. 특허문헌 2의 경우, 스마트 컨트랙트에서의 유사 난수 생성 방법 및 장치가 제공된다. 난수 생성 장치는, 난수 생성을 위한 시드(seed) 데이터를 포함하는 제1 매개 변수를 수신하고, 또한 제2 매개 변수를 수신한다. 그리고 제1 매개 변수 및 제2 매개 변수가 설정된 순서대로 수신된 경우, 시드 데이터를 이용하여 난수를 생성한다. 블록체인 상에서 스마트 컨트랙트를 구현하기 위한 방법 및 시스템의 선행문헌으로는 \"개선된 블록체인-구현된 스마트 컨트랙트를 위한 방법 및 시스템(공개번호 제10-2021-0090611호, 이하 특허문헌 3이라 한다.)가 존재한 다. 특허문헌 3의 경우, 적어도 하나의 일차 블록을 가지는 블록체인 내에 스마트 컨트랙트를 저장하는 단계를 포함 한다. 스마트 컨트랙트는 적어도 하나의 충족 값으로 각각 정의되는 전자적으로 정의된 컨트랙트 조항들의 세트 를 가지고, 컨트랙트 조항들의 세트의 충족 값들의 조합은 컨트랙트에 대한 충족 해시 값을 가진다. 하나 이상 의 실행 값들의 서브셋을 각각 가지는 하나 이상의 전자적으로 저장된 이차 트랜잭션들의 세트는 판독되고 컨트 랙트 조항들에 대응하는 트랜잭션들의 서브셋은 선택된다. 트랜잭션의 서브셋의 실행 값들의 조합의 실행 해시 값은 결정된다. 스마트 컨트랙트는, 트랜잭션들의 서브셋의 실행 값들의 조합의 실행 해시 값이 스마트 컨트랙 트의 충족 해시 값에 매칭하면, 완전히 실행된 것으로 고려된다. 종래의 스마트 컨트랙트의 경우, 예컨대, 이더리움이 제시한 VM(virtual Machine) 구조의 경우, 해킹 등의 보안 위협으로부터 안전을 보장받을 수 없다는 위험에 노출되어 있다. 이에 따라, 종래의 보안성과 안정성의 문제에 대하여 안전을 보장받을 수 있는 새로운 스마트 컨트랙트에 대한 요구가 필요시되고 있는 실정이며, 본원 발명의 경우, 스마트 컨트랙트에 대한 문제점을 해결하기 위하여 모델 기반 개발 방법론을 통해 안정적으로 신뢰성 있는 스마트 컨트랙트를 제공하고자 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개번호 제10-2021-0056745호 (특허문헌 0002) 공개번호 제10-2021-0094866호 (특허문헌 0003) 공개번호 제10-2021-0090611호"}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 상 기한 바와 같은 종래 문제점을 해결하기 위해 안출된 것으로서, 다음과 같은 해결하고자 하는 과제를 제시한다. 첫째, 해킹 등의 보안 위협으로부터 안전을 보장받을 수 있는 스마트 컨트랙트가 제공될 수 있도록 한다. 둘째, 모델 기반의 스마트 컨트랙트 시스템을 제공함을 통해 높은 신뢰성, 강화된 보안성, 빠른 처리 성능이 제 공될 수 있도록 한다. 셋째, 모델 명세에 따라 자신이 선호하는 프로그래밍 언어를 사용하여 컨트랙트 모델을 구현하여, 반드시 특정 언어를 사용해야만 하는 기존의 컨트랙트와 차별되는 특징을 제공하도록 한다. 본 발명의 해결 과제는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 해결과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 상 기의 해결하고자 하는 과제를 위하여 다음과 같은 과제 해결 수단을 가진다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 소 정의 명령에 따른 전사적 데이터 처리를 위한 단위 컨트랙트 시스템에 있어서, 소정의 파라미터(parameter)가 입력되고, 요구되는 데이터의 내용과 형식에 따라 결과 값이 출력되는 컨트랙트 모델 유닛(contract model unit)을 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 상 기 컨트랙트 모델 유닛은, 상기 단위 컨트랙트를 구성하는 구성 데이터의 집합으로 형성되는 세트 스테이트(set state)부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 상 기 컨트랙트 모델 유닛은, 입력되는 상기 소정의 파라미터를 상기 세트 스테이트부의 원소 데이터(elemental data)로 변환하는 잇풋 트랜잭션(input transaction)부; 및 상기 구성 데이터의 연산을 통해 상기 구성 데이터 의 집합에 대한 상태를 변환하는 스테이트 트랜잭션(state transaction)부를 포함하는 것을 특징으로 할 수 있 다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 상 기 컨트랙트 모델 유닛은, 상기 요구되는 데이터의 내용과 형식에 따라 결과 값을 출력하는 아웃풋 트랜잭션 (output transaction)부를 더 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 상 기 소정의 명령에 대하여 상기 인풋 트랜잭션부, 상기 스테이트 트랜잭션부, 상기 아웃풋 트랜잭션부의 연속적 인 작업을 통하여 상기 소정의 명령에 대한 오퍼레이션(operation)을 수행하는 것을 특징으로 할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 상 기 세트 스테이트부는, 상기 인풋 트랜잭션부터 변환된 상기 원소 데이터를 수신받으며, 상기 스테이트 트랜잭 션부를 통해 상기 구성 데이터의 집합에 대한 상태가 변환되고, 상기 아웃풋 트랜잭션부를 통해 변경된 상기 구 성 데이터를 결과 값으로 출력하도록 설정하는 것을 특징으로 할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 상 기 소정의 파라미터가 입력되는 입력부; 및 상기 결과 값을 출력하는 출력부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 상 기 아웃풋 트랜잭션부는, 요구되는 데이터의 내용과 형식에 따라 오퍼레이션 수행결과의 성공 여부 또는 변화된 구성 데이터의 집합 정보 중 어느 하나에 대하여 출력 값으로 설정하는 것을 특징으로 할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 미 리 설정된 바운더리 내 존재하는 복수 개의 노드에 상기 컨트랙트 모델 유닛의 트랜잭션 정보가 상호 공유되도 록 하는 복수 개의 노드 유닛을 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 상 기 복수 개의 노드 유닛은, 상기 복수 개의 노드 각각이 상기 단위 컨트랙트 유닛과 상기 트랜잭션 정보를 상호 매칭 비교하여 상기 단위 컨트랙트와 상기 트랜잭션 정보가 상호 매칭되는지 확인하는 것을 특징으로 할 수 있 다."}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 구성의 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템은 다음과 같은 효과를 제공한다. 첫째, 여섯개의 구성 요소를 정의함으로 프로그래밍 언어에 종속되지 않는 단위 컨트랙트 모델이 개발되어질 수 있도록 한다. 둘째, 단위 컨트랙트 모델의 하드웨어를 통한 직접 수행으로 하드웨어의 성능을 그래도 활용할 수 있도록 한다. 셋째, 단위 컨트랙트 모델에 대하여 복수 개의 노드 간의 합의 및 검증을 통하여 단위 컨트랙트 모델이 배포될 수 있도록 한다."}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0091812", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 다 양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들을 도면에 예시하고 상세한 설명 에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 기술적 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한 다. 도 1은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템에 대한 예시적인 개념도이다. 도 2는 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트 랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템에서 컨트랙트 모델 유닛과 컨트랙트 모델 유닛이 포 함하는 집합과 함수에 대한 컨트랙트 모델을 도시한 것이다. 도 3은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템에서 컨트랙트 모델 유닛 내에 포함 되는 인풋 트랜잭션부, 세트 스테이트부, 아웃풋 트랜잭션부, 스테이트 트랜잭션부를 포함하는 컨트랙트 모델을 도시한 것이다. 도 4는 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템 중 세트 스테이트부의 모델을 구성하는 데이터의 집합을 도시한 것이다. 도 5는 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템 중 인풋 트랜잭션부를 통해 수행된 입력 데이터에 대한 결과가 세트 스테이트부에 결과로 제공된 것을 도시한 것이다. 도 6은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템 중 스테이트 트랜잭션부를 통해 수행된 결과가 세트 스테이트부에 결과로 제공 된 것을 도시한 것이다. 도 7은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템 중 복수 개의 노드 유닛의 각각의 노드를 도시한 것이다. 도 8은 본 발 명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스 템 중 컨트랙트 모델 유닛이 복수 개의 노드 유닛에 공유되어 각각의 노드들에 의해 검증 및 합의 과정을 거치 는 것을 도시한 것이다. 본 발명의 경우, 프로토콘(Protocon)의 컨트랙트 모델(contract model)에 관한 것으로, 여기서 프로토콘이라 함 은, 프로토콜 기반으로 스스로 운영되는 디지털 경제를 구축하는 것을 목표로 하는 블록체인 프로젝트를 가르킨 다. 프로토콘은 PBFT알고리즘과 스마트 컨트랙트를 새롭게 정의한 미텀(Mitum)을 기반으로 한다. 종래의 스마트 컨트랙트의 경우, 코드를 통하여 스스로 실행되도록 하는 전산화된 거래 약속에 대한 것이며, 본 원 발명의 컨트랙트 모델의 경우, 종래의 스마트 컨트랙트의 모든 기능을 수용하면서 동시에 단점을 보완한 새 로운 컨트랙트 모델에 해당한다. 컨트랙트 모델은 블록체인에 연동되는 수많은 응용 시스템과 응용 서비스의 신뢰성(reliability)과 보안성 (security)을 보장하는 기반이 될 수 있다. 또한, 프로그램 언어 기반의 종래의 스마트 컨트랙트와는 달리 성능 과 블록체인 사용 비용 측면, 개발 효율성 측면, 보안성 측면에서 우수성을 제공할 수 있다. 모델 기반의 개발 방법론(Model-based Development 혹은 Model-based systems engineering)의 경우, 높은 복잡 도를 가지면서 높은 신뢰성과 보안성을 요구하는 시스템(예컨대, 항공기, 군사무기 등)을 개발할 때 주로 적용 하는 방법론에 해당하는 것으로, 본원 발명의 모델 기반의 컨트랙트 모델 유닛의 경우, 종래의 해킹 등의 보안 위협에 대한 스마트 컨트랙트에 대하여 뛰어난 신뢰성과 보안성을 제공할 수 있는 것이다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 경 우, 소정의 명령에 따른 전사적 데이터 처리를 위한 단위 컨트랙트 시스템에 관한 것으로, 컨트랙트 모델 유닛 (contract model unit, 100)을 포함할 수 있다. 컨트랙트 모델 유닛의 경우, 더 이상 쪼갤 수 없는 기본 모델에 해당한다. 도 2에 도시된 바와 같이, 컨트랙트 모델 유닛의 경우, 3개의 함수가 포함될 수 있는데, 3개의 함수의 경 우, 입력변환 함수(input transform function, λ), 상태변이 함수(state transition function, δ), 출력 함 수(output transform function, μ)로 구성될 수 있다. 입력변환 함수(input transform function, λ)의 경우, X(a set of inputs)→S(a set of states)로 입력된 데 이터를 상태집합의 원소로 변환한다. 상태변이 함수(state transition function, δ)의 경우, S(a set of states)→S(a set of states)로 상태 데이 터에 대한 연산을 통해 상태를 바꾸는 연산을 수행하게 된다. 출력 함수(output transform function, μ)의 경우, S(a set of states)→Y(a set of outputs)로 상태 데이터 에서 요구되는 데이터 내용과 형식에 따라 값을 출력해 주는 함수에 해당한다. 전사적이라 함은, 금융 등 광의적 개념의 모든 자원을 다루겠다는 것으로, 금융자원에 대한 데이터의 처리뿐만 아니라, 넓은 의미로의 자원을 의미할 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 컨 트랙트 모델 유닛의 경우, 컨트랙트 모델 유닛을 구성하는 구성 데이터의 집합으로 형성되는 세트 스 테이트(set state)부(S, 120)를 포함한다. 도 2에 도시된 바와 같이, 컨트랙트 모델 유닛 내에 세트 스테이트부가 제공되는 것으로, 세트 스테 이트부는 데이터의 집합으로 구성되어진다. 세트 스테이트부는 데이터의 집합으로서 컨트랙트 모델 유닛에 대한 모델(model)의 상태를 나타낼 수 있는데, 모델의 상태의 경우, 모델을 구성하는 데이터의 집합을 의미한다. 예컨대, 컨트랙트 모델 유닛이 블록체인 상에서 어카운트(account)간 토큰을 전송하는 오퍼레이션을 수행 하는 경우, 세트 스테이트부의 경우, 도 4에 도시된 바와 같이, 생성된 토큰을 보유하고 있는 어카운트와 토큰의 개수(Token account)를 쌍으로 하는 데이터의 집합에 해당할 수 있다. 데이터의 집합은 컨트랙트 모델 유닛의 상태(예컨대, 어카운트와 생성된 토큰의 개수 및 토큰의 보유 수) 를 나타낼 수 있는 것이다. 도 4에 대한 예시는 단위 컨트랙트 모델의 구조와 동작의 이해를 돕기 위한 것으로서, 미텀 커런시(Mitum currency)모델을 예시로 들어 도시하고 설명한 것이다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 컨 트랙트 모델 유닛의 경우, 인풋 트랜잭션부, 스테이트 트랜잭션부를 포함하는 구성이다. 인풋 트랜잭션부는 입력되는 소정의 파라미터를 세트 스테이트부의 원소 데이터로 변환한다 스테이트 트랜잭션부는 구성 데이터의 연산을 통하여 구성 데이터의 집합에 대한 상태를 변환하도록 한다. 인풋 트랜잭션부는 입력변환 함수(input transform function, λ)에 해당할 수 있다. 스테이트 트랜잭션부의 경우, 상태변이 함수(state transition function, δ)에 해당할 수 있다. 원소 데이터의 경우, 입력된 데이터(파라미터)가 상태집합의 원소로 변환되는 것으로, 집합을 이루는 요소로 변 환되는 것에 해당할 수 있다. 도 5에 도시된 바와 같이, 예컨대, 어카운트 0xa374에서 어카운트0xb28d로 25의 토큰을 전송하는 경우, 인풋 트 랜잭션부에 입력되는 입력 데이터는 다음과 같이 입력되어질 수 있다. x = (0xa374, 0xa28d, 25) ∈ X 입력된 입력 데이터에 따라, 인풋 트랜잭션부의 입력변환 함수의 수행결과는 도 5와 같이 세트 스테이트부 의 Difference를 통하여 모델을 구성하는 데이터의 집합으로 나타날 수 있다. 아울러, 스테이트 트랜잭션부를 통하여 상태가 변환되고, 세트 스테이트부의 경우, 도 6에 도시된 바 와 같이, 변화된 어카운트(account)에 대한 상태 집합을 나타낼 수 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 컨 트랙트 모델 유닛은, 요구되는 데이터의 내용과 형식에 따라 결과 값을 출력하는 아웃풋 트랜잭션부 를 포함한다. 아웃풋 트랜잭션부의 경우, 요구에 따라 오퍼레이션의 수행결과의 성공 여부 또는 변화된 어카운트의 토큰 카운트 등을 출력데이터로 정할 수 있다. 아웃풋 트랜잭션부는 출력 함수(output transform function, μ)에 해당할 수 있다. 도 2에 도시된 바와 같이, 예컨대, 세트 스테이트부가 구성하는 구성 데이터의 집합이 어카운트(account) 와 토큰의 개수(token account)에 대한 구성 데이터의 집합에 해당하는 경우, 출력 데이터는 경우, 변화된 토큰 의 개수(count)에 대한 데이터를 출력데이터로 제공할 수 있는 것이다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 소 정의 명령에 대하여 인풋 트랜잭션부의 연속적인 작업을 통하여 소정의 명령에 대한 오퍼레이션(operation)을 수행한다. 컨트랙트 모델 유닛의 동작의 경우, 인풋 트랜잭션부의 입력변환 함수(λ), 스테이트 트랜잭션부 의 상태변이 함수(δ), 아웃풋 트랜잭션부의 출력 함수(μ)의 연속동작으로 하나의 오퍼레이션을 수 행하는 것이다. 도 1에 도시된 바와 같이, 입력 데이터가 토큰을 유저#1에서 유저#2로 전송하는 오퍼레이션의 경우, 컨트랙 트 모델 유닛의 연속동작을 통하여 결과적으로 유저#1의 계좌(어카운트)에 있던 토큰이 유저#2의 계좌 (어카운트)로 이동되는 것이다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 세 트 스테이트부는, 인풋 트랜잭션부로부터 원소 데이터를 수신받으며, 스테이트 트랜잭션부를 통 해 구성 데이터의 집합에 대한 상태가 변환되고, 아웃풋 트랜잭션부를 통해 변경된 구성 데이터를 결과 값 으로 출력하도록 설정한다, 도 4 내지 도 6에 도시된 바와 같이, 인풋 트랜잭션부, 아웃풋 트랜잭션부, 스테이트 트랜잭션부 를 통해 구성 데이터의 집합에 대한 상태가 변환되는 것으로, 세트 스테이트부는 변화되는 구성 데이 터의 집합에 대한 상태를 확인할 수 있다. 또한, 세트 스테이트부는 포함되는 구성 데이터의 집합에 대한 상태 중 변화된 구성 데이터를 결과 값으로 출력할 수도 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 입 력부, 출력부를 포함한다. 입력부의 경우, 소정의 파라미터(parameter)가 입력된다. 출력부의 경우, 결과(result, output) 값을 출력한다. 입력부에서 입력되는 값의 경우, 입력(a set of input, X)에 해당하며, 출력부에서 출력되는 값의 경 우, 출력(a set of output, Y)에 해당한다. 입력부를 통해 입력되는 소정의 파라미터의 경우, 입력 값에 해당하는 것으로, 입력 데이터를 의미한다. 앞서 서술한 바와 같이, 입력 데이터의 경우, 예시적으로 다음과 같은 입력 데이터에 해당할 수 있다. x = (0xa374, 0xa28d, 25) ∈ X 예컨대, 입력 데이터는 토큰을 송신하는 어카운트에 대한 정보, 전송을 수신받는 어카운트에 대한 정보, 토큰의 개수(카운트)를 포함할 수 있다. 출력부의 경우, 결과 값을 출력하는 것으로, 출력 데이터를 의미할 수 있다. 종래의 스마트 컨트랙트의 경우, 블록체인 별로 정의한 각각의 가상머신을 활용하고 사용한다. 예컨대, 이더리 움의 경우, EVM(Ethereum Virtual Machine), 솔라나는 LLVM(Low Level Virtual Machine), 카르다노는 KEVM(K Ethereum Virtual Machine) 등의 각각 자신들만의 가상머신을 사용한다. 반면, 본원 발명의 경우, 가상머신을 사용하지 않고 하드웨어에서 직접 실행되어진다. 종래의 이더리움, 솔라나, 카르다노 등은 각각의 스마트 컨트랙트 프로그램 언어로 코딩을 하고 컴파일을 하면, 바이트 코드 형태의 머신코드로 변환이되고, 이 머신코드들은 애뮬레이터(emulator)에 의하여 각각의 가상 머신 에서 인스트럭션(instruction) 단위로 실행된다. 반면, 본원 발명의 컨트랙트 모델 유닛의 경우, 하드웨어에서 직접 수행되므로 종래의 스마트 컨트랙트에 비하여 탁월한 성능을 발휘하며, 하드웨어의 성능을 그대로 활용할 수 있어 처리 성능을 획기적으로 개선할 수 있다. 아울러, 다양한 단위 컨트랙트를 개발하는 경우, 인풋 트랜잭션부의 입력변환 함수(λ), 스테이트 트랜잭 션부의 상태변이 함수(δ), 아웃풋 트랜잭션부의 출력 함수(μ)와 세트 스테이트부의 모델의 집 합, 입력 값, 출력 값을 정의하고, 정의된 내용에 따라 프로그래밍 언어에 종속되지 않고 단위 컨트랙트의 개발 이 가능하도록 하는 구성이다. 이는 반드시 특정 언어를 사용해야하는 종래의 스마트 컨트랙트와는 차별되는 점에 해당한다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 아 웃풋 트랜잭션부는 요구되는 데이터의 내용과 형식에 따라 오퍼레이션 수행결과의 성공 여부 또는 변화된 구성 데이터의 집합 정보 중 어느 하나에 대하여 출력 값으로 설정한다. 예컨대, 구성 데이터의 집합 정보의 경우, 어카운트(account)의 토큰 카운트(token count)에 해당할 수도 있다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템은 복 수 개의 노드 유닛을 포함한다. 복수 개의 노드 유닛의 경우, 미리 설정된 바운더리(boundary) 내 존재하는 복수 개의 노드(Node)에 컨트 랙트 모델 유닛의 트랜잭션 정보가 상호 공유되도록 한다. 복수 개의 노드(Node)의 경우, 미리 설정된 합의 그룹으로 형성될 수 있다. 트랜잭션 정보의 경우, 컨트랙트 모델 유닛의 형성, 컨트랙트 모델 유닛에 반영되는 함수에 대한 구 성, 컨트랙트 모델 유닛에 대한 이벤트 기록, 컨트랙트 모델 유닛의 수정, 변경 등에 대한 컨트랙트 모델 유닛에 부수될 수 있는 모든 이벤트를 총 망라하게 된다. 복수 개의 노드(Node)의 경우, 미리 설정된 합의 그룹으로 형성되는 것으로 복수 개의 노드 유닛의 경계를 구획하는 바운더리(boundary)와 노드의 개수 그리고 어떤 노드에 포함할지에 대한 정보는 미리 설정하는 것이 바람직하다. 본 발명에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨트랙트 시스템의 복 수 개의 노드 유닛은, 복수 개의 노드 각각이 단위 컨트랙트 유닛과 트랜잭션 정보를 상호 매칭 비교 하여 단위 컨트랙트 유닛과 단위 컨트랙트 유닛의 트랜잭션 정보가 상호 매칭되는지 확인할 수 있다. 복수 개의 노드 유닛의 경우, 각각의 노드는 단위 컨트랙트와 트랜잭션 정보를 상호 교차적으로 매칭 비교 함을 통하여 단위 컨트랙트 유닛과 단위 컨트랙트 유닛의 트랜잭션 정보가 상호 정합되는지를 매칭 비교하고 이벤트에 대하여서는 합치되도록 하는 것이 바람직하다. 도 8에 도시된 바와 같이, 복수 개의 노드(Node 1~8) 중 어느 하나의 노드(Node)에서 단위 컨트랙트 유닛 에 대한 트랜잭션 정보가 발생되면, 복수 개의 노드에 공유된 단위 컨트랙트 유닛에 대한 트랜잭션 정보를 각각 비교하고, 복수 개의 노드 중 어느 하나의 노드를 통하여 단위 컨트랙트 유닛에서 발생된 이벤트에 대한 수정 또는 변경 여부를 결정한다. 어느 하나의 노드에서 발생된 이벤트를 통하여 노드 상호 간의 데이터에 대한 정합이 이루어지지 않으면, 인풋 트랜잭션부, 세트 스테이트부, 스테이트 트랜잭션부, 아웃풋 트랜잭션부로부터 소싱되지 않은 정보는 선택적으로 제거되고, 노드 상호 간에 데이터에 대한 정합이 이루어지도록 한다. 종래의 스마트 컨트랙트의 경우, 예컨대, 이더리움이 제시한 스마트 컨트랙트는 구조상 동일한 기능을 하는 컨 트랙트들이 프로젝트별로 중복으로 다수의 블록에 저장되고 실행된 것인데 반해, 본원 발명의 컨트랙트 모델 유 닛의 경우, 동일한 기능을 필요로 하는 단위 컨트랙트들은 동일한 단위 모델을 호출함으로 컴퓨팅 자원을 효율적으로 사용할 수 있으며, 코드의 무분별한 하드포크(프로토콜이 어느 한 시점에서 급격하게 변경되는 것)에 따른 보안 취약성을 방지할 수 있게 되었다. 본 발명의 권리 범위는 특허청구범위에 기재된 사항에 의해 결정되며, 특허 청구범위에 사용된 괄호는 선택적 한정을 위해 기재된 것이 아니라, 명확한 구성요소를 위해 사용되었으며, 괄호 내의 기재도 필수적 구성요소로 해석되어야 한다."}
{"patent_id": "10-2022-0091812", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템에 대한 예시적인 개념도이다. 도 2는 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템에서 컨트랙트 모델 유닛과 컨트랙트 모델 유닛이 포함하는 집합과 함수에 대한 컨트랙트 모델을 도시한 것이다. 도 3은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템에서 컨트랙트 모델 유닛 내에 포함되는 인풋 트랜잭션부, 세트 스테이트부, 아웃풋 트랜잭션부, 스테이트 트랜잭션부를 포함하는 컨트랙트 모델을 도시한 것이다. 도 4는 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템 중 세트 스테이트부의 모델을 구성하는 데이터의 집합을 도시한 것이다. 도 5는 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템 중 인풋 트랜잭션부를 통해 수행된 입력 데이터에 대한 결과가 세트 스테이트부에 결과로 제공된 것을 도시한 것이다. 도 6은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템 중 스테이트 트랜잭션부를 통해 수행된 결과가 세트 스테이트부에 결과로 제공된 것을 도시한 것 이다. 도 7은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템 중 복수 개의 노드 유닛의 각각의 노드를 도시한 것이다. 도 8은 본 발명의 일 실시예에 따른 합의 그룹의 공유를 통해 컨트랙트 모델의 검증과 합의를 제공하는 단위 컨 트랙트 시스템 중 컨트랙트 모델 유닛이 복수 개의 노드 유닛에 공유되어 각각의 노드들에 의해 검증 및 합의 과정을 거치는 것을 도시한 것이다."}
