{"patent_id": "10-2020-0034034", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0117611", "출원번호": "10-2020-0034034", "발명의 명칭": "AI를 이용한 이동통신 방법", "출원인": "엘지전자 주식회사", "발명자": "김수남"}}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 장치(UE)가 기지국과 데이터를 송수신하는 방법으로서,상기 UE가 자신의 능력(capability) 정보를 상기 기지국으로 전송하는 단계;상기 능력 정보는 상기 데이터 송수신을 위한 인공지능(artificial intelligence: AI) 연산과 관련된 정보를 포함하고,상기 UE가 상기 기지국으로부터 복수의 AI 파라미터 세트 중 적어도 하나 이상의 AI 파라미터를 수신하는 단계;및상기 기지국과 데이터를 송수신하기 위한 인코딩 과정 또는 디코딩 과정에 상기 적어도 하나의 AI 파라미터를적용하는 단계를 포함하고,상기 인코딩 과정 또는 디코딩 과정은 상기 적어도 하나의 AI 파라미터 내의 네트워크 구조에 의해서 수행되고,상기 적어도 하나의 AI 파라미터는 상기 네트워크 구조에 의해 인코딩 또는 디코딩 과정을 수행하기 위한 복수의 정보를 포함하는 것을 특징으로 하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 UE가 상기 기지국의 AI 정보를 포함하는 시스템 정보를 상기 기지국으로부터 수신하는 단계를 추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 UE가 AI적용 요청을 상기 기지국으로 전송하는 단계를 추가로포함하고,상기 적어도 하나의 AI 파라미터를 적용하는 단계는 상기 AI 적용 요청을 전송한 이후에 수행되는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 기지국으로부터 AI적용 명령을 수신하는 단계를 추가로 포함하고,상기 적어도 하나의 AI 파라미터를 적용하는 단계는 상기 AI 적용 명령을 수신한 이후에 수행되는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 AI 파라미터를 적용한 후, 상기 기지국으로부터의 수신 신호에 대해 측정을 수행하는 단계와;상기 AI 파라미터를 적용하여 측정된 값과 상기 AI 파라미터를 적용하지 않고 측정된 값의 차이를 산출하는 단계와;상기 산출된 차이값이 기설정된 오차값을 초과하는 경우에 상기 UE가 상기 기지국으로 AI적용 중지를 요청하는신호를 전송하는 단계; 및공개특허 10-2021-0117611-3-상기 인코딩 과정 또는 상기 디코딩 과정에 상기 AI 파라미터를 적용시키는 것을 중지시키는 단계를 추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 UE가 새로운 AI 파라미터를 요청하는 신호를 상기 기지국으로 전송하는 단계;상기 UE가 상기 기지국으로부터 상기 새로운 AI 파라미터를 수신하는 단계; 및상기 인코딩 과정 또는 상기 디코딩 과정에 상기 새로운 AI 파라미터를 적용시키는 단계를 추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 AI 파라미터를 적용한 후, AI 적용을 중지하는 명령을 상기 기지국으로부터 상기 UE가 수신하는 단계; 및상기 인코딩 과정 또는 상기 디코딩 과정에 AI 파라미터를 적용시키는 것을 중지시키는 단계를 추가로 포함하는데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 AI파라미터를 적용한 후, 상기 UE가 채널 지연 특성을 포함하는 채널 상태 정보(Channel StatusInformation: CSI)를 측정하여 상기 CSI 측정값을 상기 기지국으로 전송하는 단계를 추가로 포함하고,상기 UE가AI 적용을 중지하는 명령을 상기 기지국으로부터 수신하는 단계는 CSI 측정값을 상기 기지국으로 전송한 이후에수행되는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 기지국으로부터 데이터를 수신하는 단계와;,상기 기지국으로부터 수신된 데이터에 대한 HARQ(hybrid automatic repeat request) ACK(acknowledgement) 또는 NACK(Negative-acknowledgement) 신호를 전송하는 단계를 더 포함하고,상기 AI 적용 중지 명령은 상기 HARQ NACK 신호가 전송된 것에 응답하여 수신되는 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 UE가 상기 기지국으로부터 새로운 AI 파라미터를 수신하는 단계;상기 UE가 상기 기지국으로부터 상기 새로운 AI 파라미터를 적용시키라는 명령을 수신하는 단계; 및상기 인코딩 과정 또는 상기 디코딩 과정에 상기 새로운 AI 파라미터를 적용시키는 단계를 추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "기지국이 사용자 장치(UE)와 데이터 송수신하는 방법에 있어서,상기 기지국이 상기 UE의 능력(capability) 정보를 상기 UE로부터 수신하는 단계;상기 능력 정보는 상기 데이터 송수신을 위한 인공지능(artificial intelligence: AI) 연산과 관련된 정보를 포함하고,상기 기지국이 상기 UE와 데이터를 송수신하기 위한 인코딩 과정 또는 디코딩 과정에서 사용될 복수의 AI 파라공개특허 10-2021-0117611-4-미터 세트를 생성하는 단계와;상기 기지국이 상기 복수의 AI 파라미터 세트 중 적어도 하나 이상의 AI 파라미터를 상기 UE로 전송하는 단계;및상기 인코딩 과정 또는 디코딩 과정은 상기 적어도 하나 이상의 AI 파라미터 내의 네트워크 구조에 의해서 수행되고,상기 적어도 하나의 AI 파라미터는 상기 네트워크 구조에 의해 인코딩 또는 디코딩 과정을 수행하기 위한 복수의 정보를 포함하는 것을 특징으로 하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 기지국이 상기 기지국의 AI 정보를 포함하는 시스템 정보를 상기 UE로 전송하는 단계를 추가로 포함하는데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 기지국이 상기 UE로부터 AI적용 요청을 수신하는 단계와,상기 기지국이 상기 적어도 하나 이상의 AI 파라미터에 기초하여 디코딩될 수 있는 데이터를 전송하는 단계를추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 기지국이 AI적용 명령을 상기 UE로 전송하는 단계를 추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 기지국이 상기 UE로부터 새로운 AI 파라미터를 요청하는 신호를 수신하는 단계;상기 기지국이 상기 UE로 상기 새로운 AI 파라미터를 전송하는 단계를 추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 기지국이 데이터를 UE로 전송하는 단계와;상기 UE로부터 상기 데이터에 대한 HARQ NACK 신호를 수신하는 단계와;상기 HARQ NACK 신호의 수신에 응답하여 데이터 통신에 AI 적용을 중지하는 명령을 상기 UE로 전송하는 단계를추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서, 상기 기지국이 상기 UE로 새로운 AI 파라미터를 전송하는 단계;상기 기지국이 상기 UE로 데이터 통신에 상기 새로운 AI 파라미터의 적용을 명령하는 신호를 전송하는 단계를추가로 포함하는 데이터 송수신 방법."}
{"patent_id": "10-2020-0034034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "사용자 장치(user equipment)로서,공개특허 10-2021-0117611-5-적어도 하나의 프로세서와; 그리고명령어(instructions)를 저장하고, 상기 적어도 하나의 프로세서와 동작가능하게(operably) 전기적으로 연결가능한, 적어도 하나의 메모리를 포함하고, 상기 명령어가 상기 적어도 하나의 프로세서에 의해서 실행되는 것에기초하여, 수행되는 동작은:상기 UE가 자신의 능력(capability) 정보를 상기 기지국으로 전송하는 단계;상기 능력 정보는 상기 데이터 송수신을 위한 인공지능(artificial intelligence: AI) 연산과 관련된 정보를 포함하고,상기 UE가 상기 기지국으로부터 복수의 AI 파라미터 세트 중 적어도 하나 이상의 AI 파라미터를 수신하는 단계;및상기 기지국과 데이터를 송수신하기 위한 인코딩 과정 또는 디코딩 과정에 상기 적어도 하나의 AI 파라미터를적용하는 단계를 포함하고,상기 인코딩 과정 또는 디코딩 과정은 DNN(Deep neural network)에 의해서 수행되고,상기 적어도 하나의 AI 파라미터는 상기 DNN을 구현하기 위한 복수의 정보를 포함하는 것을 특징으로 하는 UE."}
{"patent_id": "10-2020-0034034", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사용자 장치(UE)가 기지국과 데이터를 송수신하는 방법을 제공한다. 상기 방법은 상기 UE가 자신의 능력 (capability) 정보를 상기 기지국으로 전송하는 단계; 상기 능력 정보는 상기 데이터 송수신을 위한 인공지능 (artificial intelligence: AI) 연산과 관련된 정보를 포함하고, 상기 UE가 상기 기지국으로부터 복수의 AI 파 라미터 세트 중 적어도 하나 이상의 AI 파라미터를 수신하는 단계; 및 상기 기지국과 데이터를 송수신하기 위한 인코딩 과정 또는 디코딩 과정에 상기 적어도 하나의 AI 파라미터를 적용하는 단계를 포함하고, 상기 인코딩 과 정 또는 디코딩 과정은 상기 적어도 하나의 AI 파라미터 내의 네트워크 구조에 의해서 수행되고, 상기 적어도 하 나의 AI 파라미터는 상기 네트워크 구조에 의해 인코딩 또는 디코딩 과정을 수행하기 위한 복수의 정보를 포함할 수 있다."}
{"patent_id": "10-2020-0034034", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서의 개시는 이동통신에 관한 것이다."}
{"patent_id": "10-2020-0034034", "section": "발명의_설명", "subsection": "배경기술", "item": 1, "content": "도 1은 무선 통신 시스템이다. 도 1을 참조하여 알 수 있는 바와 같이, 무선 통신 시스템은 적어도 하나의 기지국(base station: BS)을 포 함한다. 각 기지국은 특정한 지리적 영역(일반적으로 셀이라고 함)(20a, 20b, 20c)에 대해 통신 서비스를 제공한다. 셀은 다시 다수의 영역(섹터라고 함)으로 나누어질 수 있다. UE은 통상적으로 하나의 셀에 속하는데, UE이 속한 셀을 서빙 셀(serving cell)이라 한다. 서빙 셀에 대해 통신 서비스를 제공하는 기지국을 서빙 기지국(serving BS)이라 한다. 무선 통신 시스템은 셀룰러 시스템(cellular system)이므로, 서빙 셀에 인접하는 다른 셀이 존재한다. 서빙 셀에 인접하는 다른 셀을 인접 셀(neighbor cell)이라 한다. 인접 셀에 대해 통신 서비스를 제공하는 기지국을 인접 기지국(neighbor BS)이라 한다. 서빙 셀 및 인접 셀은 UE을 기준으로 상대적으로 결정된다. 이하에서, 하향링크는 기지국에서 UE로의 통신을 의미하며, 상향링크는 UE에서 기지국으로의 통신을 의미한다. 하향링크에서 송신기는 기지국의 일부분이고, 수신기는 UE의 일부분일 수 있다. 상향 링크에서 송신기는 UE의 일부분이고, 수신기는 기지국의 일부분일 수 있다. 한편, 무선 통신 시스템은 크게 FDD(frequency division duplex) 방식과 TDD(time division duplex) 방식으로 나눌 수 있다. FDD 방식에 의하면 상향링크 전송과 하향링크 전송이 서로 다른 주파수 대역을 차지하면서 이루 어진다. TDD 방식에 의하면 상향링크 전송과 하향링크 전송이 같은 주파수 대역을 차지하면서 서로 다른 시간에 이루어진다. TDD 방식의 채널 응답은 실질적으로 상호적(reciprocal)이다. 이는 주어진 주파수 영역에서 하향링 크 채널 응답과 상향링크 채널 응답이 거의 동일하다는 것이다. 따라서, TDD에 기반한 무선통신 시스템에서 하 향링크 채널 응답은 상향링크 채널 응답으로부터 얻어질 수 있는 장점이 있다. TDD 방식은 전체 주파수 대역을 상향링크 전송과 하향링크 전송이 시분할되므로 기지국에 의한 하향링크 전송과 UE에 의한 상향링크 전송이 동 시에 수행될 수 없다. 상향링크 전송과 하향링크 전송이 서브프레임 단위로 구분되는 TDD 시스템에서, 상향링크 전송과 하향링크 전송은 서로 다른 서브프레임에서 수행된다. 이하에서는, LTE 시스템에 대해서 보다 상세하게 알아보기로 한다. 도 2는 3GPP LTE에서 FDD에 따른 무선 프레임(radio frame)의 구조를 나타낸다. 도 2를 참조하면, 무선 프레임은 10개의 서브프레임(subframe)을 포함하고, 하나의 서브프레임은 2개의 슬롯 (slot)을 포함한다. 무선 프레임 내 슬롯은 0부터 19까지 슬롯 번호가 매겨진다. 하나의 서브프레임이 전송되는 데 걸리는 시간을 전송시간구간(Transmission Time interval: TTI)라 한다. TTI는 데이터 전송을 위한 스케줄 링 단위라 할 수 있다. 예를 들어, 하나의 무선 프레임의 길이는 10ms이고, 하나의 서브프레임의 길이는 1ms이 고, 하나의 슬롯의 길이는 0.5ms 일 수 있다. 무선 프레임의 구조는 예시에 불과하고, 무선 프레임에 포함되는 서브프레임의 수 또는 서브프레임에 포함되는 슬롯의 수 등은 다양하게 변경될 수 있다. 한편, 하나의 슬롯은 복수의 OFDM(orthogonal frequency division multiplexing) 심볼을 포함할 수 있다. 하나 의 슬롯에 몇개의 OFDM 심볼이 포함되는지는 순환 전치(cyclic prefix: CP)에 따라 달라질 수 있다. 하나의 슬롯은 주파수 영역(frequency domain)에서 NRB 개의 자원블록(RB)을 포함한다. 예를 들어, LTE 시스템 에서 자원블록(RB)의 개수, 즉 NRB은 6 내지 110 중 어느 하나일 수 있다. 자원블록(resource block: RB)은 자원 할당 단위로, 하나의 슬롯에서 복수의 부반송파를 포함한다. 예를 들어, 하나의 슬롯이 시간 영역에서 7개의 OFDM 심벌을 포함하고, 자원블록은 주파수 영역에서 12개의 부반송파를 포 함한다면, 하나의 자원블록은 7Х12개의 자원요소(resource element: RE)를 포함할 수 있다. 3GPP LTE에서 물리채널은 데이터 채널인 PDSCH(Physical Downlink Shared Channel)와 PUSCH(Physical Uplink Shared Channel) 및 제어채널인 PDCCH(Physical Downlink Control Channel), PCFICH(Physical Control Format Indicator Channel), PHICH(Physical Hybrid-ARQ Indicator Channel) 및 PUCCH(Physical Uplink Control Channel)로 나눌 수 있다. 상향링크 채널은 PUSCH, PUCCH, SRS(Sounding Reference Signal), PRACH(Physical Random Access Channel)을 포함한다. 도 3은 초기 접속 과정을 나타낸 예시적으로 흐름도이다. 전원이 막 켜진 UE은 초기 셀 선택 과정을 수행하게 되는데, 먼저 UE은 eNodeB(200-1)와 NodeB(200- 2)로부터 동기 신호, 즉 PSS(Primary Synch Signal), SSS(Secondary Synch Signal)를 수신하고, 상기 동기 신 호를 통해 셀 ID를 획득함으로써, 셀을 식별할 수 있다. 이어서, 상기 UE은 기준 신호, 예컨대 CRS(Cell-specific Reference Signal) 통해 셀 측정을 수행한다. 이해를 도모하고자 CRS가 무엇인지 간략하게 설명하면 다음과 같다. CRS는 셀 내의 모든 UE가 공유하는 기준 신 호로서, 채널 상태에 대한 정보 획득 및 핸드오버 측정(measurement) 등을 위하여 사용된다. UE는 CRS를 측정하 여 RSRP(Reference Signal Received Power) 및 RSRQ(Reference Signal Received Quality)를 측정한다. 또한, UE는 CRS를 통해 CQI(channel quality information), PMI(pecoding matrix indicator), RI(rank indicator)와 같은 피드백 정보를 산출할 수 있다. 그리고, 상기 UE은 앞서 설명한 내용에 따라 셀 선택을 수행한다. 만약, 상기 UE이 상기 eNodeB(200- 1)을 선택하였다면, 상기 eNodeB(200-1)은 서빙셀이 된다. 상기 UE는 eNodeB(200-1)로부터 시스템 정보, 예컨대 MIB(Master Information Block) 및 SIB(system information block)를 수신한다. 상기 MIB는 PBCH(physical broadcast channel)를 통해 수신될 수 있고, 상기 SIB는 PDSCH(Physical Downlink Shared Channel)를 통해 수신될 수 있다. 만약, 상기 UE이 상기 eNodeB(200-1)을 선택하였다면, 상기 eNodeB(200-1)의 셀로 캠프온하고, RRC 연결 을 수립한다."}
{"patent_id": "10-2020-0034034", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 명세서의 개시는 전술한 문제점을 해결하는 것을 목적으로 한다."}
{"patent_id": "10-2020-0034034", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위하여, 본 명세서의 일 개시는 사용자 장치(UE)가 기지국과 데이터를 송수신하는 방법 으로서, 상기 UE가 자신의 능력(capability) 정보를 상기 기지국으로 전송하는 단계; 상기 능력 정보는 상기 데 이터 송수신을 위한 인공지능(artificial intelligence: AI) 연산과 관련된 정보를 포함할 수 있다. 상기 UE가 상기 기지국으로부터 복수의 AI 파라미터 세트 중 적어도 하나 이상의 AI 파라미터를 수신하는 단계; 및 상기 기지국과 데이터를 송수신하기 위한 인코딩 과정 또는 디코딩 과정에 상기 적어도 하나의 AI 파라미터 를 적용하는 단계를 포함할 수 있다. 상기 인코딩 과정 또는 디코딩 과정은 상기 적어도 하나의 AI 파라미터 내의 네트워크 구조에 의해서 수행되고, 상기 적어도 하나의 AI 파라미터는 상기 네트워크 구조에 의해 인코딩 또는 디코딩 과정을 수행하기 위한 복수 의 정보를 포함할 수 있다."}
{"patent_id": "10-2020-0034034", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서의 개시에 의하면, 전술한 종래 기술의 문제점이 해결된다."}
{"patent_id": "10-2020-0034034", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 기술적 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하 려는 의도가 아님을 유의해야 한다. 또한, 본 명세서에서 사용되는 기술적 용어는 본 명세서에서 특별히 다른 의미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 명세서에서 사용되는 기술적인 용어가 본 발명의 사상을 정확하게 표현하지 못하는 잘못된 기술 적 용어일 때에는, 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또한, 본 발명에서 사용되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하 며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여 러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 본 명세서에서 사용되는 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으 면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있고, 유사하게 제2 구성 요소도 제1 구성 요소로 명명될 수 있다. 어떤 구성 요소가 다른 구성 요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성 요소 에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성 요소가 존재할 수도 있다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성 요소가 존재하지 않는 것으로 이해되어야 할 것이다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일 하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 발명의 사상을 쉽게 이해할 수 있도록 하기 위한 것일뿐, 첨부된 도면에 의해 본 발명의 사상이 제한되는 것으로 해석되어서는 아니됨을 유의해야 한다. 본 발명 의 사상은 첨부된 도면외에 모든 변경, 균등물 내지 대체물에 까지도 확장되는 것으로 해석되어야 한다. 본 명세서에서 “A 또는 B(A or B)”는 “오직 A”, “오직 B” 또는 “A와 B 모두”를 의미할 수 있다. 달리 표현하면, 본 명세서에서 “A 또는 B(A or B)”는 “A 및/또는 B(A and/or B)”으로 해석될 수 있다. 예를 들어, 본 명세서에서 “A, B 또는 C(A, B or C)”는 “오직 A”, “오직 B”, “오직 C”, 또는 “A, B 및 C의 임의의 모든 조합(any combination of A, B and C)”를 의미할 수 있다. 본 명세서에서 사용되는 슬래쉬(/)나 쉼표(comma)는 “및/또는(and/or)”을 의미할 수 있다. 예를 들어, “A/B ”는 “A 및/또는 B”를 의미할 수 있다. 이에 따라 “A/B”는 “오직 A”, “오직 B”, 또는 “A와 B 모두” 를 의미할 수 있다. 예를 들어, “A, B, C”는 “A, B 또는 C”를 의미할 수 있다. 본 명세서에서 “적어도 하나의 A 및 B(at least one of A and B)”는, “오직 A”, “오직 B” 또는 “A와 B 모두”를 의미할 수 있다. 또한, 본 명세서에서 “적어도 하나의 A 또는 B(at least one of A or B)”나 “적어 도 하나의 A 및/또는 B(at least one of A and/or B)”라는 표현은 “적어도 하나의 A 및 B(at least one of A and B)”와 동일하게 해석될 수 있다. 또한, 본 명세서에서 “적어도 하나의 A, B 및 C(at least one of A, B and C)”는, “오직 A”, “오직 B”, “오직 C”, 또는 “A, B 및 C의 임의의 모든 조합(any combination of A, B and C)”를 의미할 수 있다. 또한, “적어도 하나의 A, B 또는 C(at least one of A, B or C)”나 “적어도 하나의 A, B 및/또는 C(at least one of A, B and/or C)”는 “적어도 하나의 A, B 및 C(at least one of A, B and C)”를 의미할 수 있 다. 또한, 본 명세서에서 사용되는 괄호는 “예를 들어(for example)”를 의미할 수 있다. 구체적으로, “제어 정보 (PDCCH)”로 표시된 경우, “제어 정보”의 일례로 “PDCCH”가 제안된 것일 수 있다. 달리 표현하면 본 명세서 의 “제어 정보”는 “PDCCH”로 제한(limit)되지 않고, “PDDCH”가 “제어 정보”의 일례로 제안될 것일 수 있다. 또한, “제어 정보(즉, PDCCH)”로 표시된 경우에도, “제어 정보”의 일례로 “PDCCH”가 제안된 것일 수 있다. 본 명세서에서 하나의 도면 내에서 개별적으로 설명되는 기술적 특징은, 개별적으로 구현될 수도 있고, 동시에 구현될 수도 있다. 이하에서 사용되는 용어인 기지국은, 일반적으로 무선기기와 통신하는 고정된 지점(fixed station)을 말하며, eNodeB(evolved-NodeB), eNB(evolved-NodeB), gNB, BTS(Base Transceiver System), 액세스 포인트(Access Point) 등 다른 용어로 불릴 수 있다. 그리고 이하, 사용되는 용어인 UE(User Equipment)는, 고정되거나 이동성을 가질 수 있으며, 기기(Device), 무 선기기(Wireless Device), 단말(Terminal), MS(mobile station), UT(user terminal), SS(subscriber station), MT(mobile terminal) 등 다른 용어로 불릴 수 있다. 이제 3GPP LTE에서 HARQ에 대해 기술한다. <HARQ(hybrid automatic repeat request)> 3GPP LTE는 상향링크 전송에서 동기(synchronous) HARQ를 사용하고, 하향링크 전송에서 비동기(asynchronous) HARQ를 사용한다. 동기 HARQ는 재전송 타이밍이 고정된 것을 말하고, 비동기 HARQ는 재전송 타이밍이 고정되지 않는다. 즉, 동기 HARQ는 HARQ 주기로 초기 전송과 재전송이 수행된다. 도 4는 기지국과 단말 간의 HARQ의 동작을 나타낸 예시도이다. 먼저, 기지국, 즉 eNodeB은 HARQ 방식으로 데이터를 단말, 즉 UE에게 전송하기 위해서 PDCCH (Physical Downlink Control CHannel) 제어채널을 통해서 스케줄링 정보 (Scheduling Information; 이하 스케 줄링 정보)를 전송한다. 상기 UE은 상기 제어 채널, 즉 PDCCH을 모니터링(Monitoring) 해서, 자신에게 오는 스케줄링 정보를 확인 한다. 상기 스케줄링 정보의 확인에 따라 자신에 대한 정보가 있는 것으로 확인되면, 상기 UE은 PDCCH와 연관된 시점에서 공용 채널(PSCH: Physical Shared Channel)을 통해 eNodeB으로부터 데이터들(예컨대 도시된 데 이터#1 및 데이터#2)을 수신한다. 상기 UE은 데이터를 수신하면 상기 데이터의 복호화를 시도한다. 상기 단말은 상기 복호화 결과에 따라 HARQ 피드백을 eNodeB으로 전송한다. 즉, 상기 UE은 복호화에 성공하면 ACK(acknowledgement) 신호 를, 실패하면 NACK(Negative-acknowledgement) 신호를 PUCCH 혹은 PUSCH를 통해 eNodeB에 전송한다. 상기 eNodeB은 ACK 신호를 수신하면 상기 단말로의 데이터 전송이 성공했음을 감지하고 다음 데이터를 전 송한다. 그러나, 상기 eNodeB이 NACK 신호를 수신하면 상기 UE로의 데이터 전송이 실패했음을 감지하고 적절 한 시점에 동일 데이터를 동일한 형식 또는 새로운 형식으로 재전송한다. 상기 NACK 신호를 전송한 UE은 재전송되는 데이터의 수신을 시도한다. 상기 UE은 재전송된 데이터를 수신하면, 이를 이전에 복호화에 실패한 채로 버퍼에 저장되어 있는 데이터 와 다양한 방식으로 결합하여 다시 복호화를 시도하고, 복호화에 성공했을 경우 ACK 신호를, 실패했을 경우 NACK 신호를 PUCCH 혹은 PUSCH를 통해 상기 eNodeB에 전송한다. 상기 UE 데이터의 복호화에 성공할 때까지 NACK 신호를 보내고 재전송을 받는 과정을 반복한다. <반송파 집성> 이제 반송파 집성(carrier aggregation: CA) 시스템에 대해 설명한다. 반송파 집성 시스템은 다수의 요소 반송파(component carrier: CC)를 집성하는 것을 의미한다. 이러한 반송파 집성에 의해서, 기존의 셀의 의미가 변경되었다. 반송파 집성에 의하면, 셀이라 함은 하향링크 요소 반송파와 상향링크 요소 반송파의 조합, 또는 단독의 하향링크 요소 반송파를 의미할 수 있다. 또한, 반송파 집성에서 셀은 프라이머리 셀(primary cell)과 세컨더리 셀(secondary cell), 서빙 셀(serving cell)로 구분될 수 있다. 프라이머리 셀은 프라이머리 주파수에서 동작하는 셀을 의미하며, UE가 기지국과의 최 초 연결 확립 과정(initial connection establishment procedure) 또는 연결 재확립 과정을 수행하는 셀, 또는 핸드오버 과정에서 프라이머리 셀로 지시된 셀을 의미한다. 세컨더리 셀은 세컨더리 주파수에서 동작하는 셀을 의미하며, 일단 RRC 연결이 확립되면 설정되고 추가적인 무선 자원을 제공하는데 사용된다. 상술한 바와 같이 반송파 집성 시스템에서는 단일 반송파 시스템과 달리 복수의 요소 반송파(CC), 즉, 복수의 서빙 셀을 지원할 수 있다. 이러한 반송파 집성 시스템은 교차 반송파 스케줄링을 지원할 수 있다. 교차 반송파 스케줄링(cross-carrier scheduling)은 특정 요소 반송파를 통해 전송되는 PDCCH를 통해 다른 요소 반송파를 통해 전송되는 PDSCH의 자 원 할당 및/또는 상기 특정 요소 반송파와 기본적으로 링크되어 있는 요소 반송파 이외의 다른 요소 반송파를 통해 전송되는 PUSCH의 자원 할당을 할 수 있는 스케줄링 방법이다. <차세대 이동통신 네트워크> 4세대 이동통신을 위한 LTE(long term evolution)/LTE-Advanced(LTE-A)의 성공에 힘입어, 차세대, 즉 5세대(소 위 5G) 이동통신에 대한 관심도 높아지고 있고, 연구도 속속 진행되고 있다. 국제전기통신연합(ITU)이 정의하는 5세대 이동통신은 최대 20Gbps의 데이터 전송 속도와 어디에서든 최소 100Mbps 이상의 체감 전송 속도를 제공하는 것을 말한다. 정식 명칭은 ‘IMT-2020’이며 세계적으로 2020년 에 상용화하는 것을 목표로 하고 있다. ITU에서는 3대 사용 시나리오, 예컨대 eMBB(enhanced Mobile BroadBand) mMTC(massive Machine Type Communication) 및 URLLC(Ultra Reliable and Low Latency Communications)를 제시하고 있다. URLLC는 높은 신뢰성과 낮은 지연시간을 요구하는 사용 시나리에 관한 것이다. 예를 들면 자동주행, 공장자동화, 증강현실과 같은 서비스는 높은 신뢰성과 낮은 지연시간(예컨대, 1ms 이하의 지연시간)을 요구한다. 현재 4G (LTE) 의 지연시간은 통계적으로 21-43ms (best 10%), 33-75ms (median) 이다. 이는 1ms 이 하의 지연시간을 요구하는 서비스를 지원하기에 부족하다. 다음으로, eMBB 사용 시나리오는 이동 초광대역을 요 구하는 사용 시나리오에 관한 것이다. 즉, 5세대 이동통신 시스템은 현재의 4G LTE보다 높은 용량을 목표로 하며, 모바일 광대역 사용자의 밀도를 높 이고, D2D(Device to Device), 높은 안정성 및 MTC(Machine type communication)을 지원할 수 있다. 5G 연구 개발은 또한 사물의 인터넷을 보다 잘 구현하기 위해 4G 이동 통신 시스템 보다 낮은 대기 시간과 낮은 배터리 소모를 목표로 한다. 이러한 5G 이동 통신을 위해서 새로운 무선 액세스 기술(new radio access technology: New RAT 또는 NR)이 제시될 수 있다. 도 5a 내지 도 c는 차세대 이동통신의 서비스를 위한 예시적인 아키텍처를 나타낸 예시도들이다. 도 5a를 참조하면, UE는 LTE/LTE-A 기반의 셀과 그리고 NR 기반의 셀에 DC(dual connectivity) 방식으로 연결 되어 있다. 상기 NR 기반의 셀은 기존 4세대 이동통신을 위한 코어 네트워크(core network), 즉 EPC(Evolved Packet Cor e)에 연결된다. 도 5b를 참조하면, 도 4a와 달리 LTE/LTE-A 기반의 셀은 5세대 이동통신을 위한 코어 네트워크, 즉 NG(Next Generation) 코어 네트워크에 연결되어 있다. 위 도 5a 및 도 5b에 도시된 바와 같은 아키텍처에 기반한 서비스 방식을 NSA(non-standalone)라고 한다. 도 5c를 참조하면, UE는 NR 기반의 셀에만 연결되어 있다. 이러한 아키텍처에 기반한 서비스 방식을 SA(standalone)이라고 한다. 한편, 상기 NR에서, 기지국으로부터의 수신은 다운 링크 서브프레임을 이용하고, 기지국으로의 송신은 업 링크 서브 프레임을 이용하는 것이 고려 될 수 있다. 이 방식은 쌍으로 된 스펙트럼 및 쌍을 이루지 않은 스펙트럼에 적용될 수 있다. 한 쌍의 스펙트럼은 다운 링크 및 업 링크 동작을 위해 두 개의 반송파 스펙트럼을 포함된다는 것을 의미한다. 예를 들어, 한 쌍 스펙트럼에서, 하나의 반송파는 서로 쌍을 이루는 하향링크 대역 및 상향링크 대역을 포함 할 수 있다. 도 6은 NR에서의 서브프레임 유형의 예를 도시한다. 도 6에 도시된 TTI(transmission time interval)는 NR(또는 new RAT)을 위한 서브프레임 또는 슬롯으로 불릴 수 있다. 도 5의 서브프레임(또는 슬롯)은, 데이터 전송 지연을 최소화하기 위해 NR(또는 new RAT)의 TDD 시스 템에서 사용될 수 있다. 도 6에 도시 된 바와 같이, 서브프레임(또는 슬롯)은 현재의 서브 프레임과 마찬가지로, 14 개의 심볼을 포함한다. 서브프레임(또는 슬롯)의 앞부분 심볼은 DL 제어 채널을 위해서 사용될수 있고, 서브프레임(또는 슬롯)의 뒷부분 심볼은 UL 제어 채널을 위해서 사용될 수 있다. 나머지 심볼들은 DL 데이터 전송 또는 UL 데이터 전송을 위해 사용될 수 있다. 이러한 서브프레임(또는 슬롯) 구조에 따르면, 하향 링크 전송과 상향 링크 전송은 하나의 서브프레임(또는 슬롯)에서 순차적으로 진행될 수 있다. 따라서, 서브프 레임(또는 슬롯) 내에서 하향 링크 데이터가 수신될 수 있고, 그 서브프레임(또는 슬롯) 내에서 상향 링크 확인 응답(ACK / NACK)이 전송될 수 도 있다. 이러한 서브프레임(또는 슬롯)의 구조를 자체-포함(self-contained)된 서브프레임(또는 슬롯)이라고 할 수 있다. 이러한 서브프레임(또는 슬롯)의 구조를 사용하면, 수신 오류가 발생 한 데이터를 재전송하는 데 걸리는 시간이 줄어들어 최종 데이터 전송 대기 시간이 최소화될 수 있는 장점이 있 다. 이와 같은 자체-포함(self-contained)된 서브프레임(또는 슬롯) 구조에서, 송신 모드에서 수신 모드로 또는 수신 모드에서 송신 모드로의 전이 과정에 시간 차(time gap)가 필요할 수 있다. 이를 위해, 서브 프레임 구조 에서 DL에서 UL로 전환 할 때의 일부 OFDM 심볼은 보호 구간(Guard Period: GP)으로 설정 될 수 있다. <다양한 뉴머롤로지(numerology)의 지원> 차기 시스템에서는 무선 통신 기술의 발달에 따라, 단말에 다수의 뉴머롤로지(numerology)가 제공될 수도 있다. 상기 뉴머롤로지는 CP(cycle prefix) 길이와 부반송파 간격(Subcarrier Spacing)에 의해 정의될 수 있다. 하나 의 셀은 복수의 뉴머롤로지를 단말로 제공할 수 있다. 뉴머롤로지의 인덱스를 μ로 나타낼 때, 각 부반송파 간 격과 해당하는 CP 길이는 아래의 표와 같을 수 있다. 표 1 μ f=2μ15 [kHz]CP 0 15 일반 1 30 일반 2 60 일반, 확장 3 120 일반 4 240 일반 일반 CP의 경우, 뉴머롤로지의 인덱스를 μ로 나타낼 때, 슬롯 당 OFDM 심볼 개수(Nslot symb), 프레임당 슬롯 개수 (Nframe,μ slot) 그리고, 서브프레임 당 슬롯 개수(Nsubframe,μ slot)는 아래의 표와 같다. 표 2 μ Nslot symb Nframe,μ slot Nsubframe,μ slot 0 14 10 1 1 14 20 2 2 14 40 4 3 14 80 8 4 14 160 16 5 14 320 32 확장 CP의 경우, 뉴머롤로지의 인덱스를 μ로 나타낼 때, 슬롯 당 OFDM 심볼 개수(Nslot symb), 프레임당 슬롯 개수 (Nframe,μ slot) 그리고, 서브프레임 당 슬롯 개수(Nsubframe,μ slot)는 아래의 표와 같다. 표 3 μ Nslot symb Nframe,μ slot Nsubframe,μ slot 2 12 40 4 한편, 차세대 이동통신에서는 심볼 내에서 각 심볼은 아래의 표와 같이 하향링크로 사용되거나 혹은 상향링크로 사용될 수 있다. 하기의 표에서 상향링크는 U로 표기되고, 하향링크는 D로 표기되었다. 하기의 표에서 X는 상향링크 또는 하향링크로 유연성있게 사용될 수 있는 심볼을 나타낸다. 표 4 포맷 슬롯 내에서 심볼 번호 0 12345678910111213 0 D DDDDDDDDDDDDD 1 U UUUUUUUUUUUUU 2 X XXXXXXXXXXXXX 3 D DDDDDDDDDDDDX 4 D DDDDDDDDDDDXX 5 D DDDDDDDDDDXXX 6 D DDDDDDDDDXXXX 7 D DDDDDDDDXXXXX 8 X XXXXXXXXXXXXU 9 X XXXXXXXXXXXUU 10 X UUUUUUUUUUUUU 11 X XUUUUUUUUUUUU 12 X XXUUUUUUUUUUU 13 X XXXUUUUUUUUUU 14 X XXXXUUUUUUUUU 15 X XXXXXUUUUUUUU 16 D XXXXXXXXXXXXX 17 D DXXXXXXXXXXXX 18 D DDXXXXXXXXXXX 19 D XXXXXXXXXXXXU 20 D DXXXXXXXXXXXU 21 D DDXXXXXXXXXXU 22 D XXXXXXXXXXXUU 23 D DXXXXXXXXXXUU 24 D DDXXXXXXXXXUU 25 D XXXXXXXXXXUUU 26 D DXXXXXXXXXUUU 27 D DDXXXXXXXXUUU 28 D DDDDDDDDDDDXU 29 D DDDDDDDDDDXXU 30 D DDDDDDDDDXXXU 31 D DDDDDDDDDDXUU 32 D DDDDDDDDDXXUU 33 D DDDDDDDDXXXUU 34 D XUUUUUUUUUUUU 35 D DXUUUUUUUUUUU 36 D DDXUUUUUUUUUU 37 D XXUUUUUUUUUUU 38 D DXXUUUUUUUUUU 39 D DDXXUUUUUUUUU 40 D XXXUUUUUUUUUU 41 D DXXXUUUUUUUUU 42 D DDXXXUUUUUUUU 43 D DDDDDDDDXXXXU 44 D DDDDDXXXXXXUU 45 D DDDDDXXUUUUUU 46 D DDDDDXDDDDDDX 47 D DDDDXXDDDDDXX 48 D DXXXXXDDXXXXX 49 D XXXXXXDXXXXXX 50 X UUUUUUXUUUUUU 51 X XUUUUUXXUUUUU 52 X XXUUUUXXXUUUU53 X XXXUUUXXXXUUU 54 D DDDDXUDDDDDXU 55 D DXUUUUDDXUUUU 56 D XUUUUUDXUUUUU 57 D DDDXXUDDDDXXU 58 D DXXUUUDDXXUUU 59 D XXUUUUDXXUUUU 60 D XXXXXUDXXXXXU 61 D DXXXXUDDXXXXU <NR에서 SS 블록> 5G NR에서는 단말이 초기 액세스를 수행하는데 필요한 정보, 즉 MIB(Master Information Block)를 포함하는 PBCH(Physical Broadcast Channel)와 동기 신호(SS)(PSS 및 SSS를 포함)를 SS 블록으로 정의한다. 그리고, 복 수 개의 SS 블록을 묶어서 SS 버스트라 정의하고, 다시 복수 개수의 SS 버스트(burst)를 묶어서 SS 버스트 세트 라고 정의할 수 있다. 각 SS 블록은 특정 방향으로 빔포밍되어 있는 것을 가정하고 있고, SS 버스트 세트내에 있는 여러 SS 블록은 각각 다른 방향에 존재하는 단말을 지원하기 위해서 설계되고 있다. 도 7은 NR에서 SS 블록의 예를 나타낸 예시도이다. 도 7을 참조하면, SS 버스트는 미리 정해진 주기(periodicity) 마다 전송된다. 따라서, 단말은 SS 블록을 수신 하고, 셀 검출 및 측정을 수행한다. 한편, 5G NR에서는 SS에 대해서 빔 스위핑(beam sweeping)이 수행된다. 이에 대해서 도 8을 참조하여 설명하기 로 한다. 도 8은 NR에서 빔 스위핑의 예를 나타낸 예시도이다. 기지국은 SS 버스트 내의 각 SS 블록을 시간에 따라 빔 스위핑(beam sweeping)을 하면서 전송하게 된다. 이때, SS 버스트 세트 내에 있는 여러 SS 블록은 각각 다른 방향에 존재하는 단말을 지원하기 위해서 전송된다. 도 6 에서는 SS 버스트 세트가 SS 블록 1~6을 포함하고, 각 SS 버스트는 2개의 SS 블록을 포함한다. <본 명세서의 개시가 해결하고자 하는 문제점> 도 9는 일반적인 통신절차를 나타낸 예시도이다. 도 9를 참조하면, 사용자 장치(UE)는 도 3에서 전술한 것과 같이 전원이 켜진(power on) 후 UE는 기지국으로부 터 동기 신호, 즉 PSS(Primary Synch Signal), SSS(Secondary Synch Signal)를 수신하고, 상기 동기 신호를 통 해 셀 ID를 획득함으로써, 셀을 식별할 수 있다. 이어서, 상기 UE은 기준 신호, 예컨대 CRS(Cell-specific Reference Signal)를 통해 셀 측정을 수행한다. UE는 CRS를 측정하여 RSRP(Reference Signal Received Power) 및 RSRQ(Reference Signal Received Quality)를 측정한다. 또한, UE는 CRS를 통해 CQI(channel quality information), PMI(pecoding matrix indicator), RI(rank indicator)와 같은 피드백 정보를 산출할 수 있다. 상기 UE는 기지국으로부터 시스템 정보, 예컨대 MIB(Master Information Block) 및 SIB(system information block)를 수신한다. 상기 MIB는 PBCH(physical broadcast channel)를 통해 수신될 수 있고, 상기 SIB는 PDSCH(Physical Downlink Shared Channel)를 통해 수신될 수 있다. 기지국의 셀로 캠프온하고, RRC 연결 을 수립한다 동기화된 상태에서 기지국은 시스템 정보를 UE로 전송할 수 있다. UE는 UE정보를 기지국으로 전송할 수 있다. 상기 UE정보는 UE의 능력(capability) 정보등을 포함할 수 있다. 그러면 UE와 기지국은 도 4에서 전술한 것과 같이 데이터를 송수신 할 수 있다. 데이터 송수신에 있어서 peak-to-average power ratio (PAPR)을 줄이기 위한 다양한 시도가 있지만 실제 적용하 기 위한 구체적인 방법들은 제시되지 못하고 있다. <본 명세서의 개시> 도 10은 본 명세서의 개시를 구현하기 위한 따른 무선 통신 시스템을 나타낸다. 도 10을 참조하면, 본 명세서의 개시를 구현하기 위한 무선 통신 시스템은 제 1 장치(100a)와 제 2 장치(100b) 를 포함할 수 있다. 상기 제 1 장치(100a)는 본 명세서의 개시에서 설명한 사용자 장치(UE)일 수 있다. 상기 제 2 장치(100b)는 본 명세서의 개시에서 설명한 기지국일 수 있다. 상기 제 1 장치(100a)는 프로세서(1020a)와 같은 적어도 하나 이상의 프로세서와, 메모리(1010a)와 같은 적어도 하나 이상의 메모리와, 송수신기(1031a)과 같은 적어도 하나 이상의 송수신기를 포함할 수 있다. 상기 프로세서 (1020a)는 후술한 기능, 절차, 및/또는 방법들을 수행할 수 있다. 상기 프로세서(1020a)는 하나 이상의 프로토 콜을 수행할 수 있다. 예를 들어, 상기 프로세서(1020a)는 무선 인터페이스 프로토콜의 하나 이상의 계층들을 수행할 수 있다. 상기 메모리(1010a)는 상기 프로세서(1020a)와 연결되고, 다양한 형태의 정보 및/또는 명령을 저장할 수 있다. 상기 송수신기(1031a)는 상기 프로세서(1020a)와 연결되고, 무선 시그널을 송수신하도록 제어 될 수 있다. 상기 제 2 장치(100b)는 프로세서(1020b)와 같은 적어도 하나의 프로세서와, 메모리(1010b)와 같은 적어도 하나 이상의 메모리 장치와, 송수신기(1031b)와 같은 적어도 하나의 송수신부를 포함할 수 있다. 상기 프로세서 (1020b)는 후술한 기능, 절차, 및/또는 방법들을 수행할 수 있다. 상기 프로세서(1020b)는 하나 이상의 프로토 콜을 구현할 수 있다. 예를 들어, 상기 프로세서(1020b)는 무선 인터페이스 프로토콜의 하나 이상의 계층들을 구현할 수 있다. 상기 메모리(1010b)는 상기 프로세서(1020b)와 연결되고, 다양한 형태의 정보 및/또는 명령을 저장할 수 있다. 상기 송수신기(1031b)는 상기 프로세서(1020b)와 연결되고, 무선 시그널을 송수신하도록 제어 될 수 있다. 상기 메모리(1010a) 및/또는 상기 메모리(1010b)는, 상기 프로세서(1020a) 및/또는 상기 프로세서(1020b)의 내 부 또는 외부에서 각기 연결될 수도 있고, 유선 또는 무선 연결과 같이 다양한 기술을 통해 다른 프로세서에 연 결될 수도 있다. 상기 제 1 장치(100a) 및/또는 상기 제 2 장치(100b)는 하나 이상의 안테나를 가질 수 있다. 예를 들어, 안테나 (1036a) 및/또는 안테나(1036b)는 무선 신호를 송수신하도록 구성될 수 있다. 도 11a 및 도 11b는 도 10에 도시된 송수신기의 상세 블록도이다. 도 11a는 도 10에 도시된 송수신기에서 송신기능을 담당하는 부분, 즉 송신부의 구성을 나타낸다. 상기 송신부는 SP(serial to parallel) 변환부와, 인코더와, IFFT(Inverse Fast Fourier Transform)와, DAC(Digital to analog converter)와 그리고 합성기를 포함한다. 상기 SP 변환부는 상기 입력 데이터 시퀀스를 병렬로 변환한다. 상기 인코더는 상기 병렬로 변환된 입력 데이터를 인코딩하여 생성된 심볼을 출력한다. 상기 IFFT는 상기 심볼에 대해 IFFT를 수행하여 시간 영역의 기본 대역(baseband) 신호를 출력한다. 상기 DAC는 상기 기본 대역 신호를 아날로그로 변환한다. 상기 합성기는 상기 아날로그로 변환된 신호를 반송파(fc)와 합성하여 전송한다. 상기 인코더는 인공지능을 위한 DNN(Deep neural network)으로 구현될 수 있다. 도 10b는 도 10에 도시된 송수신기에서 수신기능을 담당하는 부분, 즉 수신부의 구성을 나타낸다. 상기 수신부는 합성기와, ADC(Analog to Digital Coinventor), FFT(Fast Fourier Transform), 디코더 그리고 PS(Parallel to Serial) 변환부를 포함한다. 상기 합성기는 수신 신호에서 반송파를 제거한다. 상기 FFT는 반송 파가 제거된 수신 신호에 대해서 시간 영역을 주파수 영역으로 변환하는 역할을 수행한다. 상기 디코더는 상기 주파수 영역으로 변환된 수신 신호를 디코딩한다. 상기 디코더는 인공지능을 위한 DNN(Deep neural network)으로 구현될 수 있다. 이상에서 설명한 바와 같이, 본 명세서의 개시에 따르면, 상기 인코더 및 디코더는 인공지능을 위한 DNN으로 구 현될 수 있다. 도 12는 인공지능을 위한 DNN의 개념을 나타낸 예시도이다. 도 12에 도시된 바와 같이 인공 지능을 위한 DNN은 입력 계층, 은닉 계층, 출력 계층을 포함할 수 있다. 상기 입력 계층, 상기 은닉 계층 그리고 상기 출력 계층 각각은 복수의 노드(node)를 포함할 수 있다. I. 제1 개시 도 13은 본 명세서의 제 1개시에 따른 방안을 나타낸 예시도이다. 도 13을 참조하면, UE 또는 기지국은 데이터 송수신을 위해 인코딩 또는 디코딩과정을 수행할 수 있다. 상기 UE 또는 상기 기지국은 상기 인코딩 또는 디코딩 과정에 인공지능(artificial intelligence: AI)을 적용할 수 있다. AI분야가 발달하면서 해당 기술에 대한 적용분야도 확장되고 있다. 인코딩 또는 디코딩 과정에 AI를 적용 하므로써, peak-to-average power ratio (PAPR)을 줄여 효율적인 데이터 송수신을 가능하게 한다. 도 3에서 전술한 것과 같이 전원이 켜진(power on) 후 UE는 기지국으로부터 동기 신호, 즉 PSS(Primary Synch Signal), SSS(Secondary Synch Signal)를 수신하고, 상기 동기 신호를 통해 셀 ID를 획득함으로써, 셀을 식별 할 수 있다. 이어서, 상기 UE는 기준 신호, 예컨대 CSI-RS를 통해 RSRP(Reference Signal Received Power) 및 RSRQ(Reference Signal Received Quality)와 같은 신호 강도와 CQI(channel quality information), PMI(precoding matrix indicator), RI(rank indicator)와 같은 피드백 정보를 산출할 수 있다. UE는 기지국으로부터 시스템 정보, 예컨대 MIB(Master Information Block) 및 SIB(system information block) 를 수신한다. 상기 MIB는 PBCH(physical broadcast channel)를 통해 수신될 수 있고, 상기 SIB는 PDSCH(Physical Downlink Shared Channel)를 통해 수신될 수 있다. UE는 기지국의 셀로 캠프온하고, RRC 연결 을 수립한다. 동기화된 상태에서 기지국은 시스템 정보를 UE로 전송할 수 있다. 상기 시스템 정보는 기지국의 AI 정보를 포함 할 수 있다. 이때 기지국에서 제공하는 상기 AI 정보는 AI 지원가능 종류와 AI 연산 능력치를 포함할 수 있으며, 이것을 등 급으로 표현할 수 있다. 예를 들어 NB AI class A 는 AI를 지원하지 않을 수 있다. NB AI class B 는 최대 3개의 node, 최대 3개의 layer, full connection, CNN 그리고 MIMO receiver 를 지원할 수 있다. NB AI class C 는 최대 10개의 node, 최대 10개의 layer, full connection, CNN/RNN, QAM detector 그리고 MIMO receiver 를 지원할 수 있다. UE는 UE의 능력(capability) 정보를 기지국으로 전송할 수 있다. 상기 UE의 능력 정보는 AI 연산 능력치(지원 가능한 network 종류, layer 수, node 수, connection 방법), AI 연산 가능 종류(채널추정, MIMO 수신, data encoding/decoding, 채널 feedback) 등의 AI 연산 관련 정보를 포함할 수 있다. 이때 UE가 제공하는 UE capability 정보는 AI 지원가능 종류와 AI 연산 능력치를 포함할 수 있으며, 이것을 등 급으로 표현할 수 있다. 예를 들어 NB AI class A 는 AI를 지원하지 않을 수 있다. NB AI class B 는 최대 3개의 node, 최대 3개의 layer, full connection, CNN 그리고 MIMO receiver 를 지원할 수 있다. NB AI class C 는 최대 10개의 node, 최대 10개의 layer, full connection, CNN/RNN, QAM detector 그리고 MIMO receiver 를 지원할 수 있다. 기지국은 적용 환경에 따라 선택적으로 사용될 수 있는 복수의 AI 파라미터 세트를 가질 수 있다. 기지국은 상기 복수의 AI 파라미터 세트 중 인코딩 또는 디코딩과정에 AI를 적용할 때 이용될 적어도 하나 이상 의 AI 파라미터를 UE로 전송할 수 있다. 상기 AI파라미터는 AI 연산 능력치인 layer 수, node 수, connection 방법 및 network 종류등의 복수의 정보를 포함할 수 있다. UE가 상기 AI 파라미터를 수신한 뒤에, 기지국은 AI 적용 명령을 전송할 수 있다. UE와 기지국은 상기 AI 적용 명령에 의해 상기 AI 파라미터를 이용하여 인코딩 또는 디코딩과정에서 AI를 적용 할 수 있다. 도 14는 본 명세서의 제 2개시에 따른 방안을 나타낸 예시도이다. 도 14를 참조하면, UE가 power on되고 동기화된 상태에서 기지국은 시스템 정보를 UE로 전송할 수 있다. 상기 시스템 정보는 기지국의 AI 정보를 포함할 수 있다. UE는 UE의 능력(capability) 정보를 기지국으로 전송할 수 있다. 상기 UE의 능력 정보는 AI 연산 능력치, AI 연 산 가능 종류등의 AI 연산 관련 정보를 포함할 수 있다. 기지국이 상기 UE의 능력(capability) 정보를 수신한 뒤에, UE는 AI 적용 요청을 기지국에 전송할 수 있다. 기지국은 적용 환경에 따라 선택적으로 사용될 수 있는 복수의 AI 파라미터 세트를 가질 수 있다. 기지국은 상기 복수의 AI 파라미터 세트 중 인코딩 또는 디코딩과정에 AI를 적용할 때 이용될 적어도 하나 이상 의 AI 파라미터를 UE로 전송할 수 있다. 상기 AI파라미터는 AI 연산 능력치인 layer 수, node 수, connection 방법 및 network 종류등의 복수의 정보를 포함할 수 있다. 그러면 기지국과 UE는 상기 AI 파라미터를 이용하여 인코딩 또는 디코딩과정에 AI를 적용 할 수 있다. 도 15는 본 명세서의 제 3개시에 따른 방안을 나타낸 예시도이다. 도 15를 참조하면, UE와 기지국이 데이터 송수신에 필요한 인코딩 또는 디코딩에 AI파라미터를 적용한 후에, 먼 저 UE에 데이터 송수신에 AI를 적용할지 혹은 적용을 중지할지에 대하여 결정하는 기준값으로 기준오차 (offset1)를 먼저 설정해 놓을 수 있다. UE와 기지국은 인코딩 또는 디코딩에 AI를 적용하여 데이터를 송수신하는 과정에서, 기지국으로부터 수신된 데 이터에 대한 측정을 수행할 수 있다. 상기 측정 대상으로는 RSRP(Reference signal received power), 수신된 전파 신호의 세기(Received Signal Strength Intensity: RSSI) 및 신호대잡음비(Signal to Noise Ratio: SNR) 등이 될수 있으며, 그 외 품질에 관한 측정을 포함할 수 있다. UE는 AI를 적용하여 데이터 수신했을 때의 RSRP, RSSI, SNR을 측정할 수 있다. AI를 적용하지 않고 데이터 수신 했을 때의 RSRP, RSSI, SNR의 측정할 수 있다. UE는 전술한 측정값의 차이를 산출할 수 있다. 상기 산출된 차이 값이 상기 기준오차(offset1)를 초과한 경우에는 UE는 AI stop 요청을 기지국으로 전송할 수 있다. 그러면 UE 와 기지국은 인코딩 또는 디코딩에 AI를 적용하는 것을 중지하고 데이터를 송수신할 수 있다. 기준오차에 관한 식은 다음과 같다. g (RS) + offset1 > g (SAI) 인코딩 또는 디코딩에 AI를 적용하기에 UE의 운영 상황에 무리가 있는 경우에는 별도의 AI update 요청을 기지 국에 전송하지 않을 수 있다. 상기 UE의 운영 상황에 무리가 따르는 경우로는 전력소모가 심한경우, 메모리가 부족한 경우등이 있을 수 있다. UE가 다시 운영 상황에 무리가 없는 경우가 되면, 후술할 제 4개시와 같은 단계를 거쳐 UE와 기지국이 인코딩 또는 디코딩에 AI를 적용하여 데이터 송수신을 할 수 있다. 도 16은 본 명세서의 제 4개시에 따른 방안을 나타낸 예시도이다. 도 16을참조하면, UE와 기지국이 데이터 송수신에 필요한 인코딩 또는 디코딩에 AI파라미터를 적용한 후에, UE 에 데이터 송수신에 AI를 적용할지 혹은 적용을 중지할지에 대하여 결정하는 기준값으로 기준오차(offset1)를 먼저 설정해 놓을 수 있다. UE와 기지국은 인코딩 또는 디코딩에 AI를 적용하여 데이터를 송수신하는 과정에서, 기지국으로부터 수신된 데 이터에 대한 측정을 수행할 수 있다. 상기 측정 대상으로는 RSRP(Reference signal received power), 수신된 전파 신호의 세기(Received Signal Strength Intensity: RSSI) 및 신호대잡음비(Signal to Noise Ratio: SNR) 등이 될수 있으며, 그 외 품질에 관한 측정을 포함할 수 있다. UE는 AI를 적용하여 데이터 수신했을 때의 RSRP, RSSI, SNR을 측정할 수 있다. AI를 적용하지 않고 데이터 수신 했을 때의 RSRP, RSSI, SNR의 측정할 수 있다. UE는 전술한 측정값의 차이를 산출할 수 있다. 상기 산출된 차이 값이 상기 기준오차(offset1)를 초과한 경우에는 UE는 AI stop 요청을 기지국으로 전송할 수 있다. 그러면 UE 와 기지국은 인코딩 또는 디코딩에 AI를 적용하는 것을 중지하고 데이터를 송수신할 수 있다. 기준오차에 관한 식은 다음과 같다.g (RS) + offset1 > g (SAI) 인코딩 또는 디코딩에 AI를 적용하기에 UE의 운영 상황에 무리가 없는 경우, UE는 AI update 요청을 기지국으로 전송할 수 있다. 기지국은 적용 환경에 따라 선택적으로 사용될 수 있는 복수의 AI 파라미터 세트를 가질 수 있다. AI update 요청에 의해 기지국은 상기 복수의 AI 파라미터 세트 중 인코딩 또는 디코딩과정에 AI를 적용할 때 이용될 적어도 하나 이상의 새로운 AI 파라미터를 UE로 전송할 수 있다. 상기 새로운 AI파라미터는 AI 연산 능 력치인 layer 수, node 수, connection 방법 및 network 종류등의 복수의 정보를 포함할 수 있다. UE와 기지국은 인코딩 또는 디코딩에 새로운 AI파라미터를 이용하여 AI를 다시 적용할 수 있다. 그러면 다시 UE와 기지국은 인코딩 또는 디코딩에 AI를 적용하여 데이터를 송수신할 수 있다. 도 17은 본 명세서의 제 5개시에 따른 방안을 나타낸 예시도이다. 도 17을 참조하면, UE와 기지국이 데이터 송수신에 필요한 인코딩 또는 디코딩에 AI파라미터를 적용한 후에, 기 지국은 AI 환경이 변화된 것을 감지할 수 있다. AI 환경의 변화는 후술할 도 18, 도 19의 경우를 포함할 수 있 다. 기지국은 UE에 AI stop command를 전송할 수 있다. 그러면 UE와 기지국은 인코딩 또는 디코딩에 AI의 적용을 멈 추고 데이터 송수신을 할 수 있다. 도 18은 본 명세서의 제 6개시에 따른 방안을 나타낸 예시도이다. 도 18을 참조하면, UE와 기지국이 데이터 송수신에 필요한 인코딩 또는 디코딩에 AI파라미터를 적용한 후에, UE 가 채널 상태 정보(Channel Status Information: CSI)를 측정하여 측정값을 기지국으로 전송할 수 있다. CSI는 전송 소스에서 수신 소스까지의 통신 연결 상태를 말하는 것이다. AI 학습 결과는 채널 상황에 따라 달라 질 수 있기 때문에 이에 대한 변화를 인지하는 것이 중요하다. 이를 위하여 기존의 CSI정보(SNR, PMI, rank) 이외에 채널 지연 특성(RMS delay spread)에 대한 정보를 추가하여 채널 상황을 인지할 수 있다. 기지국은 CSI측정값을 수신하여 AI환경이 변화하여 UE와 기지국의 통신 채널상태가 변화하여 기존의 AI파라미터 를 이용하여 데이터 송수신하는것이 적절하지 않음을 판단할 수 있다. 기지국은 UE로 AI stop command를 전송할 수 있다. 그러면 UE와 기지국은 인코딩 또는 디코딩에 AI의 적용을 멈추고 데이터 송수신을 할 수 있다. 도 19는 본 명세서의 제 7개시에 따른 방안을 나타낸 예시도이다. 먼저, 기지국은 HARQ 방식으로 데이터를 UE에게 전송하기 위해서 PDCCH (Physical Downlink Control CHannel) 제어채널을 통해서 스케줄링 정보 (Scheduling Information; 이하 스케줄링 정보)를 전송한다. 상기 UE는 상기 제어 채널, 즉 PDCCH을 모니터링(Monitoring) 해서, 자신에게 오는 스케줄링 정보를 확인한다. 상기 스케줄링 정보의 확인에 따라 자신에 대한 정보가 있는 것으로 확인되면, UE는 PDCCH와 연관된 시점에서 공용 채널(PSCH: Physical Shared Channel)을 통해 기지국으로부터 데이터들을 수신한다 도 19를 참조하면, UE와 기지국이 데이터 송수신에 필요한 인코딩 또는 디코딩에 AI파라미터를 적용한 후에, UE 는 기지국으로부터 수신한 데이터에 대하여 AI파라미터를 이용하여 디코딩을 수행할 수 있다. UE는 디코딩에 성 공하면 HARQ(hybrid automatic repeat request) ACK(acknowledgement) 신호를, 실패하면 NACK(Negative- acknowledgement) 신호를 기지국으로 전송할 수 있다. 기지국은 HARQ ACK신호를 수신하면 UE로의 데이터 전송이 성공했음을 감지하고 다음 데이터를 전송할 수 있다. 그러나 기지국이 HARQ NACK신호를 수신하면 UE로의 데이터 전송이 실패했음을 감지할 수 있다. 즉 기지국은 CSI 측정값을 수신하여 AI환경이 변화하여 UE와 기지국의 통신 채널상태가 변화하여 기존의 AI파라미터를 이용하여 데이터 송수신하는것이 적절하지 않음을 판단할 수 있다. 기지국은 UE로 AI stop command를 전송할 수 있다. 그 러면 UE와 기지국은 인코딩 또는 디코딩에 AI의 적용을 멈추고 데이터 송수신을 할 수 있다. 그리고 기지국은 다시 디코딩에 실패한 데이터를 다시 UE로 전송할 수 있다. 그러면 UE는 상기 데이터를 수신하 고, AI를 적용하지 않고 인코딩을 진행할 수 있다. 도 20은 본 명세서의 제 8개시에 따른 방안을 나타낸 예시도이다. 도 20을 참조하면, UE와 기지국이 데이터 송수신에 필요한 인코딩 또는 디코딩에 AI파라미터를 적용한 후에, 도 17, 도 18 및 도19에서 전술한 것과 같이 기지국이 AI환경의 변화를 감지하여 UE와 기지국이 데이터 송수신에 필요한 인코딩 또는 디코딩에 AI파라미터의 적용을 중지할 수 있다. 기지국은 적용 환경에 따라 선택적으로 사용될 수 있는 복수의 AI 파라미터 세트를 가질 수 있다. 새로운 AI 파라미터를 적용하여 인코딩 또는 디코딩에 AI를 적용해도 데이터 송수신하는 것에 무리가 없는 경우, 기지국은 상기 복수의 AI 파라미터 세트 중 인코딩 또는 디코딩과정에 AI를 적용할 때 이용될 적어도 하 나 이상의 새로운 AI 파라미터를 UE로 전송할 수 있다. 상기 AI파라미터는 AI 연산 능력치인 layer 수, node 수, connection 방법 및 network 종류등의 복수의 정보를 포함할 수 있다. 기지국은 업데이트된 새로운 AI 파라미터의 적용을 명령하는 신호를 전송할 수 있다. UE와 기지국은 인코딩 또 는 디코딩에 상기 새로운 AI 파라미터를 이용하여 AI를 적용할 수 있다. 그러면 UE와 기지국은 인코딩 또는 디코딩에 AI를 다시 적용하여 데이터를 송수신할 수 있다. <본 명세서의 개시가 적용될 수 있는 예시 일반> 이하, 위와 같은 본 명세서의 개시가 적용될 수 있는 장치에 대하여 설명한다. 도 21은 본 명세서의 개시가 구현된 프로세서의 구성 블록도를 나타낸다. 도 18을 참조하여 알 수 있는 바와 같이, 본 명세서의 개시가 구현된 프로세서은 본 명세서에서 설명된 제안된 기능, 절차 및/ 또는 방법을 구현하기 위해, 복수의 회로(circuitry)를 포함할 수 있다. 예컨대, 상기 프로세서은 제1 회로(1020-1), 제2 회로(1020-2) 그리고 제3 회로(1020-3)를 포함할 수 있다. 또한, 도 시되지는 않았으나, 상기 프로세서은 더 많은 회로를 포함할 수 있다. 각 회로는 복수의 트랜지시터를 포 함할 수 있다. 상기 프로세서는 ASIC(application-specific integrated circuit) 또는 AP(application processor)로 불 릴 수 있으며, DSP(digital signal processor), CPU(central processing unit), GPU(graphics processing unit) 중 적어도 하나를 포함할 수 있다. 도 22은 일 실시예에 따른 단말의 구성을 나타낸 블록도이다. 특히, 도 22에서는 앞서 도 21의 단말을 보다 상세히 예시하는 도면이다. 단말은 메모리, 프로세서, 송수신기, 전력 관리 모듈, 배터리, 디스플레이 , 입력부, 스피커 및 마이크, SIM(subscriber identification module) 카드, 하나 이 상의 안테나를 포함한다. 프로세서는 본 명세서에서 설명된 제안된 기능, 절차 및/ 또는 방법을 구현하도록 구성될 수 있다. 무선 인터페이스 프로토콜의 계층들은 프로세서에서 구현될 수 있다. 프로세서는 ASIC(application- specific integrated circuit), 다른 칩셋, 논리 회로 및/또는 데이터 처리 장치를 포함할 수 있다. 프로세서 는 AP(application processor)일 수 있다. 프로세서는 DSP(digital signal processor), CPU(central processing unit), GPU(graphics processing unit), 모뎀(Modem; modulator and demodulator) 중 적어도 하나를 포함할 수 있다. 프로세서의 예는 Qualcomm®에 의해 제조된 SNAPDRAGONTM 시리즈 프로세 서, Samsung®에 의해 제조된 EXYNOSTM 시리즈 프로세서, Apple®에 의해 제조된 A 시리즈 프로세서, MediaTek ®에 의해 제조된 HELIOTM 시리즈 프로세서, INTEL®에 의해 제조된 ATOMTM 시리즈 프로세서 또는 대응하는 차 세대 프로세서일 수 있다. 전력 관리 모듈은 프로세서 및/또는 송수신기에 대한 전력을 관리한다. 배터리는 전력 관리 모듈에 전력을 공급한다. 디스플레이는 프로세서에 의해 처리된 결과를 출력한다. 입력 부는 프로세서에 의해 사용될 입력을 수신한다. 입력부는 디스플레이 상에 표시될 수 있다. SIM 카드는 휴대 전화 및 컴퓨터와 같은 휴대 전화 장치에서 가입자를 식별하고 인증하는 데에 사용되는 IMSI(international mobile subscriber identity) 및 그와 관련된 키를 안전하게 저장하기 위하여 사용되는 집적 회로이다. 많은 SIM 카드에 연락처 정보를 저장할 수도 있다. 메모리는 프로세서와 동작 가능하게 결합되고, 프로세서를 동작시키기 위한 다양한 정보를 저 장한다. 메모리는 ROM(read-only memory), RAM(random access memory), 플래시 메모리, 메모리 카드, 저 장 매체 및/또는 다른 저장 장치를 포함할 수 있다. 실시예가 소프트웨어로 구현되는 경우, 본 명세서에서 설명 된 기술들은 본 명세서에서 설명된 기능을 수행하는 모듈(예컨대, 절차, 기능 등)로 구현될 수 있다. 모듈은 메 모리에 저장될 수 있고 프로세서에 의해 실행될 수 있다. 메모리는 프로세서 내부에 구현될 수 있다. 또는, 메모리는 프로세서 외부에 구현될 수 있으며, 기술 분야에서 공지된 다양한 수단을 통해 프로세서에 통신 가능하게 연결될 수 있다. 송수신기는 프로세서와 동작 가능하게 결합되고, 무선 신호를 송신 및/또는 수신한다. 송수신기 는 전송기와 수신기를 포함한다. 송수신기는 무선 주파수 신호를 처리하기 위한 기저 대역 회로를 포함할 수 있다. 송수신부는 무선 신호를 송신 및/또는 수신하도록 하나 이상의 안테나을 제어한다. 프로세서 는 통신을 개시하기 위하여 예를 들어, 음성 통신 데이터를 구성하는 무선 신호를 전송하도록 명령 정보 를 송수신기에 전달한다. 안테나는 무선 신호를 송신 및 수신하는 기능을 한다. 무선 신호를 수신할 때, 송수신기은 프로세서에 의해 처리하기 위하여 신호를 전달하고 기저 대역으로 신호를 변환할 수 있 다. 처리된 신호는 스피커를 통해 출력되는 가청 또는 가독 정보로 변환될 수 있다. 스피커는 프로세서에 의해 처리된 소리 관련 결과를 출력한다. 마이크는 프로세서에 의해 사용될 소리 관련 입력을 수신한다. 사용자는 예를 들어, 입력부의 버튼을 누르거나(혹은 터치하거나) 또는 마이크를 이용한 음성 구동 (voice activation)에 의해 전화 번호 등과 같은 명령 정보를 입력한다. 프로세서는 이러한 명령 정보를 수신하고, 전화 번호로 전화를 거는 등 적절한 기능을 수행하도록 처리한다. 구동 상의 데이터(operational data)는 심카드 또는 메모리로부터 추출할 수 있다. 또한, 프로세서는 사용자가 인지하고 또한 편 의를 위해 명령 정보 또는 구동 정보를 디스플레이 상에 디스플레이할 수 있다.도면 도면1 도면2 도면3 도면4 도면5a 도면5b 도면5c 도면6 도면7 도면8 도면9 도면10 도면11a 도면11b 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22"}
{"patent_id": "10-2020-0034034", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 무선 통신 시스템이다. 도 2는 3GPP LTE에서 FDD에 따른 무선 프레임(radio frame)의 구조를 나타낸다. 도 3은 초기 접속 과정을 나타낸 예시적으로 흐름도이다. 도 4는 기지국과 단말 간의 HARQ의 동작을 나타낸 예시도이다. 도 5a 내지 도 c는 차세대 이동통신의 서비스를 위한 예시적인 아키텍처를 나타낸 예시도들이다. 도 6은 NR에서의 서브프레임 유형의 예를 도시한다. 도 7은 NR에서 SS 블록의 예를 나타낸 예시도이다. 도 8은 NR에서 빔 스위핑의 예를 나타낸 예시도이다. 도 9는 일반적인 통신절차를 나타낸 예시도이다. 도 10은 본 명세서의 개시를 구현하기 위한 따른 무선 통신 시스템을 나타낸다. 도 11a 및 도 11b는 도 10에 도시된 송수신기의 상세 블록도이다. 도 12는 인공지능을 위한 DNN의 개념을 나타낸 예시도이다. 도 13은 본 명세서의 제 1개시에 따른 방안을 나타낸 예시도이다. 도 14는 본 명세서의 제 2개시에 따른 방안을 나타낸 예시도이다. 도 15는 본 명세서의 제 3개시에 따른 방안을 나타낸 예시도이다. 도 16은 본 명세서의 제 4개시에 따른 방안을 나타낸 예시도이다. 도 17은 본 명세서의 제 5개시에 따른 방안을 나타낸 예시도이다. 도 18은 본 명세서의 제 6개시에 따른 방안을 나타낸 예시도이다. 도 19는 본 명세서의 제 7개시에 따른 방안을 나타낸 예시도이다. 도 20은 본 명세서의 제 8개시에 따른 방안을 나타낸 예시도이다. 도 21은 본 명세서의 개시가 구현된 프로세서의 구성 블록도를 나타낸다. 도 22은 일 실시예에 따른 단말의 구성을 나타낸 블록도이다."}
