{"patent_id": "10-2024-7015205", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0116711", "출원번호": "10-2024-7015205", "발명의 명칭": "흐름 애그노스틱 뉴럴 비디오 압축", "출원인": "퀄컴 인코포레이티드", "발명자": "레, 호앙 콩 민"}}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 뉴럴 네트워크(artificial neural network, ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법으로서,상기 ANN에 의해 비디오를 수신하는 단계;상기 ANN에 의해, 상기 비디오의 현재 프레임의 특징들의 제1 세트 및 상기 비디오의 기준 프레임의 특징들의제2 세트를 추출하는 단계;상기 ANN에 의해, 상기 현재 프레임의 특징들의 제1 세트와 상기 기준 프레임의 특징들의 제2 세트 사이의 상관특징들의 추정을 결정하는 단계; 및상기 상관 특징들의 추정을 수신기로 송신하는 단계를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 ANN의 완전 콘볼루션 연산자(fully convolutional operator)들을 통해 상기 상관 특징들의 추정을 결정하는 단계를 추가로 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 기준 프레임은 상기 비디오의 이전 프레임의 재구성을 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 기준 프레임은 상기 비디오의 다수의 선행 프레임들의 재구성들에 기초하여 예측되는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법으로서,상기 ANN에 의해, 비디오의 기준 프레임을 수신하는 단계;상기 ANN에 의해, 상기 비디오의 현재 프레임과 상기 비디오의 기준 프레임 사이의 상관 특징들의 추정을 수신하는 단계;상기 ANN에 의해, 상기 비디오의 기준 프레임의 특징들의 제1 세트를 추출하는 단계;상기 ANN에 의해, 상기 상관 특징들의 추정을 디코딩하는 단계; 및상기 ANN에 의해, 상기 비디오의 기준 프레임의 특징들의 제1 세트 및 상기 상관 특징들의 디코딩된 추정에 기초하여 상기 비디오의 현재 프레임의 예측을 생성하는 단계를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의 예측 사이의 차이에 기초하여 잔차를 컴퓨팅하는 단계; 및상기 현재 프레임의 예측 및 상기 잔차에 기초하여 상기 비디오의 현재 프레임의 재구성을 생성하는 단계를 추가로 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 기준 프레임은 상기 비디오의 다수의 선행 프레임들의 재구성들에 기초하여 예측되는, 프공개특허 10-2024-0116711-3-로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법으로서,상기 ANN에 의해, 비디오의 다수의 프레임들의 이력을 수신하는 단계;상기 ANN에 의해, 상기 비디오의 다수의 프레임들의 이력으로부터 기준 프레임을 생성하는 단계;상기 ANN에 의해, 상기 비디오의 기준 프레임 및 현재 프레임에 기초하여 상기 비디오의 현재 프레임의 예측을생성하는 단계; 및상기 ANN에 의해, 상기 비디오의 현재 프레임의 예측, 및 상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의 예측 사이의 차이에 기초하여 컴퓨팅된 잔차에 기초하여 상기 현재 프레임의 재구성을 생성하는 단계를포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 이력은 복수의 이전에 디코딩된 프레임들을 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의 예측 사이의 상기 차이를 인코딩하고, 상기 인코딩을 상기 현재 프레임의 예측에 추가하는 단계를 추가로 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 장치로서,메모리; 및상기 메모리에 커플링된 적어도 하나의 프로세서를 포함하며, 상기 적어도 하나의 프로세서는,상기 ANN에 의해 비디오를 수신하도록;상기 ANN에 의해, 상기 비디오의 현재 프레임의 특징들의 제1 세트 및 상기 비디오의 기준 프레임의 특징들의제2 세트를 추출하도록;상기 ANN에 의해, 상기 현재 프레임의 특징들의 제1 세트와 상기 기준 프레임의 특징들의 제2 세트 사이의 상관특징들의 추정을 결정하도록; 그리고상기 상관 특징들의 추정을 수신기로 송신하도록 구성되는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 적어도 하나의 프로세서는,상기 ANN의 완전 콘볼루션 연산자들을 통해 상기 상관 특징들의 추정을 결정하도록 추가로 구성되는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 기준 프레임은 상기 비디오의 이전 프레임의 재구성을 포함하는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 적어도 하나의 프로세서는, 상기 비디오의 다수의 선행 프레임들의 재구성들에 기초하여상기 기준 프레임을 예측하도록 추가로 구성되는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 장치로서,메모리; 및공개특허 10-2024-0116711-4-상기 메모리에 커플링된 적어도 하나의 프로세서를 포함하며, 상기 적어도 하나의 프로세서는,비디오의 기준 프레임을 수신하도록;상기 비디오의 현재 프레임과 상기 비디오의 기준 프레임 사이의 상관 특징들의 추정을 수신하도록;상기 비디오의 기준 프레임의 특징들의 제1 세트를 추출하도록;상기 상관 특징들의 추정을 디코딩하도록; 그리고상기 비디오의 기준 프레임의 특징들의 제1 세트 및 상기 상관 특징들의 디코딩된 추정에 기초하여 상기 비디오의 현재 프레임의 예측을 생성하도록 구성되는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 적어도 하나의 프로세서는,상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의 예측 사이의 차이에 기초하여 잔차를 컴퓨팅하도록;그리고상기 현재 프레임의 예측 및 상기 잔차에 기초하여 상기 비디오의 현재 프레임의 재구성을 생성하도록 추가로구성되는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 적어도 하나의 프로세서는, 상기 비디오의 다수의 선행 프레임들의 재구성들에 기초하여상기 기준 프레임을 예측하도록 추가로 구성되는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 장치로서,메모리; 및상기 메모리에 커플링된 적어도 하나의 프로세서를 포함하며, 상기 적어도 하나의 프로세서는,상기 ANN에 의해, 비디오의 다수의 프레임들의 이력을 수신하도록;상기 ANN에 의해, 상기 비디오의 다수의 프레임들의 이력으로부터 기준 프레임을 생성하도록;상기 ANN에 의해, 상기 비디오의 기준 프레임 및 현재 프레임에 기초하여 상기 비디오의 현재 프레임의 예측을생성하도록; 그리고상기 ANN에 의해, 상기 비디오의 현재 프레임의 예측, 및 상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의 예측 사이의 차이에 기초하여 컴퓨팅된 잔차에 기초하여 상기 현재 프레임의 재구성을 생성하도록 구성되는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 이력은 복수의 이전에 디코딩된 프레임들을 포함하는, 장치."}
{"patent_id": "10-2024-7015205", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서, 상기 적어도 하나의 프로세서는, 상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의예측 사이의 차이를 인코딩하고, 상기 인코딩을 상기 현재 프레임의 예측에 추가하도록 추가로 구성되는, 장치."}
{"patent_id": "10-2024-7015205", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법은 ANN을 통해 비디오를 수신하는 단계를 포함한다. ANN은 비디오의 현재 프레임의 특징들의 제1 세트 및 비디오의 기준 프레임의 특징들의 제2 세트를 추출한다. ANN은 현재 프레임의 특징들의 제1 세트와 기준 프레임의 특징들의 제2 세트 사이의 상관 특 징들의 추정을 결정한다. 상관 특징들의 추정은 인코딩되고 수신기로 송신된다."}
{"patent_id": "10-2024-7015205", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원의 교차 참조 본 출원은 \"FLOW-AGNOSTIC NEURAL VIDEO COMPRESSION\"이라는 발명의 명칭으로 2021년 11월 30일자로 출원된 미 국 가특허출원 제63/284,569호에 대한 이익을 주장하는, \"FLOW-AGNOSTIC NEURAL VIDEO COMPRESSION\"이라는 발명의 명칭으로 2022년 10월 27일자 출원된 미국 특허출원 제17/975,471호에 대한 우선권을 주장하고, 이들의 개 시내용들은 그들 전체가 참조로 명백히 통합된다."}
{"patent_id": "10-2024-7015205", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "기술분야 본 개시내용의 양태들은 대체적으로 뉴럴 네트워크(neural network)들에 관한 것으로, 보다 구체적으로는 인공 뉴럴 네트워크(artificial neural network, ANN)들을 사용하는 비디오 압축에 관한 것이다."}
{"patent_id": "10-2024-7015205", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 뉴럴 네트워크들은 인공 뉴런들의 상호 연결된 그룹들(예컨대, 뉴런 모델들)을 포함할 수 있다. 인공 뉴 럴 네트워크는 컴퓨테이셔널 디바이스(computational device)이거나, 컴퓨테이셔널 디바이스에 의해 수행될 방 법으로 표현될 수 있다. 콘볼루션 뉴럴 네트워크(Convolutional neural network, CNN)들은 피드-포워드(feed- forward) 인공 뉴럴 네트워크의 일 타입이다. 콘볼루션 뉴럴 네트워크들은, 각각이 수용 필드를 갖고 집합적으 로 입력 공간을 타일링(tiling)하는 뉴런들의 집합들을 포함할 수 있다. 콘볼루션 뉴럴 네트워크(CNN)들, 이를 테면 심층 콘볼루션 뉴럴 네트워크(deep convolutional neural network, DCN)들은 수많은 애플리케이션들을 갖 는다. 특히, 이러한 뉴럴 네트워크 아키텍처들은 이미지 인식, 패턴 인식, 음성 인식, 자율 주행 및 다른 분류 작업들과 같은 다양한 기술들에서 사용된다. 뉴럴 네트워크들은 비디오 압축 및 이미지 압축과 같은 멀티미디어 압축에서 성공적인 애플리케이션을 갖는다. 이미지 압축은 이미지들 및 비디오들과 같은 멀티미디어를 통신하는 데 유용하다. 그러나, 사용자들은 상이한 컴퓨트 능력들을 갖는 상이한 컴퓨터 아키텍처들을 가질 수 있고, 상이한 네트워크 조건들 하에서 그러한 디바 이스들을 동작시키고 있을 수 있다. 종래의 뉴럴 비디오 압축 방법들은 모션 보상을 위해 흐름 기반 워핑 (flow-based warping)을 활용한다. 그러나, 흐름 기반 워핑은 제한된 리소스들을 가질 수 있는 모바일 디바이 스들에 대해서는 효율적이지 않을 수 있다. 본 개시내용은 독립 청구항들에서 각각 제시된다. 본 개시내용의 일부 양태들에 종속 청구항들에서 기술된다. 본 개시내용의 일 양태에서, 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법이 제 공된다. 본 방법은, ANN에 의해 비디오를 수신하는 단계를 포함한다. 본 방법은 또한, ANN에 의해, 비디오의 현재 프레임의 특징들의 제1 세트 및 비디오의 기준 프레임의 특징들의 제2 세트를 추출하는 단계를 포함한다. 추가적으로, 본 방법은, ANN에 의해, 현재 프레임의 특징들의 제1 세트와 기준 프레임의 특징들의 제2 세트 사 이의 상관 특징들의 추정을 결정하는 단계를 포함한다. 추가로, 본 방법은, 상관 특징들의 추정을 수신기로 송 신하는 단계를 포함한다. 본 개시내용의 일 양태에서, 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 장치가 제공된다. 본 장 치는, 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함한다. 프로세서(들)는, ANN에 의해 비디오 를 수신하도록 구성된다. 프로세서(들)는 또한, ANN에 의해, 비디오의 현재 프레임의 특징들의 제1 세트 및 비 디오의 기준 프레임의 특징들의 제2 세트를 추출하도록 구성된다. 추가적으로, 프로세서(들)는, ANN에 의해, 현재 프레임의 특징들의 제1 세트와 기준 프레임의 특징들의 제2 세트 사이의 상관 특징들의 추정을 결정하도록 구성된다. 추가로, 프로세서(들)는 상관 특징들의 추정을 수신기로 송신하도록 구성된다. 본 개시내용의 일 양태에서, 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법이 제 공된다. 본 방법은, ANN에 의해, 비디오의 기준 프레임 및 비디오의 현재 프레임과 비디오의 기준 프레임 사이 의 상관 특징들의 추정을 수신하는 단계를 포함한다. 본 방법은 또한, ANN에 의해, 비디오의 기준 프레임의 특 징들의 제1 세트를 추출하는 단계를 포함한다. 추가적으로, 본 방법은, ANN에 의해, 상관 특징들의 추정을 디 코딩하는 단계를 포함한다. 추가로, 본 방법은, ANN에 의해, 비디오의 기준 프레임의 특징들의 제1 세트 및 상 관 특징들의 디코딩된 추정에 기초하여 비디오의 현재 프레임의 예측을 생성하는 단계를 포함한다. 본 개시내용의 일 양태에서, 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 장치가 제공된다. 본 장 치는, 메모리 및 메모리에 커플링된 하나 이상의 프로세서들을 포함한다. 프로세서(들)는, ANN에 의해, 비디오 의 기준 프레임 및 비디오의 현재 프레임과 비디오의 기준 프레임 사이의 상관 특징들의 추정을 수신하도록 구 성된다. 프로세서(들)는 또한, ANN에 의해, 비디오의 기준 프레임의 특징들의 제1 세트를 추출하도록 구성된다. 추가적으로, 프로세서(들)는, ANN에 의해, 상관 특징들의 추정을 디코딩하도록 구성된다. 추가로,프로세서(들)는, ANN에 의해, 비디오의 기준 프레임의 특징들의 제1 세트 및 상관 특징들의 디코딩된 추정에 기 초하여 비디오의 현재 프레임의 예측을 생성하도록 구성된다. 본 개시내용의 추가적인 특징들 및 이점들은 이하에서 설명될 것이다. 본 개시내용이 본 개시내용의 동일한 목 적들을 수행하기 위해 다른 구조들을 수정 또는 설계하기 위한 기초로서 쉽게 이용될 수 있다는 것이 당업자에 의해 인식되어야 한다. 또한, 이러한 등가의 구성들은 첨부된 청구항들에 기재된 바와 같은 본 개시내용의 교 시들로부터 벗어나지 않는다는 것이 당업자에 의해 인식되어야 한다. 본 개시내용의 특징인 것으로 여겨지는 신규한 특징들은, 추가적인 목적들 및 이점들과 함께, 그것의 구성 및 동작 방법 양자에 관하여, 첨부 도면들과 관련하여 고려될 때 이하의 설명으로부터 더 잘 이해될 것이다. 그러나, 도면들 각각은 단지 예시 및 설명의 목적을 위해 제공되고, 본 개시내용의 제한들의 정의로서 의도되지 않는다는 것이 명백하게 이해될 것이다."}
{"patent_id": "10-2024-7015205", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첨부 도면들과 관련하여 아래에 제시되는 상세한 설명은 다양한 구성들의 설명으로 의도되며 설명되는 개념들이 실시될 수 있는 유일한 구성들만을 나타내는 것으로 의도되는 것은 아니다. 상세한 설명은 다양한 개념의 완전 한 이해를 제공할 목적으로 특정 세부사항을 포함한다. 그러나, 이런 개념들이 이런 특정 세부사항들 없이도 실시될 수 있다는 것이 당업자들에게는 자명할 것이다. 일부 경우에서, 잘 알려진 구조 및 컴포넌트는 그러한 개념을 모호하게 하는 것을 회피하기 위해 블록도 형태로 도시된다. 교시들에 기반하여, 당업자는, 본 개시내용의 임의의 다른 양태와 독립적으로 또는 그 양태와 조합하여 구현되 는지에 관계없이, 본 개시내용의 범위가 본 개시내용의 임의의 양태를 커버하도록 의도된다는 것을 인식해야 한 다. 예컨대, 기재된 임의의 수의 양태들을 사용하여 장치가 구현될 수 있거나 방법이 실시될 수 있다. 또한, 본 개시내용의 범위는 제시되는 본 개시내용의 다양한 양태들에 부가하여 또는 그 외에 다른 구조, 기능, 또는 구조와 기능을 사용하여 실시되는 그러한 장치 또는 방법을 커버하는 것으로 의도된다. 개시된 본 개시내용의 임의의 양태가 청구항의 하나 이상의 엘리먼트들에 의해 구현될 수 있다는 것이 이해되어야 한다. 단어 \"예시적인\"은 \"예, 실례, 또는 예시로서 역할을 하는 것\"을 의미하도록 사용된다. \"예시적인\" 것으로서 설명된 임의의 양태가 반드시 다른 양태들에 비해 유리하거나 또는 바람직한 것으로서 해석되어야 하는 것은 아 니다. 특정 양태들이 설명되지만, 이러한 양태들의 많은 변형들 및 치환들이 본 개시내용의 범위 내에 포함된다. 선 호되는 양태들의 일부 이익들 및 이점들이 언급되지만, 본 개시내용의 범위는 특정 이익들, 용도들 또는 목적들 에 국한된 것으로 의도되는 것은 아니다. 그보다, 본 개시내용의 양태들은 다른 기술들, 시스템 구성들, 네트 워크들 및 프로토콜들에 폭넓게 적용될 수 있는 것으로 의도되며, 이들 중 일부는 선호되는 양태들에 대한 하기 의 설명 및 도면들에서 예로서 설명된다. 상세한 설명 및 도면들은 제한하는 것이 아니라 개시물의 단지 예시이고, 개시물의 범위는 첨부된 청구항들 및 그 등가물들에 의해 정의된다. 기술된 바와 같이, 뉴럴 네트워크들은 비디오 압축과 같은 멀티미디어 압축에서 성공적인 애플리케이션을 갖는 다. 종래의 뉴럴 비디오 압축 방법들은 모션 보상을 위해 흐름 기반 워핑을 활용한다. 그러나, 흐름 기반 워 핑은 제한된 리소스들을 가질 수 있는 모바일 디바이스들에 대해서는 효율적이지 않거나 하드웨어 친화적이지 않을 수 있다. 이들 및 다른 어려움들을 해결하기 위해, 본 개시내용의 양태들은 흐름 애그노스틱 뉴럴 비디오 압축에 관한 것 이다. 흐름 기반 워핑을 사용하기보다는, 워핑 연산자들이 완전 콘볼루션 뉴럴 네트워크로 대체될 수 있다. 일부 양태들에서, 완전 콘볼루션 뉴럴 네트워크는 하나 이상의 자동 인코더들로 구성될 수 있다. 자동 인코더 는 라벨링되지 않은 데이터의 코딩을 학습할 수 있고, 입력을 코드로 맵핑하는 인코더 및 코드를 입력의 재구성 으로 맵핑하는 디코더를 포함한다. 도 1은 흐름 애그노스틱 비디오 압축을 제공하기 위해 인공 뉴럴 네트워크(예컨대, 종단간 뉴럴 네트워크)를 동 작시키도록 구성된 CPU(central processing unit) 또는 다중 코어(multi-core) CPU를 포함할 수 있는 SOC의 예시적인 구현예를 예시한다. 변수들(예컨대, 뉴럴 신호들 및 시냅스 가중치들), 컴퓨테이셔널 디 바이스(예컨대, 가중치들을 갖는 뉴럴 네트워크)와 연관된 시스템 파라미터들, 지연들, 주파수 빈(bin) 정보, 및 작업 정보가 NPU(neural processing unit)와 연관된 메모리 블록에, CPU와 연관된 메모리 블록에, GPU(graphics processing unit)와 연관된 메모리 블록에, DSP(digital signal processor)와 연관된 메모리 블록에, 메모리 블록에 저장될 수 있거나, 또는 다수의 블록들에 걸쳐 분산될 수 있다. CPU에서 실행되는 명령들은 CPU와 연관된 프로그램 메모리로부터 로딩될 수 있거나, 또는 메모리 블 록으로부터 로딩될 수 있다. SOC는 또한 특정 기능들에 맞춤화된 추가적인 프로세싱 블록들, 이를테면 GPU, DSP, 5G(fifth generation) 연결, 4G LTE(fourth generation long term evolution) 연결, Wi-Fi 연결, USB 연결, 블루투스 연 결 등을 포함할 수 있는 연결 블록, 및 예컨대 제스처들을 검출 및 인식할 수 있는 멀티미디어 프로세서 를 포함할 수 있다. 일 구현예에서, NPU는 CPU, DSP 및/또는 GPU에서 구현된다. SOC는 또한 센서 프로세서, ISP(image signal processor)들, 및/또는 글로벌 포지셔닝 시스템 을 포함할 수 있는 내비게이션 모듈을 포함할 수 있다. SOC는 ARM 명령 세트에 기반할 수 있다. 본 개시내용의 양태들에서, 범용 프로세서에 로딩된 명령들 은 인공 뉴럴 네트워크(ANN)에 의해 비디오를 수신하기 위한 코드를 포함할 수 있다. 범용 프로세서는 또 한, ANN을 통해, 비디오의 현재 프레임의 특징들의 제1 세트 및 비디오의 기준 프레임의 특징들의 제2 세트를 추출하기 위한 코드를 포함할 수 있다. 범용 프로세서는, ANN에 의해, 현재 프레임의 특징들의 제1 세트 와 기준 프레임의 특징들의 제2 세트 사이의 상관 특징들의 추정을 결정하기 위한 코드를 추가적으로 포함할 수 있다. 범용 프로세서는 상관 특징들의 추정을 수신기로 송신하기 위한 코드를 추가로 포함할 수 있다. 본 개시내용의 다른 양태들에서, 범용 프로세서로 로딩된 명령들은, 인공 뉴럴 네트워크(ANN)에 의해, 비 디오의 기준 프레임, 및 비디오의 현재 프레임과 비디오의 기준 프레임 사이의 상관 특징들의 추정을 수신하기 위한 코드를 포함할 수 있다. 범용 프로세서는 또한, ANN에 의해, 비디오의 기준 프레임의 특징들의 제1 세트를 추출하기 위한 코드를 포함할 수 있다. 범용 프로세서는 ANN에 의해, 상관 특징들의 추정을 디코 딩하기 위한 코드를 추가적으로 포함할 수 있다. 범용 프로세서는, ANN에 의해, 비디오의 기준 프레임의 특징들의 제1 세트 및 상관 특징들의 디코딩된 추정에 기초하여 비디오의 현재 프레임의 예측을 생성하기 위한 코드를 추가로 포함할 수 있다. 본 개시내용의 추가의 양태들에서, 범용 프로세서에 로딩된 명령들은 ANN에 의해, 비디오의 다수의 프레임 들의 이력을 수신하기 위한 코드를 포함할 수 있다. 범용 프로세서는 또한, ANN에 의해, 다수의 프레임들 의 이력으로부터 기준 프레임을 생성하기 위한 코드를 포함할 수 있다. 범용 프로세서는, ANN에 의해, 기 준 프레임 및 현재 프레임에 기초하여 비디오의 현재 프레임의 예측을 생성하기 위한 코드를 추가적으로 포함할 수 있다. 범용 프로세서는, 비디오의 현재 프레임의 예측, 및 비디오의 현재 프레임과 비디오의 현재 프 레임의 예측 사이의 차이에 기초하여 컴퓨팅된 잔차에 기초하여 현재 프레임의 재구성을 생성하기 위한 코드를 추가로 포함할 수 있다. 심층 학습 아키텍처들은 각각의 계층에서 연속적으로 더 높은 추상화 레벨들의 입력들을 나타내도록 학습함으로 써 객체 인식 작업을 수행할 수 있으며, 이에 의해 입력 데이터의 유용한 특징 표현을 설정할 수 있다. 이러한방식으로, 심층 학습은 전통적인 머신 학습의 주요 병목 현상을 해결한다. 심층 학습의 출현 전에, 객체 인식 문제에 대한 머신 학습 접근법은, 아마도 얕은 분류기와 조합하여, 인간 공학 특징들에 크게 의존했을 수 있다. 얕은 분류기는, 예컨대, 2-부류 선형 분류기일 수 있고, 여기서는 특징 벡터 성분들의 가중 합이 임계치와 비교 됨으로써 입력이 어느 부류에 속하는지가 예측될 수 있다. 인간 공학 특징들은 도메인 전문 지식을 갖춘 엔지 니어에 의해서 특정 문제 도메인에 맞게 조정된 템플릿들 또는 커널들일 수 있다. 대조적으로, 심층 학습 아키 텍처들은 그러나, 인간 엔지니어가 설계할 수 있는 것과 유사한 특징들을 나타내기 위해서 훈련을 통해 학습할 수 있다. 게다가, 심층 네트워크는 인간이 고려하지 않았을 수 있는 새로운 타입들의 특징들을 나타내고 인식 하기 위해 학습할 수 있다. 심층 아키텍처는 특징들의 계층 구조(hierarchy)를 학습할 수 있다. 예를 들어, 시각적 데이터가 제시되는 경 우, 제1 계층은 입력 스트림에서 에지들과 같은 비교적 간단한 특징들을 인식하는 것을 학습할 수 있다. 다른 예에서, 청각적 데이터가 제시되는 경우, 제1 계층은 특정 주파수들에서 스펙트럼 파워를 인식하는 것을 학습할 수 있다. 제1 계층의 출력을 입력으로서 취하는 제2 계층은 시각적 데이터에 대한 간단한 형상들 또는 청각적 데이터에 대한 사운드들의 조합들과 같은 특징들의 조합들을 인식하는 것을 학습할 수 있다. 예를 들어, 상위 계층들은 시각적 데이터에서 복잡한 형상들 또는 청각적 데이터에서 워드(word)들을 표현하는 것을 학습할 수 있다. 더 상위 계층들은 일반적인 시각 객체들 또는 구어(spoken phrase)들을 인식하기 위해 학습할 수 있다. 심층 학습 아키텍처는 자연스런 계층 구조를 갖는 문제에 적용될 때 특히 잘 수행될 수 있다. 예를 들어, 전동 차량의 분류는 휠, 윈드실드(windshield), 및 다른 특징을 인식하는 제1 학습으로부터 이익을 얻을 수 있다. 이러한 특징들은 자동차, 트럭, 및 항공기를 인식하기 위해 상이한 방식들로 더 높은 계층들에서 조합될 수 있 다. 뉴럴 네트워크는 다양한 연결 패턴으로 설계될 수 있다. 피드-포워드 네트워크들에서, 정보는 하위 계층들로부 터 상위 계층들로 전달되고, 주어진 계층의 각각의 뉴런은 상위 계층들의 뉴런들과 통신한다. 계층 구조적 표 현은 전술한 바와 같이 피드-포워드 네트워크의 연속적인 계층들에 구축될 수 있다. 뉴럴 네트워크는 또한 순 환(recurrent) 또는 피드백(탑-다운식(top-down)이라고도 함) 연결을 가질 수 있다. 순환 연결(recurrent connection)에서, 주어진 계층의 뉴런으로부터의 출력은 동일한 계층의 다른 뉴런으로 통신될 수 있다. 순환 아키텍처는 시퀀스로 뉴럴 네트워크에 전달되는 입력 데이터 청크(input data chunk)들 중 하나 초과에 걸쳐 있 는 패턴들을 인식하는 데 도움이 될 수 있다. 주어진 계층의 뉴런으로부터 하위 계층의 뉴런으로의 연결은 피 드백(또는 탑-다운식) 연결이라고 지칭된다. 많은 피드백 연결들을 갖는 네트워크는 하이-레벨 개념의 인식이 입력의 특정 로우-레벨 특징들을 판별하는 것을 도울 수 있을 때 도움이 될 수 있다. 뉴럴 네트워크의 계층들 사이의 연결은 완전 연결되거나 국소 연결될 수 있다. 도 2a는 완전 연결된 뉴럴 네트 워크의 예를 예시한다. 완전 연결된 뉴럴 네트워크에서, 제1 계층의 뉴런은 제2 계층의 모든 뉴런에 그의 출력을 통신할 수 있어서, 제2 계층의 각각의 뉴런이 제1 계층의 모든 뉴런으로부터 입력을 수신하게 할 것이다. 도 2b는 국소 연결된 뉴럴 네트워크의 예를 예시한다. 국소 연결된 뉴럴 네트워크에서, 제 1 계층의 뉴런은 제2 계층의 제한된 수의 뉴런들에 연결될 수 있다. 보다 대체적으로, 국소 연결된 뉴럴 네트 워크의 국소 연결된 계층은 계층 내의 각각의 뉴런이 동일하거나 유사한 연결 패턴을 가질 것이지만, 상이 한 값들(예를 들어, 210, 212, 214, 및 216)을 가질 수 있는 연결 강도들을 갖도록 구성될 수 있다. 국소 연결 된 연결 패턴은 상위 계층에서 공간적으로 별개인 수용 필드들을 발생시킬 수 있는데, 이는 주어진 영역 내의 상위 계층 뉴런들이 네트워크에 대한 전체 입력의 제한된 부분의 속성들에 대한 훈련을 통해 튜닝되는 입력들을 수신할 수 있기 때문이다. 국소 연결된 뉴럴 네트워크의 일례는 콘볼루션 뉴럴 네트워크이다. 도 2c는 콘볼루션 뉴럴 네트워크의 예 를 예시한다. 콘볼루션 뉴럴 네트워크는 제2 계층의 각각의 뉴런에 대한 입력들과 연관된 연결 강도들이 공유되도록(예를 들어, 208) 구성될 수 있다. 콘볼루션 뉴럴 네트워크들은 입력들의 공간적 위치가 의미있는 문제들에 매우 적합할 수 있다. 하나의 타입의 콘볼루션 뉴럴 네트워크는 심층 콘볼루션 네트워크(DCN)이다. 도 2d는 자동차 장착 카메라와 같 은 이미지 캡처 디바이스로부터 입력된 이미지로부터 시각적 특징들을 인식하도록 설계된 DCN의 상세한 예를 예시한다. 본 예의 DCN은 교통 표지판들 및 교통 표지판 상에 제공된 숫자를 식별하도록 훈 련될 수 있다. 물론, DCN은 차선 마킹들을 식별하거나 교통 신호등들을 식별하는 것과 같은 다른 작업들 에 대해 훈련될 수 있다. DCN은 지도 학습(supervised learning)으로 훈련될 수 있다. 훈련 동안, DCN에는 속도 제한 표지판 의 이미지와 같은 이미지가 제시될 수 있고, 그런 다음, 순방향 패스가 컴퓨팅되어 출력을 생성할 수 있다. DCN은 특징 추출부(feature extraction section) 및 분류부(classification section)를 포함할 수 있다. 이미지를 수신할 때, 콘볼루션 계층은 제1 세트의 특징 맵들을 생성하기 위해 콘볼루션 커널들(도시되지 않음)을 이미지에 적용할 수 있다. 일례로서, 콘볼루션 계층에 대한 콘볼루션 커널 은 28x28 특징 맵들을 생성하는 5x5 커널일 수 있다. 본 예에서, 4개의 상이한 특징 맵들이 제1 세트의 특징 맵들에서 생성되기 때문에, 4개의 상이한 콘볼루션 커널들이 콘볼루션 계층에서 이미지에 적용 되었다. 콘볼루션 커널들은 또한 필터들 또는 콘볼루션 필터들로 지칭될 수 있다. 제1 세트의 특징 맵들은 제2 세트의 특징 맵들을 생성하기 위해 최대 풀링 계층(max pooling layer) (도시되지 않음)에 의해 서브샘플링될 수 있다. 최대 풀링 계층은 제1 세트의 특징 맵들의 크기를 감소시 킨다. 즉, 14x14와 같은 제2 세트의 특징 맵의 크기는 28x28과 같은 제1 세트의 특징 맵의 크기보다 작다. 감소된 크기는 메모리 소비를 감소시키면서 후속 계층에 유사한 정보를 제공한다. 제2 세트의 특징 맵 들은 특징 맵들의 하나 이상의 후속 세트(도시되지 않음)를 생성하기 위해 하나 이상의 후속 콘볼루션 계 층(도시되지 않음)을 통해 추가로 콘볼빙(convolving)될 수 있다. 도 2d의 예에서, 제2 세트의 특징 맵들은 콘볼빙되어 제1 특징 벡터를 생성한다. 또한, 제1 특징 벡 터는 제2 특징 벡터를 생성하기 위해 추가로 콘볼빙된다. 제2 특징 벡터의 각각의 특징은 \"표 지판\", \"60\" 및 \"100\"과 같은 이미지의 가능한 특징에 대응하는 숫자를 포함할 수 있다. 소프트맥스 함수 (softmax function)(도시되지 않음)는 제2 특징 벡터 내의 숫자들을 확률로 컨버팅(converting)할 수 있 다. 이와 같이, DCN의 출력은 하나 이상의 특징들을 포함하는 이미지의 확률일 수 있다. 본 예에서, \"표지판\" 및 \"60\"에 대한 출력에서의 확률들은 \"30\", \"40\", \"50\", \"70\", \"80\", \"90\" 및 \"10 0\"과 같은 출력의 다른 것들의 확률들보다 높다. 훈련 전에, DCN에 의해 생성된 출력은 부정확 할 가능성이 있을 수 있다. 따라서, 출력과 타깃 출력 사이의 에러가 계산될 수 있다. 타깃 출력은 이미 지의 실측 자료(ground truth)(예를 들어, \"표지판\" 및 \"60\")이다. 그런 다음, DCN의 가중치들은 DCN의 출력이 타깃 출력과 더 근접하게 정렬되도록 조정될 수 있다. 가중치를 조정하기 위해, 학습 알고리즘은 가중치에 대한 기울기 벡터(gradient vector)를 컴퓨팅할 수 있다. 기울기는 가중치가 조정되면 에러가 증가하거나 감소할 양을 나타낼 수 있다. 최상위 계층에서, 기울기는 끝에 서 두번째 계층(penultimate layer)의 활성화된 뉴런과 출력 계층의 뉴런을 연결하는 가중치의 값에 직접 대응 할 수 있다. 하위 계층들에서, 기울기는 가중치들의 값 및 상위 계층들의 컴퓨팅된 에러 기울기들에 의존할 수 있다. 이어서, 에러를 줄이기 위해 가중치들이 조정될 수 있다. 가중치를 조정하는 이러한 방식은 뉴럴 네트 워크를 통한 \"역방향 패스\"를 수반하기 때문에 \"역 전파(back propagation)\"로 지칭될 수 있다. 실제로, 가중치들의 에러 기울기가 작은 수의 예들에 걸쳐 계산될 수 있으므로, 계산되는 기울기는 실제 에러 기울기에 근사하게 된다. 이러한 접근 방법은 확률적 기울기 하강법(stochastic gradient descent)으로 지칭될 수 있다. 확률적 기울기 하강법은, 전체 시스템의 달성가능한 에러 레이트가 감소하는 것을 중단할 때까지 또 는 에러 레이트가 타깃 레벨에 도달할 때까지, 반복될 수 있다. 학습 후에, DCN에는 새로운 이미지들이 제시될 수 있고, DCN을 통한 순방향 패스는 DCN의 추론 또는 예측으로 간주될 수 있는 출력을 산출할 수 있다. DBN(Deep Belief Network)은 다수의 은닉 노드 계층을 포함하는 확률론적 모델이다. DBN들은 훈련 데이터 세트 들의 계층 구조 표현을 추출하는 데 사용될 수 있다. DBN은 RBM(Restricted Boltzmann Machine)의 계층을 쌓 아서 획득될 수 있다. RBM은 입력들의 세트에 대한 확률 분포를 학습할 수 있는 인공 뉴렬 네트워크의 일 타입 이다. RBM은 각각의 입력이 분류되어야 하는 클래스에 대한 정보가 없을 때 확률 분포를 학습할 수 있기 때문 에, 비지도 학습에서 종종 RBM이 사용된다. 하이브리드 비지도 및 지도 패러다임을 사용하여, DBN의 바닥 RBM 은 비지도 방식으로 훈련될 수 있고, 특징 추출기로서 기능할 수 있고, 상부 RBM은 (이전 계층 및 타깃 클래스 로부터의 입력의 조인트 분포(joint distribution) 상에서) 지도 방식으로 훈련될 수 있고, 분류기로서 기능할 수 있다. 심층 콘볼루션 네트워크(DCN)들은 추가적인 풀링 및 정규화 계층들로 구성된 콘볼루션 네트워크들의 네트워크들 이다. DCN들은 많은 작업들에 대한 최신 성능을 달성했다. DCN들은 입력 및 출력 타깃들 둘 모두가 많은 예시 들에 대해 알려져 있고 기울기 하강 방법들의 사용에 의해 네트워크의 가중치들을 수정하는 데 사용되는 지도 학습을 사용하여 훈련될 수 있다.DCN들은 피드-포워드 네트워크들일 수 있다. 또한, 상기에서 설명된 바와 같이, DCN의 제1 계층의 뉴런으로부 터 다음 상위 계층의 뉴런들의 그룹으로의 연결들은 제1 계층의 뉴런들에 걸쳐 공유된다. DCN들의 피드-포워드 및 공유 연결들은 빠른 프로세싱을 위해 활용될 수 있다. DCN의 컴퓨테이셔널 부담은, 예를 들어, 순환 또는 피드백 연결들을 포함하는 유사한 크기의 뉴럴 네트워크의 것보다 훨씬 적을 수 있다. 콘볼루션 네트워크의 각각의 계층의 프로세싱은 공간적으로 불변인 템플릿 또는 기저 투영(basis projection)으 로 간주될 수 있다. 입력이 컬러 이미지의 레드, 그린 및 블루 채널들과 같은 다수의 채널들로 먼저 분해되면, 해당 입력에 대해 훈련된 콘볼루션 네트워크는 이미지의 축들을 따른 2개의 공간 차원들 및 컬러 정보를 캡처하 는 제3 차원을 갖는 3차원으로 간주될 수 있다. 콘볼루션 연결들의 출력들은 후속 계층에서 특징 맵을 형성하 기 위해 고려될 수 있고, 이때 특징 맵의 각각의 엘리먼트(예를 들어, 220)는 이전 계층에서의 뉴런들의 범위 (예를 들어, 특징 맵들)로부터 그리고 다수의 채널들 각각으로부터 입력을 수신한다. 특징 맵의 값들은 비-선형성, 이를테면 max(0, x)인 교정(rectification)을 통해 추가로 프로세싱될 수 있다. 인접한 뉴런들로부 터의 값들은 추가로 풀링될 수 있으며, 이는 다운 샘플링에 대응하고, 추가적인 국소(local) 불변 및 차원 감소 를 제공할 수 있다. 백색화(whitening)에 대응하는 정규화는 또한 특징 맵에서 뉴런들 간의 측방 억제를 통해 적용될 수 있다. 심층 학습 아키텍처들의 성능은, 더 많은 라벨링된 데이터 포인트들이 이용가능하게 됨에 따라 또는 컴퓨테이셔 널 능력이 증가함에 따라 증가할 수 있다. 현대의 심층 뉴럴 네트워크들은, 단지 15년 전에 일반 연구원에게 이용가능하였던 것보다 수천 배 더 많은 컴퓨팅 리소스들로 일상적으로 훈련된다. 새로운 아키텍처들 및 훈련 패러다임들은 심층 학습의 성능을 더욱 향상시킬 수 있다. 수정된 선형 유닛들은 소실 기울기들로 알려진 훈련 문제를 줄일 수 있다. 새로운 훈련 기법들은 과대-적합(over-fitting)을 줄여서, 더 큰 모델들이 더 나은 일반 화를 달성하게 할 수 있다. 캡슐화 기법들은 주어진 수용 필드에서 데이터를 추상화하고 전반적인 성능을 더욱 향상시킬 수 있다. 도 3은 DCN를 예시하는 블록도이다. 심층 콘볼루션 네트워크는 연결 및 가중치 공유에 기초하여 다 수의 상이한 타입들의 계층을 포함할 수 있다. 도 3에 도시된 바와 같이, 심층 콘볼루션 네트워크는 콘볼 루션 블록들(354A, 354B)을 포함한다. 콘볼루션 블록들(354A, 354B) 각각은 콘볼루션 계층(CONV), 정규 화 계층(LNorm), 및 최대 풀링 계층(MAX POOL)으로 구성될 수 있다. 비록 2개의 콘볼루션 블록들 (354A, 354B)만이 도시되어 있지만, 본 개시내용은 그렇게 제한되지 않으며, 대신에, 설계 선호도에 따라 임의 의 수의 콘볼루션 블록들(354A, 354B)이 심층 콘볼루션 네트워크에 포함될 수 있다. 콘볼루션 계층들은 특징 맵을 생성하기 위해 입력 데이터에 적용될 수 있는 하나 이상의 콘볼루션 필터들 을 포함할 수 있다. 정규화 계층은 콘볼루션 필터들의 출력을 정규화할 수 있다. 예를 들어, 정규화 계 층은 백색화 또는 측방 억제를 제공할 수 있다. 최대 풀링 계층은 국소 불변 및 차원 감소를 위해 공간에 걸쳐 다운 샘플링 어그리게이션(down sampling aggregation)을 제공할 수 있다. 예를 들어, 심층 콘볼루션 네트워크의 병렬 필터 뱅크(bank)들은 (예컨대, 도 1의) SOC의 CPU 또는 GPU에 로딩되어 높은 성능 및 낮은 전력 소비를 달성할 수 있다. 대안적인 실시예들에서, 병렬 필터 뱅크 들은 SOC의 DSP 또는 ISP에 로딩될 수 있다. 추가적으로, 심층 콘볼루션 네트워크는 센서 들 및 내비게이션에 각각 전용되는 센서 프로세서 및 내비게이션 모듈과 같은, SOC 상에 존재할 수 있는 다른 프로세싱 블록들에 액세스할 수 있다. 심층 콘볼루션 네트워크는 또한 하나 이상의 완전 연결된 계층들(FC1 및 FC2)을 포함할 수 있다. 심 층 콘볼루션 네트워크는 로지스틱 회귀(logistic regression)(LR) 계층을 추가로 포함할 수 있다. 심층 콘볼루션 네트워크의 각각의 계층(356, 358, 360, 362, 364) 사이에는 업데이트될 가중치들(도시되지 않음)이 있다. 계층들(예를 들어, 356, 358, 360, 362, 364) 각각의 출력은 콘볼루션 블록들(354A) 중 제1 콘 볼루션 블록에서 공급되는 입력 데이터(예를 들어, 이미지들, 오디오, 비디오, 센서 데이터 및/또는 다른 입력 데이터)로부터 계층 구조적 특징 표현들을 학습하기 위해 심층 콘볼루션 네트워크에서 계층들(예를 들어, 356, 358, 360, 362, 364)의 연속되는 계층의 입력으로서 기능할 수 있다. 심층 콘볼루션 네트워크(35 0)의 출력은 입력 데이터에 대한 분류 스코어이다. 분류 스코어는 확률들의 세트일 수 있으며, 여기서 각각의 확률은 입력 데이터가 특징들의 세트로부터의 특징을 포함하는 확률이다. 도 4는 인공 지능(AI) 기능들을 모듈화할 수 있는 예시적인 소프트웨어 아키텍처를 예시하는 블록도이다. 아키텍처를 사용하여, SOC의 다양한 프로세싱 블록들(예를 들어, CPU, DSP, GPU 및/ 또는 NPU)(이는 도 1의 SoC와 유사할 수 있음)로 하여금, 본 개시내용의 양태들에 따라, AI 애플리케이션에 대한 훈련 후 양자화에 대해 개시된 바와 같이 적응형 반올림(adaptive rounding)을 지원하게 할 수 있는 애플리케이션들이 설계될 수 있다. AI 애플리케이션은 예를 들어, 디바이스가 현재 동작하는 위치를 표시하는 장면의 검출 및 인식을 제공할 수 있는 사용자 공간에 정의된 기능들을 호출하도록 구성될 수 있다. AI 애플리케이션은 예를 들어, 인식된 장면이 사무실인지, 강의실인지, 식당인지 또는 호수와 같은 실외 환경인지에 따라 마이크로폰 (microphone) 및 카메라를 상이하게 구성할 수 있다. AI 애플리케이션은 현재 장면의 추정을 제공하도록 AI 기능 API(application programming interface), 예컨대, SceneDetect API에서 정의된 라이브러리와 연 관된 컴파일된 프로그램 코드에 요청할 수 있다. 이러한 요청은 궁극적으로, 예를 들어 비디오 및 포지셔닝 데 이터에 기초하여 추론 응답을 제공하도록 구성된 심층 뉴럴 네트워크의 출력에 의존할 수 있다. 심층 뉴럴 네 트워크는, 예를 들어, 비디오 및 포지셔닝 데이터에 기초하여 장면 추정들을 제공하도록 구성된 차동 뉴럴 네트 워크일 수 있다. 런타임 프레임워크(runtime framework)의 컴파일된 코드일 수 있는 런타임 엔진은 AI 애플리케이션에 추가로 액세스가능할 수 있다. AI 애플리케이션은 런타임 엔진으로 하여금, 예를 들어 특정 시간 간 격으로 장면 추정과 같은 추론을 요청하게 하거나 또는 애플리케이션의 사용자 인터페이스에 의해 검출된 이벤트에 의해 트리거되게 할 수 있다. (예컨대, 장면을 추정하기 위해) 추론 응답을 제공하게 될 때, 런타임 엔진은 결국, SOC 상에서 실행되는 커널과 같은 OS(operating system) 공간 내의 운영 체 제에 신호를 전송할 수 있다. 운영 체제는 결국, CPU, DSP, GPU, NPU, 또는 이들의 어떤 조합 상에서 양자화의 연속 완화가 수행되게 할 수 있다. CPU는 운영 체제에 의해 직접 액세스될 수 있고, 다른 프로세싱 블록들은 각각 DSP, GPU 또는 NPU에 대한 드라이버(414, 416 또는 418)와 같은 드라이버를 통해 액세스될 수 있다. 예시적인 예에서, 심층 뉴럴 네트워크는 CPU, DSP 및 GPU와 같은 프로세싱 블록들의 조합 상에서 실행되도록 구성될 수 있거나, 또는 NPU 상에서 실행될 수 있다. 설명된 바와 같이, 본 개시내용의 양태들은 흐름 애그노스틱 비디오 압축에 관한 것이다. 본 개시내용의 양태 들에 따르면, 흐름 워핑 연산자를 사용하기보다는, 완전 콘볼루션 연산자(fully convolutional operator)들을 통한 모션 보상이 제공된다. 예를 들어, 광학 흐름들을 사용하여 이전 프레임을 워핑하는 대신에, 콘볼루션 뉴 럴 네트워크는 비디오 프레임들의 특징 표현들을 추출할 수 있다. 현재 프레임과 이전 프레임 사이의 상관 특 징들이 결정될 수 있다. 상관 특징들은 인코딩되고 수신기로 송신될 수 있다. 인코딩된 상관 특징들은 디코딩 되고 이전 프레임의 특징들과 함께 사용되어 현재 프레임의 예측 를 결정할 수 있다. 도 5는 본 개시내용의 양태들에 따른, 흐름 애그노스틱 비디오 압축을 위한 예시적인 아키텍처를 예시하는 블록도이다. 아키텍처는 모션 네트워크 및 잔차 네트워크를 포함할 수 있다. 모션 네트워크 및 잔차 네트워크는, 예를 들어, 자동 인코더들로서 구현될 수 있다. 모션 네트워크는 특징 변환으로서 모션 보상을 제공할 수 있다. 도 5의 예에서, 모션 네트워크는 인 코더, 디코더, 및 선행 네트워크를 포함할 수 있다. 인코더는 특징 추출기 (514a)를 포함할 수 있다. 특징 추출기 (514a)는, 예를 들어, 콘볼루션 뉴럴 네트워크(예컨대, 도 3에 도시된 350)일 수 있다. 특징 추출기 (514a)는 입력으로서 비디오를 수신할 수 있다. 비디오는 다수의 프레임들을 포함할 수 있다. 도시된 바와 같이, 특징 추출기 (514a)는 압축될 비디오의 현재 프레임 를 수신할 수 있다. 특 징 추출기 (514a)는 하나 이상의 콘볼루션 계층들을 통해 현재 프레임 를 프로세싱하여, 특징들의 세트를 추출하고 현재 프레임 의 특징 표현을 생성할 수 있다. 추가적으로, 특징 추출기 (514b)는 비디오의 이전 프레임 을 수신할 수 있다. 다수의 특징 추출기들 이 도 5에 도시되어 있지만, 이는 단지 일례일 뿐이며 예시의 용이함을 위한 것이다. 오히려, 하나 이상의 특징 추출기들 이 채용될 수 있다. 특징 추출기 (514b)는 하나 이상의 콘볼루션 계층들을 통해 비디오의 이전 프레임 을 프로세싱하여, 특징들의 세트를 추출하고 이전 프레임 의 특징 표현을 생성할 수 있다. 현재 및 이전 프레임들의 특징 표현들은 특징 추출기들 (514a, 514b)을 통해 각각 출력될 수 있다. 현재 및 이전 프레임들의 특징 표현들은 연접 계층(516a) 을 통해 연접되고 특징 상관 추정기 에 공급될 수 있다. 특징 상관 추정기 는 또한 콘볼루션 뉴럴 네트워크일 수 있다. 특징 상관 추정기 는 현재 프레 임 와 이전 프레임 사이의 상관 특징들 의 세트를 학습하고 인코딩할 수 있다. 상관 특징들 는 현 재 프레임 와 이전 프레임 사이의 모션에 대응할 수 있다. 상관 특징들 는 산술 인코더(arithmetic encoder, AE)를 통해 엔트로피 코딩되고 수신기로 송신될 수 있다. 엔트로피 코딩 및 디코딩은 선행 네트워크를 통해 학습된 잠재적 상관 특징들의 분포에 기초하여 수행될 수 있다. 디코더는 상관 특징들 의 엔트로피 코딩된 잠재적 표현을 수신할 수 있다. 상관 특징 의 엔트로피 코 딩된 잠재적 표현은 산술 디코더(arithmetic decoder, AD)를 통해 디코딩되고 코드-특징 변환기(code-to- feature transformer) 에 공급될 수 있다. 코드-특징 변환기 는 상관 특징들 의 잠재적 특 징 표현을 복원할 수 있다. 디코더는 또한 기준 프레임을 수신할 수 있다. 기준 프레임은, 예를 들어, 이전 프레임(예컨대, )일 수 있다. 기준 프레임은 특징 추출기 (514c)에 공급되고, 이는 특징들의 세트 를 추출하여 기준 프레임의 특징 표현을 생성한다. 코드-특징 변환기 에 의해 출력된 상관 특징들 의 잠재적 특징 표현은 연접 계층(516b)을 통해 기준 프레임(예컨대, )의 특징 표현과 연접되고 프레임 디코더 에 공급될 수 있다. 프레임 디코더 는 기준 프레임(예컨대,) 및 상관 특징들의 연접된 특징 표현들을 프로세싱하고 모션 네트워 크를 통해 생성된 현재 프레임의 예측 를 생성할 수 있다. 잔차 네트워크는 유사하게, 잔차 인코더 , 잔차 디코더 , 및 잔차 선행 네트워크를 포함할 수 있다. 잔차 인코더 는 입력으로서 잔차를 수신할 수 있다. 잔차는 실제 현재 프레임 와 현재 프레임 예측 사이의 차이에 의해 주어질 수 있다. 잔차 인코더 는 잔차의 특징 표현을 추출할 수 있다. 잔차의 특징 표현은 엔트로피 코딩되고 수신기(예컨대, 잔차 디코더 )로 송신될 수 있다. 엔트로피 코 딩 및 디코딩은 선행 네트워크를 통해 학습된 잠재적 잔차 특징들의 분포에 기초하여 수행될 수 있다. 잔차 디코더 는 잔차의 특징 표현을 디코딩하고 잔차(예를 들어, )의 예측 을 생성할 수 있다. 이러한 잔차 예측 는 추가 블록을 통해 현재 프레임 예측 에 추가되어 현재 프레임 의 재구성 을 생성할 수 있다. 현재 프레임 의 재구성 는 비디오의 후속 프레임(예컨대, )에 대한 모션 보상에 사용 하기 위해 수신기(예컨대, 모션 네트워크의 인코더)로 송신될 수 있다. 일부 양태들에서, 아키텍처는 완전 콘볼루션 연산자들을 사용할 수 있다. 그렇게 함에 있어서, 모션 보상 이 광학 흐름들을 사용하는 종래의 모션 보상 접근법들 없이 결정될 수 있다. 도 6은 본 개시내용의 양태들에 따른, 흐름 애그노스틱 비디오 압축을 위한 예시적인 아키텍처를 예시하는 블록도이다. 도 6을 참조하면, 도 5의 아키텍처에 대한 입력은 다수의 이전에 디코딩된 프레임들의 이력 으로부터의 모션 정보를 추가로 이용하도록 수정될 수 있다. 도 6에서, 2개의 이전에 디코딩된 프레임들(예컨 대, 및 )이 도시되어 있지만, 본 개시내용은 그렇게 제한되지 않는다. 오히려, 2개 이상의 이전에 디 코딩된 프레임들이 이전에 디코딩된 프레임들의 이력에 포함될 수 있다. 아키텍처는 외삽기 네트워크(E)를 추가로 포함할 수 있다. 외삽기 네트워크는, 예를 들어, 완전 콘볼루션 네트워크일 수 있다. 외삽기 네트워크는 입력들로서, 다수의 이전에 디코딩된 프레임들(예컨대, 및 )을 수신할 수 있 다. 외삽기 네트워크는 이전에 디코딩된 프레임들(예컨대, 및 )을 프로세싱하고 기준 프레임 예 측 를 생성할 수 있다. 기준 프레임 예측 은 중간 프레임으로서 처리되고 아키텍처의 모션 네트워크 로 입력될 수 있다. (예를 들어, 도 5에 도시된 바와 같이) 단일의 이전에 디코딩된 프레임보다는 다수의 이전에 디코딩된 프레임들을 참고로 사용함으로써, 현재 프레임을 예측하는 정확도가 증가될 수 있다. 도 7은 본 개시내용의 양태들에 따른, 흐름 애그노스틱 비디오 압축을 위한 예시적인 아키텍처를 예시하는 블록도이다. 도 7은 효율 최적화를 위해 설계된, 도 5의 단순화된 버전이다. 도 7을 참조하면, 아키텍처(70 0)는 모션 네트워크를 제거함으로써 단순화될 수 있다. 이와 같이, 아키텍처는 외삽기 네트워크 및 잔차 네트워크를 포함한다. 외삽기 네트워크는 현재 프레임 의 예측 을 이전 프레임 들(예컨대, ≥ 2개의 프레임들)의 이력으로부터 직접 결정할 수 있다. 잔차 네트워크는 예측 와 현재 프레임 사이의 차이를 인코딩하는데, 이는 현재 프레임 예측 에 추가되어 현재 프레임 의 재구성 를 생성할 수 있다. 도 8은 본 개시내용의 양태들에 따른, 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 예시적인 프로 세스를 예시하는 흐름도이다. 도 8에 도시된 바와 같이, 블록에서, 프로세스는 ANN을 통해 비 디오를 수신한다. 도 5를 참조하여 설명된 바와 같이, 특징 추출기 (514a)는 입력으로서 비디오를 수신할 수 있다. 비디오는 다수의 프레임들을 포함할 수 있다. 블록에서, 프로세스는, ANN에 의해, 비디오의 현재 프레임의 특징들의 제1 세트 및 비디오의 기준 프 레임의 특징들의 제2 세트를 추출한다. 도 5를 참조하여 설명된 바와 같이, 특징 추출기 (514a)는 하나 이 상의 콘볼루션 계층들을 통해 현재 프레임 를 프로세싱하여, 특징들의 세트를 추출하고 현재 프레임 의 특 징 표현을 생성할 수 있다. 선택적으로, 블록에서, 특징 추출기 (514b)는 비디오의 이전 프레임 을 수신할 수 있다. 특징 추출기 (514b)는 하나 이상의 콘볼루션 계층들을 통해 비디오의 이전 프레임 을 프로세싱하여, 특징들의 세트를 추출하고 이전 프레임 의 특징 표현을 생성할 수 있다. 블록에서, 프로세스는, ANN에 의해, 현재 프레임의 특징들의 제1 세트와 기준 프레임의 특징들의 제2 세트 사이의 상관 특징들의 추정을 결정한다. 도 5를 참조하여 설명된 바와 같이, 현재 및 이전 프레임들의 특 징 표현들은 특징 추출기들 (514a, 514b)을 통해 각각 출력될 수 있다. 현재 및 이전 프레임들의 특징 표현 들은 연접 계층(516a)을 통해 연접되고 특징 상관 추정기 에 공급될 수 있다. 특징 상관 추정기 는 또한 콘볼루션 뉴럴 네트워크일 수 있다. 특징 상관 추정기 는 현재 프레임 와 이전 프레 임들 사이의 상관 특징들 의 세트를 학습하고 인코딩할 수 있다. 상관 특징들 는 현재 프레임 와 이전 프레임 사이의 모션에 대응할 수 있다. 블록에서, 프로세스는 상관 특징들의 추정을 수신기로 송신한다. 도 5를 참조하여 설명된 바와 같이, 상관 특징들 는 산술 인코더(AE)를 통해 엔트로피 코딩되고 수신기(예컨대, 디코더)로 송신될 수 있다. 도 9는 본 개시내용의 양태들에 따른, 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 예시적인 프로 세스를 예시하는 흐름도이다. 도 9에 도시된 바와 같이, 블록에서, 프로세스는, ANN에 의해, 비디오의 기준 프레임을 수신한다. 블록에서, 프로세스는, ANN에 의해, 비디오의 현재 프레임과 비 디오의 기준 프레임 사이의 상관 특징들의 추정을 수신한다. 도 5에 도시된 바와 같이, 디코더는 비디오 의 기준 프레임 및, 비디오의 현재 프레임 와 비디오의 기준 프레임(예컨대, 이전 프레임 ) 사 이의 상관 특징들 의 추정을 수신한다.블록에서, 프로세스는, ANN에 의해, 비디오의 기준 프레임의 특징들의 제1 세트를 추출한다. 예를 들어, 도 5를 참조하여 설명된 바와 같이, 디코더는 또한 기준 프레임을 수신할 수 있다. 기준 프레 임은, 예를 들어, 이전 프레임(예컨대, )일 수 있다. 기준 프레임은 특징 추출기 (514c)에 공급되고, 이는 특징들의 세트를 추출하여 기준 프레임의 특징 표현을 생성한다. 블록에서, 프로세스는, ANN에 의해, 상관 특징들의 추정을 디코딩한다. 도 5에 도시된 바와 같이, 디코더는 상관 특징들 의 엔트로피 코딩된 잠재적 표현을 수신할 수 있다. 상관 특징들 의 엔트로피 코딩된 잠재적 표현은 산술 디코더(AD)를 통해 디코딩되고 코드-특징 변환기 에 공급될 수 있다. 코드 -특징 변환기 는 상관 특징들 의 잠재적 특징 표현을 복원할 수 있다. 블록에서, 프로세스는, ANN에 의해, 비디오의 기준 프레임의 특징들의 제1 세트 및 상관 특징들의 디 코딩된 추정에 기초하여 비디오의 현재 프레임의 예측을 생성한다. 도 5를 참조하여 설명된 바와 같이, 상관 특징들 의 잠재적 특징 표현은 연접 계층(516b)을 통해 기준 프레임의 특징 표현과 연접되고 프레임 디 코더 에 공급될 수 있다. 프레임 디코더 는 상관 특징들 및 기준 프레임의 연접된 특 징 표현들을 프로세싱하고 모션 네트워크를 통해 생성된 현재 프레임 의 예측 을 생성한다. 도 10은 본 개시내용의 양태들에 따른, 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 예시적인 프로 세스를 예시하는 흐름도이다. 도 10에 도시된 바와 같이, 블록에서, 프로세스는, ANN에 의 해, 비디오의 다수의 프레임들의 이력을 수신한다. 도 6을 참조하여 설명된 바와 같이, 아키텍처는 외삽 기 네트워크(E)를 추가로 포함할 수 있다. 외삽기 네트워크는, 예를 들어, 완전 콘볼루션 네트워크 일 수 있다. 외삽기 네트워크는 입력들로서, 다수의 이전에 디코딩된 프레임들(예컨대, 및 )을 수신할 수 있다. 블록에서, 프로세스는, ANN에 의해, 비디오의 다수의 프레임들의 이력에 기초하여 기준 프레임을 생성한다. 예를 들어, 도 6을 참조하여 설명된 바와 같이, 외삽기 네트워크는 이전에 디코딩된 프레임들 (예컨대, 및 )을 프로세싱하고 기준 프레임 예측 를 생성할 수 있다. 블록에서, 프로세스는, ANN에 의해, 비디오의 현재 프레임 및 기준 프레임에 기초하여 비디오의 현 재 프레임의 예측을 생성한다. 도 6에 도시된 바와 같이, 현재 프레임의 예측 는 현재 프레임 및 외삽기 네트워크에 의해 생성된 기준 프레임 예측 을 사용하여 생성된다. 블록에서, 프로세스는, ANN에 의해, 비디오의 현재 프레임의 예측, 및 비디오의 현재 프레임과 비 디오의 현재 프레임의 예측 사이의 차이에 기초하여 컴퓨팅된 잔차에 기초하여 현재 프레임의 재구성을 생성한 다. 도 6에 도시된 바와 같이, 잔차 네트워크는 예측과 현재 프레임 사이의 차이를 인코딩하는데, 이 는 현재 프레임 예측 에 추가되어 현재 프레임 의 재구성 를 생성할 수 있다. 구현 예들은 다음과 같이 번호가 매겨진 조항들에서 제공된다. 1. 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법으로서, 상기 ANN에 의해 비디오를 수신하는 단계; 상기 ANN에 의해, 상기 비디오의 현재 프레임의 특징들의 제1 세트 및 상기 비디오의 기준 프레임의 특징들의 제2 세트를 추출하는 단계; 상기 ANN에 의해, 상기 현재 프레임의 특징들의 제1 세트와 상기 기준 프레임의 특징들의 제2 세트 사이의 상관 특징들의 추정을 결정하는 단계; 및 상기 상관 특징들의 추정을 수신기로 송신하는 단계를 포함하는, 프로세서 구현 방법. 2. 조항 1에 있어서, 상기 ANN의 완전 콘볼루션 연산자들을 통해 상기 상관 특징들의 추정을 결정하는 단계를 추가로 포함하는, 프로세서 구현 방법.3. 조항 1 또는 조항 2에 있어서, 상기 기준 프레임은 상기 비디오의 이전 프레임의 재구성을 포함하는, 프로세 서 구현 방법. 4. 조항 1 내지 조항 3 중 임의의 조항에 있어서, 상기 기준 프레임은 상기 비디오의 다수의 선행 프레임들의 재구성들에 기초하여 예측되는, 프로세서 구현 방법. 5. 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법으로서, 상기 ANN에 의해, 비디오의 기준 프레임을 수신하는 단계; 상기 ANN에 의해, 상기 비디오의 현재 프레임과 상기 비디오의 기준 프레임 사이의 상관 특징들의 추정을 수신 하는 단계; 상기 ANN에 의해, 상기 비디오의 기준 프레임의 특징들의 제1 세트를 추출하는 단계; 상기 ANN에 의해, 상기 상관 특징들의 추정을 디코딩하는 단계; 및 상기 ANN에 의해, 상기 비디오의 기준 프레임의 특징들의 제1 세트 및 상기 상관 특징들의 디코딩된 추정에 기 초하여 상기 비디오의 현재 프레임의 예측을 생성하는 단계를 포함하는, 프로세서 구현 방법. 6. 조항 5에 있어서, 상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의 예측 사이의 차이에 기초하여 잔차를 컴퓨팅하는 단 계; 및 상기 현재 프레임의 예측 및 상기 잔차에 기초하여 상기 비디오의 현재 프레임의 재구성을 생성하는 단계를 추 가로 포함하는, 프로세서 구현 방법. 7. 조항 5 또는 조항 6에 있어서, 상기 기준 프레임은 상기 비디오의 다수의 선행 프레임들의 재구성들에 기초 하여 예측되는, 프로세서 구현 방법. 8. 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 프로세서 구현 방법으로서, 상기 ANN에 의해, 비디오의 다수의 프레임들의 이력을 수신하는 단계; 상기 ANN에 의해, 상기 비디오의 다수의 프레임들의 이력으로부터 기준 프레임을 생성하는 단계; 상기 ANN에 의해, 상기 비디오의 기준 프레임 및 현재 프레임에 기초하여 상기 비디오의 현재 프레임의 예측을 생성하는 단계; 및 상기 ANN에 의해, 상기 비디오의 현재 프레임의 예측, 및 상기 비디오의 현재 프레임과 상기 비디오의 현재 프 레임의 예측 사이의 차이에 기초하여 컴퓨팅된 잔차에 기초하여 상기 현재 프레임의 재구성을 생성하는 단계를 포함하는, 프로세서 구현 방법. 9. 조항 8에 있어서, 상기 이력은 복수의 이전에 디코딩된 프레임들을 포함하는, 프로세서 구현 방법. 10. 조항 8 또는 조항 9에 있어서, 상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의 예측 사이의 상 기 차이를 인코딩하고, 상기 인코딩을 상기 현재 프레임의 예측에 추가하는 단계를 추가로 포함하는, 프로세서 구현 방법. 11. 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 장치로서, 메모리; 및 상기 메모리에 커플링된 적어도 하나의 프로세서를 포함하며, 상기 적어도 하나의 프로세서는, 상기 ANN에 의해 비디오를 수신하도록; 상기 ANN에 의해, 상기 비디오의 현재 프레임의 특징들의 제1 세트 및 상기 비디오의 기준 프레임의 특징들의 제2 세트를 추출하도록; 상기 ANN에 의해, 상기 현재 프레임의 특징들의 제1 세트와 상기 기준 프레임의 특징들의 제2 세트 사이의 상관 특징들의 추정을 결정하도록; 그리고 상기 상관 특징들의 추정을 수신기로 송신하도록 구성되는, 장치. 12. 조항 11에 있어서, 상기 적어도 하나의 프로세서는, 상기 ANN의 완전 콘볼루션 연산자들을 통해 상기 상관 특징들의 추정을 결정하도록 추가로 구성되는, 장치. 13. 조항 11 또는 조항 12에 있어서, 상기 기준 프레임은 상기 비디오의 이전 프레임의 재구성을 포함하는, 장 치. 14. 조항 11 내지 조항 13 중 임의의 조항에 있어서, 상기 적어도 하나의 프로세서는 상기 비디오의 다수의 선 행 프레임들의 재구성들에 기초하여 상기 기준 프레임을 예측하도록 추가로 구성되는, 장치. 15. 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 장치로서, 메모리; 및 상기 메모리에 커플링된 적어도 하나의 프로세서를 포함하며, 상기 적어도 하나의 프로세서는, 비디오의 기준 프레임을 수신하도록; 상기 비디오의 현재 프레임과 상기 비디오의 기준 프레임 사이의 상관 특징들의 추정을 수신하도록; 상기 비디오의 기준 프레임의 특징들의 제1 세트를 추출하도록; 상관 특징들의 추정을 디코딩하도록; 그리고 상기 비디오의 기준 프레임의 특징들의 제1 세트 및 상기 상관 특징들의 디코딩된 추정에 기초하여 상기 비디오 의 현재 프레임의 예측을 생성하도록 구성되는, 장치. 16. 조항 15에 있어서, 상기 적어도 하나의 프로세서는, 상기 비디오의 현재 프레임과 상기 비디오의 현재 프레임의 예측 사이의 차이에 기초하여 잔차를 컴퓨팅하도록; 그리고 상기 현재 프레임의 예측 및 상기 잔차에 기초하여 상기 비디오의 현재 프레임의 재구성을 생성하도록 추가로 구성되는, 장치. 17. 조항 15 또는 조항 16에 있어서, 상기 적어도 하나의 프로세서는, 상기 비디오의 다수의 선행 프레임들의 재구성들에 기초하여 상기 기준 프레임을 예측하도록 추가로 구성되는, 장치. 18. 인공 뉴럴 네트워크(ANN)를 사용하는 비디오 압축을 위한 장치로서, 메모리; 및 상기 메모리에 커플링된 적어도 하나의 프로세서를 포함하며, 상기 적어도 하나의 프로세서는, 상기 ANN에 의해, 비디오의 다수의 프레임들의 이력을 수신하도록; 상기 ANN에 의해, 상기 비디오의 다수의 프레임들의 이력으로부터 기준 프레임을 생성하도록; 상기 ANN에 의해, 상기 비디오의 기준 프레임 및 현재 프레임에 기초하여 상기 비디오의 현재 프레임의 예측을 생성하도록; 그리고 상기 ANN에 의해, 상기 비디오의 현재 프레임의 예측, 및 상기 비디오의 현재 프레임과 상기 비디오의 현재 프 레임의 예측 사이의 차이에 기초하여 컴퓨팅된 잔차에 기초하여 상기 현재 프레임의 재구성을 생성하도록 구성 되는, 장치. 19. 조항 18에 있어서, 상기 이력은 복수의 이전에 디코딩된 프레임들을 포함하는, 장치. 20. 조항 18 또는 조항 19에 있어서, 상기 적어도 하나의 프로세서는, 상기 비디오의 현재 프레임과 상기 비디 오의 현재 프레임의 예측 사이의 차이를 인코딩하고, 상기 인코딩을 상기 현재 프레임의 예측에 추가하도록 추 가로 구성되는, 장치. 하나의 양태에서, 수신하는 수단, 추출하는 수단, 결정하는 수단, 송신하는 수단, 디코딩하는 수단, ANN에 의해 예측을 생성하기 위한 수단, ANN에 의해 예측을 생성하기 위한 수단, ANN에 의해 기준 프레임을 생성하기 위한 수단, 및/또는 ANN에 의해 재구성을 생성하기 위한 수단은 언급된 기능들을 수행하도록 구성된 CPU, CPU와 연관된 프로그램 메모리, 전용 메모리 블록, 완전 연결된 계층들, NPU/ 및/또는 라우팅 연결 프로세싱 유닛일 수 있다. 다른 구성에서, 위에서 언급된 수단은 위에서 언급된 수단에 의해 언급된 기능들을 수행하도록 구성된 임의의 모듈 또는 임의의 장치일 수 있다. 위에서 설명된 방법들의 다양한 동작들은, 대응하는 기능들을 수행할 수 있는 임의의 적절한 수단에 의해 수행 될 수 있다. 이러한 수단은 회로, ASIC(application specific integrated circuit) 또는 프로세서를 포함하지 만 이에 한정된 것은 아닌 다양한 하드웨어 및/또는 소프트웨어 컴포넌트(들) 및/또는 모듈(들)을 포함할 수 있 다. 일반적으로, 도면들에 예시된 동작들이 존재하는 경우, 그러한 동작들은 비슷한 번호를 가진 대응하는 상 대 수단 + 기능 컴포넌트들을 가질 수 있다. 본 명세서에서 사용된 바와 같이, 용어 \"결정하는 것\"은 매우 다양한 액션들을 포괄한다. 예를 들어, \"결정하 는 것\"은 계산하는 것, 컴퓨팅하는 것, 프로세싱하는 것, 도출하는 것, 조사하는 것, 룩업하는 것(예컨대, 테이 블, 데이터베이스 또는 다른 데이터 구조에서 룩업하는 것), 확인하는 것 등을 포함할 수 있다. 부가적으로, \"결정하는 것\"은 수신하는 것(예를 들어, 정보를 수신하는 것), 액세스하는 것(예를 들어, 메모리 내 데이터에 액세스하는 것) 등을 포함할 수 있다. 더욱이, \"결정하는 것\"은 해결하는 것, 선택하는 것, 선출하는 것, 확립 하는 것 등을 포함할 수 있다. 본 명세서에서 사용된 바와 같이, 항목들의 리스트 \"중 적어도 하나\"를 지칭하는 어구는 단일 멤버들을 포함한, 그 항목들의 임의의 조합을 지칭한다. 일례로서, \"a, b, 또는 c 중 적어도 하나\"는 a, b, c, a-b, a-c, b-c, 및 a-b-c를 커버하도록 의도된다. 본 개시내용과 관련하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 및 회로들은 범용 프로세서, DSP, ASIC, FPGA(field programmable gate array) 또는 다른 PLD(programmable logic device), 이산 게이트 또는 트랜지스 터 로직, 이산 하드웨어 컴포넌트들, 또는 설명된 기능들을 수행하도록 설계된 이들의 임의의 조합으로 구현 또 는 수행될 수 있다. 범용 프로세서는 마이크로프로세서일 수 있지만, 대안적으로, 프로세서는 임의의 상업적으 로 이용가능한 프로세서, 제어기, 마이크로제어기 또는 상태 머신일 수 있다. 프로세서는 또한 컴퓨팅 디바이 스들의 조합, 예를 들어, DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서들, DSP 코어와 조합된 하나 이상의 마이크로프로세서들, 또는 임의의 다른 그러한 구성으로서 구현될 수 있다. 본 개시내용과 관련하여 설명되는 알고리즘 또는 방법의 단계들은 직접적으로 하드웨어로, 프로세서에 의해 실 행되는 소프트웨어 모듈로, 또는 이 둘의 조합으로 구현될 수 있다. 소프트웨어 모듈은 당업계에 공지된 임의 의 형태의 저장 매체에 상주할 수 있다. 사용될 수 있는 저장 매체의 일부 예들은 RAM(random access memory), ROM(read only memory), 플래시 메모리, EPROM(erasable programmable read-only memory), EEPROM(electrically erasable programmable read-only memory), 레지스터들, 하드디스크, 착탈식 디스크, CD- ROM 등을 포함한다. 소프트웨어 모듈은 단일 명령 또는 다수의 명령들을 포함할 수 있으며, 그리고 수 개의 상 이한 코드 세그먼트들에 걸쳐, 상이한 프로그램들 간에, 그리고 다수의 저장 매체들에 걸쳐 분산될 수 있다. 저장 매체는, 프로세서가 저장 매체로부터 정보를 판독하고 저장 매체에 정보를 기록할 수 있도록 프로세서에 커플링될 수 있다. 대안적으로, 저장 매체는 프로세서에 통합될 수 있다. 본 명세서에 개시된 방법들은 설명된 방법을 달성하기 위한 하나 이상의 단계들 또는 동작들을 포함한다. 방법 단계들 및/또는 액션들은 청구항들의 범주를 벗어나지 않으면서 서로 상호교환될 수 있다. 다시 말해서, 단계 들 또는 액션들의 특정 순서가 특정되지 않으면, 특정 단계들 및/또는 액션들의 순서 및/또는 사용은 청구항들 의 범주를 벗어나지 않으면서 수정될 수 있다. 설명된 기능들은 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 임의의 조합으로 구현될 수 있다. 하드웨어로 구 현된다면, 예시적인 하드웨어 구성은 디바이스의 프로세싱 시스템을 포함할 수 있다. 프로세싱 시스템은 버스 아키텍처로 구현될 수 있다. 버스는 프로세싱 시스템의 특정 애플리케이션 및 전체적인 설계 제약들에 따라, 임의의 수의 상호연결 버스들 및 브리지들을 포함할 수 있다. 버스는 프로세서, 머신 판독가능 매체들, 및 버 스 인터페이스를 포함하는 다양한 회로들을 함께 링크시킬 수 있다. 버스 인터페이스는 다른 무엇보다도, 네트 워크 어댑터를 버스를 통해 프로세싱 시스템에 연결하는 데 사용될 수 있다. 네트워크 어댑터는 신호 프로세싱 기능들을 구현하는 데 사용될 수 있다. 특정 양태들의 경우, 사용자 인터페이스(예컨대, 키패드, 디스플레이, 마우스, 조이스틱 등)가 또한 버스에 연결될 수 있다. 버스는 또한 타이밍 소스들, 주변기기들, 전압"}
{"patent_id": "10-2024-7015205", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "조절기들, 전력 관리 회로들 등과 같은 다양한 다른 회로들을 링크할 수 있으며, 이들은 당해 기술분야에 잘 알 려져 있고 따라서 더 이상 설명되지 않을 것이다. 프로세서는, 머신 판독가능 매체에 저장된 소프트웨어의 실행을 비롯하여, 버스의 관리 및 일반적 프로세싱을 담당할 수 있다. 프로세서는 하나 이상의 범용 및/또는 특수-목적 프로세서들로 구현될 수 있다. 예들은 마이 크로프로세서들, 마이크로제어기들, DSP 프로세서들, 및 소프트웨어를 실행할 수 있는 다른 회로부를 포함한다. 소프트웨어는, 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 기술 언어 또는 다른 용어로 지칭되든지 에 관계없이, 명령들, 데이터 또는 이들의 임의의 조합을 의미하도록 넓게 해석되어야 한다. 머신 판독가능 매 체들은 예로서, RAM(random access memory), 플래시 메모리, ROM(read only memory), PROM(programmable read- only memory), EPROM(erasable programmable read-only memory), EEPROM(electrically erasable programmable Read-only memory), 레지스터들, 자기 디스크들, 광 디스크들, 하드 드라이브들, 또는 임의의 다른 적합한 저장 매체, 또는 이들의 임의의 조합을 포함할 수 있다. 머신 판독가능 매체들은 컴퓨터 프로그램 제품으로 구현될 수 있다. 컴퓨터 프로그램 제품은 패키징 재료들을 포함할 수 있다. 하드웨어 구현예에서, 머신 판독가능 매체는 프로세서와 별개인 프로세싱 시스템의 일부일 수 있다. 그러나, 당업자가 용이하게 이해할 바와 같이, 머신 판독가능 매체, 또는 그것의 임의의 부분은 프로세싱 시스템의 외부 에 있을 수 있다. 예로서, 머신 판독가능 매체는 송신선, 데이터에 의해 변조된 반송파, 및/또는 디바이스와는 별개인 컴퓨터 제품을 포함할 수 있으며, 이들 모두는 버스 인터페이스를 통해 프로세서에 의해 액세스될 수 있 다. 대안적으로 또는 추가적으로, 머신 판독가능 매체들 또는 이들의 임의의 부분은 프로세서로 통합될 수 있 으며, 이를테면, 그 경우는 캐시 및/또는 범용 레지스터 파일들이 해당될 수 있다. 논의된 다양한 컴포넌트들 은 국소 컴포넌트와 같은 특정 위치를 갖는 것으로 설명될 수 있지만, 이러한 컴포넌트들은 또한 다양한 방식들 로 구성될 수 있는데, 이를테면 특정 컴포넌트들이 분산 컴퓨팅 시스템의 일부로서 구성된다. 프로세싱 시스템은, 프로세서 기능을 제공하는 하나 이상의 마이크로프로세서들 그리고 머신 판독가능 매체의 적어도 일부를 제공하는 외부 메모리를 가지며 이들 모두가 외부 버스 아키텍처를 통해 다른 지원 회로와 함께 링크되는, 범용 프로세싱 시스템으로서 구성될 수 있다. 대안으로, 프로세싱 시스템은 설명된 뉴럴 시스템들의 모델들 및 뉴런 모델들을 구현하기 위한 하나 이상의 뉴로모픽(neuromorphic) 프로세서들을 포함할 수 있다. 다른 대안으로서, 프로세싱 시스템은 프로세서, 버스 인터페이스, 사용자 인터페이스, 지원 회로부 및 머신 판 독가능 매체들의 적어도 일부가 단일 칩으로 통합된 ASIC(application specific integrated circuit), 또는 하 나 이상의 FPGA(field programmable gate array)들, PLD(programmable logic device)들, 제어기들, 상태 머신 들, 게이티드(gated) 로직, 이산 하드웨어 컴포넌트들, 또는 임의의 다른 적합한 회로부, 또는 본 개시내용 전 반에 걸쳐 설명된 다양한 기능을 수행할 수 있는 회로들의 임의의 조합으로 구현될 수 있다. 당업자들은, 특정 애플리케이션 및 전체 시스템에 부과된 전체 설계 제약들에 따라 프로세싱 시스템에 대한 설명된 기능을 최상으 로 구현하는 방법을 인지할 것이다. 머신 판독가능 매체는 다수의 소프트웨어 모듈들을 포함할 수 있다. 소프트웨어 모듈들은, 프로세서에 의해 실 행되는 경우, 프로세싱 시스템으로 하여금 다양한 기능들을 수행하게 하는 명령들을 포함한다. 소프트웨어 모 듈들은 송신 모듈 및 수신 모듈을 포함할 수 있다. 각각의 소프트웨어 모듈은 단일 저장 디바이스에 상주할 수 있거나, 또는 다수의 저장 디바이스들에 걸쳐 분산될 수 있다. 예로서, 소프트웨어 모듈은 트리거링 이벤트가 발생할 때 하드 드라이브로부터 RAM으로 로딩될 수 있다. 소프트웨어 모듈의 실행 동안, 프로세서는 액세스 속 도를 증가시키기 위해 명령들 중 일부를 캐시로 로딩할 수 있다. 이어서, 하나 이상의 캐시 라인들은 프로세서 에 의한 실행을 위해 범용 레지스터 파일로 로딩될 수 있다. 아래에서 소프트웨어 모듈의 기능을 참조할 때, 그러한 기능이 그 소프트웨어 모듈로부터의 명령들을 실행할 때 프로세서에 의해 구현된다는 것이 이해될 것이다. 더욱이, 본 개시내용의 양태들은 프로세서, 컴퓨터, 머신, 또는 이러한 양태들을 구현하는 다른 시스템의 기능에 대한 개선들을 야기한다고 인식되어야 한다. 소프트웨어로 구현되는 경우, 상기 기능들은 컴퓨터 판독가능 매체 상에 하나 이상의 명령 또는 코드로서 저장 되거나 이를 통해 송신될 수 있다. 컴퓨터 판독가능 매체들은, 일 장소에서 다른 장소로의 컴퓨터 프로그램의 전송을 용이하게 하는 임의의 매체를 포함한 통신 매체들 및 컴퓨터 저장 매체들 둘 모두를 포함한다. 저장 매 체는 컴퓨터에 의해 액세스가능한 임의의 이용가능한 매체일 수 있다. 제한이 아닌 예로서, 이러한 컴퓨터 판 독가능 매체는 RAM, ROM, EEPROM, CD-ROM, 또는 다른 광학 디스크 저장소, 자기 디스크 저장소 또는 다른 자기 저장 디바이스들, 또는 명령들 또는 데이터 구조들의 형태로 요구되는 프로그램 코드를 전달하거나 저장하기 위 해 사용될 수 있으며 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 추가로, 임의의 연 결이 컴퓨터 판독가능 매체로 적절히 지칭된다. 예컨대, 소프트웨어가 동축 케이블, 광섬유 케이블, 연선 (twisted pair), 디지털 가입자 라인(digital subscriber line, DSL), 또는 (적외선(infrared, IR), 라디오, 및 마이크로파와 같은) 무선 기술들을 사용하여 웹사이트, 서버, 또는 다른 원격 소스로부터 송신되면, 동축 케 이블, 광섬유 케이블, 연선, DSL, 또는 (적외선, 라디오, 및 마이크로파와 같은) 무선 기술들이 매체의 정의에포함된다. 본 명세서에서 사용된 바와 같은 디스크(disk) 및 디스크(disc)는 컴팩트 디스크(disc)(CD), 레이저 디스크(disc), 광학 디스크(disc), DVD(digital versatile disc), 플로피 디스크(disk), 및 Blu-ray® 디스크 (disc)를 포함하며, 여기서, 디스크(disk)들은 일반적으로 데이터를 자기적으로 재생하지만, 디스크(disc)들은 레이저들을 이용하여 광학적으로 데이터를 재생한다. 따라서, 일부 양태들에서, 컴퓨터 판독가능 매체들은 비 일시적 컴퓨터 판독가능 매체들(예컨대, 유형의(tangible) 매체들)을 포함할 수 있다. 부가적으로, 다른 양태 들에 대해, 컴퓨터 판독가능 매체들은 일시적 컴퓨터 판독가능 매체들(예컨대, 신호)을 포함할 수 있다. 위의 것들의 조합들이 또한 컴퓨터 판독가능 매체들의 범위 내에 포함되어야 한다. 따라서, 특정한 양태들은 본 명세서에서 제시되는 동작들을 수행하기 위한 컴퓨터 프로그램 제품을 포함할 수 있다. 예를 들어, 이러한 컴퓨터 프로그램 제품은 명령들이 저장(및/또는 인코딩)된 컴퓨터 판독가능 매체를 포함할 수 있고, 명령들은 설명된 동작들을 수행하도록 하나 이상의 프로세서들에 의해 실행가능하다. 특정 양 태들에 대해, 컴퓨터 프로그램 제품은 패키징 재료를 포함할 수 있다. 추가로, 설명된 방법들 및 기법들을 수행하기 위한 모듈들 및/또는 다른 적절한 수단은 적용가능한 경우에 사용 자 단말 및/또는 기지국에 의해 다운로딩될 수 있고/있거나 다른 방식으로 획득될 수 있다고 인식되어야 한다. 예를 들어, 그러한 디바이스는 서버에 커플링되어, 설명된 방법들을 수행하기 위한 수단의 전달을 용이하게 할 수 있다. 대안으로, 설명된 다양한 방법들은 저장 수단(예컨대, RAM, ROM, CD(compact disc) 또는 플로피 디스 크와 같은 물리 저장 매체 등)을 통해 제공되어, 사용자 단말 및/또는 기지국이 저장 수단을 디바이스에 커플링 또는 제공할 때 다양한 방법들을 획득할 수 있도록 할 수 있다. 더욱이, 설명된 방법들 및 기법들을 디바이스 에 제공하기 위한 임의의 다른 적당한 기법이 이용될 수 있다. 청구항들이 위에서 예시되는 바로 그 구성 및 컴포넌트들로 제한되지 않는다는 것을 이해할 것이다. 다양한 변 형들, 변경들 및 변화들이 청구항들의 범주를 벗어나지 않으면서 설명된 방법들 및 장치의 배열, 동작 및 세부 사항들에서 이루어질 수 있다.도면 도면1 도면2a 도면2b 도면2c 도면2d 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2024-7015205", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시내용의 특징들, 본질 및 이점들은 도면들과 함께 받아들여질 때 아래 제시되는 상세한 설명으로부터 보 다 명백해질 것이며, 도면들에서는 비슷한 참조 부호들이 전체에 걸쳐 대응하게 식별한다. 도 1은 본 개시내용의 특정 양태들에 따른, 범용 프로세서를 포함하는, SOC(system-on-a-chip)를 사용하는 뉴럴 네트워크의 예시적인 구현예를 예시한다. 도 2a, 도 2b 및 도 2c는 본 개시내용의 양태들에 따른 뉴럴 네트워크를 예시하는 도면들이다. 도 2d는 본 개시내용의 양태들에 따른, 예시적인 심층 콘볼루션 네트워크(DCN)를 예시하는 도면이다. 도 3은 본 개시내용의 양태들에 따른, 예시적인 심층 콘볼루션 네트워크(DCN)를 예시하는 블록도이다. 도 4는 본 개시내용의 양태들에 따른, 인공 지능(artificial intelligence, AI) 기능들을 모듈화(modularize) 할 수 있는 예시적인 소프트웨어 아키텍처를 예시하는 블록도이다. 도 5 내지 도 7은 본 개시내용의 양태들에 따른, 흐름 애그노스틱 비디오 압축(flow-agnostic video compression)을 위한 예시적인 아키텍처들을 예시하는 블록도들이다. 도 8 내지 도 10은 본 개시내용의 양태들에 따른, 인공 뉴럴 네트워크를 사용하는 비디오 압축을 위한 예시적인 프로세스들을 예시하는 흐름도들이다."}
