{"patent_id": "10-2020-0125814", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0042687", "출원번호": "10-2020-0125814", "발명의 명칭": "순환 신경망", "출원인": "김학철", "발명자": "김학철"}}
{"patent_id": "10-2020-0125814", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "센서에 의하여, 센서 정보가 획득되는 센서 정보 획득단계;관리서버에 의하여, 순환 신경망(RNN)의 학습여부가 확인되는 학습여부 확인단계;상기 관리서버에 의하여, 상기 순환 신경망(RNN)이 학습되고 있지 않다면, 상기 순환 신경망(RNN)을 기반으로상기 센서 정보가 이용되어 상기 센서의 고장여부가 판단되는 고장여부 판단단계; 및상기 관리서버에 의하여, 상기 센서의 고장여부 판단결과가 관리자 단말기로 전송되는 판단결과 전송단계;를 포함하는 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법."}
{"patent_id": "10-2020-0125814", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 고장여부 판단단계는, 상기 센서의 현재 상태를 진단할 수 있도록 상기 센서 정보가 이용되어 상기 센서의 고장여부가 진단되는 고장여부 진단단계; 및상기 센서의 앞으로의 상태를 예측할 수 있도록 상기 센서 정보가 이용되어 상기 센서의 고장여부가 예측되는고장여부 예측단계; 중 적어도 하나를 포함하는 것을 특징으로 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법."}
{"patent_id": "10-2020-0125814", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 상기 고장여부 진단단계는, 상기 관리서버에 의하여, 자카드 유사도 처리기법으로 상기 센서 정보와 상기 순환 신경망(RNN)에 기 학습된 센서 정보가 처리되고, 상기 센서의 고장 정도가 표시된 센서레벨이 도출되는 센서레벨 도출단계;상기 관리서버에 의하여, 상기 센서레벨이 기 저장된 기준레벨 이상이면 안정레벨로 분류되고, 상기 기준레벨미만이면 위험레벨로 분류되는 센서레벨 분류단계;상기 관리서버에 의하여, 상기 센서레벨이 위험레벨이면 상기 센서가 고장이라고 진단되고, 상기 위험레벨의 심각도가 반영된 진단결과가 도출되는 진단결과 도출단계; 및상기 관리서버에 의하여, 상기 진단결과가 도출된 후 상기 센서 정보가 순환 신경망(RNN) 내에서 학습되는 센서정보 학습단계;를 포함하는 것을 특징으로 하는 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부판단방법."}
{"patent_id": "10-2020-0125814", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서, 상기 고장여부 예측단계는, 상기 관리서버에 의하여, 상기 순환 신경망(RNN)에 상기 센서 정보가 입력되면 예측 정보가 출력되는 예측 정보출력단계;상기 관리서버에 의하여, 상기 순환 신경망(RNN) 내 활성화 함수에 따라 자카드 유사도 처리기법 또는 코사인유사도 처리기법 중 적어도 하나가 사용되어 상기 예측 정보와 상기 순환 신경망(RNN)에 기 학습된 예측 정보가처리되고, 상기 센서의 고장이 예측된 예측레벨이 도출되는 예측레벨 도출단계;공개특허 10-2022-0042687-3-상기 관리서버에 의하여, 상기 예측레벨이 기 저장된 기준레벨 이상이면 안정레벨로 분류되고, 상기 기준레벨미만이면 위험레벨로 분류되는 예측레벨 분류단계; 및 상기 관리서버에 의하여, 상기 예측레벨이 위험레벨이면 상기 센서가 고장날 것이라고 예측되고, 상기 위험레벨의 심각도가 반영된 예측결과가 도출되는 예측결과 도출단계;를 포함하는 것을 특징으로 하는 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법."}
{"patent_id": "10-2020-0125814", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 고장여부 예측단계는,상기 관리서버에 의하여, 상기 예측결과가 도출된 후 상기 예측 정보가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보를 기준으로 상기 순환 신경망(RNN)에 학습여부가 판단되는 학습여부 판단단계; 및상기 관리서버에 의하여, 상기 예측 정보가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보를 기준으로 오차범위 이내이면 상기 순환 신경망(RNN)에 학습되는 예측 정보 학습단계;를 더 포함하고,상기 예측 정보 학습단계는,상기 예측 정보가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보를 기준으로 오차범위 이외이면 상기 순환 신경망(RNN)에 학습되지 않고 삭제되는 것을 특징으로 하는 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법."}
{"patent_id": "10-2020-0125814", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법에 관한 것으로, 보다 구체적으로 센서 에 의하여, 센서 정보가 획득되는 센서 정보 획득단계, 관리서버에 의하여, 순환 신경망(RNN)의 학습여부가 확인 되는 학습여부 확인단계, 상기 관리서버에 의하여, 상기 순환 신경망(RNN)이 학습되고 있지 않다면, 상기 순환 신경망(RNN)을 기반으로 상기 센서 정보가 이용되어 상기 센서의 고장여부가 판단되는 고장여부 판단단계 및 상 기 관리서버에 의하여, 상기 센서의 고장여부 판단결과가 관리자 단말기로 전송되는 판단결과 전송단계를 포함하 는 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법에 관한 것이다."}
{"patent_id": "10-2020-0125814", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법에 관한 것으로, 보다 구체적으로 순 환 신경망(RNN)을 기반으로 스마트팜 내 설치된 다수 개의 센서의 개별 특성을 고려하여 고장 여부를 진단 및 예측하는 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법에 관한 것이다."}
{"patent_id": "10-2020-0125814", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 국내 농업은 인력난, 자재비, 유통채널의 비용 문제로 인해, 농가의 경영악화가 가속화되고 있다. 이를 극 복하기 위하여 정부에서는 4차 산업과 뉴딜 정책으로 인공지능(AI), 빅데이터 등을 포함하는 정보통신(IT), 생 명공학(BT), 나노공학(NT) 등과 농업이 융합된 스마트팜을 형성하고자 적극적인 노력을 하고 있다. 이 과정에서, 스마트팜이 설치 및 운영되고 있는 농가가 점점 늘어나고 있다. 스마트팜의 핵심은 농가 내 설비 및 장치에 부착된 다양한 종류의 센서들로부터 수집된 데이터를 기반으로 농가를 관리 및 제어하는 것임으로, 각종 센서에 이상이 발생할 경우 오류로 인해 농가의 운영관리에 큰 경제적 손실 및 인명피해로 이어질 수 있는 문제점이 있다. 일반적인 산업분야의 고장진단은 퍼지이론, 통계적 추론 등을 적용한 연구가 활발한 편이나, 스마트팜은 다양한 장치로부터 측정되는 각종 데이터, 습도가 많은 농장의 환경적 요인, 요구사항의 복잡성 등으로 인하여 일반적 인 산업분야의 고장진단 기술을 바로 적용하기 위해서는 한계가 있고, 이에 따른 스마트팜 전용의 센서 고장 진 단 방법이나 유지보수를 위한 의사결정지원 방법이 필요하다. 관련문헌 1은 스마트팜 정보 관리 시스템 및 이를 이용한 스마트팜 정보 관리 방법, 이를 수행하기 위한 기록매 체에 관한 것으로, 관리 대상 작물의 생육 정보에 따라 변하는 판매 금액 정보를 포함하는 상품 판매 정보를 생 성하거나 또는 패키징된 상품 판매 정보를 생성할 수 있어 판매자가 관리 대상 작물로 보다 높은 수익을 올릴 수 있으나, 실질적으로 관리 대상 작물의 생육 정보를 도출하는 센서의 고장 유무를 판단할 수 없어 생육 정보 의 신뢰성을 입증할 수 없는 단점이 있다. 관련문헌 2는 인공지능 스마트팜 관리 시스템에 관한 것으로, 인공지능 기반의 환경제어 알고리즘을 이용하여 학습한 후 복수의 제어 대상기기를 제어하거거나 주기적으로 업데이트할 수 있으나, 스마트팜 내 다종의 센서들 로부터 데이터를 획득하는데 초점이 맞춰져 있고, 이에 따라 스마트팜의 자동화를 실현할 수 있는 데이터를 획 득 센서의 고장을 진단 및 예측할 수 없다.선행기술문헌 특허문헌 (특허문헌 0001) KR 10-1726257 (특허문헌 0002) KR 10-2018-0076766"}
{"patent_id": "10-2020-0125814", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로 스마트팜 내 다수 개의 센서의 개별 특성에 따른 각각의 활성화 함수를 통한 순환 신경망(RNN) 계열 방식으로 학습된 모델의 다수 개의 패턴맵을 이용하여, 고장여부를 진단하고 스마트팜의 신뢰성을 향상시킬 수 있도록 자카드 유사도 처리기법을 기반으로 센서 정보가 이용되어 센서 고장 정도가 표시된 센서레벨과 기 저장된 기준레벨이 비교된 후 센세레벨이 분류되고, 분류된 센서레벨에 따라서 고장여부가 진단되고 관리자에게 전송되는 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방 법을 얻고자 하는 것을 목적으로 한다. 또한, 본 발명은 다수 개의 센서의 상태를 미리 예측하여 관리자가 미연에 센서의 교체 및 보수를 할 수 있도록 각각의 활성화 함수를 통한 순환 신경망(RNN) 계열 방식으로 학습된 모델의 다수 개의 패턴맵(feature map)에 따라 상기 센서의 고장이 예측된 예측레벨이 도출되고, 상기 예측레벨이 기 저장된 기준레벨 이상이면 안정레벨 로 분류되고, 상기 기준레벨 미만이면 위험레벨로 분류되어 관리자의 단말기로 전송되는 순환 신경망(RNN)을 이 용한 스마트팜 센서의 고장여부 판단방법을 얻고자 하는 것을 목적으로 한다."}
{"patent_id": "10-2020-0125814", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법은 센 서에 의하여, 센서 정보가 획득되는 센서 정보 획득단계; 관리서버에 의하여, 순환 신경망(RNN)의 학습여부가 확인되는 학습여부 확인단계; 상기 관리서버에 의하여, 상기 순환 신경망(RNN)이 학습되고 있지 않다면, 상기 순환 신경망(RNN)을 기반으로 상기 센서 정보가 이용되어 상기 센서의 고장여부가 판단되는 고장여부 판단단계; 및 상기 관리서버에 의하여, 상기 센서의 고장여부 판단결과가 관리자 단말기로 전송되는 판단결과 전송단계;를 제공한다."}
{"patent_id": "10-2020-0125814", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명에 본 발명은 자카드 유사도 처리기법을 기반으로 센서 정보가 이용되어 센서 고장 정도가 표시된 센서레벨과 기 저장된 기준레벨이 비교된 후 센세레벨이 분류되고, 분류된 센서레벨에 따라서 고장여부 가 진단되고 관리자에게 전송되도록 구비함으로써, 스마트팜 내 다수 개의 센서의 개별 특성을 고려하여 고장여 부를 진단하고 스마트팜의 신뢰성을 향상시킬 수 있는 효과가 있다. 본 발명은 순환 신경망(RNN) 내 각각의 활성화 함수를 통한 순환 신경망(RNN) 계열 방식으로 학습된 모델의 다 수의 패턴맵(feature map)에 따라 상기 센서의 고장이 예측된 예측레벨이 도출되고, 상기 예측레벨이 기 저장된 기준레벨 이상이면 안정레벨로 분류되고, 상기 기준레벨 미만이면 위험레벨로 분류되어 관리자의 단말기로 전송 되도록 구비함으로써, 다수 개의 센서의 상태를 미리 예측하여 관리자가 미연에 센서의 교체 및 보수를 할 수 있는 효과가 있다."}
{"patent_id": "10-2020-0125814", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 본 발명의 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법을 상세히 설명하기로 한다. 도 1은 본 발명의 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법 흐름도이다. 도 2는 본 발명의 일실시예에 따른 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단 시스템 구성도이다. 도 3은 본 발명의 일실시예에 따른 관리서버 및 데이터베이스를 표시한 도면이다. 도 2 내지 도 3을 보면, 본 발명의 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법이 실행되기 위하여, 다수 개의 스마트팜 단지 내에는 센서(100a, 100b, 100n), 상기 센서(100a, 100b, 100n)를 제어하는 통합제어기 및 내부서버를 포함할 수 있다. 여기서, 상기 하나의 스마트팜 단지 내 다수 개의 센서가 구비될 수 있다. 다음으로, 상기 다수 개의 스마트팜 단지로부터 센서 정보를 전송받고 관리서버로 전송하는 중계서 버를 포함할 수 있다. 상기 중계서버는 유무선 상 양방향으로 센서 정보를 전송할 수 있도록 웹 또는 모바일 소 프트웨어로 구비될 수 있고, 관리자 단말기가 유무선 통신방식으로 연결되어 상기 센서 정보 등에 접근할 수 있다. 다음으로, 상기 중계서버와 통신 가능하도록 연결되고 상기 센서 정보를 처리하는 관리서버를 포 함할 수 있다. 상기 관리서버는 센서 정보 수집부, 전처리부, 센서 정보 학습부, 고장 여부 판단부를 포함 할 수 있다. 상기 센서 정보 수집부는 상기 센서(100a, 100b, 100n)로부터 온도, 일사량, 습도, CO2, 토양습도, 강우, 풍향, 풍속, EC, pH, 지온 등의 센서 정보를 전송받아 수집할 수 있다. 상기 전처리부는 상기 관리서버 가 이용하기 용이하도록 상기 센서 정보를 샘플링, FFT, 필터처리를 포함하는 전처리를 할 수 있다. 상기 센서 정보 학습부 순환 신경망(RNN)을 포함하여 상기 센서별 특징을 추출할 수 있고, 상기 센서 정보를 이용하 여 학습할 수 있다. 그리고 상기 고장 여부 판단부는 상기 기 학습된 센서 정보 및 상기 센서 정보를 이용하여 상기 센서(100a, 100b, 100n)의 고장 여부를 판단할 수 있다. 이때, 상기 고장 여부를 판단함에 있어서, 현재 상기 센서(100a, 100b, 100n)의 고장 여부를 진단하거나, 앞으로의 고장을 예측할 수 있다. 상기 관리서버는 상기 센서 정보를 처리한 후 생성되는 정보를 연결된 데이터베이스에 저장하거나 불 러올 수 있다. 도 1을 보면, 본 발명의 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법은 센서 정보 획득단계 (S100), 학습여부 확인단계(S200), 고장여부 판단단계(S300) 및 판단단계 전송단계(S400)를 포함한다. 보다 구체적으로, 상기 센서 정보 획득단계(S100)는 센서(100a,100b, 100n)에 의하여, 센서 정보가 획득된다. 가장 바람직하게, 상기 센서(100a, 100b, 100n)는 스마트팜 내 장비에 인접하게 설치될 수 있고, 설치된 위치를 기점으로 스마트팜의 온도, 일사량, 습도, CO2, 토양습도, 강우, 풍향, 풍속, pH, 지온 등을 측정한 후 센서 정 보를 생성한다. 그리고 상기 센서 정보는 시계열 데이터를 포함하는 비정형 데이터일 수 있다. 비정형 데이터는 일반적으로 일정한 규격이나 형태를 지닌 숫자 데이터와 달리 그림이나, 영상, 문서처럼 구조화되지 않은 데이 터를 일컫는다. 또한, 상기 센서 정보는 해당 센서의 센서ID를 포함할 수 있다. 이에 따라, 상기 센서 정보 획득단계(S100)는 상기 센서ID가 이용되어 상기 데이터베이스에 기 저장된 상기 센서의 테이블에 접근될 수 있고, 상기 테이블에 저장된 상기 센서(100a, 100b, 100n)의 종류, 제조사, 설치시기, 설치위치가 상기 센서 정보로 획득될 수 있다. 다음으로, 상기 학습여부 확인단계(S200)는 상기 관리서버에 의하여, 순환 신경망(RNN)의 학습여부가 확인 된다. 상기 순환 신경망(RNN)은 실시간 또는 일정기간 동안 입력된 데이터를 학습하게 되는데, 학습하는 도중에 새로운 센서 정보가 들어오게 되면 기 입력된 정보와 상기 센서 정보와 충돌이 발생될 수 있고, 이로 인해 정확 한 출력 정보가 도출될 수 없다. 따라서 상기 학습여부 확인단계(S200)는 상기 고장여부 판단단계(S300) 전에 상기 순환 신경망(RNN)의 학습여부를 확인하여 상기와 같은 문제점이 발생되지 않도록 하기 위함이다. 다시 말하면, 상기 학습여부 확인단계(S200)는 상기 순환 신경망(RNN)이 학습중이라면 상기 고장여부 판단단계 (S300)로 넘어가지 않고 대기된다. 그리고 일정 시간간격으로 상기 순환 신경망(RNN)의 학습여부가 확인된다. 상기 순환 신경망(RNN)이 학습이 끝났거나, 학습중이 아니라면 상기 고장여부 판단단계(S300)로 넘어간다. 한편, 상기 순환 신경망(RNN)은 실시간 학습과정을 다수 번 반복하는 과정에서 수많은 학습모델이 생성될 수 있 다. 이러한 학습모델은 결과의 편향성을 판단하여, 편향성이 적은 모델은 추후 학습된 모델의 다수 개의 패턴맵 (feature map)에 적용하거나, 편향성이 많은 모델은 추후 학습된 모델의 다수 개의 패턴맵(feature map)에 제외 시키는 과정을 반복할 수 있다. 이에 따라, 본 순환 신경망(RNN)의 센서의 고장진단에 대한 정확도의 성능을 높 일 수 있는 효과가 있다. 다음으로, 상기 고장여부 판단단계(S300)는 상기 관리서버에 의하여, 상기 순환 신경망(RNN)이 학습되고 있지 않다면, 상기 순환 신경망(RNN)을 기반으로 상기 센서 정보가 이용되어 상기 센서(100a, 100b, 100n)의 고 장여부가 판단된다. 이때, 상기 고장여부 판단단계(S300)는 고장여부 진단단계(S310) 및 고장여부 예측단계(S320) 중 적어도 하나를 포함할 수 있다. 상기 고장여부 진단단계(S310)는 상기 센서(100a, 100b, 100n)의 현재 상태가 진단될 수 있도록 상기 센서 정보 가 이용되어 상기 센서(100a, 100b, 100n)의 고장여부가 진단될 수 있다. 다음으로, 상기 고장여부 예측단계(S320)는 상기 센서(100a, 100b, 100n)의 앞으로의 상태가 예측될 수 있도록 상기 센서 정보가 이용되어 상기 센서(100a, 100b, 100n)의 고장여부가 예측될 수 있다. 다음으로, 상기 판단결과 전송단계(S400)는 상기 관리서버에 의하여, 상기 센서(100a, 100b, 100n)의 고장 여부 판단결과가 관리자 단말기로 전송된다. 고장여부 진단 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 상기 고장여부 진단단계(S310)를 보다 구체적으로 설명 해본다. 도 4는 본 발명의 고장여부 진단단계 세부흐름도이다. 도 5는 본 발명의 일실시예에 따른 위험레 벨, 안정레벨 및 기준레벨을 표시한 도면이다. 우선, 도 4를 보면, 상기 고장여부 진단단계(S310)는 센서레벨 도출단계(S311), 센서레벨 분류단계(S312), 진단 결과 도출단계(S313) 및 센서 정보 학습단계(S314)를 포함할 수 있다. 보다 구체적으로, 상기 센서레벨 도출단계(S311)는 상기 관리서버에 의하여, 자카드 유사도 처리기법으로 상기 센서 정보와 상기 순환 신경망(RNN)에 기 학습된 센서 정보가 처리되고, 상기 센서(100a, 100b, 100n)의 고장 정도가 표시된 센서레벨이 도출될 수 있다. 여기서, 자카드 유사도(Jaccard Similarity) 처리기법은 일반적으로 두 집합이 있을 때, 두 집합의 합집합에 대 한 교집합의 비율을 표시한 것으로 0과 1 사이의 값을 갖는다. 즉, 두 집합이 동일하다면 교집합과 합집합은 동 일하므로 최대값인 1이 도출될 수 있고, 두 집합이 완전히 상이하다면 교집합이 0이므로 최소값인 0이 도출될 수 있다. 다시 말하면, 상기 센서레벨 도출단계(S311)는 상기 센서 정보 획득단계(S100)로부터 획득된 상기 센서 정보 (A)와 상기 순환 신경망(RNN)에 기 학습된 센서 정보(B)가 각각의 집합(A, B)이 되어 합집합에 대한 교집합 비 율이 도출되고, 이를 센서레벨이라고 한다. 가장 바람직하게, 상기 센서 레벨은 0과 1 사이의 값을 가질 수 있 다. 다음으로, 상기 센서레벨 분류단계(S312)는 상기 관리서버에 의하여, 상기 센서레벨이 기 저장된 기준레벨 이상이면 안정레벨로 분류되고, 상기 기준레벨 미만이면 위험레벨로 분류될 수 있다. 도 5를 보면, 상기 관리서버에 사용자에 의하여 임의의 파라미터가 입력되면 상기 파라미터에 따라 자카드 유사도 범위인 0과 1 사이가 임의로 분할될 수 있고, 이에 따라, 다수 개의 레벨이 설정될 수 있다. 또한, 상기 관리서버에 사용자에 의하여 기준레벨이 임의로 설정될 수 있고, 상기 기준레벨에 따라서 0과 1 사이의 다 수 개의 레벨이 위험레벨과 안정레벨로 나눠질 수 있다. 즉, 0과 기준레벨 사이는 위험레벨일 수 있고, 상기 위험레벨이 0에 가까울수록 상기 센서 정보(A)와 상기 순환 신경망(RNN)에 기 학습된 센서 정보(B)의 유사도 적다는 것이므로 심각도가 높을 수 있다. 그리고 기준레벨과 1 사이는 안정레벨일 수 있고, 사이 안정레벨이 1에 가까울수록 상기 센서 정보(A)와 상기 순환 신경망(RNN)에 기 학습된 센서 정보(B)의 유사도가 높은 것이므로 안정도가 높을 수 있다. 다음으로, 상기 진단결과 도출단계(S313)는 상기 관리서버에 의하여, 상기 센서레벨이 위험레벨이면 상기 센서(100a, 100b, 100n)가 고장이라고 진단되고, 상기 위험레벨의 심각도가 반영된 진단결과가 도출될 수 있다. 도 5를 이용하여 예를 들어보면, 상기 진단결과 도출단계(S313)는 상기 센서레벨 분류단계(S312)로부터 상기 센 서레벨이 위험레벨 5로 분류된다면 상기 진단결과로 상기 센서가 “고장”이라고 진단되고, “6단계 중 5단계의 심각도”와 같은 진단결과가 도출될 수 있다. 다음으로, 상기 센서 정보 학습단계(S314) 상기 관리서버에 의하여, 상기 진단결과가 도출된 후 상기 센서 정보가 순환 신경망(RNN) 내에서 학습될 수 있다. 즉, 상기 센서 정보 학습단계(S314)는 상기 센서 정보가 진단 결과만을 도출하고 폐기 또는 단순 저장되는 것이 아닌, 상기 순환 신경망(RNN)의 성능이 지속적으로 향상 및 업데이트될 수 있도록 학습시킬 수 있다. 다만, 상기 센서 정보 학습단계(S314)는 반드시 상기 진단결과가 도출 된 후 진행될 수 있다. 이는 상기 언급한 것과 같이 진단결과가 도출되는 과정에서 상기 순환 신경망(RNN)이 학 습되면 정확한 진단결과가 도출될 수 없기 때문이다. 고장여부 예측 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 상기 고장여부 예측단계(S320)를 보다 구체적으로 설명 해본다. 도 6은 본 발명의 고장여부 예측단계 세부흐름도이다. 도 7은 본 발명의 일실시예에 따른 상기 예측 정 보가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보를 기준으로 오차범위 이외인 경우(a), 오차범위 이내 인 경우(b)를 표시한 도면이다. 우선, 도 6을 보면, 상기 고장여부 예측단계(S320)는 예측 정보 출력단계(S321), 예측레벨 도출단계(S322), 예 측레벨 분류단계(S323), 예측결과 도출단계(S324)를 포함할 수 있다. 보다 구체적으로, 상기 예측 정보 출력단계(S321)는 상기 관리서버에 의하여, 상기 순환 신경망(RNN)에 상 기 센서 정보가 입력되면 예측 정보가 출력될 수 있다. 이때, 상기 순환 신경망(RNN)은 상기 센서 정보가 입력되면 여러 종류의 활성화 함수 중 하나를 이용하여 예측 정보를 출력할 수 있다. 일반적으로, 순환 신경망(RNN) 내 활성화 함수는 입력신호를 처리하여 출력신호를 생성 하는 함수로, 그 종류가 매우 다양하고 어떠한 활성화 함수를 사용하는가에 따라서 상기 출력신호에 영향을 미 치기 때문에 적절한 활성화 함수를 사용하는 것이 필요하다. 다음으로, 상기 예측레벨 도출단계(S322)는 상기 관리서버에 의하여, 상기 순환 신경망(RNN) 내 활성화 함 수에 따라 자카드 유사도 처리기법 또는 코사인 유사도 처리기법 중 적어도 하나가 사용되어 상기 예측 정보와 상기 순환 신경망(RNN)에 기 학습된 예측 정보가 처리되고, 상기 센서의 고장이 예측된 예측레벨이 도출될 수있다. 예컨대, 상기 예측레벨 도출단계(S322)는 상기 활성화 함수가 경사함수(Rectified Linear Unit; ReLU), 시그모 이드 함수(Sigmoid Function) 등이라면 자카드 유사도 처리기법이 사용되어 상기 예측 정보 출력단계(S321)로부 터 출력된 상기 예측 정보(C)와 상기 순환 신경망(RNN)에 기 학습된 예측 정보(D)가 각각의 집합(B, D)이 되어 합집합에 대한 교집합 비율이 도출되고, 이를 예측레벨이라고 한다. 반면에, 상기 예측레벨 도출단계(S322)는 상기 활성화 함수가 tanh 함수(Hyperbolic Tangent Fuction), Leaky ReLU 함수 등이라면 코사인 유사도 처리기법이 사용되어 상기 예측 정보 출력단계(S321)로부터 획득된 상기 예 측 정보( )와 상기 순환 신경망(RNN)에 기 학습된 예측 정보( )의 두 벡터의 방향이 완전히 동일한 경우에는 1 의 값, 90도를 이루면 0의 값, 방향이 반대이면 -1의 값이 도출되고 이를 예측레벨이라고 한다. 이때, 1에 가까 울수록 유사도가 높다고 할 수 있다. 또한, 상기 예측레벨 도출단계(S322)는 상기 활성화 함수가 Max Out 함수, 항등 함수 등이라면 상기 코사인 유 사도와 자카드 유사도 값이 모두 도출되고 이 중에서 큰 값을 예측레벨이라고 한다. 다음으로, 상기 예측레벨 분류단계(S323)는 상기 예측레벨이 기 저장된 기준레벨 이상이면 안정레벨로 분류되고, 상기 기준레벨 미만이면 위험레벨로 분류될 수 있다. 상기 예측레벨이 자카드 유사도 처리기법으로 도출된다면 0과 1 사이 값을 가질 수 있으므로, 0과 1 사이를 임 의로 분할하여 다수 개의 레벨이 설정될 수 있다. 한편, 사용자에 의하여 임의의 파라미터가 입력되면 상기 파 라미터에 따라 자카드 유사도 범위인 0과 1 사이가 임의로 분할될 수 있다. 또한, 사용자에 의하여, 기준레벨이 임의로 설정될 수 있고, 상기 기준레벨에 따라서 0과 1 사이의 다수 개의 레벨이 위험레벨과 안정레벨로 나눠질 수 있다. 즉, 0과 기준레벨 사이는 위험레벨일 수 있고, 상기 위험레벨이 0에 가까울수록 상기 예측 정보( )와 상기 순환 신경망(RNN)에 기 학습된 예측 정보( )의 유사도 적다는 것이므로 심각도가 높을 수 있다. 그리고 기준레벨과 1 사이는 안정레벨일 수 있고, 상기 안정레벨이 1에 가까울수록 상기 예측 정보(C)와 상기 순환 신경망(RNN)에 기 학습된 예측 정보(D)의 유사도가 높은 것이므로 안정도가 높을 수 있다. 또한, 상기 예측레벨이 코사인 처리기법으로 도출된다면 -1과 1 사이 값을 가질 수 있으므로, -1과 1 사이를 임 의로 분할하여 다수 개의 레벨이 설정될 수 있다. 한편, 사용자에 의하여 임의의 파라미터가 입력되면 상기 파 라미터에 따라 코사인 유사도 범위인 -1과 1 사이가 임의로 분할될 수 있다. 또한, 사용자에 의하여, 기준레벨 이 임의로 설정될 수 있고, 상기 기준레벨에 따라서 -1과 1 사이의 다수 개의 레벨이 위험레벨과 안정레벨로 나 눠질 수 있다. 즉, -1과 기준레벨 사이는 위험레벨일 수 있고, 상기 위험레벨이 -1에 가까울수록 상기 예측 정보( )와 상기 순 환 신경망(RNN)에 기 학습된 예측 정보( )의 두 벡터의 방향의 유사도 적다는 것이므로 심각도가 높을 수 있다. 그리고 기준레벨과 1 사이는 안정레벨일 수 있고, 상기 안정레벨이 1에 가까울수록 상기 예측 정보( )와 상기 순환 신경망(RNN)에 기 학습된 예측 정보( )의 유사도가 높은 것이므로 안정도가 높을 수 있다. 다음으로, 상기 예측결과 도출단계(S324)는 상기 예측레벨이 위험레벨이면 상기 센서(100a, 100b, 100n)가 고장 날 것이라고 예측되고, 상기 위험레벨의 심각도가 반영된 예측결과가 도출될 수 있다. 도 5로 예를 들어보면, 상기 예측결과 도출단계(S324)는 상기 예측레벨 분류단계(S323)로부터 상기 예측레벨이 위험레벨 5로 분류된다면 상기 예측결과로 상기 센서가 고장이 날 것이라고 예측되고, “6단계 중 5단계의 심각 도”와 같은 예측결과가 도출될 수 있다. 다음으로, 본 발명의 고장여부 예측단계(S320)는, 상기 순환 신경망(RNN)이 학습되는데 있어서, 학습여부 판단 단계(S325) 및 예측 정보 학습단계(S326)가 더 포함될 수 있다. 보다 구체적으로, 상기 학습여부 판단단계(S325)는 상기 관리서버에 의하여, 상기 예측결과가 도출된 후 상기 예측 정보가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보를 기준으로 상기 순환 신경망(RNN)에 학 습여부가 판단될 수 있다. 다음으로, 예측 정보 학습단계(S326)는 상기 관리서버에 의하여, 상기 예측 정보가 상기 순환 신경망(RN N)으로부터 기 학습된 예측 정보를 기준으로 오차범위 이내이면 상기 순환 신경망(RNN)에 학습될 수 있다. 반면에, 상기 예측 정보 학습단계(S326)는, 상기 예측 정보가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보가 기준으로 오차범위 이외이면 상기 순환 신경망(RNN)에 학습되지 않고 삭제되는 것을 특징으로 한다. 이 에 따, 오차가 심한 노이즈와 같은 예측 정보는 학습되도록 하지 않고, 유의미한 예측 정보만이 학습되도록 하 여 상기 순환 신경망(RNN)의 성능을 보다 높일 수 있는 효과가 있다. 도 7의 (a)를 보면, 상기 예측 정보(초록색 그래프)가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보(파 란색 그래프)를 기준으로 오차범위 이외인 경우를 표시한 것으로, 상기 예측 정보(초록색 그래프)는 노이즈로 임으로, 상기 순환 신경망(RNN)에 학습되지 않고 삭제될 수 있다. 도 7의 (b)를 보면, 상기 예측 정보(초록색 그래프)가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보(파 란색 그래프)를 기준으로 오차범위 이내인 경우를 표시한 것으로, 상기 예측 정보(초록색 그래프)는 유의미한 정보임으로, 상기 순환 신경망(RNN)에 학습될 수 있다. 즉, 상기 순환 신경망(RNN)은 실시간 학습과정을 다수 번 반복하는 과정에서 수많은 학습모델이 생성될 수 있다. 이러한 학습모델은 결과의 편향성을 판단하여, 편향성이 적은 모델은 추후 학습된 모델의 다수 개의 패턴 맵(feature map)에 적용하거나, 편향성이 많은 모델은 추후 학습된 모델의 다수 개의 패턴맵(feature map)에 제 외시키는 과정을 반복할 수 있다. 이에 따라, 본 순환 신경망(RNN)의 센서의 고장예측에 대한 정확도의 성능을 높일 수 있는 효과가 있다. 순환 신경망(RNN) 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 본 발명의 순환 신경망(RNN)에 대해서 설명해본다. 도 8은 본 발명의 일실시예에 따른 다수 개의 장기 의존성 판단부 및 베리에이션 오토 인코더를 포함하는 Seq2Seq 기반의 신경망 모델을 표시한 도면이다. 도 9는 본 발명의 일실시예에 따른 베리에티션 오토 인코더의 구조를 표시한 도면이다. 한편, 본 발명의 순환 신경망(RNN)은 상기 센서 정보가 비정형 형식이면 Seq2Seq기반의 신경망 모델이 이용될 수 있고, 상기 센서 정보가 정형 형식이면 LSTM기반의 신경망 모델이 이용될 수 있다. 여기서, 상기 Seq2Seq기반의 신경망 모델은 일반적으로 순환 신경망의 가장 발전한 형태의 아카텍처로 순환 신 경망 내 셀을 깊고 넓게 쌓아서 복잡하고 방대한 시퀀스 데이터를 처리하는데 특화된 모델이고, 타 모델의 경우 입력 차원과 출력차원이 정의된 상태에서 학습 및 예측이 가능하나, Seq2Seq기반의 신경망 모델은 입력차원과 출력차원의 정의에서 비교적 자유로운 특징이 있다. 또한, 비정형 데이터는 일반적으로 일정한 규격이나 형태를 지닌 숫자 데이터와 달리 그림이나, 영상, 문서처럼 형태와 구조가 다른 구조화되지 않은 데이터를 일컫는다. 따라서, 본 발명의 상기 센서 정보가 비정형 형식이면 Seq2Seq기반의 신경망 모델이 이용되어 비정형 형식의 복 잡하고 방대한 시퀀스 데이터로 이루어진 센서 정보가 용이하게 처리되어 예측레벨이 도출될 수 있도록 하는 효 과가 있다. 도 8 내지 도 9를 보면, 본 발명의 상기 Seq2Seq기반의 신경망 모델은 인코더 부분의 벡터가 일정 차원 이상이 되면 문맥 전환(Context Switch)이 가능하도록 다수 개의 장기 의존성 판단부 및 베리에티션 오토 인코더 (Variational Auto Encoder; VAE)를 포함할 수 있다. 가장 바람직하게, 하나 이상의 장기 의존성 판단부 및 베 리에티션 오토 인코더(VAE)를 포함할 수 있다. 상기 장기 의존성 판단부는 상기 순환 신경망(RNN) 모델의 장기 의존성 문제가 해결되기 위하여 사용자로부터 설정된 파라미터 또는 상기 순환 신경망(RNN)의 성능 지표 결과를 기준으로 상기 순환 신경망(RNN)에 기 학습된 센서 정보 또는 예측 정보가 사라지는 정도에 따라 장기 의존성 여부를 판단할 수 있다. 또한, 상기 베리에티션 오토 인코더(VAE)는 상기 장기 의존성 판단부로부터 장기 의존성이 판단되면 문맥 전환 (Context Switch)을 통해 상기 순환 신경망(RNN)의 인코더 부분의 차원을 축소하고, 확률공간(Z)을 거쳐 다시 복원과정인 디코딩를 진행하도록 할 수 있다. 이에 따라, 순환 신경망(RNN)의 차원이 커질수록 오히려 학습능력 이 저하되는 종래의 문제점인 순환 신경망(RNN)의 장기 의존성 문제를 해결할 수 있는 효과가 있다. 일반적으로, 순환 신경망(RNN) 모델은 장기 의존성 문제로 신경망의 은닉층의 단계가 많아지면서, 과거의 정보 가 마지막까지 전달되는 못하는 현상이 발생된다. 즉, 정보와 정보 사이의 거리가 상당히 멀어질 경우 역전파에대한 변화량이 점점 줄어들어 순환 신경망(RNN)의 학습능력이 저하된다. 이러한 현상을 보완하고자 장단기 메모 리(Long Short-Term Memory; LSTM) 모델이 제안되었지만, 완전한 해결방안이 되지 못한다. 이와 같은 문제점을 해결하고자, 본 발명의 순환 신경망(RNN)은 비정형 형식의 센서 정보를 처리하기 위하여 가 장 바람직하게 인코더 부분의 벡터가 일정 차원 이상이 되면 문맥 전환(Context Switch)이 가능하도록 다수 개 의 장기 의존성 판단부 및 베리에티션 오토 인코더(Variational Auto Encoder; VAE)를 포함하는 Seq2Seq기반의 신경망 모델일 수 있다. 다음으로, LSTM기반의 신경망 모델은 장단기 기억을 위해 사용되는 순환 신경망 아키텍처로 표준 신경망과 달리 피드백이 가능하여 단일 데이터뿐만 아니라 음성 또는 비디오와 같은 전체 데이터 시퀀스를 처리할 수 있는 모 델이다. 또한, 정형 데이터는 미리 정해 놓은 형식과 구조에 따라 저장되도록 구성된 데이터로써, 시스템에 쉽 게 적용할 수 있도록 잘 알려진 포맷이나 명확한 데이터 구조를 갖는 스프레드시트 데이터, 콤마 구조가 결정되 는 시에스브이(CSV) 데이터 등이 포함될 수 있다. 따라서 상기 센서 정보가 정형 형식이면 LSTM기반의 신경망 모델이 이용되어 상기 센서 정보가 신속하게 처리되는 효과가 있다."}
{"patent_id": "10-2020-0125814", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2020-0125814", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단방법 흐름도이다. 도 2는 본 발명의 일실시예에 따른 순환 신경망(RNN)을 이용한 스마트팜 센서의 고장여부 판단 시스템 구성도이 다. 도 3은 본 발명의 일실시예에 따른 관리서버 및 데이터베이스를 표시한 도면이다.도 4는 본 발명의 고장여부 진단단계 세부흐름도이다. 도 5는 본 발명의 일실시예에 따른 위험레벨, 안정레벨 및 기준레벨을 표시한 도면이다. 도 6은 본 발명의 고장여부 예측단계 세부흐름도이다. 도 7은 본 발명의 일실시예에 따른 상기 예측 정보가 상기 순환 신경망(RNN)으로부터 기 학습된 예측 정보를 기 준으로 오차범위 이외인 경우(a), 오차범위 이내인 경우(b)를 표시한 도면이다. 도 8은 본 발명의 일실시예에 따른 다수 개의 장기 의존성 판단부 및 베리에이션 오토 인코더를 포함하는 Seq2Seq기반의 신경망 모델을 표시한 도면이다. 도 9는 본 발명의 일실시예에 따른 베리에티션 오토 인코더의 구조를 표시한 도면이다."}
