{"patent_id": "10-2021-0168110", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0080699", "출원번호": "10-2021-0168110", "발명의 명칭": "운송수단용 인포테인먼트 시스템", "출원인": "(주)케이앤엘정보시스템", "발명자": "김영진"}}
{"patent_id": "10-2021-0168110", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자에 의해 휴대되고 설정 인터넷망에 접속 가능하며 정보의 송·수신 및 출력이 가능한 사용자부(100);사용자부(100)와 설정 통신망을 통해 연결되며, 정보의 송·수신과 적어도 하나 이상의 구획으로 구분되어 설정정보의 출력 및 신호의 입력이 가능하고, 송·수신되는 정보를 학습하는 컨텐츠부(200);컨텐츠부(200)와 연동되어 사용자부(100)와 컨텐츠부(200)의 연동 신호를 감지 및 산출하고 컨텐츠부(200)를 제어하는 관리자부(300);로 구성하여 미디어 및 정보 제공과 운송수단 탑승객 수를 카운팅 가능한 것에 특징이 있는 운송수단용 인포테인먼트 시스템."}
{"patent_id": "10-2021-0168110", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 컨텐츠부(200)는,인터넷망에 연결되어 정보 및 신호를 송·수신하는 송수신부(210);미디어 정보, 위치 정보, 광고 정보가 저장되고 저장된 정보에 대한 학습이 가능한 데이터베이스부(220);데이터베이스부(220)에 저장된 정보를 학습한 다음 설정 신호에 따라 전송되게끔 하는 머신러닝부(230);적어도 하나 이상의 구획으로 구분된 화면을 제공하고 설정 신호의 입력이 가능한 제어부(240);를 포함하는 운송수단용 인포테인먼트 시스템."}
{"patent_id": "10-2021-0168110", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 송수신부(210)는,인터넷망에 연결되어 선택에 따라 사용자부(100)와 연동 가능하고 사용자부(100)에 설정 정보 전송 및 신호의송·수신이 가능하며 사용자부(100)의 연동 여부를 판별 카운팅하는 사용자연동부(211);인터넷망에 연결되어 선택에 따라 관리자부(300)와 연동 가능하고 관리자부(300)에 설정 신호의 송·수신이 가능한 관리자연동부(212);GPS를 통해 운행 노선을 결정하고 시각화 정보로 변환한 다음 출력되도록 하는 운행노선연동부(213)를 포함하고,상기 데이터베이스부(220)는,미디어 정보 저장되는 미디어베이스(221);위치 정보, 길 안내 정보가 저장되는 위치베이스(222);광고 정보가 저장되는 광고베이스(223);를 포함하고,상기 머신러닝부(230)는, 공개특허 10-2023-0080699-3-데이터베이스부(220)에 저장된 정보를 토대로 사전학습을 진행하는 제1트레이닝부(231);제1트레이닝부(231)와 연계되어 입력되는 신호와 광고 정보를 비교 판별하여 추천 광고를 추출한 다음 전송하는제2트레이닝부(232);를 더 포함하는 운송수단용 인포테인먼트 시스템."}
{"patent_id": "10-2021-0168110", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 제어부(240)는,적어도 하나 이상의 구획으로 구분된 화면을 제공하면서 설정 신호의 입력이 가능한 출력부(241);출력부 상에 출력되는 정보를 전송하고 설정 신호를 송부받아 데이터베이스부(220)에 저장된 정보를 관리하는유지관리부(242);를 포함하는 운송수단용 인포테인먼트 시스템."}
{"patent_id": "10-2021-0168110", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 머신러닝부(230)는 인공신경망(ANN;Artificial Neural Newworks)에 기반하여 설계된 머신러닝(machinelearning) 방법 중 하나인 딥 러닝(deep learning) 알고리즘을 사용하는 것이며, 판별서버는 딥 러닝 알고리즘모델 중 컨볼루션 신경망(CNN, Convolution Neural Network)알고리즘을 채용하면서 해당 신경망의 입출력 방식으로는 ResNet(Residual network)알고리즘을 채용하여 이루어지는 운송수단용 인포테인먼트 시스템."}
{"patent_id": "10-2021-0168110", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 멀티미디어 등 유의미한 컨텐츠를 제공하여 운송수단을 단순 이동수단이 아닌 문화공간으로 변모시켜 운송수단 탑승객의 만족감을 제고할 뿐만 아니라 소비자 니즈를 충족시키고, 운행자 및 관리자의 관념에서 탑승 객의 수를 카운팅할 수 있어 관광자원의 활용과 유동 인구의 통계적 자료를 마련할 수 있어 유지·관리에 편의성 (뒷면에 계속)"}
{"patent_id": "10-2021-0168110", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 운송수단용 인포테인먼트 시스템에 관한 것으로서, 멀티미디어 등 유의미한 컨텐츠를 제공하여 운송 수단을 단순 탑승객들의 이동수단이 아닌 문화공간으로 변모시켜 탑승객의 만족감을 제고할 뿐 아니라 소비자 니즈를 적극 충족시키고, 운행자 및 관리자의 관념에서 탑승객의 수를 카운팅할 수 있어 관광자원의 활용과 유 동 인구의 통계적 자료를 마련할 수 있는 등 유지·관리에 편의성을 제고하는 운송수단용 인포테인먼트 시스템 에 관한 것이다."}
{"patent_id": "10-2021-0168110", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인포테인먼트 시스템은 사용자에게 정보를 제공하기 위해 이용되는 시스템이며, 이러한 정보는 통상적으로 음향, 시각 또는 이들의 조합 형태로 제공될 수 있다. 종래의 운송수단(자동차, 선박, 비행기 등)은 보수적인 물건이자 이동의 수단으로만 여겨졌는데, IT가 결합되어 안전한 운행과 주행의 즐거움이 함께 공존하는 공간으로 탈바꿈되고, 특히 근래 자율주행 시대로의 진입되어 차 량 운행 중 즐길 수 있는 인포테인먼트의 중요성이 더욱 커졌다. 장거리 운행 탑승객의 경우 그 공간은 단순 이 동수단이 아닌 휴식 및 업무공간, 문화생활 공간이 되길 바란다. 인포테인먼트 시스템은 승객에게는 영화, 음악, 뉴스, 전자지도 및 각종 정보를 제공하고 승무원은 이러한 인포 테인먼트 시스템 제어, 통신 모니터링할 수 있는 기능의 추가가 필요하다.예를 들어, 등록특허 제10-1558369호에 '차량용 인포테인먼트 장치 및 차량용 인포테인먼트 장치 제어방법'에 관한 기술사상이 게시되어 있다. 해당 기술사상은 사용자의 제스처를 인식하는 시스템에 관한 것으로서, 승객에 미디어 제공의 기능은 전무하다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허 제10-1558369호"}
{"patent_id": "10-2021-0168110", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 위의 제반 문제점을 보다 적극적으로 해소하기 위하여 창출된 것으로, 멀티미디어 등 유의미한 컨텐 츠를 제공하여 운송수단을 단순히 탑승객이나 화물의 이동수단이 아닌 문화공간으로 변모시켜 탑승객의 만족감 을 제고할 뿐만 아니라 소비자 니즈를 충족시키고, 운행자 및 관리자의 관념에서 탑승객의 수를 카운팅할 수 있 어 관광자원의 활용과 유동 인구의 통계적 자료를 마련할 수 있어 유지·관리에 편의성을 제고하는 운송수단용 인포테인먼트 시스템을 제공함에 그 목적이 있다."}
{"patent_id": "10-2021-0168110", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "위의 해결 과제를 달성하기 위하여 본 발명에서 제안하는 공공데이터 및 오픈 API를 활용한 상권분석시스템의 구성은 다음과 같다. 본 발명은 사용자에 의해 휴대되고 설정 인터넷망에 접속 가능하며 정보의 송·수신 및 출력이 가능한 사용자부 ; 사용자부와 설정 통신망을 통해 연결되며, 정보의 송·수신과 적어도 하나 이상의 구획으로 구분되 어 설정 정보의 출력 및 신호의 입력이 가능하고, 송·수신되는 정보의 학습이 가능한 컨텐츠부; 컨텐츠부 와 연동되어 사용자부와 컨텐츠부의 연동 신호를 감지 및 산출하고 컨텐츠부를 제어하는 관리자부;로 구성하여 미디어 및 정보 제공과 차량 탑승객 수를 카운팅 가능한 것에 특징이 있다. 상기 컨텐츠부는 인터넷망에 연결되어 정보 및 신호를 송·수신하는 송수신부; 미디어 정보, 위치 정 보, 광고 정보가 저장되고 저장된 정보에 대한 학습이 가능한 데이터베이스부; 데이터베이스부에 저 장된 정보를 학습한 다음 설정 신호에 따라 전송되게끔 하는 머신러닝부; 적어도 하나 이상의 구획으로 구 분된 화면을 제공하고 설정 신호의 입력이 가능한 제어부;를 포함한다. 상기 송수신부는 인터넷망에 연결되어 선택에 따라 사용자부와 연동 가능하고 사용자부에 설정 정보 및 신호의 송·수신이 가능하며 사용자부의 연동 여부를 판별 카운팅하는 사용자연동부; 인터넷 망에 연결되어 선택에 따라 관리자부와 연동 가능하고 관리자부에 설정 신호의 송·수신이 가능한 관 리자연동부; GPS를 통해 운행 노선을 결정하고 시각화 정보로 변환한 다음 출력되도록 하는 운행노선연동 부; 를 포함하고, 상기 데이터베이스부는 미디어 정보 저장되는 미디어베이스; 위치 정보, 안내 정보가 저장되는 위치베이스; 광고 정보가 저장되는 광고베이스;를 포함하고, 상기 머신러닝부 는 데이터베이스부에 저장된 정보를 토대로 사전학습을 진행하는 제1트레이닝부; 제1트레이닝부(23 1)와 연계되어 입력되는 신호와 광고 정보를 비교 판별하여 추천 광고를 추출한 다음 전송하는 제2트레이닝부 ;를 더 포함한다.상기 사용자연동부는 사용자부와 연동 여부에 대한 신호를 감지하는 사용자감지부(211a); 사용자부 로부터 입력되는 신호에 부합하는 데이터베이스부에 저장된 정보 및 미디어를 추출하여 사용자부 로 전송하는 추출전송부(211b); 사용자부와 연동 여부를 감지하여 수치로 카운팅하는 카운팅부 (211c);를 포함한다. 상기 관리자연동부는 설정 신호를 수신하여 사용자부 또는 데이터베이스부에 전송하는 신호분류 부(212a); 제어부에 의해 입력되는 신호를 관리자부로 전송하는 제어신호전송부(212b);를 포함한다. 상기 운행노선연동부는 노선에 대한 운행정보를 수집하는 GPS부(213a); GPS부(213a)에서 운행 노선을 결 정하면 위치베이스에 저장된 위치 정보, 안내 정보를 추출하는 추출부(213b); 추출부(213b)에서 추출된 정 보를 시각화 정보로 변환하는 시각화변환부(213c); 시각화 정보를 제어부의 출력부에 출력되도록 하 는 전송하는 운행노선전송부(213d);를 포함한다. 상기 제어부는 적어도 하나 이상의 구획으로 구분된 화면을 제공하면서 설정 신호의 입력이 가능한 출력부 ; 출력부 상에 출력되는 정보를 전송하고 설정 신호를 송부받아 데이터베이스부에 저장된 정보를 관 리하는 유지관리부;를 포함한다. 상기 관리자부는 컨텐츠부와 연동되어 사용자부와 컨텐츠부의 연동 신호를 감지 및 카운팅 하는 관리자송수신부; 관리자송수신부에 의해 카운팅된 수치를 출력하여 모니터링 가능한 관리자화면 부:를 포함한다. 상기 관리자송수신부는 사용자부와 컨텐츠부의 연동 신호를 확인 감지하는 연동신호감지부 ; 연동신호감지부의 확인 감지된 신호를 카운팅하는 탑승객카운팅부;를 포함하고, 상기 관리자 화면부는 적어도 하나 이상의 구획으로 구분된 화면을 제공하는 관리자화면출력부; 컨텐츠부로 부터 전달되는 정보 및 신호를 출력하고 설정 신호와 정보 입력이 가능한 인터페이스부;를 포함한다."}
{"patent_id": "10-2021-0168110", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 구성으로 이루어지는 본 발명에 의하면, 멀티미디어 및 정보를 제공하여 운송수단을 단순 탑승객의 이동수단이 아닌 문화공간으로 변모시켜 탑승객의 만 족감을 제고할 수 있다. 즉, 소비자 니즈를 적극 충족시켜 장거리 운행에 피로감을 덜어주는 효과와 여행의 즐 거움을 선사함에 따라 국내 관광의 활력을 불어넣을 수 있다. 운행자 및 관리자의 관념에서 탑승객의 수를 카운팅할 수 있어 관광자원의 활용과 유동 인구의 통계적 자료를 마련할 수 있어 유지·관리에 편의성을 제고하는 이점이 있다."}
{"patent_id": "10-2021-0168110", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예를 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예에 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예는 본 발명의 개시가 완전하도록 하고, 본 발명이 속하 는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 그리고 명세서 전문에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한 다. 본 발명은 운송수단용 인포테인먼트 시스템이 탑재되어 운영되는 운송수단에 탑승한 탑승객의 개인 휴대 단말기 무선 기술을 이용하여 컨텐츠를 제공하는 시스템으로서, 컨텐츠 관리, 미디어 관리, 압축, 인코딩/디코딩, 데이 터 동기화, 노선 관리, 오픈 API (open api) 연동, 광고 관리 및 지능형 광고 추천 등을 가능하게 한다. 즉, 멀 티미디어 및 정보를 제공하여 운송수단을 단순 이동수단이 아닌 문화공간으로 변모시켜 탑승객의 만족감을 제고 할 뿐만 아니라 소비자 니즈를 충족시키고, 운행자 및 관리자의 관념에서 탑승객의 수를 카운팅할 수 있어 관광 자원의 활용과 유동 인구의 통계적 자료를 마련할 수 있어 유지·관리에 편의성을 제고하는 운송수단용 인포테 인먼트 시스템에 관한 것임을 주지하여야 한다. 특히, 본 발명을 서술함에 앞서 당해 분야에서 자명한 동작 및 이에 수반되어 필요한 상세 구성의 설명은 생략 되어 있을 수 있다. 이때, 각 구성은 별개의 데이터베이스(DB)를 운용할 수 있고 각 데이터베이스(DB)에서 저장 관리되는 정보가 상호 간 공유되며, 나아가 각 데이터베이스(DB)에 저장 관리되는 정보의 변경, 갱신 등을 확인 하기 위해 별도의 DBMS서버가 포함될 수 있다. 이하, 첨부도면을 참고하여 본 발명의 구성 및 이로 인한 작용, 효과에 대해 일괄적으로 기술하기로 한다. 본 발명은 사용자에 의해 휴대되고 설정 인터넷망에 접속 가능하며 정보의 송·수신 및 출력이 가능한 사용자부 ; 사용자부와 설정 통신망을 통해 연결되며, 정보의 송·수신과 적어도 하나 이상의 구획으로 구분되 어 설정 정보의 출력 및 신호의 입력이 가능하고, 송·수신되는 정보의 학습이 가능한 컨텐츠부; 컨텐츠부 와 연동되어 사용자부와 컨텐츠부의 연동 신호를 감지 및 산출하고 컨텐츠부를 제어하는 관리자부;로 구성하여 미디어 및 정보 제공과 운송수단 탑승객 수를 카운팅 가능한 것에 특징이 있다. 다시 말해, 본 발명은 탑승객이 휴대할 수 있는 전자기기인 사용자부와 멀티미디어를 출력하는 컨텐츠부 , 컨텐츠부에서 출력되는 멀티미디어의 갱신, 공급, 제어, 관리 등을 하는 관리자부로 구분할 수 있다. 각 사용자부, 컨텐츠부, 관리자부는 상호 무선 통신, 예를 들어 와이파이, 이동통신망(LTE, 5G) 등을 통해 연결될 수 있다. 컨텐츠부는 멀티미디어가 출력되고 여기서 멀티미디어라 함은, 뉴스, 영상, 영 화, 음악, 광고 등 시각적으로 표현되는 정보를 망라한다. 특히, 멀티미디어 컨텐츠는 갱신되어야 하고 이러한 갱신은 관리자부와 컨텐츠부의 상호 간 동기화에 의해 이루어질 수 있는바, 이는 본 명세서에 신호 또는 정보의 송·수신으로 표현될 수 있으며, 차량 운행에 대한 정보와 그 운행 노선 인근에 위치 정보, 바꿔 말하면 관광명소 등이 OPEN API 연동으로 컨텐츠부에 출력될 수 있다. 상기 컨텐츠부에 출력되는 멀티미디어는 사용자부에도 동일하게 출력될 수 있고 이는 각 화면 미러링 등으로 이루어질 수 있다. 나아가 각 정보의 유출을 방지하기 위해 별도의 정보 보안이 이루어질 수 있다. 여기 서 정보 보안의 구성은 컨텐츠부 또는 관리자부 중 어느 하나에 포함될 수 있으며, 관리자부에 서 보안된 정보의 관리를 수행할 수 있도록 함이 바람직하다. 상술된 본 발명의 구성을 상세히 설명하면 아래와 같다. 상기 컨텐츠부는 인터넷망에 연결되어 정보 및 신호를 송·수신하는 송수신부; 미디어 정보, 위치 정 보, 광고 정보가 저장되고 저장된 정보에 대한 학습이 가능한 데이터베이스부; 데이터베이스부에 저 장된 정보를 학습한 다음 설정 신호에 따라 전송되게끔 하는 머신러닝부; 적어도 하나 이상의 구획으로 구분된 화면을 제공하고 설정 신호의 입력이 가능한 제어부;를 포함한다. 상기 송수신부는 사용자부 내지 관리자부에서 전송되는 신호 및 정보를 수신하고 정보는 데이터 베이스부로 신호는 각 필요 경로로 송부한다. 또한, 상기 송수신부는 인터넷망에 연결되어 선택에 따라 사용자부와 연동 가능하고 사용자부에 설정 정보 전송하고 및 신호의 송·수신이 가능하며 사용자부의 연동 여부를 판별 카운팅하는 사용자연동 부; 인터넷망에 연결되어 선택에 따라 관리자부와 연동 가능하고 관리자부에 설정 신호의 송· 수신이 가능한 관리자연동부; GPS를 통해 운행 노선을 결정하고 시각화 정보로 변환한 다음 출력되도록 하 는 운행노선연동부;를 포함한다. 상기 사용자연동부의 설정 정보는 멀티미디어 즉, 컨텐츠를 의미하며 이는 데이터베이스부에 저장된 컨텐츠 내지 갱신되는 컨텐츠를 의미한다. 신호의 송·수신은 사용자부로부터 전송되는 신호의 송·수신 및 관리자부로부터 전송되는 신호를 의미한다. 상기 데이터베이스부는 미디어 정보 저장되는 미디어베이스; 위치 정보, 안내 정보가 저장되는 위치 베이스; 광고 정보가 저장되는 광고베이스;를 포함하고, 상기 머신러닝부는 데이터베이스부에 저장된 정보를 토대로 사전학습을 진행하는 제1트레이닝부 ; 제1트레이닝부와 연계되어 입력되는 신호와 광고 정보를 비교 판별하여 추천 광고를 추출한 다음 전송하는 제2트레이닝부;를 더 포함한다. 상기 머신러닝부는 인공신경망(ANN;Artificial Neural Newworks)에 기반하여 설계된 머신러닝(machine learning) 방법 중 하나인 딥 러닝(deep learning) 알고리즘을 사용한다. 딥 러닝(deep learnig)알고리즘은 선 행학습에 의한 변수에 대응하는 능력을 갖추고 있으며 판별서버는 딥 러닝 알고리즘 모델 중 컨볼루션 신경망 (CNN, Convolution Neural Network)알고리즘을 채용하면서 해당 신경망의 입출력 방식으로 ResNet(Residual network)알고리즘을 더 채용한다. 이를 더 상세하게 설명하자면, 위 컨볼루션 신경망(CNN, Convolution Neural Network)은 비정형적 정보를 학습하는 다수의 신경망층을 갖고 있으며 해당 신경망의 일반적인 정보의 학습은 비정형적 정보가 선행 레이어에 입력되고 출력된 정보가 다시 후행 레이어에 입력되고 출력되면서 하나의 결과 값을 도출하는 알고리즘이다. 이 때, 보다 많은 학습을 위해 신경망층이 과도하게 중첩되어 일정 갯수 이상이 되면 2개의 신경망층 사이의 입출력에 오류가 발생하여 판별이 정확하게 이루어지지 않는다. 이러한 문제점을 보완하고자 선행 레이어의 입력을 후행 레이어의 출력으로 연결시키는 Resnet(Residual network)알고리즘을 더 채용하는 것이다. 이와 같은 딥 러닝 알고리즘을 통해 데이터베이스의 각 정보를 학습하고 광고 정보를 학습하여 선호도 순, 노선 별 추천 광고 출력을 할 수 있다. 상기 사용자연동부는 사용자부와 연동 여부에 대한 신호를 감지하는 사용자감지부(211a); 사용자부 로부터 입력되는 신호에 부합하는 데이터베이스부에 저장된 정보 및 미디어를 추출하여 사용자부 로 전송하는 추출전송부(211b); 사용자부와 연동 여부를 감지하여 수치로 카운팅하는 카운팅부 (211c);를 포함한다. 상기 사용자감지부(211a)의 연동 여부에 대한 신호 감지는 상호 커넥트 된 상태에 있는지 여부를 의미하며, 사 용자부로부터 입력되는 신호는 데이터베이스부에 저장된 컨텐츠를 불러오는 신호로 볼 수 있다. 이러한 동작 외 상기 카운팅부(211c)에 의해 탑승객이 컨텐츠부의 이용 여부를 확인하며, 더 나아가 당해 운송수단 노선의 탑승객 수를 카운팅할 수 있다. 상기 관리자연동부는 설정 신호를 수신하여 사용자부 또는 데이터베이스부에 전송하는 신호분류 부(212a); 제어부에 의해 입력되는 신호를 관리자부로 전송하는 제어신호전송부(212b);를 포함한다. 상기 설정 신호란 사용자부에서 전송되는 제어 신호 즉, 컨텐츠 선택의 신호 및 이에 따른 데이터베이스부 의 컨텐츠 추출 신호 등이 될 수 있다. 상기 운행노선연동부는 노선에 대한 운행정보를 수집하는 GPS부(213a); GPS부(213a)에서 운송수단 운행 노선을 결정하면 위치베이스에 저장된 위치 정보, 안내 정보를 추출하는 추출부(213b); 추출부(213b)에서 추출된 정보를 시각화 정보로 변환하는 시각화변환부(213c); 시각화 정보를 제어부의 출력부에 출력 되도록 하는 전송하는 운행노선전송부(213d);를 포함한다. 상기 운행노선연동부는 당연 네비게이션 시스템이 접목되는 것으로 생각하면 충분히 이해될 수 있는 구성 이며, 본 발명은 안내 정보를 네비게이션 정보에 추가되도록 하는바, 여기서 안내 정보란 운행 노선 인근의 관 광명소, 맛집 등의 정보 등을 의미하며 이는 OPEN API 연동으로 실행될 수 있다. 상기 제어부는 적어도 하나 이상의 구획으로 구분된 화면을 제공하면서 설정 신호의 입력이 가능한 출력부 ; 출력부 상에 출력되는 정보를 전송하고 설정 신호를 송부받아 데이터베이스부에 저장된 정보를 관 리하는 유지관리부;를 포함한다. 상기 출력부의 설정 신호란 화면 출력의 제어, 컨텐츠인 멀티미디어 선택을 의미하고, 유지관리부의 설정 신호는 관리자부로부터 전송되는 제어 신호이거나 출력부에서 입력되는 각 제어, 선택 신호를 의미한 다. 즉, 해당 유지관리부는 저장된 콘텐츠의 삭제, 갱신 등의 동작을 구현하는데 의미가 있다. 상기 관리자부는 컨텐츠부와 연동되어 사용자부와 컨텐츠부의 연동 신호를 감지 및 카운팅 하는 관리자송수신부; 관리자송수신부에 의해 카운팅된 수치를 출력하여 모니터링 가능한 관리자화면 부:를 포함한다. 상기 관리자부는 총괄 관리 신호를 전송하거나 사용자부와 컨텐츠부의 연동 여부를 감지하여 탑 승객의 수를 카운팅하는데 그 의미가 있다. 카운팅 된 운송수단 탑승객의 수는 관리자화면부에 출력되어 실시간 모니터링 가능하다. 이를 위해 상기 관리자송수신부는 사용자부와 컨텐츠부의 연동 신호를 확인 감지하는 연동신호 감지부; 연동신호감지부의 확인 감지된 신호를 카운팅하는 탑승객카운팅부;를 포함하고, 상기 관리자화면부는 적어도 하나 이상의 구획으로 구분된 화면을 제공하는 관리자화면출력부; 컨텐츠부 로부터 전달되는 정보 및 신호를 출력하고 설정 신호와 정보 입력이 가능한 인터페이스부;를 포함한 다. 위와 같은 본 발명에 따르면, 멀티미디어 및 정보를 제공하여 운송수단을 단순 이동수단이 아닌 문화공간으로 변모시켜 운송수단 탑승객의 만족감을 제고할 수 있다. 즉, 소비자 니즈를 적극 충족시켜 장거리 운행에 피로감 을 덜어주는 효과와 여행의 즐거움을 선사함에 따라 국내 및 국외 관광의 활력을 불어넣을 수 있다. 운행자 및 관리자의 관념에서 탑승객의 수를 카운팅할 수 있어 관광자원의 활용과 유동 인구의 통계적 자료를 마련할 수 있어 유지·관리에 편의성을 제고하는 이점이 있다. 이상에서 설명한 본 발명은, 도면에 도시된 일실시 예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시 예가 가능하다는 점을 명확히 하여야 할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0168110", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명인 운송수단용 인포테인먼트 시스템의 구성도. 도 2는 본 발명인 운송수단용 인포테인먼트 시스템의 블럭도. 도 3은 본 발명인 운송수단용 인포테인먼트 시스템의 컨텐츠부의 상세 블럭도."}
