{"patent_id": "10-2022-0172954", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0087342", "출원번호": "10-2022-0172954", "발명의 명칭": "메타버스 심리 상담 서비스 시스템", "출원인": "주식회사 마인드브이알", "발명자": "이대엽"}}
{"patent_id": "10-2022-0172954", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메타버스 심리 상담 서비스 시스템에 있어서,메타버스 환경을 제공하는 메타버스 제공부;심리상담에 참여하는 사람들의 목소리 높낮이, 말투, 단어로 구성된 음성 정보를 수집하는 수집부;상기 수집된 음성 정보를 기초로 심리 분석을 위한 인공지능 기반의 학습모델을 생성하는 모델 생성부; 및심리상담을 의뢰하는 의뢰자로부터 음성 정보를 수집한 후, 음성 정보를 상기 인공지능 기반의 학습모델에 입력으로 인가하여, 상기 의뢰자에 매칭되는 심리 분석 결과를 산출하는 산출부를 포함하는 메타버스 심리 상담 서비스 시스템."}
{"patent_id": "10-2022-0172954", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 메타버스 심리 상담 서비스 시스템은 메타버스 환경을 제공하는 메타버스 제공부; 심리상담에 참여하는 사람들의 목소리 높낮이, 말투, 단어로 구성된 음성 정보를 수집하는 수집부; 상기 수집된 음성 정보를 기초로 심리 분석을 위한 인공지능 기반의 학습모델을 생성하는 모델 생성부; 및 심리상담을 의뢰하는 의뢰자로부터 음성 정보를 수집한 후, 음성 정보를 상기 인공지능 기반의 학습모델에 입력 으로 인가하여, 상기 의뢰자에 매칭되는 심리 분석 결과를 산출하는 산출부 를 포함한다."}
{"patent_id": "10-2022-0172954", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 메타버스 심리 상담 서비스 시스템에 대한 것이다."}
{"patent_id": "10-2022-0172954", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "메타버스(metaverse)란, 가상, 초월을 의미하는 '메타(meta)'와 세계, 우주를 의미하는 '유니버스(universe)'의 합성어로, 현실과 연동된 3차원의 가상 세계를 의미한다. 최근, 대용량의 정보를 고속으로 전송할 수 있는 5G 통신망이 확충되면서, 생활형 또는 게임형 가상 세계를 지 원하는 다양한 형태의 메타버스 서비스들이 등장하고 있다. 이러한 메타버스 서비스는, 메타버스 서비스에 가입한 회원들이 메타버스 환경에서 자신의 아바타를 활성화시킬 수 있도록 함으로써, 활성화된 아바타를 통해 교육, 쇼핑 등 개인적인 활동을 하거나, 자신의 아바타에 다양한 디지털 아이템들을 적용시킬 수 있도록 하는 기능을 제공한다. 회원들은 이러한 기능을 활용하여, 물리적인 제 약 없이 메타버스 환경에서, 자신이 원하는 활동을 하거나, 아바타에 다양한 디지털 아이템들을 적용시킴으로써 재미와 만족감을 얻을 수 있다. 이러한 메타버스 세계에서 사람들의 심리상담을 제공하는 서비스 시스템에 대한 연구가 필요하다."}
{"patent_id": "10-2022-0172954", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 메타버스 심리 상담 서비스 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0172954", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 메타버스 심리 상담 서비스 시스템은 메타버스 환경을 제공하는 메타버스 제공부; 심리상담에 참여하는 사람들의 목소리 높낮이, 말투, 단어로 구성된 음성 정보를 수집하는 수집부; 상기 수집된 음성 정보를 기초로 심리 분석을 위한 인공지능 기반의 학습모델을 생성하는 모델 생성부; 및 심리상담을 의뢰하는 의뢰자로부터 음성 정보를 수집한 후, 음성 정보를 상기 인공지능 기반의 학습모델에 입력 으로 인가하여, 상기 의뢰자에 매칭되는 심리 분석 결과를 산출하는 산출부 를 포함한다."}
{"patent_id": "10-2022-0172954", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 메타버스 심리 상담 서비스 시스템을 제공하는 효과가 있다."}
{"patent_id": "10-2022-0172954", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명에 따른 실시예들을 첨부된 도면을 참조하여 상세하게 설명하기로 한다. 이러한 설명은 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구 성요소에 대해 사용하였으며, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 본 명세서 상"}
{"patent_id": "10-2022-0172954", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "에서 사용되는 모든 용어들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 사람에 의해 일반적으로 이해 되는 것과 동일한 의미를 가지고 있다. 본 문서에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구 성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, 본 발명의 다양한 실시예들에 있어서, 각 구성요소들, 기능 블록들 또는 수단들은 하나 또는 그 이상의 하부 구성요소로 구성될 수 있고, 각 구성요소들이 수행하는 전기, 전자, 기계적 기능들은 전자회로, 집적회로, ASIC(Application Specific Integrated Circuit) 등 공지된 다양한 소자들 또는 기계적 요소들로 구현될 수 있으며, 각각 별개로 구현되거나 2 이상이 하나로 통합되어 구현될 수도 있다. 한편, 첨부된 블록도의 블록들이나 흐름도의 단계들은 범용 컴퓨터, 특수용 컴퓨터, 휴대용 노트북 컴퓨터, 네 트워크 컴퓨터 등 데이터 프로세싱이 가능한 장비의 프로세서나 메모리에 탑재되어 지정된 기능들을 수행하는 컴퓨터 프로그램 명령들(instructions)을 의미하는 것으로 해석될 수 있다. 이들 컴퓨터 프로그램 명령들은 컴 퓨터 장치에 구비된 메모리 또는 컴퓨터에서 판독 가능한 메모리에 저장될 수 있기 때문에, 블록도의 블록들 또 는 흐름도의 단계들에서 설명된 기능들은 이를 수행하는 명령 수단을 내포하는 제조물로 생산될 수도 있다. 아 울러, 각 블록 또는 각 단계는 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 명령들을 포 함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 가능한 실시예들에서는 블록들 또는 단계들에서 언급된 기능들이 정해진 순서와 달리 실행되는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 또는 단계들은 실질적으로 동시에 수행되거나, 역순으로 수행될 수 있으며, 경우 에 따라 일부 블록들 또는 단계들이 생략된 채로 수행될 수도 있다. 도 1은 본 발명의 메타버스 심리 상담 서비스 시스템에 대한 것이다. 메타버스 제공부는 메타버스 환경을 제공한다. 수집부는 심리상담에 참여하는 사람들의 목소리 높낮이, 말투, 단어로 구성된 음성 정보를 수집한다. 모델 생성부는 상기 수집된 음성 정보를 기초로 심리 분석을 위한 인공지능 기반의 학습모델을 생성한다. 여기서, 인공지능 기반의 학습모델은 DNN, CNN, RNN, LSTM 등의 학습모델들이 활용될 수 있다. 산출부는 심리상담을 의뢰하는 의뢰자로부터 음성 정보를 수집한 후, 음성 정보를 상기 인공지능 기반의 학습모델에 입력으로 인가하여, 상기 의뢰자에 매칭되는 심리 분석 결과를 산출한다. 본 발명은 컴퓨터와의 결합을 통해 실행시키기 위한 저장매체에 저장된 컴퓨터 프로그램으로 구현될 수 있다. 또한, 본 발명은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가 능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단 독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 이상과 같이 본 발명에서는 구체적인 구성 요소 등과 같은 특정 사항들과 한정된 실시예 및 도면에 의해 설명되 었으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명은 상기의 실시예에 한정되 는 것은 아니며, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2022-0172954", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 메타버스 심리 상담 서비스 시스템에 대한 것이다."}
