{"patent_id": "10-2022-0073126", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0122934", "출원번호": "10-2022-0073126", "발명의 명칭": "하수처리시설 중계펌프장의 수위계", "출원인": "박두현", "발명자": "박두현"}}
{"patent_id": "10-2022-0073126", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "온라인으로 감시되며, 가이드파이프 안에 플로우트가 삽입되어 수위를 따라 승하강을 하는, 하수처리시설 중계펌프장의 수위계에 있어서,상기 플로우트는 플로우트상체, 플로우트하체, 신축장치를 포함하고,상기 신축장치는 결합축, 결합공, 고정장치를 포함하고,상기 결합축은 상기 플로우트상체의 저면으로부터 수직 아래로 돌출되며,상기 결합공은, 상기 결합축에 대응하여, 상기 플로우트하체의 상면으로부터 수직 아래로 천공되고,상기 결합축이 상기 결합공에 끼워져 조립되면서 상기 플로우트의 크기가 조절되고,상기 고정장치는 결합축볼트고정홈, 하체볼트고정홈, 고정볼트를 포함하고,상기 하체볼트고정홈은, 상기 고정볼트에 대응되게, 상기 플로우트하체에 수평방향으로 천공되고,상기 결합축볼트고정홈은, 수직으로 이격된 복수 개가 각각, 상기 결합축에 수평방향으로 천공되고,상기 고정볼트는, 상기 결합축볼트고정홈과 상기 하체볼트고정홈에 일시에 끼워져, 상기 조립된 상태를 유지하고,상기 플로우트의 내부에는 금속부재의 중량체가 삽입되는,하수처리시설 중계펌프장의 수위계."}
{"patent_id": "10-2022-0073126", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 하수처리시설의 중계펌프장 수위를 감지하는 수위계와 그 플로우트(Float)에 관한 것이다. 정보통신 기술의 발전에 따라 최근 중계펌프장은, 수위계 내의 플로우트 작동여부를 모니터링 하기 위하여 AI, 스마트기기 등이 부가되며, 중계펌프장의 수위계에 CCTV 카메라와 엑추에이터(actuator)를 설치하고, 원거리에서 (뒷면에 계속)"}
{"patent_id": "10-2022-0073126", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 중계펌프장의 수위를 감지하는 수위계와 그 플로우트에 관한 것으로 중계펌프장이 사용되는 하수처리 시설은, 하수처리장의 집수조로 하수를 집수하여서 하수처리공정에 유입하여 하수를 처리한다. 이 때, 자연적인 하수의 흐름으로 집수가 불가한 일부 또는 전체 지역은, 하수가 집수조로 가는 중간 위치에 중계펌프장을 설치 하여 강제적인 흐름을 유도하여 하수를 집수조로 압송한다. 통상, 중계펌프장은 소량의 하수가 모여 일정 수위 이상이 되었을 때에만 펌프가 작동하고. 일정 수위 이하가 되면 펌프의 작동을 중단하는 방식으로 운전되고 있다. 따라서, 중계펌프장의 수위를 감지하는 수위계가 필요하 며 수위계의 원활한 작동을 위해서, 부력의 작용으로 수위를 감지해 낼 수 있는 플로우트가 많이 사용되고 있다. 또한 정보통신 기술의 발달로 원거리에서 스마트폰, 모니터 등으로 감시하고 그 처리를 제어하고 돕기 위하여 CCTV 카메라, IOT(사물인터넷), AI(인공지능), IPT 등의 스마트한 기술이 이용되고 있다."}
{"patent_id": "10-2022-0073126", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 중계펌프장의 수위계 플로우트(Float)는 HH; H; L;, LL;의 수위별로 오뚜기타입의 플로우트를 설치 하여 각 수위를 감지하여 수위계 콘트롤러에 신호를 보내어 펌프의 운전을 지시한다. 수위계 내의 플로우트 작동여부를 모니터링 하기 위하여 스마트기기가 부가되며, 스마트기기는 중계펌프장의 수 위계에 CCTV 카메라와 엑추에이터(actuator)를 설치하고, 원거리에서 Wifi, 인터넷 온라인을 통하여 스마트폰과 같은 단말기에 관련 앱(application)을 설치한 후에 그 작동 상황을 감시하고 제어한다. 파이프 형상의 가이드파이프가 세워져 설치되고, 가이드파이프 내에 플로우트가 삽입된 후에, 하수의 수위를 따 라 승하강을 하고, 플로우트는 플로우트 본체의 외주로부터 돌출하는 플로우트돌기를 가진다.관련된 종래기술에, 유체 저장 탱크용의 기어식 레벨 센서에 관한 등록실용신안 제405278호가 제공되어 있는 바, 중심축선이 수직을 이루도록 입설되는 상태로 탱크 상부에 설치되며, 하부에 탱크에 접속되는 나사 접 속 관체를 구비하고, 상부에 나사 체결되는 뚜껑을 구비하고 있는 원통형의 장치 케이싱과; 원통형의 장치 케이 싱내에 수용되도록 설치된다. 그리고 그 중심축선이 수평을 이루어 설치되는 와이어릴 및 태엽 스프링 수용 케이스와; 수용케이스내에 회전할 수 있게 설치되는 와이어릴과; 와이어릴을 고정 장착하고 있으며, 수용케이스의 일측으로 돌출하여 손톱형 공간 으로 연장되는 회전축과; 와이어릴의 일측으로 내측 단부는 회전축에 고정되고, 외측 단부는 수용케이스에 고정 되어 플로우트 하강에 연동하여 와이어릴이 회전할 때 회전축에 감겨져 탄성력을 축적하도록 설치되는 태엽스프 링과; 수용케이스의 상단에 구비되는 지지원판부재와; 지지원판부재상에 고정되는 다회전 볼륨과; 지판지원부재 를 수직으로 관통하여 손톱형 공간측에 연장하는 볼륨축과; 회전축의 회전을 볼륨축에 전달하는 감속기어장치와; 와이어릴에 감겨져 나사 접속관체를 통해 하부로 돌출하여 플로우트를 달아매는 와이어;를 포 함한다."}
{"patent_id": "10-2022-0073126", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 수위계의 플로우트(Float)를 스컴(Scum)으로부터 보호하여 수위감지를 방해하는 요소를 제거하고, 중 계펌프장의 하수를 집수조로 원활하게 압송하여서, 중계펌프장 내부에 수위를 감지하는 플로우트의 작동이 스컴 에 의해 오작동 하지 않도록 보호하고, 스컴의 움직임이 플로우트가 영향을 받지 않도록 하여 현재 수위를 정확 히 감지하도록 한다. 그리고 중계펌프장 수위계의 시설에 따는 상황에 맞는 형태의 플로우트를 현장에서 선택할 수 있도록 제공하여서 플로우트의 작동이 장애 없이 수행되게 한다."}
{"patent_id": "10-2022-0073126", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "온라인으로 감시되며, 가이드파이프 안에 플로우트가 삽입되어 수위를 따라 승하강을 하는, 하수처리시설 중계 펌프장의 수위계에 있어서, 상기 플로우트는 플로우트상체, 플로우트하체, 신축장치를 포함하고, 상기 신축장치는 결합축, 결합공, 고정장치를 포함하고, 상기 결합축은 상기 플로우트상체의 저면으로부터 수직 아래로 돌출되며, 상기 결합공은, 상기 결합축에 대응하여, 상기 플로우트하체의 상면으로부터 수직 아래로 천공되고, 상기 결합축이 상기 결합공에 끼워져 조립되면서 상기 플로우트의 크기가 조절되고, 상기 고정장치는 결합축볼트고정홈, 하체볼트고정홈, 고정볼트를 포함하고, 상기 하체볼트고정홈은, 상기 고정볼트에 대응되게, 상기 플로우트하체에 수평방향으로 천공되고, 상기 결합축볼트고정홈은, 수직으로 이격된 복수 개가 각각, 상기 결합축에 수평방향으로 천공되고, 상기 고정볼트는, 상기 결합축볼트고정홈과 상기 하체볼트고정홈에 일시에 끼워져, 상기 조립된 상태를 유지하 고, 상기 플로우트의 내부에는 금속부재의 중량체가 삽입되는, 하수처리시설 중계펌프장의 수위계를 제공한다."}
{"patent_id": "10-2022-0073126", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 구성에 따르면 스컴(Scum)으로부터 수위계의 플로우트(Float)를 보호하여 수위감지를 방행하여 정확 한 정보제공에 지장을 초래하는 원인을 줄인다. 또한 중계펌프장 수위계의 상황에 따른 플로우트의 형태를 현장 에서 취하여서 플로우트가 그 기능을 최대치로 작동할 수 있도록 한다."}
{"patent_id": "10-2022-0073126", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "먼저, 본 발명과 관련된 배경이 되는 실시예를 보다 상세히 살펴본다. 중계펌프장 내의 기어식 또는 기계식 수 위계에는 플로우트(Float)가 연결되는데, 연결은 보통 연결선(200w)으로 플로우트 상단의 연결부(200p)를 체결하여 이루어진다. 플로우트에는 상당한 중량 및 부력을 부여함이 바람직하다. 예를 들면, 비중은 0.6; 중량은 3.0kg; 길이는 50cm;을 표준으로 하여서 현장의 상황에 맞추어 적절히 증감할 수 있으며, 부재로는 PVE, PP, ABS, PE 등이 가능하고 필요하다면 내부에 금속부재 등의 중량체를 삽입하거나 또는, 그 역으로 부력 을 부여할 기체(공기)층을 형성할 수 있다. 한편, 이와 같은 구성을 설치한 후에 그 작동여부를 모니터링 하기 위하여 스마트 기술을 이용하는 경우도 있다. 가령, 중계펌프장의 수위계에 CCTV 카메라와 엑추에이터 (actuator)를 설치하고, 원거리에서 Wifi, 인터넷 온라인 등을 통하여 스마트폰과 같은 단말기에 관련 앱 (application)을 설치한 후에 그 작동 상황을 감시하고 제어할 수 있는 것이다. 도 1 A을 참조한다. 플로우트의 작동이 이루어지는 구간에는, 유입된 하수의 협잡물 및 이물질 등으로 이루어지는 스컴 (Scum)으로부터 플로우트를 보호할수 있는 가이드파이프(Guide Pipe)를 중계펌프장 최하부에서 최상부의 침수의 영향이 없는 구간까지 설치할 수 있다. 가이드파이프는 그 가이드파이프 상단 및 그 가이드파이프 하단이 개구(open)될 수 있다. 그리고 플로우트를 가이드파이프의 내부에 수직방 향으로 이동할 수 있도록 삽입한다. 이에 따라 플로우트는 가이드파이프 내부에서 하수의 높낮이를 따라서 부상하거나 가라앉으면서 상하 수직방향으로 승하강을 할 수 있게 된다. 물론, 플로우트의 플로우 트 본체 외주 크기는 가이드파이프의 내주와 마찰하여 멈추지 않도록 작아야 한다. 위와 같이 설치되 는 가이드파이프의 역할에 의하면, 외부의 스컴이 가이드파이프 내부로 침투하는 것을 최소화하 여서, 스컴이 플로우트 본체에 고착될 수 있는 환경으로부터 플로우트를 보호한다. 더하여, 하수 의 유입량의 변화가 심하여 발생하는 요동 때문에 플로우트의 승하강이, 외부 영향으로 동요되어서, 안정적으로 작동하지 않는 경우에, 가이드파이프는 외부의 영향으로부터 플로우트를 보호한다. 장기간 수위계를 운전 시에 하수의 수면위로 부상하는 스컴(20, 21)의 경우는, 가이드파이프 상단이 하수의 수면보다 높으므로 가이드파이프에 의해 차단되지만, 하수의 요동이 심하면 부상하여 있던 스컴이 하수의 수면 아래로 내려가서 가이드파이프 하단으로 침투하거나, 요동이 없는 경우라고 하더라도 비중이 큰 스컴은 가이드파이프 하단으로 침투하여 조금씩 쌓여 부착되고 장기간 청소를 실 시하지 않는 경우에는 결국, 가이드파이프 몸통의 내벽에 단단하게 고착되어서 수위계의 작동에 문제를 일 으킬 수 있다. 이를 개선하기 위하여, 도 1 B 및 도 2에서, 플로우트의 외주면 표면에 플로우트돌기가 구비되었다. 플로우트돌기는 플로우트 본체의 외주면을 직접 돌출시켜 형성하거나, 돌기 형태를 별도로 제작한 후 플로우트 본체의 외주면에 부착하여 고정할 수 있다. 플로우트돌기의 역할은, 플로우트의 승하 강 운동시에 가이드파이프 내벽에 부착되는 스컴(20, 22)과 같은 이물질을 강제로 닦아내거나, 밀어내거나, 긁어내거나, 파쇄하여 제거할 수 있다. 공개특허 제93208호(2016.08.08)를 참조한다. 이하, 본 발명의 구체적인 실시예를 개시한다. 도 3 및 도 4에서, 플로우트는 상하 방향으로 신축(길이를 늘리거나 줄임)할 수 있는 신축 수단을 가지며 이를 위하여, 플로우트의 플로우트 본체는 각각 독립 된 플로우트상체과 플로우트하체로 분리되어서 구성되고, 플로우트상체는 플로우트하체의 위에 배치되며 이에 따라서 플로우트하체는 플로우트상체의 아래에 위치한다. 그리고 플로우트 즉, 플로우트 본체는 신축 가능한 신축장치(230p)의 구성을 포함하며, 신축장치(230p)는 결합축, 결합축볼트고정홈(231p), 결합공, 하체볼트고정홈(231q), 고정볼트(231r)를 포함한다. 플로우트상체의 저면 중앙(가운데)에는 봉상(봉, 파이프 형상)을 취하여 수직 아래로 돌출된 결합축 이 {연장되거나, 별도로 제작된 후 결합되어} 구비되며, 플로우트하체의 상면 중앙에서 수직 아래 방향으 로는 결합축의 외형(형상과 크기)에 대응하여 천공(구멍, 홈이 패여 형성)된 결합공이 자리하고, 여 기에 결합축이 끼워져 고정(조립, 결합)된다. 이때, 결합축을 결합공에 필요한 깊이만큼 끼워넣 어서(삽입하여) 플로우트 본체의 크기(길이) 조절을 수행할 수 있다. 플로우트상체와 플로우트하체가 조립되고 크기 조절이 이루어진 후에는 그 상태가 유지될 수 있도록 고정장치의 구성을 포함할 수 있다. 도면 예시의 고정장치는 결합축볼트고정홈(231p), 하체볼트고정홈(231q) 및 고정볼트(231r)로 이루어지며, 고정볼트(231r)는 소정의 길이를 갖는 볼트로 제공되고, 하체볼트고정홈(231q)은 고정볼트(231r)의 외형에 대응되게 플로우트하체의 몸체에 수평방향으로 천공되고, 결합축볼트고정홈 (231p)은 결합축의 몸체 길이를 따라 상하 일정 간격으로 이격된 복수 개 결합축볼트고정홈(231p: 231p1, 231p2, 231p3, 231p4...)이 각각 수평방향으로 천공되어 제공된다. 그리고 조립 시에는, 결합축이 결합공 에 끼워짐과 동시에, 복수 개의 결합축볼트고정홈(231p) 중 선택된 어느 하나에 하체볼트고정홈(231q)이 수평으로 일직선 위치되고, 고정볼트(231r)에 의해 결합축볼트고정홈(231p)과 하체볼트고정홈(231q)이 일시에 끼워져 고정이 이루어진다. 도 4 A는 복수 개의 결합축볼트고정홈(231p) 중에서 위로부터 아래로 세 번째 결합 축볼트고정홈(231p3)이 선택되어 플로우트 본체의 크기가 길게 신장(e1)된 것의 예시이고, 도 4 B는 첫 번 째의 결합축볼트고정홈(231p1)이 선택되어 플로우트 본체의 크기가 짧게 축소(e2)된 것의 예시이다. 상술한 구성을 통하여, 중계펌프장 수위계의 시설 상황에 맞는 알맞은 크기의 플로우트을 현장에서 선택할 수 있는 바 특히, 가이드파이프의 크기(길이)에 대한 플로우트 즉, 플로우트 본체의 크기 비율 을 정하거나, 플로우트의 부력에 대한 고려가 필요하거나, 플로우트의 윗쪽 상부의 플로우트상체 를 어느 정도 수면위로 노출되게 할 것인지 등의 판단과 필요에 따른 적절한 크기를 찾아 적용할 수 있다. 또한, 평소 플로우트를 사용하지 않는 경우 예컨대, 유통, 보관 등의 경우에는 편의를 위하여 부피를 줄일 수 있다. 설치를 위하여 방법적인 측면에서는 단계별로, 위와 같은 구성을 갖는 플로우트를 준비하는 단계와; 현장 의 상황에 따라 플로우트의 크기를 결정하고 플로우트/플로우트 본체의 신축 조절을 수행하는 단계와; 신축 조절이 완료되면 플로우트의 연결부(200p)를 연결선(200w)에 연결 고정하는 단계를; 포함할 수 있다. 연결은 연결선(200w)으로 플로우트 상단의 연결부(200p)를 체결하여 이루어진다. 그리고 가이드 파이프를 사용하는 경우에는 가이드파이프에 플로우트를 삽입하는(집어넣는) 단계를; 아울러 포 함할 수 있다. 더하여 가이드파이프에 플로우트를 삽입하여 사용하는 경우에 있어서 다른 실시예를 함께 살펴본다. 종래에는 플로우트 본체의 외부에 구비된 플로우트돌기를 플로우트 자체의 질량이나 부력이 되 는 자연력으로 가이드파이프의 내벽에 고착된 스컴을 긁어내어 제거하도록 제안되어 있으나, 실제로는 플로우트돌기가 스컴에 걸려서 되려 꼼짝하지 못하게 걸리게 되는 경우가 많다. 이에 따라 수위계의 작동 자체가 불능이 되는 경우가 있다. 따라서, 강제적인 외력의 투입이 필요하다. 도 3에서 플로우트 즉, 플로우트 본체의 플로우트상체 내부에는 공간으로 제공되는 모터수용룸 이 형성되고 여기에 회전 가능한 모터가 장착되며, 모터의 회전축이 수직 하향하게 배치되어서 결합축으로 제공된다. 이때, 결합축은 플로우트상체의 저면에서 회전 가능하게 축받이가 되며 외부의 물이 침투하지 않도록 긴밀, 수밀하게 조립된다. 그리고 모터에 공급되는 전원은 상부의 연결부 (200p) 및 연결선(200w)을 통하여 외부로부터 전달이 이루어지며 이때, 연결부(200p)와 연결선(200w)은 상호 회 전이 이루어질 수 있는 회전결합을 이루며, 전원 공급 등은 회전체 사이에 전원을 공급하는 종래 기술을 인용할 수 있다. 상술한 바를 바탕으로, 모터가 회전하도록 전원을 제어하여 공급하면 플로우트상체와 플로우트하체 는 서로 반대 방향으로 회전하게 되면서 플로우트 본체의 외부에 형성된 플로우트돌기가 회전 동작하면서 가이드파이프의 내벽에 강하게 부착된 스컴을 강제적으로 마찰하면서 제거할 수 있다. 도 4 및 도 5의 예시를 참조한다. 즉, 플로우트상체에 구비된 상체측 플로우트돌기와 플로우트하체(21 2)에 구비된 하체측 플로우트돌기가 서로 반대 방향으로 회전한다. 도면에서, 서로 반대 방향으로 회전하 는 원리로 보다 스컴 청소를 강력히 수행하기 위해서, 상체측 플로우트돌기는 반시계 방향(s1)으로 돌 고, 하체측 플로우트돌기는 시계 방향(s2)으로 회전하도록 예시된 바를 참조한다.부호의 설명 스컴, 연결부(200p), 연결선(200w), 결합축, 결합공, 플로우트, 플로우트 본체, 플로 우트상체, 플로우트하체, 플로우트돌기, 가이드파이프"}
{"patent_id": "10-2022-0073126", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 도 2는 종래에 실시되고 있는 기술에 관한 것으로, 도 1은 수위계에 설치되는 플로우트의 예시도 도 2는 중계펌프장에 설치되는 수위계의 개념도. 이하, 본 발명에 따를 실시예에 관한 것으로, 도 3은 플로우트의 분해된 모습을 투시한 단면도. 도 4는 플로우트의 조립된 모습을 나타낸 단면도로서, 도 4 A 플로우트의 길이가 늘어난 경우를 예시, 도 4 B 플로우트의 길이가 줄어든 경우를 예시. 도 5는 다른 예시로서, 플로우트의 동작 상태를 보인 단면도."}
