{"patent_id": "10-2018-0139297", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0057821", "출원번호": "10-2018-0139297", "발명의 명칭": "빅데이터 분석을 통한 태양광 발전량 예측 장치 및 방법", "출원인": "주식회사 에코시안", "발명자": "김수종"}}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기상 데이터, 환경에 대한 측정 데이터, 발전 상태 데이터 및 태양광 발전 모듈 관찰 영상 데이터를 포함하는태양광 발전 관련 데이터를 수집하는 데이터 수집부와; 상기 데이터 수집부에서 수집된 데이터를 주기적으로 저장하고, 수집된 데이터를 발전량 예측 분석을 위한 영향인자로 사용할 수 있도록 가공하는 데이터 저장 및 전처리부와; 태양광 발전량 예측을 위하여 학습 방식과 통계 방식을 포함하는 복수의 분석 방식과 각 분석 방식에서 사용할파라미터를 정의하고, 상기 정의된 파라미터를 상세 분석 설정에 따라 변동하며, 분석 목표에 따라 사용할 분석방식과 파라미터를 관리하고, 정의 및 변동된 파라미터를 반영한 복수의 분석 방식으로 발전량 예측 과정을 수행하되, 분석을 수행할 때마다 분석에 사용되는 영향 인자를 분석하여 그 영향도를 판단하고 가중치를 재설정하여 후속 분석에 반영되도록 하는 예측 분석부와; 상기 예측 분석부의 각 분석 방식에 따른 예상 발전량 정보와 영향 인자 분석 정보를 설정된 방식으로 제공하는정보 제공부를 포함하는 빅데이터 분석을 통한 태양광 발전량 예측 장치."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 태양광 발전 관련 데이터는 외부 기상 예보 기관에서 제공하는 과거, 현재 및 미래 기상 데이터를 포함하는 외부 데이터와, 태양광 발전모듈 설치 영역에서 실측된 일사량, 외기 온도, 모듈 온도,습도 데이터 및 패널의 오염과 이상을 검출하기 위한 영상 데이터를 포함하는 내부 환경 데이터와, 모듈 발전데이터 및 인버터 발전 데이터를 포함하는 내부 설비 데이터를 포함하는 것을 특징으로 하는 빅데이터 분석을통한 태양광 발전량 예측 장치."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 데이터 저장 및 전처리부는 상기 데이터 수집부로부터 데이터를 수집하는 저장 서버와;상기 저장 서버가 수집한 데이터를 주기적으로 전달받아 저장하는 원격 공유 저장부와;상기 저장 서버나 원격 공유 저장부에 저장된 데이터를 획득하여 태양광 발전량 예측을 위한 입력 정보인 영향인자로 사용할 수 있도록 노이즈 제거, 데이터 정규화, 포맷의 변경 중 적어도 하나 이상을 수행하는 데이터 전처리부를 포함하는 것을 특징으로 하는 빅데이터 분석을 통한 태양광 발전량 예측 장치."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 예측 분석부는 학습 유형과 통계 분석 유형을 포함하는 학습 유형을 정의하고, 회귀분석, 분류 분석, 군집 분석을 포함하는 분석 유형을 정의하며, 정의된 분석에 사용할 파라미터를 정의함으로써 사용할 복수의 태양광 발전량 예측 분석기법을 정의하는 핵심기법 관리부와;상기 핵심기법 관리부에서 정의된 분석 기법의 파라미터를 변동하여 상세 분석 방식을 설정하는 일반기법 관리부와; 설정된 분석 목표에 따라 일반기법에 따른 상세 분석 방식을 그룹으로 설정 및 관리하며 분석 스케줄을 설정 및공개특허 10-2020-0057821-3-관리하는 모듈 관리부를 포함하는 것을 특징으로 하는 빅데이터 분석을 통한 태양광 발전량 예측 장치."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 예측 분석부는 정의 및 설정된 파라미터로 태양광 발전량을 예측하는 복수의 분석 처리부를 포함하되 이들 중 하나로서, 태양광 발전 모듈의 이미지 정보로부터 오염 상태 정보를 출력하는 이미지 분석용 딥러닝 인공 신경망과, 일사량, 모듈 온도, 태양 고도 중 적어도 하나 이상을 포함하는 정량화된 발전 관련 정보와 상기 딥러닝 인공 신경망에서 출력된 오염 상태 정보를 입력으로 하여 예상 발전량을 출력하는 발전량 예측 신경망을 포함하는 다중복합 인공신경망을 이용한 분석 처리부를 포함하는 것을 특징으로 하는 빅데이터 분석을 통한 태양광 발전량 예측장치."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 다중복합 인공신경망을 이용한 분석 처리부에서 모듈 오염을 분석하는 딥러닝 인공 신경망은 이미지 분석에 최적화된 CNN(Convolutional neural network) 기반 신경망이고, 상기 발전량 예측 신경망은 오염 상태 정보와 정량화된 복수의 발전 관련 정보를 학습을 위한 입력으로 하여 예측 발전량을 출력하는 인공 신경망인 것을 특징으로 하는 빅데이터 분석을 통한 태양광 발전량 예측 장치."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 상기 예측 분석부는 영향 인자를 수집하는 영향인자 수집부와, 태양광 발전량 예측 결과를분석하는 예측 분석부와, 예측 분석부의 정확도를 판단하는 영향 인자 정확도 판단부와, 기계학습 방식의 분석이 이루어질 때마다 분석에 사용되는 학습 데이터 세트를 교차 검증하는 교차 검증부와, 상호정보량(MutualInfotmation)을 통해 각 영향인자들의 발전량 기여 가중치를 결정하는 가중치 결정부와, 랜덤 포레스트(Randomforest) 방식으로 각 영향 인자별 추론 확률을 구하여 영향도를 판단하는 영향력 판단부를 포함하는 영향 인자분석부를 포함하는 것을 특징으로 하는 빅데이터 분석을 통한 태양광 발전량 예측 장치."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "기상 데이터, 환경에 대한 측정 데이터, 발전 상태 데이터 및 태양광 발전 모듈 관찰 영상 데이터를 포함하는태양광 발전 관련 데이터를 수집하는 데이터 수집단계와; 상기 데이터 수집 단계에서 수집된 데이터를 주기적으로 저장하고, 수집된 데이터를 발전량 예측 분석을 위한영향 인자로 사용할 수 있도록 가공하는 데이터 저장 및 전처리 단계와; 태양광 발전량 예측을 위하여 학습 방식과 통계 방식을 포함하는 복수의 분석 방식과 각 분석 방식에서 사용할파라미터를 정의하고, 정의된 파라미터를 상세 분석 설정에 따라 변동하며, 분석 목표에 따라 사용할 분석 방식과 파라미터를 관리하는 기법 관리 단계와; 상기 기법 관리 단계에서 정의 및 변동된 파라미터를 반영한 복수의 분석 방식으로 발전량 예측 과정을 수행하는 발전량 예측 단계와; 상기 발전량 예측 단계에서 분석을 수행할 때마다 분석에 사용되는 영향 인자를 분석하여 그 영향도를 판단하고가중치를 재설정하여 후속 분석에 반영되도록 하는 영향 인자 분석 단계와; 상기 발전량 예측 단계 및 상기 영향 인자 분석 단계에서 얻어진 예상 발전량 정보와 영향 인자 분석 결과를 설정된 방식으로 제공하는 정보 제공 단계를 포함하는 빅데이터 분석을 통한 태양광 발전량 예측 방법."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2020-0057821-4-청구항 8에 있어서, 상기 발전량 예측 단계는 태양광 발전 모듈의 이미지 정보를 이미지 분석에 최적화된 딥러닝 인공 신경망을 통해 분석하여 오염 상태 정보를 얻고, 일사량, 모듈 온도, 태양 고도 중 적어도 하나 이상을 포함하는 정량화된 발전 관련 정보와 상기 딥러닝 인공 신경망에서 분석된 오염 상태 정보를 입력으로 하는 발전량 예측 신경망을 통해 발전량을 예측하는다중복합 인공신경망 예측 단계를 포함하는 것을 특징으로 하는 빅데이터 분석을 통한 태양광 발전량 예측방법."}
{"patent_id": "10-2018-0139297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서, 상기 영향 인자 분석 단계는 기계 학습 방식의 태양광 발전량 예측 분석이 수행될 때마다 기계 학습 데이터 세트를 K-fold 크로스 밸리데이션 분리 방법으로 설정된 정확도 이상의 값이 나올때까지 기계학습을 진행하여 영향 인자의 가중치를 검증하는단계와; 상호정보량(Mutual Infotmation)을 통해 각 영향인자들의 발전량 기여 가중치를 결정하는 단계와;랜덤 포레스트(Random forest) 방식으로 각 영향 인자별 추론 확률을 구하여 영향도를 판단하는 단계 중 적어도하나의 단계를 포함하는 것을 특징으로 하는 빅데이터 분석을 통한 태양광 발전량 예측 방법."}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 태양광 발전에 관련된 다양한 데이터들을 수집하고 수집된 데이터를 기반으로 다중복합 인공신경망 분 석을 포함하는 다양한 분석 기법을 체계적으로 적용하여 발전량을 예측할 수 있으며, 태양광 발전량 예측에 영향 을 주는 인자들을 매 분석 시마다 확인하여 다양한 환경 변화에 대한 예측 정확도를 높일 수 있도록 한 빅데이터 (뒷면에 계속)"}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 빅데이터 분석을 통한 태양광 발전량 예측 장치 및 방법에 관한 것으로, 특히 태양광 발전에 관련된 다양한 데이터들을 수집하고 수집된 데이터를 기반으로 다중복합 인공신경망 분석을 포함하는 다양한 분석 기법 을 체계적으로 적용하여 발전량을 예측할 수 있으며, 태양광 발전량 예측에 영향을 주는 인자들을 매 분석 시마 다 확인하여 다양한 환경 변화에 대한 예측 정확도를 높일 수 있도록 한 빅데이터 분석을 통한 태양광 발전량 예측 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "신재생에너지인 태양광 발전은 4차산업혁명에서 기후변화와 더불어 온실가스 감축 목표 달성에 매우 중요한 역 할을 하게 될 것으로 기대되고 있다. 따라서 태양광발전 사업에 대한 꾸준한 지원 정책과 기술의 발전에 따라 태양광 패널의 수명 및 효율이 개선되었고, 태양광 발전 관련 설비들도 고도화되고 있으며 대형 태양광 발전소 는 물론이고 소규모 태양광 발전 역시 활성화되고 있다. 이러한 태양광 발전의 경우 외부 영향에 의존적이기 때문에 발전량 예측이 매우 중요한데, 과다한 발전은 설계 용량을 초과하는 발전에 의한 물리적, 전기적 위험이 있고, 연계되는 계통에 다수의 태양광 발전 설비들이 존재 하는 경우 역조류 발생등의 문제가 발생할 수 있으며 저조한 발전은 수익 하락의 문제가 발생할 수 있다. 이와 같이 태양광 발전량 예측은 물리적, 경제적 위험 요소를 예방하는데 중요한 역할을 하고 있으며, 태양광 발전량 예측의 정확도에 따라 경제적 측면에서 많은 손익이 변동되기 때문에 다양한 분야에서 발전량 예측에 관 한 기술 도입을 확대하고 있다. 알려져 있는 바와 같이, 태양광 발전 예측의 경우 외기온도, 일사량, 습도 등과 관련된 다양한 기후요소와 모듈 의 오염도, 모듈온도 등과 같은 기계의 물리적 변화가 함께 고려되어야 하므로 분석 대상이 많고 다양한 비정형 데이터가 지속적으로 발생되므로 방대한 정보들을 효과적으로 분석하기가 쉽지 않다. 현재 여러 곳에서 운영되고 있는 태양광 발전소는 수요 증가 및 확대보급 등에도 불구하고 기후변화와 모듈의 이물질, 결함 등으로 많은 문제가 발생하고 있는데, 모듈의 이물질이나 결함은 전문가의 지속적인 관찰과 관리 가 없다면 발견이 어렵고, 이러한 문제는 개별 모듈 뿐만 아니라 연결된 다른 모듈들의 수명이나 발전량에도 영 향을 미칠 뿐만 아니라 심한 경우 전기적 이상으로 화재 발생 등의 치명적인 문제를 야기하는 경우도 빈번하다. 이러한 문제를 해결하기 위한 방법으로 다양한 태양광 발전예측에 연구가 진행되고 있으나, 기상예보에 의존적 인 예측기술이나 단일 예측 모델 등에 관련된 연구가 대부분으로 예측방법에 대한 개선이 필요성이 요구되고 있다. 정확하고 정밀하지 못한 예측기술은 전력생산품질의 저하, 전력 생산량 관리 미흡으로 인한 경제적 손실 등 의 문제를 동반한다. 특히, 이러한 기상예보에 의존적인 예측 기술은 실제 발전 모듈의 이물질, 결함 등에 따른 문제에 대응하기 어 렵고, 단일 예측 모델 혹은 이러한 단일 예측 모델들을 복수로 사용하는 경우도 다양한 요인에 의해 실제 발전 량 예측에 영향을 주는 영향인자가 가변되는 상황에 대응하기 어려워 그 결과를 정확하지 않으므로 이러한 발전 량 예측의 활용 범위가 제한되는 한계가 있다. 나아가, 최근 각광받고 있는 기계 학습 방식이나 딥러닝과 같은 신경망을 이용한 예측 모델을 적용하고자 하는 연구도 있으나 태양광 발전량 예측에는 다양한 기상 정보, 각종 센싱 정보, 설비에 대한 다양한 상황과 정보들 을 물론이고 패널의 영상 정보와 같은 종류가 다른 여러 데이터들을 고려해야 하므로 학습의 대상을 결정하는 것도 어렵고 단순히 일부 정보들 만을 학습시킨 신경망 분석은 그 복잡성에 비해 예측 결과를 신뢰하기 어려운 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허 제10-1635450호, [기상정보를 활용한 도시에너지관리시스템용 태양광발전량 예 측시스템] (특허문헌 0002) 한국 등록특허 제10-1856320호, [태양광 발전량 예측 장치 및 방법]"}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명 실시예들의 목적은 태양광 발전에 영향을 미치는 외기온도, 일사량, 습도 등과 관련된 다양한 기후요소 와 모듈의 오염도, 모듈온도 등과 같은 기계의 물리적 변화를 포함하는 다양한 요소들을 고려하여 보다 정확한 발전 예측을 제공할 수 있도록 한 빅데이터 분석을 통한 태양광 발전량 예측 장치 및 방법을 제공하는 것이다. 본 발명의 다른 목적은 실시간 기상정보와 함께 환경데이터, 설비데이터를 수집하고, 다양한 분석 기법을 체계 적으로 적용하기 위하여 각 분석 기법들을 계층적으로 관리하면서 다양한 분석 예측기술을 통하여 발전량을 예 측함과 아울러 매 분석 시점마다 분석에 적용되는 다양한 입력변수의 중요도를 판별하여 그 가중치를 조절하고 해당 가중치에 대한 신뢰도를 높임으로써 다양한 환경 변화에 따른 예측 정확도를 높일 수 있도록 한 빅데이터 분석을 통한 태양광 발전량 예측 장치 및 방법을 제공하는 것이다. 본 발명의 또 다른 목적은 기상 정보나 발전 정보와 같은 정량화된 정보는 물론이고 발전에 중대한 영향을 미치 는 태양광 발전 모듈의 오염 여부를 확인하기 위한 이미지 정보를 이미지 분석에 최적화된 신경망 분석을 적용 하고, 신경망 분석을 통해 얻어진 오염 정보와 복수의 정량화된 발전 관련 정보들을 다른 신경망 학습을 통해 분석하는 다중복합 인공신경망 기술적 적용함으로써 실질적으로 높은 신뢰성을 가지는 분석이 가능하도록 함과 아울러 이러한 분석 방식 외에도 다른 분석도 병행하고, 발전량 분석이 이루어질 때마다 발전량 예측에 영향을 주는 영향인자를 분석하여 가중치를 신뢰성 있게 결정하는 것으로 다양한 환경 변화에 지능적으로 대응하여 발 전량 예측의 적중률을 높일 수 있도록 한 빅데이터 분석을 통한 태양광 발전량 예측 장치 및 방법을 제공하는 것이다."}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여, 본 발명의 일 실시예에 따른 빅데이터 분석을 통한 태양광 발전량 예측 장치는 기상 데이터, 환경에 대한 측정 데이터, 발전 상태 데이터 및 태양광 발전 모듈 관찰 영상 데이터를 포 함하는 태양광 발전 관련 데이터를 수집하는 데이터 수집부와, 데이터 수집부에서 수집된 데이터를 주기적으로 저장하고, 수집된 데이터를 발전량 예측 분석을 위한 영향인자로 사용할 수 있도록 가공하는 데이터 저장 및 전 처리부와, 태양광 발전량 예측을 위하여 학습 방식과 통계 방식을 포함하는 복수의 분석 방식과 각 분석 방식에 서 사용할 파라미터를 정의하고, 정의된 파라미터를 상세 분석 설정에 따라 변동하며, 분석 목표에 따라 사용할 분석 방식과 파라미터를 관리하고, 정의 및 변동된 파라미터를 반영한 복수의 분석 방식으로 발전량 예측 과정을 수행하되, 분석을 수행할 때마다 분석에 사용되는 영향인자를 분석하여 그 영향도를 판단하고 가중치를 재설 정하여 후속 분석에 반영되도록 하는 예측 분석부와, 예측 분석부의 각 분석 방식에 따른 예상 발전량 정보와 영향인자 분석 정보를 설정된 방식으로 제공하는 정보 제공부를 포함한다. 일례로서, 태양광 발전 관련 데이터는 외부 기상 예보 기관에서 제공하는 과거, 현재 및 미래 기상 데이터를 포 함하는 외부 데이터와, 태양광 발전모듈 설치 영역에서 실측된 일사량, 외기 온도, 모듈 온도, 습도 데이터 및 패널의 오염과 이상을 검출하기 위한 영상 데이터를 포함하는 내부 환경 데이터와, 모듈 발전 데이터 및 인버터 발전 데이터를 포함하는 내부 설비 데이터를 포함할 수 있다. 일례로서, 데이터 저장 및 전처리부는 데이터 수집부로부터 데이터를 수집하는 저장 서버와, 저장 서버가 수집 한 데이터를 주기적으로 전달받아 저장하는 원격 공유 저장부와, 저장 서버나 원격 공유 저장부에 저장된 데이 터를 획득하여 태양광 발전량 예측을 위한 입력 정보인 영향인자로 사용할 수 있도록 노이즈 제거, 데이터 정규 화, 포맷의 변경 중 적어도 하나 이상을 수행하는 데이터 전처리부를 포함할 수 있다. 일례로서, 예측 분석부는 학습 유형과 통계 분석 유형을 포함하는 학습 유형을 정의하고, 회귀분석, 분류 분석, 군집 분석을 포함하는 분석 유형을 정의하며, 정의된 분석에 사용할 파라미터를 정의함으로써 사용할 복수의 태 양광 발전량 예측 분석기법을 정의하는 핵심기법 관리부와, 핵심기법 관리부에서 정의된 분석 기법의 파라미터 를 변동하여 상세 분석 방식을 설정하는 일반기법 관리부와, 설정된 분석 목표에 따라 일반기법에 따른 상세 분 석 방식을 그룹으로 설정 및 관리하며 분석 스케줄을 설정 및 관리하는 모듈 관리부를 포함할 수 있다. 일례로서, 예측 분석부는 정의 및 설정된 파라미터로 태양광 발전량을 예측하는 복수의 분석 처리부를 포함하되 이들 중 하나로서, 태양광 발전 모듈의 이미지 정보로부터 오염 상태 정보를 출력하는 이미지 분석용 딥러닝 인 공 신경망과, 일사량, 모듈 온도, 태양 고도 중 적어도 하나 이상을 포함하는 정량화된 발전 관련 정보와 상기 딥러닝 인공 신경망에서 출력된 오염 상태 정보를 입력으로 하여 예상 발전량을 출력하는 발전량 예측 신경망을 포함하는 다중복합 인공신경망을 이용한 분석 처리부를 포함할 수 있다. 한편, 상기 다중복합 인공신경망을 이용한 분석 처리부에서 모듈 오염을 분석하는 딥러닝 인공 신경망은 이미지 분석에 최적화된 CNN(Convolutional neural network) 기반 신경망이고, 상기 발전량 예측 신경망은 오염 상태 정보와 정량화된 복수의 발전 관련 정보를 학습을 위한 입력으로 하여 예측 발전량을 출력하는 인공 신경망일 수 있다. 일례로서, 예측 분석부는 영향인자를 수집하는 영향인자 수집부와, 태양광 발전량 예측 결과를 분석하는 예측 분석부와, 예측 분석부의 정확도를 판단하는 영향인자 정확도 판단부와, 기계학습 방식의 분석이 이루어질 때마 다 분석에 사용되는 학습 데이터 세트를 교차 검증하는 교차 검증부와, 상호정보량(Mutual Infotmation)을 통해 각 영향인자들의 발전량 기여 가중치를 결정하는 가중치 결정부와, 랜덤 포레스트(Random forest) 방식으로 각 영향인자별 추론 확률을 구하여 영향도를 판단하는 영향력 판단부를 포함하는 영향인자 분석부를 포함할 수 있 다. 본 발명의 다른 실시예에 따른 빅데이터 분석을 통한 태양광 발전량 예측 방법은 기상 데이터, 환경에 대한 측 정 데이터, 발전 상태 데이터 및 태양광 발전 모듈 관찰 영상 데이터를 포함하는 태양광 발전 관련 데이터를 수 집하는 데이터 수집단계와, 상기 데이터 수집 단계에서 수집된 데이터를 주기적으로 저장하고, 수집된 데이터를 발전량 예측 분석을 위한 영향인자로 사용할 수 있도록 가공하는 데이터 저장 및 전처리 단계와, 태양광 발전량 예측을 위하여 학습 방식과 통계 방식을 포함하는 복수의 분석 방식과 각 분석 방식에서 사용할 파라미터를 정 의하고, 정의된 파라미터를 상세 분석 설정에 따라 변동하며, 분석 목표에 따라 사용할 분석 방식과 파라미터를 관리하는 기법 관리 단계와, 기법 관리 단계에서 정의 및 변동된 파라미터를 반영한 복수의 분석 방식으로 발전 량 예측 과정을 수행하는 발전량 예측 단계와, 발전량 예측 단계에서 분석을 수행할 때마다 분석에 사용되는 영 향 인자를 분석하여 그 영향도를 판단하고 가중치를 재설정하여 후속 분석에 반영되도록 하는 영향 인자 분석 단계와, 발전량 예측 단계 및 영향 인자 분석 단계에서 얻어진 예상 발전량 정보와 영향 인자 분석 결과를 설정 된 방식으로 제공하는 정보 제공 단계를 포함한다. 일례로서, 발전량 예측 단계는 태양광 발전 모듈의 이미지 정보를 이미지 분석에 최적화된 딥러닝 인공 신경망 을 통해 분석하여 오염 상태 정보를 얻고, 일사량, 모듈 온도, 태양 고도 중 적어도 하나 이상을 포함하는 정량 화된 발전 관련 정보와 상기 딥러닝 인공 신경망에서 분석된 오염 상태 정보를 입력으로 하는 발전량 예측 신경 망을 통해 발전량을 예측하는 다중복합 인공신경망 예측 단계를 포함할 수 있다. 일례로서, 영향인자 분석 단계는 기계 학습 방식의 태양광 발전량 예측 분석이 수행될 때마다 기계 학습 데이터 세트를 K-fold 크로스 밸리데이션 분리 방법으로 설정된 정확도 이상의 값이 나올때까지 기계학습을 진행하여 영향인자의 가중치를 검증하는 단계와, 상호정보량(Mutual Infotmation)을 통해 각 영향인자들의 발전량 기여 가중치를 결정하는 단계와, 랜덤 포레스트(Random forest) 방식으로 각 영향인자별 추론 확률을 구하여 영향도 를 판단하는 단계 중 적어도 하나의 단계를 포함할 수 있다."}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따른 빅데이터 분석을 통한 태양광 발전량 예측 장치 및 방법은 태양광 발전에 영향을 미 치는 외기온도, 일사량, 습도 등과 관련된 다양한 기후요소와 모듈의 오염도, 모듈온도 등과 같은 기계의 물리 적 변화를 포함하는 다양한 요소들을 고려하여 보다 정확한 발전 예측과 영향인자 분석을 통해 기상상태 및 기 계의 물리적 요소들에 따른 전력 생산량의 변동성 예측뿐만 아니라 발전시스템의 효율적인 부하운영 및 관리를 위한 기초 정보를 제공함으로써 기존 설치지역의 경제성 향상과 신규 태양광 발전소의 사업성 검토 및 의사결정 을 위한 기초자료로 폭넓게 활용할 수 있는 효과가 있다. 본 발명의 실시예들에 따른 빅데이터 분석을 통한 태양광 발전량 예측 장치 및 방법은 주기적인 실시간 기상정 보와 함께 환경데이터, 설비데이터를 수집하고 다양한 분석 기법을 체계적으로 적용하기 위하여 각 분석 기법들 을 계층적으로 관리하면서 다양한 다중복합 분석예측기술을 통하여 발전량을 예측함과 아울러 매 분석 시점마다 분석에 적용되는 다양한 입력변수의 중요도를 판별하여 그 가중치를 조절하고 해당 가중치에 대한 신뢰도를 높 임으로써 다양한 환경 변화에 따른 예측 정확도를 높일 수 있어 변동되는 장치의 상태나 변화되는 기상에 대응 할 수 있는 효과가 있다. 나아가, 발전에 중대한 영향을 미치는 태양광 발전 모듈의 이미지 정보를 이미지 분석에 최적화된 신경망 분석 에 적용하여 오염 상태를 구분할 수 있어 정량화된 정보 뿐만 아니라 숙련자가 아니면 구분하기 어려운 모듈의 상태까지도 정확하게 고려하며, 이러한 오염 정보와 정량화된 정보들을 통합적으로 고려한 발전량 예측 신경망 을 적용함으로써 보다 정확한 발전량 예측이 가능하여 발전량 예측의 적중률과 신뢰성을 높일 수 있는 효과가 있다."}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상기한 바와 같은 본 발명을 첨부된 도면들과 실시예들을 통해 상세히 설명하도록 한다. 본 발명에서 사용되는 기술적 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려 는 의도가 아님을 유의해야 한다. 또한, 본 발명에서 사용되는 기술적 용어는 본 발명에서 특별히 다른 의미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 기술적인 용어가 본 발명의 사상을 정확하게 표현하지 못하는 잘못된 기술적 용어일 때에 는, 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또한, 본 발명에서 사용 되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하며, 과도하게축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 본 발명에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 발명에 기재된 여러 구성 요소들, 또는 여러 단계를 반 드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 본 발명에서 사용되는 제 1, 제 2 등과 같이 서수를 포함하는 용어는 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들은 용어들에 의해 한정되어서는 안 된다. 용어들은 하나의 구성 요소를 다른 구성 요소 로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성 요소는 제 2 구성 요소로 명명될 수 있고, 유사하게 제 2 구성 요소도 제 1 구성 요소로 명명될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동 일하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 발명의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 발명의 사상이 제한되는 것으로 해석되어서는 아니 됨을 유의해야 한다. 한편, 본 발명에서 언급되는 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 실시예들에서 설명되는 시스템, 장치 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 또한, 이러한 서버나 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행 되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 장치는 소프트웨어의 실행에 응답하여, 데 이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 서버나 장치는 하나가 사용되는"}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "것으로 설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 서버나 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 더불어, 상기 장치는 인터페이스를 통해서 다양한 센서들을 직접 혹은 별도의 드라이버나 센서 제어를 위해 별도로 마련된 하드웨어/ 소프트웨어 보드나 모듈을 통해서 제어할 수 있으며, 이를 위한 다양한 논리적, 전기적, 광학적 변형들을 모두 포괄할 수 있다. 나아가, 본 발명의 실시예들에서 데이터를 수집하기 위한 장치들 및 그 구성요소들은 물리적이고 전기적인 센서 들의 정보를 수집하기 위한 하드웨어나 소프트웨어를 포함하는 장치일 수 있으며, 전기적 신호를 수신 및 처리 하기 위한 인터페이스, 구동 드라이버, 전원, 제어를 위한 마이크로 콘트롤러, 저장부, 운영체제나 펌웨어를 포 함할 수 있고, 필요에 따라 센서들도 포함할 수 있다. 이하, 본 발명의 실시예들을 도 1 내지 도 10을 참조하여 설명한다. 도 1은 본 발명의 실시예에 따른 빅데이터 분석을 통한 태양광 발전량 예측 장치의 개념적 구성도를 보인 것이다. 도시된 바와 같이 크게 데이터 수집부, 데이터 저장 및 전처리부, 예측 분석부, 정보 제공부 로 구분되는데, 이들은 각각 독립적이거나 연동되는 복수의 장치로 구성될 수 있으므로 실질적으로는 시스 템으로서 구성될 수 있으나, 규모에 따라 이들을 처리하는 구성을 단일화 할 수도 있으므로 포괄적 개념으로서 장치로 칭한다. 한편 이러한 구성부들 역시 단일 혹은 복수의 장치들로 구성될 수 있다. 도시된 구성을 보면, 데이터 수집부는 기상에 관련된 과거, 현재 및 미래에 대한 정보를 포함하는 기상 데 이터를 외부 기관으로부터 수집하는 외부 데이터 수집부와, 태양광 발전이 이루어지는 지역 내부에서 얻어 지는 다양한 환경 측정 데이터와 태양광 발전 모듈 관찰 영상 데이터를 수집하는 내부 환경 데이터 수집부(12 0)와, 태양광 발전을 위한 내부 설비에서 발전 상태에 따른 데이터를 수집하는 내부 설비 데이터 수집부를 포함한다. 도시된 각 수집부에서 수집하는 데이터들은 도시된 종류들로 한정되지 않으며 도시되지 않은 더 많은 데이터들 을 수집할 수 있고, 이들 중 일부는 사용하지 않을 수도 있다. 데이터 저장 및 전처리부는 데이터 수집부에서 수집된 데이터를 주기적으로 저장하고, 수집된 데이터 를 발전량 예측 분석을 위한 영향인자로 사용할 수 있도록 가공하는 기능을 수행하는데, 이를 위해서 데이터 수 집부의 각 수집부(110, 120, 130)와 연동하여 데이터를 수신하고 이를 필요에 따라 저장하거나 전송하는 저장 서버와, 저장 서버가 제공하는 데이터를 저장하며 필요에 따라 다른 태양광 발전량 예측 장치들 과 공유할 수 있는 원격 공유 저장부와, 원격 공유 저장부에 저장된 데이터나 저장 서버가 제공 하는 데이터를 수신하거나 검색하여 태양광 발전 예측 분석의 입력, 즉 영향인자로 사용할 수 있도록 가공하는 전처리를 수행하는 데이터 전처리부를 포함한다. 예측 분석부는 태양광 발전량 예측을 위하여 학습 방식과 통계 방식을 포함하는 복수의 분석 방식과 각 분 석 방식에서 사용할 파라미터를 정의하는 핵심 기법 관리부와, 정의된 파라미터를 상세 분석 설정에 따라 변동하는 일반 기법 관리부와, 분석 목표에 따라 사용할 분석 방식과 파라미터를 관리하는 모듈 관리부 와, 정의 및 변동된 파라미터로 복수의 분석 방식으로 분석 과정을 수행하는 예상 발전량 분석부와, 분석을 수행할 때마다 분석에 사용되는 영향인자를 분석하여 그 영향도를 판단하고 가중치를 재설정하여 후속 분석에 반영되도록 하는 영향인자 분석부를 포함한다. 이러한 각 구성부들에 관해서는 이후 도 3 내지 도 9를 통해 상세히 설명하도록 한다. 정보 제공부는 예측 분석부의 각 분석 방식에 따른 예상 발전량 정보와 영향인자 분석 정보를 제공하 는 예상 발전량 정보 제공부와 예상 발전량 정보나 영향인자 분석 정보를 어떻게 사용자에게 제공할 것인 지를 설정하고 그 설정에 따라 사용자에게 제공하도록 하는 사용자 UX부를 포함한다. 물론, 사용자에게 제 공하기 위한 다양한 시각적, 청각적 인터페이스 구성을 포함할 수 있다. 도 2는 본 발명의 실시예에 따른 데이터 저장 및 전처리부의 구성을 보인 것이다. 도시된 바와 같이 저장 서버는 태양광 발전 관련 데이터를 데이터 수집부로부터 수집하는데, 이러한 데이터 수집부는 개념적으로 외부 기상 데이터를 얻기위한 기상청 API 모듈, 일사량 센서, 외기 온도 센서, 모듈 온도 센서, 습도 센서, 패널의 오염과 이상을 검출하기 위한 영상 데이터를 제공하는 카메라, 모듈 발전량 센서, 인버터 발전 정보를 제공하는 인버터를 포함한다. 여기서 각 센서들과 카메라, 인버터는 이들을 직접 구성요소로서 포함하고 있다는 의미라기 보다는 이들로부터 정보를 수집하는 수집부를 포함하고 있다는 것으로 간주되어야 한다. 한편, 모듈 발전량 센서로부터는 태양광 발전 모듈의 순시전압, 순시전력값 등을 수집할 수 있고, 인버터로부터는 일누적 생산량, 직류 총전력, 직류 평균 전력, 직류 평균 전압 등을 수집할 수 있다. 도시된 저장 서버는 주기적으로(도시된 실시예에서는 1분 단위) 수집 데이터를 원격 공유 저장부에 저장하거나 통신부를 통해 데이터 전처리부에 전송할 수 있다. 실질적으로 하나의 태양광 발전소에서 생성 되는 각종 환경 데이터나 설비 데이터는 지속적인 데이터 생성이 이루어진다는 점에서 저장 서버는 데이터 를 수집하여 그 종류를 분석하고 저장 위치를 지정하며 일부 정보를 데이터 전처리부에 제공하는 일반적인 데이터베이스 서버의 기능외에도 누적에 따라 데이터량이 폭증하는 방대한 수집 데이터를 처리하기 위한 분산 처리 아키텍처(예컨대 하둡이나 스파크 등)를 지원하는 분산처리 서버의 기능을 포함한 것일 수 있다. 공유 저장부는 저장 서버가 제공하는 환경 데이터나 설비 데이터를 저장하는데 그 정보가 방대하다는 점에서 분산 저장부의 형태를 가지거나 클라우드 저장부의 형태를 가질 수 있으며, 필요에 따라 하나의 태양광 발전소 저장 서버가 아닌 다른 태양광 발전소를 위한 태양광 발전량 예측 장치들의 저장 서버들과 연동되 어 데이터를 통합 저장할 수도 있다. 데이터 전처리부는 저장 서버나 원격 공유 저장부에 저장된 데이터를 획득하여 이러한 데이터를 태양광 발전량 예측을 위한 입력 정보, 즉 영향인자로 사용할 수 있도록 노이즈 제거, 데이터 정규화, 포맷의 변경 중 적어도 하나 이상을 수행할 수 있다. 본 발명의 실시예에서 예측 분석부에는 크게 분석 기법들을 체계적으로 관리하기 위한 기법 관리 구성들 (310, 320, 330)과 실질적으로 예상 발전량을 분석하기 위한 복수의 분석 처리부들이 포함된 예상 발전량 분석 부 및 예상 발전량 분석에 사용된 영향인자를 분석하고 가중치를 변경하는 영향인자 분석부를 구비한 다. 먼저, 예측 분석부의 기법 관리 구성들을 도 3을 참조하여 설명한다. 도 3은 본 발명의 실시예에 따른 예측 분석부에 포함된 기법 관리 구성들의 처리 내용을 개념적으로 보인 것으 로, 도시된 바와 같이 복수의 분석 방식과 각 분석 방식에서 사용할 파라미터를 정의하는 핵심 기법 관리부 와 핵심 기법 관리부에서 정의된 파라미터를 상세 분석 설정에 따라 변동하는 일반 기법 관리부 및 분석 목표에 따라 일반 기법을 그룹으로 관리하는 모듈 관리부가 계층적으로 구성되어 있다. 이러한 계층 적 구성을 통해서 복수의 태양광 발전량 예측 방식들을 효과적으로 관리할 수 있고, 영향인자의 변화(환경 변화 에 따라 영향력이 큰 영향인자를 구분하고 변화된 가중치를 반영하는 등)에 효과적으로 대응할 수 있으며, 상황 에 따라 적절한 분석 방식이나 분석 방식들을 선택하거나 그 상세 분석 조건 등을 설정할 수 있음과 아울러 상 황에 따른 분석 그룹 등을 모듈(그룹으로 설정되는 분석 방식과 설정 등의 모듈)로서 관리할 수도 있다. 핵심 기법 관리부는 태양광 발전량 예측을 위한 기본적인 분석 기법을 정의하는데, 지도학습/비지도학습/ 반지도학습/강화학습/앙상블 등의 기계학습 유형과 일반통계적 분석 유형 등을 정의하는 학습유형 정의 기능과, 회귀분석/분류분석/군집분석 등을 정의하는 분석유형 정의 기능 및 수집된 데이터들을 정의된 학습 유형과 분석 유형에서 파라미터로 활용할 수 있는 파라미터 정의기능을 제공한다. 일반 기법 관리부는 앞서 핵심 기법에서 정의된 예측 기법의 파라미터를 변동하여 다양한 기법으로 상세 분류하는 기능을 제공하며, 이를 위해 핵심 기법과 일반 기법을 연동(핵심 기법 중 선택된 핵심 기법을 이용하 는 구체적인 분석 방식을 일반 기법으로 정의)하고, 일반 기법 파라미터를 정의하는 기능을 제공한다. 모듈 관리부는 예측 또는 분석하고자 하는 목표 값을 기준으로 다양한 일반기법을 그룹으로 설정 및 관리 하는 것이 주요 기능이며, 보조적 기능으로는 일반기법 별 예측 주기/모델 갱신 주기/사용여부 등과 같은 분석 업무의 일정을 설정할 수 있고, 입력 및 출력 대상 태그 또한 설정할 수 있는 기능을 제공한다. 즉, 이와 같이 분석의 핵심이 되는 기본 분석 방식들을 핵심 기법으로 관리하고, 핵심 기법을 특정한 분석 조건 으로 구체화한 일반 기법을 관리하며, 이러한 일반 기법들을 그룹으로 설정하여 관리하는 모듈 관리가 계층적으 로 이루어지게 되므로 일관적이며 변형이 자유롭고 필요한 핵심 기법을 추가하거나 일반 기법을 추가하는데 유 연한 구조를 제공할 수 있다. 예측 분석부는 이와 같은 기법 관리 구성들에 의해 관리되는 구체적인 일반 기법들을 실제 수행하여 태양 광 발전량을 예측하는 복수의 분석 처리부들이 포함된 예상 발전량 분석부를 포함한다. 도 4에 도시한 바 와 같이 예상발전량 분석부는 실질적으로 기법 관리 구성들에서 정의된 분석 방식과 파라미터를 이용하여 실제 분석을 수행할 여러 분석 처리부들이 존재하는데, 알려져 있는 다양한 통계 분석에서 기계학습 방식들을 포함하는 여러 분석 처리부들이 존재할 수 있다. 본 발명의 실시예에서는 적어도 태양광발전에 적용되는 핵심 예측분석 기술로 회귀분석을 이용하는 분석 처리부 와, 다중복합 인공신경망을 활용한 분석 처리부를 포함할 수 있다. 먼저, 회귀분석을 통한 분석 처리부는 회귀분석을 통한 기계학습을 수행하는데, 예시적인 기계학습 함수는 다음 의 수학식 1과 같다. 수학식 1"}
{"patent_id": "10-2018-0139297", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 x는 입력변수(독립 변수)로 수집되는 외부 수집데이터, 내부 수집데이터(환경 데이터, 설비 데이터)를 포함하고 있으며 y는 출력변수(종속 변수)로 예측발전량이다. 예컨대, 이러한 회귀분석에 사용되는 독립변수 x는 일사량, 모듈온도, 태양고도 등을 활용할 수 있으며 그 외 에도 다양한 변수의 조합으로 태양광 발전량 예측이 가능하다. 한편, 본 발명의 실시예에서 사용되는 핵심 예측분석 기술 중 다른 하나는 다중복합 인공신경망을 활용한 분석 처리부로서, 도 5 내지 도 8을 참고하여 설명한다. 도 5는 본 발명의 실시예에 따른 예상 발전량 분석부의 분석 처리부 중 하나인 다중복합 인공신경망의 구성 및 동작 방식을 설명하기 위한 개념도로서, 정량화된 수집 데이터를 기반으로 하는 다른 종류의 분석 방식과 달리 도시된 다중복합 인공신경망의 경우 태양광 발전 모듈의 오염이나 이상을 확인하기 위한 카메라 영상을 분석하 여 모듈의 오염도를 판단하고 이를 반영하여 태양광 발전량을 예측하도록 한다.도시된 바와 같이 예상 발전량 분석부에 포함된 다중복합 인공신경망 분석 처리부(340a)는 데이터 수집부 의 카메라로부터 수집되어 데이터 저장 및 전처리부에 저장 및 전처리된 태양광 발전 모듈의 패널 이 미지 정보로부터 오염 상태 정보를 출력하는 신경망 오염도 측정부(341a)와, 역시 데이터 수집부의 센서들 로부터 수집되어 데이터 저장 및 전처리부에 저장 및 전처리된 일사량 및 모듈 온도와, 시스템 기준 정보 (위도, 경도, 시간)로부터 얻어지는 태양 고도 정보를 포함하는 정량화된 발전 관련 정보 및 신경망 오염도 측 정부(341a)에서 출력된 오염 상태 정보(오염도)를 입력으로 하여 예상 발전량을 출력하는 신경망 발전량 예측부 (342a)를 포함한다. 즉, 다중복합 인공신경망 분석 처리부(340a)는 모듈 이미지를 분석하여 오염도를 출력하는 제 1 신경망과 오염 도 및 정량화된 태양광 발전량 관련 정보를 이용하여 예상 발전량을 출력하는 제 2 신경망이 복합적으로 구성된 것이다. 여기서, 이미지를 분석하는 제 1 신경망은 이미지 분석에 최적화된 딥러닝 인공 신경망(예컨대 CNN(Convolutional neural network) 기반 신경망)을 이용하고, 정량화된 정보를 이용하여 예상 발전량을 출력하 는 제 2 신경망은 수치 분석에 최적화된 신경망을 이용할 수 있다. 도 6은 신경망 오염도 측정부(341a)를 구성하는 이미지 분석에 최적화된 딥러닝 인공 신경망으로서 CNN 구성을 보인 것이다. 물론, CNN이 이미지 분석에 최적화되어 있는 딥러닝 방식으로 알려져 있으나 이를 기반으로 하는 개선 구성이나 변형들이 등장하고 있으므로 이러한 새로운 딥러닝 방식을 채택할 수 있으며 이는 앞서 설명한 핵심기법 관리부와 일반 기법 관리부를 통해 등록 및 구체화한 후 이용할 수 있다. 도시된 바와 같이 태양광 발전 모듈(특히, 패널)의 전처리된 이미지에서 대상 영역을 선택하여 필터(C1)를 통해 콘볼루션 연산을 적용하고 활성화 함수를 적용한 후 풀링(S2)과정을 거치고, 다시 필터(C3)를 통해 콘볼루션 연 산을 적용하고 활성화 함수를 적용한 후 풀링(S4) 과정을 거쳐 구성한 특징맵을 분류기에 해당하는 신경망 학습 부(오염도 측정 모델)를 통해서 학습시켜 오염도를 출력할 수 있다. 여기서, 콘볼루션을 수행하고 풀링하는 과정을 묶어서 계층(layer)으로 보는데 도시된 예시는 2계층만 적용된 것인데, 필요에 따라 이를 여러 계층으로 적층할 수 있고 계층의 수가 많아질 수록 더 높을 성능을 제공할 수 있다. 따라서, 도시된 예시의 이미지 픽셀수와 필터의 크기, 풀링의 크기는 예시적인 것일 뿐 다양하게 변경될 수 있다. 도 7은 도 6에 도시된 신경망 학습부(오염도 측정 모델)의 구성을 좀 더 상세히 나타낸 것으로서, 도시된 바와 같이 앞서 S4 계층을 통해서 출력되는 n×m 행렬의 FCV[1,1]~FCV[n,m]은 CNN을 통해 모듈 이미지로부터 추출된 특징 정보이며 이러한 입력이 완전접속(fully connected) 네트워크로 구성되는 은닉층(hidden layer)에 제공되 면 그 결과 출력(y)으로서 오염도를 제공한다. 출력 계층에서, RC는 모듈의 실제 전류(Real Current)를 의미하고, TIP는 모듈의 이론적 순간 전력(theoretical instant power), RV는 모듈의 실제 전압(Real Voltage)을 의미한다. 이러한 은닉층의 뉴런 수량을 통해서 학습 률 및 배치사이즈, 학습횟수 등을 정의할 수 있다. 이와 같이, 태양광 발전 모듈을 촬영한 이미지를 통해서 모듈의 오염도를 이론적 출력과 실제 출력 간의 관계를 통해 1보다 작은 값으로 제공할 수 있으며 오염도가 높은 경우 더 큰 값을 나타내게 된다. 도 8은 도 5에 나타낸 신경망 발전량 예측부(342a)의 구성을 보인 것으로, 도시된 구성은 앞서 신경망 오염도 측정부(341a)에 적용된 오염 측정 모델(Contamination Measurement Model:CMM)을 통해 얻어진 오염도(C)와 일 사량 센서를 통해 얻어진 일사량(Real Radiation(W/㎡))(RR), 모듈 온도 센서를 통해 얻어진 모듈의 온도(Real Module Temperature(℃))(RMT), 시스템 기준 정보를 이용하여 얻은(룩업 테이블 확인이나 외부 정보 확인 등) 태양 고도(Sun Azimuth Angle(°))(SAA)를 입력(X, 학습 데이터)으로 하여 완전접속(fully connected) 네트워 크로 구성되는 은닉층(hidden layer)으로 모델링된 순간 전력 예측 모델 신경망을 통해서 예상 태양광 발전량을 출력한다. 출력(Y)으로 제공되는 RIP는 예측된 모듈의 평균 순간 전력을 의미한다. 이러한 은닉층의 뉴런 수량 을 통해서 학습률 및 배치사이즈, 학습횟수 등을 정의할 수 있다. 태양광 발전량 예측의 경우 실시간으로 지속 출력하는 것이 중요한 것이 아니라 비교적 느리게 변화되는 환경 변화에 대응하여 태양광 발전량을 정확하게 예측하는 것이 중요한 것이기 때문에 도 5 내지 도 8을 통해 설명한 다중복합 인공신경망 분석 처리부(340a)와 같은 복합적인 신경망을 적용하여 실질적으로 숙련자가 게속하여 집 중해야만 판단할 수 있으며 상황에 따라 판단의 편자가 큰 이미지를 통한 모듈의 오염도 확인을 빅데이터를 기반으로 수행하므로, 시간이 지날수록 그 오염도를 더 정확하게 판단할 수 있게되며 더 정확해지는 패널 오염도 를 반영한 신경망으로 발전량을 예측하므로 그 적중률은 첨차 높아지게 된다. 이제 본 발명의 실시예의 예측 분석부에 구성되어 예상 발전량 분석에 사용된 영향인자를 분석하고 가중치 를 변경하는 영향인자 분석부를 설명하도록 한다. 도 9는 본 발명의 실시예에 따른 영향인자 분석부의 구성을 보인 개념도이다. 앞서 설명했던 바와 같이 태양광 발전량 예측의 경우 비교적 느리지만 다양한 변화 요인들이 가변적으로 적용되 는 환경 변화에 대응하여 태양광 발전량을 정확하게 예측하는 것이 중요한 것이며, 이는 단순히 분석 방식들을 여러 종류로 사용한다고 하여 적중률이 높아지는 것이 아니다. 즉, 환경의 변동에 따라 발전량에 영향을 미치는 요인이 일사량인지, 태양 고도인지, 외기 온도인지, 습도인지, 모듈의 오염도인지, 모듈의 온도인지, 예상되는 기상 변화인지, 혹은 모듈 이상이나 발전량에 따른 인버터 효율 저하인지, 이들 중 어떠한 것이 주요 원인이 되는 지는 환경에 따라 변화하게 된다. 따라서, 각종 분석 방식들 에 적용되는 파라미터나 가중치 등이 적합한 것인지에 대한 끊임 없는 확인과 재조정이 필요하다. 나아가 본 발명의 실시예에 따른 데이터 수집부는 실시간 비정형 데이터를 수집하기 때문에 데이터가 많아질수 록 학습을 위한 많은 연산으로 데이터의 오차, 소실 등의 문제가 발생할 수 있다. 따라서, 본 발명의 실시예에 따른 영향인자 분석부는 예측량과 영향인자와의 상관관계 및 가중치 등을 분 석하게 되는데, 도시된 바와 같이 영향인자를 수집하는 영향인자 수집부와, 태양광 발전량 예측 결과를 분석하 는 예측 분석부와, 예측 분석부의 정확도를 판단하는 영향인자 정확도 판단부와, 기계학습 방식의 분석이 이루 어질 때마다 분석에 사용되는 학습 데이터 세트를 교차 검증하는 교차 검증부와, 각 영향인자들의 발전량 기여 가중치를 결정하는 가중치 결정부와, 각 영향인자별 추론 확률을 구하여 영향도를 판단하는 영향력 판단부를 포 함하는 영향인자 분석부를 포함할 수 있다. 여기서, 예측 분석부와 정확도 판단부 및 교차 검증부는 예를 들어, 기계 학습 방식의 태양광 발전량 예측 분석 이 수행될 때마다 기계 학습 데이터 세트를 K-fold 크로스 밸리데이션 분리 방법으로 설정된 정확도 이상의 값 이 나올때까지 기계학습을 진행하여 영향인자의 가중치를 검증할 수 있다. 한편, 가중치 결정부는 상호정보량(Mutual Infotmation)을 통해 각 영향인자들의 발전량 기여 가중치를 결정할 수 있으며, 영향력 판단부는 랜덤 포레스트(Random forest) 방식으로 각 영향인자별 추론 확률을 구하여 영향도 를 판단할 수 있다. 이러한 과정을 통해서 얻어지는 영향인자의 변경되는 가중치는 후속 분석에 반영되도록하는 것(핵심기법 관리부 의 파라미터 설정, 일반 기법 관리부의 파라미터 설정)이 바람직하며, 이러한 영향인자에 대한 발전량 기여도나 영향도를 가변하므로 다양한 환경 변화에 적절하게 대응할 수 있고, 이렇게 분석된 영향인자에 대한 정보를 예 상 발전량과 함께 정보 제공부에 제공함으로써 관리자의 적절한 판단을 위한 기본 정보로서 활용될 수 있 다. 도 10은 본 발명의 실시예에 따른 빅데이터 분석을 통한 태양광 발전량 예측 방법을 보인 순서도로서, 도시된 바와 같이 기상 데이터, 환경에 대한 측정 데이터, 발전 상태 데이터 및 태양광 발전 모듈 관찰 영상 데이터를 포함하는 태양광 발전 관련 데이터를 수집하여 저장 및 전처리하는 단계를 포함한다. 이후, 태양광 발전량 예측을 위하여 학습 방식과 통계 방식을 포함하는 복수의 분석 방식과 각 분석 방식에서 사용할 파라미터를 정의하고, 정의된 파라미터를 상세 분석 설정에 따라 변동하며, 분석 목표에 따라 사용할 분 석 방식과 파라미터를 관리하는 단계를 포함한다. 만일 이전 발전량 예측에 대한 분석으로 영향인자에 대한 가 중치가 변경되고 영향도가 높은 영향인자가 결정되면 그에 적합한 분석 방식과 파라미터 변경을 수행할 수 있다. 이후, 정의 및 변동된 파라미터로 복수의 분석 방식으로 분석 과정을 수행하는 발전량 예측 단계를 수행하는데, 본 발명의 실시예에서 다중복합 인공신경망 발전량 예측은 신경망을 통한 모듈 오염도를 산출하고 오염도를 포 함하는 발전 관련 데이터를 이용하여 신경망 기반 발전량을 예측할 수 있어 발전량 예측에 중요한 요인이 되는 오염도를 비정형 정보인 모듈 이미지로 부터 산출할 수 있으며 이를 적극적으로 활용할 수 있다. 그 외에 회귀분석 발전량 예측, 통계 모델을 통한 발전량 예측, 심층 인공 신경망 분석 등의 다른 분석 방식들 을 이용한 예측 분석 처리를 수행하는 단계를 포함하며, 다중복합 인공신경망 발전량 예측과 병렬적으로 수행될수 있다. 이상과 같이 얻어진 예상 발전량 정보들을 정보 제공부를 통해서 관리자나 사용자에게 다양한 시각정보나 청각 정보 등으로 제공하는 단계를 포함한다. 더불어, 분석을 수행할 때마다 영향인자에 대한 성능 평가, 가중치 결정, 영향도 판단 등을 수행하며, 그에 따 라 재설정된 가중치나 영향인자의 영향도 정보를 후속 분석에 반영되도록 하는 단계를 포함한다. 해당 영향인자 에 대한 분석 정보 역시 정보 제공부를 통해서 관리자나 사용자에게 제공될 수 있다. 나아가, 이러한 모든 과정은 지속적으로 반복됨으로써 빅데이터를 이용한 분석 정확도는 점차 개선되며 다양한 환경 변화에 지능적으로 대응할 수 있게 된다. 이상에서는 본 발명에 따른 바람직한 실시예들에 대하여 도시하고 또한 설명하였다. 그러나 본 발명은 상술한 실시예에 한정되지 아니하며, 특허 청구의 범위에서 첨부하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형 실시가 가능할 것이다."}
{"patent_id": "10-2018-0139297", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 빅데이터 분석을 통한 태양광 발전량 예측 장치의 개념적 구성도를 보인 것이다. 도 2는 본 발명의 실시예에 따른 데이터 저장 및 전처리부의 구성을 보인 것이다. 도 3은 본 발명의 실시예에 따른 예측 분석부에 포함된 기법 관리 구성들의 처리 내용을 개념적으로 보인 것이다. 도 4는 본 발명의 실시예에 따른 예측 분석부에 포함된 예상 발전량 분석부의 구성을 개념적으로 보인 것이다. 도 5는 본 발명의 실시예에 따른 예상 발전량 분석부의 분석 처리부 중 하나인 다중복합 인공신경망의 구성 및 동작 방식을 설명하기 위한 개념도이다. 도 6 내지 도 8은 다중복합 인공신경망의 구성을 보인 예시적 실시예이다. 도 9는 본 발명의 실시예에 따른 영향인자 분석부의 구성을 보인 개념도이다. 도 10은 본 발명의 실시예에 따른 빅데이터 분석을 통한 태양광 발전량 예측 방법을 보인 순서도이다."}
