{"patent_id": "10-2020-0009682", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0097237", "출원번호": "10-2020-0009682", "발명의 명칭": "자율주행 차량의 여행 안내 시스템", "출원인": "한양대학교 에리카산학협력단", "발명자": "염윤식"}}
{"patent_id": "10-2020-0009682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율주행 차량의 여행 안내 시스템에 있어서,현재 위치를 감지하는 감지부;현재 위치에 따라 제1 목적지를 연산하는 제어부; 및자율주행 차량이 제1 목적지와 설정 거리 이내에 도달한 경우에 주행환경에 위치한 인공물 또는 자연물의 어느한 부분을 특정 오브젝트를 출력하는 출력부;를 포함하는 것을 특징으로 하는 자율주행 차량의 여행 안내 시스템."}
{"patent_id": "10-2020-0009682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 자율주행 차량의 여행 안내 시스템은 입력부를 더 포함하고,상기 입력부가 상기 특정 오브젝트를 선택하는 경우에 상기 제어부는 특정 오브젝트의 위치를 판별하고 상기 위치로 자율주행 차량을 구동시키는 것을 특징으로 하는 자율주행 차량의 여행 안내 시스템."}
{"patent_id": "10-2020-0009682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 출력부는 상기 제어부가 연산한 제1 목적지를 출력하는 제1 목적지 출력부, 상기 제1 목적지로 이동하는경로를 표시하는 경로출력부, 및 상기 제어부가 판별한 특정 오브젝트를 출력시키는 오브젝트출력부를 포함하여이루어지는 것을 특징으로 하는 자율주행 차량의 여행 안내 시스템."}
{"patent_id": "10-2020-0009682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 제어부는 상기 제1 목적지가 복수개가 되도록 연산하고 상기 입력부는 복수개의 제1 목적지 중 어느 하나를 선택하는 것을 특징으로 하는 자율주행 차량의 여행 안내 시스템."}
{"patent_id": "10-2020-0009682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 감지부는 레이더, 라이더 및 카메라를 더 포함하고, 상기 감지부는 도로 이외의 인공물과 자연물을 감지하고, 상기 제어부는 상기 인공물과 자연물의 어느 한 영역을 특정 오브젝트로 지정하는 것을 특징으로 하는 자율주행 차량의 여행 안내 시스템."}
{"patent_id": "10-2020-0009682", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,공개특허 10-2021-0097237-3-상기 자율주행 차량의 여행 안내 시스템은 여행 서버를 더 포함하고, 상기 여행 서버는 복수 개의 자율주행 차량과 통신하고, 상기 여행 서버는 자율주행 차량의 입력부가 상기 특정 오브젝트 또는 상기 특정 오브젝트를 선택하는 횟수를 카운팅하는 것을 특징으로 하는 자율주행 차량의 여행 안내 시스템."}
{"patent_id": "10-2020-0009682", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 자율주행 차량을 이용하여 대략의 목적지를 설정한 후 실제 목적지 근처의 배경에 있는 인공물 또는 자연물을 선택하는 경우에 자율주행 차량이 이동하도록 한다. 따라서, 텍스트 검색 기반이 아닌 실제 이미지 검 색 기반으로 자율주행 차량을 이동시킬 수 있으므로 여행 시 보이는 부분으로의 즉각적 이동을 가능하게 한다. 본 발명의 일 측면에 자율주행 차량의 여행 안내 시스템은 현재 위치를 감지하는 감지부, 현재 위치에 따라 제1 목적지를 연산하는 제어부, 및 자율주행 차량이 제1 목적지와 설정 거리 이내에 도달한 경우에 주행환경에 위치 한 인공물 또는 자연물의 어느 한 부분을 특정 오브젝트를 출력하는 출력부를 포함한다."}
{"patent_id": "10-2020-0009682", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 여행 안내 시스템에 대한 것으로서, 보다 상세하게는 자율주행 차량을 이용하여 예비 목적지를 선정 하고 예비 목적지 인근에서 마음에 드는 배경을 선택하여 그곳을 최종 목적지로 선정하고 이동하는 자율주행 차 량의 여행 안내 시스템에 대한 것이다."}
{"patent_id": "10-2020-0009682", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율주행 차량은 인간의 운전 없이 자동으로 주행할 수 있는 자동차이다. 자율주행 차량은 레이더, LIDAR(light detection and ranging), GPS, 카메라로 주위의 환경을 인식하여 목적지를 지정하는 것만으로 자율적으로 주행 한다. 이미 실용화되고 있는 자율주행 차량으로는 이스라엘 군에서 운용되는 미리 설정된 경로를 순찰하는 무인 차량과 국외 광산이나 건설 현장 등에서 운용되고 있는 덤프 트럭 등의 무인 운행 시스템 등이 있다. 이러한 자율주행 차량의 첫 번째 핵심기술은 자율주행 차량 시스템과 Actual System이다. 실험실 내의 시뮬레이 션뿐만 아니라 실제로 자율주행 차량 시스템을 구축하는 기술이며 구동장치인 가속기, 감속기 및 조향장치 등을 무인화 운행에 맞도록 구현하고, 자율주행 차량에 장착된 컴퓨터, 소프트웨어 그리고 하드웨어를 이용하여 제어 를 가능하게 한다. 두 번째 핵심기술은 비전, 센서를 이용하여 시각정보를 입력받고 처리하는 것이다. 무인화 운행을 위한 자율 주 행의 기본이 되는 것으로, 영상정보를 받아들이고 이 영상 중에서 필요한 정보를 추출해내는 기술이다. 이것은 CCD(charge-coupled device) 카메라뿐만 아니라 초음파 센서 및 레인지 필더 등의 센서를 사용하여 거리와 주행 에 필요한 정보를 융합하여 분석 및 처리를 통해 장애물 회피와 돌발상황에 대처할 수 있게 한다. 세 번째 핵심기술은 통합관제 시스템과 운행감시 고장진단체계 기술이다. 이 기술은 차량의 운행을 감시하고 수 시로 바뀌는 상황에 따라 적절한 명령을 내리는 운행감시체계를 구축하고, 개별적 프로세서 및 센서에서 발생되 는 여러 상황을 분석하여 시스템의 고장을 진단하여 오퍼레이터에 대한 적절한 정보를 제공하거나 경보를 알리 는 기능을 수행할 수 있게 한다. 네 번째 핵심기술은 지능제어 및 지능운행 장치이다. 이 기술은 무인운행기법으로 실제 차량모델을 이용한 수학 적인 해석에 근거하여 제어명령을 생성하여 현재 자율주행 차량에 적용되고 있는 첫 번째 적용기술은 지능형 순 향제어(ACC: Adaptive Cruise Control) 시스템이다. 지능형 순향제어는 레이다 가이드 기술에 기반을 두고 운전 자가 페달을 조작하지 않아도 스스로 속도를 조절하여 앞차 또는 장애물과의 거리를 유지시켜주는 시스템이다. 운전자가 앞차와의 거리를 입력하면 자동차 전면에 부착된 장거리 레이다가 앞차의 위치를 탐지하여 일정속도를 유지하거나 감속, 가속하며 필요한 경우 완전히 정지하여 시야확보가 어려운 날씨에 유용하다. 다섯 번째 적용기술은 차선이탈방지 시스템이다. 이는 내부에 달린 카메라가 차선을 감지하여 의도하지 않은 이 탈 상황을 운전자에게 알려주는 기술로 자율주행 차량에서는 도보와 중앙선을 구분하여 자동차가 차선을 따라 안전하게 주행할 수 있도록 해준다. 여섯 번째 적용기술은 주차보조 시스템이다. 이는 운전자가 어시스트 버튼을 탐색한 수 후진기어를 넣고 브레이 크 페달을 밟으면 자동차가 조향장치 조절하여 후진 일렬주차를 도와주는 시스템이다. 차량 장착형 센서뿐만 아 니라 인프라를 기반으로 출발지에서 주차공간까지 차량을 자동으로 유도하여 주차 시 불필요하게 소모되는 시간 과 에너지를 절약해주어 소요비용과 환경오염을 최소화 해준다. 일곱 번째 적용기술은 자동주차 시스템이다. 이는 운전자가 주차장 앞에 차를 정지시킨 뒤 엔진을 끄고 내려서 리모콘 잠금 스위치를 2회 연속 누르면 자동차에 설치된 카메라가 차고의 반대편 벽에 미리 붙여놓은 반사경을 탐지해 적정한 접근 경로를 계산하여 스스로 주차를 하는 기술이다.여덟 번째 적용 기술은 사각지대 정보 안내 시스템이다. 이는 자동차의 양측면에 장착된 센서가 사이드 미러로 보이지 않는 사각지대에 다른 차량이 있는지를 판단하여 운전자에게 경고를 해주는 것으로 복잡한 도로 상황에 서 양측의 장애물 및 차량을 확인하여 차선을 변경하는 용도로 사용된다. 자율주행 차량의 가장 큰 장점은 주행속도와 교통 관리 자료가 일치하기 때문에 조절장치를 더욱 고르게 하여 반복정지를 피해 연료 효율에 도움을 준다는 것과 노인, 아동, 장애인 등 운전을 할 수 없는 이들도 이용할 수 있다는 것이다. 이외에도 장시간 운전으로 인한 피로를 해결해주고, 교통사고의 위험을 크게 줄일 수 있는 것과 도로의 교통 흐름이 빨라지고 교통 혼잡을 줄일 수 있다는 장점이 있다. 이에, 자율주행 차량을 이용한 다양한 비지니스가 등장할 것으로 예측되고 있다. 특히, 자율주행을 이용하여 매 우 다양한 여행 비지니스가 등장한 것으로 예견되는데 아직 관련 연구는 미비한 실정이다. [선행기술문헌] 한국공개특허 제2019-0012624호(2019. 02. 11.)"}
{"patent_id": "10-2020-0009682", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 종래기술의 문제점을 해결하기 위한 것으로서, 본 발명의 목적은 자율주행 차량을 이용한 여 행 안내 시스템을 제공받는데 있다."}
{"patent_id": "10-2020-0009682", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 자율주행 차량의 여행 안내 시스템은 현재 위치를 감지하는 감지부, 현재 위치에 따라 제1 목적지를 연산하는 제어부, 및 자율주행 차량이 제1 목적지와 설정 거리 이내에 도달한 경우에 주행환경에 위치 한 인공물 또는 자연물의 어느 한 부분을 특정 오브젝트를 출력하는 출력부를 포함한다. 이때, 상기 자율주행 차량의 여행 안내 시스템은 입력부를 더 포함하고, 상기 입력부가 상기 특정 오브젝트를 선택하는 경우에 상기 제어부는 특정 오브젝트의 위치를 판별하고 상기 위치로 자율주행 차량을 구동시킬 수 있 다. 또한, 상기 출력부는 상기 제어부가 연산한 제1 목적지를 출력하는 제1 목적지 출력부, 상기 제1 목적지로 이동 하는 경로를 표시하는 경로출력부, 및 상기 제어부가 판별한 특정 오브젝트를 출력시키는 오브젝트출력부를 포 함하여 이루어질 수 있다. 또한, 상기 제어부는 상기 제1 목적지가 복수개가 되도록 연산하고 상기 입력부는 복수개의 제1 목적지 중 어느 하나를 선택할 수 있다. 또한, 상기 감지부는 레이더, 라이더 및 카메라를 더 포함하고, 상기 감지부는 도로 이외의 인공물과 자연물을 감지하고, 상기 제어부는 상기 인공물과 자연물의 어느 한 영역을 특정 오브젝트로 지정할 수 있다. 또한, 상기 자율주행 차량의 여행 안내 시스템은 여행 서버를 더 포함하고, 상기 여행 서버는 복수 개의 자율주 행 차량과 통신하고, 상기 여행 서버는 자율주행 차량의 입력부가 상기 특정 오브젝트 또는 상기 특정 오브젝트 를 선택하는 횟수를 카운팅할 수 있다."}
{"patent_id": "10-2020-0009682", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 자율주행 차량을 이용하여 대략의 목적지를 설정한 후 실제 목적지 근처의 배경에 있는 인공물 또는 자연물을 선택하는 경우에 자율주행 차량이 이동하도록 한다. 따라서, 텍스트 검색 기반이 아닌 실제 이미지 검 색 기반으로 자율주행 차량을 이동시킬 수 있으므로 여행 시 보이는 부분으로의 즉각적 이동을 가능하게 한다."}
{"patent_id": "10-2020-0009682", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 발명의 실시예에 대하여 당업자가 용이하게 실시할 수 있도록 상세히 설명한 다. 본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시 하여 상세하게 설명한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하 게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조 합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 이하, 본 발명의 일 실시예에 따른 자율주행 차량의 여행 안내 시스템을 설명한다. 도 1은 본 발명의 일 실시예에 따른 자율주행 차량의 여행 안내 시스템의 구성도이고, 도 2는 도 1에서의 출력부를 더욱 상세하게 도 시한 구성도이며, 도 3은 도 1에서의 감지부를 더욱 상세하게 도시한 구성도이고, 도 4는 도 1에서의 제어부를 더욱 상세하게 도시한 구성도이다. 우선, 도 1을 참조하면, 본 발명의 일 실시예에 따른 자율주행 차량의 사고 안내 시스템은 자율주행 차량 및 여행 통신하는 여행서버를 포함한다. 자율주행 차량은 출력부, 감지부, 통신부, 제어부 및 입력부를 포함하여 이루어 진다. 출력부는 도 2에 도시한 바와 같이 제1 목적지출력부, 경로출력부 및 오브젝트출력부 로 이루어진다. 제1 목적지출력부는 제어부가 연산한 제1 목적지를 출력한다. 이때 제어부(14 0)는 제1 목적지를 복수개로 출력하여 사용자로 하여금 제1 목적지를 선택하도록 한다. 경로출력부는 제1 목적지로 이동하는 경로를 표시하는 역할을 수행한다. 한편, 본 실시예에 따른 자율주행 차량의 여행 안내 시스템은 제1 목적지를 예상 목적지로 선택하고 제1 목적지 근처에 자율주행 차량이 근접하는 경우에 실제로 탑승객은 가고 싶은 장소를 실제 배경을 보고 특정하도록 한다. 그런데, 오브젝트출력부는 자율주행 차량이 제1 목적지와 설정 거리 이내에 도달한 경우에 주행 환 경에 위치한 인공물 또는 자연물의 어느 한 부분을 특정 오브젝트로 출력하도록 한다. 이에 입력부는 특정 오브젝트를 선택하는 것이 가능하고 이 경우 자율주행 차량은 그 특정 오브젝트가 위치한 장소로 이동되도록 한 다. 감지부는 레이더, 라이다, 카메라 및 GPS를 포함하여 이루어진다. 레이더는 자율주행 차량에 안테나를 장착하여 레이더 탐지 동작을 수행하면서 무인으로 이동 가능한 장치 를 의미한다. 레이더는 구비된 안테나를 이용하여 레이더 탐지 동작만을 수행하는 것에 한정되는 것은 아 니며, 라이다 및 카메라와 같이 주변 환경을 센싱할 수 있는 복수의 센서 또는 복합 센서와 같은 형태로 구현될 수 있다. 레이더는 주변 환경을 센싱하여 주변 센싱정보를 생성하고, 주변 센싱정보를 기반으 로 주행 방향에 존재하는 오브젝트인 도로, 타차량, 사람 및 무생물을 판단한다. 이때 레이더는 제1 목적 지 근처에서 도로를 제외한 인공물 및 자연물을 판단한다. 라이다는 레이저 펄스를 발사하고, 그 빛이 주위의 대상 물체에서 반사되어 돌아오는 것을 받아 물체까지 의 거리 등을 측정함으로써 주변의 모습을 정밀하게 그려내는 장치이다. 라이다는 레이저 펄스를 지표면에 발사해서 돌아오는 시간을 측정함으로써 반사 지점의 공간 위치를 분석하여 지형을 측량하면, 구조물에 따라 반 사되어 돌아오는 시간이 다르므로 이로부터 광학영상으로는 얻기 어려운 3차원 모델을 얻을 수 있다. 라이다는 레이저, 스캐너, 수신기, 위치 확인 시스템으로 이루어지는데, 레이저의 파장은 600-1000nm을 사 용한다. 스캐너는 주위를 재빠르게 훑어서 정보를 얻도록 하는 부분이다. 수신기는 돌아오는 빛을 감지하는 부 분으로, 수신기가 가지는 빛에 대한 민감도는 라이다의 성능을 좌우하는 주요한 요인이다. 근본적으로 수신기는 광자를 감지하여 이를 증폭하는 역할을 한다. 위치 확인 시스템은 3차원 영상을 구현하기 위해서 수신기가 놓여 있는 위치 좌표와 방향을 확인하는 역할을 수행한다. 이때 레이더는 제1 목적지 근처에서 도로를 제외한 인공물 및 자연물을 판단하고, 라이더는 인공물 및 자연물의 위치를 정확하게 판단하는 역할을 수행한다. 카메라는 차량의 전후측방 배경을 촬상하는데, 전술한 레이더 및 라이더에 의해 판단된 제1 목 적지 인근의 인공물 또는 자연물을 특정하여 촬상하고 제어부는 특정된 부분에서 중복된 부분을 제거한 후 특정 오브젝트로 도출되어 전술한 오브젝트출력부가 출력하도록 한다. 따라서, 사용자의 선택이 가능한 이 미지로 변경될 수 있고, 사용자가 그 이미지(특정 오브젝트)를 선택한 경우에 이미 상기한 라이더에 의해 위치 판단이 되었으므로 그 위치로 자율주행 차량을 구동시킬 수 있게 된다. GPS는 차량의 현재 위치를 감지한다. 따라서, 본 실시예에 따른 여행 안내 시스템은 현재 차량의 위치를 판단하고 관련 도착 시간을 감안하여 제어부가 제1 목적지를 연산하게 된다. 한편, 제어부는 제1목적지연산모듈, 오브젝트인식모듈, 및 제2목적지연산모듈으로 이루어 진다. 제1목적지연산모듈은 상기한 바와 같이 입력부가 예상 시간 및 거리를 입력하게 되면 이에 따 라 복수개의 제1 목적지를 연산하여 출력하게 된다. 이때, 본 실시예에 따른 자율주행 차량의 여행 안내 시스템 은 여행서버를 더 포할 할 수 있는데 제1목적지연산모듈은 해당 목적지와 설정 범위 이내 영역의 목 적지와 여행서버에 저장된 목적지를 대비하여 제1목적지 선택에 반영할 수 있다. 오브젝트인식모듈는 전술한 바와 같이 자율주행 차량이 제1 목적지에 근접하는 경우에 전술한 레이더 또는 라이더가 판단하여 카메라가 촬상한 인공물 또는 자연물 중에서 사용자가 이후 선택하기 위해서 불필요한 부분을 잘라내는 역할을 수행한다. 즉, 라이더는 전술한 바와 같이 오브젝트의 위치를 판단할 수 있으므로 최종 목적지의 입력을 위해서 설정 단위로 분할된 좌표점을 포함된 것을 특정 오브젝트로 인식하게 된다. 이후 제2목적지연산모듈은 좌표점을 포함하는 특정 오브젝트가 입력부에 의해 선택된 경우 그 좌표점으로부터 실제 위치를 판단하고 차량이 이 동되도록 한다. 한편, 여행서버는 복수 개의 자율주행 차량과 통신하는데 자율주행 차량의 입력부가 상기 특정 오브젝트 또는 상기 특정 오브젝트를 선택하는 횟수를 카운팅하게 된다. 즉, 당초에는 특정 오브젝트의 개수가 제한 적이 겠지만 여행객이 증가함에 따라 특정 오브젝트가 선택되는 빈도는 계속 증가할 수 있다. 이 경우 여행서버(20 0)는 제1 목적지를 선정하는 경우에 이러한 상황을 반영하여 사용자의 선택이 많은 최종 목적지로 추천할 수 있 다. 이상과 같이, 본 명세서와 도면에는 본 발명의 바람직한 실시예에 대하여 개시하였으며, 비록 특정 용어들이 사 용되었으나, 이는 단지 본 발명의 기술 내용을 쉽게 설명하고 발명의 이해를 돕기 위한 일반적인 의미에서 사용 된 것이지, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시예 외에도 본 발명의 기술적 사 상에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명한 것이다."}
{"patent_id": "10-2020-0009682", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 자율주행 차량의 여행 안내 시스템의 구성도이다. 도 2는 도 1에서의 출력부를 더욱 상세하게 도시한 구성도이다. 도 3은 도 1에서의 감지부를 더욱 상세하게 도시한 구성도이다. 도 4는 도 1에서의 제어부를 더욱 상세하게 도시한 구성도이다."}
