{"patent_id": "10-2022-0024469", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0126969", "출원번호": "10-2022-0024469", "발명의 명칭": "글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭", "출원인": "화이트타이거그라운드 유한책임회사", "발명자": "박관영"}}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메모리를 포함하는 컴퓨팅 장치가 수행하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자매칭 방법으로서,수요자가 구매 가능한 제품을 공급하는 제품공급기업인 공급자에 관한 정보로서, 적어도 공급 제품에 대한 원가에 관련된 표준 지표 데이터인 원가 지표 데이터, 제품 가격에 영향을 미치는 노동자 임금에 관련된 표준 지표데이터인 임금 지표 데이터, 실제 제품 원가 데이터 및 실제 임금 데이터를 포함하는 제1 입력 데이터를 수신시, 기설정된 공급 데이터 표준화 알고리즘에 적용하여 제품의 공급에 관련된 표준화 지수인 공급 지수를 도출하는 공급 지수 도출 단계;수요자의 제품 구매에 관한 데이터로서, 적어도 수요자의 개인 정보 및 수요자의 구매 여력에 관한 데이터인 제2 입력 데이터를 수신 시, 기설정된 수요 데이터 표준화 알고리즘에 적용하여 제품의 구매에 관련된 표준화 지수인 수요 지수를 도출하는 수요 지수 도출 단계; 및도출된 공급 지수와 수요 지수의 상관관계를 분석하여, 공급자와 수요자 간의 매칭 정보를 도출하는 매칭 정보도출 단계;를 포함하는 것을 특징으로 하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 방법."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 공급 지수 도출 단계는,공급자에 관련된 정보로서, 공급자의 위치, 공급자가 위치한 지역의 환율, 공급자가 위치한 지역의 기후 및 공급자가 위치한 지역의 노동 품질에 대한 정보를 포함하는 공급자 속성 정보를 상기 제1 입력 데이터에 적용하여상기 공급 지수를 도출하는 것을 특징으로 하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를이용한 공급자와 수요자 매칭 방법."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 공급 지수 도출 단계는,상기 제1 입력 데이터를 입력 값으로 하고, 상기 공급 지수를 출력 값으로 하는 상기 공급 데이터 표준화 알고리즘에 있어서, 상기 공급 데이터 표준화 알고리즘은 신경망 알고리즘이며, 상기 공급자 속성 정보가 웨이트(Weight) 값으로 적용하되, 상기 공급자 속성 정보 별 웨이트는 머신 러닝에 의하여 학습되면서 변동되는 것을특징으로 하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 방법."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 공급 지수 도출 단계는,상기 수요 지수에 포함된 카테고리 정보로서, 적어도 구매 금액, 위치, 제품 카테고리 및 품질을 나타내는 다수공개특허 10-2023-0126969-3-의 카테고리별로 상기 공급 지수를 도출하는 것을 특징으로 하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 방법."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 수요 지수 도출 단계는,상기 수요자의 개인 정보로서, 수요자 단말로부터 주기적으로 측정되는 생체 신호 데이터, 수요자 단말로부터입력된 설문 데이터, 수요자의 개인 건강 데이터, 수요자의 구매 이력 데이터와, 상기 수요자의 구매 여력에 관한 데이터로서, 수요자의 금융 정보 데이터를 상기 제2 입력 데이터로 수신하여 수요 지수를 도출하는 것을 특징으로 하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭방법."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 수요 지수 도출 단계는, 적어도 구매 금액, 위치, 제품 카테고리 및 품질을 나타내는 다수의 카테고리별로상기 수요 지수를 도출하는 것을 특징으로 하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를이용한 공급자와 수요자 매칭 방법."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 매칭 정보 도출 단계는,상기 공급 지수와 수요 지수 간의 선형 상관관계 분석 알고리즘을 이용하여, 공급 지수와 수요 지수 사이의 상관관계를 도출하고, 일 공급자와 상관관계가 높은 수요자를 매칭 정보로 도출하여 공급자에게 제공하는 것을 특징으로 하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭방법."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 매칭 정보 도출 단계는,상기 공급 지수와 수요 지수 간의 선형 상관관계 분석 알고리즘을 이용하여, 공급 지수와 수요 지수 사이의 상관관계를 도출하고, 일 수요자와 상관관계가 높은 공급자를 매칭 정보로 도출하고, 도출된 매칭 정보와 매칭 정보에 속한 공급자가 판매하는 제품에 관한 정보를 수요자에게 제공하는 것을 특징으로 하는 글로벌 스마트 제조시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 방법."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "하나 이상의 프로세서 및 상기 프로세서에서 수행 가능한 명령들을 저장하는 하나 이상의 메모리를 포함하는 컴퓨팅 장치로 구현되는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자매칭 장치로서, 수요자가 구매 가능한 제품을 공급하는 제품공급기업인 공급자에 관한 정보로서, 적어도 공급 제품에 대한 원가에 관련된 표준 지표 데이터인 원가 지표 데이터, 제품 가격에 영향을 미치는 노동자 임금에 관련된 표준 지표공개특허 10-2023-0126969-4-데이터인 임금 지표 데이터, 실제 제품 원가 데이터 및 실제 임금 데이터를 포함하는 제1 입력 데이터를 수신시, 기설정된 공급 데이터 표준화 알고리즘에 적용하여 제품의 공급에 관련된 표준화 지수인 공급 지수를 도출하는 공급 지수 도출부;수요자의 제품 구매에 관한 데이터로서, 적어도 수요자의 개인 정보 및 수요자의 구매 여력에 관한 데이터인 제2 입력 데이터를 수신 시, 기설정된 수요 데이터 표준화 알고리즘에 적용하여 제품의 구매에 관련된 표준화 지수인 수요 지수를 도출하는 수요 지수 도출부; 및도출된 공급 지수와 수요 지수의 상관관계를 분석하여, 공급자와 수요자 간의 매칭 정보를 도출하는 매칭 정보도출부;를 포함하는 것을 특징으로 하는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한공급자와 수요자 매칭 장치."}
{"patent_id": "10-2022-0024469", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨터-판독가능 기록매체로서,상기 컴퓨터-판독가능 기록매체는, 컴퓨팅 장치로 하여금 이하의 단계들을 수행하도록 하는 명령들을 저장하며,상기 단계들은:수요자가 구매 가능한 제품을 공급하는 제품공급기업인 공급자에 관한 정보로서, 적어도 공급 제품에 대한 원가에 관련된 표준 지표 데이터인 원가 지표 데이터, 제품 가격에 영향을 미치는 노동자 임금에 관련된 표준 지표데이터인 임금 지표 데이터, 실제 제품 원가 데이터 및 실제 임금 데이터를 포함하는 제1 입력 데이터를 수신시, 기설정된 공급 데이터 표준화 알고리즘에 적용하여 제품의 공급에 관련된 표준화 지수인 공급 지수를 도출하는 공급 지수 도출 단계;수요자의 제품 구매에 관한 데이터로서, 적어도 수요자의 개인 정보 및 수요자의 구매 여력에 관한 데이터인 제2 입력 데이터를 수신 시, 기설정된 수요 데이터 표준화 알고리즘에 적용하여 제품의 구매에 관련된 표준화 지수인 수요 지수를 도출하는 수요 지수 도출 단계; 및도출된 공급 지수와 수요 지수의 상관관계를 분석하여, 공급자와 수요자 간의 매칭 정보를 도출하는 매칭 정보도출 단계;를 포함하는 것을 컴퓨터-판독가능 기록매체."}
{"patent_id": "10-2022-0024469", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "구체적으로는 국가 또는 표준의 제약이 없는 글로벌 스마트 제조 시스템에 있어서, 공급자의 다종의 데이터에 대 한 표준화와 함께, 수요자의 자동의 데이터에 대한 표준화를 통하여 공급자와 수요자의 정보를 글로벌 단위에서 수집하고, 수집된 정보를 이용하여 전세계의 공급자와 수요자 간의 매칭이 가능하도록 하는 기술을 (뒷면에 계속)"}
{"patent_id": "10-2022-0024469", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 컴퓨팅 장치를 통하여 수행되는 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이 용한 공급자와 수요자 매칭 기술에 관한 것으로서, 구체적으로는 국가 또는 표준의 제약이 없는 글로벌 스마트 제조 시스템에 있어서, 공급자의 다종의 데이터에 대한 표준화와 함께, 수요자의 자동의 데이터에 대한 표준화 를 통하여 공급자와 수요자의 정보를 글로벌 단위에서 수집하고, 수집된 정보를 이용하여 전세계의 공급자와 수 요자 간의 매칭이 가능하도록 하는 기술에 관한 것이다."}
{"patent_id": "10-2022-0024469", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온라인 및 오프라인 상의 정보 공유 및 각종 시스템 간의 융합이 일반화되고 있어, 특히 크로스보딩 이커머스 등의 시장으로서, 글로벌한 유통 시장이 활성화되고 있다. 글로벌한 유통 시장에 있어서 제품의 공급자와 수요 자 간의 정보 공유 역시 날로 증가되고 있다. 이러한 글로벌 제조 시스템에 있어서, 다양한 위치 및 환경의 공급자와 수요자 사이에서 거래가 이루어져야 하 는데 있어서, 다양한 수요자들의 기호 및 니즈를 반영하기 위해서, 매우 다양한 종류의 제품으로서 특히 유저 맞춤형 제품 또는 유저 주문형 제품 등에 대한 공급의 요구가 늘어나고 있다. 그러나 종래의 글로벌 제조 시스템에서는, 공급자와 수요자 사이를 원활하게 매칭하여 주는 시스템 자체가 존재 하지 않아, 아마존 등 일부 쇼핑 플랫폼에서 수요자가 원하는 제품을 직접 검색하여야 하는 불편함이 있고, 공 급자 측면에서도, 타케팅되지 않은 임의의 유저에게 광고 등을 수행해야 했기 때문에, 맞춤형 제품 및 글로벌한 제조 시스템에서의 원활한 거래가 이루어지지 못하는 문제가 있다.이러한 문제를 해결하기 위하여, 대한민국 등록특허 제10-1909925호 등에서는, 제품의 생산과정을 자동화하는 동시에, 이와 같은 개인화된 제품을 효율적으로 생산하기 위해, 3D프린터, 로봇, 후처리장비(훈증, 연마, 도색 등)의 제조 설비들을 사물 인터넷(Internet of Things) 기반의 통합된 네트워크로 연결하여 적층, 가공 및 조립 과정을 자동화하고, 실시간 공장 상황을 파악하여 시스템이 스스로 지능적으로 계획하고, 판단하는 기술을 제시 하고 있다. 그러나 이러한 선행기술들은 단순히 제조 시스템에 대한 자동화에 지나지 않는 한계가 있다. 즉, 수요자와 공급 자 간의 다양한 정보를 통합적으로 관리함으로써, 다양한 니즈를 갖는 수요자와 공급자 사이를 효율적이고 최적 으로 매칭할 수 있는 기술이 없어, 이에 대한 필요성이 증가되고 있다."}
{"patent_id": "10-2022-0024469", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 고안된 것으로서, 구체적으로는 글로벌한 스마트 제조 시스템 에 있어서, 다양한 종류의 공급자의 데이터 및 다양한 종류 및 다양하게 수집될 수 있는 수요자의 데이터를 인 공지능 알고리즘을 이용하여 표준화하고, 표준화된 지수를 기반으로 공급자와 수요자의 매칭을 수행하여, 글로 벌 스마트 제조 시스템에 있어서 다양한 정보의 통합 관리를 통한 물품 공급이 가능하도록 하는 기술을 제공하 는 데 그 목적이 있다."}
{"patent_id": "10-2022-0024469", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 일 실시예에 따른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표 준화 및 이를 이용한 공급자와 수요자 매칭 방법은, 수요자가 구매 가능한 제품을 공급하는 제품공급기업인 공 급자에 관한 정보로서, 적어도 공급 제품에 대한 원가에 관련된 표준 지표 데이터인 원가 지표 데이터, 제품 가 격에 영향을 미치는 노동자 임금에 관련된 표준 지표 데이터인 임금 지표 데이터, 실제 제품 원가 데이터 및 실 제 임금 데이터를 포함하는 제1 입력 데이터를 수신 시, 기설정된 공급 데이터 표준화 알고리즘에 적용하여 제 품의 공급에 관련된 표준화 지수인 공급 지수를 도출하는 공급 지수 도출 단계; 수요자의 제품 구매에 관한 데 이터로서, 적어도 수요자의 개인 정보 및 수요자의 구매 여력에 관한 데이터인 제2 입력 데이터를 수신 시, 기 설정된 수요 데이터 표준화 알고리즘에 적용하여 제품의 구매에 관련된 표준화 지수인 수요 지수를 도출하는 수 요 지수 도출 단계; 및 도출된 공급 지수와 수요 지수의 상관관계를 분석하여, 공급자와 수요자 간의 매칭 정보 를 도출하는 매칭 정보 도출 단계;를 포함하는 것을 특징으로 한다. 상기 공급 지수 도출 단계는, 공급자에 관련된 정보로서, 공급자의 위치, 공급자가 위치한 지역의 환율, 공급자 가 위치한 지역의 기후 및 공급자가 위치한 지역의 노동 품질에 대한 정보를 포함하는 공급자 속성 정보를 상기 제1 입력 데이터에 적용하여 상기 공급 지수를 도출하는 것이 가능하다. 상기 공급 지수 도출 단계는, 상기 제1 입력 데이터를 입력 값으로 하고, 상기 공급 지수를 출력 값으로 하는 상기 공급 데이터 표준화 알고리즘에 있어서, 상기 공급 데이터 표준화 알고리즘은 신경망 알고리즘이며, 상기 공급자 속성 정보가 웨이트(Weight) 값으로 적용하되, 상기 공급자 속성 정보 별 웨이트는 머신 러닝에 의하여 학습되면서 변동되는 것이 가능하다. 상기 공급 지수 도출 단계는, 상기 수요 지수에 포함된 카테고리 정보로서, 적어도 구매 금액, 위치, 제품 카테 고리 및 품질을 나타내는 다수의 카테고리별로 상기 공급 지수를 도출하는 것이 가능하다. 상기 수요 지수 도출 단계는, 상기 수요자의 개인 정보로서, 수요자 단말로부터 주기적으로 측정되는 생체 신호 데이터, 수요자 단말로부터 입력된 설문 데이터, 수요자의 개인 건강 데이터, 수요자의 구매 이력 데이터와, 상 기 수요자의 구매 여력에 관한 데이터로서, 수요자의 금융 정보 데이터를 상기 제2 입력 데이터로 수신하여 수 요 지수를 도출하는 것이 가능하다. 상기 수요 지수 도출 단계는, 적어도 구매 금액, 위치, 제품 카테고리 및 품질을 나타내는 다수의 카테고리별로 상기 수요 지수를 도출하는 것이 가능하다. 상기 매칭 정보 도출 단계는, 상기 공급 지수와 수요 지수 간의 선형 상관관계 분석 알고리즘을 이용하여, 공급 지수와 수요 지수 사이의 상관관계를 도출하고, 일 공급자와 상관관계가 높은 수요자를 매칭 정보로 도출하여 공급자에게 제공하는 것이 가능하다.상기 매칭 정보 도출 단계는, 상기 공급 지수와 수요 지수 간의 선형 상관관계 분석 알고리즘을 이용하여, 공급 지수와 수요 지수 사이의 상관관계를 도출하고, 일 수요자와 상관관계가 높은 공급자를 매칭 정보로 도출하고, 도출된 매칭 정보와 매칭 정보에 속한 공급자가 판매하는 제품에 관한 정보를 수요자에게 제공하는 것이 가능하 다. 한편, 본 발명의 일 실시예에 따른 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수 요자 매칭 장치는, 수요자가 구매 가능한 제품을 공급하는 제품공급기업인 공급자에 관한 정보로서, 적어도 공 급 제품에 대한 원가에 관련된 표준 지표 데이터인 원가 지표 데이터, 제품 가격에 영향을 미치는 노동자 임금 에 관련된 표준 지표 데이터인 임금 지표 데이터, 실제 제품 원가 데이터 및 실제 임금 데이터를 포함하는 제1 입력 데이터를 수신 시, 기설정된 공급 데이터 표준화 알고리즘에 적용하여 제품의 공급에 관련된 표준화 지수 인 공급 지수를 도출하는 공급 지수 도출부; 수요자의 제품 구매에 관한 데이터로서, 적어도 수요자의 개인 정 보 및 수요자의 구매 여력에 관한 데이터인 제2 입력 데이터를 수신 시, 기설정된 수요 데이터 표준화 알고리즘 에 적용하여 제품의 구매에 관련된 표준화 지수인 수요 지수를 도출하는 수요 지수 도출부; 및 도출된 공급 지 수와 수요 지수의 상관관계를 분석하여, 공급자와 수요자 간의 매칭 정보를 도출하는 매칭 정보 도출부;를 포함 하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0024469", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 비정형화되거나 다양한 포맷을 갖는 공급자의 제품 생산 및 품질 등에 관련이 된 다양한 데 이터를 인공지능 알고리즘을 이용하여 공급 지수로 표준화하고, 역시 비정형화된 데이터 또는 다양한 포맷을 갖 는 수요자의 제품 구매에 관련된 니즈 및 여력에 대한 정보를 포함하는 데이터를 인공지능 알고리즘을 이용하여 수요 지수로 표준화한 뒤, 공급 지수와 수요 지수 간의 상관관계에 따라서 각 공급자와 수요자를 매칭하게 된다. 이에 따르면, 매우 다양한 글로벌 환경에서의 제품에 대한 공급자와 제품에 대한 수요자의 정보를 통합적으로 관리할 수 있는 동시에, 이를 이용하여 제품 공급에 대한 매칭을 수행할 수 있어, 다양한 환경에서 글로벌한 규 모의 제조 시스템과 유통 시스템의 통합이 가능한 효과를 기대할 수 있다."}
{"patent_id": "10-2022-0024469", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 다양한 실시 예들 및/또는 양상들이 이제 도면들을 참조하여 개시된다. 하기 설명에서는 설명을 목 적으로, 하나이상의 양상들의 전반적 이해를 돕기 위해 다수의 구체적인 세부사항들이 개시된다. 그러나, 이러 한 양상(들)은 이러한 구체적인 세부사항들 없이도 실행될 수 있다는 점 또한 본 발명의 기술 분야에서 통상의 지식을 가진 자에게 인식될 수 있을 것이다. 이후의 기재 및 첨부된 도면들은 하나 이상의 양상들의 특정한 예 시적인 양상들을 상세하게 기술한다. 하지만, 이러한 양상들은 예시적인 것이고 다양한 양상들의 원리들에서의 다양한 방법들 중 일부가 이용될 수 있으며, 기술되는 설명들은 그러한 양상들 및 그들의 균등물들을 모두 포함 하고자 하는 의도이다. 본 명세서에서 사용되는 \"실시 예\", \"예\", \"양상\", \"예시\" 등은 기술되는 임의의 양상 또는 설계가 다른 양상 또는 설계들보다 양호하다거나, 이점이 있는 것으로 해석되지 않을 수도 있다.또한, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 해당 특징 및/또는 구성요소가 존재함을 의미하지만, 하나 이상의 다른 특징, 구성요소 및/또는 이들의 그룹의 존재 또는 추가를 배제하지 않는 것으로 이해되어야 한다. 또한, 제 1, 제 2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구 성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 또한, 본 발명의 실시 예들에서, 별도로 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여 기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해 되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기 술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 실시 예에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 도 1 내지 3은 본 발명의 일 실시예에 따른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이 용한 공급자와 수요자 매칭 방법의 플로우차트, 도 4는 본 발명의 일 실시예에 따른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 장치의 구성 블록도, 도 5는 본 발명의 일 실 시예의 구현에 따라서 공급 지수가 도출되는 흐름을 설명하기 위한 도면, 도 6은 본 발명의 일 실시예의 구현에 따라서 수요 지수가 도출되는 흐름을 설명하기 위한 도면, 도 7은 본 발명의 일 실시예의 구현에 따라서 공급자 와 수요자를 매칭하는 예를 설명하기 위한 도면, 도 8 및 9는 본 발명의 일 실시예의 구현에 따라서 공급자 또 는 수요자 단말에 출력되는 화면의 예이다. 이하의 설명에 있어서 공지의 기술에 해당하는 내용은 도면의 도시 및 이하의 설명에서 생략될 수 있다. 또한 이하의 설명에 있어서 본 발명의 각 실시예 및 각 구성 요소 및 기술 적 특징에 대한 설명을 위하여 다수의 도면이 함께 참조되어 설명될 수 있다. 본 발명의 일 실시예에 따른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 방법은, 후술하는 도 10에 대한 설명에서 언급될 컴퓨팅 장치에서 자동으로 수행되는 것을 특징으 로 한다. 상기의 컴퓨팅 장치는 도 10에 도시된 바와 같은 구조를 갖는 서버 시스템 또는 서버 단말로도 이해될 수 있다. 이때 하나 이상의 컴퓨팅 장치가 기능에 따라서 구분되어 글로벌 스마트 제조 시스템 구축을 위한 데 이터 표준화 및 이를 이용한 공급자와 수요자 매칭 방법을 수행할 수 있다. 또한, 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 방법은, 후술하는 도 4에 도시된 본 발명의 일 실시예에 따른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 장치에 포함된 각 구성 요소들에 의하여 실시되는 것으로도 이해될 수 있다. 즉, 본 발명의 일 실시예에 따 른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 장치는 후 술하는 도 10의 컴퓨팅 장치와 동일하거나, 하나의 컴퓨팅 장치에 포함되거나 다수의 컴퓨팅 장치를 포함하는 구성으로서 이해될 수 있다. 상기의 내용을 기반으로, 본 발명의 일 실시예에 따른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 방법(이하 '본 발명의 방법'이라 함)에 있어서 컴퓨팅 장치는, 먼저 수요 자가 구매 가능한 제품을 공급하는 제품공급기업인 공급자에 관한 정보로서, 적어도 공급 제품에 대한 원가에 관련된 표준 지표 데이터인 원가 지표 데이터, 제품 가격에 영향을 미치는 노동자 임금에 관련된 표준 지표 데 이터인 임금 지표 데이터, 실제 제품 원가 데이터 및 실제 임금 데이터를 포함하는 제1 입력 데이터를 수신 시, 기설정된 공급 데이터 표준화 알고리즘에 적용하여 제품의 공급에 관련된 표준화 지수인 공급 지수를 도출하는 공급 지수 도출 단계(S10)를 수행한다. 본 발명에서 제품은, 글로벌 스마트 제조 시스템으로서, 글로벌하게 분포되어 있는 공급자로부터 생산되어 수요 자에게 제공될 수 있는 모든 물품을 포함하는 것으로 이해될 수 있다. 공급자는 상술한 바와 같이 해당 제품을 공급하는 제품공급기업을 의미한다. 원가 지표 데이터는, 계약의 목적이 되는 물품에 포함된 재료 등에 대한 원가 등을 이용하여 원가를 산출할 수 있도록 하는 표준 지표를 의미한다. 해당 표준 지표는 다양한 법률에 의하여 정의될 수 있으며, 해당 법률은 국 제법 또는 각 국가의 법, 시행령, 시행규칙 등에 의하여 정의될 수 있다. 원가 지표 데이터는 재료의 이름 및 원가에 대한 데이터를 포함할 수 있다. 임금 지표 데이터 역시, 계약의 목적이 되는 물품의 가격 산정을 위하여 포함되는 노무비, 경비 등에 대한 데이 터를 의미하며, 원가 지표 데이터와 함께 다양한 국제법 또는 각 국가의 법령에 의하여 정의될 수 있다. 원가 지표 데이터 및 임금 지표 데이터와, 일반관리비 및 이윤을 계산 시 표준화된 제품의 예정 가격을 결정할 수 있 게 된다. 실제 제품의 원가 데이터 및 실제 임금 데이터는, 공급자로부터 입력된 물품의 원가 및 노동자에게 제공되는 임 금 데이터로서, 이는 공급자 계정에서 직접 입력하거나, 각 국가의 행정기관(정부)으로부터 설정되거나 저장되 는 공급자 계정에 대한 정보 DB로부터 수신될 수 있다. S10 단계는 상술한 바와 같이 상기의 데이터를 포함하는 제1 입력 데이터를 공급자 계정(공급자 단말) 또는 행 정기관 서버 등으로부터 수신 시, 공급 데이터 표준화 알고리즘에 이를 적용하여 제품의 공급에 관련된 표준화 지수인 공급 지수를 도출하게 된다. 즉 도 5에 도시된 바와 같이 상술한 제1 입력 데이터로서, 원가 지표 데이터(생산 지표), 임금 지표 데이터, 생 산 원가(실제 제품의 원가 데이터) 및 임금 원가(실제 임금 데이터)가 제1 입력 데이터로서 입력된다. 이때, 도 5에 도시된 바와 같이 본 발명에서는, S10 단계의 수행 시, 공급자에 관련된 정보로서, 공급자의 위치, 공급자 가 위치한 지역의 환율, 공급자가 위치한 지역의 기후 및 공급자가 위치한 지역의 노동 품질에 대한 정보를 포 함하는 공급자 속성 정보를 상기 제1 입력 데이터에 적용하여 공급 지수를 도출할 수 있다. 이는 제1 입력 데이터에 대해서, 공급자의 속성 정보가 실제 제품의 원가, 품질, 물류 비용 등에 영향을 미침으 로써 수요자에게 제품이 전달되는 경우에 있어서의 수요자의 물품에 대한 만족도 등에 영향을 미치기 때문이다. 이와 같이 공급 데이터 표준화 알고리즘에 의하여 도출되는 공급 지수는, 실제 제1 입력 데이터가 국가 및 공급 자의 환경을 고려하지 못한 데이터임을 고려하여, 공급자 속성 정보를 적용함으로써 국가 및 공급자를 종합적으 로 고려하여 통합된 시스템 상에서 표준화된 공급자 및 제품에 대한 데이터를 도출하기 위한 알고리즘이다. 한편 도출되는 공급 지수는 도 5에 도시된 바와 같이 공급자에 의하여 공급되는 제품에 대해서 도출되는 표준화 된 지수로서, 하나의 지수로 표현되는 것이 아닌, 복수의 카테고리에 대해서 각각 수치 또는 텍스트화된 정보로 도출될 수 있다. 도 5에 도시된 바에서는, 금액 지수, 위치 지수, 품질 지수 및 제품의 카테고리에 대한 정보가 공급 지수에 포함될 수 있다. 금액 지수는 제품의 카테고리 또는 세부 제품별로 도출되는 지수로서, 해당 제품과 동일하거나 유사한 제품과 비교하여 판매 가격이 어떤 위치에 있는지 여부를 파악할 수 있는 지수를 의미한다. 위치 지수는, 해당 제품과 동일하거나 유사한 제품과 비교하여, 유통의 난이도 또는 유통 비용 등이 어떤 위치에 있는지 여부를 파악할 수 있는 지수를 의미한다. 품질 지수는 해당 제품과 동일하거나 유사한 제품과 비교하여, 노동 품질, 재료비, 온라 인 상의 공급자에 대한 평가, 제품에 대한 평가 등을 고려하여, 해당 제품의 품질이 어떤 위치에 잇는지 여부를 파악할 수 있는 지수를 의미한다. 제품의 카테고리에 대한 지수는, 점수가 아닌 정보로서, 공급자가 제공하는 제품의 유사군 코드 등을 의미할 수 있다. 이와 같이 공급 지수가 도출되면, 수요자와의 매칭 시, 수요자가 주로 구매하거나 관심이 있는 것으로 설정된 제품에 대한 정보와 공급 지수를 비교하여, 수요자가 구매할 확률이 높은 제품 또는 제품의 공급자를 매칭할 수 있는 것이다. 이러한 공급 데이터 표준화 알고리즘은, 예를 들어 상술한 제1 입력 데이터를 입력 값으로 하고, 공급 지수를 출력 값으로 하는 알고리즘을 의미함이 바람직하다. 이때, 공급자 속성 정보는 입력값 또는 해당 입력값으로부 터 공급 지수를 도출 시 중간값 및 가중치로서의 웨이트(Weight) 값으로 적용하되, 해당 웨이트는, 공급 데이터 표준화 알고리즘에 대한 각 샘플 데이터를 통한 머신 러닝에 의하여 학습되면서 변동될 수 있다. 공급 데이터 표준화 알고리즘에 대한 머신 러닝을 위하여 입력되는 데이터인 샘플 데이터는, 특정 쇼핑몰 등에 서 판매된 이력이 있는 제품에 대한 제1 입력 데이터 및 공급자 속성 정보와, 수요자에 대해서 도출될 후술하는 수요 지수에 대해 높은 매칭 관계를 설정하고, 판매되지 않은 상태에서 해당 제품을 조회하지 않거나 조회하더 라도 구매하지 않은 수요자의 수요 지수에 대해 낮은 매칭 관계를 설정한 뒤 해당 결과를 피드백 적용하여 머신 러닝에 사용하는 데이터를 의미한다. S10 단계가 수행되면, 컴퓨팅 장치는 수요자의 제품 구매에 관한 데이터로서, 적어도 수요자의 개인 정보 및 수 요자의 구매 여력에 관한 데이터인 제2 입력 데이터를 수신 시, 기설정된 수요 데이터 표준화 알고리즘에 적용 하여 제품의 구매에 관련된 표준화 지수인 수요 지수를 도출하는 수요 지수 도출 단계(S20)를 수행한다. 제2 입력 데이터는, 현재 수요자의 건강 상태, 환경 상태, 구매 이력 및 선호도 정보를 이용하여, 특정 제품을 구매할 수 있는지 여부를 파악할 수 있는 근거가 되는 모든 수요자에 대한 정보를 의미한다. 예를 들어 도 6에 도시된 바와 같이, 수요자의 개인 정보에는, 수요자 단말로서 스마트폰 또는 스마트 기기 등에 탑재된 센서 등으로부터 주기적(예를 들어 1일)으로 측정되는 생체 신호 데이터가 포함될 수 있다. 또한 수요자가 단말을 통하여 계정을 생성하거나 관리 시 입력 및 수정할 수 있는 설문 데이터로서, 제품의 구매 또는 자신의 상태에 대한 설문에 대한 응답 데이터 역시 개인 정보에 포함될 수 있다. 한편, 각 국가의 법 령에 따라서 의료 기관 단말로부터 수집될 가능성이 있는 데이터로서, EMR(Electric Medical Record) 등의 의료 데이터나 기타 수집 가능한 개인 건강 데이터 등이 개인 정보에 포함될 수 있다. 한편, 이외에. 구매 선호에 대한 정보로서, 수요자 단말로부터 수집될 수 있는 구매 이력 데이터 또는 수요 자가 직접 설정한 가격대 등에 대한 정보인 구매 여력에 대한 데이터가 포함될 수 있다. 구매 여력에 대한 데이 터에는, 상기의 수요자가 직접 입력한 데이터인 제품 가격대에 대한 정보 이외에, 수요자가 보유한 자산에 대한 정보인 금융 정보 데이터가 구매 여력을 판단할 수 있는 데이터로서 제2 입력 데이터로 수신할 수 있다. 수요 데이터 표준화 알고리즘은, 상술한 공급 데이터 표준화 알고리즘과 유사하게, 제2 입력 데이터를 입력값으 로 갖고, 수요 지수를 출력값으로 갖도록 하여, 제2 입력 데이터에 따라서 수요자의 선호도를 파악하는 수요 지 수를 출력하도록 하며, 상술한 샘플 데이터에 의하여 기 생성된 수요자와 제품(공급자) 간의 매칭 정보를 기준 으로 하여 수요 지수에 대한 알고리즘은 상술한 수요 데이터 표준화 알고리즘을 머신 러닝 학습하게 된다. 이때 매칭 정보를 도출하기 위하여, 예를 들어 수요 지수 역시 공급 지수와 마찬가지로, 구매 금액, 위치, 제품 카테고리 및 품질을 나타내는 다수의 카테고리별로 도출될 수 있다. 이에 따르면, 공급 지수와 수요 지수를 비교하여 각 카테고리별 유사도가 기설정된 임계값(예를 들어 90%) 이상 인 공급자와 수요자 또는 제품과 수요자를 매칭할 수 있는 것이다. 이러한 정보를 기준으로 S20 단계가 수행된 후 컴퓨팅 장치는, 도출된 공급 지수와 수요 지수의 상관관계를 분 석하여, 공급자와 수요자 간의 매칭 정보를 도출하는 매칭 정보 도출 단계(S30)를 수행한다. 공급 지수 및 수요 지수는 상술한 바와 같이 글로벌하게 분포된 공급자와 수요자 또는 공급자가 제조하여 제공 하는 제품과 수요자에 대해서 도출되는 표준화된 지수를 의미한다. 이를 기준으로 공급자(제품)과 수요자를 서로 매칭하여 줌으로써, 공급자 측면에서는 매우 높은 정확도로 타겟 팅된 마케팅이 가능하고, 수요자 측면에서는 개인의 니즈를 반영한 최적의 제품을 제공받을 수 있도록 하는 것 이다. 예를 들어 상술한 바와 같이 공급 지수와 수요 지수가 동일한 카테고리의 정보로서 도출되는 경우, 공급 지수와 수요 지수를 비교하여 각 카테고리별 유사도가 기설정된 임계값(예를 들어 90%) 이상인 공급자와 수요자 또는 제품과 수요자를 매칭할 수 있다. 예를 들어 도 7에 도시된 바와 같이, 공급 지수(D1)와 수요 지수(D2)를 비교 시 동일 카테고리로 도출되는 경우 상관관계 분석에 있어서 상관성은 각 카테고리별 지수가 유사할수록 높기 때문이다. 한편, 상술한 예와 달리, 공급 지수와 수요 지수 간의 카테고리가 서로 다르게 도출될 수 있다. 예를 들어 수요 자의 개인 건강 상태에 대한 정보는 공급 지수에 포함될 수 없는 카테고리일 수 있는 것이다. 이러한 경우 컴퓨팅 장치는 S30 단계의 수행에 있어서 비정형 데이터 간의 선형 상관관계를 도출할 수 있는 다 양한 알고리즘을 적용하여, 각 데이터 간의 상관관계를 분석하여 이를 이용하여 매칭을 수행할 수 있다. 즉, S30 단계의 수행에 있어서 기본적으로 컴퓨팅 장치는 공급 지수와 수요 지수 간의 선형 상관관계 분석 알고리즘 을 이용하여, 공급 지수와 수요 지수 사이의 상관관계를 도출하게 된다. 이후 예를 들어 도 2에 도시된 바와 같이 S30 단계의 수행에 있어서 컴퓨팅 장치는 일 공급자와 상관관계가 높 은 수요자를 매칭 정보로 도출하여 공급자에게 제공하는 단계(S31)를 수행하여, 공급자 측면에서 매우 높은 정 확도로 타겟팅된 마케팅을 글로벌 수요자에게 수행할 수 있도록 할 수 있다. 즉 예를 들어 도 4 및 도 8에 도시된 바와 같이 공급자 단말에는, 일 공급자(P1)에 대해서 공급자(P1)가 제 공하는 제품(I1)에 대한 수요자 데이터(U1)를 확인할 수 있는 컨텐츠가 제공될 수 있다. 한편 다른 예에 있어서는 도 3에 도시된 바와 같이 S30 단계의 수행에 있어서 컴퓨팅 장치는, 일 수요자와 상관 관계가 높은 공급자를 매칭 정보로 도출하고, 도출된 매칭 정보와 매칭 정보에 속한 공급자가 판매하는 제품에관한 정보를 수요자에게 제공하는 단계(S32)를 수행하여, 수요자 측면에서 수요자의 니즈를 충족시킬 수 있는 글로벌 공급자의 정보 및 제품 정보를 제공받아 원하는 물품을 구매할 수 있도록 할 수 있다. 즉 예를 들어 도 4 및 도 9에 도시된 바와 같이 수요자 단말에는, 일 수요자(U1)에 대해서 매칭된 공급자 데이터(P1)를 확인할 수 있는 컨텐츠가 제공될 수 있다. S30 단계에서 수행되는 상관관계 도출에 사용되는 알고리즘은, 서로 다른 데이터들 사이의 상관관계를 파악하기 위한 알고리즘으로서, 선형 또는 비선형의 각 데이터들 사이의 상관관계를 도출하기 위한 알고리즘을 의미한다. 예를 들어, 피어슨 상관계수(PCC, Pearson Correlation Coefficient) 분석 기법 및 주성분 분석(PCA, Principal Component Analysis) 기법 중 어느 하나를 이용하여, 세부 정보간의 상관관계를 파악할 수 있다. 피어슨 상관계수 분석 기법은, 두 변수 X 와 Y 간의 선형 상관 관계를 계량화한 수치다. 피어슨 상관 계수는 코 시-슈바르츠 부등식에 의해 +1과 -1 사이의 값을 가지며, +1은 완벽한 양의 선형 상관 관계, 0은 선형 상관 관 계없음, -1은 완벽한 음의 선형 상관 관계를 의미한다. 일반적으로 상관관계는 피어슨 상관관계를 의미하는 상 관계수이다."}
{"patent_id": "10-2022-0024469", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "표본(sample) 피어슨 상관 계수는 등간척도(간격척도)나 비례척도(비율척도)의 데이타에서 두 변수의 공분산 (covariance)을 각각의 표준 편차의 곱으로 나눈 값이다. 주성분 분석 기법은, 고차원의 데이터를 저차원의 데이터로 환원시키는 기법을 말한다. 이 때 서로 연관 가능성 이 있는 고차원 공간의 표본들을 선형 연관성이 없는 저차원 공간(주성분)의 표본으로 변환하기 위해 직교 변환 을 사용한다. 데이터를 한개의 축으로 사상시켰을 때 그 분산이 가장 커지는 축을 첫 번째 주성분, 두 번째로 커지는 축을 두 번째 주성분으로 놓이도록 새로운 좌표계로 데이터를 선형 변환한다. 이와 같이 표본의 차이를 가장 잘 나타내는 성분들로 분해함으로써 데이터 분석에 여러가지 이점을 제공한다. 이 변환은 첫째 주성분이 가장 큰 분산을 가지고, 이후의 주성분들은 이전의 주성분들과 직교한다는 제약 아래에 가장 큰 분산을 갖고 있 다는 식으로 정의되어있다. 중요한 성분들은 공분산 행렬의 고유 벡터이기 때문에 직교하게 된다. 주성분 분석은 신호처리 분야에서는 이산 카루넨-뢰브 변환, 다변량 품질 관리에서는 호텔링 변환, 기계공학에 서는 적합 직교 분해(POD), 선형대수학에서는 특잇값 분해[1] 또는 고윳값 분해, 인자 분석[2]:Chapter 7, 심리 측정학의 Eckart-Young 이론 (Harman, 1960) 또는 Schmidt-Mirsky 이론, 기상 과학의 실증 직교 함수(EOF), 소 음과 진동의 실증적 고유 함수 분해(Sirovich, 1987)와 실증적 요소 분석(Lorenz, 1956), 준조화모드(Brooks et al., 1988), 스펙트럼 분해, 구조 동역학의 실증적 모델 분석 등으로 응용된다. 주성분 분석은 실제 고유 벡터 기반의 다변량 분석들 중 가장 간단한 방식이다. 만약 다변량 데이터 집합이 변 수당 1개의 축이 있는 높은 차원의에서 보았을 때 단순히 좌표의 집합으로 보인다면, 주성분 분석은 이를 낮은 차원으로 끌어내려 일종의 그림자를 보고 분석할 수 있게 도와준다. 이는 가장 주요한 일부 요소들을 보여줌으 로써 변환된 데이터의 차원수를 줄임으로써 끝난다. 주성분 분석은 인자 분석과 밀접한 관계를 갖고 있다. 인자 분석은 일반적으로 기저 구조에 대한 영역 한정적인 가정을 포함하고, 약간의 차이가 있는 행렬의 고유 벡터를 풀어낸다. 또한 주성분 분석은 정준상관분석(CCA)과도 관계가 있다. 주성분 분석이 하나의 데이터 집합의 변화를 제일 잘 설명하는 새로운 직교 좌표 시스템을 정의하는 반면 정준상관분석은 두 개의 데이터 집합간의 교차 공분산을 가 장 잘 설명하는 좌표 시스템을 정의한다. 주성분 분석은 가장 큰 분산을 갖는 부분공간을 보존하는 최적의 선형 변환이라는 특징을 갖는다. 그러나 이산 코사인 변환과 같은 다른 방법에 비해 더 많은 계산시간을 요구하는 단점이 있다. 다른 선형 변환과 달리 주성 분 분석은 정해진 기저 벡터를 갖지 않으며, 기저 벡터는 데이터의 특성에 따라 달라진다.한편 도 4에 도시된 바와 같이 본 발명의 일 실시예에 따른 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공급자와 수요자 매칭 장치(10, 이하 '본 발명의 장치'라 함)는, 공급 지수 도출부, 수요 지수 도출부 및 매칭 정보 도출부를 포함하는 것을 특징으로 한다. 이하의 설명에 있어서 상술한 모든 내용 과 중복되는 설명은 이를 생략하기로 한다. 공급 지수 도출부는 수요자가 구매 가능한 제품을 공급하는 제품공급기업인 공급자에 관한 정보로서, 적어 도 공급 제품에 대한 원가에 관련된 표준 지표 데이터인 원가 지표 데이터, 제품 가격에 영향을 미치는 노동자 임금에 관련된 표준 지표 데이터인 임금 지표 데이터, 실제 제품 원가 데이터 및 실제 임금 데이터를 포함하는 제1 입력 데이터를 공급자 단말 등으로부터 수신 시, 기설정된 공급 데이터 표준화 알고리즘에 적용하여 제 품의 공급에 관련된 표준화 지수인 공급 지수를 도출하는 기능을 수행한다. 이때 상술한 바와 같이 공급자 속성 정보 및 샘플 데이터 등을 함께 수신하여 처리하게 된다. 즉, 상술한 설명에 있어서 S10 단계에서 설명된 모든 기능을 수행하는 구성으로 이해될 수 있다. 수요 지수 도출부는 수요자의 제품 구매에 관한 데이터로서, 적어도 수요자의 개인 정보 및 수요자의 구매 여력에 관한 데이터인 제2 입력 데이터를 수요자 단말 등으로부터 수신 시, 기설정된 수요 데이터 표준화 알고리즘에 적용하여 제품의 구매에 관련된 표준화 지수인 수요 지수를 도출하는 기능을 수행한다. 즉 상술한 설명에 있어서 S20 단계에서 설명된 모든 기능을 수행하는 구성으로 이해될 수 있다. 매칭 정보 도출부는 도출된 공급 지수와 수요 지수의 상관관계를 분석하여, 공급자와 수요자 간의 매칭 정 보를 도출하는 기능을 수행한다. 동시에, 해당 매칭 정보를 가공하여 상술한 도 8 및 9에 도시된 컨텐츠(100, 110)를 공급자 단말 또는 수요자 단말에 전송하는 기능을 수행할 수 있다. 즉 상술한 설명에 있어서 S30, S31, S32 단계에서 설명된 모든 기능을 수행하는 구성으로 이해될 수 있다. 도 10은 본 발명의 일 실시 예에 따른 컴퓨팅 장치의 내부 구성의 일 예를 도시하였으며, 이하의 설명에 있어서, 상술한 도 1 내지 9에 대한 설명과 중복되는 불필요한 실시 예에 대한 설명은 생략하기로 한다. 도 10에 도시한 바와 같이, 컴퓨팅 장치은 적어도 하나의 프로세서(processor), 메모리 (memory), 주변장치 인터페이스(peripheral interface), 입/출력 서브시스템(I/O subsystem), 전력 회로 및 통신 회로를 적어도 포함할 수 있다. 이때, 컴퓨팅 장치 은 촉각 인터페이스 장치에 연결된 유저 단말이기(A) 혹은 전술한 컴퓨팅 장치(B)에 해당될 수 있다. 메모리는, 일례로 고속 랜덤 액세스 메모리(high-speed random access memory), 자기 디스크, 에스램 (SRAM), 디램(DRAM), 롬(ROM), 플래시 메모리 또는 비휘발성 메모리를 포함할 수 있다. 메모리는 컴퓨팅 장치의 동작에 필요한 소프트웨어 모듈, 명령어 집합 또는 그밖에 다양한 데이터를 포함할 수 있다. 이때, 프로세서나 주변장치 인터페이스 등의 다른 컴포넌트에서 메모리에 액세스하는 것 은 프로세서에 의해 제어될 수 있다. 주변장치 인터페이스는 컴퓨팅 장치의 입력 및/또는 출력 주변장치를 프로세서 및 메모리 에 결합시킬 수 있다. 프로세서는 메모리에 저장된 소프트웨어 모듈 또는 명령어 집합을 실행하여 컴퓨팅 장치을 위한 다양한 기능을 수행하고 데이터를 처리할 수 있다. 입/출력 서브시스템은 다양한 입/출력 주변장치들을 주변장치 인터페이스에 결합시킬 수 있다. 예를 들어, 입/출력 서브시스템은 모니터나 키보드, 마우스, 프린터 또는 필요에 따라 터치스크린이나 센서 등의 주변장치를 주변장치 인터페이스에 결합시키기 위한 컨트롤러를 포함할 수 있다. 다른 측면에 따르면, 입/출력 주변장치들은 입/출력 서브시스템을 거치지 않고 주변장치 인터페이스에 결합될 수도 있다. 전력 회로는 단말기의 컴포넌트의 전부 또는 일부로 전력을 공급할 수 있다. 예를 들어 전력 회로 는 전력 관리 시스템, 배터리나 교류(AC) 등과 같은 하나 이상의 전원, 충전 시스템, 전력 실패 감지 회 로(power failure detection circuit), 전력 변환기나 인버터, 전력 상태 표시자 또는 전력 생성, 관리, 분배 를 위한 임의의 다른 컴포넌트들을 포함할 수 있다. 통신 회로는 적어도 하나의 외부 포트를 이용하여 다른 컴퓨팅 장치와 통신을 가능하게 할 수 있다. 또는 상술한 바와 같이 필요에 따라 통신 회로는 RF 회로를 포함하여 전자기 신호(electromagnetic signal)라고도 알려진 RF 신호를 송수신함으로써, 다른 컴퓨팅 장치와 통신을 가능하게 할 수도 있다.이러한 도 10의 실시 예는, 컴퓨팅 장치의 일례일 뿐이고, 컴퓨팅 장치은 도 10에 도시된 일부 컴포넌트가 생략되거나, 도 10에 도시되지 않은 추가의 컴포넌트를 더 구비하거나, 2개 이상의 컴포넌트를 결합 시키는 구성 또는 배치를 가질 수 있다. 예를 들어, 모바일 환경의 통신 단말을 위한 컴퓨팅 장치는 도 10에도 시된 컴포넌트들 외에도, 터치스크린이나 센서 등을 더 포함할 수도 있으며, 통신 회로에 다양한 통신방 식(WiFi, 3G, LTE, Bluetooth, NFC, Zigbee 등)의 RF 통신을 위한 회로가 포함될 수도 있다. 컴퓨팅 장치 에 포함 가능한 컴포넌트들은 하나 이상의 신호 처리 또는 어플리케이션에 특화된 집적 회로를 포함하는 하드웨어, 소프트웨어, 또는 하드웨어 및 소프트웨어 양자의 조합으로 구현될 수 있다. 본 발명의 실시 예에 따른 방법들은 다양한 컴퓨팅 장치를 통하여 수행될 수 있는 프로그램 명령(instruction) 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 특히, 본 실시 예에 따른 프로그램은 PC 기반의 프 로그램 또는 모바일 단말 전용의 어플리케이션으로 구성될 수 있다. 본 발명이 적용되는 애플리케이션은 파일 배포 시스템이 제공하는 파일을 통해 이용자 단말에 설치될 수 있다. 일 예로, 파일 배포 시스템은 이용자 단말 이기의 요청에 따라 상기 파일을 전송하는 파일 전송부(미도시)를 포함할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어구 성요소의 조합으로 구현될 수 있다. 예를 들어, 실시 예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로세 서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨 터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경 우도 있지만, 해당 기술 분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상장 치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨팅 장치상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시 예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시 예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광 기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다. 이상과 같이 실시 예들이 비록 한정된 실시 예와 도면에 의해 설명되었으나, 해당 기술 분야에서 통상의 지식을 가진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형 태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성 될 수 있다. 그러므로, 다른 구현들, 다른 실시 예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위 의 범위에 속한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2022-0024469", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 내지 3은 본 발명의 일 실시예에 따른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이 용한 공급자와 수요자 매칭 방법의 플로우차트. 도 4는 본 발명의 일 실시예에 따른 글로벌 스마트 제조 시스템 구축을 위한 데이터 표준화 및 이를 이용한 공 급자와 수요자 매칭 장치의 구성 블록도. 도 5는 본 발명의 일 실시예의 구현에 따라서 공급 지수가 도출되는 흐름을 설명하기 위한 도면. 도 6은 본 발명의 일 실시예의 구현에 따라서 수요 지수가 도출되는 흐름을 설명하기 위한 도면. 도 7은 본 발명의 일 실시예의 구현에 따라서 공급자와 수요자를 매칭하는 예를 설명하기 위한 도면. 도 8 및 9는 본 발명의 일 실시예의 구현에 따라서 공급자 또는 수요자 단말에 출력되는 화면의 예. 도 10은 본 발명의 일 실시 예에 따른 컴퓨팅 장치의 내부 구성의 일 예."}
