{"patent_id": "10-2022-0060112", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0160532", "출원번호": "10-2022-0060112", "발명의 명칭": "나노입자량 산출방법 및 산출장치", "출원인": "한국전자기술연구원", "발명자": "서용곤"}}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "휘발성유기화합물 및 나노입자가 발생되는 공정에서 총휘발성유기화합물학습데이터 및 나노입자량학습데이터를포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키는 단계; 및학습된 나노입자량 산출 모델에 총휘발성유기화합물데이터를 입력하여, 발생된 나노입자량을 추론하는 단계;를포함하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,총휘발성유기화합물학습데이터는 총휘발성유기화합물 센서로부터 획득한 데이터인 것을 특징으로 하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,나노입자량학습데이터는 나노입자 분석장치로부터 획득한 데이터인 것을 특징으로 하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,학습데이터는 개별 휘발성유기화합물학습데이터를 더 포함하는 것을 특징으로 하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,휘발성유기화합물은 벤젠, 톨루엔, 크실렌, 메틸 에틸 케톤, 아세톤, 이소프로필 알코올 및 글리콜 에테르 중어느 하나인 것을 특징으로 하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,학습데이터는 온도에 관한 학습데이터인 온도학습데이터를 더 포함하는 것을 특징으로 하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,학습데이터는 습도에 관한 학습데이터인 습도학습데이터를 더 포함하는 것을 특징으로 하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,학습데이터는 미세입자량에 관한 학습데이터인 미세입자학습데이터를 더 포함하는 것을 특징으로 하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2023-0160532-3-청구항 1에 있어서,휘발성유기화합물 및 나노입자가 발생되는 공정은 FDM 방식 3D프린팅공정인 것을 특징으로 하는 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "휘발성유기화합물 및 나노입자가 발생되는 공정에서 총휘발성유기화합물학습데이터 및 나노입자량학습데이터를포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키는 학습부; 및학습된 나노입자량 산출 모델에 총휘발성유기화합물데이터를 입력하여, 발생된 나노입자량을 추론하는 산출부;를 포함하는 나노입자량 산출장치."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "FDM 방식 3D프린팅공정에서, 공정조건에 따른 플라스틱 필라멘트로부터 발생한 휘발성유기화합물 및 나노입자량을 기초로 총휘발성유기화합물학습데이터 및 나노입자량학습데이터를 포함하는 학습데이터를 수집하여, 발생된나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키는 단계; 및학습된 나노입자량 산출 모델에 총휘발성유기화합물데이터를 입력하여, 3D프린팅공정에서 발생된 나노입자량을추론하는 단계;를 포함하는 FDM 방식 3D프린팅공정에서의 나노입자량 산출방법."}
{"patent_id": "10-2022-0060112", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "플라스틱 필라멘트를 가열하여 적층하고 경화시켜 3D출력물을 제조하는 3D프린팅유닛; 및 가열된 플라스틱 필라멘트로부터 발생한 휘발성유기화합물 및 나노입자를 분석하여 총휘발성유기화합물학습데이터 및 나노입자량학습데이터를 포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키고, 학습된 나노입자량 산출 모델에 총휘발성유기화합물 데이터를입력하여, 발생된 나노입자량을 추론하는 나노입자량 산출유닛;을 포함하는 공정모니터링이 가능한 3D프린팅 시스템."}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "나노입자가 발생되는 공정 진행 중에 유해한 나노입자의 양을 저비용으로 보다 정확히 산출하여 사용자의 건강과 안전을 고려한 작업환경개선이 가능한 나노입자량 산출방법 및 산출장치가 제안된다. 본 발명에 따른 나노입자량 산출방법은 휘발성유기화합물 및 나노입자가 발생되는 공정에서 총휘발성유기화합물학습데이터 및 나노입자량학 습데이터를 포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키는 단계; 및 학습된 나노입자량 산출 모델에 총휘발성유기화합물데이터를 입력하여, 발생된 나노 입자량을 추론하는 단계;를 포함한다."}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 나노입자량 산출방법 및 산출장치에 관한 것으로, 상세하게는 나노입자가 발생되는 공정 진행 중에 유해한 나노입자의 양을 저비용으로 보다 정확히 산출하여 사용자의 건강과 안전을 고려한 작업환경개선이 가능 한 나노입자량 산출방법 및 산출장치에 관한 것이다."}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "산업, 생활 또는 의학 등 매우 다양한 분야에서 활용되고 있는 3D 프린터의 기본적인 원리는 얇은 2D 레이어를 쌓아서 3D 물체를 만드는 것이다. 3D 프린터는 플라스틱, 광경화 수지 또는 금속을 이용하여 3D출력물을 형성할 수 있는데, 공정 중에는 다양한 성분의 입자들이 발생하여 사용자의 건강에 불리한 영향을 미칠 수 있다. 예를 들어, 3D 프린터 작업환경에 있어 FDM(Fused deposition modeling) 장비를 사용하는 경우, 열을 가해 프 린팅하는 공정 특성상 휘발성유기화합물 및 미세 나노입자들이 발생할 수 있다. 이러한 휘발성유기화합물이나 미세한 나노입자는 작업자의 인체에 불리한 영향을 미치는데, 나노입자의 크기로 인하여 센싱이 어려운 문제점 이 있다. 휘발성 유기화합물의 경우 총휘발성유기화합물(TVOC: Total Volatile Organic Compounds) 센서가 상용화되어 발생량의 측정이 가능하나, 미세한 나노입자의 경우 나노입자량을 측정하기 위해서는 매우 고가의 분석장치로 분석이 가능하다는 문제가 있고, 미세나노입자 센서의 경우 아직 실험실 단계에 머물러 있을 뿐이고 상용화 되 지 않아 해당 기술의 개발이 요청된다."}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로서, 본 발명의 목적은, 나노입자가 발생되는 공 정 진행 중에 유해한 나노입자의 양을 저비용으로 정확히 산출하여 사용자의 건강과 안전을 고려한 작업환경개 선이 가능한 나노입자량 산출방법 및 산출장치를 제공함에 있다."}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 나노입자량 산출방법은 휘발성유기화합물 및 나노입자 가 발생되는 공정에서 총휘발성유기화합물학습데이터 및 나노입자량학습데이터를 포함하는 학습데이터를 수집하 여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키는 단계; 및 학습된 나노 입자량 산출 모델에 총휘발성유기화합물데이터를 입력하여, 발생된 나노입자량을 추론하는 단계;를 포함한다. 총휘발성유기화합물학습데이터는 총휘발성유기화합물 센서로부터 획득한 데이터일 수 있다. 나노입자량학습데이터는 나노입자 분석장치로부터 획득한 데이터일 수 있다. 학습데이터는 개별 휘발성유기화합물학습데이터를 더 포함할 수 있다. 휘발성유기화합물은 벤젠, 톨루엔, 크실렌, 메틸 에틸 케톤, 아세톤, 이소프로필 알코올 및 글리콜 에테르 중 어느 하나일 수 있다. 학습데이터는 온도에 관한 학습데이터인 온도학습데이터를 더 포함할 수 있다. 학습데이터는 습도에 관한 학습데이터인 습도학습데이터를 더 포함할 수 있다. 학습데이터는 미세입자량에 관한 학습데이터인 미세입자학습데이터를 더 포함할 수 있다. 휘발성유기합물 및 나노입자가 발생되는 공정은 FDM 방식 3D프린팅공정일 수 있다. 본 발명의 다른 측면에 따르면, 휘발성유기화합물 및 나노입자가 발생되는 공정에서 총휘발성유기화합물학습데 이터 및 나노입자량학습데이터를 포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모 델인 나노입자량 산출 모델을 학습시키는 학습부; 및 학습된 나노입자량 산출 모델에 총휘발성유기화합물 데이 터를 입력하여, 발생된 나노입자량을 추론하는 산출부;를 포함하는 나노입자량 산출장치가 제공된다. 본 발명의 또다른 측면에 따르면, FDM 방식 3D프린팅공정에서, 공정조건에 따른 플라스틱 필라멘트로부터 발생 한 휘발성유기화합물 및 나노입자량을 기초로 총휘발성유기화합물학습데이터 및 나노입자량학습데이터를 포함하 는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키는 단계; 및 학습된 나노입자량 산출 모델에 총휘발성유기화합물데이터를 입력하여, 3D프린팅공정에서 발생된 나노 입자량을 추론하는 단계;를 포함하는 FDM 방식 3D프린팅공정에서의 나노입자량 산출방법이 제공된다. 본 발명의 또다른 측면에 따르면, 플라스틱 필라멘트를 가열하여 적층하고 경화시켜 3D출력물을 제조하는 3D프 린팅유닛; 및 가열된 플라스틱 필라멘트로부터 발생한 휘발성유기화합물 및 나노입자를 분석하여 총휘발성유기 화합물학습데이터 및 나노입자량학습데이터를 포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키고, 학습된 나노입자량 산출 모델에 총휘발성유기화합물 데이 터를 입력하여, 발생된 나노입자량을 추론하는 나노입자량 산출유닛;을 포함하는 공정모니터링이 가능한 3D프린 팅 시스템이 제공된다."}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 휘발성유기화합물 및 나노입자 등과 같이 인체에 불리한 영향을 미치는 입자가 발생하는 공 정 수행시 인공지능 알고리즘을 이용하여 나노입자량 산출 모델을 학습시켜, 저비용으로 다양한 작업환경에서 공정 중에 발생하는 나노입자량의 추론이 가능하므로 보다 안전한 작업환경에서 공정을 수행할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시형태를 설명한다. 그러나, 본 발명의 실시형태는 여러가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 이하 설명하는 실시형태로 한정되는 것은 아니다. 본 발명의 실시 형태는 당업계에서 통상의 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위해서 제공되는 것이다. 첨 부된 도면에서 특정 패턴을 갖도록 도시되거나 소정두께를 갖는 구성요소가 있을 수 있으나, 이는 설명 또는 구 별의 편의를 위한 것이므로 특정패턴 및 소정두께를 갖는다고 하여도 본 발명이 도시된 구성요소에 대한 특징만 으로 한정되는 것은 아니다. 도 1은 본 발명의 일실시예에 따른 나노입자량 산출장치의 블럭도이다. 본 실시예에 따른 나노입자량 산출장치 는 휘발성유기화합물 및 나노입자가 발생되는 공정에서 총휘발성유기화합물학습데이터 및 나노입자량학습 데이터를 포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모 델을 학습시키는 학습부; 및 학습된 나노입자량 산출 모델에 총휘발성유기화합물 데이터를 입력하여, 발생 된 나노입자량을 추론하는 산출부;를 포함한다. 학습부는 휘발성유기화합물 및 나노입자가 발생되는 공정에서 총휘발성유기화합물학습데이터 및 나노입자 량학습데이터를 포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시킨다. 학습DB는 나노입자량 산출 모델을 학습시키기 위한 데이터를 저장하는 데이터베 이스로서, 예를 들어 총휘발성유기화합물학습데이터나 나노입자량학습데이터를 저장한다. 휘발성유기화합물 및 나노입자가 발생되는 공정에서 휘발성유기화합물은 총휘발성유기화합물을 센싱하는 TVOC(Total Volatile Organic Compounds)센서를 이용하여 측정이 가능하고 나노입자의 양은 센서가 아닌 분석 장치를 통해 정량적으로 분석할 수 있다. 총휘발성유기화합물학습데이터는 총휘발성유기화합물 센서로부터 획득 하고, 나노입자의 양은 나노입자 분석장치를 통해 분석되어 나노입자량 산출 모델을 학습시키는 나노입자량학습 데이터로 획득된다. 산출부에는 학습부에서 학습된 나노입자량 산출 모델에 측정하고자 하는 휘발성유기화합물 및 나노입 자가 발생되는 공정의 TVOC센서부에서 감지된 총휘발성유기화합물데이터가 입력된다. 산출부는 나노 입자량 산출 모델을 이용하여 총휘발성유기화합물데이터로부터 휘발성유기화합물 및 나노입자가 발생되는 공정 에서 발생된 나노입자량을 추론한다. 도 2는 본 발명의 다른 실시예에 따른 나노입자량 산출방법의 설명에 제공되는 흐름도이다. 본 실시예에 따른 나노입자량 산출장치를 이용한 나노입자량 산출방법은 다음과 같다. 먼저, 휘발성유기화합물 및 나노입자가 발생되는 공정에서 총휘발성유기화합물학습데이터 및 나노입자량학습데 이터를 포함하는 학습데이터를 수집한다(S210). 수집된 학습데이터로, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시킨다(S220). 나노입자량 산출 모델은 인공지능 알고리즘이 적용되고, 특 히 회귀알고리즘이 적용되어 학습될 수 있다. 나노입자량 산출 모델의 학습이 완료되면, 학습된 나노입자량 산출 모델에, 수행 중인 휘발성유기화합물 및 나 노입자가 발생되는 공정에서 획득한 총휘발성유기화합물데이터를 입력하여(S230), 공정에서 발생된 나노입자량 을 추론하여 나노입자량을 획득한다(S240). 도 3은 본 발명의 또다른 실시예에 따른 FDM 방식 3D프린팅공정에서 나노입자량 산출방법이 수행되는 모식도이 고, 도 4는 본 발명의 또다른 실시예에 따른 FDM 방식 3D프린팅공정에서 나노입자량 산출방법이 수행되는 모식 도이다. 본 발명에 따른 나노입자량 산출방법은 휘발성유기화합물 및 나노입자가 발생하는 모든 장비에 적용할 수 있는 방식이다. 특히, FDM 방식 3D프린팅공정에서는 휘발성유기합물 및 나노입자가 발생된다. 도 3을 참조하면, FDM(Fused deposition modeling)방식의 3D프린팅공정에서는 가는 실 같은 필라멘트 형태의 열가소성 플라스틱을 노즐 안에서 녹여 얇은 필름 형태로 출력하여 한층씩 적층하면서 3D출력물을 획득한다. 노즐은 고열로 플 라스틱 필라멘트를 녹이고, 뽑아져 나온 필라멘트는 상온에서 경화가 된다. 고온으로 가열해서 플라스틱필라멘트를 녹이기 때문에 이러한 공정에 의해서 휘발성유기화합물 및 나노입자가 발생하게 된다. FDM방식의 3D프린팅공정 중 발생하는 나노입자는 휘발성유기화합물 발생양과 상관 관계가 있다. 휘발성유기화합 물양이 많으면 많을수록 발생하는 나노입자의 양도 증가하게 된다. FDM방식의 3D프린팅공정에서 총휘발성유기화합물학습데이터 및 나노입자량학습데이터를 이용하여 나노입자량 산 출 모델을 학습시키는 방법은 다음과 같다. 나노입자를 측정하기 위해서 측정이 필요한 플라스틱 필라멘트를 우 선 선정한다. 이 플라스틱 필라멘트에 대해서 다양한 노즐 온도 조건에 대해 증착공정을 수행하고 이때 각각의 증착 공정 조건에 대해 총휘발성유기화합물센서를 이용하여 측정데이터를 수집하고 각각의 공정조건에서 공기를 채집하여 분석장비를 통해 나노입자의 양을 측정한다. 증착공정조건과 총휘발성유기화합물센서로부터 획득한 데 이터를 독립변수로 하고 분석장비를 이용하여 측정된 나노입자의 양을 종속변수로 한 후 인공지능의 지도학습의 알고리즘 중 하나인 회귀알고리즘을 사용하여 학습시킬 수 있다. 이후, FDM 공정에서 TVOC센서을 통해 실시간으로 측정된 총휘발성유기화합물센서데이터를 나노입자량 산출 모델에 적용하여, 공정내에서의 나노입자양이 추론된다. 학습데이터는 총휘발성유기화합물학습데이터 및 나노입자량학습데이터 이외에 개별 휘발성유기화합물학습데이터 를 더 포함할 수 있다. 개별 휘발성유기화합물학습데이터는 총휘발성유기화합물이 아닌 각각의 휘발성유기화합 물마다의 학습데이터를 의미한다. 휘발성유기화합물은 벤젠(Benzene), 톨루엔(Toluene), 크실렌(Xylene), 메틸 에틸 케톤(Methyl ethyl ketone), 아세톤(Acetone), 이소프로필 알코올(Isopropyl alcohol) 및 글리콜 에테르 (Glycol ethers) 중 어느 하나일 수 있는데, 학습DB는 총휘발성유기화합물학습데이터 이외에, 각각의 휘발 성유기화합물학습데이터를 저장할 수 있다. 추론되는 나노입자량의 정확도를 높이기 위해서 나노입자량 산출 모델의 독립변수로 총휘발성유기화합물학습데 이터와 함께 공정에서 발생할 수 있는 휘발성유기화합물 중 가장 주요한 휘발성유기화합물에 관한 개별 휘발성 유기화합물학습데이터를 추가할 수 있다. 개별 휘발성유기화합물학습데이터는 특정유해센서로부터 획득할 수 있다(도 4). 예를 들어, FDM방식의 3D프린팅공정에서 플라스틱 필라멘트로부터 휘발성유기화합물 중 톨루엔이 많이 발생하면 톨루엔센서를 이용한 톨루엔학습데이터를, 포름알데히드가 많이 발생하면 포름알데히드센서를 이용한 포름알데 히드학습데이터를 추가할 수 있다. 총휘발성유기화합물센서의 경우 온도 및 습도에 따라 측정양이 변하는 경우가 발생한다. 이러한 온도 및 습도에 대한 영향을 반영하기 위해 총휘발성유기화합물센서에 온도센서, 습도센서 또는 온습도 센서를 추가하여 나노입자측정에 적용할 수 있다. 이에 따라 학습DB는 미세입자량에 관한 학습데이터인 온도학습데이터를 더 저장할 수 있고, 습도에 관한 학습데이터인 습도학습데이터를 더 저장할 수 있다. 또한, 학습DB는 미세입자량에 관한 학습데이터인 미세입자학습데이터를 더 포함할 수 있다. 현재 나노입자 량을 측정하기 위한 센서는 상용화되어있지 않으나, 미크론 단위의 미세입자량을 측정하는 센서는 상용화되어 있다. 따라서, 미세입자센서를 이용하여 미세입자량에 관한 학습데이터인 미세입자학습데이터를 획득하여 나노입자량 산출 모델 학습에 이용하면, 입자크기가 비교적 큰 입자의 나노입자량에 대한 영향을 제거하여 보다 정확한 나노입자량 추론이 가능하다. 인공지능 알고리즘을 적용한 나노입자량 산출 모델에 있어서, 독립변수의 개수를 증가시키면 알고리즘의 정확도 를 향상시킬 수 있다. FDM공정에서 TVOC센서, 특정유해가스센서, 온습도센서 및 미세입자센서를 동시에 적용하 여 공정모니터링 하고 이러한 모니터링 데이터를 이용하여 인공지능 알고리즘에 적용시키면 정확도가 높은 나노 입자산출장치를 구현할수 있다. 본 발명의 또다른 측면에 따르면, FDM 방식 3D프린팅공정에서, 공정조건에 따른 플라스틱 필라멘트로부터 발생 한 휘발성유기화합물 및 나노입자량을 기초로 총휘발성유기화합물학습데이터 및 나노입자량학습데이터를 포함하 는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는 인공지능 모델인 나노입자량 산출 모델을 학습시키는 단계; 및 학습된 나노입자량 산출 모델에 총휘발성유기화합물데이터를 입력하여, 3D프린팅공정에서 발생된 나노 입자량을 추론하는 단계;를 포함하는 FDM 방식 3D프린팅공정에서의 나노입자량 산출방법이 제공된다. 본 발명의 또다른 측면에 따르면, 플라스틱 필라멘트를 가열하여 적층하고 경화시켜 3D출력물을 제조하는 3D프 린팅유닛; 및 가열된 플라스틱 필라멘트로부터 발생한 휘발성유기화합물 및 나노입자를 분석하여 총휘발성유기 화합물학습데이터 및 나노입자량학습데이터를 포함하는 학습데이터를 수집하여, 발생된 나노입자량을 추론하는인공지능 모델인 나노입자량 산출 모델을 학습시키고, 학습된 나노입자량 산출 모델에 총휘발성유기화합물 데이 터를 입력하여, 발생된 나노입자량을 추론하는 나노입자량 산출유닛;을 포함하는 공정모니터링이 가능한 3D프린 팅 시스템이 제공된다. 한편, 본 실시예에 따른 장치와 방법의 기능을 수행하게 하는 컴퓨터 프로그램을 수록한 컴퓨터로 읽을 수 있는 기록매체에도 본 발명의 기술적 사상이 적용될 수 있음은 물론이다. 또한, 본 발명의 다양한 실시예에 따른 기 술적 사상은 컴퓨터로 읽을 수 있는 기록매체에 기록된 컴퓨터로 읽을 수 있는 코드 형태로 구현될 수도 있다. 컴퓨터로 읽을 수 있는 기록매체는 컴퓨터에 의해 읽을 수 있고 데이터를 저장할 수 있는 어떤 데이터 저장 장 치이더라도 가능하다. 예를 들어, 컴퓨터로 읽을 수 있는 기록매체는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광디스크, 하드 디스크 드라이브, 등이 될 수 있음은 물론이다. 또한, 컴퓨터로 읽을 수 있는 기록매체 에 저장된 컴퓨터로 읽을 수 있는 코드 또는 프로그램은 컴퓨터간에 연결된 네트워크를 통해 전송될 수도 있다. 또한, 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시"}
{"patent_id": "10-2022-0060112", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2022-0060112", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 나노입자량 산출장치의 블럭도이다. 도 2는 본 발명의 다른 실시예에 따른 나노입자량 산출방법의 설명에 제공되는 흐름도이다. 도 3은 본 발명의 또다른 실시예에 따른 FDM 방식 3D프린팅공정에서 나노입자량 산출방법이 수행되는 모식도이 고, 도 4는 본 발명의 또다른 실시예에 따른 FDM 방식 3D프린팅공정에서 나노입자량 산출방법이 수행되는 모식 도이다."}
