{"patent_id": "10-2022-0011539", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0115041", "출원번호": "10-2022-0011539", "발명의 명칭": "게이머 숙련도를 고려한 게임 결과 예측 방법 및 시스템", "출원인": "한국전자통신연구원", "발명자": "이상광"}}
{"patent_id": "10-2022-0011539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "게임의 플레이 영상이 포함된 게임 정보로부터 게이머의 실력을 나타내는 숙련도 속성을 추출하는 단계;상기 게임 정보로부터 게임의 현재 상황을 나타내는 게임 상황 속성을 추출하는 단계; 및상기 숙련도 속성 및 상기 게임 상황 속성을 결과 예측 모델에 입력하여 상기 게임의 결과를 예측하는 단계를 포함하고,상기 결과 예측 모델은,학습 정보에서 추출한 숙련도 속성 및 게임 상황 속성을 이용하여 학습된 예측 모델인 게임 결과 예측 방법."}
{"patent_id": "10-2022-0011539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 숙련도 속성은, 계정 레벨, 케릭터의 레벨, 게이머의 케릭터별 승률, 게이머의 최근 승률, 게이머가 취한 행동에 따른 승률, 게이머가 게임 중 획득 가능한 마우스 조작 속도 및 정확도, 게임 중 게이머가 상대 케릭터를 제압한 횟수, 게이머가 제어하는 캐릭터별 몬스터 처치 속도와 같이 게이머의 플레이 능력을 나타내는 정보들 중 적어도 하나를포함하는 게임 결과 예측 방법."}
{"patent_id": "10-2022-0011539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "게임의 플레이 영상과 상기 게임의 결과가 포함된 학습 정보로부터 게이머의 실력을 나타내는 숙련도 속성을 추출하는 단계;상기 학습 정보로부터 게임의 현재 상황을 나타내는 게임 상황 속성을 추출하는 단계;상기 숙련도 속성 및 상기 게임 상황 속성을 기초로 결과 예측 모델을 생성 또는 학습하는 단계; 및상기 결과 예측 모델의 성능이 기준값을 초과하는 경우, 상기 결과 예측 모델을 상기 게임의 결과를 예측하는게임 결과 예측 장치에 제공하는 단계를 포함하는 게임 결과 예측 모델 학습 방법."}
{"patent_id": "10-2022-0011539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 숙련도 속성은, 계정 레벨, 케릭터의 레벨, 게이머의 케릭터별 승률, 게이머의 최근 승률, 게이머가 취한 행동에 따른 승률, 게이머가 게임 중 획득 가능한 마우스 조작 속도 및 정확도, 게임 중 게이머가 상대 케릭터를 제압한 횟수, 게이머가 제어하는 캐릭터별 몬스터 처치 속도와 같이 게이머의 플레이 능력을 나타내는 정보들 중 적어도 하나를포함하는 게임 결과 예측 모델 학습 방법."}
{"patent_id": "10-2022-0011539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항의 방법을 실행하기 위한 프로그램이 기록된 컴퓨터에서 판독 가능한 기록매체."}
{"patent_id": "10-2022-0011539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "게임의 플레이 영상이 포함된 게임 정보로부터 게이머의 실력을 나타내는 숙련도 속성을 추출하는 숙련도 속성공개특허 10-2023-0115041-3-추출부;상기 게임 정보로부터 게임의 현재 상황을 나타내는 게임 상황 속성을 추출하는 게임 상황 속성 추출부; 및상기 숙련도 속성 및 상기 게임 상황 속성을 결과 예측 모델에 입력하여 상기 게임의 결과를 예측하는 결과 예측부를 포함하고,상기 결과 예측 모델은,학습 정보에서 추출한 숙련도 속성 및 게임 상황 속성을 이용하여 학습된 예측 모델인 게임 결과 예측 장치."}
{"patent_id": "10-2022-0011539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 숙련도 속성은, 계정 레벨, 케릭터의 레벨, 게이머의 케릭터별 승률, 게이머의 최근 승률, 게이머가 취한 행동에 따른 승률, 게이머가 게임 중 획득 가능한 마우스 조작 속도 및 정확도, 게임 중 게이머가 상대 케릭터를 제압한 횟수, 게이머가 제어하는 캐릭터별 몬스터 처치 속도와 같이 게이머의 플레이 능력을 나타내는 정보들 중 적어도 하나를포함하는 게임 결과 예측 장치."}
{"patent_id": "10-2022-0011539", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "게이머 숙련도를 고려한 게임 결과 예측 방법 및 시스템이 개시된다. 게임 결과 예측 방법은 게임의 플레이 영 상이 포함된 게임 정보로부터 게이머의 실력을 나타내는 숙련도 속성을 추출하는 단계; 상기 게임 정보로부터 게 임의 현재 상황을 나타내는 게임 상황 속성을 추출하는 단계; 및 상기 숙련도 속성 및 상기 게임 상황 속성을 결 과 예측 모델에 입력하여 상기 게임의 결과를 예측하는 단계를 포함하고, 상기 결과 예측 모델은, 학습 정보에서 추출한 숙련도 속성 및 게임 상황 속성을 이용하여 학습된 예측 모델일 수 있다."}
{"patent_id": "10-2022-0011539", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 게이머의 숙련도를 고려하여 게임의 결과를 예측하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0011539", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "게임 결과를 예측하는 것은 게임 특성에 대한 이해를 증진시키며, 인간 및 인공지능 플레이어의 전략 개발을 위 한 기초되고, 게임의 메타에 대한 지식을 얻을 수 있다. V. Volz et al., “Towards Embodied StarCraft II Winner Prediction,” Workshop on Computer Games, 2018 에서는 블리자드 엔터테인먼트의 실시간 전략(real-time tactics simulation, RTS) 게임인 스타크래프트 II에 대해 싱글 플레이어로부터 취득한 데이터를 이용하여 단순하면서도 해석 가능한 모델을 제안하였다. 그러나, Volz는 축적된 게임 로그 데이터로부터 게임 상황 속성을 추출하여 게임 결과를 예측하는 것으로써, 게이머의 실력을 고려한 게임 결과 예측 방법은 제시하지 못하고 있다. 따라서, 게이머의 실력을 반영하여 게임의 결과를 예측하는 방법이 요청되고 있다."}
{"patent_id": "10-2022-0011539", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 게임 상황과 게이머의 숙련도를 기초로 결과 예측 모델을 생성하고, 실제 게임 정보에서 게임 상황과 게이머의 숙련도를 추출하여 결과 예측 모델에 입력함으로써, 게이머의 실력을 반영하여 게임의 결과를 예측하 는 방법 및 장치를 제공할 수 있다."}
{"patent_id": "10-2022-0011539", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 따른 게임 결과 예측 방법은 게임의 플레이 영상이 포함된 게임 정보로부터 게이머의 실 력을 나타내는 숙련도 속성을 추출하는 단계; 상기 게임 정보로부터 게임의 현재 상황을 나타내는 게임 상황 속 성을 추출하는 단계; 및 상기 숙련도 속성 및 상기 게임 상황 속성을 결과 예측 모델에 입력하여 상기 게임의 결과를 예측하는 단계를 포함하고, 상기 결과 예측 모델은, 학습 정보에서 추출한 숙련도 속성 및 게임 상황 속 성을 이용하여 학습된 예측 모델일 수 있다. 본 발명의 일실시예에 따른 게임 결과 예측 모델 학습 방법은 게임의 플레이 영상과 상기 게임의 결과가 포함된 학습 정보로부터 게이머의 실력을 나타내는 숙련도 속성을 추출하는 단계; 상기 학습 정보로부터 게임의 현재상황을 나타내는 게임 상황 속성을 추출하는 단계; 상기 숙련도 속성 및 상기 게임 상황 속성을 기초로 결과 예 측 모델을 생성 또는 학습하는 단계; 및 상기 결과 예측 모델의 성능이 기준값을 초과하는 경우, 상기 결과 예 측 모델을 상기 게임의 결과를 예측하는 게임 결과 예측 장치에 제공하는 단계를 포함할 수 있다. 본 발명의 일실시예에 따른 게임 결과 예측 장치는 게임의 플레이 영상이 포함된 게임 정보로부터 게이머의 실 력을 나타내는 숙련도 속성을 추출하는 숙련도 속성 추출부; 상기 게임 정보로부터 게임의 현재 상황을 나타내 는 게임 상황 속성을 추출하는 게임 상황 속성 추출부; 및 상기 숙련도 속성 및 상기 게임 상황 속성을 결과 예 측 모델에 입력하여 상기 게임의 결과를 예측하는 결과 예측부를 포함하고, 상기 결과 예측 모델은, 학습 정보 에서 추출한 숙련도 속성 및 게임 상황 속성을 이용하여 학습된 예측 모델일 수 있다. 본 발명의 일실시예에 따른 게임 결과 예측 모델 학습 장치는 게임의 플레이 영상과 상기 게임의 결과가 포함된 학습 정보로부터 게이머의 실력을 나타내는 숙련도 속성을 추출하는 숙련도 속성 추출부; 상기 학습 정보로부터 게임의 현재 상황을 나타내는 게임 상황 속성을 추출하는 게임 상황 속성 추출부; 및 상기 숙련도 속성 및 상기 게임 상황 속성을 기초로 결과 예측 모델을 생성 또는 학습하며, 상기 결과 예측 모델의 성능이 기준값을 초과 하는 경우, 상기 결과 예측 모델을 상기 게임의 결과를 예측하는 게임 결과 예측 장치에 제공하는 결과 예측 모 델 생성부를 포함할 수 있다."}
{"patent_id": "10-2022-0011539", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일실시예에 의하면, 게임 상황과 게이머의 숙련도를 기초로 결과 예측 모델을 생성하고, 실제 게임 정보에서 게임 상황과 게이머의 숙련도를 추출하여 결과 예측 모델에 입력함으로써, 게이머의 실력을 반영하여 게임의 결과를 예측할 수 있다. 또한, 본 발명의 일실시예에 의하면, 게이머의 실력을 반영하여 게임의 결과를 예측함으로써, 게임 중계, 프로 게임팀 등 각 e스포츠 관련자의 게임 특성에 대한 이해를 증진시킬 수 있다."}
{"patent_id": "10-2022-0011539", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 본 발명의 일실시예에 따른 게이머 숙련 도를 고려한 게임 결과 예측 방법은 게이머 숙련도를 고려한 게임 결과 예측 시스템에 의해 수행될 수 있다. 도 1은 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템을 나타내는 도면이다. 게이머 숙련도를 고려한 게임 결과 예측 시스템은 도 1에 도시된 바와 같이 예측 모델 학습 장치와 게임 결과 예측 장치를 포함할 수 있다. 예측 모델 학습 장치는 학습용 데이터베이스로부터 학습 정보를 획득할 수 있다. 예를 들어, 학습 정보는 게임의 플레이 영상과 게임의 결과가 포함된 게임 로그, 게임 리플레이 데이터, 또는 라이브 게임 스트 림일 수 있다. 이때, 예측 모델 학습 장치는 학습 정보로부터 게이머의 실력을 나타내는 숙련도 속성 및 게임 상황 속성을 추출하여 결과 예측 모델을 생성할 수 있다. 그리고, 예측 모델 학습 장치는 결과예측 모델을 게임 결과 예측 장치로 전송할 수 있다. 게임 결과 예측 장치는 게임의 플레이 영상이 포함된 게임 정보를 획득할 수 있다. 예를 들어, 게임 정보는 현재 진행 중이며, 아직 결과가 결정되지 않은 게임의 플레이 영상, 또는 라이브 게임 스트림을 포 함할 수 있다. 이때, 게임 결과 예측 장치는 게임 정보로부터 게이머의 실력을 나타내는 숙련도 속성 및 게임 상황 속성을 추출하여 결과 예측 모델에 입력함으로써 게임의 결과를 예측할 수 있다. 게이머 숙련도를 고려한 게임 결과 예측 시스템은 게임 상황과 게이머의 숙련도를 기초로 결과 예측 모델 을 생성하고, 실제 게임 정보에서 게임 상황과 게이머의 숙련도를 추출하여 결과 예측 모델에 입력함으로 써, 게이머의 실력을 반영하여 게임의 결과를 예측할 수 있다. 그리고, 게이머 숙련도를 고려한 게임 결과 예 측 시스템은 게이머의 실력을 반영하여 게임의 결과를 예측함으로써, 게임 중계, 프로 게임팀 등 각 e스포츠 관 련자의 게임 특성에 대한 이해를 증진시키고, 관련자의 게임 특성에 대한 이해를 증진 시킴으로써, 각 분야에서 의 수익성을 높일 수 있다. 도 2는 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 예측 모델 학습 장치를 나 타내는 도면이다. 예측 모델 학습 장치는 도 2에 도시된 바와 같이 숙련도 속성 추출부, 게임 상황 속성 추출부, 및 결과 예측 모델 생성부를 포함할 수 있다. 이때, 숙련도 속성 추출부, 게임 상황 속성 추출부 , 및 결과 예측 모델 생성부는 서로 다른 프로세스, 또는 하나의 프로세스에 포함된 각각의 모듈일 수 있다. 숙련도 속성 추출부는 게임의 플레이 영상과 게임의 결과가 포함된 학습 정보로부터 게이머의 실력을 나타 내는 숙련도 속성을 추출할 수 있다. 예를 들어, 숙련도 속성 추출부는 계정 레벨, 케릭터의 레벨, 게이 머의 케릭터별 승률, 게이머의 최근 승률, 게이머가 취한 행동에 따른 승률, 게이머가 게임 중 획득 가능한 마 우스 조작 속도 및 정확도, 게임 중 게이머가 상대 케릭터를 제압한 횟수, 게이머가 제어하는 캐릭터별 몬스터 처치 속도와 같이 게이머의 플레이 능력을 나타내는 정보들 중 적어도 하나를 숙련도 속성으로 추출할 수 있다. 게임 상황 속성 추출부는 학습 정보로부터 게임의 현재 상황을 나타내는 게임 상황 속성을 추출할 수 있다. 예를 들어, 게임 상황 속성 추출부는 게이머가 제어하는 케릭터의 체력이나 상태, 케릭터가 위치한 오브젝트나, 맵에 대한 정보 중 적어도 하나를 게임 상황 속성으로 추출할 수 있다. 결과 예측 모델 생성부는 숙련도 속성 및 게임 상황 속성을 기초로 결과 예측 모델을 생성할 수 있다. 그리고, 결과 예측 모델 생성부는 생성한 결과 예측 모델의 성능을 평가할 수 있다. 구체적으로, 결과 예측 모델 생성부는 결과 예측 모델에 게임의 플레이 영상을 입력하여 결과 예측 모델 이 해당 게임의 결과를 출력하도록 할 수 있다. 그리고, 결과 예측 모델 생성부는 결과 예측 모델 이 출력한 해당 게임의 결과와 게임 로그에 포함된 게임의 결과가 일치하는 정도에 따라 결과 예측 모델 의 성능을 평가할 수 있다. 평가한 결과 예측 모델의 성능이 기준값을 초과하는 경우, 결과 예측 모델 생성부는 결과 예측 모델 을 게임 결과 예측 장치에 제공할 수 있다. 평가한 결과 예측 모델의 성능이 기준값 이하인 경우, 결과 예측 모델 생성부는 결과 예측 모델(10 2)의 성능이 기준값을 초과할 때까지 학습 정보를 이용하여 결과 예측 모델을 반복 학습할 수 있다. 도 3은 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 게임 결과 예측 장치를 나 타내는 도면이다. 게임 결과 예측 장치는 도 3에 도시된 바와 같이 숙련도 속성 추출부, 게임 상황 속성 추출부, 및 결과 예측부를 포함할 수 있다. 이때, 숙련도 속성 추출부, 게임 상황 속성 추출부, 및 결 과 예측부는 서로 다른 프로세스, 또는 하나의 프로세스에 포함된 각각의 모듈일 수 있다. 숙련도 속성 추출부는 게임의 플레이 영상이 포함된 게임 정보로부터 게이머의 실력을 나타내는 숙련도 속 성을 추출할 수 있다. 예를 들어, 숙련도 속성 추출부는 계정 레벨, 케릭 레벨, 케릭별 승률, 최근 승률, 게이머가 취한 행동에 따른 승률 중 적어도 하나를 숙련도 속성으로 추출할 수 있다.게임 상황 속성 추출부는 게임의 플레이 영상이 포함된 게임 정보로부터 게임의 현재 상황을 나타내는 게 임 상황 속성을 추출할 수 있다. 예를 들어, 게임 상황 속성 추출부는 게이머가 제어하는 케릭터의 체력 이나 상태, 케릭터가 위치한 오브젝트나, 맵에 대한 정보 중 적어도 하나를 게임 상황 속성으로 추출할 수 있다. 결과 예측부는 예측 모델 학습 장치로부터 결과 예측 모델을 수신할 수 있다. 그리고, 결과 예 측부는 숙련도 속성 추출부가 추출한 숙련도 속성 및 게임 상황 속성 추출부가 추출한 게임 상 황 속성을 결과 예측 모델에 입력할 수 있다. 그리고, 결과 예측부는 숙련도 속성 및 게임 상황 속 성을 입력받은 결과 예측 모델의 출력을 예측된 게임 결과로 출력할 수 있다. 도 4는 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 동작을 나타내는 도면이다. 예측 모델 학습 장치는 게임의 플레이 영상과 게임의 결과가 포함된 게임 로그로부터 게이머의 실력 을 나타내는 숙련도 속성 및 게임의 현재 상황을 나타내는 게임 상황 속성을 추출할 수 있다. 다음으로, 예측 모델 학습 장치는 숙련도 속성 및 게임 상황 속성을 기초로 결과 예측 모델 을 생성할 수 있다. 그리고, 예측 모델 학습 장치는 결과 예측 모델의 성능을 평가할 수 있다. 결과 예측 모델의 성능이 기준값을 초과하는 경우, 예측 모델 학습 장치는 결과 예측 모델을 게 임 결과 예측 장치에 제공할 수 있다. 이때, 게임 결과 예측 장치는 게임의 플레이 영상이 포함된 게임 정보로부터 게이머의 실력을 나타내 는 숙련도 속성 및 게임의 현재 상황을 나타내는 게임 상황 속성을 추출할 수 있다. 다음으로, 게임 결과 예측 장치는 숙련도 속성 및 게임 상황 속성을 결과 예측 모델에 입 력할 수 있다. 그리고, 게임 결과 예측 장치는 결과 예측 모델의 출력을 예측된 게임 결과로 출력할 수 있다. 도 5는 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 예측 모델 학습 방법을 도 시한 플로우차트이다. 단계에서 예측 모델 학습 장치는 학습용 데이터베이스로부터 게임의 플레이 영상과 게임의 결과 가 포함된 학습 정보를 획득할 수 있다. 단계에서 예측 모델 학습 장치의 숙련도 속성 추출부는 단계에서 획득한 학습 정보로부터 게이머의 실력을 나타내는 숙련도 속성을 추출할 수 있다. 단계에서 예측 모델 학습 장치의 게임 상황 속성 추출부는 단계에서 획득한 학습 정보로부 터 게임의 현재 상황을 나타내는 게임 상황 속성을 추출할 수 있다. 이때, 단계과 단계는 병렬로 수 행될 수도 있다. 단계에서 예측 모델 학습 장치의 결과 예측 모델 생성부는 숙련도 속성 및 게임 상황 속성을 기 초로 결과 예측 모델을 생성할 수 있다. 단계에서 결과 예측 모델 생성부는 결과 예측 모델의 성능이 기준값을 초과할 때까지 학습 정보 를 이용하여 결과 예측 모델을 반복 학습할 수 있다. 단계에서 결과 예측 모델 생성부는 단계의 학습에 따라 성능이 기준값을 초과한 결과 예측 모델 을 게임 결과 예측 장치에 제공할 수 있다. 도 6은 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 게임 결과 예측 방법을 도 시한 플로우차트이다. 단계에서 게임 결과 예측 장치는 예측 모델 학습 장치로부터 결과 예측 모델를 수신할 수 있다. 단계에서 게임 결과 예측 장치는 게임의 플레이 영상이 포함된 게임 정보를 획득할 수 있다. 단계에서 게임 결과 예측 장치의 숙련도 속성 추출부는 단계에서 획득한 게임 정보로부터 게이머의 실력을 나타내는 숙련도 속성을 추출할 수 있다. 단계에서 게임 결과 예측 장치의 게임 상황 속성 추출부는 단계에서 획득한 게임 정보로부 터 게임의 현재 상황을 나타내는 게임 상황 속성을 추출할 수 있다. 이때, 단계과 단계는 병렬로 수 행될 수도 있다. 단계에서 게임 결과 예측 장치의 결과 예측부는 단계에서 추출한 숙련도 속성 및 단계 에서 추출한 게임 상황 속성을 단계에서 수신한 결과 예측 모델에 입력할 수 있다. 단계에서 결과 예측부는 단계에서 숙련도 속성 및 게임 상황 속성을 입력받은 결과 예측 모델 의 출력을 예측된 게임 결과로 출력할 수 있다. 본 발명은 게임 상황과 게이머의 숙련도를 기초로 결과 예측 모델을 생성하고, 실제 게임 정보에서 게임 상황과 게이머의 숙련도를 추출하여 결과 예측 모델에 입력함으로써, 게이머의 실력을 반영하여 게임의 결 과를 예측할 수 있다. 그리고, 게이머 숙련도를 고려한 게임 결과 예측 시스템은 게이머의 실력을 반영하여 게 임의 결과를 예측함으로써, 게임 중계, 프로 게임팀 등 각 e스포츠 관련자의 게임 특성에 대한 이해를 증진시키 고, 관련자의 게임 특성에 대한 이해를 증진 시킴으로써, 각 분야에서의 수익성을 높일 수 있다. 한편, 본 발명에 따른 방법은 컴퓨터에서 실행될 수 있는 프로그램으로 작성되어 마그네틱 저장매체, 광학적 판 독매체, 디지털 저장매체 등 다양한 기록 매체로도 구현될 수 있다. 본 명세서에 설명된 각종 기술들의 구현들은 디지털 전자 회로조직으로, 또는 컴퓨터 하드웨어, 펌웨어, 소프트 웨어로, 또는 그들의 조합들로 구현될 수 있다. 구현들은 데이터 처리 장치, 예를 들어 프로그램가능 프로세서, 컴퓨터, 또는 다수의 컴퓨터들의 동작에 의한 처리를 위해, 또는 이 동작을 제어하기 위해, 컴퓨터 프로그램 제 품, 즉 정보 캐리어, 예를 들어 기계 판독가능 저장 장치(컴퓨터 판독가능 매체) 또는 전파 신호에서 유형적으 로 구체화된 컴퓨터 프로그램으로서 구현될 수 있다. 상술한 컴퓨터 프로그램(들)과 같은 컴퓨터 프로그램은 컴 파일된 또는 인터프리트된 언어들을 포함하는 임의의 형태의 프로그래밍 언어로 기록될 수 있고, 독립형 프로그 램으로서 또는 모듈, 구성요소, 서브루틴, 또는 컴퓨팅 환경에서의 사용에 적절한 다른 유닛으로서 포함하는 임 의의 형태로 전개될 수 있다. 컴퓨터 프로그램은 하나의 사이트에서 하나의 컴퓨터 또는 다수의 컴퓨터들 상에 서 처리되도록 또는 다수의 사이트들에 걸쳐 분배되고 통신 네트워크에 의해 상호 연결되도록 전개될 수 있다. 컴퓨터 프로그램의 처리에 적절한 프로세서들은 예로서, 범용 및 특수 목적 마이크로프로세서들 둘 다, 및 임의 의 종류의 디지털 컴퓨터의 임의의 하나 이상의 프로세서들을 포함한다. 일반적으로, 프로세서는 판독 전용 메 모리 또는 랜덤 액세스 메모리 또는 둘 다로부터 명령어들 및 데이터를 수신할 것이다. 컴퓨터의 요소들은 명령 어들을 실행하는 적어도 하나의 프로세서 및 명령어들 및 데이터를 저장하는 하나 이상의 메모리 장치들을 포함 할 수 있다. 일반적으로, 컴퓨터는 데이터를 저장하는 하나 이상의 대량 저장 장치들, 예를 들어 자기, 자기-광 디스크들, 또는 광 디스크들을 포함할 수 있거나, 이것들로부터 데이터를 수신하거나 이것들에 데이터를 송신하 거나 또는 양쪽으로 되도록 결합될 수도 있다. 컴퓨터 프로그램 명령어들 및 데이터를 구체화하는데 적절한 정 보 캐리어들은 예로서 반도체 메모리 장치들, 예를 들어, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD-ROM(Compact Disk Read Only Memory), DVD(Digital Video Disk)와 같은 광 기 록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media), 롬 (ROM, Read Only Memory), 램(RAM, Random Access Memory), 플래시 메모리, EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM) 등을 포함한다. 프로세서 및 메모리는 특수 목적 논리 회로조직에 의해 보충되거나, 이에 포함될 수 있다. 또한, 컴퓨터 판독가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용매체일 수 있고, 컴퓨터 저장매체 및 전송매체를 모두 포함할 수 있다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특정한 특징들 은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양한 특징들 역 시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특 정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부터의 하나 이 상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 마찬가지로, 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시 형태의 다양한 장치 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되어서는 안되며, 설명한 프로그램 컴포넌트와 장치들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거나 다중 소프트웨어 제품에 패키징 될 수 있다는 점을 이해하여야 한다. 한편, 본 명세서와 도면에 개시된 본 발명의 실시 예들은 이해를 돕기 위해 특정 예를 제시한 것에 지나지 않으 며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상"}
{"patent_id": "10-2022-0011539", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 에게 자명한 것이다."}
{"patent_id": "10-2022-0011539", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템을 나타내는 도면이다. 도 2는 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 예측 모델 학습 장치를 나 타내는 도면이다. 도 3은 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 게임 결과 예측 장치를 나 타내는 도면이다. 도 4는 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 동작을 나타내는 도면이다. 도 5는 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 예측 모델 학습 방법을 도 시한 플로우차트이다. 도 6은 본 발명의 일실시예에 따른 게이머 숙련도를 고려한 게임 결과 예측 시스템의 게임 결과 예측 방법을 도 시한 플로우차트이다."}
