{"patent_id": "10-2020-0090177", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0105276", "출원번호": "10-2020-0090177", "발명의 명칭": "스마트 홈 모니터링 방법 및 장치", "출원인": "국민대학교산학협력단", "발명자": "장영민"}}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트 홈에 대한 센싱 값 및 IoT(Internet of Things) 장치에 대한 정보를 수신하는 단계;상기 센싱 값을 인공 신경망에 입력하여 출력 값을 획득하는 단계;상기 출력 값을 기초로 상기 스마트 홈의 이상 발생 여부를 판단하는 단계;상기 스마트 홈에 이상이 발생 하였다고 판단한 경우, 상기 IoT 장치에 대한 정보를 기초로 상기 IoT 장치에 대한 제어 명령을 생성하는 단계; 및상기 제어 명령을 상기 IoT 장치에 전송하는 단계를 포함하는, 스마트 홈 모니터링 방법."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 스마트 홈에 대한 센싱 값 및 상기 IoT 장치에 대한 정보를 수신하는 단계는,LoRa(LongRange) 통신 인터페이스를 이용하여 상기 스마트 홈에 대한 센싱 값 및 IoT 장치에 대한 정보를 게이트웨이로부터 수신하는 단계를 포함하는, 스마트 홈 모니터링 방법."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 게이트웨이는,OCC(Optical Camera Communication) 통신 인터페이스를 이용하여 상기 스마트 홈에 대한 센싱 값 및 상기 IoT장치에 대한 정보 중 하나 이상을 획득하는, 스마트 홈 모니터링 방법."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 IoT 장치에 대한 정보는 상기 IoT 장치의 상태, 상기 IoT 장치의 ID(Identifier) 및 상기 IoT 장치의 종류를 포함하는, 스마트 홈 모니터링 방법."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 인공 신경망은 미리 학습이 수행된, 스마트 홈 모니터링 방법."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 인공 신경망의 학습은,상기 인공 신경망에 대한 학습 모델을 생성하는 단계;상기 센싱 값 및 상기 센싱 값에 대한 실제 출력 값을 포함하는 학습 데이터를 생성하는 단계; 및상기 학습 데이터를 기초로 상기 학습 모델의 가중치를 조정하는 단계를 통해 수행되는, 스마트 홈 모니터링 방법.공개특허 10-2021-0105276-3-청구항 7 프로세서(processor);상기 프로세서에 의해 실행되는 명령들을 포함하는 메모리(memory); 및 인공신경망을 포함하고,상기 하나 이상의 명령들은,스마트 홈에 대한 센싱 값 및 IoT 장치(Internet of Things)에 대한 정보를 수신하고;상기 센싱 값을 인공 신경망에 입력하여 출력 값을 획득하고;상기 출력 값을 기초로 상기 스마트 홈의 이상 발생 여부를 판단하고;상기 스마트 홈에 이상이 발생 하였다고 판단한 경우, 상기 IoT 장치에 대한 정보를 기초로 상기 IoT 장치에 대한 제어 명령을 생성하고; 그리고,상기 제어 명령을 상기 IoT 장치에 전송하도록 실행되는, 스마트 홈 모니터링 장치."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서, 상기 스마트 홈에 대한 센싱 값 및 상기 IoT 장치에 대한 정보를 수신하는 경우,상기 하나 이상의 명령은,LoRa(LongRange) 통신 인터페이스를 이용하여 상기 스마트 홈에 대한 센싱 값 및 IoT 장치에 대한 정보를 게이트웨이로부터 수신하도록 실행되는, 스마트 홈 모니터링 장치."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 게이트웨이는,OCC(Optical Camera Communication) 통신 인터페이스를 이용하여 상기 스마트 홈에 대한 센싱 값 및 상기 IoT장치에 대한 정보 중 하나 이상을 획득하는, 스마트 홈 모니터링 장치."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에 있어서,상기 IoT 장치에 대한 정보는 상기 IoT 장치의 상태, 상기 IoT 장치의 ID(Identifier) 및 상기 IoT 장치의 종류를 포함하는, 스마트 홈 모니터링 장치."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 7에 있어서, 상기 인공 신경망은 미리 학습이 수행된, 스마트 홈 모니터링 장치."}
{"patent_id": "10-2020-0090177", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서, 상기 인공 신경망의 학습은,상기 인공 신경망에 대한 학습 모델을 생성하고;상기 센싱 값 및 상기 센싱 값에 대한 실제 출력 값을 포함하는 학습 데이터를 생성하고; 그리고,상기 학습 데이터를 기초로 상기 학습 모델의 가중치를 조정하는 방식으로 수행되는, 스마트 홈 모니터링 장치.공개특허 10-2021-0105276-4-"}
{"patent_id": "10-2020-0090177", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "스마트 홈 모니터링 방법 및 장치가 개시된다. 본 발명의 일 실시예에 따른 스마트 홈 모니터링 방법은 스마트 홈에 대한 센싱 값 및 IoT(Internet of Things) 장치에 대한 정보를 수신하는 단계, 상기 센싱 값을 인공 신경망 에 입력하여 출력 값을 획득하는 단계, 상기 출력 값을 기초로 상기 스마트 홈의 이상 발생 여부를 판단하는 단 계, 상기 스마트 홈에 이상이 발생 하였다고 판단한 경우, 상기 IoT 장치에 대한 정보를 기초로 상기 IoT 장치에 대한 제어 명령을 생성하는 단계 및 상기 제어 명령을 상기 IoT 장치에 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0090177", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 홈 모니터링 방법 및 장치에 관한 것으로, 더욱 상세하게는 LoRa(Long Range) 인터 페이스를 이용한 IoT 장치 모니터링 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2020-0090177", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근의 스마트 홈(smart home) 환경은 지능형 무선 센서 네트워크를 기반으로 하는 IoT(Internet of Things) 가전의 확산과 함께 계속 늘어나고 있다. IoT 기술 발전으로 인해 소비자들은 다양한 스마트 가전 제품들을 사 용할 수 있게 되었다 이에 따라, 스마트 가전 제품들에 대한 제어가 필요할 수 있으며, 이러한 제어는 클라우드 서버 등과 같은 외부 의 장치에 의해서 수행될 수 있다. 스마트 가전 제품들 및 클라우드 서버를 연결하기 위하여 IoT 센서 네트워크 가 필요할 수 있다. IoT 센서 네트워크는 그 특성상 전력 소모가 작아야하며, 원격 제어를 수행하기 위하여 넓 은 영역을 커버할 수 있어야 한다. 다만, 현재 IoT 센서 네트워크로 이용되고 있는, 와이-파이(wi-fi) 및BLE(Bluetooth Low Energy)와 같은 단거 리 무선 기술은 초 저전력을 소비하기는 하나, 넓은 영역을 커버할 수 없는 문제점이 있을 수 있고, 셀룰러 네 트워크는 넓은 영역을 커버할 수 있으나, 전력 소모가 클 수 있다."}
{"patent_id": "10-2020-0090177", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 목적은, 스마트 홈과 모니터링 장치의 거리가 일정 값 이상인 경우에도 스마트 홈에 대한 모니터링을 수행할 수 있는 스마트 홈 모니터링 방법 및 장치를 제공하는 데 있다."}
{"patent_id": "10-2020-0090177", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 일 실시예에 따른, 스마트 홈 모니터링 방법은 스마트 홈에 대 한 센싱 값 및 IoT(Internet of Things) 장치에 대한 정보를 수신하는 단계, 상기 센싱 값을 인공 신경망에 입 력하여 출력 값을 획득하는 단계; 상기 출력 값을 기초로 상기 스마트 홈의 이상 발생 여부를 판단하는 단계; 상기 스마트 홈에 이상이 발생 하였다고 판단한 경우, 상기 IoT 장치에 대한 정보를 기초로 상기 IoT 장치에 대 한 제어 명령을 생성하는 단계 및 상기 제어 명령을 상기 IoT 장치에 전송하는 단계를 포함할 수 있다. 여기서, 상기 스마트 홈에 대한 센싱 값 및 상기 IoT 장치에 대한 정보를 수신하는 단계는, LoRa(LongRange) 통 신 인터페이스를 이용하여 상기 스마트 홈에 대한 센싱 값 및 IoT 장치에 대한 정보를 게이트웨이로부터 수신하 는 단계를 포함할 수 있다. 여기서, 상기 게이트웨이는, OCC(Optical Camera Communication) 통신 인터페이스를 이용하여 상기 스마트 홈에 대한 센싱 값 및 상기 IoT 장치에 대한 정보 중 하나 이상을 획득할 수 있다. 여기서, 상기 IoT 장치에 대한 정보는 상기 IoT 장치의 상태, 상기 IoT 장치의 ID(Identifier) 및 상기 IoT 장 치의 종류 중 하나 이상을 포함할 수 있다. 여기서, 상기 인공 신경망은 미리 학습이 수행될 수 있다. 여기서, 상기 인공 신경망의 학습은, 상기 인공 신경망에 대한 학습 모델을 생성하는 단계, 상기 센싱 값 및 상 기 센싱 값에 대한 실제 출력 값을 포함하는 학습 데이터를 생성하는 단계 및 상기 학습 데이터를 기초로 상기 학습 모델의 가중치를 조정하는 단계를 통해 수행될 수 있다. 상기와 같은 문제점을 해결하기 위한 본 발명의 다른 실시예에 따른 모니터링 장치는 프로세서(processor), 상 기 프로세서에 의해 실행되는 명령들을 포함하는 메모리(memory); 및 인공신경망을 포함할 수 있고, 상기 하나 이상의 명령들은, 스마트 홈에 대한 센싱 값 및 IoT 장치(Internet of Things)에 대한 정보를 수신하고, 상기 센싱 값을 인공 신경망에 입력하여 출력 값을 획득하고, 상기 출력 값을 기초로 상기 스마트 홈의 이상 발생 여 부를 판단하고, 상기 스마트 홈에 이상이 발생 하였다고 판단한 경우, 상기 IoT 장치에 대한 정보를 기초로 상기 IoT 장치에 대한 제어 명령을 생성하고 그리고 상기 제어 명령을 상기 IoT 장치에 전송하도록 실행될 수 있 다. 여기서, 상기 스마트 홈에 대한 센싱 값 및 상기 IoT 장치에 대한 정보를 수신하는 경우, 상기 하나 이상의 명 령은, LoRa(LongRange) 통신 인터페이스를 이용하여 상기 스마트 홈에 대한 센싱 값 및 IoT 장치에 대한 정보를 게이트웨이로부터 수신하도록 실행될 수 있다. 여기서, 상기 게이트웨이는, OCC(Optical Camera Communication) 통신 인터페이스를 이용하여 상기 스마트 홈에 대한 센싱 값 및 상기 IoT 장치에 대한 정보 중 하나 이상을 획득할 수 있다. 여기서, 상기 IoT 장치에 대한 정보는, 상기 IoT 장치의 상태, 상기 IoT 장치의 ID(Identifier) 및 상기 IoT 장치의 종류 중 하나 이상을 포함할 수 있다. 여기서, 상기 인공 신경망은 미리 학습이 수행될 수 있다. 여기서, 상기 인공 신경망의 학습은, 상기 인공 신경망에 대한 학습 모델을 생성하고, 상기 센싱 값 및 상기 센 싱 값에 대한 실제 출력 값을 포함하는 학습 데이터를 생성하고 그리고, 상기 학습 데이터를 기초로 상기 학습 모델의 가중치를 조정하는 방식으로 수행될 수 있다."}
{"patent_id": "10-2020-0090177", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, LoRa(Long Range) 인터페이스를 통해, 스마트 홈에 대한 모니터링을 수행하는 바, 스마트 홈 모니터링에 사용되는 전력이 낮을 수 있고, 스마트 홈과 모니터링 장치와의 거리가 먼 경우에도 모니터링 장치 가 스마트 홈에 대한 모니터링을 수행할 수 있다."}
{"patent_id": "10-2020-0090177", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유 사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 본 발명에 따른 실시예들이 적용되는 통신 시스템(communication system)이 설명될 것이다. 본 발명에 따른 실 시예들이 적용되는 통신 시스템은 아래 설명된 내용에 한정되지 않으며, 본 발명에 따른 실시예들은 다양한 통 신 시스템에 적용될 수 있다. 여기서, 통신 시스템은 통신 네트워크(network)와 동일한 의미로 사용될 수 있다. 도 1은 본 발명의 일 실시예에 따른 스마트 홈 모니터링 시스템의 개념도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 스마트 홈 모니터링 시스템은 센서, IoT(Internet of Things) 장치, 게이트웨이 및 모니터링 장치 및 를 포함할 수 있다. 도면에는 하나의 센서 및 IoT 장치만을 도시하였으나, 이는 일 예시일 뿐이며, 센서 및 IoT 장치는 복수일 수 있다. 또한, 도면에는 센서와 IoT 장치가 별개인 것으로 도시하였으나 센서 및 IoT 장치는 하나 로 구성될 수 있다. 센서 및 IoT 장치, 센서 및 게이트웨이 및 IoT 장치와 게이트웨이는 제1 통신 인터페이스를 이용해 상호간에 통신을 수행할 수 있다. 예를 들어, 제1 통신 인터페이스는 OCC(Optical Camera Communication), 와이파이(wifi) 블루투스(bluetooth), BLE(Bluetooth Low Energy) 통신 인터페이스를 포함할 수 있다. 제1 통신 인터페이스가 OCC 통신 인터페이스인 경우, 센서는 LED(Light Emitting Diode)포함할 수 있고, IoT 장치 및 게이트웨이는 LED 및 카메라를 포함할 수 있다. 또한, 게이트웨이 및 모 니터링 장치는 제2 통신 인터페이스를 이용해 상호간에 통신을 수행할 수 있다. 제2 통신 인터페이스는 LoRa(LongRange) 통신 인터페이스일 수 있다. 센서는 스마트 홈의 상태를 센싱하여 센싱 값을 생성할 수 있다. 센서는 습도 센서, 가스 센서, 먼지 센서, 온도 센서, 소음 센서 및 감지 센서 중 하나일 수 있으나, 이는 일 예시일 뿐이며, 이에 한정하지 아니한 다. 센서가 습도 센서인 경우, 센서는 스마트 홈의 습도를 측정하여 습도에 대한 센싱 값을 생성할 수 있다. 센서가 가스 센서인 경우, 센서는 스마트 홈의 공기 중 가스 밀도를 측정하여 가스에 대한 센싱 값을 생성할 수 있다. 센서가 온도 센서인 경우, 센서는 스마트 홈의 온도를 측정하여 온 도에 대한 센싱 값을 생성할 수 있다. 또한, 센서가 소음 센서인 경우, 센서는 스마트 홈의 소음을 측정하여 소음에 대한 센싱 값을 생성할 수 있다. 센서는 센싱 값을 게이트웨이에 전송할 수 있다. 센서는 제1 통신 인터페이스를 이용해 센싱 값을 게이트웨이에 전송할 수 있다. IoT 장치는 센서와 관련이 있는 장치를 포함할 수 있다. 예를 들어, IoT 장치는 온도 센서와 관 련이 있는 온도 조정 장치(예를 들어, 에어컨 및 히터 등)일 수 있다. IoT 장치는 습도 센서와 관련이 있 는 습도 조정 장치(예를 들어, 제습기 등)일 수 있다. IoT 장치는 가스 센서와 관련이 있는 가스 조정 장 치(예를 들어, 가스 레인지 및 보일러 등)일 수 있다. IoT 장치는 먼지 센서와 관련이 있는 먼지 조정 장 치(예를 들어, 청소기 및 공기 청정기 등)일 수 있다. 또한, IoT 장치는 소음 센서와 관련이 있는 소음 조 정 장치(예를 들어, 스피커 및 텔레비전 등)일 수 있다. IoT 장치는 IoT 장치에 대한 정보를 생성할 수 있다. IoT 장치에 대한 정보는 IoT 장치의 상태, ID(Identifier) 및 종류 등에 대한 정보를 포함할 수 있으나 이는 일 예시일 뿐이며, 이에 한정하지 아니 한다. IoT 장치는 IoT 장치에 대한 정보를 게이트웨이에 전송할 수 있다. 제1 통신 인터페이스 를 이용해 IoT 장치에 대한 정보를 게이트웨이에 전송할 수 있다. 게이트웨이는 센싱 값을 센서로부터 수신할 수 있다. 게이트웨이는 제1 통신 인터페이스를 이용 해 센싱 값을 센서로부터 수신할 수 있다. 게이트웨이는 IoT 장치에 대한 정보를 IoT 장치로부터 수신할 수 있다. 게이트웨이는 제1 통신 인터페이스를 이용해 IoT 장치에 대한 정보를 IoT 장치로부터 수신할 수 있다. 게이트웨이는 센싱 값 및 IoT 장치에 대한 정보를 모니터링 장치에 전송할 수 있다. 게이트웨이 는 제2 통신 인터페이스를 이용해 센싱 값 및 IoT 장치에 대한 정보를 모니터링 장치에 전송할 수 있다. 모니터링 장치는 센싱 값 및 IoT 장치에 대한 정보를 게이트웨이로부터 수신할 수 있다. 모니터 링 장치는 제2 통신 인터페이스를 이용해 센싱 값 및 IoT 장치에 대한 정보를 게이트웨이로부터 수신할 수 있다. 모니터링 장치는 센싱 값 및 IoT 장치에 대한 정보를 이용하여 스마트 홈에 대한 모 니터링 및 제어를 수행할 수 있다. 모니터링 장치는 다음과 같이 구성될 수 있다. 도 2는 본 발명의 일 실시예에 따른 모니터링 장치의 블록도이다. 도 2를 참조하면, 모니터링 장치은 도 1의 모니터링 장치와 동일하거나 유사하게 구성될 수 있다. 모 니터링 장치는 인공 신경망(Artificial Neural Network, 210) 및 제어부를 포함할 수 있다. 인공 신 경망은 센싱 값을 게이트웨이(예를 들어, 도 1의 게이트웨이)로부터 수신할 수 있다. 인공 신경망 은 센싱 값을 기초로 스마트 홈의 이상 상태에 대한 출력 값을 생성할 수 있다. 인공 신경망은 다음 과 같이 구성될 수 있다. 도 3은 본 발명의 일 실시예에 따른 인공 신경망의 개념도이다. 도 3을 참조하면, 도 3의 인공 신경망은 도 2의 인공 신경망과 동일하거나 유사하게 구성될 수 있다. 인공 신경망은 입력 레이어(input layer)들(311 내지 313), 제1 히든 레이어(hidden layer)들(321 내지 324), 복수의 제2 히든 레이어들(331 내지 334) 및 출력 레이어(output layer, 341)를 포함할 수 있다. 입력 레이어들(311 내지 313) 및 제1 히든 레이어들(321 내지 324)은 완전 연결(fully-connected)될 수 있다. 제1 히든 레이어들(321 내지 324) 및 제2 히든 레이어들(331 내지 334)은 완전 연결될 수 있다. 제2 히든 레이어들 (331 내지 334)는 출력 레이어와 완전 연결될 수 있다. 인공 신경망은 센싱 값에 대한 처리를 수행하여 출력 값을 생성할 수 있다. 즉, 인공 신경망은 입력 레이어들(311 내지 313)을 통해 센싱 값을 게이트웨이로부터 수신할 수 있다. 인공 신경망은 센싱 값을 기 초로 연산을 수행하여 출력 값을 생성할 수 있다. 출력 값은 스마트 홈에서 센싱 값이 획득된 경우, 스마트 홈 의 이상 발생 여부에 대한 판단 결과를 포함할 수 있다. 예를 들어, 센싱 값이 온도 및 습도에 대한 센싱 값인 경우, 인공 신경망은 센싱 값이 미리 설정한 범위 내의 값인지 여부를 기초로 스마트 홈의 이상 발생 여부를 판단할 수 있다. 센싱 값이 미리 설정한 범위 밖의 값인 경우, 인공 신경망은 스마트 홈에 이상이 있는 것으로 판단할 수 있고 출력 값으로 1 값을 생성할 수 있다. 센싱 값이 미리 설정한 범위 내의 값인 경우, 인공 신경망은 스마트 홈에 이상이 없는 것으로 판단 할 수 있고 출력 값으로 0 값을 생성할 수 있다. 센싱 값이 가스, 먼지 및 소음에 대한 센싱 값인 경우, 인공 신경망은 센싱 값이 미리 설정한 값을 초과하 였는지 여부를 기초로 스마트 홈의 이상 발생 여부를 판단할 수 있다. 센싱 값이 미리 설정한 값을 초과한 경우, 인공 신경망은 스마트 홈에 이상이 있는 것으로 판단할 수 있고 출력 값으로 1 값을 생성할 수 있다. 센싱 값이 미리 설정한 값 이하인 경우, 인공 신경망은 스마트 홈에 이상이 없는 것으로 판단할 수 있고 출력 값으로 0 값을 생성할 수 있다. 인공 신경망이 다음 수학식 1을 기초로 출력 값을 생성할 수 있 다. 수학식 1 수학식 1에서, 는 출력 값일 수 있고, 는 가중치일 수 있으며, 는 센싱 값일 수 있고, 은 가우시안 잡음(Gaussian noise)일 수 있다. 인공 신경망은 출력 레이어를 통해 출력 값을 제어부(예를 들어, 도 2의 제어부)에 전송할 수 있다. 한편, 인공 신경망은 미리 학습이 수행될 수 있고, 학습 방법은 다음과 같을 수 있다. 도 4는 본 발명의 일 실시예에 따른 인공 신경망 학습 방법의 흐름도이다. 도 4를 참조하면, 인공 신경망은 학습 모델을 생성할 수 있다(S410). 학습 모델은 인공 신경망의 학습을 위한 모델일 수 있다. 인공 신경망은 수학식 1과 같은 학습 모델을 생성할 수 있다. 인공 신경망은 학습 데이터를 생 성할 수 있다(S420). 인공 신경망은 센싱 값 및 실제 출력 값을 포함하는 데이터 셋들을 수집할 수 있다. 인공 신경망은 데이터 셋들을 트레이닝 셋(training set), 검증 셋(validation set) 및 테스트 셋(test set)으로 분 류하는 방식으로 학습 데이터를 생성할 수 있다. 트레이닝 셋은 복수일 수 있다. 인공 신경망은 학습 데이터를 기초로 학습을 수행할 수 있다(S420). 인공 신경망은 학습 모델의 가중치(예를 들 어, 도 3의 수학식 1의 )를 조정하는 방식으로 트레이닝을 수행할 수 있다. 인공 신경망은 트레이닝 셋의 센싱 값(예를 들어, 도 3의 수학식 1의 )을 기초로 출력 값(예를 들어, 도 3의 수학식 1의 )을 획득할 수 있다. 인공 신경망은 출력 값 및 실제 출력 값을 비교할 수 있다. 인공 신경망은 출력 값 및 실제 출력 값의 비교 결 과를 기초로 학습 모델의 가중치를 조정하는 방식으로 트레이닝을 수행할 수 있다. 트레이닝 셋이 복수인 경우, 인공 신경망은 각각의 트레이닝 셋을 기초로 트레이닝을 반복하여 수행할 수 있다. 인공 신경망은 검증 셋을 기초로 트레이닝 수행 결과에 대한 검증을 수행할 수 있다. 인공 신경망은 검증 셋의 센싱 값을 기초로 출력 값을 획득할 수 있다. 인공 신경망은 출력 값 및 실제 출력 값을 비교하는 방식으로 트 레이닝 수행 결과에 대한 검증을 수행할 수 있다. 마지막으로, 인공 신경망은 테스트 셋을 기초로 트레이닝 수 행 결과에 대한 테스트를 수행할 수 있다. 인공 신경망은 테스트 셋의 센싱 값을 기초로 출력 값을 획득할 수 있다. 인공 신경망은 출력 값 및 실제 출력 값을 비교하는 방식으로 테스트를 수행할 수 있다. 다시 도 2를 참조하면, 제어부는 인공 신경망으로부터 출력 값을 수신할 수 있다. 제어부는 출력 값 을 기초로 스마트 홈의 상태에 대한 이상 발생 여부를 판단할 수 있다. 예를 들어, 제어부는 출력 값이 0 인 경우 스마트 홈의 상태에 이상이 없다고 판단할 수 있고, 출력 값이 1인 경우 스마트 홈의 상태에 이상이 있 다고 판단할 수 있다. 제어부는 판단 결과를 기초로 이상 발생 여부에 대한 정보를 생성할 수 있다. 제어 부는 스마트 홈의 사용자에게 이상 발생 여부에 대한 정보를 전송할 수 있다. 스마트 홈의 상태에 이상이 있는 것으로 판단한 경우, 제어부는 IoT 장치(예를 들어, 도 1의 IoT 장치 )에 대한 정보를 기초로 제어 명령을 생성할 수 있다. IoT 장치는 센싱 값을 출력한 센서와 관련이 있는 IoT 장치일 수 있다. 예를 들어, 제어 명령은 IoT 장치에 대한 제어 명령일 수 있다. 예를 들어, 센싱 값이 온도에 대한 센싱 값이며 출력 값이 1인 경우, 제어부는 IoT 장치 중 온도 조정 장치에 대한 제어 명령을 생성할 수 있다. 센 싱 값이 습도에 대한 센싱 값이며 출력 값이 1인 경우, 제어부는 IoT 장치 중 습도 조정 장치에 대한 제어 명령을 수행할 수 있다. 센싱 값이 가스에 대한 센싱 값이며 출력 값이 1인 경우, 제어부는 IoT 장치 중 가스 조정 장치에 대한 제어 명령을 생성할 수 있다. 센싱 값이 먼지에 대한 센싱 값이며 출력 값이 1 인 경우, 제어부는 IoT 장치 중 먼지 조정 장치에 대한 제어 명령을 생성할 수 있다. 센싱 값이 소음 에 대한 센싱 값이며 출력 값이 1인 경우, 제어부는 IoT 장치 중 소음 조정 장치에 대한 제어 명령을 생성할 수 있다. 제어부는 제어 명령을 게이트웨이에 전송할 수 있다. 도 5는 본 발명의 일 실시예에 따른 스마트 홈 모니터링 방법의 흐름도이다. 도 5를 참조하면, 스마트 홈 모니터링 장치(예를 들어, 도 1의 스마트 홈 모니터링 장치)는 센싱 값 및 IoT 장치에 대한 정보를 획득할 수 있다(S510). 스마트 홈 모니터링 장치는 게이트웨이(예를 들어, 도 1의 게이 트웨이)로부터 센싱 값 및 IoT 장치(예를 들어, 도 1의 IoT 장치)에 대한 정보를 획득할 수 있다. 센 싱 값은 센서(예를 들어, 도 1의 센서)에 의해 센싱된 값일 수 있고, IoT 장치에 대한 정보는 IoT 장치의 상태, ID 및 종류 등을 포함할 수 있다. 스마트 홈 모니터링 장치는 센싱 값을 기초로 스마트 홈의 이상 발생 여부를 판단할 수 있다(S520). 스마트 홈 모니터링 장치의 인공 신경망(예를 들어, 도 2의 인공 신경망)은 센싱 값을 기초로 출력 값을 획득할 수 있다. 인공 신경망은 출력 값을 스마트 홈 모니터링 장치의 제어부(예를 들어, 도 2의 제어부)에 전송할 수 있다. 제어부는 출력 값을 기초로 스마트 홈의 이상 발생 여부를 판단할 수 있다. 스마트 홈에 이상이 없다 고 판단한 경우(S520의 아니오), 모니터링 장치는 제어를 종료할 수 있다. 스마트 홈에 이상이 있다고 판단한 경우(S520의 예), 모니터링 장치는 판단 결과 및 IoT 장치에 대한 정보를 기 초로 제어 명령을 생성할 수 있다(S530). 제어부는 IoT 장치에 대한 정보를 기초로 IoT 장치 중 센싱 값을 생성 한 센서와 관련이 있는 IoT 장치를 검색할 수 있다. 제어부는 IoT 장치에 대한 정보 가운데 IoT 장치의 ID 및 종류 중 하나 이상을 기초로 IoT 장치를 검색할 수 있다. 제어부는 검색된 IoT 장치에 대한 제어 명령을 생성할 수 있다. 제어부는 IoT 장치에 대한 정보 중 IoT 장치의 상태를 기초로 제어 명령을 생성할 수 있다. 모니터링 장치는 제어 명령을 게이트웨이를 통해 IoT 장치에 전송할 수 있다(S540). IoT 장치는 게이트웨이를 통해 제어 명령을 모니터링 장치로부터 수신할 수 있으며, 제어 명령에 따라 동작할 수 있다. 한편, 도 1의 IoT 장치 및 모니터링 장치는 통신 노드일 수 있고, 다음과 같이 구성될 수 있다. 도 6은 본 발명의 일 실시예에 따른 통신 노드의 블록도이다. 도 6을 참조하면, 통신 노드는 프로세서, 메모리, 송신 모듈, 및 수신 모듈을 포함할 수 있다. 또한, 통신 노드는 저장 장치 등을 더 포함할 수 있다. 통신 노드에 포함된 각각의 구 성 요소들은 버스(bus, 660)에 의해 연결되어 서로 통신을 수행할 수 있다. 다만, 통신 노드에 포함된 각각의 구성요소들은 공통 버스가 아니라, 프로세서를 중심으로 개별 인터페이스 또는 개별 버스를 통하여 연결될 수도 있다. 예를 들어, 프로세서는 메모리, 송신 모듈 , 수신 모듈, 및 저장 장치 중에서 적어도 하나와 전용 인터페이스를 통하여 연결될 수도 있다. 프로세서는 메모리 및 저장 장치 중에서 적어도 하나에 저장된 프로그램 명령(program comman d)을 실행할 수 있다. 프로세서는 중앙 처리 장치(central processing unit, 원시 CPU), 그래픽 처리 장 치(graphic processing unit, GPU), 또는 본 발명의 실시예들에 따른 방법들이 수행되는 전용의 프로세서를 의 미할 수 있다. 메모리 및 저장 장치 각각은 휘발성 저장 매체 및 비휘발성 저장 매체 중에서 적어도 하나로 구성될 수 있다. 예를 들어, 메모리는 읽기 전용 메모리(read only memory, ROM) 및 랜덤 액세스 메모리(random access memory, RAM) 중에서 적어도 하나로 구성될 수 있다. 송신 모듈 및 수신 모듈은 상호간에 통신을 수 행할 수 있으며, 프로세서의 제어에 따라 동작할 수 있다. 한편, 송신 모듈은 다음과 같이 구성될 수 있다. 본 발명에 따른 방법들은 다양한 컴퓨터 수단을 통해 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독 으로 또는 조합하여 포함할 수 있다. 컴퓨터 판독 가능 매체에 기록되는 프로그램 명령은 본 발명을 위해 특별 히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 매체의 예에는 롬(rom), 램(ram), 플래시 메모리(flash memory) 등과 같이 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러(compiler)에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터(interpreter) 등을 사용해서 컴퓨터에 의해 실 행될 수 있는 고급 언어 코드를 포함한다. 상술한 하드웨어 장치는 본 발명의 동작을 수행하기 위해 적어도 하 나의 소프트웨어 모듈로 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다.이상 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2020-0090177", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시에에 따른 스마트 홈 시스템의 개념도이다. 도 2는 본 발명의 일 실시예에 따른 모니터링 장치의 블록도이다. 도 3은 본 발명의 일 실시예에 따른 인공 신경망의 개념도이다. 도 4는 본 발명의 일 실시예에 따른 인공 신경망 학습 방법의 흐름도이다. 도 5는 본 발명의 일 실시예에 따른 스마트 홈 모니터링 방법의 흐름도이다. 도 6은 본 발명의 일 실시예에 따른 통신 노드의 블록도이다."}
