{"patent_id": "10-2016-0011099", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0090589", "출원번호": "10-2016-0011099", "발명의 명칭": "생체신호 및 환경변화에 따른 조명제어장치", "출원인": "(주)에코메이텍", "발명자": "박철균"}}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "생체신호 및 환경변화에 따라 조명의 밝기 및 색상을 자동으로 조절하는 장치로서,사용자의 생체정보 및 환경정보를 획득하는 생체 및 환경정보 획득수단; 상기 생체 및 환경정보 획득수단과 연계하여 생체 정보 및 환경 정보를 수집하는 정보수집 단말기; 상기 정보수집 단말기로부터 수집한 생체정보 및 환경정보를 기초로 생체 및 환경 데이터 지수를 산출 및 융합하고, 퍼스널 생체데이터 패턴과 이동경로에 따른 환경 패턴을 분석하고, 각각 분석한 결과 정보를 기초로 개인취향을 분석하여 LED 조명 제어를 위한 프로파일을 생성하여 조명을 제어하는 지능형 조명관리 미들웨어; 및상기 지능형 조명관리 미들웨어에서 출력되는 조명 제어데이터를 기초로 LED조명의 밝기 및 색상을 제어하는LED 조명 컨트롤러를 포함하는 것을 특징으로 하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에서, 상기 생체 및 환경정보 획득수단은 사용자의 뇌파와 심전도 및 맥박을 생체 정보를 획득하고, 온도/습도/조도를 환경 정보로 획득하는 것을 특징으로 하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에서, 상기 정보수집 단말기는 상기 LED 조명 컨트롤러에서 전송된 조명 제어신호를 기초로 직접적으로LED 조명을 컨트롤하는 것을 특징으로 하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에서, 상기 정보수집 단말기는 생체 및 환경 정보 수집을 위한 애플리케이션을 이용하여 생체 및 환경정보를 수집하는 스마트폰을 이용하는 것을 특징으로 하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에서, 상기 정보수집 단말기는 생체 및 환경 정보에 따라 LED조명의 밝기 및 색상을 자동으로 제어한후, 사용자로부터 입력된 평가정보를 상기 지능형 조명관리 미들웨어에 전송해주는 것을 특징으로 하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "에서, 상기 지능형 조명관리 미들웨어는 상기 지수 산출 및 융합부와 생체데이터 패턴 분석부 및 환경패턴 분석부에서 각각 분석한 결과 정보를 기초로 개인 취향을 분석하고, 분석한 개인 취향에 따라 프로파일을생성한 후, 조명 제어 데이터를 생성하여 출력하는 개인취향분석 및 프로파일 생성부를 포함하는 것을 특징으로하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에서, 상기 개인취향분석 및 프로파일 생성부는 생체정보와 환경정보에 따라 추출한 감성 지수를 기반으로 LED 조명의 밝기 및 색상을 자동으로 조절하기 위한 조명 제어 데이터를 생성하는 것을 특징으로 하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에서, 상기 LED 조명 컨트롤러는 LED 조명의 빛을 표현하기 위한 수치 정보를 생성하되, ColorTemperature(색 온도), Brightness(밝기), CRI(Color Rendering Index: 연색지수)의 정보를 생성하여 NetworkInterface를 통해 라이팅 컨트롤러(Lighting Controller)에 데이터를 전송하는 유저 인터페이스; 상기 네트워크인터페이스를 통해 상기 유저 인터페이스나 다른 조명 모듈과 네트워크로 연결되어 데이터를 송수신하며, 유저인터페이스나 다른 조명 모듈로부터 수신된 데이터를 후단의 Color Mixer & Converter로 전송하는 라이팅 컨트롤러; 상기 라이팅 컨트롤러로부터 LED조명의 제어 신호를 수신하여 적합한 색의 조합을 결정하도록 구성되며,다수 색상 및 백색의 표현방법에 의해 주어진 값을 RGB LED에 적합한 제어 신호 데이터로 변환하며, 변환한 제어신호 데이터를 PWM 신호 발생기(Signal Generator)로 송신하는 컬러 믹서 및 컨버터; 상기 컬러 믹서 및 컨버터에서 출력된 제어신호 데이터를 기초로 개별적인 LED를 제어하기 위한 PWM 신호를 생성하며, LED 드라이버 인터페이스를 통해 생성된 PWM 신호를 송신하여 각 LED array를 제어하는 피더블유엠 신호 발생기; 상기 PWM 신호발생기로부터 생성된 PWM 신호를 LED 드라이버로 전달해주는 엘이디 드라이버 인터페이스; 상기 엘이디 드라이버 인터페이스에서 전달되는 PWM신호를 기초로 LED 모듈에 전압과 전류를 인가하여 구동하는 엘이디 드라이버를포함하는 것을 특징으로 하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에서, 상기 LED 조명 컨트롤러는 색상 센서, 온도 센서, 습도 센서를 이용하여 LED의 변화를 센싱하며,상기 센싱한 데이터를 기준 데이터와 비교하여 그 결과 데이터를 주변환경, 시간경과, LED 자체의 특성에 의해빛을 발산하는 특성 변화에 따른 LED 특성 변환을 보정하는 보정 데이터로 상기 라이팅 컨트롤러에 전달하는 엘이디 센싱 및 보상기를 포함하는 것을 특징으로 하는 생체신호 및 환경변화에 따른 조명제어장치."}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "생체정보(뇌파, 심전도, 맥박, 기타)와 환경정보(온도, 조도, 습도, 기타)를 기반으로 사용자의 감성 상태를 분 석하고, 이를 기반으로 조명(특히, LED 조명)의 밝기와 색을 자동으로 조절할 수 있도록 한 생체신호 및 환경변 화에 따른 조명제어장치에 관한 것이다. 사용자의 생체정보 및 환경정보를 획득하는 생체 및 환경정보 획득수단; (뒷면에 계속)"}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 생체신호 및 환경변화에 따른 조명제어장치에 관한 것으로, 특히 생체정보(뇌파, 심전도, 맥박, 기타)와 환경정보(온도, 조도, 습도, 기타)를 기반으로 사용자의 감성 상태를 분석하고, 이를 기반으로 조명(특 히, LED 조명)의 밝기와 색을 자동으로 조절할 수 있도록 한 생체신호 및 환경변화에 따른 조명제어장치에 관한 것이다."}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "감성 ICT 기술은 일상생활에서 인간의 감성변화에 의한 자율신경계의 활동에 의해 나타나는 생체신호 및 환경/ 상황신호, 영상신호, 음성신호 등을 센싱 할 수 있는 초소형/초정밀 센서 기술과, 센싱된 생체신호 및 환경신호 를 처리 및 분석하여 이를 기반으로 인간의 감성을 인식, 검증, 규격화하여 정보화하고, 사용상황에 맞게 정보 를 처리하여 감성 맞춤형 제품 및 서비스를 제공하는 기술이다.현재 연구되고 있는 여러 관련 분야들 중 LED 감성조명은 LED 조명이 주는 에너지 절감 효과를 극대화하고, 더 나아가 인간의 감성과 반응하는 효과를 제공할 수 있다. 이러한 추세를 반영하여 이미 외국 선진 업체들은 친환 경적인 LED를 개발하고 있으며, 우리나라 또한 시장의 변화에 빠르게 대응하고 있다. 국내의 조명 제어기술은 조명을 중앙 통제하는 시스템 기술, 센서로부터 인체를 감지하여 제어하는 기술, On/Off 및 디밍 제어기술, 플리커 제어 기술 등이 진행되고 있으나, ICT기반 조명 제어시스템 기술은 아직까지 미비한 수준이다. 국외에서는 Wi-Fi와 저전력 Bluetooth를 이용하여 가전이나 조명을 제어하는 IoT 기술을 개발 중이며, 구글 글 래스와 시계, 옷 등 다양한 웨어러블 디바이스와 연동한 기술 개발을 추진 중이다. 주지한 바와 같이, 이전의 조명은 필요한 밝기, On/Off의 제어, 조광과 같은 행위들을 사용자가 스스로 결정하 거나 시설되어 있는 조명설비의 초기 설정 값을 변경할 수 없어 이를 그대로 사용하는 수동 조명의 개념이었다. 이에 반해 ICT 기반 스마트 조명은 능동 조명의 개념이다. 조명이 필요한 공간에 대한 사용자의 움직임과 환경 특성 등을 감지하고, 상황 및 이벤트에 적합한 조명을 자동으로 연출하여 조명 고유의 기능뿐만 아니라 다양한 조명환경 및 기능을 조명장치 스스로 창출해 낼 수 있는 신개념의 조명시스템이다. 스마트 조명 시스템의 개발이 본격적으로 이루어진 시기는 LED라는 새로운 광원이 일반 조명에 적용되면서이다. LED는 구동전류를 감소시켜 최대광도의 1% 이내 범위까지도 조광이 가능하고, On/Off 동작에 따른 에너지 소모 및 광원수명의 단축이 발생하지 않기 때문에, 형광램프, 방전램프 등 조명에 사용되던 기존의 광원에 비해 제어 의 측면에서 유리하며, 점등·소등 속도가 매우 빠르다. 또한, 광원의 크기가 매우 작기 때문에 조명기구에 대 한 디자인적 자유도가 높고, 가스와 필라멘트 등을 사용하지 않으므로 환경오염이 적은 장점도 가지고 있다. IT 융합 스마트 조명에 대한 종래 기술이 하기의 <비 특허문헌 1> 내지 < 비 특허문헌 2> 에 개시되어 있다. <비 특허문헌 1> 에 개시된 종래기술은 환경, 인간의 행동, 감성, 생리, 건축 등의 각종 요소와 조명의 관계에 대한 지식을 바탕으로 LED, IT, 광학, 디자인, 센서, IC 등 다양한 기술을 접목함으로써 감성을 반영하고, 생활 의 편리함을 추구하며, TPO(Time, Place, Occasion)를 반영한 에너지 절감이 가능하도록 구성한 조명시스템을 제공한다. 또한, <비 특허문헌 2> 에 개시된 종래기술은 형광등, LED 디밍 조명, 시스템 조명 등과 같은 조명, 미관과 안 전성을 제공하는 조명기구, 조명제어 서버, 센서와 유무선통신을 연결하는 조명 인터페이스, 조명 제어 단말 등 으로 구성되어, 조명전기의 에너지 절감과 동시에 생활 편의를 만족하는 ICT 기반 자동제어 조명시스템을 제공 한다. 선행기술문헌 비특허문헌 (비특허문헌 0001) 김훈, 이민욱, IT융합 스마트조명 기술, 한국통신학회지, Vol. 28, No.5 Pages 10-14, 2011. (비특허문헌 0002) 정보통신산업진흥원, M2M기술 기반의 스마트 감성조명 개발 방향, 2012."}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러나 상기와 같은 종래기술은 학습을 위해서 많은 양의 생체 데이터를 수집하여 감성인식에 필요한 파라미터 를 훈련해야 한다. 따라서, 수집된 학습 데이터의 신뢰도가 이후 인식 시스템의 성능을 크게 좌우하는 단점이 있다. 또한, 종래의 감성인식 시스템은 과장되고 연출된 감정이 표현된 학습데이터를 사용하기 때문에, 사용자의 감성 을 최적으로 반영한 기술이라고 볼 수 없다. 이는 감성이 포함된 학습 데이터를 인공적으로 취득하는 것이 용이 하기 때문으로서, 실제 상황에서 감성인식 시스템의 성능이 저하되는 주요 요인 중 하나가 된다. 따라서 본 발명은 상기와 같은 종래기술에서 발생하는 제반 문제점을 해결하기 위해서 제안된 것으로서, 생체정 보(뇌파, 심전도, 맥박, 기타)와 환경정보(온도, 조도, 습도, 기타)를 기반으로 사용자의 감성 상태를 분석하고, 이를 기반으로 조명(특히, LED 조명)의 밝기와 색을 자동으로 조절할 수 있도록 한 생체신호 및 환경 변화에 따른 조명제어장치를 제공하는 데 그 목적이 있다. 본 발명의 다른 목적은 단일 생체신호만을 이용한 감성인지를 지양하고 여러 생체신호를 복합적으로 활용하거나 추가로 음성 및 표정 등의 감성 측정 지표를 활용하여 정확하게 감성을 판단할 수 있도록 한 생체신호 및 환경 변화에 따른 조명제어장치를 제공하는 것이다. 본 발명의 또 다른 목적은 LED 조명의 색과 조도가 인간의 감성과 상태에 영향을 미친다는 기존의 연구 결과를 바탕으로 스마트 빌딩에서의 감성조명 제어 미들웨어 시스템을 제공하여 사용자의 감성에 맞춰 자동으로 조명의 밝기와 색을 조절하도록 한 생체신호 및 환경변화에 따른 조명제어장치를 제공하는 것이다."}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여, 본 발명에 따른 생체신호 및 환경변화에 따른 조명제어장치는 사용 자의 생체정보 및 환경정보를 획득하는 생체 및 환경정보 획득수단; 상기 생체 및 환경정보 획득수단과 연계하 여 생체 정보 및 환경 정보를 수집하는 정보수집 단말기; 상기 정보수집 단말기로부터 수집한 생체정보 및 환경 정보를 기초로 생체 및 환경 데이터 지수를 산출 및 융합하고, 퍼스널 생체데이터 패턴과 이동경로에 따른 환경 패턴을 분석하고, 각각 분석한 결과 정보를 기초로 개인 취향을 분석하여 LED 조명 제어를 위한 프로파일을 생 성하여 조명을 제어하는 지능형 조명관리 미들웨어; 상기 지능형 조명관리 미들웨어에서 출력되는 조명 제어데 이터를 기초로 LED조명의 밝기 및 색상을 제어하는 LED 조명 컨트롤러를 포함하는 것을 특징으로 한다. 상기에서 생체 및 환경정보 획득수단은 사용자의 뇌파와 심전도 및 맥박을 생체 정보를 획득하고, 온도/습도/조 도를 환경 정보로 획득하는 것을 특징으로 한다. 상기에서 정보수집 단말기는 상기 LED 조명 컨트롤러에서 전송된 조명 제어신호를 기초로 직접적으로 LED 조명 을 컨트롤하는 것을 특징으로 한다. 상기에서 정보수집 단말기는 생체 및 환경 정보 수집을 위한 애플리케이션을 이용하여 생체 및 환경 정보를 수 집하는 스마트폰을 이용하는 것을 특징으로 한다. 상기에서 정보수집 단말기는 생체 및 환경 정보에 따라 LED조명의 밝기 및 색상을 자동으로 제어한 후, 사용자 로부터 입력된 평가정보를 상기 지능형 조명관리 미들웨어에 전송해주는 것을 특징으로 한다. 상기에서 지능형 조명관리 미들웨어는 상기 정보수집 단말기로부터 전송된 생체 정보 및 환경 정보를 데이터베 이스화하는 퍼스널 데이터베이스; 상기 퍼스널 데이터베이스에 저장된 생체 정보 및 환경 정보를 기초로 생체/ 환경 데이터에 대한 불쾌지수 및 감성지수를 산출하고 이를 융합하는 지수 산출 및 융합부; 상기 생체 정보를 기초로 퍼스널 생체데이터 패턴을 분석하는 생체데이터 패턴 분석부; 상기 환경 정보를 기초로 이동경로에 따란 환경 패턴을 분석하는 환경패턴 분석부; 상기 지수 산출 및 융합부와 생체데이터 패턴 분석부 및 환경패턴 분석 부에서 각각 분석한 결과 정보를 기초로 개인 취향을 분석하고, 분석한 개인 취향에 따라 프로파일을 생성한 후, 조명 제어 데이터를 생성하여 출력하는 개인취향분석 및 프로파일 생성부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 생체정보(뇌파, 심전도, 맥박, 기타)와 환경정보(온도, 조도, 습도, 기타)를 기반으로 사용자 의 감성 상태를 정확하게 분석하고, 이를 기반으로 조명(특히, LED 조명)의 밝기와 색을 자동으로 조절할 수 있 는 장점이 있다. 또한, 본 발명에 따르면 단일 생체신호만을 이용한 감성인지를 지양하고 여러 생체신호를 복합적으로 활용하거 나 추가로 음성 및 표정 등의 감성 측정 지표를 활용하여 정확하게 감성을 판단할 수 있는 장점도 있다. 또한, 본 발명에 따르면 LED 조명의 색과 조도가 인간의 감성과 상태에 영향을 미친다는 기존의 연구 결과를 바 탕으로 스마트 빌딩에서의 감성조명 제어 미들웨어 시스템을 제공이용하여 사용자의 감성에 맞춰 자동으로 조명 의 밝기와 색을 조절할 수 있는 장점이 있다."}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 바람직한 실시 예에 따른 생체신호 및 환경변화에 따른 조명제어장치를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 바람직한 실시 예에 따른 생체신호 및 환경변화에 따른 조명제어장치의 전체 구성도이다. 본 발명에 따른 생체신호 및 환경변화에 따른 조명제어장치는 생체 및 환경정보 획득수단, 정보수집 단말 기, 지능형 조명관리 미들웨어 및 LED조명 컨트롤러를 포함한다. 생체 및 환경정보 획득수단은 사용자의 생체정보 및 환경정보를 획득하는 역할을 한다. 이러한 생체 및 환 경정보 획득수단은 사용자의 뇌파와 심전도 및 맥박을 생체 정보를 획득하고, 온도/습도/조도를 환경 정보 로 획득하는 것이 바람직하다. 정보수집 단말기는 상기 생체 및 환경정보 획득수단과 연계하여 생체 정보 및 환경 정보를 수집하는 역할을 한다. 이러한 정보수집 단말기는 상기 LED 조명 컨트롤러에서 전송된 조명 제어신호를 기초로 직접적으로 LED 조명을 컨트롤할 수도 있다. 이 경우에는 정보수집 단말기가 리모컨과 같은 역할을 한다. 바람직하게, 상기 정보수집 단말기는 생체 및 환경 정보 수집을 위한 애플리케이션을 이용하여 생체 및 환 경 정보를 수집하는 스마트폰을 이용할 수 있다. 또한, 상기 정보수집 단말기는 생체 및 환경 정보에 따라 LED조명의 밝기 및 색상을 자동으로 제어한 후, 사용자로부터 입력된 평가정보를 상기 지능형 조명관리 미들웨 어에 전송해준다. 지능형 조명관리 미들웨어는 상기 정보수집 단말기로부터 수집한 생체정보 및 환경정보를 기초로 생 체 및 환경 데이터 지수를 산출 및 융합하고, 퍼스널 생체데이터 패턴과 이동경로에 따른 환경 패턴을 분석하고, 각각 분석한 결과 정보를 기초로 개인 취향을 분석하여 LED 조명 제어를 위한 프로파일을 생성하여 조명을 제어하는 역할을 한다. 이러한 지능형 조명관리 미들웨어는 상기 정보수집 단말기로부터 전송된 생체 정보 및 환경 정보를 데이터베이스화하는 퍼스널 데이터베이스; 상기 퍼스널 데이터베이스에 저장된 생체 정보 및 환경 정 보를 기초로 생체/환경 데이터에 대한 불쾌지수 및 감성지수를 산출하고 이를 융합하는 지수 산출 및 융합부 ; 상기 생체 정보를 기초로 퍼스널 생체데이터 패턴을 분석하는 생체데이터 패턴 분석부; 상기 환경 정보를 기초로 이동경로에 따란 환경 패턴을 분석하는 환경패턴 분석부; 상기 지수 산출 및 융합부와 생체데이터 패턴 분석부 및 환경패턴 분석부에서 각각 분석한 결과 정보를 기초로 개인 취향을 분석 하고, 분석한 개인 취향에 따라 프로파일을 생성한 후, 조명 제어 데이터를 생성하여 출력하는 개인취향분석 및 프로파일 생성부를 포함한다. LED 조명 컨트롤러는 상기 지능형 조명관리 미들웨어에서 출력되는 조명 제어데이터를 기초로 LED조 명의 밝기 및 색상을 제어하는 역할을 한다. 이러한 본 발명에 따른 생체신호 및 환경변화에 따른 조명제어장치의 동작을 구체적으로 설명하면 다음과 같다. 본 발명은 특정 공간에 주거하는 사용자의 감성에 기반하여 스마트 LED 조명을 자동으로 제어한다. 사용자의 생 체리듬 및 환경변화를 자동으로 감지하여 사용자에게 최적화된 조명시스템을 제공하는 것이다. 라이프로그 분석에 의하여 동시에 100개 이상의 LED 조명을 컨트롤할 수 있는 기술로서, 생체 및 환경 정보에 기반하여 감성조 명을 제공하는 IT 기술 융합 첨단 기술이며, 사용자의 편의와 삶의 질을 향상시킬 수 있는 효과적인 기술이다. 이를 위해, 생체 및 환경정보 획득수단은 사용자의 생체정보 및 환경정보를 획득하여 정보수집 단말기 에 전달한다. 생체정보는 뇌파와 심전도 및 맥박을 사용자의 감성을 분석하는 지표로 획득한다. 뇌파와 심전도 및 맥박은 기 존에 알려진 다양한 측정장치를 그대로 채택하여 측정하는 것이 바람직하다. 특히, \"락싸\"의 QEEG, QECG 제품을 이용할 수 있다. 아울러 QEEG-8은 동시에 8개의 부위에서 뇌파 측정이 가능하며, 측정 중 이벤트에 대한 마킹이 가능해 측정의 신뢰도를 높일 수 있다. 또한, QECG-3은 양 팔목, 양 발목에 전극을 부착하는 표준 사지유도법에 의해서 Lead Ⅰ, Ⅱ, Ⅲ 심전도 신호를 측정하며, 사지전극 부착방식이므로 착의/착석 상태에서도 심전도 측정이 가능하다는 장점이 있다. 환경정보는 온도/습도/조도 센서를 이용하여 온도/습도/조도를 환경 정보로 취득한다. 환경 센서는 알려진 다양 한 환경 센서를 그대로 채택하여 사용할 수 있으나, 본 발명자는 \"한백 전자\"의 HBE-ZigbeX Ⅱ를 이용하였다. 이렇게 획득되는 생체정보 및 환경정보는 정보수집 단말기로 전송된다. 여기서 생체 및 환경정보 획득수단과 정보수집 단말기 간에는 다양한 통신을 통해 획득한 데이터를 송수신하는 것이 가능하다. 환경 센서의 경우, ZigbeX 장비를 통해서 온도, 습도, 조도 데이터를 취득한다. ZigbeX는 9개의 싱크 노드로 구 성되어 있으며, 노드는 1개의 루트 노드와 8개의 서브 노드로 구성되어 있다. ZigbeX에서 온도, 습도, 조도를 측정하기 위한 센서는 SHT11이며, 센서모트의 CPU Pin과 직접적으로 연결되어 있다. SHT11 센서는 측정한 값을 디지털 신호로 바꾸는 AD 기능이 자체적으로 포함하고 있어 센싱한 데이터를 바로 CPU로 전송한다. 도 24는 SHT11 센서의 데이터 형태 예시이다. SHT11로부터 측정된 센싱 값을 읽기 위해서는 CPU와 연결된 두 라인을 통해 일정한 클록과 명령어를 입력시켜야 한다. 도 24는 CPU에서 센서로부터 측정된 데이터를 받기 위한 클록 타이밍과 명령어의 입력 방식을 보여준다. CPU는 데이터 라인을 통해 비트 단위의 명령어를 SHT11 센서와 주고받은 후 실제 센싱 값을 얻어온다. 데이터 라인은 클록 신호가 HIGH일 때만 값을 읽어 오며, 이때 데이터 라인의 신호는 변하지 않는다. 전송을 시작하기 전 전송 시작을 알리는 펄스를 먼저 입력한 후 주소 비트와 명령어를 SHT11에 보내고 센서 데이터를 읽어온다. SHT11 칩에 전송되는 명령어는 도 25와 같다. CPU는 명령어를 전송한 후, SHT11 센서가 습도 측정을 완료할 때까지 기다리게 된다. 12비트의 습도 데이터를 얻기 위해 약 55mx 정도의 시간이 소요된다. 측정이 완료되면 SHT11은 데이터 라인을 LOW로 만들어 준 후 CPU에 데이터를 전송한다. CPU는 데이터 라인을 통해 12비트의 측정된 데이터를 읽어온 후, CRC 에러 체크 필드의 내 용에 따라 ACK 전송 여부를 결정한다. 이때 데이터를 읽어 올 수 없다면 Reset을 통해 SHT11과의 접속을 갱신한 다. SHT11센서를 내장하고 있는 ZigbeX는 각각의 싱크 노드에서 측정된 온도, 습도, 조도에 대한 정보를 0번 싱 크(Root node)로 전송한다. 이때 각각의 노드에서 데이터가 전송되는 방식은 도 26과 같다. ZigbeX Mote를 통해서 환경 센서 정보 획득 방법으로서, TreeRouting 기법을 사용하여 Mote 간의 네트워크를 구 성한다. Sink 노드(root)인 Mote를 지정(Mote 0)하고, Sink 노드는 각각의 노드(Mote)에서 센싱된 데이터를 취 합한다. 시리얼 통신 통해 Sink 노드는 Server로 환경 센서 정보 전송한다. Server에서는 환경 데이터 확인 및 센싱 주기 설정이 가능하다. 여기서 서버는 정보수집 단말기가 되거나 지능형 조명관리 미들웨어가 될 수 있다. 다음으로, 뇌파/심전도 데이터 송수신 방식은 다음과 같다. 뇌파, 심전도, 맥박과 같은 생체신호 데이터는 환경 센서와 다르게 개인화된 데이터로서 웨어러블 장비와 블루 투스로 연결되어 스마트폰을 통해 수신된다. 스마트폰과 블루투스로 연결된 각각의 장비는 주기별로 데이터를 스마트폰으로 전송하게 되고, 이후 서버(지능형 조명관리 미들웨어)로 전송된다. 본 발명에서는 주지한 바와 같이, 뇌파와 심전도데이터 측정을 위해 QEEG-8, QECG-3 측정 장비를 사용했기 때문 에 TCP/IP를 통해 스마트폰과 연결한다. 뇌파의 경우 8개의 전극에서 취득되는 8채널 데이터로 1개의 패킷 당 42바이트가 전송된다. 샘플링 주파수는 256Hz로 초당 256 패킷을 전송해야 한다. 데이터의 구조는 도 27에 도시한 바와 같이, EEG/ECG를 구분하는 6바 이트 헤더와 1 ~ 256까지의 인덱스가 있으며, 채널당 4바이트의 Raw-data를 전송한다. 수신된 Raw-Data는 실시간 처리와 감성 정보 추론을 위해 2초 단위로 나눠진 데이터 큐에 저장된다. 2초의 버퍼 크기는 FFT를 통해 의미 있는 데이터를 수집할 수 있는 최소 단위다. 데이터 큐에 저장된 2초의 Raw-Data는 채 널별로 FFT를 통해 주파수 도메인으로 변경되며 이후 파워 스펙트럼을 통해 세타, 알파, 베타, 감마에 해당하는 주파수 대역의 파워 값으로 저장된다. 심전도의 경우 3개의 채널에서 취득되는 신호를 1개의 패킷 당 20바이트로 나뉘어 전송된다. 전송되는 패킷의 구조는 도 28에 도시한 바와 같이, ECG 신호임을 알리는 6바이트의 헤더와 인덱스, 데이터로 구성된다. 인덱스는 256Hz로 샘플링된 심전도 신호의 시간 데이터와 동기화할 수 있도록 1 ~ 256까지의 인덱스를 담은 2바 이트 데이터이며, Raw-data는 3개의 채널 각각 4바이트씩으로 구성되어 있다. 심전도 역시 초당 256 패킷이 전 송된다. 심전도 신호는 뇌파와 달리 구간을 나누지 않고 측정된 시간에서 발생하는 교감신경/부교감신경의 비율 을 관찰한다. 먼저, 심전도의 특성 중 하나인 Q, R, S 파형을 검출하기 위해 Moving Average Filter를 통해 신호의 높낮이를 완만하게 만든다. QRS 신호를 검출하기 위해서는 여러 가지 방법이 쓰이지만 본 발명에서는 기울기 검출을 통해 Positive Peak와 Negative Peak를 찾아 각각 Q, R S에 대한 신호로 검출한다. 검출된 QRS 신호에서 R파형간의 인덱스 거리를 나타내는 R-R interval을 추출하고 도 28의 좌측 하단과 같이 시간별로 변하는 R-R interval의 심박변이도(HRV)를 계산한다. 심박 변이도는 시간별로 변하는 사용자의 심박에 대한 시계열 데이터로 FFT와 스 펙트럼 분석을 통해 교감신경, 부교감신경의 정보를 취득할 수 있다. 맥박 정보는 스마트 밴드에서 블루투스로 연결된 스마트폰으로 전송된다. 본 발명에서 사용한 스마트 밴드는 삼 성 갤럭시 기어로 타이젠 OS 기반으로 된 스마트 밴드와 안드로이드 기반인 스마트폰 사이의 통신이 필요하다. 타이젠 블루투스 API를 통해 스마트 밴드에서 측정되는 사용자의 맥박 정보를 실시간으로 스마트폰으로 전송한 다. 스마트폰에 수신된 맥박 정보는 서버로 XML 파싱을 통해 저장된다. Post 방식으로 전송 폼에 맞게 파싱하면 서버에서 형식을 검사하고 DB에 입력한다. 정보수집 단말기는 상기 생체 및 환경정보 획득수단에서 획득한 생체정보 및 환경정보를 서버인 지능 형 조명관리 미들웨어에 전송한다. 여기서 생체 및 환경정보 획득수단에서 생체 정보 및 환경정보 획 득 및 전송과 정보수집 단말기에서 지능형 조명관리 미들웨어로 획득 정보를 전송하는 시점은 실시간 또는 미리 설정된 주기로 할 수 있다. 실시간으로 할 경우 너무 잦은 데이터 통신이 발생하므로, 감성을 충분히 전달할 수 있는 주기를 설정하고 주기적으로 발생하는 방식이 여러모로 적합하다고 할 수 있다. 다만, 주기적으 로 획득 정보를 전송하는 방식으로 운영할 경우, 실시간으로 정보를 획득하되 이벤트 발생(이전 대비 생체정보 나 환경정보가 변경된 경우)시에는 바로 이벤트 발생 시점에서 정보를 전송하는 것이 바람직하다. 다음으로, 지능형 조명관리 미들웨어는 상기 정보수집 단말기로부터 전송된 생체정보 및 환경정보를 퍼스널 데이터베이스에 등록한다. 여기서 정보수집 단말기는 단말기를 구분하기 위한 고유정보가 부 여된 것으로 가정한다. 따라서 퍼스널 데이터베이스에 생체정보 및 환경정보를 등록할 때 고유 정보를 기반으로 등록함으로써, 추 후 각각의 사용자별로 감성지수를 산출하는 것이 가능해진다. 상기 지능형 조명관리 미들웨어의 지수산출 및 융합부는 상기 퍼스널 데이터베이스에 저장된 생 체 정보 및 환경 정보를 기초로 생체/환경 데이터에 대한 불쾌지수 및 감성지수를 산출하고 이를 융합한다. 즉, 상기 지수산출 및 융합부는 획득한 생체정보와 환경정보의 취합을 통하여 감성지수를 산출하고, 산출 한 감성지수에 대응하는 색과 밝기로 LED 조명을 제어하기 위한 조명 제어데이터를 산출한다. 감성 분류를 위해 HP(Hewlett-Packard)의 \"The Meaning of Color\"에서 정해 놓은 20개의 컬러 감성 모델을 기 반으로 대표 컬러 요소를 선정하되, 도 2와 같은 생체리듬 지수에 따라서 5가지로 감성을 분류하여 감성지수 산 출 알고리즘에 적용한다. 아울러 뇌파와 심전도 데이터는 복합 생체신호 분석을 통해 생체 리듬 지수로 산출한다. 뇌파의 경우 델타, 알파, 베타, 감마에 해당하는 각각의 파형의 비율을 상대파워라고 하며, 사용자의 감성상태 를 판단하는 지표로 활용한다. 도 3은 각 파형의 주파수 대역과 상태를 나타낸 것이다.심전도의 경우 P, Q, R, S, T에 해당하는 특징을 갖는 파형이 반복된다. 여기서 R은 심전도 파형의 가장 높은 피크 값을 의미하며, R 피크의 주기는 사용자의 맥박을 의미한다. 도 4는 사용자의 심전도 데이터와 R 피크의 주기를 나타낸 것이다. 심전도의 R 피크 주기는 HRV(Heart Rate Variability)라는 시계열 데이터로 표현할 수 있다. HRV의 0.004 ~ 0.15Hz는 교감신경의 활동성의 지표이며, 0.15 ~ 0.4Hz는 부교감 신경의 활동성에 대한 지표이다. 본 발명에서는 심전도에서 교감신경과 부교감신경의 비율을 뇌파 상대파워와 함께 복합 생체 신호를 분석하는 특징 데이터로 사용한다. 아울러 심전도에서 검출된 맥박은 생체리듬 지수를 산출하는 보조 지표로 사용되어 복 합 생체신호의 신뢰도를 향상시킬 수 있다. 도 5는 맥박을 이용한 감성컬러 대응에 관한 표이다. 감성 지수를 추출하기 위한 정보는 주지한 바와 같이 생체신호 1(뇌파/심전도), 생체신호 2(맥박), 환경정보(온 도/습도/조도)로 이루어진다. 3가지의 정보를 종합해 사용자의 감성 지수를 추론한 후 사용자에게 필요한 조명 을 제공한다. 지능형 조명관리 미들웨어의 수신 데몬은 생체신호 1, 생체신호 2, 환경 센서 데이터를 수시로 수신받는다. 그 중 취득 주기가 가장 빈번한 환경 센서 데이터가 수신되면 새로운 Event를 생성한다. 도 29는 센서 데이터 수신과 이벤트의 정의 관계도이다. 하나의 Event는 사용자의 감성을 추론하는 기본 단위이다. 후술 하는 데이터베이스 구조와 같이, 환경 센서 데이터가 취득되면 Sensor Event는 수신된 데이터를 검사한다. Boo 형식으로 저장된 각각의 센서 튜플에 입력된 센서의 데이터를 True로 배정한다. 처음으로 환경 데이터 센서가 취득되면 조도(e_ILLU), 온도(e_Humi), 습도(e_Tempo) 값이 True로 변하면서 새로운 Event 번호가 추가된다. 다음 환경센서의 취득 주기가 오기 전에 ECG, EEG, Pulse와 같은 생체신호 데이터가 취득이 되면, 현재의 Event 번호에 속하게 되며 SensorEvent에서 현재 Event 번호에 해당하는 뇌파(e_EEG), 심전도(e_ECG), 맥박(e_pulse) 튜플 중 입력된 신호가 True로 변경된다. 이벤트 번호를 통해 들어온 데이터를 구분하고 검사하는 이유는 3가지 정보 중 누락되는 신호가 있더라도 감성 을 추출하고 조명을 제어하기 위해서이다. 예를 들어 Room 1에 환경 센서가 4개 부착되어 있고 안에 사용자가 없거나, 사용자가 1명 있지만 맥박 센서만을 착용하고 있을 경우와 같이 상황에 맞는 조명 제어를 제공하기 위 해 Event 번호와 주기를 검사한다. 수신 데몬에 입력되는 생체 신호는 각각의 신호에 맞는 전처리 과정을 통해 감성 지수 추출을 위한 정보로 정제 된다. 예컨대, 생체신호 1(뇌파/심전도) 데이터 생성은 다음과 같다. 뇌파의 경우 사용자의 각성 상태를 분석하기 위해 FFT를 통해 주파수 도메인으로 변경 후 파워 스펙트럼을 통해 쎄타(4~8Hz), SMR(12~15Hz), 미드베타(15~20Hz)의 파워 값을 추출한다. 일반적으로 쎄타는 수면, 명상과 같은 행위에서 높게 발생하며 SMR, 미드 베타파는 흥분, 각성 상태에서 높게 발생한다. 따라서 본 발명에서 하기의 [수학식 1] 을 통해 뇌파의 각성 상태를 분석한다. 수학식 1"}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 [수학식 1] 에서 알 수 있듯이 뇌파의 비 각성 상태와 각성 상태의 파형의 비율을 계산해 각성한 정도를 수식화한다. 심전도의 경우 수신된 데이터에서 Moving Average Filter와 QRS Detection을 통해 심전도의 Q, R, S 특징을 검 출한다. Q, R, S 특징 검출을 위한 Peak값 검출은 하기의 [수학식 2]를 이용하여 산출한다.수학식 2"}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "R 피크는 다음의 [수학식 3] 을 통해 시간의 차와 축적 시간으로 구성된 시계열 정보 HRV로 변환된다. 수학식 3"}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "HRV 역시 뇌파와 마찬가지로 FFT와 파워 스펙트럼 분석으로 교감신경(LF: 0.04 ~ 0.15㎐)과 부교감신경(HF: 0.15 ~ 0.4㎐)의 파워 값으로 변환된다. 교감 신경과 부교감신경은 평상시 일반 활동 중에 교감이 부교감 신경보다 6:4의 비율로 약간 더 활성화되어 있 는 것을 정상으로 본다. 따라서 본 발명에서는 자율신경계 비율(LF/HF)을 통해 사용자의 감성상태를 쾌, 불쾌로 분류한다. 일반적인 실 험에서 자율신경계 비율은 약 1.5가 정상치로 나타났고, 공포와 화남, 혐오와 같은 감성에서는 최대 2.5의 수치 를 보였다. 뇌파와 심전도 복합 생체 신호는 3개의 감성 지수 중 하나의 값으로 계산되며, 각성 상태에서 심전도의 교감신 경과 부교감신경 비율의 신뢰도가 더 높기 때문에 6:4의 비율로 하기의 [수학식 4]와 같이 심전도와 뇌파 신호 를 정의한다. 수학식 4"}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "맥박 데이터의 경우 Event번호 주기 내의 변화율의 평균값을 통해 사용자의 감성 정보를 추론한다. 도 30은 맥 박 평균값에 대한 생체신호지수 그리고 사용자의 추론 감성을 나타낸 것이다. 마지막으로 환경센서에서 입력된 데이터는 현재 공간의 불쾌지수를 계산할 수 있는 지수가 된다. 불쾌지수란 기온과 습도의 조합으로 사람이 느끼는 온도를 표현한 것으로 온습도지수(THI)라고도 하며, 개인에 따라 쾌감 대의 범위가 다른 것처럼 불쾌지수 값에 따라 불쾌감을 느끼는 정도도 개인에 따라 약간의 차이가 있 지만 실내환경의 쾌적 정도를 알 수 있기 때문에 사용자의 감성에 영향을 준다. 환경 센서는 온도, 습도, 조도의 데이터를 취득할 수 있지만, 불쾌지수는 센서의 온도, 습도 정보를 사용하며, 조도의 경우 출력된 LED 조명의 조도, 색 온도의 값을 확인하기 위해 사용된다. 불쾌지수는 다음과 같은 [수학 식 5] 로 산출된다. 수학식 5"}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서 T는 기온(℃), RH는 습도(%)를 나타낸다. 불쾌지수의 값에 해당하는 범위와 쾌적 상태는 하기의 도 31과 같다. 생체신호 1, 생체신호 2 그리고 환경 데이터를 통해 사용자에게 알맞은 조명을 제공하기 위해 3개의 지수를 정 규화하여 백분율로 표현한다. 정규화를 위해서는 각각의 데이터에 계수를 부여하고 감성지수를 산출해야 한다. 이때 각각의 신호에 대한 계수는 사용자의 평가 및 피드백을 통해 지속적으로 지수 산정 및 계수 조정이 이뤄지 고 훈련이 거듭 될수록 사용자에게 알맞은 맞춤 프로파일이 생성되게 된다. 감성지수의 정규화 및 최적화 과정 은 도 32와 같다. 다음으로, 생체데이터 패턴 분석부는 상기 획득한 개인별 생체 정보를 기초로 생체데이터 패턴을 분석한다. 생체데이터 패턴이란 생체 리듬을 판단하기 위한 패턴이다. 예컨대, 생체 리듬이 어떻게 변하는가 패 턴 분석한다. 이렇게 분석된 생체데이터 패턴 분석 정보는 개인 취향 분석 및 프로파일 생성부로 전달된다. 아울러 환경 패턴 분석부는 상기 획득한 해당 공간의 환경 정보를 기초로 환경정보의 패턴을 분석한다. 예 컨대, 환경 정보가 어떤 형태의 패턴으로 변경되는지를 분석한다 이렇게 분석된 환경 패턴 분석 정보도 개인 취 향 분석 및 프로파일 생성부로 전달된다. 상기 개인 취향 분석 및 프로파일 생성부는 상기 지수 산출 및 융합부에서 획득한 감성지수 및 불쾌 지수, 생체데이터 패턴 분석부 및 환경패턴 분석부에서 각각 분석한 생체 패턴 및 환경 패턴 정보를 기초로 개인 취향을 분석하고, 분석한 개인 취향에 따라 프로파일을 생성한 후, 조명 제어 데이터를 생성하여 출력한다. 여기서 개인 취향에 따른 프로파일을 생성할 때, 감성지수, 사용자의 성별/연령대별 불쾌지수와 연동된 LED 색 온도 데이터베이스를 구축하고, 축적된 데이터에 대한 마이닝 기술을 활용하여 자동으로 최적 환경정보를 도출 하고, 그에 대응하는 LED 조명 데이터를 산출하여 LED 조명 컨트롤러로 전송한다. 도 6은 환경정보를 이용한 대응색상의 예시이다. 예컨대, 상기 개인 취향 분석 및 프로파일 생성부는 위에서 언급된 3종류의 사용자 관련 데이터인 생체데 이터 1(뇌파, 심전도)/생체데이터 2(맥박)/환경데이터(온도, 습도, 조도)를 수집하고 정규화하여, 이를 기반으 로 각각에 대한 생체리듬지수 및 환경지수를 계측한다. 이어, 도 7과 같은 과정을 거쳐 생체 및 환경 데이터에 기반한 감성지수를 도출하고 이를 통하여 LED 색상을 제 어한다. 3가지의 데이터를 통해 추론된 감성 지수는 사용자가 필요로 하는 조명의 색상으로 정의할 수 있다. 먼저, 감성 지수별 조명 색상을 정의하기 위해 감성에 대한 평가가 이루어져야 한다. 감성공학 영역에서 연구된 컬러 이미지스케일(Color image scale)과 형용사 이미지 스케일(Adjective image scale)을 이용해 일반 사용자 가 느끼는 감성과 색상이 어떻게 매칭되는지 알 수 있다. 각각의 색채가 지닌 특정한 이미지를 측정하고 전체적으로 나타내 보기 위한 방법으로는 XY좌표를 사용하는 이 미지 스케일이 있다. 이미지 정도를 측정하기 위한 좌표의 X축과 Y축에 어떠한 요인을 설정하기 위해서는 우선 이미지 평가에서 가장 중요하게 영향을 미치는 요인을 파악할 필요가 있다. 도 33은 정적인-동적인 이미지가 X축을 나타내고, Y축은 부드러운-딱딱한 이미지를 나타낸다. 이러한 이미지 스 케일은 그 내부 공간에 색채 이미지의 전체를 담아 볼 수 있다는 가정에서 만들어진 척도 개념이다. 도 34는 색체의 감성 척도별로 나열한 감성 언어의 척도이다. X축 동적인-정적인 어투에서 Y축 부드럽고 딱딱한 이미지의 언어들을 통해 인간의 감성에 매칭되는 색상을 유추할 수 있다. 두 척도를 매칭해서 보면 전체적으로 색상에서 난색은 주로 부드러운 쪽에, 한색은 주로 딱딱한 쪽에 치우쳐 있 는 것을 알 수 있다. 그러나 톤에서는 밝은 톤이 부드럽고, 정적인 이미지에 있고, 어두운 톤은 동적이고 딱딱 한 이미지에, 수수한 톤은 정적이고 딱딱한 이미지에, 화려한 톤은 동적이고 부드러운 이미지에 치우쳐 있음을 알 수 있다. 즉, 색상보다는 톤이 세부적인 감성을 변화시키는 데 더 중요한 변수임을 알 수 있다. 따라서 본 발명은 이러한 색채 감성과 감성언어의 매칭된 색상의 신뢰도를 높이기 위해 각각의 감성 언어에 대비되는 색 온도를 정의하고, LED 조명에 반영할 수 있도록 RGB값으로 변환하는 알고리즘을 제안한다. 본 발명에서 사용자의 감성을 정의하기 위해 사용된 감성 언어는 도 34에서 정의된 언어 중 중복된 언어를 삭제 하고 일반적으로 사용자가 느낄 수 있는 언어들로 도 35와 같이 선정하였다. 또한, 선정된 감성 언어들은 활동성, 안정감, 역량성으로 분류할 수 있다. 예컨대, 상쾌하다-불쾌하다, 선명하 다-희미하다와 같은 언어는 활동성의 요인으로 정의할 수 있으며, 따뜻하다-시원하다, 편안하다-불안하다와 같 은 언어는 안정감에 대한 요인으로, 강렬하다-은은하다, 화려하다-수수하다와 같은 언어들은 요인으로 정의할 수 있다. 선정된 언어들을 평가하기 위한 색 온도는 3800[K], 5800[k], 8300[K]의 조명으로 기존에 연구된 결과 활동적인 요인에서는 8300[K] > 5800[K] > 3800[K] 순으로 선호하며, 안정적인 요인에서는 3800[K] > 5800[K]> 8300[K] 순으로, 역량성 요인에서는 강렬하거나 화려한 색상의 요인으로 색 온도가 가장 높은 8300[K]이 선호되었다. 따라서 본 발명에서는 기존에 연구되었던 색 온도와 감성평가의 결과를 응용하여 사용자의 활동적인 감성 그리 고 우울한 감성을 기준으로 도 36과 같이 알맞은 색 온도를 정의했다. 예를 들어 각성된 상태의, 지나치게 활성 된 감성에는 낮고 차가운 3800[K]의 조명을 제공하고, 우울하고 위축된 감성에서는 활기차고 밝은 8300[K]의 조 명을 제공하는 방식으로 정의한다. 색 온도는 광원의 색을 수치로 나타낸 것으로, 이상 흑체에 열을 가열했을 때 흑체가 나타내는 색을 의미한다. 따라서 LED 조명에 적용하기 위해서는 색 온도를 RGB 값으로 변환해야 한다. 먼저, 색 온도에 해당하는 도 37과 같은 CIE 1931 색도 좌표계의 x, y 좌표로 변환한다. 색도 좌표계의 x, y를 통해 하기의 [수학식 6] 을 통해 CIE XYZ 색공간으로 변환한다. 수학식 6"}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "CIE XYZ 색 공간을 하기의 [수학식 7] 을 이용하여 CIE RGB 색 공간으로 변환한다. 수학식 7"}
{"patent_id": "10-2016-0011099", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "CIE 1931 색도 좌표계에 대입을 통해 정의된 8300[K] ~ 3800[K] 색 온도의 RGB값은 도 38과 같으며, 도 39는 색온도에 해당하는 RGB값의 분포도이다. 상기와 같은 조명 데이터(조명 밝기 및 색상)를 산출하기 위한 지능형 조명관리 미들웨어는 도 8과 같다. 도 8과 같은 지능형 조명관리 미들웨어는 다가구의 환경에서 사용자 각각의 개인화와 감성 조명 제어를 위 해 개발한 것이다. 미들웨어의 입력 데이터로는 주지한 바와 같이 사용자의 감정 정보(생체정보)와 환경정보를 취득하기 위한 센서 디바이스를 이용한다. 먼저, 감정 정보(생체 정보)는 뇌파 측정기기와 생체신호 기반 센서 장비가 있으며, 환경정보로는 온도, 습도, 조도와 같은 환경센서가 있다. 미들웨어는 생체정보 및 환경정보를 취합해 생체리듬지수/불쾌지수에 의한 사용 자 감성지수를 산출하고, 최종적으로 조명을 감성대응 색상으로 구현하는 역할을 한다. 감성조명 제어를 위한 미들웨어의 데이터 흐름은 도 9 및 도 10과 같다. 즉, 실시간으로 취득되는 생체 및 환경 스트림 데이터는 Metadata Extractor를 통해서 정제되고, 정제 된 데이터는 User Metadata Registry와 Emotion Data Warehouse에 저장한다. 이어, 생체신호와 웨어러블 디바 이스를 통해 구분된 개인 ID를 바탕으로 사용자의 감정 상태 및 환경상황은 Multi-level Reasoning에 의해 정리 되고, 이렇게 추출된 정보를 바탕으로 개인화 프로파일을 구축하면서, 현재 사용자에게 최적화된 색 온도 및 조 도를 자동으로 판별한다. 이어, 미들웨어에서 자동으로 판단된 최적의 색 온도/조도 정보는 무선을 통해서 LED조명 컨트롤러로 전달되어 실내외 조명을 조절한다. 한편, 대부분의 웨어러블 디바이스가 블루투스 통신만 제공하거나, 일부 WCDMA 칩이 장착된 웨어러블 디바이스 의 경우에도 저장장치 공간이 극히 협소하므로, 실시간으로 취득되는 생체신호 데이터는 사용자가 소유한 스마 트폰에 일차적으로 저장할 필요성이 있다. 이를 위하여 블루투스/Wi-Fi/WCDMA를 통해 웨어러블 디바이스로부터 취득된 생체정보 및 블루투스/Wi-Fi를 통해 취득된 환경정보를 취합/정제/임시저장하고, 생체/환경정보를 지능형 조명관리 미들웨어로 실시간 스트림 송신해야 한다. 따라서 스마트폰인 정보수집 단말기에 \"사용자 개인정보 설정 및 관리 앱\"을 내장시켜, 감 성지수/조명상태 등 종합된 조명관련 정보를 사용자에게 제공하고, 사용자의 Feedback을 상기 지능형 조명관리 미들웨어로 송신하도록 한다. 여기서 사용자 개인정보 설정 및 관리 앱은 사용자의 이동 경로 및 스마트폰 에 내장된 센서정보를 라이프로그 형태로 저장/관리하고 이를 지능형 조명관리 미들웨어로 전송하는 기능을 담 당한다. 사용자가 본인의 개인정보를 관리 및 확인할 수 있는 기능도 함께 구현하는 것이 바람직하다. 또한, 사용자의 상황 및 편의를 고려하여 사용자가 직접 조명 시스템을 제어할 수 있도록 한다. 즉, 스마트 디 바이스 애플리케이션을 통하여 사용자가 손쉽게 직접 조명제어가 가능하도록 한다. 이 경우 스마트폰인 정보수 집 단말기가 리모컨과 같은 역할을 하여, 정보수집 단말기를 이용하여 직접 조명을 제어한다. 도 11은 상기 개인정보 설정 및 관리 앱의 메인 설계 화면 예시이다. 사용자는 개인정보 설정 및 관리 앱을 통 해 조명의 설치 위치와 개인 정보를 열람 및 수정한다. 도 12는 사용자의 위치를 기반으로 조명 정보가 변화하는 것을 설명하기 위한 예시 도이다. 사용자가 특정 위치 (예를 들어, Room1)를 선택하면, 사용자의 위치에 해당하는 센서 정보들이 통합되어 조명을 제어한다. 사용자는 상기 개인정보 설정 및 관리 앱을 통해 현재 센서들의 정보를 열람할 수 있다. 여기서 센서 정보의 열람 기능은 다음과 같다. 현재 환경/생체 정보 내용, 현재 환경/생체 정보 표시 및 최종 측정 일시 표시, 과거의 환경 정보 확인(환경 정 보 항목 클릭 -> 항목별 그래프), 과거의 생체 정보 확인(생체 정보 항목 클릭 -> 항목별 그래프)을 포함한다. 사용자는 상기 개인정보 설정 및 관리 앱을 통해 생체 신호에 대한 그래프와 조명을 컨트롤한다. 도 13은 생체 정보 그래프와 조명 컨트롤 관계 예시이다. 생체 정보는 앱을 통해 수신되어 지능형 조명관리 미들웨어로 전송되기 때문에 실시간으로 취득되는 신호를 확인하여 모니터링 할 수 있다. 사용자는 현재 제어된 조명 상태가 마음에 들지 않거나 다름 조명을 원할 경우 상기 개인정보 설정 및 관리 앱 을 통해 새로운 조명으로 변경할 수 있다. 이때 변경된 조명은 사용자의 피드백으로 감성지수 계산의 지수를 변 경하는 변수로 작용한다. 도 14는 상기 LED 조명 컨트롤러의 실시 예 구성도이다. 도 14에 도시한 바와 같이, LED 조명 컨트롤러는 교류 정류기(AC Rectifier), 역률 보상기(PFC; Power Factor Corrector), 직류/직류 컨버터(DC/DC Converter) 및 LED 스트링 제어기(LED String Controller)를 포함한다. 도 14에 도시한 바와 같이, 특수 전력 전자식 마이크로 컨트롤러를 사용해 조명용 전력 공급 구성품의 비용을 고차원적인 통합을 통해 절감한다. 충분한 성능과 전력 최적화 장치 및 통신 포트를 가진 단일 마이크로컨트롤 러는 조명 시스템의 세 가지 주요 구성품 모두를 잠재적으로 제어할 수 있다. 이러한 고차원적인 통합 조명 시 스템을 통해 중앙 프로그래머블 플랫폼은 지능형 조명 시스템의 모든 단계를 조화롭게 제어할 수 있을 뿐만 아 니라 과도한 여러 구성품을 잠재적으로 제어할 수 있다. 여기서 LED 조명 컨트롤러는 고출력 LED 드라이버의 한계점인 고속 디밍 제어를 구현한다. 도 15는 고속 디밍 제어를 위한 고출력 LED 드라이버의 실시 예 회로도이다. 인덕터 전류 선구동방식의 PWM 디밍 제어 알고리 즘을 이용하였으며, 추가로 디밍 신호 지연회로를 이용하였다. 기존의 LED 드라이버에 인덕터 전류 선구동방식을 적용하기 위해서, 지연된 디밍신호들을 발생시켜 줄 디밍 신 호 제어기를 부가하였다. 디밍 신호 제어기는 도 16에서 라이징 엣지 트리거 D-플립플롭과 논리 게이트를 조합 하여 구현된다. 이러한 디밍 신호 제어기는 도 17에 도시한 바와 같이, 컨버터 일체형으로 제작하되 DC 12V에서 동작하는 LED 모듈 구동제어용 스위치를 적용한 디밍 제어기를 설계하여 구동회로와 LED 모듈 사이에 장착한다. 한편, 본 발명은 LED의 색상 제어가 가능하다. RGB LED 디머의 경우 기존 사용 MCU 모듈을 활용하였다. 도 18은 LED RGB 컨트롤러의 사양이다. RGB LED 조명을 제어하기 위한 기본 구성은 도 19에 도시한 바와 같이, 유저 인터페이스(User Interface), 네트워크 인터페이스(Network Interface), 라이팅 컨트롤러(Lighting Controller), 컬러 믹서 및 컨 버터(Color Mixer & Converter), 피더블유엠 신호 발생기(PWM Signal Generator), 엘이디 드라이버 인터페이스(LED Driver Interface), 엘이디 드라이버(LED Driver), 엘이디 센싱 및 보상기(LED Sensing & Compensation), 파워 컨트롤러(Power Controller) 및 엘이디(LED) 모듈로 구성된다. 상기 유저 인터페이스는 LED 조명의 빛을 표현하기 위한 수치 정보를 생성하되, Color Temperature(색 온 도), Brightness(밝기), CRI(Color Rendering Index: 연색지수) 등의 정보를 생성하여 네트워크 인터페이스 (Network Interface)를 통해 라이팅 컨트롤러(Lighting Controller)와 데이터 정보를 송수신한다. 상기 네트워크 인터페이스는 유선 네트워크와 무선 네트워크로 나누되, 유선 네트워크 방식은 UART, USB, IEEE1394, Ethernet, DALI, DMX512 등을 선택적으로 적용하며, 무선 네트워크는 ZigBee, Bluetooth, IrDA, VLC, Wireless LAN 등을 선택적으로 적용한다. 또한, 상기 라이팅 컨트롤러는 네트워크 인터페이스를 통하여 유저 인터페이스나 다른 조명 모 듈과 네트워크로 연결되어 데이터를 송수신하도록 구성되며, 유저 인터페이스나 다른 조명 모듈로부터 수 신된 데이터는 컬러 믹서 및 컨버터(Color Mixer & Converter)로 제어 신호를 전송하고, 컬러 믹서 및 컨 버터(Color Mixer & Converter)와 LED 센싱 및 보상기로부터 수집된 데이터를 유저 인터페이스(42 1)나 다른 조명 모듈의 요구에 의해 데이터를 전송해 주도록 구성하여, LED 조명의 원활한 동작을 위한 전체적 인 데이터의 흐름을 제어한다. 아울러 상기 컬러 믹서 및 컨버터는 라이팅 컨트롤러로부터 LED조명의 제어 신호를 수신하여 적합한 색의 조합을 결정하도록 구성되며, 다양한 색상 및 백색의 표현방법에 의해 주어진 값을 RGB LED에 적합한 제어 신호 데이터로 변환되도록 구성하여, 변환된 제어신호 데이터를 RGB PWM 신호 발생기로 송신한다. 다음으로, 피더블유엠 신호 발생기는 개별적인 LED를 제어하기 위한 PWM 신호를 생성하도록 구성하며, LED 드라이버 인터페이스를 통해 생성된 PWM 신호를 송신하여 각 LED array를 제어하기 위한 채널을 다수 포함 한다. 아울러 엘이디 드라이버 인터페이스는 PWM 신호 발생기로부터 생성된 PWM 신호를 LED 드라이버 로 전송해 준다. 이때, PWM신호 전달 방식은 3가지 방식(직접연결방식, I2C(Inter-IC), SPI(Serial Peripheral Interface))을 이용할 수 있다. 또한, 엘이디 드라이버는 Driver IC가 LED 모듈에 전압과 전류를 인가하여 구동하도록 구성하되, 다 양한 종류가 있으므로 선정된 RGB LED에 적합한 Driver IC는 선별하여 적용하는 것이 바람직하다. 아울러 엘이디 센싱 및 보상기는 주변환경, 시간경과, LED 자체의 특성에 의해 빛을 발산하는 특성이 변하 기 때문에 본래 가지고 있는 LED 특성으로 보정시켜주는 역할을 하며, 색상 센서, 온도 센서, 습도 센서 등을 이용하여 LED의 변화를 센싱하도록 구성한다. 이렇게 센싱된 데이터를 기준 데이터와 비교한 후 보정 데이터를 라이팅 컨트롤러로 송신하여 LED 모듈이 보정된 데이터로 제어되도록 한다. 상기 파워 컨트롤러는 RGB LED를 구동하기 위한 정전류 회로를 포함하며, LED 모듈에 원활한 전력을 공급한다, 정전류 구동을 위한 전류 센싱 회로가 포함되어 있다. 이때, LED조명의 밝기 조절은 Red LED, Blue LED, Green LED를 기본적으로 제어하여 다양한 색을 연출한다, 부 가적으로 Warm White LED, Cool White LED, Amber LED가 추가되어 전체적인 조명의 밝기를 조절한다. 각 LED는 개별로 제어가 가능하며 각 LED의 특성에 따라 해상도(resolution)를 달리할 수 있다. 또한, 플리커링 (flickering)을 없애기 위해 조명에 인가되는 PWM 신호의 반복 주기는 조절이 가능하며, LED 칩마다 다른 특성 을 고려하여 조명에 인가되는 PWM 신호의 반복 주기 역시 조절이 가능하다. LED의 순방향 전압과 순방향 전류의 비선형 특성을 고려하여 밝기를 제어한다. 전류 원의 전류 공급을 일정하게 유지하면서 전압을 on/off에 의한 모듈레이션을 통해 밝기(brightness)를 조절할 수 있다. 또한, 전압 원의 전압 공급을 일정하게 유지하면서 전류에 의한 밝기(brightness) 조절도 가능하다. 이러한 RGB LED 컨트롤러의 전체구성은 확장성을 고려하여 “MAIN(메인)\"과 \"SUB(서브)\" 두 종류로 구성하여, 이러한 구성요소들(유저 인터페이스, 네트워크 인터페이스, 라이팅 컨트롤러, 컬러 믹서 및 컨버터, 피더블유엠 시그널 제너레이터, 엘이디 드라이버 인터페이스, 엘이디 드라이버, 엘이디 센싱 및 보상기, 파워 컨트롤러 및 LED 모듈)이 적절하게 구현된다. 도 20은 RGB 컨트롤러 시스템의 전체 구성도이다. 인체 및 환경 정보를 PC로 전송하면, PC는 인체 및 환경 정보 데이터를 스마트폰과 제어 박스(Control Box)로 전송한다(UTP 케이블 혹은 무선 랜 사용). 스마트폰은 앱을 사용하여 PC에 접속하며, PC로부터 전송받은 인체, 환경 정보를 받아 컨트롤 박스를 제어한다(블루투스 이용). PC 또는 모바일 스위치는 메인 컨트롤 박스를 제어 하는 기기(PC, Mobile) 선택 스위치로서, 초기 세팅은 RS-485를 이용한다. 메인 컨트롤 박스의 마스터 MCU에서 선택하도록 구현하는 것이 바람직하다. PC 선택시 모바일 제어는 불가능하며, 모바일 선택 시 PC 제어는 불가능 하다. AC/DC 컨버터는 메인 컨트롤 박스의 구동 전원 및 조명기구에 전원을 공급해주는 역할을 한다. 마스터 MCU는 PC 및 모바일로부터 전송받은 데이터를 취합하여 각 슬레이브 MCU에 컬러, 디밍 신호를 전송하는 역할을 한다. 슬레이브 MCU 및 LED 드라이브는 마스터 MCU로부터 전송받은 컬러, 디밍 신호를 사용하여 LED 드라이브회 로를 제어하는 역할을 한다. LED Lighting는 LED 조명 기구로서, RGB 및 Warm, Cool 점등을 한다. 도 21은 감성 조명 제어를 위한 미들웨어 데이터베이스 구조이다. 도 1의 지능형 조명관리 미들웨어의 구 조를 의미한다. 도 21에서 클라이언트(Client)는 권한에 따라 관리자/사용자/보조사용자로 나뉠 수 있다. 관리자는 사용자의 요 구에 의해 Room을 생성할 수 있다. Room은 사무실, 주거공간을 의미하며, 한 대의 Controller를 포함하고 Controller는 다수의 LED와 Sensor를 제어한다. 사용자는 LED를 제어할 수 있다. 제어 가능 범위는 on, off, 색상 변경이며, 제어할 때마다 Control_History를 남긴다. 관리자는 Room에 LED, Sensor를 생성할 수 있다. LED, Sensor는 Controller의 CTR_ID를 외래 키로 사용하며 Controller는 Room의 R_ID를 외래 키로 사용해 방에 설치된 제어기의 상태를 확인할 수 있다. 센서데이터에서 주기적으로 데이터가 저장될 때 Event가 발생한다. Event 번호는 센서데이터와 맵핑되어 저장된다. 도 22는 감성 조명 제어 미들웨어 데이터베이스에서 LED, Room, Sensor의 정의 예시이다. 사용자는 관리자에게 요청해 자신의 사무실, 주거공간에 LED, Sensor에 대한 관리를 할 수 있다. 관리자는 사용자의 요청에 의해 Room을 정의한다. Room은 주키 R_ID에 의해 정의되며 주소와 사용자 이름, 등을 저장한다. Controller는 사용자 의 Room에 설치되며 LED와 Sensor를 제어하는 역할을 한다. Controller와 Room은 Room의 R_ID를 통해 연결된다. Controller는 다수의 Sensor와 LED를 제어한다. LED와 Sensor는 Controller의 CRT_NUM을 통해 연결 된다. LED와 Sensor는 각각의 설정 값과 on/off 상태, 그리고 현재의 동작 상태를 저장하며 주거 공간에 설치된 위치를 X, Y, Z 좌표로 저장한다. 웹페이지에서는 이 X, Y, Z 좌표를 통해 설치된 위치를 정의할 수 있다. 도 23은 감성 조명 제어 미들웨어 데이터베이스의 데이터 통신 예시이다. 사용자와 Event는 1 : 다로 구성되어 있다. 센서는 정해진 주기마다 서버와 통신해 센서 데이터를 전송한다. 이때 매 주기를 Event로 정의한다. 서버 (지능형 조명관리 미들웨어)는 데이터 수신 데몬을 구성해 센서와 통신한다. 센서에서 데이터를 취득하는 주기 를 설정할 수 있으며, 사용자의 상태를 분석하기 위한 데이터의 구간을 설정할 수 있다. 한편, 제안한 감성 조명 제어 미들웨어를 통해 실제 사용자의 감성을 추론하고 어울리는 조명을 제어함을 보이 기 위해 감성 조명 제어 시뮬레이션과 실험을 진행하였다. 도 40은 실험을 위해 사용된 연구실의 사진이다. 실험에 사용된 장소는 가로 15m, 세로 8m, 넓이 120㎡(약 36평)에 해당하는 연구실에서 총 8개의 환경센서를 이 용하여 실험을 진행하였다. 실험을 위해 5명의 20대 남녀의 피험자가 각각 뇌파, 심전도, 맥박을 측정하고 해당 주기에 사용자가 관리 앱을 통해 현재 위치를 적용했다. 시뮬레이터는 사용자의 생체신호 1, 생체신호 2, 환경 센서의 데이터를 통해 감성 지수를 추론하고 그에 맞는 조명을 정의해 시뮬레이터 상에 표시한다. 도 41은 감성조명 미들웨어 실험을 위한 도면과 센서 부착 예시이다. 실험을 위해 실험 장소의 기둥에 센서를 설치했다. 기둥 간의 거리는 약 5미터로 센서들 간의 통신이 원활하도록 센서의 거리를 조금씩 수정했다. 0번 노드는 실험 장소의 중앙에 위치하며 센서들이 통신 중 0번 노드를 발견하면 데이터를 송신할 수 있도록 하였다. 도 42는 실험 장소에 연결된 각 센서들의 연결 설정과 입력되는 온도, 조도, 습도 값이 들어오는 것을 확인한 도면이다. 실험 장소를 3등분 하여 하나의 공간 안에 3개의 Room을 설정하였다. 이는 하나의 큰 주거 공간에서 벽으로 나 눠진 독립적인 공간에서 조명과 환경 센서가 각각 다르게 적용되는 것을 확인하기 위함이다. 하나의 방은 각각 4개의 센서를 통해 인지되며, 도 43과 같이 각각의 룸에 해당하는 센서들을 이용하여 시뮬레 이션을 하였다. 본 발명에서 제안한 미들웨어의 실험을 위해 수신 서버와 동일하게 작동하는 도 44와 같은 시뮬레이터를 개발하 였다. 실험 장소에 설치된 8개의 환경 센서는 3분을 주기로 시뮬레이터(수신 서버)에 정보를 전송한다. 시뮬레이터의 PC에는 감성 추론 모듈과 웹 서버를 포함하고 있어 수신되는 환경센서 데이터뿐만 아니라 뇌파, 심전도, 맥박을 실시간으로 분석하고 데이터베이스 저장한다. 시뮬레이터는 데이터베이스에 저장된 분석 결과를 통해 감성을 추 론하고 사용자에게 분석 결과를 보여준다. 시뮬레이터의 좌측은 사용자 감성, UserData, Emotion Result, SensorData 메뉴로 각각 분석되는 과정에 해당 하는 정보를 표시한다. SensorData 그룹은 선택된 센서의 정보값을 불러오며, Emotion Result 그룹은 사용자가 앱을 통해 현재 위치를 선택하면 사용자 프로파일과 해당 지역의 환경 센서 값을 포함해 감성지수를 계산한다. 마지막으로 사용자 감성 그룹은 계산된 감성 지수를 통해 사용자의 감성단계와 조명 색상을 보여준다. 도 45는 감성 조명 미들웨어 시뮬레이터에서 센서 데이터 열람 예시이다. 본 발명의 실험을 위해 8개의 센서를 설치하고 24시간 데이터를 축적시켰다. 시뮬레이터에 포함되어 있는 도면 에서 센서 아이콘을 클릭하면 도 45와 같이 해당 센서의 현재 온도, 습도, 조도 그리고 센서를 통해 계산된 불 쾌지수를 확인할 수 있다. 본 실험에서 사용자는 별도로 QEEG-8, QECG-3 장비를 통해 뇌파와 심전도를 측정하고 서비스 관리 앱으로 전송 했다. 도 46은 뇌파, 심전도, 맥박 데이터가 삽입되었을 때, 그리고 사용자가 Room 1에 위치함을 알렸을 때 생 성된 실험 결과이다. 뇌파는 각성 지수를 통해 계산되고 심전도는 자율신경계 비율을 통해 계산되어 각각 0.4, 0.6의 지수로 계산된 결과가 56.6이 나왔다. 맥박의 경우 측정 시간의 평균값이 102.4가 기록되었으며 감성 지수 적응 표에 의해 60 으로 정의되었다. 마지막 환경 센서는 센서 1, 2, 3, 4의 평균값으로 온도 27.3, 습도 38%가 나와 불쾌지수 85.755로 정의되었다. 감성지수는 생체신호 1 = 56.6, 생체신호 2 = 60, 환경센서 = 85.755로 초기 지수값 0.3: 0.3: 0.4로 계산되어 감성지수 69.282로 추론되었다. 해당 감성 지수는 지수 대응 표에서 활발한 상태로 정의되었고 조명은 비교적 낮은 색 온도인 4700[K] (R: 244, G: 210, B: 186) 로 사용자의 감성을 조금 차분하게 유도하는 조명이 설정되 었다. 이상 본 발명자에 의해서 이루어진 발명을 상기 실시 예에 따라 구체적으로 설명하였지만, 본 발명은 상기 실시 예에 한정되는 것은 아니고 그 요지를 이탈하지 않는 범위에서 여러 가지로 변경 가능한 것은 물론이다. 산업상 이용가능성 본 발명은 생체정보와 환경정보를 이용하여 감성을 추론하고, 이를 기반으로 LED 조명의 밝기 및 색상 조절 기 술에 적용된다."}
{"patent_id": "10-2016-0011099", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시 예에 따른 생체신호 및 환경변화에 따른 조명제어장치의 전체 구성도, 도 2는 대응 감성 컬러표, 도 3은 뇌파의 파형별 주파수 대역과 상태표, 도 4는 심전도 데이터의 특징 추출 파형도, 도 5는 맥박을 이용한 감성컬러 대응에 관한 표, 도 6은 환경정보를 이용한 대응색상표, 도 7은 생체 및 환경 정보 융합 알고리즘과 조명제어방법의 개념도, 도 8은 감성 조명 제어관리 미들웨어 구조도, 도 9는 감성 조명 제어관리 미들웨어에서 데이터 취득 및 저장 구조도, 도 10은 감성 조명 제어관리 미들웨어에서 조명 제어 구조도, 도 11은 앱의 설계 화면으로서, 개인정보 관리 및 룸 설정 화면 예시도, 도 12는 앱의 설계 화면으로서, 센서 정보 열람 예시도, 도 13은 앱 설계 화면으로서, 생체정보 그래프와 조명 컨트롤 예시도, 도 14는 LED 제어 시스템의 구조도, 도 15는 고출력 LED 드라이버 블록도, 도 16은 디밍 신호 제어기 회로도, 도 17은 DC 디머 스위치 방식 회로도, 도 18은 LED RGB 컨트롤러 사양도, 도 19는 RGB LED 조명 제어를 위한 기본 구성도, 도 20은 RGB 컨트롤러 시스템 구성도, 도 21은 감성 조명 제어 미들웨어 데이터베이스 예시도, 도 22는 감성 조명 제어 미들웨어 데이터베이스 중 LED, Room, 센서 관계도, 도 23은 감성 조명 제어 미들웨어 데이터베이스 중 데이터 통신 관계도, 도 24는 SHT11 센서의 데이터 형태도, 도 25는 STH11 센서의 명령어 코드 예시도, 도 26은 ZigbeX 모트를 통한 환경 센서 정보 획득 과정 예시도, 도 27은 EEG 데이터 송수신 프로세스도, 도 28은 ECG 데이터 송수신 프로세스, 도 29는 센서데이터 수신과 이벤트의 정의 예시도, 도 30은 맥박을 이용한 감성컬러 대응에 관한 표, 도 31은 맥박에 대한 감성지수 적용표, 도 32는 감성지수의 정규화 및 최적화 과정 예시도, 도 33은 색채별 감성의 척도, 도 34는 색채감성 척도에 대비한 감성언어 예시도, 도 35는 감성 정의를 위한 감성 평가 언어 예시도, 도 36은 감성에 대비되는 색 온도, 도 37은 CIE 1931색도 좌표계,도 38은 감성지수에 따른 RGB 값 예시도, 도 39는 색 온도에 해당하는 RGB 값, 도 40은 감성조명 미들웨어 실험을 위한 실험장소 예시도, 도 41은 감성조명 미들웨어 실험도면과 센서 부착 예시도, 도 42는 센서 노드들의 연결 설정 및 노드 값 확인 예시도, 도 43은 실험장소의 독립된 공간 설정 예시도, 도 44는 감성 조명 미들웨어 시뮬레이터, 도 45는 감성 조명 미들웨어 시뮬레이터에서 센서 데이터 열람 예시도, 도 46은 감성 조명 미들웨어 시뮬레이터에서 실험 결과도."}
