{"patent_id": "10-2019-0079949", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0004085", "출원번호": "10-2019-0079949", "발명의 명칭": "X-선 영상 처리 방법 및 컴퓨터 판독 가능한 저장매체", "출원인": "제이피아이헬스케어 주식회사", "발명자": "김경우"}}
{"patent_id": "10-2019-0079949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "그리드 라인 억제가 필요한 입력영상과 그리드 라인 억제된 결과영상을 이용하여 인공지능 모델을 학습시키는단계; 및학습된 상기 인공지능 모델 기반으로 입력영상에서 그리드 라인 및 모아레 현상을 제거하는 단계를 포함하며, X-선 그리드를 사용하지 않고 획득한 복수의 영상에 상기 X-선 그리드의 그리드 라인과 유사한 주기성을 가지는복수의 선들을 합성하여 생성한 복수의 합성 영상 및 X-선 디텍터에 최적화되지 않은 X-선 그리드를 사용하여획득한 복수의 영상 중 적어도 하나를 상기 입력영상으로 사용하고, 상기 입력영상에서 주파수 기반 그리드 라인 억제(Frequency-based Grid-line-suppression)에 의해 그리드 라인 및 모아레 현상을 제거한 복수의 영상, 상기 X-선 디텍터에 최적화된 X-선 그리드를 사용하여 획득한 복수의영상 및 상기 X-선 그리드를 사용하지 않고 획득한 복수의 영상 중 적어도 하나를 상기 결과영상으로 사용하는것을 특징으로 하는 X-선 영상 처리 방법."}
{"patent_id": "10-2019-0079949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 입력영상 및 상기 결과영상은 블록단위로 분할된 후 상기 인공지능 모델의 학습 데이터로 사용되는 것을특징으로 하는 X-선 영상 처리 방법."}
{"patent_id": "10-2019-0079949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 입력영상 및 상기 결과영상을 분할한 임의의 분할영상 Pij는 Oij를 원점으로 하는 폭과 높이가 d인 분할영상이고, 상기 원점 Oij는 다음의 수식에 따라 결정되며,c는 영상의 가장자리에 해당하는 일정량의 여백을 의미하며 d/2 보다 작은 정수값이고, k는 샘플링 주기로서 1에서 W/d 범위의 정수값으로 결정하며, i, j값은 각각 0에서 최대 (W/d-1)과 (H/d-1)의 값을 가지는 것을 특징으로 하는 X-선 영상 처리 방법."}
{"patent_id": "10-2019-0079949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 인공지능 모델은 축소(contracting) 단계 및 확장(expanding) 단계를 포함하는 U-Net 모델인 것을 특징으로 하는 X-선 영상 처리 방법."}
{"patent_id": "10-2019-0079949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서, 상기 입력영상에서 그리드 라인 및 모아레 현상을 제거하는 단계는,공개특허 10-2021-0004085-3-상기 인공지능 모델의 학습에 따른 가중치 파일(Weight file)과 X-선 디텍터에 최적화되지 않은 X-선 그리드를사용하여 획득한 영상을 입력받고,상기 학습 데이터의 생성시와 동일하게 블록 단위로 분할한 후, 학습된 상기 인공지능 모델에 의해 분할영상에서 그리드 라인이 제거된 영상을 추정하고, 추정된 영상을 다시 결합하여 그리드 라인이 제거된 최종 영상을 출력하는 것을 특징으로 하는 X-선 영상 처리방법."}
{"patent_id": "10-2019-0079949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 따른 X-선 영상 처리 방법을 실행하기 위한 프로세서에 의해 실행 가능한 명령들이 기록된 컴퓨터 판독 가능한 저장 매체."}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 X-선 영상 처리 방법은, 그리드 라인 억제가 필요한 입력영상과 그리드 라인 억제된 결과영상을 이용하여 인공지능 모델을 학습시키는 단계; 및 학습된 상기 인공지능 모델 기반으로 입력영상에서 그리드 라인 및 모아레 현상을 제거하는 단계를 포함하며, X-선 그리드를 사용하지 않고 획득한 복수의 영상에 (뒷면에 계속)"}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 X-선 영상 처리 방법 및 컴퓨터 판독 가능한 저장매체에 관한 것이다."}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "X-선 그리드(X-ray Grid)는 X-선이 피사체에 조사될 때 발생할 수 있는 산란선이 X-선 디텍터(X-ray detecto r)로 유입되지 않도록 하면서 1차 X-선(primary X-ray)은 X-선 디텍터에 유입될 수 있도록 하는 얇은 판 형태의 필터를 말한다. 디텍터 최적화(Detector optimization)는 임의의 X-선 디텍터에 대하여 최적의 그리드 사양 및 선밀도(Line pair/cm 또는 Line pair/inch)를 선정하는 작업을 말한다. 예를 들어 임의의 X-선 디텍터를 이용하여 임의의 그 리드를 촬영하였을 때, 영상에서 그리드 라인이 보이지 않고 영상을 확대 또는 축소한 경우 영상이 움직이는 것 처럼 보이는 맥놀이 현상이 발생하지 않는다면, 이 그리드가 해당 X-선 디텍터에 최적의 사양이 된다. 그러나, 일반적으로 X-선 디텍터의 제조시에 X-선 그리드의 사양을 먼저 고려하여 개발하는 것이 아니라, 우선 X-선 디텍터를 제조한 후 최적의 그리드 사양을 선정하기 위해 그리드 제조사에 문의하는 과정으로 진행되므로, 다양한 종류의 X-선 디텍터에 대응하여 디텍터 최적화를 수행하는 것에는 한계가 있다. 이의 대안으로, 선밀도가 X-선 디텍터의 픽셀밀도보다 매우 높은 High-line 그리드를 제조하는 방안을 고려할 수 있다. 하지만, 선밀도가 상당히 높은 고밀도 그리드를 제조하기 위해서는 많은 비용이 들고, 선밀도가 높아 짐에 따라 산란선 차폐 물질의 두께도 얇아지게 되어 산란선을 차단시키는 성능의 감소를 초래할 수 있다. 한편, 그리드 라인 억제(Grid-line-suppression) 알고리즘을 이용하여 X-선 디텍터에 최적화된 그리드를 사용하 지 않고도 X-선 영상에서 관찰되는 그리드 라인 및 모아레(moire artifact)를 제거하는 기술이 현업에 사용되고 있다. 여기서, 모아레 현상은 디텍터 최적화를 하지 않은 그리드를 사용한 디지털 X-선 영상에서 영상의 확대 또는 축소시에 맥놀이 현상이 일어나 피사체를 왜곡시켜 보이도록 하는 결함을 말한다. 종래의 그리드 라인 억제 기술은 그리드 라인이 주기성을 갖는 점에 착안하여 영상을 주파수 도메인으로 변환한 후 주파수 차원에서 모아레 주파수를 계산하여 처리하는 방식으로 개발되었다. 이론적으로 계산되는 모아레 주파수는 하나의 값이지만, 실제 주파수 도메인에서는 두 개 이상의 모아레 주파수 가 관찰될 수도 있으며, 이 경우 각 신호의 주파수 대역과 신호 강도는 X-선 디텍터와 그리드의 사양에 따라 다 양하게 나타난다. 따라서, 각각의 사양에 최적화하여 그리드 라인 억제 기술을 구현하는데 한계가 있다. 뿐만 아니라, 영상을 주파수 도메인으로 변환할 경우 일반적으로 저주파 대역에 진단 대상 피사체가, 고주파 대 역에 그리드 라인과 같이 높은 주기성을 가지는 물체가 표현되는데, 경우에 따라 모아레 주파수가 저주파 대역 에 나타나는 경우가 있으며, 이를 잘못 제거할 경우 피사체에 영상처리 흔적이 반영되어 영상 손실 및 왜곡이 발생할 수 있다."}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 당해 기술분야에서는 기존의 디텍터 최적화의 한계 및 기존의 그리드 라인 억제의 한계를 극복하여 보 다 개선된 품질의 X-선 영상을 획득하기 위한 방안이 요구되고 있다."}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위해서, 본 발명의 일 실시예는 X-선 영상 처리 방법을 제공한다. 상기 X-선 영상 처리 방법은, 그리드 라인 억제가 필요한 입력영상과 그리드 라인 억제된 결과영상을 이용하여 인공지능 모델을 학습시키는 단계; 및 학습된 상기 인공지능 모델 기반으로 입력영상에서 그리드 라인 및 모아 레 현상을 제거하는 단계를 포함하며, X-선 그리드를 사용하지 않고 획득한 복수의 영상에 상기 X-선 그리드의 그리드 라인과 유사한 주기성을 가지는 복수의 선들을 합성하여 생성한 복수의 합성 영상 및 X-선 디텍터에 최 적화되지 않은 X-선 그리드를 사용하여 획득한 복수의 영상 중 적어도 하나를 상기 입력영상으로 사용하고, 상 기 입력영상에서 주파수 기반 그리드 라인 억제(Frequency-based Grid-line-suppression)에 의해 그리드 라인 및 모아레 현상을 제거한 복수의 영상, 상기 X-선 디텍터에 최적화된 X-선 그리드를 사용하여 획득한 복수의 영 상 및 상기 X-선 그리드를 사용하지 않고 획득한 복수의 영상 중 적어도 하나를 상기 결과영상으로 사용하는 것 을 특징으로 한다. 덧붙여 상기한 과제의 해결수단은, 본 발명의 특징을 모두 열거한 것이 아니다. 본 발명의 다양한 특징과 그에 따른 장점과 효과는 아래의 구체적인 실시형태를 참조하여 보다 상세하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 상술한 바와 같은 기존의 디텍터 최적화의 한계 및 기존의 그리드 라인 억제의 한계를 극복하여 보다 개선된 품질의 X-선 영상을 획득할 수 있다."}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있 어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되 는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 '연결'되어 있다고 할 때, 이는 '직접적으로 연결'되어 있 는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 '간접적으로 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 '포함'한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다.본 발명에서는 그리드 라인 억제가 필요한 입력영상과 그리드 라인 억제된 결과영상을 이용하여 인공지능 모델 을 학습시키고, 학습된 인공지능 모델 기반으로 입력영상에서 그리드 라인 및 모아레 현상을 제거하는 방법을 제안한다. 이 경우, 인공지능 모델을 학습시키기 위해 충분한 학습 데이터를 필요로 한다. 또한, 다양한 X-선 디텍터와 그 리드의 사양, 그리고 다양한 피사체의 특성에 대하여 일반화된 성능을 지원하기 위해서는 실제 X-선 영상에서 나타날 수 있는 형태를 모두 망라할 수 있는 학습 데이터가 필요하다. 그러나, 실제 환경에서 다량의 그리드 라 인 영상과 이에 대한 이상적인 출력영상을 확보하는 것은 어려움이 있다. 또한, 진단용 디지털 X-선 영상은 통상적으로 512 x 512 이하의 픽셀로 구성된 CT나 MRI 영상과는 달리, 3000 x 3000 내지 4000 x 4000 이상의 픽셀로 구성된 고용량 영상이다. 따라서, 일반적인 인공지능 학습 방식에 따라 학습을 시도할 경우 메모리 부족의 문제로 학습이 불가능할 수 있다. 한편, 컴퓨터 비전 분야에서 주로 사용되는 인공지능 모델인 CNN(Convolutional Neural Network), SVM(Support Vector Machine) 등은 축소(contracting) 과정만으로 구성된다. 이러한 인공지능 모델은 네트워크를 거칠수록 입력영상의 정보손실이 발생하기 때문에, 영상분류 및 진단분야와는 달리 영상처리 분야의 적용에는 한계가 있 다. 이하, 도 1 내지 도 6을 참조하여, 상술한 바와 같은 한계를 극복할 수 있는 본 발명의 실시예에 대해 구체적으 로 설명한다. 도 1은 본 발명의 일 실시예에 따른 X-선 영상 처리 방법의 흐름을 도시하는 도면이다. 도 1을 참조하면, X-선 그리드를 사용하지 않고 획득한 복수의 영상(Non-grid image)에 X-선 그리드의 그 리드 라인과 유사한 주기성을 가지는 복수의 선들을 합성(Grid-line synthesis)하여 생성한 복수의 합성 영상(Synthesis image) 및 X-선 디텍터에 최적화되지 않은 X-선 그리드를 사용하여 획득한 복수의 영상 (Grid image) 중 적어도 하나를 인공지능 모델의 학습을 위한 입력영상으로 사용할 수 있다. 여기서, 영상의 합성은 실제 영상에서 나타날 수 있는 그리드 라인의 속성, 예를 들어 그리드 라인의 폭, 픽셀값, 간격 및 기울기에 대하여 가능한 모든 조합을 생성하도록 기 설정된 소프트웨어에 의해 수행될 수 있다. 예를 들어, 그리드 라인의 각 속성은 하기와 같이 결정될 수 있다. 그리드 라인의 폭: 실제 영상에서 나타날 수 있는 형태를 고려하여, 대략 1~3개 범위 내에서 결정 그리드 라인의 픽셀값: 원 영상과 주파수 분석 기반의 방법을 적용한 결과로부터 평균 변화값을 산출하고, 해당 영상에서 나타나는 최대 픽셀값을 일관되게 적용 그리드 라인의 간격: 그리드 라인의 밀도, 영상의 해상도 및 그리드 라인의 폭을 고려하여 다음과 같이 결정, 여기서, a는 X-선 영상에서 관찰되는 그리드 라인의 간격, b는 실제 제품 상에서의 그리드 라인의 밀도, W는 X- 선 영상에서 그리드 라인에 대한 직교 방향의 해상도, t는 X-선 영상에서 그리드 라인의 두께를 나타냄"}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "그리드 라인의 기울기: 완전한 수평(또는 수직) 방향부터 실제 그리드에서 관찰되는 최대 기울기까지 고려 도 2의 (a)는 X-선 그리드를 X-선 디텍터로 실제 촬영한 영상이고, (b) 및 (c)는 실제 촬영한 영상에서 나타나 는 줄무늬 패턴을 모방하여 인위적으로 선을 삽입하여 생성한 영상의 예이다. 한편, 상술한 입력영상(103, 104)에서 주파수 기반 그리드 라인 억제(Frequency-based Grid-line- suppression)에 의해 그리드 라인 및 모아레 현상을 제거한 복수의 영상(Grid-line-suppression image), X-선 디텍터에 최적화된 X-선 그리드를 사용하여 획득한 복수의 영상(Optimized Gridimage) 및 X-선 그리드를 사용하지 않고 획득한 복수의 영상 중 적어도 하나를 인공지능 모델의 학습 을 위한 결과영상으로 사용할 수 있다. 여기서, 주파수 기반 그리드 라인 억제는 입력영상(103, 104)에서 상용의 그리드 라인 억제 알고리즘을 이용하 여 그리드 라인 등을 제거하는 것을 의미한다. 예를 들어, 주파수 특성의 분석은 DFT(Discrete Fourier transform), FFT(Fast-FT), DCT(Discrete Cosine Transform) 등에 의해 수행할 수 있다. 도 3에서는 DCT 알고 리즘을 적용한 경우를 예를 들어 도시하였으나, 본 발명이 반드시 이로 제한되는 것은 아니다. 도 3은 본 발명의 일 실시예에 따라 DCT 알고리즘을 적용한 경우의 그리드 라인 억제 과정을 도시하는 도면이다. 도 3을 참조하면, 그리드 라인이 포함된 X-선 영상은 기 정해진 크기(예를 들어, 256 x 256 크기 등)로 분 할된 후(image segmentation), DCT(discrete cosine transform)에 따른 주파수 분석을 거치게 된다. 여기서, 입력된 원본 X-선 영상의 크기가 기 정해진 크기 보다 작은 영상(예를 들어 CT 영상, X-선 영상의 crop 영상 등)인 경우 분할 과정 없이 바로 DCT가 수행될 수 있다. 이후, 그리드 라인의 주파수 대역을 검출하고(parameter estimation), 검출된 주파수 대역에 주파수 제거 필터를 적용할 수 있다(band stop filter). 이후, 역 DCT(inverse DCT)를 거친 후, 분할된 단위 영역의 경계에서 나타나는 영상 왜곡을 제거할 수 있다 (blocking effect reduction). 상술한 바와 같은 과정을 거쳐 그리드 라인이 억제된 영상(Grid line suppressed image)을 획득할 수 있다. 상술한 바와 같은 입력영상 및 결과영상은 도 4를 참조하여 후술하는 바에 따라 블록 단위로 분할된 후(image blocks) 인공지능 모델의 학습 데이터로 사용될 수 있다. 도 4는 본 발명의 일 실시예에 따라 학습 데이터를 생성하는 방법을 설명하기 위한 도면이다. 도 4를 참조하면, 입력영상과 결과영상은 기 설정된 길이(d)의 정방형 블록으로 분할될 수 있다. 임의의 분할영 상 Pij는 Oij를 원점으로 하는 폭과 높이가 d인 분할영상이고, 영상의 원점 Oij는 다음의 수식에 따라 결정될 수 있다."}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, c는 영상의 가장자리에 해당하는 일정량의 여백을 의미하며 d/2 보다 작은 정수값이다. 또한, k는 샘플링 주기로서, 1에서 W/d 범위의 정수값으로 결정할 수 있다. 또한, i, j값은 각각 0에서 최대 (W/d-1)과 (H/d-1)의 값을 가질 수 있다. 따라서, 하나의 입력영상 또는 결과영상에 대하여 총 ((W-d)/k )((H-d)/k)개의 분할영상을 생성할 수 있다. 예를 들어, 2540 x 3052 크기의 영상에 대하여 d를 128, k를 8로 지정하는 경우, 한 개의 원본영상으로부터 약 1만개 이상의 분할영상을 생성하여 학습 데이터로 사용할 수 있다. 본 발명의 실시예에 따른 영상처리 방법은 그리드 라인을 제거하기 위한 것이고, 그리드 라인은 영상 전체에 일 정한 패턴으로 분포하기 때문에 영상의 어느 부분을 추출하더라도 주파수 분석이 가능하다. 다시 말해, 입력영 상에서 그리드 라인의 특성을 파악할 때 영상의 전체가 필요 없으므로, 상술한 바와 같이 영상을 분할하여 학습 데이터로 사용할 수 있다. 또한, 영상의 각 부분별로 촬영되는 피사체가 상이하므로, 배경이 서로 상이한 학습 데이터가 될 수 있다. 상술한 바와 같이 일정 비율의 중첩 영역을 둔 형태의 블록 단위로 분할한 분할영상들을 학습 데이터로 이용하 여 인공지능 모델을 학습시킬 수 있다. 일 실시예에 따르면, 인공지능 모델로서 U-Net 모델을 사용할 수 있다. 도 5는 본 발명의 일 실시예에 따라 학습에 적용한 U-Net의 구성 및 처리 과정을 도시하는 도면이다. 도 5를 참조하면, U-Net 모델은 CNN(Convolutional Neural Network)의 변형으로, 축소(contracting) 단계와 확 장(expanding) 단계로 구성된다. 확장 단계에서는 축소단계의 특징 지도 데이터를 결합함으로써 학습과정에서 발생하는 손실을 보완하여, CNN에 비하여 정교한 위치의 세분화를 가능하게 할 수 있다. 이후, 사용 단계에서는, 인공지능 모델의 학습에 따른 가중치 파일(Weight file)과 X-선 디텍터에 최적화 되지 않은 X-선 그리드를 사용하여 획득한 영상을 입력받고, 학습 데이터 생성시와 동일하게 블록 단위로 분할한 후, 학습된 인공지능 모델에 의해 분할영상에서 그리드 라인이 제거된 영상을 추정하고, 추정 된 영상을 다시 결합하여 그리드 라인이 제거된 최종 영상(Final suppressed image)를 출력할 수 있다. 도 6의 (a)는 본 발명의 일 실시예에 따라 영상 처리 대상이 되는 X-선 그리드를 촬영한 영상이고, (b)는 본 발 명의 일 실시예에 따라 영상 처리된 결과영상의 예를 도시하는 도면으로, 본 발명의 실시예에 따르면 학습된 인 공지능 모델 기반으로 입력영상에서 그리드 라인 및 모아레 현상을 효과적으로 제거할 수 있음을 알 수 있다. 도 1 내지 도 6을 참조하여 상술한 영상처리 방법은 X-선 영상처리 및 인공지능 모델의 학습이 가능한 프로세싱 장치에 의해 수행될 수 있다."}
{"patent_id": "10-2019-0079949", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "본 발명은 전술한 실시예 및 첨부된 도면에 의해 한정되는 것이 아니다. 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 있어, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 본 발명에 따른 구성요소를 치 환, 변형 및 변경할 수 있다는 것이 명백할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2019-0079949", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 X-선 영상 처리 방법의 흐름을 도시하는 도면이다. 도 2는 X-선 그리드를 X-선 디텍터로 실제 촬영한 영상과 실제 촬영한 영상에서 나타나는 줄무늬 패턴을 모방하 여 인위적으로 선을 삽입하여 생성한 영상의 예를 도시하는 도면이다. 도 3은 본 발명의 일 실시예에 따라 DCT 알고리즘을 적용한 경우의 그리드 라인 억제 과정을 도시하는 도면이다. 도 4는 본 발명의 일 실시예에 따라 학습 데이터를 생성하는 방법을 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따라 학습에 적용한 U-Net의 구성 및 처리 과정을 도시하는 도면이다. 도 6은 본 발명의 일 실시예에 따라 영상 처리 대상이 되는 X-선 그리드를 촬영한 영상과 본 발명의 일 실시예 에 따라 영상 처리된 결과영상의 예를 도시하는 도면이다."}
