{"patent_id": "10-2020-0090561", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0011524", "출원번호": "10-2020-0090561", "발명의 명칭": "부하 예측 방법 및 장치", "출원인": "국민대학교산학협력단", "발명자": "장영민"}}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전체 전력 데이터를 제1 주기마다 분할한 제1 입력 데이터를 수신하는 단계;상기 전체 전력 데이터를 제2 주기마다 분할한 제2 입력 데이터를 수신하는 단계;상기 제1 입력 데이터를 제1 인공 신경망에 입력하여 제1 출력 데이터를 생성하는 단계;상기 제2 입력 데이터를 제2 인공 신경망에 입력하여 제2 출력 데이터를 생성하는 단계;상기 제1 출력 데이터 및 상기 제2 출력 데이터에 대한 합산을 수행하여 제3 입력 데이터를 생성하는 단계;상기 제3 입력 데이터를 제3 인공 신경망에 입력하여 제3 출력 데이터를 생성하는 단계; 및상기 제3 출력 데이터를 기초로 부하를 예측하는 단계를 포함하는, 부하 예측 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제1 인공 신경망 및 상기 제2 인공 신경망 중 하나 이상은, RNN(Recurrent Neural network)인, 부하 예측방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 제3 인공 신경망은 ANN(Artificial Neural Network)인, 부하 예측 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 제1 주기의 크기는 상기 제2 주기의 크기보다 큰, 부하 예측 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 제1 인공 신경망, 상기 제2 인공 신경망 및 상기 제3 인공 신경망 중 하나 이상은, 역전파(backpropagation) 방식에 의해 학습을 수행하는, 부하 예측 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 부하를 예측하는 단계는,상기 제1 입력 데이터가 A 및 A+F 시간 사이의 전력 데이터를 포함하는 경우,A+F+1 시간에서의 부하를 예측하는 단계인, 부하 예측 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "프로세서(processor);상기 프로세서에 의해 실행되는 하나 이상의 명령들이 저장된 메모리(memory); 및제1 인공 신경망, 제2 인공 신경망 및 제3 인공 신경망을 포함하며,공개특허 10-2022-0011524-3-상기 하나 이상의 명령들은,전체 전력 데이터를 제1 주기마다 분할한 제1 입력 데이터를 수신하고;상기 전체 전력 데이터를 제2 주기마다 분할한 제2 입력 데이터를 수신하고;상기 제1 입력 데이터를 상기 제1 인공 신경망에 입력하여 제1 출력 데이터를 생성하고;상기 제2 입력 데이터를 상기 제2 인공 신경망에 입력하여 제2 출력 데이터를 생성하고;상기 제1 출력 데이터 및 상기 제2 출력 데이터에 대한 합산을 수행하여 제3 입력 데이터를 생성하고;상기 제3 입력 데이터를 상기 제3 인공 신경망에 입력하여 제3 출력 데이터를 생성하고; 그리고,상기 제3 출력 데이터를 기초로 부하를 예측 하도록 실행되는, 부하 예측 장치."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 제1 인공 신경망 및 상기 제2 인공 신경망 중 하나 이상은, RNN(Recurrent Neural network)이고; 그리고,상기 제3 인공 신경망은 ANN(Artificial Neural Network)인, 부하 예측 장치."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7에 있어서,상기 제1 주기의 크기는 상기 제2 주기의 크기보다 큰, 부하 예측 장치."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에 있어서,상기 제1 인공 신경망, 상기 제2 인공 신경망 및 상기 제3 인공 신경망 중 하나 이상은, 역전파(backpropagation) 방식에 의해 학습을 수행하는, 부하 예측 장치."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 7에 있어서,상기 부하를 예측하는 경우,상기 하나 이상의 명령은,상기 제1 입력 데이터가 A 및 A+F 시간 사이의 전력 데이터를 포함하는 경우,A+F+1 시간에서의 부하를 예측하도록 실행되는, 부하 예측 장치."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전체 전력 데이터를 수신하는 단계;상기 전체 전력 데이터에 대한 전처리를 수행하여 제1 입력 데이터 및 제2 입력 데이터를 생성하는 단계;상기 제1 입력 데이터를 제1 인공 신경망에 입력하여 제1 출력 데이터를 생성하는 단계;상기 제2 입력 데이터를 제2 인공 신경망에 입력하여 제2 출력 데이터를 생성하는 단계;상기 제1 출력 데이터 및 상기 제2 출력 데이터에 대한 합산을 수행하여 제3 입력 데이터를 생성하는 단계;상기 제3 입력 데이터를 제3 인공 신경망에 입력하여 제3 출력 데이터를 생성하는 단계;상기 제3 출력 데이터를 기초로 부하를 예측하는 단계; 및상기 예측된 부하를 기초로 전력 생산 장치에 대한 제어를 수행하는, 전력 제어 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2022-0011524-4-청구항 12에 있어서,상기 제1 입력 데이터 및 제2 입력 데이터를 생성하는 단계는,상기 전체 전력 데이터를 제1 주기마다 분할하여 상기 제1 입력 데이터를 생성하는 단계; 및상기 전체 전력 데이터를 제2 주기마다 분할하여 상기 제2 입력 데이터를 생성하는 단계를 포함하는, 전력 제어방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 제1 주기의 크기는 상기 제2 주기의 크기보다 큰, 전력 제어 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 12에 있어서,상기 제1 인공 신경망 및 상기 제2 인공 신경망 중 하나 이상은, RNN(Recurrent Neural network)이고; 그리고,상기 제3 인공 신경망은 ANN(Artificial Neural Network)인, 전력 제어 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 12에 있어서,상기 제1 인공 신경망, 상기 제2 인공 신경망 및 상기 제3 인공 신경망 중 하나 이상은, 역전파(backpropagation) 방식에 의해 학습을 수행하는, 전력 제어 방법."}
{"patent_id": "10-2020-0090561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 12에 있어서,상기 부하를 예측하는 단계는,상기 제1 입력 데이터가 A 및 A+F 시간 사이의 전력 데이터를 포함하는 경우,A+F+1 시간에서의 부하를 예측하는 단계인, 전력 제어 방법."}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "부하 예측 방법 및 장치가 개시된다. 본 발명의 일 실시예에 따른 부하 예측 방법은 전체 전력 데이터를 제1 주 기마다 분할한 제1 입력 데이터를 수신하는 단계, 상기 전체 전력 데이터를 제2 주기마다 분할한 제2 입력 데이 터를 수신하는 단계, 상기 제1 입력 데이터를 제1 인공 신경망에 입력하여 제1 출력 데이터를 생성하는 단계, 상 기 제2 입력 데이터를 제2 인공 신경망에 입력하여 제2 출력 데이터를 생성하는 단계, 상기 제1 출력 데이터 및 상기 제2 출력 데이터에 대한 합산을 수행하여 제3 입력 데이터를 생성하는 단계, 상기 제3 입력 데이터를 제3 인공 신경망에 입력하여 제3 출력 데이터를 생성하는 단계 및 상기 제3 출력 데이터를 기초로 부하를 예측하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 부하 예측 방법 및 장치에 관한 것으로, 더욱 상세하게는 인공 신경망을 이용한 부하 예측 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 공급 중심에서 수요와 관리, 그리고 서비스로 이어지는 에너지 정책이 대두되면서, 스마트 그리드(smart grid) 즉, 지능형 전력망을 포함한 스마트 에코(smart eco) 등의 에너지 관리와 절약이 강조되고 있는 실정이다. 전력 계통 운영자는 스마트 그리드를 통해 전력 수용가의 전력 사용 패턴을 분석할 수 있고, 이를 기 초로 전력 수용가의 전력 사용 패턴의 변화를 유도할 수 있다. 이를 통해, 전력 계통 운영자는 피크 수요 절감 및 전력계통 운영의 안정화를 도모할 수 있고, 전력 수용가에 의한 불필요한 전력 사용을 줄일 수 있다. 한편, 전력 계통 운영 기관에서는 여러 상황의 전력 수용가를 대상으로 한 다양한 에너지 관리 시스템들이 개발 되고 있다. 최근 에너지의 효율적인 사용을 위하여 도입된 에너지관리시스템(Energy Management System, EMS)을 통하여 소규모 부하뿐만 아니라, 중규모 및 대규모 부하에서도 안정적이고 경제적인 부하 운용 및 전력 수급을 위해 부하의 정확한 수요 예측이 요구될 수 있다."}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 목적은, 복수의 인공 신경망들을 이용하여 전력 부하를 예측하 는 부하 예측 방법 및 장치를 제공하는 데 있다."}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 일 실시예에 따른, 부하 예측 방법은 전체 전력 데이터를 제1 주기마다 분할한 제1 입력 데이터를 수신하는 단계, 상기 전체 전력 데이터를 제2 주기마다 분할한 제2 입력 데 이터를 수신하는 단계, 상기 제1 입력 데이터를 제1 인공 신경망에 입력하여 제1 출력 데이터를 생성하는 단계, 상기 제2 입력 데이터를 제2 인공 신경망에 입력하여 제2 출력 데이터를 생성하는 단계, 상기 제1 출력 데이터 및 상기 제2 출력 데이터에 대한 합산을 수행하여 제3 입력 데이터를 생성하는 단계 및 상기 제3 입력 데이터를 제3 인공 신경망에 입력하여 제3 출력 데이터를 생성하는 단계를 포함할 수 있다. 여기서, 상기 제1 인공 신경망 및 상기 제2 인공 신경망 중 하나 이상은, RNN(Recurrent Neural network)일 수 있다. 여기서, 상기 제3 인공 신경망은 ANN(Artificial Neural Network)일 수 있다. 여기서, 상기 제1 출력 데이터의 크기는 상기 제2 출력 데이터의 크기보다 클 수 있다. 여기서, 상기 제1 인공 신경망, 상기 제2 인공 신경망 및 상기 제3 인공 신경망 중 하나 이상은, 역전파(back propagation) 방식에 의해 학습을 수행할 수 있다. 상기와 같은 문제점을 해결하기 위한 본 발명의 다른 실시예에 따른, 부하 예측 장치는 프로세서(processor), 상기 프로세서에 의해 실행되는 하나 이상의 명령들이 저장된 메모리(memory) 및 제1 인공 신경망, 제2 인공 신 경망 및 제3 인공 신경망을 포함할 수 있고, 상기 하나 이상의 명령들은, 전체 전력 데이터를 제1 주기마다 분 할한 제1 입력 데이터를 수신하고, 상기 전체 전력 데이터를 제2 주기마다 분할한 제2 입력 데이터를 수신하고, 상기 제1 입력 데이터를 상기 제1 인공 신경망에 입력하여 제1 출력 데이터를 생성하고, 상기 제2 입력 데이터 를 상기 제2 인공 신경망에 입력하여 제2 출력 데이터를 생성하고, 상기 제1 출력 데이터 및 상기 제2 출력 데 이터에 대한 합산을 수행하여 제3 입력 데이터를 생성하고 그리고, 상기 제3 입력 데이터를 상기 제3 인공 신경 망에 입력하여 제3 출력 데이터를 생성하도록 실행될 수 있다. 여기서, 상기 제1 인공 신경망 및 상기 제2 인공 신경망 중 하나 이상은, RNN(Recurrent Neural network)이고 그리고, 상기 제3 인공 신경망은 ANN(Artificial Neural Network)일 수 있다. 여기서, 상기 제1 출력 데이터의 크기는 상기 제2 출력 데이터의 크기보다 클 수 있다. 여기서, 상기 제1 인공 신경망, 상기 제2 인공 신경망 및 상기 제3 인공 신경망 중 하나 이상은, 역전파(back propagation) 방식에 의해 학습을 수행할 수 있다. 본 발명의 다른 실시예에 따른 전력 제어 방법은 전체 전력 데이터를 수신하는 단계, 상기 전체 전력 데이터에 대한 전처리를 수행하여 제1 입력 데이터 및 제2 입력 데이터를 생성하는 단계, 상기 제1 입력 데이터를 제1 인 공 신경망에 입력하여 제1 출력 데이터를 생성하는 단계, 상기 제2 입력 데이터를 제2 인공 신경망에 입력하여 제2 출력 데이터를 생성하는 단계, 상기 제1 출력 데이터 및 상기 제2 출력 데이터에 대한 합산을 수행하여 제3 입력 데이터를 생성하는 단계, 상기 제3 입력 데이터를 제3 인공 신경망에 입력하여 제3 출력 데이터를 생성하 는 단계, 상기 제3 출력 데이터를 기초로 부하를 예측하는 단계 및 상기 예측된 부하를 기초로 전력 생산 장치 에 대한 제어를 수행할 수 있다. 여기서, 상기 제1 입력 데이터 및 제2 입력 데이터를 생성하는 단계는, 상기 전체 전력 데이터를 제1 주기마다 분할하여 상기 제1 입력 데이터를 생성하는 단계 및 상기 전체 전력 데이터를 제2 주기마다 분할하여 상기 제2 입력 데이터를 생성하는 단계를 포함할 수 있다. 여기서, 상기 제1 출력 데이터의 크기는 상기 제2 출력 데이터의 크기보다 클 수 있다. 여기서, 상기 제1 인공 신경망 및 상기 제2 인공 신경망 중 하나 이상은, RNN(Recurrent Neural network)이고 그리고, 상기 제3 인공 신경망은 ANN(Artificial Neural Network)일 수 있다. 여기서, 상기 제1 인공 신경망, 상기 제2 인공 신경망 및 상기 제3 인공 신경망 중 하나 이상은, 역전파(back propagation) 방식에 의해 학습을 수행할 수 있다."}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 서로 다른 주기를 기초로 생성한 전력 데이터들을 기초로 부하를 예측하는 바, 정확한 부하 예측이 가능할 수 있다. 본 발명에 의하면 복수의 인공 신경망들은 기초로 부하를 예측하는 바 실시간으로 부하 예측이 가능할 수 있다. 또한, 본 발명에 의하면 복수의 RNN(Recurrent Neural Network)들에 의해 생성된 출력 데이터들을 기초로, ANN(Artificial Neural Network)가 부하 예측을 수행하는 바, RNN의 gradient vanishing 현상을 방지 할 수 있 다."}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유 사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다.이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 도 1은 본 발명의 일 실시예에 따른 전력 시스템의 개념도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 전력 시스템은 전력 생산 장치, 수용가 및 전력 제어 장치를 포함할 수 있다. 도면에는 전력 생산 장치 및 전력 제어 장치가 별개인 것으로 도시되었 으나, 전력 생산 장치 및 전력 제어 장치는 하나의 장치에 포함될 수 있다. 전력 생산 장치는 전력을 생산하여 수용가에 공급할 수 있다. 수용가는 전력을 전력 생산 장치로부터 공급받아 소비할 수 있다. 도면에는 하나의 수용가만을 도시하였으나, 이는 일 예시일 뿐이며 수용가는 복수일 수 있다. 예를 들어, 수용가는 가정, 빌딩 및 공장 등을 포함할 수 있으나, 이에 한정하지 아니한다. 수용가는 소비 전력에 대한 정보를 전력 제어 장치 에 전송할 수 있다. 전력 제어 장치 소비 전력에 대한 정보를 수용가로부터 수신할 수 있다. 전력 제어 장치는 소비 전력에 대한 정보를 기초로 부하를 예측할 수 있다. 부하는 수용가의 전력 부하일 수 있다. 한편, 전력 제 어 장치는 다음과 같이 구성될 수 있다. 도 2는 본 발명의 일 실시예에 따른 전력 제어 장치의 블록도이다. 도 2를 참조하면 전력 제어 장치는 전력 데이터 생성부 및 부하 예측부 및 제어부를 포함 할 수 있다. 전력 데이터 생성부는 소비 전력에 대한 정보를 기초로 전체 전력 데이터를 생성할 수 있다. 전력 데이터 생성부는 소비 전력에 대한 정보를 시계열적으로 정렬하여 전체 전력 데이터를 생성할 수 있 다. 전력 데이터 생성부는 전체 전력 데이터에 대한 전처리를 수행하여 제1 입력 데이터들 및 제2 입력 데이터 들을 생성할 수 있다. 예를 들어, 전력 데이터 생성부는 전체 전력 데이터를 제1 주기마다 분할하여 제1 입력 데이터들을 생성할 수 있다. 예를 들어, 제1 주기는 F일 수 있고, F는 168시간(1주일)일 수 있다. 제1 입 력 데이터는 전체 전력 데이터 중 A 및 A+F 시간 사이의 전력 데이터를 포함할 수 있다. 전력 데이터 생성부는 전체 전력 데이터를 제2 주기마다 분할하여 제2 입력 데이터들을 생성할 수 있다. 예를 들어, 제2 주기는 G일 수 있고, G는 6일 수 있다. 제2 입력 데이터는 전체 전력 데이터 중 A+(M-1)*G 및 A+M*G시간 사이의 전력 데이터를 포함할 수 있다. 제1 입력 데이터가 A 및 A+168 시간 사이의 전력 데이터를 포 함하고 G가 6인 경우, M은 0 내지 27일 수 있다. 부하 예측부는 제1 입력 데이터들 및 제2 입력 데이터들을 전력 데이터 생성부로부터 수신할 수 있다. 부하 예측부는 제1 입력 데이터들 및 제2 입력 데이터들을 기초로 부하를 예측할 수 있다. 부하 예 측부는 다음과 같이 구성될 수 있다. 도 3은 본 발명의 일 실시예에 따른 부하 예측부의 블록도이다. 도 3을 참조하면, 부하 예측부는 도 2의 부하 예측부와 동일하거나 유사하게 구성될 수 있다. 부하 예측부는 제1 인공 신경망, 제2 인공 신경망, 데이터 병합부, 제3 인공 신경망 및 부 하 연산부를 포함할 수 있다. 제1 인공 신경망 및 제2 인공 신경망은 RNN(Recurrent Neural Network)일 수 있고, 제3 인공 신경망은 ANN(Artificial Neural Network)일 수 있다. 제1 인공 신경망 은 제1 입력 데이터 중 하나를 기초로 제1 출력 데이터를 생성할 수 있다. 제1 인공 신경망은 다음과 같이 구성될 수 있다. 도 4는 본 발명의 일 실시예에 따른 제1 인공 신경망의 블록도이다. 도 4를 참조하면, 제1 인공 신경망은 도 3의 제1 인공 신경망과 동일하거나 유사하게 구성될 수 있다. 제1 인공 신경망은 N개의 입력 레이어들(411 내지 413), N개의 히든 레이어들(421 내지 423) 및 출 력 레이어를 포함할 수 있다. 예를 들어, 제1 입력 데이터가 A 및 A+F 시간 사이의 전력 데이터를 포함하 는 경우, N은 F일 수 있고 F는 168일 수 있다. 제1 입력 레이어는 제1 히든 레이어와 연결될 수 있고, 제2 입력 레이어는 제2 히든 레이어 와 연결될 수 있으며, 제N 입력 레이어은 제N 히든 레이어와 연결될 수 있다. 또한, 제N 히든 레이어는 출력 레이어와 연결될 수 있다. 제1 입력 레이어는 제1 입력 데이터 중 일부인 제1 전력 데이터를 데이터 생성부(예를 들어, 도 2의 전력 데이터 생성부)로부터 수신할 수 있다. 예를 들어, 제1 입력 데이터가 A 및 A+F 시간 사이의 전력 데이터 를 포함하는 경우, 제1 전력 데이터는 A 내지 A+1 시간 사이의 전력 데이터일 수 있다. 제1 입력 레이어는 제1 전력 데이터에 대한 처리를 수행하여 제1 전력 행렬()을 생성할 수 있다. 제1 입력 레이어는 제1 전력 행렬()을 제1 히든 레이어에 전송할 수 있다. 제1 히든 레이어는 제1 전력 행렬()을 제1 입력 레이어로부터 수신할 수 있다. 제1 히든 레이어 는 제1 전력 행렬()을 기초로 제1 히든 행렬()을 생성할 수 있다. 제1 히든 레이어는 제1 히든 행렬()을 제2 히든 레이어에 전송할 수 있다. 제2 입력 레이어는 제1 입력 데이터 중 일부인 제2 전력 데이터를 데이터 생성부로부터 수신할 수 있다. 예를 들어, 제1 입력 데이터가 A 및 A+F 시간 사이의 전력 데이터를 포함하는 경우, 제2 전력 데이터는 A+1 내 지 A+2 시간 사이의 전력 데이터일 수 있다. 제2 입력 레이어는 제2 전력 데이터에 대한 처리를 수행하여 제2 전력 행렬()을 생성할 수 있다. 제2 입력 레이어는 제2 전력 행렬()을 제2 히든 레이어에 전송할 수 있다. 제2 히든 레이어는 제2 전력 행렬()을 제2 입력 레이어로부터 수신할 수 있다. 또한 제2 히든 레 이어는 제1 히든 행렬()을 제1 히든 레이어로부터 수신할 수 있다. 제2 히든 레이어는 다음 수학식 1을 기초로 제2 히든 행렬()을 생성할 수 있다. 수학식 1"}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서, 는 제t 히든 행렬일 수 있고, 는 손실 함수일 수 있고, 는 제1 가중치일 수 있고, 는 제t 전력 행렬일 수 있으며, 는 제2 가중치일 수 있고, 은 제t-1 히든 행렬일 수 있다. 는 ReLu 함수, sigmoid 함수 및 tanh 함수 중 하나일 수 있으나, 이는 일예시일 뿐이며 이에 한정하지 아니한다. 제2 히든 레 이어가 제2 히든 행렬()을 생성하는 경우, t는 2일 수 있다. 또한, 제1 가중치는 입력 레이어(예를 들 어, 제1 입력 레이어)와 히든 레이어(예를 들어, 제1 히든 레이어) 사이의 가중치일 수 있고, 제2 가 중치는 히든 레이어들(예를 들어, 제1 히든 레이어) 및 제2 히든 레이어) 사이의 가중치일 수 있다. 제2 히든 레이어는 제2 히든 행렬()을 제3 히든 레이어에 전송할 수 있다. 이와 같은 과정을 반복하면, 제N 입력 레이어에는 제N 전력 데이터가 입력될 수 있다. 예를 들어, 제1 입 력 데이터가 A 및 A+F 시간 사이의 전력 데이터를 포함하는 경우, N은 F일 수 있고, 제N 전력 데이터는 A+F-1 및 A+F 시간 사이의 전력 데이터일 수 있다. 제N 입력 레이어는 제N 전력 데이터에 대한 처리를 수행하여 제N 전력 행렬()을 생성할 수 있다. 제N 입력 레이어는 제N 전력 행렬()을 제N 히든 레이어에 전송할 수 있다. 제N 히든 레이어는 제N 전력 행렬()을 제N 입력 레이어로부터 수신할 수 있다. 또한, 제N 히든 레 이어는 제N-1시간 히든 행렬( )을 제N-1히든 레이어로부터 수신할 수 있다. 제N 히든 레이어는 제N 전력 행렬() 및 제N-1 히든 행렬( )을 기초로 제N 히든 행렬()을 생성할 수 있다. 제N 히든 레 이어는 수학식 1을 기초로 제N 히든 행렬()을 생성할 수 있다. 제N 히든 레이어는 제N 히든 행렬 ()을 출력 레이어에 전송할 수 있다. 출력 레이어는 제N 히든 행렬()을 제N 히든 레이어(42 3)로부터 수신할 수 있다. 출력 레이어는 제N 히든 행렬()을 기초로 제1 출력 데이터()를 생성할 수 있다. 출력 레이어는 제1 크기의 제1 출력 데이터()를 생성할 수 있다. 또한, 출력 레이어는 다음 수학식 2를 기초로 제1 출 력 데이터()를 생성할 수 있다. 수학식 2"}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2에서 는 손실 함수일 수 있다. 예를 들어, 는 ReLu 함수, sigmoid 함수 및 tanh 함수 중 하나일 수 있으나, 이는 일예시일 뿐이며 이에 한정하지 아니한다. 는 제t 히든 행렬()의 크기를 조절하기 위한 행렬일 수 있다. 제t 히든 행렬()이 제N 히든 행렬()인 경우, 는 일 수 있다. 또한, 제1 입력 데이터가 A 및 A+F시간 사이의 전력 데이터를 포함하는 경우 N은 A+F일 수 있다. 출력 레이어는 제1 출력 데이터()를 데이터 병합부(예를 들어, 도 3의 데이터 병합부 )에 전송할 수 있다. 다시 도 3을 참조하면, 제2 인공 신경망은 제2 입력 데이터 중 하나를 기초로 제2 출력 데이터를 생성할 수 있다. 예를 들어, 제1 인공 신경망이 전체 전력 데이터 중 A 및 A+F시간 사이의 전력 데이터를 포함하 는 제1 입력 데이터를 기초로 제1 출력 데이터를 생성하는 경우, 제2 인공 신경망은 A 및 A+F시간 사이의 전력 데이터 중, 연속되는 G시간의 전력 데이터를 포함하는 제2 입력 데이터를 기초로 제2 출력 데이터를 생성 할 수 있다. 이 경우, 제2 입력 데이터는 A+(M-1)*G 및 A+M*G시간 사이의 전력 데이터를 포함할 수 있다. M은 0 내지 27일 수 있다. 한편, 제2 인공 신경망은 다음과 같이 구성될 수 있다. 도 5는 본 발명의 일 실시예에 따른 제2 인공 신경망의 블록도이다. 도 5를 참조하면, 제2 인공 신경망은 도 3의 제2 인공 신경망과 동일하거나 유사하게 구성될 수 있다. 제2 인공 신경망은 K개의 입력 레이어들(511 내지 513), K개의 히든 레이어들(521 내지 523) 및 출 력 레이어를 포함할 수 있다. 예를 들어, 제2 입력 데이터는 A+(M-1)*G 및 A+M*G시간 사이의 전력 데이터 를 포함하는 경우, K는 G일 수 있다. 제1 입력 레이어는 제1 히든 레이어와 연결될 수 있고, 제2 입력 레이어는 제2 히든 레이어 와 연결될 수 있으며, 제K 입력 레이어은 제K 히든 레이어와 연결될 수 있다. 또한, 제K 히든 레이어는 출력 레이어와 연결될 수 있다. 제1 입력 레이어는 제2 입력 데이터 중 일부인 제1 전력 데이터를 전력 데이터 생성부(예를 들어, 도 2의 전력 데이터 생성부)로부터 입력 받을 수 있다. 예를 들어, 제2 입력 데이터가 A+(M-1)*G 및 A+M*G시간 사 이의 전력 데이터를 포함하는 경우, 제1 전력 데이터는 A 및 A+1 시간 사이의 전력 데이터일 수 있다. 제1 입력 레이어는 제1 전력 데이터에 대한 처리를 수행하여 제1 전력 벡터()를 생성할 수 있다. 제1 입력 레이 어는 제1 전력 벡터()를 제1 히든 레이어에 전송할 수 있다. 제1 히든 레이어는 제1 전력 벡터()를 제1 입력 레이어로부터 수신할 수 있다. 제1 히든 레이어 는 제1 전력 벡터()를 기초로 제1 히든 벡터()를 생성할 수 있다. 제 1히든 레이어는 제1 히든 벡터()를 제2 히든 레이어에 전송할 수 있다. 제2 입력 레이어는 제2 입력 데이터 중 일부인 제2 전력 데이터를 입력 받을 수 있다. 예를 들어, 제2 입 력 데이터가 0 및 6시간 사이의 전력 데이터를 포함하는 경우 제2 전력 데이터는 1 및 2 시간 사이의 전력 데이 터일 수 있다. 제2 입력 레이어는 제2 전력 데이터에 대한 처리를 수행하여 제2 전력 행렬()을 생성할 수 있다. 제2 입력 레이어는 제2 전력 행렬()을 제2 히든 레이어에 전송할 수 있다. 제2 히든 레이어는 제2 전력 행렬()을 제2 입력 레이어로부터 수신할 수 있다. 또한 제2 히든 레 이어는 제1 히든 행렬()을 제1 히든 레이어로부터 수신할 수 있다. 제2 히든 레이어는 제2 전력 행렬() 및 제1 히든 행렬()를 기초로 제2 히든 행렬()을 생성할 수 있다. 제2 히든 레이어 는 수학식 1(도 4 참조)에 따라 히든 제2 히든 행렬()을 생성할 수 있다. 이 경우, 수학식 1의 는 일 수 있고, 는 일 수 있으며, 는 일 수 있고, 는 일 수 있다. 제2 히든 레이어는 제2 히든 행렬()을 제3 히든 레이어에 전송할 수 있다. 이와 같은 방법으로, 제K 입력 레이어는 제M 전력 데이터를 수신할 수 있고, 제M 전력 데이터에 대한 처리 를 수행하여 제K 전력 행렬()을 생성하여 제K 히든 레이어에 전송할 수 있다. 예를 들어, 제2 입력 데 이터가 A+(M-1)*G 및 A+M*G시간 사이의 전력 데이터를 포함하는 경우, 제K 전력 데이터는 A+M*G-1 및 A+M*G시간 사이의 전력 데이터일 수 있다. 제K 히든 레이어는 제M 전력 행렬()을 제K 입력 레이어로부터 수신할 수 있고, 제K-1 히든 행렬 ( )을 제K-1 히든 레이어로부터 수신할 수 있다. 제K 히든 레이어는 제K 전력 행렬() 및 제K-1 히 든 행렬( )를 기초로 제K 히든 행렬()을 생성할 수 있다. 제K 히든 레이어는 수학식 1을 기초로 제M 히든 행렬()을 생성할 수 있다. 제K 히든 레이어는 제K 히든 행렬()을 출력 레이어에 전 송할 수 있다. 출력 레이어는 제K 히든 행렬()을 제K 히든 레이어로부터 수신할 수 있다. 출력 레이어는 제K 히든 행렬()를 기초로 제2 출력 데이터()를 생성할 수 있다. 출력 레이어는 제2 크기의 제2 출 력 데이터()를 생성할 수 있다. 제2 크기는 제1 크기 미만일 수 있다. 또한, 출력 레이어는 수학식 2 (도 4 참조)를 기초로 제2 출력 데이터()를 생성할 수 있다. 이 경우, 수학식 2의 는 일 수 있고, 는 일 수 있으며, 는 일 수 있으며, t는 K일 수 있다. 제2 입력 데이터가 A+(M-1)*G 및 A+M*G시간 사 이의 전력 데이터를 포함하는 경우, 경우 K는 A+M*G일 수 있다. 출력 레이어는 제2 출력 데이터()를 데 이터 병합부(예를 들어, 도 3의 데이터 병합부)에 전송할 수 있다. 한편, 제1 입력 데이터(도 4 참조)가 전체 전력 데이터 중 A 내지 A+F 시간 사이의 전력 데이터를 포함하는 경 우, 이와 같은 과정을 반복 수행하여 A+F-G 및 A+F 시간 사이의 전력 데이터를 포함하는 제2 입력 데이터에 대 한 제2 출력 데이터를 생성하여 데이터 병합부에 전송할 수 있다. 다시 도 3을 참조하면, 데이터 병합부는 제1 출력 데이터(예를 들어, 도 4의 제1 출력 데이터()를 제1 인공 신경망으로부터 수신할 수 있다. 또한, 데이터 병합부는 제2 출력 데이터()를 제2 인공 신경 망으로부터 수신할 수 있다. 데이터 병합부는 제1 출력 데이터 및 제2 출력 데이터를 기초로 제3 입력 데이터를 생성할 수 있다. 데이터 병합부는 제1 출력 데이터 및 제2 출력 데이터에 대한 병합을 수행하 여 제3 입력 데이터를 생성할 수 있다. 데이터 병합부는 제3 입력 데이터를 제3 인공 신경망에 전송 할 수 있다. 제3 인공 신경망은 제3 입력 데이터를 데이터 병합부로부터 수신할 수 있다. 제3 인공 신경망은 제3 입력 데이터를 기초로 제3 출력 데이터를 생성할 수 있다. 제3 인공 신경망은 다음과 같이 구성될 수 있다. 도 6은 본 발명의 일 실시예에 따른 제3 인공 신경망의 개념도이다. 도 6의 제3 인공 신경망은 도 3의 제3 인공 신경망과 동일하거나 유사하게 구성될 수 있다. 도 6을 참조하면 제3 인공 신경망은 입력 레이어들(611 내지 613), 제1 히든 레이어들(621 내지 624) 제2 히든 레 이어들(631 내지 634) 및 출력 레이어를 포함할 수 있다. 한편, 도면에는 3개의 입력 레이어들(611 내지 613), 4개의 제1 히든 레이어들(621 내지 624), 4개의 제2 히든 레이어들(631 내지 634) 및 출력 레이어 가 도시되어 있으나, 이는 일 예시일 뿐이며 이에 한정하지 아니한다. 입력 레이어들(611 내지 613) 각각은 복수의 인공 노드(artificial node)를 통해 제1 히든 레이어들(621 내지 624) 전부와 연결(fully-connected)될 수 있다. 제1 히든 레이어들(621 내지 624) 각각은 복수의 인공 노드를 통해 제2 히든 레이어들(631 내지 634) 전부와 연결(fully-connected)될 수 있다. 또한, 제2 히든 레이어들 (631 내지 634)은 전부 복수의 인공 노드를 통해 출력 레이어와 연결될 수 있다. 한편, 제3 인공 신경망 이 제3 입력 데이터를 기초로 생성한 제3 출력 데이터는 다음 수학식 3과 같이 나타낼 수 있다. 수학식 3"}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3에서, 는 제3 출력 데이터일 수 있고, 는 가중치일 수 있으며, 는 제3 입력 데이터일 수 있고, 은 가우시안 잡음일 수 있다. 제1 입력 데이터가 전체 전력 데이터 중 A 및 A+F시간 사이의 전력 데이터를 포 함하는 경우, t는 168일 수 있다. 이 경우, 제3 출력 데이터()는 A+F+1 시간에서의 부하에 대한 예측 데이 터를 포함할 수 있다. 제3 인공 신경망은 제3 출력 데이터를 부하 연산부(예를 들어, 도 3의 부하 연산부 )에 전송할 수 있다. 다시 도 3을 참조하면, 부하 연산부는 제3 출력 데이터를 제3 인공 신경망으로부터 수신할 수 있다. 부하 연산부는 제3 출력 데이터를 기초로 연산을 수행하여 제1 입력 데이터에 포함된 전력 데이터 이후 시 간의 부하를 예측할 수 있다. 예를 들어, 제1 입력 데이터가 A 및 A+F 시간 사이의 전력 데이터를 포함하는 경 우, 부하 연산부는 제3 출력 데이터를 기초로 연산을 수행하여 A+F 시간에서의 부하를 예측할 수 있다. 부 하 연산부는 부하 예측 값을 제어부(예를 들어, 도 2의 제어부)에 전송할 수 있다. 한편, 도 3의 제1 인공 신경망, 제2 인공 신경망, 및 제3 인공 신경망은 역전파(back propagation) 알고리즘을 기초로 미리 학습될 수 있으며 학습 방법은 다음과 같을 수 있다. 도 7은 본 발명의 일 실시예에 따른 인공 신경망 학습법의 흐름도이다. 도 7을 참조하면, 인공 신경망은 학습 모델을 생성할 수 있다(S710). 제1 인공 신경망 및 제2 인공 신경망은 수 학식 1 및 2와 같은 학습 모델을 생성할 수 있다. 또한, 제3 인공 신경망은 수학식 3과 같은 학습 모델을 생성 할 수 있다. 인공 신경망은 학습 데이터를 생성할 수 있다(S720). 인공 신경망은 입력 데이터에 포함된 전력 데이터를 기초 로 학습 데이터를 생성할 수 있다. 학습 데이터는 복수의 데이터 셋들을 포함할 수 있다. 데이터 셋들 각각은 입력 값 및 입력 값에 따른 실제 출력 값을 포함할 수 있다. 인공 신경망은 데이터 셋들 중 하나를 검증 셋 (test set)으로 나머지를 트레이닝 셋(training set)으로 분류할 수 있다. 데이터 셋들 중 하나를 검증 셋으로나머지를 트레이닝 셋으로 분류할 수 있다. 예를 들어, 인공 신경망이 제1 인공 신경망(예를 들어, 도 3의 제1 인공 신경망)인 경우, 인공 신경망은 제1 입력 데이터를 기초로 제1 학습 데이터를 생성할 수 있다. 제1 학습 데이터는 복수의 제1 트레이닝 셋들 및 하나의 제1 검증 셋 및 하나의 제1 테스트 셋을 포함할 수 있다. 인공 신경망이 제2 인공 신경망인 경우, 인공 신경망은 제2 입력 데이터를 기초로 제2 학습 데이터를 생성할 수 있다. 제2 학습 데이터는 복수의 제2 트레이 닝 셋들, 하나의 제2 검증 셋 및 하나의 제2 테스트 셋을 포함할 수 있다. 인공 신경망이 제3 인공 신경망인 경 우, 인공 신경망은 제3 입력 데이터를 기초로 제3 학습 데이터를 생성할 수 있다. 제3 학습 데이터는 복수의 제 3 트레이닝 셋들, 하나의 제3 검증 셋 및 하나의 제3 테스트 셋을 포함할 수 있다. 인공 신경망은 학습 데이터를 기초로 학습을 수행할 수 있다(S730). 인공 신경망은 트레이닝 셋을 기초로 학습 을 수행할 수 있다. 인공 신경망은 트레이닝 셋들을 수신하여, 트레이닝 셋들 각각에 대한 출력 값 생성할 수 있다. 인공 신경망은 트레이닝 셋들의 출력 값 각각을 실제 출력 값 각각과 비교하는 방식으로 학습을 수행할 수 있다. 인공 신경망은 다음 수학식 4의 MSE(Mean of Squared Error) 손실 함수를 기초로 학습을 수행할 수 있 다. 수학식 4"}
{"patent_id": "10-2020-0090561", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4에서, 는 오차들의 평균 값일 수 있고, 는 트레이닝 셋들 각각의 출력 값일 수 있으며, 는 실제 출력 값일 수 있다. 즉, 인공 신경망은 트레이닝 셋들 각각의 출력 값() 및 이에 대응하는 실제 출력 값()의 차이의 평균을 연산하는 방식으로, 오차들의 평균 값( )을 연산할 수 있다. 인공 신경망은 연산 결과를 기초로 학습 모델의 가중치를 조정할 수 있다. 예를 들어, 인공 신경망이 제1 인공 신경망 또는 제2 인 공 신경망인 경우, 제1 인공 신경망의 제3 가중치인 (도 4참조), 제2 가중치인 (도 4 참조)를 및 제1 가중 치인 (도 4 참조)를 순차적으로 조정할 수 있다. 제2 인공 신경망은 비교 결과를 기초로 제2 인공 신경망의 제3 가중치인 (도 5 참조), 제2 가중치인 (도 5 참조) 및 제1 가중치인 (도 5 참조)를 순차적으로 조정 할 수 있다. 또한, 제3 인공 신경망은 비교 결과를 기초로 제3 인공 신경망의 가중치인 (도 6 참조)를 조정 할 수 있다. 인공 신경망은 트레이닝 셋들의 입력 값에 대한 출력 값 및 실제 출력 값의 차이를 최소화 하는 방 식으로 가중치를 조정할 수 있다. 인공 신경망은 검증 셋의 출력 값을 실제 출력 값과 비교하는 방식으로 학습 수행 결과에 대한 검증을 수행할 수 있다. 예를 들어, 인공 신경망이 제1 인공 신경망인 경우, 제1 검증 셋의 출력 값을 실제 출력 값과 비교하 는 방식으로 검증을 수행할 수 있다. 인공 신경망이 제2 인공 신경망인 경우, 제2 검증 셋의 출력 값을 실제 출 력 값과 비교하는 방식으로 검증을 수행할 수 있다. 또한, 인공 신경망이 제3 인공 신경망인 경우, 제3 검증 셋 의 출력 값을 실제 출력 값과 비교하는 방식으로 검증을 수행할 수 있다. 예를 들어, 인공 신경망이 제1 인공 신경망인 경우, 제1 검증 셋의 출력 값과 실제 출력 값을 비교하여 제1 가 중치인 , 제2 가중치인 및 제3 가중치인 를 검증할 수 있다. 인공 신경망이 제2 인공 신경망인 경우, 제2 검증 셋의 출력 값과 실제 출력 값을 비교하여 제1 가중치인 , 제2 가중치인 및 제3 가중치인 를 검증할 수 있다. 또한, 인공 신경망이 제3 인공 신경망인 경우, 제3 검증 셋의 출력 값과 실제 출력 값을 비교 하여 기초로 제3 인공 신경망의 가중치인 를 검증할 수 있다. 인공 신경망은 테스트 셋을 기초로 학습 수행 결과를 테스트할 수 있다. 인공 신경망은 테스트 셋의 출력 값을 실제 출력 값과 비교하는 방식으로 학습 수행 결과에 대한 테스트를 수행할 수 있다. 예를 들어, 인공 신경망이 제1 인공 신경망인 경우, 제1 테스트 셋의 출력 값을 실제 출력 값과 비교하는 방식으로 검증을 수행할 수있다. 인공 신경망이 제2 인공 신경망인 경우, 제2 테스트 셋의 출력 값을 실제 출력 값과 비교하는 방식으로 검증을 수행할 수 있다. 또한, 인공 신경망이 제3 인공 신경망인 경우, 제3 테스트 셋의 출력 값을 실제 출력 값과 비교하는 방식으로 검증을 수행할 수 있다. 다시 도 2를 참조하면, 제어부는 부하 예측 값을 부하 연산부(예를 들어, 도 3의 부하 연산부)로부터 수신할 수 있다. 제어부는 부하 예측 값을 기초로 전력 생산 장치(예를 들어, 도 1의 전력 생산 장치 )의 전력 생산량에 대한 제어를 수행할 수 있다. 도 8은 본 발명의 일 실시예에 따른 부하 예측 방법의 흐름도이다. 도 8을 참조하면, 부하 예측부(예를 들어, 도 2의 부하 예측부)는 제1 입력 데이터 및 제2 입력 데이터를 데이터 생성부(예를 들어, 도 2의 전력 데이터 생성부)로부터 수신할 수 있다(S810). 부하 예측부는 제1 입력 데이터를 기초로 제1 출력 데이터를 생성할 수 있다(S820). 부하 예측부의 제1 인공 신 경망(예를 들어, 도 3의 제1 인공 신경망)은 제1 입력 데이터를 기초로 제1 출력 데이터를 생성할 수 있다. 제1 인공 신경망은 제1 출력 데이터를 부하 예측부의 데이터 병합부(예를 들어, 도 3의 데이터 병합부 )에 전송할 수 있다. 부하 예측부는 제2 입력 데이터를 기초로 제2 출력 데이터를 생성할 수 있다(S830). 부하 예측부의 제2 인공 신 경망(예를 들어, 도 3의 제2 인공 신경망)은 제2 입력 데이터를 기초로 제2 출력 데이터를 생성할 수 있다. 제2 인공 신경망은 제2 출력 데이터를 데이터 병합부에 전송할 수 있다. 부하 예측부는 제1 출력 데이터 및 제2 출력 데이터를 기초로 제3 입력 데이터를 생성할 수 있다(S840). 데이터 병합부는 제1 출력 데이터를 제1 인공 신경망으로부터 수신할 수 있다. 또한, 데이터 병합부는 제2 출력 데이터 를 제2 인공신경망으로부터 수신할 수 있다. 데이터 병합부는 제1 출력 데이터 및 제2 출력 데이터에 대한 합산 을 수행하여 제3 입력 데이터를 생성할 수 있다. 데이터 병합부는 제3 입력 데이터를 부하 예측부의 제3 인공 신경망(예를 들어, 도 3의 제3 인공 신경망)에 전송할 수 있다. 부하 예측부는 제3 입력 데이터를 기초로 제3 출력 데이터를 생성할 수 있다(S850). 제3 인공 신경망은 제3 입 력 데이터를 데이터 병합부로부터 수신할 수 있다. 제3 인공 신경망은 제3 입력 데이터를 기초로 제3 출력 데이 터를 생성할 수 있다. 제3 출력 데이터는 부하 예측 데이터를 포함할 수 있다 즉, 제1 입력 데이터가 t시간까지 의 전력 데이터를 포함하는 경우, 제3 출력 데이터는 t+1 시간에서의 부하에 대한 예측 데이터를 포함할 수 있 다. 제3 인공 신경망은 제3 출력 데이터를 부하 예측부의 부하 연산부(예를 들어, 도 3의 부하 연산부)에 전송할 수 있다. 부하 예측부는 제3 출력 데이터를 기초로 부하를 예측할 수 있다(S860). 부하 연산부는 제3 출력 데이터를 제3 인공 신경망으로부터 수신할 수 있다. 부하 연산부는 제3 출력 데이터에 대한 연산을 수행하여 부하를 예측할 수 있다. 예를 들어, 제1 입력 데이터가 t시간까지의 전력 데이터를 포함하는 경우, 부하 연산부는 제3 출력 데 이터를 기초로 t+1 시간에서의 부하를 예측할 수 있다. 한편, 도 1의 전력 제어 장치는 통신 노드일 수 있 고, 다음과 같이 구성될 수 있다. 도 9는 본 발명의 다른 실시예에 따른 전력 제어 장치의 블록도이다. 도 9을 참조하면 전력 제어 장치는 프로세서, 메모리, 송신 모듈 및 수신 모듈을 포 함할 수 있다. 또한, 전력 제어 장치는 저장 장치등을 더 포함할 수 있다. 전력 제어 장치에 포 함된 각각의 구성요소들은 버스(bus)에 의해 연결되어 서로 통신을 수행할 수 있다. 다만, 전력 제어 장치에 포함된 각각의 구성요소들은 공통 버스가 아니라, 프로세서를 중심으로 개별 인터페이스 또는 개별 버스를 통하여 연결될 수도 있다. 예를 들어, 프로세서는 메모리, 송신 모듈, 수신 모듈 및 저장 장치중 적어도 하나와 전용 인터페이스를 통하여 연결될 수도 있다. 프로세서는 메모리 및 저장 장치 중에서 적어도 하나에 저장된 프로그램 명령(program comman d)을 실행할 수 있다. 프로세서는 중앙 처리 장치(central processing unit, CPU), 그래픽 처리 장치(graphics processing unit, GPU), 또는 본 발명의 실시예들에 따른 방법들이 수행되는 전용의 프로세서를 의미 할 수 있다. 메모리 및 저장 장치 각각은 휘발성 저장 매체 및 비휘발성 저장 매체 중에서 적어도 하 나로 구성될 수 있다. 예를 들어, 메모리는 읽기 전용 메모리(read only memory, ROM) 및 랜덤 액세스 메 모리(random access memory, RAM) 중에서 적어도 하나로 구성될 수 있다. 본 발명에 따른 방법들은 다양한 컴퓨터 수단을 통해 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독 으로 또는 조합하여 포함할 수 있다. 컴퓨터 판독 가능 매체에 기록되는 프로그램 명령은 본 발명을 위해 특별 히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 매체의 예에는 롬(rom), 램(ram), 플래시 메모리(flash memory) 등과 같이 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러(compiler)에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터(interpreter) 등을 사용해서 컴퓨터에 의해 실 행될 수 있는 고급 언어 코드를 포함한다. 상술한 하드웨어 장치는 본 발명의 동작을 수행하기 위해 적어도 하 나의 소프트웨어 모듈로 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2020-0090561", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 전력 계통 시스템의 개념도이다. 도 2는 본 발명의 일 실시예에 따른 전력 제어 장치의 블록도이다. 도 3은 본 발명의 일 실시예에 따른 부하 예측부의 블록도이다. 도 4는 본 발명의 일 실시예에 따른 제1 인공 신경망의 블록도이다. 도 5는 본 발명의 일 실시예에 따른 제2 인공 신경망의 블록도이다. 도 6은 본 발명의 일 실시예에 따른 제3 인공 신경망의 개념도이다. 도 7은 본 발명의 일 실시예에 따른 인공 신경망 학습법의 흐름도이다. 도 8은 본 발명의 일 실시예에 따른 부하 예측 방법의 흐름도이다. 도 9는 본 발명의 일 실시예에 따른 통신 노드의 블록도이다."}
