{"patent_id": "10-2024-7027405", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0168934", "출원번호": "10-2024-7027405", "발명의 명칭": "RIS 상태 피드백, 수신 방법 및 장치", "출원인": "지티이 코포레이션", "발명자": "수 페이"}}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "재구성 가능한 지능형 표면(RIS) 컨트롤러는 기지국(BS)으로 상태 정보를 피드백하는 단계를 포함하며,상기 상태 정보는 상기 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의상태 정보를 포함하는 것인 RIS 상태 피드백 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,재구성 가능한 지능형 표면(RIS) 컨트롤러는 기지국(BS)으로 상태 정보를 피드백하는 단계는,상기 RIS 컨트롤러가 상기 BS에 액세스되는 초기 액세스 단계에서 상기 RIS 컨트롤러는 BS로 상태 정보를 능동적으로 피드백하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,재구성 가능한 지능형 표면(RIS) 컨트롤러는 기지국(BS)으로 상태 정보를 피드백하는 단계는,상기 RIS 컨트롤러 및 이에 의해 관리되는 상기 복수개의 RIS 보드의 안정적인 작동 단계에서 상기 RIS 컨트롤러는 상기 BS로부터의 상태 정보 조회 명령어를 수신하는 단계;상기 RIS 컨트롤러는 상기 조회 명령어에 따라 상기 BS로 상태 정보를 피드백하는 단계; 를 포함하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,재구성 가능한 지능형 표면(RIS) 컨트롤러는 기지국(BS)으로 상태 정보를 피드백하는 단계는,상기 재구성 가능한 지능형 표면(RIS) 컨트롤러 및 이에 의해 관리되는 상기 복수개의 RIS 보드의 안정적인 작동 단계에서 상기 RIS 컨트롤러는 자체 또는 이에 의해 관리되는 상기 복수개의 RIS 보드의 상태 이상을 검출하는 단계;상기 RIS 컨트롤러는 상기 BS로 상태 정보를 피드백하는 단계; 를 포함하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중의 어느 한 항에 있어서,상기 RIS 컨트롤러의 상태 정보는 전기량 상태, 전력소모값, 온도값 및 작동 상태 중의 적어도 하나를 포함하는방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제4항 중의 어느 한 항에 있어서,상기 각 RIS 보드의 상태 정보는 전력소모값, 온도값, 코드북 다시 읽기 상태, 좌표, 방위각 및 다운틸트각 중의 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제4항 중의 어느 한 항에 있어서,상기 RIS 컨트롤러는 물리적 랜덤 액세스 채널(PRACH) 또는 물리적 상향링크 공유 채널(PUSCH)을 통해 상기 BS공개특허 10-2024-0168934-3-로 상태 정보를 피드백하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서,상기 RIS 컨트롤러는 동기 신호 블록(SSB) 또는 물리적 하향링크 공유 채널(PDSCH)을 통해 상기 BS에 의해 송신되는 상기 상태 정보 조회 명령어를 수신하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "기지국(BS)은 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 상태 정보를 수신하는 단계를 포함하며,상기 상태 정보는 상기 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의상태 정보를 포함하는 것인 RIS 상태 수신 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,기지국(BS)은 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 상태 정보를 수신하는 단계는,상기 RIS 컨트롤러가 상기 BS에 액세스되는 초기 액세스 단계에서 상기 BS은 상기 RIS 컨트롤러에 의해 능동적으로 피드백되는 상태 정보를 수신하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,기지국(BS)은 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 상태 정보를 수신하는 단계는,상기 RIS 컨트롤러 및 이에 의해 관리되는 상기 복수개의 RIS 보드의 안정적인 작동 단계에서 상기 BS는 상기RIS 컨트롤러로 상태 정보 조회 명령어를 송신하는 단계;상기 BS는 상기 RIS 컨트롤러에서 상기 상태 정보 조회 명령어에 따라 피드백한 상태 정보를 수신하는 단계; 를포함하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,기지국(BS)은 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 상태 정보를 수신하는 단계는,상기 BS는 상기 RIS 컨트롤러에 의해 RIS 자체 또는 이에 의해 관리되는 상기 복수개의 RIS 보드의 상태 이상이검출될 경우 피드백되는 상태 정보를 수신하는 단계를 포함하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항 내지 제12항 중의 어느 한 항에 있어서,상기 RIS 컨트롤러의 상태 정보는 전기량 상태, 전력소모값, 온도값 및 작동 상태 중의 적어도 하나를 포함하는방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항 내지 제12항 중의 어느 한 항에 있어서,상기 각 RIS 보드의 상태 정보는 전력소모값, 온도값, 코드북 다시 읽기 상태, 좌표, 방위각 및 다운틸트각 중의 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항 내지 제12항 중의 어느 한 항에 있어서,공개특허 10-2024-0168934-4-상기 BS는 물리적 랜덤 액세스 채널(PRACH) 또는 물리적 상향링크 공유 채널(PUSCH)을 통해 상기 RIS 컨트롤러에 의해 피드백되는 상태 정보를 수신하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 BS는 동기 신호 블록(SSB) 또는 물리적 하향링크 공유 채널(PDSCH)을 통해 상기 RIS 컨트롤러로 상기 상태정보 조회 명령어를 송신하는 방법."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "RIS 컨트롤러에 위치하는 RIS 상태 피드백 장치에 있어서,기지국(BS)으로 상기 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함하는 상태 정보를 피드백하도록 구성되는 상태 피드백 모듈을 포함하는 RIS 상태 피드백 장치."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 상태 피드백 모듈은,상기 RIS 컨트롤러가 상기 BS에 액세스되는 초기 액세스 단계에서 BS로 상기 상태 정보를 능동적으로 피드백하도록 구성되는 제1 피드백 유닛;상기 RIS 컨트롤러 및 이에 의해 관리되는 상기 복수개의 RIS 보드의 안정적인 작동 단계에서 상기 BS로부터의상태 정보 조회 명령어를 수신하고, 상기 상태 정보 조회 명령어에 따라 상기 BS로 상기 상태 정보를 피드백하도록 구성되는 제2 피드백 유닛;상기 RIS 컨트롤러 및 이에 의해 관리되는 상기 복수개의 RIS 보드의 안정적인 작동 단계에서 상기 RIS 컨트롤러 또는 이에 의해 관리되는 상기 복수개의 RIS 보드의 상태 이상을 검출하고, 상기 BS로 상기 상태 정보를 피드백하도록 구성되는 제3 피드백 유닛; 중의 적어도 하나를 포함하는 장치."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "기지국에 위치하는 RIS 상태 수신 장치에 있어서,재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함하는 상태 정보를 수신하기 위한 상태 수신 모듈을 포함하는 RIS 상태 수신 장치."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 상태 수신 모듈은,상기 RIS 컨트롤러가 상기 BS에 액세스되는 초기 액세스 단계에서 상기 RIS 컨트롤러에 의해 능동적으로 피드백되는 상기 상태 정보를 수신하도록 구성되는 제1 수신 유닛;상기 RIS 컨트롤러 및 이에 의해 관리되는 상기 복수개의 RIS 보드의 안정적인 작동 단계에서 상기 RIS 컨트롤러로 상태 정보 조회 명령어를 송신하고, 상기 RIS 컨트롤러에 의해 피드백되는 상기 상태 정보를 수신하도록구성되는 제2 수신 유닛;상기 RIS 컨트롤러 및 이에 의해 관리되는 상기 복수개의 RIS 보드의 안정적인 작동 단계에서 상기 RIS 컨트롤러에서 RIS 자체 또는 이에 의해 관리되는 상기 복수개의 RIS 보드의 상태 이상이 검출될 경우, 상기 RIS 컨트롤러에 의해 피드백되는 상기 상태 정보를 수신하도록 구성되는 제3 수신 유닛; 중의 적어도 하나를 포함하는장치."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "공개특허 10-2024-0168934-5-컴퓨터 프로그램이 저장되는 컴퓨터 판독가능 저장 매체에 있어서,상기 컴퓨터 프로그램이 프로세서에 의해 실행될 시 제1항 내지 제16항 중의 어느 한 항에 따른 방법을 실행하는 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2024-7027405", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "메모리, 프로세서 및 상기 메모리에 저장되어 상기 프로세서에서 실행되는 컴퓨터 프로그램을 포함하는 전자 장치에 있어서,상기 프로세서는 상기 컴퓨터 프로그램을 실행할 시 제1항 내지 제16항 중의 어느 한 항에 따른 방법을 실행하는 전자 장치."}
{"patent_id": "10-2024-7027405", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예는 재구성 가능한 지능형 표면(RIS) 상태 피드백, 수신 방법 및 장치를 제공한다. 상기 RIS 상 태 피드백 방법은 RIS 컨트롤러는 기지국(BS)으로 상태 정보를 피드백하는 단계를 포함하며, 상기 상태 정보는 상기 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함한 다. 본 발명의 실시예에서는, RIS 컨트롤러에서 자체 및 이에 의해 관리되는 RIS 보드의 상태 정보를 기지국에 피드백하고, 기지국에서 RIS 컨트롤러 및 이에 의해 관리되는 RIS 보드의 상태를 효과적으로 관리하는 것을 통해, RIS 컨트롤러 또는 RIS 보드의 상태 이상으로 인한 네트워크 성능 열화를 적시로 발견 및 처리함으로써, 네트워크 성능을 향상시키는 효과에 도달할 수 있다."}
{"patent_id": "10-2024-7027405", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 통신 분야에 관한 것으로, 구체적으로는 RIS 상태 피드백, 수신 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2024-7027405", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "재구성 가능한 지능형 표면(Reconfigurable Intelligent Surface, RIS라고 약칭함)은 프로그래밍 가능한 특성 을 갖는 인공 전자기 재료로서, 어레이 각각의 위상을 제어하여 사출 빔이 원하는 방향으로 포커싱되도록 제어 함으로써, 전자기 환경에 대한 제어를 실현할 수 있다. 기존 기술에서는 RIS에 대한 상태 관리를 고려하지 못하고 있다. 본 발명의 실시예는 적어도 관련 기술에서 RIS 상태 정보를 모니터링 관리할 수 없고, RIS 이상 상태를 적시로 발견 및 해결할 수 없음으로 인해 발생되는 네트워크 커버 이상 및 네트워크 성능 열화의 과제를 해결하기 위한 RIS 상태 피드백, 수신 방법 및 장치를 제공한다. 본 발명의 일 실시예에 따르면, 재구성 가능한 지능형 표면(RIS) 컨트롤러는 기지국(BS)으로 상태 정보를 피드 백하는 단계를 포함하며, 상기 상태 정보는 상기 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트롤러에 의해 관리 되는 복수개의 RIS 보드의 상태 정보를 포함하는 것인 RIS 상태 피드백 방법을 제공한다. 본 발명의 다른 일 실시예에 따르면, 기지국(BS)은 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되 는 상태 정보를 수신하는 단계를 포함하며, 상기 상태 정보는 상기 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트 롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함하는 것인 RIS 상태 수신 방법을 제공한다. 본 발명의 다른 일 실시예에 따르면, RIS 컨트롤러에 위치하는 RIS 상태 피드백 장치에 있어서, 기지국(BS)으로 상기 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함 하는 상태 정보를 피드백하도록 구성되는 상태 피드백 모듈을 포함하는 RIS 상태 피드백 장치를 제공한다. 본 발명의 다른 일 실시예에 따르면, 기지국에 위치하는 RIS 상태 수신 장치에 있어서, 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 상기 RIS 컨트롤러의 상태 정보 및 상기 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함하는 상태 정보를 수신하기 위한 상태 수신 모듈을 포함하는 RIS 상태 수 신 장치를 제공한다. 본 발명의 또 다른 실시예에 따르면, 컴퓨터 프로그램이 저장되는 컴퓨터 판독가능 저장 매체에 있어서, 상기 컴퓨터 프로그램을 실행할 시 상술한 어느 한 항의 방법 실시예에서의 단계를 수행하도록 구성되는 컴퓨터 판독 가능 저장 매체를 더 제공한다. 본 발명의 또 다른 실시예에 따르면, 메모리 및 프로세서를 포함하는 전자 장치에 있어서, 상기 메모리에는 컴 퓨터 프로그램이 저장되고, 상기 프로세서는 상기 컴퓨터 프로그램을 실행하여 상술한 어느 한 항의 방법 실시 예에서의 단계를 수행하도록 구성되는 전자 장치를 더 제공한다."}
{"patent_id": "10-2024-7027405", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하면서 실시예와 함께 본 발명의 실시예를 상세하게 설명한다. 설명해야 할 것은, 본 발명 실시예의 명세서, 특허청구범위 및 상기 도면에서의 \"제1\", \"제2\" 등 용어는 유사한 객체를 구분하기 위한 것으로, 특정된 순서 또는 선후순서를 설명하는데 사용되는 것은 아니다. 본 출원의 실시예는 도 1에 도시된 네트워크 아키텍처에서 실행될 수 있다. 도 1에 도시된 바와 같이, 상기 네 트워크 아키텍처는 기지국(BS), RIS 컨트롤러(RIS 컨트롤러 0 및 RIS 컨트롤러 1을 포함함), RIS 보드(RIS 0, RIS 1 및 RIS 2를 포함함) 및 사용자 단말기(UE, 이는 UE 0, UE 1, UE 2, UE 3을 포함함)를 포함한다. 여기서, 기지국(BS)은 RIS 컨트롤러 0 및 RIS 컨트롤러 1을 통해 커버리지를 보강하며, RIS 컨트롤러 0은 RIS 0 및 RIS 1을 관리하고, RIS 컨트롤러 1은 RIS 2를 관리하며, RIS 0은 사용자 단말기 UE 0을 커버하고, RIS 1은 사용자 단말기 UE 1을 커버하며, RIS 2는 사용자 단말기 UE 2 및 UE 3을 커버한다. 본 실시예에서는 상기 네트워크 아키텍처에서 실행되는 RIS 상태 피드백 방법을 제공한다. 도 2는 본 발명의 실 시예에 따른 RIS 상태 피드백 방법의 흐름도이다. 도 2에 도시된 바와 같이, 상기 흐름은 하기와 같은 단계 S202를 포함한다. 단계 S202에서, RIS 컨트롤러는 BS로 상태 정보를 피드백한다. 여기서, 상태 정보는 RIS 컨트롤러의 상태 정보 및 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함한다. 상기 단계를 통해, RIS 컨트롤러는 BS로 RIS 컨트롤러의 상태 정보 및 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 피드백함으로써, 관련 기술에서 RIS 상태 정보를 모니터링 및 관리할 수 없고, RIS 이 상 상태를 적시로 발견 및 해결할 수 없음으로 인해 발생되는 네트워크 커버 이상 및 네트워크 성능 열화의 과 제를 해결하여, RIS 상태 정보를 모니터링하고 RIS 이상 상황을 적시로 처리함으로써, 네트워크 성능 열화를 방 지하는 능력을 향상시킨다. 여기서, 상기 단계의 수행 주체는 RIS 컨트롤러 등일 수 있으며, 이에 한정되지 않는다. 예시적인 일 실시예에서는, 도 3은 본 발명의 실시예에 따른 RIS 상태 능동적 피드백 방법의 흐름도이다. 도 3 에 도시된 바와 같이, 상기 흐름은 하기와 같은 단계 S302를 포함한다. 단계 S302에서, RIS 컨트롤러는 BS로 상태 정보를 능동적으로 피드백한다. 상기 단계 S302는 RIS 컨트롤러가 BS 에 액세스되는 초기 액세스 단계에서 발생된다. 여기서, RIS 컨트롤러는 랜덤 액세스 과정을 통해 소속되는 기 지국(BS)에서의 액세스 과정을 완성할 수 있다. 예시적인 일 실시예에서는, 도 4는 본 발명의 실시예에 따른 RIS 상태 피드백 방법의 흐름도이다. 도 4에 도시 된 바와 같이, 상기 흐름은 하기와 같은 단계 S402 및 단계 S404를 포함한다. 단계 S402에서, RIS 컨트롤러는 BS로부터의 상태 정보 조회 명령어를 수신한다. 단계 S404에서, RIS 컨트롤러는 조회 명령어에 따라 BS로 상태 정보를 피드백한다. 상기 단계 S402 및 S404는 RIS 컨트롤러 및 이에 의해 관리되는 복수개의 RIS 보드의 안정적인 작동 단계에서 발생된다. 상기 도 4에 도시된 실시예에서는, RIS 컨트롤러는 동기 신호 블록(SSB, Synchronization Signal Block) 또는 물리적 하향링크 공유 채널(PDSCH, Physical Downink Shared Channel)을 통해 BS에 의해 송신되는 상태 정보 조회 명령어를 수신한다. 예시적인 일 실시예에서는, 도 5는 본 발명의 실시예에 따른 RIS 상태 피드백 방법의 흐름도이다. 도 5에 도시 된 바와 같이, 상기 흐름은 하기와 같은 단계 S502 및 단계 S504를 포함한다. 단계 S502에서, RIS 컨트롤러는 자체 또는 이에 의해 관리되는 복수개의 RIS 보드의 상태 이상을 검출한다. 단계 S504에서, RIS 컨트롤러는 BS로 상태 정보를 피드백한다. 상기 단계 S502 및 S504는 RIS 컨트롤러 및 이에 의해 관리되는 복수개의 RIS 보드의 안정적인 작동 단계에서 발생된다. 상기 도 2 내지 도 5에 도시된 실시예에서는, RIS 컨트롤러의 상태 정보는 전기량 상태, 전력소모값, 온도값 및 작동 상태 중의 적어도 하나를 포함할 수 있다. 상기 도 2 내지 도 5에 도시된 실시예에서는, RIS 보드 각각의 상태 정보는 전력소모값, 온도값, 코드북 다시 읽기 상태, 좌표, 방위각 및 다운틸트각 중의 적어도 하나를 포함할 수 있다. 상기 도 2 내지 도 5에 도시된 실시예에서는, RIS 컨트롤러는 물리적 랜덤 액세스 채널(PRACH, Physical Random Access Channel) 또는 물리적 상향링크 공유 채널(PUSCH, Physical Uplink Shared Channel)을 통해 BS로 상태 정보를 피드백할 수 있다. 본 실시예에서는 네트워크 아키텍처에서 실행되는 RIS 상태 수신 방법을 더 제공한다. 도 6은 본 발명의 실시예 에 따른 RIS 상태 수신의 흐름도이다. 도 6에 도시된 바와 같이, 상기 흐름은 하기와 같은 단계 S602를 포함한 다. 단계 S602에서, 기지국(BS)은 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 상태 정보를 수신한 다. 여기서, 상태 정보는 RIS 컨트롤러의 상태 정보 및 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상 태 정보를 포함한다. 상기 단계를 통해, 기지국(BS)은 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 RIS 컨트롤러의 상태 정보 및 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 수신함으로써, 관련 기술에서 RIS 상태 정보를 모니터링 및 관리할 수 없고, RIS 이상 상태를 적시로 발견 및 해결할 수 없음으로 인해 발생 되는 네트워크 커버 이상 및 네트워크 성능 열화의 과제를 해결하여, RIS 상태 정보를 모니터링하고 RIS 이상 상황을 적시로 처리함으로써, 네트워크 성능 열화를 방지하는 능력을 향상시킨다. 여기서, 상기 단계의 수행 주체는 기지국 등일 수 있으며, 이에 한정되지 않는다. 예시적인 일 실시예에서는, 도 7은 본 발명의 실시예에 따른 RIS 상태 수신 방법의 흐름도이다. 도 7에 도시된 바와 같이, 상기 흐름은 하기와 같은 단계 S702를 포함한다. 단계 S702에서, BS는 RIS 컨트롤러에 의해 능동적으로 피드백되는 상태 정보를 수신한다. 상기 단계 S702는 RIS 컨트롤러가 BS에 액세스되는 초기 액세스 단계에서 발생된다. 여기서, RIS 컨트롤러는 램덤 액세스 과정을 통해 관련된 기지국(BS)에서의 액세스 과정을 완성할 수 있다. 예시적인 일 실시예에서는, 도 8은 본 발명의 실시예에 따른 RIS 상태 지시 수신 방법의 흐름도이다. 도 8에 도 시된 바와 같이, 상기 흐름은 하기와 같은 단계 S802 및 단계 S804를 포함한다. 단계 S802에서, BS는 RIS 컨트롤러로 상태 정보 조회 명령어를 송신한다. 단계 S804에서, BS는 RIS 컨트롤러에서 상태 정보 조회 명령어에 따라 피드백한 상태 정보를 수신한다. 상기 단 계 S802 및 S804는 RIS 컨트롤러 및 이에 의해 관리되는 복수개의 RIS 보드의 안정적인 작동 단계에서 발생된다. 상기 도 8에 도시된 실시예에서는, BS는 동기 신호 블록(SSB) 또는 물리적 하향링크 공유 채널(PDSCH)을 통해 RIS 컨트롤러로 상태 정보 조회 명령어를 송신할 수 있다. 예시적인 일 실시예에서는, 도 9는 본 발명의 실시예에 따른 RIS 상태 수신 방법의 흐름도이다. 도 9에 도시된 바와 같이, 상기 흐름은 하기와 같은 단계 S902 및 단계 S904를 포함한다. 단계 S902에서, RIS 컨트롤러는 자체 또는 이에 의해 관리되는 복수개의 RIS 보드의 상태 이상을 검출한다. 단계 S904에서, BS는 RIS 컨트롤러로부터의 상태 정보를 수신한다. 상기 단계 S902 및 S904는 RIS 컨트롤러 및 이에 의해 관리되는 복수개의 RIS 보드의 안정적인 작동 단계에서 발생된다. 상기 도 6 내지 도 9에 도시된 실시예에서는, RIS 컨트롤러의 상태 정보는 전기량 상태, 전력소모값, 온도값 및 작동 상태 중의 적어도 하나를 포함할 수 있다. 상기 도 6 내지 도 9에 도시된 실시예에서는, RIS 보드 각각의 상태 정보는 전력소모값, 온도값, 코드북 다시 읽기 상태, 좌표, 방위각 및 다운틸트각 중의 적어도 하나를 포함할 수 있다. 상기 도 6 내지 도 9에 도시된 실시예에서는, BS는 물리적 랜덤 액세스 채널(PRACH) 또는 물리적 상향링크 공유 채널(PUSCH)을 통해 RIS 컨트롤러에 의해 피드백되는 상태 정보를 수신할 수 있다. 본 발명의 실시예에 의해 제공되는 해결수단에 대한 이해를 돕기 위해, 아래는 구체적인 장면 실시예와 함께 상 세하게 설명한다. 본 발명의 실시예는 주로 RIS를 사용하여 기지국에 의해 커버되는 장면을 보강하는데 적용되며, RIS 상태를 모 니터링하여 액세스되는 기지국에 보고하는 것을 통해, RIS 전기량, 전력, 온도, 반사/투사 유닛 작동 상태, RIS 패널 엔지니어링 파라미터 등 상태의 관리를 실현함으로써, 상태 이상으로 인한 네트워크 성능 열화를 적시로 발견하여 처리한다. 장면 실시예 1 RIS 컨트롤러는 기지국에서의 초기 액세스를 완성한 후, 자체 및 이에 의해 관리되는 RIS 보드의 상태 정보를 보고한다. 도 10은 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 상태 정보를 보고하는 흐름도이다. 도 10에 도시된 바와 같이, 상기 흐름은 하기와 같은 단계 S1002 및 단계 S1004를 포함한다. 단계 S1002에서, RIS 컨트롤러는 랜덤 액세스 과정을 통해 소속되는 기지국에서의 액세스 과정을 완성한다. 단계 S1004에서, RIS 컨트롤러는 자체 및 이에 의해 관리되는 RIS 보드의 상태 정보를 능동적으로 보고한다. RIS 컨트롤러에서 기지국(BS)으로 피드백해야 할 상태 정보는 하기의 정보를 포함하지만, 이에 한정되지 않는다. RIS 컨트롤러 자체의 전기량 상태(정상/저 전기량 또는 전기량의 백분율); RIS 컨트롤러 자체의 전력소모값 및 이에 의해 관리되는 각 RIS 보드의 전력소모값; RIS 컨트롤러 자체의 온도값 및 이에 의해 관리되는 각 RIS 보드의 온도값; RIS 컨트롤러 자체의 작동 상태 및 이에 의해 관리되는 각 RIS 보드의 코드북 다시 읽기 상태; RIS 컨트롤러에 의해 관리되는 각 RIS 보드의 좌표, 방위각 및 다운틸트각. 도 11에 도시된 바와 같이, 도 11은 본 장면 실시예 1의 RIS 컨트롤러에서 기지국(BS)으로 보고되는 상태 정보 내용이다. 장면 실시예 2 RIS 컨트롤러 및 이에 의해 관리되는 RIS 보드가 안정적인 작동 상태에 진입한 후, 기지국으로부터의 상태 조회 명령어를 수신한 다음, 자체 및 이에 의해 관리되는 RIS 보드의 상태 정보를 보고한다. 도 12는 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 상태 정보를 보고하는 흐름도이다. 도 12에 도시된 바와 같이, 상기 흐름은 하 기와 같은 단계 S1202 및 단계 S1204를 포함한다. 단계 S1202에서, 기지국은 RIS 컨트롤러로 상태 정보 조회 명령어를 송신한다. 단계 S1204에서, RIS 컨트롤러는 자체 및 이에 의해 관리되는 RIS 보드의 상태 정보를 보고한다. 기지국은 SSB 또는 PDSCH 채널을 통해 RIS 컨트롤러로 상태 정보 조회 명령어를 송신하고, RIS 컨트롤러는 PRACH 및 PUSCH 채널을 통해 피드백을 완성할 수 있다. RIS 컨트롤러에서 기지국으로 피드백해야 할 상태 정보는 하기의 정보를 포함하지만, 이에 한정되지 않는다. RIS 컨트롤러 자체의 전기량 상태(정상/저 전기량 또는 전기량의 백분율); RIS 컨트롤러 자체의 전력소모값 및 이에 의해 관리되는 각 RIS 보드의 전력소모값; RIS 컨트롤러 자체의 온도값 및 이에 의해 관리되는 각 RIS 보드의 온도값; RIS 컨트롤러 자체의 작동 상태 및 이에 의해 관리되는 각 RIS 보드의 코드북 다시 읽기 상태; RIS 컨트롤러에 의해 관리되는 각 RIS 보드의 좌표, 방위각 및 다운틸트각. 도 13에 도시된 바와 같이, 도 13은 본 장면 실시예 2의 RIS 컨트롤러에서 기지국(BS)으로 보고되는 상태 정보 내용이다. 장면 실시예 3 RIS 컨트롤러는 안정적인 실행 상태에서 자체 또는 이에 의해 관리되는 RIS 보드의 상태 이상을 검출하고, 자체 및 이에 의해 관리되는 RIS 보드의 상태 정보를 보고한다. 도 14는 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 상태 정보를 보고하는 흐름도이다. 도 14에 도시된 바 와 같이, 상기 흐름은 하기와 같은 단계 S1402 및 단계 S1404를 포함한다. 단계 S1402에서, RIS 컨트롤러는 자체 또는 이에 의해 관리되는 RIS 보드에 상태 이상이 존재하는 것을 자체적 으로 검출한다. 단계 S1404에서, RIS 컨트롤러는 자체 및 이에 의해 관리되는 RIS 보드의 상태 정보를 능동적으로 보고한다. RIS 컨트롤러에서 기지국으로 피드백해야 할 상태 정보는 하기의 정보를 포함하지만, 이에 한정되지 않는다. RIS 컨트롤러 자체의 전기량이 지나치게 낮음; RIS 컨트롤러 자체에 전력소모 이상 또는 이에 의해 관리되는 각 RIS 보드에 전력소모 이상이 존재함; RIS 컨트롤러 자체에 온도 이상 또는 이에 의해 관리되는 각 RIS 보드에 온도 이상이 존재함; RIS 컨트롤러 자체에 작동 상태 이상 또는 이에 의해 관리되는 각 RIS 보드에 코드북 다시 읽기 이상이 존 재함; RIS 컨트롤러에 의해 관리되는 각 RIS 보드에 좌표, 방위각 및 다운틸트각 이상이 존재함. 도 15에 도시된 바와 같이, 도 15는 본 장면 실시예 3의 RIS 컨트롤러에서 기지국(BS)으로 보고되는 상태 정보 내용이다. 상기 실시형태의 설명을 통해, 당업자는 상기 실시예에 따른 방법은 소프트웨어 및 필요한 범용 하드웨어 플랫 폼을 통해 실현될 수 있으며, 물론 하드웨어에 의해 실현될 수도 있지만, 많은 경우에는 전자가 더 바람직한 실 시형태임을 명확하게 이해할 수 있다. 이러한 이해에 기초하여, 본 발명 실시예의 해결수단의 본질 또는 기존기술에 기여한 부분은 소프트웨어 제품의 형식으로 구현될 수 있으며, 상기 컴퓨터 소프트웨어 제품은 하나의 저장 매체(예를 들면, ROM/RAM, 자기 디스크, 광 디스크)에 저장되고, 조회 명령어와 같은 여러 명령어를 포함 하는 상태 정보의 처리와 통합 등은 모두 하나의 중계 프로그램, 저장 매체 및 기기 등에 저장되며, 중계의 형 태로 명령어의 송신 및 상태 정보의 피드백 등을 완성할 수 있다. 본 실시예에서는 RIS 상태 피드백 장치 및 RIS 상태 수신 장치를 더 제공한다. 상기 장치는 상기 실시예 및 바 람직한 실시형태를 실현하기 위한 것이며, 이미 설명된 것은 설명을 생략한다. 이하에서 사용되는 \"모듈\" 및 \" 유닛\"과 같은 용어는 소정 기능의 소프트웨어 및/또는 하드웨어의 조합을 실현할 수 있다. 하기 실시예에서 설 명되는 장치는 소프트웨어로 실현하는 것이 바람직하지만, 하드웨어 또는 소프트웨어와 하드웨어의 조합으로 실 현하는 것도 가능하며 구상될 수 있는 것이다. 도 16은 본 발명의 실시예에 따른 RIS 상태 피드백 장치의 구조 블록도이다. 상기 장치는 RIS 컨트롤러에 위치할 수 있다. 도 16에 도시된 바와 같이, 상기 장치는 상태 피드백 모듈을 포함한다. 상기 상태 피 드백 모듈은 기지국(BS)으로 상태 정보를 피드백하기 위한 것이다. 여기서, 상태 정보는 RIS 컨트롤러의 상 태 정보 및 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함한다. 예시적인 일 실시예에서는, 도 17은 본 발명의 실시예에 따른 RIS 상태 피드백 장치의 구조 블록도이다. 도 17 에 도시된 바와 같이, 상태 피드백 모듈은 제1 피드백 유닛, 제2 피드백 유닛 및 제3 피드백 유닛 중의 적어도 하나의 유닛을 포함한다. 제1 피드백 유닛은, RIS 컨트롤러가 BS에 액세스되는 초기 액세스 단계에서 BS로 상태 정보를 능동적으로 피드백하기 위한 것이다. 제2 피드백 유닛은, RIS 컨트롤러 및 이에 의해 관리되는 복수개의 RIS 보드의 안정적인 작동 단계에서 BS 로부터의 상태 정보 조회 명령어를 수신하고, 상태 정보 조회 명령어에 따라 BS로 상기 상태 정보를 피드백하기 위한 것이다. 제3 피드백 유닛은, RIS 컨트롤러 및 이에 의해 관리되는 복수개의 RIS 보드의 안정적인 작동 단계에서 RIS 컨트롤러 또는 이에 의해 관리되는 복수개의 RIS 보드의 상태 이상을 검출하고, BS로 상기 상태 정보를 피드백 하기 위한 것이다. 도 18은 본 발명의 실시예에 따른 RIS 상태 수신 장치의 구조 블록도이다. 상기 장치는 기지국에 위치할 수 있다. 도 18에 도시된 바와 같이, 상기 장치는 상태 수신 모듈을 포함한다. 상태 수신 모듈은 재구성 가능한 지능형 표면(RIS) 컨트롤러에 의해 피드백되는 상태 정보를 수신하기 위한 것이다. 여기서, 상태 정보는 RIS 컨트롤러의 상태 정보 및 RIS 컨트롤러에 의해 관리되는 복수개의 RIS 보드의 상태 정보를 포함한다. 예시적인 일 실시예에서는, 도 19는 본 발명의 실시예에 따른 RIS 상태 수신 장치의 구조 블록도이다. 도 19에 도시된 바와 같이, 상태 수신 모듈은 제1 수신 유닛, 제2 수신 유닛 및 제3 수신 유닛 중의 적 어도 하나의 유닛을 포함한다. 제1 수신 유닛은, RIS 컨트롤러가 BS에 액세스되는 초기 액세스 단계에서 RIS 컨트롤러에 의해 능동적으로 피드백되는 상태 정보를 수신하기 위한 것이다. 제2 수신 유닛은, RIS 컨트롤러 및 이에 의해 관리되는 복수개의 RIS 보드의 안정적인 작동 단계에서 RIS 컨트롤러로 상태 정보 조회 명령어를 송신하고, RIS 컨트롤러에 의해 피드백되는 상태 정보를 수신하기 위한 것 이다. 제3 수신 유닛은, RIS 컨트롤러 및 이에 의해 관리되는 복수개의 RIS 보드의 안정적인 작동 단계에서 RIS 컨트롤러에서 자체 또는 이에 의해 관리되는 복수개의 RIS 보드의 상태 이상이 검출될 경우, RIS 컨트롤러에 의 해 피드백되는 상태 정보를 수신하기 위한 것이다. 설명해야 할 것은, 상기 각 모듈은 소프트웨어 또는 하드웨어를 통해 실현할 수 있는 것이며, 후자의 경우, 상 기 모듈이 모두 동일한 프로세서에 위치하거나, 또는 상기 각 모듈이 임의의 조합의 형식으로 서로 다른 프로세 서에 각각 위치하는 형태를 통해 실현할 수 있으며, 이에 한정되지 않는다. 본 발명의 실시예는 컴퓨터 판독가능 저장 매체를 더 제공한다. 상기 컴퓨터 판독가능 저장 매체에는 컴퓨터 프 로그램이 저장되며, 상기 컴퓨터 프로그램은 실행 시 상술한 어느 한 항의 방법 실시예에서의 단계를 수행하도록 구성된다. 예시적인 일 실시예에서는, 상기 컴퓨터 판독가능 저장 매체는 USB 메모리, 리드 온리 메모리(Read-Only Memory, ROM으로 약칭함), 랜덤 액세스 메모리(Random Access Memory, RAM으로 약칭함), 이동식 하드디스크, 자기 디스크 또는 광 디스크 등 컴퓨터 프로그램을 저장할 수 있는 다양한 매체를 포함할 수 있으며, 이에 한정 되지 않는다. 본 발명의 실시예는 전자 장치를 더 제공한다. 상기 전자 장치는 메모리 및 프로세서를 포함하며, 상기 메모리 에는 컴퓨터 프로그램이 저장되고, 상기 프로세서는 컴퓨터 프로그램을 실행하여 상술한 어느 한 항의 방법 실 시예에서의 단계를 수행하도록 구성된다. 예시적인 일 실시예에서는, 상기 전자 장치는 상기 프로세서와 연결되는 전송 기기 및 상기 프로세서와 연결되 는 입출력 기기를 더 포함할 수 있다. 본 실시예에서의 구체적인 예시는 상기 실시예 및 예시적인 실시형태에서 설명된 예시를 참조할 수 있으며, 본 실시예는 여기에서 설명을 생략한다. 자명한 것은, 상기 본 발명 실시예의 각 모듈 또는 각 단계는 범용의 컴퓨터 장치로 실현할 수 있으며, 이들은 단일 컴퓨터 장치에 집중되거나, 또는 복수개의 컴퓨터 장치로 구성된 네트워크에 분산될 수 있고, 이들은 컴퓨 터 장치에서 실행될 수 있는 프로그램 코드로 실현할 수 있으므로, 이들을 저장 장치에 저장하여 컴퓨터 장치에 서 실행할 수 있으며, 또한 어떤 경우에는, 도시되거나 설명된 단계를 여기에서와 다른 순서로 실행하거나, 또 는 이들을 각 집적회로 모듈로 각각 제조하거나, 또는 이들 중의 복수개의 모듈 또는 단계를 단일 집적회로 모 듈로 제조하여 실현할 수 있음을 당업자는 알아야 한다. 이와 같이, 본 발명의 실시예는 그 어떤 특정된 하드웨 어 및 소프트웨어의 결합에 한정되지 않는다. 이상은 본 발명 실시예의 바람직한 실시예일 뿐, 본 발명의 실시예를 한정하기 위한 것은 아니며, 본 발명의 실 시예는 당업자에 의해 다양하게 변경 및 변화될 수 있다. 본 발명 실시예의 원칙 내에서 진행되는 임의의 수정, 균등교체, 개선 등은 모두 본 발명 실시예의 보호범위 내에 포함되어야 한다."}
{"patent_id": "10-2024-7027405", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따라 실행되는 네트워크 아키텍처의 예시도이다. 도 2는 본 발명의 실시예에 따른 RIS 상태 피드백 방법의 흐름도이다. 도 3은 본 발명의 실시예에 따른 RIS 상태 능동적 피드백 방법의 흐름도이다. 도 4는 본 발명의 실시예에 따른 RIS 상태 피드백 방법의 흐름도이다. 도 5는 본 발명의 실시예에 따른 RIS 상태 피드백 방법의 흐름도이다. 도 6은 본 발명의 실시예에 따른 RIS 상태 수신 방법의 흐름도이다. 도 7은 본 발명의 실시예에 따른 RIS 상태 수신 방법의 흐름도이다. 도 8은 본 발명의 실시예에 따른 RIS 상태 지시 수신 방법의 흐름도이다. 도 9는 본 발명의 실시예에 따른 RIS 상태 수신 방법의 흐름도이다. 도 10은 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 상태 정보를 보고하는 흐름도이다. 도 11은 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 기지국(BS)으로 보고되는 상태 정보 내용의 예시도이 다. 도 12는 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 상태 정보를 보고하는 흐름도이다. 도 13은 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 기지국(BS)으로 보고되는 상태 정보 내용의 예시도이 다. 도 14는 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 상태 정보를 보고하는 흐름도이다. 도 15는 본 발명의 장면 실시예에 따른 RIS 컨트롤러에서 기지국(BS)으로 보고되는 상태 정보 내용의 예시도이 다. 도 16은 본 발명의 실시예에 따른 RIS 상태 피드백 장치의 구조 예시도이다. 도 17은 본 발명의 실시예에 따른 RIS 상태 피드백 장치의 구조 예시도이다. 도 18은 본 발명의 실시예에 따른 RIS 상태 수신 장치의 구조 예시도이다. 도 19는 본 발명의 실시예에 따른 RIS 상태 수신 장치의 구조 예시도이다."}
