{"patent_id": "10-2023-0101848", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0020232", "출원번호": "10-2023-0101848", "발명의 명칭": "통신 시스템에서 IoT 디바이스를 위한 식별 정보를 할당하는 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "권기석"}}
{"patent_id": "10-2023-0101848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다수의 IoT(industrial internet of things) 디바이스들을 지원하는 무선 통신 시스템에서 AMF(access andmobility management function)에 의해 수행되는 방법에 있어서,상기 다수의 IoT 디바이스들을 이용하는 통신 서비스를 제공하는 AF(application function)로부터 MNO(mobilenetwork operator) ID, AF ID, 디바이스 종류(Device Type) ID, 연결 종류(Connectivity Type) ID 중 적어도하나를 포함하는 부분 식별 정보를 수신하는 과정; 및상기 부분 식별 정보를 근거로, 상기 다수의 IoT 디바이스들에 대한 디바이스 식별 정보를 구성하는데 이용되는설정 정보를 기지국을 통해 상기 다수의 IoT 디바이스들에게 송신하는 과정을 포함하는 방법."}
{"patent_id": "10-2023-0101848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "무선 통신 시스템에서 다수의 IoT(industrial internet of things) 디바이스들을 이용하는 통신 서비스를 제공하는 AF(application function)에 의해 수행되는 방법에 있어서,상기 다수의 IoT 디바이스들을 위한 디바이스 식별 정보와 관련된 MNO(mobile network operator) ID, AF ID,디바이스 종류(Device Type) ID, 연결 종류(Connectivity Type) ID 중 적어도 하나를 포함하는 부분 식별 정보를 AMF(access and mobility management function)에게 송신하는 과정; 및상기 부분 식별 정보를 근거로, 상기 다수의 IoT 디바이스들의 각각으로부터 상기 디바이스 식별 정보를 수신하는 과정을 포함하는 방법."}
{"patent_id": "10-2023-0101848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 수신한 디바이스 식별 정보를 근거로, 상기 다수의 IoT 디바이스들 중 적어도 하나에게 태스크 할당과 관련된 요청 메시지를 송신하는 과정을 더 포함하는 방법."}
{"patent_id": "10-2023-0101848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "다수의 IoT(industrial internet of things) 디바이스들을 지원하는 무선 통신 시스템에서 AMF(access andmobility management function)에 있어서,송수신기; 및상기 송수신기를 통해, 상기 다수의 IoT 디바이스들을 이용하는 통신 서비스를 제공하는 AF(applicationfunction)로부터 MNO(mobile network operator) ID, AF ID, 디바이스 종류(Device Type) ID, 연결 종류(Connectivity Type) ID 중 적어도 하나를 포함하는 부분 식별 정보를 수신하고,상기 부분 식별 정보를 근거로, 상기 다수의 IoT 디바이스들에 대한 디바이스 식별 정보를 구성하는데 이용되는설정 정보를, 기지국을 통해 상기 다수의 IoT 디바이스들에게 송신하도록 구성된 프로세서를 포함하는 AMF."}
{"patent_id": "10-2023-0101848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "무선 통신 시스템에서 다수의 IoT(industrial internet of things) 디바이스들을 이용하는 통신 서비스를 제공공개특허 10-2025-0020232-3-하는 AF(application function)에 있어서,송수신기; 및상기 송수신기를 통해, 상기 다수의 IoT 디바이스들을 위한 디바이스 식별 정보와 관련된 MNO(mobile networkoperator) ID, AF ID, 디바이스 종류(Device Type) ID, 연결 종류(Connectivity Type) ID 중 적어도 하나를 포함하는 부분 식별 정보를 AMF(access and mobility management function)에게 송신하고,상기 부분 식별 정보를 근거로, 상기 다수의 IoT 디바이스들의 각각으로부터 상기 디바이스 식별 정보를 상기송수신기를 통해 수신하도록 구성된 프로세서를 포함하는 AF."}
{"patent_id": "10-2023-0101848", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시는 5G 통 신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스 (예를 들어, 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 헬스 케어, 디지털 교육, 소매업, 보안 및 안전 관련 서비스 등)에 적용될 수 있다. 본 개 (뒷면에 계속)"}
{"patent_id": "10-2023-0101848", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 통신 시스템에서 배터리 전력을 사용하지 않거나 혹은 매우 적은 전력으로 동작하는 디바이스를 위한 단말 ID 할당 방안에 관한 것이다."}
{"patent_id": "10-2023-0101848", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz, THz) 대역(예를 들어, 95GHz에서 3 테라헤르츠 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다."}
{"patent_id": "10-2023-0101848", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 배터리 전력을 사용하지 않거나 혹은 저전력으로 동작하는 디바이스를 이용하 여 통신 서비스를 효과적으로 제공할 수 있는 방법 및 장치를 제공한다. 또한 본 개시는 무선 통신 시스템에서 다수의 IoT 디바이스들을 운용하는 통신 환경에서 IoT 디바이스를 위한 식별 정보를 효율적으로 할당하는 방법 및 장치를 제공한다. 또한 본 개시는 무선 통신 시스템에서 Ambient IoT 디바이스를 위한 식별 정보를 효율적으로 할당하는 방법 및 장치를 제공한다."}
{"patent_id": "10-2023-0101848", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예에 따라, 다수의 IoT 디바이스들을 지원하는 무선 통신 시스템에서 AMF에 의해 수행되는 방법 은, 상기 다수의 IoT 디바이스들을 이용하는 통신 서비스를 제공하는 AF(application function)로부터 MNO ID, AF ID, Device Type ID, Connectivity Type ID 중 적어도 하나를 포함하는 부분 식별 정보를 수신하는 과정과, 상기 부분 식별 정보를 근거로, 상기 다수의 IoT 디바이스들에 대한 디바이스 식별 정보를 구성하는데 이용되는 설정 정보를 기지국을 통해 상기 다수의 IoT 디바이스들에게 송신하는 과정을 포함한다. 또한 본 개시의 실시 예에 따라, 무선 통신 시스템에서 다수의 IoT 디바이스들을 이용하는 통신 서비스를 제공 하는 AF에 의해 수행되는 방법은, 상기 다수의 IoT 디바이스들을 위한 디바이스 식별 정보와 관련된 MNO ID, AF ID, Device Type ID, Connectivity Type ID 중 적어도 하나를 포함하는 부분 식별 정보를 AMF에게 송신하는 과 정과, 상기 부분 식별 정보를 근거로, 상기 다수의 IoT 디바이스들의 각각으로부터 상기 디바이스 식별 정보를 수신하는 과정을 포함한다. 또한 본 개시의 실시 예에 따라, 다수의 IoT 디바이스들을 지원하는 무선 통신 시스템에서 AMF는, 송수신기와, 상기 송수신기를 통해, 상기 다수의 IoT 디바이스들을 이용하는 통신 서비스를 제공하는 AF로부터 MNO ID, AF ID, Device Type ID, Connectivity Type ID 중 적어도 하나를 포함하는 부분 식별 정보를 수신하고, 상기 부분 식별 정보를 근거로, 상기 다수의 IoT 디바이스들에 대한 디바이스 식별 정보를 구성하는데 이용되는 설정 정보 를, 기지국을 통해 상기 다수의 IoT 디바이스들에게 송신하도록 구성된 프로세서를 포함한다. 또한 본 개시의 실시 예에 따라, 무선 통신 시스템에서 다수의 IoT 디바이스들을 이용하는 통신 서비스를 제공 하는 AF는, 송수신기와, 상기 송수신기를 통해, 상기 다수의 IoT 디바이스들을 위한 디바이스 식별 정보와 관련 된 MNO ID, AF ID, Device Type ID, Connectivity Type ID 중 적어도 하나를 포함하는 부분 식별 정보를 AMF에 게 송신하고, 상기 부분 식별 정보를 근거로, 상기 다수의 IoT 디바이스들의 각각으로부터 상기 디바이스 식별 정보를 상기 송수신기를 통해 수신하도록 구성된 프로세서를 포함한다."}
{"patent_id": "10-2023-0101848", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예들을 상세히 설명한다. 이 때, 첨부된 도면에서 동일 한 구성 요소는 가능한 동일한 부호로 나타내고 있음에 유의해야 한다. 또한 본 발명의 요지를 흐리게 할 수 있 는 공지 기능 및 구성에 대한 상세한 설명은 생략할 것이다. 본 명세서에서 실시예를 설명함에 있어서 본 개시가 속하는 기술 분야에 익히 알려져 있고 본 발명과 직접적으 로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 개시의 요지를 흐리지 않고 더욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 개시는 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 개시의 개시가 완전하도록 하고, 본 개시가"}
{"patent_id": "10-2023-0101848", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행 될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가 능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들 을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA또는 ASIC과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아 니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재 생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요 소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이 터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 개시에서, \"A 및/또는 B\", \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\" 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하 는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성 요소를 다른 해당 구성 요소와 구분하기 위해 사용 될 수 있으며, 해당 구성 요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 이하, 기지국은 단말의 자원할당을 수행하는 주체로서, Node B, BS (Base Station), eNB (eNode B), gNB (gNode B), 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말은 UE (User Equipment), MS (Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기능을 수행할 수 있는 멀티 미디어시스템을 포함할 수 있다. 또한, 이하에서 설명하는 본 개시의 실시예와 유사한 기술적 배경 또는 채널형 태를 갖는 여타의 통신시스템에도 본 개시의 실시예가 적용될 수 있다. 또한, 본 개시의 실시예는 숙련된 기술 적 지식을 가진자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통 신시스템에도 적용될 수 있다. 본 개시에서 네트워크 기술은 ITU(international telecommunication union) 또는 3GPP에 의하여 정의되는 표준 규격(예를 들어, TS 23.501, TS 23.502, TS 23.503 등)을 참조할 수 있으며, 도 1의 네트워크 구조에 포함되는 구성 요소들은 각각 물리적인 엔터티(entity)를 의미하거나, 혹은 개별적인 기능(function)을 수행하는 소프트 웨어 혹은 소프트웨어와 결합된 하드웨어를 의미할 수 있다. 도면들에서 N1, N2, N3,... 등과 같이 Nx로 도시된 참조 부호들은 5G 코어 네트워크(core network : CN)에서 NF들 간의 공지된 인터페이스들을 나타낸 것이며, 관 련 설명은 표준 규격(TS 23.501)을 참조할 수 있으므로 구체적인 설명은 생략하기로 한다. 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity) 또는 NF(network function)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 망 객체들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시가 후술되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 이하 설명의 편의를 위하여, 3GPP(3rd generation partnership project long term evolution) 규격에서 정의하 고 있는 용어 및 명칭들이 일부 사용될 수 있다. 하지만, 본 개시가 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 시스템에도 동일하게 적용될 수 있다. 도 1은 본 개시의 실시 예에 따라 무선 통신 시스템의 일 구성 예를 나타낸 도면으로서, 도 1은 5G 시스템의 구 성을 예시한 것이다. 도 1을 참조하면, (R)AN((Radio) Access Network)는 단말의 무선 자원 할당을 수행하는 주체로서, eNode B, Node B, BS (Base Station), NG-RAN(NextGeneration Radio Access Network), 5G-AN, 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말은 UE (User Equipment), NG UE(NextGeneration UE), MS (Mobile Station), 셀룰러폰, 스마트폰, 컴 퓨터, 또는 통신기능을 수행할 수 있는 멀티미디어시스템을 포함할 수 있다. 또한, 이하에서 5G 시스템을 일례 로서 본 개시의 실시 예를 설명하지만, 유사한 기술적 배경를 갖는 여타의 통신 시스템에도 본 개시의 실시예가 적용될 수 있다. 또한, 본 개시의 실시 예는 숙련된 기술적 지식을 가진자의 판단으로써 본 개시의 범위를 크게벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 무선 통신 시스템은 4G 시스템에서 5G 시스템으로 진화를 하면서 새로운 코어 네트워크(Core Network)인 NextGen Core(NG Core) 혹은 5GC(5G Core Network)를 정의한다. 새로운 Core Network는 기존의 네트워크 엔터 티(NE: Network Entity)들을 전부 가상화 하여 네트워크 기능(NF: Network Function)으로 만들었다. 본 개시의 일 실시예에 따르면, 네트워크 기능(NF)이란 네트워크 엔티티, 네트워크 컴포넌트, 네트워크 자원을 의미할 수 있다. 본 개시의 일 실시예에 따르면, 5GC는 도 1에 도시된 NF들을 포함할 수 있다. 도 1에서 5GC는 UPF(User Plane Function), AUSF(Authentication Server Function), AMF(Access and Mobility Management Function), SMF(Session Management Function), SCP(Service Communication Proxy), NSSF(Network Slice Selection Policy), NEF(Network Exposure Function), NRF(Network Repository Function), PCF(Policy Control Function), UDM(Unified Data Management), AF(Application Function) 등과 같은 네트워크 엔터티들을 포함할 수 있다. 또한 UPF는 인터넷 등의 외부 네트워크인 DN(data network)와 Nupf 서비스를 이용하여 통신할 수 있다. DN은 외부 네트워크의 AF를 포함할 수 있다. 일 예로 AF는 5GC 내의 AF와 5GC 외부의 DN에 포함된 AF가 존재할 수 있으며, AF는 5GC 외부 의 DN에서 UPF와 통신하는 AF일 수 있다. 상기 네트워크 엔터티들 중 본 개시와 직접적인 관련이 없 는 엔터티들에 대한 설명은 편의상 생략하기로 한다. 물론 5GC는 도 1의 예시에 제한되는 것은 아니며, 5GC는 도 1에 도시된 NF보다 더 많은 수의 NF를 포함할 수도 있고 더 적은 수의 NF를 포함할 수도 있다. AMF는 단말(UE)의 접속(access)와 이동성(mobility)을 관리하는 네트워크 기능일 수 있다. 일 예로, AMF는 등록(registration), 연결(connection), 연결성(reachability), 이동성(mobility) 관리, 접근 확인, 인증, 이동성 이벤트 생성 등과 같은 네트워크 기능을 수행할 수 있다. SMF은 사용자 단말(UE)에게 제공하는 PDN(Packet Data Network) 연결을 관리하는 네트워크 기능일 수 있다. PDN 연결은 PDU(Packet Data Unit) Session이라는 이름으로 지칭될 수 있다. 일 예로, SMF는 세 션의 수립, 수정, 해제와 이에 필요한 UPF와 RAN 간의 터널 유지를 통한 세션 관리 기능, UE의 IP(Internet protocol) 주소 할당과 관리 기능, 사용자 평면(User Plane) 선택 및 제어, UPF에서 트래픽 프로세싱 제어, 과금 데이터 수집 제어 등과 같은 네트워크 기능을 수행할 수 있다. PCF는 단말에 대한 이동통신사업자의 서비스 정책, 과금 정책, 그리고 PDU Session에 대한 정책을 적 용하는 네트워크 기능일 수 있다. UDM은 가입자에 대한 정보를 저장하는 네트워크 기능일 수 있다. 일 예로, UDM은 3GPP 보안을 위한 인증 정보의 생성, 사용자 식별자(user ID)의 처리, 단말을 지원하는 네트워크 기능의 목록 관리, 가입 정 보(subscription information) 관리 등의 기능을 수행할 수 있다. NEF는 단말에 관한 정보를 5G 네트워크 외부에 있는 서버에게 제공하는 기능일 수 있다. 또한, NEF는 5G 네트워크에 서비스를 위해서 필요한 정보를 제공하여 UDR(Unified Data Repository)(도시되지 않음)에 저장하는 기능을 제공할 수 있다. UPF는 사용자 데이터(PDU)를 DN으로 전달하는 게이트웨이 역할을 수행하는 기능일 수 있다. 보다 구 체적으로, UPF는 단말이 송신한 데이터를 외부 네트워크로 전달하거나 외부 네트워크로부터 유입된 데이터를 단말에게 전달할 수 있도록 데이터를 처리하는 역할을 수행할 수 있다. 일 예로 UPF는 무선 접속 기술(radio access technology: RAT) 간 앵커(anchor) 역할 수행, 패킷 라우팅 및 포워딩, 패킷 검사 (inspection), 사용자 평면 정책 적용, 트래픽 사용 보고서 작성, 버퍼링 등과 같은 네트워크 기능을 수행할 수 있다. NRF는 NF을 Dicovery 하는 기능을 수행할 수 있다. AUSF는 3GPP 접속 망과 non-3GPP 접속 망에서의 단말 인증을 수행할 수 있다. NSSF은 단말에게 제공되는 Network Slice Instance를 선택하는 기능을 수행 할 수 있다. DN은 망 사업자의 서비스나 3rd party 서비스를 이용하기 위해서 단말이 데이터를 송수 신하는 데이터 네트워크일 수 있다. 본 개시에서 단말은 IoT 디바이스를 포함할 수 있다. 본 개시에서 상기 IoT 디바이스는 배터리 전력을 사 용하지 않거나 혹은 매우 적은 전력으로 동작하는 디바이스를 포함할 수 있으며, 본 개시에서 이러한 IoT 디바 이스를 주변(Ambient) IoT 디바이스(혹은 간략히 Ambient IoT)라 칭하기로 한다.본 개시의 일 실시 예에 따르면, Ambient IoT Device는 배터리를 가지고 있지 않거나 아주 제한적인 energy storage capability를 포함 할 수 있다. Ambient IoT 디바이스는 다음과 같은 특징 중 적어도 하나를 가질 수 있다. - 디바이스의 동작을 위한 소모 전력이 매우 낮음 (예를 들어 1~500μW) - 디바이스의 가격이 매우 낮음 (예를 들어 0.01~0.5$) - 데이터 전송 속도가 매우 낮음 (예를 들어 10kbps) - 전개되는 디바이스의 수가 매우 많음 (예를 들어 수백, 수천, 수만, 수십만 혹은 1,000,000개 이상) - 계산 능력이 매우 낮고 매우 간단한 구조를 가지고 있으며 디바이스의 크기도 매우 작음 - USIM(Universal Subscriber Identity Module)을 가지고 있지 않으며 TCP/IP(Transmission Control Protocol/Internet Protocol)와 같은 복잡한 통신 프로토콜 스택을 포함하지 않음 - 사람들이 접근하기 힘든 환경에 주로 전개 될 수 있으며 그로 인하여 전개 후 유지(maintenance)가 불가함 (e.g. high pressure, extremely high/low temperature, humid environment) 본 개시에서 Ambient IoT 디바이스들은 디바이스 내 배터리 유무와 디바이스가 사용하는 통신 형태에 따라서 다 음의 3가지 종류(type)로 나뉠 수 있다. 표 1 디바이스 종류 설명 Device Type A (TY_A) - Energy Storage (Battery) 없음- 독립적인 signal generation/amplification 불가 Device Type B (TY_B) - Energy Storage (Battery) 있음- 독립적인 signal generation/amplification 불가 Device Type C (TY_C) - Energy Storage (Battery) 있음- 독립적인 signal generation/amplification 가능 (active RF components 포함) 또한 본 개시에서 Ambient IoT 디바이스들은 아래 [표 2]의 예와 같이 4 가지 종류로 구분된 연결 토폴로지 (Connectivity topology)를 가질 수 있다. 또한 본 개시에서 Ambient IoT 디바이스들의 연결 종류는 아래 [표 2]의 예에 한정되지 않고, 4 가지 종류로 구분된 연결 토폴로지들의 다양한 조합에 의한 연결 또한 가능하다. 표 2 토폴로지 종류 설명 Topology 1 (T1) - 기지국과 Ambient IoT 디바이스 간의 연결 (Base Station - Ambient IoT device) Topology 2 (T2) - 중간 노드를 경유하는 기지국과 Ambient IoT 디바이스 간의 연결 (Base Station - Intermediate node - Ambient IoT device) Topology 3 (T3) - 기지국과 기지국 사이에 보조 노드와 Ambient IoT 디바이스를 매개 한 연결 (Base Station - Assisting node - Ambient IoT device - Base Station) Topology 4 (T4) - 단말과 Ambient IoT 디바이스 간의 연결 (UE - Ambient IoT device) 도 2는 본 개시의 실시 예에 따라 통신 시스템에서 Ambient IoT를 이용하는 시나리오의 일 예를 도시한다. 도 2의 통신 시스템은 산악 지대에 전개된 다수의 Ambient IoT 디바이스들, 상기 Ambient IoT 디바이스들 중 적어도 하나와 통신할 수 있는 적어도 하나의 기지국, 상기 적어도 하나의 기지국이 연결된 코어 네트워크 및 상기 코어 네트워크와 통신 연결된 AF를 포함한 DN를 포함할 수 있다. 도 2의 예에서 기지국, 코어 네트워크 및 AF를 포함한 DN의 기본적인 기능과 구성은 도 1 의 예를 참조할 수 있다.도 2를 참조하면, 삼림청이나 소방청에서는 산불의 조기 감지를 위해서 수백 만개의 Ambient IoT들을 산에 전개(deploy)할 수 있다. Ambient IoT들의 숫자와 전개 지역이 광활하고 사람의 접근성이 용이하지 않아 주로 항공으로 전개 하는 경우가 많다. 이렇게 전개된 Ambient IoT들은 위에서 언급한 이유 때문에 디바이 스의 maintenance (e.g. Ambient IoT 디바이스의 배터리 교체, 고장난 부품 교체 등)가 불가능 할 수 있다. 한 번 전개된 Ambient IoT들는 짧게는 10년 길게는 20년 동안 동작하면서 그 업무를 수행해야 한다. 그렇기 때문에 Ambient IoT들은 배터리를 거의 소모하지 않고 동작을 해야 하는 것이 중요하다. 도 2의 시나리오 에서 전개된 이후의 Ambient IoT들은 산 주변의 화재를 모니터링할 수 있다.. Ambient IoT들 중 화 재를 감지한 적어도 하나의 Ambient IoT 디바이스는 무선 네트워크를 이용하여 NG-RAN(5G 네트워크의 경우)에 화재 발생을 알리는 정보를 전송하고, 그 정보는 5G 네트워크와 데이터 네트워크를 거쳐 AF(3rd party server, 도 2의 예에서는 소방청의 서버 등)에 전송될 수 있다. 도 2의 실시 예처럼 Ambient IoT들은 화재 발생 알림 등의 동일한 목적을 위해 전개될 수 있고 상기 화재 발생을 알리는 정보 및/또는 그 정보와 관련된 데이터는 3rd party server (AF)로 전송될 수 있다. 도 2의 예는 산에서 화재 발생 시나리오를 예시하였으나, 각종 재난 상황이나 혹은 다수의 사람들이 이용하는 스포츠 경기장 혹은 쇼핑몰 등 각종 상업 서비스에서도 Ambient IoT 디바이스들은 관련 정보의 제공을 위해 전개될 수 있다. 본 개시의 실시 예들에서는 상기한 특징을 갖는 Ambient IoT device를 위한 Device ID 할당 방안을 제안한다. 일 예로 3GPP 표준에 따라 동작하는 Device들은 USIM칩 안에 있는 식별 정보인 SUPI(Subscription Permanent Identifier)/IMSI (International Mobile Subscriber Identity)을 해당 디바이스의 ID로 사용할 수 있다. 그러 나 Ambient IoT 디바이스는 USIM를 사용 할 수 없거나 또한 그 수가 너무 많아서 이동통신 사업자가 각 Device 에게 unique한 ID를 할당하는 것은 불가능 하다. 이에 본 개시에서는 Ambient IoT 디바이스의 특성 및 사용 목 적에 적합한 device ID 할당 방안을 제안한다. 도 3은 본 개시의 실시 예에 따른 Ambient IoT의 식별 정보인 Device ID의 일 구성 예를 도시한다. Ambient IoT들은 도 2의 시나리오와 같이 그 수가 많기 때문에 Ambient IoT들의 동작을 제어하기 위해서는 Ambient IoT들을 그룹화하는 것이 효율적일 수 있다. 이러한 Ambient IoT들의 그룹화는 그 업무에 따라, 예를 들어 Ambient IoT들과 통신하는 AF의 3rd party provider를 기준으로 그룹화 할 수 있고, 3rd party provider 에서 어떤 지역별, 용도별, 단순 어떤 개수 등 다양한 이유로 Ambient IoT들을 그룹화 할 수 있다. 또한, 상기 [표 1]에서 예시한 Ambient Device Type이나 상기 [표 2]에서 예시한 Connectivity Type 별 그룹화도 가능하며 특정 Use Case, 업무 시나리오 따라서 Ambient IoT들을 그룹화 할 수 있다. 도 3의 실시 예는 Ambient IoT의 하나의 Device ID 예를 도시하고 있으며 이 외에 다양한 값들이 Ambient IoT의 Device ID로 이용 될 수 있다. 본 실시 예에서 Ambient IoT의 Device ID를 구성하는 각 필드에 대한 정의는 아래의 예와 같다. 하기 설명 에서 3rd party provider는 AF 혹은 3rd party provider의 서버로 이해될 수 있다. - MNO(mobile network operator) ID : 3rd party provider가 Ambient IoT들과 통신을 하기 위해서 사용하 는 이동통신사의 ID를 나타낸다. 이 ID는 MCC(Mobile Country Code)와 MNC(Mobile Network Code) 중 적어도 하 나를 포함할 수 있고 MNC만으로 구성 될 수도 있다. - Enterprise ID : 3rd party provider가 속한 기업을 나타낸다. 여러 개의 3rd party server를 이용하여 업무를 수행 할 경우, 이 아이디를 이용하여 기업에 속한 모든 Ambient IoT들을 identify 할 수 있다. - AF ID : 이 ID는 3rd party provider/server을 구분하는 ID이다. 하나의 업무를 수행하는 모든 Ambient IoT들 혹은 하나의 AF와 통신을 하는 모든 Ambient IoT들을 identify 할 수 있다. - Group ID: Ambient IoT들의 수가 많기 때문에 이를 제어하기 위해서는 Ambient IoT들을 그룹화하는 것 이 필요하다. 이를 위해서 Group ID를 사용 할 수 있다. Ambient IoT들의 그룹화는 용도나 능력, 상태 등 여러 분류 기준을 가지고 그룹화 할 수 있다. - Device Type ID: Ambient IoT는 배터리 능력 및 통신 능력에 따라서 상기 [표 1]의 예와 같이 A(TY_A), B(TY_B), C(TY_C) 타입으로 구분될 수 있다. 이를 나타내는 ID 이다. 이 ID를 이용하여 Ambient IoT를 Device Type 별로 그룹화 할 수도 있다. - Connectivity Type ID: Ambient IoT는 네트워크 및 UE와 통신하는 능력 및 Topology에 따라 상기 [표 2]의 예와 같이 Topology 1(T1), Topology 2(T2), Topology 3(T3), Topology 4(T4) 구분될 수 있다. 이를 나타 내는 ID 이다. 이 ID를 이용하여 Ambient IoT를 Connectivity Type 별로 그룹화 할 수도 있다. - Use Case Specific ID: 이 ID는 Ambient IoT가 사용되는 Use Case 혹은 시나리오에 따라 할당할 수 있 는 ID 이다. 일 예로, 산불을 감지하는 시나리오에서는 각 Ambient IoT들은 불을 감지 했을 때 불이 난 위치를 알려야 한다. 즉, Ambient IoT의 위치가 중요하다. 이때, Ambient IoT의 Use Case Specific ID로 Ambient IoT 의 위치를 사용하게 되면 Ambient IoT는 산불의 위치를 데이터로 따로 전송할 필요 없이 산불이 발생했다는 Notification만 전송하면 3rd party provider는 Ambient IoT의 ID 만으로 그 위치를 파악할 수 있다. 이는 하 나의 실시 예이고 이 외에 다양한 Use Case에서 이 ID가 활용 될 수 있다. - Unique Device ID: 이 ID는 각 디바이스를 구분하기 위한 unique한 ID이다. Unique Device ID는 MNO ID, Enterprise ID, AF ID 등과 함께 사용하게 되면 globally unique한 Device ID가 될 수 있다. Ambient IoT들의 Device의 수가 너무 많기 때문에 3rd party provider에서 임의로 수의 range로 Unique Device ID를 할당 할 수도 있고 또한 Device의 제조 번호로 이를 대체 할 수도 있다. Unique Device ID는 3rd party provider 안에서 각 Device를 unique하게 identify 할 수 있는 어떠한 값으로 정의 될 수 있다. 상기 Ambient IoT의 Device ID를 구성하는 요소들은 일 예를 나타낸 것이며, Device ID의 element들 은 Ambient IoT의 사용 목적이나 기기의 능력에 따라서 자유롭게 구성될 수 있다. 또한, 참조번호 310 내지 350 의 예와 같이 Ambient IoT 그룹화를 위해서 다양한 element들을 사용하여 Group ID를 구성할 수 있다. 또한, 본 실시 예에서 언급하지 않은 다양한 element들이 Ambient IoT 사용 목적이나 기능에 따라 추가 될 수도 있다. 각 element들 중에서 최소한 AF ID와 Unique Device ID는 Ambient IoT의 Device ID에 포함 될 수 있다. 본 개시의 실시 예에서 Ambient IoT에게 Device ID를 할당하는 방식에 대해 설명하기로 한다. Ambient IoT에게 Device ID 할당은 다음 a) 내지 c)과 같은 방식 중 적어도 하나를 이용하여 수행 될 수 있다. a) Pre-Configured 방식 b) Provisioned 방식 c) Self-Configured 방식 상기 Pre-Configured 방식은 Ambient IoT을 전개하기 전에 Device ID를 할당하는 방식이다. Device ID의 할당 은 이동통신사업자나 3rd party provider에 의해서 수행될 수 있다. 일 예로, 다음과 같이 전개 되기 전에 모든 Ambient IoT에게 할당 할 수 있다. 예를 들어 <MNO ID><AF ID><TY_A><T3><Serial No>와 같이 할당된 Device ID 는 MNO ID, AF ID, 상기 [표 1]의 Device Type, 상기 [표 2]의 Topology 및 Ambient IoT의 Serial 번호를 포함한다. 도 4는 본 개시의 실시 예에 따라 상기 Provisioned 방식을 이용한 Ambient IoT의 Device ID 할당 방식을 설명 하기 위한 도면이다. Ambient IoT들은 전개되기 전에 이동통신사업자나 3rd party provider에 의해서 상기 Pre-Configured 방식처럼 partial하게 Device ID가 할당 될 수 있다. 일 예로, <MNO ID><AF ID><TY_A><T3><Serial No>와 같이 할당될 수 있다. 이후, 항공 등 다양한 수단을 통해서 Ambient IoT들이 해당 지역에 전개된 후 상기 Ambient IoT들은 3rd party provider 혹은 이동통신사업자에 의해서 provision되는 값을 네트워크를 통해 수신하여 자신의 Device ID 를 업데이트/확인할 수 있다. 일 예로, 도 4의 예에서 참조번호 401 내지 405와 같이, List of Tracking Areas (TA)s을 적어도 하나의 Area Code (AC)(AC_A, AC_B, AC_C, AC_D, AC_E)로 설정하여/맵핑하고, 네트워크를 통해 그 설정/맵핑 정보를 NG-RAN을 통해서 각 Ambient IoT에게 전파하여 그 설정/맵핑 정보를 수신한 Ambient IoT는 pre-configured 된 Device ID에 이 값을 추가하여 자신의 Device ID를 업데이트/확인할 수 있다. 일 예로, <MNO ID><AF ID><AC_A><TY_A><T3><Serial No>와 같이 구성된 Device ID는 Area Code A(AC_A)의 지역에 전개된 Ambient IoT에게 할당될 수 있다. 이는 하나의 실시 예일 뿐 다양한 설정/맵핑 정보가 Ambient IoT들이 전개된 후 provision되어 Device ID로 활용 될 수 있다. 도 5는 본 개시의 실시 예에 따라 상기 Self-Configured 방식을 이용한 Ambient IoT의 Device ID 할당 방식을 설명하기 위한 도면이다. Ambient IoT들은 전개되기 전에 이동통신사업자나 3rd party provider에 의해서 상기 Pre-Configured 방식처럼 partial하게 Device ID가 할당 될 수 있다. 일 예로, <MNO ID><AF ID><TY_A><T3><Serial No>와 같이 할당될 수 있다. 이후, 항공 등 다양한 수단을 통해서 Ambient IoT들이 전개된 후 다양한 방식을 통해서 Ambient IoT는 자 신의 Device ID 값을 Configured 혹은 업데이트 할 수 있다. 도 5의 예에서는 2가지의 Use Case를 도시하고 있다. 참조 번호 510의 산불 감지 Use Case의 경우, 모든 Ambient IoT들이 전개된 후 각 Ambient IoT는 자신의 디바이스 내 탑재된 GPS(Global Positioning System) 센서를 이용하여 자신의 위치를 확인/파악할 수 있다. 이 Use Case에서는 Ambient IoT가 화재를 발견 했을 때 화재가 발생한 위치를 아는 것이 중요하다. Ambient IoT는 상기 Device ID를 구성하는 element들 중에서 Use case specific ID로 자신의 위치 정보를 사용할 수 있다. 일 예로, GPS을 통해 Ambient IoT가 자신의 위치정보(예를 들어 36.613012,127.505038)를 이용하여 다음과 같이 Device ID를 Self-Configure 혹은 업데이트 할 수 있다.(이 경우 Device ID는 <MNO ID><AF ID><TY_A><T3><36.613012,127.505038>와 같이 구성될 수 있다.) 이때 Ambient IoT의 위치정보 자체가 unique한 값이 될 수 있기 때문에 해당 Ambient IoT의 Serial No 를 대체하여 Unique Device ID가 사용 될 수도 있다. 도 5의 참조 번호 520의 Use Case는 물류창고에서 물류를 Tracking 하는 Use Case를 예시한 것이다. 이 경우 각 Ambient IoT는 물류 창고 내에 전개된 후 Ambient IoT에 탑재된 센서를 이용하여 Tracking 할 물류의 상품 ID 를 센싱 할 수 있다. 이 Use Case에서는 어떤 상품이 현재 어느 위치에 있는 것이 중요한 정보이다. 즉, 이 Use Case에서는 Use case specific ID로 상품의 ID을 사용 할 수 있다. 각 Ambient IoT 디바이스들들은 센싱한 상 품의 ID(예를 들어 77712)를 이용하여 다음과 같이 Device ID를 Self-Configure 혹은 업데이트 할 수 있다.(이 경우 Device ID는 <MNO ID><AF ID><TY_A><T3><77712>와 같이 구성될 수 있다.) 상기 상품 ID가 unique한 값이 라면 Ambient IoT의 Serial No 를 대체하여 Unique Device ID를 사용할 수도 있고, 그렇지 않은 경우엔 Device ID는 예를 들어 <MNO ID><AF ID><TY_A><T3><77712><Serial No>와 같이 Self-Configured 될 수 있다. 도 6은 본 개시의 실시 예에 따라 상기 Provisioned 방식을 이용한 Device ID 할당 절차를 나타낸 흐름도이다. 도 6의 예에서 각 네트워크 엔터티의 기본적인 기능은 도 1의 예를 참조할 수 있다. 도 6을 참조하면, 단계 600에서 모든 혹은 일부 Ambient IoT 디바이스들은 필드에 전개되기 전에 이동통신사업 자나 3rd Party Provider의 AF(서버)에 의해서 partial Device ID가 pre-configured 될 수 있다. 상기 Pre- configured 되는 partial Device ID는 Ambient IoT 디바이스들의 전개 후에 값에 변경이 없는 element들이 될 수 있다. 일 예로 본 실시 예에서는 상기 partial Device ID가 도 3의 예에서 설명한 MNO ID, AF ID, Device Type ID, Connectivity Type ID 요소들 중 적어도 하나를 포함함을 가정한다. 이는 하나의 예 일뿐 다른 다양한 요소들이 pre-configured 될 수 있다. 단계 601에서 Ambient IoT 디바이스들은 다양한 방식을 통해서 예를 들어 공항, 차량, 사람, 산, 공장, 쇼핑몰 등 다양한 센싱 필드(들)에 전개될 수 있다. 단계 602에서 3rd Party Provider (AF) 혹은 이동통신사업자 (MNO)는 Ambient IoT 디바이스들의 Device ID를 업데이트하기 위해서 AMF에게 Device ID 관련 정보를 포함하는 Device ID Provisioning request 메시지를 전송 할 수 있다. 본 실시 예에서는 설명의 편의상 상기 Device ID 관련 정보로 각 Ambient IoT 디바이스의 위치 기 반 정보를 일 예로 설명한다. 상기 Provisioning 되는 Device ID 관련 정보는 Ambient IoT 디바이스의 위치 정 보뿐만 아니라 Use Case에 따라 다양한 정보가 될 수 있다. 일 예로, 상기 Device ID 관련 정보는 관찰하는 상 품 정보, 지역 환경 정보 등등 다양한 정보를 이용할 수 있다. 본 실시 예에서는 전술한 도 4의 일 실시예 기반 으로 설명한다. 예를 들어 MNO/AF는 상기 AMF에게 Device ID 관련 정보로 각 Area Code (AC)에 해당하는 위치 정보를 전송할 수 있다. 상기 위치 정보는 일 예로, AC A: 위도: 36.3-37.1, 경도: 70-90 등이 될 수 있다. 단계 603, 604에서 AMF는 MNO/AF로부터 수신한 위치 정보를 list of Tracking Areas (TAs)로 Resolve 한다. 일 예로, AMF는 상기 수신한 위치 정보를 도 4 및 도 5의 예에서 예시한 AC A: TA1, TA2, TA3와 같이 변경한 정보 를 Device ID Provisioning Request 메시지에 포함하여 각 TA list를 담당하는 (R)AN에게 전송한다. 일 예로, AC A를 정보를 포함한 Device ID Provisioning Request 메시지는 다수의 (R)AN들 중 해당 지역의 (R)AN 1, (R)AN 2, (R)AN 3 등에게 전송되고, AC B를 정보를 포함한 Device ID Provisioning Request 메시지는 해당 지 역의 (R)AN 4, (R)AN 5, (R)AN 6 등에게 전송될 수 있다. 도 6의 예에서는 편의상 하나의 (R)AN을 도시하였으나, 실제로 다수의 (R)AN들이 본 개시의 절차에 참여할 수 있다. 단계 605에서 각 (R)AN들은 Device ID Provisioning Request 메시지를 통해 수신 받은 정보를 Device ID information 메시지에 포함하여 Ambient IoT 디바이스들에게 Broadcast 할 수 있다. 또한 상기 Device ID information 메시지는 Ambient IoT 디바이스들에게 그룹 캐스트로 전달될 수도 있다. 단계 606에서 각 Ambient IoT들은 상기 Device ID information 메시지를 통해 수신 받은 정보를 이용하여 자신 의 pre-configured된 Device ID에 수신 받은 정보(AC_A)를 이용하여 자신의 Device ID를 업데이트할 수 있다. 일 예로, 상기 업데이트된 Device ID는 상기 AC_A를 포함하여 <MNO ID><AF ID><AC_A><TY_A><T3><Serial No>와 같이 구성될 수 있다.단계 607에서 각 Ambient IoT들은 업데이트한 자신의 Device ID를 Device ID Provisioning Response 메시지에 포함하여 MNO/AF에게 전송 할 수 있다. 선택적인 실시 예로 Use Case에 따라서 상기 단계 607은 생략될 수 있다. 단계 608에서 각 Ambient IoT로부터 상기 Device ID Provisioning Response 메시지를 통해 업데이트된 Device ID 수신한 MNO/AF는 각 Ambient IoT의 subscription 정보를 업데이트 한다. 단계 609에서 AF/MNO는 Ambient IoT(들)에게 할당한 업무가 변경되거나 혹은 센싱 보고 회수, 센싱 보고 데이터 내용 등 업무나 혹은 Configuration 관련 변경이 발생 했을 때 이를 TASK CHANG REQUET 메시지에 포함하여 모든 혹은 일부 Ambient IoT(들)에게 전송 할 수 있다. 이때, 어떠한 변경에 특정 Area Code에만 한정 될 때, 일 예 로, 강수량을 측정하는 Use Case 경우 남부 지역에 폭우가 예상되면 남부 지역에 전개된 Ambient IoT 디바이스 들에게만 하루 강수량 보고 회 수를 기존 1번 보고에서 3번 보고로 변경 한다 던지 어떤 장치가 Ambient IoT 디 바이스들에게 어떤 상황 (일 예로, 폭우로 인하여 디바이스들의 위치가 변경 되었을 때, 주변의 화재로 인하여 센서의 기능에 이상이 발생 했을 때 등) 혹은 어떤 조건 (일 예로, 측정된 비의 양이 어떤 일정 값 이상 일 때, 측정된 기온이 일정 값 이상이나 이하 일 때 등)에서 어떤 정보 (일 예로, 측정된 비의 양이 일정 값 이상 일 때 보고 회 수, 주변의 어떤 요인에 의해서 Ambient IoT 디바이스의 위치가 변경 되었을 때 네트워크에 특정 값 을 보고 등)를 포함하는 TASK CHANG REQUET 메시지를 전송하고, 해당 메시지를 수신한 Ambient IoT 디바이스는 수신된 TASK CHANG REQUET 메시지의 Device ID 에 포함된 Area Code 정보와 Ambient IoT 디바이스에 설정된 Area 정보를 비교하고, 비교 결과에 기반하여 즉, Ambient IoT 디바이스에 설정된 Area 정보가 수신된 TASK CHANG REQUET 메시지의 Device ID 에 포함된 Area Code와 관련되어 있으면 상기 수신된 TASK CHANG REQUET 메 시지는 Ambient IoT 디바이스를 위한 TASK CHANG REQUET 메시지임을 확인하고 수신된 TASK CHANG REQUET 메시 지에 포함된 정보에 기반하여 Ambient IoT 디바이스는 설정 정보 (강수량 보고 횟수)를 업데이트 할 수 있다. 일 예로, Ambient IoT 디바이스는 가뭄이 예상되는 강원도 지역엔 하루 1번 보고에서 이틀에 1번 보고로 변경 할 수 있다. 이때, 해당 TASK CHANGE REQUEST 메시지는 일 예로 강원도 지역인 Area Code B 지역과 남부 지역 인 Area Code D 지역 등과 같이 일부 지역에만 선별적으로 전송 될 수 있다. 또한, 전국에 있는 모든 Ambient IoT 디바이스들에게 TASK CHANGE REQUEST 메시지를 전송 하더라도 각 AC마다 다른 TASK를 할당 할 수 있다. 일 예로, Ambient IoT 디바이스가 multi-functional sensor을 포함 했을 경우, 예를 들어 AC_A: 온도 측정, AC_B: 강우량 측정, AC_C: 변경 없음, AC_D: 산불 탐지 등 AF/MNO는 Ambient IoT 디바이스들에게 각 AC마다 다른 TASK를 할당 할 수 있고 이를 수신한 Ambient IoT 디바이스들은 자신의 AC에 할당한 TASK를 수행할 수 있다. 단계 610에서는 각 Ambient IoT 디바이스가 자신에게 부여된 TASK를 수행하고 그에 대한 보고 및 Notification 을 MNO/AF에게 전송할 수 있다. 일 예로, 산불 감지, 하루 강수량 보고 등. 도 6의 예에서는 Ambient IoT 디바이스의 위치를 기반으로 하는 provisioned device id 할당 방안을 일 예로 설명 하였으나 다양한 Use Case에서 다양한 정보가 Ambient IoT 디바이스에게 provisioned 되어질 수 있고 그에 따른 각 Ambient IoT 디바이스 및 관련 NF들도 그 operation이 변경 될 수 있다. 도 7은 본 개시의 실시 예에 따라 상기 self-configured 방식을 이용한 Device ID 할당 절차를 나타낸 흐름도이 다. 도 7의 예에서 각 네트워크 엔터티의 기본적인 기능은 도 1의 예를 참조할 수 있다. 단계 700에서 모든 혹은 일부 Ambient IoT 디바이스들은 필드에 전개되기 전에 이동통신사업자나 3rd Party Provider의 AF(서버)에 의해서 partial Device ID가 pre-configured 될 수 있다. 상기 Pre-configured 되는 partial Device ID는 Ambient IoT 디바이스들의 전개 후에 값에 변경이 없는 element들이 될 수 있다. 일 예로 본 실시 예에서는 상기 partial Device ID가 도 3의 예에서 설명한 MNO ID, AF ID, Device Type ID, Connectivity Type ID 요소들 중 적어도 하나를 포함함을 가정한다. 이는 하나의 예 일뿐 다른 다양한 요소들이 pre-configured 될 수 있다. 단계 701에서 Ambient IoT 디바이스들은 다양한 방식을 통해서 예를 들어 공항, 차량, 사람, 산, 공장, 쇼핑몰 등 다양한 센싱 필드(들)에 전개될 수 있다. 단계 702에서 각 Ambient IoT들은 전개된 후 각각 업무에 맞게 주변을 센싱한다. 일 예로, 산불 감시 업무를 수 행하는 디바이스는 GPS를 이용하여 자신의 위치 정보를 센싱하고 물류 창고에서 상품의 위치를 추적하는 디바이 스의 경우엔 상품의 ID를 센싱 할 수 있다. 예를 들어 각 Ambient IoT 디바이스들은 자신들이 센싱한 정보를 이 용하여 자신의 pre-configured된 Device ID에 센싱한 위치 정보(36.613012,127.505038)를 이용하여 Device ID 를 업데이트 할 수 있다. 일 예로, 상기 위치 정보를 포함한 Device ID는 <MNO ID><AFID><TY_A><T3><36.613012,127.505038>와 같이 업데이트 될 수 있다. 단계 703에서 각 Ambient IoT들은 업데이트한 자신의 Device ID를 Device ID Update 메시지에 포함하여 MNO/AF 에게 전송 할 수 있다. 선택적인 실시 예로 Use Case에 따라서 상기 단계 703은 생략될 수 있다. 단계 704에서 Ambient IoT로부터 상기 Device ID Provisioning Response 메시지를 통해 업데이트된 Device ID 를 수신한 MNO/AF는 각 Ambient IoT의 subscription 정보를 업데이트 한다. 단계 705에서 AF/MNO는 Ambient IoT에게 할당한 업무가 변경되거나 혹은 센싱 보고 회수, 센싱 보고 데이터 내 용 등 업무나 혹은 Configuration 관련 변경이 발생 했을 때 이를 TASK CHANG REQUET 메시지에 포함하여 모든 Ambient IoT에게 전송 할 수 있다. 또한, Use Case에 따라서 각 Ambient IoT 디바이스의 위치에 따라서 도 6의 예에서 처럼 Area Code를 나누어서 Area Code를 Ambient IoT에게 전송 할 수도 있다. 상기 TASK CHANG REQUET 메시지를 수신한 Ambient IoT 디바이스들은 도 6의 예에서처럼 수신 받은 정보를 이용하여 자신의 Device ID를 업데이트 할 수 있다. 이때, 어떠한 변경에 특정 Area Code에만 한정 될 때, 일 예로, 강수량을 측정하는 Use Case 경우 남부 지역에 폭우가 예상되면 남부 지역에 전개된 Ambient IoT 디바이스들에게만 하루 강수량 보고 회 수를 예를 들어 기존 1번 보고에서 3번 보고로 변경 한다 던지 가뭄이 예상되는 강원도 지역엔 하루 1번 보 고에서 이틀에 1번 보고로 변경 할 수 있다. 이때, 해당 TASK CHANGE REQUEST는 일 예로 강원도 지역인 Area Code B 지역과 남부 지역인 Area Code D 지역에만 선별적으로 전송 될 수 있다. 또한, 전국에 있는 모든 Ambient IoT 디바이스에게 TASK CHANGE REQUEST를 전송 하더라도 각 AC마다 다른 TASK를 할당 할 수 있다. 일 예로, Ambient IoT 디바이스가 multi-functional sensor을 포함 했을 경우, 예를 들어 AC_A: 온도 측정, AC_B: 강우량 측정, AC_C: 변경 없음, AC_D: 산불 탐지 등 AF/MNO는 Ambient IoT 디바이스들에게 각 AC마다 다른 TASK를 할당 할 수 있고 이를 수신한 Ambient IoT 디바이스들은 자신의 AC에 할당한 TASK를 수행할 수 있다. 단계 706에서는 각 Ambient IoT 디바이스가 자신에게 부여된 TASK를 수행하고 그에 대한 보고 및 Notification 을 MNO/AF에게 전송할 수 있다. 일 예로, 산불 감지, 하루 강수량 보고 등. 도 7의 실시 예에서는 디바이스의 위치를 기반으로 하는 self-configured device ID 할당 방안을 일 예로 설명 하였으나 다양한 Use Case에서 다양한 정보를 Ambient IoT 디바이스 들이 센싱하여 자신의 Device ID를 업데이 트 할 수 있으며 그에 따른 각 Ambient IoT 디바이스 및 관련 NF들도 그 operation이 변경 될 수 있다. 도 8은 본 개시의 실시 예에 따른 단말의 구성의 일 예를 나타낸 도면이다. 본 개시의 일 실시예에 따른 단말은 단말의 전반적인 동작을 제어하는 프로세서, 송신기 및 수신기를 포함 하는 송수신기 및 메모리를 포함할 수 있다. 물론 상기 예시에 제한되는 것은 아니며 단말은 도 8에 도시된 구성보다 더 많은 구성을 포함할 수도 있고, 더 적은 구성을 포함할 수도 있다. 본 개시의 일 실시예에 따르면, 송수신기는 네트워크 엔티티(Network Entity)들 또는 다른 단말과 신호를 송수신할 수 있다. 네트워크 엔티티와 송수신하는 신호는 제어 정보와 데이터 중 적어도 하나를 포함할 수 있다. 또한 송수신기는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부 터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 상술한 도 1 내지 도 7의 실시 예들 중 적어도 하나의 동작을 수행하도록 단말의 동작을 제어할 수 있다. 한편, 프로세서, 메모리, 및 송수신기는 반드시 별 도의 모듈들로 구현되어야 하는 것은 아니고, 단일 칩과 같은 형태로 하나의 구성부로 구현될 수 있음은 물론이 다. 그리고, 프로세서 및 송수신기는 전기적으로 연결될 수 있다. 또한 프로세서는 AP(Application Processor), CP(Communication Processor), 회로(circuit), 어플리케이션 특정(application- specific) 회로, 또는 적어도 하나의 프로세서(processor)일 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장할 수 있다. 특히, 메모리는 프로세서의 요청에 따라 저장된 데이터를 제공한다. 메모리는 롬 (ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으 로 구성될 수 있다. 또한, 메모리는 복수 개일 수 있다. 또한 프로세서는 메모리에 저장된 전술 한 본 개시의 실시예들을 수행하기 위한 프로그램에 기초하여 전술한 실시예들 중 적어도 하나를 수행할 수 있 다. 도 9는 본 개시의 실시 예에 따른 기지국 또는 네트워크 엔티티(Network Entity)의 구성을 나타낸 도면이다. 본 개시의 일 실시예에 따른 네트워크 엔티티는 네트워크 엔티티의 전반적인 동작을 제어하는 프로세서, 송신기 및 수신기를 포함하는 송수신부 및 메모리를 포함할 수 있다. 물론 상기 예시에 제한되는 것 은 아니며 네트워크 엔티티는 도 9에 도시된 구성보다 더 많은 구성을 포함할 수도 있고, 더 적은 구성을 포함 할 수도 있다. 본 개시의 일 실시예에 따르면, 송수신기는 다른 네트워크 엔티티들 또는 단말 중 적어도 하나와 신호를 송수신할 수 있다. 다른 네트워크 엔티티들 또는 단말 중 적어도 하나와 송수신하는 신호는 제어 정보와 데이터 중 적어도 하나를 포함할 수 있다. 도 9의 네트워크 엔터티가 기지국인 경우 송수신기는 단말과 무선 신호 를 송수신하기 위한 송수신기와 코어 네트워크에서 다른 네트워크 엔터티와 신호를 신호를 송수신하기 위한 송 수신기 혹은 통신 인터페이스를 포함할 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 상술한 도 1 내지 도 7의 실시 예들 중 적어도 하나의 동작을 수행하도록 네트워크 엔티티를 제어할 수 있다. 한편, 프로세서, 메모리 및 송수신부는 반드시 별도의 모듈들로 구현되어야 하는 것은 아니고, 단일 칩과 같은 형태로 하나의 구성부로 구현될 수 있음은 물론 이다. 그리고, 프로세서 및 송수신부는 전기적으로 연결될 수 있다. 또한, 프로세서는 AP(Application Processor), CP(Communication Processor), 회로(circuit), 어플리케이션 특정(application- specific) 회로, 또는 적어도 하나의 프로세서(processor)일 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 네트워크 엔티티의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장할 수 있다. 특히, 메모리는 프로세서의 요청에 따라 저장된 데이터를 제공한다. 메모리는 롬(ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들 의 조합으로 구성될 수 있다. 또한, 메모리는 복수 개일 수 있다. 또한 프로세서는 메모리에 저 장된 전술한 본 개시의 실시예들을 수행하기 위한 프로그램에 기초하여 전술한 실시예들 중 적어도 하나를 수행 할 수 있다. 전술한 구성도, 제어/데이터 신호 송신 방법의 예시도, 동작 절차 예시도, 구성도들은 본 개시의 권리범위를 한 정하기 위한 의도가 없음을 유의하여야 한다. 즉, 본 개시의 실시 예에 기재된 모든 구성부, 엔티티, 또는 동작 의 단계가 개시의 실시를 위한 필수구성요소인 것으로 해석되어서는 안되며, 일부 구성요소 만을 포함하여도 개 시의 본질을 해치지 않는 범위 내에서 구현될 수 있다. 또한 각 실시예는 필요에 따라 서로 조합되어 운용할 수 있다. 예컨대, 본 개시에서 제안하는 방법들의 일부분들이 서로 조합되어 네트워크 엔티티와 단말이 운용될 수 있다. 앞서 설명한 기지국이나 단말의 동작들은 해당 프로그램 코드를 저장한 메모리 장치를 기지국 또는 단말 장치 내의 임의의 구성부에 구비함으로써 실현될 수 있다. 즉, 기지국 또는 단말 장치의 제어부는 메모리 장치 내에 저장된 프로그램 코드를 프로세서 혹은 CPU(Central Processing Unit)에 의해 읽어내어 실행함으로써 앞서 설명 한 동작들을 실행할 수 있다. 본 명세서에서 설명되는 엔티티, 기지국 또는 단말 장치의 다양한 구성부들과, 모듈(module)등은 하드웨어 (hardware) 회로, 일 예로 상보성 금속 산화막 반도체(complementary metal oxide semiconductor) 기반 논리 회로와, 펌웨어(firmware)와, 소프트웨어(software) 및/혹은 하드웨어와 펌웨어 및/혹은 머신 판독 가능 매체에 삽입된 소프트웨어의 조합과 같은 하드웨어 회로를 사용하여 동작될 수도 있다. 일 예로, 다양한 전기 구조 및 방법들은 트랜지스터(transistor)들과, 논리 게이트(logic gate)들과, 주문형 반도체와 같은 전기 회로들을 사 용하여 실시될 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수개 포함될 수도 있다. 또한, 상기 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또 는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접 근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장 치는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도 의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 개시에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라하더라도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시시의 범위는 설명된 실시 예에 국한되어 정 해져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다. 즉, 본 개시의 기술적 사상에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 개시의 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명한 것이다. 또한 상기 각각의 실시 예는 필요에 따라 서로 조합되어 운용할 수 있다. 예컨대, 본 개시에서 제안하는 방법들의 일부분들이 서로 조합되어 기지국과 단말이 운용될 수 있다. 또한 상기 실시예들은 5G, NR 시스템을 기준으로 제시되었지만, LTE, LTE-A, LTE-A-Pro 시스템 등 다른 시스템에도 상기 실시예의 기술적 사상에 바탕을 둔 다른 변형예들이 실시 가능할 것이다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 안되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2023-0101848", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시 예에 따라 무선 통신 시스템의 일 구성 예를 나타낸 도면, 도 2는 본 개시의 실시 예에 따라 통신 시스템에서 Ambient IoT를 이용하는 시나리오의 일 예를 도시한 도면, 도 3은 본 개시의 실시 예에 따른 Ambient IoT의 식별 정보인 Device ID의 일 구성 예를 도시한 도면, 도 4는 본 개시의 실시 예에 따라 Provisioned 방식을 이용한 Ambient IoT의 Device ID 할당 방식을 설명하기 위한 도면, 도 5는 본 개시의 실시 예에 따라 Self-Configured 방식을 이용한 Ambient IoT의 Device ID 할당 방식을 설명 하기 위한 도면, 도 6은 본 개시의 실시 예에 따라 상기 Provisioned 방식을 이용한 Device ID 할당 절차를 나타낸 흐름도, 도 7은 본 개시의 실시 예에 따라 상기 self-configured 방식을 이용한 Device ID 할당 절차를 나타낸 흐름도, 도 8은 본 개시의 실시 예에 따른 단말의 구성의 일 예를 나타낸 도면, 및 도 9는 본 개시의 실시 예에 따른 기지국 또는 네트워크 엔티티(Network Entity)의 구성을 나타낸 도면."}
