{"patent_id": "10-2022-0154047", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0072454", "출원번호": "10-2022-0154047", "발명의 명칭": "키오스크 데이터 연합학습 처리 방법", "출원인": "주식회사 큐버", "발명자": "김화종"}}
{"patent_id": "10-2022-0154047", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "네트워크로 연결된 다수의 키오스크 장치(100)와 연합학습 서버(200)에 의해 키오스크 장치(100)에서 수집된 데이터를 연합학습(Federated Learning, FL)으로 분석 처리하는 키오스크 데이터 연합학습 처리 방법으로서, 상기 각각의 키오스크 장치(100)가 키오스크 사용자와의 인터랙션과 관련하여 발생되는 키오스크 사용 데이터를수집하는 제 1 단계; 상기 연합학습 서버(200)가 연합학습 그룹을 설정하는 제 2 단계; 상기 연합학습 서버(200)가 연합학습 그룹에 속하는 각각의 키오스크 장치(100)로 공통 신경망 모델(CNNM)을 다운로드 제공하는 제 3 단계; 상기 각각의 키오스크 장치(100)가 상기 제공된 공통 신경망 모델(CNNM)을 자신의 로컬 신경망 모델(LNNM)로 설정하는 제 4 단계; 상기 각각의 키오스크 장치(100)가 상기 자신이 수집한 키오스크 사용 데이터를 이용하여 자신의 로컬 신경망모델(LNNM)을 머신러닝 학습하는 제 5 단계; 상기 각각의 키오스크 장치(100)가 상기 머신러닝 학습된 자신의 로컬 신경망 모델(LNNM)의 신경망 파라미터를상기 연합학습 서버(200)로 업로드하는 제 6 단계; 상기 연합학습 서버(200)가 상기 다수의 키오스크 장치(100)로부터 업로드 제공받은 로컬 신경망 모델(LNNM)의신경망 파라미터를 취합하는 제 7 단계; 상기 연합학습 서버(200)가 상기 취합된 신경망 파라미터를 이용하여 공통 신경망 모델(CNNM)을 업데이트하는제 8 단계; 를 포함하여 구성되는 키오스크 데이터 연합학습 처리 방법."}
{"patent_id": "10-2022-0154047", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 키오스크 사용 데이터는 사용자 주문을 처리하는 과정에서 획득하는 주문 처리 데이터 및 키오스크 사용자에 대해 획득하는 사용자 감지 데이터를 포함하여 구성되고, 상기 주문 처리 데이터는 주문 시작시간, 메인 메뉴, 단품메뉴 또는 세트메뉴 선택, 디저트, 드링크, 매장식사또는 포장주문, 결제 정보의 적어도 하나이상을 포함하고, 상기 사용자 감지 데이터는 키오스크 사용자에 대한 성별, 연령대, 주문시 감정 정보의 적어도 하나이상을 포함하는 것을 특징으로 하는 키오스크 데이터 연합학습 처리 방법."}
{"patent_id": "10-2022-0154047", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 제 2 단계 이전에 수행되는, 상기 연합학습 서버(200)가 공통 신경망 모델(CNNM)의 망 구조 및 신경망 파라미터를 초기 설정하여 공통 신경망 모델(CNNM)을 초기화 설정하는 단계; 공개특허 10-2024-0072454-3-를 더 포함하여 구성되는 것을 특징으로 하는 키오스크 데이터 연합학습 처리 방법."}
{"patent_id": "10-2022-0154047", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 제 1 단계와 상기 제 2 단계 사이에 수행되는, 미리 설정된 연합학습 개시 조건의 만족 여부를 확인하는 단계; 를 더 포함하여 구성되고, 상기 제 8 단계 이후에 수행되는, 미리 설정된 반복 라운드에 도달하지 않은 경우에 상기 제 3 단계로 진행하는 단계; 를 더 포함하여 구성되는 것을 특징으로 하는 키오스크 데이터 연합학습 처리 방법."}
{"patent_id": "10-2022-0154047", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 제 8 단계 이후에 수행되는, 상기 각각의 키오스크 장치(100)가 자신이 수집하는 키오스크 사용 데이터를 초기화하는 단계; 를 더 포함하여 구성되는 것을 특징으로 하는 키오스크 데이터 연합학습 처리 방법."}
{"patent_id": "10-2022-0154047", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "컴퓨터에 청구항 1 내지 5 중 어느 하나의 항에 따른 키오스크 데이터 연합학습 처리 방법을 실행시키기 위하여저장매체에 저장된 컴퓨터프로그램."}
{"patent_id": "10-2022-0154047", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 다수의 키오스크 장치와 연합학습 서버를 연동시켜 키오스크 장치에서 수집되는 키오스크 사용 데이터 를 연합학습 방식으로 처리함으로써 수집 데이터가 키오스크 외부로 제공되지 않아 개인정보 문제를 야기하지 않 으면서 고객 파악 및 추천 서비스 추출과 같은 데이터 통합 분석 효과를 구현할 수 있는 키오스크 데이터 연합학 습 처리 기술에 관한 것이다. 본 발명에 따르면 다수의 키오스크 사용 데이터를 통합하여 신경망 모델을 학습시 킬 수 있어 고객 분류 모델을 통한 메뉴 추천과 같은 지능적 기능을 키오스크에 구현할 수 있는 장점이 있다. 또 한, 본 발명에 따르면 각자의 키오스크 장치에서 수집되는 데이터를 키오스크 외부로 제공하지 않음에 따라 사용 자와의 접촉에서 발생되는 키오스크 사용 데이터를 통합 활용하면서도 개인정보 유출, 해킹, 탈취, 불법 사용 등 의 문제를 야기하지 않는 장점이 있다."}
{"patent_id": "10-2022-0154047", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일반적으로 다수의 키오스크 장치에서 수집된 데이터를 개인정보 문제를 야기하지 않고 통합 분석할 수 있는 데이터 처리 기술에 관한 것이다. 특히, 본 발명은 다수의 키오스크 장치와 연합학습 서버를 연동시켜 키오스크 장치에서 수집되는 키오스크 사용 데이터를 연합학습 방식으로 처리함으로써 수집 데이터가 키오스크 외부로 제공되지 않아 개인정보 문제를 야기 하지 않으면서 고객 파악 및 추천 서비스 추출과 같은 데이터 통합 분석 효과를 구현할 수 있는 키오스크 데이 터 연합학습 처리 기술에 관한 것이다."}
{"patent_id": "10-2022-0154047", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래로부터 키오스크 장치가 다양한 목적으로 설치되어 왔다. 키오스크 장치는 기존에 사람이 해주던 일을 전자 적으로 대신 처리해주는 장치로서 예를 들어 민원서류를 발급해준다거나 도서 반납을 무인 처리해주거나 관광지 에서 안내 서비스를 제공해주는 등이다. 이러한 기능을 수행하기 위하여 키오스크 장치는 일반적으로 컴퓨터로 서의 연산 및 데이터 처리 기능을 구비하고 있으면서 사용자 인터랙션 기능과 네트워크 연동 기능을 갖추고 있 다. 특히 2019년 코로나로 인한 비접촉 방식의 선호와 인건비 상승의 여파로 키오스크 장치의 보급이 확산되었다. 그에 따라, 많은 키오스크 장치들이 현장에 설치되어 여러가지 역할을 수행하고 있다. 종래의 키오스크 장치는 특정한 목적(예: 민원서류 발급, 도서 반납, 관광지 안내, 매장 주문)을 위해서 사전에 미리 명시적으로 프로그래밍된 동작을 수행하였다. 그런데, 키오스크가 폭넓게 보급됨에 따라 키오스크를 스마트하게 활용하려는 시도가 있다. 키오스크는 사람과 직접 상호작용하기 때문에 양질의 사용자 데이터를 확보할 수 있는 수단이다. 기존에는 키오스크 장치의 기능에 집중하였으나, 최근에는 키오스크 장치를 통해 데이터를 수집하고 이를 활용하여 키오스크의 기능을 개선하는 데에 관심이 많다. 하지만 키오스크에서 사용자가 수행한 여러가지 행위에 의해 생성된 데이터는 개인정보를 포함하고 있을 가능성 이 높다. 대한민국에서는 개인정보의 수집 이용 제공에 대해 개인정보보호법으로 엄격하게 제한하고 있다. 최근 에 개인정보보호법 개정안을 통하여 연구 목적으로는 정보주체(개인)의 동의없이 데이터를 사용할 수 있도록 제 한을 느슨하게 해주었다. 수집 데이터가 개인정보를 포함하지 않는 경우에는 문제가 되지 않겠지만 얼굴 인식, 개인의 취향 정보 같은 정보도 개인정보에 포함되기에 키오스크에서 수집한 데이터를 통합 분석하는데에는 많은 어려움이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 10-2021-0137676호 \"키오스크로부터 얻은 목표 달성자의 정보를 이용한 정 보 제공 시스템\" (특허문헌 0002) 대한민국 공개특허 10-2022-0118773호 \"AI기반 음성지원 대화형 스마트 키오스크\" (특허문헌 0003) 대한민국 공개특허 10-2022-0038959호 \"개인 맞춤형 인공지능 키오스크 장치 및 이를 이용한 서비스 방법\""}
{"patent_id": "10-2022-0154047", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 일반적으로 다수의 키오스크 장치에서 수집된 데이터를 개인정보 문제를 야기하지 않고 통합 분석할 수 있는 데이터 처리 기술을 제공하는 것이다. 특히, 본 발명의 목적은 다수의 키오스크 장치와 연합학습 서버를 연동시켜 키오스크 장치에서 수집되는 키오스 크 사용 데이터를 연합학습 방식으로 처리함으로써 수집 데이터가 키오스크 외부로 제공되지 않아 개인정보 문 제를 야기하지 않으면서 고객 파악 및 추천 서비스 추출과 같은 데이터 통합 분석 효과를 구현할 수 있는 키오 스크 데이터 연합학습 처리 기술을 제공하는 것이다. 본 발명의 해결 과제는 이 사항에 제한되지 않으며 본 명세서의 기재로부터 다른 해결 과제가 이해될 수 있다."}
{"patent_id": "10-2022-0154047", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위하여 네트워크로 연결된 다수의 키오스크 장치와 연합학습 서버에 의해 키 오스크 장치에서 수집된 데이터를 연합학습(Federated Learning, FL)으로 분석 처리하는 키오스크 데이터 연합학습 처리 방법을 제시한다. 본 발명에 따른 키오스크 데이터 연합학습 처리 방법은, 각각의 키오스크 장치가 키오스크 사용자와의 인 터랙션과 관련하여 발생되는 키오스크 사용 데이터를 수집하는 제 1 단계; 연합학습 서버가 연합학습 그룹 을 설정하는 제 2 단계; 연합학습 서버가 연합학습 그룹에 속하는 각각의 키오스크 장치로 공통 신경 망 모델(CNNM)을 다운로드 제공하는 제 3 단계; 각각의 키오스크 장치가 그 제공된 공통 신경망 모델 (CNNM)을 자신의 로컬 신경망 모델(LNNM)로 설정하는 제 4 단계; 각각의 키오스크 장치가 자신이 수집한 키오스크 사용 데이터를 이용하여 자신의 로컬 신경망 모델(LNNM)을 머신러닝 학습하는 제 5 단계; 각각의 키오 스크 장치가 그 머신러닝 학습된 자신의 로컬 신경망 모델(LNNM)의 신경망 파라미터를 연합학습 서버(20 0)로 업로드하는 제 6 단계; 연합학습 서버가 다수의 키오스크 장치로부터 업로드 제공받은 로컬 신 경망 모델(LNNM)의 신경망 파라미터를 취합하는 제 7 단계; 연합학습 서버가 그 취합된 신경망 파라미터를 이용하여 공통 신경망 모델(CNNM)을 업데이트하는 제 8 단계;를 포함하여 구성된다. 본 발명에서 키오스크 사용 데이터는 사용자 주문을 처리하는 과정에서 획득하는 주문 처리 데이터 및 키오스크 사용자에 대해 획득하는 사용자 감지 데이터를 포함하여 구성될 수 있다. 주문 처리 데이터는 주문 시작시간,메인 메뉴, 단품메뉴 또는 세트메뉴 선택, 디저트, 드링크, 매장식사 또는 포장주문, 결제 정보의 적어도 하나 이상을 포함할 수 있다. 사용자 감지 데이터는 키오스크 사용자에 대한 성별, 연령대, 주문시 감정 정보의 적어 도 하나이상을 포함할 수 있다. 한편, 본 발명에 따른 키오스크 데이터 연합학습 처리 방법은, 제 2 단계 이전에 수행되는, 연합학습 서버(20 0)가 공통 신경망 모델(CNNM)의 망 구조 및 신경망 파라미터를 초기 설정하여 공통 신경망 모델(CNNM)을 초기화 설정하는 단계;를 더 포함하여 구성될 수 있다. 한편, 본 발명에 따른 키오스크 데이터 연합학습 처리 방법은, 제 1 단계와 제 2 단계 사이에 수행되는, 미리 설정된 연합학습 개시 조건의 만족 여부를 확인하는 단계;를 더 포함하여 구성될 수 있다. 한편, 본 발명에 따른 키오스크 데이터 연합학습 처리 방법은, 제 8 단계 이후에 수행되는, 미리 설정된 반복 라운드에 도달하지 않은 경우에 제 3 단계로 진행하는 단계;를 더 포함하여 구성될 수 있다. 한편, 본 발명에 따른 키오스크 데이터 연합학습 처리 방법은, 제 8 단계 이후에 수행되는, 각각의 키오스크 장 치가 자신이 수집하는 키오스크 사용 데이터를 초기화하는 단계;를 더 포함하여 구성될 수 있다. 한편, 본 발명에 따른 컴퓨터프로그램은 컴퓨터에 이상과 같은 키오스크 데이터 연합학습 처리 방법을 실행시키 기 위하여 비휘발성 저장매체에 저장된 것이다."}
{"patent_id": "10-2022-0154047", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 다수의 키오스크 사용 데이터를 통합하여 신경망 모델을 학습시킬 수 있어 고객 분류 모델을 통한 메뉴 추천과 같은 지능적 기능을 키오스크에 구현할 수 있는 장점이 있다. 특히, 연합학습에 의해 키오스 크 사용 데이터의 축적과 함께 신경망 모델을 지속적으로 반복 학습시킬 수 있기 때문에 키오스크 장치의 지능 을 지속적으로 개선할 수 있다. 또한, 본 발명에 따르면 각자의 키오스크 장치에서 수집되는 데이터를 키오스크 외부로 제공하지 않음에 따라 사용자와의 접촉에서 발생되는 키오스크 사용 데이터를 통합 활용하면서도 개인정보 유출, 해킹, 탈취, 불법 사 용 등의 문제를 야기하지 않는 장점이 있다. 특히, 수집 데이터가 키오스크 외부로 제공되지 않으므로 개인정보 수집 동의와 같은 절차를 거치지 않아도 되므로 키오스크 장치의 활용성을 높일 수 있는 장점이 있다."}
{"patent_id": "10-2022-0154047", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명을 상세하게 설명한다. 본 발명을 설명함에 있어서 종래기술과 중복되는 부분에 대해서는 자세한 설명을 생략할 수 있다. [도 1]은 본 발명을 위한 키오스크 데이터 연합학습 시스템의 구성도이다. 본 발명은 다수의 키오스크 장치에서 수집되는 키오스크 사용 데이터를 연합학습 방식으로 처리하는 구조 이다. 키오스크 데이터 연합학습 시스템은 클라이언트-서버 구조로 구성되는 것이 바람직한데, 각각의 키오스크 장치가 클라이언트 역할을 수행하고, 연합학습 서버가 서버 역할을 수행한다. 키오스크 장치는 특정 목적을 위해 분산 배치되어 있는 다수의 장치인 것을 가정한다. 예를 들어, 특정 브 랜드(예: 맥도날드)의 식음료 매장들에 설치된 키오스크 장치를 들 수 있다. 본 발명에서 키오스크 장치가 키오스크 사용자와의 인터랙션과 관련하여 수집하는 데이터를 키오스크 사용 데이터라고 부르는데, 키오스크 사 용 데이터는 주문 처리 데이터와 사용자 감지 데이터를 포함한다. 주문 처리 데이터는 키오스크 장치가 사용자 주문을 처리하는 과정에서 획득하는 데이터이다. 패스트푸드 점에 설치된 키오스크의 경우를 예로 들면, 주문 처리 데이터는 주문 시작시간, 메인 메뉴, 단품메뉴 또는 세트 메뉴 선택, 디저트, 드링크, 매장식사 또는 포장주문, 결제 정보의 적어도 하나이상을 포함할 수 있다. 사용자 감지 데이터는 키오스크 장치가 키오스크 사용자에 대해 획득하는 데이터이다. 키오스크 장치(10 0)에 설치된 카메라 등을 이용하여 키오스크 사용자의 얼굴을 촬영한 후에 이미지 분석을 통해 사용자 감지 데 이터를 얻을 수 있다. 키오스크 장치에 설치된 카메라로 사용자의 얼굴을 촬영하면 사용자에 대해 많은 정 보를 추출할 수 있는데, 사용자의 성별이나 연령대는 기본적으로 식별할 수 있으며, 어펙티바(Affectiva)의 감 정인식 소프트웨어를 통해 주문 당시의 사용자 감정도 식별할 수 있다. 그에 따라, 사용자 감지 데이터는 키오 스크 사용자에 대한 성별, 연령대, 주문시 감정 정보의 적어도 하나이상을 포함할 수 있다. 연합학습 서버는 다수의 키오스크 장치와 협조 동작하여 키오스크 사용 데이터에 대한 연합학습 방식 의 학습 과정을 관리하기 위한 서버 장치이다. 전통적으로 머신러닝 기술은 중앙의 큰 서버에서 데이터를 대규모로 모으고 이를 훈련 데이터셋으로 사용하여 신경망 모델을 학습시키는 중앙 집중화된 방식으로 동작하였다. 반면, 연합학습(Federated Learning, FL)은 여 러 위치에서 분산 저장된 데이터를 직접 공유하지 않으면서 서로 협력하여 인공지능 신경망 모델을 학습시키는 분산형 방식으로 동작한다. 연합학습 처리를 위해 키오스크 장치는 키오스크 사용 데이터의 수집 및 분석, 신경망 모델의 학습 및 검 증, 신경망 모델에서의 가중치 추출, 연합학습 서버와의 신경망 모델 송수신 및 가중치 송수신 기능을 수 행한다. 또한, 연합학습 처리를 위해 연합학습 서버는 공통 신경망 모델의 생성 및 업데이트, 가중치 취합, 키오스크 장치와의 신경망 모델 송수신 및 가중치 송수신 기능을 수행한다. 중앙 집중 처리하는 전 통적인 방식에 비해 연합학습 서버는 상대적으로 저성능으로 작동할 수 있다. 한편, [도 1]을 참조하면, 키오스크 장치와 연합학습 서버는 각자 신경망 모델을 관리한다. 키오스크 장치는 로컬 신경망 모델(Local Neural Network model, LNNM)을 관리하고 연합학습 서버는 공통 신 경망 모델(Common Neural Network model, CNNM)을 관리한다. 공통 신경망 모델(CNNM)은 여러 키오스크 장치 가 참여하여 완성할 하나의 신경망 모델을 말한다. 로컬 신경망 모델(LNNM)은 키오스크 장치가 연합 학습 서버로부터 전달받은 공통 신경망 모델(CNNM)을 각자 수집한 키오스크 사용 데이터로 머신러닝시킨 신경망 모델을 말한다. [도 2]는 본 발명에서 연합학습 서버의 초기화 과정 순서도이다. 단계 (S110) : 먼저, 연합학습 서버는 공통 신경망 모델(CNNM)의 망 구조를 초기 설정한다. [도 3]은 신경 망 모델의 일반적인 구성도이다. 인공지능을 위한 신경망 모델(neural network model)은 노드(nodes)가 멀티레 이어(multi-layer) 구조로 배치되고, 이들 노드 사이의 연결에 적용되는 가중치(weight values)로 이루어진다. (S110)에서는 연합학습 서버가 공통 신경망 모델(CNNM)의 망 구조를 설정한다. 일 실시예로서 공통 신경망 모델(CNNM)의 망 구조를 미리 결정할 수 있다. 단계 (S120) : 다음으로, 연합학습 서버는 공통 신경망 모델(CNNM)의 신경망 파라미터를 초기 설정한다. 일반적으로 신경망 모델의 신경망 파라미터는 가중치(w(i, j))를 의미하는데, 다른 종류의 파라미터를 포함할 수 있다. 일 실시예로서, 연합학습 서버는 공통 신경망 모델(CNNM)의 가중치 값들을 랜덤하게 초기화할 수 있다. [도 4]는 본 발명에 따른 키오스크 데이터 연합학습 처리 프로세스의 순서도이고, [도 5]는 본 발명에 따른 키 오스크 데이터 연합학습 처리 프로세스를 클라이언트-서버 모델로 나타낸 도면이다. 단계 (S210, S220) : 일반적으로 여러 장소에 분산 설치되어 있는 각각의 키오스크 장치가 키오스크 사용 자와의 인터랙션과 관련하여 발생되는 키오스크 사용 데이터를 수집한다. 본 발명에서 키오스크 사용 데이터는 주문 처리 데이터와 사용자 감지 데이터를 포함하여 구성된다. 주문 처리 데이터는 사용자 주문을 처리하는 과 정에서 키오스크 장치가 획득하는 데이터로서 주문 시작시간, 메인 메뉴, 단품메뉴 또는 세트메뉴 선택, 디저트, 드링크, 매장식사 또는 포장주문, 결제 정보의 적어도 하나이상을 포함한다. 사용자 감지 데이터는 키 오스크 사용자에 대해 키오스크 장치가 획득하는 데이터로서 성별, 연령대, 주문시 감정 정보의 적어도 하 나이상을 포함한다. 다음으로, 키오스크 장치는 미리 설정된 연합학습 개시 조건이 만족되었는지 여부를 확인한다. 예를 들면, 매장의 하루 영업이 종료한 것을 연합학습 개시 조건이 만족된 것으로 미리 설정할 수 있다. 이 경우, 당일의 매장 영업 동안에 키오스크 장치가 수집한 키오스크 사용 데이터를 이용하여 연합학습을 수행하는 것이다. 한편, 연합학습 개시 조건은 설계자가 적절히 설정할 수 있다. 단계 (S230) : 연합학습 서버가 연합학습(FL)에 참여할 키오스크 장치들의 집단인 연합학습 그룹을 설정한다. 이를 위해, 연합학습 서버는 먼저 여러 지점에서 활용 중인 키오스크 장치의 상태를 확인 하는 과정을 거쳐 가용 장비의 수를 확인하고, 키오스크 장치에 대해 연합학습에 참여할 수 있는지 여부를 문의하고, 키오스크 장치로부터 연합학습 참여 가능 여부의 회신을 받는다. 연합학습 서버는 연합학 습에 참여 가능하다고 회신한 키오스크 장치들에 의해 연합학습 그룹을 설정하고 연합학습 절차를 개시한 다. 단계 (S240) : 연합학습 서버는 공통 신경망 모델(CNNM)을 연합학습 그룹에 속하는 각각의 키오스크 장치 로 다운로드 제공한다. 최초에는 [도 2]에 의해 초기화 설정된 공통 신경망 모델(CNNM)을 다운로드 제공하 고, 일정 이상 학습이 진행되고 난 후에는 이전에 연합학습이 이루어진 공통 신경망 모델(CNNM)을 다운로드 제 공한다. 단계 (S250) : 각각의 키오스크 장치는 연합학습 서버로부터 제공받은 공통 신경망 모델(CNNM)을 자 신의 로컬 신경망 모델(LNNM)로 설정한다. 그리고 나서, 자신이 수집한 키오스크 사용 데이터를 이용하여 자신 의 로컬 신경망 모델(LNNM)을 머신러닝 학습한다. 이를 위해, 각각의 키오스크 장치는 자신이 수집한 데이 터를 사용하여 로컬 신경망 모델(LNNM)을 머신러닝할 수 있도록 훈련 데이터를 전처리하고, 그 전처리 이후에 로컬 신경망 모델(LNNM)에 대해 머신러닝(기계학습)을 수행하고, 그 이후 성능 평가를 위해 검증 과정을 거칠 수 있다. 이를 위해, 데이터 정제 과정 및 데이터 분할 과정을 수행할 수 있다. 단계 (S260, S270) : 각각의 키오스크 장치는 각자 머신러닝 학습을 수행한 후에 자신의 로컬 신경망 모델 (LNNM)의 신경망 파라미터를 연합학습 서버로 업로드한다. 이때, 신경망 파라미터는 가중치(w(i, j))를 포 함할 수 있다. 연합학습 서버가 다수의 키오스크 장치로부터 업로드 제공받은 신경망 파라미터를 취 합한다. 각 키오스크 장치가 수집한 키오스크 사용 데이터의 통계적 차이로 인하여 머신러닝 학습된 신경 망 파라미터(예: 가중치)도 키오스크 장치마다 상이하다. 연합학습 서버는 이들 신경망 파라미터들에 대한 평균, 중앙값, 가중 평균 등의 취합 알고리즘으로 신경망 파라미터를 취합한다. 단계 (S280 ~ S300) : 다음으로, 연합학습 서버는 그 취합된 신경망 파라미터를 이용하여 공통 신경망 모 델(CNNM)을 업데이트한다. 이로써 연합학습의 학습 1라운드가 이루어진 것이다. 연합학습 서버는 연합학습 의 학습 라운드 횟수가 미리 설정된 반복 라운드에 도달하였는지 여부를 확인하고, 만일 아직 도달하지 않은 경우에는 (S240)으로 진행하여 연합학습 과정을 반복 수행한다. 반복 라운드 횟수는 시스템 설계자가 설정할 수 있다. 이때, 반복 라운드 횟수를 1로 설정한 경우에는 연합학습 횟수는 1회만 수행하게 된다. (S290)의 판단 결과, 연합학습이 반복 라운드에 도달한 경우에, 각각의 키오스크 장치는 자신이 수집하는 키오스크 사용 데이터를 초기화한다. 매장의 하루 영업이 종료한 것을 연합학습 개시 조건으로 설정한 경우를 예로 들면, 하루 단위로 키오스크 장치가 수집한 키오스크 사용 데이터를 이용하여 연합학습이 이루어지게 된다. 이상과 같은 키오스크 데이터의 연합학습을 수행함으로써 키오스크 장치에서 수집하는 주문 처리 데이터와 사용자 감지 데이터를 신경망 모델에 통합적으로 학습시킬 수 있다. 이를 통해, 고객을 파악하고 그에 따라 메 뉴를 추천하는 것과 같은 지능적 기능을 키오스크 장치에 구현할 수 있다. 본 발명에서는 수집 데이터가 키오스크 장치 외부로 제공되지 않기 때문에 개인정보 유출, 해킹, 탈취, 불법 사용 등의 문제가 발생하지 않는다. 한편, 본 발명은 컴퓨터가 읽을 수 있는 비휘발성 기록매체에 컴퓨터가 읽을 수 있는 코드의 형태로 구현되는 것이 가능하다. 이러한 비휘발성 기록매체로는 다양한 형태의 스토리지 장치가 존재하는데 예컨대 하드디스크, SSD, CD-ROM, NAS, 자기테이프, 웹디스크, 클라우드 디스크 등이 있다. 또한, 본 발명은 네트워크로 연결된 다 수의 스토리지 장치에 코드가 분산 저장되고 실행되는 형태로도 구현될 수 있다. 또한, 본 발명은 하드웨어와 결합되어 특정의 절차를 실행시키기 위하여 매체에 저장된 컴퓨터프로그램의 형태로 구현될 수도 있다."}
{"patent_id": "10-2022-0154047", "section": "도면", "subsection": "도면설명", "item": 1, "content": "[도 1]은 본 발명을 위한 키오스크 데이터 연합학습 시스템의 구성도. [도 2]는 본 발명에서 연합학습 서버의 초기화 과정 순서도. [도 3]은 신경망 모델의 일반적인 구성도. [도 4]는 본 발명에 따른 키오스크 데이터 연합학습 처리 프로세스의 순서도. [도 5]는 본 발명에 따른 키오스크 데이터 연합학습 처리 프로세스를 클라이언트-서버 모델로 나타낸 도면. [도 6]은 본 발명에서 연합학습 그룹 설정 과정의 처리 도면."}
