{"patent_id": "10-2022-0046323", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0147381", "출원번호": "10-2022-0046323", "발명의 명칭": "초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템", "출원인": "고려대학교 산학협력단", "발명자": "주영규"}}
{"patent_id": "10-2022-0046323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인장축을 회전시켜 강재 시편(21)을 잡아당기는 인장부(22);상기 인장부(22)가 상기 강재 시편(21)을 잡아당기는 시간 동안 초분광 이미지를 촬영하고, 촬영된 초분광 이미지를 분석부(25)로 전달하는 분광부(23);상기 인장부(22)가 상기 강재 시편(21)을 잡아당길 때 시간 흐름을 계산하고, 계산된 시간 흐름을 상기 분석부(25)에 제공하는 타이머(24); 및시간, 인장력을 변수로, 초분광 이미지를 배열하고, 이미지 레벨링을 수행하고, 시간, 인장력을 신경망의 노드로 할당하고, 노드값으로 레벨값을 신경망 연산하여 강도에 상응하는 값을 출력하는 분석부(25);를 포함하는 것을 특징으로 하는, 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템."}
{"patent_id": "10-2022-0046323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 분석부(25)는,강도별 강재 시편을 준비하는 단계(S101);상기 강재 시편을 잡아당기고, 초분광 카메라로 상기 강재 시편을 촬영하는 단계(S102);초분광 이미지 데이터를 수집하는 단계(S103);데이터 테이블을 구축하는 단계(S104);강재 초분광 촬영 분석하는 단계(S105); 및부재 강도를 평가하는 단계(S106);를 수행하는 것을 특징으로 하는, 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템."}
{"patent_id": "10-2022-0046323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 단계(S106)에서 분석부(25)는 강도값을 이용하여 시간 추이에 따른 강재 시편의 부재 강도를 평가하는 것을 특징으로 하는, 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템."}
{"patent_id": "10-2022-0046323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 분석부(25)는시간, 인장력을 변수로 초분광 이미지를 배열하는 단계;상기 초분광 이미지를 레벨링하는 단계(S107);시간, 인장력을 변수로 레벨값을 배열하는 단계;시간, 인장력을 노드로, 레벨값을 신경망 연산하는 단계(S108); 및신경망 연산된 강도에 상응하는 값을 출력하는 단계(S109);를 수행하는 것을 특징으로 하는, 초분광 카메라와머신러닝을 이용한 비접촉식 강재 강도 평가 시스템."}
{"patent_id": "10-2022-0046323", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2023-0147381-3-제4항에 있어서,상기 단계(S107)에서 상기 분석부(25)는,이미지 신경망을 이용하여 상기 초분광 이미지를 레벨링하고, 이미지 신경망에는 이미지 처리에 탁월한 성능을보이는 합성곱 신경망(Convolutional Neural Network)이 이용되는 것을 특징으로 하는, 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템."}
{"patent_id": "10-2022-0046323", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템에 관한 것으로, 보다 상세하게는 초분광 카메라로 촬영한 강재 시편의 초분광 이미지를 빅데이터 기반의 머신러닝을 이용하여 강도를 평가하는 초 분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템에 관한 것이다."}
{"patent_id": "10-2022-0046323", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템에 관한 것으로, 보다 상세하게 는 초분광 카메라로 촬영한 강재 시편의 초분광 이미지를 빅데이터 기반의 머신러닝을 이용하여 강도를 평가하 는 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템에 관한 것이다."}
{"patent_id": "10-2022-0046323", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 강재 강도 측정은 만능 시험기를 이용한 인장시험 방법을 사용한다. 이 측정기법은 인장강도의 항복 강도 시험을 위한 시편을 제작한 후 만능 시험기를 이용한 인장시험을 진행해 해당 강재의 인장강도와 항복강도 를 측정하는 기법이다. 그러나, 이러한 강재 강도측정 방식은 측정을 진행하는 강재에 손상이 가해지거나 사람이 다가가기 힘든 부분의 측정은 제한되는 등의 단점들이 존재하였다. 또한, 만능 시험기의 경우 시험기의 크기가 크고 무거워 장소의 제 한 역시 존재하였다. 이에 종래에 개시된 등록특허 제 10-0027027호에서, 강철의 레이저 발광 분광 분석방법을 사용하여 제선(製銑), 제강(製鋼) 공정에서의 용선(溶銑), 용강(溶鋼), 슬랙(slag)등의 강철중 불순물 원소를 직접 정량분석에 사용하 는데 가장 적합한 강철의 표면에 레이저 광을 조사(照射)하였을 때에 방출되는 광을 분광하고 강철속에 함유되 어 있는 각원소를 정량 분석하는 구성이 선 제시된 바 있지만, 제선, 제강 공정에서의 강재 강도 측정 방법에 국한되는 문제점이 따랐다. 따라서, 이러한 문제점을 해결할 수 있는 새로운 방법이 필요하게 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내등록특허 제0027027호 (등록일 1989.01.11.)"}
{"patent_id": "10-2022-0046323", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인장되는 강재 시편을 초분광 촬영하고, 촬영된 초분광 이미지를 이용하여 강재 시편의 강도를 측정 하는 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템을 제공하는 것을 목적으로 한다. 또한, 본 발명은 시간, 인장력을 변수로 배열되는 초분광 이미지의 분석에 신경망 연산을 적용하는 초분광 카메 라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템을 제공하는 것을 또 다른 목적으로 한다."}
{"patent_id": "10-2022-0046323", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 바람직한 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템은, 인장축을 회전시켜 강재 시편을 잡아당기는 인장부; 상기 인장부가 상기 강재 시편을 잡아당기는 시간 동안 초분 광 이미지를 촬영하고, 촬영된 초분광 이미지를 분석부로 전달하는 분광부; 상기 인장부가 상기 강 재 시편을 잡아 당길 때 시간 흐름을 계산하고, 계산된 시간 흐름을 상기 분석부에 제공하는 타이머 ; 및 시간, 인장력을 변수로, 초분광 이미지를 배열하고, 이미지 레벨링을 수행하고, 시간, 인장력을 신경망의 노드로 할당하고, 노드값으로 레벨값을 신경망 연산하여 강도에 상응하는 값을 출력하는 분석부;를 포 함하는 것을 특징으로 한다. 또한, 상기 분석부는, 강도별 강재 시편을 준비하는 단계(S101); 상기 강재 시편을 잡아당기고, 초분광 카 메라로 상기 강재 시편을 촬영하는 단계(S102); 초분광 이미지 데이터를 수집하는 단계(S103); 데이터 테이블을 구축하는 단계(S104); 강재 초분광 촬영 분석하는 단계(S105); 및 부재 강도를 평가하는 단계(S106);를 수행하 는 것을 특징으로 한다. 또한, 상기 단계(S106)에서 분석부는 강도값을 이용하여 시간 추이에 따른 강재 시편의 부재 강도를 평가하 는 것을 특징으로 한다. 또한, 상기 분석부는, 시간, 인장력을 변수로 초분광 이미지를 배열하는 단계; 상기 초분광 이미지를 레벨 링하는 단계(S107); 시간, 인장력을 변수로 레벨값을 배열하는 단계; 시간, 인장력을 노드로, 레벨값을 신경망 연산하는 단계(S108); 및 신경망 연산된 강도에 상응하는 값을 출력하는 단계(S109);를 수행하는 것을 특징으로 한다. 또한, 상기 단계(S107)에서 상기 분석부는, 이미지 신경망을 이용하여 상기 초분광 이미지를 레벨링하고, 이미지 신경망에는 이미지 처리에 탁월한 성능을 보이는 합성곱 신경망(Convolutional Neural Network)이 이용 되는 것을 특징으로 한다."}
{"patent_id": "10-2022-0046323", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 인장되는 강재 시편을 초분광 촬영하고, 촬영된 초분광 이미지를 이용하여 강재 시편의 강도를 측정 함으로써 초분광 이미지에 기반한 강재의 강도를 측정하는 효과를 가질 수 있다. 또한, 본 발명은 시간, 인장력을 변수로 배열되는 초분광 이미지의 분석에 신경망 연산을 적용함으로써 강재 강 도값의 신뢰도를 높이는 효과를 가질 수 있다."}
{"patent_id": "10-2022-0046323", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시 예에 따른 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템에 대하여 상세히 설명하기로 한다. 이하에서 종래 주지된 사항에 대한 설명은 본 발명의 요지를 명확히 하기 위해 생략하거나 간단히 한다. 본 발명의 설명에 포함된 구성은 개별 또는 복합 결합 구성되어 동작한다. 도 1은 본 발명 강재 시편, 인장부의 구성을 보인 예시도이고, 도 2는 본 발명 초분광 카메라와 머신러닝을 이 용한 비접촉식 강재 강도 평가 시스템의 구성을 보인 블록도이다. 도 1 내지 도 2를 참조하면, 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템은 강재 시편 , 인장부, 분광부, 타이머, 분석부를 포함한다. 강재 시편은 강도 측정 대상이고, 인 장부는 강재 시편을 잡아당기고, 분광부가 초분광 이미지를 촬영해서 강도를 측정하기 위한 사전 작업을 수행한다. 여기서 강재는 강구조 공학에서 사용되는 철로 이루어진 균질한 재료를 말하며, 강재의 종류 는 여러 가지가 있다. 탄소 함유량이 많아질수록 강도는 증가하지만, 취성이 증가한다. 후술할 제어부의 명령에 의해 인장부에서 구동모터를 구동하여 인장축을 회전시켜 강재 시편을 잡아 당기면, 제어부가 분광부에 촬영 명령을 내리고, 타이머의 시간 흐름을 읽어들인다. 분광부는 인장부가 강재 시편을 잡아당기는 시간 동안 초분광 이미지를 촬영하고, 촬영된 초분광 이미지를 분석부로 전달한다. 타이머는 인장부가 강재 시편을 잡아당길 때 시간 흐름을 계산하고, 계산된 시간 흐름을 분석부 에 제공한다. 분석부는 시간, 인장력을 변수로 초분광 이미지를 배열하고, 이미지 레벨링을 수행하며 시간, 인장력을 노 드로, 레벨값을 신경망 연산하여 강도에 상응하는 값을 출력한다. 도 3은 본 발명 강재 강도 평가 방법의 동작을 보인 흐름도로써, 도 3을 참조하면, 상기 분석부는 강도별 강재 시편을 준비하는 단계(S101); 강재 시편을 잡아당기고, 초분광 카메라로 강재 시편을 촬영하는 단계 (S102); 초분광 이미지 데이터를 수집하는 단계(S103); 데이터 테이블을 구축하는 단계(S104); 강재 초분광 촬 영 분석하는 단계(S105); 부재 강도를 평가하는 단계(S106);를 수행한다. 단계(S101)는 강도별 강재 시편을 준비하여 인장부에 강재 시편을 체결하고, 분석부에 강재 시편이 준 비됨을 알린다. 단계(S102)에서 제어부가 인장부에 명령하면, 인장부는 인장축을 회전시켜 강재 시편을 잡아당 긴다. 이후 제어부는 분광부에 촬영 명령하여 초분광 카메라로 강재 시편을 촬영한다. 위 과정 중 인장 부는 인장축에 결합된 로드셀에 인가되는 인장력을 측정하여 분석부로 전달한다. 분광부는 초분광 카메라가 기설정 시간, 인장력에 도달하였을 때, 초분광 이미지를 촬영하여 분석부로 전달한다. 단계(S103)에서 분광부가 초분광 이미지를 촬영하고, 촬영된 초분광 이미지를 분석부에 전달해서 분석 부가 초분광 이미지를 수집한다. 단계(S104)는 2차원 검출기에서 각 화소에 해당하는 스펙트럼 정보를 수집하여 초분광 이미지(Hyperspectral image) 큐브의 공간 및 스펙트럼 정보인 3차원 데이터 테이블을 형성한다. 이때 초분광 이미지의 각 픽셀은 픽 셀에 있는 물질을 식별하는데 사용되는 연속적인 스펙트럼을 모두 포함한다. 즉, 초분광 이미지(Hyperspectral image)는 두 개의 공간적 차원과 하나의 스펙트럼 크기로 구성된 3차원(x, y ,z)으로 나타낸다. x와 y는 초분광 영상(Hyperspectral image)의 공간적 2차원을 나타내고, z는 스펙트럼의 크기를 나타낸다. 2차원 검출기에서 각 화소에 해당하는 스펙트럼 정보를 수집하여 초분광 이미지(Hyperspectral image) 큐브의 공간 및 스펙트럼 정보 인 3차원 데이터를 형성한다. 단계(S105)는 분광부가 강재의 초분광 이미지를 촬영하고, 촬영된 초분광 이미지를 분석부에 전달해서 분석부가 초분광 이미지를 분석한다. 단계(S106)는 시간, 인장력을 변수로, 초분광 이미지를 배열하고, 이미지 레벨링을 수행하며 시간, 인장력을 신 경망의 노드로 할당하고, 노드값으로 레벨값을 신경망 연산하여 강도에 상응하는 값을 출력하고, 부재 강도를 평가한다. 단계(S106)에서 분석부는 강도값을 이용하여 시간 추이에 따른 강재 시편의 부재 강도를 평가한 다. 도 4는 본 발명 강재 강도 평가 방법의 동작을 보인 예시도로서, 도 4를 참조하면, 분석부는 시간, 인장력 을 변수로 초분광 이미지를 배열하는 단계(도 4a); 초분광 이미지를 레벨링하는 단계(S107)(도 4b); 시간, 인장 력을 변수로 레벨값을 배열하는 단계(도 4c); 시간, 인장력을 노드로, 레벨값을 신경망 연산하는 단계(S108)(도 4d); 신경망 연산된 강도에 상응하는 값을 출력하는 단계(S109) (도 4e);를 수행한다. 보다 자세하게는, 단계(도 4a)에서 분석부는 시간을 x축, 인장력을 y축 변수로 분광부에서 촬영된 초분 광 이미지를 배열한다. 단계(S107)(도 4b)에서 분석부는 이미지 신경망을 이용하여 초분광 이미지를 레벨링한다. 이미지 신경망에 는 이미지 처리에 탁월한 성능을 보이는 합성곱 신경망(Convolutional Neural Network)이 이용될 수 있다. 단계(도 4c)에서 분석부는 시간을 x축, 인장력을 y축 변수로 단계(S107)에서 처리된 레벨값을 배열한다. 단계(S108)(도 4d)에서 분석부는 시간, 인장력을 신경망의 노드로 할당하고, 레벨값을 노드값으로 부여해서 신경망 연산한다. 단계(S109)(도 4e)에서 분석부는 단계(S108)에서 신경망 연산된 강도에 상응하는 값을 출력한다. 강도값, 시간, 인장력, 레벨값의 신경망 연산에는 회귀분석, 선형 판별 분석(LDA), 로지스틱 회귀(LR), 지원 벡 터 머신(SVM), 결정 트리(DT), k-최근접 이웃(KNN), 랜덤 포레스트(RF)가 이용될 수 있다. 회귀분석은 관찰된 연속형 변수들에 대해 두 변수 사이의 모형을 구한 뒤 적합도를 측정해 내는 분석 방법으로, 시간에 따라 변화하는 데이터나 어떤 영향, 가설적 실험, 인과 관계의 모델링등을 이용한다. 선형 판별 분석(LDA)는 새로운 입력 세트가 각 클래스에 속할 확률을 추정하여 예측한다. 가장 높은 확률을 얻 는 클래스가 출력 클래스이며 예측이 수행된다. 로지스틱 회귀(LR)는 두 가지 가능한 분류 문제에 대한 확률이 다. 지원 벡터 머신(SVM)은 예제를 두 개의 클래스로 가장 잘 분할하는 초평면 결정 경계를 찾는다. 분할은 일부 포 인트가 잘못 분류될 수 있는 여백을 사용하여 부드럽게 만들어진다. 결정 트리(DT)에는 훈련 데이터 세트의 예 를 분류하기 위해 트리를 성장시키는 작업이 포함된다. 트리는 훈련 데이터 세트를 나누는 것으로 생각할 수 있 다. 여기서, 예제는 트리의 결정 지점을 따라 진행되어 트리의 잎에 도달하고 클래스 레이블이 할당된다. k-최 근접 이웃(KNN)은 사용 가능한 모든 데이터를 저장하고 유사성을 기반으로 새로운 데이터 포인트를 분류한다. 즉, 새로운 데이터가 나타날 때 k-최근접 이웃(KNN)을 사용하여 웰 스위트 범주로 쉽게 분류할 수 있다. 마지막 으로 랜덤 포레스트(RF)는 최종 출력을 위한 많은 의사결정나무로 구성되며, 그 과정에 참여하는 의사결정나무 의 수가 많기 때문에 매우 정확하고 강력한 방법으로 간주된다. 도 5는 초분광 이미지를 보인 예시도이다. 이 경우, x축은 빛의 파장대역, y축은 광원의 반사율을 의미하며 생 성된 그래프의 모양을 통해 물질의 초분광 카메라 촬영 단계(S102)에서 인식된 고유 스펙트럼을 표현한다. 이때, 그래프의 모양이 유사하여도 y축 값에 해당하는 반사율의 값이 극명히 차이나는 경우 다른 물질로 인식하 게 된다. 도 6은 본 발명을 설명하기 위한 하드웨어 자원과 운영체제, 코어인 제어부의 동작, 제어부 동작을 실 행할 권한을 부여하는 시스템 인증 구성을 설명하는 예시도로서, 도 6을 참조하면, 본 발명은 프로세서, 메 모리, 입출력장치, 운영체제, 제어부를 포함한다. 프로세서는 CPU(Central Processing Units), GPU(Graphic Processing Unit), FPGA(Field Programmable Gate Array), NPU(Neural Processing Unit)로서, 메모리에 탑재된 운영체제, 제어부의 실행 코드를 수행한다. 메모리는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device)를 포함할 수 있다. 입출력장치는 입력 장치로, 오디오 센서 및/또는 이미지 센서를 포함한 카메라, 키보드, 마이크로폰, 마우스 등의 장치를, 그리고 출력 장치로, 디스플레이, 스피커, 햅틱 피드백 디바이스(haptic feedback device) 등과 같은 장치를 포함할 수 있다. 운영체제는 윈도우, 리눅스, IOS, 가상 머신, 웹브라우저, 인터프리터를 포함할 수 있고, 태스크, 쓰레드, 타이머 실행, 스케줄링, 자원 관리, 그래픽, 폰트 처리, 통신 등을 지원한다. 제어부는 운영체제의 지원하에 입출력장치의 센서, 키, 터치, 마우스 입력에 의한 상태를 결정하고, 결정된 상태에 따른 동작을 수행한다. 제어부는 병렬 수행 루틴으로 타이머, 쓰레드에 의한 작업 스케줄링을 수행한다. 제어부는 입출력장치의 센서값을 이용하여 상태를 결정하고, 결정된 상태에 따른 알고리즘을 수행한다. 보다 상세하게는, 도 6을 참조하면, 시스템 인증 구성은 제어부를 포함하는 단말기, 인증 서버를 포함 한다. 단말기는 데이터 채널을 이중화하고, 단말기의 키값, 생체 정보를 입력받아 인증 서버에 제1데이터 채 널을 통해 사용자 인증을 요청하고, 단말기는 생성된 키값을 디스플레이에 표시하고, 인증 서버로 전송한 다. 단말기는 단말기의 디스플레이에 표시된 키값을 제2데이터 채널에 입력하고, 입력된 키값을 사용자 정보 와 함께 제2데이터 채널을 통하여 인증 서버로 전송한다. 단말기는 키값과 사용자 정보를 이용하여 단말 기에 탑재된 시스템의 인증을 인증 서버에 요청한다. 단말기의 키값은 컴퓨터 고유의 정보인 CPU 제조번호, 이더넷 칩의 맥주소로부터 생성될 수 있다. 단말기는 카메라를 이용한 얼굴 인식, 마이크를 이용한 음 성 인식, 디스플레이를 이용한 필기 인식을 통해 사용자 정보를 획득하고, 인증에 활용할 수 있다. 인증 서버는 단말기로부터 키값을 수신하고, 단말기로부터 이중화된 데이터 채널을 통해 키값과 사용 자 정보를 수신하여 단말기의 키값과 사용자 정보를 비교하고, 사용자 정보를 대응시켜 단말기의 시스템 이용에 대한 인증을 처리한다. 인증 서버는 인증 결과를 단말기로 전송하여 시스템에 대한 사용자의 사용 을 허가한다. 단말기의 이중화된 데이터 채널로 인해 키값 손실이 최소화되는 효과를 가질 수 있다. 인증 서버는 사용자 정보의 히스토리 분석을 수행하고, 시간 흐름에 따라 사용자 정보의 일관성, 변화를 비 교 판단한다. 히스토리 분석에서 사용자 정보가 일관성을 나타내면 사용자의 사용을 허가하고, 변화를 나타내면 사용자의 사용을 허가하지 않는다. 사용자 정보가 일관성을 나타낼 때 사용자의 시스템 사용을 허가함으로써 사 용자 정보가 변조된 사용자가 시스템에 접근하지 못하도록 보안을 강화한다. 시스템의 사용을 인증하는 수단인 단말기는 시스템과 직접 연결하지 않고, 인증 서버를 통한 우회 경로를 형성함으로써 인터넷망을 이루는 네트워크가 내부망과 외부망으로 구성되어 아이피 주소 설정 과정이 번거로울 때 단말기를 이용한 인증 과정이 원활히 수행되는 장점이 있다. 이때, 단말기에는 시스템이 탑재되고, 단 말기는 인증 단말 수단이 되고, 인증 서버는 인증 서버 수단이 된다. 클라우드는 프로세서, 메모리, 입출력장치, 통신부를 관리하는 운영체제의 지원 하에 컨테 이너의 모듈화로, 웹, DB, 프로토콜, 라이브러리의 서비스를 제공하며, 제어부는 컨테이 너의 서비스를 이용한 클라우드 애플리케이션을 실행한다. 컨테이너라고 하는 표준 소프트웨어 패키지 는 애플리케이션의 코드를 관련 구성파일, 라이브러리 및 앱 실행에 필요한 종속성과 함께 번들로 제공한다. 클라우드는 다수의 단말기를 통합 제어하고, 단말기로부터 수신된 센서값을 저장하여 시간의 흐름에 따라 모니터링하고, 단말기의 동작 에러를 처리하고, 에러 메시지를 다른 단말기로 알리고, 제어 대상인 단말기를 스위칭 제어한다. 신경망 학습은 온도, 고도, 지문 등 각종 센서, 이미지, 적외선 등 카메라, 라이더와 같은 입력 장치로부터 수 집된 시계열 데이터로부터 특징량 선택, 알고리즘 선택을 통해 모델을 선택하고, 학습, 성능 검증 과정에 의한 반복 시행착오를 거쳐 모델 선택을 반복한다. 성능 검증을 마치면 인공지능 모델이 선택된다. 제어부는 센서값 판단에 신경망을 이용한 딥러닝 알고리즘을 수행하고, 신경망 학습에 훈련 데이터를 이용하 고, 시험 데이터로 신경망 성능을 검증한다. 본 발명은 상술한 특정의 바람직한 실시 예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗 어남이 없이 해당 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형실시가 가능한 것은 물론이고, 그와 같은 변경은 청구범위 기재의 범위 내에 있게 된다."}
{"patent_id": "10-2022-0046323", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명 강재 시편, 인장부의 구성을 보인 예시도이다. 도 2는 본 발명 초분광 카메라와 머신러닝을 이용한 비접촉식 강재 강도 평가 시스템의 구성을 보인 블록도이다. 도 3은 본 발명 강재 강도 평가 방법의 동작을 보인 흐름도이다. 도 4는 본 발명 강재 강도 평가 방법의 동작을 보인 예시도이다. 도 5는 초분광 이미지를 보인 예시도이다. 도 6은 본 발명을 설명하기 위한 하드웨어 자원과 운영체제, 코어인 제어부의 동작, 제어부 동작을 실행할 권한 을 부여하는 시스템 인증 구성을 설명하는 예시도이다."}
