{"patent_id": "10-2021-7036994", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0006070", "출원번호": "10-2021-7036994", "발명의 명칭": "심장 리듬 분석을 위한　인공 지능 모델의 개인화", "출원인": "메드트로닉 인코포레이티드", "발명자": "차크라바르시, 니란잔"}}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 시스템으로서,현재 환자에 대한 심장 전기도 (EGM) 스트립을 저장하도록 구성된 저장 매체; 및처리 회로를 포함하되, 상기 처리회로는, 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 신경망 (CRC)을 적용하는 것으로서,상기 제1 CRC는 복수의 환자를 포함하는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련되고, 상기 제1CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제1 데이터를 생성하는,상기 적용하고; 입력으로서 상기 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용하는 것으로서, 상기 제2 CRC는 제1 집단보다 작은 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된 제1 CRC의 버전이고, 상기 제2 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성하는, 상기 적용하고; 그리고 상기 제1 데이터 및 제2 데이터에 기반하여 출력 데이터를 생성하도록 구성된, 컴퓨팅 시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제2 집단이 현재 환자로 이루어지는, 컴퓨팅 시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 제2 집단이 현재 환자와 하나 이상의 특성을 공유하는 환자들의 코호트인, 컴퓨팅시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 하나 이상의 특성이 현재 환자 및 환자들의 코호트의 진단을 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항 또는 제4항에 있어서,상기 처리 회로가 입력으로서 상기 심장 EGM 스트립을 갖는 제3 CRC를 적용하도록 추가로 구성되며, 여기서 상기 제3 CRC가 상기 제1 집단으로부터의 심장 EGM 스트립 훈련에 기반하여 훈련되고 현재 환자로부터의 심장EGM 스트립 훈련만을 기반으로 추가로 훈련된 제1 CRC의 버전이고, 상기 제3 CRC가 상기 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제3 데이터를 생성하며,상기 처리 회로가 상기 출력 데이터를 생성하는 것의 일부로서, 상기 처리 회로가 상기 제1 데이터, 제2데이터, 및 제3 데이터에 기반하여 출력 데이터를 생성하도록 구성되는, 컴퓨팅 시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 현재 환자의 심장 리듬의 양태가 상기 현재 환자의 심장 리듬에서 심장 부정맥의 발생의 발생이고,상기 제1 데이터가 상기 심장 EGM 스트립의 세그먼트가 심장 부정맥의 하나 이상의 발생을 나타낼 제1 확률에공개특허 10-2022-0006070-3-기반하며,상기 제2 데이터가 상기 심장 EGM 스트립의 세그먼트가 심장 부정맥의 1회 이상의 발생을 나타낼 제2 확률에 기반하는, 컴퓨팅 시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 현재 환자의 심장 리듬의 양태가 상기 현재 환자의 심장 리듬에서 발생하는 심장 부정맥의 발생의 형태학적 양태이며,상기 제1 데이터가 상기 심장 EGM 스트립의 세그먼트에서 나타난 심장 부정맥의 발생의 형태학적 양태에 관한제1 데이터를 포함하고,상기 제2 데이터가 상기 심장 EGM 스트립의 세그먼트에서 나타난 심장 부정맥의 발생의 형태학적 양태에 관한제2 데이터를 포함하고,상기 출력 데이터가 상기 발생의 형태학적 양태에 관한 제1 데이터 및 상기 발생의 형태학적 양태에 관한 제2데이터를 비교하는 데이터를 포함하는, 컴퓨팅 시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 상기 처리 회로가,상기 현재 환자로부터의 초기 심장 EGM 스트립에 기반하여 제2 CRC에 의해 생성된 이력 데이터에 대한 제2 데이터의 비교에 기반하여 제2 출력 데이터를 생성하도록 추가로 구성되는, 컴퓨팅 시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 제1 CRC가 출력 벡터를 생성하고,상기 컴퓨팅 시스템이 상기 제2 집단으로부터의 심장 EGM 스트립에만 기반하여 제1 CRC의 인스턴스를 훈련함으로써 제2 CRC를 생성하도록 추가로 구성되되, 상기 처리 회로가 제2 CRC를 생성하는 것의 일부로서, 제2 집단으로부터의 각각의 각자의 심장 EGM 스트립의 각각의 각자의 세그먼트에 대해:상기 제1 CRC를 상기 각자의 심장 EGM 스트립의 각자의 세그먼트에 적용하여, 각자의 심장 EGM 스트립에 대한제1 출력 벡터를 생성하고;상기 제2 CRC를 상기 각자의 심장 EGM 스트립의 각자의 세그먼트에 적용하여, 각자의 심장 EGM 스트립에 대한제2 출력 벡터를 생성하고;상기 각자의 심장 EGM 스트립의 각자의 세그먼트에 대한 제2 출력 벡터가 상기 각자의 심장 EGM 스트립에 대한제1 출력 벡터보다 더 정확한지 여부를 결정하고;상기 심장 EGM 스트립에 대한 제2 출력 벡터가 상기 각자의 심장 EGM 스트립에 대한 제1 출력 벡터보다 더 정확한지 여부에 기반하여 제2 CRC의 파라미터를 업데이트하도록 구성되되, 여기서 상기 처리 회로가 상기 심장 EGM 스트립에 대한 제2 출력 벡터가 상기 각자의 심장 EGM 스트립에 대한 제1 출력 벡터보다 더 정확할 때 제2 CRC의 파라미터를 업데이트하도록 구성되고, 상기 처리 회로가 상기 심장 EGM 스트립에 대한 제2 출력 벡터가 상기 각자의 심장 EGM 스트립에 대한 제1 출력 벡터보다 더 정확하지 않을 때 제2 CRC의 파라미터를 업데이트하지 않도록 구성되는, 컴퓨팅 시스템."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "실행될 때 컴퓨팅 시스템으로 하여금, 현재 환자에 대한 심장 전기도 (EGM) 스트립을 수득하게 하고;공개특허 10-2022-0006070-4-입력으로서 상기 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 신경망 (CRC)을 적용하게 하는 것으로서, 여기서 상기 제1 CRC가 복수의 환자를 포함하는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련되고, 상기 제1 CRC가 심장 EGM 스트립의 세그먼트에 기반하여, 상기 현재 환자의 심장 리듬의 양태에 관한 제1데이터를 생성하는, 상기 적용하게 하고;입력으로서 상기 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용하게 하는 것으로서, 여기서 상기 제2 CRC가 상기 제1 집단보다 작은 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된 제1 CRC의 버전이고, 상기 제2 CRC가 심장 EGM 스트립의 세그먼트에 기반하여, 상기 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성하는, 상기 적용하게 하고; 및 상기 제1 데이터 및 제2 데이터에 기반하여 출력 데이터를 생성하게 하는 명령을 저장하고 있는, 컴퓨터-판독가능 데이터 저장 매체."}
{"patent_id": "10-2021-7036994", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "방법으로서,컴퓨팅 시스템에 의해, 현재 환자에 대한 심장 전기도 (EGM) 스트립을 수득하는 단계;상기 컴퓨팅 시스템에 의해, 입력으로서 상기 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 신경망(CRC)을 적용하는 단계이되, 여기서 상기 제1 CRC가 복수의 환자를 포함하는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련되고, 상기 제1 CRC가 상기 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제1 데이터를 생성하는, 단계;상기 컴퓨팅 시스템에 의해, 입력으로서 상기 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용하는단계이되, 여기서 상기 제2 CRC가 상기 제1 집단보다 작은 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된 제1 CRC의 버전이고, 상기 제2 CRC가 상기 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성하는, 단계; 및상기 컴퓨팅 시스템에 의해, 상기 제1 데이터 및 제2 데이터에 기반하여 출력 데이터를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7036994", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "심장 부정맥의 발생에 대해 환자를 모니터링하기 위한 기술이 개시된다. 컴퓨팅 시스템은 현재 환자에 대한 심장 전기도 (EGM) 스트립을 수득한다. 추가적으로, 컴퓨팅 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 (CRC)를 적용할 수 있다. 제1 CRC는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈 련된다. 제1 CRC는 현재 환자의 심장 리듬의 양태에 관한 제1 데이터를 생성한다. 컴퓨팅 시스템은 또한 입력으 로서 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용할 수 있다. 제2 CRC는 더 작은 제2 집단으로부터의 심 장 EGM 스트립 훈련에 대해 훈련된다. 제2 CRC는 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성한다. 컴퓨팅 시스템은 제1 및/또는 제2 데이터에 기반하여 출력 데이터를 생성할 수 있다."}
{"patent_id": "10-2021-7036994", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시내용은 일반적으로 건강 모니터링에 관한 것이고, 보다 구체적으로 심장 건강을 모니터링하는 것에 관한 것이다."}
{"patent_id": "10-2021-7036994", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "악성 빈맥성 부정맥, 예를 들어, 심실 세동은 심장에서 심실의 심근의 조정되지 않는 수축이며, 심정지 환자에 서 가장 일반적으로 식별된 부정맥이다. 이러한 부정맥이 몇 초 초과로 계속되면, 심장성 쇼크 및 효과적인 혈 액 순환의 중단이 발생될 수 있다. 결과적으로, 급성 심장사(SCD)는 몇 분만에 발생될 수 있다. 이식된 또는 비-이식된 의료 장치는 심장 부정맥에 대해 환자의 심장을 모니터링할 수 있다. 사용자, 예컨대, 의사는 심장 부정맥, 예컨대, 심방 또는 심실 빈맥성 부정맥, 또는 부전수축의 발생에 대해 의료 장치에 의해 생성된 데이터를 검토할 수 있다. 사용자는 심장 부정맥의 발생에 기반하여 환자의 의료 병태를 진단할 수 있다."}
{"patent_id": "10-2021-7036994", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "요약 일반적으로 개시내용은 환자의 심장 리듬을 분석하는 인공 지능 (AI) 모델을 개인화하거나 환자 코호트를 위한 AI 모델을 전문화하기 위한 기술을 설명한다. 본 개시내용에서 설명된 바와 같이, 컴퓨팅 시스템은 심장 전기도 (EGM) 스트립, 예컨대, 현재 환자에 대한 일정 기간 동안의 심장 EGM 파형 값의 시퀀스를 나타내는 데이터를 수 득할 수 있다. 추가적으로, 컴퓨팅 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분 류기 (CRC)를 적용할 수 있다. 제1 CRC는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된다. 제1 CRC 는 현재 환자의 심장 리듬의 양태에 관한 제1 데이터를 생성한다. 컴퓨팅 시스템은 또한 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용할 수 있다. 제2 CRC는 더 작은 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된다. 제2 CRC는 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성한다. 컴퓨팅 시스템 은 제1 및/또는 제2 데이터에 기반하여 출력 데이터를 생성할 수 있다. 일 양태에서, 본 개시내용은 다음을 포함하는 방법을 설명한다: 컴퓨팅 시스템에 의해, 현재 환자에 대한 심 장 전기도 (EGM) 스트립을 수득하는 단계; 컴퓨팅 시스템에 의해, 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 신경망 (CRC)을 적용하는 단계이되, 여기서 제1 CRC는 복수의 환자를 포함하는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련되고, 제1 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제1 데이터를 생성하는, 단계; 컴퓨팅 시스템에 의해, 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용하는 단계이되, 여기서 제2 CRC는 제1 집단보다 작은 제2 집단으 로부터의 심장 EGM 스트립 훈련에 대해 훈련된 제1 CRC의 버전이고, 제2 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성하는, 단계; 및 컴퓨팅 시스템에 의해, 제1 데이터 및 제2 데이터에 기반하여 출력 데이터를 생성하는 단계. 다른 양태에서, 본 개시내용은 다음을 포함하는 방법을 설명한다: 컴퓨팅 시스템에 의해, 현재 환자에 대한 심장 EGM 스트립을 수득하는 단계; 컴퓨팅 시스템에 의해, 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 전 문화된 심장 리듬 분류기 (CRC)를 적용하는 단계이되, 여기서 전문화된 CRC는 현재 환자로부터의 심장 EGM 스 트립 훈련에 대해 훈련되었고, 전문화된 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리 듬의 양태에 관한 제1 데이터를 생성하는, 단계; 컴퓨팅 시스템에 의해, 현재 환자로부터의 초기 심장 EGM 스 트립에 기반하여 전문화된 CRC에 의해 생성된 이력 데이터 및 제1 데이터에 기반하여 출력 데이터를 생성하는 단계. 다른 양태에서, 본 개시내용은 처리 회로 및 저장 매체를 포함하는 컴퓨팅 시스템을 설명하고, 컴퓨팅 장치는 이러한 방법을 수행하도록 구성된다. 다른 양태에서, 본 개시내용은 실행될 때 컴퓨팅 시스템으로 하여금 이러 한 방법을 수행하게 하는 명령을 저장하고 있는 컴퓨터-판독가능 데이터 저장 매체를 설명한다. 다른 양태에서, 본 개시내용은 다음을 포함하는 컴퓨팅 시스템을 설명한다: 현재 환자에 대한 심장 전기도 (EGM) 스트립을 저장하도록 구성된 저장 매체; 및 처리 회로를 포함하되, 상기 처리 회로는, 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 신경망 (CRC)을 적용하는 것으로서, 여기서 제1 CRC는 복 수의 환자를 포함하는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련되고, 제1 CRC는 심장 EGM 스트립 의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제1 데이터를 생성하는, 상기 제1 심장 리듬 분 류기 신경망 (CRC)을 적용하고; 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용하는 것으로서, 여기서 제2 CRC는 제1 집단보다 작은 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된 제1 CRC의 버전 이고, 제2 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성하는, 상기 제2 CRC를 적용하고; 그리고 제1 데이터 및 제2 데이터에 기반하여 출력 데이터를 생성하도록 구성된다. 다른 양태에서, 본 개시내용은 실행될 때 컴퓨팅 시스템으로 하여금, 현재 환자에 대한 심장 전기도 (EGM) 스트 립을 수득하게 하고; 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 신경망 (CRC)을 적 용하게 하는 것이되, 여기서 제1 CRC는 복수의 환자를 포함하는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대 해 훈련되고, 제1 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제1 데 이터를 생성하는, 상기 제1 심장 리듬 분류기 신경망 (CRC)을 적용하게 하고; 입력으로서 심장 EGM 스트립의 세 그먼트를 갖는 제2 CRC를 적용하게 하는 것이되, 여기서 제2 CRC는 제1 집단보다 작은 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된 제1 CRC의 버전이고, 제2 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성하는, 상기 제2 CRC를 적용하게 하고; 그리고 제1 데이터 및 제2 데이터에 기반하여 출력 데이터를 생성하게 하는 명령을 저장하고 있는 컴퓨터-판독가능 데이터 저장 매체"}
{"patent_id": "10-2021-7036994", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "를 설명한다. 본 요약은 본 개시내용에 기재된 주제의 개요를 제공하려는 것이다. 첨부한 도면 및 이하의 설명 내에서 상 세히 설명된 장치 및 방법에 대한 배타적이거나 완전한 설명을 제공하도록 의도된 것은 아니다. 하나 이상의 예 들의 추가적인 세부사항은 첨부한 도면 및 이하의 설명에 제시된다."}
{"patent_id": "10-2021-7036994", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 개시내용의 기술에 따라 환자 의 심장 리듬의 하나 이상의 양태를 분석하기 위한 시스템 을 예 시하는 블록도이다. 시스템 은 의료 장치 를 포함한다. 이러한 의료 장치의 일 예는 도 1에 도시된 바와 같이 이식형 의료 장치 (IMD)이다. 도 1의 예시적인 시스템 에 의해 예시된 바와 같이, 의료 장치 는, 일부 예에서, 예를 들어, 이식형 심장 모니터, 이식형 심장 박동조율기, 이식형 심장율동전환기/제세동 기 (ICD), 또는 박동조율기/심장율동전환기/제세동기일 수 있다. 일부 예에서, 의료 장치 는 비-이식형 의 료 장치, 예컨대, 비-이식형 심장 모니터 (예컨대, 홀터 모니터)이다. 도 1의 예에서, 의료 장치 는 리드 (18, 20 및 22)에 연결되고 외부 장치 에 통신가능하게 커플링되어, 결과적으로 통신 네트워크 를 통해 컴퓨팅 시스템 에 통신가능하게 커플링된다. 의료 장치 는 하나 이상의 리드 (18, 20 및 22) 또는 의료 장치 의 하우징 상의 전극을 통해 심장 의 탈분극 및 재분극에 수반되는 전기적 신호, 예컨대, 심장 전기도 (EGM)를 감지한다. 의료 장치 는 또한 하나 이상의 리드 (18, 20 및 22) 또는 의료 장치 의 하우징에 위치된 전극을 통해 심장 에 대한 전기적 신호의 형태로 요법을 전달할 수 있다. 요법은 박동조율, 심장율동전환 및/또는 제세동 펄스일 수 있다. 의료 장치 는 리드 (18, 20 또는 22) 상의 전극에 의해 수집된 심장 EGM 신호를 모니터링하고, 심장 EGM 신호에 기반하여 심장 부정맥을 진단 및 치료할 수 있다. 일부 예에서, 의료 장치 는 다른 장치, 예컨대, 도 1의 외부 장치 와 통신하기 위해 임의의 적합한 회 로, 펌웨어, 소프트웨어, 또는 이들의 임의의 조합을 포함하는 통신 회로 를 포함한다. 예를 들어, 통신 회 로 는 다른 장치, 예컨대, 컴퓨팅 시스템 과의 라디오 주파수 통신을 위해 하나 이상의 프로세서, 메모 리, 무선 라디오, 안테나, 송신기, 수신기, 변조 및 복조 회로, 필터, 또는 증폭기 등을 포함할 수 있다. 의료 장치 는 의료 장치 의 하나 이상의 동작을 제어하기 위해 다운링크된 데이터를 수신하고/하거나 업링크된 데이터를 외부 장치 로 전송하기 위한 통신 회로 를 사용할 수 있다. 리드 (18, 20, 22)는 환자 의 심장 으로 연장되어, 심장 의 전기적 활동을 감지하고/하거나 심장 에 전기적 자극을 전달한다. 도 1에 도시된 예에서, 우심실 (RV) 리드 는 하나 이상의 정맥 (미도시), 상대정맥 (미도시), 및 우심방 을 통해 우심실 로 연장된다. 좌심실 (LV) 리드 는 하나 이상의 정 맥, 대정맥, 우심방 을 통해 심장 의 좌심실 의 자유 벽에 인접한 영역까지 관상정맥동 으로 연장된다. 우심방 (RA) 리드 는 하나 이상의 정맥 및 대정맥을 통해 심장 의 우심방 으로 연장된다. 도 1의 예시적인 시스템 은 의료 장치 를 나타내고 있지만, 다른 예에서, 개시내용의 기술은 반드시 이 식 가능하지는 않은 다른 유형의 의료 장치에 적용될 수 있다. 예를 들어, 개시내용의 기술에 따른 의료 장치는 환자 가 착용하는 웨어러블 의료 장치 또는 \"스마트\" 의류를 포함할 수 있다. 예를 들어, 이러한 의료 장치 는 환자 가 착용하는 손목 시계 또는 환자 에 접착식으로 부착되는 회로의 형태를 취할 수 있다. 다른 예에서, 본원에 기재된 바와 같은 의료 장치는 이식형 전극을 갖는 외부 의료 장치를 포함할 수 있다. 일부 예에서, 외부 장치 는 외부 프로그래머 또는 모바일 장치, 예컨대, 휴대폰, \"스마트\" 폰, 랩톱, 태블 릿 컴퓨터, 개인 정보 단말기 (PDA) 등의 형태를 취할 수 있다. 일부 예에서, 외부 장치 는 Medtronic, Inc.로부터 이용가능한 CareLink™ 모니터이다. 사용자, 예컨대, 의사, 기술자, 외과의사, 전기-생리학자, 또는 기타 임상의는 의료 장치 로부터 생리학적 또는 진단 정보를 취출하기 위해 외부 장치 와 상호작용할 수 있다. 사용자, 예컨대, 상기 기재된 바와 같은 환자 또는 임상의는 또한 외부 장치 와 상호작용하 여, 의료 장치 를 프로그래밍할 수 있으며, 예컨대, 의료 장치 의 동작 파라미터에 대한 값을 선택하거 나 조정할 수 있다. 외부 장치 는 의료 장치 및 컴퓨팅 시스템 의 각각에 대한 정보 및 이로부터 의 정보를 송수신할 수 있는, 처리 회로, 메모리, 사용자 인터페이스 및 통신 회로를 포함할 수 있다. 일부 예에서, 컴퓨팅 시스템 은 핸드헬드 컴퓨팅 장치, 컴퓨터 워크스테이션, 서버 또는 다른 네트워크화된 컴퓨팅 장치, 스마트폰, 태블릿, 또는 사용자에게 정보를 제시하고 사용자로부터 입력을 수신하기 위한 사용자 인터페이스를 포함하는 외부 프로그래머의 형태를 취한다. 일부 예에서, 컴퓨팅 시스템 은 기계 학습 시스 템, 예컨대, 신경망, 심층 학습(deep learning) 시스템, 또는 다른 유형의 기계 학습 시스템을 구현하는 하나 이상의 장치를 포함할 수 있다. 사용자, 예컨대, 의사, 기술자, 외과의, 전기-생리학자, 또는 기타 임상의는 의 료 장치 로부터 생리학적 또는 진단 정보를 취출하기 위해 컴퓨팅 시스템 과 상호작용할 수 있다. 사용 자는 또한 컴퓨팅 시스템 과 상호작용하여, 의료 장치 를 프로그래밍할 수 있으며, 예컨대, IMD의 동작 파라미터에 대한 값을 선택할 수 있다. 컴퓨팅 시스템 은 심장 EGM (또는 이들의 세그먼트) 및/또는 의료 장치 로부터 컴퓨팅 시스템 으로 송신된 다른 감지된 신호를 평가하도록 구성된 프로세서를 포함할 수 있다. 네트워크 는 하나 이상의 컴퓨팅 장치 (미도시), 예컨대, 하나 이상의 비-엣지 스위치, 라우터, 허브, 게이 트웨이, 보안 장치, 예컨대, 방화벽, 침입 검출 및/또는 침입 방지 장치, 서버, 컴퓨터 단말기, 랩톱, 프린터, 데이터베이스, 무선 모바일 장치, 예컨대, 휴대폰 또는 개인 정보 단말기, 무선 액세스 포인트, 브리지, 케이블 모뎀, 애플리케이션 가속기, 또는 다른 네트워크 장치를 포함할 수 있다. 네트워크 는 서비스 제공자에 의 해 관리되는 하나 이상의 네트워크를 포함할 수 있으며, 이에 따라 대-규모 공용 네트워크 인프라, 예컨대, 인 터넷의 일부를 형성할 수 있다. 네트워크 는 컴퓨팅 장치, 예컨대, 컴퓨팅 시스템 및 의료 장치 에 인터넷에 대한 액세스를 제공할 수 있으며, 컴퓨팅 장치가 서로 통신 가능하게 하는 통신 프레임워크를 제공 할 수 있다. 일부 예에서, 네트워크 는 컴퓨팅 시스템 , 의료 장치 및 EMR 데이터베이스 가 서로 통신 가능하게 하나, 컴퓨팅 시스템 , 의료 장치 및 EMR 데이터베이스 를 보안 목적을 위해 외부 장치로부터 분리시키는 통신 프레임워크를 제공하는 사설 네트워크일 수 있다. 일부 예에서, 컴퓨팅 시스 템 , 의료 장치 및 EMR 데이터베이스 사이의 통신은 암호화된다. 외부 장치 및 컴퓨팅 시스템 은 당업계에 알려진 임의의 기술을 사용하여 네트워크 를 통해 무선 또는 비-무선 통신을 통해쳐 통신할 수 있다. 일부 예에서, 컴퓨팅 시스템 은 네트워크 에 위치된 중 개 장치, 예컨대, 로컬 액세스 포인트, 무선 라우터, 또는 게이트웨이를 통해 외부 장치 와 통신하는 원격 장치이다. 도 1의 예에서 외부 장치 및 컴퓨팅 시스템 은 네트워크 를 통해 통신하지만, 일부 예 에서, 외부 장치 및 컴퓨팅 시스템 은 서로 직접 통신한다. 통신 기술의 예로는 예를 들어, Bluetooth ® 또는 BLE 프로토콜에 따른 통신을 포함할 수 있다. 기타 통신 기술이 또한 고려된다. 컴퓨팅 시스템 은 또한 다수의 알려진 유선 및 무선 통신 기술 둘 모두를 사용하여 하나 이상의 기타 외부 장치와 통신할 수있다. EMR 데이터베이스 는 환자 에 대한 EMR 데이터를 저장한다. EMR 데이터베이스 는 처리 회로 및 하 나 이상의 저장 매체 (예컨대, 랜덤 액세스 메모리 (RAM), 리드 온리 메모리 (ROM), 프로그래머블 리드 온리 메 모리 (PROM), 소거식 프로그래머블 리드 온리 메모리 (EPROM), 전자 소거식 프로그래머블 리드 온리 메모리 (EEPROM), 또는 플래시 메모리)를 포함할 수 있다. 일부 예에서, EMR 데이터베이스 는 클라우드 컴퓨팅 시 스템이다. 일부 예에서, EMR 데이터베이스 의 기능은 다수의 컴퓨팅 시스템에 걸쳐 분산된다. 일 예에서, 컴퓨팅 시스템 은 환자 의 의료 장치 에 의해 수집된 환자 데이터를 수신한다. 일부 예 에서, 환자 데이터는 환자 에 대한 생리학적 데이터, 예컨대, 환자 의 활동 수준, 환자 의 심박수, 환자 의 자세, 환자 의 심장 전기도, 환자 의 혈압, 환자 의 맥박 전달 시간, 환자 의 호 흡수, 환자 의 저호흡 지수 또는 무호흡, 환자 의 가속도계 데이터, 환자 의 가속도계 데이터로부 터 유래된 특징, 예컨대, 활동 횟수(count), 자세, 통계적 제어 프로세스 변수 등, 환자 의 원시 근전도, 환자 의 원시 근전도 또는 심장 EGM으로부터 유래된 하나 이상의 특징, 예컨대, 심박수 변동성, t-파 교대 성, QRS 형태학 등, 간격 데이터 및 간격 데이터로부터 유래된 특징, 심장 소리, 포타슘 수준, 혈당 지수, 환자 의 온도, 또는 전술된 파라미터 데이터로부터 유래가능한 임의의 데이터 중 하나 이상, 또는 임의의 다른 유형의 환자 파라미터 데이터를 포함한다. 일부 예에서, 의료 장치 또는 다른 장치는 하나 이상의 센서로 부터 정보를 처리함으로써 환자 파라미터 데이터를 자동으로 생성할 수 있다. 예를 들어, 의료 장치 는, 하 나 이상의 센서를 통해, 환자 가 쓰러졌거나, 환자 가 허약하거나 질병에 고통받거나, 환자 가 수 면 무호흡의 사례로 고통받는 지를 결정할 수 있다. 일부 예에서, 환자 데이터는 환경 데이터, 예컨대, 대기질 측정치, 오존 수준, 미립자 카운트, 또는 환자 에 근접한 오염 수준, 주변 온도, 또는 일광 시간을 포함한다. 일부 예에서, 의료 장치 또는 외부 장치 중 하나는 하나 이상의 센서를 통해 환경 데이터를 감지할 수 있다. 다른 예에서, 환경 데이터는 애플리케이션, 예컨대, 기상 애플리케이션을 통해 외부 장치 에 의해 수신되고, 외부 장치 에서 실행되고, 네트워크 를 통해 컴퓨팅 시스템 에 업로드된다. 다른 예에서, 컴퓨팅 시스템 은 환자 에 대한 위치-기 반 데이터를 갖는 클라우드 서비스로부터 직접 환경 데이터를 수집한다. 일부 예에서, 환자 데이터는 외부 장치, 예컨대, 외부 장치 를 통해 환자 에 의해 업로드되는 환자 증 상 데이터를 포함한다. 예를 들어, 환자 는 스마트 폰에서 실행되는 애플리케이션을 통해 환자 증상 데이 터를 업로드할 수 있다. 일부 예에서, 환자 는 사용자 인터페이스 (도 1에 미도시)를 통해, 예컨대, 터치 스크린, 키보드, 그래픽 사용자 인터페이스, 음성 명령 등에 의해 환자 증상 데이터를 업로드할 수 있다. 일부 예에서, 환자 데이터는 장치-관련된 데이터, 예컨대, 의료 장치의 하나 이상의 전극의 임피던스, 전극의 선택, 의료 장치에 대한 약물 전달 일정, 환자에 전달된 전기 박동조율 요법의 이력, 또는 의료 장치에 대한 진 단적 데이터 중 하나 이상을 포함한다. 일부 예에서, 환자 데이터를 수집하는 의료 장치는 IMD이다. 다른 예에 서, 환자 데이터를 수집하는 의료 장치는 다른 유형의 환자 장치, 예컨대, 웨어러블 의료 장치 또는 환자 의 모바일 장치 (예컨대, 스마트폰)이다. 일부 예에서, 컴퓨팅 시스템 은 주기적으로, 예컨대, 매일 기준 으로 환자 데이터를 수신한다. 일부 예에서, 컴퓨팅 시스템 은 EMR 데이터베이스 로부터 환자 에 대한 EMR 데이터를 추가로 수신 한다. EMR 데이터는 다른 형태의 환자 데이터로 간주될 수 있다. 일부 예에서, EMR 데이터베이스 에 의해 저장된 EMR 데이터는 환자 에 대한 많은 상이한 유형의 과거 의료 정보를 포함할 수 있다. 예를 들어, EMR 데이터베이스 는 예시로 환자의 의약 이력, 환자의 외과 시술 이력, 환자의 입원 이력, 시간 경과에 따른 환자의 포타슘 수준, 환자 에 대한 하나 이상의 실험실 테스트 결과, 환자 의 심혈관 이력, 또는 환자 의 동반 질환, 예컨대, 심방 세동, 심부전, 또는 당뇨병을 저장할 수 있다. 컴퓨팅 시스템 은 만성 심장 질환의 관리를 도울 수 있는 심장 EGM 모니터링 시스템을 구현할 수 있다. 심 장 EGM 모니터링 시스템을 구현하기 위해, 컴퓨팅 시스템 은 인공 지능 (AI) 기술을 적용하여 환자 데이터, 예컨대, 심장 EGM 데이터를 분석할 수 있다. AI 기술의 예는 심층 학습 또는 기타 기계 학습 기술을 포함할 수 있다. 신경망 알고리즘은 심층 학습 알고리즘의 일 예이다. 의료 장치 , 외부 장치 , 또는 컴퓨팅 시스템 에 의해 적용된 AI 기술은 환자 의 심장 리듬의 하나 이상의 양태에 관한 데이터를 생성할 수 있다. 예를 들어, AI 기술은 하나 이상의 의료 장치, 예컨대, 의 료 장치 로부터 수득된 심장 EGM 스트립에 적어도 부분적으로 기반하여 심장 부정맥의 발생을 식별할 수 있다. 심장 EGM 스트립은 연속 기간 (예컨대, 30초, 45초 등)에서 환자의 심장 리듬을 나타내는 데이터를 포함한 다. 심장 EGM 스트립은 심장 리듬의 파형을 나타내는 일련의 샘플을 포함할 수 있다. 사용자 (예컨대, 기술자, 의사, 환자, 헬스케어 전문가 또는 기타 유형의 사용자)는 진단 목적으로 또는 환자 의 지속적인 치유를 수 행하는 일부로서 심장 부정맥의 검출된 발생을 검토할 수 있다. 심장 EGM 스트립 외에도, AI 기술은 심장 부정 맥의 발생을 검출하기 위해 하나 이상의 다른 유형의 데이터, 예컨대, 환자 의 전자 의료 기록으로부터의 정보를 사용할 수 있다. 심장 EGM 스트립 처리로부터 추출된 메트릭스에 적용된 신호 처리 기술 및 휴리스틱은 심장 부정맥을 검출하고 EGM 데이터 기록을 트리거하는 등의 다른 목적을 위해, 이전에는 저전력 설정으로 구현되었다. AI 알고리즘은 이러한 이전에-구현된 기술을 보완하거나 대신 사용될 수 있다. 유리하게는, AI 알고리즘을 사용할 때, 심장 부 정맥의 발생 또는 환자 의 심장 리듬의 다른 양태를 식별하기 위해 특징 및 신호 처리 기술을 수동으로 조 작할 필요가 없을 수 있다. 오히려, AI 알고리즘은 집단 데이터로부터 학습하는 능력을 가질 수 있고 집단에서 심장 질환이 어떻게 나타나는지에 대한 대표적인 모델이 될 수 있다. AI 알고리즘은 (예컨대, 강화 학습, 잔여 학습 및 전이 학습 등과 같은 전략을 구현함으로써) 시간이 지남에 따라 개선될 수 있다. AI 알고리즘은 환자 의 심장 리듬의 이러한 양태를 식별하도록 훈련된 심장 리듬 분류 모델을 적용함으로써 주어진 심장 EGM 스트립에서 관심이 있는 환자 의 심장 리듬의 하나 이상의 양태를 식별하도록 훈련될 수 있다. 환자 의 심장 리듬의 양태는 다양한 심장 부정맥, 부정맥의 발생 시간을 반영하는 하나 이상의 심장 EGM 스트립 내의 이러한 심장 부정맥의 위치, 및 심장 부정맥 발생의 형태학적 양태 등을 포함할 수 있다. 심장 리듬 분류 모델은 대상체 집단으로부터 이끌어낸 EGM 스트립 및 일부 예에서, 다른 데이터에 대해 훈련될 수 있 다. 본 개시내용은 심장 리듬 분류 모델을 개인화하기 위한 기술을 설명한다. 예를 들어, 본 개시내용은 더 작은 환 자 코호트에 대한 심장 리듬 분류 모델을 훈련하기 위한 기술을 설명한다. 본 개시내용은 또한 개별 환자에 대 한 심장 리듬 분류 모델을 훈련하기 위한 기술을 설명한다. 심장 리듬 분류 모델을 개인화하는 것은 사용자가 더 대표적인 집단의 맥락에서 또는 환자 의 이전 이력과 관련하여 환자 의 심장 EGM 기록을 분석하는 것을 가능하게 할 수 있다. 이는 사용자가 해당 개별 환자에 대해 보다 적용가능한 결정을 내리는 것을 가능하 게 할 수 있다. 본 개시내용의 다른 곳에서 상세하게 설명된 바와 같이, 이러한 기술은 의료 장치 및/또는 외부 장치 의 전력 소비 및/또는 대역폭 활용을 저감하는 데 사용될 수 있다. 따라서, 본 개시내용의 일 예에서, AI 시스템은 환자 (즉, 현재 환자)에 대한 심장 EGM 스트립을 수득할 수 있다. AI 시스템은 메모리 및 하나 이상의 처리 회로를 포함하는 컴퓨팅 시스템이다. 도 1의 상황에서, AI 시스템은 의료 장치 , 컴퓨팅 시스템 , 외부 장치 , 또는 다른 장치 또는 장치의 시스템일 수 있다. 따라서, 본 개시내용에서, AI 시스템에 의해 수행된 작업의 설명은 달리 지시되지 않는 한, 이러한 장치 중 임의의 것에 의해 수행된 작업에 적용될 수 있다. 추가적으로, AI 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 (CRC)를 적용 할 수 있다. CRC는 신경망 또는 다른 유형의 심층 학습 기술로서 구현될 수 있는 심장 리듬 분류 모델의 예이다. 심장 EGM 스트립의 세그먼트는 모든 심장 EGM 스트립 또는 심장 EGM 스트립의 하위 세그먼트를 포함할 수 있다. 일부 예에서, CRC에 대한 입력은 심장 EGM 스트립의 세그먼트 이외의 데이터, 예컨대, EMR 데이터베이 스 의 데이터를 포함한다. 제1 CRC는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된다. 제1 집단은 복수의 환자를 포함한다. 일 부 예에서, 제1 집단은 심장 EGM 데이터가 컴퓨팅 시스템 또는 이의 하위집단에 의해 모니터링되는 모든 환자를 포함한다. 컴퓨팅 시스템 이 글로벌 또는 지역적 모니터링 시스템을 구현하는 일부 경우에, 제1 집 단은 수천 또는 수백만의 환자를 포함할 수 있다. 제1 CRC는 이러한 집단을 사용하여 훈련되기 때문에, 본 개시 내용은 제1 CRC를 일반화된 CRC로서 지칭할 수 있다. 심장 EGM 스트립에 기반한 CRC 훈련은 심장 EGM 스트립의 세그먼트에 기반한 CRC 훈련에 적용할 수 있다. AI 시스템이 심장 EGM 스트립의 세그먼트에 제1 CRC를 적용하는 경우, 제1 CRC는 심장 EGM 스트립의 세그먼트 에 기반하여, 환자 의 심장 리듬의 양태에 관한 제1 데이터를 생성한다. 예를 들어, 제1 CRC는 입력 레이어, 출력 레이어, 및 입력 레이어와 출력 레이어 사이에 하나 이상의 은닉 레이어를 갖는 신경망으로서 구 현될 수 있다. 입력 레이어는 심장 EGM 스트립의 세그먼트의 각각의 샘플 값에 대한 입력 뉴런을 포함할 수 있 다. 출력 레이어는 하나 이상의 심장 부정맥의 세트에서 각각의 심장 부정맥에 상응하는 출력 뉴런을 포함할 수 있다. AI 시스템이 심장 EGM 스트립의 세그먼트에 제1 CRC를 적용하는 경우, 입력 뉴런은 세그먼트로부터 샘플값을 수신하고, 은닉 레이어는 샘플 값을 처리하고, 출력 뉴런은 세그먼트가 상응하는 심장 부정맥의 발생을 나 타내는지 여부를 나타내는 값을 출력할 수 있다. 더욱이, 이 예에서, AI 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용할 수 있다. 제 2 CRC는 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된 제1 CRC의 버전이다. 제2 집단은 제1 집단보 다 작다. 예를 들어, 일부 예에서, 제2 집단은 환자 로만 이루어질 수 있다. 다른 예에서, 제2 집단은 환자 와 하나 이상의 특성을 공유하는 환자의 코호트일 수 있다. 이러한 특성은 진단 또는 절차 코드, 이식된 의 료 장치, 연령, 성별, 담배 사용, 동반질환, 성별 및 크기 등을 포함할 수 있다. 일부 예에서, 제1 집단은 제2 집단을 포함한다. 다른 예에서, 제1 집단은 제2 집단을 포함하지 않는다. 제2 CRC는 제1 집단보다 더 작은 집단 을 사용하여 훈련되기 때문에, 본 개시내용은 제2 CRC를 전문화된 CRC로서 지칭할 수 있다. AI 시스템이 심장 EGM 스트립의 세그먼트에 전문화된 CRC를 적용하는 경우, 전문화된 CRC는 심장 EGM 스트립의 세그먼트에 기반 하여, 심장 리듬 유형의 양태에 관한 제2 데이터를 생성한다. 상이한 훈련 데이터를 사용하여 훈련하는 것 외에, 전문화된 CRC는 일반화된 CRC와 동일한 방식으로 구현될 수 있다. 예를 들어, 일반화된 CRC 및 전문화된 CRC가 신경망으로서 구현되는 예에서, 일반화된 CRC 및 전문화된 CRC는 뉴런의 동일한 개수 및 배열을 가질 수 있다. 그러나, 이 예에서, 일반화된 CRC 및 전문화된 CRC의 신경 망의 파라미터 (예컨대, 뉴런에 대한 입력의 가중치, 바이어스 값 등)가 상이할 수 있다. 다른 예에서, 전문화 된 CRC는 일반화된 CRC와 상이한 방식으로 구현될 수 있다. 예를 들어, 전문화된 CRC는 일반화된 CRC보다 더 많 거나 더 적은 레이어, 뉴런 등을 포함할 수 있다. AI 시스템은 제1 데이터 및/또는 제2 데이터에 기반하여 출력 데이터를 생성할 수 있다. AI 시스템은 다양한 방 식 중 하나 이상으로 출력 데이터를 생성할 수 있다. 예를 들어, AI 시스템은 그래프, 차트, 목록, 표, 또는 사 용자 (예컨대, 환자, 의사, 건강 모니터링 기술자, 가족 구성원 등)가 환자 의 심장 리듬의 하나 이상의 양 태에 관한 하나 이상의 유형의 데이터를 검토 및/또는 비교하는 것을 가능하게 하는 데이터의 기타 배열의 형태 로 출력 데이터를 생성할 수 있다. 예를 들어, 제1 데이터가 심장 EGM 스트립의 세그먼트가 심장 부정맥의 발생 을 나타내는지 여부의 표시를 포함하고, 제2 데이터가 심장 EGM 스트립의 세그먼트가 심장 부정맥의 발생을 나 타내는지 여부의 표시를 포함하는 이러한 일 예에서, AI 시스템은 일반화된 CRC에 의해 식별된 심장 부정맥의 발생 횟수 및 전문화된 CRC에 의해 식별된 심장 부정맥의 발생 횟수를 비교하는 막대 차트를 생성하기 위해 이 러한 표시를 수집 및 처리할 수 있다. AI 시스템이 의료 장치 에 구현되는 일부 예에서, 일반화된 CRC가 심장 EGM 스트립의 세그먼트가 심장 부정 맥의 발생을 나타내는 것으로 결정할 때 의료 장치 는 심장 EGM 스트립을 외부 장치 에 전송할 수 있다. 일부 예에서, 이어서, 외부 장치 는 심장 EGM 스트립을 네트워크 를 통해 컴퓨팅 시스템 으 로 전송할 수 있다. 따라서, 심장 EGM 스트립은 컴퓨팅 시스템 , 외부 장치 , 및/또는 이의 사용자에 의한 검토 및 추가 처리에 이용 가능할 수 있다. 그러나, 일반화된 CRC가 제1 집단을 기반으로 훈련되고 환자 에 대해 구체적으로 훈련되지 않았기 때문에, 일반화된 CRC는 전문화된 CRC와 비교하여 환자 로부터의 심장 EGM 스트립의 세그먼트에서 심장 부정맥의 발생을 과소-식별할 수 있다. 따라서, 의료 장치 가 일반화 된 CRC만을 적용하는 경우, 의료 장치 는, 심장 EGM 스트립이 잠재적으로 심장 부정맥의 발생을 나타낼 수 있음에도 불구하고 심장 EGM 스트립을 외부 장치로 전송하지 않을 수 있다. 그러나, 이 예에서, 전문화된 CRC를 적용함으로써 의료 장치 는 심장 부정맥의 발생을 나타낼 수 있는 추가적인 심장 EGM 스트립을 식별 할 수 있다. 그런 다음, 의료 장치 는 추가적인 심장 EGM 스트립을 외부 장치 에 전송할 수 있다. 이 프로세스는 의료 장치 에서 전력을 보존할 수 있고 외부 장치 및/또는 컴퓨팅 시스템 이 일반화된 CRC에 의해 식별되지 않은 심장 부정맥의 발생을 나타내는 심장 EGM 스트립에 액세스하기 위해 모든 심장 EGM 스트립을 송신할 필요성을 제거할 수 있기 때문에 네트워크 대역폭을 보존할 수 있다. AI 시스템이 외부 장치 에 의해 구현되고 외부 장치 가 심장 EGM 스트립을 컴퓨팅 시스템 으로 송신하는 예에서 유사한 고 려사항이 적용될 수 있다. AI 시스템이 의료 장치 에서 구현되는 일부 예에서, 일반화된 CRC는 전문화된 CRC와 비교하여 환자 로 부터의 심장 EGM 스트립의 세그먼트에서 심장 부정맥의 발생을 과대-식별할 수 있다. 따라서, 이러한 일 예에서, 의료 장치 는, 하나의 구성에서, 일반화된 CRC 및 전문화된 CRC 둘 모두가 심장 EGM 스트립이 심장 부정맥의 발생을 나타내는 것으로 결정할 때에만 심장 EGM 스트립을 외부 장치 로 송신할 수 있다. 이는 의 료 장치 에 의해 송신된 데이터의 양을 저감시킬 수 있어, 전력을 보존하고 대역폭 소비를 저감시킬 수 있 다. AI 시스템이 외부 장치 에 의해 구현되고 외부 장치 가 심장 EGM 스트립을 컴퓨팅 시스템 으로송신하는 예에서 유사한 고려사항이 적용될 수 있다. 더욱이, 일부 예에서, AI 시스템은 의료 장치 및 외부 장치 에서 구현된다. 예를 들어, 이 예에서, 의 료 장치 는 일반화된 CRC를 구현할 수 있다. 이 예에서, 의료 장치 는 심장 부정맥의 발생을 나타내기 위해 일반화된 CRC에 의해 결정된 심장 EGM 스트립을 외부 장치 로 송신할 수 있다. 더욱이, 이 예에서, 외 부 장치 는 의료 장치 로부터 수신된 심장 EGM 스트립에 전문화된 CRC를 적용할 수 있다. 이 예에서, 외부 장치 는 일부 모드에서 심장 부정맥의 발생을 나타내기 위해 전문화된 CRC에 의해 결정되는 수신된 심 장 EGM 스트립 중 하나를 컴퓨팅 시스템 에 송신할 수 있다. 이는 네트워크 를 통해 컴퓨팅 시스템 으로 심장 EGM 스트립을 송신하는 것과 연관된 대역폭 소비를 저감시킬 수 있다. 도 2는 도 1의 시스템 의 의료 장치 및 리드 (18, 20, 22)를 더 상세하게 예시한 개념도이다. 예시된 예에서, 쌍극 전극 (40 및 42)은 리드 의 원위 단부에 인접하게 위치되고, 쌍극 전극 (48 및 50)은 리드 의 원위 단부에 인접하게 위치된다. 또한, 4개의 전극 (44, 45, 46 및 47)은 리드 의 원위 단부에 인접 하게 위치된다. 리드 는 사분극 LV 리드로 지칭될 수 있다. 다른 예에서, 리드 는 더 많거나 더 적은 전극을 포함할 수 있다. 일부 예에서, LV 리드 는, 예컨대, 리드의 복수의 종방향 전극 위치, 예컨대, 전극 (44, 45, 46 및 47)의 위치의 각각이 리드의 원주 주위의 각자의 원주 위치에 배열된 복수의 이산 전극을 포함 하는, 세그먼트화된 전극을 포함한다. 예시된 예에서, 전극 (40 및 44-48)은 링 전극의 형태를 취하고, 전극 (42 및 50)은 각자 절연 전극 헤드 (53 및 56) 내에 신축 가능하게 장착된 연장가능한 나선 팁 전극의 형태를 취할 수 있다. 리드 (18 및 22)는 또한 각자 코일 형태를 취할 수 있는 세장형 전극 (62 및 64)을 포함한다. 일부 예에서, 전극 (40, 42, 44-48, 50, 62 및 64)의 각각은 연관된 리드 (18, 20, 22)의 리드 바디 내의 각자의 전도체에 전기적으로 커플링되어, 의료 장치 내의 회로에 커플링된다. 일부 예에서, 의료 장치 는 하나 이상의 하우징 전극, 예컨대, 도 2에 예시된 하우징 전극 을 포함하며, 이는 의료 장치 의 밀폐하여-밀봉된 하우징 의 외면과 일체로 형성되거나 이와 달리 하우징 에 커플 링될 수 있다. 일부 예에서, 하우징 전극 은 의료 장치 의 하우징 의 외향 부분의 비절연 부분에 의 해 정의된다. 하우징 의 절연 부분과 비절연 부분 사이의 다른 분할은 2개 이상의 하우징 전극을 정의하기 위해 이용될 수 있다. 일부 예에서, 하우징 전극은 실질적으로 모든 하우징 을 포함한다. 하우징 은 치료적 자극, 예컨대, 심장 박동조율, 심장율동전환, 및 제세동 펄스를 생성하는 신호 생성 회로 뿐만 아니라, 심장 의 탈분극 및 재분극에 수반되는 전기적 신호를 감지하기 위한 감지 회로를 수용한다. 하우징 은 또한 감지된 전기적 신호를 저장하기 위한 메모리를 수용할 수 있다. 하우징 은 또한 의료 장 치 와 컴퓨팅 시스템 사이의 통신을 위한 통신 회로 를 수용할 수 있다. 의료 장치 는 전극 (4, 40, 42, 44-48, 50, 62 및 64)을 통해 심장 의 탈분극 및 재분극에 수반되는 전기적 신호를 감지한다. 의료 장치 는 전극 (40, 42, 44-48, 50, 62 및 64)의 임의의 쌍극 조합을 통해 이 러한 전기적 신호를 감지할 수 있다. 더욱이, 전극 (40, 42, 44-48, 50, 62 및 64) 중 임의의 것은 하우징 전극 과 조합하여 단극 감지에 사용될 수 있다. 리드 (18, 20 및 22) 및 전극의 예시된 개수 및 구성은 단지 예시일 뿐이다. 기타 구성, 즉, 리드 및 전극의 수 및 위치가 가능하다. 일부 예에서, 시스템 은 환자 에 대해 요법을 감지 및/또는 전달하기 위해 심혈관 시스템의 상이한 위치에 배치된 하나 이상의 전극을 갖는 추가적인 리드 또는 리드 세그먼트를 포함할 수 있다. 예를 들어, 심장간(intercardiac) 리드 (18, 20 및 22) 대신에 또는 이에 더하여, 시스템 은 심장 내 에 배치되지 않는 하나 이상의 심외막 또는 혈관외 (예컨대, 피하 또는 흉골하) 리드를 포함할 수 있다. 의료 장치 는 환자 데이터를 (예컨대, 외부 장치 를 통해) 컴퓨팅 시스템 으로 전송할 수 있다. 환 자 데이터는 전극 (4, 40, 42, 44-48, 50, 62 및/또는 64)에 의해 검출된 전기적 신호에 기반한 데이터를 포함 할 수 있다. 예를 들어, 의료 장치 는 심장 EGM 데이터를 모아 컴퓨팅 시스템 으로 전송할 수 있다. 본 개시내용의 기술에 따르면, 컴퓨팅 시스템 은 환자 가 하나 이상의 심장 부정맥의 발생을 경험한 확률 을 나타내는 확률 값을 결정하기 위해 환자 데이터를 사용할 수 있다. 치료적 전기적 자극을 제공하는 예시적인 의료 장치 의 상황에서 본원에 설명되었지만, 본원에 개시된 기술 은 다른 유형의 장치와 함께 사용될 수 있다. 예를 들어, 기술은 심혈관 시스템 외부의 전극에 커플링된 심장- 외 제세동기, 심장 내 이식용으로 구성된 카테터경유 박동조율기, 예컨대, 아일랜드 더블린의 Medtronic PLC로 부터 상업적으로 이용가능한 MicraTM 카테터경유 박동조율 시스템, 삽입형 심장 모니터, 예컨대, Medtronic PLC로부터 또한 상업적으로 이용가능한 Reveal LINQTM ICM, 신경자극기, 약물 전달 장치, 웨어러블 장치, 예컨대, 웨어러블 심장율동전환기 제세동기, 피트니스 트래커, 또는 모바일 장치인 기타 웨어러블 장치, 예컨대, 휴대폰, \"스마트\" 폰, 랩톱, 태블릿 컴퓨터, 개인 정보 단말기 (PDA), 또는 \"스마트\" 의류, 예컨대, \"스마트\" 안경 또는 \"스마트\" 시계로 구현될 수 있다. 도 3은 개시내용의 기술에 따른 예시적인 의료 장치 의 블록도이다. 예시된 예에서, 의료 장치 는 처리 회로 , 메모리 , 통신 회로 , 감지 회로 , 요법 전달 회로 , 센서 , 및 전원 을 포함한다. 메모리 는 처리 회로 에 의해 실행될 때, 의료 장치 및 처리 회로 로 하여금, (예 컨대, 심장 부정맥의 단기 예측을 수행하는, 요법, 예컨대, 항-빈맥 박동조율, 서맥 박동조율 및 충격-후 박동 조율 요법 등을 전달하는) 본원의 의료 장치 및 처리 회로 에 기인한 다양한 기능을 수행하게 하는 컴 퓨터-판독가능 명령을 포함한다. 메모리 는 임의의 휘발성, 비-휘발성, 자기, 광학 또는 전기 매체, 예컨대, 랜덤 액세스 메모리 (RAM), 리드-온리 메모리 (ROM), 비-휘발성 RAM (NVRAM), 전기-소거식 프로그래머 블 ROM (EEPROM), 플래시 메모리, 또는 임의의 다른 디지털 또는 아날로그 매체를 포함할 수 있다. 처리 회로 는 마이크로프로세서, 제어기, 디지털 신호 프로세서 (DSP), 주문형 집적 회로 (ASIC), 필드-프 로그래머블 게이트 어레이 (FPGA), 또는 등가 이산 또는 아날로그 논리 회로 중 임의의 하나 이상을 포함할 수 있다. 일부 예에서, 처리 회로 는 다중 구성요소, 예컨대, 하나 이상의 마이크로프로세서, 하나 이상의 제 어기, 하나 이상의 DSP, 하나 이상의 ASIC, 또는 하나 이상의 FPGA뿐만 아니라 다른 이산 또는 통합형 논리 회 로의 임의의 조합을 포함할 수 있다. 본원에서 처리 회로 에 기인한 기능은 소프트웨어, 펌웨어, 하드웨어 또는 이들의 임의의 조합으로서 유형화될 수 있다. 처리 회로 는 메모리 에 저장될 수 있는 요법 파라미터에 따라 심장 에 자극 요법을 전달하기 위해 요법 전달 회로 를 제어한다. 예를 들어, 처리 회로 는 요법 파라미터에 의해 명시된 진폭, 펄스 폭, 주파수, 또는 전극 극성을 갖는 전기 펄스를 전달하기 위해 요법 전달 회로 를 제어할 수 있다. 이러한 방 식으로, 요법 전달 회로 는 전극 (34 및 40)을 통해 심장 에 박동조율 펄스 (예컨대, ATP 펄스, 서맥 박 동조율 펄스 또는 충격-후 박동조율 요법)를 전달할 수 있다. 일부 예에서, 요법 전달 회로 는 전압 또는 전류 전기 펄스의 형태로 박동조율 자극, 예컨대, ATP 요법, 서맥 요법 또는 충격-후 박동조율 요법을 전달할 수 있다. 다른 예에서, 요법 전달 회로 는 기타 신호, 예컨대, 사인파, 구형파 또는 기타 실질적으로 지속 시간 신호의 형태로 이러한 유형의 자극 중 하나 이상을 전달할 수 있다. 요법 전달 회로 는 의료 장치 의 하우징 상에 지지된 전극 (34 및 40)에 전기적으로 커플링된다. 의료 장치 는 2개의 전극, 예컨대, 전극 (34 및 40)만을 포함할 수 있지만, 다른 예에서 의료 장치 는 3개 이상의 전극을 활용할 수 있다. 의료 장치 는 요법을 전달하고/하거나 환자 로부터의 전기적 신호를 검 출하기 위해 임의의 전극 조합을 사용할 수 있다. 일부 예에서, 요법 전달 회로 는 충전 회로, 하나 이상의 펄스 발생기, 커패시터, 변압기, 스위칭 모듈, 및/또는 박동조율 요법, 심장 재동기화 요법, 기타 요법 또는 요 법의 조합으로서 전달하기 위해 에너지를 생성 및/또는 저장할 수 있는 기타 구성요소를 포함한다. 일부 예에서, 요법 전달 회로 는 요법의 진폭, 주파수, 전압 또는 전류, 또는 요법의 기타 파라미터를 정의하는 하나 이상의 요법 파라미터 세트에 따라 하나 이상의 전기 펄스로서 요법을 전달한다. 감지 회로 는 심장 의 전기적 활동, 임피던스, 또는 기타 전기적 현상을 모니터링하기 위해 전극 (4, 40, 42, 44-48, 50, 62 (도 2) 및 64 (도 2)) 중에서 2개 이상의 전극의 하나 이상의 조합 (벡터로서 또한 지 칭됨)으로부터 신호를 모니터링한다. 일부 예에서, 감지 회로 는 하나 이상의 아날로그 구성요소, 디지털 구성요소 또는 이들의 조합을 포함한다. 일부 예에서, 감지 회로 는 하나 이상의 감지 증폭기, 비교기, 필 터, 정류기, 임계치 검출기 또는 아날로그-디지털 변환기 (ADC) 등을 포함한다. 일부 예에서, 감지 회로 는 감지된 신호를 디지털 형태로 변환하고, 처리 또는 분석을 위해 처리 회로 에 디지털 신호를 제공한다. 일 예에서, 감지 회로 는 전극 (4, 40, 42, 44-48, 50, 62 및 64)으로부터의 신호를 증폭하고, 증폭된 신호를 ADC에 의해 다중-비트 디지털 신호로 변환한다. 일부 예에서, 감지 회로 는 심장 전기도의 감지를 수행하여, 심박수 또는 심박수 변동성을 결정하거나, 부 정맥 (예컨대, 빈맥성 부정맥 또는 서맥)을 검출하거나, 심장 전기도로부터 기타 파라미터 또는 이벤트를 감지 한다. 감지 회로 는, 전류 감지 구성에서 사용되는 전극 조합 또는 전극 벡터에 따라, 심장 활동을 감지하 는 데 이용가능한 전극 (및 전극 극성) 중 어느 것이 사용될지를 선택하기 위한 스위칭 회로를 또한 포함할 수 있다. 처리 회로 는 감지 전극 및 이들의 극성으로서 기능하는 전극을 선택하기 위해 스위칭 회로를 제어할 수 있다. 감지 회로 는 하나 이상의 검출 채널을 포함할 수 있으며, 이들 각각은 해당 전극 구성을 통해 심장 신호를 검출하기 위해 선택된 전극 구성에 커플링될 수 있다. 일부 예에서, 감지 회로 는 처리된 신호를 임계치와 비교하여, 심방 또는 심실 탈분극의 존재를 검출하고, 심방 탈분극 (예컨대, P-파) 또는 심실 탈분극 (예컨대, R-파)의 존재를 처리 회로 에 나타낸다. 감지 회로 는 조정 가능할 수 있는 임계치와 심장 전 기도 진폭의 비교를 위해 하나 이상의 증폭기 또는 기타 회로를 포함할 수 있다. 처리 회로 는 하드웨어, 펌웨어, 소프트웨어 또는 이들의 임의의 조합으로서 형상화될 수 있는 타이밍 및 제어 모듈을 포함할 수 있다. 타이밍 및 제어 모듈은 기타 처리 회로 구성요소, 예컨대, 마이크로프로세서 로부터 분리된 전용 하드웨어 회로, 예컨대, ASIC, 또는 마이크로프로세서 또는 ASIC일 수 있는 처리 회로 (5 8)의 구성요소에 의해 실행되는 소프트웨어 모듈을 포함할 수 있다. 타이밍 및 제어 모듈은 프로그래머블 카운 터를 구현할 수 있다. 의료 장치 가 서맥 박동조율 펄스를 생성하여 심장 에 전달하도록 구성된 경우, 이러한 카운터는 DDD, VVI, DVI, VDD, AAI, DDI, DDDR, VVIR, DVIR, VDDR, AAIR, DDIR, 및 기타 박동조율 모드 와 연관된 기본 시간 간격을 제어할 수 있다. 일부 예에서, 의료 장치 의 처리 회로 는 AI 시스템 을 구현한다. 예를 들어, 처리 회로 는 본 개시내용의 다른 곳에서 설명된 바와 같이, 일반화된 CRC 및/또는 전문화된 CRC를 심장 EGM 스트립에 적용할 수 있다. 처리 회로 는 특수-목적 회로를 사용하거나 컴퓨터-판독가능 매체, 예컨대, 메모리 에 저장된 소프트웨어 명령을 실행함으로써 AI 시스템 을 구현할 수 있다. 감지 회로 는 전극 (4, 40, 42, 44- 48, 50, 62 및 64)으로부터 수신된 데이터에 기반하여 심장 EGM 스트립을 생성할 수 있다. 통신 회로 는 심 장 EGM 스트립 및/또는 기타 데이터를 외부 장치 로 송신할 수 있다. 메모리 는 다양한 동작 파라미터, 요법 파라미터, 감지된 및 검출된 데이터, 및 환자 의 요법 및 치료 와 관련된 임의의 다른 정보를 저장하도록 구성될 수 있다. 도 3의 예에서, 메모리 는 예컨대, 검출된 또는 예측된 부정맥과 연관된 감지된 심장 EGM, 및 요법 전달 회로 에 의해 제공된 요법의 전달을 정의하는 요법 파라미터를 저장할 수 있다. 다른 예에서, 메모리 는 컴퓨팅 시스템 에 업로드될 수 있을 때까지 데이 터를 저장하기 위한 임시 버퍼로서 작용할 수 있다. 통신 회로 는 도 1의 네트워크 를 통해 다른 장치, 예컨대, 컴퓨팅 시스템 과 통신하기 위해 임의 의 적합한 회로, 펌웨어, 소프트웨어 또는 이들의 임의의 조합을 포함한다. 예를 들어, 통신 회로 는 네트 워크 를 통해 기타 장치, 예컨대, 컴퓨팅 시스템 과의 라디오 주파수 통신을 위해 하나 이상의 안테나, 변조 및 복조 회로, 필터, 또는 증폭기 등을 포함할 수 있다. 처리 회로 의 제어 하에, 통신 회로 는 내부 및/또는 외부에 있을 수 있는 안테나의 도움으로 컴퓨팅 시스템 으로부터 다운링크 원격측정을 수신하 고 이에 업링크 원격측정을 전송할 수 있다. 처리 회로 는 컴퓨팅 시스템 에 업링크될 데이터 및 예컨 대, 주소/데이터 버스를 통해 통신 회로 내의 원격측정 회로에 대한 제어 신호를 제공할 수 있다. 일부 예 에서, 통신 회로 는 수신된 데이터를 멀티플렉서를 통해 처리 회로 에 제공할 수 있다. 전원 은 의료 장치 의 회로를 동작시키기 위해 전하를 유지하도록 구성된 임의의 유형의 장치일 수 있 다. 전원 은 충전식 또는 비-충전식 배터리로서 제공될 수 있다. 다른 예에서, 전원 은 환자 내에 서 의료 장치 의 이동으로부터 전기 에너지를 저장하는 에너지 스캐빈징 시스템을 포함할 수 있다. 개시내용의 기술에 따르면, 의료 장치 는 감지 회로 및/또는 센서 를 통해 환자 의 환자 데이 터를 수집한다. 센서 는 하나 이상의 센서, 예컨대, 하나 이상의 가속도계, 압력 센서, O2 포화용 광학 센 서 등을 포함할 수 있다. 일부 예에서, 환자 데이터는 환자 의 활동 수준, 환자 의 심박수, 환자 의 자세, 환자 의 심장 전기도 (예컨대, 환자 의 심장 EGM 스트립), 환자 의 혈압, 환자 에 대 한 가속도계 데이터, 또는 기타 유형의 환자 파라미터 데이터 중 하나 이상을 포함한다. 의료 장치 는 통신 회로 를 통해, 네트워크 를 통해 컴퓨팅 시스템 에 환자 파라미터 데이터를 업로드한다. 일부 예에 서, 의료 장치 는 매일 기준으로 환자 파라미터 데이터를 컴퓨팅 시스템 에 업로드한다. 일부 예에서, 환자 파라미터 데이터는 장기간 (예컨대, 약 24시간 내지 약 48시간)에 걸쳐 환자 의 평균값 측정치를 나타 내는 하나 이상의 값을 포함한다. 예를 들어, 하나 이상의 기타 장치, 예컨대, 웨어러블 의료 장치 또는 환자 의 모바일 장치 (예컨대, 스마트폰)는 환자 파라미터 데이터를 수집하고 환자 파라미터 데이터를 외부 장치 및/또는 컴퓨팅 시스템 에 업로드할 수 있다. 치료적 전기적 자극을 제공하는 예시적인 의료 장치 의 상황에서 본원에서 설명되었지만, 본원에 개시된 심 장 부정맥의 단기 예측을 위한 기술은 기타 유형의 장치와 함께 사용될 수 있다. 예를 들어, 기술은 심장 내 이 식용으로 구성된 카테터경유 박동조율기, 예컨대, 아일랜드 더블린의 Medtronic PLC로부터 상업적으로 이용가능 한 MicraTM 카테터경유 박동조율 시스템, 삽입형 심장 모니터, 예컨대, Medtronic PLC로부터 또한 상업적으로이용가능한 Reveal LINQTM ICM, 신경자극기, 약물 전달 장치, 웨어러블 장치, 예컨대, 웨어러블 심장율동전환기 제세동기, 피트니스 트래커, 또는 모바일 장치인 기타 웨어러블 장치, 예컨대, 휴대폰, \"스마트\" 폰, 랩톱, 태 블릿 컴퓨터, 개인 정보 단말기 (PDA), 또는 \"스마트\" 의류, 예컨대, \"스마트\" 안경 또는 \"스마트\" 시계로 구현 될 수 있다. 도 4는 본 개시내용의 하나 이상의 기술에 따라 동작하는 예시적인 컴퓨팅 시스템 을 예시하는 블록도이다. 일 예에서, 컴퓨팅 시스템 은 모니터링 시스템 또는 본원에 기재된 임의의 기타 애플리케이션을 포함 하는 애플리케이션 을 실행하기 위한 처리 회로 를 포함한다. 도 4에 예시적인 목적을 위한 독립형 컴퓨팅 시스템 으로서 도시되어 있지만, 컴퓨팅 시스템 은 소프트웨어 명령을 실행하기 위한 처리 회로 또는 기타 적합한 컴퓨팅 환경을 포함하는 임의의 구성요소 또는 시스템일 수 있으며, 예를 들어, 도 4에 도시 된 하나 이상의 요소 (예컨대, 통신 회로 ; 및 일부 예에서 구성요소, 예컨대, 저장 장치(들) 는 기 타 구성요소와 동일한 섀시에 공동-위치되거나 동일한 섀시에 있지 않을 수 있음)를 반드시 포함할 필요는 없다. 일부 예에서, 컴퓨팅 시스템 은 복수의 장치에 걸쳐 분산된 클라우드 컴퓨팅 시스템일 수 있다. 도 4의 예에 도시된 바와 같이, 컴퓨팅 시스템 은 처리 회로 , 하나 이상의 입력 장치 , 통신 회 로 , 하나 이상의 출력 장치 , 하나 이상의 저장 장치 , 및 사용자 인터페이스 (UI) 장치(들) 를 포함한다. 일 예에서, 컴퓨팅 시스템 은 컴퓨팅 시스템 에 의해 실행가능한 하나 이상의 애플 리케이션(들) , 예컨대, 모니터링 시스템 , 및 운영 시스템 을 추가로 포함한다. 구성요소 (402, 404, 406, 408, 410 및 412)의 각각은 구성요소-간 통신을 위해 (물리적으로, 통신적으로, 및/또는 동작 적으로) 커플링된다. 일부 예에서, 통신 채널 은 시스템 버스, 네트워크 연결부, 프로세스 간 통신 데이터 구조, 또는 데이터 통신을 위한 임의의 다른 방법을 포함할 수 있다. 일 예로서, 구성요소 (402, 404, 406, 408, 410 및 412)는 하나 이상의 통신 채널 에 의해 커플링될 수 있다. 일 예에서, 처리 회로 는 기능성을 구현하고/하거나 및/또는 컴퓨팅 시스템 내 실행을 위한 명령을 처리하도록 구성된다. 예를 들어, 처리 회로 는 저장 장치 에 저장된 명령을 처리하는 것이 가능할 수 있다. 처리 회로 의 예는 마이크로프로세서, 제어기, 디지털 신호 프로세서 (DSP), 주문형 집적 회로 (ASIC), 필드-프로그래머블 게이트 어레이 (FPGA), 또는 등가 이산 또는 통합형 논리 회로 중 임의의 하나 이상 을 포함할 수 있다. 하나 이상의 저장 장치 는 동작 동안 컴퓨팅 시스템 내에 정보를 저장하도록 구성될 수 있다. 일부 예에서, 저장 장치 는 컴퓨터-판독가능 저장 매체로서 기재된다. 일부 예에서, 저장 장치 는 임시 메 모리이며, 이는 저장 장치 의 주요 목적이 장기 저장이 아님을 의미한다. 일부 예에서, 저장 장치 는 휘발성 메모리로서 설명되며, 이는 저장 장치 가 컴퓨터가 꺼질 때 저장된 콘텐츠를 유지하지 않음을 의미 한다. 휘발성 메모리의 예로는 랜덤 액세스 메모리 (RAM), 동적 랜덤 액세스 메모리 (DRAM), 정적 랜덤 액세스 메모리 (SRAM), 및 당업계에 알려진 기타 형태의 휘발성 메모리를 포함한다. 일부 예에서, 저장 장치 는 처리 회로 에 의한 실행을 위한 프로그램 명령을 저장하는 데 사용된다. 일 예에서, 저장 장치 는 프 로그램 실행 동안 정보를 일시적으로 저장하기 위해 컴퓨팅 시스템 에서 운영되는 소프트웨어 또는 애플리 케이션 에 의해 사용된다. 일부 예에서, 저장 장치 는 또한 하나 이상의 컴퓨터-판독가능 저장 매체를 포함한다. 저장 장치 는 휘발성 메모리보다 더 많은 양의 정보를 저장하도록 구성될 수 있다. 저장 장치 는 정보의 장기 저장을 위 해 추가로 구성될 수 있다. 일부 예에서, 저장 장치 는 비휘발성 저장 요소를 포함한다. 이러한 비-휘발성 저장 요소의 예는 자기 하드 디스크, 광학 디스크, 플로피 디스크, 플래시 메모리, 또는 전기 프로그래머블 메 모리 (EPROM) 또는 전기 소거식 및 프로그래머블 메모리 (EEPROM)의 형태를 포함한다. 일부 예에서, 컴퓨팅 시스템 은 또한 통신 회로 를 포함한다. 일 예에서, 컴퓨팅 시스템 은 통신 회로 를 활용하여, 외부 장치, 예컨대, 도 1의 의료 장치 및 EMR 데이터베이스 와 통신한다. 통 신 회로 는 네트워크 인터페이스 카드, 예컨대, 이더넷 카드, 광학 트랜시버, 라디오 주파수 트랜시버, 또 는 정보를 전송 및 수신할 수 있는 임의의 기타 유형의 장치를 포함할 수 있다. 이러한 네트워크 인터페이스의 다른 예는 3G, 4G, 5G, 및 WI-FI™ 라디오를 포함할 수 있다. 일 예에서, 컴퓨팅 시스템 은 또한 하나 이상의 사용자 인터페이스 장치 를 포함한다. 일부 예에서, 사용자 인터페이스 장치 는 촉각, 오디오, 또는 비디오 피드백을 통해 사용자로부터 입력을 수신하도록 구 성된다. 사용자 인터페이스 장치(들) 의 예는 존재-감지 디스플레이, 마우스, 키보드, 음성 응답 시스템, 비디오 카메라, 마이크, 또는 사용자로부터 명령을 검출하기 위한 임의의 기타 유형의 장치를 포함한다. 일부예에서, 존재-감지 디스플레이는 터치-감지 스크린을 포함한다. 하나 이상의 출력 장치 가 또한 컴퓨팅 시스템 에 포함될 수 있다. 일부 예에서, 출력 장치 는 촉각, 오디오, 또는 비디오 자극을 사용하여 사용자에 출력을 제공하도록 구성된다. 일 예에서, 출력 장치 는 존재-감지 디스플레이, 사운드 카드, 비디오 그래픽 어댑터 카드, 또는 신호를 인간 또는 기계가 이해 할 수 있는 적절한 형태로 변환하기 위한 임의의 기타 유형의 장치를 포함한다. 일부 예에서, 출력 장치(들) 는 디스플레이 장치를 포함한다. 출력 장치 의 추가적인 예는 스피커, 음극선관 (CRT) 모니터, 액정 디스플레이 (LCD), 또는 사용자에 대해 이해가능한 출력을 생성할 수 있는 임의의 기타 유형의 장치를 포함한다. 컴퓨팅 시스템 은 운영 시스템 을 포함할 수 있다. 일부 예에서, 운영 시스템 은 컴퓨팅 시스템 의 구성요소의 동작을 제어한다. 예를 들어, 운영 시스템 은 일 예에서, 하나 이상의 애플리케이션 및 모니터링 시스템 과 처리 회로 , 통신 회로 , 저장 장치 , 입력 장치 , 사 용자 인터페이스 장치 , 및 출력 장치 의 통신을 용이하게 한다. 애플리케이션 은 또한 컴퓨팅 시스템 에 의해 실행가능한 프로그램 명령 및/또는 데이터를 포함할 수 있다. 컴퓨팅 시스템 에 의해 실행가능한 예시적인 애플리케이션(들) 은 모니터링 시스템 을 포 함할 수 있다. 도시되지 않은 기타 추가적인 애플리케이션이 본원에 설명된 기타 기능성을 제공하기 위해 대안 적으로 또는 추가적으로 포함될 수 있으며, 이는 단순함을 위해 도시되어 있지 않다. 개시내용의 기술에 따르면, 애플리케이션 은 모니터링 시스템 을 포함한다. 모니터링 시스템 은 환자 데이터를 수신하고, 환자 데이터를 평가하고, 출력 데이터를 생성하도록 구성될 수 있다. 예를 들어, 일 예에서, 모니터링 시스템 은 모니터링 시스템 이 환자 (도 1)가 하나 이상의 심장 부정맥에 속 하는 하나 이상의 심장 부정맥 이벤트를 경험할 가능성이 있다고 결정할 때 통지를 생성할 수 있다. 다른 예에 서, 모니터링 시스템 은 환자 의 심장 리듬의 하나 이상의 양태에 대한 변화를 도시하는 하나 이상의 차트를 생성할 수 있다. 도 4의 예에 도시된 바와 같이, 모니터링 시스템 은 일부 예에서, 하나 이상의 CRC를 포함하는 AI 시스템 을 구현할 수 있다. 예를 들어, 도 4의 예에서, 모니터링 시스템 은 CRC (452A) 내지 CRC (452N) (총칭하여, \"CRC \")를 포함할 수 있다. CRC 는 일반화된 CRC 및 하나 이상의 전문화된 CRC를 포함할 수 있다. CRC의 다음 설명이 CRC 및 AI 시스템 을 언급하지만, 다음 설명은 컴퓨팅 시스템 이 외의 장치 또는 시스템, 예컨대, 의료 장치 또는 외부 장치 또는 이들의 조합에서 구현되는 CRC 및 AI 시스템에 동등하게 적용될 수 있다. 일부 예에서, CRC 각각은 하나 이상의 신경망 시스템, 심층 학습 시스템, 또는 기타 유형의 지도 또는 비 지도 기계 학습 시스템을 사용하여 구현된다. 예를 들어, CRC는 피드포워드 신경망, 예컨대, 콘볼루션 신경망, 방사형 기초 함수 신경망, 순환 신경망, 모듈식 또는 연관식 신경망에 의해 구현될 수 있다. 일부 예에서, AI 시스템 은 집단의 환자의 심장 리듬의 하나 이상의 양태에 관한 데이터로 상이한 환자 집단에 대해, 심장 EGM 스트립을 포함하는 환자 데이터로 CRC 를 훈련시킨다. 일부 예에서, AI 시스템 이 환자 집단에 대한 환자 데이터로 CRC를 사전-훈련시킨 후, AI 시스템 은 환자 또는 더 작은 환자 코호트에 특이 적인 환자 데이터로 기계 학습 모델을 추가로 훈련시킬 수 있다. 일부 예에서, AI 시스템 은 환자 집단에 대한 환자 데이터로 CRC를 훈련시키고, CRC의 오류율을 결정하고, 그 다음 CRC가 오류율에 기반하여 이의 예측을 업데이트할 수 있도록 오류율을 CRC에 피드백한다. 일부 예에서, 오류율은 입력 데이터에 기반하여 CRC에 의해 결정된 출력 데이터와 동일한 입력 데이터에 대한 미리 표지된 출 력 데이터 사이의 차이에 상응할 수 있다. 일부 예에서, AI 시스템 은 오류율을 결정하기 위해 오류 함수 (error function)를 사용할 수 있다. 오류 함수는 심장 부정맥의 발생을 검출하는 데 통상적으로 사용되는 방식 으로 신호 처리 기술 및 휴리스틱을 사용하여 구현될 수 있다. 일부 예에서, 모니터링 시스템 은 검출된 심장 부정맥이 특정 기간 내에 환자 에서 발생하는지 여부를 나타내는 사용자 (예컨대, 환자 , 임상의 또는 다른 유형의 사람) 피드백으로부터 수신할 수 있다. 일부 예에서, 모니터링 시스템 은 의료 장치 가 환자 의 심장 부정맥의 발생을 검출하였음을 (또는 검출하지 않았음을) 나타내는 메시지를 의료 장 치 로부터 수신할 수 있다. 일부 예에서, 모니터링 시스템 은 다른 방식으로, 예컨대, 심장 부정맥이 발생하였는지를 결정하기 위해 EMR 데이터를 주기적으로 체크함으로써 피드백을 수득할 수 있다. 모니터링 시스 템 은 피드백으로 CRC를 업데이트할 수 있다. 따라서, 훈련 프로세스는 과거에 CRC에 의해 생성된 정확한 또는 부정확한 데이터로부터 \"학습\"함으로써 CRC에 의해 생성된 데이터를 증가하여 개선시키기 위해 되풀이하여발생할 수 있다. 또한, 훈련 프로세스는 특정 개인에 대해 더 정확한 데이터를 생성하기 위해 집단-기반 데이터 를 사용하여 훈련된 CRC를 추가로 미세-조정하는 데 사용될 수 있다. 일부 예에서, 모니터링 서비스 담당자가 피드백을 제공할 수 있다. 일부 예에서, CRC 각각은 신경망을 사용하여 구현된다. 신경망은 입력 레이어, 및 출력 레이어, 및 입력 레이어와 출력 레이어 사이의 하나 이상의 은닉 레이어를 포함할 수 있다. 신경망의 각각의 레이어는 하나 이상 의 인공 뉴런을 포함하며, 본 개시내용은 이를 단순히 뉴런으로서 지칭한다. 신경망의 입력 레이어는 복수의 입 력 뉴런을 포함한다. 입력 레이어는 심장 EGM 스트립의 세그먼트의 각각의 샘플 값에 대한 별도의 입력 뉴런을 포함할 수 있다. 일부 예에서, 세그먼트는 심장 EGM 스트립과 매우 유사할 수 있다. 다른 예에서, 세그먼트는 심장 EGM 스트립의 하위 세그먼트일 수 있다. 예를 들어, 심장 EGM 스트립이 환자 의 심장 리듬의 45초를 나타내는 샘플을 포함하는 예에서, 세그먼트는 심장 EGM 스트립의 처음 10초를 나타내는 샘플을 포함할 수 있다. AI 시스템 은 심장 EGM 스트립의 중첩 세그먼트를 CRC에 제공할 수 있다. 예를 들어, AI 시스템 은 심장 EGM 스트립의 0초 내지 10초를 나타내는 샘플을 포함하는 세그먼트를 제공한 다음, 심장 EGM 스트립의 5초 내지 15초를 나타내는 샘플을 포함하는 세그먼트를 제공한 다음, 심장 EGM 스트립의 10초 내지 20초를 나타내는 샘플을 포함하는 세그먼트를 제공하는 등등을 제공할 수 있다. 일부 예에서, 컴퓨팅 시스템 은 2개 이상의 심장 EGM 스트립에 걸쳐 있는 세그먼트를 제공할 수 있다. 일부 예에서, CRC 각각은 콘볼루션 신경망 (CNN)이다. 예를 들어, 일 예에서, 콘볼루션 레이어는 상기 설 명된 유형의 입력 레이어를 따를 수 있다. 제1 콘볼루션 레이어 뉴런은 주어진 수의 연속 입력 레이어 뉴런으로 이루어진 입력 레이어 뉴런의 제1 세트로부터 입력을 수신할 수 있고; 제2 콘볼루션 레이어 뉴런은 동일한 주어 진 수의 연속 입력 레이어 뉴런으로 이루어진 입력 레이어 뉴런의 제2 세트로부터 입력을 수신할 수 있지만, 입 력 레이어 뉴런의 제1 세트의 제1 입력 레이어 뉴런으로부터 보폭 길이만큼 오프셋되고; 제3 콘볼루션 레이어 뉴런은 동일한 주어진 수의 연속 입력 레이어 뉴런으로 이루어진 입력 레이어 뉴런의 제3 세트로부터 입력을 수 신할 수 있지만, 입력 레이어 뉴런의 제2 세트의 제1 입력 레이어 뉴런으로부터 보폭 길이만큼 오프셋되는, 등 등일 수 있다. 연속 입력 뉴런의 주어진 수 및 보폭은 CNN의 상이한 하이퍼파라미터이다. 하나 이상의 완전히 연결된 은닉 레이어가 콘볼루션 레이어를 따를 수 있다. CRC 를 CNN으로서 구현하는 것은 CRC 의 성 능을 증가시킬 수 있다. 본 개시내용의 일부 예에서, 하나 이상의 심장 부정맥의 세트의 각각의 개별 심장 부정맥에 대해, 각각의 CRC 는 개별 심장 부정맥의 하나 이상의 발생이 심장 EGM 스트립의 세그먼트에서 표현되는지 여부를 나타내는 데이터를 생성할 수 있다. 예를 들어, 일 예에서, CRC의 은닉 레이어는 CRC의 출력 레이어에 입력 데이터를 제 공한다. 심장 부정맥 세트의 각각의 개별 심장 부정맥에 대해, CRC의 출력 레이어는 개별 심장 부정맥에 상응하 는 별도의 출력 뉴런을 포함한다. 개별 심장 부정맥에 상응하는 출력 뉴런은 개별 심장 부정맥에 또한 상응하는 CRC의 은닉 레이어에서의 단일 뉴런으로부터 입력 데이터를 수신한다. 개별 심장 부정맥에 상응하는 은닉 레이 어 뉴런에 의해 생성된 데이터는 심장 부정맥의 발생이 심장 EGM 스트립의 세그먼트에서 발생할 확률을 나타내 는 확률 값을 포함한다. 출력 뉴런의 활성화 함수는 은닉 레이어 뉴런에 의해 생성된 확률 값에 임계값 함수를 적용할 수 있다. 각각의 출력 뉴런에 대해, 임계값 함수는 출력 뉴런에 제공된 확률 값이 임계값보다 큰 경우 출력 뉴런이 제1 값 (예컨대, 1)을 생성하도록 유발할 수 있으며, 출력 뉴런에 제공된 확률 값이 동일한 임계값 보다 작은 경우 제2 값 (예컨대, 0)을 생성하도록 유발할 수 있다. 더욱이, 이전 단락의 예에서, AI 시스템 은 심장 EGM 스트립 내에서 심장 부정맥의 발생이 발생한 곳을 추 적하기 위해 은닉 레이어에 의해 생성된 확률 값을 사용할 수 있다. 예를 들어, 상기 언급한 바와 같이, 심장 EGM 스트립은 세그먼트로 세분화될 수 있고, AI 시스템 은 입력으로서 CRC 에 세그먼트를 제공한다. 따라서, 심장 EGM 스트립의 어느 세그먼트가 심장 부정맥에 상응하는 가장 높은 확률 값을 초래하였는지를 결정 함으로써, AI 시스템 은 어느 세그먼트가 심장 부정맥의 발생을 가장 나타낼 가능성이 있는지 결정할 수 있다. 본 개시내용의 다른 곳에서 언급된 바와 같이, CRC 에 제공된 입력은 심장 EGM 스트립의 세그먼트에 추가 하여 환자 데이터를 포함할 수 있다. 예를 들어, 일부 예에서, 환자 데이터는 의료 장치 에 의해 또한 캡쳐 될 수 있는 환자의 생리학적 상태 (예컨대, 환자 생리학적 상태, 예컨대, 활동, 자세, 호흡 등)에 관한 데이터 를 추가적으로 포함할 수 있다. 상이한 생리학적 조건 (예컨대, 휴식, 야간 휴식, 높은 자세 각도로 야간 휴식 등)에 상응하는 환자 데이터는 CRC 에 대한 모델 훈련 또는 입력 데이터를 위한 추가적인 파라미터로서 사용될 수 있다. 이러한 데이터를 사용하는 것은 AI 시스템이 다른 질환 병태 동안 심장 부정맥의 발생을 검출하 는 것을 가능하게 할 수 있다 (예컨대, 휴식 동안 빈맥에 대한 감지 모델을 사용하여 심부전 (HF) 환자를 모니 터링할 수 있으며; 활동 동안 서맥에 대한 모델을 사용하여 심박수 변동 부전에 대해 환자를 모니터링할 수 있 다). 일부 예에서, 모니터링 시스템 은 통신 회로 를 통해, EMR 데이터베이스 로부터 환자 (1 4)에 대한 EMR 데이터를 수신한다. 일부 예에서, EMR 데이터베이스 에 의해 저장된 EMR 데이터는 환자 (1 4)에 대한 많은 상이한 유형의 과거 의료 정보를 포함할 수 있다. 예를 들어, EMR 데이터베이스 는 환자의 의약 이력, 환자의 외과 시술 이력, 환자의 입원 이력, 시간 경과에 따른 환자의 포타슘 수준, 또는 환자에 대 한 하나 이상의 실험실 테스트 결과 등을 저장할 수 있다. EMR 데이터는 CRC 중 하나 이상에 대한 입력으 로서 사용된 환자 데이터의 일부를 형성할 수 있다. 일부 예에서, CRC 각각은 환자 데이터를, 환자 데이터를 나타내는 하나 이상의 벡터 및 텐서 (예컨대, 다 -차원 어레이)로 변환한다. CRC 는 하나 이상의 벡터 및 텐서에 수학적 연산을 적용하여, 환자 데이터의 수학적 표현을 생성할 수 있다. CRC 는 환자 데이터와 심장 부정맥의 발생 사이의 식별된 관계에 상응하는 상이한 가중치를 결정할 수 있다. CRC 는 확률 값을 생성하기 위해 환자 데이터에 상이한 가중치를 적용할 수 있다. 도 5는 개시내용의 기술에 따른 예시적인 동작을 예시하는 흐름도이다. 편의상, 도 5는 도 1과 관련하여 설명된 다. 본 개시내용의 흐름도는 예로서 제시된다. 본 개시내용의 기술에 따른 기타 예는 더 많거나, 더 적거나, 또 는 상이한 작업을 포함할 수 있거나, 동작이 상이한 순서로 또는 병렬로 수행될 수 있다. 도 5의 동작은 의료 장치 , 컴퓨팅 시스템 , 외부 장치 , 및/또는 기타 장치 중 하나 이상에 구현된 AI 시스템에 의해 수행될 수 있다. 도 5의 예에서, AI 시스템은 환자 (즉, 현재 환자)에 대한 심장 EGM 스트립을 수득할 수 있다 . AI 시스템은 다양한 방식 중 하나 이상으로 환자 에 대한 심장 EGM 스트립을 수득할 수 있다. 예를 들어, 컴퓨 팅 시스템 이 AI 시스템을 구현하는 예에서, 컴퓨팅 시스템 은 (예컨대, 외부 장치 및 네트워크 를 통해) 의료 장치 로부터 환자 에 대한 심장 EGM 스트립을 수득할 수 있다. AI 시스템이 의료 장 치 에서 구현되는 일부 예에서, AI 시스템은 전극으로부터의 데이터에 기반하여 심장 EGM 스트립을 생성함 으로써 심장 EGM 스트립을 수득할 수 있다. 일부 예에서, AI 시스템은 현재 환자에 대한 하나 이상의 심장 EGM 스트립을 저장하는 데이터베이스 (예컨대, EMR 데이터베이스)로부터 현재 환자에 대한 심장 EGM 스트립을 수득할 수 있다. 심장 EGM 스트립을 수득하는 다른 예는 본 개시내용의 다른 곳에서 설명된다. 더욱이, 도 5의 예에서, AI 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 CRC (즉, 일반화된 CRC)를 적용할 수 있다 . 제1 CRC는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된다. 일부 예 에서, 제1 집단은 심장 EGM 데이터가 컴퓨팅 시스템 에 의해 모니터링되는 모든 환자를 포함한다. AI 시스 템이 제1 CRC를 적용할 때, 제1 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 환자 의 심장 리듬의 양태 에 관한 제1 데이터를 생성한다. 일부 예에서, 현재 환자의 심장 리듬의 양태는 현재 환자의 심장 리듬에서 심장 부정맥의 발생의 발생이다. 이 러한 예에서, 제1 데이터는 심장 EGM 스트립의 세그먼트가 하나 이상의 심장 부정맥의 1회 이상의 발생을 나타 내는지 여부를 나타내는 데이터를 포함할 수 있다. 예를 들어, 제1 데이터는 심장 EGM 스트립의 세그먼트가 심 장 부정맥의 1회 이상의 발생을 나타낼 제1 확률에 기반할 수 있다. 일부 예에서, 하나 이상의 심장 부정맥의 세트의 각각의 심장 부정맥에 대해, 제1 데이터는 심장 부정맥의 발생이 심장 EGM 스트립에서 나타난다는 신뢰 수준을 나타내는 신뢰 값을 포함할 수 있다. 신뢰 값은 출력 레이어보다 앞선 은닉 레이어의 뉴런의 출력 값일 수 있다. 일부 예에서, 제1 출력 데이터는 심장 EGM 스트립에서 하나 이상의 심장 부정맥의 발생이 발생한 위치 를 나타내는 타이밍 데이터를 포함할 수 있다. 추가적으로, AI 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC (즉, 전문화된 CRC)를 적용할 수 있다 . 제2 CRC는 제1 집단보다 작은 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련된 제1 CRC 버전이다. 예를 들어, 일부 예에서, 제2 집단은 환자 로만 이루어질 수 있다. 다른 예에서, 제2 집단은 환 자의 코호트, 예컨대, 환자 와 하나 이상의 특성을 공유하는 환자의 코호트일 수 있다. 예시적인 특성은 환 자들 및 환자 의 코호트 진단을 포함할 수 있다. AI 시스템이 제2 CRC를 적용할 때, 제2 CRC는 심장 EGM 스 트립의 세그먼트에 기반하여, 심장 리듬 유형에 관한 제2 데이터를 생성할 수 있다. 제2 데이터는 제1 데이터와 동일한 유형의 데이터를 포함할 수 있다. 예를 들어, 제2 데이터는 심장 EGM 스트립의 세그먼트가 심장 부정맥 의 1회 이상의 발생을 나타낼 제2 확률에 기반한다.AI 시스템은 제1 데이터 및 제2 데이터 중 하나 이상에 기반하여 출력 데이터를 생성할 수 있다 . 일부 예 에서, 컴퓨팅 시스템 은 그래픽 사용자 인터페이스, 음성 인터페이스, 웹페이지를 통해 또는 다른 형태로 출력 데이터를 제시할 수 있다. 일부 예에서, 출력 데이터는 통지 또는 메시지, 예컨대, 이메일 메시지, 문자 메시지, 인-앱 통지, 인스턴트 메시지, 음성메일 메시지, 또는 다른 유형의 메시지를 포함할 수 있다. 일부 예에서, AI 시스템은 디스플레이를 위해 대시보드 인터페이스를 출력할 수 있다. 대시보드 인터페이스는 출력 데이터를 포함하는 그래픽 사용자 인터페이스의 유형이다. 대시보드 인터페이스는 목록, 차트, 스파크라인, 막대 그래프, 표, 또는 직관적인 방식으로 환자 의 심장 리듬에 대한 하나 이상의 유형의 정보 를 전달하도록 설계된 기타 유형의 데이터를 포함할 수 있다. 예를 들어, 일 예에서, 제1 데이터는 일반화된 CRC가 심장 EGM 스트립의 세그먼트에서 특정 심장 부정맥의 발생 을 식별하였는지 여부를 나타낸다. 이 예에서, 대시보드 인터페이스는 일반화된 CRC에 의해 식별된 특정 심장 부정맥의 발생 횟수에 비례하는 크기를 갖는 막대 그래프의 제1 막대 형태의 출력 데이터를 포함할 수 있다. 마 찬가지로, 일부 예에서, 제2 데이터는 전문화된 CRC가 심장 EGM 스트립의 세그먼트에서 특정 심장 부정맥의 발 생을 식별하였는지 여부를 나타낼 수 있다. 이 예에서, 막대 그래프는 전문화된 CRC에 의해 식별된 특정 심장 부정맥의 발생 횟수에 비례하는 크기를 갖는 제2 막대를 포함할 수 있다. 이 방식으로, 막대 그래프는 제1 및 제2 CRC에 의해 식별된 특정 부정맥의 발생 횟수의 비교를 가능하게 할 수 있다. 일 예에서, 현재 환자의 심장 리듬의 양태는 환자 의 심장 리듬에서 발생하는 심장 부정맥의 발생의 형태학 적 양태이다. 이 예에서, 제1 데이터는 심장 EGM 스트립의 세그먼트에서 나타나는 심장 부정맥의 발생의 형태학 적 양태에 관한 제1 데이터를 포함할 수 있다. 추가적으로, 이 예에서, 제2 데이터는 심장 EGM 스트립의 세그먼 트에서 나타나는 심장 부정맥의 발생의 형태학적 양태에 관한 제2 데이터를 포함할 수 있다. 출력 데이터는 발 생의 형태학적 양태에 관한 제1 데이터 및 발생의 형태학적 양태에 관한 제2 데이터를 비교하는 데이터를 포함 할 수 있다. 예를 들어, 출력 데이터는 발생의 형태학적 양태에 관한 제1 데이터와 발생의 형태학적 양태에 관 한 제2 데이터 사이의 상이함을 도시하는 차트를 포함할 수 있다. 제1 데이터 및 제2 데이터가, 일반화된 및 전문화된 CRC가 심장 EGM 스트립의 세그먼트에서 심장 부정맥의 발생 을 식별하였는지 여부를 나타내는 다른 예에서, 대시보드 인터페이스는 시간 경과에 따른 심장 부정맥의 발생 빈도를 나타내는 스파크라인을 포함할 수 있다. 출력 데이터의 많은 기타 예, 예컨대, 본 개시내용의 다른 곳에 제공된 예에서 설명된 데이터 유형이 가능하다. 일부 예에서, AI 시스템은 현재 환자로부터의 초기 심장 EGM 스트립에 기반하여 전문화된 CRC에 의해 생성된 이 력 데이터에 대한 제2 데이터의 비교에 기반하여 제2 출력 데이터를 생성할 수 있다. 예를 들어, AI 시스템은 환자 의 심장 리듬의 양태에서 경향을 나타내는 데이터를 생성할 수 있다. 일 예에서, AI 시스템은 각각의 기간 동안 (예컨대, 매일) 제2 전문화된 CRC에 의해 식별된 바와 같이 심장 부정맥의 발생 횟수를 카운트하고, 표 또는 그래프의 형태로 카운트를 도시할 수 있다. AI 시스템은 출력 데이터를 하나 이상의 유형의 사용자에게 제공할 수 있다. 예를 들어, AI 시스템은 출력 데이 터를 환자 , 환자 의 헬스케어 제공자, 헬스케어 모니터링 조직의 사용자 또는 다른 유형의 사람에게 제시할 수 있다. 도 6은 일반화된 CRC 가 본 개시내용의 기술에 따라 개별 환자의 심장 EGM에 기반하여 업데이트되는 예를 예시하는 개념도이다. 일반화된 CRC 는 제1 집단의 심장 EGM 스트립에 기반하여 훈련되고 특정 환자에 대 한 전문화된 CRC 를 생성하기 위해 특정 환자의 심장 EGM 스트립에 기반하여 추가로 훈련될 수 있다. 예를 들어, 일반화된 CRC 가 환자의 심장 리듬에서 발생하는 심장 부정맥의 하나 이상의 양태에 관한 데이터를 생성하도록 훈련되는 예에서, AI 시스템은 환자 의 심장 EGM 스트립에 기반하여 일반화된 CRC 를 추가 로 훈련하여, 환자 의 심장 리듬에서 발생하는 심장 부정맥의 하나 이상의 양태에 관한 데이터를 생성할 수 있다. 따라서, AI 시스템이 환자 의 모니터링을 시작할 때, 전문화된 CRC 는 일반화된 CRC 와 동 일할 수 있다. 그러나, 시간이 지남에 따라 AI 시스템은 환자 에 대한 환자 데이터 (예컨대, EGM 스트립)에 기반하여 환자 에 대해 전문화된 CRC 를 선택적으로 재훈련할 수 있다. 예를 들어, 컴퓨팅 시스템 은 환자 에 대한 전문화된 CRC 의 뉴런의 하나 이상의 레이어에 대한 입력과 연관된 파라미터 (예 컨대, 가중치 값, 바이어스 값 등)를 업데이트하기 위해 역전파 알고리즘을 적용할 수 있다. 본 개시내용의 다 른 곳에 더 상세하게 설명되는 도 9는 전문화된 CRC를 훈련하기 위한 예시적인 동작을 예시하는 흐름도이다. 도 6의 예에 도시된 바와 같이, AI 시스템은 환자 의 심장 EGM 스트립 을 수득할 수 있다. 더욱이, AI 시스템은 입력으로서 심장 EGM 스트립 의 세그먼트를 갖는 일반화된 CRC 및 전문화된 CRC 를 적용할 수 있다. 도 6의 예에서, 일반화된 CRC 및 전문화된 CRC 는 심장 EGM 스트립에 의해 나타나 는 심장 리듬에서의 하나 이상의 심장 부정맥의 발생을 식별한다. 도 6의 예에서, 식별된 심장 부정맥의 발생은 타원형 으로 마킹된다. 더욱이, 도 6의 예에 도시된 바와 같이, 일반화된 CRC 는 심장 EGM 스트립 의 세그먼트가 일반화된 CRC 에 대한 입력으로서 제공될 때 심장 부정맥의 3회 발생을 식별할 수 있 다. 그러나, 도 6의 예에 도시된 바와 같이, 전문화된 CRC 는 심장 EGM 스트립 의 세그먼트가 전문화 된 CRC 에 대한 입력으로서 제공될 때 심장 부정맥의 4회 발생을 식별할 수 있다. 전문화된 CRC 는, 환자 에서 발생하는 특정 심장 부정맥의 발생의 형태학적 양태가 일반화된 CRC 가 훈련된 일반 집단에 서 발생하는 특정 심장 부정맥의 발생의 형태학적 양태와 어떤 점에서는 상이할 수 있기 때문에 추가적인 발생 을 식별할 수 있다. 더욱이, 도 6의 예에 도시된 바와 같이, AI 시스템은 일반화된 CRC 및 전문화된 CRC 에 의해 생성된 데이터를 기반으로 다양한 유형의 출력 데이터를 생성할 수 있다. 예를 들어, AI 시스템은 심장 부정맥의 발생 의 개인화된 검출을 나타내는 출력 데이터를 생성할 수 있다. 일부 예에서, AI 시스템은 전문화된 CRC 에 의해 검출된 심장 부정맥의 발생의 형태학적 속성과 전문화된 CRC 에 의해 이전에 검출된 심장 부정맥의 발생의 형태학적 속성의 비교를 나타내는 출력 데이터를 생성할 수 있다. 예를 들어, 이 예에서, AI 시스템은 하나 이상의 심장 부정맥의 발생을 식별하기 위해 환자 의 심 장 EGM 스트립의 세그먼트에 전문화된 CRC 를 적용할 수 있다. 형태학적 속성의 예는 QRS 너비, 고유한 조 기 심실 수축 (PVC) 형태학의 수, 검출된 부정맥의 평균 심박수 및 P-R 간격 등을 포함할 수 있다. 더욱이, AI 시스템은 식별된 심장 부정맥의 발생의 형태학적 속성에 대한 값을 생성할 수 있다. 그런 다음, AI 시스템은 식 별된 심장 부정맥의 발생의 형태학적 속성에 대한 값을 사용하여, 사용자가 식별된 심장 부정맥의 발생의 형태 학적 속성에 대한 값을 비교할 수 있게 하는 비교 데이터를 생성할 수 있다. 예를 들어, 심장 부정맥이 심방 세동인 예에서, 형태학적 속성은 심방 세동의 발생의 심방 세동 동안의 시간적 지속기간 또는 심실 속도일 수 있다. 이 예에서, AI 시스템은 심방 세동의 발생을 식별하기 위해 환자 의 심장 EGM 스트립의 세그먼트에 전문화된 CRC 를 적용할 수 있다. 더욱이, 이 예에서, 식별된 심방 세동의 발생 각각에 대해, AI 시스템은 식별된 심방 세동의 발생의 시간적 지속기간을 나타내는 시간적 지속기간 값을 결정할 수 있다. 이 예에서, 이어서, AI 시스템은 결정된 시간적 지속기간 값을 사용하여, 비교 데이터를 생성 할 수 있다. 예를 들어, 이 예에서, 비교 데이터는 결정된 시간적 지속기간 값의 경향을 도시하는 라인 차트를 포함할 수 있다. 일부 예에서, 비교 데이터는 결정된 시간적 지속기간 값을 나열할 수 있다. 일부 예에서, AI 시스템은 환자 에 대한 개인화된 경향을 나타내는 출력 데이터를 생성할 수 있다. 예를 들 어, 일 예에서, AI 시스템은 전문화된 CRC 에 의해 식별된 심장 부정맥의 발생에서 형태학적 속성에 대한 시간 경과에 따른 변화, 및 전문화된 CRC 에 의해 식별된 심장 부정맥의 발생 빈도에 대한 시간 경과에 따 른 변화 등을 도시하는 출력 데이터를 생성할 수 있다. 일부 예에서, AI 시스템은 하나 이상의 심장 부정맥의 발생을 식별하기 위해 환자 의 심장 EGM 스트립의 동 일한 세트의 세그먼트에 일반화된 CRC 및 전문화된 CRC 를 적용할 수 있다. 따라서, AI 시스템은 일 반화된 CRC 를 적용함으로써 발생의 제1 세트를 식별하고, 전문화된 CRC 를 적용함으로써 발생의 제2 세트를 식별할 수 있다. 이 예에서, 컴퓨팅 시스템은 발생의 제1 세트 및 발생의 제2 세트에 기반하여 비교 데이터를 생성할 수 있다. 일부 예에서, 비교 데이터는 발생의 제1 세트 및 발생의 제2 세트에서의 발생 횟수의 비교를 제공함으로써 전문화된 CRC 를 사용하는 것의 가치를 강조하는 역할을 할 수 있다. 일부 예에서, AI 시스템은 전문화된 CRC 에 의해 식별된 심장 부정맥의 발생의 형태학적 속성 및 일반화된 CRC 에 의해 식별된 심장 부정맥의 발생의 형태학적 속성의 분석을 수행할 수 있다. 예를 들어, 일 예에서, AI 시스템은 일반화된 CRC 를 환자 의 심장 EGM 스트립 세트의 세그먼트에 적용함으로써 심장 부정맥의 발생의 제1 세트를 식별할 수 있다. 이 예에서, AI 시스템은 전문화된 CRC 를 환자 의 동일 한 심장 EGM 스트립 세트의 세그먼트에 적용함으로써 심장 부정맥의 발생의 제2 세트를 식별할 수 있다. 더욱이, 이 예에서, AI 시스템은 일반화된 CRC 에 의해 식별된 심장 부정맥의 발생의 형태학적 속성에 대 한 값의 제1 세트를 생성할 수 있다. 유사하게, 이 예에서, AI 시스템은 심장 부정맥의 발생의 형태학적 속성에 대한 값의 제2 세트를 생성할 수 있다. 그런 다음, AI 시스템은 사용자가 일반화된 CRC 및 전문화된 CRC 에 의해 식별된 심장 부정맥의 발생에서 형태학적 속성에 대한 값을 비교할 수 있게 하는 비교 데이터를 생성할 수 있다. 더욱이, 비교 데이터는 일반 집단의 구성원에서의 심장 부정맥 발생의 형태학적 속성의 값을나타내는 데이터를 포함할 수 있다. 도 7은 컴퓨팅 시스템 이 본 개시내용의 기술에 따라 일반화된 CRC 및 코호트-기반 전문화된 CRC 를 적용하는 예를 예시하는 개념도이다. 도 6의 예와 유사하게, 컴퓨팅 시스템 은 환자 의 심장 EGM 스트립 을 수득할 수 있다. 도 7의 예에서, 집단 (예컨대, 모니터링 시스템 (도 4)에 의해 모니터링되는 환자 집단)의 모든 환자로부 터의 데이터에 대해 훈련되는 대신, 하나 이상의 전문화된 CRC 세트, 예컨대, 코호트-기반 CRC 는 특정 환 자 코호트를 기반으로 훈련된다. 환자 코호트는 다양한 방식 중 임의의 것으로 정의될 수 있다. 예를 들어, 환 자 코호트는 진단 및 절차 코드, 예컨대, 국제질병사인분류의 10번째 개정판 (ICD-10)에 정의된 코드 및 현재 절차 기술 (CPT) 코드를 기반으로 정의할 수 있다. 이 예에서, 코호트-기반 CRC 는 EGM 스트립의 세그먼트 및 일부 예에서, 선택된 환자 그룹의 기타 환자 데이터를 기반으로 훈련될 수 있으며, 이들 모두는 이들의 의료 기록에서의 공유된 ICD-10 및/또는 CPT 코드 이력을 가지고 있다. 따라서, 코호트-기반 CRC 에 의해 생성 된 데이터는 선택된 환자 그룹의 생리를 반영할 수 있다. AI 시스템은 사용자가 환자 에 관한 데이터, 환자 코호트에 관한 데이터, 및/또는 일반화된 CRC 가 훈 련된 집단에 관한 데이터 중 2개 이상을 비교할 수 있게 하는 출력 데이터를 생성할 수 있다. 예를 들어, AI 시 스템은 개별 환자 대신 코호트와 함께 도 6에서 개별 환자에 관해 설명된 유형 중 임의의 것의 출력 데이터를 생성할 수 있다. 일부 예에서, AI 시스템은 또한 개별 환자 (예컨대, 환자 )에 대해 전문화된 CRC를 적용할 수 있다. 따라서, AI 시스템은 사용자가 개인의 데이터를 일반화된 CRC 및 코호트-기반 CRC 에 의해 생성된 데이터와 비교할 수 있도록 하는 출력 데이터를 생성할 수 있으므로, 사용자는 개인의 데이터를 일반 집단뿐만 아니라 유사한 진단 및 절차 이력을 가진 다른 집단 둘 모두와 비교한 것을 볼 수 있다. 일부 예에서, AI 시스템은 복수의 코호트-기반 CRC에 의해 생성된 데이터 및 개별 환자에 대한 개인화된 CRC에 의해 생성된 데이터에 기반하여, 코호트-기반 CRC 중 어느 것이 개별 환자에 대해 개인화된 CRC에 의해 생성된 데이터와 가장 유사한 데이터를 생성하는지 결정할 수 있다. 예를 들어, AI 시스템은 평균 제곱 오차, 절대 차 이의 합, 또는 코호트-기반 CRC에 의해 생성된 데이터와 개별 환자에 대해 개인화된 CRC에 의해 생성된 데이터 사이의 유사성을 결정하는 기타 메트릭스를 계산할 수 있다. 이러한 방식으로, AI 시스템은 코호트-기반 CRC 중 어느 것이 (따라서, 환자 코호트 중 어느 것이) 개별 환자와 가장 유사한지를 결정할 수 있다. 이는 일반 인 구통계학적 정보보다 개별 환자와 환자 코호트 사이의 더 나은 연관성을 가능하게 할 수 있다. 예를 들어, AI 시스템은 개별 환자가 50대-중반이지만 40대-중반의 심장 리듬 프로파일을 가지고 있다고 결정할 수 있다. 일부 예에서, AI 시스템은 개별 환자가 현재 개별 환자와 연관된 환자 코호트보다 특정 환자 코호트와 더 잘 연관되 어 있다는 결정에 대한 응답으로 통지를 생성할 수 있다. 도 8은 컴퓨팅 시스템이 본 개시내용의 기술에 따라 일반화된 CRC, 코호트-기반 CRC, 및 전문화된 CRC를 적용하 는 예시적인 동작을 예시하는 흐름도이다. 도 8의 예에서, AI 시스템은 환자 (즉, 현재 환자)에 대한 심장 EGM 스트립을 수득할 수 있다 . 추가적으로, AI 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 CRC (예컨대, 일반화된 CRC)를 적용할 수 있다 . 제1 CRC는 제1 집단으로부터의 EGM 스트립에 대해 훈 련된다. 제1 CRC는 제1 데이터를 생성한다. AI 시스템은 도 5의 작업 과 관련하여 설명된 것과 동일한 방 식으로 제1 CRC를 적용할 수 있다. 더욱이, 도 8의 예에서, AI 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC (예컨대, 코호트- 기반 CRC)를 적용할 수 있다 . 제2 CRC는 제2 집단, 예컨대, 환자 코호트로부터의 EGM 스트립에 대해 훈련 된다. 제2 CRC는 제2 데이터를 생성한다. 추가적으로, 도 8의 예에서, AI 시스템은 입력으로서 심장 EGM 스트립 의 세그먼트를 갖는 제3 CRC (예컨대, 환자 에 대한 전문화된 CRC)를 적용할 수 있다 . 제3 CRC는 환 자 로부터의 EGM 스트립에 대해 훈련되었다. 제3 CRC는 제3 데이터를 생성한다. 일부 예에서, 제3 CRC는 제 1 집단으로부터의 심장 EGM 스트립 훈련에 기반하여 훈련되고 환자 로부터의 심장 EGM 스트립 훈련에만 기 반하여 추가로 훈련되는 제1 CRC의 버전이다. AI 시스템은 제1 데이터, 제2 데이터 및 제3 데이터 중 하나 이상에 기반하여 출력 데이터를 생성할 수 있다 . 예를 들어, AI 시스템은 차트, 그래프, 및 본 개시내용 및 기타의 다른 곳에 설명된 다양한 유형의 비교 중 임의의 것을 가능하게 하는 다른 유형의 데이터를 포함하는 출력 데이터를 생성할 수 있다. 도 9는 본 개시내용의 기술에 따른 전문화된 CRC를 훈련하기 위한 예시적인 동작을 예시하는 흐름도이다. 도 9 의 예에서, AI 시스템은 제1 집단의 환자에 대한 EGM 스트립의 세그먼트에 기반하여 일반화된 CRC를 훈련할 수 있다 . AI 시스템은 본 개시내용의 다른 곳에 제공된 예 중 임의의 것에 따라 일반화된 CRC를 훈련할 수 있다. 더욱이, AI 시스템은 전문화된 CRC를 생성할 수 있다. 예를 들어, AI 시스템은 제2 집단으로부터의 심장 EGM 스트립에 기반하여 (예컨대, 이것에만 기반하여) 제1 CRC의 인스턴스를 훈련함으로써 전문화된 CRC를 생성 할 수 있다. AI 시스템은 전문화된 CRC를 생성하기 위해 작업 -을 수행할 수 있다. 더욱이, 도 9의 예에서, AI 시스템은 심장 EGM 스트립의 현재 세그먼트에 대한 제1 출력 벡터를 생성하기 위해 제2 집단으로부터의 심장 EGM 스트립의 현재 세그먼트에 일반화된 CRC를 적용할 수 있다 . 제2 집단은 제1 집단보다 작을 수 있다. 예를 들어, 제2 집단은 단일 환자 또는 환자의 코호트로 제한될 수 있다. 출력 벡터는 CRC에 의해 생성된 요소, 예컨대, 수치 값 또는 불린 값의 벡터이다. 추가적으로, 도 9의 예에서, AI 시스템은 심장 EGM 스트립의 현재 세그먼트에 대한 제2 출력 벡터를 생성하기 위해 심장 EGM 스트립의 현재 세그먼트에 전문화된 CRC를 적용할 수 있다 . 다음으로, AI 시스템은 심장 EGM 스트립의 현재 세그먼트에 대한 제2 출력 벡터가 심장 EGM 스트립의 현재 세그 먼트에 대한 제1 출력 벡터보다 더 정확한지 여부를 결정할 수 있다 . AI 시스템은 하나 이상의 방식 중 임의의 것으로 이러한 결정을 내릴 수 있다. 예를 들어, 일 예에서, 제1 출력 벡터 및 제2 출력 벡터는 심장 EGM 스트립의 현재 세그먼트가 심장 부정맥의 발생을 포함할 가능성을 나타내는 우도 값(likelihood value)을 포함한다. 이 예에서, AI 시스템은 일반화된 CRC 및 전문화된 CRC에 의해 생성된 우도 값을 비교할 수 있다. 이 예에서, 인간 리뷰당 심장 부정맥의 존재에 상응하는 더 높은 우도를 갖는 것이 바람직하고 인간 리뷰당 심장 부정맥의 부재에 상응하는 더 낮은 우도 값을 갖는 것이 바람직하다. AI 시스템은 또한 (예컨대, 민감도 및 특 이성에 기반하여) 전반적인 정확성을 위해 주석이 달린 데이터세트의 출력 벡터를 비교할 수 있다. 제2 출력 벡터가 제1 출력 벡터보다 더 정확하다는 결정에 응답하여(906의 \"예\" 분기), AI 시스템은 전문화된 CRC의 파라미터를 업데이트할 수 있다 . 예를 들어, AI 시스템은 전문화된 CRC의 예상 출력 벡터와 전문화 된 CRC의 실제 출력 벡터 사이의 오차를 계산하는 오류 함수를 적용할 수 있다. 이 예에서, AI 시스템은 전문화 된 CRC의 파라미터를 업데이트하기 위해 역전파 알고리즘에서 이 오류 함수를 사용할 수 있다. 전문화된 CRC의 파라미터를 업데이트한 후 또는 제2 출력 벡터가 제1 출력 벡터보다 더 정확하지 않다는 결정에 응답하여 (906의 \"아니오\" 분기), AI 시스템은 심장 EGM 스트립의 임의의 나머지 세그먼트 또는 제2 집단에 대 한 임의의 나머지 EGM 스트립이 있는지 여부를 결정할 수 있다 . 심장 EGM 스트립의 하나 이상의 나머지 세그먼트 또는 제2 집단에 대한 나머지 EGM 스트립이 있는 경우 (910의 \"예\" 분기), AI 시스템은 현재 세그먼트 및/또는 심장 EGM 스트립과 같이 제2 집단에 대한 다른 세그먼트 또는 EGM 스트립으로 작업 (902-910)을 반복할 수 있다. 그렇지 않은 경우 (910의 \"아니오\" 분기), 도 9의 훈련 동작은 종료될 수 있다. 이러한 방식으로 전문화된 CRC를 훈련하는 것은 전문화된 CRC에 의해 생성된 출력 벡터의 정확도가 일반화된 CRC에 의해 생성된 출력 벡터의 정확도보다 나쁘지 않다는 것을 보장하는 데 도움이 될 수 있다. 더욱이, 이러 한 방식으로 전문화된 CRC를 훈련하는 것은 EGM 스트립의 모든 세그먼트에 대해 전문화된 CRC를 훈련하는 것보 다 더 효율적이고 더 적은 계산 자원을 소비할 수 있다. 일부 예에서, AI 시스템은 그렇게 하기 위한 사용자 입력의 표시를 수신하는 것에 응답하여 전문화된 CRC를 훈 련하기 위한 프로세스를 수행하도록 구성된다. 예를 들어, AI 시스템은 AI 시스템이 특정 심장 EGM 스트립에 기 반하여 전문화된 CRC를 훈련할 것임을 나타내는 사용자 입력의 표시를 수신할 수 있다. 도 10은 본 개시내용의 기술에 따른 개인화된 출력 데이터의 생성을 위한 예시적인 동작을 예시하는 흐름도이다. 도 10의 예에서, AI 시스템은 현재 환자에 대한 심장 EGM 스트립을 수득할 수 있다 . 추가적 으로, AI 시스템은 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 개인화된 CRC를 적용할 수 있다 . 도 10의 예에서, 전문화된 CRC는 현재 환자로부터의 심장 EGM 스트립 훈련에 대해 훈련된다. 전문화된 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제1 데이터를 생성한다. 심장 리듬의 양태는 심장 부정맥, 심장 리듬의 형태학적 양태, 현재 환자의 R-R 간격, 또는 현재 환자의 심장 리듬의 다른 양태일 수 있다. 더욱이, 도 10의 예에서, AI 시스템은 현재 환자로부터의 초기 심장 EGM 스트립에 기반하여 전문화된 CRC에 의 해 생성된 이력 데이터 및 제1 데이터를 기반으로 출력 데이터를 생성한다 . 따라서, 도 10의 예에서, 전 문화된 CRC는 반드시 훈련되거나, 달리 더 큰 집단으로부터의 훈련 데이터를 기반으로 하는 것은 아니다. 오히 려, 전문화된 CRC는 현재 환자에 대한 훈련 데이터를 기반으로만 훈련될 수 있다. 일부 예에서, 출력 데이터는현재 환자의 심장 리듬의 양태의 경향을 나타낸다. 일부 예에서, 심장 EGM 스트립은 이벤트 이후의 것이고, 각 각의 초기 심장 EGM 스트립은 이벤트 이전의 것이다. 이 예에서, 출력 데이터는 이벤트 전후의 현재 환자의 심장 리듬의 양태의 비교를 포함한다. 예시적인 이벤트는 의료 장치의 이식, 수술 절차, 현재 환자가 복용하는 의약의 변화, 및 새로운 심장 부정맥의 발달 등을 포함할 수 있다. 도 11은 본 개시내용의 기술에 따라 컴퓨팅 시스템이 개인화된 출력 데이터를 생성하는 예를 예시하는 개념도이 다. 도 11은 도 10의 예시적인 동작과 일치한다. 도 11의 예에서, 부정맥 패턴 사전이 순전히 개별 환자로부 터의 데이터에 기반하여 모든 환자에 대해 구축된다. 단일 환자로부터의 모든 데이터는 신경망을 훈련하여 해당 환자의 이력에서 발생하는 심장 부정맥 및 정상 리듬을 스코어링하는 데 사용된다. 표준 분류기와 달리, 이러한 유형의 개인화된 CRC는 불리한 조건을 표시하는 데 가장 적합하지 않을 수 있다. 불리한 조건은 보다 일반화된 CRC에 의해 더 잘 식별될 수 있다. 그러나, 개인화된 CRC는 단일 환자에 대한 장기 데이터를 경향화하는 데 가 치있을 수 있다. 개인화된 CRC의 출력은 다양한 목적 중 하나 이상을 위해 사용될 수 있다. 예를 들어, 개인화된 CRC의 출력은 환자 자신의 기준선으로부터의 변화를 스코어링하고 경향화하는 데 사용될 수 있다. 예를 들어, 이 예에서, AI 시스템은 환자 에 모니터링 장치 (예컨대, 의료 장치 )를 이식한 후부터 환자 의 심장 리듬의 하나 이상의 양태에 관한 경향을 나타내는 출력 데이터를 생성할 수 있다. 이 예에서, 심장 리듬의 하나 이상의 양태 는 일정 기간 (예컨대, 1주)에 걸친 R-R 간격, 및 특정 심장 부정맥의 발생 빈도 등을 포함할 수 있다. 다른 예에서, 개인화된 CRC의 출력은 심장 부정맥의 이전에-검출된 발생의 형태학적 양태와 비교하여 심장 부정 맥의 검출된 발생의 하나 이상의 형태학적 양태에서의 변화를 검출하고 스코어링하는 데 사용될 수 있다. 예를 들어, 개인화된 CRC의 출력은 조기 심실 수축 (PVC)의 평균값 라인-길이의 변화를 검출하고 추적하는 데 사용될 수 있다. 다른 예에서, 개인화된 CRC의 출력은 수행된 의약 또는 새로운 절차에서의 변화의 함수로서 환자 데이 터의 변화를 예시할 수 있다. 단일 대상체의 데이터에 대해 훈련된 개인화된 CRC는 또한 더 큰 집단 모델과 비교하여 더 작은 계산 공간 (하 드웨어 및 소프트웨어)을 갖도록 설계될 수 있으므로, 모바일 장치 및 이식된 하드웨어와 같은 더 작은 하드웨 어 플랫폼에서 운영할 수 있다. 예를 들어, 일반화된 및 개인화된 CRC 둘 모두에 대한 기저 모델 아키텍처가 동 일한 경우 (예컨대, 50개의-레이어 잔여 신경망), 초기 레이어에 대한 모델 가중치는 두 모델에 대해 유사할 수 있다. 그러나, 마지막 몇 개의 레이어의 모델 가중치만 해당 환자 코호트에 대한 개인화된 CRC에 대해 훈련될 수 있다. 구현 측면에서, 일반화된 CRC 및 개인화된 CRC 둘 모두가 신경망의 초기 레이어에 상응하는 공통 계산 을 가지고 있는 경우, 일반화된 CRC로부터의 이러한 값을 (계산을 반복하는 대신) 개인화된 CRC에서 사용할 수 있으며, 개인화된 CRC는 마지막 몇 개의 신경망 레이어에만 상응하는 더 작은 계산 세트를 가질 수 있다. 일부 예에서, 개시내용의 기술은 본원에 설명된 임의의 방법을 수행하기 위한 수단을 포함하는 시스템을 포함한 다. 일부 예에서, 개시내용의 기술은 처리 회로로 하여금 본원에 설명된 임의의 방법을 수행하도록 하는 명령을 포함하는 컴퓨터-판독가능 매체를 포함한다. 다음은 본 개시내용의 하나 이상의 기술에 따른 예의 비-제한적인 목록이다. 실시예 1A. 방법으로서, 컴퓨터 시스템에 의해, 현재 환자에 대한 심장 전기도 (EGM) 스트립을 수득하는 단계; 컴퓨팅 시스템에 의해, 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제1 심장 리듬 분류기 신경망 (CRC)을 적용하는 단계이되, 여기서 제1 CRC는 복수의 환자를 포함하는 제1 집단으로부터의 심장 EGM 스트립 훈련에 대 해 훈련되고, 제1 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제1 데 이터를 생성하는, 단계; 컴퓨팅 시스템에 의해, 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 제2 CRC를 적용 하는 단계이되, 여기서 제2 CRC는 제1 집단보다 더 작은 제2 집단으로부터의 심장 EGM 스트립 훈련에 대해 훈련 되고, 제2 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제2 데이터를 생성하는, 단계; 및 컴퓨팅 시스템에 의해, 제1 데이터 및 제2 데이터에 기반하여 출력 데이터를 생성하는 단계 를 포함하는, 방법. 실시예 2A. 제1A항에 있어서, 여기서 제2 집단은 현재 환자로 이루어지는, 방법. 실시예 3A. 제1A항에 있어서, 여기서 제2 집단은 현재 환자와 하나 이상의 특성을 공유하는 환자의 코호트인 방 법. 실시예 4A. 제3A항에 있어서, 여기서 하나 이상의 특성은 환자의 코호트 및 현재 환자의 진단을 포함하는, 방법. 실시예 5A. 제3A항에 있어서, 여기서 방법은, 컴퓨팅 시스템에 의해, 입력으로서 심장 EGM 스트립을 갖는 제3 CRC를 적용하는 단계이되, 여기서 제3 CRC는 제1 집단으로부터의 훈련 심장 EGM 스트립에 기반하여 훈련되고, 현재 환자로부터의 훈련 심장 EGM 스트립에만 기반하여 추가로 훈련되는 제1 CRC의 버전이고, 제3 CRC는 심장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제3 데이터를 생성하는, 단계를 추가 로 포함하며, 출력 데이터를 생성하는 단계는 제1 데이터, 제2 데이터, 및 제3 데이터에 기반하여 출력 데이터 를 생성하는 단계를 포함하는, 방법. 실시예 6A. 제1A항에 있어서, 여기서 현재 환자의 심장 리듬의 양태는 현재 환자의 심장 리듬에서 심장 부정맥 의 발생의 발생이며, 제1 데이터는 심장 EGM 스트립의 세그먼트가 심장 부정맥의 1회 이상의 발생을 나타낼 제1 확률에 기반하고, 제2 데이터는 심장 EGM 스트립의 세그먼트가 심장 부정맥의 1회 이상의 발생을 나타낼 제2 확 률에 기반하는, 방법. 실시예 7A. 제1A항에 있어서, 여기서 현재 환자의 심장 리듬의 양태는 현재 환자의 심장 리듬에서 발생하는 심 장 부정맥의 발생의 형태학적 양태이고, 제1 데이터는 심장 EGM 스트립의 세그먼트에서 나타난 심장 부정맥의 발생의 형태학적 양태에 관한 제1 데이터를 포함하고, 제2 데이터는 심장 EGM 스트립의 세그먼트에서 나타난 심 장 부정맥의 발생의 형태학적 양태에 관한 제2 데이터를 포함하고, 출력 데이터는 발생의 형태학적 양태에 관한 제1 데이터 및 발생의 형태학적 양태에 관한 제2 데이터를 비교하는 데이터를 포함하는, 방법. 실시예 8A. 제1A항 내지 제7A항 중 어느 한 항에 있어서, 현재 환자로부터의 초기 심장 EGM 스트립에 기반하여 제2 CRC에 의해 생성된 이력 데이터에 대한 제2 데이터의 비교에 기반하여 제2 출력 데이터를 생성하는 단계를 추가로 포함하는, 방법. 실시예 9A. 제1A항 내지 제8A항 중 어느 한 항에 있어서, 여기서 제1 CRC는 출력 벡터를 생성하고, 상기 방법은 컴퓨팅 시스템에 의해, 제2 집단으로부터의 심장 EGM 스트립에만 기반하여 제1 CRC의 인스턴스를 훈련함으로써 제2 CRC를 생성하는 단계를 추가로 포함하며, 여기서 제2 CRC를 생성하는 단계는 제2 집단으로부터의 각각의 각 자의 심장 EGM 스트립의 각각의 각자의 세그먼트에 대해: 컴퓨팅 시스템에 의해, 제1 CRC를 각자의 심장 EGM 스 트립의 각자의 세그먼트에 적용하여, 각자의 심장 EGM 스트립에 대한 제1 출력 벡터를 생성하는 단계; 컴퓨팅 시스템에 의해, 제2 CRC를 각자의 심장 EGM 스트립의 각자의 세그먼트에 적용하여, 각자의 심장 EGM 스트립에 대한 제2 출력 벡터를 생성하는 단계; 컴퓨팅 시스템에 의해, 각자의 심장 EGM 스트립의 각자의 세그먼트에 대 한 제2 출력 벡터가 각자의 심장 EGM 스트립에 대한 제1 출력 벡터보다 더 정확한지 여부를 결정하는 단계; 컴 퓨팅 시스템에 의해, 심장 EGM 스트립에 대한 제2 출력 벡터가 각자의 심장 EGM 스트립에 대한 제1 출력 벡터보 다 더 정확한지 여부에 기반하여 제2 CRC의 파라미터를 업데이트하는 단계이되, 여기서 컴퓨팅 시스템은 심장 EGM 스트립에 대한 제2 출력 벡터가 각자의 심장 EGM 스트립에 대한 제1 출력 벡터보다 더 정확할 때 제2 CRC의 파라미터를 업데이트하도록 구성되고, 컴퓨팅 시스템은 심장 EGM 스트립에 대한 제2 출력 벡터가 각자의 심장 EGM 스트립에 대한 제1 출력 벡터보다 더 정확하지 않을 때 제2 CRC의 파라미터를 업데이트하지 않도록 구성되 는, 단계를 포함하는, 방법. 실시예 1B. 방법으로서, 컴퓨팅 시스템에 의해, 현재 환자에 대한 심장 EGM 스트립을 수득하는 단계; 컴퓨팅 시 스템에 의해, 입력으로서 심장 EGM 스트립의 세그먼트를 갖는 전문화된 심장 리듬 분류기 (CRC)를 적용하는 단 계이되, 여기서 전문화된 CRC는 현재 환자로부터의 심장 EGM 스트립 훈련에 대해 훈련되고, 전문화된 CRC는 심 장 EGM 스트립의 세그먼트에 기반하여, 현재 환자의 심장 리듬의 양태에 관한 제1 데이터를 생성하는, 단계; 컴 퓨팅 시스템에 의해, 현재 환자로부터의 초기 심장 EGM 스트립에 기반하여 전문화된 CRC에 의해 생성된 이력 데 이터 및 제1 데이터에 기반한 출력 데이터를 생성하는 단계를 포함하는, 방법. 실시예 2B. 제1B항에 있어서, 여기서 출력 데이터는 현재 환자의 심장 리듬의 양태의 경향을 나타내는, 방법. 실시예 3B. 제2B항에 있어서, 여기서 심장 리듬의 양태는 현재 환자의 R-R 간격인, 방법. 실시예 4B. 제2B항에 있어서, 여기서 심장 리듬의 양태는 심장 부정맥인, 방법. 실시예 5B. 제4B항에 있어서, 여기서 심장 리듬의 양태는 현재 환자의 심장 부정맥의 형태학적 양태인, 방법. 실시예 6B. 제2B항에 있어서, 여기서 심장 EGM 스트립은 이벤트 이후의 것이고, 각각의 초기 심장 EGM 스트립은 이벤트 이전의 것이며, 출력 데이터는 이벤트 전후의 현재 환자의 심장 리듬의 양태의 비교를 포함하는, 방법. 실시예 7B. 제6B항에 있어서, 여기서 이벤트는 의료 장치의 이식, 수술 절차, 현재 환자가 복용하는 의약의 변 화, 또는 새로운 심장 부정맥의 발달 중 하나인, 방법. 실시예 1C. 처리 회로 및 저장 매체를 포함하는 컴퓨팅 시스템으로서, 컴퓨팅 장치는 제1A항 내지 제7B항 중 어느 한 항의 방법을 수행하도록 구성되는, 컴퓨팅 시스템. 실시예 2C. 실행될 때 컴퓨팅 시스템으로 하여금 제1A항 내지 제7B항 중 어느 한 항의 방법을 수행하도록 하는 명령을 저장하고 있는 컴퓨터-판독가능 데이터 저장 매체. 실시예 3C. 명세서에 설명된 바와 같은 방법. 본원에 개시된 다양한 양태 및 실시예가 상세한 설명 및 첨부된 도면에 구체적으로 제시되는 조합들과는 상이한 조합으로 조합될 수 있음을 이해해야 한다. 또한, 실시예에 따라, 본원에 기재된 프로세스 또는 방법 중 임의의 것의 특정 동작 또는 이벤트가 상이한 순서로 수행될 수 있고, 첨가되거나, 병합되거나, 함께 제외될 수 있는 (예컨대, 모든 설명된 동작 또는 이벤트가 기술을 수행하는 데 필요하지 않을 수 있는) 것으로 이해해야 한다. 또한, 본 개시내용의 특정 양태는 명확성을 위해 단일 모듈, 유닛, 또는 회로에 의해 수행되는 것으로 설명되지 만, 본 개시내용의 기술은 예를 들어 의료 장치와 연관된 유닛, 모듈, 회로의 조합에 의해 수행될 수 있는 것으 로 이해해야 한다. 하나 이상의 예에서, 설명된 기술은 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 임의의 조합으로 구현될 수 있 다. 소프트웨어로 구현되는 경우, 기능들은 컴퓨터-판독가능 매체 상에 하나 이상의 명령들 또는 코드로서 저장 되어 하드웨어 기반 프로세싱 유닛에 의해 실행될 수 있다. 컴퓨터-판독가능 매체는 데이터 저장 매체 (예컨대, RAM, ROM, EEPROM, 플래시 메모리, 또는 명령들이나 데이터 구조들의 형태로 원하는 프로그램 코드를 저장하는 데 사용될 수 있고 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체)와 같은 유형의 매체에 대응하는 비-일시 적 컴퓨터-판독가능 매체를 포함할 수 있다. 명령은 하나 이상의 디지털 신호 프로세서(DSP), 범용 마이크로프로세서, 주문형 반도체(ASIC), 필드 프로그래 머블 로직 어레이(FPGA), 또는 다른 동등한 집적 또는 이산 논리 회로와 같은 하나 이상의 프로세서에 의해 실 행될 수 있다. 따라서, 본원에 사용된 바와 같은 \"프로세서\" 또는 \"처리 회로\"라는 용어는 전술한 구조의 임의 의 것, 또는 설명된 기술들의 구현에 적합한 임의의 다른 물리적 구조를 지칭할 수 있다. 또한, 기술은 하나 이 상의 회로 또는 논리 소자에서 완전히 구현될 수 있다. 다양한 실시예를 기재하였다. 이들 및 다른 실시예는 다음 청구범위의 범주 내에 있다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2021-7036994", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 개시내용의 기술에 따른 환자의 심장 리듬의 하나 이상의 양태를 분석하기 위한 시스템을 예시하는 블 록도이다. 도 2는 도 1의 시스템의 이식형 의료 장치 (IMD) 및 리드를 더 상세하게 예시하는 개념도이다. 도 3은 개시내용의 기술에 따른 예시적인 이식형 의료 장치의 블록도이다. 도 4는 본 개시내용의 하나 이상의 기술에 따라 동작하는 예시적인 컴퓨팅 장치를 예시하는 블록도이다. 도 5는 개시내용의 기술에 따른 예시적인 동작을 예시하는 흐름도이다. 도 6은 본 개시내용의 기술에 따른 개별 환자의 심장 전기도 (EGM)에 기반하여 일반화된 심장 리듬 분류기 (CRC)가 업데이트되는 예를 예시하는 개념도이다. 도 7은 본 개시내용의 기술에 따라 컴퓨팅 시스템이 일반화된 CRC 및 코호트-기반 CRC를 적용하는 예를 예시하 는 개념도이다. 도 8은 본 개시내용의 기술에 따라 컴퓨팅 시스템이 일반화된 CRC, 코호트-기반 CRC, 및 전문화된 CRC를 적용하 는 예시적인 동작을 예시하는 흐름도이다. 도 9는 본 개시내용의 기술에 따른 전문화된 CRC를 훈련하기 위한 예시적인 동작을 예시하는 흐름도이다. 도 10은 본 개시내용의 기술에 따른 개인화된 출력 데이터의 생성을 위한 예시적인 동작을 예시하는 흐름도이다. 도 11은 본 개시내용의 기술에 따라 컴퓨팅 시스템이 개인화된 출력 데이터를 생성하는 예를 예시하는 개념도이 다. 유사한 참조 부호는 도면 및 설명 전체에 걸쳐 유사한 요소를 지칭한다."}
