{"patent_id": "10-2021-0134083", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0050821", "출원번호": "10-2021-0134083", "발명의 명칭": "사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템 및 방법", "출원인": "큐리온코리아 주식회사", "발명자": "이우주"}}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통신망을 통해 쇼핑몰에서 판매하는 유무형 상품에 대한 사용자 경험 및 상품 가치 평가데이터에 기반하여 사용자 맞춤형 상품 분류 체계(이하, '사용자 경험/평가 기반 상품 분류 체계'라 한다)를 생성하는 상품 분류 체계생성 장치; 및상품 지향적 상품 카테고리에 기초한 상품 분류 UI(이하, '상품 지향적 상품 분류 UI'라 한다) 및 상기 상품 분류 체계 생성 장치에서 생성되는 사용자 경험/평가 기반 상품 분류 체계에 기초한 상품 분류 UI(이하, '사용자경험/평가 기반 상품 분류 UI'라 한다) 중 적어도 하나 혹은 그 일부를 사용자 단말기에게 제공하는 상품 분류IF 제공 장치;를 포함하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 상품 분류 체계 생성 장치는,상기 유무형 상품에 대한 사용자 경험 및 평가데이터를 수집하여 상품 별로 데이터베이스에 저장하는 데이터 수집 엔진;상기 데이터베이스에 저장된 사용자 경험 및 평가데이터를 분석하여 개체명 및 상기 개체명과 연관된 서술어 또는 구절을 추출하고, 추출된 다수의 개체명과 서술어 또는 구절을 유무형 상품 혹은 상품 지향적 카테고리 별로분류 및 매핑하여 상기 사용자 경험/평가 기반 상품 분류 체계를 상품 및 상품 지향적 카테고리 별로 생성하고,통합하여 전체의 사용자 경험/평가 기반 상품 분류 체계를 생성하는 상품 분류 체계 생성 엔진; 및상기 상품 분류 체계 생성 엔진에서 생성된 사용자 경험/평가 기반 상품 분류 체계를 이루는 각 노드와 상품,상품 지향적 카테고리 간의 연관도를 산출하는 연관도 산출 엔진;을 포함하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 상품 분류 체계 생성 엔진은,상기 추출된 개체명이 소속된 개체명 클래스를 최상위 분류노드로 분류하고, 상기 추출된 개체명을 상기 개체명클래스의 하위 분류노드로 분류하고, 상기 추출된 개체명에 매핑된 서술어 또는 구절을 상기 추출된 개체명의하위 분류노드로 분류하여 상기 사용자 경험/평가 기반 상품 분류 체계를 생성하는 것을 특징으로 하는 사용자경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 연관도 산출 엔진은,상기 사용자 경험/평가 기반 상품 분류 체계를 이루는 분류노드들인 [개체명, 서술어 및 구절]과, 상기 노드들중 개체명의 상품 노드들인 [상품명, 상품 카테고리] 간의 연관도를 산출하는 것을 특징으로 하는 사용자 경험공개특허 10-2023-0050821-3-및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 상품 분류 IF 제공 장치는,상기 사용자 단말기를 통해 쇼핑몰에 접속한 사용자의 검색 패턴, 탐색 패턴 및 쇼핑 패턴 중 적어도 하나에 기초하여 상기 상품 지향적 상품 카테고리에 기초한 상품 분류 체계(이하, '상품 지향적 상품 분류 체계'라 한다)및 사용자 경험/평가 기반 상품 분류 체계 중 적어도 하나 혹은 그 일부 혹은 변형된 일부 를 추천하는 상품 분류 추천부; 및상기 상품 지향적 상품 분류 UI 및 사용자 경험/평가 기반 상품 분류 UI 중 상기 상품 분류 추천부에서 추천되는 상품 분류 체계에 대응하는 UI를 상기 사용자 단말기에게 제공하는 상품 분류 UI 제공부;를 포함하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 상품 분류 추천부는,상기 사용자가 쇼핑몰에 최초 접속한 경우 상기 상품 지향적 상품 분류 체계 및 사용자 경험/평가 기반 상품 분류 체계를 모두 혹은 일부 혹은 변형된 일부 를 추천하고, 상기 상품 분류 UI 제공부는,상기 상품 지향적 상품 분류 체계에 대응하는 상품 지향적 상품 분류 UI 및 상기 사용자 경험/평가 기반 상품분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류 UI를 모두 혹은 일부 혹은 변형된 일부 를 사용자 단말기에게 제공하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 상품 분류 추천부는,상기 사용자가 쇼핑몰에서 검색한 검색어가 사전에 분류된 개체명이거나 개체명과 수학적, 통계학적으로 연관된경우, 상기 사용자 경험/평가 기반 상품 분류 체계를 추천하고, 상기 상품 분류 UI 제공부는,상기 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류 UI를 사용자 단말기에게 제공하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항 및 제7항 중 어느 한 항에 있어서,상기 상품 분류 추천부는,상품분류체계를 추천하고, 상품분류체계 내에서 제품의 랭킹을 제공하는 경우 상품분류체계 내 각 노드와 상품,상품 지향적 카테고리 간의 연관도를 참조하여 제공하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유공개특허 10-2023-0050821-4-무형 상품 분류 체계 생성 및 제공 시스템."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "유무형 상품 분류 체계 생성 및 제공하는 방법에 있어서,(A) 상품 분류 체계 생성 장치가, 통신망을 통해 쇼핑몰에서 판매하는 유무형 상품에 대한 사용자 경험 및 상품가치 평가데이터에 기반하여 사용자 맞춤형 상품 분류 체계(이하, '사용자 경험/평가 기반 상품 분류 체계'라한다)를 생성하는 단계; 및(B) 상품 분류 IF 제공 장치가, 상품 지향적 상품 카테고리에 기초한 상품 분류 UI(이하, '상품 지향적 상품 분류 UI'라 한다) 및 상기 (A) 단계에서 생성되는 사용자 경험/평가 기반 상품 분류 체계에 기초한 상품 분류 UI(이하, '사용자 경험/평가 기반 상품 분류 UI'라 한다) 중 적어도 하나 혹은 일부 혹은 변형된 일부 를 사용자단말기에게 제공하는 단계;를 포함하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 (A) 단계는,(A1) 상기 유무형 상품에 대한 사용자 경험 및 평가데이터를 수집하여 상품 별로 데이터베이스에 저장하는단계;(A2) 상기 데이터베이스에 저장된 사용자 경험 및 평가데이터를 분석하여 개체명 및 상기 개체명과 연관된 서술어 또는 구절을 추출하고, 추출된 다수의 개체명과 서술어 또는 구절을 유무형 상품 혹은 상품 카테고리 별로분류 및 매핑하여 상기 사용자 경험/평가 기반 상품 분류 체계를 상품 혹은 상품 카테고리 별로 생성하는 단계;및(A3) 상기 (A2) 단계에서 생성된 사용자 경험/평가 기반 상품 분류 체계를 이루는 각 노드들 간의 연관도를 산출하는 단계;을 포함하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 (A2) 단계는,상기 추출된 개체명이 소속된 개체명 클래스를 최상위 분류노드로 분류하고, 상기 추출된 개체명을 상기 개체명클래스의 하위 분류노드로 분류하고, 상기 추출된 개체명에 매핑된 서술어 또는 구절을 상기 추출된 개체명의하위 분류노드로 분류하여 상기 사용자 경험/평가 기반 상품 분류 체계를 생성하는 것을 특징으로 하는 사용자경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 (A3) 단계는,상기 사용자 경험/평가 기반 상품 분류 체계를 이루는 분류노드들인 [개체명, 서술어, 구절]과, 상기 노드들 중개체명의 상품 노드들인 [상품명, 상품 지향 상품 카테고리] 간의 연관도를 산출하는 것을 특징으로 하는 사용공개특허 10-2023-0050821-5-자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 (B) 단계는,(B1) 상기 사용자 단말기를 통해 쇼핑몰에 접속한 사용자의 검색 패턴, 탐색 패턴 및 쇼핑 패턴 중 적어도 하나에 기초하여 상기 상품 지향적 상품 카테고리에 기초한 상품 분류 체계(이하, '상품 지향적 상품 분류 체계'라한다) 및 사용자 경험/평가 기반 상품 분류 체계 중 적어도 하나 혹은 일부 혹은 변형된 일부 를 추천하는단계;(B2) 상기 상품 지향적 상품 분류 UI 및 사용자 경험/평가 기반 상품 분류 UI 중 상기 (B1) 단계에서 추천되는상품 분류 체계에 대응하는 UI를 상기 사용자 단말기에게 제공하는 단계;를 포함하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 사용자가 쇼핑몰에 최초 접속한 경우, 상기 (B1) 단계는, 상기 상품 지향적 상품 분류 체계 및 사용자 경험/평가 기반 상품 분류 체계를 모두 혹은 일부 혹은 변형된 일부를 추천하고,상기 (B2) 단계는, 상기 상품 지향적 상품 분류 체계에 대응하는 상품 지향적 상품 분류 UI 및 상기 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류 UI를 모두 혹은 일부 혹은 변형된일부를 사용자 단말기에게 제공하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계생성 및 제공 방법."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 사용자가 쇼핑몰에서 검색한 검색어가 사전에 분류된 개체명이거나 개체명과 수학적 통계학적으로 연관된경우, 상기 (B1) 단계는, 상기 사용자 경험/평가 기반 상품 분류 체계를 추천하고,상기 (B2) 단계는, 상기 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류UI를 사용자 단말기에게 제공하는 것을 특징으로 하는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법."}
{"patent_id": "10-2021-0134083", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항 및 제15항 중 어느 한 항에 있어서, 상품 분류 체계 추천하거나, 상품 분류 체계의 랭킹 혹은 분류 체계 내에서 상품의 추천 랭킹을 제공하는 경우,상품분류체계 내 각 노드와 상품, 상품 지향적 카테고리 간의 연관도를 참조하여 제공하는 것을 특징으로 하는사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법."}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템 및 방법이 제공된다. 상품 분류 체계 생성 장치는 통신망을 통해 쇼핑몰에서 판매하는 유무형 상품에 대한 사용자 경험 및 상품 가치 평가데이터에 기 반하여 사용자 맞춤형 상품 분류 체계(이하, '사용자 경험/평가 기반 상품 분류 체계'라 한다)를 생성하고, 상품 분류 IF 제공 장치는 상품 지향적 상품 카테고리에 기초한 상품 분류 UI(이하, '상품 지향적 상품 분류 UI'라 한 다) 및 상기 상품 분류 체계 생성 장치에서 생성되는 사용자 경험/평가 기반 상품 분류 체계에 기초한 상품 분류 UI(이하, '사용자 경험/평가 기반 상품 분류 UI'라 한다) 중 적어도 하나 혹은 일부를 사용자 단말기에게 제공한 다."}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템 및 방법에 관한 것으로서, 보다 상세하게는, 유무형 상품과 관련된 사용자의 평가 또는 직간접 경험데이터에 기반하여 사용자 맞춤형 상품 분류 체계를 생성할 수 있는 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전통적으로 인터넷 쇼핑몰 또는 홈쇼핑에서 제공하는 유무형 상품은 전자제품, 의류, 가구 등과 같이 상품 지향 적인 계층적 상품 카테고리 형태, 즉, 상품을 기준으로 하는 관점의 계층적 분류 기준으로 분류되고, 각종 쇼핑 서비스에서는 그 분류 기준으로 사용자들에게 상품들을 분류 탐색 및 검색하도록 제시하고 있다. 그러나, 특정 상품의 경우 기존의 전통적인 상품 카테고리명으로는 소비자가 제품명을 찾기 힘든 경우가 있다. 예를 들어, 장난감 카테고리의 경우 굉장히 많은 하위 종류의 제품들이 있는데, 소비자들은 보통 장난감 하위 종류의 제품명 또는 하위 카테고리들을 모두 인지하기는 어려우므로 소비자가 직접 원하는 제품을 찾기가 힘들 다. 마찬가지로 전자제품 중에 TV나 냉장고 같은 카테고리는 소비자가 찾기 쉬운 반면, USB(Universal Serial Bus) 멀티충전기, 사운드바와 같이 인지도가 낮은 카테고리나 제품은 존재 여부 자체를 소비자가 쉽게 인지하지 못 하는 경우가 많다. 또 다른 예로, AAA 바이크라는 자전거의 브랜드나 제품명의 인지도는 상대적으로 낮지만, 이 자전거자 소비자에게 주는 가치는 '넘어져도 다치지 않는 자전거'로 그 가치가 명확한 경우, 소비자 는 해당 자전거의 브랜드나 제품명을 모른다는 이유로 제품을 검색하는데 어려움을 겪게 된다. 또한, 제품 생산자나 판매자는 상품을 판매하기 위해 브랜드나 상품이 속하는 기존의 전통적 상품 카테고리를 알리기 위한 홍보에 많은 노력과 비용을 들여야 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내 공개특허 제10-2021-0041185호(공개일자 2021년 04월 15일)"}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위하여 본 발명이 이루고자 하는 기술적 과제는, 제품의 브랜드나 상품 관점의 분류 체계보다 제품이 주는 가치에 기반하여 소비자가 제품에 쉽게 접근할 수 있도록 하는 사용자 경험 및 평가에 기 반한 유무형 상품 분류 체계 생성 및 제공 시스템 및 방법을 제시하는 데 있다. 본 발명의 해결과제는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 해결과제들은 아래의 기 재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 기술적 과제를 해결하기 위한 수단으로서, 본 발명의 실시 예에 따르면, 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템은, 통신망을 통해 쇼핑몰에서 판매하는 유무형 상품에 대한 사용자 경험 및 상품 가치 평가데이터에 기반하여 사용자 맞춤형 상품 분류 체계(이하, '사용자 경험/평가 기반 상품 분류 체계'라 한다)를 생성하는 상품 분류 체계 생성 장치; 및 상품 지향적 상품 카테고리에 기초한 상품 분류 UI(이하, '상품 지향적 상품 분류 UI'라 한다) 및 상기 상품 분류 체계 생성 장치에서 생성되는 사용자 경험/평 가 기반 상품 분류 체계에 기초한 상품 분류 UI(이하, '사용자 경험/평가 기반 상품 분류 UI'라 한다) 중 적어도 하나 또는 그 일부를 사용자 단말기에게 제공하는 상품 분류 IF 제공 장치;를 포함한다. 상기 상품 분류 체계 생성 장치는, 상기 유무형 상품에 대한 사용자 경험 및 평가데이터를 수집하여 상품 별로 데이터베이스에 저장하는 데이터 수집 엔진; 상기 데이터베이스에 저장된 사용자 경험 및 평가데이터를 분석하 여 개체명 및 상기 개체명과 연관된 서술어 또는 구절을 추출하고, 추출된 다수의 개체명과 서술어 또는 구절을 유무형 상품 별로 분류 및 매핑하여 상품이 속할 수 있는 상기 사용자 경험/평가 기반 상품 분류 체계를 상품 별로 생성하고 이를 통합하여 사용자 경험 및 평가 분류 체계를 구성하는 상품 분류 체계 생성 엔진; 및 상기 상품 분류 체계 생성 엔진에서 생성된 사용자 경험/평가 기반 상품 분류 체계를 이루는 각 노드들과 상품 및 상 품 지향적 상품 카테고리 노드 간의 연관도를 산출하는 연관도 산출 엔진;을 포함한다. 상기 상품 분류 체계 생성 엔진은, 상기 추출된 개체명이 소속된 개체명 클래스를 최상위 분류노드로 분류하고, 상기 추출된 개체명을 상기 개체명 클래스의 하위 분류노드로 분류하고, 상기 추출된 개체명에 매핑된 서술어 또는 구절을 상기 추출된 개체명의 하위 분류노드로 분류하여 상기 사용자 경험/평가 기반 상품 분류 체계를 생 성한다. 이러한 분류 구조는 사용되는 개체명 인식기에 따라 다양한 계층 형태를 구성할 수 있다. 상기 연관도 산출 엔진은, 상기 사용자 경험/평가 기반 상품 분류 체계를 이루는 분류노드들인 [개체명, 서술어, 구절]과, 상기 노드들 중 개체명의 상품노드들인 [상품명, 상품 카테고리] 간의 연관도를 산출한다. 상기 상품 분류 IF 제공 장치는, 상기 사용자 단말기를 통해 쇼핑몰에 접속한 사용자의 검색 패턴, 탐색 패턴 및 쇼핑 패턴 중 적어도 하나에 기초하여 상기 상품 지향적 상품 카테고리에 기초한 상품 분류 체계(이하, '상 품 지향적 상품 분류 체계'라 한다) 및 사용자 경험/평가 기반 상품 분류 체계 중 적어도 하나를 추천하는 상품 분류 추천부; 및 상기 상품 지향적 상품 분류 UI 및 사용자 경험/평가 기반 상품 분류 UI 중 상기 상품 분류 추 천부에서 추천되는 상품 분류 체계에 대응하는 UI를 상기 사용자 단말기에게 제공하는 상품 분류 UI 제공부;를 포함한다. 상기 상품 분류 추천부는, 상기 사용자가 쇼핑몰에 최초 접속한 경우 상기 상품지향적 상품 분류 체계 및 사용 자 경험/평가 기반 상품 분류 체계를 모두 추천하거나 혹은 사용자의 과거 검색/탐색/쇼핑 패턴에 기반하여 특 정 분류 체계를 추천 알고리즘에 기반하여 추천할 수 있다. 상기 상품 분류 UI 제공부는, 상기 상품 지향적 상 품 분류 체계에 대응하는 상품 지향적 상품 분류 UI 및 상기 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류 UI를 모두 혹은 선택적으로 일부 추천하여 사용자 단말기에게 제공한다. 상기 상품 분류 추천부는, 상기 사용자가 쇼핑몰에서 검색한 검색어가 사전에 분류된 개체명이거나 혹은 개체명 과 수학적, 통계학적으로 연관이 되는 경우, 상기 사용자 경험/평가 기반 상품 분류 체계를 추천하고, 상기 상 품 분류 UI 제공부는, 상기 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분 류 UI를 사용자 단말기에게 제공한다. 상기 상품 분류 추천부는, 상기 사용자가 쇼핑몰에서 검색한 검색어가 상품명 및 상품 카테고리 중 하나이거나 상품 카테고리와 수학적, 통계학적으로 연관이 되는 경우 상기 상품 지향적 상품 분류 체계 및 변형된 사용자 경험/평가 기반 상품 분류 체계 중 적어도 하나 혹은 일부를 추천하고, 상기 상품 분류 UI 제공부는, 상기 상품 지향적 상품 분류 체계에 대응하는 상품 지향적 상품 분류 UI 및 상기 변형된 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류 UI 중 적어도 하나 혹은 일부를 사용자 단말기에게 제공하며, 상기 변형된 사용자 경험/평가 기반 상품 분류 체계는, 상기 검색한 검색어에 해당하거나 연관된 상 품 카테고리를 상위 노드로 분류하고, 상기 사용자 경험/평가 기반 상품 분류 체계의 최하위 분류노드와 상기 검색어를 연결하여 생성되는 구절을 상기 상위 분류노드의 하위 분류노드로 분류한 체계이다. 혹은 다른 전체 상품 기반의 사용자 경험/평가 기반 상품 분류 체계가 아닌 특정 상품(ex. TV, 선반) 내의 상품들로만 구성된 사용자 경험/평가 기반 상품 분류 체계이다. 한편, 본 발명의 다른 실시 예에 따르면, 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법은, (A) 상품 분류 체계 생성 장치가, 통신망을 통해 쇼핑몰에서 판매하는 유무형 상품에 대한 사용자 경험 및 상품 가치 평가데이터에 기반하여 사용자 맞춤형 상품 분류 체계(이하, '사용자 경험/평가 기반 상품 분류 체계'라 한다)를 생성하는 단계; 및 (B) 상품 분류 IF 제공 장치가, 상품 지향적 상품 카테고리에 기초한 상품 분류 UI(이하, '상품 지향적 상품 분류 UI'라 한다) 및 상기 (A) 단계에서 생성되는 사용자 경험/평가 기반 상 품 분류 체계에 기초한 상품 분류 UI(이하, '사용자 경험/평가 기반 상품 분류 UI'라 한다) 중 적어도 하나를 사용자 단말기에게 제공하는 단계;를 포함한다. 상기 (A) 단계는, (A1) 상기 유무형 상품에 대한 사용자 경험 및 평가데이터를 수집하여 상품 별로 데이터베이 스에 저장하는 단계; (A2) 상기 데이터베이스에 저장된 사용자 경험 및 평가데이터를 분석하여 개체명 및 상기 개체명과 연관된 서술어 또는 구절을 추출하고, 추출된 다수의 개체명과 서술어 또는 구절을 유무형 상품 별로 분류 및 매핑하여 상기 사용자 경험/평가 기반 상품 분류 체계를 상품 별로 생성 추출하고 이를 통합하여 사용 자 경험/평가 기반 분류 체계를 구축하는 단계; 및 (A3) 상기 (A2) 단계에서 생성된 사용자 경험/평가 기반 상 품 분류 체계를 이루는 각 노드들과 상품 및 상품 지향적 상품 카테고리 노드간의 연관도를 산출하는 단계;을 포함한다. 상기 (A2) 단계는, 상기 추출된 개체명이 소속된 개체명 클래스를 최상위 분류노드로 분류하고, 상기 추출된 개 체명을 상기 개체명 클래스의 하위 분류노드로 분류하고, 상기 추출된 개체명에 매핑된 서술어 또는 구절을 상 기 추출된 개체명의 하위 분류노드로 분류하여 상기 사용자 경험/평가 기반 상품 분류 체계를 생성한다. 상기 (A3) 단계는, 상기 사용자 경험/평가 기반 상품 분류 체계를 이루는 분류노드들인 [개체명, 서술어, 구 절]과, 상기 노드들 중 개체명의 상품 노드들인 [상품명, 상품 카테고리] 간의 연관도를 산출한다. 상기 (B) 단계는, (B1) 상기 사용자 단말기를 통해 쇼핑몰에 접속한 사용자의 검색 패턴, 상품 분류 체계 탐색 패턴 및 쇼핑 패턴 중 적어도 하나에 기초하여 상기 상품 지향적 상품 카테고리에 기초한 상품 분류 체계(이하, '상품 지향적 상품 분류 체계'라 한다) 및 사용자 경험/평가 기반 상품 분류 체계 중 적어도 하나 혹은 일부를 추천하는 단계; (B2) 상기 상품 지향적 상품 분류 UI 및 사용자 경험/평가 기반 상품 분류 UI 중 상기 (B1) 단 계에서 추천되는 상품 분류 체계에 대응하는 UI를 상기 사용자 단말기에게 제공하는 단계;를 포함한다. 상기 사용자가 쇼핑몰에 최초 접속한 경우, 상기 (B1) 단계는, 상기 상품 지향적 상품 분류 체계 및 사용자 경 험/평가 기반 상품 분류 체계를 모두 추천하거나 혹은 사용자의 과거 쇼핑 행동 이력에 따라 적절한 한 개 또는 분류 체계의 일부를 추천 알고리즘을 통해 선택적으로 추천하고 , 상기 (B2) 단계는, 상기 상품 지향적 상품 분 류 체계에 대응하는 상품 지향적 상품 분류 UI 및 상기 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용 자 경험/평가 기반 상품 분류 UI를 모두 혹은 (B1) 단계에서 선택된 한 개나 일부분 분류 UI를 사용자 단말기에 게 제공한다. 상기 사용자가 쇼핑몰에서 검색한 검색어가 사전에 분류된 사용자 경험/평가 기반의 개체명이거나 이와 통계적 수학적으로 연관된 경우, 상기 (B1) 단계는, 상기 사용자 경험/평가 기반 상품 분류 체계 전체 혹은 일부분을 추천하고, 상기 (B2) 단계는, 상기 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류 UI를 사용자 단말기에게 제공한다. 또한, 상기 사용자가 쇼핑몰에서 검색한 검색어가 상품명 및 상품 카테고리 중 하나이거나 통계적 수학적으로 연관된 경우, 상기 (B1) 단계는, 상기 상품 지향적 상품 분류 체계 및 변형된 사용자 경험/평가 기반 상품 분류 체계 중 적어도 하나 또는 일부를 추천하고, 상기 (B2) 단계는, 상기 상품 지향적 상품 분류 체계에 대응하는 상품 지향적 상품 분류 UI 및 상기 변형된 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류 UI 중 적어도 하나 또는 일부를 사용자 단말기에게 제공하며, 상기 변형된 사용자 경험/평가 기 반 상품 분류 체계는, 상기 검색한 검색어에 해당하는 상품 카테고리를 상위 노드로 분류하고, 상기 사용자 경 험/평가 기반 상품 분류 체계의 최하위 분류노드와 상기 검색어를 연결하여 생성되는 구절을 상기 상위 분류노 드의 하위 분류노드로 분류한 체계이다. 변형된 사용자 경험/평가 기반 상품 분류 체계의 다른 실시 예는 전체 상품 기반의 사용자 경험/평가 기반 상품 분류 체계가 아닌 특정 상품(ex. TV, 선반) 내의 상품들로만 구성된 사용자 경험/평가 기반 상품 분류 체계이다."}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 유무형 상품과 관련된 사용자의 경험 또는 평가데이터에 기반하여 사용자 맞춤형 상품 분류 체계를 생성하여 사용자에게 제공함으로써 사용자가 상품 가치를 기반으로 상품을 검색 및 탐색할 수 있으며, 이로써 제품의 브랜드나 제품명, 또는 제품이 속하는 상품 카테고리를 모르는 경우에도 원하는 상품을 검색 및 탐색하는 것이 가능하다. 또한, 본 발명에 따르면, 기존의 상품 지향적 상품 카테고리와 본 발명에서 제공하는 사용자 맞춤형 상품 분류 체계를 선택적으로 제공함으로써 사용자 편의성을 향상시킬 수 있다. 또한, 본 발명에 따르면, 기존에 상품 리뷰를 분석하는 기술은 다수 존재했지만, 그런 기술들은 상품을 설명하"}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "는 하위 속성(쇼핑몰의 '리뷰 요약' 기능) 정보를 추출하는 목적으로 사용되었으나, 본 발명은 상품의 리뷰 분석 결과가 상품 하위가 아닌 상품 상위의 분류 체계로 구성되어 사용됨으로써 사용자가 필요로 하는 상품에 대 한 기대, 평가 등에 관련된 상품 카테고리를 제공할 수 있다."}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "본 발명의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0134083", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시 예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시 예를 설명함에 있어, 관련된 공지 구성 또는 기능 에 대한 구체적인 설명이 본 발명의 실시 예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생 략한다. 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되 는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동 일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지 는 의미와 일치하는 의미를 가진 것으로 해석될 수 있다. 또한, 도 1에 도시된 상품 분류 체계 생성 장치 및 상품 분류 IF 제공 장치는 일체형 컴퓨팅 장치로 구현되거나 독립된 컴퓨팅 장치로 구현될 수 있다. 독립된 컴퓨팅 장치로 구현되는 경우, 상품 분류 체계 생성 장치와 상품 분류 IF 제공 장치는 네트워크 통신을 위한 통신 회로(미도시)를 포함할 수 있다. 통신 회로는 무선 통신 회로(예: 셀룰러 통신 회로, 근거리 무선 통신 회로, 또는 GNSS(global navigation satellite system) 통신 회로) 또는 유선 통신 회로(예: LAN(local area network) 통신 회로, 또는 전력선 통 신 회로)를 포함하고, 그 중 해당하는 통신 회로를 이용하여 블루투스, WiFi direct 또는 IrDA(infrared data association) 같은 근거리 통신 네트워크 또는 셀룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크와 같은 원거리 통신 네트워크를 통하여 외부 전자 장치와 통신할 수 있다. 상술한 여러 종류의 통신 회로는 하나의 칩으로 구 현되거나 또는 각각 별도의 칩으로 구현될 수 있다. 또한, 상품 분류 체계 생성 장치와 상품 분류 IF 제공 장치는 각각 적어도 하나의 프로세서를 포함할 수 있고, 적어도 하나의 프로세서에 의해 실행되는 명령어들을 포함하는 메모리를 더 포함할 수도 있다. 적어도 하나의 프로세서는 ASIC(Application Specific Integrated Circuit), DSP(Digital Signal Processor), PLD(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), CPU(Central Processing unit), 마이크로컨트롤러(microcontrollers) 및/또는 마이크로프로세서(microprocessors) 등의 처리장치 중 적어도 하 나로 구현될 수 있다. 메모리는 플래시 메모리(flash memory), 하드디스크(hard disk), SSD(Solid State Disk), SD 카드(Secure Digital Card), RAM(Random Access Memory), SRAM(Static Random Access Memory), ROM(Read Only Memory), PROM(Programmable Read Only Memory), EEPROM(Electrically Erasable and Programmable ROM), EPROM(Erasable and Programmable ROM), 레지스터(register), 착탈형 디스크 및 웹 스토리지(web storage) 등 의 저장매체(기록매체) 중 적어도 하나로 구현될 수 있다. 도 1은 본 발명의 실시 예에 따른 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템을 도시한 도면이다. 도 1을 참조하면, 본 발명의 실시 예에 따른 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제 공 시스템은 상품 분류 체계 생성 장치 및 상품 분류 IF 제공 장치를 포함한다. 상품 분류 체계 생성 장치는 쇼핑몰에서 판매하는 유무형 상품에 대한 사용자 경험 및 상품 가치 평가데이 터에 기반하여 사용자 맞춤형 상품 분류 체계(이하, '사용자 경험/평가 기반 상품 분류 체계'라 한다)를 생성하 고, 생성된 사용자 경험/평가 기반 상품 분류 체계에 관련 상품들을 매핑할 수 있다. 사용자 경험/평가 기반 상품 분류 체계는 사용자 경험 또는 평가 지향적으로 상품 카테고리를 분류한 것이다. 쇼핑몰은 통신망을 통해 유무형 상품을 판매하는 홈쇼핑, 인터넷 쇼핑몰 등을 예로 들 수 있으며, 유무형 상품 은 전자제품, 가구 등의 유형 상품과, 청소 용역, 아이 돌봄 용역 등 서비스와 관련된 무형 상품을 포함한다. 상품 분류 체계 생성 장치는 데이터 수집 엔진, 상품 분류 체계 생성 엔진 및 연관도 산출 엔진 을 포함한다. 데이터 수집 엔진은 유무형 상품에 대한 사용자 경험 및 평가데이터를 수집하여 상품 별로 데이터베이스 (미도시)에 저장한다. 데이터 수집 엔진은 상품 리뷰, 블로그, 인터넷 웹페이지(예를 들어, 개인 홈페이 지, 웹카페 등), SNS(Social Network Service) 같은 텍스트 데이터 혹은 음성 또는 유튜브 등의 동영상 데이터 로부터 변환된 텍스트 데이터로부터 사용자 경험 및 평가데이터(이하, '사용자 텍스트데이터'라 한다)를 수집할 수 있다. 상품 분류 체계 생성 엔진은 데이터베이스(미도시)에 저장된 사용자 경험 및 평가데이터를 분석하여 개체 명을 인식 및 추출하고, 추출된 개체명과 연관된 서술어 또는 구절을 추출한다. 상품 분류 체계 생성 엔진 은 추출된 다수의 개체명들과 서술어 또는 구절들을 상품 별로 분류 및 매핑하여 사용자 경험/평가 기반 상품 분류 체계를 상품 별로 생성하고, 이를 다시 개체명 분류 체계를 기준으로 상품들을 하위에 구성하여 전체 사용자 경험 및 평가 기반 상품 분류 체계를 구성한다. 즉, 상품 분류 체계 생성 엔진은 수집된 사 용자 경험 및 평가데이터에서 단어(즉, 개체명), 서술어, 구절을 추출한 후 구분 및 분류하여 사용자 경험/평가 기반 상품 분류 체계를 상품 별로 생성한 후 이를 다시 통합하여 전체 분류 체계를 구성한다. 단어, 서술 어, 구절을 추출, 구분 및 분류하는 기술은 자연어 처리 및 자연어 인공지능 분야에서 다양하게 연구되고 있다. 도 2는 도 1에 도시된 상품 분류 체계 생성 엔진을 도시한 블록도이다. 도 2를 참조하면, 상품 분류 체계 생성 엔진은 형태소 분석부, 개체명 인식부, 청킹 및 구문 분 석부 및 상품 분류 체계 생성부를 포함할 수 있다. 형태소 분석부는 데이터베이스(미도시)에 저장된 사용자 경험 및 평가데이터에서 명사, 동사, 형용사 등의 단어들을 분리한다. 개체명 인식부는 형태소 분석부에서 형태소 별로 분리된 단어들이 사전에 정의된 개체명에 해당하는 지 인식하고, 개체명에 해당하는 단어가 속하는 개체명 클래스를 분류할 수 있다. 이를 위해 개체명 인식부 는 사전에 분류된 개체명 클래스들과 각 개체명 클래스에 소속되는 개체명이 정의된 개체명 테이블을 이용 한다. 이 때 동일한 단어라도 주변 문맥에 따라서 다른 개체명으로 분류하는 여러가지 기 개발된 알고리즘을 추 가로 사용할 수 있다. 개체명 클래스는 장소, 인물, 조직, 동물 등 개체명 인식을 위해 사전에 정의 및 분류되며, 개체명 인식 기술에 따라서 개체명 클래스의 종류는 변경될 수 있다. 예를 들어, MUC-6에서는 ‘PERSON’, ‘LOCATION’, ‘ ORGANIZATION’의 3개 분류를 사용하고 있으며, BBN(Bolt Beranek and Newman)은 29개의 분류를 정의하였으며, Sekine의 경우는 세밀한 다양한 하위 클래스를 포함하고 있는 개체명 클래스 계층 구조를 정의하고 있다. 이 클 래스 계층 구조는 향후에 새로이 개발될 수 있는 다양한 분류 체계를 가진 개체명 인식기에 의해 대체될 수 있 다. 또한, 개체명 클래스에 소속되는 개체명들은 쇼핑몰 내 유무형 상품을 실제로 사용하는 실제 소비자를 고려하여 분류될 수 있다. 예를 들어, 개체명 클래스가 인물인 경우, 인물에 대응하는 개체명은 아이, 남아, 여아, 아빠, 엄마, 할머니 등 다양한 소비자층으로 분류되고, 개체명 클래스가 장소인 경우, 개체명은 거실, 안방, 여 아방, 남아방, 부엌, 초등 교실 등으로 분류될 수 있다. 청킹 및 구문 분석부는 형태소 분석부에서 형태소 별로 분리된 단어들로부터 또는 데이터베이스(미도 시)에 저장된 사용자 경험 및 평가데이터로부터 의미있는 단위의 서술어, 구(phrase), 절(clause)을 분류할 수 있다. 의미있는 단위의 서술어 또는 구절은 서술어의 감정이나, 혹은 개체명이 없이 단일 서술어로 표현된 구 나 절도 포함할 수 있다. 상품 분류 체계 생성부는 121~123에서 추출된 상품별 분류 체계를 통합하여 사용자 경험/평가 기반 상품 분류 체계를 구성한다. 도 3은 형태소 분석부, 개체명 인식부 및 청킹 및 구문 분석부에서 생성된 단어(즉, 개체명)과 서술어, 구절을 통한 단어의 관계 추출의 예시도이다. 도 3을 참조하면, 수집된 데이터는 TV a, TV b, 크림 C라는 상품들의 상품 평가이다. 예를 들어, TV a의 상품 평가는 '거실에 설치했어요. 아빠가 좋아해요.'이다. 이 상품평가로부터 장소에 해당하는 '거실', 구절의 동사 에 해당하는 '설치하다', 사람에 해당하는 '아빠', 구절의 감정 동사에 해당하는 '좋아해요'가 추출 및 분류되 었다. 상품 분류 체계 생성부는 형태소 분석부, 개체명 인식부 및 청킹 및 구문 분석부에서 추출, 구분 또는 분류된 개체명, 서술어, 구절을 매핑하여 구문 관계를 통한 단어의 관계를 추출하고, 이를 개 체명 분류 구조를 기초로 전체를 통합하여, 이로써 사용자 맞춤형 상품 분류 체계, 즉, 사용자 경험/평가 기반 상품 분류 체계의 구조를 생성할 수 있다. 자세히 설명하면, 상품 분류 체계 생성부는 개체명 인식부에서 추출된 개체명(예를 들어, 화질)이 소 속된 개체명 클래스(예를 들어, 상품특성)를 개체명 테이블에서 확인하여 최상위 분류노드로 분류하고, 추출된 개체명(화질)을 개체명 클래스(상품특성)의 하위 분류노드로 분류하고, 추출된 개체명(화질)과 동일한 텍스트에 서 추출된 서술어 또는 구절 (예를 들어, 좋아요, 너무 좋아요, 화질이 좋아요)을 추출된 개체명(화질)의 하위 분류노드로 분류한 후 매핑하고, 전체를 통합하여 사용자 경험/평가 기반 상품 분류 체계를 생성할 수 있 다. 이러한 최상위 분류노드, 하위 분류노드는 도 7을 참조하여 후술한다. 이와 같이 상품 분류 체계 생성부는 도 3과 같이 추출 및 분류된 결과를 상품명 별로 매핑하여 도 7과 같 은 사용자 경험/평가 기반 상품 분류 체계를 생성할 수 있다. 도 7에 도시된 사용자 경험/평가 기반 상품 분류 체계의 구조에서 상품 특성, 미디어, 장소, 상품평가어는 개체명 클래스의 예이고, 화질은 상품특성이라는 개체명 클래스에 속하는 개체명의 예이고, 영화는 미디어라는 개체명 클래스에 속하는 개체명의 예이다. 또한, 사용자 경험/평가 기반 상품 분류 체계의 구조에서 예를 들어, '화질 -> 화질이 너무 좋아요'와 같 이 분류/추출된 구조는 하나의 동일한 상품 평가로부터 추출된 결과이다. 다시 도 1을 참조하면, 연관도 산출 엔진은 상품 분류 체계 생성 엔진에서 생성된 사용자 경험/평가 기반 상품 분류 체계를 이루는 각 노드들 간의 연관도(즉, 상품과 상품 분류노드 간의 연관도)를 산출할 수 있 다. 본 발명의 실시 예에서는 빈도를 이용하여 연관도를 산출하는 경우를 예로 들어 설명하고 있으나 확률 스 코어 또는 Dice 스코어 또는 textRank 또는 상품과 키워드 기반 pagerank 등과 같은 다양한 수학 통계학적 방법 에 의해 연관도를 산출할 수도 있다. 여기서 산출된 연관도는 상품 분류 추천부에서 사용자의 검색/탐색/ 쇼핑 히스토리 기반 상품 분류 체계 추천 시 활용될 수 있다. 도 4 및 도 5는 도 1에 도시된 연관도 산출 엔진을 도시한 블록도이다. 도 4 및 도 5를 참조하면, 연관도 산출 엔진은 통계부 및 연관도 산출부를 포함할 수 있다 통계부는 상품 분류 체계 생성 엔진에서 생성된 다수의 사용자 경험/평가 기반 상품 분류 체계들 을 이루는 다수의 노드별 개체명과 서술어 또는 구절을 분석하여 다수의 개체명과 서술어 또는 구절 각각의 발생 빈도를 통계할 수 있다. 도 4의 경우, 화질의 발생 빈도는 1회, 화질에 대한 '좋아요'의 발생 빈도는 1회, 거실의 발생 빈도는 2회이다. 연관도 산출부는 사용자 경험/평가 기반 상품 분류 체계를 이루는 분류노드들과, 노드들 중 개체명의 상품 노드들 간의 연관도를 통계부의 통계 결과를 참조하여 산출할 수 있다. 예를 들어, 연관도 산출부는 확률 또는 엔트로피 등 하나의 수학 통계학적 방식을 이용하여 '상품'과 '개체명/개체명 분류/서술어/구절'의 관계에 대한 연관도를 산출할 수 있다. 자세히 설명하면, 연관도 산출부는 상품 분류 체계 생성 엔진에서 생성된 사용자 경험/평가 기반 상 품 분류 체계를 이루는 분류노드들인 [개체명, 서술어, 구절] 각각과, 노드들 중 개체명의 상품노드들인 [상품명, 상품 카테고리] 각각을 매핑하여 매핑된 노드들 간의 연관도를 발생빈도를 고려하여 산출할 수 있다. 각종 수학, 통계학적 연관도는 대부분 빈도를 기반으로 산출이 된다. 예를 들어 해당 단어(혹은 서술어, 구절) 의 전체 빈도와 해당 단어(혹은 서술어, 구절)의 특정 상품(혹은 카테고리) 소비자 경험 텍스트에서 상대 등장 빈도 등 여러가지 종류의 단어 빈도를 기초로 하여 해당 단어(혹은 서술어, 구절)과 해당 상품(혹은 상품 카테 고리) 사이의 연관도가 산출된다. 이렇게 구하는 방식으로는 상품과 개체명의 조건부 확률 혹은 엔트로피 혹은 pagerank 알고리즘 등이 있다. 본 발명에서는 특정 수학적, 통계학적 방식의 연관도로 한정을 하지 않는다. 예를 들어, 분류노드들 [개체명, 서술어, 구절]은 [화질, 좋아요, 화질이 너무 좋아요]이고, 상품노드들 [상품 명, 상품 카테고리]은 [TV a, TV]이면, 연관도 산출부는 화질-TV a의 연관도, 화질-TV의 연관도, '화질이 좋아요'-TV a의 연관도 등과 같이 총 6개의 연관도를 산출한다. 도 5에서 화질(0.27)은 상품 카테고리인 TV와 개체명인 화질의 연관도가 0.27이고, 화질(0.3)은 상품명인 TV a와 개체명인 화질의 연관도가 0.3인 것을 의미 한다. 연관도 산출부는 각 노드들 간의 연관도 산출 결과를 포함하는 사용자 경험/평가 기반 상품 분류 체계 를 상품 분류 IF 제공 장치에게 전달한다. 이하에서는 도 6, 도 7, 도 8a 및 도 8b를 참조하여 상품 분류 IF 제공 장치가 사용자 단말기에게 제 공하는 상품 분류 체계에 대해 설명한다. 도 6은 상품 지향적 상품 분류 체계의 예시도이다. 도 6을 참조하면, 상품 지향적 상품 분류 체계는 일반적으로 쇼핑몰에서 사용되는 상품 기반 카테고리에 기초한 분류 체계로서, 최상위 카테고리는 '전자제품, 가구, 청소용품, 화장품' 등 다수 분류되고, 차상위 카테 고리인 '전자제품'의 하위 카테고리는 예를 들어 'TV, 스피커' 등으로 분류되고, 'TV'의 하위 카테고리는 실제 상품명인 'TV a, TV b' 등으로 분류된다. 도 7은 사용자 경험/평가 기반 상품 분류 체계의 예시도이다. 도 7을 참조하면, 사용자 경험/평가 기반 상품 분류 체계는 상품 분류 체계 생성 장치에서 생성된 사 용자 경험/평가 기반 상품 분류 체계 분석 결과에 기초한 상품 분류 체계이다. 사용자 경험/평가 기반 상품 분류 체계 또는 사용자 경험/평가 기반 상품 분류 체계의 최상위 분류노 드는 '장소, 사람' 등 다수의 노드로 분류되고, 최상위 분류노드인 '장소'의 하위 분류노드는 '거실, 화장실' 등으로 분류되고, '거실'의 하위 분류노드는 '깔끔해지는', '거실이 깔끔해지는', '거실이 넓어져요' 등과 같이 사용자의 평가 또는 경험을 포함하는 서술어 또는 구절로 분류된다. 또한, 하위 분류노드인 '거실이 깔끔해지 는' 에는 '쇼파 a, 쇼파 b, TV a, TV b'와 같이 사용자가 실제로 평가한 상품명이 매핑된다. 따라서, 도 7에서 예를 들어, '거실이 깔끔해지는, 거실이 넓어져요'는 사용자의 실제 상품평에 포함되어 상품 분류 체계 생성 장치에서 추출되었으며, '쇼파 a, 쇼파 b, TV a, TV b'는 실제 DB에서 상품평과 연동된 상 품명에 포함되어 있을 수 있고, 상품평에는 포함되어 있을 수도 있고 아닐 수도 있다. 도 8a 및 도 8b는 변형된 사용자 경험/평가 기반 상품 분류 체계(800, 801)의 예시도이다. 도 8a를 참조하면, 변형된 사용자 경험/평가 기반 상품 분류 체계는 사용자 경험/평가 기반 상품 분류 체 계를 변형한 것으로서, 사용자의 상품평으로부터 추출된 개체명, 서술어 또는 구절과 실제 상품명(또는 상품 카테고리)이 결합된 형태의 상품 분류 구조를 갖는다. 예를 들어, 도 7과 같은 사용자 경험/평가 기반 상품 분류 체계에서는 '디자인'이라는 분류노드의 하위 분류노드로서 '디자인이 예뻐요'가 매핑되고, 다시 TV a 라는 상품명이 매핑된다면(미도시), 도 8a와 같은 변형된 사용자 경험/평가 기반 상품 분류 체계에서는 TV 라는 카테고리가 상위노드에 설정되고 TV의 하위 노드로서 사용자 평가가 반영된 '디자인이 예쁜 TV'가 매핑되 어 표시된다. 도 8b를 참조하면 전체 상품에 대해 구성된 사용자 경험/평가 기반 상품 분류 체계과는 다르게, 특정 상품 지향적 카테고리(ex. TV, 선반) 내에서만 부분적으로 사용자 경험/평가 기반 구성된 변형된 분류 체계이다. 즉 도 8b의 상품 분류 체계9801)는 전체 상품 기반의 사용자 경험/평가 기반 상품 분류 체계가 아닌 특정 상품(ex. TV, 선반) 내의 상품들로만 구성된 사용자 경험/평가 기반 상품 분류 체계이다. 도 1에 도시된 상품 분류 IF 제공 장치는 상품 지향적 상품 카테고리에 기초한 상품 분류 UI(이하, '상품 지향적 상품 분류 체계 기반 UI'라 한다), 상품 분류 체계 생성 장치에서 생성되는 사용자 경험/평가 기반 상품 분류 체계에 기초한 상품 분류 UI들(이하, '사용자 경험/평가 기반 상품 분류 체계(700,800,801) 기 반 UI'라 한다) 중 적어도 하나를 사용자 단말기에게 제공할 수 있다. 상품 분류 IF 제공 장치는 상품 분류 추천부, 상품 분류 UI 제공부 및 사용자 피드백부를 포함한다. 상품 분류 추천부는 사용자 단말기를 통해 쇼핑몰에 접속한 사용자의 검색 패턴, 탐색 패턴 및 쇼핑 패턴 중 적어도 하나에 기초하여 상품 지향적 상품 카테고리에 기초한 상품 분류 체계(이하, '상품 지향적 상품 분류 체계'라 한다), 사용자 경험/평가 기반 상품 분류 체계 및 변형된 사용자 경험/평가 기반 상품 분류 체계(800,801) 중 적어도 하나 혹은 그 일부 분류 노드를 추천할 수 있다. 검색 패턴은 사용자가 쇼핑몰에서 입력하는 검색어의 패턴이고, 탐색 패턴은 쇼핑몰에서 제공하는 분류 체계 중 에서 사용자가 자주 선택하는 분류 체계의 탐색 패턴이고, 쇼핑 패턴은 사용자가 관심갖는 상품 또는 자주 구매 하는 상품 등 쇼핑과 관련된 패턴이다. 분류 체계를 추천할 때는 연관도 산출 엔진에서 산출된 연관도를 이용하여 추천할 적절한 분류 체계와 분 류 체계의 노드를 예측하여 추천할 수 있다. 이 추천에는 다양한 기발명된 추천 알고리즘이 사용될 수 있으며, 연관도 산출 엔진에서 산출된 연관도를 활용하여 추천될 수도 있다. 마찬가지로 추천된 분류 체계 내에서 상품의 랭킹을 정하는 경우에도 상기 산출된 연관도를 활용할 수 있다. 상품 분류 UI 제공부는 상품 지향적 상품 분류 체계 기반 UI, 사용자 경험/평가 기반 상품 분류 체계 기반 UI 및 변형된 사용자 경험/평가 기반 상품 분류 체계(800,801) 기반 UI 중 상품 분류 추천부에 서 추천되는 상품 분류 체계에 대응하는 UI를 생성하여 사용자 단말기에게 제공한다. 먼저, 사용자가 쇼핑몰에 최초 접속하였거나 최초 로그인한 경우, 상품 분류 추천부는 상품 지향적 상품 분류 체계 및 사용자 경험/평가 기반 상품 분류 체계를 모두 추천할 수 있다. 혹은 사용자의 기존 검색/탐색/ 쇼핑 패턴 등 과거 쇼핑 행동 이력에 기초해서 적절한 분류 체계를 선택하거나 그 분류 체계의 일부 노드를 선 택적으로 추천할 수도 있다. 이 때 다양한 추천 알고리즘을 사용할 수 있다. 상품 분류 IF 제공 장치는 쇼핑몰 웹사이트 혹은 앱 서비스를 제공하는 서버이거나 상기 서버와 연동할 수 있다. 따라서, 사용자가 쇼핑 몰에 접속하거나 로그인하는 것은 상품 분류 IF 제공 장치에 접속하거나 로그인하는 것을 의미할 수 있다. 상품 분류 UI 제공부는 상품 지향적 상품 분류 체계에 대응하는 상품 지향적 상품 분류 체계 기반 UI 및 사용자 경험/평가 기반 상품 분류 체계에 대응하는 사용자 경험/평가 기반 상품 분류 UI를 모두 혹은 일부를 포함하는 GUI(Graphic User Interface) 화면을 생성하여 사용자 단말기에게 제공할 수 있다. 따라 서, 사용자는 상품 지향적 상품 분류 체계 및 사용자 경험/평가 기반 상품 분류 체계 중 선택하여 원하는 상품 을 검색 및 탐색하거나, 혹은 상품 분류 추천부에서 추천된 적어도 하나 혹은 일부 분류 체계를 검색/탐색 할 수 있다. 또한, 사용자가 쇼핑몰에서 검색한 검색어가 사전에 분류된 개체명이거나 수학적, 통계학적으로 연관된 경우, 상품 분류 추천부는 사용자 경험/평가 기반 상품 분류 체계를 추천한다. 상품 분류 UI 제공부는 사용 자 경험/평가 기반 상품 분류 UI를 포함하는 GUI 화면을 생성하여 사용자 단말기에게 제공할 수 있다. 예를 들어, 사용자가 검색한 검색어가 '아빠이거나 아빠와 연관된 경우'이면, 상품 분류 UI 제공부는 도 9 와 같이 '아빠'를 개체명(또는 분류노드)으로서 가지는 상품 분류 체계와 '아빠'라는 개체명에 매핑된 상품 목록을 보여주는 사용자 경험/평가 기반 상품 분류 체계를 생성하여 제공한다. 사용자가 입력한 검색어와 사전 분류된 개체명 사이의 수학적, 통계학적 연관도를 구하는 방식은 기존 자연어 처리 연구에 많은 방법이 제시되어 있다. (ex. Dice score, cosine similarity 등 다수) 또한, 사용자가 쇼핑몰에서 검색한 검색어가 상품명 및 상품 카테고리 중 하나와 같거나 수학적, 통계학적으로 연관된 경우, 상품 분류 추천부는 상품 지향적 상품 분류 체계 및 변형된 사용자 경험/평가 기반 상품 분 류 체계 중 적어도 하나 혹은 그 일부를 추천한다. 따라서, 상품 분류 UI 제공부는, 상품 지향적 상품 분 류 UI 및 변형된 사용자 경험/평가 기반 상품 분류 UI 중 적어도 하나 혹은 그 일부를 포함하는 GUI 화면을 생 성하여 사용자 단말기에게 제공한다. 예를 들어, 사용자가 검색한 검색어가 'TV'이거나 상품 지향적 상품 분류 체계 기반 UI에서 TV 카테고리를 클릭한 경우, 상품 분류 UI 제공부는 도 10과 같이 TV에 해당하는 상품 지향적 상품 TV 체계의 UI와 변형된 사용자 경험/평가 기반 TV 분류 체계의 UI를 함께 보여주는 복합 상품 분류 체계 일부를 생 성하여 사용자 단말기에게 제공하거나, 상품 지향적 상품 TV 체계의 UI와 변형된 사용자 경험/평가 기반 TV 분류 체계의 UI 중 하나를 사용자가 선택하도록 추천 제시하거나, 서비스나 소비자 상황에 따라 두 체계(1010, 1020)의 UI들 중 하나 혹은 그 일부를 선택하여 추천 제공할 수 있다. 이 때 다양한 추천 알고리 즘이 활용될 수도 있다. 여기서, 변형된 사용자 경험/평가 기반 상품 분류 체계는 상품 분류 추천부에서 생성되거나 상품 분류 체 계 생성 엔진에서 생성될 수 있다. 예를 들어, 상품 분류 추천부는 검색어(TV)가 상품명 또는 상품 카테고리로 매핑된 사용자 경험/평가 기반 상품 분류 체계들을 데이터베이스(미도시)에서 확인하고, 검색어(T V)에 해당하는 상품 카테고리를 상위 분류노드로 분류한다. 상품 분류 추천부는 확인된 검색어(TV)를 개 체명으로 가지는 사용자 경험/평가 기반 상품 분류 체계들 각각의 최하위 분류노드(디자인이 예뻐요, 화질이 좋 아요, 가벼워요 등 다수)와 검색어(TV)를 연결하여 구(phrase, 디자인이 예쁜 TV)를 생성한다. 상품 분류 추천 부는 생성된 구(phrase, 디자인이 예쁜 TV)를 위에서 분류된 상위 분류노드의 하위 분류노드로 분류함으로 써 변형된 사용자 경험/평가 기반 상품 분류 체계를 생성한다. 변형된 사용자 경험/평가 기반 상품 분류 체계의 다른 예시인 또한 마찬가지로 상품 분류 추천부에서 생성되거나 상품 분류 체계 생성 엔진에서 생성될 수 있다. 한편, 상품 분류 UI 제공부에서 제공하는 하나 이상의 상품 분류 UI를 포함하는 GUI 화면이 사용자 단말기 에 표시되면, 사용자는 원하는 상품 분류 UI를 선택하거나 상품 카테고리를 선택하거나 검색어를 입력하는 등 다수의 액션을 취할 수 있다. 사용자 피드백부는 사용자 단말기로부터 사용자가 선택한 상품 분 류 UI 또는 입력한 검색어 또는 선택한 상품 등 사용자 피드백(또는, 사용자 컨텍스트(context) 환경)을 수신하 여 상품 분류 추천부로 전달할 수 있다. 상품 분류 추천부는 사용자 피드백부로부터 전달받은 사용자 피드백을 사용자의 검색어/상품 선택 히 스토리 정보로서 데이터베이스(미도시)에 저장하고, 이후 사용자에게 상품 분류 체계를 추천하는데 반영할 수 있다. 도 11은 본 발명의 실시 예에 따른 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법을 개략적으로 도시한 흐름도이다. 도 11에 도시된 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법은 도 1 내지 도 10을 참조하여 설명한 상품 분류 체계 생성 장치 및 상품 분류 IF 제공 장치에 의해 수행될 수 있다. 도 11을 참조하면, 상품 분류 체계 생성 장치는 유무형 상품들에 대한 사용자 경험 및 평가데이터를 수집 하여 상품 별로 데이터베이스에 저장한다(S1110). 상품 분류 체계 생성 장치는 S1110단계에서 데이터베이스에 저장된 사용자 경험 및 평가데이터를 분석하여 개체명 및 개체명과 연관된 서술어 또는 구절을 추출하고, 추출된 다수의 개체명과 서술어 또는 구절을 유무형 상품 또는 카테고리 별로 분류 및 매핑하여 사용자 경험/평가 기반 상품 분류 체계를 상품 별로 생성한다 (S1120). 상품 분류 체계 생성 장치는 S1110단계 및 S1120단계에서 생성된 사용자 경험/평가 기반 상품 분류 체계를 이루는 각 노드들 간의 연관도를 산출한다(S1130). 즉, S1130단계는 상품과 분류 체계 간의 연관도를 산출한다. 상품 분류 체계 생성 장치는 S1130단계에서 생성된 연관도가 매핑된 사용자 경험/평가 기반 상품 분류 체 계를 상품 분류 IF 제공 장치로 전송한다(S1140). 이로써, 상품 분류 IF 제공 장치는 수신된 사용자 경험/평가 기반 상품 분류 체계를 저장한다. 상품 분류 IF 제공 장치는 사용자 단말기를 통해 사용자가 쇼핑몰 웹사이트에 접속하거나 로그인하면 (S1150), 사용자의 검색 패턴, 탐색 패턴 및 쇼핑 패턴 중 적어도 하나에 기초하여 상품 지향적 상품 분류 체계, 사용자 경험/평가 기반 상품 분류 체계 또는 변형된 사용자 경험/평가 기반 상품 분류 체계 중 적어도 하 나 혹은 그 일부를 추천한다(S1160). 상품 분류 IF 제공 장치는 상품 지향적 상품 분류 UI 및 사용자 경험/평가 기반 상품 분류 UI 중 S1160단 계에서 추천되는 상품 분류 체계에 대응하는 UI를 포함하는 GUI 화면을 생성하여 사용자 단말기에게 제공 한다(S1170, S1180). 사용자 단말기는 사용자가 GUI 화면을 통해 원하는 상품 분류 UI를 선택하거나 상품 카테고리를 선택하거 나 검색어를 입력하는 등 다수의 액션을 취하면 사용자 패드백을 상품 분류 IF 제공 장치로 전송한다 (S1190). 상품 분류 IF 제공 장치는 수신된 사용자 피드백을 사용자의 검색어/상품 선택 히스토리 정보로서 데이터 베이스(미도시)에 저장하고, 이후 S1160단계에서 사용자에게 상품 분류 체계를 추천하는데 반영한다(S1195). 한편, 이상으로 본 발명의 기술적 사상을 예시하기 위한 바람직한 실시 예와 관련하여 설명하고 도시하였지만, 본 발명은 이와 같이 도시되고 설명된 그대로의 구성 및 작용에만 국한되는 것이 아니며, 기술적 사상의 범주를 일탈함이 없이 본 발명에 대해 다수의 변경 및 수정 가능함을 당업자들은 잘 이해할 수 있을 것이다. 따라서, 그러한 모든 적절한 변경 및 수정과 균등물들도 본 발명의 범위에 속하는 것으로 간주하여야 할 것이다. 따라 서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2021-0134083", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 시스템을 도시한 도면, 도 2는 도 1에 도시된 상품 분류 체계 생성 엔진을 도시한 블록도, 도 3은 형태소 분석부, 개체명 인식부 및 청킹 및 구문 분석부에서 생성된 단어(즉, 개체명)과 서술어 및 구절을 통한 단어의 관계 추출의 예시도, 도 4 및 도 5는 도 1에 도시된 연관도 산출 엔진을 도시한 블록도, 도 6은 상품 지향적 상품 분류 체계의 예시도, 도 7은 상품 분류 체계 생성 장치을 통해 생성된 사용자 경험/평가 기반 상품 분류 체계의 예시도, 도 8a는 변형된 사용자 경험/평가 기반 상품 분류 체계의 예시도, 도 8b는 변형된 사용자 경험/평가 기반 상품 분류 체계의 다른 예시도, 도 9는 검색어가 개체명이거나 혹은 개체명과 연관이 있는 경우 사용자에게 보여지는 사용자 경험/평가 기반 상 품 분류 체계 일부의 예시도, 도 10은 사용자 검색어가 상품 카테고리이거나 혹은 상품 카테고리와 연관이 있는 경우 사용자에게 보여지는 복 합 상품 분류 체계 일부의 예시도, 그리고, 도 11은 본 발명의 실시 예에 따른 사용자 경험 및 평가에 기반한 유무형 상품 분류 체계 생성 및 제공 방법을 개략적으로 도시한 흐름도이다."}
