{"patent_id": "10-2018-0156820", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0008488", "출원번호": "10-2018-0156820", "발명의 명칭": "타겟 오브젝트와 아이템을 연관시키는 방법, 장치 및 시스템", "출원인": "베이징 쿠앙쉬 테크놀로지 씨오., 엘티디.", "발명자": "리우, 단칭"}}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "타겟 오브젝트와 아이템을 연관시키는 방법 - 상기 방법은 처리 장치에 적용되고, 상기 처리 장치는 선반에 장착된 레이저 레이더에 연결되며, 상기 레이저 레이더의 라인 수가 미리 설정된 라인 값(line value)보다 적고,상기 레이저 레이더의 감지 범위가 상기 선반 상의 각 아이템을 커버함 - 에 있어서, 상기 방법은:상기 레이저 레이더가 상기 타겟 오브젝트를 감지한 것으로부터 획득된 감지 정보를 취득하는 것;상기 감지 정보에 따라 상기 감지 범위 내에서 상기 타겟 오브젝트의 트리거 포인트 좌표를 결정하는 것; 및미리 저장된 상기 각 아이템의 위치 좌표 및 상기 타겟 오브젝트의 상기 트리거 포인트 좌표에 따라 상기 타겟오브젝트와 연관된 아이템을 결정하는 것;을 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 레이저 레이더는 기계식 스캐닝 레이저 레이더이고, 상기 기계식 스캐닝 레이저 레이더의 개수는 적어도하나이고, 모든 상기 기계식 스캐닝 레이저 레이더의 감지 범위 조합은 상기 선반 상의 각 아이템을 커버하는,타겟 오브젝트와 아이템을 연관시키는 방법."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 레이저 레이더는 단일-포인트 거리측정 레이저 레이더(single-point ranging laser radar)이며, 상기 단일-포인트 거리측정 레이저 레이더의 수는 다수이고, 상기 다수의 단일-포인트 거리측정 레이저 레이더는 미리 설정된 간격에 따라 정렬되며, 상기 다수의 단일-포인트 거리측정 레이저 레이더의 감지 범위 조합은 상기 선반상의 각 아이템을 커버하는, 타겟 오브젝트와 아이템을 연관시키는 방법."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항 또는 제3항에 있어서, 상기 감지 정보에 따라 상기 감지 범위 내에서 상기 타겟 오브젝트의 트리거 포인트 좌표를 결정하는 것은:상기 감지 정보에 기초하여 타겟 레이저 레이더의 시리얼 코드를 결정하는 것 - 상기 감지 정보는 상기 타겟 레이저 레이더에 의해 생성되고, 상기 감지 정보는 상기 타겟 레이저 레이더에 대한 상기 타겟 오브젝트의 거리값(distance value) 및 방위각(azimuth angle)을 포함함 -;상기 타겟 레이저 레이더의 상기 시리얼 코드에 따라 상기 타겟 레이저 레이더의 위치 좌표를 탐색하는 것; 및상기 타겟 레이저 레이더의 위치 좌표, 상기 타겟 레이저 레이더에 대한 타겟 오브젝트의 방위각 및 거리 값에따라 상기 감지 범위 내에서 상기 타겟 오브젝트의 상기 트리거 포인트 좌표를 결정하는 것;을 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,미리 저장된 상기 각 아이템의 위치 좌표 및 상기 타겟 오브젝트의 트리거 포인트 좌표에 따라 상기 타겟 오브젝트와 연관된 아이템을 결정하는 것은:공개특허 10-2020-0008488-3-상기 미리 저장된 상기 각 아이템의 위치 좌표 및 상기 타겟 오브젝트의 상기 트리거 포인트 좌표에 따라 타겟아이템을 결정하는 것 - 상기 타겟 아이템의 위치 좌표는 상기 타겟 오브젝트의 상기 트리거 포인트 좌표로부터미리 설정된 거리 이내인 것 -; 및상기 타겟 아이템을 상기 타겟 오브젝트와 연관된 아이템으로 결정하는 것; 을 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 선반의 각각의 적층 구조물의 높이를 획득하는 것;상기 각 아이템의 위치 정보 및 크기 정보를 획득하는 것 - 상기 위치 정보는 상기 아이템이 위치하는 상기 적층 구조물의 시리얼 코드 및 상기 아이템이 위치하는 상기 적층 구조물 상의 상기 아이템의 수평 순서 번호를포함함 -;상기 각 아이템이 위치한 적층 구조물의 시리얼 코드 및 상기 각각의 적층 구조물의 높이에 따라, 상기 각 아이템의 세로 방향 위치 좌표를 결정하는 것; 및상기 각 아이템의 크기 정보 및 수평 순서 번호 에 따라 상기 각 아이템의 가로 방향 위치 좌표를 결정하는 것;을 더 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 선반에는 추가로 회로 기판이 세로 방향으로 제공되고, 상기 회로 기판은 미리 결정된 간격으로 세로 방향으로 다수의 전기 접촉부가 제공되고, 각 적층 구조물에는 상기 적층 구조물이 상기 회로 기판 상의 전기 접촉부와 연결되는 보호관(thimble)이 제공되고, 상기 회로 기판은 상기 처리 장치에 추가로 연결되고, 상기 선반의각각의 적층 구조물의 높이를 획득하는 것은,상기 회로 기판 상의 상기 각각의 전기 접촉부의 상태를 획득하는 것 - 상기 상태는 자유 상태 또는 접촉 상태를 포함함 -;상기 각각의 전기 접촉부의 상태에 따라 타겟 전기 접촉부의 시리얼 코드를 결정하는 것 - 상기 타겟 전기 접촉부는 접촉 상태인 전기 접촉부이고, 상기 타겟 전기 접촉부의 수는 상기 적층 구조물의 수와 매칭됨 -;상기 타겟 전기 접촉부의 시리얼 코드 및 미리 설정된 전기 접촉부 정보 테이블에 따라 상기 각각의 타겟 전기접촉부의 위치 정보를 탐색하는 것 - 상기 전기 접촉부 정보 테이블은 상기 전기 접촉부의 상기 위치 정보와 상기 시리얼 코드 사이의 대응 관계를 저장함 -; 및상기 각각의 타겟 전기 접촉부의 위치 정보에 기초하여 상기 각각의 적층 구조물의 상기 높이를 결정하는 것;을 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 회로 기판에는 상기 각각의 적층 구조물 상의 전자 기기에 전력을 공급하기 위한 전원이 더 제공되고, 상기 전자 기기는 전자 태그 및/또는 헤드 램프를 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "아이템과 타겟 오브젝트를 연관시키는 장치 - 상기 장치는 처리 장치에 적용되고, 상기 처리 장치는 선반에 장착된 레이저 레이더에 연결되어 있고, 상기 레이저 레이더의 라인 수가 미리 설정된 라인 값(line value)보다적고, 상기 레이저 레이더의 감지 범위는 설계된 영역을 커버함 - 에 있어서, 상기 장치는:공개특허 10-2020-0008488-4-상기 레이저 레이더가 상기 타겟 오브젝트를 감지한 것으로부터 획득된 감지 정보를 취득하도록 구성된 감지 정보 취득 모듈;상기 감지 정보에 따라 상기 감지 범위 내에서 상기 타겟 오브젝트의 트리거 포인트 좌표를 결정하도록 구성된트리거 포인트 결정 모듈; 및미리 저장된 각 아이템의 위치 좌표 및 상기 타겟 오브젝트의 상기 트리거 포인트 좌표에 따라 상기 타겟 오브젝트와 연관된 아이템을 결정하도록 구성된 연관성 결정 모듈;을 포함하는, 아이템과 타겟 오브젝트를 연관시키는 장치."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "아이템과 타겟 오브젝트를 연관시키는 시스템 - 상기 시스템은 레이저 레이더 및 처리 장치를 포함함 - 에 있어서, 상기 레이저 레이더는 감지 정보를 생성하도록 구성되고,상기 처리 장치는 컴퓨터 프로그램을 저장하고, 상기 컴퓨터 프로그램이 상기 처리 장치에 의해 실행될 때, 제1항 내지 제3항 및 제5항 내지 제8항 중 어느 한 항에 따른 방법이 실행되는, 아이템과 타겟 오브젝트를 연관시키는 시스템."}
{"patent_id": "10-2018-0156820", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "컴퓨터 프로그램이 프로세서에 의해 실행될 때, 제1항 내지 제3항 및 제5항 내지 제8항중 어느 한 항에 따른 방법의 단계들이 수행되는, 컴퓨터 프로그램을 저장한 컴퓨터-판독가능 저장 매체."}
{"patent_id": "10-2018-0156820", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 타겟 오브젝트를 아이템과 연관시키는 방법, 장치 및 시스템을 제공하는, 지능형 감시"}
{"patent_id": "10-2018-0156820", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관 한 것이다. 이 방법은 처리 장치에 적용되며, 처리 장치는 선반에 장착된 레이저 레이더에 연결된다. 방법은: 레 이저 레이더가 타겟 오브젝트를 감지한 것으로부터 획득된 감지 정보를 취득하는 것; 감지 정보에 따라 감지 범 위 내에서 타겟 오브젝트의 트리거 포인트 좌표를 결정하는 것; 및 미리 저장된 각 아이템의 위치 좌표 및 타겟 오브젝트의 트리거 포인트 좌표에 따라 타겟 오브젝트와 연관된 아이템을 결정하는 것을 포함한다. 본 출원은 다 양한 유형의 선반에 폭넓게 적용될 수 있으며, 다양한 감시 사례에 적합하다. 대 표 도 - 도5"}
{"patent_id": "10-2018-0156820", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2020-0008488 CPC특허분류 G01S 17/88 (2013.01) G06Q 30/0201 (2013.01) G06Q 50/10 (2013.01)명 세 서 청구범위 청구항 1 타겟 오브젝트와 아이템을 연관시키는 방법 - 상기 방법은 처리 장치에 적용되고, 상기 처리 장치는 선반에 장 착된 레이저 레이더에 연결되며, 상기 레이저 레이더의 라인 수가 미리 설정된 라인 값(line value)보다 적고, 상기 레이저 레이더의 감지 범위가 상기 선반 상의 각 아이템을 커버함 - 에 있어서, 상기 방법은: 상기 레이저 레이더가 상기 타겟 오브젝트를 감지한 것으로부터 획득된 감지 정보를 취득하는 것; 상기 감지 정보에 따라 상기 감지 범위 내에서 상기 타겟 오브젝트의 트리거 포인트 좌표를 결정하는 것; 및 미리 저장된 상기 각 아이템의 위치 좌표 및 상기 타겟 오브젝트의 상기 트리거 포인트 좌표에 따라 상기 타겟 오브젝트와 연관된 아이템을 결정하는 것; 을 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법. 청구항 2 제1항에 있어서, 상기 레이저 레이더는 기계식 스캐닝 레이저 레이더이고, 상기 기계식 스캐닝 레이저 레이더의 개수는 적어도 하나이고, 모든 상기 기계식 스캐닝 레이저 레이더의 감지 범위 조합은 상기 선반 상의 각 아이템을 커버하는, 타겟 오브젝트와 아이템을 연관시키는 방법. 청구항 3 제1항에 있어서, 상기 레이저 레이더는 단일-포인트 거리측정 레이저 레이더(single-point ranging laser radar)이며, 상기 단일 -포인트 거리측정 레이저 레이더의 수는 다수이고, 상기 다수의 단일-포인트 거리측정 레이저 레이더는 미리 설 정된 간격에 따라 정렬되며, 상기 다수의 단일-포인트 거리측정 레이저 레이더의 감지 범위 조합은 상기 선반 상의 각 아이템을 커버하는, 타겟 오브젝트와 아이템을 연관시키는 방법. 청구항 4 제2항 또는 제3항에 있어서, 상기 감지 정보에 따라 상기 감지 범위 내에서 상기 타겟 오브젝트의 트리거 포인트 좌표를 결정하는 것은: 상기 감지 정보에 기초하여 타겟 레이저 레이더의 시리얼 코드를 결정하는 것 - 상기 감지 정보는 상기 타겟 레 이저 레이더에 의해 생성되고, 상기 감지 정보는 상기 타겟 레이저 레이더에 대한 상기 타겟 오브젝트의 거리 값(distance value) 및 방위각(azimuth angle)을 포함함 -; 상기 타겟 레이저 레이더의 상기 시리얼 코드에 따라 상기 타겟 레이저 레이더의 위치 좌표를 탐색하는 것; 및 상기 타겟 레이저 레이더의 위치 좌표, 상기 타겟 레이저 레이더에 대한 타겟 오브젝트의 방위각 및 거리 값에 따라 상기 감지 범위 내에서 상기 타겟 오브젝트의 상기 트리거 포인트 좌표를 결정하는 것; 을 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법. 청구항 5 제1항에 있어서, 미리 저장된 상기 각 아이템의 위치 좌표 및 상기 타겟 오브젝트의 트리거 포인트 좌표에 따라 상기 타겟 오브 젝트와 연관된 아이템을 결정하는 것은:상기 미리 저장된 상기 각 아이템의 위치 좌표 및 상기 타겟 오브젝트의 상기 트리거 포인트 좌표에 따라 타겟 아이템을 결정하는 것 - 상기 타겟 아이템의 위치 좌표는 상기 타겟 오브젝트의 상기 트리거 포인트 좌표로부터 미리 설정된 거리 이내인 것 -; 및 상기 타겟 아이템을 상기 타겟 오브젝트와 연관된 아이템으로 결정하는 것; 을 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법. 청구항 6 제1항에 있어서, 상기 선반의 각각의 적층 구조물의 높이를 획득하는 것; 상기 각 아이템의 위치 정보 및 크기 정보를 획득하는 것 - 상기 위치 정보는 상기 아이템이 위치하는 상기 적 층 구조물의 시리얼 코드 및 상기 아이템이 위치하는 상기 적층 구조물 상의 상기 아이템의 수평 순서 번호를 포함함 -; 상기 각 아이템이 위치한 적층 구조물의 시리얼 코드 및 상기 각각의 적층 구조물의 높이에 따라, 상기 각 아이 템의 세로 방향 위치 좌표를 결정하는 것; 및 상기 각 아이템의 크기 정보 및 수평 순서 번호 에 따라 상기 각 아이템의 가로 방향 위치 좌표를 결정하는 것; 을 더 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법. 청구항 7 제6항에 있어서, 상기 선반에는 추가로 회로 기판이 세로 방향으로 제공되고, 상기 회로 기판은 미리 결정된 간격으로 세로 방향 으로 다수의 전기 접촉부가 제공되고, 각 적층 구조물에는 상기 적층 구조물이 상기 회로 기판 상의 전기 접촉 부와 연결되는 보호관(thimble)이 제공되고, 상기 회로 기판은 상기 처리 장치에 추가로 연결되고, 상기 선반의 각각의 적층 구조물의 높이를 획득하는 것은, 상기 회로 기판 상의 상기 각각의 전기 접촉부의 상태를 획득하는 것 - 상기 상태는 자유 상태 또는 접촉 상태 를 포함함 -; 상기 각각의 전기 접촉부의 상태에 따라 타겟 전기 접촉부의 시리얼 코드를 결정하는 것 - 상기 타겟 전기 접촉 부는 접촉 상태인 전기 접촉부이고, 상기 타겟 전기 접촉부의 수는 상기 적층 구조물의 수와 매칭됨 -; 상기 타겟 전기 접촉부의 시리얼 코드 및 미리 설정된 전기 접촉부 정보 테이블에 따라 상기 각각의 타겟 전기 접촉부의 위치 정보를 탐색하는 것 - 상기 전기 접촉부 정보 테이블은 상기 전기 접촉부의 상기 위치 정보와 상 기 시리얼 코드 사이의 대응 관계를 저장함 -; 및 상기 각각의 타겟 전기 접촉부의 위치 정보에 기초하여 상기 각각의 적층 구조물의 상기 높이를 결정하는 것; 을 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법. 청구항 8 제7항에 있어서, 상기 회로 기판에는 상기 각각의 적층 구조물 상의 전자 기기에 전력을 공급하기 위한 전원이 더 제공되고, 상 기 전자 기기는 전자 태그 및/또는 헤드 램프를 포함하는, 타겟 오브젝트와 아이템을 연관시키는 방법. 청구항 9 아이템과 타겟 오브젝트를 연관시키는 장치 - 상기 장치는 처리 장치에 적용되고, 상기 처리 장치는 선반에 장 착된 레이저 레이더에 연결되어 있고, 상기 레이저 레이더의 라인 수가 미리 설정된 라인 값(line value)보다 적고, 상기 레이저 레이더의 감지 범위는 설계된 영역을 커버함 - 에 있어서, 상기 장치는:상기 레이저 레이더가 상기 타겟 오브젝트를 감지한 것으로부터 획득된 감지 정보를 취득하도록 구성된 감지 정 보 취득 모듈; 상기 감지 정보에 따라 상기 감지 범위 내에서 상기 타겟 오브젝트의 트리거 포인트 좌표를 결정하도록 구성된 트리거 포인트 결정 모듈; 및 미리 저장된 각 아이템의 위치 좌표 및 상기 타겟 오브젝트의 상기 트리거 포인트 좌표에 따라 상기 타겟 오브 젝트와 연관된 아이템을 결정하도록 구성된 연관성 결정 모듈; 을 포함하는, 아이템과 타겟 오브젝트를 연관시키는 장치. 청구항 10 아이템과 타겟 오브젝트를 연관시키는 시스템 - 상기 시스템은 레이저 레이더 및 처리 장치를 포함함 - 에 있어 서, 상기 레이저 레이더는 감지 정보를 생성하도록 구성되고, 상기 처리 장치는 컴퓨터 프로그램을 저장하고, 상기 컴퓨터 프로그램이 상기 처리 장치에 의해 실행될 때, 제1 항 내지 제3항 및 제5항 내지 제8항 중 어느 한 항에 따른 방법이 실행되는, 아이템과 타겟 오브젝트를 연관시 키는 시스템. 청구항 11 컴퓨터 프로그램이 프로세서에 의해 실행될 때, 제1항 내지 제3항 및 제5항 내지 제8항중 어느 한 항에 따른 방 법의 단계들이 수행되는, 컴퓨터 프로그램을 저장한 컴퓨터-판독가능 저장 매체. 발명의 설명 기 술 분 야 본 개시는 지능형 감시 기술 분야에 관한 것으로, 구체적으로 타겟 오브젝트와 아이템을 연관시키는 방법, 장치 및 시스템에 관한 것이다."}
{"patent_id": "10-2018-0156820", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "선반(sleves)은 예를 들어 쇼핑몰에서 사용되는 랙(rack), 음료수용 수직의 냉기 캐비닛(vertical cold air cabinets for drinks), 냉동 제품 보관용 유리 냉장고, 도서관이나 서점에서 사용되는 책 선반 및 창고에서 사 용되는 저장 랙 등과 같은 다양한 산업 분야에서 사용되며, 이들 모두 선반이다. 선반의 응용 과정에서, 선반에서 아이템을 가져가는 사람들의 시나리오는 종종 수반된다. 다른 응용 장소들은 다른 목적을 가질 수 있지만, 선반 위의 어떤 아이템이 타겟 오브젝트(예를 들어, 소비자, 직원 등)와 접촉되었 는지 모두 알기 원한다. 예를 들어, 스마트 소매 사이트에서, 판매자는 구매 과정 동안 선반 위의 어떤 아이템 이 고객들에 의해 접촉되었는지 알기를 원하고; 저장 사이트에서, 매니저는 저장 랙으로부터 직원에 의해 어떤 아이템이 이동되었는지 알기를 원하거나 저장 로봇에 의해 저장 랙으로부터 도달된 아이템이 옳은 것인지 여부 를 알기 원한다. 종래 기술에서, 감시(monitoring)는 너무 고가이고 넓게 활용되기 어려운 인공지능 비전의 방 식을 채택함으로써 주로 수행되었고; 종래 기술에서, 일부는 각 아이템을 개별적으로 감시하기 위해 각 아이템 에 대응하는 센서를 설정하는 모드를 채용하였고; 하나 이상의 센서와 대응되는 것을 필요로 하는 각 아이템 때 문에 다수의 센서 및 복잡한 배선을 초래하여, 밀도 높게 배열된 아이템들을 갖는 유리 냉장고, 냉기 캐비닛 또 는 선반과 같은 모드를 적용하는 것이 어려웠다."}
{"patent_id": "10-2018-0156820", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 관점에서, 본 개시의 목적은 다양한 유형의 선반에 광범위하게 적용될 수 있는 아이템과 타겟 오브젝트 를 연관시키는 방법, 장치 및 시스템을 제공하는데 있다. 상기 목적을 달성하기 위해, 본 개시의 실시예에 의해 채택된 기술적 해결 방안은 다음과 같다: 제 1 측면에서, 본 개시의 실시예는 타겟 오브젝트를 아이템과 연관시키는 방법을 제공하며, 여기서 방법은 처 리 장치에 적용되고, 처리 장치는 선반에 장착된 레이저 레이더에 연결되며, 레이저 레이더의 라인 수가 미리 설정된 라인 값(line value)보다 적고, 레이저 레이더의 감지 범위가 선반 상의 각 아이템을 커버한다; 방법은: 레이저 레이더가 타겟 오브젝트를 감지한 것으로부터 얻어지는 감지 정보를 획득하는 것; 감지 정보에 따라 감 지 범위 내에서 타겟 오브젝트의 트리거 포인트 좌표를 결정하는 것; 및 미리 저장된 각 아이템의 위치 좌표 및 타겟 오브젝트의 트리거 포인트 좌표에 따라 타겟 오브젝트와 연관된 아이템을 결정하는 것을 포함한다. 또한, 본 개시의 실시예는 제 1 측면의 제 1 가능 구현(possible implementation)을 제공하고, 레이저 레이더는 기계식 스캐닝 레이저 레이더이고; 기계식 스캐닝 레이저 레이더의 개수는 적어도 하나이며; 모든 기계식 스캐 닝 레이저 레이더의 감지 범위 조합은 선반 상의 각 아이템을 커버한다. 또한, 본 개시의 실시예는 제 1 측면의 제 2 가능 구현을 제공하고, 레이저 레이더는 단일-포인트 거리측정 레 이저 레이더(single-point ranging laser radar)이며, 단일-포인트 거리측정 레이저 레이더의 수는 다수이고; 다수의 단일-포인트 거리측정 레이저 레이더는 미리 설정된 간격에 따라 정렬되며; 다수 단일-포인트 거리측정 레이저 레이더의 감지 범위 조합은 선반의 각 아이템을 커버한다. 또한, 본 개시의 실시예는 제 1 측면의 제 3 가능 구현을 제공하고, 감지 정보에 따라 감지 범위 내에서 타겟 오브젝트의 트리거 포인트 좌표를 결정하는 것은: 감지 정보에 기초하여 타겟 레이저 레이더의 시리얼 코드를 결정하는 것 - 감지 정보는 타겟 레이저 레이더에 의해 생성되고, 감지 정보는 타겟 레이저 레이더에 대한 타겟 오브젝트의 거리 값 및 방위각을 포함함 -; 타겟 레이저 레이더의 시리얼 코드에 따라 타겟 레이저 레이더의 위 치 좌표를 탐색하는 것; 및 타겟 레이저 레이더의 위치 좌표, 타겟 레이저 레이더에 대한 타겟 오브젝트의 방위 각(azimuth angle) 및 거리 값(distance value)에 따라 감지 범위 내에서 타겟 오브젝트의 트리거 포인트 좌표 를 결정하는 것을 포함한다. 또한, 본 개시의 실시예는 제 1 측면의 제 4 가능 구현을 제공하고, 미리 저장된 각 아이템의 위치 좌표 및 타 겟 오브젝트의 트리거 포인트 좌표에 따라 타겟 오브젝트와 연관된 아이템을 결정하는 것은: 미리 저장된 각 아 이템의 위치 좌표 및 타겟 오브젝트의 트리거 포인트 좌표에 따라 타겟 아이템을 결정하는 것 - 타겟 아이템의 위치 좌표는 타겟 오브젝트의 트리거 포인트 좌표로부터 미리 설정된 거리 이내인 것 -; 및 타겟 아이템을 타겟 오브젝트와 연관된 아이템으로 결정하는 것을 포함한다. 또한, 본 개시의 실시예는 제 1 측면의 제 5 가능 구현을 제공하고, 방법은: 선반의 각각의 적층 구조물의 높이 를 획득하는 것; 각 아이템의 위치 정보 및 크기 정보를 획득하는 것 - 위치 정보는 아이템이 위치하는 적층 구 조물의 시리얼 코드 및 아이템이 위치하는 적층 구조물 상의 아이템의 수평 순서 번호를 포함함 -; 각 아이템이 위치한 적층 구조물의 시리얼 코드 및 각각의 적층 구조물의 높이에 따라, 각 아이템의 세로 방향 위치 좌표를 결정하는 것; 및 각 아이템의 크기 정보 및 수평 순서 번호에 따라 각 아이템의 가로 방향 위치 좌표를 결정하 는 것을 더 포함한다. 또한, 본 개시의 실시예는 제 1 측면의 제 6 가능 구현을 제공하고, 선반에는 추가로 회로 기판이 세로 방향으 로 제공되고, 회로 기판은 미리 결정된 간격으로 세로 방향으로 다수의 전기 접촉부가 제공되고, 각 적층 구조 물에는 적층 구조물이 회로 기판 상의 전기 접촉부와 연결되는 보호관(thimble)이 제공되고, 회로 기판은 처리 장치에 추가로 연결되고, 선반의 각각의 적층 구조물의 높이를 획득하는 것은, 회로 기판 상의 각각의 전기 접 촉부의 상태를 획득하는 것 - 상태는 자유 상태 또는 접촉 상태를 포함함 -; 각각의 전기 접촉부의 상태에 따라 타겟 전기 접촉부의 시리얼 코드를 결정하는 것 - 타겟 전기 접촉부는 접촉 상태인 전기 접촉부이고, 타겟 전기 접촉부의 수는 적층 구조물의 수와 매칭됨 -; 타겟 전기 접촉부의 시리얼 코드 및 미리 설정된 전기 접촉부 정 보 테이블에 따라 각각의 타겟 전기 접촉부의 위치 정보를 탐색하는 것 - 전기 접촉부 정보 테이블은 전기 접촉 부의 위치 정보와 시리얼 코드 사이의 대응 관계를 저장함 -; 및 각각의 타겟 전기 접촉부의 위치 정보에 기초 하여 각각의 적층 구조물의 높이를 결정하는 것을 포함한다. 또한, 본 개시의 실시예는 제 1 측면의 제 7 가능 구현을 제공하고, 회로 기판에는 각각의 적층 구조물 상의 전 자 기기에 전력을 공급하기 위한 전원이 더 제공되고, 전자 기기는 전자 태그 및/또는 헤드 램프를 포함한다.제 2 측면에서, 본 개시의 실시예는 아이템과 타겟 오브젝트를 연관시키는 장치 - 장치는 처리 장치에 적용되고, 처리 장치는 선반에 장착된 레이저 레이더에 연결되어 있고, 레이저 레이더의 라인 수가 미리 설정된 라인 값(line value)보다 적고, 레이저 레이더의 감지 범위는 설계된 영역을 커버함 - 를 제공하고, 장치는: 레 이저 레이더가 타겟 오브젝트를 감지한 것으로부터 획득된 감지 정보를 취득하도록 구성된 감지 정보 취득 모듈; 감지 정보에 따라 감지 범위 내에서 타겟 오브젝트의 트리거 포인트 좌표를 결정하도록 구성된 트리거 포 인트 결정 모듈; 및 미리 저장된 각 아이템의 위치 좌표 및 타겟 오브젝트의 트리거 포인트 좌표에 따라 타겟 오브젝트와 연관된 아이템을 결정하도록 구성된 연관성 결정 모듈을 포함한다. 제 3 측면에서, 본 개시의 실시예는 아이템과 타겟 오브젝트를 연관시키는 시스템 - 시스템은 레이저 레이더 및 처리 장치를 포함함 - 을 제공하고, 레이저 레이더는 감지 정보를 생성하도록 구성되고, 처리 장치는 컴퓨터 프 로그램을 저장하고, 컴퓨터 프로그램이 처리 장치에 의해 실행될 때, 제 1 측면의 임의의 구현예에 따른 방법이 실행된다. 제 4 측면에서, 본 개시의 실시예는 컴퓨터 프로그램이 프로세서에 의해 실행될 때, 제 1 측면의 임의의 구현예 에 따른 방법의 단계들이 수행되는, 컴퓨터 프로그램을 저장한 컴퓨터-판독가능 저장 매체를 제공한다. 본 개시의 실시예는 타겟 오브젝트를 아이템과 연관시키는 방법, 장치 및 시스템을 제공하며, 처리 장치는 선반 에 장착된 레이저 레이더에 연결되며; 프로세서는 레이저 레이더의 감지 정보에 따라 감지 범위 내에서 타겟 오 브젝트의 트리거 포인트 좌표를 결정할 수 있고; 추가적으로 타겟 오브젝트의 트리거 포인트 좌표 및 미리 저장 된 각 아이템의 위치 좌표에 따라 타겟 오브젝트와 연관된 아이템을 결정할 수 있다. 본 개시의 실시예는 선반 상의 각각의 아이템에 대해 한결같은 탐지를 수행하기 위해, 적은 라인 수를 갖는 레이저 레이더를 채택하기 때 문에, 적은 라인 수를 갖는 레이저 레이더는 상대적으로 저가이고, 고가의 인공지능 비전 머신을 필요로 하지 않고, 또한 각 아이템마다 하나 이상의 거리 센서를 배열할 필요가 없으므로, 다양한 형태의 선반에 널리 적용 될 수 있으며 다양한 응용 사례에 채택될 수 있다. 본 개시의 실시예의 다른 특징 및 장점은 아래의 서술에서 설명되거나, 또는 특징 및 장점의 일부는 명세서에 따르거나 본 개시의 상기 기술을 구현함으로써 의심할 여지없이 깨달을 수 있다. 더 명확하고 이해하기 쉽도록, 본 개시의 상술한 목적, 특징 및 장점에 대해, 바람직한 실시예를 도면과 조합하 여 아래에서 자세하게 설명한다."}
{"patent_id": "10-2018-0156820", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 목적, 기술적 해결 방안 및 장점을 더 분명하고 명확하게 하기 위해, 이하, 본 개시의 기술적 해결 방안은 도면과 조합하여 분명하고 포괄적으로 설명될 것이고, 명백하게, 이러한 설명된 실시예는 모든 실시예가 아닌 본 개시의 실시예의 일부이다. 창의적인 노력없이 본 개시의 실시예에 기초하여 해당 기술 분야의 통상의 기술자에 의해 획득된 다른 모든 실시예는 본 개시의 보호 범위에 속한다. 현재, 선반 위에 있는 어떤 아이템들이 타겟 오브젝트에 의해 접촉되었는지 여부를 감시할 때, 인공지능 비전 모드 또는 각 아이템에 대한 센서를 별도로 배열하는 방식을 채택하더라도 여러 유형의 선반에 널리 적용하기는 어렵다. 이러한 문제점에 대한 개선을 이루기 위해, 본 개시는 아이템과 타겟 오브젝트를 연관시키는 방법, 장 치 및 시스템을 제공하는데, 이 기술은 대응하는 소프트웨어 및 하드웨어를 채택함으로써 구현될 수 있으며, 다 양한 쇼핑 장소, 지능형 도서관, 지능형 창고/물류 산업 등과 같은 곳의 스마트 소매 시나리오(smart retail scenario)와 같은 다양한 감시 업무에 적용될 수 있으며, 본 개시의 실시예들이 아래에서 자세하게 설명될 것이다. 제 1 실시예 먼저, 본 개시의 실시예에 따른 타겟 오브젝트와 아이템을 연관시키는 방법, 장치 및 시스템을 구현하기 위한 예시적인 전자 시스템이 도 1을 참조하여 설명될 것이다. 도 1은 본 개시의 실시예에 의해 제공되는 전자 시스템 구조의 개략도를 나타내며, 전자 시스템은 하나 이 상의 처리 장치(processing device), 하나 이상의 저장 장치, 입력 장치, 출력 장치 및 로우-라인(low-line) 레이저 레이더를 포함하며, 이들 구성 요소는 버스 시스템 및/또는 연결 메커니 즘의 다른 형태(미도시)를 통해 상호 연결된다. 도 1에 도시된 전자 시스템의 구성 요소와 구조는, 단지 예시적인 것으로 제한적이지 않으며, 전자 시스템은 필요에 따라 다른 구성 요소 및 구조를 가질 수 있다. 처리 장치는 게이트웨이 또는 스마트 단말, 또는 데이터 처리 능력 및/또는 명령어 실행 능력을 갖는 프로 세싱 유닛을 포함하는 장치일 수 있고, 전자 시스템 내의 다른 구성 요소의 데이터를 처리할 수 있고, 원 하는 기능을 수행하기 위해 전자 시스템 내의 다른 구성 요소를 제어할 수 있다. 저장 장치는 하나 이상의 컴퓨터 프로그램 제품을 포함할 수 있으며, 컴퓨터 프로그램 제품은 휘발성 메모 리 및/또는 비 휘발성 메모리와 같은 다양한 형태의 컴퓨터 판독 가능 저장 매체를 포함할 수 있다. 휘발성 메 모리는 예를 들어, RAM(random access memory) 및/또는 캐시 또는 이와 유사한 것을 포함할 수 있다. 비 휘발성 메모리는 예를 들어, ROM(read only memory), 하드 디스크, 플래시 메모리 또는 이와 유사한 것을 포함할 수 있 다. 하나 이상의 컴퓨터 프로그램 명령어는 컴퓨터 판독 가능 저장 매체에 저장될 수 있으며, 처리 장치는 후술된 본 개시의 실시예들에서 클라이언트 기능(프로세서에 의해 구현 됨) 및/또는 다른 원하는 기능들을 구현 하기 위해 프로그램 명령어를 실행할 수 있다. 다양한 응용 프로그램 및 다양한 데이터는 또한 응용 프로그램 또는 이와 유사한 것들에 의해 사용되거나 및/또는 생성된 다양한 데이터와 같은 컴퓨터-판독가능 저장 매체에 저장될 수 있다. 입력 장치는 지시를 입력하기 위하여 사용자에 의해 사용되는 장치일 수 있고, 키보드, 마우스, 마이크로 폰, 터치 스크린 또는 이와 유사한 것들 중 하나 이상을 포함할 수 있다. 출력 장치는 다양한 유형의 정보(예를 들어, 이미지 또는 사운드)를 외부(예를 들어, 사용자)로 출력할 수 있으며, 디스플레이, 스피커 또는 이와 유사한 것들의 하나 이상을 포함할 수 있다. 로우-라인 레이저 레이더는 로우-라인 기계식 스캐닝 레이저 레이더 또는 단일-포인트 거리측정 레이저 레 이더(single-point ranging laser radar)(또한 단일-포인트 TOF 레이저 레이더로도 알려짐)일 수 있으며, 로우 -라인 레이저 레이더는 라이트 커튼(light curtain)과 같은 감지 평면(sensing plane)을 형성할 수 있으며, 감 지 평면을 통해 결정된 감지 정보는 처리 장치로 전송되거나 다른 구성 요소에 의한 사용을 위해 저장 장 치에 저장 될 수 있다. 예시적으로, 본 개시의 실시예에 따른 타겟 오브젝트와 아이템을 연관시키는 방법, 장치 및 시스템을 구현하기 위한 예시적인 전자 시스템의 각각의 장치는 통합적으로 배치되거나 분산 배치 될 수 있으며, 예를 들면, 처리 장치, 기억 장치, 입력 장치 및 출력 장치는 통합적으로 배치되고, 로우-라인 레이저 레이 더는 선반의 상부 에지 측, 하부 에지 측 또는 좌/우 에지 측과 같은 선반의 다른 위치에 별도로 배치된다.이해를 쉽게 하기 위해, 이러한 실시예의 전자 시스템의 응용 예는 이하에서 더 설명될 것이다. 전자 시스템은 슈퍼마켓, 도서관, 창고 등과 같이 선반이 배치된 장소에 설치될 수 있다. 여기서, 로우-라인 레이저 레이더는 선반에 배치될 수 있고, 로우-라인 레이저 레이더는 로우-라인 기계식 스캐닝 레이저 또는 단일-포인트 거리측 정 레이저 레이더일 수 있다. 전자 시스템이 제공되는 선반은 스마트 선반(smart shelf)으로 지칭될 수 있으며 다양한 경우에 유연하게 적용 될 수 있다. 제 2 실시예 이 실시예는 타겟 오브젝트를 아이템과 연관시키는 방법을 제공한다. 이해를 쉽게 하기 위해, 방법의 응용 시나 리오는 우선 본 실시예에서 다음과 같이 설명된다. 이 실시예의 선반은 랙, 책장, 냉장고, 냉기 캐비닛 등과 같은 아이템을 배치할 수 있는 임의의 장치일 수 있고, 선반의 구조와 실제 용도는 이 실시예에 제한되지 않는다. 또한 선반에 있는 아이템은 재고 보관 유닛 (SKU; Stock Keeping Unit)으로 지칭되며, 이는 단일 아이템이다. 아이템에 대해, 브랜드, 모델, 구성, 등급 (grade), 한 벌(suit), 패키지 용량, 유닛 및 용도와 같은 임의의 속성이 다른 아이템들과 다를 때, 단일 아이 템으로 지칭될 수 있다. 선반에 있는 각 아이템은 별도로 배치되며, 각 아이템의 수는 여러 개일 수 있고, 동일 한 유형의 다수 아이템들이 함께 배치된다. 실제 응용에서, 선반은 적층 구조물(lamination)과 함께 제공될 수 있으며, 각 적층 구조물은 아이템들의 다른 유형을 분리하기 위한 파티션이 추가로 제공될 수 있다. 물론, 선반 은 후크의 형태를 취하는 아이템을 걸 수도 있고, 다수의 저장 바스켓의 형태로 아이템을 수용할 수 있다. 본 개시의 실시예는 선반의 구조를 제한하지 않으며, 선반 위에 있는 아이템의 배치도 제한하지 않는다. 레이저 레이더는 선반에 장착된다. 레이저 레이더는 타겟의 위치 및 속도와 같은 특성 품질(characteristic quality)을 탐지하기 위해 레이저 빔을 방출하는 레이더 시스템이며, 예를 들면, 프로브 신호(레이저 빔)를 외 부로 방출하고, 타겟에 관한 정보를 얻기 위해, 타겟으로부터 반사된 수신 신호(타겟 공명)와 송신 신호를 비교 하여, 타겟과의 거리, 방위각, 심지어 모양과 같은 파라미터에 의해 타겟 탐지를 해낸다. 본 실시예에서 채택된 레이저 레이더의 라인 수(즉, 레이저 라인의 수)는 미리 설정된 라인 값보다 낮으며, 레이저 레이더는 로우-라 인 기계식 스캐닝 레이저 레이더 또는 단일-포인트 거리측정 레이저 레이더(또한 단일-포인트 TOF 레이저 레이 더로도 알려짐)일 수 있다. 이 실시예는 다음의 두 가지 응용 예를 제공한다. 응용 예 1: 레이저 레이더는 로우-라인 기계식 스캐닝 레이저 레이더이고, 레이저 라인의 수는 1-8 라인일 수 있고, 모든 로우-라인 기계식 스캐닝 레이저 레이더의 감지 범위 조합은 설계된 영역을 커버한다; 지정된 영역 은 레이저 레이더가 위치하는 선반의 진열 표면(exhibition surface)일 수 있다. 적어도 하나의 로우-라인 기계 식 스캐닝 레이저 레이더는 선반에 배치된다. 물론, 다른 선반의 다른 크기를 고려하면, 기계식 스캐닝 레이저 레이더의 탐지 범위가 제한되기 때문에, 선반의 일부 영역이 감지되지 않는 것을 방지하기 위해, 2개 이상의 로 우-라인 기계식 스캐닝 레이저 레이더가 선반에 설치될 수 있다. 도 2에 도시된 제 1 유형 선반의 구조의 개략도를 참조하면, 선반에는 선반의 상단부에 단일 1-라인 기계식 스캐닝 레이저 레이더(20a)만 제공되고, 또한 선반의 적층 구조물(10a)이 도시된다. 도 2에 도시된 바와 같 이, 1-라인 기계식 스캐닝 레이저 레이더(20a)는 선반의 상부 에지의 중심에 배치되고, 선반의 진열 표면 (도 2에서 파선으로 간단히 나타냄) 상에 \"라이트 커튼\"을 형성할 수 있고, 이 \"라이트 커튼\"은 레이저 레이더 의 감지 범위이기도 하다; 감지 범위는 평면일 수 있고 또는 일정한 공간을 가질 수 있으며, 선반의 진열 표면 을 커버할 수 있고 선반에 전시된 다양한 아이템을 감시할 수 있다. 만약 선반 위의 아이템을 가져가는 타겟 오 브젝트(사람이나 로봇 등과 같이, 아이템을 능동적으로 가져갈 수 있는 오브젝트)가 있으면, 타겟 오브젝트는 필연적으로 진열 표면 앞의 레이저 레이더에 의해 형성된 \"라이트 커튼\"에 접촉할 것이고, 1-라인 스캐닝 레이 저 레이더(20a)에 의해 탐지되어, 대응하는 감지 정보가 생성된다. 아이템을 가져가기 위해 선반 앞에 다수의 타겟 오브젝트가 존재하는 경우를 고려하면, 상호 교합(mutual occlusion)이 있을 수 있다. 예를 들어, 두 명 이상의 소비자가 동시에 선반 앞에서 아이템을 집어들 경우, 레 이저 레이더는 소비자가 아이템을 가져가는 동작 만을 감지하고, 소비자는 소비자에 의해 차단되어, 레이저 레이더에 의해 감지될 수 없다. 아이템 감시의 정확도를 더 향상시키기 위해, 상이한 방향으로부터 타겟 오브젝트를 감시하기 위한 다수의 레이저 레이더가 채택될 수 있으며, 다수의 타겟 오브젝트의 상호 교합에 대 해 개선할 수 있다. 특히, 선반 의 상부 에지 측에 2개의 1-라인 기계식 스캐닝 레이저 레이더(20a)가 제공되고, 각각의 1-라 인 기계식 스캐닝 레이저 레이더(20a)는 선반의 상부 한쪽 코너에 배치된 것을 나타내는, 도 3에 도시된 제 2 유형 선반의 구조의 개략도를 참조로 한다; 또한, 도 3은 아이템을 잡으려는 타겟 오브젝트가 간략하게 나타낸 다. 도 3으로부터 알 수 있는 바와 같이, 하나의 1-라인 기계식 스캐닝 레이저 레이더(20a)에 대해 영역 A 및 영역 B가 타겟 오브젝트에 의해 가려지고, 2 개의 1-라인 기계식 스캐닝 레이저 레이더(20a)의 조합에 대하여 타겟 오브젝트에 의해 영역 A가 가려지는 반면, 나머지 영역은 레이저 레이더의 탐지 가능한 범위 내에 있어, 레이저 레이더는 영역 A를 제외한 다른 영역의 타겟 오브젝트를 탐지할 수 있다. 다수의 레이저 레이더를 채택 함으로써 공동으로 탐지하는 이러한 모드는 다수의 타겟 오브젝트에 의해 상호 간에 가려진 영역의 크기를 감소 시킬 수 있고, 감시 신뢰성을 효과적으로 향상시킨다. 응용 예 2: 레이저 레이더는 단일-포인트 거리측정 레이저 레이더이며, 단일-포인트 거리측정 레이저 레이더의 수는 다수이다; 다수의 단일-포인트 거리측정 레이저 레이더는 미리 설정된 간격에 따라 정렬된다; 다수의 단일 -포인트 거리특정 레이저 레이더의 감지 범위 조합은 설계된 영역을 커버한다. 미리 설정된 간격은 동일한 간격 으로 배열될 수 있고, 또는 동일하지 않은 간격으로 배치 될 수 있으며, 이는 실제 필요에 따라 유연하게 설정 될 수 있다. 단일-포인트 거리측정 레이저 레이더는 또한 단일-포인트 ToF 레이저 레이더로 지칭될 수 있다. 다수의 단일-포 인트 ToF 레이저 레이더는 단일-포인트 ToF 배열을 형성하고, 선반에 배치될 수 있다. 특히, 단일-포인트 ToF 배열은 선반의 상부 에지, 하부 에지 및 좌측 및 우측 중 하나의 에지 상에 배치될 수 있고, 선반의 진열 표면 을 커버하는 \"라이트 커튼\"을 형성하기 위해, 다수의 단일-포인트 ToF 레이저 레이더를 결합한다. 이 실시예에서 채택된 단일-포인트 ToF 레이저 레이더의 주된 특징은 각 단일-포인트 ToF 레이저 레이더의 FoV(field of view)가 2 ° 미만인 것과 같이 발산 각도가 작고, 그러한 레이저 레이더에 의해 방출된 빔의 스 폿 크기가 인접한 단일-포인트 ToF 레이저 레이더들 사이의 이격 거리보다 작다는 것이다. 실제 응용에서, 구현 을 위해 스위스 회사 Espros의 TOFRANGE 600 모듈이 채택될 수 있다. 작은 발산 각도의 단일-포인트 ToF 레이저 레이더를 채택하는 것의 장점은 인접한 레이저 레이더들의 간섭을 크게 줄임으로써 위치 정확도를 향상시키는데 있다. 도 4에 도시된 제 3 유형 선반의 구조의 개략도를 참조하면, 도 4에 도시된 바와 같이, 다수의 단일-포인 트 ToF 레이저 레이더(20b)가 선반의 상부 에지 측에 배열되는 것을 나타낸 것으로, 다수의 단일-포인트 ToF 레 이저 레이더(20b)의 감지 범위 조합은 선반의 진열 표면을 커버한다; 그리고 각각의 단일-포인트 ToF 레이저 레 이더(20b)의 발산 각도는 작기 때문에, 타겟 오브젝트의 정확한 거리측정이 이뤄진다. 통상적으로, 종래 ToF 센서의 FoV는 상대적으로 넓은데, 예를 들어 모바일 폰에서 일반적으로 사용되는 ToF 센 서의 FoV는 약 25 °이고, 큰 FoV로 인해 가능한 문제는 다음과 같다: 타겟 오브젝트의 측정 거리를 구하기 위 해, ToF 센서는 통상 FoV 비전(즉, 센서의 감지 범위) 내에서 탐지된 각각의 타겟 오브젝트의 거리에 대한 가중 평균 처리를 수행한다. 감지된 타겟 오브젝트가 팔이고 팔과 ToF 센서 사이의 거리가 설정된 길이(예를 들어, 1m)를 초과한다고 가정하면, 팔의 면적은 TOF 센서의 FoV가 상대적으로 클 때, FoV 비전의 영역보다 훨씬 작으 며, 팔과 ToF 센서 사이의 계산된 측정 거리가 실제 거리에 대해 큰 오차를 초래하며, 잘못된 위치 지정의 원인 이 된다. 그러므로, 본 실시예는 일반적인 소비자 전자 장치(예를 들어, 모바일 폰)에 내장된 ToF 센서를 채택하지 않고, 대신 타겟 오브젝트의 접촉 좌표를 정확하게 결정하기 위해, 타겟 오브젝트를 감지하기 위한 작은 FoV를 갖는 단일-포인트 거리측정 레이저 레이더(즉, 단일-포인트 TOF 레이저 레이더)를 채택한다. 물론, 응용 예 1 및 응용 예 2는 제한으로 간주되어서는 안되며, 실제 응용에서, 로우-라인 레이저 레이더의 유 형, 개수 및 장착 방식은 선반의 크기, 요구되는 감시 데이터의 정확도 요구 사항 및 비용 요구 사항에 따라 유 연하게 선택될 수 있으므로, 자세한 설명은 생략한다. 상술한 레이저 레이더는 타겟 오브젝트를 아이템과 연관시키는 방법을 수행하는 처리 장치에 연결되어 있고, 처 리 장치는 컴퓨터와 유사한 스마트 단말과 같은, 데이터 처리 능력을 가진 게이트웨이 또는 다른 장치일 수 있 다. 처리 장치는 레이저 레이더의 감지 정보를 독립적으로 처리 할 수 있거나 서버에 연결될 수 있으며, 서버와 함께 정보를 분석 및 처리하고 처리 결과를 클라우드에 업로드할 수 있다. 상기 서론에 기초하여, 도 5에 도시된 바와 같은 아이템과 타겟 오브젝트를 연관시키는 방법의 흐름도를 참조하 면, 방법은 처리 장치에 의해 수행되고, 처리 장치는 선반에 장착된 레이저 레이더에 연결되고, 레이저 레이더 의 감지 범위는 선반에 있는 각 아이템을 커버한다. 상기 방법은 아래 구성을 포함한다: 단계 S502에서, 레이저 레이더가 타겟 오브젝트를 감지한 것으로부터 획득된 감지 정보를 취득한다. 여기서, 감 지 정보는 타겟 레이저 레이더에 대한 타겟 오브젝트의 거리 값 및 방위각을 포함할 수 있다. 타겟 오브젝트는 소비자, 독자(book reader), 직원 또는 이와 유사한 것 또는 감시될 작업 로봇일 수도 있다. 만약 쇼핑할 때라 면, 타겟 오브젝트는 소비자 일 수 있고, 재고를 저장할 때라면, 타겟 오브젝트는 직원 또는 로봇 등일 수 있고, 만약 도서관이라면, 타겟 오브젝트는 독자일 수 있다; 다른 상황에서의 타겟 오브젝트는 다른 신원을 가 짐을 이해해야 한다. 단계 S504에서, 감지 정보에 따라 감지 범위 내의 타겟 오브젝트의 트리거 포인트 좌표를 결정한다. 만약 레이저 레이더의 수가 하나라면, 예를 들어 1-라인 기계식 스캐닝 레이저 레이더 하나를 선반의 상단 에지 의 중앙에 배치하고, 고유의 레이저 레이더가 타겟 오브젝트를 탐지함으로써 감지 정보가 생성된다. 레이저 레 이더는 선반의 진열 표면에 \"라이트 커튼\"을 형성하고, \"라이트 커튼\"은 레이저 레이더의 감지 범위가 된다. 타 겟 오브젝트가 사람인 것을 예로 들면, 사람이 아이템을 집을 때, 손은 감지 범위에 접촉하고, 레이저 레이더는 감지 범위(즉, 전술한 트리거 포인트 좌표) 내에서 손의 좌표를 알 수 있다. 레이저 레이더의 수가 다수라면, 타겟 오브젝트가 존재하는 위치와 다른 위치에 따라 레이저 레이더 중 하나에 의해 타겟 오브젝트가 감지될 수 있고, 타겟 오브젝트가 아이템을 가져갈 때, 물론, 동시에 다수의 레이저 레이 더에 의해 감지될 수 있다. 본 실시예에서 타겟 오브젝트를 감지하는 레이저 레이더는 타겟 레이저 레이더로 지 칭되며, 상세하게 다음의 단계를 참조함으로써 실행이 수행될 수 있다: 감지 정보에 기초하여 타겟 레이저 레이더의 시리얼 코드를 결정한다; 여기서 감지 정보는 타겟 레이저 레 이더에 의해 생성되고, 감지 정보는 타겟 레이저 레이더에 대한 타겟 오브젝트의 거리 값 및 방위각을 포함한다. 타겟 오브젝트를 탐지한 레이저 레이더는 자신의 감지 정보를 처리 장치에 전송할 것은 이해되어야 하며, 처리 장치는 감지 정보에 따라 대응하는 타겟 레이저 레이더를 결정할 수 있다. 타겟 레이저 레이더의 시리얼 코드에 따라 타겟 레이저 레이더의 위치 좌표를 탐색한다. 전형적으로 각 레 이저 레이더는 선반에 고정되며 위치 좌표는 미리 교정되고 로컬 또는 클라우드에 저장된다. 구현 예에서, 처리 장치는 레이더 정보 테이블을 로컬에 저장할 수 있으며, 레이더 정보 테이블은 시리얼 코드와 레이더의 위치 좌 표 간의 대응 관계를 기록한다. 타겟 레이저 레이더에 대한 타겟 오브젝트의 거리 값, 방위각 및 타겟 레이저 레이더의 위치 좌표에 따라 감지 범위 내의 타겟 오브젝트의 트리거 포인트 좌표를 결정한다. 도 6에 도시된 좌표 결정의 원리의 개략도를 참조하면, 그것은 트리거 포인트 좌표를 결정하는 원리를 간단하게 설명한다. 도 6에서, 레이저 레이더(L)의 좌표는 (a, b)로 하고, 트리거 포인트(X)의 좌표는 (x, y)로 가정하면, 레이저 레이더에 의해 탐지된 X로부터의 거리는 d 이고, L에 대한 X의 방위각이 θ라 할 때, 트리커 포인트 좌표 x=a+d*cosθ, y=b+d*sinθ 는 간단하게 결정될 수 있다. 다수의 트리거 포인트 좌표가 있을 수 있 음을 이해할 수 있으며, 예를 들어, 타겟 오브젝트가 아이템에 집을 때, 손의 다수의 포인트가 타겟 레이저 레 이더에 의해 감지되고, 타겟 오브젝트의 감지된 포인트가 트리거 포인트가 된다. 단계 S506에서, 타겟 오브젝트의 트리거 포인트 좌표와 미리 저장된 각 아이템의 위치 좌표에 따라 타겟 오브젝 트와 연관된 아이템을 결정한다. 구체적으로는, 타겟 오브젝트의 트리거 포인트 좌표와 미리 저장된 각 아이템의 위치 좌표에 따라 타겟 아이템 이 결정될 수 있다; 여기서, 타겟 아이템의 위치 좌표는 타겟 오브젝트의 트리거 포인트 좌표로부터 미리 설정 된 거리 이내에 있다; 그 후, 타겟 아이템은 그 타겟 오브젝트와 연관된 아이템으로 결정된다. 실제 응용에서, 타겟 아이템의 중심 좌표가 타겟 아이템의 위치 좌표로 선택되는 것 및 다수의 트리거 포인트 좌표의 중심 좌표가 트리거 포인트 좌표로 선택되는 것과 같이, 타겟 아이템의 위치 좌표와 트리거 포인트 좌표 는 각각 대표 아이템으로 선택될 수 있다. 물론, 타겟 아이템의 위치 좌표는 좌표 포인트들의 세트 일 수도 있 고, 트리거 포인트 좌표는 여러 개일 수 있고, 타겟 아이템의 위치 좌표는 포인트 클라우드 A로 표시되고, 타겟 오브젝트의 트리거 포인트 좌표는 포인트 클라우드 B로 표시되면, 이후 포인트 클라우드 A와 포인트 클라우드 B 사이의 거리가 결정된다. 실제 응용에서, 두 포인트 클라우드의 일치도는 직접적으로 판단될 수 있고, 일치도가 높을수록 타겟 오브젝트의 위치 좌표가 타겟 오브젝트의 트리거 포인트 좌표에 가까워진다. 만약 트리거 포인트 좌표가 특정 아이템의 위치 좌표에 가까운 경우, 타겟 오브젝트가 이 아이템을 집은 것으로 결정될 수 있고, 이 아이템은 타겟 오브젝트와 연관된다. 본 개시의 실시예에 있어서, 상기에 제공된 아이템과 타겟 오브젝트를 연관시키는 방법에 의하면, 처리 장치는 레이저 레이더의 감지 정보에 따라 감지 범위 내에 있는 타겟 오브젝트의 트리거 포인트 좌표를 결정할 수 있고, 또한 타겟 오브젝트의 트리거 포인트 좌표와 미리 저장된 각 아이템의 위치 좌표에 따라 타겟 오브젝트와 연관된 아이템을 결정할 수 있다. 본 개시의 실시예는 선반 상의 각 아이템에 대해 균일한 탐지를 수행하기 위 해, 라인 수가 적은 레이저 레이더를 채택하기 때문에, 라인 수가 적은 레이저 레이더는 상대적으로 비용이 저 렴하고, 또한 고가의 인공지능 비전 머신(AI vision machine)을 필요로 하지 않으며, 각 아이템마다 하나 이상 의 거리 센서를 배열할 필요가 없으므로, 다양한 형태의 선반에 널리 적용될 수 있으며 다양한 응용 사례에 적 용될 수 있다. 처리 장치는 전형적으로 각 아이템의 위치 좌표를 미리 저장할 필요가 있고, 위치 좌표는 전형적으로 가로 방향 위치 좌표 및 세로 위치 좌표를 포함할 수 있다. 종래 방법은 각 아이템의 가로 및 세로 위치 좌표를 하나씩 교 정하기 위해, 매뉴얼(manual)을 사용하는데, 이는 시간이 오래 걸리고 힘들고 비효율적이다. 더욱이 적층 구조 물의 위치가 상하로 조정될 때, 아이템의 위치 좌표의 정확도를 보장하기 위해, 각 아이템의 세로 방향 위치 좌 표가 그에 따라 변경되고, 일반적으로 각 적층 구조물의 높이를 수동으로 재조정하고 그에 따라 각 아이템의 위 치 정보를 조정하는 것이 필요하다. 인건비를 줄이기 위해, 이 실시예는 각 아이템의 위치 좌표를 자동으로 결 정하기 위한 구체적인 구현을 제공하며, 이는 다음의 단계들에 의해 수행될 수 있다: 단계 1, 선반의 각 적층 구조물의 높이를 획득한다. 단계 2, 각 아이템의 위치 정보 및 크기 정보를 획득한다; 여기서, 위치 정보는 아이템이 위치하는 적층 구조물 의 시리얼 코드와 아이템이 위치하는 적층 구조물 상의 아이템의 수평 순서 번호를 포함한다. 즉, 각 아이템의 세로 위치, 가로 방향 위치 및 크기 정보가 획득된다; 세로 방향 위치는 아이템이 위치하는 적층 구조물의 시리 얼 코드에 의해 표시되며, 가로 방향 위치는 아이템이 위치하는 적층 구조물 상의 아이템의 순서 번호로 표시된 다. 단계 3, 각 아이템이 위치하는 적층 구조물의 시리얼 코드와 각 적층 구조물의 높이에 따라 각 아이템의 세로 방향 위치 좌표를 결정한다. 예를 들어, 하나의 선반은 적층 구조물 a, 적층 구조물 b, 적층 구조물 c 및 적층 구조물 d의 4 개의 적층 구조물을 포함하며, 선반의 초기 상태는 다음과 같다: 바닥에서부터 적층 구조물 a의 높이는 10cm이고, 바닥에서부터 적층 구조물 b의 높이는 40cm, 바닥에서부터 적층 구조물 c의 높이는 70cm, 바 닥에서부터 적층 구조물 d의 높이는 100cm이다. 각각 SKU-b1, SKU-b2 및 SKU-b3인 3가지 유형의 아이템은 적층 구조물 b 위에 놓여진다; 각각 SKU-c1, SKU-c2 및 SKU-c3인 3가지 유형의 아이템은 적층 구조물 c 위에 놓여진 다. SKU-b1 및 SKU-c1을 예로 들면, SKU-b1은 적층 구조물 b 상에 있고, 적층 구조물 b의 높이는 40cm이므로, SKU-b1의 세로 방향 위치 좌표는 40이다; 유사하게, SKU-c1의 세로 방향 위치 좌표는 70이다. 단계 4, 각 아이템의 수평 순서 번호와 크기 정보에 따라 각 아이템의 가로 방향 위치 좌표를 결정한다. SKU-b1, SKU-b2 및 SKU-b3이 선반 상에 순차적으로 배치된 것을 가정하면, SKU-b1의 가로 치수는 40cm이고, SKU-b2의 가로 치수는 30cm이고, SKU-b3의 가로 치수는 50cm인 것으로 알려지고, 만약 두 개의 인접한 SKU들 사 이에 일정하게 비어있는 간격(10cm로 가정됨)이 있다는 것을 추가적으로 가정하면, SKU-b1의 가로 방향 위치 좌 표는 0 ~ 40, SKU-b2의 가로 방향 좌표는 50 ~ 80, SKU-b3의 가로 방향 좌표는 90 ~ 140 인 것으로 설정될 수 있다. 구현 예에서, 각 SKU의 중심점은 각 SKU의 세로 위치 좌표와 함께 SKU의 가로 방향 위치 좌표로 취해질 수 있으 며, SKU-b1의 위치 좌표는 (20, 40)이고, SKU-b2의 위치 좌표는 (65, 40)이고, SKU-b3의 위치 좌표는 (115, 40) 인 것이 얻어진다. 선반 상의 다양한 유형의 아이템의 위치 좌표를 결정한 후에, 차후의 사용을 위해 다양한 유형의 아이템들의 위 치 좌표들은 처리 장치의 로컬 또는 클라우드에 저장될 수 있다. 상기 모드에서, 타겟 오브젝트의 트리거 포인트 좌표와 각 아이템의 위치 좌표에 따라, 처리 장치가 타겟 오브 젝트와 연관된 아이템을 결정하는 것을 용이하게 하기 위해, 선반 상의 다양한 유형의 아이템들의 위치 좌표는 아이템마다 수동 교정 없이도 쉽게 결정될 수 있으며, 즉, 타겟 오브젝트에 의해 취해진 아이템을 결정한다. 선반 상의 적층 구조물이 조정될 수 있다는 것을 고려하면, 예를 들어, 슈퍼마켓의 점원은 일반적으로 상품 배 치의 필요성 때문에, 선반 상의 적층 구조물의 높이를 조정하는데, 이에 기초하여, 본 실시예는 선반 상의 각 적층 구조물의 높이를 자동으로 획득하는 방법을 제공하며, 이는 다음과 같이 자세하게 설명된다. 선반에는 추가로 회로 기판이 세로 방향으로 제공된다; 회로 기판에는 미리 결정된 간격으로 세로 방향으로 다 수의 전기 접촉부가 제공된다; 각각의 적층 구조물에는 적층 구조물이 회로 기판 상의 전기 접촉부와 연결되는 보호관이 제공된다; 구체적으로, 회로 기판은 PCB(Printed Circuit Board)일 수 있다. 회로 기판 상의 각 전기 접촉부의 상태를 처리 장치에 보고하기 위해, 회로 기판은 또한 처리 장치에 연결된다. 이해를 쉽게 하기 위해, 회로 기판에 세로 방향으로 다수의 전기 접촉부가 제공되고, 서로 다른 전기 접촉부는 바닥으로부터의 높이가 서로 다른 것을 설명하는, 도 7에 도시된 회로 기판 구조의 개략도가 참조 될 수 있다; 각 전기 접촉부는 적층 구조물의 보호관에 연결되어 있지 않을 때 자유 상태로 간주될 수 있으며, 만 약 보호관에 연결되면 접촉 상태인 것으로 간주될 수 있다. 회로 기판의 세로 방향 길이는 선반의 높이와 매칭 될 수 있으며, 예를 들어, 회로 기판의 세로 방향 길이는 선반의 높이와 동일하다; 선반의 상단 및 하단 적층 구조물이 일반적으로 해당 위치에 고정되어 있다는 것을 고려하여, 선반의 중간의 다수 적층 구조물의 위치를 감지하는 데에만 사용되도록, 회로 기판의 세로 방향 길이는 적절히 감소될 수 있다. 도 8에 도시된 회로 기판이 장착된 선반의 측면도를 참조하면, 회로 기판은 선반의 후면(backplane) 상 에 장착된 것을 도시하고 있다. 물론, 선반이 후면을 갖지 않는 경우, 회로 기판은 선반의 지지 바(support bar)에 장착 될 수 있으며, 선반 구조와 관계없이, 회로 기판은 선반과 적층 구조물 사이의 고정 된 측에 위치 시킬 필요가 있고, 선반과 접합될 때 적층 구조물은 회로 기판과 접촉할 필요가 있다. 도 8에 도시된 바와 같이, 다수의 전기 접촉부는 회로 기판 상에 배치되고, 보호관(도 8에 명시적으로 도시되지 않음)은 4 개의 적층 구조물(10a)의 각각과 선반의 후면 연결되는 곳에 제공되며, 보호관은 전기 접촉부와 접촉한다. 적층 구조물의 높이를 조절하면, 보호관이 접촉하는 전기 접촉부도 자연스럽게 변경된다. 구현 예에서, 다수의 전기 접촉부는 회로 기판 상에 배치된 프로세싱 칩(회로 기판 프로세싱 칩으로 지칭 됨)에 직접 연결될 수 있으며, 전기 접촉부가 적층 구조물 상의 보호관에 연결될 때, 전기 접촉부는 회로 기판 프로세 싱 칩에 낮은(low) 레벨 신호를 보내는 반면, 자유 상태인 전기 접촉부와 연결되지 않은 보호관은 항상 회로 기 판 프로세싱 칩에 높은(high) 레벨 신호를 보낸다. 회로 기판 프로세싱 칩은 수신 신호에 기초하여 각 전기 접 촉부의 상태를 결정하고 각 전기 접촉부의 상태를 처리 장치에 전송할 수 있다. 물론, 보호관에 연결된 전기 접 촉부는 회로 기판 프로세싱 칩에 높은 레벨 신호를 전송할 수 있으며, 보호관에 연결되지 않은 전기 접촉부는 회로 기판 프로세싱 칩에 낮은 레벨 신호를 전송하는데, 이는 본 구현 예에 제한되지 않는다. 적층 구조물의 높 이가 추가로 결정될 수 있도록, 각 전기 접촉부에 의해 전송되는 신호에 따라, 처리 장치는 어떤 전기 접촉부가 적층 구조물의 보호관에 연결되어 있는지 식별할 수 있다. 이에 기초하여, 처리 장치가 선반의 각 적층 구조물의 높이를 획득할 때, 실행을 위해 다음의 단계를 참조할 수 있다: 회로 기판 상의 각 전기 접촉부의 상태를 획득한다; 상기 상태는 자유 상태 또는 접촉 상태를 포함한다. 자 유 상태는 전기 접촉부가 보호관(thimble)에 연결되지 않은 상태(빈 상태라고도 함)이다. 접촉 상태는 전기 접 촉부가 적층 구조물의 보호관과 연결된 상태이다. 각 전기 접촉부의 상태에 따라 타겟 전기 접촉부의 시리얼 코드를 결정한다; 여기서, 타겟 전기 접촉부는 접촉 상태의 전기 접촉부이고; 타겟 전기 접촉부의 수는 적층 구조물의 수와 매칭된다. 예를 들어 회로 기판의 바닥부터 맨 끝까지 순서대로 C1에서 C20까지 20 개의 전기 접촉부가 있고, C2, C8, C14 및 C19의 상태는 접촉 상태이고, 나머지 전기 접촉부는 모두 자유 상태이며, C2, C8, C14 및 C19는 타겟 전기 접촉부고, 만약 하나의 적층 구조물이 하나의 보호관을 갖는다면, 타겟 전기 접촉부의 수는 적층 구조물의 수와 동일하고, 총 4 개의 적층 구조물이 결정될 수 있다. 타겟 전기 접촉부의 시리얼 코드 및 미리 설정된 전기 접촉부 정보 테이블에 따라 각각의 타겟 전기 접촉부 의 위치 정보를 탐색한다; 여기서, 전기 접촉부 정보 테이블은 시리얼 코드와 전기 접촉부의 위치 정보 간의 대 응 관계를 저장한다. 간결함을 위해, 전기 접촉부의 위치 정보는 높이에 의해서만 표시된다. 각 타겟 전기 접촉부의 위치 정보에 기초하여 각 적층 구조물의 높이를 결정한다. 예를 들어, C2, C8, C14 및 C19의 높이는 각각 10cm, 40cm, 70cm 및 100cm이면, 적층 구조물과 전기 접촉부 사이의 대응 관계는 다음과 같이 결정된다: 적층 구조물 a는 C2에 대응하고, 적층 구조물 b는 C8에 대응하고, 적층 구조물 c는 C14에 대응 하고, 적층 구조물 d는 C19에 대응한다. 즉, 바닥으로부터 적층 구조물 a의 높이가 10cm이고, 바닥으로부터 적 층 구조물 b의 높이는 40cm이고, 바닥으로부터 적층 구조물 c의 높이는 70cm이고, 바닥으로부터 적층 구조물 d 의 높이는 100cm이다. 관련 직원이 적층 구조물 b의 높이를 조정하고, 처리 장치에 의해 획득된 각각의 전기 접촉부의 상태는 C2, C10, C14 및 C19가 접촉 상태에 있고, C10의 높이가 48cm 인 것을 가정하면, 이에 대응하여, C10은 적층 구조물 b와 대응하고, 적층 구조물 b의 현재 높이는 48cm인 것이 밝혀진다; 다른 적층 구조물들의 위치는 변하지 않는 다. 이 경우, 처리 장치는 선반 상의 아이템의 위치 정확도를 보장하기 위해, 적층 구조물 b 상에 있는 각 아이 템의 세로 방향 위치 좌표를 추가로 수정할 수 있다. 또한, 종래 선반 상에 전자 태그, 헤드 램프 및 이와 유사한 것과 같은 전자 기기도 있을 수 있다는 것을 고려 하면, 각 적층 구조물상의 전자 기기에 전력을 공급하기 위해, 전원이 회로 기판 상에 배치될 수도 있다. 도 9 에 도시된 또 다른 회로 기판 구조의 개략도를 참조하면, 접촉 영역(30a)과 전원 영역(30b)이 도시되어 있으며, 전원 영역(30b)은 접촉 영역(30a)과 나란히 배치되고, 또한 세로 방향으로 연장된 영역이다. 전원 영역(30b)은 하나의 전원 입력 단자와 다수의 전원 출력 단자를 가질 수 있다; 전원 입력 단자는 외부 전원과 한결같이 연결 될 수 있고, 전원 출력 단자는 선반 상의 각 적층 구조물의 고정된 전기 장치에 전력을 공급할 수 있다. 회로 기판은 선반의 측면에 수직으로 고정되고 전원 영역의 길이가 선반의 높이와 매칭되기 때문에, 선반의 각 적층 구조물 상에 고정된 전자 장치에 전력을 공급하는 것이 더 편리하며, 종래 선반은 자체 구조의 제약으로 선반에 설치된 각 전자 기기에 전원을 공급하는 것이 불편하다는 문제점을 개선하였다. 본 실시예에 의해 제공되는 아이템과 타겟 오브젝트를 연관시키는 방법은 주로 타겟 오브젝트가 선반 상의 아이 템에 접촉하는 것이 작아지도록 로우-빔 레이저 레이더의 방식을 주로 채용하고, 또한 회로 기판을 사용함으로 써 적층 구조물의 높이를 자동으로 획득한다. 스마트 소매 시나리오, 스마트 도서관, 스마트 창고/물류 산업 등 과 같이 타겟 오브젝트와 아이템 간의 관계를 감시할 필요가 있는 경우에 널리 사용될 수 있다. 이 실시예의 장 점은 스마트 소매 시나리오를 예시로 하여 아래에서 더 설명되는데, 여기서 타겟 오브젝트는 소비자이고 아이템 은 선반 상의 상품이다. 스마트 소매 시나리오에서, 인공지능 비전 머신은 전형적으로 여러 각도에서 이미지 정보를 캡처하기 위해 선반에 배치된 다수의 카메라가 필요하다. 그런데 비용이 비싸고, 다른 한편으로, 카메라의 배치는 소비자에게 심리적 부담을 가져오기 쉽고, 카메라가 실시간으로 소비자의 초상 정보를 수집할 것이기 때문에, 소비자의 개 인 정보가 노출될 수도 있으며, 소비자는 안도감을 느끼기 어렵고, 사용자 경험이 좋지 않을 수 있다. 본 실시예에 의해 제공되는 로우-라인 레이저 레이더는 선반의 진열 표면 상에 \"라이트 커튼\"을 형성 할 수 있 는데, \"라이트 커튼\"을 통해 소비자를 감지하고 소비자의 이미지 정보를 수집하지 않으며, 기본적으로 소비자의 개인 정보를 수반하지 않아, 소비자의 편안한 쇼핑을 가능하게 한다. 보통의 상황에서, 레이저 레이더의 라인 수가 적을수록 비용은 낮아진다. 이 실시예는 소비자가 상품을 가 져가는 행동을 감시하기 위해, 저가의 로우-라인 레이저 레이더를 채택하며, 예를 들어, 1-라인 스캐닝 레이저 레이더는 감시 효과를 얻을 수 있는데, 비용은 인공지능 비전 머신과 깊이 센서보다 훨씬 저가이다. 현재 깊이 센서의 비용은 여전히 고가인 것은 이해될 수 있고, 본 실시예의 로우-라인 레이저 레이더는 저가이며 다양한 경우에 널리 적용될 수 있다. 본 실시예에서 채택되는 레이저 레이더의 개수는, 상품을 가져가는 소비자가 탐지될 수 있고, 선반 상의 상 품의 감시가 이루어지도록, 적어도 하나일 수 있고, 선반의 에지에 배치될 수 있다. 선반의 각 아이템에 대응되 도록 하나 이상의 적외선 거리 센서가 둘 필요가 없다. 본 실시예에서 제공되는 모드의 배선은 간단하며, 유 리 냉장고 또는 냉기 캐비닛과 같은 특별한 유형의 선반에도 적합하여 구현하기가 편리하다. 본 실시예는 전기 접촉부가 제공된 회로 기판을 사용함으로써 선반 상의 적층 구조물의 높이를 알 수 있고, 적층 구조물의 높이를 조정하더라도, 층이 조정된 각 적층 구조물의 높이가 자동으로 획득될 수 있고, 추가적으 로 그에 대응하여 각 상품의 위치 좌표가 결정될 수 있으므로, 소비자와 상품 간의 연관성의 정확도를 보장한다. 이 방법은 적층 구조물의 높이를 수동으로 재교정할 필요가 없어, 인건비를 더 절약하고, 효율성을 향상시키는 동시에 데이터 정확도를 향상시키므로, 수동 교정과 함께 발생하는 측정 오류 및 기록 오류와 같은 일반적인 문제를 방지한다. 본 실시예에서 제공되는 회로 기판에는 선반 상의 각 적층 구조물의 고정된 전자 기기에 전력을 공급하는 것이 더 편리하도록, 전원 영역이 더 제공될 수 있고, 전원 영역의 길이도 선반의 높이와 매칭시켜, 종래 선반 이 자체 구조물의 한계로 인해 선반에 설치된 다양한 전자 기기에 전력을 공급하는 것이 불편하다는 문제점에 대한 개선이 이뤄진다."}
{"patent_id": "10-2018-0156820", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하면, 이 실시예에 의해 제공되는 아이템과 타겟 오브젝트를 연관시키는 방법은 타겟 오브젝트가 선반상의 아이템들과 접촉하는 것을 감시하기 위해 주로 로우-라인 레이저 레이더를 채택하여, 더 향상된 “사람-상품 관계”를 수립하고, 로우-라인 레이저 레이더는 일반적으로 타겟 위치(거리 및 각도)를 더 정확하게 측정 할 수 있고, 비용은 인공지능 비전, 하이(high)-라인 레이저 레이더 및 깊이 센서보다 훨씬 낮아, 다양한 유형의 선반 에 널리 사용되어 다양한 감시 상황에 적합하다. 제 3 실시예 전술한 실시예에서 제공된 아이템과 타겟 오브젝트를 연관시키는 방법에 대응하여, 이 실시예는 타겟 오브젝트 를 아이템과 연관시키는 장치를 제공하며, 여기서 장치는 처리 장치에 적용되고, 처리 장치는 선반 상에 장착된 레이저 레이더에 연결된다; 레이저 레이더의 라인 수는 미리 설정된 라인 값보다 낮으며, 레이저 레이더의 감지 범위는 설계된 영역을 커버한다. 도 10에 도시된 아이템과 타겟 오브젝트를 연관시키는 장치의 구조의 블록도를 참조하면, 장치는: 레이저 레이더가 타겟 오브젝트를 감지한 것으로부터 획득된 감지 정보를 취득하도록 구성된 감지 정보 취득 모 듈; 감지 정보에 따라 감지 범위 내에서 상기 타겟 오브젝트의 트리거 포인트 좌표를 결정하는 트리거 포인트 결정 모듈; 및 타겟 오브젝트의 트리거 포인트 좌표 및 미리 저장된 각 아이템의 위치 좌표에 따라 타겟 오브젝트와 연관된 아 이템을 결정하도록 구성된 연관성 결정 모듈을 포함한다. 본 개시의 실시예에서 제공되는 아이템과 타겟 오브젝트를 연관시키는 장치에 있어서, 처리 장치는 레이저 레이 더의 감지 정보에 따라 감지 범위 내에서 타겟 오브젝트의 트리거 포인트 좌표를 결정할 수 있고, 추가적으로 타겟 오브젝트의 트리거 포인트 좌표와 미리 저장된 각 아이템의 위치 좌표에 따라, 타겟 오브젝트와 연관된 아 이템을 결정할 수 있다. 본 개시의 실시예는 선반 상의 각 아이템에 대해 한결같은 탐지를 수행하기 위해 라인 수가 적은 레이저 레이더를 채택하기 때문에, 적은 라인 수의 레이저 레이더는 상대적으로 저렴한 비용으로, 고 가의 인공지능 비전 머신을 필요로 하지 않으며, 또한, 각 아이템마다 하나 이상의 거리 센서를 배치할 필요가 없으므로, 다양한 형태의 선반에 널리 적용될 수 있으며 다양한 적용 응용 사례에 적용될 수 있다. 구현 예에서, 레이저 레이더는 기계식 스캐닝 레이저 레이더다; 기계식 스캐닝 레이저 레이더의 개수는 적어도 하나이고; 모든 기계식 스캐닝 레이저 레이더의 감지 범위의 조합은 선반 상의 각 아이템을 커버한다. 또 다른 구현 예에서, 레이저 레이더는 단일-포인트 거리측정 레이저 레이더이며, 단일-포인트 거리측정 레이저 레이더의 개수는 다수이다; 그리고 다수의 단일-포인트 거리측정 레이저 레이더는 미리 설정된 간격에 따라 정 렬되고; 다수의 단일-포인트 거리측정 레이저 레이더의 감지 범위 조합은 선반의 각 아이템을 커버한다. 명세서 구현 예에서, 트리거 포인트 결정 모듈은: 감지 정보에 기초하여 타겟 레이저 레이더의 시리얼 코드를 결정; 여기서 감지 정보는 타겟 레이저 레이더에 의 해 생성되고, 감지 정보는 타겟 레이저 레이더에 대한 타겟 오브젝트의 거리 값 및 방위각을 포함함; 타겟 레이저 레이더의 시리얼 코드에 따라 타겟 레이저 레이더의 위치 좌표를 탐색; 및 타겟 레이저 레이더에 대한 타겟 오브젝트의 방위각, 거리 값 및 타겟 레이저 레이더의 위치 좌표에 따라 감지 범위 내에서 타겟 오브젝트의 트리거 포인트 좌표를 결정하도록 구성된다. 상술한 연관성 결정 모듈은: 타겟 오브젝트의 트리거 포인트 좌표와 미리 저장된 상기 각 아이템의 위치 좌표에 따라 타겟 아이템을 결정; 여기서 타겟 아이템의 위치 좌표는 타겟 오브젝트의 트리거 포인트 좌표로부터 미리 설정된 거리 이내인 것; 및 타겟 아이템을 타겟 오브젝트와 연관된 아이템으로 결정하도록 구성된다. 또한, 상술된 장치는 추가적으로: 선반의 각 적층 구조물의 높이를 획득하도록 구성된 높이 획득 모듈; 상기 각 아이템의 위치 정보 및 크기 정보를 획득하도록 구성된 아이템 정보 취득 모듈; 여기서 위치 정보는 아 이템이 위치하는 적층 구조물의 시리얼 코드 및 아이템이 위치하는 적층 구조물 상의 아이템의 수평 순서 번호 를 포함함;상기 각 아이템이 위치하는 적층 구조물의 시리얼 코드 및 각 적층 구조물의 높이에 따라 상기 각 아이템의 세 로 방향 위치 좌표를 결정하도록 구성된 세로 방향 좌표 결정 모듈; 및 수평 순서 번호 및 상기 각 아이템의 크기 정보에 따라 상기 각 아이템의 가로 방향 위치 좌표를 결정하도록 구 성된 가로 방향 좌표 결정 모듈을 포함한다. 구현 예에서, 선반에는 추가적으로 회로 기판이 세로 방향으로 제공된다; 회로 기판에는 미리 결정된 간격으로 세로 방향으로 다수의 전기 접촉부가 제공되고; 각 적층 구조물에는 적층 구조물이 회로 기판 상의 전기 접촉부 와 연결되는 보호관이 제공된다. 이에 기초하여, 상술된 높이 취득 모듈은 추가적으로: 회로 기판 상의 각 전기 접촉부의 상태를 획득; 상태는 자유 상태 또는 접촉 상태를 포함함; 각 전기 접촉부의 상태에 따라 타겟 전기 접촉부의 시리얼 코드를 결정; 여기서 타겟 전기 접촉부는 접촉 상태 인 전기 접촉부이고; 타겟 전기 접촉부의 수는 적층 구조물의 수와 매칭됨; 타겟 전기 접촉부의 시리얼 코드 및 미리 설정된 전기 접촉부 정보 테이블에 따라 각각의 타겟 전기 접촉부의 위치 정보를 탐색; 여기서 전기 접촉부 정보 테이블은 시리얼 코드와 전기 접촉부의 위치 정보 사이의 대응 관 계를 저장함; 및 각각의 타겟 전기 접촉부의 위치 정보에 기초하여 각각의 적층 구조물의 높이를 결정하도록 구성된다. 또 다른 구현 예에서, 상술한 회로 기판은 각 적층 구조물 상의 전자 기기에 전력을 공급하기 위한 전원이 추가 적으로 제공되며; 전자 기기는 전자 태그 및/또는 헤드 램프를 포함한다. 본 실시예에서 제공되는 장치의 구현 원리 및 장치에 의해 발생되는 기술적 효과는 전술한 실시예와 동일하다. 간결함을 위해, 장치 실시예에서 언급되지 않은 것들에 관해서는, 전술한 방법 실시예에서 대응하는 내용이 참 조될 수 있다. 제 4 실시예 이 실시예는 타겟 오브젝트를 아이템과 연관시키는 시스템을 제공하며, 시스템은 레이저 레이더 및 처리 장치를 포함한다. 레이저 레이더는 감지 정보를 생성하도록 구성된다; 처리 장치는 컴퓨터 프로그램을 저장하고, 컴퓨 터 프로그램이 처리 장치에 의해 실행될 때, 제 2 실시예의 임의의 구현 예에 따른 방법이 실행된다. 해당 기술 분야의 통상의 기술자가 상술한 시스템의 특정 작업 프로세스에 대한 설명의 편의 및 간략화를 위해, 전술한 방법 실시예에서 대응하는 프로세스가 참조될 수 있으며, 여기에 세부 사항은 반복되지 않는다. 또한, 본 실시예는 컴퓨터 프로그램을 저장한 컴퓨터-판독가능 저장 매체를 추가로 제공하며, 컴퓨터 프로그램 이 처리 장치에 의해 실행될 때, 제 2 실시예에서 제공된 방법의 단계들이 실행된다. 본 개시의 실시예들에 의해 제공되는 아이템과 타겟 오브젝트를 연관시키는 방법, 장치 및 시스템의 컴퓨터 프 로그램 제품은 프로그램 코드를 저장하는 컴퓨터-판독가능 저장 매체를 포함하고, 프로그램 코드는 상술한 방법 실시예들에서 설명된 방법을 실행하기 위한 명령어들을 포함한다. 구체적인 구현에 관해서는, 방법 실시예에 대 한 참조가 이루어질 수 있으며, 상세한 설명은 여기에서 반복되지 않는다. 소프트웨어 기능적인 모듈의 형태로 구현되어 독립적인 제품으로 판매 및 사용되는 경우, 상술한 기능들은 또한 하나의 컴퓨터-판독가능 저장 매체에 저장될 수 있다. 이러한 이해에 기초하여, 기술적 해결 방안 부분 또는 본 개시의 기술적 해결 방안 부분의 선행 기술에 기여하는 본질 또는 일부는 소프트웨어 제품의 형태로 반영 될 수 있고, 컴퓨터 소프트웨어 제품은 하나의 저장 매체에 저장될 수 있으며, 컴퓨터 장치(개인용 컴퓨터, 서버 또는 네트워크 장치일 수 있음)로 하여금 본 개시의 다양한 실시예에서 설명된 방법을 완전히 또는 부분적으로 수행 하게 하는 여러 명령어를 포함할 수 있다. 상기 저장 매체는 모바일 저장 장치, ROM(Read Only Memory), 자기 디스크 또는 광 디스크와 같이 프로그램 코드를 저장할 수 있는 다양한 매체를 포함한다. 마지막으로, 상기 실시예들은 본 개시의 기술적 해결 방안을 설명하기 위해 채택된 특정 구현 예일 뿐이며, 본 개시를 한정하는 것은 아니고, 본 개시의 보호 범위가 이에 한정되는 것은 아니다. 비록 본 개시는 상기 실시예 를 참조하여 자세하게 설명되었지만, 해당 기술 분야의 통상의 기술자는 본 개시에 의해 밝혀진 기술적 범위 내 에서, 전술한 실시예에 기록된 기술적 해결 방안에 대해 다양한 변형이 가해질 수 있거나 또는 용이하게 변경될 수 있거나, 또는 기술적 특징의 일부가 등가물로 대체될 수 있으며, 이러한 변형 또는 대체를 갖는 대응하는 기술적 해결 방안의 본질은 여전히 본 개시의 실시예의 기술적 해결 방안의 사상 및 범위에 속함을 이해하여야한다. 이러한 변형, 변경 및 대체는 대응하는 기술적 해결 방안이 본 개시의 실시예에서 기술적 해결 방안의 사 상 및 범위를 벗어나지 않으며, 본 개시 내용의 보호 범위 내에 있어야 한다. 그러므로, 본 개시의 보호 범위는 첨부된 청구 범위에 의해 결정되어야 한다."}
{"patent_id": "10-2018-0156820", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 특정 구현 또는 종래 기술의 기술적 해결을 더 명확하게 설명하기 위해, 특정 구현 또는 종래 기술을 설명하기 위해 필요한 도면이 아래에 간단히 소개될 것이고, 다음의 도면은 본 개시의 구현의 일부이고, 해당 기술 분야의 통상의 기술자를 위해, 창조적인 노력을 기울이지 않고 이들 도면을 기초로 다른 도면을 얻는 것이 가능하다. 도 1은 본 개시의 실시예에 의해 제공되는 전자 시스템 구조의 개략도를 나타낸 것이다. 도 2는 본 개시의 실시예에 의해 제공되는 선반의 제 1 유형의 구조의 개략도를 나타낸 것이다. 도 3은 본 개시의 실시예에 의해 제공되는 선반의 제 2 유형의 구조의 개략도를 나타낸 것이다. 도 4는 본 개시의 실시예에 의해 제공되는 선반의 제 3 유형의 구조의 개략도를 나타낸 것이다. 도 5는 본 개시의 실시예에 의해 제공되는 타겟 오브젝트에 아이템을 연관시키는 방법의 흐름도를 나타내는 것 이다. 도 6은 본 개시의 실시예에 의해 제공되는 좌표 결정 원리의 개략도를 나타내는 것이다. 도 7은 본 개시의 실시예에 의해 제공되는 회로 기판의 구조의 개략도를 나타내는 것이다. 도 8은 본 개시의 실시예에 의해 제공되는 회로 기판에 장착된 선반의 측면도를 나타내는 것이다. 도 9는 본 개시의 실시예에 의해 제공되는 다른 회로 기판 구조의 개략도를 나타내는 것이다. 도 10은 본 개시의 실시예에 의해 제공되는 타겟 오브젝트에 아이템을 연관시키는 장치 구조의 블록도 나타내는 것이다."}
