{"patent_id": "10-2022-0175219", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0092451", "출원번호": "10-2022-0175219", "발명의 명칭": "화장품 규정변동 예측 장치 및 방법", "출원인": "주식회사 씨디알아이", "발명자": "김준일"}}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통신을 수행하는 인터페이스부; 및상기 인터페이스부를 통하여 화장품 규정의 정보를 제공하는 적어도 하나의 싸이트에서 국가별 화장품 규정의정보를 수집하고,상기 수집한 국가별 화장품 규정의 정보로부터 국가별 규정유사도를 식별하고,상기 국가별 규정유사도을 기초로 상기 화장품 규정에 대한 선발국가와 후발국가를 선정하고,상기 선정된 선발국가의 화장품 규정에 기초하여 상기 후발국가에 발생될 수 있는 화장품 규정의 변동을 예측하는 프로세서를 포함하는 화장품 규정 변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,TF-IDF(Term Frequency - Inverse Document Frequency) 벡터화를 통해 상기 화장품 규정의 특징 벡터를 추출하고,상기 특징벡터의 코사인 유사도(Cosine Similarity)에 의해 상기 국가별 규정유사도를 식별하는 화장품 규정변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는 상기 화장품 규정의 국가별 규정유사성 산점도를 시각화하는 화장품 규정변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 국가별 규정유사성 산점도는,TF-IDF 벡터화를 통해 상기 화장품 규정의 특징 벡터를 추출하고,주성분 분석(Principal Component Analysis; PCA)을 통해 추출된 특징 벡터를 3차원으로 축소하여 시각화되는화장품 규정변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는 상기 화장품 규정의 국가별 규정유사성 산점도에서 군집을 이루는 국가들 중에서 상기 선발국가와 후발국가를 선정하는 화장품 규정변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서는,국가별 화장품 규정의 정보를 수집하고,상기 국가별 화장품 규정의 정보로부터 TF-IDF 벡터화 과정을 거쳐 특징벡터를 추출하고,공개특허 10-2024-0092451-3-후발국가와 선발국가 간 규정유사도를 계산하고,전문가에 의해 휴리스틱으로 입력된 파생스코어(Derivative Score)값에 임계값을 적용하여 선발국가를 필터링하고, 국가간 규정유사도를 곱하여 PRC(Probability of Regulatory Change)값을 계산하고,상기 PRC값 중 상위인 선발국가를 선정하는 화장품 규정변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는,상기 후발국가와 상기 선발국가의 규정유사도를 계산하고,상기 규정유사도가 임계값보다 작은 경우, 상기 선발국가의 화장품 규정을 향후 상기 후발국가의 규정변동 사항으로 예측하는 화장품 규정변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는 상기 규정유사도가 임계값 이상이고 수치의 변동이 없는 경우, 예측 결과가 없음을 출력하는화장품 규정변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 프로세서는 상기 규정유사도가 임계값 이상이고 수치의 변동이 있는 경우, 상기 선발국가의 화장품 규정을향후 상기 후발국가의 규정변동 사항으로 예측하는 화장품 규정변동 예측 장치."}
{"patent_id": "10-2022-0175219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "화장품 규정의 정보를 제공하는 적어도 하나의 싸이트에서 국가별 화장품 규정의 정보를 수집하는 단계;상기 수집한 국가별 화장품 규정의 정보로부터 국가별 규정유사도를 식별하는 단계;상기 국가별 규정유사도 및 상기 화장품 규정의 시행시점을 기초로 상기 화장품 규정에 대한 선발국가와 후발국가를 선정하는 단계; 및상기 선정된 선발국가의 화장품 규정에 기초하여 상기 후발국가에 발생될 수 있는 화장품 규정의 변동을 예측하는 단계를 포함하는 화장품 규정변동 예측 방법."}
{"patent_id": "10-2022-0175219", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "신규한 화장품 규정 변동 예측 장치가 제공된다. 화장품 규정 변동 예측 장치는 통신을 수행하는 인터페이스부 및 상기 인터페이스부를 통하여 화장품 규정의 정보를 제공하는 적어도 하나의 싸이트에서 국가별 화장품 규정의 정보를 수집하고, 상기 수집한 국가별 화장품 규정의 정보로부터 국가별 규정유사도를 식별하고, 상기 국가별 규 정유사도을 기초로 상기 화장품 규정에 대한 선발국가와 후발국가를 선정하고, 상기 선정된 선발국가의 화장품 규정에 기초하여 상기 후발국가에 발생될 수 있는 화장품 규정의 변동을 예측하는 프로세서를 포함한다."}
{"patent_id": "10-2022-0175219", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 화장품에 대한 국가 규정 변동을 예측할 수 있는 화장품 규정변동 예측 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0175219", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인체에 적용되는 화장품은 국가마다 독자적인 화장품 법규(조약, 규정, 지침 및 법령)에 의해 규정되고 있다. 더불어, 화장품 안전 관리 규정은 점차 강화되는 추세에 있어 수출기업에게 높은 진입장벽으로 작용하고 있다. 화장품규정에서 화장품은 주로 인체를 청결하게 하고 방향을 부여하고 또는 건강한 상태를 유지하기 위해 보호 하고 용모를 변화시키거나 체취를 정돈하는 것을 목적으로 인체의 모든 외피부분(피부, 모발조직, 손톱, 입술 및 외부 생식기관) 또는 치아 및 구강점막에 도포되는 물질 또는 혼합물을 의미한다. 화장품 성분 규정 체계에는 배합금지, 배합한도 성분리스트와 사용이 가능한 색소(착색제), 보존제, 자와선차단 제 리스트가 있다. 배합금지 성분 리스트는 화장품에 포함되어서는 안되는 성분리스트이고, 배합한도 성분리스 트는 함유될 수 있는 최대 농도가 정해져 있어, 제한 조건만 준수한다면 사용할 수 있는 성분리스트이다. 또한, 색소(착색제), 보존제, 자와선차단제는 제한 조건과 함께 사용할 수 있는 성분과 한도가 정해져 있다.그러나 화장품 판매자는 예상하지 못한 규정의 변동으로 판매 중인 제품의 처방을 바꿔야 하는 경우 3달간의 안 정성 시험 등을 거처야 하기 때문에 시간 및 비용의 낭비가 발생한다. 또한, 예상하지 못한 규정의 변동이 발생하면, 규정 변동을 반영한 새로운 제품의 개발이나 인증에 상당 기간이 소요되고, 그 결과 화장품 판매에 악영을 끼칠 수 있다."}
{"patent_id": "10-2022-0175219", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 제품을 수출하는 국가의 화장품 관련 규정 변동을 미리 예측할 수 있는 화장품 규정변동 예측 장치 및 방법을 제공하는 데에 있다."}
{"patent_id": "10-2022-0175219", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 달성하기 위한 화장품 규정 변동 예측 장치가 제공된다. 화장품 규정 변동 예측 장치는 통신을 수행하는 인터페이스부 및 상기 인터페이스부를 통하여 화장품 규정의 정보를 제공하는 적어도 하나의 싸이트에 서 국가별 화장품 규정의 정보를 수집하고, 상기 수집한 국가별 화장품 규정의 정보로부터 국가별 규정유사도를 식별하고, 상기 국가별 규정유사도을 기초로 상기 화장품 규정에 대한 선발국가와 후발국가를 선정하고, 상기 선정된 선발국가의 화장품 규정에 기초하여 상기 후발국가에 발생될 수 있는 화장품 규정의 변동을 예측하는 프 로세서를 포함한다. 상기 프로세서는, TF-IDF(Term Frequency - Inverse Document Frequency) 벡터화를 통해 상기 화장품 규정의 특징 벡터를 추출하고, 상기 특징벡터의 코사인 유사도(Cosine Similarity)에 의해 상기 국가별 규정유사도를 식별할 수 있다. 상기 프로세서는 상기 화장품 규정의 국가별 규정유사성 산점도를 시각화할 수 있다. 상기 국가별 규정유사성 산점도는, TF-IDF 벡터화를 통해 상기 화장품 규정의 특징 벡터를 추출하고, 주성분 분 석(Principal Component Analysis; PCA)을 통해 추출된 특징 벡터를 3차원으로 축소하여 시각화될 수 있다. 상기 프로세서는 상기 화장품 규정의 국가별 규정유사성 산점도에서 군집을 이루는 국가들 중에서 상기 선발국 가와 후발국가를 선정할 수 있다. 상기 프로세서는, 국가별 화장품 규정의 정보를 수집하고, 상기 국가별 화장품 규정의 정보로부터 TF-IDF 벡터 화 과정을 거쳐 특징벡터를 추출하고, 후발국가와 선발국가 간 규정유사도를 계산하고, 전문가에 의해 휴리스틱 으로 입력된 파생스코어(Derivative Score)값에 임계값을 적용하여 선발국가를 필터링하고, 국가간 규정유사도 를 곱하여 PRC(Probability of Regulatory Change)값을 계산하고, 상기 PRC값 중 상위인 선발국가를 선정할 수 있다. 상기 프로세서는, 상기 후발국가와 상기 선발국가의 규정유사도를 계산하고, 상기 규정유사도가 임계값보다 작 은 경우, 상기 선발국가의 화장품 규정을 향후 상기 후발국가의 규정변동 사항으로 예측할 수 있다. 상기 프로세서는 상기 규정유사도가 임계값 이상이고 수치의 변동이 없는 경우, 예측 결과가 없음을 출력할 수 있다. 상기 프로세서는 상기 규정유사도가 임계값 이상이고 수치의 변동이 있는 경우, 상기 선발국가의 화장품 규정을 향후 상기 후발국가의 규정변동 사항으로 예측할 수 있다. 본 발명의 실시예에 따른 화장품 규정 변동 예측 방법이 제공된다. 화장품 규정 변동 예측 방법은 화장품 규정 의 정보를 제공하는 적어도 하나의 싸이트에서 국가별 화장품 규정의 정보를 수집하는 단계, 상기 수집한 국가 별 화장품 규정의 정보로부터 국가별 규정유사도를 식별하는 단계, 상기 국가별 규정유사도 및 상기 화장품 규 정의 시행시점을 기초로 상기 화장품 규정에 대한 선발국가와 후발국가를 선정하는 단계, 및 상기 선정된 선발 국가의 화장품 규정에 기초하여 상기 후발국가에 발생될 수 있는 화장품 규정의 변동을 예측하는 단계를 포함한 다."}
{"patent_id": "10-2022-0175219", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 화장품 규정 변동 예측 장치는 예상하지 못한 규정의 변동으로 판매 중인 제품의 처방 을 바꿔야 하는 경우가 생기는 것을 사전에 대비할 수 있다. 즉, 화장품 판매자는 제품 수출할 시 향후 규정 변 화를 미리 예측함으로써 그에 대한 처방이나 포장(Artwork에 들어가는 글) 등이 규정에 영향을 받지 않도록 미 리 대응하는 것이 가능하다."}
{"patent_id": "10-2022-0175219", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예들이 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 도면에서 동일한 참조번호 또는 부호는 실질적으로 동일한 기능 을 수행하는 구성요소를 지칭하며, 도면에서 각 구성요소의 크기는 설명의 명료성과 편의를 위해 과장되어 있을 수 있다. 본 발명을 설명함에 있어서 본 발명과 관련된 공지 기술 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 발명의 실시 예에서, 제1, 제2 등과 같이 서수를 포함하는 용어는 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용되며, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한 다. 또한, 본 발명의 실시 예에서 '상부', '하부', '좌측', '우측', '내측', '외측', '내면', '외면', '전방', '후 방' 등의 용어는 도면을 기준으로 정의한 것이며, 이에 의해 각 구성요소의 형상이나 위치가 제한되는 것은 아 니다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적 합한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하 도록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용 될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장 치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행 하도록 구성된(또는 설정된) 서브 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세 서), 또는 메모리에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서, 클라이언트는 화장품과 관련된 제조사, 브랜드사 또는 원료사 등이 사용하는 사용자단말기, 예를 들면 퍼스널컴퓨터, 모바일장치, 서버 등을 지칭할 수 있다.본 문서에서, 화장품정보 제공 싸이트는 국가별 화장품 규정문서를 게시하고 있는 기관 또는 협회의 웹주소, 컴 퓨터, 서버 등을 지칭할 수 있다. 도 1은 본 발명의 실시예에 따른 화장품 규정변동 예측 장치를 나타내는 모식도이다. 도 1을 참조하면, 화장품 규정변동 예측 장치는 화장품정보 제공 싸이트 및 클라이언트의 각각에 네트 워크로 연결되어 있어서 서버-서버 또는 클라이언트-서버 방식의 데이터 통신을 수행할 수 있다. 화장품 규정변동 예측 장치는 화장품 규정의 정보 제공 싸이트, 예를 들면 국가별 화장품 원료 통합 정보시 스템(CIS)에 게시된 국가별 화장품 규정의 정보를 수집 및 비교하고, 국가별 규정유사도 및 화장품 규정의 시행 시점을 기초로 화장품 규정에 대한 선발국가와 후발국가를 선정하고, 선발국가의 화장품 규정에 기초하여 후발 국가에 발생될 수 있는 화장품 규정의 변동을 예측한다. 화장품 규정변동 예측장치는 선발국가의 화장품 규정의 변동을 확인되면 선발국의 화장품 규정을 추종하는 후발국의 화장품 규정변동을 예측하여 웹페이지 상에 게시하거나 클라이언트에게 메일 또는 메시지 등으로 제공할 수 있다. 화장품 규정변동 예측장치는 주기적으로 또는 이벤트 발생시에 화장품 규정변동의 예측 정 보를 클라이언트에게 푸쉬 전송할 수 있다. 화장품정보 제공 싸이트는 국가별 화장품 규정에 관한 정보를 제공할 수 있다. 화장품정보 제공 싸이트는 각국의 화장품에 관련 규정을 게시하는 기관, 협회, 기업, 단체, 또는 개인 등의 서버 또는 컴퓨터를 포함할 수 있다. 화장품정보 제공 싸이트는 각국의 화장품에 관련 규정을 통합하여 제공할 수도 있다. 화장품정보 제공 싸이트는 각국의 화장품에 관련 규정, 예를 들면 사용금지원료, 사용제한범위, 사용가능원 료, 배합한도 등을 웹페이지 상에 게시할 수 있다. 클라이언트는 화장품 브랜드사, 및 화장품 제조사 또는 원료사 중 판매 또는 국가 인증에 관련된 업체 또는 기관에서 사용하는 사용자단말기, 컴퓨터, 또는 서버일 수 있다. '브랜드사', '제조사', '원료사'는, 화장품과 관련된 기업에 대해 본 명세서에서 기업의 역할의 관점에서 임의로 분류하여 사용하는 용어이며, 화장품과 관련 한 특정 기업 등 한정적인 의미로 해석되어서는 안된다. 즉, '브랜드사'는 제조된 화장품을 판매하는 업체(책임 판매업체를 포함)나 수입하여 판매하는 업체를, '제조사'는 화장품을 직접 제조하는 업체를, '원료사'는 화장품 을 제조하기 위한 원료를 제조, 수입, 유통 또는 판매하는 업체를 나타내는 의미로 사용하는 용어이다. 도 2는 본 발명의 실시예에 따른 화장품 규정변동 예측장치의 블록도이다. 화장품 규정변동 예측 장치는 클라이언트가 개발, 판매 또는 인증하고자 하는 화장품의 국가 규정변동 예측과 관련된 다양한 서비스를 제 공할 수 있다. 도 2를 참조하면, 화장품 규정변동 예측장치는 인터페이스, 프로세서, 및 메모리를 포함한다. 본 발명의 다른 실시예에서는, 이들 구성요소 외에 다른 구성요소, 예를 들면 표시부, 출력부, 비디오처리부, 오디오처리부, 입력부 등을 더 포함할 수 있다. 인터페이스부는 다양한 종류의 유선 및 무선 통신 프로토콜에 대응하는 통신모듈, 통신칩 등의 구성요소들 중 적어도 하나 이상을 포함하는 단방향 또는 양방향 통신회로이다. 인터페이스부는 각종 외부장치, 예를 들면 화장품 정보 제공 싸이트 및 클라이언트와 직접적 또는 간 접적으로 예를 들면 국가의 화장품에 대한 규정과 관련된 각종 데이터를 송수신할 수 있다. 인터페이스부는 프로세서의 제어 하에, 소정의 국가에 판매 또는 인증할 화장품의 성분, 원료, 사용범 위, 배합한도 등의 규정정보를 입력할 수 있는 입력메뉴를 포함하는 입력페이지를 클라이언트에게 전송하고, 클라이언트로부터 입력메뉴를 통해 성분, 원료, 사용범위, 배합한도 등의 규정정보를 수신하고, 수신된 성분, 원료, 사용범위, 배합한도 등의 규정정보에 관련된 선발국가의 화장품 규정정보를 확인하고, 해당 국가의 화장품 규정변동을 예측하여 클라이언트에게 전송하도록 통신을 수행할 수 있다. 인터페이스부는 유선 인터페이스부와 무선 인터페이스부를 포함할 수 있다. 유선 인터페이스부는 방송신호를 수신하기 위한 지상파, 위성방송 안테나 연결 튜너, 케이블 방송, 케이블 연결 인터페이스 등을 포함할 수 있다. 유선 인터페이스부는 영상기기 연결을 위한 HDMI, DP, DVI, Component, S-Video, 컴포지트(RCA 단자) 등을 포 함할 수 있다.유선 인터페이스부는 범용 전자기기 연결을 위한 USB 인터페이스 등을 포함할 수 있다. 유선 인터페이스부는 광케이블 기기의 연결 인터페이스를 포함할 수 있다. 유선 인터페이스부는 헤드셋, 이어폰, 외부 스피커 등의 오디오기기 연결 인터페이스를 포함할 수 있다. 유선 인터페이스부는 이더넷 등 유선 네트워크 기기의 연결 인터페이스를 포함할 수 있다. 무선 인터페이스부는 Wi-fi, 블루투스, ZigBee, Z-wave, RFID, WiGig, WirelessHD, UWB(Ultra-Wide Band), Wireless USB, NFC(Near Field Communication) 등 무선 네트워크 기기의 연결 인터페이스를 포함할 수 있다. 무선 인터페이스부는 리모컨신호 송신 및/또는 수신을 위한 IR 송수신 모듈을 포함할 수 있다. 무선 인터페이스부는 2G ~ 5G 등 이동통신기기 연결 인터페이스를 포함할 수 있다. 프로세서는 화장품 규정변동 예측 장치의 각 구성 부품을 제어할 수 있다. 프로세서는 사전 설정된 적어도 하나의 화장품 정보 제공 싸이트에 접속하여 국가별 화장품 규정의 정보를 수집하고, 수집한 국가별 화장품 규정의 정보로부터 국가별 규정유사도를 식별하고, 국가별 규정유사도 및 화장품 규정의 시행시점을 기 초로 화장품 규정에 대한 선발국가와 후발국가를 선정하고, 선정된 선발국가의 화장품 규정에 기초하여 후발국 가에 발생될 수 있는 화장품 규정의 변동을 예측하여 제공한다. 프로세서에 의한 화장품 규정 변동 예측 처 리에 대한 설명은 후술한다. 프로세서는 예를 들면 화장품 성분, 원료, 사용범위, 배합한도 등의 화장품 규정 정보를 기초로 각 국가의 규정변동률Probability of Regulatory Change; PRC)을 계산하고, 규정변동률 상위에 해당하는 k개 선발국가를 선정하고, 클라이언트로부터 수신되는 또는 입력된 타켓 국가의 성분 규정 내용과 선정된 선발 국가의 성분 규정 내용 간 유사도를 계산하여 향후 타켓 국가의 화장품 규정 변동을 예측한다. 프로세서에 의한 타켓 국 가의 화장품 규정 변동을 예측하는 방법에 대한 상세한 설명은 후술한다. 프로세서는 제어프로그램이 설치된 비휘발성의 메모리로부터 제어프로그램의 적어도 일부를 휘발성의 메모 리로 로드하고, 로드된 제어프로그램을 실행하는 적어도 하나의 범용 프로세서를 포함하며, 예를 들면 CPU(Central Processing Unit), AP(application processor), 또는 마이크로프로세서(microprocessor)로 구현될 수 있다. 프로세서는 싱글 코어, 듀얼 코어, 트리플 코어, 쿼드 코어 및 그 배수의 코어를 포함할 수 있다. 프로세서 는 복수 개 마련될 수 있다. 프로세서는 예를 들어, 메인 프로세서(main processor) 및 슬립 모드 (sleep mode, 예를 들어, 대기 전원만 공급되는 모드)에서 동작하는 서브 프로세서(sub processor)를 포함할 수 있다. 또한, 프로세서, 롬 및 램은 내부 버스(bus)를 통해 상호 연결된다. 프로세서는 화장품 규정 변동 예측 장치에 내장되는 PCB 상에 실장되는 메인 SoC(Main SoC)에 포함되는 형태로서 구현 가능하다. 다른 실시예에서 메인 SoC는 영상처리부를 더 포함할 수 있다 제어프로그램은, BIOS, 디바이스드라이버, 운영체계, 펌웨어, 플랫폼 및 응용프로그램(어플리케이션) 중 적어도 하나의 형태로 구현되는 프로그램(들)을 포함할 수 있다. 응용프로그램은, 화장품 규정 변동 예측 장치의 제 조 시에 미리 설치 또는 저장되거나, 혹은 추후 사용 시에 외부로부터 응용프로그램의 데이터를 수신하여 수신 된 데이터에 기초하여 설치될 수 있다. 응용 프로그램의 데이터는, 예컨대, 어플리케이션 마켓과 같은 외부 서 버로부터 화장품 규정 변동 예측 장치로 다운로드될 수도 있다. 이와 같은 외부 서버는, 컴퓨터프로그램제품 의 일례이나, 이에 한정되는 것은 아니다. 특히, 프로세서는 화장품 규정의 정보를 제공하는 적어도 하나의 싸이트에 게시된 화장품 규정정보를 수집 하고, 수집된 인식 데이터를 분석, 처리, 및 결과 정보 생성 중 적어도 일부를 규칙 기반 또는 인공지능 (Artificial Intelligence) 알고리즘으로서 머신러닝 또는 딥러닝 알고리즘 중 적어도 하나를 이용하여 수행할 수 있다. 일 예로, 프로세서는 화장품 규정 변동 예측을 위한 TF-IDF(Term Frequency-Inverse Document Frequency) 알고리즘, 코사인 유사도(Cosine Similarity) 알고리즘, 및 주성분 분석(Principal Component Analysis; PCA) 알고리즘을 이용하여 국가 간 화장품 규정의 유사도 산출하고, 국가 간 화장품 규정의 유사도와 규정 시행 시점 을 기준으로 선발국가와 후발국가를 선정하고, 선발국가의 화장품 규정 변동을 통하여 타켓 국가에 대한 화장품 규정 변동을 예측할 수 있다.TF-IDF 알고리즘은 정보 검색과 텍스트 마이닝에서 이용하는 텍스트 벡터화 방법으로, 여러 문서로 이루어진 문 서군이 있을 때 어떤 단어가 특정 문서 내에서 얼마나 중요한 것인지를 나타내는 통계적 수치이다. TF-IDF는 문 서의 핵심어를 추출하거나, 문서들 사이의 비슷한 정도를 구하는 등의 용도로 사용할 수 있다. 코사인 유사도 알고리즘은 내적공간의 두 벡터간 각도의 코사인값을 이용하여 측정된 벡터간의 유사한 정도를 알아내는 방법이다. 코사인 유사도는 어떠한 차원수를 가지는 벡터에도 적용이 가능하며, 흔히 다차원의 양수 공간에서의 유사도 측정에 자주 이용된다. 예를 들어, 정보 검색 및 텍스트 마이닝 분야에서, 단어 하나 하나는 각각의 차원을 구성하고 문서는 각 단어가 문서에 나타나는 회수로 표현되는 벡터값을 가진다. 이러한 다차원 공간에서 코사인 유사도는 두 문서의 유사성을 측정하는 매우 유용한 방법이다. 주성분 분석 알고리즘은 고차원의 데이터를 저차원의 데이터로 변환하는 기법을 말한다. 이때, 서로 연관 가능 성이 있는 고차원 공간의 표본들을 선형 연관성이 없는 저차원 공간(주성분)의 표본으로 변환하기 위해 직교 변 환을 사용한다. 데이터를 한 개의 축으로 사상시켰을 때 그 분산이 가장 커지는 축을 첫 번째 주성분, 두 번째 로 커지는 축을 두 번째 주성분으로 놓이도록 새로운 좌표계로 데이터를 선형 변환한다. 이와 같이 표본의 차이 를 가장 잘 나타내는 성분들로 분해함으로써 데이터 분석에 여러가지 이점을 제공한다. 프로세서는 화장품 규정 변동 예측을 위한 학습부 및 인식부의 기능을 수행할 수 있다. 학습부는, 예를 들 면, 다수의 싸이트에 게시된 화장품 규정 정보를 수집하여 신경망 네트워크를 생성하는 기능을 수행하고, 인식 부는 신경망 네트워크를 이용하여 데이터를 인식(또는, 추론, 예측, 추정, 판단)하는 기능을 수행할 수 있다. 학습부는 신경망 네트워크를 주기적으로 갱신할 수 있다. 학습부는 신경망 네트워크를 생성하기 위해서 학습 데 이터를 획득할 수 있다. 예를 들면, 학습부는 학습 데이터를 메모리 또는 외부로부터 획득할 수 있다. 학습 데이터는, 신경망 네트워크의 학습을 위해 이용되는 데이터일 수 있으며, 예를 들면, 다수의 싸이트에 게시된 화장품 규정정보를 이용하여 신경망 네트워크를 학습시킬 수 있다. 학습부는 학습 데이터를 이용하여 신경망 네트워크를 학습시키기 전에, 획득된 학습 데이터에 대하여 전처리 작 업을 수행하거나, 또는 복수 개의 학습 데이터들 중에서 학습에 이용될 데이터를 선별할 수 있다. 예를 들면, 학습부는 학습 데이터를 기 설정된 포맷으로 가공하거나, 필터링하거나, 또는 노이즈를 추가/제거하여 학습에 적절한 데이터의 형태로 가공할 수 있다. 학습부는 전처리된 학습 데이터를 이용하여 예를 들면 화장품 규정 변 동을 예측하는 동작 등을 수행하도록 설정된 신경망 네트워크를 생성할 수 있다. 학습된 신경망 네트워크는, 복수의 신경망 네트워크(또는, 레이어)들로 구성될 수 있다. 복수의 신경망 네트워 크의 노드들은 가중치를 가지며, 복수의 신경망 네트워크들은 일 신경망 네트워크의 출력 값이 다른 신경망 네 트워크의 입력 값으로 이용되도록 서로 연결될 수 있다. 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 및 심층 Q-네트 워크 (Deep Q-Networks)과 같은 모델을 포함할 수 있다. 한편 인식부는 화장품 규정 변동을 예측하기 위해, 타겟 데이터를 획득할 수 있다. 타겟 데이터는 메모리 또는 외부로부터 획득된 것일 수 있다. 타겟 데이터는, 학습모델 또는 신경망 네트워크의 인식 대상이 되는 데 이터일 수 있다. 인식부는 타겟 데이터를 학습된 신경망 네트워크에 적용하기 전에, 획득된 타겟 데이터에 대하 여 전처리 작업을 수행하거나, 또는 복수 개의 타겟 데이터들 중에서 인식에 이용될 데이터를 선별할 수 있다. 예를 들면, 인식부는 타겟 데이터를 기 설정된 포맷으로 가공하거나, 필터링 하거나, 또는 노이즈를 추가/제거 하여 인식에 적절한 데이터의 형태로 가공할 수 있다. 인식부는 전처리된 타겟 데이터를 학습모델 또는 신경망 네트워크에 적용함으로써, 신경망 네트워크로부터 출력되는 출력값을 획득할 수 있다. 다양한 실시예에 따르면, 인식부는 출력값과 함께 학률값(또는, 신뢰도값)을 함께 획득할 수 있다. 메모리는 컴퓨터에 의해 판독 가능한 기록매체로서, 한정되지 않은 데이터가 저장된다. 메모리는 프로 세서에 의해 액세스 되며, 이들에 의한 데이터의 독취, 기록, 수정, 삭제, 갱신 등이 수행된다. 메모리(1 3)는 전원의 제공 유무와 무관하게 데이터를 보존할 수 있는 비휘발성 속성의 스토리지(storage)와, 프로세서 에 의해 처리되기 위한 데이터가 로딩되며 전원이 제공되지 않으면 데이터를 보존할 수 없는 휘발성 속성의 메모리(memory)를 포함한다. 스토리지에는 플래시메모리(flash-memory), HDD(hard-disc drive), SSD(solid- state drive) ROM(Read Only Memory) 등이 있으며, 메모리에는 버퍼(buffer), 램(RAM; Random Access Memory) 등이 있다. 메모리는 수집된 화장품 규정정보 로데이터(raw data) 및 로데이터를 분석 가공한 가공데이터를 포함할 수 있다. 가공데이터는 TF-IDF 벡터화를 통해 국가별 제한 성분 규정 내용의 특징 벡터 데이터, 각 국가간 제한 성 분별 규정 내용의 코사인 유사도(0~1)의 평균값으로 산출한 규정 문서 유사도 데이터, 주성분 분석(PCA)을 통해 추출된 특징 벡터를 3차원으로 축소하여 시각화한 규정 유사성 산점도 데이터, 전문가에 의해서 휴리스틱으로 입력된 파생 스코어(Derivative Score) 값에 임계값을 적용하여 필터링한 선발 국가 데이터, 파생 스코어값과 국가 간의 규정 유사성을 곱하여 계산한 규정 변동 확률(Probability of Regulatory Change; PRC) 데이터 등 다양한 데이터베이스(DB)를 포함할 수 있다. 본 실시예에 따른 메모리는 복수의 엔진 및 이를 실행시키는 복수의 어플리케이션이 저장될 수 있다. 메모 리에 저장된 어플리케이션이 프로세서에 의해 구동됨으로써 엔진들이 실행될 수 있다. 예를 들면, 메모리는 프로세서에 의해 실행되는, 국가 간 규정 문서 유사도 산출엔진을 포함할 수 있다. 예를 들면, 메모리는 프로세서에 의해 실행되는, 규정 유사성 산점도 시각화 엔진을 포함할 수 있다. 예를 들면, 메모리는 프로세서에 의해 실행되는, 타켓국가의 선발국가를 선정하는 엔진을 포함할 수 있 다. 예를 들면, 메모리는 프로세서에 의해 실행되는, 선후발 국가 규정 유사성에 기반한 규정 변동 예측 엔 진을 포함할 수 있다. 도 3은 후발국가의 화장품 규정이 선발국가의 화장 규정을 추종하는 것을 나타내는 도면이다. 도 3을 참조하면, 유럽은 산화 조건 하에 혼합한 후 헤어에 적용된 최대 농도가 0.5%를 초과하지 않도록 하는 산화성 염색제 제품의 염색물질 규정이 있다. 이러한 염색물질 규정은 선발국가인 유럽으로부터 걸프연합, 러시 아, 영국이 후발국가로서 추종하고 있다. 또한, 제1후발국가인 터키의 염색물질 규정은 제2의 후발국가인 터키 가 그대로 추종한다. 이와 같이, 각 국가의 화장품 규정 문서를 비교하고, 문서의 유사도와 그 시행시점을 기준으로 하여 선발국가와 후발국가들을 알 수 있다. 도 4는 본 발명의 일실시예에 따른 화장품 규정 변동 예측 방법을 나타내는 순서도이다. 단계 S11에서, 프로세서는 인터페이스부를 통하여 화장품 규정의 정보를 제공하는 적어도 하나의 싸이 트에서 국가별 화장품 규정의 정보를 수집한다. 단계 S12에서, 수집한 국가별 화장품 규정의 정보로부터 국가별 규정유사도를 식별한다. 단계 S13에서, 프로세서는 국가별 규정유사도 및 화장품 규정의 시행시점을 기초로 화장품 규정에 대한 선 발국가와 후발국가를 선정한다. 단계 S14에서, 선정된 선발국가의 화장품 규정에 기초하여 후발국가에 발생될 수 있는 화장품 규정의 변동을 예 측한다. 도 5는 화장품 규정에 관한 국가간 규정문서 유사도를 나타내는 도면이다. 프로세서는 TF-IDF 벡터화를 통해 국가별 제한 성분 규정 내용의 특징 벡터를 추출하고, 각 국가간 제한 성 분별 규정 내용의 코사인 유사도(0~1)의 평균값을 화장품 규정에 관한 국가간 규정문서 유사도로서 산출할 수 있다. 도 5를 참조하면, 유럽에서 규정이 파생된 걸프 연합과 영국은 유럽에서 시행중 규정 내용의 유사도가 각각 0.98, 0.97로 매우 유사함을 알 수 있다. 따라서, 유럽의 규정이 변동된다면 걸프 연합과 영국의 규정도 변동될 확률이 매우 높다고 해석할 수 있다. 도 6은 국가 간 화장품 규정 유사성 산점도 분포를 나타내는 도면이다. 프로세서는 TF-IDF 벡터화를 통해 각 국가 규정 내용의 특징 벡터를 추출하고, 주성분 분석(PCA)을 통해 추 출된 특징 벡터를 3차원으로 축소하여 시각화할 수 있다. 도 6에 나타낸 산점도 분포에서, 산점도의 군집 정도 를 분석하여 선후발 국가 관계를 알아 낼 수 있다. 도 7은 타켓 국가의 선발국가 선정 방법을 나타내는 순서도이다. 단계 S21에서, 프로세서는 각 국가들의 규정 문서를 모아 TF-IDF 벡터화 과정을 거처 각 규정 문서에 대한 특징 벡터(M)를 추출한다. 단계 S22에서, 프로세서는 코사인 유사도 (Cosine Similarity)를 이용하여 추출된 특징벡터로부터 타켓국가 (러시아)와 이외의 소스국가 간의 규정 유사성 계산한다. 단계 S23에서, 프로세서는 전문가에 의해서 휴리스틱으로 입력된 파생 스코어(Derivative Score) 값에 임계 값(0.6)을 적용하여 선발국가(유럽:0.95)를 필터링한다. 여기서, 파생 스코어(Derivative Score)는 국가 간 규 정의 파생 정도에 해당하는 0~1 사이의 스코어로 나타낸 값이다. 단계 S24에서, 프로세서는 파생 소코어값(0.95)과 국가 간의 규정 유사성을 곱하여 규정 변동 확률 (Probability of Regulatory Change; PRC)값을 계산한다. 단계 S25에서, 프로세서는 PRC 값 중 상위 k개의 선발국가를 선정한다. 이상과 같이, 화장품에 관한 각 국가들의 규정 문서를 이용하여 특정 타켓국가에 대한 선발국가를 선정할 수 있 다. 도 8은 선후발 국가 규정 유사성에 기반한 규정변동 예측 방법을 나타내는 순서도이다. 단계 S31에서, 프로세서는 타켓국가의 성분 규정 내용과 선정된 선발국가의 성분 규정 내용 간 유사도 계산 한다. 단계 S32에서, 프로세서는 규정 내용 간 유사도가 임계값과 비교한다. 만일, 규정 내용 간 유사도가 임계값 보다 작은 경우, 선발국가에서 이전에 없던 규정가 추가 되거나 규정에 변동이 있는 경우이므로 선발국가의 규 정 내용을 향후 규정 변동 사항으로 예측한다. 만일, 규정 내용 간 유사도가 임계값보다 크거나 같으면 단계 S33을 수행한다. 단계 S33에서, 프로세서는 수치(배합 한도 등)의 변동 여부를 판별한다. 만일 수치(배합 한도 등)의 변동이 없는 경우, 선발국가와 타켓국가 간 규정 내용이 크게 다르지 않으므로 규정 변동이 없는 것이다. 만일, 수치(배합 한도 등)가 바뀐 경우, 수치의 변화는 중요한 정보이므로 선발국가의 규정 내용을 향후 규정 변동 사항으로 예측한다. 이상과 같이, 타켓국가에 대한 선후발 국가 규정 유사성에 기반한 규정 변동을 예측함으로써, 예상하지 못한 규 정의 변동으로 판매 중인 제품의 처방을 바꿔야 하는 경우가 생기는 것을 사전에 대비할 수 있다. 즉, 화장품 판매자, 화장품개발자, 화장품제작자, 화장품 원료공급자는 제품 수출할 시 향후 규정 변화를 미리 예측함으로 써 그에 대한 처방이나 포장(Artwork에 들어가는 글) 등이 규정에 영향을 받지 않도록 미리 대응하는 것이 가능 하다 본 발명의 일 실시예는 국가의 규정 대상으로 화장품을 예로 설명하였으나, 이에 한정되지 않고 다양한 제품일 수 있다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2022-0175219", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형 실시 예들은 본 발명의 기 술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2022-0175219", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 화장품 규정변동 예측 장치를 나타내는 모식도이다. 도 2는 본 발명의 실시예에 따른 화장품 규정변동 예측 장치의 블록도이다. 도 3은 후발국가의 화장품 규정이 선발국가의 화장 규정을 추종하는 것을 나타내는 도면이다. 도 4는 본 발명의 일실시예에 따른 화장품 규정 변동 예측 방법을 나타내는 순서도이다. 도 5는 화장품규정에 관한 국가간 유사도를 나타내는 도면이다. 도 6은 국가 간 화장품 규정 유사성 산점도 분포를 나타내는 도면이다. 도 7은 타켓 국가의 선발국가 선정 방법을 나타내는 순서도이다. 도 8은 선후발 국가 규정 유사성에 기반한 규정변동 예측 방법을 나타내는 순서도이다."}
