{"patent_id": "10-2020-0023934", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0108832", "출원번호": "10-2020-0023934", "발명의 명칭": "임시주차장 등을 위한 주차관리 시스템 및 방법", "출원인": "사이클롭스 주식회사", "발명자": "최남호"}}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주차장 내부의 어느 하나 이상의 장소나 주차장을 촬영할 수 있는 주차장 밖의 어느 하나 이상의 장소에 설치된카메라(10) 이용하여 차량의 출입, 이동 및 주차 상태 영상을 촬영하는 카메라(10);상기 카메라(10)를 통해 획득된 영상에서 주차장의 경계와 주차장 내에 주차된 차량들을 인식하고 그 차량들의위치정보를 분석하는 인식부(20);상기 인식부(20)를 통해 획득한 차량들의 위치정보를 고려하여 주차장을 주차용구(301)과 이동용구역(302)으로구획하는 구획부(30);상기 주차용구역(301)에 주차된 차량 간의 간격, 주차된 차량과 이동구역 간의 간격, 주차된 차량과 주차장 경계와의 간격 중 어느 하나 이상을 분석하여 추가로 주차가 가능한 주차면의 수량을 산출하는 분석부(40);를 포함하여 구성되는 것을 특징으로 하는 주차장 관리 시스템"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "상기 제1항에 있어서,상기 인식부(20)를 대신하여 인식부(20)의 기능 외에 차량들을 추적(Multi Object Tracking; MOT)하는 기능을담당하는 인식추적부(21);를 포함하여 구성되는 것을 특징으로 하는 주차장 관리 시스템"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "상기 제2항에 있어서,상기 인식추적부(21)는 R-CNN(Region-based Convolutional Neural Network), Fast R-CNN, Faster R-CNN,YOLO(You Only Look Once), SSD(Single Shot Multi-box Detector), Deep SORT(Simple Online and Real-TimeTracking), Hungarian(Kuhn-Munkres) 중 어느 하나 이상의 알고리즘을 적용하여 다수의 차량을 개별적으로 인식하고 그 차량들의 위치정보를 분석하며 추적하는 것을 특징으로 하는 주차장 관리 시스템"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "상기 제2항에 있어서,상기 이동용구역(302)의 최소 너비는 3.3미터인 것을 특징으로 하는 주차장 관리 시스템"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "상기 제2항 내지 제4항 중 어느 한 항에 있어서,상기 인식추적부(21)의 차량인식 및 추적 결과와 개별 차량의 출입시간을 결합하여 주차요금을 계산하는 요금처리부(50);를 추가로 포함하여 구성되는 것을 특징으로 하는 주차장 관리 시스템"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "상기 제2항 내지 제4항 중 어느 한 항에 있어서,상기 카메라(10), 인식추적부(21), 구획부(30), 분석부(40) 및 요금처리부(50) 중 어느 하나 이상이 다기능카메라(11)로 통합되는 것을 특징으로 하는 주차장 관리 시스템"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "상기 제2항 내지 제4항 중 어느 한 항에 있어서,상기 카메라(10), 인식추적부(21), 구획부(30), 분석부(40) 및 요금처리부(50)를 통해 획득·생산된 개별차량별공개특허 10-2021-0108832-3-인식코드, 개별 차량의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하나 이상을주차장 관리·운영자 및/또는 이용자에게 제공하는 정보제공부(60);를 추가로 포함하여 구성되는 것을 특징으로하는 주차장 관리 시스템"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "상기 제7항에 있어서,상기 카메라(10), 인식추적부(21), 구획부(30), 분석부(40) 및 요금처리부(50)를 통해 획득·생산된 개별차량별인식코드, 개별 차량의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하나 이상을이용대기자에게 제공하는 정보공지부(70);를 추가로 포함하여 구성되는 것을 특징으로 하는 주차장 관리 시스템"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "주차장 내부의 어느 하나 이상의 장소나 주차장을 촬영할 수 있는 주차장 밖의 어느 하나 이상의 장소에 설치된카메라(10) 이용하여 차량의 출입, 주차상태 영상을 획득하는 영상획득 단계(100);상기 영상획득 단계(100)를 통해 획득된 영상에서 주차된 차량을 인식(Multi Object Detection; MOD)하는 주차차량인식 단계(200); 상기 주차차량인식 단계(200)를 통해 확인된 주차된 차량의 위치를 고려하여 주차용구역(301)과 이동용구역(302)을 획정하는 구역획정 단계(300);상기 주차용구역(301)에 주차된 차량 간의 간격, 주차된 차량과 이동구역 간의 간격, 주차된 차량과 주차장 경계와의 간격 중 어느 하나 이상을 분석하여 추가로 주차가 가능한 주차면의 수량을 산출하는 현황분석 단계(400);를 포함하는 것을 특징으로 하는 주차장 관리 방법"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "상기 제9항에 있어서,상기 주차차량인식 단계(200)를 대신하여 상기 영상획득 단계(100)를 통해 획득된 영상에서 다수의 차량을 개별적으로 인식(Multi Object Detection; MOD)하고 그 차량들의 위치정보를 분석하며 추적(Multi ObjectTracking; MOT)하는 인식추적 단계(201);를 포함하여 구성되는 것을 특징으로 하는 주차장 관리 방법"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "상기 제10항에 있어서,상기 인식추적 단계(201)는 R-CNN(Region-based Convolutional Neural Network), Fast R-CNN, Faster R-CNN,YOLO(You Only Look Once), SSD(Single Shot Multi-box Detector) 중 어느 하나 이상의 알고리즘을 적용하여다수의 차량을 개별적으로 인식하고 그 차량들의 위치정보를 분석하며 추적하는 것을 특징으로 하는 주차장 관리 방법"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "상기 제10항에 있어서,상기 구역획정 단계(300)는 상기 이동용구역(302)의 최소 너비를 3.3미터로 설정하는 것을 특징으로 하는 주차장 관리 방법"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "상기 제10항에 있어서,상기 현황분석 단계(400)는 상기 주차용구역(301)의 빈공간의 너비가 1.7미터 이상이고 길이가 3.6미터 이상인경우 경차 1대가 주차 가능한 것으로 분석하고, 상기 주차용구역(301)의 빈공간의 너비가 2.0미터 이상이고 길이가 5.0미터 이상인 경우 일반차량 1대가 주차 가능한 것으로 분석하는 것을 특징으로 하는 주차장 관리 방법"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2021-0108832-4-상기 제10항 내지 제13항 중 어느 한 항에 있어서,상기 인식추적 단계(200)의 차량인식 및 추적 결과와 개별 차량의 출입시간을 결합하여 주차요금을 계산하는 요금처리 단계(500);를 추가로 포함하는 것을 특징으로 하는 주차장관리 방법"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "상기 제14항에 있어서,상기 영상획득 단계(100), 인식추적 단계(201), 구역획정 단계(300), 현황분석 단계(400) 및 요금처리 단계(500)를 통해 획득·생산된 개별차량별 인식코드, 개별 차량의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하나 이상을 주차장 관리·운영자 및/또는 이용자에게 제공하는 정보제공 단계(600);을 추가로 포함하는 것을 특징으로 하는 주차장 관리 방법"}
{"patent_id": "10-2020-0023934", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "상기 제14항에 있어서,상기 영상획득 단계(100), 인식추적 단계(201), 구역획정 단계(300), 현황분석 단계(400) 및 요금처리 단계(500)를 통해 획득·생산된 개별차량별 인식코드, 개별 차량의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하나 이상을 이용자대기자에게 제공하는 정보공지 단계(700);을 추가로 포함하는 것을 특징으로 하는 주차장 관리 방법"}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 각종 이벤트 등과 연계하여 단기간 운영되거나 용도·사용 등이 유보되어 있는 공개공지 등을 활용하 여 운영되는 임시 주차장을 위한 지능형 주차관리 시스템(장치) 및 방법에 관한 것으로, 보다 구체적으로는 기계 적 구성에 있어서는 구입, 설치, 운영 등에 있어 높은 비용을 필요로 하는 차량번호인식기, 차량인식센서 등의 구성요소를 CCTV 등의 카메라를 통하여 획득된 영상분석 기반의 차량인식 및 차량추적으로 대체하고, 임시 주차 장의 면적을 차량이 점유하고 있는 면적, 차량의 통행에 필요한 면적, 차량이 추가로 주차할 수 있는 면적 등으 로 분석 및 제공하여 최소한의 장비와 저렴한 비용으로 임시 주차장을 효율적으로 관리·운영할 수 있는 주차관 리 시스템(장치) 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 임시로 운영되어 차량번호인식기, 차량인식센서 등과 같은 고가의 구성요소는 물론 바닥포장(아스콘, 시멘트), 주차선 등의 기초 인프라도 갖추고 있지 못한 임시주차장 등을 위한 주차관리 시스템(장치) 및 방법에 관한 것으로, 보안용 CCTV 영상 등에 대한 인공지능 영상분석을 통하여 차량번호인식기, 차량인식기 등의 고가 장비 없이 구현가능한 무인 주차관리 시스템(장치) 및 방법을 제공함은 물론 인공지능 영상분석을 통하여 추가 로 주차가 가능한 차량의 수량을 계산하여 제공할 수 있는 것을 특징으로 한다."}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "문화체육관광부, 통계청 등의 자료에 따르면 2019년을 기준으로 우리나라에서는 총 884건의 지역축제가 개최된 바 있고, 2018년을 기준으로 전국에 걸쳐 770개의 예식장(사업자 기준)과 660개의 공연시설(사업자 기준)이 활 동하고 있다. 상기 지역축제 등을 개최하는 지방자치단체 등에서는 내방객의 편이 증진을 위하여 다양한 형태의 임시 주차장을 설치·운영하고 있으나, 인프라의 측면에 있어서는 차량번호인식기, 차량인식센서 등과 같은 고 가의 구성요소는 물론 바닥포장(아스콘, 시멘트), 주차선 등의 기초 인프라도 갖추고 있지 못한 경우도 매우 많 으며, 운영에 있어도 무전기 등의 단순 통신 장비만을 갖춘 비숙련 임시 인력이 주로 활용되고 있어 관리·운영 의 효율성이 확보하기 어렵고 방문객에게 주차장 현황 정보를 실시간으로 제공하지 못하여 주요한 불편·민원 요인으로 작용하고 있다. 본 발명은 인공지능 영상분석(컴퓨터 비전) 기술을 활용하여 상기와 같은 임시 주차장 등의 관리·운용상 문제 점을 근본적으로 해결할 수 있는 주차관리 시스템(장치) 및 방법을 제공함을 그 목적으로 하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) [문헌1] 대한민국 공개특허 제2019-0078688호 (특허문헌 0002) [문헌2] 대한민국 공개특허 제2019-0076545호 (특허문헌 0003) [문헌3] 대한민국 등록특허 제1821242호"}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "(특허문헌 0004) [문헌4] 대한민국 등록특허 제2012799호 발명의 내용"}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 임시로 운영되어 차량번호인식기, 차량인식센서 등과 같은 고가의 구성요소는 물론 바닥포장(아스콘, 시멘트)이나 주차선 등의 기초 인프라도 갖추고 있지 못한 임시주차장 등을 위한 주차관리 시스템(장치) 및 방 법에 관한 것으로, 보안용 CCTV 영상 등에 대한 인공지능 영상분석을 통하여 차량번호인식기, 차량인식기 등의 고가 장비 없이 구현 가능한 지능형 주차관리 시스템(장치) 및 방법을 제공함은 물론 인공지능 영상분석(컴퓨터 비전) 기술을 통하여 추가로 주차가 가능한 차량의 수량을 신속하게 분석 및 제공함으로써 주차장의 효율적인 관리·운영은 물론 방문객의 편이를 증진함을 그 목적으로 하고 있다."}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 실현하기 위한 본 발명에 따른 주차장 관리 시스템(장치)은 주차장 내부의 어느 하나 이 상의 장소나 주차장을 촬영할 수 있는 주차장 밖의 어느 하나 이상의 장소에 설치된 카메라 이용하여 차량 의 출입, 이동 및 주차 상태 영상을 촬영하는 카메라(기존 보안용 저해상도 CCTV, 신규 고해상도 CCTV 등; 10); 상기 카메라를 통해 획득된 영상에서 주차된 차량들을 인식하고 그 차량들의 위치정보를 분석하는 인식부 ; 상기 인식부를 통해 획득한 차량들의 위치정보를 고려하여 주차장을 주차용구과 이동용구역 으로 구획하는 구획부; 상기 주차용구역에 주차된 차량 간의 간격, 주차된 차량과 이동구역 간의 간격, 주차된 차량과 주차장 경계와의 간격 중 어느 하나 이상을 분석하여 추가로 주차가 가능한 주차면의 수량 을 산출하는 분석부;를 포함하여 구성되는 것을 특징으로 한다. 또한 본 발명은 상기 인식부를 대신하여 상기 카메라를 통해 획득된 영상에서 다수의 차량을 개별적으 로 인식(Multi Object Detection; MOD)하고 그 차량들의 위치정보를 분석하며 추적(Multi Object Tracking; MOT)하는 인식추적부;를 포함하여 구성되는 것을 특징으로 하는 주차장 관리 시스템, 상기 인식추적부 가 R-CNN(Region-based Convolutional Neural Network), Fast R-CNN, Faster R-CNN, YOLO(You Only Look Once), SSD(Single Shot Multi-box Detector), Deep SORT(Simple Online and Real-Time Tracking), Hungarian(Kuhn-Munkres) 중 어느 하나 이상의 알고리즘을 적용하여 다수의 차량을 개별적으로 인식하고 그 차 량들의 위치정보를 분석하며 추적하는 것을 특징으로 하는 주차장 관리 시스템,상기 이동용구역의 최소 너 비는 3.3미터인 것을 특징으로 하는 주차장 관리 시스템, 상기 인식추적부의 차량인식 및 추적 결과와 개별 차량의 출입시간을 결합하여 주차요금을 계산하는 요금처리부;를 추가로 포함하여 구성되는 것을 특징으로 하는 주차장 관리 시스템, 상기 카메라, 인식추적부, 구획부, 분석부 및 요금처리부 중 어 느 하나 이상이 다기능카메라로 통합되는 것을 특징으로 하는 주차장 관리 시스템, 상기 카메라, 인식 추적부, 구획부, 분석부 및 요금처리부를 통해 획득·생산된 개별차량별 인식코드, 개별 차량 의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하나 이상을 주차장 관리·운영 자 및/또는 이용자에게 제공하는 정보제공부;를 추가로 포함하여 구성되는 것을 특징으로 하는 주차장 관리 시스템, 상기 카메라, 인식추적부, 구획부, 분석부 및 요금처리부를 통해 획득·생산된 개 별차량별 인식코드, 개별 차량의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하 나 이상을 이용대기자에게 제공하는 정보공지부;를 추가로 포함하여 구성되는 것을 특징으로 하는 주차장 관리 시스템을 제공함을 목적으로 한다. 아울러, 본 발명은 주차장 내부의 어느 하나 이상의 장소나 주차장을 촬영할 수 있는 주차장 밖의 어느 하나 이 상의 장소에 설치된 카메라 이용하여 차량의 출입, 주차상태 영상을 획득하는 영상획득 단계; 상기 영 상획득 단계를 통해 획득된 영상에서 주차된 차량을 인식(Multi Object Detection; MOD)하는 주차차량인식 단계; 상기 주차차량인식 단계를 통해 확인된 주차된 차량의 위치를 고려하여 주차용구역과 이 동용구역을 획정하는 구역획정 단계; 상기 주차용구역에 주차된 차량 간의 간격, 주차된 차량과 이동구역 간의 간격, 주차된 차량과 주차장 경계와의 간격 중 어느 하나 이상을 분석하여 추가로 주차가 가능한 주차면의 수량을 산출하는 현황분석 단계;를 포함하는 것을 특징으로 하는 주차장 관리 방법, 상기 주차차 량인식 단계를 대신하여 상기 영상획득 단계를 통해 획득된 영상에서 다수의 차량을 개별적으로 인식 (Multi Object Detection; MOD)하고 그 차량들의 위치정보를 분석하며 추적(Multi Object Tracking; MOT)하는 인식추적 단계;를 포함하여 구성되는 것을 특징으로 하는 주차장 관리 방법, 상기 인식추적 단계가 R-CNN(Region-based Convolutional Neural Network), Fast R-CNN, Faster R-CNN, YOLO(You Only Look Once), SSD(Single Shot Multi-box Detector), Deep SORT(Simple Online and Real-Time Tracking), Hungarian(Kuhn-Munkres) 중 어느 하나 이상의 알고리즘을 적용하여 다수의 차량을 개별적으로 인식하고 그 차량들의 위치정보 를 분석하며 추적하는 것을 특징으로 하는 주차장 관리 방법, 상기 구역획정 단계는 상기 이동용구역(30 2)의 최소 너비를 3.3미터로 설정하는 것을 특징으로 하는 주차장 관리 방법, 상기 현황분석 단계는 상기 주차용구역의 빈공간의 너비가 1.7미터 이상이고 길이가 3.6미터 이상인 경우 경차 1대가 주차 가능한 것으로 분석하고, 상기 주차용구역의 빈공간의 너비가 2.0미터 이상이고 길이가 5.0미터 이상인 경우 일반차 량 1대가 주차 가능한 것으로 분석하는 것을 특징으로 하는 주차장 관리 방법, 상기 인식추적 단계의 차량 인식 및 추적 결과와 개별 차량의 출입시간을 결합하여 주차요금을 계산하는 요금처리 단계;를 추가로 포 함하는 것을 특징으로 하는 주차장관리 방법, 상기 영상획득 단계, 인식추적 단계, 구역획정 단계 , 현황분석 단계 및 요금처리 단계를 통해 획득·생산된 개별차량별 인식코드, 개별 차량의 입 장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하나 이상을 주차장 관리·운영자 및/ 또는 이용자에게 제공하는 정보제공 단계;을 추가로 포함하는 것을 특징으로 하는 주차장 관리 방법, 상기 영상획득 단계, 인식추적 단계, 구역획정 단계, 현황분석 단계 및 요금처리 단계를 통해 획득·생산된 개별차량별 인식코드, 개별 차량의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차 요금 정보 중 어느 하나 이상을 이용자대기자에게 제공하는 정보공지 단계;을 추가로 포함하는 것을 특징 으로 하는 주차장 관리 방법을 제공함을 목적으로 한다."}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 임시로 운영되어 차량번호인식기, 차량인식센서 등과 같은 고가의 구성요소는 물론 바닥포장(아스콘, 시멘트)이나 주차선 등의 기초 인프라도 갖추고 있지 못한 임시주차장 등을 위한 주차관리 시스템(장치) 및 방 법에 관한 것으로, 보안용 CCTV 영상 등에 대한 인공지능 영상분석을 통하여 차량번호인식기, 차량인식기 등의 고가 장비 없이 구현 가능한 지능형 주차관리 시스템(장치) 및 방법을 제공함은 물론 인공지능 영상분석(컴퓨터 비전) 기술을 통하여 추가로 주차가 가능한 차량의 수량을 신속하게 분석 및 제공함으로써 주차장의 효율적인 관리·운영은 물론 방문객의 편이를 증진하는 효과가 있다."}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 상세히 설명하면 다음과 같다. 도 1은 본 발명에 따른 주차장 관리 시스템(장치)의 개략적인 구성으로, 카메라은 보안 CCTV용 저해상도 카 메라, 최신 고해상도 카메라 등은 물론 이미 상용제품으로 널리 판매 중인 연산처리, 통신 등의 기능을 내장한 다기능카메라가 사용될 수 있으며, 차량의 출입 및 주차상황을 촬영할 수 있는 경우 설치 장소 및 수량 등 과 무관하다. 인식부 또는 인식추적부는 상기 다기능카메라 또는 별도의 전산처리 장치로서 상기 카메라을 통해 획득한 영상에 대하여 다중객체인식, 다중객체추적 등의 컴퓨터 비전 기술을 적용하여 다수의 차량을 개별 적으로 인식하고 추적하는 기능을 하며 R-CNN(Region-based Convolutional Neural Network), Fast R-CNN, Faster R-CNN, YOLO(You Only Look Once), SSD(Single Shot Multi-box Detector), Deep SORT(Simple Online and Real-Time Tracking), Hungarian(Kuhn-Munkres) 등의 알고리즘을 활용하여 구현할 수 있다. 상기 알고리즘 중 R-CNN 알고리즘은 2014년 CVPR을 통해 발표된 “Rich feature hierarchies for accurate object detection and semantic segmentation Tech report (v5)”을 통해, Fast R-CNN 알고리즘은 2015년 ICCV를 통해 발표된 “Fast R-CNN”을 통해, Faster R-CNN 알고리즘은 2015년 NIPS를 통해 발표된 “Faster R- CNN: Towards Real-Time Object Detection with Region Proposal Networks”를 통해, YOLO v1, v2, v3 알고리 즘은 각각 2016년 CVPR, 2017년 CVPR, 2018년 arXiv에 발표된 “YOLOv3: An Incremental Improvement” 등을 통해, SSD는 2016년 ECCV에 발표된 “SSD: Single Shot MultiBox Detector” 등을 통해, Deep SORT는 2017년 arXiv에 발표된 “Simple Online and Realtime Tracking with a Deep Association Metric” 등을 통해, Hungarian(Kuhn-Munkres)는 2018년 arXiv에 발표된 “A Distributed Version of the Hungarian Method for Multi-Robot Assignment” 등을 통해 공개된 바 있다. 구획부는 상기 인식부 또는 상기 인식추적부를 통해 획득한 차량들의 위치정보를 고려하여 주차장 을 주차용구역과 이동용구역으로 구분하는 기능을 담당하고, 분석부는 이미 주차된 차량의 위치정보를 바탕으로 상기 주차용구역에 추가로 주차가 가능한 차량의 수량을 산출하는 기능을 담당하는 것이 며, 이들 구성요소와 관련된 기술은 “Parking Capacity Optimization Using Linear Programming”(Journal of Traffic and Logistics Engineering Vol. 2, No. 3, September 2014), “Optimization of Car Park Designs” (European Study Groups with Industry, ESGI91) 등을 통하여 공개된 바 있다. 요금처리부는 상기 인식부 또는 인식추적부의 차량인식 및 추적 결과와 개별 차량의 출입시간을 결 합하여 주차요금을 산출하는 것으로 개별 차량의 출입 시간은 상기 카메라, 인식부, 인식추적부 또 는 요금처리부 자체의 타이머(시계)를 활용하거나 GPS 정보, 전파정보 등도 활용될 수 있다. 정보제공부는 상기 카메라, 인식추적부, 구획부, 분석부 및 요금처리부를 통해 획득· 생산된 개별차량별 인식코드, 개별 차량의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하나 이상을 주차장 관리·운영자 및/또는 이용자에게 제공하는 장치로서 기존의 LED 디스플레이 장치, LCD 디스플레이 장치 등은 물론 다양한 기술방식의 모니터, TV를 포함한 모든 형태의 영상기기가 활용될 수 있 으며, 별도의 고정장치 없이 주차장 이용자의 모바일 단말기가 활용될 수도 있다. 정보공지부는 상기 카메라, 인식추적부, 구획부, 분석부 및 요금처리부를 통해 획득· 생산된 개별차량별 인식코드, 개별 차량의 입장 및/또는 퇴장 정보, 추가 주차가능 수량 정보, 주차요금 정보 중 어느 하나 이상을 주차장 관리·운영자 및/또는 이용대기자에게 제공하는 장치로서, 다양한 통신방식(유선, 무선, 복합 등) 및 플랫폼(웹, 모바일 등)을 기반으로 구현될 수 있으며, 다기능카메라는 상기 카메라, 인식부, 인식추적부, 요금처리부 중 어느 하나 이상을 포함하여 구성될 수 있다. 본 발명에 따른 주차장 관리 방법에 있어서 영상획득 단계은 상기 카메라, 다기능카메라 등을 활 용하여 용이하게 구현이 가능하며, 주차차량인식 단계 및 인식추적 단계은 상기 R-CNN, Fast R-CNN, Faster R-CNN, YOLO, SSD 등을 통하여 구현될 수 있으며, 구역획정 단계와 현황분석 단계는 각각 상 기 구획부와 분석부에 대응되는 구성요소로서 그 기술적 내용은 상술한 구획부와 분석부의 내 용과 실질적으로 동일하다. 또한 요금처리 단계, 정보제공 단계 및 정보공지 단계는 각각 상기 요금처리부, 정보제공부 및 정보공지부에 대응되는 구성요소로서 이들의 기술적 내용도 상술한 요금처리부, 정보제공부 및 정보공지부의 그 기술적 내용과 실질적으로 동일하여 상기 주차장 관리 시스템(장치)에 대한 설명"}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "을 바탕으로 이 기술이 속하는 기술분야에서 통상의 지식을 가진 자가 용이하게 구현할 수 있다. 따라서, 이 출원 명세서의 특허청구범위에 기재된 발명들은 발명의 상세한 설명에 의하여 뒷받침 됨은 물론 이"}
{"patent_id": "10-2020-0023934", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "기술이 속하는 기술분야에서 통상의 지식을 가진 자가 이 발명의 출원 명세서에 기재된 사항을 바탕으로 용이하 게 구현할 수 있음이 명백하다.도면 도면1"}
{"patent_id": "10-2020-0023934", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 지능형 주차장 관리 시스템(장치)의 개략적인 구성"}
