{"patent_id": "10-2022-0000918", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0105486", "출원번호": "10-2022-0000918", "발명의 명칭": "스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템", "출원인": "(주)비트버스", "발명자": "전성호"}}
{"patent_id": "10-2022-0000918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "발전소 배관 설비 감시 시스템에 있어서,발전소 배관의 진동을 감지하는 진동 센서부(110)들과;상기 진동 센서부(110)에서 감지된 진동 신호를 습득하여 오버올(overall), 주파수 대역별, 또는 각 주파수 별진동 레벨을 연산한 후 진동 신호의 1차 이상 여부(해당 운전 조건에 해당하는 운전 조건별 진동 임계 레벨값초과하는지 여부)를 판단하는 1차 진동 분석부(120)와;상기 진동 분석부(120)에서 감지 대상에 1차 이상이 있다고 판단된 경우, 대응하는 진동 데이터(센서 ID, 시간및 진폭 신호)를 서버(또는 메인 제어부)로 전송하고 서버(200, 또는 메인 제어부)로부터 정보를 수신하는 제1송수신부(130)와;상기 제1 송수신부(130)로부터 수신된 1차 이상이 있다고 판단된 진동 신호의 특징벡터를 추출하여 2D 칼라 이미지를 생성하는 특징벡터 추출부(220)와, 상기 2D 칼라 이미지를 학습하여 최종 이상 여부를 판단하는 AI 진동분석부(230)와, 상기 제1 송수신부(130)에 발전소 설비(터빈, 배관)의 운전 정보(터빈 회전수, 터빈 부하, 배관압력, 배관 유체 온도)를 전달하는 운전 정보 관리부(250)와, 상기 제1 송수신부(130)와 교신하는 제2 송수신부(210)와, 상기 진동 데이터 및 분석 결과를 저장하는 데이터 저장부(270)를 포함하는 서버(200);를 포함하여 구성되는 것을 특징으로 하는 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템."}
{"patent_id": "10-2022-0000918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 서버(200)의 운전 정보 관리부(250)는 상기 1차 진동 분석부(120)에 발전소 설비(터빈, 배관)의 운전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)를 전달하고,상기 1차 진동 분석부(120)는 현재의 진동 레벨값(오버올 overall, 주파수 대역별, 또는 각 주파수 별)이 발전소 설비(터빈, 배관)의 운전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)에 해당하는 운전 조건별로 부여된 진동 임계 레벨값(Level_ref)을 초과하는 경우, 배관의 1차 이상으로 판단하여 진동 데이터(센서ID, 시간 및 진폭 신호)를 제1 송수신부(130)를 통하여 서버(200)에 전송하는 것을 특징으로 하는 스마트 진동센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템."}
{"patent_id": "10-2022-0000918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 AI 진동 분석부(230)는,발전소 설비(터빈, 배관)의 운전 조건(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)들을 구획하고,상기 1차 진동 분석부(120)에 의해 1차 이상이 있다고 판단되어 전송된 진동 신호의 2D 칼라 이미지를 구획된운전 조건별로 별도로 학습하고 교사하여 운전 조건별로 별도의 기계학습 모델을 생성하여 판단 하는 것을 특징으로 하는 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템."}
{"patent_id": "10-2022-0000918", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,공개특허 10-2023-0105486-3-특징 벡터(파라미터) 추출부(220)는,이산 웨이블릿 변환(Discrete Wavelet Transform, DWT),단시간 푸리에 변환(Multi-resolution Short-Time Fourier Transform),멜 필터뱅크(mel filterbank) 및 로그를 적용하는 로그 멜 필터뱅크 에너지(log mel filterbank energy),멜프리퀀시 필터뱅크 변환 및 로그 변환을 통해 멀티레졸루션 로그 멜 스펙트로그램, 중에서 선택된 적어도 하나의 특징 파라미터를 이미화하여 입력 및 학습 데이터로 생성하는 것을 특징으로 하는 스마트 진동 센서와 AI진동 분석을 이용한 발전소 배관 설비 감시 시스템."}
{"patent_id": "10-2022-0000918", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템에 관한 것으로, 발전소 배 관 설비 감시 시스템에 있어서, 발전소 배관의 진동을 감지하는 진동 센서부들과; 상기 진동 센서부에 서 감지된 진동 신호를 습득하여 오버올(overall), 주파수 대역별, 또는 각 주파수 별 진동 레벨을 연산한 후 (뒷면에 계속)"}
{"patent_id": "10-2022-0000918", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템에 관한 것이다."}
{"patent_id": "10-2022-0000918", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래 기술로서 시그널링크 주식회사 KR 10-2018-0167558 2018년 12월 21일 출원(발명의 명칭 : 스마트 진동 센 서)는 감지 대상에 설치되어 지속적으로 진동을 모니터링 하는 스마트 진동 센서로서, 감지 대상의 진동을 감지 하는 진동센서부; 상기 진동센서부로부터 출력되는 진동 신호를 기초로 감지 대상에 이상이 발생하였는지 여부 를 판단하는 진동분석부 및, 상기 진동분석부에서 감지 대상에 이상이 있다고 판단된 경우, 대응하는 신호를 외 부로 전송하는 통신부를 포함하는 스마트 진동 센서를 개시한다."}
{"patent_id": "10-2022-0000918", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 현장의 1차 진동 분석부를 구비하여 일정 수준 이상의 신호만을 서버에 구비된 AI 진동 분석부 에 전송하여 서버의 데이터 처리량을 효율적으로 운용할 수 있을 뿐 아니라 운전 정보 관리부의 운전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)에 기반하여 데이터 전송 여부의 판단, 운전 정보별 인공지능 학습, 판단을 함으로써 데이터 취급 효율과 판단 정확도를 향상 시킬수 있는 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템을 제공하기 위한 것이다."}
{"patent_id": "10-2022-0000918", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 따른 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템은 발전소 배관 설비 감시 시스템에 있어서, 발전소 배관의 진동을 감지하는 진동 센서부들과; 상기 진동 센서부 에서 감지된 진동 신호를 습득하여 오버올(overall), 주파수 대역별, 또는 각 주파수 별 진동 레벨을 연 산한 후 진동 신호의 1차 이상 여부(해당 운전 조건에 해당하는 운전 조건별 진동 임계 레벨값 초과하는지 여부)를 판단하는 1차 진동 분석부와; 상기 진동 분석부에서 감지 대상에 1차 이상이 있다고 판단된 경우, 대응하는 진동 데이터(센서 ID, 시간 및 진폭 신호)를 서버(또는 메인 제어부)로 전송하고 서버(200, 또는 메인 제어부)로부터 정보를 수신하는 제1 송수신부와; 상기 통신부로부터 수신된 1차 이상이 있다고 판단된 진동 신호의 특징벡터를 추출하여 2D 칼라 이미지를 생성하는 특징벡터 추출부와, 상기 2D 칼라 이미지를 학습하여 최종 이상 여부를 판단하는 AI 진동 분석부 와, 상기 제1 송수신부에 발전소 설비(터빈, 배관)의 운전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)를 전달하는 운전 정보 관리부와, 상기 제1 송수신부와 교신하는 제2 송수신부 와, 상기 진동 데이터 및 분석 결과를 저장하는 데이터 저장부를 포함하는 서버;를 포함하여 구성되 는 것을 특징으로 한다. 본 발명의 일실시예에 따른 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템은에 있어 서, 상기 서버의 운전 정보 관리부는 상기 1차 진동 분석부에 발전소 설비(터빈, 배관)의 운전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)를 전달한다. 상기 1차 진동 분석부는 현재의 진동 레벨값(오버올 overall, 주파수 대역별, 또는 각 주파수 별)이 발전소 설비(터빈, 배관)의 운전 정보(터 빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)에 해당하는 운전 조건별로 부여된 진동 임계 레벨값 (Level_ref)을 초과하는 경우, 배관의 1차 이상으로 판단하여 진동 데이터(센서 ID, 시간 및 진폭 신호)를 제1 송수신부를 통하여 서버에 전송한다. 본 발명의 일실시예에 따른 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템은에 있어 서, 상기 AI 진동 분석부는, 발전소 설비(터빈, 배관)의 운전 조건(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)들을 구획하고, 상기 1차 진동 분석부에 의해 1차 이상이 있다고 판단되어 전송된 진동 신호의 2D 칼라 이미지를 구획된 운전 조건별로 별도로 학습하고 교사하여 운전 조건별로 별도의 기계학습 모델 을 생성하여 판단하는 것이 바람직하다. 본 발명의 일실시예에 따른 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템은에 있어 서, 특징 벡터(파라미터) 추출부는, 이산 웨이블릿 변환(Discrete Wavelet Transform, DWT), 단시간 푸리 에 변환(Multi-resolution Short-Time Fourier Transform), 멜 필터뱅크(mel filterbank) 및 로그를 적용하는 로그 멜 필터뱅크 에너지(log mel filterbank energy), 멜프리퀀시 필터뱅크 변환 및 로그 변환을 통해 멀티레 졸루션 로그 멜 스펙트로그램, 중에서 선택된 적어도 하나의 특징 파라미터를 이미화하여 입력 및 학습 데이터 로 생성하는 것이 바람직하다."}
{"patent_id": "10-2022-0000918", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르는 경우, 현장의 1차 진동 분석부를 구비하여 일정 수준 이상의 신호만을 서버에 구비된 AI 진동 분석부에 전송하여 서버의 데이터 처리량을 효율적으로 운용할 수 있을 뿐 아니라 운전 정보 관리부 의 운전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)에 기반하여 데이터 전송 여부의 판단, 운전 정보별 인공지능 학습, 판단을 함으로써 데이터 취급 효율과 판단 정확도를 향상 시킬수 있는 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템이 제공된다."}
{"patent_id": "10-2022-0000918", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 본 발명의 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템에 대하여 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템 전체 구성도이다.도 1에 도시된 바와 같이, 본 발명의 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템 은 발전소 배관 설비 감시 시스템에 관한 것으로 진동 센서부들과 1차 진동 분석부와 제1 송수신부 와 서버를 포함하여 구성된다. 진동 센서부들은 발전소 배관의 진동을 감지한다. 진동 센서부들은 통상의 가속도계 또는 MEMS 가속 도계 일 수 있다. 진동 센서부들은 별도로 구비될 수 있지만, 1차 진동 분석부와 함께 구비되는 스마 트 센서의 형태일 수 있다. 하나의 진동 센서부와 하나의 1차 진동 분석부가 한조를 이루어 1:1 로 함께 구비되는 스마트 진동 센서 일수 있다. 아니면 복수개의 진동 센서부가 하나의 1차 진동 분석부(12 0)와 교신하는 형태로 구비될 수도 있다. 도 1에 도시된 바와 같이, 1차 진동 분석부는 진동 센서부에서 감지된 진동 신호를 습득하여 오버올 (overall), 주파수 대역별, 또는 각 주파수 별 진동 레벨을 연산한 후 진동 신호의 1차 이상 여부(해당 운전 조건에 해당하는 운전 조건별 진동 임계 레벨값 초과하는지 여부)를 판단한다. 도 1에 도시된 바와 같이, 제1 송수신부는 진동 분석부에서 감지 대상에 1차 이상이 있다고 판단된 경 우, 대응하는 진동 데이터(센서 ID, 시간 및 진폭 신호)를 서버(또는 메인 제어부)로 전송하고 서버(200, 또는 메인 제어부)로부터 정보를 수신한다. 도 1에 도시된 바와 같이, 서버는 통신부로부터 수신된 1차 이상이 있다고 판단된 진동 신호의 특징벡 터를 추출하여 2D 칼라 이미지를 생성하는 특징벡터 추출부와, 상기 2D 칼라 이미지를 학습하여 최종 이상 여부를 판단하는 AI 진동 분석부와, 상기 제1 송수신부에 발전소 설비(터빈, 배관)의 운전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)를 전달하는 운전 정보 관리부와, 상기 제1 송수신부(13 0)와 교신하는 제2 송수신부와, 상기 진동 데이터 및 분석 결과를 저장하는 데이터 저장부를 포함하 는 를 포함하여 구성된다. 도 1에 도시된 바와 같이, 본 발명의 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템 에 있어서, 서버의 운전 정보 관리부는 상기 1차 진동 분석부에 발전소 설비(터빈, 배관)의 운 전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)를 전달한다. 여기서, 1차 진동 분석부는 현재의 진동 레벨값(오버올 overall, 주파수 대역별, 또는 각 주파수 별)이 발전소 설비(터빈, 배관)의 운전 정보(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)에 해당하는 운전 조건별로 부여된 진동 임계 레벨값(Level_ref)을 초과하는 경우, 배관의 1차 이상으로 판단하여 진동 데이터(센 서 ID, 시간 및 진폭 신호)를 제1 송수신부를 통하여 서버에 전송한다. 도 1에 도시된 바와 같이, 본 발명의 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템 에 있어서, AI 진동 분석부는, 발전소 설비(터빈, 배관)의 운전 조건(터빈 회전수, 터빈 부하, 배관 압력, 배관 유체 온도)들을 구획한다. 또한, AI 진동 분석부는 1차 진동 분석부에 의해 1차 이상이 있다고 판단되어 전송된 진동 신호의 2D 칼라 이미지를 구획된 운전 조건별로 별도로 학습하고 교사하여 운전 조건별로 별도의 기계학습 모델을 생성하여 판단한다. 도 1에 도시된 바와 같이, 본 발명의 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템 에 있어서, 특징 벡터(파라미터) 추출부는, 이산 웨이블릿 변환(Discrete Wavelet Transform, DWT), 단시간 푸리에 변환(Multi-resolution Short-Time Fourier Transform), 멜 필터뱅크(mel filterbank) 및 로그를 적 용하는 로그 멜 필터뱅크 에너지(log mel filterbank energy), 멜프리퀀시 필터뱅크 변환 및 로그 변환을 통해 멀티레졸루션 로그 멜 스펙트로그램, 중에서 선택된 적어도 하나의 특징 파라미터를 이미화하여 입력 및 학습 데이터로 생성하는 것이 바람직하다. 본 발명은 상기에서 언급한 바람직한 실시예와 관련하여 설명됐지만, 본 발명의 범위가 이러한 실시예에 한정되 는 것은 아니며, 본 발명의 범위는 이하의 특허청구범위에 의하여 정하여지는 것으로 본 발명과 균등 범위에 속 하는 다양한 수정 및 변형을 포함할 것이다. 아래의 특허청구범위에 기재된 도면부호는 단순히 발명의 이해를 보조하기 위한 것으로 권리범위의 해석에 영향 을 미치지 아니함을 밝히며 기재된 도면부호에 의해 권리범위가 좁게 해석되어서는 안될 것이다."}
{"patent_id": "10-2022-0000918", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 스마트 진동 센서와 AI 진동 분석을 이용한 발전소 배관 설비 감시 시스템 전체 구성도. 도 2는 통상의 발전소 배관 설비 사진."}
