{"patent_id": "10-2022-0049935", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0150501", "출원번호": "10-2022-0049935", "발명의 명칭": "무선 통신 시스템에서 제어 정보의 송수신을 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "장영록"}}
{"patent_id": "10-2022-0049935", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위한 단말의 방법에 있어서,제어 채널(control channel)과 관련된 설정 정보를, 기지국으로부터, 수신하는 단계; 상기 제어 채널과 관련된설정 정보는:제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간(search space) 정보, 및제2 제어 자원 세트 정보 및 제2 탐색 공간 정보를 포함하고,상기 제어 채널과 관련된 설정 정보에 기반하여, PDCCH(physical downlink control channel) 반복 전송(repetition transmission)에 대한 신호를, 상기 기지국으로부터, 수신하는 단계를 포함하고,상기 제1 탐색 공간 정보는 주파수 위치와 관련된 제1 비트맵을 포함하고,상기 제2 탐색 공간 정보는 주파수 위치와 관련된 제2 비트맵을 포함하는 것인, 방법."}
{"patent_id": "10-2022-0049935", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위한 단말의 장치에 있어서,송수신기(transceiver); 및상기 송수신기와 연결된 적어도 하나의 프로세서(at least one processor)를 포함하고,상기 적어도 하나의 프로세서는:제어 채널(control channel)과 관련된 설정 정보를, 기지국으로부터, 수신하고; 상기 제어 채널과 관련된 설정정보는:제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간(search space) 정보, 및제2 제어 자원 세트 정보 및 제2 탐색 공간 정보를 포함하고,상기 제어 채널과 관련된 설정 정보에 기반하여, PDCCH(physical downlink control channel) 반복 전송(repetition transmission)에 대한 신호를, 상기 기지국으로부터, 수신하도록 구성되고,상기 제1 탐색 공간 정보는 주파수 위치와 관련된 제1 비트맵을 포함하고,상기 제2 탐색 공간 정보는 주파수 위치와 관련된 제2 비트맵을 포함하는 것인, 단말."}
{"patent_id": "10-2022-0049935", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위한 기지국의 방법에 있어서,제어 채널(control channel)과 관련된 설정 정보를, 단말에게, 송신하는 단계; 상기 제어 채널과 관련된 설정정보는:제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간(search space) 정보, 및제2 제어 자원 세트 정보 및 제2 탐색 공간 정보를 포함하고,상기 제어 채널과 관련된 설정 정보에 기반하여, PDCCH(physical downlink control channel) 반복 전송(repetition transmission)에 대한 신호를, 상기 단말에게, 송신하는 단계를 포함하고,공개특허 10-2023-0150501-3-상기 제1 탐색 공간 정보는 주파수 위치와 관련된 제1 비트맵을 포함하고,상기 제2 탐색 공간 정보는 주파수 위치와 관련된 제2 비트맵을 포함하는 것인, 방법."}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련한 것이다. 본 개시는 4G 시 스템 이후 보다 높은 데이터 전송률을 지원하기 위한 5G 통신 시스템을 IoT 기술과 융합하는 통신 기법 및 그 시 스템에 관한 것이다. 본 개시는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스 (예를 들어, 스마트 (뒷면에 계속)"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(disclosure)는 일반적으로 무선 통신 시스템에 관한 것으로, 구체적으로, 무선 통신 시스템에서 제어 정보의 송수신을 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 상술한 것과 무선통신 시스템의 발전에 따라 다양한 서비스를 제공할 수 있게 됨으로써, 이러한 서비스들을 원 활하게 제공하기 위한 방안이 요구되고 있다. 특히, 무선 통신 시스템에서 제어 정보의 반복 송수신을 수행하기 위한 기술이 요구되고 있다."}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "개시된 실시예는 이동 통신 시스템에서 서비스를 효과적으로 제공할 수 있는 장치 및 방법을 제공하고자 한다."}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시 예들에 따르면, 무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위 한 단말의 방법에 있어서, 제어 채널(control channel)과 관련된 설정 정보를, 기지국으로부터, 수신하는 단계; 상기 제어 채널과 관련된 설정 정보는: 제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간 (search space) 정보, 및 제2 제어 자원 세트 정보 및 제2 탐색 공간 정보를 포함하고, 상기 제어 채널과 관련 된 설정 정보에 기반하여, PDCCH(physical downlink control channel) 반복 전송(repetition transmission)에 대한 신호를, 상기 기지국으로부터, 수신하는 단계를 포함하고, 상기 제1 탐색 공간 정보는 주파수 위치와 관련 된 제1 비트맵을 포함하고, 상기 제2 탐색 공간 정보는 주파수 위치와 관련된 제2 비트맵을 포함하는 것일 수 있다. 본 개시의 다양한 실시 예들에 따르면, 무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위 한 단말의 장치에 있어서, 송수신기(transceiver); 및 상기 송수신기와 연결된 적어도 하나의 프로세서(at least one processor)를 포함하고, 상기 적어도 하나의 프로세서는: 제어 채널(control channel)과 관련된 설 정 정보를, 기지국으로부터, 수신하고; 상기 제어 채널과 관련된 설정 정보는: 제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간(search space) 정보, 및 제2 제어 자원 세트 정보 및 제2 탐색 공간 정 보를 포함하고, 상기 제어 채널과 관련된 설정 정보에 기반하여, PDCCH(physical downlink control channel) 반복 전송(repetition transmission)에 대한 신호를, 상기 기지국으로부터, 수신하도록 구성되고, 상기 제1 탐 색 공간 정보는 주파수 위치와 관련된 제1 비트맵을 포함하고, 상기 제2 탐색 공간 정보는 주파수 위치와 관련 된 제2 비트맵을 포함하는 것일 수 있다. 본 개시의 다양한 실시 예들에 따르면, 무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위 한 기지국의 방법에 있어서, 제어 채널(control channel)과 관련된 설정 정보를, 단말에게, 송신하는 단계; 상 기 제어 채널과 관련된 설정 정보는: 제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간 (search space) 정보, 및 제2 제어 자원 세트 정보 및 제2 탐색 공간 정보를 포함하고, 상기 제어 채널과 관련 된 설정 정보에 기반하여, PDCCH(physical downlink control channel) 반복 전송(repetition transmission)에 대한 신호를, 상기 단말에게, 송신하는 단계를 포함하고, 상기 제1 탐색 공간 정보는 주파수 위치와 관련된 제1 비트맵을 포함하고, 상기 제2 탐색 공간 정보는 주파수 위치와 관련된 제2 비트맵을 포함하는 것일 수 있다."}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 실시예는 이동통신 시스템에서 서비스를 효과적으로 제공할 수 있는 장치 및 방법을 제공한다."}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 실시예를 설명함에 있어서 본 개시가 속하는 기술 분야에 익히 알려져 있고 본 개시와 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 개시의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부된 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성 요 소에는 동일한 참조 번호를 부여하였다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시의 개시가 완전하도록 하고, 본 개시가 속하"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시 는 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 또 한 본 개시를 설명함에 있어서 관련된 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐 릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하 여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 이하, 기지국은 단말의 자원 할당을 수행하는 주체로서, gNode B, eNode B, Node B, BS (Base Station), 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말은 UE (User Equipment), MS (Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기능을 수행할 수 있는 멀티미디어시스템을 포함 할 수 있다. 본 개시에서 하향링크(Downlink; DL)는 기지국이 단말에게 전송하는 신호의 무선 전송경로이고, 상 향링크는(Uplink; UL)는 단말이 기국에게 전송하는 신호의 무선 전송경로를 의미한다. 또한, 이하에서 LTE 또는 LTE-A 시스템을 일예로서 설명할 수도 있지만, 유사한 기술적 배경 또는 채널형태를 갖는 여타의 통신시스템에 도 본 개시의 실시예가 적용될 수 있다. 예를 들어 LTE-A 이후에 개발되는 5세대 이동통신 기술(5G, new radio, NR)이 이에 포함될 수 있으며, 이하의 5G는 기존의 LTE, LTE-A 및 유사한 다른 서비스를 포함하는 개념일 수도 있다. 또한, 본 개시는 숙련된 기술적 지식을 가진 자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴 퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예를 들면, 잇달아 도시되어 있는 두 개의 블 록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으 로 수행되는 것도 가능하다. 이때, 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들 을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다.따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있 다. 또한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 무선 통신 시스템은 초기의 음성 위주의 서비스를 제공하던 것에서 벗어나 예를 들어, 3GPP의 HSPA(High Speed Packet Access), LTE(Long Term Evolution 또는 E-UTRA (Evolved Universal Terrestrial Radio Access)), LTE-Advanced (LTE-A), LTE-Pro, 3GPP2의 HRPD(High Rate Packet Data), UMB(Ultra Mobile Broadband), 및 IEEE의 802.16e 등의 통신 표준과 같이 고속, 고품질의 패킷 데이터 서비스를 제공하는 광대역 무선 통신 시스 템으로 발전하고 있다. 광대역 무선 통신 시스템의 대표적인 예로, LTE 시스템에서는 하향링크(Downlink, DL)에서는 OFDM(Orthogonal Frequency Division Multiplexing) 방식을 채용하고 있고, 상향링크(Uplink; UL)에서는 SC-FDMA(Single Carrier Frequency Division Multiple Access) 방식을 채용하고 있다. 상향링크는 단말(UE(User Equipment) 또 는 MS(Mobile Station))이 기지국(eNode B, 또는 base station(BS))으로 데이터 또는 제어신호를 전송하는 무 선링크를 뜻하고, 하향링크는 기지국이 단말로 데이터 또는 제어신호를 전송하는 무선링크를 뜻한다. 상술한 다 중 접속 방식은, 통상 각 사용자 별로 데이터 또는 제어정보를 실어 보낼 시간-주파수 자원을 서로 겹치지 않도 록, 즉 직교성 (Orthogonality)이 성립하도록, 할당 및 운용함으로써 각 사용자의 데이터 또는 제어정보를 구분 할 수 있다. LTE 이후의 향후 통신 시스템으로서, 즉, 5G 통신시스템은 사용자 및 서비스 제공자 등의 다양한 요구 사항을 자유롭게 반영할 수 있어야 하기 때문에 다양한 요구사항을 동시에 만족하는 서비스가 지원되어야 한다. 5G 통 신시스템을 위해 고려되는 서비스로는 향상된 모바일 광대역 통신(enhanced mobile broadband, eMBB), 대규모 기계형 통신(massive machine type communication, mMTC), 초신뢰 저지연 통신(ultra reliability low latency communciation, URLLC) 등이 있다. eMBB는 기존의 LTE, LTE-A 또는 LTE-Pro가 지원하는 데이터 전송 속도보다 더욱 향상된 데이터 전송 속도를 제 공하는 것을 목표로 한다. 예를 들어, 5G 통신시스템에서 eMBB는 하나의 기지국 관점에서 하향링크에서는 20Gbps의 최대 전송 속도(peak data rate), 상향링크에서는 10Gbps의 최대 전송 속도를 제공할 수 있어야 한다. 또한 5G 통신시스템은 최대 전송 속도를 제공하는 동시에, 증가된 단말의 실제 체감 전송 속도(User perceived data rate)를 제공해야 한다. 이와 같은 요구 사항을 만족시키기 위해, 더욱 향상된 다중 안테나 (Multi Input Multi Output, MIMO) 전송 기술을 포함하여 다양한 송수신 기술의 향상을 요구한다. 또한 LTE가 사용하는 2GHz 대역에서 최대 20MHz 전송대역폭을 사용하여 신호를 전송하는 반면에, 5G 통신시스템은 3~6GHz 또는 6GHz 이상 의 주파수 대역에서 20MHz 보다 넓은 주파수 대역폭을 사용함으로써 5G 통신시스템에서 요구하는 데이터 전송 속도를 만족시킬 수 있다. 동시에, 5G 통신시스템에서 사물 인터넷(Internet of Thing, IoT)와 같은 응용 서비스를 지원하기 위해 mMTC가 고려되고 있다. mMTC는 효율적으로 사물 인터넷을 제공하기 위해 셀 내에서 대규모 단말의 접속 지원, 단말의 커버리지 향상, 향상된 배터리 시간, 단말의 비용 감소 등이 요구된다. 사물 인터넷은 여러 가지 센서 및 다양 한 기기에 부착되어 통신 기능을 제공하므로 셀 내에서 많은 수의 단말(예를 들어, 1,000,000 단말/km2)을 지원 할 수 있어야 한다. 또한 mMTC를 지원하는 단말은 서비스의 특성상 건물의 지하와 같이 셀이 커버하지 못하는 음영지역에 위치할 가능성이 높으므로 5G 통신시스템에서 제공하는 다른 서비스 대비 더욱 넓은 커버리지를 요 구할 수 있다. mMTC를 지원하는 단말은 저가의 단말로 구성되어야 하며, 단말의 배터리를 자주 교환하기 힘들기 때문에 10~15년과 같이 매우 긴 배터리 생명시간(battery life time)이 요구될 수 있다. 마지막으로, URLLC의 경우, 특정한 목적(mission-critical)으로 사용되는 셀룰라 기반 무선 통신 서비스이다. 예를 들어, 로봇(Robot) 또는 기계 장치(machinery)에 대한 원격 제어(remote control), 산업 자동화 (industrial automation), 무인 비행장치(unmaned aerial vehicle), 원격 건강 제어(remote health care), 비 상 상황 알림(emergency alert) 등에 사용되는 서비스 등을 고려할 수 있다. 따라서 URLLC가 제공하는 통신은 매우 낮은 저지연 및 매우 높은 신뢰도 제공해야 한다. 예를 들어, URLLC을 지원하는 서비스는 0.5 밀리초 보다 작은 무선 접속 지연시간(air interface latency)를 만족해야 하며, 동시에 10-5 이하의 패킷 오류율(packeterror rate)의 요구사항을 갖는다. 따라서, URLLC을 지원하는 서비스를 위해 5G 시스템은 다른 서비스보다 작은 전송 시간 구간(transmit time interval, TTI)를 제공해야 하며, 동시에 통신 링크의 신뢰성을 확보하기 위해 주파수 대역에서 넓은 리소스를 할당해야 하는 설계사항이 요구될 수 있다. 5G의 세가지 서비스들, 즉 eMBB, URLLC, mMTC는 하나의 시스템에서 다중화되어 전송될 수 있다. 이 때, 각각의 서비스들이 갖는 상이한 요구사항을 만족시키기 위해 서비스간에 서로 다른 송수신 기법 및 송수신 파라미터를 사용할 수 있다. 물론 5G는 전술한 세가지 서비스들에 제한되지 않는다. [NR 시간-주파수 자원] 이하에서는 5G 시스템의 프레임 구조에 대해 도면을 참조하여 보다 구체적으로 설명한다. 도 1은 본 개시의 실시예에 따른 무선 통신 시스템에서 시간-주파수영역의 기본 구조를 도시한 도면이다. 도 1의 가로축은 시간 영역을, 세로축은 주파수 영역을 나타낸다. 시간 및 주파수 영역에서 자원의 기본 단위는 자원 요소(resource element, RE)로서 시간 축으로 1 OFDM(orthogonal frequency division multiplexing) 심볼 및 주파수 축으로 1 부반송파(Subcarrier)로 정의될 수 있다. 주파수 영역에서 (예, 12)개 의 연속된 RE들은 하나의 자원 블록(Resource Block, RB)을 구성할 수 있다. 도 2는 본 개시의 실시예에 따른 무선 통신 시스템에서 프레임, 서브프레임, 슬롯 구조를 도시한 도면이다. 도 2에는 프레임(Frame), 서브프레임(Subframe), 슬롯(Slot) 구조의 일 예를 도시한다. 1프레 임은 10ms로 정의될 수 있다. 1서브프레임은 1ms로 정의될 수 있으며, 따라서 1프레임은 총 10 개의 서브프레임으로 구성될 수 있다. 1슬롯(202, 203)은 14개의 OFDM 심볼로 정의될 수 있다(즉 1 슬롯 당 심볼 수(( )=14).1 서브프레임은 하나 또는 복수 개의 슬롯(202, 203)으로 구성될 수 있으며, 1 서브프레임당 슬롯(202, 203)의 개수는 부반송파 간격에 대한 설정 값 μ(204, 205)에 따라 다를 수 있다. 도 2의 일 예에서는 부반송파 간격 설정 값으로 μ=0인 경우와 μ=1인 경우가 도시되어 있다. μ =0일 경우, 1 서브프레임은 1개의 슬롯으로 구성될 수 있고, μ=1일 경우, 1 서브프레임 은 2개의 슬롯으로 구성될 수 있다. 즉 부반송파 간격에 대한 설정 값 μ에 따라 1 서브프레임 당 슬 롯 수( )가 달라질 수 있고, 이에 따라 1 프레임 당 슬롯 수( )가 달라질 수 있다. 각 부반송파 간격 설정 μ에 따른 및 는 표 1로 정의될 수 있다. [표 1]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[대역폭부분 (BWP)] 다음으로 5G 통신 시스템에서 대역폭부분(Bandwidth Part, BWP) 설정에 대하여 도면을 참조하여 구체적으로 설 명한다. 도 3는 본 개시의 실시예에 따른 무선 통신 시스템에서 대역폭부분 설정의 일 예를 도시한 도면이다. 도 3에는 단말 대역폭(UE bandwidth)이 두 개의 대역폭부분들, 즉, 대역폭부분#1(BWP#1)과 대역폭부 분#2(BWP#2)로 설정된 일 예를 보여준다. 기지국은 단말에게 하나 또는 복수 개의 대역폭부분을 설정해줄 수 있으며, 각 대역폭부분에 대하여 표 2와 같이 정보들을 설정해 줄 수 있다. [표 2]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "대역폭파트에 관한 설정은 표 2의 예시에 제한되는 것은 아니며, 표 2의 설정 정보 외에도 대역폭부분과 관련된 다양한 파라미터들이 단말에게 설정될 수 있다. 설정 정보들은 상위 계층 시그널링, 예를 들면, RRC(Radio Resource Control) 시그널링을 통해 기지국이 단말에게 전달할 수 있다. 설정된 하나 또는 복수 개의 대역폭부 분들 중에서 적어도 하나의 대역폭부분이 활성화(Activation)될 수 있다. 설정된 대역폭부분에 대한 활성화 여 부는 기지국으로부터 단말에게 RRC 시그널링을 통해 준정적으로 전달되거나 DCI(Downlink Control Informatio n)를 통해 동적으로 전달될 수 있다. 일 실시예에 따르면, RRC(Radio Resource Control) 연결 전의 단말은 초기 접속을 위한 초기 대역폭부분 (Initial BWP)을 MIB(Master Information Block)를 통해 기지국으로부터 설정 받을 수 있다. 구체적으로, 단말 은 초기 접속 단계에서 MIB를 통해 초기 접속에 필요한 시스템 정보(Remaining System Information, RMSI)(또 는, System Information Block 1, SIB1)를 수신을 위한 PDCCH가 전송될 수 있는 제어 영역(Control Resource Set, CORESET)과 탐색 공간(Search Space)에 대한 설정 정보를 수신할 수 있다. MIB로 설정되는 제어 영역과 탐 색 공간은 각각 식별자(Identity, ID) 0으로 간주될 수 있다. 기지국은 단말에게 MIB를 통해 제어 영역#0에 대 한 주파수 할당 정보, 시간 할당 정보, 뉴머롤로지(Numerology) 등의 설정 정보를 통지할 수 있다. 또한 기지국 은 단말에게 MIB를 통해 제어 영역#0에 대한 모니터링 주기 및 occasion에 대한 설정 정보, 즉 탐색 공간#0에 대한 설정 정보를 통지할 수 있다. 단말은 MIB로부터 획득한 제어 영역#0으로 설정된 주파수 영역을 초기 접속 을 위한 초기 대역폭부분으로 간주할 수 있다. 이때, 초기 대역폭부분의 식별자(ID)는 0으로 간주될 수 있다. 본 개시의 실시예들에 따르면, 5G에서 지원하는 대역폭부분에 대한 설정은 다양한 목적으로 사용될 수 있다. 일 실시 예에 따르면, 시스템 대역폭보다 단말이 지원하는 대역폭이 작을 경우에 대역폭부분 설정을 통해 이를 지원할 수 있다. 예를 들면, 기지국은 대역폭부분의 주파수 위치(설정 정보 2)를 단말에게 설정함으로써 시스템 대역폭 내의 특정 주파수 위치에서 단말이 데이터를 송수신할 수 있다. 또한 일 실시예에 따르면, 서로 다른 뉴머롤로지를 지원하기 위한 목적으로 기지국이 단말에게 복수 개의 대역 폭부분들을 설정할 수 있다. 예를 들면, 어떤 단말에게 15kHz의 부반송파 간격과 30kHz의 부반송파 간격을 이용 한 데이터 송수신을 모두 지원하기 위해서, 두 개의 대역폭부분들을 각각 15kHz와 30kHz의 부반송파 간격으로 설정할 수 있다. 서로 다른 대역폭부분들은 주파수 분할 다중화(Frequency Division Multiplexing)될 수 있고, 특정 부반송파 간격으로 데이터를 송수신하고자 할 경우, 해당 부반송파 간격으로 설정되어 있는 대역폭부분이 활성화될 수 있다. 또한 일 실시예에 따르면, 단말의 전력 소모 감소를 위한 목적으로 기지국이 단말에게 서로 다른 크기의 대역폭 을 갖는 대역폭부분을 설정할 수 있다. 예를 들면, 단말이 매우 큰 대역폭, 예컨대 100MHz의 대역폭을 지원하고 해당 대역폭으로 항상 데이터를 송수신할 경우, 매우 큰 전력 소모가 발생될 수 있다. 특히 트래픽(Traffic)이 없는 상황에서 100MHz의 큰 대역폭으로 불필요한 하향링크 제어 채널에 대한 모니터링을 수행하는 것은 전력 소모 관점에서 매우 비효율적일 수 있다. 단말의 전력 소모를 줄이기 위한 목적으로, 기지국은 단말에게 상대적으 로 작은 대역폭의 대역폭부분, 예를 들면, 20MHz의 대역폭부분을 설정할 수 있다. 트래픽이 없는 상황에서 단말 은 20MHz 대역폭부분에서 모니터링 동작을 수행할 수 있고, 데이터가 발생하였을 경우 기지국의 지시에 따라 100MHz의 대역폭부분으로 데이터를 송수신할 수 있다. 대역폭부분을 설정하는 방법에 있어서, RRC 연결(Connected) 전의 단말들은 초기 접속 단계에서 MIB(Master Information Block)을 통해 초기 대역폭부분(Initial Bandwidth Part)에 대한 설정 정보를 수신할 수 있다. 구 체적으로, 단말은 PBCH(Physical Broadcast Channel)의 MIB로부터 SIB(System Information Block)를 스케쥴링 하는 DCI(Downlink Control Information)가 전송될 수 있는 하향링크 제어 채널을 위한 제어 영역(Control Resource Set, CORESET)을 설정 받을 수 있다. MIB로 설정된 제어 영역의 대역폭이 초기 대역폭부분으로 간주될 수 있으며, 설정된 초기 대역폭부분을 통해 단말은 SIB가 전송되는 PDSCH(Physical Downlink Shared Channel) 를 수신할 수 있다. 초기 대역폭부분은 SIB을 수신하는 용도 외에도, 다른 시스템 정보(Other System Information, OSI), 페이징(Paging), 랜덤 엑세스(Random Access) 용으로 활용될 수도 있다. [대역폭부분 (BWP) 변경] 단말에게 하나 이상의 대역폭부분이 설정되었을 경우, 기지국은 단말에게 DCI 내의 대역폭부분 지시자 (Bandwidth Part Indicator) 필드를 이용하여, 대역폭부분에 대한 변경(또는, 스위칭(switching), 천이 (transition))을 지시할 수 있다. 일 예로 도 3에서 단말의 현재 활성화된 대역폭부분이 대역폭부분#1일 경우, 기지국은 단말에게 DCI 내의 대역폭부분 지시자로 대역폭부분#2를 지시할 수 있고, 단말은 수신한 DCI 내의 대역폭부분 지시자로 지시된 대역폭부분#2로 대역폭부분 변경을 수행할 수 있다. 전술한 바와 같이 DCI 기반 대역폭부분 변경은 PDSCH 또는 PUSCH를 스케줄링하는 DCI에 의해 지시될 수 있기 때 문에, 단말은 대역폭부분 변경 요청을 수신하였을 경우, 해당 DCI가 스케줄링하는 PDSCH 또는 PUSCH를 변경된 대역폭부분에서 무리 없이 수신 또는 송신을 수행할 수 있어야 한다. 이를 위해, 표준에서는 대역폭부분 변경 시 요구되는 지연 시간(TBWP)에 대한 요구 사항을 규정하였으며, 예를 들어 표 3과 같이 정의될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다. [표 3]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "대역폭부분 변경 지연 시간에 대한 요구사항은 단말의 능력(Capability)에 따라 타입 1 또는 타입 2를 지원할 수 있다. 단말은 기지국에 지원 가능한 대역폭부분 지연 시간 타입을 보고할 수 있다. 대역폭부분 변경 지연시간에 대한 요구사항에 따라, 단말이 대역폭부분 변경 지시자를 포함하는 DCI를 슬롯 n에 서 수신하였을 경우, 단말은 대역폭부분 변경 지시자가 가리키는 새로운 대역폭부분으로의 변경을 슬롯 n+TBWP보 다 늦지 않은 시점에서 완료를 할 수 있고, 변경된 새로운 대역폭부분에서 해당 DCI가 스케줄링하는 데이터채널 에 대한 송수신을 수행할 수 있다. 기지국은 새로운 대역폭부분으로 데이터채널을 스케줄링하고자 할 경우, 단말의 대역폭부분 변경 지연시간(TBWP)을 고려하여, 데이터채널에 대한 시간 도메인 자원할당을 결정할 수 있다. 즉, 기지국은 새로운 대역폭부분으로 데이터채널을 스케줄링 할 때, 데이터채널에 대한 시간 도메인 자원할당을 결정하는 방법에 있어서, 대역폭부분 변경 지연시간 이 후로 해당 데이터채널을 스케줄링할 수 있다. 이에 따라 단말은 대역폭부분 변경을 지시하는 DCI가, 대역폭부분 변경 지연 시간 (TBWP) 보다 작은 슬롯 오프셋 (K0 또는 K2) 값을 지시하는 것을 기대하지 않을 수 있다. 만약 단말이 대역폭부분 변경을 지시하는 DCI(예를 들어 DCI 포맷 1_1 또는 0_1)을 수신하였다면, 단말은 해당 DCI를 포함하는 PDCCH를 수신한 슬롯의 세번째 심볼에서부터, 해당 DCI 내의 시간도메인 자원할당 지시자 필드 로 지시된 슬롯 오프셋(K0 또는 K2) 값으로 지시된 슬롯의 시작 지점까지에 해당하는 시간 구간 동안 어떠한 송 신 또는 수신도 수행하지 않을 수 있다. 예를 들어, 단말이 슬롯 n에서 대역폭부분 변경을 지시하는 DCI를 수신 하였고, 해당 DCI로 지시된 슬롯 오프셋 값이 K라고 한다면, 단말은 슬롯 n의 세번째 심볼에서부터 슬롯 n+K이 전 심볼(즉 슬롯 n+K-1의 마지막 심볼)까지 어떠한 송신 또는 수신도 수행하지 않을 수 있다. [SS/PBCH 블록] 다음으로 5G에서의 SS(Synchronization Signal)/PBCH 블록에 대하여 설명한다. SS/PBCH 블록이란 PSS(Primary SS), SSS(Secondary SS), PBCH로 구성된 물리계층 채널 블록을 의미할 수 있다. 구체적으로는 하기와 같다. - PSS: 하향링크 시간/주파수 동기의 기준이 되는 신호로 셀 ID의 일부 정보를 제공한다. - SSS: 하향링크 시간/주파수 동기의 기준이 되고, PSS 가 제공하지 않은 나머지 셀 ID 정보를 제공한다. 추가 적으로 PBCH의 복조를 위한 기준 신호(Reference Signal) 역할을 할 수 있다. - PBCH: 단말의 데이터 채널 및 제어 채널 송수신에 필요한 필수 시스템 정보를 제공한다. 필수 시스템 정보는 제어 채널의 무선 자원 매핑 정보를 나타내는 탐색 공간 관련 제어 정보, 시스템 정보를 전송하는 별도의 데이 터 채널에 대한 스케쥴링 제어 정보 등을 포함할 수 있다. - SS/PBCH 블록: SS/PBCH 블록은 PSS, SSS, PBCH의 조합으로 이뤄진다. SS/PBCH 블록은 5ms 시간 내에서 하나 또는 복수 개가 전송될 수 있고, 전송되는 각각의 SS/PBCH 블록은 인덱스로 구별될 수 있다. 단말은 초기 접속 단계에서 PSS 및 SSS를 검출할 수 있고, PBCH를 디코딩할 수 있다. PBCH로부터 MIB를 획득할 수 있고 이로부터 제어 영역(Control Resource Set; CORESET)#0 (제어 영역 인덱스가 0인 제어 영역에 해당)을 설정 받을 수 있다. 단말은 선택한 SS/PBCH 블록과 제어 영역#0에서 전송되는 DMRS(Demodulation Reference signal)이 QCL(Quasi Co Location)되어 있다고 가정하고 제어 영역#0에 대한 모니터링을 수행할 수 있다. 단말 은 제어 영역#0에서 전송된 하향링크 제어 정보로 시스템 정보를 수신할 수 있다. 단말은 수신한 시스템 정보로 부터 초기 접속에 필요한 RACH(Random Access Channel) 관련 설정 정보를 획득할 수 있다. 단말은 선택한 SS/PBCH 인덱스를 고려하여 PRACH(Physical RACH)를 기지국으로 전송할 수 있고, PRACH를 수신한 기지국은 단말 이 선택한 SS/PBCH 블록 인덱스에 대한 정보를 획득할 수 있다. 기지국은 단말이 각각의 SS/PBCH 블록들 중에서 어떤 블록을 선택하였고 이와 연관되어 있는 제어 영역#0을 모니터링하는 사실을 알 수 있다. [DRX] 도 6는 본 개시의 실시예에 따른 무선 통신 시스템에서 DRX 동작의 일 예를 도시한 도면이다. DRX(Discontinuous Reception)는 서비스를 이용 중인 단말이 기지국과 단말 간에 무선링크가 설정되어 있는 RRC 연결(RRC Connected) 상태에서 데이터를 비연속적으로 수신하는 동작이다. DRX가 적용되면, 단말은 특정 시점에 서 수신기를 온(on)하여 제어 채널을 모니터링하고, 일정 기간 동안 수신되는 데이터가 없으면 수신기를 오프 (off)하여 단말의 전력 소모를 줄일 수 있다. DRX 동작은 다양한 파라미터 및 타이머에 기초하여 MAC 계층 장치 에 의해 제어될 수 있다. 도 6을 참조하면, Active time은 단말이 DRX 주기마다 깨어나서 PDCCH를 모니터링 하는 시간이다. Active time는 다음과 같이 정의될 수 있다. - drx-onDurationTimer or drx-InactivityTimer or drx-RetransmissionTimerDL or drx-RetransmissionTimerUL or ra-ContentionResolutionTimer is running; 또는 - a Scheduling Request is sent on PUCCH and is pending; 또는 - a PDCCH indicating a new transmission addressed to the C-RNTI of the MAC entity has not been received after successful reception of a Random Access Response for the Random Access Preamble not selected by the MAC entity among the contention-based Random Access Preamble drx-onDurationTimer, drx-InactivityTimer, drx-RetransmissionTimerDL, drx-RetransmissionTimerUL, ra- ContentionResolutionTimer 등은 기지국에 의해서 그 값이 설정되는 타이머들이며, 소정의 조건이 만족된 상황 에서 단말이 PDCCH를 모니터링 하도록 설정하는 기능을 포함할 수 있다. drx-onDurationTimer는 DRX cycle에서 단말이 깨어있는 최소 시간을 설정하기 위한 파라미터일 수 있다. drx-InactivityTimer는 새로운 상향링크 전송 또는 하향링크 전송을 지시하는 PDCCH를 수신하는 경우, 단말이 추가적으로 깨어있는 시간을 설정하기 위한 파라미터일 수 있다. drx-RetransmissionTimerDL는 하 향링크 HARQ 절차에서 하향링크 재전송을 수신하기 위하여 단말이 깨어있는 최대 시간을 설정하기 위한 파라미 터일 수 있다. drx-RetransmissionTimerUL는 상향링크 HARQ 절차에서 상향링크 재전송 승인(grant)을 수신하기 위하여 단말이 깨어있는 최대 시간을 설정하기 위한 파라미터일 수 있다. drx-onDurationTimer, drx- InactivityTimer, drx-RetransmissionTimerDL 및 drx-RetransmissionTimerUL는 예를 들어, 시간, 서브프레임 (subframe) 개수, 슬롯 개수 등으로 설정될 수 있다. ra-ContentionResolutionTimer는 랜덤 액세스 절차에서 PDCCH를 모니터링 위한 파라미터일 수 있다. inActive time은 DRX 동작 중 PDCCH를 모니터링하지 않도록 설정되는 시간 또는/혹은 PDCCH를 수신하지 않 도록 설정되는 시간으로, DRX 동작을 수행하는 전체 시간에서 Active time를 제외한 나머지 시간이 inActive time이 될 수 있다. 단말은 Active time 동안 PDCCH를 모니터링하지 않으면, 슬립(sleep) 또는 inActive 상태로 진입하여 전력 소모를 줄일 수 있다. DRX cycle은 단말이 깨어나서 PDCCH를 모니터링 하는 주기를 의미할 수 있다. 즉, 단말이 PDCCH를 모니터링 한 후, 다음 PDCCH를 모니터링 하기까지의 시간 간격 또는 온 듀레이션(on duration)의 발생 주기를 의미한다. DRX cycle은 short DRX cycle 과 long DRX cycle 2 종류가 있다. Short DRX cycle은 선택적(option)으로 적용될 수 있다. Long DRX cycle은 단말에 설정되는 두 가지 DRX cycle 중 긴 cycle일 수 있다. 단말은 Long DRX로 동작하 는 동안에는 drx-onDurationTimer의 시작점(예를 들어, 시작 심볼)에서 Long DRX cycle 만큼 경과한 시점에 다시 drx-onDurationTimer를 시작한다. Long DRX cycle로 동작하는 경우, 단말은 아래 수학 식 1를 만족하는 서브프레임에서 drx-SlotOffset 이후 슬롯에서 drx-onDurationTimer를 시작할 수 있다. 여기서, drx-SlotOffset은 drx-onDurationTimer를 시작하기 전 지연(delay)을 의미한다. drx- SlotOffset은 예를 들어, 시간, 슬롯 개수 등으로 설정될 수 있다. [수학식 1] [(SFN * 10) + subframe number] modulo (drx-LongCycle) = drx-StartOffset 이때, drx-LongCycleStartOffset은 Long DRX cycle과 drx-StartOffset은 Long DRX cycle을 시작할 서브프레임을 정의하는데 사용될 수 있다. drx-LongCycleStartOffset은 예를 들어, 시간, 서브프레임 개수, 슬 롯 개수 등으로 설정될 수 있다. [PDCCH: DCI 관련] 다음으로 5G 시스템에서의 하향링크 제어 정보(Downlink Control Information, DCI)에 대해 구체적으로 설명한 다. 5G 시스템에서 상향링크 데이터(또는 물리 상향링크 데이터 채널(Physical Uplink Shared Channel, PUSCH)) 또 는 하향링크 데이터(또는 물리 하향링크 데이터 채널(Physical Downlink Shared Channel, PDSCH))에 대한 스케 줄링 정보는 DCI를 통해 기지국으로부터 단말에게 전달될 수 있다. 단말은 PUSCH 또는 PDSCH에 대하여 대비책 (Fallback)용 DCI 포맷과 비대비책(Non-fallback)용 DCI 포맷을 모니터링(Monitoring)할 수 있다. 대비책 DCI 포맷은 기지국과 단말 사이에서 미리 정의된 고정된 필드로 구성될 수 있고, 비대비책용 DCI 포맷은 설정 가능 한 필드를 포함할 수 있다. DCI는 채널코딩 및 변조 과정을 거쳐 물리 하향링크 제어 채널인 PDCCH(Physical Downlink Control Channel)을 통해 전송될 수 있다. DCI 메시지 페이로드(payload)에는 CRC(Cyclic Redundancy Check)가 부착되며 CRC는 단 말의 신원에 해당하는 RNTI(Radio Network Temporary Identifier)로 스크램블링(scrambling) 될 수 있다. DCI메시지의 목적, 예를 들어 단말-특정(UE-specific)의 데이터 전송, 전력 제어 명령 또는 랜덤 엑세스 응답 등에 따라 서로 다른 RNTI들이 사용될 수 있다. 즉, RNTI는 명시적으로 전송되지 않고 CRC 계산 과정에 포함되어 전 송될 수 있다. PDCCH 상으로 전송되는 DCI 메시지를 수신하면 단말은 할당 받은 RNTI를 사용하여 CRC를 확인하 여 CRC 확인 결과가 맞으면 단말은 해당 메시지가 단말에게 전송된 것임을 알 수 있다. 예를 들면, 시스템 정보(System Information, SI)에 대한 PDSCH를 스케줄링하는 DCI는 SI-RNTI로 스크램블링될 수 있다. RAR(Random Access Response) 메시지에 대한 PDSCH를 스케줄링하는 DCI는 RA-RNTI로 스크램블링 될 수 있다. 페이징(Paging) 메시지에 대한 PDSCH를 스케줄링하는 DCI는 P-RNTI로 스크램블링 될 수 있다. SFI(Slot Format Indicator)를 통지하는 DCI는 SFI-RNTI로 스크램블링 될 수 있다. TPC(Transmit Power Control)를 통지하는 DCI는 TPC-RNTI로 스크램블링 될 수 있다. 단말-특정의 PDSCH 또는 PUSCH를 스케줄링하는 DCI는 C-RNTI(Cell RNTI)로 스크램블링 될 수 있다. DCI 포맷 0_0은 PUSCH를 스케줄링하는 대비책 DCI로 사용될 수 있고, 이 때 CRC는 C-RNTI로 스크램블링될 수 있 다. C-RNTI로 CRC가 스크램블링 된 DCI 포맷 0_0은 예컨대 이하의 표 4의 정보들을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다. [표 4]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "DCI 포맷 0_1은 PUSCH를 스케줄링하는 비대비책 DCI로 사용될 수 있고, 이 때 CRC는 C-RNTI로 스크램블링될 수 있다. C-RNTI로 CRC가 스크램블링 된 DCI 포맷 0_1은 예컨대 이하의 표 5의 정보들을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다.[표 5]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "DCI 포맷 1_0은 PDSCH를 스케줄링하는 대비책 DCI로 사용될 수 있고, 이 때 CRC는 C-RNTI로 스크램블링될 수 있 다. C-RNTI로 CRC가 스크램블링 된 DCI 포맷 1_0은 예컨대 이하의 표 6의 정보들을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다. [표 6] DCI 포맷 1_1은 PDSCH를 스케줄링하는 비대비책 DCI로 사용될 수 있고, 이 때 CRC는 C-RNTI로 스크램블링될 수 있다. C-RNTI로 CRC가 스크램블링 된 DCI 포맷 1_1은 예컨대 이하의 표 7의 정보들을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다. [표 7]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "[PDCCH: CORESET, REG, CCE, Search Space] 5G 통신 시스템에서의 하향링크 제어 채널에 대하여 도면을 참조하여 보다 구체적으로 설명한다. 도 4는 본 개시의 실시예에 따른 무선 통신 시스템에서 하향링크 제어 채널의 제어 영역(Control Resource Set, CORESET) 설정의 일 예를 도시한 도면이다. 도 4는 주파수 축으로 단말의 대역폭부분(UE bandwidth part), 시간축으로 1 슬롯 내에 2개의 제어 영역들(제어 영역#1, 제어 영역#2)이 설정되어 있는 일 예를 도시한다. 제어 영역(401, 402)는 주파 수 축으로 전체 단말 대역폭부분 내에서 특정 주파수 자원에 설정될 수 있다. 시간 축으로는 하나 또 는 복수 개의 OFDM 심볼로 설정될 수 있고 이를 제어 영역 길이(Control Resource Set Duration)으로 정 의할 수 있다. 도 4의 도시된 예를 참조하면, 제어영역#1은 2 심볼의 제어 영역 길이로 설정되어 있고, 제 어 영역#2는 1 심볼의 제어 영역 길이로 설정되어 있다. 5G에서의 제어 영역은 기지국이 단말에게 상위 계층 시그널링(예컨대 시스템 정보(System Information), MIB(Master Information Block), RRC(Radio Resource Control) 시그널링)을 통해 설정할 수 있다. 단말에게 제 어영역을 설정한다는 것은 제어 영역 식별자(Identity), 제어 영역의 주파수 위치, 제어 영역의 심볼 길이 등의 정보를 제공하는 것을 의미한다. 예를 들면, 하기의 정보들을 포함할 수 있다.[표 8]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "표 8에서 tci-StatesPDCCH (간단히 TCI(Transmission Configuration Indication) state로 지칭) 설정 정보는, 대응되는 제어영역에서 전송되는 DMRS와 QCL(Quasi Co Located) 관계에 있는 하나 또는 복수 개의 SS(Synchronization Signal)/PBCH(Physical Broadcast Channel) 블록(Block) 인덱스 또는 CSI-RS(Channel State Information Reference Signal) 인덱스의 정보를 포함할 수 있다. 다만, 표 8은 예시에 불과한 것으로, 본 개시가 이에 제한되는 것은 아니다. 도 5a는 본 개시의 실시예에 따른 무선 통신 시스템에서 하향링크 제어 채널의 구조를 도시한 도면이다. 도 5a 에 따르면 제어 채널을 구성하는 시간 및 주파수 자원의 기본 단위를 REG(Resource Element Group)라 할 수 있으며, REG는 시간 축으로 1 OFDM 심볼, 주파수 축으로 1 PRB(Physical Resource Block), 즉, 12개 서브캐리어(Subcarrier)로 정의될 수 있다. 기지국은 REG를 연접하여 하향링크 제어채널 할당 단 위를 구성할 수 있다. 도 5a에 도시된 바와 같이 5G에서 하향링크 제어채널이 할당되는 기본 단위를 CCE(Control Channel Element)라고 할 경우, 1 CCE는 복수의 REG로 구성될 수 있다. 도 5a에 도시된 REG를 예 를 들어 설명하면, REG는 12개의 RE로 구성될 수 있고, 1 CCE가 6개의 REG로 구성된다면 1 CCE는 72개의 RE로 구성될 수 있다. 하향링크 제어 영역이 설정되면 해당 영역은 복수의 CCE로 구성 될 수 있으며, 특정 하향링크 제어 채널은 제어 영역 내의 집성 레벨(Aggregation Level, AL)에 따라 하나 또는 복수의 CCE로 매핑 되어 전송될 수 있다. 제어 영역내의 CCE들은 번호로 구분되며 이 때 CCE들 의 번호는 논리적인 매핑 방식에 따라 부여될 수 있다. 도 5a에 도시된 하향링크 제어 채널의 기본 단위, 즉 REG에는 DCI가 매핑되는 RE들과 이를 디코딩하기 위 한 기준 신호인 DMRS가 매핑되는 영역이 모두 포함될 수 있다. 도 5a에서와 같이 1 REG 내에 3개의 DMRS가 전송될 수 있다. PDCCH를 전송하는데 필요한 CCE의 개수는 집성 레벨(Aggregation Level, AL)에 따라 1, 2, 4, 8, 16개가 될 수 있으며, 서로 다른 CCE 개수는 하향링크 제어 채널의 링크 적응(link adaptation)을 구현하기 위해 사용될 수 있다. 예컨대 AL=L일 경우, 하나의 하향링크 제어 채널이 L개의 CCE를 통해 전송될 수 있다. 단말은 하향링크 제어 채널에 대한 정보를 모르는 상태에서 신호를 검출해야 하는데, 블 라인드 디코딩을 위해 CCE들의 집합을 나타내는 탐색 공간(search space)을 정의하였다. 탐색 공간은 주어진 집 성 레벨 상에서 단말이 디코딩을 시도해야 하는 CCE들로 이루어진 하향링크 제어 채널 후보군(Candidate)들의 집합이며, 1, 2, 4, 8, 16 개의 CCE로 하나의 묶음을 만드는 여러 가지 집성 레벨이 있으므로 단말은 복수개의 탐색 공간들을 가질 수 있다. 탐색 공간 세트(Set)는 설정된 모든 집성 레벨에서의 탐색 공간들의 집합으로 정의될 수 있다. 탐색 공간은 공통(Common) 탐색 공간과 단말-특정(UE-specific) 탐색 공간으로 분류될 수 있다. 일정 그룹의 단 말들 또는 모든 단말들이 시스템 정보에 대한 동적인 스케줄링이나 페이징 메시지와 같은 셀 공통의 제어 정보 를 수신하기 위해 PDCCH의 공통 탐색 공간을 조사할 수 있다. 예를 들어 셀의 사업자 정보 등을 포함하는 SIB의 전송을 위한 PDSCH 스케줄링 할당 정보는 PDCCH의 공통 탐색 공간을 조사하여 수신할 수 있다. 공통 탐색 공간 의 경우, 일정 그룹의 단말들 또는 모든 단말들이 PDCCH를 수신해야 하므로 기 약속된 CCE의 집합으로써 정의될 수 있다. 단말-특정적인 PDSCH 또는 PUSCH에 대한 스케쥴링 할당 정보는 PDCCH의 단말-특정 탐색 공간을 조사함 으로써 수신될 수 있다. 단말-특정 탐색 공간은 단말의 신원(Identity) 및 다양한 시스템 파라미터의 함수로 단 말-특정적으로 정의될 수 있다. 5G에서는 PDCCH에 대한 탐색 공간에 대한 파라미터는 상위 계층 시그널링(예컨대, SIB, MIB, RRC 시그널링)으로 기지국으로부터 단말에게 설정될 수 있다. 예를 들면, 기지국은 각 집성 레벨 L에서의 PDCCH 후보군 수, 탐색 공간에 대한 모니터링 주기, 탐색 공간에 대한 슬롯 내 심볼 단위의 모니터링 occasion, 탐색 공간 타입(공통 탐색 공간 또는 단말-특정 탐색 공간), 해당 탐색 공간에서 모니터링 하고자 하는 DCI 포맷과 RNTI의 조합, 탐 색 공간을 모니터링 하고자 하는 제어 영역 인덱스 등을 단말에게 설정할 수 있다. 예를 들면, 이하의 표 9와 같은 정보들을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다. [표 9]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "설정 정보에 따라 기지국은 단말에게 하나 또는 복수 개의 탐색 공간 세트를 설정할 수 있다. 일 실시예에 따르 면, 기지국은 단말에게 탐색 공간 세트 1과 탐색 공간 세트 2를 설정할 수 있고, 탐색 공간 세트 1에서 X- RNTI로 스크램블링된 DCI 포맷 A를 공통 탐색 공간에서 모니터링 하도록 설정할 수 있고, 탐색 공간 세트 2에서 Y-RNTI로 스크램블링된 DCI 포맷 B를 단말-특정 탐색 공간에서 모니터링 하도록 설정할 수 있다. 설정 정보에 따르면, 공통 탐색 공간 또는 단말-특정 탐색 공간에 하나 또는 복수 개의 탐색 공간 세트가 존재 할 수 있다. 예를 들어, 탐색 공간 세트#1과 탐색 공간 세트#2가 공통 탐색 공간으로 설정될 수 있고, 탐색 공 간 세트#3과 탐색 공간 세트#4가 단말-특정 탐색 공간으로 설정될 수 있다. 공통 탐색 공간에서는 하기의 DCI 포맷과 RNTI의 조합이 모니터링 될 수 있다. 물론 하기 예시에 제한되지 않는 다. - DCI format 0_0/1_0 with CRC scrambled by C-RNTI, CS-RNTI, SP-CSI-RNTI, RA-RNTI, TC-RNTI, P-RNTI, SI- RNTI- DCI format 2_0 with CRC scrambled by SFI-RNTI - DCI format 2_1 with CRC scrambled by INT-RNTI - DCI format 2_2 with CRC scrambled by TPC-PUSCH-RNTI, TPC-PUCCH-RNTI - DCI format 2_3 with CRC scrambled by TPC-SRS-RNTI 단말-특정 탐색 공간에서는 하기의 DCI 포맷과 RNTI의 조합이 모니터링 될 수 있다. 물론 하기 예시에 제한되지 않는다. - DCI format 0_0/1_0 with CRC scrambled by C-RNTI, CS-RNTI, TC-RNTI - DCI format 1_0/1_1 with CRC scrambled by C-RNTI, CS-RNTI, TC-RNTI 명시되어 있는 RNTI들은 하기의 정의 및 용도를 따를 수 있다. C-RNTI (Cell RNTI): 단말-특정 PDSCH 스케쥴링 용도 TC-RNTI (Temporary Cell RNTI): 단말-특정 PDSCH 스케쥴링 용도 CS-RNTI(Configured Scheduling RNTI): 준정적으로 설정된 단말-특정 PDSCH 스케쥴링 용도 RA-RNTI (Random Access RNTI): 랜덤 엑세스 단계에서 PDSCH 스케쥴링 용도 P-RNTI (Paging RNTI): 페이징이 전송되는 PDSCH 스케쥴링 용도 SI-RNTI (System Information RNTI): 시스템 정보가 전송되는 PDSCH 스케쥴링 용도 INT-RNTI (Interruption RNTI): PDSCH에 대한 pucturing 여부를 알려주기 위한 용도 TPC-PUSCH-RNTI (Transmit Power Control for PUSCH RNTI): PUSCH에 대한 전력 조절 명령 지시 용도 TPC-PUCCH-RNTI (Transmit Power Control for PUCCH RNTI): PUCCH에 대한 전력 조절 명령 지시 용도 TPC-SRS-RNTI (Transmit Power Control for SRS RNTI): SRS에 대한 전력 조절 명령 지시 용도 전술한 명시된 DCI 포맷들은 이하의 표 10의 정의를 따를 수 있다. [표 10]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "5G에서 제어영역 p, 탐색 공간 세트 s에서 집성 레벨 L의 탐색 공간은 이하의 수학식 2와 같이 표현될 수 있다. [수학식 2]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "- : 집성 레벨 - : 캐리어(Carrier) 인덱스 - : 제어영역 p 내에 존재하는 총 CCE 개수 - : 슬롯 인덱스 - : 집성 레벨 L의 PDCCH 후보군 수 - = 0, ..., -1: 집성 레벨 L의 PDCCH 후보군 인덱스 - = 0, ..., -1 - , , , , , - : 단말 식별자 값은 공통 탐색 공간의 경우 0에 해당할 수 있다. 값은 단말-특정 탐색 공간의 경우, 단말의 신원(C-RNTI 또는 기지국이 단말에게 설정해준 ID)과 시간 인 덱스에 따라 변하는 값에 해당할 수 있다. 5G에서는 복수 개의 탐색 공간 세트들이 서로 다른 파라미터들(예컨대, 표 9의 파라미터들)로 설정될 수 있음에 따라, 매 시점에서 단말이 모니터링하는 탐색 공간 세트의 집합이 달라질 수 있다. 예를 들면, 탐색 공간 세트 #1이 X-슬롯 주기로 설정되어 있고, 탐색 공간 세트#2가 Y-슬롯 주기로 설정되어 있고 X와 Y가 다를 경우, 단말 은 특정 슬롯에서는 탐색 공간 세트#1과 탐색 공간 세트#2를 모두 모니터링 할 수 있고, 특정 슬롯에서는 탐색 공간 세트#1과 탐색 공간 세트#2 중 하나를 모니터링 할 수 있다. [PDCCH: span] 단말은 슬롯 내에서 복수 개의 PDCCH 모니터링 위치를 가지는 경우에 대한 단말 능력 보고를 각 서브캐리어 간 격마다 수행할 수 있고, 이 때 Span이라는 개념을 사용할 수 있다. Span은 슬롯 내에서 단말이 PDCCH를 모니터 링할 수 있는 연속적인 심볼들을 의미하고, 각 PDCCH 모니터링 위치는 1개의 Span 내에 있다. Span은 (X,Y)로 표현할 수 있는데, 여기서 X는 연속적인 두 Span들의 첫 번째 심볼 간 떨어져야 하는 최소 심볼 개수를 의미하 고, Y는 1개의 Span 내에서 PDCCH를 모니터링할 수 있는 연속적인 심볼 개수를 의미할 수 있다. 이 때, 단말은 Span 내에서 Span의 첫 심볼부터 Y 심볼 내의 구간에서 PDCCH를 모니터링할 수 있다. 도 5b는 본 개시의 실시예에 따른 무선 통신 시스템에서 단말이 슬롯 내에서 복수 개의 PDCCH 모니터링 위치를 가질 수 있는 경우를 Span을 통해 도시한 도면이다. 예를 들어, 도 5b에서 도시한 바와 같이, Span은 (X,Y) = (7,3), (4,3), (2,2)가 가능하며, 세 경우 각각이 도 5b 내의 , , 로 표현되어 있다. 일례 로, 는 (7,4)로 표현할 수 있는 Span이 슬롯 내에서 2개가 존재하는 경우를 표현하였다. 2개의 Span들의 첫 번째 심볼 간의 간격이 X=7로 표현되었고, 각 Span의 첫 번째 심볼부터 총 Y=3개의 심볼 내에서 PDCCH 모니 터링 위치가 존재할 수 있으며, Y=3 심볼 내에 탐색 공간 1과 2가 각각 존재하는 것을 도시한다. 또 다른 일례 로, 에서는 (4,3)로 표현할 수 있는 Span이 슬롯 내에서 총 3개가 존재하는 경우를 표현하였으며, 두 번 째와 세 번째 Span 간 간격은 X=4보다 큰 X'=5 심볼만큼 떨어져 있는 것을 도시한다. [PDCCH: 단말 능력 보고] 상술한 공통 탐색 공간 및 단말-특정 탐색 공간이 위치하는 슬롯 위치는 표 11-1의 monitoringSymbolsWitninSlot 파라미터로 지시되며, 슬롯 내 심볼 위치는 표 9의 monitoringSymbolsWithinSlot 파라미터를 통해 비트맵으로 지시된다. 한편 단말이 탐색 공간 모니터링이 가능한 슬롯 내 심볼 위치는 다음의 단말 역량(능력)(UE capability)들을 통해 기지국으로 보고될 수 있다.- 단말 역량 1 (이후 FG 3-1와 혼용): 단말 역량 1은 다음의 표 11-1와 같이, 타입 1 및 타입 3 공통 탐색 공간 또는 단말-특정 탐색 공간에 대한 모니터링 위치(monitoring occasion, MO)가 슬롯 내 하나 존재하는 경우, 해 당 MO 위치가 슬롯 내 처음 3 심볼 내에 위치할 때 해당 MO를 모니터링 가능한 역량을 의미한다. 단말 역량 1은 NR을 지원하는 모든 단말이 지원해야 하는 의무적(mandatory) 역량으로써 단말 역량 1의 지원 여부는 기지국에 명시적으로 보고되지 않을 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다. [표 11-1]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "- 단말 역량 2 (이후 FG 3-2와 혼용): 단말 역량 2는 다음의 표 11-2와 같이, 공통 탐색 공간 또는 단말-특정 탐색 공간 대한 모니터링 위치(MO)가 슬롯 내 하나 존재하는 경우, 해당 MO의 시작 심볼 위치가 어디이던 관계 없이 모니터링 가능한 역량을 의미할 수 있다. 단말 역량 2는 단말이 선택적으로 지원 가능하며(optional), 단 말 역량 2의 지원 여부는 기지국에 명시적으로 보고될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다. [표 11-2]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "- 단말 역량 3(이후 FG 3-5, 3-5a, 3-5b와 혼용): 단말 역량 3은 다음의 표 11-3와 같이, 공통 탐색 공간 또는 단말-특정 탐색 공간에 대한 모니터링 위치(MO)가 슬롯 내 복수 개 존재하는 경우, 단말이 모니터링 가능한 MO 의 패턴을 지시할 수 있다. 상술한 패턴은 서로 다른 MO 간의 시작 심볼 간 간격 X, 및 한 MO에 대한 최대 심볼 길이 Y로 구성될 수 있다. 단말이 지원하는 (X,Y)의 조합은 {(2,2), (4,3), (7,3)} 중 하나 또는 복수 개일 수 있다. 단말 역량 3은 단말이 선택적으로 지원 가능하며(optional), 단말 역량 3의 지원 여부 및 상술한 (X,Y) 조합은 기지국에 명시적으로 보고될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다.[표 11-3]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "단말은 단말 역량 2 및/또는 단말 역량 3 지원 여부 및 관련 파라미터를 기지국에 보고할 수 있다. 기지국은 보 고 받은 상기 단말 역량을 토대로 공통 탐색 공간 및 단말-특정 탐색 공간에 대한 시간 축 자원 할당을 수행할 수 있다. 자원 할당 시 기지국은 단말이 모니터링 불가능한 위치에 MO를 위치시키지 않도록 할 수 있다. [PDCCH: BD/CCE limit] 복수 개의 탐색 공간 세트가 단말에게 설정되었을 경우, 단말이 모니터링해야 하는 탐색 공간 세트를 결정하는 방법에 있어서 하기의 조건들이 고려될 수 있다. 만약 단말이 상위 레이어 시그널링인 monitoringCapabilityConfig-r16의 값을 r15monitoringcapability로 설정 받았다면, 단말은 모니터링 할 수 있는 PDCCH 후보군의 수와 전체 탐색 공간(여기서 전체 탐색 공간이란 복수 개의 탐색 공간 세트의 union 영역에 해당하는 전체 CCE 집합을 의미)을 구성하는 CCE의 개수에 대한 최대값을 슬롯 별로 정의하며, 만약 monitoringCapabilityConfig-r16의 값이 r16monitoringcapability 로 설정 받았다면, 단말은 모니터링 할 수 있는 PDCCH 후보군의 수와 전체 탐색 공간(여기서 전체 탐색 공간이란 복수 개의 탐색공간 세트의 union 영역에 해당하는 전체 CCE 집합을 의미)을 구성하는 CCE의 개수에 대한 최대값을 Span 별로 정의할 수 있다. [조건 1: 최대 PDCCH 후보군 수 제한] 상위 레이어 시그널링의 설정 값에 따라, 단말이 모니터링 할 수 있는 PDCCH 후보군의 최대 개수인 Mμ는 서브캐 리어 간격 15·2μ kHz으로 설정된 셀에서 슬롯 기준으로 정의되는 경우 하기 표 12-1을 따르고, Span 기준으로 정의되는 경우 하기 표 12-2를 따를 수 있다. [표 12-1]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "[표 12-2]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "[조건 2: 최대 CCE 수 제한] 상위 레이어 시그널링의 설정 값에 따라, 전체 탐색공간(여기서 전체 탐색공간이란 복수 개의 탐색 공간 세트의 union 영역에 해당하는 전체 CCE 집합을 의미)을 구성하는 CCE의 최대 개수인 Cμ는 서브캐리어 간격 15·2μ kHz으로 설정된 셀에서 슬롯 기준으로 정의되는 경우 하기 표 12-3을 따르고, Span 기준으로 정의되는 경우 하 기 표 12-4를 따를 수 있다. [표 12-3] [표 12-4]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "설명의 편의를 위해, 특정 시점에서 조건 1, 2를 모두 만족시키는 상황을 \"조건 A\"로 정의하도록 한다. 따라서 조건 A를 만족시키지 않는 것은 조건 1, 2 중에서 적어도 하나의 조건을 만족시키지 않는 것을 의미할 수 있다. [PDCCH: Overbooking] 기지국의 탐색 공간 세트들의 설정에 따라 특정 시점에서 조건 A를 만족하지 않는 경우가 발생할 수 있다. 특정 시점에서 조건 A를 만족하지 않을 경우, 단말은 해당 시점에서 조건 A를 만족하도록 설정된 탐색 공간 세트들 중에서 일부만을 선택하여 모니터링 할 수 있고, 기지국은 선택된 탐색 공간 세트로 PDCCH를 전송할 수 있다. 전체 설정된 탐색 공간 세트 중에서 일부 탐색 공간을 선택하는 방법으로 하기의 방법을 따를 수 있다. 특정 시점(슬롯)에서 PDCCH에 대한 조건 A를 만족시키지 못할 경우, 단말은(또는 기지국은) 해당 시점에 존재하 는 탐색 공간 세트들 중에서 탐색 공간 타입이 공통 탐색 공간으로 설정되어 있는 탐색 공간 세트를 단말-특정 탐색 공간으로 설정된 탐색 공간 세트보다 우선적으로 선택할 수 있다. 공통 탐색 공간으로 설정되어 있는 탐색 공간 세트들이 모두 선택되었을 경우(즉, 공통 탐색 공간으로 설정되어 있는 모든 탐색 공간을 선택한 후에도 조건 A를 만족할 경우), 단말은(또는 기지국은) 단말-특정 탐색 공간으로 설정되어 있는 탐색 공간 세트들을 선택할 수 있다. 이 때, 단말-특정 탐색 공간으로 설정되어 있는 탐색 공간 세트가 복수 개일 경우, 탐색 공간 세트 인덱스(Index)가 낮은 탐색 공간 세트가 더 높은 우선 순위를 가질 수 있다. 우선 순위를 고려하여 단말-특정 탐색 공간 세트들을 조건 A가 만족되는 범위 내에서 선택할 수 있다. [QCL, TCI state] 무선 통신 시스템에서 하나 이상의 서로 다른 안테나 포트들(혹은 하나 이상의 채널, 시그널 및 이들의 조합들 로 대체되는 것도 가능하나 향후 본 개시의 설명에서는 편의를 위하여 서로 다른 안테나 포트들로 통일하여 지 칭한다)은 아래 [표 13]과 같은 QCL (Quasi co-location) 설정에 의하여 서로 연결(associate)될 수 있다. TCI state는 PDCCH(혹은 PDCCH DMRS)와 다른 RS 혹은 채널 간 QCL 관계를 공지하기 위한 것으로, 어떤 기준 안테나 포트 A(reference RS #A)와 또 다른 목적 안테나 포트 B(target RS #B)가 서로 QCL되어있다(QCLed)고 함은 단 말이 안테나 포트 A에서 추정된 large-scale 채널 파라미터 중 일부 혹은 전부를 안테나 포트 B로부터의 채널 측정에 적용하는 것이 허용됨을 의미할 수 있다. QCL은 1) average delay 및 delay spread에 영향을 받는 time tracking, 2) Doppler shift 및 Doppler spread에 영향을 받는 frequency tracking, 3) average gain에 영향을 받는 RRM(radio resource management), 4) spatial parameter에 영향을 받는 BM(beam management) 등 상황에 따라 서로 다른 파라미터를 연관시킬 필요가 있을 수 있다. 이에 따라 NR에서는 아래 표 13와 같은 네 가지 타 입의 QCL 관계들을 지원할 수 있다. [표 13]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "spatial RX parameter는 Angle of arrival(AoA), Power Angular Spectrum(PAS) of AoA, Angle of departure(AoD), PAS of AoD, transmit/receive channel correlation, transmit/receive beamforming, spatial channel correlation 등 다양한 파라미터들 중 일부 혹은 전부를 총칭할 수 있다. QCL 관계는 아래 표 14와 같이 RRC parameter TCI-State 및 QCL-Info를 통하여 단말에게 설정될 수 있다. 표 14를 참조하면 기지국은 단말에게 하나 이상의 TCI state를 설정하여 TCI state의 ID를 참조하는 RS(reference signal), 즉 target RS에 대한 최대 두 가지의 QCL 관계(qcl-Type1, qcl-Type2)를 알려줄 수 있다. 이 때 각 상기 TCI state가 포함하는 각 QCL 정보(QCL-Info)들은 해당 QCL 정보가 가리키는 reference RS의 serving cell index 및 BWP index, 그리고 reference RS의 종류 및 ID, 그리고 상기 표 13와 같은 QCL type을 포함할 수 있다. [표 14]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 20, "content": "도 7는 본 개시의 실시예에 따른 무선 통신 시스템에서 TCI state 설정에 따른 기지국 빔 할당의 일 예를 도시 하는 도면이다. 도 7을 참조하면 기지국은 서로 다른 N개의 빔에 대한 정보를 서로 다른 N개의 TCI state들을 통하여 단말에게 전달할 수 있다. 예를 들어 도 7과 같이 N=3인 경우 기지국은 세 개의 TCI states(700, 705, 710)에 포함되는 qcl-Type2 파라미터가 서로 다른 빔에 해당하는 CSI-RS 혹은 SSB에 연관되며 QCL type D로 설 정되도록 하여 서로 다른 TCI state(700, 705, 혹은 710)을 참조하는 안테나 포트들이 서로 다른 spatial Rx parameter 즉 서로 다른 빔과 연관되어 있음을 공지할 수 있다. 이하의 표 15-1 내지 15-5에서는 target 안테나 포트 종류에 따른 유효한 TCI state 설정들을 나타낸다. 표 15-1은 target 안테나 포트가 CSI-RS for tracking(TRS) 일 경우 유효한 TCI state 설정을 나타낸다. TRS는 CSI-RS 중 repetition 파라미터가 설정되지 않고 trs-Info가 true로 설정된 NZP CSI-RS를 의미한다. 표 15-1에 서 3번 설정의 경우 aperiodic TRS를 위하여 사용될 수 있다. 본 개시가 이에 제한되는 것은 아니다. [표 15-1] Target 안테나 포트가 CSI-RS for tracking (TRS) 일 경우 유효한 TCI state 설정"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "표 15-2는 target 안테나 포트가 CSI-RS for CSI 일 경우 유효한 TCI state 설정을 나타낸다. CSI-RS for CSI 는 CSI-RS 중 반복을 나타내는 파라미터 (예를 들어, repetition 파라미터)가 설정되지 않고 trs-Info 또한 true로 설정되지 않은 NZP CSI-RS를 의미할 수 있다. 본 개시가 이에 제한되는 것은 아니다. [표 15-2] Target 안테나 포트가 CSI-RS for CSI일 경우 유효한 TCI state 설정"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "표 15-3은 target 안테나 포트가 CSI-RS for beam management(BM)(CSI-RS for L1 RSRP reporting과 동일한 의 미)일 경우 유효한 TCI state 설정을 나타낸다. CSI-RS for BM은 CSI-RS 중 repetition 파라미터가 설정되어 On 또는 Off의 값을 가지며, trs-Info가 true로 설정되지 않은 NZP CSI-RS를 의미할 수 있다. 본 개시가 이에 제한되는 것은 아니다. [표 15-3] Target 안테나 포트가 CSI-RS for BM (for L1 RSRP reporting)일 경우 유효한 TCI state 설정"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "표 15-4는 target 안테나 포트가 PDCCH DMRS일 경우 유효한 TCI state 설정을 나타낸다. 본 개시가 이에 제한되 는 것은 아니다. [표 15-4] Target 안테나 포트가 PDCCH DMRS일 경우 유효한 TCI state 설정"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "표 15-5는 target 안테나 포트가 PDSCH DMRS일 경우 유효한 TCI state 설정을 나타낸다. 본 개시가 이에 제한되 는 것은 아니다. [표 15-5] Target 안테나 포트가 PDSCH DMRS일 경우 유효한 TCI state 설정"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "상술한 표 15-1 내지 15-5에 의한 대표적인 QCL 설정 방법은 각 단계 별 target 안테나 포트 및 reference 안테 나 포트를 \"SSB\" -> \"TRS\" -> \"CSI-RS for CSI, 또는 CSI-RS for BM, 또는 PDCCH DMRS, 또는 PDSCH DMRS\"와 같 이 설정하여 운용하는 것이다. 이를 통하여 SSB 및 TRS로부터 측정할 수 있는 통계적 특성들을 각 안테나 포트들까지 연계시켜 단말의 수신 동작을 돕는 것이 가능할 수 있다. [PDCCH: TCI state 관련] 구체적으로 PDCCH DMRS 안테나 포트에 적용 가능한 TCI state 조합은 아래 표 16과 같다. 표 16에서 4번째 행은 RRC 설정 이전에 단말이 가정하게 되는 조합이며 RRC 이후 설정은 불가능하다. [표 16]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 26, "content": "도 8은 본 개시의 실시예에 따른 무선 통신 시스템에서 PDCCH에 대한 TCI state 할당 방법의 일 예를 도시한 도 면이다. NR에서는 PDCCH 빔에 대한 동적 할당을 위하여 도 8에 도시된 바와 같은 계층적 시그널링(signaling) 방법을 지 원할 수 있다. 도 8을 참조하면 기지국은 RRC 시그널링을 통하여 N개의 TCI states(805, 810, ..., 820) 들을 단말에게 설정할 수 있으며, 이 중 일부를 CORESET을 위한 TCI state로 설정할 수 있다. 이후 기지국 은 CORESET을 위한 TCI states (830, 835, 840) 중 하나를 MAC CE 시그날링을 통하여 단말에게 지시할 수 있다 . 이후 단말은 MAC CE 시그날링에 의해 지시되는 TCI state가 포함하는 빔 정보를 기반으로 PDCCH를 수신 한다. 도 9는 본 개시의 실시예에 따른 무선 통신 시스템에서 PDCCH DMRS를 위한 TCI indication MAC CE 시그널링 (signaling) 구조를 도시하는 도면이다. 도 9를 참조하면 PDCCH DMRS를 위한 TCI indication MAC CE 시그널링 은 2 byte(16 bits)로 구성되며 5 비트의 serving cell ID, 4 비트의 CORESET ID 및 7 비트의 TCI state ID를 포함할 수 있다. 도 10은 본 개시의 실시예에 따른 무선 통신 시스템에서 제어 자원 세트 및 탐색 공간의 빔 설정 예시를 도시하 는 도면이다. 도 10을 참조하면 기지국은 CORESET 설정에 포함되는 TCI state list 중 하나를 MAC CE 시그널링을 통하 여 지시할 수 있다. 이후 또 다른 MAC CE 시그널링을 통하여 다른 TCI state가 해당 CORESET에 지시되기 전까지, 단말은 CORESET에 연결되는 하나 이상의 search space(1010, 1015, 1020)에는 모두 같은 QCL 정보 (beam #1)가 적용되는 것으로 간주할 수 있다. 상술한 PDCCH beam 할당 방법은 MAC CE 시그널링 delay보다 빠른 빔 변경을 지시하는 것이 어려우며, 또한 search space 특성에 관계없이 CORESET 별로 모두 같은 빔을 일괄 적 용하게 되는 단점이 있어 유연한 PDCCH beam 운용을 어렵게 하는 문제가 있을 수 있다. 이하 본 개시의 실시 예 들에서는 보다 유연한 PDCCH beam 설정 및 운용 방법을 제공한다. 이하 본 개시의 실시예를 설명함에 있어 설명 의 편의를 위하여 몇 가지 구분되는 예시들을 제공하나 이들은 서로 배타적인 것이 아니며 상황에 따라 서로 적 절히 결합하여 적용이 가능하다. 기지국은 단말에게 특정 제어 영역에 대하여 하나 또는 복수 개의 TCI state를 설정할 수 있고, 설정된 TCI state 중에서 하나를 MAC CE 활성화 명령을 통해 활성화할 수 있다. 예를 들어, 제어 영역#1에 TCI state로 {TCI state#0, TCI state#1, TCI state#2}가 설정되어 있고, 기지국은 MAC CE를 통해 제어 영역#1에 대한 TCI state로 TCI state#0을 가정하도록 활성화하는 명령을 단말에게 전송할 수 있다. 단말은 MAC CE로 수신한 TCI state에 대한 활성화 명령에 기반하여, 활성화된 TCI state 내의 QCL 정보에 기반하여 해당 제어 영역의 DMRS를 올바르게 수신할 수 있다. 인덱스가 0으로 설정된 제어 영역(제어 영역#0)에 대하여, 만약 단말이 제어영역#0의 TCI state에 대한 MAC CE 활성화 명령을 수신하지 못하였다면, 단말은 제어영역#0에서 전송되는 DMRS에 대하여 초기 접속 과정 또는 PDCCH 명령으로 트리거(Trigger)되지 않은 비경쟁(Non-contention/contention-free) 기반 랜덤 엑세스 과정에 서 식별된 SS/PBCH 블록과 QCL되었다고 가정할 수 있다. 인덱스가 0이 아닌 다른 값으로 설정된 제어 영역(제어 영역#X)에 대하여, 만약 단말이 제어 영역#X에 대한 TCI state를 설정 받지 못했거나, 하나 이상의 TCI state를 설정 받았지만 이 중 하나를 활성화하는 MAC CE 활성화 명령을 수신하지 못하였다면, 단말은 제어 영역#X에서 전송되는 DMRS에 대하여 초기 접속 과정에서 식별된 SS/PBCH 블록과 QCL되었다고 가정할 수 있다. [PDCCH: QCL prioritization rule 관련] 하기에서는 PDCCH에 대한 QCL 우선순위 결정 동작에 대해 구체적으로 설명한다. 단말은 단일 셀 혹은 밴드 내 carrier aggregation로 동작하고, 단일 혹은 복수 개의 셀 내의 활성화된 대역폭 부분 내에 존재하는 복수 개의 제어 자원 세트들이 특정 PDCCH 모니터링 구간에서 서로 같거나 다른 QCL-TypeD 특성을 가지면서 시간 상에서 겹치는 경우, 단말은 QCL 우선순위 결정 동작에 따라 특정 제어 자원 세트를 선택 하고, 해당 제어 자원 세트와 동일한 QCL-TypeD 특성을 가지는 제어 자원 세트들을 모니터링할 수 있다. 즉, 시 간 상에서 복수 개의 제어 자원 세트들이 겹칠 때, 오직 1개의 QCL-TypeD 특성만을 수신할 수 있다. 이 때 QCL 우선순위를 결정할 수 있는 기준은 아래와 같을 수 있다. - 기준 1. 공통 탐색 구간을 포함하는 셀 중 가장 낮은 인덱스에 대응되는 셀 내에서, 가장 낮은 인덱스의 공통 탐색 구간과 연결된 제어 자원 세트 - 기준 2. 단말 특정 탐색 구간을 포함하는 셀 중 가장 낮은 인덱스에 대응되는 셀 내에서, 가장 낮은 인덱스의 단말 특정 탐색 구간과 연결된 제어 자원 세트 상술한 바와 같이, 각 기준들은 해당 기준이 충족되지 않는 경우 다음 기준을 적용할 수 있다. 예를 들어 특정 PDCCH 모니터링 구간에서 제어 자원 세트들이 시간 상으로 겹치는 경우, 만약 모든 제어 자원 세트들이 공통 탐 색 구간에 연결되어 있지 않고 단말 특정 탐색 구간에 연결되어 있다면, 즉 기준 1이 충족되지 않는다면, 단말 은 기준 1 적용을 생략하고 기준 2를 적용할 수 있다. 단말은 상술한 기준들에 의해 제어 자원 세트를 선택하는 경우, 제어 자원 세트에 설정된 QCL 정보에 대해 다음 과 같이 두 가지 사항들을 추가적으로 고려할 수 있다. 첫 번째로, 만약 제어 자원 세트 1이 QCL-TypeD의 관계 를 가지는 기준 신호로서 CSI-RS 1을 가지고 있고, CSI-RS 1이 QCL-TypeD의 관계를 가지는 기준 신호는 SSB 1이 며, 또 다른 제어 자원 세트 2가 QCL-TypeD의 관계를 가지는 기준 신호가 SSB 1인 경우, 단말은 두 제어 자원 세트 1 및 2는 서로 다른 QCL-TypeD 특성을 가지는 것으로 고려할 수 있다. 두 번째로, 만약 제어 자원 세트 1 이 QCL-TypeD의 관계를 가지는 기준 신호로서 셀 1에 설정되어 있는 CSI-RS 1을 가지고 있고, CSI-RS 1이 QCL- TypeD의 관계를 가지는 기준 신호는 SSB 1이고, 제어 자원 세트 2가 QCL-TypeD의 관계를 가지는 기준 신호로서 셀 2에 설정되어 있는 CSI-RS 2를 가지고 있고, 이 CSI-RS 2가 QCL-TypeD의 관계를 가지는 기준 신호는 같은 SSB 1인 경우, 단말은 두 제어 자원 세트들이 같은 QCL-TypeD 특성을 가지는 것으로 고려할 수 있다. 도 12는 본 개시의 실시예에 따른 무선 통신 시스템에서 단말이 하향링크 제어 채널 수신 시 우선순위를 고려하 여 수신 가능한 제어 자원 세트를 선택하는 방법을 설명하기 위한 도면이다. 일례로, 단말은 특정 PDCCH 모니터 링 구간에서 시간 상에서 겹치는 복수 개의 제어 자원 세트들에 대한 수신을 설정받을 수 있고, 복수 개 의 제어 자원 세트들은 복수 개의 셀들에 대해 공통 탐색 공간 혹은 단말 특정 탐색 공간과 연결되어 있을 수 있다. 해당 PDCCH 모니터링 구간 내에서, 1번 셀의 1번 대역폭부분 내에는 1번 공통 탐색 구간과 연결된 1번 제어 자원 세트가 존재할 수 있고, 2번 셀의 1번 대역폭부분 내에는 1번 공통 탐색 구 간과 연결된 1번 제어 자원 세트와 2번 단말 특정 탐색 구간과 연결된 2번 제어 자원 세트가 존재 할 수 있다. 제어 자원 세트와 제어 자원 세트는 1번 셀의 1번 대역폭부분 내에 설정된 1번 CSI-RS resource와 QCL-TypeD의 관계를 가지고, 제어 자원 세트는 2번 셀의 1번 대역폭부분 내에 설정된 1번 CSI-RS resource와 QCL-TypeD의 관계를 가질 수 있다. 따라서 해당 PDCCH 모니터링 구간에 대해 기준 1 을 적용하면 1번 제어 자원 세트와 같은 QCL-TypeD의 기준 신호를 가지는 모든 다른 제어 자원 세트를 수 신할 수 있다. 따라서 단말은 해당 PDCCH 모니터링 구간에서 제어 자원 세트 및 제어 자원 세트 를 수신할 수 있다. 또 다른 일례로, 단말은 특정 PDCCH 모니터링 구간에서 시간 상에서 겹치는 복수 개의 제어 자원 세트에 대한 수신을 설정받을 수 있고, 복수 개의 제어 자원 세트들은 복수 개의 셀들에 대해 공통 탐색 공간 혹은 단 말 특정 탐색 공간과 연결되어 있을 수 있다. 해당 PDCCH 모니터링 구간 내에서, 1번 셀의 1번 대역폭부 분 내에는 1번 단말 특정 탐색 구간과 연결된 1번 제어 자원 세트와 2번 단말 특정 탐색 구간과 연 결된 2번 제어 자원 세트가 존재할 수 있고, 2번 셀의 1번 대역폭부분 내에는 1번 단말 특정 탐색구간과 연결된 1번 제어 자원 세트와 3번 단말 특정 탐색 구간과 연결된 2번 제어 자원 세트가 존 재할 수 있다. 제어 자원 세트와 제어 자원 세트는 1번 셀의 1번 대역폭부분 내에 설정된 1번 CSI- RS resource와 QCL-TypeD의 관계를 가지고, 제어 자원 세트는 2번 셀의 1번 대역폭부분 내에 설정된 1번 CSI-RS resource와 QCL-TypeD의 관계를 가지며, 제어 자원 세트는 2번 셀의 1번 대역폭부분 내에 설정된 2번 CSI-RS resource와 QCL-TypeD의 관계를 가질 수 있다. 그런데 해당 PDCCH 모니터링 구간에 대해 기 준 1을 적용하면 공통 탐색 구간이 없으므로 다음 기준인 기준 2를 적용할 수 있다. 해당 PDCCH 모니터링 구간 에 대해 기준 2를 적용하면 제어 자원 세트와 같은 QCL-TypeD의 기준신호를 가지는 모든 다른 제어 자원 세트를 수신할 수 있다. 따라서 단말은 해당 PDCCH 모니터링 구간에서 제어 자원 세트 및 제 어 자원 세트를 수신할 수 있다. [Rate matching/Puncturing 관련] 하기에서는 레이트 매칭(Rate Matching) 동작 및 펑쳐링(Puncturing) 동작에 대해 구체적으로 설명한다. 임의의 심볼 시퀀스 A를 전송하고자 하는 시간 및 주파수 자원 A가 임의의 시간 및 주파수 자원 B와 겹쳤을 경 우, 자원 A와 자원 B가 겹친 영역 자원 C를 고려한 채널 A의 송수신 동작으로 레이트 매칭 또는 펑쳐링 동작이 고려될 수 있다. 구체적인 동작은 하기의 내용을 따를 수 있다. 레이트 매칭 (Rate Matching) 동작 기지국은 단말로 심볼 시퀀스 A를 전송하고자하는 전체 자원 A 중에서 자원 B와 겹친 영역에 해당하는 자원 C를 제외한 나머지 자원 영역에 대해서만 채널 A를 매핑하여 전송할 수 있다. 예를 들어 심볼 시퀀스 A가 {심볼#1, 심볼#2, 심볼#3, 심볼4}로 구성되고, 자원 A가 {자원#1, 자원#2, 자원#3, 자원#4}이고, 자원 B가 {자원#3, 자원 #5}일 경우, 기지국은 자원 A중에서 자원 C에 해당하는 {자원#3}을 제외한 나머지 자원인 {자원#1, 자원#2, 자 원#4}에 심볼 시퀀스 A를 순차적으로 매핑하여 보낼 수 있다. 결과적으로 기지국은 심볼 시퀀스 {심볼#1, 심볼 #2, 심볼#3}을 각각 {자원#1, 자원#2, 자원#4}에 매핑하여 전송할 수 있다. 단말은 기지국으로부터 심볼 시퀀스 A에 대한 스케쥴링 정보로부터 자원 A 및 자원 B를 판단할 수 있고, 이를 통해 자원 A와 자원 B가 겹친 영역인 자원 C를 판단할 수 있다. 단말은 심볼 시퀀스 A가 전체 자원 A 중에서 자 원 C를 제외한 나머지 영역에서 매핑되어 전송되었다고 가정하고 심볼 시퀀스 A를 수신할 수 있다. 예를 들어 심볼 시퀀스 A가 {심볼#1, 심볼#2, 심볼#3, 심볼4}로 구성되고, 자원 A가 {자원#1, 자원#2, 자원#3, 자원#4}이 고, 자원 B가 {자원#3, 자원#5}일 경우, 단말은 자원 A중에서 자원 C에 해당하는 {자원#3}을 제외한 나머지 자 원인 {자원#1, 자원#2, 자원#4}에 심볼 시퀀스 A를 순차적으로 매핑되었다고 가정하고 수신할 수 있다. 결과적 으로 단말은 심볼 시퀀스 {심볼#1, 심볼#2, 심볼#3}이 각각 {자원#1, 자원#2, 자원#4}에 매핑되어 전송되었다고 가정하고 이후의 일련의 수신 동작을 수행할 수 있다. 펑쳐링 (Puncturing) 동작 기지국은 단말로 심볼 시퀀스 A를 전송하고자하는 전체 자원 A 중에서 자원 B와 겹친 영역에 해당하는 자원 C가 존재할 경우, 심볼 시퀀스 A를 자원 A 전체에 매핑하지만, 자원 C에 해당하는 자원 영역에서는 전송을 수행하지 않고, 자원 A 중에서 자원 C를 제외한 나머지 자원 영역에 대해서만 전송을 수행할 수 있다. 예를 들어 심볼 시 퀀스 A가 {심볼#1, 심볼#2, 심볼#3, 심볼4}로 구성되고, 자원 A가 {자원#1, 자원#2, 자원#3, 자원#4}이고, 자원 B가 {자원#3, 자원#5}일 경우, 기지국은 심볼 시퀀스 A {심볼#1, 심볼#2, 심볼#3, 심볼#4}를 자원 A {자원#1, 자원#2, 자원#3, 자원#4}에 각각 매핑할 수 있고, 자원 A중에서 자원 C에 해당하는 {자원#3}을 제외한 나머지 자원인 {자원#1, 자원#2, 자원#4}에 해당하는 심볼 시퀀스 {심볼#1, 심볼#2, 심볼#4}만 전송할 수 있고, 자원 C 에 해당하는 {자원#3}에 매핑된 {심볼#3}은 전송하지 않을 수 있다. 결과적으로 기지국은 심볼 시퀀스 {심볼#1, 심볼#2, 심볼#4}를 각각 {자원#1, 자원#2, 자원#4}에 매핑하여 전송할 수 있다. 단말은 기지국으로부터 심볼 시퀀스 A에 대한 스케쥴링 정보로부터 자원 A 및 자원 B를 판단할 수 있고, 이를 통해 자원 A와 자원 B가 겹친 영역인 자원 C를 판단할 수 있다. 단말은 심볼 시퀀스 A가 전체 자원 A에 매핑되 되 자원 영역 A 중에서 자원 C를 제외한 나머지 영역에서만 전송되었다고 가정하고 심볼 시퀀스 A를 수신할 수 있다. 예를 들어 심볼 시퀀스 A가 {심볼#1, 심볼#2, 심볼#3, 심볼4}로 구성되고, 자원 A가 {자원#1, 자원#2, 자 원#3, 자원#4}이고, 자원 B가 {자원#3, 자원#5}일 경우, 단말은 심볼 시퀀스 A {심볼#1, 심볼#2, 심볼#3, 심볼 #4}가 자원 A {자원#1, 자원#2, 자원#3, 자원#4}에 각각 매핑되지만, 자원 C에 해당하는 {자원#3}에 매핑된 {심 볼#3}은 전송되지 않는다고 가정할 수 있고, 자원 A중에서 자원 C에 해당하는 {자원#3}을 제외한 나머지 자원인 {자원#1, 자원#2, 자원#4}에 해당하는 심볼 시퀀스 {심볼#1, 심볼#2, 심볼#4}가 매핑되어 전송되었다고 가정하고 수신할 수 있다. 결과적으로 단말은 심볼 시퀀스 {심볼#1, 심볼#2, 심볼#4}이 각각 {자원#1, 자원#2, 자원 #4}에 매핑되어 전송되었다고 가정하고 이후의 일련의 수신 동작을 수행할 수 있다. 하기에서는 5G 통신 시스템의 레이트 매칭의 목적으로 레이트 매칭 자원에 대한 설정 방법을 기술하도록 한다. 레이트 매칭이란 신호를 전송할 수 있는 자원의 양을 고려하여 그 신호의 크기가 조절되는 것을 의미한다. 예컨 대 데이터 채널의 레이트 매칭이란 특정 시간 및 주파수 자원 영역에 대해서 데이터 채널을 매핑하여 전송하지 않고 이에 따라 데이터의 크기가 조절되는 것을 의미할 수 있다. 도 11은 본 개시의 실시예에 따른 무선 통신 시스템에서 기지국 및 단말이 하향링크 데이터 채널 및 레이트 매 칭 자원을 고려하여 데이터를 송수신하는 방법을 설명하기 위한 도면이다. 도 11에는 하향링크 데이터 채널(PDSCH)과 레이트 매칭 자원이 도시된다. 기지국은 단말에게 상위 계층 시그널링(예컨대 RRC 시그널링)을 통해 하나 또는 복수 개의 레이트 매칭 자원을 설정할 수 있다. 레이트 매칭 자원 설정 정보에는 시간축 자원 할당 정보, 주파수축 자원 할당 정보, 주기 정 보가 포함될 수 있다. 이하에서는, 주파수축 자원 할당 정보에 해당하는 비트맵을 \"제 1 비트맵\", 시간축 자원 할당 정보에 해당하는 비트맵을 \"제 2 비트맵\", 주기 정보에 해당하는 비트맵을 \"제 3 비트맵\"으로 지칭함을 가정한다. 스케쥴링된 데이터 채널의 시간 및 주파수 자원의 전체 또는 일부가 설 정된 레이트 매칭 자원과 겹칠 경우, 기지국은 레이트 매칭 자원 부분에서 데이터 채널을 레 이트 매칭하여 전송할 수 있고, 단말은 레이트 매칭 자원 부분에서 데이터 채널이 레이트 매칭되었 다고 가정한 후 수신 및 디코딩을 수행할 수 있다. 기지국은 추가적인 설정을 통해 상기 설정된 레이트 매칭 자원 부분에서 데이터채널을 레이트 매칭할지의 여부 를 DCI를 통해 동적(Dynamic)으로 단말에게 통지할 수 있다(전술한 DCI 포맷 내의 \"레이트 매칭 지시자\"에 해당 함). 구체적으로, 기지국은 설정된 레이트 매칭 자원들 중에서 일부를 선택하여 레이트 매칭 자원 그룹으로 그 룹화할 수 있고, 각 레이트 매칭 자원 그룹에 대한 데이터채널의 레이트 매칭 여부를 비트맵 방식을 이용하여 DCI로 단말에게 지시할 수 있다. 예컨대 4개의 레이트 매칭 자원, RMR#1, RMR#2, RMR#3, RMR#4가 설정되어 있을 경우, 기지국은 레이트 매칭 그룹으로 RMG#1={RMR#1, RMR#2}, RMG#2={RMR#3, RMR#4}을 설정할 수 있으며, DCI 필드 내의 2 비트를 이용하여, 각각 RMG#1과 RMG#2에서의 레이트 매칭 여부를 비트맵으로 단말에게 지시할 수 있다. 예컨대 레이트 매칭을 해야 될 경우에는 \"1\"로 레이트 매칭을 하지 않아야될 경우에는 \"0\"으로 지시할 수 있다. 5G에서는 전술한 레이트 매칭 자원을 단말에 설정하는 방법으로 \"RB 심볼 레벨\" 및 \"RE 레벨\"의 granularity를 지원한다. 보다 구체적으로는 하기의 설정 방법을 따를 수 있다. RB 심볼 레벨 단말은 대역폭부분 별로 최대 4개의 RateMatchPattern을 상위 계층 시그널링으로 설정 받을 수 있고, 하나의 RateMatchPattern은 하기의 내용을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니다. - 대역폭부분 내의 예비 자원(Reserved Resource)으로써, 주파수 축으로 RB 레벨의 비트맵과 심볼 레벨의 비트 맵으로 조합으로 해당 예비 자원의 시간 및 주파수 자원 영역이 설정된 자원이 포함될 수 있다. 예비 자원은 하 나 또는 두 개의 슬롯에 걸쳐질 수 있다(span될 수 있다). 각 RB 레벨 및 심볼 레벨 비트맵 pair로 구성된 시간 및 주파수 영역이 반복되는 시간 도메인 패턴(periodicityAndPattern)이 추가로 설정될 수 있다. - 대역폭부분 내의 제어 자원 세트로 설정된 시간 및 주파수 도메인 자원 영역과 해당 자원 영역이 반복되는 탐 색 공간 설정으로 설정된 시간 도메인 패턴에 해당하는 자원 영역이 포함될 수 있다. RE 레벨 단말은 하기의 내용을 상위 계층 시그널링을 통해 설정 받을 수 있다. 다만, 본 개시가 이에 제한되는 것은 아 니다. - LTE CRS(Cell-specific Reference Signal 또는 Common Reference Signal) 패턴에 해당하는 RE에 대한 설정 정보(lte-CRS-ToMatchAround)로써 LTE CRS의 포트 수(nrofCRS-Ports) 및 LTE-CRS-vshift(s) 값(v-shift), 기준 이 되는 주파수 지점(예를 들어 reference point A)에서부터 LTE 캐리어의 센터 부반송파(Subcarrier) 위치 정 보(carrierFreqDL), LTE 캐리어의 대역폭크기 (carrierBandwidthDL) 정보, MBSFN(Multicast-broadcast single- frequency network)에 해당하는 서브프레임 설정 정보 (mbsfn-SubframConfigList) 등을 포함할 수 있다. 단말은 전술한 정보들에 기반하여 LTE 서브프레임에 해당하는 NR 슬롯 내에서의 CRS의 위치를 판단할 수 있다. - 대역폭부분 내의 하나 또는 복수 개의 ZP(Zero Power) CSI-RS에 해당하는 자원 세트에 대한 설정 정보를 포함 할 수 있다. [LTE CRS rate match 관련] 다음으로 상술한 LTE CRS에 대한 rate match 과정에 대해 상세히 설명한다. LTE(Long Term Evolution)와 NR(New radio)의 공존을 위하여(LTE-NR Coexistence), NR에서는 NR 단말에게 LTE의 CRS(Cell Specific Reference Signal)의 패턴을 설정해 주는 기능을 제공한다. 구체적으로, CRS 패턴은 ServingCellConfig IE(Information Element) 혹은 ServingCellConfigCommon IE 내의 적어도 한 개의 파라미터를 포함한 RRC 시그 널링에 의해 제공될 수 있다. 파라미터의 예를 들면, lte-CRS-ToMatchAround, lte-CRS-PatternList1-r16, lte- CRS-PatternList2-r16, crs-RateMatch-PerCORESETPoolIndex-r16 등이 있을 수 있다. Rel-15 NR에서는 lte-CRS-ToMatchAround 파라미터를 통해 서빙셀 당 한 개의 CRS 패턴이 설정될 수 있는 기능 을 제공한다. Rel-16 NR에서는 서빙셀 당 복수의 CRS 패턴 설정이 가능하도록 상기 기능이 확장되었다. 구체적 으로, Single-TRP(transmission and reception point) 설정 단말에는 한 개의 LTE 캐리어(carrier) 당 한 개의 CRS 패턴이 설정될 수 있고, Multi-TRP 설정 단말에는 한 개의 LTE 캐리어 당 두 개의 CRS 패턴이 설정될 수 있 다. 예를 들어, Single-TRP 설정 단말에는 lte-CRS-PatternList1-r16 파라미터를 통하여 서빙셀당 최대 3개의 CRS 패턴을 설정할 수 있다. 또 다른 예를 들어, multi-TRP 설정 단말에는 TRP별로 CRS가 설정될 수 있다. 즉, TRP1에 대한 CRS 패턴은 lte-CRS-PatternList1-r16 파라미터를 통해 설정되고, TRP2에 대한 CRS 패턴은 lte-CRS-PatternList2-r16 파라미터를 통해 설정될 수 있다. 한편, 위와 같이 두 개의 TRP가 설정된 경우, 특정 PDSCH(Physical Downlink Shared Channel)에 TRP1 및 TRP2의 CRS 패턴을 모두 적용하는지, 혹은 한 개의 TRP에 대한 CRS 패턴만을 적용하는지 여부는 crs-RateMatch-PerCORESETPoolIndex-r16 파라미터를 통해 결정되는데, crs-RateMatch-PerCORESETPoolIndex-r16 파라미터가 enabled로 설정되면 한 개의 TRP의 CRS 패턴만을 적용하고, 그 외의 경우에는 두 TRP의 CRS 패턴을 모두 적용할 수 있다. 표 17은 CRS 패턴을 포함하는 ServingCellConfig IE를 나타낸 것이며, 표 18은 CRS 패턴에 대한 적어도 한 개 의 파라미터를 포함하는 RateMatchPatternLTE-CRS IE를 나타낸 것이다. [표 17]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "[표 18]"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 28, "content": "[단말 능력 보고 관련] LTE 및 NR에서 단말은 서빙 기지국에 연결된 상태에서 해당 기지국에게 단말이 지원하는 능력(capability)을 보 고하는 절차를 수행할 수 있다. 아래 설명에서 이를 단말 능력 보고(UE capability report)로 지칭한다. 기지국은 연결 상태의 단말에게 능력 보고를 요청하는 단말 능력 문의(UE capability enquiry) 메시지를 전달할 수 있다. 단말 능력 문의 메시지에는 기지국의 RAT(radio access technology) type 별 단말 능력 요청을 포함 할 수 있다. RAT type 별 요청에는 지원하는 주파수 밴드 조합 정보 등이 포함될 수 있다. 또한, 단말 능력 문 의 메시지의 경우 기지국이 전송하는 하나의 RRC 메시지 container를 통해 복수의 RAT type 별 UE capability 가 요청될 수 있으며, 또는 기지국은 각 RAT type 별 단말 능력 요청을 포함한 단말 능력 문의 메시지를 복수 번 포함시켜 단말에게 전달할 수 있다. 즉, 하나의 메시지 내에서 단말 능력 문의가 복수 회 반복되고 단말은 이에 해당하는 단말 능력 정보(UE capability information) 메시지를 구성하여 복수 회 보고할 수 있다. 차세대 이동 통신 시스템에서는 NR, LTE, EN-DC(E-UTRA - NR dual connectivity)를 비롯한 MR-DC(Multi-RAT dual connectivity)에 대한 단말 능력 요청을 할 수 있다. 또한, 단말 능력 문의 메시지는 일반적으로 단말이 기지국 과 연결된 이후, 초기에 전송될 수 있으나, 기지국이 필요할 때 어떤 조건에서도 요청할 수도 있다. 일 실시예에 따르면, 기지국으로부터 UE capability 보고 요청을 받은 단말은 기지국으로부터 요청받은 RAT type 및 밴드 정보에 따라 단말 capability를 구성할 수 있다. 아래에 NR 시스템에서 단말이 UE capability를구성하는 방법은 아래와 같다. 1. 만약 단말이 기지국으로부터 UE capability 요청으로 LTE 그리고/혹은 NR 밴드에 대한 리스트를 제공받으면, 단말은 EN-DC 와 NR stand alone(SA)에 대한 band combination(BC)를 구성한다. 즉, 기지국에 FreqBandList로 요청한 밴드들을 바탕으로 EN-DC와 NR SA에 대한 BC의 후보 리스트를 구성할 수 있다. 또한, 밴드의 우선순위는 FreqBandList에 기재된 순서대로 우선순위를 가질 수 있다. 2. 만약 기지국이 \"eutra-nr-only\" flag 혹은 \"eutra\" flag를 세팅하여 UE capability 보고를 요청한 경우, 단 말은 상기의 구성된 BC의 후보 리스트 중에서 NR SA BC들에 대한 것은 완전히 제거할 수 있다. 이러한 동작은 LTE 기지국(eNB)이 \"eutra\" capability를 요청하는 경우에만 일어날 수 있다. 3. 이후 단말은 상기 단계에서 구성된 BC의 후보 리스트에서 fallback BC들을 제거할 수 있다. 여기서 fallback BC는 임의의 BC에서 최소 하나의 SCell에 해당하는 밴드를 제거함으로써 얻을 수 있는 BC를 의미하며, 최소 하 나의 SCell에 해당하는 밴드를 제거하기 전의 BC가 이미 fallback BC를 커버할 수 있기 때문에 생략이 가능할 수 있다. 이 단계는 MR-DC에서도 적용되며, 즉 LTE 밴드들도 적용될 수 있다. 이 단계 이후에 남아있는 BC는 최 종 \"후보 BC 리스트\"일 수 있다. 4. 단말은 상기의 최종 \"후보 BC 리스트\"에서 요청받은 RAT type에 맞는 BC들을 선택하여 보고할 BC들을 선택한 다. 본 단계에서는 정해진 순서대로 단말이 supportedBandCombinationList를 구성할 수 있다. 즉, 단말은 미리 설정된 rat-Type의 순서에 맞춰서 보고할 BC 및 UE capability를 구성할 수 있다. (nr -> eutra-nr -> eutra). 또한 구성된 supportedBandCombinationList에 대한 featureSetCombination을 구성하고, fallback BC (같거나 낮은 단계의 capability를 포함하고 있는)에 대한 리스트가 제거된 후보 BC 리스트에서 \"후보 feature set combination\"의 리스트를 구성할 수 있다. \"후보 feature set combination\"은 NR 및 EUTRA-NR BC에 대한 feature set combination을 모두 포함하며, UE-NR-Capabilities와 UE-MRDC-Capabilities 컨테이너의 feature set combination으로부터 얻을 수 있다. 5. 또한, 만약 요청된 rat Type이 eutra-nr이고 영향을 준다면, featureSetCombinations은 UE-MRDC- Capabilities 와 UE-NR-Capabilities의 두 개의 컨테이너에 전부 포함될 수 있다. 하지만 NR의 feature set은 UE-NR-Capabilities만 포함될 수 있다. 단말 능력이 구성되고 난 이후, 단말은 단말 능력이 포함된 단말 능력 정보 메시지를 기지국에 전달할 수 있다. 기지국은 단말로부터 수신한 단말 능력을 기반으로 이후 해당 단말에게 적당한 스케줄링 및 송수신 관리를 수행 할 수 있다. [CA/DC 관련] 도 13은 본 개시의 실시예에 따른 무선 통신 시스템에서 single cell, carrier aggregation, dual connectivity 상황에서 기지국과 단말의 무선 프로토콜 구조를 도시하는 도면이다. 도 13을 참조하면, 차세대 이동통신 시스템의 무선 프로토콜은 단말과 NR 기지국에서 각각 NR SDAP(Service Data Adaptation Protocol)(1325, 1370), NR PDCP(Packet Data Convergence Protocol)(1330, 1365), NR RLC(Radio Link Control)(1335, 1360), NR MAC(Medium Access Control)(1340, 1355)을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 차세대 이동통신 시스템의 무선 프로토콜은 더 많거나 더 적은 수의 계 층들을 포함할 수 있다. NR SDAP(1325, 1370)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 사용자 데이터의 전달 기능(transfer of user plane data) - 상향 링크와 하향 링크에 대해서 QoS flow와 데이터 베어러의 맵핑 기능(mapping between a QoS flow and a DRB for both DL and UL) - 상향 링크와 하향 링크에 대해서 QoS flow ID의 마킹 기능(marking QoS flow ID in both DL and UL packets) - 상향 링크 SDAP PDU들에 대해서 reflective QoS flow를 데이터 베어러에 맵핑시키는 기능 (reflective QoS flow to DRB mapping for the UL SDAP PDUs). SDAP 계층 장치에 대해 단말은 RRC 메시지로 각 PDCP 계층 장치 별로 혹은 베어러 별로 혹은 로지컬 채널 별로 SDAP 계층 장치의 헤더를 사용할 지 여부 혹은 SDAP 계층 장치의 기능을 사용할 지 여부를 설정 받을 수 있다.또한, SDAP 헤더가 설정된 경우, SDAP 헤더의 NAS QoS 반영 설정 1비트 지시자(NAS reflective QoS)와 AS QoS 반영 설정 1비트 지시자(AS reflective QoS)를 통해 단말이 상향 링크와 하향 링크의 QoS flow와 데이터 베어러 에 대한 맵핑 정보를 갱신 혹은 재설정할 수 있도록 지시할 수 있다. SDAP 헤더는 QoS를 나타내는 QoS flow ID 정보를 포함할 수 있다. QoS 정보는 원할한 서비스를 지원하기 위한 데이터 처리 우선 순위, 스케쥴링 정보 등 으로 사용될 수 있다. NR PDCP(1330, 1365)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 헤더 압축 및 압축 해제 기능(Header compression and decompression: ROHC(robust header compression) only) - 사용자 데이터 전송 기능 (Transfer of user data) - 순차적 전달 기능(In-sequence delivery of upper layer PDUs) - 비순차적 전달 기능 (Out-of-sequence delivery of upper layer PDUs) - 순서 재정렬 기능(PDCP PDU reordering for reception) - 중복 탐지 기능(Duplicate detection of lower layer SDUs) - 재전송 기능(Retransmission of PDCP SDUs) - 암호화 및 복호화 기능(Ciphering and deciphering) - 타이머 기반 SDU 삭제 기능(Timer-based SDU discard in uplink.) NR PDCP 장치의 순서 재정렬 기능(reordering)은 하위 계층에서 수신한 PDCP PDU들을 PDCP SN(sequence number)을 기초로 순서대로 재정렬하는 기능을 말하며, 재정렬된 순서대로 데이터를 상위 계층에 전달하는 기능 을 포함할 수 있다. 또는, NR PDCP 장치의 순서 재정렬 기능(reordering)은 순서를 고려하지 않고, 바로 전달하 는 기능을 포함할 수 있으며, 순서를 재정렬하여 유실된 PDCP PDU들을 기록하는 기능을 포함할 수 있고, 유실된 PDCP PDU들에 대한 상태 보고를 송신 측에 하는 기능을 포함할 수 있으며, 유실된 PDCP PDU들에 대한 재전송을 요청하는 기능을 포함할 수 있다. NR RLC(1335, 1360)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 데이터 전송 기능(Transfer of upper layer PDUs) - 순차적 전달 기능(In-sequence delivery of upper layer PDUs) - 비순차적 전달 기능(Out-of-sequence delivery of upper layer PDUs) - ARQ 기능(Error Correction through ARQ) - 접합, 분할, 재조립 기능(Concatenation, segmentation and reassembly of RLC SDUs) - 재분할 기능(Re-segmentation of RLC data PDUs) - 순서 재정렬 기능(Reordering of RLC data PDUs) - 중복 탐지 기능(Duplicate detection) - 오류 탐지 기능(Protocol error detection) - RLC SDU 삭제 기능(RLC SDU discard) - RLC 재수립 기능(RLC re-establishment) NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은 하위 계층으로부터 수신한 RLC SDU들을 순서대로 상 위 계층에 전달하는 기능을 의미한다. NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은 원래 하나의 RLC SDU가 여러 개의 RLC SDU들로 분할되어 수신된 경우, 이를 재조립하여 전달하는 기능을 포함할 수 있으며, 수신한 RLC PDU들을 RLC SN(sequence number) 혹은 PDCP SN(sequence number)를 기준으로 재정렬하는 기능을 포함할 수 있고, 순서를 재정렬하여 유실된 RLC PDU들을 기록하는 기능을 포함할 수 있으며, 유실된 RLC PDU들 에 대한 상태 보고를 송신 측에 하는 기능을 포함할 수 있고, 유실된 RLC PDU들에 대한 재전송을 요청하는 기능 중 적어도 하나를 포함할 수 있다. NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은 유실된 RLC SDU가 있을 경우, 유실된 RLC SDU 이전까지의 RLC SDU들만을 순서대로 상위 계층에 전달하는 기능을 포함할 수 있 으며, 혹은 유실된 RLC SDU가 있어도 소정의 타이머가 만료되었다면 타이머가 시작되기 전에 수신된 모든 RLC SDU들을 순서대로 상위 계층에 전달하는 기능 중 적어도 하나를 포함할 수 있다. 또는, NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은 유실된 RLC SDU가 있어도 소정의 타이머가 만료되었다면 현재까지 수신된 모든 RLC SDU들을 순서대로 상위 계층에 전달하는 기능을 포함할 수도 있다. 또한 NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은 RLC PDU들을 수신하는 순서대로 (일련번호, Sequence number의 순서와 상관없이, 도착하는 순으로) 처리하여 PDCP 장치로 순서와 상관없이(Out-of sequence delivery) 전달할 수도 있으며, segment 인 경우에는 버퍼에 저장되어 있거나 추후에 수신될 segment 들을 수신하여 온전한 하나의 RLC PDU로 재구성한 후, 처리하여 PDCP 장치로 전달할 수 있다. NR RLC 계층은 접합(Concatenation) 기능을 포함하지 않을 수 있고 접합 기능을 NR MAC 계층에서 수행하거나 NR MAC 계층의 다중화(multiplexing) 기능으로 대체할 수 있다. NR RLC 장치의 비순차적 전달 기능(Out-of-sequence delivery)은 하위 계층으로부터 수신한 RLC SDU들을 순서 와 상관없이 바로 상위 계층으로 전달하는 기능을 말하며, 원래 하나의 RLC SDU가 여러 개의 RLC SDU들로 분할 되어 수신된 경우, 이를 재조립하여 전달하는 기능을 포함할 수 있으며, 수신한 RLC PDU들의 RLC SN 혹은 PDCP SN을 저장하고 순서를 정렬하여 유실된 RLC PDU들을 기록해두는 기능을 포함할 수 있다. NR MAC(1340, 1355)은 한 단말에 구성된 여러 NR RLC 계층 장치들과 연결될 수 있으며, NR MAC의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 맵핑 기능(Mapping between logical channels and transport channels) - 다중화 및 역다중화 기능(Multiplexing/demultiplexing of MAC SDUs) - 스케쥴링 정보 보고 기능(Scheduling information reporting) - HARQ 기능(Error correction through HARQ) - 로지컬 채널 간 우선 순위 조절 기능(Priority handling between logical channels of one UE) - 단말간 우선 순위 조절 기능(Priority handling between UEs by means of dynamic scheduling) - MBMS 서비스 확인 기능(MBMS service identification) - 전송 포맷 선택 기능(Transport format selection) - 패딩 기능(Padding) NR PHY 계층(1345, 1350)은 상위 계층 데이터를 채널 코딩 및 변조하고, OFDM 심벌로 만들어서 무선 채널로 전 송하거나, 무선 채널을 통해 수신한 OFDM 심벌을 복조하고 채널 디코딩해서 상위 계층으로 전달하는 동작을 수 행할 수 있다. 무선 프로토콜 구조는 캐리어 (혹은 셀) 운영 방식에 따라 세부 구조가 다양하게 변경될 수 있다. 일례로 기지 국이 단일 캐리어(혹은 셀)을 기반으로 단말에게 데이터를 전송하는 경우 기지국 및 단말은 단일 셀 LTE/NR과 같이 각 계층 별 단일 구조를 가지는 프로토콜 구조를 사용할 수 있다. 반면 기지국이 단일 TRP에서 다중 캐리어를 사용하는 CA(carrier aggregation)를 기반으로 단말에게 데이터를 전송하는 경우 기지국 및 단말은 캐리어 어그리게이션과 같이 RLC 까지는 단일 구조를 가지지만 MAC layer를 통하여 PHY layer를 multiplexing 하는 프로토콜 구조를 사용할 수 있다. 또 다른 예시로 기지국이 다중 TRP에서 다중 캐리어를 사용하는 DC(dual connectivity)를 기반으로 단말에게 데 이터를 전송하는 경우 기지국 및 단말은 듀얼 커넥티비티와 같이 RLC 까지는 단일 구조를 가지지만 MAC layer를 통하여 PHY layer를 multiplexing하는 프로토콜 구조를 사용할 수 있다. 상술한 PDCCH 및 빔 설정 관련 설명들을 참조하면, 현재 Rel-15 및 Rel-16 NR에서는 PDCCH 반복 전송이 지원되 지 않아 URLLC 등 고신뢰도가 필요한 시나리오에서 요구 신뢰도를 달성하기 어렵다. 본 개시에서는 다수 전송 지점(TRP)들을 통한 PDCCH 반복 전송 방법을 제공하여 단말의 PDCCH 수신 신뢰도를 향상시킨다. 구체적인 방법 은 이하에서 구체적으로 서술한다.이하 본 개시의 실시 예를 첨부한 도면과 함께 상세히 설명한다. 본 개시에서의 내용은 FDD 및 TDD 시스템에서 적용이 가능한 것이다. 이하 본 개시에서 상위 시그널링(또는 상위 레이어 시그널링)은 기지국에서 물리 계층의 하향링크 데이터 채널을 이용하여 단말로, 혹은 단말에서 물리 계층의 상향링크 데이터 채널을 이용하여 기지국 으로 전달되는 신호 전달 방법이며, RRC 시그널링, 혹은 PDCP 시그널링, 혹은 MAC(medium access control) 제 어 요소(MAC control element, MAC CE)라고 언급될 수도 있다. 이하 본 개시에서 단말은 협력 통신 적용 여부를 판단함에 있어 협력 통신이 적용되는 PDSCH를 할당하는 PDCCH (들)이 특정 포맷을 가지거나, 또는 협력 통신이 적용되는 PDSCH를 할당하는 PDCCH(들)이 협력 통신 적용 여부 를 알려주는 특정 지시자를 포함하거나, 또는 협력 통신이 적용되는 PDSCH를 할당하는 PDCCH(들)이 특정 RNTI로 스크램블링 되거나, 또는 상위 레이어로 지시되는 특정 구간에서 협력 통신 적용을 가정하거나 하는 등 다양한 방법들을 사용하는 것이 가능하다. 설명의 편의를 위하여 단말이 상기와 유사한 조건들을 기반으로 협력 통신이 적용된 PDSCH를 수신하는 것을 NC-JT case로 지칭될 수 있다. 이하 본 개시에서 A와 B 간 우선순위를 결정한다 함은 미리 정해진 우선순위 규칙(priority rule)에 따라 더 높 은 우선순위를 가지는 것을 선택하여 그에 해당하는 동작을 수행하거나 또는 더 낮은 우선순위를 가지는 것에 대한 동작을 생략(omit or drop)하는 등 다양하게 언급될 수 있다. 이하 본 개시에서는 복수의 실시예를 통하여 상기 예제들을 설명하나 이는 독립적인 것들이 아니며 하나 이상의 실시 예가 동시에 또는 복합적으로 적용되는 것이 가능할 수 있다. [NC-JT 관련] 본 개시의 일 실시예에 따르면, 단말이 복수의 TRP 들로부터 PDSCH를 수신하기 위해 비-코히런트 합동 전송(NC- JT, Non-Coherent Joint Transmission)이 사용될 수 있다. 5G 무선 통신 시스템은 기존과는 달리 높은 전송속도를 요구하는 서비스뿐만 아니라 매우 짧은 전송 지연을 갖 는 서비스 및 높은 연결 밀도를 요구하는 서비스를 모두 지원할 수 있다. 다수의 셀들, TRP(transmission and reception point)들, 또는 빔들을 포함하는 무선통신 네트워크에서 각 셀, TRP 또는/및 빔 간의 협력 통신 (coordinated transmission)은 단말이 수신하는 신호의 세기를 늘리거나 각 셀, TRP 또는/및 빔 간 간섭 제어를 효율적으로 수행하여 다양한 서비스 요구조건을 만족시킬 수 있다. 합동 전송(Joint Transmission, JT)은 상술한 협력 통신을 위한 대표적인 전송 기술로서 하나의 단말에게 복수 의 서로 다른 셀들, TRP들 또는/및 빔들을 통해 신호를 전송함으로써 단말이 수신하는 신호의 세기 또는 처리율 을 증가시키는 기술이다. 이 때 각 셀, TRP 또는/및 빔과 단말 간 채널은 그 특성이 크게 다를 수 있으며, 특히 각 셀, TRP 또는/및 빔 간 비-코히런트(Non-coherent) 프리코딩(precoding)을 지원하는 비-코히런트 합동 전송 (NC-JT, Non-Coherent Joint Transmission)의 경우 각 셀, TRP 또는/및 빔과 단말 간 링크 별 채널 특성에 따 라 개별적인 프리코딩, MCS, 자원 할당, TCI 지시 등이 필요할 수 있다. NC-JT 전송은 하향링크 데이터 채널(physical downlink shared channel, PDSCH), 하향링크 제어 채널(physical downlink control channel, PDCCH), 상향링크 데이터 채널(physical uplink shared channel, PUSCH), 상향링크 제어 채널(physical uplink control channel, PUCCH) 중 적어도 하나의 채널에 적용될 수 있다. PDSCH 전송 시 프리코딩, MCS, 자원 할당, TCI 등의 전송 정보는 DL DCI로 지시되며, NC-JT 전송을 위해서는 전송 정보가 셀, TRP 또는/및 빔 별로 독립적으로 지시될 수 있다. 이는 DL DCI 전송에 필요한 페이로드(payload)를 증가시키는 주요 요인이 되며, 이는 DCI를 전송하는 PDCCH의 수신 성능에 악영향을 미칠 수 있다. 따라서 PDSCH의 JT 지원 을 위하여 DCI 정보량과 제어 정보 수신 성능 간 트레이드 오프(tradeoff)를 주의 깊게 설계할 필요가 있다. 도 14a는 본 개시의 실시예에 따른 무선 통신 시스템에서 협력 통신(cooperative communication)을 위한 안테나 포트 구성 및 자원 할당 예시를 도시하는 도면이다. 도 14a를 참조하면, PDSCH 전송을 위한 예시가 합동 전송(JT)의 기법 별로 설명되며, TRP별로 무선자원을 할당 하기 위한 예제들이 도시된다. 도 14a를 참조하면, 각 셀, TRP 또는/및 빔 간 코히런트(Coherent) 프리코딩을 지원하는 코히런트 합동 전송 (Coherent Joint Transmission, C-JT)에 대한 예시가 도시된다. C-JT의 경우, TRP A 및 TRP B가 단일 데이터(PDSCH)를 단말에게 전송하며, 다수의 TRP들에 서 합동(joint) 프리코딩을 수행할 수 있다. 이는 TRP A 및 TRP B가 동일한 PDSCH을 전송하기 위 해 동일한 DMRS 포트들을 통해 DMRS가 전송되는 것을 의미할 수 있다. 예를 들어 TRP A 및 TRP B 각각은 DMRS port A 및 DMRS B를 통해 단말에게 DRMS를 전송할 수 있다. 이 경우에, 단말은 DMRS port A 및 DMRS B를 통해 전송되는 DMRS에 기초하여 복조되는 하나의 PDSCH를 수신하기 위한 하나의 DCI 정보를 수신할 수 있다. 도 14는 PDSCH 전송을 위해 각 셀, TRP 또는/및 빔 간 비-코히런트(Non-coherent) 프리코딩을 지원하는 비-코히 런트 합동 전송(Non-Coherent Joint Transmission, NC-JT)의 예시를 나타낸다. NC-JT의 경우 각 셀, TRP 또는/및 빔 별로 PDSCH를 단말에게 전송하며, 각 PDSCH에는 개별 프리코딩이 적 용될 수 있다. 각 셀, TRP 또는/및 빔이 각기 다른 PDSCH 또는 각기 다른 PDSCH 레이어를 단말에게 전송하여 단 일 셀, TRP 또는/및 빔 전송 대비 처리율을 향상시킬 수 있다. 또한, 각 셀, TRP 또는/및 빔이 동일 PDSCH를 단 말에게 반복 전송하여 단일 셀, TRP 또는/및 빔 전송 대비 신뢰도를 향상시킬 수 있다. 설명의 편의를 위해 셀, TRP 또는/및 빔을 이하 TRP로 지칭할 수 있다. PDSCH 전송을 위해 다수의 TRP들에서 사용하는 주파수 및 시간 자원이 모두 동일한 경우, 다수의 TRP들에 서 사용하는 주파수 및 시간 자원이 전혀 겹치지 않는 경우, 다수의 TRP들에서 사용하는 주파수 및 시간 자원의 일부가 겹치는 경우와 같이 다양한 무선 자원 할당이 고려될 수 있다. NC-JT 지원을 위하여, 하나의 단말에게 동시에 다수의 PDSCH들을 할당하기 위해서는 다양한 형태, 구조 및 관계 의 DCI들이 고려될 수 있다. 도 14b는 본 개시의 실시예에 따른 무선 통신 시스템에서 협력 통신을 위한 하향링크 제어 정보(downlink control information, DCI)의 구성에 대한 예를 도시하는 도면이다. 보다 구체적으로, 도 14b는 각 TRP가 서로 다른 PDSCH 또는 서로 다른 PDSCH 레이어를 단말에게 전송하는 NC-JT를 위한 하향링크 제어 정보(downlink control information, DCI)의 구성에 대한 예를 도시하는 도면이다. 도 14b를 참고하면, case #1은 단일 PDSCH 전송 시 사용되는 serving TRP (TRP#0) 이외에 (N-1)개의 추 가적인 TRP(TRP#1 내지 TRP#(N-1))로부터 서로 다른 (N-1)개의 PDSCH가 전송되는 상황에서, (N-1)개의 추가적 인 TRP들에서 전송되는 PDSCH들에 대한 제어 정보가 serving TRP에서 전송되는 PDSCH에 대한 제어 정보와 독립 적으로 전송되는 예시이다. 즉, 단말은 독립적인 DCI들(DCI#0 내지 DCI#(N-1))을 통하여 서로 다른 TRP들(TRP#0 내지 TRP#(N-1))로부터 전송되는 PDSCH들에 대한 제어 정보를 획득할 수 있다. 독립적인 DCI들 간 포맷(forma t)은 서로 동일하거나 서로 다를 수 있으며, DCI들 간 페이로드 역시 서로 동일하거나 다를 수 있다. 전술한 case #1은 각 PDSCH 제어 또는 할당 자유도가 완전히 보장될 수 있으나, 각 DCI가 서로 다른 TRP들에서 전송되 는 경우 DCI 별 커버리지(coverage) 차이가 발생하여 수신 성능이 열화될 수 있다. case #2은 단일 PDSCH 전송 시 사용되는 serving TRP (TRP#0) 이외에 (N-1)개의 추가적인 TRP들(TRP#1 내지 TRP#(N-1))로부터 서로 다른 (N-1)개의 PDSCH가 전송되는 상황에서, (N-1)개의 추가적인 TRP들의 PDSCH에 대한 제어 정보(DCI)가 각각 전송되며 이들 DCI들 각각이 serving TRP로부터 전송되는 PDSCH에 대한 제어 정보 에 종속적일 수 있다. 예를 들어, serving TRP(TRP#0)으로부터 전송되는 PDSCH에 대한 제어 정보인 DCI#0의 경우 DCI format 1_0, DCI format 1_1, DCI format 1_2의 모든 정보 요소(information element)들을 포함하지만, 협력 TRP들(TRP#1 내지 TRP#(N-1))으로부터 전송되는 PDSCH들에 대한 제어 정보인 shortened DCI(이하, sDCI)(sDCI#0 내지 sDCI#(N-2))들의 경우 DCI format 1_0, DCI format 1_1, DCI format 1_2의 정보 요소들 중 일부만을 포함할 수 있다. 따라서 협력 TRP들로부터 전송되는 PDSCH들에 대한 제어 정보를 전송하는 sDCI의 경우에, serving TRP로 부터 전송되는 PDSCH 관련 제어 정보를 전송하는 normal DCI (nDCI) 대비 페이로드(payload)가 작으므로 nDCI 와 비교하여 reserved bit들을 포함할 수 있다. case #2은 sDCI에 포함되는 정보 요소의 컨텐츠(content)에 따라 각 PDSCH 제어 또는 할당 자유도가 제한 될 수 있으나, sDCI의 수신 성능이 nDCI 대비 우수해지므로 DCI 별 커버리지(coverage) 차이가 발생할 확률이 낮아질 수 있다. case #3은 단일 PDSCH 전송 시 사용되는 serving TRP (TRP#0) 이외 (N-1)개의 추가적인 TRP들(TRP#1 내 지 TRP#(N-1))로부터 서로 다른 (N-1)개의 PDSCH가 전송되는 상황에서, (N-1)개의 추가적인 TRP들의 PDSCH에대한 하나의 제어 정보가 전송되며, 이 DCI가 serving TRP로부터 전송되는 PDSCH에 대한 제어 정보에 종속적일 수 있다. 예를 들어, serving TRP(TRP#0)로부터 전송되는 PDSCH에 대한 제어 정보인 DCI#0의 경우 DCI format 1_0, DCI format 1_1, DCI format 1_2의 모든 정보 요소(information element)들을 포함하고, 협력 TRP들(TRP#1~TRP#(N- 1))로부터 전송되는 PDSCH들에 대한 제어 정보의 경우 DCI format 1_0, DCI format 1_1, DCI format 1_2의 정 보 요소들 중 일부만을 하나의 'secondary' DCI(sDCI)에 모아서 전송하는 것이 가능하다. 예를 들어, 상기 sDCI 는 협력 TRP들의 주파수 영역 자원 할당(frequency domain resource assignment), 시간 영역 자원 할당(time domain resource assignment), MCS 등 HARQ 관련 정보 중 적어도 하나의 정보를 포함할 수 있다. 이외에, BWP(bandwidth part) 지시자(indicator) 또는 캐리어 지시자(carrier indicator) 등 sDCI 내 포함되지 않은 정 보의 경우 serving TRP의 DCI(DCI#0, normal DCI, nDCI)를 따를 수 있다. case #3은 sDCI에 포함되는 정보 요소의 컨텐츠(content)에 따라 각 PDSCH 제어 또는 할당 자유도가 제한 될 수 있으나, sDCI의 수신 성능 조절이 가능하고 case #1 또는 case #2와 비교하여 단말의 DCI 블라인드 디코딩(blind decoding)의 복잡도가 감소할 수 있다. case #4는 단일 PDSCH 전송 시 사용되는 serving TRP (TRP#0) 이외에 (N-1)개의 추가적인 TRP들 (TRP#1~TRP#(N-1))로부터 서로 다른 (N-1)개의 PDSCH가 전송되는 상황에서, (N-1)개의 추가적인 TRP들로부터 전송되는 PDSCH에 대한 제어 정보를 serving TRP로부터 전송되는 PDSCH에 대한 제어 정보와 동일한 DCI(Long DCI)에서 전송하는 예시이다. 즉, 단말은 단일 DCI를 통하여 서로 다른 TRP들(TRP#0~TRP#(N-1))로부터 전송되는 PDSCH들에 대한 제어 정보를 획득할 수 있다. case #4의 경우, 단말의 DCI 블라인드 디코딩(blind decoding)의 복잡도가 증가하지 않을 수 있으나, long DCI payload 제한에 따라 협력 TRP들의 수가 제한되는 등 PDSCH 제어 또는 할당 자유도가 낮을 수 있다. 이후의 설명 및 실시 예들에서 sDCI는 shortened DCI, secondary DCI, 또는 협력 TRP에서 전송되는 PDSCH 제어 정보를 포함하는 normal DCI(예, DCI format 1_0 내지 1_1) 등 다양한 보조 DCI들을 지칭할 수 있으며 특별한 제한이 명시되지 않은 경우 해당 설명은 다양한 보조 DCI들에 유사하게 적용이 가능할 수 있다. 이후의 설명 및 실시예들에서는 NC-JT 지원을 위하여 하나 이상의 DCI (PDCCH)가 사용되는 전술한 case #1, case #2, case #3의 경우를 multiple PDCCH 기반 NC-JT로 구분하고, NC-JT 지원을 위하 여 단일 DCI (PDCCH)가 사용되는 전술한 case #4의 경우를 single PDCCH 기반 NC-JT로 구분할 수 있다. Multiple PDCCH 기반의 PDSCH 전송에서는 serving TRP(TRP#0)의 DCI가 스케쥴링되는 CORESET과 협력 TRP들 (TRP#1 내지 TRP#(N-1))의 DCI가 스케쥴링되는 CORESET이 구분될 수 있다. CORESET들을 구분하기 위한 방법으 로, CORESET별 상위 레이어 지시자를 통해 구분하는 방법, CORESET별 빔 설정을 통해 구분하는 방법 등이 있을 수 있다. 또한, single PDCCH 기반 NC-JT에서는 단일 DCI가 복수 개의 PDSCH를 스케쥴링하는 대신, 복수 개의 레이어들을 갖는 단일 PDSCH를 스케쥴링하며, 상술한 복수 개의 레이어들은 다수의 TRP들로부터 전송될 수 있다. 이 때, 레이어와 해당 레이어를 전송하는 TRP 간의 연결 관계는 레이어에 대한 TCI(Transmission Configuration Indicator) indication을 통해 지시될 수 있다. 본 개시의 실시예들에서 \"협력 TRP\"는 실제 적용 시 \"협력 패널(panel)\" 또는 \"협력 빔(beam)\" 등 다양한 용어 로 대체될 수 있다. 본 개시의 실시예들에서 \"NC-JT가 적용되는 경우\"라 함은 \"단말이 하나의 BWP에서 동시에 하나 이상의 PDSCH를 수신하는 경우\", \"단말이 하나의 BWP에서 동시에 두 개 이상의 TCI(Transmission Configuration Indicator) indication을 기초로 PDSCH를 수신하는 경우\", \"단말이 수신한 PDSCH가 하나 이상의 DMRS 포트 그룹(port group)에 연관(association) 된 경우\" 등 상황에 맞게 다양하게 해석되는 것이 가능하나 설명의 편의상 한 가지 표현으로 사용하였다. 본 발명에서 NC-JT를 위한 무선 프로토콜 구조는 TRP 전개 시나리오에 따라 다양하게 사용될 수 있다. 일례로 협력 TRP 간 backhaul 지연이 없거나 작은 경우 도 13의 캐리어 어그리게이션과 유사하게 MAC layer multiplexing에 기초한 구조를 사용하는 방법(CA-like method)이 가능하다. 반면에, 협력 TRP들 간 backhaul 지연이 무시할 수 없을 만큼 큰 경우(예를 들어 협력 TRP들 간 CSI, scheduling, HARQ-ACK 등의 정보 교환에 2ms 이상의 시간이 필요한 경우) 도 13의 듀얼 커넥티비티와 유사하게 RLC layer 부터 TRP 별 독립적인 구조를 사용하여 지연에 강인한 특성을 확보하는 방법(DC-like method)이 가능하다. C-JT / NC-JT를 지원하는 단말은 상위 레이어 설정으로부터 C-JT / NC-JT 관련 파라미터 또는 세팅 값 등을 수 신하고, 이를 기초로 단말의 RRC 파라미터를 세팅할 수 있다. 상위 레이어 설정을 위해 단말은 UE capability 파라미터, 예를 들어 tci-StatePDSCH를 활용할 수 있다. 여기서 UE capability 파라미터, 예를 들어 tci- StatePDSCH는 PDSCH 전송을 목적으로 TCI states를 정의할 수 있으며, TCI states의 개수는 FR1에서 4, 8, 16, 32, 64, 128로, FR2에서는 64, 128로 설정될 수 있고, 설정된 개수 중에 MAC CE 메시지를 통해 DCI의 TCI 필드 3 bits로 지시될 수 있는 최대 8개의 상태가 설정될 수 있다. 최대값 128은 단말의 capability signaling에 포 함되어 있는 tci-StatePDSCH 파라미터 내 maxNumberConfiguredTCIstatesPerCC가 지시하는 값을 의미한다. 이와 같이, 상위 레이어 설정부터 MAC CE 설정까지 일련의 설정 과정은 1개의 TRP에서의 적어도 하나의 PDSCH를 위한 빔포밍 지시 또는 빔포밍 변경 명령에 적용될 수 있다. <제1 실시 예: 다중 TRP 기반 PDCCH 반복 전송 방법> 본 개시의 일 실시예로, 다중 TRP를 고려한 PDCCH 반복 전송 방법에 대해 설명한다. 다중 TRP를 고려한 PDCCH 반복 전송은 각 TRP에서 PDCCH를 전송할 때 적용할 각 TCI state를 PDCCH 전송에 사용되는 다양한 파라미터들에 어떻게 적용할 지에 따라 다양한 방법들이 존재할 수 있다. 예를 들어, 서로 다른 TCI state를 적용할 PDCCH 전 송에 사용되는 다양한 파라미터들에는 CCE, PDCCH 후보군, 제어 자원 세트, 탐색 공간 등을 포함할 수 있다. 다 중 TRP를 고려한 PDCCH 반복 전송 시, 단말의 수신 방식에는 소프트 컴바이닝(soft combining), 셀렉션 (selection) 방식 등이 고려될 수 있다. 다중 TRP를 통한 PDCCH 반복 전송에는 다음의 5가지 방법들이 존재할 수 있고, 기지국은 단말에게 5가지 방법들 중 적어도 하나에 대해 상위 계층 시그널링을 통해 설정하거나, L1 시그널링을 통해 지시하거나, 상위 계층 시 그널링과 L1 시그널링의 조합으로 설정 및 지시할 수 있다. [방법 1-1] 동일 페이로드를 갖는 복수 개의 PDCCH 반복 전송 방법 방법 1-1은 DCI 포맷 및 페이로드가 동일한 복수의 제어 정보들을 반복 전송하는 방법이다. 제어 정보들 각각에 는 반복 전송되는 PDSCH, 예컨대 복수의 슬롯들에 걸쳐 반복 전송되는 {PDSCH#1, PDSCH#2, ..., PDSCH#Y}를 스 케줄링하는 정보가 지시될 수 있다. 반복 전송되는 제어 정보들 각각의 페이로드가 동일하다는 것은, 제어 정보 각각의 PDSCH 스케줄링 정보, 예를 들어, PDSCH 반복 전송 횟수, 시간 축 PDSCH 자원 할당 정보, 즉 제어 정보 와 PDSCH#1 간의 슬롯 오프셋(K_0)과 PDSCH 심볼 수 등, 주파수 축 PDSCH 자원 할당 정보, DMRS 포트 할당 정 보, PDSCH-to-HARQ-ACK 타이밍, PUCCH resource 지시자 등이 모두 동일하다는 것을 의미할 수 있다. 단말은 동 일한 페이로드를 갖는 반복 전송 제어 정보들을 soft combine함으로써 제어 정보의 수신 신뢰도를 향상시킬 수 있다. soft combine을 위해, 단말은 반복 전송될 제어 정보의 자원 위치 및 반복 전송 수 등을 사전에 알 필요가 있다. 이를 위해 기지국은 반복 전송 제어 정보의 시간 축(time domain), 주파수 축(frequency domain), 공간 축(spatial domain) 자원 구성을 사전에 지시할 수 있다. 시간 축으로 제어 정보가 반복 전송되는 경우, 제어 정보가 서로 다른 CORESET에 걸쳐 반복 전송되거나, 하나의 CORESET 내에서 서로 다른 search space set에 걸쳐 반복 전송되거나, 하나의 CORESET 및 하나의 search space set 내 서로 다른 PDCCH monitoring occasion에 걸 쳐 반복 전송될 수 있다. 시간 축에서 반복 전송되는 자원의 단위(CORESET 단위, search space set 단위, PDCCH monitoring occasion 단위) 및 반복 전송 자원의 위치(PDCCH candidate index 등)는 기지국의 상위 계층 설정(예, RRC(radio resource control) 시그널링(signaling)) 등을 통해 지시될 수 있다. 이 때, PDCCH의 반복 전송 횟수 및/또는 반복 전송에 참여하는 TRP의 목록 및 전송 패턴은 명시적으로 지시될 수 있으며, 명시적 지 시 방법으로 상위 계층 지시 또는 MAC-CE/L1 시그널링 등이 사용될 수 있다. TRP의 목록은 TCI state 혹은 QCL assumption의 형태로 지시될 수 있다. 주파수 축으로 제어 정보가 반복 전송되는 경우, 제어 정보가 서로 다른 CORESET에 걸쳐 반복 전송되거나, 하나 의 CORESET 내에서 서로 다른 PDCCH candidate에 걸쳐 반복 전송되거나, CCE 별로 반복 전송될 수 있다. 주파수 축에서 반복 전송되는 자원의 단위 및 반복 전송 자원의 위치는 기지국의 상위 계층 설정 등을 통해 지시될 수 있다. 또한, 반복 전송 횟수 및/또는 반복 전송에 참여하는 TRP의 목록 및 전송 패턴은 명시적으로 지시될 수 있으며, 명시적 지시 방법으로 상위 레이어 지시 또는 MAC-CE/L1 시그널링 등이 사용될 수 있다. TRP의 목록은 TCI state 혹은 QCL assumption의 형태로 지시될 수 있다. 공간 축으로 제어 정보가 반복 전송되는 경우, 제어 정보가 서로 다른 CORESET에 걸쳐 반복 전송되거나, 하나의 CORESET에 복수의 TCI state들이 설정됨으로써 반복 전송될 수 있다. 본 개시의 일 실시예로, 기지국이 PDCCH를 반복하여 전송하는 방법을 설명한다. 무선 통신 시스템에서 PUSCH 또 는 PDSCH에 대한 스케줄링 정보를 포함하는 DCI는 PDCCH를 통해 기지국으로부터 단말에게 전송될 수 있다. 도 15는 본 개시의 실시예에 따른 반복 전송되는 PDCCH를 생성하는 과정을 도시한다. 단계에서, 기지국은 DCI를 생성할 수 있다. 기지국이 생성하는 DCI의 DCI payload에는 CRC가 부착 (attach)될 수 있다. 단계에서, 생성된 DCI는 채널 코딩(channel coding)을 거쳐 scrambling(단계) 및 modulation(단계 ) 과정을 거쳐서 PDCCH가 생성될 수 있다 (단계). 단계에서, 기지국은 생성된 PDCCH를 복수 개의 PDCCH로 복사하여 특정 자원을 이용하여(예를 들어 시간, 주파수, 전송 빔 등) 전송할 수 있다 (단계 ). 즉, 각 TRP에서 반복 전송되는 PDCCH를 위한 Coded bits는 모두 동일할 수 있다. 이와 같이 coded bits가 동일하기 위해서 PDCCH 내 각 DCI 필드를 위한 정보 값 또한 동일하게 설정될 수 있다. 예를 들어, DCI 정보가 포함하는 모든 필드(예, TDRA, FDRA, TCI, Antenna ports, … 등)는 같은 값을 갖도록 설정될 수 있다. 여기서 같은 값은 일반적으로는 하나의 의미로 해석될 수 있으나 특별한 설정에 의해 상기 같이 복수(예: 2개) 의 값들을 내포하거나 대응되는 경우 복수의 의미로 해석될 수 있다. 이와 관련된 상세 설명은 이하에서 설명한 다. 도 15에서 도시된 바에 따른 예를 들면, 만약 기지국이 PDCCH를 두 번 반복하여 전송하는 경우(예를 들어, m=2), 기지국은 PDCCH들을 각각 TRP A 와 TRP B에 하나씩 매핑함으로써 spatial domain 측면에서 동일한 빔 또 는 상이한 빔을 기반으로 PDCCH를 반복하여 전송할 수 있다. 이 때, 기지국은 상위 레이어 시그널링으로 서로 명시적으로 연결된 두 개의 탐색 공간들에 각각 연결된 CORESET들을 기반으로 PDCCH 반복 전송을 수행할 수 있 다. 기지국은 탐색 공간에 연결된 CORESET의 ID가 같거나, CORESET의 TCI state가 같은 경우에는 단일 TRP 기반 으로 PDCCH 반복 전송을 수행할 수 있다. 기지국은 탐색 공간에 연결된 CORESET의 ID가 모두 다르거나, CORESET 의 TCI state가 모두 다른 경우에는 다중 TRP를 기반으로 PDCCH 반복 전송을 수행할 수 있다. 만약 기지국이 PDCCH를 네 번 반복하여 전송하는 경우, 기지국은 PDCCH들을 각각 TRP A 와 TRP B에 두 개씩 매핑하고, 이때 각 TRP에 매핑된 두 개의 PDCCH들은 time domain에서 구분되어 전송될 수 있다. time domain에서 구분되는 PDCCH 반복 전송은, 슬롯 기반(slot based) 또는 서브 슬롯 기반(subslot based) 또는 미니 슬롯 기반(mini-slot based)의 시간 단위(unit)로 반복될 수 있다. 다만 상술한 방법은 예시에 불과하고 본 개시가 이에 한정되는 것은 아니다. 본 개시에서 단말 및 기지국은 상 술한 PDCCH repetition 동작을 위해 아래와 같은 방법을 고려할 수 있다. - 동일한 CORESET 내, 동일한 slot 내 time/frequency/spatial domain 측면에서 PDCCH repetition. - 동일한 CORESET 내, 다른 slot 간 time/frequency/spatial domain 측면에서 PDCCH repetition. - 다른 CORESET 간, 동일한 slot 내 time/frequency/spatial domain 측면에서 PDCCH repetition. - 다른 CORESET 간, 다른 slot 간 time/frequency/spatial domain 측면에서 PDCCH repetition. 또한, CORESETPoolindex가 설정되는 경우, CORESET에 추가적으로 CORESETPoolindex 별로 PDCCH repetition이 각각 고려될 수 있다. 또한 PDCCH 반복 횟수는 독립적으로 증가할 수 있고, 이에 따라 상술한 방법들이 동시에 조합하여 고려될 수 있다. 기지국은 PDCCH가 어떤 domain을 통해 반복 전송되는지에 대한 정보를 RRC 메시지를 통해 단말에 미리 설정할 수 있다. 예를 들어, time domain 측면에서의 PDCCH 반복 전송인 경우라면, 기지국은 슬롯 기반(slot based), 서브 슬롯 기반(subslot based), 또는 미니 슬롯 기반(mini-slot based)의 시간 단위 중 적어도 하나에 따라 반복되는지에 대한 정보를 단말에 미리 설정할 수 있다. frequency domain 측면에서의 PDCCH 반복 전송인 경우 라면, 기지국은 CORESET, bandwidth part(BWP), 또는 component carrier(CC) 중 적어도 하나에 기반하여 반복 되는지에 대한 정보를 단말에 미리 설정할 수 있다. spatial domain 측면에서의 PDCCH 반복 전송인 경우라면, 기지국은 QCL type 별 설정을 통해 PDCCH 반복 전송을 위한 빔과 관련된 정보를 단말에 미리 설정할 수 있다. 또는, 기지국은 나열한 정보들을 조합하여 RRC 메시지를 통해 단말에 전송할 수 있다. 따라서 기지국은 RRC 메 시지를 통해 미리 설정된 정보에 따라 PDCCH를 반복 전송할 수 있으며, 단말은 RRC 메시지를 통해 미리 설정된정보에 따라 PDCCH를 반복 수신할 수 있다. [방법 1-2] DCI 포맷 및/또는 페이로드가 다를 수 있는 복수의 제어 정보들을 반복 전송하는 방법 방법 1-2는 DCI 포맷 및/또는 페이로드가 다를 수 있는 다수의 제어 정보를 반복 전송하는 방법이다. 제어 정보 는 반복 전송 PDSCH를 스케줄링하기 위해 이용될 수 있고, 각 제어 정보가 지시하는 PDSCH 반복 전송 횟수는 서 로 다를 수 있다. 예를 들어, PDCCH#1은 {PDSCH#1, PDSCH#2, ..., PDSCH#Y}를 스케줄링하는 정보를 지시할 수 있다. 반면, PDCCH#2은 {PDSCH#2, ..., PDSCH#Y}를 스케줄링하는 정보를 지시할 수 있고, ... , PDCCH#X는 {PDSCH Y}를 스케줄링하는 정보를 지시할 수 있다. 이와 같은 방법 1-2는 방법 1-1 대비 제어 정보 및 PDSCH 반 복 전송에 필요한 총 지연 시간을 줄일 수 있는 장점이 있다. 반면 방법 1-2는 반복 전송되는 각 제어 정보의 페이로드가 서로 다를 수 있으므로, 반복 전송되는 제어 정보의 soft combine이 불가하여 방법 1-1 대비 신뢰도 가 낮을 수 있다. 방법 1-2에서는 단말이 반복 전송될 제어 정보의 자원 위치 및 반복 전송 수 등을 사전에 알 필요가 없을 수 있 으며, 단말은 반복 전송되는 제어 정보 각각을 독립적으로 디코딩하여 처리할 수 있다. 만일 단말이 동일 PDSCH 를 스케줄링하는 복수 개의 반복 전송 제어 정보들을 디코딩한 경우, 첫 번째 반복 전송 제어 정보만 처리하고 두 번째 이후의 반복 전송 제어 정보는 무시할 수 있다. 또는 반복 전송될 제어 정보의 자원 위치 및 반복 전송 수 등을 사전에 지시할 수 있으며, 지시 방법은 방법 1-1에 기술한 방법과 동일할 수 있다. [방법 1-3] DCI 포맷 및/또는 페이로드가 다를 수 있는 복수의 제어 정보들을 각각 반복 전송하는 방법 방법 1-3은 DCI 포맷 및/또는 페이로드가 다를 수 있는 복수의 제어 정보들을 각각 반복 전송하는 방법이다. 반 복 전송되는 각 제어 정보는 DCI 포맷 및 페이로드가 동일하다. 방법 1-2에서의 복수의 제어 정보는 soft combine이 불가하기 때문에 방법 1-1 대비 신뢰도가 낮을 수 있으며, 방법 1-1은 제어 정보 및 PDSCH 반복 전송 에 필요한 총 지연 시간이 길어질 수 있다. 방법 1-3은 방법 1-1과 방법 1-2의 장점을 이용한 방법으로 제어 정 보 및 PDSCH 반복 전송에 필요한 총 지연 시간을 방법 1-1 대비 줄이면서 방법 1-2 대비 높은 신뢰도로 제어 정 보를 전송할 수 있다. 방법 1-3에서는 반복 전송된 제어 정보를 디코딩하고 soft combine하기 위해 방법 1-1의 soft combine과 방법 1-2의 개별 디코딩을 이용할 수 있다. 예를 들어, 각각의 DCI 포맷 및/또는 페이로드가 다를 수 있는 복수의 제 어 정보들에 대한 반복 전송 중 첫 번째 전송된 제어 정보를 방법 1-2와 같이 디코딩할 수 있고, 디코딩된 제어 정보에 대한 반복 전송을 방법 1-1과 같이 soft combine할 수 있다. 한편, 기지국은 제어 정보 반복 전송을 위해 방법 1-1, 방법 1-2 혹은 방법 1-3 중 하나를 선택하여 구성할 수 있다. 제어 정보 반복 전송 방식은 상위 계층 시그널링을 통해 기지국이 단말로 명시적으로 지시할 수 있다. 혹 은 제어 정보 반복 전송 방식은 다른 설정 정보와 결합하여 지시될 수 있다. 예컨대, PDSCH 반복 전송 방식을 지시하는 상위 계층 설정이 제어 정보 반복 전송 지시와 결합될 수 있다. 예를 들어, PDSCH가 FDM(frequency division multiplexing) 방식으로 반복 전송되도록 지시된 경우, 제어 정보는 방법 1-1으로만 반복 전송된다고 해석될 수 있다. FDM 방식의 PDSCH 반복 전송에는 방법 1-2에 의한 지연 시간 감소 효과가 없기 때문이다. 또한, 유사한 이유로 PDSCH가 슬롯 내(intra-slot) TDM(time division multiplexing) 방식으로 반복 전송되도 록 지시된 경우, 제어 정보는 방법 1-1으로 반복 전송된다고 해석될 수 있다. 반면 PDSCH가 다수 슬롯 간 (inter-slot) TDM 방식으로 반복 전송되도록 지시된 경우, 제어 정보 반복 전송을 위한 방법 1-1, 방법 1-2 또 는 방법 1-3이 상위 계층 시그널링 혹은 L1 시그널링 통해 선택될 수 있다. 상위 계층 등의 설정을 통해 기지국이 단말에게 제어 정보 반복 전송 단위를 명시적으로 지시할 수 있다. 혹은 제어 정보 반복 전송 단위는 다른 설정 정보와 결합하여 지시될 수 있다. 예컨대, PDSCH 반복 전송 방식을 지시 하는 상위 계층 설정이 제어 정보 반복 전송 단위와 결합될 수 있다. PDSCH가 FDM 방식으로 반복 전송되도록 지 시된 경우, 제어 정보는 FDM 혹은 SDM(spatial division multiplexing)으로 반복 전송된다고 해석될 수 있다. 복수 슬롯 간(inter-slot) TDM 방식 등과 같이 제어 정보를 반복 전송한다면 FDM 방식의 PDSCH 반복 전송으로 인한 지연 시간 감소 효과가 없기 때문이다. 유사한 이유로 PDSCH가 슬롯 내(intra-slot) TDM 방식으로 반복 전 송되도록 지시된 경우, 제어 정보는 슬롯 내 TDM, FDM 또는 SDM으로 반복 전송된다고 해석될 수 있다. 반면 PDSCH가 복수 슬롯 간 TDM 방식으로 반복 전송되도록 지시된 경우, 복수 슬롯 간 TDM, 슬롯 내 TDM, FDM 또는SDM으로 제어 정보가 반복 전송될 수 있도록 상위 계층 시그널링 등으로 선택될 수 있다. [방법 1-4] 같은 PDCCH 후보군 내의 서로 다른 CCE에 대해 각 TCI state를 적용하는 PDCCH 전송 방식 방법 1-4는 PDCCH 반복 전송 없이 PDCCH의 수신 성능 향상을 위해 PDCCH 후보군 내의 서로 다른 CCE(control channel element)에 다중 TRP로부터의 전송을 의미하는 서로 다른 TCI state를 적용하여 전송할 수 있다. 방법 1-4는 PDCCH의 반복 전송은 아니지만, PDCCH 후보군 내에 서로 다른 CCE를 각 TRP에서 서로 다른 TCI state를 적용하여 전송하므로, PDCCH 후보군 내에서 공간 다이버시티를 획득하는 방식이 될 수 있다. 서로 다른 TCI state가 적용되는 서로 다른 CCE는 시간 혹은 주파수 차원으로 분리될 수 있고, 단말이 서로 다른 TCI state를 적용하는 자원 위치를 사전에 알 필요가 있다. 단말은 동일한 PDCCH 후보군 내에서 서로 다른 TCI state가 적용 된 서로 다른 CCE들을 수신하여 독립적으로 디코딩하거나 한 번에 디코딩할 수 있다. [방법 1-5] 같은 PDCCH 후보군 내의 모든 CCE에 대해 복수 개의 TCI state들을 적용하는 PDCCH 전송 방식 (SFN 방식) 방법 1-5는 PDCCH 반복 전송 없이 PDCCH 수신 성능 향상을 위해 PDCCH 후보군 내의 모든 CCE에 대해 복수 개의 TCI state들을 적용하여 SFN(single frequency network) 방식으로 전송할 수 있다. 방법 1-5는 PDCCH 반복 전 송은 아니지만 PDCCH 후보군 내에 같은 CCE 위치에서 SFN 전송을 통해 공간 다이버시티를 획득하는 방식이 될 수 있다. 단말은 동일한 PDCCH 후보군 내에서 서로 다른 TCI state가 적용된 같은 위치의 CCE들을 수신하여 복 수 개의 TCI state들 중 일부 혹은 전부를 사용하여 독립적으로 디코딩하거나 한 번에 디코딩할 수 있다. <제2 실시 예: PDCCH 반복 전송 시 소프트 컴바이닝(soft combining) 관련 단말 역량(UE capability) 보고> 단말은 기지국에게 PDCCH 반복 전송 시 소프트 컴바이닝 관련 단말 역량을 보고할 수 있다. 단말 역량을 보고하 는 대해서는 몇 가지 방법이 존재할 수 있다. 구체적인 방법들은 하기와 같을 수 있다. [단말 역량 보고 방법 1] 단말은 기지국에게 PDCCH 반복 전송 시 소프트 컴바이닝 가능 여부에 대해서만 가능 혹은 불가능의 형태로 단말 역량으로 보고할 수 있다. 예를 들어, 만약 단말이 기지국에게 PDCCH 반복 전송 시 소프트 컴바이닝이 가능하다는 정보를 단말 역량으로 보고했다면, 기지국은 단말의 소프트 컴바이닝 가능 여부를 가장 유연한 정도로 판단하여(예, 단말이 LLR 레벨 에서 소프트 컴바이닝이 가능한 것으로 판단), 단말에게 PDCCH 전송 관련 설정 시 PDCCH 반복 전송 관련 설정을 최대한 유연하게 통지할 수 있다. 이 때, PDCCH 반복 설정 관련한 예시로서, 기지국은 단말이 서로 다른 설정을 가지는 제어 자원 세트 혹은 탐색 공간 사이의 소프트 컴바이닝, 서로 같은 집성 레벨(aggregation level) 내에 서의 PDCCH 후보들 사이의 소프트 컴바이닝, 혹은 서로 다른 집성 레벨 간 PDCCH 후보들 사이의 소프트 컴바이 닝이 가능함을 가정하고 해당 설정을 단말에게 통지할 수 있다. 다른 예를 들어, 만약 단말이 기지국에게 PDCCH 반복 전송 시 소프트 컴바이닝이 가능하다는 정보를 단말 역량 으로 보고했다면, 기지국은 단말이 가능한 소프트 컴바이닝의 레벨을 가장 보수적으로 판단하여(예, 단말이 OFDM 심볼 레벨에서 소프트 컴바이닝이 가능한 것으로 판단), 단말에게 PDCCH 전송 관련 설정 시 PDCCH 반복 전 송 관련 설정을 가장 제한적으로 통지할 수 있다. 이 때, PDCCH 반복 설정 관련한 예시로서, 기지국은 단말이 서로 같은 설정을 가지는 복수 개의 제어 자원 세트들 간 소프트 컴바이닝 혹은 서로 같은 집성 레벨 간 PDCCH 후보들 사이의 소프트 컴바이닝이 가능함을 가정하고 해당 설정을 단말에게 통지할 수 있다. [단말 역량 보고 방법 2] 단말 역량 보고 방법 1에 비해 단말에서 가능한 소프트 컴바이닝의 동작을 단말 역량 으로서 더 자세하게 표현하기 위해, 단말은 기지국에게 PDCCH 반복 전송 시 소프트 컴바이닝의 가능 정도에 대 해 레벨을 나눠서 단말 역량으로 보고할 수 있다. 즉, 단말의 수신 동작 과정들로부터 발생되는 각각의 신호 레 벨 중 단말이 PDCCH 반복 전송에 대해 소프트 컴바이닝을 적용할 수 있는 신호 레벨을 확인하고, 단말은 PDCCH 반복 전송에 대해 소프트 컴바이닝을 적용할 수 있는 신호 레벨과 관련된 정보를 단말 역량으로서 기지국에 보고할 수 있다. 예를 들어, 단말은 소프트 컴바이닝을 적용할 수 있는 신호 레벨로서 OFDM 심볼 레벨에서 소프트 컴바이닝이 가능함을 알려줄 수 있고, 변조 심볼 레벨에서 소프트 컴바이닝이 가능함을 알려줄 수 있고, LLR 레 벨에서 소프트 컴바이닝이 가능함을 알려줄 수 있다. 단말이 보고한 각 신호 레벨에 따라서, 기지국은 보고받은 단말 역량에 따라 단말이 소프트 컴바이닝을 수행할 수 있도록 적절한 설정을 통지할 수 있다. [단말 역량 보고 방법 3] 단말은 기지국에게 PDCCH 반복 전송 시 단말 측에서 소프트 컴바이닝이 가능하기 위해 필요한 제약 사항에 대해 단말 역량을 통해 전달할 수 있다. 예를 들어, 단말은 반복되는 PDCCH가 포함되는 각 각의 제어 자원 세트의 설정이 같아야 함을 기지국으로 보고할 수 있다. 다른 예를 들어, 단말은 반복되는 PDCCH 후보들이 적어도 집성 레벨은 같아야 함을 기지국으로 보고할 수 있다. [단말 역량 보고 방법 4] 단말은 기지국으로부터 PDCCH 반복 전송을 수신하는 경우 어떤 PDCCH 반복 전송 방식 을 지원하는 지에 대해 단말 역량을 통해 보고할 수 있다. 예를 들어, 단말은 방법 1-5(SFN 전송 방식)를 지원 함에 대해 기지국에게 보고할 수 있다. 다른 예를 들어, 단말은 방법 1-1(동일 페이로드를 갖는 복수 개의 PDCCH 반복 전송 방법) 중 슬롯 내 TDM, 슬롯 간 TDM 혹은 FDM 방식을 지원함에 대해 기지국에게 보고할 수 있 다. 특히 TDM의 경우, 단말은 반복되는 PDCCH 간의 시간 간격의 최대값을 기지국에 보고할 수 있다. 일례로, 만 약 단말이 반복되는 PDCCH 간의 시간 간격의 최대값을 4 OFDM 심볼임을 기지국에게 보고할 수 있다. 이 경우, 기지국은 해당 정보를 기반으로 단말에게 TDM 기반 PDCCH 반복 전송을 수행하는 경우 반복되는 PDCCH 간의 시간 간격을 4 OFDM 심볼 이하로 조절할 수 있다. [단말 역량 보고 방법 5] 단말은 기지국으로부터 PDCCH 반복 전송을 수신하는 경우 소모하는 블라인드 디코딩 횟수를 단말 역량을 통해 기지국에게 보고할 수 있다. 일례로, 단말은 PDCCH 반복 전송 수신 시 소모하는 블라 인드 디코딩 횟수를 단말의 수신 방법(예를 들어, 개별 디코딩, 소프트 컴바이닝, 혹은 다른 수신 방식들, 또한 이들의 조합)에 무관하게 1, 2 또는 3으로 기지국에게 보고할 수 있다. 기지국은 단말이 PDCCH 반복 전송을 수 신하는 경우 보고된 블라인드 디코딩 횟수만큼을 소모한다고 가정하고, 슬롯 혹은 span 내에서 단말이 최대로 사용할 수 있는 블라인드 디코딩 횟수를 넘지 않도록 탐색 공간 및 제어 자원 세트에 관한 설정을 단말에게 전 달할 수 있다. 단말 역량 보고 방법들은 실제 적용 시 2개 이상의 단말 역량 보고 방법들에 대한 조합으로 구성되는 것이 가능 하다. 일례로, 단말은 [단말 역량 보고 방법 2]에 의해 LLR 레벨에서 소프트 컴바이닝이 가능함을 보고하는 동 시에, [단말 역량 보고 방법 3]에 의해 반복되는 PDCCH 후보들이 적어도 집성 레벨은 같아야 함을 보고하며, [단말 역량 보고 방법 4]에 의해 TDM되는 PDCCH 반복 전송을 지원하되, 반복되는 두 PDCCH 간의 시간 간격의 최 대값을 4 OFDM 심볼임을 기지국에게 보고할 수 있다. 이외에 다양한 단말 역량 보고 방법들의 조합에 기반한 응 용들이 가능하나 상세 설명은 생략한다. <제3 실시 예: PDCCH 반복 전송 및 명시적 연결성 관련 설정 방법> 본 개시의 일 실시예로, PDCCH 반복 전송 시 소프트 컴바이닝이 가능하기 위한 PDCCH 반복 전송 설정 방법에 대 해 설명한다. 기지국은 다양한 PDCCH 반복 전송 방법들에 대해 중 방법 1-1(동일 페이로드를 갖는 복수 개의 PDCCH 반복 전송 방법)에 기반하여 단말에게 PDCCH 반복 전송을 수행하는 경우, 단말의 소프트 컴바이닝 가능 여부를 고려하여 블라인드 디코딩 횟수를 줄일 수 있도록, 반복되는 PDCCH 후보들 간에 명시적인 연결(linkage 혹은 association)이 되어 있다는 정보를 상위 레이어 시그널링으로 설정하거나, L1 시그널링으로 지시하거나, 상위 레이어 시그널링 혹은 L1 시그널링의 조합을 통해 설정 및 지시받을 수 있다. 상위 레이어 시그널링으로 PDCCH 반복 전송 및 명시적 연결성 관련 설정 방법은 하기와 같이 다양한 방법이 있을 수 있다. [PDCCH 반복 설정 방법 1] 상위 레이어 시그널링 PDCCH-config 내에 설정 정보 존재하는 경우 기지국은 단말에게 PDCCH 반복 전송 및 명시적 연결성 관련 설정을 위해, 상위 레이어 시그널링인 PDCCH-config 내에 PDCCH-repetition-config를 설정할 수 있고, PDCCH-repetition-config은 이하와 같은 정보들을 포함할 수있다. - PDCCH 반복 전송 방식 - TDM, FDM, SFN 중 1가지 - PDCCH 반복 전송 시 사용될 제어 자원 세트- 탐색 공간 조합(들) ■ 제어 자원 세트 인덱스(들) - OPTIONAL ■ 탐색 공간 인덱스(들) - OPTIONAL - 명시적 연결성을 위한 집성 레벨(들) - OPTIONAL - 명시적 연결성을 위한 PDCCH 후보 인덱스(들) - OPTIONAL - 명시적 연결성을 위한 주파수 자원 - OPTIONAL 상술한 정보들 적어도 하나에 기반하여, 기지국은 단말에게 상위 레이어 시그널링으로 PDCCH 반복 전송에 대해 설정할 수 있다. 예를 들어, PDCCH 반복 전송 방식이 SFN으로 설정되고, PDCCH 반복 전송 시 사용될 제어 자원 세트-탐색 공간 조합으로서 제어 자원 세트 인덱스가 1로 설정되고, 탐색 공간 인덱스가 설정되지 않았다면, 단 말은 인덱스 1을 가지는 제어 자원 세트에서 PDCCH가 방법 1-5(SFN 전송 방식)을 통해 반복 전송될 것을 기대할 수 있다. 이 때, 설정된 제어 자원 세트는 1개 혹은 서로 다른 복수 개의 TCI state들을 상위 레이어 시그널링 으로 설정받거나, L1 시그널링 혹은 MAC-CE 시그널링으로 지시받거나, 상위 레이어 시그널링 및 L1 시그널링 혹 은 MAC-CE 시그널링의 조합으로 설정 및 지시받을 수 있다. 또한, 만약 PDCCH 반복 전송 방식이 SFN으로 설정되 었다면, 단말은 PDCCH 반복 전송 시 사용될 제어 자원 세트-탐색 공간 조합 내에 탐색 공간 인덱스가 설정되는 것을 기대하지 않을 수 있다. 또 다른 예시로, PDCCH 반복 전송 방식이 TDM 혹은 FDM으로 설정되고, PDCCH 반복 전송 시 사용될 제어 자원 세트-탐색 공간 조합이 2개 설정될 수 있다. 첫 번째 조합에 대해 제어 자원 세트 인 덱스 1, 탐색 공간 인덱스가 1로 설정되고, 두 번째 조합에 대해 제어 자원 세트 인덱스 2, 탐색 공간 인덱스가 2로 설정되었다면, 단말은 두 개의 제어 자원 세트-탐색 공간 조합을 이용하여 PDCCH가 방법 1-1을 통해 TDM 혹 은 FDM 방식으로 반복 전송될 것을 기대할 수 있다. 이 때, 설정된 각 제어 자원 세트는 서로 같거나 서로 다른 복수 개의 TCI state들을 상위 레이어 시그널링으로 설정받거나, L1 시그널링 혹은 MAC-CE 시그널링으로 지시받 거나, 상위 레이어 시그널링 및 L1 시그널링 혹은 MAC-CE 시그널링의 조합으로 설정 및 지시받을 수 있다. 또한, 만약 PDCCH 반복 전송 방식이 TDM 혹은 FDM으로 설정되었다면, 단말은 PDCCH 반복 전송 시 사용될 제어 자원 세트-탐색 공간 조합이 최대 2개까지 설정되는 것을 기대할 수 있고, 각 조합 내에 제어 자원 세트 및 탐 색 공간 인덱스가 모두 설정될 것을 기대할 수 있다. 일 실시예에 따르면, PDCCH 반복 전송 및 명시적 연결성 관련 설정을 위한 5가지의 정보들은 MAC-CE를 기반으로 RRC 재설정 없이 값이 업데이트될 수 있다. 만약 기지국이 단말에게 PDCCH-repetition-config을 설정하지 않으 면, 단말은 PDCCH가 반복 전송되는 것을 기대하지 않고, PDCCH 단일 전송만을 기대할 수 있다. 명시적 연결성을 위한 집성 레벨, PDCCH 후보 인덱스, 주파수 자원들은 후술할 명시적 연결 방법에 따라서 모두 설정되지 않거나, 적어도 하나가 설정될 수 있다. [PDCCH 반복 설정 방법 2] 탐색 공간에 대한 상위 레이어 시그널링 내에 설정 정보 존재하는 경우 기지국은 PDCCH 반복 전송을 위해 탐색 공간에 대한 상위 레이어 시그널링인 searchSpace내에 상위 레이어 시그 널링을 추가하여 단말에게 통지할 수 있다. 예를 들어, 상위 레이어 시그널링인 searchSpace내에 추가적인 상위 레이어 시그널링인 repetition이라는 파라미터가 on 또는 off로 설정되어, 해당 탐색 공간이 반복 전송을 위해 사용됨을 설정할 수 있다. Repetition이 on으로 설정되는 탐색 공간은 대역폭부분 당 1개 혹은 2개일 수 있다. 예를 들어, 탐색 공간 인덱스 1에 대한 상위 레이어 시그널링인 searchSpace 내에 searchSpaceId가 1로 설정되 고, controlResourceSetId가 1로 설정되고, repetition이 on으로 설정되면, 단말은 탐색 공간 1에 연결된 제어 자원 세트 1에서 방법 1-5(SFN 전송 방법)에 따라 PDCCH 반복 전송이 수행됨을 기대할 수 있다. 다른 예시로, 탐색 공간 인덱스 1에 대한 상위 레이어 시그널링인 searchSpace 내에 searchSpaceId가 1로 설정되고, controlResourceSetId가 1로 설정되고, repetition이 on으로 설정되었고, 탐색 공간 인덱스 2에 대한 상위 레 이어 시그널링인 searchSpace내에 searchSpaceId가 2로 설정되고, controlResourceSetId가 2로 설정되고, repetition이 on으로 설정되었다면, 단말은 제어 자원 세트 1 + 탐색 공간 1의 조합과 제어 자원 세트 2 + 탐색 공간 2의 조합 간에 방법 1-1을 이용하여 TDM 혹은 FDM으로 PDCCH 반복 전송이 수행됨을 알 수 있다. TDM과 FDM 의 구분은 제어 자원 세트 1, 2 및 탐색 공간 1, 2의 상위 레이어 시그널링을 통한 시간 및 주파수 설정에 따라구분할 수 있다. 또한, repetition이 on으로 설정된 탐색 공간에 대한 상위 레이어 시그널링 내에, [PDCCH 반복 설정 방법 1]에서 상술한 명시적 연결성을 위한 집성 레벨 혹은 PDCCH 후보 인덱스들이 설정될 수 있다. 또한, 명시적 연결성을 위한 집성 레벨 혹은 PDCCH 후보 인덱스들은 후술할 명시적 연결 방법에 따라서 둘 다 설정되 지 않거나, 둘 중 하나만 설정되거나, 둘 다 설정될 수 있다. [PDCCH 반복 설정 방법 3] 두 개의 탐색 공간들 간의 linkage 설정이 존재하는 경우 또 다른 PDCCH 반복 설정 방법으로, 기지국은 단말에 대한 PDCCH 반복 전송을 위해 각 탐색 공간에 대해 SearchSpaceLinkingId를 할당하여, 단말은 같은 SearchSpaceLinkingId를 가지는 두 개의 탐색 공간들의 경우 상위 레이어 시그널링으로 명시적으로 연결되어 있다고 간주하여, 두 개의 탐색 공간들을 이용하여 반복되는 PDCCH 수신을 수행할 수 있다. 또한, 같은 SearchSpaceLinkingId를 가지는 탐색 공간은 2개로 한정될 수 있으며, 같은 탐색 공간의 타입과 모니터링할 수 있는 DCI 포맷을 가지며, 탐색 공간의 주기와 슬롯 오프셋을 의미하는 monitoringSlotPeriodicityAndOffset, 슬롯 내에서 모니터링 위치를 의미하는 monitoringSymbolsWithinSlot, 설정된 주기 내에서 연속적으로 모니터링할 수 있는 슬롯의 개수를 의미하는 duration 설정 정보에 대해 모두 같은 값을 가지며, 특정 aggregation level(AL) 별 같은 PDCCH 후보 개수를 가지며, 특정 슬롯 내에서 같은 개수의 모니터링 위치(monitoring occasion, MO)을 가질 수 있다. 또한, 2개의 반복되는 PDCCH들은 같은 AL 및 같은 PDCCH 후보 인덱스를 가질 수 있으며, 슬롯 내 반복 전송만이 가능할 수 있다. 일례로, 제1 탐색 공간 및 제2 탐색 공간에 대해 SearchSpaceLinkingId가 1로 설정되어 있고, 두 개의 탐색 공 간들이 같은 단말 특정 탐색 공간이며, DCI format 0_1 및 1_1에 대한 모니터링이 가능하며, 탐색 공간의 주기 와 슬롯 오프셋을 의미하는 monitoringSlotPeriodicityAndOffset, 슬롯 내에서 모니터링 위치를 의미하는 monitoringSymbolsWithinSlot, 설정된 주기 내에서 연속적으로 모니터링할 수 있는 슬롯의 개수를 의미하는 duration 설정 정보에 대해 모두 같은 값을 가지며, AL2에 대한 PDCCH 후보를 2개 가지는 경우, 단말은 두 개의 탐색 공간들에서 전송되는 AL2에 대한 제1 PDCCH 후보 간에 반복 전송임을 가정하여 수신할 수 있으며, 두 개의 탐색 공간들에서 전송되는 AL2에 대한 제2 PDCCH 후보 간에 반복 전송임을 가정하여 수신할 수 있다. <제4 실시 예: 광대역 비면허대역에서 하향링크 제어 자원 세트 설정 방법> NR 혹은 5G 통신 시스템에서 기지국 또는 단말은 광대역의 비면허대역으로 신호를 송수신할 수 있으며, 광대역 비면허대역은 서브밴드(subband, 예를 들어 20MHz) 단위로 구성될 수 있다. 기지국과 단말은 비면허대역을 점유 하기 위해 서브밴드 단위로 채널 접속 절차를 수행할 수 있으며, 채널 접속 절차의 수행 결과에 따라 유휴 (IDLE) 상태인 모든 서브밴드 또는 하나의 서브밴드 또는 연속된 서브밴드 중 적어도 하나의 방식으로 비면허대 역에 접속하여, 설정된 신호 송수신을 수행할 수 있다. 한편, NR 시스템에서는 BWP 마다 하향링크 제어 채널 영 역(CORESET 내지 SS)이 설정되기 때문에 채널 접속 절차 결과에 따라 사용 가능한 서브밴드가 변경되면, PDCCH 모니터링(Monotoring) 후보군(Candidate)이 누락될 수 있다. 따라서, NR 시스템과 달리 광대역 비면허대역을 위 한 하향링크 제어 채널 영역 설정은 서브밴드를 고려한 방법으로 변경될 필요가 있다. 서브밴드를 고려하여 제 어 채널 영역 설정 정보를 지시 (또는 변경, 조정)하고, 채널 접속 절차 결과를 이용하여 하향링크 제어 채널 영역 설정 정보를 변경 또는 조정하는 방법 및 장치에 대해 제안한다. 이하 본 개시의 실시 예에서 제안하는 방법 및 장치는 각 실시 예에 국한되어 적용되지 않고, 발명에서 제안하 는 하나 이상의 실시 예 전체 또는 일부 실시 예들의 조합을 이용하여 PDCCH 모니터링 내지 탐색을 위한 제어 채널 영역을 설정 또는 판단하는 방법 및 장치에 활용할 수 있다. 또한, 본 개시의 실시예에서는 서브밴드 기반 광대역 비면허대역에서 기지국이 제어 채널 영역을 설정하는 경우를 예를 들어 설명할 것이나, 이는 예시적인 것으로, 본 개시는 다중 캐리어(Multi carrier) 또는 캐리어 집성(Carrier aggregation) 전송과 같은 광대역 시스템에서 제어 채널 영역을 설정하는 경우에도 적용 가능할 것이다. 또한, 광대역 외에 단일 캐리어 또는 단 일 대역 시스템에서 제어 채널 영역을 설정하는 경우에도 적용 가능할 것이다. 뿐만 아니라, 본 개시의 실시예 에서는 비면허대역에서 동작하는 기지국과 단말을 가정하여 설명할 것이나, 비면허대역 뿐만 아니라, 면허대역 또는 공유대역(Shared spectrum)에서 동작하는 기지국과 단말에도 본 개시의 실시 예에서 제안하는 방법 및 장 치를 적용할 수 있다.본 실시 예에서는 광대역 비면허대역에서 기지국이 단말에게 하향링크 제어 자원 세트를 설정하는 방법을 제안 한다. 보다 구체적으로, 대역폭부분에 설정된 제어 자원 세트가 특정 서브밴드에 포함될 수 있으며, 다른 서브 밴드에서도 특정 서브밴드에 설정된 동일한 제어 자원 세트 설정 정보를 이용할 수 있다. 도 16은 본 개시의 실시예에 따른 제어 자원 세트 설정 방법을 설명하기 위한 도면이다. 도 16을 참고하면, 광대역 비면허대역에서 신호를 송수신하는 기지국과 단말에서, 서브밴드 기반으로 채널 접속 절차를 수행 후, 채널 접속 절차의 수행 결과에 따라 유휴 상태인 서브밴드에 접속하여 PDCCH/PDSCH 송신을 수 행하도록 설정된 기지국을 가정한다. 접속할 수 있는 비면허대역의 서브밴드는 적어도 하나 이상의 유휴 상태인 서브밴드를 의미할 수 있다. 기지국은 대역폭부분 내에서 제어 자원 세트를 설정할 수 있다. 이때, 설정된 제어 자원 세트는 특정 서브밴드에만 포함될 수 있다. 여기서, 특정 서브밴드는 기준 서브 밴드일 수 있다. 일 실시예에 따르면, 기준 서브밴드는 가장 낮은 서브밴드 인덱스, 또는 SS/PBCH 블록을 포함하는 서브밴드 인 덱스, 또는 CORESET#0를 포함하는 서브밴드 인덱스, 혹은 가장 낮은 PRB/CRB를 포함하는 서브밴드 인덱스로 판 단되거나 또는 설정될 수 있다. 또는, 기지국이 서브밴드 인덱스를 상위 시그널링 또는 제어 채널을 통해 단말 에게 설정해 줄 수 있다. 기준 서브밴드를 제외한 다른 서브밴드(1602, 1603, 1604, 1605)의 제어 자원 세트 설 정 정보는 기준 서브밴드에 포함된 제어 자원 세트 설정 정보와 동일할 수 있다. 이 때, 각 서브밴드에 적용된 제어 자원 세트 인덱스는 동일할 수 있으며, PDCCH 후보군의 개수는 설정된 최대 PDCCH 후보군의 수 이내에서 설정될 수 있다. 일 실시예에 따르면, 기지국과 단말은 제어 자원 세트에 대한 주파수 자원 할당 정보를 의미하는 상위 레이어 시그널링인 frequencyDomainResources에 대한 해석에 대해, 해당 제어 자원 세트가 어떤 탐색 공간과 연결되었 는 지에 따라 달리할 수 있다. 만약 특정 제어 자원 세트가 특정 탐색 공간과 연결되어 있고, 해당 탐색 공간에 대한 상위 레이어 시그널링 내에 각 서브밴드의 제어 자원 세트 존재 유무에 대한 상위 레이어 시그널링인 freqMonitorLocations이 설정되지 않은 경우, 단말은 frequencyDomainResources에 대한 기존의 정의를 사용할 수 있다. 즉, 단말은 각 비트가 6개의 RB들에 대한 주파수 자원 할당 여부를 의미하는 총 45 비트를 이용하여 제어 자원 세트에 대한 주파수 자원 할당 정보를 설정받을 수 있다. 이와 달리, 만약 특정 제어 자원 세트가 특 정 탐색 공간과 연결되어 있고, 해당 탐색 공간에 대한 상위 레이어 시그널링 내에 각 서브밴드의 제어 자원 세 트 존재 유무에 대한 상위 레이어 시그널링인 freqMonitorLocations이 설정된 경우, 단말은 frequencyDomainResources에 대한 기존의 정의 대신, 복수 개의 서브밴드들을 고려한 새로운 정의를 사용할 수 있다. 단말은 frequencyDomainResources 중 첫 번째 서브밴드에 대응되는 비트맵에 대한 정보를 이용하여 첫 번 째 서브밴드에 대한 주파수 자원 할당 정보로 간주할 수 있고, 탐색 공간의 상위 레이어 시그널링 내 존 재하는 freqMonitorLocations를 이용하여 각 서브밴드에 대한 주파수 자원 할당 정보를 추가로 획득할 수 있다. 예를 들어, freqMonitorLocations는 5 비트의 비트맵일 수 있다. 비트맵의 5 비트 중 특정 비트의 값이 1인 경 우 해당 서브밴드에 제어 자원 세트의 주파수 자원 할당이 존재할 수 있음을 의미할 수 있다. 즉, freqMonitorLocations의 값이 1인 서브밴드 위치에 대해서는 상술한 frequencyDomainResources에 대한 새로운 정의를 사용하여 얻은 주파수 자원 할당 정보를 해당 서브밴드에도 동일하게 적용할 수 있다. 즉, 해당 제어 자 원 세트의 첫 번째 서브밴드에 대한 주파수 자원 할당 정보는 freqMonitorLocations의 값이 1인 서브밴드 위치 에 동일하게 복사(적용)될 수 있다. freqMonitoLocations가 5비트의 비트맵인 것은 예시에 불과하며, 5비트보다 적거나 많은 수의 비트를 포함하는 비트맵으로 구성될 수 있다. <제5 실시 예: 광대역 비면허대역에서 PDCCH 반복 전송 설정 방법> 본 개시의 일 실시예로, 광대역 비면허대역에서 PDCCH 반복 전송 설정 방법에 대해 설명한다. PDCCH 반복 전송 은 비면허대역에서도 사용될 수 있다. 비면허대역에서는 채널 접속 절차에 성공하여 채널을 점유한 이후 일정 시간동안 해당 채널을 사용하지 않는 경우, 즉 일정 시간동안 해당 채널에서 상향링크 전송 및 하향링크 수신이 이루어지지 않는 경우, 혹은 채널 접속 절차에 대해 성공한 이후 정해진 채널 점유 시간(Channel Occupation Time, COT)이 지난 경우, 다시 채널을 점유하기 위해 채널 접속 절차를 추가로 수행해야 한다. 이러한 불필요한 복수의 채널 접속 절차들을 피하기 위해, 시간 상으로 연속적인 채널 점유 방식이 필요할 수 있다. 이 때, COT 는 상위 레이어 시그널링으로 설정되거나, MAC-CE를 통해 활성화되거나, DCI 등을 통해 동적으로 지시되거나, 이와 같은 시그널링의 조합을 통해 통지되거나, 특정 비면허대역 별로 사전에 정의될 수 있다. PDSCH를 스케줄 링하지 않는 PDCCH의 경우, 단말 입장에서는 PDCCH 수신 이후 시간 상으로 연속적으로 수신할 수 있는 PDSCH가존재하지 않을 수 있기 때문에, 채널 점유 시간을 증대시키기 위해서는 반복적인 PDCCH 수신이 유효할 수 있다. 또한, 만약 기지국과 단말이 60 GHz와 같은 높은 주파수의 비면허대역을 사용하는 경우, 기지국으로부터의 수신 빔에 대한 블로키지(blockage) 등으로 인해 PDCCH에 대한 수신이 불가한 경우, 다중 TRP로부터의 PDCCH 반복 전 송 방식을 이용하여 이와 같은 문제를 해결할 수 있다. 만약 기지국과 단말에서 비면허대역에서 PDCCH 반복 전송을 고려하는 경우, 기지국과 단말은 상술한 복수 개의 서브밴드들을 고려한 제어 자원 세트의 주파수 자원 할당 방법과 PDCCH 반복 전송에 대한 설정 정보를 모두 고 려해야할 수 있다. 비면허대역에서도 PDCCH 반복 전송 시 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간 들을 이용해야 하며, 비면허대역에서의 PDCCH 수신이므로 복수 개의 서브밴드들을 고려한 제어 자원 세트의 주 파수 자원 할당 방법을 고려할 수 있다. 이 때, 두 방식에 대한 각 설정 정보가 조합되는 경우 필요한 제약 및 추가적인 해석에 대해 다음과 같이 다양한 방법이 존재할 수 있다. [방법 5-1] 만약 기지국과 단말이 비면허대역에서 PDCCH 반복 전송을 고려하는 경우, 기지국은 단말에게 제어 자원 세트의 주파수 자원 할당 정보가 각 서브밴드에서 서로 같은 두 개의 탐색 공간들을 상위 레이어 시그널링으로 연결하 여 PDCCH 반복 전송에 사용하도록 통지할 수 있다. 구체적으로, 기지국은 단말에게 같은 freqMonitorLocations 설정 정보를 갖는 두 개의 탐색 공간들에 대해 같은 SearchSpaceLinkingId를 설정해줄 수 있다. 단말은 서로 다 른 freqMonitorLocations 설정 정보를 갖는 두 개의 탐색 공간들에 대해 같은 SearchSpaceLinkingId를 설정 받 는 것을 기대하지 않을 수 있다. 방법 5-1에 있어서, 만약 기지국과 단말이 특정 서브밴드에 대한 채널 접속 절차에 성공하고, 해당 서브밴드가 두 개의 탐색 공간들의 freqMonitorLocations 설정 정보에 의해 두 개의 탐색 공간들에 연결된 각 제어 자원 세 트의 주파수 자원 할당이 모두 존재하는 경우, 단말은 채널 접속 절차에 성공한 이후 두 개의 탐색 공간의 PDCCH 모니터링 위치가 COT 내에 모두 포함되는 것을 기대할 수 있다. 또는, 만약 기지국과 단말이 채널 접속 절차에 성공한 이후 두 개의 탐색 공간들의 PDCCH 모니터링 위치 중 시간 상으로 나중에 나타나는 것이 COT 내 에 포함되지 않는 경우, 시간 상으로 나중에 나타나는 PDCCH 모니터링 위치를 포함시킬 수 있도록 COT를 연장할 수 있다. 나중에 나타나는 PDCCH 모니터링 위치를 포함시킬 수 있도록 COT를 연장하는 것은 상위 레이어 시그널 링으로 설정되거나, MAC-CE로 활성화되거나, DCI 등으로 동적으로 지시되거나, 이와 같은 시그널링들의 조합으 로 단말에게 통지될 수 있거나, 사전에 규격적으로 정의될 수 있다. 또는, 만약 기지국과 단말이 채널 접속 절 차에 성공한 이후 두 개의 탐색 공간들의 PDCCH 모니터링 위치 중 시간 상으로 나중에 나타나는 것이 COT 내에 포함되지 않는 경우, 단말은 COT 내에 포함되는 하나의 PDCCH 모니터링 위치를 기반으로 단일 PDCCH 전송을 기 대할 수 있고, 이는 상위 레이어 시그널링으로 설정되거나, MAC-CE로 활성화되거나, DCI 등으로 동적으로 지시 되거나, 이와 같은 시그널링들의 조합으로 단말에게 통지될 수 있거나, 사전에 규격적으로 정의될 수 있다. 방법 5-1에 대하여, 단말은 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들의 PDCCH 모니터링 위치를 준 정적인 정보로서 사전에 알 수 있다. 따라서, 단말은 채널 접속 절차를 수행하는 경우 접속 성공 이후 바로 PDCCH 모니터링을 수행하기 위해, 특정 서브밴드에서 제어 자원 세트의 주파수 자원 할당이 존재하는 복수 개의 탐색 공간들 중 시간 상으로 먼저 나타나는 PDCCH 모니터링 위치보다 이전에 채널 접속 절차를 수행하는 것을 기대할 수 있다. 방법 5-1은 PDCCH 반복 전송에 대한 단말 역량과 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파 수 자원 할당 방법에 대한 단말 역량을 모두 보고한 경우에 특정 상위 레이어 시그널링이 설정되어야 사용될 수 있다. 또는, 방법 5-1은 두 개의 단말 역량들의 보고 만으로 사용할 수도 있다. 혹은, PDCCH 반복 전송에 대한 단말 역량과 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방법에 대한 단말 역량 이외에, PDCCH 반복 전송 및 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방법의 조합을 지원하는 추가적인 단말 역량과 그에 대응되는 상위 레이어 시그널링이 설정되어야 사용될 수 있거나, 두 단말 역량 보고와 추가적인 단말 역량 보고 만으로도 사용할 수도 있다. 도 17은 본 개시의 실시예에 따른 비면허대역에서의 PDCCH 반복 전송에 대한 예를 도시한다. 도 17을 참고하면, 단말은 기지국으로부터 상위 레이어 시그널링으로 2개의 탐색 공간(SearchSpace#1, SearchSpace#2)과 2개의 제어 자원 세트(CORESET#1, CORESET#2)에 대해 설정 받을 수 있다. CORESET#1과SearchSpace#1이 연결(linkage 또는 association)되어 있고, CORESET#2와 SearchSpace#2가 연결될 수 있 다. 단말은 두 개의 탐색 공간들에 대해 freqMonitorLocations 비트맵 값을 [1,0,1,0,1]로 동일하게 설 정 받으며, SearchSpaceLinkingId를 1로 설정 받을 수 있다. 따라서, CORESET#1 및 CORESET#2의 주파수 자원 할당 정보는 서브밴드#0(1711, 1721), 서브밴드#2(1713, 1723), 서브밴드#4(1715, 1725)에 적용될 수 있다. 또 한, 도 17에서 도시한 바와 같이, freqMonitorLocations 비트맵이 0으로 설정된 서브밴드#1(1712, 1722), 서브 밴드#3(1714, 1724)에는 CORESET#1 및 CORESET#2의 주파수 자원 할당 정보가 존재하지 않을 수 있다. 단말은 상위 레이어 시그널링을 통해 수신한 설정 정보에 기반하여, 만약 서브밴드#0에 대한 채널 접속 절차를 성공한 경우, 기지국으로부터의 PDCCH 반복 전송을 수신할 수 있다. [방법 5-2] 만약 기지국과 단말이 비면허대역에서 PDCCH 반복 전송을 고려하는 경우, 기지국은 단말에게 상위 레이어 시그 널링으로 연결된 두 개의 탐색 공간들에 대한 설정 정보를 제공할 수 있으며, 이 때 각 탐색 공간에 설정된 freqMonitorLocations 정보는 특정 제약이 없을 수 있다. 즉 두 개의 탐색 공간들의 freqMonitorLocations 비 트맵은 특정 서브밴드 위치에 대해 서로 같거나 다른 비트 값이 설정되는 것이 가능할 수 있다. 이 때, 두 개의 탐색 공간들의 freqMonitorLocations 비트맵의 특정 서브밴드 위치에 대한 두 비트 값들의 조합에 따라, 단말은 PDCCH 수신에 대한 해석을 달리할 수 있다. 만약 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들의 freqMonitorLocations 비트맵의 특정 서브밴드 위치에 대한 두 비트 값들이 모두 1인 경우, 즉 해당 서브밴드 위치에 두 개의 탐색 공간들에 연결된 각 제어 자원 세트의 주파수 자원 할당 정보가 모두 존재하는 경우, 단말 은 PDCCH 반복 전송으로 간주하여 수신할 수 있다. 만약 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들 의 freqMonitorLocations 비트맵의 특정 서브밴드 위치에 대한 두 비트 값들 중 하나의 비트 값만이 1인 경우, 즉 해당 서브밴드 위치에 두 개의 탐색 공간들 중 1개에 연결된 각 제어 자원 세트의 주파수 자원 할당 정보만 존재하는 경우, 단말은 PDCCH 단일 전송으로 간주하여 수신할 수 있다. 만약 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들의 freqMonitorLocations 비트맵의 특정 서브밴드 위치에 대한 두 비트 값들이 모두 0인 경 우, 즉 해당 서브밴드 위치에 두 개의 탐색 공간들에 연결된 각 제어 자원 세트의 주파수 자원 할당 정보가 모 두 존재하지 않는 경우, 단말은 해당 서브밴드에서 두 개의 탐색 공간들에서의 PDCCH 수신을 기대하지 않을 수 있다. 방법 5-2에 있어서, 만약 기지국과 단말이 특정 서브밴드에 대한 채널 접속 절차에 성공하고, 해당 서브밴드가 두 개의 탐색 공간들의 freqMonitorLocations 설정 정보에 의해 두 개의 탐색 공간들에 연결된 각 제어 자원 세 트의 주파수 자원 할당이 모두 존재하는 경우, 단말은 채널 접속 절차에 성공한 이후 두 개의 탐색 공간들의 PDCCH 모니터링 위치가 COT 내에 모두 포함되는 것을 기대할 수 있다. 또는, 만약 기지국과 단말이 채널 접속 절차에 성공한 이후 두 개의 탐색 공간들의 PDCCH 모니터링 위치 중 시간 상으로 나중에 나타나는 것이 COT 내 에 포함되지 않는 경우, 시간 상으로 나중에 나타나는 PDCCH 모니터링 위치를 포함시킬 수 있도록 COT를 연장할 수 있다. 시간 상으로 나중에 나타나는 PDCCH 모니터링 위치를 포함시킬 수 있도록 COT를 연장하는 것은 상위 레이어 시그널링으로 설정되거나, MAC-CE로 활성화되거나, DCI 등으로 동적으로 지시되거나, 이와 같은 시그널 링들의 조합으로 단말에게 통지될 수 있거나, 사전에 규격적으로 정의될 수 있다. 또는, 만약 기지국과 단말이 채널 접속 절차에 성공한 이후 두 개의 탐색 공간들의 PDCCH 모니터링 위치 중 시간 상으로 나중에 나타나는 것 이 COT 내에 포함되지 않는 경우, 단말은 COT 내에 포함되는 하나의 PDCCH 모니터링 위치를 기반으로 단일 PDCCH 전송을 기대할 수 있다. COT 내에 포함되는 하나의 PDCCH 모니터링 위치를 기반으로 단일 PDCCH 전송은 상위 레이어 시그널링으로 설정되거나, MAC-CE로 활성화되거나, DCI 등으로 동적으로 지시되거나, 이와 같은 시 그널링들의 조합으로 단말에게 통지될 수 있거나, 사전에 규격적으로 정의될 수 있다. 또한, 방법 5-2에 있어서, 단말은 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들의 PDCCH 모니터링 위 치를 준정적인 정보로서 사전에 알 수 있다. 단말은 채널 접속 절차를 수행하는 경우 접속 성공 이후 바로 PDCCH 모니터링을 수행하기 위해, 특정 서브밴드에서 제어 자원 세트의 주파수 자원 할당이 존재하는 복수의 탐 색 공간들 중 시간 상으로 먼저 나타나는 PDCCH 모니터링 위치보다 이전에 채널 접속 절차를 수행하는 것을 기 대할 수 있다. 또한, 방법 5-2에 있어서, 만약 기지국과 단말이 2개의 서브밴드들에 대해 채널 접속 절차를 성공했고, 2개의 서브밴드들 중 1개의 서브밴드에서는 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들 중 1개의 탐색 공 간에 대응하는 제어 자원 세트의 주파수 자원 할당이 존재하며, 나머지 서브밴드에서는 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들 중 나머지 탐색공간에 대응하는 제어 자원 세트의 주파수 자원 할당이 존재하는 경우, 단말은 두 서브밴드들의 PDCCH 모니터링 위치에서 전송될 PDCCH는 반복 전송인 것으로 기대할 수 있다. 방법 5-2는 PDCCH 반복 전송에 대한 단말 역량과 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파 수 자원 할당 방법에 대한 단말 역량을 모두 보고한 경우에 특정 상위 레이어 시그널링이 설정되어야 사용될 수 있다. 또는, 방법 5-2는 두 개의 단말 역량들의 보고 만으로 사용할 수도 있다. 혹은, PDCCH 반복 전송에 대한 단말 역량과 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방법에 대한 단말 역량 이외에, PDCCH 반복 전송 및 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방법의 조합 방법을 지원하는 추가적인 단말 역량과 그에 대응되는 상위 레이어 시그널링이 설정되어야 사용될 수 있거 나, 두 단말 역량 보고와 추가적인 단말 역량 보고 만으로도 사용할 수도 있다. 도 18은 본 개시의 실시예에 따른 비면허대역에서의 PDCCH 반복 전송에 대한 다른 예를 도시한다. 단말은 기지 국으로부터 상위 레이어 시그널링으로 2개의 탐색 공간(SearchSpace#1, SearchSpace#2)과 2개의 제어 자원 세트 (CORESET#1, CORESET#2)에 대해 설정 받을 수 있고, CORESET#1과 SearchSpace#1이 연결(linkage 또는 association)되어 있고, CORESET#2와 SearchSpace#2가 연결될 수 있다. 이 때, SearchSpace#1의 freqMonitorLocations은 [1,0,1,0,1]로 설정될 수 있고, SearchSpace#2의 freqMonitorLocations는 [1,1,0,0,1]로 설정될 수 있고, SearchSpaceLinkingId는 1로 설정될 수 있다. 따라서, CORESET#1의 주파수 자 원 할당 정보는 서브밴드#0, 서브밴드#2, 서브밴드#4에 적용될 수 있으며, CORESET#2의 주 파수 자원 할당 정보는 서브밴드#0, 서브밴드#1, 서브밴드#4에 적용될 수 있다. 또한, 도 18 에서 도시한 바와 같이, SearchSpace#1에 대해 freqMonitorLocations 비트맵이 0으로 설정된 서브밴드 #1, 서브밴드#3에는 CORESET#1의 주파수 자원 할당 정보가 존재하지 않을 수 있으며, SearchSpace#2에 대해 freqMonitorLocations 비트맵이 0으로 설정된 서브밴드#2, #3에는 CORESET#2의 주파수 자원 할당 정보가 존재하지 않을 수 있다. 만약 단말이 서브밴드#0 혹은 서브밴드#4에 대한 채널 접속 절차를 성공한 경우, 단말은 기지국으로부터의 PDCCH 반복 전송을 수신할 수 있다. 또한, 단말이 서 브밴드#1 혹은 서브밴드#2에 대한 채널 접속 절차를 성공한 경우, 단말은 기지국으로부터의 PDCCH 단일 전송을 수신할 수 있다. 또한, 만약 단말이 서브밴드#1과 서브밴드#2에 대해 채널 접속 절차를 성공한 경우, 단말은 서 브밴드#2의 CORESET#1과 서브밴드#1의 CORESET#2에서 전송되는 PDCCH는 서로 반복 전송되는 것임 을 가정하고 디코딩할 수 있다. [방법 5-3] 만약 기지국과 단말이 비면허대역에서 PDCCH 반복 전송을 고려하는 경우, 기지국은 단말에게 상위 레이어 시그 널링으로 연결된 두 개의 탐색 공간들에 대한 설정 정보를 제공할 수 있다. 만약 제1 탐색 공간과 제2 탐색 공 간이 상위 레이어 시그널링으로 연결되었으며, 제1 탐색공간의 슬롯 내 모니터링 위치가 제2 탐색 공간의 슬롯 내 모니터링 위치보다 시간 상으로 먼저 나타나는 경우, 제1 탐색 공간에 설정된 freqMonitorLocations 비트맵 이 제2 탐색공간에 설정된 freqMonitorLocations 비트맵을 포함할 수 있도록 설정될 수 있다. 이러한 설정은 기 지국과 단말이 특정 서브밴드에 채널 접속 절차를 성공한 경우, 시간 상으로 먼저 나타나는 모니터링 위치를 이 용하여 PDCCH 수신을 할 수 있도록 하기 위함일 수 있다. 예를 들어, 제1 탐색 공간에 설정된 freqMonitorLocations 비트맵이 [1,0,1,0,1]이라면, 제2 탐색 공간에 설정받을 수 있는 freqMonitorLocations 비트맵은 첫 번째, 세 번째, 다섯 번째 비트 위치에 대해 0 또는 1이 가능하며, 두 번째, 네 번째 비트 위치에 대해서는 0만 가능할 수 있다. 즉, 단말은, 두 번째, 네 번째 비트 위치에 제2 탐색 공간에 설정받을 수 있는 freqMonitorLocations 비트맵의 값이 1인 것을 기대하지 않을 수 있다. 또한, 두 개의 탐색 공간들의 freqMonitorLocations 비트맵은 특정 서브밴드 위치에 대해 서로 같거나 다른 비 트 값이 설정될 수 있다. 이 때, 두 개의 탐색 공간들의 freqMonitorLocations 비트맵의 특정 서브밴드 위치에 대한 두 비트 값들의 조합에 따라, 단말은 PDCCH 수신에 대한 해석을 달리할 수 있다. 예를 들어, 만약 상위 레 이어 시그널링으로 연결된 두 개의 탐색 공간들의 freqMonitorLocations 비트맵의 특정 서브밴드 위치에 대한 두 비트 값들이 모두 1인 경우, 즉 해당 서브밴드 위치에 두 개의 탐색 공간들에 연결된 각 제어 자원 세트의 주파수 자원 할당 정보가 모두 존재하는 경우, 단말은 PDCCH 반복 전송으로 간주하여 수신할 수 있다. 만약 상 위 레이어 시그널링으로 연결된 두 개의 탐색 공간들의 freqMonitorLocations 비트맵의 특정 서브밴드 위치에 대한 두 비트 값들 중 하나의 비트 값이 1인 경우, 즉 해당 서브밴드 위치에 두 개의 탐색 공간들 중 1개에 연결된 각 제어 자원 세트의 주파수 자원 할당 정보만 존재하는 경우, 단말은 PDCCH 단일 전송으로 간주하여 수신 할 수 있다. 만약 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들의 freqMonitorLocations 비트맵의 특 정 서브밴드 위치에 대한 두 비트 값들이 모두 0인 경우, 즉 해당 서브밴드 위치에 두 개의 탐색 공간들에 연결 된 각 제어 자원 세트의 주파수 자원 할당 정보가 모두 존재하지 않는 경우, 단말은 해당 서브밴드에서 두 개의 탐색 공간들에서의 PDCCH 수신을 기대하지 않을 수 있다. 방법 5-3에 있어서, 만약 기지국과 단말이 특정 서브밴드에 대한 채널 접속 절차에 성공하고, 해당 서브밴드가 두 개의 탐색 공간들의 freqMonitorLocations 설정 정보에 의해 두 개의 탐색 공간들에 연결된 각 제어 자원 세 트의 주파수 자원 할당이 모두 존재하는 경우, 단말은 채널 접속 절차에 성공한 이후 두 개의 탐색 공간들의 PDCCH 모니터링 위치가 COT 내에 모두 포함되는 것을 기대할 수 있다. 또는, 만약 기지국과 단말이 채널 접속 절차에 성공한 이후 두 개의 탐색 공간들의 PDCCH 모니터링 위치 중 시간 상으로 나중에 나타나는 것이 COT 내 에 포함되지 않는 경우, 시간 상으로 나중에 나타나는 PDCCH 모니터링 위치를 포함시킬 수 있도록 COT를 연장할 수 있다. 시간 상으로 나중에 나타나는 PDCCH 모니터링 위치를 포함시킬 수 있도록 COT를 연장하는 것은 상위 레이어 시그널링으로 설정되거나, MAC-CE로 활성화되거나, DCI 등으로 동적으로 지시되거나, 이와 같은 시그널 링들의 조합으로 단말에게 통지될 수 있거나, 사전에 규격적으로 정의될 수 있다. 또는, 만약 기지국과 단말이 채널 접속 절차에 성공한 이후 두 개의 탐색 공간들의 PDCCH 모니터링 위치 중 시간 상으로 나중에 나타나는 것 이 COT 내에 포함되지 않는 경우, 단말은 COT 내에 포함되는 하나의 PDCCH 모니터링 위치를 기반으로 단일 PDCCH 전송을 기대할 수 있다. COT 내에 포함되는 하나의 PDCCH 모니터링 위치를 기반으로 단일 PDCCH 전송은 상위 레이어 시그널링으로 설정되거나, MAC-CE로 활성화되거나, DCI 등으로 동적으로 지시되거나, 이와 같은 시 그널링들의 조합으로 단말에게 통지될 수 있거나, 사전에 규격적으로 정의될 수 있다. 또한, 방법 5-3에 있어서, 단말은 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들의 PDCCH 모니터링 위 치를 준정적인 정보로서 사전에 알 수 있다. 단말은 채널 접속 절차를 수행하는 경우 접속 성공 이후 바로 PDCCH 모니터링을 수행하기 위해, 특정 서브밴드에서 제어 자원 세트의 주파수 자원 할당이 존재하는 복수의 탐 색 공간들 중 시간 상으로 먼저 나타나는 PDCCH 모니터링 위치보다 이전에 채널 접속 절차를 수행하는 것을 기 대할 수 있다. 또한, 방법 5-3에 있어서, 만약 기지국과 단말이 2개의 서브밴드들에 대해 채널 접속 절차를 성공했고, 2개의 서브밴드들 중 1개의 서브밴드에서는 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들 중 1개의 탐색 공 간에 대응하는 제어 자원 세트의 주파수 자원 할당이 존재하며, 나머지 서브밴드에서는 상위 레이어 시그널링으 로 연결된 두 개의 탐색 공간들 중 나머지 탐색공간에 대응되는 제어 자원 세트의 주파수 자원 할당이 존재하는 경우, 단말은 두 서브밴드들의 PDCCH 모니터링 위치에서 전송될 PDCCH는 반복 전송인 것으로 기대할 수 있다. 방법 5-3은 PDCCH 반복 전송에 대한 단말 역량과 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파 수 자원 할당 방법에 대한 단말 역량을 모두 보고한 경우에 특정 상위 레이어 시그널링이 설정되어야 사용될 수 있다. 또는, 방법 5-3은 두 개의 단말 역량들의 보고 만으로 사용할 수도 있다. 혹은, PDCCH 반복 전송에 대한 단말 역량과 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방법에 대한 단말 역량 이외에, PDCCH 반복 전송 및 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방법의 조합 방법을 지원하는 추가적인 단말 역량과 그에 대응되는 상위 레이어 시그널링이 설정되어야 사용될 수 있거 나, 두 단말 역량 보고와 추가적인 단말 역량 보고 만으로도 사용할 수도 있다. [방법 5-4] 기지국과 단말은 비면허대역에서 PDCCH 반복 전송 시, 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들에 각각 연결된 제어 자원 세트에 대해 서브밴드 별 주파수 자원 할당 방식을 지원하지 않을 수 있다. 즉 단말은 비면허대역에 대응되는 셀 또는 밴드(또는 서브밴드)에서, 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간 들 모두에 상위 레이어 시그널링인 freqMonitorLocations가 설정되지 않는 것을 기대할 수 있다. 방법 5-4에 있어서, 단말은 PDCCH 반복 전송에 대한 단말 역량과, 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방법에 대한 단말 역량 중 1가지만을 선택하여 보고할 수 있다. 또는, 단말은 두 가지 단말 역량들을 모두 보고했다고 하더라도, 비면허대역에서는 PDCCH 반복 전송을 지원할 때 제어 자원 세트 의 서브밴드 별 주파수 자원 할당 방식을 지원하지 않을 수 있다.[방법 5-5] 기지국과 단말은 비면허대역에서 PDCCH 반복 전송 시, 상위 레이어 시그널링으로 연결된 두 개의 탐색 공간들 중 적어도 1개의 탐색 공간이 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방식을 지원하더라도, 각 서브밴 드 별로 서로 다른 PDCCH 전송 방식을 가정할 수 있다. 만약 제1 및 제2 탐색 공간이 PDCCH 반복 전송을 위해 서로 상위 레이어 시그널링으로 연결되어 있고, 제1 탐색 공간은 상위 레이어 시그널링인 freqMonitorLocations 를 포함하며, 제2 탐색 공간은 포함하지 않는 경우, 단말은 제1 탐색 공간의 첫 번째 서브밴드와, 제2 탐색 공 간에 연결된 제어 자원 세트의 전체 주파수 자원 중 제1 탐색 공간의 첫 번째 서브밴드에 대응하는 주파수 자원 에서는 PDCCH 반복 전송이 수행될 수 있다. 이 때, 제1 탐색 공간의 첫 번째가 아닌 다른 서브밴드에서는 독립 적인 PDCCH 단일 전송이 수행될 수 있다. 또한, 제2 탐색 공간에 연결된 제어 자원 세트의 전체 주파수 자원 중 제1 탐색 공간의 첫 번째 서브밴드에 대응하지 않는 주파수 자원에서는 독립적인 PDCCH 단일 전송이 수행될 수 있음을 기대할 수 있다. 방법 5-5에 있어서, 단말은 PDCCH 반복 전송에 대한 단말 역량과, 비면허대역에서의 동작 및 제어 자원 세트의 서브밴드 별 주파수 자원 할당 방법에 대한 단말 역량 모두를 보고하거나, 두 단말 역량들의 보고 이외에 추가 적인 제3 단말 역량 보고가 필요할 수도 있다. 또한, 제3 단말 역량 보고가 필요한 경우, 제3 단말 역량에 대응 하는 추가적인 상위 레이어 시그널링이 설정될 수도 있다. [방법 5-6] 기지국과 단말은 비면허대역에서 PDCCH 반복 전송을 지원하지 않을 수 있다. 즉, 단말은 PDCCH 반복 전송에 대 한 단말 역량과, 비면허대역에서의 동작 및 제어자원세트의 서브밴드 별 주파수 자원 할당 방법에 대한 단말 역 량 중 1가지만을 선택하여 보고할 수 있다. 또는, 단말은 두 단말 역량들을 모두 보고했다고 하더라도 비면허대 역에서는 PDCCH 반복 전송을 지원하지 않을 수 있다. 이러한 경우, 비면허대역에 대응되는 셀 혹은 밴드에서는 상위 레이어 시그널링으로 서로 연결된 두 개의 탐색 공간들이 존재하지 않을 수 있다. 즉, 비면허대역에 대응 하는 셀 혹은 밴드(또는 서브밴드)에서, 단말은 기지국으로부터 PDCCH에 대한 단일 전송만을 기대할 수 있다. 기지국과 단말은 상술한 [방법 5-1] 내지 [방법 5-6] 중 1가지를 상위 레이어 시그널링으로 설정 받거나, 상술 한 [방법 5-1] 내지 [방법 5-6] 중 1가지를 MAC-CE를 통해 활성화받거나, DCI를 통해 동적으로 지시받거나, 규 격적으로 사전에 정의할 수도 있다. 각 방법 별로 독립적인 단말 역량 보고 시그널링이 정의될 수도 있으며, 상 술한 바와 같이, 단말과 기지국은 기존의 PDCCH 반복 전송 관련 단말 역량과 비면허대역에서의 동작 및 제어자 원세트의 서브밴드 별 주파수 자원 할당 방법에 대한 단말 역량과의 조합을 통해 각 방법 별 지원 여부를 판단 할 수 있다. 도 19는 본 개시의 실시예에 따른 무선 통신 시스템에서 단말의 구조를 도시하는 도면이다. 도 19를 참조하면, 단말은 단말기 수신부와 단말기 송신부를 일컫는 송수신부(transceiver), 메모 리(미도시) 및 단말기 처리부(1905, 또는 단말기 제어부 또는 프로세서)를 포함할 수 있다. 단말의 통신 방법에 따라, 단말의 송수신부(1900, 1910), 메모리 및 단말기 처리부가 동작할 수 있다. 다만, 단말의 구성 요 소가 송수신부(1900, 1910), 메모리, 및 단말기 처리부에 한정되는 것은 아니다. 예를 들어, 단말은 전술 한 구성 요소들 보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수도 있다. 뿐만 아니라, 송 수신부(1900, 1910), 메모리, 및 프로세서가 하나의 칩(chip) 형태로 구현될 수도 있다. 송수신부(1900, 1910)는 기지국과 신호를 송수신할 수 있다. 여기에서, 신호는 제어 정보 및 데이터를 포함할 수 있다. 이를 위해, 송수신부(1900, 1910)는 전송되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡음 증폭하고 주파수를 하강 변환하는 RF 수신기 등으로 구성될 수 있다. 다만, 이는 송수 신부(1900, 1910)의 일 실시 예일뿐이며, 송수신부(1900, 1910)의 구성 요소가 RF 송신기 및 RF 수신기에 한정 되는 것은 아니다. 또한, 송수신부(1900, 1910)는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서 로부터 출력되는 신호를 무선 채널을 통해 전송할 수 있다. 메모리는 단말의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 단말이 송수신하는 신호 에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 롬(ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성될 수 있다. 또한, 메모리는 복수 개일 수 있다. 또한 프로세서는 본 개시의 실시예에 따라 단말이 동작할 수 있도록 일련의 과정을 제어할 수 있다. 예를 들어, 프로세서는 두 가지 계층으로 구성되는 DCI를 수신하여 동시에 다수의 PDSCH를 수신하도록 단말의 구성 요소를 제어할 수 있다. 프로세서는 적어도 하나의 프로세서로 구성될 수 있으며, 프로세서는 메모리에 저장된 프로그램을 실행함으로써 단말의 구성 요소 제어 동작을 수행할 수 있다. 도 20는 본 개시의 실시예에 따른 무선 통신 시스템에서 기지국의 구조를 도시하는 도면이다. 도 20를 참조하면, 기지국은 기지국 수신부와 기지국 송신부를 일컫는 송수신부(2000, 2010), 메모 리(미도시) 및 기지국 처리부(2005, 또는 기지국 제어부 또는 프로세서)를 포함할 수 있다. 전술한 기지국의 통 신 방법에 따라, 기지국의 송수신부(2000, 2010), 메모리 및 기지국 처리부 가 동작할 수 있다. 다만, 기 지국의 구성 요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 기지국은 기지국 수신부, 기지국 송 신부, 메모리 및 기지국 처리부 보다 더 많은 구성 요소를 포함하거나 더 적은 구성 요소를 포함할 수도 있다. 뿐만 아니라 송수신부(2000, 2010), 메모리, 및 프로세서가 하나의 칩(chip) 형태로 구현될 수도 있다. 송수신부(2000, 2010)는 단말과 신호를 송수신할 수 있다. 여기에서, 신호는 제어 정보 및 데이터를 포함할 수 있다. 이를 위해, 송수신부(2000, 2010)는 전송되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신 되는 신호를 저 잡음 증폭하고 주파수를 하강 변환하는 RF 수신기 등으로 구성될 수 있다. 다만, 이는 송수신부 (2000, 2010)의 일 실시예에 불과할 뿐, 송수신부(2000, 2010)의 구성 요소가 RF 송신기 및 RF 수신기에 한정되 는 것은 아니다. 또한, 송수신부(2000, 2010)는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서 로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 메모리는 기지국의 동작에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 기지국이 송수신하는 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 롬(ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들의 조합으로 구성될 수 있다. 또한, 메모리는 복수 개일 수 있다. 프로세서는 본 개시의 실시예에 따라 기지국이 동작할 수 있도록 일련의 과정을 제어할 수 있다. 예를 들 어, 프로세서는 복수의 PDSCH에 대한 할당 정보를 포함하는 두 가지 계층의 DCI들을 구성하고 이를 전송 하기 위해 기지국의 각 구성 요소를 제어할 수 있다. 프로세서는 적어도 하나의 프로세서로 구성될 수 있 으며, 프로세서는 메모리에 저장된 프로그램을 실행함으로써 기지국의 구성 요소 제어 동작을 수행할 수 있다. 다양한 실시 예들에 따르면, 무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위한 단말의 방법에 있어서, 제어 채널(control channel)과 관련된 설정 정보를, 기지국으로부터, 수신하는 단계; 상기 제어 채널과 관련된 설정 정보는: 제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간(search space) 정보, 및 제2 제어 자원 세트 정보 및 제2 탐색 공간 정보를 포함하고, 상기 제어 채널과 관련된 설정 정보에 기반하여, PDCCH(physical downlink control channel) 반복 전송(repetition transmission)에 대한 신호를, 상 기 기지국으로부터, 수신하는 단계를 포함하고, 상기 제1 탐색 공간 정보는 주파수 위치와 관련된 제1 비트맵을 포함하고, 상기 제2 탐색 공간 정보는 주파수 위치와 관련된 제2 비트맵을 포함하는 것일 수 있다. 다양한 실시 예들에 따르면, 무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위한 단말의 장치에 있어서, 송수신기(transceiver); 및 상기 송수신기와 연결된 적어도 하나의 프로세서(at least one processor)를 포함하고, 상기 적어도 하나의 프로세서는: 제어 채널(control channel)과 관련된 설정 정보를, 기지국으로부터, 수신하고; 상기 제어 채널과 관련된 설정 정보는: 제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간(search space) 정보, 및 제2 제어 자원 세트 정보 및 제2 탐색 공간 정보를 포함하고, 상기 제어 채널과 관련된 설정 정보에 기반하여, PDCCH(physical downlink control channel) 반복 전송 (repetition transmission)에 대한 신호를, 상기 기지국으로부터, 수신하도록 구성되고, 상기 제1 탐색 공간 정보는 주파수 위치와 관련된 제1 비트맵을 포함하고, 상기 제2 탐색 공간 정보는 주파수 위치와 관련된 제2 비트 맵을 포함하는 것일 수 있다. 다양한 실시 예들에 따르면, 무선 통신 시스템에서, 제어 정보(control information)의 송수신을 위한 기지국의 방법에 있어서, 제어 채널(control channel)과 관련된 설정 정보를, 단말에게, 송신하는 단계; 상기 제어 채널 과 관련된 설정 정보는: 제1 제어 자원 세트(control resource set) 정보 및 제1 탐색 공간(search space) 정 보, 및 제2 제어 자원 세트 정보 및 제2 탐색 공간 정보를 포함하고, 상기 제어 채널과 관련된 설정 정보에 기 반하여, PDCCH(physical downlink control channel) 반복 전송(repetition transmission)에 대한 신호를, 상기 단말에게, 송신하는 단계를 포함하고, 상기 제1 탐색 공간 정보는 주파수 위치와 관련된 제1 비트맵을 포함하고, 상기 제2 탐색 공간 정보는 주파수 위치와 관련된 제2 비트맵을 포함하는 것일 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근 (access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치 는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 발명에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편, 본 명세서와 도면에 개시된 본 개시의 실시 예들은 본 개시의 기술 내용을 쉽게 설명하고 본 개시의 이해 를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 개시의 범위를 한정하고자 하는 것은 아니다. 즉 본 개시의 기 술적 사상에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 개시의 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명한 것이다. 또한 상기 각각의 실시 예는 필요에 따라 서로 조합되어 운용할 수 있다. 예컨대, 본 개시의 일 실시 예와 다른 일 실시 예의 일부분들이 서로 조합되어 기지국과 단말이 운용될 수 있다. 예를 들면, 본 개시의 제1 실시 예와 제2 실시 예의 일부분들이 서로 조합되어 기지국과 단말이 운용될 수 있다. 또 한 상기 실시 예들은 FDD LTE 시스템을 기준으로 제시되었지만, TDD LTE 시스템, 5G 혹은 NR 시스템 등 다른 시 스템에도 상기 실시 예의 기술적 사상에 바탕을 둔 다른 변형예들이 실시 가능할 것이다. 한편, 본 발명의 방법을 설명하는 도면에서 설명의 순서가 반드시 실행의 순서와 대응되지는 않으며, 선후 관계 가 변경되거나 병렬적으로 실행될 수도 있다. 또는, 본 발명의 방법을 설명하는 도면은 본 발명의 본질을 해치지 않는 범위 내에서 일부의 구성 요소가 생략 되고 일부의 구성요소만을 포함할 수 있다. 또한, 본 발명의 방법은 발명의 본질을 해치지 않는 범위 내에서 각 실시예에 포함된 내용의 일부 또는 전부가 조합되어 실행될 수도 있다. 본 개시의 다양한 실시예들이 전술되었다. 전술한 본 개시의 설명은 예시를 위한 것이며, 본 개시의 실시예들은"}
{"patent_id": "10-2022-0049935", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "개시된 실시예들에 한정되는 것은 아니다. 본 개시가 속하는 기술분야의 통상의 지식을 가진 자는 본 개시의 기 술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 본 개시의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청 구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5a 도면5b 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14a 도면14b 도면15 도면16 도면17 도면18 도면19 도면20"}
{"patent_id": "10-2022-0049935", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시예에 따른 무선 통신 시스템에서 시간-주파수영역의 기본 구조를 도시한 도면이다. 도 2는 본 개시의 실시예에 따른 무선 통신 시스템에서 프레임, 서브프레임, 슬롯 구조를 도시한 도면이다. 도 3은 본 개시의 실시예에 따른 무선 통신 시스템에서 대역폭부분 설정의 일 예를 도시한 도면이다. 도 4는 본 개시의 실시예에 따른 무선 통신 시스템에서 하향링크 제어 채널의 제어 영역 설정의 일 예를 도시한 도면이다. 도 5a는 본 개시의 실시예에 따른 무선 통신 시스템에서 하향링크 제어 채널의 구조를 도시한 도면이다. 도 5b는 본 개시의 실시예에 따른 무선 통신 시스템에서 단말이 슬롯 내에서 복수 개의 PDCCH 모니터링 위치를 가질 수 있는 경우를 Span을 통해 도시한 도면이다. 도 6는 본 개시의 실시예에 따른 무선 통신 시스템에서 DRX 동작의 일 예를 도시한 도면이다. 도 7는 본 개시의 실시예에 따른 무선 통신 시스템에서 TCI state 설정에 따른 기지국 빔 할당의 일 예를 도시 하는 도면이다. 도 8은 본 개시의 실시예에 따른 무선 통신 시스템에서 PDCCH에 대한 TCI state 할당 방법의 일 예를 도시한 도 면이다. 도 9는 본 개시의 실시예에 따른 무선 통신 시스템에서 PDCCH DMRS를 위한 TCI indication MAC CE 시그널링 (signaling) 구조를 도시하는 도면이다. 도 10은 본 개시의 실시예에 따른 무선 통신 시스템에서 제어 자원 세트 및 탐색 공간의 빔 설정 예시를 도시하 는 도면이다. 도 11은 본 개시의 실시예에 따른 무선 통신 시스템에서 기지국 및 단말이 하향링크 데이터 채널 및 레이트 매 칭 자원을 고려하여 데이터를 송수신하는 방법을 설명하기 위한 도면이다. 도 12는 본 개시의 실시예에 따른 무선 통신 시스템에서 단말이 하향링크 제어 채널 수신 시 우선순위를 고려하 여 수신 가능한 제어 자원 세트를 선택하는 방법을 설명하기 위한 도면이다. 도 13은 본 개시의 실시예에 따른 무선 통신 시스템에서 single cell, carrier aggregation, dual connectivity 상황에서 기지국과 단말의 무선 프로토콜 구조를 도시하는 도면이다. 도 14a는 본 개시의 실시예에 따른 무선 통신 시스템에서 협력 통신(cooperative communication)을 위한 안테나 포트 구성 및 자원 할당 예시를 도시하는 도면이다. 도 14b는 본 개시의 실시예에 따른 무선 통신 시스템에서 협력 통신을 위한 하향링크 제어 정보(downlink control information, DCI)의 구성에 대한 예를 도시하는 도면이다. 도 15는 본 개시의 실시예에 따른 반복 전송되는 PDCCH를 생성하는 과정을 도시한다. 도 16은 본 개시의 실시예에 따른 제어 자원 세트 설정 방법을 설명하기 위한 도면이다. 도 17은 본 개시의 실시예에 따른 비면허대역에서의 PDCCH 반복 전송에 대한 예를 도시한다. 도 18은 본 개시의 실시예에 따른 비면허대역에서의 PDCCH 반복 전송에 대한 다른 예를 도시한다. 도 19는 본 개시의 실시예에 따른 무선 통신 시스템에서 단말의 구조를 도시하는 도면이다. 도 20은 본 개시의 실시예에 따른 무선 통신 시스템에서 기지국의 구조를 도시하는 도면이다."}
