{"patent_id": "10-2019-0120034", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0037416", "출원번호": "10-2019-0120034", "발명의 명칭": "이동 통신 시스템에서 NWDAF를 활용한 서비스의 탐지 및 서비스의 특성 분석을 위한 방법 및", "출원인": "삼성전자주식회사", "발명자": "한윤선"}}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이동 통신 시스템에서 사용자 평면 기능(UPF)을 수행하는 제1 네트워크 엔티티의 방법에 있어서,네트워크 데이터 분석 기능(NWDAF)을 수행하는 제2 네트워크 엔티티로부터, 서비스 탐지(detection)를 위한 적어도 하나의 패킷의 데이터의 전송을 요청하는 요청을 수신하는 단계;상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득하는 단계; 및상기 제2 네트워크 엔티티로, 상기 적어도 하나의 패킷의 데이터를 전송하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 요청은,상기 제1 엔티티에 의해 새로운 패킷 플로우가 탐지된 경우, 상기 새로운 패킷 플로우에 포함된 적어도 하나의패킷의 데이터의 전송을 요청하는 제1 요청 또는 특정 시간 구간(period) 동안의 모든 패킷의 데이터의 전송을요청하는 제2 요청인, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 요청이 제1 요청인 경우,상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득하는 단계는,상기 제1 요청에 기초하여, 상기 새로운 패킷 플로우를 탐지하고, 상기 새로운 패킷 플로우에 포함된 적어도 하나의 패킷의 데이터를 획득하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 제1 요청은,상기 제1 요청과 연관된 식별 정보, 전송될 패킷의 수를 지시하는 정보, 또는 상기 패킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제1 요청은,특정 트래픽에 대한 필터 정보를 더 포함하고,상기 필터 정보는 상기 특정 트래픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별(DNAI) 정보, 단일 네트워크 슬라이스 선택공개특허 10-2021-0037416-3-보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 요청이 제2 요청인 경우,상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득하는 단계는,상기 제2 요청에 기초하여, 상기 특정 시간 구간을 식별하고, 상기 특정 시간 구간 동안의 모든 패킷의 데이터를 획득하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 제2 요청은,상기 제2 요청과 연관된 식별 정보, 상기 특정 시간 구간의 길이에 대한 정보 또는 상기 패킷의 데이터가 상기패킷의 페이로드를 포함하는지를 지시하는 정보 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제2 요청은,특정 트래픽에 대한 필터 정보를 더 포함하고,상기 필터 정보는 상기 특정 트래픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별자(DNAI) 정보, 단일 네트워크 슬라이스 선택 보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "이동 통신 시스템에서 네트워크 데이터 분석 기능(NWDAF)을 수행하는 수행하는 제1 네트워크 엔티티의 방법에있어서,제2 네트워크 엔티티로부터, 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 요청하는 요청을 수신하는 단계;상기 요청에 기초하여, 상기 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 수행하는 단계; 및상기 제2 네트워크 엔티티로, 상기 분석의 결과를 전송하는 단계를 포함하며,상기 전송 경로는 사용자 평면 기능(UPF)를 수행하는 제3 네트워크 엔티티와 상기 서비스를 제공하는 외부 서버간의 전송 경로인, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 전송 경로는 데이터 네트워크 접속 식별자(DNAI) 정보와 연관되는, 방법.공개특허 10-2021-0037416-4-청구항 11 제9항에 있어서,상기 제2 네트워크 엔티티는 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티, 정책 과금 기능(PCF)을 수행하는 네트워크 엔티티 또는 어플리케이션 기능(AF)을 수행하는 네트워크 엔티티 중 하나인, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제2 네트워크 엔티티가 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티인 경우, 상기 분석의 결과는, 상기 제2 네트워크 엔티티에 의해, 상기 제3 네트워크 엔티티를 선택하기 위해 사용되는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 제2 네트워크 엔티티가 상기 정책 과금 기능(PCF)을 수행하는 네트워크 엔티티 또는 상기 어플리케이션 기능(AF)을 수행하는 네트워크 엔티티인 경우, 상기 분석의 결과는, 상기 제2 네트워크 엔티티에 의해, 상기 서비스와 연관된 PDU 세선에 대한 데이터 네트워크 접속 식별자(DNAI) 정보를 결정하기 위해 사용되는, 방법."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "이동 통신 시스템에서 사용자 평면 기능(UPF)을 수행하는 제1 네트워크 엔티티에 있어서,송수신부; 및상기 송수신부를 제어하는 제어부를 포함하며, 상기 제어부는:네트워크 데이터 분석 기능(NWDAF)을 수행하는 제2 네트워크 엔티티로부터, 서비스 탐지(detection)를 위한 적어도 하나의 패킷의 데이터의 전송을 요청하는 요청을 수신하고,상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득하고, 및상기 제2 네트워크 엔티티로, 상기 적어도 하나의 패킷의 데이터를 전송하는, 제1 네트워크 엔티티."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 요청은,상기 제1 엔티티에 의해 새로운 패킷 플로우가 탐지된 경우, 상기 새로운 패킷 플로우에 포함된 적어도 하나의패킷의 데이터의 전송을 요청하는 제1 요청 또는 특정 시간 구간(period) 동안의 모든 패킷의 데이터의 전송을요청하는 제2 요청인, 제1 네트워크 엔티티."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제1 요청은,상기 제1 요청과 연관된 식별 정보, 전송될 패킷의 수를 지시하는 정보, 상기 패킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보, 또는, 특정 트래픽에 대한 필터 정보 중 적어도 하나를 포함하고,공개특허 10-2021-0037416-5-상기 필터 정보는 상기 특정 트래픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별(DNAI) 정보, 단일 네트워크 슬라이스 선택보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함하는, 제1 네트워크 엔티티."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 제2 요청은,상기 제2 요청과 연관된 식별 정보, 상기 특정 시간 구간의 길이에 대한 정보, 상기 패킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보, 또는 특정 트래픽에 대한 필터 정보 중 적어도 하나를 포함하고,상기 필터 정보는 상기 특정 트래픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별자(DNAI) 정보, 단일 네트워크 슬라이스 선택 보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함하는, 제1 네트워크 엔티티."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "이동 통신 시스템에서 네트워크 데이터 분석 기능(NWDAF)을 수행하는 수행하는 제1 네트워크 엔티티에 있어서,송수신부; 및상기 송수신부를 제어하는 제어부를 포함하며, 상기 제어부는:제2 네트워크 엔티티로부터, 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 요청하는 요청을 수신하고,상기 요청에 기초하여, 상기 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 수행하고, 및상기 제2 네트워크 엔티티로, 상기 분석의 결과를 전송하며,상기 전송 경로는 사용자 평면 기능(UPF)를 수행하는 제3 네트워크 엔티티와 상기 서비스를 제공하는 외부 서버간의 전송 경로인, 제1 네트워크 엔티티."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 전송 경로는 데이터 네트워크 접속 식별자(DNAI) 정보와 연관되는, 제1 네트워크 엔티티."}
{"patent_id": "10-2019-0120034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서,상기 제2 네트워크 엔티티는 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티, 정책 과금 기능(PCF)을 수행하는 네트워크 엔티티 또는 어플리케이션 기능(AF)을 수행하는 네트워크 엔티티 중 하나인, 제1 네트워크 엔티티."}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 4G 시스템 이후 보다 높은 데이터 전송률을 지원하기 위한 5G 통신 시스템을 IoT 기술과 융합하는 통 신 기법 및 그 시스템에 관한 것이다. 본 개시는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스 (예 를 들어, 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 헬스 케어, 디지털 교육, 소매업, 보안 및 안전 관련 서비스 등)에 적용될 수 있다. 본 발명의 일 실시예에 따른, 이동 통신 시스템에서 사용자 평 면 기능(UPF)을 수행하는 제1 네트워크 엔티티의 방법은 네트워크 데이터 분석 기능(NWDAF)을 수행하는 제2 네트 워크 엔티티로부터, 서비스 탐지(detection)를 위한 적어도 하나의 패킷의 데이터의 전송을 요청하는 요청을 수 신하는 단계, 상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득하는 단계, 및상기 제2 네트워크 엔티티로, 상기 적어도 하나의 패킷의 데이터를 전송하는 단계를 포함한다."}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에 대한 것으로, 구체적으로는 이동 통신 시스템 (Mobile Communication System)에 서 NWDAF (Network Data Analytic Function)을 활용하여 특정 서비스를 탐지하고 서비스 관련 특성을 분석 하 기 위한 장치와 방법에 관한 것이다."}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시 스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 4G 네트워크 이후 (Beyond 4G Network) 통신 시스템 또는 LTE 시스템 이후 (Post LTE) 시스템이라 불리어지고 있다. 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파(mmWave) 대역 (예를 들어, 60기가(60GHz) 대역과 같은)에서의 구현이 고려되고 있다. 초고주파 대역에서의 전파의 경로손실 완화 및 전파의 전달 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대 배열 다중 입 출력(massive MIMO), 전차원 다중입출력(Full Dimensional MIMO: FD-MIMO), 어레이 안테나(array antenna), 아 날로그 빔형성(analog beam-forming), 및 대규모 안테나 (large scale antenna) 기술들이 논의되고 있다. 또한 시스템의 네트워크 개선을 위해, 5G 통신 시스템에서는 진화된 소형 셀, 개선된 소형 셀 (advanced small cell), 클라우드 무선 액세스 네트워크 (cloud radio access network: cloud RAN), 초고밀도 네트워크 (ultra- dense network), 기기 간 통신 (Device to Device communication: D2D), 무선 백홀 (wireless backhaul), 이동 네트워크 (moving network), 협력 통신 (cooperative communication), CoMP (Coordinated Multi-Points), 및 수신 간섭제거 (interference cancellation) 등의 기술 개발이 이루어지고 있다. 이 밖에도, 5G 시스템에서는 진보된 코딩 변조(Advanced Coding Modulation: ACM) 방식인 FQAM (Hybrid FSK and QAM Modulation) 및 SWSC (Sliding Window Superposition Coding)과, 진보된 접속 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non orthogonal multiple access), 및SCMA(sparse code multiple access) 등이 개발되고 있다. 한편, 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 IoT(Internet of Things, 사물인터넷) 망으로 진화하고 있다. 클라우드 서버 등과 의 연결을 통한 빅데이터(Big data) 처리 기술 등이 IoT 기술에 결합된 IoE (Internet of Everything) 기술도 대두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소 들이 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 연구되고 있다. IoT 환경에서는 연결된 사물들에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능 형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(information technology)기술과 다양 한 산업 간의 융합 및 복합을 통하여 스마트홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마 트 그리드, 헬스 케어, 스마트 가전, 첨단의료서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도들이 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 5G 통 신 기술이 빔 포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처 리 기술로써 클라우드 무선 액세스 네트워크(cloud RAN)가 적용되는 것도 5G 기술과 IoT 기술 융합의 일 예라고 할 수 있을 것이다. 한편, NWDAF가 제공하는 네트워크 분석 정보를 전달할 때 발생 가능한 다양한 문제가 있고, 이를 해결하기 위한 연구가 활발히 진행되고 있다."}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 이동 통신 시스템을 통해 제공되는 다양한 서비스들(또는, 응용들)을 탐지 (detect)하기 위한 방법과 각 서비스들(또는, 응용들)의 특성을 분석하여 제공하는 방법을 포함한다. 기존 LTE를 포함하여 5G 이동 통신 시스템에서 서비스를 탐지하는 방법은 이동통신 시스템 운용자 또는 서비스 운용자가 미리 정의한 서비스 데이터 플로우를 탐지 하기 위한 규칙을 배포함으로써 이루어 진다. 특정 서비스 의 데이터가 감지 되면, 특정 서비스를 탐지 한 것으로 인식 되며 이후 QoS 요구사항과 과금과 관련된 정책이 적용 되게 된다. 이러한 과정에서 서비스를 탐지하기 위해 사용되는 방법은 사용자 데이터를 전달하는 헤더 정 보에 포함되어 있는 네트워크 주소와 같은 필드를 참조한다. 더불어, 특정 응용(application)의 탐지를 위해 UPF 또는 특정 P-GW과 같은 장치에서 헤더 매칭 및 DPI(Deep Packet Inspection)의 수행을 통해 정확한 탐지를 수행하는 규칙을 PFD (Packet Flow Description) 형태로 설정하여 수행 할 수 있다. 현재 이러한 서비스 및 응용을 탐지하는 방법은 운용자가 미리 탐지하는 규칙을 적용하거나, 외부에서 서비스 제공자가 탐지 방법을 제공하여 탐지 규칙을 PCF와 SMF를 거쳐 UPF에 배포하는 방법만이 표준화 되어 있다. 더 불어, DPI 장치와 같은 패킷 내부의 정보를 사용하여 응용을 탐지 하는 규칙은 DPI 장치를 공급하는 제조사와 망 관리자 사이의 미리 정의된 정보 교환을 통해서만 이뤄지고 있다. 따라서, 미리 정의되어 있지 않은 서비스 들에 대한 탐지를 수행할 수 없으며, 새롭게 등장하는 서비스에 관련된 트래픽 관리 정책의 적용이 불가능 하거 나 망 관리자가 수동으로 트래픽 탐지 규칙을 정의하고 관련된 PCC 정책을 설정해야 한다는 문제점이 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른, 이동 통신 시스템에서 사용자 평면 기능(UPF)을 수행하는 제1 네트워크 엔티티의 방법은, 네트워크 데이터 분석 기능(NWDAF)을 수행하는 제2 네트워크 엔티티로부터, 서비스 탐지(detection)를 위한 적어도 하나의 패킷의 데이터의 전송을 요청하는 요청을 수신하는 단계; 상기 요청에 기초하여, 상기 적어 도 하나의 패킷의 데이터를 획득하는 단계; 및 상기 제2 네트워크 엔티티로, 상기 적어도 하나의 패킷의 데이터 를 전송하는 단계를 포함할 수 있다. 실시예로서, 상기 요청은, 상기 제1 엔티티에 의해 새로운 패킷 플로우가 탐지된 경우, 상기 새로운 패킷 플로 우에 포함된 적어도 하나의 패킷의 데이터의 전송을 요청하는 제1 요청 또는 특정 시간 구간(period) 동안의 모 든 패킷의 데이터의 전송을 요청하는 제2 요청일 수 있다. 실시예로서, 상기 요청이 제1 요청인 경우, 상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득하 는 단계는, 상기 제1 요청에 기초하여, 상기 새로운 패킷 플로우를 탐지하고, 상기 새로운 패킷 플로우에 포함 된 적어도 하나의 패킷의 데이터를 획득하는 단계를 포함할 수 있다. 실시예로서, 상기 제1 요청은, 상기 제1 요청과 연관된 식별 정보, 전송될 패킷의 수를 지시하는 정보, 또는 상 기 패킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보 중 적어도 하나를 포함할 수 있다. 실시예로서, 상기 제1 요청은, 특정 트래픽에 대한 필터 정보를 더 포함하고, 상기 필터 정보는 상기 특정 트래 픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별 정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별(DNAI) 정보, 단일 네트워크 슬라이스 선택 보조(S-NSSAI) 정보 또는 시간 정 보 중 적어도 하나를 포함할 수 있다. 실시예로서, 상기 요청이 제2 요청인 경우, 상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득하 는 단계는, 상기 제2 요청에 기초하여, 상기 특정 시간 구간을 식별하고, 상기 특정 시간 구간 동안의 모든 패 킷의 데이터를 획득하는 단계를 포함할 수 있다. 실시예로서, 상기 제2 요청은, 상기 제2 요청과 연관된 식별 정보, 상기 특정 시간 구간의 길이에 대한 정보 또 는 상기 패킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보 중 적어도 하나를 포함할 수 있 다. 실시예로서, 상기 제2 요청은, 특정 트래픽에 대한 필터 정보를 더 포함하고, 상기 필터 정보는 상기 특정 트래 픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별 정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별자(DNAI) 정보, 단일 네트워크 슬라이스 선택 보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함할 수 있다. 본 발명의 일 실시예에 따른, 이동 통신 시스템에서 네트워크 데이터 분석 기능(NWDAF)을 수행하는 수행하는 제 1 네트워크 엔티티의 방법은 제2 네트워크 엔티티로부터, 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 요청하는 요청을 수신하는 단계; 상기 요청에 기초하여, 상기 서비스에 대한 전송 경로 별 네트워크 성능의 분 석을 수행하는 단계; 및 상기 제2 네트워크 엔티티로, 상기 분석의 결과를 전송하는 단계를 포함하며, 상기 전 송 경로는 사용자 평면 기능(UPF)를 수행하는 제3 네트워크 엔티티와 상기 서비스를 제공하는 외부 서버 간의 전송 경로일 수 있다. 실시예로서, 상기 전송 경로는 데이터 네트워크 접속 식별자(DNAI) 정보와 연관될 수 있다. 실시예로서,상기 제2 네트워크 엔티티는 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티, 정책 과금 기능 (PCF)을 수행하는 네트워크 엔티티 또는 어플리케이션 기능(AF)을 수행하는 네트워크 엔티티 중 하나일 수있다. 실시예로서,상기 제2 네트워크 엔티티가 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티인 경우, 상기 분석의 결과는, 상기 제2 네트워크 엔티티에 의해, 상기 제3 네트워크 엔티티를 선택하기 위해 사용될 수 있다. 실시예로서, 상기 제2 네트워크 엔티티가 상기 정책 과금 기능(PCF)을 수행하는 네트워크 엔티티 또는 상기 어 플리케이션 기능(AF)을 수행하는 네트워크 엔티티인 경우, 상기 분석의 결과는, 상기 제2 네트워크 엔티티에 의 해, 상기 서비스와 연관된 PDU 세선에 대한 데이터 네트워크 접속 식별자(DNAI) 정보를 결정하기 위해 사용될 수 있다. 본 발명의 일 실시예에 따른, 이동 통신 시스템에서 사용자 평면 기능(UPF)을 수행하는 제1 네트워크 엔티티는 송수신부; 및 상기 송수신부를 제어하는 제어부를 포함하며, 상기 제어부는: 네트워크 데이터 분석 기능(NWDA F)을 수행하는 제2 네트워크 엔티티로부터, 서비스 탐지(detection)를 위한 적어도 하나의 패킷의 데이터의 전 송을 요청하는 요청을 수신하고, 상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득하고, 및 상 기 제2 네트워크 엔티티로, 상기 적어도 하나의 패킷의 데이터를 전송할 수 있다. 실시예로서, 상기 요청은, 상기 제1 엔티티에 의해 새로운 패킷 플로우가 탐지된 경우, 상기 새로운 패킷 플로 우에 포함된 적어도 하나의 패킷의 데이터의 전송을 요청하는 제1 요청 또는 특정 시간 구간(period) 동안의 모 든 패킷의 데이터의 전송을 요청하는 제2 요청일 수 있다. 실시예로서, 상기 제1 요청은, 상기 제1 요청과 연관된 식별 정보, 전송될 패킷의 수를 지시하는 정보, 상기 패 킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보, 또는, 특정 트래픽에 대한 필터 정보 중 적어도 하나를 포함하고, 상기 필터 정보는 상기 특정 트래픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별 정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별(DNAI) 정보, 단일 네트워크 슬라이스 선택 보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함할 수 있다. 실시예로서, 상기 제2 요청은, 상기 제2 요청과 연관된 식별 정보, 상기 특정 시간 구간의 길이에 대한 정보, 상기 패킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보, 또는 특정 트래픽에 대한 필터 정 보 중 적어도 하나를 포함하고, 상기 필터 정보는 상기 특정 트래픽과 연관된, 단말의 식별 정보, 단말의 그룹 에 대한 정보, PDU 세션의 식별 정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별자(DNAI) 정 보, 단일 네트워크 슬라이스 선택 보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함할 수 있다. 본 발명의 일 실시예에 따른, 이동 통신 시스템에서 네트워크 데이터 분석 기능(NWDAF)을 수행하는 수행하는 제 1 네트워크 엔티티는 송수신부; 및 상기 송수신부를 제어하는 제어부를 포함하며, 상기 제어부는: 제2 네트워크 엔티티로부터, 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 요청하는 요청을 수신하고, 상기 요청에 기 초하여, 상기 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 수행하고, 및 상기 제2 네트워크 엔티티로, 상기 분석의 결과를 전송하며, 상기 전송 경로는 사용자 평면 기능(UPF)를 수행하는 제3 네트워크 엔티티와 상 기 서비스를 제공하는 외부 서버 간의 전송 경로일 수 있다. 실시예로서, 상기 전송 경로는 데이터 네트워크 접속 식별자(DNAI) 정보와 연관될 수 있다. 실시예로서,상기 제2 네트워크 엔티티는 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티, 정책 과금 기능 (PCF)을 수행하는 네트워크 엔티티 또는 어플리케이션 기능(AF)을 수행하는 네트워크 엔티티 중 하나일 수 있다."}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이동 통신 망을 통해 제공되는 서비스 및 응용의 수는 시간이 지남에 따라 기하 급수적으로 증가하고 있으며, 이들 서비스가 요구하는 네트워크 품질 및 성능 관련 요구사항은 상이 하다. 특정 서비스를 위한 네트워크 품질 및 성능을 차별화 하여 제공하기 위해서 먼저 서비스의 탐지 및 서비스가 요구하는 품질 및 성능 요구사항을 명 확히 파악할 필요가 있다. 그러나, 종래의 방법은 새롭게 등장하거나 특정 고정된 주소를 사용하지 않는 경우 응용의 탐지 및 그 특성의 파악이 어렵거나 불가능하며, 이러한 차별화 기능을 제공하기 위해서는 많은 인자들 을 수동으로 설정해야 한다. 본 개시의 다양한 실시 예들은 특정 서비스를 탐지 하는 방법을 학습하고, 이러한 방법을 인자화(Augmentatio n)하여 코어 망을 구성하는 엔티티들에게 전달 한다. 이러한 과정을 통해 특정 서비스의 네트워크 품질 및 서비 스 요구사항의 적용을 자동화하여 새롭게 등장 하는 서비스 또는 동적으로 위치 또는 설정이 바뀌는 서비스들이요구하는 네트워크 품질 및 성능 요구사항을 자동적으로 차별화하여 제공할 수 있다. 더불어 특정 악성 또는 불 법적인 서비스들의 제공하는 패킷을 자동적으로 탐지하여 차단하는 기능을 수행할 수도 있는 방법을 제공한다. 이를 통해 망을 관리하는 입장에서 서비스 차별화를 위한 과정을 자동화 및 다각화 하여 제공하여 전체적인 네 트워크 서비스의 품질을 향상 하는 효과를 가져올 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시 예를 첨부된 도면을 참조하여 상세하게 설명한다. 실시예를 설명함에 있어서 본 개시가 속하는 기술 분야에 익히 알려져 있고 본 개시와 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 개시의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시가 완전하도록 하고, 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행 될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가 능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들 을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이 때, 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA또는 ASIC과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아 니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재 생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성 요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저 들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공 되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 본 개시의 실시 예들을 구체적으로 설명함에 있어서, 이동통신 규격 표준화 단체인 3GPP가 명세하고 있는 5G 이 동통신 규격 상의 무선 접속망 New RAN (NR)과 코어 망인 패킷 코어 (5G System, 혹은 5G Core Network, 혹은 NG Core: Next Generation Core)를 주된 대상으로 하지만, 본 개시의 주요한 요지는 유사한 기술적 배경을 가지 는 여타의 통신 시스템에도 본 개시의 범위를 크게 벗어 나지 아니 하는 범위에서 약간의 변형으로 적용 가능하 며, 이는 본 개시의 기술 분야에서 숙련된 기술적 지식을 가진 자의 판단으로 가능 할 것이다. 이하 설명의 편의를 위하여, 3GPP(3rd Generation Partnership Project Long Term Evolution) 규격(5G, NR, LTE 또는 이와 유사한 시스템의 규격)에서 정의하고 있는 용어 및 명칭들이 일부 사용될 수 있다. 하지만, 본 개시가 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 시스템에도 동일하게 적용될 수 있다. 또한 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity, 네트워크 엔티 티)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 네트워크 엔티티들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시에서 사용하는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 본 개시는 5G 이동 통신 시스템의 핵심망 요소 중 하나인 NWDAF(Network Data Analytic Function)의 기능을 확 장 하여, UPF (User Plane Function) 또는 NWDAF 자체에서 보다 정확한 서비스 또는 응용 (이하 서비스) 의 탐 지를 지원하는 방법과 탐지된 서비스가 요구하는 네트워크 품질 및 성능 요구사항을 분석하는 방법을 포함한다. 이를 통해 5G 시스템은 단말(UE)와 DN (Data Network) 사이에 네트워크 서비스를 제공함에 있어서, 보다 정확한 서비스의 구별을 통해 차별화된 성능과 품질을 제공할 수 있다. 각 서비스가 필요로 하는 일반적인 수준의 성능 과 품질 정보를 추가적으로 제공함으로써 한정적인 네트워크 자원을 관리 함에 있어, 관리를 최적화 하는 방법을 제공 할 수 있다. 더불어, 서비스의 내용에 따라 불법적이거나 악의적인 내용을 포함하는 경우 내부 정책의 결정으로 서비스의 이용을 제한 하거나 금지하는 방법을 보다 빠르고 정확하게 서비스 단위로 적용 할 수 있다. 5G 이동 통신 시스템은 네트워크 자동화 지원을 위해서 5G 네트워크 망에서 수집된 데이터를 분석하여 제공하는 기능을 제공하는 네트워크 기능(Network Function: NF)인 NWDAF를 정의 하였다. NWDAF는 5G 네트워크로부터 정 보를 수집/저장/분석하여 결과를 불특정 NF에게 제공할 수 있으며, 분석 결과는 각 NF, AF (Application Function) 및 OAM (Operation, Administration and Management)에서 독립적으로 이용할 수 있다. 기존 NWDAF가 제공하는 분석 정보에는 슬라이스 부하 정보, 단말의 이동성/통신 패턴, 특정 NF의 부하 정보, 네트워크 상태 정보 등이 포함된다. 본 개시에서는 NWDAF가 제공하는 서비스 종류를 확장하여 특정 서비스에 대한 분석 정보를 제공하는 것을 포함한다. 서비스에 관련된 분석 정보는 특정 서비스의 개시 여부, 특정 서비스의 PDU세션 개수, 특정 서비스를 이용하는 단말의 개수, 특정 서비스 지원을 위한 DNN (Data Network Name) 및 DNAI (Data Network Access Identifier) 위치 등을 포함한다. 이러한 분석 정보는 관련 정보에 기계 학습 또는 수학적 모델 링 도구를 통해서 유추하거나 예측을 하는 기법을 적용하여 획득될 수 있다. 본 개시에서는 NWDAF가 제공하는 네트워크 분석 정보를 외부에 위치한 엣지 컴퓨팅 관리 개체에게 전달하는 방 법으로써, NEF를 통해 정보가 전달 되는 경우를 기본 상황으로 가정한다. 추가적으로 또는 대체적으로, 신뢰할 수 있는 서비스 제공자로부터 엣지 컴퓨팅이 제공될 경우, 핵심망 내부에 위치한 NWDAF가 제공하는 서비스의 활 용에 있어 NEF를 거치지 아니하고 직접적으로 서비스를 요청 할 수도 있다. 본 개시에 등장하는 엔티티(Entity)들의 설명은 이하와 같이 설명될 수 있다. 5G 네트워크 시스템이 제공하는 각 기능들을 수행하는 단위는 NF(Network Function, 네트워크 기능)로 정의될 수 있다. 5G 이동통신 네트워크의 구조는 도 1에 예시적으로 도시되어 있다. 도 1은 본 발명의 실시예에 따른 통신 시스템의 구성을 나타낸다. 도 1에서, 통신 시스템은 5G 이동 통신 시스 템 및 망 외부에서 서비스를 제공하는 서비스 제공자를 포함하는 개념일 수 있다. 도 1을 참조하면, 통신 시스템은 적어도 하나의 엔티티를 포함한다. 예컨대, 통신 시스템은 단말(UE), 기지국 (RAN) 및/또는 적어도 하나의 NF을 포함할 수 있다. 예를 들면, 통신 시스템은 단말(UE, User Equipment)의 네 트워크 접근과 이동성을 관리 하는 AMF(Access and Mobility Management Function), 세션과 관련된 기능을 수 행하는 SMF(Session Management Function), 사용자 데이터의 전달을 담당하는 UPF(User Plane Function), 제공 을 위해 5GC와 통신하는 AF (Application Function), 5GC와 AF 사이의 통신을 지원 하는 NEF (Network Exposure Function), 데이터 저장 및 관리를 위한 UDM (Unified Data Management)과 UDR (Unified Data Repository), 정책을 관리 하는 PCF (Policy and Control Function), 및/또는 사용자 데이터가 전달되는 인터 넷과 같은 DN (Data Network)을 포함할 수 있다. 각 엔티티의 구성과 기능에 대하여 예시적으로, 구체적으로 설 명하면, 이하와 같다. (R)AN (Radio Access Network)은 5G-NR, E-UTRAN, UTRAN, GERAN등과 같이 기지국과 단말 사이에 무선 통 신을 위해 사용되는 기술 지칭하며, 단말은 무선 통신을 위해서 이동 통신 무선 기술을 지원하는 기지국으로 eNB 혹은 gNB에 접속 하여 통신 서비스를 받는다. 기지국은 단말들로부터 전송 받은 제어 신호 혹은 데이터를 핵심망과 상호작용하여 핵심망에 위치하고 있는 장치로 전송하여 설정을 받거나, 데이터를 송수신 하거나, 관리 를 위한 절차들을 수행할 수 있다. 이외에도 단말은 기지국과 연결되지 않고 단말과 단말 사이 직접적인 통신을 수행하는 Prose (Proximity Service)와 같은 사이드 링크를 이용하는 기술 또는 WiFi, Bluetooth와 같은 Non- 3GPP 무선 접속 기술을 활용하여 데이터 네트워크와 연결될 수 있다. AMF (Access and Mobility Management Function)는 단말의 접근(Access)와 이동성(Mobility)을 관리 하기 위한 장치로써 단말이 RAN을 거처 핵심망의 다른 장치들과 연결 하는 단말-핵심망 종점 역할을 수행한다. 제공하는 기능으로는 단말의 등록 (Registration), 연결 (Connection), 연결성 (Reachability), 이동성 (Mobility) 관리, 접근 확인/인증, 이동성 이벤트 생성 등과 같은 기능을 수행한다. SMF (Session Management Function)은 단말의 PDU 세션의 관리 기능을 수행한다. 세션의 수립, 수정, 해제와 이에 필요한 UPF와 AN 사이의 터널 유지를 통한 세션 관리 기능, 단말의 IP주소 할당과 관리 기능, ARP Proxy 기능, 사용자 평면 (User Plane) 선택 및 제어, UPF에서 트래픽 프로세싱 제어, 과금 데이터 수집 제어 등과 같 은 기능들을 수행한다. PCF (Policy Control Function)은 AMF 및 SMF에서 적용하는 접근/이동성, 세션 관리에 정책을 결정하여 내려주 는 역할을 수행한다. 전체 네트워크의 행동을 관리(govern) 하며, 제어 평면을 구성하는 NF(Network Function)들에게 이행하여야 할 정책들을 제공한다. 더불어 UDR(Unified Data Repository)에 접근하여 정책 결정에 관련 된 정보들에 접근 할 수 있다. NEF (Network Exposure Function)은 이동통신 망에서 발생하는 이벤트 및 지워 하는 기능 (Capability)를 외부 로 전달 또는 수신하는 기능을 담당한다. 대표적으로, 핵심망에 외부 응용의 정보를 안전하게 프로비저닝하는 기능, 내부/외부 정보의 변환, 다른 NF로부터 받은 기능을 UDR에 저장 후 재 배포 등과 같은 기능을 수행한다. UDM (Unified Data Management)와 UDR (Unified Data Repository)는 독립적인 네트워크 기능이나, 본 실시예에 서 그 기능과 역할이 유사하게 사용되어 동시에 서술한다. UDM은 3GPP 보안을 위한 AKA 인증 정보의 생성, 사용 자 식별자(User ID)의 처리, 보안된 사용자 식별자(Subscriber Concealed ID, SUPI)의 역은폐, 현재 UE를 지원 하는 NF의 목록 관리, 가입자 정보 (subscription) 관리, 단문(SMS) 관리 등을 수행한다. UDR은 UDM이 관리하는 가입자 정보, 노출을 위한 구조화된 데이터, NEF 또는 서비스와 연관된 응용 데이터들의 저장 및 제공 기능을 수행한다. UPF (User Plane Function)은 실제 사용자 데이터를 처리하는 역할을 수행하며, 외부의 데이터 네트워크로 단말 이 생성한 패킷을 전달 하거나 외부 데이터 네트워크에서 유입된 데이터를 단말에게 전달할 수 있도록 패킷을 처리하는 역할을 수행한다. 주요 기능으로는 무선 접속 기술 (Radio Access Technology) 간 앵커(Anchor) 역할 수행, PDU 세션과 외부 데이터 네트워크와 연결성 제공, 패킷 라우팅 및 포워딩, 패킷 검사(inspection), 사용 자 평면 정책 적용, 트래픽 사용 보고서 작성, 버퍼링 등과 같은 역할을 수행한다. NF외에 단말 및 5G 이동통신 네트워크를 관리 하기 위한 시스템인 OAM (Operation, Administration, and Management)가 존재 할 수 있다. 이외에 5G 네트워크 시스템의 구성요소는 아니지만 서비스 제공을 하기 위한 외부 개체로써 엣지 컴퓨팅 인프라, 인프라 관리자, 및 서비스가 포함될 수 있다. 엣지 컴퓨팅 인프라 관리자는 엣지 컴퓨팅 인프라에 존재하는 자원을 관리 하는 역할을 수행하는 개체로써, 독립적인 개체로 존재하거나 특정 서비스 또는 플랫폼 상에 존재하여 동일한 기능을 수행하는 개체를 지칭한다. 본 개시에서는 엣지 컴퓨팅 인프 라 관리자가 NEF를 통해 5G 핵심망과 정보를 교환 할 수 있는 상황을 가정하며, 예컨대, 엣지 컴퓨팅 인프라 관 리자는 AF와 동일하거나 AF와 연결되어 핵심망과 정보 교환이 가능하다. 이러한 엔티티들 사이의 관계는 도 1에 도시되어 있다. 도 1에서 OAM과의 통신의 경우 표준화된 인터페이스를 사용하지 않으므로 생략되어 있으나, OAM 은 자체적인 방법으로 5G 이동 통신 시스템의 모든 개체와 통신이 가능하다고 볼 수 있다. 서비스 제공자의 구 성 또한 서비스에 따라 상이 할 것이나, 서비스를 실제 제공하는 서버의 역할을 하는 노드와 이러한 서버들을 관리하는 자원 관리자 (Resource Manager) 또는 조율자 (Orchestrator)와 같은 관리 노드로 구별 될 수 있다. 이러한 노드들의 명확한 구별이 서비스에 따라 존재 하지 않을 수 있으나, 논리적으로 이러한 구분이 가능할 수 도 있다. NWDAF는 NF에게 네트워크 또는 외부에서 수집된 정보를 분석 하여 제공하는 기능을 담당한다. NWDAF는 OAM(Operation, Administration, and Maintenance), 5G 네트워크를 구성하는 NF, 또는 AF로부터 정보를 수집 할 수 있다. NWDAF는 다양한 방법으로 정보를 수집할 수 있다. NWDAF의 대표적인 분석 기능으로는 네트워크 슬 라이스 인스턴스(Network Slice Instance)의 부하 정도(load level)를 수집 및 분석 하여, NSSF (Network Slice Selection Function)에게 특정 UE가 이용할 수 있도록 선택 하는데 이용할 수 있도록 제공 할 수 있다. 이때, 특정 NF와 NWDAF 사이에 분석 정보를 요청하거나 분석 결과 값을 전달하기 위해, 5G 네트워크에서 정의한 서비스 기반 인터페이스 (Service based Interface)가 사용될 수 있다. 5G 네트워크에서는 정보의 수집 및 분석 기능을 제공하는 NWDAF가 하기의 서비스를 제공 할 수 있다. 다만, NWDAF가 제공하는 서비스는 하기 예시에 제한되지 않는다. 분석 정보 구독 서비스(Nnwdaf_AnalyticsSubscription Service): 본 명세서에서, 분석 정보 구독 서비스는 Nnwdaf_AnalyticsSubscription 서비스 또는 이벤트 구독 서비스로 지칭될 수도 있다. 분석 정보 구독 서비스(또는, 이벤트 구독 서비스)는 NWDAF에서 생성되는 이벤트를 구독(Subscription)과 해제 (Ubsubscription) 할 수 있도록 하는 것으로, 이벤트 구독 서비스는 주기적으로 이벤트를 받거나 특정 조건이 만족 될 경우 이벤트를 받도록 하는 방법으로 세분화 될 수 있다. 분석 정보 구독 서비스에는 구독(Subscribe), 구독 해제 (Unsubscribe), 통지(Notify)의 3가지 동작(Operation)을 제공한다. 특정 NF가 구독(Nnwdaf_AnlayticsSubscription) 을 원할 경우, 특정 NF가 NWDAF에게 통해 전달 하는 인자는 필 수 입력(Inputs required), 선택적 입력 (Inputs, Optional) 인자로 구분 될 수 있다. 일 실시예에 따르면, 필 수 입력은 단일 네트워크 슬라이스 선택 보조 정보(S-NSSAI(Single Network Slice Selection AssistanceInformation), 이벤트 식별자(Event Identifier), 통지 목적지 주소(Notification Target Address), 및/또는 이벤트 보고 정보(Event reporting information)을 포함할 수 있다. 다만, 필수 입력이 상기 예시에 제한되는 것은 아니다. 또한, 일 실시예에 따르면, 선택적 입력은 분석 정보 처리에 부가적으로 필요한 적어도 하나의 정 보를 포함 할 수 있다. 예를 들면, 선택적 입력은 이벤트 필터(Event filter) 정보를 포함 할 수 있다. 다만, 선택적 입력이 상기 예시에 제한되는 것은 아니다. 구독 해제 동작(Nnwdaf_AnlayticsSubscription_Unsubscribe)의 경우에. NF는 필수적인 입력(필수 입력)으로 구 독 식별자 정보를 NWDAF에게 전달하며, NWDAF는 출력으로 구독 해제가 확인되었음을 알려주는 전문을 동작을 요 청한 NF 에게 전달 한다. 통지 동작(Nnwdaf_AnlayticsSubscription_Notify)은 NWDAF가 성공적으로 이벤트를 구독 중인 NF에게 주기적으 로 혹은 특정 조건이 만족 시 특정 이벤트에 대해 통지를 하는 것이다. 일 실시예에 따르면, 통지 동작의 필수 입력 정보(필수 입력)는, 이벤트 식별자(Event Identifier), 통지 목적지 주소(Notification Target Address), 네트워크 슬라이스 인스턴스 식별자(Identifier of Network Slice Instance), 및/또는 네트워크 슬라이스 인스 탄스의 부하 정보(Load level information of network slice instance)을 포함할 수 있으며, 필수 출력 정보 (필수 출력)는 없을 수 있다. 다만, 필수 입력 및/또는 필수 출력의 예가 상기 예시로만 제한되는 것은 아니다. 분석 정보 요청 서비스 (Nnwdaf_AnalyticsInfo service): 본 명세서에서, 분석 정보 요청 서비스는 Nnwdaf_AnalyticsInfo 또는 분석 요청 서비스로 지칭될 수도 있다. 분석 요청 서비스는 상술한 이벤트 구독 서비스와 달리, NF가 특정 정보에 대한 분석을 요청하고 요청이 완료되 는 즉시 결과값을 전달 받는 서비스를 의미할 수 있다. 분석 정보 요청 서비스에서 지원하는 동작은 요청 (Request)과 응답(Response)으로 이루어 진다. 분석 정보를 요청하는 NF는 NWDAF에게 분석 정보 요청을 보낼 수 있다. 예를 들면, NF는 분석 정보 요청의 필수 입력으로 네트워크 슬라이스 인스턴스 네트워크 부하 정보 (Load level information of network slice instance), 분석 식별자(Analytic ID)와 분석에 필요한 부가적인 인자들을 NWDAF에게 제공할 수 있다. NWDAF는 NF로부터 요청을 받았을 시, 분석 결과를 NF에게 응답으로 보내게 된다. 응 답에는 요청된 슬라이스의 부하 정보가 포함될 수 있다. 한편, 3GPP의 Rel-15 정의에 따르면 NWDAF가 제공하는 서비스를 통하여 제공되는 분석 정보로는 네트워크 슬라 이스의 인스턴스의 부하 정보만이 고려되고 있으나, 본 개시에서 NWDAF가 제공하는 정보는 부하 정보만으로 한 정되지 않으며, 단말의 이동 정보, 단말/서비스의 통신 패턴 (Communication Pattern), 단말 서비스의 예측 경 로 (Expected moving trajectory), 단말 행동 관련 인자 (Expected UE behavioral parameter), 예측 서비스 품 질/경험 (Expected QoS, Service Experience), 및/또는 예상 네트워크 성능 정보 (Network Performance) 등이 포함 될 수 있다. 한편, 기존의 5G 이동 통신 시스템에서 서비스의 탐지 방법은 크게 2가지로 나눌 수 있다. 첫번째 방법은 AF 또 는 내부 정책에 따라서 SDF (Service Data Flow) Template에 서비스 플로우를 탐지 할 수 있는 헤더 매칭 정보 를 포함 시키는 것이다. 두번째 방법은 AF가 제공한 특정 서비스를 탐지 할 수 있는 PFD (Packet Flow Description)을 사용하는 방법으로, 이때 PFD는 PCC규칙과 같은 특정 서비스를 제어 하는 방법을 포함하지 않고, 순수하게 서비스를 탐지 하는 방법만을 포함한다. PFD를 통해 탐지된 서비스는 PCF의 PCC 규칙이나 QoS 규칙에서는 application identifier와 같은 구별자로 표현된다. 실제 UPF와 같은 서비스 트래픽을 탐지 하는 엔 티티에서는 제공받은 PFD와 application identifier와 같은 조합을 통해 실제 적용해야 하는 PCC 규칙을 적용하 게 된다. 두가지 방법 모두가 가지는 한계는 특정 서비스를 탐지하는 규칙을 외부에 위치하는 AF 또는 망 운용 자가 수동으로 설정을 해주어야 하는 단점을 가지고 있다. 하지만, 모든 서비스에 대해서 이러한 탐지 규칙을 수동으로 설정하거나 모든 서비스 제공자가 이러한 정보를 이동통신 시스템에 제공 하는 상황을 기대하는 것은 어렵다. 따라서, 이러한 탐지 방법이 적용되지 않는 서비스들은 그 특성이 상이 함에도 불구하고, 기본적인 네 트워크 성능과 품질을 제공 받을 수 밖에 없다. 본 개시에서는 이러한 서비스의 탐지를 자동적으로 수행하고, 각 서비스가 요구하는 네트워크 서비스 품질 및 성능 요구사항을 분석하여 적용하는 방법을 제안 한다. 이러한 방법의 적용을 통해 외부에 위치한 AF로부터 서 비스 탐지 방법을 전달 받지 아니하며, 수동적으로 설정하는 과정을 제거함으로써 네트워크 운용의 효율성을 증 대 시키며 서비스들의 전반적인 품질 수준을 높일 수 있다. 이하에서는 각 도면을 참조하여 본 개시의 다양한실시예들에 대하여 설명한다. [제1 실시예] - UPF를 이용한 서비스 탐지를 위한 사용자 데이터 수집 5G 이동통신 시스템에서 사용자 데이터를 전달하는 개체는 크게 단말(UE), 기지국(RAN), UPF, DN으로 나눌 수 있으며, 서비스의 품질 및 성능을 제어하기 위한 용도로는 RAN과 UPF가 대표적인 내부 개체로 존재한다. UPF는 특정 서비스의 탐지 및 QoS 관련 규칙을 적용하는 역할을 수행한다. 따라서, 서비스의 트래픽은 UPF를 통해 전 달이 되며, 이때 UPF는 특정 QoS 관련 정책 또는 QoS 정책을 적용하게 된다. 기본적으로 이러한 정책 또는 규칙 의 적용 기본 단위는 QoS 플로우 (QoS Flow)를 기본 단위로 한다. UPF에서는 PDR (Packet Detection Rule)를 통해 QoS 플로우를 탐지 하며, PDR에는 SDF의 일부가 포함될 수 있다. 추가적으로, UPF에서 PFD를 위한 기능을 제공하는 경우, SMF는 NEF로부터 PFD를 전달 받아, application identifier에 해당하는 서비스 탐지를 UPF가 생성하는 리포트를 통해 전달 받을 수 있다. 본 발명에서는 UPF에서 전달되는 네트워크 트래픽 중에서 기존에 PDR 규칙이 적용되지 않거나, 기존의 Application identifier로 구별이 불가능한 새로운 QoS 플로우 또는 네트워크 데이터가 탐지 될 경우, 발생한 트래픽을 NWDAF에게 전달하여 이 트래픽을 분석 하는 과정을 거치게 된다. 이 때, 설정에 따라 새롭게 발생한 플로우의 헤더 정보만을 보내거나, 또는 필요한 경우 실제 내용을 포함하고 있는 페이로드(Payload) 정보를 포 함한 패킷 전체를 NWDAF에 전달 할 수 있다. 한편, 이러한 요청을 NWDAF가 UPF로 보내는 방법은 현재 표준화되 어 있지 않으나, 서비스 기반 아키텍쳐(Service Based Architecture)의 새로운 인터페이스를 도입하거나, 또는 전용 UPF 인터페이스에 NWDAF가 접근하는 방법으로 나눌 수 있다. 본 개시에서는 서비스 기반 아키텍처를 따르 는 인터페이스를 UPF가 지원하도록 하여 실시예를 서술 하나, 전용 인터페이스를 사용하여 동일한 목적과 유사 한 동작을 수행할 수 있다. 이러한 과정은 도 2에 도시되어 있다. 도 2는 본 발명의 실시예에 따라, UPF를 통해 특정 패킷 플로우의 초기 패킷들을 전달 받기 위한 절차를 도시한 다. 본 개시에서 새로운 패킷 플로우(new packet flow)는 패킷의 집합으로써 특정 서비스를 이용하는 트래픽을 지칭 한다. 서비스에 따라 패킷 플로우는 특정 단일 서버 일수도 있으며, 복수개의 서버, 또는 복수개의 서버의 조합, 이동 가능한 서버들으로 이루어진 큰 서비스의 다양한 형태로 표현이 가능하다. 따라서, 패킷 플로우는 단순히 특정 네트워크 주소에 위치한 서버로 향하는 패킷의 집합뿐만 아니라, 서비스를 이용함에 있어서 발생하 는 모든 트래픽을 지칭 할 수 있다. 한편, 실시예에 따라서는, 특정 서비스 트래픽을 세분화 하여, 단일 서버로 향하는 트래픽 만을 패킷 플로우로 지칭 할 수 도 있다. 도 2의 첫번째 과정에서, NWDAF는 UPF에 새로운 패킷 플로우가 탐지 되었을 경우 통지를 받을 수 있도록 하기 위한 이벤트 구독을 UPF에 요청한다. 예를 들면, NWDAF는 이를 위한 이벤트 구독 요청 (Nupf_eventsexposure_subscibe)를 UPF에 전송할 수 있다. 한편, 실시예에 따라서는, NWDAF와 UPF사이에 접근 가능한 인터페이스가 존재 하지 않는 경우, SMF가 NWDAF의 요청을 전달 할 수 있다. 일 실시예에 따른, 이벤트 구독 요청은 이벤트 식별자(예컨대, event ID = “New Packet Flow detected”), 새 로운 패킷 플로우가 탐지 되었을 경우, 탐지된 패킷 플로우에서 패킷 플로우를 구성하는 패킷을 몇 개나 NWDAF 에 전달(또는, 보고) 할지를 나타내는 인자(예컨대, “number of packet to be reported” 인자) 및/또는 패킷 의 실제 데이터인 페이로드를 포함하여 전달 할 것인지 여부를 명시 하는 인자(예컨대, “payload” 인자)를 포 함할 수 있다. 도 2의 실시예에서는 새로운 패킷 플로우가 감지 되었다는 새로운 이벤트 식별자(예컨대, event ID = ”New Packet Flow detected”)를 할당하여 패킷 플로우에 대한 통지를 요청 하였지만, 이러한 기능을 수 행하는 전용 인터페이스가 제공될 수도 있다. 또한, NWDAF는 특정 트래픽에 대한 필터 정보를 추가적으로 보낼 수 있다. 예를 들면, NWDAF는 특정 트래픽에 대한 필터 정보를 이벤트 구독 요청에 더 포함할 수 있다. 일 실시 예에 따라, 필터의 종류에는 UE ID, Group of UEs, PDU Session ID, DNN 또는 DNAI, S-NSSAI 및/또는 시간대 등이 포함 될 수 있다. 도 2의 두번째 과정에서, UPF는 현재 SMF로부터 제공받은 PDR이 없거나 특정 응용을 탐지 하기 위한 PFD가 존재 하지 않는 경우, 새로운 패킷 플로우를 탐지 하였다고 판단한다. 이때, 기본적으로 모든 패킷에 공통적으로 적 용되는 정책이나 규칙의 경우에는 적용된 규칙 또는 필터가 존재 하지 않는다고 판단할 수도 있다. 기본 PCC 규 칙 (UE의 Default QoS 규칙에 대응하는 PCC 규칙)에 매칭 되거나 UPF에서 패킷 매칭이 실패한 패킷들 또한 새로 운 패킷 플로우로 탐지 할 수 있다고 볼 수 있다. 패킷 플로우의 탐지는 PFD가 없거나 PDR이 존재 하지 않은 트래픽을 구성하는 패킷 중에서 특정 네트워크 주소 또는 구간으로 향하는 트래픽, 특정 시간 구간에 발생한 트래 픽, 특정 UE에서 발생한 트래픽, 특정 DNN으로 향하는 트래픽 등의 조합을 활용하여 수행될 수 있다. 예를 들어, 특정 UE에서 특정 네트워크 주소로 향하는 60 초 이상 지속되는 패킷의 집합이 탐지되는 경우, 새로운 패 킷 플로우가 탐지 되었다고 표현할 수 있다. 이렇게 탐지된 패킷 플로우를 구성하는 패킷들은 UPF 또는 외부의 특정 저장공간에 저장될 수 있으며, 조건을 만족하는 개수의 패킷이 충분히 확보될 때까지 패킷이 저장될 수 있 다. 이때, 패킷이 전달된 시간, 전달된 패킷이 저장된 시간, 패킷을 전달하는 해당 PDU 세션 정보 등이 추가적 으로 함께 저장될 수 있다. 패킷의 저장에 있어 페이로드를 요청한 경우 페이로드를 함께 저장해야 하지만, 요 청이 없는 경우 페이로드의 저장 여부는 UPF의 내부 설정에 따라 달라 질 수 있다. 도 2의 세번째 과정에서, UPF는 두번째 과정에서 탐지되어 저장된 패킷들을 NWDAF에 전달한다. 이 때, 추가적으 로 저장된 정보들 또한 패킷들과 함께 전달될 수 있다. 예를 들면, 상기 저장된 패킷들 및/또는 상기 추가적으 로 저장된 정보가 이벤트 구독 요청에 대한 응답 또는 통지(예컨대, Nupf_eventsexposure_notify)에 포함되어 전송될 수 있다. 도 2의 네번째 과정에서, NWDAF는 전달 받은 패킷들을 활용하여 이 패킷의 그룹을 다른 서비스와 차별화하여 구 별하는 방법을 분석한다. 예를 들면, NWDAF는 전달 받은 패킷들을 이용하여, 상기 패킷 플로우와 연관된 서비스 에 대한 분석을 수행할 수 있고, 이에 기초하여 상기 새로운 패킷 플로우에 대한 PFD를 생성할 수 있다. 도 3은 본 발명의 실시예에 따라, UPF를 통해 특정 패킷들을 모두 전달 받기 위한 절차를 도시한다. 도 3의 실시예에서는 새로운 패킷 플로우의 탐지 규칙을 UPF가 지원하지 않는 경우 사용할 수 있는 방법으로서, 특정 시간에 발생한 모든 트래픽을 NWDAF에 전달 하도록 하는 방법을 개시한다. 도 3의 첫번째 과정에서, NWDAF는 UPF로부터 특정 시간 구간 동안 발생 하는 모든 패킷을 전달 받을 수 있도록 UPF에 요청한다. 예를 들면, NWDAF는 이를 위한 이벤트 구독 요청(Nupf_eventsexposure_subscibe)를 UPF에 전 송할 수 있다. 한편, 실시예에 따라서는, NWDAF와 UPF사이에 접근 가능한 인터페이스가 존재 하지 않는 경우, SMF가 NWDAF의 요청을 전달 할 수 있다. 일 실시예에 따른, 이벤트 구독 요청은 이벤트 식별자(예컨대, event ID = “packet dump”) 및/또는 특정 시간 구간를 나타내는 인자(예컨대, “period” 인자)를 포함할 수 있다. 추가적으로, 이벤트 구독 요청은 패킷의 페 이로드를 포함할지 여부를 명시하는 인자를 더 포함 할 수 있다. 또한, NWDAF는 특정 트래픽에 대한 필터 정보 를 추가적으로 보낼 수 있다. 예를 들면, NWDAF는 특정 트래픽에 대한 필터 정보를 이벤트 구독 요청에 더 포함 할 수 있다. 일 실시예에 따라, 필터의 종류에는 UE ID, Group of UEs, PDU Session ID, DNN 또는 DNAI, S- NSSAI 및/또는 시간대 등이 포함 될 수 있다. 도 3의 두번째 과정에서, UPF는 조건을 만족하는 모든 패킷들을 UPF 내부 또는 외부의 특정 저장공간에 저장한 다. 이 과정은 조건을 만족하는 개수의 패킷이 충분히 확보 되었을 경우까지 패킷을 저장한다. 이때, 패킷이 전 달된 시간, 같이 저장된 시간, 패킷을 전달하는 해당 PDU 세션 정보 등이 추가적으로 함께 저장될 수 있다. 패 킷의 저장에 있어 페이로드를 요청한 경우 페이로드를 함께 저장해야 하지만, 요청이 없는 경우 페이로드의 저 장 여부는 UPF의 내부 설정에 따라 달라 질 수 있다. 도 3의 세번째 과정에서, UPF는 두번째 과정에서 저장된 패킷들을 NWDAF에 전달한다. 이 때, 추가적으로 저장된 정보들 또한 패킷들과 함께 전달될 수 있다. 예를 들면, 상기 저장된 패킷들 및/또는 상기 추가적으로 저장된 정보가 이벤트 구독 요청에 대한 응답 또는 통지(예컨대, Nupf_eventsexposure_notify)에 포함되어 전송될 수 있다. 도 3의 네번째 과정에서, NWDAF는 전달 받은 패킷들을 활용하여 이 패킷의 그룹을 다른 서비스와 차별화하여 구별하는 방법을 분석한다. 예를 들면, NWDAF는 전달 받은 패킷들을 이용하여, 상기 패킷 플로우와 연관된 서비 스에 대한 분석을 수행할 수 있고, 이에 기초하여 상기 새로운 패킷 플로우에 대한 PFD를 생성할 수 있다. [제 2 실시예] - SMF를 이용한 서비스 탐지를 위한 사용자 데이터 수집 본 개시에서는 NWDAF가 UPF에 직접 접근 할 수 없는 경우, SMF에서 전달하는 트래픽 리포트를 전달 받아 새로운 서비스를 탐지 하는 방법을 포함한다. SMF는 UPF로부터 정책의 적용 및 과금을 위해 트래픽 관련 보고(Report)를 전달 받을 수 있도록 설정 할 수 있다. 기본적으로 UPF의 트래픽 사용과 관련된 모니터링은 PDU 세션 수준으 로 받지만, SMF는 특정 서비스를 모니터링 하거나, 특정 조건을 만족하는 모니터링 규칙을 활성화 시킬 수 있다. SMF로부터 이러한 요청이 발생한 경우, UPF는 조건을 만족하는 트래픽의 시간(Time)과 사용량(Volume)에 관련된 자료를 수집 저장하여 보고 한다. 이 과정에서 본 개시는 SMF가 실시예 1에서 서술한 새로운 패킷 플로 우를 탐지한 경우 이 플로우의 시간 및 볼륨뿐만 아니라 처음 몇 개의 패킷의 헤더를 포함한 페이로드 데이터를 보고서 내부에 포함하여 전달 하는 방법을 포함한다. 이러한 과정은 도 4에 도시되어 있다. 도 4는 본 발명의 실시예에 따라, NWDAF가 SMF 또는 UPF를 통해 수집한 데이터를 활용하여 새로운 패킷 플로우 를 탐지하는 방법을 도시한다. 도 4의 첫번째 과정에서, NWDAF는 SMF에게 새로운 패킷 플로우에 대한 보고를 요청 한다. 예를 들면, NWDAF는 이를 위한 이벤트 구독 요청(Nupf_eventsexposure_subscibe)를 SMF에 전송할 수 있다. 일 실시예에 따른, 이벤트 구독 요청은 이벤트 식별자(예컨대, event ID = “New Packet Flow detected”), 새 로운 패킷 플로우가 감지 되었을 경우, 탐지된 패킷 플로우에서 패킷 플로우를 구성하는 패킷을 몇 개나 NWDAF 에 전달(또는, 보고) 할지를 나타내는 인자(예컨대, “number of packet to be reported” 인자) 및/또는 패킷 의 실제 데이터인 페이로드를 포함하여 전달 할 것인지 여부를 명시 하는 인자(예컨대, “payload” 인자)를 포 함할 수 있다. 도 4의 실시예에서는 새로운 패킷 플로우가 감지 되었다는 새로운 이벤트 식별자를 할당하여 패 킷 플로우에 대한 통지를 요청 하였지만, 이러한 기능을 수행하는 전용 인터페이스를 제공할 수도 있다. 또한, NWDAF는 특정 트래픽에 대한 필터 정보를 추가적으로 보낼 수 있다. 예를 들면, NWDAF는 특정 트래픽에 대한 필 터 정보를 이벤트 구독 요청에 더 포함할 수 있다. 일 실시예에 따라, 필터의 종류에는 UE ID, Group of UEs, PDU Session ID, DNN 또는 DNAI, S-NSSAI, 및/또는 시간대 등이 포함 될 수 있다. 추가적으로, 주기적으로 보 고 받기를 원하는 경우, 보고 주기가 이벤트 구독 요청에 포함 될 수 있다. 도 4의 두번째 과정에서, SMF는 NEF (또는, AF/OAM)로부터 제공받은 PDR이 없거나 특정 응용을 탐지 하기 위한 PFD가 존재 하지 않는 경우, 새로운 패킷 플로우를 탐지 하였다고 판단한다. 이러한 플로우에 해당하는 트래픽 의 사용이 탐지 되었을 경우, UPF는 이 플로우에서 발생하는 트래픽 사용 보고서 (Traffic Usage Report)에 포 함시켜 보고 한다. 이렇게 탐지된 패킷 플로우를 구성하는 패킷들은 UPF 또는 외부의 특정 저장공간에 저장될 수 있으며, 조건을 만족하는 개수의 패킷이 충분히 확될 때까지 패킷이 저장될 수 있다. 이때, 패킷이 전달된 시간, 같이 저장된 시간, 패킷을 전달하는 해당 PDU 세션 정보 등이 추가적으로 함께 저장될 수 있다. 패킷의 저장에 있어 페이로드를 요청한 경우 페이로드를 함께 저장해야 하지만, 요청이 없는 경우 페이로드의 저장 여 부는 UPF의 내부 설정에 따라 달라 질 수 있다. 저장된 패킷 및 사용량은 SMF에게 보고 된다. 도 4의 세번째 과정에서, SMF는 두번째 과정에서 UPF로부터 작성되어 전달된 트래픽 사용 보고서와 탐지되어 저 장된 패킷들을 NWDAF에 전달한다. 이 때, 추가적으로 저장된 정보들 또한 패킷들과 함께 전달 된다. 예를 들면, 상기 트래픽 사용보고서, 상기 저장된 패킷들 및/또는 상기 추가적으로 저장된 정보가 이벤트 구독 요청에 대한 응답 또는 통지(예컨대, Nsmf_eventsexposure_notify)에 포함되어 전송될 수 있다. 도 4의 네번째 과정에서, NWDAF는 전달 받은 패킷들을 활용하여 이 패킷의 그룹을 다른 서비스와 차별화하여 구 별하는 방법을 분석한다. 예를 들면, NWDAF는 전달 받은 패킷들을 이용하여, 상기 패킷 플로우와 연관된 서비스 에 대한 분석을 수행할 수 있고, 이에 기초하여 상기 새로운 패킷 플로우에 대한 PFD를 생성할 수 있다. [제 3 실시예] - PFD 확장을 통한 유연한 서비스 탐지 방법 현재 이동통신 시스템에서 사용하고 있는 서비스 탐지 방법은 네트워크 주소를 기반으로 패킷 헤더 정보의 일부 를 추가적으로 사용하여 특정 서비스를 탐지 하는 것이 일반적이다. 하지만, 이러한 네트워크 주소 또는 헤더 정보의 일부만을 사용하는 경우, 클라우드 컴퓨팅 환경 또는 P2P 환경과 같이 헤더 정보가 지속적으로 바뀌거나 특정 서버의 위치를 고정적으로 한정 지을 수 없는 상황에서 적용하는 것은 부적합 하다. 서비스를 제공하는 서 버의 네트워크 주소가 변경 되거나 사용하는 전송 프로토콜의 변경을 통해 패킷의 헤더 정보가 변경이 되는 경 우, 기존의 이동통신 망 내의 서비스 모니터링 규칙들을 지속적으로 적용할 수 없다. 이러한 방식의 탐지 방법 은 SDF (Service Data Flow) Filter를 사용하는 경우가 대표적이다. 한편, 서비스가 아니라 PFD를 이용하여 특정 서비스 또는 응용을 탐지 하여 정책 및 규칙을 적용할 수 있다. PFD는 특정 서비스를 제공하는 서버의 네트워크 주소와 포트 번호, URL의 일부, 도메인 이름 매칭 기준 및 적용 가능한 프로토콜에 대한 정보들이 포함된다. PFD 또한 SDF Template 보다는 많은 기준을 적용하여 특정 서비스또는 응용의 탐지가 가능하지만, 클라우드 환경 또는 P2P 프로토콜과 같은 환경에서 주소 또는 탐지에 사용되는 값이 바뀌는 경우 지속적인 적용이 불가능하다. 본 개시에서는 PFD 또는 SDF를 확장 하여, 네트워크 주소 뿐만 아니라 추가적인 매칭 값을 PFD(또는 SDF)에 포 함시킨다. 예를 들면, 서비스를 이용하는 DL/UL 패킷 시퀀스 패턴, 패킷 페이로드에 포함되어 있는 문자열의 일 부 및/또는 캡슐화된 패킷의 내부 프로토콜 정보를 상기 추가적인 매칭 값으로서 사용할 수 있다. 이러한 탐지 기준은 기존의 PFD를 확장한 것으로, 기존 정보의 조합과 병행하여 사용 가능하다. 이러한 SDF 또는 PFD는 SMF 에 의해서 UPF에서 실제 패킷의 처리가 가능한 QoS 규칙의 형태로 바인딩되며, SDF 및 PFD에 요구되는 서비스 품질 요구사항들이 UPF에서 적용될 수 있도록 한다. DL/UL 패킷 시퀀스 패턴은 서비스에 따라 가지는 고유한 전송 패턴을 이용하는 것으로, 예컨대, 1개의 UL 패킷 전송 후 반드시 2개 이상의 DL 패킷이 온다라는 UL/DL 패킷의 시퀀스를 패턴화 한 것일 수 있다. 패킷 페이로드에 포함되어 있는 문자열의 일부는 서비스를 이용하는 모든 또는 일부 패킷에 공통적으로 나타나 는 문자열을 지칭 한다. 이때 문자열은 특정 의미를 담고 있지 않을 수 있으며, 서비스에서 사용하는 특정 자료 형의 특성이 반영된 것일 수 있다. 캡슐화 된 패킷의 내부 프로토콜 정보는, 특정 서비스의 경우 TCP 또는 UDP 내부에 자체 프로토콜 또는 연결을 위한 프로토콜을 캡슐화 한 경우이다. 예를 들면, LISP (Location Identifier Separation Protocol), VXLAN, NVGRE등과 같은 프로토콜이 대표적으로 이러한 캡슐화 된 패킷들을 전송하기 위한 프로토콜에 해당한다. 이러한 캡슐화된 패킷의 헤더 정보가 아니라, 내부 헤더 정보를 사용하는 프로토콜 및 내부 헤더의 일부를 매칭하는 방 법을 통해 특정 서비스를 탐지 하는 정확도를 높일 수 있다. 본 실시예는 기존의 탐지 기준과 상기 확장한 탐지 기준을 조합하여 서비스를 탐지하는 방법을 포함한다. 예를 들어, “1.1.1.* 주소로 향하는 80포트를 사용하며, 플로우의 초기 2번째 패킷에 'ABC'라는 문자열을 포함하는 플로우”를 새로운 서비스로 지칭 할 수 있다. [제 4 실시예] - NEF가 NWDAF에게 PFD를 정보를 받아 PFD를 UDR에 프로비저닝 하는 방법 상술한 실시예를 바탕으로 특정 서비스 플로우 또는 패킷 플로우를 탐지 하는 방법을 개시한다. 본 실시예는 PFD에서 사용하는 기존의 탐지 기준인 특정 서비스를 제공하는 서버의 네트워크 주소와 포트 번호, URL의 일부, 도메인 이름 매칭 기준 및 적용 가능한 프로토콜에 대한 정보를 사용할 수 있다. 추가적으로 상술한 제3 실시예 에서 서술한 확장된 탐지 기준들의 적용 또한 가능하다. 상술한 방법을 통해 새로운 특정 서비스 플로우 또는 패킷 플로우를 탐지한 경우, NWDAF는 수집한 정보를 기반 으로 각 플로우들의 특징을 추출 한다. 이 특징은 서비스 플로우를 다른 네트워크 트래픽과 구별이 가능하게 해 주는 필터의 역할을 수행하는 것으로써 PFD의 형태로 표현이 가능하다. 한편, 본 개시에서는 이러한 각 플로우 들의 특징을 추출하는 방법에 대하여 구체적으로 설명하고 있지 않으나, 예컨대, 인공지능, 패턴인식, 기계학습 등의 방법의 적용을 통해 서비스 플로우의 특징들에 대한 추출이 가능하다. 이렇게 추출된 서비스 플로우의 특 징은 PFD로 표현되어 다른 NF 또는 AF에 전달이 가능하다. AF로부터 PFD의 정보를 받아 SMF에 전달하는 역할을 하는 NEF의 경우, AF로부터 전달 받은 PFD가 없는 새로운 서비스 데이터 또는 전달 받은 PFD에 오류가 있다고 판단되는 경우, NWDAF에 SDF 또는 PFD가 적용되지 않는 분 류되지 않은 서비스 플로우들에 대한 정보를 요청 할 수 있다. 이러한 과정은 도 5에 도시되어 있다. 도 5는 본 발명의 실시예에 따라, NEF가 NWDAF가 탐지한 새로운 패킷 플로우를 저장하는 절차를 도시한다. 도 5의 첫번째 과정에서, PFDF 기능을 수행 할 수 있는 NEF는 NWDAF에 새로운 서비스의 탐지와 관련된 분석 정 보를 요청한다. 예를 들면, NEF는 이를 위한 이벤트 구독 요청(Nnwdaf_analyticssexposure_subscibe)를 NWDAF 에 전송할 수 있다. 일 실시예에 따른, 이벤트 구독 요청은 이벤트 식별자(예컨대, event ID = “New Service Detection Analytics ”)를 포함할 수 있다. 또한, 서비스가 제공되는 경로 또는 대상에 따른 필터의 적용이 가능하다. 예를 들면, 이벤트 구독 요청은 필터 정보를 더 포함할 수 있다. 일 실시예에 따른, 필터의 종류로는 UE ID, Group of UEs, PDU Session ID, DNN 또는 DNAI, S-NSSAI 및/또는 시간대 등이 포함 될 수 있다. 도 5의 두번째 과정에서, NWDAF는 첫번째 과정에서 전달 받은 필터 기준에 해당하는 새로운 서비스 플로우 또는 패킷 플로우의 탐지 및 이들을 추후에 탐지 할 수 있는 기준들을 추출한다. 정보의 추출을 위한 데이터의 수집 은 요청을 받기 전에 수행되거나, 요청을 받은 후에 수행될 수 있다. 도 5의 세번째 과정에서, NWDAF는 새롭게 탐지된 서비스 플로우들을 PFD의 형식으로 변환하여 반환한다. 이때, PFD를 생성할 수 있는 정보가 충분히 포함되어 있으며 NEF가 PFD의 형태로 변환하는 것 또한 가능하다. 각 PFD 들은 임시적으로 할당된 application ID를 가질 수 있다. Application id를 NWDAF가 할당하지 않는 경우 각 PFD들은 임시적으로 할당된 PFD id들을 통해 구별되고 지칭 될 수 있다. 도 5의 네번째 과정에서, NWDAF로부터 새로운 서비스들에 대한 PFD를 수신한 NEF는 새로운 PFD를 프로비저닝 하 는 표준 프로시져를 수행 한다. 이때, 수신한 PFD들은 UDR에 저장이 가능하다. 더불어, 세번째 과정에서 application id가 포함되어 있지 않은 경우, NEF는 내부 생성 규칙을 적용하여 각 PFD에 해당하는 application ID의 할당을 수행할 수 있다. 도 5의 다섯번째 과정은 NWDAF로부터 전달 받은 PFD를 추후에 사용하기 위해 UDR에 저장하거나, PFD의 전달과 관련된 이벤트 구독을 하고 있는 NF가 존재하는 경우 새로운 PFD를 NF에 전달 할 수 있다. [제 5 실시예] - AF가 NWDAF에게 PFD를 정보를 받아 PFD를 NEF를 통해 프로비저닝 하는 방법 AF는 일반적으로 단일 서비스를 제공할 수 있으나, 클라우드, 엣지 컴퓨팅, P2P 관리자등과 같이 특정 주소를 사용하지 않거나 서버의 위치가 달라지는 경우 특정 PFD를 지속적으로 제공할 수 없을 수 있다. 더불어, 플랫폼 제공자의 경우 플랫폼에서 제공되는 모든 서비스들에 대한 PFD를 제공할 수 없는 경우도 있을 수 있다. 이러한 경우에 있어, AF는 이동통신 시스템이 NEF를 통해 제공하는 NWDAF의 분석 정보를 활용하여 자신이 제공하는 서 비스들을 분류할 수 있는 PFD들을 획득 할 수 있고, 이 정보들을 활용하여 NEF의 PFDF 기능 활용하여 5G 이동통 신 시스템에 제공 할 수 있다. 이 경우, NEF를 통해 획득한 PFD들은 NEF뿐만 아니라 LTE의 PFDF를 통해 LTE 시 스템에서도 적용이 가능하다. 이러한 과정은 도 6에 도시되어 있다. 도 6는 본 발명의 실시예에 따라, AF가 자신의 패킷 플로우 정보들에 대한 분석 정보를 제공 받는 절차를 도시 한다. 도 6의 첫번째 과정에서, AF는 NEF를 통해 NWDAF에 새로운 서비스의 탐지와 관련된 분석 정보를 요청한다. 예를 들면, AF는 이를 위한 이벤트 구독 요청(Nnef_analyticssexposure_subscibe)를 NEF를 통해 NWDAF에 전송할 수 있다. 일 실시예에 따른, 이벤트 구독 요청은 이벤트 식별자(예컨대, event ID = “New Service Detection Analytics ”)를 포함할 수 있다. 또한, 서비스가 제공되는 경로 또는 대상에 따른 필터의 적용이 가능하다. 예를 들면, 이벤트 구독 요청은 필터 정보를 더 포함할 수 있다. 일 실시예에 따른, 필터의 종류로는 UE ID, Group of UEs, DNN 또는 DNAI, S-NSSAI 및/또는 시간대 등이 포함 될 수 있다. 각 UE ID와 같은 정보는 AF에서는 GPSI, MSISDN, External ID와 같은 외부에서 사용되는 식별자가 사용될 수 있으며, 이러한 식별자를 내부에서 사용하 는 식별자로 변환 하는 역할은 NEF가 수행 할 수 있다. 이 때, NEF는 특정 AF가 접근 불가능한 정보에 대해서 필터를 적용 하거나 내부 정책을 적용하여 요청을 거부 할 수도 있다. 도 6의 두번째 과정에서 NWDAF는 첫번째 과정에서 전달 받은 필터 기준에 해당하는 새로운 서비스 플로우 또는 패킷 플로우의 탐지 및 이들을 추후에 탐지 할 수 있는 기준들을 추출한다. 정보의 추출을 위한 데이터의 수집 은 요청을 받기 전에 수행되거나, 요청을 받은 후에 수행될 수 있다. 도 6의 세번째 과정에서, NWDAF는 새롭게 탐지된 서비스 플로우들을 PFD의 형식으로 변환하여 반환한다. 이때, PFD를 생성할 수 있는 정보가 충분히 포함되어 있으며 NEF가 PFD의 형태로 변환하는 것 또한 가능하다. 각 PFD 들은 임시적으로 할당된 application ID를 가질 수 있다. Application id를 NWDAF가 할당하지 않는 경우 각 PFD들은 임시적으로 할당된 PFD id들을 통해 구별되고 지칭 될 수 있다. 이 때, NEF는 특정 AF가 접근 불가능한 정보에 대해서 필터를 적용 하여 해당 AF가 접근이 불가능 정보를 삭제 할 수 있다. 도 6의 네번째 과정에서, NEF로부터 새로운 서비스들에 대한 PFD를 수신한 AF는 새로운 PFD를 프로비저닝 하는 표준 프로시져를 수행 한다. PFDF 기능을 수행 할 수 있는 NEF에서 제공하는 PFD 생성/변경/삭제 기능을 수행 할 수 있다. 더불어, 동일한 정보를 활용하여 LTE시스템의 경우 PFDF에게 요청하여 자신이 제공하는 서비스들에 대한 탐지 규칙을 제공할 수 있다. [제 6 실시예] - PCF가 NWDAF로부터 새로운 서비스 탐지에 대한 알림을 받아 새로운 PCC 룰을 생성하는 방법 PCF는 서비스 별로 QoS 관련 정책이나 과금과 같은 정책을 적용할 수 있다. 이를 적용하기 위한 단위는 QoS 플 로우 단위일 수 있고, PCF는 QoS 플로우 단위로 이러한 정책 및 실제 규칙들을 적용 할 수 있다. 이를 지원하기 위해서 PCF는 서비스를 모니터링 하고 정책을 적용하기 위한 방법이 필요하다. 이를 지원 하기 위해서 PCF는 SDF를 구별하기 위해 SDF template 내부에 있는 SDF 필터 정보를 활용하거나, 특정 응용 또는 서비스를 탐지 하 기 위한 PFD를 application id를 매개로 하여 활용 할 수 있다. 본 개시에서는, 기존에 탐지 되지 않은 서비스 들에 대해서 새로운 서비스 탐지를 위한 SDF template를 포함한 분석 정보를 NWDAF가 PCF에 전달한다. PCF는 이 를 기반으로 새로운 서비스를 위한 PCC 규칙을 새롭게 생성한다. 이러한 정보를 보조 하기 위해, NWDAF는 네트 워크 트래픽 분석 중 획득한 서비스의 일반적인 특성을 보조 정보로써 함께 전달할 수 있다. 서비스의 일반적인 특성으로는 최소 대역폭, 최대 지연시간, 및/또는 평균 응답시간 등이 포함 될 수 있다. 이러한 과정은 도 7에 도시되어 있다. 도 7은 본 발명의 실시예에 따라, PCF가 새로운 서비스가 탐지되었을 경우 알림을 받는 절차를 도시한다. 도 7의 첫번째 과정에서, PCF는 NWDAF에 새로운 서비스의 탐지와 관련된 분석 정보를 요청한다. 예를 들면, PCF 는 이를 위한 이벤트 구독 요청(Nnwdaf_analyticssexposure_subscibe)를 NWDAF에 전송할 수 있다. 일 실시예에 따른, 이벤트 구독 요청은 이벤트 식별자(예컨대, event ID = “New Service Detection”)를 포함 할 수 있다. 또한, 서비스가 제공되는 경로 또는 대상에 따른 필터의 적용이 가능하다. 예를 들면, 이벤트 구독 요청은 필터 정보를 더 포함할 수 있다. 일 실시예에 따른, 필터의 종류로는 UE ID, Group of UEs, DNN 또는 DNAI, S-NSSAI, 시간대 및/또는 특정 지역 등이 포함 될 수 있다. 추가적으로, 새롭게 탐지되는 서비스의 트래 픽 패턴을 분석하여 서비스의 원활한 제공을 위해 필요한 품질 및 성능 요구사항을 요구하는지 여부가 포함 될 수 있다. 도 7의 두번째 과정에서, NWDAF는 첫번째 과정에서 전달 받은 필터 기준에 해당하는 새로운 서비스 플로우 또는 패킷 플로우의 탐지 및 이들을 추후에 탐지 할 수 있는 기준들을 추출한다. 정보의 추출을 위한 데이터의 수집 은 요청을 받기 전에 수행되거나, 요청을 받은 후에 수행될 수 있다. 추가적으로 수신한 트래픽 관련 정보에 기 초하여, 새롭게 탐지한 서비스들의 평균 대역폭, 지연시간 등과 플로우 지속 여부 등에 기초하여 평균 이용 시 간, 서비스 제공을 위해 필요한 최소 대역폭, 최대 지연 시간 등을 추가적으로 파악 할 수 있다. 도 7의 세번째 과정에서, NWDAF는 새롭게 탐지된 서비스 플로우들을 SDF Template형식으로 변환하여 반환한다. 새롭게 탐지된 서비스들은 두번째 과정에서 분석된 서비스 제공에 관련된 보조 서비스 품질 및 성능 요구사항들 을 포함하여 전달 될 수 있다. 따라서, 출력되는 정보는 서비스 탐지를 위한 SDF Template와 QoS 관련 요구사항 의 형식의 짝으로 표현될 수 있으며, 이들이 하나 또는 복수 개로 제공될 수 있다. 이 때, SDF에서 서비스를 탐 지하는 필터 정보가 application identifier로 표현된다면 상술한 PFD와 application id를 할당한 후 동일 한 방법을 수행 할 수 있다. 도 7의 네번째 과정에서, PCF는 NWDAF로부터 전달 받은 분석 정보를 기반으로 새로운 서비스들을 대상으로 PCC 규칙을 생성, 삭제, 변경을 수행한다. 이때 적용되는 PCC 규칙은 내부 정책, AF 요구사항, 현 네트워크 상태와 같은 요소들을 복합적으로 고려하여 적용 할 수 있다. [제 7 실시예] - NWDAF가 UPF를 통해 서비스 플로우의 특성을 수집하는 방법 3GPP 이동통신 시스템에서, UPF는 단말 또는 외부 데이터 네트워크에서 발생하는 트래픽을 탐지하고 규칙에 맞 게 프로세싱을 하는 역할을 수행하며, 대표적으로 포워딩, 드랍(Drop), 보고 등의 기능을 수행한다. UPF에서 각 트래픽을 구분하여 관리하는 최소단위로서 QoS flow를 사용한다. QoS Flow는 각 서비스를 특정하는 서비스 플로 우 또는 응용 구분자(Application ID)를 통해 바인딩 되며 관리 된다. 따라서, 서비스 플로우의 특성을 수집 하 기 위해서는 특정 서비스와 바인딩 되어 있는 QoS Flow를 찾아야 하며, 대상 QoS flow의 트래픽 특성의 파악을 통해 서비스가 네트워크 상에서 가지는 특성을 파악 할 수 있다. 추가적으로, UPF는 QoS Flow 내부에 Packet filter를 적용하여 특정 Service Flow에 대한 정보 수집 및 분석을 제공하는 것을 특징으로 한다. 서비스 플로 우의 특징의 예로는 플로우의 유지 시간 (length), 플로우의 크기 (size), 단위 시간 동안 최대 전송량 (Burstiness), 트래픽의 전송이 연속적으로 일어 나는지 간헐적으로 일어나는지 여부 (On/off pattern), 패킷크기의 분산, 패킷 간 전달 시간 (Inter arrival time), 평균 패킷 크기, 초당 전송률 등이 포함될 수 있다. 각 정보들이 상향 링크와 하향 링크를 별로 수집되고 분석 되는 것도 또한 가능하다. 이러한 정보의 수집을 위해서 본 발명에서는 UPF에서 SBI(Service Based Interface)를 통해 필요한 QoS 플로우 의 정보를 수집하고, UPF가 NF에 보고하는 방법을 제공하는 것을 특징으로 한다. 수집된 정보는 특정 서비스의 성능이 DNAI 별로 달라지는 것을 목적으로 하는 것으로, 오래 시간 데이터 축적을 통해 일반적인 DNAI 별 서비 스 최적화 경로를 찾는 것에 목적을 둔다. 이 때, 최근 일주일 간 DNAI 별 특정 서비스의 성능 분석과 같은 실 시예 적용 또한 특징으로 적용 가능하다. UPF의 보고하기 위한 조건으로는 특정 서비스와 QoS flow의 바인딩 여부를 파악 하여야 한다. UPF에 QoS Flow에 대한 정보를 요청 하기 위해서는 QFI (QoS Flow Identifier)를 먼저 알아야 한다. 이러한 정보는 특정 서비스가 매칭되어 있는 SDF (Service Data Flow) template 내부에 있는 필터 정보를 활용하여, 특정 UE가 해당 SDF의 연결 제공을 위해 사용하고 있는 PDU session ID를 파악 하고, 특정 서비스의 QoS 파악을 통해 UPF에서 사용하 고 있는 5QI(5G QoS Identifier) 정보를 알아야 한다. 이 경우 플로우 수집 대상이 전체 DN으로 향하는 트래픽 이라면 PDU Session ID를 인자로 사용하여 UPF에서 특정 DN 으로 향하는 UE의 트래픽에 대한 정보를 수집 할 수 있다. 특정 UPF에서 트래픽의 정보를 수집하는 단계는 다음과 같이 구분 될 수 있다. 1) 특정 UPF를 통과 하는 모든 트래픽(제1 트래픽), 2) 특정 UPF를 통과하여 특정 DN으로 연결되는 트래픽(제2 트래픽), 3) 특정 UPF를 통과하며 특정 UE에서 발생한 트래픽(제3 트래픽), 4) 특정 UPF를 통과 하며 특정 UE에서 발생하여 특정 DN으로 향하는 트래픽 (PDU session)(제4 트래픽), 5) 특정 UPF를 통과하여 특정 UE에서 발생하여 특정 DN을 이용하여 특정 서버 또는 도메인으로 향하는 트래픽 (Service Data Flow)(제5 트래픽), 6) 특정 UPF를 통과하여 특정 DN 을 이용하여 특정 서버 또는 도메인으로 향하는 트래픽(제6 트래픽)으로 나눌 수 있다. 본 실시예에서 활용하고 자 대상은 특정 서버로 향하는 트래픽의 특성의 차이를 DNAI 별로 수집하기 위한 것으로써 6번의 트래픽의 형태 를 수집하는 것을 목적으로 할 수 있다. 하지만, 특정 서버가 아니라 특정 네트워크 도메인 또는 특정 UE가 사 용하는 다양한 응용의 집합 등을 수집하는 목적, 특정 UPF의 성능 파악을 목적으로 상술한 모든 종류의 트래픽 의 형태를 수집 하는 방법을 지원 하는 것도 가능하다. 각 트래픽의 수집 형태에 따라 필요한 인자는 1)제1 트래픽을 위해서는 UPF의 ID, 2) 제2 트래픽을 위해서는 UPF ID와 DNAI, 3) 제3 트래픽을 위해서는 UPF ID와 UE ID (예, UE IP address), 4) 제4 트래픽을 위해서는 UPF ID, UE ID, PDU session ID, 5) 제5 트래픽을 위해서는 UPF ID, UE ID, PDU session ID, Server Address, 6) 제6 트래픽을 위해서는 UPF ID, Server ID로 구분 할 수 있다. 아래 실시예에서는 이러한 형태로 트래픽를 구분 하는 인자를 Packet flow description이라는 용어를 통하여 지칭한다. 이러한 구분자에서 동일한 목적으로 사용되는 부가적인 정보가 있을 수 있는데, 특정 SMF에서 특정 PDR을 관리 하기 위한 목적으로 사용되는 N4 session ID, 특정 경로를 한정하기 위한 Source 또는 destination interface, 특정 응용의 트래픽을 감지하기 위해 사용되는 application id, 특정 QoS flow를 지칭하기 위해 사용되는 QoS Flow ID (QFI), 데이터 네트워크 를 구분하기 위한 DNN (Data Network Name) 및/또는 슬라이스를 구별하기 위한 S-NSSAI 등이 추가적으로 packet flow description에 포함되어 요청될 수 있다. 상술한 Packet flow description에 해당하는 플로우에 대한 정보를 수집하는 UPF가 플로우 수집을 요청한 NF에 보고를 하는 방법이 다양하게 존재 할 수 있다. 예를 들면, UPF가 이러한 보고를 하는 형태는 다음과 같다. 1) 요청된 Packet flow가 탐지 되었을 때, 2) 요청된 packet flow가 특정 시간 이상 유지 되었을 때, 3) 요청된 packet flow의 사용량이 특정 사이즈를 초과 하였을 경우, 4)요청된 Packet flow의 전송률이 특정 값을 통과 하 였을 경우, 5) 요청된 packet flow가 특정 시간 동안 사용되지 않았을 경우, 6) 특정 주기에 따라서 주기적으로 보고하는 경우, 7) 경로가 변경되었을 경우 8) QoS와 같은 규칙이 변경 되었을 경우, 9) 특정 시간 구간 등으로 나타낼 수 있다. 이러한 형태의 트래픽을 수집하기 위한 NF가 UPF에 요청하는 과정은 도8에 도시 되어 있다. 도 8은 본 발명의 실시예에 따라, UPF로부터 패킷 플로우에 대한 정보를 수집하는 절차를 도시한다. 도 8의 첫번째 단계에서 Consumer NF (예, NWDAF)는 특정 관심 있는 서비스 또는 트래픽의 특성을 파악 하기 위 해 UPF에 특정 Packet Flow description에 해당 하는 Packet flow의 특성을 요청한다. 이때, Consumer NF는 대 상으로 하는 Packet flow description을 보낼 수 있으며, 만약 생략 된다면 특정 UPF를 지나는 모든 트래픽을 대상으로 플로우 정보를 분석하여 보고 할 수 있다. 추가적으로, Consumer NF는 상향과 하향 트래픽을 구분하기 위하여 트래픽의 방향을 구분하는 인자(예컨대, “direction” 인자)를 함께 전달 할 수 있다. 마지막으로, Consumer NF 보고를 받기 위한 트래픽 수집 정보(예컨대, “target statistics”)를 선택적으로 요청 할 수 있으며, 생략 시 UPF는 제공 가능한 모든 정보를 수집하여 전달한다. 요청에는 단일의 Packet Flow 뿐만 아니라 복수개의 Packet flow에 대한 요청이 리스트 형식(예컨대, PFD의 리스트)으로 요청 될 수 있으며, 내부에서 요 청을 구분과 보고를 받기 위한 notification correlation ID, Notification address 및 보고와 관련된 설정 값 들이 추가적으로 포함될 수 있다. 보고와 관련된 설정 값에는 주기적 보고, 특정 시간 동안 보고, 특정 개수의 이벤트 보고, 정보의 수집 단위(aggregation level), 및/또는 샘플링 범위 등이 포함될 수 있다. 이때, 요청에 대한 응답으로 Subscription Correlation ID 등이 NF에 전달될 수 있다. 이 정보는 세번째 단계에서 요청에 대 한 응답 또는 통지를 보내는 과정에서 해당 응답이 현재 전달된 요청에 대한 응답이라는 것을 구별하기 위한 용 도로 사용된다. 도 8의 두번째 단계에서, UPF는 첫번째 단계에서 요청 받은 Packet flow에 해당하는 패킷들을 선별 하고, 패킷 을 직접 수집하거나 헤더 정보 중 일부를 프로세싱 하는 과정에서 발췌하여, 요청의 응답을 생성하는데 필요한 정보들을 패킷들로부터 수집 한다. 더불어, 요청된 보고 조건이 만족되는 경우 현재까지 수집한 정보를 기반으 로 요청된 분석 정보를 정리하여 요청자에게 보고한다. 도 8의 세번째 단계는 UPF가 Packet flow 분석을 요구한 NF에 분석 결과를 응답하는 과정이다. 이때, 응답은 요 청의 형태에 따라 단일 또는 복수개의 분석 정보들이 포함 될 수 있다. 각 정보들은 첫번째 단계에서 요청된 값 의 수집, 측정, 또는 분석을 통하여 결정된다. 추가적으로, 첫번째 단계에서 Consumer NF에게 전달한 Notification Correlation ID가 상기 응답에 함께 포함되어, 어떤 요청에 대한 응답인지를 Consumer NF가 구별 할 수 있도록 한다. 본 실시예를 통해 Consumer NF는 단일의 특정 서비스 플로우에 대한 정보를 수집 할 수 있으며, 각 일회성 플로 우들이 가지는 특성들에 대한 정보를 추출 할 수 있다. 상기한 실시예와 조합 하여, Service Flow 또는 QoS Flow가 생성되는 경우, 플로우 상에서 초기에 송수신되는 N개의 패킷을 수집하여 Consumer NF를 트래픽의 특성 을 분석 하는데 함께 사용할 수도 있다. 더불어 UPF가 SBI를 직접적으로 NF로 제공할 수 없는 경우, SMF가 자신이 관리하고 있는 UPF들에 대해서 동일한 기능을 수행할 수 있도록 Consumer NF의 요청을 전달하는 매개 역할을 수행 할 수 있으며, 더불어 간단한 통계 적 기법(평균/분산 계산, 플로우의 ON/OFF 탐지, inactivity timer 구동)등이 SMF에서 수행될 수 있다. 이 경우 Consumer NF에 제공되는 정보는 상술한 내용과 동일하다. [제 8 실시예] - PCF가 NWDAF를 통해 DNAI 별 네트워크 품질을 고려하여 DNAI를 선택 하는 방법 본 개시는 NWDAF가 상기 서술한 방법을 사용하여 UPF로부터 서비스 또는 QoS 플로우에 대한 정보를 수집하여 서 비스 별 DNAI에 대한 특성을 분석 하는 방법을 포함한다. 3GPP 5G 핵심망은 특정 DNN으로 연결되는 복수개의 DNAI를 운용할 수 있으며, 추가적으로 DNN이 다르더라도 DN 내에서 인터넷 또는 목적지 서버로 전달되는 경로가 제공될 수 있다. 따라서, 특정 서버로 향하는 서비스 플로우는 DNN과 DNAI의 선택에 따라라 최종적으로 선택되 는 PSA(PDU session Anchor)의 위치에 따라 서버와 각 UPF 사이 구간의 네트워크 특성이 달라 질 수 있다. 이러 한 네트워크 특성의 예로는, 서버와 UPF 구간의 지연(Delay), 에러율(Error Rate), 지터(jitter), 대역폭 (bandwidth), 왕복 지연시간 (Round Trip Time), 최대 전송 패킷 크기 (Maximum Transmission Unit), 중간 경 로 장치 개수 (hop count)등이 포함될 수 있으며, 이는 패킷을 UPF에서부터 서버로 전달하는데 있어 영향을 미 치며, UE와 서버 사이의 종간 구간에 있어서 중요한 부분을 차지한다. 이러한 DNN, DNAI별 DN 내에서의 네트워크 성능을 분석을 하기 위해서, NWDAF는 UPF에 사용자 또는 서비스 트래 픽을 수집하기 위해서 상술한 방법을 이용하여 패킷을 수집하거나 패킷의 특성들을 보고 하도록 지시하는 것을 특징으로 한다. DNN, DNAI 별 특성을 활용하고자 하는 NF는 대상으로 하는 서비스 또는 사용자 트래픽을 한정하기 위한 트래픽 필터 정보를 제공하여야 하는데, 그 트래픽 필터의 전달 형태는 예컨대, 1) Service Data Flow Template (SDFT) 또는 Filter(SDFF), 2) Application ID, 3) Packet filter set, 4) Packet Flow Description (PFD) 등 의 형태로 전달이 될 수 있다. Service data flow는 패킷의 종단한 헤더 정보에 관련된 필터이다. 대표적으로 5 Tuple (source IP address, Destination IP address, Source Port number, Destination port number, protocol)의 형태로 사용될 수 있으며, 추가적으로 헤더에 활용 가능한 정보들, VLAN ID 등이 함께 조합 되어 사용될 수 있다. UPF 또는 SMF에 응용을 탐지 하기 위한 규칙이 미리 Provisioning 되어 있는 경우, application ID를 통해 특정 서비스를 탐지 할 수 있다. Packet filter set는 UPF에서 QoS 규칙을 적용하기 위해서 사용될 필터로써, 예컨대, IP와 Ethernet 패킷에 적용할 수 있는 필터일 수 있다. 마지막으로 Packet Flow Description은 특정 AF가 특정 트래픽 플로우를 탐지 할 수 있도록 제공하는 서버 측 관련 주소, URL, 도메인 이름 등으로 구성 된 필터이며, 일반적으로 application ID와 매핑 되어 사용될 수 있다. PCF가 본 개시를 활용하여 DNAI를 선택하기 위한 절차는 도 9에 도시되어 있다. 도 9는 본 발명의 실시예에 따라, PCF가 특정 서비스를 위해 최적의 DNAI를 선택하는 절차를 도시한다. 도 9의 첫번째 단계에서, PCF는 NWADF에 DNN, DNAI별 성능 분석을 요청 하기 위한 분석 서비스의 트래픽을 탐지 하기 위한 트래픽 관련 정보를 전달 한다. 이때, 트래픽 관련 정보는 상술 한 SDFT, SDFF, application, packet filter set, 및/또는 PFD 등의 조합으로 구성될 수 있으며, 추가적으로 관심으로 하는 DNN 또는 DNAI를 한정하기 위해 선택적 인자로써 DNN와 DNAI가 함께 포함되어 요청 될 수 있다. 도 9의 두번째 단계에서, PCF의 요청을 받은 NWDAF는 요청 정보에 대한 DNN, DNAI별 서비스 트래픽과 관련된 정 보를 수집 하기 위해, SMF 또는 UPF에서 트래픽 관련 정보를 수집한다. 2-1 단계는 SMF에 서비스 트래픽 관련 정보를 수집 하는 것을 요청하는 방법을 사용하며, 2-2 단계는 UPF에서 제공하는 SBI를 사용하여 서비스 트래픽 관련 정보를 수집한다. 2-1과 2-2 는 선택적으로 사용되거나, 상황에 따라서 직접적인 SBI를 제공할 수 없는 UPF의 경우에는 SMF를 통해서 수집하는 방법으로 함께 조합되어 사용 될 수 있다. 특정 DNN과 DNAI가 첫번째 단계에서 포함되어 있다면, NWDAF는 이를 지원하는 UPF 또는 SMF만을 대상으로 트래픽 관련 정보를 수집 하도록 요청 할 수 있다. 이 때, NWDAF가 특정 서비스와 연관 된 UPF와 SMF를 발견하는 과정에서 UDM에 저장되어 있는 정보를 활용하거나, NRF를 사용하여 UPF 및 SMF를 발견 하는 과정이 추가적으로 수행 될 수 있다. 한편, 실시예에 따라서, 도 9의 두번째 단계는 NWDAF가 이미 UPF 또는 SMF에서 분석 정보를 수집한 경우 생략될 수 있다. 도 9의 세번째 단계는, NWDAF가 UPF 또는 SMF로부터 수집한 서비스 트래픽들의 DNAI 별 또는 DNN별 특성을 분석 하여 각 DNN, DNAI에 따른 DN의 성능을 분석 하는 단계 이다. 이때 분석 될 수 있는 정보로는 서버와 UPF 구간 의 지연(Delay), 에러율(Error Rate), 지터(jitter), 대역폭(bandwidth), 왕복 지연시간 (Round Trip Time), 최대 전송 패킷 크기 (Maximum Transmission Unit), 및/또는 중간 경로 장치 개수 (hop count)등이 포함될 수 있다. 도 9의 네번째 단계는, NWDAF가 분석한 정보를 분석을 요청한 PCF에 전달 하는 단계로써 각 DNN, DNAI별로, 서 비스 플로우가 다른 경로를 택했을 경우 분석되는 외부 DN의 트래픽 특성의 각각을 리스트 형태로 구성하여 PCF 에 전달한다. 도 9의 다섯 번째 단계에서, PCF는 NWDAF로부터 수신한 DNN, DNAI별 정보를 기반으로 특정 서비스를 위한 최적 의 DNAI를 선택한다. 이 과정에서 특정 서비스뿐만 아니라, 현재 서비스가 제공되는 PDU 세션에서 제공되는 모 든 서비스들에 대한 최적의 성능 분석을 통해 전체 서비스들을 고려하여 최적의 DNAI 선택을 할 수도 있다. 더 불어, PDU 세션을 옮기지 않고 특정 서비스를 특정 DNAI로 옮기려고 하는 경우에는 UL CL (Uplink Classifier) 또는 BP (Branching Point)를 설치하여 복수개의 PDU Session Anchor(PSA)를 사용할 수 있도록 PDU 세션을 변 경 할 수 있다. 도 9의 여섯 번째 단계는 PDU 세션에 대한 UPF를 변경 하기 위해 SMF에 SM Policy 생성 또는 변경을 통하여 새 로운 PCC 규칙을 내려준다. 도 9의 일곱 번째 단계에서 SMF와 UPF는 특정 PDU 세션을 변경하는 동작을 수행한다. [제 9 실시예] - AF가 NWDAF를 통해 DNAI 별 네트워크 품질을 고려하여 DNAI를 선택 하는 방법 본 개시는 NWDAF가 상기 서술한 방법을 사용하여 UPF로부터 서비스 또는 QoS 플로우에 대한 정보를 수집하여 서 비스 별 DNAI에 대한 특성을 분석 하는 방법을 포함한다. 3GPP 5G 핵심망은 특정 DNN으로 연결되는 복수개의 DNAI를 운용할 수 있으며, 추가적으로 DNN이 다르더라도 DN 내에서 인터넷 또는 목적지 서버로 전달되는 경로가 제공될 수 있다. 따라서 특정 서버로 향하는 서비스 플로우는 DNN과 DNAI의 선택에 따라라 최종적으로 선택되는 PSA(PDU session Anchor)의 위치에 따라 서버와 각 UPF 사이 구간의 네트워크 특성이 달라 질 수 있다. 이러한 네트워크 특성의 예로는, 서버와 UPF 구간의 지연(Delay), 에러율(Error Rate), 지터(jitter), 대역폭 (bandwidth), 왕복 지연시간 (Round Trip Time), 최대 전송 패킷 크기 (Maximum Transmission Unit), 중간 경로 장치 개수 (hop count)등이 포함될 수 있으며, 이는 패킷을 UPF에서부터 서버로 전달하는데 있어 영향을 미 치며, UE와 서버 사이의 종간 구간에 있어서 중요한 부분을 차지한다. 이러한 DNN, DNAI별 DN 내에서의 네트워크 성능을 분석을 하기 위해서, NWDAF는 UPF에 사용자 또는 서비스 트래 픽을 수집하기 위해서 상술한 방법을 이용하여 패킷을 수집하거나 패킷의 특성들을 보고 하도록 지시하는 것을 특징으로 한다. DNN, DNAI 별 특성을 활용하고자 하는 NF는 대상으로 하는 서비스 또는 사용자 트래픽을 한정하기 위한 트래픽 필터 정보를 제공하여야 하는데, 그 트래픽 필터의 전달 형태는 예컨대, 1) Service Data Flow Template (SDFT) 또는 Filter(SDFF), 2) Application ID, 3) Packet filter set, 4) Packet Flow Description (PFD) 등 의 형태로 전달이 될 수 있다. Service data flow는 패킷의 종단한 헤드 정보에 관련된 필터이다. 대표적으로 5 Tuple (source IP address, Destination IP address, Source Port number, Destination port number, protocol)의 형태로 사용될 수 있으며, 추가적으로 헤더에 활용 가능한 정보들 VLAN ID 등이 함께 조합 되어 사 용될 수 있다. UPF 또는 SMF에 응용을 탐지 하기 위한 규칙이 미리 Provisioning 되어 있는 경우 application ID를 통해 특정 서비스를 탐지 할 수 있다. Packet filter set는 UPF에서 QoS 규칙을 적용하기 위해서 사용될 필터로써, 예컨대, IP와 Ethernet 패킷에 적용할 수 있는 필터일 수 있다. 마지막으로 Packet Flow Description은 특정 AF가 특정 트래픽 플로우를 탐지 할 수 있도록 제공하는 서버 측 관련 주소, URL, 도메인 이름 등으로 구성 된 필터이며, 일반적으로 application ID와 매핑 되어 사용될 수 있다. AF가 본 개시를 활용하기 위한 절차는 도 10에 도시되어 있다. 도 10은 본 발명의 실시예에 따라, AF가 자신의 서비스를 위한 최적의 DNAI를 선택하고 라우팅을 요청하는 절차 를 도시한다. 도10의 첫번째 단계에서 AF는 NEF를 통하여 NWADF에 DNN, DNAI별 성능 분석을 요청 하기 위한 분석 서비스의 트 래픽을 탐지하기 위한 트래픽 관련 정보를 전달 한다. 이때 트래픽 관련 정보는 상술 한 SDFT, SDFF, application, packet filter set, 및/또는 PFD 등의 조합으로 구성될 수 있으며, 추가적으로 관심으로 하는 DNN 또는 DNAI를 한정하기 위해 선택적 인자로써 DNN와 DNAI가 함께 포함되어 요청 될 수 있다. 더불어 NEF는 NWDAF에 AF의 요청을 전달하기 전, AF가 본 분석 정보를 획들 할 수 있는지 여부에 관련된 인증을 수행 할 수 있다. 도 10의 두번째 단계에서, NEF의 요청을 받은 NWDAF는 요청 정보에 대한 DNN, DNAI별 서비스 트래픽과 관련된 정보를 수집 하기 위해 SMF 또는 UPF에서 트래픽 관련 정보를 수집한다. 2-1 단계는 SMF에 서비스 트래픽 관련 정보를 수집 하는 것을 요청하는 방법을 사용하며, 2-2 단계는 UPF에서 제공하는 SBI를 사용하여 서비스 트래픽 관련 정보를 수집한다. 2-1과 2-2 는 선택적으로 사용되거나 상황에 따라서 직접적인 SBI를 제공할 수 없는 UPF 의 경우에는 SMF를 통해서 수집하는 방법으로 함께 조합되어 사용 될 수 있다. 특정 DNN과 DNAI가 첫번째 단계 에서 포함되어 있다면, NWDAF는 이를 지원하는 UPF 또는 SMF만을 대상으로 트래픽 관련 정보를 수집 하도록 요 청 할 수 있다. 이 때, NWDAF가 특정 서비스와 연관 된 UPF와 SMF를 발견하는 과정에서 UDM에 저장되어 있는 정 보를 활용하거나, NRF를 사용하여 UPF 및 SMF를 발견 하는 과정이 추가적으로 수행 될 수 있다. 한편, 실시예에 따라서, 도 10의 두번째 단계는 , NWDAF가 이미 UPF 또는 SMF에서 분석 정보를 수집한 경우 생 략될 수 있다. 도 10의 세번째 단계는 NWDAF가 UPF 또는 SMF로부터 수집한 서비스 트래픽들의 DNAI 별 또는 DNN별 특성을 분석 하여 각 DNN, DNAI에 따른 DN의 성능을 분석 하는 단계 이다. 이때 분석 될 수 있는 정보로는 서버와 UPF 구간 의 지연(Delay), 에러율(Error Rate), 지터(jitter), 대역폭(bandwidth), 왕복 지연시간 (Round Trip Time), 최대 전송 패킷 크기 (Maximum Transmission Unit), 및/또는 중간 경로 장치 개수 (hop count)등이 포함될 수 있다. 도 10의 네번째 단계는 NWDAF가 분석한 정보를 분석을 요청한 NEF를 통해 AF에 전달 하는 단계로써 각 DNN, DNAI별로, 서비스 플로우가 다른 경로를 택했을 경우 분석되는 외부 DN의 트래픽 특성의 각각을 리스트 형태로 구성하여 NEF에 전달한다. 도 10의 다섯 번째 단계에서, AF는 NWDAF로부터 수신 DNN, DNAI별 정보를 기반으로 자신의 서비스를 제공을 위 한 최적의 DNAI를 선택한다. 도 10의 여섯 번째 단계에서, AF는 자신의 서비스 또는 트래픽이 특정 DNAI를 통해 제공될 수 있도록 하기 위해 NEF를 통해 AF Influence traffic routing 요청에 자신이 선택한 DNAI를 포함하여 요청을 보낸다. 이 때, DNAI 뿐만 아니라 3GPP에서 정의한 요청에 포함될 수 있는 인자들이 함께 전달 될 수 있다. 도 10의 일곱 번째 단계에서, PCF는 AF가 전달한 AF Influence traffic routing 요청을 고려하여 특정 PDU 세 션 또는 서비스의 DNAI를 선택한다. 도 10의 여덞 번째 단계는 PDU 세션을 UPF를 변경 하기 위해 SMF에 SM Policy 생성 또는 변경을 통하여 새로운 PCC 규칙을 내려준다. 도 10의 아홉 번째 단계에서 SMF와 UPF는 특정 PDU 세션을 변경하는 동작을 수행한다. [제 10 실시예] - SMF가 NWDAF를 통해 DNAI 별 네트워크 품질을 고려하여 DNAI를 선택 하는 방법 본 개시는 NWDAF가 상기 서술한 방법을 사용하여 UPF로부터 서비스 또는 QoS 플로우에 대한 정보를 수집하여 서 비스 별 DNAI에 대한 특성을 분석 하는 방법을 포함한다. 3GPP 5G 핵심망은 특정 DNN으로 연결되는 복수개의 DNAI를 운용할 수 있으며, 추가적으로 DNN이 다르더라도 DN 내에서 인터넷 또는 목적지 서버로 전달되는 경로가 제공될 수 있다. 따라서 특정 서버로 향하는 서비스 플로우는 DNN과 DNAI의 선택에 따라라 최종적으로 선택되는 PSA(PDU session Anchor)의 위치에 따라 서버와 각 UPF 사이 구간의 네트워크 특성이 달라 질 수 있다. 이러한 네트워크 특성의 예로는, 서버와 UPF 구간의 지연(Delay), 에러율(Error Rate), 지터(jitter), 대역폭 (bandwidth), 왕복 지연시간 (Round Trip Time), 최대 전송 패킷 크기 (Maximum Transmission Unit), 중간 경 로 장치 개수 (hop count)등이 포함될 수 있으며, 이는 패킷을 UPF에서부터 서버로 전달하는데 있어 영향을 미 치며, UE와 서버 사이의 종간 구간에 있어서 중요한 부분을 차지한다. 이러한 DNN, DNAI별 DN 내에서의 네트워크 성능을 분석을 하기 위해서, NWDAF는 UPF에 사용자 또는 서비스 트래 픽을 수집하기 위해서 상술한 방법을 이용하여 패킷을 수집하거나 패킷의 특성들을 보고 하도록 지시하는 것을 특징으로 한다. DNN, DNAI 별 특성을 활용하고자 하는 NF는 대상으로 하는 서비스 또는 사용자 트래픽을 한정하기 위한 트래픽 필터 정보를 제공하여야 하는데, 그 트래픽 필터의 전달 형태는 예컨대, 1) Service Data Flow Template (SDFT) 또는 Filter(SDFF), 2) Application ID, 3) Packet filter set, 4) Packet Flow Description (PFD) 등 의 형태로 전달이 될 수 있다. Service data flow는 패킷의 종단한 헤드 정보에 관련된 필터이다. 대표적으로 5 Tuple (source IP address, Destination IP address, Source Port number, Destination port number, protocol)의 형태로 사용될 수 있으며, 추가적으로 헤더에 활용 가능한 정보들 VLAN ID 등이 함께 조합 되어 사 용될 수 있다. UPF 또는 SMF에 응용을 탐지 하기 위한 규칙이 미리 Provisioning 되어 있는 경우 application ID를 통해 특정 서비스를 탐지 할 수 있다. Packet filter set는 UPF에서 QoS 규칙을 적용하기 위해서 사용될 필터로써, 예컨대, IP와 Ethernet 패킷에 적용할 수 있는 필터일 수 있다. 마지막으로 Packet Flow Description은 특정 AF가 특정 트래픽 플로우를 탐지 할 수 있도록 제공하는 서버 측 관련 주소, URL, 도메인 이름 등으로 구성 된 필터이며, 일반적으로 application ID와 매핑 되어 사용될 수 있다. SMF가 본 개시를 활용하기 위한 절차는 도 11에 도시되어 있다. 도 11은 본 발명의 실시예에 따라, SMF가 PDU 세션을 위해 최적의 DNAI를 제공하는 UPF를 선택 하는 절차를 도 시한다. 도11의 첫번째 단계에서 SMF는NWADF에 DNN, DNAI별 성능 분석을 요청 하기 위한 분석 서비스의 트래픽을 탐지하 기 위한 트래픽 관련 정보를 전달 한다. 이때 트래픽 관련 정보는 상술 한 SDFT, SDFF, application, packet filter set, 및/또는 PFD 등의 조합으로 구성될 수 있으며, 추가적으로 관심으로 하는 DNN 또는 DNAI를 한정하 기 위해 선택적 인자로써 DNN와 DNAI가 함께 포함되어 요청 될 수 있다. 더불어 NEF는 NWDAF에 AF의 요청을 전 달하기 전, AF가 본 분석 정보를 획들 할 수 있는지 여부에 관련된 인증을 수행 할 수 있다. 도 11의 두번째 단계에서 SMF의 요청을 받은 NWDAF는 요청 정보에 대한 DNN, DNAI별 서비스 트래픽과 관련된 정 보를 수집 하기 위해 SMF 또는 UPF에 트래픽 관련 정보를 수집한다. 2-1 단계는 SMF에 서비스 트래픽 관련 정보 를 수집 하는 것을 요청하는 방법을 사용하며, 2-2 단계는 UPF에서 제공하는 SBI를 사용하여 서비스 트래픽 관 련 정보를 수집한다. 2-1과 2-2 는 선택적으로 사용되거나 상황에 따라서 직접적인 SBI를 제공할 수 없는 UPF의 경우에는 SMF를 통해서 수집하는 방법으로 함께 조합되어 사용 될 수 있다. 특정 DNN과 DNAI가 첫번째 단계에서 포함되어 있다면, NWDAF는 이를 지원하는 UPF 또는 SMF만을 대상으로 트래픽 관련 정보를 수집 하도록 요청 할수 있다. 이 때, NWDAF는 특정 서비스와 연관 된 UPF와 SMF를 발견하는 과정에서 UDM에 저장되어 있는 정보를 활용하거나, NRF를 사용하여 UPF 및 SMF를 발견 하는 과정에 추가적으로 수행 될 수 있다. 이 과정에서 참여하 는 SMF는 요청을 보낸 SMF 뿐만 아니라 현재 핵심망에 배포되어 있는 모든 SMF가 대상이 될 수 있다. 한편, 실시예에 따라서, 도 11의 두번째 단계는, NWDAF가 이미 UPF 또는 SMF에 분석 정보를 수집한 경우 생략될 수 있다. 도 11의 세번째 단계는 NWDAF가 UPF 또는 SMF로부터 수집한 서비스 트래픽들의 DNAI 별 또는 DNN별 특성을 분석 하여 각 DNN, DNAI에 따른 DN의 성능을 분석 하는 단계 이다. 이때 분석 될 수 있는 정보로는 서버와 UPF 구간 의 지연(Delay), 에러율(Error Rate), 지터(jitter), 대역폭(bandwidth), 왕복 지연시간 (Round Trip Time), 최대 전송 패킷 크기 (Maximum Transmission Unit), 및/또는 중간 경로 장치 개수 (hop count)등이 포함될 수 있다. 도 11의 네번째 단계는 NWDAF가 분석한 정보를 분석을 요청한 NEF를 통해 AF에 전달 하는 단계로써 각 DNN, DNAI별로 서비스 플로우가 다른 경로를 택했을 경우 분석되는 외부 DN의 트래픽 특성의 각각을 리스트 형태로 구성하여 SMF에 전달한다. 도 11의 다섯 번째 단계는 AF는 NWDAF로부터 수신 DNN, DNAI별 정보를 기반으로 자신의 서비스를 제공을 위한 최적의 DNAI를 선택한다. 이 과정에서 특정 서비스뿐만 아니라, 현재 서비스가 제공되는 PDU 세션에서 제공되는 모든 서비스들에 대한 최적의 성능 분석을 통해 전체 서비스들을 고려하여 최적의 DNAI 선택을 할 수도 있다. 더불어, PDU 세션을 옮기지 않고 특정 서비스를 특정 DNAI로 옮기려고 하는 경우에는 UL CL (Uplink Classifier) 또는 BP (Branching Point)를 설치하여 복수개의 PDU Session Anchor(PSA)를 사용할 수 있도록 PDU 세션을 변경 할 수 있다. 도 11의 여섯 번째 단계는 SMF는 자신의 서비스 또는 트래픽이 특정 DNAI를 통해 제공될 수 있도록 하기 위해 특정 서비스를 제공하는 PDU 세션 또는 대상이 되는 PDU 세션을 변경하기 위해 UPF를 변경하거나 UPF 설정을 변 경 한다. 도 12는 본 발명의 일 실시예에 따른 네트워크 엔티티의 구조를 도시한다. 도 11의 네트워크 엔티티는 예컨대, 도 1의 네트워크 기능(NF)을 수행하는 네트워크 엔티티 중 어느 하나 일 수 있다. 예를 들면, 네트워크 엔티티 는 네트워크 데이터 분석 기능(NWDAF)을 수행하는 네트워크 엔티티, 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티, 사용자 평면 기능(UPF)을 수행하는 네트워크 엔티티 등일 수 있다. 도 12를 참고하면, 네트워크 엔티티는 송수신부 , 제어부 , 저장부 을 포함할 수 있다. 본 발명에서 제어부는, 회로 또는 어플리케이션 특정 통합 회로 또는 적어도 하나의 프로세서라고 정의될 수 있다. 송수신부 는 다른 네트워크 엔티티와 신호를 송수신할 수 있다. 송수신부는 예를 들어, 기지국으로 부터 시스템 정보를 수신할 수 있으며, 동기 신호 또는 기준 신호를 수신할 수 있다. 제어부 은 본 발명에서 제안하는 실시예에 따른 네트워크 엔티티의 전반적인 동작을 제어할 수 있다. 예 를 들어, 제어부 는 도 2 내지 11을 참고하여 상술한 절차에 따른 동작을 수행하도록 각 블록 간 신호 흐 름을 제어할 수 있다. 예컨대, 제어부는 본 발명의 실시예에 따른 이동 통신 시스템에서 서비스 탐지를 제공하기 위해 본 발명에서 제안하는 동작을 제어할 수 있다. 저장부 는 상기 송수신부 를 통해 송수신되는 정보 및 제어부 을 통해 생성되는 정보 중 적 어도 하나를 저장할 수 있다. 예를 들어, 저장부 는 상술한 실시예에 따른 서비스 탐지를 위해 요구되는 정보 등을 저장할 수 있다. 도 13은 본 발명의 실시예에 따른, 이동 통신 시스템에서 사용자 평면 기능(UPF)을 수행하는 제1 네트워크 엔티 티의 방법을 나타낸다. 도 13의 실시예에서는 도 1 내지 11, 특히, 도 2 내지 3의 실시예에서 상술한 설명과 중 복된 설명은 생략한다. 도 13을 참조하면, 제1 네트워크 엔티티는 네트워크 데이터 분석 기능(NWDAF)을 수행하는 제2 네트워크 엔티티 로부터, 서비스 탐지(detection)를 위한 적어도 하나의 패킷의 데이터의 전송을 요청하는 요청을 수신한다 (S1310). 실시예로서, 상기 요청은, 상기 제1 엔티티에 의해 새로운 패킷 플로우가 탐지된 경우, 상기 새로운 패킷 플로 우에 포함된 적어도 하나의 패킷의 데이터의 전송을 요청하는 제1 요청 또는 특정 시간 구간(period) 동안의 모 든 패킷의 데이터의 전송을 요청하는 제2 요청일 수 있다. 상기 제1 요청은 상기 도 2의 실시예의 이벤트 구독 요청일 수 있고, 상기 제2 요청은 상기 도 3의 실시예의 이벤트 구독 요청일 수 있다. 실시예로서, 상기 제1 요청은, 상기 제1 요청과 연관된 식별 정보, 전송될 패킷의 수를 지시하는 정보, 또는 상 기 패킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보 중 적어도 하나를 포함할 수 있다. 실시예로서, 상기 제1 요청은, 특정 트래픽에 대한 필터 정보를 더 포함하고, 상기 필터 정보는 상기 특정 트래픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별 정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별(DNAI) 정보, 단일 네트워크 슬라이스 선택 보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함할 수 있다. 실시예로서, 상기 제2 요청은, 상기 제2 요청과 연관된 식별 정보, 상기 특정 시간 구간의 길이에 대한 정보 또 는 상기 패킷의 데이터가 상기 패킷의 페이로드를 포함하는지를 지시하는 정보 중 적어도 하나를 포함하는, 방 법. 실시예로서, 상기 제2 요청은, 특정 트래픽에 대한 필터 정보를 더 포함하고, 상기 필터 정보는 상기 특정 트래 픽과 연관된, 단말의 식별 정보, 단말의 그룹에 대한 정보, PDU 세션의 식별 정보, 데이터 네트워크 이름(DNN) 정보, 데이터 네트워크 접속 식별자(DNAI) 정보, 단일 네트워크 슬라이스 선택 보조(S-NSSAI) 정보 또는 시간 정보 중 적어도 하나를 포함할 수 있다. 제1 네트워크 엔티티는 상기 요청에 기초하여, 상기 적어도 하나의 패킷의 데이터를 획득한다(S1320). 실시예로서, 상기 요청이 제1 요청인 경우, 제1 네트워크 엔티티는 상기 제1 요청에 기초하여, 상기 새로운 패 킷 플로우를 탐지하고, 상기 새로운 패킷 플로우에 포함된 적어도 하나의 패킷의 데이터를 획득하는 단계를 포 함할 수 있다. 실시예로서, 상기 요청이 제2 요청인 경우, 제1 네트워크 엔티티는, 상기 제2 요청에 기초하여, 상기 특정 시간 구간을 식별하고, 상기 특정 시간 구간 동안의 모든 패킷의 데이터를 획득하는 단계를 포함할 수 있다. 제1 네트워크 엔티티는 상기 제2 네트워크 엔티티로, 상기 적어도 하나의 패킷의 데이터를 전송할 수 있다 (S1330). 이렇게 전송된 적어도 하나의 패킷의 데이터는 상기 제2 네트워크 엔티티에 의해 분석될 수 있다. 도 14는 본 발명의 실시예에 따른, 이동 통신 시스템에서 네트워크 데이터 분석 기능(NWDAF)을 수행하는 수행하 는 제1 네트워크 엔티티의 방법의 방법을 나타낸다. 도 14의 실시예에서는 도 1 내지 11, 특히, 도 9 내지 11의 실시예에서 상술한 설명과 중복된 설명은 생략한다. 제1 네트워크 엔티티는 제2 네트워크 엔티티로부터, 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 요청 하는 요청을 수신한다(S1410). 이때, 상기 전송 경로는 사용자 평면 기능(UPF)를 수행하는 제3 네트워크 엔티티와 상기 서비스를 제공하는 외 부 서버 간의 전송 경로일 수 있다. 실시예로서, 상기 전송 경로는 데이터 네트워크 접속 식별자(DNAI) 정보와 연관될 수 있다. 제1 네트워크 엔티티는 상기 요청에 기초하여, 상기 서비스에 대한 전송 경로 별 네트워크 성능의 분석을 수행 한다(S1420). 제1 네트워크 엔티티는 상기 제2 네트워크 엔티티로, 상기 분석의 결과를 전송한다(S1420). 실시예로서, 상기 제2 네트워크 엔티티는 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티, 정책 과금 기능 (PCF)을 수행하는 네트워크 엔티티 또는 어플리케이션 기능(AF)을 수행하는 네트워크 엔티티 중 하나일 수 있다. 각각에 대한 절차는 도 9 내지 11의 실시예를 참조하여 상술한 바와 같다. 실시예로서,상기 제2 네트워크 엔티티가 세션 관리 기능(SMF)을 수행하는 네트워크 엔티티인 경우, 상기 분석의 결과는, 상기 제2 네트워크 엔티티에 의해, 상기 제3 네트워크 엔티티를 선택하기 위해 사용될 수 있다. 이에 대하여는 도 11의 실시예를 참조하여 상술한 바와 같다. 실시예로서, 상기 제2 네트워크 엔티티가 상기 정책 과금 기능(PCF)을 수행하는 네트워크 엔티티 또는 상기 어 플리케이션 기능(AF)을 수행하는 네트워크 엔티티인 경우, 상기 분석의 결과는, 상기 제2 네트워크 엔티티에 의 해, 상기 서비스와 연관된 PDU 세선에 대한 데이터 네트워크 접속 식별자(DNAI) 정보를 결정하기 위해 사용될 수 있다. 각각에 대하여는 도 9 및 10의 실시예를 참조하여 상술한 바와 같다."}
{"patent_id": "10-2019-0120034", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상에서 본 명세서와 도면에 개시된 실시 예들은 본 발명의 내용을 쉽게 설명하고, 이해를 돕기 위해 특정 예 를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 또한, 상술한 여러 가지 실시 예중 하 나 이상이 결합되어 수행될 수 있음은 물론이다. 따라서, 본 발명의 범위는 여기에 개시된 실시 예들 이외에도 본 개시를 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한 다."}
{"patent_id": "10-2019-0120034", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 통신 시스템의 구성을 나타낸다. 도 2는 본 발명의 실시예에 따라, UPF를 통해 특정 패킷 플로우의 초기 패킷들을 전달 받기 위한 절차를 도시한 다. 도 3은 본 발명의 실시예에 따라, UPF를 통해 특정 패킷들을 모두 전달 받기 위한 절차를 도시한다. 도 4는 본 발명의 실시예에 따라, NWDAF가 SMF 또는 UPF를 통해 수집한 데이터를 활용하여 새로운 패킷 플로우 를 탐지하는 방법을 도시한다. 도 5는 본 발명의 실시예에 따라, NEF가 NWDAF가 탐지한 새로운 패킷 플로우를 저장하는 절차를 도시한다. 도 6는 본 발명의 실시예에 따라, AF가 자신의 패킷 플로우 정보들에 대한 분석 정보를 제공 받는 절차를 도시 한다. 도 7은 본 발명의 실시예에 따라, PCF가 새로운 서비스가 탐지되었을 경우 알림을 받는 절차를 도시한다. 도 8은 본 발명의 실시예에 따라, UPF로부터 패킷 플로우에 대한 정보를 수집하는 절차를 도시한다. 도 9는 본 발명의 실시예에 따라, PCF가 특정 서비스를 위해 최적의 DNAI를 선택하는 절차를 도시한다. 도 10은 본 발명의 실시예에 따라, AF가 자신의 서비스를 위한 최적의 DNAI를 선택하고 라우팅을 요청하는 절차 를 도시한다. 도 11은 본 발명의 실시예에 따라, SMF가 PDU 세션을 위해 최적의 DNAI를 제공하는 UPF를 선택 하는 절차를 도 시한다. 도 12는 본 발명의 일 실시예에 따른 네트워크 엔티티의 구조를 도시한다. 도 13은 본 발명의 실시예에 따른, 이동 통신 시스템에서 사용자 평면 기능(UPF)을 수행하는 제1 네트워크 엔티 티의 방법을 나타낸다. 도 14는 본 발명의 실시예에 따른, 이동 통신 시스템에서 네트워크 데이터 분석 기능(NWDAF)을 수행하는 수행하 는 제1 네트워크 엔티티의 방법의 방법을 나타낸다."}
