{"patent_id": "10-2020-0105913", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0025342", "출원번호": "10-2020-0105913", "발명의 명칭": "로지스틱 회귀를 이용한 아크신호 검출방법", "출원인": "강원대학교산학협력단", "발명자": "김만배"}}
{"patent_id": "10-2020-0105913", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 신경망을 이용하여 아크신호를 검출하는 방법에 있어서,전기회로로부터 검출되는 시계열 신호를 입력 받고, 로지스틱 회귀 분석을 이용하여 상기 시계열 신호를 학습하여 상기 학습에 의해 갱신되는 최종 회귀 파라미터와 주파수 대역 중에서 아크신호 분류성능이 가장 높은 최적대역폭을 추출하여 제공하는 신경망 학습 단계; 및상기 시계열 신호, 상기 최종 회귀 파라미터 및 상기 최적 대역폭을 입력 받아 상기 로지스틱 회귀분석을 이용하여 상기 시계열 신호가 아크신호인지 여부를 판단하는 아크신호 검출단계를 포함하는 로지스틱 회귀를 이용하는 아크신호 검출방법."}
{"patent_id": "10-2020-0105913", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 시계열 신호는 시간에 따른 전류의 세기를 나타내는 전류신호인 것을 특징으로 하는 로지스틱 회귀를 이용하는 아크신호 검출방법."}
{"patent_id": "10-2020-0105913", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 신경망 학습단계는,상기 시계열 신호를 입력 받고, 상기 시계열 신호가 정상신호인 경우 레이블을 1로 할당하고, 아크신호인 경우레이블을 0으로 할당하는 신호입력단계;상기 시계열 신호를 푸리에 변환하여 주파수 스펙트럼 형태로 변환하는 푸리에 변환단계;상기 주파수 스펙트럼의 수직평균(X)을 산출하는 평균 산출 단계; 및상기 로지스틱 회귀 분석을 이용하여 상기 최종 회귀 파라미터 및 상기 최적 대역폭 구간을 설정하는 로지스틱회귀 분석 단계를 더 포함하고,상기 수직평균(X)은 상기 행렬형태의 스펙트럼 버퍼에서 각 열의 평균값을 의미하는 것인 로지스틱 회귀를 이용하는 아크신호 검출방법."}
{"patent_id": "10-2020-0105913", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 평균 산출 단계는,상기 주파수 스펙트럼을 동일한 간격을 갖는 복수의 구간으로 분할하는 구간분할단계;상기 구간의 분할 개수와 동일한 크기(K)를 갖는 스펙트럼 버퍼를 생성하는 버퍼 생성단계;상기 각 구간의 주파수 스펙트럼의 크기를 [0,1] 범위로 정규화하고, 상기 주파수 스펙트럼을 상기 구간의 분할순서와 동일한 순서를 갖는 스펙트럼 버퍼에 저장하는 정규화 및 저장단계;상기 스펙트럼 버퍼의 순서와 상기 스펙트럼 버퍼의 크기가 같은지 여부를 판단하는 단계; 및공개특허 10-2022-0025342-3-상기 스펙트럼 버퍼에 저장된 복수의 주파수 스펙트럼 구간들의 평균을 산출하는 단계를 포함하는 것을 특징으로 하는 로지스틱 회귀를 이용하는 아크신호 검출방법."}
{"patent_id": "10-2020-0105913", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 로지스틱 회귀 분석단계는,회귀 파라미터의 초기값을 설정하는 단계(141);상기 초기값과 상기 수직평균(X)을 로지스틱 시그모이드 함수에 대입하여 아크 및 정상신호 여부를 복수 회 학습하고, 상기 학습횟수만큼 회귀 파라미터 값을 경사하강법(gradient descent)으로 갱신하는 단계; 및상기 학습 결과에 따라 상기 복수의 구간 중에서 분류 정확도가 가장 높은 구간을 추출하고 해당 구간의 주파수범위를 최적 대역폭([*, *])으로 지정하는 최적 대역폭 추출단계를 더 포함하는 것을 특징으로 하는 로지스틱 회귀를 이용한 아크신호 검출방법."}
{"patent_id": "10-2020-0105913", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 아크신호 검출단계는,상기 시계열 신호, 상기 최종 회귀 파라미터 및 상기 최적 대역폭을 입력 받는 신호 입력단계;상기 시계열 신호를 푸리에 변환하여 주파수 스펙트럼 형태로 변환하는 푸리에 변환단계;상기 주파수 스펙트럼에서 상기 최적 대역폭에 해당하는 구간 데이터를 추출하는 구간데이터 추출단계;상기 구간 데이터에 학습된 상기 신경망을 통해 얻은 상기 최종 회귀 파라미터를 곱하여 오즈(odds)를 산출하는오즈 산출 단계; 및상기 오즈(odds)를 로지스틱 시그모이드 함수에 대입하여 아크신호인지 여부를 판단하는 아크정상 판단 단계를더 포함하는 것을 특징으로 하는 로지스틱 회귀를 이용한 아크신호 검출방법."}
{"patent_id": "10-2020-0105913", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 아크정상 판단 단계는,복수의 연속되는 로지스틱 시그모이드 함수 값()을 저장하는 단계;상기 복수의 로지스틱 시그모이드 함수값()을 이용하여 이동평균값을 산출하는 단계; 및상기 이동평균값 및 로지스틱 시그모이드 함수를 이용하여 아크신호인지 여부를 판단하는 단계를 더 포함하는것을 특징으로 하는 로지스틱 회귀를 이용한 아크신호 검출방법."}
{"patent_id": "10-2020-0105913", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항 내지 7항 중 어느 한 항의 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 판독 가능한 기록매체."}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 아크신호를 인공신경망을 이용하여 검출하는 방법에 관한 것으로서, 전기회로로부터 검출되는 시계열 신호를 입력 받고, 로지스틱 회귀 분석을 이용하여 상기 시계열 신호를 학습하여 학습에 의해 갱신되는 최종 회 귀 파라미터와 주파수 대역 중에서 아크신호 분류성능이 가장 높은 최적 대역폭을 추출하여 제공하는 신경망 학 습 단계 및 상기 시계열 신호, 상기 최종 회귀 파라미터 및 상기 최적 대역폭을 입력 받아 상기 로지스틱 회귀분석을 이용하여 상기 시계열 신호가 아크신호인지 여부를 판단하는 아크신호 검출단계를 포함한다. 본 발명의 일 실시 예에 따르면, 신경망 모델의 계산 복잡도를 낮추어 아크신호 검출에 소요되는 시간을 줄임과 동시에 단말기에의 적용이 가능하다."}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 아크신호를 인공신경망을 이용하여 검출하는 방법에 관한 것으로서, 더욱 상세하게는 로지스틱 회귀 분석방법을 이용하여 신경망 모델의 계산 복잡도를 낮추어 아크신호 검출에 소요되는 시간을 줄임과 동시에 단 말기에의 적용을 가능하게 하는 방법에 관한 것이다."}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "화재의 가장 높은 원인에 해당하는 전기화재의 공통점은 아크(Arc)를 동반한다는 것이다. 가정 또는 공장의 화 재로 인한 물질적, 금전적 손실을 방지하기 위해 아크 검출은 매우 중요한 기술에 해당한다. 이에, 화재 발생을 예방하기 위한 수단으로써 아크신호를 검출하는 방법에 대한 많은 연구가 이루어져왔다. 특히, 기존의 축적된 많은 양의 데이터를 이용하여 컴퓨터를 학습시킨 뒤 컴퓨터가 스스로 인지, 추론, 판단할 수 있게 하는 딥러닝 기술이 최근 관심을 받고 있다. 이러한 기술에서는 푸리에 변환 또는 웨이블릿(wavelet)변 환을 이용하여 정상신호와 아크신호를 분별할 수 있는 특징들을 주파수 도메인에서 찾은 후에 이를 활용하여 아 크신호를 검출하는 방식을 차용한다. 그러나, 전술한 딥러닝 모델들은 계산 복잡도가 높아 아크신호의 검출에 많은 시간이 소요된다는 점, 단말기에 접목하는 것이 매우 어렵다는 점 및 실제 기술의 적용에 어려움이 있다는 점에서 문제점을 가진다."}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위해, 본 발명은 로지스틱 회귀 기계학습 기법을 사용하여 딥러닝 모델의 계산 복잡 도를 낮춤으로써 아크신호의 검출에 소요되는 시간을 줄이고, 단말기에의 적용이 가능한 것을 목적으로 한다."}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 인공지능 신경망을 이용하여 아크신호를 검출하는 방법에 있어서, 로지스틱 회귀를 이용하여 아크신 호를 검출하는 방법에 관한 것이다. 본 발명의 일 실시 예에 따른 아크신호를 검출하는 방법은, 전기회로로부터 검출되는 시계열 신호를 입력 받고, 로지스틱 회귀 분석을 이용하여 상기 시계열 신호를 학습하 여 학습에 의해 갱신되는 최종 회귀 파라미터와 주파수 대역 중에서 아크신호 분류성능이 가장 높은 최적 대역 폭을 추출하여 제공하는 신경망 학습 단계 및 상기 시계열 신호, 상기 최종 회귀 파라미터 및 상기 최적 대역폭을 입력 받아 상기 로지스틱 회귀분석을 이용하여 상기 시계열 신호가 아크신호인지 여부를 판단하는 아 크신호 검출단계를 포함한다. 또한, 본 발명의 일 실시 예에 따른 아크신호 검출방법은, 시계열 신호가 시간에 따른 전류의 세기를 나타내는 전류신호인 것을 특징으로 한다. 또한, 본 발명의 일 실시 예에 따른 아크신호 검출방법은, 신경망 학습 단계는 시계열 신호를 입력 받고, 시계열 신호가 정상신호인 경우 레이블을 1로 할당하고, 아 크신호인 경우 레이블을 0으로 할당하는 신호입력단계, 시계열 신호를 푸리에 변환하여 주파수 스펙트럼 형태로 변환하는 푸리에 변환단계, 주파수 스펙트럼의 수직평균(X)을 산출하는 평균 산출 단계 및 로 지스틱 회귀 분석을 이용하여 최종 회귀 파라미터 및 최적 대역폭 구간을 설정하는 로지스틱 회귀 분석 단계 를 더 포함하고, 수직평균(X)은 행렬형태의 스펙트럼 버퍼에서 각 열의 평균값을 의미한다. 또한, 본 발명의 일 실시 예에 따른 아크신호 검출방법은, 평균 산출 단계는, 주파수 스펙트럼을 동일한 간격을 갖는 복수의 구간으로 분할하는 구간분할단계, 구간의 분할 개수와 동일한 크기(K)를 갖는 스펙트럼 버퍼를 생성하는 버퍼 생성단계, 각 구간의 주파수 스펙트럼의 크기를 [0,1] 범위로 정규화하고, 주파수 스펙트럼을 구간의 분할 순서와 동일한 순서를 갖는 스펙 트럼 버퍼에 저장하는 정규화 및 저장단계, 스펙트럼 버퍼의 순서와 스펙트럼 버퍼의 크기가 같은지 여부 를 판단하는 단계 및 스펙트럼 버퍼에 저장된 복수의 주파수 스펙트럼 구간들의 수직평균(X)을 산출하는 단계를 포함한다. 또한, 본 발명의 일 실시 예에 따른 아크신호 검출방법은, 로지스틱 회귀 분석단계는 회귀 파라미터의 초기값을 산출하는 단계, 초기값과 상기 수직평균(X)을 로지스틱 시그모이드 함수에 대입하여 아크 및 정상신호 여부를 복수 회 학습하고, 상기 학습횟수만큼 회귀 파 라미터 값을 경사하강법(gradient descent)으로 갱신하는 회귀 파라미터 갱신 단계 및 학습 결과에 따라 복수의 구간 중에서 분류 정확도가 가장 높은 구간을 추출하고 해당 구간의 주파수 범위를 최적 대역폭([ *, *])으로 지정하는 최적 대역폭 추출단계를 더 포함한다. 또한, 본 발명의 일 실시 예에 따른 아크신호 검출방법은, 상기 아크신호 검출단계는 시계열 신호, 최종 회귀 파라미터 및 최적 대역폭을 입력 받는 신호 입력단계 , 시계열 신호를 푸리에 변환하여 주파수 스펙트럼 형태로 변환하는 푸리에 변환단계, 주파수 스펙트 럼에서 최적 대역폭에 해당하는 구간 데이터를 추출하는 구간데이터 추출단계, 구간 데이터에 학습된 신경 망을 통해 얻은 최종 회귀 파라미터를 곱하여 오즈(odds)를 산출하는 오즈 산출 단계, 오즈(odds)를 로지 스틱 시그모이드 함수에 대입하여 아크신호인지 여부를 판단하는 아크정상 판단 단계를 더 포함한다. 또한, 본 발명의 일 실시 예에 따른 아크신호 검출방법은, 아크정상 판단 단계는, 복수의 연속되는 로지스틱 시그모이드 함수 값( )을 저장하는 단계, 복수의 로지스틱 시그모이드 함수값( )을 이용하여 이동평균값을 산출하는 단계 및 이동평균값 및 로지스틱 시그 모이드 함수를 이용하여 아크신호인지 여부를 판단하는 단계를 더 포함한다. 또한, 본 발명의 일 실시 예로서, 전술한 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 판독 가능한 기록 매체가 제공된다."}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시 예에 따르면, 딥러닝 모델에 있어서, 로지스틱 회귀 기계학습 기법을 사용함으로써 계산의 복잡도를 낮추어 아크검출에 소요되는 시간을 줄일 수 있다. 또한, 본 발명의 일 실시 예에 따르면, 아크신호 검출의 정확도를 유지하면서 동시에 아크신호 검출에 소요되는 속도의 개선이 가능하다."}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 이 발명을 실시하기 위한 구체적인 내용으로서, 이 발명에 따른 목표지도 생성방법 및 시스템의 실시 예 및 목표지도 생성방법 및 시스템의 작동에 관여하는 요소들에 대해 설명한다. 본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 명세서 전체에서 어떤 부분 이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, \"그 중간에 다른 구성을 사이에 두고\" 연결되어 있는 경우도 포함한다. 아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시 예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. <아크신호 검출에 있어서, 로지스틱 회귀분석의 적용> 데이터의 통계적 분석에 있어서, 독립변수와 종속변수라는 개념이 사용된다. 독립변수란 다른 변수의 변화와는 관계없이 독립적으로 변화할 수 있는 변수를 의미한다. 종속변수란 독립변수의 변화에 따라 그 영향으로 변하는 변수를 의미한다. 아크신호 검출 방법에 관한 본 발명은 주파수 대역(frequency bandwidth)을 독립변수로, 아크 신호인지 여부(즉, 아크 또는 정상)를 종속변수로 사용한다. 회귀분석(regression analysis)이란 한 개의 종속변수와 여러 개의 독립변수간의 상호관련성에 대해 분석할 때 가장 널리 사용되는 분석방법이다. 그러나 일반적인 회귀분석은 독립변수들에 의해 종속변수의 변화가 선형으로 변한다고 가정하기 때문에 아크신호의 검출과 같이 종속변수가 연속형이 아닌 이분형인 경우(즉, 종속변수가 아 크 또는 정상의 아크 발생유무로 표시되는 이항적인 사건인 경우)에는 적합하지 않다. 따라서, 본 발명에서는 아크신호 검출에 있어서, 로지스틱 회귀분석을 사용한다. 로지스틱 회귀분석은 원래 모 델 식은 비선형이지만 로짓 변환을 이용하여 계수가 선형적인 성질을 갖도록 하는 분석방법으로 본 발명과 같이 종속변수가 이분형인 경우에 적합하다. 도 1은 본 발명에서 아크신호 검출 판단방법으로 사용되는 로지스틱 시그모이드 함수를 나타내는 그래프이다. 도 1에 나타난 일반적인 로지스틱 시그모이드 함수는 아래 [수학 식 1]과 같이 표현된다. 로지스틱 시그모이드 함수를 이용하면 전기회로에서 검출되는 전류신호가 아크신호인 확률을 0과 1사이의 값으로 나타낼 수 있다. 즉, 전기회로에서 검출되는 전류신호가 아크신호 인지여부를 판단하는 방법에 있어서, 로지스틱 시그모이드 함 수의 결과 값인 가 0.5 이상이면 정상신호, 0.5 미만이면 아크신호로 판정한다.수학식 1"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 [수학 식 1]에 있어서, 변수 z는 오즈(odds)에 로짓변환을 수행한 것이다. 오즈란 어떤 사건이 발생할 확 률을 사건이 발생하지 않을 확률로 나눈 값을 의미하며 성공확률이 실패확률에 비해 몇 배 더 높은가에 대한 정 보를 제공하므로 변수간의 관련성을 분석하는 연구에 많이 사용된다. 예를 들어, 오즈가 1/4이라면, 어떤 사건 의 성공확률은 1/5이고, 실패확률은 4/5가 된다. 즉, 오즈를 통해 어떤 사건은 4번 실패할 동안 1번 성공하는 것으로 해석할 수 있다. 본 발명에서 오즈에 로짓변환을 수행한 것을 변수로 사용하는 이유는 본 발명의 종속변수(아크신호인지 여부)가 이분형이기 때문이다. 즉, 본 발명의 종속변수와 독립변수를 사용하여 설계한 모델식이 비선형이므로 로짓변환 을 통해 계수가 선형적인 성질을 갖도록 하여 계산이 용이하도록 하기 위함이다. 아래 [수학 식 2]는 종속변수가 선형인 경우에 설계되는 회귀분석 모델식이며, 아래 [수학 식 3]은 종속변수가 비선형인 경우에 설계되는 회귀분석 모델식이다. 또한, 아래 [수학 식 4]는 비선형 회귀분석 모델식에 로짓변환 을 수행하여 계수가 선형적인 성질을 갖도록 한 것이다. 수학식 2"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 3"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 4"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이때, 위의 [수학 식 2]내지 [수학 식 4]에서 x는 독립변수를, Y 및 P는 종속변수를, 는 각 독립변수의 영향력 을 나타내는 회귀 파라미터를 의미한다. 본 발명에 대입하면 x는 주파수 대역(frequency bandwidth)이고, P는 정상신호인 확률이며, 1-P는 아크신호인 확률이다. [수학 식 4]를 이용하면, 주어진 주파수 대역에서 아크신호인지 여부가 주파수 대역에 대한 선형식으로 표현된 다. 즉, 전기회로에서 검출되는 전류신호의 주파수 대역을[수학 식 4]에 대입하여 z를 산출하고, z를 [수학 식 1]의 로지스틱 시그모이드 함수에 대입하면 전류신호가 아크신호인지 여부를 판단할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 로지스틱 회귀분석을 이용한 아크신호 검출방법의 순서도이다. 도 2를 참조하면, 본 발명의 일 실시 예에 따른 로지스틱 회귀분석을 이용한 아크신호 검출방법은 신경망 학습 단계 및 아크신호 검출단계를 포함한다. 즉, 본 발명의 일 실시 예에 따른 로지스틱 회귀분석을 이용한 아크신호 검출방법은 신경망 학습단계에서 신경망이 전기회로로부터 검출되는 시계열 신호를 로지스틱 회귀 분석을 이용하여 학습하고, 최종 회귀 파라미 터( )와 주파수 대역의 전체 범위에서 분류성능이 가장 우수한 최적 대역폭([ *, *])을 찾아 다음 단계인 아 크신호 검출단계의 신경망에 제공하고, 아크신호 검출단계에서는 학습된 신경망이 시계열 신호, 최종 회귀 파라미터 및 최적 대역폭을 입력 받아 로지스틱 회귀 분석을 이용하여 시계열 신호가 아크신호인지 여부를 판단한다. 이하 각 단계에 대하여 자세히 설명한다. <로지스틱 회귀분석을 이용한 신경망 학습> 도 3은 본 발명의 일 실시 예에 따른 신경망을 학습시키는 단계의 순서도이다. 도 3을 참조하면, 본 발명의 일 실시 예에 따른 신경망 학습 단계는 시계열 신호를 입력 받고, 시계열 신 호가 정상신호인 경우 레이블을 1로 할당하고, 아크신호인 경우 레이블을 0으로 할당하는 신호입력단계, 시계열 신호를 푸리에 변환하여 주파수 스펙트럼 형태로 변환하는 푸리에 변환단계, 주파수 스펙트럼의 수 직평균(X)을 산출하는 평균 산출 단계 및 로지스틱 회귀 분석을 이용하여 최종 회귀 파라미터 및 최적 대 역폭 구간을 설정하는 로지스틱 회귀 분석 단계를 포함한다. 수직평균(X)은 행렬형태의 스펙트럼 버퍼에서 각 열의 평균값을 의미한다. 본 발명의 신경망 학습단계는 먼저 신호입력단계에서 시계열 신호를 입력 받고 신호의 종류에 따라 레이블을 할당한다. 할당된 레이블을 이용하여 신경망을 학습시키며, 학습된 신경망을 이용하여 전류신호가 아 크신호인지 여부를 판단하는 과정에서 산출된 결과값이 0 또는 1인지 여부가 판단기준이 된다. 즉, 레이블은 신 경망의 판단과정에서 결과값이 지향하는 정답으로 활용될 수 있다. 도 4는 본 발명의 일 실시 예에 따른 신경망 학습단계에서 사용되는 시계열 신호들의 예이다. 도 4를 참조하면 본 발명의 일 실시 예에 따른 신경망 학습단계에서 신경망을 학습시키는 데에 사용되는 시계열 신호들의 예를 알 수 있다. 도 4(a)는 정상신호에 해당하고, 도 4(b)는 아크신호에 해당한다. 시계열 신 호는 정상신호와 아크신호로 나뉘며 아크 생성기(arc generator)를 사용하여 제작된다. 이때, 아크 생성기에는 복수 개의 부하가 사용될 수 있다. 신호입력단계를 통해 레이블이 할당된 시계열 신호는 푸리에 변환단계를 통해 시간 영역의 함수에서 주파수 영역의 함수로 변환된다. 전기회로에서 검출되는 전류신호는 시간의 경과에 따라 전류의 세기가 변화하 는 것이므로 시계열 신호에 해당한다. 그러나, 아크신호와 정상신호는 특정 주파수 대역폭에서 다른 특징을 가 지므로 주파수 영역에서의 특징 분석을 통해 전류신호가 아크신호인지 여부를 판단할 수 있다. 따라서 시계열 신호를 입력 받아 푸리에 변환을 통해 주파수 성분으로 분해하여 주파수 스펙트럼 형태로 변환하여 특징을 분석 한다. 이하, 평균 산출 단계 및 로지스틱 회귀 분석 단계에 대하여 보다 자세히 설명한다. 도 5는 본 발명의 일 실시 예에 따른 평균 산출단계의 순서도이다. 도 5를 참조하면, 본 발명의 일 실시 에에 따른 평균 산출 단계는 주파수 스펙트럼을 동일한 간격( )을 갖는 복수의 구간으로 분할하는 구간분할단계, 구간의 분할 개수와 동일한 크기(K)를 갖는 스펙트럼 버퍼 를 생성하는 버퍼 생성단계, 각 구간의 주파수 스펙트럼의 크기(A)를 [0,1] 범위로 정규화하고, 주파수 스 펙트럼을 구간의 분할 순서와 동일한 순서를 갖는 스펙트럼 버퍼에 저장하는 정규화 및 저장단계, 스펙트 럼 버퍼의 순서와 스펙트럼 버퍼의 크기가 같은지 여부를 판단하는 단계 및 스펙트럼 버퍼에 저장된 복수 의 주파수 스펙트럼 구간들의 수직평균(X)을 산출하는 단계를 포함한다. 도 6은 주파수 스펙트럼을 복수의 구간으로 분할하고 크기를 정규화하여 스펙트럼 버퍼에 저장하는 과정을 나타 낸다. 도 6을 참조하면, 구간분할단계, 버퍼 생성단계 및 정규화 및 저장단계를 더욱 명확히 이해할 수 있다. 구간분할단계는 시계열 신호를 푸리에 변환하여 주파수 범위가 [ ]인 주파수 스펙트럼을 동일한 간격( )을 갖는 L개의 구간으로 분할하므로 동일한 간격( )는 아래 [수학 식 5]와 같이 계산된다.수학식 5"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "버퍼 생성 단계는 주파수 스펙트럼을 분할한 구간의 개수(L)와 동일한 크기(K)를 갖는 스펙트럼 버퍼를 생 성한다. 스펙트럼 버퍼란, 분할한 구간들의 각 주파수 별 주파수 스펙트럼 수직평균(X)을 산출하기 위해 분할한 구간들을 임시로 저장하는 공간이다. 정규화 및 저장단계는 로지스틱 회귀분석에 적합하도록 각 구간에서의 주파수 스펙트럼의 크기(A)를 [0, 1]로 정규화하여, 입력순서대로 스펙트럼 버퍼에 구간별 주파수 스펙트럼을 정규화한 값을 각각 저장한다. 스펙트럼 버퍼의 순서와 스펙트럼 버퍼의 크기가 같은지 여부를 판단하는 단계는 주파수 구간을 정규화한 값이 저장되는 스펙트럼 버퍼의 순서가 스펙트럼 버퍼의 크기와 같아질 때까지 정규화 및 저장단계를 반복 한다. 도 7은 스펙트럼 버퍼에 저장된 복수개의 주파수 스펙트럼의 수직평균(X)을 산출하는 과정을 도시한다. 도 7을 참조하면, 스펙트럼 버퍼에 저장된 복수의 주파수 스펙트럼 구간들의 수직평균(X)을 산출하는 단계(13 5)를 더욱 명확히 이해할 수 있다. 도 7(a)는 스펙트럼 버퍼에 저장된 K개의 주파수 구간을 나타낸다. 도 7(a)에 표현된 에서 는 주파수 스펙트 럼에서 몇 번째 주파수 인지를 나타내고 는 스펙트럼 버퍼의 순서를 나타낸다. 또한, 입력순서대로 주파수 스 펙트럼을 저장한 스펙트럼 버퍼는 행렬 형태를 갖는다. 도 7(b)는 스펙트럼 버퍼에 저장된 복수의 주파수 스펙트럼 구간들의 수직평균(X)을 산출하는 단계에서 산 출해 낸 수직평균(X)을 행렬형태로 나타낸 것이다. 수직평균(X)이란 스펙트럼 버퍼에 저장된 복수의 주파수 스 펙트럼 중 같은 주파수에 해당하는 부분들의 평균이다. 이때, 수직평균(X)의 첫 번째 원소 1은 로지스틱 회귀식 에 절편(offset, )가 존재하기 때문에 필요하다. 각 주파수 별 수직평균은 아래의 [수학 식 6]을 통해 산출 한다. 수학식 6"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "위와 같이, 스펙트럼 버퍼에 저장된 K개의 주파수 스펙트럼의 평균을 산출하는 이유는 각 주파수 구간별로 로지 스틱 회귀분석을 수행할 경우 노이즈 등 때문에 신뢰도가 낮아질 수 있기 때문이다. 도 8은 본 발명의 일 실시 예에 따른 로지스틱 회귀 분석 방법의 순서도이다. 로지스틱 회귀 분석단계는 회귀 파라미터의 초기값을 설정하는 단계, 초기값과 상기 수직평균(X)을 로지스틱 시그모이드 함수에 대입하여 아크 및 정상신호 여부를 복수 회 학습하고, 상기 학습횟수만큼 회귀 파 라미터 값을 경사하강법(gradient descent)으로 갱신하는 회귀 파라미터 갱신 단계 및 학습 결과에 따라 복수의 구간 중에서 분류 정확도가 가장 높은 구간을 추출하고 해당 구간의 주파수 범위를 최적 대역폭([ *, *])으로 지정하는 최적 대역폭 추출단계를 더 포함한다. 상기 회귀 파라미터 초기값을 설정하는 단계는 가우시안 분포를 이용하여 회귀 파라미터의 초기값을 설정 하거나, [0,1]의 범위에서 특정 값을 랜덤하게 선택하여 회귀 파라미터의 초기값으로 설정할 수 있다. 회귀 파라미터 갱신 단계는 아래의 [수학식 7]을 이용하여 로지스틱 회귀 학습을 수행하고, 아래의 [수학 식 8]를 이용하여 회귀 파라미터를 갱신한다. 마지막 학습을 수행하고 갱신된 회귀 파라미터를 최종 회귀 파라미터( )라고 한다. 이를 경사하강법(gradient descent)이라 한다. 즉, [수학식 7]에 초기값( ) 및 수직평균(X)을 대입하여 나온 결과값이 0.5 이상이면 정상으로 0.5 미만이면 아크로 판단하도록 학습하고, 초기값을 [수학식 8]에 대입하여 갱신한 회귀 파라미터를 산출하여 다음 학습에서 사용한다. 수학식 7"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "수학식 8"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "이때, 는 학습률(learning rate)를, Z는 실제 신호의 레이블(아크신호이면 0, 정상신호이면 1, )을, 는 의 전치(transpose)를 의미한다. 또한, 최적 대역폭 추출단계는 상기 학습된 결과를 분석하여 아크신호 및 정상신호의 분류 정확도가 가장 높은 구간을 추출하여 해당 구간을 최적 대역폭([ *, *])으로 지정한다. 예를 들어, n번째 구간에서 분류정확도가 가장 높은 경우, 최적대역폭([ *, *])은 아래의 [수학식 9]와 같이 지정된다. 수학식 9"}
{"patent_id": "10-2020-0105913", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 10, "content": "도 9는 본 발명의 일 실시 예에 따른 아크신호 검출단계의 순서도이다. 도 9를 참조하면, 아크신호 검출단계는 신호 입력단계, 푸리에 변환단계, 구간데이터 추출단계 , 오즈 산출 단계 및 아크정상 판단 단계를 포함한다. 신호 입력단계 시계열 신호와 신경망을 통해 학습한 최종 회귀 파라미터( ) 및 최적 대역폭([ *, *])을 입력 받고, 푸리에 변환단계는 아크 정상 신호의 특징을 구분하기 위해 시계열 신호를 푸리에 변환하여 주 파수 스펙트럼 형태로 변환한다. 또한, 구간데이터 추출단계는 푸리에 변환하여 얻은 주파수 스펙트럼에서 최적 대역폭 최적 대역폭([ *, *])에 해당하는 구간 데이터를 추출하고, 오즈 산출단계는 구간 데이터에 학습된 신경망을 통해 얻은 최 종 회귀 파라미터( )를 곱하여 오즈(odds)를 산출한다. 또한, 아크정상 판단단계는 상기 오즈 산출단계에서 산출한 오즈(odds)를 로지스틱 시그모이드 함수 에 대입하여 로지스틱 시그모이드 함수 값( )이 0.5 이상이면 정상신호로, 0.5 미만이면 아크신호로 판단한다. 도 10은 본 발명에 따른 아크신호 검출 방법이 적용되어 산출된 로지스틱 시그모이드 함수 값( )의 변화를 나타 내는 그래프이다. 도 10을 참조하면, 노이즈가 첨가된 신호에서는 아크정상 판단에 오류가 생길 수 있음을 알 수 있다. 도 10(a) 는 연속 아크신호의 값의 변화이고, 도 10(b)는 연속 정상신호의 값의 변화이다. 도 10(a) 및 (b)에서 y축은값이고, x축은 연속 신호의 인덱스이다. 도 10(a)를 참조하면, 아크신호에서도 노이즈에 의해 값이 0.5 이상인 경우가 발생하는 것을 알 수 있으며, 도 10(b)를 참조하면 정상신호에서도 노이즈에 의해 값이 0.5 미만인 경우가 발생하는 것을 알 수 있다. 그러나 아크는 실제 연속적으로 발생하는 것이므로, 이러한 일부 오류는 아크신호 판단에 있어서 제외할 필요가 있다. 이하 도 11을 참조하여 아크신호 판단단계에서 노이즈를 제거하는 방법에 관하여 설명한다. 도 11은 본 발명의 일 실시 예에 따른 아크신호 판단단계에서 노이즈를 제거하는 방법의 순서도이다. 도 11을 참조하면, 아크정상 판단 단계는 복수의 연속되는 로지스틱 시그모이드 함수 값( )을 저장하는 단 계, 복수의 로지스틱 시그모이드 함수값( )을 이용하여 이동평균값을 산출하는 단계 및 이동평균값 및 로지스틱 시그모이드 함수를 이용하여 아크신호인지 여부를 판단하는 단계를 더 포함 할 수 있다. 즉, 현재 값과 이전의 값들을 포함하는 복수의 값의 평균 즉, 이동평균을 구하여 의 이동평균값이 0.5 이 상이면 정상신호 0.5 미만이면 아크신호로 판단함으로써 신호에서 발생하는 일부 오류를 제외할 수 있다. 도 12는 본 발명의 일 실시 예에 따른 신경망 학습단계와 아크신호 검출단계의 관계를 나타낸다. 도 12를 참조하면, 본 발명의 일 실시 예에 따른 신경망 학습단계와 아크신호 검출단계의 관계를 명 확히 이해할 수 있다. 즉, 인공지능 신경망은 신경망 학습단계를 통해 최종 회귀 파라미터( ) 및 최적 대 역폭([ *, *])을 학습하고, 학습한 최종 회귀 파라미터( ) 및 최적 대역폭([ *, *])을 아크검출단계 의 오즈 산출단계 및 구간데이터 추출단계에서 각각 사용하여 입력된 시계열 전류신호가 아크신호인 지 여부를 판단한다. 이상, 본 발명의 실시 예들에 대해 설명하였는바, 본 발명은 이러한 실시 예들의 주기신호의 분석방법 및 시스 템 구성에 한정되지 않고, 청구범위에 기재한 범위에서 다양한 수정과 변경이 가능하다."}
{"patent_id": "10-2020-0105913", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에서 아크신호 검출 판단방법으로 사용되는 로지스틱 시그모이드 함수를 나타내는 그래프이다. 도 2는 본 발명의 일 실시 예에 따른 로지스틱 회귀분석을 이용한 아크신호 검출방법의 순서도이다. 도 3은 본 발명의 일 실시 예에 따른 신경망을 학습시키는 단계의 순서도이다. 도 4는 본 발명의 일 실시 예에 따른 신경망 학습단계에서 사용되는 시계열 신호들의 예이다. 도 5는 본 발명의 일 실시 예에 따른 평균 산출 단계 의 순서도이다. 도 6은 본 발명의 일 실시 예에 따라 주파수 스펙트럼을 복수의 구간으로 분할하고 크기를 정규화하여 스펙트럼 버퍼에 저장하는 과정을 나타낸다. 도 7은 본 발명의 일 실시 예에 따라 스펙트럼 버퍼에 저장된 복수개의 주파수 스펙트럼의 수직평균(X)을 산출 하는 과정을 도시한다.도 8은 본 발명의 일 실시 예에 따른 로지스틱 회귀 분석 방법의 순서도이다. 도 9는 본 발명의 일 실시 예에 따른 아크신호 검출단계의 순서도이다. 도 10은 본 발명에 따른 아크신호 검출 방법이 적용되어 산출된 로지스틱 시그모이드 함수 값( )의 변화를 나타 내는 그래프이다. 도 11은 본 발명의 일 실시 예에 따른 아크신호 판단단계에서 노이즈를 제거하는 방법의 순서도이다. 도 12는 본 발명의 일 실시 예에 따른 신경망 학습단계와 아크신호 검출단계의 관계를 나타낸다."}
