{"patent_id": "10-2023-0108225", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0027011", "출원번호": "10-2023-0108225", "발명의 명칭": "무선 통신 시스템에서 데이터 트래픽을 오프로딩하는 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "백영교"}}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 AMF(access and mobility management function) 엔티티의 방법에 있어서, 단말로부터 오프로드 가능한 PDU(packet data unit) 세션 지원 여부에 대한 정보를 포함하는 등록 요청 메시지를 수신하는 단계; 네트워크가 오프로드 가능한 PDU 세션을 지원하는지 여부를 결정하는 단계; 및상기 네트워크가 오프로드 가능한 PDU 세션을 지원하는 경우, 단말에게 등록 수락 메시지를 전송하는 단계;를포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 단말로부터 NAS(non-access stratum) 메시지를 수신하는 단계;를 더 포함하고,상기 NAS(non-access stratum) 메시지는 오프로드 가능한 PDU 세션에 관련된 지시자를 포함하는 것을 특징으로하는 방법."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 오프로드 가능한 PDU 세션에 관련된 지시자에 기반하여 SMF(session management function)를 선택하는 단계;를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, NRF(network repository function)로 상기 오프로드 가능한 PDU 세션에 관련된 지시자에 기반하여 SMF 발견 요청 메시지를 전송하는 단계;를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 선택된 SMF에게 PDU 세션 업데이트 요청 메시지를 전송하는 단계;를 더 포함하고, 상기 PDU 세션 업데이트 요청 메시지는 상기 오프로드 가능한 PDU 세션에 관련된 지시자를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "무선 통신 시스템에서 AMF(access and mobility management function) 엔티티에 있어서, 송수신부; 및공개특허 10-2025-0027011-3-적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는,단말로부터 오프로드 가능한 PDU(packet data unit) 세션 지원 여부에 대한 정보를 포함하는 등록 요청 메시지를 수신하고, 네트워크가 오프로드 가능한 PDU 세션을 지원하는지 여부를 결정하고, 및상기 네트워크가 오프로드 가능한 PDU 세션을 지원하는 경우, 단말에게 등록 수락 메시지를 전송하는 단계;를포함하는 것을 특징으로 하는 AMF 엔티티."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 적어도 하나의 프로세서는,단말로부터 NAS(non-access stratum) 메시지를 수신하도록 구성되고,상기 NAS(non-access stratum) 메시지는 오프로드 가능한 PDU 세션에 관련된 지시자를 포함하는 것을 특징으로하는 AMF 엔티티."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 적어도 하나의 프로세서는,상기 오프로드 가능한 PDU 세션에 관련된 지시자에 기반하여 SMF(session management function)를 선택하도록구성되는 것을 특징으로 하는 AMF 엔티티."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 적어도 하나의 프로세서는,NRF(network repository function)로 상기 오프로드 가능한 PDU 세션에 관련된 지시자에 기반하여 SMF 발견 요청 메시지를 전송하도록 구성되는 것을 특징으로 하는 AMF 엔티티."}
{"patent_id": "10-2023-0108225", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 적어도 하나의 프로세서는,상기 선택된 SMF에게 PDU 세션 업데이트 요청 메시지를 전송하도록 구성되고,상기 PDU 세션 업데이트 요청 메시지는 상기 오프로드 가능한 PDU 세션에 관련된 지시자를 포함하는 것을 특징으로 하는 AMF 엔티티."}
{"patent_id": "10-2023-0108225", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시의 실시 예에 따른 무선 통신 시스템에서 AMF(access and mobility management function) 엔티티의 방법은 단말로부터 오프로드 가능한 PDU(packet data unit) 세션 지원 여부에 대한 정보를 포함하는 등록 요청 메시지를 수신하는 단계; 네트워크가 오프로드 가능한 PDU 세션을 지원하는지 여부를 결정하는 단계; 및 상기 네트워크가 오프로드 가능한 PDU 세션을 지원하는 경우, 단말에게 등록 수락 메시지를 전송하는 단계;를 포함한다."}
{"patent_id": "10-2023-0108225", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시 예들은 무선 통신 시스템에서 3GPP(3rd generation partnership project) 액세스를 통 한 데이터 트래픽을 WIFI(Wireless Fidelity) 등 NON-3GPP 액세스를 통해서 오프로딩 하기위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0108225", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 상술한 것과 이동통신 시스템의 발전에 따라 다양한 서비스를 제공할 수 있게 됨으로써, 이러한 서비스들을 효"}
{"patent_id": "10-2023-0108225", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "과적으로 제공하기 위한 방안이 요구되고 있다.발명의 내용"}
{"patent_id": "10-2023-0108225", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 non-3gpp access와 3gpp access가 가능한 단말이 하나의 3gpp access를 통해 서 5G망에 접속되어 있는 상황에서, non-3gpp access를 통해서 3gpp access를 통한 트래픽을 non-3gpp access 를 통해서 오프로딩하기 위한 방법에 대한 것이다. 본 개시는 단말이 N3IWF(non-3GPPP inter-working function) 등 access network을 통해서 5G망에 접속하여 등 록하게 하여서 트래픽을 오프로딩 하는 것 대신에(즉, 단말을 non-3gpp access, 예를 들어 WIFI를 통한 망등록 을 수행하지 않고), 5G망의 UPF(user plane function)나 MPQUIC(multipath QUIC(quick UDP(user datagram protocol) internet connections)) 또는 MPTCP(multipath TCP(transport protocol))와 같은 Steering 서버를 통해서 트래픽을 오프로딩하여 서비스하는 방안에 대한 것이다. 본 문서에서는 3gpp access를 통해 무선망에 접속하여 등록한 단말이 non-3gpp access에 등록하지 않는 방법을 통해서 트래픽을 non-3gpp access로 오프로딩하는 방법을 제안하고자 한다."}
{"patent_id": "10-2023-0108225", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시예에 따른 무선 통신 시스템에서 AMF(access and mobility management function) 엔티티의 방법 은 단말로부터 오프로드 가능한 PDU(packet data unit) 세션 지원 여부에 대한 정보를 포함하는 등록 요청 메시 지를 수신하는 단계; 네트워크가 오프로드 가능한 PDU 세션을 지원하는지 여부를 결정하는 단계; 및 상기 네트 워크가 오프로드 가능한 PDU 세션을 지원하는 경우, 단말에게 등록 수락 메시지를 전송하는 단계;를 포함한다. 본 개시의 실시예에 따른 무선 통신 시스템에서 AMF(access and mobility management function) 엔티티는 송수 신부; 및 적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는, 단말로부터 오프로드 가능한 PDU(packet data unit) 세션 지원 여부에 대한 정보를 포함하는 등록 요청 메시지를 수신하고, 네트워크가 오프 로드 가능한 PDU 세션을 지원하는지 여부를 결정하고, 및 상기 네트워크가 오프로드 가능한 PDU 세션을 지원하 는 경우, 단말에게 등록 수락 메시지를 전송하는 단계;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0108225", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 non-3gpp access에서 망등록을 위한 복잡성을 증가시키지않으면서 간단한 업데 이트를 통해서 non-3gpp access를 통하여 3gpp access의 트래픽을 오프로딩 할 수 있고, 이에 따라 기지국의 무 선자원을 절약할 수 있는 장점이 있다."}
{"patent_id": "10-2023-0108225", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 개시의 동작 원리를 상세히 설명한다. 하기에서 본 개시를 설명하기에 있어 관 련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어 들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반 에 걸친 내용을 토대로 내려져야 할 것이다. 마찬가지 이유로 첨부 도면들에 있어서 일부 구성요소는 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소 의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에는 동일 한 참조 번호를 부여하였다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 개시는 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있다. 다양한 실시 예들은 본 개시가 완전하도록 하고, 본 개시가 속하는 기 술분야에서 통상의 지식을 가진 자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행 될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가 능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들 을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 본 개시의 다양한 실시 예들에서 사용되는 '~부'라는 용어는 소프트웨어 또는 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키 도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브 루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수 의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구 성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구 현될 수도 있다. 또한 본 개시의 다양한 실시 예들에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 본 개시에서, \"A/B\", \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\" 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \" 첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성 요소를 다른 해당 구성 요소와 구분하기 위해 사용될 수 있으며, 해당 구성 요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 이하, 본 개시에서 기지국은 단말의 자원할당을 수행하는 주체로서, gNode B, eNode B, Node B, BS (Base Station), 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 본 개시의 다양한 실시 예들에서 단말은 사용자 단말(user equipment: UE), 터미널(terminal), 이동국(mobile station: MS), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신 기능을 수행할 수 있는 각종 전자 장치로 칭해질 수 있 다. 또한, 이하에서 설명하는 본 개시의 다양한 실시 예들과 유사한 기술적 배경 또는 채널 형태를 갖는 여타의 통 신 시스템에도 본 개시의 다양한 실시 예들이 적용될 수 있다. 또한, 본 개시의 다양한 실시 예들은 숙련된 기 술적 지식을 가진자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신 시스템에도 적용될 수 있다. 본 개시의 다양한 실시 예들을 구체적으로 설명함에 있어서, 통신 시스템은 무선 통신 시스템을 이용할 수 있으 며, 예를 들어 무선 통신 규격 표준화 단체인 3GPP가 5G 통신 규격 상의 무선 접속 네트워크인 NR(New RAN)과 코어 네트워크인 패킷 코어(5G System, 혹은 5G Core Network, 혹은 NG Core(Next Generation Core))를 이용할 수 있다. 그리고 유사한 기술적 배경을 가지는 여타의 통신 시스템에도 본 개시의 범위를 크게 벗어 나지 아니 하는 범위에서 약간의 변형으로 적용 가능하며, 이는 본 개시의 기술 분야에서 숙련된 기술적 지식을 가진 자의 판단으로 가능 할 것이다. 이하 본 개시의 다양한 실시예들에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 네트워크 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 네트워크 기능(network function: NF)들 간 인터페이스 를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시의 다양한 실시예에서 후술되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 대상을 지칭 하는 다른 용어가 사용될 수 있다. 5G 시스템에서는 네트워크 슬라이스를 지원하며, 서로 다른 네트워크 슬라이스들에 대한 트래픽이 서로 다른 프 로토콜 데이터 유닛(protocol data unit: PDU) 세션들에 의해 처리될 수 있다. PDU 세션은 PDU 연결 서비스를 제공하는 데이터 네트워크와 단말 간의 연관(association)을 의미할 수 있다. 네트워크 슬라이스는 광대역 통신 서비스, massive IoT, V2X 등과 같은 미션 크리티걸(mission critical) 서비스 등과 같은 서로 다른 특성을 갖 는 다양한 서비스들을 지원하기 위한 NF들의 집합으로 네트워크를 논리적으로 구성하고, 서로 다른 네트워크 슬 라이스들을 분리하는 기술로 이해될 수 있다. 따라서 어떤 네트워크 슬라이스에 통신 장애가 발행하더라도 다른 네트워크 슬라이스의 통신은 영향을 받지 않으므로 안정적인 통신 서비스 제공이 가능하다. 본 개시의 다양한 실시 예들에서 \"슬라이스\"는 \"네트워크 슬라이스\"를 의미하는 용어로 혼용될 수 있다. 이러한 네트워크 환경에 서 단말은 다양한 서비스를 제공받을 경우 다수의 네트워크 슬라이스들에 접속할 수 있다. 그리고 상기 NF는 하 드웨어에서 구동되는 소프트웨어 인스턴스로서 네트워크 요소 혹은 적절한 플랫폼에서 인스턴스화된 가상화된 기능으로 구현될 수 있다. 이동 통신 사업자는 네트워크 슬라이스를 구성하고, 네트워크 슬라이스 별로 또는 네트워크 슬라이스의 셋트 (set) 별로 특정 서비스에 적합한 네트워크 자원을 할당할 수 있다. 네트워크 자원은 NF 또는 NF가 제공하는 논 리적 자원 또는 기지국에 의해 할당된 무선 자원 등을 나타낼 수 있다. 예를 들면, 이동 통신 사업자는 모바일 광대역 서비스 제공을 위해서 네트워크 슬라이스 A를 구성하고, 차량 통 신 서비스 제공을 위해서 네트워크 슬라이스 B를 구성하고, 후술할 확장 현실(eXtended Reality: XR) 서비스 제 공을 위해서 네트워크 슬라이스 C를 구성할 수 있다. 즉, 이와 같이 5G 네트워크에서는 각 서비스의 특성에 맞 게 특화된 네트워크 슬라이스를 통해 단말에게 효율적으로 해당 서비스를 제공할 수 있다. 5G 시스템에서는 네 트워크 슬라이스를 S-NSSAI(Single-Network Slice Selection Assistance Information)로 나타낼 수 있다. 상기 S-NSSAI는 SST(Slice/Service Type) 값과 SD(Slice Differentiator) 값을 포함할 수 있다. SST는 네트워크 슬 라이스가 지원하는 서비스의 특성(예를 들어, eMBB(enhanced mobile broadband), IoT, URLLC(ultra- reliability low latency communication), V2X, XR 서비스 등)을 나타낼 수 있다. SD는 SST로 지칭되는 특정 서비스에 대한 추가적인 식별자로 사용되는 값일 수 있다.이하 본 개시의 다양한 실시예들을 도면을 참조하여 설명하기로 한다. 도 1은 본 개시의 일 실시 예에 따른 non-3gpp access를 통한 트래픽을 오프로딩 하는 무선 통신 시스템의 구조 를 예시한 도면이다. 도 1을 참조하면, 단말(또는 UE, 이하에서는 단말로 지칭)이 3GPP access를 통해서 5G 네트워크에 접 속하여 망 등록되고 데이터 서비스를 받는 상황에서 단말은 non-3gpp access를 통해서 N3IWF(N3 interworking function) 등 access network을 통하여 5G 네트워크에 등록하지 않고, 5G네트워크의 steering기능이 있는 UPF, MPQUIC(multi-path Quick UDP(user datagram protocol) Internet Connection) 서버 또는 MPTCP(Multi-path TCP(transport protocol)) 서버에 연동이 되어 non-3gpp access를 통해 서 트래픽을 오프로딩 할 수 있다. 즉, 트래픽 오프로드라 함은 단말이 5G 네트워크에 등록하지 않고, non-3gpp access을 통하여 5G 네트워크에서 제공하는 트래픽을 수신하는 것을 지칭한다. 단말이 5G 네트워크에 등록하지 않고 non-3gpp access를 통해서 접속하는 경우를 Native non- 3gpp access라고 부르고, 이 때 단말과 UPF 또는 MPQUIC/MPTCP서버와의 사이에 생기는 서 브세션(sub-session) 또는 leg를 Native Non-3gpp sub-session이라고 부른다. 단말과 UPF 또는 MPQUIC/MPTCP서버와의 사이에 3GPP access를 통해서 생기는 서브세션은 3gpp sub-session이라고 부 른다. 상기 steering 기능이 있는 UPF는 MPQUIC 서버 또는 MPTCP 서버의 기능이 포함된 UPF라 고 볼 수 있고, UPF와 MPQUIC 또는 MPTCP서버는 함께 위치할 수 있고 따로 떨어져서 위치할 수 있지 만 UPF와 상기 서버 사이에 긴밀하게 연결이 되어있어서 서로 간의 정보를 잘 알 수 있다고 가정할 수 있 다. 상기 Native non-3gpp sub-session은 3gpp sub-session과 같이 단말이 3gpp access를 통한 5G 네트워크와의 연결 즉 RAN을 통한 단말과 SMF와의 시그널링 및 SMF와 UPF 및 UPF와 MPQUIC/MPTCP서버 간의 통신을 통해서 세팅 되어 질 수 있다. 구체적인 세팅 방법은 본 개시 에서 후술한다. 또한, Native non-3gpp sub-session의 경우 access network를 통해서 sub-session이 구성되는 것이 아니 므로, 단말과 MPQUIC/MPTCP 서버사이에 secure tunnel이 만들어지고 이 tunnel을 만들고 유지하는 과정에서 상기 단말과 MPQUIC/MPTCP 서버 사이에 안전하게 path가 수립되어야 한다. 이를 위한 구체 적인 세팅방법은 본 개시에서 후술한다. 본 개시의 다양한 실시 예들에서 이용되는 네트워크 기술은 ITU(international telecommunication union) 또는 3GPP에 의하여 정의되는 표준 규격(예를 들어, TS 23.501, TS 23.502, TS 23.503 등)을 참조할 수 있으며, 도 1의 네트워크 구조에 포함되는 구성 요소들은 각각 물리적인 엔티티(entity)를 의미하거나, 혹은 개별적인 기능 (function)을 수행하는 소프트웨어 혹은 소프트웨어와 결합된 하드웨어를 의미할 수 있다. 이하에서는 도 1의 네트워크 구조에 포함되는 구성 요소들을 NF(network function)들이라 칭하기로 한다. NF들 간에는 5G 코어 네트워크(5G Core Network: 5GC)에서 공지된 인터페이스들이 이용될 수 있는데, 관련 설명 은 표준 규격(TS 23.501)을 참조할 수 있으므로 구체적인 설명은 생략하기로 한다. 도 1의 무선 통신 시스템은 NG-RAN과 5GC를 포함할 수 있다. NG-RAN은 5G 시스템에서 무선 접속 기술을 지원하 는 기지국(base station)(예, gNB, IAB(Integrated Access and Backhaul) 등)일 수 있다. 도 1에서 5GC는 AMF(Access and Mobility Management Function), SMF(Session Management Function), UPF(User Plane Function), PCF(Policy Control Function) 및 UDM(Unified Data Management)등과 같은 네트워크 엔티티들을 포함할 수 있다. AMF는 단말의 접근(access)와 이동성(mobility)을 관리하기 위한 엔티티이다. AMF는 단말(10 5)이 F(femtocell)-gNB를 통해 매크로 시스템 또는 펨토시스템의 5GC의 다른 엔티티(들)과 연결하는 단말-코어 네트워크 종점 역할을 수행할 수 있다. 일 예로, AMF는 단말의 등록(registration), 연결 (connection), 연결성(reachability), 이동성(mobility) 관리, 접근확인, 인증, 이동성 이벤트 생성 등과 같은 네트워크 기능을 수행할 수 있다.SMF는 단말의 PDU(Protocol Data Unit) 세션에 대한 관리 기능을 수행할 수 있다. 일 예로, SMF는 세션의 수립, 수정, 해제와 이에 필요한 UPF와 NG-RAN간의 터널 유지를 통한 세션 관리 기능, 단말의 인터넷 프로토콜 (Internet Protocol: IP) 주소 할당과 관리 기능, 사용자 평면(User Plane) 선택 및 제어, UPF에서 트래픽 프로세싱 제어, 과금 데이터 수집 제어 등과 같은 네트워크 기능을 수행할 수 있 다. UPF는 단말의 사용자 데이터를 처리하는 기능을 수행할 수 있다. 일 예로, UPF는 무선 접속 기 술(Radio Access Technology: RAT) 간 앵커(Anchor) 역할 수행, PDU 세션과 AF/AS와의 연결 제공, 패킷 라우팅 및 포워딩, 패킷 검사(inspection), 사용자 평면 정책 적용, 트래픽 사용 보고서 작성, 버퍼링 등과 같은 네트 워크 기능을 수행할 수 있다. UDM은 3GPP 보안을 위한 인증 정보의 생성, 사용자 식별자(identifier: ID)의 처리, 단말을 지원하는 NF에 대한 목록 관리, 가입 정보(subscription information) 관리 등의 기능을 수행할 수 있다. UDR(Unified Data Repository)은 UDM이 관리하는 가입 정보, 노출을 위한 구조화된 데이터, NEF(Network Exposure Function) 또 는 서비스와 연관된 응용데이터들의 저장 및 제공 기능을 수행할 수 있다. PCF는 5G 시스템에서 서비스를 제공하기 위한 사업자 정책(operator policy) 정보를 관리할 수 있다. UDR은 단 말의 가입 정보를 저장하고, UDM에게 저장된 가입 정보를 제공할 수 있다. 또한 UDR은 사업자 정책 정보를 저장하고, PCF에게 저장된 사업자 정책 정보를 제공할 수 있다. NEF는 5G 시스템에서 발생하는 이벤트 및 지원하는 능력(capability)를 외부로 전달하거나 수신하는 기능을 수 행할 수 있다. 일 예로, NEF는 5GC에 AF/AS의 정보를 안전하게 공급하는 기능, 내부/외부 정보의 변환, 다른 NF 로부터 전달받은 정보를 UDR에 저장한 후 재배포하는 등의 기능을 수행할 수 있다. 단말은 NG-RAN에 접속하여 5G 네트워크에 등록할 수 있다. 일 예로, 단말은 NG- RAN에 접속하여 AMF와 단말 등록 절차(registration procedure)를 수행할 수 있다. 등록 절차 중, AMF는 NG-RAN에 접속한 단말이 이용 가능한 네트워크 슬라이스를 결정하여 단말에게 할당할 수 있다. 단말은 네트워크 슬라이스를 선택하여 AF/AS와의 통신을 위한 PDU 세션을 설정할 수 있다. 하나의 PDU 세션은 하나 혹은 복수의 QoS Flow 들을 포함할 수 있으며, 각 QoS Flow는 서로 다른 QoS 파 라미터들을 설정함으로써 각 어플리케이션 서비스에 필요한 서로 다른 전송 성능을 제공할 수 있다. 또한 위에서 설명했던 것 과같이 상기 PDU Session이 Native non-3gpp sub-session을 통해서 오프로딩을 지원할 수 있는 경우에 PDU Session을 offload-able PDU session이라고 지칭할 수 있다. 도 2는 본 개시의 일 실시예에 따른 WLAN을 통해 단말을 인증하고 트래픽을 오프로딩하는 무선 통신 시스템의 구조를 예시한 도면이다. 도 2는 도 1의 특수한 상황으로서 non-3gpp access가 WLAN인 상황에서 고려될 수 있는 시나리오이다. 따라서, 도 2의 설명에서 언급되지 않은 네트워크 엔티티의 경우, 도 1의 설명이 준용될 수 있다. 도 2를 참조하면, native non-3gpp sub-session를 구성하는 경우에 단말이 WLAN, NSWOF(non- seamless WLAN offload function),, AUSF와 UDM, EAP-AKA'(extensible authentication protocol- Authentication and Key Agreement)을 통해서 단말이 상기 WLAN을 사용하는 것에 대해서 인증 을 하게 된다. 따라서 단말과 상기 WLAN사이에 IP sec-tunnel(secure tunnel)이 생성되게 되고, WLAN의 뒷단은 통신사업자의 망이라서 안전하게 단말과 MPQUIC/MPTCP서버 사이에 터널이 생성될 수 있다. 도 3a 및 도 3b는 본 개시의 일 실시예에 따른 PDU 세션을 생성시 단말이 시작하여 non-3gpp access를 통한 트 래픽을 오프로딩 하기 위한 방법을 예시한 도면이다. 도 3a 및 3b를 참조하면, 단말(또는, UE)은 단계 1과같이 5G 네트워크에 망 등록하는 절차를 수행할 수 있 다. 이때 단말과 AMF간에 offload-able PDU Session을 지원하는지 여부를 서로 negotiation 할 수 있다. 예를 들어 단말은 registration request 메시지를 AMF에게 전달할 때 offload-able PDU Session을 지원하는지 여부를 포함하고, AMF는 단말에게 그 응답으로 5G망이 offload-able PDU Session을 지원하는 경우 registration accept 메시지를 전달할 수 있다. 한편 단말과 네트워크 모두 offload-able PDU Session을 지원하는 경우에 단말은 5G 망에 offload-able PDU Session을 요청할 수 있다. 단말은 단계 2에서 예를 들어 WLAN과 같은 non-3gpp access를 통해서 UE IP address와 port등을 할당 받 을 수 있다. 이 때 단말은 non-3gpp access에서 NAT(network address translation)기능이 있는 경우에 할 당 받은 상기 private UE IP address 및 port 외에 이에 매핑 되는 public IP address 및 port 또는 outer IP address및 port 정보를 획득할 수 있다. 단계 3 내지 단계 5에서 단말은 PDU Session establishment request메시지를 SMF에게 전달하여 5G망 에 offload-able PDU Session을 요청할 수 있다. 즉, 단계 3에서 단말은 NAS(non-access stratum)메시지에 PDU Session establishment request 메시지를 포함하여 AMF에게 전송할 수 있다. 이때 상기 NAS메시지는 PDU Session establishment request 메시지 외 에 PDU Session ID, S-NSSAI, DNN정보를 추가로 포함할 수 있고, 단말이 Offload-able PDU session으로 요청하는 경우에는 추가로 Offload-able PDU session indication을 포함해서 AMF가 단말의 offload- able PDU session을 원함을 알 수 있도록 할 수 있다. 한편 상기 PDU Session establishment request메시지는 N1 SM container에 포함되게 되는데, 단말은 offload-able PDU session을 원함을 SMF가 인식할 수 있도록 PDU Session establishment request메시지에 또는 상기 N1 SM container에 다음 파라미터의 일부 혹은 전부를 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 단말이 Offload-able PDU session으로 요청함을 알리는 Offload-able PDU session indication을 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 단말이 지원하는 steering기능으로서 MPQUIC을 지원하는지 MPTCP를 지원하는지 혹은 둘 다 지원하는지를 나타내는 것(capability of supported steering functionality = MPQUIC or MPTCP or both)을 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 이 PDU session을 통해서 3gpp access쪽 sub-session만 생성 요청할지 native non-3gpp access쪽 sub-session만 생성 요청할지 혹은 3gpp와 native non-3gpp access 양쪽에 대해서 sub-session을 생성 요청할지 여부(request for sub-session leg(3GPP, non-3GPP or both)를 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 단계 2에서 획득한 상기 단말에게 할당된 public UE IP address및 port 정보 또는 outer UE IP address및 port 정보를 포함할 수 있다. 일 실시예로, 상기 파라 미터가 될 수 있는 정보는 단말과 MPQUIC/MPTCP사이에 연결에 freshness을 보장하기 위해 발생시킨 랜덤넘버인 Nonce1을 포함할 수 있다. 단계 4에서 AMF가 알맞은 SMF를 선택할 수 있다. AMF가 SMF을 선택하는 과정에서, AMF는 상기 단계 3의 파라미터에 기반하여 단말이 offload-able PDU session 설립을 원하는지 결정 할 수 있다. 이 경우에 AMF는 NRF 등을 통하여 알맞은 SMF의 discovery 요청하는 과정에서 S- NSSAI나 DNN외에 offload-able PDU Session을 support하는 것을 포함하여 discover request를 할 수 있다. NRF 는 그 답으로 상기 요건을 만족하는 SMF의 주소정보 등을 AMF에게 알릴 수 있다. 상기한 바와 같이 NRF를 통해서 SMF를 고르는 것을 지원하기 위해서 상기 SMF는 NRF에게 자신이 offload-able PDU Session을 지원함을 알리는 indication을 NFregistration 요청을 통해서 등록하여 SMF의 NF profile을 업 데이트할 수 있다. 단계 5에서 상기 AMF는 위에서 선택된 SMF에게 상기 N1 SM container를 전달함으로 PDU Session establishment request 메시지를 전달할 수 있는데 상기 N1 SM container를 Nsmf_PDUSession_UpdateSMContext request메시지에 포함하여 SMF에게 전달할 수 있다. 이 때 단말이 offload-able PDU session을 원함 을 나타내는 offload-able PDU session indication이 상기 Nsmf_PDUSession_UpdateSMContext request 메시지에 함께 포함되거나, 상기 N1 SM container에 포함되어 SMF에게 단말이 offload-able PDU session을 원 함을 알릴 수도 있다. 한편 상기 PDU session establishment request를 받은 SMF는 단계 6과 7 같이 해당 요청에 대해서 PCF와 SM policy association을 새로 맺거나 SM policy association을 수정할 수 있다. 이때 SMF는 해당 PDU session에 대해 요청하는 값인 S-NSSAI나 DNN및 offload-able PDU Session indication을 포함하여 단 계 6과 같이 요청하게 되면, 상기 PCF는 이에 대해서 허용되는 QoS정보 및 native non-3gpp access로의 offloading이 허용됨을 알리는 indication \"offload to native non-3gpp is allowed\"를 포함하여 단계 7에서 SMF에게 응답할 수 있다. 이에 따라 SMF는 상기와 같이 native non-3gpp access로의 offloading이 허용되는 경우 단계 8에서 N4 Session establish 요청 또는 N4 Session modification 요청을 UPF에게 전달하여 상기 PDU Session을 통 해서 steering하기위한 parameter를 포함할 수 있다. 상기 parameter는 단말로부터 전달받은 다음 파라미 터의 일부 혹은 전부를 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 Offload-able PDU session indication을 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 단말이 지원하는 steering기능으로서 MPQUIC을 지원하는지 MPTCP를 지원하는지 혹은 둘 다 지원하는지를 나타내는 것(capability of supported steering functionality = MPQUIC or MPTCP or both)을 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는, 이 PDU session을 통해서 3gpp access쪽 sub-session만 생성 요청할지 native non-3gpp access쪽 sub-session만 생성 요청할지 혹은 3gpp와 native non-3gpp access 양쪽에 대해서 sub-session을 생성 요청할지 여부(request for sub-session leg(3GPP, non-3GPP or both)를 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보 는 단말에게 할당된 public UE IP address및 port 정보 또는 outer UE IP address및 port정보를 포함할 수 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 단말과 MPQUIC/MPTCP사이에 연결에 freshness을 보장하기위해 발생시킨 랜덤 넘버인 Nonce1을 포함할 수 있다. 단계 9에서 UPF는 MPQUIC/MPTCP 서버 또는 기능에 연결해서 상기 MPQUIC/MPTCP 서버 또는 기능(35 0)이 단말과 함께 steering위한 세션을 만들게 되고, 이 세션을 성공적으로 만들기 위해 단말에게 전 달해야 하는 정보를 상기 MPQUIC/MPTCP 서버 또는 기능으로부터 전달받을 수 있다. 상기 MPQUIC/MPTCP 서 버 또는 기능가 상기 단말에게 전달해야 하는 정보는 다음 정보의 일부 혹은 전부를 포함할 수 있다. 일 실시예로, 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에게 전달해야 하는 정보는 단말 이 non-3gpp access를 통해서 접속해야 하는 상기 MPQUIC/MPTCP 서버 또는 기능의 주소 정보로서 IP address 및 port 정보를 포함할 수 있다. 일 실시예로, 상기 MPQUIC/MPTCP 서버 또는 기능가 상기 단말 에게 전달해야 하는 정보는 상기 선택된 steering기능을 알리기 위한 MPQUIC 또는 MPTCP의 정보를 포함할 수 있고, 상기 steering 세션에 대한 ID로서 MPQUIC Session ID 또는 MPTCP session ID를 포함할 수 있다. 일 실시예로, 상기 MPQUIC/MPTCP 서버 또는 기능가 상기 단말에게 전달해야 하는 정보는 sub-session이 생성되는 3gpp access, native non-3gpp access 또는 상기 두 access모두를 나타내는 값을 포함할 수 있고, 단 말이 상기 MPQUIC/MPTCP 서버 또는 기능에 non-3gpp access를 통해 접속할 때 동일 단말임을 인증하 기위한 정보로서 security 토큰을 포함할 수 있다. 일 실시예로, 상기 MPQUIC/MPTCP 서버 또는 기능이 상 기 단말에게 전달해야 하는 정보는 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에 대해서 할 당하는 random number로서 Nonce2를 포함할 수 있고, 상기 단말이 상기 MPQUIC/MPTCP 서버 또는 기능 에 non-3gpp access를 통해 접속을 허용하는 시간 또는 상기 non-3gpp access를 통해 접속하는데 사용되 는 정보가 유효한 시간인 expiration time을 포함할 수 있다. 따라서 단계 9에서 상기 MPQUIC/MPTCP 서버 또는 기능으로부터 상기 단말에게 전달해야 하는 정보를 받은 UPF는 단계 10에서 N4 Session establish 또는 N4 Session modification 요청에 대한 응답메시지를 통해 SMF에게 전달하고, 상기 SMF는 단계 11에서 단말에게 PDU Session establishment accept 을 통해서 상기 UPF로부터 받은 정보를 단말에게 보낼 수 있고, 나머지 PDU Session establishment 과정을 단계 12와 같이 수행할 수 있다. 상기 단말과 상기 MPQUIC/MPTCP 서버 또는 기능과의 공유된 정보를 이용하여 단계 13에서 user plane을 통해 각 access에 대해서 sub-session을 생성할 수 있다. 특히 상기 단말이 native non-3gpp access를 통해서 상기 MPQUIC/MPTCP 서버 또는 기능에 접속하여 sub- session을 만드는 과정에서 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에 대해서 실제로 같은 단 말인지를 확인하기 위하여 단말이 3gpp access를 통해서 전달하여 단계 9를 통해 전달됐던, 단말 의 public UE IP address 및 port 정보 또는 outer UE IP address및 port 정보 또는 Nonce 1과 Nonce 2의 일부 혹은 전부가 일치 하는지의 여부, 허용된 시간 즉 expiration time내에 native non-3gpp access를 통해서 요청 했는지의 여부를 고려하여 단말을 인증하고 native non-3gpp session을 허용할 수 있도록 할 수 있다. 한편, 단계 4에서 상기 native non-3gpp sub-session을 만드는 과정에서 AMF가 offloadable PDU Session 을 지원하는 SMF를 찾지 못하는 경우에 AMF는 단말에게 reject메시지를 보낼 수 있고 이때 cause로서 \"offloadable PDU Session is not supported\"가 포함될 수 있다. 또는 상기 native non-3gpp sub- session을 만드는 과정에서 단계 5와 같이 PDU Session establishment request를 수신한 SMF가 PCF 로부터 단계 7에서 \"offloadable PDU Session을 허용하지 않음\" 이나 \"native non-3GPP access를 통한 offloading을 허용하지 않음\" 이나 \"native non-3GPP sub-session을 traffic steering을 허용하지 않음\" 을 나타내는 SM policy를 수신한 경우, 단계 8 내지 단계 10에서 native non-3gpp sub-session을 만들기 위한 parameter들은 생략할 수 있고, 단계 11에서 PDU Session establishment accept 메시지에 reject cause로서 \"offloadable PDU Session is not supported\" 를 포함하거나, 또는 PDU Session establishment reject을 보내 면서 reject cause로서 \"offloadable PDU Session is not supported\"를 포함하여 native non-3gpp sub- session을 생성하지 못했음을 단말에게 알릴 수도 있다. 또는, SMF가 단계 8의 메시지를 보내기전에 3gpp access와 native non-3gpp access간의 traffic steering 을 지원하는 UPF를 발견하지 못한 경우 상기 SMF는 단계 11에서 PDU Session establishment accept메시지 에 reject cause로서 \"offloadable PDU Session is not supported\"를 포함하거나, 또는 PDU Session establishment reject을 보내면서 reject cause로서 \"offloadable PDU Session is not supported\"를 포함하여 native non-3gpp sub-session을 생성하지 못했음을 단말에게 알릴 수도 있다. 또한, 도 3a 및 3b의 절차를 설명함에 있어서 단말이 PDU Session establishment request 과정을 통하여 설명을 했지만, 일 실시예로, 단말이 PDU Session modification request 과정을 사용하여 도 3a 및 3b의 절차를 수행할 수 있다. 도 4a 및 4b는 본 개시의 일 실시 예에 따른 PDU 세션을 생성시 네트워크가 시작하여 non-3gpp access를 통한 트래픽을 오프로딩하기 위한 방법을 예시한 도면이다. 도 4a 및 4b를 참조하면, 단말(또는, UE)은 단계 1과같이 5G 네트워크에 망등록하는 절차를 수행할 수 있 다. 이때 단말과 AMF간에 offload-able PDU Session을 지원하는지 여부를 서로 negotiation할 수 있 다. 예를 들어 단말은 registration request메시지를 AMF에게 전달할 때 offload-able PDU Session 을 지원하는지 여부를 포함하고, AMF는 단말에게 그 응답으로 5G망이 offload-able PDU Session을 지원하는 경우 단말에게 registration accept메시지를 전달할 수 있다. 한편 단말과 네트워크 모두 offload-able PDU Session을 지원하는 경우에 단말은 5G망에 Upgradeable to offload-able PDU Session을 알려서 5G망에서 필요시에 native non-3gpp access를 통해 오프로딩하도록 요청할 수 있음을 알릴 수 있다. 단 계 2에서 단말은 일 실시예로, WLAN과 같은 non-3gpp access를 통해서 UE IP address와 port 등을 할당 받을 수 있다. 이 때 단말은 non-3gpp access에서 NAT(network address translation)기능이 있는 경우에 할당 받은 상기 private UE IP address 및 port 외에 이에 매핑 되는 public IP address 및 port 또는 outer IP address및 port정보를 획득할 수 있다. 단계 3에서 상기 단말은 PDU Session establishment request메시지를 SMF에게 전달함으로써 5G망에 Upgradeable to offload-able PDU Session을 알릴 수 있다. 즉, 먼저 단말은 NAS메시지에 PDU Session establishment request메시지를 포함하여 AMF에게 전송할 수 있다. 이때 상기 NAS메시지는 PDU Session establishment request메시지 외에 PDU Session ID, S-NSSAI, DNN정보를 추가로 포함할 수 있고, 단말이 Upgradeable to offload-able PDU Session으로 요청하는 경우 에는 offload-able PDU session로 변경이 가능함을 알 수 있도록 추가로 Upgradeable to offload-able PDU Session indication을 포함할 수 있다. 한편 상기 PDU Session establishment request 메시지는 N1 SM container에 포함되게 되는데, 단말은 Upgradeable to offload-able PDU Session을 원함을 SMF가 인식할 수 있도록 PDU Session establishment request 메시지에 또는 상기 N1 SM container에 다음 파라미터의 일부 혹은 전부를 포함할 수도 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 단말이 Upgradeable to offload-able PDU Session으로 요청함을 알리는 Upgradeable to offload-able PDU Session indication, 단말이 지원하는 steering 기능 으로서 MPQUIC을 지원하는지 MPTCP를 지원하는지 혹은 둘 다 지원하는지를 나타내는 것(capability of supported steering functionality=MPQUIC or MPTCP or both), 이 PDU session을 통해서 3gpp access쪽 sub- session만 생성 요청할지 native non-3gpp access쪽 sub-session만 생성 요청할지 혹은 3gpp와 native non- 3gpp access 양쪽에 대해서 sub-session을 생성 요청할지 여부(request for sub-session leg(3GPP, non-3GPP, or both), 또한 단계 2에서 획득한 상기 단말에게 할당된 public UE IP address 및 port 정보 또는 outer UE IP address 및 port정보 중 적어도 하나를 포함할 수도 있다. 단계 4에서 AMF가 알맞은 SMF를 선택할 수 있다. AMF가 SMF을 선택하는 과정에서, AMF는 상기 단계 3의 파라미터에 기반하여 단말이 Upgradeable to offload-able PDU Session을 원하는지 결정할 수 있다. 이 경우에 AMF는 NRF 등을 통하여 알맞은 SMF를 discovery 요청하는 과정에서 S-NSSAI나 DNN외에 offload-able PDU Session을 support하는 것을 포함하여 discover request를 할 수 있다. NRF는 그 답으로 상기 요건을 만족하는 SMF의 주소 정보 등을 AMF에게 알릴 수 있다. 상기한 바와 같 이 NRF를 통해서 SMF를 고르는 것을 지원하기 위해서 상기 SMF는 NRF에게 자신이 offload-able PDU Session을 지원함을 알리는 indication을 NFregistration 요청을 통해서 등록하여 SMF의 NF profile을 업 데이트할 수 있다. 단계 5에서 상기 AMF는 위에서 선택된 SMF에게 상기 N1 SM container를 전달함으로 PDU Session establishment request메시지를 전달할 수 있는데 상기 N1 SM container를 Nsmf_PDUSession_UpdateSMContext request메시지에 포함하여 SMF에게 전달할 수 있다. 이 때 단말이 Upgradeable to offload-able PDU Session을 원함을 나타내는 Upgradeable to offload-able PDU Session indication이 상기 Nsmf_PDUSession_UpdateSMContext request메시지에 함께 포함되거나, 상기 N1 SM container에 포함되어 SMF에게 단말이 Upgradeable to offload-able PDU Session을 원함을 알릴 수도 있다. 한편 상기 PDU session establishment request를 받은 SMF는 단계 6과 7같이 해당 요청에 대해서 PCF와 SM policy association을 새로 맺거나 SM policy association을 수정할 수 있다. 이때 SMF는 해당 PDU session에 대해 요청하는 값인 S-NSSAI나 DNN 및 Upgradeable to offload-able PDU Session indication을 포함하여 단계 6과 같이 요청하게 되면, 상기 PCF는 이에 대해서 허용되는 QoS정보 및 native non-3gpp access로의 offloading이 허용됨을 알리는 indication \"offload to native non-3gpp is allowed\"를 포함하여 단계 7에서 SMF에게 응답할 수 있다. 이에 따라 SMF는 상기와 같이 native non-3gpp access로의 offloading이 허용되는 경우 Upgradeable to offload-able PDU Session으로서 일반 PDU Session을 만들도록 이후 단계 8 내지 단계 12에서 native non-3gpp access 관련한 parameter 없이 PDU Session을 setup할 수 있다. 또는, 일 실시예로, 상기 SMF는 offload- able PDU Session으로 전환할 수 있도록 결정을 하고 단계 8에서 N4 Session establish 요청 또는 N4 Session modification 요청을 UPF에게 전달하여 상기 PDU Session을 통해서 steering하기 위한 parameter를 포함 할 수 있다. 상기 parameter는 단말 및 UPF로부터 전달받은 다음 파라미터의 일부 혹은 전부를 포함할 수 도 있다. 일 실시예로, 상기 파라미터가 될 수 있는 정보는 Offload-able PDU session indication, 단말 이 지원하는 steering기능으로서 MPQUIC을 지원하는지 MPTCP를 지원하는지 혹은 둘 다 지원하는지를 나타내는 것(capability of supported steering functionality = MPQUIC or MPTCP or both), 이 PDU session을 통해서 3gpp access쪽 sub-session만 생성 요청할지 native non-3gpp access쪽 subsession만 생성 요청할지 혹은 3gpp 와 native non-3gpp access 양쪽에 대해서 sub-session을 생성 요청할지 여부(request for sub-session leg(3GPP, non-3GPP or both), 또한 단말에게 할당된 public UE IP address 및 port 정보 또는 outer UE IP address 및 port정보 중 적어도 하나를 포함할 수 있다. 단계 9에서 UPF은 MPQUIC/MPTCP 서버 또는 기능에 연결해서 상기 MPQUIC/MPTCP 서버 또는 기능(45 0)이 단말과 함께 steering위한 세션을 만들게 되고, 이 세션을 성공적으로 만들기 위해 단말에게 전 달해야 하는 정보를 상기 MPQUIC/MPTCP 서버 또는 기능으로부터 전달받게 된다. 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에게 전달해야 하는 정보는 다음 정보의 일부 혹은 전부를 포함할 수 있다. 일 실시예로, 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에게 전달해야 하는 정보는 단말이 non-3gpp access를 통해서 접속해야 하는 상기 MPQUIC/MPTCP 서버 또는 기능의 주소 정보로서 IP address 및 port정보, 상기 선택된 steering 기능을 알리기 위한 MPQUIC 또는 MPTCP의 정보, 상기 steering세션에 대한 ID로서 MPQUIC Session ID 또는 MPTCP session ID, sub-session이 생성되는 3gpp access 또는 native non-3gpp access 또는 상기 두 access 모두를 나타내는 값, 단말이 상기 MPQUIC/MPTCP 서버 또는 기능에 non- 3gpp access를 통해 접속할 때 동일 단말임을 인증하기 위한 정보로서 security 토큰, 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에 대해서 할당하는 random number로서 Nonce, 상기 단말이 상기 MPQUIC/MPTCP 서버 또는 기능에 non-3gpp access를 통해 접속을 허용하는 시간 또는 상기 non-3gpp access를 통해 접속하는데 사용되는 정보가 유효한 시간인 expiration time 중 적어도 하나를 포함할 수 있다. 따라서 단계 9에서 상기 MPQUIC/MPTCP 서버 또는 기능으로부터 상기 단말에게 전달해야 하는 정보를 받은 UPF는 단계 10에서 N4 Session establish 또는 N4 Session modification 요청에 대한 응답메시지를 통해 SMF에게 전달하고, 상기 SMF는 단계 11에서 단말에게 PDU Session establishment accept 을 통해서 상기 UPF로부터 받은 정보를 단말에게 보낼 수 있고, 나머지 PDU Session establishment과정을단계 12와 같이 수행할 수 있다. 상기 단말과 상기 MPQUIC/MPTCP 서버 또는 기능과의 공유된 정보를 이용하여 단계 13에서 user plane을 통해 각 access에 대해서 sub-session을 생성할 수 있다. 특히 상기 단말이 native non-3gpp access를 통해서 상기 MPQUIC/MPTCP 서버 또는 기능에 접속하여 sub-session을 만드는 과정에서 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에 대해서 실제로 같은 단말인지를 확인하기 위하여 단말이 3gpp access를 통해서 전달하여 단계 9를 통해 전달됐던, 단말의 public UE IP address 및 port 정보 또는 outer UE IP address및 port 정보 또는 Nonce의 일부 혹은 전부가 일치 하는지의 여부, 또는 허용된 시간 즉 expiration time내에 native non-3gpp access를 통해서 요청했는지의 여부를 고려하여 단말 을 인증하고 native non-3gpp session을 허용할 수 있도록 할 수 있다. 한편, 단계 4에서 상기 native non-3gpp sub-session을 만드는 과정에서 AMF가 offloadable PDU Session 을 지원하는 SMF을 찾지 못하는 경우에 AMF는 단말에게 reject메시지를 보낼 수 있고 이때 cause로서 \"offloadable PDU Session is not supported\"가 포함될 수 있다. 또는 상기 native non-3gpp sub- session을 만드는 과정에서 단계 5와 같이 PDU Session establishment request를 수신한 SMF가 PCF 로부터 단계 7에서 \"offloadable PDU Session을 허용하지 않음\" 이나 \"native non-3GPP access를 통한 offloading을 허용하지 않음\" 이나 \"native non-3GPP sub-session을 traffic steering을 허용하지 않음\" 을 나 타내는 SM policy를 수신한 경우, 단계 8 내지 단계 10에서 native non-3gpp sub-session을 만들기 위한 parameter들은 생략할 수 있고, 단계 11에서 PDU Session establishment accept메시지에 reject cause로서 \"offloadable PDU Session is not supported\" 를 포함하거나, 또는 PDU Session establishment reject을 보내 면서 reject cause로서 \"offloadable PDU Session is not supported\"를 포함하여 native non-3gpp sub- session을 생성하지 못했음을 단말에게 알릴 수도 있다. 또는, SMF가 단계 8의 메시지를 보내기전에 3gpp access와 native non-3gpp access간의 traffic steering 을 지원하는 UPF를 발견하지 못한 경우 상기 SMF는 단계 11에서 PDU Session establishment accept메시지 에 reject cause로서 \"offloadable PDU Session is not supported\"를 포함하거나, 또는 PDU Session establishment reject을 보내면서 reject cause로서 \"offloadable PDU Session is not supported\"를 포함하여 native non-3gpp sub-session을 생성하지 못했음을 단말에게 알릴 수도 있다. 또한, 도 4a 및 4b의 절차를 설명함에 있어서 단말이 PDU Session establishment request과정을 통하여 설명을 했지만, 일 실시예로, 단말이 이 과정 대신 PDU Session modification request과정을 사용하여 도 4a 및 4b의 절차를 수행할 수 있다. 예를 들어 도 4a 및 4b에서 upgradeable to offload able PDU session으로 PDU Session이 establish된 경우 즉 SMF가 추가적으로 offload able PDU session으로 바꾸기를 결정하지 않은 채 PDU Session이 생성된 경우 에 상기 SMF는 PDU Session modification request 메시지를 통해서 상기 upgradeable to offload able PDU session에 대해서 offload able PDU session으로 전환하도록 할 수 있다. 이때 상기 SMF는 단계 8 내 지 단계 13과 같은 절차를 거치되 PDU Session establishment accept 대신에 PDU Session modification command 메시지를 통해서 native non-3gpp access와 steering을 하기위한 정보를 전달할 수 있다. 즉 상기 PDU Session modification command메시지는 offload-able PDU session indication을 포함하여 offload-able PDU session으로 전환함을 단말에게 알리게 되고, UPF로부터 받은 기 MPQUIC/MPTCP 서버 또는 기능으로부터 받은 정 보를 포함하여 단말에게 3gpp access와 native non-3gpp access 간의 steering을 위한 정보를 알릴 수 있다. 일 실시예로, 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에게 전달해야 하는 정보는 단말이 non- 3gpp access를 통해서 접속해야 하는 상기 MPQUIC/MPTCP 서버 또는 기능의 주소 정보로서 IP address 및 port 정보, 상기 선택된 steering기능을 알리기 위한 MPQUIC 또는 MPTCP의 정보, 상기 steering세션에 대한 ID로서 MPQUIC Session ID 또는 MPTCP session ID, sub-session이 생성되는 3gpp access 또는 native non-3gpp access 또는 상기 두 access모두를 나타내는 값, 단말이 상기 MPQUIC/MPTCP 서버 또는 기능에 non-3gpp access 를 통해 접속할 때 동일 단말임을 인증하기위한 정보로서 security 토큰, 상기 MPQUIC/MPTCP 서버 또는 기능이 상기 단말에 대해서 할당하는 random number로서 Nonce, 상기 단말이 상기 MPQUIC/MPTCP 서버 또는 기능에 non-3gpp access를 통해 접속을 허용하는 시간 또는 상기 non-3gpp access를 통해 접속하는데 사용되는 정보가 유효한 시간인 expiration time 중 적어도 하나를 포함할 수 있다. 도 5는 본 개시의 일 실시 예에 따른 non-3gpp access를 통한 트래픽 오프로드를 그만두기 위한 방법을 예시한 도면이다. 도 5를 참조하면, 단계 1과 같이 offloadable PDU session으로 생성되어서 native non-3gpp access와 3gpp access를 통해서 steering이 되고 있는 상황을 가정할 수 있다. 이때 단말(또는, UE) 또는 5G 네트워크에 서 native non-3gpp sub-session을 없애는 경우가 있을 수 있다. 단말이 native non-3gpp sub-session을 없애고자 하는 경우 단말은 단계 2와 같이 PDU Session modification request 메시지를 SMF에게 보낼 수 있다. 상기 메시지는 상기 steering 하는 세션인 MPQUIC Session ID 또는 MPTCP Session ID를 포함할 수 있고 또는, native non-3gpp sub-session을 deactivation시키 거나 release 시키도록 요청하는 indication 'deactivate native non-3gpp sub-session'을 포함할 수 있다. 일 실시예로, 단말이 native non-3gpp sub-session을 수정하고자 하는 경우 단계 2에서 PDU Session modification request 메시지를 SMF에게 보낼 수 있다. 상기 메시지는 상기 steering 하는 세션인 MPQUIC Session ID 또는 MPTCP Session ID를 포함할 수 있고 또 native non-3gpp sub-session을 modification 시키도 록 요청하는 indication 'modify native non-3gpp sub-session'을 포함할 수 있고, 이때 수정하고자 하는 parameter를 포함할 수 있다. 단계 3에서 SMF가 상기 단계 2의 메시지를 수신하거나 또는 SM policy가 변경되어 native non-3gpp sub- session을 삭제하거나 수정하도록 결정할 수 있다. 단계 4에서 SMF는 단말에게 PDU Session modification command 메시지를 보내서 삭제 또는 수정할 수 있다. 이때 상기 메시지는 상기 steering 하는 세 션인 MPQUIC Session ID 또는 MPTCP Session ID를 포함할 수 있고 또 native non-3gpp sub-session을 deactivation시키거나 release 시키도록 하는 indication 'deactivate native non-3gpp sub-session'을 포함할 수 있다. 또한 SMF는 단계 6 내지 단계 8에서 해당 native non-3gpp sub-session을 삭제하거나 수정하도록 UPF와 연동할 수 있다. 상기 과정을 수행하면 단계 5와 단계 9와 같이 native non-3gpp sub-session을 해 지할 수 있다. 일 실시예로, 단말이 native non-3gpp sub-session을 없애고자 하는 경우 단말은 단계 2에서 PDU Session modification request 메시지 대신 PDU Session release request메시지를 SMF에게 보낼 수 있다. 이때 상기 메시지는 상기 steering 하는 세션인 MPQUIC Session ID 또는 MPTCP Session ID를 포함할 수 있고, native non-3gpp sub-session을 deactivation시키거나 release 시키도록 요청하는 indication 'deactivate native non-3gpp sub-session'을 포함할 수 있다. 도 5에서 native non-3gpp sub-session을 없애거나 수정하는 것 대신에 native non-3gpp sub-session는 유지하 고 3gpp sub-session은 없애거나 수정하고자 하는 경우, PDU Session modification request또는 PDU Session release request메시지는 indication 'deactivate 3gpp sub-session'이나 indication 'release 3gpp sub- session'을 포함할 수 있다. 도 6은 본 개시의 일 실시예에 따른 non-3gpp access를 통한 트래픽 오프로드를 하는 단말이 non-allowed area로 이동하는 경우에 트래픽을 처리하기 위한 방법을 예시한 도면이다. 도 6을 참조하면, 단계 1과 같이 offloadable PDU session으로 생성되어서 native non-3gpp access와 3gpp access를 통해서 steering이 되고 있는 상황을 가정할 수 있다. 이때 단계 2와 같이 단말이 non-allowed area로 이동하여 더이상 3gpp access를 통해서 서비스를 받지 못하는 상황이 된 경우, 단계 3과 같이 AMF는 단말이 non-allowed area로 진입했음을 SMF에게 알릴 수 있다. 따라서, SMF는 단계 4와 같이 상기 단말이 해당 지역에서 3gpp access를 쓸 수 없음을 인식하게 되어 3gpp sub-session은 deactivation 시키거나 release 시키고 대신 native non-3gpp sub- session를 통해서 지속적으로 서비스를 받을 수 있도록 할 수 있다. 이를 위해 상기 SMF는 단계 5와 같이 단말에게 PDU Session modification command 메시지를 전송할 수 있다. 상기 PDU Session modification command 메시지는 상기 steering 하는 세션인 MPQUIC Session ID 또는 MPTCP Session ID를 포함할 수 있고, 3GPP access가 deactivated 됐거나 released됐거나 3gpp sub- session이 deactivated 됐거나 released됐다는 indication 포함할 수 있다. 또한 native non-3gpp sub-session 은 허용됨을 알리는 indication이나 3gpp sub-session만 허용되지 않음을 알리는 indication을 포함해서 native non-3gpp sub-session을 통해서 지속적으로 traffic을 서비스 받을 수 있음을 알릴 수 있다. 상기 메시 지와 보조를 맞춰서 단계 7 내지 단계 9에서 3gpp sub-session은 사용되지 않고 반면 native non-3gpp sub- session은 사용될 수 있도록 UPF 및 MPQUIC/MPTCP서버에서도 조정할 수 있다. 따라서 단계 6과 10 과 11처럼 단말은 3GPP access를 통한 traffic delivery는 non-allowed area에서 사용하지 않는 반면에 native non-3gpp access는 지속적으로 non-allowed area에서도 사용할 수 있도록 제어할 수 있다. 상기 단계 5에서 SMF가 사용하는 메시지로서 PDU Session modification command 메시지 대신 PDU Session release command메시지를 사용할 수도 있다. 도 7은 본 개시의 일 실시 예에 따른 non-3gpp access를 통한 트래픽 오프로드를 하는 단말이 non-allowed area에서 Service request를 처리하기 위한 방법을 예시한 도면이다. 도 7을 참조하면, 단계 1과 같이 offload-able PDU session으로 생성되어서 native non-3gpp access와 3gpp access를 통해서 steering이 되고 있는 상황을 가정한다. 이때 단계 2와 같이 단말이 non-allowed area로 이동하여 더이상 3gpp access를 통해서 서비스를 받지 못하는 상황이 된 경우가 있을 수 있다. 따라서 3gpp sub-session은 deactivation 시키고 대신 native non- 3gpp sub-session를 통해서 지속적으로 서비스를 받고 있을 수 있다. 이 때 단말은 3gpp access에 대해서 IDLE state에 있게 될 수 있다. 이때 단계 3과 같이 단말이 3gpp access를 통해서 native non-3gpp sub- session을 위한 signalling을 전송해야 하는 등 signalling 메시지를 전송해야 하는 상황에서 상기 단말은 non-allowed area에 있음에도 불구하고 단계 4와 같이 AMF에게 service request메시지를 보낼 수 있다. 이때 상기 service request메시지는 native non-3gpp sub-session을 위하여 필요한 면제상황임을 알리는 'exempt from non-allowed service area due to native non-3gpp sub-session'과 같은 indication을 포함하여 전달할 수 있고 해당 PDU Session ID를 포함할 수 있다. 이에 따라 단계 5와 같이 AMF는 Nsmf_PDUSession_UpdateSMContext request(PDU Session ID, 'exempt from non-allowed service area due to Native non-3gpp sub-session')메시지를 SMF에게 보내서 단계 6 내지 단계 8단계 등을 거쳐서 단말이 connected 상태에 있게 할 수 있다. 따라서 단계 9에서 단말을 필요에 따라 PDU Session modification request메시지를 통해서 native non-3gpp sub-session을 수정하거나, PDU Session establishment request메시지를 통해서 native non-3gpp sub-session을 위한 offload-able PDU Session을 생성시키는 등의 동작을 수행할 수 있다. 도 8은 본 개시의 실시예에 따른 네트워크 노드의 구조도를 도시한다. 도 8에 도시된 네트워크 엔티티는 단말(UE), AMF(access and mobility management function), SMF(session management function), UPF(user plane function), PCF(policy control function) 및 UDM(unified data management) 등 본 개시에서 언급된 네트워크 노드를 포함할 수 있다. 본 개시의 일 실시예에 따른 네트워크 노드는 네트워크 노드의 전반적인 동작을 제어하는 프로세서, 송신 부 및 수신부를 포함하는 송수신부 및 메모리를 포함할 수 있다. 물론 상기 예시에 제한되는 것은 아 니며 네트워크 노드는 도 8에 도시된 구성보다 더 많은 구성을 포함할 수도 있고, 더 적은 구성을 포함할 수도 있다. 본 개시의 일 실시예에 따르면, 송수신부는 네트워크 엔티티(Network Entity)들 또는 다른 네트워크 노드 와 신호를 송수신할 수 있다. 네트워크 엔티티와 송수신하는 신호는 제어 정보와 데이터를 포함할 수 있다. 또 한 송수신부는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 상술한 실시 예들 중 어느 하나의 동작을 수행하도록 네트워크 노드를 제어할 수 있다. 한편, 프로세서, 메모리, 및 송수신부는 반드시 별도의 모듈들로 구현되어야 하는 것은 아니고, 단일 칩과 같은 형태로 하나의 구성부로 구현될 수 있음은 물론이다. 그리고, 프로세 서 및 송수신부는 전기적으로 연결될 수 있다. 또한 프로세서는 AP(Application Processor), CP(Communication Processor), 회로(circuit), 어플리케이션 특정(application-specific) 회로, 또는 적어도 하나의 프로세서(processor)일 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 단말로부터 오프로드 가능한 PDU(packet data unit) 세션 지원 여부에 대한 정보를 포함하는 등록 요청 메시지를 수신하도록 구성될 수 있다. 프로세서는 네트워크가 오 프로드 가능한 PDU 세션을 지원하는지 여부를 결정하도록 구성될 수 있다. 일 실시예로, 프로세서는 상기 네트워크가 오프로드 가능한 PDU 세션을 지원하는 경우, 단말에게 등록 수락 메시지를 전송하도록 구성될 수 있 다. 일 실시예로, 프로세서는 단말로부터 NAS(non-access stratum) 메시지를 수신하도록 구성되고, 상기 NAS(non-access stratum) 메시지는 오프로드 가능한 PDU 세션에 관련된 지시자를 포함할 수 있다. 일 실시예로, 프로세서는 상기 오프로드 가능한 PDU 세션에 관련된 지시자에 기반하여 SMF(session management function)를 선택하도록 구성될 수 있다. 일 실시예로, 프로세서는 NRF(network repository function)로 상기 오프로드 가능한 PDU 세션에 관련된 지시자에 기반하여 SMF 발견 요청 메시지를 전송하도록 구성될 수 있 다. 일 실시예로, 상기 선택된 SMF에게 PDU 세션 업데이트 요청 메시지를 전송하도록 구성되고, 상기 PDU 세션 업데이트 요청 메시지는 상기 오프로드 가능한 PDU 세션에 관련된 지시자를 포함할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 네트워크 노드의 동작을 위한 기본 프로그램, 응용 프로그램, 설 정 정보 등의 데이터를 저장할 수 있다. 특히, 메모리는 프로세서의 요청에 따라 저장된 데이터를 제 공한다. 메모리는 롬 (ROM), 램(RAM), 하드디스크, CD-ROM 및 DVD 등과 같은 저장 매체 또는 저장 매체들 의 조합으로 구성될 수 있다. 또한, 메모리는 복수 개일 수 있다. 또한 프로세서는 메모리에 저 장된 전술한 본 개시의 실시예들을 수행하기 위한 프로그램에 기초하여 전술한 실시예들을 수행할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(read only memory, ROM), 전기적 삭제가능 프로그램가 능 롬(electrically erasable programmable read only memory, EEPROM), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(compact disc-ROM, CD-ROM), 디지털 다목적 디스크(digital versatile discs, DVDs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 프로그램은 인터넷(internet), 인트라넷(intranet), LAN(local area network), WAN(wide area network), 또는 SAN(storage area network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별 도의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 개시에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2023-0108225", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 non-3gpp access를 통한 트래픽을 오프로딩하는 무선 통신 시스템의 구조를 예시한 도면이다. 도 2는 본 개시의 일 실시예에 따른 WLAN(wireless local-area network)을 통해 단말을 인증하고 트래픽을 오 프로딩하는 무선 통신 시스템의 구조를 예시한 도면이다. 도 3a 및 3b은 본 개시의 일 실시예에 따른 PDU(packet data unit) 세션을 생성시 단말이 시작하여 non-3gpp access를 통한 트래픽을 오프로딩하기 위한 방법을 예시한 도면이다. 도 4a 및 4b는 본 개시의 일 실시예에 따른 PDU(packet data unit) 세션을 생성시 네트워크가 시작하여 non- 3gpp access를 통한 트래픽을 오프로딩하기 위한 방법을 예시한 도면이다. 도 5는 본 개시의 일 실시예에 따른 non-3gpp access를 통한 트래픽 오프로드를 그만두기 위한 방법을 예시한 도면이다. 도 6은 본 개시의 일 실시예에 따른 non-3gpp access를 통한 트래픽 오프로드를 하는 단말이 non-allowed area 로 이동하는 경우에 트래픽을 처리하기 위한 방법을 예시한 도면이다.도 7은 본 개시의 일 실시예에 따른 non-3gpp access를 통한 트래픽 오프로드를 하는 단말이 non-allowed area 에서 Service request를 처리하기 위한 방법을 예시한 도면이다. 도 8은 본 개시의 일 실시예에 따른 네트워크 노드의 구조도를 도시한다."}
