{"patent_id": "10-2017-7035231", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0003609", "출원번호": "10-2017-7035231", "발명의 명칭": "지각 비디오 품질을 예측하기 위한 기술", "출원인": "넷플릭스, 인크.", "발명자": "아론, 앤"}}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지각 비디오 품질을 추정하기 위한 컴퓨터에 의해 구현되는 방법으로서,복수의 결정론적 비디오 특성을 나타내는 객관적 메트릭들의 세트를 선택하는 단계;트레이닝 비디오들의 세트에 포함되는 각각의 트레이닝 비디오에 대해, 상기 트레이닝 비디오를 기술하는 데이터 세트를 수신하는 단계 - 상기 데이터 세트는 지각 비디오 품질 메트릭에 대한 주관적 값 및 상기 객관적 메트릭들의 세트에 대한 객관적 값들의 세트를 포함함 - ;상기 데이터 세트로부터, 상기 객관적 메트릭들의 세트에 대한 값들의 세트에 기초하여 상기 지각 비디오 품질메트릭에 대한 값을 결정하는 복합 관계(composite relationship)를 도출하는 단계;타겟 비디오에 대해, 상기 객관적 메트릭들의 세트에 대한 제1 세트의 값들을 계산하는 단계; 및상기 복합 관계를 상기 제1 세트의 값들에 적용하여 상기 지각 비디오 품질 메트릭에 대한 출력 값을 생성하는단계를 포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 복합 관계를 도출하는 단계는 상기 데이터 세트에 대해 하나 이상의 트레이닝 동작을 수행하는 단계를 포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 주어진 데이터 세트에 대해 하나 이상의 트레이닝 동작을 수행하는 단계는 지원 벡터 머신 알고리즘 또는 인공 신경망 알고리즘을 상기 데이터 세트에 포함된 상기 객관적 값들의 세트에 적용하는 단계를포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1 세트의 값들에 포함된 값이 미리 결정된 임계 값을 초과한다고 결정하는 단계; 및조정 인자에 기초하여 상기 지각 품질 메트릭에 대한 상기 출력 값을 수정하는 단계를 더 포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 타겟 비디오의 2개의 연속 프레임 간의 픽셀 차이에 기초하여 모션 값을 계산하는 단계;상기 모션 값이 미리 결정된 임계 값을 초과한다고 결정하는 단계; 및상기 지각 품질 메트릭에 대한 상기 출력 값을 미리 결정된 양만큼 증가시키는 단계를 더 포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 객관적 메트릭들의 세트는 상세 손실 측정 및 시각 정보 충실도 중 적어도 하나를 포함하는 컴퓨터에 의해 구현되는 방법.공개특허 10-2018-0003609-3-청구항 7 제1항에 있어서, 상기 객관적 메트릭들의 세트는 안티-잡음 신호-대-잡음 비를 포함하고, 상기 타겟 비디오는소스 비디오로부터 도출되며, 상기 안티-잡음 신호-대-잡음 비에 대한 제1 값을 계산하는 단계는,상기 소스 비디오에 제1 저역 통과 필터를 적용하는 단계;상기 제1 저역 통과 필터보다 강한 제2 저역 통과 필터를 상기 타겟 비디오에 적용하는 단계; 및필터링된 소스 비디오 및 필터링된 타겟 비디오에 기초하여 하나 이상의 신호-대-잡음 비 계산을 수행하는 단계를 포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 트레이닝 비디오들의 세트에 포함된 제1 트레이닝 비디오는 압축된 데이터 및 스케일링된데이터 중 적어도 하나를 포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 지각 비디오 품질 메트릭에 대한 제1 주관적 값은 상기 제1 트레이닝 비디오로부터 도출되는 재구성된 비디오의 시각적 품질에 대한 사람 관찰된 스코어인, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "명령어들을 포함하는 컴퓨터 판독 가능 저장 매체로서, 상기 명령어들은 처리 유닛에 의해 실행될 때, 상기 처리 유닛으로 하여금,복수의 결정론적 비디오 특성을 나타내는 객관적 메트릭들의 세트를 선택하는 단계;트레이닝 비디오들의 세트에 포함되는 각각의 트레이닝 비디오에 대해, 상기 트레이닝 비디오를 기술하는 데이터 세트를 수신하는 단계 - 상기 데이터 세트는 지각 비디오 품질 메트릭에 대한 주관적 값 및 객관적 메트릭들의 세트에 대한 객관적 값들의 세트를 포함함 - ;상기 데이터 세트로부터, 상기 객관적 메트릭들의 세트에 대한 값들의 세트에 기초하여 상기 지각 비디오 품질메트릭에 대한 값을 결정하는 복합 관계를 도출하는 단계;타겟 비디오에 대해, 상기 객관적 메트릭들의 세트에 대한 제1 세트의 값들을 계산하는 단계; 및상기 복합 관계를 상기 제1 세트의 값들에 적용하여 상기 지각 비디오 품질 메트릭에 대한 출력 값을 생성하는단계를 수행함으로써 지각 비디오 품질을 추정하게 하는, 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 복합 관계를 도출하는 단계는 상기 데이터 세트에 대해 하나 이상의 트레이닝 동작을 수행하는 단계를 포함하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 타겟 비디오의 2개의 연속 프레임 간의 픽셀 차이에 기초하여 모션 값을 계산하는 단계;상기 모션 값이 미리 결정된 임계 값을 초과한다고 결정하는 단계; 및상기 지각 품질 메트릭에 대한 상기 출력 값을 미리 결정된 양만큼 증가시키는 단계를 더 포함하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 트레이닝 비디오들의 세트에 포함된 제1 트레이닝 비디오는 제1 원본 비디오로부터 도출공개특허 10-2018-0003609-4-된 압축된 데이터를 포함하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 지각 비디오 품질 메트릭에 대한 제1 주관적 값은 상기 제1 원본 비디오의 시각적 품질과, 하나 이상의 압축해제 동작에 기초하여 상기 제1 트레이닝 비디오로부터 도출되는 재구성된 트레이닝 비디오의 시각적 품질 사이의 변동을 나타내는, 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서, 상기 지각 비디오 품질 메트릭에 대한 제1 주관적 값은 하나 이상의 압축해제 동작에 기초하여 상기 제1 트레이닝 비디오로부터 도출되는 비디오의 상기 시각적 품질에 대한 인간 관찰된 스코어인, 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서, 상기 객관적 메트릭들의 세트는 안티-잡음 신호-대-잡음 비를 포함하고, 상기 타겟 비디오는소스 비디오로부터 도출되며, 상기 안티-잡음 신호-대-잡음 비에 대한 제1 값을 계산하는 단계는,상기 소스 비디오에 제1 저역 통과 필터를 적용하는 단계;상기 제1 저역 통과 필터보다 강한 제2 저역 통과 필터를 상기 타겟 비디오에 적용하는 단계; 및필터링된 소스 비디오 및 필터링된 타겟 비디오에 기초하여 하나 이상의 신호-대-잡음 비 계산을 수행하는 단계를 포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서, 상기 복합 관계는 방정식인, 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 복합 관계를 상기 제1 세트의 값에 적용하는 단계는 상기 제1 세트의 값들에 포함된 값들에 대한 상기 방정식을 푸는 단계를 포함하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "복수의 결정론적 비디오 특성을 나타내는 객관적 메트릭들의 세트에 기초하여 지각 비디오 품질을 추정하도록구성된 시스템으로서, 복수의 원본 비디오로부터 트레이닝 비디오들의 세트를 생성하도록 구성된 인코더;지각 품질 트레이너 - 상기 지각 품질 트레이너는,상기 트레이닝 비디오들의 세트에 포함된 각각의 트레이닝 비디오에 대해, 상기 트레이닝 비디오를 기술하는 데이터 세트를 수신하고 - 상기 데이터 세트는 지각 비디오 품질 메트릭에 대한 주관적 값 및 상기 객관적 메트릭들의 세트에 대한 객관적 값들의 세트를 포함함 - ;상기 데이터 세트들로부터, 상기 객관적 메트릭들의 세트에 대한 값들의 세트에 기초하여 상기 지각 비디오 품질 메트릭에 대한 값을 결정하는 복합 관계를 도출하도록 구성됨 - ; 및지각 품질 계산기 - 상기 지각 품질 계산기는,타겟 비디오에 대해, 상기 객관적 메트릭들의 세트에 대한 제1 세트의 값들을 계산하고;상기 복합 관계를 상기 제1 세트의 값들에 적용하여 상기 지각 비디오 품질 메트릭에 대한 출력 값을 생성하도록 구성됨 -을 포함하는 시스템."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 복합 관계를 도출하는 것은 상기 데이터 세트에 대해 하나 이상의 트레이닝 동작을 수행공개특허 10-2018-0003609-5-하는 것을 포함하는 시스템."}
{"patent_id": "10-2017-7035231", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "지각 비디오 품질을 추정하기 위한 컴퓨터에 의해 구현되는 방법으로서,트레이닝 비디오들의 세트에 포함되는 각각의 트레이닝 비디오에 대해, 상기 트레이닝 비디오를 기술하는 데이터 세트를 수신하는 단계 - 상기 데이터 세트는 지각 비디오 품질 메트릭에 대한 주관적 값, 모션에 대한 객관적 값들의 세트, 안티-잡음 신호 대 잡음 비, 상세 손실 측정 및 시각 정보 충실도 측정을 포함하는 객관적 메트릭들의 세트에 대한 객관적 값들의 세트를 포함함 - ;상기 데이터 세트로부터, 상기 모션에 대한 값들의 세트 및 상기 객관적 메트릭들의 세트에 대한 값들의 세트에기초하여 상기 지각 비디오 품질 메트릭에 대한 값을 결정하는 복합 관계를 도출하는 단계;타겟 비디오에 대해, 상기 모션에 대한 제1 세트의 값들 및 상기 객관적 메트릭들의 세트에 대한 제1 세트의 값들을 계산하는 단계;상기 지각 비디오 품질 메트릭에 대한 출력 값을 생성하기 위해, 상기 모션에 대한 상기 제1 세트의 값들 및 상기 객관적 메트릭들의 세트에 대한 상기 제1 세트의 값들에 상기 복합 관계를 적용하는 단계;상기 모션에 대한 상기 제1 세트의 값들에 포함된 제1 모션 값이 미리 결정된 임계 값을 초과한다고 결정하는단계; 및상기 모션과 연관된 조정 인자에 기초하여 상기 지각 품질 메트릭에 대한 상기 출력 값을 변경하는 단계를 포함하는 컴퓨터에 의해 구현되는 방법."}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에서, 품질 트레이너 및 품질 계산기는 머신 학습을 통해 일관된 지각 품질 메트릭을 확립하 기 위해 협력한다. 트레이닝 단계에서, 품질 트레이너는 머신 지능형 기술을 활용하여, 트레이닝 비디오들의 시 청들 동안 할당된 주관적 메트릭을 최적으로 추적하기 위해 객관적 메트릭들을 결합하는 지각 품질 모델을 생성 한다. 이어서, 품질 계산기는 타겟 비디오에 대한 객관적 메트릭에 대한 값들에 지각 품질 모델을 적용함으로써, 타겟 비디오에 대한 지각 품질 스코어를 생성한다. 이러한 방식으로, 지각 품질 모델은 트레이닝 단계 동안 처리된 시각적 피드백에 기초하여 타겟 비디오에 대한 객관적 메트릭들을 현명하게 융합한다. 각각의 객관적 메트릭의 지각 품질 스코어에 대한 기여가 경험적 데이터를 기반으로 결정되므로, 지각 품질 스코어는 기 존 객관적 메트릭보다 관찰된 비디오 품질의 더 정확한 평가이다."}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원들에 대한 상호 참조 본 출원은 2015년 5월 11일자로 출원된 미국 특허 출원 제14/709,230호의 이익을 주장하며, 이는 본 명세서에 참고로 포함된다."}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "발명의 분야 본 발명의 실시예는 일반적으로 컴퓨터 과학에 관한 것으로, 보다 구체적으로는 지각 비디오 품질을 예측하기 위한 기술에 관한 것이다. 관련 기술의 설명 소스 비디오를 효율적이고 정확하게 인코딩하는 것은 비디오 콘텐츠의 실시간 전달을 위하여 필수적이다. 인코 딩된 비디오 콘텐츠가 수신된 후, 소스 비디오는 디코딩되고 시청되거나, 그렇지 않으면 동작된다. 일부 인코 딩 프로세스는 소스의 정확한 복제를 가능하게 하기 위하여, 호프만 코딩(Huffman coding)과 같은 무손실 압축 알고리즘을 채용한다. 대조적으로, 압축 레이트를 증가시키고/거나 인코딩된 비디오 콘텐츠의 크기를 감소시키 기 위하여, 다른 인코딩 프로세스는 선택된 정보를 제거하여, 전형적으로 소스의 대략적인 재구성만을 가능하게 하는 손실성 데이터 압축 기술을 활용한다. 비디오가 디스플레이 디바이스의 치수와 일치하도록 더 큰 해상도 로 스케일-업되는 리사이징 동작 중에 추가 왜곡이 도입될 수 있다. 전달된 비디오의 품질을 수동으로 검증하는 것은 엄청나게 많은 시간이 걸린다. 결과적으로, 수용 가능한 비디 오 시청 경험을 보장하기 위해, 전달된 비디오의 품질을 효율적이고 정확하게 예측하는 것이 바람직한다. 따라 서, 자동화된 비디오 품질 평가는 종종 인프라구조를 인코딩하고 스트리밍 하는데 필수적인 부분이다 - 비디오 품질을 유지하기 위해 인코더를 평가하고 스트리밍 비트레이트를 미세 튜닝하는 것과 같은 다양한 프로세스에서 이용됨 - . 인코딩된 비디오의 품질을 평가하는 하나의 접근법에서, 피크 신호 대 잡음 비(PSNR)와 같은 전체 참조 품질 메 트릭은 소스 비디오와 인코딩된 비디오를 비교하기 위해 사용된다. 그러나 이러한 메트릭은 신호 충실도(즉,소스 비디오에 대한 인코딩된 비디오의 충실)를 정확하게 반영하지만, 이러한 메트릭은 사람의 품질 인식을 안 정적으로 예측하지 못한다. 예를 들어, 충실도 측정은 전형적으로, 스틸 장면의 시각적 아티팩트가 빠른 모션 장면의 시각적 아티팩트 보다 시청 경험을 현저하게 저하할 수 있다는 것을 반영하지 않는다. 또한, 이러한 지 각 효과로 인해, 이러한 충실도 메트릭은 콘텐츠 종속적이며, 따라서 상이한 타입의 비디오 데이터에서 일관성 이 없다. 예를 들어, 빠른 모션 장면으로 주로 구성된 액션 영화의 충실도 저하는 느리게 진행되는 다큐멘터리 의 충실도 저하보다 덜 눈에 띈다. 전술한 바와 같이, 본 기술 분야에서 필요한 것은 비디오의 인지된 품질을 예측하기 위한 보다 효과적인 기술이 다. 본 발명의 일 실시예는 지각 비디오 품질을 추정하기 위한 컴퓨터에 의해 구현되는 방법을 개시한다. 이 방법 은 복수의 결정론적 비디오 특성을 나타내는 객관적 메트릭들의 세트를 선택하는 단계; 트레이닝 비디오들의 세 트에 포함되는 각각의 트레이닝 비디오에 대해, 트레이닝 비디오를 기술하는 데이터 세트를 수신하는 단계 - 데 이터 세트는 지각 비디오 품질 메트릭에 대한 주관적 값 및 객관적 메트릭들의 세트에 대한 객관적 값들의 세트 를 포함함 - ; 데이터 세트들로부터, 객관적 메트릭들의 세트에 대한 값들의 세트에 기초하여 지각 비디오 품질 메트릭에 대한 값을 결정하는 복합 관계(composite relationship)를 도출하는 단계; 타겟 비디오에 대해, 객관 적 메트릭들의 세트에 대한 제1 세트의 값들을 계산하는 단계; 및 지각 비디오 품질 메트릭에 대한 출력 값을 생성하기 위해 복합 관계를 제1 세트의 값들에 적용하는 단계를 포함한다. 지각 비디오 품질을 추정하기 위한 개시된 기술의 한 가지 장점은 지각 비디오 품질 메트릭을 정의하는 복합 관 계가 직접적인 인간 관찰에 기초한 객관적 메트릭들을 융합한다는 것이다. 보다 구체적으로, 트레이닝 비디오 들의 세트에 대한 인간 피드백이 객관적 메트릭들 각각의 기여를 안내하기 때문에, 타겟 비디오에 복합 관계를 적용하는 것은 인간 피드백을 일반화한다. 결과적으로, 지각 비디오 품질 메트릭은 인지된 비디오 품질을 신뢰 성 있게 예측한다. 대조적으로, 종래의 품질 메트릭은 전형적으로 신호 충실도 - 인간 시각 시스템에 의해 인 지되는 비디오 품질을 반드시 추적하지 않는 특성 - 를 측정한다."}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 설명에서는, 본 발명의 더 충분한 이해를 제공하기 위해 다수의 특정 상세가 제시된다. 그러나 본 기술 분야의 통상의 기술자에게는 본 발명이 이들 하나 이상의 특정 상세 없이도 실시될 수 있음이 명백할 것이다. 시스템 개요 도 1은 본 발명의 하나 이상의 양태를 구현하도록 구성된 시스템의 개념도이다. 도시된 바와 같이, 시스 템은 입력 데이터를 송신하고/하거나 비디오를 표시할 수 있는 다양한 디바이스에 접속된 가상 사설 클라 우드(즉, 캡슐화된 공유 자원, 소프트웨어, 데이터 등)를 포함한다. 그러한 디바이스들은 데스크톱 컴퓨터, 스마트폰 및 랩톱을 포함하지만 이에 한정되지 않는다. 대안적 실시예들에서, 시스템(10 0)은 임의의 수 및/또는 타입의 입력, 출력, 및/또는 입출력 디바이스들을 임의의 조합으로 포함할 수 있다. 가상 사설 클라우드(virtual private cloud)(VPC)는 임의의 수 및 타입의 컴퓨트 인스턴스들(compute instances)을 제한 없이 포함한다. VPC는 입력 디바이스(예를 들어, 랩톱)로부터 입력 사용자 정보를 수신하고, 하나 이상의 컴퓨터 인스턴스는 사용자 정보에 대해 동작하고, VPC는 처리된 정보 를 사용자에게 송신한다. VPC는 종래의 음극선관, 액정 디스플레이, 발광 다이오드 등과 같은 임의의 수 의 디바이스들의 디스플레이 능력을 통해 출력 정보를 사용자에게 전달한다. 대안적 실시예들에서, VPC는 공공 또는 하이브리드 클라우드와 같은 임의의 타입의 클라우드 컴퓨팅 환경 으로 대체될 수도 있다. 다른 실시예들에서, 시스템은 VPC 대신에, 임의의 분산된 컴퓨터 시스템을 포함할 수 있다. 또 다른 실시예들에서, 시스템은 VPC를 포함하지 않고, 그 대신에 시스템은 다수의 처리 유닛들(예컨대, 임의의 조합으로 된 중앙 처리 유닛들 및/또는 그래픽 처리 유닛들)을 구현하는 단 일 컴퓨팅 유닛을 포함한다. 컴퓨트 인스턴스에 대해 도시된 바와 같이, 각각의 컴퓨트 인스턴스는 중앙 처리 유닛(CPU), 그래픽 처리 유닛(GPU) 및 메모리를 포함한다. 동작시, CPU는 컴퓨트 인스턴스에 포함된 다른 컴포넌트들의 동작들을 제어하고 조정하는 컴퓨트 인스턴스의 마스터 프로세서이다. 특히, CPU(11 2)는 GPU의 동작을 제어하는 커맨드들을 발행한다. GPU는, 예를 들어 비디오 출력 회로를 포함하여 그래픽 및 비디오 처리에 최적화된 회로를 포함한다. 다양한 실시예에서, GPU는 컴퓨트 인스턴스의 다른 요소들 중 하나 이상과 통합될 수 있다. 메모리는 컴퓨트 인스턴스의 CPU 및 GPU에 의한 사용을 위해 소프트웨어 애플리케이션 및 데이터와 같은 콘텐츠를 저장한다. 일반적으로, VPC 내에 포함된 컴퓨트 인스턴스들은 하나 이상의 애플리케이션을 구현하도록 구성된다. 도시된 바와 같이, 컴퓨트 인스턴스들(1101-110N)은 인코더로서 구성된다. 인코더는 본"}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에 공지된 임의의 타입의 데이터 압축 기술을 임의의 기술적으로 실현 가능한 방식으로 구현한다. 일 부 실시예에서, 인코더는 소스 데이터를 다수의 청크로 분할한 다음 청크 상에서 동시에 데이터 압축 기술 을 수행하는 병렬 청크 인코더이다. 인코딩된 데이터 크기 제한 및 이용 가능한 스트리밍 대역폭과 같은 리소스 제약을 따르기 위해, 인코더는 선택된 정보를 제거하는 손실성 데이터 압축 기술을 구현한다. 정보를 제거함으로써, 인코더는 소스 데이 터가 재구성될 때 왜곡을 도입하는 \"압축\" 아티팩트를 생성한다. 재구성된 소스 데이터의 시각적 품질은 트랜 스코딩 파이프라인에 포함된 다른 요소(즉, 한 포맷의 소스 데이터를 다른 포맷의 재구성된 데이터로 변환하는 애플리케이션)에 의해 종종 추가로 손상될 수 있다. 예를 들어, 소스 데이터를 다운 스케일링 및 인코딩한 다 음 디코딩된 데이터를 디스플레이 디바이스에서 소스 해상도로 업 스케일링하는 프로세스 동안 \"스케일링\" 아티 팩트가 도입될 수 있다. 허용 가능한 시청 경험을 보장하기 위해, 재구성된 데이터의 품질과, 간접적으로 트랜스코딩 파이프 라인에 포 함된 요소의 캘리버(caliber)는 전형적으로 품질 메트릭을 사용하여 설계 및 전달 프로세스의 다양한 시점에서 평가된다. 품질 메트릭에 대한 값은 그 후 애플리케이션(예를 들어, 인코더)의 개발, 및 품질을 인식하는 스트 림 스위칭 알고리즘과 같은 콘텐츠 전달의 실시간 최적화를 안내하는 데 사용된다. 광범위하게 적용되는 품질 메트릭(예를 들어, 평균 제곱 에러(mean-squared-error)(MSE) 및 피크 신호 대 잡음 비(peak signal-to-noise ratio)(PSRN))는 충실도 - 소스 데이터에 대한 재구성된 데이터의 충실 - 을 측정한 다. 그러나 충실도 측정은, 예를 들어 자연 이미지에서의 마스킹, 대비 감도(contrast sensitivity) 또는 고도 로 구조화된 콘텐츠와 같은 인간 시각 시스템(HVS)에 영향을 미치는 정신-시각 현상을 반영하지 않는다. 또한, 이러한 불완전하게 반영된 지각 효과로 인해, 이러한 충실도 메트릭은 콘텐츠 종속적이다 - 이 값들은 상이한 타입의 비디오 데이터에서 비교할 수 없다. 예를 들어, 그레인 잡음이 있는 비디오는, 인간 시청자에 의해 검 출할 수 있는 시각적 영향이 상대적으로 낮을지라도 PSNR에서는 상대적으로 크게 불리하게 된다. 일반적으로, 종래의 품질 메트릭은 인간에 의해 인지되는 시각적 품질에 대한 신뢰할 수 있는 표시가 아니며, 따라서 시청 경험의 수용성이 아니다. 이러한 이유로, VPC 내의 컴퓨트 인스턴스들 중 하나 이상은 머신 학습 기술을 구현하여 일관된 지각 품질 메트릭을 개시한다. 특히, 지각 품질 스코어(perceptual quality score)(즉, 지각 품질 메트릭에"}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "대한 값)는 비디오 콘텐츠의 타입에 관계없이 보편적인 방식으로 주관적인 인간 시각 경험에 상관된다. 일관된지각 품질 메트릭을 구현하기 위해 본 기술분야에 공지된 임의의 타입의 학습 알고리즘이 활용될 수 있다. 일 부 실시예들에서, 지원 벡터 머신(support vector machine)(SVM)은 일관된 지각 품질 메트릭을 위한 프레임워크 를 제공한다. 다른 실시예에서, 신경망은 일관된 지각 품질 메트릭을 확립하기 위한 알고리즘을 구현한다. 도 1에 점선으로 도시된 트레이닝 단계에서, 지각 품질 트레이너는 지각 품질 모델을 생성한다. 지 각 품질 모델은 트레이닝 데이터의 시청 동안 할당된 주관적 메트릭에 대한 값을 최적으로 추적하기 위해 객관적 메트릭을 결합하는 감독 학습 모델이다. 객관적 메트릭 서브시스템은 트레이닝 데이터 와 대응하는 인코딩된 트레이닝 데이터 간의 비교 동작에 기초하여 객관적 메트릭을 생성한다. 이러한 객 관적 메트릭은 완전-참조 품질 지수로 지칭되며, 임의의 기술적으로 실현 가능한 방식으로 생성될 수 있다. 디코더가 인코딩된 트레이닝 데이터로부터 재구성된 트레이닝 데이터를 생성한 후에, 시청자들 은 랩톱의 스크린과 같은 디스플레이 디바이스 상에서 재구성된 데이터를 시청하고, 시각적 품질을 개인별로 레이트(rate)한다 - 주관적 메트릭에 값들을 할당한다. 지각 품질 트레이너는 객관적 메트릭에 대한 계산된 값 및 주관적 메트릭에 대한 사람-할당된 값을 수신한다. 지각 품질 트레이너는 그 후 이들 메트릭에 기초하여 지각 품질 모델을 트레이닝시 킨다. 보다 구체적으로, 지각 품질 트레이너는 객관적 메트릭과 주관적 메트릭 사이의 패턴을 인식하는 학습 알고리즘을 실행한다. 이어서, 지각 품질 트레이너는 주관적 메트릭에 대한 값을 반 영하는 지각 품질 스코어로 객관적 메트릭에 대한 값들을 융합시키기 위해 지각 품질 모델을 구 성하며, 결과적으로는 시청자의 경험을 구성한다. 도 1에서 실선으로 도시된 스코어링 단계에서, 지각 품질 계산기는 지각 품질 모델, 및 타겟 데이터 에 대한 객관적 메트릭에 대한 값을 수신한다. 지각 품질 계산기는 지각 품질 모델을 객관적 메트릭에 대한 값에 적용하고 타겟 데이터에 대한 지각 품질 스코어를 생성한다. 객관적 메트릭 에 대한 값은 임의의 기술적으로 실현 가능한 방식으로 생성될 수 있다. 예를 들어, 객관적 메트릭 서브 시스템은 임의의 기준 데이터(예를 들어, 소스 데이터)를 임의의 도출된 타겟 데이터(예를 들어, 인코딩된 소스 데이터)와 비교하여 객관적 메트릭에 대한 값을 계산할 수 있다. 트레이닝 단계 도 2는 본 발명의 일 실시예에 따른, 도 1의 객관적 메트릭 생성 서브시스템 및 지각 품질 트레이너 를 도시하는 블록도이다. 객관적 메트릭 생성 서브시스템은 임의의 기술적으로 실현 가능한 방식으로 구 현될 수 있으며, 객관적 메트릭에 대한 임의의 수의 값을 각각 생성하는 임의의 수의 개별 애플리케이션을 포함할 수 있다. 지각 품질 트레이너는 지원 벡터 머신(SVM) 모델 생성기 및 시간 조정 식별자(25 0)를 포함하지만 이에 제한되지 않는다. 트레이닝 비디오들의 세트에 대한 인코딩된 트레이닝 데이터 및 트레이닝 데이터를 수신할 때, 객관 적 메트릭 생성 서브시스템은 객관적 메트릭에 대한 값을 계산한다. 트레이닝 비디오는 지각 품질 스코어에 의해 표현될 비디오 타입의 범위를 표현하는 임의의 수 및 길이의 비디오 클립을 포함할 수 있다. 예를 들어, 일 실시예에서, 트레이닝 세트 내의 비디오 클립은 다양한 범위의 하이 레벨 피처들(예를 들 어, 애니메이션, 스포츠, 실내, 카메라 모션, 얼굴 클로즈업, 사람, 물, 명백한 돌출부, 객체 번호) 및 로우 레 벨 특성들(예를 들어, 필름 그레인 잡음, 밝기, 콘트라스트, 텍스처, 모션, 색상 차이, 색상 풍부함, 선명도)에 걸쳐있다. 일부 실시예에서, 트레이닝 비디오들의 세트는 서던 캘리포니아 대학에서 공개적으로 입수 가능한 비디오 클립 의 MCL-V 비디오 데이터베이스이다. 다른 실시예에서, 비디오 클립의 ML-V 비디오 데이터베이스는 선택된 높은 필름 그레인 클립 및 애니메이션 타이틀로 보충되어 트레이닝 비디오들의 세트의 다양성 및 견고성을 증가시킨 다. 트레이닝 데이터는 트레이닝 비디오를 포함하고, 인코딩된 트레이닝 데이터는 트레이닝 데이터 로부터 도출된다. 보다 구체적으로, 트레이닝 데이터에 포함된 클립들 각각에 대해, 인코더는 다양한 상이한 해상도 및/또는 품질 레벨(즉, 비트레이트)에서 클립을 반복적으로 인코딩하도록 구성된다. 이 러한 방식으로, 미리 결정된 수의 인코딩된 클립이 트레이닝 세트 내의 각각의 비디오 클립으로부터 생성되고, 이들 인코딩된 클립은 인코딩된 트레이닝 데이터를 형성한다. 일반적으로, 각각의 비디오 품질 메트릭은 강점과 약점을 모두 나타낸다. 강점을 이용하고 약점을 완화하기 위 해, 객관적 메트릭 생성 서브시스템은, 인코딩된 트레이닝 데이터의 범위에 걸쳐 시각적 품질에 귀중 한 통찰력을 함께 제공하는 객관적 메트릭의 세트를 계산하도록 구성된다. 객관적 메트릭의 선택은임의의 수의 예상된 아티팩트를 처리하기 위해 임의의 기술적으로 실현 가능한 방식으로 이루어질 수 있다. 예 를 들어, 일부 실시예에서, 객관적 메트릭은 압축(즉, 블로키니스(blockiness)) 및 스케일링(즉, 블러리니 스(blurriness))에 의해 야기되는 열화를 평가하기 위해 경험적으로 선택된다. 도시된 바와 같이, 객관적 메트릭은 상세 손실 측정(detail loss measure)(DLM), 시각 정보 충실도 (visual information fidelity)(VIF) 및 안티-잡음 신호-대-잡음 비(anti-noise signal-to-noise ratio)(ANSNR)를 포함한다. DLM은 신호의 블러리니스 컴포넌트를 식별하기 위해 웨이블릿 분해 (wavelet decomposition)를 적용하는 것에 기초한다. DLM은 중간 품질 범위에서의 블러리니스를 검출할 때에는 상대적으로 양호하지만, 보다 높은 품질 범위에서의 품질을 판별할 때에는 상대적으로 열악하다. VIF는 주파수 도메인에서 신호를 분석하기 위해 웨이브렛 변환을 적용하는 것에 기초한다. VIF는 약 간의 블루잉 아티팩트(bluing artifact)를 검출할 때에는 상대적으로 양호하지만, 블로킹 아티팩트를 검출할 때 에는 상대적으로 열악하다. ANSNR은 영화 콘텐츠에 대한 SNR의 일부 단점을 완화하도록 설계된다. SNR 계산을 수행하기 전에, 객관적 메트릭 생성 서브시스템은 트레이닝 데이터에 약한 저역 통과 필터를 적용하고 인코딩된 트레이닝 데 이터에 강한 저역 통과 필터를 적용한다. ANSNR은 상대적으로 계산이 빠르며 압축 아티팩트 및 강한 스케일링 아티팩트를 검출하는데 양호하다. 그러나 ANSNR은 약간의 블러링 아티팩트를 무시하고, 결과적 으로 고품질 범위에서의 사소한 품질 변화에는 민감하지 않다. 추가의 최적화로서, 인간 시각 시스템이 높은 모션의 기간 동안 열화에 덜 민감하기 때문에, 객관적 메트릭 생 성 서브시스템은 모션 값을 계산한다. 각각의 프레임에 대해, 객관적 메트릭 생성 서브시스템 은 이전 프레임에 대한 프레임의 평균 동일 위치 픽셀 차이(mean co-located pixel difference)로서 모션 값 을 계산한다. 특히, 잡음이 모션으로 잘못 해석될 가능성을 줄이기 위해, 객관적 메트릭 생성 서브시스템 은 차이 계산을 수행하기 전에 저역 통과 필터를 적용한다. 주관적 메트릭에 대한 값은 임의의 수 및 타입의 디스플레이 디바이스 상에서, 본 명세서에서 재구성된 트 레이닝 데이터로 지칭되는, 인코딩된 트레이닝 데이터의 디코딩된 버전 및 트레이닝 데이터를 시청한 후에 시청자에 의해 할당된다. 일 실시예에서, 시청자 각각은 재구성된 트레이닝 클립들 각각과 나 란한 각각의 트레이닝 클립을 시청하고 주관적 메트릭에 값을 할당한다. 주관적 메트릭에 대한 값은 인지된 시각적 품질을 나타내는 절대 값이다. 예를 들어, 일 실시예에서, 주관적 메트릭에 대한 값은 0에 서 100까지 변할 수 있다. 100의 스코어는, 재구성된 트레이닝 클립이 트레이닝 클립과 동일하게 보이는 것을 나타낸다. 20 아래의 스코어는, 재구성된 트레이닝 클립이 중요한 장면 구조를 잃어 버리고 트레이닝 클립에 비해 상당한 블러링을 보이는 것을 나타낸다. 이어서, SVM 모델 생성기는 모션 값, 객관적 메트릭에 대한 값, 및 인코딩된 트레이닝 데이터 에 대한 주관적 메트릭에 대한 값을 수신한다. SVM 모델 생성기는 그 후 학습 알고리즘을 적용 하여 지각 품질 모델을 트레이닝시킨다. 인코딩된 트레이닝 데이터에 대해, SMV 모델 생성기는 주관적 메트릭에 대한 관찰된 값과 객관적 메트릭에 대한 계산된 값뿐만 아니라 모션 값 사이의 상관을 식별한다. SVM 모델 생성기는 지각 품질 모델 - 주관적 메트릭을 추정하는 모션 값"}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "과 객관적 메트릭의 융합 - 을 생성한다. 본 기술분야의 통상의 기술자가 인식할 수 있는 바와 같이, SVM 모델 생성기는 임의의 타입의 모델을 생성하기 위해 다수의 학습 알고리즘 중 임의의 것을 구현 할 수 있다. 대안적 실시예에서, SVM 모델 생성기는 신경망과 같은 임의의 타입의 학습 알고리즘을 구현 하는 임의의 처리 유닛으로 대체될 수 있다. 시간 조정 식별자는 코너 경우들(corner cases)에 대한 지각 품질 모델을 튜닝하도록 구성된다. 특 히, 매우 높은 모션 장면(즉, 높은 모션 값)에 대해, 지각 품질 모델은 시간 마스킹 효과를 적절하게 나타내지 못할 수 있다. 결과적으로, 시간 조정 식별자는 그러한 장면에 대한 지각 품질 모델에 적 용되는 시간 조정을 생성한다. 일부 실시예에서, 시간 조정은 임계 값 및 백분율을 포함한다. 시간 조정은 지각 품질 모델과 함께 적용되어, 지각 품질 모델을 통해 계산된 지각 품질 스코어(16 5)를 그 백분율만큼 증가시킨다. 스코어링 단계 도 3은 본 발명의 일 실시예에 따른, 도 1의 객관적 메트릭 생성 서브시스템 및 지각 품질 계산기를 도시하는 블록도이다. 도시된 바와 같이, 지각 품질 계산기는 지원 벡터 머신(SVM) 매퍼 및 시간 조정기를 포함하지만 이에 제한되지 않는다. 지각 품질 계산기는 스코어링 단계 동안 동작한다 - \"트 레이닝된\" 지각 품질 모델 및 시간 조정에 기초하여 소스 데이터로부터 도출되는 인코딩된 데이 터에 대한 지각 품질 스코어를 계산한다. SVM 매퍼는 임의의 수의 트레이닝 데이터에 대응하는 임의의 수의 지각 품질 모델 및 시간 조정 으로 구성될 수 있다. 일부 실시예에서, 모델 선택 모듈(도시되지 않음)은 유사한 콘텐츠의 트레이닝 데 이터를 그룹으로 분류한 다음, 평가될 인코딩된 데이터의 콘텐츠에 기초하여 지각 품질 모델을 할당한다. 예를 들어, 한 세트의 트레이닝 데이터는 비교적 높은 품질의 비디오를 포함할 수 있고, 따라 서 대응하는 지각 품질 모델은 고품질 인코딩된 데이터에 대한 지각 품질 스코어를 결정하도록 최적화된다. 대조적으로, 다른 세트의 트레이닝 데이터는 비교적 낮은 품질의 비디오를 포함할 수 있고, 따라서 대응하는 지각 품질 모델은 저품질 인코딩된 데이터에 대한 지각 품질 스코어를 결정하 도록 최적화된다. 소스 데이터, 및 소스 데이터로부터 도출된 인코딩된 데이터의 수신시, 객관적 메트릭 생성 서 브시스템은 객관적 메트릭 및 모션 값에 대한 값을 계산한다. 일반적으로, 객관적 메트릭 및 모션 값에 대한 값은 임의의 기술적으로 실현 가능한 방식으로 결정될 수 있다. 예를 들어, 일부 실시 예는 다수의 객관적 메트릭 계산기를 포함하고, 각각의 객관적 메트릭 계산기는 상이한 객관적 메트릭을 구성한 다. SVM 매퍼는 지각 품질 스코어를 생성하기 위해 객관적 메트릭 및 모션 값에 지각 품질 모 델을 적용한다. 이어서, 시간 조정기는 시각 조정을 지각 품질 스코어에 선택적으로 적용 하여 코너 경우들을 미세 튜닝한다. 일 실시예에서, 시간 조정기는 동작 값을 시간 조정에 포 함된 임계 값과 비교한다. 모션 값이 임계 값을 초과하면, 시간 조정기는 높은 모션 장면에 대한 지 각 품질 모델의 고유한 비관론(inherent pessimism)을 반영하기 위해 시간 조정에 포함된 백분율만큼 지각 품질 스코어를 증가시킨다. 지각 품질 모델 및 시간 조정은 시청자에 의해 관찰된 품질을 추적하기 때문에, 지각 품질 스코어는 사람에 의해 시청될 때 인코딩된 데이터의 품질을 반영 한다. 여기에 기술된 기술들은 제한적인 것이라기보다는 예시적인 것이며, 본 발명의 더 넓은 사상 및 범위를 벗어나 지 않고 변경될 수 있음에 유의한다. 특히, 지각 품질 트레이너는 실험적으로 관찰된 시각 품질을 추적하 기 위해 다수의 객관적으로 계산된 값을 융합하는 모델을 생성하기 위해 임의의 수의 머신 학습 프로세스를 구 현하는 임의의 모듈로 대체될 수 있다. 이에 대응하여, 지각 품질 계산기는 일관된 방식으로 모델을 적용 하는 임의의 모듈로 대체될 수 있다. 또한, 지각 품질 트레이너는 생성된 모델을 미세 튜닝하도록 설계된 임의의 수의 조정 식별 모듈을 포함할 수 있고, 지각 품질 계산기는 식별된 조정을 적용하는 임의의 수의 조정 계산기를 포함할 수 있다. 트레이닝 데이터, 객관적 메트릭, 주관적 메트릭 및 모션 값의 세분성(granularity)(예를"}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "들어, 프레임별, 장면별, 샷별, 6분 클립별 등)은 구현 내에서 구현 간에 다를 수 있다. 본 기술분야의 통상의 기술자가 인식할 수 있는 바와 같이, 종래의 수학적 기술(예를 들어, 평균화, 외삽, 보간, 최대화 등)은 임의의 조합으로 객관적 메트릭, 주관적 메트릭 및/또는 모션 값에 적용되어 측정 단위 일관성을 보장 할 수 있다. 또한, 지각 품질 트레이너 및 지각 품질 계산기는 지각 품질 모델, 시간 조정 및/또는 지각 품질 스코어를 임의의 세분성으로 결정하도록 구성될 수 있다. 인간-인지 품질의 예측 도 4는 본 발명의 일 실시예에 따른, 지각 시각적 품질을 예측하기 위한 방법 단계들의 흐름도이다. 방법 단계 들이 도 1 내지 도 3의 시스템들과 관련하여 설명되었지만, 통상의 기술자라면, 임의의 순서로 방법 단계들을 수행하도록 구성된 임의의 시스템은 본 발명의 범위 내에 있다는 것을 이해할 것이다. 도시된 바와 같이, 방법은 지각 품질 트레이너가 트레이닝 데이터를 수신하는 단계 404에서 시 작한다. 트레이닝 데이터는 임의의 수 및 길이의 비디오 클립을 포함할 수 있다. 예를 들어, 일 실시예 에서 트레이닝 데이터는 16개의 6분 클립을 포함한다. 단계 406에서, 인코더는 임의의 수의 해상도 및 비트레이트의 조합에 대한 인코딩된 테스트 데이터를 트레이닝 데이터로부터 도출한다. 일반적으 로, 해상도 및 비트레이트는 디바이스 및/또는 스트리밍 대역폭에 대한 타겟 지원 범위를 반영하도록 선택된다. 단계 406에서, 지각 품질 트레이너는 인코딩된 트레이닝 데이터로부터 도출된 재구성된 비디오 클립 (즉, 디코딩된, 스케일된 등)에 대한 주관적 메트릭에 대한 값들을 수신한다. 지각 품질 트레이너는 임의의 형태로 주관적 메트릭에 대한 값을 획득할 수 있고, 임의의 수의 후처리 동작(예를 들어, 평균화, 원격 데이터 포인트(outlying data point)의 제거 등)을 수행할 수 있다. 대안적 실시예에서, 지각 품질 트레 이너는 임의의 수의 주관적 메트릭에 대응하는 데이터를 임의의 기술적으로 실현 가능한 방식으로 수 신하고 처리할 수 있다. 예를 들어, 일부 실시예에서, 지각 품질 트레이너는 트레이닝 데이터와 인코딩된 트레이닝 데이터 로부터 도출된 재구성된 비디오 클립(즉, 디코딩된, 스케일된 등)의 일련의 나란한, 사람 비교(side-by- side, human comparison)(예를 들어, 시청자에 의한) 중에 생성된 피드백을 수신한다. 재구성된 비디오 클립들 각각에 대해, 피드백은 대응하는 인코딩된 테스트 데이터에 대한 주관적 메트릭에 대한 값을 포함한다. 주관적 메트릭의 값은 절대적, 미리 결정된 품질 스케일(예를 들어, 0-100, 여기서 100은 눈에 띄는 아티팩트가 없는 것을 나타냄)에 기초하여 평균 관찰된 시각적 품질을 반영한다. 단계 410에서, 객관적 메트릭 생성 서브시스템은 인코딩된 테스트 데이터 및 트레이닝 데이터 모두에 기초하여 인코딩된 테스트 데이터에 대한 객관적 메트릭에 대한 값을 계산한다. 객관적 메트 릭 생성 서브시스템은 임의의 기술적으로 실현 가능한 방식으로 객관적 메트릭을 선택하고 그 후 객 관적 메트릭에 대한 값을 계산할 수 있다. 예를 들어, 일부 실시예에서, 객관적 메트릭 생성 서브시스템 은 상세 손실 측정(DLM), 시각 정보 충실도(VIF) 및 안티-잡음 신호-대-잡음 비(ANSNR)에 대한 값들을 계산하도록 구성된다. 단계 410의 일부로서, 객관적 메트릭 생성 서브시스템은 또한 인코딩된 테스트 데이터와 연관된 임의 의 다른 타입의 공간 또는 시간 데이터를 계산할 수 있다. 특히, 객관적 메트릭 생성 서브시스템은 인코 딩된 테스트 데이터에 포함된 각각의 프레임에 대한 모션 값 - 시간적 시각 차이 - 를 계산한다. 단계 412에서, 지원 벡터 머신(SVM) 모델 생성기는 머신 학습 동작을 수행한다 - 객관적 메트릭에 대 한 값 및 모션 값의 융합에 기초하여 주관적 메트릭에 대한 값을 추적하기 위해 지각 품질 모델(15 5)을 트레이닝시킨다. 단계 414에서, 지각 품질 트레이너는 높은 모션의 기간 동안 지각 품질 모델 이 주관적 메트릭에 대한 값을 정확하게 추적하는지를 결정하고, 단계 414에서, 지각 품질 트레이너 가 지각 품질 모델의 정확도가 수용 가능하다고 결정하면, 이 방법은 단계 418로 직접 진행한다. 단계 414에서, 지각 품질 트레이너가 지각 품질 모델의 정확도가 수용 가능하지 않다고 결정하면, 이 방법은 단계 416으로 진행한다. 단계 416에서, 시간 조정 식별자는 지각 품질 모델에 기초하여 계산 된 지각 품질 스코어가 수용할 수 없을 만큼 비관적인 임계 값을 결정한다. 시간 조정 식별자는 또 한 지각 품질 모델에 기초하여 계산된 지각 품질 스코어에 적용될 때, 지각 품질 스코어의 정확 도를 향상시키는 백분율 증가를 결정한다. 함께, 임계 값과 백분율 증가는 시간 조정을 형성한다. 단계 418에서, 지각 품질 계산기는 지각 품질 모델, 및 존재하는 경우 시간 조정에 기초하여 인 코딩된 데이터에 대한 지각 품질 스코어를 계산한다. 일반적으로, 지각 품질 계산기는 임의의 기술적으로 실현 가능한 방식으로, 지각 품질 모델을 객관적 메트릭에 대한 값 및 인코딩된 데이터 에 대한 모션 값에 적용함으로써 지각 품질 스코어를 계산한다. 예를 들어, 일부 실시예에서, 지각 품질 계산기는 도 5와 함께 이하에 설명된 방법 단계들을 수행한다 - 지각 품질 스코어(즉, 주관적 메트릭의 값)를 획득하기 위해 트레이닝된 지각 품질 모델을 활용 한다. 특히, 트레이닝 단계 동안, 지각 품질 모델은 트레이닝 데이터에 대한 인간 피드백을 직접 통 합한다. 이어서, 스코어링 단계 동안 트레이닝된 지각 품질 모델은 임의의 수 및 타입의 소스 데이터 에 대한 이러한 인간 피드백의 일반화를 가능하게 한다. 도 5는 본 발명의 일 실시예에 따른, 경험적으로 트레이닝된 모델에 기초하여 지각 시각적 품질 스코어에 대한 값을 계산하기 위한 방법 단계들의 흐름도이다. 방법 단계들이 도 1 내지 도 3의 시스템들과 관련하여 설명되 었지만, 통상의 기술자라면, 임의의 순서로 방법 단계들을 수행하도록 구성된 임의의 시스템은 본 발명의 범위 내에 있다는 것을 이해할 것이다. 도시된 바와 같이, 방법은 단계 516에서 시작하며, 여기서 지각 품질 계산기는 지각 품질 모델 및 시간 조정을 수신한다. 대안적 실시예에서, 시간 조정은 생략될 수 있다. 다른 실시예에서, 시 간 조정은 지각 품질 스코어를 미세 튜닝하도록 설계된 임의의 수의 다른 조정으로 대체된다. 지각 품질 모델은 임의의 기술적으로 실행 가능한 방식으로 생성될 수 있다. 예를 들어, 일부 실시예에서, 지각 품질 트레이너는 도 4에 개략적으로 도시된 방법 단계들(406-416)을 수행한다. 단계 518에서, 지각 품질 계산기는 소스 데이터를 수신한다. 단계 520에서, 인코더는 타겟 해 상도 및/또는 비트레이트에 대한 인코딩된 데이터를 소스 데이터로부터 도출한다. 단계 522에서, 객 관적 메트릭 생성 서브시스템은 인코딩된 데이터, 및 선택적으로 소스 데이터에 기초하여 인코 딩된 데이터에 대한 객관적 메트릭에 대한 값을 계산한다. 객관적 메트릭 생성 서브시스템은 또한, 인코딩된 데이터의 각각의 프레임에 대한 모션 값을 계산한다. 일반적으로, 지각 품질 계산기 는 지각 품질 모델 내의 독립 변수들에 대한 값을 계산하도록 구성된다. 단계 524에서, 지원 벡터 머신(SVM) 매퍼는 지각 품질 스코어를 생성하기 위해 지각 품질 모델 을 객관적 메트릭에 대한 값 및 인코딩된 데이터에 대한 모션 값에 적용한다. 단계 526에서, 시간 조정기는 하나 이상의 프레임의 모션 값이 시간 조정에서 특정된 임계 값을 초과하는지를 결정한다. 단계 526에서, 시간 조정기가 모션 값 중 어느 것도 임계 값을 초과하지 않는다고 결정하 면, 지각 품질 계산기는 지각 품질 스코어를 고려하여 예상 시청 경험을 정확하게 예측하고 방법 을 종료한다. 단계 526에서, 시간 조정기가 모션 값 중 임의의 것이 임계 값을 초과한다고 결정하면, 시간 조정기 는 프레임들을 고려하여 높은 모션의 기간을 반영하고, 방법은 단계 526으로 진행한다. 단계 526에 서, 시간 조정기는 높은 모션의 기간 동안 지각 품질 모델의 비관론을 보상하기 위해 (시간 조정 에서 특정된) 임계 백분율만큼 지각 품질 스코어를 증가시키고, 방법은 종료한다."}
{"patent_id": "10-2017-7035231", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "요약하면, 개시된 기술들은 지각 비디오 품질을 효율적이고 신뢰성 있게 예측하는데 사용될 수 있다. 지각 품 질 트레이너는 지각 품질 모델을 생성하기 위해 지원 벡터 머신(SVM)을 구현한다. 특히, 비디오들의 트레이닝 세트의 경우, SVM은 객관적 메트릭 및 시간 모션에 대한 값을 지각 품질 스코어 - 사람 비디오 시청 피드백에 기초하는 주관적 시각 품질 스코어 - 로 융합하도록 구성된다. 이어서, 지각 품질 계산기는 지각 품질 메트릭 (즉, 시각적 품질 스코어)에 대한 대응하는 값을 생성하기 위해 지각 품질 모델을 타겟 비디오에 대한 시간 모 션 및 객관적 메트릭에 대한 값에 적용한다. 바람직하게, 인간 시각 시스템에 의해 이루어진 직접 관찰을 사용하여 지각 품질 모델을 트레이닝시키는 것은, 지각 품질 계산기가 인지된 비디오 품질을 절대적 방식으로 신뢰성 있게 예측하는 품질 스코어를 효율적으로 계 산할 수 있게 한다. 대조적으로, 종래의 품질 메트릭은 전형적으로 신호 충실도 - 실제 세계 시청 감상의 콘텐 츠-의존적인, 일관되지 않고, 신뢰할 수 없는 표시 - 를 측정한다. 또한, 초기 경험적 기반 트레이닝 단계를 후속 비디오별 결정론적 계산 단계와 분리함으로써, 개시된 기술은 신속하고 확장 가능하다. 결과적으로, 지각 품질 모델은 인코더를 개발하고 정확하게 평가하는 데 필요한 시간을 줄이고 실시간 품질 인식 스트림 스위칭과 같은 시간-민감 인코딩 애플리케이션을 가능하게 한다. 다양한 실시예들에 대한 설명은 예시의 목적으로 제시되었지만, 포괄적이거나 개시된 실시예들로 한정되는 것을 의도하지 않는다. 상기 설명된 실시 형태들의 사상 및 범위로부터 벗어나지 않고 많은 수정 및 변형이 본 기술 분야의 통상의 기술자들에게 명백할 것이다. 본 실시예들의 양태들은 시스템, 방법 또는 컴퓨터 프로그램 제품으로서 구현될 수 있다. 따라서, 본 개시내용 의 양태들은 완전한 하드웨어 실시예, 완전한 소프트웨어 실시예(펌웨어, 상주 소프트웨어, 마이크로 코드 등을 포함함) 또는 “회로”, “모듈” 또는 “시스템”으로 여기에서 모두 일반적으로 칭해질 수 있는 소프트웨어 및 하드웨어 양태들을 결합하는 실시예의 형태를 취할 수 있다. 또한, 본 개시내용의 양태들은 컴퓨터 판독 가 능 프로그램 코드가 구현된 하나 이상의 컴퓨터 판독 가능 매체(들)에 구현된 컴퓨터 프로그램 제품의 형태를 취할 수 있다. 하나 이상의 컴퓨터 판독가능 매체(들)의 임의의 조합이 활용될 수 있다. 컴퓨터 판독가능 매체는 컴퓨터 판독 가능 신호 매체 또는 컴퓨터 판독가능 저장 매체일 수 있다. 컴퓨터 판독가능 저장 매체는, 예를 들어 전자적, 자기적, 광학적, 전자기적, 적외선, 또는 반도체 시스템, 장치 또는 디바이스, 또는 전술한 것들의 임의의 적합 한 조합을 포함할 수 있지만, 이것들에만 한정되는 것은 아니다. 컴퓨터 판독 가능 저장 매체의 보다 구체적인 예들(비포괄적 리스트)은, 하나 이상의 와이어를 갖는 전기 접속, 휴대용 컴퓨터 디스켓, 하드 디스크, 랜덤 액 세스 메모리(RAM), 판독 전용 메모리(ROM), 소거 가능 프로그래머블 판독 전용 메모리(EPROM 또는 플래시 메모 리), 광섬유, 휴대용 콤팩트 디스크 판독 전용 메모리(CD-ROM), 광학 저장 디바이스, 자기 저장 디바이스, 또는 이들의 임의의 적절한 조합을 포함할 것이다. 이 문서의 맥락에서, 컴퓨터 판독 가능 저장 매체는 명령어 실행시스템, 장치 또는 디바이스에 의해, 또는 이와 함께 사용할 프로그램을 포함하거나 저장할 수 있는 임의의 유 형(tangible)의 매체일 수 있다. 본 개시내용의 양태들은 본 개시내용의 실시예에 따른 방법, 장치(시스템) 및 컴퓨터 프로그램 제품의 흐름도 및/또는 블록도를 참조하여 위에서 설명되었다. 흐름도 및/또는 블록도의 각각의 블록, 및 흐름도 및/또는 블 록도 내의 블록들의 조합들은 컴퓨터 프로그램 명령어에 의해 구현될 수 있다는 것이 이해될 것이다. 이들 컴 퓨터 프로그램 명령어는 범용 컴퓨터, 특수 목적 컴퓨터 또는 다른 프로그래밍 가능 데이터 처리 장치의 프로세 서에 제공되어 머신을 생성할 수 있으며, 따라서 컴퓨터 또는 다른 프로그래밍 가능 데이터 처리 장치의 프로세 서를 통해 실행되는 명령어들은 흐름도 및/또는 블록도 블록 또는 블록들에서 지정된 기능들/동작들의 구현을 가능하게 한다. 그러한 프로세서들은 범용 프로세서, 특수 목적 프로세서, 주문형 프로세서 또는 필드 프로그 래머블 프로세서일 수 있지만 이에 한정되지 않는다. 도면들 내의 흐름도 및 블록도들은 본 개시내용의 다양한 실시예에 따른 시스템, 방법 및 컴퓨터 프로그램 제품 의 가능한 구현의 아키텍처, 기능, 및 동작을 예시한다. 이와 관련하여, 흐름도 또는 블록도 내의 각각의 블록 은 모듈, 세그먼트, 또는 코드 부분을 나타낼 수 있고, 이들은 지정된 논리적 기능(들)을 구현하기 위한 하나 이상의 실행 가능한 명령어를 포함한다. 또한 일부 대안적인 실시예들에서, 블록에 언급된 기능들은 도면들에 언급된 순서에서 벗어나서 발생할 수 있음에 유의해야 한다. 예를 들어 연속한 2개의 블록은 실제로는 거의 동 시에 실행될 수 있고, 블록들은 때로는 관련 기능에 따라서는 역순으로 실행될 수 있다. 블록도 및/또는 흐름 도의 각각의 블록, 및 블록도 및/또는 흐름도 내의 블록들의 조합은 지정된 기능들 또는 동작들을 수행하는 특 수 목적 하드웨어 기반 시스템들, 또는 특수 목적 하드웨어와 컴퓨터 명령어들의 조합들에 의해 구현될 수 있다 는 점에도 유의할 것이다. 전술한 내용은 본 개시내용의 실시예들에 관한 것이지만, 본 개시내용의 다른 실시예들 및 추가 실시예들은 본 발명의 기본 범위를 벗어나지 않고 고안될 수 있으며, 그 범위는 다음의 청구범위에 의해 결정된다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2017-7035231", "section": "도면", "subsection": "도면설명", "item": 1, "content": "위에서 언급된 본 발명의 특징들이 상세하게 이해될 수 있는 방식으로, 위에 간략하게 요약된 본 발명의 보다 구체적인 설명은 실시예들을 참조할 수 있으며, 그들 중 일부는 첨부 도면들에 도시되어 있다. 그러나 본 발명 은 동등한 효과의 다른 실시예들을 허용할 수 있으므로, 첨부 도면들은 본 발명의 전형적인 실시예들만을 도시 하며, 따라서 그것의 범위를 제한하는 것으로 간주되어서는 안된다는 점에 유의하여야 한다. 도 1은 본 발명의 하나 이상의 양태를 구현하도록 구성된 시스템의 개념도이다. 도 2는 본 발명의 일 실시예에 따른, 도 1의 객관적 메트릭 생성 서브시스템 및 지각 품질 트레이너를 도시하는 블록도이다. 도 3은 본 발명의 일 실시예에 따른, 도 1의 객관적 메트릭 생성 서브시스템 및 지각 품질 계산기를 도시하는 블록도이다. 도 4는 본 발명의 일 실시예에 따른, 지각 시각적 품질을 예측하기 위한 방법 단계들의 흐름도이다. 도 5는 본 발명의 일 실시예에 따른, 경험적으로 트레이닝된 모델에 기초하여 지각 시각적 품질 스코어에 대한 값들을 계산하기 위한 방법 단계들의 흐름도이다."}
