{"patent_id": "10-2018-0143229", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0064190", "출원번호": "10-2018-0143229", "발명의 명칭": "공유형 자율주행자동차 관리 서버 및 방법", "출원인": "한국과학기술원", "발명자": "여화수"}}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 사용자 각각의 출발지와 목적지에 대한 정보를 수신하는 정보 수신부와, 상기 출발지에 대한 정보와 제1 인공지능 알고리즘에 기초하여, 상기 출발지의 밀집도가 소정 밀집도 이상인 영역(region)을 POI(point of interest)로 결정하는 POI 결정부와, 상기 결정된 POI와 상기 출발지의 밀집도에 기초하여 자율주행자동차의 배치를 결정하고, 상기 자율주행자동차가 상기 결정된 배치에 따라 배치되도록 하기 위해 상기 자율주행자동차에게 상기 배치에 대한 정보를 송신하는배치 관리부와, 상기 복수의 사용자 각각의 출발지와 목적지에 대한 정보와 제2 인공지능 알고리즘에 기초하여, 상기 복수의 사용자 각각에 대한 이동 경로를 예측하고, 상기 자율주행자동차가 상기 예측된 이동 경로 중 적어도 하나의 이동경로에 따라 이동되도록 하기 위해 상기 자율주행자동차에게 상기 이동 경로에 대한 정보를 송신하는 이동 경로관리부를 포함하는 공유형 자율주행자동차 관리 서버."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 인공지능 알고리즘은 k-NN(K-nearest neighbor)을 포함하고, 상기 제2 인공지능 알고리즘은 순환신경망(recurrent neural network)을 포함하는 공유형 자율주행자동차 관리 서버."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 k-NN은 멀티-레벨(multi-level) k-NN 또는 싱글-포인트 디맨드(single-point demand) k-NN을 포함하는 공유형 자율주행자동차 관리 서버."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제1 인공지능 알고리즘은, 상기 자율주행자동차의 이동 가능 범위를 구분한 소정의 영역 간격에 대한 1차 특성 벡터와 상기 자율주행자동차의 이동 가능 범위 전체에 대한 2차 특성 벡터를 이용하여 연산을 수행하거나, 또는 상기 출발지에 대한 특성 벡터 및 상기 목적지에 대한 특성 벡터를 사용하여 연산을 수행하는공유형 자율주행자동차 관리 서버."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2020-0064190-3-제1항에 있어서,상기 POI 결정부는, 이전에 이용된 이동 경로, 이전에 이용된 출발지, 이전에 이용된 목적지, 및 이전에 이용된 합승 위치에 대한데이터를 포함할 수 있고, 상기 데이터, 상기 수신된 정보, 및 상기 제1 인공지능 알고리즘에 기초하여 시간대별로 출발지의 밀집도가 상기 소정 밀집도 이상일 것으로 예상되는 영역을 상기 POI로 결정하는 공유형 자율주행자동차 관리 서버."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 배치 관리부는,상기 출발지의 밀집도에 기초하여 상기 배치되는 자율주행자동차의 수를 결정하고, 상기 결정된 POI의 위치에 기초하여, 상기 결정된 POI로부터 소정 거리 범위 내에 위치되는 자율주행자동차를상기 배치되는 자율주행자동차로 결정하는공유형 자율주행자동차 관리 서버."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 이동 경로 관리부는, 상기 복수의 사용자 중 제1 사용자의 제1 출발지와 제1 목적지에 기초하여, 상기 제1 출발지와 상기 제1 목적지사이에 위치되는 제2 사용자의 제2 출발지를 식별하고, 상기 제2 인공지능 알고리즘에 기초하여, 상기 제1 출발지로부터 상기 제1 목적지까지의 이동하는데 소요되는최소 시간과 상기 제2 출발지를 거치는 경우 상기 최소 시간에 가산되는 추가 시간을 추정하고, 상기 추정된 추가 시간이 소정 시간 이하인 경우, 상기 자율주행자동차에게 송신하는 상기 이동 경로를 상기 제1 출발지로부터 상기 제2 출발지를 거쳐 상기 제1 목적지까지의 이동하는 경로로 결정하는 공유형 자율주행자동차 관리 서버."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "복수의 사용자 각각의 출발지와 목적지에 대한 정보를 수신하는 단계와, 상기 출발지에 대한 정보와 제1 인공지능 알고리즘에 기초하여, 상기 출발지의 밀집도가 소정 밀집도 이상인 영역(region)을 POI(point of interest)로 결정하는 단계와, 상기 결정된 POI와 상기 출발지의 밀집도에 기초하여 자율주행자동차의 배치를 결정하는 단계와, 상기 자율주행자동차가 상기 결정된 배치에 따라 배치되도록 하기 위해 상기 자율주행자동차에게 상기 배치에대한 정보를 송신하는 단계와, 상기 복수의 사용자 각각의 출발지와 목적지에 대한 정보와 제2 인공지능 알고리즘에 기초하여, 상기 복수의 사용자 각각에 대한 이동 경로를 예측하는 단계와, 상기 자율주행자동차가 상기 예측된 이동 경로 중 적어도 하나의 이동 경로에 따라 이동되도록 하기 위해 상기자율주행자동차에게 상기 이동 경로에 대한 정보를 송신하는 단계를 포함하는 공개특허 10-2020-0064190-4-공유형 자율주행자동차 관리 방법."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 제1 인공지능 알고리즘은 k-NN(K-nearest neighbor)을 포함하고, 상기 제2 인공지능 알고리즘은 순환신경망(recurrent neural network)을 포함하는 공유형 자율주행자동차 관리 방법."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 k-NN은 멀티-레벨(multi-level) k-NN 또는 싱글-포인트 디맨드(single-point demand) k-NN을 포함하는 공유형 자율주행자동차 관리 방법."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 제1 인공지능 알고리즘은, 상기 자율주행자동차의 이동 가능 범위를 구분한 소정의 영역 간격에 대한 1차 특성 벡터와 상기 자율주행자동차의 이동 가능 범위 전체에 대한 2차 특성 벡터를 이용하여 연산이 수행되도록 하거나, 또는 상기 출발지에 대한 특성 벡터 및 상기 목적지에 대한 특성 벡터를 사용하여 연산이 수행되도록 하는공유형 자율주행자동차 관리 방법."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 POI로 결정하는 단계는, 이전에 이용된 이동 경로, 이전에 이용된 출발지, 이전에 이용된 목적지, 및 이전에 이용된 합승 위치에 대한데이터에 기초하여, 상기 데이터, 상기 수신된 정보, 및 상기 제1 인공지능 알고리즘에 기초하여 시간대별로 출발지의 밀집도가 상기 소정 밀집도 이상일 것으로 예상되는 영역을 상기 POI로 결정하는 단계를 포함하는, 공유형 자율주행자동차 관리 방법."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,상기 배치를 결정하는 단계는,상기 출발지의 밀집도에 기초하여 상기 배치되는 자율주행자동차의 수를 결정하는 단계와, 상기 결정된 POI의 위치에 기초하여, 상기 결정된 POI로부터 소정 거리 범위 내에 위치되는 자율주행자동차를상기 배치되는 자율주행자동차로 결정하는 단계를 포함하는공개특허 10-2020-0064190-5-공유형 자율주행자동차 관리 방법."}
{"patent_id": "10-2018-0143229", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서,상기 이동 경로를 예측하는 단계는, 상기 복수의 사용자 중 제1 사용자의 제1 출발지와 제1 목적지에 기초하여, 상기 제1 출발지와 상기 제1 목적지사이에 위치되는 제2 사용자의 제2 출발지를 식별하는 단계와, 상기 제2 인공지능 알고리즘에 기초하여, 상기 제1 출발지로부터 상기 제1 목적지까지의 이동하는데 소요되는최소 시간과 상기 제2 출발지를 거치는 경우 상기 최소 시간에 가산되는 추가 시간을 추정하는 단계와, 상기 추정된 추가 시간이 소정 시간 이하인 경우, 상기 자율주행자동차에게 송신하는 상기 이동 경로를 상기 제1 출발지로부터 상기 제2 출발지를 거쳐 상기 제1 목적지까지의 이동하는 경로로 결정하는 단계를 포함하는공유형 자율주행자동차 관리 방법."}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버는, 복수의 사용자 각각의 출발지와 목적지에 대한 정보를 수신하는 정보 수신부와, 상기 출발지에 대한 정보와 제1 인공지능 알고리즘에 기초하여, 상기 출발지의 밀집도가 소정 밀집도 이상인 영역(region)을 POI(point of interest)로 결정하는 POI 결정부와, 상기 결정된 (뒷면에 계속)"}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 복수의 사람들과 공유하는 공유형 자율주행자동차를 관리하는 관리 서버 및 공유형 자율주행자동차의 관리 방법에 관한 것이다."}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 하나의 제품을 함께 공유해 사용하는 공유 경제 패러다임의 등장으로 인해, 다양한 서비스 플랫폼이 제안 되고 있다. 그 예로, 차세대 교통수단으로 각광받고 있는 카셰어링(car-sharing) 및 라이드 셰어링(ride- sharing) 등의 공유형 교통서비스 플랫폼이 있을 수 있다. 기존의 공유형 교통서비스 플랫폼은 사용자들이 교통서비스의 사용을 위해 특정 지점, 예를 들면 대여 장소 또 는 합승 장소로 이동하여야 해당 장소에서 제공되는 교통서비스를 이용할 수 있었다. 즉, 기존의 공유형 교통서 비스 플랫폼은 수요에 따라 반응하는 수요 반응형 기술에 머무르고 있는 실정이다. 이러한 수요 반응형 기술의 경우, 사용자의 입력과 같은 수요가 발생하기 전에 예측을 하기에는 어려워, 실질적 으로 수요가 발생하였을 때에 공급이 수요를 만족시키지 못하는 수요와 공급의 불일치가 발생할 수 있다. 이러 한 경우, 서비스의 제공이 이루어지지 못하거나 상당한 시간의 지연이 발생하게 될 수 있다. 이에 따라, 사용자 의 수요를 예측하여 최적의 서비스를 제공하기 위한 스마트한 교통서비스 플랫폼이 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2016-0076777호 (2016년 07월 01일 공개)"}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 사용자의 수요를 예측하여 공유형 자율주행자동차를 배치하고 주행 경로를 설정함으로써, 효율적인 공유형 교통서비스가 제공되도록 하는 공유형 자율주행자동차 관리 서버 및 방법을 제 공하는 것이다. 다만, 본 발명이 해결하고자 하는 과제는 이상에서 언급한 바로 제한되지 않으며, 언급되지는 않았으나 아래의"}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있는 목적을 포함할수 있다."}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버는, 복수의 사용자 각각의 출발지와 목적지에 대 한 정보를 수신하는 정보 수신부와, 상기 출발지에 대한 정보와 제1 인공지능 알고리즘에 기초하여, 상기 출발 지의 밀집도가 소정 밀집도 이상인 영역(region)을 POI(point of interest)로 결정하는 POI 결정부와, 상기 결 정된 POI와 상기 출발지의 밀집도에 기초하여 자율주행자동차의 배치를 결정하고, 상기 자율주행자동차가 상기 결정된 배치에 따라 배치되도록 하기 위해 상기 자율주행자동차에게 상기 배치에 대한 정보를 송신하는 배치 관 리부와, 상기 복수의 사용자 각각의 출발지와 목적지에 대한 정보와 제2 인공지능 알고리즘에 기초하여, 상기 복수의 사용자 각각에 대한 이동 경로를 예측하고, 상기 자율주행자동차가 상기 예측된 이동 경로 중 적어도 하 나의 이동 경로에 따라 이동되도록 하기 위해 상기 자율주행자동차에게 상기 이동 경로에 대한 정보를 송신하는 이동 경로 관리부를 포함한다. 또한, 상기 제1 인공지능 알고리즘은 k-NN(K-nearest neighbor)을 포함하고, 상기 제2 인공지능 알고리즘은 순 환신경망(recurrent neural network)을 포함한다. 또한, 상기 k-NN은 멀티-레벨(multi-level) k-NN 또는 싱글-포인트 디맨드(single-point demand) k-NN을 포함 한다. 또한, 상기 제1 인공지능 알고리즘은, 상기 자율주행자동차의 이동 가능 범위를 구분한 소정의 영역 간격에 대 한 1차 특성 벡터와 상기 자율주행자동차의 이동 가능 범위 전체에 대한 2차 특성 벡터를 이용하여 연산을 수행 하거나, 또는 상기 출발지에 대한 특성 벡터를 사용하여 연산을 수행한다. 또한, 상기 POI 결정부는, 이전에 이용된 이동 경로, 이전에 이용된 출발지, 이전에 이용된 목적지, 및 이전에 이용된 합승 위치에 대한 데이터를 포함할 수 있고, 상기 데이터, 상기 수신된 정보, 및 상기 제1 인공지능 알 고리즘에 기초하여 시간대별로 출발지의 밀집도가 상기 소정 밀집도 이상일 것으로 예상되는 영역을 상기 POI로 결정한다. 또한, 상기 배치 관리부는, 상기 출발지의 밀집도에 기초하여 상기 배치되는 자율주행자동차의 수를 결정하고, 상기 결정된 POI의 위치에 기초하여, 상기 결정된 POI로부터 소정 거리 범위 내에 위치되는 자율주행자동차를 상기 배치되는 자율주행자동차로 결정한다. 또한, 상기 이동 경로 관리부는, 상기 복수의 사용자 중 제1 사용자의 제1 출발지와 제1 목적지에 기초하여, 상 기 제1 출발지와 상기 제1 목적지 사이에 위치되는 제2 사용자의 제2 출발지를 식별하고, 상기 제2 인공지능 알 고리즘에 기초하여, 상기 제1 출발지로부터 상기 제1 목적지까지의 이동하는데 소요되는 최소 시간과 상기 제2 출발지를 거치는 경우 상기 최소 시간에 가산되는 추가 시간을 추정하고, 상기 추정된 추가 시간이 소정 시간 이하인 경우, 상기 자율주행자동차에게 송신하는 상기 이동 경로를 상기 제1 출발지로부터 상기 제2 출발지를 거쳐 상기 제1 목적지까지의 이동하는 경로로 결정한다. 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 방법은, 복수의 사용자 각각의 출발지와 목적지에 대 한 정보를 수신하는 단계와, 상기 출발지에 대한 정보와 제1 인공지능 알고리즘에 기초하여, 상기 출발지의 밀 집도가 소정 밀집도 이상인 영역(region)을 POI(point of interest)로 결정하는 단계와, 상기 결정된 POI와 상 기 출발지의 밀집도에 기초하여 자율주행자동차의 배치를 결정하는 단계와, 상기 자율주행자동차가 상기 결정된 배치에 따라 배치되도록 하기 위해 상기 자율주행자동차에게 상기 배치에 대한 정보를 송신하는 단계와, 상기 복수의 사용자 각각의 출발지와 목적지에 대한 정보와 제2 인공지능 알고리즘에 기초하여, 상기 복수의 사용자 각각에 대한 이동 경로를 예측하는 단계와, 상기 자율주행자동차가 상기 예측된 이동 경로 중 적어도 하나의 이 동 경로에 따라 이동되도록 하기 위해 상기 자율주행자동차에게 상기 이동 경로에 대한 정보를 송신하는 단계를 포함한다. 또한, 상기 제1 인공지능 알고리즘은 k-NN(k-nearest neighbor)을 포함하고, 상기 제2 인공지능 알고리즘은 순 환신경망(recurrent neural network)을 포함한다. 또한, 상기 k-NN은 멀티-레벨(multi-level) k-NN 또는 싱글-포인트 디맨드(single-point demand) k-NN을 포함 한다. 또한, 상기 제1 인공지능 알고리즘은, 상기 자율주행자동차의 이동 가능 범위를 구분한 소정의 영역 간격에 대 한 1차 특성 벡터와 상기 자율주행자동차의 이동 가능 범위 전체에 대한 2차 특성 벡터를 이용하여 연산이 수행 되도록 하거나, 또는 상기 출발지에 대한 특성 벡터를 사용하여 연산이 수행되도록 한다. 또한, 상기 POI로 결정하는 단계는, 이전에 이용된 이동 경로, 이전에 이용된 출발지, 이전에 이용된 목적지, 및 이전에 이용된 합승 위치에 대한 데이터에 기초하여, 상기 데이터, 상기 수신된 정보, 및 상기 제1 인공지능 알고리즘에 기초하여 시간대별로 출발지의 밀집도가 상기 소정 밀집도 이상일 것으로 예상되는 영역을 상기 POI 로 결정하는 단계를 포함한다. 또한, 상기 배치를 결정하는 단계는, 상기 출발지의 밀집도에 기초하여 상기 배치되는 자율주행자동차의 수를 결정하는 단계와, 상기 결정된 POI의 위치에 기초하여, 상기 결정된 POI로부터 소정 거리 범위 내에 위치되는 자율주행자동차를 상기 배치되는 자율주행자동차로 결정하는 단계를 포함한다. 또한, 상기 이동 경로를 예측하는 단계는, 상기 복수의 사용자 중 제1 사용자의 제1 출발지와 제1 목적지에 기 초하여, 상기 제1 출발지와 상기 제1 목적지 사이에 위치되는 제2 사용자의 제2 출발지를 식별하는 단계와, 상 기 제2 인공지능 알고리즘에 기초하여, 상기 제1 출발지로부터 상기 제1 목적지까지의 이동하는데 소요되는 최 소 시간과 상기 제2 출발지를 거치는 경우 상기 최소 시간에 가산되는 추가 시간을 추정하는 단계와, 상기 추정 된 추가 시간이 소정 시간 이하인 경우, 상기 자율주행자동차에게 송신하는 상기 이동 경로를 상기 제1 출발지 로부터 상기 제2 출발지를 거쳐 상기 제1 목적지까지의 이동하는 경로로 결정하는 단계를 포함한다."}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 공유형 자율주행자동차 관리 서버 및 방법은, 사용자의 수요를 예측하여, 수요가 예측 된 지역에 대해 공유형 자율주행자동차의 배치를 증가시킴으로써 효율성 및 편의성이 향상된 공유형 교통서비스 를 제공할 수 있다. 다만, 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효 과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있 을 것이다."}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 다양 한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명의 범주는 청구항에 의해 정의될 뿐이다. 본 발명의 실시예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명은 본 발명의 실시예들을 설 명함에 있어 실제로 필요한 경우 외에는 생략될 것이다. 그리고 후술되는 용어들은 본 발명의 실시예에서의 기 능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다.본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예들을 포함할 수 있는바, 특정 실시예들을 도면에 예시 하고 상세한 설명에 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로서 이해되 어야 한다. 제 1, 제 2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 해당 구성요 소들은 이와 같은 용어들에 의해 한정되지는 않는다. 이 용어들은 하나의 구성요소들을 다른 구성요소로부터 구 별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 '연결되어' 있다거나 '접속되어' 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 도 1은 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버 및 방법에 의해 제공되는 교통서비스의 개념도를 나타내는 도면이다. 보다 구체적으로, 제1 환경은 종래에 제공되는 교통서비스의 개념도를 나타내 며, 제2 환경은 본 발명의 일 실시예에 따른 관리 서버에 의해 제공되는 교통서비스의 개념도를 나타낸다. 도 1을 참조하면, 제1 환경에서 사용자는 목적지(destination)로 이동하기 위해, 출발지(origin)에서 교통 서비스의 제공을 요청하게 된다. 제1 환경에서 교통서비스의 제공을 위한 차량은 임의로 배치되어 있을 수 있다. 임의로 배치된 차량이 사용자의 요청과 관련된 정보(또는 입력)를 수신하면, 차량은 사용자에게 이동하게 된다. 즉, 교통서비스의 제공을 위한 차량은 사용자의 요청이 있어야만 사용자가 위치된 지점, 즉 사용자의 출 발지로 이동할 수 있다. 한편, 경우에 따라 특정 시점에 사용자의 수요가 일정 값 이상 발생하게 될 수 있다. 즉, 어느 한 시점에 특정 지역에서 교통서비스의 이용을 위한 사용자가 크게 증가하는 상황이 발생할 수 있는데, 이러한 경우 제1 환경 에서 임의로 배치된 차량은 여러 지역에 산재되어 있기 때문에, 사용자의 수요만큼의 차량이 모두 해당 지 역까지 이동하는 데 다소 시간이 소요될 수 있다. 이에 따라, 일부 사용자에게 교통서비스가 제공되기까지 긴 지연시간이 발생할 수 있다. 이하에서는, 특정 시점에 사용자의 수요가 일정 값 이상 발생한 지역을 주요 관심 지역(point of interest, 이하 'POI')이라 지칭하겠다. 제2 환경에서는, 사용자의 수요를 예측하여 특정 시점의 POI를 예측할 수 있다. POI 예측에 기초하여, 제2 환경에서는 특정 시점에 교통서비스의 제공을 위한 차량이 POI 또는 그 근방에 미리 배치되어 있을 수 있다. 이러한 경우, 교통서비스가 사용자에게 신속하게 제공될 수 있다. 이하에서는, 제2 환경의 구현을 위한 공유형 자율주행자동차 관리 서버 및 방법에 대한 구체적인 설명을 하 겠다. 도 2는 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버와 관련된 정보의 송수신의 개념도를 나타 내는 도면이다. 도 2를 참조하면, 공유형 자율주행자동차 관리 서버(이하, '관리 서버')는 사용자 단말 및 자율주행 자동차와 연결될 수 있다. 관리 서버는 사용자 단말 및 자율주행자동차와의 연결에 기반하 여, 교통서비스와 관련된 정보를 송수신할 수 있다. 한편, 도 2에서 관리 서버와 연결되는 사용자 단말 및 자율주행자동차는 각각 1개로 도시하였으 나, 이에 제한되지 않고, 복수의 사용자 단말과 복수의 자율주행자동차를 포함할 수 있다. 즉, 관리 서버 는 서로 다른 복수의 사용자 각각의 사용자 단말과 복수의 자율주행자동차와 연결되어 교통서비스와 관련된 정 보를 송수신할 수 있다. 관리 서버는 복수의 사용자 단말로부터 출발지와 목적지에 대한 정보를 수신할 수 있다. 출발지와 목 적지에 대한 정보는 복수의 사용자 단말 각각에 대한 사용자의 입력을 통해 결정될 수 있다. 출발지와 목 적지에 대한 정보는 사용자 단말마다 다를 수 있고, 관리 서버는 사용자 단말 각각으로부터 입 력되는 출발지와 목적지에 대한 정보를 사용자 단말로부터 수신할 수 있다. 관리 서버는 사용자 단말로부터 수신한 출발지에 대한 정보(또는 출발지와 목적지에 대한 정보)와 제 1 인공지능 알고리즘에 기초하여, 출발지의 밀집도가 소정 밀집도 이상인 영역(region)을 POI로 결정할 수 있다. 소정 밀집도는 미리 결정된 값일 수 있으며, 예를 들어 100m2 내에 출발지가 6개, 즉 6개/100m2일 수있다. 관리 서버는 결정된 POI에 자율주행자동차를 배치하기 위해, 자율주행자동차에게 POI에 대한 정 보를 송신할 수 있다. 자율주행자동차는 수신된 POI에 대한 정보에 기초하여, POI로 이동할 수 있다. 경우 에 따라, 관리 서버는 자율주행자동차를 원격으로 제어하여 POI에 이동하도록 할 수 있다. 관리 서버는 밀집도, POI의 위치, 자율주행자동차의 현재 배치 상태에 기초하여, 자율주행자동차 의 배치를 결정할 수 있다. 예를 들어, 관리 서버는 사용자의 수요에 대응하는 수만큼의 자율주행자 동차가 POI에 배치되도록 할 수 있다. 다른 예를 들면, 관리 서버는 POI로부터 근접한 위치에 배치되 어 있는 자율주행자동차가 POI에 배치되도록 할 수 있다. 또 다른 예를 들면, 관리 서버는 사용자의 수요에 대응하는 수만큼, POI로부터 인접한 순서대로 자율주행자동차를 결정하고, 결정된 자율주행자동차 가 POI에 배치되도록 할 수 있다. 관리 서버는 복수의 사용자 단말 각각에 대한 출발지와 목적지에 대한 정보와 제2 인공지능 알고리즘 에 기초하여, 복수의 사용자 단말 각각에 대한 이동 경로를 예측할 수 있다. 이러한 경우, 관리 서버(20 0)는 출발지가 서로 다른 사용자 단말의 이동 경로 중 적어도 일부가 겹치도록 이동 경로를 예측할 수 있 다. 예를 들어, 관리 서버는 제1 출발지와 제1 목적지를 가지는 제1 사용자 단말과 제2 출발지와 제2 목적 지를 가지는 제2 사용자 단말 각각으로부터 출발지와 목적지에 대한 정보를 수신하는 경우, 제1 사용자 단말의 제1 출발지로부터 제1 목적지로 향하는 이동경로 내에 제2 출발지가 포함되도록 할 수 있다. 이에 따라, 제1 사 용자 단말의 사용자는 제2 사용자 단말의 사용자와 합승하는 교통서비스를 이용할 수 있다. 관리 서버는 자율주행자동차가 예측된 이동 경로에 따라 이동되도록 하기 위해 자율주행자동차 에 이동 경로에 대한 정보를 송신할 수 있다. 관리 서버는 복수의 사용자 단말 각각과 관련된 이동 경로를 예측하는 경우, 예측된 이동 경로 중 자율주행자동차에 의해 운행될 주행 경로에 해당하는 이동 경 로를 자율주행자동차에 송신할 수 있다. 예를 들어, 관리 서버는 제1 사용자 단말에 대한 제1 이동 경로, 제2 사용자 단말에 대한 제2 이동 경로를 예측하는 경우, 제1 자율주행자동차에게는 제1 이동 경로에 대한 정보를 송신하고, 제2 자율주행자동차에게는 제2 이동 경로에 대한 정보를 송신할 수 있다. 이와 같이, 관리 서버는 사용자 단말로부터 수신된 정보에 기초하여 자율주행자동차를 관리함으 로써, 사용자에게 교통서비스가 제공되도록 할 수 있다. 도 3은 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버의 기능적 구성을 나타내는 도면이다. 이 하 사용되는 '…부'등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소 프트웨어, 또는, 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 도 3을 참조하면, 관리 서버는 정보 수신부, POI 결정부, 배치 관리부, 이동 경로 관리부 를 포함할 수 있다. 정보 수신부는 복수의 사용자 각각의 출발지와 목적지에 대한 정보를 복수의 사용자 각각의 사용자 단말로 부터 수신할 수 있다. 사용자 단말은 출발지와 목적지에 대한 입력을 사용자로부터 수신할 수 있고, 수신된 출 발지와 목적지에 대한 입력을 관리 서버와의 연결에 기초하여, 정보 수신부에 제공할 수 있다. 이를 통해, 정보 수신부는 복수의 사용자 각각의 출발지와 목적지에 대한 정보를 수신할 수 있다. POI 결정부는 사용자 단말로부터 수신된 정보와 제1 인공지능 알고리즘에 기초하여, 출발지의 밀집도가 소 정 밀집도 이상인 영역을 POI로 결정할 수 있다. 여기서, 제1 인공지능 알고리즘은 k-NN(K-nearest neighbor)을 포함할 수 있다. k-NN은 최근접 이웃 분류 알고리즘으로서, POI 결정부는 k-NN을 이용하여 특정 지점에 대 해 k개의 가장 가까운 이웃 데이터를 추출하고 그룹화함으로써 영역별 밀도를 추정할 수 있다. 이와 관련하여서 는 통상의 기술자에게 용이한바 자세한 설명은 생략하겠다. POI 결정부는 멀티-레벨 k-NN에 대해, 자율주행자동차의 이동 가능 범위를 구분한 소정의 영역 간격에 대 한 1차 특성 벡터와 상기 자율주행자동차의 이동 가능 범위 전체에 대한 2차 특성 벡터를 순차적으로 이용하여 연산을 수행할 수 있다. 경우에 따라, POI 결정부는 싱글-포인트 디맨드 k-NN에 대해 출발지에 대한 특성 벡터를 사용하여 연산을 수행할 수도 있다. POI 결정부는 과거 교통이력데이터, 예컨대, 이전에 이용된 이동 경로, 이전에 이용된 출발지, 이전에 이 용된 목적지, 및 이전에 이용된 합승 위치에 대한 데이터(이하, '과거 교통이력데이터')를 저장하는 데이터베이스를 포함할 수 있다. POI 결정부는 과거 교통이력데이터, 정보 수신부에 의해 수신된 출발지 및 목적지에 대한 정보, 및 제1 인공지능 알고리즘에 기초하여 시간대별로 출발지의 밀집도가 소정 밀집도 이상일 것으로 예상되는 영역을 POI로 결정할 수 있다. 보다 구체적으로, POI 결정부는 데이터베이스에 과거 교통이력데이터에 대한 특성 벡터를 저장하고 있을 수도 있다. 이에 기초하여, POI 결정부는 과거 교통이력데이터에 대한 특성벡터와 정보 수신부에 의해 수신되는 실시간 정보에 대한 특성벡터와의 유사도를 계산하여 k개의 후보 특성 벡터 를 도출하고, 도출된 후보 특성 벡터를 제1 인공지능 알고리즘에 적용하여 시간대별 POI를 결정할 수 있다. 한편, 경우에 따라, k-NN은 멀티-레벨(multi-level) k-NN 또는 싱글-포인트 디맨드(single-point demand) k-NN 을 포함할 수 있다. POI 결정부의 멀티-레벨 k-NN 또는 싱글-포인트 디맨드 k-NN을 이용하여 POI를 결정하 는 과정에 대한 보다 자세한 설명은 도 4를 참조할 수 있다. 배치 관리부는 POI와 출발지의 밀집도에 기초하여 자율주행자동차의 수를 결정하고, POI의 위치에 기초하 여 POI로부터 소정 거리 범위 내에 위치되는 자율주행자동차를 배치를 위한 자율주행자동차로 결정할 수 있다. 배치 관리부는 배치가 결정된 자율주행자동차에게 결정된 차량에 배치에 대한 정보를 송신할 수 있다. 보 다 구체적으로, 배치 관리부는 POI와 출발지의 밀집도에 기초하여, POI의 인근에 배치될 복수의 자율주행 자동차를 결정하여, 각각의 자율주행자동차로 배치에 대한 정보를 송신할 수 있다. 이에 따라, POI로 결정된 영역(또는 지역)에 대해 사용자의 수요가 실제로 급등하기 전에 자율주행자동차들이 미리 배치됨으로써, 원활하게 교통서비스가 제공될 수 있다. 이동 경로 관리부는 복수의 사용자 각각의 출발지와 목적지에 대한 정보와 제2 인공지능 알고리즘에 기초 하여, 복수의 사용자 각각에 대한 이동 경로를 예측하고, 자율주행자동차가 예측된 이동 경로 중 적어도 하나의 이동 경로에 따라 이동되도록 하기 위해 자율주행자동차에게 이동 경로에 대한 정보를 송신할 수 있다. 이동 경로 관리부는 복수의 사용자 중 제1 사용자의 제1 출발지와 제1 목적지에 기초하여, 제1 출발지와 제1 목적지 사이에 위치되는 제2 사용자의 제2 출발지를 식별할 수 있다. 이동 경로 관리부는 제2 인공 지 능 알고리즘에 기초하여, 제1 출발지로부터 제1 목적지까지 이동하는데 소요되는 최소 시간과 제2 출발지를 거 치는 경우 최소 시간에 가산되는 추가 시간을 추정할 수 있다. 이동 경로 관리부는 추정된 추가 시간이 소정 시간 이하인지 여부를 판정할 수 있다. 이동 경로 관리부 는 추정된 추가 시간이 소정 시간 이하인 경우, 자율주행자동차에게 송신하는 이동 경로를 제1 출발지로부 터 제2 출발지를 거쳐 제1 목적지까지의 이동하는 경로로 결정할 수 있다. 이동 경로 관리부는 추정된 추 가 시간이 소정 시간을 초과하는 경우, 제1 출발지로부터 제1 목적지까지의 이동 경로 상에 제2 출발지가 포함 되지 않도록 결정할 수 있다. 즉, 제1 사용자와 제2 사용자의 합승을 유도하지 않고, 제1 사용자만 교통서비스 를 이용하도록 할 수 있다. 이처럼, 이동 경로 관리부는 이동 경로가 적어도 일부 겹치는 복수의 사용자가 있는 경우, 시간과 거리를 통합적으로 고려하여 효율적인 합승 서비스를 제공할 수 있다. 또한, 이동 경로 관리부는 합리적인 합승을 통해, 에너지 자원을 절약하고 교통 체증을 저감할 수 있으며, 사용자에게는 동승자와 함께 교통서비스에 대한 비용을 지불하도록 함으로써 경제적 이익을 제공할 수 있다. 도 4는 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버에서 POI를 결정하는 방법을 설명하기 위 한 도면이다. 참조번호 1a는 관리 서버의 POI 결정부를 통해 수행되는 동작들의 흐름의 예를 나타낸다. 구체적으로, POI 결정부는 공유형 자율주행자동차의 교통이력데이터를 획득할 수 있다. 공유형 자율주행자 동차의 교통이력데이터는 자율주행자동차의 출발지, 목적지, 합승이 수행된 경우 합승지, 합승 경로 등 과거 교 통서비스의 제공에 이용된 다양한 이력데이터를 포함할 수 있다. 설명의 편의를 위해, 공유형 자율주행자동차의 교통이력데이터는 과거 교통이력데이터로 지칭하겠다. POI 결정부는 과거 교통이력데이터를 전처리하여 제1 인공지능 알고리즘에 이용되는 특성 벡터를 추출할 수 있다. 추출된 특성 벡터는 과거 교통이력데이터와 함께 POI 결정부의 데이터베이스 내에 저장될 수 있 다. POI 결정부는 정보 수신부를 통해 수신되는 현재(또는 실시간)의 교통데이터에 대한 정보, 즉 현재 사용자에 의해 요청되는 출발지와 목적지에 대한 정보와 관련된 특성 벡터를 추출할 수 있다. POI 결정부는 과거 교통이력데이터에 대한 특성 벡터와 현재 교통데이터에 대한 특성 벡터의 유사도를 계산하여, 제1 인공 지능 알고리즘의 연산을 위한 k개의 후보 특성 벡터를 도출할 수 있다. POI 결정부는 도출된 후보 특성 벡터를 제1 인공지능 알고리즘에 적용하여 시간대별 POI를 결정할 수 있다. 한편, 상술한 바와 같이, 제1 인공지능 알고리즘은 k-NN은 멀티-레벨 k-NN 또는 싱글-포인트 디맨드 k-NN을 포 함할 수 있고, 이에 기초하여 POI 결정부는 POI를 결정할 수 있다. 제1 인공지능 알고리즘이 멀티-레벨 k-NN을 포함하는 경우, POI 결정부는 과거 교통이력데이터에 대한 특 성 벡터와 현재 교통데이터(또는 실시간 교통데이터)에 대한 특성 벡터의 유사도 계산과 관련하여 2가지 단계로 나누어 후보 특성 벡터를 도출할 수 있다. 즉, POI 결정부는 출발지와 목적지, 즉 경로에 대한 특성 벡터 를 이용하며, 2가지 단계로 나누어 후보 특성 벡터를 도출할 수 있다. 보다 구체적으로, POI 결정부는 교통서비스 제공이 가능한 경로에 대한 전체 네트워크를 구역으로 나누어 구역 네트워크를 형성할 수 잇다. POI 결정부는, 나뉘어진 구역 네트워크에 대한 과거 교통이력데이터와 현재 교통데이터를 이용하여, 각각에 대한 특성 벡터를 1차적으로 산출할 수 있다 1차적으로 산출되는 특성 벡 터는 1차 특성 벡터로 지칭될 수 있다. POI 결정부는 과거 교통이력데이터로부터 산출된 1차 특성 벡터와 현재 교통데이터로부터 산출된 1차 특성 벡터 간의 유사도를 평가하여 전체 교통이력데이터에 대한 k1개의 1차 특성 벡터 후보군을 도출할 수 있다. 1차 특성 벡터 후보군은 하기의 수학식 1과 같이 표현될 수 있다. 수학식 1"}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1을 참조하면, 는 시간 t에서의 나뉘어진 구역에 대한 특성 벡터, 는 시간 t에서 출발지 s가 포함된 구역 Sagg로부터 목적지 e가 포함된 구역 eagg로 이동하는 과정에 포함되는 구역 네트워크에 대한 사 용자의 수요, τ는 특성 벡터의 시간적 범위일 수 있다. POI 결정부는 과거 교통이력데이터 및 현재 교통데이터의 특성 벡터를 이용하여 k1개의 1차 특성 벡터 후 보군 중 k2개의 특성 벡터를 2차 특성 벡터 후보군으로 도출할 수 있다. 여기서, k1의 값은 k2의 값 이상일 수 있다. 보다 구체적으로, POI 결정부는 1차 특성 벡터 후보군에 대한 과거 교통이력데이터와 현재 교통데이터를 이용하여 각각에 대한 2차 특성 벡터를 산출할 수 있다. POI 결정부는 1차 특성 벡터 후보군에 대한 과거 교통이력데이터로부터 산출된 2차 특성 벡터와 현재 교통데이터로부터 산출된 2차 특성 벡터 간의 유사도를 평 가하여, k2개의 특성 벡터를 2차 특성 벡터 후보군으로 도출할 수 있다. 2차 특성 벡터 후보군은 하기의 수학식 2와 같이 표현될 수 있다. 수학식 2"}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 1을 참조하면, 는 시간 t에서의 전체 네트워크에 대한 특성 벡터, 는 시간 t에서 출발지 s로 부터 목적지 e로 이동하는 전체 네트워크에 대한 사용자의 수요일 수 있다. 제1 인공지능 알고리즘이 싱글-포인트 디맨드 k-NN을 포함하는 경우, POI 결정부는 출발지에 대한 특성 벡 터 및 목적지에 대한 특성 벡터를 사용하여 연산을 수행할 수 있다. 즉, POI 결정부는 출발지와 목적지쌍 에 대한 경로의 특성 벡터를 이용하는 것이 아닌, 출발지 또는 목적지, 즉 지점(point)에 대한 특성 벡터를 사 용하여 후보 특성 벡터를 도출할 수 있다. 출발지에 대한 특성 벡터는 하기의 수학식 3과 같이 표현될 수 있다. 수학식 3"}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3을 참조하면, 은 시간 t에서의 출발지에 대한 특성 벡터, 는 시간 t일 때 출발지에 대한 사 용자의 수요일 수 있다. 목적지에 대한 특성 벡터는 하기의 수학식 4와 같이 표현될 수 있다. 수학식 4"}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4를 참조하면, 은 시간 t에서의 목적지에 대한 특성 벡터, 는 시간 t일 때 목적지에 대한 사용자의 수요일 수 있다. 싱글-포인트 디맨드 k-NN을 이용하여 연산이 수행되는 경우, 특성 벡터의 차원이 RxR에서 2R로 감소하므로, POI 결정부는 신속하게 연산을 수행할 수 있어, POI 결정에 대한 계산 속도가 빨라질 수 있다. 참조번호 1b는 POI 결정부에 의해 결정된 POI로 자율주행자동차가 이동하는 형태를 개념적으로 보여준다. POI 결정부에 의해 결정된 POI에 대한 정보가 복수의 자율주행자동차 각각에 송신되 는 것에 기초하여, 자율주행자동차는 POI에 인접하도록 배치될 수 있다. 이 때, POI에 배치되는 자율주행자동차는 POI와의 거리 및 사용자의 수요를 고려하여 선택된 것일 수 있다. 도 5는 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버에서 이동 경로를 결정 방법을 설명하기 위한 도면이다. 보다 구체적으로, 도 5는 제2 인공지능 알고리즘을 이용하여 최적의 이동 경로를 예측하는 관리 서버의 동작을 개념적으로 도시한다. 도 5를 참조하면, 사용자 단말은 관리 서버에 출발지와 목적지에 대한 정보를 송신할 수 있다. 관리 서버에 송신되는 정보에 기초하여 이동 경로 관리부는 출발지와 목적지에 대한 정보에 기초하여 이동 경로 데이터를 생성 및 저장할 수 있다. 경우에 따라, 이동 경로 관리부는 이동 경로에 대한 다양한 정보를 포함하는 이동 경로 데이터베이스를 포 함할 수 있고, 이동 경로 데이터베이스에 이동 경로 데이터를 저장할 수 있다. 이동 경로 데이터베이스는 예를 들면, 이전에 이용된 이동 경로, 이전에 이용된 출발지, 이전에 이용된 목적지, 및 이전에 이용된 합승 위치에 대한 데이터를 포함하는 과거 교통이력데이터 및 사용자 단말로부터 수신한 출발지와 목적지에 대한 데이 터를 포함하는 현재 교통데이터를 포함할 수 있다. 이동 경로 관리부는 교통서비스가 제공되는 지역의 도로에 대한 네트워크를 하위 단위의 구역(subnetwor k)로 나눌 수 있다. 보다 구체적으로, 이동 경로 관리부는 구역으로 네트워크를 나누기 위해, 과거 교통이 력데이터를 이용하여, 이전에 이용된 이동경로에 대한 데이터를 군집화(clustering)하여 군집 중심점(centroi d)을 추출하고, 이를 기반으로 보로노이 조각화 방법론(voronoi tessellation method)을 사용하여 구역으로 나 뉘어진 네트워크를 구성할 수 있다. 이동 경로 관리부는 제2 인공지능 알고리즘을 이용하여 사용자 단말로부터 수신된 출발지와 목적지에 대한 정보를 입력으로 하여 최적의 이동 경로를 획득할 수 있다. 한편, 제2 인공지능 알고리즘은 순환신경망(recurrent neural network, RNN)를 포함할 수 있다. 제2 인공지능 알고리즘은 과거 교통이력데이터를 이용하여 최적의 경로를 예측하도록 학습되어 있을 수 있다. 이동 경로 관리 부는 기학습된 제2 인공지능 알고리즘을 이용하여 사용자 단말로부터 수신된 출발지와 목적지에 대한 최적의 이동 경로를 예측할 수 있다. 경우에 따라, 이동 경로 관리부는 최적의 이동 경로를 예측하기 위해, 하기의 수학식 5와 같은 이동 경로 생성 점수를 산출하고, 산출된 점수에 기초하여 최적의 이동 경로를 결정할 수 있다. 수학식 5"}
{"patent_id": "10-2018-0143229", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 5를 참조하면, 는 이동 경로 생성 점수, , 및 각각은 각 변수에 대한 매개변수, 는 합승하지 않고 최소시간 이동 경로를 택했을 때 소요되는 시간, 는 합승객 을 태우기 위해 소요되는 추가적인 시간, 는 합승객의 수에 대한 추정 값일 수 있다. 이동 경로 관리부 는 이동 경로 생성 점수가 최소로 나온 경로를 최적의 이동 경로로 결정할 수 있다. 도 6은 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 방법의 각 단계의 흐름을 나타내는 도면이다. 이하 도 6에서는 도 3의 관리 서버의 각 구성을 중심으로 설명하겠다. 도 6을 참조하면, 정보 수신부는 복수의 사용자 각각의 출발지와 목적지에 대한 정보를 수신할 수 있다 (S110). POI 결정부는 출발지의 밀집도가 소정 밀집도 이상인 영역을 POI로 결정할 수 있다(S120). 배치 관리부는 자율주행자동차의 배치를 결정하고, 배치 정보를 배치될 자율주행자동차에 송신할 수 있다. 이동 경로 관리부는 복수의 사용자 각각의 이동 경로를 예측하고 자율주행자동차에 이동 경로에 대한 정보를 송 신할 수 있다(S140). 보다 구체적으로, 이동 경로 관리부는 복수의 사용자 각각과 관련된 최적의 이동 경로를 예측하여, 복수의 사용자 각각에 대해 교통서비스를 제공할 자율주행자동차를 각각 결정할 수 있다. 이동 경로 관리부는 결 정된 자율주행자동차 각각에 대해 예측된 이동 경로에 대한 정보를 송신할 수 있다. 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버 및 방법은, 사용자의 수요를 예측하여, 수 요가 예측된 지역에 대해 공유형 자율주행자동차의 배치를 증가시킴으로써 효율성 및 편의성이 향상된 공유형 교통서비스를 제공할 수 있다. 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버 및 방법은, 합승 서비스의 제공과 관련하여, 최적의 이동 경로를 추정하여 효율적인 합승 서비스를 제공함으로써 증가시킴으로써 효율성 및 편의 성이 향상된 공유형 교통서비스를 제공할 수 있다. 본 명세서에 첨부된 블록도의 각 블록과 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수 행될 수도 있다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 블록도의 각 블록 또는 흐름도의 각 단계에서 설명된 기능 들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위 해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인 스트럭션들은 블록도의 각 블록 또는 흐름도 각 단계에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이 터 프로세싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상 에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 블록도의 각 블록 및 흐름도의 각 단계에서 설명된 기능들 을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록 또는 각 단계는 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들 을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실시예들에서는 블록들 또 는 단계들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시 되어 있는 두 개의 블록들 또는 단계들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들 또는 단계들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 품질에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 명세서에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명 하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보 호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2018-0143229", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버 및 방법에 의해 제공되는 교통서비스의 개념도를 나타내는 도면이다. 도 2는 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버와 관련된 정보의 송수신의 개념도를 나타 내는 도면이다. 도 3는 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버의 기능적 구성을 나타내는 도면이다. 도 4는 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버에서 POI를 결정하는 방법을 설명하기 위 한 도면이다. 도 5는 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 서버에서 이동 경로를 결정 방법을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에 따른 공유형 자율주행자동차 관리 방법의 각 단계의 흐름을 나타내는 도면이다."}
