{"patent_id": "10-2006-0130706", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2008-0071213", "출원번호": "10-2006-0130706", "출원인": "한국과학기술정보연구원", "발명자": "정한민"}}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "URI 기반과 DBMS 기반 하에 지식 처리를 수행하여 지식정보 공유 서비스가 제공될 수 있도록 처리하는 지식 처리부와;상기 지식 처리부에서 처리된 결과를 제공받고, 시맨틱 웹에 기반하여 연구정보의 등록과 검색 처리 및 통계 서비스를 제공하는 정보 유통 서비스부와;상기 지식 처리부에서 처리된 결과를 제공받고, 팩트, 규칙 및 후처리를 통해 연구개발 정보에서 명시적으로 드러나 있지 않은 간접적인 정보를 발굴하여 제공하는 추론 서비스부;를 포함하여 구성되는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 시스템."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 지식 처리부는,동명저자의 중의성을 해소하는 인력개체 확인부와;상기 인력개체 확인부의 확인결과를 전달받고, URI 기반 하에서 저자 인용관계 및 네트워크를 구축하고 URI 기반의 성과정보를 관리하는 URI 기반 처리부와;입력된 원문에 대해 주제와 분야를 할당하는 주제/분야 할당부와;상기 URI 기반 처리부의 처리결과를 전달받고, 상기 주제/분야 할당부에서 할당된 결과를 전달받으며, DBMS에기반하여 지식을 확장하고 추론하며, 상기 정보유통 서비스부와 상기 추론 서비스부를 이용하는 사용자의 질의를 처리하는 DBMS 기반 지식확장 및 추론부;를 포함하여 구성되는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 시스템."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 정보유통 서비스부는,상기 정보 유통 서비스부에서 보고서, 논문, 특허 중에서 하나 이상을 포함한 성과 정보 및 비성과 정보를 등록하고 관리하는 정보 등록/관리 서비스부;상기 정보 유통 서비스부에서 관련성과와 참조성과의 검색 서비스를 제공하는 관련성과/참조성과 검색서비스부;상기 정보 유통 서비스부에서 연구개발 정보에서 주제와 분야에 대한 세부정보를 열람할 수 있도록 하는 주제/분야 세부정보 열람 서비스부;상기 정보 유통 서비스부에서 연구개발 정보에 대한 통계 정보를 제공하는 통계 서비스부;중에서 하나 이상을 포함하여 구성되는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 시스템."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 추론 서비스부는,상기 추론 서비스부에서 연구자 네트워크를 제공하는 연구자 네트워크 서비스부;상기 추론 서비스부에서 연구자 정보를 제공하는 연구자 정보 서비스부;상기 추론 서비스부에서 연구 성과 맵을 제공하는 연구 성과 맵 서비스부;- 3 -공개특허 10-2008-0071213상기 추론 서비스부에서 성과정보를 제공하는 성과정보 서비스부;상기 추론 서비스부에서 기관정보를 제공하는 기관정보 서비스부;상기 추론 서비스부에서 통계정보를 제공하는 통계정보 서비스부;상기 추론 서비스부에서 통합 연구자 네트워크 서비스를 제공하는 통합 연구자 네트워크 서비스부; 상기 추론 서비스부에서 연구자 친밀도 서비스를 제공하는 연구자 친밀도 서비스부;중에서 하나 이상을 포함하여 구성되는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 시스템."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 시맨틱 웹 기반 연구정보 서비스 시스템은,인력, 기관, 보고서, 논문, 특허, 주제, 분야에 대한 URI 등록 및 관리를 수행하고, 레퍼렌셜 아이덴티티 검색기능을 제공하는 URI 등록/관리 서비스부, 시소러스 기반 자동 분류를 수행하여 주제와 분야에 대한 분류 서비스를 제공하는 주제/분야 분류 서비스부를 구비한 공통 서비스부;를 더욱 포함하여 구성되는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 시스템."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "인력개체 확인을 통해 동명저자의 중의성을 해소하는 제 1 단계와;상기 제 1 단계 후 URI 기반 처리를 수행하여 URI 기반 저자 인용관계 및 네트워크를 구축하고, URI 기반의 성과정보를 관리하는 제 2 단계와;상기 제 2 단계 후 입력된 원문에 대해 주제와 분야를 할당하는 제 3 단계와;상기 제 3 단계 후 DBMS에 기반하여 지식을 확장하고 추론하며, 정보유통 서비스부와 추론 서비스부를 이용하는사용자의 질의를 처리하는 제 4 단계와;상기 제 4 단계 후 정보유통 서비스와 추론 서비스를 제공하는 제 5 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 제 1 단계는,sameAs 관리에 의한 인력 개체 확인 수행시, 온톨로지 인스턴스들의 sameAs 관계를 확인하거나 설정하거나 또는해제하여 관리하는 제 10 단계와;상기 제 10 단계에서 sameAs 관계 설정과 해제에 대한 입력을 받고, 온톨로지 인스턴스 데이터 내에서 관련 지식을 수정하는 제 20 단계와;상기 제 20 단계에서 수정된 지식을 이용하고, 사용자 질의를 처리하고 sameAs 후 처리를 수행하여 결과를 제시하는 제 30 단계;를 더욱 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 제 10 단계는,온톨로지 내에 기존에 설정된 sameAs 관계로 얻어지는 sameAs 개체 쌍들과 sameAs 그룹들을 확인하는 제 11 단계와;- 4 -공개특허 10-2008-0071213상기 제 11 단계 후 임의의 두 개체 쌍에 대해 신규로 sameAs 관계를 설정하는 제 12 단계와;상기 제 11 단계 후 기존에 설정된 sameAs 개체 쌍의 sameAs 개체 관계를 해제하는 제 153 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7에 있어서,상기 제 20 단계는,상기 제 20 단계로부터 개체 쌍의 sameAs 설정에 대한 입력을 받아 sameAs 관계를 맺을 두 개체와 관련된 지식들을 수정하는 제 21 단계와;상기 제 10 단계로부터 개체 쌍의 sameAs 해제에 대한 입력을 받아 sameAs 관계를 해제할 두 개체와 관련된 지식들을 수정하는 제 22 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에 있어서,상기 제 30 단계는,사용자 질의를 입력받아 처리 결과를 생성하는 제 31 단계와;상기 제 31 단계에서 제시한 질의 처리 결과에 나타난 개별 개체들에 대해, sameAs 관계로 연결된 sameAs 개체집합을 찾고, sameAs 개체 집합의 대표 개체를 찾아, 찾아진 대표 개체로 교체하는 제 32 단계와;상기 제 32 단계의 결과를 받아 사용자 인터페이스에 맞도록 출력 메시지를 생성하는 제 33 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 6에 있어서,상기 제 1 단계는,인력개체 확인 수행시, 원문으로부터의 정보추출기법을 사용하여 동명저자의 중의성을 해소하기 위해, 대용량과학 기술 문헌의 탐색 및 검색을 수행할 때 논문 서지 정보를 자동 추출하는 제 41 단계와;대용량 과학 기술 문헌의 탐색 및 검색 수행시, 논문 원문 내의 정보 추출에 의해 동명 저자 중의성 해소 정보를 자동 추출하는 제 42 단계와;상기 제 41 단계와 상기 제 42 단계에서 추출된 정보 중에서 하나 이상의 정보를 이용하여 동명 저자의 중의성을 해소하도록 적용하는 제 43 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 제 41 단계는,공동 저자명, 논문 제목, 게재지명과 게재년도를 포함한 게재정보 중에서 하나 이상의 논문 서지 정보를 자동추출하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 제 42 단계는,- 5 -공개특허 10-2008-0071213저자의 전자메일 주소, 논문작성 당시의 저자의 소속기관정보, 논문을 다루는 분야에 대한 키워드(들), 논문의연구를 지원한 연구과제번호 정보, 논문을 작성한 저자의 저술 스타일, 논문 원문 텍스트 내의 용어 집합 중에서 하나 이상의 동명 저자 중의성 해소 정보를 자동 추출하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "에 있어서,상기 문헌기반 인용관계 구축 단계는,인용 정보 중에서 제목을 추출하는 참고 문헌 제목 추출 단계와;상기 참고 문헌 제목 추출 단계 후 문헌 제목을 이용하여 문헌 간에 인용 네트워크를 구축하여 객체 URI 저장소의 URI를 획득하는 객체 URI 저장소 URI 획득 단계와;상기 객체 URI 저장소 URI 획득 단계 후 문헌에 해당하는 객체 URI 저장소 내에 저장되어 있는 객체 URI를 이용하여 문헌 중심의 인용 관계를 구축하여 객체 URI의 인용과 피인용 관계를 구축하는 객체 URI 인용-피인용 관계구축 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,상기 인용정보 추출 단계는,참고문헌 영역을 결정하는 참고문헌 영역 확인 단계와;상기 참고문헌 영역 확인 단계 후 인용 정보를 추출하는 인용 정보 추출 단계와;상기 인용 정보 추출 단계 후 인용 정보의 메타데이터를 추출하는 인용 정보 메타데이터 추출 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서,상기 인용 정보 메타데이터 추출 단계는,논문 원문 수집과 텍스트 변환을 통해 인용정보에서 공백제거 및 오류제거를 수행하는 공백제거 및 오류제거 단계와;상기 공백제거 및 오류제거 단계 후 문자열을 구분기호로 분리하는 문자열을 구분기호로 분리하는 단계와;상기 문자열을 구분기호로 분리하는 단계 후 인용 문헌의 서지정보로부터 정보를 추출하는 정보추출 단계와;상기 정보추출 단계 후 메타데이터의 필드를 하나의 정규화된 데이터로 변환시키는 정규화 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 15에 있어서,상기 인용 정보 메타데이터 추출 단계는,인용 문헌의 서지정보로부터 학회필드, 학술대회필드, 권 필드, 호 필드, 연도필드에 해당하는 정보를 추출하는것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법.- 6 -공개특허 10-2008-0071213청구항 18"}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 14에 있어서,상기 저자기반 인용관계 구축 단계는,인용-피인용으로 연결된 문헌 URI 쌍으로부터 하나의 문헌 URI를 획득하여 객체 URI를 획득하는 객체 URI 획득단계와;상기 객체 URI 획득 단계 후 개별 문헌 URI의 저자에 해당하는 인력 URI를 URI 서버로부터 획득함으로써 객체URI의 이용에 의해 저자 URI를 획득하는 객체 URI 이용 저자 URI 획득 단계와;상기 객체 URI 이용 저자 URI 획득 단계 후 문헌 URI 쌍으로 묶인 두 문헌의 저자 URI 집합들간에 인용-피인용관계를 생성하여 저자 URI의 인용-피인용 관계를 구축하는 저자 URI 인용-피인용 관계구축 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "에 있어서,상기 URI 관리 단계는,상기 성과 정보 관리 단계에서 관리하는 성과 정보를 등록 및 관리하고, 성과 정보에 URI를 부여하고, 성과 정보로부터 RDF 트리플이나 RDF XML을 추출하여 정보를 지식화시켜 지식 확장에 사용할 수 있도록 하는 것을 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 20에 있어서,상기 성과 정보 관리 단계는,성과 정보 등록 인터페이스를 통해 등록자가 성과 정보와 해당 성과물을 등록하도록 하는 제 101 단계와;상기 제 101 단계를 통해 등록자가 입력한 정보가 올바른지 확인하는 제 102 단계와;상기 제 102 단계에서 확인된 성과 정보에 대해 성과 가중치를 부여하거나, 성과 정보 또는 성과물로부터 통제된 주제 또는 분야 등을 추출하여 할당하는 제 103 단계와;상기 제 103 단계에서 등록된 성과 정보에 대한 관리자 검증 과정이 수행되도록 하는 제 105 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법.- 7 -공개특허 10-2008-0071213청구항 22"}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "청구항 20에 있어서,상기 지식 확장 단계는,확장된 지식이 SPARQL, RDQL을 포함한 시맨틱 웹 질의 언어를 이용하여 추론 결과를 얻는 데 참조되도록 하는것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "청구항 6에 있어서,상기 제 2 단계는,URI 기반 성과 정보 등록 수행시, 성과 정보에 대해 중복 및 오류를 검증하고 성과 정보 객체 URI를 할당하는제 111 단계와;상기 제 111 단계 후 해당 성과 정보를 DB-트리플/XML로 변환하는 제 112 단계와;상기 제 112 단계 후 최종적으로 변환 완료된 성과 정보를 저장하는 제 113 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "청구항 6에 있어서,상기 제 2 단계는,URI 기반 성과 정보 등록 수행시, 관리자에 의해 성과 정보를 승인하는 제 121 단계와;상기 제 121 단계 후 해당 성과 정보 객체 URI를 이용하여 성과 정보 RDF 트리플/XML을 획득하는 제 122단계와;상기 제 122 단계 후 추론 규칙을 적용하여 지식을 확장하는 제 123 단계와;상기 제 123 단계에서의 확장 완료 후 성과 정보의 상태를 변경하는 제 124 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "청구항 6에 있어서,상기 제 2 단계는,URI 기반 성과 정보 등록 수행시, 성과 정보 관리부에서 URI 관리부로 초기화 명령을 전달하는 제 131 단계와;상기 제 131 단계 후 상기 URI 관리부가 초기화 되도록 하고, 상기 URI 관리부에서 상기 성과 정보 관리부로 초기화 결과를 전달하는 제 132 단계와;상기 제 132 단계 후 상기 성과 정보 관리부에서 지식 확장부로 초기화 명령을 전달하는 제 133 단계와;상기 제 133 단계 후 상기 지식 확장부가 초기화 되도록 하고, 상기 지식 확장부에서 상기 성과 정보 관리부로초기화 결과를 전달하는 제 134 단계와;- 8 -공개특허 10-2008-0071213상기 제 134 단계 후 상기 성과 정보 관리부가 초기화 되도록 하는 제 135 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "청구항 6에 있어서,상기 제 2 단계는,URI 기반 성과 정보 등록 수행시, 성과 정보 관리부에서 URI 관리부로 성과 정보 객체 URI를 전달하는 제 141단계와;상기 제 141 단계 후 상기 URI 관리부에서 성과 정보를 삭제하고, 상기 URI 관리부에서 상기 성과 정보 관리부로 삭제 결과를 전달하는 제 142 단계와;상기 제 142 단계 후 상기 성과 정보 관리부에서 지식 확장부로 성과 정보 객체 URI를 전달하는 제 143 단계와;상기 제 143 단계 후 상기 지식 확장부에서 성과 정보를 삭제하고, 상기 지식 확장부에서 상기 성과 정보 관리부로 삭제 결과를 전달하는 제 144 단계와;상기 제 144 단계 후 상기 성과 정보 관리부에서 성과 정보를 삭제하는 제 145 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "청구항 6에 있어서,상기 제 2 단계는,URI 기반 성과 정보 등록 수행시, 성과 정보 관리부에서 URI 관리부로 성과 정보 객체 URI가 포함된 성과 정보를 전달하는 제 151 단계와;상기 제 151 단계 후 상기 URI 관리부는 성과 정보를 대체하고, 상기 성과 정보 관리부로 성과 정보 객체 URI를전달하는 제 152 단계와;상기 제 152 단계 후 상기 성과 정보 관리부는 지식 확장부로 성과 정보 객체 URI를 전달하는 제 153 단계와;상기 제 153 단계 후 상기 지식 확장부는 성과 정보를 삭제하고, 상기 URI 관리부로 성과 정보 객체 URI를 전달하는 제 154 단계와;상기 제 154 단계 후 상기 URI 관리부는 상기 지식 확장부로 RDF 트리플/XML을 전달하는 제 155 단계와;상기 제 155 단계 후 상기 지식 확장부는 지식을 확장하고, 확장 결과를 상기 성과 정보 관리부로 전달하는 제156 단계와;상기 제 156 단계 후 상기 성과 정보 관리부는 성과 정보 객체 URI가 포함된 성과 정보를 저장하는 제 157단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "청구항 6에 있어서,상기 제 2 단계는,URI 기반 성과 정보 등록 수행시, 성과 정보가 등록되면 설정되는 승인 대기 상태와;승인 대기 상태에 있는 성과 정보에 대해 관리자가 승인을 선택하면 설정되는 승인 완료 상태와;승인 대기 상태에 있는 성과 정보에 대해 관리자가 승인을 거절하면 설정되는 승인 거절 상태와;승인 대기 상태, 승인 완료 상태, 승인 거절 상태에서 삭제가 이루어지면 문서가 삭제되도록 설정되는 문서 삭제 상태;- 9 -공개특허 10-2008-0071213를 포함하여 구성된 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "청구항 6에 있어서,상기 제 2 단계는,URI 기반 성과 정보 등록 수행시, DBMS를 이용하여 RDF 트리플을 관리하고, 성과 정보, 비성과 정보, 온톨로지스키마에 따라 RDF 트리플 유형을 구분하고 관리하며, 상태 필드를 이용하여 RDF 트리플 이용 여부를 확인하는것을 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "에 있어서,상기 제 203 단계는,각 분야분류명을 위한 택소노미를 도입하는 제 231 단계와;상기 제 231 단계에서 도입된 택소노미에 속한 키워드들을 시소러스에 매핑시키는 제 232 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "청구항 31에 있어서,상기 제 201 단계는,실험 문서 집합, 분야 분류 체계, 정답 문서 집합을 입력받아 자질을 추출하는 제 211 단계와;상기 제 211 단계 후 기계 학습을 수행하는 제 212 단계와;상기 제 212 단계 후 문서 분류를 수행하는 제 213 단계와;상기 제 213 단계 후 자질 집합을 형성한 다음 제 211 단계로 리턴하는 제 214 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "청구항 31에 있어서,상기 제 202 단계는,통계 기반 문서 분류를 수행하는 제 221 단계와;상기 제 221 단계의 통계 기반 문서 분류로부터 자질 집합을 얻는 제 222 단계와;상기 제 222 단계에서 얻어진 자질 집합으로부터 키워드들을 선정하는 제 223 단계와;상기 제 223 단계에서 선정된 키워드들을 용어 후보로 결정하는 제 224 단계와;상기 제 224 단계 후 시소러스를 구축한 다음 상기 제 221 단계로 리턴하는 제 225 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법.- 10 -공개특허 10-2008-0071213청구항 34"}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "청구항 31에 있어서,상기 제 204 단계는,문서를 입력하도록 하는 제 241 단계와;상기 제 241 단계 후 형태소 분석 및 불용어 처리를 수행하는 제 242 단계와;상기 제 242 단계에서 추출된 주요 키워드들을 시소러스 상의 용어들과 매칭시키는 제 243 단계와;상기 제 243 단계에서 매칭된 용어들로부터 택소노미를 이용하여 분야분류명을 획득하는 제 244 단계와;상기 제 244 단계에서 획득된 분야분류명들을 조합하여 해당 문서의 분야분류명을 결정하는 제 245 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "청구항 31에 있어서,상기 제 205 단계는,문서를 입력받아 통계 기반 문서 분류와 시소러스 기반 문서 분류에서 각각의 분류 결과를 획득하는 제 251 단계와;상기 제 251 단계에서의 두 분류 결과를 이용하여 최종 분류 결과를 생성하는 제 252 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "청구항 36에 있어서,상기 제 252 단계는,두 분류 결과에 대해 차별적 적용 방식의 조합, 대등 방식의 조합, 보팅 방식의 조합 중에서 하나 이상의 조합으로 최종 분류 결과를 생성하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "청구항 6에 있어서,상기 제 3 단계는,지식 처리부에서의 정보 검색시, 상기 지식 처리부는 시소러스가 구축되었는지 판별하는 제 261 단계와;상기 제 261 단계에서 시소러스가 구축되어 있으면, 원문으로부터 색인어를 추출하는 제 262 단계와;상기 제 262 단계 후 색인어를 시소러스 내의 개념어인 주제어와 매칭시키고 분야분류명과 시소러스 내의 개념어인 주제어를 매칭시키는 제 263 단계와;상기 제 263 단계 후 통제된 형태의 주제어를 결정하고, 분야분류명을 결정하는 제 264 단계와;상기 제 264 단계 후 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에- 11 -공개특허 10-2008-0071213서 하나 이상의 조건을 고려하여 결정된 주제어를 순위화하는 제 265 단계와;상기 제 265 단계 후 해당 원문에 대해 상위에서 미리 설정한 특정 개수의 주제어를 할당하는 제 266 단계;를 더욱 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "청구항 6에 있어서,상기 제 3 단계는,지식 처리부에서의 정보 검색시, 상기 지식 처리부는 시소러스가 구축되어 있는지 판별하는 제 271 단계와;상기 제 271 단계에서 시소러스가 미구축되어 있으면, 택소노미 분류체계가 결정되어 있는지 판별하는 제 272단계와;상기 제 272 단계에서 택소노미 분류체계가 결정되어 있다고 판별되면, 택소노미를 이용하여 분야를 자동 할당하는 제 273 단계와;상기 제 272 단계에서 택소노미 분류체계가 결정되어 있지 않다고 판별되면, 태그를 이용하여 주제를 자동 할당하는 제 274 단계와;상기 제 272 단계에서 택소노미 분류체계가 결정되어 있지 않다고 판별되면, 태그와 폭소노미를 이용하여 주제또는 분야를 자동 할당하는 제 275 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "청구항 39에 있어서,상기 제 273 단계는,각 분야 분류명을 대표할 수 있는 정의문을 수집하는 제 281 단계와;상기 제 281 단계 후 정의문으로부터 용어를 추출하는 제 282 단계와;상기 제 282 단계 후 추출한 용어에 대한 검증을 수행하고자 하는지 판별하는 제 283 단계와;상기 제 283 단계에서 추출한 용어에 대한 검증을 수행하고자 하는 것으로 판별하면, 추출된 용어가 주제어로적당한지 검증을 수행하는 제 284 단계와;상기 제 283 단계에서 추출한 용어에 대한 검증을 수행하지 않는 것으로 판별하거나 또는 상기 제 284 단계 수행 후 추출한 용어를 시소러스의 개념어인 주제어로 결정하는 제 285 단계와;상기 제 285 단계 후 택소노미를 사용하여 분야를 할당하여 시소러스를 구축하는 제 286 단계와;상기 제 286 단계 후 택소노미 내의 용어들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 택소노미에 의한 어느 분야 분류 체계에 해당하는지 결정하는 제 287 단계와;상기 제 287 단계 후 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상의 조건을 고려하여 결정된 주제어(용어)를 순위화하는 제 288 단계와;상기 제 288 단계 후 입력된 원문에 대해 택소노미를 사용한 상위에서 미리 설정한 특정 개수의 분야를 할당하는 제 289 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "청구항 39에 있어서,상기 제 274 단계는,태그를 가진 웹 문서로부터 태그를 추출하는 제 291 단계와;- 12 -공개특허 10-2008-0071213상기 제 291 단계 후 추출한 태그에 대한 검증을 수행하고자 하는지 판별하는 제 292 단계와;상기 제 292 단계에서 추출한 태그에 대한 검증을 수행하고자 하는 것으로 판별하면, 추출된 태그가 주제어로적당한지 검증을 수행하는 제 293 단계와;상기 제 292 단계에서 추출한 태그에 대한 검증을 수행하지 않는 것으로 판별하거나 또는 상기 제 293 단계 수행 후 추출된 태그를 시소러스의 개념어인 주제어로 결정하는 제 294 단계와;상기 제 294 단계 후 추출된 태그를 사용하여 시소러스를 구축하는 제 295 단계와;상기 295 단계 후 시소러스 내의 용어들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 시소러스내의 어느 태그에 해당하는지 결정하는 제 296 단계와;상기 제 296 단계 후 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상의 조건을 고려하여 결정된 주제어(태그)를 순위화하는 제 297 단계와;상기 제 297 단계 후 입력된 원문에 대해 상위에서 미리 설정한 특정 개수의 주제어(태그)를 할당하는 제 298단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "청구항 39에 있어서,상기 제 275 단계는,태그를 가진 웹 문서로부터 태그를 추출하는 제 301 단계와;상기 제 301 단계 후 추출된 태그에 대한 검증을 수행하고자 하는지 판별하는 제 302 단계와;상기 제 302 단계에서 추출된 태그에 대한 검증을 수행하고자 하는 것으로 판별하면, 추출된 태그가 주제어로적당한지 검증을 수행하는 제 303 단계와;상기 제 302 단계에서 추출된 태그에 대한 검증을 수행하지 않는 것으로 판별하거나 또는 상기 제 303 단계 수행 후 추출된 태그를 시소러스의 개념어인 주제어로 결정하는 제 304 단계와;상기 제 304 단계 후 폭소노미를 사용하여 분야를 할당하여 시소러스를 구축하는 제 305 단계와;상기 제 305 단계 후 시소러스 내의 태그들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 폭소노미에 의한 어느 분야 분류 체계에 해당하는지 결정하는 제 306 단계와;상기 제 306 단계 후 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상의 조건을 고려하여 결정된 주제어(태그), 분야(폭소노미)를 순위화하는 제 307 단계와;상기 제 307 단계 후 입력된 원문에 대해 상위에서 미리 설정한 특정 개수의 주제어(태그), 분야(폭소노미)를할당하는 제 308 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "에 있어서,상기 지식 생성 단계는,온톨로지 스키마를 RDF/XML 파싱하여 파싱 결과를 출력하는 RDF/XML 파싱 단계와;상기 RDF/XML 파싱 단계에서 출력된 파싱 결과를 입력받아 스키마-트리플 변환을 수행하는 스키마-트리플 변환단계와;상기 스키마-트리플 변환 단계에서 변환된 스키마-트리플과 DB-클래스 매핑 정보와 NS-Prefix 매핑 정보를 입력받고 DB-트리플 변환 규칙을 생성하는 DB-트리플 변환 규칙 생성 단계와;상기 DB-트리플 변환 규칙 생성 단계에서 생성된 DB-트리플 변환 규칙을 이용하여 URL 서버에 저장되어 있는 온톨로지 인스턴스를 인스턴스 트리플로 변환시키는 DB-트리플 변환 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "청구항 43에 있어서,상기 지식 확장 처리 단계는,스키마 기반 확장 규칙을 생성하는 지식확장 규칙 생성 단계와;상기 지식확장 규칙 생성 단계에 의해 생성된 스키마 기반 확장 규칙과 전문가가 기술한 사용자 정의 확장 규칙을 이용하고 인스턴스 트리플과 스키마 트리플을 이용하여 확장 트리플을 생성하는 지식 확장 단계와;인스턴스 트리플과 지식 확장 단계의 결과를 이용하여 동적으로 값이 변하는 유형의 확장 트리플을 생성하는 추가 지식 확장 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "청구항 43에 있어서,상기 질의 결과 처리 단계는,사용자 질의를 입력받아 변환시켜 변환 질의를 생성하는 질의 변환 단계와;이전에 입력된 질의인지 판단하는 캐시 관리 단계와;상기 질의 변환 단계에서 변환된 변환 질의를 입력받고, 캐시 관리 단계의 판단 결과를 입력받아 질의 결과를생성하는 질의 처리 단계와;상기 질의 처리 단계의 질의 결과를 입력받아 후 처리하여 후 처리 결과를 생성하는 후 처리 단계와;상기 후 처리 단계에서 생성된 후 처리 결과를 이용하여 사용자 인터페이스에 맞도록 메시지와 프로토콜을 생성하여 추론 결과를 제시하는 결과제시 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "에 있어서,상기 스토어 서비스 제공에서 비성과 정보의 공유 및 공동 문서 작업 수행은,비성과 정보를 등록할 때 수정 권한을 사용자에게 부여하여 문서를 공유할 수 있도록 처리하고, 비성과 정보의이력보기를 통해 문서의 이력정보를 확인할 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "청구항 47에 있어서,상기 프레임 서비스 제공에서 선행기술 동향 파악은,연구자나 연구팀이 수행하고자 하는 연구 분야의 성과물을 확인하거나 그 분야에 속한 전문가의 성과물을 살펴봄으로서 분석에 필요한 선행 연구 동향을 파악할 수 있도록 하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "청구항 47에 있어서,상기 프레임 서비스 제공에서 과제 평가 위원 선정 검색은,평가 대상 과제의 분야 전문가를 확인하고, 피평가자의 연구제 네트워크를 공저자 관점, 인용 관점으로 분석함으로서 이해 관계에 있는 전문가를 배제할 수 있도록 하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "청구항 47에 있어서,상기 프레임 서비스 제공에서 지역별 연구정책 결정 검색은,연구 분야 및 유형에 따라 행정 구역별로 연구 활성도를 알아볼 수 있도록 처리하고, 연구 수행이 가능한 기관과 연구자를 검색하여 해당 지역에서 육성해야 하는 연구 자원을 파악할 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_51", "content": "청구항 47에 있어서,상기 프레임 서비스 제공에서 연구자 간 협업 연구 검색은,성과물과 연구 자료를 등록할 수 있도록 처리하고, 이를 동료 연구자가 확인하고 자료를 수정하거나 추가할 수있도록 처리함으로써 이력 추적이 가능한 방식의 협업 성과물을 생산하도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "청구항 47에 있어서,상기 프레임 서비스 제공에서 선행연구동향파악은,메인 화면에서 주제를 선택하도록 하는 주제 선택 단계와;상기 주제 선택 단계 후 연구자 네트워크 선택에 의해 연구자 그룹을 확인하도록 하는 연구자 그룹 확인단계와;상기 연구자 그룹 확인 단계 후 연구자 네트워크 선택에 의해 공저자 네트워크를 확인하도록 하는 공저자 네트워크 확인 단계와;상기 공저자 네트워크 확인 단계 후 통계정보 선택에 의해 연구자간 비교 및 연구 추이 파악이 수행되도록 하는통계정보 선택 단계와;- 15 -공개특허 10-2008-0071213상기 통계정보 선택 단계 후 성과정보 선택에 의해 성과 유형별 연구 성과를 제시하도록 하는 성과정보 선택 단계와;상기 성과정보 선택 단계 후 상세보기 선택에 의해 성과 상세보기가 수행되도록 하는 상세보기 선택 단계와;상기 상세보기 선택 단계 후 연구자 정보 선택에 의해 인력 상세보기가 수행되도록 하는 연구자 정보 선택 단계와;상기 연구자 정보 선택 단계 후 연구 성과 맵 선택에 의해 지역별 연구 성과 보기가 수행되도록 하는 연구 성과맵 선택 단계와;상기 연구 성과 맵 선택 단계 후 기관 정보 선택에 의해 지역별 소속 기관 보기가 수행되도록 하는 기관정보 선택 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_53", "content": "청구항 52에 있어서,상기 주제 선택 단계는,주제가 선택되면 주제 입력 및 검색이 수행되도록 하는 것을 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_54", "content": "청구항 52에 있어서,상기 연구자 그룹 확인 단계는,연구자 네트워크 선택시 연구자 그룹을 공저자 관점에서 출력하고, 해당 분야 전문가를 출력하는 것을 특징으로하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_55", "content": "청구항 52에 있어서,상기 공저자 네트워크 확인 단계는,연구자 네트워크 선택시 스타 연구자를 중심으로 한 방사형 연구자 네트워크 또는 다수 연구자가 동일한 비중을보인 체인형 연구자 네트워크를 제공하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_56", "content": "청구항 52에 있어서,상기 통계정보 선택 단계는,통계정보 선택시 다수 연구자의 성과 추이를 비교하여 해당 분야의 연구 강도가 약화되는 정도와 최근에 해당분야 연구가 시작되는 정도를 그래프로 표시하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_57", "content": "청구항 52에 있어서,상기 성과정보 선택 단계는,성과정보 선택시 해당 분야 연구 실적을 확인하도록 해당 분야 연구 실적을 제공하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_58", "content": "청구항 52에 있어서,- 16 -공개특허 10-2008-0071213상기 상세보기 선택 단계는,상세보기 선택시 URI 기반 개체 관리 정보를 표시하고, 자동 추출된 상위 일정 개수의 주제와 분야를 표시하며,문서 미리 보기를 통해 해당 논문에 대한 내용을 확인할 수 있도록 표시하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_59", "content": "청구항 52에 있어서,상기 연구자 정보 선택 단계는,연구자 정보 선택시 추론에 의해 획득된 인력의 연구 주제와 분야를 표시하고, 국가 과학기술 인력 종합 DB와연결된 정보를 표시하며, 해당 연구자의 성과 정보를 표시하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_60", "content": "청구항 52에 있어서,상기 연구 성과 맵 선택 단계는,연구 성과 맵 선택시 광역 단위 또는 시/군/구 단위로 해당 분야의 지역 별 성과 맵을 표시하는 것을 특징으로하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_61", "content": "청구항 52에 있어서,상기 기관정보 선택 단계는,기관정보 선택시 해당 분야를 연구하는 연구자가 소속된 기관 중 해당 지역에 위치한 기관 정보를 표시하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_62", "content": "청구항 47에 있어서,상기 스토어 서비스 제공에서 특정 성과물 열람은,공통 메뉴에서 원하는 주제나 분야, 성과물 유형, 발행년도를 선택한 후, 키워드를 이용해서 검색할 수 있도록처리하고, 전체, 제목, 저자로 검색하거나 개인이 소유한 문서를 사용해서 문서를 검색할 수 있도록 처리하는것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_63", "content": "청구항 47에 있어서,상기 스토어 서비스 제공에서 성과물의 상세 정보 및 관련 정보 검색은,성과물의 메타데이터와 참여인력, 기관에 대한 상세정보를 볼 수 있도록 처리하고, 인력, 기관, 성과물을 선택한 후에는 관련 추론 서비스로 이동할 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_64", "content": "청구항 47에 있어서,상기 스토어 서비스 제공에서 성과물 등록은,사용자가 로그인을 한 후 성과물을 등록할 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법.- 17 -공개특허 10-2008-0071213청구항 65"}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_66", "content": "청구항 47에 있어서,상기 스토어 서비스 제공에서 성과물 원문 검색은,사용자가 로그인을 한 후 성과물 상세보기에서 원문을 클릭하면 원문을 다운로드 받을 수 있도록 처리하고, 사용자가 다운로드 받은 원문은 전용 뷰어에 의해 볼 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_67", "content": "청구항 47에 있어서,상기 씽크 서비스 제공에서 특정 주제나 분야를 연구하는 연구자 그룹과 전문가 검색은,공통 메뉴에서 원하는 주제나 분야를 선택하도록 한 다음 연구자 네트워크에서 해당 분야 연구자 그룹과 전문가를 확인할 수 있도록 처리하고, 연구자 네트워크로 사용자가 다시 한번 이동하면 특정 연구자 그룹의 연구자 간연구 관계를 볼 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_68", "content": "청구항 47에 있어서,상기 씽크 서비스 제공에서 특정 연구자가 연구하는 주제와 분야 확인은,연구자 정보에서 원하는 연구자를 검색한 후 사용자가 클릭하면, 해당 연구자의 연구 주제와 분야를 확인할 수있도록 처리하고, 성과정보로 이동하면 해당 연구자의 성과물을 성과 유형별로 볼 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_69", "content": "청구항 47에 있어서,상기 씽크 서비스 제공에서 특정 주제나 분야를 연구하는 지역과 기관 확인은,공통 메뉴에서 원하는 주제나 분야를 사용자가 선택한 후 연구 성과 맵으로 이동하면 지역별 현황을 볼 수 있도록 처리하고, 특정 지역을 선택한 후 기관정보로 이동하면 관련 기관의 정보를 확인할 수 있도록 처리하는 것을특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_70", "content": "청구항 47에 있어서,상기 씽크 서비스 제공에서 여러 연구자들의 성과 추이 비교는,연구자 네트워크 또는 연구자 정보에서 연구자들을 선택하고, 통계정보로 이동하면, 해당 연구자들의 성과를 그래프를 통해 일정 기간 단위별로 확인할 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_71", "content": "청구항 47에 있어서,- 18 -공개특허 10-2008-0071213상기 씽크 서비스 제공에서 연구자, 기관, 주제에 대한 상세 정보 확인은,상기 씽크 서비스 제공 화면에서 연구자, 기관, 주제를 선택하면, 상세보기를 통해 상세 정보를 확인할 수 있도록 처리하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_72", "content": "청구항 6에 있어서,상기 제 5 단계는,공저자 네트워크, 인용 네트워크, 학연 네트워크를 구축하는 제 401 단계와;상기 제 401 단계 후 구축된 네트워크를 인력 중심으로 통합하여 통합 연구자 네트워크를 구축하는 제 402 단계와;상기 제 402 단계 후 통합 연구자 네트워크 서비스를 제공하는 제 403 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_73", "content": "청구항 6에 있어서,상기 제 5 단계는,연구자 자료를 수집하는 제 411 단계와;상기 제 411 단계에서 수집된 자료를 이용하여 연구자 간의 친밀도를 계산하는 제 412 단계와;상기 제 412 단계 후 계산된 친밀도를 이용하여 시각화를 수행하는 제 413 단계;를 포함하여 수행하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_74", "content": "청구항 73에 있어서,상기 제 411 단계는,링크 거리, 링크 타입(공저자, 인용, 소속 중에서 하나 이상 포함), 주제 또는 분야(인적, 문헌적 주제 또는 분야 포함), 성과 유형 가중치(논문 또는 보고서 포함), 링크 강도(수량 또는 가중치에 의한 링크 강도 포함) 중에서 하나 이상을 포함한 자료를 수집하여 상기 제 412 단계에서의 친밀도 계산에 이용하도록 하는 것을 특징으로 하는 시맨틱 웹 기반 연구정보 서비스 방법."}
{"patent_id": "10-2006-0130706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_75", "content": "청구항 73에 있어서,상기 제 413 단계는,지역별, 기관별 주제와 분야 추이를 시각화하거나 또는 연구그룹간 지역별, 기관별 협력 연구 추이를 시각화하거나 또는 공저자 사이의 관계를 시각화하거나 또는 연구자 사이의 인용-피인용 관계를 시각화하거나 또는 시간축에서의 친밀도를 시각화하는 것 중에서 하나 이상의 시각화를 수행하는 것을 특징으로 하는 시맨틱 웹 기반연구정보 서비스 방법.명 세 서발명의 상세한 설명 발명의 목적 종래기술의 문헌 정보- 19 -공개특허 10-2008-0071213[1] 이원주, 김승연, 전창호: P2P 환경에 유효한 허위 데이터 감축 알고리즘. 한국정보과학회 한국컴퓨터종합학 <105>술대회 (2005) [2] Clarke, I., Sandberg, O., Wiley, B., and Hong, T. : Freenet : A Distributed Anonymous Information <106>Storage and Retrieval System. Proceedings of the International Workshop on Designing Privacy EnhancingTechnologies. Springer-verlag (2000) [3] 이혜주, 최범석, 홍진우, 석종원: 디지털 방송 콘텐츠 보호 유통 시스템 설계 및 구현. 한국정보처리학회 <107>논문지. Vol. 11-C. No. 6 (2004) [4] 최성원, 이상환, 이상기, 조성남, 석중호 : 식별체계와 공개키 기반의 디지털 콘텐트 유통모델 연구. 한국 <108>정보과학회 추계학술대회 (2004) [5] DVB CPCM Functional Model Definitions and Applications. DVB-CPT (2003) <109>[6] Jung, H., Seon, C., Kim, J., Son, J., Sung, W., and Park, D. : Information Extraction for User's <110>Utterance Processing on Ubiquitous Robot Companion. LNCS 0302-9743. Springer-verlag (2005) [7] Seon, C., Jung, H., Kim, J., and Son, C : Formal Description Generation from Users Query on Web- <111>based Service Platform. Proceedings of the 1st International Workshop on Intelligent and UbiquitousRobotics (2004) [8] CAS : http://www.triplestore.aktors.org/demo/AKTiveSpace/ <112>[9] SEAL : http://www.aifb.uni-karlsruhe.de/Projekte/viewProjektenglish?id_db=58 <113> 발명이 속하는 기술 및 그 분야의 종래기술본 발명은 연구정보 서비스에 관한 것으로, 특히 차세대 지능형 웹으로 컴퓨터가 정보의 의미를 이해하고 정보 <114>들 간의 논리적 추론까지 할 수 있는 시맨틱 웹(semantic web) 기술을 활용하여 연구 개발(Research andDevelopment, R&D) 전주기 지원서비스 플랫폼을 구축하여 연구기획에 필요한 연구동향은 물론이고 최적의 협력연구자 선정, 지역별/연구분야별 특색에 맞는 정확한 정책수립 등에 필요한 모든 정보를 효율적으로 파악하기에적당하도록 한 시맨틱 웹 기반 연구정보 서비스 시스템 및 그 방법에 관한 것이다.일반적으로 시맨틱 웹 기술은 컴퓨터가 정보자원의 뜻을 이해하고, 논리적 추론까지 할 수 있는 차세대 지능형 <115>웹을 말한다. 현재의 컴퓨터처럼 사람이 마우스나 키보드를 이용해 원하는 정보를 찾아 눈으로 보고 이해하는웹이 아니라, 컴퓨터가 이해할 수 있는 웹을 말한다. 즉, 사람이 읽고 해석하기에 편리하게 설계되어 있는 현재의 웹 대신에 컴퓨터가 이해할 수 있는 형태의 새로운 언어로 표현해 기계들끼리 서로 의사소통을 할 수 있는지능형 웹이다.시맨틱 웹의 원리는 사람들이 이해할 수 있도록 자연어 위주로 되어 있는 현재의 웹 문서와 달리, 정보자원들 <116>사이에 연결되어 있는 의미를 컴퓨터가 이해할 수 있는 형태의 언어로 바꾸는 것이다. 이렇게 되면 컴퓨터가 정보자원의 뜻을 해석하고, 기계들끼리 서로 정보를 주고받으면서 자체적으로 필요한 일을 처리하는 것이 가능해진다.2004년 현재 시맨틱 웹과 관련된 연구는 RDF(Resource Description Framework)를 기반으로 한 온톨로지 기술과 <117>국제표준화기구(International Organization for Standardization, ISO) 중심의 토픽 맵(Topic Map) 기술이 주류를 이루고 있다. 전자는 현재의 웹에 자원(주어)/속성(술어)/속성값(목적어) 등 자원을 기술하는 언어인 메타데이터를 부여해 정보의 의미를 이해하고 처리할 수 있게 하는 기술이다. 후자는 ISO의 XML(eXtensible MarkupLanguage) 기반 표준 기술언어인 XTM(XML Topic Maps) 언어를 이용해 정보와 지식의 분산 관리를 지원하는 기술로, 지식층과 정보층의 이중 구조를 띤다.이러한 시맨틱 웹이 실현되면 컴퓨터가 자동으로 정보를 처리할 수 있어 정보시스템의 생산성과 효율성이 극대 <118>화된다. 컴퓨터 혼자 전자상거래를 할 수 있고, 기업의 시스템 통합(System Integration, SI), 지능형 로봇 시스템, 의료 정보화 등 다양한 분야에 응용할 수 있다.그러나 종래에는 이러한 시맨틱 웹을 적용한 분야가 적었을 뿐만 아니라, 연구기획에 필요한 연구동향을 효율적 <119>으로 파악할 수 있는 기술은 없었다.즉, 그동안 연구자들은 연구기획, 협업 연구자 선정 및 연구방향을 등을 설정하는데 많은 시간과 노력을 들여야 <120>- 20 -공개특허 10-2008-0071213만 했다.예를 들어, 연구자 A 씨는 '인공지능' 분야에 대한 연구를 기획하고 정보를 찾기 위해 검색 사이트를 뒤졌으나 <121>시작부터 난감한 일을 겪게 된다. '인공지능'이란 단어가 들어 있는 엄청난 양이 정보들 사이에서 헤매는 바람에 쓸데없이 시간과 노력을 허비하고야 말았던 것이다.또한 연구자 B 씨는 함께 연구를 수행할 전문가들을 찾으려 했다가 어려움을 겪었다. 일반 검색 사이트는 물론 <122>이고, 인맥을 동원해 전문가를 찾아 나섰지만 최적의 전문가를 찾기에는 정보 등이 부족했기 때문이다.따라서 이들 A와 B 연구자들의 고민을 한 번에 날려줄 수 있는 '연구개발(R&D) 전주기 지원서비스 플랫폼'(여기 <123>서 플랫폼이란 서비스의 기반이 되는 하드웨어와 소프트웨어를 말한다)을 구축하여 연구기획에 필요한 연구동향등을 효율적으로 파악할 수 있는 기술의 필요성이 대두된 것이다. 발명이 이루고자 하는 기술적 과제이에 본 발명은 상기와 같은 종래의 제반 문제점을 해결하기 위해 제안된 것으로, 본 발명의 목적은 차세대 지 <124>능형 웹으로 컴퓨터가 정보의 의미를 이해하고 정보들 간의 논리적 추론까지 할 수 있는 시맨틱 웹 기술을 활용하여 연구 개발 전주기 지원서비스 플랫폼을 구축하여 연구기획에 필요한 연구동향은 물론이고 최적의 협력 연구자 선정, 지역별/연구분야별 특색에 맞는 정확한 정책수립 등에 필요한 모든 정보를 효율적으로 파악할 수 있는 시맨틱 웹 기반 연구정보 서비스 시스템 및 그 방법을 제공하는데 있다.상기와 같은 목적을 달성하기 위하여 본 발명의 일실시예에 의한 시맨틱 웹 기반 연구정보 서비스 시스템은, <125>URI 기반과 DBMS 기반 하에 지식 처리를 수행하여 지식정보 공유 서비스가 제공될 수 있도록 처리하는 지식 처 <126>리부와; 상기 지식 처리부에서 처리된 결과를 제공받고, 시맨틱 웹에 기반하여 연구정보의 등록과 검색 처리 및통계 서비스를 제공하는 정보 유통 서비스부와; 상기 지식 처리부에서 처리된 결과를 제공받고, 팩트, 규칙 및후처리를 통해 연구개발 정보에서 명시적으로 드러나 있지 않은 간접적인 정보를 발굴하여 제공하는 추론 서비스부;를 포함하여 이루어짐을 그 기술적 구성상의 특징으로 한다.상기와 같은 목적을 달성하기 위하여 본 발명의 일실시예에 의한 시맨틱 웹 기반 연구정보 서비스 방법은, <127>인력개체 확인을 통해 동명저자의 중의성을 해소하는 제 1 단계와; 상기 제 1 단계 후 URI 기반 처리를 수행하 <128>여 URI 기반 저자 인용관계 및 네트워크를 구축하고, URI 기반의 성과정보를 관리하는 제 2 단계와; 상기 제 2단계 후 입력된 원문에 대해 주제와 분야를 할당하는 제 3 단계와; 상기 제 3 단계 후 DBMS에 기반하여 지식을확장하고 추론하며, 정보유통 서비스부와 추론 서비스부를 이용하는 사용자의 질의를 처리하는 제 4 단계와; 상기 제 4 단계 후 정보유통 서비스와 추론 서비스를 제공하는 제 5 단계;를 포함하여 수행함을 그 기술적 구성상의 특징으로 한다. 발명의 구성 및 작용이하, 상기와 같은 본 발명, 시맨틱 웹 기반 연구정보 서비스 시스템 및 그 방법의 기술적 사상에 따른 일실시 <129>예를 도면을 참조하여 설명하면 다음과 같다.도 1은 본 발명의 일 실시예에 의한 시맨틱 웹 기반 연구정보 서비스 시스템의 블록구성도이다. <130>이에 도시된 바와 같이, URI(Universal Resource Identifier) 기반과 DBMS(database management system) 기반 <131>하에 지식 처리를 수행하여 지식정보 공유 서비스가 제공될 수 있도록 처리하는 지식 처리부(100)와; 상기 지식처리부(100)에서 처리된 결과를 제공받고, 시맨틱 웹에 기반하여 연구정보의 등록과 검색 처리 및 통계 서비스를 제공하는 정보 유통 서비스부(200)와; 상기 지식 처리부(100)에서 처리된 결과를 제공받고, 팩트(Fact), 규칙 및 후처리를 통해 연구개발 정보에서 명시적으로 드러나 있지 않은 간접적인 정보를 발굴하여 제공하는 추론서비스부(300);를 포함하여 구성된 것을 특징으로 한다.상기 지식 처리부(100)는, 동명저자의 중의성을 해소하는 인력개체 확인부(110)와; 상기 인력개체 확인부(110) <132>의 확인결과를 전달받고, URI 기반 하에서 저자 인용관계 및 네트워크를 구축하고 URI 기반의 성과정보를 관리하는 URI 기반 처리부(120)와; 입력된 원문에 대해 주제와 분야를 할당하는 주제/분야 할당부(130)와; 상기 URI기반 처리부(120)의 처리결과를 전달받고, 상기 주제/분야 할당부(130)에서 할당된 결과를 전달받으며, DBMS에기반하여 지식을 확장하고 추론하며, 상기 정보유통 서비스부(200)와 상기 추론 서비스부(300)를 이용하는 사용자의 질의를 처리하는 DBMS 기반 지식확장 및 추론부(140);를 포함하여 구성된 것을 특징으로 한다.- 21 -공개특허 10-2008-0071213도 2는 도 1에서 정보유통 서비스부와 추론 서비스부 및 그 주변블록의 상세블록도이다. <133>이에 도시된 바와 같이, 상기 정보유통 서비스부(200)는, 상기 정보 유통 서비스부(200)에서 보고서, 논문, 특 <134>허 중에서 하나 이상을 포함한 성과 정보 및 비성과 정보를 등록하고 관리하는 정보 등록/관리 서비스부(210);상기 정보 유통 서비스부(200)에서 관련성과와 참조성과의 검색 서비스를 제공하는 관련성과/참조성과 검색 서비스부(220); 상기 정보 유통 서비스부(200)에서 연구개발 정보에서 주제와 분야에 대한 세부정보를 열람할 수있도록 하는 주제/분야 세부정보 열람 서비스부(230); 상기 정보 유통 서비스부(200)에서 연구개발 정보에 대한통계 정보를 제공하는 통계 서비스부(240); 중에서 하나 이상을 포함하여 구성된 것을 특징으로 한다.상기 추론 서비스부(300)는, 상기 추론 서비스부(300)에서 연구자 네트워크를 제공하는 연구자 네트워크 서비스 <135>부(310); 상기 추론 서비스부(300)에서 연구자 정보를 제공하는 연구자 정보 서비스부(320); 상기 추론 서비스부(300)에서 연구 성과 맵을 제공하는 연구 성과 맵 서비스부(330); 상기 추론 서비스부(300)에서 성과정보를제공하는 성과정보 서비스부(340); 상기 추론 서비스부(300)에서 기관정보를 제공하는 기관정보 서비스부(350);상기 추론 서비스부(300)에서 통계정보를 제공하는 통계정보 서비스부(360); 상기 추론 서비스부(300)에서 통합연구자 네트워크 서비스를 제공하는 통합 연구자 네트워크 서비스부(370); 상기 추론 서비스부(300)에서 연구자친밀도 서비스를 제공하는 연구자 친밀도 서비스부(380); 중에서 하나 이상을 포함하여 구성된 것을 특징으로한다.상기 시맨틱 웹 기반 연구정보 서비스 시스템은, 인력, 기관, 보고서, 논문, 특허, 주제, 분야에 대한 URI 등록 <136>및 관리를 수행하고, 레퍼렌셜 아이덴티티(Referential Identity) 검색 기능을 제공하는 URI 등록/관리 서비스부(410), 시소러스 기반 자동 분류를 수행하여 주제와 분야에 대한 분류 서비스를 제공하는 주제/분야 분류 서비스부(420)를 구비한 공통 서비스부(400);를 더욱 포함하여 구성된 것을 특징으로 한다.도 3은 본 발명의 일 실시예에 의한 시맨틱 웹 기반 연구정보 서비스 방법을 보인 흐름도이다. <137>이에 도시된 바와 같이, 인력개체 확인을 통해 동명저자의 중의성을 해소하는 제 1 단계(ST1)와; 상기 제 1 단 <138>계 후 URI 기반 처리를 수행하여 URI 기반 저자 인용관계 및 네트워크를 구축하고, URI 기반의 성과정보를 관리하는 제 2 단계(ST2)와; 상기 제 2 단계 후 입력된 원문에 대해 주제와 분야를 할당하는 제 3 단계(ST3)와; 상기 제 3 단계 후 DBMS에 기반하여 지식을 확장하고 추론하며, 정보유통 서비스부(200)와 추론 서비스부(300)를이용하는 사용자의 질의를 처리하는 제 4 단계(ST4)와; 상기 제 4 단계 후 정보유통 서비스(OntoStore-K)와 추론 서비스(OntoThink-K)를 제공하는 제 5 단계(ST5);를 포함하여 수행하는 것을 특징으로 한다.도 4는 도 3에서 인력개체 확인 수행시 온톨로지 인스턴스의 sameAs 관리 시스템의 블록구성도이고, 도 5는 도 <139>3에서 인력개체 확인 수행시 온톨로지 인스턴스의 sameAs 관리 방법을 상세히 보인 흐름도이다.이에 도시된 바와 같이, 상기 제 1 단계는, sameAs 관리에 의한 인력 개체 확인 수행시, 온톨로지 인스턴스들의 <140>sameAs 관계를 확인하거나 설정하거나 또는 해제하여 관리하는 제 10 단계(ST11 ~ ST13)와; 상기 제 10 단계에서 sameAs 관계 설정과 해제에 대한 입력을 받고, 온톨로지 인스턴스 데이터 내에서 관련 지식을 수정하는 제20 단계(ST21, ST22)와; 상기 제 20 단계에서 수정된 지식을 이용하고, 사용자 질의를 처리하고 sameAs 후 처리를 수행하여 결과를 제시하는 제 30 단계(ST31 ~ ST33);를 더욱 포함하여 수행하는 것을 특징으로 한다.상기 제 10 단계는, 온톨로지 내에 기존에 설정된 sameAs 관계로 얻어지는 sameAs 개체 쌍들과 sameAs 그룹들을 <141>확인하는 제 11 단계(ST11)와; 상기 제 11 단계 후 임의의 두 개체 쌍에 대해 신규로 sameAs 관계를 설정하는제 12 단계(ST12)와; 상기 제 11 단계 후 기존에 설정된 sameAs 개체 쌍의 sameAs 개체 관계를 해제하는 제 153단계(ST13);를 포함하여 수행하는 것을 특징으로 한다.상기 제 20 단계는, 상기 제 20 단계(특히, ST12)로부터 개체 쌍의 sameAs 설정에 대한 입력을 받아 sameAs 관 <142>계를 맺을 두 개체와 관련된 지식들을 수정하는 제 21 단계(ST21)와; 상기 제 10 단계(특히, ST13)로부터 개체쌍의 sameAs 해제에 대한 입력을 받아 sameAs 관계를 해제할 두 개체와 관련된 지식들을 수정하는 제 22 단계(ST22);를 포함하여 수행하는 것을 특징으로 한다.상기 제 30 단계는, 사용자 질의를 입력받아 처리 결과를 생성하는 제 31 단계(ST31)와; 상기 제 31 단계에서 <143>제시한 질의 처리 결과에 나타난 개별 개체들에 대해, sameAs 관계로 연결된 sameAs 개체 집합을 찾고, sameAs개체 집합의 대표 개체를 찾아, 찾아진 대표 개체로 교체하는 제 32 단계(ST32)와; 상기 제 32 단계의 결과를받아 사용자 인터페이스에 맞도록 출력 메시지를 생성하는 제 33 단계(ST33);를 포함하여 수행하는 것을 특징으로 한다.- 22 -공개특허 10-2008-0071213도 10은 도 3에서 인력개체 확인 수행시 원문으로부터의 정보추출기법을 사용한 동명저자 중의성 해소 방법을 <144>보인 흐름도이다.이에 도시된 바와 같이, 상기 제 1 단계는, 인력개체 확인 수행시, 원문으로부터의 정보추출기법을 사용하여 동 <145>명저자의 중의성을 해소하기 위해, 대용량 과학 기술 문헌의 탐색 및 검색을 수행할 때 논문 서지 정보를 자동추출하는 제 41 단계(ST41)와; 대용량 과학 기술 문헌의 탐색 및 검색 수행시, 논문 원문 내의 정보 추출에 의해 동명 저자 중의성 해소 정보를 자동 추출하는 제 42 단계(ST42)와; 상기 제 41 단계와 상기 제 42 단계에서추출된 정보 중에서 하나 이상의 정보를 이용하여 동명 저자의 중의성을 해소하도록 적용하는 제 43 단계(ST43);를 포함하여 수행하는 것을 특징으로 한다.상기 제 41 단계는, 공동 저자명, 논문 제목, 게재지명과 게재년도를 포함한 게재정보 중에서 하나 이상의 논문 <146>서지 정보를 자동 추출하는 것을 특징으로 한다.상기 제 42 단계는, 저자의 전자메일 주소, 논문작성 당시의 저자의 소속기관정보, 논문을 다루는 분야에 대한 <147>키워드(들), 논문의 연구를 지원한 연구과제번호 정보, 논문을 작성한 저자의 저술 스타일, 논문 원문 텍스트내의 용어 집합 중에서 하나 이상의 동명 저자 중의성 해소 정보를 자동 추출하는 것을 특징으로 한다.도 11은 도 3에서 URI 기반 처리 수행시 URI 기반 네트워크 구축의 예를 보인 흐름도이다. <148>이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 처리 수행시 URI 기반 네트워크 구축을 위해, 논문 원문 <149>수집과 텍스트 변환을 통해 인용정보를 추출하는 인용정보 추출 단계(1)와; 상기 인용정보 추출 단계 후 URI 기반으로 객체인 논문의 인용관계를 구축하는 문헌기반 인용관계 구축 단계(2)와; 상기 문헌기반 인용관계 구축단계 후 URI 기반으로 인력인 저자의 인용관계를 구축하는 저자기반 인용관계 구축 단계(3)와; 상기 저자기반인용관계 구축 단계 후 인용과 피인용의 관계를 이용하여 정보의 흐름을 파악하고 이를 이용해서 특정 지역 및특정 분야의 지식의 구조와 흐름을 파악하도록 하는 인용 네트워크를 구축하는 인용 네트워크 구축 단계(4);를더욱 포함하여 수행하는 것을 특징으로 한다.도 12는 도 11에서 인용정보 추출 단계의 상세흐름도이다. <150>이에 도시된 바와 같이, 상기 인용정보 추출 단계는, 참고문헌 영역을 결정하는 참고문헌 영역 확인 단계(1.1) <151>와; 상기 참고문헌 영역 확인 단계 후 인용 정보를 추출하는 인용 정보 추출 단계(1.2)와; 상기 인용 정보 추출단계 후 인용 정보의 메타데이터를 추출하는 인용 정보 메타데이터 추출 단계(1.3);를 포함하여 수행하는 것을특징으로 한다.도 13은 도 12에서 인용정보 메타데이터 추출 단계의 상세흐름도이다. <152>이에 도시된 바와 같이, 상기 인용 정보 메타데이터 추출 단계는, 논문 원문 수집과 텍스트 변환을 통해 인용정 <153>보에서 공백제거 및 오류제거를 수행하는 공백제거 및 오류제거 단계(1.3.1)와; 상기 공백제거 및 오류제거 단계 후 문자열을 구분기호로 분리하는 문자열을 구분기호로 분리하는 단계(1.3.2)와; 상기 문자열을 구분기호로분리하는 단계 후 인용 문헌의 서지정보로부터 정보를 추출하는 정보추출 단계(1.3.3)와; 상기 정보추출 단계후 메타데이터의 필드를 하나의 정규화된 데이터로 변환시키는 정규화 단계(1.3.4);를 포함하여 수행하는 것을특징으로 한다.상기 인용 정보 메타데이터 추출 단계는, 인용 문헌의 서지정보로부터 학회필드, 학술대회필드, 권(Volume) 필 <154>드, 호(Issue) 필드, 연도필드에 해당하는 정보(1.3.3.1 ~ 1.3.3.5)를 추출하는 것을 특징으로 한다.도 17은 도 11에서 문헌기반 인용관계 구축 단계의 상세흐름도이다. <155>이에 도시된 바와 같이, 상기 문헌기반 인용관계 구축 단계는, 인용 정보 중에서 제목을 추출하는 참고 문헌 제 <156>목 추출 단계(2.1)와; 상기 참고 문헌 제목 추출 단계 후 문헌 제목을 이용하여 문헌 간에 인용 네트워크를 구축하여 객체 URI 저장소의 URI를 획득하는 객체 URI 저장소 URI 획득 단계(2.2)와; 상기 객체 URI 저장소 URI획득 단계 후 문헌에 해당하는 객체 URI 저장소 내에 저장되어 있는 객체 URI를 이용하여 문헌 중심의 인용 관계를 구축하여 객체 URI의 인용과 피인용 관계를 구축하는 객체 URI 인용-피인용 관계구축 단계(2.3);를 포함하여 수행하는 것을 특징으로 한다.도 18은 도 11에서 저자기반 인용관계 구축 단계의 상세흐름도이다. <157>이에 도시된 바와 같이, 상기 저자기반 인용관계 구축 단계는, 인용-피인용으로 연결된 문헌 URI 쌍으로부터 하 <158>나의 문헌 URI를 획득하여 객체 URI를 획득하는 객체 URI 획득 단계(3.1)와; 상기 객체 URI 획득 단계 후 개별- 23 -공개특허 10-2008-0071213문헌 URI의 저자에 해당하는 인력 URI를 URI 서버로부터 획득함으로써 객체 URI의 이용에 의해 저자 URI를 획득하는 객체 URI 이용 저자 URI 획득 단계(3.2)와; 상기 객체 URI 이용 저자 URI 획득 단계 후 문헌 URI 쌍으로묶인 두 문헌의 저자 URI 집합들간에 인용-피인용 관계를 생성하여 저자 URI의 인용-피인용 관계를 구축하는 저자 URI 인용-피인용 관계구축 단계(3.3);를 포함하여 수행하는 것을 특징으로 한다.도 21은 도 3에서 URI 기반 처리 수행시 URI 기반 성과 정보 관리 시스템의 블록구성도이고, 도 22는 도 3에서 <159>URI 기반 처리 수행시 URI 기반 성과 정보 관리 방법을 보인 흐름도이다.이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 성과 정보 관리 수행시, 성과 정보를 등록하고 관리하는 <160>성과 정보 관리 단계(ST101 ~ ST103, ST105)와; 상기 성과 정보 관리 단계에서 관리된 성과 정보에 URI를 부여하고 관리하는 URI 관리 단계(ST104)와; 상기 성과 정보 관리 단계와 상기 URI 관리 단계에서 관리된 성과 정보가 시맨틱 웹 기반 추론 서비스에 적용되도록 지식을 확장하는 지식 확장 단계(ST106);를 더욱 포함하여 수행하는 것을 특징으로 한다.상기 성과 정보 관리 단계(ST101 ~ ST103, ST105)는, 성과 정보 등록 인터페이스를 통해 등록자가 성과 정보와 <161>해당 성과물을 등록하도록 하는 제 101 단계(ST101)와; 상기 제 101 단계를 통해 등록자가 입력한 정보가 올바른지 확인하는 제 102 단계(ST102)와; 상기 제 102 단계에서 확인된 성과 정보에 대해 성과 가중치를 부여하거나, 성과 정보 또는 성과물로부터 통제된 주제 또는 분야 등을 추출하여 할당하는 제 103 단계(ST103)와; 상기제 103 단계에서 등록된 성과 정보에 대한 관리자 검증 과정이 수행되도록 하는 제 105 단계(ST105);를 포함하여 구성된다.상기 URI 관리 단계(ST104)는, 상기 성과 정보 관리 단계에서 관리하는 성과 정보를 등록 및 관리하고, 성과 정 <162>보에 URI를 부여하고, 성과 정보로부터 RDF 트리플이나 RDF XML을 추출하여 정보를 지식화시켜 지식 확장에 사용할 수 있도록 하는 것을 포함하여 수행하는 것을 특징으로 한다.상기 지식 확장 단계(ST106)는, 확장된 지식이 SPARQL, RDQL을 포함한 시맨틱 웹 질의 언어를 이용하여 추론 결 <163>과를 얻는 데 참조되도록 하는 것을 특징으로 한다.도 23은 도 22에서 성과 정보 등록을 상세히 보인 상세흐름도이다. <164>이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 성과 정보 등록 수행시, 성과 정보에 대해 중복 및 오류를 <165>검증하고 성과 정보 객체 URI를 할당하는 제 111 단계(ST111 ~ ST112)와; 상기 제 111 단계 후 해당 성과 정보를 DB-트리플/XML로 변환하는 제 112 단계(ST113)와; 상기 제 112 단계 후 최종적으로 변환 완료된 성과 정보를저장하는 제 113 단계(ST114 ~ ST115);를 포함하여 수행하는 것을 특징으로 한다.도 24는 도 22에서 성과 정보 승인을 상세히 보인 상세흐름도이다. <166>이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 성과 정보 등록 수행시, 관리자에 의해 성과 정보를 승인 <167>하는 제 121 단계(ST121)와; 상기 제 121 단계 후 해당 성과 정보 객체 URI를 이용하여 성과 정보 RDF 트리플/XML을 획득하는 제 122 단계(ST122 ~ ST123)와; 상기 제 122 단계 후 추론 규칙을 적용하여 지식을 확장하는제 123 단계(ST124)와; 상기 제 123 단계에서의 확장 완료 후 성과 정보의 상태를 변경하는 제 124 단계(ST125~ ST126);를 포함하여 수행하는 것을 특징으로 한다.도 25는 도 22에서 성과 정보 초기화를 상세히 보인 상세흐름도이다. <168>이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 성과 정보 등록 수행시, 성과 정보 관리부(도 21 참조)에 <169>서 URI 관리부(도 21 참조)로 초기화 명령을 전달하는 제 131 단계(ST131)와; 상기 제 131 단계 후 상기 URI 관리부가 초기화 되도록 하고, 상기 URI 관리부에서 상기 성과 정보 관리부로 초기화 결과를 전달하는 제 132 단계(ST132 ~ ST133)와; 상기 제 132 단계 후 상기 성과 정보 관리부에서 지식 확장부(도 61 참조)로 초기화 명령을 전달하는 제 133 단계(ST134)와; 상기 제 133 단계 후 상기 지식 확장부가 초기화 되도록 하고, 상기 지식확장부에서 상기 성과 정보 관리부로 초기화 결과를 전달하는 제 134 단계(ST135 ~ ST136)와; 상기 제 134 단계후 상기 성과 정보 관리부가 초기화 되도록 하는 제 135 단계(ST137);를 포함하여 수행하는 것을 특징으로한다.도 26은 도 22에서 성과 정보 삭제를 상세히 보인 상세흐름도이다. <170>이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 성과 정보 등록 수행시, 성과 정보 관리부에서 URI 관리부 <171>로 성과 정보 객체 URI를 전달하는 제 141 단계(ST141)와; 상기 제 141 단계 후 상기 URI 관리부에서 성과 정보- 24 -공개특허 10-2008-0071213를 삭제하고, 상기 URI 관리부에서 상기 성과 정보 관리부로 삭제 결과를 전달하는 제 142 단계(ST142 ~ ST143)와; 상기 제 142 단계 후 상기 성과 정보 관리부에서 지식 확장부로 성과 정보 객체 URI를 전달하는 제 143단계(ST144)와; 상기 제 143 단계 후 상기 지식 확장부에서 성과 정보를 삭제하고, 상기 지식 확장부에서 상기성과 정보 관리부로 삭제 결과를 전달하는 제 144 단계(ST145 ~ ST146)와; 상기 제 144 단계 후 상기 성과 정보관리부에서 성과 정보를 삭제하는 제 145 단계(ST147);를 포함하여 수행하는 것을 특징으로 한다.도 27은 도 22에서 성과 정보 수정을 상세히 보인 상세흐름도이다. <172>이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 성과 정보 등록 수행시, 성과 정보 관리부에서 URI 관리부 <173>로 성과 정보 객체 URI가 포함된 성과 정보를 전달하는 제 151 단계(ST151)와; 상기 제 151 단계 후 상기 URI관리부는 성과 정보를 대체하고, 상기 성과 정보 관리부로 성과 정보 객체 URI를 전달하는 제 152 단계(ST152 ~ST153)와; 상기 제 152 단계 후 상기 성과 정보 관리부는 지식 확장부로 성과 정보 객체 URI를 전달하는 제 153단계(ST154)와; 상기 제 153 단계 후 상기 지식 확장부는 성과 정보를 삭제하고, 상기 URI 관리부로 성과 정보객체 URI를 전달하는 제 154 단계(ST155 ~ ST156)와; 상기 제 154 단계 후 상기 URI 관리부는 상기 지식 확장부로 RDF 트리플/XML을 전달하는 제 155 단계(ST157)와; 상기 제 155 단계 후 상기 지식 확장부는 지식을 확장하고, 확장 결과를 상기 성과 정보 관리부로 전달하는 제 156 단계(ST158, ST159)와; 상기 제 156 단계 후 상기성과 정보 관리부는 성과 정보 객체 URI가 포함된 성과 정보를 저장하는 제 157 단계(ST160);를 포함하여 수행하는 것을 특징으로 한다.도 28은 도 22에서 성과 정보 상태 변경을 상세히 보인 상세흐름도이다. <174>이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 성과 정보 등록 수행시, 성과 정보가 등록되면 설정되는 <175>승인 대기 상태와; 승인 대기 상태에 있는 성과 정보에 대해 관리자가 승인을 선택하면 설정되는 승인 완료 상태와; 승인 대기 상태에 있는 성과 정보에 대해 관리자가 승인을 거절하면 설정되는 승인 거절 상태와; 승인 대기 상태, 승인 완료 상태, 승인 거절 상태에서 삭제가 이루어지면 문서가 삭제되도록 설정되는 문서 삭제 상태;를 포함하여 구성된 것을 특징으로 한다.도 29는 도 22에서 URI 관리에 사용되는 RDF 트리플의 일 예를 보인 표이다. <176>이에 도시된 바와 같이, 상기 제 2 단계는, URI 기반 성과 정보 등록 수행시, DBMS를 이용하여 RDF 트리플을 관 <177>리하고, 성과 정보, 비성과 정보, 온톨로지 스키마에 따라 RDF 트리플 유형을 구분하고 관리하며, 상태 필드를이용하여 RDF 트리플 이용 여부를 확인하는 것을 포함하여 수행하는 것을 특징으로 한다.도 30은 도 3에서 주제/분야 할당 수행시 통계기반 문서분류를 통한 시소러스 확장 방법 및 하이브리드 문서 분 <178>류 방법을 보인 흐름도이다.이에 도시된 바와 같이, 상기 제 3 단계는, 통계 기반 문서 분류를 수행하는 제 201 단계(ST201)와; 상기 제 31 <179>단계 후 시소러스를 확장하는 제 202 단계(ST202)와; 상기 제 202 단계 후 택소노미를 이용하여 분야분류체계-시소러스 간 매핑을 수행하는 제 203 단계(ST203)와; 상기 제 203 단계 후 시소러스 기반 문서 분류를 수행하는제 204 단계(ST204); 상기 제 204 단계 후 통계 기반 문서 분류와 시소러스 기반 문서 분류를 결합하여 하이브리드 기반 문서 분류를 수행하는 제 205 단계(ST205)와; 상기 제 205 단계 후 분류결과를 평가하고 정답 문서집합을 작성한 다음 상기 제 201 단계로 리턴하는 제 206 단계(ST206, ST207);를 더욱 포함하여 수행하는 것을특징으로 한다.도 31은 도 30에서 통계 기반 문서 분류의 상세흐름도이다. <180>이에 도시된 바와 같이, 상기 제 201 단계는, 실험 문서 집합, 분야 분류 체계, 정답 문서 집합을 입력받아 자 <181>질을 추출하는 제 211 단계(ST211)와; 상기 제 211 단계 후 기계 학습을 수행하는 제 212 단계(ST212)와; 상기제 212 단계 후 문서 분류를 수행하는 제 213 단계(ST213)와; 상기 제 213 단계 후 자질 집합을 형성한 다음 제211 단계로 리턴하는 제 214 단계(ST214);를 포함하여 수행하는 것을 특징으로 한다.도 32는 도 30에서 시소러스 확장의 상세흐름도이다. <182>이에 도시된 바와 같이, 상기 제 202 단계는, 통계 기반 문서 분류를 수행하는 제 221 단계(ST221)와; 상기 제 <183>221 단계의 통계 기반 문서 분류로부터 자질 집합을 얻는 제 222 단계(ST222)와; 상기 제 222 단계에서 얻어진자질 집합으로부터 키워드들을 선정하는 제 223 단계(ST223)와; 상기 제 223 단계에서 선정된 키워드들을 용어후보로 결정하는 제 224 단계(ST224)와; 상기 제 224 단계 후 시소러스를 구축한 다음 상기 제 221 단계로 리턴- 25 -공개특허 10-2008-0071213하는 제 225 단계(ST225);를 포함하여 수행하는 것을 특징으로 한다.도 33은 도 30에서 분야분류체계-시소러스 간 매핑의 상세흐름도이다. <184>이에 도시된 바와 같이, 상기 제 203 단계는, 각 분야분류명을 위한 택소노미를 도입하는 제 231 <185>단계(ST231)와; 상기 제 231 단계에서 도입된 택소노미에 속한 키워드들을 시소러스에 매핑시키는 제 232 단계(ST232);를 포함하여 수행하는 것을 특징으로 한다.도 34는 도 30에서 시소러스 기반 문서 분류의 상세흐름도이다. <186>이에 도시된 바와 같이, 상기 제 204 단계는, 문서를 입력하도록 하는 제 241 단계(ST241)와; 상기 제 241 단계 <187>후 형태소 분석 및 불용어 처리를 수행하는 제 242 단계(ST242)와; 상기 제 242 단계에서 추출된 주요 키워드들을 시소러스 상의 용어들과 매칭시키는 제 243 단계(ST243)와; 상기 제 243 단계에서 매칭된 용어들로부터 택소노미를 이용하여 분야분류명을 획득하는 제 244 단계(ST244)와; 상기 제 244 단계에서 획득된 분야분류명들을조합하여 해당 문서의 분야분류명을 결정하는 제 245 단계(ST245);를 포함하여 수행하는 것을 특징으로 한다.도 35는 도 30에서 하이브리드 기반 문서 분류의 상세흐름도이다. <188>이에 도시된 바와 같이, 상기 제 205 단계는, 문서를 입력받아 통계 기반 문서 분류와 시소러스 기반 문서 분류 <189>에서 각각의 분류 결과를 획득하는 제 251 단계(ST251)와; 상기 제 251 단계에서의 두 분류 결과를 이용하여 최종 분류 결과를 생성하는 제 252 단계(ST252);를 포함하여 수행하는 것을 특징으로 한다.상기 제 252 단계는, 두 분류 결과에 대해 차별적 적용 방식의 조합, 대등 방식의 조합, 보팅(Voting) 방식의 <190>조합 중에서 하나 이상의 조합으로 최종 분류 결과를 생성하는 것을 특징으로 한다.도 39는 도 3에서 주제/분야 할당 수행시 시소러스가 구축되어 있을 때 주제 분야 할당의 예를 보인 <191>흐름도이다.이에 도시된 바와 같이, 상기 제 3 단계는, 지식 처리부(100)에서의 정보 검색시, 상기 지식 처리부(100)는 시 <192>소러스가 구축되었는지 판별하는 제 261 단계(ST261)와; 상기 제 261 단계에서 시소러스가 구축되어 있으면, 원문으로부터 색인어를 추출하는 제 262 단계(ST262)와; 상기 제 262 단계 후 색인어를 시소러스 내의 개념어인주제어와 매칭시키고 분야분류명과 시소러스 내의 개념어인 주제어를 매칭시키는 제 263 단계(ST263)와; 상기제 263 단계 후 통제된 형태의 주제어를 결정하고, 분야분류명을 결정하는 제 264 단계(ST264)와; 상기 제 264단계 후 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상의 조건을 고려하여 결정된 주제어를 순위화하는 제 265 단계(ST265)와; 상기 제 265 단계 후 해당 원문에 대해상위에서 미리 설정한 특정 개수(N 개)의 주제어를 할당하는 제 266 단계(ST266);를 더욱 포함하여 수행하는 것을 특징으로 한다.도 40은 도 39에서 주제/분야 할당 수행시 시소러스가 미구축되어 있을 때 주제 분야 할당의 예를 보인 흐름도 <193>이다.이에 도시된 바와 같이, 상기 제 3 단계는, 지식 처리부(100)에서의 정보 검색시, 상기 지식 처리부(100)는 시 <194>소러스가 구축되어 있는지 판별하는 제 271 단계(ST271)와; 상기 제 271 단계에서 시소러스가 미구축되어 있으면, 택소노미 분류체계가 결정되어 있는지 판별하는 제 272 단계(ST272)와; 상기 제 272 단계에서 택소노미 분류체계가 결정되어 있다고 판별되면, 택소노미를 이용하여 분야를 자동 할당하는 제 273 단계(ST273)와; 상기제 272 단계에서 택소노미 분류체계가 결정되어 있지 않다고 판별되면, 태그를 이용하여 주제를 자동 할당하는제 274 단계(ST274)와; 상기 제 272 단계에서 택소노미 분류체계가 결정되어 있지 않다고 판별되면, 태그와 폭소노미를 이용하여 주제 또는 분야를 자동 할당하는 제 275 단계(ST274);를 포함하여 수행하는 것을 특징으로한다.도 41은 도 40에서 택소노미를 이용하여 분야를 자동 할당하는 동작을 보인 흐름도이다. <195>이에 도시된 바와 같이, 상기 제 273 단계는, 각 분야 분류명을 대표할 수 있는 정의문을 수집하는 제 281 단계 <196>(ST281)와; 상기 제 281 단계 후 정의문으로부터 용어를 추출하는 제 282 단계(ST282)와; 상기 제 282 단계 후추출한 용어에 대한 검증을 수행하고자 하는지 판별하는 제 283 단계(ST283)와; 상기 제 283 단계에서 추출한용어에 대한 검증을 수행하고자 하는 것으로 판별하면, 추출된 용어가 주제어로 적당한지 검증을 수행하는 제284 단계(ST284)와; 상기 제 283 단계에서 추출한 용어에 대한 검증을 수행하지 않는 것으로 판별하거나 또는상기 제 284 단계 수행 후 추출한 용어를 시소러스의 개념어인 주제어로 결정하는 제 285 단계(ST285)와; 상기- 26 -공개특허 10-2008-0071213제 285 단계 후 택소노미를 사용하여 분야를 할당하여 시소러스를 구축하는 제 286 단계(ST286)와; 상기 제 286단계 후 택소노미 내의 용어들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 택소노미에 의한 어느 분야 분류 체계에 해당하는지 결정하는 제 287 단계(ST287)와; 상기 제 287 단계 후 색인어의 용어빈도조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상의 조건을 고려하여 결정된주제어(용어)를 순위화하는 제 288 단계(ST288)와; 상기 제 288 단계 후 입력된 원문에 대해 택소노미를 사용한상위에서 미리 설정한 특정 개수(N 개)의 분야를 할당하는 제 289 단계(ST289);를 포함하여 수행하는 것을 특징으로 한다.도 42는 도 40에서 태그를 이용하여 주제를 자동 할당하는 동작을 보인 흐름도이다. <197>이에 도시된 바와 같이, 상기 제 274 단계는, 태그를 가진 웹 문서로부터 태그를 추출하는 제 291 단계(ST291) <198>와; 상기 제 291 단계 후 추출한 태그에 대한 검증을 수행하고자 하는지 판별하는 제 292 단계(ST292)와; 상기제 292 단계에서 추출한 태그에 대한 검증을 수행하고자 하는 것으로 판별하면, 추출된 태그가 주제어로 적당한지 검증을 수행하는 제 293 단계(ST293)와; 상기 제 292 단계에서 추출한 태그에 대한 검증을 수행하지 않는 것으로 판별하거나 또는 상기 제 293 단계 수행 후 추출된 태그를 시소러스의 개념어인 주제어로 결정하는 제 294단계(ST294)와; 상기 제 294 단계 후 추출된 태그를 사용하여 시소러스를 구축하는 제 295 단계(ST295)와; 상기295 단계 후 시소러스 내의 용어들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 시소러스 내의어느 태그에 해당하는지 결정하는 제 296 단계(ST296)와; 상기 제 296 단계 후 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상의 조건을 고려하여 결정된 주제어(태그)를 순위화하는 제 297 단계(ST297)와; 상기 제 297 단계 후 입력된 원문에 대해 상위에서 미리 설정한 특정개수(N 개)의 주제어(태그)를 할당하는 제 298 단계(ST298);를 포함하여 수행하는 것을 특징으로 한다.도 43은 도 40에서 태그와 폭소노미를 이용하여 주제 또는 분야를 자동 할당하는 동작을 보인 흐름도이다. <199>이에 도시된 바와 같이, 상기 제 275 단계는, 태그를 가진 웹 문서로부터 태그를 추출하는 제 301 단계(ST301) <200>와; 상기 제 301 단계 후 추출된 태그에 대한 검증을 수행하고자 하는지 판별하는 제 302 단계(ST302)와; 상기제 302 단계에서 추출된 태그에 대한 검증을 수행하고자 하는 것으로 판별하면, 추출된 태그가 주제어로 적당한지 검증을 수행하는 제 303 단계(ST303)와; 상기 제 302 단계에서 추출된 태그에 대한 검증을 수행하지 않는 것으로 판별하거나 또는 상기 제 303 단계 수행 후 추출된 태그를 시소러스의 개념어인 주제어로 결정하는 제 304단계(ST304)와; 상기 제 304 단계 후 폭소노미를 사용하여 분야를 할당하여 시소러스를 구축하는 제 305 단계(ST305)와; 상기 제 305 단계 후 시소러스 내의 태그들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 폭소노미에 의한 어느 분야 분류 체계에 해당하는지 결정하는 제 306 단계(ST306)와; 상기 제 306 단계 후색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상의 조건을 고려하여 결정된 주제어(태그), 분야(폭소노미)를 순위화하는 제 307 단계(ST307)와; 상기 제 307 단계 후입력된 원문에 대해 상위에서 미리 설정한 특정 개수(N 개)의 주제어(태그), 분야(폭소노미)를 할당하는 제 308단계(ST308);를 포함하여 수행하는 것을 특징으로 한다.도 44는 도 3에서 DBMS 기반 지식 확장 및 추론 수행시 DBMS 기반 지식 확장 및 추론 서비스 시스템의 일 예를 <201>보인 블록구성도이고, 도 45는 도 3에서 DBMS 기반 지식 확장 및 추론 서비스 방법을 보인 흐름도이다.이에 도시된 바와 같이, 상기 제 4 단계는, 온톨로지 스키마와 인스턴스들을 이용하여 트리플로 표현되는 지식 <202>을 생성하는 지식 생성 단계(ST311 ~ ST314)와; 상기 지식 생성 단계에서 생성된 지식을 입력받고, 지식 확장규칙을 이용하여 지식을 확장하는 지식 확장 처리 단계(ST321 ~ ST323)와; 상기 지식 확장 처리 단계에서 확장된 지식을 이용하고, 사용자 질의를 변환하고 질의를 처리하여 추론 서비스를 제공하는 질의 결과 처리 단계(ST331 ~ ST335);를 포함하여 수행하는 것을 특징으로 한다.상기 지식 생성 단계는, 온톨로지 스키마를 RDF/XML 파싱하여 파싱 결과를 출력하는 RDF/XML 파싱 단계(ST311) <203>와; 상기 RDF/XML 파싱 단계에서 출력된 파싱 결과를 입력받아 스키마-트리플 변환을 수행하는 스키마-트리플변환 단계(ST312)와; 상기 스키마-트리플 변환 단계에서 변환된 스키마-트리플과 DB-클래스 매핑 정보와 NS-Prefix 매핑 정보를 입력받고 DB-트리플 변환 규칙을 생성하는 DB-트리플 변환 규칙 생성 단계(ST313)와; 상기DB-트리플 변환 규칙 생성 단계에서 생성된 DB-트리플 변환 규칙을 이용하여 URL 서버에 저장되어 있는 온톨로지 인스턴스를 인스턴스 트리플로 변환시키는 DB-트리플 변환 단계(ST314);를 포함하여 수행하는 것을 특징으로한다.상기 지식 확장 처리 단계는, 스키마 기반 확장 규칙을 생성하는 지식확장 규칙 생성 단계(ST321)와; 상기 지식 <204>- 27 -공개특허 10-2008-0071213확장 규칙 생성 단계에 의해 생성된 스키마 기반 확장 규칙과 전문가가 기술한 사용자 정의 확장 규칙을 이용하고 인스턴스 트리플과 스키마 트리플을 이용하여 확장 트리플을 생성하는 지식 확장 단계(ST322)와; 인스턴스트리플과 지식 확장 단계의 결과를 이용하여 동적으로 값이 변하는 유형의 확장 트리플을 생성하는 추가 지식확장 단계(ST323);를 포함하여 수행하는 것을 특징으로 한다.상기 질의 결과 처리 단계는, 사용자 질의를 입력받아 변환시켜 변환 질의를 생성하는 질의 변환 <205>단계(ST331)와; 이전에 입력된 질의인지 판단하는 캐시 관리 단계(ST332)와; 상기 질의 변환 단계에서 변환된변환 질의를 입력받고, 캐시 관리 단계의 판단 결과를 입력받아 질의 결과를 생성하는 질의 처리단계(ST333)와; 상기 질의 처리 단계의 질의 결과를 입력받아 후 처리하여 후 처리 결과를 생성하는 후 처리 단계(ST334)와; 상기 후 처리 단계에서 생성된 후 처리 결과를 이용하여 사용자 인터페이스에 맞도록 메시지와 프로토콜을 생성하여 추론 결과를 제시하는 결과제시 단계(ST335);를 포함하여 수행하는 것을 특징으로 한다.도 56은 도 3에서 서비스 제공 단계에서 제공되는 지식정보 공유서비스의 예를 보인 도면이다. <206>이에 도시된 바와 같이, 상기 제 5 단계는, 선행기술 동향 파악, 과제평가위원 선정 검색, 지역별 연구 정책 결 <207>정 검색, 연구자간 협업 연구 검색을 포함한 프레임 서비스(OntoFrame-K) 제공; 특정 성과물 열람, 성과물의 상세 정보 및 관련 정보 검색, 성과물 등록, 비성과 정보의 공유 및 공동 문서 작업 수행, 성과물 원문 검색을 포함한 스토어 서비스(OntoStore-k) 제공; 특정 주제나 분야를 연구하는 연구자 그룹과 전문가 검색, 특정 연구자가 연구하는 주제와 분야 확인, 특정 주제나 분야를 연구하는 지역과 기관 확인, 여러 연구자들의 성과 추이 비교, 연구자, 기관, 주제에 대한 상세 정보 확인, 통합 연구자 네트워크 확인, 연구자 친밀도 확인을 포함한 씽크 서비스(OntoThink-K) 제공; 중에서 하나 이상의 서비스 제공을 수행하는 것을 특징으로 한다.도 57은 도 56에서 프레임 서비스 제공 화면의 예를 보인 도면이다. <208>이에 도시된 바와 같이, 상기 프레임 서비스(OntoFrame-K) 제공에서 선행기술 동향 파악은, 연구자나 연구팀이 <209>수행하고자 하는 연구 분야의 성과물을 확인하거나 그 분야에 속한 전문가의 성과물을 살펴봄으로서 분석에 필요한 선행 연구 동향을 파악할 수 있도록 하는 것을 특징으로 한다.상기 프레임 서비스(OntoFrame-K) 제공에서 과제 평가 위원 선정 검색은, 평가 대상 과제의 분야 전문가를 확인 <210>하고, 피평가자의 연구제 네트워크를 공저자 관점, 인용 관점으로 분석함으로서 이해 관계에 있는 전문가를 배제할 수 있도록 하는 것을 특징으로 한다.상기 프레임 서비스(OntoFrame-K) 제공에서 지역별 연구정책 결정 검색은, 연구 분야 및 유형에 따라 행정 구역 <211>별로 연구 활성도를 알아볼 수 있도록 처리하고, 연구 수행이 가능한 기관과 연구자를 검색하여 해당 지역에서육성해야 하는 연구 자원을 파악할 수 있도록 처리하는 것을 특징으로 한다.상기 프레임 서비스(OntoFrame-K) 제공에서 연구자 간 협업 연구 검색은, 성과물과 연구 자료를 등록할 수 있도 <212>록 처리하고, 이를 동료 연구자가 확인하고 자료를 수정하거나 추가할 수 있도록 처리함으로써 이력 추적이 가능한 방식의 협업 성과물을 생산하도록 처리하는 것을 특징으로 한다.도 58은 도 57에서 선행연구 동향파악 선택시 동작 예를 보인 흐름도이다. <213>이에 도시된 바와 같이, 상기 프레임 서비스 제공에서 선행연구동향파악은, 메인 화면에서 주제를 선택하도록 <214>하는 주제 선택 단계(1.)와; 상기 주제 선택 단계 후 연구자 네트워크 선택에 의해 연구자 그룹을 확인하도록하는 연구자 그룹 확인 단계(2.)와; 상기 연구자 그룹 확인 단계 후 연구자 네트워크 선택에 의해 공저자 네트워크를 확인하도록 하는 공저자 네트워크 확인 단계(3.)와; 상기 공저자 네트워크 확인 단계 후 통계정보 선택에 의해 연구자간 비교 및 연구 추이 파악이 수행되도록 하는 통계정보 선택 단계(4.)와; 상기 통계정보 선택단계 후 성과정보 선택에 의해 성과 유형별 연구 성과를 제시하도록 하는 성과정보 선택 단계(5.)와; 상기 성과정보 선택 단계 후 상세보기 선택에 의해 성과 상세보기가 수행되도록 하는 상세보기 선택 단계(6.)와; 상기 상세보기 선택 단계 후 연구자 정보 선택에 의해 인력 상세보기가 수행되도록 하는 연구자 정보 선택 단계(7.)와;상기 연구자 정보 선택 단계 후 연구 성과 맵 선택에 의해 지역별 연구 성과 보기가 수행되도록 하는 연구 성과맵 선택 단계(8.)와; 상기 연구 성과 맵 선택 단계 후 기관 정보 선택에 의해 지역별 소속 기관 보기가 수행되도록 하는 기관정보 선택 단계(9.);를 포함하여 수행하는 것을 특징으로 한다.도 59는 도 58에서 메인 화면에서 주제 선택시의 화면 예를 보인 도면이다. <215>이에 도시된 바와 같이, 상기 주제 선택 단계는, 주제가 선택되면 주제 입력 및 검색이 수행되도록 하는 것을 <216>- 28 -공개특허 10-2008-0071213포함하여 수행하는 것을 특징으로 한다.도 60은 도 58에서 연구자 네트워크 선택과 연구자 그룹 확인 화면의 예를 보인 도면이다. <217>이에 도시된 바와 같이, 상기 연구자 그룹 확인 단계는, 연구자 네트워크 선택시 연구자 그룹을 공저자 관점에 <218>서 출력하고, 해당 분야 전문가를 출력하는 것을 특징으로 한다.도 61은 도 58에서 연구자 네트워크 선택과 공저자 네트워크 확인 화면의 예를 보인 도면이다. <219>이에 도시된 바와 같이, 상기 공저자 네트워크 확인 단계는, 연구자 네트워크 선택시 스타(Star) 연구자를 중심 <220>으로 한 방사형 연구자 네트워크 또는 다수 연구자가 동일한 비중을 보인 체인형 연구자 네트워크를 제공하는것을 특징으로 한다.도 62는 도 58에서 통계정보 선택시 연구자 간 비교 및 연구 추이 파악 화면의 예를 보인 도면이다. <221>이에 도시된 바와 같이, 상기 통계정보 선택 단계는, 통계정보 선택시 다수 연구자의 성과 추이를 비교하여 해 <222>당 분야의 연구 강도가 약화되는 정도와 최근에 해당 분야 연구가 시작되는 정도를 그래프로 표시하는 것을 특징으로 한다.도 63은 도 58에서 성과정보 선택시 성과 유형 별 연구 성과 제시 화면의 예를 보인 도면이다. <223>이에 도시된 바와 같이, 상기 성과정보 선택 단계는, 성과정보 선택시 해당 분야 연구 실적을 확인하도록 해당 <224>분야 연구 실적을 제공하는 것을 특징으로 한다.도 64는 도 58에서 상세보기 선택시 성과 상세보기 화면의 예를 보인 도면이다. <225>이에 도시된 바와 같이, 상기 상세보기 선택 단계는, 상세보기 선택시 URI 기반 개체 관리 정보를 표시하고, 자 <226>동 추출된 상위 일정 개수(예를 들면, 상위에서 3번째까지)의 주제와 분야를 표시하며, 문서 미리 보기를 통해해당 논문에 대한 내용을 확인할 수 있도록 표시하는 것을 특징으로 한다.도 65는 도 58에서 연구자 정보 선택시 인력 상세보기 화면의 예를 보인 도면이다. <227>이에 도시된 바와 같이, 상기 연구자 정보 선택 단계는, 연구자 정보 선택시 추론에 의해 획득된 인력의 연구 <228>주제와 분야를 표시하고, 국가 과학기술 인력 종합 DB와 연결된 정보를 표시하며, 해당 연구자의 성과 정보를표시하는 것을 특징으로 한다.도 66은 도 58에서 연구 성과 맵 선택시 지역별 연구 성과 보기 화면의 예를 보인 도면이다. <229>이에 도시된 바와 같이, 상기 연구 성과 맵 선택 단계는, 연구 성과 맵 선택시 광역 단위 또는 시/군/구 단위로 <230>해당 분야의 지역 별 성과 맵을 표시하는 것을 특징으로 한다.도 67은 도 58에서 기관정보 선택시 지역별 소속 기관 보기 화면의 예를 보인 도면이다. <231>이에 도시된 바와 같이, 상기 기관정보 선택 단계는, 기관정보 선택시 해당 분야를 연구하는 연구자가 소속된 <232>기관 중 해당 지역에 위치한 기관 정보를 표시하는 것을 특징으로 한다.도 68은 도 56에서 정보유통 서비스인 스토어 서비스 제공 화면의 예를 보인 도면이다. <233>이에 도시된 바와 같이, 상기 스토어 서비스(OntoStore-k) 제공에서 특정 성과물 열람은, 공통 메뉴에서 원하는 <234>주제나 분야, 성과물 유형, 발행년도를 선택한 후, 키워드를 이용해서 검색할 수 있도록 처리하고, 전체, 제목,저자로 검색하거나 개인이 소유한 문서를 사용해서 문서를 검색할 수 있도록 처리하는 것을 특징으로 한다.상기 스토어 서비스(OntoStore-k) 제공에서 성과물의 상세 정보 및 관련 정보 검색은, 성과물의 메타데이터와 <235>참여인력, 기관에 대한 상세정보를 볼 수 있도록 처리하고, 인력, 기관, 성과물을 선택한 후에는 관련 추론 서비스로 이동할 수 있도록 처리하는 것을 특징으로 한다.상기 스토어 서비스(OntoStore-k) 제공에서 성과물 등록은, 사용자가 로그인을 한 후 성과물을 등록할 수 있도 <236>록 처리하는 것을 특징으로 한다.상기 스토어 서비스(OntoStore-k) 제공에서 비성과 정보의 공유 및 공동 문서 작업 수행은, 비성과 정보를 등록 <237>할 때 수정 권한을 사용자에게 부여하여 문서를 공유할 수 있도록 처리하고, 비성과 정보의 이력보기를 통해 문서의 이력정보를 확인할 수 있도록 처리하는 것을 특징으로 한다.상기 스토어 서비스(OntoStore-k) 제공에서 성과물 원문 검색은, 사용자가 로그인을 한 후 성과물 상세보기에서 <238>- 29 -공개특허 10-2008-0071213원문을 클릭하면 원문을 다운로드 받을 수 있도록 처리하고, 사용자가 다운로드 받은 원문은 전용 뷰어에 의해볼 수 있도록 처리하는 것을 특징으로 한다.도 69는 도 56에서 추론 서비스인 씽크 서비스 제공 화면의 예를 보인 도면이다. <239>이에 도시된 바와 같이, 상기 씽크 서비스(OntoThink-K) 제공에서 특정 주제나 분야를 연구하는 연구자 그룹과 <240>전문가 검색은, 공통 메뉴에서 원하는 주제나 분야를 선택하도록 한 다음 연구자 네트워크에서 해당 분야 연구자 그룹과 전문가를 확인할 수 있도록 처리하고, 연구자 네트워크로 사용자가 다시 한번 이동하면 특정 연구자그룹의 연구자 간 연구 관계를 볼 수 있도록 처리하는 것을 특징으로 한다.상기 씽크 서비스(OntoThink-K) 제공에서 특정 연구자가 연구하는 주제와 분야 확인은, 연구자 정보에서 원하는 <241>연구자를 검색한 후 사용자가 클릭하면, 해당 연구자의 연구 주제와 분야를 확인할 수 있도록 처리하고, 성과정보로 이동하면 해당 연구자의 성과물을 성과 유형별로 볼 수 있도록 처리하는 것을 특징으로 한다.상기 씽크 서비스(OntoThink-K) 제공에서 특정 주제나 분야를 연구하는 지역과 기관 확인은, 공통 메뉴에서 원 <242>하는 주제나 분야를 사용자가 선택한 후 연구 성과 맵으로 이동하면 지역별 현황을 볼 수 있도록 처리하고, 특정 지역을 선택한 후 기관정보로 이동하면 관련 기관의 정보를 확인할 수 있도록 처리하는 것을 특징으로 한다.상기 씽크 서비스(OntoThink-K) 제공에서 여러 연구자들의 성과 추이 비교는, 연구자 네트워크 또는 연구자 정 <243>보에서 연구자들을 선택하고, 통계정보로 이동하면, 해당 연구자들의 성과를 그래프를 통해 일정 기간 단위별(예를 들면, 연도별)로 확인할 수 있도록 처리하는 것을 특징으로 한다.상기 씽크 서비스(OntoThink-K) 제공에서 연구자, 기관, 주제에 대한 상세 정보 확인은, 상기 씽크 서비스 제공 <244>화면에서 연구자, 기관, 주제를 선택하면, 상세보기를 통해 상세 정보를 확인할 수 있도록 처리하는 것을 특징으로 한다.도 80은 도 2 및 도 56에서 씽크 서비스 제공시 통합 연구자 네트워크 서비스부에 의한 통합 연구자 네트워크 <245>서비스 제공 예를 보인 흐름도이다.이에 도시된 바와 같이, 상기 제 5 단계는, 공저자 네트워크, 인용 네트워크, 학연 네트워크를 구축하는 제 401 <246>단계(ST401)와; 상기 제 401 단계 후 구축된 네트워크를 인력 중심으로 통합하여 통합 연구자 네트워크를 구축하는 제 402 단계(ST402)와; 상기 제 402 단계 후 통합 연구자 네트워크 서비스를 제공하는 제 403 단계(ST403);를 포함하여 수행하는 것을 특징으로 한다.도 81은 도 2 및 도 56에서 씽크 서비스 제공시 연구자 친밀도 서비스부에 의한 연구자 친밀도 서비스 제공 예 <247>를 보인 흐름도이다.이에 도시된 바와 같이, 상기 제 5 단계는, 연구자 자료를 수집하는 제 411 단계(ST411)와; 상기 제 411 단계에 <248>서 수집된 자료를 이용하여 연구자 간의 친밀도를 계산하는 제 412 단계(ST412)와; 상기 제 412 단계 후 계산된친밀도를 이용하여 시각화를 수행하는 제 413 단계(ST413);를 포함하여 수행하는 것을 특징으로 한다.상기 제 411 단계는, 링크 거리, 링크 타입(공저자, 인용, 소속 중에서 하나 이상 포함), 주제 또는 분야(인적, <249>문헌적 주제 또는 분야 포함), 성과 유형 가중치(논문 또는 보고서 포함), 링크 강도(수량 또는 가중치에 의한링크 강도 포함) 중에서 하나 이상을 포함한 자료를 수집하여 상기 제 412 단계에서의 친밀도 계산에 이용하도록 하는 것을 특징으로 한다.상기 제 413 단계는, 지역별, 기관별 주제와 분야 추이를 시각화하거나 또는 연구그룹간 지역별, 기관별 협력 <250>연구 추이를 시각화하거나 또는 공저자 사이의 관계를 시각화하거나 또는 연구자 사이의 인용-피인용 관계를 시각화하거나 또는 시간축에서의 친밀도를 시각화하는 것 중에서 하나 이상의 시각화를 수행하는 것을 특징으로한다.이와 같이 구성된 본 발명에 의한 시맨틱 웹 기반 연구정보 서비스 시스템 및 그 방법의 바람직한 실시예를 첨 <251>부한 도면에 의거하여 상세히 설명하면 다음과 같다. 하기에서 본 발명을 설명함에 있어 관련된 공지 기능 또는구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서, 이는 사용자,운용자의 의도 또는 판례 등에 따라 달라질 수 있으며, 이에 따라 각 용어의 의미는 본 명세서 전반에 걸친 내용을 토대로 해석되어야 할 것이다.먼저 본 발명은 차세대 지능형 웹으로 컴퓨터가 정보의 의미를 이해하고 정보들 간의 논리적 추론까지 할 수 있 <252>- 30 -공개특허 10-2008-0071213는 시맨틱 웹 기술을 활용하여 연구 개발 전주기 지원서비스 플랫폼을 구축하여 연구기획에 필요한 연구동향은물론이고 최적의 협력 연구자 선정, 지역별/연구분야별 특색에 맞는 정확한 정책수립 등에 필요한 모든 정보를효율적으로 파악하고자 한 것이다.1. 서 론 <253>오늘날에는, 국가 간의 기술 경쟁이 더욱 치열해지면서, 국가 경쟁력 확보를 위하여 최단 기간 내에 최고의 연 <254>구성과를 얻을 수 있도록 연구/개발자들의 협업 연구를 가상공간상에서 지원하기 위한 국가 차원의 \"소프트 인프라\"에 대한 필요성이 강조되고 있다. 이러한 필요성에 따라, 각국은 그리드 및 e-Science에 대한 연구를 통하여 연구/개발 자원 및 장비의 공동 활용을 위한 여러 방안들을 마련하고 있다. 그러나 실질적인 연구/개발자들간의 협업 연구를 위해서는, 장비 및 실험 데이터의 공동 활용 이외에도, 지식정보의 공동 활용, 특히 연구/개발자들이 개인적으로 소장하고 있는 지식 정보의 공동 활용 역시 필요하다. 왜냐하면 연구/개발자들이 소장하고있는 지식정보는 연구/개발자 본인이 직접 만들었거나 또는 손수 중요한 정보로 선별한 것이므로, 개인 소장 지식정보의 효율적인 공유/유통은 연구/개발자들의 연구를 가속시킴으로써 해당 분야를 더욱 빠르게 발전시키고이는 다시 연구/개발자들의 협업 연구를 더욱 촉진하여 궁극적으로는 국가 과학기술 경쟁력을 향상시킬 수 있기때문이다.과학기술 경쟁력 강화를 위해서는 연구/개발 활동의 생산성 향상도 필요하다. 90년대 중반에 실시된 미국 과학 <255>재단의 조사에서는, 연구/개발자들은 전체 연구/개발 시간의 30% 이상을 필요한 정보를 수집, 분류 그리고 선별하는 데 사용하고 있으며 이런 상황은 정보자원의 폭증으로 인해 더욱 심화될 것이므로 연구/개발 활동의 생산성 향상을 위해서는 무엇보다도 정보획득 과정의 개선이 필요함이 지적되었다. 이에 대한 해결 방안으로서,W3C(World Wide Web Consortium, 월드와이드웹 컨소시엄)나 ISO(International Organization forStandardization, 국제 표준화 기구)와 같은 국제 표준화 기관들과 선진 연구기관들에서는 정보자원을 내용 또는 의미를 기준으로 관리/유통하고 기존 기술의 한계를 극복하기 위한 대안으로서 시맨틱 웹(semantic web) 기술과 온톨로지(ontology)에 대한 연구를 90년대 후반부터 수행하여 오고 있으며, 최근에는 그간의 성과의 실용화를 위한 다양한 응용 연구도 활발히 수행 중이다.이상과 같은 기술환경 변화에 적극 대응하기 위하여, 본 발명에서는 \"지식 기반 정보유통 플랫폼\"을 제공한다. <256>\"지식 기반 정보유통 플랫폼(OntoFrame-K, OFK)\"은 정보 공유/유통 기술과 시맨틱 웹 기술이 융합/적용된 새로운 개념의 정보유통 플랫폼으로서, 이미 검증된 전문성과 높은 부가가치를 지닌 개인 소장 과학기술 지식정보를공유/유통시킬 수 있는 \"자발적 가상 협업 연구 커뮤니티(self-organizing virtual research community)\"의 구현을 지원하기 위한 시스템이다. 시맨틱 웹 기술은 OFK의 유통 대상 정보인 지식정보의 모델링에서 뿐만 아니라다양한 추론 기반 응용 서비스들에도 적용되어 데이터들 간의 연관 관계를 보다 효율적으로 관리/제시함으로써OFK에 기반한 협업 연구 커뮤니티를 통한 정보획득 과정의 효율화에 활용되고 있다. 특히 OFK에서 시맨틱 웹 기반 서비스의 핵심 기반 지식자원으로 활용되는 온톨로지와 시소러스는 각각 언어 독립적인 지식과 언어 종속적지식의 모델링과 추론 과정에 활용되고 있으며, 본 발명에 의해 전체 과학기술 분야를 대상으로 한 \"국가 과학기술 연구/개발 기반정보 온톨로지(National Science & Technology R&D Reference Ontology)\"와 \"범용 과학기술 분야 시소러스\"를 구축할 수 있게 되었다. 또한 IT(Information Technology, 정보 통신 기술), BT(BiologyTechnology, 생명 공학 기술), NT(Nano Technology, 초정밀 원자 기술) 및 기초 과학기술 분야 등과 같은 과학기술 각 분야를 위한 분야별 기반 지식자원들을 지속적으로 구축/적용함으로써, 개별 분야 지식정보 처리를 위한 OFK 전문성을 확장해 나갈 수 있게 되었다.2. 관련 연구 <257>OFK는 과학기술 분야에 종사하는 연구/개발자들 간의 자발적인 협업 연구 지원을 목표로 정보유통 기술과 시맨 <258>틱 웹 기술의 결합에 기초하여 개발되고 있다.이에 본 장에서는, 협업 연구 지원을 위해서, 기존의 정보유통 기술 관련 연구들과 시맨틱 웹 기술 관련 연구들 <259>에서 개선되어야 하는 사항들을 살펴보고 OFK에서는 현재 어떠한 해결 방안이 제시되고 있으며 향후 OFK가 추구해야 할 방향을 가늠해 보고자 한다.협업 연구 지원을 위해서는 유통되고 있는 지식정보의 식별(identification)과 유통 과정 중 발생될 수 있는 변 <260>경 및 수정에 따른 정보의 이력(version 또는 history) 관리가 필요하다. 이와 관련된 정보유통 관련 연구들을살펴보면, P2P(Peer-To-Peer)를 포함한 많은 연구들이 식별자(identifier) 검사 등과 같은 방법을 사용한 정보에 대한 검증에 관심을 가지고 있음을 알 수 있다. 예를 들어, 종래기술의 문헌 정보 [1](이하에서는 문헌 정보- 31 -공개특허 10-2008-0071213의 번호만을 기재함)과 [2]의 연구에서는 식별자를 미디어 문서 파일의 헤더에 부착하는 방식을 사용하여, 동일문서는 동일 식별자를 가질 수 있도록 하는 방안을 제시하였다.그러나 [1]과 [2]에는 사용자가 의도적으로 문서의 헤더 정보를 바꾸거나 또는 특정 문서에 대한 이력을 추적하 <261>고자 하는 경우에 대응하기 위한 적절한 해결 방안이 제시되지 못한 한계가 있었다. 문서 파일에 추가된 부가정보(또는 메타데이터)의 신뢰성 또한 연구자들 간의 협업 연구 지원에 매우 중요하다. 부가정보는, 정보유통의신뢰도 확보를 위하여, 등록된 문서 파일에 대한 검증 및 특정 문서 파일의 이력 추적에 활용될 수 있기 때문에부가정보의 신뢰도는 결과적으로 정보유통 과정 자체의 신뢰성을 좌우할 수 있기 때문이다. 그러나 앞의 연구들뿐만 아니라 대부분의 관련 기존 연구들에서는 부가정보 생성 과정에 대한 효율적인 통제 방안이 제시되지 않음으로 인해 생성된 부가정보의 신뢰성 및 체계성을 확보하기 어려울 뿐만 아니라 그로 인해 이전 버전 문서 파일들 간의 올바른 연결 관계를 제시할 수 없다는 문제점이 존재한다([3], [4], [5] 참조).이러한 문제들을 해결하기 위해서, 본 발명의 OFK에는 \"문서 컨테이너(document container)\"라는 개념이 도입되 <262>었다. 문서 컨테이너는 문서 파일 자체에 관련 메타데이터와 관리 정보들이 인코딩되어 추가/통합된 파일 형태로, 유통을 위해 문서 파일을 등록할 경우, 자동적으로 해당 메타데이터 역시 동시에 등록되게 함으로써 온톨로지 기반의 추론 과정을 효율적으로 지원할 수 있도록 한다. 또한, 문서 컨테이너는 자체적으로 이력을 추적할수 있는 관련 문서 정보와 메타데이터를 내포하고 있으므로, 문서 컨테이너가 등록될 때 문서 파일 자체에 대한자동적인 검증이 가능하며, 사용자가 원하는 정보를 내려 받는 경우에도 문서 컨테이너 형식으로 내려 받은 후OFK의 클라이언트로 문서 컨테이너에 포함된 메타데이터 및 문서 파일을 볼 수 있게 함으로써 신뢰도가 높은 지식정보 유통이 가능하도록 한다.시맨틱 웹과 관련된 기존 연구들로는, 영국 EPSRC(Engineering & Physical Science Research Council)에서 주 <263>관하는 AKT(Advanced Knowledge Technologies) 사업에서 개발된 CAS(CS AKTive Space), 독일 Karlsruhe 대학의SEAL(Semantic portAL)과 같은 비교적 성공적인 시맨틱 웹 응용 시스템들이 해외에서 발표된 바가 있다. 반면국내의 경우, 아직까지는 실세계(real world) 정보를 대상으로 시맨틱 웹 기술을 적용한 사례는 발견하기 어려우며, 대개는 가상 정보나 실험실 규모의 간단한 정보를 다루는 수준에 머물고 있는 실정이다. 국내외의 시맨틱웹 기반 서비스들의 공통적인 문제점으로는 주로 정적인 지식 서비스를 제공하기 위해 설계되고 구현되어 계속적으로 추가되는 정보를 반영하기 위한 동적 지식화 과정을 가지고 있지 않다는 것을 지적할 수 있다([6], [7].[8], [9] 참조).그래서 본 발명의 OFK에서는 등록된 지식정보에 해당하는 정보를 DB-to-OWL 변환을 통하여 지식정보의 등록 시 <264>점에 맞추어 새로운 시맨틱 웹 정보를 즉각적으로 반영할 수 있도록 하였으며 변환 결과 생성된 데이터 인스턴스들은 지식의 일관성을 유지하고 일괄 처리가 가능하도록 \"국가 과학기술 R&D 기반 정보 온톨로지\"에도 삽입/추가되도록 하였다.또한 정보유통의 경우 추론, 온톨로지, 웹 서비스에 관한 연구가 전무하며, 시맨틱 웹 또한 정보유통, 정보공유 <265>에 관한 연구가 빈약한 실정이다. 대다수의 정보유통 관련 연구들은 정보의 형식과 명세에만 초점을 맞추고 있어서 신뢰성 있는 정보유통 방안을 제시하지 못하고 있으며, 시맨틱 웹 관련 연구들은 응용 분야와 프레임워크에 많은 관심을 가지고 있으나, 체계화된 정보의 확산 방안 마련을 보완할 필요가 있는 것으로 분석될 수 있다.그래서 본 발명의 OFK는 이러한 양자 간의 독립적 연구 방향을 통합하기 위해 시맨틱 웹 기술을 이용하여 정보 <266>를 체계화하고 연구/개발자들 사이에서 자발적으로 유통될 수 있도록 하기 위한 것이다. OFK의 이러한 시도는의미를 가진 정보의 확산을 위한 기반을 마련하기 위함이다.3. OFK(OntoFrame-K)의 구성 <267>연구/개발자들 간의 자발적인 협업 지원을 위한 정보유통 플랫폼으로서의 OFK는 등록된 지식정보를 검증하고 해 <268>당 정보의 이력을 추적하며, 온톨로지 기반의 추론 서비스를 통해 연구/개발자들에게 국가 과학기술 R&D 기반정보를 포함하는 지식 서비스를 제공한다. 이러한 OFK는 지식 처리부(100)와 정보유통 서비스부(200)와 추론 서비스부(300)로 구성할 수 있다. 또한 부가 <269>적으로 공통 서비스부(400)를 포함할 수 있다.하나의 OFK는 특정한 연구 주제나 학문 분야를 가지는 하나의 가상 협업 연구 커뮤니티에 해당하며, 중앙 지식 <270>서버를 통해 다른 커뮤니티와 연결될 수 있다. 이는 시맨틱 웹 서비스와 시맨틱 그리드를 이용하여 다중 커뮤니티 구성을 통해 수행할 수 있다.- 32 -공개특허 10-2008-0071213도 1은 본 발명의 일 실시예에 의한 시맨틱 웹 기반 연구정보 서비스 시스템의 블록구성도이다. <271>그래서 지식 처리부(100)는 URI(Universal Resource Identifier) 기반과 DBMS(database management system) 기 <272>반 하에 지식 처리를 수행하여 지식정보 공유 서비스가 제공될 수 있도록 처리한다.이러한 지식 처리부(100)는 인력개체 확인부(110), URI 기반 처리부(120), 주제/분야 할당부(130), DBMS 기반 <273>지식 확장 및 추론부(140)로 구성할 수 있다.또한 인력개체 확인부(110)는 동명저자의 중의성을 해소하는 것으로, '온톨로지 인스턴스의 sameAs 관리' 기술 <274>과 '원문으로 부터의 정보 추출 기법을 사용한 동명저자 중의성 해소' 기술을 이용한다.또한 URI 기반 처리부(120)는 인력개체 확인부(110)의 확인결과를 전달받고, URI 기반 하에서 저자 인용관계 및 <275>네트워크를 구축하고 URI 기반의 성과정보를 관리하는 것으로, 'URI 기반 저자 인용관계 및 네트워크 구축' 기술과 'URI 기반 성과 정보 관리' 기술을 이용한다.또한 주제/분야 할당부(130)는 입력된 원문에 대해 주제와 분야를 할당하는 것으로, '통계기반 문서분류를 통한 <276>시소러스 확장 방법 및 하이브리드 문서 분류 방법' 기술과 '시소러스의 구축시 주제/분야 할당과 시소러스 미구축시 태그와 폭소노미를 이용한 주제/분야 할당' 기술을 이용한다.또한 DMBS 기반 지식 확장 및 추론부(140)는 URI 기반 처리부(120)의 처리결과를 전달받고, 주제/분야 할당부 <277>(130)에서 할당된 결과를 전달받으며, DBMS에 기반하여 지식을 확장하고 추론하며, 상기 정보유통 서비스부(200)와 상기 추론 서비스부(300)를 이용하는 사용자의 질의를 처리하는 것으로, 'DBMS 기반 지식확장 및 추론'기술을 이용한다.그리고 정보 유통 서비스부(200)는 지식 처리부(100)에서 처리된 결과를 제공받고, 시맨틱 웹에 기반하여 연구 <278>정보의 등록과 검색 처리 및 통계 서비스를 제공한다.또한 추론 서비스부(300)는 지식 처리부(100)에서 처리된 결과를 제공받고, 팩트(Fact), 규칙 및 후처리를 통해 <279>연구개발 정보에서 명시적으로 드러나 있지 않은 간접적인 정보를 발굴하여 제공한다.도 2는 도 1에서 정보유통 서비스부와 추론 서비스부 및 그 주변블록의 상세블록도이다. <280>그래서 정보 등록/관리 서비스부(210)는 정보 유통 서비스부(200)에서 보고서, 논문, 특허 중에서 하나 이상을 <281>포함한 성과 정보 및 비성과 정보를 등록하고 관리한다.또한 관련성과/참조성과 검색 서비스부(220)는 정보 유통 서비스부(200)에서 관련성과와 참조성과의 검색 서비 <282>스를 제공한다.또한 주제/분야 세부정보 열람 서비스부(230)는 정보 유통 서비스부(200)에서 연구개발 정보에서 주제와 분야에 <283>대한 세부정보를 열람할 수 있도록 한다.또한 통계 서비스부(240)는 정보 유통 서비스부(200)에서 연구개발 정보에 대한 통계 정보를 제공한다. <284>그리고 연구자 네트워크 서비스부(310)는 추론 서비스부(300)에서 연구자 네트워크를 제공한다. <285>또한 연구자 정보 서비스부(320)는 추론 서비스부(300)에서 연구자 정보를 제공한다. <286>또한 연구 성과 맵 서비스부(330)는 추론 서비스부(300)에서 연구 성과 맵을 제공한다. <287>또한 성과정보 서비스부(340)는 추론 서비스부(300)에서 성과정보를 제공한다. <288>또한 기관정보 서비스부(350)는 추론 서비스부(300)에서 기관정보를 제공한다. <289>또한 통계정보 서비스부(360)는 추론 서비스부(300)에서 통계정보를 제공한다. <290>또한 통합 연구자 네트워크 서비스부(370)는 추론 서비스부(300)에서 통합 연구자 네트워크 서비스를 제공한다. <291>또한 연구자 친밀도 서비스부(380)는 추론 서비스부(300)에서 연구자 친밀도 서비스를 제공한다. <292>그리고 공통 서비스부(400)에서 URI 등록/관리 서비스부(410)는 인력, 기관, 보고서, 논문, 특허, 주제, 분야에 <293>대한 URI 등록 및 관리를 수행하고, 레퍼렌셜 아이덴티티(Referential Identity) 검색 기능을 제공한다.또한 주제/분야 분류 서비스부(420)는 시소러스 기반 자동 분류를 수행하여 주제와 분야에 대한 분류 서비스를 <294>제공한다.- 33 -공개특허 10-2008-0071213이하에서는 본 발명의 상세 동작에 대해 좀 더 상세히 설명한다. <295>4. 지식 처리 <296>4-1. 온톨로지 인스턴스의 sameAs 관리 <297>이 장에서는 온톨로지 개체들의 sameAs 관계를 관리하고, 온톨로지 인스턴스 데이터 내에서 sameAs 관계의 설정 <298>및 해제와 관련 지식을 수정하고, 사용자 질의를 처리하고 sameAs 후 처리를 수행하여 결과를 제시하는 시맨틱웹 기술을 활용하는 추론 서비스를 제공할 필요가 있는 전 분야에 걸쳐 안정적이고 효율적인 sameAs 관리 프레임워크를 제시하는 것을 설명하고 있다.또한 시맨틱 웹 기술의 발전과 더불어 급격히 관심을 끌고 있는 온톨로지에서의 개체 정합성 관리 측면에서 <299>sameAs 관리 프레임워크를 실현하는 방법을 설명한다. 여기서는 크게 온톨로지 스키마와 인스턴스 데이터를 이용하여 개체 간 sameAs 관계를 관리하는 방법, sameAs 관계 설정이나 해제로 인해 변경되는 sameAs 그룹의 지식을 수정하는 방법, 사용자 질의를 처리하고 sameAs 후 처리를 수행하는 방법으로 구성된다.sameAs 관계는, 온톨로지 내에 이미 존재하는 서로 다른 두 개체 A와 B가 실세계에서 동일 개체임이 확인되었을 <300>때 관계명 \"sameAs\"를 사용하여 \"A sameAs B\"와 같은 트리플 형식으로 표현하여 두 개체 A와 B는 개별적으로 존재하고 있으나 실제로는 같은 개체이다라는 의미를 나타내기 위해 사용된다. sameAs 관계로 묶인 두 개체 사이에는 개념적으로 우선 순위가 없으나, 본 발명에서는 sameAs 개체 쌍에 대해 대표 개체와 비대표 개체의 구분을암묵적으로 표현한다. 즉, A-sameAs-B와 같은 sameAs 트리플의 형태적 표현은 그대로 유지하고 그 해석에 있어서 subject인 A가 object인 B보다 우선한다거나 object인 B가 subject인 A에 우선한다는 식의 원칙을 세움으로써 대표와 비대표 개체를 구분하도록 하는 것이다. 본 발명에서는 편의상 sameAs 트리플에서 subject 쪽을 대표개체로 object 쪽을 비대표 개체로 지정하여 설명하고 있다.sameAs 관계에 포함된 개체들은 sameAs 그룹을 형성하게 되며 관련된 sameAs 관계들이 둘 이상일 때 sameAs 그 <301>룹에 포함되는 개체 수는 늘어나게 된다(예. A-sameAs-B, B-sameAs-C, D-sameAs-E의 sameAs 관계들은 두 개의sameAs 그룹들인 [A, B, C]와 [D, E]를 형성한다). 단일 sameAs 관계에서의 대표와 비대표 개체의 구분은sameAs 그룹에서 sameAs 그룹의 대표 개체와 비대표 개체의 개념으로 확장된다(전술한 예에서 [A, B, C] sameAs그룹의 대표는 A이며 [D, E] sameAs 그룹의 대표는 D이다).도 4는 도 3에서 인력개체 확인 수행시 온톨로지 인스턴스의 sameAs 관리 시스템의 블록구성도이고, 도 5는 도 <302>3에서 인력개체 확인 수행시 온톨로지 인스턴스의 sameAs 관리 방법을 상세히 보인 흐름도이다.그래서 sameAs 관계 확인부는 온톨로지 내에 이미 설정되어 있는 단일 sameAs 관계 및 복수개의 연관된 sameAs <303>관계로 인해 만들어지는 sameAs 그룹들을 확인하는 장치이다(도 6 참조).sameAs 관계 설정부와 sameAs 관계 해제부는, URI로 표현된 두 개체에 대해 sameAs 관계를 설정하거나 해제하는 <304>장치들이다(도 7 참조). sameAs 관계를 설정하거나 해제함에 있어서는 특정한 sameAs 관계의 설정이나 해제가온톨로지의 일관성을 해치지 않는지를 검사하는 사전작업이 요구된다. 예를 들어, 트리플 형태로 표현된 온톨로지 인스턴스 데이터가 A-hasBirthPlace-C, B-hasBirthPlace-D, C-differentFrom-D를 포함하고 있을 때, 두 개체 A와 B사이에 A-sameAs-B와 같은 sameAs 관계를 설정하면 사람마다 출생지(BirthPlace)는 유일하므로 A-sameAs-B로 인해 C-sameAs-D를 추론해 낼 수 있고 이는 기존의 C-differentFrom-D라는 지식과 위배되므로 인스턴스의 일관성이 유지되지 못하는 결과를 초래하게 될 것이다. sameAs 관계 설정에 대한 사용자의 부적절한 요구에 대해 sameAs 관계 설정부에서는 적절한 에러 메시지를 출력할 필요가 있는데, 예를 들어 기존에 이미 A-sameAs-B, B-sameAs-C, C-sameAs-D와 같은 sameAs 관계들이 존재하고 있는 상황에서 B와 C를 sameAs로 묶으라는 sameAs 설정 요구는 부적절할 것이다. sameAs 그룹 지식 설정부와 sameAs 그룹 지식 해제부는, sameAs 관계 설정 및 해제로 인해 변경되어야 할 <305>sameAs 그룹의 지식을 설정하거나 해제하는 장치들이다(도 8 참조). 본 발명에서는 sameAs 그룹의 지식을sameAs 그룹의 대표 개체가 갖는 속성 값들로 정의한다. 따라서 sameAs 그룹의 대표 개체는 개별 속성 타입별로해당 sameAs 그룹 내의 모든 소속 개체들의 속성 값들을 대표하는 속성 값을 유지하고 있어야 한다. 예를 들어,연구자의 Top 3 연구 분야를 그 연구자가 작성한 논문들의 원문으로부터 자동 추출하여 할당해 둔 온톨로지 인스턴스 데이터가 있다고 할 때, 온톨로지 내에 존재하는 두 명의 동명이인 연구자들 A와 B에 대해 A를 대표로하는 sameAs 관계 A-sameAs-B를 설정하게 되면, sameAs 그룹 [A, B]에 대한 Top 3 연구 분야는 A와 B의 전체논문들에 대해 재계산되어야 하는데 이는 실시간 응답속도를 보장하기 어려운 계산량을 요구할 가능성이 클 것- 34 -공개특허 10-2008-0071213이다. 본 발명에서는 이처럼 sameAs 관계 설정으로 인해 만들어지는 sameAs 그룹의 대표 개체가 갖는 속성 값들에 대한 계산의 부담을 sameAs 그룹 지식 설정부에서 담당하도록 구성함으로써 sameAs 처리와 관련된 온톨로지기반 추론 시스템의 실시간 응답 속도를 보장할 수 있도록 하였다.sameAs 후 처리부는, 사용자 질의의 처리 결과에 나타난 개별 개체들 중 sameAs 관계로 엮인 개체가 발견될 경 <306>우 해당 개체를 그 개체가 소속된 sameAs 그룹의 대표 개체의 URI로 교체하는 장치이다(도 9 참조). 4-2. 원문으로부터의 정보추출기법을 사용한 동명저자 중의성 해소 <307>도 10은 도 3에서 인력개체 확인 수행시 원문으로부터의 정보추출기법을 사용한 동명저자 중의성 해소 방법을 <308>보인 흐름도이다.먼저 이 장에서는 논문의 원문 텍스트로부터 동명 저자 중의성 해소 정보를 자동 추출하고, 동명 저자 중의성 <309>해소 정보와 논문 서지정보를 활용하여 동명 저자의 중의성을 해소하는 것을 설명한다.이를 위해 본 발명에서는 대용량 과학 기술 문헌의 탐색 및 검색 수행시 논문 서지정보의 자동 추출과 동명 저 <310>자 중의성 해소 정보의 자동 추출을 수행하고, 추출된 정보를 이용하여 동명 저자의 중의성을 해소한다.그리고 논문 서지정보는 '저자', '논문제목', '게재정보(게재지명, 게재년도 등)'로 구성된다. 이 중 저자는 이 <311>름(예: '홍길동' 혹은 'Jeffrey D. Ullman')으로 표현됨으로 인해, 동일 이름을 가진 서로 다른 저자를 구분해주지 못한다. 이러한 동명 저자의 중의성을 해소하기 위한 기존 방법들은, 서지정보('공동 저자명', '논문제목', '게재정보')에 의존해 왔다. 그러나 논문의 원문에는, 동명 저자 중의성 해소에 도움을 주는, 다음과 같은6가지 부가적인 정보들이 담겨 있다.- 저자의 전자메일 주소 <312>- 논문작성 당시의 저자의 소속기관정보 <313>- 논문을 다루는 분야에 대한 키워드(들) <314>- 논문의 연구를 지원한 연구과제번호 정보 <315>- 논문을 작성한 저자의 저술 스타일 <316>- 논문 원문 텍스트 내의 용어 집합 <317>이러한 논문 서지정보와 동명 저자 중의성 해소 정보(논문 원문 내의 정보)를 추출하여 동명 저자의 중의성을 <318>해소한다.이를 상세히 설명하면 다음과 같다. <319>1) 논문 서지정보의 자동 추출 <320>동명이인 구별 문제는 최근 시맨틱 웹(semantic web)과 온톨로지(ontology)에 대한 관심이 높아지면서 이슈로 <321>부각되고 있다. 논문의 서지정보를 온톨로지로 구축하기 위해서는 이름이 같은 저자들이 동명이인인지 여부를판단하는 것이 중요하다. 일반 문서에서와는 달리, 서지정보에서는 소속과 이메일(Email)을 유용한 정보로 사용할 수 있으나 그것만으로는 충분치 못하며, 이를 보완하기 위한 한 방법으로 공저자 관계를 이용하는 것이 유용함을 살펴본다.이름은 고유한 개체를 구별하기 위한 것이지만, 실세계에서는 둘 이상의 서로 다른 개체가 동일한 이름을 갖는 <322>경우를 흔히 접할 수 있다. 인명이 그 대표적인 예라고 할 수 있다. 예를 들어, 싸이월드( )의 회원찾기에서 '김영희'라는 1980년생 여자를 찾으면 무려 213명이나 나타난다. 이들은 모두 이름은 같지만 서로 다른 고유한개체를 지칭하는 동명이인인 셈이다.동명이인 구별 문제는 최근 시맨틱 웹과 온톨로지에 대한 관심이 높아지면서 이슈로 부각되고 있다. 시맨틱 웹 <323>에서는 모든 개체는 식별자(Unique Resource Identifier, URI)로 구별되어야 하기 때문이다. 즉, 213명의 '김영희'를 시맨틱 웹에서 다루기 위해서는 하나하나를 구별할 수 있어야 한다.그래서 위의 '김영희'의 예에서, 실세계에서는 주민등록번호와 같은 식별자로 구분할 수 있지만, 보통의 문서에 <324>서는 그러한 식별자 없이 단순히 이름만으로 언급되므로 서로 다른 두 문서에 나타나는 '김영희'라는 이름이 동일한 사람을 가리키는지를 판단하기 위해서는 온전히 문맥정보에 의지해야 하므로 쉽지 않은 작업이다. 이에 비해 논문의 서지정보에 나타나는 저자 이름에 대한 동명이인 구별은 상대적으로 쉬운 작업이라 할 수 있다. 논문- 35 -공개특허 10-2008-0071213의 서지정보는 메타정보를 가리키는 것으로, 제목을 비롯하여 저자명, 저자의 소속, 이메일(Email), 출처, 연도등을 포함한다. 여기서, 소속과 Email 등은 같은 이름의 저자를 식별하는데 필요한 양질의 문맥정보로서 잘 정리되어 제공될 수 있기 때문이다.논문을 비롯하여 보고서, 특허 등의 연구 성과물과 인력에 대한 정보는 최근 국가과학기술정보유통 서비스를 위 <325>한 온톨로지 구축의 대상으로 인식되고 있다.온톨로지로 구축된 인력 및 연구 성과물 정보는 개별 연구자나 기관, 지역의 연구 동향 파악과 공저자관계를 이 <326>용한 연구자 네트워크 파악, 연구 분야별 전문가 추천 등의 고급 응용 서비스에 다양하게 활용될 수 있다. 연구성과물의 서지정보는 바로 이러한 온톨로지를 구축하기 위한 첫 단계라 할 수 있다. 따라서 서지정보의 저자 이름에 대한 동명이인 여부를 판단하는 작업은 반드시 필요하며 동시에 높은 정확도를 요구한다.앞서 언급하였듯이, 서지정보에서의 동명이인 구별은 보통의 문서의 경우에 비해 상대적으로 쉬운 것은 사실이 <327>다. 이는 서지정보에 저자의 소속과 Email을 포함하기 때문이다. 그러나 이러한 정보가 저자의 동명이인 문제를완전히 해결하지는 못한다. 따라서 이를 보완하기 위한 한 방법으로 본 발명에서는 공저자 관계의 효용성을 살펴보고자 한다.논문의 서지정보는 제목, 저자명, 소속, Email, 출처, 연도 등을 포함하는 메타데이터를 말한다. 이 서지정보를 <328>온톨로지로 구축하기 위해서는 서지정보에 포함된 각 개체를 유일하게 식별할 수 있어야 한다. 여기서 가장 문제가 되는 것이 저자명에 대한 동명이인 구별이다. 즉, 서로 다른 서지정보에 같은 이름의 저자가 나타날 때,그것이 동일인을 가리키는지 여부를 판단하는 것이 중요하다.일반 문서에서와는 달리, 논문의 서지정보에서는 각 저자의 소속과 Email에 대한 정보를 담고 있어서, 비교적 <329>구분이 쉬울 수 있다. 그러나 실제에서는 이 정보만으로 온전히 구분하기 어려운 경우가 흔히 발생한다.첫 번째로 논문에 소속이나 Email 정보가 기재되지 않은 경우가 그러하다. 양식이 엄격한 논문지와는 달리, 학 <330>술대회의 논문인 경우, 비록 지정된 양식에는 소속과 Email을 기재하도록 되어 있다고 하더라도 저자가 이를 따르지 않는 경우가 종종 있다. 저자가 다수인 경우, 각 저자별로 소속과 Email을 명확히 구분하기 어려운 경우도이에 해당한다.두 번째로 동일 저자의 소속과 Email 표기가 일관되지 않은 경우이다. 소속을 표기하는데 있어서, 기관만을 표 <331>기하거나 기관과 부서를 함께 표기한 경우, 부서를 'XYZ학과' 혹은 'XYZ학부', 'XYZ연구실'과 같이 다르게 표현한 경우를 흔히 볼 수 있다. 덩치가 큰 기관에서는 한 기관 내에 동명이인이 흔히 있을 수 있다는 점을 감안할때, 저자의 기관명만이 일치한다고 해서 동일인으로 판단하기에는 위험요소가 있다. 예를 들어, 연세대학교 컴퓨터과학과의 '조성배'와 연세대학교 대학원 인지과학협동과정의 '조성배'가 동일인이라고 단정할 수는 없다.Email의 경우도 마찬가지로, 한 사람이 둘 이상의 Email주소를 사용하는 경우를 흔히 볼 수 있다. 기관에서 제공하는 Email과 부서 혹은 연구실에서 제공하는 Email, 웹 포털사이트에서 제공하는 Email 등, 복수 개의 Email을 혼용할 때, 그 Email이 가리키는 사람이 동일인임을 알기 어렵다. 예를 들어, ' ', ' ', ' ', ' ' 와 같이 다른 Email을 갖는 여러 '조성배'가 동일인이라고 단정하기는 어렵다.세 번째로 시간에 따라 소속과 Email이 바뀌는 경우이다. 저자가 소속을 옮기는 경우는 흔히 발생하며, 이 때, <332>Email도 함께 바뀐다. 기관 내에서 부서를 옮기거나 부서명 자체가 변경되는 경우도 이에 해당한다. 이 경우,논문의 발행연도를 참조하는 것이 도움이 될 수 있다.이와 같이, 소속과 Email은 동명이인을 구별하는데 필요한 중요한 정보를 제공하지만, 그것만으로는 부족한 경 <333>우가 흔히 발생한다. 이런 경우에, 추가적으로 이용할 수 있는 정보가 바로 공저자 관계이다.2) 공저자 관계 이용 <334>소속이나 Email과 마찬가지로, 공저자 관계는 동명이인을 구별하는데 중요한 정보로 활용될 수 있다. 논문의 공 <335>동 저자들은 서로 간에 학술적으로 밀접한 관계를 맺고 있으며, 공저자로 들어간 논문의 수가 많을수록 그 관계의 정도는 더 밀접하다고 할 수 있다. 따라서 두 논문에 대해, 각각 두 명씩의 저자의 이름이 서로 같을 때 그들이 동일인일 가능성은, 한 명씩의 저자 이름이 서로 같을 때 그들이 동일인일 가능성에 비해 훨씬 높다. 또한공저자 관계가 더 많이 공유될수록 동일인일 가능성은 더욱 높아진다.공저자 사이의 학술적 관계는 어느 정도 지속되는 것이 보통이다. 심지어, 저자가 소속을 바꾼 경우 예를 들면, <336>학위 과정을 마치고 같은 분야에서 학술활동을 계속하는 경우에도 학술적 관계를 계속 유지하는 것을 흔히 볼수 있다. 이 말은 저자의 소속과 Email이 같지 않더라도 공저자 관계를 통해 그 저자가 동일인임을 알아내는 것- 36 -공개특허 10-2008-0071213이 가능하다는 것을 뜻한다.이미 동일인으로 판명되었으면 각각의 공저자 집합을 하나로 합침으로써 비교할 수 있는 공저자 집합을 늘려 나 <337>갈 수 있다.3) 동명 저자 중의성 해소 정보(논문 원문 내의 정보)의 자동 추출 <338>대용량 과학 기술 문헌의 탐색 및 검색에 있어서 저자, 저자 소속 기관, 게재지 등에 대해 고유 식별자에 기반 <339>한 표현의 필요성이 증가하고 있다. 특히, 과학 기술 문헌의 저자가 단순히 이름으로 표현될 경우, 동일명을 가진 서로 다른 저자들에 대한 구분은 사용자의 검색 부담을 가중시키게 된다. 이러한 동명이인의 문제를 해결하기 위한 기존의 접근법들은 공저자 정보, 논문 제목 등의 서지정보에 의존하는 공통점을 지닌다. 그러나 기존의방법들은 공저자가 없거나 논문 제목 간의 공통 어휘가 발견되지 않을 경우 어려움을 겪게 된다. 이 장에서는동명저자 문제 해소를 위한 기존의 접근법을 보완하기 위해, 동명저자들의 논문 원문의 내용에 기반한 문서 군집화 방법을 사용한다.웹의 보편화는 기존에 종이의 형태로 접근했던 논문 정보(예: 저자, 제목, 출처 등 서지정보와 원문 그리고 인 <340>용정보 등)를 전자화된 형태로 이용할 수 있도록 변화시켰다. 이후, 전자화된 논문 정보의 양은 점점 증가하고있으며, 이에 따라 다양한 논문 검색 사이트들이 생겨났다. 그러나 현재의 문자기반의 논문 정보 표현 방식에있어서는, 연구자나 발명자가 원하는 논문 정보를 찾는 데 많은 시간과 노력을 요구하게 된다. 예를 들어, 논문정보 중 저자는 이름으로 표현되는데, 그 기술 방식이 영어의 경우 통일되어 있지 않으며(예: John R. Smithvs. Jonathan Richard Smith), 동명 저자의 중의성(예: Harvard Univ.의 John R. Smith와 MIT의 John R.Smith)이 해소되어 있지 않음으로 인해, 저자명으로 논문을 검색할 경우 재현율과 정확률을 떨어뜨리게 된다.또한, 이러한 저자 표현의 문제는 대용량 논문들로부터 구축된 저자 인용망의 질적 수준을 떨어뜨리게 된다. 동명 저자 중의성 해소를 위한 기존 방법들은 중의성 해소의 자질 측면에서, 개별 동명 저자가 작성한 논문의 <341>공동저자(들), 제목, 게재지명 등을 사용하고 있다. 이러한 자질을 사용하는 기본 가정은, \"한 연구자는 일정기간 동안, 특정한 몇 명의 연구자와 공동 연구를 수행하며, 연구 분야가 크게 바뀌지 않으며, 제한된 몇 개의학술대회나 학술지에 논문을 투고하는 경향이 있다\"는 것이다.그러나 동명 저자의 논문집합에서 논문간 공유되는 공저자가 없을 수 있으며, 한 저자의 연구 분야를 기술하는 <342>데 있어서 논문 제목만으로는 부족할 수 있으며, 동일 게재지에 투고하는 동명 연구자는 적지 않을 수 있다. 본발명에서는 서지 정보로부터 획득되는, 동명 저자의 자질 타입의 한계를 극복하기 위해 논문의 원문 텍스트를자질로 활용하고자 한다.외국인 저자에 대한 동명이인 해소에 있어서는, 동일 저자명 표기의 다양한 변이형들로 인해, 동일개체/복수표 <343>현과 복수개체/동일표현의 두 문제가 복합적으로 발생한다. 한글 저자명의 경우는 이름 표기에 일관성이 있어동일개체/복수표현의 문제가 없는 듯 보이나, \"홍길동\"과 \"Gil-Dong Hong\" 혹은 \"Hong, G.D.\"을 매치해야 하는상황을 고려하면 유사표현의 그룹화 문제를 무시할 수 없을 것이다. 따라서 동일 저자명 해소 문제를 다루기 위해서는 개체 표현의 내적 자질과 외적 자질을 동시에 고려하는 것이 일반적이다. 그러나 본 발명에서는 동명 저자의 중의성 해소 문제를 한글로 제한하여 다룰 것이므로, 내적 자질은 사용되지 않으며, 외적 자질 중에서도새롭게 제안하는 원문 텍스트 자질의 효용성만을 평가하고자 한다.동명 저자 해소를 위한 기존 연구는 크게 군집(clustering) 기반 방식과 분류(classification) 기반 접근법으로 <344>나눌 수 있다. 군집화 방식은 학습데이터가 필요 없지만, 분류 기반 방법은 분류 모델을 만들기 위해 학습데이터가 요구된다는 단점이 있다. 또한, 원론적으로 분류 기반 방식은 분류 대상이 되는 목표 클래스가 미리 정의되어 있을 때 적용된다. 따라서 동명 저자 해소의 경우처럼 동일 저자명을 갖는 개체들이 실제 몇 명의 사람(클래스)에 대응될 지 미리 정할 수 없는 상황에서 분류적 접근법을 적용하는 것은 무리가 있다 하겠다. 본 발명에서는, 동명 저자 해소 문제에 보다 바람직한 접근법인 군집 기반 방식을 사용한다.이 장에서는 논문의 저자 표현에서 발생하는 동명 저자의 중의성 해소 문제를 다루기 위해, 중의성 해소를 위한 <345>자질 타입으로 개별 동명 저자의 논문 원문 텍스트를 사용할 것을 제안하였다. 그래서 원문 텍스트 자질이 다른자질들과 결합되었을 때, 동명 저자의 중의성을 해소하는 데 도움이 된다. 또한 동명 저자의 논문 원문 텍스트를 이용하여 논문 원문 텍스트 내의 용어 집합을 활용할 수 있다.또한 이외에도 저자의 전자메일 주소, 논문작성 당시의 저자의 소속기관정보, 논문을 다루는 분야에 대한 키워 <346>드(들), 논문의 연구를 지원한 연구과제번호 정보, 논문을 작성한 저자의 저술 스타일 등을 활용하여 동명 저자- 37 -공개특허 10-2008-0071213의 중의성 해소 정보를 자동 추출할 수 있게 된다.4-3. URI 기반 저자 인용 관계 및 네트워크 구축 <347>도 11은 도 3에서 URI 기반 처리 수행시 URI 기반 네트워크 구축의 예를 보인 흐름도이다. <348>그래서 크게 인용정보추출, 문헌 기반 인용 관계 구축, 저자기반 인용관계 구축, 그리고 인용 네트워크 구축의 <349>네 단계로 나누어진다.첫 단계인 인용 정보 추출에 앞서 먼저 전처리로 원문을 수집하고 텍스트 링크 소프트웨어를 이용하여 원문을 <350>텍스트로 변환한다. 다음으로 정규식을 이용하여 참고문헌으로부터 인용 정보를 추출한다. 두 번째 단계인 문헌기반 인용관계 구축은 앞 단계에서 추출된 참고문헌 부분에 기술된 문헌의 제목을 이용하여 개별문헌에 문헌(객체) URI를 할당한다. 세 번째 단계로 문헌기반 인용관계를 이용하여 저자기반 인용관계를 구축한다. 마지막 단계로 저자 중심 인용 네트워크를 구축한다. 여기에서 저자기반 인용관계는 기존 방식에서와 같은 제 1 저자를기준으로 한 인용관계가 아니라 전체 저자들 간의 인용 관계로 확장된 것이다.또한 도 11에서는 URI 서버에서 문헌 URI와 인력 URI가 관리되고 있는 것을 보여주고 있는데, 문헌 URI 저장소 <351>에서는 개별 문헌에 고유한 식별자를 자동 부여하여 해당 문헌의 메타 정보를 관리하며, 인력 URI 저장소에서는인력에 대해 고유한 식별자를 반자동 방법으로 부여하여 해당 인력의 메타 정보를 관리하게 된다.1) 인용 정보 추출 <352>인용 정보 추출의 자동화로 얻을 수 있는 가장 큰 장점은 지속적으로 변화하며 생성되는 인용 정보를 시스템적 <353>으로 바로 반영할 수 있다는 점이다. 이로 인해 인용정보를 이용한 다양한 특정 지역 및 특정 분야의 지식의 구조와 흐름의 파악이 용이하게 되며, 이용자 연구, 과학사 연구, 특정분야 과학자의 커뮤니케이션 유형 규명, 과학적 영향 평가 및 생산성 평가의 측정 등의 연구에 기여할 수 있는 바가 크다고 할 수 있다.그러나 자동적인 인용 정보 추출의 어려운 점은 저자들의 참고 문헌 기술 방식이 일정하지 않고 다양하다는 점 <354>이다. 다시 말하면, 참고문헌은 개략적으로 \"저자, 제목, 출처\" 등의 순서로 기술되지만, 참고문헌을 기술하는방식은 원문에 따라, 저자에 따라, 그리고 게재지의 요구사항에 따라 다양한 형태를 띠고 있는 것이 현실이다.도 12는 도 11에서 인용정보 추출 단계의 상세흐름도이다. <355>그래서 도 12에서는 인용 정보 추출의 세 단계를 보여주고 있다. 인용 정보 추출은 참고문헌 영역 확인, 인용 <356>정보 추출, 인용 정보 메타데이터 추출의 세 단계로 구성되어 있다. 도 12에서는 참고 문헌 영역 확인과 인용정보 추출이 끝나고, 인용 정보 메타데이터를 추출하는 과정을 보여주고 있다. 도 12에서 문헌에 할당된 객체URI 식별자는 \"KISTI.PCD.0004407\"이며, 저자 URI는 \"0000003854\"이다.원문으로부터 인용 정보 추출의 첫 번째 단계는 참고문헌 영역을 결정하는 것이다. 원문의 참고문헌 영역은 동 <357>일한 학술대회일지라도 저자에 따라 \"Reference\", \"References\", \"참 고 문 헌\", \"참고문헌\" 등의 다양한 변형이 가능하기 때문에 이에 대해 적절한 정규식을 지정하는 것이 필요하다. 그리고 참고문헌 영역을 지정하는 또다른 이유는 문헌의 텍스트 변환 후에 참고문헌 영역은 문헌의 끝부분에 항상 위치하고 있는 것이 아니기 때문이다.도 13은 도 12에서 인용정보 메타데이터 추출 단계의 상세흐름도이다. <358>그래서 인용 정보의 메타데이터는 정규화된 필드로 구성되는, 본 발명에서는 인용 문헌의 서지정보로부터 학회 <359>필드, 학술대회 필드, 권 필드, 호 필드, 연도 필드에 해당하는 정보를 추출한다. 인용 정보 메타데이터 추출은도 13에서와 같은 단계로 진행된다.첫 번째 단계인 공백제거 및 오류제거는 추출되는 한글에 대한 처리를 용이하게 하기 위한 전처리 단계에 해당 <360>한다. 오류에 해당하는 문자열은 원문을 텍스트 필터를 사용하여 변환할 때 생성되는 특정한 패턴을 가지는 문자열이기 때문에 쉽게 제거가 가능하다.두 번째 단계는 문자열을 구분 기호로 분리하여 토큰을 생성하는 단계이다. 이는 문자열을 특정한 단위로 처리 <361>하기 위함이며, 구분 기호로는 ',', '.' 등이 사용된다.세 번째 단계인 정보 추출에서는 이전 단계에서 분리된 토큰들이 추출 조건에 부합되면 해당 정보를 추출하여 <362>메타데이터의 필드를 채우도록 진행된다.- 38 -공개특허 10-2008-0071213도 14는 도 13에서 정보추출시 학술대회 추출 필드 및 추출 정규식의 예를 보인 표이다. <363>네 번째 단계인 정규화는 메타데이터의 필드를 하나의 정규화된 데이터로 변환하는 단계이다. <364>도 15는 도 13에서 정규화시 학회명 변환 테이블의 예를 보인 표이다. <365>이러한 도 15에서 대표 학회명은 한국과학기술정보연구원의 학회마을의 학회명칭을 기준으로 생성할 수 있다. <366>보통 전거라 부르는 도 15의 변환테이블은 지속적으로 구축되어야 할 것이다. 이외에도 '춘계학술대회'와 '봄학술대회' 등 계절에 관련한 학술대회 명칭이 함께 출현하기 때문에 학술대회명에 대한 정규화의 과정도필요하다. 이외에 권(Volume)과 호(Issue)의 정보는 저자의 기술이 일관되게 기술되지 않는 경유가 많기 때문에숫자로 변환하여 처리한다(예, Vol.32, V.32, 32권 등). 학술대회 연도정보도 일관되게 기술되지 않는 경우가많으므로 정규화의 과정이 필요하다(예, 1999, 99, '99 등).논문지에 대한 메타데이터의 정규화 과정도 위와 유사한 과정을 거쳐 생성된다. 논문지의 메타데이터 정규화 필 <367>드는 학회명, 논문지명, 권, 호, 연도 필드들로 구성된다. 논문지 메타데이터 생성 과정에서도 학술대회 메타데이터 생성 과정에서처럼 논문지명에 대한 정규화의 과정이 필요하다.도 16은 도 13에서 정규화시 논문지명 변환 테이블의 예를 보인 표로서, 대표 논문지명으로 변환되는 다양한 논 <368>문지명의 예를 보이고 있다.2) URI 기반 논문(객체) 인용 관계 구축 <369>기존의 문헌의 인용 간의 관계를 단순히 문자열 기반으로 유사도를 이용하여 구축하는 방법으로는 문헌 자체의 <370>접근성을 보장해내지 못한다. 따라서 본 발명에서는 이를 개별 문헌에 고유한 URI를 부여함으로써 해결한다. 또한 문헌에 부여되는 객체 URI는 저자들의 인용 관계 생성을 위한 고유한 키 값으로 유용하게 사용될 수 있다.URI 기반 인용 관계를 설명하기 위해서 문헌 URI와 인력 URI의 식별체계를 설명한다. 문헌 URI 식별체계는 호환 <371>성을 고려해 정의하며, 생성 형식은 \"등록관리기관코드, 자료유형코드, 일련번호\"의 형태를 갖도록 할 수 있다.\"등록관리기관코드\"는 객체의 종류에 따라 학술지, 보고서, 개인공유자료, 기반정보 등으로 구분하며, \"자료유형코드\"는 학술지, 학술대회, 학위논문, 특허, 연구보고서, 개인공유자료 등으로 구분한다. 마지막으로 \"일련번호\"는 7자리의 숫자를 사용할 수 있다.인력 URI 식별체계는 국가과학기술인력 종합정보시스템에서 사용하는 10자리 인력 ID 값에 기반하여 설계할 수 <372>있다.도 17은 도 11에서 문헌기반 인용관계 구축 단계의 상세흐름도이다. <373>이러한 도 17은 문헌 중심의 인용 네트워크를 구축하기 위한 세 단계를 보여준다. 첫 번째 단계는 인용 정보 중 <374>에서 제목을 추출한다. 다음 단계는 문헌제목을 이용하여 문헌 간에 인용 네트워크를 구축하는 것이다. 마지막단계는 문헌에 해당하는 객체 URI 저장소 내에 저장되어 있는 객체 URI를 이용하여 문헌 중심으로 인용 관계를구축하는 것이다.참고문헌 제목추출 단계에서 문헌 제목의 추출은 보통 이중인용부호(\")를 이용하여 그 경계를 인식할 수 <375>있지만, 원문 출전에 따라 이중인용부호(\")와 단일인용부호(') 등 여러 구분자들이 사용될 수 있으므로, 다양한형태적 특징을 반영하는 제목 추출 과정이 필요하다. 또한 \"문헌제목\"과 같은 형태가 관습적으로 많이 사용되기때문에 이에 대한 처리도 필요하다.다음으로 추출된 제목들을 이용하여 문헌 중심의 인용 네트워크를 구축한다. 인용 네트워크를 구축하기 위해 추 <376>출된 문헌 제목들을 인용과 피인용의 쌍으로 단순화한다.마지막으로 인용과 피인용의 관계를 URI 서버를 이용하여 객체 URI로 변환한다. 도 17의 하단에서 객체 URI 간 <377>의 인용관계를 확인할 수 있다.3) URI 기반 저자(인력) 인용 관계 구축 <378>도 18은 도 11에서 저자기반 인용관계 구축 단계의 상세흐름도이다. <379>이러한 도 18에서는 문헌 인용 네트워크를 확장한 저자(인력) URI 기반 인용관계 구축의 주요 단계를 보여준다. <380>첫 번째 단계는 인용-피인용으로 연결된 문헌 URI 쌍으로부터 하나의 문헌 URI를 획득한다. 다음으로 개별 문헌URI의 저자에 해당하는 인력 URI를 URI 서버로부터 획득하고, 마지막으로 문헌 URI 쌍으로 묶인 두 문헌의 저자- 39 -공개특허 10-2008-0071213URI 집합들 간에 인용-피인용 관계를 생성한다.4) 인용 네트워크 구축 <381>인용 네트워크는 지식의 구조와 흐름을 파악하는 방법으로 인용과 피인용의 관계를 이용하여 정보의 흐름을 파 <382>악하고 이를 이용해서 특정 지역 및 특정 분야의 지식의 구조와 흐름을 파악하고자 하는 연구에 사용된다.특히, 저자 중심 인용 네트워크 구축은 저자간의 인용을 통한 성과에 대한 질적인 판단의 기준을 제공해 주기도하지만, 부가적으로 저자 간의 사회적인 연결 네트워크를 보여주는 지표로서 사용될 수 있다.도 19는 도 11에서 인용 네트워크 구축 단계에 의한 인용 네트워크 구축의 예를 보인 개념도이다. <383>그래서 도 19에서는 저자 중심의 인용 네트워크가 인력 URI를 이용하여 저자의 고유성을 확보하게 되면, 인용- <384>피인용의 관점에서 동명이인으로 인한 애매성이 해소되어 정확한 저자 중심 인용 네트워크가 구축되는 예를 보여주고 있다.도 20은 도 11에 의해 URI 기반 처리 수행시 저자 중심 인용네트워크 그룹 및 인용네트워크 구현의 예를 보인 <385>개념도이다.이처럼 이 장에서는 지속적으로 추가되고 갱신되는 인용 정보를 일관성 있게 반영하고 정확한 문헌의 접근성을 <386>보장하기 위해, 시맨틱 웹 기술의 하나인 URI를 문헌(객체 URI)과 저자(인력 URI)에 적용하여 저자 중심 인용관계를 네트워크를 구축한 것을 설명하였다.4-4. URI 기반 성과 정보 관리 <387>이 장에서는 시맨틱 웹 환경에 맞도록 URI 기반으로 성과 정보를 등록하고 관리하는 것을 설명한다. <388>또한 시맨틱 웹 기반 기술인 URI(Uniform Resource Identifier)와 RDF(Resource Description Framework <389>Triples)를 이용하여 성과 정보를 포함한 다양한 정보를 등록하고 관리하는 방법을 설명한다.또한 이 장은 성과 정보 등록 방법, 관리자 승인 방법, 성과 정보 초기화 방법, 성과 정보 삭제 방법, 성과 정 <390>보 수정 방법을 포함한 성과 정보 등록 및 관리 방법으로 구성된다.그래서 온톨로지의 표현 형태인 RDF 트리플이나 RDF XML을 이용하여 성과 정보를 저장/관리하고, URI를 이용하 <391>여 성과 객체를 변별할 수 있도록 함으로써 정확한 성과 정보 활용이 가능하도록 한다.성과 정보 저장을 위해서 RDF 트리플의 경우 DBMS를, RDF XML의 경우 XML 기반 저장 장치(XML 문서 파싱 기능을 <392>포함하고 있는 장치)를 사용할 수 있다.이에 따라 온톨로지 스키마에 따라 성과 정보를 체계화(Formalization) 할 수 있고, 추론 규칙에 의한 지속적인 <393>정보 확장이 가능하고, 등록 인터페이스 및 각 단계 또는 모듈에서의 검증 과정을 통해 성과 정보의 정합성 검사가 용이하다는 특징을 가진다.또한 RDF 트리플 또는 RDF XML로 표현 가능한 모든 지식들을 다룰 수 있도록 고려함으로써 시맨틱 웹 응용 서비 <394>스에 필수적으로 활용될 것으로 기대한다.도 21은 도 3에서 URI 기반 처리 수행시 URI 기반 성과 정보 관리 시스템의 블록구성도이다. <395>그래서 성과 정보 관리부는 성과 정보를 등록하고 관리하며, URI 관리부는 성과 정보 관리부와 연결되고 URI 서 <396>버를 통해 성과 정보에 URI를 부여하고 관리하고, 지식 확장부는 성과 정보 관리부 및 URI 관리부와 연결되고,시맨틱 웹 기반 추론 서비스를 위해 지식을 확장한다.또한 성과 정보 관리부는, 성과 정보 등록 인터페이스를 통해 등록자가 성과 정보와 해당 성과물을 등록하도록 <397>하는 성과 정보 등록부; 성과 정보 등록부를 통해 등록자가 입력한 정보가 올바른지 확인하는 성과 정보확인부; 성과 정보 확인부에서 확인된 성과 정보에 대해 성과 가중치를 부여하거나, 성과 정보 또는 성과물로부터 통제된 주제 또는 분야 등을 추출하여 할당하는 부가 정보 추가부; 및 성과 정보 관리부에서 등록된 성과 정보에 대한 관리자 검증 과정이 수행되도록 하는 관리자 승인부;를 포함하여 구성할 수 있다.성과 정보 등록부에서 성과 정보는 성과 유형, 성과 출처, 유발 과제, 창작자, 창작자 정보, 제목, 공동 <398>창작자, 관련 URL 등이 포함된다.성과 정보 등록부에서 성과물은 문서 필터링이 가능한 문서 또는 스캐닝된 이미지 형식이다. <399>- 40 -공개특허 10-2008-0071213관리자 승인부는 등록된 성과 정보가 올바른 정보인지, 실재하는 정보인지 확인하여 성과 정보에 대한 신뢰를 <400>부여할 수 있도록 하고, 관리자는 해당 성과 정보를 승인하거나 거절할 수 있도록 하며, 거절된 성과 정보는 재작성 후 등록 또는 폐기 과정을 거치도록 한다.URI 관리부는 성과 정보 관리부에서 관리하는 성과 정보를 등록 및 관리하고, 성과 정보에 URI를 부여하고, 성 <401>과 정보로부터 RDF 트리플이나 RDF XML을 추출하여 정보를 지식화시켜 지식 확장에 사용할 수 있도록 한다.지식 확장부는, 확장된 지식이 SPARQL(SPARQL Protocol And RDF Query Language), RDQL(RDF Data Query <402>Language)을 포함한 시맨틱 웹 질의 언어를 이용하여 추론 결과를 얻는 데 참조되도록 한다.도 22는 도 3에서 URI 기반 처리 수행시 URI 기반 성과 정보 관리 방법을 보인 흐름도로서, 성과 정보 관리 시 <403>스템과 URI 서버와 지식 확장 모듈 간의 정보 교환을 통해서 성과 정보를 등록하고 관리하는 전체 시스템 내에서의 각 모듈 별 연계 여부를 보여준다.그래서 성과를 등록하고 관리하는 방법(ST101 ~ ST103, ST105), URI 서버를 통해 성과 정보에 URI를 부여하고 <404>관리하는 방법(ST104), 시맨틱 웹 기반 추론 서비스를 위해 지식을 확장하는 방법(ST106)으로 구성된다.성과 정보 등록(ST101)은 성과 정보 등록 인터페이스를 통해 등록자가 성과 정보(메타데이터)와 해당 성과물(원 <405>본 등)을 등록하는 과정이다. 성과 정보(메타데이터)는 성과 유형(예, 논문, 보고서, 특허 등), 성과 출처(예,학술대회, 학술지 등), 유발 과제, 창작자(예, 논문 저자, 연구 참여자 등), 창작자 정보(예, 창작자 소속기관, 소속 부서 등), 제목, 공동 창작자, 관련 URL 등을 포함한다.성과물은 문서 필터링(서식 문서로부터 텍스트를 추출할 수 있도록 하는 방법)이 가능한 문서일 수도 있고, 스 <406>캐닝된 이미지 형식일 수도 있다. 후자의 경우에는 문자 인식기를 사용하여 텍스트를 추출할 수 있다.성과 정보 확인(ST102)은 등록자가 입력한 정보가 올바른지 확인하는 과정이다. 등록자가 입력한 정보를 다시 <407>확인시켜주어 등록 오류를 방지하도록 한다.부가 정보 추가(ST103)는 성과 정보에 대해 성과 가중치를 부여하거나, 성과 정보(메타데이터) 또는 성과물로부 <408>터 통제된 주제 또는 분야 등을 추출하여 할당하거나 하는 과정이다. 이 과정을 통해 등록자가 입력하지 않은새로운 정보들을 획득할 수 있다.URI 관리(ST104)는 해당 성과 정보(메타데이터)를 등록 및 관리하고, 성과 정보에 URI를 부여하고, 성과 정보로 <409>부터 RDF 트리플이나 RDF XML을 추출하여 정보를 지식화시켜 지식 확장에 사용할 수 있도록 하는 과정을 포함한다. 여기서 지식화이라 함은 정보에 대해 온톨로지를 투영하여 객체 관계 속성(Object Property)을 포함시켜 인스턴스화(Instantiation)하는 것으로 정의할 수 있다.URI 관리는 별도의 URI 서버를 이용하여 이루어질 수 있는데, 이 경우에는 등록, 검색, 관리 등을 위한 사용자 <410>인터페이스를 제공한다.관리자 승인(ST105)은 등록된 성과 정보에 대한 관리자 검증 과정을 의미한다. 등록된 성과 정보가 올바른 정보 <411>인지, 실재하는 정보인지 확인을 함으로써 성과 정보에 대한 신뢰를 부여할 수 있다. 관리자는 해당 성과 정보를 승인하거나 거절할 수 있으며, 거절된 성과 정보는 재작성 후 등록 또는 폐기 과정을 거치게 된다.지식 확장(ST106)은 시맨틱 웹 기반 추론 서비스에서 보다 용이하게 지식을 이용할 수 있도록 추가적인 관계들 <412>을 발견해 내는 과정으로 추론 규칙을 적용하여 URI 관리에서 생성된 지식을 확장한다. 추후 확장된 지식은SPARQL(SPARQL Protocol And RDF Query Language), RDQL(RDF Data Query Language) 등 시맨틱 웹 질의 언어를이용하여 추론 결과를 얻는 데 참조된다.도 23은 도 22에서 성과 정보 등록을 상세히 보인 상세흐름도로서, 성과 정보 객체 URI를 할당하고 DB-트리플 <413>/XML 변환하는 등의 방법을 통해 성과 정보를 등록하는 단계를 보여준다.이러한 도 23은 성과를 등록하는 단계(ST101 ~ ST104)를 보여준다. <414>그래서 부가 정보가 추가된 성과 정보(메타데이터)는 성과 정보 자체에 대한 객체 URI를 할당받아야 다른 성과 <415>정보(메타데이터)와 구별되는 완전한 성과 정보가 되므로, 이를 할당받기 위해 URI 서버에 성과 정보(메타데이터)를 전달한다(ST111).URI 서버는 전달받은 성과 정보(메타데이터)에 성과 정보 객체 URI를 부여한다(ST112). 이때 대상 성과 정보(메 <416>타데이터)가 기존에 성과 정보 객체 URI를 할당받은 성과 정보들과 중복되는 지를 검사하여, 중복된 성과물인- 41 -공개특허 10-2008-0071213경우에는 성과 정보 객체 URI 부여를 하지 않는다.DB-트리플/XML 변환(ST113)은 온톨로지를 참조하여 입력된 성과 정보(메타데이터)를 RDF 트리플 또는 RDF XML로 <417>변환한다. 이 변환 과정을 지식화라고 하며, 변환 결과를 지식이라 일컫는다.URI 서버는 DB-트리플/XML 변환이 정상적으로 완료되는 경우에 대상 성과 정보(메타데이터)의 성과 정보 객체 <418>URI와 변환 결과를 성과 정보 등록 인터페이스로 돌려준다(ST114).DB-트리플/XML 변환 완료된 성과 정보(메타데이터)는 성과 정보 관리 시스템에 다시 한번 저장된다(ST115). <419>이 성과 정보(메타데이터)는 성과 정보 객체 URI가 포함되어 있으며 URI 서버와 중복되게 저장하는 이유는 성과 <420>정보 관리 시스템에서 성과 정보 검색 서비스 등을 별도로 제공하기 위함이다. URI 서버에 성과 정보(메타데이터)를 저장하는 이유는 성과 정보(메타데이터)의 중복 여부를 판단하기 위함이다. 그렇지만, URI 서버를 별도로두지 않고 두 시스템을 하나로 통합하여 중복 저장하지 않을 수도 있다.도 24는 도 22에서 성과 정보 승인을 상세히 보인 상세흐름도로서, 관리자에 의해 성과 정보를 승인하고 해당 <421>성과 정보의 상태를 변경하는 방법을 통해 성과 정보를 승인하는 단계를 보여준다.이러한 도 24는 본 발명에 따른 관리자에 의한 성과 정보 승인 단계(ST104 ~ ST106)를 보여준다. <422>관리자는 승인 대기에 있는 성과 정보(메타데이터)에 대해 승인 인터페이스 상에서 승인이나 거절을 선택할 수 <423>있다. 승인을 선택한 경우에 해당 성과 정보 객체 URI가 지식 확장 모듈로 전달된다(ST121).지식 확장 모듈은 URI 관리 모듈로 해당 성과 정보 객체 URI를 전달하고(ST122), 그 결과로서 해당 성과 정보 <424>객체 URI와 연관된 RDF 트리플/XML을 전달받는다(ST123).해당 RDF 트리플/XML에 대해 추론 규칙을 적용하여 확장된 RDF 트리플/XML을 획득한다(ST124). <425>확장 결과가 성공적일 경우 성과 정보 관리 시스템에서 해당 성과 정보(메타데이터)의 상태를 완료로 변경한다 <426>(ST125 ~ ST126).도 25는 도 22에서 성과 정보 초기화를 상세히 보인 상세흐름도로서, 성과 정보 관리 시스템과 URI 서버와 지식 <427>확장 모듈 간에 초기화 명령을 통해서 성과 정보를 초기화하는 단계를 보여준다.이러한 도 25는 본 발명에 따른 성과 정보를 초기화하는 단계(ST104 ~ ST106)를 보여준다. <428>관리자는 성과 정보 관리 시스템에서 성과 정보(메타데이터) 초기화를 선택한다. <429>초기화 명령은 먼저 URI 서버에 전달된다(ST131). <430>URI 서버는 성과 정보(메타데이터) DB를 초기화하고 그 결과를 성과 정보 관리 시스템에 전달한다(ST132 ~ <431>ST133).초기화 명령은 다시 지식 확장 모듈로 전달된다(ST134). <432>지식 확장 모듈은 모든 RDF 트리플/XML을 삭제하고 그 결과를 성과 정보 관리 시스템에 전달한다(ST135 ~ <433>ST136).최종적으로 성과 정보 관리 시스템은 자신의 성과 정보(메타데이터) DB 내의 내용을 삭제한다(ST137). <434>도 26은 도 22에서 성과 정보 삭제를 상세히 보인 상세흐름도로서, 성과 정보 객체 URI를 이용하여 특정 성과 <435>정보를 삭제하는 단계를 보여준다.이러한 도 26은 본 발명에 따른 성과 정보를 삭제하는 단계(ST104 ~ ST106)를 보여준다. <436>관리자는 성과 정보 관리 시스템에서 특정 성과 정보(메타데이터) 삭제를 선택한다. <437>삭제 명령과 함께 성과 정보 객체 URI는 먼저 URI 서버에 전달된다(ST141). <438>URI 서버는 해당 성과 정보(메타데이터)를 삭제하고 그 결과를 성과 정보 관리 시스템에 전달한다(ST142 ~ <439>ST143).삭제 명령과 함께 성과 정보 객체 URI는 다시 지식 확장 모듈로 전달된다(ST144). <440>지식 확장 모듈은 해당 성과 정보에 대응하는 RDF 트리플/XML을 삭제하고 그 결과를 성과 정보 관리 시스템에 <441>- 42 -공개특허 10-2008-0071213전달한다(ST145 ~ ST146).최종적으로 성과 정보 관리 시스템은 자신의 성과 정보(메타데이터) DB에서 해당 성과 정보를 삭제한다(ST147). <442>도 27은 도 22에서 성과 정보 수정을 상세히 보인 상세흐름도로서, 성과 정보 객체 URI와 성과 정보를 이용하여 <443>특정 성과 정보를 갱신하는 단계를 보여준다.이러한 도 27은 본 발명에 따른 성과 정보를 수정하는 단계(ST103 ~ ST106)를 보여준다. <444>성과 정보 관리 시스템에서 특정 성과 정보(메타데이터)가 수정되는 경우 해당 성과 정보 객체 URI를 포함한 성 <445>과 정보(메타데이터)가 URI 서버로 전달된다(ST151).이 성과 정보(메타데이터)는 갱신된 성과 정보(메타데이터)이므로 URI 서버 내의 해당 성과 정보(메타데이터)를 <446>대체한다(ST152).해당 성과 정보 객체 URI는 성과 정보 관리 시스템에 전달된 후 다시 지시 확장 모듈로 전달된다(ST153 ~ <447>ST154).지식 확장 모듈에서는 먼저 해당 성과 정보 관련 RDF 트리플/XML을 삭제하고 성과 정보 승인 단계와 같은 과정 <448>을 거쳐 갱신된 RDF 트리플/XML을 전달받아 지식 확장을 수행한다(ST155 ~ ST158).그 결과는 성과 정보 관리 시스템에 전달되고 해당 시스템에서는 갱신된 성과 정보를 저장하는 것으로 수정 단 <449>계를 종료한다(ST159 ~ ST160).도 28은 도 22에서 성과 정보 상태 변경을 상세히 보인 상세흐름도로서, 관리자와 등록자에 의해 성과 정보의 <450>상태를 연속적으로 변경하는 과정을 포함하는 상태 변경 흐름을 보여준다.성과 정보(메타데이터)가 등록되면 그 상태는 승인 대기가 된다. 관리자는 승인 대기에 있는 성과 정보(메타데 <451>이터)에 대해 승인을 선택하거나 거절을 선택할 수 있다. 이러한 상태는 해당 성과 정보(메타데이터)가 삭제되지 않는 한 계속 변경될 수 있다. 성과 정보와 같이 관리자에 의해 올바르고 거짓이 없는 성과인지를 확인하는과정이 필요한 정보에 대해서는 승인 절차를 별도로 분리하고 해당 정보에 대한 상태를 변경하는 방식으로 이용자에게 그 정보가 제공되는 것을 제어할 수 있어야 한다. 승인이 되지 않은 성과 정보를 무조건 이용자에게 공개하는 경우에 해당 성과 정보에 문제가 있는 경우에 혼란이 발생할 수 있기 때문이다.성과 정보 관리 시스템에서 건 별로 성과 정보(메타데이터) 등록이 이루어지는 경우도 있지만, 관리자에 의해 <452>검증된 대량의 성과 정보(메타데이터)가 일괄 등록되는 경우도 있다. 이러한 일괄 등록의 경우 성과 정보 등록및 승인 단계(ST101 ~ ST106)를 반복적으로 수행함으로써 그 목표를 달성할 수 있다.일괄 등록 시에 특정 성과 정보(메타 데이터)들에서 등록 오류가 발생하는 경우 오류 로그에 저장하고 후에 해 <453>당 성과 정보(메타데이터)들만 확인하여 재등록을 시도한다. 일괄 등록 시에 승인 단계를 거친 성과 정보(메타데이터)들은 이용자가 검색하고 서비스 받을 수 있도록 응용 시스템을 통해 오픈할 수 있다.도 29는 도 22에서 URI 관리에 사용되는 RDF 트리플의 일 예를 보인 표로서, 성과 정보, 비성과 정보, 온톨로지 <454>스키마에 따라 RDF 트리플 유형을 구분하고 관리하기 위한 DBMS 기반 RDF 트리플의 일 예를 보여준다.'Object URI' 필드는 해당 트리플과 관련된 성과 정보 객체 URI를 저장하고 있으며, RDF 트리플은 'Subject', <455>'Predicate', 'Object'로 구분되어 저장된다. 물론 이들을 하나의 필드에 저장하고 필요에 따라 해석하여 사용할 수도 있다.'Time' 필드는 DB에 해당 RDF 트리플이 등록된 시간을 의미하며, 'SENT' 필드는 해당 RDF 트리플이 지식 확장 <456>모듈에 의해 수집되었는 지를 표시한다. 'SENT' 필드가 'T'인 경우는 지식 확장 모듈에 해당 RDF 트리플이 전달된 것을 의미하며, 'F'인 경우는 지식 확장 모듈에 아직 해당 RDF 트리플이 전달되지 않은 것을 의미한다. 이러한 방식으로 지식 확장에 이용될 RDF 트리플이 중복되거나 누락되지 않도록 관리한다. 온톨로지 스키마(Schema)역시 일관성 있는 처리를 위해서는 RDF 트리플로 변환되어 있어야 한다.'Object URI' 필드에 'OWL'로 되어 있는 경우 온톨로지 스키마를 위한 RDF 트리플을 의미하며, 'NULL'은 성과 <457>정보와 상관없는 기타 RDF 트리플을 의미한다.도 29는 DBMS에 기반하여 RDF 트리플로 처리하는 방식을 설명하고 있으나, XML 문서에 기반하여 상기 필드들을 <458>포함하여 구성할 수 있다. 이 경우는 RDF XML을 사용한다.- 43 -공개특허 10-2008-00712134-5. 통계 기반 문서 분류를 통한 시소러스 확장 및 하이브리드 문서 분류 <459>그래서 본 발명은 통계 기반 문서 분류 기법을 활용하여 시소러스를 구성하는 용어 후보를 제공하고 이를 시소 <460>러스에 부착시킴으로써 시소러스를 확장하는 방법을 제공한다. 또한 통계 기반 문서 분류와 택소노미(taxonomy,분야분류명을 대표하는 용어 집합)를 활용한 시소러스 기반 문서 분류를 결합하여 보다 향상된 성능을 보여주는하이브리드 문서 분류 시스템을 구성할 수 있게 한다.또한 본 발명에 따른 시소러스 확장 방법에서는 통계 기반 문서 분류 시스템이 이용하는 자질(문서 분류에 활용 <461>되는 문서 내의 정보로서 키워드, 문서 빈도, 상호 정보, 정보 획득량 등을 포함) 집합을 통해 용어 후보를 획득한다. 획득된 용어 후보는 현재 시소러스를 확장하기 위해 사용하는데 결국 시소러스 기반 문서 분류 성능을향상시키기 위함이다.시소러스를 구축하는 데 드는 인적, 물적 자원이 상당하므로 효율적인 구축 방안이 필요하다. 이를 위해 통계 <462>기반 문서 분류에서 효용성이 증명된 자질 집합에 포함된 용어 후보들을 사용함으로써 구축 대비 효과를 극대화할 수 있다.하이브리드 문서 분류 시스템은 통계 기반 문서 분류 시스템과 시소러스 기반 문서 분류 시스템의 결과를 조합 <463>하고 분류 결과를 생성함으로써 서로 간의 장점을 결합시킬 수 있다. 시소러스 기반 문서 분류만 사용하는 경우에는 시소러스에 포함되지 않은 용어들에 대한 대처가 약하다는 단점을 가지며, 통계 기반 분류 시스템만을 사용하는 경우에는 통계 모델의 한계 내에서만 그 성능을 보이기 때문에 분류하고자 하는 문서 특성에 맞는 문서분류를 상황에 따라 할 필요가 있다.본 발명에 따른 하이브리드 문서 분류 시스템은 서로 다른 두 분류 시스템의 장점을 결합시켜 높은 성능의 문서 <464>분류 서비스를 실현할 수 있도록 한다.도 30은 도 3에서 주제/분야 할당 수행시 통계기반 문서분류를 통한 시소러스 확장 방법 및 하이브리드 문서 분 <465>류 방법을 보인 흐름도이다.그래서 통계 기반 문서 분류를 수행한다(ST201). <466>그리고 시소러스를 확장한다(ST202). <467>또한 택소노미를 이용하여 분야분류체계-시소러스 간 매핑을 수행한다(ST203). <468>또한 시소러스 기반 문서 분류를 수행한다(ST204). <469>또한 통계 기반 문서 분류와 시소러스 기반 문서 분류를 결합하여 하이브리드 기반 문서 분류를 수행한다 <470>(ST205).또한 분류결과를 평가하고(ST206), 정답 문서 집합을 작성한다(ST207). <471>도 31은 도 30에서 통계 기반 문서 분류의 상세흐름도이다. <472>그래서 실험 문서 집합, 분야 분류 체계, 정답 문서 집합을 입력받아 자질을 추출한다. 이때 형태소 분석과 불 <473>용어 처리 중에서 하나 이상을 사용하여 자질 추출을 수행한다(ST211).그리고 기계 학습을 수행한다(ST212). <474>또한 문서 분류를 수행한다(ST213). <475>또한 자질 집합을 형성한다(ST214). <476>도 32는 도 30에서 시소러스 확장의 상세흐름도이다. <477>그래서 통계 기반 문서 분류를 수행한다. <478>그리고 통계 기반 문서 분류로부터 자질 집합을 얻는다(ST222). <479>또한 얻어진 자질 집합으로부터 키워드들을 선정한다(ST223). <480>또한 선정된 키워드들을 용어 후보로 결정한다(ST224). <481>또한 시소러스를 구축한다(ST225). <482>- 44 -공개특허 10-2008-0071213도 33은 도 30에서 분야분류체계-시소러스 간 매핑의 상세흐름도이다. <483>그래서 각 분야분류명을 위한 택소노미를 도입한다(ST231). <484>그리고 도입된 택소노미에 속한 키워드들을 시소러스에 매핑시킨다(ST232). <485>도 34는 도 30에서 시소러스 기반 문서 분류의 상세흐름도이다. <486>그래서 문서를 입력하도록 한다(ST241). <487>그리고 형태소 분석 및 불용어 처리를 수행한다(ST242). <488>또한 추출된 주요 키워드들을 시소러스 상의 용어들과 매칭시킨다(ST243). <489>그리고 매칭된 용어들로부터 택소노미를 이용하여 분야분류명을 획득한다(ST244). <490>또한 획득된 분야분류명들을 조합하여 해당 문서의 분야분류명을 결정한다(ST245). <491>도 35는 도 30에서 하이브리드 기반 문서 분류의 상세흐름도이다. <492>그래서 문서를 입력받아 통계 기반 문서 분류와 시소러스 기반 문서 분류에서 각각의 분류 결과를 획득한다 <493>(ST251).또한 두 분류 결과를 이용하여 최종 분류 결과를 생성한다. 이때 두 분류 결과에 대해 차별적 적용 방식의 <494>조합, 대등 방식의 조합, 보팅(Voting) 방식의 조합 중에서 하나 이상의 조합으로 최종 분류 결과를 생성한다(ST252).도 36은 도 30에 의해 통계적 문서 분류를 통한 시소러스 확장을 수행하는 예를 보인 개념도로서, 통계적 문서 <495>분류를 통한 시소러스 확장의 정보 흐름 순서를 보인 것이다. 그래서 도 36에서는 분야분류체계에 의해 분야분류명(또는 코드)이 부착된 정답 문서 집합으로부터 자질 집합을 추출하여, 기계 학습을 통해 통계 기반 문서 분류 시스템을 구성하고, 자질 집합에 포함된 용어들을 시소러스에 반영할 수 있도록 하는 시소러스 확장 방안에대한 정보 흐름을 보여준다.일반적으로 시소러스 기반 문서 분류 성능이 통계 기반 문서 분류보다 높고 안정적이지만, 시소러스에 포함된 <496>용어들이 문서에서 발견되는 정도가 작은 경우에 대처 방안이 없다.시소러스에 용어를 추가하는 작업은 수작업에 의존해야 하므로 인적, 물적 자원의 한계로 인해 그 속도가 더딜 <497>수밖에 없다. 또한 시소러스에 추가할 용어를 선정하는 작업도 부담으로 작용하게 된다.문서 분류 대상이 되는 문서들에 효과적인 용어를 우선적으로 시소러스에 추가하기 위한 방법으로 도 36에서는 <498>통계 기반 문서 분류 시스템에서 사용되는 자질 집합을 이용한다. 자질에는 문서를 대표할 수 있는 키워드가 포함되며 이 키워드를 용어 후보로 선정하여 시소러스 확장에 이용한다.통계 기반 문서 분류 시스템을 구성하는 요소로는 자질 추출, 기계 학습, 문서 분류가 있다. <499>자질 추출은 형태소 분석, 불용어 처리를 수행하고 문서 빈도, 상호 정보, 정보 획득량 등을 이용하여 정답 문 <500>서 집합으로부터 자질들을 추출하여 자질 집합을 생성한다.자질 집합은 기계 학습과 문서 분류를 통해 얻어진 성능 증가에 의해 그 효용성이 검증된다. <501>문서 분류는 기계 학습을 통해 얻어진 학습 모델과 실험 문서 집합을 이용하는데 통계 기반 문서 분류 성능 측 <502>정에 의해 학습 모델을 결정한다.그래서 해당 학습 모델에 사용된 검증된 자질 집합에 포함된 키워드들을 용어 후보로 선정하고 수작업으로 시소 <503>러스에 추가하는 과정을 거치면 확장된 시소러스를 얻을 수 있다.도 37은 도 30에 의해 시소러스 기반과 통계 기반이 결합된 문서 분류를 수행하는 예를 보인 개념도이다. 이러 <504>한 도 37는 시소러스 기반과 통계 기반이 결합된 문서 분류 시스템의 정보 흐름 순서를 보인 것이다. 이는 자질집합을 이용하는 통계 기반 문서 분류 시스템과 택소노미가 매핑된 시소러스 기반 문서 분류 시스템을 통합하여하이브리드하게 분류 결과 간 가중치를 조정하고 상위 N개의 분류 결과를 생성하는 문서 분류 시스템에 대한 정보 흐름을 보여준다.도 38은 도 30에 의해 택소노미가 매핑된 시소러스의 일 예를 보인 개념도이다. 이러한 도 38은 분야분류체계의 <505>- 45 -공개특허 10-2008-0071213각 분야분류명(또는 코드)에 대응하는 택소노미(분야분류명을 대표하는 용어 집합)를 구축하고 택소노미를 구성하는 각 용어들을 시소러스에 매핑시킨 언어 자원 구성도를 보여준다.시소러스 기반 문서 분류를 위해 도 38에서와 같이 택소노미(taxonomy)를 이용하여 분야분류체계를 시소러스에 <506>매핑하는 과정을 선행적으로 처리한다. 분류 대상이 되는 문서가 입력되면 형태소 분석과 불용어 처리를 통해주요 키워드를 추출한다.통계 기반 문서 분류 시스템의 경우 자질 추출 과정을 거쳐 자질 집합을 생성하고, 이 집합과 학습 모델을 이용 <507>하여 문서 분류를 수행한다. 시소러스 기반 문서 분류 시스템의 경우 추출된 주요 키워드들을 시소러스 상의 용어들과 매칭한다. 매칭된 용어들은 분야분류체계의 각 분야분류명(또는 코드)을 대표하는 택소노미(taxonomy)에포함되어 있으므로 용어들의 문서 내에서의 빈도 정보, 택소노미(taxonomy) 내에서의 가중치 등을 이용하여 입력 문서의 분야분류명(또는 코드)을 결정한다.분류 결과 생성은 이 두 문서 분류 시스템의 분류 결과를 조합하는 하이브리드 방법을 이용한다. 두 분류 결과 <508>의 조합 방식은 시소러스 기반 문서 분류 결과가 임계치를 넘는 확률값으로 나타나지 않는 경우에 통계 기반 문서 분류 결과를 활용하는 차별적 적용 방식의 조합, 두 문서 분류 시스템에 미리 정해진 가중치(예를 들어, 시소러스 기반 문서 분류 시스템의 분류 결과에 0.7을 곱하고, 통계 기반 문서 분류 시스템의 분류 결과에 0.3을곱해 더하는 방식)를 분류 결과들에 적용하는 대등 방식의 조합, 제 3의 분류 시스템을 추가하여 다수결로 분류결과를 결정하는 Voting(투표) 방식의 조합 등이 있다.도 38을 참조하여 택소노미(taxonomy)를 이용하여 분야분류체계와 시소러스를 연동(매핑)하는 방법을 설명하면 <509>다음과 같다.분야분류체계의 각 분야분류명을 대표하는 주요 키워드들을 택소노미(taxonomy)라고 하는데, 이 키워드들을 용 <510>어로 하여 시소러스 상의 적절한 위치에 부착한다.시소러스에 용어를 부착하기 위해서 일반적으로 정의되는 BT(Broader Term, 상위어) - NT(Narrower Term, 하위 <511>어) 계층 관계 및 동등 관계를 이용한다. 입력 문서로부터 추출된 주요 키워드들은 시소러스 상의 용어들과 매칭을 시도하며, 매칭된 용어들은 특정 분야분류명(또는 코드)을 하나 또는 그 이상 가지므로 해당 문서에 대한분야 분류명을 결정할 수 있다.4-6. 정보 검색 시스템에서의 주제 또는 분야 할당 <512>이 장에서는 시소러스가 미구축된 경우 택소노미를 이용하여 주제 또는 분야를 자동으로 할당하거나 태그 또는 <513>폭소노미를 이용하여 주제 또는 분야를 자동으로 할당하여 정보 검색을 수행하게 된다.여기서 시소러스(Thesaurus)란 특정 주제 영역에서 사용되는 용어와 이들 용어 간의 의미 관계를 체계적으로 제 <514>시한 색인어휘집으로서, 색인과 검색 과정에서 디스크립터와 검색어를 선정하기 위한 도구로 사용된다. 이러한시소러스는 어휘를 뜻의 관점에서 분류하여 체계화한 것을 말하는 것으로, 정보 검색 시스템을 이용한 정보 검색 분야에서 관련어를 표시한 어휘표를 시소러스라고 부르기도 한다. 이러한 시소러스에는 유의어, 반의어 뿐만아니라 개념의 상위와 하위 관계에 의한 관련어도 포함된다. 용어의 관계성은 일반적으로 상위 개념, 하위개념, 용례 혹은 동의어, 관계어, 대체어 등으로 분류되는데, 시소러스는 이러한 관계성을 이용, 탐색기 질의에포함된 용어의 의미를 확대하기 위해 주로 사용된다. 또한 시소러스는 어떤 개념을 가장 적절히 표현할 수 있는표목을 선정하기 위하여 만들어진 어구의 집대성 또는 검색을 향상시키기 위해 동일한 관계, 계층적 관계, 연관관계를 구분 하는 어휘집 역할을 수행하여 용어 검색이 가능하도록 해준다.또한 택소노미(Taxonomy)는 '분류하다'라는 'tassein'과 '법, 과학'이라는 'nomos'의 합성으로 어원은 그리스어 <515>이다. 원래는 어원 그대로 살아있는 유기체를 분류하는 과학이란 뜻이지만, 지금은 확장된 의미로서 살아있는것 뿐만 아니라 무생물, 장소, 사건 등 모든 것을 택소노미 스키마(taxonomy schema)로 분류한 것이 택소노미이다. 이러한 택소노미(taxonomy)는 이미 결정된 체계를 가지고 있으며, 관계형 네트워크 구조 보다는 트리형의위계적 구조로 나타난다. 예를 들면, 포털 사이트나 웹 사이트에서의 카테고리 구조나 사이트 맵은 택소노미로데이터를 조직한 것이다.또한 태그(tag)는 특정한 문서나 이미지에 꼬리표를 달아서 그 문서를 설명하는 것으로, 태그를 달아두면 본문 <516>내용과 관계없이 주제별로 검색할 수 있다. 이에 따라 한 단계 진전된 검색 혁명의 토대 역할을 할 수 있는 것이 바로 태그이다.그리고 웹 2.0은 아무도 데이터를 소유하지 않고 어떤 프로그래밍 또는 인터넷 환경에서도 모든 사람이 데이터 <517>- 46 -공개특허 10-2008-0071213를 사용할 수 있는 플랫폼을 의미한다. 그동안 웹사이트는 일방적으로 TV나 라디오처럼 정보와 서비스를 제공하기만 해왔는데 이를 미디어라고 표현하기도 했다. 지금까지는 웹 사이트에 올린 데이터 또는 서비스되는 데이터를 이동시키거나 활용할 수 없었다. 그러나 웹 2.0 환경이 구축되면 자유롭게 데이터를 이동시킬 수 있게 된다.웹 1.0을 가리키는 대표적인 서비스가 웹 포털 서비스라면 웹 2.0은 플랫폼을 의미한다. 웹 포털 사이트의 서비스는 사용자가 마음대로 할 수 없지만 플랫폼인 웹 2.0에서는 사용자가 원하는 대로 데이터를 활용할 수 있다.이러한 웹 2.0에서는 태그를 사용하여 웹 문서를 작성하는 예가 증가하고 있다.또한 폭소노미(Folksnomy)는 전통적인 분류 기준인 '디렉터리' 대신 '꼬리표(태그)'에 따라 나누는 새로운 분류 <518>체계를 말한다. 네티즌 백과사전인 위키피디어는 \"자유롭게 선택된 키워드를 사용해 구성원이 함께 정보를 체계화하는 방식을 의미하는 신조어\"라고 풀이하고 있다. 이를테면 정치, 경제, 사회로 나누는 것과 별도로 병역면제, WBC, 역전 홈런 등의 꼬리표를 기준으로 일목요연하게 모을 수 있다. 폭소노미란 '사람들에 의한 분류법'(Folk + order + nomos)이란 의미이다.그래서 본 발명은 시소러스가 미리 구축되어 있지 않은 경우에 택소노미(Taxonomy)를 이용하여 주제, 분야를 자 <519>동으로 할당한다. 택소노미(Taxonomy)는 일련의 용어들을 분류해 놓은 분류법이라고 정의할 수 있다. 반면 시소러스는 용어(개념어 또는 주제어)들 간의 관계(예를 들어, 동등관계, 상하관계 등)를 더 추가하여 용어 네트워크를 형성해 놓은 것으로 정의할 수 있다. 택소노미(Taxonomy)는 좀 더 하위 레벨의 용어 분류에 해당하는 것으로 구축이 비교적 용이한데 이 구축 과정을 설명한 것이 이 장의 내용이다.또한 이 장에서는 1) 시소러스가 구축된 경우, 2) 시소러스가 구축되지 않은 경우로 구분하여 설명하며, 2) 시 <520>소러스가 구축되지 않은 경우는 2-1) 택소노미를 이용하는 경우, 2-2) 태그를 이용하는 경우, 2-3) 폭소노미를이용하는 경우로 구분하여 설명한다.1) 시소러스가 구축된 경우 <521>도 39는 도 3에서 주제/분야 할당 수행시 시소러스가 구축되어 있을 때 주제 분야 할당의 예를 보인 <522>흐름도이다.먼저 시소러스가 구축되어 있으면(ST261), 원문으로부터 색인어를 추출한다(ST262). <523>그리고 색인어를 시소러스 내의 개념어인 주제어와 매칭시키고 분야분류명과 시소러스 내의 개념어를 매칭시킨 <524>다(ST263).그런 다음 통제된 형태의 주제어를 결정하고, 분야분류명을 결정한다(ST264). <525>그리고 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상 <526>의 조건을 고려하여 결정된 주제어를 순위화한다(ST265). 여기서 용어 빈도(term frequency)는 해당 용어가 문서에서 출현하는 빈도수를 말하고, 문서 빈도(inverse document frequency)는 특정 용어가 출현하는 문서의 빈도수를 말하며, 분야분류코드 빈도는 분야분류코드가 문서들에서 출현하는 빈도수를 말하고, 개념어 깊이(depth)는 실질적 개념을 나타내는 개념어를 분류했을 경우 상위 분류에서 하위 분류로의 깊이를 말한다.그래서 해당 원문에 대해 상위에서 미리 설정한 특정 개수(N 개) 만큼의 주제어를 할당하게 된다(ST266). <527>이를 통해 원문으로부터 색인어를 추출하고 이를 시소러스 내의 개념어인 주제어와 매칭함으로써 통제된 형태의 <528>주제어를 결정하고 이를 빈도 등을 고려하여 순위화 함으로써 해당 원문에 대해 상위 N개의 주제를 할당할 수있도록 한다. 또한 분야분류명과 시소러스 내의 개념어를 미리 매핑해 놓음으로써 주제가 결정되는 순간에 주제에 매핑된 분야분류명도 약간의 계산을 통해 자동 결정할 수 있게 된다.여기서 본 발명에서는 용어, 개념어, 주제어를 혼용해서 쓰고는 있지만, 개념어나 주제어는 시소러스에 포함된 <529>경우에 주로 일컫는 말이고, 용어는 단독으로 쓰일 때도 일컬을 수 있는 말이다.2) 시소러스가 구축되지 않은 경우 <530>도 40은 도 39에서 주제/분야 할당 수행시 시소러스가 미구축되어 있을 때 주제 분야 할당의 예를 보인 흐름도 <531>이다.그래서 시소러스가 구축되어 있는지 판별하여(ST271), 시소러스가 미구축되어 있으면, 택소노미 분류체계가 결 <532>정되어 있는지 판별한다(ST272).만약 택소노미 분류체계가 결정되어 있다고 판별되면, 택소노미를 이용하여 분야를 자동 할당하고(ST273), 택소 <533>- 47 -공개특허 10-2008-0071213노미 분류체계가 결정되어 있지 않다고 판별되면 태그(또는 폭소노미)를 이용하여 주제 또는 분야를 자동 할당한다(ST274).2-1) 택소노미를 이용하는 경우 <534>도 41은 도 40에서 택소노미를 이용하여 분야를 자동 할당하는 동작을 보인 흐름도이다. <535>그래서 각 분야 분류명을 대표할 수 있는 정의문을 수집한다. 이때 정의문 수집 시 백과 사전 검색, 웹 검색 등 <536>을 사용하여 정의문을 수집한다(ST281).그리고 정의문으로부터 용어를 추출한다. 정의문으로부터 용어 추출 시 형태소 분석을 통해 명사 상당어구 위주 <537>로 추출할 수 있다(ST282).이때 추출된 용어가 주제어로 적당한지 검증을 수행할 수 있다(ST283, ST284). 이러한 검증 과정은 관리자나 구 <538>축자에 의해 주제어로 적당한지 검증하는 방식을 사용할 수도 있고, 주제어로의 검증 과정을 자동화하여 검증하는 방식을 사용할 수도 있다. 또한 이와 같은 검증 과정은 생략될 수 있다.그리고 추출한 용어를 시소러스의 개념어인 주제어로 결정한다(ST285). <539>또한 택소노미를 사용하여 분야를 할당하여 시소러스를 구축한다(ST286). <540>그리고 택소노미 내의 용어들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 택소노미에 의한 분 <541>야 분류 체계 중에서 어느 택소노미에 해당하는지 결정한다(ST287).그런 다음 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 등을 고려하여 <542>결정된 주제어(용어)를 순위화한다(ST288).또한 입력된 원문에 대해 택소노미를 사용한 상위에서 미리 설정한 특정 개수(N 개) 만큼의 분야를 할당하게 된 <543>다(ST289).그래서 택소노미의 분류체계가 이미 결정되어 있는 경우에는 각 분야분류명을 대표할 수 있는 정의문을 수집하 <544>고, 이렇게 수집된 정의문으로부터 자동으로 용어를 추출한다. 이렇게 해서 정리된 용어는 해당 분야분류명을대표하는 용어로 관리한다. 분야분류명의 경우 이미 택소노미 구축 과정에서 특정 분야분류명에 용어들을 소속시킴에 따라 분야분류명과 개념어가 매핑된 것으로 볼 수 있기 때문이다. 그리고 택소노미 내의 용어 중 색인어와 매칭된 것들을 빈도 기반으로 순위화하면 주제 할당이 가능해진다.2-2) 태그를 이용하는 경우 <545>도 42는 도 40에서 태그를 이용하여 주제를 자동 할당하는 동작을 보인 흐름도이다. <546>그래서 태그를 가진 웹 문서로부터 태그를 추출한다(ST291). <547>이때 추출된 태그가 주제어로 적당한지 검증을 수행할 수 있다(ST292, ST293). 이러한 검증 과정은 관리자나 구 <548>축자에 의해 주제어로 적당한지 검증하는 방식을 사용할 수도 있고, 주제어로의 검증 과정을 자동화하여 검증하는 방식을 사용할 수도 있다. 또한 이와 같은 검증 과정은 생략될 수 있다.그런 다음 추출된 태그를 시소러스의 개념어인 주제어로 결정한다(ST294). <549>그리고 추출된 태그를 사용하여 분야를 할당하여 시소러스를 구축한다(ST295). <550>또한 시소러스 내의 용어들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 태그에 의해 설정된 분 <551>야 분류 체계 중에서 어느 태그에 해당하는지 결정한다(ST296).그리고 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상 <552>의 조건을 고려하여 결정된 주제어(태그)를 순위화한다(ST297).그런 다음 입력된 원문에 대해 상위에서 미리 설정한 특정 개수(N 개)의 주제어(태그)를 할당하게 된다(ST298). <553>2-3) 폭소노미를 이용하는 경우 <554>도 43은 도 40에서 태그와 폭소노미를 이용하여 주제 또는 분야를 자동 할당하는 동작을 보인 흐름도이다. <555>그래서 태그를 가진 웹 문서로부터 태그를 추출한다(ST301). <556>그리고 추출된 태그가 주제어로 적당한지 검증을 수행할 수 있다(ST302, ST303). 이러한 검증 과정은 관리자나 <557>- 48 -공개특허 10-2008-0071213구축자에 의해 주제어로 적당한지 검증하는 방식을 사용할 수도 있고, 주제어로의 검증 과정을 자동화하여 검증하는 방식을 사용할 수도 있다. 또한 이와 같은 검증 과정은 생략될 수 있다.그런 다음 추출된 태그를 시소러스의 개념어인 주제어로 결정한다(ST304). <558>그리고 폭소노미를 사용하여 분야를 할당하여 시소러스를 구축한다(ST305). <559>이렇게 시소러스를 구축한 후 시소러스 내의 태그들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문 <560>이 폭소노미에 의해 설정된 분야 분류 체계 중에서 어느 폭소노미에 해당하는지 결정한다(ST306).그리고 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상 <561>의 조건을 고려하여 결정된 주제어(태그), 분야(폭소노미)를 순위화한다(ST307).그런 다음 입력된 원문에 대해 상위에서 미리 설정한 특정 개수(N 개)의 주제어(태그), 분야(폭소노미)를 할당 <562>하게 된다(ST308).웹 문서에는 태그(TAG)라는 특별한 태그를 두어 웹 문서를 작성한 사람이 임의로 해당 태그 내에 그 웹 문서를 <563>대표할 수 있는 용어들을 넣어둔다. 웹 검색에서 이러한 TAG를 이용하여 검색 결과를 내기도 하므로, 검색 결과상위에 해당 문서를 나오게 하기 위해 일부러 TAG 내의 용어를 변경하는 경우도 발생한다. 이러한 TAG를 주제어로서 간주한다면, 그 TAG를 가진 문서는 해당 주제어로 분류된 문서로서 간주할 수 있다. 상기의 예처럼 TAG를남용하는 경우에도 이러한 TAG에 속한 문서를 좀 더 많이 수집 할수록 잘못 붙여진 문서들의 가치가 희소될 수있으므로 대용량 문서를 가진 웹 포털 사이트 등에 유용한 방식이라고 할 수 있다. 해당 TAG를 가진 웹 문서로부터 용어를 추출한다. 그리고 추후 입력된 원문에 대해 TAG 내의 용어들과 색인어를 매칭시켜 어느 TAG에 해당하는 문서인지를 자동으로 결정할 수 있다. 나아가 폭소노미와 같은 TAG들을 분류해놓은 일종의 택소노미(Taxonomy)를 활용한다면 TAG가 결정되는 순간 폭소노미(Folksnomy) 내의 어느 분류에 속해 있는 지를 자동으로파악하여 폭소노미(Folksnomy) 내에서의 분류명도 동시에 결정할 수 있게 되는 것이다.4-7. DBMS 기반 지식 확장 및 추론 <564>이 장에서는 온톨로지를 이용하여 지식을 생성하고, 확장 규칙을 이용하여 지식을 확장하고, 질의 처리를 통해 <565>추론 서비스를 제공하여 시맨틱 웹 기술을 활용하고 추론 서비스를 제공할 필요가 있는 전 분야에 걸쳐서 안정적이고 효율적인 프레임워크를 제시함으로써 시맨틱 웹 서비스의 상용화를 가능하게 하는 것을 설명한다.그리고 시맨틱 웹 기술의 발전과 더불어 급격히 관심을 끌고 있는 추론 서비스를 불안정한 추론 엔진을 이용하 <566>는 대신 안정적인 DBMS 기반 시맨틱 웹 플랫폼을 실현하는 방법을 설명한다. 또한 이 장은 크게 온톨로지 스키마와 인스턴스들을 이용하여 트리플로 표현되는 지식을 생성하는 방법, 지식 확장 규칙을 이용하여 지식을 확장하는 방법, 사용자 질의를 변환하고 질의 처리하는 방식으로 추론 서비스를 제공하는 방법으로 구성된다.또한 OWL(Web Ontology Language) 등으로 기술된 온톨로지 상에서의 추론 엔진을 이용함으로 해서 발생할 수 있 <567>는 추론에서의 무한 반복, 신뢰할 수 없는 수준의 응답 시간 등의 안정성을 떨어뜨리는 요소들을 배제함으로써실용적인 시맨틱 웹 응용 서비스를 제공할 수 있도록 한다. 이를 위해 온톨로지 인스턴스들뿐만 아니라 트리플로 표현된 지식들까지 DBMS 기반으로 저장, 관리함으로써 대용량의 지식 처리를 보장하고 안정적인 지식 확장을가능하도록 한다. 기존에 DBMS를 이용하는 시도가 해외에서 연구 수준으로 가끔 있었으나 이들은 저장소 역할만을 DBMS에 의존함 <568>으로써 지식 생성, 지식 확장, 지식 제공이라는 전체 정보 흐름과 유기적으로 결합되지 못한 단점을 가지고 있다.이 장에서의 추론 서비스 시스템은 지식의 크기에 있어서 추론 엔진이 다룰 수 없는 수준까지도 처리할 수 있는 <569>구조로 발명되었으며, 지식에 대한 확장성을 보장할 수 있도록 한다. 또한, 트리플로 표현 가능한 모든 지식들을 다룰 수 있도록 설계됨으로써 시맨틱 웹 환경에서의 필수적인 요소로 활용될 수 있다.도 44는 도 3에서 DBMS 기반 지식 확장 및 추론 수행시 DBMS 기반 지식 확장 및 추론 서비스 시스템의 일 예를 <570>보인 블록구성도이다.그래서 지식 생성부는 온톨로지 스키마와 인스턴스들을 이용하여 트리플로 표현되는 지식을 생성한다. 또한 지 <571>식 확장 처리부는 지식 생성부에서 생성된 지식을 입력받고, 지식 확장 규칙을 이용하여 지식을 확장한다. 또한추론 서비스 제공부는 지식 확장 처리부에서 확장된 지식을 이용하고, 사용자 질의를 변환하고 질의를 처리하여추론 서비스를 제공한다.- 49 -공개특허 10-2008-0071213그리고 지식 생성부는 RDF 또는 XML 형태의 온톨로지 기술 언어로 표현된 온톨로지 스키마를 RDF/XML 파서로 파 <572>싱하여 그 결과를 생성하고, 스키마 트리플 변환부를 이용하여 스키마 트리플을 생성한다.또한 지식 생성부에서 RDF/XML 파서는 온톨로지 스키마를 RDF/XML 파싱하여 파싱 결과를 출력한다. 이러한 <573>RDF/XML 파서는 온톨로지 스키마를 DBMS 기반의 트리플로 변환하기 위한 기초 작업을 수행하고, 온톨로지 스키마를 해석하여 파싱 결과를 출력한다.또한 지식 생성부에서 스키마-트리플 변환부는 RDF/XML 파서에서 출력된 파싱 결과를 입력받아 스키마-트리플 <574>변환을 수행한다. 이러한 스키마-트리플 변환부는 온톨로지 스키마를 DBMS에서 다룰 수 있는 형태로변환시킨다.또한 지식 생성부에서 DB-트리플 변환 규칙 생성부는 스키마-트리플 변환부에서 변환된 스키마-트리플과 DB-클 <575>래스 매핑 정보와 NS-Prefix 매핑 정보를 입력받고 DB-트리플 변환 규칙을 생성한다. 이러한 DB-트리플 변환 규칙 생성부는 DB-트리플 변환 규칙을 생성하기 위해 스키마 트리플, DB-클래스 매핑 정보, NS-Prefix 매핑정보를이용하고, DB-클래스 매핑 정보를 이용하여 DBMS 필드와 개념에 해당하는 온톨로지 클래스를 매핑하며, DB-클래스 매핑 정보를 편집할 수 있도록 편집 화면과 편집기를 제공하고, NS-Prefix 매핑정보를 이용하여 네임스페이스와 Prefix가 호환되도록 인식하며, NS-Prefix 매핑정보를 편집할 수 있도록 편집 화면과 편집기를 제공하고,온톨로지 전문가가 기술한 DB-트리플 변환 규칙을 얻을 수 있도록 편집 화면과 편집기를 제공한다.또한 지식 생성부에서 DB-트리플 변환부는 DB-트리플 변환 규칙 생성부에서 생성된 DB-트리플 변환 규칙을 이용 <576>하여 URL 서버에 저장되어 있는 온톨로지 인스턴스를 인스턴스 트리플로 변환시킨다. 이러한 DB-트리플 변환부는 URI 서버에 저장되거나 OWL(Web Ontology Language)의 온톨로지 기술 언어를 이용하여 URI 기반 또는 문자열로 표현된 온톨로지 인스턴스를 인스턴스 트리플로 변환시킨다.그리고 지식 확장 처리부는 스키마 트리플과 인스턴스 트리플을 입력으로 받아 스키마 기반 확장 규칙과 사용자 <577>정의 확장 규칙을 해석하여 확장 트리플을 생성하는 것으로, 스키마 기반 확장 규칙을 생성하는 지식 확장 규칙생성부; 지식 확장 규칙 생성부에 의해 생성된 스키마 기반 확장 규칙과 전문가가 기술한 사용자 정의 확장 규칙을 이용하고 인스턴스 트리플과 스키마 트리플을 이용하여 확장 트리플을 생성하는 지식 확장부; 및 인스턴스트리플과 지식 확장부의 결과를 이용하여 동적으로 값이 변하는 유형의 확장 트리플을 생성하는 추가 지식 확장부;를 포함하여 구성할 수 있다.또한 지식 확장 처리부에서 지식 확장 규칙 생성부는 지식 생성부의 스키마 트리플을 참조하여 스키마 기반 확 <578>장 규칙을 생성한다.또한 지식 확장 처리부에서 지식 확장부는 추론 엔진에서의 전향 추론(Forward Chaining)에 해당하는 방식으로 <579>규칙 해석 및 트리플 추가 생성을 담당한다.또한 지식 확장 처리부에서 추가 지식 확장부는 동적으로 특정 클래스의 값이 변동하는 트리플들을 처리하도록 <580>인스턴스 트리플을 입력받아 DBMS 테이블이나 메모리 상에서 값을 계산하고, 해당 트리플을 업데이트하거나 추가한다.그리고 추론 서비스 제공부는 사용자 질의를 입력받아 변환시켜 변환 질의를 생성하는 질의 변환부; 이전에 입 <581>력된 질의인지 판단하는 캐시 관리부; 질의 변환부에서 변환된 변환 질의를 입력받고, 캐시 관리부의 판단 결과를 입력받아 질의 결과를 생성하는 질의 처리부; 질의 처리부의 질의 결과를 입력받아 후 처리하여 후 처리 결과를 생성하는 후 처리부; 및 후 처리부에서 생성된 후 처리 결과를 이용하여 사용자 인터페이스에 맞도록 메시지와 프로토콜을 생성하여 추론 결과를 제시하는 결과 제시부;를 포함하여 구성할 수 있다.그래서 추론 서비스 제공부에서 질의 변환부는 SPARQL이나 RDQL의 질의 기술 언어 또는 사용자 인터페이스에 의 <582>존적인 특정 구문으로 표현된 사용자 질의를 DBMS 기반 지식에 접근할 수 있도록 SQL로 변환한다.또한 추론 서비스 제공부에서 캐시 관리부는 질의/결과 목록으로 구성된 캐시를 참조하여 이전에 입력된 질의인 <583>지 판단한다.또한 추론 서비스 제공부에서 질의 처리부는 이전에 입력된 질의인 경우에는 추론 결과를 바로 사용자에게 제시 <584>하고, 신규로 입력된 질의인 경우에는 지식 확장 처리부의 확장 트리플을 참조하여 질의 결과를 생성한다.또한 추론 서비스 제공부에서 후 처리부는 질의 처리부에서 제시한 질의 결과를 사용자 인터페이스에 맞도록 정 <585>렬하고 특정 기준을 적용하여 결과의 일부를 삭제하여 필터링하는 조작을 통해 후처리 결과를 생성한다.- 50 -공개특허 10-2008-0071213또한 추론 서비스 제공부에서 결과 제시부는 질의 처리부의 질의 결과 또는 후 처리부의 후 처리 결과를 이용하 <586>여 추론 결과를 생성하고, URI 서버를 참조하여 추론 결과 생성 대상 URI의 개념-값 관계(Datatype Property)와연결된 값을 추출하여 추론 결과를 제시한다.도 45는 도 3에서 DBMS 기반 지식 확장 및 추론 서비스 방법을 보인 흐름도이다. <587>그래서 본 발명은 지식 생성부에서의 온톨로지 스키마와 인스턴스들을 이용하여 트리플로 표현되는 지식을 생성 <588>하는 단계(ST311 ~ ST314), 지식 확장 처리부에서의 지식 확장 규칙을 이용하여 지식을 확장하는 단계(ST321 ~ST323), 추론 서비스 제공부에서의 사용자 질의를 변환하고 질의 처리하는 방식으로 추론 서비스를 제공하는 단계(ST331 ~ ST335)로 구성된다.도 46은 도 44 또는 도 45에서 정보 흐름 순서를 보인 개념도이다. <589>온톨로지는 특정 영역에서 클래스(개념) 간의 관계를 표현하는 지식 체계로서 온톨로지 스키마와 온톨로지 인스 <590>턴스로 구성된다. 온톨로지 스키마는 개념 자체와 개념 간 관계를 표현하는 골격(예. '사람'이라는 개념은 '기관'과 '소속'이라는 관계로 연결된다.)이라고 할 수 있으며, 온톨로지 인스턴스는 특정 개념이 사례화된 형태(예. \"정한민\"은 \"한국과학기술정보연구원\"과 '소속'이라는 관계로 연결된다.)라고 할 수 있다.온톨로지 스키마는 RDF(Resource Description Framework)나 XML(eXtensible Markup Language)로 표현된다. <591>DBMS 기반으로 지식을 다루기 위해서는 온톨로지 스키마와 온톨로지 인스턴스를 트리플(Triple) 형식(두 개의개념과 이들을 연결하는 관계명을 3개 요소로 하는 리스트로 구성한 형태로서, 가운데에 관계명을 위치시켜 ('사람', '소속', '기관') 과 같은 형식으로 표현할 수 있다.)이나 XML 등 다른 포맷으로 통일시킬 필요가 있다.본 발명에서는 편의상 트리플로 표현하며 DBMS에 저장되는 형태 역시 Subject(관계명 왼쪽에 위치한 개념으로 <592>위의 예에서 '사람'이 여기에 해당한다.), Predicate(관계명을 의미하며 위의 예에서 '소속'이 여기에해당한다.), Object(관계명 오른쪽에 위치한 개념으로 위의 예에서 '기관'이 여기에 해당한다.)의 세 개 필드를포함하는 테이블로 정의한다. 이 세 가지 요소를 하나의 테이블이 아닌 각각 별도의 테이블에 저장할 수도 있으며, 관계명에 따라 테이블을 분산시킬 수도 있다.RDF/XML 파서는 온톨로지 스키마를 궁극적으로 DBMS 기반의 트리플로 변환하기 위한 기초 작업을 수행한다. <593>RDF/XML 파서는 온톨로지 스키마를 해석하여 파싱 결과를 생성한다.도 47은 도 44 또는 도 45에서 온톨로지 스키마와 RDF/XML 파서에 의한 파싱 결과의 일 예를 보인 도면이다. <594>파싱 결과는 스키마-트리플 변환부를 거쳐 트리플로 변환된다. <595>스키마 트리플은 이렇게 변환된 결과로 생성된 지식으로, 온톨로지 스키마를 DBMS에서 용이하게 다룰 수 있는 <596>형태로 변환시킨 것이다. 스키마 트리플은 인스턴스 트리플을 생성하기 위해 필수적으로 요구되는 지식이다. 이는 스키마 트리플이 온톨로지 스키마를 표현하고 있으며, 온톨로지 스키마가 온톨로지 인스턴스를 해석하기 위한 기본 정보이기 때문이다.온톨로지 인스턴스를 온톨로지 트리플로 변환하기 위해서 DB-트리플 변환 규칙 생성부가 필요하다. DB-트리플 <597>변환 규칙 생성부는 DB-트리플 변환에 필요한 변환 규칙을 만드는 역할을 하는데, 이때 이용하는 정보가 스키마트리플 , DB-클래스 매핑 정보, NS(Name Space)―Prefix 매핑 정보가 있다.DB-클래스 매핑 정보는 URI(Uniform Resource Identifier) 서버에 저장되어 있는 각 필드들(필드 정보는 온톨 <598>로지 인스턴스에 해당한다)이 온톨로지 스키마에 어떻게 매핑되는지를 알려준다. 예를 들어, 인력 정보 테이블의 첫 번째 필드가 '사람'이라는 개념을 의미하는 경우에 \"<f1> rdf:type isrl:Person\"과 같이 표현한 정보가DB-클래스 매핑 정보에 담겨진다.URI 서버는 온톨로지 인스턴스를 효율적으로 관리하기 위해 사용하는 DBMS 기반 저장소로서 개념 간 관계 <599>(Object Property)와 개념-값 관계(Datatype Property)를 포함한다. 개념 간 관계라 함은 '사람'이라는 개념이'소속'이라는 관계로서 '기관'이라는 개념을 가지는 경우에 해당하며, 개념-값 관계는 '사람'이라는 개념이 '나이'라는 관계로서 '30'이라는 값을 가지는 경우에 해당한다. URI 서버를 이용하지 않고도 지식 생성 방법을 구현할 수 있는데, 이 경우에는 온톨로지 스키마가 스키마 트리플로 변환되는 과정을 그대로 따르게 된다.NS-Prefix 매핑 정보는 네임스페이스(Name Space)를 Prefix로 매핑될 수 있도록 도와주는 역할을 한다. <600>네임스페이스는 \"#\"와 같이 논리적으로 현재 기술하고자 하는 개념 체계를 다른 개념 체계들과 혼동되지 않도록 <601>- 51 -공개특허 10-2008-0071213그룹화해주는 역할을 한다. 일반적으로 OWL(Web Ontology Language)이나 RDF(Resource Description Framework)등 지식을 기술하는 언어에서는 네임스페이스 대신에 \"rdf\"와 같이 이를 간략히 표현한 Prefix를 사용한다. NS-Prefix 매핑 정보는 DBMS에 저장된 온톨로지 인스턴스들이 네임스페이스 기반으로 표현되어 있고 규칙 등이Prefix로 기술되어 있는 경우와 같이 서로간의 논리적 그룹 표현 방식이 다른 경우에 이들을 호환시킬 목적으로사용한다.도 48은 도 44 또는 도 45에서 DB-트리플 변환 규칙 생성의 일 예를 보인 도면이다. <602>DB-트리플 변환 규칙 생성부는 도 48에서와 같이 DB-클래스 매핑 정보, NS-Prefix 매핑 정보, 스키마 트리플과 <603>같은 세 가지 정보를 이용하여 'DB-트리플 변환 규칙'(도 48 참조)을 생성한다.도 49는 도 44 또는 도 45에서 DB-트리플 변환에 의해 생성되는 인스턴스 트리플의 일 예를 보인 도면이다. <604>DB-트리플 변환 규칙을 이용하여 DB-트리플 변환부는 도 49에서와 같이 URI 서버에 저장되어 있는 온톨로지 인 <605>스턴스를 '인스턴스 트리플'(도 49 참조)로 변환시킨다.지식 확장 처리부에서의 지식 확장 방법은 위에서 기술한 지식 생성의 결과인 스키마 트리플과 인스턴스 트리플 <606>을 이용하여 확장 트리플을 생성하는 과정을 보여준다.도 50은 도 44 또는 도 45에서 지식 확장 규칙 생성에 의해 생성된 스키마 기반 확장 규칙의 일 예를 보인 도면 <607>이다.그래서 지식 확장 규칙 생성부는 지식 확장을 위한 규칙을 자동으로 생성하는데, 이때 참조하는 정보는 스키마 <608>트리플이다. 스키마 트리플을 이용하여 도 50과 같이 '스키마 기반 확장 규칙'을 자동으로 생성한다. 이 방법은수작업으로 대체할 수도 있다. 즉, 온톨로지 스키마를 분석하여 전문가에 의해 수작업으로 스키마 기반 확장 규칙을 작성할 수 있다.도 51은 도 44 또는 도 45에서 사용자정의 확장 규칙의 일 예를 보인 도면이다. <609>그래서 지식 확장부는 지식 확장 규칙 생성부에 의해 자동 생성된 스키마 기반 확장 규칙과 규칙 기술 전문가가 <610>기술한 '사용자 정의 확장 규칙'(도 51 참조), 그리고 인스턴스 트리플을 이용하여 확장 트리플을 생성한다. 이때 추가 지식 확장부를 이용하여 인스턴스 트리플과 스키마 트리플을 참조하여 동적으로 값이 변하는 유형의 확장 트리플을 추가한다. 예를 들어, '성과 점수'는 성과물이 등록될 때마다 그 점수를 누적시켜야 하며 추가 지식 확장기가 이러한 역할을 수행한다.확장 트리플은 결국 인스턴스 트리플을 확장 규칙에 따라 더욱 풍부하게 만든 결과라고 할 수 있다. 또한 지식 <611>확장부는 추론 엔진에서의 Forward Chaining에 해당하는 방식으로 규칙 해석 및 트리플 추가 생성을 담당하는모듈이라고 할 수 있다.이상 기술한 내용은 사용자 질의 이전에 지식을 생성하고 확장하는 방법이다. <612>한편 사용자 질의가 입력되어 시스템에서 추론되고 그 결과를 생성하는 과정은 추론 서비스 제공부에 의해 주도 <613>적으로 수행되며, 그 상세 동작은 다음과 같다.사용자 질의는 SQL(Structured Query Language) 형태일 수도 있지만, 시맨틱 웹에서는 일반적으로 <614>SPARQL(SPARQL Protocol And RDF Query Language)이나 RDQL(RDF Data Query Language) 등의 시맨틱 웹 기반 질의 기술 언어를 사용한다. DBMS 기반으로 지식이 구축되어 있는 본 시스템에서 사용자 질의를 해석하고 처리하기 위해서는 질의 변환부를 이용하여 사용자 질의를 SQL로 변환해야 한다.도 52는 도 44 또는 도 45에서 사용자질의와 질의 변환에 의해 변환된 변환질의의 일 예를 보인 도면이다. <615>그래서 SQL로 구성된 '변환 질의'(도 52 참조)는 질의 처리부로 전달된다. 질의 처리부는 먼저 캐시 관리부에 <616>문의하여 해당 질의가 이전에 입력된 적이 있는지를 판단한다.도 53은 도 44 또는 도 45에서 SQL로 DBMS 기반 확장 트리플에 문의하여 얻어진 질의결과의 일 예를 보인 도면 <617>이다.그래서 캐시 관리부는 '질의-결과 목록'으로 구성된 캐시를 참조하여 이전에 입력된 질의인지 판단하고, 그 결 <618>과를 질의 처리부에 전달한다. 만일 이전에 입력된 질의인 경우 '추론 결과'를 바로 사용자에게 제시할 수 있으며, 신규로 입력된 질의인 경우에는 '확장 트리플'을 참조하여 '질의 결과'(도 53 참조)를 생성한다.- 52 -공개특허 10-2008-0071213도 54는 도 44 또는 도 45에서 질의결과를 정렬하고 필터링하는 등의 가공에 의해 생성된 후 처리결과의 일 예 <619>를 보인 도면이다.그래서 질의 결과는 사용자에게 바로 제시되기 힘든데, 그 이유는 사용자가 보는 사용자 인터페이스에 맞는 형 <620>태의 질의 결과가 바로 얻어지지 않기 때문이다. 이를 위해 후 처리부를 사용하여 '후 처리 결과'(도 54 참조)를 생성한다.도 55는 도 44 또는 도 45에서 URI 서버를 참조하고 후 처리결과를 이용하여 사용자 인터페이스에서 정의된 형 <621>태의 API로 출력하는 추론결과의 일 예를 보인 도면이다.그래서 결과 제시부는 후 처리 결과를 이용하여 사용자 인터페이스에 맞도록 메시지와 프로토콜을 생성하는 데, <622>이 때 특정 URI에 대한 개념-값 관계(Datatype Property, 예. '사람'이라는 개념에서의 Datatype Property는 '인명', '나이', '성별' 등이 있다.)를 획득하기 위해 URI 서버를 참조할 수 있다. 이 결과가 '추론 결과'(도55 참조)이며 XML 등의 형식 언어로 표현되어 사용자 인터페이스를 담당하는 모듈에 전달된다.이 장에서의 지식 생성, 지식 확장, 추론 서비스 제공 방법은 위에서 기술한 바와 같이 서로 밀접하게 연결되어 <623>있으며, 기존 추론 엔진이 불안정적으로 수행하던 추론 서비스를 안정적인 DBMS 기반으로 구현할 수 있게 한다.5. 지식 정보 공유 서비스 제공 <624>여기서는 정보 공유/유통을 위한 플랫폼의 구성과 서비스 제공의 예를 설명한다. <625>5-1. 지식 정보 공유 서비스 - 프레임 서비스 <626>도 56은 도 3에서 서비스 제공 단계에서 제공되는 지식정보 공유서비스의 예를 보인 도면이다. <627>그래서 프레임 서비스(OntoFrame-K)에서는 선행기술 동향 파악, 과제평가위원 선정 검색, 지역별 연구 정책 결 <628>정 검색, 연구자간 협업 연구 검색을 포함한 서비스를 제공한다.또한 스토어 서비스(OntoStore-k)에서는 특정 성과물 열람, 성과물이 상세 정보 및 관련 정보 검색, 성과물 등 <629>록, 비성과 정보의 공유 및 공동 문서 작업 수행, 성과물 원문 검색을 포함한 서비스를 제공한다.또한 씽크 서비스(OntoThink-K)에서는 특정 주제나 분야를 연구하는 연구자 그룹과 전문가 검색, 특정 연구자가 <630>연구하는 주제와 분야 확인, 특정 주제나 분야를 연구하는 지역과 기관 확인, 여러 연구자들의 성과 추이 비교,연구자, 기관, 주제에 대한 상세 정보 확인, 통합 연구자 네트워크 확인, 연구자 친밀도 확인을 포함한 서비스를 제공한다.도 57은 도 56에서 프레임 서비스 제공 화면의 예를 보인 도면이다. <631>이러한 프레임 서비스(OntoFrame-K)에서 선행기술 동향 파악은 연구자나 연구팀이 수행하고자 하는 연구 분야의 <632>성과물을 확인하거나 그 분야에 속한 전문가의 성과물을 살펴봄으로서 분석에 필요한 선행 연구 동향을 파악할수 있도록 한다.또한 프레임 서비스(OntoFrame-K) 제공에서 과제 평가 위원 선정 검색은 평가 대상 과제의 분야 전문가를 확인 <633>하고, 피평가자의 연구제 네트워크를 공저자 관점, 인용 관점으로 분석함으로서 이해 관계에 있는 전문가를 배제할 수 있도록 한다.또한 프레임 서비스(OntoFrame-K) 제공에서 지역별 연구정책 결정 검색은 연구 분야 및 유형에 따라 행정 구역 <634>별로 연구 활성도를 알아볼 수 있도록 처리하고, 연구 수행이 가능한 기관과 연구자를 검색하여 해당 지역에서육성해야 하는 연구 자원을 파악할 수 있도록 처리한다.또한 프레임 서비스(OntoFrame-K) 제공에서 연구자 간 협업 연구 검색은 성과물과 연구 자료를 등록할 수 있도 <635>록 처리하고, 이를 동료 연구자가 확인하고 자료를 수정하거나 추가할 수 있도록 처리함으로써 이력 추적이 가능한 방식의 협업 성과물을 생산하도록 처리한다.도 58은 도 57에서 선행연구 동향파악 선택시 동작 예를 보인 흐름도이다. <636>그래서 프레임 서비스 제공에서 선행연구동향파악에서 주제 선택 단계는 메인 화면에서 주제를 선택하도록 한다 <637>(1.).또한 연구자 그룹 확인 단계는 연구자 네트워크 선택에 의해 연구자 그룹을 확인하도록 한다. <638>- 53 -공개특허 10-2008-0071213또한 공저자 네트워크 확인 단계는 연구자 그룹 확인 단계 후 연구자 네트워크 선택에 의해 공저자 네트워크를 <639>확인하도록 한다(3.).또한 통계정보 선택 단계는 통계정보 선택에 의해 연구자간 비교 및 연구 추이 파악이 수행되도록 한다(4.). <640>또한 성과정보 선택 단계는 성과정보 선택에 의해 성과 유형별 연구 성과를 제시하도록 한다(5.). <641>또한 상세보기 선택 단계는 상세보기 선택에 의해 성과 상세보기가 수행되도록 한다(6.). <642>또한 연구자 정보 선택 단계는 연구자 정보 선택에 의해 인력 상세보기가 수행되도록 한다(7.). <643>또한 연구 성과 맵 선택 단계는 연구 성과 맵 선택에 의해 지역별 연구 성과 보기가 수행되도록 한다(8.). <644>또한 기관정보 선택 단계는 기관 정보 선택에 의해 지역별 소속 기관 보기가 수행되도록 한다(9.). <645>도 59는 도 58에서 메인 화면에서 주제 선택시의 화면 예를 보인 도면이다. <646>그래서 주제(예를 들면, '에이전트')가 선택되면 주제 입력 및 검색이 수행되도록 한다. <647>도 60은 도 58에서 연구자 네트워크 선택과 연구자 그룹 확인 화면의 예를 보인 도면이다. <648>그래서 연구자 네트워크 선택시 연구자 그룹을 공저자 관점에서 출력하고, 해당 분야 전문가를 출력한다. <649>또한 연구자 네트워크 선택시 시간축에서의 연구자 네트워크를 보여줄 수도 있다. 즉, 어느 시기에는 연구자 네 <650>트워크가 어떻게 구성되고, 다른 시기에는 연구자 네트워크가 어떻게 구성되어 있는지를 시간축 상에서 시각화하여 보여줄 수도 있다.도 61은 도 58에서 연구자 네트워크 선택과 공저자 네트워크 확인 화면의 예를 보인 도면이다. <651>그래서 연구자 네트워크 선택시 스타(Star) 연구자를 중심으로 한 방사형 연구자 네트워크 또는 다수 연구자가 <652>동일한 비중을 보인 체인형 연구자 네트워크를 제공한다.도 62는 도 58에서 통계정보 선택시 연구자 간 비교 및 연구 추이 파악 화면의 예를 보인 도면이다. <653>그래서 통계정보 선택시 다수 연구자의 성과 추이를 비교하여 해당 분야의 연구 강도가 약화되는 정도와 최근에 <654>해당 분야 연구가 시작되는 정도를 그래프로 표시한다.도 63은 도 58에서 성과정보 선택시 성과 유형 별 연구 성과 제시 화면의 예를 보인 도면이다. <655>그래서 성과정보 선택시 해당 분야 연구 실적을 확인하도록 해당 분야 연구 실적을 제공한다. <656>도 64는 도 58에서 상세보기 선택시 성과 상세보기 화면의 예를 보인 도면이다. <657>그래서 상세보기 선택시 URI 기반 개체 관리 정보를 표시하고, 자동 추출된 상위 일정 개수(예를 들면, 상위에 <658>서 3번째까지)의 주제와 분야를 표시하며, 문서 미리 보기를 통해 해당 논문에 대한 내용을 확인할 수 있도록표시한다.도 65는 도 58에서 연구자 정보 선택시 인력 상세보기 화면의 예를 보인 도면이다. <659>그래서 연구자 정보 선택시 추론에 의해 획득된 인력의 연구 주제와 분야를 표시하고, 국가 과학기술 인력 종합 <660>DB와 연결된 정보를 표시하며, 해당 연구자의 성과 정보를 표시한다.도 66은 도 58에서 연구 성과 맵 선택시 지역별 연구 성과 보기 화면의 예를 보인 도면이다. <661>그래서 연구 성과 맵 선택시 광역 단위 또는 시/군/구 단위로 해당 분야의 지역 별 성과 맵을 표시한다. <662>또한 연구 성과 맵 선택시 시간축에서의 연구 성과 추이를 보여줄 수도 있다. 즉, 어느 시기에는 연구 성과 맵 <663>이 어떠하고, 다른 시기에는 연구 성과 맵이 어떠한지를 시간축 상에서 시각화하여 보여줄 수도 있다.도 67은 도 58에서 기관정보 선택시 지역별 소속 기관 보기 화면의 예를 보인 도면이다. <664>그래서 기관정보 선택시 해당 분야를 연구하는 연구자가 소속된 기관 중 해당 지역에 위치한 기관 정보를 표시 <665>한다.5-2. 정보유통 서비스 - 스토어 서비스 <666>도 68은 도 56에서 정보유통 서비스인 스토어 서비스 제공 화면의 예를 보인 도면이다. <667>- 54 -공개특허 10-2008-0071213그래서 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 특정 성과물 열람을 선택하면, 공통 메뉴에서 원하 <668>는 주제나 분야, 성과물 유형, 발행년도를 선택한 후, 키워드를 이용해서 검색할 수 있도록 처리하고, 전체, 제목, 저자로 검색하거나 개인이 소유한 문서를 사용해서 문서를 검색할 수 있도록 처리한다.또한 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 성과물의 상세 정보 및 관련 정보 검색을 선택하면, <669>성과물의 메타데이터와 참여인력, 기관에 대한 상세정보를 볼 수 있도록 처리하고, 인력, 기관, 성과물을 선택한 후에는 관련 추론 서비스로 이동할 수 있도록 처리한다.또한 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 성과물 등록을 선택하면, 사용자가 로그인을 한 후 <670>성과물을 등록할 수 있도록 처리하는 것을 특징으로 한다.또한 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 비성과 정보의 공유 및 공동 문서 작업 수행을 선택 <671>하면, 비성과 정보를 등록할 때 수정 권한을 사용자에게 부여하여 문서를 공유할 수 있도록 처리하고, 비성과정보의 이력보기를 통해 문서의 이력정보를 확인할 수 있도록 처리한다.또한 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 성과물 원문 검색을 선택하면, 사용자가 로그인을 한 <672>후 성과물 상세보기에서 원문을 클릭하면 원문을 다운로드 받을 수 있도록 처리하고, 사용자가 다운로드 받은원문은 전용 뷰어에 의해 볼 수 있도록 처리한다.5-3. 추론 서비스 - 씽크 서비스 <673>도 69는 도 56에서 추론 서비스인 씽크 서비스 제공 화면의 예를 보인 도면이다. <674>그래서 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 특정 주제나 분야를 연구하는 연구자 그룹과 전문가 <675>검색을 선택하면, 공통 메뉴에서 원하는 주제나 분야를 선택하도록 한 다음 연구자 네트워크에서 해당 분야 연구자 그룹과 전문가를 확인할 수 있도록 처리하고, 연구자 네트워크로 사용자가 다시 한번 이동하면 특정 연구자 그룹의 연구자 간 연구 관계를 볼 수 있도록 처리한다.또한 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 특정 연구자가 연구하는 주제와 분야 확인을 선택하면, <676>연구자 정보에서 원하는 연구자를 검색한 후 사용자가 클릭하면, 해당 연구자의 연구 주제와 분야를 확인할 수있도록 처리하고, 성과정보로 이동하면 해당 연구자의 성과물을 성과 유형별로 볼 수 있도록 처리한다.또한 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 특정 주제나 분야를 연구하는 지역과 기관 확인을 선택 <677>하면, 공통 메뉴에서 원하는 주제나 분야를 사용자가 선택한 후 연구 성과 맵으로 이동하면 지역별 현황을 볼수 있도록 처리하고, 특정 지역을 선택한 후 기관정보로 이동하면 관련 기관의 정보를 확인할 수 있도록 처리한다.또한 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 여러 연구자들의 성과 추이 비교를 선택하면, 연구자 <678>네트워크 또는 연구자 정보에서 연구자들을 선택하고, 통계정보로 이동하면, 해당 연구자들의 성과를 그래프를통해 일정 기간 단위별(예를 들면, 연도별)로 확인할 수 있도록 처리한다.또한 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 연구자, 기관, 주제에 대한 상세 정보 확인을 <679>선택하면, 상기 씽크 서비스 제공 화면에서 연구자, 기관, 주제를 선택하면, 상세보기를 통해 상세 정보를 확인할 수 있도록 처리한다.도 70은 도 69에서 씽크 서비스 제공시 초기 화면의 예를 보인 도면이다. <680>그래서 연구자 네트워크, 연구자 정보, 연구성과맵, 통계정보, 성과정보, 기관정보 등을 확인할 수 있도록 <681>한다.도 71은 도 69에서 씽크 서비스 제공시 연구자 네트워크와 공저자 화면의 일 예를 보인 도면이다. <682>여기서는 전체 369명 중에서 상위 20명에 대한 연구자 그룹(들)을 표시한 예를 보여주고 있다. <683>도 72는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 공저자 화면의 다른 예를 보인 도면이다. <684>여기서는 전체 10명을 가진 공저자 네트워크의 출력 예를 보이고 있다. 그래서 각각의 연구자는 다른 연구자와 <685>어떻게 연결되어 있는지를 시각적으로 용이하게 파악할 수 있게 된다.또한 연구자 네트워크 선택시 시간축에서의 연구자 네트워크를 보여줄 수도 있다. <686>- 55 -공개특허 10-2008-0071213도 73은 도 69에서 씽크 서비스 제공시 연구자 네트워크와 전문가 화면의 예를 보인 도면이다. <687>여기서는 전체 369명 중에서 상위 20명의 전문가에 대한 연구자 그룹(들)을 표시한 예를 보여주고 있다. <688>도 74는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 인용 네트워크 화면의 일 예를 보인 도면이다. <689>여기서는 전체 369명 중에서 상위 20명의 전문가에 대한 연구자 그룹(들)을 표시한 예를 보여주고 있는 것으로, <690>각 그룹을 그룹지어 표시하고 있다.도 75는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 인용 네트워크화면의 다른 예를 보인 도면이다. <691>그래서 전체 4명을 가진 인용 네트워크를 표시하여 연구자 간에 주제 또는 분야의 인용 관계를 표시하게 된다. <692>도 76은 도 69에서 씽크 서비스 제공시 연구 성과 맵 화면의 예를 보인 도면이다. <693>그래서 광역 단위 5등급, 시/군/구 단위 10등급으로 구분했을 경우 성과 규모를 보여주는 연구 성과 맵이 출력 <694>되어 있다. 이는 전체보기와 개별보기로 구분하여 연구 성과 맵을 보여줄 수 있도록 한다. 또한 시간축에서의연구 성과 추이를 보여줄 수도 있다.도 77은 도 69에서 씽크 서비스 제공시 통계정보 화면의 일 예를 보인 도면이다. <695>여기서는 최대 3명까지의 연구자 간 성과를 비교할 수 있는 통계정보를 막대그래프로 출력한 예를 보여주고 있 <696>다.도 78은 도 69에서 씽크 서비스 제공시 통계정보 화면의 다른 예를 보인 도면이다. <697>그래서 최대 3명까지의 연구자 간 성과를 비교할 수 있는 통계정보를 꺽은선그래프로 출력한 예를 보여주고 있 <698>다.도 79는 도 69에서 씽크 서비스 제공시 통계정보 화면의 또 다른 예를 보인 도면이다. <699>여기서는 최대 3명까지의 연구자 간 성과를 비교할 수 있는 통계정보를 원형그래프로 출력한 예를 보여주고 있 <700>다.5-4. 통합 연구자 네트워크 서비스 <701>도 80은 도 2 및 도 56에서 씽크 서비스 제공시 통합 연구자 네트워크 서비스부에 의한 통합 연구자 네트워크 <702>서비스 제공 예를 보인 흐름도이다.그래서 먼저 공저자 네트워크, 인용 네트워크, 학연 네트워크를 구축한다(ST401). <703>여기서 공저자 네트워크는 논문, 특허, 연구보고서 등의 공저자들이 각각 다른 연구자들과 어떻게 연결되어 있 <704>는지를 보여주는 네트워크이다. 또한 인용 네트워크는 지식의 구조와 흐름을 파악하기 위한 것으로서, 인용과피인용의 관계를 이용하여 정보의 흐름을 파악하고 이를 이용하여 특정 지역 및 특정 분야의 지식의 구조와 흐름을 파악하는데 사용되도록 구축한 것이다. 또한 학연 네트워크는 각각의 연구자들이 학연 속에서 어떻게 연결되어 있는지를 보여주는 네트워크이다.그리고 구축된 공저자 네트워크, 인용 네트워크, 학연 네트워크 등의 네트워크를 인력 중심으로 통합하여 통합 <705>연구자 네트워크를 구축한다(ST042).본 발명에서는 공저자 네트워크, 인용 네트워크, 학연 네트워크의 세 가지 예를 들었지만, 연구자들이 서로 연 <706>결되는 항목이라면 해당 항목에 의한 연구자 네트워크로 구축하고, 이를 통합 연구자 네트워크에 결합할 수 있다.그런 다음 이렇게 구축된 통합 연구자 네트워크를 이용하여 통합 연구자 네트워크 서비스를 제공하게 된다 <707>(ST403).5-5. 연구자 친밀도 서비스 <708>도 81은 도 2 및 도 56에서 씽크 서비스 제공시 연구자 친밀도 서비스부에 의한 연구자 친밀도 서비스 제공 예 <709>를 보인 흐름도이다.그래서 먼저 연구자 자료를 수집한다. <710>이러한 연구자 자료에는 링크 거리, 링크 타입(공저자, 인용, 소속), 주제 또는 분야(인적, 문헌적 주제/분야 <711>- 56 -공개특허 10-2008-0071213등), 성과 유형 가중치(논문 또는 보고서 등), 링크 강도(수량 또는 가중치 등) 등이 포함된다.여기서 링크 거리는 연구자 네트워크의 인용 네트워크에서 특정 연구자와 다른 연구자 사이에 연결된 링크의 개 <712>수를 말한다.또한 링크 타입은 연구자 사이에 연결된 링크가 공저자 관계인가, 인용-피인용 관계인가, 특정 기관이나 지역 <713>또는 학회에 소속된 관계인가 등을 나타낸다.또한 주제 또는 분야는 연구자가 연구하는 주제 또는 분야를 말하는 것으로, 인적으로 결합된 주제/분야 또는 <714>문헌적으로 결합된 주제/분야 등을 말한다.또한 성과 유형 가중치는 학술대회 논문집, 논문지, 보고서, 특허 등으로 성과가 제출되었을 경우, 각각의 성과 <715>유형에 대해 가중치를 부여한 것으로서, 연구자 친밀도 계산에 이용되도록 하는 것이다.또한 링크 강도는 연구자 사이에 연결된 링크에서 인용논문의 수 또는 가중치를 결합하여 설정한 값이다. <716>이 외에도 연구자 친밀도 계산에 사용하는 정보는 인용 뿐만 아니라 공저자, 학연 등 연구자 인력 사이에서 관 <717>련된 모든 것들이 포함될 수 있다.이렇게 연구자 친밀도를 계산하기 위한 필요한 자료들은 지식 처리부(100)에서의 기본적인 가공을 거쳐 연구자 <718>친밀도 서비스부(380)에서 수집되도록 할 수 있다(ST411).그런 다음 수집된 자료를 이용하여 연구자 간의 친밀도를 계산한다. <719>또한 연구자 친밀도 계산은 도 80에 의해 구축된 통합 연구자 네트워크 상에서 수행한다. <720>이때 친밀도 계산에 사용된 자료들은 링크 거리, 링크 타입, 주제 또는 분야, 성과 유형 가중치, 링크 강도 등 <721>이 된다. 이들 모두를 결합하여 계산하게 되면, 각각의 연구자들과 연구자 그룹들에 대한 친밀도를 수량화하는것이 가능하게 된다(ST412).그리고 계산된 친밀도를 이용하여 시각화를 수행하게 된다. <722>이는 지역별, 기관별 주제와 분야 추이를 시각화하거나 또는 연구그룹간 지역별, 기관별 협력 연구 추이를 시각 <723>화하거나 또는 공저자 사이의 관계를 시각화하거나 또는 연구자 사이의 인용-피인용 관계를 시각화하거나 또는시간축에서의 친밀도를 시각화할 수 있다.그래서 지역별, 기관별 주제와 분야 추이를 시각화하게 되면, 지역별 또는 기관별 주제/분야에서 친밀도가 높은 <724>부분을 용이하게 파악할 수 있게 된다.또한 연구그룹간 지역별, 기관별 협력 연구 추이를 시각화하게 되면, 친밀도가 높은 연구그룹의 경향을 용이하 <725>게 파악할 수 있게 된다.또한 공저자 사이의 관계를 시각화하게 되면, 공저자 사이가 단순 연결 관계에 머무르는 것이 아닌 친밀도가 높 <726>은 공저자와 친밀도가 낮은 공저자를 구분할 수 있게 된다.또한 연구자 사이의 인용-피인용 관계를 시각화하게 되면, 연구자 사이의 인용-피인용 관계를 용이하게 파악할 <727>수 있게 된다. 따라서 연구자 중에서 스타형 연구자와 방사형 연구자의 구별이 용이하게 된다. 인용-피인용 관계를 시각화 하기 이전에는 연구자 사이의 연결 관계만이 표현된다. 그러나 인용-피인용 관계를 화살표를 이용하여 시각화하게 되면 그 관계 파악이 훨씬 용이하게 된다.또한 시간축에서의 친밀도를 시각화할 수 있다. 즉, 각각의 시기에 대해 연구자 네트워크에서 연구자 사이의 친 <728>밀도를 표현하는 것이다. 그러면 어떤 시점에서는 친밀도가 낮다가 이후의 어떤 시점에서는 친밀도가 높아지거나 또는 어떤 시점에서는 친밀도가 높다가 이후의 어떤 시점에서는 친밀도가 낮아지는 경향을 파악할 수 있게된다(ST413).이러한 친밀도 계산 및 시각화를 통해 과거 및 현재의 연구자 네트워크에서의 연구자 사이의 관계를 파악할 수 <729>있을 뿐만 아니라 미래의 연구 방향 설정 등에서 매우 중요한 자료로 활용할 수 있게 된다.6. 본 발명에 의한 서비스의 우수성 <730>6-1. 정보 공유/유통 플랫폼 <731>본 발명은 정보 공유 유통 플랫폼을 구축하여 서버에서 연구자 간 협업 지원을 위한 연구 성과물의 등록/검색은 <732>- 57 -공개특허 10-2008-0071213물론 성과물에 대한 이력 추적/관리 지원이 가능하고, URI 서버와 연계하여 자료의 정합성을 보장하고, 언어 자원 및 추론 서비스와 연계하여 성과물에 대한 다양한 부가정보를 제공할 수 있다.또한 사용자 클라이언트에 대해 연구 성과물의 유통을 지원하기 위한 성과물 보호 기법을 적용하고, 다양한 문 <733>서 포맷 (Ms-Office, HWP, PDF 등)을 지원하며, 서버와의 연계를 통한 성과물 정보를 제공할 수 있다.또한 온톨로지 기반 추론 시스템에 의해 추론 규칙을 적용하여 다양한 부가 관계를 생성하고, 이를 효율적으로 <734>시각화하기 위한 인터페이스 제공할 수 있으며, 대용량의 RDF 트리플 데이터 처리를 위해 DBMS를 저장소로 활용할 수 있고, 연구자 협업을 위한 연구자 네트워크(공동 연구, 인용 관계, 성과물 별 전문가) 정보를 보여주는것은 물론 성과물 중심으로 연구자/기관/지역의 연구 동향정보를 제공할 수 있게 된다.또한 시소러스 기반 주제/분야 분류 시스템에 의해 통제 가능하고 정교한 시소러스를 활용함으로써 주제/분야에 <735>대한 고품질의 동적 문서 분류를 지원하고, 문서와 언어 자원이 분리된 자동적인 주제/분야 할당을 통한 유지/보수의 편리성 및 확장성을 보장한다.또한 URI 서버에 의해 국가 과학기술 R&D 기반정보 온톨로지에서 자원으로 정의된 연구 인력, 학술 성과, 기관, <736>지역 등을 KOI(Knowledge Object Identifier) 식별 체계를 중심으로 하여 URI 형태로 관리할 수 있고, URI 서버를 통하여 가변적인 자원들의 URI를 별도 관리하고 온톨로지에서 분리시킴으로써, 보다 효율적인 온톨로지의유지/보수가 가능하다.6-2. 추론 서비스 및 기반 언어 자원 <737>추론 기반 응용 서비스에 의해 연구자의 연구 수행 전체 과정에서 실질적인 도움을 줄 수 있는 추론 기반 응용 <738>서비스 제공할 수 있다. 이때 제공되는 추론 기반 응용 서비스에는 공저자, 참여 사업, 인용/피인용 관점에서의연구자/전문가 네트워크 추적 서비스, 연구자 개인 및 특정 기관의 연구 동향 추적 서비스, 지역별 연구 성과맵 추적 서비스 등이 포함된다.또한 국가 과학기술 R&D 기반정보 온톨로지에 의해 논문, 보고서, 지적재산권 등 성과정보를 모델링하기 위한 <739>온톨로지를 구축할 수 있고, 150여 만개의 국내 최대 규모 대용량 RDF 트리플을 구축할 수 있다.또한 과학기술 범용 및 IT 분야 시소러스에 의해 시소러스 구축 전주기의 각 단계 별 구축 업무에 대한 체계적 <740>인 지침 작성이 가능하고, 구축 지침에 따른 체계적인 시소러스 구축을 할 수 있으며, 철저한 의미 제약에 따른일관적인 계층 관계를 구축할 수 있고, BT(Broader Term, 상위어), NT(Narrower Term, 하위어), RT(RelatedTerm, 관계어), USE(Use, 대체어), UF(Use For Or Synonymous, 용례 혹은 동의어) 등의 다양한 정보를 수용할수 있게 된다.범용 과학기술/IT 분야의 분류체계를 연계하여 과제 관리 기관마다 상이한 분류 체계에 따라 분류된 성과물을 <741>일원화된 분류체계로 재구성할 수 있고, 시소러스를 활용한 자동 주제/분야 분류가 가능하다.또한 기반 언어 자원 구축을 위한 지원 도구를 제공함으로서, 컴포넌트 기반의 다중 시소러스 구축/관리 지원이 <742>가능하고, 협업 구축 환경을 지원할 수 있으며, 웹 서비스(Web Services)를 위한 인터페이스를 제공할 수 있다.7. 본 발명의 기대 효과 <743>7-1. 기술적 측면 <744>국가 과학기술 R&D 기반의 정보유통 체제를 효율화 할 수 있게 되어 국가 과학기술 R&D 기반 정보의 표준화 및 <745>연계/통합에 기반한 효율적인 국가 R&D 관련정보유통 체제의 토대를 마련할 수 있게 된다.또한 정보의 지식화를 통해 지식 처리의 기반이 되는 대용량의 언어 자원, 전문 용어 사전, 분야 별 시소러스 <746>및 온톨로지 등을 활용한 국가 과학기술정보의 형식적/내용적 표준화 및 지식화를 위한 기반 마련이 가능하다.또한 과학기술 언어 자원을 활용한 전문정보 서비스 수행에 요구되는 요소 기능들을 개발함으로써 과학기술 분 <747>야 뿐만 아니라 국가 전체의 지식 유통 수준을 향상시킬 수 있는 계기를 마련할 수 있게 된다.또한 지식정보유통 패러다임을 개선하여 정적이고 획일적인 지식의 일방적인 흐름을 탈피하여 역동적이고 상호 <748>협력적인 과학기술 지식의 생성/가공/서비스 체제의 기틀을 마련할 수 있고, 과학기술 분야의 전문가들로 구성된 On-line Self-organizing Virtual Research Community가 형성되어 살아 숨 쉬는 과학기술 지식이 생성되고자발적으로 공유/유통될 수 있는 신개념의 지식정보유통 체제의 토대를 마련할 수 있게 된다.- 58 -공개특허 10-2008-00712137-2. 경제/산업적 측면 <749>정보 자원 공유 및 정보 서비스의 질적 향상을 통한 국가 경쟁력 강화가 가능하다. <750>즉, 정보 획득 과정을 효율화하고 신뢰도가 높은 정보를 제공하여, 연구자들의 연구/개발 활동의 생산성을 증대 <751>시키고, 조사/제안/관리/평가 등과 같은 연구 관리 업무를 획기적으로 효율화함으로써 전반적인 연구/개발 관련활동의 효율성과 생산성을 향상시켜 궁극적으로는 국가 경쟁력 향상에 일익을 담당할 수 있도록 하게 된다.또한 지식정보 자원의 효율적인 공유/활용 체제를 기반으로 하여, 이미 구축된 지식정보 자원들에 대한 지속적 <752>인 공동 연구 및 확장을 통해 지식정보 자원의 고품질화 및 고성능화와 지식정보 자원 개발 공정의 획기적인 단축을 유도할 수 있게 된다.또한 시맨틱 웹과 관련된 기반 기술에 대한 연구 및 기술 확보를 통하여 차세대 웹 환경으로의 전이를 용이하게 <753>함으로써 지식정보 강국으로서의 국가적 위상을 강화시킬 수 있게 된다.이처럼 본 발명은 차세대 지능형 웹으로 컴퓨터가 정보의 의미를 이해하고 정보들 간의 논리적 추론까지 할 수 <754>있는 시맨틱 웹 기술을 활용하여 연구 개발 전주기 지원서비스 플랫폼을 구축하여 연구기획에 필요한 연구동향은 물론이고 최적의 협력 연구자 선정, 지역별/연구분야별 특색에 맞는 정확한 정책수립 등에 필요한 모든 정보를 효율적으로 파악하게 되는 것이다. 발명의 효과이상에서 살펴본 바와 같이, 본 발명에 의한 시맨틱 웹 기반 연구정보 서비스 시스템 및 그 방법은 차세대 지능 <755>형 웹으로 컴퓨터가 정보의 의미를 이해하고 정보들 간의 논리적 추론까지 할 수 있는 시맨틱 웹 기술을 활용하여 연구 개발 전주기 지원서비스 플랫폼을 구축하여 연구기획에 필요한 연구동향은 물론이고 최적의 협력 연구자 선정, 지역별/연구분야별 특색에 맞는 정확한 정책수립 등에 필요한 모든 정보를 효율적으로 파악할 수 있는효과가 있게 된다.또한 본 발명은 기술적 측면에서, 국가 과학기술 R&D 기반의 정보유통 체제를 효율화 할 수 있게 되어 국가 과 <756>학기술 R&D 기반 정보의 표준화 및 연계/통합에 기반한 효율적인 국가 R&D 관련정보유통 체제의 토대를 마련할수 있게 되고, 또한 정보의 지식화를 통해 지식 처리의 기반이 되는 대용량의 언어 자원, 전문 용어 사전, 분야별 시소러스 및 온톨로지 등을 활용한 국가 과학기술정보의 형식적/내용적 표준화 및 지식화를 위한 기반 마련이 가능하며, 또한 과학기술 언어 자원을 활용한 전문정보 서비스 수행에 요구되는 요소 기능들을 개발함으로써과학기술 분야 뿐만 아니라 국가 전체의 지식 유통 수준을 향상시킬 수 있는 계기를 마련할 수 있게 되고, 또한지식정보유통 패러다임을 개선하여 정적이고 획일적인 지식의 일방적인 흐름을 탈피하여 역동적이고 상호 협력적인 과학기술 지식의 생성/가공/서비스 체제의 기틀을 마련할 수 있고, 과학기술 분야의 전문가들로 구성된On-line Self-organizing Virtual Research Community가 형성되어 살아 숨 쉬는 과학기술 지식이 생성되고 자발적으로 공유/유통될 수 있는 신개념의 지식정보유통 체제의 토대를 마련할 수 있게 되는 효과가 있다.또한 본 발명은 경제/산업적 측면에서, 정보 자원 공유 및 정보 서비스의 질적 향상을 통한 국가 경쟁력 강화가 <757>가능하다. 즉, 정보 획득 과정을 효율화하고 신뢰도가 높은 정보를 제공하여, 연구자들의 연구/개발 활동의 생산성을 증대시키고, 조사/제안/관리/평가 등과 같은 연구 관리 업무를 획기적으로 효율화함으로써 전반적인 연구/개발 관련 활동의 효율성과 생산성을 향상시켜 궁극적으로는 국가 경쟁력 향상에 일익을 담당할 수 있도록하게 되고, 또한 지식정보 자원의 효율적인 공유/활용 체제를 기반으로 하여, 이미 구축된 지식정보 자원들에대한 지속적인 공동 연구 및 확장을 통해 지식정보 자원의 고품질화 및 고성능화와 지식정보 자원 개발 공정의획기적인 단축을 유도할 수 있게 되며, 또한 시맨틱 웹과 관련된 기반 기술에 대한 연구 및 기술 확보를 통하여차세대 웹 환경으로의 전이를 용이하게 함으로써 지식정보 강국으로서의 국가적 위상을 강화시킬 수 있게 되는효과가 있다.이상에서 본 발명의 바람직한 실시예에 한정하여 설명하였으나, 본 발명은 이에 한정되지 않고 다양한 변화와 <758>변경 및 균등물을 사용할 수 있다. 따라서 본 발명은 상기 실시예를 적절히 변형하여 응용할 수 있고, 이러한응용도 하기 특허청구범위에 기재된 기술적 사상을 바탕으로 하는 한 본 발명의 권리범위에 속하게 됨은 당연하다 할 것이다.도면의 간단한 설명도 1은 본 발명의 일 실시예에 의한 시맨틱 웹 기반 연구정보 서비스 시스템의 블록구성도이다. <1>- 59 -공개특허 10-2008-0071213도 2는 도 1에서 정보유통 서비스부와 추론 서비스부 및 그 주변블록의 상세블록도이다. <2>도 3은 본 발명의 일 실시예에 의한 시맨틱 웹 기반 연구정보 서비스 방법을 보인 흐름도이다. <3>도 4는 도 3에서 인력개체 확인 수행시 온톨로지 인스턴스의 sameAs 관리 시스템의 블록구성도이다. <4>도 5는 도 3에서 인력개체 확인 수행시 온톨로지 인스턴스의 sameAs 관리 방법을 상세히 보인 흐름도이다. <5>도 6은 도 4 또는 도 5에서 sameAs 관리부의 일 예를 보인 도면이다. <6>도 7은 도 4 또는 도 5에서 sameAs 관계 설정부 및 sameAs 관계 해제부의 일 예를 보인 도면이다. <7>도 8은 도 4 또는 도 5에서 sameAs 그룹 지식 처리부의 일 예를 보인 도면이다. <8>도 9는 도 4 또는 도 5에서 sameAs 후 처리부의 일 예를 보인 도면이다. <9>도 10은 도 3에서 인력개체 확인 수행시 원문으로부터의 정보추출기법을 사용한 동명저자 중의성 해소 방법을 <10>보인 흐름도이다.도 11은 도 3에서 URI 기반 처리 수행시 URI 기반 네트워크 구축의 예를 보인 흐름도이다. <11>도 12는 도 11에서 인용정보 추출 단계의 상세흐름도이다. <12>도 13은 도 12에서 인용정보 메타데이터 추출 단계의 상세흐름도이다. <13>도 14는 도 13에서 정보추출시 학술대회 추출 필드 및 추출 정규식의 예를 보인 표이다. <14>도 15는 도 13에서 정규화시 학회명 변환 테이블의 예를 보인 표이다. <15>도 16은 도 13에서 정규화시 논문지명 변환 테이블의 예를 보인 표이다. <16>도 17은 도 11에서 문헌기반 인용관계 구축 단계의 상세흐름도이다. <17>도 18은 도 11에서 저자기반 인용관계 구축 단계의 상세흐름도이다. <18>도 19는 도 11에서 인용 네트워크 구축 단계에 의한 인용 네트워크 구축의 예를 보인 개념도이다. <19>도 20은 도 11에 의해 URI 기반 처리 수행시 저자 중심 인용네트워크 그룹 및 인용네트워크 구현의 예를 보인 <20>개념도이다.도 21은 도 3에서 URI 기반 처리 수행시 URI 기반 성과 정보 관리 시스템의 블록구성도이다. <21>도 22는 도 3에서 URI 기반 처리 수행시 URI 기반 성과 정보 관리 방법을 보인 흐름도이다. <22>도 23은 도 22에서 성과 정보 등록을 상세히 보인 상세흐름도이다. <23>도 24는 도 22에서 성과 정보 승인을 상세히 보인 상세흐름도이다. <24>도 25는 도 22에서 성과 정보 초기화를 상세히 보인 상세흐름도이다. <25>도 26은 도 22에서 성과 정보 삭제를 상세히 보인 상세흐름도이다. <26>도 27은 도 22에서 성과 정보 수정을 상세히 보인 상세흐름도이다. <27>도 28은 도 22에서 성과 정보 상태 변경을 상세히 보인 상세흐름도이다. <28>도 29는 도 22에서 URI 관리에 사용되는 RDF 트리플의 일 예를 보인 표이다. <29>도 30은 도 3에서 주제/분야 할당 수행시 통계기반 문서분류를 통한 시소러스 확장 방법 및 하이브리드 문서 분 <30>류 방법을 보인 흐름도이다.도 31은 도 30에서 통계 기반 문서 분류의 상세흐름도이다. <31>도 32는 도 30에서 시소러스 확장의 상세흐름도이다. <32>도 33은 도 30에서 분야분류체계-시소러스 간 매핑의 상세흐름도이다. <33>도 34는 도 30에서 시소러스 기반 문서 분류의 상세흐름도이다. <34>- 60 -공개특허 10-2008-0071213도 35는 도 30에서 하이브리드 기반 문서 분류의 상세흐름도이다. <35>도 36은 도 30에 의해 통계적 문서 분류를 통한 시소러스 확장을 수행하는 예를 보인 개념도이다. <36>도 37은 도 30에 의해 시소러스 기반과 통계 기반이 결합된 문서 분류를 수행하는 예를 보인 개념도이다. <37>도 38은 도 30에 의해 택소노미가 매핑된 시소러스의 일 예를 보인 개념도이다. <38>도 39는 도 3에서 주제/분야 할당 수행시 시소러스가 구축되어 있을 때 주제 분야 할당의 예를 보인 <39>흐름도이다.도 40은 도 39에서 주제/분야 할당 수행시 시소러스가 미구축되어 있을 때 주제 분야 할당의 예를 보인 흐름도 <40>이다.도 41은 도 40에서 택소노미를 이용하여 분야를 자동 할당하는 동작을 보인 흐름도이다. <41>도 42는 도 40에서 태그를 이용하여 주제를 자동 할당하는 동작을 보인 흐름도이다. <42>도 43은 도 40에서 태그와 폭소노미를 이용하여 주제 또는 분야를 자동 할당하는 동작을 보인 흐름도이다. <43>도 44는 도 3에서 DBMS 기반 지식 확장 및 추론 수행시 DBMS 기반 지식 확장 및 추론 서비스 시스템의 일 예를 <44>보인 블록구성도이다.도 45는 도 3에서 DBMS 기반 지식 확장 및 추론 서비스 방법을 보인 흐름도이다. <45>도 46은 도 44 또는 도 45에서 정보 흐름 순서를 보인 개념도이다. <46>도 47은 도 44 또는 도 45에서 온톨로지 스키마와 RDF/XML 파서에 의한 파싱 결과의 일 예를 보인 도면이다. <47>도 48은 도 44 또는 도 45에서 DB-트리플 변환 규칙 생성의 일 예를 보인 도면이다. <48>도 49는 도 44 또는 도 45에서 DB-트리플 변환에 의해 생성되는 인스턴스 트리플의 일 예를 보인 도면이다. <49>도 50은 도 44 또는 도 45에서 지식 확장 규칙 생성에 의해 생성된 스키마 기반 확장 규칙의 일 예를 보인 도면 <50>이다.도 51은 도 44 또는 도 45에서 사용자정의 확장 규칙의 일 예를 보인 도면이다. <51>도 52는 도 44 또는 도 45에서 사용자질의와 질의 변환에 의해 변환된 변환질의의 일 예를 보인 도면이다. <52>도 53은 도 44 또는 도 45에서 SQL로 DBMS 기반 확장 트리플에 문의하여 얻어진 질의결과의 일 예를 보인 도면 <53>이다.도 54는 도 44 또는 도 45에서 질의결과를 정렬하고 필터링하는 등의 가공에 의해 생성된 후 처리결과의 일 예 <54>를 보인 도면이다.도 55는 도 44 또는 도 45에서 URI 서버를 참조하고 후 처리결과를 이용하여 사용자 인터페이스에서 정의된 형 <55>태의 API로 출력하는 추론결과의 일 예를 보인 도면이다.도 56은 도 3에서 서비스 제공 단계에서 제공되는 지식정보 공유서비스의 예를 보인 도면이다. <56>도 57은 도 56에서 프레임 서비스 제공 화면의 예를 보인 도면이다. <57>도 58은 도 57에서 선행연구 동향파악 선택시 동작 예를 보인 흐름도이다. <58>도 59는 도 58에서 메인 화면에서 주제 선택시의 화면 예를 보인 도면이다. <59>도 60은 도 58에서 연구자 네트워크 선택과 연구자 그룹 확인 화면의 예를 보인 도면이다. <60>도 61은 도 58에서 연구자 네트워크 선택과 공저자 네트워크 확인 화면의 예를 보인 도면이다. <61>도 62는 도 58에서 통계정보 선택시 연구자 간 비교 및 연구 추이 파악 화면의 예를 보인 도면이다. <62>도 63은 도 58에서 성과정보 선택시 성과 유형 별 연구 성과 제시 화면의 예를 보인 도면이다. <63>도 64는 도 58에서 상세보기 선택시 성과 상세보기 화면의 예를 보인 도면이다. <64>도 65는 도 58에서 연구자 정보 선택시 인력 상세보기 화면의 예를 보인 도면이다. <65>- 61 -공개특허 10-2008-0071213도 66은 도 58에서 연구 성과 맵 선택시 지역별 연구 성과 보기 화면의 예를 보인 도면이다. <66>도 67은 도 58에서 기관정보 선택시 지역별 소속 기관 보기 화면의 예를 보인 도면이다. <67>도 68은 도 56에서 정보유통 서비스인 스토어 서비스 제공 화면의 예를 보인 도면이다. <68>도 69는 도 56에서 추론 서비스인 씽크 서비스 제공 화면의 예를 보인 도면이다. <69>도 70은 도 69에서 씽크 서비스 제공시 초기 화면의 예를 보인 도면이다. <70>도 71은 도 69에서 씽크 서비스 제공시 연구자 네트워크와 공저자 화면의 일 예를 보인 도면이다. <71>도 72는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 공저자 화면의 다른 예를 보인 도면이다. <72>도 73은 도 69에서 씽크 서비스 제공시 연구자 네트워크와 전문가 화면의 예를 보인 도면이다. <73>도 74는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 인용 네트워크 화면의 일 예를 보인 도면이다. <74>도 75는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 인용 네트워크화면의 다른 예를 보인 도면이다. <75>도 76은 도 69에서 씽크 서비스 제공시 연구 성과 맵 화면의 예를 보인 도면이다. <76>도 77은 도 69에서 씽크 서비스 제공시 통계정보 화면의 일 예를 보인 도면이다. <77>도 78은 도 69에서 씽크 서비스 제공시 통계정보 화면의 다른 예를 보인 도면이다. <78>도 79는 도 69에서 씽크 서비스 제공시 통계정보 화면의 또 다른 예를 보인 도면이다. <79>도 80은 도 2 및 도 56에서 씽크 서비스 제공시 통합 연구자 네트워크 서비스부에 의한 통합 연구자 네트워크 <80>서비스 제공 예를 보인 흐름도이다.도 81은 도 2 및 도 56에서 씽크 서비스 제공시 연구자 친밀도 서비스부에 의한 연구자 친밀도 서비스 제공 예 <81>를 보인 흐름도이다.* 도면의 주요 부분에 대한 부호의 설명 * <82>100 : 지식 처리부 <83>110 : 인력개체 확인부 <84>120 : URI 기반 처리부 <85>130 : 주제/분야 할당부 <86>140 : DBMS 기반 지식확장 및 추론부 <87>200 : 정보유통 서비스부(OntoStore-k) <88>210 : 정보 등록/관리 서비스부 <89>220 : 관련성과/참조성과 검색 서비스부 <90>230 : 주제/분야 세부정보 열람 서비스부 <91>240 : 통계 서비스부 <92>300 : 추론 서비스부(OntoThink-K) <93>310 : 연구자 네트워크 서비스부 <94>320 : 연구자 정보 서비스부 <95>330 : 연구 성과 맵 서비스부 <96>340 : 성과정보 서비스부 <97>350 : 기관정보 서비스부 <98>360 : 통계정보 서비스부 <99>- 62 -공개특허 10-2008-0071213370 : 통합 연구자 네트워크 서비스부 <100>380 : 연구자 친밀도 서비스부 <101>400 : 공통 서비스부 <102>410 : URI 등록/관리 서비스부 <103>420 : 주제/분야 분류 서비스부 <104>도면 도면1- 63 -공개특허 10-2008-0071213 도면2- 64 -공개특허 10-2008-0071213 도면3- 65 -공개특허 10-2008-0071213 도면4- 66 -공개특허 10-2008-0071213 도면5 도면6- 67 -공개특허 10-2008-0071213 도면7- 68 -공개특허 10-2008-0071213 도면8- 69 -공개특허 10-2008-0071213 도면9- 70 -공개특허 10-2008-0071213 도면10- 71 -공개특허 10-2008-0071213 도면11 도면12- 72 -공개특허 10-2008-0071213 도면13- 73 -공개특허 10-2008-0071213 도면14- 74 -공개특허 10-2008-0071213 도면15 도면16- 75 -공개특허 10-2008-0071213 도면17 도면18- 76 -공개특허 10-2008-0071213 도면19 도면20- 77 -공개특허 10-2008-0071213 도면21- 78 -공개특허 10-2008-0071213 도면22 도면23- 79 -공개특허 10-2008-0071213 도면24 도면25- 80 -공개특허 10-2008-0071213 도면26 도면27- 81 -공개특허 10-2008-0071213 도면28 도면29- 82 -공개특허 10-2008-0071213 도면30- 83 -공개특허 10-2008-0071213 도면31- 84 -공개특허 10-2008-0071213 도면32- 85 -공개특허 10-2008-0071213 도면33- 86 -공개특허 10-2008-0071213 도면34- 87 -공개특허 10-2008-0071213 도면35 도면36- 88 -공개특허 10-2008-0071213 도면37 도면38- 89 -공개특허 10-2008-0071213 도면39- 90 -공개특허 10-2008-0071213 도면40- 91 -공개특허 10-2008-0071213 도면41- 92 -공개특허 10-2008-0071213 도면42- 93 -공개특허 10-2008-0071213 도면43- 94 -공개특허 10-2008-0071213 도면44- 95 -공개특허 10-2008-0071213 도면45- 96 -공개특허 10-2008-0071213 도면46 도면47- 97 -공개특허 10-2008-0071213 도면48 도면49 도면50- 98 -공개특허 10-2008-0071213 도면51 도면52- 99 -공개특허 10-2008-0071213 도면53 도면54- 100 -공개특허 10-2008-0071213 도면55 도면56- 101 -공개특허 10-2008-0071213 도면57- 102 -공개특허 10-2008-0071213 도면58- 103 -공개특허 10-2008-0071213 도면59 도면60- 104 -공개특허 10-2008-0071213 도면61 도면62- 105 -공개특허 10-2008-0071213 도면63 도면64- 106 -공개특허 10-2008-0071213 도면65 도면66- 107 -공개특허 10-2008-0071213 도면67 도면68- 108 -공개특허 10-2008-0071213 도면69 도면70- 109 -공개특허 10-2008-0071213 도면71 도면72- 110 -공개특허 10-2008-0071213 도면73 도면74- 111 -공개특허 10-2008-0071213 도면75 도면76- 112 -공개특허 10-2008-0071213 도면77 도면78- 113 -공개특허 10-2008-0071213 도면79 도면80- 114 -공개특허 10-2008-0071213 도면81- 115 -공개특허 10-2008-0071213"}
{"patent_id": "10-2006-0130706", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 시맨틱 웹 기반 연구정보 서비스 시스템 및 그 방법을 제공하기 위한 것으로, URI 기반과 DBMS 기반 하에 지식 처리를 수행하여 지식정보 공유 서비스가 제공될 수 있도록 처리하는 지식 처리부와; 상기 지식 처리 부에서 처리된 결과를 제공받고, 시맨틱 웹에 기반하여 연구정보의 등록과 검색 처리 및 통계 서비스를 제공하는 정보 유통 서비스부와; 상기 지식 처리부에서 처리된 결과를 제공받고, 팩트, 규칙 및 후처리를 통해 연구개발 정보에서 명시적으로 드러나 있지 않은 간접적인 정보를 발굴하여 제공하는 추론 서비스부;를 포함하여 구성함으 로서, 차세대 지능형 웹으로 컴퓨터가 정보의 의미를 이해하고 정보들 간의 논리적 추론까지 할 수 있는 시맨틱 웹 기술을 활용하여 연구 개발 전주기 지원서비스 플랫폼을 구축하여 연구기획에 필요한 연구동향은 물론이고 최 적의 협력 연구자 선정, 지역별/연구분야별 특색에 맞는 정확한 정책수립 등에 필요한 모든 정보를 효율적으로 파악할 수 있게 되는 것이다."}
{"patent_id": "10-2006-0130706", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "를 대상으로 한 \"국가 과학 기술 연구/개발 기반정보 온톨로지(National Science & Technology R&D Reference Ontology)\"와 \"범용 과학기 술 분야 시소러스\"를 구축할 수 있게 되었다. 또한 IT(Information Technology, 정보 통신 기술), BT(Biology Technology, 생명 공학 기술), NT(Nano Technology, 초정밀 원자 기술) 및 기초 과학기술 분야 등과 같은 과학 기술 각 분야를 위한 분야별 기반 지식자원들을 지속적으로 구축/적용함으로써, 개별 분야 지식정보 처리를 위 한 OFK 전문성을 확장해 나갈 수 있게 되었다. 2. 관련 연구 <257> OFK는 과학기술 분야에 종사하는 연구/개발자들 간의 자발적인 협업 연구 지원을 목표로 정보유통 기술과 시맨 <258> 틱 웹 기술의 결합에 기초하여 개발되고 있다. 이에 본 장에서는, 협업 연구 지원을 위해서, 기존의 정보유통 기술 관련 연구들과 시맨틱 웹 기술 관련 연구들 <259> 에서 개선되어야 하는 사항들을 살펴보고 OFK에서는 현재 어떠한 해결 방안이 제시되고 있으며 향후 OFK가 추구 해야 할 방향을 가늠해 보고자 한다. 협업 연구 지원을 위해서는 유통되고 있는 지식정보의 식별(identification)과 유통 과정 중 발생될 수 있는 변 <260> 경 및 수정에 따른 정보의 이력(version 또는 history) 관리가 필요하다. 이와 관련된 정보유통 관련 연구들을 살펴보면, P2P(Peer-To-Peer)를 포함한 많은 연구들이 식별자(identifier) 검사 등과 같은 방법을 사용한 정보 에 대한 검증에 관심을 가지고 있음을 알 수 있다. 예를 들어, 종래기술의 문헌 정보 [1](이하에서는 문헌 정보 - 31 -공개특허 10-2008-0071213의 번호만을 기재함)과 [2]의 연구에서는 식별자를 미디어 문서 파일의 헤더에 부착하는 방식을 사용하여, 동일 문서는 동일 식별자를 가질 수 있도록 하는 방안을 제시하였다. 그러나 [1]과 [2]에는 사용자가 의도적으로 문서의 헤더 정보를 바꾸거나 또는 특정 문서에 대한 이력을 추적하 <261> 고자 하는 경우에 대응하기 위한 적절한 해결 방안이 제시되지 못한 한계가 있었다. 문서 파일에 추가된 부가정 보(또는 메타데이터)의 신뢰성 또한 연구자들 간의 협업 연구 지원에 매우 중요하다. 부가정보는, 정보유통의 신뢰도 확보를 위하여, 등록된 문서 파일에 대한 검증 및 특정 문서 파일의 이력 추적에 활용될 수 있기 때문에 부가정보의 신뢰도는 결과적으로 정보유통 과정 자체의 신뢰성을 좌우할 수 있기 때문이다. 그러나 앞의 연구들 뿐만 아니라 대부분의 관련 기존 연구들에서는 부가정보 생성 과정에 대한 효율적인 통제 방안이 제시되지 않음 으로 인해 생성된 부가정보의 신뢰성 및 체계성을 확보하기 어려울 뿐만 아니라 그로 인해 이전 버전 문서 파일 들 간의 올바른 연결 관계를 제시할 수 없다는 문제점이 존재한다([3], [4], [5] 참조). 이러한 문제들을 해결하기 위해서, 본 발명의 OFK에는 \"문서 컨테이너(document container)\"라는 개념이 도입되 <262> 었다. 문서 컨테이너는 문서 파일 자체에 관련 메타데이터와 관리 정보들이 인코딩되어 추가/통합된 파일 형태 로, 유통을 위해 문서 파일을 등록할 경우, 자동적으로 해당 메타데이터 역시 동시에 등록되게 함으로써 온톨로 지 기반의 추론 과정을 효율적으로 지원할 수 있도록 한다. 또한, 문서 컨테이너는 자체적으로 이력을 추적할 수 있는 관련 문서 정보와 메타데이터를 내포하고 있으므로, 문서 컨테이너가 등록될 때 문서 파일 자체에 대한 자동적인 검증이 가능하며, 사용자가 원하는 정보를 내려 받는 경우에도 문서 컨테이너 형식으로 내려 받은 후 OFK의 클라이언트로 문서 컨테이너에 포함된 메타데이터 및 문서 파일을 볼 수 있게 함으로써 신뢰도가 높은 지 식정보 유통이 가능하도록 한다. 시맨틱 웹과 관련된 기존 연구들로는, 영국 EPSRC(Engineering & Physical Science Research Council)에서 주 <263> 관하는 AKT(Advanced Knowledge Technologies) 사업에서 개발된 CAS(CS AKTive Space), 독일 Karlsruhe 대학의 SEAL(Semantic portAL)과 같은 비교적 성공적인 시맨틱 웹 응용 시스템들이 해외에서 발표된 바가 있다. 반면 국내의 경우, 아직까지는 실세계(real world) 정보를 대상으로 시맨틱 웹 기술을 적용한 사례는 발견하기 어려 우며, 대개는 가상 정보나 실험실 규모의 간단한 정보를 다루는 수준에 머물고 있는 실정이다. 국내외의 시맨틱 웹 기반 서비스들의 공통적인 문제점으로는 주로 정적인 지식 서비스를 제공하기 위해 설계되고 구현되어 계속 적으로 추가되는 정보를 반영하기 위한 동적 지식화 과정을 가지고 있지 않다는 것을 지적할 수 있다([6], [7]."}
{"patent_id": "10-2006-0130706", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "[8], [9] 참조). 그래서 본 발명의 OFK에서는 등록된 지식정보에 해당하는 정보를 DB-to-OWL 변환을 통하여 지식정보의 등록 시 <264> 점에 맞추어 새로운 시맨틱 웹 정보를 즉각적으로 반영할 수 있도록 하였으며 변환 결과 생성된 데이터 인스턴 스들은 지식의 일관성을 유지하고 일괄 처리가 가능하도록 \"국가 과학기술 R&D 기반 정보 온톨로지\"에도 삽입/ 추가되도록 하였다. 또한 정보유통의 경우 추론, 온톨로지, 웹 서비스에 관한 연구가 전무하며, 시맨틱 웹 또한 정보유통, 정보공유 <265> 에 관한 연구가 빈약한 실정이다. 대다수의 정보유통 관련 연구들은 정보의 형식과 명세에만 초점을 맞추고 있 어서 신뢰성 있는 정보유통 방안을 제시하지 못하고 있으며, 시맨틱 웹 관련 연구들은 응용 분야와 프레임워크 에 많은 관심을 가지고 있으나, 체계화된 정보의 확산 방안 마련을 보완할 필요가 있는 것으로 분석될 수 있다. 그래서 본 발명의 OFK는 이러한 양자 간의 독립적 연구 방향을 통합하기 위해 시맨틱 웹 기술을 이용하여 정보 <266> 를 체계화하고 연구/개발자들 사이에서 자발적으로 유통될 수 있도록 하기 위한 것이다. OFK의 이러한 시도는 의미를 가진 정보의 확산을 위한 기반을 마련하기 위함이다. 3. OFK(OntoFrame-K)의 구성 <267> 연구/개발자들 간의 자발적인 협업 지원을 위한 정보유통 플랫폼으로서의 OFK는 등록된 지식정보를 검증하고 해 <268> 당 정보의 이력을 추적하며, 온톨로지 기반의 추론 서비스를 통해 연구/개발자들에게 국가 과학기술 R&D 기반정 보를 포함하는 지식 서비스를 제공한다. 이러한 OFK는 지식 처리부와 정보유통 서비스부와 추론 서비스부로 구성할 수 있다. 또한 부가 <269> 적으로 공통 서비스부를 포함할 수 있다. 하나의 OFK는 특정한 연구 주제나 학문 분야를 가지는 하나의 가상 협업 연구 커뮤니티에 해당하며, 중앙 지식 <270> 서버를 통해 다른 커뮤니티와 연결될 수 있다. 이는 시맨틱 웹 서비스와 시맨틱 그리드를 이용하여 다중 커뮤니 티 구성을 통해 수행할 수 있다. - 32 -공개특허 10-2008-0071213도 1은 본 발명의 일 실시예에 의한 시맨틱 웹 기반 연구정보 서비스 시스템의 블록구성도이다. <271> 그래서 지식 처리부는 URI(Universal Resource Identifier) 기반과 DBMS(database management system) 기 <272> 반 하에 지식 처리를 수행하여 지식정보 공유 서비스가 제공될 수 있도록 처리한다. 이러한 지식 처리부는 인력개체 확인부, URI 기반 처리부, 주제/분야 할당부, DBMS 기반 <273> 지식 확장 및 추론부로 구성할 수 있다. 또한 인력개체 확인부는 동명저자의 중의성을 해소하는 것으로, '온톨로지 인스턴스의 sameAs 관리' 기술 <274> 과 '원문으로 부터의 정보 추출 기법을 사용한 동명저자 중의성 해소' 기술을 이용한다. 또한 URI 기반 처리부는 인력개체 확인부의 확인결과를 전달받고, URI 기반 하에서 저자 인용관계 및 <275> 네트워크를 구축하고 URI 기반의 성과정보를 관리하는 것으로, 'URI 기반 저자 인용관계 및 네트워크 구축' 기 술과 'URI 기반 성과 정보 관리' 기술을 이용한다. 또한 주제/분야 할당부는 입력된 원문에 대해 주제와 분야를 할당하는 것으로, '통계기반 문서분류를 통한 <276> 시소러스 확장 방법 및 하이브리드 문서 분류 방법' 기술과 '시소러스의 구축시 주제/분야 할당과 시소러스 미 구축시 태그와 폭소노미를 이용한 주제/분야 할당' 기술을 이용한다. 또한 DMBS 기반 지식 확장 및 추론부는 URI 기반 처리부의 처리결과를 전달받고, 주제/분야 할당부 <277> 에서 할당된 결과를 전달받으며, DBMS에 기반하여 지식을 확장하고 추론하며, 상기 정보유통 서비스부 와 상기 추론 서비스부를 이용하는 사용자의 질의를 처리하는 것으로, 'DBMS 기반 지식확장 및 추론' 기술을 이용한다. 그리고 정보 유통 서비스부는 지식 처리부에서 처리된 결과를 제공받고, 시맨틱 웹에 기반하여 연구 <278> 정보의 등록과 검색 처리 및 통계 서비스를 제공한다. 또한 추론 서비스부는 지식 처리부에서 처리된 결과를 제공받고, 팩트(Fact), 규칙 및 후처리를 통해 <279> 연구개발 정보에서 명시적으로 드러나 있지 않은 간접적인 정보를 발굴하여 제공한다. 도 2는 도 1에서 정보유통 서비스부와 추론 서비스부 및 그 주변블록의 상세블록도이다. <280> 그래서 정보 등록/관리 서비스부는 정보 유통 서비스부에서 보고서, 논문, 특허 중에서 하나 이상을 <281> 포함한 성과 정보 및 비성과 정보를 등록하고 관리한다. 또한 관련성과/참조성과 검색 서비스부는 정보 유통 서비스부에서 관련성과와 참조성과의 검색 서비 <282> 스를 제공한다. 또한 주제/분야 세부정보 열람 서비스부는 정보 유통 서비스부에서 연구개발 정보에서 주제와 분야에 <283> 대한 세부정보를 열람할 수 있도록 한다. 또한 통계 서비스부는 정보 유통 서비스부에서 연구개발 정보에 대한 통계 정보를 제공한다. <284> 그리고 연구자 네트워크 서비스부는 추론 서비스부에서 연구자 네트워크를 제공한다. <285> 또한 연구자 정보 서비스부는 추론 서비스부에서 연구자 정보를 제공한다. <286> 또한 연구 성과 맵 서비스부는 추론 서비스부에서 연구 성과 맵을 제공한다. <287> 또한 성과정보 서비스부는 추론 서비스부에서 성과정보를 제공한다. <288> 또한 기관정보 서비스부는 추론 서비스부에서 기관정보를 제공한다. <289> 또한 통계정보 서비스부는 추론 서비스부에서 통계정보를 제공한다. <290> 또한 통합 연구자 네트워크 서비스부는 추론 서비스부에서 통합 연구자 네트워크 서비스를 제공한다. <291> 또한 연구자 친밀도 서비스부는 추론 서비스부에서 연구자 친밀도 서비스를 제공한다. <292> 그리고 공통 서비스부에서 URI 등록/관리 서비스부는 인력, 기관, 보고서, 논문, 특허, 주제, 분야에 <293> 대한 URI 등록 및 관리를 수행하고, 레퍼렌셜 아이덴티티(Referential Identity) 검색 기능을 제공한다. 또한 주제/분야 분류 서비스부는 시소러스 기반 자동 분류를 수행하여 주제와 분야에 대한 분류 서비스를 <294> 제공한다. - 33 -공개특허 10-2008-0071213이하에서는 본 발명의 상세 동작에 대해 좀 더 상세히 설명한다. <295> 4. 지식 처리 <296> 4-1. 온톨로지 인스턴스의 sameAs 관리 <297> 이 장에서는 온톨로지 개체들의 sameAs 관계를 관리하고, 온톨로지 인스턴스 데이터 내에서 sameAs 관계의 설정 <298> 및 해제와 관련 지식을 수정하고, 사용자 질의를 처리하고 sameAs 후 처리를 수행하여 결과를 제시하는 시맨틱 웹 기술을 활용하는 추론 서비스를 제공할 필요가 있는 전 분야에 걸쳐 안정적이고 효율적인 sameAs 관리 프레 임워크를 제시하는 것을 설명하고 있다. 또한 시맨틱 웹 기술의 발전과 더불어 급격히 관심을 끌고 있는 온톨로지에서의 개체 정합성 관리 측면에서 <299> sameAs 관리 프레임워크를 실현하는 방법을 설명한다. 여기서는 크게 온톨로지 스키마와 인스턴스 데이터를 이 용하여 개체 간 sameAs 관계를 관리하는 방법, sameAs 관계 설정이나 해제로 인해 변경되는 sameAs 그룹의 지식 을 수정하는 방법, 사용자 질의를 처리하고 sameAs 후 처리를 수행하는 방법으로 구성된다. sameAs 관계는, 온톨로지 내에 이미 존재하는 서로 다른 두 개체 A와 B가 실세계에서 동일 개체임이 확인되었을 <300> 때 관계명 \"sameAs\"를 사용하여 \"A sameAs B\"와 같은 트리플 형식으로 표현하여 두 개체 A와 B는 개별적으로 존 재하고 있으나 실제로는 같은 개체이다라는 의미를 나타내기 위해 사용된다. sameAs 관계로 묶인 두 개체 사이 에는 개념적으로 우선 순위가 없으나, 본 발명에서는 sameAs 개체 쌍에 대해 대표 개체와 비대표 개체의 구분을 암묵적으로 표현한다. 즉, A-sameAs-B와 같은 sameAs 트리플의 형태적 표현은 그대로 유지하고 그 해석에 있어 서 subject인 A가 object인 B보다 우선한다거나 object인 B가 subject인 A에 우선한다는 식의 원칙을 세움으로 써 대표와 비대표 개체를 구분하도록 하는 것이다. 본 발명에서는 편의상 sameAs 트리플에서 subject 쪽을 대표 개체로 object 쪽을 비대표 개체로 지정하여 설명하고 있다. sameAs 관계에 포함된 개체들은 sameAs 그룹을 형성하게 되며 관련된 sameAs 관계들이 둘 이상일 때 sameAs 그 <301> 룹에 포함되는 개체 수는 늘어나게 된다(예. A-sameAs-B, B-sameAs-C, D-sameAs-E의 sameAs 관계들은 두 개의 sameAs 그룹들인 [A, B, C]와 [D, E]를 형성한다). 단일 sameAs 관계에서의 대표와 비대표 개체의 구분은 sameAs 그룹에서 sameAs 그룹의 대표 개체와 비대표 개체의 개념으로 확장된다(전술한 예에서 [A, B, C] sameAs 그룹의 대표는 A이며 [D, E] sameAs 그룹의 대표는 D이다). 도 4는 도 3에서 인력개체 확인 수행시 온톨로지 인스턴스의 sameAs 관리 시스템의 블록구성도이고, 도 5는 도 <302> 3에서 인력개체 확인 수행시 온톨로지 인스턴스의 sameAs 관리 방법을 상세히 보인 흐름도이다. 그래서 sameAs 관계 확인부는 온톨로지 내에 이미 설정되어 있는 단일 sameAs 관계 및 복수개의 연관된 sameAs <303> 관계로 인해 만들어지는 sameAs 그룹들을 확인하는 장치이다(도 6 참조). sameAs 관계 설정부와 sameAs 관계 해제부는, URI로 표현된 두 개체에 대해 sameAs 관계를 설정하거나 해제하는 <304> 장치들이다(도 7 참조). sameAs 관계를 설정하거나 해제함에 있어서는 특정한 sameAs 관계의 설정이나 해제가 온톨로지의 일관성을 해치지 않는지를 검사하는 사전작업이 요구된다. 예를 들어, 트리플 형태로 표현된 온톨로 지 인스턴스 데이터가 A-hasBirthPlace-C, B-hasBirthPlace-D, C-differentFrom-D를 포함하고 있을 때, 두 개 체 A와 B사이에 A-sameAs-B와 같은 sameAs 관계를 설정하면 사람마다 출생지(BirthPlace)는 유일하므로 A- sameAs-B로 인해 C-sameAs-D를 추론해 낼 수 있고 이는 기존의 C-differentFrom-D라는 지식과 위배되므로 인스 턴스의 일관성이 유지되지 못하는 결과를 초래하게 될 것이다. sameAs 관계 설정에 대한 사용자의 부적절한 요 구에 대해 sameAs 관계 설정부에서는 적절한 에러 메시지를 출력할 필요가 있는데, 예를 들어 기존에 이미 A- sameAs-B, B-sameAs-C, C-sameAs-D와 같은 sameAs 관계들이 존재하고 있는 상황에서 B와 C를 sameAs로 묶으라 는 sameAs 설정 요구는 부적절할 것이다. sameAs 그룹 지식 설정부와 sameAs 그룹 지식 해제부는, sameAs 관계 설정 및 해제로 인해 변경되어야 할 <305> sameAs 그룹의 지식을 설정하거나 해제하는 장치들이다(도 8 참조). 본 발명에서는 sameAs 그룹의 지식을 sameAs 그룹의 대표 개체가 갖는 속성 값들로 정의한다. 따라서 sameAs 그룹의 대표 개체는 개별 속성 타입별로 해당 sameAs 그룹 내의 모든 소속 개체들의 속성 값들을 대표하는 속성 값을 유지하고 있어야 한다. 예를 들어, 연구자의 Top 3 연구 분야를 그 연구자가 작성한 논문들의 원문으로부터 자동 추출하여 할당해 둔 온톨로지 인 스턴스 데이터가 있다고 할 때, 온톨로지 내에 존재하는 두 명의 동명이인 연구자들 A와 B에 대해 A를 대표로 하는 sameAs 관계 A-sameAs-B를 설정하게 되면, sameAs 그룹 [A, B]에 대한 Top 3 연구 분야는 A와 B의 전체 논문들에 대해 재계산되어야 하는데 이는 실시간 응답속도를 보장하기 어려운 계산량을 요구할 가능성이 클 것 - 34 -공개특허 10-2008-0071213이다. 본 발명에서는 이처럼 sameAs 관계 설정으로 인해 만들어지는 sameAs 그룹의 대표 개체가 갖는 속성 값들 에 대한 계산의 부담을 sameAs 그룹 지식 설정부에서 담당하도록 구성함으로써 sameAs 처리와 관련된 온톨로지 기반 추론 시스템의 실시간 응답 속도를 보장할 수 있도록 하였다. sameAs 후 처리부는, 사용자 질의의 처리 결과에 나타난 개별 개체들 중 sameAs 관계로 엮인 개체가 발견될 경 <306> 우 해당 개체를 그 개체가 소속된 sameAs 그룹의 대표 개체의 URI로 교체하는 장치이다(도 9 참조). 4-2. 원문으로부터의 정보추출기법을 사용한 동명저자 중의성 해소 <307> 도 10은 도 3에서 인력개체 확인 수행시 원문으로부터의 정보추출기법을 사용한 동명저자 중의성 해소 방법을 <308> 보인 흐름도이다. 먼저 이 장에서는 논문의 원문 텍스트로부터 동명 저자 중의성 해소 정보를 자동 추출하고, 동명 저자 중의성 <309> 해소 정보와 논문 서지정보를 활용하여 동명 저자의 중의성을 해소하는 것을 설명한다. 이를 위해 본 발명에서는 대용량 과학 기술 문헌의 탐색 및 검색 수행시 논문 서지정보의 자동 추출과 동명 저 <310> 자 중의성 해소 정보의 자동 추출을 수행하고, 추출된 정보를 이용하여 동명 저자의 중의성을 해소한다. 그리고 논문 서지정보는 '저자', '논문제목', '게재정보(게재지명, 게재년도 등)'로 구성된다. 이 중 저자는 이 <311> 름(예: '홍길동' 혹은 'Jeffrey D. Ullman')으로 표현됨으로 인해, 동일 이름을 가진 서로 다른 저자를 구분해 주지 못한다. 이러한 동명 저자의 중의성을 해소하기 위한 기존 방법들은, 서지정보('공동 저자명', '논문제 목', '게재정보')에 의존해 왔다. 그러나 논문의 원문에는, 동명 저자 중의성 해소에 도움을 주는, 다음과 같은 6가지 부가적인 정보들이 담겨 있다. - 저자의 전자메일 주소 <312> - 논문작성 당시의 저자의 소속기관정보 <313> - 논문을 다루는 분야에 대한 키워드(들) <314> - 논문의 연구를 지원한 연구과제번호 정보 <315> - 논문을 작성한 저자의 저술 스타일 <316> - 논문 원문 텍스트 내의 용어 집합 <317> 이러한 논문 서지정보와 동명 저자 중의성 해소 정보(논문 원문 내의 정보)를 추출하여 동명 저자의 중의성을 <318> 해소한다. 이를 상세히 설명하면 다음과 같다. <319> 1) 논문 서지정보의 자동 추출 <320> 동명이인 구별 문제는 최근 시맨틱 웹(semantic web)과 온톨로지(ontology)에 대한 관심이 높아지면서 이슈로 <321> 부각되고 있다. 논문의 서지정보를 온톨로지로 구축하기 위해서는 이름이 같은 저자들이 동명이인인지 여부를 판단하는 것이 중요하다. 일반 문서에서와는 달리, 서지정보에서는 소속과 이메일(Email)을 유용한 정보로 사용 할 수 있으나 그것만으로는 충분치 못하며, 이를 보완하기 위한 한 방법으로 공저자 관계를 이용하는 것이 유용 함을 살펴본다. 이름은 고유한 개체를 구별하기 위한 것이지만, 실세계에서는 둘 이상의 서로 다른 개체가 동일한 이름을 갖는 <322> 경우를 흔히 접할 수 있다. 인명이 그 대표적인 예라고 할 수 있다. 예를 들어, 싸이월드( )의 회원찾기에서 '김영희'라는 1980년생 여자를 찾으면 무려 213명이나 나타난다. 이들은 모두 이름은 같지만 서로 다른 고유한 개체를 지칭하는 동명이인인 셈이다. 동명이인 구별 문제는 최근 시맨틱 웹과 온톨로지에 대한 관심이 높아지면서 이슈로 부각되고 있다. 시맨틱 웹 <323> 에서는 모든 개체는 식별자(Unique Resource Identifier, URI)로 구별되어야 하기 때문이다. 즉, 213명의 '김 영희'를 시맨틱 웹에서 다루기 위해서는 하나하나를 구별할 수 있어야 한다. 그래서 위의 '김영희'의 예에서, 실세계에서는 주민등록번호와 같은 식별자로 구분할 수 있지만, 보통의 문서에 <324> 서는 그러한 식별자 없이 단순히 이름만으로 언급되므로 서로 다른 두 문서에 나타나는 '김영희'라는 이름이 동 일한 사람을 가리키는지를 판단하기 위해서는 온전히 문맥정보에 의지해야 하므로 쉽지 않은 작업이다. 이에 비 해 논문의 서지정보에 나타나는 저자 이름에 대한 동명이인 구별은 상대적으로 쉬운 작업이라 할 수 있다. 논문 - 35 -공개특허 10-2008-0071213의 서지정보는 메타정보를 가리키는 것으로, 제목을 비롯하여 저자명, 저자의 소속, 이메일(Email), 출처, 연도 등을 포함한다. 여기서, 소속과 Email 등은 같은 이름의 저자를 식별하는데 필요한 양질의 문맥정보로서 잘 정 리되어 제공될 수 있기 때문이다. 논문을 비롯하여 보고서, 특허 등의 연구 성과물과 인력에 대한 정보는 최근 국가과학기술정보유통 서비스를 위 <325> 한 온톨로지 구축의 대상으로 인식되고 있다. 온톨로지로 구축된 인력 및 연구 성과물 정보는 개별 연구자나 기관, 지역의 연구 동향 파악과 공저자관계를 이 <326> 용한 연구자 네트워크 파악, 연구 분야별 전문가 추천 등의 고급 응용 서비스에 다양하게 활용될 수 있다. 연구 성과물의 서지정보는 바로 이러한 온톨로지를 구축하기 위한 첫 단계라 할 수 있다. 따라서 서지정보의 저자 이 름에 대한 동명이인 여부를 판단하는 작업은 반드시 필요하며 동시에 높은 정확도를 요구한다. 앞서 언급하였듯이, 서지정보에서의 동명이인 구별은 보통의 문서의 경우에 비해 상대적으로 쉬운 것은 사실이 <327> 다. 이는 서지정보에 저자의 소속과 Email을 포함하기 때문이다. 그러나 이러한 정보가 저자의 동명이인 문제를 완전히 해결하지는 못한다. 따라서 이를 보완하기 위한 한 방법으로 본 발명에서는 공저자 관계의 효용성을 살 펴보고자 한다. 논문의 서지정보는 제목, 저자명, 소속, Email, 출처, 연도 등을 포함하는 메타데이터를 말한다. 이 서지정보를 <328> 온톨로지로 구축하기 위해서는 서지정보에 포함된 각 개체를 유일하게 식별할 수 있어야 한다. 여기서 가장 문 제가 되는 것이 저자명에 대한 동명이인 구별이다. 즉, 서로 다른 서지정보에 같은 이름의 저자가 나타날 때, 그것이 동일인을 가리키는지 여부를 판단하는 것이 중요하다. 일반 문서에서와는 달리, 논문의 서지정보에서는 각 저자의 소속과 Email에 대한 정보를 담고 있어서, 비교적 <329> 구분이 쉬울 수 있다. 그러나 실제에서는 이 정보만으로 온전히 구분하기 어려운 경우가 흔히 발생한다. 첫 번째로 논문에 소속이나 Email 정보가 기재되지 않은 경우가 그러하다. 양식이 엄격한 논문지와는 달리, 학 <330> 술대회의 논문인 경우, 비록 지정된 양식에는 소속과 Email을 기재하도록 되어 있다고 하더라도 저자가 이를 따 르지 않는 경우가 종종 있다. 저자가 다수인 경우, 각 저자별로 소속과 Email을 명확히 구분하기 어려운 경우도 이에 해당한다. 두 번째로 동일 저자의 소속과 Email 표기가 일관되지 않은 경우이다. 소속을 표기하는데 있어서, 기관만을 표 <331> 기하거나 기관과 부서를 함께 표기한 경우, 부서를 'XYZ학과' 혹은 'XYZ학부', 'XYZ연구실'과 같이 다르게 표현 한 경우를 흔히 볼 수 있다. 덩치가 큰 기관에서는 한 기관 내에 동명이인이 흔히 있을 수 있다는 점을 감안할 때, 저자의 기관명만이 일치한다고 해서 동일인으로 판단하기에는 위험요소가 있다. 예를 들어, 연세대학교 컴 퓨터과학과의 '조성배'와 연세대학교 대학원 인지과학협동과정의 '조성배'가 동일인이라고 단정할 수는 없다. Email의 경우도 마찬가지로, 한 사람이 둘 이상의 Email주소를 사용하는 경우를 흔히 볼 수 있다. 기관에서 제 공하는 Email과 부서 혹은 연구실에서 제공하는 Email, 웹 포털사이트에서 제공하는 Email 등, 복수 개의 Email 을 혼용할 때, 그 Email이 가리키는 사람이 동일인임을 알기 어렵다. 예를 들어, ' ', ' ', ' ', ' ' 와 같 이 다른 Email을 갖는 여러 '조성배'가 동일인이라고 단정하기는 어렵다. 세 번째로 시간에 따라 소속과 Email이 바뀌는 경우이다. 저자가 소속을 옮기는 경우는 흔히 발생하며, 이 때, <332> Email도 함께 바뀐다. 기관 내에서 부서를 옮기거나 부서명 자체가 변경되는 경우도 이에 해당한다. 이 경우, 논문의 발행연도를 참조하는 것이 도움이 될 수 있다. 이와 같이, 소속과 Email은 동명이인을 구별하는데 필요한 중요한 정보를 제공하지만, 그것만으로는 부족한 경 <333> 우가 흔히 발생한다. 이런 경우에, 추가적으로 이용할 수 있는 정보가 바로 공저자 관계이다. 2) 공저자 관계 이용 <334> 소속이나 Email과 마찬가지로, 공저자 관계는 동명이인을 구별하는데 중요한 정보로 활용될 수 있다. 논문의 공 <335> 동 저자들은 서로 간에 학술적으로 밀접한 관계를 맺고 있으며, 공저자로 들어간 논문의 수가 많을수록 그 관계 의 정도는 더 밀접하다고 할 수 있다. 따라서 두 논문에 대해, 각각 두 명씩의 저자의 이름이 서로 같을 때 그 들이 동일인일 가능성은, 한 명씩의 저자 이름이 서로 같을 때 그들이 동일인일 가능성에 비해 훨씬 높다. 또한 공저자 관계가 더 많이 공유될수록 동일인일 가능성은 더욱 높아진다. 공저자 사이의 학술적 관계는 어느 정도 지속되는 것이 보통이다. 심지어, 저자가 소속을 바꾼 경우 예를 들면, <336> 학위 과정을 마치고 같은 분야에서 학술활동을 계속하는 경우에도 학술적 관계를 계속 유지하는 것을 흔히 볼 수 있다. 이 말은 저자의 소속과 Email이 같지 않더라도 공저자 관계를 통해 그 저자가 동일인임을 알아내는 것 - 36 -공개특허 10-2008-0071213이 가능하다는 것을 뜻한다. 이미 동일인으로 판명되었으면 각각의 공저자 집합을 하나로 합침으로써 비교할 수 있는 공저자 집합을 늘려 나 <337> 갈 수 있다. 3) 동명 저자 중의성 해소 정보(논문 원문 내의 정보)의 자동 추출 <338> 대용량 과학 기술 문헌의 탐색 및 검색에 있어서 저자, 저자 소속 기관, 게재지 등에 대해 고유 식별자에 기반 <339> 한 표현의 필요성이 증가하고 있다. 특히, 과학 기술 문헌의 저자가 단순히 이름으로 표현될 경우, 동일명을 가 진 서로 다른 저자들에 대한 구분은 사용자의 검색 부담을 가중시키게 된다. 이러한 동명이인의 문제를 해결하 기 위한 기존의 접근법들은 공저자 정보, 논문 제목 등의 서지정보에 의존하는 공통점을 지닌다. 그러나 기존의 방법들은 공저자가 없거나 논문 제목 간의 공통 어휘가 발견되지 않을 경우 어려움을 겪게 된다. 이 장에서는 동명저자 문제 해소를 위한 기존의 접근법을 보완하기 위해, 동명저자들의 논문 원문의 내용에 기반한 문서 군 집화 방법을 사용한다. 웹의 보편화는 기존에 종이의 형태로 접근했던 논문 정보(예: 저자, 제목, 출처 등 서지정보와 원문 그리고 인 <340> 용정보 등)를 전자화된 형태로 이용할 수 있도록 변화시켰다. 이후, 전자화된 논문 정보의 양은 점점 증가하고 있으며, 이에 따라 다양한 논문 검색 사이트들이 생겨났다. 그러나 현재의 문자기반의 논문 정보 표현 방식에 있어서는, 연구자나 발명자가 원하는 논문 정보를 찾는 데 많은 시간과 노력을 요구하게 된다. 예를 들어, 논문 정보 중 저자는 이름으로 표현되는데, 그 기술 방식이 영어의 경우 통일되어 있지 않으며(예: John R. Smith vs. Jonathan Richard Smith), 동명 저자의 중의성(예: Harvard Univ.의 John R. Smith와 MIT의 John R. Smith)이 해소되어 있지 않음으로 인해, 저자명으로 논문을 검색할 경우 재현율과 정확률을 떨어뜨리게 된다. 또한, 이러한 저자 표현의 문제는 대용량 논문들로부터 구축된 저자 인용망의 질적 수준을 떨어뜨리게 된다. 동명 저자 중의성 해소를 위한 기존 방법들은 중의성 해소의 자질 측면에서, 개별 동명 저자가 작성한 논문의 <341> 공동저자(들), 제목, 게재지명 등을 사용하고 있다. 이러한 자질을 사용하는 기본 가정은, \"한 연구자는 일정 기간 동안, 특정한 몇 명의 연구자와 공동 연구를 수행하며, 연구 분야가 크게 바뀌지 않으며, 제한된 몇 개의 학술대회나 학술지에 논문을 투고하는 경향이 있다\"는 것이다. 그러나 동명 저자의 논문집합에서 논문간 공유되는 공저자가 없을 수 있으며, 한 저자의 연구 분야를 기술하는 <342> 데 있어서 논문 제목만으로는 부족할 수 있으며, 동일 게재지에 투고하는 동명 연구자는 적지 않을 수 있다. 본 발명에서는 서지 정보로부터 획득되는, 동명 저자의 자질 타입의 한계를 극복하기 위해 논문의 원문 텍스트를 자질로 활용하고자 한다. 외국인 저자에 대한 동명이인 해소에 있어서는, 동일 저자명 표기의 다양한 변이형들로 인해, 동일개체/복수표 <343> 현과 복수개체/동일표현의 두 문제가 복합적으로 발생한다. 한글 저자명의 경우는 이름 표기에 일관성이 있어 동일개체/복수표현의 문제가 없는 듯 보이나, \"홍길동\"과 \"Gil-Dong Hong\" 혹은 \"Hong, G.D.\"을 매치해야 하는 상황을 고려하면 유사표현의 그룹화 문제를 무시할 수 없을 것이다. 따라서 동일 저자명 해소 문제를 다루기 위 해서는 개체 표현의 내적 자질과 외적 자질을 동시에 고려하는 것이 일반적이다. 그러나 본 발명에서는 동명 저 자의 중의성 해소 문제를 한글로 제한하여 다룰 것이므로, 내적 자질은 사용되지 않으며, 외적 자질 중에서도 새롭게 제안하는 원문 텍스트 자질의 효용성만을 평가하고자 한다. 동명 저자 해소를 위한 기존 연구는 크게 군집(clustering) 기반 방식과 분류(classification) 기반 접근법으로 <344> 나눌 수 있다. 군집화 방식은 학습데이터가 필요 없지만, 분류 기반 방법은 분류 모델을 만들기 위해 학습데이 터가 요구된다는 단점이 있다. 또한, 원론적으로 분류 기반 방식은 분류 대상이 되는 목표 클래스가 미리 정의 되어 있을 때 적용된다. 따라서 동명 저자 해소의 경우처럼 동일 저자명을 갖는 개체들이 실제 몇 명의 사람(클 래스)에 대응될 지 미리 정할 수 없는 상황에서 분류적 접근법을 적용하는 것은 무리가 있다 하겠다. 본 발명에 서는, 동명 저자 해소 문제에 보다 바람직한 접근법인 군집 기반 방식을 사용한다. 이 장에서는 논문의 저자 표현에서 발생하는 동명 저자의 중의성 해소 문제를 다루기 위해, 중의성 해소를 위한 <345> 자질 타입으로 개별 동명 저자의 논문 원문 텍스트를 사용할 것을 제안하였다. 그래서 원문 텍스트 자질이 다른 자질들과 결합되었을 때, 동명 저자의 중의성을 해소하는 데 도움이 된다. 또한 동명 저자의 논문 원문 텍스트 를 이용하여 논문 원문 텍스트 내의 용어 집합을 활용할 수 있다. 또한 이외에도 저자의 전자메일 주소, 논문작성 당시의 저자의 소속기관정보, 논문을 다루는 분야에 대한 키워 <346> 드(들), 논문의 연구를 지원한 연구과제번호 정보, 논문을 작성한 저자의 저술 스타일 등을 활용하여 동명 저자 - 37 -공개특허 10-2008-0071213의 중의성 해소 정보를 자동 추출할 수 있게 된다. 4-3. URI 기반 저자 인용 관계 및 네트워크 구축 <347> 도 11은 도 3에서 URI 기반 처리 수행시 URI 기반 네트워크 구축의 예를 보인 흐름도이다. <348> 그래서 크게 인용정보추출, 문헌 기반 인용 관계 구축, 저자기반 인용관계 구축, 그리고 인용 네트워크 구축의 <349> 네 단계로 나누어진다. 첫 단계인 인용 정보 추출에 앞서 먼저 전처리로 원문을 수집하고 텍스트 링크 소프트웨어를 이용하여 원문을 <350> 텍스트로 변환한다. 다음으로 정규식을 이용하여 참고문헌으로부터 인용 정보를 추출한다. 두 번째 단계인 문헌 기반 인용관계 구축은 앞 단계에서 추출된 참고문헌 부분에 기술된 문헌의 제목을 이용하여 개별문헌에 문헌(객 체) URI를 할당한다. 세 번째 단계로 문헌기반 인용관계를 이용하여 저자기반 인용관계를 구축한다. 마지막 단 계로 저자 중심 인용 네트워크를 구축한다. 여기에서 저자기반 인용관계는 기존 방식에서와 같은 제 1 저자를 기준으로 한 인용관계가 아니라 전체 저자들 간의 인용 관계로 확장된 것이다. 또한 도 11에서는 URI 서버에서 문헌 URI와 인력 URI가 관리되고 있는 것을 보여주고 있는데, 문헌 URI 저장소 <351> 에서는 개별 문헌에 고유한 식별자를 자동 부여하여 해당 문헌의 메타 정보를 관리하며, 인력 URI 저장소에서는 인력에 대해 고유한 식별자를 반자동 방법으로 부여하여 해당 인력의 메타 정보를 관리하게 된다. 1) 인용 정보 추출 <352> 인용 정보 추출의 자동화로 얻을 수 있는 가장 큰 장점은 지속적으로 변화하며 생성되는 인용 정보를 시스템적 <353> 으로 바로 반영할 수 있다는 점이다. 이로 인해 인용정보를 이용한 다양한 특정 지역 및 특정 분야의 지식의 구 조와 흐름의 파악이 용이하게 되며, 이용자 연구, 과학사 연구, 특정분야 과학자의 커뮤니케이션 유형 규명, 과 학적 영향 평가 및 생산성 평가의 측정 등의 연구에 기여할 수 있는 바가 크다고 할 수 있다. 그러나 자동적인 인용 정보 추출의 어려운 점은 저자들의 참고 문헌 기술 방식이 일정하지 않고 다양하다는 점 <354> 이다. 다시 말하면, 참고문헌은 개략적으로 \"저자, 제목, 출처\" 등의 순서로 기술되지만, 참고문헌을 기술하는 방식은 원문에 따라, 저자에 따라, 그리고 게재지의 요구사항에 따라 다양한 형태를 띠고 있는 것이 현실이다. 도 12는 도 11에서 인용정보 추출 단계의 상세흐름도이다. <355> 그래서 도 12에서는 인용 정보 추출의 세 단계를 보여주고 있다. 인용 정보 추출은 참고문헌 영역 확인, 인용 <356> 정보 추출, 인용 정보 메타데이터 추출의 세 단계로 구성되어 있다. 도 12에서는 참고 문헌 영역 확인과 인용 정보 추출이 끝나고, 인용 정보 메타데이터를 추출하는 과정을 보여주고 있다. 도 12에서 문헌에 할당된 객체 URI 식별자는 \"KISTI.PCD.0004407\"이며, 저자 URI는 \"0000003854\"이다. 원문으로부터 인용 정보 추출의 첫 번째 단계는 참고문헌 영역을 결정하는 것이다. 원문의 참고문헌 영역은 동 <357> 일한 학술대회일지라도 저자에 따라 \"Reference\", \"References\", \"참 고 문 헌\", \"참고문헌\" 등의 다양한 변형 이 가능하기 때문에 이에 대해 적절한 정규식을 지정하는 것이 필요하다. 그리고 참고문헌 영역을 지정하는 또 다른 이유는 문헌의 텍스트 변환 후에 참고문헌 영역은 문헌의 끝부분에 항상 위치하고 있는 것이 아니기 때문 이다. 도 13은 도 12에서 인용정보 메타데이터 추출 단계의 상세흐름도이다. <358> 그래서 인용 정보의 메타데이터는 정규화된 필드로 구성되는, 본 발명에서는 인용 문헌의 서지정보로부터 학회 <359> 필드, 학술대회 필드, 권 필드, 호 필드, 연도 필드에 해당하는 정보를 추출한다. 인용 정보 메타데이터 추출은 도 13에서와 같은 단계로 진행된다. 첫 번째 단계인 공백제거 및 오류제거는 추출되는 한글에 대한 처리를 용이하게 하기 위한 전처리 단계에 해당 <360> 한다. 오류에 해당하는 문자열은 원문을 텍스트 필터를 사용하여 변환할 때 생성되는 특정한 패턴을 가지는 문 자열이기 때문에 쉽게 제거가 가능하다. 두 번째 단계는 문자열을 구분 기호로 분리하여 토큰을 생성하는 단계이다. 이는 문자열을 특정한 단위로 처리 <361> 하기 위함이며, 구분 기호로는 ',', '.' 등이 사용된다. 세 번째 단계인 정보 추출에서는 이전 단계에서 분리된 토큰들이 추출 조건에 부합되면 해당 정보를 추출하여 <362> 메타데이터의 필드를 채우도록 진행된다. - 38 -공개특허 10-2008-0071213도 14는 도 13에서 정보추출시 학술대회 추출 필드 및 추출 정규식의 예를 보인 표이다. <363> 네 번째 단계인 정규화는 메타데이터의 필드를 하나의 정규화된 데이터로 변환하는 단계이다. <364> 도 15는 도 13에서 정규화시 학회명 변환 테이블의 예를 보인 표이다. <365> 이러한 도 15에서 대표 학회명은 한국과학기술정보연구원의 학회마을의 학회명칭을 기준으로 생성할 수 있다. <366> 보통 전거라 부르는 도 15의 변환테이블은 지속적으로 구축되어야 할 것이다. 이외에도 '춘계학술대회'와 '봄학 술대회' 등 계절에 관련한 학술대회 명칭이 함께 출현하기 때문에 학술대회명에 대한 정규화의 과정도 필요하다. 이외에 권(Volume)과 호(Issue)의 정보는 저자의 기술이 일관되게 기술되지 않는 경유가 많기 때문에 숫자로 변환하여 처리한다(예, Vol.32, V.32, 32권 등). 학술대회 연도정보도 일관되게 기술되지 않는 경우가 많으므로 정규화의 과정이 필요하다(예, 1999, 99, '99 등). 논문지에 대한 메타데이터의 정규화 과정도 위와 유사한 과정을 거쳐 생성된다. 논문지의 메타데이터 정규화 필 <367> 드는 학회명, 논문지명, 권, 호, 연도 필드들로 구성된다. 논문지 메타데이터 생성 과정에서도 학술대회 메타데 이터 생성 과정에서처럼 논문지명에 대한 정규화의 과정이 필요하다. 도 16은 도 13에서 정규화시 논문지명 변환 테이블의 예를 보인 표로서, 대표 논문지명으로 변환되는 다양한 논 <368> 문지명의 예를 보이고 있다. 2) URI 기반 논문(객체) 인용 관계 구축 <369> 기존의 문헌의 인용 간의 관계를 단순히 문자열 기반으로 유사도를 이용하여 구축하는 방법으로는 문헌 자체의 <370> 접근성을 보장해내지 못한다. 따라서 본 발명에서는 이를 개별 문헌에 고유한 URI를 부여함으로써 해결한다. 또 한 문헌에 부여되는 객체 URI는 저자들의 인용 관계 생성을 위한 고유한 키 값으로 유용하게 사용될 수 있다. URI 기반 인용 관계를 설명하기 위해서 문헌 URI와 인력 URI의 식별체계를 설명한다. 문헌 URI 식별체계는 호환 <371> 성을 고려해 정의하며, 생성 형식은 \"등록관리기관코드, 자료유형코드, 일련번호\"의 형태를 갖도록 할 수 있다. \"등록관리기관코드\"는 객체의 종류에 따라 학술지, 보고서, 개인공유자료, 기반정보 등으로 구분하며, \"자료유 형코드\"는 학술지, 학술대회, 학위논문, 특허, 연구보고서, 개인공유자료 등으로 구분한다. 마지막으로 \"일련번 호\"는 7자리의 숫자를 사용할 수 있다. 인력 URI 식별체계는 국가과학기술인력 종합정보시스템에서 사용하는 10자리 인력 ID 값에 기반하여 설계할 수 <372> 있다. 도 17은 도 11에서 문헌기반 인용관계 구축 단계의 상세흐름도이다. <373> 이러한 도 17은 문헌 중심의 인용 네트워크를 구축하기 위한 세 단계를 보여준다. 첫 번째 단계는 인용 정보 중 <374> 에서 제목을 추출한다. 다음 단계는 문헌제목을 이용하여 문헌 간에 인용 네트워크를 구축하는 것이다. 마지막 단계는 문헌에 해당하는 객체 URI 저장소 내에 저장되어 있는 객체 URI를 이용하여 문헌 중심으로 인용 관계를 구축하는 것이다. 참고문헌 제목추출 단계에서 문헌 제목의 추출은 보통 이중인용부호(\")를 이용하여 그 경계를 인식할 수 <375> 있지만, 원문 출전에 따라 이중인용부호(\")와 단일인용부호(') 등 여러 구분자들이 사용될 수 있으므로, 다양한 형태적 특징을 반영하는 제목 추출 과정이 필요하다. 또한 \"문헌제목\"과 같은 형태가 관습적으로 많이 사용되기 때문에 이에 대한 처리도 필요하다. 다음으로 추출된 제목들을 이용하여 문헌 중심의 인용 네트워크를 구축한다. 인용 네트워크를 구축하기 위해 추 <376> 출된 문헌 제목들을 인용과 피인용의 쌍으로 단순화한다. 마지막으로 인용과 피인용의 관계를 URI 서버를 이용하여 객체 URI로 변환한다. 도 17의 하단에서 객체 URI 간 <377> 의 인용관계를 확인할 수 있다. 3) URI 기반 저자(인력) 인용 관계 구축 <378> 도 18은 도 11에서 저자기반 인용관계 구축 단계의 상세흐름도이다. <379> 이러한 도 18에서는 문헌 인용 네트워크를 확장한 저자(인력) URI 기반 인용관계 구축의 주요 단계를 보여준다. <380> 첫 번째 단계는 인용-피인용으로 연결된 문헌 URI 쌍으로부터 하나의 문헌 URI를 획득한다. 다음으로 개별 문헌 URI의 저자에 해당하는 인력 URI를 URI 서버로부터 획득하고, 마지막으로 문헌 URI 쌍으로 묶인 두 문헌의 저자 - 39 -공개특허 10-2008-0071213URI 집합들 간에 인용-피인용 관계를 생성한다. 4) 인용 네트워크 구축 <381> 인용 네트워크는 지식의 구조와 흐름을 파악하는 방법으로 인용과 피인용의 관계를 이용하여 정보의 흐름을 파 <382> 악하고 이를 이용해서 특정 지역 및 특정 분야의 지식의 구조와 흐름을 파악하고자 하는 연구에 사용된다. 특히, 저자 중심 인용 네트워크 구축은 저자간의 인용을 통한 성과에 대한 질적인 판단의 기준을 제공해 주기도 하지만, 부가적으로 저자 간의 사회적인 연결 네트워크를 보여주는 지표로서 사용될 수 있다. 도 19는 도 11에서 인용 네트워크 구축 단계에 의한 인용 네트워크 구축의 예를 보인 개념도이다. <383> 그래서 도 19에서는 저자 중심의 인용 네트워크가 인력 URI를 이용하여 저자의 고유성을 확보하게 되면, 인용- <384> 피인용의 관점에서 동명이인으로 인한 애매성이 해소되어 정확한 저자 중심 인용 네트워크가 구축되는 예를 보 여주고 있다. 도 20은 도 11에 의해 URI 기반 처리 수행시 저자 중심 인용네트워크 그룹 및 인용네트워크 구현의 예를 보인 <385> 개념도이다. 이처럼 이 장에서는 지속적으로 추가되고 갱신되는 인용 정보를 일관성 있게 반영하고 정확한 문헌의 접근성을 <386> 보장하기 위해, 시맨틱 웹 기술의 하나인 URI를 문헌(객체 URI)과 저자(인력 URI)에 적용하여 저자 중심 인용 관계를 네트워크를 구축한 것을 설명하였다. 4-4. URI 기반 성과 정보 관리 <387> 이 장에서는 시맨틱 웹 환경에 맞도록 URI 기반으로 성과 정보를 등록하고 관리하는 것을 설명한다. <388> 또한 시맨틱 웹 기반 기술인 URI(Uniform Resource Identifier)와 RDF(Resource Description Framework <389> Triples)를 이용하여 성과 정보를 포함한 다양한 정보를 등록하고 관리하는 방법을 설명한다. 또한 이 장은 성과 정보 등록 방법, 관리자 승인 방법, 성과 정보 초기화 방법, 성과 정보 삭제 방법, 성과 정 <390> 보 수정 방법을 포함한 성과 정보 등록 및 관리 방법으로 구성된다. 그래서 온톨로지의 표현 형태인 RDF 트리플이나 RDF XML을 이용하여 성과 정보를 저장/관리하고, URI를 이용하 <391> 여 성과 객체를 변별할 수 있도록 함으로써 정확한 성과 정보 활용이 가능하도록 한다. 성과 정보 저장을 위해서 RDF 트리플의 경우 DBMS를, RDF XML의 경우 XML 기반 저장 장치(XML 문서 파싱 기능을 <392> 포함하고 있는 장치)를 사용할 수 있다. 이에 따라 온톨로지 스키마에 따라 성과 정보를 체계화(Formalization) 할 수 있고, 추론 규칙에 의한 지속적인 <393> 정보 확장이 가능하고, 등록 인터페이스 및 각 단계 또는 모듈에서의 검증 과정을 통해 성과 정보의 정합성 검 사가 용이하다는 특징을 가진다. 또한 RDF 트리플 또는 RDF XML로 표현 가능한 모든 지식들을 다룰 수 있도록 고려함으로써 시맨틱 웹 응용 서비 <394> 스에 필수적으로 활용될 것으로 기대한다. 도 21은 도 3에서 URI 기반 처리 수행시 URI 기반 성과 정보 관리 시스템의 블록구성도이다. <395> 그래서 성과 정보 관리부는 성과 정보를 등록하고 관리하며, URI 관리부는 성과 정보 관리부와 연결되고 URI 서 <396> 버를 통해 성과 정보에 URI를 부여하고 관리하고, 지식 확장부는 성과 정보 관리부 및 URI 관리부와 연결되고, 시맨틱 웹 기반 추론 서비스를 위해 지식을 확장한다. 또한 성과 정보 관리부는, 성과 정보 등록 인터페이스를 통해 등록자가 성과 정보와 해당 성과물을 등록하도록 <397> 하는 성과 정보 등록부; 성과 정보 등록부를 통해 등록자가 입력한 정보가 올바른지 확인하는 성과 정보 확인부; 성과 정보 확인부에서 확인된 성과 정보에 대해 성과 가중치를 부여하거나, 성과 정보 또는 성과물로부 터 통제된 주제 또는 분야 등을 추출하여 할당하는 부가 정보 추가부; 및 성과 정보 관리부에서 등록된 성과 정 보에 대한 관리자 검증 과정이 수행되도록 하는 관리자 승인부;를 포함하여 구성할 수 있다. 성과 정보 등록부에서 성과 정보는 성과 유형, 성과 출처, 유발 과제, 창작자, 창작자 정보, 제목, 공동 <398> 창작자, 관련 URL 등이 포함된다. 성과 정보 등록부에서 성과물은 문서 필터링이 가능한 문서 또는 스캐닝된 이미지 형식이다. <399> - 40 -공개특허 10-2008-0071213관리자 승인부는 등록된 성과 정보가 올바른 정보인지, 실재하는 정보인지 확인하여 성과 정보에 대한 신뢰를 <400> 부여할 수 있도록 하고, 관리자는 해당 성과 정보를 승인하거나 거절할 수 있도록 하며, 거절된 성과 정보는 재 작성 후 등록 또는 폐기 과정을 거치도록 한다. URI 관리부는 성과 정보 관리부에서 관리하는 성과 정보를 등록 및 관리하고, 성과 정보에 URI를 부여하고, 성 <401> 과 정보로부터 RDF 트리플이나 RDF XML을 추출하여 정보를 지식화시켜 지식 확장에 사용할 수 있도록 한다. 지식 확장부는, 확장된 지식이 SPARQL(SPARQL Protocol And RDF Query Language), RDQL(RDF Data Query <402> Language)을 포함한 시맨틱 웹 질의 언어를 이용하여 추론 결과를 얻는 데 참조되도록 한다. 도 22는 도 3에서 URI 기반 처리 수행시 URI 기반 성과 정보 관리 방법을 보인 흐름도로서, 성과 정보 관리 시 <403> 스템과 URI 서버와 지식 확장 모듈 간의 정보 교환을 통해서 성과 정보를 등록하고 관리하는 전체 시스템 내에 서의 각 모듈 별 연계 여부를 보여준다. 그래서 성과를 등록하고 관리하는 방법(ST101 ~ ST103, ST105), URI 서버를 통해 성과 정보에 URI를 부여하고 <404> 관리하는 방법(ST104), 시맨틱 웹 기반 추론 서비스를 위해 지식을 확장하는 방법(ST106)으로 구성된다. 성과 정보 등록(ST101)은 성과 정보 등록 인터페이스를 통해 등록자가 성과 정보(메타데이터)와 해당 성과물(원 <405> 본 등)을 등록하는 과정이다. 성과 정보(메타데이터)는 성과 유형(예, 논문, 보고서, 특허 등), 성과 출처(예, 학술대회, 학술지 등), 유발 과제, 창작자(예, 논문 저자, 연구 참여자 등), 창작자 정보(예, 창작자 소속 기관, 소속 부서 등), 제목, 공동 창작자, 관련 URL 등을 포함한다. 성과물은 문서 필터링(서식 문서로부터 텍스트를 추출할 수 있도록 하는 방법)이 가능한 문서일 수도 있고, 스 <406> 캐닝된 이미지 형식일 수도 있다. 후자의 경우에는 문자 인식기를 사용하여 텍스트를 추출할 수 있다. 성과 정보 확인(ST102)은 등록자가 입력한 정보가 올바른지 확인하는 과정이다. 등록자가 입력한 정보를 다시 <407> 확인시켜주어 등록 오류를 방지하도록 한다. 부가 정보 추가(ST103)는 성과 정보에 대해 성과 가중치를 부여하거나, 성과 정보(메타데이터) 또는 성과물로부 <408> 터 통제된 주제 또는 분야 등을 추출하여 할당하거나 하는 과정이다. 이 과정을 통해 등록자가 입력하지 않은 새로운 정보들을 획득할 수 있다. URI 관리(ST104)는 해당 성과 정보(메타데이터)를 등록 및 관리하고, 성과 정보에 URI를 부여하고, 성과 정보로 <409> 부터 RDF 트리플이나 RDF XML을 추출하여 정보를 지식화시켜 지식 확장에 사용할 수 있도록 하는 과정을 포함한 다. 여기서 지식화이라 함은 정보에 대해 온톨로지를 투영하여 객체 관계 속성(Object Property)을 포함시켜 인 스턴스화(Instantiation)하는 것으로 정의할 수 있다. URI 관리는 별도의 URI 서버를 이용하여 이루어질 수 있는데, 이 경우에는 등록, 검색, 관리 등을 위한 사용자 <410> 인터페이스를 제공한다. 관리자 승인(ST105)은 등록된 성과 정보에 대한 관리자 검증 과정을 의미한다. 등록된 성과 정보가 올바른 정보 <411> 인지, 실재하는 정보인지 확인을 함으로써 성과 정보에 대한 신뢰를 부여할 수 있다. 관리자는 해당 성과 정보 를 승인하거나 거절할 수 있으며, 거절된 성과 정보는 재작성 후 등록 또는 폐기 과정을 거치게 된다. 지식 확장(ST106)은 시맨틱 웹 기반 추론 서비스에서 보다 용이하게 지식을 이용할 수 있도록 추가적인 관계들 <412> 을 발견해 내는 과정으로 추론 규칙을 적용하여 URI 관리에서 생성된 지식을 확장한다. 추후 확장된 지식은 SPARQL(SPARQL Protocol And RDF Query Language), RDQL(RDF Data Query Language) 등 시맨틱 웹 질의 언어를 이용하여 추론 결과를 얻는 데 참조된다. 도 23은 도 22에서 성과 정보 등록을 상세히 보인 상세흐름도로서, 성과 정보 객체 URI를 할당하고 DB-트리플 <413> /XML 변환하는 등의 방법을 통해 성과 정보를 등록하는 단계를 보여준다. 이러한 도 23은 성과를 등록하는 단계(ST101 ~ ST104)를 보여준다. <414> 그래서 부가 정보가 추가된 성과 정보(메타데이터)는 성과 정보 자체에 대한 객체 URI를 할당받아야 다른 성과 <415> 정보(메타데이터)와 구별되는 완전한 성과 정보가 되므로, 이를 할당받기 위해 URI 서버에 성과 정보(메타데이 터)를 전달한다(ST111). URI 서버는 전달받은 성과 정보(메타데이터)에 성과 정보 객체 URI를 부여한다(ST112). 이때 대상 성과 정보(메 <416> 타데이터)가 기존에 성과 정보 객체 URI를 할당받은 성과 정보들과 중복되는 지를 검사하여, 중복된 성과물인 - 41 -공개특허 10-2008-0071213경우에는 성과 정보 객체 URI 부여를 하지 않는다. DB-트리플/XML 변환(ST113)은 온톨로지를 참조하여 입력된 성과 정보(메타데이터)를 RDF 트리플 또는 RDF XML로 <417> 변환한다. 이 변환 과정을 지식화라고 하며, 변환 결과를 지식이라 일컫는다. URI 서버는 DB-트리플/XML 변환이 정상적으로 완료되는 경우에 대상 성과 정보(메타데이터)의 성과 정보 객체 <418> URI와 변환 결과를 성과 정보 등록 인터페이스로 돌려준다(ST114). DB-트리플/XML 변환 완료된 성과 정보(메타데이터)는 성과 정보 관리 시스템에 다시 한번 저장된다(ST115). <419> 이 성과 정보(메타데이터)는 성과 정보 객체 URI가 포함되어 있으며 URI 서버와 중복되게 저장하는 이유는 성과 <420> 정보 관리 시스템에서 성과 정보 검색 서비스 등을 별도로 제공하기 위함이다. URI 서버에 성과 정보(메타데이 터)를 저장하는 이유는 성과 정보(메타데이터)의 중복 여부를 판단하기 위함이다. 그렇지만, URI 서버를 별도로 두지 않고 두 시스템을 하나로 통합하여 중복 저장하지 않을 수도 있다. 도 24는 도 22에서 성과 정보 승인을 상세히 보인 상세흐름도로서, 관리자에 의해 성과 정보를 승인하고 해당 <421> 성과 정보의 상태를 변경하는 방법을 통해 성과 정보를 승인하는 단계를 보여준다. 이러한 도 24는 본 발명에 따른 관리자에 의한 성과 정보 승인 단계(ST104 ~ ST106)를 보여준다. <422> 관리자는 승인 대기에 있는 성과 정보(메타데이터)에 대해 승인 인터페이스 상에서 승인이나 거절을 선택할 수 <423> 있다. 승인을 선택한 경우에 해당 성과 정보 객체 URI가 지식 확장 모듈로 전달된다(ST121). 지식 확장 모듈은 URI 관리 모듈로 해당 성과 정보 객체 URI를 전달하고(ST122), 그 결과로서 해당 성과 정보 <424> 객체 URI와 연관된 RDF 트리플/XML을 전달받는다(ST123). 해당 RDF 트리플/XML에 대해 추론 규칙을 적용하여 확장된 RDF 트리플/XML을 획득한다(ST124). <425> 확장 결과가 성공적일 경우 성과 정보 관리 시스템에서 해당 성과 정보(메타데이터)의 상태를 완료로 변경한다 <426> (ST125 ~ ST126). 도 25는 도 22에서 성과 정보 초기화를 상세히 보인 상세흐름도로서, 성과 정보 관리 시스템과 URI 서버와 지식 <427> 확장 모듈 간에 초기화 명령을 통해서 성과 정보를 초기화하는 단계를 보여준다. 이러한 도 25는 본 발명에 따른 성과 정보를 초기화하는 단계(ST104 ~ ST106)를 보여준다. <428> 관리자는 성과 정보 관리 시스템에서 성과 정보(메타데이터) 초기화를 선택한다. <429> 초기화 명령은 먼저 URI 서버에 전달된다(ST131). <430> URI 서버는 성과 정보(메타데이터) DB를 초기화하고 그 결과를 성과 정보 관리 시스템에 전달한다(ST132 ~ <431> ST133). 초기화 명령은 다시 지식 확장 모듈로 전달된다(ST134). <432> 지식 확장 모듈은 모든 RDF 트리플/XML을 삭제하고 그 결과를 성과 정보 관리 시스템에 전달한다(ST135 ~ <433> ST136). 최종적으로 성과 정보 관리 시스템은 자신의 성과 정보(메타데이터) DB 내의 내용을 삭제한다(ST137). <434> 도 26은 도 22에서 성과 정보 삭제를 상세히 보인 상세흐름도로서, 성과 정보 객체 URI를 이용하여 특정 성과 <435> 정보를 삭제하는 단계를 보여준다. 이러한 도 26은 본 발명에 따른 성과 정보를 삭제하는 단계(ST104 ~ ST106)를 보여준다. <436> 관리자는 성과 정보 관리 시스템에서 특정 성과 정보(메타데이터) 삭제를 선택한다. <437> 삭제 명령과 함께 성과 정보 객체 URI는 먼저 URI 서버에 전달된다(ST141). <438> URI 서버는 해당 성과 정보(메타데이터)를 삭제하고 그 결과를 성과 정보 관리 시스템에 전달한다(ST142 ~ <439> ST143). 삭제 명령과 함께 성과 정보 객체 URI는 다시 지식 확장 모듈로 전달된다(ST144). <440> 지식 확장 모듈은 해당 성과 정보에 대응하는 RDF 트리플/XML을 삭제하고 그 결과를 성과 정보 관리 시스템에 <441> - 42 -공개특허 10-2008-0071213전달한다(ST145 ~ ST146). 최종적으로 성과 정보 관리 시스템은 자신의 성과 정보(메타데이터) DB에서 해당 성과 정보를 삭제한다(ST147). <442> 도 27은 도 22에서 성과 정보 수정을 상세히 보인 상세흐름도로서, 성과 정보 객체 URI와 성과 정보를 이용하여 <443> 특정 성과 정보를 갱신하는 단계를 보여준다. 이러한 도 27은 본 발명에 따른 성과 정보를 수정하는 단계(ST103 ~ ST106)를 보여준다. <444> 성과 정보 관리 시스템에서 특정 성과 정보(메타데이터)가 수정되는 경우 해당 성과 정보 객체 URI를 포함한 성 <445> 과 정보(메타데이터)가 URI 서버로 전달된다(ST151). 이 성과 정보(메타데이터)는 갱신된 성과 정보(메타데이터)이므로 URI 서버 내의 해당 성과 정보(메타데이터)를 <446> 대체한다(ST152). 해당 성과 정보 객체 URI는 성과 정보 관리 시스템에 전달된 후 다시 지시 확장 모듈로 전달된다(ST153 ~ <447> ST154). 지식 확장 모듈에서는 먼저 해당 성과 정보 관련 RDF 트리플/XML을 삭제하고 성과 정보 승인 단계와 같은 과정 <448> 을 거쳐 갱신된 RDF 트리플/XML을 전달받아 지식 확장을 수행한다(ST155 ~ ST158). 그 결과는 성과 정보 관리 시스템에 전달되고 해당 시스템에서는 갱신된 성과 정보를 저장하는 것으로 수정 단 <449> 계를 종료한다(ST159 ~ ST160). 도 28은 도 22에서 성과 정보 상태 변경을 상세히 보인 상세흐름도로서, 관리자와 등록자에 의해 성과 정보의 <450> 상태를 연속적으로 변경하는 과정을 포함하는 상태 변경 흐름을 보여준다. 성과 정보(메타데이터)가 등록되면 그 상태는 승인 대기가 된다. 관리자는 승인 대기에 있는 성과 정보(메타데 <451> 이터)에 대해 승인을 선택하거나 거절을 선택할 수 있다. 이러한 상태는 해당 성과 정보(메타데이터)가 삭제되 지 않는 한 계속 변경될 수 있다. 성과 정보와 같이 관리자에 의해 올바르고 거짓이 없는 성과인지를 확인하는 과정이 필요한 정보에 대해서는 승인 절차를 별도로 분리하고 해당 정보에 대한 상태를 변경하는 방식으로 이용 자에게 그 정보가 제공되는 것을 제어할 수 있어야 한다. 승인이 되지 않은 성과 정보를 무조건 이용자에게 공 개하는 경우에 해당 성과 정보에 문제가 있는 경우에 혼란이 발생할 수 있기 때문이다. 성과 정보 관리 시스템에서 건 별로 성과 정보(메타데이터) 등록이 이루어지는 경우도 있지만, 관리자에 의해 <452> 검증된 대량의 성과 정보(메타데이터)가 일괄 등록되는 경우도 있다. 이러한 일괄 등록의 경우 성과 정보 등록 및 승인 단계(ST101 ~ ST106)를 반복적으로 수행함으로써 그 목표를 달성할 수 있다. 일괄 등록 시에 특정 성과 정보(메타 데이터)들에서 등록 오류가 발생하는 경우 오류 로그에 저장하고 후에 해 <453> 당 성과 정보(메타데이터)들만 확인하여 재등록을 시도한다. 일괄 등록 시에 승인 단계를 거친 성과 정보(메타 데이터)들은 이용자가 검색하고 서비스 받을 수 있도록 응용 시스템을 통해 오픈할 수 있다. 도 29는 도 22에서 URI 관리에 사용되는 RDF 트리플의 일 예를 보인 표로서, 성과 정보, 비성과 정보, 온톨로지 <454> 스키마에 따라 RDF 트리플 유형을 구분하고 관리하기 위한 DBMS 기반 RDF 트리플의 일 예를 보여준다. 'Object URI' 필드는 해당 트리플과 관련된 성과 정보 객체 URI를 저장하고 있으며, RDF 트리플은 'Subject', <455> 'Predicate', 'Object'로 구분되어 저장된다. 물론 이들을 하나의 필드에 저장하고 필요에 따라 해석하여 사용 할 수도 있다. 'Time' 필드는 DB에 해당 RDF 트리플이 등록된 시간을 의미하며, 'SENT' 필드는 해당 RDF 트리플이 지식 확장 <456> 모듈에 의해 수집되었는 지를 표시한다. 'SENT' 필드가 'T'인 경우는 지식 확장 모듈에 해당 RDF 트리플이 전달 된 것을 의미하며, 'F'인 경우는 지식 확장 모듈에 아직 해당 RDF 트리플이 전달되지 않은 것을 의미한다. 이러 한 방식으로 지식 확장에 이용될 RDF 트리플이 중복되거나 누락되지 않도록 관리한다. 온톨로지 스키마(Schema) 역시 일관성 있는 처리를 위해서는 RDF 트리플로 변환되어 있어야 한다. 'Object URI' 필드에 'OWL'로 되어 있는 경우 온톨로지 스키마를 위한 RDF 트리플을 의미하며, 'NULL'은 성과 <457> 정보와 상관없는 기타 RDF 트리플을 의미한다. 도 29는 DBMS에 기반하여 RDF 트리플로 처리하는 방식을 설명하고 있으나, XML 문서에 기반하여 상기 필드들을 <458> 포함하여 구성할 수 있다. 이 경우는 RDF XML을 사용한다. - 43 -공개특허 10-2008-00712134-5. 통계 기반 문서 분류를 통한 시소러스 확장 및 하이브리드 문서 분류 <459> 그래서 본 발명은 통계 기반 문서 분류 기법을 활용하여 시소러스를 구성하는 용어 후보를 제공하고 이를 시소 <460> 러스에 부착시킴으로써 시소러스를 확장하는 방법을 제공한다. 또한 통계 기반 문서 분류와 택소노미(taxonomy, 분야분류명을 대표하는 용어 집합)를 활용한 시소러스 기반 문서 분류를 결합하여 보다 향상된 성능을 보여주는 하이브리드 문서 분류 시스템을 구성할 수 있게 한다. 또한 본 발명에 따른 시소러스 확장 방법에서는 통계 기반 문서 분류 시스템이 이용하는 자질(문서 분류에 활용 <461> 되는 문서 내의 정보로서 키워드, 문서 빈도, 상호 정보, 정보 획득량 등을 포함) 집합을 통해 용어 후보를 획 득한다. 획득된 용어 후보는 현재 시소러스를 확장하기 위해 사용하는데 결국 시소러스 기반 문서 분류 성능을 향상시키기 위함이다. 시소러스를 구축하는 데 드는 인적, 물적 자원이 상당하므로 효율적인 구축 방안이 필요하다. 이를 위해 통계 <462> 기반 문서 분류에서 효용성이 증명된 자질 집합에 포함된 용어 후보들을 사용함으로써 구축 대비 효과를 극대화 할 수 있다. 하이브리드 문서 분류 시스템은 통계 기반 문서 분류 시스템과 시소러스 기반 문서 분류 시스템의 결과를 조합 <463> 하고 분류 결과를 생성함으로써 서로 간의 장점을 결합시킬 수 있다. 시소러스 기반 문서 분류만 사용하는 경우 에는 시소러스에 포함되지 않은 용어들에 대한 대처가 약하다는 단점을 가지며, 통계 기반 분류 시스템만을 사 용하는 경우에는 통계 모델의 한계 내에서만 그 성능을 보이기 때문에 분류하고자 하는 문서 특성에 맞는 문서 분류를 상황에 따라 할 필요가 있다. 본 발명에 따른 하이브리드 문서 분류 시스템은 서로 다른 두 분류 시스템의 장점을 결합시켜 높은 성능의 문서 <464> 분류 서비스를 실현할 수 있도록 한다. 도 30은 도 3에서 주제/분야 할당 수행시 통계기반 문서분류를 통한 시소러스 확장 방법 및 하이브리드 문서 분 <465> 류 방법을 보인 흐름도이다. 그래서 통계 기반 문서 분류를 수행한다(ST201). <466> 그리고 시소러스를 확장한다(ST202). <467> 또한 택소노미를 이용하여 분야분류체계-시소러스 간 매핑을 수행한다(ST203). <468> 또한 시소러스 기반 문서 분류를 수행한다(ST204). <469> 또한 통계 기반 문서 분류와 시소러스 기반 문서 분류를 결합하여 하이브리드 기반 문서 분류를 수행한다 <470> (ST205). 또한 분류결과를 평가하고(ST206), 정답 문서 집합을 작성한다(ST207). <471> 도 31은 도 30에서 통계 기반 문서 분류의 상세흐름도이다. <472> 그래서 실험 문서 집합, 분야 분류 체계, 정답 문서 집합을 입력받아 자질을 추출한다. 이때 형태소 분석과 불 <473> 용어 처리 중에서 하나 이상을 사용하여 자질 추출을 수행한다(ST211). 그리고 기계 학습을 수행한다(ST212). <474> 또한 문서 분류를 수행한다(ST213). <475> 또한 자질 집합을 형성한다(ST214). <476> 도 32는 도 30에서 시소러스 확장의 상세흐름도이다. <477> 그래서 통계 기반 문서 분류를 수행한다. <478> 그리고 통계 기반 문서 분류로부터 자질 집합을 얻는다(ST222). <479> 또한 얻어진 자질 집합으로부터 키워드들을 선정한다(ST223). <480> 또한 선정된 키워드들을 용어 후보로 결정한다(ST224). <481> 또한 시소러스를 구축한다(ST225). <482> - 44 -공개특허 10-2008-0071213도 33은 도 30에서 분야분류체계-시소러스 간 매핑의 상세흐름도이다. <483> 그래서 각 분야분류명을 위한 택소노미를 도입한다(ST231). <484> 그리고 도입된 택소노미에 속한 키워드들을 시소러스에 매핑시킨다(ST232). <485> 도 34는 도 30에서 시소러스 기반 문서 분류의 상세흐름도이다. <486> 그래서 문서를 입력하도록 한다(ST241). <487> 그리고 형태소 분석 및 불용어 처리를 수행한다(ST242). <488> 또한 추출된 주요 키워드들을 시소러스 상의 용어들과 매칭시킨다(ST243). <489> 그리고 매칭된 용어들로부터 택소노미를 이용하여 분야분류명을 획득한다(ST244). <490> 또한 획득된 분야분류명들을 조합하여 해당 문서의 분야분류명을 결정한다(ST245). <491> 도 35는 도 30에서 하이브리드 기반 문서 분류의 상세흐름도이다. <492> 그래서 문서를 입력받아 통계 기반 문서 분류와 시소러스 기반 문서 분류에서 각각의 분류 결과를 획득한다 <493> (ST251). 또한 두 분류 결과를 이용하여 최종 분류 결과를 생성한다. 이때 두 분류 결과에 대해 차별적 적용 방식의 <494> 조합, 대등 방식의 조합, 보팅(Voting) 방식의 조합 중에서 하나 이상의 조합으로 최종 분류 결과를 생성한다 (ST252). 도 36은 도 30에 의해 통계적 문서 분류를 통한 시소러스 확장을 수행하는 예를 보인 개념도로서, 통계적 문서 <495> 분류를 통한 시소러스 확장의 정보 흐름 순서를 보인 것이다. 그래서 도 36에서는 분야분류체계에 의해 분야분 류명(또는 코드)이 부착된 정답 문서 집합으로부터 자질 집합을 추출하여, 기계 학습을 통해 통계 기반 문서 분 류 시스템을 구성하고, 자질 집합에 포함된 용어들을 시소러스에 반영할 수 있도록 하는 시소러스 확장 방안에 대한 정보 흐름을 보여준다. 일반적으로 시소러스 기반 문서 분류 성능이 통계 기반 문서 분류보다 높고 안정적이지만, 시소러스에 포함된 <496> 용어들이 문서에서 발견되는 정도가 작은 경우에 대처 방안이 없다. 시소러스에 용어를 추가하는 작업은 수작업에 의존해야 하므로 인적, 물적 자원의 한계로 인해 그 속도가 더딜 <497> 수밖에 없다. 또한 시소러스에 추가할 용어를 선정하는 작업도 부담으로 작용하게 된다. 문서 분류 대상이 되는 문서들에 효과적인 용어를 우선적으로 시소러스에 추가하기 위한 방법으로 도 36에서는 <498> 통계 기반 문서 분류 시스템에서 사용되는 자질 집합을 이용한다. 자질에는 문서를 대표할 수 있는 키워드가 포 함되며 이 키워드를 용어 후보로 선정하여 시소러스 확장에 이용한다. 통계 기반 문서 분류 시스템을 구성하는 요소로는 자질 추출, 기계 학습, 문서 분류가 있다. <499> 자질 추출은 형태소 분석, 불용어 처리를 수행하고 문서 빈도, 상호 정보, 정보 획득량 등을 이용하여 정답 문 <500> 서 집합으로부터 자질들을 추출하여 자질 집합을 생성한다. 자질 집합은 기계 학습과 문서 분류를 통해 얻어진 성능 증가에 의해 그 효용성이 검증된다. <501> 문서 분류는 기계 학습을 통해 얻어진 학습 모델과 실험 문서 집합을 이용하는데 통계 기반 문서 분류 성능 측 <502> 정에 의해 학습 모델을 결정한다. 그래서 해당 학습 모델에 사용된 검증된 자질 집합에 포함된 키워드들을 용어 후보로 선정하고 수작업으로 시소 <503> 러스에 추가하는 과정을 거치면 확장된 시소러스를 얻을 수 있다. 도 37은 도 30에 의해 시소러스 기반과 통계 기반이 결합된 문서 분류를 수행하는 예를 보인 개념도이다. 이러 <504> 한 도 37는 시소러스 기반과 통계 기반이 결합된 문서 분류 시스템의 정보 흐름 순서를 보인 것이다. 이는 자질 집합을 이용하는 통계 기반 문서 분류 시스템과 택소노미가 매핑된 시소러스 기반 문서 분류 시스템을 통합하여 하이브리드하게 분류 결과 간 가중치를 조정하고 상위 N개의 분류 결과를 생성하는 문서 분류 시스템에 대한 정 보 흐름을 보여준다. 도 38은 도 30에 의해 택소노미가 매핑된 시소러스의 일 예를 보인 개념도이다. 이러한 도 38은 분야분류체계의 <505> - 45 -공개특허 10-2008-0071213각 분야분류명(또는 코드)에 대응하는 택소노미(분야분류명을 대표하는 용어 집합)를 구축하고 택소노미를 구성 하는 각 용어들을 시소러스에 매핑시킨 언어 자원 구성도를 보여준다. 시소러스 기반 문서 분류를 위해 도 38에서와 같이 택소노미(taxonomy)를 이용하여 분야분류체계를 시소러스에 <506> 매핑하는 과정을 선행적으로 처리한다. 분류 대상이 되는 문서가 입력되면 형태소 분석과 불용어 처리를 통해 주요 키워드를 추출한다. 통계 기반 문서 분류 시스템의 경우 자질 추출 과정을 거쳐 자질 집합을 생성하고, 이 집합과 학습 모델을 이용 <507> 하여 문서 분류를 수행한다. 시소러스 기반 문서 분류 시스템의 경우 추출된 주요 키워드들을 시소러스 상의 용 어들과 매칭한다. 매칭된 용어들은 분야분류체계의 각 분야분류명(또는 코드)을 대표하는 택소노미(taxonomy)에 포함되어 있으므로 용어들의 문서 내에서의 빈도 정보, 택소노미(taxonomy) 내에서의 가중치 등을 이용하여 입 력 문서의 분야분류명(또는 코드)을 결정한다. 분류 결과 생성은 이 두 문서 분류 시스템의 분류 결과를 조합하는 하이브리드 방법을 이용한다. 두 분류 결과 <508> 의 조합 방식은 시소러스 기반 문서 분류 결과가 임계치를 넘는 확률값으로 나타나지 않는 경우에 통계 기반 문 서 분류 결과를 활용하는 차별적 적용 방식의 조합, 두 문서 분류 시스템에 미리 정해진 가중치(예를 들어, 시 소러스 기반 문서 분류 시스템의 분류 결과에 0.7을 곱하고, 통계 기반 문서 분류 시스템의 분류 결과에 0.3을 곱해 더하는 방식)를 분류 결과들에 적용하는 대등 방식의 조합, 제 3의 분류 시스템을 추가하여 다수결로 분류 결과를 결정하는 Voting(투표) 방식의 조합 등이 있다. 도 38을 참조하여 택소노미(taxonomy)를 이용하여 분야분류체계와 시소러스를 연동(매핑)하는 방법을 설명하면 <509> 다음과 같다. 분야분류체계의 각 분야분류명을 대표하는 주요 키워드들을 택소노미(taxonomy)라고 하는데, 이 키워드들을 용 <510> 어로 하여 시소러스 상의 적절한 위치에 부착한다. 시소러스에 용어를 부착하기 위해서 일반적으로 정의되는 BT(Broader Term, 상위어) - NT(Narrower Term, 하위 <511> 어) 계층 관계 및 동등 관계를 이용한다. 입력 문서로부터 추출된 주요 키워드들은 시소러스 상의 용어들과 매 칭을 시도하며, 매칭된 용어들은 특정 분야분류명(또는 코드)을 하나 또는 그 이상 가지므로 해당 문서에 대한 분야 분류명을 결정할 수 있다. 4-6. 정보 검색 시스템에서의 주제 또는 분야 할당 <512> 이 장에서는 시소러스가 미구축된 경우 택소노미를 이용하여 주제 또는 분야를 자동으로 할당하거나 태그 또는 <513> 폭소노미를 이용하여 주제 또는 분야를 자동으로 할당하여 정보 검색을 수행하게 된다. 여기서 시소러스(Thesaurus)란 특정 주제 영역에서 사용되는 용어와 이들 용어 간의 의미 관계를 체계적으로 제 <514> 시한 색인어휘집으로서, 색인과 검색 과정에서 디스크립터와 검색어를 선정하기 위한 도구로 사용된다. 이러한 시소러스는 어휘를 뜻의 관점에서 분류하여 체계화한 것을 말하는 것으로, 정보 검색 시스템을 이용한 정보 검 색 분야에서 관련어를 표시한 어휘표를 시소러스라고 부르기도 한다. 이러한 시소러스에는 유의어, 반의어 뿐만 아니라 개념의 상위와 하위 관계에 의한 관련어도 포함된다. 용어의 관계성은 일반적으로 상위 개념, 하위 개념, 용례 혹은 동의어, 관계어, 대체어 등으로 분류되는데, 시소러스는 이러한 관계성을 이용, 탐색기 질의에 포함된 용어의 의미를 확대하기 위해 주로 사용된다. 또한 시소러스는 어떤 개념을 가장 적절히 표현할 수 있는 표목을 선정하기 위하여 만들어진 어구의 집대성 또는 검색을 향상시키기 위해 동일한 관계, 계층적 관계, 연관 관계를 구분 하는 어휘집 역할을 수행하여 용어 검색이 가능하도록 해준다. 또한 택소노미(Taxonomy)는 '분류하다'라는 'tassein'과 '법, 과학'이라는 'nomos'의 합성으로 어원은 그리스어 <515> 이다. 원래는 어원 그대로 살아있는 유기체를 분류하는 과학이란 뜻이지만, 지금은 확장된 의미로서 살아있는 것 뿐만 아니라 무생물, 장소, 사건 등 모든 것을 택소노미 스키마(taxonomy schema)로 분류한 것이 택소노미이 다. 이러한 택소노미(taxonomy)는 이미 결정된 체계를 가지고 있으며, 관계형 네트워크 구조 보다는 트리형의 위계적 구조로 나타난다. 예를 들면, 포털 사이트나 웹 사이트에서의 카테고리 구조나 사이트 맵은 택소노미로 데이터를 조직한 것이다. 또한 태그(tag)는 특정한 문서나 이미지에 꼬리표를 달아서 그 문서를 설명하는 것으로, 태그를 달아두면 본문 <516> 내용과 관계없이 주제별로 검색할 수 있다. 이에 따라 한 단계 진전된 검색 혁명의 토대 역할을 할 수 있는 것 이 바로 태그이다. 그리고 웹 2.0은 아무도 데이터를 소유하지 않고 어떤 프로그래밍 또는 인터넷 환경에서도 모든 사람이 데이터 <517> - 46 -공개특허 10-2008-0071213를 사용할 수 있는 플랫폼을 의미한다. 그동안 웹사이트는 일방적으로 TV나 라디오처럼 정보와 서비스를 제공하 기만 해왔는데 이를 미디어라고 표현하기도 했다. 지금까지는 웹 사이트에 올린 데이터 또는 서비스되는 데이터 를 이동시키거나 활용할 수 없었다. 그러나 웹 2.0 환경이 구축되면 자유롭게 데이터를 이동시킬 수 있게 된다. 웹 1.0을 가리키는 대표적인 서비스가 웹 포털 서비스라면 웹 2.0은 플랫폼을 의미한다. 웹 포털 사이트의 서비 스는 사용자가 마음대로 할 수 없지만 플랫폼인 웹 2.0에서는 사용자가 원하는 대로 데이터를 활용할 수 있다. 이러한 웹 2.0에서는 태그를 사용하여 웹 문서를 작성하는 예가 증가하고 있다. 또한 폭소노미(Folksnomy)는 전통적인 분류 기준인 '디렉터리' 대신 '꼬리표(태그)'에 따라 나누는 새로운 분류 <518> 체계를 말한다. 네티즌 백과사전인 위키피디어는 \"자유롭게 선택된 키워드를 사용해 구성원이 함께 정보를 체계 화하는 방식을 의미하는 신조어\"라고 풀이하고 있다. 이를테면 정치, 경제, 사회로 나누는 것과 별도로 병역면 제, WBC, 역전 홈런 등의 꼬리표를 기준으로 일목요연하게 모을 수 있다. 폭소노미란 '사람들에 의한 분류 법'(Folk + order + nomos)이란 의미이다. 그래서 본 발명은 시소러스가 미리 구축되어 있지 않은 경우에 택소노미(Taxonomy)를 이용하여 주제, 분야를 자 <519> 동으로 할당한다. 택소노미(Taxonomy)는 일련의 용어들을 분류해 놓은 분류법이라고 정의할 수 있다. 반면 시소 러스는 용어(개념어 또는 주제어)들 간의 관계(예를 들어, 동등관계, 상하관계 등)를 더 추가하여 용어 네트워 크를 형성해 놓은 것으로 정의할 수 있다. 택소노미(Taxonomy)는 좀 더 하위 레벨의 용어 분류에 해당하는 것으 로 구축이 비교적 용이한데 이 구축 과정을 설명한 것이 이 장의 내용이다. 또한 이 장에서는 1) 시소러스가 구축된 경우, 2) 시소러스가 구축되지 않은 경우로 구분하여 설명하며, 2) 시 <520> 소러스가 구축되지 않은 경우는 2-1) 택소노미를 이용하는 경우, 2-2) 태그를 이용하는 경우, 2-3) 폭소노미를 이용하는 경우로 구분하여 설명한다. 1) 시소러스가 구축된 경우 <521> 도 39는 도 3에서 주제/분야 할당 수행시 시소러스가 구축되어 있을 때 주제 분야 할당의 예를 보인 <522> 흐름도이다. 먼저 시소러스가 구축되어 있으면(ST261), 원문으로부터 색인어를 추출한다(ST262). <523> 그리고 색인어를 시소러스 내의 개념어인 주제어와 매칭시키고 분야분류명과 시소러스 내의 개념어를 매칭시킨 <524> 다(ST263). 그런 다음 통제된 형태의 주제어를 결정하고, 분야분류명을 결정한다(ST264). <525> 그리고 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상 <526> 의 조건을 고려하여 결정된 주제어를 순위화한다(ST265). 여기서 용어 빈도(term frequency)는 해당 용어가 문 서에서 출현하는 빈도수를 말하고, 문서 빈도(inverse document frequency)는 특정 용어가 출현하는 문서의 빈 도수를 말하며, 분야분류코드 빈도는 분야분류코드가 문서들에서 출현하는 빈도수를 말하고, 개념어 깊이 (depth)는 실질적 개념을 나타내는 개념어를 분류했을 경우 상위 분류에서 하위 분류로의 깊이를 말한다. 그래서 해당 원문에 대해 상위에서 미리 설정한 특정 개수(N 개) 만큼의 주제어를 할당하게 된다(ST266). <527> 이를 통해 원문으로부터 색인어를 추출하고 이를 시소러스 내의 개념어인 주제어와 매칭함으로써 통제된 형태의 <528> 주제어를 결정하고 이를 빈도 등을 고려하여 순위화 함으로써 해당 원문에 대해 상위 N개의 주제를 할당할 수 있도록 한다. 또한 분야분류명과 시소러스 내의 개념어를 미리 매핑해 놓음으로써 주제가 결정되는 순간에 주제 에 매핑된 분야분류명도 약간의 계산을 통해 자동 결정할 수 있게 된다. 여기서 본 발명에서는 용어, 개념어, 주제어를 혼용해서 쓰고는 있지만, 개념어나 주제어는 시소러스에 포함된 <529> 경우에 주로 일컫는 말이고, 용어는 단독으로 쓰일 때도 일컬을 수 있는 말이다. 2) 시소러스가 구축되지 않은 경우 <530> 도 40은 도 39에서 주제/분야 할당 수행시 시소러스가 미구축되어 있을 때 주제 분야 할당의 예를 보인 흐름도 <531> 이다. 그래서 시소러스가 구축되어 있는지 판별하여(ST271), 시소러스가 미구축되어 있으면, 택소노미 분류체계가 결 <532> 정되어 있는지 판별한다(ST272). 만약 택소노미 분류체계가 결정되어 있다고 판별되면, 택소노미를 이용하여 분야를 자동 할당하고(ST273), 택소 <533> - 47 -공개특허 10-2008-0071213노미 분류체계가 결정되어 있지 않다고 판별되면 태그(또는 폭소노미)를 이용하여 주제 또는 분야를 자동 할당 한다(ST274). 2-1) 택소노미를 이용하는 경우 <534> 도 41은 도 40에서 택소노미를 이용하여 분야를 자동 할당하는 동작을 보인 흐름도이다. <535> 그래서 각 분야 분류명을 대표할 수 있는 정의문을 수집한다. 이때 정의문 수집 시 백과 사전 검색, 웹 검색 등 <536> 을 사용하여 정의문을 수집한다(ST281). 그리고 정의문으로부터 용어를 추출한다. 정의문으로부터 용어 추출 시 형태소 분석을 통해 명사 상당어구 위주 <537> 로 추출할 수 있다(ST282). 이때 추출된 용어가 주제어로 적당한지 검증을 수행할 수 있다(ST283, ST284). 이러한 검증 과정은 관리자나 구 <538> 축자에 의해 주제어로 적당한지 검증하는 방식을 사용할 수도 있고, 주제어로의 검증 과정을 자동화하여 검증하 는 방식을 사용할 수도 있다. 또한 이와 같은 검증 과정은 생략될 수 있다. 그리고 추출한 용어를 시소러스의 개념어인 주제어로 결정한다(ST285). <539> 또한 택소노미를 사용하여 분야를 할당하여 시소러스를 구축한다(ST286). <540> 그리고 택소노미 내의 용어들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 택소노미에 의한 분 <541> 야 분류 체계 중에서 어느 택소노미에 해당하는지 결정한다(ST287). 그런 다음 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 등을 고려하여 <542> 결정된 주제어(용어)를 순위화한다(ST288). 또한 입력된 원문에 대해 택소노미를 사용한 상위에서 미리 설정한 특정 개수(N 개) 만큼의 분야를 할당하게 된 <543> 다(ST289). 그래서 택소노미의 분류체계가 이미 결정되어 있는 경우에는 각 분야분류명을 대표할 수 있는 정의문을 수집하 <544> 고, 이렇게 수집된 정의문으로부터 자동으로 용어를 추출한다. 이렇게 해서 정리된 용어는 해당 분야분류명을 대표하는 용어로 관리한다. 분야분류명의 경우 이미 택소노미 구축 과정에서 특정 분야분류명에 용어들을 소속 시킴에 따라 분야분류명과 개념어가 매핑된 것으로 볼 수 있기 때문이다. 그리고 택소노미 내의 용어 중 색인어 와 매칭된 것들을 빈도 기반으로 순위화하면 주제 할당이 가능해진다. 2-2) 태그를 이용하는 경우 <545> 도 42는 도 40에서 태그를 이용하여 주제를 자동 할당하는 동작을 보인 흐름도이다. <546> 그래서 태그를 가진 웹 문서로부터 태그를 추출한다(ST291). <547> 이때 추출된 태그가 주제어로 적당한지 검증을 수행할 수 있다(ST292, ST293). 이러한 검증 과정은 관리자나 구 <548> 축자에 의해 주제어로 적당한지 검증하는 방식을 사용할 수도 있고, 주제어로의 검증 과정을 자동화하여 검증하 는 방식을 사용할 수도 있다. 또한 이와 같은 검증 과정은 생략될 수 있다. 그런 다음 추출된 태그를 시소러스의 개념어인 주제어로 결정한다(ST294). <549> 그리고 추출된 태그를 사용하여 분야를 할당하여 시소러스를 구축한다(ST295). <550> 또한 시소러스 내의 용어들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문이 태그에 의해 설정된 분 <551> 야 분류 체계 중에서 어느 태그에 해당하는지 결정한다(ST296). 그리고 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상 <552> 의 조건을 고려하여 결정된 주제어(태그)를 순위화한다(ST297). 그런 다음 입력된 원문에 대해 상위에서 미리 설정한 특정 개수(N 개)의 주제어(태그)를 할당하게 된다(ST298). <553> 2-3) 폭소노미를 이용하는 경우 <554> 도 43은 도 40에서 태그와 폭소노미를 이용하여 주제 또는 분야를 자동 할당하는 동작을 보인 흐름도이다. <555> 그래서 태그를 가진 웹 문서로부터 태그를 추출한다(ST301). <556> 그리고 추출된 태그가 주제어로 적당한지 검증을 수행할 수 있다(ST302, ST303). 이러한 검증 과정은 관리자나 <557> - 48 -공개특허 10-2008-0071213구축자에 의해 주제어로 적당한지 검증하는 방식을 사용할 수도 있고, 주제어로의 검증 과정을 자동화하여 검증 하는 방식을 사용할 수도 있다. 또한 이와 같은 검증 과정은 생략될 수 있다. 그런 다음 추출된 태그를 시소러스의 개념어인 주제어로 결정한다(ST304). <558> 그리고 폭소노미를 사용하여 분야를 할당하여 시소러스를 구축한다(ST305). <559> 이렇게 시소러스를 구축한 후 시소러스 내의 태그들과 입력된 원문에서 추출한 색인어를 매칭시켜 입력된 원문 <560> 이 폭소노미에 의해 설정된 분야 분류 체계 중에서 어느 폭소노미에 해당하는지 결정한다(ST306). 그리고 색인어의 용어빈도 조건, 문서빈도 조건, 분야분류코드 빈도 조건, 개념어 깊이 조건 중에서 하나 이상 <561> 의 조건을 고려하여 결정된 주제어(태그), 분야(폭소노미)를 순위화한다(ST307). 그런 다음 입력된 원문에 대해 상위에서 미리 설정한 특정 개수(N 개)의 주제어(태그), 분야(폭소노미)를 할당 <562> 하게 된다(ST308). 웹 문서에는 태그(TAG)라는 특별한 태그를 두어 웹 문서를 작성한 사람이 임의로 해당 태그 내에 그 웹 문서를 <563> 대표할 수 있는 용어들을 넣어둔다. 웹 검색에서 이러한 TAG를 이용하여 검색 결과를 내기도 하므로, 검색 결과 상위에 해당 문서를 나오게 하기 위해 일부러 TAG 내의 용어를 변경하는 경우도 발생한다. 이러한 TAG를 주제어 로서 간주한다면, 그 TAG를 가진 문서는 해당 주제어로 분류된 문서로서 간주할 수 있다. 상기의 예처럼 TAG를 남용하는 경우에도 이러한 TAG에 속한 문서를 좀 더 많이 수집 할수록 잘못 붙여진 문서들의 가치가 희소될 수 있으므로 대용량 문서를 가진 웹 포털 사이트 등에 유용한 방식이라고 할 수 있다. 해당 TAG를 가진 웹 문서로 부터 용어를 추출한다. 그리고 추후 입력된 원문에 대해 TAG 내의 용어들과 색인어를 매칭시켜 어느 TAG에 해당 하는 문서인지를 자동으로 결정할 수 있다. 나아가 폭소노미와 같은 TAG들을 분류해놓은 일종의 택소노미 (Taxonomy)를 활용한다면 TAG가 결정되는 순간 폭소노미(Folksnomy) 내의 어느 분류에 속해 있는 지를 자동으로 파악하여 폭소노미(Folksnomy) 내에서의 분류명도 동시에 결정할 수 있게 되는 것이다. 4-7. DBMS 기반 지식 확장 및 추론 <564> 이 장에서는 온톨로지를 이용하여 지식을 생성하고, 확장 규칙을 이용하여 지식을 확장하고, 질의 처리를 통해 <565> 추론 서비스를 제공하여 시맨틱 웹 기술을 활용하고 추론 서비스를 제공할 필요가 있는 전 분야에 걸쳐서 안정 적이고 효율적인 프레임워크를 제시함으로써 시맨틱 웹 서비스의 상용화를 가능하게 하는 것을 설명한다. 그리고 시맨틱 웹 기술의 발전과 더불어 급격히 관심을 끌고 있는 추론 서비스를 불안정한 추론 엔진을 이용하 <566> 는 대신 안정적인 DBMS 기반 시맨틱 웹 플랫폼을 실현하는 방법을 설명한다. 또한 이 장은 크게 온톨로지 스키 마와 인스턴스들을 이용하여 트리플로 표현되는 지식을 생성하는 방법, 지식 확장 규칙을 이용하여 지식을 확장 하는 방법, 사용자 질의를 변환하고 질의 처리하는 방식으로 추론 서비스를 제공하는 방법으로 구성된다. 또한 OWL(Web Ontology Language) 등으로 기술된 온톨로지 상에서의 추론 엔진을 이용함으로 해서 발생할 수 있 <567> 는 추론에서의 무한 반복, 신뢰할 수 없는 수준의 응답 시간 등의 안정성을 떨어뜨리는 요소들을 배제함으로써 실용적인 시맨틱 웹 응용 서비스를 제공할 수 있도록 한다. 이를 위해 온톨로지 인스턴스들뿐만 아니라 트리플 로 표현된 지식들까지 DBMS 기반으로 저장, 관리함으로써 대용량의 지식 처리를 보장하고 안정적인 지식 확장을 가능하도록 한다. 기존에 DBMS를 이용하는 시도가 해외에서 연구 수준으로 가끔 있었으나 이들은 저장소 역할만을 DBMS에 의존함 <568> 으로써 지식 생성, 지식 확장, 지식 제공이라는 전체 정보 흐름과 유기적으로 결합되지 못한 단점을 가지고 있 다. 이 장에서의 추론 서비스 시스템은 지식의 크기에 있어서 추론 엔진이 다룰 수 없는 수준까지도 처리할 수 있는 <569> 구조로 발명되었으며, 지식에 대한 확장성을 보장할 수 있도록 한다. 또한, 트리플로 표현 가능한 모든 지식들 을 다룰 수 있도록 설계됨으로써 시맨틱 웹 환경에서의 필수적인 요소로 활용될 수 있다. 도 44는 도 3에서 DBMS 기반 지식 확장 및 추론 수행시 DBMS 기반 지식 확장 및 추론 서비스 시스템의 일 예를 <570> 보인 블록구성도이다. 그래서 지식 생성부는 온톨로지 스키마와 인스턴스들을 이용하여 트리플로 표현되는 지식을 생성한다. 또한 지 <571> 식 확장 처리부는 지식 생성부에서 생성된 지식을 입력받고, 지식 확장 규칙을 이용하여 지식을 확장한다. 또한 추론 서비스 제공부는 지식 확장 처리부에서 확장된 지식을 이용하고, 사용자 질의를 변환하고 질의를 처리하여 추론 서비스를 제공한다. - 49 -공개특허 10-2008-0071213그리고 지식 생성부는 RDF 또는 XML 형태의 온톨로지 기술 언어로 표현된 온톨로지 스키마를 RDF/XML 파서로 파 <572> 싱하여 그 결과를 생성하고, 스키마 트리플 변환부를 이용하여 스키마 트리플을 생성한다. 또한 지식 생성부에서 RDF/XML 파서는 온톨로지 스키마를 RDF/XML 파싱하여 파싱 결과를 출력한다. 이러한 <573> RDF/XML 파서는 온톨로지 스키마를 DBMS 기반의 트리플로 변환하기 위한 기초 작업을 수행하고, 온톨로지 스키 마를 해석하여 파싱 결과를 출력한다. 또한 지식 생성부에서 스키마-트리플 변환부는 RDF/XML 파서에서 출력된 파싱 결과를 입력받아 스키마-트리플 <574> 변환을 수행한다. 이러한 스키마-트리플 변환부는 온톨로지 스키마를 DBMS에서 다룰 수 있는 형태로 변환시킨다. 또한 지식 생성부에서 DB-트리플 변환 규칙 생성부는 스키마-트리플 변환부에서 변환된 스키마-트리플과 DB-클 <575> 래스 매핑 정보와 NS-Prefix 매핑 정보를 입력받고 DB-트리플 변환 규칙을 생성한다. 이러한 DB-트리플 변환 규 칙 생성부는 DB-트리플 변환 규칙을 생성하기 위해 스키마 트리플, DB-클래스 매핑 정보, NS-Prefix 매핑정보를 이용하고, DB-클래스 매핑 정보를 이용하여 DBMS 필드와 개념에 해당하는 온톨로지 클래스를 매핑하며, DB-클래 스 매핑 정보를 편집할 수 있도록 편집 화면과 편집기를 제공하고, NS-Prefix 매핑정보를 이용하여 네임스페이 스와 Prefix가 호환되도록 인식하며, NS-Prefix 매핑정보를 편집할 수 있도록 편집 화면과 편집기를 제공하고, 온톨로지 전문가가 기술한 DB-트리플 변환 규칙을 얻을 수 있도록 편집 화면과 편집기를 제공한다. 또한 지식 생성부에서 DB-트리플 변환부는 DB-트리플 변환 규칙 생성부에서 생성된 DB-트리플 변환 규칙을 이용 <576> 하여 URL 서버에 저장되어 있는 온톨로지 인스턴스를 인스턴스 트리플로 변환시킨다. 이러한 DB-트리플 변환부 는 URI 서버에 저장되거나 OWL(Web Ontology Language)의 온톨로지 기술 언어를 이용하여 URI 기반 또는 문자열 로 표현된 온톨로지 인스턴스를 인스턴스 트리플로 변환시킨다. 그리고 지식 확장 처리부는 스키마 트리플과 인스턴스 트리플을 입력으로 받아 스키마 기반 확장 규칙과 사용자 <577> 정의 확장 규칙을 해석하여 확장 트리플을 생성하는 것으로, 스키마 기반 확장 규칙을 생성하는 지식 확장 규칙 생성부; 지식 확장 규칙 생성부에 의해 생성된 스키마 기반 확장 규칙과 전문가가 기술한 사용자 정의 확장 규 칙을 이용하고 인스턴스 트리플과 스키마 트리플을 이용하여 확장 트리플을 생성하는 지식 확장부; 및 인스턴스 트리플과 지식 확장부의 결과를 이용하여 동적으로 값이 변하는 유형의 확장 트리플을 생성하는 추가 지식 확장 부;를 포함하여 구성할 수 있다. 또한 지식 확장 처리부에서 지식 확장 규칙 생성부는 지식 생성부의 스키마 트리플을 참조하여 스키마 기반 확 <578> 장 규칙을 생성한다. 또한 지식 확장 처리부에서 지식 확장부는 추론 엔진에서의 전향 추론(Forward Chaining)에 해당하는 방식으로 <579> 규칙 해석 및 트리플 추가 생성을 담당한다. 또한 지식 확장 처리부에서 추가 지식 확장부는 동적으로 특정 클래스의 값이 변동하는 트리플들을 처리하도록 <580> 인스턴스 트리플을 입력받아 DBMS 테이블이나 메모리 상에서 값을 계산하고, 해당 트리플을 업데이트하거나 추 가한다. 그리고 추론 서비스 제공부는 사용자 질의를 입력받아 변환시켜 변환 질의를 생성하는 질의 변환부; 이전에 입 <581> 력된 질의인지 판단하는 캐시 관리부; 질의 변환부에서 변환된 변환 질의를 입력받고, 캐시 관리부의 판단 결과 를 입력받아 질의 결과를 생성하는 질의 처리부; 질의 처리부의 질의 결과를 입력받아 후 처리하여 후 처리 결 과를 생성하는 후 처리부; 및 후 처리부에서 생성된 후 처리 결과를 이용하여 사용자 인터페이스에 맞도록 메시 지와 프로토콜을 생성하여 추론 결과를 제시하는 결과 제시부;를 포함하여 구성할 수 있다. 그래서 추론 서비스 제공부에서 질의 변환부는 SPARQL이나 RDQL의 질의 기술 언어 또는 사용자 인터페이스에 의 <582> 존적인 특정 구문으로 표현된 사용자 질의를 DBMS 기반 지식에 접근할 수 있도록 SQL로 변환한다. 또한 추론 서비스 제공부에서 캐시 관리부는 질의/결과 목록으로 구성된 캐시를 참조하여 이전에 입력된 질의인 <583> 지 판단한다. 또한 추론 서비스 제공부에서 질의 처리부는 이전에 입력된 질의인 경우에는 추론 결과를 바로 사용자에게 제시 <584> 하고, 신규로 입력된 질의인 경우에는 지식 확장 처리부의 확장 트리플을 참조하여 질의 결과를 생성한다. 또한 추론 서비스 제공부에서 후 처리부는 질의 처리부에서 제시한 질의 결과를 사용자 인터페이스에 맞도록 정 <585> 렬하고 특정 기준을 적용하여 결과의 일부를 삭제하여 필터링하는 조작을 통해 후처리 결과를 생성한다. - 50 -공개특허 10-2008-0071213또한 추론 서비스 제공부에서 결과 제시부는 질의 처리부의 질의 결과 또는 후 처리부의 후 처리 결과를 이용하 <586> 여 추론 결과를 생성하고, URI 서버를 참조하여 추론 결과 생성 대상 URI의 개념-값 관계(Datatype Property)와 연결된 값을 추출하여 추론 결과를 제시한다. 도 45는 도 3에서 DBMS 기반 지식 확장 및 추론 서비스 방법을 보인 흐름도이다. <587> 그래서 본 발명은 지식 생성부에서의 온톨로지 스키마와 인스턴스들을 이용하여 트리플로 표현되는 지식을 생성 <588> 하는 단계(ST311 ~ ST314), 지식 확장 처리부에서의 지식 확장 규칙을 이용하여 지식을 확장하는 단계(ST321 ~ ST323), 추론 서비스 제공부에서의 사용자 질의를 변환하고 질의 처리하는 방식으로 추론 서비스를 제공하는 단 계(ST331 ~ ST335)로 구성된다. 도 46은 도 44 또는 도 45에서 정보 흐름 순서를 보인 개념도이다. <589> 온톨로지는 특정 영역에서 클래스(개념) 간의 관계를 표현하는 지식 체계로서 온톨로지 스키마와 온톨로지 인스 <590> 턴스로 구성된다. 온톨로지 스키마는 개념 자체와 개념 간 관계를 표현하는 골격(예. '사람'이라는 개념은 '기 관'과 '소속'이라는 관계로 연결된다.)이라고 할 수 있으며, 온톨로지 인스턴스는 특정 개념이 사례화된 형태 (예. \"정한민\"은 \"한국과학기술정보연구원\"과 '소속'이라는 관계로 연결된다.)라고 할 수 있다. 온톨로지 스키마는 RDF(Resource Description Framework)나 XML(eXtensible Markup Language)로 표현된다. <591> DBMS 기반으로 지식을 다루기 위해서는 온톨로지 스키마와 온톨로지 인스턴스를 트리플(Triple) 형식(두 개의 개념과 이들을 연결하는 관계명을 3개 요소로 하는 리스트로 구성한 형태로서, 가운데에 관계명을 위치시켜 (' 사람', '소속', '기관') 과 같은 형식으로 표현할 수 있다.)이나 XML 등 다른 포맷으로 통일시킬 필요가 있다. 본 발명에서는 편의상 트리플로 표현하며 DBMS에 저장되는 형태 역시 Subject(관계명 왼쪽에 위치한 개념으로 <592> 위의 예에서 '사람'이 여기에 해당한다.), Predicate(관계명을 의미하며 위의 예에서 '소속'이 여기에 해당한다.), Object(관계명 오른쪽에 위치한 개념으로 위의 예에서 '기관'이 여기에 해당한다.)의 세 개 필드를 포함하는 테이블로 정의한다. 이 세 가지 요소를 하나의 테이블이 아닌 각각 별도의 테이블에 저장할 수도 있으 며, 관계명에 따라 테이블을 분산시킬 수도 있다. RDF/XML 파서는 온톨로지 스키마를 궁극적으로 DBMS 기반의 트리플로 변환하기 위한 기초 작업을 수행한다. <593> RDF/XML 파서는 온톨로지 스키마를 해석하여 파싱 결과를 생성한다. 도 47은 도 44 또는 도 45에서 온톨로지 스키마와 RDF/XML 파서에 의한 파싱 결과의 일 예를 보인 도면이다. <594> 파싱 결과는 스키마-트리플 변환부를 거쳐 트리플로 변환된다. <595> 스키마 트리플은 이렇게 변환된 결과로 생성된 지식으로, 온톨로지 스키마를 DBMS에서 용이하게 다룰 수 있는 <596> 형태로 변환시킨 것이다. 스키마 트리플은 인스턴스 트리플을 생성하기 위해 필수적으로 요구되는 지식이다. 이 는 스키마 트리플이 온톨로지 스키마를 표현하고 있으며, 온톨로지 스키마가 온톨로지 인스턴스를 해석하기 위 한 기본 정보이기 때문이다. 온톨로지 인스턴스를 온톨로지 트리플로 변환하기 위해서 DB-트리플 변환 규칙 생성부가 필요하다. DB-트리플 <597> 변환 규칙 생성부는 DB-트리플 변환에 필요한 변환 규칙을 만드는 역할을 하는데, 이때 이용하는 정보가 스키마 트리플 , DB-클래스 매핑 정보, NS(Name Space)―Prefix 매핑 정보가 있다. DB-클래스 매핑 정보는 URI(Uniform Resource Identifier) 서버에 저장되어 있는 각 필드들(필드 정보는 온톨 <598> 로지 인스턴스에 해당한다)이 온톨로지 스키마에 어떻게 매핑되는지를 알려준다. 예를 들어, 인력 정보 테이블 의 첫 번째 필드가 '사람'이라는 개념을 의미하는 경우에 \"<f1> rdf:type isrl:Person\"과 같이 표현한 정보가 DB-클래스 매핑 정보에 담겨진다. URI 서버는 온톨로지 인스턴스를 효율적으로 관리하기 위해 사용하는 DBMS 기반 저장소로서 개념 간 관계 <599> (Object Property)와 개념-값 관계(Datatype Property)를 포함한다. 개념 간 관계라 함은 '사람'이라는 개념이 '소속'이라는 관계로서 '기관'이라는 개념을 가지는 경우에 해당하며, 개념-값 관계는 '사람'이라는 개념이 '나 이'라는 관계로서 '30'이라는 값을 가지는 경우에 해당한다. URI 서버를 이용하지 않고도 지식 생성 방법을 구 현할 수 있는데, 이 경우에는 온톨로지 스키마가 스키마 트리플로 변환되는 과정을 그대로 따르게 된다. NS-Prefix 매핑 정보는 네임스페이스(Name Space)를 Prefix로 매핑될 수 있도록 도와주는 역할을 한다. <600> 네임스페이스는 \"#\"와 같이 논리적으로 현재 기술하고자 하는 개념 체계를 다른 개념 체계들과 혼동되지 않도록 <601> - 51 -공개특허 10-2008-0071213그룹화해주는 역할을 한다. 일반적으로 OWL(Web Ontology Language)이나 RDF(Resource Description Framework) 등 지식을 기술하는 언어에서는 네임스페이스 대신에 \"rdf\"와 같이 이를 간략히 표현한 Prefix를 사용한다. NS- Prefix 매핑 정보는 DBMS에 저장된 온톨로지 인스턴스들이 네임스페이스 기반으로 표현되어 있고 규칙 등이 Prefix로 기술되어 있는 경우와 같이 서로간의 논리적 그룹 표현 방식이 다른 경우에 이들을 호환시킬 목적으로 사용한다. 도 48은 도 44 또는 도 45에서 DB-트리플 변환 규칙 생성의 일 예를 보인 도면이다. <602> DB-트리플 변환 규칙 생성부는 도 48에서와 같이 DB-클래스 매핑 정보, NS-Prefix 매핑 정보, 스키마 트리플과 <603> 같은 세 가지 정보를 이용하여 'DB-트리플 변환 규칙'(도 48 참조)을 생성한다. 도 49는 도 44 또는 도 45에서 DB-트리플 변환에 의해 생성되는 인스턴스 트리플의 일 예를 보인 도면이다. <604> DB-트리플 변환 규칙을 이용하여 DB-트리플 변환부는 도 49에서와 같이 URI 서버에 저장되어 있는 온톨로지 인 <605> 스턴스를 '인스턴스 트리플'(도 49 참조)로 변환시킨다. 지식 확장 처리부에서의 지식 확장 방법은 위에서 기술한 지식 생성의 결과인 스키마 트리플과 인스턴스 트리플 <606> 을 이용하여 확장 트리플을 생성하는 과정을 보여준다. 도 50은 도 44 또는 도 45에서 지식 확장 규칙 생성에 의해 생성된 스키마 기반 확장 규칙의 일 예를 보인 도면 <607> 이다. 그래서 지식 확장 규칙 생성부는 지식 확장을 위한 규칙을 자동으로 생성하는데, 이때 참조하는 정보는 스키마 <608> 트리플이다. 스키마 트리플을 이용하여 도 50과 같이 '스키마 기반 확장 규칙'을 자동으로 생성한다. 이 방법은 수작업으로 대체할 수도 있다. 즉, 온톨로지 스키마를 분석하여 전문가에 의해 수작업으로 스키마 기반 확장 규 칙을 작성할 수 있다. 도 51은 도 44 또는 도 45에서 사용자정의 확장 규칙의 일 예를 보인 도면이다. <609> 그래서 지식 확장부는 지식 확장 규칙 생성부에 의해 자동 생성된 스키마 기반 확장 규칙과 규칙 기술 전문가가 <610> 기술한 '사용자 정의 확장 규칙'(도 51 참조), 그리고 인스턴스 트리플을 이용하여 확장 트리플을 생성한다. 이 때 추가 지식 확장부를 이용하여 인스턴스 트리플과 스키마 트리플을 참조하여 동적으로 값이 변하는 유형의 확 장 트리플을 추가한다. 예를 들어, '성과 점수'는 성과물이 등록될 때마다 그 점수를 누적시켜야 하며 추가 지 식 확장기가 이러한 역할을 수행한다. 확장 트리플은 결국 인스턴스 트리플을 확장 규칙에 따라 더욱 풍부하게 만든 결과라고 할 수 있다. 또한 지식 <611> 확장부는 추론 엔진에서의 Forward Chaining에 해당하는 방식으로 규칙 해석 및 트리플 추가 생성을 담당하는 모듈이라고 할 수 있다. 이상 기술한 내용은 사용자 질의 이전에 지식을 생성하고 확장하는 방법이다. <612> 한편 사용자 질의가 입력되어 시스템에서 추론되고 그 결과를 생성하는 과정은 추론 서비스 제공부에 의해 주도 <613> 적으로 수행되며, 그 상세 동작은 다음과 같다. 사용자 질의는 SQL(Structured Query Language) 형태일 수도 있지만, 시맨틱 웹에서는 일반적으로 <614> SPARQL(SPARQL Protocol And RDF Query Language)이나 RDQL(RDF Data Query Language) 등의 시맨틱 웹 기반 질 의 기술 언어를 사용한다. DBMS 기반으로 지식이 구축되어 있는 본 시스템에서 사용자 질의를 해석하고 처리하 기 위해서는 질의 변환부를 이용하여 사용자 질의를 SQL로 변환해야 한다. 도 52는 도 44 또는 도 45에서 사용자질의와 질의 변환에 의해 변환된 변환질의의 일 예를 보인 도면이다. <615> 그래서 SQL로 구성된 '변환 질의'(도 52 참조)는 질의 처리부로 전달된다. 질의 처리부는 먼저 캐시 관리부에 <616> 문의하여 해당 질의가 이전에 입력된 적이 있는지를 판단한다. 도 53은 도 44 또는 도 45에서 SQL로 DBMS 기반 확장 트리플에 문의하여 얻어진 질의결과의 일 예를 보인 도면 <617> 이다. 그래서 캐시 관리부는 '질의-결과 목록'으로 구성된 캐시를 참조하여 이전에 입력된 질의인지 판단하고, 그 결 <618> 과를 질의 처리부에 전달한다. 만일 이전에 입력된 질의인 경우 '추론 결과'를 바로 사용자에게 제시할 수 있으 며, 신규로 입력된 질의인 경우에는 '확장 트리플'을 참조하여 '질의 결과'(도 53 참조)를 생성한다. - 52 -공개특허 10-2008-0071213도 54는 도 44 또는 도 45에서 질의결과를 정렬하고 필터링하는 등의 가공에 의해 생성된 후 처리결과의 일 예 <619> 를 보인 도면이다. 그래서 질의 결과는 사용자에게 바로 제시되기 힘든데, 그 이유는 사용자가 보는 사용자 인터페이스에 맞는 형 <620> 태의 질의 결과가 바로 얻어지지 않기 때문이다. 이를 위해 후 처리부를 사용하여 '후 처리 결과'(도 54 참조) 를 생성한다. 도 55는 도 44 또는 도 45에서 URI 서버를 참조하고 후 처리결과를 이용하여 사용자 인터페이스에서 정의된 형 <621> 태의 API로 출력하는 추론결과의 일 예를 보인 도면이다. 그래서 결과 제시부는 후 처리 결과를 이용하여 사용자 인터페이스에 맞도록 메시지와 프로토콜을 생성하는 데, <622> 이 때 특정 URI에 대한 개념-값 관계(Datatype Property, 예. '사람'이라는 개념에서의 Datatype Property는 '인명', '나이', '성별' 등이 있다.)를 획득하기 위해 URI 서버를 참조할 수 있다. 이 결과가 '추론 결과'(도 55 참조)이며 XML 등의 형식 언어로 표현되어 사용자 인터페이스를 담당하는 모듈에 전달된다. 이 장에서의 지식 생성, 지식 확장, 추론 서비스 제공 방법은 위에서 기술한 바와 같이 서로 밀접하게 연결되어 <623> 있으며, 기존 추론 엔진이 불안정적으로 수행하던 추론 서비스를 안정적인 DBMS 기반으로 구현할 수 있게 한다. 5. 지식 정보 공유 서비스 제공 <624> 여기서는 정보 공유/유통을 위한 플랫폼의 구성과 서비스 제공의 예를 설명한다. <625> 5-1. 지식 정보 공유 서비스 - 프레임 서비스 <626> 도 56은 도 3에서 서비스 제공 단계에서 제공되는 지식정보 공유서비스의 예를 보인 도면이다. <627> 그래서 프레임 서비스(OntoFrame-K)에서는 선행기술 동향 파악, 과제평가위원 선정 검색, 지역별 연구 정책 결 <628> 정 검색, 연구자간 협업 연구 검색을 포함한 서비스를 제공한다. 또한 스토어 서비스(OntoStore-k)에서는 특정 성과물 열람, 성과물이 상세 정보 및 관련 정보 검색, 성과물 등 <629> 록, 비성과 정보의 공유 및 공동 문서 작업 수행, 성과물 원문 검색을 포함한 서비스를 제공한다. 또한 씽크 서비스(OntoThink-K)에서는 특정 주제나 분야를 연구하는 연구자 그룹과 전문가 검색, 특정 연구자가 <630> 연구하는 주제와 분야 확인, 특정 주제나 분야를 연구하는 지역과 기관 확인, 여러 연구자들의 성과 추이 비교, 연구자, 기관, 주제에 대한 상세 정보 확인, 통합 연구자 네트워크 확인, 연구자 친밀도 확인을 포함한 서비스 를 제공한다. 도 57은 도 56에서 프레임 서비스 제공 화면의 예를 보인 도면이다. <631> 이러한 프레임 서비스(OntoFrame-K)에서 선행기술 동향 파악은 연구자나 연구팀이 수행하고자 하는 연구 분야의 <632> 성과물을 확인하거나 그 분야에 속한 전문가의 성과물을 살펴봄으로서 분석에 필요한 선행 연구 동향을 파악할 수 있도록 한다. 또한 프레임 서비스(OntoFrame-K) 제공에서 과제 평가 위원 선정 검색은 평가 대상 과제의 분야 전문가를 확인 <633> 하고, 피평가자의 연구제 네트워크를 공저자 관점, 인용 관점으로 분석함으로서 이해 관계에 있는 전문가를 배 제할 수 있도록 한다. 또한 프레임 서비스(OntoFrame-K) 제공에서 지역별 연구정책 결정 검색은 연구 분야 및 유형에 따라 행정 구역 <634> 별로 연구 활성도를 알아볼 수 있도록 처리하고, 연구 수행이 가능한 기관과 연구자를 검색하여 해당 지역에서 육성해야 하는 연구 자원을 파악할 수 있도록 처리한다. 또한 프레임 서비스(OntoFrame-K) 제공에서 연구자 간 협업 연구 검색은 성과물과 연구 자료를 등록할 수 있도 <635> 록 처리하고, 이를 동료 연구자가 확인하고 자료를 수정하거나 추가할 수 있도록 처리함으로써 이력 추적이 가 능한 방식의 협업 성과물을 생산하도록 처리한다. 도 58은 도 57에서 선행연구 동향파악 선택시 동작 예를 보인 흐름도이다. <636> 그래서 프레임 서비스 제공에서 선행연구동향파악에서 주제 선택 단계는 메인 화면에서 주제를 선택하도록 한다 <637> (1.). 또한 연구자 그룹 확인 단계는 연구자 네트워크 선택에 의해 연구자 그룹을 확인하도록 한다. <638> - 53 -공개특허 10-2008-0071213또한 공저자 네트워크 확인 단계는 연구자 그룹 확인 단계 후 연구자 네트워크 선택에 의해 공저자 네트워크를 <639> 확인하도록 한다(3.). 또한 통계정보 선택 단계는 통계정보 선택에 의해 연구자간 비교 및 연구 추이 파악이 수행되도록 한다(4.). <640> 또한 성과정보 선택 단계는 성과정보 선택에 의해 성과 유형별 연구 성과를 제시하도록 한다(5.). <641> 또한 상세보기 선택 단계는 상세보기 선택에 의해 성과 상세보기가 수행되도록 한다(6.). <642> 또한 연구자 정보 선택 단계는 연구자 정보 선택에 의해 인력 상세보기가 수행되도록 한다(7.). <643> 또한 연구 성과 맵 선택 단계는 연구 성과 맵 선택에 의해 지역별 연구 성과 보기가 수행되도록 한다(8.). <644> 또한 기관정보 선택 단계는 기관 정보 선택에 의해 지역별 소속 기관 보기가 수행되도록 한다(9.). <645> 도 59는 도 58에서 메인 화면에서 주제 선택시의 화면 예를 보인 도면이다. <646> 그래서 주제(예를 들면, '에이전트')가 선택되면 주제 입력 및 검색이 수행되도록 한다. <647> 도 60은 도 58에서 연구자 네트워크 선택과 연구자 그룹 확인 화면의 예를 보인 도면이다. <648> 그래서 연구자 네트워크 선택시 연구자 그룹을 공저자 관점에서 출력하고, 해당 분야 전문가를 출력한다. <649> 또한 연구자 네트워크 선택시 시간축에서의 연구자 네트워크를 보여줄 수도 있다. 즉, 어느 시기에는 연구자 네 <650> 트워크가 어떻게 구성되고, 다른 시기에는 연구자 네트워크가 어떻게 구성되어 있는지를 시간축 상에서 시각화 하여 보여줄 수도 있다. 도 61은 도 58에서 연구자 네트워크 선택과 공저자 네트워크 확인 화면의 예를 보인 도면이다. <651> 그래서 연구자 네트워크 선택시 스타(Star) 연구자를 중심으로 한 방사형 연구자 네트워크 또는 다수 연구자가 <652> 동일한 비중을 보인 체인형 연구자 네트워크를 제공한다. 도 62는 도 58에서 통계정보 선택시 연구자 간 비교 및 연구 추이 파악 화면의 예를 보인 도면이다. <653> 그래서 통계정보 선택시 다수 연구자의 성과 추이를 비교하여 해당 분야의 연구 강도가 약화되는 정도와 최근에 <654> 해당 분야 연구가 시작되는 정도를 그래프로 표시한다. 도 63은 도 58에서 성과정보 선택시 성과 유형 별 연구 성과 제시 화면의 예를 보인 도면이다. <655> 그래서 성과정보 선택시 해당 분야 연구 실적을 확인하도록 해당 분야 연구 실적을 제공한다. <656> 도 64는 도 58에서 상세보기 선택시 성과 상세보기 화면의 예를 보인 도면이다. <657> 그래서 상세보기 선택시 URI 기반 개체 관리 정보를 표시하고, 자동 추출된 상위 일정 개수(예를 들면, 상위에 <658> 서 3번째까지)의 주제와 분야를 표시하며, 문서 미리 보기를 통해 해당 논문에 대한 내용을 확인할 수 있도록 표시한다. 도 65는 도 58에서 연구자 정보 선택시 인력 상세보기 화면의 예를 보인 도면이다. <659> 그래서 연구자 정보 선택시 추론에 의해 획득된 인력의 연구 주제와 분야를 표시하고, 국가 과학기술 인력 종합 <660> DB와 연결된 정보를 표시하며, 해당 연구자의 성과 정보를 표시한다. 도 66은 도 58에서 연구 성과 맵 선택시 지역별 연구 성과 보기 화면의 예를 보인 도면이다. <661> 그래서 연구 성과 맵 선택시 광역 단위 또는 시/군/구 단위로 해당 분야의 지역 별 성과 맵을 표시한다. <662> 또한 연구 성과 맵 선택시 시간축에서의 연구 성과 추이를 보여줄 수도 있다. 즉, 어느 시기에는 연구 성과 맵 <663> 이 어떠하고, 다른 시기에는 연구 성과 맵이 어떠한지를 시간축 상에서 시각화하여 보여줄 수도 있다. 도 67은 도 58에서 기관정보 선택시 지역별 소속 기관 보기 화면의 예를 보인 도면이다. <664> 그래서 기관정보 선택시 해당 분야를 연구하는 연구자가 소속된 기관 중 해당 지역에 위치한 기관 정보를 표시 <665> 한다. 5-2. 정보유통 서비스 - 스토어 서비스 <666> 도 68은 도 56에서 정보유통 서비스인 스토어 서비스 제공 화면의 예를 보인 도면이다. <667> - 54 -공개특허 10-2008-0071213그래서 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 특정 성과물 열람을 선택하면, 공통 메뉴에서 원하 <668> 는 주제나 분야, 성과물 유형, 발행년도를 선택한 후, 키워드를 이용해서 검색할 수 있도록 처리하고, 전체, 제 목, 저자로 검색하거나 개인이 소유한 문서를 사용해서 문서를 검색할 수 있도록 처리한다. 또한 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 성과물의 상세 정보 및 관련 정보 검색을 선택하면, <669> 성과물의 메타데이터와 참여인력, 기관에 대한 상세정보를 볼 수 있도록 처리하고, 인력, 기관, 성과물을 선택 한 후에는 관련 추론 서비스로 이동할 수 있도록 처리한다. 또한 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 성과물 등록을 선택하면, 사용자가 로그인을 한 후 <670> 성과물을 등록할 수 있도록 처리하는 것을 특징으로 한다. 또한 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 비성과 정보의 공유 및 공동 문서 작업 수행을 선택 <671> 하면, 비성과 정보를 등록할 때 수정 권한을 사용자에게 부여하여 문서를 공유할 수 있도록 처리하고, 비성과 정보의 이력보기를 통해 문서의 이력정보를 확인할 수 있도록 처리한다. 또한 스토어 서비스(OntoStore-k) 제공 화면에서 사용자가 성과물 원문 검색을 선택하면, 사용자가 로그인을 한 <672> 후 성과물 상세보기에서 원문을 클릭하면 원문을 다운로드 받을 수 있도록 처리하고, 사용자가 다운로드 받은 원문은 전용 뷰어에 의해 볼 수 있도록 처리한다. 5-3. 추론 서비스 - 씽크 서비스 <673> 도 69는 도 56에서 추론 서비스인 씽크 서비스 제공 화면의 예를 보인 도면이다. <674> 그래서 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 특정 주제나 분야를 연구하는 연구자 그룹과 전문가 <675> 검색을 선택하면, 공통 메뉴에서 원하는 주제나 분야를 선택하도록 한 다음 연구자 네트워크에서 해당 분야 연 구자 그룹과 전문가를 확인할 수 있도록 처리하고, 연구자 네트워크로 사용자가 다시 한번 이동하면 특정 연구 자 그룹의 연구자 간 연구 관계를 볼 수 있도록 처리한다. 또한 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 특정 연구자가 연구하는 주제와 분야 확인을 선택하면, <676> 연구자 정보에서 원하는 연구자를 검색한 후 사용자가 클릭하면, 해당 연구자의 연구 주제와 분야를 확인할 수 있도록 처리하고, 성과정보로 이동하면 해당 연구자의 성과물을 성과 유형별로 볼 수 있도록 처리한다. 또한 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 특정 주제나 분야를 연구하는 지역과 기관 확인을 선택 <677> 하면, 공통 메뉴에서 원하는 주제나 분야를 사용자가 선택한 후 연구 성과 맵으로 이동하면 지역별 현황을 볼 수 있도록 처리하고, 특정 지역을 선택한 후 기관정보로 이동하면 관련 기관의 정보를 확인할 수 있도록 처리한 다. 또한 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 여러 연구자들의 성과 추이 비교를 선택하면, 연구자 <678> 네트워크 또는 연구자 정보에서 연구자들을 선택하고, 통계정보로 이동하면, 해당 연구자들의 성과를 그래프를 통해 일정 기간 단위별(예를 들면, 연도별)로 확인할 수 있도록 처리한다. 또한 씽크 서비스(OntoThink-K) 제공 화면에서 사용자가 연구자, 기관, 주제에 대한 상세 정보 확인을 <679> 선택하면, 상기 씽크 서비스 제공 화면에서 연구자, 기관, 주제를 선택하면, 상세보기를 통해 상세 정보를 확인 할 수 있도록 처리한다. 도 70은 도 69에서 씽크 서비스 제공시 초기 화면의 예를 보인 도면이다. <680> 그래서 연구자 네트워크, 연구자 정보, 연구성과맵, 통계정보, 성과정보, 기관정보 등을 확인할 수 있도록 <681> 한다. 도 71은 도 69에서 씽크 서비스 제공시 연구자 네트워크와 공저자 화면의 일 예를 보인 도면이다. <682> 여기서는 전체 369명 중에서 상위 20명에 대한 연구자 그룹(들)을 표시한 예를 보여주고 있다. <683> 도 72는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 공저자 화면의 다른 예를 보인 도면이다. <684> 여기서는 전체 10명을 가진 공저자 네트워크의 출력 예를 보이고 있다. 그래서 각각의 연구자는 다른 연구자와 <685> 어떻게 연결되어 있는지를 시각적으로 용이하게 파악할 수 있게 된다. 또한 연구자 네트워크 선택시 시간축에서의 연구자 네트워크를 보여줄 수도 있다. <686> - 55 -공개특허 10-2008-0071213도 73은 도 69에서 씽크 서비스 제공시 연구자 네트워크와 전문가 화면의 예를 보인 도면이다. <687> 여기서는 전체 369명 중에서 상위 20명의 전문가에 대한 연구자 그룹(들)을 표시한 예를 보여주고 있다. <688> 도 74는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 인용 네트워크 화면의 일 예를 보인 도면이다. <689> 여기서는 전체 369명 중에서 상위 20명의 전문가에 대한 연구자 그룹(들)을 표시한 예를 보여주고 있는 것으로, <690> 각 그룹을 그룹지어 표시하고 있다. 도 75는 도 69에서 씽크 서비스 제공시 연구자 네트워크와 인용 네트워크화면의 다른 예를 보인 도면이다. <691> 그래서 전체 4명을 가진 인용 네트워크를 표시하여 연구자 간에 주제 또는 분야의 인용 관계를 표시하게 된다. <692> 도 76은 도 69에서 씽크 서비스 제공시 연구 성과 맵 화면의 예를 보인 도면이다. <693> 그래서 광역 단위 5등급, 시/군/구 단위 10등급으로 구분했을 경우 성과 규모를 보여주는 연구 성과 맵이 출력 <694> 되어 있다. 이는 전체보기와 개별보기로 구분하여 연구 성과 맵을 보여줄 수 있도록 한다. 또한 시간축에서의 연구 성과 추이를 보여줄 수도 있다. 도 77은 도 69에서 씽크 서비스 제공시 통계정보 화면의 일 예를 보인 도면이다. <695> 여기서는 최대 3명까지의 연구자 간 성과를 비교할 수 있는 통계정보를 막대그래프로 출력한 예를 보여주고 있 <696> 다. 도 78은 도 69에서 씽크 서비스 제공시 통계정보 화면의 다른 예를 보인 도면이다. <697> 그래서 최대 3명까지의 연구자 간 성과를 비교할 수 있는 통계정보를 꺽은선그래프로 출력한 예를 보여주고 있 <698> 다. 도 79는 도 69에서 씽크 서비스 제공시 통계정보 화면의 또 다른 예를 보인 도면이다. <699> 여기서는 최대 3명까지의 연구자 간 성과를 비교할 수 있는 통계정보를 원형그래프로 출력한 예를 보여주고 있 <700> 다. 5-4. 통합 연구자 네트워크 서비스 <701> 도 80은 도 2 및 도 56에서 씽크 서비스 제공시 통합 연구자 네트워크 서비스부에 의한 통합 연구자 네트워크 <702> 서비스 제공 예를 보인 흐름도이다. 그래서 먼저 공저자 네트워크, 인용 네트워크, 학연 네트워크를 구축한다(ST401). <703> 여기서 공저자 네트워크는 논문, 특허, 연구보고서 등의 공저자들이 각각 다른 연구자들과 어떻게 연결되어 있 <704> 는지를 보여주는 네트워크이다. 또한 인용 네트워크는 지식의 구조와 흐름을 파악하기 위한 것으로서, 인용과 피인용의 관계를 이용하여 정보의 흐름을 파악하고 이를 이용하여 특정 지역 및 특정 분야의 지식의 구조와 흐 름을 파악하는데 사용되도록 구축한 것이다. 또한 학연 네트워크는 각각의 연구자들이 학연 속에서 어떻게 연결 되어 있는지를 보여주는 네트워크이다. 그리고 구축된 공저자 네트워크, 인용 네트워크, 학연 네트워크 등의 네트워크를 인력 중심으로 통합하여 통합 <705> 연구자 네트워크를 구축한다(ST042). 본 발명에서는 공저자 네트워크, 인용 네트워크, 학연 네트워크의 세 가지 예를 들었지만, 연구자들이 서로 연 <706> 결되는 항목이라면 해당 항목에 의한 연구자 네트워크로 구축하고, 이를 통합 연구자 네트워크에 결합할 수 있 다. 그런 다음 이렇게 구축된 통합 연구자 네트워크를 이용하여 통합 연구자 네트워크 서비스를 제공하게 된다 <707> (ST403). 5-5. 연구자 친밀도 서비스 <708> 도 81은 도 2 및 도 56에서 씽크 서비스 제공시 연구자 친밀도 서비스부에 의한 연구자 친밀도 서비스 제공 예 <709> 를 보인 흐름도이다. 그래서 먼저 연구자 자료를 수집한다. <710> 이러한 연구자 자료에는 링크 거리, 링크 타입(공저자, 인용, 소속), 주제 또는 분야(인적, 문헌적 주제/분야 <711> - 56 -공개특허 10-2008-0071213등), 성과 유형 가중치(논문 또는 보고서 등), 링크 강도(수량 또는 가중치 등) 등이 포함된다. 여기서 링크 거리는 연구자 네트워크의 인용 네트워크에서 특정 연구자와 다른 연구자 사이에 연결된 링크의 개 <712> 수를 말한다. 또한 링크 타입은 연구자 사이에 연결된 링크가 공저자 관계인가, 인용-피인용 관계인가, 특정 기관이나 지역 <713> 또는 학회에 소속된 관계인가 등을 나타낸다. 또한 주제 또는 분야는 연구자가 연구하는 주제 또는 분야를 말하는 것으로, 인적으로 결합된 주제/분야 또는 <714> 문헌적으로 결합된 주제/분야 등을 말한다. 또한 성과 유형 가중치는 학술대회 논문집, 논문지, 보고서, 특허 등으로 성과가 제출되었을 경우, 각각의 성과 <715> 유형에 대해 가중치를 부여한 것으로서, 연구자 친밀도 계산에 이용되도록 하는 것이다. 또한 링크 강도는 연구자 사이에 연결된 링크에서 인용논문의 수 또는 가중치를 결합하여 설정한 값이다. <716> 이 외에도 연구자 친밀도 계산에 사용하는 정보는 인용 뿐만 아니라 공저자, 학연 등 연구자 인력 사이에서 관 <717> 련된 모든 것들이 포함될 수 있다. 이렇게 연구자 친밀도를 계산하기 위한 필요한 자료들은 지식 처리부에서의 기본적인 가공을 거쳐 연구자 <718> 친밀도 서비스부에서 수집되도록 할 수 있다(ST411). 그런 다음 수집된 자료를 이용하여 연구자 간의 친밀도를 계산한다. <719> 또한 연구자 친밀도 계산은 도 80에 의해 구축된 통합 연구자 네트워크 상에서 수행한다. <720> 이때 친밀도 계산에 사용된 자료들은 링크 거리, 링크 타입, 주제 또는 분야, 성과 유형 가중치, 링크 강도 등 <721> 이 된다. 이들 모두를 결합하여 계산하게 되면, 각각의 연구자들과 연구자 그룹들에 대한 친밀도를 수량화하는 것이 가능하게 된다(ST412). 그리고 계산된 친밀도를 이용하여 시각화를 수행하게 된다. <722> 이는 지역별, 기관별 주제와 분야 추이를 시각화하거나 또는 연구그룹간 지역별, 기관별 협력 연구 추이를 시각 <723> 화하거나 또는 공저자 사이의 관계를 시각화하거나 또는 연구자 사이의 인용-피인용 관계를 시각화하거나 또는 시간축에서의 친밀도를 시각화할 수 있다. 그래서 지역별, 기관별 주제와 분야 추이를 시각화하게 되면, 지역별 또는 기관별 주제/분야에서 친밀도가 높은 <724> 부분을 용이하게 파악할 수 있게 된다. 또한 연구그룹간 지역별, 기관별 협력 연구 추이를 시각화하게 되면, 친밀도가 높은 연구그룹의 경향을 용이하 <725> 게 파악할 수 있게 된다. 또한 공저자 사이의 관계를 시각화하게 되면, 공저자 사이가 단순 연결 관계에 머무르는 것이 아닌 친밀도가 높 <726> 은 공저자와 친밀도가 낮은 공저자를 구분할 수 있게 된다. 또한 연구자 사이의 인용-피인용 관계를 시각화하게 되면, 연구자 사이의 인용-피인용 관계를 용이하게 파악할 <727> 수 있게 된다. 따라서 연구자 중에서 스타형 연구자와 방사형 연구자의 구별이 용이하게 된다. 인용-피인용 관 계를 시각화 하기 이전에는 연구자 사이의 연결 관계만이 표현된다. 그러나 인용-피인용 관계를 화살표를 이용 하여 시각화하게 되면 그 관계 파악이 훨씬 용이하게 된다. 또한 시간축에서의 친밀도를 시각화할 수 있다. 즉, 각각의 시기에 대해 연구자 네트워크에서 연구자 사이의 친 <728> 밀도를 표현하는 것이다. 그러면 어떤 시점에서는 친밀도가 낮다가 이후의 어떤 시점에서는 친밀도가 높아지거 나 또는 어떤 시점에서는 친밀도가 높다가 이후의 어떤 시점에서는 친밀도가 낮아지는 경향을 파악할 수 있게 된다(ST413). 이러한 친밀도 계산 및 시각화를 통해 과거 및 현재의 연구자 네트워크에서의 연구자 사이의 관계를 파악할 수 <729> 있을 뿐만 아니라 미래의 연구 방향 설정 등에서 매우 중요한 자료로 활용할 수 있게 된다. 6. 본 발명에 의한 서비스의 우수성 <730> 6-1. 정보 공유/유통 플랫폼 <731> 본 발명은 정보 공유 유통 플랫폼을 구축하여 서버에서 연구자 간 협업 지원을 위한 연구 성과물의 등록/검색은 <732> - 57 -공개특허 10-2008-0071213물론 성과물에 대한 이력 추적/관리 지원이 가능하고, URI 서버와 연계하여 자료의 정합성을 보장하고, 언어 자 원 및 추론 서비스와 연계하여 성과물에 대한 다양한 부가정보를 제공할 수 있다. 또한 사용자 클라이언트에 대해 연구 성과물의 유통을 지원하기 위한 성과물 보호 기법을 적용하고, 다양한 문 <733> 서 포맷 (Ms-Office, HWP, PDF 등)을 지원하며, 서버와의 연계를 통한 성과물 정보를 제공할 수 있다. 또한 온톨로지 기반 추론 시스템에 의해 추론 규칙을 적용하여 다양한 부가 관계를 생성하고, 이를 효율적으로 <734> 시각화하기 위한 인터페이스 제공할 수 있으며, 대용량의 RDF 트리플 데이터 처리를 위해 DBMS를 저장소로 활용 할 수 있고, 연구자 협업을 위한 연구자 네트워크(공동 연구, 인용 관계, 성과물 별 전문가) 정보를 보여주는 것은 물론 성과물 중심으로 연구자/기관/지역의 연구 동향정보를 제공할 수 있게 된다. 또한 시소러스 기반 주제/분야 분류 시스템에 의해 통제 가능하고 정교한 시소러스를 활용함으로써 주제/분야에 <735> 대한 고품질의 동적 문서 분류를 지원하고, 문서와 언어 자원이 분리된 자동적인 주제/분야 할당을 통한 유지/ 보수의 편리성 및 확장성을 보장한다. 또한 URI 서버에 의해 국가 과학기술 R&D 기반정보 온톨로지에서 자원으로 정의된 연구 인력, 학술 성과, 기관, <736> 지역 등을 KOI(Knowledge Object Identifier) 식별 체계를 중심으로 하여 URI 형태로 관리할 수 있고, URI 서 버를 통하여 가변적인 자원들의 URI를 별도 관리하고 온톨로지에서 분리시킴으로써, 보다 효율적인 온톨로지의 유지/보수가 가능하다. 6-2. 추론 서비스 및 기반 언어 자원 <737> 추론 기반 응용 서비스에 의해 연구자의 연구 수행 전체 과정에서 실질적인 도움을 줄 수 있는 추론 기반 응용 <738> 서비스 제공할 수 있다. 이때 제공되는 추론 기반 응용 서비스에는 공저자, 참여 사업, 인용/피인용 관점에서의 연구자/전문가 네트워크 추적 서비스, 연구자 개인 및 특정 기관의 연구 동향 추적 서비스, 지역별 연구 성과 맵 추적 서비스 등이 포함된다. 또한 국가 과학기술 R&D 기반정보 온톨로지에 의해 논문, 보고서, 지적재산권 등 성과정보를 모델링하기 위한 <739> 온톨로지를 구축할 수 있고, 150여 만개의 국내 최대 규모 대용량 RDF 트리플을 구축할 수 있다. 또한 과학기술 범용 및 IT 분야 시소러스에 의해 시소러스 구축 전주기의 각 단계 별 구축 업무에 대한 체계적 <740> 인 지침 작성이 가능하고, 구축 지침에 따른 체계적인 시소러스 구축을 할 수 있으며, 철저한 의미 제약에 따른 일관적인 계층 관계를 구축할 수 있고, BT(Broader Term, 상위어), NT(Narrower Term, 하위어), RT(Related Term, 관계어), USE(Use, 대체어), UF(Use For Or Synonymous, 용례 혹은 동의어) 등의 다양한 정보를 수용할 수 있게 된다. 범용 과학기술/IT 분야의 분류체계를 연계하여 과제 관리 기관마다 상이한 분류 체계에 따라 분류된 성과물을 <741> 일원화된 분류체계로 재구성할 수 있고, 시소러스를 활용한 자동 주제/분야 분류가 가능하다. 또한 기반 언어 자원 구축을 위한 지원 도구를 제공함으로서, 컴포넌트 기반의 다중 시소러스 구축/관리 지원이 <742> 가능하고, 협업 구축 환경을 지원할 수 있으며, 웹 서비스(Web Services)를 위한 인터페이스를 제공할 수 있다. 7. 본 발명의 기대 효과 <743> 7-1. 기술적 측면 <744> 국가 과학기술 R&D 기반의 정보유통 체제를 효율화 할 수 있게 되어 국가 과학기술 R&D 기반 정보의 표준화 및 <745> 연계/통합에 기반한 효율적인 국가 R&D 관련정보유통 체제의 토대를 마련할 수 있게 된다. 또한 정보의 지식화를 통해 지식 처리의 기반이 되는 대용량의 언어 자원, 전문 용어 사전, 분야 별 시소러스 <746> 및 온톨로지 등을 활용한 국가 과학기술정보의 형식적/내용적 표준화 및 지식화를 위한 기반 마련이 가능하다. 또한 과학기술 언어 자원을 활용한 전문정보 서비스 수행에 요구되는 요소 기능들을 개발함으로써 과학기술 분 <747> 야 뿐만 아니라 국가 전체의 지식 유통 수준을 향상시킬 수 있는 계기를 마련할 수 있게 된다. 또한 지식정보유통 패러다임을 개선하여 정적이고 획일적인 지식의 일방적인 흐름을 탈피하여 역동적이고 상호 <748> 협력적인 과학기술 지식의 생성/가공/서비스 체제의 기틀을 마련할 수 있고, 과학기술 분야의 전문가들로 구성 된 On-line Self-organizing Virtual Research Community가 형성되어 살아 숨 쉬는 과학기술 지식이 생성되고 자발적으로 공유/유통될 수 있는 신개념의 지식정보유통 체제의 토대를 마련할 수 있게 된다. - 58 -공개특허 10-2008-00712137-2. 경제/산업적 측면 <749> 정보 자원 공유 및 정보 서비스의 질적 향상을 통한 국가 경쟁력 강화가 가능하다. <750> 즉, 정보 획득 과정을 효율화하고 신뢰도가 높은 정보를 제공하여, 연구자들의 연구/개발 활동의 생산성을 증대 <751> 시키고, 조사/제안/관리/평가 등과 같은 연구 관리 업무를 획기적으로 효율화함으로써 전반적인 연구/개발 관련 활동의 효율성과 생산성을 향상시켜 궁극적으로는 국가 경쟁력 향상에 일익을 담당할 수 있도록 하게 된다. 또한 지식정보 자원의 효율적인 공유/활용 체제를 기반으로 하여, 이미 구축된 지식정보 자원들에 대한 지속적 <752> 인 공동 연구 및 확장을 통해 지식정보 자원의 고품질화 및 고성능화와 지식정보 자원 개발 공정의 획기적인 단 축을 유도할 수 있게 된다. 또한 시맨틱 웹과 관련된 기반 기술에 대한 연구 및 기술 확보를 통하여 차세대 웹 환경으로의 전이를 용이하게 <753> 함으로써 지식정보 강국으로서의 국가적 위상을 강화시킬 수 있게 된다. 이처럼 본 발명은 차세대 지능형 웹으로 컴퓨터가 정보의 의미를 이해하고 정보들 간의 논리적 추론까지 할 수 <754> 있는 시맨틱 웹 기술을 활용하여 연구 개발 전주기 지원서비스 플랫폼을 구축하여 연구기획에 필요한 연구동향 은 물론이고 최적의 협력 연구자 선정, 지역별/연구분야별 특색에 맞는 정확한 정책수립 등에 필요한 모든 정보 를 효율적으로 파악하게 되는 것이다."}
{"patent_id": "10-2006-0130706", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 살펴본 바와 같이, 본 발명에 의한 시맨틱 웹 기반 연구정보 서비스 시스템 및 그 방법은 차세대 지능 <755> 형 웹으로 컴퓨터가 정보의 의미를 이해하고 정보들 간의 논리적 추론까지 할 수 있는 시맨틱 웹 기술을 활용하 여 연구 개발 전주기 지원서비스 플랫폼을 구축하여 연구기획에 필요한 연구동향은 물론이고 최적의 협력 연구 자 선정, 지역별/연구분야별 특색에 맞는 정확한 정책수립 등에 필요한 모든 정보를 효율적으로 파악할 수 있는 효과가 있게 된다. 또한 본 발명은 기술적 측면에서, 국가 과학기술 R&D 기반의 정보유통 체제를 효율화 할 수 있게 되어 국가 과 <756> 학기술 R&D 기반 정보의 표준화 및 연계/통합에 기반한 효율적인 국가 R&D 관련정보유통 체제의 토대를 마련할 수 있게 되고, 또한 정보의 지식화를 통해 지식 처리의 기반이 되는 대용량의 언어 자원, 전문 용어 사전, 분야 별 시소러스 및 온톨로지 등을 활용한 국가 과학기술정보의 형식적/내용적 표준화 및 지식화를 위한 기반 마련 이 가능하며, 또한 과학기술 언어 자원을 활용한 전문정보 서비스 수행에 요구되는 요소 기능들을 개발함으로써 과학기술 분야 뿐만 아니라 국가 전체의 지식 유통 수준을 향상시킬 수 있는 계기를 마련할 수 있게 되고, 또한 지식정보유통 패러다임을 개선하여 정적이고 획일적인 지식의 일방적인 흐름을 탈피하여 역동적이고 상호 협력 적인 과학기술 지식의 생성/가공/서비스 체제의 기틀을 마련할 수 있고, 과학기술 분야의 전문가들로 구성된 On-line Self-organizing Virtual Research Community가 형성되어 살아 숨 쉬는 과학기술 지식이 생성되고 자 발적으로 공유/유통될 수 있는 신개념의 지식정보유통 체제의 토대를 마련할 수 있게 되는 효과가 있다. 또한 본 발명은 경제/산업적 측면에서, 정보 자원 공유 및 정보 서비스의 질적 향상을 통한 국가 경쟁력 강화가 <757> 가능하다. 즉, 정보 획득 과정을 효율화하고 신뢰도가 높은 정보를 제공하여, 연구자들의 연구/개발 활동의 생 산성을 증대시키고, 조사/제안/관리/평가 등과 같은 연구 관리 업무를 획기적으로 효율화함으로써 전반적인 연 구/개발 관련 활동의 효율성과 생산성을 향상시켜 궁극적으로는 국가 경쟁력 향상에 일익을 담당할 수 있도록 하게 되고, 또한 지식정보 자원의 효율적인 공유/활용 체제를 기반으로 하여, 이미 구축된 지식정보 자원들에 대한 지속적인 공동 연구 및 확장을 통해 지식정보 자원의 고품질화 및 고성능화와 지식정보 자원 개발 공정의 획기적인 단축을 유도할 수 있게 되며, 또한 시맨틱 웹과 관련된 기반 기술에 대한 연구 및 기술 확보를 통하여 차세대 웹 환경으로의 전이를 용이하게 함으로써 지식정보 강국으로서의 국가적 위상을 강화시킬 수 있게 되는 효과가 있다. 이상에서 본 발명의 바람직한 실시예에 한정하여 설명하였으나, 본 발명은 이에 한정되지 않고 다양한 변화와 <758> 변경 및 균등물을 사용할 수 있다. 따라서 본 발명은 상기 실시예를 적절히 변형하여 응용할 수 있고, 이러한 응용도 하기 특허청구범위에 기재된 기술적 사상을 바탕으로 하는 한 본 발명의 권리범위에 속하게 됨은 당연하 다 할 것이다."}
