{"patent_id": "10-2016-0174371", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0071589", "출원번호": "10-2016-0174371", "발명의 명칭": "홍채 인식 기능 운용 방법 및 이를 지원하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "정수룡"}}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제1 카메라 장치;제2 카메라 장치;상기 제1 카메라 장치 및 상기 제2 카메라 장치와 기능적으로 연결된 프로세서;를 포함하고,상기 프로세서는홍채 인식 기능의 실행이 요청되면 상기 제1 카메라 장치를 기반으로 피사체에 대한 제1 영상을 획득하고, 상기획득된 제1 영상에서의 지정된 특징점 관련 정보를 디스플레이에 출력한 후, 상기 피사체와 상기 제1 카메라 장치 간의 촬영 각도에 따라 표시 위치가 변경되는 상기 지정된 특징점 관련 정보가 지정된 조건을 만족하면, 상기 제2 카메라 장치를 기반으로 제2 영상을 획득하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는상기 제1 영상에서 사람 얼굴인지 판단하고, 사람 얼굴이면, 얼굴의 특징점을 추출하거나 또는 얼굴에 포함된눈 영역의 특징점을 추출하고, 추출된 특징점과 관련한 정보가 지정된 조건을 만족하는지 여부를 확인하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는상기 특징점이 디스플레이의 지정된 위치에 인접하거나 지정된 위치에 적어도 일부가 중첩되는지 확인하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는상기 특징점에 대응하는 지시자 객체 및 상기 지시자 객체가 위치하여야 할 타겟 지점 객체를 상기 디스플레이에 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는상기 지시자 객체와 상기 타겟 지점 객체가 적어도 일부 중첩되면 상기 제2 카메라 장치를 기반으로 제2 영상을획득하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,공개특허 10-2018-0071589-3-상기 프로세서는홍채 인식 기능의 실행이 요청되면 상기 제1 카메라 장치 및 제2 카메라 장치를 활성화하도록 설정된 전자장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는상기 지정된 조건이 만족되면 상기 제2 카메라 장치의 영상 촬영과 관련한 주파수 대역의 광을 조사하는 발광부를 활성화하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 프로세서는상기 제1 카메라 장치가 활성화되는 동안 상기 제2 카메라 장치에 포함된 제2 카메라 장치 및 상기 제2 카메라장치 관련 발광부를 비활성화하고, 지정된 조건이 만족되면 상기 발광부 및 상기 제2 카메라 장치를 활성화하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는상기 피사체의 눈 영역을 검출하고, 상기 눈 영역에 대응하는 특징점과 메모리에 저장된 이미지의 눈 영역을 매핑하여 출력하도록 설정된 전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는상기 특징점의 크기 또는 위치 변경에 대응하여 상기 이미지의 표시 위치와 방향을 조정하여 출력하도록 설정된전자 장치."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "홍채 인식 기능의 실행 요청을 수신하는 동작;제1 카메라 장치를 기반으로 피사체에 대한 제1 영상을 획득하는 동작;상기 획득된 제1 영상에서의 지정된 특징점 관련 정보를 디스플레이에 출력하는 동작;상기 피사체와 제1 카메라 장치 간의 촬영 각도에 따라 표시 위치가 변경되는 상기 지정된 특징점 관련 정보가지정된 조건을 만족하면, 상기 제2 카메라 장치 기반으로 제2 영상을 획득하는 동작;을 포함하는 홍채 인식 기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제2 영상을 획득하는 동작은상기 제1 영상에서 사람 얼굴인지 판단하는 동작;사람 얼굴이면, 얼굴의 특징점을 추출하거나 또는 얼굴에 포함된 눈 영역의 특징점을 추출하는 동작;상기 추출된 특징점과 관련한 정보가 지정된 조건을 만족하는지 여부를 확인하는 동작;을 포함하는 홍채 인식공개특허 10-2018-0071589-4-기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 제2 영상을 획득하는 동작은상기 특징점이 디스플레이의 지정된 위치에 인접하거나 지정된 위치에 적어도 일부가 중첩되는지 확인하는동작;을 포함하는 홍채 인식 기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제2 영상을 획득하는 동작은상기 특징점에 대응하는 지시자 객체 및 상기 지시자 객체가 위치하여야 할 타겟 지점 객체를 상기 디스플레이에 출력하는 동작;을 포함하는 홍채 인식 기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제2 영상을 획득하는 동작은상기 지시자 객체와 상기 타겟 지점 객체가 적어도 일부 중첩되면 상기 제2 카메라 장치를 기반으로 제2 영상을획득하는 동작;을 포함하는 홍채 인식 기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 제1 영상을 획득하는 동작은홍채 인식 기능의 실행이 요청되면 상기 제1 카메라 장치 및 제2 카메라 장치를 활성화하는 동작;을 포함하는홍채 인식 기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제2 영상을 획득하는 동작은상기 지정된 조건이 만족되면 상기 제2 카메라 장치의 영상 촬영과 관련한 주파수 대역의 광을 조사하는 발광부를 활성화하는 동작;을 포함하는 홍채 인식 기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 제1 영상을 획득하는 동작은상기 제1 카메라 장치가 활성화되는 동안 상기 제2 카메라 장치에 포함된 제2 카메라 장치 및 상기 제2 카메라장치 관련 발광부를 비활성화하는 동작;을 포함하고, 상기 제2 영상을 획득하는 동작은지정된 조건이 만족되면 상기 발광부 및 상기 제2 카메라 장치를 활성화하는 동작;을 포함하는 홍채 인식 기능운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,공개특허 10-2018-0071589-5-상기 디스플레이에 출력하는 동작은상기 피사체의 눈 영역을 검출하고, 상기 눈 영역에 대응하는 특징점과 메모리에 저장된 이미지의 눈 영역을 매핑하여 출력하는 동작;을 포함하는 홍채 인식 기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 디스플레이에 출력하는 동작은상기 특징점의 크기 또는 위치 변경에 대응하여 상기 이미지의 표시 위치와 방향으로 조정하여 출력하는 동작;을 포함하는 홍채 인식 기능 운용 방법."}
{"patent_id": "10-2016-0174371", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예는 제1 카메라 장치, 제2 카메라 장치, 상기 제1 카메라 장치 및 상기 제2 카메라 장치와 기능 적으로 연결된 프로세서를 포함하고, 상기 프로세서는 홍채 인식 기능의 실행이 요청되면 상기 제1 카메라 장치 를 기반으로 피사체에 대한 제1 영상을 획득하고, 획득된 제1 영상에서의 지정된 특징점 관련 정보를 디스플레이 에 출력한 후, 상기 피사체와 제1 카메라 장치 간의 촬영 각도에 따라 표시 위치가 변경되는 상기 지정된 특징점 관련 정보가 지정된 조건을 만족하면, 상기 제2 카메라 장치 기반으로 제2 영상을 획득하도록 설정된 전자 장치 를 개시한다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2016-0174371", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 홍채 인식 기능에 관한 것이다."}
{"patent_id": "10-2016-0174371", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 스마트폰, 테블릿 PC 등과 같이 다양한 형태의 휴대용 전자 장치의 보급이 확대되고 있다. 이러한 휴대용 전자 장치는 보안 기능과 관련하여 홍채 인식 기능을 지원하고 있다."}
{"patent_id": "10-2016-0174371", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "홍채 인식 기능의 경우, 홍채 인식이 요청되면 IR 카메라 장치를 활성화하여 사용자의 홍채 이미지를 획득하고, 획득된 홍채 이미지가 저장된 정보와 일치하는지 확인할 수 있다. 이러한, 홍채 인식 기능은 사용자의 홍채가 사전 정의된 일정 지점에 일정 크기로 위치하도록 유도하기 위하여, IR 카메라 장치로 획득한 영상을 분석한다. 이때, 상대적으로 촬영 각도가 협소한 IR 카메라 장치로 홍채 영역을 검출하는 것이 어렵고, 획득된 IR 영상을 기반으로 홍채 영역을 검출하는데 상대적으로 많은 로드를 필요로 하여 영상 분석에 많은 시간이 소요될 수 있 고, 정확도 또한 상대적으로 낮을 수 있다. 본 발명의 다양한 실시예들은 전원 절약 또는홍채 인식 속도 개선이 가능한 홍채 인식 기능 운용 방법 및 이를 지원하는 전자 장치를 제공하고자 한다."}
{"patent_id": "10-2016-0174371", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른 전자 장치는 제1 카메라 장치, 제2 카메라 장치, 상기 제1 카메라 장치 및 상 기 제2 카메라 장치와 기능적으로 연결된 프로세서를 포함하고, 상기 프로세서는 홍채 인식 기능의 실행이 요청 되면 상기 제1 카메라 장치를 기반으로 피사체에 대한 제1 영상을 획득하고, 상기 획득된 제1 영상에서의 지정 된 특징점 관련 정보를 디스플레이에 출력한 후, 상기 피사체와 상기 제1 카메라 장치 간의 촬영 각도에 따라 표시 위치가 변경되는 상기 지정된 특징점 관련 정보가 지정된 조건을 만족하면, 상기 제2 카메라 장치를 기반 으로 제2 영상을 획득하도록 설정될 수 있다. 본 발명의 다양한 실시 예에 따른 홍채 인식 기능 운용 방법은 홍채 인식 기능의 실행 요청을 수신하는 동작, 제1 카메라 장치를 기반으로 피사체에 대한 제1 영상을 획득하는 동작, 상기 획득된 제1 영상에서의 지정된 특 징점 관련 정보를 디스플레이에 출력하는 동작, 상기 피사체와 제1 카메라 장치 간의 촬영 각도에 따라 표시 위 치가 변경되는 상기 지정된 특징점 관련 정보가 지정된 조건을 만족하면, 상기 제2 카메라 장치 기반으로 제2 영상을 획득하는 동작을 포함할 수 있다."}
{"patent_id": "10-2016-0174371", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 다양한 실시 예들은 홍채 인식 속도를 개선할 수 있고, 전원 소모를 줄일 수 있는홍채 인식 기능을 운용할 수 있도록 지원할 수 있다.또한, 다양한 실시 예들은 지정된 주파수 대역의 광을 발광하는 발광부에 의한 깜박임을 최소화하여, 상기 깜박 임에 의한 사용자 불편함을 줄일수 있다. 또한, 다양한 실시 예들은 얼굴 특징점을 기준으로 사용자 기호에 맞는 다양한 UI를 생성 및 제공할 수 있다."}
{"patent_id": "10-2016-0174371", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 다양한 실시 예에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/ 또는 중요도에 상관없이 수식할 수 있고, 해당 구성요소들을 한정하지 않는다. 상기 표현들은 한 구성요소를 다 른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중 요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 발명의 권리 범위를 벗어나지 않으 면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다.본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도 록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만 을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장 치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 기술 분야에서 통 상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전 에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있 으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우 에 따라서, 본 문서에서 정의된 용어일지라도 본 발명의 실시 예들을 배제하도록 해석될 수 없다. 본 발명의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 전자 장치는 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상 전화기, 전자북 리더기(e-book reader), 데 스크탑 PC (desktop PC), 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라 모듈, 또는 웨어러블 전자 장치(wearable device)(예: 스마트 안경, 머리 착용형 장치(head-mounted- device(HMD)), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 스마트 미러, 또는 스마트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예 를 들면, 텔레비전, DVD 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(예: Xbox™, PlayStation™), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트 (infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things)(예: 전구, 각종 센서, 전 기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동 기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 발명의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치 (예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 실시 예에 따른 홍채 인식 환경의 한 예를 나타낸 도면이다. 도 1을 참조하면, 본 발명의 홍채 인식 환경은 눈 영역을 포함하는 사용자의 얼굴에 대응하는 영상을 전자 장치의 제1 카메라 장치 예컨대, RGB 카메라 장치를 이용하여 획득하고, 획득된 제1 영상 예컨 대, RGB 영상이 지정된 조건을 만족하면, 제2 카메라 장치 예컨대, IR 카메라 장치(예: IR 카메라 및 상기 제2 카메라 장치의 영상 촬영과 관련한 지정된 주파수 대역의 광을 조사하는 발광부 예컨대, IR 발광부 를 기반으로 눈 영역에 대한 제2 영상 예컨대, IR 영상을 획득하여 홍채 인식 기능을 수행할 수 있다. 이를 기반으로, 본 발명의 홍채 인식 환경은 IR 카메라 장치에 비하여 지정된 기준치 이하의 저전력으로 운용 가능하며 특징점 검출에 대한 정확도가 높은 RGB 카메라 장치를 이용하여 홍채 영역 검출을 위한 영 상 분석과, 홍채 영역 추적 등을 수행할 수 있다. 또한, 본 발명의 홍채 인식 환경은 IR 카메라 장치에 비 하여 상대적으로 연산 처리 속도가 높은 RGB 카메라 장치를 기반으로 홍채 영역과 관련한 분석 및 추적을 수행함으로써, 보다 빠른 응답 속도를 제공할 수 있다. 또한, 본 발명의 홍채 인식 환경은 RGB 카메라 장치 를 이용하여 얼굴에 포함된 다양한 특징점 분석을 수행함으로써, 이를 기반으로 대체 가능한 다양한 이미 지를 홍채 인식 기능에 적용할 수 있다. 한 실시 예에 따르면, 홍채 인식 환경에서 전자 장치는 홍채 인식 기능 실행과 관련한 메뉴나 아이콘을 제 공할 수 있다. 또는, 전자 장치는 홍채 인식 기능 실행과 관련한 음성 인식 기능을 제공하고, 수집된 음성 중 홍채 인식 기능 실행과 관련한 명령어를 추출할 수도 있다. 또는, 전자 장치는 지정된 어플리케이션(예: 락 스크린 해제, 금융 기능 실행, 프라이버시와 관련한 정보 또는 파일 검색 기능 실행 등 보 안 관련 기능이 적어도 일부 적용된 어플리케이션) 실행 시, 홍채 인식 기능을 실행할 수 있다. 상기 전자 장치는 홍채 인식 기능의 실행이 요청되면, RGB 카메라 장치를 활성화하여, RGB 영상(예: RGB 프리뷰 영상)을 획득할 수 있다. 상기 전자 장치는 획득된 RGB 프리뷰 영상을 분석하여 적어도 하나의 특징점들을 추출할 수 있다. 상기 전자 장치는 추출된 특징점들을 기반으로 사람 얼굴인지 확인하고, 사람 얼굴로 판단되면, 눈 영역의 특징점들을 추출할 수 있다. 상기 전자 장치는 눈 영역에 대응하는 특징점들이 추출되면, 이미지의 눈 영역이 디스플레이 상의 지정된 지점에 위치하도록 가이드 정 보를 출력할 수 있다. 이와 관련하여, 전자 장치는 디스플레이 영역에 RGB 프리뷰 영상을 기반으로 검출한 눈 영역을 지시하는 지시자 및 지시자가 위치하여야 할 타겟 지점 객체를 출력할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 홍채 인식과 관련한 어플리케이션 정보 영역을 홍채 UI의 제 1 영역에 출력하고, 상기 지시자 및 상기 타겟 지점 객체는 홍채 인식 기능 실행과 관련하여 제 공된 홍채 UI의 제2 영역에 출력될 수 있다. 상기 전자 장치는 눈 영역에 대응하는 지시자가 지정된 지점(예: 타겟 지점 객체 기준 일정 거리 이내)에 배치되는 경우, IR 카메라 장치를 활성화하여, 홍채 인식을 수행할 수 있다. 이 동작에서, 전자 장치는 IR 카메라 장치가 획득한 IR 영상(예: 홍채 이미지에 해당하는 IR 프리뷰 영상 또는 IR 정지 영상)에서, 홍채 특징점을 추출하고, 추출된 홍채 특징점과 메모리에 저장된 정보를 비교하여, 홍채 인식 동작을 처리할 수 있다. 상기 전자 장치는 홍채 인식이 성공하면, 지정된 기능을 실행할 수 있다. 도 2는 본 발명의 실시 예에 따른 전자 장치 구성의 한 예를 나타낸 도면이다. 도 2를 참조하면, 본 발명의 실시 예에 따른 전자 장치는 입력 장치, 프로세서, 메모리, RGB 카메라 장치 및 IR 카메라 장치를 포함하며, 디스플레이 등을 더 포함할 수 있다. 추가적으 로, 상기 전자 장치는 통신 회로, 센서 등을 더 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 입력 장치는 사용자 입력에 대응하는 입력 신호를 생성할 수 있 는 적어도 하나의 수단 또는 적어도 하나의 사용자 인터페이스를 포함할 수 있다. 한 실시 예에 따르면, 상기 입력 장치는 홍채 인식 기능 실행과 관련한 물리 버튼을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 입력 장치는 홍채 인식 기능 실행과 관련한 터치 키 또는 터치 스크린 디스플레이 패널을 포함할 수 있다. 이 경우, 상기 입력 장치는 홍채 인식 기능 실행과 관련한 아이콘이 표시된 디스플레이를 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 메모리는 전자 장치 운용과 관련한 적어도 하나의 응용 프 로그램을 저장할 수 있다. 한 실시 예에 따르면, 상기 메모리는 RGB 카메라 장치 및 IR 카메라 장치 운용과 관련한 카메라 응용 프로그램을 포함할 수 있다. 상기 카메라 응용 프로그램은 예컨대, 홍채 인식 기능의 실행 요청 시 RGB 카메라 장치를 활성화하는 명령어 셋, RGB 카메라 장치가 획득한 RGB 프리 뷰 영상 또는 RGB 정지 영상을 분석하여 얼굴 및 눈 영역을 검출하는 명령어 셋, 검출된 정보를 기반으로 지정 된 UI를 출력하는 명령어 셋을 포함할 수 있다. 또한 상기 카메라 응용 프로그램은 검출된 정보와 지정된 UI 사 이의 매칭 결과에 따라 IR 카메라 장치를 활성화하는 명령어 셋, IR 카메라 장치가 획득한 IR 프리뷰영상 또는 IR 정지 영상을 기반으로 홍채 인식 기능을 처리하는 명령어 셋을 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 RGB 카메라 장치는 RGB 카메라 및 RGB 카메라 제어기 를 포함할 수 있다. 상기 RGB 카메라는 전자 장치의 케이스 일측에 렌즈가 노출되도록 배치될 수 있 다. 상기 RGB 카메라는 상기 IR 카메라 및 IR 발광부가 배치된 면과 동일한 면에 배치될 수 있다. 한 실시 예에 따르면, 상기 RGB 카메라는 디스플레이가 배치된 전자 장치의 전면 일측(예: 상단 일측)에 배치될 수 있다. 상기 RGB 카메라는 RGB 카메라 제어기로부터의 제어 신호에 대응하여, 활성화 또는 비활성화될 수 있다. 상기 RGB 카메라는 홍채 인식 기능과 관련하여 활성화되면, RGB 프리뷰 영상을 획득하고, 획득된 RGB 프리뷰 영상을 RGB 카메라 제어기 또는 프로세서에 전달할 수 있다. 상기 RGB 카메라가 획득한 RGB 프리뷰 영상은 디스플레이에 출력될 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 RGB 카메라 제어기는 상기 RGB 카메라 구동과 관련한 제어 신호의 공급을 처리할 수 있다. 또한, 상기 RGB 카메라 제어기는 RGB 카메라가 획득한 프리뷰 영상의 처리를 제어할 수 있다. 이러한 RGB 카메라 제어기는 예컨대, 상기 프로세서의 적어도 일부로 구성될 수 있다. 또는, 상기 RGB 카메라 제어기는 별도의 독립된 프로세서가 마련되고, 상기 프로세서와 통 신하여 상기 RGB 카메라 제어를 수행할 수 있다. 상기 RGB 카메라 제어기는 홍채 인식 기능의 실행이 요청되면(예: 프로세서 또는 입력 장치로부터 홍채 인식 기능의 실행 요청을 수신), RGB 카메라(14 1)를 활성화할 수 있다. 이 동작에서 상기 RGB 카메라 제어기는 IR 카메라 제어기에 IR 카메라 활성화를 요청할 수 있다. 상기 RGB 카메라와 IR 카메라는 동시에 활성화될 수도 있다. 본 발명의 다양한 실시예에 따르면, 상기 RGB 카메라 제어기는 RGB 카메라가 획득한 RGB 프리뷰 영상 을 분석하여, 얼굴 특징점 또는 눈 영역 특징점을 추출할 수 있다. 상기 RGB 카메라 제어기는 추출된 얼굴 특징점 또는 눈 영역 특징점을 기반으로, 지정된 UI를 출력할 수 있다. 상기 지정된 UI의 적어도 일부는 메모리 에 사전 저장될 수 있다. 한 실시 예에 따르면, 상기 지정된 UI는 사용자가 지정한 특정 사진 이미지, 또 는 외부 서버로부터 수신된 사진 이미지, 특정 애니메이션 캐릭터 이미지 등을 기반으로 생성될 수 있다. 상기 RGB 카메라 제어기는 추출된 얼굴 특징점 또는 눈 영역 특징점(이하 눈 영역 특징점 기준으로 설명)이 화 면 상에 지정된 위치에 배치되면(예: 지정된 특징점이 디스플레이의 일정 위치에 배치되도록 촬영 각도 또 는 피사체가 움직임), IR 카메라 장치 활성화와 관련한 제어 신호를 IR 카메라 장치에 전달할 수 있 다. 다양한 실시 예에 따르면, 상기 RGB 카메라 제어기는 눈 영역 특징점과 관련한 지정된 조건(예: 디스 플레이 화면 영역에서 지정된 지점에 눈 영역에 해당하는 지시자가 위치하는 조건)을 만족하면, IR 발광부를 활성화하도록 제어하고, 홍채 인식 기능을 수행하도록 IR 카메라 제어기에 요청할 수 있 다. 본 발명의 다양한 실시예에 따르면, 상기 IR 카메라 장치는 IR 카메라 및 IR 발광부, IR 카메라 제어기를 포함할 수 있다. 상기 IR 카메라는 IR 발광부에서 조사된 광을 기반으로 홍채와 관련한 IR 영상을 획득하고, 획득된 IR 영상을 IR 카메라 제어기 또는 프로세서에 전달할 수 있다. 이 동작 에서 상기 IR 카메라는 예컨대, 홍채 관련 사용자의 눈 영역에 관한 IR 프리뷰 영상(예: 적외선 파장을 기 반으로 획득한 프리뷰 영상)을 IR 카메라 제어기에 제어에 따라 획득할 수 있다. 또는, IR 카메라는 IR 카메라 제어기의 제어기에 따라, IR 프리뷰 영상 중에 홍채 영역이 지정된 크기 이상으로 획득되는지 확인하고, 홍채 영역이 지정된 크기 이상으로 획득되면, 홍채에 대한 IR 정지 영상을 획득할 수 있다. IR 발광부는 RGB 카메라 제어기 또는 IR 카메라 제어기 중 어느 하나의 제어에 따라, 지정된 파 장의 광을 조사할 수 있다. 예컨대, IR 발광부는 RGB 카메라가 획득한 프리뷰 영상이 지정된 조건을 만족하는 경우, RGB 카메라 제어기 제어(또는 IR 카메라 제어기 제어)에 따라 발광할 수 있다. 본 발명의 다양한 실시예에 따르면, IR 카메라 제어기는 IR 발광부의 발광 시점 제어 및 IR 카메라 의 IR 영상(예: IR 프리뷰 영상 또는 IR 정지 영상) 획득을 제어하거나, IR 프리뷰 영상 또는 IR 정지 영 상(적외선 파장 기반으로 획득한 정지 영상)의 획득을 제어할 수 있다. 한 실시 예에 따르면, IR 카메라 제어기 는 RGB 카메라 제어기로부터 홍채 인식 실행을 요청 받으면, IR 발광부를 활성화하여 지정된 파 장대의 광을 조사하도록 제어할 수 있다. 이와 함께, IR 카메라 제어기는 IR 카메라를 기반으로 IR 프리뷰 영상 또는 IR 정지 영상을 획득하고, 획득된 IR 프리뷰 영상 또는 IR 정지 영상을 분석할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 IR 카메라 제어기는 예컨대, RGB 카메라 제어기로부터 홍채 인식 기능의 실행이 요청되면, IR 발광부 활성화 및 IR 카메라 기반의 IR 정지 영상 획득을 처리할 수 있다. 또는, IR 카메라 제어기는 IR 카메라가 획득한 IR 프리뷰 영상을 기반으로 홍채 크기를 판단하고, 홍채 크기가 지정된 크기 이상인 경우 해당 IR 프리뷰 영상을 기반으로 홍채 인식 기능을 처리할 수 있다. 또는, IR 카메라 제어기는 홍채 크기가 지정된 크기 이상인 IR 프리뷰 영상이 획득되면, IR 정지 영상을 획득하고, 획득된 IR 정지 영상에 포함된 홍채 이미지를 분석할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 IR 카메라 제어기는 메모리에 사전 저장된 홍채 이미지와 현재 획득된 홍채 이미지를 비교 분석할 수 있다. 예컨대, IR 카메라 제어기는 메모리에 사전 저장된 홍채 이미지 관련 특징점 또는 홍채 특징점으로 마련된 모델 정보와, 현재 획득된 홍채 이미지 관련 특징점 또 는 특징점으로 생성된 모델 정보를 상호 비교 분석할 수 있다. 비교 결과, 유사율이 지정된 기준 값 이상인 경 우, IR 카메라 제어기는 홍채 인식 성공을 처리하고, 처리 결과를 프로세서에 전달할 수 있다. 다양한 실시 예에 따르면, 상기 IR 카메라 제어기는 프로세서의 적어도 일부로 구성되거나, 또는 프 로세서와 독립된 다른 프로세서로 구현될 수 있다. 이에 따라, IR 카메라 제어기는 IR 발광부 및 IR 카메라의 활성화를 제어하고, IR 카메라 기반의 홍채 인식과 관련한 처리(예: IR 프리뷰 영상 획 득 또는 IR 정지 영상 획득, 홍채 이미지 분석 등)는 프로세서에서 처리될 수도 있다. IR 카메라 제어기 로부터 홍채 인식 성공에 관한 정보를 수신하면, 프로세서는 지정된 기능 실행(예: 락스크린 해제, 보안 설정된 갤러리 기능이나 금융 결재 실행)을 처리할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 디스플레이는 전자 장치 운용과 관련한 적어도 하나의 화면 을 출력할 수 있다. 예컨대, 상기 디스플레이는 사용자 입력에 대응하여 락 스크린 등을 출력할 수 있다. 또는, 상기 디스플레이는 보안 설정된 어플리케이션의 실행 요청 화면을 출력할 수 있다. 디스플레이(16 0)는 보안 설정된 화면 해제 또는 보안 설정된 기능 실행을 위해 홍채 인식 기능 처리에 관한 화면을 출력할 수 있다. 예컨대, 디스플레이는 홍채 인식 기능 처리와 관련하여 프리뷰 영상의 적어도 일부 및 지정된 UI를 출력할 수 있다. 상기 디스플레이는 IR 카메라가 획득한 IR 프리뷰 영상 또는 IR 정지 영상을 출력할 수 있다. 상기 디스플레이는 홍채 인식 실패 또는 성공에 관한 메시지를 출력할 수 있다. 상기 디스플레이 는 홍채 인식 성공 시, 프로세서 제어에 대응하여 지정된 기능 실행 화면을 출력할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 프로세서는 전자 장치의 기능 제어와 관련한 신호의 전달과 처리를 수행할 수 있다. 한 실시 예에 따르면, 상기 프로세서는 홍채 인식 기능의 실행 요청에 대응하여, RGB 카메라의 활성화, IR 카메라 및 IR 발광부의 활성화를 제어하고, 활성화된 카메라들을 기반 으로 홍채 인식 기능을 실행할 수 있다. 이와 관련하여, 프로세서는 도 3에 도시된 바와 같은 구성을 포함 할 수 있다. 도 3은 본 발명의 실시 예에 따른 프로세서 구성의 한 예를 나타낸 도면이다. 도 3을 참조하면, 본 발명의 실시 예에 따른 프로세서는 RGB 카메라 제어 모듈, UI 처리 모듈, IR 카메라 제어 모듈을 포함할 수 있다. 상술한 적어도 하나의 모듈들 중 적어도 일부는 적어도 하나의 하드웨 어 프로세서들로 구현될 수 있다. 또는, 상기 적어도 하나의 모듈들은 메모리에 로드되고, 상기 프로세서 에 의해 실행되는 적어도 하나의 명령어 셋들을 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 RGB 카메라 제어 모듈은 RGB 카메라 운용과 관련한 신호 처 리를 수행할 수 있다. 예컨대, RGB 카메라 제어 모듈은 RGB 카메라 운용과 관련한 신호를 RGB 카메라 제어기에 전달할 수 있다. 또는, 상기 RGB 카메라 제어 모듈의 적어도 일부는 상술한 RGB 카메라 제어 기에 대응될 수 있다. 이 경우, RGB 카메라 제어 모듈은 RGB 카메라를 직접 제어 할 수 있다. 상 기 RGB 카메라 제어 모듈은 홍채 인식 기능의 실행이 요청되면, RGB 카메라를 활성화하고 RGB 프리뷰 영상을 획득할 수 있다. 상기 RGB 카메라 제어 모듈은 획득된 RGB 프리뷰 영상에 대한 특징점 추출 및 분석 을 수행할 수 있다. 이와 관련하여, 상기 RGB 카메라 제어 모듈은 특징점 인식부를 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 특징점 인식부는 획득된 RGB 프리뷰 영상에 대한 특징점을 추출할 수 있다. 상기 특징점 인식부는 추출된 특징점들이 지정된 특징점들(예: 사람의 얼굴에 대응하는 특징점 들)에 매칭되는지 확인할 수 있다. 상기 특징점 인식부는 얼굴 특징점으로 판단되면, 눈 영역에 대응하는 특징점들을 추출할 수 있다. 상기 특징점 인식부는 추출된 특징점들에 대한 정보를 UI 처리 모듈에 전 달할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 UI 처리 모듈은 특징점 인식부로부터 수신된 특징점들에 대한 정보를 기반으로 지정된 UI를 출력할 수 있다. 또한, UI 처리 모듈은 특징점들의 위치가 출력된 UI의 지정 된 위치에 배치되는지 확인할 수 있다. 이와 관련하여, 상기 UI 처리 모듈은 UI 변환부 및 UI 매칭부를 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 UI 변환부는 설정에 따라 예컨대, 상기 특징점들의 위치를 기반으 로 특정 이미지를 출력할 수 있다. 예컨대, 상기 UI 변환부는 메모리에 사전 저장된 눈을 포함한 이미 지(예: 사전 저장된 특정 얼굴 사진 또는 캐릭터 등의 이미지)를 수집할 수 있다. 상기 UI 변환부는 특징점 들을 기반으로 수집한 이미지를 변경할 수 있다. 예컨대, UI 변환부는 특징점들의 분포에 대응하도록 상기 수집된 이미지의 크기나 표시 방향, 표시 위치 등을 변경할 수 있다. 상기 UI 변환부는 별도의 설정이 없는 경우(예: 메모리에 저장된 이미지 수집 설정이 없는 경우), 현재 촬영되고 있는 사용자 얼굴을 디스플레이 에 일정 위치에 출력할 수 있다. 또는, UI 변환부는 RGB 프리뷰 영상 기반의 UI(예: 디스플레이 전체 영역에 표시되는 화면)를 IR 영상 기반의 홍채 UI(예: 어플리케이션 정보 영역과 눈 영역에 대응하는 지시 자 매칭 영역을 포함하는 화면)로 변환할 수 있다. 이와 관련하여, UI 변환부는 지시자 및 타겟 지점 객체의 상대적 좌표를 계산(예: 디스플레이 전체 영역에 표시되던 지시자 및 타겟 지점 객체 를 홍채 UI의 일부 영역에 표시하기 위한 스케일 변경)을 수행할 수 있다. 이 동작에서, UI 변환부는 홍채 인식과 관련한 어플리케이션 정보(예: 어플리케이션 실행과 관련한 이미지 등)를 획득하고, 어플리케이션 정보 영역을 디스플레이의 일부 영역에 출력할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 UI 매칭부는 UI 변환부로부터 수신된 이미지(예: 지정 이미지 또는 캐릭터 이미지) 또는 변경된 이미지(예: 홍채 UI 화면)를 디스플레이의 특정 위치에 표시할 수 있다. UI 매칭부는 특징점 인식부로부터 수신된 특징점들에 대응하는 지시자를 디스플레이의 일정 영역에 출력할 수 있다. 또는, UI 매칭부는 지시자가 위치되어야 할 타겟 지점 객체를 디스플레 이에 출력할 수 있다. 사용자는 지시자가 타겟 지점 객체와 중첩되도록 전자 장치(또는 RGB 카 메라의 촬영 방향)를 움직이거나 자신이 움직일 수 있다. 전자 장치 또는 피사체가 움직이면, 사용자 를 촬영하는 RGB 카메라의 촬영 방향이 변경되고, 이에 따라, 디스플레이 상에 표시되는 사용자의 눈 영역 이미지에 대응하는 지시자의 위치가 변경될 수 있다. 지시자가 타겟 지점 객체와 적어도 일부가 중첩되면, UI 매칭부는 지정된 제어 신호(예: 홍채 인식을 요청하는 신호)를 IR 카메라 제어 모듈 에 전달할 수 있다. 본 발명의 다양한 실시예에 따르면, IR 카메라 제어 모듈은 IR 카메라 장치 운용과 관련한 신호 처리 를 수행할 수 있다. 상기 IR 카메라 제어 모듈의 적어도 일부는 상술한 IR 카메라 제어기에 대응될 수 있다. 상기 IR 카메라 제어 모듈은 UI 매칭부로부터 홍채 인식 관련 제어 신호를 수신하면, IR 발광부 를 활성화하여 지정된 파장대의 광이 조사되도록 제어할 수 있다. 다양한 실시 예에 따르면, 상기 IR 발광 부는 RGB 카메라 제어 모듈에 의해 활성화될 수도 있다. 이 경우, 상기 IR 카메라 제어 모듈은 IR 카메라를 활성화하고, 피사체에 대한 IR 프리뷰 영상 또는 IR 정지 영상을 획득할 수 있다. 상기 IR 카메 라 제어 모듈은 획득된 IR 프리뷰 영상 또는 IR 정지 영상에서 홍채 영역에 대한 홍채 인식을 수행할 수 있 다. 이와 관련하여, IR 카메라 제어 모듈은 홍채 인식부를 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 상기 홍채 인식부는 획득된 IR 프리뷰 영상 또는 IR 정지 영상에서 눈 영역을 확인하고, 상기 눈 영역에서 홍채 이미지를 획득할 수 있다. 상기 홍채 인식부는 획득된 홍채 이미 지에 대한 특징점 추출을 수행하고, 메모리에 사전 저장된 기준 정보와 비교할 수 있다. 이 동작에서, 상 기 홍채 인식부는 현재 추출된 특징점과 메모리에 저장된 기준 정보에 포함된 특징점들을 비교할 수 있다. 또는, 상기 홍채 인식부는 추출된 특징점들을 기반으로 모델링을 수행하고, 기준 정보에 포함된 기준 모델과 비교할 수 있다. 상기 홍채 인식부는 현재 수집된 정보(예: 현재 수집된 특징점들 또는 모델링 정보)와 기준 정보 비교 결과에 따라, 홍채 인식 실패 또는 성공을 결정할 수 있다. 상기 홍채 인식부는 홍 채 인식이 실패할 경우, 홍채 인식 실패에 대응하는 메시지 출력(예: 홍채 인식 실패를 지시하는 오디오 정보 및 비디오 정보 중 적어도 하나를 출력)할 수 있다. 홍채 인식부는 홍채 인식이 성공한 경우, 지정된 기능 실행을 처리할 수 있다. 예컨대, 홍채 인식부는 홍채 인식 기능의 실행을 요청한 어플리케이션(예: 금융 관 련 어플리케이션, 락스크린 어플리케이션 등 보안 설정된 어플리케이션)을 실행할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 전자 장치는 제1 카메라 장치(예: RGB 카메라 장치), 제2 카메라 장치(예: IR 카메라 장치), 상기 제1 카메라 장치 및 상기 제2 카메라 장치와 기능적으로 연결된 프로세 서를 포함하고, 상기 프로세서는 홍채 인식 기능의 실행이 요청되면 상기 제1 카메라 장치를 기반으로 피사체에 대한 제1 영상(예: RGB 영상)을 획득하고, 상기 획득된 제1 영상에서의 지정된 특징점 관련 정보를 디스플레이 에 출력한 후, 상기 피사체와 상기 제1 카메라 장치 간의 촬영 각도에 따라 표시 위치가 변경되는 상기 지정된 특징점 관련 정보가 지정된 조건을 만족하면, 상기 제2 카메라 장치를 기반으로 제2 영상(예: IR 영상)을 획득하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 제1 영상에서 사람 얼굴인지 판단하고, 사람 얼굴이면, 얼굴의 특징점을 추출하거나 또는 얼굴에 포함된 눈 영역의 특징점을 추출하고, 추출된 특징점과 관련한 정보가 지정된 조건을 만족하는지 여부를 확인하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 특징점이 디스플레이의 지정된 위치에 인접하거나 지정된 위치 에 적어도 일부가 중첩되는지 확인하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 특징점에 대응하는 지시자 객체 및 상기 지시자 객체가 위치하 여야 할 타겟 지점 객체를 상기 디스플레이에 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지시자 객체와 상기 타겟 지점 객체가 적어도 일부 중첩되면 상기 제2 카메라 장치를 기반으로 제2 영상을 획득하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 홍채 인식 기능의 실행이 요청되면 상기 제1 카메라 장치 및 제2 카 메라 장치를 활성화하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 지정된 조건이 만족되면 상기 제2 카메라 장치의 영상 촬영과 관련한 주파수 대역의 광을 조사하는 발광부를 활성화하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 제1 카메라 장치가 활성화되는 동안 상기 제2 카메라 장치에 포함된 제2 카메라 장치 및 상기 제2 카메라 장치 관련 발광부를 비활성화하고, 지정된 조건이 만족되면 상기 발광부 및 상기 제2 카메라 장치를 활성화하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 피사체의 눈 영역을 검출하고, 상기 눈 영역에 대응하는 특징 점과 메모리에 저장된 이미지의 눈 영역을 매핑하여 출력하도록 설정될 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 상기 특징점의 크기 또는 위치 변경에 대응하여 상기 이미지의 표시 위치와 방향을 조정하여 출력하도록 설정될 수 있다. 도 4는 본 발명의 실시 예에 따른 홍채 인식 기능 운용 방법의 한 예를 나타낸 도면이다. 도 4를 참조하면, 홍채 인식 기능 운용 방법과 관련하여, 동작 401에서, 임의의 이벤트가 발생하면, 전자 장치 의 프로세서는 홍채 인식 기능 실행과 관련한 이벤트 발생인지 확인할 수 있다. 예컨대, 전자 장치 의 메모리에 저장된 적어도 하나의 어플리케이션들 중에 보안 설정된 어플리케이션 실행이 요청되면, 상기 프로세서는 홍채 인식 기능 실행과 관련한 이벤트 발생으로 판단할 수 있다. 한 실시 예에 따르면, 상기 프로세서는 락 스크린이 디스플레이에 출력되면 홍채 인식 기능의 실행을 요청한 이벤트 발생으 로 판단할 수 있다. 발생한 이벤트가 홍채 인식 기능 실행과 관련한 이벤트가 아니면, 동작 403에서, 프로세서는 해당 이벤트 의 종류에 따른 지정된 기능을 실행할 수 있다. 예컨대, 프로세서는 이벤트 종류에 따라 통화 기능을 수행 하거나, 사진 촬영 기능을 수행하거나 또는 웹 서핑 기능 등을 수행할 수 있다. 홍채 인식 기능 실행과 관련한 이벤트가 발생하면, 동작 405에서, 프로세서(예: RGB 카메라 제어 모듈)는 RGB 카메라 장치를 기반으로 특징점 검출을 수행할 수 있다. 한 실시 예에 따르면, 상기 프로세서는 예컨대, RGB 카메라 장치를 기반으로 획득된 RGB 프리뷰 영상을 분석하여, 사람 얼굴과 관련한 특징점들이 검출되는지 확인할 수 있다. 사람 얼굴과 관련한 특징점들이 검출되면, 상기 프로세서는 얼굴 영역 중 눈 영역에 대응하는 특징점들을 검출할 수 있다. 이 동작을 수행하면서, 상기 프로세서는 획득된 RGB 프리뷰 영상을 기반으로 디스플레이에 지정된 UI를 출력할 수 있다. 한 실시 예에 따르면, 지정된 UI는 홍채 인식 기능과 관련한 어플리케이션 정보 영역 및 이미지의 눈 영역을 화면 일정 위치에 매칭시키도록 하는 타겟 지점 객체가 포함된 화면 영역을 포함할 수 있다. 동작 407에서, 프로세서(예: RGB 카메라 제어 모듈)는 검출된 특징점들이 지정된 조건을 만족하는지 확인할 수 있다. 검출된 특징점들이 지정된 조건을 만족하지 못하는 경우, 동작 409 단계를 스킵할 수 있다. 상기 지정 된 조건은 검출된 특징점들의 디스플레이 상에 표시되는 위치가 지정된 지점(예: 눈 영역에 해당하는 특징 점들이 상기 타겟 지점 객체와 적어도 일부가 중첩되는 지점)에 위치하는 조건을 포함할 수 있다. 또는, 상기 지정된 조건은 검출된 특징점들이 지정된 지점에 표시되데 지정된 크기 범위에 속하는 조건(예: 눈 영역에 해당하는 특징점들이 타겟 지점 객체로부터 일정 거리 이내에 위치하는 조건)을 포함할 수 있다. 사용자는 상기 지정된 조건 만족을 위하여 전자 장치 또는 피사체(예: 사용자 얼굴)를 움직여서 RGB 카메 라의 촬영 방향 및 촬영 거리 중 적어도 하나를 조정할 수 있다. 예컨대, 사용자는 RGB 카메라를 향 한 사용자 얼굴 방향 조정 또는 사용자 얼굴을 향한 RGB 카메라의 주시 방향 조정, RGB 카메라와 사 용자 얼굴과의 거리 등을 조정할 수 있다. 상술한 동작에서, 상기 프로세서는 사용자의 얼굴 조정 방향이 나 조정 거리에 대응하는 가이드 정보를 출력할 수 있다. 예컨대, 프로세서는 사용자의 얼굴을 좌측이나 우측으로 회전을 요청하는 가이드 정보, 아래로 숙이거나 턱을 들어 올리도록 요청하는 가이드 정보, 사용자 얼 굴과 RGB 카메라 장치 간의 적정 거리 유지를 위해 전자 장치의 전방 이동 또는 후방 이동 거리를 안 내하는 가이드 정보 등을 출력할 수 있다. 상기 프로세서는 사용자의 얼굴 이동이나 전자 장치 이동에 따라, 상기 지시자의 위치를 변경하 고, 상기 프로세서는 상기 지시자가 타겟 지점 객체와 중첩되거나 타겟 지점 객체로부터 지정된 거리 이내에 위치하는 경우, 지정된 조건 만족으로 판단할 수 있다. 이 동작에서, 상기 프로세서는 지정된 조건 만족에 따른 안내 정보를 출력할 수 있다. 예컨대, 상기 프로세서는 상기 지시자 및 타 겟 지점 객체 중 적어도 하나의 색 또는 모양 중 적어도 하나를 변경할 수 있다. 또는, 상기 프로세서 는 지정된 조건 만족을 지시하는 오디오 정보나 진동, 램프 등을 출력할 수 있다. 검출된 특징점들이 지정된 조건을 만족하는 경우, 동작 409에서, 프로세서(예: IR 카메라 제어 모듈)는 IR 카메라 장치 기반 홍채 인식 및 처리를 수행할 수 있다. 예컨대, 프로세서는 홍채 이미지 획득 및 비 교 분석을 수행하고, 홍채 인식 성공 또는 실패에 대한 안내 정보를 출력할 수 있다. 홍채 인식 성공 시, 상기 프로세서는 지정된 어플리케이션 실행을 처리할 수 있다. 홍채 인식 실패 시, 상기 프로세서는 홍채 이미지를 포함하는 IR 영상을 다시 획득하고, 비교하는 작업을 지정된 횟수 동안 반복할 수 있다. 지정된 횟수 동안 홍채 인식 실패 시, 상기 프로세서는 턴-오프 상태로 천이할 수 있다. 이후, 프로세서는 설정된 정책에 따라, 홍채 인식 기능을 재실행하거나, 비밀번호 입력 또는 지문 입력 등의 다른 인증 방법과 관련한 화 면 인터페이스를 출력할 수도 있다. 동작 411에서, 프로세서는 홍채 인식 기능 종료와 관련한 이벤트 발생이 있는지 확인할 수 있다. 홍채 인 식 기능 종료와 관련한 이벤트 발생이 없는 경우, 프로세서는 이전 상태에 따라 동작 409 이전으로 분기하 거나 동작 405 이전으로 분기하고, 이후 동작을 재수행할 수 있다. 도 5는 본 발명의 실시 예에 따른 UI 출력 동작을 포함하는 홍채 인식 기능 운용 방법의 한 예를 나타낸 도면이 다. 도 5를 참조하면, 본 발명의 홍채 인식 기능 운용 방법과 관련하여, 동작 501에서, 프로세서는 홍채 인식 기능 실행과 관련한 사용자 입력 또는 설정된 이벤트를 수신할 수 있다. 예컨대, 프로세서는 홍채 인식 기 능과 관련한 아이콘이나 메뉴 또는 홍채 인식 기능과 관련된 어플리케이션을 실행할 수 있는 아이콘 등을 디스 플레이에 출력할 수 있다. 해당 아이콘 선택 시, 프로세서는 홍채 인식 기능의 실행을 요청하는 이벤 트 발생으로 판단할 수 있다. 또는, 프로세서는 락스크린 해제 요청을 홍채 인식 기능의 실행 요청으로 판 단할 수 있다. 홍채 인식 기능의 실행이 요청되면, 동작 503에서, 프로세서는 RGB 카메라 장치를 활성화할 수 있다. 프로세서는 RGB 카메라가 획득한 RGB 프리뷰 영상을 분석할 수 있다. 동작 505에서, 프로세서는 얼굴 특징점이 인식되는지 확인할 수 있다. 얼굴 특징점이 인식되지 않는 경우, 프로세서는 동작 507에서 홍채 인식 기능 종료와 관련한 이벤트 발생이 있는지 확인할 수 있다. 홍채 인식 기능 종료와 관련한 이벤트 발생이 없으면, 프로세서는 동작 505 이전으로 분기하여 이하 동작을 재수행할 수 있다. 홍채 인식 기능 종료와 관련한 이벤트 발생이 있으면, 프로세서는 홍채 인식 기능을 종료하면서 RGB 카메라 장치를 비활성화하고, 지정된 기능으로 복귀할 수 있다. 얼굴 특징점이 인식되면, 동작 509에서, 프로세서는 지정된 UI를 디스플레이에 출력할 수 있다. 상기 지정된 UI는 얼굴 중 특정 영역 예컨대, 눈 영역에 대응하는 지시자와, 상기 지시자를 매칭해야 할 타겟 지점 객체를 포함하는 화면 인터페이스를 포함할 수 있다. 지시자와 타겟 지점 객체가 일 치되지 않는 경우, RGB 카메라의 촬영 방향, 촬영 거리 중 적어도 하나를 변겨하는 경우 지시자가 디 스플레이 상에 표시되는 위치가 변경될 수 있다. 동작 511에서, 프로세서는 지정된 UI와 관련한 지정된 조건이 만족되는지 확인할 수 있다. 예컨대, 프로세 서는 상기 지시자와 상기 타겟 지점 객체가 적어도 일부 중첩되는지 확인할 수 있다. 또는, 프로세서는 지시자가 타겟 지점 객체를 기준으로 일정 거리 이내에 위치하는지 확인할 수 있다. 상기 프로세서는 지정된 UI와 관련한 지정된 조건이 만족되지 않으면, 동작 513에서, 홍채 인식 기능 종료 와 관련한 이벤트 발생이 있는지 확인할 수 있다. 홍채 인식 기능 종료와 관련한 이벤트 발생이 없으면, 프로세 서는 동작 509 이전으로 분기하여 지정된 UI 출력 상태를 유지할 수 있다. 홍채 인식 기능 종료와 관련한 이벤트가 발생하면, 프로세서는 홍채 인식 기능을 종료하면서 RGB 카메라 장치를 비활성화하고, 지정 된 UI 출력을 중지할 수 있다. 또는, 프로세서는 지정된 기능 상태로 복귀할 수 있다. 지정된 UI와 관련한 지정된 조건이 만족되면, 동작 515에서, 프로세서는 IR 카메라 장치를 활성화할 수 있다. 예컨대, 프로세서는 IR 발광부를 제어하여 지정된 광을 출력하고, IR 카메라를 이용하 여 IR 프리뷰 영상 또는 IR 정지 영상을 획득할 수 있다. 동작 517에서, 프로세서는 홍채 인식이 되었는지 확인할 수 있다. 홍채 인식이 된 경우, 동작 519에서, 프 로세서는 인식 관련 기능을 수행할 수 있다. 이 동작에서, 프로세서는 IR 프리뷰 영상에서 획득된 홍 채 이미지와 메모리에 사전 저장된 정보 비교를 통하여 홍채 인식을 수행할 수 있다. 홍채 인식에 실패한 경우, 동작 521에서, 프로세서는 홍채 인식 기능 종료와 관련한 이벤트 발생이 있는지 확인할 수 있다. 홍채 인식 기능 종료 이벤트가 발생하지 않으면, 프로세서는 동작 517 상태로 분기하여, 홍채 인식 동작을 재수행할 수 있다. 도 6은 본 발명의 실시 예에 따른 홍채 인식 기능 운용과 관련한 IR 카메라 활성화 방법의 한 예를 설명하는 도 면이다. 도 6을 참조하면, 본 발명의 IR 카메라 활성화 방법과 관련하여, 동작 601에서, 프로세서는 홍채 인식 기 능의 실행 요청을 수신할 수 있다. 이에 대응하여, 동작 603에서, 프로세서는 RGB 카메라 장치 및 IR 카메라를 활성화할 수 있다. 상기 프로세서는 활성화된 IR 카메라는 대기 상태를 유지하고, RGB 카메라 장치를 기반으로 RGB 프리뷰 영상을 획득할 수 있다. 동작 605에서, 프로세서는 RGB 카메라 장치를 기반으로 획득된 RGB 영상이 지정된 조건을 만족하는지 확인할 수 있다. 예컨대, 프로세서는 RGB 프리뷰 영상에서 검출된 눈 영역(또는 홍채 영역)의 표시 위치 (또는 눈 영역이나 홍채 영역에 대응하는 지시자의 표시 위치)가 지정된 타겟 지점 객체의 위치와 동 일 또는 타겟 지점 객체로부터 일정 거리 이내에 위치한 상태인지를 판단할 수 있다. 획득된 RGB 영상이 지정된 조건을 만족하는 경우, 동작 607에서, 프로세서는 IR 발광부를 활성화할 수 있다. 한 실시 예에 따르면, 상기 RGB 카메라 장치에 포함된 RGB 카메라 제어기 또는 RGB 카메라 제 어 모듈은 IR 발광부를 제어하여 지정된 파장대의 광을 조사하도록 제어할 수 있다. 이와 관련하여, 상 기 전자 장치는 상기 RGB 카메라 제어기 또는 RGB 카메라 제어 모듈 및 상기 IR 발광부 사이 에 신호 라인을 더 포함하고, 상기 RGB 카메라 제어기 또는 RGB 카메라 제어 모듈은 상기 IR 발광부 의 턴-온 또는 턴-오프 제어와 관련한 신호를 상기 신호 라인을 통해 전달할 수 있다. 동작 609에서, IR 카메라가 획득한 IR 영상을 기반으로 프로세서는 홍채 인식이 성공하는지 확인할 수 있다. IR 발광부로부터 지정된 파장대의 광이 조사된 후, IR 카메라는 사용자의 눈 영역 또는 홍채 영역에서 반사되는 적외선 광을 수집하여 IR 프리뷰 영상 또는 IR 정지 영상을 획득할 수 있다. 프로세서 는 수집된 IR 프리뷰 영상 또는 IR 정지 영상에서의 홍채 영역 정보와 메모리에 사전 저장된 정보를 비교 하여 홍채 인식을 처리할 수 있다. 홍채 인식이 성공하면, 동작 611에서, 프로세서는 설정 기능을 수행할 수 있다. 예컨대, 프로세서는 홍채 인식 기능의 실행을 요청한 어플리케이션의 종류에 따라, 락 스크린을 해제하거나, 금융 관련 어플리케이 션을 실행하거나 또는 결제 처리를 수행할 수 있다. 동작 613에서, 프로세서는 홍채 인식과 관련한 기능 종료 이벤트가 발생하는지 확인할 수 있다. 홍채 인식 과 관련한 기능 종료 이벤트가 발생하지 않으면, 프로세서는 이전 상태에 따라 동작 605, 동작 609, 동작 611 이전 상태로 분기하고, 이후 동작을 재수행할 수 있다. 홍채 인식 관련 기능 종료 이벤트가 발생하면, 프로 세서는 지정된 기능으로 복귀하거나 지정된 상태(예: 슬립 상태 등)로 복귀할 수 있다. 상술한 동작을 기반으로, 본 발명의 실시 예에 따른 전자 장치는 지정된 조건이 만족되었을 때, IR 카메라 를 활성화하는데 소요되는 시간을 절감하여 보다 빠른 홍채 인식을 처리할 수 있다. 이와 함께, 상기 전자 장치는 IR 발광부를 지정된 조건 만족 시 활성화함으로써, IR 발광부의 발광에 소모되는 전원 소모를 줄일 수 있고, IR 발광부에서 지정된 파장대의 광을 조사하면서 사용자의 시야에 불편함(예: 적외선 색상에 대한 거부감)을 줄일 수 있다. 도 7은 본 발명의 실시 예에 따른 홍채 인식 기능 운용과 관련한 IR 카메라 활성화 방법의 다른 예를 설명하는 도면이다. 도 7을 참조하면, 본 발명의 IR 카메라 활성화 방법과 관련하여, 동작 701에서, 프로세서는 홍채 인식 기 능의 실행 요청을 수신할 수 있다. 동작 703에서, 프로세서는 RGB 카메라 장치, IR 카메라 및 IR 발광부를 활성화할 수 있다. 이 동작에서, 프로세서는 RGB 카메라 장치를 통해 획득되는 영상 을 분석하고, IR 발광부 및 IR 카메라는 전원이 공급되면서 대기 상태로 유지할 수 있다. 이 동작에서, 프로세서는 IR 카메라 장치 기반의 홍채 인식과 관련한 프로세싱을 수행하지 않도록 제어 하여, 불필요한 전원 소모를 억제할 수 있다. 동작 705에서, 프로세서는 RGB 카메라 장치를 통해 획득된 RGB 영상이 지정된 조건을 만족하는지 확 인할 수 있다. 상기 지정된 조건은 예컨대, 사용자 얼굴 또는 얼굴의 특정 영역이 디스플레이 상에서 특정 위치에 배치되는 상태를 포함할 수 있다. 이러한 지정된 조건은 앞서 설명한 바와 같이, 눈 영역 또는 홍채 영 역, 또는 그에 대응하는 지시자가 사전 지정된 타겟 지점 객체에 적어도 일부가 중첩되는 조건을 포 함할 수 있다. 획득된 RGB 영상이 지정된 조건을 만족하는 경우, 동작 707에서, 프로세서는 홍채 인식 및 설정 기능 처리 를 수행할 수 있다. 동작 709에서, 프로세서는 홍채 인식과 관련한 기능 종료 이벤트가 발생하는지 확인할 수 있다. 홍채 인식과 관련한 기능 종료 이벤트가 발생하지 않으면, 프로세서는 이전 상태에 따라 동작 705 및 동작 707 이전 상태로 분기하고, 이후 동작을 재수행할 수 있다. 홍채 인식 관련 기능 종료 이벤트가 발 생하면, 프로세서는 지정된 기능으로 복귀하거나 지정된 상태(예: 슬립 상태 등)로 복귀할 수 있다. 상술한 다양한 실시 예에 따르면, 한 실시 예에 따른 홍채 인식 기능 운용 방법은 홍채 인식 기능의 실행 요청 을 수신하는 동작, 제1 카메라 장치를 기반으로 피사체에 대한 제1 영상을 획득하는 동작, 상기 획득된 제1 영 상에서의 지정된 특징점 관련 정보를 디스플레이에 출력하는 동작, 상기 피사체와 제1 카메라 장치 간의 촬영 각도에 따라 표시 위치가 변경되는 상기 지정된 특징점 관련 정보가 지정된 조건을 만족하면, 상기 제2 카메라 장치 기반으로 제2 영상을 획득하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제2 영상을 획득하는 동작은 상기 제1 영상에서 사람 얼굴인지 판단하는 동작, 사람 얼굴이면, 얼굴의 특징점을 추출하거나 또는 얼굴에 포함된 눈 영역의 특징점을 추출하는 동작, 상기 추출 된 특징점과 관련한 정보가 지정된 조건을 만족하는지 여부를 확인하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제2 영상을 획득하는 동작은 상기 특징점이 디스플레이의 지정된 위치에 인접하 거나 지정된 위치에 적어도 일부가 중첩되는지 확인하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제2 영상을 획득하는 동작은 상기 특징점에 대응하는 지시자 객체 및 상기 지시 자 객체가 위치하여야 할 타겟 지점 객체를 상기 디스플레이에 출력하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제2 영상을 획득하는 동작은 상기 지시자 객체와 상기 타겟 지점 객체가 적어도 일부 중첩되면 상기 제2 카메라 장치를 기반으로 제2 영상을 획득하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제1 영상을 획득하는 동작은 홍채 인식 기능의 실행이 요청되면 상기 제1 카메 라 장치 및 제2 카메라 장치를 활성화하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제2 영상을 획득하는 동작은 상기 지정된 조건이 만족되면 상기 제2 카메라 장 치의 영상 촬영과 관련한 주파수 대역의 광을 조사하는 발광부를 활성화하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 제1 영상을 획득하는 동작은 상기 제1 카메라 장치가 활성화되는 동안 상기 제2 카메라 장치에 포함된 제2 카메라 장치 및 상기 제2 카메라 장치 관련 발광부를 비활성화하는 동작을 포함하고, 상기 제2 영상을 획득하는 동작은 지정된 조건이 만족되면 상기 발광부 및 상기 제2 카메라 장치를 활성화하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 상기 디스플레이에 출력하는 동작은 상기 피사체의 눈 영역을 검출하고, 상기 눈 영 역에 대응하는 특징점과 메모리에 저장된 이미지의 눈 영역을 매핑하여 출력하는 동작을 포함할 수 있다.다양한 실시 예에 따르면, 상기 디스플레이에 출력하는 동작은 상기 특징점의 크기 또는 위치 변경에 대응하여 상기 이미지의 표시 위치와 방향으로 조정하여 출력하는 동작을 포함할 수 있다. 도 8은 본 발명의 실시 예에 따른 홍채 인식 기능과 관련한 RGB 카메라 장치 기반의 화면 인터페이스 출력 방법 을 설명하는 도면이다. 도 8을 참조하면, 전자 장치의 RGB 카메라 장치가 RGB 프리뷰 영상을 획득하는 경우, 전자 장치(10 0)의 프로세서는 801 화면에서와 같은 RGB 프리뷰 영상에 대응하는 RGB UI 화면을 출력할 수 있다. 이때, RGB UI 화면은 디스플레이 전체 영역에 RGB 프리뷰 영상에 대응하는 화면을 표시할 수 있다. 상기 RGB UI 화면은 제1 좌표(X, Y) 계로 정의될 수 있다. 전자 장치의 프로세서는 RGB 프리뷰 영상에서 얼굴 영역 검출과, 눈 영역 검출(또는 홍채 영역 검출)을 수행할 수 있다. 한 실시 예에 따 르면, 전자 장치의 프로세서는 눈 영역을 검출하면, 해당 눈 영역에 대한 RGB UI 화면 에서의 좌표(X`, Y`)를 추출할 수 있다. RGB UI 화면을 기준으로 할 경우, 홍채 인식 영역(예: 사용자의 눈 영역이 위치하여야 할 영역)은 도시된 바와 같이 지정된 타겟 지점 영역(예: Z, W)에 해당할 수 있다. 상기 전자 장치는 상술한 RGB UI 화면을 803 화면에서와 같이 홍채 인식과 관련한 변환 UI로 변 환하여 출력할 수 있다. 변환 UI 생성 과정에서, 전자 장치의 프로세서는 X축 및 Y축을 일정 함 수 비율(예: G(x), F(y))로 변환한 후, 디스플레이의 제1 영역에 출력할 수 있다. 801 화면에서의 프 리뷰 영상이 803 화면에서의 변환 UI로 변경됨에 따라, 눈 영역은 눈 변환 영역으로 변환될 수 있다. 상기 눈 변환 영역의 좌표는 예컨대, (G(x`), F(y`))에 대응할 수 있다. 상술한 좌표 변환 함수 (G(x), F(y))는 설계자의 의도에 따라 변경될 수 있다. 변환 UI 출력에 따라, 이전 홍채 인식 영역 또한 도시된 바와 같이 홍채 인식 변환 영역으로 대체될 수 있다. 도시된 도면에서는 비율 변화에 따라, 디스플레이 상에서 홍채 인식 변환 영역이 홍채 인식 영역 보다 상단에 위치할 수 있는 상태를 나타낸 것이다. 다양한 실시 예에 따르면, 상기 전자 장치의 프로세서는 디스플레이의 제2 영역에 홍채 인 식 기능 실행과 관련한 어플리케이션 관련 화면을 출력할 수 있다. 도시된 도면에서는, 락 스크린 해제를 위해 홍채 인식 기능의 실행 요청에 따라, 락 스크린의 적어도 일부를 제2 영역에 표시한 상태를 나타낸 것이다. 제2 영역에 표시된 락 스크린은 디스플레이 전체 화면에 표시된 형태를 일정 비율로 조절한 형태를 포함할 수 있다. 상기 전자 장치의 프로세서는 사용자 설정에 따라 801 화면에서와 같은 UI를 제공하거나 또는 803 화 면에서와 같은 변환 UI를 출력할 수 있다. 또는 다양한 실시 예에 따르면, RGB 카메라 장치를 이용하 여 사용자의 얼굴을 검출하고, 눈 영역이 홍채 인식 영역으로부터 지정된 거리 이내에 위치하여 IR 카메라가 활성화되는 경우, 803 화면에서와 같은 변환 UI가 출력될 수도 있다. 상술한 동작 수행과 관련하여, 전자 장치의 프로세서는 홍채 인식 영역(예: IR 카메라 인식 각 도)과 RGB 카메라 장치 영역 간의 정렬을 제공하고, RGB 카메라 장치 기반 얼굴 특징점의 동적 좌표 를 산출할 수 있다. 상기 프로세서는 홍채 인식 영역 대비 최종 변환 UI 상의 홍채 인식 변환 영역의 변환 함수(F, G)를 사용하여 RGB 카메라 장치로 인지한 눈 영역 또는 얼굴 특징점 좌표를 평 면 상대 좌표(예: 홍채 인식과 관련한 축소 영역(예: 제1 영역에 해당하는 좌표)로 변환한 후, 변환된 상 태 좌표를 기반으로 변환 UI를 표시할 수 있다. 또는, 앞서 설명한 바와 같이, 프로세서는 RGB 카메 라 장치를 기반으로 획득된 프리뷰 영상을 전체 화면으로 출력하되, IR 카메라 인식 각도를 기준으로 획득된 프리뷰 영상에서의 눈 영역 및 얼굴 영역을 표시할 수 있다. 이 경우, 프로세서는 디스플레이 전체 영역을 기준으로 사용자의 눈 영역 또는 얼굴의 특징점을 매칭할 타겟 지점 객체를 출력할 수 있다. 상기 프로세서는 RGB 카메라 장치의 촬영 각도 변화(예: 전자 장치의 RGB 카메라 장치 촬영 방 향 변경을 위해 전자 장치를 회전시키거나 이동시키는 변화)에 대응하여 눈 영역 또는 얼굴의 특징점, 또 는 이에 대응하는 지시자의 표시 위치를 변경하여 타겟 지점 객체와 일치되면, IR 발광부 및 IR 카메라 를 기반으로 홍채 인식을 수행할 수도 있다. 도 9는 본 발명의 실시 예에 따른 UI 변환과 관련한 한 예를 나타낸 도면이다. 도 9를 참조하면, 전자 장치의 프로세서는 홍채 인식 기능의 실행 요청에 대응하여 RGB 카메라 장치 를 활성화하여, RGB 프리뷰 영상을 획득할 수 있다. 상기 프로세서는 RGB 프리뷰 영상에서 눈 영역또는 얼굴의 특징점 추출을 수행하면서, 필터링 또는 경계선 추출 등을 통하여 획득된 프리뷰 영상의 실루엣 정 보를 획득할 수 있다. 이를 기반으로, 프로세서는 901 화면에서와 같이 실루엣 이미지 및 지정된 특 징점 정보를 표시할 수 있다. 상기 지정된 특징점 정보는 RGB 프리뷰 영상에서 획득된 복수의 특징점 들 중에 눈 영역에 대응하는 특징점들을 포함할 수 있다. 상기 지정된 특징점 정보는 다른 특징점들과 다 르게 표시되거나 그룹핑될 수 있다. 상기 전자 장치의 프로세서는 실루엣 이미지 및 지정된 특징점 정보를 지정된 시간 동안 디스플레이에 표시하다가, 상기 실루엣 이미지를 대체하여 메모리에 저장된 지정 이미지를 출력할 수 있다. 상기 지정 이미지는 예컨대, 사용자 설정에 따라 홍채 인식 기능에서 사용되도록 설정된 이미지를 포함할 수 있다. 예컨대, 상기 지정 이미지는 유명인 등 특정 인물 사진이 될 수 있다. 또는, 상 기 지정 이미지는 갤러리에 저장된 다양한 인물 사진 중 사용자가 지정한 특정 인물 사진이나 그림 등이 될 수 있다. 또는, 상기 지정 이미지는 현재 RGB 카메라 장치가 촬영하고 있는 사용자 본인과 관련한 사진 또는 현재 사진이 될 수 있다. 지정 이미지를 출력하면서, 프로세서는 상기 지정된 특징점 정보를 지정 이미지와 매핑할 수 있다. 이 동작에서, 지정된 특징점 정보를 지정 이미지에 매핑하기 위하여, 지정 이미지를 변경할 수 있다. 한 실시 예에 따르면, 지정된 특징점 정보가 눈 영역에 해당하는 정보인 경우, 지정 이미 지의 눈 영역이 상기 지정된 특징점 정보와 일치하도록(또는 지정된 허용 오차 범위 내에서 일치하도 록) 조정할 수 있다. 예컨대, 프로세서는 지정 이미지의 눈 영역의 크기 또는 눈 영역의 간격 등을 조정하여 지정된 특징점 정보와 일치되도록 조정할 수 있다. 도 10은 본 발명의 실시 예에 따른 UI 변환과 관련한 다른 예를 나타낸 도면이다. 도 10을 참조하면, 앞서 도 9에서 설명한 바와 같이 전자 장치의 프로세서는 홍채 인식 기능의 실행 요청에 대응하여 RGB 카메라 장치를 활성화하여, RGB 프리뷰 영상을 획득할 수 있다. 상기 프로세서 는 RGB 프리뷰 영상에서 눈 영역 또는 얼굴의 특징점 추출을 수행하면서, 필터링 또는 경계선 추출 등을 통하여 획득된 프리뷰 영상의 실루엣 정보를 획득할 수 있다. 이를 기반으로, 프로세서는 1001 화면에서와 같이 실루엣 이미지 및 지정된 특징점 정보를 표시할 수 있다. 상기 전자 장치의 프로세서는 실루엣 이미지 및 지정된 특징점 정보를 지정된 시간 동안 표시하다가, 상기 실루엣 이미지를 대체하여 메모리에 저장된 캐릭터 이미지를 출력할 수 있 다. 상기 캐릭터 이미지는 예컨대, 사용자 설정에 따라 홍채 인식 기능에서 사용되도록 설정된 이미지를 포함할 수 있다. 상기 캐릭터 이미지는 서버 등으로부터 수신하거나 다른 외부 전자 장치로부터 수신된 이미지일 수 있다. 또는, 상기 캐릭터 이미지는 사용자가 작성한 이미지를 포함할 수 있다. 상기 캐릭터 이미지를 출력하면서, 상기 프로세서는 캐릭터 이미지의 크기 또는 방향을 조정 하여, 지정된 특징점 정보와 매핑할 수 있다. 예컨대, 상기 프로세서는 지정된 특징점 정보에 대응하는 캐릭터 이미지의 일정 영역(예: 지정된 특징점 정보가 눈 영역인 경우, 캐릭터 이미지 의 눈 영역)의 크기나 표시 방향 또는 형태가 지정된 특징점 정보에 일치되도록(또는 지정된 허용 오차 내에서 일치되도록) 조정할 수 있다. 추가적으로, 상기 프로세서는 캐릭터 이미지를 출력하면 서, 지정된 특징점 정보가 위치하여야 할 타겟 지점 객체를 디스플레이에 출력할 수 있다. 상술한 도 9 및 도 10에서는 실루엣 이미지(910, 1010)와 지정된 특징점 정보(911, 1011)를 먼저 출력한 후, 지 정 이미지 또는 캐릭터 이미지를 출력하는 형태로 설명하였으나, 본 발명이 이에 한정되는 것은 아 니다. 예컨대, 상기 프로세서는 RGB 카메라 장치가 획득한 프리뷰 영상에서 지정된 특징점 정보가 추 출되면, 실루엣 이미지의 출력 단계를 거치지 않고 지정된 특징점 정보에 맞는 지정 이미지 또는 캐 릭터 이미지를 출력할 수 있다. 또한, 상기 프로세서는 지정 이미지 또는 캐릭터 이미지를 출력하고 있는 상태에서, 전자 장치 의 RGB 카메라 장치 촬영 방향이나 거리가 변경되면, 지정 이미지 또는 캐릭터 이미지의 표시 크기가 표시 방향을 변경할 수 있다. 이 동작에서, 상기 프로세서는 RGB 카메라 장치를 통해 획 득된 프리뷰 영상을 기반으로 실시간 또는 일정 주기로 이미지 분석을 수행하여 얼굴 특징점 추출 또는 눈 영역 추출을 유지할 수 있다. 도 11은 본 발명의 실시 예에 따른 UI 매칭의 한 예를 나타낸 도면이다. 도 11을 참조하면, 전자 장치의 프로세서는 홍채 인식 기능의 실행이 요청되면, RGB 카메라 장치를 활성화하여 RGB 프리뷰 영상을 획득하고, 1101 화면에서와 같이 획득된 RGB 프리뷰 영상에 해당하는 RGB UI 화 면을 디스플레이에 출력할 수 있다. 또는, 프로세서는 앞서 도 9 또는 도 10에서 설명한 바와 같이 사용자가 지정한 또는 시스템이 지정한 이미지 또는 캐릭터 이미지를 출력할 수 있다. 상기 프로세서(12 0)는 프리뷰 영상에서 특징점들을 추출하고, 지정된 영역(예: 눈 영역)의 특징점들을 기반으로 지시자를 출력할 수 있다. 또한, 상기 프로세서는 상기 지시자가 매핑되어야 할 타겟 지점 객체를 출력 할 수 있다. 상기 타겟 지점 객체는 예컨대, IR 카메라 인식 각도 영역에 표시될 수 있다. 상기 IR 카메라 인식 각도 영역은 사용자의 눈 영역이 위치하여야 하는 영역이 될 수 있다. 사용자의 눈 영역이 IR 카메라 인식 각도 영역에 배치되도록, 사용자는 RGB 카메라 장치의 촬영 방향을 변경하거나 사용자의 얼굴 위치나 방향을 보정할 수 있다. 상기 IR 카메라 인식 각도 영역은 홍채 인식을 위해 IR 카메라(15 1)가 촬영한 각도를 RGB 카메라 장치가 획득한 프리뷰 영상 내에 매핑한 영역을 포함할 수 있다. RGB 카메라 장 치의 촬영 각도가 변경(예: 전자 장치를 회전시키거나 이동시킴에 따라 RGB 카메라 장치의 촬영 각도가 변 경)되면, 상기 프로세서는 각도 변경에 대응하여 지시자의 표시 위치를 변경할 수 있다. 다양한 실시 예에 따르면, 상기 전자 장치의 프로세서는 RGB 카메라 장치를 기반으로 획득된 프리뷰 영상을 이용하여 지시자 및 타겟 지점 객체만을 1103 화면에서와 같이 일정 영역(예: IR 카메라 인 식 각도 영역)에 출력할 수 있다. 이와 관련하여, 프로세서는 앞서 도 8에서 설명한 바와 같이, RGB 카메라 장치를 기반으로 획득한 RGB 프리뷰 영상을 홍채 인식 기능 실행과 관련한 홍채 UI 좌표로 변환하 는 과정을 수행할 수 있다. 상기 홍채 UI는 예컨대, 좌표 변환된 지시자 및 좌표 변환된 타겟 지점 객체 등이 표시되는 특징점 매칭 영역, 시스템 정보 영역 및 홍채 인식을 필요로 하는 어플 리케이션 정보 영역을 포함할 수 있다. 상기 시스템 정보 영역은 홍채 인식 기능 실행 전에 전자 장치가 획득한 정보에 대한 알림이나 또는 지정된 알람 또는 메시지 수신에 따른 알림 등의 정보를 출력하 는 영역이 될 수 있다. 상기 어플리케이션 정보 영역은 예컨대, 락 스크린이나 금융 결제 진행 중인 정보, 보안 설정된 기능에 대한 안내 정보 등을 포함할 수 있다. 다양한 실시 예에 따르면, 프로세서는 1101 화면에서와 RGB 카메라 장치 기반의 지정 이미지, 지정 된 특징점 정보 기반의 지시자, 타겟 지점 객체 등을 출력한 후, 지정된 이벤트 발생에 따라 1103 화면을 디스플레이에 출력할 수 있다. 예컨대, 프로세서는 1101 화면 출력 후 지정된 시간 경과 시, 1103 화면을 디스플레이에 출력할 수 있다. 또는 프로세서는 1101 화면 출력 후, 지정된 특징점 정보 가 일정 크기 이상으로 획득되거나 타겟 지점 객체로부터 일정 거리 이내에 위치한 경우, 1103 화 면을 출력할 수 있다. 또는, 프로세서는 홍채 인식 기능의 실행 요청에 대응하여 RGB 카메라 장치를 활성 화하여 RGB 프리뷰 영상을 획득하더라도 1101 화면 출력 없이 바로 1103 화면을 디스플레이에 출력할 수 있다. 전자 장치의 위치나 방향 변화 또는 사용자의 얼굴 위치나 방향 변화에 대응하여 1105 화면에서와 같이, 지시자가 타겟 지점 객체에 적어도 일부가 중첩되거나 또는 타겟 지점 객체로부터 지정된 거 리 이내에 지시자가 위치하는 경우, 프로세서는 IR 카메라를 기반으로 하는 홍채 인식을 수행할 수 있다. 1105 화면은 앞서 설명한 1103 화면에서와 같이 특징점 매칭 영역, 시스템 정보 영역 및 어 플리케이션 정보 영역을 출력하고, 촬영 각도 또는 피사체 위치 변화에 대응하여 지시자의 표시 위 치를 변경할 수 있다. 홍채 인식에 성공하면, 프로세서는 1107 화면에서와 같이, 지정된 기능 실행을 처리할 수 있다. 예컨대, 프로세서는 락 스크린이 해제되면, 지정된 대기 화면을 디스플레이에 출력할 수 있다. 다양한 실시 예에 따르면, 상기 프로세서는 금융 결재 등의 기능 실행과 관련하여 홍채 인식 기능 실행이 요청되고, 홍 채 인식에 성공하면, 금융 결재에 따른 결과 정보를 디스플레이에 출력할 수도 있다. 도 12은 본 발명의 실시 예에 따른 전자 장치 운용 환경의 한 예를 나타낸 도면이다. 도 12을 참조하여, 다양한 실시 예에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 (예: 상기 전자 장치)는 버스, 프로세서, 메모리, 입출력 인터페이스, 디 스플레이, 및 통신 인터페이스를 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는, 구성요 소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 상술한 전자 장치는 변 환 UI와 관련한 이미지를 네트워크와 연결된 외부 장치(예: 외부 전자 장치 1202, 1204, 서버 1206)로부터 수신 할 수 있다. 추가적으로, 상기 전자 장치는 홍채 인식 성공에 따라 지정된 서버 접속 또는 지정된 전자 장치 연결 등을 수행할 수 있다.버스는 구성요소들(1220-1270)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서(예: 상기 전자 장치의 프로세서))는, 중앙처리장치, 어플리케이션 프로세서, 또는 커뮤니 케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처 리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치 의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시 예에 따르면, 메 모리는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널 , 미들웨어, 어플리케이션 프로그래밍 인터페이스(API), 및/또는 어플리케이션 프로그램(또 는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소 스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널 은 미들웨어, API, 또는 어플리케이션 프로그램에서 전자 장치의 개별 구성요소에 접 근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부 터 수신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들면, 미들웨어는 어플리 케이션 프로그램 중 적어도 하나에 전자 장치의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위를 부여하고, 상기 하나 이상의 작업 요청들을 처리할 수 있 다. API는 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인 터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기 로부터 입력된 명령 또는 데이터를 전자 장치의 다른 구성요소(들)에 전달하거나, 또는 전자 장치 의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오드 (OLED) 디스플레이, 또는 마이크로 전자기계 시스템 (MEMS) 디스플레이, 또는 전자종이(electronic paper) 디스 플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이미지, 비디 오, 아이콘, 및/또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제1 외부 전자 장치, 제2 외부 전자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통 신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제2 외부 전자 장치 또는 서버 )와 통신할 수 있다. 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있다. 한 실시 예 에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비 (Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 무 선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 “Beidou”) 또는 Galileo, the European global satellite-based navigation system일 수 있다. 이하, 본 문서에서는, “GPS”는 “GNSS”와 상호 호환적으로 사용될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨 터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나를 포함할 수 있다. 또는 전자장치는 근거리 통신를 기반으로 제1 전자 장치와 통신할 수 있다. 제1 및 제2 외부 전자 장치(1202, 1204) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 다양한 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전 자 장치(예: 전자 장치(1202,1204), 또는 서버에서 실행될 수 있다. 한 실시 예에 따르면, 전자 장치 가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치(1202, 1204), 또는 서버)에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(1202, 1204), 또는 서버)는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전 자 장치는 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 13는 다양한 실시 예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 12에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장 치는 하나 이상의 프로세서(예: AP), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈 , 전력 관리 모듈, 배터리, 인디케이터, 및 모터 를 포함할 수 있다. 프로세서 는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨어 또 는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시 예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서를 더 포함할 수 있다. 프로세서는 도 13에 도시된 구성 요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프로세서 는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드)하여 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 통신 모듈(예: 통신 인터페이스)와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예 를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈, MST 모듈 및 RF 모듈를 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 프로세서가 제공할 수 있는 기능 중 적어도 일 부 기능을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈, MST 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모 듈은, 예를 들면, 트랜시버, PAM(power amp module), 주파수 필터, LNA(low noise amplifier), 또는 안 테나 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈 , GNSS 모듈 또는 NFC 모듈, MST 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 또는 임베 디드 SIM을 포함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입 자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM, SRAM, 또는 SDRAM 등), 비휘발성 메모리(예: OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, 플래시 메모리, 하드 드라이 브, 또는 솔리드 스테이트 드라이브 (SSD) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라 이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱 등을 포함할 수 있다. 외장 메모리는 다양한 인터페 이스를 통하여 전자 장치와 기능적으로 또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지 된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(1340A), 자이로 센서 (1340B), 기압 센서(1340C), 마그네틱 센서(1340D), 가속도 센서(1340E), 그립 센서(1340F), 근접 센서(1340G), 컬러(color) 센서(1340H)(예: RGB(red, green, blue) 센서), 생체 센서(1340I), 온/습도 센서 (1340J), 조도 센서(1340K), 또는 UV(ultra violet) 센서(1340M) 중의 적어도 하나를 포함할 수 있다. 추가적 으로 또는 대체적으로, 센서 모듈은, 예를 들면, 후각(e-nose) 센서, 일렉트로마이오그라피(EMG) 센서, 일렉트로엔씨팔로그램(EEG) 센서, 일렉트로카디오그램(ECG) 센서, IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회 로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센 서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널, (디지털) 펜 센서, 키, 또는 초음파 입력 장치 를 포함할 수 있다. 터치 패널은, 예를 들면, 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널 은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크(예: 마이크 )를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 프로젝터, 및/또는 이들을 제어하기 위한 제어 회로를 포함할 수 있다. 패널은, 예를 들면, 유연하게, 투명하게, 또는 착용할 수 있 게 구현될 수 있다. 패널은 터치 패널과 하나 이상의 모듈로 구성될 수 있다. 한 실시 예에 따르면, 패널은 사용자의 터치에 대한 압력의 세기를 측정할 수 있는 압력 센서(또는 포스 센서)를 포함 할 수 있다. 상기 압력 센서는 터치 패널과 일체형으로 구현되거나, 또는 터치 패널과는 별도의 하 나 이상의 센서로 구현될 수 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장치 의 내부 또는 외부에 위치할 수 있다. 인터페이스는, 예를 들면, HDMI, USB, 광 인터 페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인터페이스는, 예를 들면, 도 12에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적으로, 인터페이스 는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD카드/MMC(multi-media card) 인터페이 스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어 도 일부 구성요소는, 예를 들면, 도 12 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈 은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출 력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, 이미지 시그널 프로세서(ISP), 또는 플래시(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 상기 카메라 모듈은 앞서 설명한 RGB 카메라 장치 및 IR 카메라 장치 중 적어도 하나를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관 리 모듈은 PMIC(power management integrated circuit), 충전 IC, 또는 배터리 또는 연료 게이지를 포함 할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방 식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충 전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리는, 예를 들면, 충전식 전지 및/또는 태양 전지를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 다양한 실시 예에 따르면, 상기 인디케이터는 RGB 카 메라 운용 중인 상태 및 IR 카메라 운용 중인 상태에 대응하는 각각의 인디케이터를 출력할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있고, 진동, 또는 햅틱 효과 등을 발생시킬 수 있다. 전자 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting),또는 미디어플로(mediaFloTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있는 모바일 TV 지원 장치(예: GP U)를 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해 당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM, DVD(Digital Versatile Disc), 자기-광 매체(magneto- optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장치(예: ROM, RAM, 또는 플래시 메모리 등) 등을 포함할 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 범위 를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 발명의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2016-0174371", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 홍채 인식 환경의 한 예를 나타낸 도면이다. 도 2는 본 발명의 실시 예에 따른 전자 장치 구성의 한 예를 나타낸 도면이다. 도 3은 본 발명의 실시 예에 따른 프로세서 구성의 한 예를 나타낸 도면이다. 도 4는 본 발명의 실시 예에 따른 홍채 인식 기능 운용 방법의 한 예를 나타낸 도면이다. 도 5는 본 발명의 실시 예에 따른 UI 출력 동작을 포함하는 홍채 인식 기능 운용 방법의 한 예를 나타낸 도면이 다. 도 6은 본 발명의 실시 예에 따른 홍채 인식 기능 운용과 관련한 IR 카메라 활성화 방법의 한 예를 설명하는 도 면이다. 도 7은 본 발명의 실시 예에 따른 홍채 인식 기능 운용과 관련한 IR 카메라 활성화 방법의 다른 예를 설명하는 도면이다. 도 8은 본 발명의 실시 예에 따른 홍채 인식 기능과 관련한 RGB 카메라 장치 기반의 화면 인터페이스 출력 방법 을 설명하는 도면이다. 도 9는 본 발명의 실시 예에 따른 UI 변환과 관련한 한 예를 나타낸 도면이다. 도 10은 본 발명의 실시 예에 따른 UI 변환과 관련한 다른 예를 나타낸 도면이다. 도 11은 본 발명의 실시 예에 따른 UI 매칭의 한 예를 나타낸 도면이다."}
