{"patent_id": "10-2019-0045765", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0122722", "출원번호": "10-2019-0045765", "발명의 명칭": "분할 화면을 제공하기 위한 전자 장치, 방법, 및 컴퓨터 판독가능 매체", "출원인": "삼성전자주식회사", "발명자": "이상언"}}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(electronic device)에 있어서, 인스트럭션(instruction)들을 저장하는 적어도 하나의 메모리; 폴더블(foldable) 디스플레이; 및 상기 폴더블 디스플레이 및 상기 적어도 하나의 메모리와 작동적으로 결합된(operably coupled with) 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 폴더블 디스플레이가 언폴딩 상태(unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서브영역 옆의(beside) 제2 서브 영역을 포함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하고,상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으로부터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는(toward) 제1드래그 입력을 수신하고, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로(as partially superimposed on) 상기 제2 서브 영역 내에서 실행되었던(has been executed) 어플리케이션들 중 일부를 지시하기(indicate) 위한 적어도 하나의 실행가능한 객체(executable object)를 포함하는 목록을표시하고, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실행가능한 객체를 선택하기 위한 입력을수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시하도록 구성되며, 상기 제1 서브 영역의 넓이(area)는, 상기 제2 서브 영역의 넓이보다 넓은 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2드래그 입력을 수신하고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제2 실행가능한객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시를 유지하고, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 축소하며, 상기 축소된 실행 화면 아래에서(below) 상기 제2 실행가능한 객체에 의해 지시되는 다른(another) 어플리케이션의 다른(another) 실행 화면을 표시하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "공개특허 10-2020-0122722-3-청구항 2에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 축소된 실행 화면 및 상기 다른실행 화면을 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역내의 다른 영역으로 향하는 제3 드래그 입력을 수신하고, 상기 제3 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 및 상기다른 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체 및 상기 제2 실행가능한 객체가 제외된 상기 목록을 표시하고, 상기 제1 실행가능한 객체 및 상기 제2 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제3 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시와 상기 제2 서브 영역 내에서의 상기 축소된 실행 화면의 상기 표시를 유지하고, 상기 축소된 실행 화면 아래에서 표시되는 상기 다른 실행 화면을 상기 제3 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면으로 전환하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2드래그 입력을 수신하고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된(held) 제2 실행가능한 객체를 상기 제1 서브 영역으로 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제2 서브 영역 내에서의 상기 실행 화면의 상기 표시를 유지하고, 상기 제1 서브 영역내에서 표시되는 상기 제1 화면을 상기 제2 실행가능한 객체에 의해 지시되는 다른 어플리케이션의 다른 실행화면으로 전환하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2드래그 입력을 수신하고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된 제2 실행가능한 객체를 상기 제2 서브 영역으로 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시를 유지하고, 상기 제2 서브 영역 내에서표시되는 상기 실행 화면을 상기 제2 실행가능한 객체에 의해 지시되는 다른 어플리케이션의 다른 실행 화면으로 전환하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기공개특허 10-2020-0122722-4-제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2드래그 입력을 수신하고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된 제2 실행가능한 객체를 상기 제1 서브 영역과 상기 제2 서브 영역 사이의 경계를 포함하는 지정된 영역으로 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서 표시되는상기 제1 화면 및 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 상기 제2 실행가능한 객체에 의해 지시되는 다른 어플리케이션의 다른 실행 화면을 표시하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2드래그 입력을 수신하고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된(held) 제2 실행가능한 객체를 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 다시 삽입하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시및 상기 제2 서브 영역 내에서의 상기 실행 화면의 상기 표시를 유지하고, 상기 제2 실행가능한 객체를 상기 목록 내에 다시 삽입하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기제1 서브 영역 내에서 실행되었던 어플리케이션들 중 일부를 지시하기 위한 적어도 하나의 다른(another) 실행가능한 객체를 포함하는 다른(another) 목록을 표시하기 위한 입력을 수신하고, 여기서, 상기 다른 목록 내에포함된 상기 적어도 하나의 다른 실행가능한 객체는, 상기 제1 화면을 제공하는 어플리케이션을 지시하기 위한실행가능한 객체를 포함하며, 상기 다른 목록을 표시하기 위한 상기 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서의 상기 실행화면의 상기 표시를 유지하고, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면을 상기 다른 목록으로 전환하고, 상기 다른 목록 내에 포함된 상기 적어도 하나의 다른 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된 제2실행가능한 객체를 상기 제2 서브 영역으로 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서 상기 제2 실행가능한 객체가 제외된 상기 다른 목록을 표시하고, 상기 제2 서브 영역 내에서 상기 제2 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 표시하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서, 상기 제2 실행가능한 객체에 의해 지시되는 상기 어플리케이션의 상기 실행 화면은, 상기 제1 사용자 입력 및 상기 제2 사용자 입력을 수신하기 전에 상기 제2 서브 영역 내에서 표시되는 상기 실공개특허 10-2020-0122722-5-행 화면과 함께 상기 제2 서브 영역 내에서 표시되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서, 상기 제2 실행가능한 객체에 의해 지시되는 상기 어플리케이션의 상기 실행 화면은, 상기 제1 사용자 입력 및 상기 제2 사용자 입력을 수신하기 전에 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 아래에서(below) 표시되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 8에 있어서, 상기 제2 실행가능한 객체에 의해 지시되는 상기 어플리케이션의 상기 실행 화면은, 상기 제1 사용자 입력 및 상기 제2 사용자 입력을 수신하기 전에 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면으로부터 전환되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 드래그 입력의 상기 수신에 응답하여 상기 제1 화면 상에 일부 중첩으로 상기 목록을 표시하는 동안,상기 목록에 대한 제2 드래그 입력을 수신하고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 적어도 하나의 실행가능한 객체의 적어도 일부를 상기 목록으로부터 제외하고 상기 제2 서브 영역 내에서 실행되었던 상기 어플리케이션들 중 다른 일부를 지시하기 위한 적어도 하나의 다른 실행가능한 객체를 상기 목록 내에 삽입하도록 더 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역의 동작 이력을 포함하는 실행 휴리스틱스(execution heuristics)에 기반하여, 상기 제2 서브 영역 내에서 실행되었던 상기 어플리케이션들 중 일부를 식별하고, 상기 식별에 기반하여, 상기 어플리케이션들 중 일부를 지시하기 위한 상기 적어도 하나의 실행가능한 객체를포함하는 상기 목록을 표시하도록 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 화면을 제공하는 어플리케이션과 연동가능하고 상기제2 서브 영역 내에서 실행되었던 적어도 하나의 어플리케이션을 상기 제2 서브 영역 내에서 실행되었던 상기어플리케이션들 중 일부로 식별하고, 상기 식별에 기반하여, 상기 어플리케이션들 중 일부를 지시하기 위한 상기 적어도 하나의 실행가능한 객체를포함하는 상기 목록을 표시하도록 구성되는 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 1에 있어서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 공개특허 10-2020-0122722-6-상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 상기 제1 실행가능한 객체를 선택하기 위한 상기 입력을 수신하는 것에 응답하여, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시가능한지(displayable) 여부를 식별하고, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시가능함을 식별하는 것에 기반하여, 상기 제1 화면을 상기 제1서브 영역 내에서 표시하고 상기 어플리케이션의 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하며, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시불가능함을 식별하는 것에 기반하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로, 상기 어플리케이션의 상기 실행 화면을 표시하도록 구성되는 전자장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "폴더블 디스플레이를 가지는 전자 장치 내에서 실행되는 방법에 있어서, 상기 폴더블 디스플레이가 언폴딩 상태(unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서브영역 옆의(beside) 제2 서브 영역을 포함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하는동작과, 상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으로부터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는(toward) 제1드래그 입력을 수신하는 동작과, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로(as partially superimposed on) 상기 제2 서브 영역 내에서 실행되었던(has been executed) 어플리케이션들 중 일부를 지시하기(indicate) 위한 적어도 하나의 실행가능한 객체(executable object)를 포함하는 목록을표시하는 동작과, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실행가능한 객체를 선택하기 위한 입력을수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동작을 포함하고, 상기 제1 서브 영역의 넓이(area)는, 상기 제2 서브 영역의 넓이보다 넓은 전자 장치."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2드래그 입력을 수신하는 동작과, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하는 동작과, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제2 실행가능한객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시를 유지하고, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 축소하며, 상기 축소된 실행 화면 아래에서(below) 상기 제2 실행가능한 객체에 의해 지시되는 다른(another) 어플리케이션의 다른(another) 실행 화면을 표시하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2020-0122722-7-청구항 17에 있어서, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 축소된 실행 화면 및 상기 다른실행 화면을 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역내의 다른 영역으로 향하는 제3 드래그 입력을 수신하는 동작과, 상기 제3 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 및 상기다른 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체 및 상기 제2 실행가능한 객체가 제외된 상기 목록을 표시하는 동작과, 상기 제1 실행가능한 객체 및 상기 제2 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제3 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시와 상기 제2 서브 영역 내에서의 상기 축소된 실행 화면의 상기 표시를 유지하고, 상기 축소된 실행 화면 아래에서 표시되는 상기 다른 실행 화면을 상기 제3 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면으로 전환하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2드래그 입력을 수신하는 동작과, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하는 동작과, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된(held) 제2 실행가능한 객체를 상기 제1 서브 영역으로 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제2 서브 영역 내에서의 상기 실행 화면의 상기 표시를 유지하고, 상기 제1 서브 영역내에서 표시되는 상기 제1 화면을 상기 제2 실행가능한 객체에 의해 지시되는 다른 어플리케이션의 다른 실행화면으로 전환하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2019-0045765", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "하나 이상의 프로그램(program)들을 저장하는 비일시적 컴퓨터 판독 가능 저장 매체(non-transitory computerreadable storage medium)에 있어서, 상기 하나 이상의 프로그램들은, 폴더블 디스플레이를 가지는 전자 장치의 하나 이상의 프로세서들에 의해 실행될 시, 상기 폴더블 디스플레이가 언폴딩 상태(unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서브영역 옆의(beside) 제2 서브 영역을 포함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하고,상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으로부터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는(toward) 제1드래그 입력을 수신하고, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로(as partially superimposed on) 상기 제2 서브 영역 내에서 실행되었던(has been executed) 어플리케이션들 중 일부를 지시하기(indicate) 위한 적어도 하나의 실행가능한 객체(executable object)를 포함하는 목록을표시하고, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실행가능한 객체를 선택하기 위한 입력을수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 제1 실행가능한 객체에 의공개특허 10-2020-0122722-8-해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함하는 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2019-0045765", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예들에 따른 전자 장치는, 인스트럭션(instruction)들을 저장하는 적어도 하나의 메모리와, 폴더블 (foldable) 디스플레이와, 상기 폴더블 디스플레이 및 상기 적어도 하나의 메모리와 작동적으로 결합되고 (operably coupled with), 상기 인스트럭션들을 실행할 시, 상기 폴더블 디스플레이가 언폴딩 상태(unfolding (뒷면에 계속)"}
{"patent_id": "10-2019-0045765", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "후술되는 다양한 실시예들은 분할 화면을 제공하기 위한 전자 장치(electronic device), 방법, 및 컴퓨터 판독 가능 매체(computer readable medium)에 관한 것이다."}
{"patent_id": "10-2019-0045765", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "멀티 미디어 콘텐트(multimedia content)에 손쉽게 접근하기 위한 전자 장치가 개발되고 있다. 이러한 전자 장 치는, 멀티 미디어 콘텐트를 상기 전자 장치의 디스플레이를 이용하여 제공할 수 있다."}
{"patent_id": "10-2019-0045765", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "스마트폰(smartphone)보다 넓은 크기의 디스플레이를 가지는 페블릿(phablet), 테블릿(tablet)과 같은 장치의 휴대성을 강화하기 위해, 폴더블 디스플레이(foldable display)와 같은 변형가능한(deformable) 디스플레이를 포함하는 전자 장치(electronic device)가 개발되고 있다. 따라서, 변형가능한 디스플레이를 가지는 전자 장치 에서, 다양한 정보를 동시에 제공하기 위한 방안(solution)이 요구될 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2019-0045765", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0045765", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들에 따른 전자 장치는, 인스트럭션(instruction)들을 저장하는 적어도 하나의 메모리와, 폴더블 (foldable) 디스플레이와, 상기 폴더블 디스플레이 및 상기 적어도 하나의 메모리와 작동적으로 결합되고 (operably coupled with), 상기 인스트럭션들을 실행할 시, 상기 폴더블 디스플레이가 언폴딩 상태(unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서브 영역 옆의(beside) 제2 서브 영역을 포함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하고, 상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으로부터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는(toward) 제1 드래그 입력을 수신하고, 상기 제1 드래그 입력 의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로(as partially superimposed on) 상기 제2 서브 영역 내에서 실행되었던(has been executed) 어플리케이션들 중 일부를 지시 하기(indicate) 위한 적어도 하나의 실행가능한 객체(executable object)를 포함하는 목록을 표시하고, 상기 목 록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 제1 실행가능한 객체에 의해 지시되 는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시하도록 구성되는 적어도 하나의 프로세서를 포 함할 수 있고, 상기 제1 서브 영역의 넓이(area)는, 상기 제2 서브 영역의 넓이보다 넓을 수 있다. 다양한 실시예들에 따른, 폴더블 디스플레이를 가지는 전자 장치 내에서 실행되는 방법은, 상기 폴더블 디스플 레이가 언폴딩 상태(unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서브 영역 옆의(beside) 제2 서브 영역을 포함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하는 동작과, 상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으로부터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는(toward) 제1 드래그 입력을 수신하는 동작과, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기제1 화면 상에 일부 중첩으로(as partially superimposed on) 상기 제2 서브 영역 내에서 실행되었던(has been executed) 어플리케이션들 중 일부를 지시하기(indicate) 위한 적어도 하나의 실행가능한 객체(executable object)를 포함하는 목록을 표시하는 동작과, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내 에서 표시하고 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내 에서 표시하는 동작을 포함할 수 있고, 상기 제1 서브 영역의 넓이(area)는, 상기 제2 서브 영역의 넓이보다 넓 을 수 있다. 다양한 실시예들에 따른 비일시적 컴퓨터 판독 가능 저장 매체(non-transitory computer readable storage medium)는, 폴더블 디스플레이를 가지는 전자 장치의 하나 이상의 프로세서들에 의해 실행될 시, 상기 폴더블 디스플레이가 언폴딩 상태(unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서브 영역 옆의 (beside) 제2 서브 영역을 포함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하고, 상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으로부터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는(toward) 제1 드래그 입력을 수신하고, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기 제1 화 면 상에 일부 중첩으로(as partially superimposed on) 상기 제2 서브 영역 내에서 실행되었던(has been executed) 어플리케이션들 중 일부를 지시하기(indicate) 위한 적어도 하나의 실행가능한 객체(executable object)를 포함하는 목록을 표시하고, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실행 가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표 시하고 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표 시하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함하는 하나 이상의 프로그램들을 저장할 수 있다."}
{"patent_id": "10-2019-0045765", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예들에 따른 전자 장치(electronic device) 및 그의 방법은, 분할 화면(split screen)을 제공함으 로써 향상된 사용자 경험(user experience)을 제공할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0045765", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시 예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하 나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1\", \"제2\", \"첫째\" 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요 도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한 정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도록 변경된(adapted to)\", \"~하도록 만들어진(made to)\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어(hardware)적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표 현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수 행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU(central processing unit) 또는 AP(application processor))를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따르는 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크 스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예들에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD) 등), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하 나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토메이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템(GNSS, global navigation satellite system), EDR(event data recorder), FDR(flight data recorder), 자동차 인포 테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기 (avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things)(예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터 (toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예들에 서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따르는 전자 장치는 플렉서블 전자 장치 또는 폴더블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따르는 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따르는 새로운 전자 장치를 포함할 수 있다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전 자 장치)를 지칭할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예들을 상세히 설명하면 다음과 같다. 다만, 설명의 편의를 위하여 도면에서는 구성 요소들이 그 크기가 과장 또는 축소될 수 있다. 예컨대, 도면에서 나타난 각 구성의 크기 및 두께는 설명의 편의를 위해 임의로 나타내었으므로, 본 발명이 반드시 도시된 바에 한정되지 않는다. 도 1a는 다양한 실시예들에 따른 전자 장치의 간소화된 블록도이다. 도 1a를 참조하면, 전자 장치는, 프로세서, 메모리, 디스플레이, 및 센서 회로를 포 함할 수 있다. 프로세서는 전자 장치의 전반적인 동작을 제어할 수 있다. 예를 들면, 프로세서는 광고, 인터 넷, 게임, 동영상 등을 제공하는 어플리케이션들을 실행할 수 있다. 다양한 실시예들에서, 프로세서는 하 나의 프로세서 코어(single core)를 포함하거나, 복수의 프로세서 코어들을 포함할 수 있다. 예를 들면, 프로 세서는 듀얼 코어(dual-core), 쿼드 코어(quad-core), 헥사 코어(hexa-core) 등의 멀티 코어(multi- core)를 포함할 수 있다. 실시 예들에 따라, 프로세서는 내부 또는 외부에 위치된 캐시 메모리(cache memory)를 더 포함할 수 있다. 프로세서는 전자 장치의 다른 구성 요소들의 명령을 수신할 수 있고, 수신된 명령을 해석할 수 있으 며, 해석된 명령에 따라 계산을 수행하거나 데이터를 처리할 수 있다. 프로세서는 어플리케이션에서 생성되거나 발생되는 데이터 또는 신호를 처리할 수 있다. 예를 들면, 프로 세서는 어플리케이션을 실행하거나 제어하기 위해 메모리에게 명령어, 데이터 또는 신호를 요청할 수 있다. 프로세서는 어플리케이션을 실행하거나 제어하기 위해 메모리에게 명령어, 데이터, 또는 신호 를 기록(또는 저장)하거나 갱신할 수 있다. 프로세서는 메모리, 디스플레이, 또는 센서 회로로부터 수신되는 메시지, 데이터, 명령어, 또는 신호를 해석할 수 있고, 가공할 수 있다. 프로세서는 수신된 메시지, 데이터, 명령어, 또는 신호에 기반하여 새로운 메시지, 데이터, 명령어, 또는 신호를 생성할 수 있다. 프로세서는 가공되거나 생성된 메시지, 데이터, 명령어, 또는 신호를 메모리, 디스플레이, 또는 센서 회로에게 제공할 수 있다. 프로세서의 전부 또는 일부는 전자 장치 내의 다른 구성 요소(예를 들면, 메모리, 디스플레이 , 또는 센서 회로)와 전기적으로(electrically) 또는 작동적으로(operably 또는 operatively) 결합 (coupled with)되거나 연결될(connected to) 수 있다. 실시 예들에 따라, 프로세서는 하나 또는 그 이상의 프로세서들로 구성될(configured with) 수 있다. 예 를 들면, 프로세서는 응용 프로그램 등과 같은 상위 계층의 프로그램을 제어하는 AP(application processor), 디스플레이를 제어하기 위한 GPU(graphic processing unit), 또는 통신 기능을 제어하기 위 한 CP(communication processor) 중 하나 이상을 포함할 수 있다. 메모리는 전자 장치를 제어하는 명령어, 제어 명령어 코드, 제어 데이터, 또는 사용자 데이터를 저장 할 수 있다. 예를 들면, 메모리는 어플리케이션(application), OS(operating system), 미들웨어 (middleware), 디바이스 드라이버(device driver)를 포함할 수 있다. 메모리는 휘발성 메모리(volatile memory) 또는 불휘발성(non-volatile memory) 중 하나 이상을 포함할 수 있다. 휘발성 메모리는 DRAM(dynamic random access memory), SRAM(static RAM), SDRAM(synchronous DRAM), PRAM(phase-change RAM), MRAM(magnetic RAM), RRAM(resistive RAM), FeRAM(ferroelectric RAM) 등을 포함할 수 있다. 불휘발성 메모리는 ROM(read only memory), PROM(programmable ROM), EPROM(electrically programmable ROM), EEPROM(electrically erasable programmable ROM), 플래시 메모리(flash memory) 등을 포 함할 수 있다. 메모리는 하드 디스크 드라이브(HDD, hard disk drive), 솔리드 스테이트 디스크(SSD, solid state disk), eMMC(embedded multi media card), UFS(universal flash storage)와 같은 불휘발성 매체(medium)를 포 함할 수 있다. 디스플레이는, 컨텐츠, 데이터, 또는 신호를 출력할 수 있다. 다양한 실시예들에서, 디스플레이는 프로세서에 의해 가공된 이미지 데이터를 표시할 수 있다. 실시예들에 따라, 디스플레이는 터치 입력 등을 수신할 수 있는 복수의 터치 센서들(미도시)과 결합됨으로 써, 일체형의 터치 스크린(touch screen)으로 구성될(configured with) 수도 있다. 디스플레이가 터치 스크린으로 구성되는 경우, 상기 복수의 터치 센서들은, 디스플레이 위에 배치되거나, 디스플레이 아 래에 배치될 수 있다. 실시예들에 따라, 디스플레이는, 변형가능한(deformable) 디스플레이를 포함할 수 있다. 예를 들면, 디스 플레이는, 디스플레이의 적어도 일부를 접을 수 있는(foldable) 디스플레이(예: 폴더블 디스플레이) 로 구성될 수 있다. 디스플레이가 폴더블 디스플레이로 구성되는 경우, 전자 장치는 디스플레이 를 접을 수 있는 구조(structure)를 가질 수 있다. 예를 들어, 도 1b를 참조하면, 전자 장치는, 제1 하우징, 제2 하우징, 접이부, 및/또는 디 스플레이를 포함할 수 있다. 다양한 실시예들에서, 제1 하우징은 제1 면 및 상기 제1 면과 마주하며 떨어진(faced away) 제2 면을 포함 할 수 있다. 다양한 실시예들에서, 제2 하우징은 제3 면 및 상기 제3 면과 마주하며 떨어진 제4 면을 포 함할 수 있다. 다양한 실시예들에서, 제1 하우징 및 제2 하우징은 접이부에 의해 연결될 수 있다. 예를 들면, 접이부는 제1 하우징의 측면과 제1 하우징의 측면과 마주하는 제2 하우징의 측면에 각각 결합함으로써 제1 하우징 및 제2 하우징의 사이를 회전 가능하게(pivotably 또는 rotatably) 연결하 도록 구성될 수 있다. 디스플레이는 접이부를 가로질러 제1 하우징 및 제2 하우징 상에 배치될 수 있다. 다양한 실시예들에서, 디스플레이는 제1 하우징 및 제2 하우징에 의해 지지되도록 설치될 수 있다. 다 양한 실시예들에서, 디스플레이는 접이부를 가로질러 상기 제1 면 및 상기 제3 면 상에 배치될 수 있 다. 다양한 실시예들에서, 디스플레이는 상기 제1 면에 상응하는 제1 영역 및 상기 제3 면에 상응하는 제 2 영역을 포함할 수 있다. 다양한 실시예들에 따른 전자 장치는 접이부를 기준으로 접힐 수 있다. 예를 들면, 접이부는 전자 장치의 제1 하우징 및 제2 하우징의 사이에 배치되어, 전자 장치를 굽히거나, 휘거나, 접힐 수 있게 할 수 있다. 다양한 실시예들에서, 제1 하우징은 접이부를 통해 제2 하우징 과 연결되어 접이부를 기준으로 회전할 수 있다. 다양한 실시예들에서, 제2 하우징은 접이부 를 통해 제1 하우징과 연결되어 접이부를 기준으로 회전할 수 있다. 다양한 실시예들에서, 제1 하우징과 제2 하우징은 접이부를 기준으로 회전함으로써 상호 마주 보도록 접힐 수 있다. 다양 한 실시예들에서, 제1 하우징 및 제2 하우징은 실질적으로 서로 포개지거나 중첩될 수 있다. 다양한 실시예들에서, 전자 장치는 제1 하우징과 제2 하우징이 접이부에 의해 펼쳐진 (folded out) 제1 상태를 제공할 수 있다. 다양한 실시예들에서, 상기 제1 상태에서 상기 제1 면은 상기 제3 면과 실질적으로(substantially) 동일한 평면을 이룰(flushed with) 수 있다. 다양한 실시예들에서, 전자 장치 는, 접이부를 펼침으로써, 제1 하우징 및 제2 하우징이 실질적으로 동일한 평면을 이루는 (flushed with) 상기 제1 상태를 제공할 수 있다. 다양한 실시예들에서, 상기 제1 상태는, 전자 장치의 전면을 향하는 사용자의 시야(field of view 또는 angle of view) 안에서(within) 디스플레이의 전체 영 역(entire area) 중 상기 제1 면에 상응하는 제1 영역, 디스플레이의 전체 영역 중 상기 제3 면에 상응하 는 제2 영역, 및 디스플레이의 전체 영역 중 접이부를 감싸는 제3 영역 모두를 제공할 수 있는 상태 를 의미할 수 있다. 다양한 실시예들에서, 상기 제1 상태는, 펼침 상태(outspread state 또는 outspreading state)로 참조되거나, 언폴딩(unfolding) 상태로 참조될 수 있다. 다양한 실시예들에서, 전자 장치는 제1 하우징과 제2 하우징이 상기 접이부에 의해 접힌(folded in) 제2 상태를 제공할 수 있다. 다양한 실시예들에서, 상기 제2 상태에서 상기 제1 면은, 상기 제3 면 위에 중첩될 수 있다. 다양한 실시예들에서, 전자 장치는, 접이부가 제1 하우징의 전면(예: 상기 제 1 면) 및 제2 하우징의 전면(예: 상기 제3 면)이 서로 마주 보도록 접혀, 제1 하우징 및 제2 하우징 이 평행하게 배치되는 상기 제2 상태를 제공할 수 있다. 다양한 실시예들에서, 상기 제2 상태는 전자 장 치의 전면을 향하는 사용자의 시야 안에서 디스플레이가 가려지는 상태를 의미할 수 있다. 다양한 실시예들에서, 상기 제2 상태는, 접힘 상태(folded state 또는 folding state)로 참조될 수 있다. 도 1b는 제1 하우징의 상기 제1 면이 제2 하우징의 상기 제3 면 위에 중첩되는 상기 제2 상태를 도시 하고 있으나, 이는 설명의 편의를 위한 것이다. 다양한 실시예들에서, 상기 제2 상태는, 도 1b의 도시와 달리,제1 하우징의 상기 제2 면이 제2 하우징의 상기 제4 면 위에 중첩되는 상태를 의미할 수도 있다. 다 시 말해, 상기 제2 상태는, 도 1b의 도시와 달리, 디스플레이의 상기 전체 영역 중 상기 제1 영역 및 디스 플레이의 상기 전체 영역 중 상기 제3 영역의 일부를 제공하는 상태를 의미하거나 디스플레이의 상기 전체 영역 중 상기 제2 영역 및 디스플레이의 상기 전체 영역 중 상기 제3 영역의 일부를 제공하는 상태를 의미할 수도 있다. 다양한 실시예들에서, 디스플레이는 제1 하우징과 접이부를 가로질러 제2 하우징의 전면부 (예: 상기 제3 면)에 배치될 수 있다. 다양한 실시예에 따른 전자 장치는 접이부를 기준으로 접힐 수 있다. 디스플레이는 제1 하우징에서 접이부를 가로질러 제2 하우징까지 배치되기 때문 에 전자 장치의 접이 동작에 의해 굽혀질 수 있다. 예를 들면, 디스플레이에서, 제1 하우징의 상기 제1 면에 배치되는 상기 제1 영역 및 제2 하우징의 상기 제3 면에 배치되는 제2 영역과 달리, 접이부 의 위에 배치되는 제3 영역은 전자 장치의 접이 동작에 따라 굽어질 수 있다. 다양한 실시예들에서, 상기 제3 영역은 디스플레이의 파손을 방지하기 위해 만곡하여 굽혀질 수 있다. 다양한 실시예들에서, 상기 제1 영역 또는 상기 제2 영역 중 하나 이상은, 상기 제3 영역과 같이 굴곡진 영역을 더 포함할 수 있다. 예를 들면, 제1 하우징의 중심부에서 멀어지는 끝 단은 둥근(round) 형상의 영역을 포함할 수 있다. 다른 예를 들면, 제2 하우징의 중심부에서 멀어지는 끝 단은 둥근 형상의 영역을 포함할 수 있다. 다양한 실시예들에서, 상기 제1 영역 내에 포함된 굽은 디스플레이 영역과 상기 제2 영역 내에 포함 된 상기 굽은 디스플레이 영역 각각은, 제1 하우징 및 제2 하우징 각각의 끝 단에 배치되기 때문에, 엣지 디스플레이로 참조될 수 있다. 센서 회로는, 전자 장치의 자세에 대한 정보를 획득하기 위한 제1 센서 또는 전자 장치의 제1 하우징과 제2 하우징 사이의 각도에 대한 정보를 획득하기 위한 제2 센서 중 적어도 하나를 포함할 수 있다. 다양한 실시예들에서, 상기 제1 센서는, 전자 장치의 선형적(linear) 움직임의 변화에 대한 데이터를 획득 하기 위한 센서, 전자 장치의 회전(rotational) 움직임의 변화에 대한 데이터를 획득하기 위한 센서, 또는 전자 장치의 지리적 위치에 대한 데이터를 획득하기 위한 센서 중 하나 이상을 포함할 수 있다. 예를 들 면, 상기 제1 센서는, 지자기 센서, 자이로 센서, 또는 적외선 센서 중 하나 이상을 포함할 수 있다. 다양한 실시예들에서, 상기 제2 센서는, 전자 장치의 상태(예: 상기 제1 상태 및 상기 제2 상태)에 대한 정보를 제공하기 위해, 전자 장치의 제1 하우징과 제2 하우징 사이의 각도에 대한 정보를 획득 할 수 있다. 다양한 실시예들에서, 상기 제2 센서는, 접이부 내에 포함될 수 있다. 다양한 실시예들에서, 프로세서는, 디스플레이를 이용하여 다양한 정보를 표시할 수 있다. 다양한 실시예들에서, 상기 정보는, 제1 영역(region), 상기 제1 영역 아래의(below) 제2 영역, 상기 제1 영역 위의 (above) 제3 영역 중 적어도 하나에서 표시될 수 있다. 다양한 실시예들에서, 상기 제2 영역은, 상기 제1 영역 내에서 표시되는 화면을 제어하기 위한 적어도 하나의 실행 가능한(executable) 객체(예: 뒤로 가기 기능을 제 공하기 위한 실행 가능한 객체, 실행 중인 어플리케이션을 조회하기 위한 실행 가능한 객체, 취소 기능을 제공 하기 위한 실행 가능한 객체 등)를 포함할 수 있다. 다양한 실시예들에서, 상기 제2 영역 내에서 표시되는 상 기 적어도 하나의 실행 가능한 객체는, 상기 제1 영역 내에서 표시되는 화면의 유형 또는 상기 제1 영역 내에서 표시되는 상기 화면을 통해 제공되는 콘텐트의 유형 중 적어도 하나에 따라, 사라질(disappear) 수도 있다. 다 양한 실시예들에서, 상기 제2 영역 내에서 표시되는 상기 적어도 하나의 실행 가능한 객체는, 상기 제1 영역 내 에서 표시되는 화면의 전환과 독립적으로(independently from) 또는 상기 제1 영역 내에서 표시되는 화면의 전 환과 관계없이(in regardless of) 유지될 수 있다. 다양한 실시예들에서, 상기 제2 영역은, 제어 영역으로 참 조될 수도 있다. 다양한 실시예들에서, 상기 제3 영역은, 전자 장치의 상태를 나타내기 위한 적어도 하나 의 인디케이터(예: 셀룰러 통신의 품질을 나타내기 위한 인디케이터, 와이 파이 기능의 활성 여부를 나타내기 위한 인디케이터, 배터리의 잔여량을 나타내기 위한 인디케이터 등)를 포함할 수 있다. 다양한 실시예들에서, 상기 제3 영역 내에서 표시되는 상기 적어도 하나의 인디케이터는, 상기 제1 영역 내에서 표시되는 화면의 유형 또는 상기 제1 영역 내에서 표시되는 상기 화면을 통해 제공되는 콘텐트의 유형 중 적어도 하나에 따라, 사라질 수도 있다. 다양한 실시예들에서, 상기 제3 영역 내에서 표시되는 상기 적어도 하나의 인디케이터는, 상기 제1 영역 내에서 표시되는 화면의 전환과 독립적으로 또는 상기 제1 영역 내에서 표시되는 화면의 전환과 관계없이 (in regardless of) 유지될 수 있다. 다양한 실시예들에서, 상기 제1 영역은, 분할 화면(split screen)을 표시할 수 있다. 예를 들어, 도 2를 참조 하면, 상기 제1 영역은, 제1 서브 영역(sub region) 및 제2 서브 영역으로 구성되거나(configured with) 제1 서브 영역 및 제2 서브 영역을 포함할 수 있다. 다양한 실시예들에서, 제2 서브 영역 은 제1 서브 영역 옆에 배치될 수 있다. 다양한 실시예들에서, 제2 서브 영역의 면적은, 제1 서브 영역의 면적보다 작을 수 있다. 하지만, 이에 제한되지 않는다. 다양한 실시예들에서, 분할 화면은, 복수의 화면들을 동시에(concurrently) 또는 복수의 화면들을 함께 제공하는 상태를 의미할 수 있다. 상기 분할 화면을 제공하는 동안 정의되는 제1 서브 영역의 면적은 제2 서브 영역의 면적보다 넓기 때문에, 사용자는 상기 분할 화면을 제공하는 동안 어떤 영역이 메인 영역인지를 보다 직관적으로 인지할 수 있 다. 다양한 실시예들에 따른 전자 장치는, 이러한 직관적 인지를 통해, 향상된(enhanced) 사용자 경험을 제공할 수 있다. 상술한 바와 같이, 다양한 실시예들에서, 제1 서브 영역의 면적은, 제2 서브 영역의 면적보다 넓을 (larger) 수 있다. 다양한 실시예들에서, 제2 서브 영역의 면적보다 넓은 면적을 제공한다는 측면에서, 제1 서브 영역은, 메인 표시 영역(main display region)으로 참조될 수 있다. 다양한 실시예들에서, 제2 서브 영역은, 제1 서브 영역의 면적보다 작은 면적을 제공한다는 측면에서, 보조 표시 영역(auxiliary display region 또는 additional display region)으로 참조될 수 있다. 제2 서브 영역은, 전자 장치의 설정(setting) 또는 구성(configuration)에 따라, 단일 화면(single screen)을 제공할 수도 있고, 다중 화면들(multiple screens)을 제공할 수도 있다. 예를 들면, 제2 서브 영역 은, 제1 서브 영역 내에서 제1 화면을 제공하는 동안, 제2 화면 및 제3 화면을 제공할 수 있다. 다양한 실시예들에서, 제3 화면은, 제2 화면 아래에서(below) 배치될 수 있다. 다양한 실시예들에서, 디스플레이가 폴더블 디스플레이로 구성되는 경우, 상기 제1 영역은, 복수의 부분들 로 구성될 수 있다. 예를 들면, 디스플레이가 폴더블 디스플레이로 구성되는 경우, 상기 제1 영역은 제1 하우징의 상기 제1 면에 상응하는 부분 및 상기 제3 면에 상응하는 부분으로 구성되거나 (configured with) 부분 및 부분을 포함할 수 있다. 다양한 실시예들에서, 부분은, 제1 하우 징의 상기 제1 면 위에 있는 제1 부분, 상기 제1 면 위에 있고 제1 부분 옆에 있으며 접이부 의 적어도 일부 위에 있는 제2 부분를 포함하거나 제1 부분 및 제2 부분으로 구성될 수 있 다. 다양한 실시예들에서, 부분은 제2 하우징의 상기 제3 면 위에 있는 제3 부분, 상기 제3 면 위에 있고 제3 부분 옆에 있으며 접이부의 적어도 일부 위에 있는 제4 부분을 포함하거나 제3 부분 및 제4 부분으로 구성될 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 영역 전체에서 제1 화면을 표시할 수 있다. 예를 들면, 상기 제1 화면은, 전자 장치 내에 설치된 어플리케이션으로부터 제공되는 화면일 수 있다. 예를 들어, 도 3a를 참조하면, 상태에서, 프로세서는, 디스플레이가 언폴드된 상태(unfolded state) 내에서 있는 동 안, 제1 서브 영역 및 제2 서브 영역을 포함하거나 제1 서브 영역 및 제2 서브 영역으로 구성된 상기 제1 영역 전체에서 제1 화면(A)을 표시할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 영역 전체에서 상기 제1 화면을 표시하는 동안, 지정된 입력 을 수신할 수 있다. 다양한 실시예들에서, 상기 지정된 입력은, 디스플레이 상에서 복수의 화면들을 동시 에 제공하기 위한 분할 화면 상태에 진입하기 위한 입력을 포함할 수 있다. 다양한 실시예들에서, 상기 지정된 입력은, 상기 분할 화면 상태에서 상기 제1 화면과 함께 제공될 다른 화면을 선택하기 위한 목록을 호출하기 위 한 입력을 포함할 수 있다. 예를 들면, 상기 지정된 입력은, 상기 제1 영역 내의 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른(another) 영역으로 향하는(toward) 드래그 입력을 포함할 수 있다. 다양 한 실시예들에서, 프로세서는, 상기 지정된 입력을 수신하는 것에 응답하여, 상기 제1 화면 상에 일부 중 첩으로(as partially superimposed on) 또는 오버레이 상태로 상기 목록을 표시할 수 있다. 예를 들면, 상기 목록은, 상기 제2 서브 영역 내에서 실행되었던 어플리케이션들 중 일부를 지시하기 위한 적어도 하나의 시각적 객체를 포함할 수 있다. 예를 들어, 도 3a를 참조하면, 상태에서, 프로세서는, 상기 제1 영역 전체에서 상기 제1 화면을 표시 하는 동안, 상기 지정된 입력으로 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 드래그 입력을 수신할 수 있다. 프로세서는, 드래그 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 프로세서는, 상태에서, 전자 장치 의 상태가 상기 분할 화면 상태에서 제1 화면(A)과 함께 제공될 다른 화면을 선택할 수 있는 상태임을 나타내기(indicate) 위해, 제1 화면(A) 위에서(over) 음영 영역(shaded region)을 표시할 수 있다. 대안적 으로, 프로세서는, 상태와 달리, 전자 장치의 상태가 상기 분할 화면 상태에서 제1 화면(A)과 함께 제공될 다른 화면을 선택할 수 있는 상태임을 나타내기(indicate) 위해, 제1 화면(A)을 블러할(blur) 수도 있다. 프로세서는, 상태에서, 제2 서브 영역 위에 일부 중첩으로 목록을 표시할 수 있다. 다양한 실시예들에서, 목록은, 적어도 하나의 실행가능한 객체를 포함할 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 실행가능한 객체는, 제2 서브 영역 내에서 실행되었던 어플리케이션들 중 일부를 지시 할 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 실행가능한 객체 중 적어도 일부는, 목록을 스크 롤하기 위한 입력에 기반하여, 적어도 하나의 다른 실행가능한 객체로 대체될 수 있다. 예를 들면, 프로세서 는, 목록을 스크롤하기 위한 상기 입력에 기반하여, 제2 서브 영역 내에서 실행되었던 상기 어 플리케이션들 중 다른 일부를 지시하는 상기 적어도 하나의 다른 실행가능한 객체를 목록 내에서 표시할 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 실행가능한 객체의 식별 또는 상기 적어도 하나의 실행가 능한 객체의 표시 순서는, 제2 서브 영역의 동작 이력을 포함하는 실행 휴리스틱스(execution heuristic s)에 기반하여 결정될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 실행가능한 객체의 표시 순서 (display order)는, 최근 실행 이력(또는 실행 순서)에 기반하여 결정될 수 있다. 예를 들면, 목록 내의 상기 적어도 하나의 실행가능한 객체 중 최상단에 배치된 실행가능한 객체(H)는 상기 적어도 하나의 실행가능한 객체에 의해 지시되는 적어도 하나의 어플리케이션 중 가장 최근에 제2 서브 영역 내에서 실행되었던 어플 리케이션을 지시하기 위한 실행가능한 객체일 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 실행가능한 객체의 표시 순서는, 제1 화면(A)와의 연관도에 기반하여 결정될 수 있다. 예를 들면, 목록 내의 상기 적 어도 하나의 실행가능한 객체 중 최상단에 배치된 실행가능한 객체(H)는, 상기 적어도 하나의 실행가능한 객체 에 의해 지시되는 적어도 하나의 어플리케이션 중 제1 화면(A)와의 연관도가 가장 높은 어플리케이션을 지시하 기 위한 실행가능한 객체일 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 실행가능한 객체의 표시 순서 는, 현재 시각에 기반하여 결정될 수 있다. 예를 들면, 프로세서는, 현재 시각에 가장 자주 실행되었던 어플리케이션을 지시하는 실행가능한 객체(H)를 식별하고, 실행가능한 객체(H)를 목록의 최상단에서 표시 할 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 실행가능한 객체의 표시 순서는, 전자 장치가 위 치된 장소에 기반하여 결정될 수 있다. 예를 들어, 프로세서는, 전자 장치가 집에 위치됨을 전자 장 치의 통신 회로 또는 전자 장치의 GPS 모듈 중 적어도 하나를 이용하여 식별하는 것에 기반하여, 집 에서 가장 자주 실행되었던 음악 재생 어플리케이션을 지시하는 실행가능한 객체(H)를 식별하고, 실행가능한 객 체(H)를 목록의 최상단에서 표시할 수 있다. 다른 예를 들어, 프로세서는, 전자 장치가 자동차 내에 위치됨을 전자 장치의 통신 회로 또는 전자 장치의 GPS 모듈 중 적어도 하나를 이용하여 식별하 는 것에 기반하여, 자동차에서 가장 자주 실행되었던 네비게이션 어플리케이션을 지시하는 실행가능한 객체(H) 를 식별하고, 실행가능한 객체(H)를 목록의 최상단에서 표시할 수 있다. 하지만, 이에 제한되지 않는다. 다양한 실시예들에서, 프로세서는, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실 행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고, 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시할 수 있다. 예를 들면, 상기 입력은, 싱글 탭 입력을 포함할 수 있다. 예를 들면, 상기 입력은, 기준 크 기보다 작은 누름 강도(depression strength)로 상기 제1 실행가능한 객체를 터치하는 것일 수 있다. 다른 예 를 들면, 상기 입력은, 기준 시간보다 짧은 시간 동안 상기 제1 실행가능한 객체를 터치하는 것일 수 있다. 하 지만, 이에 제한되지 않는다. 예를 들어, 도 3a를 참조하면, 상태에서, 프로세서는, 목록 내의 제1 실행가능한 객체(B)를 선 택하기 위한 입력을 수신할 수 있다. 프로세서는, 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 내에서 제1 화면(A)을 표 시하고, 제2 서브 영역 내에서 제1 실행가능한 객체(B)에 의해 지시되는 어플리케이션의 실행 화면(B)을 표시할 수 있다. 예를 들면, 프로세서는, 제1 화면(A)과 동시에 함께 실행 화면(B)을 표시함으로써, 분할 화면 상태를 제공할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제 2 서브 영역 내에서 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2 드래그 입력을 수신할 수 있다. 예를 들면, 프로세서는, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제2 서브 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제2 서브 영역 내의 다른 영역으로 향하는상기 제2 드래그 입력을 수신할 수 있다. 다양한 실시예들에서, 프로세서(1200는, 상기 제2 드래그 입력의 상 기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 목록을 표시할 수 있다. 다양한 실시예들에서, 상기 제2 서브 영역 내에서 상기 실행 화면을 제공하고 있는 어플리케이션을 지시하는 상기 제1 실행가능한 객체는, 상기 제2 드래그 입력의 수신에 응답하여 표시되는 상기 목록으로부터 제거될 수 있다. 다양한 실시예들에서, 상기 제2 서브 영역 내에서 상기 실행 화면을 제공하고 있는 상기 어플 리케이션이 멀티 태스킹을 제공할 수 있는 어플리케이션인 경우, 상기 제1 실행가능한 객체는, 상기 제2 드래그 입력의 수신에 응답하여 표시되는 상기 목록으로부터 제거되지 않고 유지될 수도 있다. 예를 들어, 도 3b를 참조하면, 프로세서는, 상태에서, 제1 서브 영역 내에서 제1 화면(A)을 표 시하고 제2 서브 영역 내에서 실행 화면(B)를 표시할 수 있다. 프로세서는, 상태에서, 제2 서 브 영역의 엣지 영역으로부터 제2 서브 영역 내의 다른 영역으로 향하는 제2 드래그 입력을 수 신할 수 있다. 프로세서는, 제2 드래그 입력의 상기 수신에 응답하여, 상태를 상태로 전 환할 수 있다. 상태에서, 프로세서는, 전자 장치의 상태가 상기 분할 화면 상태에서 제1 화면 (A) 및 실행 화면(B)과 함께 제공될 다른 화면을 선택할 수 있는 상태임을 나타내기 위해, 제1 화면(A) 및 실행 화면(B) 위에서(over) 음영 영역을 표시할 수 있다. 대안적으로, 프로세서는, 상태와 달리, 전 자 장치의 상태가 상기 분할 화면 상태에서 제1 화면(A) 및 실행 화면(B)과 함께 제공될 다른 화면을 선택 할 수 있는 상태임을 나타내기 위해, 제1 화면(A) 및 실행 화면(B)을 블러할 수도 있다. 프로세서는, 상 태에서, 제2 서브 영역 위에 일부 중첩으로 목록을 표시할 수 있다. 실행 화면(B)를 제공하는 어플리케이션이 멀티 태스킹을 지원하지 않는 어플리케이션인 경우, 목록은 목록과 달리, 제1 실행가 능한 객체(B)를 포함하지 않을 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면 및 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 위에 중첩으로 상기 목록을 표시하는 동안, 상기 목록 내에 포함된 적어 도 하나의 실행가능한 객체 중 제2 실행가능한 객체를 선택하기 위한 입력을 수신할 수 있다. 프로세서는, 상기 제2 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시를 유지하고, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 축소하며, 상기 축소된 실행 화면 아래에서(below) 상기 제2 실행가능한 객체에 의해 지시되는 다른(another) 어플리케이션의 다른(another) 실행 화면을 표시할 수 있다. 예를 들어, 도 3b를 참조하면, 프로세서는, 상태에서, 목록 내에 포함된 제2 실행가능한 객체 (C)를 선택하기 위한 입력을 수신할 수 있다. 프로세서는, 입력의 상기 수신에 응답하여, 상태 를 상태으로 전환할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 내에서의 제1 화면(A)의 표시를 유지하고, 제2 서브 영역 내에서 표시되는 실행 화면(B)를 축소하며, 축소된 실행 화면 (B) 아래에서 제2 실행가능한 객체(C)에 의해 지시되는 다른 어플리케이션의 다른 실행 화면(C)를 표시할 수 있 다. 다양한 실시예들에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에 서 상기 실행 화면 및 상기 다른 실행 화면을 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제3 드래그 입력을 수신할 수 있다. 프로세서 는, 상기 제3 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 및 상기 다른 실행 화면 상에 일부 중첩으로 상기 실행 화면을 제공하는 어플리케이션을 지시하기 위한 상기 제 1 실행가능한 객체 및 상기 다른 실행 화면을 제공하는 다른 어플리케이션을 지시하기 위한 상기 제2 실행가능 한 객체가 제외된 목록을 표시할 수 있다. 다양한 실시예들에서, 상기 실행 화면을 제공하는 상기 어플리케이 션 또는 상기 다른 실행 화면을 제공하는 상기 다른 어플리케이션 중 적어도 하나가 멀티 태스킹을 제공할 수 있는 어플리케이션인 경우, 상기 제1 실행가능한 객체 또는 상기 제2 실행가능한 객체 중 적어도 하나는, 상기 제3 드래그 입력의 수신에 응답하여 표시되는 상기 목록으로부터 제거되지 않고 유지될 수도 있다. 예를 들어, 도 3b를 참조하면, 프로세서는, 상태에서, 제1 서브 영역 내에서 제1 화면(A)을 표 시하고 제2 서브 영역 내에서 실행 화면(B) 및 다른 실행 화면(C)를 표시할 수 있다. 프로세서는, 상태에서, 제2 서브 영역의 엣지 영역으로부터 제2 서브 영역 내의 다른 영역으로 향하는 제3 드래그 입력을 수신할 수 있다. 프로세서는, 제3 드래그 입력의 상기 수신에 응답하여, 상태 를 상태로 전환할 수 있다. 상태에서, 프로세서는, 전자 장치의 상태가 상기 분할 화면 상태에서 제1 화면(A) 및 실행 화면(B)과 함께 제공될 다른 화면을 선택할 수 있는 상태임을 나타내기 위 해, 제1 화면(A), 실행 화면(B), 및 다른 실행 화면(C) 위에서 음영 영역을 표시할 수 있다. 대안적으로,프로세서는, 상태와 달리, 전자 장치의 상태가 상기 분할 화면 상태에서 제1 화면(A) 및 실행 화면(B)과 함께 제공될 다른 화면을 선택할 수 있는 상태임을 나타내기 위해, 제1 화면(A), 실행 화면(B), 및 다른 실행 화면(C)을 블러할 수도 있다. 프로세서는, 상태에서, 제2 서브 영역 위에 일부 중첩 으로 목록을 표시할 수 있다. 실행 화면(B)를 제공하는 어플리케이션 또는 다른 실행 화면(C)를 제공하는 다른 어플리케이션 중 적어도 하나가 멀티 태스킹을 지원하지 않는 어플리케이션인 경우, 목록은, 목록 및 목록과 달리, 제1 실행가능한 객체(B) 및 제2 실행가능한 객체(C)를 포함하지 않을 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 및 상기 다른 실 행 화면 위에 중첩으로 상기 목록을 표시하는 동안, 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제3 실행가능한 객체를 선택하기 위한 입력을 수신할 수 있다. 프로세서는, 상기 제3 실행가능한 객체를 선택하기 위한 상기 입력을 수신햐는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시 및 상기 제2 서브 영역의 일부 내에서의 상기 실행 화면의 상기 표시를 유지하고, 상기 제2 서브 영역의 남은 일부 내에서 표시되는 상기 다른 실행 화면을 상기 제3 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면으로 전환할 수 있다. 예를 들어, 도 3b를 참조하면, 프로세서는, 상태에서, 목록 내에 포함된 제3 실행가능한 객체 (D)를 선택하기 위한 입력(317-1)을 수신할 수 있다. 프로세서는, 입력(317-1)의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 내에서의 제1 화면(A)의 표시 및 제2 서브 영역의 일부 내에서의 실행 화면(B)의 표시를 유지하고, 제2 서브 영역 의 남은 일부 내에서 표시되는 다른 실행 화면(C)를 제3 실행가능한 객체(D)에 의해 지시되는 어플리케이션의 실행 화면(D)으로 전환할 수 있다. 다양한 실시예들에서, 실행 화면(C)을 제3 실행가능한 객체(D)에 의해 지시 되는 어플리케이션의 실행 화면(D)으로 전환하는 경우, 실행가능한 객체(C)는 목록 내의 상기 적어도 하나 의 실행가능한 객체 중 최상단에 배치될 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 영역 내에서 상기 제1 화면, 및 상기 제1 영역 내에서 표시되 는 상기 제1 화면 위에 중첩된 상기 목록을 표시하는 동안, 상기 목록 내에 포함된 지정된 객체를 선택하기 위 한 입력을 수신할 수 있다. 다양한 실시예들에서, 상기 지정된 객체는, 상기 목록의 표시 영역을 확장하기 위 한 객체일 수 있다. 다양한 실시예들에서, 상기 지정된 객체는, 상기 제1 영역 내에서 표시되는 상기 제1 화면 위에 중첩된 상기 목록의 면적의 제한으로 인하여, 상기 목록에 대한 스크롤 입력에 기반하여 새롭게 표시되는 상기 적어도 하나의 다른 실행가능한 객체를 상기 적어도 하나의 실행가능한 객체와 함께 표시하기 위한 객체일 수 있다. 다양한 실시예들에서, 프로세서는, 상기 지정된 객체를 선택하기 위한 상기 입력을 수신하는 것 에 응답하여, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면 및 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 확장된 목록(expanded list)으로 전환할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 지정된 객체를 선택하기 위한 상기 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면 및 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 위에 일부 중첩으로 상기 확장된 목록을 표시 할 수도 있다. 하지만, 이에 제한되지 않는다. 다양한 실시예들에서, 목록 또는 확장된 목록 내에 포함된 실행가능한 객체들 중 상위에 표시되는 적어도 하나 의 실행가능한 객체(예: 여섯 개의 실행가능한 객체들)는, 최근 실행된 순서대로 표시되고, 상기 실행가능한 객 체들 중 남은 실행가능한 객체들은, 알파벳 순으로 표시될 수 있다. 다양한 실시예들에서, 상기 상위에 표시되 는 적어도 하나의 실행가능한 객체의 수는, 사용자의 지정 또는 전자 장치의 세팅에 기반하여 결정될 수 있다. 다양한 실시예들에서, 사용자의 전자 장치의 이용에 의해 최근 실행된 어플리케이션이 변경되는 경 우, 상위에 표시되는 상기 적어도 하나의 실행가능한 객체는 변경될 수 있다. 예를 들어, 상기 남은 실행가능 한 객체들 중 하나의 실행가능한 객체에 의해 지시되는 어플리케이션이 사용자의 전자 장치의 이용에 의해 실행되는 경우, 프로세서는, 상위에 표시되는 상기 적어도 하나의 실행가능한 객체가 상기 어플리케이션을 지시하기 위한 상기 실행가능한 객체를 포함하도록 상기 목록 또는 상기 확장된 목록을 갱신할 수 있다. 다양 한 실시예들에서, 상기 남은 실행가능한 객체들 내에 포함되었던 상기 어플리케이션을 지시하기 위한 상기 실행 가능한 객체는, 사용자의 전자 장치의 상기 이용에 의해, 상기 남은 실행가능한 객체들로부터 제거될 수 있다. 예를 들어, 도 3c를 참조하면, 상태에서, 프로세서는, 제1 서브 영역 및 제2 서브 영역을 포함하는 제1 영역 내에서 제1 화면(A)를 표시하고, 제1 화면(A) 상에 일부 중첩으로 목록을 표시할 수 있 다. 다양한 실시예들에서, 목록은, 적어도 하나의 실행가능한 객체뿐 아니라 상기 지정된 객체(예: 메뉴 아이콘)를 포함할 수 있다. 프로세서는, 상기 지정된 객체를 선택하기 위한 입력을 수신하는 것에응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 전자 장치의 상태 가 상기 분할 화면 상태에서 제1 화면(A)과 함께 제공될 다른 화면을 선택할 수 있는 상태임을 나타내기 위해, 제1 화면(A) 위에서 음역 영역을 표시할 수 있다. 대안적으로, 프로세서는, 전자 장치의 상태 가 상기 분할 화면 상태에서 제1 화면(A)과 함께 제공될 다른 화면을 선택할 수 있는 상태임을 나타내기 위해, 제1 화면(A)을 블러할 수도 있다. 상태에서, 프로세서는, 확장된 목록을 표시할 수 있다. 다 양한 실시예들에서, 확장된 목록은, 상태와 같이, 제1 화면(A) 위에 중첩될 수 있다. 다양한 실시예 들에서, 확장된 목록은, 도 3c의 도시와 달리, 제1 화면(A)로부터 전환될 수도 있다. 하지만, 이에 제한 되지 않는다. 다양한 실시예들에서, 확장된 목록은, 상태 내에서의 목록 내에 표시되는 실행가 능한 객체들뿐 아니라 다른 실행가능한 객체들을 더 포함할 수 있다. 예를 들면, 상기 다른 실행가능한 객체들 은, 상태 내에서의 목록에 대한 스크롤 입력에 의해, 목록 내에서 나타나는 실행가능한 객체들 일 수 있다. 다양한 실시예들에서, 프로세서는, 상기 확장된 목록 내에 포함된 실행가능한 객체들 중 하나의 실행가능 한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 영역 내에서 표시되었던 상기 제1 화면을 축소하고, 상기 축소된 제1 화면을 상기 제1 서브 영역 내에서 표시하고, 상기 제2 서브 영역 내에서 상기 선택 된 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 표시할 수 있다. 예를 들어, 도 3c를 참조하면, 상태에서, 프로세서는, 확장된 목록 내에 포함된 제1 실행가능한 객체(B)를 선택하기 위한 입력을 수신할 수 있다. 프로세서는, 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 내에서 제1 화면(A)을 표시하고 제2 서브 영역 내에서 제1 실행가능한 객체(B)에 의해 지시되는 어플리케이션의 실행 화면(B)를 표시할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을, 상기 제2 서브 영역 내에 서 상기 제1 실행가능한 객체에 의해 지시되는 상기 어플리케이션의 상기 실행 화면을, 상기 실행 화면 상에 중 첩으로 상기 목록을 표시하는 동안, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된(held) 제2 실행가능한 객체를 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제2 사용자 입력에 의해 이동되는 상기 제2 실행가능한 객체의 목적지(destination)에 기반하여 상기 제1 서브 영역 및 상기 제2 서브 영역에 표시될 화면들을 결정할 수 있다. 예를 들면, 상기 제1 사용자 입력은, 기 준 크기보다 큰 누름 강도로 상기 제2 실행가능한 객체를 터치하는 것일 수 있다. 다른 예를 들면, 상기 제1 사용자 입력은, 기준 시간보다 긴 시간 동안 상기 제2 실행가능한 객체를 터치하는 것일 수 있다. 하지만, 이 에 제한되지 않는다. 예를 들면, 상기 제2 사용자 입력은, 상기 제1 사용자 입력에 의해 홀드된 상기 제2 실행 가능한 객체를 이동(드래그)한 후 상기 이동된 제2 실행가능한 객체를 드랍하는 입력일 수 있다. 예를 들어, 상기 제1 사용자 입력에 의해 홀드된 상기 제2 실행가능한 객체가 상기 제2 사용자 입력에 의해 상 기 제1 서브 영역에 드랍되는 경우, 프로세서는, 상기 제2 서브 영역 내에서의 상기 실행 화면의 상기 표 시를 유지하고 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면을 상기 제2 실행가능한 객체에 의해 지시되 는 상기 다른 어플리케이션의 상기 다른 실행 화면으로 전환할 수 있다. 예를 들어, 도 4a를 참조하면, 프로세 서는, 상태에서 제2 드래그 입력을 수신할 수 있다. 프로세서는, 제2 드래그 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 화면 (A) 및 실행 화면(B) 상에 적어도 일부 중첩된 음영 영역 및 목록을 표시할 수 있다. 상태에서, 프로세서는, 목록 내에 포함된 제2 실행가능한 객체(C)를 홀드하기 위한 제1 사용자 입력을 수신할 수 있다. 프로세서는, 제1 사용자 입력에 의해 홀드된 제2 실행가능한 객체(C) 를 제1 서브 영역으로 이동하기 위한 제2 사용자 입력을 상태에서 수신할 수 있다. 프로세서 는, 제2 사용자 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태(40 3)에서, 프로세서는, 제2 서브 영역 내에서의 실행 화면(B)의 상기 표시를 유지하고 제1 서브 영역 내에서 표시되는 제1 화면(A)을 제2 실행가능한 객체(C)에 의해 지시되는 상기 다른 어플리케이션의 다른 실행 화면(C)으로 전환할 수 있다. 다른 예를 들어, 상기 제1 사용자 입력에 의해 홀드된 상기 제2 실행가능한 객체가 상기 제2 사용자 입력에 의 해 상기 제2 서브 영역에 드랍되는 경우, 프로세서는, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시를 유지하고, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 상기 다른 어플리케이션의 상기 다른 실행 화면으로 전환할 수 있다. 예를 들어, 도 4b를 참조하면, 프로세서는, 상태에서 제2 드래그 입 력을 수신할 수 있다. 프로세서는, 제2 드래그 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 화면(A) 및 실행 화면(B) 상에 적어도 일부 중첩된 음영 영역 및 목록을 표시할 수 있다. 상태에서, 프로세서는, 목록 내에 포 함된 제2 실행가능한 객체(C)를 홀드하기 위한 제1 사용자 입력을 수신할 수 있다. 프로세서는, 제1 사용자 입력에 의해 홀드된 제2 실행가능한 객체(C)를 제2 서브 영역으로 이동하기 위한 제2 사용자 입력을 상태에서 수신할 수 있다. 프로세서는, 제2 사용자 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 내에서의 제1 화면(A)의 상기 표시를 유지하고 제2 서브 영역 내에서 표시되는 실행 화면(B)을 제2 실행가능한 객체(C) 에 의해 지시되는 상기 다른 어플리케이션의 다른 실행 화면(C)으로 전환할 수 있다. 또 다른 예를 들어, 상기 제1 사용자 입력에 의해 홀드된 상기 제2 실행가능한 객체가 상기 제2 사용자 입력에 의해 상기 제1 서브 영역과 상기 제2 서브 영역 사이의 경계를 포함하는 지정된 영역에 드랍되는 경우, 프로세 서는, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시 및 상기 제2 서브 영역 내에서의 상기 실 행 화면의 상기 표시를 유지하고 상기 제1 서브 영역 내에서 유지되는 상기 제1 화면 및 상기 제2 서브 영역 내 에서 유지되는 상기 제2 화면 상에 중첩으로 상기 다른 어플리케이션의 상기 다른 실행 화면을 표시할 수 있다. 예를 들어, 도 4c를 참조하면, 프로세서는, 상태에서 제2 드래그 입력을 수신할 수 있다. 프로 세서는, 제2 드래그 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태 에서, 프로세서는, 제1 화면(A) 및 실행 화면(B) 상에 적어도 일부 중첩된 음영 영역 및 목록 을 표시할 수 있다. 상태에서, 프로세서는, 목록 내에 포함된 제2 실행가능한 객체(C)를 홀드하기 위한 제1 사용자 입력을 수신할 수 있다. 프로세서는, 제1 사용자 입력에 의해 홀드 된 제2 실행가능한 객체(C)를 제1 서브 영역 및 제2 서브 영역 사이의 경계를 포함하는 지정된 영역 으로 이동하기 위한 제2 사용자 입력을 상태에서 수신할 수 있다. 다양한 실시예들에서, 지정 된 영역은, 제2 실행가능한 객체(C)에 의해 지시되는 상기 다른 어플리케이션의 다른 실행 화면(C)을 창 모드(window mode)로 표시하기 위해 정의된 영역일 수 있다. 다양한 실시예들에서, 지정된 영역은, 제1 서브 영역 및 제2 서브 영역 사이의 경계로부터 지정된 거리 이내의 영역일 수 있다. 프로세서(12 0)는, 제2 사용자 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에 서, 프로세서는, 제1 서브 영역 내에서의 제1 화면(A)의 상기 표시 및 제2 서브 영역 내에서의 실행 화면(B)의 표시를 유지하고 제1 화면(A) 및 실행 화면(B) 상에 일부 중첩으로 제2 실행가능한 객체(C)에 의해 지시되는 상기 다른 어플리케이션의 다른 실행 화면(C)을 포함하는 창(예: 팝업 뷰(pop up view) 또 는 플로팅 윈도우(floating window))을 표시할 수 있다. 또 다른 예를 들어, 상기 제1 사용자 입력에 의해 홀드된 상기 제2 실행가능한 객체가 상기 목록에 드랍되는 경 우, 프로세서는, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시 및 상기 제2 서브 영역 내에서 의 상기 실행 화면의 상기 표시를 유지하고 상기 제2 실행가능한 객체를 상기 목록 내에 다시 삽입할 수 있다. 예를 들어, 도 4d를 참조하면, 프로세서는, 상태에서 제2 드래그 입력을 수신할 수 있다. 프로 세서는, 제2 드래그 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태 에서, 프로세서는, 제1 화면(A) 및 실행 화면(B) 상에 적어도 일부 중첩된 음영 영역 및 목록 을 표시할 수 있다. 상태에서, 프로세서는, 목록 내에 포함된 제2 실행가능한 객체(C)를 홀드하기 위한 제1 사용자 입력을 수신할 수 있다. 프로세서는, 제1 사용자 입력에 의해 홀드 된 제2 실행가능한 객체(C)를 목록 내에 다시 삽입하기 위한 제2 사용자 입력을 상태에서 수신 할 수 있다. 프로세서는, 제2 사용자 입력의 상기 수신에 응답하여, 상태를 상태로 전환 할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 내에서의 제1 화면(A)의 상기 표시 및 제2 서브 영역 내에서의 실행 화면(B)의 표시를 유지하고 제2 실행가능한 객체(C)를 목록 내에 다시 삽입 할 수 있다. 다양한 실시예들에서, 제1 사용자 입력에 의해 홀드된 제2 실행가능한 객체(C)가 목록으로부터 목록 의 외부 영역으로 이동되는 경우, 프로세서는, 목록을 숨기거나 상태과 같이 간소화된 목 록(311-1)를 표시할 수 있다. 프로세서는, 제1 사용자 입력에 의해 홀드된 제2 실행가능한 객체(C) 가 간소화된 목록(311-1)로부터 지정된 거리 이내로 진입하는 경우, 간소화된 목록(311-1)을 목록으로 전 환할 수 있다. 다양한 실시예들에서, 제1 사용자 입력에 의해 홀드된 실행가능한 객체(C)는 제2 사용자 입력에 의해 목록(311-1)으로부터 전환된 목록 내에 삽입될 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 중첩된 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 상기 제1 실행가능한 객체를 선택하기 위한 상기 입력을수신하는 것에 응답하여, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시가능한지(displayable) 여부를 식별 할 수 있다. 프로세서는, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시가능함을 식별하는 것에 기반 하여, 상기 제1 서브 영역 내에서 상기 제1 화면을 표시하고 상기 제2 서브 영역 내에서 상기 제1 실행가능한 객체에 의해 지시되는 상기 어플리케이션의 상기 실행 화면을 표시할 수 있다. 프로세서는, 상기 제1 화 면이 상기 제1 서브 영역 내에서 표시불가능함을 식별하는 것에 기반하여, 상기 제1 영역 내에서의 상기 제1 화 면의 상기 표시를 유지하고 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로 상기 어플리케이 션의 상기 실행 화면을 표시할 수 있다. 예를 들어, 도 5를 참조하면, 상태에서, 프로세서는, 제1 드래그 입력을 수신할 수 있다. 프로세서는, 제1 드래그 입력의 상기 수신에 응답하여, 상태 를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 및 제2 서브 영역 을 포함하는 상기 제1 영역 상에 중첩된 음영 영역과 제2 서브 영역 상에 일부 중첩된 목록 을 표시할 수 있다. 목록은 적어도 하나의 실행가능한 객체를 포함할 수 있다. 상태에서, 프 로세서는, 목록 내에 포함된 제1 실행가능한 객체(B)를 선택하기 위한 입력을 수신할 수 있다. 프로세서는, 입력의 상기 수신에 응답하여, 제1 화면(A)가 제1 서브 영역 내에서 표시가능한지 여부를 식별할 수 있다. 프로세서는, 제1 화면(A)가 상기 제1 서브 영역 내에서 표시가능함을 식별 하는 것에 기반하여, 상태를 도 3a의 상태로 전환할 수 있다. 프로세서는, 제1 화면(A)가 상기 제1 서브 영역 내에서 표시불가능함을 식별하는 것에 기반하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 상기 제1 영역 내에서의 제1 화면(A)의 상기 표시를 유지하고, 제1 화면(A) 상에 중첩되고 제1 실행가능한 객체(B)에 의해 지시되는 상기 어플리케이션의 실행 화면(B)를 포함하는 창(50 2)을 표시할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면 및 상기 다른 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제1 서브 영역 내에서 실행되었던 어플리케 이션들 중 일부를 지시하기 위한 적어도 하나의 다른 실행가능한 객체를 포함하는 다른 목록을 표시하기 위한 입력을 수신할 수 있다. 프로세서는, 상기 입력의 상기 수신에 응답하여, 상기 제1 서브 영역 내에서 표 시되는 상기 제1 화면을 상기 제1 화면을 제공하는 어플리케이션을 지시하기 위한 실행가능한 객체 및 상기 적 어도 하나의 다른 실행가능한 객체를 포함하는 상기 다른 목록으로 전환하고, 상기 제2 서브 영역 내에서의 상 기 실행 화면의 상기 표시를 유지할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 다른 목록 내에 포 함된 상기 적어도 하나의 다른 실행가능한 객체 및 상기 제1 화면을 제공하는 어플리케이션을 지시하기 위한 상 기 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된 실행가능한 객체를 상기 제2 서브 영역으로 이동하기 위 한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서 상기 이동된 실행가능한 객체가 제 외된 상기 다른 목록을 표시하고 상기 제2 서브 영역 내에서 상기 이동된 실행가능한 객체에 의해 지시되는 어 플리케이션의 실행 화면을 표시할 수 있다. 예를 들면, 상기 제1 사용자 입력은, 기준 크기보다 큰 누름 강도 로 상기 다른 목록 내의 상기 실행가능한 객체를 터치하는 것일 수 있다. 다른 예를 들면, 상기 제1 사용자 입 력은, 기준 시간보다 긴 시간 동안 상기 목록 내의 상기 실행가능한 객체를 터치하는 것일 수 있다. 하지만, 이에 제한되지 않는다. 예를 들면, 상기 제2 사용자 입력은, 상기 제1 사용자 입력에 의해 홀드된 상기 실행가 능한 객체를 이동한 후 상기 이동된 실행가능한 객체를 드랍하는 입력일 수 있다. 예를 들어, 도 6을 참조하면, 프로세서는, 상태에서, 다른 목록을 제1 서브 영역 내에서 표시하고 실행 화면(B) 및 다른 실행 화면(C)를 제2 서브 영역 내에서 표시할 수 있다. 프로세서는, 상태에서, 다른 목록 내의 실행가능한 객체(A)를 홀드하기 위한 제1 사용자 입력을 수신할 수 있다. 프로세서는, 제1 사용자 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 사용자 입력에 의해 홀드된 실행가능한 객체(A)로부터 변환 된 실행가능한 객체를 표시할 수 있다. 상태에서의 실행가능한 객체의 형상은, 상태에서 의 실행가능한 객체(A)의 형상과 다를 수 있다. 프로세서는, 상태에서, 제1 사용자 입력에 의 해 홀드된 실행가능한 객체를 제2 서브 영역의 일부 내에서 표시되는 실행 화면(B)으로 이동하기 위 한 제2 사용자 입력을 수신할 수 있다. 프로세서는, 제2 사용자 입력의 상기 수신에 응답하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 실행 화면(B)을 실행가능한 객체 에 의해 지시되는 어플리케이션의 실행 화면(A)로 전환할 수 있다. 상태에서, 프로세서는, 실 행가능한 객체(A)가 제외된 다른 목록을 제1 서브 영역 내에서 표시할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에 서 상기 실행 화면을 표시하는 동안, 지정된 이벤트를 검출할 수 있다. 다양한 실시예들에서, 상기 지정된 이 벤트는, 알림 메시지(notification message)를 폴더블 디스플레이 상에서 표시하는 이벤트일 수 있다. 예를 들면, 상기 지정된 이벤트는, 상기 제1 영역의 상단에서 상기 알림 메시지를 표시하는 이벤트일 수 있다. 프로세서는, 상기 검출에 응답하여, 상기 제1 서브 영역 및 상기 제2 서브 영역 상에 일부 중첩으로 상기 알림 메시지를 표시할 수 있다. 프로세서는, 상기 알림 메시지에 대한 입력에 기반하여, 상기 제1 서브 영역 및 상기 제2 서브 영역 내에서 표시되는 화면을 결정할 수 있다. 예를 들어, 도 7을 참조하면, 상태에서, 프로세서는, 제1 화면(A)을 제1 서브 영역 내에서 실행 화면(B)을 제2 서브 영역 내에서 표시하는 동안, 상기 지정된 이벤트를 검출할 수 있다. 프로세서는, 상기 검출에 응답하여, 상태에서, 제1 화면(A) 및 실행 화면(B) 상에 일부 중첩으로 알 림 메시지를 표시할 수 있다. 프로세서는, 상태에서 알림 메시지에 대한 제1 사용자 입력 을 수신하는 것에 응답하여, 상태를 상태로 전환할 수 있다. 다양한 실시예들에서, 제1 사용자 입력은, 기준 크기 미만의 누름 강도로 알림 메시지를 터치하는 것일 수 있다. 다양한 실시예들에서, 제1 사용자 입력은, 기준 시간 미만의 시간 동안 알림 메시지를 터치하는 것일 수 있 다. 상태에서, 프로세서는, 알림 메시지를 제공하는 어플리케이션의 다른 실행 화면(C)을 제1 서브 영역 및 제2 서브 영역을 포함하는 상기 제1 영역 내에서 표시할 수 있다. 실시예들에 따라, 프로세서는, 상태에서 제1 사용자 입력을 수신하는 것에 응답하여, 상태를 상태로 전 환할 수도 있다. 프로세서는, 상태에서 알림 메시지를 홀드하기 위한 제2 사용자 입력을 수신하고 제2 사용 자 입력에 의해 홀드된 알림 메시지를 제1 서브 영역으로 이동하기 위한 제3 사용자 입력 을 수신할 수 있다. 다양한 실시예들에서, 제2 사용자 입력은 상기 기준 크기 이상의 누름 강도로 알림 메시지를 터치하는 것일 수 있다. 다양한 실시예들에서, 제2 사용자 입력은 상기 기준 시간 이상의 시간 동안 알림 메시지를 터치하는 것일 수 있다. 프로세서는, 제2 사용자 입력 및 제3 사용자 입력에 기반하여, 상태를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 내에서 표시되는 제1 화면(A)을 알림 메시지를 제공하는 어플리케이션의 다른 실행 화면(C)로 전환하고 제2 서브 영역 내에서의 실행 화면(B)의 표시를 유지할 수 있다. 실시예들에 따라, 제2 사용자 입력에 의해 홀드된 알림 메시지가 제1 서브 영역 위에서 머무르는 동안, 프로세서는 제1 서브 영역 위에서(over) 도 3의 음영 영역와 같은 음영 영역을 표시할 수도 있다. 프로세서는, 상태에서 알림 메시지를 홀드하기 위한 제2 사용자 입력을 수신하고 제2 사용 자 입력에 의해 홀드된 알림 메시지를 제2 서브 영역으로 이동하기 위한 제3 사용자 입력 을 수신할 수 있다. 프로세서는, 제2 사용자 입력 및 제3 사용자 입력에 기반하여, 상태 를 상태로 전환할 수 있다. 상태에서, 프로세서는, 제1 서브 영역 내에서의 제1 화면(A) 의 표시를 유지하고, 제2 서브 영역 내에서 표시되는 실행 화면(B)를 알림 메시지를 제공하는 어플리 케이션의 다른 실행 화면(C)로 전환할 수 있다. 실시예들에 따라, 제2 사용자 입력에 의해 홀드된 알림 메시지가 제2 서브 영역 위에서 머무르는 동안, 프로세서는 제2 서브 영역 위에서(over) 도 3의 음영 영역와 같은 음영 영역을 표시할 수도 있다. 다양한 실시예들에서, 프로세서는, 알림 메시지가 제3 사용자 입력에 의해 드랍되는 위치에 기 반하여, 제2 서브 영역의 일부 내에서 알림 메시지를 제공하는 어플리케이션의 다른 실행 화면(C)을 표시할 수도 있다. 예를 들어, 프로세서는, 알림 메시지가 제3 사용자 입력에 의해 제2 서브 영역의 상위 부분에 드랍되는 경우, 제2 서브 영역의 일부 내(즉, 상단 부분)에서 다른 실행 화면 (C)를 표시하고 제2 서브 영역의 남은 일부 내에서 축소된 실행 화면(B)를 표시할 수 있다. 예를 들면, 실행 화면(B)는 다른 실행 화면(C)의 아래에서 표시될 수 있다. 실시예들에 따라, 프로세서는, 알림 메시 지가 제2 서브 영역의 상위 부분에 드랍되기 전에, 다른 실행 화면(C)가 표시될 제2 서브 영역 의 상기 일부 위에서(over) 음영 영역을 표시할 수도 있다. 다른 예를 들어, 프로세서는, 알림 메시지 가 제3 사용자 입력에 의해 제2 서브 영역의 중간 부분에 드랍되는 경우, 제2 서브 영역 내에서 실행 화면(B)를 표시하는 것을 중단하고, 제2 서브 영역의 전체 내에서 다른 실행 화면(C)를 표시 할 수 있다. 실시예들에 따라, 프로세서는, 알림 메시지가 제2 서브 영역의 중간 부분에 드랍 되기 전에, 다른 실행 화면(C)가 표시될 제2 서브 영역의 전체 위에서(over) 음영 영역을 표시할 수도 있 다. 또 다른 예를 들어, 프로세서는, 알림 메시지가 제3 사용자 입력에 의해 제2 서브 영역 의 하위 부분에 드랍되는 경우, 제2 서브 영역의 일부 내에서 축소된 실행 화면(B)를 표시하고 제2 서브 영역의 남은 일부 내에서 다른 실행 화면(C)를 표시할 수 있다. 예를 들면, 다른 실행 화면(C)는 실행 화 면(B)의 아래에서 표시될 수 있다. 실시예들에 따라, 프로세서는, 알림 메시지가 제2 서브 영역의 하위 부분에 드랍되기 전에, 다른 실행 화면(C)가 표시될 제2 서브 영역의 상기 남은 일부 위에서 (over) 음영 영역을 표시할 수도 있다. 하지만, 이에 제한되지 않는다. 다양한 실시예들에서, 프로세서는, 제1 화면(A)을 전체 화면에 표시하는 동안, 알림 메시지가 제3 사 용자 입력에 의해 제2 서브 영역의 중간 부분에 드랍되는 경우, 제1 화면(A)을 제1 서브 영역에 표시하고, 제2 서브 영역의 전체 내에서 알림 메시지를 제공하는 어플리케이션의 실행 화면(C)를 표 시할 수도 있다. 실시예들에 따라, 프로세서는, 알림 메시지가 제2 서브 영역의 중간 부분에 드랍되기 전에, 다른 실행 화면(C)가 표시될 제2 서브 영역의 전체 위에서(over) 음영 영역을 표시할 수도 있다. 상술한 바와 같이, 다양한 실시예들에 따른 전자 장치는, 전자 장치에 수신되는 다양한 인터액션들에 기반하여, 단일 화면 상태를 분할 화면 상태로 전환하거나 분할 화면 상태 내에서 제공하는 화면의 수를 제어할 수 있다. 이러한 전환 및 제어를 통해, 다양한 실시예들에 따른 전자 장치는, 강화된 사용자 경험을 제공 할 수 있다. 상술한 바와 같은, 다양한 실시예들에 따른 전자 장치는, 인스트럭션(instruction)들을 저장하는 적어도 하나의 메모리와, 폴더블(foldable) 디스플레이와, 상기 폴더블 디스플레이 및 상기 적어도 하나의 메모리와 작동적으 로 결합되고(operably coupled with), 상기 인스트럭션들을 실행할 시, 상기 폴더블 디스플레이가 언폴딩 상태 (unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서브 영역 옆의(beside) 제2 서브 영역을 포 함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하고, 상기 제1 화면을 상기 제1 영역 내에 서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으로부터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는(toward) 제1 드래그 입력을 수신하고, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로 (as partially superimposed on) 상기 제2 서브 영역 내에서 실행되었던(has been executed) 어플리케이션들 중 일부를 지시하기(indicate) 위한 적어도 하나의 실행가능한 객체(executable object)를 포함하는 목록을 표 시하고, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 제1 실행가능한 객 체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시하도록 구성되는 적어도 하나 의 프로세서를 포함할 수 있고, 상기 제1 서브 영역의 넓이(area)는, 상기 제2 서브 영역의 넓이보다 넓을 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2 드래그 입력을 수신하 고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체 가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제2 실행가능한 객체를 선택하기 위한 입 력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시를 유지하고, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 축소하며, 상기 축소된 실행 화면 아래에서(below) 상기 제2 실행 가능한 객체에 의해 지시되는 다른(another) 어플리케이션의 다른(another) 실행 화면을 표시하도록 더 구성될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 서 브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 축소된 실행 화면 및 상기 다른 실행 화면을 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제3 드래그 입력을 수신하고, 상기 제3 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 및 상기 다른 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체 및 상기 제2 실행가능한 객체가 제외된 상기 목록을 표시하고, 상기 제1 실행가능한 객체 및 상기 제2 실행가능 한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제3 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시와 상기 제2 서 브 영역 내에서의 상기 축소된 실행 화면의 상기 표시를 유지하고, 상기 축소된 실행 화면 아래에서 표시되는 상기 다른 실행 화면을 상기 제3 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면으로 전환하도록 더 구성될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2 드래그 입력을 수신하 고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체 가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된(held) 제2 실행가능한 객체를 상기 제1 서브 영역으로 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제 2 서브 영역 내에서의 상기 실행 화면의 상기 표시를 유지하고, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면을 상기 제2 실행가능한 객체에 의해 지시되는 다른 어플리케이션의 다른 실행 화면으로 전환하도록 더 구 성될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2 드래그 입력을 수신하 고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체 가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된 제2 실행 가능한 객체를 상기 제2 서브 영역으로 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서 브 영역 내에서의 상기 제1 화면의 상기 표시를 유지하고, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 을 상기 제2 실행가능한 객체에 의해 지시되는 다른 어플리케이션의 다른 실행 화면으로 전환하도록 더 구성될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2 드래그 입력을 수신하 고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체 가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된 제2 실행 가능한 객체를 상기 제1 서브 영역과 상기 제2 서브 영역 사이의 경계를 포함하는 지정된 영역으로 이동하기 위 한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면 및 상기 제 2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 상기 제2 실행가능한 객체에 의해 지시되는 다른 어플리케이션의 다른 실행 화면을 표시하도록 더 구성될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2 드래그 입력을 수신하 고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체가 제외된(excluded) 상기 목록을 표시하고, 상기 제1 실행가능한 객체 가 제외된 상기 목록 내에 포함된 적어도 하나의 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된(held) 제2 실행가능한 객체를 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 다시 삽입하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시 및 상기 제2 서브 영역 내에 서의 상기 실행 화면의 상기 표시를 유지하고, 상기 제2 실행가능한 객체를 상기 목록 내에 다시 삽입하도록 더 구성될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제1 서브 영역 내에서 실행되었던 어플리케이션들 중 일부를 지시하기 위한 적어도 하나의 다른(another) 실행가능한 객체를 포함하는 다른(another) 목록을 표시하기 위한 입력을 수신하고, 여기서, 상기 다른 목록 내에 포함된 상기 적어도 하나 의 다른 실행가능한 객체는, 상기 제1 화면을 제공하는 어플리케이션을 지시하기 위한 실행가능한 객체를 포함 하며, 상기 다른 목록을 표시하기 위한 상기 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서의 상기 실행 화면의 상기 표시를 유지하고, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면을 상기 다른 목록으로 전환하고, 상기 다른 목록 내에 포함된 상기 적어도 하나의 다른 실행가능한 객체 중 제1 사용자 입력에 의해 홀드된 제2 실행가능한 객체를 상기 제2 서브 영역으로 이동하기 위한 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서 상기 제2 실행가능한 객체가 제외된 상기 다른 목록을 표시하고, 상기 제2 서브 영역 내에서 상기 제2 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 표시하도록 더 구성될 수 있다. 다양한 실시예들에서, 상기 제2 실행가능한 객체에 의해 지시되는 상기 어플리케이션의 상기 실행 화면 은, 상기 제1 사용자 입력 및 상기 제2 사용자 입력을 수신하기 전에 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면과 함께 상기 제2 서브 영역 내에서 표시될 수 있다. 다양한 실시예들에서, 상기 제2 실행가능한 객 체에 의해 지시되는 상기 어플리케이션의 상기 실행 화면은, 상기 제1 사용자 입력 및 상기 제2 사용자 입력을 수신하기 전에 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 아래에서(below) 표시될 수 있다. 다양한 실시예들에서, 상기 제2 실행가능한 객체에 의해 지시되는 상기 어플리케이션의 상기 실행 화면은, 상기 제1 사용자 입력 및 상기 제2 사용자 입력을 수신하기 전에 상기 제2 서브 영역 내에서 표시되는 상기 실행 화 면으로부터 전환될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 드래그 입력 의 상기 수신에 응답하여 상기 제1 화면 상에 일부 중첩으로 상기 목록을 표시하는 동안, 상기 목록에 대한 제2 드래그 입력을 수신하고, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 적어도 하나의 실행가능한 객체 의 적어도 일부를 상기 목록으로부터 제외하고 상기 제2 서브 영역 내에서 실행되었던 상기 어플리케이션들 중 다른 일부를 지시하기 위한 적어도 하나의 다른 실행가능한 객체를 상기 목록 내에 삽입하도록 더 구성될 수 있 다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 드래그 입력 의 상기 수신에 응답하여, 상기 제2 서브 영역의 동작 이력을 포함하는 실행 휴리스틱스(execution heuristic s)에 기반하여, 상기 제2 서브 영역 내에서 실행되었던 상기 어플리케이션들 중 일부를 식별하고, 상기 식별에 기반하여, 상기 어플리케이션들 중 일부를 지시하기 위한 상기 적어도 하나의 실행가능한 객체를 포함하는 상기 목록을 표시하도록 구성될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 제1 드래그 입력 의 상기 수신에 응답하여, 상기 제1 화면을 제공하는 어플리케이션과 연동가능하고 상기 제2 서브 영역 내에서 실행되었던 적어도 하나의 어플리케이션을 상기 제2 서브 영역 내에서 실행되었던 상기 어플리케이션들 중 일부 로 식별하고, 상기 식별에 기반하여, 상기 어플리케이션들 중 일부를 지시하기 위한 상기 적어도 하나의 실행가 능한 객체를 포함하는 상기 목록을 표시하도록 구성될 수 있다. 다양한 실시예들에서, 상기 적어도 하나의 프로세서는, 상기 인스트럭션들을 실행할 시, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 상기 제1 실행가능한 객체를 선택하기 위한 상기 입력을 수신하는 것에 응답하여, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시가능한지(displayable) 여부를 식별하고, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시가능함을 식별하는 것에 기반하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 어플리케이션의 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하며, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시불가능함을 식별하는 것에 기반하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로, 상기 어플리케이션의 상기 실행 화면을 표시하도록 구성될 수 있다. 도 8은, 다양한 실시예들에 따라 분할 화면을 제공하는 방법을 도시하는 흐름도이다. 이러한 방법은, 도 1a에 도시된 전자 장치 또는 전자 장치의 프로세서에 의해 실행될 수 있다. 도 8을 참조하면, 동작 810에서, 프로세서는, 제1 영역 내에서 제1 화면을 표시할 수 있다. 예를 들면, 프로세서는, 디스플레이가 언폴딩 상태 내에서 있는 동안, 제1 서브 영역 및 제1 서브 영역 옆의 제2 서브 영역을 포함하는 상기 제1 영역 내에서 상기 제1 화면을 표시할 수 있다. 다양한 실시예들에서, 상기 제1 화면은, 전체 화면 모드에서 제공되는 화면을 의미할 수 있다. 다양한 실시예들에서, 상기 제1 화면은, 홈 화 면(home screen 또는 wall paper)일 수도 있고, 전자 장치 내에 설치된 어플리케이션으로부터 제공되는 화 면일 수 있다. 동작 820에서, 프로세서는, 상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣 지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제1 드래그 입력을 수신할 수 있다. 동작 830에서, 프로세서는, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되 는 상기 제1 화면 상에 일부 중첩으로 상기 제2 서브 영역 내에서 실행되었던 어플리케이션들 중 일부를 지시하기 위한 적어도 하나의 실행가능한 객체를 포함하는 목록을 표시할 수 있다. 예를 들면, 프로세서는, 상 기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 실행되었던 어플리케이션들의 실행 이 력을 전자 장치의 프레임워크를 이용하여 조회하고, 상기 조회된 실행 이력에 기반하여 상기 어플리케이션 들의 실행 시간 정보를 획득할 수 있다. 프로세서는, 상기 획득에 응답하여, 상기 실행 시간 정보에 기반 하여 상기 어플리케이션들을 정렬할 수 있다. 예를 들면, 프로세서는, 상기 정렬에 기반하여 가장 최근 실행되었던 어플리케이션들을 선택할 수 있다. 상기 목록은, 공간의 제약으로 인하여 제한된 숫자의 실행가능 한 객체들을 표시할 수 있기 때문에, 프로세서는, 상기 프레임워크를 이용하여, 상기 선택된 어플리케이션 들을 지시하기 위한 실행가능한 객체들 및 알파벳 순으로 식별된 상위 N개의 어플리케이션들을 지시하기 위한 실행가능한 객체들을 상기 목록 내에 포함될 적어도 하나의 실행가능한 객체로 식별할 수 있다. 프로세서(12 0)는, 상기 식별된 적어도 하나의 실행가능한 객체를 포함하는 상기 목록을 획득하고, 상기 획득된 목록을 상기 제1 화면 상에 일부 중첩으로 표시할 수 있다. 동작 840에서, 프로세서는, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중에서 제1 실행 가능한 객체를 선택하기 위한 입력을 수신할 수 있다. 예를 들면, 상기 입력은, 상기 제1 실행가능한 객체를 기준 크기 미만의 누름 세기로 터치하는 것일 수 있다. 다른 예를 들면, 상기 입력은 상기 제1 실행가능한 객 체를 기준 시간보다 짧은 시간 동안 터치하는 것일 수 있다. 하지만, 이에 제한되지 않는다. 동작 850에서, 프로세서는, 상기 입력의 상기 수신에 응답하여, 상기 제1 서브 영역 내에서 상기 제1 화면 을 상기 제2 서브 영역 내에서 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 표시할 수 있다. 예를 들면, 프로세서는, 상기 입력의 상기 수신에 응답하여, 상기 제1 화면을 제공하는 어플리 케이션에게 축소된 제1 화면을 제공할 것을 상기 프레임워크를 이용하여 요청할 수 있다. 프로세서는, 상 기 요청에 대한 응답으로, 상기 제1 화면을 제공하는 상기 어플리케이션으로부터 상기 축소된 제1 화면에 대한 정보를 획득할 수 있다. 한편, 프로세서는, 상기 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에 서 표시될 상기 실행 화면에 대한 정보를 상기 프레임워크를 이용하여 상기 제1 실행가능한 객체에 의해 지시되 는 어플리케이션에게 요청할 수 있다. 프로세서는, 상기 제1 실행가능한 객체에 의해 지시되는 상기 어플 리케이션으로부터 상기 요청에 대한 응답으로, 상기 실행 화면에 대한 정보를 획득할 수 있다. 상기 프로세서 는, 상기 축소된 제1 화면에 대한 정보 및 상기 실행 화면에 대한 정보에 기반하여, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 실행 화면을 표시할 수 있다. 실시예들에 따라, 프로 세서는, 상기 목록을 표시하는 것에 응답하여, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객 체에 의해 지시되는 적어도 하나의 어플리케이션 각각에게 상기 제2 서브 영역 내에서 표시될 실행 화면에 대한 정보를 미리 요청하고 상기 제1 실행가능한 객체를 선택하기 위한 상기 입력을 수신하기 전에 상기 적어도 하나 의 어플리케이션 각각으로부터 상기 제2 서브 영역 내에서 표시될 실행 화면에 대한 정보를 획득할 수 있다. 프로세서는, 상기 제1 실행가능한 객체를 선택하기 위한 상기 입력을 수신하는 것에 응답하여, 상기 획득 된 정보로부터 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면에 대한 정보를 획득할 수 있다. 다양한 실시예들에 따른 전자 장치는, 이러한 동작들을 통해, 빠른 응답 속도로, 상기 제1 서브 영 역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 실행 화면을 표시할 수 있다. 다양한 실시예들에서, 상기 축소된 제1 화면에 포함된 콘텐트들의 배치는, 상기 제1 영역 내에서 표시되었던 상 기 제1 화면에 포함된 콘텐트들의 배치와 다를 수 있다. 예를 들면, 상기 축소된 제1 화면에 포함된 콘텐트들 사이의 간격은, 상기 제1 영역 내에서 표시되었던 상기 제1 화면에 포함된 콘텐트들 사이의 간격보다 좁을 수 있다. 다른 예를 들면, 상기 축소된 제1 화면에 포함된 콘텐트들 중 적어도 일부는, 상기 제1 영역 내에서 표 시되었던 상기 제1 화면에 포함된 콘텐트들 중 적어도 일부보다 간소화된 정보(simplified)를 제공할 수 있다. 상기 간소화된 정보의 제공에 의해, 상기 축소된 제1 화면에 포함된 콘텐트들의 배치는 상기 제1 영역 내에서 표시되었던 상기 제1 화면에 포함된 콘텐트들의 배치와 다를 수 있다. 상술한 바와 같이, 다양한 실시예들에 따른 전자 장치는, 엣지 영역으로부터 다른 영역으로 향하는 드래그 입력에 기반하여, 분할 화면 상태에서 제공될 어플리케이션을 선택하기 위한 목록을 제공할 수 있다. 상기 드 래그 입력은 직관성을 가지며 상기 목록은 상기 분할 화면 상태에서 추가적으로 표시될 어플리케이션의 실행 화 면을 쉽게 선택할 수 있도록 가이드하기 때문에, 다양한 실시예들에 따른 전자 장치는, 강화된 사용자 경 험을 제공할 수 있다. 도 9는 다양한 실시예들에 따라 분할 화면 상태에서 화면을 추가하는 방법을 도시하는 흐름도이다. 이러한 방 법은, 도 1a에 도시된 전자 장치 또는 전자 장치의 프로세서에 의해 실행될 수 있다. 도 9를 참조하면, 동작 910에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 실행 화면을 표시할 수 있다. 예를 들면, 동작 910은 도 8의 동작 850에 대응할 수 있다. 동작 920에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 실행 화면을 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역(예: 상기 제2 서브 영역 내의 엣지 영역)으로 부터 상기 엣지 영역과 구별되는 상기 제1 영역 내의 다른 영역(예: 상기 제2 서브 영역 내의 다른 영역)으로 향하는 제2 드래그 입력을 수신할 수 있다. 동작 930에서, 프로세서는, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표 시되는 상기 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체가 제외된 상기 목록을 표시할 수 있다. 상기 제1 실행가능한 객체는 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 제공하는 어플리케이션을 지시하기 때문에, 프로세서는, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제1 실행가능한 객체 가 제외된 상기 목록을 표시할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 실행가능한 객체에 의해 지시되는 상기 어플리케이션이 멀티 태스킹을 지원하는 경우, 상기 제1 실행가능한 객체를 상기 목록 내에 서 유지할 수도 있다. 동작 940에서, 프로세서는, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실 행가능한 객체 중 제2 실행가능한 객체를 선택하기 위한 입력을 수신할 수 있다. 동작 950에서, 프로세서는, 상기 제2 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 표시를 유지하고, 상기 제2 서브 영역 내에서 표시되는 상기 실 행 화면을 축소하며, 상기 축소된 실행 화면 아래에서 상기 제2 실행가능한 객체에 의해 지시되는 다른 어플리 케이션의 다른 실행 화면을 표시할 수 있다. 예를 들면, 프로세서는, 상기 제2 실행가능한 객체를 선택하 기 위한 상기 입력을 수신하는 것에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 제공하는 상기 어플리케이션에게 상기 제2 서브 영역의 일부 내에서 표시될 실행 화면에 대한 정보를 요청하고, 상기 요 청에 대한 응답으로 상기 어플리케이션으로부터 상기 제2 서브 영역의 상기 일부 내에서 표시될 상기 실행 화면 에 대한 정보를 획득할 수 있다. 프로세서는, 상기 제2 실행가능한 객체를 선택하기 위한 상기 입력을 수 신하는 것에 응답하여, 상기 제2 서브 영역의 남은 일부 내에서 표시될 상기 다른 실행 화면에 대한 정보를 상 기 다른 어플리케이션에게 요청하고, 상기 요청에 대한 응답으로 상기 다른 실행 화면에 대한 정보를 획득할 수 있다. 프로세서는, 상기 실행 화면에 대한 정보 및 상기 다른 실행 화면에 대한 정보에 기반하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 축소하고, 상기 축소된 실행 화면 아래에서 상기 다른 실행 화면을 표시할 수 있다. 실시예들에 따라, 프로세서는, 상기 제2 실행가능한 객체를 선택하기 위한 상기 입력을 수신하는 것에 응답하여, 상기 제2 서브 영역 내에서 상기 실행 화면을 제공하는 상기 어플리케이션에게 상기 제2 서브 영역의 일부 내에서 표시될 상기 실행 화면에 대한 정보를 요청하는 것 없이(without) 상기 프레 임워크를 이용하여 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면으로부터 제공되는 정보의 일부를 숨김 으로서(hide) 상기 제2 서브 영역의 일부 내에서 표시될 상기 축소된 실행 화면에 대한 정보를 획득할 수도 있 다. 상술한 바와 같이, 다양한 실시예들에 따른 전자 장치는, 분할 화면 상태에서 2개의 화면들을 제공하는 동 안 엣지 영역으로부터 다른 영역으로 향하는 드래그 입력을 수신하는 것에 기반하여, 상기 분할 화면 상태에서 부가될 화면을 제공하는 어플리케이션을 선택하기 위한 목록을 제공할 수 있다. 상기 드래그 입력은 직관성을 가지며 상기 목록은 상기 분할 화면 상태에서 부가될 화면을 쉽게 선택할 수 있도록 가이드하기 때문에, 다양한 실시예들에 따른 전자 장치는, 강화된 사용자 경험을 제공할 수 있다. 도 10은 다양한 실시예들에 따라 분할 화면 상태에서 제공되는 화면들의 일부를 전환하는 방법을 도시하는 흐름 도이다. 이러한 방법은, 도 1a에 도시된 전자 장치 또는 전자 장치의 프로세서에 의해 실행될 수 있다. 도 10을 참조하면, 동작 1010에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서 브 영역 내에서 상기 축소된 실행 화면 및 상기 다른 실행 화면을 표시할 수 있다. 예를 들면, 동작 1010은, 도 9의 동작 950에 대응할 수 있다. 동작 1020에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 축소된 실행 화면 및 상기 다른 실행 화면을 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 구별되는 상기 제1 영역 내의 다른 영역으로 향하는 제3 드래그 입력을 수신할 수 있다. 동작 1030에서, 프로세서는, 상기 제3 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 및 상기 다른 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체 및 상기 제2 실행가능한 객체가 제외된 상기 목록을 표시할 수 있다. 다양한 실시예들에서, 상기 제1 실행가능한 객체 또는 상기 제2 실행가능한 객체 중 적어도 하나는, 상기 제1 실행가능한 객체에 의해 지시되는 상기 어플리케이션 또 는 상기 제2 실행가능한 객체에 의해 지시되는 상기 다른 어플리케이션 중 적어도 하나가 멀티 태스킹을 지원하 는 경우, 상기 목록 내에서 유지될 수도 있다. 동작 1040에서, 프로세서는, 상기 목록 내에 포함된 제3 실행가능한 객체를 선택하기 위한 입력을 수신할 수 있다. 동작 1050에서, 프로세서는, 상기 제3 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시 및 상기 제2 서브 영역 내에서의 상기 축소된 실행 화 면의 상기 표시를 유지하고, 상기 축소된 실행 화면 아래에서 표시되는 상기 다른 실행 화면을 상기 제3 실행가 능한 객체에 의해 지시되는 어플리케이션의 실행 화면으로 전환할 수 있다. 예를 들면, 프로세서는, 상기 제3 실행가능한 객체를 선택하기 위한 상기 입력을 수신하는 것에 응답하여, 상기 제3 실행가능한 객체에 의해 지시되는 어플리케이션에게 상기 제2 서브 영역 내의 아랫 부분에서 표시될 실행 화면에 대한 정보를 요청하고, 상기 요청에 대한 응답으로 상기 제3 실행가능한 객체에 의해 지시되는 상기 어플리케이션으로부터 상기 제2 서 브 영역 내의 아랫 부분에서 표시될 실행 화면에 대한 정보를 획득할 수 있다. 프로세서는, 상기 획득된 정보에 기반하여, 상기 제1 서브 영역 내에서의 상기 제1 화면의 상기 표시 및 상기 제2 서브 영역 내에서의 상 기 축소된 실행 화면의 상기 표시를 유지하고, 상기 축소된 실행 화면 아래에서 표시되는 상기 다른 실행 화면 을 상기 제3 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면으로 전환할 수 있다. 상술한 바와 같이, 다양한 실시예들에 따른 전자 장치는, 분할 화면 상태에서 3개의 화면들을 제공하는 동 안 엣지 영역으로부터 다른 영역으로 향하는 드래그 입력을 수신하는 것에 기반하여, 상기 분할 화면 상태에서 제공하는 어플리케이션들 중 일부를 변경하기 위한 목록을 제공할 수 있다. 상기 드래그 입력은 직관성을 가지 며 상기 목록은 상기 분할 화면 상태에서 전환될 화면을 쉽게 선택할 수 있도록 가이드하기 때문에, 다양한 실 시예들에 따른 전자 장치는, 강화된 사용자 경험을 제공할 수 있다. 도 11은 다양한 실시예들에 따라 실행가능한 객체의 드랍 위치에 기반하여 표시 방법을 결정하는 방법을 도시하 는 흐름도이다. 이러한 방법은, 도 1a에 도시된 전자 장치 또는 전자 장치의 프로세서에 의해 실행될 수 있다. 도 11을 참조하면, 동작 1110에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서 브 영역 내에서 상기 실행 화면을 표시할 수 있다. 예를 들면, 도 11의 동작 1110은, 도 8의 동작 850에 대응 할 수 있다. 동작 1120에서, 프로세서는, 상기 제1 화면을 상기 제1 서브 영역 내에서 상기 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동안, 상기 제1 영역 내의 상기 엣지 영역으로부터 상기 엣지 영역과 다른 상기 제1 영역 내의 다른 영역으로 향하는 제2 드래그 입력을 수신할 수 있다. 예를 들면, 도 11의 동작 1120은, 도 9의 동작 920에 대응할 수 있다. 동작 1130에서, 프로세서는, 상기 제2 드래그 입력의 상기 수신에 응답하여, 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로 상기 제1 실행가능한 객체가 제외된 상기 목록을 표시할 수 있다. 예를 들면, 도 11의 동작 1130은, 도 9의 동작 930에 대응할 수 있다. 동작 1140에서, 프로세서는, 상기 제1 실행가능한 객체가 제외된 상기 목록 내에 포함된 적어도 하나의 실 행가능한 객체 중 제1 사용자 입력에 의해 홀드된 제2 실행가능한 객체를 드랍하는 제2 사용자 입력을 수신할 수 있다. 예를 들면, 상기 제1 사용자 입력은, 기준 크기 이상의 누름 강도로 상기 제2 실행가능한 객체를 터 치하는 것 또는 기준 시간 이상의 시간 동안 상기 제2 실행가능한 객체를 터치하는 것일 수 있다. 예를 들면, 상기 제2 사용자 입력은, 상기 제1 사용자 입력에 의해 홀드된 상기 제2 실행가능한 객체를 드래그한 후 상기 드래그를 해제하는 것일 수 있다. 동작 1150에서, 프로세서는, 상기 제2 사용자 입력을 수신하는 것에 응답하여, 상기 제2 실행가능한 객체 가 상기 제2 사용자 입력에 의해 드랍된 위치에 기반하여 결정된 표시 방법을 이용하여 폴더블 디스플레이(14 0)를 제어할 수 있다. 예를 들어, 상기 제2 실행가능한 객체가 상기 제2 사용자 입력에 의해 상기 제1 서브 영 역에 드랍되는 경우, 프로세서는, 상기 제2 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제1 서브 영역 내에서 표시할 수 있다. 다른 예를 들어, 상기 제2 실행가능한 객체가 상기 제2 사용자 입 력에 의해 상기 제2 서브 영역에 드랍되는 경우, 프로세서는, 상기 제2 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시할 수 있다. 또 다른 예를 들어, 상기 제2 실행가 능한 객체가 상기 제2 사용자 입력에 의해 상기 제1 서브 영역과 상기 제2 영역 사이의 바운더리를 포함하는 지 정된 영역에 드랍되는 경우, 프로세서는, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면 및 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면 상에 일부 중첩으로, 상기 제2 실행가능한 객체에 의해 지시되는 어 플리케이션의 실행 화면을 표시할 수 있다. 또 다른 예를 들어, 상기 제2 실행가능한 객체가 상기 제2 사용자 입력에 의해 다시 상기 목록 내에 삽입되는 경우, 프로세서는, 상기 제1 서브 영역 내에서 표시되는 상기 제1 화면 및 상기 제2 서브 영역 내에서 표시되는 상기 실행 화면을 유지하고, 상기 제2 실행가능한 객체를 상 기 목록 내에 다시 삽입할 수 있다. 상술한 바와 같이, 다양한 실시예들에 따른 전자 장치는, 목록 내의 실행가능한 객체를 선택하기 위한 입 력의 속성과 구별되는 다른 속성의 적어도 하나의 입력에 기반하여 상기 실행가능한 객체를 드래그 앤 드롭함으 로써, 분할 화면 상태 내에서 새롭게 제공될 화면의 배치를 직관적으로 선택하도록 가이드할 수 있다. 다시 말 해, 다양한 실시예들에 따른 전자 장치는, 강화된 사용자 경험을 제공할 수 있다. 도 12는 다양한 실시예들에 따라 제1 서브 영역 내에서 제공되는 다른 목록을 이용하여 분할 화면 상태를 제어 하는 방법을 도시하는 흐름도이다. 이러한 방법은, 도 1a에 도시된 전자 장치 또는 전자 장치의 프 로세서에 의해 실행될 수 있다. 도 12를 참조하면, 동작 1210에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서 브 영역 내에서 상기 실행 화면을 표시할 수 있다. 예를 들면, 도 12의 동작 1210은, 도 8의 동작 850에 대응 할 수 있다. 동작 1220에서, 프로세서는, 상기 제1 서브 영역 내에서 상기 제1 화면을 상기 제2 서브 영역 내에서 상기 실행 화면을 표시하는 동안, 다른 목록을 표시하기 위한 입력을 수신할 수 있다. 동작 1230에서, 프로세서는, 상기 입력의 상기 수신에 응답하여, 상기 제1 서브 영역 내에서 표시되는 상 기 제1 화면을 상기 다른 목록으로 전환할 수 있다. 상기 다른 목록은, 상기 제1 서브 영역 내에서 실행되었던 적어도 하나의 어플리케이션을 지시하기 위한 적어도 하나의 실행가능한 객체를 포함할 수 있다. 상기 실행가 능한 객체들은, 상기 제1 화면을 제공하기 위해 이용된 어플리케이션을 지시하기 위한 실행가능한 객체를 포함 할 수 있다. 한편, 프로세서는, 상기 입력의 상기 수신과 독립적으로, 상기 제2 서브 영역 내에서의 상기 실행 화면의 상기 표시를 유지할 수 있다. 동작 1240에서, 프로세서는, 상기 다른 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 사 용자 입력에 의해 홀드된 제2 실행가능한 객체를 상기 제2 서브 영역으로 이동하기 위한 제2 사용자 입력을 수 신할 수 있다. 예를 들면, 상기 제1 사용자 입력은, 기준 크기 이상의 누름 강도로 상기 제2 실행가능한 객체 를 터치하는 것 또는 기준 시간 이상의 시간 동안 상기 제2 실행가능한 객체를 터치하는 것일 수 있다. 예를 들면, 상기 제2 사용자 입력은, 상기 제1 사용자 입력에 의해 홀드된 상기 제2 실행가능한 객체를 드래그한 후 상기 드래그를 해제하는 것일 수 있다. 동작 1250에서, 프로세서는, 상기 제2 사용자 입력의 상기 수신에 응답하여, 상기 제1 서브 영역 내에서 상기 제2 실행가능한 객체가 제외된 상기 다른 목록을 표시하고, 상기 제2 서브 영역 내에서 상기 제2 실행가능 한 객체에 의해 지시되는 어플리케이션의 실행 화면을 표시할 수 있다. 상술한 바와 같이, 다양한 실시예들에 따른 전자 장치는, 다른 목록으로부터 선택된 실행가능한 객체의 이 동에 기반하여, 분할 화면 상태에서 제공되는 화면들 중 일부를 전환함으로써, 강화된 사용자 경험을 제공할 수 있다. 도 13은 다양한 실시예들에 따라 목록에 대한 드래그 입력에 기반하여 상기 목록을 갱신하는 방법을 도시하는 흐름도이다. 이러한 방법은, 도 1a에 도시된 전자 장치 또는 전자 장치의 프로세서에 의해 실 행될 수 있다. 도 13을 참조하면, 동작 1310에서, 프로세서는, 적어도 하나의 실행가능한 객체를 포함하는 목록을 표시할 수 있다. 예를 들면, 상기 목록은, 상기 제2 서브 영역 내에서 실행되었던 적어도 하나의 어플리케이션을 지시 하기 위한 적어도 하나의 실행가능한 객체를 포함할 수 있다. 동작 1320에서, 프로세서는, 상기 목록에 대한 드래그 입력을 수신할 수 있다. 예를 들면, 상기 드래그 입력은, 상기 목록 내의 적어도 하나의 실행가능한 객체를 스크롤하기 위한 입력을 의미할 수 있다. 동작 1330에서, 프로세서는, 상기 목록에 대한 상기 드래그 입력을 수신하는 것에 응답하여, 상기 적어도 하나의 실행가능한 객체의 적어도 일부를 상기 목록으로부터 제외하고 상기 제2 서브 영역 내에서 실행되었던 어플리케이션들 중 다른 일부를 지시하기 위한 적어도 하나의 다른 실행가능한 객체를 상기 목록 내에 삽입할 수 있다. 다시 말해, 프로세서는, 상기 목록에 대한 상기 드래그 입력을 수신하는 것에 응답하여, 상기 적어도 하나의 실행가능한 객체에 의해 지시되는 적어도 하나의 어플리케이션보다 낮은 우선순위를 가지는 적어 도 하나의 다른 어플리케이션을 지시하는 상기 적어도 하나의 다른 실행가능한 객체를 상기 목록 내에서 제공할 수 있다. 상술한 바와 같이, 다양한 실시예들에 따른 전자 장치는, 상기 목록 내에서 스크롤 기능을 제공함으로써, 분할 화면 상태에서 추가될 화면을 간소화된 인터액션으로 선택할 수 있도록 가이드할 수 있다. 다시 말해, 다 양한 실시예들에 따른 전자 장치는, 강화된 사용자 경험을 제공할 수 있다. 도 14는, 다양한 실시예들에 따라 제1 영역 내에서 표시되는 화면과 함께 표시될 실행 화면의 상태를 결정하는 방법을 도시하는 흐름도이다. 이러한 방법은, 도 1a에 도시된 전자 장치 또는 전자 장치의 프로세서 에 의해 실행될 수 있다. 도 14를 참조하면, 동작 1410에서, 프로세서는, 목록 내에 포함된 제1 실행가능한 객체를 선택하기 위한 입력을 수신할 수 있다. 예를 들면, 프로세서는, 제1 영역 내에서 제1 화면을 표시하는 동안 수신되는 상 기 제1 드래그 입력에 기반하여, 상기 제1 화면 상에 일부 중첩으로 상기 목록을 표시하고, 상기 목록 내에 포 함된 상기 제1 실행가능한 객체를 선택하기 위한 입력을 수신할 수 있다. 동작 1420에서, 프로세서는, 상기 제1 실행가능한 객체를 선택하기 위한 상기 입력을 수신하는 것에 응답 하여, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시가능한지 여부를 식별할 수 있다. 예를 들면, 프로세서 는, 상기 제1 실행가능한 객체를 선택하기 위한 상기 입력을 수신하는 것에 응답하여, 상기 제1 화면을 제 공하는 어플리케이션이 부분 화면 모드를 제공하는지 여부를 식별할 수 있다. 예를 들면, 프로세서는, 상 기 제1 화면을 제공하는 어플리케이션을 설치할 시 메모리 내에 저장된 정보에 기반하여, 상기 제1 화면을 제공하는 어플리케이션이 부분 화면 모드를 제공하는지 여부를 식별할 수 있다. 다른 예를 들면, 프로세서 는, 상기 제1 화면을 제공하는 어플리케이션에게 상기 어플리케이션이 상기 부분 화면 모드로 표시될(예: 상기 제1 서브 영역 내에서 표시될) 화면을 제공할 수 있는지 여부를 문의하고, 상기 문의에 대한 응답에 기반 하여, 상기 어플리케이션이 상기 부분 화면 모드를 제공하는지 여부를 식별할 수 있다. 프로세서는, 상기 어플리케이션이 상기 부분 화면 모드를 제공하는지 여부의 식별에 기반하여, 상기 제1 화면이 상기 제1 서브 영 역 내에서 표시가능한지 여부를 식별할 수 있다. 다양한 실시예들에서, 프로세서는, 상기 제1 화면이 상 기 제1 서브 영역 내에서 표시가능함을 식별하는 경우, 동작 1430을 수행하고, 그렇지 않으면(otherwise) 동작 1440을 수행할 수 있다. 동작 1430에서, 프로세서는, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시가능함을 식별하는 것에 기 반하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 제2 서브 영역 내에서 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 표시할 수 있다. 동작 1440에서, 프로세서는, 상기 제1 화면이 상기 제1 서브 영역 내에서 표시불가능함을 식별하는 것에 기반하여, 상기 제1 화면을 상기 제1 영역 내에서 표시하는 것을 유지하고, 상기 제1 화면 상에 일부 중첩으로 상기 실행 화면을 표시할 수 있다. 상술한 바와 같이, 다양한 실시예들에 따른 전자 장치는, 제1 화면을 제공하는 어플리케이션이 부분 화면 모드를 지원하는지 여부에 따라, 상기 어플리케이션과 구별되는 다른 어플리케이션의 표시 방법을 결정함으로써, 강화된 사용자 경험을 제공할 수 있다. 상술한 바와 같은, 다양한 실시예들에 따른, 폴더블 디스플레이를 가지는 전자 장치 내에서 실행되는 방법은, 상기 폴더블 디스플레이가 언폴딩 상태(unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서브 영역 옆의(beside) 제2 서브 영역을 포함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하는 동작과, 상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으 로부터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는 (toward) 제1 드래그 입력을 수신하는 동작과, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로(as partially superimposed on) 상기 제2 서브 영역 내에서 실행되었던(has been executed) 어플리케이션들 중 일부를 지시하기(indicate) 위한 적어도 하나의 실행가능한 객체(executable object)를 포함하는 목록을 표시하는 동작과, 상기 목록 내에 포함된 상기 적어도 하나의 실행 가능한 객체 중 제1 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시하는 동작을 포함할 수 있고, 상기 제1 서브 영역의 넓이(area)는, 상기 제2 서브 영 역의 넓이보다 넓을 수 있다. 상술한 바와 같은, 다양한 실시예들에 따른 비일시적 컴퓨터 판독 가능 저장 매체(non-transitory computer readable storage medium)는, 폴더블 디스플레이를 가지는 전자 장치의 하나 이상의 프로세서들에 의해 실행될 시, 상기 폴더블 디스플레이가 언폴딩 상태(unfolding state) 내에서 있는 동안, 제1 서브 영역 및 상기 제1 서 브 영역 옆의(beside) 제2 서브 영역을 포함하는 상기 폴더블 디스플레이의 제1 영역 내에서 제1 화면을 표시하 고, 상기 제1 화면을 상기 제1 영역 내에서 표시하는 동안, 상기 제1 영역 내의 엣지 영역(edge region)으로부 터 상기 엣지 영역과 다른(different from) 상기 제1 영역 내의 다른 영역(another region)으로 향하는 (toward) 제1 드래그 입력을 수신하고, 상기 제1 드래그 입력의 상기 수신에 응답하여, 상기 제1 영역 내에서 표시되는 상기 제1 화면 상에 일부 중첩으로(as partially superimposed on) 상기 제2 서브 영역 내에서 실행되 었던(has been executed) 어플리케이션들 중 일부를 지시하기(indicate) 위한 적어도 하나의 실행가능한 객체 (executable object)를 포함하는 목록을 표시하고, 상기 목록 내에 포함된 상기 적어도 하나의 실행가능한 객체 중 제1 실행가능한 객체를 선택하기 위한 입력을 수신하는 것에 응답하여, 상기 제1 화면을 상기 제1 서브 영역 내에서 표시하고 상기 제1 실행가능한 객체에 의해 지시되는 어플리케이션의 실행 화면을 상기 제2 서브 영역 내에서 표시하도록, 상기 전자 장치를 야기하는 인스트럭션들을 포함하는 하나 이상의 프로그램들을 저장할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: read only memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: electrically erasable programmable read only memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: compact disc-ROM), 디지털 다목적 디스크(DVDs: digital versatile discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 상기 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(local area network), WLAN(wide LAN), 또 는 SAN(storage area network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장 치는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도 의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시예들에서, 개시에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다."}
{"patent_id": "10-2019-0045765", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 다양한 실시예들에 따른 전자 장치의 간소화된(simplified) 블록도이다. 도 1b는, 다양한 실시예들에 따른 펼침 상태(unfolding state)에서의 폴더블(foldable) 전자 장치(electronic device)의 전면(front view) 및 후면(rear view)의 예를 도시한다. 도 2는 다양한 실시예들에 따른 전자 장치에서 표시되는 분할 화면의 구조를 도시한다. 도 3a는 다양한 실시예들에 따른 전자 장치에서 표시되는 분할 화면의 예를 도시한다. 도 3b는 다양한 실시예들에 따른 전자 장치 내에서 표시되는 분할 화면의 다른 예를 도시한다. 도 3c는 다양한 실시예들에 따른 전자 장치 내에서 표시되는 분할 화면의 또 다른 예를 도시한다. 도 4a는 다양한 실시예들에 따른 전자 장치 내에서 드래그 입력을 이용하여 분할 화면을 제어하는 방법의 예를 도시한다. 도 4b는 다양한 실시예들에 따른 전자 장치 내에서 드래그 입력을 이용하여 분할 화면을 제어하는 방법의 다른 예를 도시한다. 도 4c는 다양한 실시예들에 따른 전자 장치 내에서 드래그 입력을 이용하여 분할 화면을 제어하는 방법의 또 다 른 예를 도시한다. 도 4d는 다양한 실시예들에 따른 전자 장치 내에서 드래그 입력을 이용하여 분할 화면을 제어하는 방법의 또 다른 예를 도시한다. 도 5는 다양한 실시예들에 따른 전자 장치 내에서 제1 화면의 표시 속성에 따라 분할 화면 상태의 제공 여부를 결정하는 방법의 예를 도시한다. 도 6은 다양한 실시예들에 따른 전자 장치 내에서 분할 화면을 제공하는 방법의 예를 도시한다. 도 7은 다양한 실시예들에 따른 전자 장치 내에서 분할 화면 상태에서 알림 메시지를 처리하는 방법의 예를 도 시한다. 도 8은, 다양한 실시예들에 따라 분할 화면을 제공하는 방법을 도시하는 흐름도이다. 도 9는 다양한 실시예들에 따라 분할 화면 상태에서 화면을 추가하는 방법을 도시하는 흐름도이다. 도 10은 다양한 실시예들에 따라 분할 화면 상태에서 제공되는 화면들의 일부를 전환하는 방법을 도시하는 흐름 도이다. 도 11은 다양한 실시예들에 따라 실행가능한 객체의 드랍 위치에 기반하여 표시 방법을 결정하는 방법을 도시하 는 흐름도이다. 도 12는 다양한 실시예들에 따라 제1 서브 영역 내에서 제공되는 다른 목록을 이용하여 분할 화면 상태를 제어 하는 방법을 도시하는 흐름도이다. 도 13은 다양한 실시예들에 따라 목록에 대한 드래그 입력에 기반하여 상기 목록을 갱신하는 방법을 도시하는 흐름도이다. 도 14는, 다양한 실시예들에 따라 제1 영역 내에서 표시되는 화면과 함께 표시될 실행 화면의 상태를 결정하는 방법을 도시하는 흐름도이다."}
