{"patent_id": "10-2023-0108138", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0026971", "출원번호": "10-2023-0108138", "발명의 명칭": "생성 모델의 이미지 처리 과정 시각화 방법 및 이를 위한 장치", "출원인": "고려대학교 산학협력단", "발명자": "이성환"}}
{"patent_id": "10-2023-0108138", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로세서 및 메모리를 포함하는 시각화 장치가 수행하는 시각화 방법에 있어서, 타겟 이미지를 획득하는 동작; 상기 타겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타겟 이미지를 입력하여 출력되는 제1 출력과, 상기 복수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하는 동작; 상기 제1 출력과 상기 복수 개의 제2 출력 각각의 유사도 점수를 계산하는 동작; 및상기 타겟 이미지의 픽셀 별로 상기 유사도 점수를 시각화한 특등도 맵을 생성하는 동작; 을 포함하는 방법."}
{"patent_id": "10-2023-0108138", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 타겟 이미지는, 생성 모델의 잠재 공간(latent space) 상의 이미지를 포함하는, 방법."}
{"patent_id": "10-2023-0108138", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 방법은, 상기 특등도 맵을 생성하는 동작 이후에, 상기 특등도 맵을 기 설정된 규격의 히트맵 이미지로 변환하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2023-0108138", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 히트맵 이미지로 변환하는 동작은선형 보간법(Linear Interpolation)을 이용하여 상기 특등도 맵을 기 설정된 규격의 이미지로 변환하는 동작을포함하는 방법."}
{"patent_id": "10-2023-0108138", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 복수 개의 손상 이미지를 생성하는 동작은, 상기 타겟 이미지에 포함된 픽셀에 가우시안 랜덤 형태의 바이너리 마스크를 적용하여 상기 복수 개의 손상 이미지를 생성하는 동작을 포함하는, 방법.공개특허 10-2025-0026971-3-청구항 6 제1항에 있어서,상기 유사도 점수를 계산하는 동작은 구조적 유사성 함수(Structural Similarity Function)를 이용하여 상기 제1 출력과 상기 복수 개의 제2 출력각각의 픽셀 별 유사도 점수를 계산하는 동작을 포함하는방법."}
{"patent_id": "10-2023-0108138", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 특등도 맵을 생성하는 동작은 상기 타겟 이미지의 각 픽셀 별로 상기 복수 개의 제2 출력 각각으로부터 계산된 픽셀 별 유사도 점수를 정규화하여 특등도 맵을 생성하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0108138", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "명령어를 포함하는 메모리; 및상기 명령어를 실행하는 프로세서를 포함하고, 상기 프로세서의 동작은, 타겟 이미지를 획득하는 동작; 상기 타겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타겟 이미지를 입력하여 출력되는 제1 출력과, 상기 복수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하는 동작; 상기 제1 출력과 상기 복수 개의 제2 출력 각각의 유사도 점수를 계산하는 동작; 및상기 타겟 이미지의 픽셀 별로 상기 유사도 점수를 시각화한 특등도 맵을 생성하는 동작; 을 포함하는 장치."}
{"patent_id": "10-2023-0108138", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "컴퓨터 판독 가능 기록매체에 저장되어 있는 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면,타겟 이미지를 획득하는 동작; 상기 타겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타겟 이미지를 입력하여 출력되는 제1 출력과, 상기 복수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하는 동작; 상기 제1 출력과 상기 복수 개의 제2 출력 각각의 유사도 점수를 계산하는 동작; 및상기 타겟 이미지의 픽셀 별로 상기 유사도 점수를 시각화한 특등도 맵을 생성하는 동작; 을 포함하는 방법을 상기 프로세서가 수행하도록 하기 위한 명령어를 포함하는 컴퓨터로 판독 가능한 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0108138", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시 예에 따른 시각화 장치는 타겟 이미지를 획득하는 동작; 상기 타겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타겟 이미지를 입력하여 출력되는 제1 출력과, 상기 복 수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하는 동작; 상기 제1 출력과 상기 복수 개 의 제2 출력 각각의 유사도 점수를 계산하는 동작; 및 상기 타겟 이미지의 픽셀 별로 상기 유사도 점수를 시각화 한 특등도 맵을 생성하는 동작을 수행할 수 있다."}
{"patent_id": "10-2023-0108138", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 생성 모델의 이미지 처리 과정 시각화 방법 및 이를 위한 장치에 관한 것이다. 보다 자세하게는 생성 모델이 이미지의 노이즈를 제거하는 과정에서 어떠한 부분에 집중하여 이미지를 처리하는지 시각화하는 방법 및 이를 위한 장치에 관한 것이다."}
{"patent_id": "10-2023-0108138", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 모델의 입력과 출력 사이는 블랙 박스 형태로, 입력으로부터 출력까지의 결정을 어떠한 과정 또는 어 떠한 방법으로 처리하는 것인지 직접적으로 알 수 없다. 그렇기 때문에, 인공지능 모델이 특정 선택을 하는 이 유를 파악할 수 있다면, 인공지능을 이해하여 보다 개선할 수 있는 가능성이 열리므로, 인공지능 모델의 처리 과정을 시각화하여 인간이 이해할 수 있도록 하는 ‘설명 가능한 인공지능’의 연구가 활발하다. 이미지 분류 모델의 경우에는, 이미지 분류 모델이 특정 정답으로 분류한 이유를 파악하기 위해, 모델이 정답을 고를 때 가장 많이 참고한 부분을 시각화하는 방법이 존재한다. 이러한 방법을 통해 이미지 분류 모델이 적절한 근거로 결정을 했는지 인간이 이해할 수 있다. 한편, 생성 모델 중에는 디퓨전 모델(Diffusion model)이 최근 좋은 성능을 보이고 있다. 디퓨전 모델은 무작위 의 노이즈 이미지로부터 텍스트에 가장 적합한 이미지를 생성하기 위해 노이즈를 제거하는 과정을 반복함으로써 이미지를 생성한다. 이처럼 반복적인 노이즈 제거 과정을 통해서 질 높은 이미지를 생성할 수 있도록 하는 것이 디퓨전 과정의 큰 장점이다. 다만, 이러한 생성 모델(Generative Model)의 경우는, 이미지 분류 모델과 달리 생성 모델이 단 번에 이미지를 생성하기 때문에, 기존의 이미지 분류 모델에 사용하는 시각화 방식을 적용하기가 적합하지 않다는 문제가 있다. 따라서, 디퓨전 모델의 경우 역시 노이즈 이미지로부터 질 높은 이미지가 출력되기까지, 디퓨전 모델이 어떠한 과정을 거치는지 직접적으로 파악하기가 어렵다. 특히, 복원 과정 중의 노이즈 제거 처리를 확인하기 위해, 중 간 과정의 이미지를 출력해보면 출력된 이미지는 인간이 이해할 수 없는 이미지이기 때문에, 디퓨전 모델이 어 떻게 이미지를 개선하는지 이해하는 것에 한계가 있다. 이에 따라, 생성 모델이 중간 과정에서 어떤 부분을 근거로 노이즈 제거를 하는지 알 수 있는 방법론이 개발된 다면, 생성 모델의 이해와 발전에 큰 도움이 될 것으로 예상된다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-2249623호(2021.05.03)"}
{"patent_id": "10-2023-0108138", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는 생성 모델이 중간 과정에서 어떠한 부분을 근거로 노이즈를 제거하는 지 알 수 있도록, 생성 모델의 관심 부분을 특정하여 시각화 하는 기술을 제공하는 것이다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0108138", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위한 본 발명의 일 실시 예에 따른 프로세서 및 메모리를 포함하는 시각화 장치가 수행하는 시각화 방법은, 타겟 이미지를 획득하는 동작; 상기 타겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타겟 이미지를 입력하여 출력되는 제1 출력과, 상기 복수 개 의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하는 동작; 상기 제1 출력과 상기 복수 개의 제 2 출력 각각의 유사도 점수를 계산하는 동작; 및 상기 타겟 이미지의 픽셀 별로 상기 유사도 점수를 시각화한 특등도 맵을 생성하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 타겟 이미지는 생성 모델의 잠재 공간(latent space) 상의 이미지를 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은 상기 특등도 맵을 생성하는 동작 이후에 상기 특등도 맵을 기 설정된 규격의 히트맵 이미지로 변환하는 동작을 더 포함할 수 있다. 일 실시 예에 따르면, 상기 히트맵 이미지로 변환하는 동작은 선형 보간법(Linear Interpolation)을 이용하여 상기 특등도 맵을 기 설정된 규격의 이미지로 변환하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 복수 개의 손상 이미지를 생성하는 동작은 상기 타겟 이미지에 포함된 픽셀에 가우 시안 랜덤 형태의 바이너리 마스크를 적용하여 상기 복수 개의 손상 이미지를 생성하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 유사도 점수를 계산하는 동작은 구조적 유사성 함수(Structural Similarity Function)를 이용하여 상기 제1 출력과 상기 복수 개의 제2 출력 각각의 픽셀 별 유사도 점수를 계산하는 동작 을 포함할 수 있다. 일 실시 예에 따르면, 상기 특등도 맵을 생성하는 동작은 상기 타겟 이미지의 각 픽셀 별로 상기 복수 개의 제2 출력 각각으로부터 계산된 픽셀 별 유사도 점수를 정규화하여 특등도 맵을 생성하는 동작을 포함할 수 있다. 상기 기술적 과제를 달성하기 위한 본 발명의 일 실시 예에 따른 시각화 장치는 명령어를 포함하는 메모리; 및 상기 명령어를 실행하는 프로세서를 포함하고, 상기 프로세서의 동작은 타겟 이미지를 획득하는 동작; 상기 타 겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타겟 이미지를 입력하여 출력되는 제1 출력과, 상기 복수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하 는 동작; 상기 제1 출력과 상기 복수 개의 제2 출력 각각의 유사도 점수를 계산하는 동작; 및 상기 타겟 이미지 의 픽셀 별로 상기 유사도 점수를 시각화한 특등도 맵을 생성하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 타겟 이미지는 생성 모델의 잠재 공간(latent space) 상의 이미지를 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은 상기 특등도 맵을 생성하는 동작 이후에 상기 특등도 맵을 기 설정된 규격의 히트맵 이미지로 변환하는 동작을 더 포함할 수 있다. 일 실시 예에 따르면, 상기 히트맵 이미지로 변환하는 동작은 선형 보간법(Linear Interpolation)을 이용하여 상기 특등도 맵을 기 설정된 규격의 이미지로 변환하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 복수 개의 손상 이미지를 생성하는 동작은 상기 타겟 이미지에 포함된 픽셀에 가우 시안 랜덤 형태의 바이너리 마스크를 적용하여 상기 복수 개의 손상 이미지를 생성하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 유사도 점수를 계산하는 동작은 구조적 유사성 함수(Structural Similarity Function)를 이용하여 상기 제1 출력과 상기 복수 개의 제2 출력 각각의 픽셀 별 유사도 점수를 계산하는 동작 을 포함할 수 있다. 일 실시 예에 따르면, 상기 특등도 맵을 생성하는 동작은 상기 타겟 이미지의 각 픽셀 별로 상기 복수 개의 제2 출력 각각으로부터 계산된 픽셀 별 유사도 점수를 정규화하여 특등도 맵을 생성하는 동작을 포함할 수 있다. 상기 기술적 과제를 달성하기 위한 본 발명의 일 실시 예에 따른 컴퓨터 판독 가능 기록매체에 저장되어 있는 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은, 프로세서에 의해 실행되면, 타겟 이미지를 획득하는 동작; 상 기 타겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타겟 이 미지를 입력하여 출력되는 제1 출력과, 상기 복수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하는 동작; 상기 제1 출력과 상기 복수 개의 제2 출력 각각의 유사도 점수를 계산하는 동작; 및 상기 타겟 이미지의 픽셀 별로 상기 유사도 점수를 시각화한 특등도 맵을 생성하는 동작을 포함하는 방법을 상기 프로세서 가 수행하도록 하기 위한 명령어를 포함할 수 있다."}
{"patent_id": "10-2023-0108138", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면, 무작위 입력 샘플링 설명 방식과 유사도 함수를 이용한 특등도 맵 시각화 방식 을 이용하여, 생성 모델의 내부와는 독립적으로 모델의 결정 과정을 시각화함으로써, 디퓨전 모델과 같은 생성 모델의 이미지 처리 과정을 인간이 이해하도록 나타낼 수 있다. 또한, 본 발명은 이미지 생성의 모든 과정에 대한 모델의 결정을 시각화하고, 최종 이미지 생성을 위해서 생성 모델이 집중하는 특성이 무엇인지 인간이 해석할 수 있도록 하여, 생성 모델의 이해와 발전에 기여할 수 있다."}
{"patent_id": "10-2023-0108138", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0108138", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적과 기술적 구성 및 그에 따른 작용 효과에 관한 자세한 사항은 본 발명의 명세서에 첨부된 도면 에 의거한 이하의 상세한 설명에 의해 보다 명확하게 이해될 것이다. 첨부된 도면을 참조하여 본 발명에 따른 실시 예를 상세하게 설명한다. 본 명세서에서 개시되는 실시 예들은 본 발명의 범위를 한정하는 것으로 해석되거나 이용되지 않아야 할 것이다. 이 분야의 통상의 기술자에게 본 명세서의 실시 예를 포함한 설명은 다양한 응용을 갖는다는 것이 당연 하다. 따라서, 본 발명의 상세한 설명에 기재된 임의의 실시 예들은 본 발명을 보다 잘 설명하기 위한 예시적인 것이며 본 발명의 범위가 실시 예들로 한정되는 것을 의도하지 않는다. 도면에 표시되고 아래에 설명되는 기능 블록들은 가능한 구현의 예들일 뿐이다. 다른 구현들에서는 상세한 설명 의 사상 및 범위를 벗어나지 않는 범위에서 다른 기능 블록들이 사용될 수 있다. 또한, 본 발명의 하나 이상의 기능 블록이 개별 블록들로 표시되지만, 본 발명의 기능 블록들 중 하나 이상은 동일 기능을 실행하는 다양한 하드웨어 및 소프트웨어 구성들의 조합일 수 있다. 또한, 어떤 구성요소들을 포함한다는 표현은 \"개방형\"의 표현으로서 해당 구성요소들이 존재하는 것을 단순히 지칭할 뿐이며, 추가적인 구성요소들을 배제하는 것으로 이해되어서는 안 된다. 나아가 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급될 때에는, 그 다른 구성 요소에 직접적으로 연결 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되 어야 한다. 이하에서는 도면들을 참조하여 본 발명의 세부적인 실시 예들에 대해 살펴보도록 한다. 도 1은 일 실시 예에 따른 시각화 장치(이하, '장치'로 지칭)가 포함하는 전체 구성을 예시적으로 도 시한 도면이다. 그러나 이는 본 발명의 목적을 달성하기 위한 바람직한 실시 예일 뿐이며, 필요에 따라 일부 구성이 추가되거나 삭제될 수 있고, 어느 한 구성이 수행하는 역할을 다른 구성이 함께 수행할 수도 있음은 물론이다. 일 실시 예에 따른 장치는 프로세서, 네트워크 인터페이스, 메모리, 스토리지 및 이들을 연결하는 데이터 버스를 포함할 수 있으며, 기타 본 발명의 목적을 달성함에 있어 요구되는 부가적인 구성 들을 더 포함할 수 있음은 물론이라 할 것이다. 프로세서는 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processer Unit), MCU(Micro Controller Unit) 또는 본 발명이 속하는 기술 분야에서 널리 알려져 있는 형태의 인공지능 프로세서 중 어느 하나일 수 있다. 아울러, 프로세서는 일 실시 예에 따른 장치(10 0)가 수행하는 동작 또는 오퍼레이션을 수행하기 위한 적어도 하나의 애플리케이션 또는 프로그램에 대한 연산 을 수행할 수 있다. 네트워크 인터페이스는 일 실시 예에 따른 장치의 유무선 인터넷 통신을 지원하며, 그 밖의 공지의 통 신 방식을 지원할 수도 있다. 따라서 네트워크 인터페이스는 그에 따른 통신 모듈을 포함하여 구성될 수 있 다. 메모리는 각종 정보, 명령 및/또는 정보를 저장하며, 일 실시 예에 따른 장치가 수행하는 동작 또는 오퍼레이션을 수행하기 위해 스토리지로부터 하나 이상의 컴퓨터 프로그램을 로드할 수 있다. 도 1에서 는 메모리의 하나로 RAM을 도시하였으나 이와 더불어 다양한 저장 매체를 메모리로 이용할 수 있음은 물론이다. 스토리지는 하나 이상의 컴퓨터 프로그램을 비임시적으로 저장할 수 있다. 이러한 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크(HDD), 보조 저장 매치(SSD), 착탈형 디스크, 또 는 본 발명이 속하는 기술 분야에서 널리 알려져 있는 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체 중 어느 하나일 수 있다. 컴퓨터 프로그램은 메모리에 로드되어, 하나 이상의 프로세서에 의해, 타겟 이미지를 획득하는 동 작; 상기 타겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타 겟 이미지를 입력하여 출력되는 제1 출력과, 상기 복수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하는 동작; 상기 제1 출력과 상기 복수 개의 제2 출력 각각의 유사도 점수를 계산하는 동작; 및 상 기 타겟 이미지의 픽셀 별로 상기 유사도 점수를 시각화한 특등도 맵을 생성하는 동작을 실행할 수 있다. 이상 간단하게 언급한 컴퓨터 프로그램이 수행하는 동작 또는 오퍼레이션은 컴퓨터 프로그램의 일 기능 으로 볼 수 있으며, 보다 자세한 설명은 일 실시 예에 따른 장치가 수행하는 방법에 대한 설명에서 후술 하도록 한다. 데이터 버스는 이상 설명한 프로세서, 네트워크 인터페이스, 메모리 및 스토리지 사이의 명령 및/또는 정보의 이동 경로가 된다. 이상 간단하게 설명한 일 실시 예에 따른 장치는 독립된 디바이스의 형태, 예를 들어 전자 기기나 서버 (클라우드 포함)의 형태일 수 있으며, 여기서 전자 기기는 한 장소에 고정 설치되어 사용하는 데스크톱 PC, 서 버 디바이스 등과 같은 기기 뿐만 아니라, 스마트폰, 태블릿 PC, 노트북 PC, PDA, PMP 등과 같이 휴대가 용이한 포터블 기기 등이라도 무방한바, 프로세서에 해당하는 CPU 등이 설치되고 네트워크 기능만 보유하고 있는 전자 기기라면 어떠한 것이라도 무방하다 할 것이다. 예를 들어, 일 실시 예에 따른 장치는 독립된 디바이 스인 전자 기기 형태 중 \"서버\"의 형태로 구현될 수 있다. 또한, 일 실시 예에 따른 장치는 독립된 디바이 스인 전자 기기 형태 중 서버가 제공하는 애플리케이션 또는 서비스를 이용하기 위해 사용자가 소지하는 \"단 말\"의 형태로 구현될 수 있다. 이하, 일 실시 예에 따른 장치가 수행하는 방법에 대하여 도 2 내지 도 12를 참조하여 설명하도록 한다. 도 2는 일 실시 예에 따라 장치가 수행하는 시각화 방법의 대표적인 단계를 나타낸 순서도이고, 도 3은 도 2의 실시 예에 따른 시각화 방법의 각 단계에 대한 이해를 돕기 위해 예시한 개념도이다. 도 2 및 도 3에 개시된 각 단계는 일 실시 예에 따른 장치를 통해 수행될 수 있고, 구체적으로 각 단계의 동작은 프로세서가 수행하는 동작으로 이해될 수 있다. 도 2 및 도 3에 개시된 각 단계는 본 발명의 목적을 달성함에 있어서 바람직한 실시 예일 뿐이며, 필요에 따라 일부 단계가 추가 또는 삭제될 수 있음은 물론이고, 어느 한 단계가 다른 단계에 포함되어 수행될 수도 있다. 도 2 및 도 3에 개시된 각 동작의 순서는 이해의 편의를 위해 배치된 순서일 뿐, 이러한 순서가 시계열적인 순 서로 한정되는 것이 아니며, 설계자의 선택에 따라 순서가 다르게 변경되어 동작될 수 있다. 도 2 및 도 3을 함께 참조하면, S1010 단계에서, 장치는 타겟 이미지를 획득할 수 있다. 예를 들어, 타겟 이미지는 생성 모델의 잠재 공간(latent space) 상에 존재하는 이미지 정보를 포함할 수 있다. 본 문서의 실시 예는 생성 모델에 대한 조작없이, 타겟 데이터를 활용한 생성 모델의 출력을 이용하여 타겟 데이터에 대한 생성 모델의 관심 영역을 시각화한다. 또한, S1010 단계에서, 장치는 생성 모델(Generative Model)을 획득하거나 생성할 수 있다. 여기서, 생성 모델이란 손상된 이미지를 정상적인 이미지로 복원하는 작업을 수행하는 인공지능 모델을 포함한 다. 생성 모델은 딥러닝과 확률론의 개념을 결합하여 손상된 이미지를 단계적으로 개선하는 방식으로 작동할 수 있다. 본 문서의 실시 예에 따른 생성 모델은 입력된 이미지의 노이즈를 점진적으로 제거하면서 정상적인 픽셀 값으로 복원하도록 변환하는 과정을 수행할 수 있다. 예를 들어, 생성 모델은 디퓨전 모델(Diffusion Model)을 포함할 수 있다. 다음으로, S1020 단계에서, 장치는 타겟 이미지에 노이즈를 가하여 복수 개의 손상 이미지를 생성할 수 있 다. 예를 들어, 장치는 타겟 이미지에 포함된 픽셀에 가우시안 랜덤 형태의 바이너리 마스크를 적용하여 복수 개의 손상 이미지를 생성할 수 있다. S1020 단계의 구체적인 예시를 다음 도 4와 함께 설명한다. 도 4는 일 실시 예에 따라 S1020 단계의 손상 이미지를 생성하는 동작을 예시적으로 구체화한 순서도이다. 도 4를 참조하면, 장치는 타겟 이미지에 대응하는 규격의 픽셀 크기에 바이너리 마스크(0, 1)가 랜덤으로 분포하는 N개(ex. 100개)의 랜덤 마스크 생성하고(S1021), 타겟 이미지에 N개(ex. 100개)의 랜덤 마스크 각각을 대입하여(S1022), N개(ex. 100개)의 손상 이미지를 생성할 수 있다(S1023). 이처럼, 타겟 이미지에 노이즈를 주입하여 손상 이미지를 생성하는 이유는, 이후 단계에서 타겟 이미지에 대해 생성 모델이 출력하는 결과와, 타겟 이미지를 손상시킨 손상 이미지에 대해 생성 모델이 출력하는 결과를 비교 하여, 타겟 이미지에 포함된 픽셀 중 어떠한 손상 부분이 생성 모델의 결정에 영향을 미치는지 확인하기 위함이 다. 이를 위해, S1030 단계에서, 장치는 생성 모델에 타겟 이미지를 입력하여 출력되는 제1 출력과, 생성 모델 에 복수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득할 수 있다. 다음으로, S1040 단계에서, 장치는 제1 출력과 복수 개의 제2 출력 각각의 유사도 점수를 계산할 수 있다. 예를 들어, 장치는 구조적 유사성 함수(Structural Similarity Function)를 이용하여 제1 출력과 상기 복 수 개의 제2 출력 각각의 픽셀 별 유사도 점수를 계산할 수 있다. S1040 단계의 구체적인 예시를 다음 도 5와 함께 설명한다. 도 5는 일 실시 예에 따라 S1040 단계의 유사도 점수를 계산하는 동작을 예시적으로 구체화한 순서도이다. 도 5를 참조하면, 장치는 생성 모델로부터 제1 출력과 N개(ex. 100개)의 제2 출력을 획득하고(S1041), 제1 출력을 기준값으로 하여 제1 출력과 N개(ex. 100개)의 제2 출력 각각의 픽셀 별 유사도를 비교하여(S1042), N개 (ex. 100개)의 유사도 점수를 생성할 수 있다(S1043). 이때 N개의 유사도 점수 각각은 타겟 이미지가 포함하는 각 픽셀 별로 N개의 제2 출력과 유사도를 비교한 N개의 유사도 점수를 포함할 수 있다. 즉, 타겟 이미지의 픽셀 수가 500개라면, N개의 유사도 점수 중 어느 하나는 500개의 픽셀 각각에 대한 점수를 포함하는 것으로 이해될 수 있다. 여기서, 유사도 점수가 의미하는 것은 손상된 픽셀의 모델 결정에 대한 영향력이다. 즉, 특정 픽셀에 대한 유사 도 점수가 높다는 것은, 생성 모델이 해당 픽셀을 집중적으로 복구하였다는 것을 의미하므로, 유사도 점수가 높 은 픽셀일수록 생성 모델의 결정에 큰 영향을 주는 부분을 의미한다. 이에, N번의 랜덤한 픽셀 위치에 대하여 손상을 가하여 유사도 점수를 측정하였으므로, N개의 유사도 점수를 합산하여 나타내는 과정을 수행할 필요가 있다. 이에, S1050 단계에서, 장치는 타겟 이미지의 픽셀 별로 유사도 점수를 시각화한 특등도 맵을 생성할 수 있다. 예를 들어, 장치는 타겟 이미지의 각 픽셀 별로 복수 개의 제2 출력 각각으로부터 계산된 픽셀 별 유사도 점수를 정규화하여 특등도 맵을 생성할 수 있다. S1050 단계의 구체적인 예시를 다음 도 6과 함께 설명한다. 도 6은 일 실시 예에 따라 S1050 단계의 특등도 맵을 생성하는 동작을 예시적으로 구체화한 순서도이다. 도 6을 참조하면, 장치는 타겟 이미지의 픽셀 별로 유사도 점수를 확인하기 위해 픽셀 별 점수의 초기값을 설정하고(S1051), 타겟 이미지의 픽셀 별로 픽셀 별 N개의 유사도 점수를 누적하여 합산하여(S1052), 타겟 이미 지의 픽셀 별 누적 점수를 정규화하여 시각화된 특등도 맵을 생성할 수 있다(S1053). 여기서, 특등도 맵은 픽셀 별 누적 점수에 따라 해당 픽셀의 색온도를 다르게 표현할 수 있다. 예를 들어, 도 3 을 참조하면, 장치는 특등도 맵의 픽셀 중 유사도 점수가 높은 픽셀을 높은 색온도(ex. 붉은색)로 표현하 고, 유사도 점수가 낮은 픽셀을 낮은 색온도(ex. 파란색)으로 표현할 수 있다. 한편, S1010 단계에서 입력된 타겟 이미지가 잠재 공간 상에 존재하는 이미지 정보였다면, S1050 단계에서 생성 된 특등도 맵 또한 잠재 공간 상의 이미지 정보이기에, 이를 이미지 공간으로 키우기 위한 다음의 동작을 수행 할 수 있다. 다음으로, S1060 단계에서, 장치는 특등도 맵을 기 설정된 규격의 히트맵 이미지로 변환할 수 있다. 예를 들어, 장치는 선형 보간법(Linear Interpolation)을 이용하여 상기 특등도 맵을 기 설정된 규격의 이미지 크기로 변환할 수 있다. S1060 단계의 구체적인 예시를 다음 도 6과 함께 설명한다. 도 7은 일 실시 예에 따라 S1060 단계의 히트맵 이미지로 변환하는 동작을 예시적으로 구체화한 순서도이다. 도 7을 참조하면, 장치는 사용자가 복구하기 원하는 이미지 크기의 해상도 정보를 획득하고(S1061), 잠재 공간 상의 이미지 정보를 포함하는 특등도 맵에 획득한 해상도 정보를 기초로 선형 보간법을 적용하여 히트맵을 생성할 수 있다(S1062). 이를 통해, 사용자는 실제 이미지 크기의 히트맵을 확인함으로써, 타겟 이미지 중 생성 모델의 결정에 주된 영 향을 주는 영역과, 영향이 적은 구분할 수 있다. 도 8은 생성 모델의 복원 과정 중에 획득된 이미지 정보를 타겟 이미지로 이용하여 본 발명의 실시 예를 적용한 결과를 나타낸 도면이다. 도 8에서 동일한 텍스트 명령에 대한 4개의 이미지 중 왼쪽에 위치할수록 초기 복원 과정 중에 획득된 이미지 정보를 타겟 이미지로 활용한 예시이며, 오른쪽에 위치할수록 후기 복원 과정 중에 획 득된 이미지 정보를 타겟 이미지로 활용한 예시이다. 도 8을 참조하면, 생성 모델이 초반 복원 과정에서부터 최종 복원 과정까지 타겟 이미지의 어떤 영역이나 특징 에 집중하여 생성하는지 확인할 수 있다. 예를 들어, 생성 모델이‘A black unicorn’ 이라는 문장에 대한 이미 지를 생성할 때(가장 아래 좌측 이미지), 생성 모델은 초반에 유니콘의 형태에 집중함으로써 의미론적 정보 (semantic information)를 먼저 구축하고, 그 후 세부적으로 범위를 넓혀가며 이미지를 생성한다는 사실을 확인 할 수 있다. 도 9는 분류 모델을 시각화하는 알고리즘인 LIME을 생성 모델의 시각화에 활용한 결과(좌측)와, 본 발명의 실시 예를 활용한 결과(우측)를 비교한 도면이다. 도 9를 참조하면, LIME이 타겟 이미지를 시각화한 결과는 분할 영역에 따라서 출력 색깔이 달라지므로 이를 통 해 유의미한 결과를 해석하기 어렵지만, 본 발명의 실시 예의 결과는 객체를 인식할 수 있는 영역에 집중하여 시각화 표현을 달리 나타내고 있기 때문에 인간이 보다 유의미한 결과를 해석할 수 있다. 도 10은 특등도 맵 시각화 방식의 정량적 평가에 사용되는 제거 게임(deletion game)과 삽입 게임(insertion game)을 수행한 결과를 비교한 도면이다. 도 10을 참조하면, 곡선의 초기 도함수는 핵심 정보가 식별되었는지 여부를 나타내며, 초반 그래프 기울기의 비 교를 통하여 본 발명의 실시 예(a)가 다른 방법론 (b), (c)에 비해 삭제 게임 및 삽입 게임에서 더 높은 성능을 내는 것을 확인할 수 있다. 도 11은 기존 알고리즘인 Random perturbation 및 LIME과 본 발명의 실시 예의 AUC score를 비교한 성능 평가 테이블이다. 도 11을 참조하여, Deletion, Insertion 두 가지 경우에서 AUC score를 비교해보면, 본 발명의 실시 예가 종래 기술과 대비하여 성능 평가 결과가 현저하게 향상된 것을 확인할 수 있다. 도 12는 기존 알고리즘인 similarity function 및 Masking method과 본 발명의 실시 예의 AUC score를 비교한 성능 평가 테이블이다. 도 12를 참조하면, 성능 평가 지표 AUC score가 Deletion에서 성능이 우수하며, Insertion의 경우 월등한 성능 을 보이는 것을 확인할 수 있다. 도 12를 참조하여, Deletion, Insertion 두 가지 경우에서 AUC score를 비교해보면, 본 발명의 실시 예가 종래 기술에 비하여 Deletion에서 성능이 매우 우수하며, 본 발명의 실시 예가 종래 기술이 비하여 Insertion에서 월 등한 성능을 보이는 것을 확인할 수 있다. 상기와 같은 본 발명에 따르면, 무작위 입력 샘플링 설명 방식과 유사도 함수를 이용한 특등도 맵 시각화 방식 을 이용하여, 생성 모델의 내부와는 독립적으로 모델의 결정 과정을 시각화함으로써, 디퓨전 모델과 같은 생성 모델의 이미지 처리 과정을 인간이 이해하도록 나타낼 수 있다. 또한, 본 발명은 이미지 생성의 모든 과정에 대한 모델의 결정을 시각화하고, 최종 이미지 생성을 위해서 생성 모델이 집중하는 특성이 무엇인지 인간이 해석할 수 있도록 하여, 생성 모델의 이해와 발전에 기여할 수 있다. 또한, 상술한 실시 예에 따른 방법은 컴퓨터로 판독 가능한 매체에 저장된 컴퓨터 프로그램 또는 컴퓨터로 판독 가능한 기록 매체의 형태로도 구현될 수 있다. 일 실시 예에 따른 컴퓨터 판독 가능 기록매체에 저장되어 있는 컴퓨터 프로그램은 프로세서에 의해 실행되면, 타겟 이미지를 획득하는 동작; 상기 타겟 이미지에 노이즈를 가 하여 복수 개의 손상 이미지를 생성하는 동작; 소정의 생성 모델에 상기 타겟 이미지를 입력하여 출력되는 제1 출력과, 상기 복수 개의 손상 이미지를 입력하여 출력되는 복수 개의 제2 출력을 획득하는 동작; 상기 제1 출력 과 상기 복수 개의 제2 출력 각각의 유사도 점수를 계산하는 동작; 및 상기 타겟 이미지의 픽셀 별로 상기 유사 도 점수를 시각화한 특등도 맵을 생성하는 동작을 포함하는 방법을 프로세서가 수행하도록 하기 위한 명령어를 포함할 수 있다. 또한, 본 문서의 실시 예들의 프로세서는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명 령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기 능을 수행하도록 운영되는 것을 가능하게 한다. 이러한 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 프로세서는 범용 프로세서, FPGA(Field Programmable Gate Array), ASIC(Application Specific Integrated Circuit), DSP(Digital Signal Processor) 및/또는 등등 일 수 있다. 이상 첨부된 도면을 참조하여 본 발명의 실시 예들을 설명하였지만, 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0108138", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 시각화 장치가 포함하는 전체 구성을 예시적으로 도시한 도면이다. 도 2는 일 실시 예에 따른 시각화 장치가 수행하는 시각화 방법의 대표적인 단계를 나타낸 순서도이다. 도 3은 도 2의 실시 예에 따른 시각화 방법의 각 동작에 대한 이해를 돕기 위해 예시한 개념도이다. 도 4는 일 실시 예에 따라 S1020 단계의 손상 이미지를 생성하는 동작을 예시적으로 구체화한 순서도이다. 도 5는 일 실시 예에 따라 S1040 단계의 유사도 점수를 계산하는 동작을 예시적으로 구체화한 순서도이다. 도 6은 일 실시 예에 따라 S1050 단계의 특등도 맵을 생성하는 동작을 예시적으로 구체화한 순서도이다. 도 7은 일 실시 예에 따라 S1060 단계의 히트맵 이미지로 변환하는 동작을 예시적으로 구체화한 순서도이다. 도 8은 생성 모델의 복원 과정 중에 획득된 이미지 정보를 타겟 이미지로 이용하여 본 발명의 실시 예를 적용한 결과를 나타낸 도면이다. 도 9는 분류 모델을 시각화하는 알고리즘인 LIME을 생성 모델의 시각화에 활용한 결과(좌측)와, 본 발명의 실시 예를 활용한 결과(우측)를 비교한 도면이다. 도 10은 특등도 맵 시각화 방식의 정량적 평가에 사용되는 제거 게임(deletion game)과 삽입 게임(insertion game)을 수행한 결과를 비교한 도면이다. 도 11은 기존 알고리즘인 Random perturbation 및 LIME과 본 발명의 실시 예의 AUC score를 비교한 성능 평가 테이블이다. 도 12는 기존 알고리즘인 similarity function 및 Masking method과 본 발명의 실시 예의 AUC score를 비교한 성능 평가 테이블이다."}
