{"patent_id": "10-2021-0065900", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0158314", "출원번호": "10-2021-0065900", "발명의 명칭": "고위험 환자의 급작스러운 상태 악화를 예측하는 전자 장치 및 악화 예측 방법", "출원인": "한림대학교 산학협력단", "발명자": "김유림"}}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,고위험 환자의 상태 악화를 예측하기 위한 인공지능 모델이 저장된 메모리; 및환자의 나이, 성별, 체질량지수, 동반 질환, 호흡률, 산소 포화도, 수축기 혈압, 맥박수, 체온, 및 의식 수준을포함하는 상기 환자의 건강 정보를 상기 인공지능 모델에 입력하고, 상기 인공지능 모델의 출력을 기반으로 상기 환자의 상태 악화를 예측하는, 프로세서;를 포함하는, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 인공지능 모델은,환자의 건강 정보에 포함되는 임의의 특성들을 기반으로 상태 악화를 예측하기 위한 복수의 결정 트리를 포함하는, 랜덤 포레스트 형식으로 구성된, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는,제1 시점(time point)에 획득된 복수의 환자의 건강 정보, 및 상기 제1 시점 이후의 적어도 하나의 제2 시점에획득된 상기 복수의 환자의 상태를 기반으로, 상기 복수의 결정 트리 각각을 훈련시키는, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는,상기 인공지능 모델의 출력을 기반으로, 일정 기간 내 상기 환자의 중환자실 입실 또는 병원 내 사망을 예측하는, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,복수의 환자 각각의 건강 정보를 상기 인공지능 모델에 입력하여, 상기 복수의 환자 각각의 상태 악화 가능성및 악화된 상태를 예측하고,상기 예측된 상기 복수의 환자 각각의 상태 악화 가능성 및 악화된 상태를 기반으로, 상기 복수의 환자에 대한치료의 우선순위를 식별하는, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서는,복수의 환자 각각의 건강 정보를 상기 인공지능 모델에 입력하여, 상기 복수의 환자 각각의 상태 악화 여부를예측하고,공개특허 10-2022-0158314-3-상기 복수의 환자 중 상태 악화가 예측되는 고위험 환자들의 수를 식별하는, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는,복수의 의료 시설 별 가용 중환자실 수를 모니터링하고,상기 의료 시설 별 가용 중환자실 수 및 상기 고위험 환자들의 수를 기반으로, 상기 복수의 의료 시설에 대한상기 고위험 환자들의 배치 정보를 생성하는, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 복수의 의료 시설 각각의 위치 및 상기 고위험 환자들 각각의 현재 위치를 기반으로, 상기 고위험 환자들의 이동 거리의 합이 최소가 되도록 상기 배치 정보를 생성하는, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 프로세서는,상기 인공지능 모델의 출력을 기반으로, 상기 고위험 환자들 각각의 상태 악화 가능성 및 악화된 상태를 예측하고,상기 예측된 상태 악화 가능성 및 악화된 상태를 기반으로, 상기 고위험 환자들에 대한 치료의 우선순위를 식별하고,상기 고위험 환자들 각각의 우선순위에 따라, 상기 고위험 환자들 각각의 단위 거리 이동에 대한 가중치를 선택하고,상기 복수의 의료 시설 각각의 위치 및 상기 고위험 환자들 각각의 현재 위치를 기반으로, 상기 고위험 환자들마다 상기 가중치에 이동거리를 곱한 값들의 합이 최소가 되도록 상기 배치 정보를 생성하는, 전자 장치."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "고위험 환자의 상태 악화를 예측하기 위한 인공지능 모델을 포함하는 전자 장치의 상태 악화 예측 방법에 있어서,환자의 나이, 성별, 체질량지수, 동반 질환, 호흡률, 산소 포화도, 수축기 혈압, 맥박수, 체온, 및 의식 수준을포함하는 상기 환자의 건강 정보를 상기 인공지능 모델에 입력하는 단계; 및상기 인공지능 모델의 출력을 기반으로, 상기 환자의 상태 악화를 예측하는 단계;를 포함하는, 전자 장치의 상태 악화 예측 방법."}
{"patent_id": "10-2021-0065900", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "컴퓨터 판독 가능 기록 매체에 저장된 컴퓨터 프로그램에 있어서,전자 장치의 프로세서에 의해 실행되어, 상기 전자 장치로 하여금 제10항의 상태 악화 예측 방법을 수행하도록하는, 컴퓨터 판독 가능 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 본 전자 장치는, 고위험 환자의 상태 악화를 예측하기 위한 인공지능 모델이 저장된 메모 리, 환자의 나이, 성별, 체질량지수, 동반 질환, 호흡률, 산소 포화도, 수축기 혈압, 맥박수, 체온, 및 의식 수 준을 포함하는 상기 환자의 건강 정보를 상기 인공지능 모델에 입력하고, 상기 인공지능 모델의 출력을 기반으로 상기 환자의 상태 악화를 예측하는, 프로세서를 포함한다."}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 입원 환자의 갑작스러운 상태 악화를 예측하기 위한 전자 장치에 관한 것으로, 보다 상세하게는, 인 공지능 모델을 기반으로 상태 악화를 예측하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "코로나 19의 유행으로 만성질환자들의 의료서비스 이용에 큰 변화가 생겼다. 이로 인해, 코로나 19 환자를 적절 히 치료하기 위한 의료자원 재분배의 필요성이 대두되었다. 특히, 제한된 의료자원의 적절한 분배를 위해, 고위험 환자의 병세 악화 위험에 대한 평가 방법에 대해서도 추 가적인 고찰이 필요하다. 기존에 이용되고 있는 국제 조기 경고 점수(National Early Warning Score; NEWS)는 입원 환자의 악화를 예측 하는 점수 체계이다. NEWS의 경우, 낮은 임계점으로 인하여 비교적 많은 수의 환자들이 고위험군으로 분류될 수 있다. 다만, 코로나 19의 유행 상황에 따라 중환자실의 수가 제한적일 수 있고, NEWS에 따른 판단의 정확도가 높다고 만 볼 수는 없으므로, 보다 정확한 악화 예측 방법이 필요하다. 선행기술문헌 특허문헌"}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "(특허문헌 0001) 공개특허공보 제10-2020-0003407호(전자 건강 기록으로부터 의료 이벤트를 예측 및 요약하기 위한 시스템 및 방법)"}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 종래의 NEWS(National Early Warning Score) 지표들에 환자의 기본 정보가 추가된 데이터를 머신러닝 기법으로 분석하여 고위험 환자의 예기치 못한 악화를 예측할 수 있는 전자 장치를 제공한다."}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치는, 고위험 환자의 상태 악화를 예측하기 위한 인공지능 모델이 저장된 메모리, 환자의 나이, 성별, 체질량지수, 동반 질환, 호흡률, 산소 포화도, 수축기 혈압, 맥박수, 체온, 및 의 식 수준을 포함하는 상기 환자의 건강 정보를 상기 인공지능 모델에 입력하고, 상기 인공지능 모델의 출력을 기 반으로 상기 환자의 상태 악화를 예측하는, 프로세서를 포함한다. 상기 인공지능 모델은, 환자의 건강 정보에 포함되는 임의의 특성들을 기반으로 상태 악화를 예측하기 위한 복 수의 결정 트리를 포함하는, 랜덤 포레스트 형식으로 구성될 수 있다. 이 경우, 상기 프로세서는, 제1 시점(time point)에 획득된 복수의 환자의 건강 정보, 및 상기 제1 시점 이후의 적어도 하나의 제2 시점에 획득된 상기 복수의 환자의 상태를 기반으로, 상기 복수의 결정 트리 각각을 훈련시 킬 수 있다. 상기 프로세서는, 상기 인공지능 모델의 출력을 기반으로, 일정 기간 내 상기 환자의 중환자실 입실 또는 병원 내 사망을 예측할 수 있다. 또한, 상기 프로세서는, 복수의 환자 각각의 건강 정보를 상기 인공지능 모델에 입력하여, 상기 복수의 환자 각 각의 상태 악화 가능성 및 악화된 상태를 예측하고, 상기 예측된 상기 복수의 환자 각각의 상태 악화 가능성 및 악화된 상태를 기반으로, 상기 복수의 환자에 대한 치료의 우선순위를 식별할 수 있다. 상기 프로세서는, 복수의 환자 각각의 건강 정보를 상기 인공지능 모델에 입력하여, 상기 복수의 환자 각각의 상태 악화 여부를 예측하고, 상기 복수의 환자 중 상태 악화가 예측되는 고위험 환자들의 수를 식별할 수도 있 다. 이 경우, 상기 프로세서는, 복수의 의료 시설 별 가용 중환자실 수를 모니터링하고, 상기 의료 시설 별 가용 중 환자실 수 및 상기 고위험 환자들의 수를 기반으로, 상기 복수의 의료 시설에 대한 상기 고위험 환자들의 배치정보를 생성할 수 있다. 여기서, 상기 프로세서는, 상기 복수의 의료 시설 각각의 위치 및 상기 고위험 환자들 각각의 현재 위치를 기반 으로, 상기 고위험 환자들의 이동 거리의 합이 최소가 되도록 상기 배치 정보를 생성할 수 있다. 또는, 상기 프로세서는, 상기 인공지능 모델의 출력을 기반으로, 상기 고위험 환자들 각각의 상태 악화 가능성 및 악화된 상태를 예측하고, 상기 예측된 상태 악화 가능성 및 악화된 상태를 기반으로, 상기 고위험 환자들에 대한 치료의 우선순위를 식별하고, 상기 고위험 환자들 각각의 우선순위에 따라, 상기 고위험 환자들 각각의 단 위 거리 이동에 대한 가중치를 선택하고, 상기 복수의 의료 시설 각각의 위치 및 상기 고위험 환자들 각각의 현 재 위치를 기반으로, 상기 고위험 환자들마다 상기 가중치에 이동거리를 곱한 값들의 합이 최소가 되도록 상기 배치 정보를 생성할 수도 있다. 본 개시의 일 실시 예에 따라 고위험 환자의 상태 악화를 예측하기 위한 인공지능 모델을 포함하는 전자 장치의 상태 악화 예측 방법은, 환자의 나이, 성별, 체질량지수, 동반 질환, 호흡률, 산소 포화도, 수축기 혈압, 맥박 수, 체온, 및 의식 수준을 포함하는 상기 환자의 건강 정보를 상기 인공지능 모델에 입력하는 단계, 상기 인공 지능 모델의 출력을 기반으로, 상기 환자의 상태 악화를 예측하는 단계를 포함한다."}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 전자 장치는, 랜덤 포레스트를 기반으로 상태 악화를 예측하는 인공지능 모델을 이용하여, 기존 의 NEWS 방식보다 더 정확한 예측을 제공한다는 효과가 있다. 본 개시에 따른 전자 장치는, 제한된 자원(ex. 중환자실 수, 의료진 수, 의료 인프라 등)을 갖는 의료기관에서 보다 정밀한 예측 기법을 토대로 중증 치료의 우선순위를 정할 수 있도록 한다는 장점이 있다."}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에 대하여 구체적으로 설명하기에 앞서, 본 명세서 및 도면의 기재 방법에 대하여 설명한다. 먼저, 본 명세서 및 청구범위에서 사용되는 용어는 본 개시의 다양한 실시 예들에서의 기능을 고려하여 일반적 인 용어들을 선택하였다. 하지만, 이러한 용어들은 당해 기술 분야에 종사하는 기술자의 의도나 법률적 또는 기 술적 해석 및 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 일부 용어는 출원인이 임의로 선정한 용어 도 있다. 이러한 용어에 대해서는 본 명세서에서 정의된 의미로 해석될 수 있으며, 구체적인 용어 정의가 없으 면 본 명세서의 전반적인 내용 및 당해 기술 분야의 통상적인 기술 상식을 토대로 해석될 수도 있다. 또한, 본 명세서에 첨부된 각 도면에 기재된 동일한 참조번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또는 구성요소를 나타낸다. 설명 및 이해의 편의를 위해서 서로 다른 실시 예들에서도 동일한 참조번호 또 는 부호를 사용하여 설명한다. 즉, 복수의 도면에서 동일한 참조 번호를 가지는 구성요소를 모두 도시되어 있다 고 하더라도, 복수의 도면들이 하나의 실시 예를 의미하는 것은 아니다. 또한, 본 명세서 및 청구범위에서는 구성요소들 간의 구별을 위하여 \"제1\", \"제2\" 등과 같이 서수를 포함하는 용어가 사용될 수 있다. 이러한 서수는 동일 또는 유사한 구성요소들을 서로 구별하기 위하여 사용하는 것이며 이러한 서수 사용으로 인하여 용어의 의미가 한정 해석되어서는 안 된다. 일 예로, 이러한 서수와 결합된 구성요소는 그 숫자에 의해 사용 순서나 배치 순서 등이 제한되어서는 안 된다. 필요에 따라서는, 각 서수들은 서로 교체되어 사용될 수도 있다. 본 명세서에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 \"모듈\", \"유닛\", \"부(part)\" 등과 같은 용어는 적어도 하나의 기능이나 동작을 수행하는 구성요소를 지칭하기 위한 용어이며, 이러한 구성요소는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\", \"유닛\", \"부(part)\" 등은 각각이 개별적인 특정 한 하드웨어로 구현될 필요가 있는 경우를 제외하고는, 적어도 하나의 모듈이나 칩으로 일체화되어 적어도 하나 의 프로세서로 구현될 수 있다. 또한, 본 개시의 실시 예에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적인 연결뿐 아니라, 다른 매체를 통한 간접적인 연결의 경우도 포함한다. 또한, 어떤 부분이 어떤 구성요소를 포함한다는 의미는, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것 을 의미한다. 도 1은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 1을 참조하면, 전자 장치는 메모리 및 프로세서를 포함한다. 전자 장치는 하나 이상의 컴퓨터를 포함하는 다양한 전자기기 내지는 시스템으로 구현될 수 있다. 일 예로, 전자 장치는 적어도 하나의 단말 장치와 통신을 수행하기 위한 서버로 구현될 수 있다. 이 경우, 전자 장치는 환자의 호흡률, 산소 포화도, 혈압(수축기/이완기), 맥박수, 체온, 체질량지수 등 다양한 생체 데이터를 측정하기 위한 적어도 하나의 측정 장치와 통신을 수행할 수 있다. 또한, 전자 장치(10 0)는 환자의 나이, 성별, 의식 수준 등의 생체 데이터를 입력 받기 위한 적어도 하나의 입력 장치와 통신을 수 행할 수도 있다. 전자 장치는 의료용 로봇, 의료용 컴퓨터, 의료용 모니터링 시스템 등으로 구현될 수도 있다. 이 경우, 전 자 장치는 다양한 생체 데이터를 측정하기 위한 수단을 구비하거나 또는 생체 정보를 측정하기 위한 적어 도 하나의 측정 장치와 통신을 수행할 수 있다. 그 밖에, 전자 장치는 스마트폰, 데스크탑 PC, 태블릿 PC, 노트북 PC, 웨어러블 장치, VR/AR 기기, PDA 등 다양한 단말 장치로 구현될 수도 있다. 메모리는 전자 장치 내 구성요소들의 전반적인 동작을 제어하기 위한 운영체제(OS: Operating System), 적어도 하나의 인스트럭션 및 데이터를 저장하기 위한 구성이다. 메모리는 ROM, 플래시 메모리 등의 비휘발성 메모리를 포함할 수 있으며, DRAM 등으로 구성된 휘발성 메모 리를 포함할 수 있다. 또한, 메모리는 하드 디스크, SSD(Solid state drive) 등을 포함할 수도 있다. 도 1을 참조하면, 메모리는 고위험 환자의 상태 악화를 예측하기 위한 적어도 하나의 인공지능 모델 을 포함할 수 있다. 인공지능 모델은, 지도 학습, 비지도 학습, 준지도 학습, 강화 학습 등 다양한 방식의 머신 러닝에 기반한 모델일 수 있다. 또한, 인공지능 모델은 배치 학습(batch learning), 온라인 학습(online learning) 등에 기반한 모델일 수 있다. 일 실시 예로, 인공지능 모델은 다수의 분류기를 정의하여 이용하는 앙상블 학습(ensemble learning)에 기 반한 것일 수도 있다. 구체적인 예로, 인공지능 모델은, 환자의 건강 정보에 포함되는 임의의 특성들을 기반으로 상태 악화를 예 측하기 위한 복수의 결정 트리를 포함하는, 랜덤 포레스트(random forest) 형식으로 구성될 수 있다. 여기서, 건강 정보는, 환자의 나이, 성별, 체질량지수, 동반 질환, 호흡률, 산소 포화도, 혈압(수축기), 맥박수, 체온, 의식 수준 등에 대한 정보를 포함할 수 있다.동반 질환은, 심혈관계 질환, 호흡기계 질환, 위장관계 질환, 신경계 질환, 비뇨기계 질환, 암 등 다양한 질환 을 포함할 수 있다. 환자의 건강 정보는, 환자가 앓고 있는 동반 질환에 대한 정보를 포함할 수 있다. 의식 수준은, 일 예로 AVPU(alert, voice, pain, unresponsive)의 단계로 구분될 수 있으나, 이에 한정되지 않 는다. 환자의 건강 정보는, 환자의 의식 수준이 어떤 단계인지에 대한 정보를 포함할 수 있다. 한편, 환자의 건강 정보는, 상술한 예들 외에도 다양한 생체 항목에 대한 생체 데이터를 포함할 수 있다. 인공지능 모델의 출력(예측)에 해당하는 상태 악화는, 예를 들어, 갑작스러운 중환자실(ICU. Intensive Care Unit) 입실, 또는 갑작스러운 병원 내 사망 등에 해당할 수 있다. 일 예로, 인공지능 모델은 일정 기간(ex. 24시간, 일주일, 한 달 등) 내 환자의 중환자실 입실 여부를 예 측할 수 있으며, 중환자실 입실 가능성을 수치로 출력할 수도 있다. 이때, 인공지능 모델은, 환자의 중환 자실 입실 가능성이 임계치보다 높은 경우, 환자의 중환자실 입실이 예측됨을 나타내는 정보를 출력할 수도 있 다. 또한, 인공지능 모델은 일정 기간 내 환자의 사망 여부를 예측할 수 있으며, 해당 가능성을 수치로 출력할 수 있다. 상술한 인공지능 모델의 생성 내지 훈련은, 전자 장치의 프로세서를 통해 수행될 수도 있고, 적 어도 하나의 외부 장치에서 수행될 수도 있다. 프로세서는 전자 장치에 포함된 각 구성을 전반적으로 제어하기 위한 구성으로, CPU(Central Processing Unit), AP(Application Processor), GPU(Graphic Processing Unit), VPU(Visual Processing Unit), NPU(Neural Processing Unit) 등 다양한 유닛으로 구성될 수 있다. 프로세서는 메모리에 저장된 인스트럭션을 실행함으로써 전자 장치를 제어할 수 있다. 또한, 프로세서는 메모리에 저장된 인공지능 모델을 이용하여 적어도 한 명의 환자의 상태 악화 여부를 예측할 수 있다. 관련하여, 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 상태 악화 예측 방법을 설명하기 위한 흐름도이다. 도 2를 참조하면, 전자 장치는 환자의 나이, 성별, 체질량지수, 동반 질환, 호흡률, 산소 포화도, 수축기 혈압, 맥박수, 체온, 및 의식 수준 등을 포함하는 환자의 건강 정보를 인공지능 모델에 입력할 수 있다 (S210). 일 예로, 전자 장치는 인공지능 모델에 포함된 복수의 결정 트리 각각에, 건강 정보에 포함된 상술한 항목들 중 적어도 일부 항목들을 입력할 수 있다. 그리고, 전자 장치는 인공지능 모델의 출력을 기반으로 환자의 상태 악화를 예측할 수 있다(S220). 구체적으로, 인공지능 모델에 포함된 복수의 결정 트리 각각은, 환자의 건강 정보를 기반으로 환자의 상태 악화를 예측(출력)할 수 있다. 이때, 환자의 건강 정보는 특정한 시점 상의 건강 정보에 해당할 수 있고, 각 트리를 통해 예측되는 상태 악화 에 대한 정보는, 상술한 시점 이후의 적어도 하나의 시점에 대하여 환자의 상태에 대한 정보를 포함할 수 있다. 즉, 각 트리는 환자의 상태 악화 가능성 및 (만약 악화되는 경우) 악화된 상태를 각각 예측할 수 있다. 그리고, 전자 장치는 복수의 결정 트리 각각이 예측한 건강 상태 악화에 대한 정보를 결합하여 최종적인 예측 정보를 획득할 수 있다. 예를 들어, 전자 장치는 복수의 결정 트리 각각의 예측에 대하여 다수결에 따른 합의 결과를 최종 예측으 로 획득할 수도 있고, 또는, 전자 장치는 복수의 결정 트리 각각이 예측한 상태 악화 가능성(ex. 중환자실 입실 가능성 또는 사망 가능성)에 대하여 평균 또는 중간치를 산출하여 최종 예측으로 활용할 수도 있다. 다만, 전자 장치는 이 밖에도 다양한 방식으로 트리들의 출력을 조합하여 최종 예측을 수행할 수 있다. 도 3은 본 개시의 일 실시 예에 따라 이용되는 랜덤 포레스트 기반 인공지능 모델의 개략적 구조를 설명하기 위 한 도면이다. 도 3을 참조하면, 인공지능 모델은 서로 구분되는 복수의 결정 트리(301, 302, 303, 304, …)를 포함할 수 있다. 이를 위해, 전자 장치는 상술한 다양한 항목(나이, 성별, 체질량지수, 동반 질환, 산소 포화도, 호흡률 등) 중 임의의 항목을 이용하여 각 결정 트리를 정의할 수 있다. 이때, 전자 장치는 제1 시점(time point)에 획득된 복수의 환자의 건강 정보, 및 제1 시점 이후의 적어도 하나의 제2 시점에 획득된 복수의 환자의 상태(ex. 상태 유지, 건강 회복, 중환자실 입실, 사망 등)를 기반으로, 복수의 결정 트리(301, 302, 303, 304, …) 각각을 훈련시킬 수 있다. 복수의 결정 트리(301, 302, 303, 304, …) 각각은 서로 다른 노드들로 구성될 수 있으나, 적어도 하나의 노드 를 서로 공통으로 포함할 수도 있다. 복수의 결정 트리는 상술한 다양한 건강 정보의 항목들 중 서로 다른 (임의의) 항목을 입력으로 하여 훈련될 수 있다. 예를 들어, 결정 트리는 나이, 성별, 체질량지수, 산소 포화도를 입력 받아 예측을 수행하도록 구현 될 수 있고, 결정 트리는 성별, 산소 포화도, 호흡률, 동반 질환을 입력 받아 예측을 수행하도록 구현될 수 있다. 한편, 일 실시 예에 따르면, 전자 장치는 복수의 결정 트리(301, 302, 303, 304, …)에 따른 합의 결과에 따라, 적어도 하나의 결정 트리의 입력 데이터(ex. 건강 정보의 항목)를 새롭게 정의하거나 또는 적어도 하나의 결정 트리를 제외할 수도 있다. 일 예로, 복수의 결정 트리의 합의 결과(ex. 다수결)에 따른 (최종) 예측과 비교했을 때, 결정 트리의 예 측이 임계 횟수 이상 틀리는 경우, 전자 장치는 해당 결정 트리를 제외하거나 또는 해당 결정 트리 의 입력 데이터를 랜덤하게 변경하여 새롭게 정의할 수 있다. 예를 들어, 기존에는 나이, 성별, 체질량지 수, 산소 포화도를 기반으로 예측을 수행하던 결정 트리가, 성별, 산소 포화도, 맥박수, 체온을 기반으로 예측을 수행하도록 새롭게 정의될 수 있다. 한편, 상술한 랜덤 포레스트 형식의 인공지능 모델의 효과를 검증하기 위해, 5개 병원(한림 의료원 산하) 에서 다기관 기반의 연속적 코호트 연구가 수행되었다(도 4a, 도 4b). 연구 기간은 2020년 2월부터 2020년 12월로 한국에서의 3차례 코로나 대유행 기간을 포함한다(2월, 8월, 12월). 고위험 환자는 NEWS 7점이상 측정된 환자로 정의되었다. 연구의 결과는, 예기치 못한 중환자실 입실과 병원내 사망이며 예기치 못한 중환자실 입실은 고위험으로 분류되 고 24시간 이내에 중환자실로 전실된 경우로 정의되었다. 본 연구에서, 랜덤 포레스트 기반의 인공지능 모델이 이용되었고, 해당 500개의 나무들(결정 트리들)로 구성되 었다. 인공지능 모델의 정확도는 NEWS와 비교되었다. 예측 모델에 나이, 성별, 체질량 지수, 동반 질환과 수치화 되지 않은 NEWS 지표들(산소 포화도, 맥박수, 체온, 수축기 혈압, 의식 수준, 호흡률)이 포함되었다. 훈련군과 시험군은 7:3 비율로 배정되었다. 동반질환은 심혈관 계, 호흡기계, 위장관계, 신경계, 비뇨기계, 암을 포함하는 질환들로 구성되었으며 국제 질병 분류 코드 10판이 이용되었다. 총 6576개의 NEWS 가 2118명의 환자로부터 측정되었다. 나이, 체질량지수, NEWS 점수의 중위값(사분위수 범위) 은 각각 73(64-82)세, 21(18-24)kg/m2, 8(7-9)점이었다. 남성, 심혈관계, 호흡기계, 위장관계, 신경계, 비뇨기 계, 암의 비율은 각각 60.7%, 4.6%, 47.7%, 9.1%, 2.6%, 4.4%, 28.8% 였다. 도 4a를 참조하면, 랜덤 포레스트 기반 인공지능 모델은 ICU 입원 예측에 (수용자 작용 특징 곡선 아래 영역 [AUROC] 0.787, 95% 신뢰수간 0.748-0.825) 우수한 능력을 보여주었다. 또한, 도 4b를 참조하면, 랜덤 포레스 트 기반 인공지능 모델은, 병원 내 사망을 예측하는 데에 (AUROC 0.881, 95% 신뢰수간 0.866-0.895) 탁월한 능 력을 보여주었다. 이는 NEWS를 통한 예측보다 통계적으로 유의미하게 높았다(p < 0.001). 이렇듯, 랜덤 포레스트 기반의 인공지능 모델은 예기치 못한 중환자실 입실과 병원 내 사망을 예측하는데 우수 한 능력을 보인다는 것이 확인되었으며, 본 인공지능 모델은 급성기 환자 중 누구에게 우선적으로 중증치료가 시행되어야 하는지 결정하는 데에 도움을 줄 수 있다. 특히, 본 인공지능 모델의 경우, 입원 환자에게서 즉각적 으로 측정 가능한 지표들을 기반으로 생성 및 훈련될 수 있다는 장점이 있다. 한편, 본 개시에 따른 일 실시 예에 따르면, 전자 장치는 복수의 환자 각각의 건강 정보를 인공지능 모델 에 입력하여, 복수의 환자 각각의 상태 악화 가능성 및 악화된 상태(ex. 갑작스러운 중환자실 입실, 갑작 스러운 사망 등)를 예측할 수 있다. 이 경우, 전자 장치는 예측된 복수의 환자 각각의 상태 악화 가능성 및 악화된 상태를 기반으로, 복수의 환자에 대한 치료의 우선순위를 식별할 수 있다. 예를 들어, A 환자에 대해서는 갑작스러운 중환자실 입실 가능성이 70퍼센트로 예측되고, B 환자에 대해서는 갑 작스러운 중환자실 입실 가능성이 60 퍼센트로 예측되는 경우, A 환자에 대한 치료 우선순위가 B환자에 대한 치 료 우선순위보다 더 높게 판단될 수 있다. 또한, 예를 들어, C 환자에 대해서는 갑작스러운 중환자실 입실이 예측되고(ex. 70퍼센트), D 환자에 대해서는 갑작스러운 사망(ex. 70퍼센트)이 예측되는 경우, C 환자에 대한 치료 우선순위보다 D 환자에 대한 치료 우선순 위가 더 높게 판단될 수 있다. 한편, 본 개시의 일 실시 예에 따르면, 전자 장치는 복수의 환자 각각의 건강 정보를 인공지능 모델 에 입력하여, 복수의 환자 각각의 상태 악화 여부를 예측하고, 복수의 환자 중 상태 악화가 예측되는 고위험 환 자들의 수를 식별할 수 있다. 예를 들어, 전자 장치는 (예측된) 상태 악화의 가능성이 임계치(ex. 35%) 이상인 환자들을 고위험 환자로 분류할 수 있다. 또한, 전자 장치는 복수의 의료 시설 별로 가용 중환자실 수를 모니터링하고, 의료 시설 별 가용 중환자실 수 및 (앞서 예측/식별된) 고위험 환자들의 수를 기반으로, 복수의 의료 시설에 대한 고위험 환자들의 배치 정 보를 생성할 수 있다. 이를 위해, 전자 장치는 복수의 의료 시설(ex. 병원) 각각의 서버 또는 컴퓨터와 통신을 수행할 수 있으며, 복수의 의료 시설 각각의 가용 중환자실 수에 대한 정보를 수신할 수 있다. 또한, 전자 장치는 복 수의 의료 시설 각각의 환자의 건강 정보를 수신하여, 병원 별로 고위험 환자를 식별할 수도 있다. 이때, 전자 장치는 코로나 등 감염병의 실시간(ex. 매시간, 매일, 매주, 매달 등) 확진자 수에 따라 복수 의 의료 시설 각각의 가용 중환자실 수를 변경할 수 있다. 예를 들어, 전자 장치는 일정 기간 동안의 주기 별 확진자 수(ex. 일주일 동안 일별 확진자 수) 및 해당 기간 동안 감염병으로 인한 주기 별 중환자실 사용 수(ex. 일주일 동안 일별 감염병 환자의 중환자실 입실 수) 를 각각 이용하여, 적어도 하나의 인공지능 모델을 훈련시킬 수 있다. 이때, 본 인공지능 모델은, 감염병에 따 라 추가로 사용될 중환자실의 수를 예측하하기 위한 RNN(Recurrent Neural Network) 모델로 구현될 수 있다. 이 경우, 전자 장치는 각 병원이 포함된 지역 별 감염병의 실시간 확진자 수를 해당 인공지능 모델(RNN)에 입력하여, 각 병원에 대하여 추가로 필요할 것으로 예상되는 중환자실의 수를 예측할 수 있다. 여기서, 병원이 포함된 지역은, 병원을 포함하는 행정 구역(시/군/구/동 등)에 해당할 수도 있고, 또는 병원을 기준으로 일정 거리 내의 지역에 해당할 수도 있다. 예를 들어, 만약 특정 병원의 현재 가용 중환자실 수가 7이라고 하더라도, 감염병으로 인해 해당 지역에 추가로 3의 중환자실이 더 필요할 것으로 예측되는 경우, 전자 장치는 해당 병원의 가용 중환자실 수를 4로 최종 식별할 수 있다. 배치 정보는, (상태 악화가 예상되는) 고위험 환자들 각각이 어떤 의료 시설에 배치될 것인지에 대한 정보를 포 함한다. 관련하여, 도 5는 본 개시의 일 실시 예에 따라 고위험 환자들의 배치 정보를 생성하는 전자 장치의 동작을 설 명하기 위한 도면이다. 전자 장치는, 복수의 의료 시설 각각의 위치 및 고위험 환자들 각각의 현재 위치를 기반으로, 고위험 환자 들의 이동 거리의 합이 최소가 되도록 배치 정보를 생성할 수 있다. 도 5를 참조하면, 병원 A, 병원 B, 병원 C의 경우 각각 가용 중환자실 수에 5, 1, 1 만큼 여유가 있는 반면, 병 원 D 및 병원 E는 각각 3, 2 만큼 중환자실 수가 부족한 상황이다. 이 경우, 전자 장치는 중환자실 수가 부족한 병원(ex. 병원 D, E)으로부터 여유가 있는 병원(ex. 병원 A, B, C)으로 배치를 옮겨야 할 고위험 환자의 수를 병원 별로 식별할 수 있다. 즉, 도 5의 경우, 전자 장치는 병원 D에서 3명의 고위험 환자를 다른 병원으로 옮겨야 하고, 병원 E에서 2명의 고위험 환자를 다른 병원으 로 옮겨야 하는 것으로 결정할 수 있다. 여기서, 전자 장치는 각 병원 별로(병원 D, E), 중증 치료가 필요한 우선순위에 따라 다른 병원으로 옮겨 질 환자를 결정할 수 있다. 예를 들어, 갑작스러운 중환자실 입원 가능성 또는 갑작스러운 사망 가능성이 비교 적 낮은 고위험 환자일수록 중증 치료의 우선순위가 낮게 산정될 수 있고, 중증 치료의 우선순위가 낮은 환자가 다른 병원으로 옮겨질 환자로 선택될 수 있다. 이렇듯, 옮겨질 환자들이 특정되면, 전자 장치는 다른 병원으로 이동되어야 하는 환자들의 이동 거리의 합 이 최소가 되도록, (이동이 필요한) 5명의 환자의 배치 정보를 생성할 수 있다. 이 경우, 전자 장치는 5명의 환자 각각이 다른 병원(병원 A, B, C)으로 옮겨질 수 있는 모든 경우의 수에 대하여 이동 거리의 합을 산출하고, 그 중 이동 거리의 합이 최소가 되는 경우에 따라 배치 정보를 생성할 수 있다. 이 경우, 각 환자의 이동 거리는, 병원 간의 직선 거리에 따라 정의될 수도 있지만, 지도 상의 도로 정보에 따 라 병원 간 이동 경로의 거리에 따라 정의될 수도 있다. 다른 실시 예로, 전자 장치는 치료의 우선 순위에 따라 이동 거리에 대한 가중치를 적용하여 배치 정보를 생성할 수 있다. 즉, 단순히 이동 거리의 합이 최소가 되는 상술한 방식과 달리, 단위 거리에 따른 가중치가 환 자 별로 다르게 반영된 이동 거리의 합이 최소가 되는 방식이 이용될 수 있다. 구체적으로, 전자 장치는 고위험 환자들 각각에 대하여 예측된 상태 악화 가능성 및 악화된 상태(중환자실 입실, 사망)를 기반으로, 고위험 환자들에 대한 치료의 우선순위를 식별할 수 있다. 도 5를 참조하면, 앞서 설명된 실시 예와 마찬가지로, 병원 D에서 우선순위가 가장 낮은 3명의 환자가 이동의 대상으로 선택되고, 병원 E에서 우선순위가 가장 낮은 2명의 환자가 이동의 대상으로 선택될 수 있다. 다만, 여기서, 전자 장치는 이동의 대상이 되는 환자들에 대해서도 우선순위를 각각 구분하여, (이동의 대 상이 되는) 고위험 환자들 각각의 단위 거리 이동에 대한 가중치를 선택할 수 있다. 예를 들어, 병원 D에서 이동의 대상이 되는 환자 1, 환자 2, 환자 3 각각에 대하여 (예기치 않은) 중환자실 입 실 가능성이 각각 46%, 47%, 48%이고, 병원 E에서 이동의 대상이 되는 환자 4, 환자 5 각각에 대하여 (예기치 않은) 중환자실 입실 가능성이 각각 49%, 50%인 경우를 가정한다. 이 경우, 중증 치료의 우선순위는 환자 5, 환자 4, 환자 3, 환자 2, 환자 1의 순서로 결정될 수 있다. 그 결과, 환자 1 내지 환자 5 중 환자 5의 단위 거리 이동에 대한 가중치가 가장 높게 선택되고, 환자 1의 단위 거리 이동에 대한 가중치가 가장 낮게 선택될 수 있다. 일 예로, 환자 1, 환자 2, 환자 3, 환자 4, 환자 5 각각 의 단위 거리 이동에 대한 가중치는 (km 당) 각각 11, 12, 13, 14, 15로 선택될 수 있다. 이 경우, 5명의 환자가 다른 병원(병원 A, B, C)으로 이동하게 되는 모든 경우들에 대하여, 환자 각각의 가중치 가 곱해진 환자 각각의 이동거리들의 합이 산출될 수 있다(sum = (환자 1의 이동거리 * 환자 1의 가중치) + (환 자 2의 이동거리 * 환자 2의 가중치) + (환자 3의 이동거리 * 환자 3의 가중치) + (환자 4의 이동거리 * 환자 4 의 가중치) + (환자 5의 이동거리 * 환자 5의 가중치)). 그리고, 모든 경우들 중, 가중치가 적용된 이동거리들의 합(sum)이 최소인 경우에 따라 배치 정보가 생성될 수 있다. 한편, 도 6은 본 개시의 다양한 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 6을 참조하면, 전자 장치는 메모리 및 프로세서 외에도 통신부, 사용자 입력부, 출력부 등을 더 포함할 수 있다. 통신부는 전자 장치가 적어도 하나의 외부 장치와 통신을 수행하기 위한 구성으로 회로를 포함할 수 있다. 통신부는 TCP/IP(Transmission Control Protocol/Internet Protocol), UDP(User Datagram Protocol), HTTP(Hyper Text Transfer Protocol), HTTPS(Secure Hyper Text Transfer Protocol), FTP(File Transfer Protocol), SFTP(Secure File Transfer Protocol), MQTT(Message Queuing Telemetry Transport) 등의 통신 규약(프로토콜)을 이용하여 하나 이상의 외부 전자 장치와 다양한 정보를 송수신할 수 있다. 이를 위해, 통신부는 유선 통신 및/또는 무선 통신을 통해 구현된 네트워크를 기반으로, 외부 장치와 연결 될 수 있다. 이때, 통신부는 외부 장치와 직접적으로 연결될 수도 있지만, 네트워크를 제공하는 하나 이상 의 외부 서버(ex. ISP(Internet Service Provider))를 통해서 외부 전자 장치와 연결될 수도 있다. 네트워크는 영역 또는 규모에 따라 개인 통신망(PAN; Personal Area Network), 근거리 통신망(LAN; Local Area Network), 광역 통신망(WAN; Wide Area Network) 등일 수 있으며, 네트워크의 개방성에 따라 인트라넷 (Intranet), 엑스트라넷(Extranet), 또는 인터넷(Internet) 등일 수 있다. 무선 통신은 LTE(long-term evolution), LTE-A(LTE Advance), 5G(5th Generation) 이동통신, CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), GSM(Global System for Mobile Communications), DMA(Time Division Multiple Access), WiFi(Wi-Fi), WiFi Direct, Bluetooth, NFC(near field communication), Zigbee 등의 통신 방식 중 적어도 하나를 포함할 수 있다. 유선 통신은 이더넷(Ethernet), 광 네트워크(optical network), USB(Universal Serial Bus), 선더볼트 (ThunderBolt) 등의 통신 방식 중 적어도 하나를 포함할 수 있다. 여기서, 통신부는 상술한 유무선 통신 방식에 따른 네트워크 인터페이스(Network Interface) 또는 네트워 크 칩을 포함할 수 있다. 한편, 통신 방식은 상술한 예에 한정되지 아니하고, 기술의 발전에 따라 새롭게 등장 하는 통신 방식을 포함할 수 있다. 일 예로, 전자 장치가 서버로 구현된 경우, 전자 장치는 통신부를 통해 적어도 하나의 단말(ex. 스마트폰, 혈압/맥박 측정 장치 등)과 통신을 수행할 수 있다. 구체적으로, 서버인 전자 장치는 적어도 하 나의 웹 페이지 또는 애플리케이션을 통해 사용자 단말과 연동될 수 있다. 이 경우, 전자 장치는 단말을 통해 적어도 한 종류의 생체 데이터를 입력 받거나, 인공지능 모델의 출력에 따른 상태 악화 예측에 대한 정보를 단말을 통해 제공할 수도 있다. 사용자 입력부는 사용자로부터 다양한 명령 또는 생체 정보를 입력 받기 위한 구성이다. 사용자 입력부 는 터치 센서, 버튼, 카메라, 마이크, 키패드, 마우스 등으로 구현될 수 있다. 전자 장치는, 사용자 입력부를 통해 적어도 한 명의 환자에 대하여 다양한 종류의 생체 데이터를 (주 기 별로) 입력 받을 수 있으며, 환자의 상택 악화 여부를 예측하도록 요청하는 사용자 명령을 입력 받을 수도 있다. 출력부는 다양한 정보를 출력하기 위한 구성으로, 디스플레이, 오디오 출력부 등을 포함할 수 있다. 오디 오 출력부는, 스피커, 오디오/헤드폰 연결 단자 등을 포함할 수 있다. 일 실시 예로, 전자 장치는 환자의 상태 악화 가능성 내지는 악화된 상태 등에 대한 예측 정보를 디스플레 이 상에 표시하거나 스피커 등을 통해 음성 형태로 출력할 수 있다. 만약, 상술한 실시 예들에 따라, 환자가 상태 악화가 예측되는 고위험 환자인 것으로 예측된 경우, 전자 장치 는 중증 치료가 필요함을 알리는 정보를 출력함과 동시에, 의료진의 단말 또는 의료 시스템에 해당 환자의 고위험(중증 치료 필요)을 알리는 정보를 전송할 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 서로 저촉되지 않는 한 복수의 실시 예가 결합되어 구현될 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합된 것 을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드웨어적인 구현에 의하면, 본 개시에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기 (controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행 을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수있다. 상술한 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 시스템 내 각 장치에서의 처리동작을 수행하기 위한 컴퓨터 명령어(computer instructions) 또는 컴퓨터 프로그램은 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium)에 저장될 수 있다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어 또는 컴퓨터 프로그램은 특정 기기의 프로세서에 의해 실행되었을 때 상술한 다양한 실시 예에 따른 전자장치에 서의 처리 동작을 상술한 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체 가 아니라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등 이 있을 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2021-0065900", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2021-0065900", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도, 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 상태 악화 예측 방법을 설명하기 위한 흐름도, 도 3은 본 개시의 일 실시 예에 따라 이용되는 랜덤 포레스트 기반 인공지능 모델의 개략적 구조를 설명하기 위 한 도면, 도 4a 내지 도 4b는 본 개시의 일 실시 예에 따라 랜덤 포레스트 기반 인공지능 모델을 활용한 전자 장치의 예 측 성능을 설명하기 위한 그래프들, 도 5는 본 개시의 일 실시 예에 따라 고위험 환자들의 배치 정보를 생성하는 전자 장치의 동작을 설명하기 위한 도면, 그리고 도 6은 본 개시의 다양한 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다."}
