{"patent_id": "10-2022-0143377", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0061705", "출원번호": "10-2022-0143377", "발명의 명칭": "딥러닝 모델의 이벤트 검출 성능 향상 방법 및 그 장치", "출원인": "세종대학교산학협력단", "발명자": "공성곤"}}
{"patent_id": "10-2022-0143377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "(a) 제1 환경에서 사전 학습된 딥러닝 모델을 상기 제1 환경과는 상이한 제2 환경에 설치된 감시 카메라에 적용함으로써 상기 제2 환경에서 상기 감시 카메라를 통해 취득되는 영상을 상기 제1 환경에서 사전 학습된 딥러닝모델에 입력하여 이벤트 검출을 수행하고, 상기 이벤트 검출된 프레임들을 추출하여 저장하는 단계-상기 이벤트검출된 프레임들은 적어도 하나의 이벤트 객체 영역에 대한 바운딩 박스를 포함함;(b) 상기 이벤트 검출 프레임들을 각각 사전에 오탐지 분류 학습된 이진 분류 모델에 적용하여 각 바운딩 박스에 대한 라벨링을 수행하는 단계; 및 (c) 상기 라벨링된 결과를 기초로 상기 딥러닝 모델을 다시 학습시키는 단계를 포함하는 딥러닝 모델 이벤트 검출 성능 향상 방법."}
{"patent_id": "10-2022-0143377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 (b) 단계에서, 상기 사전에 오탐지 분류 학습된 이진 분류 모델은 상기 이벤트 검출 프레임내의 각 바운딩 박스가 오탐지 객체인지를 분류한 후 오탐지 객체이면 오탐지 라벨로 라벨링하고, 오탐지 객체가 아니면 정상 탐지 라벨로 라벨링하는 것을 특징으로 하는 딥러닝 모델 이벤트 검출 성능 향상 방법."}
{"patent_id": "10-2022-0143377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 제2 환경은 배경, 조명 조건 및 감시 거리와 각도를 포함하는 설치 조건 중 적어도 하나가 상기 제1 환경과는 상이한 것을 특징으로 하는 딥러닝 모델 이벤트 검출 성능 향상 방법."}
{"patent_id": "10-2022-0143377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서,상기 (c) 단계는, 상기 정상 탐지 라벨로 라벨링된 객체를 포지티브 학습 데이터 셋에 포함시킨 후 상기 포지티브 학습 데이터 셋을 이용하여 상기 사전 학습된 딥러닝 모델을 포지티브 학습(positive learning)시키는 단계; 및상기 오탐지 라벨로 라벨링된 오탐지 객체를 이용하여 네거티브 학습 데이터 셋을 구성한 후 상기 네거티브 학습 데이터 셋을 이용하여 상기 사전 학습된 딥러닝 모델을 네거티브 학습(negative learning)시키는 단계를 포함하는 딥러닝 모델 이벤트 검출 성능 향상 방법."}
{"patent_id": "10-2022-0143377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항 내지 제4 항 중 어느 하나의 항에 따른 방법을 수행하기 위한 프로그램 코드를 기록한 컴퓨터로 판독 가능한 기록매체.공개특허 10-2024-0061705-3-청구항 6 제1 환경에서 사전 학습된 딥러닝 모델을 상기 제1 환경과는 상이한 제2 환경에 설치된 감시 카메라에 적용하여상기 제2 환경에서 상기 감시 카메라를 통해 취득된 영상을 분석하여 이벤트 검출을 수행하는 이벤트 검출부;상기 이벤트 검출 결과 이벤트 검출된 프레임들을 수집하는 데이터 수집부- 상기 이벤트 검출된 프레임들은 적어도 하나의 이벤트 객체 영역에 대한 바운딩 박스를 포함함;상기 이벤트 검출 프레임들을 각각 사전에 오탐지 분류 학습된 이진 분류 모델에 적용하여 각 바운딩 박스에 대한 라벨링을 수행하는 라벨 생성부; 및 상기 라벨링된 결과를 기초로 상기 딥러닝 모델을 다시 학습시키는 학습부를 포함하는 딥러닝 모델 이벤트 검출성능 향상 장치."}
{"patent_id": "10-2022-0143377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 라벨 생성부는, 상기 사전에 오탐지 분류 학습된 이진 분류 모델에 의해 상기 이벤트 검출 프레임내의 각바운딩 박스가 오탐지 객체로 분류되면 오탐지 라벨로 라벨링하고, 오탐지 객체가 아니면 정상 탐지 라벨로 라벨링하는 것을 특징으로 하는 딥러닝 모델 이벤트 검출 성능 향상 장치."}
{"patent_id": "10-2022-0143377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6 항에 있어서,상기 제2 환경은 배경, 조명 조건, 설치 조건 및 이벤트 유형 중 적어도 하나가 상기 제1 환경과는 상이한 것을특징으로 하는 딥러닝 모델 이벤트 검출 성능 향상 장치."}
{"patent_id": "10-2022-0143377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 학습부는, 상기 정상 탐지 라벨로 라벨링된 객체를 포지티브 학습 데이터 셋에 포함시킨 후 상기 포지티브 학습 데이터 셋을 이용하여 상기 사전 학습된 딥러닝 모델을 포지티브 학습(positive learning)시키고, 상기 오탐지 라벨로 라벨링된 오탐지 객체를 이용하여 네거티브 학습 데이터 셋을 구성한 후 상기 네거티브 학습 데이터 셋을 이용하여 상기 사전 학습된 딥러닝 모델을 네거티브 학습(negative learning)시키는 것을 특징으로 하는 딥러닝 모델 이벤트 검출 성능 향상 장치."}
{"patent_id": "10-2022-0143377", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "딥러닝 모델의 이벤트 검출 성능 향상 방법 및 장치가 개시된다. 딥러닝 모델의 이벤트 검출 성능 향상 방법은, (a) 제1 환경에서 사전 학습된 딥러닝 모델을 상기 제1 환경과는 상이한 제2 환경에 설치된 감시 카메라에 적용 함으로써 상기 제2 환경에서 상기 감시 카메라를 통해 취득되는 영상을 상기 제1 환경에서 사전 학습된 딥러닝 모델에 입력하여 이벤트 검출을 수행하고, 상기 이벤트 검출된 프레임들을 추출하여 저장하는 단계-상기 이벤트 검출된 프레임들은 적어도 하나의 이벤트 객체 영역에 대한 바운딩 박스를 포함함; (b) 상기 이벤트 검출 프레임 들을 각각 사전에 오탐지 분류 학습된 이진 분류 모델에 적용하여 각 바운딩 박스에 대한 라벨링을 수행하는 단 계; 및 (c) 상기 라벨링된 결과를 기초로 상기 딥러닝 모델을 다시 학습시키는 단계를 포함한다."}
{"patent_id": "10-2022-0143377", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 딥러닝 모델의 이벤트 검출 성능 향상 방법 및 그 장치에 관한 것이다."}
{"patent_id": "10-2022-0143377", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기반 지능형 감시 카메라 시스템은 감시 카메라(surveillance video camera)를 이용하여 감시 대상 사 이트로부터 비디오 영상을 연속적으로 수집하고, 딥러닝 모델을 이용하여 실시간으로 분석함으로써 사람의 개입 없이도 원격으로 검출하고자 하는 이벤트(event)를 스스로 찾아내어 검출된 이벤트 이미지와 관련 정보를 사용자에게 제공할 수 있다. 이러한 딥러닝 모델을 감시 카메라에 적용하여 이벤트를 검출하기 위해서는 해당 딥러닝 모델에 대한 사전 학습 과정이 필요하다. 딥러닝 모델에서 원하는 이벤트를 검출하기 위해, 학습 데이터 셋을 구축한 후 오프라인 상에 서 해당 딥러닝 모델을 사전 학습시키고, 사전 학습된 딥러닝 모델을 새로운 감시 환경에 설치된 감시 카메라 시스템에 적용하여 관심 이벤트를 검출한다. 그러나, 사전 학습된 딥러닝 모델을 새로운 감시 환경에 설치된 감 시 카메라 시스템에 적용하는 경우, 딥러닝 모델의 사전 학습시 사용된 훈련 데이터 셋과 비교하여 달라진 배경 이나 조명 조건 등과 같이 변화된 환경으로 인해 딥러닝 모델의 이벤트 검출 성능이 크게 낮아지며, 결과적으로 많은 수의 오탐지(false positive)가 발생하는 문제점이 있다."}
{"patent_id": "10-2022-0143377", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 딥러닝 모델의 이벤트 검출 성능 향상 방법 및 그 장치를 제공하기 위한 것이다. 또한, 본 발명은 사전 학습된 딥러닝 모델을 새로운 환경에 적용시 이진 분류기(Binary Classifier)를 이용하여 자동으로 라벨링하여 딥러닝 모델을 재학습시켜 성능을 향상시킬 수 있는 딥러닝 모델의 이벤트 검출 성능 향상 방법 및 그 장치를 제공하기 위한 것이다. 이를 통해, 본 발명은 재학습을 위한 학습 데이터의 라벨링 과정에 소요되는 시간과 노력을 줄여 딥러닝 모델의 재학습 과정의 속도와 성능을 향상시킬 수 있는 딥러닝 모델의 이벤트 검출 성능 향상 방법 및 그 장치를 제공 하기 위한 것이다."}
{"patent_id": "10-2022-0143377", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면 딥러닝 모델의 이벤트 검출 성능 향상 방법이 제공된다. 본 발명의 일 실시예에 따르면, (a) 제1 환경에서 사전 학습된 딥러닝 모델을 상기 제1 환경과는 상이한 제2 환 경에 설치된 감시 카메라에 적용함으로써 상기 제2 환경에서 상기 감시 카메라를 통해 취득되는 영상을 상기 제 1 환경에서 사전 학습된 딥러닝 모델에 입력하여 이벤트 검출을 수행하고, 상기 이벤트 검출된 프레임들을 추출 하여 저장하는 단계-상기 이벤트 검출된 프레임들은 적어도 하나의 이벤트 객체 영역에 대한 바운딩 박스를 포 함함; (b) 상기 이벤트 검출 프레임들을 각각 사전에 오탐지 분류 학습된 이진 분류 모델에 적용하여 각 바운딩 박스에 대한 라벨링을 수행하는 단계; 및 (c) 상기 라벨링된 결과를 기초로 상기 딥러닝 모델을 다시 학습시키 는 단계를 포함하는 딥러닝 모델 이벤트 검출 성능 향상 방법이 제공될 수 있다. 상기 (b) 단계에서, 상기 사전에 오탐지 분류 학습된 이진 분류 모델은 상기 이벤트 검출 프레임내의 각 바운딩 박스가 오탐지 객체인지를 분류한 후 오탐지 객체이면 오탐지 라벨로 라벨링하고, 오탐지 객체가 아니면 정상 탐지 라벨로 라벨링할 수 있다. 상기 제2 환경은 배경, 조명 조건, 감시 거리, 각도 등 설치 조건 중 적어도 하나가 상기 제1 환경과는 상이하 다. 상기 (c) 단계는, 상기 정상 탐지 라벨로 라벨링된 객체를 포지티브 학습 데이터 셋에 포함시킨 후 상기 포지티 브 학습 데이터 셋을 이용하여 상기 사전 학습된 딥러닝 모델을 포지티브 학습(positive learning)시키는 단계; 및 상기 오탐지 라벨로 라벨링된 오탐지 객체를 이용하여 네거티브 학습 데이터 셋을 구성한 후 상기 네거티브 학습 데이터 셋을 이용하여 상기 사전 학습된 딥러닝 모델을 네거티브 학습(negative learning)시키는 단계를 포함할 수 있다. 본 발명의 다른 측면에 따르면, 딥러닝 모델의 이벤트 검출 성능 향상 장치가 제공된다. 본 발명의 일 실시예에 따르면, 제1 환경에서 사전 학습된 딥러닝 모델을 상기 제1 환경과는 상이한 제2 환경에 설치된 감시 카메라에 적용하여 상기 제2 환경에서 상기 감시 카메라를 통해 취득된 영상을 분석하여 이벤트 검 출을 수행하는 이벤트 검출부; 상기 이벤트 검출 결과 이벤트 검출된 프레임들을 수집하는 데이터 수집부- 상기이벤트 검출된 프레임들은 적어도 하나의 이벤트 객체 영역에 대한 바운딩 박스를 포함함; 상기 이벤트 검출 프 레임들을 각각 사전에 오탐지 분류 학습된 이진 분류 모델에 적용하여 각 바운딩 박스에 대한 라벨링을 수행하 는 라벨 생성부; 및 상기 라벨링된 결과를 기초로 상기 딥러닝 모델을 다시 학습시키는 학습부를 포함하는 딥러 닝 모델 이벤트 검출 성능 향상 장치가 제공될 수 있다. 상기 라벨 생성부는, 상기 사전에 오탐지 분류 학습된 이진 분류 모델에 의해 상기 이벤트 검출 프레임내의 각 바운딩 박스가 오탐지 객체로 분류되면 오탐지 라벨로 라벨링하고, 오탐지 객체가 아니면 정상 탐지 라벨로 라 벨링할 수 있다. 상기 학습부는, 상기 정상 탐지 라벨로 라벨링된 객체를 포지티브 학습 데이터 셋에 포함시킨 후 상기 포지티브 학습 데이터 셋을 이용하여 상기 사전 학습된 딥러닝 모델을 포지티브 학습(positive learning)시키고, 상기 오 탐지 라벨로 라벨링된 오탐지 객체를 이용하여 네거티브 학습 데이터 셋을 구성한 후 상기 네거티브 학습 데이 터 셋을 이용하여 상기 사전 학습된 딥러닝 모델을 네거티브 학습(negative learning)시킬 수 있다. 목표로 하는 성능에 도달할 때까지 상기 과정을 여러 번 반복하여 실행할 수 있다."}
{"patent_id": "10-2022-0143377", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 딥러닝 모델의 이벤트 검출 성능 향상 방법 및 그 장치를 제공함으로써, 사전 학습 된 딥러닝 모델을 새로운 환경에 적용시 이진 분류 모델을 통해 자동으로 라벨링하여 딥러닝 모델을 재학습시켜 성능을 향상시킬 수 있다. 이를 통해, 본 발명은 라벨링 과정에 소요되는 시간과 노력을 줄여 딥러닝 모델의 재학습 과정의 속도와 성능을 향상시킬 수 있다."}
{"patent_id": "10-2022-0143377", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서상에 기재된 여러 구성 요소들, 또는 여러 단계들 을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 명 세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 이하, 첨부된 도면들을 참조하여 본 발명의 실시예를 상세히 설명한다. 도 1은 본 발명의 일 실시예에 따른 딥러닝 모델 이벤트 검출 성능 향상 방법을 나타낸 순서도이고, 도 2는 본 발명의 일 실시예에 따른 이벤트 검출된 프레임의 일 예를 도시한 도면이고, 도 3은 본 발명의 일 실시예에 따 른 라벨링 과정을 설명하기 위해 도시한 도면이다. 단계 110에서 딥러닝 모델 이벤트 검출 성능 향상 장치는 제1 환경에서 사전 학습된 딥러닝 모델에 제2 환 경에 설치된 감시 카메라로부터 수신된 영상을 입력하여 이벤트 검출을 수행하고, 이벤트 검출된 프레임들을 저 장한다. 여기서, 제1 환경과 제2 환경은 서로 다른 환경으로, 보다 상세하게 감시 카메라가 설치된 환경이 서로 상이하 다. 따라서, 제1 환경에 설치된 제1 감시 카메라로부터 획득되는 제1 영상과 제2 환경에 설치된 제2 감시 카메 라로부터 획득되는 제2 영상은 서로 다른 조건에서 촬영된 영상으로 배경이 서로 상이하고, 영상이 촬영되는 조 명 조건이 서로 상이할 수 있다. 즉, 제1 감시 카메라와 제2 감시 카메라는 서로 다른 지역에 서로 다른 조건에 설치되며, 검출되는 이벤트 유형 또한 서로 상이할 수 있다. 딥러닝 모델은 제1 환경에서 취득된 영상을 기초로 이벤트를 검출하도록 사전 학습될 수 있다. 사전 학습된 딥 러닝 모델은 제2 환경에 설치된 감시 카메라로부터 획득되는 영상을 분석하여 이벤트 검출을 수행할 수 있다. 딥러닝 모델 이벤트 검출 성능 향상 장치는 사전 학습된 딥러닝 모델에서 제2 환경에서 취득된 영상을 토 대로 이벤트 검출을 수행한 결과 이벤트 검출된 프레임들(이하, 이벤트 검출 프레임이라 칭하기로 함)을 저장한 다. 예를 들어, 사전 학습된 딥러닝 모델이 제2 환경에서 취득된 영상을 분석하여 '이상 행동 객체' 검출을 이벤트 검출로 수행하여 도 2와 같이 이상 행동 객체(즉, 이벤트 객체)를 각각 검출하였다고 가정하기로 한다. 딥러닝 모델은 검출된 이상 행동 객체를 바운딩 박스로 표시하고, 해당 이상 행동 객체가 검출된 시간을 나타내는 타임 스탬프를 포함하여 해당 영상(프레임)을 이벤트 검출 프레임으로 저장할 수 있다. 단계 115에서 딥러닝 모델 이벤트 검출 성능 향상 장치는 이벤트 검출 프레임들을 사전에 오탐지 분류 학 습된 이진 분류 모델에 적용하여 라벨링한다. 이에 대해 보다 상세히 설명하기로 한다. 이진 분류 모델은 사전에 이벤트 객체의 오탐지 분류 학습되어 있는 것을 가정하기로 한다. 즉, 이진 분류 모델 은 이벤트 객체가 오탐지 객체인지 여부를 분류하도록 사전 학습되어 있다. 이진 분류 모델은 바뀐 환경의 데이 터로 사전에 오탐지 분류 학습될 수 있다. 이진 분류 모델은 제1 환경에 의해 사전 학습된 딥러닝 모델이 새롭 게 적용된 제2 환경의 데이터로 사전에 오탐지 분류 학습될 수 있다. 따라서, 이진 분류 모델은 이벤트 객체가 오탐지 객체인지 여부만 판단하여 분류할 수 있다. 즉, 이진 분류 모 델은 이벤트 검출 프레임들에 각각의 바운딩 박스가 오탐지 객체인지를 판단하여 분류할 수 있다. 딥러닝 모델 이벤트 검출 성능 향상 장치는 이진 분류 모델에 의해 오탐지 객체로 판단된 바운딩 박스에 대해서는 오탐 지 라벨(예를 들어, 0)으로 라벨링할 수 있다. 이어, 딥러닝 모델 이벤트 검출 성능 향상 장치는 이진 분 류 모델에 의해 오탐지 객체로 판단되지 않은 바운딩 박스에 대해서는 정상 탐지 라벨(예를 들어, 1)로 라벨링 할 수 있다. 예를 들어, 도 2의 210은 오탐지 객체이고, 220은 이벤트 객체인 것을 가정하기로 한다. 사전 오탐지 학습된 이진 분류 모델은 도 2의 210 바운딩 박스는 오탐지 객체로 분류할 수 있다. 이에 따라, 도 3에 도시된 바와 같이, 해당 210 바운딩 박스는 오탐지 라벨로 라벨링될 수 있다. 또한, 사전 오탐지 학습된 이 진 분류 모델은 도 2의 220 바운딩 박스는 오탐지 객체가 아닌 것으로 분류할 수 있다. 이에 따라 딥러닝 모델 이벤트 검출 성능 향상 장치는 도 3에 도시된 바와 같이, 220 바운딩 박스는 정상 탐지 라벨로 라벨링할 수 있다. 단계 120에서 딥러닝 모델 이벤트 검출 성능 향상 장치는 라벨링된 결과를 기초로 사전 학습된 딥러닝 모 델을 재학습시킨다. 이를 통해, 딥러닝 모델 이벤트 검출 성능 향상 장치는 해당 딥러닝 모델이 신규 환경 에 적합하도록 성능을 향상시켜 오탐지율을 낮출 수 있다. 이에 대해 보다 상세히 설명하기로 한다. 딥러닝 모델 이벤트 검출 성능 향상 장치는 정상 탐지 객체로 라벨링된 바운딩 박스(즉, 이벤트 객체)는 포지티브 학습 데이터 셋에 추가시킬 수 있다. 이에 따라, 딥러닝 모델 이벤트 검출 성능 향상 장치는 해 당 포지티브 학습 데이터 셋을 이용하여 사전 학습된 딥러닝 모델을 포지티브 학습(positive learning)시킬 수 있다. 또한, 딥러닝 모델 이벤트 검출 성능 향상 장치는 오탐지 객체로 라벨링된 바운딩 박스를 이용하여 네거티 브 학습 데이터 셋을 구성할 수 있다. 이어, 딥러닝 모델 이벤트 검출 성능 향상 장치는 해당 네거티브 학 습 데이터 셋을 이용하여 사전 학습된 딥러닝 모델을 네거티브 학습(negative learning)시킬 수 있다. 도 4는 본 발명의 일 실시예에 따른 딥러닝 모델 이벤트 검출 성능 향상 장치의 내부 구성을 개략적으로 도시한 블록도이다. 도 4를 참조하면, 본 발명의 일 실시예에 따른 딥러닝 모델 이벤트 검출 성능 향상 장치는 이벤트 검출부 , 데이터 수집부, 라벨 생성부, 학습부, 메모리 및 프로세서를 포함하여 구성된 다. 이벤트 검출부는 감시 카메라로부터 획득되는 영상을 사전 학습된 딥러닝 모델에 적용하여 이벤트를 검출 하기 위한 수단이다. 여기서, 사전 학습된 딥러닝 모델은 전술한 바와 같이, 제1 환경의 학습 데이터 셋을 이용 하여 사전 학습되어 있는 것을 가정하기로 한다. 또한, 감시 카메라는 제1 환경과는 상이한 제2 환경에 설치된 카메라인 것을 가정하기로 한다. 따라서, 사전 학습된 딥러닝 모델은 사전 학습된 환경과는 상이한 다른 환경에 설치된 감시 카메라로부터 다른 환경에서 취득되는 영상을 분석하여 이벤트 검출을 수행할 수 있다. 이와 같이, 딥러닝 모델이 적용되는 환경이 바뀜에 따라, 사전 학습된 딥러닝 모델에 입력되는 영상은 기본적으 로 배경, 조도 조건, 카메라 설치 조건, 이벤트 조건 등이 상이할 수 있다. 이로 인해, 이전 학습된 딥러닝 모 델은 영상의 차이와 이벤트 조건의 차이 등으로 인해 비록 사전 학습되어 있을지라도 이벤트 검출 성능이 현저 하게 낮아질 수 있다. 따라서, 본 발명의 일 실시예에 따른 딥러닝 모델 이벤트 검출 성능 향상 장치는 신규 적용된 환경에서 원 하는 이벤트 검출 성능을 가지도록 딥러닝 모델을 추가 학습시킬 수 있다. 데이터 수집부는 이벤트 검출부에 의해 이벤트 검출된 프레임들을 각각 수집한다. 여기서, 이벤트 검 출된 프레임들 각각 적어도 하나의 검출된 이벤트 객체에 대한 바운딩 박스를 포함할 수 있다. 라벨 생성부는 이진 분류 모델을 가진다. 여기서, 이진 분류 모델은 제2 환경에서 취득된 영상을 이용하여 오탐지 분류가 사전 학습되어 있는 것을 가정하기로 한다. 즉, 이진 분류 모델은 이벤트 객체가 오탐지 객체인 지를 분류할 수 있다. 따라서, 라벨 생성부는 이벤트 검출된 프레임들을 각각 이진 분류 모델에 적용하되, 이진 분류 모델은 이 벤트 검출 프레임내의 각 바운딩 박스가 오탐지 객체인지 여부를 각각 분류할 수 있다. 이에 따라, 라벨 생성부 는 이진 분류 모델에 의해 오탐지 객체로 분류된 바운딩 박스는 오탐지 라벨로 라벨링할 수 있다. 반면, 라벨 생성부는 이진 분류 모델에 의해 오탐지 객체로 분류되지 않은 바운딩 박스는 정상 탐지 라벨로 라벨 링할 수 있다. 이와 같이, 사전 학습된 딥러닝 모델이 새로운 환경에서 취득된 영상을 분석하여 이벤트 객체를 검출한 결과에 대해 오탐지 학습된 이진 분류 모델이 자동으로 오탐지 객체인지 여부를 판단하여 라벨링하도록 함으로써 딥러 닝 모델의 후처리 성능을 향상시킬 수 있을 뿐만 아니라 시간을 비약적으로 단축시킬 수 있는 이점이 있다. 학습부는 라벨링된 결과를 이용하여 사전 학습된 딥러닝 모델을 재학습시키기 위한 수단이다. 학습부는 라벨 생성부에 의해 정상 탐지 라벨로 라벨링된 객체(즉, 정상 탐지 객체)를 포지티브 학습 데이터 셋에 포함시킬 수 있다. 이어, 학습부는 해당 포지티브 학습 데이터 셋을 이용하여 사전 학습된 딥 러닝 모델을 포지티브 학습(positive learning)시킬 수 있다. 또한, 학습부는 라벨 생성부에 의해 오탐지 객체로 라벨링된 객체(즉, 오탐지 객체)를 이용하여 네거 티브 학습 데이터 셋을 구성할 수 있다. 이어, 학습부는 해당 네거티브 학습 데이터 셋을 이용하여 딥러닝 모델을 네거티브 학습(negative learning)시킬 수 있다. 네거티브 학습 데이터 셋을 이용하여 딥러닝 모델의 네 거티브 학습시, 딥러닝 모델의 파라미터는 마이너스(-1)기호가 부여됨에 따라 오탐지율을 감소시키도록 학습될 수 있다. 메모리는 본 발명의 일 실시예에 따른 딥러닝 모델 이벤트 검출 성능 향상 방법을 수행하기 위해 필요한 프로그램 코드를 저장하기 위한 수단이다. 프로세서는 본 발명의 일 실시예에 따른 딥러닝 모델 이벤트 검출 성능 향상 장치의 내부 구성 요소 들(예를 들어, 이벤트 검출부, 데이터 수집부, 라벨 생성부, 학습부, 메모리 등)을 제어하기 위한 수단이다. 도 5에는 사전 학습된 딥러닝 모델을 신규 환경에 적용하여 추가 학습하기 위한 프레임워크가 도시되어 있다. 도 5에 도시된 바와 같이, 이진 분류 모델을 이용하여 신규 환경에서 이벤트 검출 결과에 대해 자동으로 라벨링 이 가능하도록 분류함으로써 라벨링 과정에서 소요되는 많은 시간과 노력을 줄여 재학습 과정의 속도와 성능을 향상시킬 수 있다. 또한, 딥러닝 모델의 사전 학습시 사용하지 않았던 새로운 환경에서 이벤트 검출시, 예상되 는 많은 수의 오탐지를 감소시킬 수 있어 다양한 모니터링 환경에 쉽게 적용할 수 있는 이점이 있다. 본 발명의 실시 예에 따른 장치 및 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데 이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 컴퓨터 판독 가능 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 분야 통상의 기술자에게 공지되어 사 용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프 와 같은 자기매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행 될 수 있는 고급 언어 코드를 포함한다. 상기 프로그램이 실행되는 플랫폼은 데스크탑 서버 및 클라우드 서버 뿐만 아니라 다양한 임베디드 컴퓨팅 보드 도 포함한다. 상술한 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이제까지 본 발명에 대하여 그 실시 예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 지식 을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시 예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모 든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0143377", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 딥러닝 모델 이벤트 검출 성능 향상 방법을 나타낸 순서도. 도 2는 본 발명의 일 실시예에 따른 이벤트 검출된 프레임의 일 예를 도시한 도면. 도 3은 본 발명의 일 실시예에 따른 라벨링 과정을 설명하기 위해 도시한 도면. 도 4는 본 발명의 일 실시예에 따른 딥러닝 모델 이벤트 검출 성능 향상 장치의 내부 구성을 개략적으로 도시한 블록도. 도 5는 본 발명의 일 실시예에 따른 사전 학습된 딥러닝 모델을 신규 환경에 적용하여 추가 학습하기 위한 프레 임워크."}
