{"patent_id": "10-2018-0084311", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0013162", "출원번호": "10-2018-0084311", "발명의 명칭": "전자 장치 및 그의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "이종률"}}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치의 제어 방법에 있어서,복수의 인공 지능 모델을 제1 메모리에 저장하는 단계;상기 저장된 복수의 인공 지능 모델 중 제1 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호를 수신하면, 상기 제2 메모리의 사용 가능한 메모리 크기를 판단하는 단계;상기 제1 인공 지능 모델의 크기가 상기 제2 메모리의 사용 가능한 메모리 크기보다 큰 경우, 상기 제2 메모리의 사용 가능한 메모리 크기를 바탕으로 상기 제1 인공 지능 모델을 압축한 제1 압축 인공 지능 모델을 상기 제2 메모리에 로드하는 단계; 를 포함하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 로드하는 단계는,상기 제1 압축 인공 지능 모델의 성능이 기 설정된 조건을 만족하는지 판단하는 단계; 상기 제1 압축 인공 지능 모델의 성능이 상기 기 설정된 조건을 만족하면, 상기 제1 압축 인공 지능 모델을 상기 제2 메모리에 로드하고, 상기 제1 압축 인공 지능 모델이 상기 기 설정된 조건을 만족하지 못하면, 상기 제1인공 지능 모델을 다른 방법으로 압축한 제2 압축 인공 지능 모델을 상기 제2 메모리에 로드하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제1 압축 인공 지능 모델의 성능은, 상기 제1 압축 인공 지능 모델의 프로세서 점유율, 상기 제1 압축 인공 지능 모델의 크기 및 상기 제1 압축 인공 지능 모델의 정확도 중 적어도 하나인 것을 특징으로 하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 제어 방법은,상기 제1 인공 지능 모델을 복수의 방법으로 압축한 복수의 압축 인공지능 모델이 상기 기 설정된 조건을 만족하지 못하는 경우, 상기 기 설정된 조건을 만족하지 못함을 알리는 메시지를 표시하는 단계; 를 더 포함하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어 방법은,상기 제2 메모리의 사용 가능한 메모리 크기가 변경된 경우, 상기 변경된 메모리 크기를 바탕으로 상기 제1 인공 지능 모델을 압축한 제3 압축 인공지능 모델을 로드하는 단계; 를 더 포함하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,공개특허 10-2020-0013162-2-상기 제어 방법은,상기 제2 메모리에 제2 인공지능 모델이 로드하기 위한 제어 신호가 수신되면, 상기 제2 메모리의 사용 가능한메모리 크기를 바탕으로, 상기 제1 인공 지능 모델 및 상기 제2 인공지능 모델을 압축한 상기 제1 인공 지능 모델에 대한 압축 인공 지능 모델 및 상기 제2 인공 지능 모델에 대한 압축 인공 지능 모델을 로드하는 단계; 를더 포함하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제어 방법은,상기 제2 메모리에 복수의 인공 지능 모델이 로드되어 있는 경우, 상기 제2 메모리에 로드된 복수의 인공 지능모델의 사용 횟수를 판단하는 단계;를 포함하고,상기 로드하는 단계는,상기 판단된 사용 횟수를 바탕으로, 상기 복수의 인공 지능 모델 중 적어도 하나에 대한 압축 인공 지능 모델을로드하는 단계; 를 더 포함하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제어 방법은,상기 복수의 인공 지능 모델 중 적어도 하나의 성능을 입력 받기 위한 UI를 표시하는 단계; 를 포함하고,상기 제1 압축 인공 지능 모델은 상기 UI를 통해 입력된 성능을 바탕으로 압축된 인공 지능 모델인 것을 특징으로 하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 저장하는 단계는,상기 제1 인공 지능 모델에 대한 복수의 압축된 압축 인공 지능 모델을 상기 제1 메모리에 저장하는 단계; 를더 포함하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 제1 인공 지능 모델은 Pruning, Quantization, Decomposition 및 Knowledge Distillation 중 적어도 하나를 이용하여 압축되는 것을 특징으로 하는 제어 방법."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에 있어서,복수의 인공 지능 모델을 저장하는 제1 메모리;상기 제1 메모리에 저장된 상기 복수의 인공 지능 모델 중 적어도 하나의 인공 지능 모델을 로드하기 위한 제2메모리; 및상기 저장된 복수의 인공 지능 모델 중 제1 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호를 수신하면, 상기 제2 메모리의 사용 가능한 메모리 크기를 판단하고, 상기 제1 인공 지능 모델의 크기가 상기 제2 메모리의 사용 가능한 메모리 크기보다 큰 경우, 상기 제2 메모리의 사용 가능한 메모리 크기를 바탕으로 상기 제1인공 지능 모델을 압축한 제1 압축 인공 지능 모델을 상기 제2 메모리에 로드하도록 제어하는 프로세서; 를 포함하는 전자 장치.공개특허 10-2020-0013162-3-청구항 12 제11항에 있어서,상기 프로세서는,상기 제1 압축 인공 지능 모델의 성능이 기 설정된 조건을 만족하는지 판단하고, 상기 제1 압축 인공 지능 모델의 성능이 상기 기 설정된 조건을 만족하면, 상기 제1 압축 인공 지능 모델을 상기 제2 메모리에 로드하고, 상기 제1 압축 인공 지능 모델이 상기 기 설정된 조건을 만족하지 못하면, 상기 제1 인공 지능 모델을 다른 방법으로 압축한 제2 압축 인공 지능 모델을 상기 제2 메모리에 로드하도록 제어하는 것을 특징으로 하는 전자장치."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제1 압축 인공 지능 모델의 성능은, 상기 제1 압축 인공 지능 모델의 프로세서 점유율, 상기 제1 압축 인공 지능 모델의 크기 및 상기 제1 압축 인공 지능 모델의 정확도 중 적어도 하나인 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,디스플레이; 를 더 포함하고,상기 프로세서는,상기 제1 인공 지능 모델을 복수의 방법으로 압축한 복수의 압축 인공지능 모델이 상기 기 설정된 조건을 만족하지 못하는 경우, 상기 기 설정된 조건을 만족하지 못함을 알리는 메시지를 표시하도록 상기 디스플레이를 제어하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 프로세서는,상기 제2 메모리의 사용 가능한 메모리 크기가 변경된 경우, 상기 변경된 메모리 크기를 바탕으로 상기 제1 인공 지능 모델을 압축한 제3 압축 인공지능 모델을 로드하도록 제어하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 프로세서는,상기 제2 메모리에 제2 인공지능 모델이 로드하기 위한 제어 신호가 수신되면, 상기 제2 메모리의 사용 가능한메모리 크기를 바탕으로, 상기 제1 인공 지능 모델 및 상기 제2 인공지능 모델을 압축한 상기 제1 인공 지능 모델에 대한 압축 인공 지능 모델 및 상기 제2 인공 지능 모델에 대한 압축 인공 지능 모델을 로드하도록 제어하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 프로세서는,상기 제2 메모리에 복수의 인공 지능 모델이 로드되어 있는 경우, 상기 제2 메모리에 로드된 복수의 인공 지능모델의 사용 횟수를 판단하고, 상기 판단된 사용 횟수를 바탕으로, 상기 복수의 인공 지능 모델 중 적어도 하나에 대한 압축 인공 지능 모델을 로드하는 것을 특징으로 하는 전자 장치.공개특허 10-2020-0013162-4-청구항 18 제11항에 있어서,디스플레이; 를 포함하고,상기 프로세서는,상기 복수의 인공 지능 모델 중 적어도 하나의 성능을 입력 받기 위한 UI를 표시하도록 상기 디스플레이를 제어하고,상기 제1 압축 인공 지능 모델은 상기 UI를 통해 입력된 성능을 바탕으로 압축된 인공 지능 모델인 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 프로세서는,상기 제1 인공 지능 모델에 대한 복수의 압축된 압축 인공 지능 모델을 상기 제1 메모리에 저장하도록 상기 제1메모리를 제어하는 전자 장치."}
{"patent_id": "10-2018-0084311", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 제1 인공 지능 모델은 Pruning, Quantization, Decomposition 및 Knowledge Distillation 중 적어도 하나를 이용하여 압축되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2018-0084311", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치의 인공 지능 모델 압축 방법 및 압축된 인공 지능 모델을 로드하기 위한 방법이 개시된다. 본 개시에 따른 전자 장치의 제어 방법은, 복수의 인공 지능 모델을 제1 메모리에 저장하는 단계, 저장된 복수의 인공 지능 모델 중 제1 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호를 수신하면, 제2 메모리의 사용 가능한 메 모리 크기를 판단하는 단계, 제1 인공 지능 모델의 크기가 제2 메모리의 사용 가능한 메모리 크기보다 큰 경우, 제2 메모리의 사용 가능한 메모리 크기를 바탕으로 제1 인공 지능 모델을 압축한 제1 압축 인공 지능 모델을 제2 메모리에 로드하는 단계를 포함한다."}
{"patent_id": "10-2018-0084311", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그의 제어 방법에 관한 것으로, 보다 상세하게는 복수의 인공 지능 모델을 효율적으로 사용할 수 있는 전자 장치 및 그의 제어 방법에 관한 것이다. 또한, 본 개시는 기계학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 인공 지능 (Artificial Intelligence, AI) 시스템 및 그 응용에 관한 것이다."}
{"patent_id": "10-2018-0084311", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능(Artificial Intelligence, AI) 시스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템이며, 기존 규칙 기반 스마트 시스템과 달리 기계가 스스로 학습하고 판단하며 똑똑해지는 시스템이다. 인공 지능 시스템은 사용 할수록 인식률이 향상되고 사용자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 규칙 기반 스마트 시스템은 점차 딥러닝 기반 인공 지능 시스템으로 대체되고 있다. 인공 지능 기술은 기계학습(딥러닝) 및 기계 학습을 활용한 요소 기술들로 구성된다. 기계 학습은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘 기술이며, 요소 기술은 딥러닝 등의 기계 학습 알고리즘을 활용하는 기술로서, 언어적 이해, 시각적 이해, 추론/예측, 지식 표현, 동작 제어 등의 기술 분야로 구성된다. 인공 지능 기술이 응용되는 다양한 분야는 다음과 같다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리 하는 기술로서, 자연어 처리, 기계 번역, 대화 시스템, 질의 응답, 음성 인식/합성 등을 포함한다. 시각적 이해 는 사물을 인간의 시각처럼 인식하여 처리하는 기술로서, 객체 인식, 객체 추적, 영상 검색, 사람 인식, 장면 이해, 공간 이해, 영상 개선 등을 포함한다. 추론 예측은 정보를 판단하여 논리적으로 추론하고 예측하는 기술 로서, 지식/확률 기반 추론, 최적화 예측, 선호 기반 계획, 추천 등을 포함한다. 지식 표현은 인간의 경험 정보 를 지식데이터로 자동화 처리하는 기술로서, 지식 구축(데이터 생성/분류), 지식 관리(데이터 활용) 등을 포함 한다. 동작 제어는 차량의 자율 주행, 로봇의 움직임을 제어하는 기술로서, 움직임 제어(항법, 충돌, 주행), 조 작 제어(행동 제어) 등을 포함한다.한편, 근래에는 다양한 목적을 위한 다양한 인공 지능 모델이 하나의 장치 또는 어플리케이션에서 동작할 수 있 다. 그러나 종래의 인공 지능 기술은 많은 학습 시간 및 큰 저장 공간을 필요로 하며, 따라서 스마트폰과 같은 사용자 단말 장치에서 효율적으로 인공 지능 모델을 이용하기 부적합한 측면이 존재하였다."}
{"patent_id": "10-2018-0084311", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제점을 해결하기 위한 것으로, 한정된 메모리 공간상에서 복수의 인공 지능 모델을 효율적 으로 사용하기 위한 방법에 관한 것이다."}
{"patent_id": "10-2018-0084311", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 전자 장치의 제어 방법은, 복수의 인공 지능 모델을 제1 메모리에 저장하는 단계, 상기 저장된 복수의 인공 지능 모델 중 제1 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호를 수신하 면, 상기 제2 메모리의 사용 가능한 메모리 크기를 판단하는 단계, 상기 제1 인공 지능 모델의 크기가 상기 제2 메모리의 사용 가능한 메모리 크기보다 큰 경우, 상기 제2 메모리의 사용 가능한 메모리 크기를 바탕으로 상기 제1 인공 지능 모델을 압축한 제1 압축 인공 지능 모델을 상기 제2 메모리에 로드하는 단계를 포함한다. 이때, 상기 로드하는 단계는, 상기 제1 압축 인공 지능 모델의 성능이 기 설정된 조건을 만족하는지 판단하는 단계, 상기 제1 압축 인공 지능 모델의 성능이 상기 기 설정된 조건을 만족하면, 상기 제1 압축 인공 지능 모델 을 상기 제2 메모리에 로드하고, 상기 제1 압축 인공 지능 모델이 상기 기 설정된 조건을 만족하지 못하면, 상 기 제1 인공 지능 모델을 다른 방법으로 압축한 제2 압축 인공 지능 모델을 상기 제2 메모리에 로드하는 단계를 포함한다. 이때, 상기 제1 압축 인공 지능 모델의 성능은, 상기 제1 압축 인공 지능 모델의 프로세서 점유율, 상기 제1 압 축 인공 지능 모델의 크기 및 상기 제1 압축 인공 지능 모델의 정확도 중 적어도 하나일 수 있다. 이때, 상기 제어 방법은, 상기 제1 인공 지능 모델을 복수의 방법으로 압축한 복수의 압축 인공지능 모델이 상 기 기 설정된 조건을 만족하지 못하는 경우, 상기 기 설정된 조건을 만족하지 못함을 알리는 메시지를 표시하는 단계를 더 포함할 수 있다. 이때, 상기 제어 방법은, 상기 제2 메모리의 사용 가능한 메모리 크기가 변경된 경우, 상기 변경된 메모리 크기 를 바탕으로 상기 제1 인공 지능 모델을 압축한 제3 압축 인공지능 모델을 로드하는 단계를 더 포함할 수 있다. 이때, 상기 제어 방법은, 상기 제2 메모리에 제2 인공지능 모델이 로드하기 위한 제어 신호가 수신되면, 상기 제2 메모리의 사용 가능한 메모리 크기를 바탕으로, 상기 제1 인공 지능 모델 및 상기 제2 인공지능 모델을 압 축한 상기 제1 인공 지능 모델에 대한 압축 인공 지능 모델 및 상기 제2 인공 지능 모델에 대한 압축 인공 지능 모델을 로드하는 단계를 더 포함할 수 있다. 이때, 상기 제어 방법은, 상기 제2 메모리에 복수의 인공 지능 모델이 로드되어 있는 경우, 상기 제2 메모리에 로드된 복수의 인공 지능 모델의 사용 횟수를 판단하는 단계를 포함하고, 상기 로드하는 단계는, 상기 판단된 사용 횟수를 바탕으로, 상기 복수의 인공 지능 모델 중 적어도 하나에 대한 압축 인공 지능 모델을 로드하는 단 계를 더 포함할 수 있다. 이때, 상기 제어 방법은, 상기 복수의 인공 지능 모델 중 적어도 하나의 성능을 입력 받기 위한 UI를 표시하는 단계를 포함하고, 상기 제1 압축 인공 지능 모델은 상기 UI를 통해 입력된 성능을 바탕으로 압축된 인공 지능 모델일 수 있다. 이때, 상기 저장하는 단계는, 상기 제1 인공 지능 모델에 대한 복수의 압축된 압축 인공 지능 모델을 상기 제1 메모리에 저장하는 단계를 더 포함할 수 있다. 이때, 상기 제1 인공 지능 모델은 Pruning, Quantization, Decomposition 및 Knowledge Distillation 중 적어 도 하나를 이용하여 압축될 수 있다. 한편, 상술한 목적을 달성하기 위한 본 개시의 또 다른 실시예에 따른 전자장치는, 복수의 인공 지능 모델을 저 장하는 제1 메모리, 상기 제1 메모리에 저장된 상기 복수의 인공 지능 모델 중 적어도 하나의 인공 지능 모델을 로드하기 위한 제2 메모리 및 상기 저장된 복수의 인공 지능 모델 중 제1 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호를 수신하면, 상기 제2 메모리의 사용 가능한 메모리 크기를 판단하고, 상기 제1 인공 지능 모델의 크기가 상기 제2 메모리의 사용 가능한 메모리 크기보다 큰 경우, 상기 제2 메모리의 사용 가능한 메모 리 크기를 바탕으로 상기 제1 인공 지능 모델을 압축한 제1 압축 인공 지능 모델을 상기 제2 메모리에 로드하도 록 제어하는 프로세서를 포함한다. 이때, 상기 프로세서는, 상기 제1 압축 인공 지능 모델의 성능이 기 설정된 조건을 만족하는지 판단하고, 상기 제1 압축 인공 지능 모델의 성능이 상기 기 설정된 조건을 만족하면, 상기 제1 압축 인공 지능 모델을 상기 제2 메모리에 로드하고, 상기 제1 압축 인공 지능 모델이 상기 기 설정된 조건을 만족하지 못하면, 상기 제1 인공 지능 모델을 다른 방법으로 압축한 제2 압축 인공 지능 모델을 상기 제2 메모리에 로드하도록 제어할 수 있다. 이때, 상기 제1 압축 인공 지능 모델의 성능은, 상기 제1 압축 인공 지능 모델의 프로세서 점유율, 상기 제1 압 축 인공 지능 모델의 크기 및 상기 제1 압축 인공 지능 모델의 정확도 중 적어도 하나일 수 있다. 이때, 상기 전자 장치는 디스플레이를 더 포함하고, 상기 프로세서는, 상기 제1 인공 지능 모델을 복수의 방법 으로 압축한 복수의 압축 인공지능 모델이 상기 기 설정된 조건을 만족하지 못하는 경우, 상기 기 설정된 조건 을 만족하지 못함을 알리는 메시지를 표시하도록 상기 디스플레이를 제어할 수 있다. 이때, 상기 프로세서는, 상기 제2 메모리의 사용 가능한 메모리 크기가 변경된 경우, 상기 변경된 메모리 크기 를 바탕으로 상기 제1 인공 지능 모델을 압축한 제3 압축 인공지능 모델을 로드하도록 제어할 수 있다. 이때, 상기 프로세서는, 상기 제2 메모리에 제2 인공지능 모델이 로드하기 위한 제어 신호가 수신되면, 상기 제 2 메모리의 사용 가능한 메모리 크기를 바탕으로, 상기 제1 인공 지능 모델 및 상기 제2 인공지능 모델을 압축 한 상기 제1 인공 지능 모델에 대한 압축 인공 지능 모델 및 상기 제2 인공 지능 모델에 대한 압축 인공 지능 모델을 로드하도록 제어할 수 있다. 이때, 상기 프로세서는, 상기 제2 메모리에 복수의 인공 지능 모델이 로드되어 있는 경우, 상기 제2 메모리에 로드된 복수의 인공 지능 모델의 사용 횟수를 판단하고, 상기 판단된 사용 횟수를 바탕으로, 상기 복수의 인공 지능 모델 중 적어도 하나에 대한 압축 인공 지능 모델을 로드할 수 있다. 이때, 상기 전자 장치는 디스플레이를 포함하고, 상기 프로세서는, 상기 복수의 인공 지능 모델 중 적어도 하나 의 성능을 입력 받기 위한 UI를 표시하도록 상기 디스플레이를 제어하고, 상기 제1 압축 인공 지능 모델은 상기 UI를 통해 입력된 성능을 바탕으로 압축된 인공 지능 모델일 수 있다. 이때, 상기 프로세서는, 상기 제1 인공 지능 모델에 대한 복수의 압축된 압축 인공 지능 모델을 상기 제1 메모 리에 저장하도록 상기 제1 메모리를 제어할 수 있다. 이때, 상기 제1 인공 지능 모델은 Pruning, Quantization, Decomposition 및 Knowledge Distillation 중 적어 도 하나를 이용하여 압축될 수 있다."}
{"patent_id": "10-2018-0084311", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같이 본 개시의 다양한 실시예에 따라, 전자 장치는 복수의 인공 지능 모델의 성능을 고려하여 인공 지 능 모델을 압축할 수 있다."}
{"patent_id": "10-2018-0084311", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시의 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도 면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하 려는 것이 아니며, 발명된 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이 해되어야 한다. 실시 예들을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되 어서는 안 된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 본 개시에 따른 전자 장치가 복수개의 인공 지능 모델을 관리하는 방법을 설명하기 위한 예시도이다. 예를 들어, 도 1에 도시된 바와 같이, 전자 장치가 얼굴 인식 모델, 음성 인식 모델 및 영상 인식 모델을 사용하고 있는 경우를 가정할 수 있다. 이때, 전자 장치의 메모리 공간, GPU/CPU 점유율과 같은 리소스는 한정적이고, 인공 지능 모델의 크기는 크기 때문에, 복수의 인공 지능 모델을 그대로 사용하는 것이 어려울 수 있다. 따라서, 전자 장치는 인공 지능 모델의 크기를 줄이기 위해 인공 지능 모델을 압축할 수 있다. 그러 나 인공 지능 모델이 압축되는 경우, 인공 지능 모델의 성능이 저하될 수 있다. 즉, 인공 지능 모델의 압축 정 도와 인공 지능 모델의 성능은 트레이드 오프 관계인 경우가 일반적이다. 따라서, 전자 장치는 각각의 인 공 지능 모델 중, 특정 인공 지능 모델은 성능을 기준으로 압축하며, 또 다른 인공 지능 모델은 크기를 기준으 로 압축할 수 있다. 예를 들어, 전자 장치는 자주 사용되는 인공 지능 모델은 성능 중요하게 판단하여 압축을 하지 않거나 많은 압축을 수행하지 않을 수 있으며, 자주 사용되지 않는 인공 지능 모델은 성능이 저하되 더라도 많은 압축을 수행하여 크기를 줄일 수 있다. 따라서, 전자 장치는 메모리 상황 및 인공 지능 모델 의 사용성에 따라 인공 지능 모델을 어떻게 압축할지 여부를 결정하여야 한다. 도 2는 본 개시의 일 실시예에 따른 전자 장치의 구성을 간략히 도시한 블록도이다. 도 2에 도시된 바와 같이, 전자 장치는 제1 메모리, 제2 메모리 및 프로세서를 포함한다. 제1 메모리 또는 제2 메모리는 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 일 실시예에 따르면, 제1 메모리 또는 제2 메모리는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페 이스(API) 및/또는 어플리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어 또는 API의 적어도 일부는, 운영 시스템으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들에 구현된 동작 또 는 기능을 실행하는 데 사용되는 시스템 리소스들을 제어 또는 관리할 수 있으며, 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 제1 메모리는 복수의 인공 지능 모델을 저장하기 위한 구성이다. 저장된 복수의 인공 지능 모델 중 전자 장치가 사용하고자 하는 인공 지능 모델이 있는 경우, 제1 메모리는 제1 메모리에 저장된 인공 지능 모델을 제2 메모리로 전송할 수 있다. 이러한 제1 메모리는 보조 기억 장치 또는 2차 기억 장치로 구 성될 수 있다. 즉, 제1 메모리는 하드 디스크 드라이브(HDD), 솔리드 스테이트 드라이브(SSD), USB(Universal Serial Bus), 광학 디스크 등의 비휘발성 메모리로 구성될 수 있다. 제2 메모리는 제1 메 모리으로부터 인공 지능 모델을 수신하여 로드하기 위한 구성이다. 이러한 제2 메모리는 주기억 장치 또는 1차 기억 장치로 구성될 수 있다. 즉, 제1 메모리는 RAM 또는 ROM으로 구성될 수 있다. 일반적으로 제2 메모리는 제1 메모리보다 메모리 크기가 작으며, 인공 지능 모델의 메모리 크기는 크 기 때문에, 제2 메모리가 제1 메모리에 저장된 인공 지능 모델을 모두 저장하는 것이 불가능할 수 있 다. 따라서, 후술하는 바와 같이, 프로세서는 인공 지능 모델을 압축하여 제2 메모리에 로드할 수 있 다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨 어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서(13 0)는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 일 실시예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서를 더 포함할 수 있다. 프로세서는 제1 메모리로부터 수신된 명령 또는 데이터를 제2 메모리에 로드하여 처리하고, 결과 데이터를 제1 메모리에 저장할 수 있다. 한편, 프로세서는 인공 지능(AI; artificial intelligence)을 위한 전용 프로세서를 포함하거나, 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작될 수 있다. 이 때, 인공 지능을 위한 전용 프로세서는 확률 연산에 특화된 전용 프로세서로서, 기존의 범용 프로세서 보다 병렬처리 성능이 높아 기계 학습과 같은 인공 지능 분야의 연산 작업을 빠르게 처리할 수 있다. 구체적으로, 프로세서는 복수의 인공 지능 모델을 제1 메모리에 저장하도록 제어할 수 있다. 제1 메 모리에 복수의 인공 지능 모델이 저장된 상태에서, 복수의 인공 지능 모델 중 제1 인공 지능 모델을 로드 하기 위한 제어 신호가 수신되면, 프로세서는 제2 메모리의 사용 가능한 메모리 크기를 판단할 수 있 다. 이때, 제1 인공 지능 모델을 로드하기 위한 제어 신호는 제1 인공 지능 모델을 이용하기 위한 사용자 명령, 제1 인공 지능 모델을 이용하기 위한 기 설정된 상황이 발생한 경우 등 다양한 경우에 생성될 수 있다. 예를 들 어, 1 인공 지능 모델을 로드하기 위한 제어 신호는 제1 인공 지능 모델을 이용하는 어플리케이션을 실행하는 사용자 명령이 입력된 경우 생성될 수 있다. 또는, 1 인공 지능 모델을 로드하기 위한 제어 신호는 특정 상황 (음성 입력, 메시지 수신, 다른 사용자로부터 전화 수신, 영상 입력, 특정 시간 등)에 제1 인공 지능 모델이 이 용될 필요가 있는 경우 생성될 수 있다. 프로세서는 제1 인공 지능 모델의 크기가 제2 메모리의 사용 가능한 메모리 크기보다 큰 경우, 제2 메모리의 사용 가능한 메모리 크기를 바탕으로 제1 인공 지능 모델을 압축한 제1 압축 인공 지능 모델을 제2 메모리에 로드할 수 있다. 이때, 제1 압축 인공 지능 모델은 프로세서에 의해 압축 될 수 있으나 이에 한정되는 것은 아니다. 예를 들어, 제1 압축 인공 지능 모델은 제1 메모리에 기 저장된 압축 인공 지능 모델 중 하나일 수 있다. 한편, 프로세서는 제1 압축 인공 지능 모델의 성능이 기 설정된 조건을 만족하는지 판단할 수 있다. 이때, 제1 압축 인공 지능 모델의 성능이란, 제1 압축 인공 지능 모델의 프로세서 점유율(CPU/GPU 점유율), 제1 압축 인공 지능 모델의 크기 및 제1 압축 인공 지능 모델의 정확도 중 적어도 하나일 수 있다. 또한, 기 설정된 조건 은 제1 압축 인공 지능 모델의 성능을 바탕으로 생성된 조건일 수 있다. 한편, 인공 지능 모델의 성능은 상술한 실시예에 한정되는 것은 아니며 인공 지능 모델의 종류에 따라 다양한 지표의 성능이 존재할 수 있다. 예를 들 어, 인공 지능 모델이 문장 번역을 위한 인공 지능 모델인 경우, 인공 지능 모델의 성능은 상술한 성능 이외에 BLEU(Bilingual Evaluation Understudy) Score를 통해 계산된 성능일 수 있음은 물론이다. 한편, 제1 압축 인공 지능 모델에 대한 기 설정된 조건은 프로세서 점유율은 20%이하인 조건, 제1 압축 인 공 지능 모델의 크기는 128 Mega Byte(이하 MB) 이하인 조건, 정확도는 80% 이상인 조건 중 적어도 하나에 대한 조건일 수 있다. 한편, 인공 지능 모델에 대한 프로세서 점유율이란, 프로세서의 전체 계산량 대비 해당 인공 지능 모 델을 계산하기 위한 계산량의 비율을 의미할 수 있다. 즉, 프로세서 점유율은 인공 지능 모델에 대한 상대 적인 비율을 의미한다. 본 개시에서는, 상술한 상대적인 점유율을 기초로 설명하나, 이에 한정되는 것은 아니다. 즉, 전자 장치는 프로세서 점유율 대신 인공 지능 모델을 계산하는데 필요한 절대적인 계산 량을 바탕으로 기 설정된 조건을 판단할 수 있음은 물론이다. 제1 압축 인공 지능 모델의 성능이 기 설정된 조건을 만족하면, 프로세서는 제1 압축 인공 지능 모델을 제 2 메모리에 로드할 수 있다. 제1 압축 인공 지능 모델의 성능이 기 설정된 조건을 만족하지 않으면, 프로 세서는 제1 인공 지능 모델을 다른 방법으로 압축한 제2 압축 인공 지능 모델을 제2 메모리에 로드할 수 있다. 구체적으로, 프로세서는 제1 압축 인공 지능 모델과 다른 방법으로 압축된, 기 설정된 조건을 만 족하는 제2 압축 인공 지능 모델을 제2 메모리에 로드할 수 있다. 이때, 제2 압축 인공 지능 모델이 기 설정된 조건을 만족하지 못하는 경우, 프로세서는 또 다른 방법으로 제1 인공 지능 모델이 압축된 압축 인공 지능 모델이 기 설정된 조건을 만족하는지 판단할 수 있다. 기 설정된 조건을 만족하는 압축 인공 지능 모델이 존재하면, 프로세서는 기 설정된 조건을 만족하는 압축 인공 지능 모델을 제2 메모리에 로드할 수 있다. 다만, 1 인공 지능 모델을 복수의 방법으로 압축한 복수의 압축 인공지능 모델이 기 설정된 조건을 만족하지 못 하는 경우, 프로세서는 기 설정된 조건을 만족하지 못함을 알리는 메시지를 출력할 수 있다. 예를 들어, 기 설정된 횟수(예를 들어 10번)만큼 제1 인공 지능 모델을 압축하였으나, 기 설정된 조건을 만족하는 압축 인 공 지능 모델이 존재하지 않는 경우, 프로세서는 기 설정된 조건을 만족하는 압축 인공 지능 모델이 존재 하지 않음을 알리는 메시지를 출력할 수 있다. 이 경우, 프로세서는 제1 인공 지능 모델에 대한 압축 인공 지능 모델을 제2 메모리에 로드하지 않을 수 있다. 또는, 프로세서는 제1 인공 지능 모델에 대해 생 성된 복수의 압축 인공 지능 모델 중 기 설정된 조건과 가장 유사한 압축 인공 지능 모델을 제2 메모리에 로드하고, 기 설정된 조건을 만족하는 압축 인공 지능 모델이 존재하지 않음을 알리는 메시지를 출력할 수 있다. 한편, 제2 메모리의 사용 가능한 메모리 크기가 변경된 경우, 프로세서는 변경된 메모리 크기를 바탕 으로 제1 인공 지능 모델을 압축한 제3 인공 지능 모델을 제2 메모리에 로드할 수 있다. 예를 들어, 제2 메모리의 사용 가능한 메모리 크기가 증가한 경우, 프로세서는 제1 인공 지능 모델의 정확도를 증가 시키기 위하여 증가된 메모리 크기를 바탕으로 생성된 제3 압축 인공 지능 모델을 제2 메모리에 로드할 수 있다. 이때, 제3 압축 인공 지능 모델은 제1 압축 인공 지능 모델 또는 제2 압축 인공 지능 모델보다 성능이 우 수할 것이다. 한편, 제2 메모리에 제2 인공 지능 모델을 로드하기 위한 제어 신호가 수신되면, 프로세서는 제2 메 모리의 사용 가능한 메모리 크기를 바탕으로 제1 인공 지능 모델 및 제2 인공지능 모델을 압축한 제1 인공 지능 모델에 대한 압축 인공 지능 모델 및 제2 인공 지능 모델에 대한 압축 인공 지능 모델을 로드할 수 있다. 일 실시예로, 제1 압축 인공 지능 모델(또는 제2 압축 인공 지능 모델)이 제2메모리에 로드된 상태에서 제 2 인공 지능 모델을 로드하기 위한 제어 신호가 수신되면, 프로세서는 제2 메모리의 사용 가능한 메 모리 크기를 바탕으로 제2 인공 지능 모델의 압축 인공 지능 모델을 제2 메모리에 로드할 수 있다. 또 다른 실시예로, 제1 압축 인공 지능 모델(또는 제2 압축 인공 지능 모델)이 제2 메모리에 로드된 상태 에서 제2 메모리의 사용 가능한 메모리 크기가 제2 인공 지능 모델을 압축하여 로드하기에 부족한 경우가 존재할 수 있다. 이 경우, 프로세서는 제2 인공 지능 모델을 로드하기 위하여 제1 인공 지능 모델 및 제2 인공지능 모델을 압축한 제1 인공 지능 모델에 대한 압축 인공 지능 모델 및 제2 인공 지능 모델에 대한 압축 인공 지능 모델을 로드할 수 있다. 즉, 프로세서는, 제2 메모리에 기 로드되어 있던 압축된 제1 인공 지능 모델 (제1 압축 인공 지능 모델 또는 제2 압축 인공 지능 모델)이 아닌 다른 압축 인공 지능 모델을 제2 메모리에 로드할 수 있다. 한편, 프로세서는 제2 메모리에 복수의 인공 지능 모델이 로드되어 있는 경우, 제2 메모리에 로 드된 복수의 인공 지능 모델의 사용 횟수를 판단하고, 판단된 사용 횟수를 바탕으로 복수의 인공 지능 모델 중 적어도 하나에 대한 압축 인공 지능 모델을 로드할 수 있다. 즉, 프로세서는 제2 메모리에 로드된 복 수의 인공 지능 모델 중, 사용 횟수가 기 설정된 횟수 이하인 인공 지능 모델의 압축률을 크게 하고, 사용 횟수 가 기 설정된 횟수 이상인 인공 지능 모델의 압축률은 작게 할 수 있다. 한편, 제2 메모리에 제1 압축 인공 지능 모델이 로드된 경우, 프로세서는 로드된 제1 압축 인공 지능 모델을 제1 메모리에 저장할 수 있다. 즉, 프로세서는 로드된 압축 인공 지능 모델을 제1 메모리에 저장함으로써, 나중에 압축 인공 지능 모델을 생성하거나 외부에서 수신하는 대신 제1 메모리로부터 수신 하여 사용할 수 있다. 한편, 후술하는 바와 같이 전자 장치가 디스플레이를 포함하는 경우, 프로세서는 제1 메모리 에 저장된 복수의 인공 지능 모델 중 적어도 하나의 인공 지능 모델의 성능을 입력 받기 위한 UI를 표시하 도록 디스플레이를 제어할 수 있다. 이때, 제1 압축 인공 지능 모델은 제1 인공 지능 모델의 성능을 입력 받기 위한 UI를 통해 입력된 조건을 바탕으로 압축된 인공 지능 모델일 수 있다. 한편, 제1 인공 지능 모델은 Pruning, Quantization, Decomposition 및 Knowledge Distillation 중 적어도 하 나를 이용하여 압축될 수 있다. Pruning은 인공 지능 모델의 가중치 파라미터 중 의미 없는 가중치 파라미터 또 는 출력값에 큰 영향을 주지 않는 가중치 파라미터를 삭제하는 압축 기법 중 하나이다. Quantization은 각각의 가중치 파라미터를 기 설정된 비트로 양자화 하는 압축 기법 중 하나이다. Decomposition은 가중치 파라미터의 집합인 가중치 행렬 또는 텐서(tensor)를 선형 분해(approximated decomposition)하여 가중치 파라미터의 크기 를 줄이는 압축 기법 중 하나이다. Knowledge Distillation은 원본 모델을 Teacher 모델로 하여 원본 모델보다 작은 Student 모델을 생성하고 학습시키는 압축 기법 중 하나이다. 이때, Student 모델은 상술한 Pruning, Decomposition 또는 Quantization을 통해 생성될 수 있다. 도 3은 본 개시의 일 실시예에 따른 전자 장치의 구성을 상세히 도시한 블록도이다. 도 3에 도시된 바와 같이, 전자 장치는 제1 메모리, 제2 메모리, 프로세서 외에도 통신부 , 디스플레이, 입력부, 오디오 처리부 및 오디오 출력부를 더 포함할 수 있다. 그러 나 상술한 구성에 한정되는 것은 아니고 필요에 따라 일부 구성이 추가되거나 생략될 수 있음은 물론이다. 제1 메모리 및 제2 메모리는 상술한 바와 같이 인공 지능 모델을 저장 또는 로드하기 위한 구성이다. 제1 메모리는 보조 기억 장치 또는 2차 기억 장치로 구성될 수 있고, 제2 메모리는 주기억 장치 또는 1차 기억 장치로 구성될 수 있다. 특히 제2 메모리는 후술하는 프로세서 내부의 RAM 또는 ROM로 구성될 수도 있다. 통신부는 외부 장치와 통신을 수행하기 위한 구성이다. 일 실시예로, 전자 장치는 통신부를 통 해 외부 서버로부터 복수의 인공 지능 모델을 수신하여 제1 메모리에 저장할 수 있다. 나아가, 전자 장치 는 통신부를 통해 복수의 인공 지능 모델 각각에 대한 복수의 압축 인공 지능 모델을 수신할 수도 있 음은 물론이다. 한편, 통신부가 외부 장치와 통신 연결되는 것은 제3 기기(예로, 중계기, 허브, 엑세스 포인트, 서버 또는 게이트웨이 등)를 거쳐서 통신하는 것을 포함할 수 있다. 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하 나를 사용하는 셀룰러 통신을 포함할 수 있다. 일 실시예에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 무선 통신 또는 유선 통신이 수행되는 네트워크는 텔레커뮤니케 이션 네트워크, 예를 들면, 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나 를 포함할 수 있다. 디스플레이는 다양한 영상을 출력하기 위한 구성이다. 구체적으로, 제1 인공 지능 모델을 복수의 방법으로 압축한 복수의 압축 인공 지능 모델이 기 설정된 조건을 만족하지 못하는 경우, 디스플레이는 기 설정된 조건을 만족하지 못함을 알리는 메시지를 표시할 수 있다. 또한, 디스플레이는 제1 메모리에 저장된 복수의 인공 지능 모델 중 적어도 하나의 인공 지능 모델의 성능을 입력 받기 위한 UI를 표시할 수 있다. 다양한 영상을 제공하기 위한 디스플레이는 다양한 형태의 디스플레이 패널로 구현될 수 있다. 예를 들어, 디스플레이 패널은 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes), AM-OLED(Active- Matrix Organic Light-Emitting Diode), LcoS(Liquid Crystal on Silicon) 또는 DLP(Digital Light Processing) 등과 같은 다양한 디스플레이 기술로 구현될 수 있다. 또한, 디스플레이는 플렉서블 디스플레 이(flexible display)의 형태로 전자 장치의 전면 영역 및, 측면 영역 및 후면 영역 중 적어도 하나에 결 합될 수도 있다. 입력부는 사용자 명령을 입력받기 위한 구성이다. 이때, 입력부는 카메라, 마이크 및 터치 패널을 포함할 수 있다. 카메라는 전자 장치 주변의 영상 데이터를 획득하기 위한 구성이다. 카메라는 정지 영상 및 동 영상을 촬영할 수 있다. 예로, 카메라는 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, 이미지 시그널 프로세서(ISP), 또는 플래시(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 마이크는 전 자 장치 주변의 소리를 획득하기 위한 구성이다. 마이크는 외부의 음향 신호를 입력 받아 전기적인 음성 정보를 생성할 수 있다. 마이크는 외부의 음향 신호를 입력 받는 과정에서 발생되는 잡음(noise)를 제거하기 위한 다양한 잡음 제거 알고리즘을 이용할 수 있다. 카메라 또는 마이크를 통해 입력된 이 미지 정보 또는 음성 정보는 인공 지능 모델의 입력값으로 입력될 수 있다. 터치 패널은 다양한 사용자 입력을 입력 받을 수 있는 구성이다. 터치 패널는 사용자 조작에 의한 데 이터를 입력 받을 수 있다. 터치 패널은 후술하는 디스플레이와 결합하여 구성될 수도 있다. 입력부는 상술한 카메라, 마이크, 터치 패널 외에도 다양한 데이터를 입력 받기 위한 다양 한 구성일 수 있음은 물론이다. 오디오 처리부는 오디오 데이터에 대한 처리를 수행하는 구성 요소다. 오디오 처리부에서는 오디오 데이터에 대한 디코딩이나 증폭, 노이즈 필터링 등과 같은 다양한 처리가 수행될 수 있다. 오디오 처리부 에서 처리된 오디오 데이터는 오디오 출력부로 출력될 수 있다. 오디오 출력부는 오디오 처리부에 의해 디코딩이나 증폭, 노이즈 필터링과 같은 다양한 처리 작업이 수행된 각종 오디오 데이터뿐만 아니라 각종 알림 음이나 음성 메시지를 출력하는 구성이다. 특히, 오디오 출력 부는 스피커로 구현될 수 있으나, 이는 일 실시 예에 불과할 뿐, 오디오 데이터를 출력할 수 있는 출력 단 자로 구현될 수 있다. 프로세서는 상술한 바와 같이, 전자 장치의 전반적인 동작을 제어한다. 프로세서는 RAM, ROM, 메인 CPU, 그래픽 처리부, 제1 내지 n 인터페이스(135-1 내지 135-n), 버스를 포함 할 수 있다. 이때, RAM, ROM, 메인 CPU, 그래픽 처리부 및 제1 내지 n 인터페이스(135-1 내지 135-n) 등은 버스를 통해 서로 연결될 수 있다. ROM에는 시스템 부팅을 위한 명령어 세트 등이 저장된다. 턴 온 명령이 입력되어 전원이 공급되면, 메인 CPU는 ROM에 저장된 명령어에 따라 메모리에 저장된 O/S를 RAM에 복사하고, O/S를 실행시켜 시 스템을 부팅시킨다. 부팅이 완료되면, 메인 CPU는 메모리에 저장된 각종 어플리케이션 프로그램을 RAM에 복사하고, RAM에 복사된 어플리케이션 프로그램을 실행시켜 각종 동작을 수행한다. 구체적으로, 메인 CPU는 제1 메모리 또는 제2 메모리에 액세스하여, 제1 메모리 또는 제2 메모리에 저장된 O/S를 이용하여 부팅을 수행한다. 그리고 메인 CPU는 제1 메모리 또는 제2 메모리에 저장된 각종 프로그램, 컨텐츠, 데이터 등을 이용하여 다양한 동작을 수행한다. 제1 내지 n 인터페이스(135-1 내지 135-n) 는 상술한 각종 구성 요소들과 연결된다. 인터페이스들 중 하나는 네 트워크를 통해 외부 장치와 연결되는 네트워크 인터페이스가 될 수도 있다. 이하에서는 도 4a 내지 도 10을 이용하여 본 개시에 따른 다양한 실시예들에 대하여 설명한다. 도 4a 내지 도 4d는 본 개시의 일 실시예에 따른 인공 지능 모델을 로드하는 방법을 설명하기 위한 예시도이다. 도 4a에 도시된 바와 같이, 제2 메모리의 사용 가능한 메모리 크기는 30MB인 경우를 가정할 수 있다. 이때, 영상 인식 모델을 로드하기 위한 제어 신호가 수신되면, 전자 장치는 제2 메모리의 사용 가능한 메모리 크기를 판단할 수 있다. 영상 인식 모델의 크기는 50MB이고, 제2 메모리의 사용 가능 한 메모리 크기는 30MB이므로, 전자 장치는 영상 인식 모델을 압축하여 제2 메모리에 로드할 수 있다. 즉, 도 4a의 우측에 도시된 바와 같이, 압축된 영상 인식 모델의 크기는 30MB일 수 있다. 이러한 경 우, 압축된 영상 인식 모델은 정확도가 다소 낮아지지만, 제2 메모리의 사용 가능한 메모리 크기에 따라, 영상 인식 모델을 로드할 수 있다. 전자 장치는 도 4b에 도시된 바와 같이, 메모리 크기가 부족하여 영상 인식 성능이 하락하였음을 알리는 메시지를 출력할 수 있다. 한편, 전자 장치는 제2 메모리의 사용 가능한 메모리 크기가 변경된 경우, 영상 인식 모델을 재압축 할 수 있다. 구체적으로 도 4c에 도시된 바와 같이, 제2 메모리에 얼굴 인식 모델, 음성 인식 모델 및 압 축된 영상 인식 모델이 로드되어 있다가 얼굴 인식 모델이 삭제되면, 제2 메모리의 사용 가능한 메모 리는 100MB로 증가한다. 따라서, 전자 장치는 성능이 하락한 압축된 영상 인식 모델 대신 새롭게 압 축된 영상 인식 모델을 제2 메모리에 로드할 수 있다. 도 4c에서 압축 영상 인식 모델은 도 4a 의 영상 인식 모델과 성능이 동일하게 도시되어 있으나, 이에 한정되는 것은 아니다. 즉, 예를 들어, 전자 장치는 필요에 따라, 프로세서 점유율 7%, 모델 크기 100MB, 정확도 85%의 성능을 가지는 영상 인식 모델을 제2 메모리에 로드할 수 있음은 물론이다. 이때, 필요에 따른 압축은 후술하는 바와 같이 인공 지 능 모델의 성능에 대한 기 설정된 조건과 관련 있을 수 있다. 한편, 도 4c와 같은 경우, 전자 장치는 도 4d에 도시된 바와 같이, 영상 인식 성능이 다시 향상 되었음은 알리는 메시지를 출력할 수 있다. 도 5a 내지 도 5d는 본 개시의 일 실시예에 따른 복수의 인공 지능 모델의 성능에 대한 조건을 설정하는 방법을 설명하기 위한 예시도이다. 도 5a의 좌측에 도시된 바와 같이, 전자 장치는 제1 메모리에 저장된 복수의 인공 지능 모델의 성능 및 성능 조건을 변경하기 위한 UI 화면을 표시할 수 있다. 구체적으로, 얼굴 인식 모델은 프로세서 점유율 32.3%, 모델 크기 100MB, 정확도 87%의 성능을 가지고, 얼굴 인식 모델은 프로세서 점유율 10.3%, 모델 크 기 80MB, 정확도 83%의 성능을 가지고, 얼굴 인식 모델은 프로세서 점유율 5.3%, 모델 크기 50MB, 정확도 72%의 성능을 가질 수 있다. 이때, 얼굴 인식 모델의 성능 조건을 변경하기 위한 변경 엘리먼트을 통한 사용자 명령이 입력되면, 전자 장치는 도 5a의 우측에 도시된 바와 같이 얼굴 인식 모델의 성능 조건을 변경하기 위한 UI 화면을 표시할 수 있다. 이때, 성능 조건을 변경하기 위한 UI 화면은 성능 조절을 위한 UI 바, 최근 얼굴 인식에 대한 정확도, 얼굴 인식 모델의 크기 및 계산량에 대한 정보를 포함할 수 있다. 구체적으로 UI 바를 오른쪽으로 이동시키면 얼굴 인식 모델의 성능이 향상되고, UI바를 왼쪽으로 이동시키면 얼굴 인식 모델의 성능이 하락할 수 있다. 이 때, UI바의 위치에 대응되는 인공 지능 모델의 성능은 기 설정된 성능 조건일 수 있다. 즉, 각각의 UI바의 위치 에 따라 인공 지능 모델의 프로세서 점유율, 인공 지능 모델의 크기 및 정확도가 기 저장되어 있을 수 있 다. 따라서, 사용자는 UI바를 조절하는 것만으로 간편하게 인공 지능 모델의 성능을 조절할 수 있다. 한편, 도 5b에 도시된 바와 같이, 성능 조건을 변경하기 위한 UI 화면은 최근 얼굴 인식에 대한 결과를 더 표시 할 수 있다. 즉, 도 5b에 도시된 바와 같이, 전자 장치는 특정 이미지에 대한 얼굴 인식 결과를 표시하여, 사용자가 얼굴 인식 모델의 성능을 조절하는데 참고하도록 가이드 할 수 있다.한편, 전자 장치는 얼굴 인식 모델의 성능을 조절하는 UI바 대신 현재 제2 메모리 상황에 따른 압축 인공 지능 모델을 추천하는 화면을 표시할 수 있다. 구체적으로, 도 5c의 좌측에 도시된 바와 같이, 전자 장치 는 제2 메모리의 사용 가능한 메모리 크기를 바탕으로 압축된 인공 지능 모델을 추천하는 UI 화면을 표시할 수 있다. 추천된 복수의 인공 지능 모델 중 하나를 선택하기 위한 UI 엘리먼트가 선택되면, 전자 장치는 도 5d의 우측과 같은 UI 화면이 표시할 수 있다. 한편, 도 5a 내지 도 5c는 전자 장치가 제2 메모리의 상황을 바탕으로 압축된 인공 지능 모델을 추천 하거나, UI 바의 위치에 따라 인공 지능 모델의 프로세서 점유율, 인공 지능 모델의 크기 및 정확도가 저 장되어 인공 지능 모델의 성능 조건을 결정하기 때문에, 세밀한 성능 조정이 불가능할 수 있다. 따라서, 전자 장치는 각각의 성능 조건(인공 지능 모델의 프로세서 점유율, 인공 지능 모델의 크기 및 정확도 등)을 조절할 수 있는 UI 화면을 표시할 수 있다. 구체적으로, 도 5d의 좌측에 도시된 바와 같이, 제2 메모리에 로드된 복수의 인공 지능 모델 중 얼굴 인식 모델의 성능을 조절하기 위한 UI 엘리먼트을 선택하는 사용자 명령이 입력되면, 전자 장치는 도 5d의 우측에 도시된 바와 같이, 각각의 성능 조건을 조절할 수 있는 UI를 표시할 수 있다. 구체적으로 인공 지능 모 델의 성능 조건은 압축된 인공 지능 모델의 최대 프로세서 점유율, 압축된 인공 지능 모델의 최대 크기, 압축된 인공 지능 모델의 최소 정확도 조건일 수 있다. 압축된 인공 지능 모델의 최대 프로세서 점유율을 조절하기 위한 UI 바, 압축된 인공 지능 모델의 최대 크기를 조절하기 위한 UI 바, 압축된 인공 지능 모델의 최소 정확도를 조절하기 위한 UI 바를 통해 사용자 명령이 입력되면, 전자 장치는 입력된 조 건에 따라 인공 지능 모델을 압축할 수 있다. 예를 들어, 압축된 인공 지능 모델의 최대 프로세서 점유율이 35%, 압축된 인공 지능 모델의 최대 크기가 100MB, 압축된 인공 지능 모델의 최소 정확도가 80%로 설정된 경우, 전자 장치가 압축하는 인공 지능 모델은 GPU점유율이 35% 이하이고, 모델의 크기는 100MB 이하이고, 정확도는 80%이상인 모델이 될 것이다. 입력된 조건을 만족하는 압축된 인공 지능 모델이 존재하면, 전자 장치는 설정된 조건에 따라 인공 지능 모델 압축되었음을 알리는 메시지를 표시할 수 있다. 입력된 조건을 만족하는 압축된 인공 지능 모델이 존재하 지 않으면, 전자 장치는 인공 지능 모델 압축이 실패하였음을 알리는 메시지를 표시할 수 있다. 예를 들어, 도 5d에 도시된 바와 같이, 입력된 조건을 만족하는 압축된 인공 지능 모델이 존재하면, \"얼굴 인식 모 델의 성능이 조정되었습니다\"와 같은 메시지를 출력하고, 입력된 조건을 만족하는 압축된 인공 지능 모델이 존 재하지 않으면, \"얼굴 인식 모델 성능 조정에 실패하였습니다. 요구 사항을 조정해 주세요\"와 같은 메시지를 출 력할 수 있다. 한편, 도 5a 내지 도 5d에서는 전자 장치가 제2 메모리에 로드된 인공 지능 모델의 성능을 조절하는 방법에 대하여 설명하였으나 이에 한정되는 것은 아니다. 즉, 전자 장치는 제1 메모리에 저장된 각각 의 인공 지능 모델에 대하여 성능을 조절할 수 있음은 물론이다. 도 6은 본 개시의 일 실시예에 따른 인공 지능 모델 압축 과정을 설명하기 위한 예시도이다. 도 5a 내지 도 5d에 따라, 전자 장치는 복수의 인공 지능 모델에 대한 성능을 조정할 수 있다(S610). 예 를 들어, 전자 장치는 각각의 인공 지능 모델에 대한 압축된 인공 지능 모델의 최대 프로세서 점유율, 압축된 인공 지능 모델의 최대 크기, 압축된 인공 지능 모델의 최소 정확도에 대한 조건을 설정할 수 있다. 복수의 인공 지능 모델 중 적어도 하나의 인공 지능 모델을 압축하기 위한 제어 신호를 수신하면, 전자 장치 는 적어도 하나의 인공 지능 모델을 압축할 수 있다(S620). 상술한 바와 같이 인공 지능 모델은 Pruning, Quantization, Decomposition 및 Knowledge Distillation 중 적어도 하나를 이용하여 압축될 수 있다. 또한, 인공 지능 모델의 압축은 전자 장치에서 수행될 수도 있으나, 외부 서버에서 수행되어 압축된 인공 지능 모델을 전자 장치가 수신하는 형태가 될 수도 있음은 물론이다. 전자 장치는 압축된 인공 지능 모델이 기 설정된 조건을 만족하는지 여부를 판단할 수 있다(S630). 압축된 인공 지능 모델이 기 설정된 조건을 만족하면(S630-Y), 전자 장치는 압축된 인공 지능 모델을 제2 메모리 에 로드할 수 있다. 압축된 인공 지능 모델이 기 설정된 조건을 만족하지 않으면(S630-N), 전자 장치는 인 공 지능 모델이 기 설정된 횟수 이상 압축이 수행되었는지 여부를 판단할 수 있다(S650). 인공 지능 모델이 기 설정된 횟수 이상 압축되지 않은 경우(S650-N), 전자 장치는 S620으로 돌아가 인공 지능 모델을 다시 압축할 수 있다. 구체적으로, 전자 장치는 이전의 압축 방법과 다른 방법으로 인공 지능 모델을 압축할 수 있다. 인공 지능 모델이 기 설정된 횟수 이상 압축된 경우(S650-Y), 전자 장치는 인공 지능 모델 압축이 실패하였음을 출력할 수 있다(S660). 즉, 기 설정된 횟수 이상 압축하여도 기 설정된 조건을 만족하지 못하는 경우, 전자 장 치는 기 설정된 조건을 만족하도록 압축하는 것이 불가능하다고 판단하고, 인공 지능 모델 압축이 실패하 였음을 출력할 수 있다. 나아가, 전자 장치는 기 설정된 조건을 변경할 것을 요청하는 메시지를 추가로 출 력할 수 있음은 물론이다. 도 7은 본 개시의 일 실시예에 따른 또 다른 압축 방법을 설명하기 위한 흐름도이다. 구체적으로, 도 7에 의한 실시예는 제2 메모리에 적어도 하나의 인공 지능 모델이 로드된 상태에서 다른 인공 지능 모델(예를 들어 제1 인공 지능 모델)을 로드하는 경우를 가정한다. 먼저, 전자 장치는 제1 인공 지능 모델을 로드하기 위한 명령이 입력 받을 수 있다(S710). 전자 장치(10 0)는 리소스가 사용 가능한지 판단할 수 있다(S720). 이때 리소스가 사용 가능한지의 판단이란, 제1 인공 지능 모델이 제2 메모리의 사용 가능한 메모리 크기, 사용 가능한 프로세서 점유율(CPU 또는 GPU 점유율) 등의 성능 조건을 만족하는지 여부에 대한 판단일 수 있다. 리소스가 사용 가능하다고 판단된 경우(S720-Y), 전자 장치는 제1 인공 지능 모델을 제2 메모리에 로 드할 수 있다(S780). 반면, 리소스가 사용 가능하지 않다고 판단된 경우(S720-N), 전자 장치는 제1 인공 지능 모델을 압축할 수 있다(S730). 전자 장치는 압축된 제1 인공 지능 모델에 대하여 리소스가 사용 가능 한지 여부를 판단할 수 있다(S740). 리소스가 사용 가능하다고 판단된 경우(S740-Y), 전자 장치는 압축된 제1 인공 지능 모델을 제2 메모리 에 로드할 수 있다(S780). 반면, 리소스가 사용 가능하지 않다고 판단된 경우(S740-N), 전자 장치는 제2 메모리에 로드된 다른 인공 지능 모델을 압축할 수 있다. 즉, 도 6의 실시예에서는 리소스가 사용 가 능하지 않은 경우, 전자 장치는 제1 인공 지능 모델을 다른 방법으로 압축한다. 그러나 도 7에 의한 실시 예에서는, 전자 장치는 제1 인공 지능 모델을 다른 방법으로 압축하는 대신, 제1 인공 지능 모델 외에 제2 메모리에 로드된 다른 인공 지능 모델을 압축하여 제2 메모리에 로드할 수 있다. 다른 인공 지능 모델이 압축되면, 전자 장치는 리소스가 사용 가능한지 여부를 판단할 수 있다(S760). 구 체적으로, 전자 장치는 압축된 다른 인공 지능 모델로 인해 증가한 리소스가 S730에서 압축된 제1 인공 지 능 모델을 로드하기에 적절한지 여부를 판단할 수 있다. 리소스가 사용 가능하다고 판단된 경우(S760-Y), 전자 장치는 S730에서 압축된 제1 인공 지능 모델을 제2 메모리에 로드할 수 있다. 반면 리소스가 사용 가능하지 않다고 판단된 경우, 전자 장치는 인공 지능 모델 압축이 실패하였음을 출력할 수 있다(S770) 한편, 도 6 및 도 7에서 설명한 실시예는 독립적으로 동작할 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 도 7의 S740에서의 리소스 판단은 도 6의 S650의 과정을 수행한 이후에 이루어 질 수 있다. 구체적으로, S730에 따라 압축된 제1 인공 지능 모델에 대하여 리소스가 사용 가능하지 않다고 판단된 경우(S740-N), 전자 장치는 S650과 같이 기 설정된 횟수까지 제1 인공 지능 모델을 다른 방법으로 압축할 수 있다. 즉, 기 설 정된 횟수 이상 제1 인공 지능 모델을 압축하였으나 여전히 리소스가 사용 가능하지 않다고 판단된 경우, 전자 장치는 S750에 따라 제2 메모리에 로드된 다른 인공 지능 모델을 압축할 수 있다. 도 8은 본 개시의 다양한 실시예에 따른 인공 지능 모델을 사용하는 방법을 설명하기 위한 예시도이다. 도 8에 도시된 바와 같이, 전자 장치가 메신저 어플리케이션을 실행하여 대화 상대방과 사진 및 대화를 주 고 받는 경우를 가정할 수 있다. 이때, 전자 장치의 제2 메모리은 이미지 분석 모델, 대화 인식 모델 및 키보드 추천 모델 등이 로드될 수 있다. 구체적으로, 대화 인식 모듈은 상대방과의 대화 내용 이해를 위해 메신저 어플리케이션을 통해 대화가 입력되면, 지속적으로 대화 내용을 분석하기 위한 모델이다. 대화 인식 모 델은 자연어 처리 (Natural Language Understanding, NLU) 및 컨텍스트를 관리할 수 있다. 이미지 분석 모델은메신저 어플리케이션을 통해 수신된 이미지를 분석하기 위한 모델이다. 구체적으로, 이미지 분석 모델은 이미지 에 포함된 오브젝트를 분석하거나 분석된 오브젝트를 분류할 수 있다. 키보드 추천 모델은 대화 인식 모델을 통 해 파악된 대화 상황을 바탕으로 단어 또는 문장을 추천해 주기 위한 모델이다. 키보드 추천 모델은 자연어 처 리 (Natural Language Understanding, NLU) 및 사용자의 키 입력을 미리 예측하여 추천할 수 있다. 일 실시예로, 전자 장치는 대화를 분석하여 사용자가 수행하고 싶은 액션을 추천할 수 있다. 구체적으로, 전자 장치는 \"어제 찍은 사진!\" 및 \"오? YY도 갔네?\", \"다른 사진도 있어?\"라는 대화 내용을 입력 값으로 대화 인식 모델에 입력하여 \"어제 YY와 찍은 사진을 대화 상대방에게 보내기\"와 같은 액션을 추천할 수 있다. 이 경우, 전자 장치는 이미지 분석 모델 및 키보드 추천 모델은 낮은 성능으로 압축하여 대화 관리 모델의 성능을 상대적으로 높일 수 있다. 또 다른 실시예로, 전자 장치는 이미지 및 대화를 분석하여 사용자가 수행하고 싶은 액션을 추천할 수 있 다. 구체적으로, 전자 장치는 \"어제 찍은 사진!\" 및 \"오? YY도 갔네?\", \"다른 사진도 있어?\"라는 대화 내 용을 입력 값으로 대화 인식 모델에 입력하여 \"어제 YY와 찍은 사진을 대화 상대방에게 보내기\"와 같은 액션을 추천할 수 있다. 나아가, 전자 장치는 이미지 분석을 통해 이미지에 포함된 YY를 식별하고, 어제 찍은 사 진 중 YY가 포함된 이미지를 추가로 획득하여 제공할 수 있다. 이 경우, 전자 장치는 키보드 추천 모델은 낮은 성능으로 압축하여, 대화 관리 모델 및 이미지 분석 모델의 성능을 상대적으로 높일 수 있다. 또 다른 실시예로, 전자 장치는 또 다른 실시예로, 전자 장치는 이미지 및 대화를 분석하여 사용자에 게 단어 또는 문장을 추천해 줄 수 있다. 구체적으로, 전자 장치는 \"어제 찍은 사진!\" 및 \"오? YY도 갔 네?\", \"다른 사진도 있어?\"라는 대화 내용을 입력 값으로 대화 인식 모델에 입력하여 \"어제 YY와 찍은 사진을 대화 상대방에게 보내기\"와 같은 액션을 추천할 수 있다. 나아가, 전자 장치는 이미지 분석을 통해 이미지 에 포함된 YY를 식별하고, 어제 찍은 사진 중 YY가 포함된 이미지를 추가로 획득하여 제공할 수 있다. 나아가, 전자 장치는 어제 YY와 찍은 사진이 존재하는 경우, \"있지\"라는 단어를 추천할 수도 있다. 이 경우, 이미 지 분석 모델, 대화 관리 모델, 키보드 추천 모델은 모두 일정 성능을 발휘하도록 압축되어야 할 것이다. 상기 도 8의 실시예에서 각각의 모델의 성능은 도a 내지 도 5d에서 설명한 바와 같이, 사용자가 설정할 수 있다. 예를 들어, 사용자가 키보드 추천 모델을 사용하지 않는 경우, 전자 장치는 사용자 설정에 따라 각 각의 인공 지능 모델을 압축할 수 있다. 즉, 전자 장치는 키보드 추천 모델을 제2 메모리에 로드하지 않고, 대화 인식 모델 및 이미지 분석 모델만을 로드할 수 있다. 또는 사용자가 인공 지능 모델의 성능을 설정하지 않는 경우라도, 전자 장치는 특정 상황, 히스토리, 컨텍 스트 등을 바탕으로 인공 지능 모델의 성능을 판단할 수 있다. 일 실시예로, 전자 장치는 각각의 인공 지 능 모델의 사용 횟수를 바탕으로 인공 지능 모델의 성능 및 압축률을 결정할 수 있다. 예를 들어, 사용자가 키 보드 추천 모델에 의해 출력된 결과값을 사용하지 않는 경우, 전자 장치는 키보드 추천 모델의 성능을 낮 게(예를 들어 정확도 50%에서 최소 메모리 사용량을 가지도록) 결정할 수 있다. 한편, 또 다른 실시예로, 전자 장치가 디스플레이 장치인 경우를 가정할 수 있다. 구체적으로, 전자 장치 가 고화질(Super Resolution)기술 또는 상품 주문 서비스를 위한 화면 분석 기술을 사용하는 경우, 인공 지능 모델이 필요할 수 있다. 일반적으로 디스플레이 장치의 경우 제2 메모리의 크기가 크지 않으므로, 상 황에 따라 인공 지능 모델의 성능을 조절할 필요가 있다. 예를 들어, 상품 주문 서비스를 위한 화면 분석 모델 을 사용하는 경우, 전자 장치는 특정 상황(예를 들어 낮 시간, TV 프로그램이 재생되는 경우)에서만 화면 분석 모델을 사용할 수 있다. 또는 상품 주문 서비스를 사용하지 않는 사용자의 경우, 전자 장치는 상품 주문 서비스 모델을 낮은 성능을 가지도록 압축하여 제2 메모리에 로드할 수 있다. 또 다른 실시예로, 전자 장치는 인공 지능 스피커 또는 인공 지능 로봇일 수 있다. 이 경우, 전자 장치 는 특정 장소(예를 들어 집)에서만 사용하는 한정적인 단어 또는 사물 인식만을 필요로 하므로, 전자 장치 는 인식 단어의 클래스 또는 사물 인식 클래스와 관련된 모델을 한정하여 성능을 조절할 수 있다. 도 9a 내지 도 9c는 본 개시의 또 다른 실시예에 따른 인공 지능 모델을 사용하는 방법을 설명하기 위한 예시도 이다. 상술한 바와 같이, 전자 장치는 사용자에 의해 설정된 성능 조건을 바탕으로 인공 지능 모델을 압축할 수 있을 뿐만 아니라, 특정 상황, 히스토리, 컨텍스트 등을 바탕으로 인공 지능 모델을 압축할 수도 있다. 예를 들 어, 전자 장치가 사용하는 복수개의 인공 지능 모델이 독립적으로 사용되거나, 특정 순서에 따라서 사용되는 경우, 전자 장치는 특정 순서에 따라 복수의 인공 지능 모델의 압축 순서를 결정할 수 있다. 일 실시예로, 도 9a 내지 도 9c에 도시된 IoT 시스템을 고려할 수 있다. 도 9a 내지 도 9c에 도시된 IoT 시스템 은 사용자가 특정 상황을 알려달라는 명령에 대하여 특정 상황을 판단하고, 사용자에게 알려주는 인공 지능 시 스템에 관한 것이다. 구체적으로, IoT 시스템은 \"냄비 물이 끓으면 알려줘\" 라는 사용자의 자연어 명령을 듣고, 부엌의 IoT 카메라 통해 냄비 물이 끓는 것이 감지되면 사용자에게 알려줄 수 있다. 이때, \"냄비 물이 끓으면 알려줘\" 라는 사용자의 자연어 명령은 Automatic Speech Recognition 모델(ASR 모델)에 의해 판단되고, 냄비 물이 끓는 것의 감지는 Object Detect 모델에 의해 판단되고, 사용자에 대한 응답은 Language Generation 모델 에 의해 생성될 수 있다. 설명의 편의를 위해 제2 메모리는 128MB이고, 각각의 인공 지능 모델은 하기와 같은 경우를 가정한다. 표 1 #of weight parametersData representation bitsModel size (MB) ASR 20,000,000 32 bits 80 Object Detect 100,000,000 32 bits 400 Language Generation 30,000,000 32 bits 120 이때, #of weight parameters는 각각의 인공 지능 파라미터의 가중치 파라미터의 개수를 나타내며, Data representation bits는 하나의 가중치 파라미터를 저장하기 위해 필요한 비트수를 나타낸다. Model Size는 #of weight parameters 와 Data representation bits를 곱한 값이다. 한편, 가중치 파라미터의 개수를 줄이기 위해 서는 Pruning기법이 사용될 수 있고, 하나의 가중치 파라미터를 저장하는데 필요한 비트를 줄이기 위해서는 Quantization 기법이 사용될 수 있다. 도 9a와 같이, 전자 장치는 \"냄비 물이 끓으면 알려줘\"와 같은 사용자 명령을 입력 받을 수 있다. 이 경 우, Object Detect 모델 및 Language Generation 모델은 사용자 명령을 분석하는데 적합한 모델이 아니다. 따 라서, 전자 장치는 도 9a에 도시된 바와 같이, ASR 모델의 크기를 유지하며 나머지 인공 지능 모델을 압축 할 수 있다. 예를 들어, 전자 장치는 각각의 인공 지능 모델을 하기 표 2와 같이 압축하여 제2 메모리 에 로드할 수 있다. 표 2 #of weight parametersData representation bitsModel size (MB) ASR 20,000,000 32 bits 80 Object Detect 50,000,000 1 bits 6.25 Language Generation 15,000,000 1 bits 1.88 즉, 제2 메모리는 128MB의 크기를 가지고 ASR 모델의 크기는 80MB이므로, 전자 장치는 ASR 모델을 압 축하지 않고 그대로 제2 메모리에 로드하고, Object Detect 모델 및 Language Generation 모델을 표 2와 같이 압축하여 제2 메모리에 로드할 수 있다. 사용자 명령이 입력되면, 전자 장치는 사용자 명령에 따라 냄비 물이 끓는지 여부를 판단할 수 있다. 구체 적으로 도 9b에 도시된 바와 같이, 전자 장치는 IoT 시스템 중 일부인 카메라로부터 냄비에 대한 이미지를 수신하여 수신된 이미지를 분석할 수 있다. 다만, 전자 장치스스로 냄비를 촬영하여 이미지를 분석할 수 있음은 물론이다. 이 경우, ASR 모델 및 Language Generation 모델은 이미지 분석에 적합한 모델이 아니다. 따라서, 전자 장치 는 도 9b에 도시된 바와 같이, Object Detect 모델의 크기를 유지하며 나머지 인공 지능 모델을 압축할 수 있다. 다만, Object Detect 모델의 경우 모델 크기가 400MB이므로, 제2 메모리의 크기보다 크다. 따라서, 전자 장치는 하기 표 3과 같이 Object Detect 모델을 압축하여 제2 메모리에 로드하여야 한다. 표 3 #of weight parametersData representation bitsModel size (MB) ASR 10,000,000 1 bits 1.25object Detect 000,000,000 8 bits 100 language Generation 5,000,000 1 bits 1.88 즉, 제2 메모리는 128MB의 크기를 가지고 Object Detect 모델의 경우 모델 크기가 400MB이므로, 전자 장치 는 Object Detect 모델을 제2 메모리의 사용 가능한 메모리 크기를 바탕으로 압축하여 제2 메모리 에 로드하고, ASR 모델 및 Language Generation 모델을 표 3와 같이 압축하여 제2 메모리에 로드할 수 있다. 냄비의 물이 끓는 것이 감지되면, 전자 장치는 사용자에게 물이 끓음을 알리는 메시지를 출력할 수 있다. 구체적으로 도 9c에 도시된 바와 같이, 전자 장치는 \"냄비 물이 끓고 있어요!\"와 같은 음성을 출력할 수 있다. 이 경우, ASR 모델 및 Object Detect 모델은 출력되는 음성을 생성하기에 적합한 모델이 아니다. 따라서, 전자 장치는 도 9c에 도시된 바와 같이, Language Generation 모델의 크기를 유지하며 나머지 인공 지능 모델을 압축할 수 있다. 예를 들어, 전자 장치는 각각의 인공 지능 모델을 하기 표 4와 같이 압축하여 제2 메모리 에 로드할 수 있다. 표 4 #of weight parametersData representation bitsModel size (MB) ASR 10,000,000 1 bits 1.25 Object Detect 50,000,000 1 bits 6.25 Language Generation 30,000,000 32 bits 120 즉, 제2 메모리는 128MB의 크기를 가지고 Language Generation 모델의 크기는 120MB이므로, 전자 장치 는 Language Generation 모델을 압축하지 않고 그대로 제2 메모리에 로드하고, ASR 모델 및 Object Detect 모델을 표 4와 같이 압축하여 제2 메모리에 로드할 수 있다. 한편, 본 개시에 따른 또 다른 실시예로, 전자 장치는 복수의 인공 지능 모델을 직접 압축하거나, 외부 서 버로 인공 지능 모델 압축을 요청할 수 있다. 전자 장치가 외부 서버로 인공 지능 모델 압축을 요청하는 경우, 전자 장치는 외부 서버로부터 압축된 인공 지능 모델을 수신하여 제2 메모리에 로드할 수 있다. 이 때, 전자 장치가 인공 지능 모델을 직접 압축하는 경우, 상황에 따라 다른 압축 방법을 사용할 수 있다. 예를 들어, 빠른 압축이 필요한 경우, 전자 장치는 별도의 트레이닝을 요구하지 않는 압축 방법(예를 들어, pruning 등)을 이용하여 인공 지능 모델을 압축할 수 있다. 빠른 압축이 필요하지 않는 경우, 전자 장치 는 정확도를 고려하여 다양한 방법을 통해 압축할 수 있다. 또 다른 실시예로, 전자 장치는 다양한 압축 인공 지능 모델을 제1 메모리에 저장하고, 필요한 압축 인공 지능 모델을 제1 메모리에서 제2 메모리로 로드할 수 있다. 이때, 제1 메모리에 저장되는 압축 인공 지능 모델의 형태는 다양할 수 있다. 예를 들어, 전자 장치(또는 외부 서버)는 기 설정된 조건에 따라 인공 지능 모델을 압축한 경우, 압축된 인공 지능 모델을 제1 메모리에 저장할 수 있다. 이때, 압축된 인공 지능 모델과 유사한 크기의 압축 인공 지능 모델이 제1 메모리에 기 저장되어 있는 경우, 전자 장치는 기 저장된 압축 인공 지능 모델과 새 로 압축된 인공 지능 모델의 성능을 비교하여, 성능이 더 좋은 압축 인공 지능 모델을 제1 메모리에 저장 할 수 있다. 또는, 전자 장치는 최초 인공 지능 모델을 외부 서버로부터 다운 받는 경우, 다운받는 인공 지능 모델에 대한 다양한 압축 인공 지능 모델을 함께 다운받을 수 있다. 예를 들어, 인공 지능 모델이 64MB인 경우, 전자 장치는 64MB의 인공 지능 모델의 절반 크기인 32MB의 압축 인공 지능 모델, 32MB의 압축 인공 지능 모델의 절반 크기인 16MB의 압축 인공 지능 모델, 16MB의 압축 인공 지능 모델의 절반 크기인 8MB의 압축 인공 지능 모 델, 8MB의 압축 인공 지능 모델의 절반 크기인 4MB의 압축 인공 지능 모델, 4MB의 압축 인공 지능 모델의 절반 크기인 2MB의 압축 인공 지능 모델, 2MB의 압축 인공 지능 모델의 절반 크기인 1MB의 압축 인공 지능 모델을 획득할 수 있다. 즉, 전자 장치는 64MB의 인공 지능 모델에 대하여 6개의 압축 인공 지능 모델을 제1 메모리(11 0)에 저장할 수 있다. 절반의 크기를 가지는 압축 인공 지능 모델들을 저장하는 경우, 하나의 인공 지능 모델 및 압축 인공 지능 모델의 저장 공간은 원본 인공 지능 모델의 2배 이하이다. 예를 들어, 64MB의 인공 지능 모 델 및 6개의 압축 인공 지능 모델의 크기의 합은 127MB로, 전자 장치는 다양한 압축 인공 지능 모델을 적 은 크기의 용량으로 저장하고 있을 수 있다. 도 10은 본 개시의 일 실시예에 다른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 전자 장치는 복수의 인공 지능 모델을 제1 메모리에 저장할 수 있다(S1010). 이때, 상술한 바와 같이, 복수의 인공 지능 모델 각각에 대한 압축 인공 지능 모델을 함께 저장할 수 있음은 물론이다. 저장된 복수의 인공 지능 모델 중 제1 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호를 수신하 면, 전자 장치는 제2 메모리의 사용 가능한 메모리 크기를 판단할 수 있다(S1020). 이때, 제1 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호는 사용자 명령이 입력된 경우일 수 있다. 또는, 제1 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호는 특정 상황, 히스토리, 컨텍스트 등과 같이 기 설정 된 조건을 만족한 경우일 수 있다. 제1 인공 지능 모델의 크기가 제2 메모리의 사용 가능한 메모리 크기보다 큰 경우, 전자 장치는 제2 메모리의 사용 가능한 메모리 크기를 바탕으로 제1 인공 지능 모델을 압축한 제1 압축 인공 지능 모델을 제2 메모리에 로드할 수 있다(S1030). 도 11은 본 개시의 또 다른 실시예에 따른 전자 장치 및 외부 서버의 동작을 설명하기 위한 예시도이다. 상술한 바와 같이, 압축된 인공 지능 모델은 전자 장치에 의해 획득될 수 있으나, 이에 한정되는 것은 아 니다. 즉, 전자 장치는 압축된 인공 지능 모델을 외부 서버로부터 다운로드하여 획득할 수도 있음은 물론이다. 이때, 전자 장치는 필요에 따라 압축된 인공 지능 모델을 직접 획득하거나, 외부 서버로부터 다운로 드 받을 수 있다. 예를 들어, 압축하고자 하는 인공 지능 모델이 기 설정된 크기 이상이어서, 전자 장치가 압축하고자 하는 인공 지능 모델을 압축하는데 필요한 계산량이 기 설정된 계산량 이상인 경우, 전자 장치(10 0)는 외부 서버로부터 압축된 인공 지능 모델을 다운로드 받을 수 있다. 또는, 압축하고자 하는 인공 지능 모델의 크기와 상관 없이 인공 지능 모델을 압축하는데 필요한 계산량이 기 설정된 계산량 이상인 경우, 전자 장치는 외부 서버로부터 인공 지능 모델을 다운로드 받을 수 있다. 또는, 전자 장치의 프로세서 점유율을 바탕으로, 전자 장치가 인공 지능 모델을 압축할지, 외부 서버로부터 다운로드 받을지를 결 정할 수도 있다. 도 12는 본 개시의 일 실시예에 따른, 전자 장치가 외부 서버로부터 압축된 인공 지능 모델을 다운받는 동작을 설명하기 위한 흐름도이다. 전자 장치는 인공 지능 모델을 압축하기 위한 제어 신호를 수신할 수 있다(S1210). 이때, 인공 지능 모델 을 압축하기 위한 제어 신호는 다양한 조건에서 수신될 수 있다. 예를 들어, 외부 서버로부터 인공 지능 모델을 다운 받은 경우, 전자 장치는 다운 받은 인공 지능 모델을 압축하기 위한 제어 신호를 수신할 수 있다. 또는, 전자 장치는 인공 지능 모델을 제2 메모리에 로드하기 위한 제어 신호가 수신되고, 제2 메모리에 로드하기 위한 제어 신호에 따라 인공 지능 모델이 압축되어야 하는 경우, 전자 장치는 인 공 지능 모델을 압축하기 위한 제어 신호를 수신할 수 있다. 즉, 전자 장치는 인공 지능 모델을 다운 받은 시점에서 인공 지능 모델을 전자 장치에서 압축할지, 또는 외부 서버에서 압축할지를 결정하거나, 인 공 지능 모델을 압축할 필요가 있는 경우, 인공 지능 모델을 전자 장치에서 압축할지, 또는 외부 서버 에서 압축할지를 결정할 수 있다. 전자 장치는 인공 지능 모델을 전자 장치에서 압축할지 여부를 판단할 수 있다(S1220). 인공 지능 모 델을 전자 장치에서 압축하기로 판단된 경우(S1220-Y), 전자 장치는 인공 지능 모델을 압축하여 제1 메모리에 저장하거나 제2 메모리에 로드할 수 있다(S1250). 인공 지능 모델을 외부 서버에서 압축하기로 판단된 경우(S1220-N), 전자 장치는 외부 서버로 인공 지능 모델을 압축할 것을 요청할 수 있다(S1230) 상술한 바와 같이, 압축하고자 하는 인공 지능 모델이 기 설정된 크기 이상이어서, 전자 장치 가 압축하고자 하는 인공 지능 모델을 압축하는데 필요한 계산량이 기 설정된 계산량 이상인 경우, 전자 장치는 외부 서버로 인공 지능 모델을 압축할 것을 요청할 수 있다 또는, 압축하고자 하는 인공 지능 모델의 크기와 상관 없이 인공 지능 모델을 압축하는데 필요한 계산량이 기 설정된 계산량 이상인 경우, 전자 장치는 외부 서버로 인공 지능 모델을 압축할 것을 요청할 수 있다 또는, 전자 장치의 프로세서 점유율을 바탕으로, 전자 장치가 인공 지능 모델을 압축할지, 외부 서버로 인공 지능 모델을 압축할 것을 요청할 지를 결정할 수도 있다. 전자 장치는 외부 서버로부터 압축된 인공 지능 모델을 다운로드 하여 제1 메모리에 저장하거나 제2 메모리에 로드할 수 있다(S1240). 한편, 본 개시의 실시 예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되 었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 개시의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각 각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프 로그램으로서 구현될 수도 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는 프로그램 모듈 의 형태로 컴퓨터로 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저 장된 명령어로 구현될 수 있다. 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 여기서, 프로그램은 컴퓨터가 읽을 수 있는 비일시적 기록매체에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으 로써, 본 개시의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미할 뿐만 아니라 레지스터, 캐쉬, 버퍼 등을 포함하며, 신호(signal), 전류(current) 등과 같은 전송 매개체는 포함하지 않는다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 내장 메모리(예: 메모리 ), 메모리 카드, ROM 또는 RAM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다. 또한, 개시된 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)으로 제공될 수 있다. 컴퓨터 프로그램 제품은 S/W 프로그램, S/W 프로그램이 저장된 컴퓨터로 읽을 수 있는 저장 매체 또는 판매자 및 구매자 간에 거래되는 상품을 포함할 수 있다. 예를 들어, 컴퓨터 프로그램 제품은 전자 장치 또는 전자 장치의 제조사 또는 전자 마켓(예, 구글 플레이 스토 어, 앱 스토어)을 통해 전자적으로 배포되는 S/W 프로그램 형태의 상품(예, 다운로더블 앱)을 포함할 수 있다. 전자적 배포를 위하여, S/W 프로그램의 적어도 일부는 저장 매체에 저장되거나, 임시적으로 생성될 수 있다. 이 경우, 저장 매체는 제조사 또는 전자 마켓의 서버, 또는 중계 서버의 저장매체가 될 수 있다. 이상에서는 본 개시의 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에 한정되지"}
{"patent_id": "10-2018-0084311", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "아니하며, 청구범위에 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통상의 지식 을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2018-0084311", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시에 따른 전자 장치가 복수개의 인공 지능 모델을 관리하는 방법을 설명하기 위한 예시도이다. 도 2는 본 개시의 일 실시예에 따른 전자 장치의 구성을 간략히 도시한 블록도이다. 도 3은 본 개시의 일 실시예에 따른 전자 장치의 구성을 상세히 도시한 블록도이다. 도 4a 내지 도 4d는 본 개시의 일 실시예에 따른 인공 지능 모델을 로드하는 방법을 설명하기 위한 예시도이다. 도 5a 내지 도 5d는 본 개시의 일 실시예에 따른 복수의 인공 지능 모델의 성능에 대한 조건을 설정하는 방법을 설명하기 위한 예시도이다. 도 6은 본 개시의 일 실시예에 따른 인공 지능 모델 압축 과정을 설명하기 위한 예시도이다. 도 7은 본 개시의 일 실시예에 따른 또 다른 압축 방법을 설명하기 위한 흐름도이다.도 8은 본 개시의 다양한 실시예에 따른 인공 지능 모델을 사용하는 방법을 설명하기 위한 예시도이다. 도 9a 내지 도 9c는 본 개시의 또 다른 실시예에 따른 인공 지능 모델을 사용하는 방법을 설명하기 위한 예시도 이다. 도 10은 본 개시의 일 실시예에 다른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 11은 본 개시의 또 다른 실시예에 따른 전자 장치 및 외부 서버의 동작을 설명하기 위한 예시도이다. 도 12는 본 개시의 일 실시예에 따른, 전자 장치가 외부 서버로부터 압축된 인공 지능 모델을 다운받는 동작을 설명하기 위한 흐름도이다."}
