{"patent_id": "10-2020-0068045", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0151353", "출원번호": "10-2020-0068045", "발명의 명칭": "전류센싱형 태양광 발전효율 최적 패널 제어 방법", "출원인": "한국전력공사", "발명자": "박종광"}}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전류량에 따른 태양관 모듈 최적위치 제어방법에 있어서,1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각에서 개별전류량을 측정 하는 단계;다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전류량 및 상기 세부모듈의 평균전류량을 산출하는 단계;상기 총합전류량을 목표전류량과 비교하는 단계;상기 총합전류량이 상기 목표전류량보다 작은 경우, 다수개의 상기 세부모듈의 개별전류량을 상기 평균전류량과 각각 비교하는 단계; 및 상기 개별전류량이 상기 평균전류량보다 작은 상기 세부모듈의 각도를 변경하는 단계;를 포함하는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,다수개의 상기 세부모듈은 NxN개의 세부모듈인 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 각도 변경은 상기 세부모듈의 대향면 각도가 최고일조량이 가능한 각도로 변경되는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 최고일조량을 위한 상기 세부모듈의 대향면 각도는 관리서버로부터 송출받는 전류센싱형 태양광 발전효율최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 관리서버는 상기 세부모듈의 대향면 각도 변경을 위해 필요한 요구전력량이 상기 세부모듈의 대향면 각도변경을 통해 일정기간 동안 획득할 수 있는 획득전력량을 비교하는 전류센싱형 태양광 발전효율 최적 패널 제어방법.."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 전력량 비교결과 마이너스 인 경우, 상기 세부모듈의 대향면 각도 변경을 하지 않는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2021-0151353-3-제6항에 있어서,상기 최고일조량은 NxN개의 상기 세부모듈 각각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회기분석 알고리듬이 적용되는 인공지능 딥러닝 학습으로 결정되는전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "전류량에 따른 태양관 모듈 최적위치 제어방법에 있어서,1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각에서 개별전류량을 측정 하는 단계;다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전류량 및 상기 세부모듈의 평균전류량을 산출하는 단계;상기 총합전류량을 목표전류량과 비교하는 단계;상기 총합전류량이 상기 목표전류량보다 큰 경우, 상기 총합전류량을 관리서버로 송출해서 상기 목표전류량을 조정하는 단계;를 포함하는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,다수개의 상기 세부모듈은 NxN개의 세부모듈인 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제11항에 있어서,상기 조정된 목표전류량은 최고일조량일 때 산출된 값이며,상기 최고일조량은 NxN개의 상기 세부모듈 각각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회기분석 알고리듬이 적용되는 인공지능 딥러닝 학습으로 결정되는전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전류량에 따른 태양관 모듈 최적위치 제어방법에 있어서,1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각에서 개별전류량을 측정 하는 단계;다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전류량 및 상기 세부모듈의 평균전류량을 산출하는 단계;상기 총합전류량을 목표전류량과 비교하는 단계;상기 총합전류량이 상기 목표전류량보다 작은 경우, 다수개의 상기 세부모듈의 개별전류량을 상기 평균전류량과 각각 비교하는 단계; 및 상기 개별전류량이 상기 평균전류량보다 작은 상기 세부모듈의 각도를 경제적 최적각도로 변경되는 단계;를 포함하는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,다수개의 상기 세부모듈은 NxN개의 세부모듈인 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2021-0151353-4-제12항에 있어서,상기 경제적 최적각도로의 변경은 상기 세부모듈의 대향면 각도가 최적일조량이 가능한 각도 및 상기 경제적 최적각도로의 변경에 필요한 요구전략량에 의해 결정되는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 최적일조량을 위한 상기 세부모듈의 경제적 최적각도는 관리서버로부터 송출받는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 관리서버는 상기 세부모듈의 대향면 각도 변경을 위해 필요한 요구전력량이 상기 세부모듈의 대향면 각도변경을 통해 일정기간 동안 획득할 수 있는 획득전력량을 비교하는 전류센싱형 태양광 발전효율 최적 패널 제어방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 관리서버는 상기 전력량 비교결과 마이너스 인 경우, 상기 세부모듈의 대향면 각도 변경을 하지 않는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 관리서버는 상기 전력량 비교결과 플러스가 되는 경제적 최적각도를 찾아 상기 세부모듈이 변경될 각도로지정하는 전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 최적일조량은 NxN개의 상기 세부모듈 각각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회기분석 알고리듬이 적용되는 인공지능 딥러닝 학습으로 결정되는전류센싱형 태양광 발전효율 최적 패널 제어 방법."}
{"patent_id": "10-2020-0068045", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전류센싱형 태양광 발전효율 최적 패널 제어 방법에 관한 것으로서,다수개의 태양광 세부모듈 각각의 전류량을 측정 하는 단계; 상기 전류량에 따라 각각의 세부모듈의 방향 또는 위치를 분석하는 단계; 총 발전량이 최대가 되도록 상기 각각의 세부모듈의 방향 또는 위치가 결정되는 단계; 상기 위치를 메모리에 저장하는 단계; 를 포함하는 전류센싱형 태양광 발전효율 최적 위치 제어 방법을 포함하여, 세부모듈별 발전 전류량이 인공지능 을 통해 분석되어 최적 위치로 제어됨으로써 태양광 발전 효율이 극대화되는 강점이 있다."}
{"patent_id": "10-2020-0068045", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전류센싱형 태양광 발전효율 최적 패널 제어 방법에 관한 것으로서, 보다 상세하게는 주기별로 최 적의 패널조정값을 제공함으로서 전류센싱형 태양광 발전효율 최적 위치 제어 방법에 관한 것이다."}
{"patent_id": "10-2020-0068045", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "오늘날의 에너지 기술은 화석에너지의 고갈과 극심한 환경오염문제로 인하여 청정 에너지 생산 효율 극대화에 집중되고 있다. 청정 에너지 생산의 대표적인 예가 바로 태양광 발전이다. 태양광 발전은 금속에 일정 진동수 이상의 빛을 비출 때 금속 표면에서 전자가 튀어나오는 광전 효과를 이용한 발전 방식이다. 따라서, 태양광 발전은 기계적인 진동과 소음이 없고 수명이 길며, 유지와 보수가 비교적 용이한 측면이 있다. 태양광 발전설비는 설치 방식에 따라서 크게 고정형(Fixed array) 태양광 발전설비와 가변형(Semi-Fixed Array) 태양광 발전설비, 그리고 추적식(Tracking Array) 태양광 발전설비로 나뉠 수 있다. 고정형 태양광 발전설비는 방위각과 경사각을 고정하여 설치되는 구조로서, 초기 설치비가 저렴하고 kW당 점유 면적이 적게 소요되면서, 구조적으로 안전하여 전복 또는 오작동의 사고 가능성이 낮다. 그러나, 고정형 태양광 발전설비는 항시 정해진 방위각 및 경사각을 갖기 때문에 태양 고도 변화에 따른 발전량 의 변동이 있어 발전효율이 좋지 못하다. 이와 같은 종래 고정형 태양광 발전설비의 한계를 극복하기 위하여 변화하는 태양고도에 대응하여 발전량을 극 대화 하기 위한 노력들이 있어 왔다. 가변형 태양광 발전설비와 추적형 태양광 발전설비의 등장이 바로 그것이다. 가변형 태양광 발전설비의 경우 계절 또는 월별로 상하 방향으로 경사각이 조절될 수 있는 구조로서, 경사각조 절방식에 따라서 자동형 혹은 수동형이 있다. 가변형 태양광 발전설비는 고정형 태양광 발전설비에 비하여는 약 5 내지 10% 정도의 발전 효율이 향상된다. 그러나, 가변형 태양광 발전설비는 고정형 태양광 발전설비에 비하여 설치비가 높은 단점이 있다. 한편, 추적식 태양광 발전설비는 최적의 경사각과 방향을 추적함으로써 태양광 발전 효율을 극대화 시킬 수 있 다. 그러나, 종래의 추적식 태양광 발전설비는 기술적 완성도가 낮아 고장이 잦고 보수 비용이 과다하게 발생되는 문제를 안고 있다. 태양광 자동 추적식 발전모듈은 개별 모듈에 설치된 센서 추적방식을 채택하고 있다. 이와 같은 태양광 자동 추적식 발전모듈은 현재의 태양광 발전설비 중에서 발전효율이 가장 우수하다. 그러나, 태양광 자동 추적식 발전모듈이 채택하고 있는 센서 추적방식은 광센서 및 구동 설비의 고정이 잦은 문 제가 있었다. 한편, 종래의 태양광 자동 추적식 발전설비에는 기설정된 이동궤도 프로그램이 사용되고 있었다. 즉, 종래의 태양광 자동 추적식 발전설비는 기설정된 이동궤도 프로그램을 사용하여 왔기 때문에 태양광 발전소 의 지역적 위치 등 환경적 요소가 제대로 반영되지 못하는 한계가 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 988264 B1"}
{"patent_id": "10-2020-0068045", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 위와 같은 종래의 문제점을 극복하기 위하여 전류센싱형 태양광 발전효율 최적 패널 제어 방법을 제 공하는 것에 목적이 있다."}
{"patent_id": "10-2020-0068045", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전류량에 따른 태양관 모듈 최적위치 제어방법은, 1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각에서 개별전류량을 측정 하는 단계; 다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전류량 및 상기 세부모듈의 평균전류량을 산출하는 단계; 상기 총합전류량을 목표전류량과 비교하는 단계; 상기 총합전 류량이 상기 목표전류량보다 작은 경우, 다수개의 상기 세부모듈의 개별전류량을 상기 평균전류량과 각각 비교 하는 단계; 및 상기 개별전류량이 상기 평균전류량보다 작은 상기 세부모듈의 각도를 변경하는 단계; 를 포함한 다.다수개의 상기 세부모듈은 NxN개이며, 상기 각도 변경은 상기 세부모듈의 대향면 각도가 최고일조량이 가능한 각도로 변경되고, 상기 최고일조량을 위한 상기 세부모듈의 대향면 각도는 관리서버로부터 송출받으며, 상기 관 리서버는 상기 세부모듈의 대향면 각도 변경을 위해 필요한 요구전력량이 상기 세부모듈의 대향면 각도 변경을 통해 일정기간 동안 획득할 수 있는 획득전력량을 비교하고, 상기 전력량 비교결과 마이너스 인 경우, 상기 세 부모듈의 대향면 각도 변경을 하지 않고, 상기 최고일조량은 NxN개의 상기 세부모듈 각각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회기분석 알고리듬이 적용 되는 인공지능 딥러닝 학습으로 결정될 수 있다. 또한, 전류량에 따른 태양관 모듈 최적위치 제어방법은, 1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각 에서 개별전류량을 측정 하는 단계; 다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전 류량 및 상기 세부모듈의 평균전류량을 산출하는 단계; 상기 총합전류량을 목표전류량과 비교하는 단계; 상기 총합전류량이 상기 목표전류량보다 큰 경우, 상기 총합전류량을 관리서버로 송출해서 상기 목표전류량을 조정하 는 단계;를 포함한다. 다수개의 상기 세부모듈은 NxN개이고, 상기 조정된 목표전류량은 최고일조량일 때 산출된 값이며, 상기 최고일조량은 NxN개의 상기 세부모듈 각각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍 속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회기분석 알고리듬이 적용되는 인공지능 딥러닝 학습으로 결 정될 수 있다. 또한, 전류량에 따른 태양관 모듈 최적위치 제어방법은, 1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각 에서 개별전류량을 측정 하는 단계; 다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전 류량 및 상기 세부모듈의 평균전류량을 산출하는 단계; 상기 총합전류량을 목표전류량과 비교하는 단계; 상기 총합전류량이 상기 목표전류량보다 작은 경우, 다수개의 상기 세부모듈의 개별전류량을 상기 평균전류량과 각각 비교하는 단계; 및 상기 개별전류량이 상기 평균전류량보다 작은 상기 세부모듈에 대한 경제적 최적각도로 변경 되는 단계;를 포함하며, 다수개의 상기 세부모듈은 NxN개이며, 상기 경제적 최적각도로의 변경은 상기 세부모듈 의 대향면 각도가 최적일조량이 가능한 각도 및 상기 경제적 최적각도로의 변경에 필요한 요구전략량에 의해 결 정되고, 상기 최적일조량을 위한 상기 세부모듈의 경제적 최적각도는 관리서버로부터 송출받으며, 상기 관리서 버는 상기 세부모듈의 대향면 각도 변경을 위해 필요한 요구전력량이 상기 세부모듈의 대향면 각도 변경을 통해 일정기간 동안 획득할 수 있는 획득전력량을 비교하고, 상기 관리서버는 상기 전력량 비교결과 마이너스 인 경 우, 상기 세부모듈의 대향면 각도 변경을 하지 않으며, 상기 관리서버는 상기 전력량 비교결과 플러스가 되는 경제적 최적각도를 찾아 상기 세부모듈이 변경될 각도로 지정하는 상기 최적일조량은 NxN개의 상기 세부모듈 각 각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회 기분석 알고리듬이 적용되는 인공지능 딥러닝 학습으로 결정할 수 있다."}
{"patent_id": "10-2020-0068045", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "위와 같은 본 발명에 따르면 다음과 같은 효과가 있다. 첫째, 태양광 모듈별 발전 전류량이 인공지능을 통해 분석되어 최적 위치로 제어됨으로써 태양광 발전 효율이 극대화되는 강점이 있다. 둘째, 인공지능을 이용하여 일, 주, 월 단위의 최적 발전량 트렌드 분석을 통해 발전양을 극대화하는 이점이 있 다. 셋째, 메모리에 저장된 위치 및 방향이 딥러닝을 통해 업데이트 되기 때문에 발전 효율의 저하가 방지되는 장점 이 있다. 넷째, 태양광 발전소별로 1개의 키(key)모듈을 적용하여 발전소 전체의 모듈을 최적 위치 제어될 할 수 있는 효 과가 있다."}
{"patent_id": "10-2020-0068045", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들을 도면에 예시하고 상세한 설명에 구체적으로 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용한다. 제 1, 제 2등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2구성요소로 명명될 수 있고, 유사하 게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. \"및/또는\" 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않아야 한다. 본 발명의 바람직한 실시 예에 따른 전류 센싱형으로 최적위치가 제어되는 태양광발전기의 구성은 다음과 같다. 태양광발전기는 전류 센싱형으로 최적위치가 제어되는 세부모듈을 포함한다. 각각의 세부모듈은 각각의 회전축을 중심으로 회전가능하다. 각각의 세부모듈의 배치는 NxN으로 배치되데, 중심으로부터 가장 먼 세부모듈이 동서남북 방향의 기준이 되도록 설정 가능하다. 이 때의 세부모듈 각각의 방향 또는 위치는 인공지능 딥러닝 학습의 결과로부터 계산된다. 한편, 딥러닝 학습은 전류량과 전력센싱량에 대한 비선형 회기분석 알고리듬이 적용될 수 있다. 딥러닝학습은 발전 트렌드를 일, 주, 월, 또는 계절 단위로 학습되는 것이 바람직할 수 있다. 또한, 각 단위 학습 시, 풍속 및 풍향을 추가로 학습하는 것이 바람직할 수 있다. 다음으로 본 발명의 바람직한 실시 예에 따른 전류센싱형 태양광 발전효율 최적 위치 제어 방법을 상술한다. 먼저, 다수개의 세부모듈별로 전류량을 측정한다. (S1) 다음으로 측정된 전류량에 따라 각각의 세부모듈의 방향을 분석한다. (S2) 이 때의 분석되는 세부모듈의 방향은 발전 전력이 최대가 되도록 분석되는데, 보다 상세하게는 세부모듈 각각의 방향 또는 위치는 총 발전량이 최대가 되도록 설정된다. 다음으로 인공지능에 의해 딥러닝을 수행한다. (S3) 딥러닝은 발전량의 변화를 검출해서 최적방향을 계산한다. 이 때 딥러닝은 일, 주, 월 또는 계절 단위로 학습되어 발전 트렌드를 예측해 제시하는 것이 바람직할 수 있다. 또한, 딥러닝의 예측을 통해 최대 발전량이 도출되는 위치를 제시하는 것이 가능하다. 한편, 딥러닝학습은 각 단위 학습 시, 풍속 및 풍향을 추가로 학습하는 것이 가능하다. 또한, 딥러닝 학습은 전류량과 전력센싱량에 대한 비선형 회기분석 알고리듬이 적용되는 것이 바람직할 수 있다. 다음으로 총 발전량이 최대가 되도록 다수의 세부모듈의 위치가 결정된다. (S4) 즉, 세부모듈의 위치는 앞서 분석된 세부모듈의 방향으로의 위치제어를 통해 추적될 수 있다. 즉, 메모리에 저장된 위치 및 방향으로부터 추적식으로 전체 모듈의 최적 방향을 일괄 결정하도록 제어가 가능 하다. 여기서의 위치는 세부모듈의 높낮이를 가리킬 수 있다. 그 다음으로 결정된 위치를 메모리에 저장한다. (S5) 세부모듈의 위치 및 방향은 메모리에 저장되고 딥러닝을 통해 지속적으로 학습되는 것이 가능하다. 다시 말해서 딥러닝은 학습을 통해서 태양광 발전을 극대화하기 위한 세부모듈의 위치 및 방향을 메모리에 지속 적으로 업데이트할 수 있다. 한편, 세부모듈은 다수개가 배열을 형성하여 형성될 수 있다. 각각의 세부모듈의 배치는 NxN으로 배치될 수 있다. 일예로서, 다수개의 세부모듈은 3X3의 9개의 세부모듈로 구성될 수 있다. 보다 상세하게는 다수개의 세부모듈은 가로로 세 개, 세로로 세 개가 각각 배열되어 전체적으로 정사각형 구조 로 마련될 수 있는 것이다. 이와 같은 세부모듈의 배열을 통해 세부모듈 각각의 최적 방향을 결정하는 것이 가능해진다. 도 2(a)는 본 발명의 바람직한 실시 예에 따른 세부모듈의 사시도이며, 도 2(b)는 본 발명의 바람직한 실시 예 에 따른 세부모듈의 세부 구조도이다. 도 2(a)와 같이 본 발명의 바람직한 실시 예에 따른 세부모듈은 각각이 움직일 수 있도록 독립된 구조이다. 다시 말해서, 9개의 세부모듈은 각각이 별개로 각도 제어가 가능하며, 이 때의 각도 제어는 태양의 위치에 최적 화 되는 것이 가능하다. 9개의 태양광 세부모듈은 각각의 회전축을 중심으로 회전가능하다. 보다 상세하게 설명하면, 태양광 세부모듈은 제1 모듈, 제2 모듈 및 제3 모듈이 세로 방향으로 일정 간격으로 배치된다. 제4 모듈, 제5 모듈 및 제6 모듈 역시 세로 방향으로 일정 간격으로 배치되며, 제7 모듈, 제8 모듈 및 제9 모듈도 각각 세로 방향으로 일정 간격으로 배치된다. 제1 모듈, 제4 모듈, 제7 모듈은 가로 방향으로 일정 간격으로 배치되고 있다. 제2 모듈, 제5 모듈 및 제8 모듈 역시 가로 방향으로 일정 간격으로 배치되고 있다. 제3 모듈, 제6 모듈 및 제9 모듈도 가로 방향으로 일정 간격으로 배치되고 있다. 본 발명의 바람직한 실시 예에 따른 9개의 세부모듈 중에서 제5 모듈이 중심에 배치되고 있다. 한편, 각각의 세부모듈에는 전류센서(CT)가 포함되고 있다. 제1 모듈 내지 제9 모듈은 태양광 발전소에서 필요로하는 1개의 키모듈(Key module)일 수 있다. 일 예로써 세부모듈 각각은 다음과 같은 방향정보를 가질 수 있다. 중심에 배치된 제5 모듈로부터 가장 먼 세부모듈이 동서남북 방향의 기준이 되도록 설정될 수 있다. 제1 모듈은 북쪽 방향, 제2 모듈은 북동방향, 제3 모듈은 동쪽 방향, 제4 모듈는 북서방향, 제5 모듈은 센터방향, 제6 모듈은 동남방향, 제7 모듈은 서쪽방향, 제8 모듈은 서남방향, 제9 모듈은 남쪽방향을 향하도록 위치 제어될 수 있는 것이다. 이로써, 발전소 전체 모듈의 위도 및 경도에 따른 최적의 위치 제어가 가능해진다. 도 3은 본 발명의 바람직한 실시 예에 따른 딥러닝의 비선형 회귀 분석 알고리즘도이다. 훈련 데이터 세트는 전류량 및 전력센싱량을 이용해 마련된다. 딥러닝은 훈련 데이터 세트를 입력받아 여기에 비선형 회귀(non-linear regression) 학습 알고리즘을 적용시킨다. 다음으로 딥러닝은 입력데이터와 학습 알고리즘을 통해 얻어진 다양한 케이스에 대한 패턴을 추출 하여 예측값 데이터로 출력한다. 각각의 세부모듈은 실장된 전류센서(CT)를 통해 발전전력량을 상호 비교하고, 검출된 센서별로 발전량의 트렌드 를 획득할 수 있게 된다. 이와 같은 결과가 도 4에 도시된다. 도 4는 본 발명의 바람직한 실시 예에 따른 전류센싱형 모듈별 발전량 그래프이다. 딥러닝은 학습 알고리즘을 통해 학습이 진행될 수록 년간 발전량이 향상됨을 확인할 수 있다. 도 5는 본 발명의 구체적 실시예에 따른 흐름도이다. 전류량에 따른 태양관 모듈 최적위치 제어방법은, 1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각에서 개별전류량을 측정 하는 단계; 다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전류량 및 상기 세부모듈의 평균전류량을 산출하는 단계; 상기 총합전류량을 목표전류량과 비교하는 단계; 상기 총합전 류량이 상기 목표전류량보다 작은 경우, 다수개의 상기 세부모듈의 개별전류량을 상기 평균전류량과 각각 비교 하는 단계; 및 상기 개별전류량이 상기 평균전류량보다 작은 상기 세부모듈의 각도를 변경하는 단계; 를 포함한 다. 상기 각도 변경은 상기 세부모듈의 대향면 각도가 최고일조량이 가능한 각도로 변경될 수 있다. 이를 위해 태양 광 모듈로으로부터 데이터를 취득하거나, 태양광 모듈을 제어하기 위한 태양광 관리서버의 역할이 필요하다. 상 기 최고일조량을 위한 상기 세부모듈의 대향면 각도는 관리서버로부터 송출받으며, 상기 관리서버는 상기 세부 모듈의 대향면 각도 변경을 위해 필요한 요구전력량이 상기 세부모듈의 대향면 각도 변경을 통해 일정기간 동안 획득할 수 있는 획득전력량을 비교하고, 상기 전력량 비교결과 마이너스 인 경우, 상기 세부모듈의 대향면 각도 변경을 하지 않고, 상기 최고일조량은 NxN개의 상기 세부모듈 각각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회기분석 알고리듬이 적용되는 인공지능 딥러닝 학 습으로 결정될 수 있다. 또다른 전류량에 따른 태양관 모듈 최적위치 제어방법은 1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각 에서 개별전류량을 측정 하는 단계; 다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전 류량 및 상기 세부모듈의 평균전류량을 산출하는 단계; 상기 총합전류량을 목표전류량과 비교하는 단계; 상기 총합전류량이 상기 목표전류량보다 큰 경우, 상기 총합전류량을 관리서버로 송출해서 상기 목표전류량을 조정하 는 단계;를 포함한다. 다수개의 상기 세부모듈은 NxN개이고, 상기 조정된 목표전류량은 최고일조량일 때 산출된 값이며, 상기 최고일조량은 NxN개의 상기 세부모듈 각각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍 속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회기분석 알고리듬이 적용되는 인공지능 딥러닝 학습으로 결 정될 수 있다. 또다른 전류량에 따른 태양관 모듈 최적위치 제어방법은, 경제적 최적각도의 산출에 관한 것이다. 경제적 최적 각도란, 태양광 모듈로부터 획득되거나 획득될 전력량과 태양광 모듈의 각도를 변경하기 위해 소모되는 전력량 을 비교해 경제적인 관점에서 마이너스가 되지 않는 최적각도를 의미한다. 이를 위한 최적일조량은 세부모듈의 대향면 각도가 경제적 최적각도일 때의 일조량이며, 경제적 최적각도에서 최적일조량이 산출될 수 있고, 반대로 최적일조량으로부터 경제적 최적각도가 산출될 수도 있다. 즉, 1개의 태양광 키모듈을 이루는 다수개의 세부모듈 각각에서 개별전류량을 측정 하는 단계; 다수개의 상기 세부모듈의 개별전류량로부터 상기 태양광 키모듈의 총합전류량 및 상기 세부모듈의 평균전류량을 산출하는 단 계; 상기 총합전류량을 목표전류량과 비교하는 단계; 상기 총합전류량이 상기 목표전류량보다 작은 경우, 다수개의 상기 세부모듈의 개별전류량을 상기 평균전류량과 각각 비교하는 단계; 및 상기 개별전류량이 상기 평균전 류량보다 작은 상기 세부모듈에 대한 경제적 최적각도로 변경되는 단계;를 포함하며, 다수개의 상기 세부모듈은 NxN개이며, 상기 경제적 최적각도로의 변경은 상기 세부모듈의 대향면 각도가 최적일조량이 가능한 각도 및 상 기 경제적 최적각도로의 변경에 필요한 요구전략량에 의해 결정될 수 있다. 상기 최적일조량을 위한 상기 세부모듈의 경제적 최적각도는 관리서버로부터 송출받으며, 상기 관리서버는 상기 세부모듈의 대향면 각도 변경을 위해 필요한 요구전력량이 상기 세부모듈의 대향면 각도 변경을 통해 일정기간 동안 획득할 수 있는 획득전력량을 비교하고, 상기 관리서버는 상기 전력량 비교결과 마이너스 인 경우, 상기 세부모듈의 대향면 각도 변경을 하지 않으며, 상기 관리서버는 상기 전력량 비교결과 플러스가 되는 경제적 최 적각도를 찾아 상기 세부모듈이 변경될 각도로 지정하는 상기 최적일조량은 NxN개의 상기 세부모듈 각각의 방향 또는 위치를 일, 주, 월, 또는 계절 단위로 풍속 및 풍향에 추가로 획득한 전류량에 대한 비선형 회기분석 알고 리듬이 적용되는 인공지능 딥러닝 학습으로 결정할 수 있다."}
{"patent_id": "10-2020-0068045", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 흐름도이다. 도 2(a)는 본 발명의 바람직한 실시 예에 따른 태양광 모듈의 사시도이며, 도 2(b)는 본 발명의 바람직한 실시 예에 따른 태양광 모듈의 세부 구조도이다. 도 3은 본 발명의 바람직한 실시 예에 따른 딥러닝의 비선형 회귀 분석 알고리즘도이다.도 4는 본 발명의 바람직한 실시 예에 따른 전류센싱형 모듈별 발전량 그래프이다. 도 5는 본 발명의 구체적 실시예에 따른 흐름도이다."}
