{"patent_id": "10-2023-0161581", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0054213", "출원번호": "10-2023-0161581", "발명의 명칭": "데이터 기반 개인 맞춤형 식단제공을 통한 혈당관리방법 및 시스템", "출원인": "주식회사 쿡플레이", "발명자": "신민선"}}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "데이터에 기반한 개인 맞춤형 식단제공을 통해 혈당을 관리하는 방법에 있어서, 사용자로부터 입력된 개인정보를 서버에 저장하고 관리하는 단계;사용자의 개인정보에 기반하여 제1 식단을 구성하는 단계;제품 보존 온도를 유지하도록 배송을 관리하는 단계;배송완료 후 모바일 단말을 통해 식이 가이드를 제공하는 단계;섭취완료 후 개인 피드백 정보를 상기 모바일 단말을 통해 획득하는 단계;상기 개인 피드백 정보에 기초하여 데이터를 학습하고 인공지능 알고리즘에 의해 영양소별 혈당을 예측하는 단계;영양소별 혈당 반응도를 결정하는 단계; 및개인마다 결정된 영양소별 혈당 반응도에 따라 조정된 제2 식단을 구성하는 단계;를 포함하는 것을 특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리 방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 사용자로부터 입력된 개인정보는 생년월일, 주소, 연락처, BMI, 활동정보, 질환정보, 취향정보 가운데 적어도하나 이상을 포함하는 것을 특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 제품 보존 온도를 유지하도록 배송을 관리하는 단계는, 상기 서버에서 기상청으로부터 전송된 날씨정보, 배송 예상소요시간을 기초로 하여 온도 유지를 위해 투입된 얼음의 얼음량을 결정하고 배송을 요청하는 단계; 택배사로부터 배송사진 및 배송완료시간을 수신하는 단계; 사용자로부터 실제 픽업한 시간 및 잔여 얼음량을 입력받는 단계; 및 입력된 데이터를 학습하여 적정 얼음량을 산출하고 다음 배송일에 적용하는 단계;를 포함하는 것을 특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 배송완료 후 모바일 단말을 통해 식이 가이드를 제공하는 단계는, 사용자로부터 식사시작 동작이 입력되면 애피타이저 섭취를 안내하는 단계; 정해진 시간이 경과되면 사용자가섭취를 중단하고 휴지시간을 갖도록 상기 취향정보에 따라 자동 매칭된 영상이 재생되도록 하는 단계; 및 재생이 종료되면 잔여 식사시간을 표시하여 사용자의 섭취시간을 관리 단계;를 포함하는 개인 맞춤형 식단을 통한혈당 관리방법.공개특허 10-2024-0054213-3-청구항 5 제1항에 있어서, 상기 개인 피드백 정보는, 실제 픽업한 시간, 잔여 얼음량, 활동정보, 섭취량 및 영양성분 히스토리 데이터, 혈당데이터, 보조지표로 활용되는 인지반응도검사 데이터 가운데 적어도 하나이상을 포함하는 것을 특징으로 하는개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 섭취량 데이터는 배송된 식단 또는 배송된 식단을 구성하는 각 음식별 섭취량의 비율이거나 무게인 것을특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 무게는 섭취 전후의 배송된 식단 또는 배송된 식단을 구성하는 각 음식별 무게를 블루투스 통신이 가능한저울로 측정하여 사용자 단말 어플리케이션을 통해 서버에 전송, 저장되도록 한 것을 특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서, 상기 보조지표로 활용되는 인지반응도검사 데이터는 정해진 시간에 사용자 단말에 현재 신체상태에 대한 질문이팝업되도록 하고, 5점 척도가운데 3점이상 항목이 3개 이상이면 혈당반응이 높은것으로 판단하는 보조지표로 활용하는 것을 특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 개인 피드백 정보에 기초하여 데이터를 학습하고 인공지능 알고리즘에 의해 영양소별 혈당을 예측하는 단계는, 식사 후 측정한 혈당값과 섭취한 영양성분(탄수화물, 단백질, 지방)의 누적데이터를 회귀분석을 통해 혈당 예측공식을 도출하여 한 후, 각 영양소별 동일한 양을 섭취했다고 가정할 때의 혈당값을 예측하는 특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 영양소별 혈당 반응도를 결정하는 단계는,개별 탄수화물, 단백질 및 지방 혈당예측값을, 탄수화물, 단백질 및 지방 혈당예측값을 평균한 값으로 각각 나누는 단계인 것을 특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리방법.공개특허 10-2024-0054213-4-청구항 11 제1항에 있어서, 상기 개인마다 결정된 영양소별 혈당 반응도에 따라 조정된 제2 식단을 구성하는 단계는,결정된 영양소별 혈당 반응도의 소수점 첫째 자리에서 5 이상이면 반올림하고 아니면 버림하여 개인별 BMI에 기초한 11단위 내에서 개별 탄수화물, 단백질, 지방의 단위수가 조정된 제2 식단을 구성하는 것을 특징으로 하는개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 개인별 혈당반응도에 따라 제공된 제 2식단에 활동대사량을 추가로 고려한 제 3식단을 더 제공하는 것을 특징으로 하는 개인 맞춤형 식단을 통한 혈당 관리방법."}
{"patent_id": "10-2023-0161581", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 데이터 기반 개인 맞춤형 식단을 통한 혈당관리 방법 및 시스템에 관한 것이다. 구체적으로는 사용자 가 입력한 개인정보를 서버에 저장하고 관리하는 단계; 사용자가 입력한 개인정보에 기반하여 제1 식단을 구성하 는 단계; 제품 보존 온도를 유지하도록 배송을 관리하는 단계; 배송완료 후 모바일 단말을 통해 식이 가이드하는 단계; 식사완료 후 개인 피드백 정보를 획득하는 단계; 상기 피드백 정보에 기초하여 데이터를 학습하고 인공지 능 알고리즘에 의해 영양소별 혈당을 예측하는 단계; 영양소별 혈당 반응도를 결정하는 단계; 개인마다 결정된 영양소별 혈당 반응도에 따라 조정된 제2 식단을 구성하는 단계;를 포함하여 조정된 개인 맞춤형 식단을 제공하 여 일일 필수 칼로리 및 영양소를 섭취하면서 적정 혈당을 유지하도록 하는 혈당관리방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-0161581", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 개인 데이터 기반 맞춤형 식단을 통해 혈당을 관리하는 방법 및 시스템에 관한 것으로, 좀 더 구체적 으로는, 음식섭취 전후 모바일 단말을 통해 획득한 개인 혈당 등 의료 및 건강정보, 운동, 수면 등 생활정보, 식단 및 음식섭취 관련 데이터에 기반하여 조정된 개인 맞춤형 식단을 제공하여 일일 필수 칼로리 및 영양소를 섭취하면서도 적정 혈당을 유지하도록 하는 혈당관리방법에 관한 것이다."}
{"patent_id": "10-2023-0161581", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "당뇨병은 대사질환의 일종으로 체내 인슐린 분비량이 부족하거나, 인슐린이 제때 기능을 하지 못해 혈중 포도당 농도(혈당)가 높아지는 질환이다. 인슐린은 췌장에서 분비돼 식사 후 올라간 혈당을 낮추는 역할을 한다. 그런데 유전, 생활습관 및 기타 질병 원인으로 인슐린 분비에 문제가 생기면 체내로 흡수된 포도당이 이용되지 못하고 혈액에 쌓여 소변을 통해 빠져나오게 되므로 혈당관리가 되지 않아, 병이 깊어지면, 뇌졸증, 심근경색, 고혈압 등 성인병 뿐 아니라 망막병증, 신기능장애, 신경병증, 심혈관계질환 등 다양한 합병증으로 전개된다는 문제가 있다. 한국개발연구원이 2013년도에 발표한 '고령화를 준비하는 건강보험 정책의 방향' 보고서에 따르면, 국내의 30세 이상 10명 중 1명, 65세 이상에서는 5명 중 1명이 당뇨를 앓고 있는 것으로 보고되고 있으며, 이는 고령화 사회 와 생활습관의 변화에 따른 지속적인 증가 추세에 있어, 사회적 문제로 대두되고 있는 실정이다. 최근 청소년과 20~30대 젊은층에서 '예비 당뇨병 환자'와 관련하여 미국 질병통제예방센터(CDC) 발표에서는 미 국 내 12~34세 5명중 1명이 당뇨병 전단계로 분류하고 있고 국내 조사(강원대병원 조은희 교수 연구팀 국맨건강 영양조사 데이터 분석 결과)에서도 10대와 20대 모두 시간이 지날수록 당뇨병 전단계 유병률이 증가하고 있다는 사실에서, 당뇨병 전단계를 진단받은 청소년과 젊은 층은 혈당 관리가 이뤄지지 않으면, 향후 제2형 당뇨병 유 병률이 증가할 수 밖에 없다는 우려를 나타내고 있는 실정이다. 당뇨병은 한번 발병하면 치료가 어렵고 평생 관리를 해야 하는 질병이고, 특히 소아청소년층의 당뇨는 투약할 수 있는 약물이 제한적이고, 대부분의 항당뇨병제는 성인 위주라 당뇨병 전단계에서 운동 및 식단관리를 하는 등 생활습관 교정을 통해서 예방관리하는 것이 무엇보다도 중요하다는게 전문가들의 의견이다. 실제 삼성서울병원 당뇨병센터에서 당뇨병 환자 1466명을 대상으로 조사한 결과에 따르면, 응답자 1117명 (76.2%)은 영양이 불균형한 식사를 하고 있는 것으로 나타났다. 또한 당뇨병 환자 일부는 이미 약으로 질환을 조절하고 있기 때문에 식사요법이 필요하지 않다고 생각하기도 한다. 이런 다양한 이유에서 2014년 국민건강통 계에서 확인된 것처럼 실제로 당뇨병 환자의 혈당 조절률은 25.3%에 그친다. 하지만 대부분의 전문가들은 식사요법은 약물치료만큰 중요하다고 강조하고 있고, 평소 섭취하는 음식을 통해 혈당이 과도하게 높아지지 않도록 관리해야 한다고 설명한다. 일반적으로 권장되는 혈당관리 식사는 (1단계)표 준체중을 구하고 하루에 필요하는 열량을 계산하고. (2단계)각자 필요한 열량에 따라 곡류, 어육류, 채소, 지방, 우유, 과일 등 식품군에서 필수 영양균의 섭취 비율을 고려하여 식품을 선택하고, (3단계) 하루 끼니별 섭취량을 결정하여 식단을 구성하고 실행에 옮기도록 하는 것이다. 여기에 체질별 권장음식과 피해야할 음식을 고려하고 식사요법 및 운동요법에 관한 가이드라인을 정하고 있으나, 그대로 실천하기는 매우 어려운 것이다. 이밖에 만성질환의 관리를 위해 매일 일정 횟수 혈당을 측정하 고 기록하고 관리한다는 것 또한 시간에 맞춰 실행하기는 매우 어렵기 때문에 혈당관리, 당뇨질환 관리에 대한 어려움을 토로하는 이유가 그것이다. 이를 위해 최근 IT기술의 발달로 모바일 서비스를 이용한 자가 혈당 관리 기술들이 시도되고 있다. 스마트폰 기 반의 혈당 관리 시스템은 혈당 측정부터 검사 결과 확인, 자기 평가, 자기 반응 등의 전체 과정을 간편하고 효 율적으로 기록, 관리할 수 있는 것으로 다양한 어플리케이션이 개발되고 제공되고 있으며, 계속해서 당뇨환자 관리용 병원 데이터베이스를 구축하고 병원과 연계한 당뇨관리 서비스를 지원하는 프로그램도 개발되고 있는 상 황이다. 섭취 음식 및 식단관리에 있어서도, 개인별 맞춤형 건강관리 서비스를 제공할 수 있는 플랫폼의 형태를 갖추고 있으며, 자세하게는 무선 통신 기능이 있는 혈당측정기를 사용해 식사량, 인슐린 투여량 정보, 섭취 음식에 따 른 저혈당이나 고혈당의 변화 모니터링 시각화 기능, 스마트폰 앱 사진과 같은 이미지 인식 및 인공지능으로 칼 로리를 자동으로 계산하는 모바일 플랫폼, 개인별로 입력되는 정보에 맞춰 당질을 낮춘 반조리 형태의 밀키트를 집까지 배송하는 당뇨 식단 서비스 및 모바일을 통해 개인 혈당 기록, 커뮤니티 활동, 관련 의료기기 및 소모품 구매활동을 기술적으로 지원하는 등 다양한 편의기능을 포함하는 어플리케이션이 개발되어 제공되고 있다. 그럼에도 불구하고, 개인이 식사전후 실시간 변화하는 혈당반응과 일일 활동대사량에 맞춰 적정 영양과 칼로리 를 고려한 균형잡힌 식단을 관리하고 섭취요령에 맞게 실행에 옮기기에는 한계가 있는 것이다. 이를 위해 우리나라 등록특허 10-1284882호(의료정보 연동을 통한 혈당 관리 어플리케이션 서비스 시스템 및 그 방법)에서는 네트워크를 통해 개인 건강관리 서비스 단말기와 병원서버는 의료정보를 교환하도록 하고 의료정보 에 따라 단말기에 설치된 어플리케이션에서는 혈당관리, 체중관리, 심/뇌혈관 위험도 관리, 스트레스 관리, 운 동관리 및 영양관리를 제공하는 시스템을 제시하고 있다. 또한, 한국 등록특허 10-1259130호 (모바일 기반의 개인 맞춤형 추천식품 제공시스템 및 그 제공방법)에서는 개인의 신체 특징(나이,성별,신장,체중,허리둘레 등) 및 건강이력(혈압,혈당,임신,수유,질환 등)뿐만 아니라 모발분석(무기질 및 중금속)에 의해 개인의 비만 및 건 강상태를 파악하여 모바일(스마트폰 등)을 기반으로 개인마다 가장 알맞은 식품을 추천하고 이 추천된 식품을 이용하여 개인 맞춤형 식단을 제공함으로써 장소 및 시간의 제약을 받지 않고 언제 어디서나 손쉽고 편리하게 서비스를 이용할 수 있도록 한 모바일 기반의 맞춤형 추천식품 제공시스템을 제시하였다. 그러나, 이러한 종래 기술에서는 개인 건강정보, 의료정보 연동을 통해 혈당 관리, 위험도 계산, 비만도 측정 등 다양한 혈당 관리 목적의 수치를 계산하거나 기록하는 것에 집중되어 있고, 개인 체질에 맞는 식단을 생성하 여 제공하는 기능만을 포함하고 있는 것으로, 섭취하는 음식 및 포함된 영양소에 대한 혈당데이터를 학습하고 계량화하여 혈당에 미치는 영향정도를 계산한 결과에 근거하여 영양소별 정량단위를 선택 조정된 맞춤형 식단을 배송하고, 섭취방법을 가이드하여 전문가의 도움 없이도 손쉽게 혈당을 관리할 수 있도록 하는 방법 및 시스템 에 대해서는 전혀 개시하고 있지 않다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허 제10-1284882호(2013.07.04 등록, 발명의 명칭 : 의료정보 연동을 통한 혈당 관 리 어플리케이션 서비스 시스템 및 그 방법(blood sugar management application service system interworking medical information and the mehtod thereof)) (특허문헌 0002) 한국 등록특허 10-1259130호 (2013.04.23 등록, 발명의 명칭 : 모바일 기반의 개인 맞춤형 추 천식품 제공시스템 및 그 제공방법(system for providing personalized recommended food based on mobile andproviding method using the same))"}
{"patent_id": "10-2023-0161581", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위하여 창출된 것으로, 본 발명의 목적은, 임신성 당뇨를 포함한 당뇨질환 자뿐 아니라, 예비당뇨 질환자와 같이 혈당 유지관리가 필요한 그룹군에 칼로리만을 고려한 정형화된 혈당 식단 이 아닌 인공지능에 의해 식재료별 영양소별 혈당반응을 모니터링 및 계량화하여 환산한 결과값에 따라 세밀하 게 조정된 식단을 제공하는 혈당관리시스템을 제공하는 것이다. 또한 본 발명은 자발적으로 식단을 관리하고 섭취하는 것이 어려운 사용자를 대상으로 과잉 섭취를 방지하도록 적정 칼로리 및 적정 섭취량을 계산하여 밀키트를 배송하고, 짧은 시간 내 혈당이 급증하는 것을 방지하도록 섭 취방법 및 식습관에 대해서도 관리할 수 있도록 설계된 솔루션을 제공하는 것이다. 또한 본 발명은 사용자 위치정보, 날씨정보, 배송 예상/실제 도착 시간데이터에 따라 최적의 온도유지를 위한 얼음량을 산출, 조정하여 불필요한 낭비와 무게를 줄이고 배송 제품의 품질을 유지할 수 있도록 배송관리하는 시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0161581", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위한 본 발명의 바람직한 실시예에 따른 개인 맞춤형 식단제공을 통해 혈당을 관리하는 방법 및 시스템은, 사용자로부터 입력된 개인정보와 외부장치를 통해 입력된 정보를 서버에 데이터베이스로 저 장 관리하는 단계; 입력된 여러 데이터에 기반하여 제1 식단을 구성하는 단계; 적정 얼음량을 계산하여 사용자 에 전달되는 제품 보존 온도를 유지하도록 배송을 관리하는 단계; 배송완료 후 모바일 단말을 통해 식이 가이드 를 제공하는 단계; 배송된 식단 섭취완료 후 피드백 정보를 상기 모바일 단말을 통해 획득하는 단계; 상기 피드 백정보에 기초하여 데이터를 학습하고 인공지능 알고리즘에 의해 영양소별 혈당을 예측하는 단계; 영양소별 혈 당 반응도를 결정하는 단계; 개인마다 결정된 영양소별 혈당 반응도에 따라 양양소가 조정된 제2 식단을 구성하 는 단계;를 포함한다. 일 실시예에서, 상기 배송 관리 단계는 배송을 요청한 고객의 위치에 대한 예상 배송 시간 및 실제 도착시간정 보, 날씨정보, 잔여 얼음량 데이터를 학습하고 인공지능 알고리즘을 통해 해당 배송일에 대한 최적의 얼음량을 계산하여 패키징에 적용하도록 하여 낭비되는 얼음 없이 배송시간동안 필요한 온도를 유지하도록 하는 것이다. 일 실시예에서, 상기 식이가이드 단계는 올바른 섭취방법을 그대로 실천하기어렵거나 스스로 식이관리가 어려운 고객에 대해 모바일 어플리케이션을 통해 애피타이저 섭취 후 휴지기간을 갖도록 취향에 매칭되는 영상을 자동 재생하여 시청토록 하고 및 주식과 반찬등의 섭취순서나 섭취속도를 안내하여 적정 식사속도를 유지하므로 혈당 이 빠르게 증가하여 혈당스파이크가 발생되는 것을 방지하고자 하는 것이다. 일 실시예에서, 상기 영양소별 혈당 예측 및 반응도를 결정하는 단계는, 같은 식단 및 식재료에 대해서도 사용 자 마다 다른 혈당반응을 나타낼 수 있기 때문에, 식사 후 혈당 피드백 데이터를 학습시켜 영양소별(탄수화물, 단백질, 지방) 혈당 예측값을 도출하고 평균값 대비 각 영양소별 혈당예측값이 차지하는 비율에 따라 혈당반응 도를 결정하는 것이다. 일 실시예에서, 상기 각 영양소별 혈당 반응도에 따라 조정된 제2 식단을 구성하는 단계는, 산출된 혈당 반응도 를 기초대사량을 고려하여 설정한 총 11단위(1,000kcal) 범위내에서 적정한 단위로 환산하여 조정 식단을 재구 성하는 것으로 혈당이 유지 관리되도록 하는 것이다. 한편, 본 발명의 바람직한 실시예에 따른, 개인 맞춤형 식단을 통한 혈당 관리 방법은, 데이터에 기반한 개인 맞춤형 식단제공을 통해 혈당을 관리하는 방법으로서, 사용자로부터 입력된 개인정보를 서버에 저장하고 관리하 는 단계; 사용자의 개인정보에 기반하여 제1 식단을 구성하는 단계; 제품 보존 온도를 유지하도록 배송을 관리 하는 단계; 배송완료 후 모바일 단말을 통해 식이 가이드를 제공하는 단계; 섭취완료 후 개인 피드백 정보를 상 기 모바일 단말을 통해 획득하는 단계; 상기 개인 피드백 정보에 기초하여 데이터를 학습하고 인공지능 알고리 즘에 의해 영양소별 혈당을 예측하는 단계; 영양소별 혈당 반응도를 결정하는 단계; 및 개인마다 결정된 영양소별 혈당 반응도에 따라 조정된 제2 식단을 구성하는 단계;를 포함한다. 또한, 사용자로부터 입력된 개인정보는 생년월일, 주소, 연락처, BMI, 활동정보, 질환정보, 취향정보 가운데 적 어도 하나 이상을 포함할 수 있다. 또한, 상기 제품 보존 온도를 유지하도록 배송을 관리하는 단계는, 상기 서버에서 기상청으로부터 전송된 날씨 정보, 배송 예상소요시간을 기초로 하여 온도 유지를 위해 투입된 얼음의 얼음량을 결정하고 배송을 요청하는 단계; 택배사로부터 배송사진 및 배송완료시간을 수신하는 단계; 사용자로부터 실제 픽업한 시간 및 잔여 얼음 량을 입력받는 단계; 및 입력된 데이터를 학습하여 적정 얼음량을 산출하고 다음 배송일에 적용하는 단계;를 포 함할 수 있다. 또한, 상기 배송완료 후 모바일 단말을 통해 식이 가이드를 제공하는 단계는, 사용자로부터 식사시작 동작이 입 력되면 애피타이저 섭취를 안내하는 단계; 정해진 시간이 경과되면 사용자가 섭취를 중단하고 휴지시간을 갖도 록 상기 취향정보에 따라 자동 매칭된 영상이 재생되도록 하는 단계; 및 재생이 종료되면 잔여 식사시간을 표시 하여 사용자의 섭취시간을 관리 단계;를 포함할 수 있다. 또한, 상기 개인 피드백 정보는, 실제 픽업한 시간, 잔여 얼음량, 활동정보, 섭취량 및 영양성분 히스토리 데이 터, 혈당데이터, 보조지표로 활용되는 인지반응도검사 데이터 가운데 적어도 하나이상을 포함할 수 있다. 또한, 상기 섭취량 데이터는 배송된 식단 또는 배송된 식단을 구성하는 각 음식별 섭취량의 비율이거나 무게일 수 있다. 또한, 상기 무게는 섭취 전후의 배송된 식단 또는 배송된 식단을 구성하는 각 음식별 무게를 블루투스 통신이 가능한 저울로 측정하여 사용자 단말 어플리케이션을 통해 서버에 전송, 저장되도록 한 것이다. 또한, 상기 보조지표로 활용되는 인지반응도검사 데이터는 정해진 시간에 사용자 단말에 현재 신체상태에 대한 질문이 팝업되도록 하고, 5점 척도 가운데 3점이상 항목이 3개 이상이면 혈당반응이 높은 것으로 판단하는 보조 지표로 활용할 수 있다. 또한, 상기 개인 피드백 정보에 기초하여 데이터를 학습하고 인공지능 알고리즘에 의해 영양소별 혈당을 예측하 는 단계는, 식사 후 측정한 혈당값과 섭취한 영양성분(탄수화물, 단백질, 지방)의 누적데이터를 회귀분석을 통 해 혈당 예측공식을 도출하여 한 후, 각 영양소별 동일한 양을 섭취했다고 가정할 때의 혈당값을 예측하는 것이다. 또한, 상기 영양소별 혈당 반응도를 결정하는 단계는, 개별 탄수화물, 단백질 및 지방 혈당예측값을, 탄수화물, 단백질 및 지방 혈당예측값을 평균한 값으로 각각 나누는 단계이다. 또한, 상기 개인마다 결정된 영양소별 혈당 반응도에 따라 조정된 제2 식단을 구성하는 단계는, 결정된 영양소 별 혈당 반응도의 소수점 첫째 자리에서 5 이상이면 반올림하고 아니면 버림하여 개인별 BMI에 기초한 11단위 내에서 개별 탄수화물, 단백질, 지방의 단위수가 조정된 제2 식단을 구성할 수 있다. 또한, 개인별 혈당반응도에 따라 제공된 제 2식단에 활동대사량을 추가로 고려한 제 3식단을 더 제공할 수 있다."}
{"patent_id": "10-2023-0161581", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 바람직한 실시예에 따른 개인 맞춤형 식단을 제공하여 혈당을 관리하는 방법 및 시스템은, 기존 당뇨 환자, 예비 당뇨 질환자 등 식단관리가 필수인 사용자 스스로 내 몸의 상태에 맞는 식단을 선택하기 어려운 사 람들에게 개인이 섭취하는 음식에 반응하는 개인 피드백 정보에 기초하여 데이터를 학습하고 인공지능 알고리즘 에 의해 조정된 식단을 제공하므로 자동으로 개인 신체지수에 맞는 칼로리는 유지하면서 혈당 급증을 예방하고 적정수준으로 유지할 수 있도록 할 수 있다. 또한, 본 발명은 실제 병원이 제공하는 일괄식 처방이나 기존 서비스와는 다르게 식단 제공 후 식이가이드를 제 공하여 올바른 식습관 교정이 이루어지도록 하는 효과가 있다. 또한, 본 발명은 사용자 위치, 배송 도착시간, 실제 픽업시간, 날씨 및 잔여 얼음량 데이터에 기초하여 배송식 품에 대한 온도 유지에 필요한 적정 얼음량을 계산하여 패키징하므로 불필요한 무게의 증가, 소요되는 원료의낭비를 방지하는 효과도 있는 것이다."}
{"patent_id": "10-2023-0161581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하면서 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 이에 앞서, 본 명 세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니 되며, 발 명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙 에 입각하여, 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서, 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시예에 불과할 뿐이 고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양 한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다. 도 1은 본 발명의 바람직한 실시예에 따른 데이터 기반 개인 맞춤형 식단을 통한 혈당관리 시스템을 개략적으로 나타낸다. *도 1을 참조하면, 본 발명에 따른 데이터 기반 개인 맞춤형 식단을 통한 혈당관리 시스템은 식단관리 서버 , 고객 단말, 병원단말, 트레이너 단말, 택배사단말, 외부장치를 무선으로 연결 하는 무선통신망 을 포함한다. 상기 무선통신망을 통해 식단관리 서버는 상기 고객단말, 병원단말, 트레이너단말, 택배사단말 및 외부장치로부터 개인 건강정보, 생활정보, 운동량 정보, 배송관련 정보 등과 같은 각종 데이터를 입력받아 저장하고 누적데이터를 학습하여 고객의 현재 상태에 맞게 영양소가 조정된 식단을 구성하여 배송하고 섭취방법을 가이드하는 기능을 포함하게 된다. 여기서, \"고객\"이라는 것은 본 발명의 바람직한 실시예에 따른 데이터 기반 개인 맞춤형 식단을 통한 혈당관리 시스템에 따라 제공되는 서비스의 \"고객\"을 의미하며, 필요한 경우, 상세한 설명에서는 시스템의 \"사용자\" 또는 앱의 \"사용자\"라는 관점에서, \"사용자\"라는 표현도 \"고객\"이라는 표현과 혼용하여 사용한다. \"사용자\"와 \"고 객\"을 개별로 지칭할 때는, 그 의미를 잘 드러낼 수 있도록, \"개인\"이라도 표현도 혼용하여 사용한다. 도 2는 본 발명에 따른 개인 맞춤형 식단을 통한 혈당관리 시스템의 구성도를 나타낸다. 도 2를 참조하면, 본 발명에 따른 상기 개인 맞춤형 식단을 통한 혈당관리 시스템의 구성을 구체적으로 설명하 면, 식단관리 서버는 관리서버, 분석서버, 데이터서버을 포함하고, 고객단말은 개인 정보저장부, 제어수단, 통신수단을 포함하고, 병원단말은 입력수단, 의료DB제어 수단, 통신수단, 출력수단을 포함하고, 트레이너단말은 운동DB, 제어수단, 통신수단을 포함하고, 배송사 단말은 배송DB, 제어수단, 통신수단, GPS을 포함하며, 고객단말과 연동되는 외부장치는 주방가전, 측정수단, 생활가전을 포함할 수 있 다. 상기 식단관리 서버의 관리서버는 신규 및 기존 고객 회원정보의 변동사항을 저장 관리하는 회원관리 부, 회비 관련 결제정보를 저장하고 관리하는 결제모듈, 회원 각각의 취향, 개인건강상태, 생활습관 등 기초정보와 영양사 상담결과에 따라 맞춤형으로 구성된 식단정보를 기록하고 관리하는 식단주문관리부, 고객의 주문 및 위치정보와 요청정보에 따라 조리시작 및 완료시간, 배송 시작 및 완료시간, 실제 픽업시간에 관한 정보, 패키징 얼음량에 관한 정보, 담당 배송사 정보 등 배송과 연관된 데이터를 저장, 관리하는 배송관리 부를 포함 한다. 상기 분석서버는 상기 고객단말을 통해 입력된 고객의 현재 키, 몸무게와 같 은 체질지수(BMI)와 연령을 포함하는 기초정보와 각종 의료정보, 운동정보, 수면시간을 포함하는 생활정보, 혈 당정보 등을 토대로 필요한 칼로리와 영양소별 혈당반응도를 분석하는 분석모듈, 분석결과에 기초하여 개 인별로 적절한 영양소 함량을 조정하여 식단을 구성하는 조정모듈을 포함한다. 특히 상기 분석모듈은 초기 정보를 토대로 제공된 제1 식단 섭취 후 모바일 단말을 통해 피드백되는 혈당정보, 섭취량, 활동량 정보를 통해 영양소 단위수(함량)가 조정될 뿐 아니라 기초대사량 대비 활동대사량을 고려한 일일 소모칼로리를 계산하 여 보충해야할 적정 섭취 칼로리를 고려한 제2 식단을 제공할 수 있다. 데이터서버는 개인별 초기 회원가입정보, 키, 몸무게 등 신체정보, 의료정보, 생활패턴 및 운동정보등을 포함하는 개인정보DB, 식재료 및 식단에 포함되는 영양소 함량이 매칭되어 있는 영양DB, 곡류군, 어 육류군, 지방군, 우유군, 과일군, 야채군 등 분류 관리되는 식재료DB, 주식과 반찬을 포함하고 임신당뇨식, 당뇨식, 저염식으로 구성된 1만여개 식단이 포함된 메뉴DB로 구성된다. 그 밖에 상기 식단관리 서버와 무선통신망을 통해 데이터를 송수신하는 외부구성으로 어플리케이션을 통해 회원가입정보외 각종 건강정보, 운동정보, 혈당정보 등 개인정보를 입력하는 고객단말이 있으며, 상 기 고객단말은 영양소 단위수(함량)가 조정된 개인맞춤 식단을 제공하기 위해 필요한 혈당데이터를 생성하 는 측정수단을 구비할 수 있으며, 고객단말은 레시피에 맞는 조리정보 제공을 통해 개인에 맞는 작동 제어가 가능하도록 주방가전과도 연결되며, 식이가이드 상황에서는 상기 고객단말이 아니라, TV와 같 은 생활가전을 통해서도 자연스럽게 영상시청을 유도하여 식이 중간에 인슐린 분비 자극을 유도할 수 있는 휴지기간을 제공하도록 할 수 있다. 또한 상기 고객단말은 고객 정보를 입력, 관리하는 기기로서, 개인 정 보를 포함하는 개인 정보 메뉴와, 내혈당 조절 목표치 정보와, 공복혈당 정보와, 식후혈당 정보와, 취침전 혈당 정보와, 당화혈색소 정보와, 혈압 정보를 포함하는 혈당관리 기능, 정상체중관리정보와, BMI 정보와, 복부 비만 도 정보를 포함하는 체중관리 기능과, 심혈관/뇌혈관 위험도, 스트레스 관리, 운동요법, 영양관리 기능 등을 포 함하는 어플리케이션에 의해 각종 데이터를 기록, 저장, 관리할 수 있는 것이다. 병원단말은 요청에 따른 상기 고객 정보에 매칭되는 의료정보를 제공하는 것으로, 환자의 ID 정보를 매칭 시켜 생성된 각종 질환정보, 검진정보등의 의료 데이터를 일정 포멧으로 표준화하여 저장되는 의료DB를 포 함한다. 구체적으로는 PHR 등 개인건강기록, DICOM 표준의 PACS 등을 포함한 의료정보가 저장되어 있을 수 있다. 트레이너단말은 상기 식단관리 서버를 통해 제공되는 고객별 섭취 칼로리와 소모해야할 칼로리 및 혈 당상태 정보등을 제공받아 개인별로 필요한 운동량과 운동방법을 코칭할 수 있도록 하는 고객관리부와 운 동추천부로 구성된다. 택배사 단말은 상기 식단관리 서버로부터 고객 위치정보를 받아 배송루트와 예상 배송시간을 설정하 고, 도착 시에는 실제 배송완료시간 및 사진을 전송하여 관리하는 배송관리부를 구성하여 고객 요청위치에 보존 온도를 유지하면서 배송품질에 문제없이 정확한 시간에 배송을 완료하도록 데이터를 저장, 관리, 공유하도 록 한다. 도 3는 본 발명에 따른 개인 맞춤형 식단을 통한 혈당관리 시스템의 분석서버 구성을 나타낸다. 도 3를 참조하면, 본 발명에 따른 상기 분석서버 시스템의 구성 및 기능을 설명하면, 상기 분석모듈 에 포함된 구성에서, 개인건강판단부에서는 외부 측정장치 또는 개인 단말에 연결된 측정수단에 의해 측 정된 혈당을 모니터링하여 정상여부를 판정하도록 하고, 또 다른 기능으로는 병원단말의 의료정보를 수신받고 고객단말로부터 입력된 각종 데이터를 종합하여 전체적인 건강상태를 판단할 수 있다. 활동량 판단부는 개인 나이, 키, 몸무게등의 체질지수에 기반한 기본칼로리에 대해 일일 활동에 대한 질문지를 팝업시켜 사용자의 입력정보를 통해 활동량이 계산되도록 하거나 일반적으로 알려진 활동량 계산기를 통해 일일 소모 칼로리를 계산하여 개인별로 섭취해야할 칼로리를 조정 식단 구성 시 고려하도록 하거나 하고, 제공된 식단에 대해 식사 후 식단제품의 잔여무게정보 또는 섭취량에 대한 고객 입려데이터를 함께 고려하여 전체 섭취칼로리를 결정하여 조정 식단에 참고할 수 있도록 한다. 반응도결정부는 고객에 제공된 식단 섭취 후 혈당데이터를 학습시 키고 회귀분석을 통해 필수 영양소인 탄수화물, 지방, 단백질 각각에 대한 혈당 예측값을 산출하고, 영양소별 혈당예측값 각각을 혈당예측값의 평균값으로 나눈 것으로, 개별 영양소의 반응도를 계량화된 수치로 결정하도록 한다. 배송판단부는 최초 상기 식단관리 서버의 배송 요청에 대해 배송사에서 고객 주소정보에 기반한 예 상 배송시간 및 배송루트를 설정하고, 날씨정보에 기초하여 적정 얼음량을 산출하도록 한다. 상기 조정모듈에서는 상기 분석모듈에서 산출된 제공식단에 대한 혈당데이터를 학습한 영양소별 혈당 반응도에 대한 결과값을 고려하여 영양소 조정부는 영양소별 반응도를 조정하기 쉬운 단위로 환산하고, 기초대사량에 기초하여 1,500칼로리에서 2,500칼로리 범위에서 100칼로리 단위로 설정한 총 11단위 범위 내에서 영양소별로 반응도에 따라 환산한 단위수만큼 더하거나 빼도록 하고, 식단 구성부는 고객별 일일 활동량 을 고려하여 소모에너지를 보충하도록 부족한 만큼의 칼로리를 더하여 개인별 필요 칼로리 총량은 유지하도록 하고 개인별 취향이 반영된 식재료, 레시피 및 조리법을 고려한 식단을 생성하는 것을 특징으로 한다. 얼음량 조정부는 상기 배송판단부에서 산출한 실제 배송에 소요되는 시간과, 기존 잔여 얼음량에 대한 데 이터를 고려하고 배송일의 기상청의 날씨정보에 따른 온도임계값을 기준으로 고객 배송지에 대한 적정 얼음량을 산출하여 적용하므로, 더운 여름날 또는 갑작스런 날씨 변동에 대해서도 배송제품의 보존 온도르 유지하여 제품 품질을 확보하고, 불필요하게 많은양의 얼음을 넣어 무게상승에 따른 비용의 지출을 방지하거나 과다한 소모품 의 낭비를 예방할 수 있도록 한다. 일예로 상기 얼음량 조정부의 적정 얼음량 계산은 신선식품 보관 기준 온도를 0도에서 10도 사이로 할 때, 배송시간이 6시간을 초과할 때 마다, 직전 배송얼음 용량의 20%를 추가하여 패키징하고 기상청에서 제공되는 날씨정보에 대해서는 배송일 기준 외부 임계온도(20도)을 20% 초과할때마다 얼 음용량을 10%씩 추가하여 패키징 하도록 설계한 것을 특징으로 하며 초기 6시간 이내 배송거리 및 임계온도 이 내 범위에서 얼음량 600g 기준으로 배송시간 및 날씨에 따른 얼음량 조정과 관련된 실시예는 아래 <표1>을 참고 한다. 표 1 (단위: g) 임계온도 6시간 이내 6시간 후 12시간 후 18시간 후 임계온도 이내 600 720 864 1036 임계온도+20%초과 612 792 950 1140 임계온도+40%초과 726 871 1045 1255 임계온도+60%초과 799 958 1150 1380 임계온도+80%초과 878 1054 1265 1518 임계온도+100%초과 966 1160 1391 1670 상기 상기 얼음량 600g 과 임계온도 20도는 누적 데이터 학습에 의해 변경조정될 수 있고, 적정 얼음량의 설정 은 기존 고흡수성 수지재의 아이스팩을 워터팩, 전분팩, 소금물팩과 같은 친환경 아이스팩으로 대체하는데 1개 당 약 37.9원의 추가 비용이 발생한다는 조사결과 (참고 : 한국소비자원, '친환경 아이스팩 사용 실태조사', 2021. 4)를 근거로 불필요한 폐기물의 발생, 배송무게 경감에 따라 부대비용 절감 등 다양한 기대효과가 예상되 고, 신선식품 배송에서 필수적인 온도유지와 버려지는 아이스팩에 따른 사회적문제에 대한 솔루션이라는 측면에 서, 효과적인 패키징 및 배송관리의 중요성이 대두되고 있기에 시스템을 통한 기술적인 관리가 필요한 것이다. 상기 운동추천부에서는 상기 개인건강판단부와 활동판단부 를 통해서 개인 체질량에 따라 산 출된 기초대사량을 기준으로 식단을 통해 공급된 칼로리 대비 활동량으로부터 소모 칼로리를 계산하여 잉여 에 너지에 대해서는 필요한 운동의 종류와 강도를 설정하여 제시하는 것과, 식사 섭취 후에 혈당 유지관리를 위해 필요한 운동을 사용자 단말 및 연결된 외부 장치를 통해 자동으로 팝업시켜 따라할 수 있도록 제공하는 것을 특 징으로 한다. 도 4는 본 발명에 따른 영양소별 반응도에 따른 식단조정 알고리즘을 나타낸다. 도 4를 참조하면, 본 발명에 따른 상기 영양소별 혈당 반응도 결정 알고리즘 및 식단 조정 알고리즘의 각 단계 별 특징을 구체적으로 설명하면, (S10)단계는 각 영양소별 혈당 예측값을 구하는 단계로 식단 섭취 후 측정된 영양성분 섭취량과 혈당값의 누적데이터를 기계학습 회귀분석을 통해 혈당예측모델(y=β+m1*x1+m2*x2+m3*x3, y:혈당예측값, x1:탄수화물, x2:단백질, x3:지방)을 만든 후 예측모델에 각 영양소별로 100g을 입력하여 탄수화 물 혈당예측(A) = β+m1*100g (if x2=0, x3=0), 단백질 혈당예측(B) = β+m2*100g (if x1=0, x3=0), 지방 혈당 예측(C) = β+m3*100g (if x1=0, x2=0)을 도출할 수 있고, (S20) 단계에서는 각 영양소별 예측치 결과를 탄수 화물, 단백질, 지방 혈당예측치의 평균값(Avg(A+B+C)=(A+B+C)/3)으로 나누어 탄수화물 혈당 반응도 = A / Avg(A+B+C), 단백질 혈당 반응도 = B / Avg(A+B+C), 지방 혈당반응도 = C / Avg(A+B+C) 를 결정한다. (S30)단계에서는 결정된 영양소별 혈당반응도에 대해 조정할 수 있는 (11단위 식단구분 기준)단위로 환산하여 활용하기 위해서 도출된 반응도 결정값이 1보다 크면 반올림하고, 1보다 작으면 O으로 환산하여 조정해 준다. 마지막으로 (S40)단계에서는 각 식단 식재료의 11단위(1,500kcal~2,500kcal) 범위 내에서 결정된 반응도를 환산 하여 식단 내 주식 및 반찬에 포함된 탄수화물, 단백질, 지방에 대한 단위수를 더하거나 빼는 형태로 조절하는 것을 말하며, 예를 들어 결정된 반응도를 환산한 값이 각각 탄수화물=2, 단백질=1, 지방=0 이라고 할 때, 탄수 화물은 -2단위, 단백질은 -1단위, 지방은 열량부족분을 보충하기 위하여 +1로 단위수를 조정하여 식단을 재구성 하도록 하는 것을 특징으로 한다. 도 5는 본 발명에 따른 영양소별 단위수 조정 방법을 나타낸다. 도 5를 참조하면, 본 발명에 따른 영양소별 단위수 조정방법에 있어서, 데이터베이스에 저장된 식단데이터의 기 본단위는 식재료이며, 기본사용량(10g)에 따른 영양소별 함량(g/mg)정보가 포함되어 있다. 메뉴는 식재료의 집 합으로 주식과 반찬 또는 곡류군, 어육류군, 지방군, 우유군, 과일군, 야채군 등 식재료 유형별로 분류구성되고, 기본 메뉴제공량(예: 100g)을 기준으로 식재료별 영양소별 함량(g/mg)을 계산하여 메뉴별 각 영 양소 함량(g/mg)의 합으로 저장되어 있다. 일예로, 제육볶음 메뉴일 경우 식재료에는 돼지앞다리살 고추장, 간 장, 고추가루 등이 포함되고, 식단은 상기 제육볶음 메뉴를 포함하여 주식(잡곡밥 등)과 반찬(제육볶음을 포함 한 김치 등)으로 구성되며, 각 식단은 제공량 조절을 통해 1500칼로리에서 2500칼로리 범위 11단위내로 구성된 다. 처음 제1 식단은 사용자로부터 입력받은 BMI(Body Mass Index) 등 개인정보와 전문영양사가 상담한 결과를 기준으로 식단을 구성하는 제공단위를 결정하고 제1 식단 섭취후에는 사용자로부터 입력받은 혈당값, 섭취량, 활동량 등의 피드백 정보를 기반으로 인공지능 혈당예측모델을 작성한 후 이를 이용하여 결정된 영양소별 반응 도를 환산하여 계량화한 단위수에 따라 더하거나 빼서 식단을 구성하는 영양소의 함량을 조정하여 제2 식단을 구성한다. 여기서 함량 조정은 주식과 반찬에서 적절하게 조정되도록 한다. 또 다른 일례로서의 조정방식은 개 인별 입력, 저장된 취향에 맞춰 식재료 종류별 우선순위에 따라 자동으로 조정되도록 하거나 전문 영양사가 개 인별 상담한 결과와 인공지능 도출된 혈당반응도 결과값 및 활동량에 따른 소모칼로리를 고려하여 가중치를 배 분하여 추가로 조정 할 수 있다. 도 6 및 도 7은 본 발명에 따른 사용자 개인정보 입력 및 피드백 정보획득에 관한 화면상태도를 나타낸다. 도 6을 참조하면, 본 발명에 따른 사용자 개인정보 입력 및 피드백 정보획득단계중에서, (S1) 단계는 회원가입 단계로 개인 아이디, 비밀번호, 실명, 이메일, 생년월일과 약관에 관한 동의정보 등 기초적인 고객정보를 획득 하는 단계이다. (S2)단계는 식단서비스 및 혈당관리를 위한 사용자 체질정보 및 취향정보 입력단계로, 개인 기 초정보외에 키와 몸무게 및 그에 따른 일일 권장칼로리와 선호영상 키워드 정보를 포함한다. 선호영상 키워드는 식이 가이드 시 개인이 선호하는 영상을 자동으로 팝업시켜 시청할 수 있도록 하는 것으로 스포츠, 예능, 드라 마, 음악 등 좋아하는 분야와 원하는 시청시간을 설정할 수 있다. (S3)단계는 혈당 및 활동량을 진단하기 위한 피드백 정보 입력단계로, 먼저 혈당 변화를 모니터링하기 위하여 자가 측정한 혈당을 입력하는 시점은 아침 식 사 전 공복 혈당측정치, 그리고 아침, 점심, 저녁 식사 전후 혈당치와 취침전에 혈당치를 입력하도록 한다. 여 기서 혈당 측정은 외부측정장치로 측정한 결과를 직접 입력할 수 있고, 블루투스 통신을 통해 고객 단말에 자동 으로 전송, 입력될 수 있다. 혈당은 통상적으로 측정하는 시점이 정해져 있으나 혈당조절이 잘 안되거나 특별한 경우에는 측정횟수를 늘려 모니터링하는 것이 중요하지만 실질적으로 채혈을 통해 측정횟수를 늘리는 방식은 실 천하기가 매우 어려운 것으로 본 발명에서는, 음식 섭취 전후뿐 아니라 운동여부나 스트레스 등 시간적 흐름에 따라 혈당이 어떻게 변화하는지를 가늠할 수 있도록 시간단위별로 고객 단말에 인지반응도검사 항목을 팝업시켜 혈당변화에 따라 개인별로 느끼는 신체상태에 대한 인지정도를 입력할 수 있도록 한 것을 특징으로 한다. 또한 활동량에 대해서는 실내운동, 실외운동, 집안활동 및 직업에 관한 분류와 각 세부항목을 선택하여 일일 활동정도를 입력하면 자동으로 소모칼로리가 계산되도록 하되 이는 고객 단말에 제공된 어플리케이션에 항목을 추가하 여 직접 입력할 수 있고일반적으로 모바일과 웹에서 제공하는 활동량계산기를 활용하여 결과데이터를 연동하는 방식으로도 구현할 수 있는 것이다. (S4)단계에서는 제공된 식단에 대한 섭취량을 입력하는 단계로, 개인별로 정확한 섭취량에 대한 데이터를 확보해야 실제 섭취한 칼로리가 측정되고 활동량에 따른 소모칼로리에 따라 추 가 에너지 보충여부가 결정되고, 혈당변화에 대한 영향여부를 가늠하는 측면에서도 고려되어야 하는 파라미터이 므로, 섭취량 입력은 중요하며, 입력 방식은 식단 메뉴명에서 각 메뉴별 섭취량을 100% 기준으로 개인 판단하여 섭취정도를 비율로 판단하여 입력 저장할 수 있고, 또 다른 방식으로는, 식사 후에 블루투스 데이터 통신이 가 능한 저울에 제품 전체를 올리거나 해당 메뉴에서 칼로리 비중이 높은 주식과 주반찬 제품을 각각 해당 항목 설 정 후 차례로 올리면 자동으로 무게가 전송, 입력되고, 배송 전 공급측에서 기록한 무게와의 차이를 이용하여 매 끼니당 섭취량을 계산할 수 있다. (S5)단계에서는 체중에 관한 피드백 정보를 입력하는 단계로 입력 데이터 는 일자별로 기록되어 체중에 따른 일일 필수 칼로리와 체중변화를 한눈에 확인할 수 있어, 체중감량을 목적으 로 하는 소비자에게도 적용할 수 있도록 한 것이 특징이다. (S6)단계에서는 공복, 식사전후, 취침전 측정하는 혈당값을 각각 분리하여 그래프로 표시하여 추세를 확인할 수 있다. 도 7는 본 발명에 따른 사용자 혈당모니터링에 관한 화면상태도를 나타낸다. 도 7을 참조하면, 본 발명에 따른 사용자 혈당모니터링방식을 구체적으로 설명하면, 앞서 설명한 바와 같이, 자 가 채혈방식의 혈당측정은 통상의 측정횟수를 넘어서 계속해서 실행하기에는 어려움이 많기 때문에 혈당 조절이 안되거나 주기적이고 반복적인 자가측정이 필요한 경우에는 본 발명에서는 인지반응도검사 항목을 모바일 어플 리케이션에 적용하여 섭취음식, 활동량 및 스트레스 등 여러가지 영향요인에 의한 실시간 혈당변화로 개인별로 인지하는 신체적 반응을 모니터링하여 혈당의 높낮음 여부를 체크하는 보조지표로 활용하도록 하였다. 구체적인 방식은 상기 (S3)단계의 혈당 입력 UI화면에서 인지반응도검사 항목을 선택하면, (S3-1)단계와 같이 인지반응도 검사 체크리스트 화면으로 전환되고, 배고픔, 피곤함, 갈증, 다뇨, 시야흐림, 메스꺼움, 체중감소, 두통, 움직 임 둔화 및 피부건조 가려움 정도에 관한 개별항목에 대해 5점 척도로 인지정도를 선택할 수 있는 질문지를 보 여주거나 1시간 단위로 자동 팝업시켜 선택하도록 하고, 3점이상 선택항목이 3개 이상이면 높음, 2개 이하면 낮 음(정상범위)으로 기록 저장되어, 보조지표로 활용할 수 있도록 한 것이 특징이다. (S3-2)는 추가 보조지표로 활용할 수 있는 항목으로 집중력, 느려지는 자연치유(상처), 저림, 따끔거림, 손과 발의 통증, 겨드라이, 목, 사타구니 등의 얼룩진 피부톤 변화, 과일향 호흡, 짧은 호흡, 빠른 심박, 방향감 상 실, 탈수 및 팔다리 무감각 증상을 포함할 수 있다. (S3-3)는 상기 (S6)단계에서와 같이 6번의 혈당 실측정값과 함께 시간단위로 체크되는 인지도반응도검사에 의한 보조지표를 활용하여 그래프로 추세를 표시할 수 있고, 이 것에 의해 정상범위 내에서 혈당변화가 안정적으로 이루어지고 있는지 여부와 특정시점 및 특정 식단 또는 식재 료 섭취후에 혈당이 급증하는 스파이크 증세가 있었는지를 확인 할 수 있다. 도 8는 본 발명에 따른 사용자 식이가이드에 관한 화면상태도를 나타낸다. 도 8을 참조하면, 본 발명에 따른 식이가이드 방법을 구체적으로 설명하면, 식사 전 사용자에 의해 식사도우미 시작 항목을 선택되면 식이가이드 1단계가 시작되고, 데이터 베이스에 저장된 식단별 적정 섭취시간이 설정된 타이머가 보여지고, 스타트 버튼을 누르면, 식이가이드 1단계에 대한 시간 카운트가 시작되며, 샐러드와 같은 가벼운 식사 또는 애피타이저 부터 먹도록 안내하는 메시지를 보여주게 되고, 식이가이드 2단계에서는 상기 애 피타이저 식사에 대한 시간이 종료되면 자동으로 사용자로부터 입력된 취향 및 선호도 키워드 정보에 따라 영상 을 자동으로 매칭하여 안내메시지와 함께 출력하도록 한 것을 특징으로 한다. 상기 영상시청을 유도하는 목적은 영상시청을 통해 일정 시간 섭취를 중단하고 휴지시간을 갖도록 하므로, 인체가 음식물의 섭취를 자각할 수 있 는 시간을 주고, 인슐린 분비 타이밍과 분비량 및 분비속도 등 정상적인 기능을 유도하여 빠르고 한꺼번에 과다 한 음식 섭취 또는 갑작스런 당질의 섭취 등 섭취순서에 기인하는 혈당 스파이크와 같은 급격한 혈당 상승을 방 지하고 정상적인 혈당범위를 유지하면서, 점진적인 증가를 유도하면서 영양을 섭취할 수 있도록 하기 위함이며, 상기 자동 매칭 영상시청 중에는 실행을 중지할 수 도 있고 다른 영상으로 전환할 수 있도록 선택 버튼이 구비 되어 있다. 섭취가이드 3단계에서는, 5~10분 사이의 인슐린 분비를 위한 휴지시간 이후 본 식사에 대한 안내멘 트와 함께 주식과 반찬중에서 지방, 단백질, 탄수화물 순으로, 또는 채소, 반찬, 밥, 빵, 면의 순서로 먹도록 섭취순서를 가이드 할 수 있고, 주식과 반찬에 포함된 식재료의 유형에 따라 씹는 횟수를 가이드할 수 있는 것 이고, 잔여 식사시간이 종료될때까지 타이머가 카운트 되도록 한다. 도 9는 본 발명에 따른 맞춤형 식단에 의한 혈당관리시스템 서비스 흐름도를 나타낸다. 도 9를 참조하면, 본 발명에 따른 혈당관리시스템 서비스 흐름은 (S100)단계에서 최초 사용자로부터 아이디, 주 민번호, 주소 등 기초적인 개인정보가 입력되고 회원가입이 완료되는 단계이고, (S110)단계에서는 개인 혈당, 생활습관, 활동량, 취향 등 구체적인 추가정보를 입력받게되고, (S120~140)단계에서는 입력된 정보를 바탕으로 소속 전문영양사와의 상담을 통해 개인 건강과 취향을 고려한 식재료 및 조리법이 선택되어 제1 식단이 생성된 다. (S150)단계에서는 요청하는 배송일 및 배송시간을 고려하여 사전에 생성, 저장된 제 1식단을 조리하는 단계 로 넘어가고, (S160~180)단계는 배송관리 단계로, 저장된 고객 주소지 정보에 따른 배송 예상시간, 해당일 날씨 (외부온도)정보에 따라 적정 얼음량을 결정하고 패키징하여 배송 요청되면, 택배사로부터 예상배송시간 입력, 배송완료 후에는 도착지 배송 완료시간 및 증빙사진을 단말을 통해 전송받는다. (S190)단계는 피드백정보 획득 단계로 날씨와 배송시간을 고려하여 정확한 얼음량 설정을 위해 배송 제품에 대한 고객으로부터 실제 픽업시간 및 패키지 내 잔여 얼음량을 입력되도록 하고, 배송된 식단 섭취 시작시간, 종료시간과 함께 주식과 반찬 섭취 비율 또는 무게에 따른 섭취량 정보, 혈당측정정보, 인지반응도검사 정보, 운동정보를 포함하는 활동량 정보, 수면시간을 포함하는 생활패턴 등 각종 활동정보가 입력되도록 한다. (S200~220)단계에서는 상기 분석서버(12 0)에서 사용자로부터 피드백 받은 데이터와 섭취히스토리DB를 이용해서 영양소별 혈당값 예측식을 도출하여 계 산된 개별 혈당예측값과 혈당예측값의 평균한 값의 비율에 따라 반응도를 결정하고, 제공되는 주식과 반찬에서 개인의 혈당반응도를 고려하여 식단을 조정하기 위해 11단위 범위내로 환산하여 계량화한 단위수를 조정한 제2 식단을 구성하도록 하되, (S230~240)단계에서 개인별 입력된 활동량에 따라 계산된 소모칼로리가 많았다면 조정 된 단위에 (소모칼로리/300)kal 만큼 계산한 값을 추가로 고려하여 최종 제2 식단을 조정, 구성하도록 한 것이 특징이다. 이후 (S250~260)단계에서는 동일하게 배송 요청일정에 맞춰 재구성된 식단을 조리하여 배송하고 다시 고객으로부터 피드백 정보를 받아 모니터링하여, 배송품질 유지를 위한 얼음량 조정, 고객 혈당 유지관리를 위 한 식단조정 과정이 반복되도록 구성된다. 도 10는 본 발명에 따른 배송관리를 위한 시스템 구성을 나타낸다. 도 10를 참조하면, 본 발명에 따른 밀키트 제품의 배송품질을 유지관리하기 위한 것으로, (S1000) 단계에서 사 용자(고객)로부터 회원가입 및 개인정보 입력 단계에서 주소지 정보를 입력받고, (S2000) 단계에서는 기상청으 로부터 배송일자에 해당하는 날씨(기온)정보를 제공받고, (S3000) 단계에서는 서비스 공급자 시스템을 통해 사 용자 주소지 정보에 기반한 배송시간과 배송일 외부온도정보에 기반하여 적정 얼음량이 계산되 패키지에 포함되 어, (S3000) 단계에서 택배사에 배송요청을 하게되고, (S4000~5000) 단계에서는 택배사로부터 예상배송시간 뿐 아니라 배송지 도착시간과 사진을 전송받도록 하고 동시에 실제 배송완료시간을 공급자와 사용자(고객)에 자동 알림 전송되도록 하며, (S6000) 단계에서는 사용자(고객)으로부터 실제 픽업시간과 잔여 얼음량을 충분, 적정, 부족상태로 구분하여 피드백 되도록하므로 상기 피드백 정보를 토대로 보다 정확한 배송에 걸리는 시간 및 필요 한 적정 얼음량을 조정하여 다음 배송일에 수정, 적용할 수 있도록 하여 신선식품 온도유지 및 배송품질을 데이 터에 기초하여 정확하게 관리되도록 한다. 이상과 같이, 본 발명은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 이것에 의해 한정되지 않"}
{"patent_id": "10-2023-0161581", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "으며 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 본 발명의 기술 사상과 아래에 기재될 청구 범위의 균등 범위 내에서 다양한 수정 및 변형이 가능함은 물론이다."}
{"patent_id": "10-2023-0161581", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시예에 따른 데이터 기반 개인 맞춤형 식단을 통한 혈당관리 시스템을 개략적으로 나타낸다. 도 2는 본 발명에 따른 개인 맞춤형 식단을 통한 혈당관리 시스템의 구성도를 나타낸다. 도 3은 본 발명에 따른 개인 맞춤형 식단을 통한 혈당관리 시스템의 분석서버 구성을 나타낸다. 도 4는 본 발명에 따른 영양소별 반응도에 따른 식단조정 알고리즘을 나타낸다. 도 5는 본 발명에 따른 영양소별 단위수 조정 방법을 나타낸다. 도 6a 및 도 6b는 본 발명에 따른 사용자 개인정보 입력 및 피드백 정보획득에 관한 화면상태도를 나타낸다. 도 7는 본 발명에 따른 사용자 혈당모니터링에 관한 화면상태도를 나타낸다. 도 8는 본 발명에 따른 사용자 식이가이드에 관한 화면상태도를 나타낸다. 도 9는 본 발명에 따른 맞춤형 식단에 의한 혈당관리 서비스 흐름도를 나타낸다. 도 10는 본 발명에 따른 배송관리를 위한 시스템 구성을 나타낸다."}
