{"patent_id": "10-2022-0163690", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0080395", "출원번호": "10-2022-0163690", "발명의 명칭": "전기차량의 충전시스템", "출원인": "씨텍 주식회사", "발명자": "유병훈"}}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,상기 메인 충전기는 급속 충전기이고,상기 채널 충전기는 급속 충전 또는 완속 충전이 가능한 것을 특징으로 하는,전기차량의 충전시스템."}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 메인 충전기는,상기 메인 충전기 및 채널 충전기의 충전방식을 제어하는 제어부;상기 메인 충전기 및 채널 충전기에서 충전에 따른 충전비용에 대한 결제 정보를 저장 및 관리하는 결제관리부;상기 메인 충전기 및 각각의 채널 충전기에서의 부하를 검출하는 부하검출부;상기 각각의 채널 충전기와 통신하는 통신부; 및상기 메인 충전기 및 채널 충전기에서의 충전 완료시 전기차량의 사용자의 단말에 알림메시지를 전송하는 알림부를 포함하는,전기차량의 충전시스템."}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 메인 충전기 및 채널 충전기에 할당되는 전력량의 제어는, 상기 메인 충전기 및 채널 충전기에 공급되는 전력을 기설정된 전력 범위 내에서 우선순위를 정하여 메인 충전기 및 채널 충전기에 선택적으로 공급하는 채널제어방식인 것을 특징으로 하는,전기차량의 충전시스템."}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 메인 충전기 및 채널 충전기에 할당되는 전력량의 제어는,상기 메인 충전기 및 채널 충전기에 공급되는 전력을 각각의 충전기에 할당되는 부하용량을 제어하는 부하제어방식인 것을 특징으로 하는,전기차량의 충전시스템.공개특허 10-2024-0080395-3-청구항 5"}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서,상기 메인 충전기 및 채널 충전기에서 충전시 발생되는 충전 비용에 대한 결제 정보는 메인 충전기의 결제관리부에 저장 및 관리되는 것을 특징으로 하는,전기차량의 충전시스템."}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 채널 충전기는 인버터 및 컨버터를 포함하는 것을 특징으로 하는,전기차량의 충전시스템."}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 메인 충전기 및 채널 충전기의 합계 사용량이 최대용량에 도달시에는 충전을 시작한 순서로 충전을 제어하는 채널제어방식에 따라 제어되고, 경부하시에는 채널 충전기에서도 급속충전이 가능하도록 제어하는 것을 특징으로 하는,전기차량의 충전시스템."}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 채널 충전기는,2개 이상으로 서로 직렬 연결되고, 상기 제어부에 의해 제어되는 확장형 채널을 구성하는 것을 특징으로 하는,전기차량의 충전시스템."}
{"patent_id": "10-2022-0163690", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 변전설비로부터 공급되는 전력의 증감없이 상기 채널 충전기의 개수가 증감가능한 것을 특징으로 하는,전기차량의 충전시스템.공개특허 10-2024-0080395-4-"}
{"patent_id": "10-2022-0163690", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전기차량의 충전시스템에 관한 것으로, 상기 전기차량의 충전시스템은 변전설비로부터 전력을 공급받 아 전기차량을 충전하는 메인 충전기; 및 상기 메인 충전기와 통신을 하고 상기 메인 충전기로부터 전력을 공급 받아 선택적으로 전기차량을 충전하는 하나 이상의 채널 충전기를 포함하고, 상기 메인 충전기는 상기 메인 충전 기 및 채널 충전기에 할당되는 전력량을 제어하는 제어부를 포함한다."}
{"patent_id": "10-2022-0163690", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전기차량의 충전시스템에 관한 것으로, 보다 구체적으로는 충전기의 충전 여부를 자동 제어하고, 충 전기의 개수를 가변할 수 있는 충전시스템에 관한 것이다."}
{"patent_id": "10-2022-0163690", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전기차 보급 활성화 정책과 각종 세제지원으로 전기차의 가파른 증가와 주차장에 전기차량의 충전기 의무설치 규정으로 전원을 공급하는 수전설비의 막대한 부하의 증가와 대형화된 변전설비로 발전설비 추가증설 등의 불안 정한 현상이 발생하며 이에 따라 에너지손실과 온실가스발생이 증가되는 문제가 발생하고 있다. 또한, 전기차의 급속 충전기는 전력 사용량이 크기 때문에 변전설비의 용량도 커지며 이를 보호하기 위한 변전 설비의 설치공사도 확장하여 설치하여야 하는 문제가 있으며 기존의 건축물에서는 변전설비의 증설과 변전설비 의 확장공사는 불가능한 상황이 발생한다. 특히, 변전설비 중 변압기의 용량이 커지면 무부하손실과 부하손실이 증가되어 최종적으로는 변압기의 효율이 저하되는 현상이 발생하게 된다. 기존의 전기차 급속 충전기는 용량이 크고 외형 또한 커져 공간을 많이 차지하게 되어 주차공간 확보에 방해를 준다. 그리고, 급속 충전은 빠른 충전으로 즉시 충전장소를 비워줘야 하는데 일상에서는 그렇지 않아 급속 충전 을 하고자 하는 대기자들과의 마찰로 인한 불화가 발생하고 사업자에게는 회전률이 저하되어 고가의 충전기의 사업성이 저하되는 상황으로 충전요금을 지속적으로 인상하게 되어 사용자와 사업자간의 악순환이 발생하게 된 다. 전기차의 충전기를 사용하고자 하는 수용가 또는 사용자가 다수이거나 지속적인 추가설치를 요구할 때 설치 검 토시 가장 난해한 문제는 수전설비의 용량이며 용량이 부족하거나 증설하기 곤란한 경우에는 불안전한 수전설비 운영으로 사고의 발생으로 안전에 큰 문제가 발생할 수 있다. 전기차량의 충전기 설치시 변전설비의 용량이 부족할 경우에는 의무설치 이행이 어렵고 또 이용자의 불편과 충 전기의 적은 수량에 따른 주민 또는 사용자 간에 불화가 발생하는 일이 잦아지는 문제점이 있었다."}
{"patent_id": "10-2022-0163690", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제 및 다른 문제를 해결하는 것을 목적으로 한다. 또 다른 목적은 다수의 충전기를 자동으 로 제어하며, 충전기의 개수를 가변시킬 수 있는 전기차량의 충전시스템을 제공하는 것이다."}
{"patent_id": "10-2022-0163690", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따르면, 변전설비로부터 전력을 공급받아 전기차량 을 충전하는 메인 충전기; 및 상기 메인 충전기와 통신을 하고 상기 메인 충전기로부터 전력을 공급받아 선택적 으로 전기차량을 충전하는 하나 이상의 채널 충전기를 포함하고, 상기 메인 충전기는 상기 메인 충전기 및 채널 충전기에 할당되는 전력량을 제어하는 제어부를 포함하는, 전기차량의 충전시스템이 제공될 수 있다. 본 발명의 일 측면에 따르면, 상기 메인 충전기는, 상기 메인 충전기 및 채널 충전기의 충전방식을 제어하는 제 어부; 상기 메인 충전기 및 채널 충전기에서 충전에 따른 충전비용에 대한 결제 정보를 저장 및 관리하는 결제 관리부; 상기 메인 충전기 및 각각의 채널 충전기에서의 부하를 검출하는 부하검출부; 상기 각각의 채널 충전기 와 통신하는 통신부; 및 상기 메인 충전기 및 채널 충전기에서의 충전 완료시 전기차량의 사용자의 단말에 알림 메시지를 전송하는 알림부를 포함할 수 있다. 본 발명의 일 측면에 따르면, 상기 메인 충전기 및 채널 충전기에 할당되는 전력량의 제어는, 상기 메인 충전기 및 채널 충전기에 공급되는 전력을 기설정된 전력 범위 내에서 우선순위를 정하여 메인 충전기 및 채널 충전기에 선택적으로 공급하는 채널제어방식일 수 있다. 본 발명의 일 측면에 따르면, 상기 메인 충전기 및 채널 충전기에 할당되는 전력량의 제어는, 상기 메인 충전기 및 채널 충전기에 공급되는 전력을 각각의 충전기에 할당되는 부하용량을 제어하는 부하제어방식일 수 있다. 본 발명의 일 측면에 따르면, 상기 메인 충전기는 급속 충전기일 수 있다. 본 발명의 일 측면에 따르면, 상기 채널 충전기는 급속 충전 또는 완속 충전이 가능할 수 있다. 본 발명의 일 측면에 따르면, 상기 메인 충전기 및 채널 충전기에서 충전시 발생되는 충전 비용에 대한 결제 정 보는 메인 충전기의 결제관리부에 저장 및 관리될 수 있다. 본 발명의 일 측면에 따르면, 상기 전기차량은, 이륜차, 삼륜차 또는 사륜차일 수 있다. 본 발명의 일 측면에 따르면, 상기 메인 충전기 및 채널 충전기의 합계 사용량이 최대용량에 도달시에는 충전을 시작한 순서로 충전을 제어하는 채널제어방식에 따라 제어되고, 경부하시에는 채널 충전기에서도 급속충전이 가 능하도록 제어할 수 있다. 본 발명의 일 측면에 따르면, 상기 채널 충전기는 2개 이상으로 서로 직렬 연결되고, 상기 제어부에 의해 제어 되는 확장형 채널을 구성할 수 있다. 본 발명의 일 측면에 따르면, 상기 채널 충전기는 인버터 및 컨버터를 포함할 수 있다."}
{"patent_id": "10-2022-0163690", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 전기차량의 충전시스템에 대해 설명하면 다음과 같다. 본 발명의 실시예들 중 적어도 하나에 의하면, 여러 개의 확장형 충전기를 운영할 수 있도록 채널 충전기를 제 공하여 전기차량의 충전기를 수전설비 증설없이 설치함과 동시에 여러 대의 전기차량의 충전이 가능한 장점이 있다. 본 발명의 실시예들 중 적어도 하나에 의하면, 전력설비의 과부하 운전과 다량의 에너지손실이 발생하지 않도록 시스템을 제어할 수 있는 장점이 있다. 즉, 전기차량의 충전기의 증설과 도입에 따른 수전설비의 부하 증가와 변압기 등의 과부하 운전으로 사고발생 방지를 위해 전압과 전류를 실시간 인공지능 감지를 통해 전기차 확장형 충전기 다량으로 확장하면서도 안정적으로 제어할 수 있는 장점이 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 급속 충전기 또는 대용량 충전기 한 대로 다량의 전기차량 의 충전기 채널을 추가할 수 있으며, 안전한 운전과 부하조절을 위해 우선 충전을 통해 순차적으로 빠른 충전을 이행할 수 있는 장점이 있다. 본 발명의 실시예들 중 적어도 하나에 의하면, 균등 충전방식(부하제어방식)을 통해 많은 전기차량을 메인 충전 기 한 대로 다수의 채널 충전기에 의해 충전할 수 있는 장점이 있다. 즉, 여러 대의 전기차량을 유연하게 충전 할 수 있도록 채널을 자유롭게 추가하여 설치할 수 있는 장점이 있다. 본 발명의 적용 가능성의 추가적인 범위는 이하의 상세한 설명으로부터 명백해질 것이다. 그러나 본 발명의 사 상 및 범위 내에서 다양한 변경 및 수정은 당업자에게 명확하게 이해될 수 있으므로, 상세한 설명 및 본 발명의 바람직한 실시예와 같은 특정 실시예는 단지 예시로 주어진 것으로 이해되어야 한다."}
{"patent_id": "10-2022-0163690", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소에는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용되는 것으 로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시예를 설명 함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판 단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시예를 쉽게 이해할 수 있 도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 도 1은 본 발명과 관련된 저용량 수전설비 설계를 위한 전기차량의 충전시스템의 모식도인데, 이하에서는 도 1을 참조하여 본 발명의 일 실시예에 따른 전기차량의 충전시스템에 대하여 설명하기로 한다. 본 발명 의 일 실시예에 따른 전기차량은 전기에 의해 구동되는 이륜차, 삼륜차 및 사륜차를 포함한다. 즉, 전기자동차 에 한정되는 것은 아니다. 도 1는 본 발명의 일 실시예에 따른 변전설비를 거처 메인 충전기를 통한 전기차량의 충전기에 대한 확장형 충전시스템을 도시한 도면이다. 본 발명의 일 실시예에 따른 전기차량의 충전시스템은 변전설비로부터 전력을 공급받아 전기차량을 충전하는 메인 충전기와, 상기 메인 충전기와 통신을 하고 상기 메인 충전기로부터 전력을 공급 받아 선택적으로 전기차량을 충전하는 하나 이상의 채널 충전기를 포함한다. 그리고, 상기 메인 충전기 는 상기 메인 충전기 및 채널 충전기에 할당되는 전력량을 제어하는 제어부를 포함한다. 즉, 상기 제어부에 의해 메인 충전기 및 하나 이상의 채널 충전기 중 일부가 충전을 위한 전력 을 공급받는 동안 나머지는 전력을 공급받지 않을 수 있다. 다만, 필요에 따라서는 메인 충전기 및 하나 이상의 채널 충전기 모두를 충전할 수도 있다. 본 발명의 일 실시예에서는 상기 메인 충전기 및 채널 충전기에 할당되는 전력량의 제어는, 상기 메 인 충전기 및 채널 충전기에 공급되는 전력을 기설정된 전력 범위 내에서 우선순위를 정하여 메인 충 전기 및 채널 충전기에 선택적으로 공급하는 채널제어방식으로 제어할 수 있다. 상기 채널제어방식은 메인 충전기 및 다수의 채널 충전기에 선택적으로 전력을 공급하는 방식으로, 일예로 충전을 시작한 순서로 충전을 제어하는 방식을 의미한다. 만약, 채널제어방식에 의해 전기차량을 충전하는 경우, 5개의 채널 충전기에만 전력을 공급하도록 설정된 경우에는 먼저 충전을 시작한 5개의 전기차량만 충전이 되고, 나머 지의 채널 충전기에서는 충전이 불가하다. 즉, 한정된 변전설비의 용량에 따라 전기차량의 충전기를 자유자재로 여러 대 설치 및 증설 시 변전설비 의 전압과 전류의 상태를 실시간으로 감지함과 동시에 제어함에 따라 많은 전기차량이 충전기에 연결되도 록 하는 것이다. 이때, 충전을 제어하는 방식은 우선적으로 충전되고 있는 차량을 순차적으로 충전하여 변전설 비의 용량 이내로 제어를 하여 건축물 확대 및 전력케이블 증대 또는 에너지 손실 등의 억제를 최소화할 수 있 다. 상기 변전설비의 전압 및 전류의 상태는 메인 충전기의 부하검출부에 의해서 감지될 수 있 다. 또한, 본 발명의 일 실시예에서의 상기 메인 충전기 및 채널 충전기에 할당되는 전력량의 제어는, 상 기 메인 충전기 및 채널 충전기에 공급되는 전력을 각각의 충전기에 할당되는 부하용량을 제어하는 부하제어방식으로 제어할 수도 있다. 예를 들면, 상기 변전설비로부터 공급받은 전력의 일부를 상기 메인 충전기에 공급하고, 나머지의 전력을 채널 충전기에 균일하게 공급하는 방식으로 제어할 수 있다. 이 때의 부하는 전력을 의미한다. 예를 들면, 변전설비로부터 메인 충전기가 100의 전력을 받는다고 할 때, 상기 메인 충전기에서 50을 사용하고, 나머지 50을 다수의 채널 충전기에 균일하게 제공할 수 있다. 다만, 상기 다수의 채널 충전기에 항상 균일한 전력이 공급되는 것에 한정되는 것은 아니고 메인 충전 기가 사용하고 남은 전력을 다수의 채널 충전기에 불균일하게 제공할 수도 있다. 이때, 채널제어방식과 부하제어방식은 항상 구분되어 사용되어야 하는 것은 아니고, 필요에 따라 혼용하여 사용 될 수도 있다. 즉, 상기 메인 충전기 및 채널 충전기에서의 합계 사용량이 최대용량에 도달시에는 충 전을 시작한 순서로 충전을 제어하는 채널제어방식에 따라 제어되고, 경부하시에는 채널 충전기에서도 급 속충전이 순차적으로 운영되도록 제어할 수 있다. 상기 경부하시는 상기 메인 충전기 및 채널 충전기(12 0)가 사용가능한 전력 중 적어도 일부를 사용하고 있지 않은 경우를 의미한다. 즉, 메인 충전기 및 채널 충전기에서의 사용중인 전력량 합계를 고려하여 채널제어방식 또는 부하제어방식으로 제어할 수가 있다. 예를 들면, 충전하고자 하는 전기차량이 많지 않은 경우에는 채널제어방식에 따라 소수의 채널 충전기만 사용하다가, 충전하고자 하는 전기차량의 개수가 늘어나서 모든 충전기의 사용이 필요한 경우라면 부하제어방식 에 의해 모든 충전기(110,120)에 전력을 공급하여 충전이 가능하도록 할 수 있다. 이와 같이, 충전하고자 하는 전기차량의 개수가 증가하여 사용해야 하는 메인 충전기 또는 채널 충전기의 개수가 늘어나서 부하제 어방식으로 제어하게 되면, 이미 충전중인 전기차량의 충전 시간이 당초 예상시간보다 늘어날 수도 있다. 이에 의해 상기 변전설비로부터 공급되는 전력의 증감없이 상기 채널 충전기의 개수가 증감가능하게 된다. 상기 메인 충전기는 급속 충전기일 수 있고, 상기 채널 충전기에서는 급속 충전 및 완속 충전이 가능 하다. 또한, 채널 충전기에서도 급속 또는 완속 충전이 가능하도록 지원하기에 주차장에서 별도로 급속 충 전기까지 가지 않고 빈 채널의 주차공간에 주차함으로써 불특정 다수인과의 충전공간 문제로 대립하는 것을 줄 일 수 있다. 이때, 상기 메인 충전기 및 채널 충전기에서 충전시 발생되는 충전 비용은 메인 충전기에서 결 제되도록 할 수 있다. 이는 다수의 채널 충전기에서 결제수단을 통해 결제를 하면 이에 대한 처리가 메인 충전기에서 이루어지는 것을 의미한다. 이를 위해 상기 메인 충전기에는 각각의 채널 충전기에 서 이루어진 결제 정보를 수신 및 저장할 수 있는 결제관리부를 구비한다. 도 2는 본 발명의 실시예에 따른 메인 충전기의 내부 구성도인데, 도 2를 참조하면, 상기 메인 충전기는 다수의 채널 충전기의 충전용량 또는 충전방식을 제어하는 제어부, 상기 메인 충전기 및 다수의 채널 충전기에서의 충전 비용에 대한 결제 정보를 저장 및 관리하는 결제관리부, 상기 메인 충전기 및 각각의 채널 충전기에서의 부하를 검출하는 부하검출부, 각각의 채널 충전기와 통신하 는 통신부 및 상기 메인 충전기 및 채널 충전기에서의 충전이 완료되었을 사용자의 단말에 알림 메시지를 알리는 알림부를 포함한다. 그리고, 상기 다수의 채널 충전기에도 통신부가 구비되어 상기 메인 충전기와 통신이 가능하고, 사용자의 신용카드 또는 현금 등의 결제수단에 의한 결제가 가능하도록 결제부가 구비되어 있다. 한편, 본 발명의 일 실시예에서는 상기 채널 충전기는 2개 이상으로 서로 직렬 연결되고, 상기 제어부 에 의해 제어되는 확장형 채널을 구성한다. 상기 메인 충전기와도 직렬로 연결된다. 즉, 상기 확장형 채널은 제1 채널 충전기, 제2 채널 충전기, 제3 채널 충전기와 같이 직렬로 연결되는 다수의 채 널 충전기를 포함한다. 즉, 상기 메인 충전기로부터 전력을 선택적으로 공급받는 다수의 충전기 (121,122,123)를 포함하여 이루어진다. 이때, 상기 채널 충전기의 개수는 상기 변전설비로부터 공급 되는 전력의 증감없이 증감될 수 있다. 이상에서 살펴본 바와 같이, 본 발명의 일 실시예에서는 저용량 수전설비 설계를 위한 인공지능 전기차 확장형 충전기 및 충전시스템은 한정된 수전설비의 용량에 증설변경 없이 전기차량의 충전기를 여러 대 확장하여 설치 할 수 있다. 확장형 채널 충전기는 메인 충전기에 채널 충전기를 추가설치 하고자 할 경우 채널 충전기에 전 원과 통신선을 연결하여 충전단자는 채널 충전기의 수 만큼 증설가능하며 동시에 여러 대의 차량을 충전할 경우에는 수전설비 용량이 초과되지 않도록 충전부하를 균등하게 충전제어를 하여 전력설비의 추가증설 없이 안 전하고 고효율 운전이 가능하도록 지원이 가능하다. 또한, 전기차의 배터리는 리튬이온이 양극과 음극을 거쳐 충전 및 방전하는 화학적 에너지저장장치로서 전기차 충전기를 통해 충전하는데 한전측에서 고압의 교류전원을 입력받아 수변전설비에서 변압기를 거처 저압으로 강압하여 다시 충전기의 인버터를 통해 교류를 직류로 변환하고 컨버터를 거처 정격 직류전압과 전류로 배터 리에 공급하여 충전 및 방전을 하게 된다. 이때, 용량이 크고 수량이 많을 수록 고조파가 다량으로 발생하여 변 압기와 주변 전기·전자기기에 잡음과 오동작을 일으키게 된다. 본 발명의 일 실시예에 따른 상기 추가되는 채 널 충전기는, 메인 충전기와 연결된 부분과 인버터와 컨버터를 포함한다. 또한, 상기 각 채널 충전기는, 수량이 적을시에 빠른 충전지원을 하며, 기 설정된 시간에 따른 충전 완료 시에는 알람과 함께 모바일 안내도 지원이 가능하다. 또한, 본 발명에 따른 전기차 확장형 채널 충전기는, 점검이 용이한 위치에 설치되어야 하며 메인 충전기 와 각 채널 충전기는 유지관리 및 보안감시를 위한 움직임 감시와 영상촬영을 할 수 있도록 CCTV 및 화재감지가 가능하다. 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발 명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경 은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2022-0163690", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명과 관련된 저용량 수전설비 설계를 위한 전기차량의 충전시스템의 모식도이다. 도 2는 본 발명의 실시예에 따른 메인 충전기의 내부 구성도이다."}
