{"patent_id": "10-2023-0079066", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0177556", "출원번호": "10-2023-0079066", "발명의 명칭": "무기 체계의 설계를 위한 고장 분석 방법 및 그를 위한 장치", "출원인": "엘아이지넥스원 주식회사", "발명자": "서양우"}}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고장 분석 장치에서 무기 체계의 설계를 위한 고장을 분석하는 방법에 있어서,상기 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고장 분석을 위한 고장 정의 및 판단 기준을 포함하는 고장 판단 정보를 설정하는 고장 분석 설정 단계;상기 기능 분석을 통해 구분된 적어도 하나의 기능 또는 아이템에 상기 고장 판단 정보를 매핑하여 잠재 고장모드를 식별하는 고장 모드 식별 단계;상기 잠재 고장 모드에 대한 평가를 수행하여 평가 결과 정보를 생성하는 고장 모드 분석 단계;상기 평가 결과 정보를 기반으로 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 판단하는 우선 순위결정 단계; 및상기 평가 결과 정보 또는 기준 조치 우선 순위를 기반으로 선정된 상기 적어도 하나의 기능 또는 아이템에 대해 권고 조치 방안을 설정하여 권고 조치 사항 정보를 생성하는 권고 조치 사항 결정 단계를 포함하는 것을 특징으로 하는 고장 분석 방법."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 고장 분석 설정 단계는,상기 무기 체계의 업무 기술서(SOW: Statement of Work)에 기 설정된 적어도 하나의 요구 사항을 기반으로 상기시스템 요구사항 정보를 확인하는 단계;필수 기능 고장 및 비필수 기능 고장으로 고장 사건을 분류하여 상기 고장 정의를 설정하고, 상기 필수 기능 고장 중 상기 요구 사항 정보에 대한 요구 기능을 수행하지 못하거나 요구 성능을 만족하지 못하는 사건을 판단하기 위한 상기 판단 기준을 설정하여 상기 고장 판단 정보를 설정하는 단계; 및상기 시스템 요구사항 정보에 대한 기능 분석을 수행한 기능 분석 결과를 기반으로 상위 기능 및 하위 기능을설정하여 적어도 하나의 기능 또는 아이템을 구분한 기능 분석 정보를 생성하는 단계를 포함하는 것을 특징으로 하는 고장 분석 방법."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 고장 모드 식별 단계는,관계 매트릭스 기법을 활용하여 상기 고장 판단 정보를 상기 적어도 하나의 기능 또는 아이템에 매핑하여 잠재고장 모드를 식별하되,상기 적어도 하나의 기능 또는 아이템 중 필수 기능 고장에 대한 식별을 추가로 수행하는 것을 특징으로 하는고장 분석 방법."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 고장 모드 분석 단계는,상기 잠재 고장 모드에 대한 심각도, 발생도 및 검출도 중 적어도 하나를 평가하여 상기 평가 결과 정보를 생성하는 것을 특징으로 하는 고장 분석 방법.공개특허 10-2024-0177556-3-청구항 5 제4항에 있어서,기 설정된 심각도 평가 기준에 근거하여 상기 적어도 하나의 기능 또는 아이템 각각의 상기 잠재 고장 모드에대한 심각성을 평가하여 심각도를 평가하는 단계;기 산출된 신뢰도 예측값을 기반으로 상기 무기 체계의 설계 수명 동안의 고장 발생 가능성을 판단하여 발생도를 평가하는 단계; 및상기 적어도 하나의 기능 또는 아이템 각각의 점검을 통한 검출 가능성을 기반으로 검출도를 평가하는 단계를 포함하는 것을 특징으로 하는 고장 분석 방법."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 우선 순위 결정 단계는,상기 적어도 하나의 기능 또는 아이템 각각에 대한 상기 평가 결과 정보에 포함된 상기 심각도, 상기 발생도 및상기 검출도를 연산 처리하여 위험 우선 순위를 산출하는 단계; 및 상기 적어도 하나의 기능 또는 아이템 각각에 대해 심각도, 발생도 및 검출도의 가능한 조합 각각에 대한 개별평가 결과를 기반으로 등급을 판단하여 상기 조치 우선 순위를 판단하는 단계를 포함하는 것을 특징으로 하는 고장 분석 방법."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 권고 조치 사항 결정 단계는,상기 평가 결과 정보의 심각도가 기 설정된 기준 심각도 이상이거나 상기 위험 우선 순위의 값이 기 설정된 기준값 이상인 것으로 판단된 적어도 하나의 기능 또는 아이템에 대해 설계 반영 활동을 수행하도록 작성된 권고조치 방안을 포함하는 상기 권고 조치 사항 정보를 생성하는 것을 특징으로 하는 고장 분석 방법."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 권고 조치 사항 결정 단계는,상기 평가 결과 정보의 심각도가 기 설정된 기준 심각도 미만이거나 상기 위험 우선 순위의 값이 기 설정된 기준값 미만인 것으로 판단된 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 확인하고,상기 조치 우선 순위의 등급이 상기 기준 조치 우선 순위에 해당하는 경우, 해당 기능 또는 아이템에 대해 설계반영 활동을 수행하도록 작성된 권고 조치 방안을 포함하는 상기 권고 조치 사항 정보를 생성하는 것을 특징으로 하는 고장 분석 방법."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "고장 분석 장치에 있어서, 상기 고장 분석 장치는, 무기 체계의 설계를 위한 고장 분석을 위한 하나 이상의 프로그램을 저장하는 메모리;및 상기 하나 이상의 프로그램에 따라 상기 고장 분석을 위한 동작들을 수행하는 하나 이상의 프로세서를 포함하고, 상기 프로세서에 의하여 수행되는 동작들은, 상기 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고장 분석을 위한 고장 정의 및 판단 기준을 포함하는 고장 판단 정보를 설정하는 고장 분석 설정 단계;상기 기능 분석을 통해 구분된 적어도 하나의 기능 또는 아이템에 상기 고장 판단 정보를 매핑하여 잠재 고장공개특허 10-2024-0177556-4-모드를 식별하는 고장 모드 식별 단계;상기 잠재 고장 모드에 대한 평가를 수행하여 평가 결과 정보를 생성하는 고장 모드 분석 단계;상기 평가 결과 정보를 기반으로 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 판단하는 우선 순위결정 단계; 및상기 평가 결과 정보 또는 기준 조치 우선 순위를 기반으로 선정된 상기 적어도 하나의 기능 또는 아이템에 대해 권고 조치 방안을 설정하여 권고 조치 사항 정보를 생성하는 권고 조치 사항 결정 단계를 포함하는 것을 특징으로 하는 고장 분석 장치."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 고장 분석 설정 단계는,상기 무기 체계의 업무 기술서(SOW: Statement of Work)에 기 설정된 적어도 하나의 요구 사항을 기반으로 상기시스템 요구사항 정보를 확인하는 단계;필수 기능 고장 및 비필수 기능 고장으로 고장 사건을 분류하여 상기 고장 정의를 설정하고, 상기 필수 기능 고장 중 상기 요구 사항 정보에 대한 요구 기능을 수행하지 못하거나 요구 성능을 만족하지 못하는 사건을 판단하기 위한 상기 판단 기준을 설정하여 상기 고장 판단 정보를 설정하는 단계; 및상기 시스템 요구사항 정보에 대한 기능 분석을 수행한 기능 분석 결과를 기반으로 상위 기능 및 하위 기능을설정하여 적어도 하나의 기능 또는 아이템을 구분한 기능 분석 정보를 생성하는 단계를 포함하는 것을 특징으로 하는 고장 분석 장치."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 고장 모드 식별 단계는,관계 매트릭스 기법을 활용하여 상기 고장 판단 정보를 상기 적어도 하나의 기능 또는 아이템에 매핑하여 잠재고장 모드를 식별하되,상기 적어도 하나의 기능 또는 아이템 중 필수 기능 고장에 대한 식별을 추가로 수행하는 것을 특징으로 하는고장 분석 장치."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 고장 모드 분석 단계는,상기 잠재 고장 모드에 대한 심각도, 발생도 및 검출도 중 적어도 하나를 평가하여 상기 평가 결과 정보를 생성하는 것을 특징으로 하는 고장 분석 장치."}
{"patent_id": "10-2023-0079066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 우선 순위 결정 단계는,상기 적어도 하나의 기능 또는 아이템 각각에 대한 상기 평가 결과 정보에 포함된 상기 심각도, 상기 발생도 및상기 검출도를 연산 처리하여 위험 우선 순위를 산출하는 단계; 및 상기 적어도 하나의 기능 또는 아이템 각각에 대해 심각도, 발생도 및 검출도의 가능한 조합 각각에 대한 개별평가 결과를 기반으로 등급을 판단하여 상기 조치 우선 순위를 판단하는 단계공개특허 10-2024-0177556-5-를 포함하는 것을 특징으로 하는 고장 분석 장치."}
{"patent_id": "10-2023-0079066", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "무기 체계의 설계를 위한 고장 분석 방법 및 그를 위한 장치를 개시한다. 본 발명의 실시예에 따른 고장 분석 장치에서 무기 체계의 설계를 위한 고장을 분석하는 방법에 있어서, 고장 분 석 방법은, 상기 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고장 분석을 위한 고장 (뒷면에 계속)"}
{"patent_id": "10-2023-0079066", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무기 체계의 안전 설계를 위한 고장 분석 방법 및 그를 위한 장치에 관한 것이다."}
{"patent_id": "10-2023-0079066", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 발명의 실시예에 대한 배경 정보를 제공할 뿐 종래기술을 구성하는 것은 아 니다. 무기체계의 신뢰성을 확보하기 위해서는 설계 초기단계부터 설계에 대한 적합성을 검토하고, 잠재적 고장에 대 한 사전 예측 및 대책을 수립하는 것이 중요하다. 즉, 발생 가능한 모든 고장 모드 및 고장 영향을 정의하고, 효과적인 조치계획을 수립해야 한다. 설계 고장모드 및 영향 분석(DFMEA: Design Failure Mode and Effects Analysis)이란 제품의 개발 단계에서 발 생 가능한 모든 고장모드, 고장영향, 발생요인을 정의하고, 관련된 대책을 수립하는 활동이다. 이를 통해 잠재 적 위험성과 관련 있는 고장모드의 위험도, 발생도 등을 추정하여 위험 우선순위가 높은 품목을 관리하여 사전 에 고장을 방지하려 할 때 효과적이다. 효과적인 DFMEA를 적용하기 위해서는 고장이나 결함 발생 이전에 수행되어야 한다. 또한, 잠재 고장이나 결함이 예측되고 평가된 후 이를 개선하기 위한 대책이 수립되어 적용될 때까지 지속적인 관여가 필요하다. 탐색 및 체계 개발 단계에서 실제 설계 비용은 전체 대비 15 % 밖에 차지하지 않지만, 실제 영향력은 88 %를 차 지하고 있다. 이를 통해, 탐색 및 체계 개발 단계에서의 설계의 중요성을 알 수 있으며, 단계 별 설계 변경을 최소화하는 활동이 필요하다. 이는 DFMEA 활동의 중요성을 인식해야 하며, 그 결과를 설계에 반영할 수 있도록 모든 이해관계자들의 노력과 합의가 필요하다. 이에 따라, 설계에 초점을 맞춘 DFMEA를 적용한 결과를 설계 검 토회의에서 최적의 설계가 진행될 수 있도록 해야 한다. 고장에 대한 정의를 명확히 하고서 FMEA(Failure Mode and Effects Analysis)를 수행할 필요가 있다. 고장 정 의에 따른 고장 수준에 따라 권고조치 대상품목 수준이 결정되어지기 때문이다. 또한, RPN 평가 방법이 개선의 우선순위를 판단하기에 사업 특성 별로 상이하다. 즉, 평가 기준이 사업마다 주관적이기 때문에 평가가 모호하 다는 한계점이 있다. 따라서, 객관성을 보장할 수 있는 평가 방법이 필요하다. 조치 우선 순위를 결정한 이후에 이를 개선 조치하는 의지 및 실행이 부족한 실정이다. 방산분야에서는 DFMEA와 FMECA를 별개로 구분하여 분석 양식 및 수행하는 시점이 다르다. 다른 분석 양식을 통해 달리 분석을 수행하는 것은 업무의 효율성이 떨어질 뿐만 아니라 형식적인 업무로만 진행될 수 있다. 종래에는 DFMEA를 수행하기 전에 고장정의 및 판단기준(FDSC; Failure Definition Scoring Criteria) 설정 관 련 사항이 포함되지 않고서 고장유형 및 영향 분석을 수행하였다. 이에, DFMEA를 수행 시 정량적 기반으로 조치 우선 활동을 수행할 수 있는 근거 마련이 필요하다."}
{"patent_id": "10-2023-0079066", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고장 분석을 위한 고장 판단 정보를 설정하여 잠재 고장 모드를 식별하고, 잠재 고장 모드에 대한 평가를 수행하여 생성된 평가 결과 정보를 기반으로 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 판단하며, 평가 결과 정보 또는 기준 조치 우선 순위를 기반으로 선정된 적어도 하나의 기능 또는 아이템에 대해 권고 조치 방안을 설정하여 권고 조치 사 항 정보를 생성하는 무기 체계의 설계를 위한 고장 분석 방법 및 그를 위한 장치를 제공하는 데 주된 목적이 있 다."}
{"patent_id": "10-2023-0079066", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 의하면, 상기 목적을 달성하기 위한 고장 분석 장치에서 무기 체계의 설계를 위한 고장을 분석하는 방법에 있어서, 고장 분석 방법은, 상기 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고장 분석을 위한 고장 정의 및 판단 기준을 포함하는 고장 판단 정보를 설정하는 고장 분석 설정 단 계; 상기 기능 분석을 통해 구분된 적어도 하나의 기능 또는 아이템에 상기 고장 판단 정보를 매핑하여 잠재 고 장 모드를 식별하는 고장 모드 식별 단계; 상기 잠재 고장 모드에 대한 평가를 수행하여 평가 결과 정보를 생성 하는 고장 모드 분석 단계; 상기 평가 결과 정보를 기반으로 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 판단하는 우선 순위 결정 단계; 및 상기 평가 결과 정보 또는 기준 조치 우선 순위를 기반으로 선정된 상기 적어도 하나의 기능 또는 아이템에 대해 권고 조치 방안을 설정하여 권고 조치 사항 정보를 생성하는 권고 조치 사항 결정 단계를 포함할 수 있다. 또한, 본 발명의 다른 측면에 의하면, 상기 목적을 달성하기 위한 고장 분석 장치에 있어서, 상기 고장 분석 장 치는, 무기 체계의 설계를 위한 고장 분석을 위한 하나 이상의 프로그램을 저장하는 메모리; 및 상기 하나 이상 의 프로그램에 따라 상기 고장 분석을 위한 동작들을 수행하는 하나 이상의 프로세서를 포함하고, 상기 프로세 서에 의하여 수행되는 동작들은, 상기 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고 장 분석을 위한 고장 정의 및 판단 기준을 포함하는 고장 판단 정보를 설정하는 고장 분석 설정 단계; 상기 기 능 분석을 통해 구분된 적어도 하나의 기능 또는 아이템에 상기 고장 판단 정보를 매핑하여 잠재 고장 모드를 식별하는 고장 모드 식별 단계; 상기 잠재 고장 모드에 대한 평가를 수행하여 평가 결과 정보를 생성하는 고장 모드 분석 단계; 상기 평가 결과 정보를 기반으로 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 판 단하는 우선 순위 결정 단계; 및 상기 평가 결과 정보 또는 기준 조치 우선 순위를 기반으로 선정된 상기 적어 도 하나의 기능 또는 아이템에 대해 권고 조치 방안을 설정하여 권고 조치 사항 정보를 생성하는 권고 조치 사 항 결정 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0079066", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이, 본 발명은 실질적인 설계 고장모드 및 영향 분석을 수행하기 위해서 정량적인 평가 기반의 구체적인 조치 활동의 우선순위를 결정할 수 있다는 효과가 있다. 또한, 본 발명은 무기체계의 설계 고장모드 및 영향 분석 수행 방안으로 이해 관계자들의 설계 반영 및 자원 재 할당 시 관련 근거로 활용 가능한 효과가 있다. 또한, 본 발명은 비용 및 일정의 제약 사항 내에서 활동 우선 순위 판단의 명확한 근거에 따라 권고 조치 사항 을 객관적으로 결정할 수 있다는 효과가 있다. 또한, 본 발명은 다양한 무기 체계에 설계 고장모드 및 영향 분석을 수행할 수 있다는 효과가 있다."}
{"patent_id": "10-2023-0079066", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 본 발명을 설명함에 있어, 관 련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상 세한 설명은 생략한다. 또한, 이하에서 본 발명의 바람직한 실시예를 설명할 것이나, 본 발명의 기술적 사상은 이에 한정하거나 제한되지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있음은 물론이다. 이하에서는 도면 들을 참조하여 본 발명에서 제안하는 무기 체계의 설계를 위한 고장 분석 방법 및 그를 위한 장치에 대해 자세 하게 설명하기로 한다. 설계 고장모드 및 영향 분석(DFMEA)은 시스템이나 기기의 잠재적인 고장모드를 찾아내어 시스템이나 기기에 영 향을 미치는 고장모드에 적절한 대책을 세움으로써 고장을 미연에 방지하는 방법이다. 발생 가능한 모든 고장모 드와 고장영향을 정의해야 하며, 이를 근간으로 관련 대책을 효과적으로 수립해야 한다. 설계 고장모드 및 영향 분석은 잠재적 위험성과 관련 있는 고장모드에 대해서 각 고장모드의 심각도, 발생도 및 검출도를 추정하여 종합적인 중요도를 고려하여 필요한 권고조치사항을 결정하는데 효과적이다. 일반적으로 설계 고장모드 및 영향 분석을 수행 시 위험 우선 순위 값(RPN: Risk Priority Number)을 산출하여 사업별로 다양한 기준을 정하여 적용하고 있는 실정이다. 다시 말하면, 권고조치 사항에 대한 명확한 정량적 기 준이 없는 실정이다. 이러한 이유로 좀 더 구체적이고 객관적인 기준을 반영하기 위해서 분석 초기부터 고장정 의 및 판단기준을 명확하게 식별한 근거를 바탕으로 객관적인 분석을 수행해야 한다. 이를 위해서 고장 정의에 따른 고장 분류를 명확히 해야 한다. 잠재적 고장 모드를 식별하기 위해서는 기능에 따른 고장 모드를 누락없이 식별해 내야 한다. 또한, 권고조치 사항을 제시할 때 RPN 값을 활용하여 기준이 모호한 것에 대해서 보편적이고 합당한 근거가 필요하다. 따라서, 위의 사항들을 반영하여 본 발명에서는 고장정의 및 판단기준, 고장 분류, 기 능분석 이후에 관계 매트릭스 분석 및 활동 우선 순위(AP: Action Priority)에 대한 구체적인 활동을 적용하여 실현 가능한 DFMEA 절차를 제안한다. 도 1은 본 발명의 실시예에 따른 무기 체계의 설계를 위한 고장 분석 장치를 개략적으로 나타낸 블록 구성도이 다. 본 실시예에 따른 고장 분석 장치는 입력부, 출력부, 프로세서 및 메모리를 포함한다. 도 1의 고장 분석 장치는 일 실시예에 따른 것으로서, 도 1에 도시된 모든 블록이 필수 구성요소는 아니며, 다 른 실시예에서 고장 분석 장치에 포함된 일부 블록이 추가, 변경 또는 삭제될 수 있다. 한편, 고장 분석 장 치는 컴퓨팅 장치로 구현될 수 있고, 고장 분석 장치에 포함된 각 구성요소들은 각각 별도의 소프트웨 어 장치로 구현되거나, 소프트웨어가 결합된 별도의 하드웨어 장치로 구현될 수 있다. 입력부는 무기 체계의 설계를 위한 고장 분석 동작을 수행하기 위한 신호 또는 데이터를 입력하거나 획득하 는 수단을 의미한다. 입력부는 프로세서와 연동하여 다양한 형태의 신호 또는 데이터를 입력하거나, 외 부 장치와 연동하여 직접 데이터를 획득하여 프로세서로 전달할 수도 있다. 출력부는 프로세서와 연동하여 고장 분석 결과를 출력할 수 있다. 여기서, 고장 분석 결과는 평가 결과 정보, 우선 순위 결과 정보, 권고 조치 사항 정보 등을 포함할 수 있다. 출력부는 프로세서에서 생성된 권고 조치 사항 정보를 외부 장치(예: 관리자 단말, 설계 관련 장치 등)로 전달하여 무기 체계의 설계 작업에 반영되도록 할 수 있다. 입력부 및 출력부는 입출력 인터페이스부(미도시)와 연결될 수 있다. 입출력 인터페이스부는, 입력부 에서 획득된 정보를 프로세서에 전달하거나, 또는 프로세서로부터의 제어 신호를 입력 받아, 실질 적으로 입력부 및 출력부를 제어하기 위한 신호로 변환하도록 마련될 수 있다. 프로세서는 메모리에 포함된 적어도 하나의 명령어 또는 프로그램을 실행시키는 기능을 수행한다. 본 실시예에 따른 프로세서는 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고장 분석을 위한 고장 정의 및 판단 기준을 포함하는 고장 판단 정보를 설정한다. 또한, 프로세서는 기능 분석 을 통해 구분된 적어도 하나의 기능 또는 아이템에 상기 고장 판단 정보를 매핑하여 잠재 고장 모드를 식별한다. 또한, 프로세서는 잠재 고장 모드에 대한 평가를 수행하여 평가 결과 정보를 생성한다. 또한, 프 로세서는 평가 결과 정보를 기반으로 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 판단한다. 또한, 프로세서는 평가 결과 정보 또는 기준 조치 우선 순위를 기반으로 선정된 적어도 하나의 기능 또는 아이템에 대해 권고 조치 방안을 설정하여 권고 조치 사항 정보를 생성한다. 프로세서는 신경망(미도시)과 연동하여 고장 분석 동작을 처리할 수도 있다. 한편, 프로세서 및 신경망 (미도시)는 서로 다른 모듈인 것으로 기재하고 있으나 반드시 이에 한정되는 것은 아니며, 하나의 모듈로 결합 되어 각각의 동작이 수행되도록 구현될 수도 있다. 신경망(미도시)은 인공지능(AI: Artificial Intelligence)를 기반으로 고장 모드 식별, 고장 분류, 평가 결과 산출, 우선 순위 판단, 권고 조치 사항 결정 등 중 적어도 하나 또는 복수의 조합과 관련된 신경망 처리를 수행 할 수 있다. 신경망(미도시)은 입력 노드와, 중간 노드 및 출력 노드를 가지며, 각 노드를 연결하는 연결 가중치로서, 트레 이닝 데이터를 통해 미리 학습이 완료된 결정 가중치에 의하여 특정된 구조를 갖는다. 신경망(미도시)의 출력값 은, 확장 영역의 좌표값, 단위 블록 영역의 좌표값일 수 있으며, 확장 영역 또는 단위 블록 영역에 대한 특징값 행렬의 형태로 구현될 수 있다. 이하, 프로세서에서 수행되는 무기 체계의 설계를 위한 고장 분석 동작에 대해 설명하도록 한다. 프로세서는 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고장 분석을 위한 고장 정의 및 판단 기준을 포함하는 고장 판단 정보를 설정한다. 프로세서는 무기 체계의 업무 기술서(SOW: Statement of Work)에 기 설정된 적어도 하나의 요구 사항을 기 반으로 시스템 요구사항 정보를 확인한다. 프로세서는 필수 기능 고장 및 비필수 기능 고장으로 고장 사건을 분류하여 상기 고장 정의를 설정하고, 필 수 기능 고장 중 상기 요구 사항 정보에 대한 요구 기능을 수행하지 못하거나 요구 성능을 만족하지 못하는 사 건을 판단하기 위한 판단 기준을 설정하여 고장 판단 정보를 설정한다. 프로세서는 시스템 요구사항 정보에 대한 기능 분석을 수행한 기능 분석 결과를 기반으로 상위 기능 및 하 위 기능을 설정하여 적어도 하나의 기능 또는 아이템을 구분한 기능 분석 정보를 생성한다. 또한, 프로세서는 기능 분석을 통해 구분된 적어도 하나의 기능 또는 아이템에 상기 고장 판단 정보를 매핑 하여 잠재 고장 모드를 식별한다. 프로세서는 관계 매트릭스 기법을 활용하여 상기 고장 판단 정보를 상기 적어도 하나의 기능 또는 아이템에 매핑하여 잠재 고장 모드를 식별한다. 프로세서는 적어도 하나의 기능 또는 아이템 중 필수 기능 고장에 대한 식별을 추가로 수행한다. 또한, 프로세서는 잠재 고장 모드에 대한 평가를 수행하여 평가 결과 정보를 생성한다. 프로세서는 잠 재 고장 모드에 대한 심각도, 발생도 및 검출도 중 적어도 하나를 평가하여 평가 결과 정보를 생성한다. 프로세서는 기 설정된 심각도 평가 기준에 근거하여 상기 적어도 하나의 기능 또는 아이템 각각의 상기 잠 재 고장 모드에 대한 심각성을 평가하여 심각도를 평가한다. 프로세서는 기 산출된 신뢰도 예측값을 기반으로 상기 무기 체계의 설계 수명 동안의 고장 발생 가능성을 판단하여 발생도를 평가한다. 프로세서는 적어도 하나의 기능 또는 아이템 각각의 점검을 통한 검출 가능성을 기반으로 검출도를 평가한 다. 또한, 프로세서는 평가 결과 정보를 기반으로 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 판 단한다. 프로세서는 적어도 하나의 기능 또는 아이템 각각에 대한 평가 결과 정보에 포함된 심각도, 발생도 및 검출 도를 연산 처리하여 위험 우선 순위를 산출한다. 프로세서는 적어도 하나의 기능 또는 아이템 각각에 대해 심각도, 발생도 및 검출도의 가능한 조합 각각에 대한 개별 평가 결과를 기반으로 등급을 판단하여 조치 우선 순위를 판단한다. 또한, 프로세서는 평가 결과 정보 또는 기준 조치 우선 순위를 기반으로 선정된 적어도 하나의 기능 또는 아이템에 대해 권고 조치 방안을 설정하여 권고 조치 사항 정보를 생성한다. 프로세서는 평가 결과 정보의 심각도가 기 설정된 기준 심각도 이상이거나 위험 우선 순위의 값이 기 설정 된 기준값 이상인 것으로 판단된 적어도 하나의 기능 또는 아이템에 대해 설계 반영 활동을 수행하도록 작성된 권고 조치 방안을 포함하는 권고 조치 사항 정보를 생성한다. 프로세서는 평가 결과 정보의 심각도가 기 설정된 기준 심각도 미만이거나 위험 우선 순위의 값이 기 설정 된 기준값 미만인 것으로 판단된 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 확인한다. 프로세서 는 조치 우선 순위의 등급이 기준 조치 우선 순위에 해당하는 경우, 해당 기능 또는 아이템에 대해 설계 반 영 활동을 수행하도록 작성된 권고 조치 방안을 포함하는 권고 조치 사항 정보를 생성한다. 메모리는 프로세서에 의해 실행 가능한 적어도 하나의 명령어 또는 프로그램을 포함한다. 메모리는 고장 분석 동작을 위한 평가 동작, 우선 순위 결정 동작, 권고 조치 사항 생성 동작 등을 위한 명령어 또는 프 로그램을 포함할 수 있다. 또한, 메모리는 신경망 학습 결과 및 신경망의 입력값 또는 출력값의 전처리를 위한 동작 등을 위한 명령어 또는 프로그램을 포함할 수 있다. 도 2는 본 발명의 실시예에 따른 무기 체계의 설계를 위한 고장 분석 방법을 설명하기 위한 순서도이다. 도 3 내지 도 15는 본 발명의 실시예에 따른 고장 분석 방법의 세부 단계 각각을 설명하기 위한 예시도이다. 고장 분석 장치는 고장 분석 설정 단계를 수행한다(S210). 고장 분석 장치는 무기 체계의 시스템 요구사항 정보를 기반으로 기능 분석을 수행하고, 고장 분석을 위한 고장 정의 및 판단 기준을 포함하는 고장 판단 정보를 설정한다. 이하에서는, 단계 S210과 관련된 상세 동작 및 예시에 대해 설명하도록 한다. <단계 S212> 고장 분석 장치는 무기 체계의 업무 기술서(SOW: Statement of Work)에 기 설정된 적어도 하나의 요구 사항 을 기반으로 시스템 요구사항 정보를 확인한다. 고장 분석 장치는 무기체계의 업무 기술서(SOW: Statement of Work)에 기 설정된 적어도 하나의 요구 사항 을 기반으로 시스템 요구 사항 정보를 확인한다. 여기서, 업무 기술서는 기 저장된 문서 정보일 수 있으나 반드 시 이에 한정되는 것은 아니며, 외부 단말(미도시)로부터 획득된 문서 정보일 수 있다. 예를 들어, 고장 분석 장치는 도 3에 도시된 유도 무기체계에 대한 업무 기술서를 기반으로 유도 무기의 설 계를 위한 시스템 요구 사항 정보를 확인할 수 있다. 도 3의 유도 무기체계에 대한 업무 기술서의 내용은 예시일 뿐이며, 보안 규정 상 요구 사항에 대한 일부 내용 은 미표기된 업무 기술서이다. <단계 S214> 고장 분석 장치는 필수 기능 고장 및 비필수 기능 고장으로 고장 사건을 분류하여 상기 고장 정의를 설정하 고, 필수 기능 고장 중 상기 요구 사항 정보에 대한 요구 기능을 수행하지 못하거나 요구 성능을 만족하지 못하 는 사건을 판단하기 위한 판단 기준을 설정하여 고장 판단 정보를 설정한다. 고장 분석 장치는 고장 정의 및 판단 기준을 설정하고, 설정된 고장 정의 및 판단 기준을 포함하는 고장 판 단 정보를 생성한다. 고장 판단 정보의 고장 정의 및 판단 기준은 무기 체계의 시험 평가 계획을 위한 문서 형태로 작성되며, 시험 평가의 항목을 포함하는 형태로 생성된다. 고장 분석 장치는 사용자의 설정에 따라 시스템의 성능 저하 및 허용할 수 없는 성능을 고장 정의로 설정할 수 있다. 고장 분석 장치는 구성요소 또는 하위 시스템 오작동으로 입증될 때 오작동을 야기한 원인과 관계 없이 고장으로 간주될 수 있다. 고장 사건 분류는 도 4에 도시된 바와 같이, 필수 기능 고장(EFF: Essential Function Failure) 및 비필수 기 능 고장(NEFF: Non-Essential Function Failure)으로 분류될 수 있다. 고장 판단 정보에 포함된 고장 정의 및 판단 기준(FDSC: Failure Definition Scoring Criteria)은 시험 준비 상태 검토(TRR: Test Readiness Review) 시 준비되는 문서 중의 하나로 구성되며, 시험 평가 시에 고장 판단의 기준을 제시하는 기준이 되는 문서일 수 있다. 고장 분석 장치는 시스템의 신뢰성 평가에 사용되는 모든 해당 사건을 검토하고 채점하기 위한 구체적이고 합의된 프로세스에 대한 판단 기준을 설정할 수 있다. 고장 분석 장치는 도 5에 도시된 바와 같이, 신뢰성 고장(R), 정비성 고장(M) 및 신뢰성/정비성이 아닌 다 른 고장(O)으로 시험 사건 분류를 수행할 수 있다. 고장 판단 정보에 포함된 고장 정의 및 판단 기준의 주요 기능은 시스템의 정상적인 작동으로 간주되는 것 및 시험 이벤트를 분류하기 위한 프로세스이다. 고장 분석 장치는 시스템의 고장 정의를 수립함에 있어서 필수 기능 고장에 따라 명확한 시험 이벤트로 분 류하는 것이 중요하다. 시험 이벤트로 분류는 시스템이 요구 기능을 수행하지 못하게 되거나 요구 성능을 만족 하지 못하게 되는 사건을 식별하여 분류하는 것을 의미한다. 이후, 고장 분석 장치는 권고조치 사항 결정을 위한 관리 방안을 시험 이벤트와 연계하여 도 6과 같이 설정 할 수 있다.<단계 S216> 고장 분석 장치는 시스템 요구사항 정보에 대한 기능 분석을 수행한 기능 분석 결과를 기반으로 상위 기능 및 하위 기능을 설정하여 적어도 하나의 기능 또는 아이템을 구분한 기능 분석 정보를 생성한다. 고장 분석 장치는 시스템 요구 사항 정보에 대한 기능 분석을 수행한 기능 분석 결과를 기반으로 상위 기능 및 하위 기능을 설정하여 기능 분석 정보를 생성한다. 예를 들어, 유도 무기에 대한 기능 분석을 수행한 결과(기능 분석 결과)를 기반으로 생성된 기능 분석 정보는 도 7과 같다. 유도 무기의 기능 분석 정보에서, 상위 기능은 요격(Interception)으로 설정되고, 하위 기능은 제 어(Control), 발사(Launch), 데이터링크(Data Link), 탐지(Detection), 추진(Propulsion), 구동(Drive), 폭파 (Explosion), 전원(Power) 및 보호(Protection) 등 중 하나 또는 복수의 조합으로 설정될 수 있다. 고장 분석 장치는 잠재 고장 모드 식별 단계를 수행한다(S220). 고장 분석 장치는 기능 분석을 통해 구분된 적어도 하나의 기능 또는 아이템에 상기 고장 판단 정보를 매핑 하여 잠재 고장 모드를 식별한다. 이하에서는, 단계 S220과 관련된 상세 동작 및 예시에 대해 설명하도록 한다. 고장 분석 장치는 관계 매트릭스 기법을 활용하여 상기 고장 판단 정보를 상기 적어도 하나의 기능 또는 아 이템에 매핑하여 잠재 고장 모드를 식별한다. 고장 분석 장치는 적어도 하나의 기능 또는 아이템 중 필수 기능 고장에 대한 식별을 추가로 수행한다. 고장 분석 장치는 무기 체계의 분석 대상 아이템에 대하여 하위 구성(시스템 구성 아이템)이 잠재적으로 기 능을 수행하지 못할 경우 잠재 고장 모드로 식별할 수 있다. 잠재 고장 모드의 식별 결과는 도 8과 같이 표현될 수 있다. 고장 정의는 필수 기능 고장(EFF: Essential Function Failure) 및 비필수 기능 고장(NEFF: Non-Essential Function Failure)으로 구분된다. 도 8에 도시된 바와 같이, 관계 매트릭스 분석 시 행은 기능(예: Control, Launch, Data Link 등)을 나열하였고, 열은 하드웨 어 목록(예: Seeker, Guided control device 등)이 기록될 수 있다. 고장 분석 장치는 관계 매트릭스를 활용한 유도 무기의 필수 기능 수행 여부를 분석하여 고장 정의를 더 정 교화할 수 있다. 고장 분석 장치는 기능 분석에서 도출된 기능에 기반하여 도 8과 같이, 필수 기능 고장 'E'를 부여하여 잠재 고장 모드를 식별할 수 있다. 고장 분석 장치는 고장 모드 분석 단계를 수행한다(S230, S240, S250). 고장 분석 장치는 잠재 고장 모드에 대한 평가를 수행하여 평가 결과 정보를 생성한다. 고장 분석 장치(1 0)는 잠재 고장 모드에 대한 심각도, 발생도 및 검출도 중 적어도 하나를 평가하여 평가 결과 정보를 생성한다. 고장 분석 장치는 기 설정된 심각도 평가 기준에 근거하여 상기 적어도 하나의 기능 또는 아이템 각각의 상 기 잠재 고장 모드에 대한 심각성을 평가하여 심각도를 평가한다. 고장 분석 장치는 기 산출된 신뢰도 예측 값을 기반으로 상기 무기 체계의 설계 수명 동안의 고장 발생 가능성을 판단하여 발생도를 평가한다. 고장 분석 장치는 적어도 하나의 기능 또는 아이템 각각의 점검을 통한 검출 가능성을 기반으로 검출도를 평가한다. 이하에서는, 단계 S230, S240 및 S250과 관련된 상세 동작 및 예시에 대해 설명하도록 한다. <단계 S232> 고장 분석 장치는 잠재 고장 영향을 결정하여 잠재 고장 영향 정보를 생성한다. 잠재 고장 영향 정보는 고장 모드에 따른 분석 대상 아이템의 운용 또는 기능에 대한 고장의 영향에 대한 결과 를 식별하여 생성된다. 고장 분석 장치는 잠재 고장 모드에 따라 발생할 수 있는 복수의 후보 고장 영향 중 하나를 잠재 고장 영향 으로 결정하여 잠재 고장 영향 정보를 생성할 수 있다. 여기서, 하나를 잠재 고장 영향을 선정하는 동작은 기 설정된 고장 영향의 중요도를 기반으로 선정하는 것이 바람직하나 반드시 이에 한정되는 것은 아니다. 도 14에 도시된 바와 같이, 잠재적 고장 영향(Potential Effect)은 고장 모드의 결과로 정의될 수 있다. 즉, 잠재적 고장 영향은 분석 대상 아이템의 하위 아이템의 잠재 고장모드에 따라 미치는 영향일 수 있다. 또한, 잠재적 고장 영향은 신뢰성뿐만 아니라 안전에 영향을 미칠 수 있는 영향을 포함할 수 있다. <단계 S234> 고장 분석 장치는 심각도 평가를 수행하여 심각도 평가 결과 정보를 생성한다. 고장 분석 장치는 잠재 고장 모드에 의해 무기체계의 구성요소에 미칠 수 있는 영향의 심각성에 대한 심각 도 평가를 수행한다. 고장 분석 장치는 기 설정된 심각도 평가 기준에 근거하여 심각도 점수를 부여하여 심각도 평가 결과 정보 를 생성할 수 있다. 여기서, 심각도 평가 기준은 도 9에 도시된 표와 같다. 예를 들어, 고장 분석 장치는 안전성 설계와 관련된 심각도 부여 점수는 9 이상을 적용할 수 있다. 여기서, 심각도 부여 점수에 따라 심각도 10은 운용자 사망, 심각도 9는 장비 손실, 나머지 심각도는 장비 별 임무 중요 도에 따른 임무 능력 수행 수준으로 등급을 적용할 수 있다. 도 14를 참고하여, 심각도 평가 결과 정보를 설명하면 다음과 같다. 예를 들어, 고장 분석 장치는 심각도 평가 결과, 고장모드의 예고가 있는 탐색기에 대해 9 점을 부여하고, 탄 안전과 관련한 폭발장치, 사용자 운용 및 탄 점검에 대해 8 점을 부여할 수 있다. 고장 분석 장치에서 가장 낮게 4 점이 부여된 항목은 탄 보호장치 및 시뮬레이터를 활용한 훈련에 관한 사항일 수 있다. 도 14를 참고하면, 고장 분석 장치는 안전성 설계와 관련된 심각도 9 이상을 적용하면, 심각도 9 이상인 대 상은 탐색기 및 사용자 운용 오류, 사용자 점검 오류, 사용자 훈련 오류가 해당된다. <단계 S242> 고장 분석 장치는 고장에 대한 분류를 수행하여 고장 분류 정보를 생성한다. 고장 분석 장치는 고장 모드에 대해 고장 분류를 수행하며, 고장 분류 시 신뢰성 고장은 R(Reliability), 정비성 고장은 M(Maintainability), 안전성 고장은 S(Safety) 및 기타 고장은 O(Others)로 분류한다. 고장 분석 장치는 고장 분류를 통해 설계 반영 활동과 연계되도록 할 수 있다. 도 14를 참조하면, 고장 분석 장치는 탐색기, 사용자 운용 및 탄 점검은 안전성 고장인 S(Safety)로 분류하 고, 탄 보호장치는 정비성 고장인 M(Maintainability)로 분류할 수 있다. <단계 S244> 고장 분석 장치는 잠재 고장 원인을 결정하고, 잠재 고장 원인에 대한 잠재 고장 원인 정보를 생성한다. 고장 분석 장치에서 잠재 고장 원인은 예방 및 탐지가 명확하게 적용할 수 있도록 하드웨어 기반으로 분석 을 수행한다. 고장 분석 장치은 하드웨어 기반으로 분석 결과에 근거하여 고장 정비 및 예방 정비 업무에 매핑하여 잠재 고장 원인을 결정할 수 있다. 고장 분석 장치의 잠재 고장 원인은 고장모드가 발생할 수 있는 사유를 나타낸다. 잠재 고장 원인은 기 설정된 고장 메커니즘에 의해 도출될 수 있으며, 잠재 고장 원인의 결과는 잠재 고장 모드 에 대응된다. 잠재 고장 원인은 예방 및 검출 통제를 보다 정확하게 적용할 수 있도록 한다. 이에 따라, 가능한 범위 내에서 각 잠재 고장 모드에 대한 모든 잠재적 고장 원인을 식별하는 것이 바람직하다. 단, 잠재 고장 원인의 결정 시 복수의 항목이 존재하는 경우, 하드웨어 기준에서 가장 우선순위 항목을 선정하여 잠재 고장 원인 정보에 적용 하는 것이 바람직하다. <단계 S246> 고장 분석 장치는 현재 설계 관리 방법을 구분하여 현재 설계 관리 정보를 생성한다. 고장 분석 장치는 분석 대상 아이템 각각에 대한 현재 설계 관리 가능한 방법을 예방(Prevention) 및 탐지 (Detection)로 구분한다. 현재 설계 관리 정보는 예방인 경우 'P' 및 탐지인 경우 'D'로 표현될 수 있다. 도 14에 도시된 바와 같이, 현재 설계 관리 방법은 고장 탐지를 위한 BIT 점검, 시험장비로 점검, 육안점검 및 예방 정비를 수행을 위한 예방 점검 아이템으로 선정한다. 주요 성능을 구현하는 아이템에 대하여 BIT 설계를수행하고, BIT가 불가한 아이템은 예방 정비를 통해 해소할 수 있도록 한다. <단계 S248> 고장 분석 장치는 고장 발생에 대한 발생도를 평가한다. 고장 분석 장치의 발생도 평가는 무기 체계의 설계 수명 동안 고장 발생 가능성을 판단하는 것을 의미하며, 기 산출된 신뢰도 예측값을 기준으로 평가할 수 있다. 고장 분석 장치는 신뢰도 예측값을 기반으로 예측된 고장률 값을 활용하여 발생도를 평가할 수 있다. 도 14에 도시된 바와 같이, 발생도 평가는 설계 수명 동안 고장 발생 가능성을 판단한 결과이다. 예를 들어, 고장 분석 장치는 신뢰도 예측 값을 기준으로 해당 등급에 따라 1~10 점수를 부여할 수 있다. 고장 분석 장치는 예측된 고장률 값을 기준으로 도 10을 활용하여 탐색기 7점, 유도조종장치 5점, 추진기관 3점 순으로 발생도에 대한 점수를 부여할 수 있다. <단계 S250> 고장 분석 장치는 잠재 고장 원인 및 고장 모드 탐지 여부를 판단하여 검출도를 평가한다. 도 11에 도시된 바와 같이, 고장 분석 장치의 검출도 평가는 잠재적인 고장원인 및 고장모드 탐지여부를 판 단할 수 있다. 도 14에 도시된 바와 같이, 검출도 평가는 점검을 통해 검출 가능성이 높은 아이템은 3 점을 부 여할 수 있다. 고장 분석 장치는 우선 순위 결정 단계를 수행한다(S260). 고장 분석 장치는 평가 결과 정보를 기반으로 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 판 단한다. 이하에서는, 단계 S260과 관련된 상세 동작 및 예시에 대해 설명하도록 한다. <단계 S262> 고장 분석 장치는 위험 우선 순위 값(RPN: Risk Priority Number)을 산출한다. 고장 분석 장치는 적어도 하나의 기능 또는 아이템 각각에 대한 평가 결과 정보에 포함된 심각도, 발생도 및 검출도를 연산 처리하여 위험 우선 순위를 산출한다. 고장 분석 장치는 잠재 고장 모드의 도출 이후에 리스크 파악 및 평가를 위해 위험 우선 순위 값을 산출한 다. 위험 우선 순위 값은 심각도(S: Severity), 발생도(O: Occurrence) 및 검출도(D: Detection)를 곱하여 [수학식 1]과 같이 산출될 수 있다. 수학식 1"}
{"patent_id": "10-2023-0079066", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "위험 우선 순위 값은 조치 활동이 수행되고 나면, 조치 이후 기존 대비 개선된 정도를 측정할 수 있는 정량적 정보를 제공하는데 활용될 수 있다. 위험 우선 순위 값은 심각도, 발생도 및 검출도를 곱하여 도 14에 도시된 바와 같이 산출될 수 있다. 예를 들어, 위험 우선 순위 값이 가장 큰 아이템은 탐색기이고, 위험 우선 순위 값이 가장 작은 아이템은 탄 구속장 치일 수 있다. < 단계 S264 및 단계 S266> 고장 분석 장치는 조치 우선 순위(AP: Action Priority)를 판단한다. 고장 분석 장치는 적어도 하나의 기능 또는 아이템 각각에 대해 심각도, 발생도 및 검출도의 가능한 조합 각각에 대한 개별 평가 결과를 기반으로 등급을 판단하여 조치 우선 순위를 판단한다. 고장 분석 장치는 심각도, 발생도 및 검출도의 가능한 모든 조합에 대한 논리 세부 정보를 활용하여 조치 우선 순위의 등급을 판단할 수 있다. 각 조치 우선 순위의 등급에는 논리 기반 설명이 포함될 수 있다. 고장 분석 장치는 심각도, 발생도 및 검출도의 조합된 값에 대한 개별 평가 기반으로 조치의 우선순위를 결 정할 수 있다. 여기서, 조치 우선 순위는 우선 순위 높음(H), 우선 순위 보통(M) 및 우선 순위 낮음(L)으로 구 분될 수 있다. H는 우선 순위가 최우선 순위로써 적절한 예방 및 검출 통제를 통해 개선해야 하며, M은 적절한 조치를 식별하거나 재량에 따라 통제 수준을 결정하며, L은 개선하기 위한 조치를 식별할 수 있다. 고장 분석 장치는 무기 체계의 안전성 설계를 위해서 심각도가 9 이상인 경우에는 권고조치 활동을 수행한 다. 이후, 심각도가 8 이하인 경우에는 발생도 및 검출도를 고려한 조치 우선 순위를 적용하며, 조치 우선 순위 가 'H'인 아이템에 대하여 권고조치 활동을 수행되도록 한다. 조치 우선 순위는 조치 활동에 대한 우선 순위가 아니라 위험을 감소시키기 위한 조치의 필요성에 대한 우선순 위를 의미한다. 도 12에 도신된 표를 활용하여 도 14의 조치 우선 순위를 판단하면, 조치 우선 순위 가 'H'인 아이템은 1, 2, 7, 9 항목, 'M'은 6 항목, 'L'은 3, 4, 5, 8, 10~14 항목으로 판단된다. 고장 분석 장치는 심각도가 9 이상인 경우와 심각도가 8 이하이면서 조치 우선 순위가 'H'에 해당되는 경우 에 대해서 설계 반영을 위한 권고 조치사항에 포함되도록 설정할 수 있다. 고장 분석 장치는 권고 조치 사항 결정 단계를 수행한다(S270). 고장 분석 장치는 평가 결과 정보 또는 기준 조치 우선 순위를 기반으로 선정된 적어도 하나의 기능 또는 아이템에 대해 권고 조치 방안을 설정하여 권고 조치 사항 정보를 생성한다. 고장 분석 장치는 평가 결과 정보의 심각도가 기 설정된 기준 심각도 이상이거나 위험 우선 순위의 값이 기 설정된 기준값 이상인 것으로 판단된 적어도 하나의 기능 또는 아이템에 대해 설계 반영 활동을 수행하도록 작 성된 권고 조치 방안을 포함하는 권고 조치 사항 정보를 생성한다. 고장 분석 장치는 평가 결과 정보의 심각도가 기 설정된 기준 심각도 미만이거나 위험 우선 순위의 값이 기 설정된 기준값 미만인 것으로 판단된 적어도 하나의 기능 또는 아이템에 대한 조치 우선 순위를 확인한다. 고장 분석 장치는 조치 우선 순위의 등급이 기준 조치 우선 순위에 해당하는 경우, 해당 기능 또는 아이템에 대 해 설계 반영 활동을 수행하도록 작성된 권고 조치 방안을 포함하는 권고 조치 사항 정보를 생성한다. 구체적으로, 고장 분석 장치는 무기 체계의 설계 변경을 위한 권고 조치 사항 정보를 생성한다. 고장 분석 장치는 고장 분류에 따라 설계반영 활동을 수행하도록 권고 조치 방안을 포함하는 권고 조치 사 항 정보를 생성한다. 고장 분석 장치는 고장탐지 및 고장배제 활동과 연계하여 운용 유지 단계에서 활용할 수 있도록 생성된 권 고 조치 사항 정보를 외부 장치(예: 관리자 단말, 설계 관련 장치 등)로 제공한다. 고장 분석 장치는 설계변경, BIT 점검, 시험장비로 점검, 육안점검, 예방정비 및 신뢰성시험 수행 등을 포 함하는 권고 조치 사항을 포함하는 권고 조치 사항 정보를 생성할 수 있다. 고장 분석 장치는 조치 우선 순위 기반의 권고 조치 사항 선정 방안을 적용하여 권고 조치 사항을 선정할 수 있다. 이를 통해 권고 조치 사항 정보는 위험 완화 조치를 수행할 수 있는 판단 근거로 사용될 수 있다. 도 14를 참고하면, 고장 분석 장치는 안전성 설계를 위한 심각도가 9 이상인 경우인 1, 12, 13 및 14번 항 목에 대하여 권고 조치 활동을 수행하도록 결정할 수 있다. 즉, 고장 분석 장치는 1, 12, 13 및 14번 항목 에 대한 권고 조치 활동을 포함하는 권고 조치 사항 정보를 생성할 수 있다. 권고 조치 사항 정보에서, 1번 항목은 안전성 관련 조치 우선 대상으로 신뢰성 시험을 수행하여 요구사항 만족 여부를 추가로 확인할 수 있도록 조치하고, BIT 점검이 필요한 아이템으로 결정된다. 또한, 12번 항목은 사용자 운용의 오류로 인한 심각도 9인 고장 분류가 'S'로 설정하여 BIT 점검이 필요한 것으로 결정된다. 또한, 13번 및 14번 항목은 사용자 점검 및 훈련의 오류로 인한 심각도 9인 고장 분류가 'S'로 설정하여 유도 무기 시뮬레 이터를 적용한 설계가 필요한 것으로 결정된다. 이후, 고장 분석 장치는 심각도가 8 이하인 경우에 발생도 및 검출도를 고려하여 조치 우선 순위가 'H'에 해당되는 아이템에 대하여 권고조치 활동이 수행되도록 한다. 즉, 고장 분석 장치는 2, 7 및 9번 항목에 대 한 권고 조치 활동을 포함하는 권고 조치 사항 정보를 생성할 수 있다. 권고 조치 사항 정보에서, 2번 항목에 대한 정보는 심각도 7, 발생도 5, 검출도 5인 조치 우선 대상으로 다중화 설계를 통한 신뢰성을 향상시킬 수 있도록 조치하기 위한 정보로 결정된다. 또한, 7번 항목에 대한 정보는 심각 도 7, 발생도 5, 검출도 5인 조치 우선 대상으로 예방정비 항목(예: 10년, 주기교환아이템)으로 설정하여 운용 성을 향상시킬 수 있도록 하는 정보로 결정될 수 있다. 또한, 9번 항목에 대한 정보는 심각도 7, 발생도 4, 검 출도 5인 조치 우선 대상으로 예방정비 항목(예: 5년, 주기교환아이템)으로 설정하여 운용성을 향상시킬 수 있 도록 하는 정보로 결정될 수 있다. 도 2에서는 각 단계를 순차적으로 실행하는 것으로 기재하고 있으나, 반드시 이에 한정되는 것은 아니다. 다시 말해, 도 2에 기재된 단계를 변경하여 실행하거나 하나 이상의 단계를 병렬적으로 실행하는 것으로 적용 가능할 것이므로, 도 2는 시계열적인 순서로 한정되는 것은 아니다. 도 2에 기재된 본 실시예에 따른 무기 체계의 설계를 위한 고장 분석 방법은 애플리케이션(또는 프로그램)으로 구현되고 단말장치(또는 컴퓨터)로 읽을 수 있는 기록매체에 기록될 수 있다. 본 실시예에 따른 무기 체계의 설 계를 위한 고장 분석 방법을 구현하기 위한 애플리케이션(또는 프로그램)이 기록되고 단말장치(또는 컴퓨터)가 읽을 수 있는 기록매체는 컴퓨팅 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치 또 는 매체를 포함한다. 도 15에서는 본 실시예에 따른 고장 분석을 수행한 기대효과에 대해 설명하도록 한다. 종래의 DFMEA 양식에서는 위험 우선 순위(RPN) 값만 제시되어 있어서 설계반영에 대한 정량적으로 반영하기 어 렵다. 이를 보완하기 위해 본 발명에서는 조치 우선 순위(AP)를 활용하였고, 조치 우선 순위(AP) 결정에 따른 설계 반영 활동을 정량화 할 수 있다. 도 15의 (a)의 위험 우선 순위(RPN) 지수를 활용하여 초기 분석 대비 수 정 조치 결과 이후의 개선 정도를 산출한 결과는 도 15의 (b)와 같다. 본 발명에서의 고장 분석에서는 위험을 완화하기 위한 조치를 결정하고, 해당 조치의 효과를 평가한다. 위험분 석 결과를 검토하고, 고장원인 또는 고장모드를 감지하기 위해서 고장 원인 발생도를 낮추거나 검출도를 높이기 위한 조치를 수행할 수 있다. 그 결과, 조치 우선 대상 아이템인 1, 2 항목은 BIT 점검뿐만 아니라 신뢰성 시험 및 다중화 설계를 수행하여 발생도를 낮출 수 있게 된 것을 확인할 수 있다. 또한, 7, 9 항목은 예방정비 항목 으로 정비주기를 결정하여 검출도를 높일 수 있게 된 것을 확인할 수 있다. 결과적으로, 조치 우선 순위(AP)가 High에서 Medium으로 변경되도록 조치된 것을 확인할 수 있다. 또한, 위험 우선 순위(RPN) 지수는 초기 위험우선 순위 대비 29.444 % 개선됨을 확인할 수 있다. 이상의 설명은 본 발명의 실시예의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명의 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자라면 본 발명의 실시예의 본질적인 특성에서 벗어나지 않는 범위에 서 다양한 수정 및 변형이 가능할 것이다. 따라서, 본 발명의 실시예들은 본 발명의 실시예의 기술 사상을 한정 하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 실시예의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 실시예의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등 한 범위 내에 있는 모든 기술 사상은 본 발명의 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0079066", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 무기 체계의 설계를 위한 고장 분석 장치를 개략적으로 나타낸 블록 구성도이 다. 도 2는 본 발명의 실시예에 따른 무기 체계의 설계를 위한 고장 분석 방법을 설명하기 위한 순서도이다. 도 3 내지 도 15는 본 발명의 실시예에 따른 고장 분석 방법의 세부 단계 각각을 설명하기 위한 예시도이다."}
