{"patent_id": "10-2023-0108543", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0027132", "출원번호": "10-2023-0108543", "발명의 명칭": "냉장고 및 그의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "김수강"}}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "냉장고(100)에 있어서, 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 출력하는 출력 인터페이스(120);적어도 하나의 키(key)를 통해 사용자의 입력을 수신하는 사용자 인터페이스(130);적어도 하나의 인스트럭션을 저장하는 메모리(140); 및적어도 하나의 프로세서(110)를 포함하고,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 냉장고(100)의 이상 상태 발생 여부를 식별하고, 상기 냉장고(100)의 이상 상태가 발생한 것에 기초하여, 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 출력하도록 상기 출력 인터페이스(120)를 제어하고,기 정의된 동작에 매핑(mapping)된 상기 적어도 하나의 키에 대한 사용자의 입력에 따라, 상기 냉장고(100)의이상 상태 발생에 대한 알림을 끄도록 상기 출력 인터페이스(120)를 제어하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 출력 인터페이스(120)는, 디스플레이(122)를 더 포함하고,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 냉장고(100)의 이상 상태 발생에 대한 알림이 꺼진 것에 기초하여, 상기 냉장고(100)의 이상 상태 발생에대한 알림이 꺼져있음을 나타내는 정보를 출력하도록 상기 디스플레이(122)를 제어하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항 또는 제2 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 냉장고(100)의 이상 상태가 발생하지 않은 것에 기초하여, 상기 적어도 하나의 키에 대한 사용자의 입력에따라 상기 기 정의된 동작을 수행하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항 내지 제3 항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 메모리(140)에 저장된 상기 냉장고(100)에 대한 정보를 식별하고,상기 냉장고(100)에 대한 정보에 이상이 존재한다고 판단한 것에 기초하여, 상기 냉장고(100)에 이상 상태가 발생한 것으로 판단하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 냉장고(100)에 대한 정보는,상기 냉장고(100)의 기능에 따라서 상기 냉장고(100)를 구동시키는 프로그램을 결정하기 위한 정보를 포함하는,공개특허 10-2025-0027132-3-냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 식별된 냉장고(100)에 대한 정보가 제1 상태 정보 또는 제2 상태 정보이거나, 상기 메모리(140)의 복수의저장 공간 중 적어도 하나의 저장 공간에서 식별된 상기 냉장고(100)에 대한 정보가 상기 복수의 저장 공간 중나머지 저장 공간에서 식별된 상기 냉장고(100)에 대한 정보와 상이한 것에 기초하여, 상기 냉장고(100)에 대한정보에 이상이 존재한다고 판단하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항 내지 제6 항 중 어느 한 항에 있어서,상기 냉장고(100)는, 적어도 하나의 도어(1630)를 더 포함하고,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 적어도 하나의 도어(1630)가 기 설정된 시간 이상 개방되어 있는 것에 기초하여, 상기 냉장고(100)에 이상상태가 발생한 것으로 판단하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항 내지 제7 항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 끄기 위한 상기 적어도 하나의 키에 대한 사용자의 입력이유지되는 시간을 식별하고, 상기 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 2n초 미만인 경우, 상기 냉장고(100)의 이상상태 발생에 대한 알림을 정해진 시간동안 끄고, 상기 정해진 시간이 지나면 출력하도록 상기 출력 인터페이스(120)를 제어하는, 냉장고(100)(n은 양수)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 상기 2n초 이상인 경우, 상기 냉장고(100)의이상 상태 발생에 대한 알림이 꺼진 상태가 제1 상황이 발생하기 전까지 유지되도록 상기 출력 인터페이스(120)를 제어하고,상기 제1 상황은, 상기 냉장고(100)의 이상 상태 발생에 대한 알림이 꺼진 상태에서 상기 적어도 하나의 키에대한 사용자의 입력을 획득한 상황 또는 상기 냉장고(100)의 이상 상태가 해결된 상황에 해당하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항 내지 제9 항 중 어느 한 항에 있어서,상기 출력 인터페이스(120)는, 디스플레이(122)를 더 포함하고,상기 사용자 인터페이스(130)는, 기 정의된 동작에 매핑되지 않은 더미 키(dummy key)를 더 포함하고,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 냉장고(100)의 이상 상태가 발생한 것에 기초하여, 상기 더미 키가 상기 냉장고(100)의 이상 상태 발생에대한 알림을 제어할 수 있다는 정보를 출력하도록 상기 디스플레이(122)를 제어하고,공개특허 10-2025-0027132-4-상기 더미 키에 대한 사용자의 입력에 따라, 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 끄도록 상기 출력 인터페이스(120)를 제어하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항 내지 제10 항 중 어느 한 항에 있어서,상기 냉장고(100)는, 통신 모듈(150)을 더 포함하고,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 외부 장치로 전송하도록 상기 통신 모듈(150)을 제어하고,상기 외부 장치로부터 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 끄기 위한 제어 명령을 수신하도록 상기 통신 모듈을 제어하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항 내지 제11 항 중 어느 한 항에 있어서,상기 냉장고(100)는, 통신 모듈(150)을 더 포함하고,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 냉장고(100)의 이상 상태 발생에 대한 알림 해제 이력을 외부 장치로 전송하도록 상기 통신 모듈(150)을제어하는, 냉장고(100)."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "냉장고(100)의 동작 방법에 있어서,상기 냉장고(100)의 이상 상태 발생 여부를 식별하는 단계; 상기 냉장고(100)의 이상 상태가 발생한 것에 기초하여, 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 출력하도록 출력 인터페이스(120)를 제어하는 단계; 및기 정의된 동작에 매핑(mapping)된 적어도 하나의 키(key)에 대한 사용자의 입력에 따라, 상기 냉장고(100)의이상 상태 발생에 대한 알림을 끄도록 상기 출력 인터페이스(120)를 제어하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 동작 방법은, 상기 냉장고(100)의 이상 상태 발생에 대한 알림이 꺼진 것에 기초하여, 상기 냉장고(100)의 이상 상태 발생에대한 알림이 꺼져있음을 나타내는 정보를 출력하도록 상기 디스플레이(122)를 제어하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항 또는 제14 항에 있어서,상기 동작 방법은, 상기 냉장고(100)의 이상 상태가 발생하지 않은 것에 기초하여, 상기 적어도 하나의 키에 대한 사용자의 입력에따라 상기 기 정의된 동작을 수행하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13 항 내지 제15 항 중 어느 한 항에 있어서,상기 냉장고(100)의 이상 상태 발생 여부를 식별하는 단계는,상기 냉장고(100)의 메모리(140)에 저장된 상기 냉장고(100)에 대한 정보를 식별하는 단계; 및공개특허 10-2025-0027132-5-상기 냉장고(100)에 대한 정보에 이상이 존재한다고 판단한 것에 기초하여, 상기 냉장고(100)에 이상 상태가 발생한 것으로 판단하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13 항 내지 제16 항 중 어느 한 항에 있어서,상기 동작 방법은, 상기 냉장고(100)에 포함된 적어도 하나의 도어(1630)가 기 설정된 시간 이상 개방되어 있는 것에 기초하여, 상기 냉장고(100)에 이상 상태가 발생한 것으로 판단하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1 항 내지 제9 항 중 어느 한 항에 있어서,상기 동작 방법은, 상기 냉장고(100)의 이상 상태가 발생한 것에 기초하여, 정의된 동작에 매핑되지 않은 더미 키(dummy key)가 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 제어할 수 있다는 정보를 출력하도록 상기 디스플레이(122)를제어하는 단계; 및 상기 더미 키에 대한 사용자의 입력에 따라, 상기 냉장고(100)의 이상 상태 발생에 대한 알림을 끄도록 상기 출력 인터페이스(120)를 제어하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13 항 내지 제18 항 중 어느 한 항에 있어서,상기 동작 방법은, 상기 냉장고(100)의 이상 상태 발생에 대한 알림 해제 이력을 외부 장치로 전송하도록 통신 모듈(150)을 제어하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-0108543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항 내지 제19항 중 어느 한 항의 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2023-0108543", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "냉장고 및 그의 제어 방법이 제공된다. 냉장고는, 냉장고의 이상 상태 발생에 대한 알림을 출력하는 출력 인터페 이스, 적어도 하나의 키(key)를 통해 사용자의 입력을 수신하는 사용자 인터페이스, 적어도 하나의 인스트럭션을 저장하는 메모리, 및 적어도 하나의 프로세서를 포함한다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션 을 실행함으로써, 냉장고의 이상 상태 발생 여부를 식별한다. 적어도 하나의 프로세서는 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력하도록 출력 인터페이스를 제어한다. 적어도 하나의 프로세서는 기 정의된 동작에 매핑(mapping)된 적어도 하나의 키에 대한 사용자의 입력에 따라, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어한다."}
{"patent_id": "10-2023-0108543", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 실시예는 냉장고, 냉장고의 제어 방법, 및 냉장고의 제어 방법을 수행하는 컴퓨터 프로그램을 저장하 는 기록 매체에 관한 것이다."}
{"patent_id": "10-2023-0108543", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 냉장고는 식품의 신선도를 유지하여 보관하는 가전 기기로서, 냉장고 내의 온도를 사용자가 설정한 온도로 항상 유지시킨다. 통상적인 냉장고는 냉장실과 냉동실, 이러한 냉장실과 냉동실을 개폐하는 도어를 포함할 수 있다. 냉장고는 식 품을 보관하기 위한 냉장 기능과 냉동 기능을 가질 수 있다. 또한, 냉장고는 냉장고 내부 온도를 사용자가 원하 는 대로 조절할 수 있는 변온 기능, 얼음을 만들어주는 제빙 기능, 물을 정수할 수 있는 정수 기능 등을 가질 수 있다. 이러한 냉장고의 기능에 이상이 발생하는 경우 수리가 필요하기 때문에, 냉장고는 냉장고에 이상이 발생함을 알 려주는 시각적, 청각적 알림을 출력할 수 있다. 통상적인 냉장고의 사용자는 전문적인 지식이 있는 서비스 기사 에 의해 냉장고의 이상 상태가 수리되기 전까지는 시각적, 청각적 알림을 해제시킬 수 없다. 이에 따라, 사용자 는 냉장고를 사용하는 동안 청각적 알림을 계속적으로 들어 소음에 노출되거나, 냉장고의 전원을 꺼둘 수 밖에없어 불편함이 있다. 또한, 냉장고의 도어가 일정 시간 동안 열려있는 경우, 냉장고의 내부 온도는 외부의 온도에 의해 변화되며, 냉 장고는 이상 상태가 발생한 것으로 보아 냉장고의 도어가 닫힐 때까지 청각적 알림을 출력할 수 있다. 그러나, 사용자가 일부러 냉장고의 도어를 일정 시간 동안 열어둔 경우에도 청각적 알림이 계속적으로 출력되는 경우, 사용자는 소음에 노출된다는 불편함이 있다. 또한, 냉장고의 기능에 이상이 있어, 냉장고의 도어가 닫혔음에도 불구하고 계속해서 청각적 알림이 출력되는 경우에도, 서비스 기사에 의해 냉장고의 이상 상태가 수리되기 전까 지는 청각적 알림을 끌 수 없어 소음에 노출된다는 문제가 있다."}
{"patent_id": "10-2023-0108543", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 냉장고는, 냉장고의 이상 상태 발생에 대한 알림을 출력하는 출력 인터페이스, 적 어도 하나의 키(key)를 통해 사용자의 입력을 수신하는 사용자 인터페이스, 적어도 하나의 인스트럭션을 저장하 는 메모리, 및 적어도 하나의 프로세서를 포함한다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실 행함으로써, 냉장고의 이상 상태 발생 여부를 식별한다. 적어도 하나의 프로세서는 냉장고의 이상 상태가 발생 한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력하도록 출력 인터페이스를 제어한다. 적어도 하 나의 프로세서는 기 정의된 동작에 매핑(mapping)된 적어도 하나의 키에 대한 사용자의 입력에 따라, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어한다. 본 개시의 일 실시예에 따른 냉장고의 동작 방법은 냉장고의 이상 상태 발생 여부를 식별하는 단계, 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력하도록 출력 인터페이스를 제 어하는 단계, 및 기 정의된 동작에 매핑(mapping)된 적어도 하나의 키(key)에 대한 사용자의 입력에 따라, 냉장 고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어하는 단계를 포함한다."}
{"patent_id": "10-2023-0108543", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 사용되는 용어에 대해 간략히 설명하고, 본 개시의 일 실시예에 대해 구체적으로 설명하기로 한다. 본 개시에서 사용되는 용어는 본 개시의 일 실시예에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적 인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 본 개시의 실 시예의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명 칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시에서, \"a, b 또는 c 중 적어도 하나\" 표현은 \" a\", \" b\", \" c\", \"a 및 b\", \"a 및 c\", \"b 및 c\", \"a, b 및 c 모두\", 혹은 그 변형들을 지칭할 수 있다. 본 개시 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 본 개시에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시의 일 실시예는 여러 가지 상이한 형태 로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시의 일 실시예를 명 확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 본 개시 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 본 개시의 일 실시예에 따른 냉장고의 이상 상태 발생에 대한 알림을 제어하기 위한 동작을 설명하기 위 한 도면이다. 도 1을 참조하면, 본 개시의 일 실시예에 따른 냉장고는 내부에 다양한 종류의 식품을 보관한다. 냉장고 는 영상의 온도에서 식품을 냉장 보관할 수 있는 냉장실과, 영하의 온도에서 식품을 냉동 보관할 수 있는냉동실을 포함할 수 있다. 냉장고는 냉장고 내부 온도를 사용자가 원하는 대로 조절할 수 있는 변온실, 얼 음을 만들어주는 제빙기, 물을 정수하는 정수기 등을 더 포함할 수도 있으나, 이에 제한되지 않는다. 본 개시의 일 실시예에 따른 냉장고는 냉장고에 이상 상태가 존재하는 지 여부를 식별할 수 있다. 냉 장고는 이상 상태가 발생하는 경우, 냉장고는 사용자에게 냉장고에 이상 상태가 발생함을 알려 주는 시각적 알림 및/또는 청각적 알림을 출력할 수 있다. 예를 들어, 냉장고의 이상 상태는 냉장실 온도 센서 고장, 냉동실 온도 센서 고장, 습도 센서 고장, 냉동 실 증발기 팬 고장, 제빙기 고장, 냉장고의 통신 오류, 냉기 공급 장치 고장 등 냉장고의 기능에 존재하는 고장을 포함할 수 있다. 상술한 냉장고의 고장은 서비스 기사에 의한 수리가 필요한 고장일 수 있다. 냉장 고는 이상 상태가 발생하는 경우 디스플레이를 통해 이상 상태에 대한 표시를 출력하고, 음향 출력부 를 통해 이상 상태에 대한 알림(또는, 알람(alarm))을 출력할 수 있다. 예컨대, 음향 출력부는 스피커 (speaker), 버저(buzzer) 등을 포함할 수 있다. 냉장고의 이상 상태에 대한 알림은 냉장고의 고장이 수리될 때까지 음향 출력부를 통해 출력될 수 있다. 이에 관해서는 도 5 내지 도 9에서 상세히 설명한다. 또한, 예를 들어, 냉장고의 이상 상태는 냉장고의 도어를 기 설정된 시간 이상 열어둔 경우의 도 어 열림 상태를 포함할 수도 있다. 냉장고는 도어를 기 설정된 시간 이상 열어둔 경우, 냉장고의 도 어가 닫힐 때까지 음향 출력부를 통해 이상 상태에 대한 알림을 출력할 수 있다. 이에 관해서는 도 10 내지 도 11b에서 상세히 설명한다. 또한, 예를 들어, 냉장고의 이상 상태는 냉장고의 도어의 개폐 상태를 식별하는 도어 스위치의 고장을 포함할 수도 있다. 도어 스위치의 고장은 서비스 기사에 의한 수리가 필요한 고장을 나타낼 수도 있다. 냉장고는 도어 스위치가 고장난 경우, 냉장고의 도어가 닫혔음에도 불구하고 계속해서 음향 출력부 를 통해 이상 상태에 대한 알림을 출력할 수 있다. 냉장고의 이상 상태에 대한 알림은 도어 스위치가 수리될 때까지 음향 출력부를 통해 출력될 수 있다. 이에 관해서는 도 10 내지 도 11b에서 상세히 설명한다. 예를 들어, 도 1의 101에서, 냉장고는 냉장고에 이상 상태가 없다고 식별한 경우, 정상 모드(normal mode)로 동작할 수 있다. 예를 들어, 냉장고는 사용자를 통해 왼쪽 방향키에 대한 입력을 수신하면, 왼쪽 방향키에 매핑(mapping)된 기 정의된 동작을 수행할 수 있다. 예를 들어, 냉장고에 구비된 왼쪽 방향키는, 냉장고의 저장실의 온도를 조절하는 동작에 매핑될 수 있다. 예를 들어, 냉장고는 왼 쪽 방향키에 대한 입력에 대응하여 저장실의 온도를 낮출 수 있다. 또한, 냉장고는 조절된 실내 온도 를 디스플레이에 표시할 수 있다. 예컨대, 냉장고는 현재 냉장실의 온도가 5℃로 낮아진 상태를 디스 플레이에 표시할 수 있다. 예를 들어, 도 1의 102에서, 냉장고는 냉장고에 이상 상태가 있다고 식별한 경우, 이상 모드 (abnormal mode)로 동작할 수 있다. 예를 들어, 냉장고는 디스플레이에 이상 상태에 대한 표시를 출력 할 수 있다. 예를 들어, 냉장고는 음향 출력부를 통해 이상 상태에 대한 알림을 출력할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 이상 모드에서, 음향 출력부를 통해 출력되는 이상 상태에 대한 알림을 끄거나 켜도록 제어할 수 있다. 냉장고는 정상 모드에서 기 정의된 동작을 제어하기 위한 키를, 이 상 모드에서는 알림을 끄거나 켜도록 제어하기 위한 키로 사용할 수 있다. 냉장고는 정상 모드일 때와 이 상 모드일 때 서로 다른 동작에 매핑되는 키를 이용하여, 이상 상태에 대한 알림을 제어할 수 있다. 냉장고 는 현재 냉장고가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 하나의 키에 대응하여 다르게 동작할 수 있다. 냉장고는 이상 상태에 대한 알림을 제어함으로써, 냉장고의 이상 상태가 해 결되기 전까지는 알림을 끌 수 없어 소음에 노출되는 사용자의 불편함을 해소할 수 있다. 예를 들어, 도 1의 102에서, 냉장고가 이상 모드로 동작하는 경우, 왼쪽 방향키는 저장실의 온도를 조 절하는 기능에 매핑되지 않을 수 있다. 왼쪽 방향키는 음향 출력부를 통해 출력되는 이상 상태에 대한 알림을 끄거나 켜도록 제어하는 기능에 매핑될 수 있다. 예를 들어, 도 1의 103에서, 냉장고가 이상 모드에서 사용자로부터 왼쪽 방향키에 대한 입력을 수신하 면, 냉장고는 이상 상태에 대한 알림을 끄거나 켜도록 음향 출력부를 제어할 수 있다. 예를 들어, 왼 쪽 방향키가 한번 입력되면, 이상 상태에 대한 알림이 꺼질 수 있다. 이 경우, 냉장고는 이상 상태에 대한 알림이 꺼졌다는 정보를 디스플레이에 표시할 수 있다. 예컨대, 냉장고는 디스플레이에 'Sound Off'를 표시할 수 있다. 또한, 이상 상태에 대한 알림이 꺼진 상태에서 왼쪽 방향키가 한번 더 입력되면, 이상 상태에 대한 알림이 다시 켜질 수 있다. 이 경우, 냉장고는 이상 상태에 대한 알림이 켜졌다는 정보를 디스플레이에 표시할 수도 있다(미도시). 한편, 냉장고는 복수 개의 키를 통해 이상 상태에 대한 알림을 끄거나 켤 수도 있다. 예를 들어, 정상 모 드에서는 저장실의 온도를 낮추는 왼쪽 방향키가 이상 모드에서는 이상 상태에 대한 알림을 끄기 위한 키로 사용될 수 있다. 또한, 정상 모드에서는 저장실의 온도를 높이는 오른쪽 방향키가 이상 모드에서는 이상 상 태에 대한 알림을 켜기 위한 키로 사용될 수도 있다. 한편, 냉장고는 정상 모드에서는 사용하지 않는 키를, 이상 모드에서는 알림을 끄거나 켜도록 제어하기 위 한 키로 사용할 수도 있다. 본 개시에서 정상 모드에서 사용하지 않는 키를 더미 키(dummy key)라고 지칭할 수 있다. 더미 키는 기 정의된 동작을 제어하기 위한 키로 사용되지 않으며, 기 정의된 동작에 매핑되지 않을 수 있다. 이에 관해서는 도 12에서 상세히 설명한다. 한편, 본 개시의 일 실시예에서, 왼쪽 방향키와 디스플레이는 냉장고에 구비된 구성 요소일 수 있 다. 다만, 이에 제한되지 않고 왼쪽 방향키와 디스플레이는 냉장고를 원격으로 제어하는 제어 장 치(도 15의 200)에 구비된 구성 요소일 수도 있다. 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태가 해결되기 전이라도 사용자 입력에 의해 청각적 알림을 끄도록 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 사용자의 입력에 의해 청각 적 알림을 끔으로써, 사용자가 청각적 알림에 따른 소음에 노출되는 불편함을 해소할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 사용자의 입력에 의해 청각적 알림이 꺼진 경우, 청각적 알림이 꺼 졌다는 정보를 서비스 센터로 전송함으로써, 청각적 알림이 꺼지더라도 냉장고의 이상 상태에 대한 수리가 누락되지 않도록 할 수 있다. 이에 관해서는 도 20에서 상세히 설명한다. 도 2는 본 개시의 일 실시예에 따른 냉장고의 구성을 나타낸 개략 블록도이다. 도 2를 참조하면, 본 개시의 일 실시예에 따른 냉장고는, 프로세서, 출력 인터페이스, 사용자 인터페이스, 및 메모리를 포함할 수 있다. 프로세서는 냉장고 전반의 동작을 제어한다. 프로세서는 적어도 하나의 프로세서로 구현될 수 있다. 프로세서는 메모리에 저장된 인스트럭션 또는 커맨드를 실행하여 소정의 동작을 수행할 수 있 다. 또한, 프로세서는 냉장고에 구비된 구성요소들의 동작을 제어한다. 프로세서는 메모리(14 0)에 저장된 프로그램을 실행하여, 냉장고의 구성 요소들을 제어할 수 있다. 프로세서는 중앙 처리부 (CPU, Central Processing Unit), 그래픽 전용 프로세서(GPU; Graphic Processing Unit) 등을 포함할 수 있다. 또한, 프로세서는 인공지능 모델의 동작을 수행하는 별도의 NPU(Neural Processing Unit)를 포함할 수 있 다. 출력 인터페이스는 오디오 신호 또는 비디오 신호의 출력을 위한 것으로, 음향 출력부와 디스플레이 등을 포함할 수 있다. 출력 인터페이스는, 냉장고의 이상 상태 발생에 대한 알림을 음향 출력 부 또는 디스플레이를 통해 출력할 수 있다. 음향 출력부는 메모리에 저장된 오디오 신호를 출력할 수 있다. 음향 출력부는 냉장고에서 수행되는 기능과 관련된 오디오 신호를 출력할 수 있다. 예컨대, 음향 출력부는 스피커, 버저 등을 포함할 수 있다. 본 개시의 일 실시예에 따른 음향 출력부는 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고 의 이상 상태 발생에 대한 알림을 출력할 수 있다. 예를 들어, 음향 출력부는 냉장고에 서비스 기사에 의한 수리가 필요한 고장에 대한 알림을 출력할 수 있다. 또는, 예를 들어, 음향 출력부는 냉장고 의 도어를 일정 시간 이상 열어둔 상태에 대한 알림을 출력할 수 있다. 디스플레이는 액정 디스플레이(LCD, liquid crystal display), 발광 다이오드(LED, light-emitting diode), 유기 발광 다이오드(OLED, organic light-emitting diode), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전기영동 디스플레이(electrophoretic display) 중에서 적어도 하나를 포함할 수 있다. 디스플레이와 터치 패드(touch pad)가 레이어 구조를 이루어 터치 스크린으로 구성되는 경우, 디 스플레이는 출력 인터페이스 이외에 사용자 인터페이스로도 사용될 수 있다.본 개시의 일 실시예에 따른 디스플레이는 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고(10 0)의 이상 상태 발생에 대한 알림을 표시할 수 있다. 예를 들어, 디스플레이는 냉장고에 서비스 기사 에 의한 수리가 필요한 냉장고의 고장에 대한 알림을 표시할 수 있다. 또는, 예를 들어, 디스플레이 는 냉장고의 도어를 기 설정된 시간 이상 열어둔 상태에 대한 알림을 표시할 수 있다. 또는, 예를 들어, 디스플레이는 냉장고의 도어 스위치 고장 상태에 대한 알림을 표시할 수 있다. 사용자 인터페이스는 냉장고를 제어하기 위한 사용자 입력을 수신할 수 있다. 사용자 인터페이스 는 사용자의 푸시 조작을 수신하는 버튼(button), 사용자의 터치를 감지하는 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방 식 등), 사용자의 회전 조작을 수신하는 조그 휠, 조그 스위치, 돔 스위치(dome switch), 음성 인식을 위한 마 이크, 모션을 센싱하는 모션 감지 센서 중 적어도 하나일 수 있으나, 이에 한정되는 것은 아니다. 본 개시의 일 실시예에 따른 사용자 인터페이스는 복수의 키를 포함할 수 있다. 복수의 키 각각은 사용자 의 푸쉬 조작을 수신하는 버튼, 사용자의 터치를 감지하는 터치 패드, 조그 휠, 조그 스위치, 및 돔 스위치 중 어느 하나의 형태로 구성될 수 있다. 사용자는 사용자 인터페이스에 구비된 복수의 키를 이용하여 냉장고 의 각종 기능을 제어할 수 있다. 예를 들어, 복수의 키는 기 정의된 동작과 연계 또는 매핑(mapping)될 수 있다. 예를 들어, 기 정의된 동작에는 저장실의 온도 조절, 메뉴 선택, 제빙 동작 개시, 제빙 동작 중지, 정수 기 추출 개시 등을 포함할 수 있다. 본 개시에서, 복수의 키는 디스플레이와 터치 패드(touch pad)가 레이 어 구조를 이루어 터치 스크린에 구성되는 것으로 예시하지만, 이에 제한되지 않는다. 메모리는 냉장고의 동작에 필요한 다양한 정보, 데이터, 명령어, 프로그램 등을 저장한다. 메모리 는 휘발성 메모리 또는 비휘발성 메모리 중 적어도 하나 또는 이들의 조합을 포함할 수 있다. 메모리(14 0)는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory), SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 인터넷(interne t)상에서 저장 기능을 수행하는 웹 스토리지(web storage) 또는 클라우드 서버에 대응될 수 있다. 본 개시의 일 실시예에 따른 메모리는 복수의 키에 대응하는 기 정의된 동작에 관한 정보를 저장할 수 있 다. 예를 들어, 메모리는 복수의 키와 매핑된 기 정의된 동작에 관한 정보를 저장할 수 있다. 예를 들어, 복수의 키 중 어느 하나의 키가 사용자에 의해 입력되면, 프로세서는 어느 하나의 키에 매핑된 기 정의된 동작을 수행할 수 있다. 예컨대, 프로세서는 저장실의 온도를 낮추는 동작에 매핑된 키를 통해 사용자의 입력을 수신하면, 저장실의 온도를 낮추도록 냉기 공급 장치를 제어할 수 있다. 본 개시의 일 실시예에 따른 프로세서는 냉장고의 이상 상태 발생 여부를 식별할 수 있다. 프로세서 는 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력 하도록 출력 인터페이스를 제어할 수 있다. 프로세서는 기 정의된 동작에 매핑(mapping)된 적어도 하 나의 키에 대한 사용자의 입력에 따라, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스 를 제어할 수 있다. 본 개시의 일 실시예에서, 복수의 키는 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑되는 적어도 하 나의 키를 포함할 수 있다. 예를 들어, 적어도 하나의 키는 정상 모드일 때는 기 정의된 동작에 매핑되다가, 이 상 모드일 때는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 본 개시의 일 실시예에서, 프로세서는 현재 냉장고가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 적어도 하나의 키에 대응하여 다르게 동작할 수 있다. 예를 들어, 프로세서는 적어도 하나의 키를 통해 사용자의 입력을 수신하면, 정상 모드일 때는 저장실의 온도를 낮추는 동작을 수행하다가, 이상 모드 일 때는 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위해 출력 인터페이스를 제어할 수 있다. 본 개시의 일 실시예에서, 메모리는 적어도 하나의 키에 대해 정상 모드일 때 매핑되는 동작과 이상 모드 일 때 매핑되는 동작에 관한 정보를 저장할 수 있다. 또는 예를 들어, 복수의 키는 정상 모드일 때는 기 정의된 동작에 매핑되지 않다가, 이상 모드일 때는 냉장고 의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위한 키인 더미 키(dummy key)를 포함할 수 있 다. 더미 키는 기 정의된 동작에 매핑되지 않은 키를 의미할 수 있다. 더미 키는 터치 센서는 갖지만 소정 기능 에는 연결되지 않은 키일 수 있다. 예를 들어, 프로세서는 더미 키를 통해 사용자의 입력을 수신하면, 정상 모드일 때는 동작을 수행하지 않다가, 이상 모드일 때는 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어 하기 위해 출력 인터페이스를 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태가 해결되기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 사용자의 입 력에 의해 이상 상태 발생에 대한 알림을 끔으로써, 사용자가 청각적 소음에 노출되는 불편함을 해소할 수 있다. 도 3은 본 개시의 일 실시예에 따른 냉장고의 구성을 나타낸 상세 블록도이다. 도 3을 참조하면, 본 개시의 일 실시예에 따른 냉장고는, 프로세서, 출력 인터페이스, 사용 자 인터페이스, 메모리, 통신 모듈, 가전 기능 모듈, 센서, 및 전력 모듈 을 포함할 수 있다. 그러나 도 3에 도시된 구성요소 모두가 필수구성요소인 것은 아니다. 도 3에 도시된 구성요소보다 많은 구성요소에 의해 냉장고가 구현될 수도 있고, 그보다 적은 구성요소에 의해서도 냉장 고는 구현될 수 있다. 도 3의 프로세서는 도 2의 프로세서에 대응하고, 도 3의 출력 인터페이스는 도 2의 출력 인터 페이스에 대응하고, 도 3의 사용자 인터페이스는 도 2의 사용자 인터페이스에 대응하고, 도 3 의 메모리는 도 2의 메모리에 대응할 수 있다. 이하 도 2에서 설명한 내용을 제외하고 통신 모듈, 가전 기능 모듈, 센서, 및 전력 모듈 에 대해 차례로 살펴본다. 통신 모듈은 근거리 통신 모듈 또는 원거리 통신 모듈 중 적어도 하나 또는 이들의 조합을 포함할 수 있다. 통신 모듈은 다른 장치와 무선으로 통신하기 위한 적어도 하나의 안테나를 포함할 수 있 다. 근거리 통신 모듈(short-range wireless communication module)는, 블루투스 통신 모듈, BLE(Bluetooth Low Energy) 통신 모듈, 근거리 무선 통신 모듈(Near Field Communication module), WLAN(와이파이) 통신 모듈, 지그비(Zigbee) 통신 모듈, 적외선(IrDA, infrared Data Association) 통신 모듈, WFD(Wi-Fi Direct) 통 신 모듈, UWB(ultrawideband) 통신 모듈, Ant+ 통신 모듈, 마이크로 웨이브(uWave) 통신 모듈 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 원거리 통신 모듈은, 다양한 종류의 원거리 통신을 수행하는 통신 모듈을 포함할 수 있으며, 이동 통신부 를 포함할 수 있다. 이동 통신부는 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호 를 송수신한다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신 에 따른 다양한 형태의 데이터를 포함할 수 있다. 가전 기능 모듈은 냉장고 본연의 기능을 수행하는 동작 모듈을 포함한다. 가전 기능 모듈은 저장실, 냉기 공급 장치, 도어, 및 도어 스위치를 포함할 수 있다. 저장실은 하나 이상의 저장실을 포함할 수 있다. 저장실은 서로 다른 온도로 유지되는 냉장실, 냉 동실, 변온실 등을 포함할 수 있다. 냉기 공급 장치는 저장실에 냉기를 공급하도록 구성될 수 있다. 냉기 공급 장치는 냉매의 압 축, 응축, 팽창, 및 증발 과정을 포함하는 냉동 사이클을 통해 냉기를 생성할 수 있다. 냉기 공급 장치는 압축기, 응축기, 팽창 장치, 및 증발기를 갖는 냉동 사이클 장치를 포함할 수 있다. 도어는 저장실의 개방된 일 측을 개폐하도록 구성될 수 있다. 도어는 냉장고의 전면에 회전 또는 슬라이딩 가능하게 설치될 수 있다. 냉장고는 도어 스위치에 의해 도어의 개폐 상태를 감지할 수 있다. 도어 스위치는 자 석을 이용하여 도어의 개폐 상태를 감지하는 리드 스위치(reed switch) 등을 포함할 수 있다. 예를 들어, 도어가 열리면 도어 스위치에 전기가 통하고, 도어가 닫히면 도어 스위치가 개방됨으 로써 도어의 개폐 상태가 감지될 수 있다. 센서는 저장실의 온도를 감지하는 온도 센서, 습도를 감지하는 습도 센서 등을 포함할 수 있다. 센 서는 측정된 센싱 값을 프로세서로 출력한다. 전력 모듈은 전원에 연결되어, 냉장고에 전력을 공급한다. 프로세서는 냉장고 전반의 동작을 제어한다. 프로세서는 메모리에 저장된 프로그램을 실행하여, 냉장고의 구성 요소들을 제어할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 냉장고의 이상 상태 발생 여부를 식별한다. 적어도 하나의 프로세서는 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력하도록 출력 인터페이스를 제어한다. 적어도 하나의 프 로세서는 기 정의된 동작에 매핑(mapping)된 적어도 하나의 키에 대한 사용자의 입력에 따라, 냉장고(10 0)의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어한다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 냉장고의 이상 상태 발생에 대한 알림이 꺼진 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림이 꺼져있음을 나타내 는 정보를 출력하도록 디스플레이를 제어할 수 있다. 도 4는 본 개시의 일 실시예에 따른 냉장고의 제어 방법을 나타낸 흐름도이다. 도 4를 참조하면, 동작 410에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태 발생 여 부를 식별할 수 있다. 본 개시의 일 실시예에서, 냉장고의 이상 상태는, 냉장고에 대한 정보에 이상이 있는 것에 기초한 냉 장고의 고장 상태, 냉장고의 도어가 기 설정된 시간 이상 개방된 상태, 냉장고의 도어 스 위치의 고장 상태 등을 포함할 수 있다. 본 개시의 일 실시예에서, 냉장고는 메모리에 저장된 냉장고에 대한 정보를 읽고(read), 냉장고 의 모델을 식별할 수 있다. 냉장고는 냉장고0에 대한 정보에 기초하여 냉장고를 구동시키기 위한 프로그램을 설정할 수 있다. 예를 들어, 냉장고에 대한 정보는, 냉장고의 기능에 따라서 냉장고 를 구동시키는 프로그램을 결정하기 위한 정보를 포함할 수 있다. 예를 들어, 냉장고에 대한 정보는 냉장고 내의 메모리인 EEPROM(Erasable Programmable Read-Only Memory)에 0x01, 0x02, 쪋 ,0xFD, 0xFE 등의 16진수 형태로 저장될 수 있다. 본 개시의 일 실시예에서, 냉장고는 냉장고에 대한 정보에 이상이 존재하는 지 여부를 식별할 수 있 다. 예를 들어, 냉장고는 메모리에 저장된 냉장고에 대한 정보에 이상이 존재하지 않는 경우, 냉장 고가 정상이라고 판단할 수 있다. 예를 들어, 냉장고는 메모리에 저장된 냉장고에 대한 정 보가 0xFF 및 0x00을 제외한 0x01, 0x02, 쪋 ,0xFD, 0xFE의 값 중 어느 하나인 경우, 냉장고에 대한 정보 에 이상이 존재하지 않는다고 판단할 수 있다. 냉장고는 메모리에 저장된 냉장고에 대한 정보에 이상이 존재하지 않는 경우, 정상 모드에 따라 동작할 수 있다. 예를 들어, 냉장고는 정상 모드에서 기 정 의된 동작에 매핑된 적어도 하나의 키에 대한 사용자의 입력에 따라, 기 정의된 동작을 수행할 수 있다. 예컨대, 냉장고는 적어도 하나의 키를 통해 사용자의 입력을 수신하면, 저장실의 온도를 낮추는 동작을 수 행할 수 있다. 예를 들어, 냉장고는 메모리에 저장된 냉장고에 대한 정보에 이상이 존재하는 경우, 냉장고 에 이상 상태가 발생한 것으로 식별할 수 있다. 예를 들어, 냉장고의 이상 상태는 냉장실 온도 센서 고장, 냉동실 온도 센서 고장, 습도 센서 고장, 냉동실 증발기 팬 고장, 제빙기 고장, 냉장고의 통신 오류, 냉 기 공급 장치 고장 등 서비스 기사에 의한 수리가 필요한 고장을 나타낼 수 있다. 예를 들어, 냉장고는 메 모리에 저장된 냉장고에 대한 정보가 제1 상태 정보 또는 제2 상태 정보인 경우, 냉장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 예컨대, 제1 상태 정보는 0xFF이고, 제2 상태 정보는 0x00일 수 있 으나, 이에 제한되지 않는다. 냉장고의 고장에 따른 이상 상태는, 냉장고가 서비스 기사에 의해 수리 되기 전까지는 해결될 수 없는 에러일 수 있다. 또한, 본 개시의 일 실시예에서, 냉장고는 도어가 기 설정된 시간 이상 개방되어 있는 지 여부를 식 별할 수 있다. 냉장고는 도어가 기 설정된 시간 이상 개방된 경우, 냉장고에 이상 상태가 발생한 것으로 판단할 수 있다. 냉장고는 도어의 개폐 상태를 감지하는 도어 스위치를 통해 도어 가 기 설정된 시간 이상 개방되어 있는 지 여부를 식별할 수 있다. 도어 열림에 따른 이상 상태는, 도어 가 닫히는 경우 해결될 수 있다. 냉장고는 도어가 닫힐 때까지 이상 상태 발생에 대한 알림을 출력할 수 있다. 또한, 본 개시의 일 실시예에서, 냉장고는 도어 스위치에 오픈(open) 불량이 존재하는 경우, 도어 가 닫혔음에도 불구하고 도어가 개방되었다고 잘못 판단할 수 있다. 프로세서는 도어 스위치 의 오픈 불량으로 인해, 도어 스위치로부터 기 설정된 시간 이상 감지 신호를 수신할 수 있다. 프 로세서는 도어 스위치로부터 기 설정된 시간 이상 감지 신호를 수신한 경우, 도어가 기 설정 된 시간 이상 개방되어 있다고 잘못 판단할 수 있다. 도어 스위치의 고장에 따른 이상 상태는, 도어 스위 치가 서비스 기사에 의해 수리되기 전까지는 해결될 수 없는 에러일 수 있다. 냉장고는 도어 가 닫혀 있더라도 이상 상태 발생에 대한 알림을 출력할 수 있다. 동작 420에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고에 이상 상태가 발생한 것에 기초하여, 이상 모드로 동작할 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 출력하도록 출력 인 터페이스를 제어할 수 있다. 예를 들어, 냉장고는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 출력하도록 음향 출력부를 제 어할 수 있다. 예컨대, 냉장고는 냉장고의 고장에 따른 이상 상태, 냉장고의 도어 열림에 따른 이상 상태, 도어 스위치의 고장에 따른 이상 상태 중 어느 하나가 발생한 것에 기초하여, 알림을 출력할 수 있다. 음향 출력부는 이상 상태 발생에 대한 알림을 출력할 수 있다. 예를 들어, 냉장고는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 표시하도록 디스플레이를 제 어할 수 있다. 예컨대, 냉장고의 고장에 따른 이상 상태인 경우, 냉장고는 이상 상태 발생에 대한 알 림을 나타내는 'Ch' 에러를 표시할 수 있다. 예컨대, 냉장고의 도어 열림에 따른 이상 상태이거나, 도어 스위치의 고장에 따른 이상 상태인 경우, 냉장고는 'Ch' 에러와는 다른 문구를 표시할 수 있다. 동작 430에서, 본 개시의 일 실시예에 따른 냉장고는 기 정의된 동작에 매핑(mapping)된 적어도 하나의 키 에 대한 사용자의 입력에 따라, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어할 수 있다. 예를 들어, 냉장고는 적어도 하나의 키에 대한 사용자의 입력에 따라, 냉장고의 이 상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 음향 출력부는 냉장고의 이 상 상태 발생에 대한 알림을 출력하지 않을 수 있다. 본 개시의 일 실시예에 따른 사용자 인터페이스는 복수의 키를 포함할 수 있다. 복수의 키 각각은 사용자 의 푸쉬 조작을 수신하는 버튼, 사용자의 터치를 감지하는 터치 패드, 조그 휠, 조그 스위치, 및 돔 스위치 중 어느 하나의 형태로 구성될 수 있다. 사용자는 사용자 인터페이스에 구비된 복수의 키를 이용하여 냉장고 의 각종 기능을 제어할 수 있다. 예를 들어, 복수의 키는 기 정의된 동작과 연계 또는 매핑(mapping)될 수 있다. 예를 들어, 기 정의된 동작에는 저장실의 온도 조절, 메뉴 선택, 제빙 동작 개시, 제빙 동작 중지, 정수 기 추출 개시 등을 포함할 수 있다. 본 개시의 일 실시예에 따른 메모리는 복수의 키에 대응하는 기 정의된 동작에 관한 정보를 저장할 수 있 다. 예를 들어, 메모리는 복수의 키와 매핑된 기 정의된 동작에 관한 정보를 저장할 수 있다. 예를 들어, 정상 모드에서 적어도 하나의 키가 사용자에 의해 입력되면, 프로세서는 적어도 하나의 키에 매핑된 기 정 의된 동작을 수행할 수 있다. 본 개시의 일 실시예에서, 사용자 인터페이스에 포함된 복수의 키는 정상 모드일 때와 이상 모드일 때 서 로 다른 동작에 매핑되는 적어도 하나의 키를 포함할 수 있다. 예를 들어, 적어도 하나의 키는 정상 모드일 때 는 기 정의된 동작에 매핑되다가, 이상 모드일 때는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도 록 제어하는 동작에 매핑될 수 있다. 본 개시의 일 실시예에서, 냉장고는 현재 냉장고가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 적어도 하나의 키에 대응하여 다르게 동작할 수 있다. 예를 들어, 냉장고는 정상 모드일 때 적어도 하나의 키를 통해 사용자의 입력을 수신하면, 저장실의 온도를 낮 추는 동작을 수행할 수 있다. 냉장고는 이상 모드일 때 적어도 하나의 키를 통해 사용자의 입력을 수신하 면, 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위해 음향 출력부를 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태가 해결되기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 제어할 수 있다. 예를 들어, 냉장고는 냉장고의 고장이 수리되기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 예 를 들어, 냉장고는 도어가 닫히기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도 록 음향 출력부를 제어할 수 있다. 예를 들어, 냉장고는 도어 스위치의 고장이 수리되기 전이 라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 사용자의 입력에 의해 이상 상태 발생에 대한 알림을 끔으로써, 사용자가 청각 적 소음에 노출되는 불편함을 해소할 수 있다. 한편, 본 개시의 일 실시예에 따른 냉장고는 이상 상태 발생에 대한 알림을 끈 경우, 기기 관리 서버(도 16의 300)를 통해 서비스 센터에 이상 상태 발생에 대한 알림이 꺼졌다는 정보를 전송할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 알림이 사용자의 제어에 의해 꺼지더라도 냉장고의 이상 상태에 대한 수리가 누락되지 않기 위해, 서비스 센터에 해당 정보를 전송할 수 있다. 도 5는 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 제어하기 위한 방법을 나타낸 흐름 도이다. 도 5를 참조하면, 동작 510에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고의 전원을 켤 수 있다. 동작 520에서, 본 개시의 일 실시예에 따른 냉장고는 메모리에 저장된 냉장고에 대한 정보를 식 별할 수 있다. 예를 들어, 냉장고는 메모리에 저장된 냉장고에 대한 정보를 읽고(read), 냉장고 의 모델을 식별하고, 냉장고를 구동시키기 위한 프로그램을 설정할 수 있다. 또한, 냉장고는 메 모리에 저장된 냉장고에 대한 정보를 읽고, 냉장고에 이상 상태 발생 여부를 식별할 수 있다. 예컨대, 냉장고의 이상 상태는, 서비스 기사에 의해 수리가 필요한 고장일 수 있다. 예를 들어, 냉장고에 대한 정보는, 냉장고의 기능에 따라서 냉장고를 구동시키는 프로그램을 결 정하기 위한 정보를 포함할 수 있다. 예를 들어, 냉장고에 대한 정보는 냉장고 모델을 구분하기 위한 값으 로 표현될 수 있다. 예를 들어, 냉장고의 기능(예컨대, 냉동 기능, 냉장 기능, 변온 기능 등)에 따라서 여 러 종류의 냉장고 모델이 존재할 수 있다. 여러 종류의 냉장고 모델에 공용 소프트웨어 프로그램을 탑재하고, 각 냉장고 모델에 맞는 프로그램을 구동시키기 위해서는 냉장고의 메모리에 냉장고가 어떤 모델인 지 에 관한 정보가 저장될 수 있다. 냉장고는 메모리에 저장된 냉장고에 대한 정보를 읽고, 특정 기능을 갖는 냉장고를 구동할 수 있는 프로그램을 결정할 수 있다. 예를 들어, 냉장고에 대한 정보는 냉장고 내의 메모리인 EEPROM(Erasable Programmable Read-Only Memory)에 0x01, 0x02, 쪋 ,0xFD, 0xFE 등의 16진수 형태로 저장될 수 있다. 예컨대, 냉장고는 냉장고에 대한 정보가 예컨대 0x01인 것을 식별하고, 냉장고 모델에 맞는 프로그램을 실행할 수 있다. 예를 들어, 냉장실 과 냉동실 만을 구비한 제1 냉장고 모델의 메모리에 저장된 냉장고에 대한 정보는, 냉장실, 냉동실, 및 제 빙기를 구비한 제2 냉장고 모델의 메모리에 저장된 냉장고에 대한 정보와 다를 수 있다. 따라서, 제1 냉장 고 모델을 구동시키기 위한 프로그램과 제2 냉장고 모델을 구동시키기 위한 프로그램이 다를 수 있다. 동작 530에서, 본 개시의 일 실시예에 따른 냉장고는 메모리에 저장된 냉장고에 대한 정보에 이 상이 존재하는 지 여부를 식별할 수 있다. 동작 530 및 동작 540에서, 본 개시의 일 실시예에 따른 냉장고는 메모리에 저장된 냉장고에 대 한 정보에 이상이 존재하지 않는 경우, 냉장고가 정상이라고 판단할 수 있다. 예를 들어, 냉장고는 메모리에 저장된 냉장고에 대한 정보가 0xFF 및 0x00을 제외한 0x01, 0x02, 쪋 ,0xFD, 0xFE의 값 중 어느 하나인 경우, 냉장고에 대한 정보에 이상이 존재하지 않는다고 판단할 수 있다. 냉장고는 메모 리에 저장된 냉장고에 대한 정보에 이상이 존재하지 않는 경우, 정상 모드에 따라 동작할 수 있다. 동작 545에서, 본 개시의 일 실시예에 따른 냉장고는 정상 모드에서 기 정의된 동작에 매핑된 적어도 하나 의 키에 대한 사용자의 입력에 따라, 기 정의된 동작을 수행할 수 있다. 본 개시의 일 실시예에 따른 사용자 인터페이스는 복수의 키를 포함할 수 있다. 복수의 키 각각은 사용자 의 푸쉬 조작을 수신하는 버튼, 사용자의 터치를 감지하는 터치 패드, 조그 휠, 조그 스위치, 및 돔 스위치 중 어느 하나의 형태로 구성될 수 있다. 사용자는 사용자 인터페이스에 구비된 복수의 키를 이용하여 냉장고 의 각종 기능을 제어할 수 있다. 예를 들어, 복수의 키는 기 정의된 동작과 연계 또는 매핑(mapping)될 수 있다. 예를 들어, 기 정의된 동작에는 저장실의 온도 조절, 메뉴 선택, 제빙 동작 개시, 제빙 동작 중지, 정수기 추출 개시 등을 포함할 수 있다. 본 개시의 일 실시예에 따른 메모리는 복수의 키에 대응하는 기 정의된 동작에 관한 정보를 저장할 수 있 다. 예를 들어, 메모리는 복수의 키와 매핑된 기 정의된 동작에 관한 정보를 저장할 수 있다. 예를 들어, 복수의 키 중 적어도 하나의 키가 사용자에 의해 입력되면, 프로세서는 적어도 하나의 키에 매핑된 기 정 의된 동작을 수행할 수 있다. 예컨대, 프로세서는 저장실의 온도를 낮추는 동작에 매핑된 키를 통해 사용 자의 입력을 수신하면, 저장실의 온도를 낮추도록 냉기 공급 장치를 제어할 수 있다. 동작 530 및 동작 550에서, 본 개시의 일 실시예에 따른 냉장고는 메모리에 저장된 냉장고에 대 한 정보에 이상이 존재하는 경우, 냉장고에 이상 상태가 발생한 것으로 식별할 수 있다. 예를 들어, 냉장 고의 이상 상태는 냉장실 온도 센서 고장, 냉동실 온도 센서 고장, 습도 센서 고장, 냉동실 증발기 팬 고 장, 제빙기 고장, 냉장고의 통신 오류, 냉기 공급 장치 고장 등 서비스 기사에 의한 수리가 필요한 고장을 나타 낼 수 있다. 예를 들어, 냉장고는 메모리에 저장된 냉장고에 대한 정보가 제1 상태 정보 또는 제2 상태 정보 인 경우, 냉장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 예컨대, 제1 상태 정보는 0xFF이고, 제2 상태 정보는 0x00일 수 있으나, 이에 제한되지 않는다. 또는, 예를 들어, 냉장고는 메모리에 존재하는 복수의 저장 공간에 저장된 냉장고에 대한 정보 를 읽을 수 있다. 메모리는 주소(address) 마다 저장 공간을 가지며, 주소 버스를 통해 각 주소에 해당하 는 저장 공간에 접근하여, 데이터를 읽고 쓸 수 있다. 냉장고는 메모리의 복수의 저장 공간 중 적어 도 하나의 저장 공간에서 식별된 냉장고에 대한 정보가 복수의 저장 공간 중 나머지 저장 공간에서 식별된 냉장고에 대한 정보와 동일한 지 여부를 식별할 수 있다. 냉장고는 적어도 하나의 저장 공간에서 식 별된 냉장고에 대한 정보가 나머지 저장 공간에서 식별된 냉장고에 대한 정보와 상이하다고 판단하면, 냉장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 예를 들어, 냉장고는 3개의 저장 공간에서 냉장고에 대한 정보를 식별할 수 있다. 냉장고는 1번 저장 공간에서 식별된 냉장고에 대한 정보가 0x01이고, 3번 저장 공간에서 식별된 냉장고에 대한 정 보가 0x01이고, 2번 저장 공간에서 식별된 냉장고에 대한 정보가 0x02인 경우, 냉장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 동작 550에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고에 이상 상태가 발생한 것에 기초하여, 이상 모드로 동작할 수 있다. 예를 들어, 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 출력할 수 있다. 예를 들어, 냉장고는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 표시하도록 디스플레이를 제 어할 수 있다. 예컨대, 냉장고는 이상 상태 발생에 대한 알림을 나타내는 'Ch' 에러를 표시할 수 있다. 또 한, 예를 들어, 냉장고는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 출력하도록 음향 출력부 를 제어할 수 있다. 한편, 본 개시의 일 실시예에 따른 냉장고는 이상 모드에 따라, 기본 사양 모델(default specification model)로 동작할 수 있다. 예를 들어, 냉장고는 냉장고 모델 마다 저장실의 개수, 냉장 기능, 냉동 기능, 변온 기능, 제빙 기능, 정수 기능 등의 기능의 유무가 다를 수 있다. 냉장고에 대한 정보에 이상이 있는 경우, 프로세서는 현재 냉장고가 어떤 모델인 지 식별하기 어렵고, 따라서 어떤 프로그램을 실행해야하는 지 알 기 어렵다. 따라서, 프로세서는 현재 냉장고가 가장 많은 기능을 가진 모델(즉, 최고 사양 모델)인 기본 사양 모델이라고 가정하고, 기본 사양 모델을 구동시키기 위한 프로그램을 실행할 수 있다. 이에 따라, 냉장고 의 모든 기능을 구동시킬 수 있도록 프로그램을 실행함으로써, 냉장고의 이상 상태를 수리하기 전에 도 냉장고를 안전하게 작동시킬 수 있다. 동작 560에서, 본 개시의 일 실시예에 따른 냉장고는 이상 모드에서 기 정의된 동작에 매핑된 적어도 하나 의 키에 대한 사용자의 입력이 존재하는 지 여부를 식별할 수 있다. 예를 들어, 냉장고는 적어도 하나의 키에 대한 사용자의 1회 또는 복수 회의 입력이 존재하는 지 여부를 식별할 수 있다. 또는, 예를 들어, 냉장고 는 적어도 하나의 키에 대한 입력이 수 초간 유지되는 지 여부를 식별할 수 있다. 동작 570에서, 본 개시의 일 실시예에 따른 냉장고는 기 정의된 동작에 매핑된 적어도 하나의 키에 대한 사용자의 입력이 존재한다고 판단하면, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어할 수 있다. 동작 580에서, 본 개시의 일 실시예에 따른 냉장고는 기 정의된 동작에 매핑된 적어도 하나의 키에 대한 사용자의 입력이 존재하지 않는다고 판단하면, 냉장고의 이상 상태 발생에 대한 알림을 유지하도록 출력 인터페이스를 제어할 수 있다. 본 개시의 일 실시예에서, 사용자 인터페이스에 포함된 복수의 키는 정상 모드일 때와 이상 모드일 때 서 로 다른 동작에 매핑되는 적어도 하나의 키를 포함할 수 있다. 예를 들어, 적어도 하나의 키는 정상 모드일 때 는 기 정의된 동작에 매핑되다가, 이상 모드일 때는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도 록 제어하는 동작에 매핑될 수 있다. 본 개시의 일 실시예에서, 냉장고는 현재 냉장고가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 적어도 하나의 키에 대응하여 다르게 동작할 수 있다. 예를 들어, 냉장고는 적어도 하나의 키를 통해 사용자의 입력을 수신하면, 정상 모드일 때는 저장실의 온도를 낮추는 동작을 수행하다가, 이상 모드일 때는 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위해 출력 인터페이스를 제어할 수 있다. 본 개시의 일 실시예에서, 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑되는 적어도 하나의 키는 2 개 이상으로 구현될 수 있다. 이 경우, 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위한 동작은 2개 이상의 키를 통해 구현될 수 있다. 예를 들어, 적어도 하나의 키는 정상 모드일 때 기 정의된 제1 동작을 수행 하기 위한 제1 키와 기 정의된 제2 동작을 수행하기 위한 제2 키를 포함할 수 있다. 냉장고는 이상 모드일 때 제1 키를 통해 이상 상태 발생에 대한 알림을 끄고, 제2 키를 통해 이상 상태 발생에 대한 알림을 켤 수 있 다. 예컨대, 제1 키는 저장실의 온도를 낮추기 위한 키이고, 제2 키는 저장실의 온도를 높이기 위한 키일 수 있 다. 한편, 본 개시의 일 실시예에서, 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑되는 적어도 하나 의 키는 단일 키로 구현될 수도 있으며, 이에 관해서는 도 6에서 설명한다. 본 개시의 일 실시예에서, 적어도 하나의 키는 이상 모드일 때 냉장고의 이상 상태 발생에 대한 알림을 점 진적으로 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 본 개시의 일 실시예에서, 냉장고는 적어도 하 나의 키를 통해 사용자의 입력을 1회 수신하면, 이상 상태 발생에 대한 알림의 크기를 줄이거나 키울 수 있다. 냉장고는 적어도 하나의 키를 통해 사용자의 입력을 복수 회 수신하면, 이상 상태 발생에 대한 알림의 크 기를 점진적으로 줄이다가 끄도록 제어할 수 있다. 본 개시의 일 실시예에서, 복수의 키는 정상 모드일 때와 이상 모드일 때 서로 동일한 동작에 매핑되는 일반적 인 키를 더 포함할 수 있다. 예컨대, 일반적인 키는 기 정의된 동작과 매핑될 수 있다. 본 개시의 일 실시예에 서, 냉장고는 정상 모드일 때 일반적인 키를 통해 사용자의 입력을 수신하면, 기 정의된 동작을 수행할 수 있다. 본 개시의 일 실시예에서, 냉장고는 냉장고의 고장으로 인해 냉장고가 이상 모드로 동작 하는 경우, 일반적인 키를 통해 사용자의 입력을 수신하더라도, 동작을 수행하지 않을 수 있다. 따라서, 냉장고 가 고장난 경우 사용자의 입력에 의해 냉장고가 임의로 제어되는 것을 방지하여, 사용자의 안전을 확 보할 수 있다. 냉장고가 고장난 경우, 냉장고는 이상 상태 발생에 대한 알림을 끄거나 켜는 동작을 수행할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태가 해결되기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 제어할 수 있다. 예를 들어, 냉장고는 냉장고의 고장이 수리되 기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 사용자의 입력에 의해 이상 상태 발생에 대한 알림을 끔으로써, 사용자 가 청각적 소음에 노출되는 불편함을 해소할 수 있다. 한편, 본 개시의 일 실시예에 따른 냉장고는 이상 상태 발생에 대한 알림을 끈 경우, 기기 관리 서버(도 16의 300)를 통해 서비스 센터에 이상 상태 발생에 대한 알림이 꺼졌다는 정보를 전송할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 알림이 사용자의 제어에 의해 꺼지더라도 냉장고의 이상 상태에 대한 수리가 누락되지 않기 위해, 서비스 센터에 해당 정보를 전송할 수 있다. 도 6은 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 단일 키(single key)로 제어하기 위한 방법을 나타낸 흐름도이다. 도 6을 참조하면, 본 개시의 일 실시예에서, 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑되는 적어 도 하나의 키는 단일 키로 구현될 수도 있다. 동작 660에서, 본 개시의 일 실시예에 따른 냉장고는 이상 모드에서 기 정의된 동작에 매핑된 적어도 하나 의 키에 대한 사용자의 입력 존재하는 지 여부를 식별할 수 있다. 동작 660은 도 5의 동작 560에 대응될 수 있 다. 동작 665에서, 본 개시의 일 실시예에 따른 냉장고는 현재 이상 상태 발생에 대한 알림이 켜진 상태인지를 식별할 수 있다. 예를 들어, 냉장고는 음향 출력부가 이상 상태 발생에 대한 알림을 출력하고 있는지 여부를 식별할 수 있다. 동작 670에서, 본 개시의 일 실시예에 따른 냉장고는 현재 이상 상태 발생에 대한 알림이 켜진 상태라고 판단하면, 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어할 수 있다. 예를 들어, 냉장고 는 음향 출력부가 이상 상태 발생에 대한 알림을 출력하고 있다고 판단하면, 적어도 하나의 키에 대 한 사용자의 입력에 기초하여 알림을 끄도록 음향 출력부를 제어할 수 있다. 동작 670에서, 본 개시의 일 실시예에 따른 냉장고는 현재 이상 상태 발생에 대한 알림이 꺼진 상태라고 판단하면, 이상 상태 발생에 대한 알림을 다시 켜도록 출력 인터페이스를 제어할 수 있다. 예를 들어, 냉 장고는 음향 출력부가 이상 상태 발생에 대한 알림을 출력하고 있지 않다고 판단하면, 적어도 하나의 키에 대한 사용자의 입력에 기초하여 알림을 다시 켜도록 음향 출력부를 제어할 수 있다. 본 개시의 일 실시예에서, 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위한 동작이 단일 키를 통해 구현되는 경우, 냉장고는 단일 키에 대한 사용자의 입력에 기초하여, 현재 알림이 켜져있는 지 여부를 식 별할 수 있다. 냉장고는 현재 알림이 켜져있다고 판단하면, 단일 키에 대한 사용자의 입력에 기초하여 알 림을 끌 수 있다. 냉장고는 현재 알림이 꺼져있다고 판단하면, 단일 키에 대한 사용자의 입력에 기초하여 알림을 켤 수 있다. 예컨대, 단일 키는 정상 모드일 때 저장실의 온도를 낮추기 위한 키이고, 이상 모드일 때 알림을 끄거나 켜도록 제어하는 키일 수 있다. 이하, 도 7 내지 도 9를 참조하여, 냉장고가 이상 상태 발생에 대한 알림을 제어하는 동작에 대해 설명한 다. 도 7은 본 개시의 일 실시예에 따른 냉장고가 정상인 경우 수행하는 동작을 설명하기 위한 도면이다. 도 9는 본 개시의 일 실시예에 따른 냉장고의 디스플레이 및 사용자 인터페이스를 나타내는 예시 도면이다. 도 7은 도 5의 동작 520, 동작 530, 동작 540 및 동작 545에 따라 냉장고의 정상 모드를 설명하기 위한 도면이다. 도 9의 901은 냉장고의 정상 모드를 설명하기 위한 도면이다. 도 7을 참고하면, 프로세서는 메모리에 저장된 냉장고에 대한 정보를 식별할 수 있다. 프로세서 는 메모리에 저장된 냉장고에 대한 정보를 읽고, 냉장고의 모델을 식별하고, 냉장고 를 구동시키기 위한 프로그램을 설정할 수 있다. 냉장고에 대한 정보는 냉장고 모델을 구분하기 위한 값을 나타낼 수 있다. 냉장고에 대한 정보는 EEPROM에 해당하는 메모리에 0x01, 0x02, 쪋 ,0xFD, 0xFE 등 의 16진수 형태로 저장될 수 있다. 프로세서는 냉장고에 대한 정보가 예컨대, 0x01인 것을 식별할 수 있다. 프로세서는 냉장고 모 델에 맞는 프로그램을 실행할 수 있다. 프로세서는 메모리에 저장된 냉장고에 대한 정보를 읽고, 냉장고에 이상 상태가 존재하는 지 여부를 식별할 수 있다. 프로세서는 냉장고에 대한 정보에 이상이 존재하지 않는 경우, 냉장고 가 정상이라고 판단할 수 있다. 프로세서는 냉장고가 정상인 것으로 판단하고, 정상 모드로 동 작할 수 있다. 프로세서는 정상 모드에서 사용자 인터페이스를 통해 적어도 하나의 키에 대한 사용자의 입력을 수신 할 수 있다. 프로세서는 사용자 인터페이스를 통해 기 정의된 동작에 매핑된 적어도 하나의 키 에 대한 입력 신호를 수신할 수 있다. 예컨대, 도 9의 901에서 사용자 인터페이스는 왼쪽 방향키를 포함할 수 있다. 왼쪽 방향키는 냉장실의 온도를 낮추는 동작에 매핑된 키일 수 있다. 사용자 인터페이스 는 오른쪽 방향키를 포함할 수 있다. 오른쪽 방향키는 냉장실의 온도를 높이는 동작에 매핑된 키일 수 있다. 사용자 인터페이스는 가운데 키를 포함할 수 있다. 가운데 키는 선택 동작에 매핑된 키일 수 있다. 프로세서는 적어도 하나의 키에 대한 사용자의 입력을 수신하면, 기 정의된 동작을 수행할 수 있다. 예컨대, 도 9의 901에서 프로세서는 왼쪽 방향 키에 대한 사용자의 입력을 수신하면, 저장실의 온도 를 낮추도록 냉기 공급 장치를 제어할 수 있다. 프로세서는 냉기 공급 장치에 온도 조절 신호를 제공할 수 있다. 도 7의 냉기 공급 장치는 도 3의 냉기 공급 장치에 대응할 수 있다. 프로세서는 온도 정보를 디스플레이에 표시하도록, 디스플레이를 제어할 수 있다. 예컨대, 디스플레이는 냉장실(Fridge)의 온도가 5℃인 것을 표시할 수 있다. 또한, 도시하지 않았으나 프로세서 는 온도 조절에 대한 알림을 출력하기 위해 음향 출력부를 제어할 수도 있다. 도 8a는 본 개시의 일 실시예에 따른 냉장고에서 이상 상태가 발생한 경우 알림을 출력하는 동작을 설명하기 위 한 도면이다. 도 9는 본 개시의 일 실시예에 따른 냉장고의 디스플레이 및 사용자 인터페이스를 나타내는 예시 도면이다. 도 8a는 도 5의 동작 530, 및 동작 550에 따라 냉장고의 이상 모드를 설명하기 위한 도면이다. 도 9의 902는 냉장고의 이상 모드를 설명하기 위한 도면이다. 프로세서는 메모리에 저장된 냉장고에 대한 정보에 이상이 존재하는 경우, 냉장고에 이상 상태가 발생한 것으로 식별할 수 있다. 예를 들어, 냉장고의 이상 상태는 냉장실 온도 센서 고장, 냉동실 온도 센서 고장, 습도 센서 고장, 냉동실 증발기 팬 고장, 제빙기 고장, 냉장고의 통신 오류, 냉기 공급 장치 고장 등 서비스 기사에 의한 수리가 필요한 고장을 나타낼 수 있다. 예컨대, 메모리에 저장된 냉장고에 대 한 정보에 이상이 존재하는 경우, 'Ch' 에러가 존재한다고 지칭할 수 있다. 프로세서는 메모리에 저장된 냉장고에 대한 정보가 제1 상태 정보에 해당하는 0xFF인 경우, 냉 장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 프로세서는 메모리에 저장된 냉장고에 대한 정보가 제2 상태 정보에 해당하는 0x00인 경우, 냉 장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 프로세서는 메모리에 존재하는 복수의 저장 공간에 냉장고에 대한 정보를 읽을 수 있다. 프로세 서는 적어도 하나의 저장 공간에서 식별된 냉장고에 대한 정보가 나머지 저장 공간에서 식별된 냉장 고에 대한 정보와 상이하다고 판단하면, 냉장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 예를 들어, 프로세서는 3개의 저장 공간에서 냉장고에 대한 정보를 식별할 수 있다. 프로세서는 1번 저장 공간에서 식별된 냉장고에 대한 정보가 0x01이고, 3번 저장 공간에서 식별된 냉장고에 대한 정보 가 0x01이고, 2번 저장 공간에서 식별된 냉장고에 대한 정보가 0x02인 경우, 냉장고에 대한 정보 에 이상이 존재한다고 판단할 수 있다. 프로세서는 메모리에 저장된 냉장고에 대한 정보에 이상이 존재하는 경우, 냉장고에 이상 상태가 발생한 것으로 판단할 수 있다. 프로세서는 냉장고에 이상 상태가 발생한 경우, 이상 모드로 동작할 수 있다. 프로세서는 이상 모드에서, 냉장고의 이상 상태 발생에 대한 알림을 출력할 수 있다. 프로세서는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 출력하도록 음향 출력부를 제어할 수 있다. 프로세서는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 표시하도록 디스플레이를 제어할 수 있 다. 예컨대, 도 9의 902에서 프로세서는 이상 상태 발생에 대한 알림을 나타내는 'Ch' 에러를 디스플 레이에 표시할 수 있다. 예컨대, 'Ch' 에러는 냉장고가 서비스 기사에 의해 수리되기 전까지는 해결 될 수 없는 에러일 수 있다. 도 8b는 본 개시의 일 실시예에 따른 냉장고에서 출력한 알림을 끄기 위한 동작을 설명하기 위한 도면이다. 도 9는 본 개시의 일 실시예에 따른 냉장고의 디스플레이 및 사용자 인터페이스를 나타내는 예시 도면이다. 도 8b 는 도 5의 동작 560, 및 동작 570에 따라 냉장고의 이상 모드에서 알림을 끄는 동작을 설명하기 위한 도면 이다. 도 9의 903은 냉장고의 이상 모드에서 알림을 끄는 동작을 설명하기 위한 도면이다.프로세서는 사용자 인터페이스를 통해 적어도 하나의 키에 대한 사용자의 입력을 수신할 수 있다 . 프로세서는 사용자 인터페이스를 통해 기 정의된 동작에 매핑된 적어도 하나의 키에 대한 입 력 신호를 수신할 수 있다. 적어도 하나의 키는 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑될 수 있다. 예를 들어, 적어도 하나의 키는 정상 모드일 때는 기 정의된 동작에 매핑되다가, 이상 모드일 때는 냉장 고의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 프로세서는 현 재 프로세서가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 적어도 하나의 키에 대응하여 다르게 동작할 수 있다 예컨대, 도 9의 903에서 프로세서는 왼쪽 방향키에 대한 입력 신호를 수신할 수 있다. 왼쪽 방향키 는 정상 모드일 때는 저장실의 온도를 낮추는 동작에 매핑되고, 이상 모드일 때는 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 프로세서는 적어도 하나의 키에 대한 입력에 기초하여, 이상 상태 발생에 대한 알림을 끄도록 음향 출력부 를 제어할 수 있다. 음향 출력부는 사용자의 입력에 기초하여 이상 상태 발생에 대한 알림을 출 력하지 않을 수 있다. 프로세서는 적어도 하나의 키에 대한 입력에 기초하여, 이상 상태 발생에 대한 알림 을 껐다는 정보를 표시하기 위해 디스플레이를 제어할 수 있다. 예컨대, 도 9의 903에서 프로세서 는 이상 상태 발생에 대한 알림을 껐다는 정보를 나타내는 'SF(Sound Off)'를 디스플레이에 표시할 수 있다. 한편, 프로세서 정상 모드일 때와 이상 모드일 때 서로 동일한 동작에 매핑되는 일반적인 키에 대한 사용 자의 입력을 수신할 수도 있다. 예를 들어, 프로세서 도 9의 오른쪽 방향키 또는 가운데 키에 대한 사용자의 입력을 수신할 수 있다. 프로세서는 서비스 기사에 의해 수리되기 전까지는 해결될 수 없는 'Ch' 에러가 존재하는 경우, 일반적인 키의 입력을 수신하더라도 동작하지 않을 수 있다. 도 8c는 본 개시의 일 실시예에 따른 냉장고에서 출력한 알림을 켜기 위한 동작을 설명하기 위한 도면이다. 도 9는 본 개시의 일 실시예에 따른 냉장고의 디스플레이 및 사용자 인터페이스를 나타내는 예시 도면이다. 도 8c 는 도 5의 동작 560, 및 동작 580에 따라 냉장고의 이상 모드에서 알림을 켜는 동작을 설명하기 위한 도면 이다. 도 9의 904는 냉장고의 이상 모드에서 알림을 켜는 동작을 설명하기 위한 도면이다. 프로세서는 사용자 인터페이스를 통해 적어도 하나의 키에 대한 사용자의 입력을 수신할 수 있다 . 프로세서는 사용자 인터페이스를 통해 기 정의된 동작에 매핑된 적어도 하나의 키에 대한 입 력 신호를 수신할 수 있다. 예컨대, 동작 850의 입력 신호는 도 8b의 동작 830의 입력 신호의 후속 신호일 수 있다. 예컨대, 도 9의 904에서 프로세서는 왼쪽 방향키에 대한 입력 신호를 수신할 수 있다. 왼쪽 방향키 는 정상 모드일 때는 저장실의 온도를 낮추는 동작에 매핑되고, 이상 모드일 때는 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 프로세서는 적어도 하나의 키에 대한 입력에 기초하여, 현재 이상 상태 발생에 대한 알림이 켜진 상태인지 를 식별할 수 있다. 프로세서는 음향 출력부가 이상 상태 발생에 대한 알림을 출력하고 있는지 여부를 식별할 수 있다. 동작 860은 도 6의 동작 665에 대응될 수 있다. 예를 들어, 프로세서는 현재 이상 상태 발생에 대한 알림이 꺼진 상태라고 판단하면, 적어도 하나의 키에 대한 입력에 기초하여 이상 상태 발생에 대한 알림을 다시 켜도록 음향 출력부를 제어할 수 있다. 음 향 출력부는 이상 상태 발생에 대한 알림을 다시 출력할 수 있다. 프로세서는 이상 상태 발생에 대한 알림을 켰다는 정보를 표시하기 위해 디스플레이를 제어할 수 있다. 예컨대, 도 9의 904에서 프로세 서는 이상 상태 발생에 대한 알림을 켰다는 정보를 나타내는 'So(Sound On)'를 디스플레이에 표시할 수 있다. 이와 달리, 프로세서는 현재 이상 상태 발생에 대한 알림이 켜진 상태라고 판단하면, 이상 상태 발생에 대 한 알림을 끄도록 음향 출력부를 제어할 수도 있다. 한편, 도 8a 내지 도 8c의 예시와 달리, 일 실시예에 따른 프로세서는 현재 이상 상태 발생에 대한 알림이 켜진 상태인지를 식별하는 동작을 생략할 수도 있다. 예컨대, 정상 모드일 때와 이상 모드일 때 서로 다른 동작 에 매핑되는 적어도 하나의 키가 2개 이상으로 구현되는 경우, 프로세서는 현재 이상 상태 발생에 대한 알림이 켜진 상태인지를 식별하는 동작을 생략할 수도 있다. 예컨대, 왼쪽 방향키는 정상 모드에서 냉장실의 온도를 낮추는 동작에 매핑되고, 이상 모드에서 이상 상태 발생에 대한 알림을 끄는 동작에 매핑될 수 있다. 또 한, 오른쪽 방향키는 정상 모드에서 냉장실의 온도를 높이는 동작에 매핑되고, 이상 모드에서 이상 상태 발생에 대한 알림을 켜는 동작에 매핑될 수 있다. 이 경우, 프로세서는 왼쪽 방향키에 대한 사용자의 입력에 기초하여, 이상 상태 발생에 대한 알림을 끌 수 있다. 프로세서는 오른쪽 방향키에 대한 사용 자의 입력에 기초하여, 이상 상태 발생에 대한 알림을 끌 수 있다. 도 10은 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 제어하기 위한 방법을 나타낸 흐 름도이다. 도 10을 참조하면, 동작 1010에서, 본 개시의 일 실시예에 따른 냉장고는 도어가 기 설정된 시간 이 상 개방되어 있는 지 여부를 식별할 수 있다. 냉장고는 도어 스위치를 통해 도어의 개폐 상 태를 감지할 수 있다. 도어 스위치는 자석을 이용하여 도어의 개폐 상태를 감지하는 리드 스위치 (reed switch) 등을 포함할 수 있다. 예를 들어, 도어가 열리면 도어 스위치에 전기가 통하고, 도 어가 닫히면 도어 스위치가 개방됨으로써 도어의 개폐 상태가 감지될 수 있다. 예를 들어, 도어 스위치는 프로세서에 도어 개방 상태에 대한 감지 신호를 제공할 수 있다. 프로세서는 도 어 스위치로부터 기 설정된 시간 이상 감지 신호를 수신한 경우, 도어가 기 설정된 시간 이상 개방 되어 있다고 판단할 수 있다. 예컨대, 기 설정된 시간은 2분일 수 있으나, 이에 제한되지 않는다. 또는, 도어 스위치에 오픈(open) 불량이 존재하는 경우, 냉장고는 도어가 닫혔음에도 불구하 고 도어가 개방되었다고 잘못 판단할 수 있다. 예를 들어, 도어 스위치는 도어가 닫혔음에도 불구하고 도어 개방 상태에 대한 감지 신호를 프로세서에 제공할 수 있다. 프로세서는 도어 스위치 로부터 기 설정된 시간 이상 감지 신호를 수신한 경우, 도어가 기 설정된 시간 이상 개방되어 있다 고 판단할 수 있다. 동작 1010 및 동작 1020에서, 본 개시의 일 실시예에 따른 냉장고는 도어가 기 설정된 시간 이상 개 방되지 않는 경우, 냉장고가 정상이라고 판단할 수 있다. 냉장고는 정상 모드에 따라 동작할 수 있다. 동작 1030에서, 본 개시의 일 실시예에 따른 냉장고는 정상 모드에서 기 정의된 동작에 매핑된 적어도 하 나의 키에 대한 사용자의 입력에 따라, 기 정의된 동작을 수행할 수 있다. 본 개시의 일 실시예에 따른 사용자 인터페이스는 복수의 키를 포함할 수 있다. 복수의 키 각각은 사용자 의 푸쉬 조작을 수신하는 버튼, 사용자의 터치를 감지하는 터치 패드, 조그 휠, 조그 스위치, 및 돔 스위치 중 어느 하나의 형태로 구성될 수 있다. 사용자는 사용자 인터페이스에 구비된 복수의 키를 이용하여 냉장고 의 각종 기능을 제어할 수 있다. 예를 들어, 복수의 키는 기 정의된 동작과 연계 또는 매핑(mapping)될 수 있다. 예를 들어, 기 정의된 동작에는 저장실의 온도 조절, 메뉴 선택, 제빙 동작 개시, 제빙 동작 중지, 정수 기 추출 개시 등을 포함할 수 있다. 본 개시의 일 실시예에 따른 메모리는 복수의 키에 대응하는 기 정의된 동작에 관한 정보를 저장할 수 있 다. 예를 들어, 메모리는 복수의 키와 매핑된 기 정의된 동작에 관한 정보를 저장할 수 있다. 예를 들어, 복수의 키 중 적어도 하나의 키가 사용자에 의해 입력되면, 프로세서는 적어도 하나의 키에 매핑된 기 정 의된 동작을 수행할 수 있다. 예컨대, 프로세서는 저장실의 온도를 낮추는 동작에 매핑된 키를 통해 사용 자의 입력을 수신하면, 저장실의 온도를 낮추도록 냉기 공급 장치를 제어할 수 있다. 동작 1010 및 동작 1040에서, 본 개시의 일 실시예에 따른 냉장고는 도어가 기 설정된 시간 이상 개 방된 경우, 냉장고에 이상 상태가 발생한 것으로 판단할 수 있다. 냉장고는 도어가 기 설정된 시간 이상 개방된 경우, 이상 모드로 동작할 수 있다. 예컨대, 도어가 기 설정된 시간 이상 개방된 경우, 냉장고의 내부 온도는 외부의 온도에 의해 변화되므로, 냉장고는 사용자가 도어 열림에 따른 이상 상 태를 인지하도록 알림을 제공할 수 있다. 예를 들어, 냉장고는 이상 상태 발생에 대한 알림을 출력할 수 있다. 예를 들어, 냉장고는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 표시하도록 디스플레이(12 2)를 제어할 수 있다. 또한, 예를 들어, 냉장고는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 출력 하도록 음향 출력부를 제어할 수 있다. 도어 열림에 따른 이상 상태는, 도어가 닫히는 경우 해결될 수 있다. 냉장고는 도어가 닫힐 때까지 이상 상태 발생에 대한 알림을 출력할 수 있다. 이와 달리, 도어 스위치의 고장에 따른 이상 상태 는, 도어 스위치가 서비스 기사에 의해 수리되기 전까지는 해결될 수 없는 에러일 수 있다. 냉장고 는 도어가 닫혀 있더라도 이상 상태 발생에 대한 알림을 출력할 수 있다. 동작 1050에서, 본 개시의 일 실시예에 따른 냉장고는 이상 모드에서 기 정의된 동작에 매핑된 적어도 하 나의 키에 대한 사용자의 입력 존재하는 지 여부를 식별할 수 있다. 동작 1060에서, 본 개시의 일 실시예에 따른 냉장고는 기 정의된 동작에 매핑된 적어도 하나의 키에 대한 사용자의 입력이 존재한다고 판단하면, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스 를 제어할 수 있다. 동작 1070에서, 본 개시의 일 실시예에 따른 냉장고는 기 정의된 동작에 매핑된 적어도 하나의 키에 대한 사용자의 입력이 존재하지 않는다고 판단하면, 냉장고의 이상 상태 발생에 대한 알림을 유지하도록 출력 인터페이스를 제어할 수 있다. 본 개시의 일 실시예에서, 사용자 인터페이스에 포함된 복수의 키는 정상 모드일 때와 이상 모드일 때 서 로 다른 동작에 매핑되는 적어도 하나의 키를 포함할 수 있다. 예를 들어, 적어도 하나의 키는 정상 모드일 때 는 기 정의된 동작에 매핑되다가, 이상 모드일 때는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도 록 제어하는 동작에 매핑될 수 있다. 본 개시의 일 실시예에서, 냉장고는 현재 냉장고가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 적어도 하나의 키에 대응하여 다르게 동작할 수 있다. 예를 들어, 냉장고는 적어도 하나의 키를 통해 사용자의 입력을 수신하면, 정상 모드일 때는 저장실의 온도를 낮추는 동작을 수행하다가, 이상 모드일 때는 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위해 출력 인터페이스를 제어할 수 있다. 본 개시의 일 실시예에서, 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑되는 적어도 하나의 키는 2 개 이상으로 구현될 수 있다. 이 경우, 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위한 동작은 2개 이상의 키를 통해 구현될 수 있다. 예를 들어, 적어도 하나의 키는 정상 모드일 때 기 정의된 제1 동작을 수행 하기 위한 제1 키와 기 정의된 제2 동작을 수행하기 위한 제2 키를 포함할 수 있다. 냉장고는 이상 모드일 때 제1 키를 통해 이상 상태 발생에 대한 알림을 끄고, 제2 키를 통해 이상 상태 발생에 대한 알림을 켤 수 있 다. 예컨대, 제1 키는 저장실의 온도를 낮추기 위한 키이고, 제2 키는 저장실의 온도를 높이기 위한 키일 수 있 다. 한편, 본 개시의 일 실시예에서, 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑되는 적어도 하나 의 키는 단일 키로 구현될 수도 있으며, 이에 관해서는 도 6에서 설명하였으므로 생략한다. 본 개시의 일 실시예에서, 복수의 키는 정상 모드일 때와 이상 모드일 때 서로 동일한 동작에 매핑되는 일반적 인 키를 더 포함할 수 있다. 예컨대, 일반적인 키는 기 정의된 동작과 매핑될 수 있다. 본 개시의 일 실시예에 서, 냉장고는 정상 모드일 때 일반적인 키를 통해 사용자의 입력을 수신하면, 기 정의된 동작을 수행할 수 있다. 본 개시의 일 실시예에서, 냉장고는 도어 열림으로 인해 냉장고가 이상 모드로 동작하는 경우, 일반적인 키를 통해 사용자의 입력을 수신하면 기 정의된 동작을 수행할 수 있다. 도어 열림에 따른 이상 상태 에서, 사용자는 일반적인 키를 이용하여 냉장고의 각종 기능을 제어할 수 있다. 이는, 도 5에서 예시한 냉 장고의 고장에 따른 이상 상태에서, 사용자가 일반적인 키를 입력하더라도 냉장고가 기 정의된 동작 을 수행하지 않는 것과 다르다. 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태가 해결되기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 제어할 수 있다. 예를 들어, 냉장고는 도어가 닫히기 전이라 도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 예를 들어, 냉장고는 도어 스위치의 고장이 수리되기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림 을 끄도록 음향 출력부를 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 사용자의 입력에 의 해 이상 상태 발생에 대한 알림을 끔으로써, 사용자가 청각적 소음에 노출되는 불편함을 해소할 수 있다. 한편, 본 개시의 일 실시예에 따른 냉장고는 이상 상태 발생에 대한 알림을 끈 경우, 기기 관리 서버(도 16의 300)를 통해 서비스 센터에 이상 상태 발생에 대한 알림이 꺼졌다는 정보를 전송할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 알림이 사용자의 제어에 의해 꺼지더라도 냉장고의 이상 상태에 대한 수리가 누락되지 않기 위해, 서비스 센터에 해당 정보를 전송할 수 있다. 도 11a는 본 개시의 일 실시예에 따른 냉장고에서 이상 상태가 발생한 경우 알림을 출력하는 동작을 설명하기 위한 도면이다. 도 11a는 도 10의 동작 1010, 및 동작 1040에 따라 냉장고의 이상 모드를 설명하기 위한 도면이다. 프로세서는 도어 스위치를 통해 도어의 개폐 상태를 식별할 수 있다. 도어 스위치는 자 석을 이용하여 도어의 개폐 상태를 감지하는 리드 스위치(reed switch) 등을 포함할 수 있다. 예를 들어, 도어가 열리면 도어 스위치에 전기가 통하고, 도어가 닫히면 도어 스위치가 개방됨으 로써 도어의 개폐 상태가 감지될 수 있다. 도어 스위치는 도어의 개폐 상태에 대한 감지 신 호를 프로세서에 제공할 수 있다. 프로세서는 도어가 기 설정된 시간 이상 개방되어 있는 지 여부를 식별할 수 있다. 예를 들어, 도어 스위치는 도어가 개방된 경우, 도어 개방 상태에 대한 감지 신호를 프로세서에 제 공할 수 있다. 프로세서는 도어 스위치로부터 도어가 개방된 상태에 대한 감지 신호를 수신할 수 있다. 프로세서는 도어 스위치로부터 기 설정된 시간 이상 감지 신호를 수신한 경우, 도어(163 0)가 기 설정된 시간 이상 개방되어 있다고 판단할 수 있다. 예컨대, 기 설정된 시간은 2분일 수 있으나, 이에 제한되지 않는다. 또는, 도어 스위치에 오픈(open) 불량이 존재하는 경우, 도어 스위치는 도어가 닫혔음에도 불구하고 도어 개방 상태에 대한 감지 신호를 프로세서에 제공할 수 있다. 프로세서는 도어 가 닫혔음에도 불구하고 도어가 개방되었다고 잘못 판단할 수 있다. 프로세서는 도어 스위치 로부터 기 설정된 시간 이상 감지 신호를 수신한 경우, 도어가 기 설정된 시간 이상 개방되어 있다 고 판단할 수 있다. 프로세서는 도어가 기 설정된 시간 이상 개방된 경우, 냉장고에 이상 상태가 발생한 것으로 판 단할 수 있다. 이에 따라, 프로세서는 이상 모드로 동작할 수 있다. 예컨대, 도어가 기 설정 된 시간 이상 개방된 경우, 냉장고의 내부 온도는 외부의 온도에 의해 변화되므로, 프로세서는 사용 자가 도어 열림에 따른 이상 상태를 인지하도록 알림을 제공할 수 있다. 예를 들어, 프로세서는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 출력하도록 음향 출력부를 제어할 수 있다. 도어 열림에 따른 이상 상태는, 도어가 닫히는 경우 해결될 수 있다. 냉장고는 도어가 닫힐 때까지 이상 상태 발생에 대한 알림을 출력할 수 있다. 이와 달리, 도어 스위치의 고장에 따른 이상 상태 는, 도어 스위치가 서비스 기사에 의해 수리되기 전까지는 해결될 수 없는 에러일 수 있다. 냉장고 는 도어가 닫혀 있더라도 이상 상태 발생에 대한 알림을 출력할 수 있다. 또는, 도시하지 않았으나 프로세서는 이상 상태 발생에 대한 알림을 표시하도록 디스플레이를 제어할 수도 있다. 도 11b는 본 개시의 일 실시예에 따른 냉장고에서 출력한 알림을 끄기 위한 동작을 설명하기 위한 도면이다. 도 11b는 도 10의 동작 1050, 및 동작 1060에 따라 냉장고의 이상 모드에서 알림을 끄는 동작을 설명하기 위 한 도면이다. 프로세서는 사용자 인터페이스를 통해 적어도 하나의 키에 대한 사용자의 입력을 수신할 수 있다 . 프로세서는 사용자 인터페이스를 통해 기 정의된 동작에 매핑된 적어도 하나의 키에 대한 입 력 신호를 수신할 수 있다. 적어도 하나의 키는 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑될 수 있다. 예를 들어, 적어도 하나의 키는 정상 모드일 때는 기 정의된 동작에 매핑되다가, 이상 모드일 때는 냉장 고의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 프로세서는 현 재 프로세서가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 적어도 하나의 키에 대응하여 다르게 동작할 수 있다. 예를 들어, 프로세서는 정상 모드에서 적어도 하나의 키에 사용자의 입력을 수신 하는 경우, 기 정의된 동작을 수행할 수 있다. 예를 들어, 프로세서는 이상 모드에서 적어도 하나의 키에 사용자의 입력을 수신하는 경우, 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어할 수 있다. 예컨대, 프로세서는, 도 9의 903와 같이 왼쪽 방향키에 대한 입력 신호를 수신할 수 있다. 왼쪽 방향 키는 정상 모드일 때는 저장실의 온도를 낮추는 동작에 매핑되고, 이상 모드일 때는 이상 상태 발생에 대 한 알림을 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 프로세서는 적어도 하나의 키에 대한 입력에 기초하여, 이상 상태 발생에 대한 알림을 끄도록 음향 출력부 를 제어할 수 있다. 음향 출력부는 사용자의 입력에 기초하여 이상 상태 발생에 대한 알림을 출력하지 않을 수 있다. 프로세서는 적어도 하나의 키에 대한 입력에 기초하여, 이상 상태 발생에 대한 알 림을 껐다는 정보를 표시하기 위해 디스플레이를 제어할 수 있다. 예컨대, 프로세서는 이상 상 태 발생에 대한 알림을 껐다는 정보를 나타내는 'SF(Sound Off)'를 디스플레이에 표시할 수 있다. 한편, 프로세서 정상 모드일 때와 이상 모드일 때 서로 동일한 동작에 매핑되는 일반적인 키에 대한 사용 자의 입력을 수신할 수도 있다. 예를 들어, 프로세서 도 9의 오른쪽 방향키 또는 가운데 키에 대한 사용자의 입력을 수신할 수 있다. 프로세서는 도어 열림으로 인해 냉장고가 이상 모드로 동작하 는 경우, 일반적인 키를 통해 사용자의 입력을 수신하면 기 정의된 동작을 수행할 수 있다. 도어 열림에 따른 이상 상태에서, 사용자는 일반적인 키를 이용하여 냉장고의 각종 기능을 제어할 수 있다. 이는, 도 5에서 예시한 냉장고의 고장에 따른 이상 상태에서, 사용자가 일반적인 키를 입력하더라도 냉장고가 기 정 의된 동작을 수행하지 않는 것과 다르다. 도 12는 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 제어하기 위한 방법을 나타낸 흐 름도이다. 도 12를 참조하면, 동작 1210에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태 발생 여부를 식별할 수 있다. 본 개시의 일 실시예에서, 냉장고의 이상 상태는, 냉장고에 대한 정보에 이 상이 있는 것에 기초한 냉장고의 고장 상태, 냉장고의 도어가 기 설정된 시간 이상 개방된 상 태, 냉장고의 도어 스위치의 고장 상태 등을 포함할 수 있다. 동작 1210은 도 4의 동작 410에 대응 할 수 있다. 동작 1220에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고에 이상 상태가 발생한 것에 기초하여, 이상 모드로 동작할 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 출력하도록 출력 인 터페이스를 제어할 수 있다. 예를 들어, 냉장고는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 출력하도록 음향 출력부를 제어할 수 있다. 예를 들어, 냉장고는 이상 모드에 따라, 이상 상태 발생 에 대한 알림을 표시하도록 디스플레이를 제어할 수 있다. 동작 1220은 도 4의 동작 420에 대응할 수 있다. 동작 1230에서, 본 개시의 일 실시예에 따른 냉장고는 기 정의된 동작에 매핑되지 않은 더미 키(dummy key)가 냉장고의 이상 상태 발생에 대한 알림을 제어할 수 있다는 정보를 출력할 수 있다. 예를 들어, 냉 장고는 더미 키가 냉장고의 이상 상태 발생에 대한 알림을 제어할 수 있다는 정보를 출력하도록 디스 플레이를 제어할 수 있다. 본 개시의 일 실시예에 따른 사용자 인터페이스는 복수의 키를 포함할 수 있다. 복수의 키 각각은 사용자 의 푸쉬 조작을 수신하는 버튼, 사용자의 터치를 감지하는 터치 패드, 조그 휠, 조그 스위치, 및 돔 스위치 중 어느 하나의 형태로 구성될 수 있다. 사용자는 사용자 인터페이스에 구비된 복수의 키를 이용하여 냉장고 의 각종 기능을 제어할 수 있다. 예를 들어, 복수의 키는 기 정의된 동작과 연계 또는 매핑(mapping)될 수 있다. 예를 들어, 기 정의된 동작에는 저장실의 온도 조절, 메뉴 선택, 제빙 동작 개시, 제빙 동작 중지, 정수 기 추출 개시 등을 포함할 수 있다. 본 개시의 일 실시예에서, 사용자 인터페이스는 소정의 동작에 연계 또는 매핑되지 않는 더미 키를 포함할 수 있다. 예를 들어, 더미 키는 터치 센서를 포함하지만, 더미 키에 매핑된 동작이 없을 수 있다. 냉장고 는 더미 키에 대한 사용자의 입력을 수신하더라도 소정의 동작을 수행하지 않는다. 본 개시의 일 실시예에서, 더미 키는 정상 모드일 때와 이상 모드일 때 서로 다른 동작에 매핑될 수 있다. 예를 들어, 더미 키는 정상 모드에서는 기 정의된 동작을 제어하기 위한 키가 아니지만, 이상 모드에서는 알림을 끄 거나 켜도록 제어하기 위한 키로 사용될 수 있다. 예를 들어, 더미 키는 정상 모드일 때는 기 정의된 동작에 매 핑되지 않다가, 이상 모드일 때는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 본 개시의 일 실시예에 따른 정상 모드에서, 더미 키에는 사용자에게 소정의 기능을 안내하는 표시가 없으므로, 사용자는 더미 키를 이용하여 냉장고에 기 정의된 동작을 제어하지 않는다. 본 개시의 일 실시예에 따른 이상 모드에서, 냉장고는 사용자에게 냉장고의 이상 상태에서 더미 키를 이용하여 알림을 제어할 수 있다는 안내를 제공할 수 있다. 더미 키에는 사용자에게 소정의 기능을 안내하는 표 시가 없으므로, 냉장고는 사용자가 더미 키를 이용하여 소정의 동작을 제어할 수 있음을 안내할 수 있다. 예를 들어, 냉장고는 더미 키가 냉장고의 이상 상태 발생에 대한 알림을 제어할 수 있다는 정보를 디 스플레이 할 수 있다. 예를 들어, 냉장고는 냉장고의 알림을 제어하기 위해 더미 키에 대한 입력을 수 초간 유지해야한다는 정보를 디스플레이 할 수 있다. 예를 들어, 냉장고는 더미 키의 위치를 안내하는 표시를 디스플레이 할 수 있다. 예컨대, 냉장고는 더미 키의 주변에 더미 키의 위치를 안내하는 화살표, 더미 키가 이상 상태 발생에 대한 알림을 끄거나 켤 수 있다는 정보, 더미 키에 대한 입력을 5초 간 유지해야한 다는 정보를 표시할 수 있다. 동작 1240에서, 본 개시의 일 실시예에 따른 냉장고는 더미 키에 대한 사용자의 입력에 따라, 냉장고(10 0)의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어할 수 있다. 예를 들어, 냉장고는 더미 키에 대한 사용자의 입력에 따라, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 음향 출력부 를 제어할 수 있다. 음향 출력부는 냉장고의 이상 상태 발생에 대한 알림을 출력하지 않을 수 있다. 본 개시의 일 실시예에서, 냉장고는 현재 냉장고가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 더미 키에 대응하여 다르게 동작할 수 있다. 예를 들어, 냉장고는 정상 모드일 때 더미 키를 통해 사용자의 입력을 수신하면, 소정의 동작을 수행하지 않을 수 있다. 냉장고는 이상 모드일 때 더미 키 를 통해 사용자의 입력을 수신하면, 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하기 위해 음향 출력부 를 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 정상 모드에서는 사용하지 않는 더미 키를 이용하여 이상 모드에서 의 알림을 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태가 해결되기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 제어할 수 있다. 예를 들어, 냉장고는 냉장고의 고장이 수리되 기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 예 를 들어, 냉장고는 도어가 닫히기 전이라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도 록 음향 출력부를 제어할 수 있다. 예를 들어, 냉장고는 도어 스위치의 고장이 수리되기 전이 라도 사용자 입력에 의해 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 사용자의 입력에 의해 이상 상태 발생에 대한 알림을 끔으로써, 사용자가 청각 적 소음에 노출되는 불편함을 해소할 수 있다. 한편, 본 개시의 일 실시예에 따른 냉장고는 이상 상태 발생에 대한 알림을 끈 경우, 기기 관리 서버(도 16의 300)를 통해 서비스 센터에 이상 상태 발생에 대한 알림이 꺼졌다는 정보를 전송할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 알림이 사용자의 제어에 의해 꺼지더라도 냉장고의 이상 상태에 대한 수리가 누락되지 않기 위해, 서비스 센터에 해당 정보를 전송할 수 있다. 도 13a는 본 개시의 일 실시예에 따른 냉장고가 이상 상태가 발생한 경우 알림을 출력하고, 알림을 제어할 수 있다는 정보를 표시하는 동작을 설명하기 위한 도면이다. 도 14는 본 개시의 일 실시예에 따른 냉장고가 알림을 제어할 수 있다는 정보를 표시하는 동작을 설명하기 위한 도면이다. 도 13a는 도 12의 동작 1210, 동작 1220, 및 동작 1230에 따라 냉장고의 이상 모드를 설명하기 위한 도면이다. 도 14의 1401 및 1402은 각각 냉장고 의 정상 모드 및 이상 모드를 설명하기 위한 도면이다. 프로세서는 냉장고에 이상 상태 발생 여부를 식별할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 냉장고에 대한 정보에 이상이 존재하는 경우, 냉장고 에 이상 상태가 발생한 것으로 식별할 수 있다. 예를 들어, 프로세서는 메모리에 저장된 냉장고 에 대한 정보가 제1 상태 정보에 해당하는 0xFF 또는 제2 상태 정보에 해당하는 0x00인 경우, 냉장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 예를 들어, 프로세서는 프로세서는 적어도 하 나의 저장 공간에서 식별된 냉장고에 대한 정보가 나머지 저장 공간에서 식별된 냉장고에 대한 정보 와 상이하다고 판단하면, 냉장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 예를 들어, 프로세서는 도어가 기 설정된 시간 이상 개방되어 있다고 판단하면, 냉장고에 이상 상태가 발생한 것으로 식별할 수 있다. 예를 들어, 도어 스위치는 도어가 개방된 경우, 도어 개방 상태에 대한 감지 신호를 프로세서에 제공할 수 있다. 프로세서는 도어 스위치로부터 도어 가 개방된 상태에 대한 감지 신호를 수신할 수 있다. 프로세서는 도어 스위치로부터 기 설정 된 시간 이상 감지 신호를 수신한 경우, 도어가 기 설정된 시간 이상 개방되어 있다고 판단할 수 있다. 예를 들어, 도어 스위치에 오픈(open) 불량이 존재하는 경우, 도어 스위치는 도어가 닫혔음 에도 불구하고 도어 개방 상태에 대한 감지 신호를 프로세서에 제공할 수 있다. 프로세서는 도어 가 닫혔음에도 불구하고 도어가 개방되었다고 잘못 판단할 수 있다. 프로세서는 냉장고에 이상 상태가 발생한 것으로 판단하면, 이상 모드로 동작할 수 있다. 예를 들어, 프로세서는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 출력하도록 음향 출력부를 제어할 수 있다. 음향 출력부는 이상 상태 발생에 대한 알림을 출력할 수 있다. 예를 들어, 프로세서는 이상 모드에 따라, 이상 상태 발생에 대한 알림을 표시하도록 디스플레이를 제어할 수 있다. 디스플레이는 이상 상태 발생에 대한 알림을 표시할 수 있다. 예를 들어, 프로세서는 이상 모드에 따라, 기 정의된 동작에 매핑되지 않은 더미 키가 냉장고의 이상 상태 발생에 대한 알림을 제어할 수 있다는 정보를 출력할 수 있다. 예컨대, 도 14의 1401에서 더미 키는 정상 모드에서는 기 정의된 동작을 제어하기 위한 키가 아니지만, 이상 모드에서는 알림을 끄거나 켜도록 제어하기 위한 키로 사용될 수 있다. 정상 모드에서, 더미 키에는 사용자에게 소정의 기능을 안내하는 표시가 없으므로, 사용자는 더미 키를 이용하여 냉장고에 기 정 의된 동작을 제어하지 않는다. 예컨대, 도 14의 1402에서 더미 키는 이상 모드에서는 알림을 끄거나 켜도록 제어하기 위한 키로 사용될 수 있다. 냉장고는 사용자에게 냉장고의 이상 상태에서 더미 키를 이용하여 알림을 제어할 수 있다는 정보를 제공할 수 있다. 더미 키에는 사용자에게 소정의 기능을 안내하는 표시가 없으므로, 냉장고는 사용자가 더미 키를 이용하여 소정의 동작을 제어할 수 있음을 안내할 수 있다.. 예컨대, 냉장고는 더미 키의 위에 더미 키의 위치를 안내하는 아래 방향 화살표, 더미 키가 이 상 상태 발생에 대한 알림을 끌 수 있다는 \"Sound Off' 표시, 더미 키에 대한 입력을 5초 간 유지해야한 다는 정보를 표시할 수 있다. 예컨대, 도 14의 1402에서 디스플레이는 냉장고의 고장에 따른 'Ch' 에러를 표시하고 있으나, 이에 제한되지 않고 도어 열림 표시나, 도어 스위치 고장 표시를 할 수도 있다. 도 13b는 본 개시의 일 실시예에 따른 냉장고에서 출력한 알림을 끄기 위한 동작을 설명하기 위한 도면이다. 도 14는 본 개시의 일 실시예에 따른 냉장고가 알림을 제어할 수 있다는 정보를 표시하는 동작을 설명하기 위한 도 면이다. 도 13b는 도 12의 동작 1240에 따라 냉장고의 이상 모드에서 알림을 끄는 동작을 설명하기 위한 도면이다. 도 14의 1403은 냉장고의 이상 모드에서 알림을 끄는 동작을 설명하기 위한 도면이다. 프로세서는 사용자 인터페이스를 통해 더미 키에 대한 사용자의 입력을 수신할 수 있다. 사용 자는 더미 키에 대한 입력을 수 초간 유지할 수 있다. 예컨대, 프로세서는, 도 14의 1403와 같이 더미 키 에 대한 입력 신호를 수신할 수 있다. 더미 키는 정상 모드일 때는 소정의 동작에 매핑되지 않다가, 이상 모드일 때는 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어하는 동작에 매핑될 수 있다. 프로세서는 현재 냉장고가 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 더미 키에 대 응하여 다르게 동작할 수 있다. 예를 들어, 프로세서는 정상 모드일 때 더미 키를 통해 사용자의 입력을 수신하면, 소정의 동작을 수행하지 않을 수 있다. 프로세서는 이상 모드일 때 더미 키를 통해 사용자의 입 력을 수신하면, 이상 상태 발생에 대한 알림을 끄기 위해 음향 출력부를 제어할 수 있다. 음향 출력 부는 이상 상태 발생에 대한 알림을 출력하지 않을 수 있다. 프로세서는 이상 모드일 때 더미 키를 통해 사용자의 입력을 수신하면, 이상 상태 발생에 대한 알림을 껐다는 정보를 표시하기 위해 디스플레이 를 제어할 수 있다. 예컨대, 프로세서는 이상 상태 발생에 대한 알림을 껐다는 정보를 나타내는 'SF(Sound Off)'를 디스플레이에 표시할 수 있다. 도 15는 본 개시의 일 실시예에 따른 냉장고가 알림을 제어하는 키에 대한 입력을 유지하는 시간에 따라, 알림 을 제어하기 위한 방법을 나타낸 흐름도이다. 도 15를 참조하면, 동작 1510에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고에 이상 상태가 발생 한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력할 수 있다. 동작 1520에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 끄기 위한 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간을 식별할 수 있다. 적어도 하나의 키는 정상 모 드에서 상기 기 정의된 동작에 매핑되고, 이상 모드에서 냉장고의 이상 상태 발생에 대한 알림을 제어하는 동작에 매핑될 수 있다. 냉장고는 이상 모드에서 적어도 하나의 키에 대한 사용자의 입력에 기초하여, 이 상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 냉장고는 적어도 하나의 키에 대 한 사용자의 입력이 유지되는 시간을 식별하고, 사용자의 입력이 유지되는 시간에 따라 알림을 제어하는 동작을 다르게 수행할 수 있다. 동작 1530에서, 본 개시의 일 실시예에 따른 냉장고는 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 n초 미만이라고 판단하면, 냉장고의 이상 상태 발생에 대한 알림을 출력할 수 있다(n은 양수). 냉 장고는 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 n초 미만이라고 판단하면, 적어도 하나 의 키에 대한 사용자의 입력이 없는 것으로 판단할 수 있다. 냉장고는 이상 상태 발생에 대한 알림을 끄도 록 음향 출력부를 제어하지 못할 수 있다. 따라서, 냉장고는 이상 상태 발생에 대한 알림을 계속해서 출력할 수 있다. 동작 1540에서, 본 개시의 일 실시예에 따른 냉장고는 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 2n초 미만이라고 판단하면, 냉장고의 이상 상태 발생에 대한 알림을 정해진 시간 동안 끄도록 음향 출력부를 제어할 수 있다. 냉장고는 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 n초 이상이고 2n초 미만이라고 판단할 수 있다. 예컨대, 정해진 시간은 30분일 수 있으나, 이에 제한되지 않는다. 동작 1550에서, 본 개시의 일 실시예에 따른 냉장고는 정해진 시간이 경과 하였는 지 여부를 식별할 수 있 다. 냉장고는 정해진 시간이 경과하지 않은 경우, 정해진 시간 동안 끄도록 음향 출력부를 제어할 수 있다. 동작 1560에서, 본 개시의 일 실시예에 따른 냉장고는 정해진 시간이 경과한 경우, 냉장고의 이상 상태 발 생에 대한 알림을 다시 출력할 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 다시 출력하도 록 음향 출력부를 제어할 수 있다. 동작 1570에서, 본 개시의 일 실시예에 따른 냉장고는 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 2n초 이상이라고 판단하면, 냉장고의 이상 상태 발생에 대한 알림이 꺼진 상태가 제1 상황이 발생 하기 전까지 유지되도록 출력 인터페이스를 제어할 수 있다. 예를 들어, 제1 상황은, 냉장고의 이상 상태 발생에 대한 알림이 꺼진 상태에서 적어도 하나의 키에 대한 사용자의 입력을 획득한 상황 또는 냉장고 의 이상 상태가 해결된 상황에 해당할 수 있다. 예를 들어, 냉장고는 사용자의 입력이 2n초 이상으로 길게 유지된다고 판단하면, 냉장고의 이상 상태 발생에 대한 알림을 제1 상황이 발생하기 전까지 끌 수 있 다. 동작 1580에서, 본 개시의 일 실시예에 따른 냉장고는 제1 상황이 발생하였는 지 여부를 식별할 수 있다. 예를 들어, 냉장고는 사용자가 적어도 하나의 키를 입력하여 이상 상태 발생에 대한 알림을 다시 켜도록 제어하였는 지 여부를 식별할 수 있다. 냉장고는 적어도 하나의 키에 대한 사용자의 입력이 존재하는 경우, 이상 상태 발생에 대한 알림 오프(off) 기능을 해제시킬 수 있다. 또는, 예를 들어, 냉장고는 냉장고의 이상 상태가 해결되었는 지 여부를 식별할 수 있다. 예컨대, 냉 장고는 도어가 닫힘에 따라 도어 열림 상태가 해소되었는 지 여부를 식별할 수 있다. 냉장고는 도어가 닫힘에 따라 도어 열림 상태가 해소된 경우, 이상 상태 발생에 대한 알림 오프(off) 기능을 해제 시킬 수 있다. 동작 1590에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 다시 출력할 수 있다. 냉장고는 이상 상태 발생에 대한 알림 오프(off) 기능을 해제하기 위해, 알림을 다시 출 력할 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 다시 출력하도록 음향 출력부 를 제어할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간에 따라, 이상 상태 발생에 대한 알림을 제어하는 동작을 다르게 수행할 수 있다. 이에 따라, 사용자가 원하는 시간 만큼 냉장고의 이상 상태 발생에 대한 알림을 끌 수 있으므로, 사용자 편의성이 향상될 수 있다. 도 16은 본 개시의 일 실시예에 따른 냉장고, 제어 장치, 기기 관리 서버, 단말기, 및 서비스 센터를 나타낸 도 면이다. 도 16을 참조하면, 본 개시의 일 실시예에 따른 냉장고 관리 시스템은 냉장고 이외에, 제어 장치, 기 기 관리 서버, 단말기, 및 서비스 센터를 포함할 수 있다. 냉장고, 단말기, 및 서비 스 센터는 기기 관리 서버와 통신을 할 수 있는 클라이언트 장치로 동작할 수 있다. 냉장고는 프로세서, 출력 인터페이스, 사용자 인터페이스, 메모리, 및 통신 모듈 을 포함할 수 있다. 프로세서, 출력 인터페이스, 사용자 인터페이스, 및 메모리는 도 2에서 설명하였으므로, 설명을 생략한다. 통신 모듈은 도 3의 통신 모듈에 대응할 수 있다. 통신 모듈은 유선 또는 무선 통신망을 이용하여 제어 장치, 기기 관리 서버, 단말기, 또는 서비 스 센터와 통신할 수 있다. 통신 모듈은 댁내의 AP(Access Point) 장치(미도시)를 통해서 통신망에 접속하고, 기기 관리 서버, 단말기, 또는 서비스 센터와 통신할 수 있다. 통신 모듈은 적외선 통신 모듈, 와이 파이 통신 모듈, 또는 BLE 통신 모듈 등을 이용하여 제어 장치 와 통신을 수행할 수 있다. 통신 모듈은 제어 장치와의 통신을 통해 제어 장치로부터 제어 신호 를 수신할 수 있다. 프로세서는 통신 모듈을 통해 제어 장치로부터 제어 신호를 수신할 수 있다. 제어 장치는 냉장고를 제어하는 데 이용되는 다양한 형태의 기기로 구현될 수 있다. 제어 장치 는 다양한 형태의 사용자 입력, 예를 들어, 터치 입력, 푸쉬 입력 등을 수신하고, 냉장고를 원격으로 제어 할 수 있는 리모컨을 포함할 수 있다. 제어 장치는 프로세서, 디스플레이, 적어도 하나의 키, 메모리, 및 통신 모듈을 포함할 수 있다. 적어도 하나의 키는 제어 장치를 제어하기 위한 사용자 입력을 수신할 수 있다. 적어도 하나의 키 는 사용자의 푸쉬 조작을 수신하는 버튼, 사용자의 터치를 감지하는 터치 패드, 조그 휠, 조그 스위치, 및 돔 스위치 중 어느 하나의 형태로 구성될 수 있다. 메모리는 적어도 하나의 키에 매핑된 기 정의된 동작을 저장할 수 있다. 프로세서는 적어도 하나의 키를 통한 사용자의 입력을 수신할 수 있다. 프로 세서는 적어도 하나의 키에 매핑된 기 정의된 동작을 포함하는 제어 신호를 생성할 수 있다. 프로세 서는 통신 모듈을 통해 기 정의된 동작을 포함하는 제어 신호를 냉장고에 전송할 수 있다. 기 정의된 동작을 포함하는 제어 신호는 통신 모듈의 종류에 따라 블루투스 타입, IR 신호 타입, RF (Radio Frequency) 신호 타입, 와이파이 타입 등으로 구현될 수 있다. 일 실시예에서, 냉장고와 제어 장치가 IR 통신을 수행하여 신호를 송수신하는 경우, 제어 장치 는 기 정의된 동작을 포함하는 제어 신호를 IR 신호로 생성할 수 있다. 예컨대, 제어 장치는 입력된 적어 도 하나의 키에 할당된 고유 주파수를 갖는 적외선 신호를 생성할 수 있다. 제어 장치는 적외선 신호를 통 신망을 이용하여 냉장고로 전송할 수 있다. 기기 관리 서버는 외부 장치와 통신을 수행하기 위한 통신 모듈을 포함할 수 있다. 기기 관리 서버는 통신 모듈을 통해 냉장고, 단말기, 또는 서비스 센터와 통신할 수 있다. 단말기는 통신 기능을 구비한 다양한 종류의 전자 장치에 대응될 수 있다. 단말기는 스마트폰, 웨어 러블 장치, 노트북, 넷북, 태블릿 PC 등의 휴대용 컴퓨터 등을 포함할 수 있으나 이에 한정되는 것은 아니다. 단말기는 기기 관리 서버에 연결되며, 기기 관리 서버에서 제공하는 정보를 표시하는 장치일 수 있다. 단말기는 단말기에 설치된 특정 애플리케이션(예컨대, 기기 관리 애플리케이션)을 통해서 기기 관리 서버와 정보를 송수신할 수 있다. 단말기는 기기 관리 서버를 통해 냉장고와 무선 정 보를 송수신할 수 있다. 단말기는 냉장고와 동일한 계정으로 기기 관리 서버에 등록된 사용자 기기일 수 있다. 사용자가 단말기에서 사용자의 기기를 관리하기 위한 애플리케이션을 실행하는 경우, 단말기는 기기 관리 서버로부터 정보를 수신하여, 냉장고와 관련된 화면을 애플리케이션 실행 창에 표시할 수 있다. 단말기는 냉장고를 제어하는 데 이용될 수 있다. 서비스 센터는 냉장고의 이상 상태를 모니터링하기 위한 전자 장치로 구현될 수 있다. 서비스 센터 는 통신 기능을 구비한 스마트폰, 웨어러블 장치, 노트북, 넷북, 태블릿 PC 등의 휴대용 컴퓨터 등을 포함 할 수 있으나 이에 한정되는 것은 아니다. 서비스 센터는 통신 모듈을 통해 기기 관리 서버에 연결되 며, 기기 관리 서버에서 제공하는 정보를 통해 냉장고를 모니터링할 수 있다. 도 17은 본 개시의 일 실시예에 따른 냉장고와 제어 장치의 동작을 설명하기 위한 도면이다. 도 17을 참조하여, 제어 장치를 통해 냉장고의 이상 상태 발생에 따른 알림을 제어하는 동작을 설명 한다. 도 17의 1701을 참조하여, 냉장고의 정상 모드에 따른 동작을 설명한다. 정상 모드에서, 제어 장치는 적어도 하나의 키에 대한 사용자의 입력을 수신할 수 있다. 제어 장치 는 적어도 하나의 키에 대한 제어 신호를 생성할 수 있다. 제어 장치는 기 정의된 동작을 포함 하는 제어 신호를 냉장고에 전송할 수 있다. 예컨대, 제어 신호는 통신 모듈의 종류에 따라 블루투 스 타입, IR 신호 타입, RF (Radio Frequency) 신호 타입, 와이파이 타입 등으로 구현될 수 있다. 냉장고는 제어 장치로부터 적어도 하나의 키에 대한 제어 신호를 수신할 수 있다. 냉장고 는 정상 모드로 동작하는 지 이상 모드로 동작하는 지에 따라, 적어도 하나의 키에 대한 제어 신호를 다르 게 처리할 수 있다. 예를 들어, 냉장고는 정상 모드에서 제어 장치로부터 적어도 하나의 키에 대한 제어 신호를 수신하면, 기 정의된 동작을 수행할 수 있다. 예를 들어, 냉장고는 이상 모드에서 제어 장치로부터 적어도 하나의 키에 대한 제어 신호를 수신하면, 이상 상태 발생에 대한 알림을 제어할 수 있다. 정상 모드에서 적어도 하나의 키에 대한 제어 신호는 기 정의된 동작에 매핑될 수 있다. 이상 모 드에서 적어도 하나의 키에 대한 제어 신호는 이상 상태 발생에 대한 알림을 제어하는 동작에 매핑될 수 있다. 예컨대, 냉장고는 정상 모드에서 냉장실의 온도를 낮추는 동작을 포함하는 제어 신호에 기초하여, 냉장실 의 온도를 낮추도록 제어할 수 있다. 냉장고는 제어 장치에 기 정의된 동작에 관한 정보를 전송할 수 있다. 예컨대, 냉장고는 냉장실의 온도 정보를 제어 장치에 전송할 수 있다. 제어 장치는 기 정의된 동작에 관한 정보를 냉장 고로부터 수신할 수 있다. 제어 장치는 디스플레이를 통해 기 정의된 동작에 관한 정보를 표시 할 수 있다. 도 17의 1702를 참조하여, 냉장고의 이상 모드에 따른 동작을 설명한다. 냉장고는 냉장고에 이상 상태가 발생한 것으로 판단한 경우, 이상 모드로 동작할 수 있다. 냉장고 는 이상 상태 발생에 대한 알림을 음향 출력부를 통해 출력할 수 있다. 냉장고는 이상 상태 발생에 대한 알림을 제어 장치에 전송할 수 있다. 제어 장치는 디스 플레이에 이상 상태 발생에 대한 알림을 표시하도도록, 디스플레이를 제어할 수 있다. 예를 들어, 제 어 장치는 디스플레이에 냉장고의 고장을 알리는 'Ch' 에러를 표시할 수 있다. 예를 들어, 제어 장치는 디스플레이에 냉장고의 도어 열림 상태를 알리는 안내를 표시할 수 있다. 예를 들어, 제 어 장치는 디스플레이에 냉장고의 도어 스위치의 고장을 알리는 안내를 표시할 수 있다. 도 17의 1703을 참조하여, 냉장고의 이상 모드에서 알림을 끄는 동작을 설명한다. 제어 장치는 적어도 하나의 키를 통해 사용자의 입력을 수신할 수 있다. 제어 장치는 적어도 하 나의 키에 대한 제어 신호를 생성할 수 있다. 제어 장치는 적어도 하나의 키에 대한 제어 신호 를 냉장고에 전송할 수 있다. 냉장고는 제어 장치로부터 적어도 하나의 키에 대한 제어 신호를 수신할 수 있다. 냉장고 는 이상 모드에서 제어 장치로부터 적어도 하나의 키에 대한 제어 신호를 수신하면, 이상 상태 발생 에 대한 알림을 제어할 수 있다. 냉장고는 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수있다. 냉장고는 제어 장치에 이상 상태 발생에 대한 알림을 껐다는 정보를 전송할 수 있다. 제어 장 치는 디스플레이에 이상 상태 발생에 대한 알림을 껐다는 정보를 표시할 수 있다. 도 17의 1704를 참조하여, 냉장고의 이상 모드에서 알림을 켜는 동작을 설명한다. 제어 장치는 적어도 하나의 키를 통해 사용자의 입력을 다시 수신할 수 있다. 제어 장치는 적어 도 하나의 키에 대한 제어 신호를 생성할 수 있다. 제어 장치는 적어도 하나의 키에 대한 제어 신호를 냉장고에 전송할 수 있다. 냉장고는 제어 장치로부터 적어도 하나의 키에 대한 제어 신호를 수신할 수 있다. 냉장고 는 이상 모드에서 제어 장치로부터 적어도 하나의 키에 대한 제어 신호를 수신하면, 이상 상태 발생 에 대한 알림을 제어할 수 있다. 냉장고는 현재 이상 상태 발생에 대한 알림이 꺼져있다고 식별한 경우, 이상 상태 발생에 대한 알림을 키도록 음향 출력부를 제어할 수 있다. 이와 달리, 냉장고는 현재 이상 상 태 발생에 대한 알림이 켜져있다고 식별한 경우, 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 다시 제 어할 수도 있다. 냉장고는 제어 장치에 이상 상태 발생에 대한 알림을 켰다는 정보를 전송할 수 있다. 제어 장 치는 디스플레이에 이상 상태 발생에 대한 알림을 켰다는 정보를 표시할 수 있다. 도 18은 본 개시의 일 실시예에 따른 냉장고, 기기 관리 서버, 및 단말기의 동작을 설명하기 위한 흐름도이다. 도 19는 본 개시의 일 실시예에 따른 냉장고의 동작에 따른 단말기의 동작을 설명하기 위한 도면이다. 도 18을 참조하면, 동작 1810에서, 냉장고는 냉장고의 이상 상태 발생 여부를 식별할 수 있다. 동작 1810 은 도 4의 동작 410 또는 도 12의 동작 1210에 대응할 수 있다. 동작 1820에서, 냉장고는 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고의 이상 상태 발 생에 대한 알림을 출력할 수 있다. 동작 1820는 도 4의 동작 420 또는 도 12의 동작 1220에 대응할 수 있다. 동작 1830에서, 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 기기 관리 서버에 전송할 수 있다. 냉장고는 이상 상태 발생에 대한 알림을 기기 관리 서버에 전송하도록 통신 모듈을 제어 할 수 있다. 기기 관리 서버는 냉장고로부터 냉장고의 이상 상태 발생에 대한 알림을 수신할 수 있다. 동작 1840에서, 기기 관리 서버는 단말기에 냉장고의 이상 상태 발생에 대한 알림을 전송할 수 있다. 단말기는 기기 관리 서버로부터 냉장고의 이상 상태 발생에 대한 알림을 수신할 수 있다. 동작 1850에서, 단말기는 냉장고의 이상 상태 발생에 대한 알림을 표시할 수 있다. 단말기는 단말기에 설치된 기기 관리 애플리케이션을 통해서 기기 관리 서버와 정보를 송수신할 수 있다. 사용자가 단말기에서 사용자의 기기를 관리하기 위한 애플리케이션을 실행하는 경우, 단말기 는 기기 관리 서버로부터 냉장고의 이상 상태 발생에 대한 알림을 수신하여, 냉장고의 이 상 상태 발생에 대한 알림 화면을 애플리케이션 실행 창에 표시할 수 있다. 예컨대, 도 19를 참조하면, 단말기는 기기 관리 서버를 통해 냉장고로부터 냉장고의 이상 상태 발생에 대한 알림을 수신할 수 있다. 단말기는 냉장고의 이상 상태 발생에 대한 알림 화 면을 애플리케이션 실행 창에 표시할 수 있다. 단말기는 냉장고의 이상 상태 발생에 대한 알림 을 제어할 수 있다는 정보를 표시할 수 있다. 동작 1860에서, 단말기는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 사용자의 입력을 수신할 수 있다. 단말기는 냉장고의 이상 상태 발생에 대한 알림을 제어하는 아이콘을 표시할 수 있다. 아이콘은 좌우 스크롤 형태로 구현되며, 좌측 스크롤로 이동되는 경우 단말기는 알림을 끄 기 위한 제어 명령을 생성하고, 우측 스크롤로 이동되는 경우 단말기는 알림을 켜기 위한 제어 명령을 생 성할 수 있다. 사용자는 아이콘을 좌측 또는 우측으로 이동시킴으로써, 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어할 수 있다. 동작 1870에서, 단말기는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명령을 기 기 관리 서버에 전송할 수 있다. 기기 관리 서버는 냉장고의 이상 상태 발생에 대한 알림을 끄 거나 켜기 위한 제어 명령을 단말기로부터 수신할 수 있다. 동작 1880에서, 기기 관리 서버는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명 령을 냉장고에 전송할 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명령을 기기 관리 서버로부터 수신할 수 있다. 예컨대, 도 19를 참조하면, 냉장고는 기기 관리 서버를 통해 단말기로부터 알림을 끄거나 켜기 위한 제어 명령을 수신할 수 있다. 동작 1890에서, 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명령에 기 초하여, 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어할 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 끄기 위한 제어 명령을 수신하면, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 음향 출력부는 이상 상태 발생 에 대한 알림을 출력하지 않을 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 켜기 위한 제어 명령을 수신하면, 냉장고의 이상 상태 발생에 대한 알림을 켜도록 음향 출력부를 제어할 수 있다. 음향 출력부는 이상 상태 발생 에 대한 알림을 출력할 수 있다. 도 20은 본 개시의 일 실시예에 따른 냉장고, 기기 관리 서버, 및 서비스 센터의 동작을 설명하기 위한 흐름도 이다. 도 20을 참조하면, 동작 2005에서, 냉장고는 냉장고의 이상 상태 발생 여부를 식별할 수 있다. 동작 2010 은 도 4의 동작 410 또는 도 12의 동작 1210에 대응할 수 있다. 동작 2010에서, 냉장고는 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고의 이상 상태 발 생에 대한 알림을 출력할 수 있다. 동작 2020는 도 4의 동작 420 또는 도 12의 동작 1220에 대응할 수 있다. 동작 2015에서, 냉장고는 적어도 하나의 키에 대한 사용자의 입력에 따라, 냉장고의 이상 상태 발생 에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 동작 2015는 도 4의 동작 430 또는 도 12의 동작 1240에 대응할 수 있다. 동작 2020에서, 냉장고는 냉장고의 이상 상태 발생에 대한 알림 해제 이력을 기기 관리 서버에 전송할 수 있다. 냉장고는 이상 상태 발생에 대한 알림 해제 이력을 기기 관리 서버에 전송하도록 통 신 모듈을 제어할 수 있다. 기기 관리 서버는 냉장고로부터 이상 상태 발생에 대한 알림 해제 이력을 수신할 수 있다. 본 개시의 일 실시예에서, 냉장고는 냉장고의 이상 상태에 대한 원인을 기기 관리 서버 및 서비 스 센터로 전송할 수도 있다. 예를 들어, 냉장고는 냉장고에 저장된 정보의 이상으로 인한 냉장 고의 고장인 지, 도어 열림 상태인 지, 도어 스위치의 고장인 지 여부를 기기 관리 서버 및 서비스 센터로 전송할 수 있다. 동작 2025에서, 기기 관리 서버는 서비스 센터에 이상 상태 발생에 대한 알림 해제 이력을 전송할 수 있다. 서비스 센터는 기기 관리 서버로부터 이상 상태 발생에 대한 알림 해제 이력을 수신할 수 있다. 동작 2030에서, 서비스 센터는 알림 해제 이력을 저장할 수 있다. 서비스 센터는 기기 관리 서버 를 통해 냉장고로부터 이상 상태 발생에 대한 알림 해제 이력을 수신할 수 있다. 서비스 센터의 PC를 모니터링하는 서비스 기사는 냉장고의 이상 상태 발생에 대한 알림 해제 이력을 확인할 수 있다. 냉장고는 이상 상태 발생에 대한 알림을 끈 경우, 기기 관리 서버를 통해 서비스 센터에 이상 상태 발생에 대한 알림이 꺼졌다는 정보를 전송할 수 있다. 냉장고는 알림이 사용자의 제어에 의해 꺼지더 라도 냉장고의 이상 상태에 대한 수리가 누락되지 않기 위해, 서비스 센터에 해당 정보를 전송할 수 있다. 동작 2035에서, 서비스 센터는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 사용자의 입력을 수신할 수 있다. 서비스 센터는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명령을 생성할 수 있다. 여기서, 서비스 센터의 사용자는 서비스 기사일 수 있다. 동작 2040에서, 서비스 센터는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명령 을 기기 관리 서버에 전송할 수 있다, 기기 관리 서버는 냉장고의 이상 상태 발생에 대한 알림 을 끄거나 켜기 위한 제어 명령을 서비스 센터로부터 수신할 수 있다. 동작 2045에서, 기기 관리 서버는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명 령을 냉장고에 전송할 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명령을 기기 관리 서버로부터 수신할 수 있다. 동작 2050에서, 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜기 위한 제어 명령에 기 초하여, 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어할 수 있다. 서비스 기사는 원격으로 냉장고의 이상 상태 발생에 대한 알림을 끄거나 켜도록 제어할 수 있다. 이에 따 라, 냉장고의 사용자가 냉장고의 이상 상태 발생에 대한 알림을 제어하지 못하더라도, 서비스 기사가 원격으로 이상 상태 발생에 대한 알림을 제어할 수 있다. 이에 따라, 냉장고의 사용자의 편의성을 향상시 킬 수 있다. 도 21은 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 제어하고, 이상 상태를 복구하기 위한 방법을 나타낸 흐름도이다. 도 21을 참조하면, 동작 2110에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태 발생 여부를 식별할 수 있다. 동작 2110은 도 4의 동작 410 또는 도 12의 동작 1210에 대응할 수 있다. 예를 들어, 냉장고의 이상 상태는 냉장고의 기능에 존재하는 고장과 같이 서비스 기사에 의한 수리가 필요한 고장을 나타낼 수 있다. 또한, 냉장고의 이상 상태는 냉장고의 도어를 일정 시간 이상 열어둔 경우의 도어 열림 상태를 나타낼 수도 있다. 또한, 냉장고의 이상 상태는 냉장고의 도어 스위치의 고 장과 같이 서비스 기사에 의한 수리가 필요한 고장을 나타낼 수도 있다. 또는, 냉장고의 이상 상태는 상술한 상황 이외에 복구 가능한 고장을 더 포함할 수 있다. 냉장고는 냉장고가 복구 가능한 고장이 존재하는 지 식별할 수 있다. 냉장고에 복구 가능한 고장이 발생하는 경우, 냉장고는 이상 상태가 발생한 것으로 판단할 수 있다. 냉장고는 이상 모드에 따라 동작할 수 있다. 예컨대, 복구 가능한 고장은, 저장실의 이상 온도 에러, 제빙기의 이빙 동작 에러 등 서비스 기사에 의한 수리 가 필요하지 않은 고장을 의미할 수 있다. 동작 2120에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고의 이상 상태가 발생한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력할 수 있다. 동작 2120는 도 4의 동작 420 또는 도 12의 동작 1220에 대응할 수 있다. 냉장고는 복구 가능한 고장이 발생한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력할 수 있다. 동작 2130에서, 본 개시의 일 실시예에 따른 냉장고는 기 정의된 동작에 매핑된 적어도 하나의 키에 대한 사용자의 입력에 따라, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 음향 출력부를 제어할 수 있 다. 동작 2130는 도 4의 동작 430 또는 도 12의 동작 1240에 대응할 수 있다. 동작 2140에서, 본 개시의 일 실시예에 따른 냉장고는 냉장고에 발생한 이상 상태의 원인을 식별하여, 이상 상태를 복구할 수 있다. 냉장고는 냉장고의 이상 상태 발생에 대한 알림을 끄는 사용자의 입력을 수신함에 따라, 고장의 원인 에 대응하여 자동으로 고장 복구 동작을 수행할 수 있다. 일 실시예에서, 냉장고의 변온실은 사용자가 설정한 온도 범위 내에 있어야하며, 설정한 온도 범위를 벗어 나는 경우 변온실의 이상 온도에 에러가 있다고 알릴 수 있다. 냉장고는 변온실의 이상 온도 에러에 기초 하여, 이상 상태 발생에 대한 알림을 음향 출력부에 출력할 수 있다. 또한, 냉장고는 변온실의 이상 온도 에러에 기초하여, 이상 상태 발생에 대한 알림을 디스플레이에 출력할 수 있다. 냉장고는 적어도 하나의 키에 대한 사용자의 입력에 따라, 변온실의 이상 온도 에러에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 냉장고는 적어도 하나의 키에 대한 사용자의 입력에 따라, 자동으로 변온실의 이상 온도 에러를 복구할 수 있다. 예를 들어, 냉장고는 변온실의 온도를 사용자가 설정한 온도 범위 내에 존재하도록 온도를 리셋 (reset)시킬 수 있다. 따라서, 냉장고는 적어도 하나의 키에 대한 사용자의 입력에 따라, 변온실의 이상 온도 에러에 대한 알림 을 끄고, 변온실의 이상 온도 에러를 복구할 수 있다. 또는 일 실시예에서, 냉장고의 제빙기는 얼음을 얼리는 제빙 동작과 얼음을 분리시켜 저장 공간에 얼음을 저장하는 이빙 동작을 수행할 수 있다. 냉장고는 제빙기가 이빙 동작을 수행하지 않는 경우, 제빙기의 이 빙 동작에 에러가 있다고 알릴 수 있다. 냉장고는 제빙기의 이빙 동작 에러에 기초하여, 이상 상태 발생에 대한 알림을 음향 출력부에 출력할 수 있다. 또한, 냉장고는 제빙기의 이빙 동작 에러에 기초하여, 이상 상태 발생에 대한 알림을 디스플레이에 출력할 수 있다. 냉장고는 적어도 하나의 키에 대한 사용자의 입력에 따라, 제빙기의 이빙 동작 에러에 대한 알림을 끄도록 음향 출력부를 제어할 수 있다. 냉장고는 적어도 하나의 키에 대한 사용자의 입력에 따라, 자동으로 제빙기의 이빙 동작 에러를 복구할 수 있다. 예를 들어, 냉장고는 제빙기의 제빙 동작을 중단하고, 이빙 동작을 복구하는 동작을 수행할 수 있다. 따라서, 냉장고는 적어도 하나의 키에 대한 사용자의 입력에 따라, 제빙기의 이빙 동작 에러에 대한 알림을 끄고, 제빙기의 이빙 동작 에러를 복구할 수 있다. 본 개시의 일 실시예에 따른 냉장고는 사용자의 제어에 의해 이상 상태 발생에 대한 알림을 끄거나 킬 수 있으므로, 사용자가 청각적 소음에 노출되는 불편함을 최소화할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 냉장고의 이상 상태가 발생하지 않은 것에 기초하여, 적어도 하나의 키에 대한 사용자의 입력에 따라 기 정의된 동작을 수행할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 메모리에 저장 된 냉장고에 대한 정보를 식별할 수 있다. 적어도 하나의 프로세서는 냉장고에 대한 정보에 이 상이 존재한다고 판단한 것에 기초하여, 냉장고에 이상 상태가 발생한 것으로 판단할 수 있다. 일 실시예에서, 냉장고에 대한 정보는, 냉장고의 기능에 따라서 냉장고를 구동시키는 프로그램 을 결정하기 위한 정보를 포함할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 식별된 냉장고(10 0)에 대한 정보가 제1 상태 정보 또는 제2 상태 정보이거나, 메모리의 복수의 저장 공간 중 적어도 하나의 저장 공간에서 식별된 냉장고에 대한 정보가 복수의 저장 공간 중 나머지 저장 공간에서 식별된 냉장고 에 대한 정보와 상이한 것에 기초하여, 냉장고에 대한 정보에 이상이 존재한다고 판단할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 도어가 기 설 정된 시간 이상 개방되어 있는 것에 기초하여, 냉장고에 이상 상태가 발생한 것으로 판단할 수 있다. 도어 는 적어도 하나의 도어를 포함할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 냉장고의 이상 상태 발생에 대한 알림을 끄기 위한 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간을 식별할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 2n초 미만인 경우, 냉장고의 이상 상태 발생에 대한 알림을 정해진 시간동안 끄고, 정해진 시간이 지나면 출력하도록 출력 인터페이스를 제어할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 키에 대한 사용자의 입력이 유지되는 시간이 2n초 이상인 경우, 냉장고의 이상 상태 발생에 대한 알림이 꺼진 상태가 제1 상황이 발생하기 전까지 유지되도록 출력 인터페이스를 제어할 수 있다. 제1 상황은, 냉장고 의 이상 상태 발생에 대한 알림이 꺼진 상태에서 적어도 하나의 키에 대한 사용자의 입력을 획득한 상황또는 냉장고의 이상 상태가 해결된 상황에 해당할 수 있다. 일 실시예에서, 사용자 인터페이스는, 기 정의된 동작에 매핑되지 않은 더미 키(dummy key)를 더 포함할 수 있다. 일 실시예에서. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 냉장고 의 이상 상태가 발생한 것에 기초하여, 더미 키가 냉장고의 이상 상태 발생에 대한 알림을 제어할 수 있다는 정보를 출력하도록 디스플레이를 제어할 수 있다. 적어도 하나의 프로세서는 더미 키에 대한 사용자의 입력에 따라, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 인스 트럭션을 실행함으로써, 냉장고의 이상 상태 발생에 대한 알림을 외부 장치로 전송하도록 통신 모듈 을 제어할 수 있다. 적어도 하나의 프로세서는 외부 장치로부터 냉장고의 이상 상태 발생에 대한 알 림을 끄기 위한 제어 명령을 수신하도록 통신 모듈을 제어할 수 있다. 외부 장치는 제어 장치, 기기 관리 서버, 단말기, 서비스 센터 등을 포함할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 냉장고의 이상 상태 발생에 대한 알림 해제 이력을 외부 장치로 전송하도록 통신 모듈을 제어할 수 있다. 일 실시예에서, 냉장고의 동작 방법은 냉장고의 이상 상태 발생 여부를 식별하는 단계, 냉장고 의 이상 상태가 발생한 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림을 출력하도록 출력 인터페이 스를 제어하는 단계, 및 기 정의된 동작에 매핑(mapping)된 적어도 하나의 키(key)에 대한 사용자의 입력 에 따라, 냉장고의 이상 상태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어하는 단계를 포함한 다. 일 실시예에서, 냉장고의 동작 방법은 냉장고의 이상 상태 발생에 대한 알림이 꺼진 것에 기초하여, 냉장고의 이상 상태 발생에 대한 알림이 꺼져있음을 나타내는 정보를 출력하도록 디스플레이를 제어 하는 단계를 더 포함할 수 있다. 일 실시예에서, 냉장고의 동작 방법은 냉장고의 이상 상태가 발생하지 않은 것에 기초하여, 적어도 하나의 키에 대한 사용자의 입력에 따라 기 정의된 동작을 수행하는 단계를 더 포함할 수 있다. 일 실시예에서, 냉장고의 이상 상태 발생 여부를 식별하는 단계는, 냉장고의 메모리에 저장된 냉장고에 대한 정보를 식별하는 단계, 및 냉장고에 대한 정보에 이상이 존재한다고 판단한 것에 기초 하여, 냉장고에 이상 상태가 발생한 것으로 판단하는 단계를 더 포함할 수 있다. 일 실시예에서, 냉장고의 동작 방법은 냉장고에 포함된 적어도 하나의 도어가 기 설정된 시간 이상 개방되어 있는 것에 기초하여, 냉장고에 이상 상태가 발생한 것으로 판단하는 단계를 더 포함할 수 있다. 일 실시예에서, 냉장고의 동작 방법은 냉장고의 이상 상태가 발생한 것에 기초하여, 정의된 동작에 매핑되지 않은 더미 키(dummy key)가 냉장고의 이상 상태 발생에 대한 알림을 제어할 수 있다는 정보를 출 력하도록 디스플레이를 제어하는 단계, 및 더미 키에 대한 사용자의 입력에 따라, 냉장고의 이상 상 태 발생에 대한 알림을 끄도록 출력 인터페이스를 제어하는 단계를 더 포함할 수 있다. 일 실시예에서, 냉장고의 동작 방법은 냉장고의 이상 상태 발생에 대한 알림 해제 이력을 외부 장치 로 전송하도록 통신 모듈을 제어하는 단계를 더 포함할 수 있다. 일 실시예에서, 상술한 냉장고의 동작 방법은 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체에 저장될 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비 일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미 할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하 지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운 로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다."}
{"patent_id": "10-2023-0108543", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 냉장고의 이상 상태 발생에 대한 알림을 제어하기 위한 동작을 설명하기 위 한 도면이다. 도 2는 본 개시의 일 실시예에 따른 냉장고의 구성을 나타낸 개략 블록도이다. 도 3은 본 개시의 일 실시예에 따른 냉장고의 구성을 나타낸 상세 블록도이다. 도 4는 본 개시의 일 실시예에 따른 냉장고의 제어 방법을 나타낸 흐름도이다. 도 5는 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 제어하기 위한 방법을 나타낸 흐름 도이다. 도 6은 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 단일 키(single key)로 제어하기 위한 방법을 나타낸 흐름도이다. 도 7은 본 개시의 일 실시예에 따른 냉장고가 정상인 경우 수행하는 동작을 설명하기 위한 도면이다. 도 8a는 본 개시의 일 실시예에 따른 냉장고에서 이상 상태가 발생한 경우 알림을 출력하는 동작을 설명하기 위 한 도면이다. 도 8b는 본 개시의 일 실시예에 따른 냉장고에서 출력한 알림을 끄기 위한 동작을 설명하기 위한 도면이다. 도 8c는 본 개시의 일 실시예에 따른 냉장고에서 출력한 알림을 켜기 위한 동작을 설명하기 위한 도면이다. 도 9는 본 개시의 일 실시예에 따른 냉장고의 디스플레이 및 사용자 인터페이스를 나타내는 예시 도면이다. 도 10은 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 제어하기 위한 방법을 나타낸 흐 름도이다. 도 11a는 본 개시의 일 실시예에 따른 냉장고에서 이상 상태가 발생한 경우 알림을 출력하는 동작을 설명하기 위한 도면이다. 도 11b는 본 개시의 일 실시예에 따른 냉장고에서 출력한 알림을 끄기 위한 동작을 설명하기 위한 도면이다.도 12는 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 제어하기 위한 방법을 나타낸 흐 름도이다. 도 13a는 본 개시의 일 실시예에 따른 냉장고가 이상 상태가 발생한 경우 알림을 출력하고, 알림을 제어할 수 있다는 정보를 표시하는 동작을 설명하기 위한 도면이다. 도 13b는 본 개시의 일 실시예에 따른 냉장고에서 출력한 알림을 끄기 위한 동작을 설명하기 위한 도면이다. 도 14는 본 개시의 일 실시예에 따른 냉장고가 알림을 제어할 수 있다는 정보를 표시하는 동작을 설명하기 위한 도면이다. 도 15는 본 개시의 일 실시예에 따른 냉장고가 알림을 제어하는 키에 대한 입력을 유지하는 시간에 따라, 알림 을 제어하기 위한 방법을 나타낸 흐름도이다. 도 16은 본 개시의 일 실시예에 따른 냉장고, 제어 장치, 기기 관리 서버, 단말기, 및 서비스 센터를 나타낸 도 면이다. 도 17은 본 개시의 일 실시예에 따른 냉장고와 제어 장치의 동작을 설명하기 위한 도면이다. 도 18은 본 개시의 일 실시예에 따른 냉장고, 기기 관리 서버, 및 단말기의 동작을 설명하기 위한 흐름도이다. 도 19는 본 개시의 일 실시예에 따른 냉장고의 동작에 따른 단말기의 동작을 설명하기 위한 도면이다. 도 20은 본 개시의 일 실시예에 따른 냉장고, 기기 관리 서버, 및 서비스 센터의 동작을 설명하기 위한 흐름도 이다. 도 21은 본 개시의 일 실시예에 따른 냉장고가 이상 상태 발생에 대한 알림을 제어하고, 이상 상태를 복구하기 위한 방법을 나타낸 흐름도이다."}
