{"patent_id": "10-2016-0155614", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0057793", "출원번호": "10-2016-0155614", "발명의 명칭": "샘플수 분석장치 및 방법", "출원인": "(주) 테크로스", "발명자": "박규원"}}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "샘플수가 수용되는 챔버;상기 챔버 내의 샘플수를 촬영하는 촬상부; 및상기 촬상부를 통해 연속 촬영된 영상들을 분석하는 제어부;를 포함하되,상기 제어부는,생물 종류별로 복수의 화상 이미지를 입력받아 기계학습을 통해 학습데이터를 생성하고,상기 연속 촬영된 영상들을 비교하여 이동영역을 획득하고,상기 학습데이터와 상기 이동영역을 비교하여 상기 이동영역 내에 생존한 생물 종류를 판단하도록 구성되는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 생물은, 동물성 플랑크톤의 한 종류인, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 제어부는,상기 학습데이터와 상기 이동영역을 비교하여 판단된 동물성 플랑크톤 종류의 정확도가 20% 이상일 경우, 판단된 동물성 플랑크톤의 종류가 맞다고 인식하는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 샘플수 분석장치는,촬영된 상기 영상을 보여주는 디스플레이부를 더 포함하되,상기 디스플레이부는,맞다고 인식된 상기 동물성 플랑크톤의 종류가 추가로 표시되는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서, 상기 디스플레이부는,맞다고 인식된 상기 동물성 플랑크톤의 크기가 추가로 표시되는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서,상기 디스플레이부는,공개특허 10-2018-0057793-3-맞다고 인식된 상기 동물성 플랑크톤의 크기가 50㎛이상인지 여부를 표시하는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 동물성 플랑크톤의 크기는,상기 이동영역의 가로 및 세로의 화소수와 화소당 실제 크기를 근거로 산출되는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 촬상부는,1초에 한 프레임(frame) 이상의 영상을 연속적으로 촬영하는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 이동영역은,연속된 2개의 프레임들의 차이를 근거로 획득되는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 화상 이미지는,생물 종류별로 분류가 되도록 저장 폴더가 구분되거나, 파일이름이 구분되거나, 파일이름과 대응되는 생물 종류를 매핑시키는 매핑정보가 제공되는, 샘플수 분석장치."}
{"patent_id": "10-2016-0155614", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "생물 종류별로 복수의 화상 이미지를 입력받아 기계학습을 통해 학습데이터를 생성하는 단계;샘플수를 연속 촬영하고, 상기 연속 촬영된 영상들을 비교하여 이동영역을 획득하는 단계; 및상기 학습데이터와 상기 이동영역을 비교하여 상기 이동영역 내에 생존한 생물 종류를 판단하는 단계;를 포함하는, 샘플수 분석방법."}
{"patent_id": "10-2016-0155614", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 샘플수 분석장치에 관한 것으로, 샘플수가 수용되는 챔버; 상기 챔버 내의 샘플수를 촬영하는 촬상부; 및 상기 촬상부를 통해 연속 촬영된 영상들을 분석하는 제어부;를 포함하되, 상기 제어부는, 생물 종류별로 복수 의 화상 이미지를 입력받아 기계학습을 통해 학습데이터를 생성하고, 상기 연속 촬영된 영상들을 비교하여 이동 영역을 획득하고, 상기 학습데이터와 상기 이동영역을 비교하여 상기 이동영역 내에 생존한 생물 종류를 판단하 도록 구성됨으로써, 인공지능 이미지 인식을 통해 높은 정확도의 분석결과를 제공하는 효과가 있다."}
{"patent_id": "10-2016-0155614", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 샘플수 분석장치 및 방법에 관한 것이다. 보다 상세하게는 선박평형수 처리장치에 적용가능하도록 수 중생물을 정확하게 분석할 수 있도록 하는 샘플수 분석장치 및 방법에 관한 것이다."}
{"patent_id": "10-2016-0155614", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 선박평형수 또는 밸러스트수(Ballast Water)는 선박으로부터 화물을 하역시킨 상태 또는 선박에 적 재된 화물량이 매우 적은 상태에서 선박을 운행할 경우, 선박이 균형을 유지할 수 있도록 선박에 설치된 밸러스 트탱크에 채우는 해수를 말하는 것이다. 이러한 선박평형수에는 각종 수중생물이 서식하고 있으므로, 이를 아무런 처리없이 타지역에서 배출시킬 경우 심각한 해양오염 및 생태계 파괴를 유발시킬 우려가 높게 된다. 이에 따라 국제해사기구(IMO: International Maritime Organization)에서는 국제협약을 체결하여 선박평형수의 살균 및 정화처리에 필요한 장치를 선박에 탑재토록 하였다. 선박에 탑재된 선박평형수 처리장치는, 국제해사기구(IMO)의 기준에 맞추어 육상시험 및 선상시험을 거쳐 인증 서를 받은 다음 운항하여야 하기 때문에 선박평형수 처리장치에 의하여 처리된 평형수가 국제해사기구에서 규정 한 배출기준에 적합한 것인지를 모니터링하는 시스템이 필요하게 된다. 그러나, 선박평형수 처리장치의 기준 만족여부를 판단하기 위한 생물생사판별 측정이나 생물 계수시 영상분석 장치의 화면에 표시된 물체의 움직임(Mobility)만으로 판단하였기 때문에 생물이 아닌 물체(예를 들면, 부유 물)도 생물로 혼돈되어 측정되어 정확도가 떨어지는 문제점이 있었다."}
{"patent_id": "10-2016-0155614", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위해 안출된 것으로, 특히 수중생물을 보다 정확하게 판단할 수 있는 샘플수 분석장치 및 방법을 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2016-0155614", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해 안출된 본 발명의 일관점에 따른 샘플수 분석장치는, 샘플수가 수용되는 챔버; 상기 챔버 내의 샘플수를 촬영하는 촬상부; 및 상기 촬상부를 통해 연속 촬영된 영상들을 분석하는 제어부;를 포함하 되, 상기 제어부는, 생물 종류별로 복수의 화상 이미지를 입력받아 기계학습을 통해 학습데이터를 생성하고, 상 기 연속 촬영된 영상들을 비교하여 이동영역을 획득하고, 상기 학습데이터와 상기 이동영역을 비교하여 상기 이 동영역 내에 생존한 생물 종류를 판단하도록 구성된다. 여기서, 상기 생물은, 동물성 플랑크톤의 한 종류일 수 있다. 또한, 상기 제어부는, 상기 학습데이터와 상기 이동영역을 비교하여 판단된 동물성 플랑크톤 종류의 정확도가 20% 이상일 경우, 판단된 동물성 플랑크톤의 종류가 맞다고 인식하도록 구성할 수 있다. 한편, 본 발명의 일실시예에 따른 샘플수 분석장치는, 촬영된 상기 영상을 보여주는 디스플레이부를 더 포함하 되, 상기 디스플레이부는, 맞다고 인식된 상기 동물성 플랑크톤의 종류가 추가로 표시될 수 있다. 여기서, 상기 디스플레이부는, 맞다고 인식된 상기 동물성 플랑크톤의 크기가 추가로 표시될 수 있다. 또한, 상기 디스플레이부는, 맞다고 인식된 상기 동물성 플랑크톤의 크기가 50㎛이상인지 여부를 표시할 수도 있다. 본 발명의 일실시예에서, 상기 동물성 플랑크톤의 크기는, 상기 이동영역의 가로 및 세로의 화소수와 화소당 실 제 크기를 근거로 산출될 수 있다. 본 발명의 일실시예에서, 상기 촬상부는, 1초에 한 프레임(frame) 이상의 영상을 연속적으로 촬영할 수 있다. 또한, 상기 이동영역은, 연속된 2개의 프레임들의 차이를 근거로 획득될 수 있다. 상기 화상 이미지는, 생물 종류별로 분류가 되도록 저장 폴더가 구분되거나, 파일이름이 구분되거나, 파일이름 과 대응되는 생물 종류를 매핑시키는 매핑정보가 제공될 수 있다. 한편, 본 발명의 다른 관점에 따른 샘플수 분석방법은, 생물 종류별로 복수의 화상 이미지를 입력받아 기계학습 을 통해 학습데이터를 생성하는 단계; 샘플수를 연속 촬영하고, 상기 연속 촬영된 영상들을 비교하여 이동영역 을 획득하는 단계; 및 상기 학습데이터와 상기 이동영역을 비교하여 상기 이동영역 내에 생존한 생물 종류를 판 단하는 단계;를 포함한다."}
{"patent_id": "10-2016-0155614", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면 수중의 부유물과 생물을 정확하게 구분하여 보다 정확하게 수중생물의 생사판별을 하고, 살균 처리 유무를 검사할 수 있도록 하는 효과가 있다. 또한, 본 발명에 의하면 수중생물의 종류뿐만 아니라 크기정보를 정확하게 획득함으로써 보다 다양하게 수중생 물정보를 제공하는 효과가 있다."}
{"patent_id": "10-2016-0155614", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부된 도면들을 참조하여 상세히 설명한다. 우선 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동 일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기 능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 이하에서 본 발명의 바람직한 실시예를 설명할 것이나, 본 발명의 기술적 사상은 이에 한정하거나 제한되 지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있음은 물론이다. 도 1은 본 발명의 일실시예에 따른 샘플수 분석장치를 도시한 구성도이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 샘플수 분석장치는, 수중생물 포함된 샘플수가 수용되는 챔버와, 챔버 내의 샘플 수를 촬영하는 촬상부와, 촬상부에서 촬영된 영상을 처리하는 제어부를 포함한다. 여기서, 챔버 내의 샘플수는, 수중의 생물을 분석할 필요가 있는 다양한 분야에서 샘플링되어 샘플수 내에 포함된 수중생물이 분석될 수 있다. 일례로, 선박평형수는 밸러스팅(ballasting)시에 전기분해 또는 화학약품 투입 등 다양한 방식으로 처리된 다음, 밸러스트 탱크로 유입되어 저장되었다가 디밸러스팅(deballasting)시 배출배관을 통해 선박 밖으로 배출 되는데, 배출되는 선박평형수는 국제해사기구에서 규정한 배출기준에 적합한 것인지를 판단하여야 하기 때문에, 배출되는 선박평형수를 샘플링하여 선박평형수 내에 존재하는 수중생물의 종류, 생사판별 등의 분석작업을 하게 된다. 다른 실시예로, 정수장에서 살균처리된 정수를 샘플링하여 본 발명의 샘플수 분석장치를 통해 분석할 수도 있다. 챔버는, 분석할 샘플수가 수용되어 분석시간 동안 계류될 수 있도록 구성된다. 여기서, 챔버는 유입 및 유출되는 유입부(미도시) 및 유출부(미도시)를 구비하여 샘플수가 유입 및 유출되도록 구성할 수도 있고, 유 입부(미도시) 및 유출부(미도시)를 구비하지 않는 그릇 등의 형태로 구성되어 실험자가 수작업으로 물을 담아서 사용할 수도 있다. 촬상부는, 챔버의 샘플수 내에 포함된 수중생물을 촬영하도록 챔버의 상측 또는 하측 방향, 측 면 방향에 설치될 수 있다. 여기서, 촬상부는 상하 또는 좌우로 이동이 가능하도록 구동부(미도시)를 포함하여 챔버와의 이격거 리를 측정환경에 맞게 조절할 수 있도록 한다. 제어부는, 촬상부를 통해 촬영된 영상들을 분석하는 장치이다. 본 발명의 제어부는, 특히 기계학습을 통해 학습데이터를 생성하고 학습데이터와, 촬상부에서 촬영된 영상을 비교하여 수중 생물을 분석할 수 있도록 구성된다. 이를 위해, 제어부는, 도 2에 도시된 본 발명의 일실시예에 따른 샘플수 분석장치에 입력되는 동물성 플랑 크톤의 학습이미지들과 같은 복수의 화상이미지들을 사전에 입력받아 학습하는 과정을 거쳐 학습데이터를 생성 하여야 한다. 이때, 학습이미지는, 동물성 플랑크톤의 종류별로 분류가 되도록 라벨링(Labeling)될 수 있다. 라벨링의 일실시예로서, 동물성 플랑크톤 종류별로 분류가 되도록 학습이미지의 저장폴더가 동물성 플랑크톤 종류별로 구분되도록 하거나, 학습이미지의 파일이름의 일부가 동물성 플랑크톤의 종류명이 되도록 설정하여 분류할 수 있다. 제어부는 프로그램된 기계학습에 의해 학습이미지가 저장된 경로에 서 복수개의 학습이미지들을 읽어서 동물성 플랑크톤의 종류를 구분하는 학습을 수행하게 된다. 라벨링의 다른 실시예로서, 파일이름과 대응되는 동물성 플랑크톤 종류를 각각 매핑시키는 매핑정보를 제공할 수도 있다. 예를 들면, 텍스트 파일 등에 파일이름과 각각의 라벨(대응되는 동물성 플랑크톤 종류명)을 한줄씩 입력한 매핑정보를 생성하고, 매핑정보를 사용하여 종류에 맞는 학습이미지들을 획득하도록 구성할 수 있다. 본 발명의 도 2에서는 동물성 플랑크톤의 종류별로 9개의 학습이미지들을 사용하였지만, 더욱 정확한 분석 을 위해서는 더 많은 양의 학습이미지를 학습시킬 필요가 있다. 여기서, 학습이미지들은 상호간에 유사도가 떨어지는 것들을 사용하면 더욱 적은 양의 학습이미지를 사용할 수 있다. 예를 들면, 같은 종류의 동물성 플랑크톤 사진이지만, 크기나 형태를 다양하도록 하는 것이 기 계학습 효과를 향상시킬 수 있게 된다. 제어부은, 이와 같이 학습이미지를 통해 기계학습을 수행하여 학습데이터를 생성하고, 촬상부에 서 촬영된 영상과 비교하여 수중생물을 분석하게 된다. 이때, 제어부는, 촬상부에서 샘플수를 연속으로 촬영한 영상들을 비교하여 이동영역을 획득한다. 본 발명의 일실시예에서 촬상부는, 1초에 한 프레임(frame) 이상의 영상을 연속적으로 촬영한다. 이를 통 해 보다 신뢰성 높은 영상데이터들을 확보하여 수중생물의 분석을 정확하게 진행할 수 있게 된다. 제어부에서는, 움직임이 감지된 영역인 이동영역을 연속촬영된 영상에서 추출하여 기계학습을 통해 기생성 된 학습데이터와 비교하는데, 이때 이동영역은, 연속된 2개의 프레임들의 차이를 근거로 획득될 수 있다. 이와 같이 연속된 프레임간의 차이로 이동영역을 추출함으로써 분석 오류를 줄일 수 있게 된다. 여기서, 제어부는, 학습데이터와 이동영역을 비교하여 이동영역 내에 생존한 동물성 플랑크톤의 종류를 판 단하게 되는데, 판단된 결과가 참인지 거짓인지 여부는 분석결과의 정확도를 기준으로 판단한다. 즉, 판단된 동 물성 플랑크톤 종류의 정확도가 소정의 임계값 이상일 경우, 판단된 동물성 플랑크톤의 종류가 맞다고 인식하도 록 구성할 수 있다. 본 발명의 실시예에서는, 다수회의 실험결과 정확도가 20% 이상일 경우, 판단결과가 맞을 확률이 매우 높기 때문에 20% 이상일 때 판단결과가 맞다고 인식한다. 한편, 본 발명의 일실시예에 따른 샘플수 분석장치는, 촬영된 영상을 보여주는 디스플레이부를 더 포 함할 수 있다. 디스플레이부는, 도 3에 도시된 바와 같이, 수중생물이 촬영된 영상을 보여주는 영상부가 좌측에 위 치되고, 우측에는 영상부에서 이동영역(141a,141b,141c)으로 인식된 부분과 학습데이터를 비교분석한 결과 판단된 동물성 플랑크톤의 종류이미지와, 종류명, 정확도와 크기 등의 분석 정보를 제공한 다. 이때, 정확도가 소정값(일례로 20%)이상인 것만 디스플레이부에 표시되도록 구성할 수 있다. 여기서, 표시된 동물성 플랑크톤의 크기는, 이동영역(141a,141b,141c)의 가로 및 세로의 화소수와 화소당 실제 크기를 근거로 산출될 수 있다. 예를 들면, 영역의 화소수가 18*25이고, 화소당 실제 크기가 2.5mm인 경우, 실제 크기는 45mm*62.5mm가 되고, 이 실제 크기를 디스플레이부에 표시하게 된다. 또한, 디스플레이부는, 이동영역(141a,141b,141c)의 크기를 근거로 동물성 플랑크톤의 크기가 50㎛이상인 지 여부를 표시하는 크기표시부를 포함할 수 있다. 크기표시부의 일례로 도 3에서는 50㎛이상인 개체 수가 몇 개인지, 10~50㎛미만의 개체수가 몇개인지를 표시하도록 구성하였다. 도 3의 실시예에서는, 수중에 3개 종류의 동물성 플랑크톤이 존재한다고 판단하였고, 그 크기는 모두 50㎛이상 인 것으로 분석하였다. 이와 같이 본 발명의 샘플수 분석장치는, 제어부에서 촬상부에서 촬영된 샘플수의 영상을 수신 하고 샘플수내에 어떠한 종류의 생물체가 존재하는지를 분석하여 선박평형수 살균처리 결과가 IMO 기준에 만족 하는지를 판단할 수 있게 된다. 기준에 만족할 경우, 처리수를 연안해역에 배출하는 디밸러스팅 동작을 수행하 고, 기준에 불만족할 경우 처리수의 배출을 중단하고 수중생물의 살균을 위한 재처리공정을 수행하게 된다. 특히, 기계학습을 통해 제어부에서 분석된 결과값을 통해 생물 생사판별을 자동으로 수행할 뿐만 아니라 어떤 종류의 동물성 플랑크톤이 들어 있는지, 50㎛이상의 동물성 플랑크톤의 개수는 몇 개인지를 자동으로 표시 할 수 있도록 구성된다. 이와 같이 기계학습을 통해 수중 생물의 분석작업을 자동으로 진행할 경우에는 자동으로 데이터를 측정함으로써 데이터 축적할 수 있을 뿐만 아니라 생물크기 및 종류정보를 제공하며 보다 신뢰성이 높게 생사판별을 수행할 수 있게 된다.이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위 내에서 다양한 수정, 변경 및 치환이 가능할 것이다. 따라서, 본 발명에 개시된 실시예 및 첨부된 도면들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예 및 첨부된 도면에 의하여 본 발명의 기술 사상의 범위 가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범 위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2016-0155614", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 샘플수 분석장치를 도시한 구성도이고, 도 2는 본 발명의 일실시예에 따른 샘플수 분석장치에 입력되는 동물성 플랑크톤의 학습이미지들을 도시한 것이 고, 도 3은 본 발명의 일실시예에 따른 샘플수 분석장치의 디스플레이부를 도시한 것이다."}
