{"patent_id": "10-2021-0143700", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0059476", "출원번호": "10-2021-0143700", "발명의 명칭": "날씨 기반 패션정보 제공 방법 및 장치", "출원인": "한양여자대학교산학협력단", "발명자": "김경식"}}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "정보 제공 장치의 날씨 기반 패션정보 제공 방법으로서, 사용자의 선호 스타일 정보 및 구매 이력을 포함하는 패션 취향 정보를 수집하는 단계; 하나 이상의 판매자로부터 신상품 정보를 설정된 주기마다 업데이트 받아 패션상품 리스트에 등록하는 단계; 상기 패션 상품 리스트에 등록된 하나 이상의 패션 상품의 집합인 패션코디상품을 착장한 인플루언서의 착장 이미지 및 착장 이미지에 대한 분류 정보를 업로드 받는 단계; 기상청 API로부터 연동되는 미리 설정된 기간의 날씨정보를 획득하는 단계;인공지능(AI) 알고리즘을 이용하여 상기 패션 상품 리스트 중에서 상기 착장 이미지에 대한 분류 정보에 기초하여 상기 패션 취향 정보에 매칭되는 복수개의 패션코디상품을 추출하되, 추출된 복수개의 패션코디상품 중에 획득된 날씨정보에 매칭되는 패션코디상품을 우선적으로 선정하는 단계; 및 획득된 날씨정보에 대하여 선정된 패션코디상품에 대한 패션정보를 제공하는 단계를 포함하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 선정된 패션코디상품에 포함된 패션상품에 대한 구매요청 신호에 따라 전자상거래를 수행하는 단계를 더 포함하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 분류 정보는 착장 이미지에 포함된 패션코디상품에 대한, 스타일, 계절, 날씨, 온도, 상황의 정보를 포함하고, 상기 인공지능 알고리즘은 상기 착장 이미지 및 분류 정보에 따라 레이블을 인덱싱하고, 상기 레이블에 기초하여 상기 패션 취향 정보 및 획득된 날씨와의 매칭 점수를 산정하는 것을 특징으로 하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 인공지능 알고리즘은 상기 패션 상품 리스트에 등록되는 패션 상품의 등록일에 따라 가중치를 부여하는 것을 특징으로 하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 공개특허 10-2023-0059476-3-상기 인공지능 알고리즘은 상기 패션 상품 리스트에 등록된 기간이 미리 설정된 기간을 경과한 상품은 상기 패션 상품 리스트에서 삭제하는 것을 특징으로 하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 인공지능 알고리즘은 상기 패션 상품 리스트의 패션 상품에 대하여 판매량에 따라 가중치를 부여하는 것을특징으로 하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서, 선정된 패션코디상품에 포함된 패션 상품에 대한 유사상품정보를 요청신호에 따라, 산정된 매칭 점수에 기초하여 미리 설정된 개수의 패션 상품을 추가로 선정하여 추가로 선정된 패션 상품 정보를 제공하는 것을 특징으로하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 패션 취향 정보는 나이, 성별, 체형, 선호 색상 중 어느 하나 이상을 더 포함하고, 상기 패션정보는 상기 착장 이미지 및 패션 상품 정보 중 어느 하나 이상을 포함하고, 상기 패션 상품 정보는 이미지, 상품 가격, 상품명을 포함하는 것을 특징으로 하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 특정 인플루언서로부터 착장 이미지를 업로드받으면 상기 특정 인플루언서의 팔로워에게 착장 이미지의 업로드를 공지하는 단계를 더 포함하는 것을 특징으로 하는 날씨 기반 패션정보 제공 방법."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "외부와 정보를 송수신하는 통신부; 상기 통신부를 통해 수신받은 사용자의 선호 스타일 정보 및 구매 이력을 포함하는 패션 취향 정보를 수집하는패션 취향 정보 수집부; 사용자 데이터베이스에 저장하고, 하나 이상의 판매자로부터 신상품 정보를 설정된 주기마다 업데이트 받아 패션상품 리스트에 등록하는 상품등록부; 상기 패션 상품 리스트에 등록된 하나 이상의 패션 상품의 집합인 패션코디상품을 착장한 인플루언서의 착장 이미지 및 착장 이미지에 대한 분류 정보를 업로드 받는 SNS 관리부;기상청 API로부터 연동되는 미리 설정된 기간의 날씨정보를 획득하는 날씨정보 획득부; 인공지능(AI) 알고리즘을 이용하여 상기 패션 상품 리스트 중에서 상기 착장 이미지에 대한 분류 정보에 기초하여 상기 패션 취향 정보에 매칭되는 복수개의 패션코디상품을 추출하되, 추출된 복수개의 패션코디상품 중에 획득된 날씨정보에 매칭되는 패션코디상품을 우선적으로 선정하는 패션코디상품 선정부; 및공개특허 10-2023-0059476-4-획득된 날씨정보에 대하여 선정된 패션코디상품에 대한 패션정보를 제공하는 정보제공부;를 포함하는 날씨 기반 패션정보 제공 장치."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 선정된 패션코디상품에 포함된 패션상품에 대한 구매요청 신호에 따라 전자상거래를 수행하는 전자상거래부를 더 포함하는 날씨 기반 패션정보 제공 장치."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 분류 정보는 착장 이미지에 포함된 패션코디상품에 대한, 스타일, 계절, 날씨, 온도, 상황의 정보를 포함하고, 상기 인공지능 알고리즘은 상기 착장 이미지 및 분류 정보에 따라 레이블을 인덱싱하고, 상기 레이블에 기초하여 상기 패션 취향 정보 및 획득된 날씨와의 매칭 점수를 산정하는 것을 특징으로 하는 날씨 기반 패션정보 제공 장치."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10에 있어서, 상기 인공지능 알고리즘은 상기 패션상품 리스트에 등록되는 패션 상품의 등록일에 따라 가중치를 부여하는 것을 특징으로 하는 날씨 기반 패션정보 제공 장치."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 정보제공부는 선정된 패션코디상품에 포함된 패션 상품에 대한 유사상품정보를 요청신호에 따라, 산정된매칭 점수에 기초하여 미리 설정된 개수의 패션 상품을 추가로 선정하여 추가로 선정된 패션 상품 정보를 제공하는 것을 특징으로 하는 날씨 기반 패션정보 제공 장치."}
{"patent_id": "10-2021-0143700", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서, 상기 패션 취향 정보는 나이, 성별, 체형, 선호 색상 중 어느 하나 이상을 더 포함하고, 상기 패션정보는 상기 착장이미지 및 패션 상품 정보 중 어느 하나 이상을 포함하고, 상기 패션 상품 정보는 이미지, 상품 가격, 상품명을 포함하는 것을 특징으로 하는 날씨 기반 패션정보 제공 장치."}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 명세서는 정보 제공 장치의 날씨 기반 패션정보 제공 방법에 관한 것으로, 상기 패션정보 제공 방법은 사용자 의 선호 스타일 정보 및 구매 이력을 포함하는 패션 취향 정보를 수집하는 단계; 하나 이상의 판매자로부터 신상 품 정보를 설정된 주기마다 업데이트 받아 패션상품 리스트에 등록하는 단계; 상기 패션 상품 리스트에 등록된 (뒷면에 계속)"}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 날씨 기반 패션정보 제공 방법 및 장치에 관한 것으로, 인공지능 패션 알고리즘이 인플루언서들에 의해 업로드되는 패션상품의 착장 이미지를 분석하여 사용자의 패션취향 및 날씨를 고려한 패션정보를 제공하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "패션에는 의류, 신발, 가방, 모자, 스카프, 장갑, 양말, 지갑, 허리띠, 안경, 시계, 귀금속, 액세서리, 내의 등 이 모두 포함되는 것으로 이하에서 설명하고 이해하며, 의상과 의복과 의류는 같은 의미이고 문맥이 비교적 순 조롭게 이어지며 설명하기 적합하고 이해하기 용이하도록 선택적으로 기재한다. 패션 중에서 가장 기본이 되며 중요하고 큰 부분을 차지하는 의류(의복, 의상) 관련 산업은 전 세계 소비재 산 업 분야에서 매출액 2위를 차지하고 있는 커다란 시장규모를 형성한다. 최근 스마트폰을 활용한 멀티미디어와 IT 기술의 발달로 신기술을 활용한 의상 코디 스타일(스타일링)의 사용자 관심도가 크게 증가하고 있는 실정이다. 인터넷과 TV와 SNS와 컴퓨터와 통신 기술 등의 발달에 의하여 연예인, 스포츠인, 정치인 등이 포함되는 셀럽 유 명인사 또는 인플루언서(influencer)의 동향을 쉽게 빠르게 접할 수 있고 직접 또는 간접적으로 통신(의사전 달)이 가능하게 되면서 유명인사 또는 인플루언서의 패션에 대한 관심이 높아지고 있으며, 유명인사 또는 인플 루언서(이하, ‘유명인사’라 한다.)의 스타일링 패션을 따라하는 지명도가 크게 증가하고 있는 실정이다. 한편, 유명인사의 경우 스타일링 패션을 위하여 전문 스타일리스트의 자문 또는 지도를 받는 것이 일반적이다. 유명인사가 착용한 각 패션의 구체적인 정보 일 례로, 생산자(메이커), 생산년도, 작품명칭, 가격, 사이즈, 색 상, 판매장소 등의 정보를 알고 싶은 욕구가 커지고 있으나 이러한 정보의 신속한 확보가 비교적 어렵고, 판매 업체에서도 유명브랜드의 우위성을 내세워 해당 정보의 공개에 적극적이지 않고 있는 실정이다. 대중매체와 인터넷 등에서 검색, 수집할 수 있는 빅데이터(Big data)와 인공지능(AI : Artificial Intelligence) 기술 및 디지털 이미지 프로세싱(DSP : digital signal processing) 기술 등을 응용하여 각 패 션에 대한 구체적인 정보를 정확하며 세밀하게 확인할 수 있다. 일반적으로 외출하는 경우 마다 대중적이면서도 조금은 특색 있는 패션으로 스타일링하기 위하여 많은 시간과 노력이 소모된다. 의상 스타일링 관련하여 코디 서비스, 제품을 제공하거나 의상에 관련된 제품, 상품, 서비스를 판매하거나 제공 하는 웹사이트 또는 업체(사이트)가 온라인과 오프라인에서 다수 소개되고 있으나 선호하는 패션 스타일링 특히, 개인의 패션 취향 및 날씨 등을 고려한 맞춤형 패션코디에 대한 구체적인 정보를 비접촉(untact) 방식으 로 신뢰성 있으면서 정확하고 상세하게 제공하는 서비스가 없다는 문제가 있다. 이러한 문제를 일부 해소한 종래기술로 대한민국 특허 등록번호 제10-1725960호(2017.04.05.)에 의한 ‘의상 코 디 시스템 및 방법'이 있다. 종래기술을 상세히 설명하면 입력부는 패션 스타일링의 기준이 되는 의상 종류 정보를 입력하고, 카메라는 패션 스타일링의 기준이 되는 의상의 영상을 취득하며, 색상매칭부는 카메라가 취득한 의상의 영상 데이터로부터 색 상정보를 추출 한 후, 컬러데이터베이스를 검색하여 추출된 색상정보와 매칭되는 색상 정보를 확인하여 의상제 안부에 전달한다. 의상제안부는 의상데이터베이스를 검색하여 사용자가 보유하고 있는 의상 중 검색된 색상에 해당하는 의상을 선택하여 사용자에게 코디 의상으로 제안하는 구성이다. 종래기술은 사용자가 선택한 선호의상을 기준으로 색상을 분석하고 매칭되는 색상의 의상을 사용자가 보유한 의 상(패션)으로부터 검색하여 코디 의상(패션)으로 제안하는 장점이 있다. 그러나 종래기술은 단순하게 색상이 매칭되는 의복만을 검색하여 제안 또는 제공하므로, 제공된 스타일링 패션 이 유행하는 스타일링이 아닐 수 있으며 유행하는 스타일링의 경우에도 사용자가 선호하는 스타일링의 패션이 아닐 수 있는 등의 문제가 여전히 남아 있다."}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서의 일 실시 예는 인공지능 알고리즘을 이용하여 인플루언서의 패션코디를 분석하여 사용자 패션 취향 및 날씨 등의 외부 상황에 매칭되는 패션코디정보를 사용자에게 편리하게 제공하는데 그 목적이 있다."}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 명세서의 일 실시 예에 따르는 정보 제공 장치의 날씨 기반 패션정보 제공 방법은, 사용자의 선호 스타일 정 보 및 구매 이력을 포함하는 패션 취향 정보를 수집하는 단계; 하나 이상의 판매자로부터 신상품 정보를 설정된 주기마다 업데이트 받아 패션상품 리스트에 등록하는 단계; 상기 패션 상품 리스트에 등록된 하나 이상의 패션 상품의 집합인 패션코디상품을 착장한 인플루언서의 착장 이미지 및 착장 이미지에 대한 분류 정보를 업로드 받 는 단계; 기상청 API로부터 연동되는 미리 설정된 기간의 날씨정보를 획득하는 단계; 인공지능(AI) 알고리즘을 이용하여 상기 패션 상품 리스트 중에서 상기 착장 이미지에 대한 분류 정보에 기초하여 상기 패션 취향 정보에 매칭되는 복수개의 패션코디상품을 추출하되, 추출된 복수개의 패션코디상품 중에 획득된 날씨정보에 매칭되는 패션코디상품을 우선적으로 선정하는 단계; 및 획득된 날씨정보에 대하여 선정된 패션코디상품에 대한 패션정보 를 제공하는 단계를 포함한다. 일 실시예에서, 날씨 기반 패션정보 제공 방법은 선정된 패션코디상품에 포함된 패션상품에 대한 구매요청 신호 에 따라 전자상거래를 수행하는 단계를 더 포함한다. 일 실시예에서, 상기 분류 정보는 착장 이미지에 포함된 패션코디상품에 대한, 스타일, 계절, 날씨, 온도, 상황 의 정보를 포함하고, 상기 인공지능 알고리즘은 상기 착장 이미지 및 분류 정보에 따라 레이블을 인덱싱하고, 상기 레이블에 기초하여 상기 패션 취향 정보 및 획득된 날씨와의 매칭 점수를 산정하는 것을 특징으로 한다. 일 실시예에서, 상기 인공지능 알고리즘은 상기 패션 상품 리스트에 등록되는 패션 상품의 등록일에 따라 가중 치를 부여하는 것을 특징으로 한다. 일 실시예에서, 상기 인공지능 알고리즘은 상기 패션 상품 리스트에 등록된 기간이 미리 설정된 기간을 경과한 상품은 상기 패션 상품 리스트에서 삭제하는 것을 특징으로 한다. 일 실시예에서, 상기 인공지능 알고리즘은 상기 패션 상품 리스트의 패션 상품에 대하여 판매량에 따라 가중치 를 부여하는 것을 특징으로 한다. 일 실시예에서, 선정된 패션코디상품에 포함된 패션 상품에 대한 유사상품정보를 요청신호에 따라, 산정된 매칭 점수에 기초하여 미리 설정된 개수의 패션 상품을 추가로 선정하여 추가로 선정된 패션 상품 정보를 제공하는 것을 특징으로 한다. 일 실시예에서, 상기 패션 취향 정보는 나이, 성별, 체형, 선호 색상 중 어느 하나 이상을 더 포함하고, 상기 패션정보는 상기 착장 이미지 및 패션 상품 정보 중 어느 하나 이상을 포함하고, 상기 패션 상품 정보는 이미지, 상품 가격, 상품명을 포함하는 것을 특징으로 한다. 일 실시예에서, 특정 인플루언서로부터 착장 이미지를 업로드받으면 상기 특정 인플루언서의 팔로워에게 착장 이미지의 업로드를 공지하는 단계를 더 포함하는 것을 특징으로 한다. 본 명세서의 일 실시예에 따른 날씨 기반 패션정보 제공 장치는, 외부와 정보를 송수신하는 통신부; 상기 통신 부를 통해 수신받은 사용자의 선호 스타일 정보 및 구매 이력을 포함하는 패션 취향 정보를 수집하는 패션 취향 정보 수집부; 사용자 데이터베이스에 저장하고, 하나 이상의 판매자로부터 신상품 정보를 설정된 주기마다 업데 이트 받아 패션상품 리스트에 등록하는 상품등록부; 상기 패션 상품 리스트에 등록된 하나 이상의 패션 상품의 집합인 패션코디상품을 착장한 인플루언서의 착장 이미지 및 착장 이미지에 대한 분류 정보를 업로드 받는 SNS 관리부; 기상청 API로부터 연동되는 미리 설정된 기간의 날씨정보를 획득하는 날씨정보 획득부; 인공지능(AI) 알고리즘을 이용하여 상기 패션 상품 리스트 중에서 상기 착장 이미지에 대한 분류 정보에 기초하여 상기 패션 취향 정보에 매칭되는 복수개의 패션코디상품을 추출하되, 추출된 복수개의 패션코디상품 중에 획득된 날씨정보 에 매칭되는 패션코디상품을 우선적으로 선정하는 패션코디상품 선정부; 및 획득된 날씨정보에 대하여 선정된 패션코디상품에 대한 패션정보를 제공하는 정보제공부를 포함하는 것을 특징으로 한다. 일 실시예에 따른 날씨 기반 패션정보 제공 장치는 선정된 패션코디상품에 포함된 패션상품에 대한 구매요청 신 호에 따라 전자상거래를 수행하는 전자상거래부를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서의 일 실시 예에 따르면 인공지능(AI) 기술을 이용하여 인플루언서의 스타일링 패션에 대한 각 품목 (패션, 상품)별 상세하고 구체적이며 신뢰성 있는 정보를 분석하여 사용자의 취향 정보와 날씨에 매칭되는 패션 상품 정보를 주기적으로 또는 비주기적으로 제공할 수 있다. 또한, 인플루언서의 스타일링 패션코디 정보를 수집 관리하고 팔로워에게 비접촉(untact) 방식으로 제공하는 장 점이 있다. 또한, 사용자는 사용자 개별 취향 및 상황에 맞는 개별 패션코디 정보를 제공하므로, 구매를 유도할 수 있어 전 자 상거래를 활성화시킬 수 있는 효과도 있다."}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 명세서의 실시 예를 첨부된 도면을 참조하여 상세하게 설명한다. 실시 예를 설명함에 있어서 본 명세서가 속하는 기술 분야에 익히 알려져 있고 본 명세서와 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 명세서의 요지를 흐리지 않고 더욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 도 1은 본 명세서의 일 실시 예에 따르는 날씨 기반 패션정보 제공 시스템의 망 구성도이다. 도 1을 참조하면 본 명세서의 일 실시 예에 따르는 날씨 기반 패션정보 제공 시스템은 패션정보 제공 장치 , 인플루언서 단말, 웹 서버 및 사용자 단말을 포함할 수 있다. 패션정보 제공 장치는 후술하는 바와 같이 미리 정해진 기간마다 미리 등록된 판매자로부터 패션 상품 정 보를 제공받아 업데이트하고, 인플루언서의 패션 상품 착장 이미지를 분류 정보와 함께 수집하고 매칭시켜 저장 하고, SNS(social networking service) 상에서 이용자들에게 공유시키고, 요청에 따라 사용자에게 사용자 단말 을 통해 패션정보를 추천 및 제공한다. 예를 들어 패션정보 제공 장치는 인플루언서 단말을 통해 패션 상품 착장 이미지와 분류 정보를 SNS(social networking service) 상에서 게시한다. 패션정보 제공 장치는 새로운 게시물이 업로드되면 해 당 인플루언서의 팔로워들에게 게시물의 업로드를 공지할 수 있다. 추후 사용자 단말로부터 해당 게시물에 대하여 패션 상품 정보 요청이 있으면 저장된 인플루언서의 착장 이미지와 분류 정보에 기초하여 패션정보 및/ 또는 패션상품정보를 제공할 수 있다. 더 나아가 패션정보 제공 장치는 해당 상품의 구매페이지를 제공하 거나 구매페이지로의 이동을 가능하게 할 수 있다. 여기서, 패션 상품 정보는 상품 이미지, 상품 가격, 상품명 등을 포함할 수 있다. 분류 정보는 날씨, 스타일, 계절 온도, 상황 등을 포함할 수 있다. 예를 들어, 추후 사용자 단말로부터 스타일을 포함하는 선호 스타일 정보를 입력받아 등록하고, 패션 상품 정보 요청이 있으면, 상기 선호 스타일 정보에 기초하여 매칭되는 분류 정보를 가진 인플루언서의 착장 이미지 를 제공할 수 있다. 또한, 추후 사용자 단말로부터 제공되는 인플루언서의 착장 이미지로부터 임의의 상품 을 선택받는 경우, 해당 상품의 패션 상품 정보를 제공할 수 있다. 또한, 패션정보 제공 장치는 기상청의 API(Application Programming Interface)로부터 연동되는 미리 설 정된 기간(예를 들어 1주일)의 날씨 정보를 획득하여, 저장된 패션 데이터베이스에 기초하여 날씨 정보와 매칭 되는 패션정보 및 패션상품정보를 추천하여 제공할 수 있다. 패션 데이터베이스는 판매자로부터 업로드된 신상품의 판매상품정보와, 상기 신상품을 착장한 인플루언서의 착 장 이미지와 분류 정보를 포함할 수 있다. 인플루언서 단말 및 사용자 단말에는 각 단말에 패션정보 검색을 위한 어플리케이션(application)이 설치되고, 설치된 어플리케이션을 통해 패션정보 제공 장치가 제공하는 서비스를 이용할 수 있다. 여기서, 패션정보 제공 장치가 제공하는 서비스는 SNS 서비스, 패션정보 제공 서비스, 패션상품 추천 서비스, 패션 상품 구매연동 서비스 등을 포함할 수 있다. SNS 서비스는 인플루언서에 대한 팔로잉 서비스를 포함하고, 패션정보 제공 서비스는 사용자의 요청에 따라 인 플루언서의 착장 이미지에 매칭되는 패션정보를 제공하는 서비스를 포함하고, 패션상품 추천 서비스는 날씨 기 반 패션 상품을 추천하는 서비스를 포함하고, 패션 상품 구매연동 서비스는 사용자의 요청에 따라 선택된 패션 상품에 대한 전자상거래를 활성화시킬 수 있다. 예를 들어, 구매페이지로 연동시키고 구매 대금 입금 및 확인 등의 결제 과정을 수행한다. 각각의 서비스에 대하여는 추후 도 3 내지 도 11을 참조하여 상세히 설명한다. 인플루언서 단말은 이미지 등이 저장될 수 있으며, 정보 입력이 가능하고,패션정보 제공 장치와 통신 망을 통해 연결되고, 패션정보 제공 장치로부터 제공되거나 인플루언서 단말에 설치된 어플리케이션 을 통해 제공되는 인터페이스를 통해 인플루언서가 이미지를 SNS에 업로드하고 공유할 수 있도록 제공되는 컴퓨 터 단말의 형태로 구현될 수 있다. 인플루언서는 인플루언서 단말을 통해 착장 이미지의 분류 정보를 입력 할 수 있다. 예를 들어 오늘의 여행 등의 패션 착장 상황을 설명하는 상황 정보를 입력할 수 있다. 또는 날씨나 온도 등을 입력할 수 있다. 입력된 착장 이미지와 분류 정보는 패션정보 제공 장치에 전달되어 저장될 수 있다. 또한, 입력된 착장 이 미지와 분류 정보는 SNS를 통해 다른 이용자와 공유될 수 있다. 인플루언서 단말 및 사용자 단말은 웹 서버를 통해 패션정보 제공 장치에 접근할 수 있다. 사용자는 사용자 단말의 웹 브라우저를 통해 웹 서버에 접속하고, 이후 웹 인터페이스를 통해 필요한 정보의 입력과 정보 요청, 정보 확인 등의 작업을 수행할 수 있다. 웹 서버 대신 애플리케이션 서버가 사용되는 경우 웹 프로토콜 대신 별도의 프로토콜이 사용될 수 있다. 사용자 는 사용자 단말에 설치된 별도의 애플리케이션을 통해 애플리케이션 서버에 접속하고, 이후 해당 애 플리케이션 및 애플리케이션 서버가 제공하는 인터페이스를 통해 필요한 정보의 입력과 정보 요청, 정보 확인 등의 작업을 수행할 수 있다. 사용자 단말은 예를 들어 사용자의 퍼스널 컴퓨터, 스마트 폰, 태블릿형 PC, 노트북 컴퓨터 기타 통신 가 능한 단말의 형태로 구현될 수 있다. 웹 서버는 사용자 단말과 패션정보 제공 장치 사이의 통신을 중개한다. 사용자 단말은 웹 서버가 제공하는 인터페이스를 통해 정보를 입력하거나 요청 메시지를 송신할 수 있고, 패션정보 제공 장 치는 웹 서버를 통해 사용자 단말이 전달하는 정보 및/또는 요청 메시지를 수신할 수 있다. 변형 예에서, 웹 서버는 실질적으로 패션정보 제공 장치에 포함되도록 구현될 수 있다. 또한 다른 실 시 예에 따르면, 웹 서버는 사용자 단말뿐만 아니라 인플루언서 단말을 위한 인터페이스도 제공 할 수 있다. 웹 서버가 사용자 단말을 위한 인터페이스와 인플루언서 단말을 위한 인터페이스를 모두 제공하는 경우 미리 설정된 정책에 따라 등록된 인플루언서의 접근 시에는 이미지 착장 및 패션정보 업로 드를 위한 인터페이스를 제공하고, 다른 일반 사용자의 접근 시에는 등록된 인플루언서의 패션정보 또는 패션상 품정보의 조회를 위한 인터페이스를 제공할 수 있다. 도 1의 날씨 기반 패션정보 제공 시스템의 구체적인 동작 방식에 대해서는 도 2 내지 도 6을 참조하여 후술한다. 도 2는 본 명세서의 일 실시 예에 따르는 단말의 블록구성도이다. 도 2를 참조하면 본 명세서의 일 실시 예에 따르는 단말은 인플루언서 단말 및 사용자 단말을 모두 포함할 수 있다. 사용자 단말은 입력부, 표시부, 통신부, 저장부 및 제어부를 포함할 수 있다. 입력부는 사용자의 입력 동작을 입력 신호로 변환하여 제어부에게 송신한다. 입력부는 예를 들 어 키보드, 마우스, 터치스크린 상의 터치센서, 터치패드, 키패드, 음성 입력, 기타 현재, 과거에 가능하거나 미래에 가능해질 입력 처리 장치들로써 구현될 수 있다. 입력부는 예를 들어 사용자의 정보 제공 요청 입 력을 수신하여 제어부에게 전달할 수 있다. 표시부는 제어부의 제어에 따라 화면을 출력한다. 표시부는 예를 들어 LCD(액정표시장치), LED (발광 다이오드), OLED(유기 발광 다이오드), 프로젝터, 기타 현재, 과거에 가능하거나 미래에 가능해질 표시 장치들로써 구현될 수 있다. 표시부는 예를 들어 정보 제공을 위한 인터페이스 페이지나 정보 제공 결과 페이지를 표시할 수 있다. 실시 예에 따라서는 화면 출력 대신 음성 출력이나 진동 등 기타 사용자에게 정보를 전달할 수 있는 다른 방식을 사용하는 구성부가 표시부 대신 사용될 수도 있다. 통신부는 패션정보 제공 장치 및/또는 기타 외부 장치와 데이터를 주고받는다. 통신부는 패션정 보 제공 장치로부터 수신한 데이터를 제어부에게 전달한다. 또한 통신부는 제어부의 제어 에 따라 데이터를 패션정보 제공 장치에게 전달한다. 통신부가 사용하는 통신 기술은 통신망의 유형이나 기타 사정에 따라 달라질 수 있다. 저장부는 제어부의 제어에 따라 데이터를 저장하고 요청된 데이터를 제어부에게 전달한다. 제어부는 사용자 단말의 전반적인 동작과 각 구성부를 제어한다. 제어부는 입력부로부터 입력된 정보에 따라 정보 제공 요청, 기타 데이터를 패션정보 제공 장치에게 송신하고, 패션정보 제공 장 치로부터 수신한 페이지 정보에 따라 결과 페이지 및/또는 인터페이스 페이지를 표시부를 통해 표시 한다. 제어부가 수행하는 동작은 물리적으로 분리돼 있는 여러 연산 장치에 의하여 분산 처리될 수 있다. 제어부 가 수행하는 동작 중 일부는 제1 서버가 수행하고 다른 동작은 제2 서버가 수행하는 방식도 가능하다. 이 경우 제어부는 물리적으로 분리돼 있는 연산 장치의 총합으로써 구현될 수 있다. 저장부는 물리적으로 분리돼 있는 저장장치의 총합으로 구현될 수도 있다. 제어부나 저장부가 물리적으로 분리돼 있는 여러 장치의 총합으로 구현되는 경우 여러 장치들 사이의 통신이 필요할 수 있다. 여기서는 설명의 단순화를 위하여 저장부나 제어부가 하나의 객체로 구현된 경우를 가정하여 설명할 것이다. 사용자 단말이 데이터를 송수신하는 경우 관점에 따라 제어부의 제어에 따라 통신부가 데이터를 송수신한다고 표현할 수도 있고, 제어부가 통신부를 제어하여 데이터를 송수신한다고 표현할 수도 있 다. 도 3은 본 명세서의 일 실시 예에 따르는 패션정보 제공 장치의 구성을 도시하는 블록도이다. 도 3을 참조하면 본 명세서의 일 실시 예에 따르는 패션정보 제공 장치는 통신부, 제어부 및 저 장부를 포함할 수 있다. 통신부는 패션정보 제공 장치의 동작에 필요한 신호를 송수신한다. 통신부는 예를 들어 인플루 언서 단말로부터 착장 이미지 업로드, 입력된 분류 정보 중 적어도 일부를 수신할 수 있다. 또한, 통신부 는 사용자 단말로부터 패션정보 추천 요청 메시지, 패션상품정보 요청 메시지, 구매 요청 메시지 중 적어도 일부를 수신할 수 있다. 또한 통신부는 사용자 단말에게 추천 패션정보, 패션상품정보, 구매 페이지 등을 포함하는 응답 메시지를 전달할 수 있다. 제어부는 통신부가 수신한 정보를 저장부에 저장하고, 통신부가 수신한 요청 메시지에 따 라 저장부로부터 필요한 정보를 획득하여 조회 사항에 대한 응답을 생성한다. 저장부는 통신부가 수신한 정보와 기타 패션정보 제공 장치의 동작을 위해 필요한 정보 및 프로 그램 코드를 저장할 수 있다. 예를 들어 저장부는 판매자로부터 업로드된 신상품의 판매상품정보와, 상기 신상품을 착장한 인플루언서의 착장 이미지와 분류 정보를 포함하는 패션 데이터베이스를 저장할 수 있다. 도 4는 본 명세서의 패션정보 제공 장치의 제어부의 구성을 개략적으로 나타낸 블럭도이다. 도 4에 도시한 바와 같이, 패션정보 제공 장치의 제어부는 패션 취향 정보 수집부, 상품등록부, SNS 관리부, 날씨정보 획득부, 패션코디상품 선정부, 정보제공부 및 전자상거래부를 더 포함할 수 있다. 패션 취향 정보 수집부는 사용자의 선호 스타일 정보 및 구매 이력을 포함하는 패션 취향 정보를 수집한다. 여기서 구매이력은 연동된 전자상거래부로부터 획득할 수 있다. 사용자의 선호 스타일 정보는 사용자 단말로부터 사용자 등록시 입력받을 수 있다. 패션 취향 정보 수집부 는 사용자 등록시 사용자 이름, 아이디 등을 입력받아 저장부에 저장할 수 있다. 또한, 패션 취향 정 보 수집부는 나이, 성별, 체형, 선호 색상 중 어느 하나 이상을 추가 입력 받아 패션 취향 정보로서 저장 할 수 있다. 상품등록부는 미리 등록된 판매자로부터 패션상품정보를 업로드받아 저장부에 저장할 수 있다. 패션 상품정보는 상품 이미지, 상품 가격, 상품명 등을 포함할 수 있다. 또한, 상품등록부는 등록된 패션상품 정보의 리스트를 작성하고, 신상품정보가 업로드되면 패션상품정보 리스트를 업데이트할 수 있다. SNS 관리부는 단말로부터 사용자 등록 요청을 받아 계정을 생성하고, 특정한 관심이나 활동을 공유하 는 사용자들 사이의 관계망을 구축해 주는 온라인 서비스인 SNS(Social Network Service)를 사용자에게 제공한 다. 예를 들어, 사용자들로부터 SNS를 통해 업로드되는 의견이나 정보를 게시하거나, 다른 사용자가 게시한 의 견이나 정보를 관리한다. 일 실시예에서, SNS 관리부는 SNS를 이용하는 사용자들 중 소셜미디어 상에서 패션상품 착장 이미지의 업 로드가 지정된 기간 동안 지정된 횟수 이상 등록한 이력이 있으며, 친구수, 팔로어수, 공유수, 좋아요수 중 하 나 이상의 값이 지정된 기준 값 이상이면서, 상기 값들을 정규화(Normalization)하고 지수화(Exponentiation)하 여 소셜영향력 지수를 산출할 수 있으며, 상기 산출된 소셜영향력 지수가 기 설정된 기준 값 이상인 패션 인플 루언서(Social Influencer)를 선별할 수 있다. 다른 실시예에서, 패션 인플루언서는 판매자에 의해 선정되어 SNS 관리부에 등록될 수 있다. 일 실시예에서, SNS 관리부는 인플루언서 단말로부터 착장 이미지 및 착장 이미지에 대한 분류 정보 를 업로드받을 수 있다. 여기서 분류 정보는 착장 이미지에 포함된 패션코디상품에 대한, 스타일, 계절, 날씨, 온도, 상황의 정보를 포함할 수 있다. 이러한 분류 정보는 후술되는 패션코디상품 선정부에서 패션선정을 위한 매칭점수를 계산할 때 사용할 수 있다. 일 실시예에서, SNS 관리부는 패션 인플루언서로 선정된 인플루언서 단말로부터 착장 이미지가 업로 드되면 해당 패션 인플루언서의 팔로워로 등록된 사용자 단말에 새로운 게시물의 업로드를 통지하거나 공 유시킬 수 있다. 날씨정보 획득부는 기상청 API로부터 연동되는 미리 설정된 제2 기간의 날씨정보를 획득한다. 미리 설정된 제2 기간은 1주일 또는 2주일 일 수 있다. 날씨정보는 지역별 온도, 습도, 강우량, 적설량, 풍향, 풍속, 풍량이 포함될 수 있다. 즉, 날씨정보 획득부는 1주일 또는 2주일간의 날씨 정보를 획득하고, 후술되는 패션코디 상품 선정부를 통해 1주일 또는 2주일간의 날짜별 날씨 정보에 대응하는 패셭코디상품을 날짜별로 선정할 수 있다. 이로써, 사용자는 1주일 또는 2주일간의 패션코디상품을 미리 확인하고 준비할 수 있게 된다. 패션코디상품 선정부는 인공지능(AI) 알고리즘을 이용하여 상기 패션 상품 리스트 중에서 상기 착장 이미 지에 대한 분류 정보에 기초하여 상기 패션 취향 정보 및 날씨정보 획득부에 의해 획득된 제2 기간의 날씨 정보에 매칭되는 복수개의 패션코디상품을 추출할 수 있다. 이 때, 날씨 정보에 가중치를 주어 날씨정보에 매칭 되는 패션코디상품을 우선적으로 선정할 수 있다. 일 실실시예에서, 패션코디상품 선정부는 인공지능(AI) 알고리즘을 이용하여 최신의 패션상품 또는 최다 판매 패션상품에 가중치를 줄 수 있다. 일 실시예에서, 패션코디상품 선정부는 선정된 패션코디상품 중에 미리 설정된 등록기간이 지난 패션상품 은 선정대상에서 제외시킨다. 정보제공부는 패션코디상품 선정부를 통해 선정된 패션코디상품에 대한 패션정보를 사용자 단말(13 0)에 제공할 수 있다. 정보제공부는 선정된 패션코디상품에 포함된 패션 상품에 대한 유사상품정보를 요청신호에 따라, 산정된 매칭 점수에 기초하여 미리 설정된 개수의 패션 상품을 추가로 선정하여 추가로 선정된 패션 상품 정보를 제공 할 수 있다. 전자상거래부는 선정된 패션코디상품에 포함된 패션상품에 대한 구매요청 신호를 사용자 단말로부터 수신받아 해당 패션상품에 대한 구매를 위한 전자상거래를 수행한다. 즉, 전자상거래부는 사용자가 해당 패션상품에 대한 구매를 위한 전자 결재를 수행하여 해당 상품의 구입을 가능하게 한다. 전자상거래부는 구매가 이루어지면 구매이력을 저장하여 등록된 사용자의 구매이력을 업데이트할 수 있다. 도 3 내지 도 4의 각 구성부의 구체적인 동작에 대해서는 도 5 내지 도 11을 참조하여 후술한다. 도 5는 본 명세서의 일 실시 예에 따르는 패션정보 제공 장치의 날씨 기반 패션정보 제공 방법의 순서도이다. 단계 S110에서, 사용자의 선호 스타일 정보 및 구매 이력을 포함하는 패션 취향 정보를 수집한다. 일 실시예에서, 사용자는 사용자 단말을 통해 사용자의 선호 스타일 정보를 입력하여 패션정보 제공 장치 에 전달할 수 있다. 단계 S120에서, 하나 이상의 판매자로부터 신상품 정보를 설정된 주기마다 업데이트 받아 패션상품 리스트에 등 록한다. 예컨대 판매자들은 1주 단위로 적게는 2개 많게는 7개의 신상품들을 등록할 수 있다. 단계 S130에서, 상기 패션 상품 리스트에 등록된 하나 이상의 패션 상품의 집합인 패션코디상품을 착장한 인플 루언서의 착장 이미지 및 착장 이미지에 대한 분류 정보를 업로드 받는다. 단계 S140에서, 기상청 API로부터 연동되는 미리 설정된 제2 기간의 날씨정보를 획득한다. 여기서 미리 설정된 제2 기간은 1주일일 수 있다. 단계 S150에서, 인공지능(AI) 알고리즘을 이용하여 상기 패션 상품 리스트 중에서 상기 착장 이미지에 대한 분 류 정보에 기초하여 상기 패션 취향 정보에 매칭되는 복수개의 패션코디상품을 추출하되, 추출된 복수개의 패션 코디상품 중에 획득된 날씨정보에 매칭되는 패션코디상품을 우선적으로 선정한다. 단계 S160에서, 획득된 날씨정보에 대하여 선정된 패션코디상품에 대한 패션정보를 제공한다. 이후, 단계 S170에서, 선정된 패션코디상품에 포함된 패션상품에 대한 구매요청 신호에 따라 전자상거래를 수행 한다. 도 6은 본 발명의 일 실시예에 따른 인플루언서의 착장 이미지 및 분류 정보의 업로드를 위한 인터페이스 페이 지의 일 예이다. 도 6에 도시한 바와 같이, 착장 이미지와 함께 스타일, 계절, 날씨, 온도, 상황, 기타를 포함하는 분류 정보 를 함께 업로드할 수 있다. 이러한 인터페이스 페이지는 패션정보 제공 장치에 의해 제공될 수도 있고, 인플루언서 단말에 설치된 전용 어플리케이션을 통해 제공될 수도 있다. 도 7은 본 발명의 일 실시예에 따른 날씨에 기초한 패션코디 정보 제공 페이지의 일 예이다. 도 7에 도시한 바와 같이, 사용자 단말의 일 화면에 표시된 패션코디 추천을 위한 아이콘을 선택하면, 패 션코디 추천 요청 정보가 패션정보 제공 장치에 전달되고, 해당 사용자와 기 설정된 기간의 날씨정보에 기 초한 패션코디정보가 제공된다. 이때, 패션코디정보는 요일 또는 날짜별로 제공되고, 각 요일 또는 날자별 날씨정보가 함께 표시될 수 있다. 이와 같이 제공되는 패션코디정보는 본 발명의 일 실시예에서서 설명한 인공지능 알고리즘에 따라 선정된 패션코디상품을 포함한다. 또한, 날씨정보 또는 패션코디정보에서 특정 날짜를 선택하면 해당 날씨에 어울리는 추가 패션코디정 보가 제공된다. 예를 들어, 일요일 맑은날을 선택하면 맑은 날씨에 어울리는 여러 상황(데이트, 나들이, 행사) 등에 대한 다양 한 패션코디정보를 제공할 수 있다. 이와 같이 제공되는 패션코디정보(702 또는 704)에서 특정 상품을 선택하면 해당 상품의 상품정보를 더 제공할 수 있다. 도 8은 본 발명의 일 실시예에 따른 상품정보 표시화면의 일 예이다. 도 8에도시한 바와 같이, 패션코디정보에 포함된 특정 상품을 선택한 경우, 해당 상품의 상세 페이지로 이동하 여 상세한 상품정보 및 구매페이지로 이동될 수 있다. 도 9 내지 도 11은 본 발명의 일 실시예에 따른 인공지능 알고리즘을 설명하기 위한 도면이다. 도 9를 참고하면, 패션정보 제공 장치는 인공지능 알고리즘에 따라 인플루언서가 착장 이미지를 게시하면 착장 이미지로부터 게시물 ID(post ID), 사용자 ID, 상품 ID, 날씨 ID, 트랜드 ID 등의 로그 테이블(Log table)을 작성할 수 있다. 도 10을 참고하면, 패션정보 제공 장치는 인공지능 알고리즘에 따라 로그 테이블로부터 각 카테고리별 각 항목 에 순위를 매기고 데이터 점수를 책정한다. 도 11을 참고하면, 패션정보 제공 장치는 인공지능 알고리즘에 따라 각 범주에 가중치를 할당하고, 상품을 선정 하기 위하여 미리 저장된 총점수 계산방식에 따라 각 카테고리에 책정된 점수와 가중치를 곱하여 합한다. 이와 같이 생성된 총점수가 각 매칭점수가 된다. 전술된 본 발명의 일 실시예에 따르면, 인공지능 알고리즘을 이용하여 인플루언서의 패션코디를 분석하여 사용 자 패션 취향 및 날씨 등의 외부 상황에 매칭되는 패션코디정보를 사용자에게 편리하게 제공할 수 있다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행 될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가 능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들 을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA또는 ASIC과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아 니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재 생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성 요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저 들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공 되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다."}
{"patent_id": "10-2021-0143700", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서가 속하는 기술분야의 통상의 지식을 가진 자는 본 명세서가 그 기술적 사상이나 필수적인 특징을 변 경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 본 명세서의 범위는 상기 상 세한 설명보다는 후술하는 특허청구의 범위에 의하여 나타내어지며, 특허청구의 범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 명세서의 범위에 포함되는 것으로 해석되어야 한 다. 한편, 본 명세서와 도면에는 본 명세서의 바람직한 실시 예에 대하여 개시하였으며, 비록 특정 용어들이 사용되 었으나, 이는 단지 본 명세서의 기술 내용을 쉽게 설명하고 발명의 이해를 돕기 위한 일반적인 의미에서 사용된 것이지, 본 명세서의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시 예 외에도 본 명세서의 기술적 사상에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은 본 명세서가 속하는 기술 분야에서 통상의 지식을 가 진 자에게 자명한 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2021-0143700", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 명세서의 일 실시 예에 따르는 날씨 기반 패션정보 제공 시스템의 망 구성도이다. 도 2는 본 명세서의 일 실시 예에 따르는 단말의 블록구성도이다. 도 3은 본 명세서의 일 실시 예에 따르는 패션정보 제공 장치의 구성을 도시하는 블록도이다. 도 4는 본 명세서의 패션정보 제공 장치의 제어부의 구성을 개략적으로 나타낸 블럭도이다. 도 5는 본 명세서의 일 실시 예에 따르는 패션정보 제공 장치의 날씨 기반 패션정보 제공 방법의 순서도이다. 도 6은 본 발명의 일 실시예에 따른 인플루언서의 착장 이미지 및 분류 정보의 업로드를 위한 인터페이스 페이 지의 일 예이다. 도 7은 본 발명의 일 실시예에 따른 날씨에 기초한 패션코디 정보 제공 페이지의 일 예이다. 도 8은 본 발명의 일 실시예에 따른 상품정보 표시화면의 일 예이다. 도 9 내지 도 11은 본 발명의 일 실시예에 따른 인공지능 알고리즘을 설명하기 위한 도면이다."}
