{"patent_id": "10-2019-0093943", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0015304", "출원번호": "10-2019-0093943", "발명의 명칭": "가정용 통신 장치를 이용한 사용자 보안 시스템 및 그 방법", "출원인": "(주)엔티플러스", "발명자": "이남일"}}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가정용 통신 장치를 이용한 사용자 보안 시스템으로서,사용자 댁의 창문 또는 현관문에 설치되어 외부인의 침입을 감지하여 침입 감지 신호를 발생시키는 침입 감지장치와,상기 침입 감지 장치로부터 침입 감지 신호를 수신하면 원격의 위치 정보 제공 서버에 접속하여 미리 저장된 가족/지인을 포함한 출입 가능자의 이동 단말의 위치 정보를 요청 및 수신하고, 상기 출입 가능자의 이동 단말이모두 사용자의 집 외부에 위치하면, 위험 상황으로 판단하고 위험 상황 메시지를 형성하여 원격의 보안 센터에전송하는 가정용 통신 장치와,네트워크를 통해 상기 가정용 통신 장치와 연결되어 위험 상황 메시지를 전송한 AI 스피커가 위치하는 주소를파악하여 경찰 출동을 요청하는 보안 센터와,상기 네트워크를 통한 상기 가정용 통신 장치의 요청에 따라 적어도 하나의 이동 단말의 위치 정보를 제공하는위치 정보 제공 서버를 포함하는 것을 특징으로 하는 가정용 통신 장치를 이용한 사용자 보안 시스템."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 침입 감지 장치는 사용자 댁의 창문 또는 현관문에 설치되어 외부인의 침입을 감지하는 침입 감지 센서,상기 침입 감지 센서의 침입 감지 신호를 전송하는 근거리부 통신부를 포함하고, 상기 가정용 통신 장치는 AI 스피커이며, 상기 AI 스피커는, 인체감지 센서, 마이크, 키입력부, 저장부, 상기 침입 감지 장치와 통신을 위한 근거리 통신부, 원격의 보안 센터와 통신을 위한 무선 통신부 및, 이들 장치들을 제어하는 제어부를 포함하고,상기 저장부에는 사용자가 등록한 출입가능자의 이동 단말의 전화번호와, 출입가능자의 얼굴 사진 이미지와, 지도 데이터베이스와, 상기 마이크로 입력되는 음성을 인식하는 음성 인식 처리 모듈, 상기 출입가능자의 이동 단말의 위치를 요청 및 수신하여 처리하는 위치 추적 처리 모듈이 저장되는 것인, 가정용 통신 장치를 이용한 사용자 보안 시스템."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는 침입 감지 센서의 감지신호에 기초하여 침입으로 판단되면, 상기 위치추적 처리 모듈을동작시켜, 상기 저장부에 저장된 출입가능자 이동 단말의 현재 위치에 대해 상기 위치 정보 제공 서버에 요청및 수신하여 상기 저장부에 저장하고, 상기 위치 정보 제공 서버로부터 전송된 위치 정보에 기초하여 출입가능자 이동 단말의 위치가 모두 사용자 집 외부인 경우 침입으로 판단하고, 위험상황 메시지를 형성하여 원격의 보안센터로 전송하는 것인, 가정용 통신 장치를 이용한 사용자 보안 시스템."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 AI 스피커는 카메라부와 인체 감지 센서를 더 포함하고, 상기 저장부는 상기 카메라부가 촬영한 촬영 이미지에서 얼굴을 추출하여 얼굴을 인식하는 얼굴 인식 처리 모듈을 더 포함하며,상기 AI 스피커는 외출 모드 또는 취침 모드로 설정되며, 상기 외출 모드시 상기 제어부는 상기 침입 감지 장치로부터 침입 감지 신호를 수신하고 상기 AI 스피커의 주변에서 상기 인체 감지 센서가 인체를 감지하면 상기 카공개특허 10-2021-0015304-3-메라부를 동작시켜서 인체를 촬영하여 얼굴 이미지를 추출하여 상기 저장부에 저장하고, 추출한 얼굴 이미지를미리 저장된 가족/지인을 포함한 출입가능자의 이미지와 비교하며, 출입가능자가 아닌 경우 위험 상황 메시지를형성하여 원격의 보안센터에 전송하는 것을 특징으로 하는 가정용 통신 장치를 이용한 사용자 보안 시스템."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 AI 스피커는 상기 외출 모드시 상기 침입 감지 장치로부터 침입 감지 신호를 수신하면, 추출한 침입자 얼굴 이미지를 포함한 위험 상황 메시지를 형성하여 사용자 이동 단말에 전송하는 것을 특징으로 하는 가정용 통신 장치를 이용한 사용자 보안 시스템."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 침입 감지 센서는, 일정 거리 이내로 접근시 침입 감지 신호를 발생하는 근접 센서, 일정 이상의 중량을감지시 침입 감지 신호를 발생하는 중량 센서, 적외선 센서 중 어느 하나를 포함하는 것인, 가정용 통신 장치를이용한 사용자 보안 시스템."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항 또는 제4항에 있어서,상기 AI 스피커와 네트워크를 통해 연결되는 보안 서비스 제공 서버를 더 포함하며,상기 보안 서비스 제공 서버는 가족/지인을 포함한 출입 가능자의 이동 단말 번호 또는 출입 가능자의 사진 이미지를 서버에 등록하기 위한 웹서비스 또는 앱서비스를 제공하고;상기 보안 서비스 제공 서버는, 웹서비스 또는 앱서비스를 통해 등록한 출입 가능자의 이동 단말 번호와 출입가능자의 사진 이미지를 상기 AI 스피커에 전송하여 저장하게 하고, 상기 AI 스피커가 상기 카메라부로 촬영한 영상 데이터와, 침입 감지 발생시 촬영한 영상 데이터에서 추출한 얼굴 이미지를 전송받아 저장하는 것인, 가정용 통신 장치를 이용한 사용자 보안 시스템."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "가정용 통신 장치를 이용한 사용자 보안 방법으로서,사용자 댁의 창문 또는 현관문에 설치된 침입 감지 장치가 외부인의 침입을 감지하면 침입 감지 신호를 전송하는 제1단계;가정용 통신 장치가 상기 침입 감지 장치로부터 침입 감지 신호를 수신하면, 위치 정보 제공 서버에 접속하여미리 저장된 가족/지인을 포함한 출입 가능자의 이동 단말의 위치 정보를 요청 및 수신하는 제2단계;상기 가정용 통신 장치는, 상기 출입 가능자 이동 단말이 모두 사용자의 집 외부에 위치하면, 위험 상황으로 판단하고 위험 상황 메시지를 형성하여 보안 센터에 전송하는 제3단계를 포함하는 것을 특징으로 하는 가정용 통신 장치를 이용한 사용자 보안 방법."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 제2단계는 상기 가정용 통신 장치가 상기 침입 감지 장치로부터 침입 감지 신호를 수신하면, 상기 가정용통신 장치의 주변에서 인체 감지 센서를 통해 인체를 감지하는 단계;상기 가정용 통신 장치가 인체를 감지하면, 카메라부를 동작시켜서 인체를 촬영하여 저장하는 단계를 포함하는것을 특징으로 하는 가정용 통신 장치를 이용한 사용자 보안 방법."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,공개특허 10-2021-0015304-4-상기 가정용 통신 장치가 상기 촬영한 인체의 이미지에서 얼굴 이미지를 추출하는 단계; 상기 가정용 통신 장치가 추출한 얼굴 이미지를 미리 저장된 가족/지인을 포함한 출입가능자의 이미지와 비교하여 출입가능자인지 판단하는 단계; 및상기 판단결과 출입가능자가 아닌 경우 추출한 얼굴 이미지를 포함한 위험 상황 메시지를 형성하여 원격의 보안센터에 전송하는 단계를 더 포함하는 것을 특징으로 하는 가정용 통신 장치를 이용한 사용자 보안 방법."}
{"patent_id": "10-2019-0093943", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항 또는 제9항에 있어서,상기 가정용 통신 장치가 상기 촬영한 인체의 이미지에서 얼굴 이미지를 추출하는 단계; 상기 가정용 통신 장치가 추출한 얼굴 이미지를 포함한 위험 상황 메시지를 형성하여 사용자 이동 단말에 전송하는 단계를 더 포함하는 것을 특징으로 하는 가정용 통신 장치를 이용한 사용자 보안 방법."}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 가정용 통신 장치를 이용한 사용자 보안 시스템 및 방법에 관한 것이다. 본 사용자 보안 시스템은, 사 용자 댁의 창문 또는 현관문에 설치되어 외부인의 침입을 감지하여 침입 감지 신호를 발생시키는 침입 감지 장치 와, 상기 침입 감지 장치로부터 침입 감지 신호를 수신하면 원격의 위치 정보 제공 서버에 접속하여 미리 저장된 (뒷면에 계속)"}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가정용 통신 장치를 이용한 사용자 보안 시스템 및 방법에 관한 것으로서, 보다 상세하게는 인공지능 스피커를 포함한 가정용 통신 장치를 이용한 사용자 보안 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "AI 비서 기능을 하는 스피커가 한국공개특허 제10-2015-0047803호에 공개되어 있다. 이러한 종래의 기술은 사람 과 교감할 수 있는 인공지능 오디오 장치에 관한 것으로, 보다 상세하게는, 사람의 존재를 판단하여 현재 시간 과 주위 환경에 맞는 인사말을 건네고, 음악재생 여부를 물어보고 음악재생 요청이 있을 경우 현재시간, 주위 환경 및 분위기에 맞는 음악을 선곡하여 들려주고 특정 음악의 청취 시 청취 음악의 성향에 맞는 조명을 조정하 여 분위기를 만들어 줄 수 있게 한다. 또한, 근래, 인공지능 분야, 특히 자연어 이해 분야의 기술 발전에 따라, 전통적인 기계 중심의 명령 입출력 방 식에 따른 기계 조작에서 벗어나, 사용자로 하여금, 보다 사람 친화적인 방식, 예컨대 음성 및/또는 텍스트 형 태의 자연어를 매개로 한 대화 방식으로 기계를 조작하고 기계로부터 원하는 서비스를 얻을 수 있도록 하는 대 화형 AI 에이전트 시스템의 개발 및 활용이 점차 늘어나고 있다. 그에 따라, 온라인 상담 센터나 온라인 쇼핑몰 등을 비롯한 다양한 분야에서, 사용자는 음성 및/또는 텍스트 형태의 자연어 대화를 통해, 대화형 AI 에이전트 시스템에게 원하는 서비스를 요청하고 그로부터 원하는 결과를 얻을 수 있게 되었다. 대화형 AI 에이전트 시스템은, 각 사용자에 관한 정보(예컨대, 사용자의 개인 정보, 이력 정보 등)를 수집 및/ 또는 관리하고, 수집 및 관리되는 각 사용자에 관한 정보에 기초하여 각 사용자에 맞는 적합한 서비스를 제공하 고 있다. 한편, 단독주택이나 아파트 등 공공주택에서 장시간 외출이나 휴가로 집을 비워 놓아 집안에 아무도 없는 경우, 택배 회사직원이나 전기검침원을 가장한 절도범이 문밖의 초인종을 눌러 집안에 사람이 있는지 여부를 확인한 후 인기척이 없다고 판단되면 창문이나 현관문을 통하여 집안으로 침입하여 도둑질하는 경우가 빈번하게 발생하 고 있다. 이와 같이 집안에 아무도 없는 상태에서 절도행위가 진행되면 집주인이 집으로 돌아온 후에야 범행이 이루어진 상태를 확인할 수 있기 때문에 예방과 경찰에의 신고 등 즉각적인 대처가 불가능하다는 문제가 있다. 또한, 맞벌이 부부의 집이나, 혼자 거주하는 여성 직장인의 집은 오전부터 저녁까지 오랜시간 동안 비어있는 경 우가 많아 도둑이 침입할 수 있고, 밤에 취침하는 동안에 도둑이나 강도가 침입하는 경우 및 집에 사람이 있는 상태에서 강도가 드는 경우와 같은 다양한 위험한 상황이 발생할 수 있다. 따라서, 창문이나 현관문을 통해 침입자가 있는 경우, 상술한 AI스피커를 이용하여, 위급 상황에 즉각적으로 대"}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "처할 수 있도록 AI 스피커가 자동으로 외부 경찰서나 구조센터에 알릴 수 있는 방법이 필요하다.발명의 내용"}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상기한 문제점을 해결하기 위해 창안된 것으로, 사용자가외출하여 집이 비워져 있을 때 출입 가능자인지 확인하여 출입가능자가 아니면 도둑이나 강도로 판단하여 즉각 외부의 사용자 이동 단말에 알리거나 직접 외부의 보안센터에 알릴 수 있는 가정용 통신 장치를 이용한 사용자 보안 시스템 및 그 방법을 제공하는 것이다. 또한, 본 발명은 사용자가 집안에서 취침을 취하고 있을 때 출입가능자인지 확인하여 출입가능자가 아니면 즉각 위험 상황을 외부 보안 센터에 알릴 수 있는 가정용 통신 장치를 이용한 사용자 보안 시스템 및 그 방법을 제공 하는 것이다."}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위한 본 발명의 제1양태에 따른 구성은, 가정용 통신 장치를 이용한 사용자 보안 시스 템으로서, 사용자 댁의 창문 또는 현관문에 설치되어 외부인의 침입을 감지하여 침입 감지 신호를 발생시키는 침입 감지 장치와, 상기 침입 감지 장치로부터 침입 감지 신호를 수신하면 원격의 위치 정보 제공 서버에 접속 하여 미리 저장된 가족/지인을 포함한 출입 가능자의 이동 단말의 GPS 위치 정보를 요청 및 수신하고, 상기 출 입 가능자의 이동 단말이 모두 사용자의 집 외부에 위치하면, 위험 상황으로 판단하고 위험 상황 메시지를 형성 하여 원격의 보안 센터에 전송하는 가정용 통신 장치와, 네트워크를 통해 상기 가정용 통신 장치와 연결되어 위 험 상황 메시지를 전송한 AI 스피커가 위치하는 주소를 파악하여 경찰 출동을 요청하는 보안 센터와, 상기 네트 워크를 통한 상기 가정용 통신 장치의 요청에 따라 적어도 하나의 이동 단말의 위치 정보를 제공하는 위치 정보 제공 서버를 포함하는 것을 특징으로 한다. 여기서, 상기 침입 감지 장치는 사용자 댁의 창문 또는 현관문에 설치되어 외부인의 침입을 감지하는 침입 감지 센서, 상기 침입 감지 센서의 침입 감지 신호를 전송하는 근거리부 통신부를 포함하고, 상기 가정용 통신 장치 는 AI 스피커를 포함하고, 상기 AI 스피커는, 인체감지 센서, 마이크, 키입력부, 저장부, 상기 침입 감지 장치 와 통신을 위한 근거리 통신부, 원격의 보안 센터와 통신을 위한 무선 통신부 및, 이들 장치들을 제어하는 제어 부를 포함하는 것이 바람직하다. 그리고, 상기 저장부에는 사용자가 등록한 출입가능자의 이동 단말의 전화번호 와, 출입가능자의 얼굴 사진 이미지와, 지도 데이터베이스와, 상기 마이크로 입력되는 음성을 인식하는 음성 인 식 처리 모듈, 상기 출입가능자의 이동 단말의 위치를 요청 및 수신하여 처리하는 위치 추적 처리 모듈이 저장 되는 것이 바람직하다. 또한, 상기 제어부는 침입 감지 센서의 감지신호에 기초하여 침입으로 판단되면, 상기 위치추적 처리 모듈을 동 작시켜, 상기 저장부에 저장된 출입가능자 이동 단말의 현재 위치에 대해 상기 위치 정보 제공 서버에 요청 및 수신하여 상기 저장부에 저장하고, 상기 위치 정보 제공 서버로부터 전송된 위치 정보에 기초하여 출입가능자 이동 단말의 위치가 모두 사용자 집 외부인 경우 침입으로 판단하고, 위험상황 메시지를 형성하여 원격의 보안 센터로 전송하는 것이 바람직하다. 상기 가정용 통신 장치는 카메라부와 인체 감지 센서를 더 포함하고, 상기 저장부는 상기 카메라부가 촬영한 촬 영 이미지에서 얼굴을 추출하여 얼굴을 인식하는 얼굴 인식 처리 모듈을 더 포함하며, 상기 가정용 통신 장치는 외출 모드 또는 취침 모드로 설정되며, 상기 외출 모드시 상기 제어부는 상기 침입 감지 장치로부터 침입 감지 신호를 수신하고 상기 가정용 통신 장치의 주변에서 상기 인체 감지 센서가 인체를 감지하면 상기 카메라부를 동작시켜서 인체를 촬영하여 얼굴 이미지를 추출하여 상기 저장부에 저장하고, 추출한 얼굴 이미지를 미리 저장 된 가족/지인을 포함한 출입가능자의 이미지와 비교하며, 출입가능자가 아닌 경우 위험 상황 메시지를 형성하여 원격의 보안센터에 전송하는 것이 바람직하다. 이에 의해, 원격의 보안센터가 가정에 침입자가 있는 것을 신속 하게 알게 되어 대처할 수 있게 된다. 상기 가정용 통신 장치는 상기 외출 모드시 상기 침입 감지 장치로부터 침입 감지 신호를 수신하면, 추출한 침 입자 얼굴 이미지를 포함한 위험 상황 메시지를 형성하여 사용자 이동 단말에 전송하는 것이 바람직하다. 이에 의해, 사용자 이동 단말이 위험 상황 메시지를 통해, 침입자가 있는 것을 파악하여 경찰 등 보안센터에 연락하 여 신속하게 대처할 수 있게 된다. 상기 침입 감지 센서는, 일정 거리 이내로 접근시 침입 감지 신호를 발생하는 근접 센서, 일정 이상의 중량을 감지시 침입 감지 신호를 발생하는 중량 센서, 적외선 센서 중 어느 하나를 포함하는 것이 바람직하다. 상기 가정용 통신 장치와 네트워크를 통해 연결되는 보안 서비스 제공 서버를 더 포함하며, 상기 보안 서비스 제공 서버는 가족/지인을 포함한 출입 가능자의 이동 단말 번호 또는 출입 가능자의 사진 이미지를 서버에 등록 하기 위한 웹서비스 또는 앱서비스를 제공하고; 상기 보안 서비스 제공 서버는, 웹서비스 또는 앱서비스를 통해 등록한 출입 가능자의 이동 단말 번호와 출입 가능자의 사진 이미지를 상기 가정용 통신 장치에 전송하여 저장 하게 하고, 상기 가정용 통신 장치가 상기 카메라부로 촬영한 영상 데이터와, 침입 감지 발생시 촬영한 영상 데 이터에서 추출한 얼굴 이미지를 전송받아 저장하는 것이 바람직하다. 상기의 목적을 달성하기 위한 본 발명의 제2양태에 따른 구성은, 가정용 통신 장치를 이용한 사용자 보안 방법 으로서, 사용자 댁의 창문 또는 현관문에 설치된 침입 감지 장치가 외부인의 침입을 감지하면 침입 감지 신호를 전송하는 제1단계; 가정용 통신 장치가 상기 침입 감지 장치로부터 침입 감지 신호를 수신하면, 위치 정보 제공 서버에 접속하여 미리 저장된 가족/지인을 포함한 출입 가능자의 이동 단말의 위치 정보를 요청 및 수신하는 제 2단계; 상기 가정용 통신 장치가, 상기 출입 가능자 이동 단말의 위치가 모두 사용자의 집 외부에 위치하면, 위 험 상황으로 판단하고 위험 상황 메시지를 형성하여 보안 센터에 전송하는 제3단계를 포함하는 것을 특징으로 한다. 여기서, 상기 제2단계는 상기 가정용 통신 장치가 상기 침입 감지 장치로부터 침입 감지 신호를 수신하면, 상기 가정용 통신 장치의 주변에서 인체 감지 센서를 통해 인체를 감지하는 단계, 인체를 감지하면, 상기 가정용 통 신 장치가 카메라부를 동작시켜서 인체를 촬영하여 저장하는 단계를 포함하는 것이 바람직하다. 또한, 상기 촬영한 인체 이미지에서 얼굴 이미지를 추출하는 단계; 추출한 얼굴 이미지를 미리 저장된 가족/지 인을 포함한 출입가능자의 이미지와 비교하여 출입가능자인지 판단하는 단계; 및 상기 판단결과 출입가능자가 아닌 경우 추출한 얼굴 이미지를 포함한 위험 상황 메시지를 형성하여 원격의 보안센터에 전송하는 단계를 더 포함하는 것이 바람직하다. 이에 의해, 원격의 보안센터가 가정에 침입자가 있는 것을 신속하게 알게 되어 대처 할 수 있게 된다. 또한, 상기 가정용 통신 장치가 상기 촬영한 인체의 이미지에서 얼굴 이미지를 추출하는 단계; 상기 가정용 통 신 장치가 추출한 얼굴 이미지를 포함한 위험 상황 메시지를 형성하여 사용자 이동 단말에 전송하는 단계를 더 포함하는 것이 바람직하다. 이에 의해, 사용자 이동 단말이 위험 상황 메시지를 통해, 침입자가 있는 것을 파악 하여 경찰 등 보안센터에 연락하여 신속하게 대처할 수 있게 된다."}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기의 구성으로 이루어진 가정용 통신 장치를 이용한 사용자 보안 시스템 및 방법에 따르면, 사용자가 외출한 상태일 때 집으로 침입한 사람이 출입가능자인지 확인하여 출입가능자가 아니면 도둑이나 강도로 판단하여 즉각 외부의 사용자 이동 단말에 알리거나 직접 외부의 보안 센터에 알려서 위기 상황에 대처할 수 있다. 또한, 사용자가 집안에서 취침을 취하고 있을 때, 집으로 침입한 사람이 출입가능자인지 확인하여 출입가능자가 아니면 즉각 위험 상황을 외부 보안 센터에 알려서 위기 상황에 대처할 수 있다."}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예 들을 통해 설명될 것이다. 그러나 본 발명은 여기에서 설명되는 실시예들에 한정되지 않고 다른 형태로 구체화"}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "될 수도 있다. 단지, 본 실시예들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 본 발명의 기술 적 사상을 용이하게 실시할 수 있을 정도로 상세히 설명하기 위하여 제공되는 것이다.도면들에 있어서, 본 발명의 실시예들은 도시된 특정 형태로 제한되는 것이 아니며 명확성을 기하기 위하여 과 장된 것이다. 또한, 명세서 전체에 걸쳐서 동일한 참조번호로 표시된 부분들은 동일한 구성요소를 나타낸다. 본 명세서에서 \"및/또는\"이란 표현은 전후에 나열된 구성요소들 중 적어도 하나를 포함하는 의미로 사용된다. 또한, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 또한, 명세서에서 사용되는 \"포함한다\" 또는 \"포함하는\"으로 언급된 구성요소, 단계, 동작 및 소자는 하나 이상의 다른 구성요소, 단계, 동작, 소자 및 장치의 존재 또는 추가를 의미한다. 본 발명은 거주자가 집을 비운 외출 중일 때 또는 거주자가 취침중일 때 도둑 등의 침입자가 들어온 것을 가정 용 통신 장치인 AI스피커가 감지하여 위험 상황을 보안 센터에 알리는 것이다. 이를 위해, 본 발명에 따른 가정용 통신 장치로서 AI 스피커는 외출 모드와 취침 모드로 설정된다. 외출 모드 또는 취침 모드시에 AI 스피커는 창문 또는 현관문에 설치된 침입 감지 센서로부터 침입 감지 신호가 수신되면, 출입가능자인지 확인하여 출입가능자가 아니면 위험 상황 메시지를 형성하여 외부의 보안 센터 또는 사용자 이 동 단말에 전송한다. 이하에서, 본 발명의 바람직한 실시 예가 첨부된 도면들을 참조하여 본 발명을 구체적으로 설명한다. 본 발명을 설명함에 있어서 관련된 공지기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있 다고 판단되는 경우에는 그 상세한 설명을 생략한다. 도 1은 본 발명의 일실시예에 따른 가정용 통신 장치인 AI스피커를 이용한 사용자 보안 시스템의 구성도이다. 도 1에 보인 바와 같이, AI스피커를 이용한 사용자 보안 시스템은 창문 또는 현관문에 설치되어 외부에서의 침 입을 감지하여 침입 감지 신호를 발생시키는 침입 감지 장치, 침입 감지 장치와 근거리 통신하는 AI스 피커, AI스피커가 네트워크를 통해 접속하는 보안서비스 제공 서버, AI스피커의 요청에 따 라 이동 단말의 위치정보를 제공하는 위치 정보 제공 서버로서 LBS위치 서버, AI스피커가 네트워크(3 0)를 통해 송신하는 위험상황 메시지를 수신하는 사용자 이동 단말, AI스피커가 네트워크를 통해 송신하는 위험상황 메시지를 수신하여 보안 또는 위험 상황에 조치를 취하는 보안 센터를 포함한다. AI 스피커는 창문 또는 현관문에 설치된 침입 감지 장치로부터 침입 감지 신호가 수신되면, 출입가능자 의 이동 단말의 LBS위치 정보를 이용하여, 출입가능자인지 여부를 확인하여 출입가능자가 아니면 위험 상황 메 시지를 형성하여 외부의 보안 센터 또는 사용자 이동 단말에 전송한다. AI 스피커는 외출 모드 또는 취침 모드로 설정될 수 있다. AI 스피커는 외출 모드시 침입 감지 장치로 부터 침입 감지 신호를 수신하고 AI 스피커의 주변에서 인체를 감지하면 인체를 촬영하여 얼굴 이미지를 추출하 고, 추출한 얼굴 이미지를 미리 저장된 가족/지인을 포함한 출입가능자의 이미지와 비교하며, 출입가능자가 아 닌 경우, 추출한 얼굴 이미지가 포함된 위험 상황 메시지를 형성하여 외부의 보안 센터 또는 사용자 이동 단말에 전송한다. AI 스피커는 주변의 인체를 촬영하여 추출한 인체의 얼굴 이미지가 마스크 등으로 가려져 얼굴을 확인할 수 없는 경우, 출입가능자의 이동 단말의 LBS위치 정보를 이용하여, 출입가능자인지 여부를 확인하여 출입가능자가 아니면 위험 상황 메시지를 형성하여 외부의 보안 센터 또는 사용자 이동 단말에 전송할 수도 있다. 여기서, 위험 상황 메시지에는 AI스피커가 위치한 집의 식별정보(예를 들어, 집주소), AI 스피커가 추출한 얼굴 이미지 등이 포함될 수 있다. 사용자 이동 단말과, 보안 센터는 위험 상황 메시지를 수신하면, 경찰서 등에 요청하여 대처한다. 한편, 사용자 이동 단말은 AI스피커로부터 전송된 위험 상황 메시지에 포함된 침입자의 얼굴 이미지를 보고 사용자가 직접 확인한 결과에 따라 침입자가 아닌 경우, 사용자의 입력에 의해 위험 상황 해제 메시지를 형성하여, AI 스피커로 전송할 수도 있다. 도 2는 도 1의 AI스피커와 침입 감지 장치의 내부 구성도이다. 도 2에 보인 바와 같이, 침입 감지 장치 는 창문 또는 현관문에 설치되어 침입 여부를 감지하는 침입 감지 센서와, 침입 감지 센서가 감지 한 감지신호를 무선 통신을 통해 AI스피커로 전송하는 근거리 통신부를 포함한다. 침입 감지 센서는, 근접 센서, 중량 센서, 적외선 센서를 포함할 수 있다. 근접 센서는, 창틀(또는 현관문 틀)에 설치되며, 창문(또는 현관문)이 배치되는 영역으로 외부 침입자가 일정 거리 이내로 접근하면, 침입 감지 신호를 발생시킨다. 중량 센서는 창틀(또는 현관문 틀)에서 일정 이상의 중량을 감지하면, 침입 감지 신호를 발생시킨다. 적외선 센서는, 창문이 배치되는 영역과, 창틀(또는 현관문 틀)에서 인체에 대한 적외선 신호를 일정 이상의 시 간 동안 감지되면, 침입 감지 신호를 발생시킨다. 또한, 침입 감지 센서는, 창문(또는 현관문)의 이동에 따른 자성변화를 감지하여 창문(또는 현관문)의 움직 임을 감지할 수 있다. 이를 위해, 닫힘 및 열림상태의 전환에 따라 자성변화를 일으키는 적어도 하나의 자석이 부착되는 창문(또는 현관문), 창문틀(또는 현관문틀)에 자석과 대응되도록 배치되어 자성변화를 감지하도록 형 성되는 센서부를 포함할 수 있다. AI 스피커는 도 2에 보인 바와 같이, 인체를 감지하는 인체 감지 센서, 카메라부, 마이크, 키 입력부, 스피커부, 침입 감지 장치로부터 전송된 감지신호를 수신하는 근거리 통신부, 원격의 서버와 통신을 위한 유무선통신부, 저장부, 본 발명에 따른 기능을 수행하기 위해 각 구성요소의 동작 을 제어하는 제어부를 포함한다. 인체 감지 센서는 인체를 감지하는 적외선 센서 또는 열센서로 구현될 수 있다. 적외선 센서는 초전체 센서 (Pyroelectric Sensor)로 구현될 수 있다. 초전체 센서는 적외선을 방출하는 사람과 동물을 센싱하며, 움직임이 발생하는 순간 출력을 발생한다. 한편, 인체 감지 센서는 카메라부로도 구현될 수 있다. 카메라부는 광신호를 비디오 신호를 변환하 여 영상을 촬영하는 것으로, 카메라 모듈로 구성된다. 카메라 모듈은 이미지 센서에 의해 얻어지는 정지영상 또 는 동영상 등의 화상 프레임을 처리하여 제어부로 전송한다. 제어부는 전송된 화상 프레임을 저장부에 미리 저장된 사람 유무 감지를 위한 기준영상, 예컨대, 배경화면과 비교하여 상이한 부분을 추출한 다음 상이한 부분을 미리 저장된 인물영상과 비교하는 것 등과 같은 공지의 방법으로 사람의 유무를 판단할 수 있다. 키입력부는 일반적인 AI 기능을 수행시키기 위한 기능 버튼(미도시)과, 본 발명에 따라, 출입가능자의 전화 번호를 입력하거나 스피커 음량을 조절하기 위한 조작 버튼(미도시)을 포함한다. 또한, 키입력부는 사용자 가 외출할 때 선택하는 외출 모드, 수면에 취할 때 선택하는 취침 모드로 설정하기 위한 설정 버튼(미도시)을 포함한다. 저장부에는 본 발명에 따라, 사용자의 가족 또는 지인을 포함한 출입가능자의 이동단말의 전화번호가 저장 된다. 또한, 저장부에는 사용자의 가족 또는 지인을 포함한 출입가능자의 얼굴 이미지와, 카메라부가 작동되어 촬영한 이미지가 저장될 수 있다. 또한, 본 발명의 부가적인 기능으로서, 저장부에는 외부에 위치한 사용자 이동 단말이 보안 서버에 등록한 택배 배송 정보가 AI스피커로 전송되어 제어부에 의해 저장될 수 있다. 저장부는, 제어부의 처리 및 제어를 위한 프로그램을 저장할 수도 있고, 입/출력되는 데이터들(예컨대, 정지 영상, 동영상 등)을 저장할 수도 있다. 저장부에 저장된 프로그램들은 그 기능에 따라 복수 개의 모듈들로 분류할 수 있다. 본 발명에 따라, 저장부에는 상술한 제어부의 제어기능을 수행하기 위해, 음성 인식 처리 모듈(28a), 얼굴 인식 처리 모듈(28b), 출입가능자 이동 단말의 위치를 추적하는 위치추적 처리 모듈(28c)이 저장된다. 위치추적 처리 모듈(28c)은 도 1의 원격의 LBS 서버에 접속하여, 저장부에 미리 저장된 출입 가능자(가 족 또는 지인)의 이동 단말 번호에 기초하여, 이동 단말의 위치 추적을 요청하여 위치 정보를 제공받는 처리를 수행한다. 이 위치 정보는 외출 모드 또는 취침 모드시에 집안에서 인체가 감지된 경우, 집안에 침입한 사람이 출입가능자인지 침입자인지 판단하기 위한 정보로 이용된다. 음성 인식 처리 모듈(28a)은 마이크로 입력되는 사용자 음성을 입력받아 인식하는 기능을 한다. 도 2의 사"}
{"patent_id": "10-2019-0093943", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "용자의 음성을 인식하여 각종 기능을 수행하기 위한 음성 인식 처리 모듈은, 일반적인 AI스피커 기술분야에서 일반적인 공지 기술이므로 상세한 설명은 생략한다. 따라서, 본 발명의 부가적인 기능으로서, 음성 인식 처리 모듈(28a)은 응급 상황 또는 구조 요청을 표시하는 음 성을 인식하도록 할 수 있다. 또한, 구조요청을 표시하는 음성을 인식하여 외부의 구조 센터에 위험 상황을 알 리는 기술은 공지 기술이므로 상세한 설명은 생략한다. 얼굴 인식 처리 모듈(28b)은 카메라부에서 촬영된 영상 이미지에서 얼굴 부분을 인식하여 추출한다. 저장부는 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모 리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro- SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 또 는 메모리 스틱(memory stick) 등을 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 AI스피커와 기 능적으로 및/또는 물리적으로 연결될 수 있다. AI 스피커가 취침 모드로 또는 외출 모드로 설정되어 있는 경우, 제어부는 침입 감지 센서의 감지 신호에 기초하여 침입으로 판단되면, 저장부의 위치추적 처리 모듈(28c)을 동작시켜, 저장부에 저장된 출입가능자 이동 단말을 위치추적하여 저장부에 임시 저장하고, 출입가능자 이동 단말의 위치가 모두 사용 자 집이 아닌 경우 침입으로 판단하고, 위험상황 메시지를 형성하여 유무선통신부를 통해 원격의 보안 센터 로 전송한다. 또한, 다른 실시예에 따라, AI 스피커가 외출 모드로 설정되어 있는 경우, 제어부는 침입 감지 장치 로부터 침입 감지 신호를 수신하고, 인체감지 센서가 인체를 감지하면, 카메라부를 동작시켜 침입 자를 촬영하게 한다. 그리고, 제어부는 저장부의 얼굴 인식 처리 모듈(28b)을 동작시켜 카메라부가 촬영한 영상에서 침입자의 얼굴을 추출하고 저장부에 미리 저장된 출입가능자의 사진 이미지와 비교한다. 그리고, 제어부는 비교결과 인식한 얼굴이 출입가능자가 아닌 것으로 판단되면 위험상황 메시지를 형성하여 유무선통신부를 통해 원격의 보안 센터로 전송하거나 외부에 있는 집주인의 이동 단말로 전송하여 알린다. 제어부는 근거리 통신부를 통해 사용자 이동 단말과 블루투스 통신과 같은 근거리 통신을 수행하여 출입가능자의 사진 이미지를 송수신하여 저장부에 저장할 수 있다. 또한, 제어부는 유무선 통신부 를 통해 원격의 보안 서비스 제공 서버로부터 출입 가능자의 사진 이미지를 다운로드 받아 저장할 수 있다. 이를 위해, 보안 서비스 제공 서버는, 사용자 이동 단말이 접속하여 출입가능자의 이동 단말의 전화번 호와 출입가능자의 사진 이미지를 등록할 수 있는 웹서비스 또는 앱서비스를 사용자 이동 단말에 제공할 수 있다. 또한, 보안 서비스 제공 서버는, AI 스피커가 외출 모드 또는 취침 모드인 경우 인체 감지 센서가 인체를 감지한 경우, 카메라부로 촬영한 촬영 이미지 또는 동영상 데이터를 AI 스피커로부터 전송받아 저장할 수 있다. 한편, 보안 서비스 제공 서버는 사용자 이동 단말이 웹서비스 또는 앱서비스를 통해 당일 택배가 배송 될 거라는 택배 배송 정보를 등록하면, 이 택배 배송 정보를 AI스피커에 전송하여 저장하게 함으로써, 택배 배송 기사의 방문시 택배배송 기사의 음성(예를 들어, 택배 왔습니다)에 자동 응답하도록 할 수 있다. 음성 내용을 인식하여 대응하는 AI 스피커의 구체적인 기술 구성은, 공지된 기술이므로 상세한 설명을 생략한다. 위치추적 처리 모듈(28c)은 유무선 통신부를 통해 외부의 LBS 위치서버에 미리 저장된 출입가능자의 이 동 단말의 위치 정보를 요청 및 수신하는 기능을 한다. 여기서, LBS 위치서버가 이동 단말을 위치추적하여 위치 정보를 제공하는 것은 공지된 기술이므로 상세한 설명은 생략한다. 도 3은 본 발명의 일실시예에 따른 AI스피커를 이용한 사용자 보안 방법의 순서도이다. 도 3에 보인 바와 같이, 침입 감지 장치가 창문 또는 현관문을 통한 침입을 감지한다(S1). AI 스피커가 침입 감지 장치로부 터 제공되는 감지 신호를 수신한다(S2). AI 스피커의 인체 감지 센서가 인체를 감지한 경우(S3), AI 스피커의 제어부는 LBS위치 서버 에 접속하여, 미리 저장된 출입가능자의 이동 단말의 번호에 대해 이동 단말의 위치를 요청하여 수신한다 (S4). 그리고, AI 스피커는 수신한 이동 단말의 위치 정보에 기초하여, 출입가능자의 이동 단말의 위치가 모두 집 외부에 있는지 판단한다(S5). 이때, AI 스피커가 외출 모드로 설정되어 있으면(S6), AI 스피커의 제어부는 출입가능자의 이동 단말의 위치가 모두 집 외부라고 판단되면, 집주인 이동 단말로 침입 감지 메시지를 전송한다(S8). 그리고, AI 스피커 의 제어부는 위험 상황 메시지를 형성하여 유무선 통신부를 통해 원격의 보안 센터에 전송한다 (S9). 한편, AI 스피커가 취침 모드로 설정되어 있으면(S7), AI 스피커의 제어부는 위험 상황 메시지를 형성 하여 유무선 통신부를 통해 원격의 보안 센터에 전송한다(S9). 이때, 보안 센터는 위험 상황 메시지에 대해 경찰서 등에 연락하여 출동을 요청한다. 상술한 실시예는, 사용자가 외출한 상태일 경우 또는, 집안에서 취침하거나 활동하고 있는 상태일 때를 포함한 어떤 상황에서도 출입가능자가 아닌 침입자가 있는 경우에, 이를 감지하여 보안 센터에 위험 상황을 알릴 수 있다. 도 4는 본 발명의 제2실시예에 따른 AI스피커를 이용한 사용자 보안 방법의 순서도이다. 도 4에 보인 바와 같이, AI 스피커가 외출 모드로 설정되어 있는 경우(T1), 침입 감지 장치가 창문 또는 현관문의 침입을 감 지하고(T2), 침입 감지 센서가 침입 감지 신호를 형성하여 AI 스피커로 전송한다. AI 스피커가 침입 감지 장치로부터 제공되는 감지 신호를 수신하고(T3), AI 스피커의 인체 감지 센서가 인체를 감지한 경우(T4), 카메라부를 동작시켜 인체를 촬영하여 저장부에 저장한다. AI 스피커의 제어부가 촬영한 인체에서 얼굴이 인식가능한지 판단한다(T6). 판단결과 얼굴이 인식가능 하면, AI스피커의 제어부가 촬영 이미지에서 얼굴을 추출하여(T7), 저장부에 미리 저장된 출입가능자의 얼굴 이미지와 비교한다(T8). AI 스피커의 제어부)는 비교결과 출입가능자가 아닌 경우 위험상황 메시지를 형성하여 유무선 통신부를 통해 원격의 보안 센터에 전송한다. 이때, 제어부가 위험 상황 메시지를 전송시 추출한 침입자의 얼굴 이미지를 첨부하여 전송하는 것이 바람직 하다. 보안 센터는 위험 상황 메시지에 대해 경찰서 등에 연락하여 출동을 요청한다. 한편, AI 스피커의 제어부는 얼굴의 인식이 불가능하면, 촬영한 인체 사진이 첨부된 침입 감지 메시지를 유 무선 통신부를 통해 집주인의 이동 단말로 전송한다(T11). 집주인 이동 단말이 침입 감지 메시지를 수신하여, 인체 사진의 얼굴을 직접 확인하여(T12), 출입 가능자인 지 판단하다(T13), 판단결과 출입 가능자이면, 위험상황 해제 신호를 AI스피커로 전송한다(T14). 상기 판단결과, 출입 가능자가 아니라 침입자로 판단되면 위험 상황 메시지를 보안 센터에 전송한다. 한편, 도 5는 본 발명의 제3실시예에 따른 AI 스피커를 이용한 보안 방법의 순서도이다. 도 5의 제3실시예에 대 한 설명에서, 도 4의 구성과 중복되는 설명은 생략한다. T6단계에서, 얼굴의 인식이 불가능하면, 도 5에 보인 바와 같이, AI 스피커의 제어부는 LBS위치 서버에 접속하여, 미리 저장된 출입가능자의 이동 단말의 위치를 요청하여 수신한다(T16). AI 스피커는 출입가능자 의 이동 단말의 위치 정보에 기초하여, 출입가능자가 모두 집 외부에 있는지 판단한다(T17). 판단결과 출입가능자의 이동 단말의 위치가 모두 집 외부에 있는 경우 AI 스피커의 제어부는 위험 상황으로 판단하고, 위험 상황 메시지를 형성하여 무선 통신부를 통해 원격의 보안 센터에 전송한다(T18). 이러한 구성에 의하여, AI스피커를 외출 모드로 설정하거나, AI스피커를 취침 모드로 설정한 경우, 창문 또는 현관문을 통해 침입자가 침입하면 이를 감지하여 외부의 보안 센터에 위험 상황 메시지를 전송하여, 도둑이나 강도가 침입했을 때 위험 상황에 즉각 대처할 수 있다. 또한, 사용자가 집안에 위치하고 있는, 일반 모드인 경우에도 AI스피커가 침입자가 침입한 경우, 침입자인지 판 단하여 외부의 구조 센터에 연락하도록 구현할 수 있음은 물론이다. 또한, 외출시 집안에 긴급 상황 또는 이상 상태가 발생했을 때 집안의 상황을 카메라 영상으로 전송받아 집안의 긴급 상황 및 이상 상태를 이동 단말을 통해서 확인할 수 있어 즉각적인 대처가 가능하게 된다. 상술한 실시예에서는, AI스피커를 외출 모드와 취침 모드로 구분하여, 침입 감지 신호에 대해 대응하는 구성으 로 설명하였으나, 집주인이 집안에 있는 동안에도 본 발명을 적용할 수 있음은 물론이다. 상술한 실시예에서는 가정용 통신 장치가 AI스피커인 것으로 서술하였으나, 카메라 촬영이 가능하고 근거리 및 원거리 통신이 가능하고, 가정용으로 사용할 수 있도록 제작된 보안 통신 장치로 구현할 수도 있음은 물론이다. 상기는 본 발명의 예시로서, 한정적으로 해석되어야 하는 것은 아니다. 본 발명의 몇 가지 예시적인 실시 형태 에 대해 설명했지만, 본 발명의 신규 교시 및 이점으로부터 현저하게 일탈하지 않고, 많은 변경이 예시적인 실 시 형태에 있어서 가능한 것을 당업자라면 용이하게 이해할 것이다. 따라서 모든 그러한 변경은 특허청구의 범 위에서 정의되는 본 발명의 범위 내에 포함되는 것이 의도된다. 따라서 상기가 본 발명의 예시이며, 공개된, 또 는 본 명세서에 공개되는 발명에 있어서 특정의 실시 형태에 한정되는 것으로서 해석되어서는 안 되며, 개시된 실시 형태로의 변경 및 다른 실시 형태가 본 명세서에 개시되는 발명의 범위 내에 포함되는 것이 의도되는 것을 이해해야 한다."}
{"patent_id": "10-2019-0093943", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 가정용 통신 장치로서 AI 스피커를 이용한 사용자 보안 시스템의 구성도, 도 2는 도 1의 AI 스피커 및 침입 감지 장치의 내부 구성도, 도 3은 본 발명의 제1실시예에 따른 AI 스피커를 이용한 사용자 보안 방법의 순서도, 도 4는 본 발명의 제2실시예에 따른 AI 스피커를 이용한 사용자 보안 방법의 순서도, 도 5는 본 발명의 제3실시예에 따른 AI 스피커를 이용한 사용자 보안 방법의 순서도이다."}
