{"patent_id": "10-2021-0180488", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0091404", "출원번호": "10-2021-0180488", "발명의 명칭": "설명 가능한 산업제어시스템 악성행위 탐지 기술 방법", "출원인": "호서대학교 산학협력단", "발명자": "이태진"}}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "Raw multidimentional time series data 층과, 3 layer stacked Bi-LSTM층과, Skip connection 층과, Output층과, 예측 오류계층(Predicton error layer)으로 구성되는 이상탐지 모델을 사용하는, 설명 가능한 산업제어시스템 악성행위 탐지 기술 방법에서,제어시스템 환경에서 수집된 HAI 21.03 학습데이터(1초 단위로 수집된) 특징을 정규화하는 단계 1과;학습데이터에서 timestep를 설정하고 설정된 timestep만큼 샘플링하여 입력데이터 및 출력데이터를 분리하는 단계 2와:학습데이터 기반 3 stacked Bi-LSTM 모델을 생성하는 단계 3과;HAI 21.03 테스트데이터 입력 시 학습데이터 정규화에 사용된 정보를 바탕으로 테스트데이터 특징을 정규화하는단계 4와;테스트데이터를 사용하여 학습된 3 stacked Bi-LSTM 모델기반 예측 값을 산출하는 단계 5와;예측값과 실제값의 평균 오차인 이상 스코어를 계산하고 사전 정의된 임계치(Threshold) 이상일 경우 이상(비정상)으로 판단하는 단계 6과;정상/비정상 시퀸스가 10초 미만일 경우 이전 라벨로 판단하여 오탐을 최소화하는(그레이 영역 스무딩) 단계 7과;높은 60-timestep와 낮은 10-timestep와 연계한 탐지 정책을 시행하는 단계 8과;학습된 3 stacked Bi-LSTM 모델에 한 개의 예측 오류(anomaly score)를 나타내는 방식으로 출력 노드의 예측 오류를 합산하는 출력 계층을 추가하는 단계 9와;추가된 stacked Bi-LSTM 모델을 사용하여 Gradient SHAP explainer를 생성하는 단계 10과; 그리고테스트 데이터와 사전에 생성된 explainer를 이용하여 테스트데이터의 특징별 기여도를 산출하는(SHAP value)단계 11로 구성되는 것을 특징으로 하는 설명 가능한 산업제어시스템 악성행위 탐지 기술 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,단계 11에서, 산출된 SHAP value는 입력 크기인 2차원(timestep, feature)이므로 특징별 절대값을 취한 후 더하여 특징별 기여도로 사용되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 단계 11에서 산출되어 정상/비정상(이상)으로 판단한 특징별 기여도를 시각화하는 단계 12를 더 포함하는것을 특징으로 하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,단계 2에서, 전체 2가지 모델 생성을 위해 높은 60-timestep와 낮은 10-timestep 사용하고, 60-timestep은 기준이 되는 모델을 생성하기 위한 것이고, 10-timesteps는 탐지율을 높이기 위한 하나의 방법론으로 기준 모델결과와 연계하여 이상(비정상)을 탐지할 때 사용하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2023-0091404-3-제2항에 있어서,단계 3에서, RNN의 장기 의존성 때문에 LSTM 모델을 채택하고, 정확한 학습을 위해 3층의 양방향 구조로 모델을설계하며, LSTM Cell 크기는 100으로 설정하며, 회귀(regression)방식으로 인해 dropout은 사용하지 않는 것을특징으로 하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서, 단계 3에서, 전체 특징이 복수 개이므로 샘플의 첫 번째 값은 학습 시 손실될 수 있어서 LSTm의 출력과 더하여출력하도록 구성되고, 손실 함수(loss function)는 MSE(Means Squared Error)를 사용하며, 최적화(Optimizer)는 Adam을 사용하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,단계 6에서, 평균 오차는 MAE(Means Absolute Error) 측정법을 사용하고, 산출된 이상 스코어는 하나의 시계열로 이전 10개의 평균값을 고려하여 예측 시점의 이상 스코어를 재산출하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,단계 8에서, 60-timestep 결과로 비정상 시작 지점을 탐지하며, 10-timestep 결과로 비정상 종료지점을 탐지하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,최근에 산출된 이상 스코어 평균값을 고려한 현재 시점의 이상 스코어를 재산출하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,테스트데이터 입력시 학습된 모델을 통해 예측된 값과 실제 값의 평균 절대오차(MAE)를 이용하는 것을 특징으로하는 방법."}
{"patent_id": "10-2021-0180488", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제2항에 있어서,이상 스코어가 특정 임계 이상일 경우 비정상으로 판단하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-0180488", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "설명 가능한 산업제어시스템 악성행위 탐지 기술 방법은, 제어시스템 환경에서 수집된 HAI 21.03 학습데이터(1초 단위로 수집된) 특징을 정규화하는 단계 1과, 학습데이터에서 timestep를 설정하고 설정된 timestep만큼 샘플링 하여 입력데이터 및 출력데이터를 분리하는 단계 2와, 학습데이터 기반 3 stacked Bi-LSTM 모델을 생성하는 단계 (뒷면에 계속)"}
{"patent_id": "10-2021-0180488", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기존 label이 없는 산업제어시스템 환경에서 AI 모델 기반 이상(비정상)징후를 탐지하고, 이상탐지 모델이 예측한 정상/비정상에 대한 설명과 해석을 제공하는, 설명 가능한 산업제어시스템 악성행위 탐지 기술 방법에 관한 것이다."}
{"patent_id": "10-2021-0180488", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "국가/기업 단위의 대규모 기반시설들의 운영에 가장 큰 역할을 하는 산업시스템은 지리적으로 원격으로 분산된 자산을 감시(Monitoring) 및 제어(Control)하기 위한 시스템이고 또한 전력 생산, 분배, 댐 운영, 가스 생산, 수자원 관리 및 원자력 발전 설비의 운영을 제어하고 관리하는 시스템이다.이와 같은 산업시스템은 과거에 비용과 편리성의 이유로 기존 제조사 자체 개발 운영체제를 마이크로소프트 윈 도우(Windows) 기반의 범용 운영체제로 변경하여 사용하고, 통신 프로토콜도 이더넷 기반의 TCP/IP 프로토콜을 사용하도록 변화로 IT환경에서의 보안위협이 그대로 적용하는 등 폐쇄적으로 운영되었지만, 현재에는 상호연결 성이 증가하는 스마트 환경으로 변화하고 있다. 제어시스템은 현장설비를 직접 제어할 수 있기 때문에 사이버 침해사고가 발생한다면 물리적, 경제적 피해는 물 론 심각할 경우 인명 피해까지 유발할 수 있다. 제어시스템에 대한 사이버 침해사고는, 2010년 이란 원전 사이버 공격과, 2012년 사우디아라비아 원전시설의 사 이버 공격과 2015년 우크라이나 대규모 정전사태가 대표적이다. 이란 원전 사이버공격은, 악성코드 'Stuxnet'이 이란의 주요 핵 시설인 원자력 발전소를 대상으로 공격하여, 나탄즈 시설 원심분리기 1,000 여대가 파괴되고 또 한 발전소 가동이 수차례 중지되었다. 이는 세계 최초의 제어시스템 대상으로 성공한 악성코드이다. 그리고 사 우디아라비아 사이버 공격은, 'shamoon'이라는 바이러스로 인해 3만여대의 컴퓨터의 데이터가 손실되었다. 그리 고, 우크라이나 사이버 공격은, 'Black Energy 3' 악성코드로 인한 우크라이나 전력망 전산망 마비시켰다. 직원 을 대상으로 메일을 보내며, 첨부파일 열람 시 감염되는 '스피어 피싱' 형태의 공격이다. 악성코드가 삽입된 첨 부문서에 숨겨진 매크로 기능이 실행되고, C&C 서버에 연결되면서 대규모 정전사태의 주 원인으로 추정되는 Kill disk, SSH backdroor를 생성하게 된다. 이에 국내 제어시스템 보안 동향은 네트워크 트래픽 수집 및 점검을 위한 모니터링과 whitelist 방식을 사용하 여 공격을 식별하고 있다. whitelist방식은 지속적으로 업데이트 되어야 하며, 고도화되는 공격을 탐지하는데 어려움이 있다. 또한, whitelist 방식은 알려진 위협에 대해서는 효과적이지만 알려지지 않은 위협에서는 무력하다. 이러한 상 황에서 AI 모델의 도입이 이루어지고 있지만, 오탐으로 인해 적극적인 활용이 어려운 상황이다."}
{"patent_id": "10-2021-0180488", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 목적은, 산업제어시스템 환경에서 사전 지식(label)없이 정상행위에 대한 AI 학습모델을 생 성하고, 정상/비정상 상황을 탐지하고 또한, AI 모델에 의해 탐지된 정상/비정상 상황을 XAI 기반으로 판단 결 과에 미치는 센서 장비들(features)의 기여도를 분석하는, 설명 가능한 산업제어시스템 악성행위 탐지 기술 방 법을 제공하는 것이다."}
{"patent_id": "10-2021-0180488", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명이 목적을 달성하기 위하여, 본 발명에 따른 설명 가능한 산업제어시스템 악성행위 탐지 기술 방법은, 제어시스템 환경에서 수집된 HAI 21.03 학습데이터(1초 단위로 수집된) 특징을 정규화하는 단계 1과, 학습데이 터에서 timestep를 설정하고 설정된 timestep만큼 샘플링하여 입력데이터 및 출력데이터를 분리하는 단계 2와, 학습데이터 기반 3 stacked Bi-LSTM 모델을 생성하는 단계 3과, HAI 21.03 테스트데이터 입력 시 학습데이터 정 규화에 사용된 정보를 바탕으로 테스트데이터 특징을 정규화하는 단계 4와, 테스트데이터를 사용하여 학습된 3 stacked Bi-LSTM 모델기반 예측 값을 산출하는 단계 5와, 예측값과 실제값의 평균 오차인 이상 스코어를 계산하 고 사전 정의된 임계치(Threshold) 이상일 경우 이상(비정상)으로 판단하는 단계 6과, 정상/비정상 시퀸스가 10 초 미만일 경우 이전 라벨로 판단하여 오탐을 최소화하는(그레이 영역 스무딩) 단계 7과, 높은 60-timestep와 낮은 10-timestep와 연계한 탐지 정책을 시행하는 단계 8과, 학습된 3 stacked Bi-LSTM 모델에 한 개의 예측 오 류(anomaly score)를 나타내는 방식으로 출력 노드의 예측 오류를 합산하는 출력 계층을 추가하는 단계 9와, 추 가된 stacked Bi-LSTM 모델을 사용하여 Gradient SHAP explainer를 생성하는 단계 10과 그리고 테스트 데이터 와 사전에 생성된 explainer를 이용하여 테스트데이터의 특징별 기여도를 산출하는(SHAP value) 단계 11로 구성 되는 것을 특징으로 한다. 본 발명에 따른 방법에서, 단계 11에서 산출되어 정상/비정상(이상)으로 판단한 특징별 기여도를 시각화하는 단 계 12를 더 포함하는 것을 특징으로 한다. 본 발명에 따른 방법에서, 단계 1에서, 학습 시 모든 특징이 비슷한 영향을 미치도록 모델 학습 전에 특징 정규 화를 수행하고, 정규화는 최대-최소 정규화를 사용하며, 노이즈를 제거하기 위해 ewm(smoothing factor 0.9)을 적용하고 그리고 오토인코더 기반 차원 축소하는 인코딩 특징을 사용하는 것을 특징으로 한다.본 발명에 따른 방법에서, 단계 2에서, 전체 2가지 모델 생성을 위해 높은 60-timestep와 낮은 10-timestep 사 용하고, 60-timestep은 기준이 되는 모델을 생성하기 위한 것이고, 10-timesteps는 탐지율을 높이기 위한 하나 의 방법론으로 기준 모델 결과와 연계하여 이상(비정상)을 탐지할 때 사용하는 것을 특징으로 한다. 본 발명에 따른 방법에서, 단계 3에서, RNN의 장기 의존성 때문에 LSTM 모델을 채택하고, 정확한 학습을 위해 3 층의 양방향 구조로 모델을 설계하며, LSTM Cell 크기는 100으로 설정하며, 회귀(regression)방식으로 인해 dropout은 사용하지 않는 것을 특징으로 한다. 본 발명에 따른 방법에서, 단계 3에서, 전체 특징이 복수 개이므로 샘플의 첫 번째 값은 학습 시 손실될 수 있 어서 LSTm의 출력과 더하여 출력하도록 구성되고, 손실 함수(loss function)는 MSE(Means Squared Error)를 사 용하며, 최적화(Optimizer)는 Adam을 사용하는 것을 특징으로 한다. 본 발명에 따른 방법에서, 단계 6에서, 평균 오차는 MAE(Means Absolute Error) 측정법을 사용하고, 산출된 이 상 스코어는 하나의 시계열로 이전 10개의 평균값을 고려하여 예측 시점의 이상 스코어를 재 산출하는 것을 특 징으로 한다. 본 발명에 따른 방법에서, 단계 8에서, 60-timestep 결과로 비정상 시작 지점을 탐지하며, 10-timestep 결과로 비정상 종료지점을 탐지하는 것을 특징으로 한다. 본 발명에 따른 방법에서, 단계 11에서, 산출된 SHAP value는 입력 크기인 2차원(timestep, feature)이므로 특 징별 절대값을 취한 후 더하여 특징별 기여도로 사용되는 것을 특징으로 한다."}
{"patent_id": "10-2021-0180488", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 대량의 사이버 위협이 발생하는 실 산업제어시스템 환경에서 이상(비정상)징후를 탐지하고, 탐지 결 과에 대한 이유를 분석하고 관리자에게 포괄적인 설명을 제공하여 사이버 공격에 대한 방버의 효율성을 높이는 효과가 있다."}
{"patent_id": "10-2021-0180488", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 첨부된 도면을 참고하여 본 발명에 따른 바람직한 실시예를 보다 상세하게 설명하기로 한다. 본 발명의 설명에 앞서, 이하의 특정한 구조 내지 기능적 설명들은 단지 본 발명의 개념에 따른 실시예를 설명 하기 위한 목적으로 예시된 것으로, 본 발명의 개념에 따른 실시예들은 다양한 형태로 실시될 수 있으며, 본 명 세서에 설명된 실시예들에 한정되는 것으로 해석되어서는 아니된다. 또한, 본 발명의 개념에 따른 실시예는 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있으므로, 특정 실시예들을 도면에 예시하고 본 명세서에 상세하게 설명하고자 한다. 그러나, .이는 본 발명의 개념에 따른 실 시예들을 특정한 개시 형태에 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경물, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다.본 발명의 상세한 설명에 앞서 본 발명에서 사용되는 기술에 대해 살펴보면 아래와 같다. XAI(eXplainable Artificail Intellignence; 설명 가능한 인공 지능) : 사용자가 인공지능 시스템의 전반적인 강점 및 약점을 이해하도록 도와주는 설명 가능한 인공지능. Game theory : 여러 주제가 서로 영향을 미치는 상황에서 서로가 어떤 의사결정이나 행동을 하는지에 대해 이론 화한 것. Shapley valeus : 협력 게임 이론(coalitional game theory)으로 도출된 개념. 가능한 모든 협동에 대한 모든 한계 기여도의 평균 값이 shapley value임. 인스턴스의 각 특성 예측 값이 지불인 게임에서 플레이어의 협력과 비 협력에 따른 영향력을 수치화를 통해 공정하게 지불(=예측)을 분배하는 방법을 제시함. Shapley value는 분 류(확률을 다루는 경우)와 회귀 모델에 모두 적용 가능하다. 실제 예측에서 모든 인스턴스의 평균 예측 값을 뺀 값이고, 연산 시간은 특징의 수에 따라 기하급수적으로 증가한다. SHAP(Shapley Additive Explanations): SHAP는 LIME과 Shapley value를 연결한다. 각 SHAP value는 모델의 각 특징(feature)이 음적으로 또는 양적으 로(positively or negatively) 기여하는 정도 측정한다. SHAP의 두 개의 필수적인 장점이 있다. 즉 simple linear model이 아닌 모든 model에 대해 SHAP vlaue가 계산 가능하다는 것과, 각 record에는 자체 SHAP value set이 있다는 것이다. LIME과의 가장 큰 차이점은 regression model의 인스턴스 가중치(instance weight)이다. LIME은 오리지널 인스 턴스와 얼마나 가까운지에 따라 인스턴스의 가중치를 부여한다. 이에 따라 , coalition vector에 1이 많을수록 LIME의 가중치가 커진다. 그러나 SHAP는 coalition이 Shapley value estimation에서 얻을 수 있는 가중치 따라 샘플 인스턴스들의 가중 치를 부여한다. 이에 따라, mall coalitions(few 1)과 large coalitions(many 1)이 가장 큰 가중치를 받게된다. SHAP의 목적은 예측에 대한 각 특징의 기여도를 계산하여 예측 값 설명을 위한 plot을 제공하는 것이다. 도 1은 본 발명의 방법에서 사용되는 이상탐지 모델의 구성도를 나타낸 것으로, 도 1을 참조하여 본 발명을 설 명하면 다음과 같다. 본 발명의 이상탐지 모델에는 HAI(HIL-based Augmented ICS) 21.03 데이터셋(Dataset)을 사용하였다. 이는 국 가보안기술연구소에서 2020년 2월 발표한 데이터셋으로서, ICS연구를 위해 GE, Emerson, Siemens 등의 산업용 제어기기, 센서, 엑추에이터를 이용해 구축한 Testbed에서 수집하였다. 증기 터빈 발전 및 펌프 식 수력 발전을 모방(emulates)하여 HIL (Hardware-In-the-Loop) 시뮬레이터로 실제와 다름없는 ICS 환경을 구축하였고, 총 4 가지(보일러, 터빈, 수처리, HIL Simulation) 공정을 포함하며, 각 프로세스는 3가지 컨트롤러에 의해 제어되고 HIL 시뮬레이터는 원격 입출력 장치를 통해 실제 프로세스와 상호 연결되는 구조로 이루어진다. HAI 20.07은 총 38개 공격 시나리오를 포함하며, HAI 21.03은 총 50개의 공격 시나리오를 포함하며, HAI 데이터셋은 1초 단위로 데이터를 수집한 데이터셋이다. 도 2에 HAI 데이터셋의 버전 비교를 나타내었다. 다음에 데이터 샘플링에 대해 설명하면 다음과 같다. HAI 데이터셋에서 오토인코더(Autoencoder)를 사용하여 벡터(feature)의 차원을 줄여 유의미한 특징(feature)을 추출한다. 각 특징의 범위가 상당히 다르게 때문에 Max-Min Normalization 적용한다. 이때, Timesteps는 60초, stride 1초로 설정하고, 인풋(input)은 윈도우의 앞부분 59초에 해당하는 값이고, 아웃풋(output)은 윈도우의 가장 마지막 초(60번째 초)의 값이다. 도 3은 오토인코더의 구성을 보여주고, 도 4는 Timesteps이 3인 경우를 보여주는 도면이다. 다음으로, 도 5는 이상검출 모델의 구성을 보여주는 것으로서, 이상검출 모델은 Raw multidimentional time series data 층과, 3 layer stacked Bi-LSTM층과, 출력층(Skip connection + Output)으로 구성되며, 3 layer stacked Bi-LSTM 층을 기반으로 설명하면 다음과 같다. RNN의 장기 의존성 문제로 인해 LSTM 사용하며, 정교한 학습을 위해 양방향(Bidirectional)으로 설계한다. 그리 고 모델은 3층 Bi-LSTM을 사용하고, Hidden cell의 크기는 100으로 설정하며, Dropout은 사용하지 않는다. 모델 이 윈도우의 가장 첫 번째 값과 LSTM의 출력을 더해서 내보내도록 연결을 스킵한다. 실제값과 예측값의 차이가 큰 경우 이상으로 간주하기 때문에 MAE (Mean Absolution Error)를 통해 이상 스코어(anomaly score)로 산출한다. 높은 이상 스코어는 학습 데이터에서 이전에 볼 수 없었던 패턴이라는 가정으로, 산출된 이상 스코어를 하 나의 시계열로 이전 10개의 평균값을 고려하여 예측 시점의 이상 스코어를 재 산출한다(Moving Average). 다음에 그레이 영역 스무딩(Gray area smoothind)에 알아보면 다음과 같다. 스코어(Score) 기반으로 공격을 예측하기 때문에 공격-정상 시퀀스(Attack-Normal Sequence)를 고려해야 하는데, 이상 스코어가 임계(Threshold)에 걸쳐있어 공격/정상으로 판단하기 어려운 구간을 그레이 영역이라고 한다. 공격-정상 시퀀스가 10초 미만일 경우 이전 라벨(label)로 판단하여 오탐을 최소화한다. 도 6은 정상영역 에서 공격으로 간주되기 어려운 그레이 영역의 예를 보여준다. 다음으로, High/Low Timesteps 탐지정책에 대해 설명하면 다음과 같다. 도 7a, 7b 및 7c는 각각 60-timesteps와 10-timesteps 샘플링을 통한 이상 스코어 산출 결과를 보여준다. timesteps를 높게 설정하면 실제 비정상 범위보다 늘어지며, 낮게 설정하면 이상 스코어가 낮게 예측되어 오탐 가능성이 있다. 따라서, 60-timesteps 결과로 비정상 시작지점을 탐지하며, 10-timesteps 결과로 비정상 종료지점으로 탐지하게 된다. 다음으로, 본 발명에서 이상탐지 모델에 XAI 적용을 위한 설계를 설명하면 다음과 같다. 도 8은 이상을 설명하기 위하여 도 5에 도시한 이상 탐지를 위한 모델에 예측 에러층의 부가를 보여주는 도면이 다. XAI의 목적은 Gradient SHAP explainer을 적용하여 예측에 기여한 특징을 제공하여 보안 전문가에게 포괄적인 설명을 제공하는 것이다. 한 개의 예측 오류(anomaly score)를 나타내는 방식으로 출력 노드의 예측 오류를 합 산하는 출력 계층을 추가하여 해석 가능하며, XAI 기반 SHAP은 출력 노드별 입력 특징 크기만큼의 SHAP values 를 리턴하기 때문에 예측 오류 계층을 추가한다. 산출된 SHAP values는 입력 크기인 2차원이므로 특징별 절대값 을 취한 후 더하여 특징별 기여도로 사용한다. 상기와 같은 방법들을 통해 얻은 결과는 다음과 같았다. 도 9는 이상 스코어 기반 이상탐지 결과를 보여주는 도면이다. 이상탐지는 모델에 의해 예측된 이상 스코어가 특정 임계 이상일 경우 공격으로 판단하였다. HAI 21.03 데이터 셋을 사용하며, 모델은 60-timesteps 및 HAICon2020(2위) 모델 Moving Average까지 동일한 모델을 사용하였다. HAICon2020은 f1 score : 0.9361 결과를 얻었으며, HAI 21.03 데이터셋은 f1 score : 0.938 결과를 얻었다. 도 10은 정상/공격으로 판단한 특징별 기여도 시각화를 한 예시도면이다. 예측 오류를 산출하는 출력 계층을 추가하고, 50개의 공격 시나리오 중 첫번째 공격 시나리오(P1 공격 : 보일러)를 시각화 한 결과이다. 보안 관리자에게 점검해야하는 대상 특징을 제공함으로써 AI 판단 결과를 해석 할 수 있고, 실제 보일러(P1) 관련 특징들이 AI 판단에 영향을 미치고 있다고 보여주고 있음을 알 수 있다. 이상에서 본 발명에 따른 방법에 관련해 설명하였지만, 더 나은 이해를 위해 단계적으로 정리하면 다음과 같다. 단계 1: 제어시스템 환경에서 수집된 HAI 21.03 학습데이터(1초 단위로 수집된) 특징을 정규화한다. 특징별 범 위가 모두 다르므로 학습 시 모든 특징이 비슷한 영향을 미치도록 모델 학습 전에 특징 정규화를 수행한다. 정 규화는 최대-최소 정규화를 사용하여, 노이즈를 제거하기 위해 ewm(smoothing factor 0.9)을 적용한다. 그리고, 오토인코더 기반 차원 축소하는 인코딩 특징을 사용한다. 단계 2: 학습데이터에서 timestep를 설정하고 설정된 timestep만큼 샘플링하여 입력데이터 및 출력데이터를 분 리한다. 총 2가지 모델 생성을 위해 높은 60-timestep와 낮은 10-timestep 사용하는데, 이는 60-timestep이 기 준이 되는 모델을 생성하기 위함이며, 10-timesteps는 탐지율을 높이기 위한 하나의 방법론으로 기준 모델 결과 와 연계하여 이상(비정상)을 탐지할 때 사용한다. 단계 3: 학습데이터 기반 3 stacked Bi-LSTM 모델을 생성한다. RNN의 장기 의존성 문제로 인해 LSTM 모델을 채 택하고, 정교한 학습을 위해 3층의 양방향 구조로 설계한다. LSTM Cell 크기는 100으로 설정하며, 회귀 (regression)방식이기 때문에 dropout은 사용하지 않는다. 총 특징이 79개 이므로 샘플의 첫 번째 값은 학습 시 손실될 수 있어서 LSTm의 출력과 더하여 출력하도록 구성된다(Skip-Connection). 손실 함수(loss function)는MSE(Means Squared Error)를 사용하며, 최적화(Optimizer)는 Adam을 사용한다. 단계 4: HAI 21.03 테스트데이터 입력 시 학습데이터 정규화에 사용된 정보를 바탕으로 테스트데이터 특징을 정 규화한다. 단계 5: 테스트데이터를 사용하여 학습된 3 stacked Bi-LSTM 모델기반 예측 값을 산출한다. 단계 6: 예측값과 실제값의 평균 오차인 이상 스코어를 계산하고 사전 정의된 임계치(Threshold) 이상일 경우 이상(비정상)으로 판단한다. 평균 오차는 MAE(Means Absolute Error) 측정법을 사용하고, 산출된 이상 스코어는 하나의 시계열로 이전 10개의 평균값을 고려하여 예측 시점의 이상 스코어를 재 산출한다(Moving Average). 단계 7: 정상/비정상 시퀸스가 10초 미만일 경우 이전 라벨로 판단하여 오탐을 최소화한다(gray area smoothing). 이때, 임계 기반 이상 스코어로 이상(비정상)을 판단하기 때문에 오탐에 대한 정상/비정상 시퀸스 를 고려해야 한다. 단계 8: 높은 60-timestep와 낮은 10-timestep와 연계한 탐지 정책을 시행한다. 60-timestep 결과로 비정상 시 작 지점을 탐지하며, 10-timestep 결과로 비정상 종료지점을 탐지한다. 단계 9: 학습된 3 stacked Bi-LSTM 모델에 한 개의 예측 오류(anomaly score)를 나타내는 방식으로 출력 노드 의 예측 오류를 합산하는 출력 계층을 추가한다. XAI는 처리절차 5번에 대한 예측값(T+1에 발생한 데이터를 예 측한 값)을 설명하기 위해 사용된다. 단계 10: 추가된 stacked Bi-LSTM 모델을 사용하여 Gradient SHAP explainer를 생성한다. 단계 11: 테스트 데이터와 사전에 생성된 explainer를 이용하여 테스트데이터의 특징별 기여도를 산출한다(SHAP value). 산출된 SHAP value는 입력 크기인 2차원(timestep, feature)이므로 특징별 절대값을 취한 후 더하여 특징별 기여도로 사용된다. 단계 12: 정상/비정상(이상)으로 판단한 특징별 기여도를 시각화한다. 이상에서 본 발명은 첨부된 도면을 참조하여 기술된 실시예들을 중심으로 설명되었지만 이에 한정되는 것은 물 론 아니다. 후술하는 청구항들은 본 발명의 범주 안에서 이들 실시예로부터 자명하게 도출 가능한 많은 변형예 들을 포괄하도록 의도되었다."}
{"patent_id": "10-2021-0180488", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 방법에서 사용되는 이상탐지 모델의 구성도 도 2는 HAI 데이터셋의 버전 비교를 보여주는 도면. 도 3은 오토인코더의 구성을 나타내는 도면. 도 4는 Timesteps이 3인 경우를 보여주는 도면. 도 5는 이상 검출모델의 구성을 보여주는 도면. 도 6은 정상영역에서 공격으로 간주되기 어려운 그레이 영역의 예를 보여주는 도면. 도 7a, 7b 및 7c는 각각 60-timesteps와 10-timesteps 샘플링을 통한 이상 스코어 산출 결과를 보여주는 도면. 도 8은 이상을 설명하기 위하여 예측 에러층의 부가를 보여주는 도면. 도 9는은 이상 스코어 기반 이상탐지 결과를 보여주는 도면. 도 10은 정상/공격으로 판단한 feature별 기여도 시각화 예시 도면."}
