{"patent_id": "10-2021-0092034", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0008789", "출원번호": "10-2021-0092034", "발명의 명칭": "신경질환 양방향 모니터링 시스템", "출원인": "고려대학교 산학협력단", "발명자": "김난희"}}
{"patent_id": "10-2021-0092034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "환자의 체온, 운동 및 발화 특성을 분석하기 위해 필요한 열화상 데이터, 운동 영상 데이터 및 음성 데이터를획득하는 데이터 획득부; 기 학습된 인공지능 알고리즘을 기반으로 환자의 열화상 데이터를 분석하여 환자의 신경질환과 관련된 체온 특성을 분석하는 체온 분석부; 기 학습된 인공지능 알고리즘을 기반으로 환자의 운동 영상 데이터를 분석하여 환자의 운동 특성을 분석하는 운동 분석부; 기 학습된 인공지능 알고리즘을 기반으로 환자의 음성 데이터를 분석하여 환자의 발화 특성을 분석하는 발화 분석부; 및 상기 체온 분석부, 운동 분석부 및 발화 분석부 중 적어도 하나의 분석 결과를 기초로 환자의 신경질환 유무 및정도를 평가하는 신경질환 평가부를 포함하는 신경질환 양방향 모니터링 시스템."}
{"patent_id": "10-2021-0092034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 운동 분석부는 환자의 신체 영상에서 신체 랜드마크를 검출하고, 환자의 얼굴 영상에서 얼굴 랜드마크를검출하며, 환자의 손 영상에서 손 랜드마크를 검출하는 것을 특징으로 하는 신경질환 양방향 모니터링 시스템."}
{"patent_id": "10-2021-0092034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 운동 분석부는 상기 신체 랜드마크, 얼굴 랜드마크 및 손 랜드마크 각각에 대해 시간에 따른 랜드마크의이동 정보인 랜드마크 궤적 정보를 이미지로 생성하는 것을 특징으로 하는 신경질환 양방향 모니터링 시스템."}
{"patent_id": "10-2021-0092034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 신경질환 평가부는,상기 신체 랜드마크, 얼굴 랜드마크 및 손 랜드마크 각각에 대해 생성된 이미지를 마지막 레이어를 제외한ResNet을 통과시켜 각각의 특징 벡터를 획득하고, 각각의 특징 벡터를 연결시켜서 특징 매트릭스를 구성하며, 상기 특징 매트릭스의 세로 축 각각에 대하여 최대값(max) 및 평균값(mean)을 취하여 최대 특징 벡터와 평균 특징 벡터를 하나씩 계산한 후, 상기 최대 특징 벡터와 평균 특징 벡터를 합쳐서 완전 연결 레이어(Fully Connected layer)를 지나 최종 출력값을 출력하는 것을 특징으로 하는 신경질환 양방향 모니터링 시스템."}
{"patent_id": "10-2021-0092034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,공개특허 10-2022-0008789-3-상기 체온 분석부는 상기 데이터 획득부를 통해 획득한 환자의 손 및 발의 열화상 데이터 중 적어도 하나에서두 지점 사이의 온도차를 산출하는 것을 특징으로 하는 신경질환 양방향 모니터링 시스템."}
{"patent_id": "10-2021-0092034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 발화 분석부는 상기 음성 데이터에 대해 단시간 푸리에 변환(Short-time Fourier transform)을 수행하여스팩트로그램을 획득한 후 어텐션 모듈(Attention Module) 및 음성 네트워크(Audio Net)를 거쳐 발화 특징 벡터를 추출하는 것을 특징으로 하는 신경질환 양방향 모니터링 시스템."}
{"patent_id": "10-2021-0092034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 신경질환 평가부에 의한 평가 결과를 기초로 환자에게 건강 관리를 위한 가이드를 제공하는 가이드 제공부를 더 포함하는 것을 특징으로 하는 신경질환 양방향 모니터링 시스템."}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 신경질환 양방향 모니터링 시스템은, 환자의 체온, 운동 및 발화 특성을 분석하기 위해 필요한 열화상 데이터, 운동 영상 데이터 및 음성 데이터를 획득하는 데이터 획득부; 기 학습된 인공지능 알고리즘을 기반으로 환자의 열화상 데이터를 분석하여 환자의 신경질환과 관련된 체온 특성을 분석하는 체온 분 석부; 기 학습된 인공지능 알고리즘을 기반으로 환자의 운동 영상 데이터를 분석하여 환자의 운동 특성을 분석하 는 운동 분석부; 기 학습된 인공지능 알고리즘을 기반으로 환자의 음성 데이터를 분석하여 환자의 발화 특성을 분석하는 발화 분석부; 및 상기 체온 분석부, 운동 분석부 및 발화 분석부 중 적어도 하나의 분석 결과를 기초로 환자의 신경질환 유무 및 정도를 평가하는 신경질환 평가부를 포함할 수 있다."}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 신경질환 양방향 모니터링 시스템에 관한 것이다."}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "나이가 들수록 만성 질환, 급성 질환, 감염성 질환, 종양성 질환 등과 같은 모든 질환의 발생이 증가하며, 특히 신경질환은 노인층에서 흔하게 발생한다. 이러한 노인 신경질환의 대표적인 예로서 뇌졸중, 피킨슨병, 치매 등 을 들 수 있다. 노인성 질환의 특성상 질병의 완치가 어렵기 때문에 예상되는 질병의 예방, 조기 진단 및 건강 관리가 중요하다. 그러나, 노인들은 건강 관리에 대한 인식이 부족하고 투약 오류도 빈번하여 각종 합병증 발병이나 사망 위험이 높은 것이 현실이다. 일 예로, 노인의 만성 질환 증가에 따라 포괄적 만성질환 관리 서비스 체계 구축 및 치매국가책임제를 실시하고 있으나, 65세 이상 노인 인구 중에서 일부만이 치매 스크리닝 검사를 받을 뿐이고, 당뇨병과 같은 대사 질환에 대해 꾸준한 관리와 교육이 실질적으로 이루어지지 못하고 있는 실정이다."}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 당해 기술분야에서는 노인성 질환 중 하나인 신경질환을 모니터링하여 신경질환을 조기에 진단하고 보 다 효율적인 건강 관리를 지원하기 위한 방안이 요구되고 있다."}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위해서, 본 발명의 일 실시예는 신경질환 양방향 모니터링 시스템을 제공한다. 상기 신경질환 양방향 모니터링 시스템은, 환자의 체온, 운동 및 발화 특성을 분석하기 위해 필요한 열화상 데 이터, 운동 영상 데이터 및 음성 데이터를 획득하는 데이터 획득부; 기 학습된 인공지능 알고리즘을 기반으로 환자의 열화상 데이터를 분석하여 환자의 신경질환과 관련된 체온 특성을 분석하는 체온 분석부; 기 학습된 인 공지능 알고리즘을 기반으로 환자의 운동 영상 데이터를 분석하여 환자의 운동 특성을 분석하는 운동 분석부;기 학습된 인공지능 알고리즘을 기반으로 환자의 음성 데이터를 분석하여 환자의 발화 특성을 분석하는 발화 분 석부; 및 상기 체온 분석부, 운동 분석부 및 발화 분석부 중 적어도 하나의 분석 결과를 기초로 환자의 신경질 환 유무 및 정도를 평가하는 신경질환 평가부를 포함할 수 있다. 덧붙여 상기한 과제의 해결수단은, 본 발명의 특징을 모두 열거한 것이 아니다. 본 발명의 다양한 특징과 그에 따른 장점과 효과는 아래의 구체적인 실시형태를 참조하여 보다 상세하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 신경질환을 모니터링하여 신경질환을 조기에 진단하고 보다 효율적인 건강 관리 를 지원할 수 있다."}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있 어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되 는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 '연결'되어 있다고 할 때, 이는 '직접적으로 연결'되어 있 는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 '간접적으로 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 '포함'한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 1은 본 발명의 일 실시예에 따른 신경질환 양방향 모니터링 시스템의 블록 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 신경질환 양방향 모니터링 시스템은 데이터 획득부, 체온 분석부, 운동 분석부, 발화 분석부, 신경질환 평가부 및 가이드 제공부를 포함 하여 구성될 수 있다. 데이터 획득부는 환자의 체온, 운동 및 발화 특성을 분석하기 위해 필요한 데이터를 획득하기 위한 것이다.일 예에 따르면, 데이터 획득부는 환자의 열화상 데이터를 획득하기 위한 열화상 카메라, 환자의 운동 영 상 데이터를 획득하기 위한 카메라 및 환자의 음성 데이터를 획득하기 위한 녹음기를 포함하여 구성될 수 있으 며, 이를 통해 환자의 열화상 데이터, 운동 영상 데이터 및 음성 데이터를 획득할 수 있다. 예를 들어, 데이터 획득부에 포함된 열화상 카메라를 통해 환자의 손 및/또는 발의 열화상 데이터를 획득 하고, 카메라를 통해 환자의 신체 영상, 얼굴 영상 및 손 영상을 획득하며, 녹음기를 통해 환자의 발화시의 음 성 데이터를 획득할 수 있다. 영상 획득을 위해 도 2에 도시된 바와 같이 복수의 카메라(예를 들어, 4대의 카메라)를 이용하여 원테이크 검사 프로토콜에 따라 환자의 신체, 얼굴 및 손 영상을 한 번에 획득할 수 있으며, 이와 별도로 보행 영상을 획득할 수 있다. 이처럼 원테이크 검사 프로토콜에 따라 획득한 영상의 경우 복수의 검사 프로토콜에 해당하는 영상이 하나의 영상에 포함되어 있으므로 이를 분리하여 분석할 필요가 있다. 체온 분석부는 데이터 획득부를 통해 획득한 환자의 열화상 데이터를 분석하여 환자의 신경질환과 관 련된 체온 특성을 분석하기 위한 것이다. 일 예에 따르면, 체온 분석부는 데이터 획득부를 통해 획득한 환자의 손 및/또는 발의 열화상 데이터 에서 두 지점 사이의 온도차를 산출할 수 있다. 도 3은 본 발명의 일 실시예에 따라 체온 분석부에 의해 손 및 발의 열화상 데이터를 분석하는 예를 도시하는 도면으로, 손의 열화상 데이터에서 양 손의 바닥면 온도(H)와 중 지 손가락 끝의 온도(h)를 획득하고 이들 사이의 온도차를 산출할 수 있으며, 마찬가지로 발의 열화상 테이터에 서 양 발의 발등 온도(F)와 엄지 발가락 끝의 온도(f)를 획득하고 이들 사이의 온도차를 산출할 수 있다. 이와 같이 산출된 온도차를 기초로 후술하는 신경질환 평가부에 의해 신경질환의 중증도를 분류할 수 있다. 이 를 위해, 체온 분석부는 기 학습된 인공지능 알고리즘을 기반으로 환자의 열화상을 분석하여 상술한 체온 특징을 추출할 수 있다. 운동 분석부는 데이터 획득부를 통해 획득한 환자의 운동 영상 데이터를 분석하여 환자의 운동 특성 을 분석하기 위한 것이다. 일 예에 따르면, 운동 분석부는 환자의 신체 영상을 기초로 환자의 신체 특징을 분석할 수 있다. 이를 위 해, 운동 분석부는 예를 들어 AlphaPose 알고리즘과 같은 동작 분석 알고리즘을 적용하여 환자의 신체 영 상에서 신체 랜드마크(즉, 신체의 조인트)를 검출할 수 있다. 도 4는 본 발명의 일 실시예에 따라 운동 분석부 에 의해 신체 랜드마크를 검출한 예를 도시하는 도면이다. 또한, 운동 분석부는 환자의 얼굴 영상을 기초로 환자의 얼굴 특징을 분석할 수 있다. 이를 위해, 운동 분 석부는 예를 들어 RetinaFace, SAN 및 gazeML 알고리즘과 같은 얼굴 분석 알고리즘을 적용하여 환자의 얼 굴 영상에서 얼굴 랜드마크(즉, 동공, 눈 주변, 코, 얼굴선, 입술 등)를 검출할 수 있다. 도 5는 본 발명의 일 실시예에 따라 운동 분석부에 의해 얼굴 랜드마크를 검출한 예를 도시하는 도면이다. 또한, 운동 분석부는 환자의 손 영상을 기초로 환자의 손 특징을 분석할 수 있다. 이를 위해, 운동 분석부 는 예를 들어 Hand-CNN 및 OpenPose 기반 알고리즘을 적용하여 환자의 손 영상에서 손 랜드마크(즉, 손의 위치와 뼈대를 이루는 특징)를 검출할 수 있다. 이처럼, 손의 위치를 추정하기 위한 알고리즘과 손의 뼈대가 이 루는 포즈를 추출하기 위한 알고리즘을 연결함으로써 보다 정확하게 손의 위치 및 포즈를 검출할 수 있다. 도 6 은 본 발명의 일 실시예에 따라 운동 분석부에 의해 손 랜드마크를 검출한 예를 도시하는 도면이다. 또한, 운동 분석부는 상술한 바와 같이 검출한 다양한 랜드마크를 기초로 후술하는 신경질환 평가부 에 의한 신경질환 평가를 위해 사용할 데이터를 생성할 수 있다. 구체적으로, 운동 분석부는 시간에 따른 랜드마크의 이동, 즉 랜드마크 궤적 정보를 이미지로 생성할 수 있다. 일 예로, 운동 분석부는 시계열 데이터인 랜드마크 궤적 정보를 이미지로 표현하기 위해 반복 플롯 (Recurrence plot)을 활용할 수 있다. 반복 플롯은 시계열 데이터를 m차원의 공간 궤적에 나타내고, 각 공간 궤 적에 위치한 점간의 거리를 이용하여 이미지화 시키는 방법이다. 도 7은 반복 플롯에 따라 시계열 데이터를 이미지화하는 방법을 설명하기 위한 도면으로, 도 7을 참조하면, 먼 저 (a)에 도시된 바와 같이 시계열 데이터를 시각화하여 표현할 수 있고, 이를 (b)에 도시된 바와 같이 2차원공간 위로 표현할 수 있다. 이후, 2차원 좌표에서 각 점 사이의 거리를 구해서 하기의 수학식 1에 따라 기 설정 된 임계값과 비교하는 식으로 반복 플롯을 구성할 수 있다. [수학식 1]"}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이에 따라, 운동 분석부는 랜드마크 궤적 정보를 이미지로 생성할 수 있다. 발화 분석부는 데이터 획득부를 통해 획득한 환자의 음성 데이터를 분석하여 환자의 발화 특성을 분 석하기 위한 것이다. 일 예에 따르면, 발화 분석부는 기 학습된 인공지능 알고리즘을 기반으로 환자의 음성을 분석하여 발화 특 징을 추출할 수 있다. 도 8은 본 발명의 일 실시예에 따라 발화 분석부에 의해 발화 특징을 분석하는 예를 도시하는 도면으로, 획득한 음성 데이터에 대해 단시간 푸리에 변환(Short-time Fourier transform; STFT)을 수행하여 스팩트로그램을 획득 한 후 어텐션 모듈(Attention Module) 및 음성 네트워크(Audio Net)를 거쳐 발화 특징 벡터를 추출할 수 있다. 신경질환 평가부는 체온 분석부, 운동 분석부 및 발화 분석부에 의해 각각 추출된 환자의 체온 특징, 운동 특징, 그리고 발화 특징 중 적어도 하나를 기초로 환자의 신경질환 유무 및 정도를 평가하기 위한 것이다. 이 경우, 신경질환 평가부는 체온 특징, 운동 특징 및 발화 특징 중 2 이상을 융합한 융합 특징 벡터를 이용하여 신경질환 유무 및 정도를 평가할 수 있다. 일 예에 따르면, 신경질환 평가부는 운동 분석부에 의해 생성한 이미지를 기초로 환자의 신경질환 유 무 및 정도를 평가할 수 있다. 도 9는 본 발명의 일 실시예에 따라 신경질환 평가부가 운동 분석부에 의해 생성한 이미지를 기초로 환자의 신 경질환을 평가하기 위한 네트워크의 구조를 도시하는 도면이다. 도 9를 참조하면, 다양한 종류의 영상에 대해 각각 구성된 반복 플롯 이미지를 마지막 레이어를 제외한 ResNet 을 통과시켜 각각의 특징 벡터를 획득할 수 있다(S91). 이후, 이를 연결(concatenate)시켜서 특징 매트릭스(feature matrix)를 구성할 수 있다(S92). 이후, 특징 매트릭스의 세로 축 각각에 대하여 최대값(max) 및 평균값(mean)을 취하여 최대 특징 벡터와 평균 특징 벡터를 하나씩 계산한 후(S93), 두 개의 특징 벡터를 합쳐서(S94) 완전 연결 레이어(Fully Connected layer)를 지나 최종 출력값을 출력할 수 있다. 이와 같이 다양한 종류의 영상에서 획득한 랜드마크 궤적 정보가 각각의 특징 벡터로 압축되며, 이후 최대값 및 평균값을 통해 우수한 특징만을 취합하여 이를 합친 롱 벡터(long vector)를 학습에 사용하는 구조로 구성될 수 있다. 가이드 제공부는 신경질환 평가부에 의한 평가 결과를 기초로 환자에게 건강 관리를 위한 가이드(예 를 들어, 운동 가이드, 투약 가이드 등)를 제공하기 위한 것이다. 일 예에 따르면, 가이드 제공부는 구비된 디스플레이 장치(미도시)를 통해 운동 영상 가이드를 제공하거나, 투약 관리를 위한 음성 가이드를 제공할 수 있으나, 반드시 이로 제한되는 것은 아니다. 일 실시예에 따르면, 신경질환 양방향 모니터링 시스템은 도 10에 도시된 바와 같이 2족 보행 로봇으로 구 현되어 환자의 일상 생활에서 환자의 열화상 데이터, 운동 영상 데이터 및 음성 데이터 등을 획득하고, 획득한 데이터를 기반으로 체온, 운동 및 발화 특성을 분석하며, 이를 기초로 신경질환을 평가함으로써, 신경질환을 조 기 진단하여 적절한 조치를 취하도록 할 수 있다.다른 실시예에 따르면, 신경질환 양방향 모니터링 시스템은 이동 가능한 키오스크로 구현되어 상술한 바와 같은 기능을 수행할 수 있다. 이와 같이 신경질환 양방향 모니터링 시스템이 키오스크로 구현될 경우, 조 작이 간편하므로 노령층에서도 손쉽게 활용 가능하고, 이를 통해 빅데이터 구축이 가능하며, 키오스크에 분류 알고리즘을 탑재하거나 또는 분류 알고리즘을 탑재한 서버와의 무선 통신을 통해 신경질환에 대한 조기 진단이 가능해질 수 있다. 상술한 바와 같은 본 발명의 실시예에 따른 신경질환 양방향 모니터링 시스템에 따르면, 기술적 측면, 경 제/산업적 측면 및 의학적 측면에서 다음과 같은 효과를 얻을 수 있다. 우선, 기술적 측면에서, AI 알고리즘을 활용하여 노인성 질환의 조기진단에 기여하고 이를 통해 국민건강증진에 기여할 수 있다. 또한, 의학, 전자공학, 의공학 등 융합 기술의 발전 토대를 마련함으로써 핵심 기반 기술을 확 보할 수 있다. 다음으로, 경제/산업적 측면에서, 만성 질환 및 노인성 질환의 스크리닝 및 맞춤 관리를 통해 의료비 절감 효과 를 얻을 수 있고, 격오지 군이나, 국외 지역 거주자, 감호소 등 의료진의 수요가 부족한 곳에 필수적으로 사용 될 수 있어 국민건강증진에 도움이 될 것으로 기대할 수 있다. 또한, 해외 의료서비스 시장에서 AI를 활용한 시 스템의 저변 확대를 통한 신성장동력 창출 및 수출 확대 효과를 얻을 수 있다. 마지막으로, 의학적 측면에서, AI 기반 질병 스크리닝이 가능하게 됨으로써 미래지향적 기술발전에 이바지할 수 있다. 또한, 본 발명의 실시예에 따른 지능형 노인성 질환 관리 시스템은 과학적이고 정량화된 진단 검증체계 구축을 통한 관련 응용분야로의 국제적으로 신뢰도 높은 자료제공 및 경제적 이득 창출을 기대할 수 있다. 또 한, 노인성 질환 스크리닝/관리 시스템 개발 선두주가로서 노인 건강 관리 거점병원 및 첨단 서비스 제공 병원 으로서의 이미지 강화할 수 있다."}
{"patent_id": "10-2021-0092034", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명은 전술한 실시예 및 첨부된 도면에 의해 한정되는 것이 아니다. 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 있어, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 본 발명에 따른 구성요소를 치 환, 변형 및 변경할 수 있다는 것이 명백할 것이다."}
{"patent_id": "10-2021-0092034", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 신경질환 양방향 모니터링 시스템의 블록 구성도이다. 도 2는 본 발명의 일 실시예에 따라 환자의 영상을 획득하는 일 예를 도시하는 도면이다. 도 3은 본 발명의 일 실시예에 따라 체온 분석부에 의해 손 및 발의 열화상 데이터를 분석하는 예를 도시하는 도면이다. 도 4는 본 발명의 일 실시예에 따라 운동 분석부에 의해 신체 랜드마크를 검출한 예를 도시하는 도면이다. 도 5는 본 발명의 일 실시예에 따라 운동 분석부에 의해 얼굴 랜드마크를 검출한 예를 도시하는 도면이다. 도 6은 본 발명의 일 실시예에 따라 운동 분석부에 의해 손 랜드마크를 검출한 예를 도시하는 도면이다. 도 7은 반복 플롯에 따라 시계열 데이터를 이미지화하는 방법을 설명하기 위한 도면이다. 도 8은 본 발명의 일 실시예에 따라 발화 분석부에 의해 발화 특징을 분석하는 예를 도시하는 도면이다. 도 9는 본 발명의 일 실시예에 따라 신경질환 평가부가 운동 분석부에 의해 생성한 이미지를 기초로 환자의 신 경질환을 평가하기 위한 네트워크의 구조를 도시하는 도면이다. 도 10은 본 발명의 일 실시예에 따른 신경질환 양방향 모니터링 시스템의 일 구현예를 도시하는 도면이다."}
