{"patent_id": "10-2024-7000443", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0017931", "출원번호": "10-2024-7000443", "발명의 명칭": "살균 및 제독용 시스템, 방법 및 기구", "출원인": "코러스, 엘엘씨", "발명자": "레이더, 리처드, 에스."}}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "항균 물질을 생성하고 모니터링(monitoring)하기 위한 폐 루프 시스템으로서:제어기 유닛을 포함하는 제어 서브 시스템;외부 네트워크를 연결하기 위한 하나 이상의 유선 통신 기구 및 무선 통신 기구를 포함하는 통신 서브 시스템;하나 이상의 센서 - 상기 하나 이상의 센서는 상기 제어 서브 시스템에 작동적으로 연결됨 - 를 포함하는 감지서브 시스템;생성 서브 시스템;을 포함하며,상기 항균 물질은 처리중에 있는 용적에 적용되고;상기 감지 서브 시스템은 계속적으로 또는 기정의된 일정에 따라 처리중에 있는 상기 용적으로부터 공기를 샘플링하고 처리중에 있는 상기 용적으로부터 상기 공기 내에 존재하는 상기 항균 물질의 농도를 측정하고;상기 생성 서브 시스템은 목표값과 감지 서브 시스템 측정값 사이의 차이에 응답하여 상기 항균 물질을 생성하는, 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 하나 이상의 센서의 상류 또는 하류에 위치한 에어 펌프를 더 포함하며, 상기 에어 펌프는 상기 하나 이상의 센서와 접촉하도록 처리중에 있는 상기 용적으로부터 상기 공기를 끌어들이는, 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 하나 이상의 센서는 하나 이상의 플리넘으로 배향되며, 상기 하나 이상의 센서 및 상기 하나 이상의 플리넘은 리액터의 상류에 있는 상기 플리넘 내에 위치한 하나 이상의 프리센서와 상기 리액터로부터 하류에 있는상기 플리넘 내에 위치한 하나 이상의 포스트센서를 포함하는, 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 하나 이상의 프리센서의 하류 및 상기 하나 이상의 포스트센서의 상류에 위치한 에어 펌프를 더 포함하는,폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 항균 물질은 항균성 가스 또는 증기인, 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 항균성 가스는 이산화 염소(ClO2)인, 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0017931-3-제1항에 있어서,상기 항균 물질은 공기 중의 항균 물질인, 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 생성 서브 시스템은 혼합 챔버를 포함하는 리액터를 포함하며, 상기 혼합 챔버에서는 항균 물질을 생성하도록 둘 이상의 시약이 결합되며, 상기 생성 서브 시스템은 복수의 액체 시약 탱크를 더 포함하며, 상기 시약탱크 및 상기 시약 펌프는 상기 리액터 혼합 챔버에 유체적으로 연결되는, 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 생성 서브 시스템은 상기 목표값과 상기 감지 서브 시스템 측정값 사이의 차이에 응답하여 상기 항균 물질의 생성을 중단하는, 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "항균 물질을 생성하고 모니터링(monitoring)하기 위한 폐 루프(closed-loop) 시스템으로서, 상기 폐 루프 시스템은:센서 서브 시스템 마이크로프로세서 및 센서 서브 시스템 마이크로컨트롤러 중 적어도 하나, 센서 서브 시스템항균 물질 센서 중 적어도 하나, 및 센서 서브 시스템 전산 시스템을 포함하는 센서 서브 시스템;생성 서브 시스템 마이크로프로세서 및 생성 서브 시스템 마이크로컨트롤러 중 적어도 하나, 및 생성 서브 시스템 항균 물질 생성기를 포함하는 생성 서브 시스템; 및처리중에 있는 용적을 형성하는 밀폐된 공간;을 포함하는 폐 루프 시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 센서 서브 시스템 및 상기 생성 서브 시스템은 처리중에 있는 상기 밀폐된 용적 내에 배향된,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 센서 서브 시스템은 처리중에 있는 상기 밀폐된 용적 내부에 배향되고 상기 생성 서브 시스템은 처리중에있는 상기 밀폐된 용적의 외부에 배향된,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 생성 서브 시스템은 처리중에 있는 밀폐된 용적 내부에 배향되고 상기 센서 서브 시스템은 상기 처리중에있는 밀폐된 용적 외부에 배향된,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,처리중에 있는 상기 밀폐된 용적의 내부에 유체적으로 연결된 HVAC 공기 공급부를 더 포함하며, 상기 센서 서브공개특허 10-2024-0017931-4-시스템은 처리중에 있는 상기 밀폐된 용적 내에 배향되고, 상기 생성 서브 시스템은 처리중에 있는 상기 밀폐된용적의 외부에 배향되며, 상기 생성 서브 시스템은 상기 HVAC 공기 공급부에 유체적으로 연결되는,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서,처리중에 있는 상기 밀폐된 용적의 내부에 유체적으로 연결된 HVAC 환기 환수관을 더 포함하며, 상기 생성 서브시스템은 처리중에 있는 상기 밀폐된 용적 내부에 배향되고, 상기 센서 서브 시스템은 처리중에 있는 상기 밀폐된 용적의 외부에 배향되며, 상기 센서 서브 시스템은 상기 HVAC 환기 환수관에 유체적으로 연결되는,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서,처리중에 있는 상기 밀폐된 용적의 내부에 유체적으로 연결된 HVAC 환기 환수관을 더 포함하며, 상기 생성 서브시스템은 처리중에 있는 상기 밀폐된 용적 내부에 배향되고, 상기 센서 서브 시스템은 처리중에 있는 상기 밀폐된 용적의 내부에 배향되며, 상기 센서 서브 시스템은 상기 HVAC 환기 환수관에 유체적으로 연결되는,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서,처리중에 있는 상기 밀폐된 용적의 내부에 유체적으로 연결된 HVAC 환기 환수관을 더 포함하며, 상기 생성 서브시스템은 처리중에 있는 상기 밀폐된 용적 내부에 배향되고, 상기 센서 서브 시스템은 처리중에 있는 상기 밀폐된 용적의 내부에 배향되며, 상기 생성 서브 시스템 및 상기 센서 서브 시스템의 각각은 상기 HVAC 환수관에 유체적으로 연결되는,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서,처리중에 있는 상기 밀폐된 용적의 내부에 유체적으로 연결된 HVAC 공기 공급부를 더 포함하며, 상기 생성 서브시스템은 처리중에 있는 상기 밀폐된 용적 내부에 배향되고, 상기 센서 서브 시스템은 처리중에 있는 상기 밀폐된 용적의 내부에 배향되며, 상기 생성 서브 시스템 및 상기 센서 서브 시스템의 각각은 상기 HVAC 공기 공급부에 유체적으로 연결되는,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "항균 물질을 생성하고 모니터링(monitoring)하기 위한 시스템의 네트워크로서, 상기 네트워크는:마이크로컨트롤러 및 감지 시스템을 포함하는 복수의 시스템 - 상기 복수의 시스템은 항균 물질을 생성하고 모니터링(monitoring)하기 위한 시스템 - 을 포함하며,상기 마이크로컨트롤러는 상기 복수의 시스템 사이의 통신이 가능한 통신 장치를 포함하며,상기 통신 장치는 각 시스템의 마이크로컨트롤러의 분산 제어를 설정하는,시스템의 네트워크."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,공개특허 10-2024-0017931-5-상기 마이크로컨트롤러는 시스템 성능을 변경하도록 하나 이상의 머신 러닝 알고리즘 및 인공지능에 의해 제어되는,시스템의 네트워크."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제19항에 있어서,상기 항균 물질은 이산화 염소인,시스템의 네트워크."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제19항에 있어서,상기 분산 제어는:특정된 공간 내에서 각 개별적 센서의 위치에서의 항균 물질의 균일한 또는 고의적으로 불균일한 분포를 달성하도록 개별적 시스템을 조정하는 것;항균 물질의 소모;낮 및/또는 밤 생성 주기의 제어;시간, 3차원 공간, 계절적 변화에 걸친 패턴을 감지하도록 상기 감지 시스템을 사용하는 것;측정된 신호에 추론되거나 추적된 패턴을 발송하는 것; 및별개의 공간에 걸쳐 설치된 상기 시스템의 상기 네트워크에 걸친 상기 항균 물질의 농도에서 관찰된 변화에 직접적으로 추적가능한 패턴을 감지하는 것;중 적어도 하나를 포함하는,시스템의 네트워크."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "항균 물질을 생성하고 모니터링(monitoring)하기 위한 시스템으로서:전산 시스템;항균 센서; 및항균 물질 생성기;를 포함하며, 상기 전산 시스템, 상기 항균 물질 생성기, 상기 항균 센서는 작동적으로 연결되는,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,상기 항균 물질은 이산화 염소인,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제23항에 있어서,외부 통신 장치를 더 포함하는,시스템.공개특허 10-2024-0017931-6-청구항 26 제23항에 있어서,하나 이상의 별도의 센서 서브 시스템을 더 포함하며, 상기 별도의 센서 서브 시스템은:센서 서브 시스템 마이크로프로세서 및 센서 서브 시스템 마이크로컨트롤러 중 적어도 하나;센서 서브 시스템 외부 통신 장치;센서 서브 시스템 항균 센서 및 센서 서브 시스템 환경 센서 중 적어도 하나; 및센서 서브 시스템 전산 시스템;을 포함하는,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제23항에 있어서,별도의 생성 서브 시스템을 더 포함하며, 상기 별도의 생성 서브 시스템은:생성 서브 시스템 마이크로프로세서 및 생성 서브 시스템 마이크로컨트롤러 중 적어도 하나;생성 서브 시스템 외부 통신 장치; 및생성 서브 시스템 항균 물질 생성기;를 포함하는,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제25항에 있어서,항균 센서 및 환경 센서 중 상기 적어도 하나, 상기 항균 물질 생성기, 상기 전산 시스템, 상기 외부 통신 장치는 처리중에 있는 밀폐된 용적 내에 배향된,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 26항에 있어서,적어도 하나의 센서 서브 시스템은 처리중에 있는 밀폐된 용적 내에 배향된,시스템."}
{"patent_id": "10-2024-7000443", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 27항에 있어서,적어도 하나의 생성 서브 시스템은 처리중에 있는 밀폐된 용적 내에 배향된,시스템."}
{"patent_id": "10-2024-7000443", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 태양에서, 항균성 가스를 생성하고 모니터링(monitoring)하기 위한 시스템으로서, 상기 시스템은: 마이크로프 로세서 및/또는 마이크로컨트롤러, 외부 통신 장치; 전산 시스템; 항균 센서 및/또는 환경 센서; 및 항균 물질 생성기를 포함하며, 상기 외부 통신 장치, 상기 전산 시스템, 상기 항균 물질 생성기, 상기 항균 센서 및/또는 (뒷면에 계속)"}
{"patent_id": "10-2024-7000443", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원에 대한 상호 참조 본 출원은 여기에 그 전체가 참조에 의해 편입되는, 2021년 6월 8일자로 출원된 PCT 특허 출원 PCT/US2021/036501의 우선권을 주장한다."}
{"patent_id": "10-2024-7000443", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인체 면역 결핍 바이러스 및 후천성 면역 결핍증(HIV/AIDS), 폐결핵(TB), 중증급성호흡기증후군(SARS), 에볼라 바이러스병(EVD) 및 코로나바이러스 병 2019(COVID-19)과 같은 전염병은 사람 대 사람의 직접 접촉을 통해, 감 염된 사람으로부터 퍼지는 공기 중의 비말을 호흡함으로써 간접적 접촉을 통해, 및 오염된 물체의 표면과의 접 촉을 통해 전염되는 접촉전염병이다. 현재 코로나19 팬데믹 발생으로, 마스크(facemask or respirator)를 쓰는 것과 사회적 거리두기를 하는 것은 잠 재적 이웃 인간 보균자에 의한 공기 중의 비말을 완화할 수 있다. 그럼에도 불구하고, 이들 행위 모드는 방어적 행동이며 공기 중의 비말 안에 있는 세균 또는 바이러스를 파괴하거나 살균하지 않는다. 현재 항균성 가스 또는 증기를 생성하도록 사용되는 방법은 일반 가정이나 사무실용이나 한정된 국소적 공간에서 개인용으로는 크고 비 실용적이며, 이산화 염소를 액체와 고체 전구체로부터 생성하는 방법은 느리고/느리거나 낮은 품질의 이산화 염 소 용액을 생성한다. 이산화 염소(ClO2)와 같은 항균성 가스는 단단한 표면상의 병원균에 대한 항균성 또는 비활성 물질로서의 효능을 보였다. 가스 형태로는, 이산화 염소는 3차원 공간에서 단단한 표면과 다공성 물질을 살균하는 능력을 발휘했다. 이산화 염소 가스는 또한 공기 중의 병원균을 죽이거나 또는 비활성화하는 것으로 나타났고, 공기를 통한 감염에 대해 예방하기까지도 하는 것으로 나타났다. 이산화 염소 가스는 또한 현재 차량, 실내 및 다른 밀폐된 공간에서 방취제로서 사용된다. 밀폐된 공간의 냄새 제거에 사용되는 전형적인 제품은 하나 이상의 건조한 (전형적으로 클로라이트염 및 활성제로 이루어지는) 고체 화학 구성요소를 담은 컵 또는 용기를 배치하는 것, 이산화 염소 생성 프로세스를 활성화하기 위해 물을 추가하 는 것, 공간을 개방하기 전에 연장된 구간동안 공간 내에 이산화 염소 생성 물질을 동봉하는 것, 사용된 이산화 염소 용액을 제거하는 것, 그리고 이산화 염소 농도를 안전한 레벨로 줄이도록 공간을 환기시키는 것을 포함한 다. 본 발명은 항균성 가스(예를 들면 이산화 염소 가스)를 빠르고 안전하게 생성시키는 안전하고 효과적인 시스템 과 방법에 관한 것이다. 항균성 가스는 소량의 농축된 액체 및 고체 전구체로부터 그리고 항균성 가스를 폐쇄된 3차원 공간으로 적극적으로 분산시켜 생성될 수 있다. 추가적으로, 본 발명은 폐쇄된 3차원 공간에서 항균성 가 스 농도를 감시하고 공간에서 원하는 농도를 유지하기 위해 필요한 만큼 추가적 항균성 가스를 생성하는 안전하 고 효과적인 방법에 관한 것이다. 낮은 농도에서(예를 들면 0.1 ppm 미만), 상기 항균성 가스는 공기 중의 병원 균을 줄이거나 비활성화하도록 그리고 공기를 통한 전염으로부터 사람을 적극적으로 보호하도록 사용될 수 있다."}
{"patent_id": "10-2024-7000443", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 또한 요구되는 항균성 가스를 생성하고 농도를 모니터링하는 안전하고 효과적인 시스템 및 방법에 관 한 것이다."}
{"patent_id": "10-2024-7000443", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 태양에서, 항균 물질을 생성하고 모니터링(monitoring)하기 위한 폐 루프 시스템이 제공되며, 상기 시스템은: 제어 서브 시스템을 포함하며, 상기 제어 서브 시스템은: 제어 유닛, 외부 네트워크를 연결하기 위한 하나 이상의 유선 통신 기구 및 무선 통신 기구를 포함하는 통신 서브 시스템; 하나 이상의 센서 - 상기 하나 이상의 센서는 환기된 상기 시스템의 일부분 상에 배향되거나 하나 이상의 플리넘 내에 담기며, 상기 제어 서브 시스템에 작동적으로 연결됨 - 를 포함하는 감지 서브 시스템; 생성 서브 시스템 - 상기 생성 서브 시스템은 혼 합 챔버를 포함하는 리액터를 포함하며, 상기 혼합 챔버에서는 항균 물질을 생성하도록 둘 이상의 시약이 결합 됨 - ;을 포함하며, 상기 항균 물질은 처리중에 있는 용적에 적용되고; 상기 감지 서브 시스템은 계속적으로 또 는 간격을 두고 처리중에 있는 상기 용적으로부터 공기를 샘플링하고 처리중에 있는 상기 용적으로부터 공기 내 에 존재하는 상기 항균 물질의 농도를 측정하고; 상기 생성 서브 시스템은 처리중에 있는 상기 용적으로부터 공 기 내에 상기 항균 물질의 상기 측정된 농도가 기정의된 임계 값 미만일 때 상기 항균 물질을 생성하는 것을 특 징으로 한다. 추가적으로, 또는 대안적으로, 상기 생성 서브 시스템은 목표값과 상기 감지 서브 시스템 측정값사이의 차이에 응답하여 상기 항균 물질을 생성하는 것을 특징으로 한다. 다른 일 태양에서, 항균성 가스를 생성하고 모니터링(monitoring)하기 위한 시스템이 제공되며, 상기 시스템은: 마이크로프로세서 및/또는 마이크로컨트롤러; 외부 통신 장치; 전산 시스템; 항균 센서 및/또는 환경 센서; 및 항균 물질 생성기;를 포함하며, 상기 외부 통신 장치, 상기 전산 시스템, 상기 항균 물질 생성기, 상기 항균 센 서 및/또는 상기 환경 센서는 상기 마이크로프로세서 및/또는 상기 마이크로컨트롤러에 작동적으로 연결되는 것 을 특징으로 한다. 상기 시스템은 별도의 센서 서브 시스템을 더 포함할 수 있으며, 상기 별도의 센서 서브 시스템은: 센서 서브 시스템 마이크로프로세서 및/또는 센서 서브 시스템 마이크로컨트롤러; 센서 서브 시스템 외부 통신 장치; 센서 서브 시스템 항균 센서 및/또는 센서 서브 시스템 환경 센서; 및 센서 서브 시스템 전산 시스템;을 포함하는 것 을 특징으로 한다. 상기 시스템은 별도의 생성 서브 시스템을 더 포함할 수 있으며, 상기 별도의 생성 서브 시 스템은: 생성 서브 시스템 마이크로프로세서 및/또는 생성 서브 시스템 마이크로컨트롤러; 생성 서브 시스템 외 부 통신 장치; 및 생성 서브 시스템 항균 물질 생성기;를 포함하는 것을 특징으로 한다. 다른 일 태양에서, 항 균성 가스를 생성하고 모니터링하기 위한 이들 시스템의 네트워크가 제공된다. 다른 일 태양에서, 이산화 염소 가스를 생성하고 모니터링(monitoring)하기 위한 시스템으로서, 상기 시스템은: 입구를 포함하는 장치 하우징; 마이크로컨트롤러 또는 마이크로프로세서; 시약을 담은 하나 이상의 시약 컨테이 너; 미세유체 액체 투여조제 및 계량 시스템; 상기 시약으로부터 이산화 염소를 생성하기 위한 미세유체 장치; 공기 펌프 통풍관 및 하나 이상의 출구에 대한 통풍관과 통신하여 이산화 염소 가스와 포스트-생성기 폐기물의 분리를 위한 장치; 처분 전 장치상 또는 장치내 폐기물 저장소; 및 이산화 염소 또는 상기 장치가 설치된 환경 에 대한 감지 시스템을 포함하는, 시스템이 제공된다. 다른 일 태양에서, 이산화 염소 가스 생성기로서: 압력 생성기를 포함하는 베이스; 액체 시약(들)을 담은 하나 이상의 시약 컨테이너로서, 상기 압력 생성기에 의해 가압되는 컨테이너; 상기 압력 챔버와 상기 시약 컨테이너 와 통신하는 챔버 통로; 상기 압력 생성기와 시약 컨테이너와 통신하는 하나 이상의 제어 밸브; 상기 챔버 통로 및 미세유체 칩과 통신하는 하나 이상의 제어 밸브; 상기 챔버 통로를 통과하는 상기 시약의 수량, 질량, 또는 용적을 판단하는 센서 시스템; 이산화 염소 가스 액체 분리 챔버와 통신하는 제2 챔버 통로; 및, 포스트 이산화 염소 생성기 폐기물의 저장 및/또는 비활성화를 위한 폐기물 컨테이너를 포함하는 것을 특징으로 한다. 대안적 으로, 하나 이상의 시약 컨테이너는 액체 투여조제 및 계량 시스템을 포함할 수 있으며, 상기 액체 투여조제 및 계량 시스템은 양변위 펌프(positive displacement pump, 예를 들면, 연동 펌프(peristaltic pumps))를 포함할 수 있으며, 상기 펌프 샤프트의 설정된 회전에 대하여 알려진 양의 액체 시약이 펌핑되며, 따라서 상기 챔버로 유입되는 액체 시약의 추가적인 측정이 요구되지 않는다. 다른 일 태양에서, 이산화 염소 가스를 생성하고 모니터링하기 위한 시스템의 네트워크로서, 상기 네트워크는: 이산화 염소를 생성하고 모니터링(monitoring)하기 위한 복수의 시스템을 포함하며, 상기 복수의 시스템은: 입 구를 포함하는 장치 하우징; 마이크로컨트롤러; 시약을 담은 하나 이상의 시약 컨테이너; 상기 시약으로부터 이 산화 염소를 생성하기 위한 미세유체 장치; 및 감지 시스템;을 포함하며, 상기 마이크로컨트롤러는 상기 복수의 시스템 사이의 통신이 가능한 통신 장치를 포함하며, 상기 통신 장치는 각 시스템의 마이크로컨트롤러의 분산 제어를 설정하고, 상기 마이크로컨트롤러는 시스템 성능을 변경하도록 머신 러닝 알고리즘에 의해 제어되는, 시 스템의 네트워크가 제공된다. 다른 일 태양에서, 항균성 가스를 생성하고 모니터링하기 위한 시스템의 네트워크로서, 상기 시스템은: 마이크 로프로세서 및/또는 마이크로컨트롤러; 외부 통신 장치; 전산 시스템; 항균 센서 및/또는 환경 센서; 및 항균 물질 생성기를 포함하며, 상기 외부 통신 장치, 상기 전산 시스템, 상기 항균 물질 생성기, 상기 항균 센서 및/ 또는 상기 환경 센서는 작동적으로 상기 마이크로프로세서 및/또는 상기 마이크로컨트롤러에 연결되는 시스템의 네트워크가 제공된다. 상기 시스템은 별도의 센서 서브 시스템을 더 포함할 수 있으며, 상기 별도의 센서 서브 시스템은: 센서 서브 시스템 마이크로프로세서 및/또는 센서 서브 시스템 마이크로컨트롤러; 센서 서브 시스템 외부 통신 장치; 센서 서브 시스템 항균 센서 및/또는 센서 서브 시스템 환경 센서; 및 센서 서브 시스템 전산 시스템; 을 포함하는 것을 특징으로 한다. 상기 시스템은 별도의 생성 서브 시스템을 더 포함할 수 있으며, 상 기 별도의 생성 서브 시스템은: 생성 서브 시스템 마이크로프로세서 및 생성 서브 시스템 마이크로컨트롤러 중 적어도 하나; 생성 서브 시스템 외부 통신 장치; 및 생성 서브 시스템 항균 물질 생성기;를 포함하는 것을 특징 으로 한다. 다른 일 태양에서, 상기 시스템의 상기 마이크로컨트롤러는: 생성 시스템 성능을 자동적으로 또는 사용자 제어 에 의해 변경하도록 사용될 수 있는 기압, 습도, 온도, 사용, 또는 소리와 같은 공간 환경 변수에 대한 이산화 염소 레벨을 위한 센서 시스템으로부터의 데이터에 대한 로컬 저장소 및 마이크로컨트롤러 작동; 유지, 경고, 문제 해결, 비활성 작동 모드, 활성 작동 모드 및 로컬 설정을 위한 시스템 성능 데이터의 저장은 물론 제어를 제공하기 위해 시약의 질량/용적 센서, 양변위 펌프의 회전 또는 선형 이동, 압력 생성기 성능, 미세유체 칩에 의한 센서, 밸브 상태와 같은 미세유체 서브 시스템으로부터의 데이터에 대한 측정, 로컬 저장소 및 마이크로컨 트롤러 작동;을 포함하지만 한정되지 않는, 이산화 염소 생성 시스템의 폐 루프 제어를 가능하게 하는 전산적 및 로컬 데이터 저장 능력을 가질 것이다. 다른 일 태양에서, 상기 시스템은 상기 마이크로컨트롤러 및/또는 전자 부품에 연결된 통신 장치를 갖고 있으며 그로 인해 상기 하우징 내에 있거나 또는 연결된 어느 전자 부품이든지 상기 마이크로컨트롤러에 의해 수집되고 국소적으로 저장되고, 작동될 수 있으며, 모바일에서 고정 장치로 외부 데이터 수집 시스템으로 전송될 수 있다. 다른 일 태양에서, 선형, 비선형, PID 제어, 머신 러닝 및/또는 인공지능 알고리즘이 시스템 성능을 자동적으로 또는 사용자 상호작용에 의해 변경하도록 상기 시스템 마이크로컨트롤러에 포함될 수 있다. 국소적 제어의 예시 는 주변 공기 내의 바이러스 또는 박테리아의 검출; 고도, 온도, 주변 공기 내의 이산화 염소의 농도에서의 변 화에 의해 측정된 주변 공기의 변화, 생물에 의한 사용의 변화, 사용자의 선호에 대한 변경; 사용 및 공실의 주 기의 예측, 상기 시스템의 정상적 또는 비정상적 성능의 진단 등에 대한 시스템 성능의 변경을 포함한다. 다른 일 태양에서, 각 시스템의 마이크로컨트롤러, 중앙화된 유닛 컨트롤, 및/또는 로컬 및 분산된 제어 모두의 결합의 조직화를 통해 분산된 제어를 위해 서로 상기 기재된 통신 장치를 통해 연결된 집단으로 배치된 복수의 공간 내에 있는 복수의 시스템. 다른 일 태양에서, 선형, 비선형, PID 제어, 머신 러닝 및/또는 인공지능 알고리즘은 상기 기재된 태양에 의해 상기 시스템의 분산된 네트워크 안으로 포함될 수 있다; 분산된 제어의 예시는 HVAC으로부터 이산화 염소 농도 의 변화로 인해 전체 빌딩 바닥, 다수의 바닥, 또는 전체 빌딩에 걸친 각 개별 생성기의 위치에서의 이산화 염 소의 균일한 및/또는 고의적으로 불균일한 분포를 달성하도록 개별적 시스템을 조정하는 것; 이산화 염소 가스 의 소모 또는 자가 소멸, 낮/밤 생성 주기의 제어; 시간, 3차원 공간, 계절적 변화부터 상기 시스템 내/상에 있 는 상기 센서 시스템에 의해 직접적으로 감지될 수 있는 이전 미지의 요인으로까지 걸친 패턴을 감지하는 것, 측정된 신호에 추론되거나 추적된, 또는 전염성 종의 통제가 요구되는 실제 세계 공간의 분명히 별개에서 변화 하는 상호접속까지에 걸쳐 설치된 시스템의 집합에 걸친 이산화 염소 농도에서 관찰되는 변화에 직접적으로 추 적가능한, 패턴을 감지하는 것을 포함한다. 다른 일 태양에서, 3차원 공간에서 이산화 염소 가스의 분산 및 모니터링을 위한 시스템이 복수의 작동 모드를 위해 설계될 것이다; 상기 제1 작동 모드는 사용되는 공간을 위해 설계되며, 상기 제2 모드는 미사용 공간을 위 해 설계되고 원하는 결과를 달성하도록 하나 이상의 서브 모드를 포함할 수 있다; 미래 사용자 또는 조작된 모 드가 추가될 수 있다. 이들 모드는 연결된 모바일 장치를 통해 및/또는 복수의 유닛에 연결된 중앙화된 분산된 제어 시스템을 통해 상기 유닛에 대하여 권한 있는 사용자에 의해 변경될 수 있다."}
{"patent_id": "10-2024-7000443", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "폐 루프(Closed Loop) 항균 물질 개념 하기 기재된 플랫폼 구성요소의 상호 접속을 포함하여 시스템이 제공될 수 있다. 도 1a-1c는 항균성 가스를 생 성하고 모니터링하는 시스템을 도시한다. 도 2a-2e는 항균성 가스를 생성하고 모니터링하는 시스템을 도시한다. 처리중에 있는 용적 내의 항균 작용제의 농도의 존재를 생성하고, 유지하고, 최적화, 및/또는 서류화하도록 시스템과 장치를 구현하도록 플랫폼 구성요소는 개별적으로 또는 결합되어 사용될 수 있다. (시스템(100, 200)과 같은) 상기 시스템은 처리중에 있는 용적의 대기에서 항균 작용제를 유지하는 능력이 있으며, 상기 시스템은: 처리중에 있는 용적에서 타겟 항균 물질 농도를 유지하도록 항균 물질의 방출 조절; 처리중에 있는 용적 내에 있는, 적어도 하나의 유형의 센서, 및 아마 여러 개의 센서 또는 여러 유형의 센서가 상기 항균 물질의 농도를 감지하도록 사용된다; 상기 항균 물질 농도 감지 및 처리중에 있는 용적에서 타겟 항균 물질 농도 사이의 측정된 차이를 비교할 수 있는 전산 시스템; 처리중에 있는 용적에서 타겟 항균 물질 농도의 초기 설정과 유지를 할 수 있는 (전산 시스템에 연결될 수 있는) 항균 물질 생성기; 타겟 항균 물질 농도와 감지된 항균 물질 농도 사이의 계산된 차 이가 판단된 경우, 타겟 제어는 타겟 항균 물질 농도를 유지하도록 항균 물질 생성을 조정할 수 있다; 상기 제품의 시스템(100, 200), 전자적 하드웨어, 펌웨어 내지 소프트웨어의 물리적 구성요소에서 적어도 하나의 기 본 안전 보장 구현;을 포함할 수 있다. 시스템(100, 200)은 미사용된 룸들이 처리될 수 있는 작동 모드는 물론, 사용된 공간에서 사람들 사이의 전염 또는 감염을 예방하는 작동 모드에 대해 설계될 수 있다. 항균 물질 농도를 유지하도록, 시스템(100, 200)은 효 율적으로 사용된 시스템 요소에 걸쳐 리필과 물리적 디지털 제어를 유지하도록 내구성 있는 재사용가능 구성요 소를 일회용 구성요소로부터 분리할 수 있다. 상기 항균 물질 관련하여, 미생물을 로그-킬(log-kill)하는 자기 악화 동역학 및 비활성화의 동역학은 처리중인 용적에서 항균 물질의 농도뿐만 아니라 그 외에도 달려 있을 수 있다. 따라서 시스템(100, 200)은 예를 들 면 강화된 타겟 제어, 자동화 용적 추정, 습도 측정 및 프로그램적 항균성 주기를 포함하는 머신 러닝 및 인공 지능을 사용하도록 시스템 (100, 200)을 가능하게 하는 환경 감지의 넓은 스펙트럼을 포함할 수 있다. 항균 물질 생성기의 설계는 전산 시스템의 일부일 수 있는 마이크로프로세서/마이크로컨트롤러 에 의해 수집된 신호를 사용하는 강화된 안전 보장을 가능하게 하도록 획득될 수 있는 전자 신호를 많은 경우 가질 수 있는 복수의 시스템을 활성화하도록 (양변위 펌프(positive displacement pump)를 포함하는) 물질 이동 을 사용할 수 있다. 시스템(100, 200)은 분산된 제품 노드의 상기 네트워크 조직화를 가능하게 하도록 상기 관심 변수의 분산된 시 스템 데이터를 이용하도록 설계된 연결성 네트워크를 형성하도록 외부 통신, 그리고 시스템(100, 200) 제 품에 내구성 있게 및/또는 가변적으로 공간적 및 시간적 식별 상수의 대응적으로 요구되는 전략을 사용할 수 있 다. 시스템(100, 200)은 항균성 대시보드 시스템을 생성하도록 플랫폼 구성요소의 결합을 사용할 수 있다. 시스템 (100, 200)은 감염 제어에 대한 과거는 물론 실시간 데이터를, 사용자 스스로의 공간에서, 또는 보건 관리 시설 과 같은 요구사항이 높은 시장에서 안전과 건강을 위해 제공할 수 있다. 상기 항균성 대시보드 시스템은 환경 감지의 데이터 레이크, 타겟 항균 물질 농도를 맵핑하도록 사용될 수 있고, 그리고 고유의 공간적 및 시간적 식 별에 의해 식별될 수 있는 상기 분산된 제품 노드상에서 분산 시스템 데이터를 전달하도록 상기 연결성 네트워 크를 사용할 수 있고, 이 모든 데이터를 인간에게 의미 있는 정보로 결합할 수 있다. 상기 지능(예를 들면 전산 시스템, 감지(예를 들면 센서, 그리고 생성(예를 들면 항균 물질 생성기 를 분산하는 것은 항균 물질 제어를 위한 공간의 디지털 트윈의 개발을 가능하게 하도록 할 수 있다. 이 개념은 추가적 네트워크 안전 보장 구현을 가능하게 하도록 할 수 있으며 예측적 항균 물질 제어와 같은 시스템 (100, 200) 제품에서 사전적 전략을 개발하고 효율적으로 사용하도록 상기 요구된 정보를 모두 담고 있을 수 있 다. 시스템(100, 200)은 빌딩의 실내를 위해 특정하게 설계된 제품 구현 선택사항을 달성하도록 복수의 방법에서 플 랫폼 구성요소를 결합하는 능력을 포함하며 공기 중의 항균 물질의 낮은 농도에 디지털 제어를 제공한다. 이 항 균 물질은 개방된 침투/누출 통로 및 공유 HVAC시스템을 통한 룸 부근의 실내의 기류를 통해 순환되는 미생물 및 미생물을 발산하는 것에 의해 야기되는 전염과 감염에 맞서 싸우도록 사용될 수 있다. 도 1a-1c에 도시된 바와 같이, 시스템은 외부 통신 장치, 마이크로프로세서/마이크로컨트롤러, 전산 시스템, 항균 물질 및/또는 환경 센서, 및 항균 물질 생성기를 포함하는 플랫폼 구성요소 를 포함할 수 있다. 시스템은 처리중에 있는 용적의 내부에 전체적으로 담겨 있을 수 있다. 선택적으 로, 시스템은 처리중에 있는 용적 내에 담겨 있고 항균 물질 농도 및/또는 환경 데이터를 포함하는 추가적 데이터가 제공되도록 구성된 하나 이상의 추가적 센서 서브 시스템으로 지원될 수 있다. 도 2a-2e에 도시된 바와 같이, 시스템은 센서 서브 시스템 및 생성 서브 시스템을 모두 포함할 수 있다. 센서 서브 시스템은 외부 통신 장치, 마이크로프로세서/마이크로컨트롤러(104A), 전산 시스 템, 및 항균성 및/또는 환경 센서를 포함할 수 있다. 생성 서브 시스템은 외부 통신 장치, 마이크로프로세서/마이크로컨트롤러(104B), 및 항균 물질 생성기를 포함할 수 있다. 시스템은 처리중 에 있는 용적의 내부에 전체적으로 담겨있을 수 있다. 도 2c에 도시된 바와 같이, 시스템은, 제1 태양에서, 처리중에 있는 용적 내에 있는 센서 서브 시스 템, 및 처리중에 있는 용적 외부에 있는 생성 서브 시스템을 포함할 수 있다. 제1 태양에서, 생 성 서브 시스템은 항균 물질을 생성하고 HVAC 공기 공급부에 유체 연결을 통해, 항균 물질을 처리중 에 있는 용적의 내부로 보낸다. 상기 처리중에 있는 용적 내의 항균 물질의 농도는 센서 서브 시스템 에 의해 감지된다. 도 2c에 도시된 바와 같이, 시스템은 제2 태양에서, 처리중에 있는 용적내에 있는 생성 서브 시스템 , 및 처리중에 있는 용적의 외부에 있는 생성 서브 시스템을 포함할 수 있다. 제2 태양에서, 생성 서브 시스템은 처리중에 있는 용적 내에서 항균 물질을 생성하고 HVAC 환기 수송관에 유체 연결을 통해, 센서 서브 시스템은 처리중에 있는 용적 내의 항균 물질의 농도를 감지한다. 도 2d에 도시된 바와 같이, 시스템은 처리중에 있는 용적 내의 센서 서브 시스템, 처리중에 있 는 용적 외부에 있는 생성 서브 시스템을 포함할 수 있으며, 생성 서브 시스템은 처리중에 있는 용적 내의 생성된 항균 물질을 배치하도록 처리중에 있는 용적 내에서 유체 연결된다. 도 2e에 도시된 바와 같이, 시스템은 처리중에 있는 용적 외부에 있는 센서 서브 시스템, 처리 중에 있는 용적 내의 생성 서브 시스템을 포함할 수 있으며, 센서 서브 시스템은 처리중에 있는 용적 내의 생성된 항균 물질 농도를 감지하도록 처리중에 있는 용적 내에서 유체 연결된다. 처리중에 있는 용적은 개념적으로 사용자가 항균 물질을 분산시키려고 하는 용적이다. 상기 용적은 상기 용적을 영구적으로 또는 일시적으로 일정 기간동안 분리시키도록 밀봉될 수 있다. 상기 용적은 항균 물질을 분 산시키기 전, 중 또는 후에 대기가 침투 및/또는 누출될 수 있는 개구부를 가질 수 있다. 상기 침투/누출은 상 기 용적 구성의 결과로 인한 비제어된 변수, 또는 대기의 침투/누출의 적극적인 제어 전략인 상기 용적의 특징 일 수 있다. 상기 타겟 용적은 인간이 업무, 활동, 엔터테인먼트 및/또는 거주를 위해 모이는 생활 공간일 수 있다. 따라서, 제품 타겟은 룸들이라고 호칭될 수 있는 용적일 수 있으며, 이는 평면도를 형성하는 룸들의 집단, 빌딩을 형성 하는 평면도의 컬렉션, 및 시설을 포함하는 빌딩의 컬렉션을 갖는 것일 수 있다. 모듈형 플랫폼 구성요소는 처리중에 있는 다른 용적으로 연장될 수 있으며, 이는 예를 들면: 자동차, 기차, 지하철, 비행기, 레저용 자동차, 라이드 셰어 차량, 자율주행 차량, 선박의 캐빈 등의 인테리어와 같은 이동 차량; 레스토랑, 나이트클럽, 바, 교회, 커뮤니티 센터, 도서관 등과 같은 레저 공간; 병원 병실, 수술실, 시술실, 환자 검사실, 사육실, 시체실 등과 같은 병원 공간; 및 사무실, 회의실, 복도, 카페, 커피 와 라운지 구역 등과 같은 비즈니스 공간을 포함한다. 타겟 항균 물질 농도는 처리중에 있는 용적 안으로 항균 물질 배출을 위해 요구되는 설정값일 수 있다. 공 기 중에 있는 항균 물질의 농도는 백분율, 백만분율(ppm), 십억분율(ppb), 및 유사한 용어와 같은 상대적 비율 로 표현될 수 있다. 여기서 상기 용어가 사용되는 바와 같이, ppm과 ppb는 용적에 기반한다. 국제 표준 용어가 흔히 산업용 화학약품이 어떻게 규제되느냐와 유사하게 항균 물질 농도를 설명하도록 사용된 다. 시스템(100, 200) 제품 설계에 중요한 것은 사람들이 살고, 일하고 노는 실내의 공기를 처리하도록 하는 것 이다. 처리중에 있는 용적 내의 공기 중의 항균 물질 농도에 대한 규제적 용어는: 권장/허용 노출 한 도, 약칭 \"REL/PEL\" (recommended/permitted exposure limit)은 과거 연구와 증거에 기반하여 인간의 사용에 안전한 농도와 시간 노출 한도이고; 생명 또는 건강에 즉시 해로운, 약칭 \"IDLH\"는, 인간에 노출되면 빠르 게 해로운 반응을 야기하기 시작할 수 있는 농도이고; 50% 치사량 농도, 약칭 \"LC-50\"는 공기 중 농도에 대 한 시간 기반 노출로 해당 농도에서 실험 시간동안 노출된 동물의 50%의 치사량을 보이는 농도이고; 50% 치 사량 투여, 약칭 \"LD-50\"는 단일의 많은 투여량으로부터 50%의 치사율이 관찰되는 동물 실험으로부터 추론되는 즉각 투여량이며, 이는 공기 중의 농도에서 거의 즉각 치사량으로 측정되는 공기를 포함한다. 상기 제1 타겟 항균 물질 농도는 후술할 , 및 을 포함한다: 사용중인 용적에서 예방 모드: 규제 기관으로부터 알려지고 공개된 REL/PEL에 전형적으로 근거를 두지만 반 드시 구속되지는 않는, 단순한 타겟 번호. 상기 예방 모드의 목적은 의미 있는 길이의 시간동안 인간이 사용할 수 있는 공기 중에 있는 항균 물질의 알려진 안전한 농도를 유지하는 것이며, 의미 있는 길이의 시간이란 전형 적으로 8시간에서 10시간 사이의 \"근무 교대\"의 문맥에서 안전 규제기관에 의해 정의된 것이다. 상기 농도의 목 적은 룸에 이미 존재하거나, 다른 생명체에 의해 룸으로 방출되거나, HVAC과 같은 룸 시스템에 존재하는 미생물 의 전염 포텐셜 및/또는 감염 포텐셜을 한정 및/또는 제거하는 것이다. 미사용중인 용적에서 제독 모드: 규제 기관으로부터 알려지고 공개된 IDLH에 전형적으로 근거를 두지만 반 드시 구속되지는 않는, 단순한 타겟 번호. 상기 제독 모드의 한 목적은 공기 중의 항균 물질의 높은 농도 레벨 의 사용을 가능하게 하는 것이며, 이는 더 빠른 제거가 필요한 미생물, (포자와 같이) 더 살균하기 어려운 미생 물, 또는 전형적으로 살균하기 쉽지만 분명한 위치에서 숨겨진 위치까지 영양분이 많은 토양이나 유체 내에서 부분적으로 보호된 미생물, 및 처리중에 있는 특정 용적에서 의심되거나 확정된 미생물을 비활성화/살균하 는데 필요한 시간을 줄일 수 있다. IDLH에 가깝거나 미만인 범위를 타겟하는 것은 사고로 인해 또는 의도적으로 처리중에 있는 용적으로 걸어 들어가는 사람이 눈물, 코의 염증 및 다른 즉시 해롭지만 치명적이지는 않은농도와 같은 IDLH와 관련된 효과를 알아챌 개연성을 포함한다. 비상 제독 용적: 고도로 위험한 농도의 및/또는 고도로 저항력이 강한 종의 미생물이 처리중에 있는 용적 의 비상 제독을 요구하는 곳에서 잠재적으로 선택된 타겟 수량. 처리중에 있는 용적이 격리되고 비워 지면, 시스템(100, 200) 제품은 권한 있는 사용자들에 의해 더 높은 농도 \"민방위 모드\" 농도를 수행하도록 설 정될 수 있으며, 상기 농도는 LC-50 및 LD-50에 있거나 초과하며, 따라서 어느 정도의 사용자 상호작용과 그와 같은 모드가 자동화된 모드가 되지 않도록 물리적 안전 보호 장치를 구현하는 것을 요구한다. 센서와 센서 서브 시스템은 처리중에 있는 용적에서 상기 항균 물질의 농도를 판단하도록 폭넓 은 범위의 감지 기술을 포함할 수 있다. 이들 감지 기술 중 어느 하나 또는 그 결합은 많은 다양한 종류의 항균 물질에 사용될 수 있으며, 이는 예를 들 면 이산화 염소를 포함하며, 이는 산화성 항균 물질의 한 종류의 일부이며, 추가적으로: 과산화 수소, 건조 과 산화 수소, 오존, 산화 질소를 포함할 수 있다. 시스템(100, 200)은 디지털 제어를 달성하도록 하기 다음 센서의 후술할 및 의 어떠한 조합이든지 포함할 수 있다: 항균 물질과 반응하는 소모성의 화학약품을 사용하는 전기화학 센서, 그리고 전하, 전압, 전류, 도전성, 저항성 등을 사용하여 이 화학 반응의 효과를 측정하여 상기 센서의 알려진 능력 범위에 비례하 여 신호를 제공하는, 전기 회로. 이산화 염소에 대한 전기화학 센서의 예시는 애널리티컬 테크놀로지 (Analytical Technologies, Inc.)로부터의 센서를 포함한다; MOx 센서(산화 금속 반도체 센서)가 공기의 질 측정에서 널리 쓰이고 있으며, 전형적으로 H2S, 휘발성 유기 화합물과 같은 공기 중의 오염물질에 대해 쓰이 고, 가스성 산화성분을 감지할 수 있다고 알려져 있다. 이들 MOx 센서의 두 예시는 Sensirion SGP40과 Renesas ZMOD4410 계통의 센서다. 전기화학 센서에 비한 MOx 센서의 이점은 후술할 (a), (b) 및 (c)를 포함한다: (a) 고갈되는 화학약품 없이 10 년의 수명; (b) 보정 및 교육 값이 센서의 수명동안 남는다; (c) 센서는 관심 종류의 가스에 \"학습될 수 있다.\" 센서가 학습될 수 있는 가스의 수는 센서의 화학약품 종류에 의해 한정되지 않고, 따라서, 전기화학 센서와는 대조적으로, 하나의 MOx 센서는 다수의 관심 종류의 항균 물질을 감지하도록 사용될 수 있으며, 또한 상호 보완 적이고 잠재적으로 간섭하는 가스도, 그 종류에 특이성을 제공하기 위해 다른 화학약품, 멤브레인, 또는 다른 상호작용/배리어 방법을 사용하지 않고 감지하도록 사용될 수 있다. 대안적으로 감지하는 해결책이 사용된 용적에서 예방 모드에서 기대되는 농도의 십억분율에서 조분율 레벨로 항 균 물질 종류를 감지하는 것이 가능할 수 있다. 이들 대안은 후술할 및 를 포함한다: 색채 분석: 관 심 항균 물질 종류와 상호 작용하고 관찰될 수 있는 반응을 야기하는 \"염료\" 화학약품을 사용하는 것은 전자 색 채 센서가 된다. \"색채\"는 가시광선, 적외선, 자외선, 및 다른 파장의 빛의 스펙트럼일 수 있다. 이와 같은 시 스템의 기본적인 출력은 이와 같은 감지 기술을 보강하는 알려진 화학적 상호작용에 예상되는 “색 변화”에 비 례하는 전자 신호일 것이다; 형광성: 항균 물질 종류가 형광성이거나 또는 선택적이고 형광성을 통해 감지 될 수 있는 화학 약품 종류에 구속될 수 있다면, 상기 형광성의 크기는 감지될 수 있고 알려진 재료에 보정되어 감지된 형광성 레벨과 상기 형광성에 비례하는 전자 신호를 해석하도록 할 수 있다. 전자 및/또는 전산 제어 (전산 시스템)는 시스템(100, 200) 제품의 \"심장\" 및 \"두뇌\"의 역할을 한다. 전자 아날로그, 필드 프로그램 가능 게이트 어레이(FPGA, field-programmable gate array), 및 이산회로적 방법이 제어를 할 수 있는 반면, 저전력 배터리 연결 제품을 위해 설계된 디지털 해결책은 특히 무선 시스템(100, 200) 제품에 유익하다. 마이크로프로세서 또는 마이크로컨트롤러는 시스템(100, 200) 제품의 제어 지능 근간을 형성할 수 있다. 마이크로프로세서는 특정 단순 안전 보장 시스템의 실시예에 이들이 요구될 수 있으므로 사용될 수 있다. 마이크로프로세서 유닛은 상기 시스템(100, 200) 플랫폼 구성요소의 모든 요소에 전기적으로 연결된 중앙 처리 코어일 수 있다. 항균 물질 생성기는 처리중에 있는 용적으로 항균 물질의 생성 및/또는 분산의 역할을 맡은 다양한 서브 구성요소 중 어느 것이든지 해당된다. 아주 다양한 항균 물질 생성기가 여기서 논해지며, 이는 후술할 , 및 을 포함한다: 압축된 물질 배출: 압축된 상태로 저장된 항균 물질이 감압 레귤레이터에 의해 배출된다. 예를 들면, 항균 성 가스의 캐니스터가 감압 레귤레이터에 연결되고, 감압 레귤레이터는 열릴 때 압축된 항균성 가스가 상기 캐니스터에서 비압축된 상태로 흘러 나오도록 한다. 압축된 상태에서 비압축된 상태로 상기 물질이 변형되는 경로 에서 질량 유량 제어기는 배출된 항균 물질의 수량의 양적 측정을 제공할 수 있다. 둘 이상의 화학적 활성화: 둘 이상의 전구체가 결합되어 원하는 항균 물질을 생성하는 화학 반응을 야기하 도록 한다. 상기 둘 이상의 전구체는 반응 동역학을 가속화하도록 미세유체적 구조를 포함하는 소극적 또는 적 극적 구조로 섞일 수 있다. 이 개념을 사용하는 여기 포함된 시스템의 예시는 하기에 제한되지 않고 하기를 포 함한다: 리액터(1800, 1900, 2000, 2100 및 2200); 가스 생성기(2300, 2400 및 3000); 가스 리액터; 항 균 물질 생성기(3100 및 3200); 및 에어로졸 용기(3486 및 3586). 전기화학 활성화: 전압 전위 및/또는 전류는 종의 배출과 항균 물질 생성의 동역학을 제어하도록 변동될 수 있다. 일 태양에서, 플로우-쓰루 전기화학 전지(flow-through electrochemical cell)이라고 지칭되는, NaClO2는 그로부터 Na의 전기화학적 벽개(electrochemical cleaving)에 의해 고갈될 때까지 전극 위로 흐르고 재활용될 수 있다. 다른 일 태양에서, 상기 전구체 물질은 상기 벌크 유체가 고갈될 때까지 NaClO2로부터 Na의 전기화학 적 벽개를 발생시키도록 전극이 공존하는 정적 용적에 담겨질 수 있다. 다른 일 태양에서, 이산화 염소는 NaClO2의 용액으로부터 전기화학적으로 멤브레인에 의해 음극액으로부터 분리된 양극액으로서 생성된다. 각 양극 액과 음극액은 적어도 하나의 전극과 통신하며, 멤브레인은 수율 또는 원하는 종류의 항균 물질(예를 들면, 이 산화 염소)을 증가시키는 적극적인 역할을 하는 반면, 나트륨(이 예시에서는 이산화 염소에 대한 나트륨)과 같 은 음극액에서 원치 않는 종류를 격리시키는 적극적인 역할을 한다. 다른 일 태양에서, 아염소산 나트륨의 얇은 레이어가 닫힌, 개방된, 또는 일방적인 멤브레인 채널에서 흐르며, 여기서 물질은 고갈된 전구체가 폐기물 용기 로 전달된 후 소량의 NaClO2로부터 이산화 염소만이 생성되도록 설계된 전기화학 전지로 도입될 수 있고, 상기 프로세스는 반복된다. 시스템(100, 200)은 내구성 있는 재사용가능 구성요소와 일회용 구성요소를 포함하는 플랫폼일 수 있다. 상기 일회용 구성요소는 리필 카트리지를 포함할 수 있다. 상기 리필 카트리지는 전구체 또는 직접적 항균 물질을 농 축된 형태로 포함할 수 있다. 리필 카트리지는 리저버(reservoir)를 포함할 수 있다. 리필 카트리지는 마모로부 터 실패하기 쉬운 플랫폼 구성요소를 포함할 수 있으며, 이는 예를 들면, 펌프, 센서 등을 포함할 수 있다. 시스템(100, 200)은 상기 기재된 바와 같은 모드의 변경을 달성하도록 디지털 및 물리적 신호를 포함할 수 있다. 시스템(100, 200)은 사용 중이거나 사용되지 않고 있는 처리중에 있는 용적에서 사용될 수 있다. 이와 같이, 한 클래스의 리필 카트리지는 사용 중인 처리중에 있는 용적 모드(예를 들면 사용되는 용적에 서 예방 모드)와 REL/PEL 농도 레벨에서 설치된 베이스 유닛으로 하여금 작동하는 것을 한정하도록 하는 기기 (물리적, 전기적/디지털, 또는 둘 다)을 포함할 수 있다. 다른 한 클래스의 리필 카트리지는 제독 모드(예를 들면 미사용 중인 용적에서 제독 모드)에서 설치된 베이스 유닛으로 하여금 작동하도록 하는 기기(물리적, 전기적/디지털, 또는 둘 다)을 포함할 수 있다. 추가적 특징은 상기 제독 모드 카트리지를 설치하도록 권한이 있는 사용자의 부분집합에 설치를 한정하는 기기를 포함할 수 있 다. 이들 특징은 사용중인 공간에는 부적절할 제독 모드를 잠금 해제하도록 적절한 전자적 또는 디지털 권한(예 를 들면 코드, 키카드 스와이프, 생체 패스 등)을 입력하는 요구사항을 포함할 수 있다. 이와 같은 제독 모드는 IDLH 또는 더 높은 농도를 이용할 수 있고 규칙적이거나 예외적인 \"딥-클린(deep-clean)\" 시나리오에 적합할 수 있다. 시스템(100, 200)은 항균성 대시보드 시스템을 생성하도록 플랫폼 구성요소의 결합을 사용할 수 있다. 상기 대 시보드 시스템은 상기 시스템에 걸쳐 분산 지능, 분산 데이터, 및 다른 플랫폼 구성요소를 결합하여 유익한 시 스템 특징을 가능하게 하도록 할 수 있으며, 이는 예를 들면: 항균성 처리를 위한 룸, 바닥, 빌딩 제어 대 시보드; 베이스 유닛 인근에 있는 전화에 통지 제공; 물리적으로 근접한 처리중인 용적에서 시스 템(100, 200) 조직화; 단일 근접 용적(예를 들면 콘서트 홀처럼 큰 개방된 공간)에서 복수의 유닛의 항균성 출력 조직화; 병원 지휘본부와 같이 빌딩 관리 시스템 안으로 통합을 위한 데이터 휴대성; 및 생물학적 위협 또는 공격을 위한 민방위 경보 네트워크;를 포함한다. 각 시스템(100, 200) 유닛은 (IoT 연결)을 데이터 수집 및 저장, 소프트웨어 및 펌웨어 업데이트, 및/또는 사용 자 상호작용을 위한 목적으로, 이하의 내지 을 할당하도록 안전하게 연결할 수 있다: 각 하드웨어 유닛에 대한 고유 식별자; 각 리필 유닛에 대한 고유 식별자; 및/또는 다양한 유형의 리필 유닛 (저농 도 사용중 모드일 때 하나, 미사용중 제독 모드를 변경하도록 권한 있는 사용자를 위한 다른 하나).추가적으로, 각 시스템(100, 200) 유닛은 서로 안전하게 (외부 통신을 통해) 연결되고 데이터 수집 포인트 로 기록된 작동적 성능 데이터는 물론 식별 검증 데이터를 전달할 수 있다. 각 유닛은 그 스스로의 데이터를 기 록할 수 있으며, 여유와 안전을 위해 필요할 경우, 이웃하는 유닛 데이터도 기록할 수 있다. 일 태양에서, 각 유닛은 상호연결성을 달성하도록 와이파이 허브에 연결될 수 있다. 다른 일 태양에서, 모든 유닛은 중앙 식별 검증 및 데이터 수집 포인트에 연결되도록 요구될 수 있다. 전산 시스템은 각 시스템(100, 200) 유닛에 대한 로컬 저장 매체를 포함할 수 있다. 대안적으로, 하나의 유닛은 저장 능력을 가질 수 있고 논리적 집단화에서 복수의 유닛을 위한 누산기로서의 역할을 할 수 있다. 모 든 유닛 또는 모든 누산기는 중앙 데이터 수집 포인트 안으로 보고를 올리도록 요구될 수 있으며, 상기 중앙 데 이터 수집 포인트는 또한 클라우드 데이터 안으로 연결의 포인트일 수 있다. 일 태양에서, 시스템(100, 200) 유닛은 이하의 내지 를 포함하는 안전 특징을 가질 수 있다: 각 유 닛으로부터 수신된 입력으로서, 위치, 환경 센서 세트, 항균 물질 센서 데이터, 생성된 항균 물질의 수량, 및/ 또는 대응하는 타임 스탬프를 포함하는 입력한다; 후술하는 (i) 내지 (iii)에 기반하여 가능한 안전 신호 생성을 포함하는 사용자 및/또는 시스템 제어에 대한 출력한다: (i) 앞뒤가 맞지 않는 작동적 파라미터 및 그에 따라 고장나 있을 수 있는 특정 유닛, (ii) 이웃하는 유닛이 에러를 겪는다는 인식은 유닛의 로컬 그룹 중에서 “경보 상태”를 시작할 수 있고, 유닛의 로컬 그룹은 두 로컬 유닛 사이에서 공기 흐름에 의한 상호작용이 간 섭을 야기할 경우 전력이 꺼질 수 있음; (iii) 클라이언트 및/또는 호스트 작동 제어: 상기 제어 시스템은 유닛 의 전체적인 설치에 걸쳐 앞뒤가 안 맞는 파라미터의 신호가 나타나기를 기다림. 시스템(100, 200)은 머신 러닝 알고리즘을 포함할 수 있다. 예를 들면, 머신 러닝 알고리즘은 멀티 센서 세트를 사용하여 처리중에 있는 용적에서 공기 중의 미생물 농도의 적어도 두 기본적인 특징을 측정하고 분류하도 록 할 수 있다. 시스템(100, 200)은 처리중에 있는 주어진 어떤 용적이든지 자동적으로 측정하는 능력을 포함할 수 있다. 센서 어레이는 처리중에 있는 용적 내에서 타겟 농도에 측정된 값으로부터 상기 농도를 움직일 요구 되는 벌충 항균 물질의 값에 상기 공기 중의 농도로부터 생성기 폐루프 성능이 해석되도록 자동적으로 룸 의 용적을 측정하도록 사용될 수 있다. 시스템(100, 200) 유닛은 초기화 시에 상기 항균 물질의 알려진 테스트 수량을 발생시키고 발산할 수 있다. 상기 유닛은 1분 내지 4시간 사이의 구간동안 하는 것 없이 생성기가 유지 되는 동안 계속적 항균 물질 센서를 초기화할 수 있다. 유닛상 전산 능력은 피크 농도를 측정하고 머신 러 닝 태양 1(\"ML1\")을 사용하여 룸의 동역학을 측정하도록 한다. 농도 = 항균 물질의 질량 (감지되고 조제된 항균 물질 용적으로부터 도출된 것으로, 직접적 또는 간접적으로 감지된 전구체 이용, 항균성 가스의 질량 흐름 측정, 또는 수량으로 추적될 수 있는 어떤 다른 값)을 처리중에 있는 용적의 용적으로 나눈 것으로 이해한 다. 상기 처리중에 있는 용적의 용적은 생성된 항균 물질의 측정된 수량과 ML1으로 측정된 룸의 동역학에 적절한 시간에 측정된 항균 물질 농도 측정값을 사용하여 판단된다. 시스템(100, 200)은 타임 스탬프에 의해 변 화를 카탈로깅하는 동안, ML1 룸의 동역학을 갱신하도록 각 항균성 가스 발산을 반복할 수 있다. 머신 러닝 태 양 2(\"ML2\")가 상기 데이터 레이크 또는 직접적 확인 실험으로부터 \"학습\"하면서, 미래 알고리즘은 처리중에 있 는 용적 내의 환경 조건에 기반한 원하는 농도를 달성하도록 필요한 항균 물질의 특정 수량을 예측하도록 상기 생성기에 입력 데이터를 제공하도록 설계될 수 있다. 대안적으로, 또는 백업 기법으로서, 시스템(100, 200)은 3차원 레이저 측정 시스템을 사용하거나, 또는 CHIRP 음향 신호를 갖는 처리중에 있는 용적의 용적 통신상태를 테스트하도록 유닛상의 마이크와 톤 이미터(tone emitter)를 사용할 수 있다. 비행의 시간과 음파의 충돌을 측정하여, 시스템(100, 200)은 처리중에 있는 용적의 특징적인 용적 추정치를 만들어낼 수 있다. 도 3 및 4는 (살균 가스 및/또는 제독 가스를 포함하는) 항균성 가스를 생성하고 모니터링하기 위한 예시적 시 스템(300 및 400)의 개략도를 도시한다. 상기 항균성 가스는 이산화 염소 가스일 수 있다. 시스템(300 및 400) 은 미세유체적 조제 및 계량 시스템을 포함할 수 있다. 시스템(300 및 400)은 상기 주변 환경에 항균성 가스(예 를 들면 이산화 염소 가스)를 생성하고 상기 항균성 가스(예를 들면 이산화 염소 가스)를 조제하도록 사용될 수 있으며, 주변 공기의 샘플을 수집하여 그 안의 항균성 가스 농도를 식별하고 더 많거나 더 적은 항균성 가스를 필요한 만큼 생성하여 원하는 항균성 가스 농도를 유지하도록 할 수 있다. 시스템(300 및 400)은 공기 중의 십 억분율(ppb)로 항균성 가스(예를 들면 이산화 염소 가스)의 농도를 판단하도록 특정 환경(예를 들면 밀폐된 3차 원 공간)에서 공기를 테스트하도록 사용될 수 있다. 시스템(300 및 400)은 정기적으로 주변 공기를 샘플링하고, 상기 주변 공기에서 항균성 가스의 농도를 판단함으로써, 그리고 장치의 폐루프 제어를 통해, 주변 공기에서 상 기 원하는 항균성 가스 농도를 유지하도록 더 많거나 더 적은 항균성 가스를 생성함으로써, 시스템(300 및 400)을 하우징하는 장치를 둘러싼 주변 공기에서 원하는 항균성 가스를 유지하도록 사용될 수 있다. 시스템(300 및 400)은 컴퓨터 네트워크, 클라우드 저장소 등으로의 유선 연결을 포함할 수 있다. 시스템(300 및 400)은 컴퓨터 네트워크, 클라우드 저장소 등으로의 무선 연결을 포함할 수 있다. 시스템(300 및 400)은 시스템 사용의 시간 기반 추적, 제품 유지, 타겟 농도 성능 및 관심있는 환경적 파라미터를 문서화할 수 있다. 이 문서 화는 파일, 일지, 또는 다른 기록으로서 시스템(300 및/또는 400)을 하우징하는 장치 내에 지역적으로 저장되거 나 컴퓨터 네트워크로, 클라우드 저장소 등으로 유선 연결 또는 무선으로 전송될 수 있다. 시스템(300 및 400) 은 처리중에 있는 밀폐된 3차원 공간에서 시스템(300 및/또는 400)을 하우징하는 장치를 사용자 인격으로 하여 금 설정하고, 학습시키고, 관리하고 유지할 수 있도록, 그리고 실시간 및 저장된 성능 및 환경 데이터를 열람하 도록, 및/또는 동물과 인간 노출 실험과 같은 검증 테스트를 비교하도록 데이터를 내보내도록 클라우드 및/또는 사물인터넷(IoT) 연결성을 가질 수 있다. 시스템(300 및 400)은 고농도의 항균성 가스(예를 들면, 이산화 염소 가스)(사람들에 의해 사용되지 않을 경우) 또는 저농도의 항균성 가스(예를 들면 이산화 염소 가스)(사람들에 의해 사용중인 경우)를 통해 밀폐된 3차원 공간(예를 들면 병원의 병실)을 제독하도록 (즉, 병원체를 비활성화하거나 파괴) 사용될 수 있다. 일 태양에서, 시스템(300 및 400)은 미사용중인 밀폐된 3차원 공간을 제독하도록 1,000 ppb 내지 5,000 ppb 또는 50,000 내 지 300,000 ppb의 농도의 항균성 가스를 생성한다. 시스템(300 및 400)은 밀폐된 3차원 공간 내의 코로나19를 파괴할 수 있다. 시스템(300 및 400)은 저농도의 항균성 가스(예를 들면 이산화 염소 가스) 를 통해 (사람들에 의해 사용되거나 말거나) 밀폐된 3차원 공간(예를 들면 병원 병실)에서 바이러스의 전파 및/또는 생존을 예방하도록 사용될 수 있다. 일 태양에서, 시스템(300 및 400)은 100ppb 미만의 농도로 항균성 가스를 생성, 예를 들면 50ppb를 생성 하여 사용중인 밀폐된 3차원 공간 내의 바이러스의 전파 및/또는 생존을 예방한다. 시스템(300 및 400)은 코로 나19를 포함하는 바이러스의 에어로졸화된 바이러스 전염 및 감염을 줄일 수 있다. 시스템(300 및 400)은 공기 중의 병원체를 비활성화 및/또는 살균할 수 있으며, 공기를 통한 감염에 대해 예방하기까지도 할 수 있다. 시스템(300 및/또는 400)은 장치 하우징 내에 포함될 수 있다. 주변 공기는 장치 하우징 내의 하나 이상의 입구에 들어갈 수 있다. 주변 공기는 장치 하우징 내의 미립자 필터를 통과할 수 있다. 상기 미립자 필터는 어떤 대기중의 분자도 제외시킬 수 없다. 주변 공기는 하나 또는 모든 공기 펌프(308A, 308B, 및 308C) 안으로 장치 하우징으로부터 하나 이상 의 환기구를 통해 통과한다. 시스템은 공기 펌프(308A, 308B, 및 308C)를 포함하며, 시스템은 공기 펌프(308A 및 308C)를 포함하며, 이는 하기에 더 설명될 것이다. 마이크로컨트롤러은 시스템(300 및 400)의 모든 온보드 기능을 제어할 수 있다. 마이크로컨트롤러는 필요한 경우 시스템(300 및 400)의 기능을 변경하도록 작성될 수 있는 소프트웨어를 포함한다. 마이크로컨트롤 러는 유선 또는 무선 연결을 통해 시스템(300 및 400)의 다양한 요소(하기 더 설명됨)에 작동적으로 연결 된다. 마이크로컨트롤러는 도시된 바와 같이 공기 펌프(308A, 308B 및 308C)에 연결되며, 시작, 정지, 속도, 유 속, 압력 등 중 하나 이상을 포함하는, 공기 펌프(308A, 308B, 및 308C)의 기능을 제어한다. 공기 펌프(308A, 308B, 및 308C)는 디스크 펌프일 수 있다. 일 태양에서, 공기 펌프(308A, 308B, 및 308C)는 270 mbar를 초과하 는 압력, 0.55 L/min을 초과하는 유속, 220 mbar를 초과하는 진공을 생성할 능력이 있을 수 있다. 공기 펌프 (308A, 308B, 및 308C)는 별도의 모터 제어 유닛을 포함할 수 있다. 공기 펌프(308A, 308B, 및 308C)는 통합된 모터 제어 유닛을 포함할 수 있다. 시스템은 공기 펌프(308B)를 포함하지 않는 것으로 이해된다. 시스템에서 공기 펌프(308A 및 308B)는 압력 릴리이프 밸브(pressure relief valves, 310A 및 310B)에 연 결되며, 그로 인해 공기 펌프(308A 및 308B)에 의해 생성된 과잉 또는 불필요 압력은 시스템 밖으로 보내 질 수 있다. 시스템은 유사하게 같은 기능을 갖는 압력 릴리이프 밸브(310A)를 포함하지만 압력 릴리이프 밸브(310B)는 포함하지 않는다. 대안적으로, 도 6와 7에 도시된 바와 같이, 시스템(600 및 700)은 시약 컨테이 너(312A 및 3122B)가 시스템(600 및 700)의 조립 전에 가압되고 따라서 공기 펌프(308A 및 308B)가 불필요하므 로, 적어도 공기 펌프(308A 및 308b)를 제거할 수 있다. 시스템은 각각 다른 액체 시약(314A 및 314B)를 담고 있는 시약 컨테이너(312A 및 312B)를 포함한다. 시약 (314A 및 314B)은 이산화 염소 가스를 생성하도록 마이크로유체적 믹서 내에서 결합될 수 있다. 시약(314A 및 314B) 중 하나는 NaClO2(아염소산 나트륨)과 같은 액체 전구체일 수 있다. 시약(314A 및 314B) 중 다른 하나는 산/H+ 활성제와 같은 액체 활성제일 수 있다. 시스템에 대하여, 공기 펌프(308A)는 시약 컨테이너(312A)를 가압하며, 따라서 시약(314A)으로 하여금 전 자적으로 작동되는 정상적으로 폐쇄된 (마이크로컨트롤러에 의해 연결되고 제어되는) 밸브(316A) 안으로 통로를 통해 시약 컨테이너(312A)로부터 이동하도록 한다. 밸브(316A)로부터 시약(314A)은 (폐 루프 제어 신호 를 위해 사용되고 마이크로컨트롤러에 연결되고 데이터를 제공하는) 미세유체 흐름 센서(318A)를 통해 이 동하며, 미세유체 믹서안으로 들어간다. 어떤 압력 생성기든지 시약 컨테이너(312A)를 가압하도록 공기 펌 프(308A)를 대신하여 사용될 수 있음도 고려된다. 일 태양에서, 시약 컨테이너(312A)는 시스템의 조립 중 에 외부 소스(external source)에 의해 가압될 수 있으며, 시약 컨테이너(312A)에 연결된 밸브(예를 들면 밸브 316A)는 상기 기재된 바와 같이 일정 수량의 가압된 시약이 시약 컨테이너(312A)를 나와 미세유체 믹서안 으로 진입하도록 통로를 열어줄 수 있다. 이와 같은 시스템이 도 6에 도시되었다. 시스템에 대하여, 공기 펌프(308B)는 시약 컨테이너(312B)를 가압하며, 따라서 시약(314B)으로 하여금 전 자적으로 작동되는 정상적으로 폐쇄된 (마이크로컨트롤러에 의해 연결되고 제어되는) 밸브(316B) 안으로 통로를 통해 시약 컨테이너(312B)로부터 이동하도록 한다. 밸브(316B)로부터 시약(314B)은 (폐루프 제어 신호를 위해 사용되고 마이크로컨트롤러에 연결되고 데이터를 제공하는) 미세유체 흐름 센서(318B)를 통해 이동하 며, 미세유체 믹서안으로 들어간다. 어떤 압력 생성기든지 시약 컨테이너(312B)를 가압하도록 공기 펌프 (308B)를 대신하여 사용될 수 있음도 고려된다. 일 태양에서, 시약 컨테이너(312B)는 시스템의 조립 중에 외부 소스(external source)에 의해 가압될 수 있으며, 시약 컨테이너(312B)에 연결된 밸브(예를 들면 밸브 316B)는 상기 기재된 바와 같이 일정 수량의 가압된 시약이 시약 컨테이너(312B)를 나와 미세유체 믹서안 으로 진입하도록 통로를 열어줄 수 있다. 이와 같은 시스템이 도 6에 도시되었다. 미세유체 믹서는 낮은 무용공간 용적과 효과적인 섞임으로 전구체의 반응 동역학을 증가시키도록 평면 모 양일 수 있다. 미세유체 믹서에서 상기 시약(314A 및 314B)의 혼합물은 항균성 가스를 생성하며, 예를 들면 이는 이산화 염소 가스를 포함한다. 항균성 가스는 통로를 통과하여 배기가스 및 폐기물 챔버 안으로 갈 수 있다. 챔버 는 흡수 재료, 증발기 등을 포함할 수 있다. 챔버 내에서, 항균성 가스의 생성으로부터의 어느 폐기 물이든지 흡수 재료에 흡수될 수 있다. 챔버는 멤브레인을 포함할 수 있다. 항균성 가스는 주변 대기 안으 로 챔버를 빠져나갈 수 있다. 일 태양에서, 항균성 가스는 멤브레인을 통해 챔버를 빠져나간다. 시스 템(300 및 400)은 공기 펌프 통풍관 및 하나 이상의 출구에 대한 통풍관과 통신하여 항균성 가스(예를 들면 이 산화 염소 가스)와 포스트-생성기 폐기물의 분리를 위한 장치와 처분 전 장치상 또는 장치내 폐기물 저장소를 포함할 수 있다. 챔버는 항균성 가스와 포스트-생성기 폐기물의 분리를 위한 장치로서의 역할을 할 수 있 다. 챔버는 처분 전 장치상 또는 장치내 폐기물 저장소를 위한 장치로서의 역할을 할 수 있다. 챔버 는 항균성 가스와 포스트-생성기 폐기물의 분리를 위한 장치 및 처분 전 장치상 또는 장치내 폐기물 저장소를 위한 장치 모두로서의 역할을 할 수 있다. 시스템에 대하여, 시스템은 공기 펌프(308B), 압력 릴리이프 밸브(310B), 시약 컨테이너(312B), 시약 (314B), 밸브(316B), 또는 미세유체 흐름 센서(318B)를 포함하지 않는다. 더욱이 시스템은 미세유체 믹서 를 미세유체 전기화학 생성기로 대체한다. 시스템에서, 공기 펌프(308A)는 시약 컨테이너(312 A)를 가압하며, 따라서 시약(314A)으로 하여금 전자적으로 작동되는 정상적으로 폐쇄된 (마이크로컨트롤러(30 6)에 의해 연결되고 제어되는) 밸브(316A) 안으로 통로를 통해 시약 컨테이너(312A)로부터 이동하도록 한다. 밸 브(316A)로부터 시약(314A)은 (폐루프 제어 신호를 위해 사용되고 마이크로컨트롤러에 연결되고 데이터를 제공하는) 미세유체 흐름 센서(318A)를 통해 이동하며, 미세유체 전기화학 생성기안으로 들어간다. 미세유 체 전기화학 생성기 내의 마이크로컨트롤러에 의해 제공되고 제어되는 전기적 전류는 이산화 염소 가 스와 같은 항균성 가스를 생성하는 미세유체 전기화학 생성기 내의 시약(314A)과의 반응을 야기한다. 항균 성 가스는 미세유체 전기화학 생성기로부터 챔버 안으로 통과하며 궁극적으로는 시스템에 대하 여 설명된 바와 같이 주변 환경으로 들어간다. 어떤 압력 생성기든지 시약 컨테이너(312A)를 가압하도록 공기 펌프(308A)를 대신하여 사용될 수 있음도 고려된 다. 일 태양에서, 시약 컨테이너(312A)는 시스템의 조립 중에 외부 소스(external source)에 의해 가압될 수 있으며, 시약 컨테이너(312A)에 연결된 밸브(예를 들면 밸브 316A)는 상기 기재된 바와 같이 일정 수량의 가 압된 시약이 시약 컨테이너(312A)를 나와 미세유체 믹서안으로 진입하도록 통로를 열어줄 수 있다. 이와 같은 시스템이 도 7에 도시되었다.전자적으로 작동되는 정상적으로 폐쇄된 밸브(316A, 316B)는 마이크로컨트롤러에 의해 제어될 수 있으며, 전력이 제공되지 않을 때 밸브(316A, 316B)가 폐쇄되도록 배향될 수 있다. 유사하게, 전력이 제공될 때, 밸브 (316A, 316B)는 개방된다. 미세유체 흐름 센서(318A, 318B)는 시약(314A, 314B)의 흐름을 각각 감지할 수 있으며, 마이크로컨트롤러 로 그 흐름에 대한 데이터를 제공할 수 있다. 이와 같은 데이터는 유속, 유량, 유출 시간, 질량 등을 포함할 수 있다. 시스템(300 및 400)은 기압 센서를 포함할 수 있다. 기압 센서는 시스템(300 및 400)이 작동하는 밀 폐된 3차원 공간 내의 압력을 감지할 수 있다. (HVAC 환기 시스템이 룸으로부터 공기를 빼거나, 문 또는 창문이 열려 있거나 등을 나타내는) 부압(negative pressure)을 감지할 때, 기압 센서는 상기 부압을 마이크로컨 트롤러와 그의 통신을 통해 통신하며, 이 때 마이크로컨트롤러는 중립 압력(neutral pressure) 및/또 는 정압(positive pressure)이 기압 센서에 의해 감지될 때까지 항균성 가스(예를 들면 이산화 염소 가스) 생성을 정지할 수 있다. 중립 압력 또는 정압을 감지할 때, 기압 센서는 중립 압력 또는 정압을 마이크로 컨트롤러에 통신하며, 이 시점에서 마이크로컨트롤러는 다시 가스 생성(예를 들면 이산화 염소 가 스)을 개시할 수 있다. 시스템(300 및 400)은 공기 질 센서를 포함할 수 있다. 공기 질 센서는 예를 들면 습도, 온도 등을 포함하는 다양한 주변 공기의 특징 중 어느 것이든지 감지할 수 있다. 공기 질에 대한 데이터는 시스템(300 및 400)의 유효성을 평가하기 위해 기록될 수 있다. 대안적으로 항균성 가스(예를 들면 이산화 염소 가스)는 더 습한 환경에서 병원균을 파괴하는 것에 더 효과적일 수 있으므로, 습도 데이터가 예를 들면 마이크로컨트롤러 와 연결된 공기 질 센서를 통해 통신될 수 있으며, 이 때 마이크로컨트롤러는 습도 측정치에 기 반하여 주변 공기의 항균성 가스의 타겟 농도를 조정할 수 있다. 상기 기재된 시스템(300 및 400)의 태양, 방법, 프로세스는 시스템(300 및 400)의 각각에 의한 항균성 가스의 생성을 입증한다. 하기에는 주변 공기 내의 항균성 가스(예를 들면 이산화 염소 가스)의 농도를 판단하도 록 주변 공기를 샘플링하는 시스템(300 및 400)의 태양이 설명된다. 시스템(300 및 400) 모두에서, 주변 공기는 공기 펌프(308C)로 관에 의해 연결될 수 있으며, 이는 주변 공 기의 샘플로 하여금 농축기로 들어가도록 한다. 농축기는 항균성 가스(예를 들면 이산화 염소 가스)를 주변 공기의 거의 반자성인 다른 구성 요소로부터 분리할 수 있다. 농축기의 일 태양이 도 8a와 8b에 도시된다. 농축기는 매우 낮은 농도의 항균성 가스(예를 들면, 이산화 염소 가스)를 분리하고 농축할 수 있으며, 그로 인해 그 농도의 더 정확한 측정이 취득될 수 있다. 농축기는 항균성 가스로부터 반자성 가스를 분리하도록 자석을 사용할 수 있으며, 따라서 항균성 가스의 농축되고 증폭된 테스트를 할 수 있게 한다. 반자성 가스는 분리 후 주변 환경으로 돌려보내질 수 있다. 일 태양에서, 항균성 가스는 추가적인 농축 테스트 전에 적어도 100배 증폭될 수 있다. 시스템(300 및 400)은 감지 시스템을 포함할 수 있다. 감지 시스템은 항균성 가스(예를 들면 이산화 염소 가스)의 (농축기에서 처리 후 100배 이상 증폭될 수 있는) 농도를 감지할 수 있다. 감지 시스템(32 6)은 주변 공기에서 항균성 가스(예를 들면 이산화 염소)의 농도의 시간 가중 평균 농도를 측정할 수 있다. 상기 농도에 대한 데이터는 마이크로컨트롤러에 전달되고, 만일 필요하다면, 마이크로컨트롤러(30 6)는 시스템(300 또는 400)으로 하여금 더 많거나 더 적은 항균성 가스를 감지 시스템에서 측정된 농도에 기반하여 생성하도록 한다. 따라서, 시스템(300 및 400)은 주변 공기에서 항균성 가스(예를 들면 이산화 염소 가스)의 농도를 측정할 수 있고, 만일 농도가 타겟 농도 미만일 경우, 마이크로컨트롤러는 시스템(300 또는 400)으로 하여금 상기 샘플링된 주변 공기가 상기 타겟 농도 임계치에 도달할 때까지 주변 공기에서 항균성 가스(예를 들면 이산화 염소 가스)의 농도를 높이도록 항균성 가스를 더 생성하도록 할 수 있다. (마이크로컨트롤러을 포함하여) (시스템 (300, 400, 600, 및 700)을 포함하는) 여기 참조된 모든 마이크 로컨트롤러는 상기 항균성 가스 생성 시스템의 폐루프 제어를 가능하게 하도록 전산적 능력과 로컬 데이터 저장 능력을 가질 수 있으며 이는: (시스템 (300, 400, 600, 및 700)을 포함하는) 생성 시스템 성능을 자동적으 로 또는 사용자 개입을 통해 변경하도록 사용될 수 있는 기압, 습도, 온도, 사용여부, 또는 소리와 같은 공간 환경 변수에 대한 항균성 가스 (예를 들면 이산화 염소) 레벨에 대한 센서 시스템으로부터 데이터에 대한 로컬 저장소 및 마이크로컨트롤러 연산; 유지, 경고, 문제 해결, 비활성 작동 모드, 활성 작동 모드 및 로컬 설정을 위한 시스템 성능 데이터의 저장은 물론 제어를 제공하기 위해 시약의 질량/용적 센서, 압력 생성기 성능, 미세유체 칩에 의한 센서, 밸브 상태와 같은 미세유체 서브 시스템으로부터의 데이터에 대한 측정, 로컬 저장소 및 마이크로컨트롤러 작동;을 포함하지만 이에 한정되지 않는다. 다른 일 태양에서, (시스템 (300, 400, 600 및 700)을 포함하는) 상기 시스템은 상기 마이크로컨트롤러 및/또는 전자 부품에 연결된 통신 장치를 갖고 있으며 그로 인해 (시스템 (300, 400, 600 및 700)을 포함하는) 시스템 내, 시스템 상, 또는 그에 연결되었거나 상기 하우징 내에 있거나 또는 연결된 어느 전자 부품이든지 상기 마이크로컨트롤러에 의해 수집되고 국소적으로 저장되고, 작동될 수 있으며, 모바일 및/또는 고정 장치로 외부 데이터 수집 시스템으로 전송될 수 있다. 다른 일 태양에서, 머신 러닝 및/또는 인공지능 알고리즘이 (시스템 (300, 400, 600 및 700)을 포함하는) 시스 템 성능을 자동적으로 또는 사용자 상호작용에 의해 변경하도록 상기 시스템 마이크로컨트롤러에 포함될 수 있 다. 국소적 제어의 예시는 주변 공기 내의 바이러스 또는 박테리아의 검출; 고도, 온도, 항균성 가스(예를 들면 이산화 염소)가 포함된 공간의 공기 중의 항균성 가스(예를 들면 이산화 염소) 농도에서의 변화에 의해 측정된 로컬 공간에서 공기의 변화, 생물에 의한 사용의 변화, 사용자의 선호에 대한 변경; 사용/공실의 주기의 예측, 상기 시스템의 정상적 또는 비정상적 성능에 대한 경보 등에 대한 시스템 성능의 변경을 포함한다. 일 태양에서, 마이크로컨트롤러는 시스템 성능을 변경하도록 머신 러닝 알고리즘에 의해 제어된다. 다른 일 태양에서, 마이크로컨트롤러는 시스템 성능을 변경하도록 인공지능 알고리즘에 의해 제어된다. 마이크로컨 트롤러는 시스템 성능을 자동적으로 변경할 수 있다. 마이크로컨트롤러는 사용자에 의한 제어에 의해 시스템 성능을 변경할 수 있다. 마이크로컨트롤러는: 주변 공기 내의 바이러스 또는 박테리아의 검출; 시 스템의 고도, 시스템의 온도, 주변 공기 내의 항균성 가스(예를 들면 이산화 염소)의 농도에서의 변화에 의해 측정된 주변 공기의 변화, 시스템이 포함된 영역의 생물에 의한 사용의 변화, 사용자의 선호에 대한 변경; 시스 템이 포함된 영역의 생물에 의한 사용 및 공실의 주기의 예측, 상기 시스템의 정상적 또는 비정상적 성능의 진 단; 중 적어도 하나에 기반하여 시스템 성능을 변경할 수 있다. 다른 일 태양에서, 3차원 공간에서 항균성 가스(예를 들면 이산화 염소 가스)의 분산 및 모니터링을 위한 (시스 템(300, 400, 600 및 700)을 포함하는) 상기 시스템이 복수의 작동 모드를 위해 설계될 것이다. 상기 제1 작동 모드는 사용되는 공간을 위해 설계되며, 상기 제2 모드는 미사용 공간을 위해 설계된다. 미래 사용자 또는 조작 된 작동 모드가 추가될 수 있다. 이들 작동 모드는 복수의 시스템에 연결된 (시스템(300, 400, 600 및 700)을 포함하는) 시스템 네트워크(예를 들면 네트워크) 상에서 권한 있는 사용자에 의해 변경될 수 있다. 도 5는 빌딩의 바닥 내의 실내와 공간 내에 분산된 센서와 살균 가스(예를 들면 이산화 염소 가스) 생성기 시스템의 네트워크의 예시적 설계도를 도시한다. 네트워크는 외벽에 의해 경계가 지어지고 내벽에 의해 나뉘는 빌딩의 바닥을 도시한다. 가스 생성기 시스템은 상기 설명된 시스템(300 또는 400), 또는 하기 설명된 시스템(600 또는 700)의 구성과 방법으로 작동할 수 있으며, 따라서 살균 가스(예를 들 면 이산화 염소 가스) 농축 센서를 포함할 수 있다. 도시된 바와 같이, 가스 생성기 시스템은 바닥의 각 개별 룸에 배향될 수 있으며, 또한 개별 룸 사이의 개방된 공간에 배향될 수 있다. (주변 공기에서 이산화 염소 가스와 같은 살균 가스의 농도를 단순히 감지하도록 구성된) 독립형 센서는 타겟 농도가 네트워크 전 반에 걸쳐 달성되도록 보장하기 위해 네트워크를 보완한다. 상기 다양한 가스 생성기 시스템은 서로에 대해 독립적으로 살균 가스(예를 들면 이산화 염소 가스)를 생 성하도록, 그리고 특정 가스 생성기 시스템의 원하는 기능에 따라 다른 농도 타겟 값에서 작동할 수 있다. 예를 들면, 룸이 환자(예를 들면 병원 또는 간호 시설에서), 직원(예를 들면 사무실), 방문객(예를 들면 호텔) 등에 의해 사용중일 때, 그 특정 룸 안에 있는 상기 가스 생성기 시스템은 약 50ppb의 타겟 살균 가스(예 를 들면 이산화 염소 가스) 농도를 가질 수 있다. 룸이 더 이상 사용되지 않으면(예를 들면 설정된 구간동안 환 자가 룸에서 이동되거나, 직원이 밤이라서 없거나, 방문객이 체크 아웃했거나 등), 그 룸에 있는 상기 가스 생 성기 시스템은 설정 구간동안 약 1,000ppb 내지 약 5,000 ppb로 타겟 살균 가스(예를 들면, 이산화 염소 가스) 농도를 증가시킬 수 있다. 이 방식으로, 상기 룸은 특정 개인에 의한 그 사용 사이에, 또는 정기적인 시 간적 일정에 따라 (1,000 ppb 내지 5,000 ppb 농도 수준, 또는 극한의 병원균의 경우 50,000 ppb 내지 300,000 ppb) 제독될 수 있고, 사용 중에는 바이러스 전파의 예방 또는 완화를 위해 50 ppb의 낮은 (인간에게) 안전한 농도를 유지할 수 있다. 다른 일 태양에 있어서, 각 시스템의 마이크로컨트롤러, 중앙화된 유닛 컨트롤, 및/또는 로컬 및 분산된 제어 모두의 결합의 조직화를 통해 분산된 제어를 위해 서로 (상기 기재된) 통신 장치를 통해 네트워크 안으로배치된 복수의 공간 내에 있는 복수의 시스템이 연결될 수 있다. 다른 일 태양에서, 머신 러닝 및/또는 인공지능 알고리즘은 상기 기재된 태양에 의해 상기 시스템의 분산 된 네트워크 안으로 포함될 수 있다. 분산된 제어의 예시는 HVAC으로부터 살균 가스 (예를 들면 이산화 염 소) 농도의 변화로 인해 전체 빌딩 바닥, 다수의 바닥, 또는 전체 빌딩에 걸친 각 개별 생성기 시스템의 위치에서의 살균 가스(예를 들면 이산화 염소)의 균일한 및/또는 고의적으로 불균일한 분포를 달성하도록 개별 적 시스템을 조정하는 것; 살균성 가스의 소모 또는 자가 소멸, 낮/밤 생성 주기의 제어; 시간, 3차원 용 적, 계절적 변화 및/또는 상기 네트워크 내/상에 있는 상기 센서 시스템에 의해 직접적으로 감지될 수 있는 이전 미지의 요인으로까지 걸친 패턴을 감지하는 것, 측정된 신호에 추론되거나 추적된, 또는 전염성 종의 통제가 요구되는 실제 세계 공간의 분명히 별개에서 변화하는 상호접속까지에 걸쳐 설치된 시스템의 집합 에 걸친 살균성 가스 (예를 들면 이산화 염소 농도)에서 관찰되는 변화에 직접적으로 추적가능한, 패턴을 감지 하는 것을 포함한다. 도 6 및 7은 항균성 가스(예를 들면 이산화 염소 가스)를 생성하고 모니터링하기 위한 예시적 시스템(600 및 700)의 개략도를 도시한다. 시스템(600 및 700)은 실질적으로 시스템(300 및 400)과 각각 유사하며, 다만 공기 펌프 (308A 및 308B)와 압력 릴리이프 밸브(310A 및 310B)는 체크 밸브(609A 및 609B)로 교체된다. 이들 체크 밸브는 일방적이고 방향성을 갖는 흐름의 밸브로서 유체의 통로를 시약 컨테이너(312A, 312B)를 향해 체크 밸브 (609A, 609B)를 통과하게 하는 반면, 체크 밸브(609A, 609B)를 통해 유체의 통로가 시약 컨테이너(312A, 312 B)로부터 나오는 것을 막는다. 이와 같은 배치는 시약 컨테이너(312A, 312B)가 시스템(600, 700)의 조립 전 또는 중에 외부 소스에 의해 가압 되는 경우 사용될 수 있다. 따라서, 시약 컨테이너(312A, 312B)는 시약(314A, 314B)를 하우징하는 가압된 컨테 이너일 수 있고, 이와 같은 경우 시약(314A, 314B)이 미세유체 믹서로 흐르도록 공기 펌프(308A, 308B)를 필요로 하지 않는다. 가압된 시약(314A, 314B)의 흐름은 밸브(316A, 316B)와 같은 밸브에 의해 제어될 수 있다. 밸브(316A, 316B)가 개방될 때, 가압된 시약(314A, 314B)은 가압된 시약 컨테이너(312A, 312B)로부터 미세유체 흐름 센서(318A, 318B)를 통해 흘러서 미세유체 믹서 안으로 들어갈 수 있다. 일 태양에서, 하한과 상한 사이에서 공기 중의 항균성 가스의 목표 농도를 유지하는 폐 루프 시스템이 제공된다. 상기 시스템은 정확한 가스 용량의 계산된 농도 감쇠에 기반한 실내 용적 (또는 관련 특성)의 자동화 된 추정을 포함할 수 있다. 상기 시스템은 용적 내에 원하는 및/또는 목표하는 가스 농도가 있는 공간 내에 배 향될 수 있다. 상기 시스템은 하기 (a) 내지 (d) 중 하나 이상을 포함할 수 있다: (a) 항균성 가스를 생성하고 방출하는 능력, (b) 상기 가스의 농도를 측정하는 능력, (c) 소프트웨어로 프로그래밍되거나 디지털 또는 아날 로그 수단으로 제어되는 제어 매개 변수에 따라 가스의 생성 및 방출을 제어하는 능력, 및/또는 (d) 변화하는 조건에 적응하면서도 목표 농도를 유지할 수 있는 능력. 상기 시스템은 모든 애플리케이션(용적을 알 수 없는 경우, 사용자가 상기 용적에 가스 또는 이와 유사한 것을 적용, 창출, 및/또는 생성하기를 원하는 경우, 그리고 상기 가스 또는 이와 유사한 것이 분당 감쇠율과 같은 알 려진 감쇠 특성을 갖는 경우)에서 사용할 수 있는 기능을 포함할 수 있다. 상기 시스템은 처리중에 있는 상기 용적(예를 들면 룸)의 물리적 용적(예를 들면 세제곱피트 또는 세제곱미터) 를 미리 알고 있거나 미리 계산하여 시스템에 입력할 필요가 없으므로 시스템이 공기 중 항균성 가스의 목표 농 도를 유지할 수 있다는 이점이 있다. 시스템이 기정의된 용적(예를 들면 세제곱피트 또는 세제곱미터)를 수동입 력해야 하는 경우, 사용자 용적 오산, 사용자 용적 입력 오류 등으로 인한 과잉 생산(안전하기에는 너무 높은 농도) 또는 과소 생산(효과적으로 미생물을 관리하기에는 너무 낮은 농도)의 위험이 발생할 수 있다. 추가적으로, 사용자가 수동으로 공간 용적을 입력할 필요성을 제거하면, 안전성과 비용 효율성이 향상되고, 변 화하는 조건(예를 들어, 오염 제거를 위한 더 높은 항균 농도 대 유지 관리를 위한 더 낮은 항균 농도)에 대한 시스템의 적응을 간소화하며, 시스템을 처리 중인 다른 용적(다른 물리적 용적을 갖는)으로 이동시킨다. 상기 시스템의 자동화된 물리적 용적 추정 및 보정은 물리적 용적을 추정하기 위해 일관되고, 데이터 기반 방법 을 제공할 수 있고 동일한 크기의 복수의 용적이 상이한 가스 감쇠 특성을 나타내는 경우에도 항균성 가스의 안 전하고 효율적인 투여조제를 보장하는 이점을 제공할 수 있다. 상기 시스템은 (a) 상기 가스 감쇠 반응 (처리중 에 있는 용적(예를 들면 룸)이 어떻게 투여량에 반응하는지) 및 (b) 가스 생성 및 방출 사이클의 최적화를 재귀 적으로 개선하여 목표 농도 정확도 및 일관성(다른 요인들을 엄격하게 제어할 필요가 없도록) 등을 향상시킬 수 있게 한다.시스템의 센서 및 생성된 다른 작동 데이터의 데이터 로깅은, 요구되고 바람직한 정부 및 시설 관리 프로그램에 제출하기에 적합한 시스템의 활동 및 처리중에 있는 용적의 장기적인 조건에 대한 안정적이고, 완전하며, 규제 에 의해 요구되는 표준 기반 보고를 제공할 수 있다. 상기 시스템은 특정 비율(예를 들면 1:1 내지 1:n) 및 다양한 투여량으로 매우 소량의 전구체를 폐 루프 지능형 디지털 제어할 수 있으며, 이는 처리중에 있는 용적에 맞춤화되고, 상태, 추적성 및 품질 보증을 위해 모니터링 되며, 처리중에 있는 용적 조건 변화에 대응하도록 미세 조정되고/되거나 다수의 처리 시나리오를 제공하도록 조정될 수 있다. 상기 시스템은 처리, 모니터링, 또는 기록 유지를 위해 수동 개입에 의존하지 않는다. 상기 시 스템은 처리중에 있는 용적의 변화하는 조건(예를 들면 빛, HVAC, 생물의 출입, 점유율 등)에 적응된다. 상기 시스템은 정확한 기록 유지를 위해 내장된 기록, 로깅 및 클라우드 서비스와의 통신을 포함할 수 있다. 상기 시스템은 자동화된 물리적 용적 추정을 활용할 수 있다. 자동화된 물리 용적 추정은 일반적으로 처리 파라 미터를 정의하도록 사용되는 비용이 많이 들고 오류가 발생하기 쉬운 측정을 제거한다. 재귀적으로 사용될 때, 동일하거나 유사한 알고리즘을 주기적으로 사용하여 하나 이상의 성능 특성(예를 들면, 농도 일관성, 낮은 작동 주기 빈도 등)을 최적화하기 위해 처리 파라미터를 개선할 수 있다. 상기 자동화 물리 용적 추정은 상기 물리 용적에 특화된 처리 파라미터용 입력을 제공하며, 항균 물질 투여량과 관련된 설정 파라미터에 대한 추측을 제 거한다. 일 실시예에서, 처리중에 있는 용적은 알 수 없는 물리적 용적을 갖고 있다. 상기 시스템은 10 m3의 룸을 100 ppb의 농도로 채우기에 충분한 가스를 생성할 수 있다. 상기 시스템은 특정 시간동안 대기한 다음, 상기 장치의 센서 배열을 사용하여 처리중에 있는 상기 용적 내에 있는 항균성 가스의 농도를 측정한다. 실내 항균성 가스의 예상 감쇠율을 알면, 상기 시스템은 측정된 항균성 가스 농도를 예측 항균성 가스 농도에 비교할 수 있고, 그 비율을 계산할 수 있다. 상기 시스템은 그 후 상기 비율을 상기 10 m3의 룸에 적용하여 상기 룸의 추정 물리적 용적을 취득할 수 있다. 최종적으로, 알고리즘 또는 확장된 룩업 테이블 중 하나를 사용하여, 상기 시스템은 상 기 룸의 상기 추정 물리적 용적에 기초하여 원하는 생성 \"투여량\"을 결정할 수 있다. 상기 장치 및 시스템은 다양한 모드의 연산을 포함할 수 있으며, 연산의 정상 모드를 포함하며, 상기 장치는 하 기의 적어도 하나를 수행한다: (a) 외부 입력 없이 항균성 가스의 목표 농도를 설정하고 유지한다, (b) 상기 장 치의 성능을 기록하고 상기 데이터를 저장한다, (c) 데이터 및 상태를 가능할 때 통신한다, (d) 안전하고 승인 된 소스로부터 입력을 수신하고 (e) 정상 작동 파라미터를 벗어나거나 오류가 발생하면 종료시킨다. 장치가 전 원이 켜지면, 상기 장치는 현재 상태를 평가할 수 있고, 항균성 가스(예를 들면 이산화 염소)를 주기적으로 생 성할 수 있고, 주변 대기의 항균성 가스의 결과적인 농도를 감지하여 폐 루프 제어를 통해 목표 농도까지 상승 시키고 유지한다. 따라서, 상기 장치는 감지된 농도를 생성, 감지 및 통신한다. 상기 장치의 기본 모드는 자율 작동일 수 있다. 도 56은 상기 장치의 다양한 작동 모드를 위한 예시적 시스템의 다이어그램을 도시하며, 상기 장치는 하 기의 하나 이상을 포함한다: (a) 무전원 모드(상기 장치에 전원이 공급되지 않음), (b) 오프 모드 (전원은 공급 되지만 장치가 생성하거나 감지하지 않음), (c) 자체 점검 모드 (상기 장치 CPU의 표준 전원 온 자체 테스트 (\"POST\"), 점검, 생성기, 감지, 및 통신 서브 시스템의 기능 점검), (d) 설정 모드 (장치 구성을 업데이트해야 할 때 선택적 모드), (e) 대기 모드 (상기 장치가 작동하지 않지만 (생성 및 감지 없음) 장치가 구성되어 있고 전원 및 통신 기능이 있음), (f) 작동 모드(상기 장치가 감지, 생성, 기록 및 보고의 기본 명령을 실행 중), (g) 감지 전용 모드(상기 장치가 감지, 기록 및 보고를 포함하여 기본 명령의 일부를 실행 중이지만 생성은 하 지 않음). (예를 들면, 스마트폰과 같은 모바일 장치로부터의) 클라우드 통신 또는 애플리케이션 기반 통신은 장치에 대한 모드 및 해당 장치에 대한 작동 기간을 제안할 수 있다. 상기 장치는 이 제안을 수락하거나 거부할 수 있다. 안 전을 위해, 상기 모드 설정은 미리 정해진 시간이 지나면 자동으로 만료될 수 있다. 대기 모드 (e)는 장치가 전원을 켜고 통신하지만 작동하지 않는 (생성없음, 감지없음) 바이너리 토글을 포함할 수 있다. 대기 모드는 보고 및/또는 감사 액세스에 사용되는 전원 온 및 통신 온 모드를 제공할 수 있다. 대기 모드는 장치가 외부에서 작동 모드로 전환되는 장치 기능에도 유용할 수 있다(예: 온보드 일정 또는 연결된 애 플리케이션이 장치에 작동 모드(f)로 작동하도록 지시하는 경우). 감지 전용 모드(g)는 가스 발생 기능을 해제하는 바이너리 토글을 포함할 수 있다. 감지 전용 모드는 통신 및 감지 기능을 유지할 수 있다. 항균성 가스(예를 들면, 시약)에 필요한 소모품이 비어 있는 경우, 감지 전용 모드(g)가 사용될 수 있다. 감지 전용 모드는 애플리케이션에서 활성화하거나 시스템이 소모품이 비어 있을 때 자 동 기본 옵션으로 감지 전용을 포함할 수 있다. 시스템과 장치는 주 7일 동안 작동 시간을 지정하도록 설정할 수 있다. 기본 모드는 장치가 작동 모드에서 목표 농도를 유지하는 데 필요한 일정한(예: 하루 24시간, 주 7일) 자율 생성일 수 있다. 즉, 장치는 지속적으로 감 지, 생성, 기록 및 보고한다. 사용자는 사전 설정 타이머를 활성화하여 원하는 시간(예를 들면, x시간) 동안 감 지 전용 모드(g)를 활성화할 수 있으며, 이후 장치는 작동 모드(f)로 돌아간다. 다른 가능한 스케줄에는 특정 근무 교대(예: 첫 번째 교대)에 대한 사전 설정이 포함되며, 장치는 해당 교대에 해당하는 설정된 시간 및 요일 (예: 월요일부터 금요일까지 매일 오전 8시 - 오후 5시)동안 작동한다. 또 다른 가능한 스케줄에는 빈 룸을 신 선하게 유지하거나 곰팡이 및 곰팡이 성장을 줄이기 위해 목표 농도를 무시하면서 사용자가 원하는 대로 하루에 x번의 세대 주기로 가끔씩 \"신선하게 유지\"하는 스케줄이 포함될 수 있다. 최종적으로, 사용자는 관련 애플리케 이션을 통해 사용자 지정 일정을 만들 수 있다. 다른 가능한 장치 및 시스템 모드에는 장치 및 시스템이 제어기(예: 에지 장치)의 명령에 따라 작동하고 자체 안전 파라미터가 초과되지 않도록 조치하면서 로컬 측정을 보고하는 드론 모드(h)가 포함된다. 즉, 장치 및 시 스템은 인접 장치에서 제공하는 데이터의 결과로 활성화되어 인접 장치를 지원할 수 있다. 다른 가능한 장치 및 시스템 모드에는 장치 및 시스템이 센서에서 로컬 측정값을 에지 장치(예: 인접 장치)에 보고하는 팀 또는 플로 킹 모드(i)가 있다. 팀 또는 플로킹 모드(i)는 인근 피어 장치 네트워크와 함께 작동하여 단일 장치에 적합한 것보다 더 넓은 공간에서 항균성 가스 농도를 모니터링하고 유지할 수 있다. 플로킹/팀 모드(i)의 장치는 자신 이 팀에 속해 있다는 사실을 모를 수 있으며, 클라우드는 특정 관계(예: 서로의 근접성)에 따라 장치를 그룹으 로 수집할 수 있다. 클라우드는 각 장치의 데이터를 평가하고 사전 정의된 온보드 모드를 활성화하여 목표 농도 를 유지하면서 장치의 성능을 전환할 수 있다. 이 시스템은 (a) 명령 및 제어 서브 시스템, (b) 통신 서브 시스템, (c) 감지 서브 시스템, (d) 생성 서브 시스 템 등 전력 및 물리적 하우징으로 지원되는 네 가지 주요 서브 시스템을 통합한다. (a) 제어 서브 시스템은 도 57에서 서브 시스템으로 도시되어 있다. 제어 서브 시스템은 다른 서브 시스템을 관리하고 장치가 예상대로 작동하도록 보장한다. 제어 서브 시스템은 장치 초기화(신규 설치)를 관리하여, (i) 장치 식별 및 위치 정보의 구성 및 저장, (ii) 네트워킹 통신 설정의 구성 및 저장, (iii) 기타 사용자 기본 설정 또는 성능 파라미터의 구성 및 저장 중 하나 이상을 포함하여 정상 작동을 지원하는 파라미터 의 구성을 촉구하고 허용할 수 있다. 제어 서브 시스템은 장치 시동(전원 온)을 관리할 수 있으며, 이는 통신 서브 시스템, 생성 서브 시스템 및 감지 서브 시스템에 대해 (i) 중대한 시스템 오류, (ii) 작동 파라미터를 벗어나는 주변 조건, (iii) 작동 파라미터를 벗어나는 가스 감지 조건 및 (iv) 생성기 오류 또는 소모품 부족 중 하나 이상을 포함하여 작동에 반하는 모든 오류 또는 조건을 검사하는 것을 포함할 수 있다. 제어 서브 시스템은 원하는 작동 모드를 결정할 수 있고, 이후 (i) 센서 실행 및 레벨 판독, (ii) 노출 한계 대비 레벨 확인, (iii) 필요한 경우 생성기 실행, (iv) 상태 보고, (v) 다음 사이클 대기, (vi) 필요한 경 우 모드 변경 및/또는 시스템 종료 중 하나 이상을 포함할 수 있는 작동 모드에 따라 실행될 수 있다. 제어 서브 시스템은 모든 인터럽트 또는 명령을 수신하고, 로컬로 정보를 기록하고, 외부로 정보를 통신 할 수 있다. 전원 시스템은 입력 전원(표준 AC)을 받아 장치 및 시스템의 구성 요소에 출력 전원을 공급함으로써 장치 및 시 스템을 지원할 수 있다. 또는 전원 시스템은 온보드 저장소(예: 배터리)에서 전력을 끌어와 시설 전원이 없는 기간 동안 장치의 생존성(viability)을 보장하고, 시설 정전이 장기화되는 동안 중요한 데이터를 안전하게 저장 하면서 원활하게 종료할 수 있도록 지원한다. 하우징은 포장, 보호 및 위치 지원을 제공하여 장치와 시스템을 지원할 수 있다. 하우징은 다음을 수행할 수 있 다: (a) 모든 구성요소를 고정하고 배치, (b) 벽에 장착하거나 표면에 배치할 수 있는 기능 제공, (c) 액체, 입 자, 물리적 충격 등 외부 위험으로부터 장치 보호, (d) 점유 공간에서 장치의 존재에 대한 수용성을 높이는 미 적 기능 제공, (e) 공급 봉쇄가 실패할 경우 소모품 구성 요소의 추가 보안 제공, (f) 제품 라벨링 및 규제 필 수 정보를 위한 표준 기반 위치 제공, (g) 시각적으로 감지 가능한 장치 식별 및 인증 기능을 제공하여 제조업 체 신원을 보장, (h) 내부 구성 요소 간 연결을 위한 포트 제공(예를 들면, 온보드 전원 시스템 또는 네트워킹 시스템) 및 시설 서비스(표준 AC 전원, 인터넷 등) 간의 연결을 위한 포트 제공, (i) 피드백 장치 뷰포트(예를들면 디스플레이 장치 또는 LED 상태 표시등) 제공 및/또는 (j) 측정을 위한 열 배출 및 실내 공기 흡입의 열 제어를 위한 환기 장치 제공. 하우징에는 전자파 노출로부터 장치 구성 요소를 보호하거나 장치에서 주변 환경 으로 전자파가 방사되는 것을 제한하기 위해 전자파 간섭(\"EMI\" electromagnetic interference) 차폐가 추가로 포함될 수 있다. (b) 통신 서브 시스템은 표준 유선(예: USB, 직렬선, 이더넷 등) 및/또는 무선(예를 들면, 무선 이더넷, 블루투 스, 근거리 무선 통신 등)을 통해 네트워크에 연결하고 외부 네트워크의 클라우드 서비스와 데이터를 교환한다. 통신 서브 시스템을 통해 장치와 시스템은 네트워킹을 사용하여 로컬 인트라넷을 통해 외부 네트워크의 클라우 드 서비스에 안전하게 연결할 수 있다. 통신 프로토콜은 장치에 상주하는 보안 영구 마이크로전자장치에 보관된 보안 인증서를 교환하는 등 표준 기반 업계 관행을 사용하여 보안을 유지할 수 있다. 통신 서브 시스템을 통해 장치는 성능, 상태 및 이력 데이터를 클라우드 서비스로 전송하여 안전한 오프사이트 저장 및 추가 분석을 수행 할 수 있다. (c) 감지 서브 시스템은 일련의 센서, 제어 장치, 공기 펌프 및 공기 흐름 챔버를 활용하여 주변 공기를 평가하 고 여러 파라미터를 측정 및/또는 보고한다. 블로워는 처리중에 있는 용적에서 필터를 통해 주변 공기를 제어 서브 시스템에 연결된 여러 센서를 수용하는 플리넘으로 이동(끌어당김)시킬 수 있다. 깨끗한 주변 공기 는 센서에 악영향을 미칠 수 있는 먼지 및 기타 입자를 제거하기 위해 필터링될 수 있으며, 필터는 측정된 가스 와 상호 작용하거나 하나 이상의 센서 구성 요소의 기능에 영향을 미치는 온도, 상대 습도 또는 기타 파라미터 를 변경하지 않도록 선택될 수 있다. 공기는 플리넘(센서 회로 기판에 장착된 여러 디지털 및/또는 아날로그 센 서에 걸쳐 공기를 라우팅하는 특별히 설계된 덕트 세트)을 통해 전달될 수 있다. 블로워 제어를 통해 일련의 센 서에 걸쳐 공기 유량을 관리할 수 있다. 센서는 와이어를 통해 센서에 연결된 서브 시스템을 제어하기 위해 값을 측정하고 보고할 수 있다. 센서 는 온도, 습도, 일반적으로 발견되는 많은 휘발성 유기 화합물(\"VOC\", volatile organic compounds)을 포함하 는 환원 및/또는 산화 가스의 존재 및 활성, 및 관심 있는 특정 가스(예를 들면, 항균성 가스)를 시스템에 보고 할 수 있다. VOC는 예를 들어 디지털 감지 장치 구성 요소의 서로 다른 온도 설정에서 센서 판독값의 특징적인 패턴을 보간하는 것으로 특징될 수 있다. 하나 이상의 동일한 VOC 센서를 추가로 설치하면 VOC와 관련된 중복 측정을 제공할 수 있다. 추가 VOC 센서는 다른 센서가 고장 났을 때 대체품으로 작동하기 위해 비활성 상태로 두어 장치와 시스템의 신뢰성과 수명을 늘릴 수 있다. 또한 추가 VOC 센서는 환경 가스에 노출되지 않도록 차폐 되어 차동 신호 분석을 지원하는 기준 제어로 사용될 수 있다. 제어 알고리즘은 하나 이상의 센서 장치의 기능 을 판단하여 오작동하는 센서의 데이터가 데이터 손상을 방지하기 위해 추가 처리에서 제외될 수 있도록 할 수 있다. (d) 생성 서브 시스템은 차압 또는 펌프를 이용하여 도 58에 도시된 리액터와 같은 리액터로 지정된 비율 로 전구체를 전달한다. 리액터는 유체 처리를 제공하는 적어도 하나의 연동식 또는 기타 고정밀 펌프를 포함할 수 있다. 펌프는 정확한 투여량 및 기록 가능한 이력을 보장하기 위해 디지털 방식으로 제어 및 모니터 링될 수 있다. 연동식 펌프는 정확한 용량을 측정할 수 있고, 체크 밸브나 기타 역류 방지 장치(옵션)가 필요 없으며, 자가 프라이밍이 가능하고, 호스에 기포가 생기지 않다. 연동식 펌프는 튜브 내경을 하나 이상 선택할 수 있는 교체 가능한 튜브 세트를 사용하여 다양한 정밀도 및 용량 옵션을 제공할 수 있다. 연동식 펌프는 독립 적으로 사용하거나 펌프 헤드를 결합하여 동일한 모터 드라이브를 사용하여 여러 개의 병렬 튜브 세트를 구동할 수 있으므로 모터 비용과 복잡성을 줄일 수 있다. 펌프 기기를 탈착식 및/또는 교체식 소모품 카트리지에 넣어 유체 연결이나 인터페이스를 제한하고, 펌프 헤드 의 튜브 세트와 기타 기계 부품이 사용으로 인해 마모되므로 소모품 수명 동안 양질의 펌핑을 보장할 수 있다. 펌프 기기는 대량 생산, 소형 포장, 예측 가능하고 신뢰할 수 있는 기능을 위해 맞춤 설계할 수 있다. 펌프 기 기는 매우 낮은 전력 소비를 위해 설계할 수 있어 장치의 수명을 늘리고 유지보수 및/또는 배터리 전원 시스템 으로의 교체 사이의 시간을 연장할 수 있다. 리액터는 2개의 액체 시약이 2개의 입력 튜브(5804, 5806)에서 만나는 혼합 챔버와 출력 항균성 가 스가 리액터를 빠져나가도록 유도하는 2개의 공기 챔버(5808, 5810)를 포함한다. 액체 시약이 반응하여 원하는 항균성 가스를 생성한다. 2개의 공기 챔버(5808, 5810)는 혼합 챔버를 둘러싸고, 각 공기 챔버 (5808, 5810)는 액체를 유체 혼합 챔버 내부에 유지하기 위한 소수성 멤브레인을 포함한다. 두 개의 소수 성 멤브레인은 누출을 방지하고 액체 봉쇄를 보장하기 위해 리액터의 구성 요소들 사이에 기계적으로 고정될 수 있다. 리액터의 설계는 상이한 용량을 위해 리액터를 쉽게 확장할 수 있도록 파라메트릭적일 수 있다. 리액터은 광범위한 공기 압력 및 유량을 활용하여 기존 공기 흐름 장치를 활용하고 중복 구성 요소의 필요성을 줄일 수 있다. 일 태양에서, 감지 서브 시스템으로 공기를 끌어들이는 데 사용되는 것과 동일한 블로 워를 사용하여 공기를 리액터로 밀어 넣을 수 있다. 블로워는 병실의 HVAC 표준과 같이 치료 중인 다양한 용적에 필요한 표준에 따라 낮은 용적과 낮은 압력으로 공 기를 리액터으로 이동(밀어 넣기)시킬 수 있다. 리액터로 이동된 이 공기는 액체 혼합을 촉진하고, 철저한 항균성 가스 생성을 촉진하며, 항균성 가스를 장치 밖으로 배출하는 데 도움이 될 수 있다. 블로워는 유 입 공기가 블로워를 통과하기 전에 센서 플리넘을 통과하여 센서에 의해 획득된 다양한 측정에 영향을 미칠 가 능성을 제거하도록 공기 흐름 경로에 설계 및 배치될 수 있다. 도 59는 큐비클에 대한 시스템 및 장치의 시뮬레이션 작동에 대한 항균성 가스의 농도(ppb) 대 시간(분)을 나타 낸 그래프이다.이 큐비클의 용적은 14m3이다. 시스템과 장치는 8μL/세대 주기로 항균성 가스를 생성한다. 항균 성 가스는 0.13mL의 전구체를 사용하여 생성된다. 시뮬레이션과 그래프는 120분 동안의 작동을 나타낸다. 위쪽 선은 항균성 가스의 실내 농도(ppb)이고, 아래쪽 선은 각 생성 주기에서 생성되는 항균성 가스의 농도(ppb)이다. 도 60은 공기 중 항균성 가스의 목표 농도를 하한과 상한 사이에서 유지하기 위한 폐 루프 시스템의 개략 도를 도시한다. 시스템은 제어 서브 시스템 및 결합된 생성 및 센싱 서브 시스템에 전기적으 로 연결된 전원 공급 장치를 포함한다. 구체적으로, 전원 공급 장치는 제어 서브 시스템의 제어 유닛 및 생성 및 센싱 서브 시스템의 하나 이상의 펌프에 전기적으로 연결될 수 있다. 제어기 유닛은 근거리 무선 통신(NFC), 블루투스(BT) 및 Wi-Fi 기능과 같은 통신 요소(통신 서브 시스템의 일부)를 포함할 수 있다. 제어기 장치에는 범용 직렬 버스(USB) 및 보안 디지털(SD) 포트와 같은 입력/출력 포 트가 포함될 수 있으며, 이 포트는 통신 서브 시스템의 일부로 작동할 수도 있다. 제어기에는 전원 상태, Wi-Fi 상태, 블루투스 상태 및 시스템 온라인 상태를 나타내는 상태 표시등(상태 LED)이 포함될 수 있다. 제어기 유닛 은 아날로그 및 디지털 입력과 출력을 포함할 수 있다. 제어기는 생성 및 감지 서브 시스템의 공기 펌프 드라이버 및 공기 펌프(예를 들면, 마이크로 블로어)에 작동 가능하게 연결되는 전력 제어, 및 생성 및 감지 서 브 시스템의 하나 이상의 펌프에 작동 가능하게 연결되는 펌프 제어를 포함할 수 있다. 시스템 은 생성 및 감지 서브 시스템의 공기 펌프를 사용하여 여러 개의 프리센서를 수용하는 플리 넘으로 실내 공기를 끌어들이다. 또는 시스템 은 플리넘 외부에 다수의 프리센서 및/또는 센서를 포함할 수 있다. 그런 다음, 에어 펌프는 동일한 실내 공기를 생성 및 감지 서브 시스템의 리액터로 이동시킨다 (리액터는 예를 들어, 리액터 또는 본원에 설명된 다양한 다른 리액터 중 어느 것과 유사할 수 있다). 리 액터는 펌프(예를 들면, 펌프 1 및 펌프 2)에 의해 펌핑되는 탱크(예를 들면, 탱크 1 및 탱크 2)로부터 혼합 챔 버로 2개 이상의 시약을 공급받을 수 있다. 혼합 챔버의 폐기물은 원자로 밖으로 배출되고, 생성된 항균성 가스 는 여러 개의 포스트 센서가 있는 플리넘으로 배출될 수 있다. 생성된 항균성 가스는 실내 공기 처리를 위해 주 변 실내 공기로 유입될 수 있다. 프리센서 및/또는 포스트센서의 측정 및 데이터는 보고, 저장 및/또는 분석을 위해 제어기로 전달될 수 있다. 항균 목표 제어 일 태양에서, 처리 중인 용적에서 항균 물질의 목표 농도는 복잡한 시스템 내에서 일부 복잡한 발생의 근본 원 인을 알지 못한 채 수학적 계산을 사용하여 복잡한 시스템의 동역학을 고려하는 비례, 적분 및 미분(\"PID\") 제 어를 통해 제어할 수 있다. PID는 시스템 역학에서 관찰된 변화의 원인을 이해할 필요가 없다. PID는 목표 농도에 초점을 맞추고, 목표 농 도에서 벗어나는 복잡하고 변화무쌍한(그리고 종종 측정할 수 없는) 현실 세계의 원인보다는 목표 농도를 달성 하기 위해 노력한 즉각적이고 과거의 이력을 바탕으로 목표 신호에 대한 수학적 연산을 기반으로 전자에서 계산 으로 제어를 유도한다. 시스템 수준의 성능 변화는 PID 제어 방식에서 실제 영향을 미칠 수 있다. 예를 들어, 제어 상수를 조정하여 시 스템의 응답성을 높이고 목표 농도를 더 빠르게 달성할 수 있다. 이 방식을 사용하여 처리중에 있는 용적의 목 표 농도가 허용 한계 내에 있는 경우, 이 전략을 사용하여 용적 내 인원 수, 문과 창문의 개폐, HVAC 시스템 조 정 및 실제 처리중에 있는 용적에서 흔히 발생하는 기타 이벤트 등 처리중에 있는 용적의 변화에 대한 빠른 변 화에 대응하여 시스템이 최대화되도록 할 수 있다.또는 세 가지 PID 상수만 변경하여 시스템의 응답 속도를 훨씬 느리게 만들고 고정된 최대 목표(예: 처리 중인 특정 용적에 대한 최대 안전 농도)를 초과하지 않도록 설계하여 PID를 설정할 수도 있다. 다른 태양에서는, 처리중에 있는 용적 내 항균 물질의 목표 농도는 다음 단계를 포함하는 선형 목표 제어를 통 해 제어될 수 있다: 자동화된 용적 추정을 입력하거나 사용하여 처리 중인 용적의 3차원 공간 용적을 정량 화하고, 항균 농도 센싱을 통해 처리 중인 용적의 현재 항균 농도를 측정; (3a) 항균 물질의 농도가 0이거 나 기능적으로 0과 동등한 경우(농도 = 질량/용적이고 용적이 1단계에서 알려져 있거나 추정된다는 점을 고려), 항균 물질 생성기에 처리 중인 용적의 알려진 용적에서 원하는 목표 항균 농도에 도달하기에 충분한 것으로 추 정되는 항균 물질의 질량을 표현하도록 지시; 및/또는 (3b) 항균 물질의 농도가 0이 아닌 경우, 처리 농도 하의 용적이 목표 항균 물질 농도보다 큰 경우, 농도가 목표보다 크지 않을 때까지 항균 물질 생성기가 유지되는 단 계; 처리 농도 하의 용적이 목표 항균 농도보다 작은 경우, 항균 물질 생성기는 목표 항균에 비례하는 질량에서 처리 농도 하의 용적을 뺀 값에 처리 하의 용적을 곱하여 처리 하의 용적 내의 항균 농도를 목표 농도 이상으로 만들도록 지시받는다. 안전 보장 처리 중인 특정 용적에서 다양한 요인으로 인해 항균 농도가 감소할 수 있다. 처리 중인 용적과 관련된 고유 특 성으로 인한 항균 농도 감소의 동역학은 분당 0.1%에서 25.0% 사이의 항균 농도 손실을 예상할 수 있으며, 실제 기대치와 실험 증명에 따르면 실내의 경우 1.0%에서 6.0%, 비행기 및 소형 차량(예: 자동차)의 경우 최대 25.0% 의 범위에서 항균 농도 손실이 발생할 수 있다. 일 태양에서, 앞서 언급한 손실률을 염두에 두고 항균 물질 생성기는 생성 지속 시간이 최소 0.25초인 사이클에 서 농도를 채우거나 보충하기 위해 항균 물질을 투여할 수 있다. 본 명세서의 시스템은 항균 물질 생성기의 주파수 생성(및 역 지연 기간) 주기에 대해 프로그래머블 거버너로 작동할 수 있는 회로, 알고리즘 또는 보조 구성요소를 포함할 수 있다. 단순한 지연 회로와 달리, 디지털 소독 전략의 맥락에서 본 문서에 설명된 시스템은 이 프로그래머블 거버너를 예를 들면 후술할 내지 를 포함 하는 단순한 요인에 기반하여 할 수 있다: 분산 시간 변수, 항균성 붕괴 변수, 처리 중인 용적의 사용자 입력 또는 추정 용적, 처리 중인 용적의 사용자 입력 특징(예: 창문, 문, 알려진 HVAC 설계 파라미 터, 처리 중인 용적에 흡수성 물질의 존재(예, 가구, 카펫, 커튼, 침구 등). 다른 태양에서, 본 명세서에 기술된 시스템은 목표 항균 농도 내에서 처리 중인 용적의 항균 농도에 비례하거나 이를 나타내는 센서 신호를 측정, 기록, 저장 및 조치하는 수단을 갖춘 폐 루프 시스템일 수 있다. 폐 루프 시 스템은 항균 물질 농도 감지 시스템을 사용하여 다음을 수행할 수 있다: 항균 물질 생성기로부터의 방출 주 기가 처리중에 있는 용적에서 예상되는 농도 효과를 갖는지 확인하거나, 본 문서에 설명된 항균 물질 생성 기의 옵션에 활용되는 구성 요소에 대한 전력 소비, 활성화 전압, 암페어 또는 디지털 신호를 모니터링할 수 있 다. 바로 위에 설명된 과 관련하여, 하나 이상의 생성 주기가 발생하고 항균 농도 감지 장치에 의해 처리 중인 용적이 감지되지 않는 경우, 폐 루프 시스템은 생성 장치를 일시 중지/정지/비활성화하고 시각, 청각, 촉각 및/ 또는 데이터 기반 경고/경보를 발행하여 처리 중인 용적에 위험한 농도의 항균이 공급되는 것을 방지한다. 처리 중인 용기의 농도가 허용된 목표 항균 농도를 초과하는 경우, 위협적이지 않은 과잉 농도의 경우 경고가 발령되 고, 위협적인 과잉 농도의 경우 경보 및 모든 생성 활동 중단이 발령될 수 있다. 폐회로 시스템이 목표 항균 농 도에 도달할 것으로 예상할 때 처리 중인 용적의 농도가 목표 항균 농도에 도달하지 않는 경우(항균 농도 감지 시스템에 의해 감지된 경우), 생성 활동을 중지하고 서비스 직원에게 장치를 검사하여 폐회로 시스템의 목표 기 능이 달성되지 않는 이유를 확인하도록 경고할 수 있다. 바로 위에 설명된 와 관련하여, 항균 물질 생성기가 양이온 막이 있는 전기 화학 생성기 또는 증발 추출이 있는 전기 화학 생성기인 경우, 인가 전압, 전류 및/또는 전력 소비의 지속 시간을 측정하면 해당 전압, 전류 또는 전력 소비 값이 임계값을 초과하는 경우 폐 루프 시스템이 생성을 차단할 수 있다. 이러한 생성 중단은 항 균 농도 감지 시스템이 오류를 감지했는지 여부와 관계없이 발생할 수 있다. 임계값을 초과한 정도에 따라 경고 또는 알람이 트리거될 수 있다. 항균 물질 생성기에 증발 추출 기능이 있는 UV가 포함된 경우, UV 방출기가 켜져 있는 시간, 총 전력 소비량 등 은 다른 데이터 채널과 관계없이 특정 임계값에 도달하면 비활성화할 수 있다.항균 물질 생성기에 액체 전구체 사용, 펌프 드라이버 샤프트의 독립 인코더 또는 드라이버 전압, 암페어, 펄스 폭 변조 및/또는 기타 신호를 합산하여 안전 임계값과 비교할 수 있는 증발 추출 기능이 있는 두 가지 화학 물 질이 포함된 경우. 항균 물질 생성 시스템 및 장치 도 17은 도 9에 도시되고 상기 설명된 시스템과 실질적으로 유사한 시스템을 도시하며, 유사한 도면 부호는 유사한 구성요소를 나타낸다. 시스템은 가압된 에어로졸 컨테이너(1786A 및 1786B)를 추가적으로 포함한다. 에어로졸 컨테이너(1786A)는 액체 전구체를 담을 수 있으며, 반면 에어로졸 컨테이너(1786B)는 액체 활성제를 담을 수 있다. 액체 전구체 및 액체 활성제는 전달을 야기하는 컨테이너(1786A 및 1786B) 내의 압력을 사용하여 반응 챔버로 전달될 수 있다. 이와 같은 실시예는 항균 물질 생성과 분산 을 위한 전동식 부품에 대한 필요를 제거할 수 있다. 도 18a-18d는 항균성 가스(예를 들면 이산화 염소 가스)를 생성하기 위한 리액터를 도시한다. 리액터 는 리액터 내부에 있는 컨테이너 내의 액체 전구체 및 액체 활성제로 적재되는 사전 패 키징된 장치일 수 있다. 액체 전구체는 그 컨테이너 내에 밀봉될 수 있고 반응 챔버 안으로 가압된 공기가 흐르게 할 수 있다. 액체 활성제는 그 컨테이너 내에 밀봉될 수 있고 반응 챔버 안으로 가압 된 공기가 흐르게 할 수 있다. 리액터는 액체 전구체, 활성제, 반응 챔버 및 폐액 컨테이너를 담은 하우징을 포함할 수 있으며, 장치 구성요소는 미세유체 장치의 생산에서 공통되는 바와 같이 하우징 재료로부터 기계로 만들어지거나 형성된다. 리액터는 미세유체 장치일 수 있다. 리액터는 액체 전구체 및 활성제로 하여금 그들 각각의 컨테이너 내의 밀봉을 파괴 및/또는 그 들로 하여금 반응 챔버로 이동하도록 공기 압력을 가할 수 있는 압력 입력을 포함할 수 있다. 압력 입력은 펌프, 시린지 등으로부터 압력을 받을 수 있다. 반응 챔버는 모세관 작용을 통해 폐액 컨테이너 안으로 폐액이 이동하도록 하는 모세관 필터를 포함할 수 있다. 폐액 컨테이너는 반응 챔버로부터의 폐액을 안전한 상태로 만들 수 있는 비활성화물 질, 중화제 등을 포함할 수 있다. 반응 챔버는 가스 투과성 멤브레인를 포함할 수 있으며, 이는 반응 챔버에서 생성된 항균성 가 스(예를 들면 이산화 염소 가스)로 하여금 제어된 속도로 멤브레인을 통과하도록 하지만 반응 챔버 로부터의 폐액은 멤브레인를 통과하는 것으로부터 방지한다. 항균성 가스(예를 들면 이산화 염소 가스)는 가스 출구을 통해 리액터를 나올 수 있다. 가스 출구는 항균성 가스(예를 들면 이산화 염소 가스)로 하여금 리액터를 나와서 주변 영역을 진입하도록 할 수 있으며, 이는 예를 들면 밀폐된 공간(예 를 들면 빌딩 내의 룸)을 포함한다. 도 18d에 도시된 바와 같이, 리액터는 하우징 내의 상기 내용물(예를 들면 액체 전구체, 활성 제, 반응 챔버, 및 폐액 컨테이너)을 밀봉하는 커버를 포함할 수 있다. 도 19a-19i는 살균 가스(예를 들면 이산화 염소 가스)를 생성하기 위한 리액터를 도시한다. 리액터(190 0)는 윗면를 갖는 하우징을 포함할 수 있다. 하우징은 챔버 관에 의해 서로 연결된 컨 테이너 및 반응 챔버를 포함할 수 있으며, 장치 구성요소는 미세유체 장치의 생산에서 공통되는 바 와 같이 하우징 재료로부터 기계로 만들어지거나 형성된다. 리액터는 미세유체 장치일 수 있다. 컨테이너는 윗면 상에 또는 가까이 배향된 고체 컨테이너 커버를 포함할 수 있다. 반응 챔버 는 윗면 상에 또는 가까이 배향된 반응 챔버 커버를 포함할 수 있다. 반응 챔버 커버 는 반응 챔버의 내부와 유체 통신하는 개구부를 갖는 출구를 포함할 수 있다. 개구부 는 가스(예를 들면 이산화 염소 가스)는 통과하도록 하지만 액체(예를 들면 폐액)는 통과하는 것으로부터 방지 하는 가스 투과성 멤브레인을 포함할 수 있다. 챔버 관은 밸브를 포함할 수 있다. 밸브는 체크 밸브, 역류 밸브, 밀봉 등으로서 사용자가 선택에 의해 컨테이너의 내용물로 하여금 반응 챔버로 전달되도록 할 때까지 컨테이너의 내 용물 및 반응 챔버의 내용물을 서로 접촉하는 것으로부터 방지한다. 컨테이너는 상기 기재된 액체 활성제를 담을 수 있으며, 반면 반응 챔버는 액체 또는 고체 전구체 (예를 들면 액체 NaClO2 또는 고체 NaClO2)을 담을 수 있다. 대안적으로, 컨테이너는 액체 전구체(예를 들면 NaClO2)을 담을 수 있고, 반면 반응 챔버는 고체 활성제 또는 액체 활성제를 담는다. 하우징은 가압 장치를 포함하는 단부를 포함할 수 있다. 가압 장치는 컨테이너의 내용 물을 가압할 수 있는 어떤 장치든지 포함할 수 있으며, 그로써 컨테이너의 내용물로 하여금 밸브를 극복하고 통과하여 반응 챔버를 들어가도록 한다. 가압 장치는 단부로부터 연장되고 가압 관 를 통해 컨테이너와 유체 통신하는 중공체를 포함하는 플런저 장치, 및 중공체 안으로 연장되는 플런저를 포함할 수 있다. 도 19h 및 도 19i에 도시된 바와 같이, 플런저은 사용자에 의해 액추 에이션되고 중공체 안으로 가압될 수 있으며, 그로써 컨테이너의 내용물의 가압을 야기하고, 이는 밸브를 극복하고 통과하여 반응 챔버를 들어가도록 한다. 항균성 가스(예를 들면 이산화 염소 가스)는 선택적 가스 투과성 멤브레인을 통해 개구부를 빠져나도록 하며, 반면 폐액은 리액터가 세 척되고 재충전(신선한 전구체와 활성제가 추가)될 때까지 반응 챔버 내에 담겨 있도록 한다. 가압 장치는 제거가능할 수 있다. 대안적으로, 가압 장치는 하우징으로부터 완전히 별개일 수 있으며 사용자가 리액터를 활성화하고 싶을 때만 사용자에 의해 하우징에 적용될 수 있다. 가압 관은 유사하게 밸브를 포함할 수 있으며, 이는 체크 밸브, 역류 밸브, 밀봉 등일 수 있다. 도 20a-20d는 항균성 가스(예를 들면, 이산화 염소 가스)를 생성하기 위한 리액터를 도시한다. 리액터 는 리액터 내부에 있는 컨테이너 내의 액체 전구체 및 고체 활성제로 적재되는 사전 패 키징된 장치일 수 있다. 액체 전구체는 그 컨테이너 내에 밀봉될 수 있고 반응 챔버 안으로 가압된 공기가 흐르게 할 수 있다. 고체 활성제는 반응 채버 내에 밀봉될 수 있다. 리액터는 액체 전구체, 활성제, 반응 챔버 및 폐액 컨테이너를 담은 하우징(204 0)을 포함할 수 있으며, 장치 구성요소는 미세유체 장치의 생산에서 공통되는 바와 같이 하우징 재료로부터 기 계로 만들어지거나 형성된다. 리액터는 미세유체 장치일 수 있다. 리액터는 액체 전구체로 하여금 그 컨테이너 내의 밀봉을 파괴 및/또는 액체 전구체로 하여금 반응 챔버로 이동하도록 공기 압력을 가할 수 있는 압력 입력을 포함할 수 있다. 압력 입력은 펌프, 시린지 등으로부터 압력을 받을 수 있다. 반응 챔버는 모세관 작용을 통해 폐액 컨테이너 안으로 폐액이 이동하도록 하는 모세관 필터를 포함할 수 있다. 폐액 컨테이너는 반응 챔버로부터의 폐액을 안전한 상태로 만들 수 있는 비활성화물 질, 중화제 등을 포함할 수 있다. 반응 챔버는 가스 투과성 멤브레인를 포함할 수 있으며, 이는 반응 챔버에서 생성된 항균성 가 스(예를 들면 이산화 염소 가스)로 하여금 제어된 속도로 멤브레인을 통과하도록 하지만 반응 챔버 로부터의 폐액은 멤브레인을 통과하는 것으로부터 방지한다. 항균성 가스(예를 들면 이산화 염소 가스)는 가스 출구을 통해 리액터를 나올 수 있다. 가스 출구는 항균성 가스(예를 들면 이산화 염소 가스)로 하여금 리액터를 나와서 주변 영역을 진입하도록 할 수 있으며, 이는 예를 들면 밀폐된 공간(예 를 들면 빌딩 내의 룸)을 포함한다. 도 20d에 도시된 바와 같이, 리액터는 하우징 내의 상기 내용물(예를 들면 액체 전구체, 반응 챔버, 및 폐액 컨테이너)을 밀봉하는 커버를 포함할 수 있다. 도 23a-23g, 및 도 24는 예시적 항균성 가스(예를 들면 이산화 염소 가스) 생성기(2300, 2400)를 각각 도시한다. 생성기는 생성기과 실질적으로 유사하지만, 제2 시약 컨테이너, 제2 압력 생성기 , 그리고 상기 제2 시약을 생성 챔버로 흐르도록 하게 하는 모든 관련 관과 통로를 포함한다. 항균성 가스(예를 들면 이산화 염소 가스) 생성기(2300, 2400)는 베이스, 액체 시약을 담은 적어도 하나의 시약 컨테이너, 및 액체 시약의 누출을 방지하도록 구성된 공기 투과성 밀봉을 갖는 시약 컨테이너 뚜껑을 포함할 수 있다. 베이스 내에서, 적어도 하나의 압력 챔버는 적어도 하나의 시약 컨테이너 아래에, 압력 챔버 와 시약 컨테이너과 통신하는 적어도 하나의 챔버 통로를 갖고 배향된다. 적어도 하나의 압 력 생성기가 압력 챔버와 통로 모두와 통신하게 배치되며, 그로 인해 압력 생성기는 선택적으로 챔버 통로가 압력 챔버로 들어가는 것을 폐쇄하거나 개방할 수 있다. 압력 생성기 는 적어도 하나의 바이어싱 장치에 의해 위치 내로 편향된다. 바이어싱 장치는 스프링과 같이 흔한 바이어싱 장치일 수 있다. 바이어싱 장치는 압력 생성기를 개방 위치로 편향시킬 수 있다. 바이어싱 장치는 압력 생성기를 폐쇄 위치로 편향시킬 수 있다. 적어도 하나의 유체 관이 압력 챔버로부터 베이스를 통하여 미세유체 칩로 연장된다. 미세유체 칩은 생성 챔버를 포함할 수 있다. 생성 관은 부분적으로 베이스를 통해 그 리고 부분적으로 배기가스 및 폐기물 챔버의 벽을 통해 연장될 수 있다. 챔버는 흡수 재료, 증발기 등을 포함할 수 있다. 챔버는 사용된 시약 폐기물을 흡수하기 위해 흡수 재료를 포함할 수 있다. 챔버 는 폐기물을 위해 비활성제를 포함할 수 있다. 챔버는 챔버의 밖으로 항균성 가스(예를 들면 이산화 염소 가스)의 통로를 내도록 구성된 가스 투과성 뚜겅을 포함할 수 있다. 뚜껑은 가스 투과 성 멤브레인일 수 있다. 상기 시약 컨테이너, 미세유체 칩, 그리고 배기가스 및 폐기물 챔버는 베이스에 부착 되고 지지될 수 있다. 작동 중, 압력 생성기는 도 23a 및 23b에 도시된 바와 같이 그 폐쇄된 위치에서 시작할 수 있다. 이 위치 에서, 압력 생성기는 챔버 통로를 밀봉하며, 그로 인해 액체 시약이 챔버에 들어갈 수 없게 된다. (이산화 염소 가스와 같은) 항균성 가스를 생성하도록 (예를 들면 마이크로컨트롤러과 같은 마 이크로컨트롤러로부터) 지시가 있을 때, 압력 생성기는 도 23c 및 23d에 도시된 바와 같이 그 개방된 위 치로 이동한다. 액체 시약은 시약 컨테이너 밖으로 나와서 압력 챔버 안으로 들어간다. 압력 챔버는 미세유체 칩으로의 전달을 위해 원하는 특정 용적의 액체 시약로 하여금 압력 챔버 를 채우도록 크기와 모양을 가질 수 있다. 최종적으로, 압력 생성기는 도 23e-23g에 도시된 바와 같이 그 폐쇄된 위치로, 챔버 통로를 한 번에 밀봉하며 되돌아오며, 시약 컨테이너로부터의 액체 시약의 추가적인 도입을 막도록 하며, 챔버 내의 액체 시약을 가압하여, 시스템의 나머지로 액체 시약을 밀고 나아가도록 한다. 구체적으로, 상기 액체 시약은 유체 관을 통해, 생성 챔버를 통해, 생성 관을 통해, 그리고 배기가스 및 폐기물 챔버 안으로 밀려 나아간다. 여기서, 액체 폐기물 은 챔버 내에 캡처되는 반면, 항균성 가스(예를 들면 이산화 염소 가스)는 가스 투과성 뚜껑 을 통해 지나가서 주변 환경으로 간다. 폐쇄된 위치로부터 개방된 위치로, 다시 폐쇄된 위치로의 압력 생성기의 복수의 사이클이 상기 시스템을 통해 완전히 시약을 밀어내도록 요구될 수 있다. 특히, 항균성 가스(예를 들면 이산화 염소 가스) 생성기 가 새것일 때, 압력 생성기의 적은 횟수의 사이클이 항균성 가스(예를 들면 이산화 염소 가스)를 생성하는 것을 시작하는데 필요할 수 있다. 도 23a-23g에 도시된 바와 같이, 생성기는 항균성 가스(예를 들면 이산화 염소 가스)를 생성하도록 생성 챔버를 들어가는 단일 액체 시약을 포함할 수 있다. 따라서, 미세유체 칩은 미세유체 전기화 학 생성기를 상기 설명된 바와 같이 사용할 수 있다. 대안적으로, 도 23a-23g에 도시된 바와 같이, 생성기는 생성 챔버를 들어가는 NaClO2를 포함하는 단일 액체 시약을 포함할 수 있으며, 생성 챔버에는 고체 활성제가 담기며, 따라서 이산화 염소 가스와 같은 항균성 가스를 생성한다. 대안적으로, 도 24에 도시된 바와 같이, 생성기는 별도의 두 압력 챔버, 별도의 두 압력 생성기 , 및 별도의 두 유체 관을 갖는 별도의 두 시약 컨테이너를 포함할 수 있으며, 그로 인해 별 도의 두 액체 시약이 생성 챔버를 따로 들어가서 결합되고 섞여서 항균성 가스(예를 들면 이산화 염소 가 스)를 생성하도록 할 수 있다. 압력 생성기는 예를 들면 전기 스텝 모터 등을 포함하는, 전기 모터를 포함하는, 액추에이터(미도시)와의 연결을 통해 액추에이션될 수 있다. 압력 생성기는 플런저일 수 있으며 이물과 고물에 (종방향으로) 병진 운동을 통해 압력을 생성할 수 있다. 압력 생성기는 챔버와 유체 관에 동축의 방향으로 병진 운동 할 수 있다. 압력 생성기(236 6)는 챔버 통로에 각을 끼고 배향되고 한 방향으로 병진 운동 할 수 있다. 일 태양에서, 압력 생성기 는 챔버 통로로부터 직각(90도)인 축을 따라 병진 운동한다. 생성기(2300, 2400)는 압력 생성기(들) 및/또는 시약 컨테이너(들)과 통신하는 하나 이상의 밸브 (미도시)를 포함할 수 있다. 유사하게, 하나 이상의 제어 밸브(미도시)는 챔버 통로(들) 및 미세유체 칩과 통신할 수 있다. 이들 밸브는 생성 챔버 안으로 들어가는 시약의 흐름을 선택적으로 허용하거나, 방지하거나, 제어할 수 있다. 생성기(2300, 2400)는 챔버 통로(들)를 통과하는 시약의 수량, 질량, 용적 등을 판단하는 센서 시스템을 포함할 수 있다. 이와 같이, 이들 대안 실시예는 도시되지 않았지만, 이와 같이 이들은 고려되며, 도면은 한정적으로 의도되지 않는다. 항균성 분산 시스템 및 장치 도 37은 밀봉된 환경 외부에 항균성 가스 또는 증기를 그 안의 물품을 살균하기 위해 생성하는 시스템을 도시한다. 도 38a 및 38b는 밀봉된 환경 내의 물품을 살균하기 위해 밀봉된 환경 내에서 항균성 가스 또는 증기 를 생성하는 시스템의 개략적 다이어그램을 도시한다. 도 40은 밀봉된 환경 내의 물품을 살균하기 위해 항균성 가스 또는 증기를 상기 밀봉된 환경 내에 또는 상기 밀봉된 환경 외부에 생성하는 방법을 도시한다. 도 41a 및 41b는 조절된 샘플에 대한 이산화 염소 효능 테스트 데이터를 도시한다. 여기 사용된 바와 같이, 용어 \"물품\"은 개인 보호 장구(\"PPE\") 및 비-PPE 물품을 모두 포함하며, 이는 개인 물 품, 의복, 의료 장비, 의류, 의복, 신발, 개인 전자 기기, 가구, 사무용품, 빌트인 구조물, 커튼, 직물, 기구, 비품, 장식품, 식품 및 식물과 같다. 추가적으로, 용어 \"밀봉된 환경\"은: 밀봉 가능한 가방, 텐트, 보관 용기, 드럼, 텀블러 드럼, 챔버, 룸, 사무실, 상점, 창고, 가정, 병원, 고층 건물의 바닥, 객실, 항공기 객실, 차량 객실, 선적 컨테이너, 수상 선박 객실, 수중 선박 객실, 대중 교통 차량 중 어느 것이든지 포함한다. 기구/시스템(3700 및 3800)은 하기에 제한되지 않고 하기를 포함하는 PPE를 살균하기 위해 이산화 염소 가스와 같은 항균성 가스를 사용한다: N95 인공호흡기, 수술용 마스크, 보호복, 고글, 헬멧을 의료 전문가와 환자에 의 한 재사용하기에 안전하게 하도록 하며, 사무실과 가정 환경에서도 개인 물품과 시설을 안전하게 재사용할 수 있도록 한다. 추가적으로, 개시된 방법 및 기구는 포함된 공간 및 물품의 일반적인 제독에 적용될 수 있다. 이 기술은 일반 경질 표면 및 다공성 가정용 재료에 대한 에볼라 대체물에 대해 그리고 민감한 장비에 대한 광 범위한 화학적 및 생물학적 오염 제거제로서 효과적인 것으로 나타났다. N95 마스크를 살균하고 재사용하는 것 의 수익성은 이전에 과산화 수소 증기를 사용하여 입증되었으나, 특화된 (그리고 비싼) 장비에 대한 필요는 단 일 위치로 사용된/오염된 N95 마스크를 처리를 위해 이동시키는 것을 요구한다. 제안된 접근법으로, 사용된 N95는 밀봉가능 챔버에 배치되고 항균성 가스(예를 들면 사용시 현장에서 생성된 이 산화 염소 용액)의 빈 공간에 노출될 수 있다. 짧은 항균성 가스 생성 구간 후, 용해된 항균성 가스는 챔버 내 에서 배기가스 처리되며, 이는 항균성 가스로 하여금 관통하여 인공호흡기를 살균하도록 한다. 충분한 살균 구 간 후, 상기 액체 및 기체 살균 용액(예를 들면 이산화 염소)는 살균된 N95를 회수하기 위해 챔버를 개방하기 전에 중화된다. 중화는 키트와 함께 포장된 무해한 건조 화학 약품과 같은 소량의 중화제를 추가함으로써 수행 된다. 상기 사용된 살균 용액과 모든 포장 물질은 그 후 무해한 폐기물로서 처분된다. 상기 시스템 설계는 처리 시설, 전방 작전 기지 또는 병원에서 대량의 N95 마스크와 다른 장비를 처리하도록 사용하기 위해 작은 배치(대 략 1 - 20 인공호흡기)에 대한 단일 물품 구조부터 큰 배치(수백 또는 수천의 N95)에 대한 룸 크기의 챔버 또는 전용 룸에 이르기까지 매우 확장가능하다. 상기 방법은 전기를 필요로 하지 않고, (비닐 가방과 같은 컨테이너 와 반응성 재료를 포함하는) 상기 제독 키트는 다른 필드 장비와 함께 쉽게 운반될 수 있다. 선택적으로, 큰 배 치에 대한 전용 룸을 위한 큰 룸의 크기의 챔버 내에서 가스 분산 장치(\"GDU\")는 더 빠르고 더 균일한 분산을 위해 이산화 염소를 폐쇄로 밀어내는 동안 이산화 염소의 해방을 가속화하도록 팬 또는 블로워를 포함할 수 있 다. 상기 GDU는 매우 적은 전력을 요구할 수 있다(예를 들면 배터리로 작동될 수 있다). 예비적 효능 테스팅(도 41a 및 41b)이 N95로부터 잘라낸 9개의 쿠폰을 유기물 테스트 토양에서 준비된 7.7-로그 의 파이6 박테리오파지(코로나19 및 에볼라의 대체물)로 오염시킴으로써 수행되었다. 쿠폰은 82L 컨테이너에 있 는 180ppm의 이산화 염소 용액 6리터로부터 생성된 이산화 염소 가스에 노출되었다. 작은 팬이 배기가스 배출 및 혼합을 돕도록 이산화 염소 용액의 표면을 가로질러 안내되었다. 쿠폰은 1.50, 2.25 및 3시간 후 제거되었다; 노출 시간은 3개의 처리 레벨에 대응한다: 각각 1500, 2200 및 2800 ppm시간. 제어 쿠폰은 실험의 지속시간(3시간)에 대해 주변 조건 하에 유지되었다. 처리 후, 쿠폰은 분석되었다; 세 가지 처리 레벨 모두에서 이산화 염소 가스로 처리된 쿠폰에서 비리온(virion, 성숙한 바이러스 입자)이 회수되지 않았다. 세 가지 처리 레벨 모두에서 비리온의 6-로그 감소가 관찰되었다. 도 41a 및 41b는 회수된 비리온 및 각 처리 레벨에 대해 관 찰된 로그 감소를 나타낸다. 이 분석에 대한 검출한계(LOD)는 1.7-로그였다. 이 초기 테스트에 기반하여, 이산 화 염소 가스는 파이6 대체 물질에 대해 효과적이었고 90분 이내에 6-로그 감소가 달성되었다.도 37은 밀봉된 환경 외부에 항균성 가스 또는 증기를 그 안의 물품을 살균하기 위해 생성하는 기구 를 포함하는 시스템의 다른 개략적 다이어그램을 도시한다. 시스템은 농축된 이산화 염소 용 액으로부터 가습된 살균 가스 또는 증기(예를 들면, 이산화 염소 가스 또는 증기)를 통과시키도록, HVAC 시스템 또는 가습기 시스템에 결합된 가스 또는 증기 생성 장치를 포함할 수 있고, 가습된 살균 가스 또 는 증기(예를 들면 이산화 염소 가스 또는 증기)는 밀봉된 환경 내에서 그 안의 물품을 살균하기 위해 재 순환될 수 있는 히터를 통해 더 증발될 수 있다. 시스템은 생성 장치로 이산화 염소 용액를 펌핑하기 위해 펌프를 추가적으로 포함할 수 있다. 급수선이 생성 장치에 물을 제공할 수 있다. 생성 제어기는 생성 장치를 제 어하거나, 사용자가 입력을 하도록 하거나, 둘 다 하도록 하는 역할을 할 수 있다. 이산화 염소 센서는 밀봉된 환경 안에 배향될 수 있으며 프로세스 제어기와 (유선 또는 무선으로) 통신할 수 있다. 프 로세스 제어기는 궁극적으로 시스템의 모든 항균성 가스 또는 증기 생성을 제어할 수 있으며, 이는 밀봉된 환경 안에서 살균성 가스 또는 증기의 농축에 대해 센서로부터 데이터를 수신하는 것을 포 함한다. 프로세스 제어기는 센서로부터 수신된 데이터에 기반하여 원하는 항균성 가스 또는 증기 농도를 달성하도록 더 많거나 더 적은 살균성 가스 또는 증기의 생성을 하도록 할 수 있다. 살균을 위한 물품은 다음 중 하나 이상을 포함할 수 있다: 의료용 개인 보호 장비(\"PPE\"), 의료 장비, 의류, 의 복, 신발, 개인용 전자 기기, 가구, 사무용품, 빌트인 구조물, 드레이프, 천, 도구, 비품, 장식품, 식물 및 포 장 또는 비포장 음식. 밀봉된 환경은 다음 중 어느 것이든지 될 수 있다: 밀봉 가능한 가방, 텐트, 컨테이너, 드럼, 텀블러 드 럼, 챔버, 룸, 사무실, 상점, 창고, 가정, 다층 건물의 바닥, 객실, 항공기 객실, 차량 객실, 수상 선박 객실, 수중 선박 객실. 밀봉된 환경에 있는 물품의 살균은 다음 중 하나 이상의 파괴를 달성할 수 있다: 미생물 유기체, 박테리아, 바이러스, 균류, 해충, 독소, 세균, 진드기, 빈대 등. 도 38a 및 38b는 밀봉된 환경 내의 물품을 살균하기 위해 밀봉된 환경 내에서 항균성 가스 또는 증기를 생성하 는 시스템을 도시한다. 시스템은 상기 밀봉된 환경(3820, 3830, 3840, 3850) 내의 물품을 살균하 기 위해 밀봉된 환경 내의 항균성 증기를 생성하는 기구(3810 및 3860)를 포함할 수 있다. 도 38a에서, 시스템은 단일 통로를 통해 밀봉된 환경 (예를 들면 큰 가방)을 (흡입 측(381 3)을 통해) 비우도록 사용되는 기구(예를 들면 매장 진공청소기)를 포함한다. 비움 후, 밀봉된 환 경은 단일 통로를 통해 그 안의 물품을 살균하기 위해 항균성 가스 또는 증기로 (배기 측 을 통해) 다시 채워질 수 있다. 도 38b에서, 기구는 복수의 밀봉된 환경(3830, 3840, 3850)을 (흡입 측을 통해) 비우고 복수의 밀 봉된 환경(3830, 3840, 3850)을 각 통로(3832, 3842, 3852)를 통해 그 안의 물품을 살균하기 위해 (배기 측 을 통해) 항균성 가스 또는 증기로 다시 채우도록 사용될 수 있다. 대안적으로, 도 38b에 도시된 바와 같 이, 기구는 밀봉된 환경 내에서 가스 또는 증기 생성 장치로서 사용될 수 있다. 밀봉된 환경(387 0)은 다음 중 어느 것이든지 될 수 있다: 밀봉 가능한 가방, 텐트, 컨테이너, 드럼, 텀블러 드럼, 챔버, 룸, 사 무실, 상점, 창고, 가정, 고층 건물의 바닥, 객실, 항공기 객실, 차량 객실, 수상 선박 객실, 수중 선박 객실. 도 40은 밀봉된 환경 내의 물품을 살균하기 위해 항균성 가스 또는 증기를 상기 밀봉된 환경 내에 또는 상기 밀 봉된 환경 외부에 생성하는 방법을 도시한다. 방법은: 밀폐된 환경에 항균성 증기를 제공하는 단계 (단계 4002); 하기 중 하나를 통해 상기 밀폐된 환경 내에 상기 항균성 증기를 생성하는 단계: (단계 4004) (a) 이산화 염소 항균성 증기의 스트림을 생성하도록 가습기 시스템 안으로 제어된 농도 레벨의 액체 이산화 염소 용액을 펌핑하는 것, (b) 상기 밀폐된 환경의 주변으로 제어된 농도 레벨의 이산화 염소 항균성 증기를 직접적 으로 펌핑하는 것, (c) 고체 이산화 염소 시약을 물로 채워진 컨테이너 안으로 용해시킴으로써 주변 이산화 염 소 항균성 증기를 생성하는 것; 및 상기 주변 이산화 염소 항균성 증기를 상기 밀폐된 환경으로 배출하는 상기 컨테이너를 배치하는 것, (단계 4006); 하기 중 하나를 통해 상기 밀폐된 환경 외부에 상기 항균성 증기를 생성 하는 단계: (단계 4008) (a) 이산화 염소 항균성 증기의 스트림을 생성하도록 가습기 시스템 안으로 제어된 농 도 레벨의 액체 이산화 염소 용액을 펌핑하는 것, (b) 상기 밀폐된 환경의 단일 통로를 통해 상기 밀폐된 환경 을 들어가도록 제어된 농도 레벨의 액체 이산화 염소 항균성 증기를 직접적으로 펌핑하는 것, (c) 상기 밀폐된 환경의 제1 통로를 통해 상기 밀폐된 환경을 들어가도록 제어된 농도 레벨의 이산화 염소 항균성 증기를 직접적 으로 펌핑하는 것(단계 4010).도시된 바와 같이, 방법은 단계 다음에 단계(4004 및 4006)을 수행하거나, 단계 다음에 단계 (4008 및 4010)을 수행한다. 도 42는 3차원 공간에서 물품을 살균하기 위해 항균성 가스 또는 증기를 생성하는 기구 를 도시한다. 도 43은 3차원 공간에서 물품을 살균하기 위해 항균성 가스 또는 증기를 생성하는 기구 를 도시한다. 도 44 는 항균성 가스를 생성하도록 도 43에서 기구의 사용을 위한 절차를 도시한다. 도 45는 수중과 공기 중에 서 이산화 염소 가스의 용해도에 미치는 온도의 영향과 정의된 룸의 크기에 대한 이산화 염소 가스의 양을 나타 내는 표를 도시한다. 도 46은 실내에서 분산되는 이산화 염소 가스 농도의 균일성을 도시한다. 도 47은 가구가 있는 실내에서 가스 농도 프로필을 도시한다. 도 48은 상대적 습도와 이산화 염소 용액으로부터 생성된 이산화 염소 가스 농도를 도시한다. 도 49는 살균 효능에서의 증가와 상승된 습도의 상관관계를 도시한다. 도 50은 항 균성 가스를 생성하고 상기 가스를 기구를 통해 분산시키는 방법을 도시한다. 도 42 및 50은 정의된 용적의 공간으로 항균성 가스를 생성하고 분산시키는 컴퓨터 구현 방법을 수 행하는 모바일 기구의 예시를 도시한다. 방법은 다음 단계를 수행하는 것을 포함한다: 살균될 공간 의 용적을 측정하는 단계(단계 5002); 살균될 공간의 상기 측정된 용적에 기반하여 살균 파라미터를 제어 기에 의해 설정하는 단계(단계 5004)(상기 살균 파라미터는 적어도 다음을 포함함: (a) 상기 항균성 가스 의 균일한 분산을 위해 상기 공간의 용적에서 상기 기구의 최적의 위치를 판단하는 것, (b) 살균 주기의 시간적 지속시간, (c) 생성되도록 요구되는 항균성 가스의 최소량, (d) 항균성 가스 생성의 유속, 항균 성 용액의 용적, 그리고 항균성 가스의 필요 유속을 충족시키기 위한 항균성 용액의 농도, (e) 살 균 주기 중 사용될 항균성 가스 상대 습도 범위 (단계 5006)). 그 후, 완료될 때까지 살균 사이클을 실행하도록 기구를 활성화는 단계; 진동 헤드에 장착된 복수의 노즐을 통해 항균성 가스를 공간의 용적으로 방출하는 단계를 포함한다. 방법은: 상기 살균 주기 중에 공간의 용적 내에서 (복수의 원격 센서(4242-4248)에 의해) 복수의 원격 위치에서 항균성 가스 농도의 판독을 주기적으로 모니터링하는 단계 및 공간의 용적에서 균일한 항 균성 가스 분산을 위해 상기 항균성 가스 유속 및 상기 항균성 가스 농도 중 하나 이상을 조정하는 단계(단계 5010)를 더 포함할 수 있다. 상기 공간의 용적의 측정은 통합된 온보드 레이저 빔 스캐너에 의해 수행될 수 있다. 상기 방법은 상기 진동 헤드에 장착된 복수의 노즐을 완전한 원 또는 반원보다 작게 축을 따라 진동시키는 것을 포함 한다. 상기 방법은: 상기 복수의 위치(4242-4248)의 각각에서 상기 항균성 가스 농도가 모니터링되어 판독되면, 상기 진동 헤드에 장착된 하나 이상의 각 노즐로 하여금 다음 중 하나 또는 결합을 수행하도록 하 여 상기 복수의 위치에서 상기 항균성 가스의 농도 차이를 오프셋하는 것을 포함할 수 있다: 상기 노즐의 세로 각도를 조정하는 것, 상기 항균성 가스의 배출 유속을 조정하는 것, 그리고 상기 항균 물질의 배출 압력을 조정 하는 것이다. 상기 복수의 위치(4242-4248)의 각각에서 상기 항균성 가스 농도가 모니터링되어 판독되면, 상기 방법은 리액터 에 담긴 항균성 용액으로부터 배출된 항균성 가스을 흡입하는 제1 블로워의 팬 속도를 변화 시키는 것을 포함할 수 있다. 상기 항균성 가스는 상기 제어기의 상기 설정에 따라 상대 습도(RH)의 범위 에서 증기 페이즈로 상기 항균성 용액으로부터 배출될 수 있으며, 상기 증기 페이즈의 상대 습도의 범위는 상기 항균성 용액의 온도와 상관관계가 있다. 상기 항균성 가스 또는 증기는 다음 중 하나일 수 있다: 이산화 염소 가스 또는 증기 및 과산화 수소 가 스 또는 증기. 상기 이산화 염소 가스 또는 증기는 아염소산염 함유 화합물을 활성제와 화학적으로 반응시킴으 로써 생성될 수 있고 상기 과산화 수소 가스 또는 증기는 우레아 과산화 수소, 붕사, 과붕산염 또는 과탄산염 화합물을 활성제와 화학적으로 반응시킴으로써 생성될 수 있으며, 상기 활성제는 산 또는 프로톤 공여 용매를 포함한다. 상기 아염소산염 또는 과산화물 함유 화합물 및 상기 활성제는 무수의 분말로서 따로 패키징되거나 농축 용액 패키지로서 따로 패키징되며, 이는 상기 항균성 용액을 형성하도록 상기 리액터에서 함 께 혼합되는 것이다. 살균 주기의 완료 시, 통기 사이클은 상기 공간의 용적에서 주변 항균성 가스를 흡착하도록 정의된 구간동안 시 작될 수 있다. 대안적으로, 통기는 또한 상기 항균 물질 분산 주기 중에 주변의 항균성 가스의 균질성을 돕도록 일어날 수도 있다. 더 구체적으로, 상기 통기 주기는 제2 블로워에 의해 상기 기구의 입구 에서 배치된 탄소/HEPA 필터를 통해 주변 공기를 끌어내고 재순환시킴으로써, 그리고 상기 기구의 출구 에서 필터링된 공기를 환기시킴으로써 수행될 수 있으며, 상기 제2 블로워는 물리적으로 상기 제1블로워로부터 아래에 멀리 배치되며, 그로 인해 주변의 상기 항균성 가스 또는 증기는 상기 탄소/HEPA 필터 에 의해 흡착된다. 상기 모바일 기구는 이동성을 제공하도록 바퀴 위에 장착될 수 있다. 상기 방법은 다음 중 하나 또 는 결합을 포함하는 상황에서 모바일 기구로부터 경고 신호를 발송하는 것을 포함할 수 있다: 상기 주변 공 기에서의 상기 항균성 가스 또는 증기가 정의된 불안전 레벨을 초과할 때, 상기 제1 블로워 또 는 상기 제2 블로워 중 하나의 고장, 또는 리액터 안의 항균성 용액의 고갈. 상기 경고 신호는 시각적, 청각적, 원격 장치(예를 들면 전화)로 무선으로 송신될 수 있거나, 또는 그 중 어느 결합일 수 있다. 도 43 및 44는 3차원 공간에서 물품을 살균하기 위해 항균성 가스 또는 증기을 생성하고 분산시키는 컴퓨 터 구현 방법을 수행하는 모바일 기구의 예시를 도시한다. 기구는 가습기 유닛, 메인 유닛, 지지 요소, 필터링된 공기 출구, 탄소 필터 흡기, 메인 유닛 팬, 가스 센서, 제거가능 원격 및 데이터 판독 태블릿, 팬 출구를 갖는 진동 타워 팬, 카트 밑 보관 및 휴대용 배터리 배치 영역 및 주기 표시등을 포함할 수 있다. 기구는 이동이 가능하 고 살균될 3차원 공간 내외로의 쉬운 이동을 위해 바퀴 위에 놓일 수 있다. 방법은 농축 용액 병(4432, 4434)의 캡을 \"프라임\"으로 돌리고 2시간 동안 그대로 두는 것; 병 (4432, 4434)을 (가습기 유닛의) 컨테이너 유닛 안에 두는 것; 병(4432, 4434)의 캡을 \"사 용 중\"으로 돌리고 뚜껑을 닫아 병(4432, 4434)을 시스템의 펌프에 잠그도록 하는 것; 메인 유닛에 인접 한 모바일 장치에 컨테이너 유닛을 배치하는 것; 기구에서 리모콘을 제거하고 처리될 룸을 떠나고, 노란색 표시등이 켜지면 기구는 유체를 메인 유닛으로 펌핑하기 시작할 것; 초 록색 표시등이 켜지면, 기구는 살균을 시작할 준비가 되는 것; 파란색 표시등이 켜지면, 기 구는 그 주기를 시작했고 가습기와 팬(4314, 4322)이 활성화되는 것; 살균 주기가 완료되면, 비활 성화 명령이 나타나며, 자외선 및 화학적 배출이 상기 시스템으로 하여금 비활성화하도록 하는 것; 빨간 색 표시등이 켜지면, 기구의 주기는 완료되며, 사용자가 살균된 룸으로 되돌아가도 안전하며, 상기 유체는 메인 유닛(4304, 4404)로부터 밖으로 펌핑되어 원래 병(4432, 4434) 안으로 들어가는 것; 컨테이너 유닛 은 리모콘을 기구에 다시 교체할 때 잠금 해제되며, 병(4432, 4434)은 검사될 수 있고 캡 은 \"처분\" 및 폐기되도록 설정될 수 있는 것;을 포함한다. 다른 일 태양에서, 항균성 가스를 생성하는 프로세스는 하기 단계를 포함할 수 있다: 1. 프로세스에서의 단계 a. 사용자가 룸 식별 정보를 입력(또는 RFID 태그를 통해 자동화)하고 터치 스크린, 블루투스 또는 와이파이 통 신을 통해 살균 루틴을 선택한다. i. 살균 주기는 필요에 따라 달라질 수 있다. 예를 들면 짧은 주기의 위생 처리, 환자 교체 사이, 룸에서 전염 병이 알려진 경우, 탈취 등. ii. 레이저 스캐너로 룸의 크기/용적을 계산하거나 사용자가 선택한 옵션으로 사용자 입력, 레이저 스캐닝, 시 스템 센서로 측정한 가스 농도 수준에 따라 룸의 크기를 결정할 수 있다. iii. 타겟 살균 레벨 및 룸의 크기에 대한 데이터 모델에 기반한 살균 주기 파라미터(예를 들면 RH, 램프 업, 농도, 시간, 통기) 1. 각 룸에 대한 각 주기에 대해 실제 데이터가 기록될 것이며 일반적으로 그리고 특정 룸/공간에 대해 모델을 구체화하도록 사용된다. iv. 살균 주기를 실행하기 위해 추정되는 시간을 알려주는 사용자에 의해 제공된 피드백 v. 주기가 곧 시작할 것을 나타내는 경고등이 활성화된다(거주자는 룸을 떠나야 함) b. 장치는 데이터 모델에 기반하여 사용자에 의해 선택된 살균 루틴을 실행한다. i. 주기가 시작되었음을 알리도록 경고등이 색깔을 변경; 사용자는 원격 모니터링 앱을 통해 통지받는다. ii. 타겟 RH 값으로 (원격 센서 피드백에 기반하여) 룸의 조건을 맞춘다. iii. 초기 램프 업에 대해 미리 결정된 시간 윈도우 동안 타겟 농도(ppm)에 도달하는 데 필요한 항균 가스 생성 속도를 계산한다. iv. 계산된 속도로 항균성 가스를 생성하고 조제한다. v. 강제 공기 흐름과 지향 및/또는 회전 노즐을 사용하여 실내 공간에 가스를 분사한다. vi. CFM은 가스 생성 흡수율을 초과하고 실내 용적에서 가스를 균일하게 혼합하기에 충분하다. vii. 가스 항균 물질 혼합을 위한 흡입 공기는 HEPA 필터링된다. viii. 가스 생성을 조정하도록 원격 화학 센서로부터 피드백에 기반하여 램프 업 중 타겟 속도에 도달하도록 항 균성 가스 생성의 속도를 조정한다. 1. 항균성 가스 생성의 요구 속도는 (계산된 용적 공간을 차지하는) 룸 안의 장비, 가구 등의 양, 룸 안의 다공 성 물품에 의한 항균성 가스의 흡수 및 항균성 가스 농도의 자연적 부패에 의해 영향을 받는다. ix. 살균 주기의 지속시간에 대한 타겟 농도를 유지하도록 원격 화학 센서로부터의 피드백에 기반하여 항균성 가스 생성의 속도를 자동으로 조정한다. x. 안정적인 상태 조건이 충족되면 주기의 끝으로 시간에 맞춰 사용자를 업데이트한다. xi. 살균 프로세스 파라미터가 주기 전반에 걸쳐 유지된다는 기록을 생성하여 센서 데이터를 계속적으로 모니터 링하고 기록한다. xii. 프로그램 주기의 끝에서 가스 생성을 종료한다. xiii. 통기 주기가 개시된다. 1. 하부 블로워 시스템은 화학적 항균 물질이 더 이상 검출되지 않을 때까지 (안전 계수 추가) 공기의 공간을 뒤집는다. 2. 흡입 공기는 공기로부터 항균 물질 및 오염 물질을 제거하도록 탄소 필터 및 HEPA 필터를 통해 필터링된다. xiv. 주기가 끝났음을 알리도록 경고등이 색깔을 변경; 사용자는 원격 모니터링 앱을 통해 통지받는다. c. 보고 및 데이터 분석. i. 생성되고 문서화 목적으로 중앙 데이터 수집 시스템에 업로드된 파일을 보고한다. ii. 일반적으로 그리고 그 특정 룸에 대해 살균 모델을 계속적으로 구체화하도록 설정된 모델 학습 데이터에 추 가된 데이터를 프로세싱한다. 2. 이산화 염소 가스 a. 순수 이산화 염소 가스는 어떤 수량의 재료 물질로부터든지 생성될 수 있다; 바람직하게는 생성 재료는 높은 레벨의 이산화 염소를 생산한다. b. 이산화 염소 생성 방법은 적어도 하나의 항균성 주기에 대해 충분한 이산화 염소를 생성할 능력이 있을 필요 가 있다. c. 이산화 염소 생성 방법은 약 15분 내에 타겟 룸 농도 레벨에 도달하기에 충분히 빠른 이산화 염소를 생산할 능력이 있을 필요가 있다. d. 이산화 염소 생성 방법은 일괄 프로세스 생산 또는 적시(just-in-time) 생산일 수 있다. e. 생성 재료는 바람직하게는 인간의 접촉을 요구하지 않는 형태로 제공되며, 여기서 도입/통합 프로세스는 장 비와 함께 화학 약품 공급을 지원하며, 공급 속도는 이산화 염소 생산의 속도를 제어하도록 제어될 수 있다. f. 순수 이산화 염소 가스는, 예를 들면 교반/혼합; 통기, 표면 팬/블로워; 역류 공기가 있는 급수탑; 물 흐름 또는 스프레이를 통한 기류; 박막 증발; 진공; 압전; 난방; 등 어느 방법을 사용하든지 액체로부터 분리될 수 있다. g. 이산화 염소 생성 프로세스로부터의 액체 부산물은 잔여 이산화 염소를 파괴하도록 어떤 수량의 화학 반응 프로세스에 의해서든지 중화될 수 있다. 대안적으로, 생성 액체는 잔여 이산화 염소를 제거하도록 통기 주기 중 에 상기 시스템을 통해 재순환될 수 있다.3. 구성 a. 상기 이산화 염소 가스 살균 시스템은 설명되는 바와 같이 완전한 프로세스 제어 및 문서화 특징을 갖는 완 전히 자동화된 유닛으로서 구성될 수 있다. b. 프로세스 자동화 및 제어가 없는 수동 구성은 적절히 훈련된 사람에 의해 구성될 수 있다. 예제 1: 도 51a는 이산화 염소 대 공기의 0.1ppm의 타겟 농도를 위한 평형까지의 시간(분)을 도시한다. 이 매우 작은 설 정을 사용하여 몇 분만에 평형에 도달했다. 상기 ISO 선적 컨테이너 내부의 주변 공기가 0.08 ppm의 평형에 도달한 후, 상기 시린지 펌프는 1 μL/min의 속 도로 켜졌고, 상기 이산화 염소 농도는 상기 ISO 선적 컨테이너 벽에서 다섯 개의 다른 포트에서 측정되며, 상 기 포트는 ISO 선적 컨테이너 주변의 다른 위치에 분포된다. 도 51b는 시간(분)에 걸친 다섯 개의 포트에서 측 정된 농도(이산화 염소 대 공기의 ppm)를 도시한다. 각 포트에서 측정된 상기 농도는 도 51b에 도시된 바와 같 이 테스트 시간에 걸쳐 실질적으로 유사했다. 예시 2: 예시 2에서, 125mL의 0.75g/mL 아염소산 나트륨 및 632mL의 0.50g/mL Na2S2O8 용량을 팬이 ClO2 용액 위로 불어 오는 유닛에 분사했다. 상기 유닛은 ISO 선적 컨테이너(예를 들면 밀봉된 환경)의 중앙에 위치했다. 상기 팬은 둘러싸이고 밀봉된 ISO 선적 컨테이너 내에서 공기를 불었으며, 상기 ISO 선적 컨테이너는 1,300 입방 피트 /36.8 입방 미터의 내부 용적을 가졌다. 도 52a는 이산화 염소 대 공기의 350ppm의 타겟 농도를 위한 평형까지 의 시간(분)을 도시한다. 도시된 바와 같이, 평형은 약 60분 내에 도달되었다. 상기 ISO 선적 컨테이너 내부의 주변 공기가 350 ppm의 농도에 도달한 후, 이산화 염소 생산은 중단되었고, PortaSens 장치가 상기 ISO 선적 컨테이너 벽에서 12개의 다른 포트에서 농도를 판독하도록 사용되었으며, 상기 포트는 ISO 선적 컨테이너 주변의 다른 위치에 분포된다. 도 52b는 시간(분)에 걸친 12개의 포트에서 측정된 농 도(이산화 염소 대 공기의 ppm)를 도시한다. 각 포트에서 측정된 상기 농도는 도 52b에 도시된 바와 같이 테스 트 시간에 걸쳐 실질적으로 유사했다. 예시 3: 도 53a 및 53b는 적은 용적의 고농축 액체 전구체로부터 이산화 염소 증기를 생성하는 하나의 예시적 시스템 의 다이어그램을 도시한다. 시스템은 아염소산 나트륨 농축액 및 활성제 농축액를 포 함한다. 아염소산 나트륨 농축액은 펌프에 유체적으로 연결되는 반면 활성제 농축액은 펌프 에 유체적으로 연결된다. 제어기는 두 펌프(5306 및 5308) 모두에 작동적으로 연결된다. 제어기 는 적어도 펌핑된 유체의 용적, 유속, 펌프 활성화의 시간 등을 포함하는 펌프(5306 및 5308)의 작동을 제어한다. 도 53a에 도시된 바와 같이, 각각의 펌프(5306 및 5308)는 t-혼합 챔버에 유체적으로 연결되며, 여기에서 아염소산나트륨 농축액 및 활성제 농축액이 결합되어 이산화 염소 증기를 생성한다. 도 53b에 도시 된 바와 같이, 각각의 펌프(5306 및 5308)는 미세유체 혼합 칩에 유체적으로 연결되며, 여기에서 아염소 산 나트륨 농축액 및 활성제 농축액이 결합되어 이산화 염소 증기를 생성한다. 이산화 염소 증기는 디퓨저에서 주변 공기로 확산된다. 이산화 염소 센서는 주변 공기 중의 이산화 염소의 농도를 감지하고 제어기에 작동적으로 연결된다. 주변 공기 중의 이산화 염소의 농도가 원하는 것 보다 낮을 경우, 제어기는 이산화 염소의 원하는 농도를 달성하기 위해 펌프(5306 및 5308)로 하여금 필 요에 따라 더 많은 이산화 염소를 생성하도록 하거나, 더 빠른 속도로 이산화 염소를 생성하도록 한다. 주변 공 기 중의 이산화 염소의 농도가 원하는 것보다 높을 경우, 제어기는 이산화 염소의 원하는 농도를 달성하 기 위해 펌프(5306 및 5308)로 하여금 필요에 따라 원하는 레벨로 이산화 염소의 농도가 떨어지도록 더 적은 이 산화 염소를 생성하도록 하거나, 더 느린 속도로 이산화 염소를 생성하도록 하거나, 원하는 시간에 이산화 염소 의 생성을 중단하도록 한다. 펌프(5306, 5308, 308A, 308B 및 308C)와 같은 펌프는 양변위 펌프(positive displacement pump)일 수 있다. 양변위 펌프는 상기 펌프의 각 회전/왕복 운동에 대해, 펌핑된 유체의 용적을 알 수 있는 이점을 제공할 수 있 다. 이 배치에서, 질량 흐름 제어기 또는 (흐름 센서 318A 및 318B와 같은) 흐름 센서는 시스템에서 제거될 수있다. 양변위 펌프는 펌프의 회전/왕복 수단에 폐쇄 루프 독립 센서(예를 들면 엔코더)를 허용할 수 있으며, 이 를 통해 시스템은 펌프의 움직임 및/또는 펌핑된 유체의 양을 독립적으로 측정할 수 있다. 왕복 또는 회전하지 않을 때, 펌핑 작업은 일반적으로 닫힌 구성을 유지하여 누출 흐름을 제거할 수 있고, 이는 마이크로 볼륨(예를 들면 마이크로리터) 제어에 중요하며, 예를 들면 하나 이상의 누출 제어 밸브 및 체크 밸브를 포함하는 하나 이 상의 2차 밸브를 제거할 수 있다. 일 태양에서, 항균 물질 생성기의 물질 수송 시스템은 펌프와 다운스트림 적극적/소극적 유체적 및/또는 생성기 요소 사이에 얼마나 많은 물질이 남아 있는지와 관련된 포스트 펌프에서 생성기 방출 \"무용 부피\"를 최소화하도 록 설계되어야 한다. 일 태양에서, 타겟은 동일한 데드 스페이스로 소모되는 전구체의 최소 생성기 주기 용적의 1배 미만 또는 0.5배 미만일 수 있다. 도 54a-c는 시스템 또는 유사한 복수의 시스템을 사용하는 이산화 염소 생성의 결과를 도시한다. 도 54a- c에 도시된 결과는 적은 용적의 고농축 전구체로부터 0.1 ppm의 이산화 염소 증기의 생성에 대응된다. 도 54a는 이산화 염소의 두 성분의 농축 액체 생성으로부터 취득되는 결과를 도시한다. 도 54b는 아염소산 나트륨 농축액 으로부터의 이산화 염소의 전기화학적 생성으로부터 취득된 결과를 도시한다. 도 54c는 초기 처리 및 30일의 계 속적 작동 후 모두에 대한 다양한 활성제를 포함하는 1,000 입방 피트(28.3 입방미터)의 룸에 대해 필요한 화학 적 사용에 대한 프로젝션을 도시한다. 예시 4: 대략 0.1ppmv 및 5ppmv 범위에서의 ClO2의 효능이 클렙시엘라 뉴모니아(Kp), 녹농균(PA), 스타필로코쿠스 아우 레우스(Sa) 및 살모넬라 엔테리카(Se)를 포함하는 임상적으로 관련된 감염성 박테리아에 대하여 평가되었으며, 또한 박테리오파지 파이6 및 MS2(각각 외피 및 비외피 바이러스를 나타냄)에 대해서도 평가되었다. 상기 미생물 은 인산염 완충 식염수(PBS)에서 준비되고 복제 유리 쿠폰(5개의 10 μL 액적; 쿠폰당 5-6 로그 세포 또는 비리 온과 동등)에 분사되고 이산화 염소 및 50- 60% 상대 습도(RH)로 조성된 룸 크기의 테스트 챔버에 배치되고 및 18 내지 21°C 범위의 주변 온도에서 작동되었다. 효능을 평가하기 위해, 이산화 염소로 처리된 쿠폰 대 처리되지 않은 대조군 쿠폰 대 시간으로부터 회수된 살아 있는 박테리아 또는 감염성 비리온의 농도가 측정되었다. 테스트마다, 복제 쿠폰(이중 또는 삼중)을 다양한 시 간 간격으로 테스트 챔버에서 제거하고 분석(추출 및 열거)하여 회수된 유기체의 총량을 결정하도록 했다. 그 결과는 사멸 곡선으로 표시되었다(회수된 로그 유기체 대 시간으로서 표현). 상기 사멸 곡선은 그 후 가스 처리 의 D값을 계산하도록 사용되었으며, 이는 주어진 테스트 조건에서 생존/감염 유기체의 90% 감소(또는 1 로그 감 소)를 달성하는 데 필요한 시간을 나타낸다. 선형 붕괴가 관찰된 상기 사멸 곡선의 영역은 D값(선형 붕괴 기울 기의 음의 역수로 계산)을 결정하도록 사용되었다. 도 55a 및 55b는 0.11 ± 0.04 ppmv (도 55a) 및 5.3 ± 2.4 ppmv (도 55b)의 범위에서 수행되는 유기체당 복 제 테스트로부터 평균 D-값(시간)을 도시한다. 상기 결과는 0.1 ppmv에서(도 55a) 모든 유기체의 90% 감소가 0.5 내지 1.2시간(또는 31 내지 70분)의 범위까지 빠르고 유사하다는 것을 입증한다. 예상되는 바와 같이, 효능은 0.2 내지 0.3시간(또는 13 내지 19분) 범위의 D-값을 갖는 5ppmv(도 55b)에서의 처 리로 증가하였다. 이 데이터에 기반하여, 0.1ppmv 및 5ppmv에서 99.9% 또는 3로그 감소를 달성하는 시간은 각각 1.5~3.6시간 및 0.6~0.9시간과 관련이 있다. 항균 생성 및 모니터링 시스템 및 장치 항균 물질을 생성하고 모니터링하기 위한 시스템이 제공되며, 상기 시스템은: 전산 시스템; 항균 센서; 및 항균 물질 생성기;를 포함하며, 상기 전산 시스템, 상기 항균 물질 생성기, 상기 항균 센서는 작동적으로 연결되는 것을 특징으로 한다. 상기 전산 시스템은 마이크로프로세서 및 마이크로컨트롤러 중 적어도 하나일 수 있다. 상 기 시스템은 외부 통신 장치를 더 포함할 수 있다. 상기 시스템은 별도의 센서 서브 시스템을 더 포함할 수 있 으며, 상기 별도의 센서 서브 시스템은: 센서 서브 시스템 마이크로프로세서 및 센서 서브 시스템 마이크로컨트 롤러 중 적어도 하나; 센서 서브 시스템 외부 통신 장치; 센서 서브 시스템 항균 센서 및 센서 서브 시스템 환 경 센서 중 적어도 하나; 및 센서 서브 시스템 전산 시스템;을 포함하는 것을 특징으로 한다. 상기 시스템은 별 도의 생성 서브 시스템을 더 포함할 수 있으며, 상기 별도의 생성 서브 시스템은: 생성 서브 시스템 마이크로프로세서 및 생성 서브 시스템 마이크로컨트롤러 중 적어도 하나;생성 서브 시스템 외부 통신 장치; 및 생성 서브 시스템 항균 물질 생성기;를 포함하는 것을 특징으로 한다. 항균 센서 및 환경 센서 중 상기 적어도 하나, 상기 항균 물질 생성기, 상기 전산 시스템, 상기 외부 통신 장치는 처리중에 있는 밀폐된 용적 내에 배향될 수 있다. 적어도 하나의 센서 서브 시스템 및/또는 생성 서브 시스템은 처리중에 있는 밀폐된 용적 내에 배향될 수 있다. 항균 물질을 생성하고 모니터링하기 위한 시스템이 제공되며, 상기 시스템은: 센서 서브 시스템을 포함하며, 센 서 서브 시스템은: 센서 서브 시스템 마이크로프로세서 및 센서 서브 시스템 마이크로컨트롤러 중 적어도 하나; 센서 서브 시스템 외부 통신 장치; 센서 서브 시스템 항균 센서 및 센서 서브 시스템 환경 센서 중 적어도 하나; 및 센서 서브 시스템 전산 시스템;을 포함하고, 생성 서브 시스템을 포함하며, 생성 서브 시스템은: 생성 서브 시스템 마이크로프로세서 및 생성 서브 시스템 마이크로컨트롤러 중 적어도 하나; 생성 서브 시스템 외부 통신 장치; 및 생성 서브 시스템 항균 물질 생성기;를 포함하고; 처리중에 있는 용적을 형성하는 밀폐된 공간을 포함하는 것을 특징으로 한다. 상기 센서 서브 시스템 및 상기 생성 서브 시스템은 처리중에 있는 상기 밀폐된 용적 내에 배향될 수 있다. 상기 센서 서브 시스템은 처리중에 있는 상기 밀폐된 용적 내부에 배향될 수 있고 상기 생성 서브 시스템은 처리중에 있는 상기 밀폐된 용적의 외부에 배향될 수 있다. 상기 생성 서브 시스템은 처리중에 있는 상기 밀폐된 용적 내에 배향될 수 있고 상기 센서 서브 시스템은 처리중에 있는 상기 밀폐된 용 적의 외측에 배향될 수 있다. 상기 시스템은 처리중에 있는 상기 밀폐된 용적의 내부에 유체적으로 연결된 HVAC 공기 공급부를 포함할 수 있으며, 상기 센서 서브 시스템은 처리중에 있는 밀폐된 용적 내에 배향될 수 있고, 상기 생성 서브 시스템은 처리중에 있는 밀폐된 용적의 외측에 배향될 수 있으며, 상기 생성 서브 시스템은 상 기 HVAC 공기 공급부에 유체적으로 연결될 수 있다. 상기 시스템은 처리중에 있는 상기 밀폐된 용적의 내부에 유체적으로 연결된 HVAC 환기 수송관을 포함할 수 있으며, 상기 생성 서브 시스템은 처리중에 있는 밀폐된 용적 내에 배향될 수 있고, 상기 센서 서브 시스템은 처리중에 있는 밀폐된 용적의 외측에 배향될 수 있으며, 상기 센서 서브 시스템은 상기 HVAC 공기 공급부에 유체적으로 연결될 수 있다. 이산화 염소를 생성하고 모니터링하기 위한 시스템이 제공되며, 상기 시스템은: 입구를 포함하는 장치 하우징; 마이크로컨트롤러 또는 마이크로프로세서; 시약을 담은 시약 컨테이너; 상기 시약으로부터 이산화 염소를 생성 하기 위한 장치; 및 감지 시스템;을 포함하는 것을 특징으로 한다. 상기 시스템은 두 시약 컨테이너를 포함할 수 있으며, 각 시약 컨테이너는 다른 시약을 담고 있을 수 있다. 이산화 염소를 생성하기 위한 상기 장치는 미 세유체 믹서일 수 있으며, 상기 두 시약은 상기 이산화 염소를 생성하도록 상기 미세유체 믹서 내에서 섞일 수 있다. 이산화 염소를 생성하기 위한 상기 장치는 전기화학 생성기일 수 있다. 상기 센싱 시스템은 상기 입구를 통해 도입된 주변 공기 내에서 이산화 염소의 농도를 측정할 수 있다. 상기 주변 공기 내에서 이산화 염소의 농 도의 측정값을 상기 마이크로컨트롤러 또는 마이크로프로세서에 전송될 수 있고, 상기 마이크로컨트롤러 또는 마이크로프로세서는 상기 이산화 염소 농도가 목표값 미만이면 상기 시스템으로 하여금 상기 이산화 염소를 생 성하도록 할 수 있다. 상기 시스템은 하나의 시약 컨테이너 및 하나의 시약을 포함할 수 있으며, 상기 이산화 염소를 생성하기 위한 상기 장치는 전기화학 생성기일 수 있으며, 상기 전기화학 생성기는 상기 이산화 염소를 생성하는 상기 시약과 반응을 일으키도록 전위를 사용할 수 있다. 상기 전기화학 생성기는 미세유체 장치일 수 있다. 상기 시스템은 상기 입구를 통해 도입된 주변 공기의 압력을 감지하도록 기압 센서를 포함할 수 있으며, 상기 압력은 상기 마이크로컨트롤러 또는 마이크로프로세서에 통신될 수 있으며, 부압(negative pressure)은 상 기 마이크로컨트롤러 또는 마이크로프로세서로 하여금 중립 압력(neutral pressure) 및/또는 정압(positive pressure)이 상기 기압 센서에 의해 감지될 때까지 이산화 염소 생성을 정지하도록 할 수 있다. 상기 시스템은 멤브레인을 갖는 배기가스 및 폐기물 챔버를 포함할 수 있으며, 상기 이산화 염소의 생성으로부터의 폐기물은 흡수 재료에 의해 흡수될 수 있으며, 이산화 염소는 상기 멤브레인을 통해 상기 배기가스 및 폐기물 챔버로부터 주변 대기로 나갈 수 있다. 상기 시스템은 상기 마이크로컨트롤러 또는 마이크로프로세서에 전기적으로 연결되 고 통풍관을 통해 상기 입구에 유체적으로 연결된 공기 펌프를 포함할 수 있다. 상기 마이크로컨트롤러 또는 마 이크로프로세서는 시스템 성능을 변경하도록 머신 러닝 알고리즘에 의해 제어되는 것을 특징으로 한다. 상기 마 이크로컨트롤러 또는 마이크로프로세서는 시스템 성능을 변경하도록 인공지능 알고리즘에 의해 제어될 수 있다. 상기 마이크로컨트롤러 또는 마이크로프로세서는 시스템 성능을 자동으로 변경할 수 있다. 상기 마이크로컨트롤 러 또는 마이크로프로세서는 시스템 성능을 사용자 제어에 의해 변경할 수 있다. 상기 마이크로컨트롤러 또는 마이크로프로세서는 시스템 성능을: 상기 시스템이 있는 주변 공기 내의 바이러스의 검출; 상기 시스템이 있는 주변 공기 내의 박테리아의 검출; 상기 시스템의 고도; 상기 시스템의 온도; 주변 공기 내의 이산화 염소의 농 도에서의 변화에 의해 측정된 주변 공기 의 변화; 상기 시스템이 있는 영역의 생물에 의한 사용의 변화; 사용자 의 선호에 대한 변경; 상기 시스템이 있는 영역의 생물에 의한 사용 및 공실의 주기의 예측; 및 상기 시스템의 정상적 또는 비정상적 성능의 진단; 중 적어도 하나에 기반하여 변경할 수 있다.이산화 염소를 생성하고 모니터링하기 위한 시스템의 네트워크가 제공되며, 상기 시스템의 네트워크는: 이산화 염소를 생성하고 모니터링(monitoring)하기 위한 복수의 시스템을 포함하며, 상기 복수의 시스템은: 입구를 포 함하는 장치 하우징; 마이크로컨트롤러 또는 마이크로프로세서; 시약을 담은 시약 컨테이너; 상기 시약으로부터 이산화 염소를 생성하기 위한 장치; 및 감지 시스템; 을 포함하며, 상기 마이크로컨트롤러는 상기 복수의 시스 템 사이의 통신이 가능한 통신 장치를 포함하며, 상기 통신 장치는 각 시스템의 마이크로컨트롤러의 분산 제어 를 설정하고, 상기 마이크로컨트롤러는 시스템 성능을 변경하도록 머신 러닝 알고리즘에 의해 제어되는 것을 특 징으로 한다. 상기 분산 제어는: 특정된 공간 내에서 각 개별적 센서의 위치에서의 이산화 염소의 균일한 또는 고의적으로 불균일한 분포를 달성하도록 개별적 시스템을 조정하는 것; 이산화 염소의 소모; 낮 및/또는 밤 생 성 주기의 제어; 시간, 3차원 용적, 계절적 변화에 걸친 패턴을 감지하도록 상기 감지 시스템을 사용하는 것; 측정된 신호에 추론되거나 추적된 패턴을 발송하는 것; 및 별개의 공간에 걸쳐 설치된 상기 시스템의 네트워크 에 걸친 이산화 염소 농도에서 관찰된 변화에 직접적으로 추적가능한 패턴을 감지하는 것; 중 적어도 하나를 포 함할 수 있다. 이산화 염소 농축액을 생성하고 모니터링하기 위한 시스템의 네트워크가 제공되며, 상기 시스템의 네트워크는: 이산화 염소를 생성하고 모니터링(monitoring)하기 위한 복수의 시스템을 포함하며, 상기 복수의 시스템은: 입 구를 포함하는 장치 하우징; 마이크로컨트롤러 또는 마이크로프로세서; 시약을 담은 시약 컨테이너; 상기 시약 으로부터 이산화 염소를 생성하기 위한 장치; 및 감지 시스템;을 포함하며, 상기 마이크로컨트롤러는 상기 복수 의 시스템 사이의 통신이 가능한 통신 장치를 포함하며, 상기 통신 장치는 각 시스템의 마이크로컨트롤러의 분 산 제어를 설정하고, 상기 마이크로컨트롤러는 시스템 성능을 변경하도록 인공지능 알고리즘에 의해 제어되는 것을 특징으로 한다. 상기 분산 제어는: 특정된 공간 내에서 각 개별적 센서의 위치에서의 이산화 염소의 균일 한 또는 고의적으로 불균일한 분포를 달성하도록 개별적 시스템을 조정하는 것; 이산화 염소의 소모; 낮 및/또 는 밤 생성 주기의 제어; 시간, 3차원 용적, 계절적 변화에 걸친 패턴을 감지하도록 상기 감지 시스템을 사용하 는 것; 측정된 신호에 추론되거나 추적된 패턴을 발송하는 것; 및 별개의 공간에 걸쳐 설치된 상기 시스템의 네 트워크에 걸친 이산화 염소 농도에서 관찰된 변화에 직접적으로 추적가능한 패턴을 감지하는 것; 중 적어도 하 나를 포함할 수 있다. 도 61a 및 도 61b는 예시적인 항균 가스 생성기를 도시한다. 생성기는 공기/전구체 유입구를 갖는 반응 챔버, 및 선택적으로 자외선 유입구를 포함한다. 자외선 유입구는 중공 튜브 에 작동 가능하게 연결될 수 있고, 따라서 자외선이 반응 챔버 내로 이동하도록 허용할 수 있다. 중공 튜브는 증발 폐기물 트랩의 상부로 연장되는 역 \"U\" 형상의 곡선 부분을 포함한다. 증 발 폐기물 트랩은 친수성 멤브레인(6116 등)을 포함하는 항균 배출구를 포함한다. 일 태양에서, 생성기는 광자 활성화 항균 물질 생성기일 수 있다. 생성기는 자외선을 사용하여 반 응 챔버 내에서 하나, 둘 또는 그 이상의 전구체(예를 들어, 액체 전구체)를 활성화할 수 있다. 빛은 255nm를 중심으로 하는 UV-C 파장일 수 있으며, 이는 염소산염(NaClO2)의 나트륨 원자를 절단하여 중공 튜브 를 통해, 증발 폐기물 트랩으로, 멤브레인을 통해, 항균 배출구를 통해 처리 중인 용 적 내로 이산화 염소(ClO2) 를 방출하는 것으로 알려져 있다. 설명된 UV-C 빛의 파장은 또한 염소 가스로 환원되는 과정에서 이산화 염소(ClO2) 가스를 중간 종으로 환원시키 는 것으로 알려져 있다. 따라서 NaClO2 가 UV-C 광선에 노출되는 시간은 제한적이다. NaClO2 는 액체 형태로 반응 챔버에 도입된다. UV-C의 물 속 침투 깊이는 매우 작다. 따라서, 생성기 는 건조된 염이 자외선을 차단하지 않는다고 가정할 때, \"신선한 표면\"이 증발 과정 전체에 노출되는 방 식으로 반응실 내의 아염소산 나트륨을 포함하는 물의 증발을 유발하여 해당 용적의 물에서 모든 아염소 산 나트륨을 노출시킨다는 목표를 달성한다. 사용자가 생성기가 소량의 이산화 염소(ClO2)만 생성하기를 기대한다는 점을 고려하면, 전구체의 벌크 용액을 제어하려고 시도하면 복잡한 막이나 기계 없이 용액 상태인 염소산나트륨의 반응을 방해하는 잔류물을 처리하거나 용량을 제어할 수 없다는 점에 유의해야 한다. 따라서, 생성기는 진동 분무 또는 분무를 사용하여 원하는 주파수의 UV 소스를 지나 가스 흐름 스트림으로 배출될 때 매우 적은 양의 액체로부터 매우 균일하고 크기가 제한된 액적 패턴을 생성함으로써 대기와 염소산 나트륨 수용액을 포함하는 액적 사이의 계속 줄어드는 경계층에 신선한 염소산 나트륨이 노출되도록 한다. 증발하는 액 적으로 정의된 액체의 용적에 아염소산나트륨을 제공하면 용액의 모든 아 염소산나트륨이 수용액에 있는 동안UV/UV-C에 노출되도록 할 수 있으므로 NaClO2 에서 이산화 염소(ClO2)로 변환할 수 있다. 생성기는 또한 분무화되거나 액적으로 원자화될 수 있는 전구체 액체에 대한 자외선 또는 다른 파장의 빛의 총 선량 동역학을 제어할 수 있다. 중공 튜브 내로 흐르는 가스(입구)로 유입되어 출구(611 4)로 빠져나감)는 출구로부터 분무된 항균 물질의 흐름을 유도한다. 이 흐르는 \"피복 가스\"는 룸의 대기 로서, 중공 튜브의 훨씬 더 큰 직경의 자외선 노출 부분(예를 들어, 자외선 입구와 반응실 사이의 부분)에서의 유속을 쉽게 계산할 수 있는 알려진 양으로 반응실 내의 포트(입구와 동일하거 나 다를 수 있음)로 펌핑된다. 중공 튜브는 분무된 액적이 시스 가스와 만나는 직경이 훨씬 더 클 수 있 으며, 이는 가스 시스 에어 펌프 속도를 증가시키거나 감소시킴으로써 흐르는 가스와 수성 염소산 나트륨 액적 의 결합된 스트림의 속도를 간단히 제어할 수 있게 할 수 있다. 이 결합된 스트림의 속도를 제어하면 자외선 유 입구에서(예: LED 전구를 통해) 동시에 이동 및 증발하는 액적에 0.1초에서 5.0초 동안 제공되는 고집적 UV-C 광선에 노출되는 길이를 제어할 수 있다. 피복 가스로 펌핑되는 가스의 양, 장치 기하학적 구조의 직경 및 /또는 이러한 유형의 변수의 조합을 변경하면 작은 액적의 증발 물리학에 의해 전구체 물질로 지속적으로 새로 워지는 진화하는 UV-C 및 수용액 계면 경계에 대한 비행 시간 노출 범위를 훨씬 더 넓힐 수 있다. 다른 태양에서, 가스 생성기는 전기 화학 생성기다. 이 실시예에서, 자외선 유입구는 제거되고, 전 기 화학 생성기 셀은 반응실 내부에 배향된다. 전기 화학 생성기 셀은 반응실의 입구 측에 인접한 전극 어레이를 포함하며, 반응실은 메쉬 분무기를 더 포함한다. 각 태양에서, 생성기는 분무화된 항균 액적을 생성하고 항균을 폐기물로부터 분리한다. 즉, 분무된 항균 물질은 멤브레인 및 배출구를 통해 증발 폐기물 트랩을 빠져나가고, 폐기물은 멤브레인 을 통과하지 못하고 대신 증발 폐기물 트랩의 바닥으로 떨어진다. 생성기는 액적의 증발을 추가로 사용하여 폐기물 용적을 최소화한다. 비행 중 액체 액적의 증발은 작은 기체 분자에 대한 투과성이 높은 소수성 작은 기공 막(막 )과 같은 분리 기기와 결합하여 고체 폐기물(및 /또는 일부 액적이 크기, 액적의 응집 또는 기타 원인으로 인해 완전히 증발하지 않는 경우 액체 폐기물)을 분 리할 수 있다. 본 명세서 또는 청구범위에서 용어 \"포함한다\" 또는 \"포함하는(including)\"이 사용되는 한, 그것은, 용어 \"포함 하는(comprising)\"과, 그 용어가 청구범위에서 이행 단어로서 채용될 때 해석되는 바와 같이, 유사한 방식으로 포함적이도록 의도된다. 더욱, 용어 \"또는\"(예를 들면, A 또는 B)이 채용되는 한, 그것은 \"A 또는 B 또는 양 자\"를 의미하도록 의도된다. 출원인이 \"양자가 아니라 A 또는 B만\"을 나타내려고 의도할 때, 그때는 용어 \"양자 가 아니라 A 또는 B만\"이 채용될 것이다. 그리하여, 여기서 용어 \"또는\"의 사용은 배타적이 아니라 포함적인 사 용이다. Bryan A. Garner의 A Dictionary of Modern Legal Usage 624(제2판, 1995년)를 참조하라. 또한, 본 명 세서 또는 청구범위에서 용어 \"에\" 또는 \"내에\"가 사용되는 한, 그것은 부가적으로 \"상에\" 또는 \"상으로\"를 의 미하도록 의도된다. 본 명세서 또는 청구범위에서 용어 \"실질적으로\"가 사용되는 한, 그것은 제조시 상식적이거 나 이용가능한 정밀도의 정도를 고려하도록 의도된다. 본 명세서 또는 청구범위에서 용어 \"선택적으로\"가 사용 되는한, 그것은 장치의 사용자가 장치의 사용시 필요 또는 소망에 따라 컴포넌트의 기능 또는 특징을 활성화 또 는 비활성화할 수 있는 컴포넌트의 조건을 지칭하도록 의도된다. 본 명세서 또는 청구범위에서 용어 \"작동가능 하게 연결\"이 사용되는 한, 그것은 식별된 컴포넌트가 지정된 기능을 수행하는 방식으로 연결됨을 의미하도록 의도된 다. 본 명세서 및 청구범위에서 사용될 때, 단수형 부정관사 및 정관사는 복수형을 포함한다. 마지막으 로, 용어 \"약\"이 수와 함께 사용되는 경우, 그것은 그 수의 ±10%를 포함하도록 의도된다. 환언하면, \"약 10\"은 9 내지 11을 의미할 수 있다. 위에서 서술된 바와 같이, 본 출원이 그 실시형태의 설명에 의해 예시되었지만, 그리고 그 실시형태가 상당히 상세히 설명되었지만, 그것은 첨부된 청구범위의 범위를 그러한 상세로 제한하거나 어느 방식으로 한정하려는 출원인의 의도는 아니다. 부가적 이점 및 수정은 본 출원이 유익한 당업자에게는 쉽게 떠오를 것이다. 그래서, 본 출원은, 그 더 넓은 태양에서, 특정 상세, 도시된 예시적 예, 또는 지칭된 어떠한 장치로도 한정되지 않는다. 본 발명의 일반적 개념의 취지 또는 범위로부터 벗어남이 없이 그러한 상세, 예, 및 장치로부터의 이탈 이 이루어질 수 있다.도면 도면1a 도면1b 도면1c 도면2a 도면2b 도면2c 도면2d 도면2e 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18a 도면18b 도면18c 도면18d 도면19a 도면19b 도면19c 도면19d 도면19e 도면19f 도면19g 도면19h 도면19i 도면20a 도면20b 도면20c 도면20d 도면21a 도면21b 도면21c 도면21d 도면21e 도면22a 도면22b 도면22c 도면22d 도면22e 도면23a 도면23b 도면23c 도면23d 도면23e 도면23f 도면23g 도면24 도면25a 도면25b 도면25c 도면26a 도면26b 도면27a 도면27b 도면28a 도면28b 도면29a 도면29b 도면30a 도면30b 도면31 도면32a 도면32b 도면32c 도면32d 도면32e 도면33a 도면33b 도면33c 도면33d 도면34 도면35a 도면35b 도면36 도면37 도면38a 도면38b 도면39a 도면39b 도면39c 도면40 도면41a 도면41b 도면42 도면43 도면44 도면45 도면46 도면47 도면48 도면49 도면50 도면51a 도면51b 도면52a 도면52b 도면53a 도면53b 도면54a 도면54b 도면54c 도면55a 도면55b 도면56 도면57 도면58 도면59 도면60 도면61a 도면61b"}
{"patent_id": "10-2024-7000443", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 항균성 가스를 생성하고 모니터링하기 위한 예시적 시스템의 개략도를 도시한다. 도 1b는 처리중에 있는 용적 내에 배향된 시스템의 개략도를 도시한다. 도 1c는 처리중에 있는 용적 내에 배향된 시스템의 개략도를 도시한다. 도 2a는 항균성 가스를 생성하고 모니터링하기 위한 예시적 상호보완적인 센서 서브 시스템 및 생성 서브 시스템의 개략도를 도시한다. 도 2b는 처리중에 있는 용적 내의 센서 서브 시스템 및 생성 서브 시스템의 개략도를 도시한다. 도 2c는 HVAC 시스템과 함께 사용되는 센서 서브 시스템 및 생성 서브 시스템의 개략도를 도시한다. 도 2d는 처리중에 있는 용적의 외부에 있는 생성 서브 시스템과 연동되는 처리중에 있는 상기 용적 내의 센서 서브 시스템의 개략도를 도시한다. 도 2e는 처리중에 있는 용적의 외부에 있는 센서 서브 시스템과 연동되는 처리중에 있는 상기 용적 내의 생성 서브 시스템의 개략도를 도시한다. 도 3는 항균성 가스를 생성하고 모니터링하기 위한 예시적 시스템의 개략도를 도시한다. 도 4는 항균성 가스를 생성하고 모니터링하기 위한 예시적 시스템의 개략도를 도시한다. 도 5는 빌딩의 바닥 내의 실내와 공간 내에 분산된 센서와 항균 가스 시스템의 네트워크의 예시적 설 계도를 도시한다. 도 6는 항균성 가스를 생성하고 모니터링하기 위한 예시적 시스템의 개략도를 도시한다. 도 7은 항균성 가스를 생성하고 모니터링하기 위한 예시적 시스템의 개략도를 도시한다. 도 8은 밀봉된 환경 내에서 항균성 증기를 그 안의 물품을 살균하기 위해 생성하는 시스템의 컷어웨 이 사시도를 도시한다. 도 9는 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 10은 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 11은 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 12는 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 13는 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 14는 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 15는 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 16는 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 17는 항균성 가스 및/또는 용액의 생성을 위한 시스템을 도시한다. 도 18a는 항균성 가스를 생성하기 위한 리액터의 평면도를 도시한다. 도 18b는 항균성 가스를 생성하기 위한 리액터의 정면 사시도를 도시한다. 도 18c는 항균성 가스를 생성하기 위한 리액터의 상면 사시도를 도시한다. 도 18d는 항균성 가스를 생성하기 위한 리액터의 정면 사시도를 도시한다. 도 19a는 항균성 가스를 생성하기 위한 리액터의 측면 사시도를 도시한다. 도 19b는 항균성 가스를 생성하기 위한 리액터의 측면 입면도를 도시한다. 도 19c는 항균성 가스를 생성하기 위한 리액터의 평면도를 도시한다. 도 19d는 항균성 가스를 생성하기 위한 리액터의 분해 측면 사시도를 도시한다. 도 19e는 항균성 가스를 생성하기 위한 리액터의 분해 정면 사시도를 도시한다. 도 19f는 항균성 가스를 생성하기 위한 리액터의 정면 사시도를 도시한다. 도 19g는 항균성 가스를 생성하기 위한 리액터의 후면 사시도를 도시한다. 도 19h는 제1 위치에 있는 리액터 입력 기기의 측면 사시도를 도시한다. 도 19i는 제2 위치에 있는 리액터 입력 기기의 측면 사시도를 도시한다. 도 20a는 항균성 가스를 생성하기 위한 리액터의 평면도를 도시한다. 도 20b는 항균성 가스를 생성하기 위한 리액터의 정면 사시도를 도시한다. 도 20c는 항균성 가스를 생성하기 위한 리액터의 상면 사시도를 도시한다. 도 20d는 항균성 가스를 생성하기 위한 리액터의 정면 사시도를 도시한다. 도 21a는 항균성 가스를 생성하기 위한 리액터의 평면도를 도시한다.도 21b는 항균성 가스를 생성하기 위한 리액터의 상면 사시도를 도시한다. 도 21c는 항균성 가스를 생성하기 위한 리액터의 후면 사시도를 도시한다. 도 21d는 항균성 가스를 생성하기 위한 리액터의 상면 사시도를 도시한다. 도 21e는 항균성 가스를 생성하기 위한 리액터의 후면 사시도를 도시한다. 도 22a는 항균성 가스를 생성하기 위한 리액터의 평면도를 도시한다. 도 22b는 항균성 가스를 생성하기 위한 리액터의 상면 사시도를 도시한다. 도 22c는 항균성 가스를 생성하기 위한 리액터의 후면 사시도를 도시한다. 도 22d는 항균성 가스를 생성하기 위한 리액터의 후면 사시도를 도시한다. 도 22e는 항균성 가스를 생성하기 위한 리액터의 정면 사시도를 도시한다. 도 23a는 예시적 항균성 가스 생성기의 단면도를 도시한다. 도 23b는 항균성 가스 생성기의 부분 단면도를 도시한다. 도 23c는 항균성 가스 생성기의 단면도를 도시한다. 도 23d는 항균성 가스 생성기의 부분 단면도를 도시한다. 도 23e는 항균성 가스 생성기의 단면도를 도시한다. 도 23f는 항균성 가스 생성기의 부분 단면도를 도시한다. 도 23g는 항균성 가스 생성기의 부분 단면도를 도시한다. 도 24는 예시적 항균성 가스 생성기의 단면도를 도시한다. 도 25a는 예시적 항균성 가스 생성기와 센서 장치의 입면도를 도시한다. 도 25b는 항균성 가스 생성기와 센서 장치의 사시도를 도시한다. 도 25c는 항균성 가스 생성기와 센서 장치의 단면도를 도시한다. 도 26a는 예시적 항균성 가스 생성기와 센서 장치의 사시도를 도시한다. 도 26b는 항균성 가스 생성기와 센서 장치의 단면도를 도시한다. 도 27a는 예시적 항균성 가스 생성기와 센서 장치의 입면도를 도시한다. 도 27b는 항균성 가스 생성기와 센서 장치의 사시도를 도시한다. 도 28a는 예시적 휴대용 항균성 가스 리액터의 입면도를 도시한다. 도 28b는 휴대용 항균성 가스 리액터의 개략도를 도시한다. 도 29a는 예시적 패키징된 항균성 가스 생성기 용액 및 패키징된 활성제 용액의 평면도를 도시한다. 도 29b는 패키징된 항균성 가스 생성기 용액 및 패키징된 활성제 용액의 단면도를 도시한다. 도 30a는 카드 모양 또는 시트의 형태의 항균성 가스 생성기의 예시의 입면도를 도시한다. 도 30b는 항균 물질 생성 화합물을 포함하는 항균성 가스 생성기의 예시를 도시한다. 도 31은 선택적으로 내부에 물이 추가된 파우치의 형태의 항균물질 생성기의 예시를 도시한다. 도 32a는 용액 처리된 단일 또는 여러 더미의 다공성 물질인 형태의 항균 물질 생성기의 예시를 도시한다. 도 32b는 배출을 제어하도록 외부 멤브레인이 선택적으로 추가된 다공성 매트릭스 물질과 섞이고 기질에 흡수되 거나 흡착된 액체 반응물을 갖는 항균 물질 생성기의 예시를 도시한다. 도 32c는 다공성 물질과 섞이고 배출을 제어하도록 외부 멤브레인이 선택적으로 추가된 고체 반응물을 갖는 항균 물질 생성기의 예시를 도시한다. 도 32d는 구멍이 뚫린 파우치 형태의 항균 물질 생성기의 예시를 도시한다. 도 32e는 도32a-도32c의 반응물 재료가 나란히 구성되고 활성을 지원하고 배출을 제어하도록 선택적 재료를 갖 는 항균 물질 생성기의 예시를 도시한다. 도 33a는 방해된 침적관을 포함하는 에어로졸 용기의 컷어웨이 단면도를 도시한다. 도 33b는 침적관과 연동된 리액터(2100, 2200)를 포함하는 에어로졸 용기의 컷어웨이 단면도를 도 시한다. 도 33c는 침적관과 연동된 리액터를 포함하는 에어로졸 용기의 컷어웨이 단면도를 도시한다. 도 33d는 침적관과 연동된 리액터를 포함하는 에어로졸 용기의 컷어웨이 단면도를 도시한다. 도 34는 침적관에 연결된 가요성 블래더(bladder, 3492)를 포함하는 에어로졸 용기의 컷어웨이 단 면도를 도시한다. 도 35a는 복수의 가요성 블래더를 포함하는 에어로졸 용기의 컷어웨이 단면도를 도시한다. 도 35b는 복수의 가요성 블래더를 포함하는 에어로졸 용기의 컷어웨이 단면도를 도시한다. 도 36은 밀봉된 환경 외부에 항균성 가스 또는 증기를 그 안의 물품을 살균하기 위해 생성하는 기구의 개 략 다이어그램을 도시한다. 도 37은 밀봉된 환경 외부에 항균성 가스 또는 증기를 그 안의 물품을 살균하기 위해 생성하는 시스템의 개략적 다이어그램을 도시한다. 도 38a는 밀봉된 환경 내의 물품을 살균하기 위해 밀봉된 환경 내에서 항균성 가스 또는 증기를 생성하는 시스 템의 개략적 다이어그램을 도시한다. 도 38b는 밀봉된 환경 내의 항목을 살균하기 위해 밀봉된 환경 내에서 항균성 가스 또는 증기를 생성하는 기구 의 개략적 다이어그램을 도시한다. 도 39a는 밀봉된 환경 내에서 항균성 증기를 그 안의 물품을 살균하기 위해 생성하는 하나의 기구를 도시 한다. 도 39b는 밀봉된 환경 내에서 항균성 증기를 그 안의 물품을 살균하기 위해 생성하는 기구를 도시한다. 도 39c는 밀봉된 환경 내에서 항균성 증기를 그 안의 물품을 살균하기 위해 생성하는 기구를 도시한다. 도 40은 밀봉된 환경 내의 물품을 살균하기 위해 항균성 가스 또는 증기를 상기 밀봉된 환경 내에 또는 상기 밀 봉된 환경 외부에 생성하는 방법을 도시한다. 도 41a는 조절된 샘플에 대한 이산화 염소 효능 테스트 데이터를 도시한다. 도 41b는 조절된 샘플에 대한 이산화 염소 효능 테스트 데이터를 도시한다. 도 42는 3차원 공간에서 물품을 살균하기 위해 항균성 가스 또는 증기를 생성하는 기구의 예시를 도시한 다. 도 43은 3차원 공간에서 물품을 살균하기 위해 항균성 가스 또는 증기를 생성하는 기구의 예시를 도시한 다. 도 44는 항균성 가스를 생성하도록 도 43에서 기구의 사용을 위한 예시적 절차를 도시한다. 도 45는 수중과 공기 중에서 이산화 염소 가스의 용해도에 미치는 온도의 영향과 정의된 룸의 크기에 대한 이산 화 염소 가스의 양을 나타내는 표를 도시한다. 도 46은 실내에서 분산되는 이산화 염소 가스 농도의 균일성을 도시한다. 도 47은 가구가 있는 실내에서 가스 농도 프로필을 도시한다. 도 48은 상대적 습도와 이산화 염소 용액으로부터 생성된 이산화 염소 가스 농도를 도시한다.도 49는 살균 효능에서의 증가와 상승된 습도의 상관관계를 도시한다. 도 50은 항균성 가스를 생성하고 상기 가스를 기구를 통해 분산시키는 방법을 도시한다. 도 51a는 이산화 염소 대 공기의 0.1ppm의 타겟 농도를 위한 평형까지의 시간(분)을 도시한다. 도 51b는 시간(분)에 걸친 다섯 개의 포트에서 측정된 농도(이산화 염소 대 공기의 ppm)를 도시한다. 도 52a는 이산화 염소 대 공기의 350ppm의 타겟 농도를 위한 평형까지의 시간(분)을 도시한다. 도 52b는 시간(분)에 걸친 12개의 포트에서 측정된 농도(이산화 염소 대 공기의 ppm)를 도시한다. 도 53a는 적은 용적의 고농축 액체 전구체로부터 이산화 염소 증기를 생성하는 하나의 예시적 시스템의 다이어그램을 도시한다. 도 53b는 적은 용적의 고농축 액체 전구체로부터 이산화 염소 증기를 생성하는 예시적 시스템의 다이어그 램을 도시한다. 도 54a는 시스템 또는 유사한 복수의 시스템을 사용하는 이산화 염소 생성의 결과를 도시한다. 도 54b는 시스템 또는 유사한 복수의 시스템을 사용하는 이산화 염소 생성의 결과를 도시한다. 도 54c는 시스템 또는 유사한 복수의 시스템을 사용하는 이산화 염소 생성에 대한 요구사항을 도시한다. 도 55a는 0.11 ± 0.04 ppmv의 범위에서 수행되는 유기체당 복제 테스트로부터 평균 D-값(시간)을 도시한다. 도 55b는 5.3 ± 2.4 ppmv의 범위에서 수행되는 유기체당 복제 테스트로부터 평균 D-값(시간)을 도시한다. 도 56은 다양한 작동 모드를 위한 예시적 시스템의 다이어그램을 도시한다. 도 57은 제어 서브 시스템을 도시한다. 도 58은 항균성 가스를 생성하기 위한 리액터를 도시한다. 도 59는 항균성 가스의 농도 대 항균 가스 시스템 및 장치의 시뮬레이션된 작동에 대한 시간의 그래프를 도시한 다. 도 60은 공기 중의 항균성 가스의 목표 농도를 유지하기 위한 폐 루프 시스템의 개략도를 도시한다. 도 61a는 예시적 항균성 가스 생성기의 사시도를 도시한다. 도 61b는 예시적 항균성 가스 생성기의 단면도를 도시한다."}
