{"patent_id": "10-2023-0105063", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0023839", "출원번호": "10-2023-0105063", "발명의 명칭": "친환경 차량의 주행거리 비례형 탄소배출권 관리장치 및 그 장치의 구동방법", "출원인": "이광희", "발명자": "이광희"}}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전기 에너지를 동력원으로 하는 화물차의 주행거리에 관련되는 탄소감축 데이터를 수집하는 통신 인터페이스부;및상기 수집한 탄소감축 데이터를 분석하여 전기 화물차의 배출원 단위에 근거한 주행거리별 온실가스 감축량을산정하고, 상기 산정한 감축량을 볼록체인 기술을 적용해 디지털 자산의 소유주를 증명하는 대체 불가능한 토큰(NFT)의 형태로 탄소 배출권을 발행하는 제어부;를포함하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 온실가스 감축량을 산정하기 위하여 감축원 단위 0.2716kgCO2eq/km × 자동차 운행거리(km)의 관계식을 적용하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 통신 인터페이스부는, 상기 화물차를 생산하는 완성차 업체의 서버에 API(Application Program Interface)연동하여 상기 주행거리에 관련되는 탄소감축 데이터를 수집하는, 친환경 차량의 주행거리 비례형 탄소배출권관리장치."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는, 탄소 배출권 시세 정보의 공공데이터를 활용하여 상기 산정한 온실가스 감축량에 대한 탄소 배출권 수익을 산정하고, 상기 산정한 수익이 반영되는 탄소 배출권을 발행하여 온라인 또는 오프라인 마켓에서거래시키는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어부는, 지정된 주행거리마다 상기 탄소 배출권을 발행할 때 중복발행 여부를 검토하여 검토 결과를 근거로 탄소 배출권을 발행하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "통신 인터페이스부가, 전기 에너지를 동력원으로 하는 화물차의 주행거리에 관련되는 탄소감축 데이터를 수집하는 단계; 및제어부가, 상기 수집한 탄소감축 데이터를 분석하여 전기 화물차의 배출원 단위에 근거한 주행거리별 온실가스감축량을 산정하고, 상기 산정한 감축량을 대체 불가능한 토큰(NFT)의 형태로 탄소 배출권을 발행하는 단계;를포함하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치의 구동방법."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 발행하는 단계는,공개특허 10-2025-0023839-3-상기 온실가스 감축량을 산정하기 위하여 감축원 단위 0.2716kgCO2eq/km × 자동차 운행거리(km)의 관계식을 적용하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치의 구동방법."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 발행하는 단계는, 상기 화물차를 생산하는 완성차 업체의 서버에 API 연동하여 상기 주행거리에 관련되는 탄소감축 데이터를 수집하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치의 구동방법."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,탄소 배출권 시세 정보의 공공데이터를 활용하여 상기 산정한 온실가스 감축량에 대한 탄소 배출권 수익을 산정하고, 상기 산정한 수익이 반영되는 탄소 배출권을 발행하여 온라인 또는 오프라인 마켓에서 거래시키는 단계;를 더 포함하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치의 구동방법."}
{"patent_id": "10-2023-0105063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 발행하는 단계는,지정된 주행거리마다 상기 탄소 배출권을 발행할 때 중복발행 여부를 검토하여 검토 결과를 근거로 탄소 배출권을 발행하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치의 구동방법."}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "친환경 차량의 주행거리 비례형 탄소배출권 관리장치 및 그 장치의 구동방법이 개시된다. 본 발명의 일 실시예에 따른 친환경 차량의 주행거리 비례형 탄소배출권 관리장치는, 전기 에너지를 동력원으로 하는 화물차의 주행거리 에 관련되는 탄소감축 데이터를 수집하는 통신 인터페이스부, 및 수집한 탄소감축 데이터를 분석하여 전기 화물 차의 배출원 단위에 근거한 주행거리별 온실가스 감축량을 산정하고, 산정한 감축량을 볼록체인 기술을 적용해 디지털 자산의 소유주를 증명하는 가상 토큰(NFT)의 형태로 탄소 배출권을 발행하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 친환경 차량의 주행거리 비례형 탄소배출권 관리장치 및 그 장치의 구동방법에 관한 것으로서, 더 상 세하게는 가령 전기차나 수소차량의 주행거리에 비례하여 자발적으로 탄소 배출권 수익을 예측하고 그 수익 예 측에 따른 탄소 배출권을 발행하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리장치 및 그 장치의 구동방 법에 관한 것이다."}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "탄소배출권은 일정기간 동안 이산화탄소 등 온실가스의 일정량을 배출할 수 있는 권리이다. 기후변화협약에 따 른 온실가스 감축목표에 관한 교토의정서는 회원국에게 온실가스의 감축의무를 부과하고 있다. 전기 자동차는 화석 연료의 연소가 아닌 전기 에너지로부터 동력을 얻기 때문에 배기가스가 전혀 없어 공해문제를 유발하지 않 는 장점을 가지고 있으므로, 지구온난화 방지책의 일환으로 각국에서는 기존의 내연기관 자동차보다 탄소 배출 량이 적은 친환경 전기 자동차를 개발하고 보급하기 위한 노력을 하고 있다. 이에 따라서, 전기 자동차 보급을 확대하기 위해 전기 자동차 사용자들에게 온실가스 감축에 따른 혜택을 주기 위한 기술들이 개발되고 있다. 종래에는 전기 자동차 보급을 확대하기 위해 전기 자동차 사용자들에게 온실가스 감축에 따른 혜택을 주기 위한 기술들이 개발되고 있으며, 전기 자동차 충전량에 기반하여 탄소 배출권을 생성하고 보상 서비스를 제공하는 기 술이 공개된 바 있다. 그러나, 이러한 종래기술은 각 사용자(운행자)의 전기 충전량에 따른 개별적인 탄소 배출권을 자체적으로 생성 하고 있으며, 각 사용자의 상황이나 환경을 고려하지 않고 전기 자동차에 충전되는 충전량을 단순히 그와 동급 의 내연기관 자동차가 주행할 때 발생되는 탄소 배출량에 대응하여 산정하므로 탄소 배출 감축량을 합리적으로 산정하지 못하고 있으며, 실제 탄소 배출권 확보 및 이를 통해 전기 자동차 사용자에게 혜택을 제공하는 데 있 어 현실과 맞지 않은 문제가 있다. 선행기술문헌특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2023-0010483호(2023.01.19) (특허문헌 0002) 한국등록특허공보 제10-2177908호(2020.11.06)"}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 가령 전기차나 수소차량의 주행거리에 비례하여 자발적으로 탄소 배출권 수 익을 예측하고 그 수익 예측에 따른 탄소 배출권을 발행하는, 친환경 차량의 주행거리 비례형 탄소배출권 관리 장치 및 그 장치의 구동방법을 제공하는 것이다. 본 발명의 과제들은 이상에서 언급한 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 본 발명의 일 실시예에 따른 친환경 차량의 주행거리 비례형 탄소배출권 관리장치는, 전기 에너지를 동력원으로 하는 화물차의 주행거리에 관련되는 탄소감축 데이터를 수집하는 통신 인터페이스부, 및 상기 수집한 탄소감축 데이터를 분석하여 전기 화물차의 배출원 단위에 근거한 주행거리별 온 실가스 감축량을 산정하고, 상기 산정한 감축량을 볼록체인 기술을 적용해 디지털 자산의 소유주를 증명하는 가 상 토큰(NFT)의 형태로 탄소 배출권을 발행하는 제어부를 포함한다. 상기 제어부는, 상기 온실가스 감축량을 산정하기 위하여 감축원 단위 0.2716kgCO2eq/km × 자동차 운행거리 (km)의 관계식을 적용할 수 있다. 상기 통신 인터페이스부는, 상기 화물차를 생산하는 완성차 업체의 서버에 API(Application Program Interface) 연동하여 상기 주행거리에 관련되는 탄소감축 데이터를 수집할 수 있다. 상기 제어부는, 탄소 배출권 시세 정보의 공공데이터를 활용하여 상기 산정한 온실가스 감축량에 대한 탄소 배 출권 수익을 산정하고, 상기 산정한 수익이 반영되는 탄소 배출권을 발행하여 온라인 또는 오프라인 마켓에서 거래시킬 수 있다. 상기 제어부는, 지정된 주행거리마다 상기 탄소 배출권을 발행할 때 중복발행 여부를 검토하여 검토 결과를 근 거로 탄소 배출권을 발행할 수 있다. 상기 과제를 해결하기 위한 본 발명의 일 실시예에 따른 친환경 차량의 주행거리 비례형 탄소배출권 관리장치의 구동방법은, 통신 인터페이스부가 전기 에너지를 동력원으로 하는 화물차의 주행거리에 관련되는 탄소감축 데이 터를 수집하는 단계, 및 제어부가 상기 수집한 탄소감축 데이터를 분석하여 전기 화물차의 배출원 단위에 근거 한 주행거리별 온실가스 감축량을 산정하고, 상기 산정한 감축량을 가상 토큰(NFT)의 형태로 탄소 배출권을 발 행하는 단계를 포함한다. 상기 발행하는 단계는, 상기 온실가스 감축량을 산정하기 위하여 감축원 단위 0.2716kgCO2eq/km × 자동차 운행 거리(km)의 관계식을 적용할 수 있다. 상기 발행하는 단계는, 상기 화물차를 생산하는 완성차 업체의 서버에 API 연동하여 상기 주행거리에 관련되는 탄소감축 데이터를 수집할 수 있다. 상기 구동방법은, 탄소 배출권 시세 정보의 공공데이터를 활용하여 상기 산정한 온실가스 감축량에 대한 탄소 배출권 수익을 산정하고, 상기 산정한 수익이 반영되는 탄소 배출권을 발행하여 온라인 또는 오프라인 마켓에서 거래시키는 단계를 더 포함할 수 있다. 상기 발행하는 단계는, 지정된 주행거리마다 상기 탄소 배출권을 발행할 때 중복발행 여부를 검토하여 검토 결 과를 근거로 탄소 배출권을 발행할 수 있다."}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 친환경 차량의 주행거리 비례형 탄소배출권 관리장치는, 수소·전기 화물차 운전자 의 경제적 부담 완화 및 처우를 개선하고, 자발적 탄소 시장 기반의 지속가능한 현금성 인센티브지급이 가능하 며, 수송부문 탄소중립의 탄력적 추진이 가능하고 수소·전기 화물차의 공익적 가치를 구체화할 수 있을 것이다. 또한 가령 하루 평균 60.3Km를 주행하는 전기차를 운행하는 택배기사들의 경우 본 발명의 실시예에 따른 서비스 에 참여시 16.37748kg의 탄소를 감축할 수 있으며, 이를 자발적 탄소 배출권으로 발행하여 전량 판매할 경우 약 163.7748원의 경제적 이익을 창출할 수 있을 것이다.(KOC22-24 배출권 종목의 2023년 8월 4일 종가 기준) 실시예들에 따른 효과는 이상에서 예시된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명세서 내에 포함되어 있다."}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는"}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 이하 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 친환경 차량의 주행거리 비례형 탄소배출권 관리 시스템을 나타내는 도면이며, 도 2는 도 1의 탄소배출권 관리장치의 핵심 서비스 프로세스를 설명하기 위한 도면이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 친환경 차량의 주행거리 비례형 탄소배출권 관리 시스템(이 하, 탄소배출권 관리 시스템)은 친환경 차량, 운전자 단말장치, 통신망, 탄소배출권 관리장 치 및 서드파티장치의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 서드파티장치와 같은 일부 구성요소가 생략되어 탄소배출권 관리 시스템이 구성되거나, 탄소배출권 관리장치를 구성하는 구성요소의 일부 또는 전부가 통신망 을 구성하는 네트워크장치(예: 무선교환장치 등)에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 친환경 차량은 수소차나 전기차 등을 포함할 수 있다. 또한 친환경 차량은 차종에 따라 전기승용차, 전기 화물차, 전기버스, 수소 승용차, 수소버스 등으로 구분될 수 있다. 수소차는 수소를 에너지로 사용하는 수 소연료전기차로 수소와 공기중의 산소를 반응시켜 전기를 얻어 전기모터가 운행하도록 하는 차량이다. 자동차 내부에 수소 저장 탱크가 수소와 공기중 산소가 만나 발생된 전기에너지를 저장해 전기발생장치로 보내게 된다. 연료전기 스택(stack)에서 산소 화학반응이 일어나 전기를 만들어 모터로 보내면 모터가 움직이면서 전기 에너 지를 운동에너지로 만들어 차량이 움직이게 되는 것이다. 전기차는 전기충전소를 통해 내부에 탑재되는 배터리 에 전기를 충전한 후 해당 배터리의 에너지를 이용해 주행하는 차량을 의미할 수 있다. 전기공급원으로부터 충 전받은 전기에너지를 동력원으로 사용하는 자동차이다. 물론 전기차도 전기 모터를 사용해 운동 에너지를 얻는다. 기존의 내연기관 차량의 경우도 마찬가지지만 본 발명의 실시예에 따른 친환경 차량은 내부에 OBD(On- Board Diagnostics) 시스템을 포함할 수 있다. OBD는 기관제어시스템에 집적되어 있는 법적으로 규정된 하위 진 단/감시 시스템이다. OBD는 전 운전영역에 걸쳐 배기가스 및 증발가스와 관련된 모든 시스템을 감시한다. 감시 하고 있는 시스템들에 고장이 발생할 경우, 고장내역은 ECU(Electronic Control Unit)에 저장되며 표준화된 인 터페이스(interface) 가령 16핀 진단 컨넥터를 통해 이를 조회할 수 있다. ECU는 자동차의 엔진, 자동변속기, ABS 등의 상태를 컴퓨터로 제어하는 전자제어 장치이다. 본 발명의 실시예에 따른 친환경 차량은 ECU의 제 어하에 이러한 OBD 데이터, 가령 차량 운행 데이터를 탄소감축 데이터로서 탄소배출권 관리장치나 서드파 티장치로 제공할 수 있는 것이다. ECU는 본 발명의 실시예에 따른 서비스를 제공하기 위하여 탄소배출권 관리장치나 서드파티장치의 원격 제어에 의해 펌웨어(firmware) 형태로 프로그램을 설치하는 것도 얼 마든지 가능할 수 있을 것이다. 이에 따라 지정된 방식에 따라 주기적으로 탄소감축 데이터를 전송해 줄 수 있 을 것이다. 본 발명의 실시예에 따른 친환경 차량은 주행 중에, 주행 전에 또는 주행을 완료하였을 때 사물인터넷 (IoT) 기반으로 주행과 관련한 데이터를 탄소배출권 관리장치나 서드파티장치로 전송해 줄 수 있다. 물론 이는 탄소배출권 관리장치나 서드파티장치에서 주기적으로 데이터를 요청하여 수신하는 것도 얼 마든지 가능하지만, 친환경 차량이 내부 프로그램을 통해 자체적으로 기설정된 방식에 따라 데이터를 전송 해 줄 수 있다. 예를 들어, 시동이 온(ON)된 후 오프(OFF)되는 경우 주행과 관련한 데이터를 먼저 전송한 후에 엔진을 정지시킬 수 있다. 또한, 하루의 운행을 모두 종료한 후에 데이터를 일괄 전송하는 것도 얼마든지 가능 할 수 있다. 다시 말해, 날짜를 기준으로 지정된 날짜에 전송할 수도 있는 것이다. 본 발명의 실시예에서는 통 신망의 데이터 트래픽 등을 종합적으로 고려해 볼 때, 물론 5G나 6G 통신망의 경우에는 트래픽을 크게 염 두에 둘 필요는 없을 수 있지만, 하루의 일과가 종료된 후 엔진이 장시간 정지되는 시점(예: 날짜가 변경되는 밤 12시 이전)을 판단하여 데이터를 전송하는 것이 바람직할 수 있다. 물론 본 발명의 실시예에서는 어느 하나 의 형태에 특별히 한정하지는 않을 것이다. 예를 들어, 최근에는 친환경 차량을 제조하는 많은 완성차 업체들은 차량의 고장이나 여러가지 요인들로 인해 커넥티드카 데이터를 활용하여 서비스와 상품 개발을 하고 있기 때문에 차량 제원/운행/주행거리/실태/운전습관 API 등을 통해 차량의 상태를 파악하거나 또는 운전자의 운전습관, 주행위치 등을 파악하여 다양한 서비스를 제 공하고 있다. 이러한 점에서 친환경 차량은 완성차 업체에서 운영하는 서버 등 도 1의 서드파티장치 로 운행 데이터를 실시간으로 또는 주기적으로 제공한다고 볼 수 있다. 물론 본 발명의 실시예에서는 완성차 업 체에서 차량 운행 데이터를 수집하지 않는 경우의 경우에는 도 1의 탄소배출권 관리장치에서 직접 수집하 는 것도 얼마든지 가능할 수 있으며, 또 운전자가 소지하는 스마트폰 등을 통해 해당 스마트폰을 통신중개장치 로 사용하여 이를 매개로 차량 운행 데이터를 탄소배출권 관리장치에서 직접 수집하는 것도 얼마든지 가능 할 수 있다. 따라서 본 발명의 실시예에 따른 친환경 차량은 다양한 형태로 차량의 주행거리와 관련한 데 이터를 수집 및 처리할 수 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 운전자 단말장치는 친환경 차량을 운전하는 사용자 즉 운전자들이 소지하는 스마트폰, 태블릿PC, 데 스크탑컴퓨터, 랩탑컴퓨터 등의 단말장치를 포함할 수 있다. 운전자 단말장치의 운전자는 자신이 운행하는 친환경 차량의 주행거리를 근거로 탄소 배출권을 타인에게 판매하여 그에 따른 수익을 창출할 수 있다. 예 를 들어, 택배기사들의 경우나 택시운전자들과 같이 직업적으로 운전을 수행하는 사용자들의 경우에는 친환경 차량의 운행을 통해 자발적 탄소 배출권을 발행하여 그에 따른 수익을 창출할 수 있는 것이다. 다시 말해 자발적 탄소 시장 기반의 지속가능한 현금성 인센티브를 지급받을 수 있는 것이다. 친환경 차량을 운행하는 운전자들은 자신이 소지하는 운전자 단말장치를 이용하여 도 1의 탄소배출권 관리장치에서 제공하는 플랫폼 서비스에 가입한 후 탄소배출권 판매에 따른 수익을 창출할 수 있다. 이의 과정에서 운전자 단말장치의 운전자는 탄소배출권이 NFT의 형태로 발행되는 경우에는 신뢰성 확보를 위한 동작을 수행할 수도 있다. 다시 말해, NFT는 블록체인 기술이 적용되므로 차량 운전자와 같은 진정한 소유자의 승인이 있을 때 해당 NFT 형태의 탄소배출권에 대한 소유권 이전이 이루어질 수 있다. 따라서, 탄소배출권 관리 장치를 통해 판매 요청이 있을 때 즉 블록체인과 같은 트랜잭션(transaction)이 있을 때 이를 승인(혹은 합의승인)함으로써 거래를 성사시킬 수 있는 것이다. 예를 들어 운전자 단말장치는 탄소배출권의 소유권 정보를 저장할 수 있으며, 가상 토큰의 형태로 탄소배출권을 NFT로 발행할 수 있다. 본 발명의 실시예에 따른 운전자 단말장치는 거래 승인을 위한 하나의 노드(Node)로서 동작할 수 있으며, 또 소유권 이전시에도 소유권 이전에 참여할 수 있는 것이다. 본 발명의 실시예에서는 운전자 단말장치가 중앙집중적 방식이 아닌 분산 시스템을 통해 데이터를 저장한다는 점에서 블록체인 기술을 적절히 활용할 수 있는 것이다. 물론 운전자 단말장치를 통해 운전자들은 도 1의 탄소배출권 관리장치에 접속하여 자신이 소유하는 친환경 차량과 관련하여 발행되는 탄소배출권의 판매 이력을 확인할 수도 있으며, 통상적으로 서비스 메뉴 에서 마이페이지(Mypage) 항목 등에서 확인할 수 있으며, 또 수익을 주기적으로 정산받을 수도 있다. 물론 탄소 배출권 관리장치는 수익정산을 위한 항목 즉 서비스 버튼을 생성하여 운전자 단말장치로 제공한 후 이를 통해 정산 요청이 있을 때 매일, 일주일, 또는 매월 '톤' 단위로 수익을 정산받는 것도 얼마든지 가능할 수 있다. 물론 친환경 차량의 운전자들이 자신이 소지하는 운전자 단말장치를 통해 서비스 이용을 위 한 회원가입을 할 때 자신이 소유하는 친환경 차량의 차종과 관련한 차량 정보를 제공할 수 있으며, 차종 에 따라 정산받는 수익은 상이할 수 있을 것이다. 이외에도 운전자 단말장치는 본 발명의 실시예에 따른 서비스를 이용하기 위해 어플리케이션(이하, 앱)을 설치한 경우에는 푸시 메시지의 형태로 탄소배출권 발행 및 판매와 관련한 다양한 알림을 제공받을 수 있을 것이다. 통신망은 다양한 형태로 구성될 수 있다. 통신망은 유무선 통신망을 모두 포함할 수 있다. 가령 통신 망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망 (PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망 은 이에 한정되는 것이 아니며, 향후 구현될 차세대 이동 통신 시스템의 접속망으로서 가령 클라우드 컴퓨 팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가령, 통신망이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데이터를 처리하거나, BTS(Base Transceiver Station), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수도 있다. 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피코(pico) 기지국과 같은 소형 기지국을 포함할 수 있다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분 류상 친환경 차량이나 운전자 단말장치 등을 최대 몇 대까지 접속할 수 있느냐에 따라 구분될 수 있 다. 물론 펨토 또는 피코 기지국은 친환경 차량이나 운전자 단말장치 등과 지그비 및 와이파이(Wi- Fi) 등의 근거리 통신을 수행하기 위한 근거리 통신 모듈을 포함할 수 있다. 액세스포인트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근거리 통신은 와이파이 이외에 블루투스, 지그비, 적외선(IrDA), UHF(Ultra High Frequency) 및 VHF(Very High Frequency)와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스포인트는 데이터 패 킷의 위치를 추출하고, 추출된 위치에 대한 최상의 통신 경로를 지정하며, 지정된 통신 경로를 따라 데이터 패 킷을 다음 장치, 예컨대 탄소배출권 관리장치나 서드파티장치로 전달할 수 있다. 액세스포인트는 일 반적인 네트워크 환경에서 여러 회선을 공유할 수 있으며, 예컨대 라우터(router), 리피터(repeater) 및 중계기 등이 포함될 수 있다. 탄소배출권 관리장치는 본 발명의 실시예에 따라 수소차나 전기차, 더 나아가서는 수소나 전기 화물차 등 의 주행거리에 비례하여 탄소 배출권을 발행하고 이를 관리하기 동작을 수행할 수 있다. 탄소배출권 관리장치 에서 제공하는 온라인 플랫폼 서비스는 'EVERICO'라 명명될 수도 있다. 탄소배출권 관리장치는 도 2 에 도시된 바와 같이 개략적으로 가령 1) 완성차 업체의 API 기반으로 전기, 수소 화물차의 주행거리 및 평균연 비 데이터(예: 차대번호, 차량모델 등 각종 차량 정보 포함)를 수집하고, 2) 공공데이터 기반 정부 보조금 지원 정보를 수집할 수 있다. 탄소 배출권 발행을 위해선 정부 보조금 지원 정보가 필요할 수 있다. 예를 들어, 경북 칠곡군(지역)/전기화물(차종)/포터2(차량모델)/일렉트릭(트림)의 경우 차량가격은 4,375만원(예: 국가 보조금: 1,200만원, 지자체 보조금: 600만원)이 될 수 있다. 또한 3) '감축원 단위 × 운행거리' 식을 통한 온실가스 감 축량 산정 후 탄소 배출권 시세 정보와 연계하여 예상 탄소 배출권 수익을 예측할 수 있다. 위의 1) 내지 3)을 NFT화된 차량(블록체인)에 저장한다. 그리고 4) 탄소 배출권 NFT 거래를 수행할 수 있다. 발급된 탄소배출권은 탄소배출권 관리장치에서 제공하는 마켓플레이스에 등록되어 거래가 이루어질 수 있으며, 가령 오픈마켓과 연계하여 판매하는 것도 얼마든지 가능할 수 있다. 한국거래소(KRX)를 통해 판매하는 것도 얼마든지 가능할 수 있다. 이와 같이 거래를 통해 발생된 수익은 향후 정산이 이루어질 수 있다. 예를 들어, 서비스에 가입된 운전 자별로 매월 정산이 이루어지는 것도 얼마든지 가능할 수 있다. 좀더 구체적으로 경유 화물차를 전기 화물차로 교체시 km당 온실가스 감축량(원단위: 0.2716kgCO2eq/km)은 <관 계식 1>과 같이 산정될 수 있다. <관계식 1> 감축원 단위(0.2716kgCO2eq/km) × 자동차 운행거리(km) 위의 <관계식 1>에서의 감축원 단위의 산정 근거는 <관계식 2>에서와 같이 나타날 수 있다. <관계식 2> 감축원단위 (02716 kgCO2eq/km) = 경유 화물차 주행거리(1km/대) ÷ 경유 화물차의 평균연비(km/L) × 경유 순 발열량(MJ/L) ×경유 탄소배출계수 (tC/TJ) × 단위환산 - 경유 화물차 주행거리(1km/대) ÷ 전기 화물차 연비 (km/kWh) × 전력배출계수 × 단위환산 (예: 1 km/대 ÷ 948(km/L) × 352 (MJ/L) × 73,200kgCO2/TJ × 10-6 - 1 km/대 ÷ 3.11 km/kWh × 0.4781 tCO2eq/MWh × 10-3 = 02716 kgCO2eq/km) 또한 산정계수로서 경유 순발열량 및 배출계수와 전기 화물차 평균 연비 및 전력배출계수를 비교하면 <표 1> 및 <표 2>에서와 같이 나타낼 수 있다. 표 1"}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 2"}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "예를 들어, 연간 26,000km를 주행하는 전기 화물차의 탄소 배출권 예상 수익을 계산해 보면 0.2716kgCO2eq × 26,000km = 7,061.6kgCO2eq(= 7tCO2eq)가 될 수 있다. 탄소배출권 1톤 = 14,500원(KOS23-25, 23.07.18 기준)에 해당한다. 따라서 연간 26,000km를 운행하는 전기 화물차 운전자는 연간 약 7톤의 온실가스를 감축할 수 있으며, 이를 탄소배출권으로 발행하여 수익화할 경우 101,500원을 창출할 수 있는 것이다. 또한, 하루 평균 212km를 주행하는 전기 화물차가 3일 동안 본 실시예에 따른 서비스에 참여 시, '0.2716kgCO2eq x 636 km = 172.7376kgCO2eq', 172.7376kgCO 2eq의 온실가스를 감축할 수 있게 된다. 본 발명의 실시예에서는 수소차나 전기차의 차종별로, 더 정확하게는 승용차, 화물차, 버스 등을 더 구분하거나 가령 수소나 전기 화물차로 구분하여 1km 주행시 감축 가능한 탄소량을 산정할 수 있다. 물론, 탄소량 산정은 1km의 주행거리별로 산정이 이루어질 수 있으며, 탄소 배출권은 1km가 아닌 5km나 10km 단위로 발행되는 것도 얼마든지 가능하므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 물론, 기발 행된 탄소 배출권의 경우 사용자가 분할을 요청하는 경우에는 다시 말해 탄소 배출권을 구매하려는 구매자, 물 론 판매자가 분할을 요청할 수도 있지만, 가령 구매자가 분할을 요청하는 경우에는 분할하여 탄소 배출권을 재 발행하는 형태로 동작할 수도 있을 것이다. 물론 재발행을 위해서는 해당 탄소 배출권의 소유자인 운전자 단말 장치의 운전자에서 분할을 위한 재발행을 통지하고 그에 승인하도록 요청할 수도 있을 것이다. 나아가 본 발명의 실시예에 따른 탄소배출권 관리장치는 블록체인을 적용한 NFT 기술을 활용한 탄소 배출 권의 신뢰성 검증 이외에도 탄소 배출권의 중복 발행 금지를 위한 동작을 수행할 수 있다. 이를 위하여 탄소배 출권 관리장치는 신뢰도 검증부 및 중복발행 검토부 등의 소프트웨어(S/W) 모듈을 탑재하여 실행시킬 수있을 것이다. 예를 들어 중복발행 검토를 위하여 중복발행 검토부는 수집한 주행거리 정보를 포함하는 탄소감축 데이터의 분석 후 탄소 배출권을 발행할 때 시간정보를 이용하여 이를 근거로 탄소배출권 발행 여부를 기록하거 나, 또는 데이터를 그룹핑하여 그룹을 통해 발행 여부를 기록하는 것도 얼마든지 가능할 수 있다. 예를 들어, 1km의 주행거리를 근거로 탄소 배출권을 발행할 때, 해당 1km는 2일에 걸쳐 주행한 거리일 수 있다. 따라서 주 행거리 정보를 포함하는 탄소 감축 데이터에서 시간정보를 근거로 분류하여 탄소배출권을 발행할 수 있다. 물론 탄소 배출권의 중복 발행을 금지하는 방법은 다양할 수 있다. 예를 들어, 탄소 배출권을 발행할 때 친환경 차량 의 운전자가 소지하는 운전자 단말장치로 요청하여 중복 여부를 확인하도록 요청하는 것이다. 이에 확인이 완료되면 탄소 배출권을 발행하는 것도 얼마든지 가능할 수 있다. 정리해 보면, 본 발명의 실시예에 따른 탄소배출권 관리장치는 가령 전기, 수소 화물차를 구분하고, NFT를 활용하여 동일 차량의 탄소 배출권 중복 발행 방지를 목적으로 차량을 NFT화하여 탄소 배출권을 발행할 수 있다. 또한 탄소배출권 관리장치는 주행거리에 비례하여 온실가스 감축량을 예측하고 공공 데이터(예: 탄 소배출권 시세)와 연계하여 탄소 배출권 수익을 실시간 예측할 수 있으며, API 차량 정보, 모델, 평균 연비, 주 행 거리 등을 실시간 모니터링하고 이 기록을 블록체인 기술을 활용하여 저장함으로써 신뢰성을 확보할 수 있을 것이다. 다시 말해 탄소배출권 관리장치는 전기 에너지를 동력원으로 하는 화물차(상용차를 포함)의 주행 거리에 비례하여 온실가스 감축량을 산정하고, 이를 바탕으로 탄소 배출권 수익을 예측하고, 전기 에너지를 동력원으로 하는 전기 화물차는 1km당 ‘0.2716kgCO2eq’의 온실가스를 감축할 수 있다. 주행 거리는 운행정보 API 또는 OBD 장치를 통해 측정하고, 측정된 주행 거리에 감축원 단위를 곱하여 온실가스 감축량을 산정할 수 있다. 나아 가 탄소 배출권 시세 정보 공공데이터를 활용하여 산정된 온실가스 감축량에 대한 탄소 배출권 수익을 예측할 수 있으며, 블록체인에 탄소 배출권 발행에 필요한 데이터를 수집과 동시에 저장하여, 탄소 배출권의 위·변조 를 방지할 수 있다. 또한 탄소 배출권은 NFT(대체 블가능한 토큰) 형태로 최종 발행할 수 있으며, 탄소 배출권 은 블록체인에 저장된 탄소 배출권에 대한 등기 권리증이 사용될 수 있다. 위의 내용을 도표로 정리하면 <표 3>과 같이 나타낼 수 있다. 표 3"}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "서드파티장치는 완성차 업체 다시 말해 친환경 차량을 생산하는 완성차 업체에서 운영하는 서버 등을 의미할 수 있지만, 공공기관에서 운영하는 서버 등을 포함할 수도 있다. 물론 공공기관 등에서도 친환경 차량 의 운행과 관련하여 다양한 유형의 데이터를 수집하여 이용할 수 있으므로 해당 공공기관의 서버는 공공데 이터를 탄소배출권 관리장치와의 API 연동에 의해 실시간으로 또는 주기적으로 제공해 줄 수 있을 것이다. 또한 서드파티장치는 탄소배출권 거래를 위한 한국거래소(KRX) 등의 서버를 포함할 수 있을 것이다. 상기한 내용 이외에도 도 1의 친환경 차량, 운전자 단말장치, 통신망, 탄소배출권 관리장치 및 서드파티장치는 다양한 동작을 더 수행할 수 있으며 이는 이후에도 계속해서 다루어질 수도 있으 므로, 자세한 내용은 그 내용들로 대신하고자 한다. 도 3은 도 1의 탄소배출권 관리장치의 세부구조를 예시한 블록다이어그램이며, 도 4는 도 3의 탄소배출권 관리 부의 세부구조를 예시한 블록다이어그램이다. 도 3에 도시된 바와 같이, 본 발명의 실시예에 따른 도 1의 탄소배출권 관리장치는 통신 인터페이스부 , 제어부, 탄소배출권 관리부 및 저장부의 일부 또는 전부를 포함한다.여기서, \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 탄소배출권 관리장 치가 구성되거나, 탄소배출권 관리부와 같은 일부 구성요소가 제어부와 같은 다른 구성요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 통신 인터페이스부는 도 1의 통신망을 경유하여 친환경 차량, 운전자 단말장치 및 서드파 티장치와 각각 통신할 수 있다. 통신 인터페이스부는 친환경 차량과 통신하여 차량의 운행과 관 련한 운행 데이터를 탄소감출 데이터로서 수집할 수 있다. 해당 운행 데이터에는 주행거리 정보와 차량의 식별 정보가 포함될 수 있다. 차량의 식별정보는 차량의 제조사나 모델명 등이 포함될 수 있으며, 친환경 차량 은 예를 들어 도 1의 탄소배출권 관리장치에 서비스 가입이 이루어질 때 원격으로 프로그램 설치 등을 통 해 기설정된 시간마다 운행 데이터를 전송해 줄 수 있다. 가령, 펌웨어 형태로 프로그램이 설치되어 본 발명의 실시예에 따른 동작이 이루어질 수도 있을 것이다. 물론 본 발명의 실시예에 따른 탄소배출권 관리장치의 경우 서드파티장치와 연계하여 도 1의 친환경 차량에 대한 운행 데이터를 수집하는 경우에는 서드파티장치와 API 연동에 의해 차량의 운행 데이터 를 수집하는 것도 얼마든지 가능하므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것 이다. 또한 통신 인터페이스부는 친환경 차량과 관련한 데이터를 취급하는 공공기관의 서버에 연동하 여 차량 관련 데이터를 수집하는 것도 얼마든지 가능할 수 있다. 예를 들어, 교통관리공단(혹은 안전공단) 등에 서는 자동차의 정기점검을 수행할 수도 있다. 이의 경우 교통관리공단(혹은 안전공단)에서 운영하는 서버로부터 주행 관련 데이터를 제공받아 이를 이용하거나 이를 근거로 데이터의 위변조 여부(예: 주행거리 조작 등)를 판 단할 수도 있을 것이다. 나아가 통신 인터페이스부는 운전자 단말장치와 통신하여 탄소 배출권 발행과 관련한 다양한 동작을 수행할 수 있다. 예를 들어, NFT 형태로 탄소 배출권을 발행할 때 운전자 단말장치로부터 승인 요청이 있 을 수 있다. 또한, 발행된 탄소 배출권에 대하여 분할 요청이 있을 때에도 분할을 위한 승인 요청을 제어부 의 제어하에 운전자 단말장치로 전송할 수 있다. 통신 인터페이스부는 이러한 동작에 관여할 수 있으며, 통신을 수행하는 과정에서 변/복조, 먹싱/디먹싱, 인코딩/디코딩, 암호화/복호화, 해상도를 변환하는 스케일링 등의 동작을 수행하는 것도 얼마든지 가능할 수 있다. 이러한 변/복조나 스케일링 등과 관련해서는 이 미 당업자에게 자명하므로 더 이상의 설명은 생략하도록 한다. 제어부는 도 3의 통신 인터페이스부, 탄소배출권 관리부 및 저장부의 전반적인 제어 동작 을 담당할 수 있다. 대표적으로 제어부는 친환경 차량의 주행거리 정보를 포함하는 탄소감축 데이터 또는 운행 데이터가 수집되면 이를 저장부에 임시 저장한 후 도 1의 DB(130a)에 체계적으로 분류하여 저장 시킬 수 있다. 물론 이러한 과정에서 데이터 가공을 위해 해당 데이터를 탄소배출권 관리부에 제공하여 가 공된 데이터를 DB(130a)에 저장시키는 것도 얼마든지 가능할 수 있다. 여기서, 가공이란 도 1의 DB(130a)에 데 이터를 저장할 수 있는 형태의 데이터 포맷을 의미할 수 있다. 또한 제어부는 가령 탄소배출권 관리부의 요청에 따라 DB(130a)에 저장되는 데이터를 불러와 탄소배 출권 관리부에 제공하여 데이터 분석을 요청할 수 있으며, 이의 과정에서 도 1의 운전자 단말장치와 탄소 배출권 발행을 위한 동작을 수행할 수 있다. 예를 들어, 운전자 단말장치는 자신이 소유하는 친환경 차량의 주행과 관련하여 발행되는 탄소 배출권에 대한 소유권 정보를 저장할 수 있으며, 따라서 NFT 방식 으로 발행되는 탄소 배출권은 그에 접속할 수 있는 URL 정보를 포함하는 가상 토큰 형태가 될 수 있으므로, 탄 소 배출권의 거래시에는 소유권자인 운전자 단말장치의 운전자로부터 승인이 이루어질 때 소유권 이전이 이루어질 수 있을 것이다. 제어부는 이러한 동작에 관여하기 위해 통신 인터페이스부의 통신을 제어 할 수 있을 것이다. 탄소배출권 관리부는 친환경 차량의 운행 데이터 또는 탄소감축 데이터를 수집하여 해당 데이터를 분 석할 수 있다. 이때 탄소배출권 관리부는 차량의 주행거리별로 탄소배출권을 발행할 수 있으며, 이의 과정 에서 주행거리를 측정하고 또 차량의 차종을 판별하는 등의 동작이 이루어질 수 있다. 예를 들어, 친환경 차량 은 운행 데이터를 제공할 때 차량의 식별정보를 함께 제공할 수 있다. 탄소배출권 관리부는 그 식별 정보를 통해 차종을 판단할 수 있으며, 차종의 판단이 완료되면 그 차종에 따라 서로 다른 방식의 탄소 감축량 산정이 이루어질 수도 있다. 이는 <관계식 1> 및 <관계식 2> 등을 통해 이미 설명한 바 있다. 여기서 탄소 감축 량 산정은 온실가스 예상 감축량에 해당할 수 있으며, 탄소 배출권 판매 수익을 예측하는 데에도 관계될 수 있 다.예를 들어, 탄소배출권 관리부는 탄소 배출권을 발행할 때 판매 금액을 결정할 수도 있다. 물론 이를 위하 여 다양한 동작이 가능할 수 있다. 예를 들어, 기존에 동종 차량과 관련하여 판매된 이력이 있으면 해당 정보를 근거로 판매 금액을 결정할 수 있다. 또는 주식거래소 등과 같이 시중의 거래소 등에서 거래되는 데이터를 활용 할 수도 있다. 우리나라는 2015년 1월부터 한국거래소(KRX; Korea Exchange)를 통해 탄소 배출권 거래를 허용하 고 있으며, 세계적으로 통용되는 대표적인 탄소 배출권으로는 UN 청정개발체제 사업을 통해 실적이 인증되면 UNFCCC(UN Framework Convention on Climate Change)에 신청하여 획득할 수 있는 CER(Certified Emission Reduction)이 있다. 탄소배출권 관리부는 이러한 한국거래소 등에 연동하여 거래가 이루어지도록 할 수 있 다. 나아가 친환경 차량의 소유주가 희망하는 가격으로 결정하는 것도 얼마든지 가능할 수 있다. 탄소 배 출권은 배출 가능한 탄소량 정보를 포함할 수 있으며, 또 이를 구매하려는 구매자에게 판매하기 위한 판매 금액 을 포함할 수도 있다. 이때 탄소량은 차종 및 주행거리를 기반으로 산정되지만, 판매 금액은 운전자가 직접 등 록하거나 거래내역을 근거로 결정하는 등 다양한 방식이 가능할 수 있다. 예를 들어, 탄소배출권 관리부가 서비스를 통해 수집되는 빅데이터를 인공지능 프로그램을 적용해 분석하는 경우 수요나 공급을 분석하여 이를 기반으로 가격 변동을 통해 금액을 제시하는 것도 얼마든지 가능할 수 있다. 즉 수요가 많으면 가격을 높이고, 공급이 많으면 가격을 낮춰 거리가 이루어지도록 하는 것이다. 물론 여기서 가격이 높고 낮다는 것은 기준가격 을 설정하고 이를 기준으로 할 수 있을 것이다. 나아가 탄소배출권 관리부는 기발생된 탄소배출권에 대한 발행이나, 또 탄소배출권을 발행할 때 중복 발행 여부를 검토하기 위한 동작을 수행할 수도 있다. 예를 들어, 기발행된 탄소배출권에 대하여 가령 구매자로부터 분할 구매 요청이 있는 경우 이를 운전자 단말장치의 운전자에게 통지할 수 있다. 이의 과정에서 분할 승 인이 있는 경우, 탄소배출권 관리부는 기존에 발행된 탄소 배출권을 폐기하고 새로운 탄소 배출권으로 분 할 발행하여 그 중 일부를 판매할 수 있을 것이다. 물론 이러한 과정은 기록될 수 있을 것이다. 이에 따라 운전 자 단말장치의 운전자가 서비스에 접속하여 거래 내역을 확인해 언제 탄소배출권을 분할하고 일부를 판매 했는지를 확인할 수 있을 것이다. 탄소배출권의 중복 발행과 관련해서는 앞서 언급한 바와 같이 친환경 차량 의 운행 데이터에 포함되는 시간 정보 등을 근거로 중복 발행 여부를 판단할 수 있으므로 본 발명의 실시 예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 탄소배출권 관리부는 복수의 소프트웨어(S/W) 모듈을 포함하여 구성될 수 있다. 도 3의 탄소배출권 관리부 는 가령 도 4에서와 같이 데이터 수집부, 신뢰도 검증부 및 중복발행 검증부의 일부 또는 전부를 포함하고, 이를 제어하는 매니저(manager)를 더 포함하는 형태의 탄소배출권 관리부(320')를 구성할 수 도 있다. 매니저는 도 3의 제어부의 CPU나 MPU 등과 통신할 수 있을 것이다. 도 4의 데이터 수집부, 신뢰도 검증부 및 중복발행 검증부는 하드웨어, 소프트웨어 또는 그 조합에 의해 구성될 수 있을 것 이다. 데이터 수집부는 가령 완성차 업체의 데이터 API를 활용하여 수집되는 친환경 차량의 운행 데이터 즉 탄소량감축 데이터를 수집하는 동작을 수행할 수 있다. 물론 수집된 데이터를 도 1의 DB(130a)에 체계적으로 분 류하여 저장시키기 위해 지정 포맷으로 가공하는 동작을 수행할 수도 있을 것이다. 신뢰도 검증부는 탄소배출권 발행 동작을 수행할 수 있다. 물론 탄소 배출권은 NFT 형태로 발행될 수 있다. 여기서 NFT는 블록체인에 저장된 등기 권리증이라 볼 수 있다. 신뢰도 검증부는 탄소 배출권의 소유 권 정보의 경우 친환경 차량의 운전자가 소지하는 운전자 단말장치로 제공하여 저장되도록 하고, 물 론 이의 과정에서 비밀번호 설정 등 암호화 동작이 이루어질 수도 있으며, 또 그 소유권 정보에 접속할 수 있는 URL 정보를 생성해 탄소 배출권에 포함하여 마켓 플레이스에 등록시킨 후 거래가 이루어지도록 할 수 있다. 물론 신뢰도 검증부는 발행된 탄소 배출권의 거래시에도 블록체인 기반으로 동작하여 해당 탄소배출권에 관계되는 운전자의 운전자 단말장치로 거래를 위한 승인을 요청하여 승인이 있을 때 거래를 성사시킬 수 있다. 거래 성사시 운전자 단말장치의 소유권 정보를 삭제할 수 있으며, 해당 소유권 정보는 탄소배출권의 구매자에게 이전될 수 있다. 물론 블록체인 동작은 적어도 2개의 노드(node)에서 승인 즉 합의승인이 있을 때 거래를 성사시키는 것이므로, 이러한 승인을 위하여 운전자 단말장치와 도 1의 탄소배출권 관리장치 가 관여할 수 있을 것이다. 중복발행 검증부는 가령 신뢰도 검증부에서 탄소량감축 데이터를 이용해 탄소 감축량을 산정하고 그 산정 결과를 근거로 탄소배출권을 발행할 때 어떠한 데이터를 근거로 탄소배출권이 발행되는지 기록하여 이를 근거로 탄소 배출권의 중복 발행을 금지시킬 수 있다. 예를 들어, 이전일 밤 12시부터 다음날 밤 12시까지의 주 행 거리를 근거로 탄소배출권이 발행된 경우를 가정해 보자. 이의 경우 도 1의 DB(130a)에는 해당 데이터의 일측에 탄소 배출권의 발행여부에 대한 정보를 기록할 수 있다. 따라서, 이의 정보를 확인해 중복발행 여부를 검 증하는 것도 얼마든지 가능할 수 있다. 중복발생 검증은 이외에도 다양한 방식이 가능할 수 있으므로, 본 발명 의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 도 3의 저장부는 제어부의 제어하에 다양한 유형의 데이터나 정보를 임시 저장할 수 있다. 예를 들어 저장부는 도 1의 서드파티장치와 API 연동에 의해 친환경 차량의 운행 데이터가 수집되는 경우 이를 임시 저장한 후 데이터 가공이나 분석을 위해 탄소배출권 관리부에 제공할 수 있다. 상기한 내용 이외에도 도 3의 통신 인터페이스부, 제어부, 탄소배출권 관리부 및 저장부는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한 다. 본 발명의 실시예에 따른 도 3의 통신 인터페이스부, 제어부, 탄소배출권 관리부 및 저장부 는 서로 물리적으로 분리된 하드웨어 모듈로 구성되지만, 각 모듈은 내부에 상기의 동작을 수행하기 위한 소프트웨어를 저장하고 이를 실행할 수 있을 것이다. 다만, 해당 소프트웨어는 소프트웨어 모듈의 집합이고, 각 모듈은 하드웨어로 형성되는 것이 얼마든지 가능하므로 소프트웨어니 하드웨어니 하는 구성에 특별히 한정하지 않을 것이다. 예를 들어 저장부는 하드웨어인 스토리지(storage) 또는 메모리(memory)일 수 있다. 하지만, 소프트웨어적으로 정보를 저장(repository)하는 것도 얼마든지 가능하므로 위의 내용에 특별히 한정하지는 않을 것이다. 한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트 정보의 연산동작을, 그리고 명령어해석부는 인터프리터나 컴 파일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지 스트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 탄소배출권 관리장치 의 동작 초기에 탄소배출권 관리부에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로딩한 후 이를 실행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 딥러닝 모델 같은 경우 램(RAM)이 아 닌 GPU 메모리에 올라가 GPU를 이용하여 수행 속도를 가속화하여 실행될 수도 있다. 도 5는 도 1의 탄소배출권 관리장치의 구동과정을 나타내는 흐름도이다. 설명의 편의상 도 5를 도 1과 함께 참조하면, 본 발명의 실시예에 따른 탄소배출권 관리장치는 수소차나 전기차를 포함하는 친환경 차량, 더 정확하게는 전기 에너지를 동력원으로 하는 화물차의 주행거리에 관련되는 탄소감축 데이터 즉 차량 운행 데이터를 수집할 수 있다(S500). 본 발명의 실시예에서는 탄소감축 데이터의 수 집을 위하여 완성차 업체에서 운영하는 서버 등에 API 연동하여 이를 통해 데이터를 수집하는 것이 얼마든지 가 능할 수 있다. 또는 차량의 OBD 장치로 데이터를 수집하는 것도 얼마든지 가능할 수 있다. 데이터 수집 시점에 있어서는 실시간으로 수집될 수 있지만, 수집 시점이 설정되어 그에 따라 동작하는 것도 얼마든지 가능할 수 있 을 것이다. 탄소감축 데이터, 가령 탄소 배출권 발행에 필요한 데이터는 차량 운행정보(예: 주행거리, 주행시간, 평균속도, 최고속도 등)를 포함할 수 있다. 또한 탄소배출권 관리장치는 수집한 탄소감축 데이터를 분석하여 전기 화물차의 배출원 단위에 근거한 주 행거리별 온실가스 감축량을 산정하고, 산정한 감축량을 블록체인 기술을 적용해 디지털 자산의 소유주를 증명 하는 NFT 형태로 탄소 배출권을 발행할 수 있다(S510). 이의 과정에서 탄소배출권 관리장치는 탄소배출권 수익을 산정할 수 있으며, 산정한 수익이 반영되는 탄소 배출권을 발행하여 온라인 또는 오프라인 마켓에서 거래시킬 수 있다. 여기서 탄소 배출권 수익을 산정한다는 것은 다양한 의미를 내포할 수도 있다. 가령 탄소 배출권 시세정보의 공공데이터를 활용하여 산정된 온실가스 감축량에 대한 탄소 배출권 수익을 예측할 수 있다. 또 수소나 전기 화물차의 차종별로 구분하여 1km 주행시마 다의 감축 가능한 탄소량을 연산 알고리즘을 통해 계산하는 것 이외에도 발행하는 탄소 배출권의 판매 금액을 결정하는 것을 포함할 수도 있다. 다만, 판매 금액의 결정은 별도의 결정 과정없이 위의 수익 산정시 디폴트 (default)로 결정되어 다시 말해 시중에 판매되는 상품에 가격이 결정되어 있는 것과 같이 그 가격이 결정될 수 도 있는 것이므로 별도의 판매 금액 결정 과정이 없을 수는 있지만, 운전자가 결정하거나 과거에 거래된 금액을 근거로 탄소배출권 관리장치에서 결정하는 것도 얼마든지 가능하므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 상기한 내용 이외에도 도 1의 탄소배출권 관리장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용 은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 가령 5km 주행단위로 탄소배출권을 발행할 때 구 매자의 요청에 따라 탄소배출권의 분할 등이 얼마든지 가능할 수 있을 것이다. 도 6은 도 1의 탄소배출권 관리장치의 다른 구동 과정(혹은 친환경 차량의 주행거리 비례형 탄소배출권 관리 방 법)을 나타내는 흐름도이다. 설명의 편의상 도 6을 도 1과 함께 참조하면, 본 발명의 실시예에 따른 탄소배출권 관리장치는 가령 전기 화물차 등의 제조사에서 운영하는 서버 등에 API 연동하거나 또는 차량의 OBD 장치부터 주행 거리 및 연비 정보 를 수집할 수 있다(S600). 차량의 사물인터넷(IoT) 통신에 의해 OBD 장치로부터 주행거리 데이터나 연비 정보를 수집하는 것이 얼마든지 가능할 수 있다. 데이터 트래픽 등을 고려하여 차량이 운행을 시작하거나 완료하였을 때 주행 거리 데이터나 연비 정보를 수집하는 것이 바람직하며, 연비 정보의 경우에는 최초 서비스 이용시 차량 의 운전자가 등록하는 차량 정보 등을 통해 취득하는 것도 얼마든지 가능할 수 있을 것이다. 또한 탄소 배출권 관리장치는 (기설정된) 감축량 산정식에 근거하여 온실가스 감축량을 산정할 수 있다 (S610). 온실가스 감축량은 기수집한 차량별 주행거리 데이터가 활용될 수 있으며, 물론 온실가스 감축량은 차 량의 연비(또는 종류)에 따라 상이하게 산정될 수 있다. 온실가스 감축량은 0.2716kgCO2eq/km × 자동차 주행 거리 (km)의 관계식이 적용될 수 있으며, 이는 연산 알고리즘의 형태로 얼마든지 구현이 가능할 수 있다. 나아가 탄소 배출권 관리장치는 탄소 배출권 시세에 따른 탄소 배출권 수익을 계산할 수 있다(S620). 예를 들어, 연간 26,000km를 주행하는 전기 화물차의 탄소 배출권 예상 수익을 계산해 보면 0.2716kgCO2eq × 26,000km = 7,061.6kgCO2eq(= 7tCO2eq)가 될 수 있다. 탄소배출권 1톤 = 14,500원(KOS23-25, 23.07.18 기준)에 해당한다. 따라서 연간 26,000km를 운행하는 전기 화물차 운전자는 연간 약 7톤의 온실가스를 감축할 수 있으며, 이를 탄소배출권으로 발행하여 수익화할 경우 101,500원을 창출할 수 있다. 뿐만 아니라, 본 발명의 실시예에 따른 탄소 배출권 관리장치는 공공데이터와 연계하여, 전기차 보조금 지 원 정보를 수집할 수 있다(S630). 탄소 배출권 관리장치는 탄소 배출권 발행을 위해서 정부 보조금 지원 정보를 필요로 할 수 있으며, 예를 들어 경북 칠곡군(지역)/전기화물(차종)/포터2(차량모델)/일렉트릭(트림)의 경우 차량가격은 4,375만원(예: 국가 보조금: 1,200만원, 지자체 보조금: 600만원)이 될 수 있다 더 나아가 본 발명의 실시예에 따른 탄소 배출권 관리장치는 주행 거리, 연비 정보, 온실가스 감축량, 전 기차 보조금 지원 정보 등의 정보를 블록체인에(혹은 블록체인의 형태로) 저장할 수 있으며(S640), 이외에도 탄 소 배출권 NFT를 발행할 수 있다(S650). 여기서 블록체인이란 본 발명의 실시예에서는 복수의 노드에 가령 도 1 의 운전자 단말장치, 탄소배출권 관리장치 및 서드파티장치 등에 본 발명의 실시예에 따른 데이 터를 분산 저장하는 분산 시스템을 운영할 수 있으며, 이에 따라 데이터의 수정 즉 트랜잭션 등이 있을 때 복수 의 노드에서 합의 승인이 있을 때 데이터를 처리할 수 있다. 물론 탄소 배출권 관리장치는 탄소배출권의 등기 권리증 등에 대한 원본 데이터는 운전자 단말장치의 운전자가 소유하도록 할 수 있고, 탄소 배출권의 거래시 해당 원본 데이터에 접속할 수 있는 URL 정보 등을 포 함하여 거래가 이루어지는 가상 토큰의 형태로 서비스 이루어지도록 동작할 수 있다. 이에 따라 탄소 배출권 관 리장치는 탄소 배출권을 NFT의 형태로 발행할 수 있는 것이다. 가령, 탄소 배출권의 거래에 따라 소유권 이전이 있는 경우에는 탄소 배출권의 소유권자가 변경되므로, 원본 데이터의 저장 주체는 매수자의 단말장치로 이전될 수 있으며, 이에 따라 매수자의 단말장치가 기존 탄소 배출권의 승인 주체로 재설정이 이루어질 수 있을 것이다. 상기한 내용 이외에도 도 1의 탄소 배출권 관리장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용 은 앞서 충분히 설명하였으므로, 그 내용들로 대신하고자 한다. 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모 든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각각 하 나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램 으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일시적 저 장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다."}
{"patent_id": "10-2023-0105063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "이상 첨부된 자료를 참조하여 본 발명을 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 는 본 발명의 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것 을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0105063", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 친환경 차량의 주행거리 비례형 탄소배출권 관리 시스템을 나타내는 도면이다. 도 2는 도 1의 탄소배출권 관리장치의 핵심 서비스 프로세스를 설명하기 위한 도면이다. 도 3은 도 1의 탄소배출권 관리장치의 세부구조를 예시한 블록다이어그램이다. 도 4는 도 3의 탄소배출권 관리부의 세부구조를 예시한 블록다이어그램이다. 도 5는 도 1의 탄소배출권 관리장치의 구동과정을 나타내는 흐름도이다. 도 6은 도 1의 탄소배출권 관리장치의 다른 구동과정을 나타내는 흐름도이다. 도 7은 일실시예에 따른 탄소배출권 관리장치의 애플리케이션 모습을 나타낸 도면이다."}
