{"patent_id": "10-2020-0164537", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0075918", "출원번호": "10-2020-0164537", "발명의 명칭": "자동차 수리 중개 서비스 방법", "출원인": "박동철", "발명자": "박동철"}}
{"patent_id": "10-2020-0164537", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "수리 사업자 단말기(120)로부터 중개 서버(110)로 수리 사업자 단말기의 유저인 자동차 수리 사업자(이하, \"수리 사업자\"라 약칭함)의 기본 정보 및 자동차 수리 전문분야(이하, \"수리 전문분야\") 정보를 전송하여 전문 수리 사업자로 등록 신청이 수행되는 단계(S210)와,전문분야에 매칭되어서 수리 사업자의 정보가 저장되어 있는 전문분야 데이터베이스(111)에 수리 사업자 단말기(120)로부터 전문 수리 사업자의 등록 신청이 있는 경우, 중개 서버(110)는 등록 신청한 수리 사업자의 수리 전문분야에 일치하는 전문분야를 전문분야 데이터베이스(111)에서 탐색하고,탐색한 수리 전문분야의 필드에 신청한 수리 사업자 정보를 수리 전문분야에 매칭하여서 저장하는단계(S212)와,이용자 단말기(130)가 \"수리 대상 정보\"와 이용자 단말기(130)의 유저인 서비스 이용자의 기본 정보를 중개 서버(110)로 전송하여 자동차 수리 서비스를 요청하는 단계(S214)와,중개 서버(110)는 수신한 \"수리 대상 정보\"를 기초로 이용자 단말기(130)가 요청한 자동차 수리 서비스의 \"수리전문분야\"를 확정하는 단계(S216)와,상기와 같이 수리 전문분야를 확정한 중개 서버(110)는 전문분야 데이터베이스(111)를 탐색하여 상기 확정된 수리 전문분야에 매칭되어서 저장되어 있는 수리 사업자를 추출하여 선택하는 단계(S218)와,중개 서버(110)는 선택된 수리 사업자의 수리 사업자 단말기(120)로 상기 수리 대상 정보를 전송하는 단계(S220)와,수리 대상 정보를 수신한 수리 사업자 단말기(120)가 수리 견적 정보를 중개 서버(110)로 전송하는 단계(S222)와,중개 서버(110)는 수리 사업자 단말기(120)로부터 수신한 수리 견적 정보를 수리 서비스를 요청한 이용자 단말기(130)로 전달하는 단계(S224)와,수리 견적 정보를 수신한 이용자 단말기(130)는, 수신한 견적 정보에 대한 수락 또는 거절의 응답 정보를 중개서버(110)로 전송하는 단계(S226)와,이용자 단말기(130)로부터 수락의 응답 정보를 수신한 경우(S228), 수리 사업자 단말기(120)로 이용자 단말기(130)의 유저인 서비스 이용자의 정보와 함께 중개 승인 정보를 전송하고, 동시에 이용자 단말기(130)로 견적승인된 수리 사업자의 정보와 중개 승인 정보를 전송하는 단계(S230)를 포함하여 구성되는 것을 특징으로 하는자동차 수리 중개 서비스 방법."}
{"patent_id": "10-2020-0164537", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "에 있어서,상기 중개 승인 정보가 전송되는 단계(S230) 수행 후에,이용자 단말기(130)가 수리 서비스 평점 정보를 중개 서버(110)에 전송하는 단계(S310)와,중개 서버(110)는 수신한 서비스 평점 정보를 서비스를 제공한 수리 사업자에 매칭하여서 저장하고 또한 서비스를 제공한 수리 사업자가 속한 중고차 매매단지(CS)에 매칭하여서 매매단지 별로 저장하는 단계(S320)가 더 포함되어서 구성되는 것을 특징으로 하는 자동차 수리 중개 서비스 방법."}
{"patent_id": "10-2020-0164537", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 수리 사업자와 연관된 중고차 매매단지는, 수리 사업자가 기 수리 거래가 이력이 있는 중고차 매매사업자가 귀속된 중고차 매매단지인 것을 특징으로 하는 자동차 수리 중개 서비스 방법."}
{"patent_id": "10-2020-0164537", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 자동차 수리 서비스 중개 방법에 관한 것으로, 수리 사업자 단말기가 전문 수리 사업자로 등록 신청을 하며(S210)와, 중개 서버가 수리 사업자 정보를 수리 전문분야에 매칭하여 저장하며(S212)와, 이용 자 단말기가 자동차 수리 서비스를 요청하며(S214)와, 중개 서버는 이용자 단말기가 요청한 자동 (뒷면에 계속)"}
{"patent_id": "10-2020-0164537", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자동차 수리 중개 서비스 비지니스 모델에 관한 것으로, 특히 중고차 수리 서비스의 가격을 낮출 수 있는 새로운 비지니스 모델을 제공할 수 있도록 하여 중고차 수리 서비스의 활성화를 꽤할 수 있도록 하기에 적 당하도록 자동차 수리 중개 서비스 방법에 관한 것이다."}
{"patent_id": "10-2020-0164537", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 자동차의 증가 및 자동차 소유의 증가에 따라서 자동차 수리(정비)가 필요한 경우가 많이 발생하고 있다. 이러한 자동차의 수리는 일반적으로 자동차 수리 사업장(카센터, 자동차 공업사)에서 행해지는데, 자동차 수리 사업장에 따라서 가격이 천차만별이므로 소비자(이용자)는 어느 자동차 수리 사업장에서 자동차의 수리를 맡겨 야 하는지 그 기준을 정하지 못하고 있는 실정이다. 이에 저렴한 가격으로 자동차의 수리(정비)를 중개할 수 있는 새로운 비지니스 모델의 필요성이 대두되고 있는 상황이다. 선행기술문헌 특허문헌 (특허문헌 0001) 문헌1: 등록특허공보 제10-1349935호(공고일: 2014.02.06.) (특허문헌 0002) 문헌2: 등록특허공보 제10-1739110호(공고일: 2017.06.23.)"}
{"patent_id": "10-2020-0164537", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 문제점을 해결하기 위해 창작된 것으로 본 발명에 의한 자동차 수리 중개 서비스 방법의 목적은, 첫째, 자동차 수리를 수요자(이용자)와 공급자(자동차 수리 사업자) 간을 단순히 중개하는 것에 그치는 것이 아 니라, 자동차 수리를 전문 분야별로 분류를 하고, 각 전문 분야 별로 자동차 수리 사업자를 매칭하여 데이터베 이스화 한 후에, 자동차의 수리 서비스 요청 있는 경우 서비스 요청한 수리를 요하는 자동차의 수리 부위에 따 라서 각 전문 수리 사업자에게 자동으로 할당하는 방식을 채택함으로써, 수리 사업자의 입장에서는 수리 물량을 전문분야에 대해서만 다량으로 확보할 수 있도록 하여 저렴한 비용으로 자동차 수리 서비스를 제공할 수 있도록 하며, 그리하여 이용자의 입장에서는 낮은 가격에 자동차의 수리를 이용할 수 있도록 하며, 둘째, 자동차 수리 서비스를 제공하는 수리 사업자에게 전문분야 별로 다량으로 수리 서비스를 의뢰할 수 있도 록 하여 저렴한 가격의 자동차 수리가 수행될 수 있도록 함으로써 자동차 수리 서비스의 활성화로 인하여 경제 의 활성화를 이룰 수 있도록 하며, 셋째, 자동차 수리 사업자와 연관된 중고차 매매단지를 기반으로 자동차 수리 서비스를 수행할 수 있도록 함으 로써 더욱더 저렴한 비용으로 자동차 수리 서비스를 제공할 수 있도록 하며, 넷째, 중고차 매매단지에 귀속된 자동차 매매사업자와의 중고차 수리 서비스에 관한 기 거래 내역이 있는 수리 사업자에게는 \"우수 수리 사업자\"로 선정하고 이 우수 사업자라는 선정 정보를 견적 정보를 요청하는 이용자 단 말기로 함께 제공할 수 있도록 함으로써 가격 인하를 유도할 수 있어서 수리 서비스의 가격을 더욱더 낮출 수 있도록 하기에 적당하도록 한 자동차 수리 중개 서비스 방법을 제공하는 데 있다."}
{"patent_id": "10-2020-0164537", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명인 자동차 수리 중개 서비스 방법은, 수리 사업자 단말기로부터 중개 서버로 수리 사업자 단말기의 유저인 자동차 수리 사업자(이하, \"수리 사업자\"라 약칭함)의 기본 정보 및 자동 차 수리 전문분야(이하, \"수리 전문분야\") 정보를 전송하여 전문 수리 사업자로 등록 신청이 수행되는 단계와, 전문분야에 매칭되어서 수리 사업자의 정보가 저장되어 있는 전문분야 데이터베이스에 수리 사업자 단말기로부 터 전문 수리 사업자의 등록 신청이 있는 경우, 중개 서버는 등록 신청한 수리 사업자의 수리 전문분야에 일치 하는 전문분야를 전문분야 데이터베이스에서 탐색하고, 탐색한 수리 전문분야의 필드에 신청한 수리 사업자 정 보를 수리 전문분야에 매칭하여서 저장하는 단계와,이용자 단말기이 \"수리 대상 정보\"와 이용자 단말기의 유저 인 서비스 이용자의 기본 정보를 중개 서버로 전송하여 자동차 수리 서비스를 요청하는 단계와, 중개 서버는 수 신한 \"수리 대상 정보\"를 기초로 이용자 단말기가 요청한 자동차 수리 서비스의 \"수리 전문분야\"를 확정하는 단 계와, 상기와 같이 수리 전문분야를 확정한 중개 서버는 전문분야 데이터베이스를 탐색하여 상기 확정된 수리 전문분야에 매칭되어서 저장되어 있는 수리 사업자를 추출하여 선택하는 단계와, 중개 서버가 선택된 수리 사업자의 수리 사업자 단말기로 상기 수리 대상 정보를 전송하는 단계와, 수리 대상 정보를 수신한 수리 사업자 단말기가수리 견적 정보를 중개 서버로 전송하는 단계와, 중개 서버는 수리 사업자 단말기로부터 수신한 수리 견적 정보를 수리 서비스를 요청한 이용자 단말기로 전달하는 단계와, 수리 견적 정보를 수신한 이용자 단 말기는, 수신한 견적 정보에 대한 수락 또는 거절의 응답 정보를 중개 서버로 전송하는 단계와, 이용자 단말기 로부터 수락의 응답 정보를 수신한 경우, 수리 사업자 단말기로 이용자 단말기의 유저인 서비스 이용자의 정보 와 함께 중개 승인 정보를 전송하고, 동시에 이용자 단말기로 견적 승인된 수리 사업자의 정보와 중개 승인 정 보를 전송하는 단계를 포함하여 구성되는 것을 특징으로 한다."}
{"patent_id": "10-2020-0164537", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 구성을 가지는 본 발명인 자동차 수리 중개 서비스 방법은 다음과 같은 효과가 있다. 첫째, 자동차 수리를 수요자(이용자)와 공급자(자동차 수리 사업자) 간을 단순히 중개하는 것에 그치는 것이 아 니라, 자동차 수리를 전문 분야별로 분류를 하고, 각 전문 분야 별로 자동차 수리 사업자를 매칭하여 데이터베 이스화 한 후에, 자동차의 수리 서비스 요청 있는 경우 서비스 요청한 수리를 요하는 자동차의 수리 부위에 따 라서 각 전문 수리 사업자에게 자동으로 할당하는 방식을 채택함으로써, 수리 사업자의 입장에서는 수리 물량을 전문분야에 대해서만 다량으로 확보할 수 있어서 저렴한 비용으로 자동차 수리 서비스를 제공할 수 있는 효과가 있고, 그 결과 이용자의 입장에서는 낮은 가격에 자동차의 수리를 이용할 수 있는 효과가 있다.둘째, 자동차 수리 서비스를 제공하는 수리 사업자에게 전문분야 별로 다량으로 수리 서비스를 의뢰할 수 있도 록 하여 저렴한 가격의 자동차 수리가 수행될 수 있는 효과가 있고, 그 결과 자동차 수리 서비스의 활성화로 인 하여 경제의 활성화를 이룰 수 있는 효과가 있다. 셋째, 자동차 수리 사업자와 연관된 중고차 매매단지를 기반으로 자동차 수리 서비스를 수행할 수 있도록 함으 로써 더욱더 저렴한 비용으로 자동차 수리 서비스를 제공할 수 있는 효과가 있다. 넷째, 중고차 매매단지에 귀속된 자동차 매매사업자와의 중고차 수리 서비스에 관한 기 거래 내역이 있는 수리 사업자에게는 \"우수 수리 사업자\"로 선정하고 이 우수 사업자라는 선정 정보를 견적 정보를 요청하는 이용자 단 말기로 함께 제공할 수 있도록 함으로써 가격 인하를 유도할 수 있는 효과가 있고, 그 결과 수리 서비스의 가격 을 더욱더 낮출 수 있는 효과가 있다."}
{"patent_id": "10-2020-0164537", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다음은 본 발명인 자동차 수리 중개 서비스 방법의 바람직한 실시예를 첨부한 도면을 참조하여 상세하게 설명한 다. 본 발명의 일 실시예에 의한 자동차 수리 중개 서비스 방법을 구현하기 위한 자동차 수리 중개 서비스 시스템은 수리 사업자 단말기과 이용자 단말기과 중개 서버와 전문분야 데이터베이스와 매매단지 데 이터베이스를 포함하여 구성되는 것을 특징으로 한다. 상기 수리 사업자 단말기는 자동차 수리 사업자(CR)가 사용 내지 운영하는 단말기(단말장치)로서, 중개 서 버에 수리 사업자로서 등록 신청하기 위한 단말기이며, 예컨대 스마트폰 등과 같은 휴대단말기 또는 PC(Personal Computer), 태블릿 컴퓨터, 노트북컴퓨터 등으로 구성될 수 있다. 수리 사업자 단말기의 유저는 예컨대 자동차 수리를 사업으로 영위하는 자동차 수리 공업사(카센터)로서 개인사업자이거나 법인사업자가 될 수 있다. 상기 이용자 단말기는 자동차 수리 서비스를 신청하기 위한 단말기로서 예컨대 스마트폰 등과 같은 휴대단 말기 또는 PC, 태블릿 컴퓨터, 노트북컴퓨터 등으로 구성될 수 있다. 상기 중개 서버는 수리 사업자 단말기 및 이용자 단말기와 유무선 네트워크로 연결되어 잇고, 수리 사업자 단말기 및 이용자 단말기의 요청에 대해서 응답하고 정보를 제공하며, 자동차 수리 서비 스 웹사이트를 관리 및 운영하며, 자동차 수리 서비스 어플리케이션을 제공한다. 상기 전문분야 데이터베이스는 자동차 수리의 전문분야에 매칭되어서 수리 사업자의 정보가 저장되어 있는 저장매체이다. 다음은 상기와 같은 구성을 가지는 본 발명의 일 실시예에 의한 자동차 수리 서비스 방법에 대하여 기술한다. 먼저 사전 수행 단계로서 중개 서버에 전문 수리 사업자로 등록되는 단계가 수행된다. 즉, 수리 사업자 단말기로부터 중개 서버로 수리 사업자 단말기의 유저인 수리 사업자의 기본 정보 및 자동차 수리 전문분야(이하, \"수리 전문분야\") 정보를 전송하여 전문 수리 사업자로 등록 신청이 수행 된다(S210). 여기서 상기 수리 사업자의 기본 정보는 명칭, 주소, 전화번호이다. 상기 수리 전문 분야는, 예컨대, 판금 및 도장 분야, 광택 분야, 유리 분야, 타이어, 휠 분야, 엔진 분야, 변속 기 분야, 부품 교환 분야, 자동차 액세사리 분야를 포함한다. 그리고, 중개 서버는 수리 사업자 단말기로부터 전문 수리 사업자의 등록 신청이 있는 경우, 등록 신 청한 수리 사업자의 수리 전문분야에 일치하는 전문분야를 상기 전문분야 데이터베이스에서 탐색하고, 탐 색한 수리 전문분야의 필드에 신청한 수리 사업자 정보를 수리 전문분야에 매칭하여서 저장한다(S212). 상기와 같이 전문 수리 사업자가 수리 전문부양 별로 매칭되어서 저장된 상태에서 이제 자동차 수리 서비스 신 청 단계가 수행된다. 이용자 단말기가 \"수리 대상 정보\"와 이용자 단말기의 유저인 서비스 이용자의 기본 정보를 중개 서 버로 전송하여 자동차 수리 서비스를 요청한다(S214). 상기 수리 대상 정보는 수리 부위(예컨대 앞범퍼, 타이어 등의 수리를 요하는 대상)와 수리 조건(순정품 사용, 대제품 사용 등)을 포함한다. 수리 대상 정보를 전송하는 방법으로는 예컨대 수리 부위를 촬영한 이미지를 전송하거나 또는 텍스트를 전송하 여 수행될 수 있다. 상기 서비스 이용자의 기본 정보는 예컨대 휴대폰 전화번호이다. 그리고, 중개 서버는 수신한 \"수리 대상 정보\"를 기초로 이용자 단말기가 요청한 자동차 수리 서비스 의 \"수리 전문분야\"를 확정한다(S216). 중개 서버가 \"수리 전문분야\"를 확정하는 방법은 수신한 \"수리 대상정보\"의 이미지데이터와 중개 서버 의 내부에 기 등록되어 있는 수리 대상의 표준 이미지데이터를 비교 및 판단하여 확정할 수 있다. 그리고, 수리 대상정보가 텍스트인 경우에는 수신한 \"수리 대상정보\"의 텍스트데이터와 중개 서버의 내부 에 기 등록되어 있는 수리 대상의 표준 정보데이터를 비교 및 판단하여 확정할 수 있다. 한편, 표준 데이터와의 비교에 의해서 수리 전문분야를 확정하는 방식 외에 인공지능 프로그램의 반복되는 학습 에 의해서 수행될 수도 있을 것이다. 다음으로, 상기와 같이 수리 전문분야를 확정한 중개 서버는 전문분야 데이터베이스를 탐색하여 상기 확정된 수리 전문분야에 매칭되어서 저장되어 있는 수리 사업자를 하나 또는 복수로 추출하여 선택한다(S218). 중개 서버는 선택된 수리 사업자의 수리 사업자 단말기로 상기 수리 대상 정보를 전송한다(S220). 수리 대상 정보를 수신한 수리 사업자 단말기는 수리 견적 정보를 중개 서버로 전송한다(S222). 그리고, 중개 서버는 수리 사업자 단말기로부터 수신한 수리 견적 정보를 수리 서비스를 요청한 이용 자 단말기로 전송(전달)한다(S224). 다음으로 수리 견적 정보를 수신한 이용자 단말기는 수신한 견적 정보에 대한 수락 또는 거절의 응답 정보 를 중개 서버로 전송한다(S226). 중개 서버가 이용자 단말기로부터 수락의 응답 정보를 수신한 경우(S228), 수리 사업자 단말기 로 이용자 단말기의 유저인 서비스 이용자(신청자)의 정보(전화번호)와 함께 중개 승인 정보를 전송하고, 동시에 이용자 단말기로 견적 승인된 수리 사업자의 정보(수리 사업자의 주소와 전화번호)와 중개 승인 정 보를 전송한다(S230). 한편, 다른 실시예에 의하면, 상기 수리 사업자 단말기로부터 중개 서버로 전문 수리 사업자로 등록 신청이 수행되는 단계(S210)는 수리 사업자 단말기의 유저인 수리 사업자와 연관된 중고차 매매단지의 정 보(명칭)를 전송하는 단계를 더 포함하여 구성된다. 즉, 수리 사업자 단말기가 전문 수리 사업자로 등록 신청을 하는 경우 수리 전문분야 및 기본 정보 외에 중과 매매단지 정보(명칭)을 함께 전송한다. 여기서 중개 서버는 수리 사업자 단말기로부터 중고차 매매단지 정보를 수신한 경우, 수신한 중고차 매매단지 정보에 매칭하여서 수리 사업자의 정보를 매칭하여 매매단지 데이터베이스에 저장한다. 그리고, 중개 서버는 중고차 매매단지 정보를 전송한 수리 사업자 단말기에 대해서는 수리 사업자 단 말기의 유저인 수리 사업자에 대해서 수리 서비스의 인세티브를 제공하기 위해서 \"우수 사업자\"로 선정하 는 것을 특징으로 한다. 그리고, 중개 서버는 우수 사업자로 선정된 수리 사업자의 견적 정보에는 우수 사업자임을 표시하여 이용 자 단말기로 전송하는 것을 특징으로 한다. 수리 사업자가 중고차 매매단지와 연관성이 있는 경우에는 중고차 매매단지에 귀속된 중고차 매매사업자와의 연관성이 있고(기 거래 내역이 있거나 근거리일 확률이 매우 높다), 중고차 매매단지와의 기 거래에서 중고차 수리 비용을 매우 저렴하게 제공했을 가능성이 매우 크므로, 중고차 매매단지와 연관성이 있는 수리 사업자의 경우에는 수리 중고차의 제공 물량이 많은 경우 수리 비용을 저렴하게 할 수 있게 된다. 그리고, 상기 수리 사업자와 연관된 중고차 매매단지는, 수리 사업자가 기 수리 거래가 이력이 있는 중고차 매 매사업자(중고차 매매상사)가 귀속된 중고차 매매단지인 것을 특징으로 한다. 즉, 이 경우에는 수리 사업자와 중고차 매매단지에 귀속된 중고차 매매사업자 간에 중고차 수리 서비스의 거래 이력이 있는 경우, 그 중고차 매매사업자가 속한 중고차 매매단자가 된다. 그리고, 상기 수리 사업자와 연관된 중고차 매매단지는, 수리 사업자가 중고차 매매단지에 귀속된 중고차 매매 사업자(중고차 매매상사)의 중고차를 수리한 이력이 없는 경우에는, 수리 사업자(CR)와 최인접 거리에 위치한 중고차 매매단지인 것을 특징으로 한다. 한편, 상기 수리 사업자 단말기의 유저인 수리 사업자와 연관된 중고차 매매단지의 정보(명칭)를 전송하는 방식으로는, 예컨대 중개 서버가 제공하는 화면에서 중고차 매매단지를 선택하는 방식으로 수행될 수도 있 고, 또는 수리 사업자 단말기가 중고차 매매단지의 명칭 정보를 직접 전송함으로써 수행될 수도 있다. 그리고, 실시예에 따라서는 상기 중개 승인 정보가 전송되는 단계(S230) 수행 후에 이용자 단말기가 수리 서비스 평점 정보를 중개 서버에 전송하는 단계(S310)가 수행된다. 이후, 중개 서버는 수신한 서비스 평점 정보를 서비스를 제공한 수리 사업자에 매칭하여서 저장하고 또한 서비스를 제공한 수리 사업자가 속한 중고차 매매단지(CS)에 매칭하여서 매매단지 별로 저장한다(S320). 그리고, 상기 수락 또는 거절의 응답 정보를 전송하는 단계(S226)는 견적 정보가 하나인 경우에는 당해 하나의 견적 정보에 대하여 수락 또는 거절의 응답 정보를 전송하고, 견적 정보가 복수인 경우에는 복수의 견적 정보 중에서 하나를 선택하여 수락 메시지를 전송하거나 또는 복수의 견적을 모두 거절하는 거절 메시지를 전송하여 서 응당 정보를 전송하는 것을 특징으로 한다. 한편, 실시예에 따라서는 각 전문분야에 등록된 수리 사업자의 수리 사업자 단말기는 역경매 방식으로 견 적 정보를 제공할 수도 있다. 이와 같이 본 발명에 따른 바람직한 실시예를 살펴보았으며, 앞서 설명된 실시예 이외에도 본 발명이 그 기술적"}
{"patent_id": "10-2020-0164537", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것은 해당 기술분야에 있어 서 통상의 지식을 가진 사람에게는 자명한 것이다. 그러므로, 상술한 실시예는 제한적인 것이 아니라 예시적인 것으로 이해해야만 한다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 청구범위에 의하여 나타내어지며, 청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석 되어야 한다."}
{"patent_id": "10-2020-0164537", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 자동차 수리 중개 서비스 방법을 구현하기 위한 자동차 수리 중개 서비스 시스템의 블록 구성도이다. 도 2는 본 발명의 일 실시예에 의한 자동차 수리 중개 서비스 방법이 적용되기 위한 중고차 매매단지(CS)와 자 동차 수리 사업자(CR)와의 지리적 연관성을 나타내기 위한 개념도이다. 도 3은 본 발명의 일 실시예에 의한 자동차 수리 중개 서비스 방법의 흐름도이다. 도 4는 본 발명의 일 실시예에 의한 자동차 수리 중개 서비스 방법의 다른 흐름도이다."}
