{"patent_id": "10-2021-0096227", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0014998", "출원번호": "10-2021-0096227", "발명의 명칭": "어린이 차량 통학을 위한 통합 안전 관리 시스템 및 그 방법", "출원인": "주식회사 에어위드", "발명자": "이영준"}}
{"patent_id": "10-2021-0096227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "어린이 차량 통학을 위한 통합 안전 관리 시스템에 있어서:통학 차량의 내부에 설치되고, 어린이의 승하차 시에, 인공지능을 기반으로 딥러닝하여 얼굴을 인식하여 얼굴영상 데이터를 획득하고, 열화상을 통해 승하차 중인 어린이의 체온을 측정하는 얼굴 인식 열화상 카메라;상기 통학 차량에 설치되어 상기 얼굴 인식 열화상 카메라로부터 얼굴 영상 데이터와 체온 정보를 받아들이고,체온 정보로부터 발열 상태가 판별되면, 상기 통학 차량의 관리자에게 발열 상태 확인 및 재측정하도록 안내하고, 재측정된 체온 정보가 발열 상태이면, 해당 어린이를 귀가 조처하도록 안내하는 안내 정보를 출력하는 안전제어 장치; 및통신망을 통하여 상기 안전 제어 장치로부터 얼굴 영상 데이터와 체온 정보를 받아들여서 저장 관리하며, 얼굴영상 데이터를 통해 어린이의 얼굴을 인식하여 기등록된 어린이 정보로부터 해당 어린이 정보를 추출하여 승하차 및 등원 여부를 판별하고, 체온 정보가 발열 상태로 판별되어 상기 통학 차량의 관리자 단말기로부터 해당어린이의 귀가 조처에 따른 조처 정보가 전송되면, 해당 어린이의 보호자 단말기로 귀가 조처에 따른 알림 서비스를 제공하도록 처리하는 안전 관리 서버를 포함하는 것을 특징으로 하는 어린이 차량 통학을 위한 통합 안전관리 시스템."}
{"patent_id": "10-2021-0096227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 통합 안전 관리 시스템은,상기 통학 차량의 실내에 설치되고, 상기 통학 차량의 실내의 공기질 정보를 측정하는 실내 공기질 센서;상기 통학 차량의 실외에 설치되고, 상기 통학 차량의 이동 중에 외부의 공기질 정보를 측정하는 실외 공기질센서;상기 통학 차량의 내부에 설치되고, 상기 통학 차량의 실내 공기를 정화시키는 공기 정화 장치; 및상기 통학 차량의 등원 장소 주변에 설치되고 상기 등원 장소의 주변 공기질 정보를 측정하는 주변 공기질센서;를 더 포함하되,상기 안전 제어 장치는 실내 공기질 정보가 기준치 이상으로 나쁜 상태이면, 상기 공기 정화 장치가 구동되도록제어하고, 통신망을 통하여 실외 공기질 정보와 주변 공기질 정보를 모니터링하도록 상기 안전 관리 서버로 전송하고;상기 안전 관리 서버는 실외 및 주변 공기질 정보 각각이 기준치 이상으로 나쁜 상태이면, 상기 보호자 단말기로 알림 서비스를 제공하도록 처리하고, 실외 및 주변 공기질 정보를 대기 오염도 지도 상에 실시간으로 표시하여 모니터링하도록 하고, 환경 정책에 반영하도록 관련 기관 시스템으로 실외 및 주변 공기질 정보를 제공하도록 처리하는 것을 특징으로 하는 어린이 차량 통학을 위한 통합 안전 관리 시스템."}
{"patent_id": "10-2021-0096227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 또는 청구항 2에 있어서,상기 통합 안전 관리 시스템은,상기 통학 차량의 운행에 따른 운행 정보를 측정하는 운행 기록 장치;를 더 포함하되,공개특허 10-2023-0014998-3-상기 안전 제어 장치는 상기 운행 기록 장치로부터 운행 정보를 전송받아서 상기 통학 차량의 과속, 급제동 및급가속 발생 시, 안전 운행을 유도하는 경보 및 안내 정보를 출력하는 것을 특징으로 하는 어린이 차량 통학을위한 통합 안전 관리 시스템."}
{"patent_id": "10-2021-0096227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 안전 제어 장치는,상기 얼굴 인식 열화상 카메라로부터 어린이가 상기 통학 차량의 승하차 시에 획득된 얼굴 영상 데이터를 전송받아서 상기 통학 차량의 승차 시와 하차 시의 얼굴이 매칭되지 않는 경우가 발생되면, 해당 어린이가 상기 통학 차량에 남아 있는 것으로 판단하여 어린이의 하차 여부를 확인할 수 있도록 안내 정보를 더 출력하는 것을특징으로 하는 어린이 차량 통학을 위한 통합 안전 관리 시스템."}
{"patent_id": "10-2021-0096227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1 또는 청구항 2에 있어서,상기 안전 관리 서버는,상기 안전 제어 장치로부터 얼굴 영상 데이터와 체온 정보, 실외 공기질 정보가 전송되고 상기 주변 공기질 센서로부터 주변 공기질 정보가 전송되면, 어린이의 승하차 여부, 등하원 여부, 체온 정보, 발열 상태, 실외 공기질 및 주변 공기질 정보를 확인할 수 있도록 알림 서비스를 더 제공하는 것을 특징으로 하는 어린이 차량 통학을 위한 통합 안전 관리 시스템."}
{"patent_id": "10-2021-0096227", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 어린이 차량 통학을 위한 통합 안전 관리 시스템 및 그 방법에 관한 것이다. 본 발명의 통합 안전 관 리 시스템은 어린이의 통학 차량을 이용한 등하원 시, 통학 차량에 설치된 얼굴 인식 열화상 카메라를 이용하여 얼굴을 인식하여 승하차 및 등하원 여부 확인과, 발열 상태를 확인한다. 통합 안전 관리 시스템은 통학 차량 내 (뒷면에 계속)"}
{"patent_id": "10-2021-0096227", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 통합 안전 관리 시스템에 관한 것으로, 좀 더 구체적으로 어린이 등하원 시, 차량에 설치된 얼굴 인 식 열화상 카메라를 이용하여 차량의 승하차와 발열 상태를 확인하고, 차량의 운행 기록 장치와 연동해서 차량 의 안전 운행을 유도하여 어린이 안전 사고를 방지하고, 차량의 내외부에 설치된 환경 정보 측정 장치를 이용하 여 차량 내외부의 환경 상태와, 차량 이동 간에 대기 오염 정보를 측정하고, 이를 관련 기관에 제공하여 환경 정책에 반영하도록 하고, 차량을 이용한 등하원 시에 따른 다양한 알림 서비스를 보호자와 선생님께 제공하여 어린이의 안전 통학과 건강 안전을 도모하기 위한 통합 안전 관리 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0096227", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 어린이를 위한 통학 차량은 예를 들어, 어린이집, 유치원, 학교, 학원 등의 기관이나 시설에서 운 영된다. 이러한 통학 차량은 여러 가지 상황에 따라 어린이 안전 관리가 매우 중요하다. 예를 들어, 통학 차량 은 승하차 여부, 날씨나 온도 등의 실내 환경 등에 따라 안전 사고가 발생될 수 있다. 이에 통학 차량에는 차량 승하차 및 운행 과정에서 어린이 안전을 담당하는 교사나 관리자가 함께 탑승하여 승 하차하는 어린이에 대한 각별한 주의가 요구된다. 그럼에도 불구하고, 통학 차량에서의 어린이 관리가 대부분 제한된 담당 교사나 관리자 등의 사람에 의해 이루어지므로, 관리 소홀이나 부주의 등으로 인해 통학 차량에서 의 안전 사고는 지속적으로 발생되고 있는 실정이다. 따라서 통학 차량을 이용하여 등하원 시, 어린이에 대한 안전 사고 예방이나 건강 관리 등을 위한 다양한 기술들이 개발되고 있다. 최근에는 IoT 기술을 어린이 통학 차량에 접목하여, 통학 차량에서의 어린이 안전 관리를 도모하고자 하는 시도 가 꾸준히 이루어지고 있다. 예를 들어, 통학 차량에 센서, 태그, 카메라 등을 설치하고, 이를 이용하여 승하차 중인 어린이를 확인하거나, 통학 차량 내부에서의 움직임 상태를 모니터링하는 기술이 개발되어 있다. 그러나 이러한 기술은 통학 차량에서 발생 가능한 다양한 안전 사고를 예방하거나, 실질적이고 효과적으로 방지하기에 는 여전히 미흡하다. 뿐만 아니라, 대부분의 통학 차량에 적용된 기술은 승하차 위주로 어린이를 관리하는데 중 점되어 있어, 어린이의 등하원 시에 어린이 개인의 건강이나 주변의 환경 상태 등에 따른 어린이 건강 관리가미흡한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 제10-2195802호(공고일 2020년 12월 28일) (특허문헌 0002) 한국 등록특허공보 제10-1981900호(공고일 2019년 08월 28일) (특허문헌 0003) 한국 등록특허공보 제10-2140104호(공고일 2020년 07월 31일) (특허문헌 0004) 한국 등록특허공보 제10-2235840호(공고일 2021년 04월 05일)"}
{"patent_id": "10-2021-0096227", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 통학 차량을 이용하여 등하원하는 어린이의 안전을 도모하기 위한 통합 안전 관리 시스템 및 그 방법을 제공하는 것이다. 본 발명의 다른 목적은 통학 차량을 이용하여 등하원하는 어린이의 건강 상태를 확인하기 위한 통합 안전 관리 시스템 및 그 방법을 제공하는 것이다. 본 발명의 또 다른 목적은 통학 차량의 등하원 시에 안전 운행을 유도하기 위한 통합 안전 관리 시스템 및 그 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0096227", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적들을 달성하기 위한, 본 발명의 어린이 차량 통학을 위한 통합 안전 관리 시스템은 통학 차량을 이용 하여 등하원하는 어린이의 건강 안전과 안전한 통학을 도모하기 위하여, 통학 차량에 설치된 얼굴 인식 열화상 카메라와 실내외 공기질 센서 및 운행 기록 장치를 이용하여 어린이의 승하차 시, 얼굴 인식과 체온 측정, 실내 외 공기질 측정 및 통학 차량의 운행 상태를 모니터링하는데 그 한 특징이 있다. 이와 같은 본 발명의 어린이 차량 통학을 위한 통합 안전 관리 시스템은 어린이의 건강 안전과 통학 차량의 안전 운행을 유도할 수 있다. 이 특징에 따른 본 발명의 어린이 차량 통학을 위한 통합 안전 관리 시스템은, 통학 차량의 내부에 설치되고, 어린이의 승하차 시에, 인공지능을 기반으로 딥러닝하여 얼굴을 인식하여 얼굴 영상 데이터를 획득하고, 열화상 을 통해 승하차 중인 어린이의 체온을 측정하는 얼굴 인식 열화상 카메라; 상기 통학 차량에 설치되어 상기 얼 굴 인식 열화상 카메라로부터 얼굴 영상 데이터와 체온 정보를 받아들이고, 체온 정보로부터 발열 상태가 판별 되면, 상기 통학 차량의 관리자에게 발열 상태 확인 및 재측정하도록 안내하고, 재측정된 체온 정보가 발열 상 태이면, 해당 어린이를 귀가 조처하도록 안내하는 안내 정보를 출력하는 안전 제어 장치; 및 통신망을 통하여 상기 안전 제어 장치로부터 얼굴 영상 데이터와 체온 정보를 받아들여서 저장 관리하며, 얼굴 영상 데이터를 통 해 어린이의 얼굴을 인식하여 기등록된 어린이 정보로부터 해당 어린이 정보를 추출하여 승하차 및 등원 여부를 판별하고, 체온 정보가 발열 상태로 판별되어 상기 통학 차량의 관리자 단말기로부터 해당 어린이의 귀가 조처 에 따른 조처 정보가 전송되면, 해당 어린이의 보호자 단말기로 귀가 조처에 따른 알림 서비스를 제공하도록 처 리하는 안전 관리 서버를 포함한다. 이 특징에 있어서, 상기 통합 안전 관리 시스템은, 상기 통학 차량의 실내에 설치되고, 상기 통학 차량의 실내 의 공기질 정보를 측정하는 실내 공기질 센서; 상기 통학 차량의 실외에 설치되고, 상기 통학 차량의 이동 중에 외부의 공기질 정보를 측정하는 실외 공기질 센서; 상기 통학 차량의 내부에 설치되고, 상기 통학 차량의 실내 공기를 정화시키는 공기 정화 장치; 및 상기 통학 차량의 등원 장소 주변에 설치되고 상기 등원 장소의 주변 공 기질 정보를 측정하는 주변 공기질 센서;를 더 포함하되, 상기 안전 제어 장치는 실내 공기질 정보가 기준치 이 상으로 나쁜 상태이면, 상기 공기 정화 장치가 구동되도록 제어하고, 통신망을 통하여 실외 공기질 정보와 주변 공기질 정보를 모니터링하도록 상기 안전 관리 서버로 전송하고; 상기 안전 관리 서버는 실외 및 주변 공기질 정보 각각이 기준치 이상으로 나쁜 상태이면, 상기 보호자 단말기로 알림 서비스를 제공하도록 처리하고, 실외 및 주변 공기질 정보를 대기 오염도 지도 상에 실시간으로 표시하여 모니터링하도록 하고, 환경 정책에 반영하도록 관련 기관 시스템으로 실외 및 주변 공기질 정보를 제공하도록 처리한다. 이 특징에 있어서, 상기 통합 안전 관리 시스템은, 상기 통학 차량의 운행에 따른 운행 정보를 측정하는 운행 기록 장치;를 더 포함하되, 상기 안전 제어 장치는 상기 운행 기록 장치로부터 운행 정보를 전송받아서 상기 통 학 차량의 과속, 급제동 및 급가속 발생 시, 안전 운행을 유도하는 경보 및 안내 정보를 출력한다. 이 특징에 있어서, 상기 안전 제어 장치는, 상기 얼굴 인식 열화상 카메라로부터 어린이가 상기 통학 차량의 승 하차 시에 획득된 얼굴 영상 데이터를 전송받아서 상기 통학 차량의 승차 시와 하차 시의 얼굴이 매칭되지 않는 경우가 발생되면, 해당 어린이가 상기 통학 차량에 남아 있는 것으로 판단하여 어린이의 하차 여부를 확인할 수 있도록 안내 정보를 더 출력한다. 이 특징에 있어서, 상기 안전 관리 서버는, 상기 안전 제어 장치로부터 얼굴 영상 데이터와 체온 정보, 실외 공 기질 정보가 전송되고 상기 주변 공기질 센서로부터 주변 공기질 정보가 전송되면, 어린이의 승하차 여부, 등하 원 여부, 체온 정보, 발열 상태, 실외 공기질 및 주변 공기질 정보를 확인할 수 있도록 알림 서비스를 더 제공 한다."}
{"patent_id": "10-2021-0096227", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이, 본 발명의 어린이 차량 통학을 위한 통합 안전 관리 시스템은 통학 차량에 설치된 얼굴 인식 열화상 카메라를 이용하여 얼굴을 인식하여 승하차 및 등하원 여부 확인과, 발열 상태를 확인하고, 통학 차량 내외부에 설치된 복수 개의 공기질 센서를 이용하여 통학 차량의 운행 중에 실내 및 실외의 공기질 정보를 측정 하여 모니터링함으로써, 어린이의 통학 차량을 이용한 등하원 시, 어린이의 건강 관리와 안전 관리를 통합 관리 할 수 있다. 또 본 발명의 어린이 차량 통학을 위한 통합 안전 관리 시스템은 인공지능 기반의 얼굴 인식 열화상 카메라를 이용하여 통학 차량의 승하차 시에 인식된 얼굴을 딥러닝하여 얼굴 인식률을 향상시킬 수 있으며, 어린이가 통 학 차량의 승하차 시, 2회에 걸쳐서 얼굴을 인식하여 통학 차량의 승차 시와 하차 시의 얼굴이 매칭되지 않는 경우가 발생되면, 해당 어린이가 통학 차량에 남아 있는 것으로 판단하여 통학 차량의 관리자에게 안내함으로써, 어린이의 차량 방치로 인한 인명 사고를 예방할 수 있다. 또 본 발명의 어린이 차량 통학을 위한 통합 안전 관리 시스템은 통학 차량의 운행 기록 장치를 이용하여 통학 차량의 운행 상태를 모니터링하고, 과속, 급제동, 급가속 등의 이벤트가 발생되면, 안전 운행을 유도하도록 경 보 및 안내를 발생시킴으로서, 통학 차량의 안전 운행을 개도하여 안전 사고를 방지할 수 있다. 또 본 발명의 어린이 차량 통학을 위한 통합 안전 관리 시스템은 통학 차량을 이용한 등하원 시에 따른 다양한 알림 서비스를 보호자와 관리자에게 제공함으로써, 어린이의 보호자가 안심하고 어린이를 등원시킬 수 있으며, 담당 교사, 원장 등의 관리자가 안전 관리에 더욱 집중하도록 하여 어린이의 안전 통학과 건강 안전을 도모할 수 있다. 또한 본 발명의 어린이 차량 통학을 위한 통합 안전 관리 시스템은 차량 내외부의 환경 상태와, 차량 이동 간에 대기 오염 정보를 측정하고, 이를 관련 기관에 제공함으로써, 환경 정책에 반영하도록 할 수 있다."}
{"patent_id": "10-2021-0096227", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예는 여러 가지 형태로 변형될 수 있으며, 본 발명의 범위가 아래에서 서술하는 실시예로 인해 한정되어지는 것으로 해석되어서는 안된다. 본 실시예는 당업계에서 평균적인 지식을 가진 자에게 본 발명을 보 다 완전하게 설명하기 위해서 제공되는 것이다. 따라서 도면에서의 구성 요소의 형상 등은 보다 명확한 설명을 강조하기 위해서 과장되어진 것이다. 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템은 어린이의 통학 차량을 이용한 등하원 시, 통 학 차량에 설치된 얼굴 인식 열화상 카메라를 이용하여 얼굴을 인식하여 승하차 및 등하원 여부 확인과, 발열 상태를 확인하고, 통학 차량 내외부에 설치된 복수 개의 공기질 센서를 이용하여 통학 차량의 운행 중에 실내 및 실외의 공기질 정보를 측정하고, 이를 통해 등하원 중인 어린이의 건강 관리와 안전 관리를 통합 처리한다. 또 본 발명에 따른 통합 안전 관리 시스템은 통학 차량의 운행 기록 장치를 이용하여 통학 차량의 운행 상태를 모니터링하고, 과속, 급제동, 급가속 등의 이벤트가 발생되면, 안전 운행을 유도하도록 경보 및 안내를 발생한 다. 따라서 본 발명의 통합 안전 관리 시스템은 어린이의 등하원 시에 안전 사고를 방지하고, 통학 차량의 안전 운 행을 개도하며, 차량 내외부의 환경 상태와, 차량 이동 간에 대기 오염 정보를 측정하고, 이를 관련 기관에 제 공하여 환경 정책에 반영하도록 하고, 차량을 이용한 등하원 시에 따른 다양한 알림 서비스를 보호자와 관리자 에게 제공하여 어린이의 안전 통학과 건강 안전을 도모할 수 있다. 이하 첨부된 도 1 내지 도 5를 참조하여 본 발명의 실시예를 상세히 설명한다. 도 1은 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 네트워크 구성을 도시한 블록도이고, 도 2는 도 1에 도시된 안전 관리 서버의 구성을 나타내는 블록도이다. 도 1 및 도 2를 참조하면, 본 발명의 통합 안전 관리 시스템은 어린이가 예를 들어, 어린이집, 유치원, 학교, 학원 등의 장소로 통학 차량을 이용하여 등하원 시에 어린이의 안전을 도모하기 위하여, 통학 차량 에 설치된 얼굴 인식 열화상 카메라를 이용하여 어린이의 등하원 시, 통학 차량의 승하차에 따 른 어린이의 얼굴 인식 및 체온을 측정하여 등하원 여부 및 발열 상태를 확인하고, 발열 시에 통학 차량의 담당 교사 즉, 관리자가 발열 상태를 재검사하여 발열이 확인되면, 해당 어린이를 귀가 조처하도록 한다. 또 본 발명의 통합 안전 관리 시스템은 통학 차량의 내부에 설치된 실내 공기질 센서를 이용하여 통학 차량의 실내 공기질 예를 들어, 총부유세균 농도, 미세먼지 농도, 이산화탄소 농도, 휘발성 유기화합 물(VOC) 농도, 오존 농도 등을 실시간으로 측정하고, 이를 통해 실내 공기의 오염도가 나쁜 상황이면, 공기 정 화 장치를 구동시켜서 통학 차량의 실내 공기를 정화시키고, 통학 차량의 외부에 설치된 실외 공기질 센서를 이용하여 이동 중인 통학 차량의 실외 공기질을 실시간으로 측정하여 이동 경로 상의 대기 오염도를 실시간으로 업데이트한다. 이에 통합 안전 관리 시스템은 실시간으로 업데이트되는 대기 오염 도를 관련 기관 예를 들어, 지방 자치 단체, 환경부 등으로 제공한다. 또 본 발명의 통합 안전 관리 시스템은 통학 차량의 운행 기록 장치와 연동해서 운행 중인 통학 차량의 운행 상태를 모니터링하고, 과속, 급제동, 급가속 등의 이벤트가 발생되면, 안전 운행하도록 경보 및 안내한다. 따라서 본 발명의 통합 안전 관리 시스템은 통학 차량을 이용한 등하원 시에 어린이의 발열 상태와 통 학 차량의 실내외 공기 오염도를 측정 및 모니터링하여 어린이의 건강 안전을 도모하고, 통학 차량의 운행 상태를 모니터링하여 운전자에게 안전 운행을 유도하며, 통학 차량의 이동 중에 측정한 대기 오염도 를 관련 기관에 제공하여 환경 정책에 반영하도록 한다. 이를 위해 본 발명의 통합 안전 관리 시스템은 통학 차량, 관리자 단말기, 보호자 단말기 및 안전 관리 서버를 포함한다. 또 본 발명의 통합 안전 관리 시스템은 관련 기관 시스템을 더 포함 할 수 있다. 통학 차량에는 얼굴 인식 열화상 카메라, 실내 및 실외 공기질 센서(120, 150), 공기 정화 장치 , 운행 기록 장치 및 안전 제어 장치를 포함한다. 안전 관리 서버는 예를 들어, 어린이집, 유치원, 학교, 학원 등의 출입구 등에 설치되어 주변 공기질을 실시간 측정하는 적어도 하나의 주변 공기질 센 서와 연결된다. 이러한 안전 제어 장치, 관리자 단말기, 보호자 단말기, 관련 기관 시스템 및 안전 관리 서버들 각각은 통신망에 연결된다.구체적으로, 통신망은 예를 들어, 무선 통신망, 이동 통신망, 로라(Lora) 통신망 등을 포함하고, 이들 각각 의 단일 통신망 또는 혼합된 통신망으로 구비된다. 통신망은 안전 제어 장치, 관리자 단말기, 보 호자 단말기 및 관련 기관 시스템들 각각과 안전 관리 서버가 상호 데이터 통신이 이루어지도록 연결된다. 얼굴 인식 열화상 카메라는 인공지능(AI)을 기반으로 어린이의 얼굴 인식 및 열화상 감지가 가능한 카메라 로 구비되고, 인식된 얼굴을 계속적으로 딥러닝하여 얼굴 인식률을 향상시킨다. 얼굴 인식 열화상 카메라 는 예를 들어, 케이블, 와이파이 등의 유무선 네트워크를 통해 안전 제어 장치와 전기적으로 연결된다. 얼 굴 인식 열화상 카메라는 통학 차량의 내부 예를 들어, 출입구 내측에 설치되어 승하차 시에 어린이 의 얼굴을 인식하여 얼굴 영상 데이터를 획득하고, 열화상을 이용하여 어린이의 체온을 측정한다. 즉, 얼굴 인 식 열화상 카메라는 어린이가 승차 시, 얼굴 영상 데이터와 체온 정보를 획득하여 통학 차량의 승차 와 어린이의 발열 상태를 확인하도록 하고, 통학 차량이 등원 장소 예를 들어, 어린이집에 도착되어 어린 이가 하차 시, 얼굴 영상 데이터와 체온 정보를 획득하여 통학 차량의 하차와 어린이의 등원 상태를 확인 하도록 한다. 이 때, 얼굴 인식 열화상 카메라는 어린이가 통학 차량의 승하차 시에 얼굴을 인식하고, 이를 인공지능(AI) 기반으로 딥러닝하여 어린이에 대한 얼굴 인식률을 높일 수 있다. 또 얼굴 인식 열화상 카메라는 얼굴 인식을 통해 어린이의 마스크 착용 여부를 판단할 수 있다. 얼굴 인식 열화상 카메라는 어린이의 등원 여부 및 승하차 여부를 확인할 수 있도록 승하차 시에 획득된 얼굴 영상 데이터와 체온 정보를 안전 제어 장치로 전송한다. 이 때, 얼굴 인식 열화상 카메라는 어 린이가 통학 차량의 승하차 시, 2회에 걸쳐서 얼굴을 인식하여 얼굴 영상 데이터를 획득하고, 획득된 얼굴 영상 데이터를 안전 제어 장치로 전송한다. 따라서 얼굴 인식 열화상 카메라는 어린이의 얼굴 인식을 통하여 통학 차량의 승하차 및 등원 여부를 확인할 수 있도록 제공하여, 통학 차량의 승차 시와 하차 시의 얼굴이 매칭되지 않는 경우가 발생되면, 해당 어린이가 통학 차량에 남아 있는 것으로 판단하여 어린 이의 차량 방치로 인한 인명 사고를 예방할 수 있다. 실내 공기질 센서는 통학 차량의 내부에 적어도 하나가 설치되어 통학 차량의 운행 중 실내 공 기질을 실시간으로 측정한다. 실내 공기질 센서는 예를 들어, 케이블, 와이파이 등의 유무선 네트워크를 통해 안전 제어 장치와 전기적으로 연결된다. 실내 공기질 센서는 측정된 통학 차량의 실내 공 기질에 대한 감지 정보(즉, 실내 공기질 정보) 예를 들어, 총부유세균 농도, 미세먼지 농도, 이산화탄소 농도, 휘발성 유기화합물(VOC) 농도, 오존 농도 등을 실시간으로 안전 제어 장치로 전송한다. 공기 정화 장치는 통학 차량의 내부에 설치되어 통학 차량의 내부 공기를 정화시킨다. 공기 정 화 장치는 다양한 방식 예를 들어, 자외선, 음이온, 플라즈마 등을 발생시켜서 통학 차량의 실내 공 기를 살균, 제균, 탈취 및 정화 처리하거나, 필터 등을 이용하여 통학 차량의 실내 공기를 정화시킬 수 있 다. 공기 정화 장치는 실내 공기질 센서에 의해 측정된 실내 공기질 정보가 기준치 이상으로 나쁜 상 태이면, 안전 제어 장치의 제어에 대응하여 구동된다. 이러한 공기 정화 장치는 이미 다양한 기술이 공개되어 있으므로 여기서 구체적인 설명은 생략한다. 운행 기록 장치(Digital Tacho Graph : DTG)는 통학 차량에 설치되어 차량 운행에 따른 운행 정보를 기록하는 장치로, 통학 차량의 운행에 따라 운전 습관과 관련된 운행 정보 예를 들어, 과속, 급제동, 급가 속 등의 정보를 실시간으로 획득 및 저장한다. 이러한 운행 기록 장치는 교통 안전법 제9조 및 제55조에 의해 2021년 1월 1일부로 대형 상용차 예컨대, 통학 차량에 장착 의무화가 실행되고 있으므로, 대부분의 통학 차량에 기설치되어 있다. 운행 기록 장치는 유선 네크워크(예컨대, CAN 통신)를 통해 안전 제어 장치 와 연결되어 실시간으로 운행 정보를 안전 제어 장치로 전송한다. 실외 공기질 센서는 통학 차량의 외부에 적어도 하나가 설치되어 통학 차량의 운행 중 실외 공 기질을 실시간으로 측정한다. 실외 공기질 센서는 예를 들어, 케이블, 와이파이 등의 유무선 네트워크를 통해 안전 제어 장치와 전기적으로 연결된다. 실외 공기질 센서는 측정된 통학 차량의 실외 공 기질에 대한 감지 정보(즉, 실외 공기질 정보) 예를 들어, 총부유세균 농도, 미세먼지 농도, 이산화탄소 농도, 휘발성 유기화합물(VOC) 농도, 오존 농도 등을 실시간으로 안전 제어 장치로 전송한다. 안전 제어 장치는 통학 차량에 설치되고, 예컨대, 유무선 네트워크를 통해 얼굴 인식 열화상 카메라 , 실내 공기질 센서, 공기 정화 장치, 운행 기록 장치 및 실외 공기질 센서들과 전기 적으로 연결된다. 안전 제어 장치는 상술한 얼굴 인식 열화상 카메라, 실내 공기질 센서, 공기 정화 장치, 운행 기록 장치 및 실외 공기질 센서들 각각의 기능이 상호 유기적으로 처리되도록제어한다. 이를 위해 안전 제어 장치는 도면에 도시되지 않았으나, 표시 패널, 스피커 등을 포함하는 단말 기 형태로 구비되어, 얼굴 인식 열화상 카메라, 실내 공기질 센서, 공기 정화 장치, 운행 기록 장치 및 실외 공기질 센서들 각각의 기능이 처리되는 과정에 따라 승하차하는 어린이의 얼굴 영상과 열화상을 표시하고, 다양한 안내 메시지, 경고 메시지 등을 표시하거나 음성으로 출력할 수도 있다. 물론 안전 제어 장치는 얼굴 인식 열화상 카메라와 일체형으로 된 단말기 형태로도 구비될 수 있다. 안전 제어 장치는 얼굴 인식 열화상 카메라로부터 획득된 얼굴 영상 데이터와 체온 정보를 통신망 을 통하여 안전 관리 서버로 전송한다. 안전 제어 장치는 어린이가 통학 차량의 승하차 시 에 측정된 체온 정보를 모니터링하여 발열 상태로 판별되면, 해당 어린이가 발열 상태임을 알려주는 안내 메시 지를 음성 출력하여 통학 차량의 담당 교사 즉, 관리자에게 안내한다. 이에 해당 관리자는 얼굴 인식 열화 상 카메라를 통해 해당 어린이의 체온을 재측정하거나, 별도로 구비된 휴대용 체온 측정 장치(미도시됨)를 이용하여 재측정하여 발열 상태로 확인되면, 해당 어린이를 귀가 조처하고, 관리자 단말기를 이용하여 해 당 어린이가 발열로 인해 귀가 조처했음을 통보하는 문자 메시지 등의 조처 정보를 안전 관리 서버로 전송 한다. 안전 제어 장치는 얼굴 인식 열화상 카메라로부터 어린이가 통학 차량의 승하차 시에 인식된 얼 굴 영상 데이터를 전송받아서, 어린이의 등원 여부를 판별하도록 안전 관리 서버로 전송한다. 안전 제어 장치는 얼굴 인식 열화상 카메라로부터 어린이의 얼굴 영상 데이터를 통학 차량의 승하차에 따 라 2회에 걸쳐서 전송받아서 통학 차량의 승차 시와 하차 시의 얼굴이 매칭되지 않는 경우가 발생되면, 해 당 어린이가 통학 차량에 남아 있는 것으로 판단하고, 어린이의 차량 방치로 인한 인명 사고를 예방할 수 있도록 어린이의 하차 여부를 확인하라는 음성 안내 메시지를 출력하여 통학 차량의 관리자에게 안내한다. 안전 제어 장치는 실내 및 실외 공기질 센서(120, 150)들 각각으로부터 감지된 실내 및 실외 공기질 정보 를 통신망을 통하여 안전 관리 서버로 전송한다. 안전 제어 장치는 실내 공기질에 대한 감지 정 보를 모니터링하여 기준치 이상으로 나쁜 상태로 판별되면, 실내 공기질을 개선하기 위해 공기 정화 장치 를 제어하여 구동시킨다. 여기서 안전 제어 장치는 공기 정화 장치를 구동시키기 위해 직접 제어하지 않고, 통학 차량의 전자 제어 장치(ECU)(미도시됨)와 연동되어 공기 정화 장치를 제어할 수도 있다. 물론 안전 제어 장치는 스피커 등을 이용하여 운전자에게 공기 정화 장치를 구동하도록 안내 메시지 를 출력할 수도 있다. 안전 제어 장치는 운행 기록 장치로부터 운행 정보를 전송받아서 통학 차량의 운행 중 과속, 급 제동, 급가속 등의 이벤트가 발생되는지를 판별하고, 이벤트가 발생되면, 운전자에게 안전 운행하도록 경보 및 안내 메시지를 출력한다. 안전 제어 장치는 통학 차량의 운행 중 운행 정보를 통신망을 통해 안 전 관리 서버로 전송한다. 주변 공기질 센서는 등원 장소 예를 들어, 어린이집, 유치원, 학교, 학원 등의 출입구 등의 주변에 적어도 하나 설치된다. 주변 공기질 센서는 예를 들어, 유선 네트워크 등을 이용하여 안전 관리 서버에 연결 된다. 주변 공기질 센서는 주변의 공기질을 실시간으로 측정하고, 측정된 주변 공기질에 대한 감지 정보 즉, 주변 공기질 정보(예를 들어, 총부유세균 농도, 미세먼지 농도, 이산화탄소 농도, 휘발성 유기화합물(VOC) 농도, 오존 농도 등)를 안전 관리 서버로 전송한다. 관리자 단말기는 통학 차량의 담당 교사 등이 구비하는 모바일 장치로, 예를 들어, 스마트 폰으로 구 비된다. 관리자 단말기는 통신망을 통하여 안전 관리 서버와 연결된다. 관리자 단말기는 안 전 관리 서버와 연동되어 어린이의 등하원 시에 안전 관리를 위한 애플리케이션 즉, 어린이 안전 관리 프 로그램이 설치된다. 관리자 단말기는 얼굴 인식 열화상 카메라로부터 측정된 체온 정보가 발열 상태 가 확인되면, 해당 어린이를 귀가 조처하고, 어린이 안전 관리 프로그램을 이용하여 이에 대한 정보를 안전 관 리 서버로 전송한다. 관리자 단말기는 안전 관리 서버로부터 귀가 조처에 대한 응답, 어린이의 등원 여부, 승하차 여부, 실내외 및 주변 공기질 상태 등을 안내하는 다양한 안내 메시지를 전송받는다. 이에 따라 관리자는 안내 메시지를 확인하여 어린이의 안전 관리를 위한 조처 예를 들어, 마스크 착용 등을 조처할 수 있다. 보호자 단말기는 어린이의 보호자가 구비하는 모바일 장치로, 예컨대 스마트 폰으로 구비되고, 통신망(1 0)을 통하여 안전 관리 서버와 연결된다. 보호자 단말기는 어린이 안전 관리 프로그램을 이용하여 어 린이의 등하원 여부, 발열 상태, 승하차 여부, 귀가 조처, 실내외 및 주변 공기질 상태 등에 대한 알림 서비스 를 제공받아서 어린이의 등하원 상황을 확인한다. 즉, 보호자 단말기는 안전 관리 서버로부터 통학차량을 이용하여 등하원하는 어린이의 차량 탑승 시간, 차량 하차 시간, 체온 정보, 귀가 조처 여부, 등원 시간, 하원 시간, 실내외 공기질 정보, 주변 공기질 정보 등을 모니터링할 수 있도록 알림 서비스를 제공받는다. 관련 기관 시스템은 예를 들어, 지방 자치 단체와, 환경부 등의 정부 기관 등에 구비되는 통신 가능한 전 자 장치로, 서버 또는 클라이언트 형태로 구비될 수 있다. 관련 기관 시스템은 통신망을 통하여 안전 관리 서버와 연결된다. 관련 기관 시스템은 안전 관리 서버로부터 통학 차량의 운행 중에 측정된 실외 공기질 정보를 전송받는다. 따라서 관련 기관은 안전 관리 서버로부터 전송된 실외 공기질 정 보를 모니터링 및 분석하여 실외의 공기 오염도와 공기 오염원을 분석 및 파악하여 추후 환경 정책에 반영하도 록 조처할 수 있다. 그리고 안전 관리 서버는 예컨대, 등원 장소에 설치되고, 통신망을 통하여 안전 제어 장치, 관리 자 단말기, 보호자 단말기 및 관련 기관 시스템들 각각과 연결된다. 안전 관리 서버는 등 원 장소의 주변에 설치된 적어도 하나의 주변 공기질 센서와 유선 네트워크 등을 통해 연결된다. 안전 관리 서버는 안전 제어 장치로부터 얼굴 영상 데이터와 체온 정보, 실내 및 실외 공기질 정보, 그리고 통학 차량의 운행 정보 등을 실시간으로 전송받아서 관리자 예를 들어, 원장, 담당 교사 등이 모니 터링하도록 처리한다. 안전 관리 서버는 얼굴 영상 데이터를 인식 및 분석하여 얼굴 영상 데이터에 대응하 는 어린이를 추출하고, 이를 통해 해당 어린이의 승하차 여부, 등원 여부 등을 판별한다. 안전 관리 서버 는 얼굴 인식된 어린이의 체온 정보를 통해 발열 상태를 확인하고, 통학 차량의 관리자 단말기로부터 조처 정보가 전송되면, 원장 등의 관리자 단말기와 보호자 단말기로 발열로 인한 귀가 조처됨을 알려 주는 알림 서비스를 제공한다. 안전 관리 서버는 안전 제어 장치로부터 얼굴 영상 데이터와 다양한 정보들이 전송되면, 이를 인공지 능 기반으로 딥러닝하여 어린이의 승하차 여부, 등원 여부, 발열 상태 등을 분석하여 관리자 단말기와 보 호자 단말기로 어린이의 차량 탑승 시간, 차량 하차 시간, 체온 정보, 등원 시간, 하원 시간, 실내외 공기 질 정보, 주변 공기질 정보 등을 모니터링할 수 있도록 알림 서비스를 제공한다. 안전 관리 서버는 발열 상태의 어린이의 보호자 단말기로 발열로 인한 귀가 조처됨을 알려주는 알림 서비스를 제공한다. 안전 관리 서버는 안전 제어 장치로부터 통학 차량의 운행 정보를 전송받아서 모니터링하고, 모 니터링 중 통학 차량이 과속, 급제동, 급가속 등의 이벤트가 발생되면, 운전자에게 안전 운행을 개도하도 록 안전 제어 장치로 경고 및 안내 메시지를 전송한다. 안전 관리 서버는 도 2에 도시된 바와 같이, 서버부와 데이터베이스부로 구성된다. 서버부는 예컨대, 통신망을 통해 통학 차량에 구비되는 안전 제어 장치, 적어도 하나의 주 변 공기질 센서, 복수 개의 관리자 단말기, 복수 개의 보호자 단말기 및 관련 기관 시스템(60 0)들 각각과 접속되어 데이터 통신이 가능하도록 처리하는 웹 서버와 앱 서버, 어린이의 차량 통학 시에 건강 관리와, 안전 사고 예방을 처리하기 위한 하드웨어 및 소프트웨어 플랫폼, 알고리즘 등이 통합된 애플리케이션 서버 등으로 구비된다. 데이터베이스부는 서버부에 의해 처리되는 안전 관리 서버의 제반 처리 과정에 따른 다양한 정 보들을 저장 및 관리한다. 이 실시예에서 데이터베이스부는 안전 관리 서버에 포함되어 있으나, 독립 적인 데이터베이스 서버로 구비될 수도 있다. 이 실시예의 서버부는 제어부, 통신부, 어린이 정보 관리부, 공기질 정보 처리부, 안 전 운행 처리부 및 알림 처리부를 적어도 포함한다. 구체적으로, 제어부는 안전 제어 장치, 주변 공기질 센서, 관리자 단말기, 보호자 단말기 및 관련 기관 시스템들 각각과 연동해서 안전 관리 서버의 제반 동작을 처리하도록 제어한다. 즉, 제어부는 통신부, 어린이 정보 관리부, 공기질 정보 처리부, 안전 운행 처리부, 알림 처리부 및 데이터베이스부들 각각의 기능이 상호 유기적으로 처리되도록 제어한다. 통신부는 예를 들어, 무선 통신 모듈, 이동 통신 모듈 등으로 구비되고, 통신망을 통해 안전 제어 장 치, 주변 공기질 센서, 관리자 단말기, 보호자 단말기 및 관련 기관 시스템들 각각과 연결되어 상호 데이터 통신이 이루어지도록 처리한다. 어린이 정보 관리부는 등원 장소의 어린이들 각각에 대한 다양한 정보 예를 들어, 어린이 얼굴, 어린이 이 름, 나이, 성별, 보호자 이름, 보호자 연락처, 담당 교사, 등원 여부, 승하차 여부 장소 및 시간 등이 포함된 어린이 정보를 생성, 저장 및 관리한다. 어린이 정보 관리부는 안전 제어 장치로부터 얼굴 영상 데이 터와 체온 정보가 전송되면, 이를 통해 인공지능 기반으로 딥러닝하여 해당 어린이의 얼굴 인식 및 매칭시켜서 어린이 정보를 추출하고, 각각의 어린이 정보에 체온 정보를 등록, 관리한다. 어린이 정보 관리부는 체온 정보가 발열 상태이면, 해당 어린이의 어린이 정보에 발열로 인한 귀가 조처 상황을 저장한다. 공기질 정보 처리부는 안전 제어 장치로부터 전송된 통학 차량의 실내 공기질 정보와 실외 공기 질 정보를 저장, 관리한다. 공기질 정보 처리부는 주변 공기질 센서로부터 전송된 등원 장소의 주변 공기질 정보를 저장, 관리한다. 공기질 정보 처리부는 공기질에 대한 기준치를 설정하고, 실내 공기질 정 보와 실외 공기질 정보 및 주변 공기질 정보를 모니터링하여 기준치 이상으로 나쁜 공기질인지를 판별한다. 공 기질 정보 처리부는 실외 공기질 정보와 주변 공기질 정보를 대기 오염도 지도 상에 표출하고, 실시간으로 업데이터되도록 처리한다. 공기질 정보 처리부는 실외 공기질 정보와 주변 공기질 정보를 관련 기관 시스 템으로 전송하도록 처리한다. 안전 운행 처리부는 안전 제어 장치로부터 전송된 통학 차량의 운행 정보를 저장, 관리한다. 안 전 운행 처리부는 운행 정보에서 이벤트가 발생되면, 안전 제어 장치로 안전 운행을 유도하는 경보 및 안내 메시지를 출력하도록 처리한다. 알림 처리부는 어린이가 등하원 시, 통학 차량의 승하차 여부, 발열 상태, 등하원 여부, 공기질 상태 등에 따라 관리자 단말기와 보호자 단말기로 알림 서비스를 제공하도록 처리한다. 알림 처리부 는 통학 차량의 승하차 시, 어린이의 체온 정보가 발열 상태이거나, 등하원 및 승하차 여부에 따라 관리자 단말기와 보호자 단말기로 알림 서비스를 제공하도록 처리한다. 알림 처리부는 통학 차량 의 실내 공기질, 실외 공기질 및 등원 장소의 주변 공기질이 나쁜 상태로 판별되면, 관리자 단말기와 보호 자 단말기로 알림 서비스를 제공하도록 처리한다. 그리고 데이터베이스부는 서버부의 처리 과정에 따른 다양한 정보들 예를 들어, 통학 차량에 대 한 정보 예를 들어, 운전자, 차량 번호, 통신 식별 정보, 운행 노선 등이 포함된 통학 차량 정보, 등원 장 소에 등록되고 얼굴 영상이 포함된 어린이 정보, 통학 차량의 담당 교사, 원장 등에 대한 관리자 정 보, 어린이 각각에 대한 보호자 정보, 통학 차량의 실내, 실외 및 등원 장소의 주변에 대한 공 기질 정보 및 통학 차량의 운행에 따른 운행 정보 등을 적어도 저장 및 관리한다. 상술한 바와 같이, 이 실시예에서 안전 관리 서버는 하나의 등원 장소에 대응하여 구비되어 있으나, 복수 개의 통학 차량, 복수 개의 등원 장소들을 통합 관리하기 위한 구성으로도 구현될 수 있음은 자명하다 하 겠다. 계속해서 도 3 내지 도 5를 이용하여 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 처리 과정을 상세히 설명한다. 이 처리 과정들은 도 1 내지 도 3에 도시된 통합 안전 관리 시스템의 구성에 의해 처리된다. 도 3은 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 얼굴 인식 열화상 카메라를 이용한 안전 관리 수순을 나타내는 흐름도이다. 도 3을 참조하면, 본 발명의 통합 안전 관리 시스템은 단계 S700에서 통학 차량에 설치된 얼굴 인식 열 화상 카메라를 이용하여 승차 시에 어린이의 얼굴을 인식하여 얼굴 영상 데이터를 획득하고, 어린이의 체 온을 측정한다. 이 때, 얼굴 인식 열화상 카메라는 어린이가 통학 차량의 승차 시에 얼굴을 인식하고, 이를 인공지능(AI) 기반으로 딥러닝하여 어린이에 대한 얼굴 인식률을 높일 수 있다. 단계 S702에서 안전 제어 장치는 열화상 카메라부터 얼굴 영상 데이터와 체온 정보를 전송받아서 어 린이가 통학 차량의 승하차 여부를 판별하고, 측정된 체온이 발열 상태인지를 판별한다. 이 때, 안전 제어 장치 는 인공지능 기반으로 딥러닝하여 어린이의 얼굴을 인식 및 추출하고, 이를 안전 관리 서버로 전송하 여 등원 장소의 등원 여부를 저장, 관리하도록 제공한다. 판별 결과, 해당 어린이가 발열 상태이면, 이 수순은 단계 S704로 진행하여 안전 제어 장치가 발열 상태임 을 알려주는 경보를 발생하고, 통학 차량의 담당 교사 즉, 관리자에게 발열 상태를 확인하도록 후속 조처 를 안내한다. 이에 단계 S706에서 관리자가 해당 어린이의 체온을 별도로 구비된 휴대용 체온 측정 장치를 이용 하여 재측정하거나, 얼굴 인식 열화상 카메라를 이용하여 재측정한다.단계 S708에서 재측정한 체온이 발열 상태이면, 단계 S710에서 관리자가 해당 어린이를 귀가 조처하고, 이에 대 해 어린이 안전 관리 프로그램을 이용하여 조처 정보를 생성하고, 얼굴 영상 데이터와 체온 정보 및 조처 정보 를 안전 관리 서버로 전송한다. 또 재측정한 체온이 발열 상태가 아니면, 이 수순은 단계 S714로 진행한다. 단계 S712에서 안전 관리 서버는 얼굴 영상 데이터와 체온 정보 및 조처 정보를 모니터링하도록 하여 해당 어린이를 미등원 처리하고, 해당 어린이의 보호자 단말기로 발열로 인해 귀가 조처했음을 안내하는 알림 서비스를 처리한다. 그러나 단계 S702에서 발열 상태가 아니면, 이 수순은 단계 S714로 진행하여 안전 제어 장치가 얼굴 영상 데이터와 체온 정보를 안전 관리 서버로 전송한다. 이 후, 통학 차량이 등원 장소에 도착하여 어린이가 하차하면, 단계 S716에서 얼굴 인식 열화상 카메라를 통해 하차 시의 어린이 얼굴을 인식하여 얼굴 영상 데이터를 획득하고, 체온을 측정한다. 이 때에도 얼굴 인식 열화상 카메라는 어린이가 통학 차량의 하차 시에 얼굴을 인식하고, 이를 인공지능(AI) 기반으로 딥 러닝하여 어린이에 대한 얼굴 인식률을 높일 수 있다. 단계 S718에서 안전 제어 장치는 얼굴 영상 데이터와 체온 정보를 안전 관리 서버로 전송한다. 여기 서 안전 제어 장치는 얼굴 인식 열화상 카메라로부터 어린이가 통학 차량의 승하차 시에 인식된 얼굴 영상 데이터를 전송받아서, 어린이의 등원 여부를 판별하도록 안전 관리 서버로 전송한다. 안전 제어 장치는 얼굴 인식 열화상 카메라로부터 어린이의 얼굴 영상 데이터를 통학 차량의 승하차에 따 라 2회에 걸쳐서 전송받아서 통학 차량의 승차 시와 하차 시의 얼굴이 매칭되지 않는 경우가 발생되면, 해 당 어린이가 통학 차량에 남아 있는 것으로 판단하고, 어린이의 차량 방치로 인한 인명 사고를 예방할 수 있도록 어린이의 하차 여부를 확인하라는 음성 안내 메시지를 출력하여 통학 차량의 관리자에게 안내한다. 이어서 단계 S720에서 안전 관리 서버는 얼굴 영상 데이터와 체온 정보를 모니터링하도록 하여 해당 어린 이를 등원 처리하고, 해당 어린이의 보호자 단말기로 등원하였음을 안내하는 알림 서비스를 처리한다. 이 때, 안전 관리 서버는 관리자 단말기와 보호자 단말기로 통학 차량의 승하차 여부, 승하차 시간, 체온, 귀가 조처 여부, 등하원 시간 등을 확인할 수 있도록 알림 서비스를 처리한다. 도 4는 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 복수 개의 공기질 센서들을 이용한 안전 관리 수순을 나타내는 흐름도이다. 도 4를 참조하면, 본 발명의 통합 안전 관리 시스템은 단계 S730에서 통학 차량의 실내, 실외 및 등원 장소의 주변에 각각 설치된 복수 개의 공기질 센서 즉, 실내 공기질 센서, 실외 공기질 센서 및 주변 공기질 센서들 각각을 통해 통학 차량의 실내, 실외 및 주변의 공기질 정보를 각각 측정한다. 공기질 센서(120, 150, 300)들 각각은 측정된 실내 공기질 정보, 실외 공기질 정보 및 주변 공기질 정보를 안전 제어 장치로 전송한다. 단계 S732에서 안전 제어 장치는 실내 공기질 정보가 기준치 이상으로 나쁜 상태인지를 판별하여 통학 차 량의 실내 공기질이 나쁜 상태이면, 단계 S734로 진행하여 통학 차량의 공기 정화 장치를 구동 시킨다. 이 때, 안전 제어 장치는 공기 정화 장치를 직접 제어하거나, 공기질 정화를 요청하는 안내 메시지를 출력하여 운전자가 공기 정화 장치를 구동시킬 수도 있다. 단계 S736에서 안전 제어 장치는 실내 공기질 센서로부터 측정된 실내 공기질 정보를 안전 제어 장치로 전송하여 실시간으로 통학 차 량의 공기질 상태를 모니터링하여 실내 공기질을 정화하도록 처리한다. 그러나 실내 공기질 정보가 나쁜 상태가 아니면, 이 수순은 단계 S738로 진행하여 실외 공기질 센서를 통 해 통학 차량의 운행 중에 측정된 실외 공기질 정보를 안전 제어 장치를 통해 안전 관리 서버)로 전송하고, 등원 장소의 주변에 설치된 주변 공기질 센서를 통해 측정된 주변 공기질 정보를 안전 관리 서 버로 전송한다. 이에 단계 S740에서 안전 관리 서버는 실외 공기질과 주변 공기질을 모니터링하도록 대기 오염도를 표시하는 전자 지도 즉, 대기 오염도 지도에 실와 공기질과 주변 공기질을 실시간 업데이트하여 표출한다. 단계 S742에서 안전 관리 서버는 실외 공기질 정보와 주변 공기질 정보를 통신망을 통해 관련 기관 시 스템으로 전송한다. 이에 관련 기관에서는 수집된 실외 공기질과 주변 공기질을 대기 오염도 지도를 통해 모니터링하고, 위치별, 시간대별, 요일대별 등으로 정보를 분석하여 공기질을 개선하기 위한 환경 정책 예를 들어, 노후 차량 진입 금지, 특정 시간대에 살수 차량 운행, 집진기 설치, 지속적인 오염 의심 구역 설정 및 관리, CCTV 설치 등을 수립하는데 활용할 수 있도록 한다. 또 단계 S744에서 안전 관리 서버는 공기질 모니터링 중 등원 장소의 주변 공기질이 나쁜 상태이면, 단계 S746으로 진행하여 어린이의 보호자 단말기로 공기질 상태를 알려주어 어린이의 건강 관리와 등원 시 주의 사항(예를 들어, 마스크 착용 알림) 등을 안내하는 알림 서비스를 처리하여 담당 교사나 보호자가 어린이의 등 하원 시의 안전 관리를 모니터링한다. 여기서는 공기질 상태에 대한 안전 관리를 시계열적으로 처리하는 과정으로 설명하고 있으나, 실질적으로 통학 차량의 실내 공기질, 실외 공기질 및 등원 장소의 주변 공기질의 상태를 측정 및 모니터링하는 과정 등은 시계열적인 순서와는 무관하게 동시에 처리된다. 그리고 도 5는 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 운행 기록 장치를 이용한 안 전 관리 수순을 나타내는 흐름도이다. 도 5를 참조하면, 본 발명의 통합 안전 관리 시스템은 단계 S750에서 통학 차량의 운행 시, 운행 기록 장치를 통해 운행 정보를 실시간 측정하고, 안전 제어 장치로 운행 정보를 전송하여 실시간으로 통학 차량의 운행 상황을 모니터링한다. 단계 S752에서 운행 기록 장치는 통학 차량의 운행 중 이벤트 예를 들어, 과속, 급제동, 급가속 등이 발생되면, 단계 S754에서 안전 제어 장치가 안전 관리 서버로 운행 정보를 전송한다. 이에 안전 관리 서버는 단계 S756에서 안전 제어 장치를 통해 경보를 발생시키고 안전 운행을 안내하도록 처리한다. 이상에서, 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 구성 및 작용을 상세한 설명과 도 면에 따라 도시하였지만, 이는 실시예를 들어 설명한 것에 불과하며, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양한 변화 및 변경이 가능하다."}
{"patent_id": "10-2021-0096227", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 네트워크 구성을 도시한 블록도, 도 2는 도 1에 도시된 안전 관리 서버의 구성을 나타내는 블록도, 도 3은 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 얼굴 인식 열화상 카메라를 이용한 안전 관리 수순을 나타내는 흐름도, 도 4는 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 복수 개의 공기질 센서들을 이용한 안전 관리 수순을 나타내는 흐름도, 그리고 도 5는 본 발명에 따른 어린이 차량 통학을 위한 통합 안전 관리 시스템의 운행 기록 장치를 이용한 안전 관리 수순을 나타내는 흐름도이다."}
