{"patent_id": "10-2021-0037053", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0132146", "출원번호": "10-2021-0037053", "발명의 명칭": "척추 측만증 진단장치의 동작방법", "출원인": "(주)디알젬", "발명자": "이재우"}}
{"patent_id": "10-2021-0037053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방사선 촬영장치로부터 피사체를 촬영한 방사선 이미지를 수신하는 단계;인공지능 알고리즘을 통해 상기 방사선 이미지를 분석하여 척추뼈 몸통(vertebral body) 이미지들을 인식하는단계;상기 척추뼈 몸통 이미지들 각각의 크기에 대응하여 생성된 직사각 형상의 척추 블록들을 상기 척추뼈 몸통 이미지들 상에 표시하는 단계;연속된 척추 블록들 중 양단에 위치한 두 개의 척추 블록들의 중심점을 연결한 기준선을 상기 방사선 이미지 상에 표시하는 단계;상기 방사선 이미지에 기설정된 수직선과 상기 기준선이 평행되도록 상기 방사선 이미지를 회전하는 단계;상기 척추 블록들 각각의 중심점과 상기 기준선 사이의 이격 거리를 측정하는 단계;상기 척추 블록들 중 이격 거리가 기준 거리 이상의 값을 갖는 검사대상 블록들을 추출하는 단계;상기 검사대상 블록들 중 클롭앵글 측정을 위한 제1 및 제2 기준 블록들을 결정하는 단계; 및상기 제1 및 제2 기준 블록들의 일변의 연장선에 수직한 선분들이 이루는 각도를 계산하여 상기 클롭앵글을 산출하는 단계를 포함하는 척추 측만증 진단장치의 동작 방법."}
{"patent_id": "10-2021-0037053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 제1 및 제2 기준 블록들을 결정하는 단계는,추출된 검사대상 블록들 중 가장 큰 이격 거리를 갖는 검사대상 블록을 기준으로 상단 및 하단에 위치한 검사대상 블록들을 제1 그룹과 제2 그룹으로 구분하는 단계; 및상기 제1 그룹의 검사대상 블록들 중 가장 많이 뒤틀린 검사대상 블록과, 상기 제2 그룹의 검사대상 블록들 중가장 많이 뒤틀린 검사대상 블록 각각을 상기 제1 기준 블록과 상기 제2 기준 블록으로 선정하는 단계를 포함하는 척추 측만증 진단장치의 동작 방법."}
{"patent_id": "10-2021-0037053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 제1 및 제2 기준 블록들을 선정하는 단계는,상기 제1 및 제2 그룹들에 포함된 검사대상 블록들의 일변이 수평선과 이루는 각도를 측정하는 단계;상기 제1 그룹에 포함된 검사대상 블록들 중 가장 큰 각도를 갖는 검사대상 블록을 상기 제1 기준 블록으로 설정하는 단계; 및상기 제2 그룹에 포함된 검사대상 블록들 중 가장 큰 각도를 갖는 검사대상 블록을 상기 제2 기준 블록으로 설정하는 단계를 포함하는 척추 측만증 진단장치의 동작 방법."}
{"patent_id": "10-2021-0037053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 제1 및 제2 기준 블록들 사이에는 적어도 하나의 검사대상 블록이 배치되는 척추 측만증 진단장치의 동작 방법."}
{"patent_id": "10-2021-0037053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 제1 및 제2 기준 블록들을 결정하는 단계는,적어도 3개의 연속된 검사대상 블록이 존재하는 경우에만 상기 제1 및 제2 블록들을 결정하는 척추 측만증 진단공개특허 10-2022-0132146-3-장치의 동작 방법."}
{"patent_id": "10-2021-0037053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,산출된 클롭앵글이 10°를 초과하는 경우, 상기 방사선 이미지 내 피사체를 척추 측만증으로 진단하는 단계를더 포함하는 척추 측만증 진단장치의 동작 방법."}
{"patent_id": "10-2021-0037053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 척추뼈 몸통 이미지들 각각은 대응하는 각 척추 블록 내부에 배치되는 척추 측만증 진단장치의 동작 방법."}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 척추 측만증 진단장치의 동작 방법은, 방사선 촬영장치로부터 피사체를 촬영한 방사선 이미지를 수신 하는 단계와, 인공지능 알고리즘을 통해 상기 방사선 이미지를 분석하여 척추뼈 몸통(vertebral body) 이미지들 을 인식하는 단계와, 상기 척추뼈 몸통 이미지들 각각의 크기에 대응하여 생성된 직사각 형상의 척추 블록들을 (뒷면에 계속)"}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 척추 측만증 진단장치의 동작방법에 관한 것이다."}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "척추 측만증(scoliosis)은 일자로 곧게 뻗은 정상적인 척추와는 달리 S자 또는 C자 형태로 휘어져 있는 비정상 적인 척추 상태를 의미한다. 척추 측만증은 자세, 운동부족 등 다양한 원인에 의해 발생되는데, 이를 방치할 경 우 디스크 질환, 척추 협착증, 관절통, 관절염 등을 발생시킬 수 있다. 척추 측만증 진단은 엑스레이 검사를 통해 콥스앵글(Cobb's Angle)을 측정하여 이루어진다. 콥스앵글은 척추뼈 들 중 기울어짐이 시작되는 척추뼈와 가장 많이 기울어진 척추뼈를 찾아 각 척추뼈의 수평선을 긋고, 수평선에 수직으로 선을 그어 교점에서의 각도를 의미한다. 콥스앵글 측정은 엑스레이 영상을 기초로 콥스앵글을 측정하는 사람, 측정 방법에 따라 약 10° 정도의 오차가 발생할 수 있다. 이러한 오차 발생은 척추 측만증을 가진 환자에게 척추 측만증 진단을 내릴 수 없는 문제를 발 생시킬 수도 있다."}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적인 과제는, 인공지능 알고리즘을 통해 방사선 이미지를 분석하고, 분석결과를 기초로 척추측만증 검사에 필요한 콥스앵글을 자동으로 측정하는 척추 측만증 진단장치의 동작방법을 제공하는 것이다,"}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 척추 측만증 진단장치의 동작 방법은, 방사선 촬영장치로부터 피사체를 촬영한 방사 선 이미지를 수신하는 단계와, 인공지능 알고리즘을 통해 상기 방사선 이미지를 분석하여 척추뼈 몸통 (vertebral body) 이미지들을 인식하는 단계와, 상기 척추뼈 몸통 이미지들 각각의 크기에 대응하여 생성된 직 사각 형상의 척추 블록들을 상기 척추뼈 몸통 이미지들 상에 표시하는 단계와, 연속된 척추 블록들 중 양단에 위치한 두 개의 척추 블록들의 중심점을 연결한 기준선을 상기 방사선 이미지 상에 표시하는 단계와, 상기 방사 선 이미지에 기설정된 수직선과 상기 기준선이 평행되도록 상기 방사선 이미지를 회전하는 단계와, 상기 척추 블록들 각각의 중심점과 상기 기준선 사이의 이격 거리를 측정하는 단계와, 상기 척추 블록들 중 이격 거리가 기준 거리 이상의 값을 갖는 검사대상 블록들을 추출하는 단계와, 상기 검사대상 블록들 중 클롭앵글 측정을 위 한 제1 및 제2 기준 블록들을 결정하는 단계와, 상기 제1 및 제2 기준 블록들의 일변의 연장선에 수직한 선분들 이 이루는 각도를 계산하여 상기 클롭앵글을 산출하는 단계를 포함한다. 실시 예에 따라, 제1 및 제2 기준 블록들을 결정하는 단계는, 추출된 검사대상 블록들 중 가장 큰 이격 거리를 갖는 검사대상 블록을 기준으로 상단 및 하단에 위치한 검사대상 블록들을 제1 그룹과 제2 그룹으로 구분하는 단계와, 상기 제1 그룹의 검사대상 블록들 중 가장 많이 뒤틀린 검사대상 블록과, 상기 제2 그룹의 검사대상 블록들 중 가장 많이 뒤틀린 검사대상 블록 각각을 상기 제1 기준 블록과 상기 제2 기준 블록으로 선정하는 단계 를 포함할 수 있다. 실시 예에 따라, 제1 및 제2 기준 블록들을 선정하는 단계는, 상기 제1 및 제2 그룹들에 포함된 검사대상 블록 들의 일변이 수평선과 이루는 각도를 측정하는 단계와, 상기 제1 그룹에 포함된 검사대상 블록들 중 가장 큰 각 도를 갖는 검사대상 블록을 상기 제1 기준 블록으로 설정하는 단계와, 상기 제2 그룹에 포함된 검사대상 블록들 중 가장 큰 각도를 갖는 검사대상 블록을 상기 제2 기준 블록으로 설정하는 단계를 포함할 수 있다. 실시 예에 따라, 제1 및 제2 기준 블록들 사이에는 적어도 하나의 검사대상 블록이 배치될 수 있다. 실시 예에 따라, 상기 제1 및 제2 기준 블록들을 결정하는 단계는, 적어도 3개의 연속된 검사대상 블록이 존재 하는 경우에만 상기 제1 및 제2 블록들을 결정할 수 있다. 실시 예에 따라, 상기 척추 측만증 진단장치의 동작 방법은, 산출된 클롭앵글이 10°를 초과하는 경우, 상기 방 사선 이미지 내 피사체를 척추 측만증으로 진단하는 단계를 더 포함할 수 있다. 실시 예에 따라, 상기 척추뼈 몸통 이미지들 각각은 대응하는 각 척추 블록 내부에 배치될 수 있다."}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따른 척추 측만증 진단장치의 동작방법에 의하면, 인공지능 알고리즘을 통해 방사선 이미 지를 분석하고, 분석결과를 기초로 척추측만증 검사에 필요한 콥스앵글을 정밀하게 측정할 수 있다."}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 실시 예에 관하여 첨부도면을 참조하여 상세하게 설명하기로 한다. 다만, 이하에서 설명"}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "되는 실시 예는 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 발명을 쉽게 실시할 수 있을 정도로 상세하게 설명하기 위한 것에 불과하며, 이로 인해 본 발명의 보호범위가 한정되는 것을 의미하지는 않는다. 그 리고 본 발명의 여러 실시 예를 설명함에 있어서, 동일한 기술적 특징을 갖는 구성요소에 대하여는 동일한 도면 부호를 사용하기로 한다. 명세서에서 사용되는 \"부\" 또는 “모듈”이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소 를 의미하며, \"부\" 또는 “모듈”은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 “모듈”은 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\" 또는 “모듈”은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수 도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 “모 듈”은 소프트웨어 구성요소들, 피사체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라 이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 “모듈”들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 “모듈”들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 “모듈”들로 더 분리될 수 있다. 도 1은 본 발명의 실시 예에 따른 척추 측만증 진단시스템의 도면이다. 도 1을 참조하면, 본 발명의 실시 예에 따른 척추 측만증 진단시스템은 방사선 촬영장치와 척추 측만 증 진단장치를 포함한다. 방사선 촬영장치는 피사체(HU)를 통과한 방사선을 검출하여 방사선 이미지를 생성하는 장치로서, 방사선 검출영역에 방사선을 조사하여 피사체(HU)를 투과한 방사선을 기초로 방사선 이미지(IM)를 생성할 수 있다. 방 사선 촬영장치는 유선 또는 무선 통신을 통해 생성된 방사선 이미지(IM)를 척추 측만증 진단장치에 전송할 수 있다. 방사선 이미지(IM)는 척추 측만증을 진단하기 위한 척추의 전면이 촬영된 영상을 의미한다.척추 측만증 진단장치는 방사선 이미지(IM)를 수신받아 척추의 휘어진 정도를 판단하는 콥스앵글(Cobb's Angle)을 측정하고, 측정된 콥스앵글을 기초로 척추 측만증을 진단할 수 있다. 척추 측만증 진단장치는 인공지능 모델을 이용하여 방사선 이미지(IM)에 포함된 척추영역만을 추출할 수 있다. 척추 측만증 진단장치는 척추 영역, 즉 척추뼈 몸통 이미지를 획득하기 위해 다층 퍼셉트론(Multi Layered Perceptron, MLP)을 인공지능 알고리즘으로 이용할 수 있지만, 합성곱신경망(Convolutional Neural Network, CNN)의 일종인 ResNet, U-net, RCNN 등 다양한 아키텍처의 인공지능 모델이 이용될 수도 있다. 척추 측만증 진단장치는 인공신경망의 학습과정을 미리 수행할 수 있고, 기학습된 인공신경망을 이용하여 방사선 이미지(IM)로부터 척추뼈 몸통 이미지만을 추출할 수 있다. 구체적으로, 척추 측만증 진단장치는 방사선 이미지(IM)에 대한 전처리 과정을 통해 이미지 크기조정 및 불필요한 영역을 제거하여 원하는 관심 영역 (Region of interest) 을 찾고, 인공지능 모델에서 설정한 비트수 로 컨버팅 작업을 할 수 있다. 이때, 방사선 이미지(IM)에 노이즈가 있는 경우 제거하는 과정도 동반될 수 있다. 그리고, 척추 측만증 진단장치는 미리 학습된 인공지능 모델을 이용하여 척추 영역을 검출할 수 있는데, 전처리 과정을 통해 변환된 영상을 미리 학습된 인공지능 모델에 입력하여 인공지능 모델이 학습 결과에 따른 출력 이미지를 획득할 수 있다. 이 과정에서 정상적으로 출력이 되는 경우, 출력 이미지는 척추 영역의 강도 (intensity)에 따라 예측 결과가 낮은 곳은 낮은 명도로, 높은 곳은 높은 명도로 표시될 수 있다. 척추 측만증 진단장치는 각 척추 영역, 즉 척추뼈 몸통 이미지를 명확하게 분리 시키기 위하여, 임계 값 (Threshold Value) 처리를 진행할 수 있다. 다음으로 명확한 척추 영역의 좌표를 획득하기 위하여 블롭 디택션 (Blob Detection) 처리를 진행할 수 있다. 척추 측만증 진단장치는 블록 디택션 처리 이후 좌표 평면에서 척추뼈 몸통 이미지의 크기와 위치를 획득할 수 있다. 척추 측만증 진단장치는 척추뼈 몸통 이미지를 인식한 이후, 각 척추뼈 몸통 이미지에 직사각 형상의 척추 블록들을 표시할 수 있는데, 각 척추 블록은 척추뼈 몸통 이미지가 내부에 배치되도록 설정될 수 있다. 즉, 척 추 블록은 척추뼈 몸통 이미지를 외부에 돌출시키지 않는 형태로 설정될 수 있다. 척추 측만증 진단장치는 척추 블록들의 배치를 분석하여 콥스앵글을 측정을 위한 제1 및 제2 기준 블록들 결정할 수 있고, 제1 및 제2 기준 블록들의 일변의 연장선에 수직한 선분들이 이루는 각도를 계산하여 클롭앵글 을 산출할 수 있다. 척추 측만증 진단장치는 산출된 클롭앵글이 10°를 초과하는 경우, 방사선 이미지 내 피사체(HU)에 대해 척추 측만증을 진단할 수 있다. 실시 예에 따라, 척추 측만증 진단장치는 PC(personal computer), 스마트 폰(smart phone), 태블릿 (tablet) PC, 모바일 인터넷 장치(mobile internet device(MID)), 인터넷 태블릿, IoT(internet of things) 장 치, IoE(internet of everything) 장치, 데스크 탑 컴퓨터(desktop computer), 랩탑(laptop) 컴퓨터, 워크스테 이션 컴퓨터, Wibro(Wireless Broadband Internet) 단말, 및 PDA (Personal Digital Assistant) 중 어느 하나 일 수 있다. 도 2는 본 발명의 실시 예에 따른 척추 측만증 진단장치의 동작방법을 설명하기 위한 흐름도이다. 도 2를 참조하면, 척추 측만증 진단장치는 방사선 촬영장치로부터 피사체(HU)를 촬영한 직사각형상의 방사선 이미지(IM)를 수신할 수 있다(S100). 척추 측만증 진단장치는 인공지능 알고리즘을 통해 방사선 이미지(IM)를 분석하여 척추뼈 몸통 이미지들을 인식할 수 있다(S110). 척추 측만증 진단장치는 척추뼈 몸통 이미지들 각각의 크기에 대응하여 생성된 직사각 형상의 척추 블록들 을 척추뼈 몸통 이미지들 상에 표시할 수 있다(S120). 척추 측만증 진단장치는 연속된 척추 블록들 중 양단에 위치한 두 개의 척추 블록들의 중심점을 연결한 기 준선을 방사선 이미지 상에 표시할 수 있다(S130). 여기서 기준선은 척추뼈의 중심이 방사선 이미지의 중심에 위치하도록 방사선 이미지(IM)의 위치를 변환하기 위한 용도로 사용되며, 척추 측만증 진단장치는 방사선 이미지(IM) 내 상단으로부터 첫번째 위치한 척추 블록과 마지막에 위치한 척추 블록의 중심점을 연결하여 기준선을 생성하고, 이를 방사선 이미지(IM) 상에 표시할 수 있다. 척추 측만증 진단장치는 방사선 이미지(IM)에 기설정된 수직선과 기준선이 평행되도록 방사선 이미지(IM) 를 회전시킬 수 있다(S140). 척추 측만증 진단장치는 기준선과 각 척추 블록의 중심이 떨어진 거리를 계산할 수 있고, 척추 블록들 중 이격 거리가 기준 거리 이상의 값을 갖는 척추 블록들을 검사대상 블록들로서 추출할 수 있다(S160). 그리고, 척추 측만증 진단장치는 기준선으로부터 중심점이 가장 많이 떨어진 검사대상 블록을 피크 블록으로 설정 하고, 피크 블록을 기준으로 상단에 위치한 검사대상 블록을 제1 그룹으로 설정하고, 하단에 위치한 검사대상 블록을 제2 그룹으로 설정할 수 있다. 척추 측만증 진단장치는 검사대상 블록들 중 클롭앵글 측정을 위한 제1 및 제2 기준 블록들을 결정할 수 있는데(S170), 여기서, 제1 기준 블록은 제1 그룹의 검사대상 블록들 중 가장 많이 뒤틀린 척추 블록을 의미하 고, 제2 기준 블록은 제2 그룹의 검사대상 블록들 중 가장 많이 뒤틀린 척추 블록을 의미한다. 척추 측만증 진단장치는 제1 및 제2 기준 블록들 사이에 적어도 하나의 검사대상 블록이 존재하는 경우에 만 제1 및 제2 기준 블록들이 정상적으로 결정된 것으로 판단할 수 있다. 또한, 척추 측만증 진단장치는 적어도 3개의 연속된 검사대상 블록이 존재하는 경우에만 제1 및 제2 기준 블록들을 결정할 수 있다. 실시 예에 따라, 척추 측만증 진단장치는 검사대상 블록들의 뒤틀린 정도를 판단하기 위해 검사대상 블록 들의 일변이 수평선과 이루는 각도를 측정할 수 있다. 만약, 척추뼈가 뒤틀리지 않고 곧게 뻗어 있다면 검사대 상 블록의 일변은 수평선과 평행할 것이지만, 척추뼈가 뒤틀렸다면 검사대상 블록의 일변은 수평선과 일정한 각 도를 이루게 될 것이다. 척추 측만증 진단장치는 제1 그룹의 검사대상 블록들 중 가장 큰 각도를 갖는 검사대상 블록을 제1 기준 블록으로 설정하고, 제2 그룹의 검사대상 블록들 중 가장 큰 각도를 갖는 검사대상 블록을 제2 기준 블록으로 설정할 수 있다. 척추 측만증 진단장치는 제1 및 제2 기준 블록들의 일변의 연장선을 설정하고, 연장선에 수직한 선분들이 이루는 각도를 계산하여 클롭앵글을 산출할 수 있다(S180). 여기서, 제1 및 제2 기준 블록들의 일변이란 추간판 과 맞닿는 척추뼈의 단면과 대응되는 변을 의미한다. 만약, 산출된 클롭앵글이 10°를 초과하는 경우, 척추 측만증 진단장치는 방사선 이미지 내 피사체(HU)에 대해 척추 측만증을 진단할 수 있다. 도 3 내지 도 6은 본 발명의 실시 예에 따른 척추 측만증 진단장치가 콥스앵글을 측정하는 방법을 설명하기 위 한 도면이다. 도 3을 참조하면, 척추 측만증 진단장치는 인공지능 모델을 이용하여 방사선 이미지(IM)에 포함된 척추 영 역만을 추출할 수 있다. 즉, 척추 측만증 진단장치는 미리 학습된 인공신경망을 이용하여 방사선 이미지 (IM)로부터 척추뼈 몸통 이미지(BI)만을 추출한 방사선 이미지(IM')를 생성할 수 있다. 척추 측만증 진단장치는 방사선 이미지(IM')에 포함된 척추뼈 몸통 이미지(BI)를 인식한 이후, 각 척추뼈 몸통 이미지(BI)에 직사각 형상의 척추 블록(BL)들을 표시할 수 있는데, 각 척추 블록(BL)은 척추뼈 몸통 이미 지(BI)가 내부에 배치되도록 설정될 수 있다. 즉, 척추 블록(BL)은 척추뼈 몸통 이미지(BI)를 외부에 돌출시키 지 않는 형태로 설정될 수 있다. 도 4를 참조하면, 척추 측만증 진단장치는 연속된 척추 블록들(BL1 내지 BL19) 중 양단에 위치한 두 개의 척추 블록들의 중심점(PO1, PO2)을 연결한 기준선(SL)을 방사선 이미지(IM') 상에 표시할 수 있다. 기준선(SL)은 척추뼈의 중심이 방사선 이미지(IM')의 중심에 위치하도록 방사선 이미지(IM')의 위치를 변환하기 위한 용도로 사용되며, 척추 측만증 진단장치는 방사선 이미지(IM') 내 상단으로부터 첫번째 위치한 척추 블록(BL1)의 중심점(PO1)과 마지막에 위치한 척추 블록(BL19)의 중심점(PO2)을 연결하여 기준선(SL)을 생성하고, 이를 방사선 이미지(IM') 상에 표시할 수 있다. 척추 측만증 진단장치는 방사선 이미지(IM')에 기설정된 수직선(VL)과 기준선이 평행 또는 일치되도록 방 사선 이미지(IM')를 회전시킬 수 있다.도 5를 참조하면, 척추 측만증 진단장치는 기준선(SL)과 각 척추 블록의 중심점이 떨어진 거리를 계산하고, 이격 거리가 기준 거리 이상의 값을 갖는 척추 블록들(BL10 내지 BL17)을 검사대상 블록(SBL)들로서 추출할 수 있다. 그리고, 척추 측만증 진단장치는 기준선(SL)으로부터 중심점이 가장 많이 떨어진 검사대상 블록(SBL)을 피 크 블록(PB)으로 설정하고, 피크 블록(PB)을 기준으로 상단에 위치한 검사대상 블록(SBL)을 제1 그룹(GR1)으로 설정하고, 하단에 위치한 검사대상 블록(SBL)을 제2 그룹(GR2)으로 설정할 수 있다. 도 6을 참조하면, 척추 측만증 진단장치는 검사대상 블록들(SBL) 중 제1 및 제2 기준 블록들(SB1, SB2)을 결정할 수 있다. 제1 기준 블록(SB1)은 제1 그룹(GR1)의 검사대상 블록(SBL)들 중 가장 많이 뒤틀린 척추 블록 을 의미하고, 제2 기준 블록(SB2)은 제2 그룹(GR2)의 검사대상 블록(SBL)들 중 가장 많이 뒤틀린 척추 블록을 의미한다. 척추 측만증 진단장치는 검사대상 블록(SBL)들의 일변(BL)이 수평선(HL)과 이루는 각도(θ)를 측정할 수 있다. 만약, 척추뼈가 뒤틀리지 않고 곧게 뻗어 있다면 검사대상 블록의 일변(BL)은 수평선(HL)과 평행할 것이 지만, 척추뼈가 뒤틀렸다면 검사대상 블록의 일변(BL)은 수평선(HL)과 일정한 각도를 이루게 될 것이다. 척추 측만증 진단장치는 제1 그룹(GR1)에서 가장 큰 각도를 갖는 검사대상 블록(SBL)을 제1 기준 블록 (SB1)으로 설정하고, 제2 그룹(GR2)에서 중 가장 큰 각도를 갖는 검사대상 블록(SBL)을 제2 기준 블록(SB2)으로 설정할 수 있다. 척추 측만증 진단장치는 제1 및 제2 기준 블록들(SB1, SB2)의 일변의 연장선들(SBL1, SBL2)을 설정하고, 연장선들(SBL1, SBL2) 각각에 수직한 선분들(CL1, CL2)이 이루는 각도를 계산하여 클롭앵글(θC)을 산출할 수 있다. 그리고, 척추 측만증 진단장치는 클롭앵글이 10°를 초과하는 경우, 방사선 이미지 내 피사체(HU)에 대해 척추 측만증을 진단할 수 있다. 본 발명의 실시 예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2021-0037053", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서 본 발명의 실시 예에 관하여 설명하였으나, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자라 면 본 발명의 특허청구범위를 벗어남이 없이 다양하게 변형 실시할 수 있을 것으로 이해된다."}
{"patent_id": "10-2021-0037053", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 척추 측만증 진단시스템의 도면이다. 도 2는 본 발명의 실시 예에 따른 척추 측만증 진단장치의 동작방법을 설명하기 위한 흐름도이다. 도 3 내지 도 6은 본 발명의 실시 예에 따른 척추 측만증 진단장치가 콥스앵글을 측정하는 방법을 설명하기 위 한 도면이다."}
