{"patent_id": "10-2022-0058599", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0158903", "출원번호": "10-2022-0058599", "발명의 명칭": "차량 트림 정보 관리 방법, 장치 및 컴퓨터-판독가능 매체", "출원인": "포티투닷 주식회사", "발명자": "김현석"}}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량 트림 정보 관리 방법에 있어서, 하나 이상의 차량 트림의 기본 정보, 제원 정보, 좌석 정보 및 차량 이미지 정보에 대한 제1 데이터베이스를 구성하는 단계; 및 상기 제1 데이터베이스에 저장된 하나 이상의 차량 트림 정보 중에서 소정의 조건에 부합하는 차량 트림 정보를검색하는 제1 인터페이스를 제공하는 단계; 를 포함하고, 상기 좌석 정보에는 레이아웃 타입 및 좌석 레이아웃이 포함되고, 상기 제1 데이터베이스를 구성하는 단계는, 상기 레이아웃 타입을 선택하는 단계; 및 상기 선택된 레이아웃 타입에 대응하는 좌석 레이아웃의 좌석 속성을 설정함으로써 상기 하나 이상의 차량 트림의 좌석 정보에 대한 상기 제1 데이터베이스를 구성하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 좌석 레이아웃의 좌석 속성에는 좌석의 상태 및 좌석 번호가 포함되고, 상기 제1 데이터베이스를 구성하는 단계는, 상기 좌석 레이아웃에 포함된 복수의 좌석 중 소정의 좌석을 선택하는 단계; 상기 선택된 소정의 좌석의 상태를 사용 또는 미사용 중 하나로 결정하는 단계; 상기 소정의 좌석에 대한 좌석 번호를 결정하는 단계; 및 상기 결정된 좌석의 상태 및 상기 결정된 좌석 번호를, 상기 소정의 좌석에 대한 좌석 속성으로 설정함으로써상기 제1 데이터베이스를 구성하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 제1 데이터베이스를 구성하는 단계는, 상기 좌석 레이아웃에 포함된 복수의 좌석 각각에 대한 좌석 속성을 설정하는 단계; 및 상기 복수의 좌석 각각에 대한 좌석 속성 설정이 완료된 것에 응답하여, 좌석 레이아웃을 상기 데이터베이스에등록하는 등록 프로세스를 수행하는 단계; 를 더 포함하는, 방법."}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 제1 데이터베이스를 구성하는 단계는, 상기 레이아웃 타입을 선택하는 단계 이후에, 상기 선택된 레이아웃 타입에 대응하는 좌석 레이아웃의 좌석 속성을 추천하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 공개특허 10-2023-0158903-3-상기 방법은 계정 정보를 획득하는 단계; 를 더 포함하고, 상기 좌석 속성을 추천하는 단계는, 상기 계정 정보에 기초하여, 상기 선택된 레이아웃 타입에 대응하는 좌석 레이아웃의 좌석 속성을 추천하는 단계인, 방법."}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서, 상기 좌석 속성을 추천하는 단계는, 상기 제원 정보에 기초하여, 상기 선택된 레이아웃 타입에 대응하는 좌석 레이아웃의 좌석 속성을 추천하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 방법은, 하나 이상의 차량에 대한 기본 정보, 차량 정보 및 부가 정보에 대한 제2 데이터베이스를 구성하는 단계; 및 상기 제2 데이터베이스에 저장된 하나 이상의 차량 중에서 소정의 조건에 부합하는 차량을 검색하는 제2 인터페이스를 제공하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 상기 차량 정보에는 차량 트림 및 좌석 레이아웃에 대한 정보가 포함되고, 상기 제2 데이터베이스를 구성하는 단계는, 상기 차량 트림을 선택하는 단계; 상기 제1 데이터베이스로부터 상기 선택된 차량 트림에 대응하는 좌석 레이아웃 정보를 획득하는 단계; 및 상기 획득된 좌석 레이아웃을 이용하여 상기 제2 데이터베이스를 구성하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0058599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "차량 트림 정보 관리 장치에 있어서, 상기 장치는, 적어도 하나의 프로그램이 저장된 메모리; 및 상기 적어도 하나의 프로그램을 실행함으로써 연산을 수행하는 프로세서를 포함하고, 상기 프로세서는, 복수의 차량 트림의 기본 정보, 제원 정보, 좌석 정보 및 차량 이미지 정보에 대한 제1 데이터베이스를 구성하고, 상기 제1 데이터베이스에 저장된 복수의 차량 트림 중에서 소정의 조건에 부합하는 차량 트림을 검색하는 제1인터페이스를 제공하고, 상기 좌석 정보에는 레이아웃 타입 및 좌석 레이아웃이 포함되고, 상기 프로세서는, 상기 레이아웃 타입을 선택하고, 상기 선택된 레이아웃 타입에 대응하는 좌석 레이아웃의 좌석 속성을 설정함으로써 상기 복수의 차량 트림의 좌석 정보에 대한 상기 제1 데이터베이스를 구성하는, 장치.공개특허 10-2023-0158903-4-청구항 10 제1항에 따른 방법을 컴퓨터에서 실행하기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 방법은, 차량 트림 정보 관리 방법에 있어서, 하나 이상의 차량 트림의 기본 정보, 제원 정보, 좌석 정보 및 차량 이미지 정보에 대한 제1 데이터베이스를 구성하는 단계; 및 상기 제1 데이터베이 스에 저장된 하나 이상의 차량 트림 정보 중에서 소정의 조건에 부합하는 차량 트림 정보를 검색하는 제1 인터페 이스를 제공하는 단계; 를 포함하고, 상기 좌석 정보에는 레이아웃 타입 및 좌석 레이아웃이 포함되고, 상기 제1 데이터베이스를 구성하는 단계는, 상기 레이아웃 타입을 선택하는 단계; 및 상기 선택된 레이아웃 타입에 대응하 는 좌석 레이아웃의 좌석 속성을 설정함으로써 상기 하나 이상의 차량 트림의 좌석 정보에 대한 상기 제1 데이터 베이스를 구성하는 단계; 를 포함하는, 방법을 개시한다."}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량 트림 정보 관리 방법, 장치 및 컴퓨터-판독가능 매체에 관한 것이다."}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래의 교통 수단으로는 버스, 지하철, 택시 등이 있는데, 버스, 지하철은 비용은 저렴하지만 정해진 시간에 정 해진 구역에 직접 가서 타야 하는 불편함이 있고, 택시는 탑승객이 원하는 곳에서 타서 원하는 곳에서 내리지만, 비용이 비싸다는 단점이 존재한다. 일반적인 도시에서는 버스, 지하철, 택시 등의 교통 수단을 자유롭게 이용할 수 있지만, 시골과 같은 벽지는 택 시가 운행을 하지 않는다거나 버스가 하루에 3~4번 정도만 운행함에 따라 종래의 교통 수단에 대한 접근성이 떨 어진다. 이러한 종래 교통 수단의 장점과 단점을 보완하는 교통 방식으로 수요응답형(Demand Responsive Transportation, DRT) 교통이 대두되고 있다. 수요응답형 교통이란 고정된 노선 없이 사용자의 수요에 의해 운 행구간, 운행횟수, 운행시간 등을 탄력적으로 운영 가능한 교통 방식을 의미한다. 최근에는 수요응답형 교통 시스템을 보다 효율적으로 운영할 수 있는 방법에 대한 연구가 요구되고 있다."}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2001-0000716호 (2001.01.05)"}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 수요 응답형 교통 시스템을 보다 효율적으로 운영하기 위해, 수요 응답형 교통 서비스에 이용되는 차 량에 대한 정보를 관리하고, 차량 정보 중 하나로써 차량 트림 정보를 관리하기 위한 장치 및 방법을 제공하는 데 있다. 본 발명이 해결하고자 하는 과제는 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 발명 의 다른 과제 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시 예에 의해보다 분명하게 이해 될 것이다. 또한, 본 발명이 해결하고자 하는 과제 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의 해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 개시의 제1 측면은, 차량 트림 정보 관리 방법에 있어서, 하나 이상의 차량 트림의 기본 정보, 제원 정보, 좌석 정보 및 차량 이미지 정보에 대한 제1 데이터베 이스를 구성하는 단계; 및 상기 제1 데이터베이스에 저장된 하나 이상의 차량 트림 정보 중에서 소정의 조건에 부합하는 차량 트림 정보를 검색하는 제1 인터페이스를 제공하는 단계; 를 포함하고, 상기 좌석 정보에는 레이 아웃 타입 및 좌석 레이아웃이 포함되고, 상기 제1 데이터베이스를 구성하는 단계는, 상기 레이아웃 타입을 선 택하는 단계; 및 상기 선택된 레이아웃 타입에 대응하는 좌석 레이아웃의 좌석 속성을 설정함으로써 상기 하나 이상의 차량 트림의 좌석 정보에 대한 상기 제1 데이터베이스를 구성하는 단계; 를 포함하는, 방법을 제공할 수 있다.본 개시의 제2 측면은, 차량 트림 정보 관리 장치에 있어서, 상기 장치는, 적어도 하나의 프로그램이 저장된 메 모리; 및 상기 적어도 하나의 프로그램을 실행함으로써 연산을 수행하는 프로세서를 포함하고, 상기 프로세서는, 하나 이상의 차량 트림의 기본 정보, 제원 정보, 좌석 정보 및 차량 이미지에 대한 제1 데이터베이 스를 구성하고, 상기 제1 데이터베이스에 저장된 하나 이상의 차량 트림 중에서 소정의 조건에 부합하는 차량 트림을 검색하는 제1 인터페이스를 제공하고, 상기 좌석 정보에는 레이아웃 타입 및 좌석 레이아웃이 포함되고, 상기 프로세서는, 상기 레이아웃 타입을 선택하고, 상기 선택된 레이아웃 타입에 대응하는 좌석 레이아웃의 좌 석 속성을 설정함으로써 상기 복수의 차량 트림의 좌석 정보에 대한 상기 제1 데이터베이스를 구성하는, 장치를 제공할 수 있다. 본 개시의 제3 측면은, 제1 측면에 따른 방법을 컴퓨터에서 실행하기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공할 수 있다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램이 저장된 컴퓨터로 판독 가능한 기록매체가 더 제공될 수 있다. 전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 특허청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 개시의 과제 해결 수단에 의하면, 수요 응답형 교통 서비스(DRT 서비스)를 제공하는 관리자에게 차량 관리의 편리성과 효율성을 증가시킬 수 있는 인터페이스를 제공할 수 있다. 전술한 본 개시의 과제 해결 수단에 의하면, 수요 응답형 교통 서비스를 관제하는 관제 서버는 저장된 정보를 가공하여 관제 서버를 이용하는 관리자에게 사용자 인터페이스 형태로 제공함으로써, 관리자의 관제 정확성과 편의성을 증대시킬 수 있다. 전술한 본 개시의 과제 해결 수단에 의하면, 차량 트림을 관리하기 위한 인터페이스를 제공함으로써 효율적인 차량 트림 관리가 가능할 수 있다."}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시 예들 을 참조하면 명확해질 것이다. 그러나 본 발명은 아래에서 제시되는 실시 예들로 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 아래에 제시되는 실시 예들은 본 발명의 개시가 완전하도록 하며, 본 발"}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 일부 실시예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블 록들의 일부 또는 전부는, 특정 기능들을 실행하는 다양한 개수의 하드웨어 및/또는 소프트웨어 구성들로 구현 될 수 있다. 예를 들어, 본 개시의 기능 블록들은 하나 이상의 마이크로프로세서들에 의해 구현되거나, 소정의 기능을 위한 회로 구성들에 의해 구현될 수 있다. 또한, 예를 들어, 본 개시의 기능 블록들은 다양한 프로그래 밍 또는 스크립팅 언어로 구현될 수 있다. 기능 블록들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 개시는 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기 술을 채용할 수 있다. \"매커니즘\", \"요소\", \"수단\" 및 \"구성\"등과 같은 용어는 넓게 사용될 수 있으며, 기계적 이고 물리적인 구성들로서 한정되는 것은 아니다. 또한, 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서는 대체 가능하거나 추가된 다양한 기능적인 연결, 물 리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 나타내어질 수 있다. 이하에서, '차량'은 자동차, 버스, 오토바이, 킥보드 또는 트럭과 같이 기관을 가지고 사람이나 물건을 이동시 키기 위해 이용되는 모든 종류의 운송 수단을 의미할 수 있다. 이하 첨부된 도면을 참고하여 본 개시를 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 자율 주행 방식을 설명하기 위한 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 자율 주행 장치는, 차량에 장착되어 자율 주행 차량을 구현 할 수 있다. 자율 주행 차량에 장착되는 자율 주행 장치는, 주변의 상황 정보를 수집하기 위한 다양한 센서 들을 포함할 수 있다. 일례로, 자율 주행 장치는 자율 주행 차량의 전면에 장착된 이미지 센서 및/또는 이 벤트 센서를 통해, 전방에서 운행 중인 선행 차량의 움직임을 감지할 수 있다. 자율 주행 장치는 자율 주행 차량의 전면은 물론, 옆 차로에서 운행중인 다른 주행 차량과, 자율 주행 차량 주변의 보행자 등을 감지하기 위한 센서들을 더 포함할 수 있다. 자율 주행 차량 주변의 상황 정보를 수집하기 위한 센서들 중 적어도 하나는, 도 1에 도시한 바와 같이 소정의 화각(FoV)을 가질 수 있다. 일례로, 자율 주행 차량의 전면에 장착된 센서가 도 1에 도시한 바와 같은 화각 (FoV)을 갖는 경우에, 센서의 중앙에서 검출되는 정보가 상대적으로 높은 중요도를 가질 수 있다. 이는, 센서의 중앙에서 검출되는 정보에, 선행 차량의 움직임에 대응하는 정보가 대부분 포함되어 있기 때문일 수 있다. 자율 주행 장치는, 자율 주행 차량의 센서들이 수집한 정보를 실시간으로 처리하여 자율 주행 차량의 움직임을 제어하는 한편, 센서들이 수집한 정보 중에 적어도 일부는 메모리 장치에 저장할 수 있다. 도 2는 일 실시예에 따른 자율 주행 장치에 포함되는 하드웨어가 도시된 블록도이다. 도 2를 참조하면, 자율 주행 장치는 센서부, 프로세서, 메모리 시스템, 및 차체 제어 모듈 등을 포함할 수 있다. 센서부는 복수의 센서들(42-45)을 포함하며, 복수의 센서들(42-45)은 이미지 센서, 이벤트 센서, 조도 센서, GPS 장치, 가속도 센서 등을 포함할 수 있다. 센서들(42-45)이 수집한 데이터는 프로세서로 전달될 수 있다. 프로세서는 센서들(42-45)이 수집한 데 이터를 메모리 시스템에 저장하고, 센서들(42-45)이 수집한 데이터에 기초하여 차체 제어 모듈을 제어 하여 차량의 움직임을 결정할 수 있다. 메모리 시스템은 둘 이상의 메모리 장치들과, 메모리 장치들을 제어 하기 위한 시스템 컨트롤러를 포함할 수 있다. 메모리 장치들 각각은 하나의 반도체 칩으로 제공될 수 있다. 메모리 시스템의 시스템 컨트롤러 외에, 메모리 시스템에 포함되는 메모리 장치들 각각은 메모리 컨트 롤러를 포함할 수 있으며, 메모리 컨트롤러는 신경망과 같은 인공지능(AI) 연산 회로를 포함할 수 있다. 메모리 컨트롤러는 센서들(42-45) 또는 프로세서로부터 수신한 데이터에 소정의 가중치를 부여하여 연산 데이터를 생성하고, 연산 데이터를 메모리 칩에 저장할 수 있다. 이하에서 설명되는 수요응답형 차량에 자율 주행 장치가 탑재될 수 있다. 도 3은 일 실시예에 따른 수요응답형 교통 시스템을 설명하기 위한 도면이다. 수요응답형(Demand Responsive Transportation, DRT) 교통이란, 고정된 노선 없이 사용자의 수요에 의해 운행 구간, 운행횟수, 운행시간 등을 탄력적으로 운영 가능한 교통 방식을 의미한다. 수요응답형 교통은 노선 운행 방법에 따라 다양한 유형으로 구분될 수 있다. 예를 들어, 고정노선형 유형은, 운 행시각, 정류장, 기·종점이 모두 고정되는 유형이다. 경로이탈형 유형은, 운행시각, 기·종점은 고정되지만, 정류장의 경우 사용자 예약에 따라 고정된 정류장 외에도 새로운 정류장이 설정될 수 있는 유형이다. 준다이나 믹형 유형은, 기·종점은 고정되지만, 운행시각은 출발시각 및 도착시각만 고정되고, 정류장 역시 기·종점 외 에는 정류장이 자유롭게 설정될 수 있다. 다이나믹형 유형은, 운행시각, 정류장, 기·종점이 모두 고정되어 있 지 않은 유형이다. 또한, 수요응답형 교통은 기·종점의 개수에 따라 다양한 유형으로 구분될 수 있다. 예를 들어, 일대일 유형은, 한 지점에서 출발하여 다른 한 지점으로 이동하는 유형이다. 또한, 일대다 유형은, 하나의 출발지에서 다수의 도착지로 이동하는 유형이고, 다대일 유형은, 다수의 출발지에서 하나의 도착지로 이동하는 유형이다. 또한, 다 대다 유형은, 기·종점이 없고, 상황이나 요구에 따라 변경이 가능한 유형이다. 도 3을 참조하면, 수요응답형 교통 시스템은 사용자 단말, 관제 서버 및 수요응답형 차량 을 포함할 수 있다. 사용자 단말은, 스마트폰, 태블릿 PC, PC, 스마트 TV, 휴대폰, PDA(personal digital assistant), 랩톱, 미디어 플레이어, 마이크로 서버, GPS(global positioning system) 장치, 전자책 단말기, 디지털방송용 단말기, 네비게이션, 키오스크, MP3 플레이어, 디지털 카메라, 가전기기, 카메라가 탑재된 디바이스 및 기타 모바일 또 는 비모바일 컴퓨팅 장치일 수 있으나, 이에 제한되지 않는다. 또한, 사용자 단말은 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 디바이스일 수 있다. 그러나, 이에 제한 되지 않는다. 관제 서버는, 수요응답형 교통을 운영하기 위한 관제 기능을 수행하는 서버를 의미한다. 수요응답형 차량 은 사용자의 수요에 따라 배차되고, 수요응답형 교통의 운영방식에 따라 운행구간, 운행횟수, 운행시간 등 이 정해지는 차량을 의미한다. 사용자 단말, 관제 서버 및 수요응답형 차량은 네트워크를 이용하여 통신을 수행할 수 있다. 예 를 들어, 네트워크는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN), 부가가 치 통신망(Value Added Network; VAN), 이동 통신망(mobile radio communication network), 위성 통신망 및 이 들의 상호 조합을 포함하며, 도 3에 도시된 각 네트워크 구성 주체가 서로 원활하게 통신을 할 수 있도록 하는 포괄적인 의미의 데이터 통신망이며, 유선 인터넷, 무선 인터넷 및 모바일 무선 통신망을 포함할 수 있다. 또한, 무선 통신은 예를 들어, 무선 랜(Wi-Fi), 블루투스, 블루투스 저 에너지(Bluetooth low energy), 지그비, WFD(Wi-Fi Direct), UWB(ultra-wideband), 적외선 통신(IrDA, infrared Data Association), NFC(Near Field Communication) 등이 있을 수 있으나, 이에 한정되는 것은 아니다.사용자 단말은 네트워크를 통해 관제 서버에 접속하고, 출발시간, 출발지, 도착지 등의 정보를 관제 서버로 전송할 수 있다. 관제 서버는 등록된 수요응답형 차량의 정보를 확인하여 배차 프로세스 를 수행할 수 있다. 예를 들어, 관제 서버는 사용자 단말의 출발지와 수요응답형 차량의 현재 위치를 비교하고, 사용자 단말의 출발지에 가장 빨리 도착할 수 있는 수요응답형 차량을 배차할 수 있다. 관제 서버는 네트워크를 통해 배차 정보를 사용자 단말 및 수요응답형 차량에 전송할 수 있다. 도 4는 일 실시예에 따른 관제 서버에서 수행되는 관제 기능을 설명하기 위한 예시적인 도면이다. 관제 서버는 수요응답형 교통 시스템 하에서 운영되는 복수의 수요응답형 차량을 관제할 수 있는 서버이다. 관 제 서버에는 수요응답형 교통 서비스를 제공하는 복수의 회사 정보가 등록될 수 있다. 또한, 관제 서버에는 각 회사 별로 운영하고 있는 복수의 차량 정보 및, 각 회사에 등록된 복수의 기사 정보가 등록될 수 있다. 도 4에는 관제 서버에서 관리자에게 제공하는 사용자 인터페이스가 도시된다. 사용자 인터페이스를 참조하면, 관리자는 제1 영역에 포함된 객체와 인터랙션함으로써, 수요응답형 차량을 검색하기 위한 다양 한 조건을 설정할 수 있다. 예를 들어, 관리자는 제1 영역에 포함된 객체와 인터랙션함으로써, 운행 지역, 운영 회사, 차종 상품, 노선 및 관제 상태에 대한 조건을 설정할 수 있다. 또한, 관리자는 제1 영역에 포 함된 객체와 인터랙션함으로써, 기사 정보, 차량 정보, 운행 정보에 대한 조건을 설정할 수 있다. 관제 서버는 관리자가 수요응답형 차량을 검색하기 위한 조건을 설정한 것에 응답하여, 설정된 조건에 부합하는 수요응답형 차량에 대한 상세 정보를 제2 영역에 표시할 수 있다. 제2 영역에는, 설정된 조건에 부합 하는 수요응답형 차량에 대한 회사명, 기사명, 차량번호, 운행상태 및 노선에 대한 정보가 표시될 수 있으나, 제2 영역에 표시되는 정보는 이에 제한되지 않는다. 예를 들어, 관리자가 운행 지역을 '세종', 회사명을 'ABC'로 조건을 설정한 것에 응답하여, 관제 서버는 '세종'에서 운행 중인 'ABC' 회사의 수요응답형 차량에 대 한 기사명, 차량번호, 관제상태 및 노선에 대한 정보를 표시할 수 있다. 또한, 관제 서버는 관리자가 수요응답형 차량을 검색하기 위한 조건을 설정한 것에 응답하여, 설정된 조건에 부 합하는 수요응답형 차량에 대한 운행 정보를 제3 영역에 표시할 수 있다. 제3 영역에는, 설정된 조건 에 부합하는 수요응답형 차량에 대한 운행상태(배차 대기, 배차 멈춤, 운행 중, 휴식 등), 이동 경로 및 현재 위치에 대한 정보가 표시될 수 있으나, 제3 영역에 표시되는 정보는 이에 제한되지 않는다. 한편, 관리자는 제2 영역에 포함된 객체와 인터랙션함으로써, 소정의 수요응답형 차량을 선택할 수 있다. 관제 서버는 관리자가 소정의 수요응답형 차량을 선택한 것에 응답하여, 선택된 수요응답형 차량의 승차 지점, 하차 지점 및 남은 이동 경로를 제3 영역에 표시할 수 있다. 예를 들어, 도 4에서는 차량번호 '5678'가 관 리자에 의해 선택되고, 이에 따라 제3 영역에 차량번호 '5678'의 승차 지점, 하차 지점, 남은 이동 경로가 표시된다. 관제 서버는 수요응답형 교통 서비스를 제공하는 회사 정보, 각 회사 별로 운영하고 있는 복수의 차량 정보 및, 각 회사에 등록된 복수의 기사 정보를 저장할 수 있다. 또한, 관제 서버는 저장된 정보를 가공하여 관제 서버를 이용하는 관리자에게 사용자 인터페이스 형태로 제공함으로써, 관리자의 관제 정확성과 편의성을 증대시킬 수 있다. 한편, 도 4에서는 설명의 편의를 위해 제1 영역, 제2 영역 및 제3 영역이 하나의 인터페이스에 표시되는 것으로 설명하였으나, 각 영역은 서로 다른 인터페이스에 표시될 수도 있다. 이하에서는, 관제 서버에서 관리자에게 차량을 관리하기 위한 사용자 인터페이스 제공함으로써, 차량 정보를 관 리하는 방법을 설명한다. 이하에서 설명되는 인터페이스를 제공하는 장치(이하, '인터페이스 제공 장치')는 관 제 서버를 의미할 수 있다. 여기서 차량 정보란, 수요응답형 교통 서비스를 제공하는 차량에 관한 자율 주행 구 분, 차량ID, 차량 번호, 차량명, 차종 상품, 차량 트림, 차량 모델, 차량 상태, 차량 이미지 등과 같은 차량에 대한 일반적인 정보를 의미한다. 차량 트림 정보란, 일반적으로 자동차 한 모델 안에서의 등급을 의미하는 것으 로, 수요응답형 교통 서비스를 제공하는 차량에 관하여 선택할 수 있는 편의사양, 옵션 등을 의미한다. 본 명세 서에서, 차량 트림 정보는 이와 같은 의미로써, 차량 정보에 포함되는 다양한 정보 중 하나를 의미한다. 도 5는 일 실시예에 따른 하나 이상의 차량 트림의 각종 정보에 대한 제1 데이터베이스를 구성하는 방법을 설명 하기 위한 예시적인 도면이다. 도 5를 참조하면, 인터페이스 제공 장치는 하나 이상의 차량 트림의 기본 정보, 제원 정보, 좌석 정보 및 차량 이미지에 대한 제1 데이터베이스를 구성할 수 있다. 예를 들어, 차량 트림의 기본 정보는 차량 트림명, 차량 이미지 및 차량 트림 ID 등의 정보를 포함할 수 있다. 차량 트림의 제원 정보는 제조사, 차량 모델, 연료, 차종 및 자율 주행 구분 등의 정보를 포함할 수 있다. 예를 들어, 차량 트림의 좌석 정보는 좌석 레이아웃 타입, 좌석 레이아웃 정보, 승차구분 및 탑승 인승 등의 정 보를 포함할 수 있다. 예를 들어, 차량 트림명은 차량 트림을 서로 구분하기 위한 이름으로써 차량 명칭 및 탑승 인원의 조합으로 설 정될 수 있다. 차량 트림의 상태는 수요응답형 교통 서비스에 현재 제공되고 있는지 여부로써, 활성화 및 비활 성화 상태일 수 있다. 차량 모델은 선택된 제조사에 소속된 차량 모델 중 하나일 수 있다. 연료는 가솔린, 디젤, LPG, 가솔린 및 전기, 디젤 및 전기, LPG 및 전기, 가솔린 및 LPG, 가솔린 및 CNG, CNG, 전기, 수소, 바 이오 디젤 등 중 어느 하나일 수 있다. 차종은 경형, 소형, 중형, 준중형, 대형, 준대형 및 스포츠카 중 어느 하나일 수 있고, 해당 차량이 제공하는 교통 서비스의 종류를 나타낼 수 있다. 교통 서비스의 종류는 수요 응답 형 교통 수단(Demand Responsive Transport, DRT), 택시, 버스, 자율주행 택시, 자율주행 버스 등을 포함할 수 있다. 승차구분은 승용형 및 승합형 중 어느 하나일 수 있다. 일 실시예에서, 인터페이스 제공 장치는 차량 이미지에 관리자의 마우스 오버랩을 허용할 수 있고, 미리 보기 및 삭제 아이콘을 노출시킬 수 있다. 인터페이스 제공 장치는 미리 보기 아이콘에 대한 입력을 수신한 것에 응 답하여 팝업을 노출시켜 차량 이미지에 대한 미리 보기를 제공할 수 있다. 인터페이스 제공 장치는 삭제 아이콘 에 대한 입력을 수신한 것에 응답하여 등록 이미지를 삭제할 수 있다. 도 6은 일 실시예에 따른 제1 데이터베이스에 저장된 하나 이상의 차량 트림 정보 중에서 소정의 조건에 부합하 는 차량 트림 정보를 검색하는 제1 인터페이스에 관한 예시적인 도면이다. 도 6을 참조하면, 제1 인터페이스는 차량 트림을 검색할 수 있는 조건을 설정하도록 구성되는 제1.1 영역 , 설정된 조건에 부합하는 차량 트림에 대한 정보가 나열되도록 구성되는 제1.2 영역 및 관리자의 입 력을 수신하도록 구성되는 제1.3 영역을 포함할 수 있다. 한편, 도 6에서는 설명의 편의를 위해 제1.1 영 역, 제1.2 영역 및 제1.3 영역이 하나의 인터페이스에 표시되는 것으로 설명하였으나, 각 영역 은 서로 다른 인터페이스에 표시될 수도 있다. 인터페이스 제공 장치는 제1.1 영역에 검색 조건을 표시하고, 관리자의 검색 조건 설정을 수신할 수 있다. 예를 들어, 제1.1 영역에서 표시되는 검색 조건은 차량 트림 정보 및 일시 정보일 수 있다. 여기서 차량 트림 정보는, 차량 트림명, 제조사, 차량 모델, 연료, 차종, 자율주행 구분 및 상태 등을 포함할 수 있다. 인터페이스 제공 장치는 관리자가 설정한 검색 조건에 부합하는 차량 트림 정보를 제1 데이터 베이스에서 검색 하고, 부합하는 차량 트림에 대한 정보를 제1.2 영역에 나열할 수 있다. 예를 들어, 제1.2 영역에서 는 제1 데이터베이스를 구성하는 차량 트림 정보가 표시될 수 있다. 차량 트림 정보는 차량 트림 ID, 차량 트림 명, 제조사, 차량모델, 연료, 차종, 자율주행 구분, 탑승인원, 상태, 등록일시/수정일시, 등록자/수정자 등이 포함될 수 있다. 일 실시예에 따르면, 제1.3 영역은 다운로드탭과 등록탭을 포함할 수 있다. 인터페이스 제공 장치는 제1.3 영역에서 다운로드탭에 대한 관리자의 입력을 수신한 것에 응답하여 차량 트림에 대한 정보를 데이터 베이 스로부터 서버를 통해 관리자의 단말, 데이터베이스, 서버 등에게 전송할 수 있다. 인터페이스 제공 장치는 제 1.3 영역에서 등록탭에 대한 관리자의 입력을 수신한 것에 응답하여 차량 트림 정보에 대한 제1 데이터베 이스를 구성할 수 있다. 도 7은 일 실시예에 따른 레이아웃 타입 및 좌석 레이아웃에 대한 제1 데이터베이스를 구성하는 방법에 관한 예 시적인 도면이다. 도 7을 참조하면, 제1 데이터베이스를 구성하는 좌석 정보에는 레이아웃 타입 및 좌석 레이아웃이 포함될 수 있 다. 인터페이스 제공 장치는 레이아웃 타입을 선택하는 입력을 수신할 수 있고, 선택된 레이아웃 타입에 대응하 는 좌석 레이아웃의 좌석 속성을 설정함으로써 하나 이상의 차량 트림의 좌석 정보에 대한 제1 데이터베이스를 구성할 수 있다. 여기서 좌석 레이아웃 타입은 좌석 레이아웃의 형태를 의미하고, 좌석 속성은 좌석 각각에 대 한 좌석의 세부 정보를 의미한다. 예를 들어, 도 7은, 레이아웃 타입이 4행과 4열로 이루어진 4X4 형태로 선택 된 일 예를 나타낸 것이다. 인터페이스 제공 장치는 4X4 형태의 좌석 레이아웃의 좌석 속성을 각각 설정할 수 있다.일 실시예에 따르면, 좌석 레이아웃 타입은 최소 2행과 2열로 이루어질 수 있다. 좌석 레이아웃 타입은 설명의 편의를 위해 행렬 형태로 설명하였으나, 좌석의 구분이 가능한 어떠한 형태라도 이에 한정되지 않을 것이다. 일 실시예에 따르면, 인터페이스 제공 장치는 좌석 레이아웃 타입을 선택하도록 구성되는 제7.1 영역, 선 택된 좌석 레이아웃 타입에 대응하는 좌석 레이아웃을 표시하도록 구성되는 제7.2 영역 및 좌석 레이아웃 의 좌석 속성을 설정하도록 구성되는 제7.3 영역을 포함하는 인터페이스를 제공할 수 있다. 도 8a는 일 실시예에 따른 좌석 레이아웃에 포함된 좌석의 좌석 속성을 설정함으로써 제1 데이터베이스를 구성 하는 방법에 관한 예시적인 도면이다. 도 8a를 참조하면, 좌석 레이아웃의 좌석 속성에는 좌석의 상태 및 좌석 번호가 포함될 수 있다. 인터페이스 제 공 장치는 좌석 레이아웃에 포함된 복수의 좌석 중 소정의 좌석을 선택하는 입력을 수신할 수 있다. 인터페이스 제공 장치는 선택된 소정의 좌석의 상태를 사용 또는 미사용 중 하나로 결정할 수 있고, 선택된 소정의 좌석에 대한 좌석 번호를 결정할 수 있다. 여기서 좌석의 상태가 사용으로 결정되는 것은, 수요 응답형 교통 서비스를 제공하는 차량의 좌석을 탑승객이 사용할 수 있다는 것을 의미한다. 좌석 번호는 입력 값에 의해 결정되거나, 좌석 레이아웃에 대응하여 결정될 수 있다. 일 실시예로, 좌석 번호는 좌석 레이아웃 형태에 의해 문자, 숫자 중 적어도 하나를 이용하여 결정될 수 있다. 또 다른 실시예로, 좌석 번호는 이전 입력한 좌석 번호를 이용하여 입력하고자 하는 좌석의 위치 및 좌선 번호 가 입력된 좌석의 위치에 대응되도록 결정될 수 있다. 또 다른 예로, 좌석 번호는 좌석의 상태에 대응하여 결정될 수 있다. 예를 들어, 인터페이스 제공 장치는 좌석 의 상태가 사용으로 결정된 것에 응답하여 좌석 번호를 결정하고, 좌석의 상태가 미사용인 경우에는 결정하지 않을 수 있다. 도 8a는 좌석 레이아웃의 16개의 좌석 중 두번째 행 및 첫번째 열에 해당하는 소정의 좌석이 선택된 일 예를 나 타낸 것이다. 인터페이스 제공 장치는 선택한 좌석의 상태를 '사용' 상태로 설정하였고, 좌석 번호를 '2A'로 설 정하였다. 도 8b는 일 실시예에 따른 좌석 레이아웃에 포함된 좌석의 좌석 속성을 설정함으로써 제1 데이터베이스를 구성 하는 방법에 관한 예시적인 도면이다. 도 8b를 참조하면, 인터페이스 제공 장치는 결정된 좌석의 상태 및 결정된 좌석 번호를 소정의 좌석에 대한 좌 석 속성으로 설정함으로써 제1 데이터베이스를 구성할 수 있다. 예를 들어, 도 8을 참고하면, 4X4 좌석 레이아웃에 해당하는 16개의 좌석은 '2A'의 좌석 번호를 갖고, '사용' 상태로 설정된 좌석과 좌석 속성이 아직 미설정 상태인 15개의 좌석으로 구분되어 있다. 일 실시예에서, 인터페이스 제공 장치는 사용 상태로 설정된 좌석의 수에 따라, 사용 가능 좌석 수를 별도로 표 시할 수 있다. 도 9는 일 실시예에 따른 좌석 레이아웃에 포함된 복수의 좌석 각각에 대한 좌석 속성을 설정함으로써 제1 데이 터베이스를 구성하는 방법에 관한 예시적인 도면이다. 도 9를 참조하면, 인터페이스 제공 장치는 좌석 레이아웃에 포함된 복수의 좌석 각각에 대한 좌석 속성이 결정 된 것에 응답하여, 좌석 레이아웃을 데이터베이스에 등록하는 등록 프로세스를 수행할 수 있다. 예를 들어, 도 9를 참고하면, 4X4 좌석 레이아웃에 포함된 16개의 좌석 각각에 대한 좌석 속성이 결정되었다. '사용' 상태로 결정된 1A, 1B, 2A, 2B, 2C, 3A, 3B, 3C, 4A, 4B, 4C 좌석과 '미사용' 상태로 결정된 5 칸의 좌석이 표시되어 있다. 인터페이스 제공 장치는 16개 좌석에 대한 좌석 속성이 결정된 후, 좌석 레이아웃을 데 이터 베이스에 등록하는 등록 프로세스를 수행할 수 있다. 일 실시예에 따르면, 인터페이스 제공 장치는 레이아웃 타입을 선택한 이후에, 선택된 레이아웃 타입에 대응하 는 좌석 레이아웃의 좌석 속성을 추천함으로써 하나 이상의 차량 트림의 좌석 정보에 대한 제1 데이터베이스를 구성할 수 있다. 예를 들어, 인터페이스 제공 장치는 인터페이스를 이용하는 관리자의 계정 정보를 획득할 수 있다. 여기서 관리 자의 계정 정보란, 관리자 별 수요응답형 교통 서비스를 제공하는 지역에 대한 정보, 관리자가 서비스를 제공하 기 위해 이용하는 차종 상품에 대한 정보, 관리자 계정으로 이미 설정한 바 있는 좌석 속성에 대한 정보 등이포함될 수 있고, 관리자의 계정 정보는 관제 서버가 별도로 저장하여 관리하고 있거나, 기타 다른 서버 등을 통 해 수신할 수 있다. 인터페이스 제공 장치는 계정 정보에 기초하여, 선택된 레이아웃 타입에 대응하는 좌석 레 이아웃의 좌석 속성을 추천할 수 있다. 예를 들어, 인터페이스 제공 장치는 계정 정보에 대응하는 좌석 속성 히 스토리 정보를 이용하여 좌석 레이아웃의 좌석 속성을 추천할 수 있다. 현재 법인A의 관리자 계정을 통해 차량 트림에 대한 데이터베이스가 구성되고 있는 경우, 인터페이스 제공 장치는 법인A의 관리자 계정이 과거 설정한 좌석 속성 히스토리를 불러와, 현재 설정 중인 좌석 속성을 추천할 수 있다. 인터페이스 제공 장치는 차량 트림 관리 인터페이스를 현재 제공받고 있는 관리자 계정과 관련이 있는 좌석 레이아웃의 좌석 속성을 추천함으로써, 효율적이고 편리한 차량 트림에 대한 데이터 베이스를 구성이 가능해질 것이다. 다른 예시로, 인터페이스 제공 장치는 차량 트림의 제원 정보에 기초하여, 선택된 레이아웃 타입에 대응하는 좌 석 레이아웃의 좌석 속성을 추천할 수 있다. 인터페이스 제공 장치는 차종별로 좌석 수 중심의 좌석 속성을 추 천할 수 있다. 예를 들어, 차량 트림의 제원 정보 중 차종 정보가 대형 차종으로 설정된 것에 응답하여, 인터페 이스 제공 장치는 선택된 레이아웃 타입에 포함된 복수의 좌석 중 일정 퍼센트 이상의 좌석의 상태가 사용인 것으로 설정되는 것을 추천할 수 있다. 일정 퍼센트는 차량 탑승 정원의 80%이상 등으로 설정될 수 있다. 다른 예 시로써, 차종 정보가 버스 또는 택시로 설정된 것에 응답하여, 인터페이스 제공 장치는 차량 형태와 부합하는 좌석 레이아웃의 좌석 속성을 추천할 수 있다. 인터페이스 제공 장치는 용도별로 편의성 중심의 좌석 속성을 추천할 수 있다. 예를 들어, 차량 트림의 제원 정 보 중 등급 정보가 고급 등급으로 설정된 것에 응답하여, 인터페이스 제공 장치는 고객들이 넓은 자리를 이용할 수 있도록, 선택된 레이아웃 타입에 포함된 복수의 좌석 중 일정 좌석을 제외하고 나머지 좌석에 대한 좌석 속 성을 결정할 수 있다. 또 다른 일 실시예에 따르면, 인터페이스 제공 장치는 특수 목적을 고려하여 좌석 속성을 추천할 수 있다. 예를 들어, 인터페이스 제공 장치는 영유아가 탑승할 수 있는 차량에 대한 좌석 속성을 추천하거나, 애완 동물을 동 반하여 탑승할 수 있는 차량에 대한 좌석 속성을 추천할 수 있다. 도 10은 일 실시예에 따른 하나 이상의 차량에 대한 기본 정보, 차량 정보 및 부가 정보에 대한 제2 데이터베이 스를 구성하는 방법에 관한 예시적인 도면이다. 도 10을 참조하면, 인터페이스 제공 장치는 하나 이상의 차량에 대한 기본 정보, 차량 정보 및 부가 정보에 대 한 제2 데이터 베이스를 구성할 수 있다. 제1 데이터베이스가 차량 트림에 대한 정보로 구성되었다면, 제2 데이 터베이스는 차량에 대한 정보로 구성되는 것으로써, 제1 데이터베이스의 정보를 포함하는 확장된 의미로써 이해 할 수 있다. 예를 들어 차량에 대한 기본 정보는, 자율 주행 구분, 차량을 제공하는 면허 종류, 법인명, 차량 상태 및 등록 일시 등에 대한 정보가 포함될 수 있다. 차량에 대한 차량 정보는 차량 ID, 차량명, 차량 번호, 차종 상품, 차량 트림, 차량 모델, 차량 이미지 및 좌석 이미지 등에 대한 정보가 포함될 수 있다. 차량에 대한 부가 정보는 차량이 제공되는 노선 등에 대한 정보가 포함될 수 있다. 예를 들어, 차량의 상태는 수요응답형 교통 서비스에 현재 제공될 수 있는지 여부를 나타내는 것으로써, 이용 가능, 이용 불가, 사고 중 어느 하나의 상태일 수 있다. 예를 들어, 차량 번호는 지역, 앞 번호, 한글 문자 및 뒷 번호로 이루어진 문자열일 수 있다. 지역은 최대 3자 의 한글일 수 있고, 앞 번호는 최대 3자의 숫자일 수 있다. 한글 문자는 최대 1자의 한글일 수 있고, 뒷 번호는 최대 4자의 숫자일 수 있다. 차량 번호는 관리자가 임시 번호판 사용을 입력한 경우, 임시 번호판일 수 있다. 임시 번호판은 한글'임'과 숫자 4자리로 구성된 문자열일 수 있다. 일 실시예에서, 인터페이스 제공 장치는 차량 번호에 대한 중복 여부를 확인할 수 있다. 인터페이스 제공 장치 는 차량 번호에 대한 정보가 중복되는 경우, 차량 번호에 대한 정보를 데이터 베이스에 추가할 수 없음을 알리 는 알람을 제공할 수 있다. 예를 들어, 인터페이스 제공 장치는 '이미 사용중인 차량 번호입니다'라는 알람을 제공하고, 입력 받은 차량 번호에 대한 정보를 리셋할 수 있다. 인터페이스 제공 장치는 차량 번호에 대한 정보 가 중복되지 않는 경우, 차량 번호에 대한 정보를 데이터 베이스에 추가할 수 있음을 알리는 알람을 제공할 수 있다. 예를 들어, 인터페이스 제공 장치는 '사용 가능한 차량번호입니다' 라는 알람을 제공할 수 있다. 예를 들어, 차량 정보 중 차종 상품에 대한 정보는 해당 차량이 제공하는 교통 서비스의 종류를 나타낼 수 있다. 교통 서비스의 종류는 수요 응답형 교통 수단(Demand Responsive Transport: DRT), 택시, 버스, 자율주 행 택시, 자율주행 버스 등을 포함할 수 있다. 예를 들어, 부가 정보 중 노선에 대한 정보는 해당 차량이 제공하는 교통 서비스의 세부 노선을 나타낼 수 있다. 일 예로, 노선은 교통 서비스 지역명 및 교통 서비스의 특정 노선을 나타내는 명칭으로 구분되어 표시될 수 있다. 도 11은 일 실시예에 따른 제2 데이터베이스에 저장된 하나 이상의 차량 중에서 소정의 조건에 부합하는 차량을 검색하는 제2 인터페이스에 관한 예시적인 도면이다. 도 11을 참조하면, 제2 인터페이스는 차량을 검색할 수 있는 조건을 설정하도록 구성되는 제2.1 영역 , 설정된 조건에 부합하는 차량에 대한 정보가 나열되도록 구성되는 제2.2 영역 및 관리자의 입력 을 수신하도록 구성되는 제2.3 영역을 포함할 수 있다. 한편, 도 11에서는 설명의 편의를 위해 제2.1 영 역, 제2.2 영역 및 제2.3 영역이 하나의 인터페이스에 표시되는 것으로 설명하였으나, 각 영 역은 서로 다른 인터페이스에 표시될 수도 있다. 인터페이스 제공 장치는 제2.1 영역에 검색 조건을 표시하고, 관리자의 검색 조건 설정을 수신할 수 있다. 예를 들어, 제2.1 영역에서 표시되는 검색 조건은 조회 구분, 차량 정보 및 일시 정보일 수 있다. 여기서 조회 구분은 자율주행 구분, 노선 선택 및 차종 상품에 대한 조건 등이 포함될 수 있고, 차량 정보는 차 량 번호, 면허 종류 및 상태 등을 포함할 수 있다. 인터페이스 제공 장치는 관리자가 설정한 검색 조건에 부합하는 차량 정보를 제2 데이터 베이스에서 검색하고, 부합하는 차량에 대한 정보를 제2.2 영역에 나열할 수 있다. 예를 들어, 제2.2 영역에서는 제2 데 이터베이스를 구성하는 차량 정보의 차량 ID, 차량 번호, 차량명, 법인명, 노선, 차종 상품, 차량 트림, 상태, 등록일시/수정일시, 등록자/수정자 등이 표시될 수 있다. 일 실시예에서, 인터페이스 제공 장치는 차량에 대한 노선 정보에 관하여 차량에 매핑된 노선 정보를 나열할 수 있다. 인터페이스 제공 장치는 차량에 매핑된 노선 정보가 복수개 일 경우, 복수개의 노선 정보를 나열할 수 있 다. 일 실시예에 따르면, 제2.3 영역은 다운로드탭과 등록탭을 포함할 수 있다. 인터페이스 제공 장치는 제 2.3 영역에서 다운로드탭에 대한 관리자의 입력을 수신한 것에 응답하여 차량에 대한 정보를 데이터 베이 스로부터 서버를 통해 관리자의 단말, 데이터베이스, 서버 등에게 전송할 수 있다. 인터페이스 제공 장치는 제 2.3 영역에서 등록탭에 대한 관리자의 입력을 수신한 것에 응답하여 차량 정보에 대한 제2 데이터베이스 를 구성할 수 있다. 도 12는 일 실시예에 따른 제1 데이터베이스로부터 선택된 차량 트림 정보에 대응하는 좌석 레이아웃을 획득하 여 제2 데이터베이스를 구성하는 방법에 관한 예시적인 도면이다. 도 12를 참조하면, 제2 데이터베이스를 구성하는 차량 정보에는 좌석 레이아웃이 포함될 수 있다. 인터페이스 제공 장치는 관리자의 차량 트림을 선택하는 입력을 수신할 수 있고, 제1 데이터베이스로부터 선택된 차량 트림 에 대응하는 좌석 레이아웃을 획득할 수 있다. 인터페이스 제공 장치는 획득된 좌석 레이아웃을 이용하여 제2 데이터베이스를 구성할 수 있다. 이 밖에도, 인터페이스 제공 장치는 차량 트림의 제원 정보나 좌석 정보 등의 제1 데이터베이스에서 획득한 정보를 이용하여, 제2 데이터 베이스를 구성할 수 있다. 차량 트림에 대한 제1 데 이터베이스와 차량에 대한 제2 데이터베이스의 연계가 가능함에 따라, 차량 관리 및 차량 트림 관리의 효율성과 편의성이 증대될 수 있다. 일 예로, 도 12는 쏠라티 가솔린 11인승 차량이 DRT 차종으로 제공되고, 총 11개의 좌석이 이용 가능하며, 세종 A 노선을 이용하는 것으로 데이터베이스가 구성된 일 예를 나타낸다. 일 실시예에서, 관제 서버는 제1 및 제2 데이터베이스를 구성하는 차량 및 차량 트림 정보(예를 들어, 차종 상 품 및 노선 등)를 이용하여 차량 정보에 대응되는 상태 표시 및 차량에 대한 제어를 수행할 수 있다. 관제 서버 는 데이터베이스의 차량 정보를 네트워크를 통해 사용자 단말에 전송하거나, 수요응답형 차량에 차량 뒷좌석 인 포테인먼트 시스템(RSI: rear-seat infotainment)을 통해 전송할 수 있다. 예를 들어, 도 12는 세종 A 노선에 서 DRT 서비스를 제공하고 있는 가솔린 11인승 차량에 대한 차량 정보 및 승객 탑승 정보의 일 예이다. 관제 서 버는 도 12의 차량 정보 및 좌석 레이아웃 정보를 이용한 승객의 좌석 점유 상태에 대한 정보를 사용자 단말이 나 수요응답형 차량에 표시되도록 전송할 수 있다. 도 13은 일 실시예에 따른 인터페이스 제공 장치의 블록도이다. 도 13을 참조하면, 인터페이스 제공 장치는 통신부, 프로세서 및 데이터 베이스(DB)를"}
{"patent_id": "10-2022-0058599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "포함할 수 있다. 도 13의 인터페이스 제공 장치에는 실시예와 관련된 구성요소들만이 도시되어 있다. 따라서, 도 13에 도시된 구성요소들 외에 다른 범용적인 구성요소들이 더 포함될 수 있음을 당해 기술분야의 통상 의 기술자라면 이해할 수 있다. 통신부는 외부 서버 또는 외부 장치와 유선/무선 통신을 하게 하는 하나 이상의 구성 요소를 포함할 수 있다. 예를 들어, 통신부는, 근거리 통신부(미도시), 이동 통신부(미도시) 및 방송 수신부(미도시) 중 적 어도 하나를 포함할 수 있다. 데이터 베이스(DB) 는 인터페이스 제공 장치 내에서 처리되는 각종 데이터들을 저장하는 하드웨어 로서, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있다. 데이터 베이스(DB)는 DRAM(dynamic random access memory), SRAM(static random access memory) 등과 같은 RAM(random access memory), ROM(read-only memory), EEPROM(electrically erasable programmable read- only memory), CD-ROM, 블루레이 또는 다른 광학 디스크 스토리지, HDD(hard disk drive), SSD(solid state drive), 또는 플래시 메모리를 포함할 수 있다. 프로세서는 인터페이스 제공 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는 데이 터 베이스(DB)에 저장된 프로그램들을 실행함으로써, 입력부(미도시), 디스플레이(미도시), 통신부 , 데이터 베이스(DB) 등을 전반적으로 제어할 수 있다. 프로세서는, 데이터 베이스 (DB)에 저장된 프로그램들을 실행함으로써, 인터페이스 제공 장치의 동작을 제어할 수 있다. 프로세서는 도 1 내지 도 12에서 상술한 인터페이스 제공 장치의 동작 중 적어도 일부를 제어할 수 있다. 프로세서는 ASICs (application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 제어기(controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서 (microprocessors), 기타 기능 수행을 위한 전기적 유닛 중 적어도 하나를 이용하여 구현될 수 있다. 일 실시예로, 인터페이스 제공 장치는 이동성을 가지는 전자 장치일 수 있다. 예를 들어, 인터페이스 제 공 장치는 스마트폰, 태블릿 PC, PC, 스마트 TV, PDA(personal digital assistant), 랩톱, 미디어 플레 이어, 내비게이션, 카메라가 탑재된 디바이스 및 기타 모바일 전자 장치로 구현될 수 있다. 또한, 인터페이스 제공 장치는 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 장치로 구현될 수 있다. 다른 실시예로, 인터페이스 제공 장치는 차량 내에 임베디드 되는 전자 장치일 수 있다. 예를 들어, 인터 페이스 제공 장치는 생산 과정 이후 튜닝(tuning)을 통해 차량 내에 삽입되는 전자 장치일 수 있다. 또 다른 실시예로, 인터페이스 제공 장치는 차량 외부에 위치하는 서버일 수 있다. 서버는 네트워크를 통 해 통신하여 명령, 코드, 파일, 컨텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구현 될 수 있다. 서버는 차량에 탑재된 장치들로부터 차량의 이동 경로를 결정하기 위해 필요한 데이터를 수신하고, 수신한 데이터에 기초하여 차량의 이동 경로를 결정할 수 있다. 또 다른 실시예로, 인터페이스 제공 장치에서 수행되는 프로세스는 이동성을 가지는 전자 장치, 차량 내 에 임베디되는 전자 장치 및 차량 외부에 위치하는 서버 중 적어도 일부에 의해 수행될 수 있다. 본 발명에 따른 실시 예는 컴퓨터 상에서 다양한 구성요소를 통하여 실행될 수 있는 컴퓨터 프로그램의 형태로 구현될 수 있으며, 이와 같은 컴퓨터 프로그램은 컴퓨터로 판독 가능한 매체에 기록될 수 있다. 이때, 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같 은, 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 한편, 상기 컴퓨터 프로그램은 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 프로그램의 예에는, 컴파일러에 의하여 만들어지는 것 과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함될 수 있다. 일 실시예에 따르면, 본 개시의 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 발명에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 발명이 한정되는 것은 아니 다. 본 발명에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사용은 단순히 본 발명을 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 발명의 범위 가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2022-0058599", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 자율 주행 방식을 설명하기 위한 도면이다. 도 2는 일 실시예에 따른 자율 주행 장치에 포함되는 하드웨어가 도시된 블록도이다. 도 3은 일 실시예에 따른 수요응답형 교통 시스템을 설명하기 위한 도면이다. 도 4는 일 실시예에 따른 관제 서버에서 수행되는 관제 기능을 설명하기 위한 예시적인 도면이다. 도 5는 일 실시예에 따른 하나 이상의 차량 트림의 각종 정보에 대한 제1 데이터베이스를 구성하는 방법을 설명 하기 위한 예시적인 도면이다. 도 6은 일 실시예에 따른 제1 데이터베이스에 저장된 하나 이상의 차량 트림 중에서 소정의 조건에 부합하는 차 량 트림을 검색하는 제1 인터페이스에 관한 예시적인 도면이다. 도 7은 일 실시예에 따른 레이아웃 타입 및 좌석 레이아웃에 대한 제1 데이터베이스를 구성하는 방법에 관한 예 시적인 도면이다. 도 8a는 일 실시예에 따른 좌석 레이아웃에 포함된 좌석의 좌석 속성을 설정함으로써 제1 데이터베이스를 구성 하는 방법에 관한 예시적인 도면이다. 도 8b는 일 실시예에 따른 좌석 레이아웃에 포함된 좌석의 좌석 속성을 설정함으로써 제1 데이터베이스를 구성 하는 방법에 관한 예시적인 도면이다. 도 9는 일 실시예에 따른 좌석 레이아웃에 포함된 복수의 좌석 각각에 대한 좌석 속성을 설정함으로써 제1 데이 터베이스를 구성하는 방법에 관한 예시적인 도면이다. 도 10은 일 실시예에 따른 하나 이상의 차량에 대한 기본 정보, 차량 정보 및 부가 정보에 대한 제2 데이터베이 스를 구성하는 방법에 관한 예시적인 도면이다.도 11은 일 실시예에 따른 제2 데이터베이스에 저장된 하나 이상의 차량 중에서 소정의 조건에 부합하는 차량을 검색하는 제2 인터페이스에 관한 예시적인 도면이다. 도 12는 일 실시예에 따른 제1 데이터베이스로부터 선택된 차량 트림에 대응하는 좌석 레이아웃을 획득하여 제2 데이터베이스를 구성하는 방법에 관한 예시적인 도면이다. 도 13은 일 실시예에 따른 인터페이스 제공 장치의 블록도이다."}
