{"patent_id": "10-2022-0136978", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0031835", "출원번호": "10-2022-0136978", "발명의 명칭": "무인 비행체 클러스터 상황 인식 시스템 및 방법", "출원인": "(주)엘컴텍", "발명자": "유대상"}}
{"patent_id": "10-2022-0136978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "GPS(Global Positioning System)와 카메라와 카메라 촬영 영상을 분석하는 영상영상처리 모듈을 구비한 복수개의 드론과, 무선 통신을 통해 상기 드론의 GPS와 교신하고 드론 촬영 영상에 관한 데이터를 수신하는 지상제어국을 포함하며;상기 영상처리모듈은 딥러닝(인공지능)으로 학습된 상황인식모델(10, context awareness model)을 구비하고,상기 복수개의 드론 중 제1 드론(D1)은 제1 위치(P1)에서 촬영한 영상에 기초하여 상기 상황인식모델(M)로 분석한 제1 위치(P1)의 객체 탐지 및 인식 결과를 산출한 후, \"제1 위치의 객체 탐지 및 객체 인식 결과\"를 다른 드론(제2 드론)에 전송하고;상기 제1 드론과 다른 제2 드론(D2)은 제1 위치(P1)와 다른 제2 위치(P2)에서 자신이 촬영한 영상을 분석한 상황인식모델(M)로 분석한 \"제2 위치(P2)의 객체 탐지 및 인식 결과\"를 1차적으로 산출하고,또한, 상기 제2 드론(D2)의 병합 판단부(30)는 제1 드론에서 전송된 \"제1 위치(P1)와 객체 탐지 및 객체 인식결과\"와 자신의 \"제2 위치(P2)의 객체 탐지 및 인식 결과\"를 병합하여 서로 다른 위치에서 바라 보았지만 \"동일객체라고 인식되는 객체\"에 대한 객체 인식(객체 분류)의 신뢰도를 증가시키는 것을 특징으로 하는 무인 비행체클러스터 상황 인식 시스템."}
{"patent_id": "10-2022-0136978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "GPS(Global Positioning System)와 카메라와 촬영 영상을 분석하는 영상영상처리 모듈을 구비하고 안테나 및 통신수단을 통하여 지상제어국과 교신하는 복수개의 드론을 준비하는 드론 준비 단계(S10)와;영상처리모듈에 구비된 상황인식모델(M, context awareness model)에 대하여 객체 탐지, 객체 인식 또는 상황인식(context awareness )을 딥러닝으로 학습시키는 모델 학습 단계(S20)와;상기 복수개의 드론 중 제1 드론(D1)이 제1 위치(P1)에서 촬영한 영상을 상황인식모델(M)로 분석한 제1 위치의객체 탐지 및 인식 결과를 산출하는 제1 위치 결과 산출 단계(S30)와;상기 제1 드론(D1)이 상기 \"제1 위치(P1)의 객체 탐지 및 객체 인식 결과\"를 제1 드론과 다른 제2 드론(D2)에전송하는 전송 단계(S40)와;상기 제2 드론(D2)이 제1 위치(P1)와 다른 제2 위치(P2)에서 촬영한 영상을 상황인식모델(M)로 분석하여 \"제2위치(P2)의 객체 탐지 및 인식 결과\"를 산출하는 제2 위치 결과 단계(S50)와;상기 제2 드론(D2)의 병합 판단부(30)가 상기 제1 드론(D1)에서 전송된 \"제1 위의 객체 탐지 및 객체 인식결과\"와 자신의 \"제2 위치의 객체 탐지 및 인식 결과\"를 병합하여 판단하는, 복수 위치 병합 판단 단계(S60);를수행하여, 적어도 두개의 드론이 다른 위치에서 바라 보았지만 \"동일 객체라고 인식되는 객체\"에 대한 객체 인식 또는 객체 분류의 신뢰도를 증가시키는 것을 특징으로 하는 무인 비행체 클러스터 상황 인식 방법."}
{"patent_id": "10-2022-0136978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서상기 제1 드론 및 제2 드론(D2)과 다른 제3 드론(D2)이 제1 위치(P1) 및 제2 위치(P2) 다른 제3 위치(P3)에서촬영한 영상을 상황인식모델(M)로 분석하여 \"제3 위치(P3)의 객체 탐지 및 인식 결과를 산출한 후,제1 위의 객체 탐지 및 객체 인식 결과\"와 \"제2 위치의 객체 탐지 및 인식 결과\"와 \"제2 위치의 객체 탐지 및공개특허 10-2024-0031835-3-인식 결과\"를 병합하여 판단하되 다수 드론의 인식 결과를 대표 인식 결과로 정의하는 것을 특징으로 하는 무인비행체 클러스터 상황 인식 시스템."}
{"patent_id": "10-2022-0136978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 상황인식모델(M, context awareness model)은 객체 종류 뿐 아니라 객체 부분(일부, 예를 들어, 탱크 사각몸체와 포격 기둥 분별, 코끼리 다리와 몸통과 꼬리의 분별)을 분별하여 분류(Class)할 수 있도록 학습되며,상기 병합 판단부(30)는 각 드론의 촬영 위치에 순응하는 객체 부분(파트)들이 인식되었는지 여부 종합하여 판단하여, 위치에 역행하는 인식은 오류로 판단하는 것을 특징으로 하는 무인 비행체 클러스터 상황 인식 시스템."}
{"patent_id": "10-2022-0136978", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 GPS(Global Positioning System)와 카메라와 카메라 촬영 영상을 분석하는 영상영상처리 모듈을 구 비한 복수개의 드론과, 무선 통신을 통해 상기 드론의 GPS와 교신하고 드론 촬영 영상에 관한 데이터를 수신하는 지상제어국을 포함하며; 상기 영상처리모듈은 딥러닝(인공지능)으로 학습된 상황인식모델(10, context awareness (뒷면에 계속)"}
{"patent_id": "10-2022-0136978", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 복수의 드론 촬영 및 인공 지능 인식에 의해 인식 정확도를 향상시키는 무인 비행체 클러스터 상황 감시 시스템에 관한 것이다."}
{"patent_id": "10-2022-0136978", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "한국특허 10-2332039 배재대학교 2019년 07월 19일 출원 무인 비행체의 군집 비행 관리 시스템은 GPS 위치 정 보를 이용하여 촬영 목표 영역을 군집 비행하면서 영상 획득을 위한 촬영을 수행하되, 상기 촬영 목 표 영역을 이동하면서 원거리 촬영을 수행하고 상기 원거리 촬영을 토대로 근거리 촬영을 수행할 복수의 서브 무인 비행체 의 경로를 설정하는 하나의 마스터 무인 비행체, 및 상기 설정된 경로에 기초하여 촬영 위치로 이동 하여 군집 비행을 하면서 근거리 영상을 촬영하는 복수의 서브 무인 비행체를 포함하는 무인 비행체; 및 상기 무인 비행체 의 군집 비행 제어를 관리하는 군집 비행 관리 서버 를 포함하고, 상기 군집 비행 관리 서버는 상기 복수의 서 브 무인 비행체 각각의 장애 발생 또는 경로 이탈을 확인하는 진단부; 및 상기 진단부에의해 상기 장애 발생 또 는 경로 이탈이 확인된 경우, 상기 장애 발생 또는 경로 이탈이 확인된 서브 무인 비행체(오류 무인 비행체)의 임무를 나머지 정상의 서브 무인 비행체(정상 무인 비행체)가 이어서 수행하도록 제어하는 비행 제어부를 포함 하며, 상기 비행 제어부는상기 오류 무인 비행체의 임무를 상기 정상 무인 비행체가 이어서 수행하도록 제어하 기 위하여, 상기 오류 무인 비행체의 임무 수행과 관련한 이력 정보를 데이터베이스로부터 획득하고, 상기 이력 정보를 상기 정상 무인 비행체와 공유하는 것을 특징으로 하는 무인 비행체의 군집 비행 관리 시스템을 개시한 다."}
{"patent_id": "10-2022-0136978", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 복수의 드론의 인긱 결과를 병합하여 판단함으로써 촬영 및 인공 지능 인식에 의해 객체의 인식 정확 도를 향상시키는 무인 비행체 클러스터 상황 감시 시스템에 관한 것이다."}
{"patent_id": "10-2022-0136978", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 무인 비행체 클러스터 상황 인식 시스템은, GPS(Global Positioning System)와 카메라와 카메라 촬영 영상을 분석하는 영상영상처리 모듈을 구비한 복수개의 드론과, 무선 통신을 통해 상기 드론의 GPS와 교신하고 드론 촬영 영상에 관한 데이터를 수신하는 지상제어국을 포함하며; 상기 영상처리모듈은 딥러닝(인공지능)으로 학습된 상황인식모델(10, context awareness model)을 구비하고, 상 기 복수개의 드론 중 제1 드론(D1)은 제1 위치(P1)에서 촬영한 영상에 기초하여 상기 상황인식모델(M)로 분석한 제1 위치(P1)의 객체 탐지 및 인식 결과를 산출한 후, \"제1 위치의 객체 탐지 및 객체 인식 결과\"를 다른 드론 (제2 드론)에 전송하고; 상기 제1 드론과 다른 제2 드론(D2)은 제1 위치(P1)와 다른 제2 위치(P2)에서 자신이 촬영한 영상을 분석한 상 황인식모델(M)로 분석한 \"제2 위치(P2)의 객체 탐지 및 인식 결과\"를 1차적으로 산출하고, 또한, 상기 제2 드론(D2)의 병합 판단부는 제1 드론에서 전송된 \"제1 위치(P1)와 객체 탐지 및 객체 인식 결과\"와 자신의 \"제2 위치(P2)의 객체 탐지 및 인식 결과\"를 병합하여 서로 다른 위치에서 바라 보았지만 \"동일 객체라고 인식되는 객체\"에 대한 객체 인식(객체 분류)의 신뢰도를 증가시키는 것을 특징으로 한다. 본 발명의 무인 비행체 클러스터 상황 인식 시스템은, GPS(Global Positioning System)와 카메라와 촬영 영상을 분석하는 영상영상처리 모듈을 구비하고 안테나 및 통신수단을 통하여 지상제어국과 교신하는 복수개의 드론을 준비하는 단계(S10)와; 영상처리모듈에 구비된 상황인식모델(M, context awareness model)에 대하여 객체 탐지, 객체 인식 또는 상황 인식(context awareness )을 딥러닝으로 학습시키는 단계(S20)와; 상기 복수개의 드론 중 제1 드론(D1)이 제1 위치(P1)에서 촬영한 영상을 상황인식모델(M)로 분석한 제1 위치의 객체 탐지 및 인식 결과를 산출하는 단계(S30)와; 상기 제1 드론(D1)이 상기 \"제1 위치(P1)의 객체 탐지 및 객체 인식 결과\"를 제2 드론과 다른 제2 드론(D2)에 전송하는 단계(S40)와; 상기 제2 드론(D2)이 제1 위치(P1)와 다른 제2 위치(P2)에서 촬영한 영상을 상황인식모델(M)로 분석하여 \"제2 위치(P2)의 객체 탐지 및 인식 결과\"를 산출하는 단계(S50)와; 상기 제2 드론(D2)의 병합 판단부가 상기 제1 드론(D1)에서 전송된 \"제1 위의 객체 탐지 및 객체 인식 결과\"와 자신의 \"제2 위치의 객체 탐지 및 인식 결과\"를 병합하여 판단하는 단계(S60);를 수행하여, 적어도 두개의 드론이 다른 위치에서 바라 보았지만 \"동일 객체라고 인식되는 객체\"에 대한 객체 인식 또는 객 체 분류의 신뢰도를 증가시키는 것을 특징으로 한다. 본 발명의 무인 비행체 클러스터 상황 인식 시스템에 있어서, 상기 제1 드론 및 제2 드론(D2)과 다른 제3 드론 (D2)이 제1 위치(P1) 및 제2 위치(P2) 다른 제3 위치(P3)에서 촬영한 영상을 상황인식모델(M)로 분석하여 \"제3 위치(P3)의 객체 탐지 및 인식 결과를 산출한 후, 제1 위의 객체 탐지 및 객체 인식 결과\"와 \"제2 위치의 객체 탐지 및 인식 결과\"와 \"제2 위치의 객체 탐지 및 인식 결과\"를 병합하여 판단하되 다수 드론의 인식 결과를 대 표 인식 결과로 정의하는 것이 바람직하다. 본 발명의 무인 비행체 클러스터 상황 인식 시스템에 있어서, 상황인식모델(M, context awareness model)은 객 체 종류 뿐 아니라 객체 부분(일부, 예를 들어, 탱크 사각 몸체와 포격 기둥 분별, 코끼리 다리와 몸통과 꼬리 의 분별)을 분별하여 분류(Class)할 수 있도록 학습되며, 상기 병합 판단부는 각 드론의 촬영 위치에 순응 하는 객체 부분(파트)들이 인식되었는지 여부 종합하여 판단하여, 위치에 역행하는 인식은 오류로 판단하는 것이 바람직하다."}
{"patent_id": "10-2022-0136978", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르는 경우, 복수의 드론의 인긱 결과를 병합하여 판단함으로써 촬영 및 인공 지능 인식에 의해 객 체의 인식 정확도를 향상시키는 무인 비행체 클러스터 상황 감시 시스템이 제공된다."}
{"patent_id": "10-2022-0136978", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 본 발명의 무인 비행체 클러스터 상황 인식 시스템 및 방법에 대하여 첨부된 도면을 참조하여 상세허 게 설명한다. 도 1은 무인 비행체 클러스터 상황 인식 시스템 설명도이고, 도 2는 무인 비행체 클러스터 상황 인식 방법 흐름도이다. 도 1에 도시된 바와 같이, 본 발명의 무인 비행체 클러스터 상황 인식 시스템은, GPS(Global Positioning System)와 카메라와 카메라 촬영 영상을 분석하는 영상영상처리 모듈을 구비한 복수개의 드론과, 무선 통신을 통해 상기 드론의 GPS와 교신하고 드론 촬영 영상에 관한 데이터를 수신하는 지상제어국을 포함한다. 도 1에 도시된 바와 같이, 영상처리모듈은 딥러닝(인공지능)으로 학습된 상황인식모델(10, context awareness model)을 구비하고, 상기 복수개의 드론 중 제1 드론(D1)은 제1 위치(P1)에서 촬영한 영상에 기초하여 상기 상 황인식모델(M)로 분석한 제1 위치(P1)의 객체 탐지 및 인식 결과를 산출한 후, \"제1 위치의 객체 탐지 및 객체 인식 결과\"를 다른 드론(제2 드론)에 전송한다. 도 1에 도시된 바와 같이, 제1 드론과 다른 제2 드론(D2)은 제1 위치(P1)와 다른 제2 위치(P2)에서 자신이 촬영 한 영상을 분석한 상황인식모델(M)로 분석한 \"제2 위치(P2)의 객체 탐지 및 인식 결과\"를 1차적으로 산출한다. 또한, 상기 제2 드론(D2)의 병합 판단부는 제1 드론에서 전송된 \"제1 위치(P1)와 객체 탐지 및 객체 인식 결과\"와 자신의 \"제2 위치(P2)의 객체 탐지 및 인식 결과\"를 병합하여 서로 다른 위치에서 바라 보았지만 \"동일 객체라고 인식되는 객체\"에 대한 객체 인식(객체 분류)의 신뢰도를 증가시키게 된다. <다수 드론> 본 발명의 무인 비행체 클러스터 상황 인식 시스템에 있어서, 상기 제1 드론 및 제2 드론(D2)과 다른 제3 드론 (D2)이 제1 위치(P1) 및 제2 위치(P2) 다른 제3 위치(P3)에서 촬영한 영상을 상황인식모델(M)로 분석하여 \"제3 위치(P3)의 객체 탐지 및 인식 결과를 산출한 후, 제1 위의 객체 탐지 및 객체 인식 결과\"와 \"제2 위치의 객체 탐지 및 인식 결과\"와 \"제2 위치의 객체 탐지 및 인식 결과\"를 병합하여 판단하되 다수 드론의 인식 결과를 대 표 인식 결과로 정의하는 것이 바람직하다. <객체 부분 인식, 객체 방향 인식> 본 발명의 무인 비행체 클러스터 상황 인식 시스템에 있어서, 상황인식모델(M, context awareness model)은 객 체 종류 뿐 아니라 객체 부분(일부, 예를 들어, 탱크 사각 몸체와 포격 기둥 분별, 코끼리 다리와 몸통과 꼬리 의 분별)을 분별하여 분류(Class)할 수 있도록 학습되며, 상기 병합 판단부는 각 드론의 촬영 위치에 순응 하는 객체 부분(파트)들이 인식되었는지 여부 종합하여 판단하여, 위치에 역행하는 인식은 오류로 판단하는 것 이 바람직하다. 예를들어, 제1 드론(D1)의 위치가 남쪽이고 제2 드론(D2)의 위치가 제1 드론(D1)의 북쪽에 있을때, 제1 드론 (D1)이 남쪽을 향하는 코끼리 코(부분, 파트)와 몸체를 인식하였고 제2 드론(D2)이 코끼리의 꼬리(부 , 파트)를 인식하였다면 병합 판단부는 높은 신뢰도로 인식된 객체가 코끼리라고 판단할 수 있다. 반대로 제1 드론(D1)의 위치가 남쪽이고 제2 드론(D2)의 위치가 제1 드론(D1)의 북쪽에 있을때, 제1 드론(D1)이 남쪽을 향하는 코끼리 코(부분, 파트)와 몸체를 인식하였는데 제2 드론(D2)이 북쪽을 향하는 코끼리의 코(부분 , 파트)와 몸체를 인식하였다면 병합 판단부는 인식된 객체가 동일하지 않거나 코끼리라는 인식을 오류로 판정할 수 있다. 제1 드론(D1)이 코끼리를 인식하였는데 제2 드론(D1)이 같은 위치로 추정되는 장소에서 탱크를 인식하였다면 병 합 판단부는 상기 인식의 신뢰도를 낮추거나 불확실(오류)로 판정할 수 있다. 도 2에 도시된 바와 같이, 본 발명의 무인 비행체 클러스터 상황 인식 방법은, 드론 준비 단계(S10)와 모델 학 습 단계(S20)와 1 위치 결과 산출 단계(S30)와 전송 단계(S40)와 제2 위치 결과 단계(S50)와 복수 위치 병합 판 단 단계(S60)를 포함한다. 먼저 드론 준비 단계(S10)에서 GPS(Global Positioning System)와 카메라와 촬영 영상을 분석하는 영상영상처리 모듈을 구비하고 안테나 및 통신수단을 통하여 지상제어국과 교신하는 복수개의 드론을 준비한다. 모델 학습 단계(S20)에서 상처리모듈에 구비된 상황인식모델(M, context awareness model)에 대하여 객체 탐지, 객체 인식 또는 상황 인식(context awareness )을 딥러닝으로 학습시킨다. 제1 위치 결과 산출 단계(S30)에서, 복수개의 드론 중 제1 드론(D1)이 제1 위치(P1)에서 촬영한 영상을 상황인 식모델(M)로 분석한 제1 위치의 객체 탐지 및 인식 결과를 산출한다. 전송 단계(S40)에서, 제1 드론(D1)이 상기 \"제1 위치(P1)의 객체 탐지 및 객체 인식 결과\"를 제1 드론과 다른 제2 드론(D2)에 전송한다. 제2 위치 결과 단계(S50)에서, 제2 드론(D2)이 제1 위치(P1)와 다른 제2 위치(P2)에서 촬영한 영상을 상황인식 모델(M)로 분석하여 \"제2 위치(P2)의 객체 탐지 및 인식 결과\"를 산출한다. 복수 위치 병합 판단 단계(S60)에서, 제2 드론(D2)의 병합 판단부가 상기 제1 드론(D1)에서 전송된 \"제1 위 의 객체 탐지 및 객체 인식 결과\"와 자신의 \"제2 위치의 객체 탐지 및 인식 결과\"를 병합하여 판단을 수행한다. 이로서 적어도 두개의 드론이 다른 위치에서 바라 보았지만 \"동일 객체라고 인식되는 객체\"에 대한 객체 인식 또는 객체 분류의 신뢰도를 증가시키게 된다.본 발명은 상기에서 언급한 바람직한 실시예와 관련하여 설명됐지만, 본 발명의 범위가 이러한 실시예에 한정되 는 것은 아니며, 본 발명의 범위는 이하의 특허청구범위에 의하여 정하여지는 것으로 본 발명과 균등 범위에 속 하는 다양한 수정 및 변형을 포함할 것이다. 아래의 특허청구범위에 기재된 도면부호는 단순히 발명의 이해를 보조하기 위한 것으로 권리범위의 해석에 영향 을 미치지 아니함을 밝히며 기재된 도면부호에 의해 권리범위가 좁게 해석되어서는 안될 것이다."}
{"patent_id": "10-2022-0136978", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 무인 비행체 클러스터 상황 인식 시스템 설명도. 도 2는 본 발명의 무인 비행체 클러스터 상황 인식 방법 흐름도."}
