{"patent_id": "10-2021-7035338", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0149105", "출원번호": "10-2021-7035338", "발명의 명칭": "자동화된 신호 준수 모니터링 및 경고 시스템", "출원인": "와이-트로닉스, 엘엘씨", "발명자": "조던, 로렌스 비."}}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 모바일 자산으로부터 데이터를 처리하는 방법으로서, 상기 방법은:상기 적어도 하나의 모바일 자산으로부터 멀리 떨어진 데이터 센터 및 상기 적어도 하나의 모바일 자산에 탑재된 데이터 센터 중 하나를 사용하여, 상기 적어도 하나의 모바일 자산에 탑재된 적어도 하나의 데이터 소스; 및 상기 적어도 하나의 모바일 자산에서 멀리 떨어진 적어도 하나의 데이터 소스 중 적어도 하나로부터의 적어도 하나의 데이터 신호에 기초하여 데이터를 수신하는 단계;상기 데이터 센터를 사용하여, 하나 이상의 트리거(trigger) 조건이 상기 데이터에 기초하여 감지되었던 조건에서 상기 데이터 센터의 제1 인공 지능 모델을 사용하여, 상기 적어도 하나의 모바일 자산이 선두(leading) 모바일 자산 및 제어 모바일 자산 중 적어도 하나인 것을 결정하는 단계;상기 데이터 센터를 사용하여, 상기 선두 모바일 자산 및 상기 제어 모바일 자산 중 적어도 하나로부터의 비디오 콘텐츠-여기서 상기 비디오 콘텐츠는 상기 적어도 하나의 트리거 조건 이전에 구성 가능한 미리 결정된 양의시간 동안 수집된 구성 가능한 미리 결정된 양의 상기 데이터를 포함함-를 획득하는 단계;상기 데이터 센터의 데이터베이스를 사용하여, 상기 비디오 콘텐츠를 저장하는 단계;상기 데이터 센터의 제2 인공 지능 모델을 사용하여, 상기 비디오 콘텐츠에 기초하여 에피소드(episode)를 결정하는 단계;상기 데이터 센터의 상기 데이터베이스를 사용하여 상기 에피소드를 저장하는 단계; 및상기 데이터 센터를 사용하여, 미리 결정된 양의 사용자에게 전자 메시지를 전송하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 적어도 하나의 트리거 조건은:상기 적어도 하나의 모바일 자산이 복수의 신호 중 하나의 신호-여기서 상기 하나의 신호는 상기 데이터 센터의상기 데이터베이스 내에 저장된 상기 복수의 신호의 위도 및 경도 좌표에 의해 참조되는 위치를 포함함-를 지나이동했다는 것을 나타내는 상기 데이터;상기 적어도 하나의 모바일 자산이 상기 복수의 신호 중 상기 하나의 신호의 미리 결정된 거리 내에서 정지했으며, 상기 적어도 하나의 모바일 자산이 상기 하나의 신호의 상기 위치 이전에 상기 정지를 허용하기 위해 과도한 제동력을 사용했다는 것을 나타내는 상기 데이터; 및속도 제한을 나타내는 상기 데이터중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 에피소드는:상기 적어도 하나의 모바일 자산이 복수의 신호 중 하나의 신호-여기서 상기 하나의 신호는 상기 데이터 센터의상기 데이터베이스 내에 저장된 상기 복수의 신호의 위도 및 경도 좌표에 의해 참조되는 위치를 포함함-를 지나이동했다는 것;상기 적어도 하나의 모바일 자산이 상기 복수의 신호 중 상기 하나의 신호의 미리 결정된 거리 내에서 정지했으며, 상기 적어도 하나의 모바일 자산이 상기 하나의 신호의 상기 위치 이전에 상기 정지를 허용하기 위해 과도공개특허 10-2021-0149105-3-한 제동력을 사용했다는 것; 및상기 데이터가 속도 제한을 나타낸다는 것중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 데이터는:상기 적어도 하나의 모바일 자산 상부, 내부 또는 주위에 있는 적어도 하나의 카메라로부터의 데이터, 이미지분석, 아날로그 파라미터, 아날로그 입력, 디지털 파라미터, 디지털 입력, I/O 모듈, 차량 제어기, 엔진제어기, 관성 센서, 카메라, 포지티브 열차 제어(PTC)/신호 데이터, 연료 데이터, 셀룰러 전송 감지기, 내부 구동 데이터, 맵 데이터, 속도, 압력, 온도, 전류, 전압, 가속도, 부울(Boolean) 데이터, 스위치 위치, 액츄에이터 위치, 경고등 조명, 액츄에이터 명령, 글로벌 포지셔닝 시스템(GPS) 데이터, 제동력, 자동 전자 알림, 지리정보 시스템(GIS) 데이터, 위치, 속도, 고도, 내부 생성 정보, 규정 속도 제한, 비디오 정보, 이미지 정보, 음성 정보, 경로 정보, 일정 정보, 화물 목록(manifest) 정보, 환경 조건 정보, 현재 기상 조건, 예측 기상 조건,자산 제어 상태, 운영 데이터, 및 포지티브 열차 제어(PTC)에 의해 생성된 데이터 중 적어도 하나를 포함하는것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 데이터는 상기 적어도 하나의 모바일 자산과 적어도 하나의 주위의 자산 중 적어도 하나에서 발생하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 적어도 하나의 모바일 자산으로부터 멀리 떨어진 데이터 센터 및 상기 적어도 하나의 모바일 자산에 탑재된 데이터 센터 중 하나를 사용하여, 적어도 매 매 5분마다 상기 데이터가 수신되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 데이터는:상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 카메라로부터의 비디오 정보;상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 카메라로부터의 이미지 정보; 및상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 마이크로폰으로부터의 오디오 정보중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 비디오 콘텐츠는:상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 카메라로부터의 비디오 정보;상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 카메라로부터의 이미지 정보; 및상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 마이크로폰으로부터의 오디오 정보중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2021-0149105-4-제1항에 있어서, 상기 적어도 하나의 모바일 자산에 탑재된 상기 적어도 하나의 데이터 소스는, 아날로그 입력,디지털 입력, I/O 모듈, 차량 제어기, 엔진 제어기, 관성 센서, 글로벌 포지셔닝 시스템(GPS), 적어도 하나의카메라, 포지티브 열차 제어(PTC)/신호 데이터, 연료 데이터, 셀룰러 전송 감지기, 및 내부 구동 데이터 중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 적어도 하나의 모바일 자산으로부터 멀리 떨어진 상기 적어도 하나의 데이터 소스는 경로/승무원 목록 구성요소, 날씨 구성요소, 및 맵 구성요소 중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 적어도 하나의 모바일 자산에 탑재된 상기 적어도 하나의 데이터 소스 중 적어도 하나 및상기 적어도 하나의 모바일 자산으로부터 멀리 떨어진 적어도 하나의 데이터 소스는, 적어도 하나의 360도 카메라, 적어도 하나의 고정된 카메라, 적어도 하나의 내로우 뷰 카메라(narrow view camera), 적어도 하나의 와이드 뷰 카메라(wide view camera), 적어도 하나의 360도 어안 뷰 카메라 중 적어도 하나를 포함하고, 레이더(radar) 및 빛 감지 및 거리 측정(LIDAR) 중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "적어도 하나의 모바일 자산으로부터 데이터 처리하기 위한 시스템으로서, 상기 시스템은:적어도 하나의 이미지 측정 장치, 적어도 하나의 비디오 측정 장치, 적어도 하나의 거리 측정 장치, 및 적어도하나의 마이크로폰 중 적어도 하나;적어도 하나의 이미지 측정 장치, 상기 적어도 하나의 비디오 측정 장치, 상기 적어도 하나의 거리 측정 장치,상기 적어도 하나의 마이크로폰, 상기 적어도 하나의 모바일 자산에 탑재된 적어도 하나의 데이터 소스, 및 상기 적어도 하나의 모바일 자산으로부터 멀리 떨어진 적어도 하나의 데이터 소스 중 적어도 하나로부터 적어도하나의 데이터 신호를 수신하도록 구성되며, 상기 적어도 하나의 모바일 자산에 탑재된 데이터 레코더; 상기 적어도 하나의 데이터 신호에 기초하여 데이터를 수신하도록 구성된 데이터 센터;상기 데이터 센터의 제1 인공 지능 모델-여기서 상기 제1 인공 지능 모델은, 상기 데이터에 기초하여 상기 데이터 센터에 의해 적어도 하나의 트리거 조건이 감지되었던 조건에서 상기 적어도 하나의 모바일 자산이 선두 모바일 자산과 제어 모바일 자산 중 적어도 하나인 것을 결정하도록 구성됨-;상기 데이터 센터의 데이터베이스-여기서 상기 데이터베이스는 상기 적어도 하나의 이미지 측정 장치, 상기 적어도 하나의 비디오 측정 장치, 상기 적어도 하나의 거리 측정 장치, 상기 적어도 하나의 마이크로폰, 상기 적어도 하나의 모바일 자산에 탑재된 상기 적어도 하나의 데이터 소스, 및 상기 적어도 하나의 모바일 자산에서멀리 떨어진 상기 적어도 하나의 데이터 소스 중 적어도 하나로부터 획득된 비디오 콘텐츠를 저장하도록 구성됨-; 및상기 데이터 센터의 제2 인공 지능 모델을 포함하고,상기 제2 인공 지능 모델은 상기 비디오 콘텐츠에 기초하여 에피소드를 결정하도록 구성되는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 적어도 하나의 트리거 조건은:상기 적어도 하나의 모바일 자산이 복수의 신호 중 하나의 신호-여기서 상기 하나의 신호는 상기 데이터 센터의상기 데이터베이스 내에 저장된 상기 복수의 신호의 위도 및 경도 좌표에 의해 참조되는 위치를 포함함-를 지나이동했다는 것을 나타내는 상기 데이터;상기 적어도 하나의 모바일 자산이 상기 복수의 신호 중 상기 하나의 신호의 미리 결정된 거리 내에서 정지했으며, 상기 적어도 하나의 모바일 자산이 상기 하나의 신호의 상기 위치 이전에 정지를 허용하기 위해 과도한 제공개특허 10-2021-0149105-5-동력을 사용했다는 것을 나타내는 상기 데이터; 및속도 제한을 나타내는 상기 데이터중 적어도 하나를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 에피소드는:상기 적어도 하나의 모바일 자산이 복수의 신호 중 하나의 신호-여기서 상기 하나의 신호는 상기 데이터 센터의상기 데이터베이스 내에 저장된 상기 복수의 신호의 위도 및 경도 좌표에 의해 참조되는 위치를 포함함-를 지나이동했다는 것;상기 적어도 하나의 모바일 자산이 상기 복수의 신호 중 상기 하나의 신호의 미리 결정된 거리 내에서 정지했으며, 상기 적어도 하나의 모바일 자산이 상기 하나의 신호의 상기 위치 이전에 정지를 허용하기 위해 과도한 제동력을 사용했다는 것; 및상기 데이터가 속도 제한을 나타낸다는 것중 적어도 하나를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서, 상기 이미지 측정 장치는, 적어도 하나의 360도 카메라, 적어도 하나의 고정된 카메라, 적어도 하나의 내로우 뷰 카메라, 적어도 하나의 와이드 뷰 카메라, 적어도 하나의 360도 어안 뷰 카메라 중 적어도하나를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서, 상기 범위 측정 장치는 레이더 및 빛 감지 및 거리 측정(LIDAR) 중 적어도 하나를 포함하는것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서, 상기 데이터는:상기 적어도 하나의 모바일 자산 상부, 내부 또는 주위에 있는 적어도 하나의 카메라로부터의 데이터, 이미지분석, 아날로그 파라미터, 아날로그 입력, 디지털 파라미터, 디지털 입력, I/O 모듈, 차량 제어기, 엔진제어기, 관성 센서, 카메라, 포지티브 열차 제어(PTC)/신호 데이터, 연료 데이터, 셀룰러 전송 감지기, 내부 구동 데이터, 맵 데이터, 속도, 압력, 온도, 전류, 전압, 가속도, 부울(Boolean) 데이터, 스위치 위치, 액츄에이터 위치, 경고등 조명, 액츄에이터 명령, 글로벌 포지셔닝 시스템(GPS) 데이터, 제동력, 자동 전자 알림, 지리정보 시스템(GIS) 데이터, 위치, 속도, 고도, 내부 생성 정보, 규정 속도 제한, 비디오 정보, 이미지 정보, 음성 정보, 경로 정보, 일정 정보, 화물 목록 정보, 환경 조건 정보, 현재 기상 조건, 예측 기상 조건, 자산 제어상태, 운영 데이터, 및 포지티브 열차 제어(PTC)에 의해 생성된 데이터 중 적어도 하나를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12항에 있어서, 상기 데이터는 상기 적어도 하나의 모바일 자산 및 적어도 하나의 주위의 자산 중 적어도 하나로부터 발생하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12항에 있어서, 상기 데이터는:상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 카메라로부터의 비디오 정보;상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 카메라로부공개특허 10-2021-0149105-6-터의 이미지 정보; 및상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 마이크로폰으로부터의 오디오 정보중 적어도 하나를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제12항에 있어서, 상기 비디오 콘텐츠는:상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 카메라로부터의 비디오 정보;상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 카메라로부터의 이미지 정보; 및상기 모바일 자산 내, 상기 모바일 자산 상부, 및 상기 모바일 자산 주위 중 적어도 하나에 위치한 마이크로폰으로부터의 오디오 정보중 적어도 하나를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제12항에 있어서, 상기 적어도 하나의 모바일 자산에 탑재된 상기 적어도 하나의 데이터 소스는, 아날로그입력, 디지털 입력, I/O 모듈, 차량 제어기, 엔진 제어기, 관성 센서, 글로벌 포지셔닝 시스템(GPS), 적어도 하나의 카메라, 포지티브 열차 제어(PTC)/신호 데이터, 연료 데이터, 셀룰러 전송 감지기, 및 내부 구동 데이터중 적어도 하나를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제12항에 있어서, 상기 적어도 하나의 모바일 자산으로부터 멀리 떨어진 상기 적어도 하나의 데이터 소스는 경로/승무원 목록 구성요소, 날씨 구성요소, 및 맵 구성요소 중 적어도 하나를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제1항에 있어서, 상기 에피소드가 감지되는 조건에서, 상기 적어도 하나의 모바일 자산 내의 가청 경보를 재생하는 단계를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2021-7035338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제12항에 있어서, 상기 에피소드가 감지되는 조건에서, 사운드를 재생하도록 구성된 가청 경보를 더 포함하는것을 특징으로 하는 시스템."}
{"patent_id": "10-2021-7035338", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "데이터 레코더와 자동화된 신호 모니터링 및 경고 시스템을 포함하는 모바일 자산용 데이터 수집 및 기록 시스템 (DARS)이 개시된다. 데이터 레코더는 데이터 인코더, 탑재형 데이터 관리자, 차량 이벤트 감지기, 적어도 하나의 로컬 메모리 구성요소 및 대기열 저장소를 포함한다. DARS는 적어도 하나의 입력 센서로부터의 데이터를 처리하 (뒷면에 계속)"}
{"patent_id": "10-2021-7035338", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2019년 3월 29일에 출원된 미국 가출원 번호 62/825,943의 우선권, 2019년 4월 5일에 출원된 미국 가 출원 번호 62/829,730의 우선권, 2020년 3월 28일에 출원된 미국 비-가출원 번호 16/833,590의 우선권, 2020년 3월 28일에 출원된 미국 비-가출원 번호 16/833,590의 우선권을 주장하며, 법률이 허용하는 한도 내에서 그 내 용 전체가 참조로 본원에 포함된다. 본 출원은 또한 2016년 5월 16일에 출원된 미국 가출원 번호 62/337,227의 우선권, 2017년 5월 15일에 출원된 미국 비-가출원 번호 15/595,650, 현재 2018년 4월 3일에 발행된 미국 특허 번호 9,934,623의 우선권, 2018년 2월 28일에 출원된 미국 비-가출원 번호 15/907,486, 현재 2019년 10월 15일 에 발행된 미국 특허 번호 10,445,951의 우선권, 2016년 5월 16일에 출원된 미국 가출원 번호 62/337,225의 우 선권, 2017년 5월 15일에 출원된 미국 비-가출원 번호 15/595,689, 현재 2019년 9월 10일에 발행된 미국 특허 번호 10,410,441의 우선권, 2019년 4월 16일에 출원된 미국 특허 출원 번호 16/385,745의 우선권, 2016년 5월 16일에 출원된 미국 가출원 번호 62/337,228의 우선권, 2017년 5월 15일에 출원된 미국 비-가출원 번호 15/595,712, 현재 2019년 8월 27일에 등록된 미국 특허 번호 10,392,038의 우선권, 2018년 6월 5일에 출원된미국 가출원 번호 62/680,907의 우선권, 및 2019년 6월 4일에 출원된 미국 가출원 번호 16/431,466의 우선권을 주장한다. 각각의 전체 개시 내용은 참고로 본원에 포함된다. 본원에 인용된 모든 특허 출원, 특허 및 인쇄된 간행물은 모든 정의, 주제 면책 조항 또는 거부를 제외하고, 그리고 본원에 공개된 언어가 통제하는 경우, 포함 된 자료가 본원의 명시적 개시와 일치하지 않는 정도를 제외하고 그 전체가 참조로 포함된다. 본 발명은 고가의 자산에 사용되는 장비, 특히 고가의 모바일 자산에 사용되는 자동 신호 준수 모니터링 및 경 고 시스템에 관한 것이다."}
{"patent_id": "10-2021-7035338", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기관차, 항공기, 대중 교통 시스템, 광산 장비, 운송 가능한 의료 장비, 화물, 해양 선박 및 군용 선박과 같은 고가치 모바일 자산은 일반적으로 탑재된 데이터(onboard data) 수집 및 기록 \"블랙 박스\" 시스템 및/또는 \"이 벤트 레코더\" 시스템을 사용한다. 이벤트 데이터 레코더 또는 비행 데이터 레코더와 같은 이러한 데이터 수집 및 기록 시스템은 사고 조사, 승무원 성과 평가, 연료 효율성 분석, 유지 관리 계획 및 예측 진단에 사용되는 다양한 시스템 파라미터를 기록한다. 일반적인 데이터 수집 및 기록 시스템은 다양한 탑재된 센서 장치의 데이 터를 기록하는 압력 스위치와 압력 변환기 뿐만 아니라 디지털 및 아날로그 입력으로 구성된다. 기록된 데이터 에는 속도, 이동 거리, 위치, 연료 수준, 분당 엔진 회전수(RPM), 유체 수준, 운전자 제어, 압력, 현재 및 예상 기상 조건 및 주변 조건과 같은 파라미터가 포함될 수 있다. 기본 이벤트 및 운영 데이터 외에도 비디오 및 오 디오 이벤트/데이터 기록 기능도 이러한 동일한 모바일 자산에 사용된다. 일반적으로, 자산과 관련된 사고가 발 생한 후 데이터 레코더에서 데이터가 추출되고 조사가 필요한 경우 데이터 레코더가 복구된다. 데이터 레코더를 복구할 수 없거나 데이터를 사용할 수 없는 특정 상황이 발생할 수 있다. 이러한 상황에서, 이벤트 및 운영 데 이터, 비디오 데이터 및 오디오 데이터와 같은 데이터 수집 및 녹음 시스템에서 수집한 데이터는 데이터 수집 및 녹화 시스템 또는 데이터에 대한 물리적 액세스가 가능한지 여부에 관계없이 즉시 필요하다."}
{"patent_id": "10-2021-7035338", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 일반적으로 고가치 모바일 자산에 사용되는 실시간 데이터 수집 및 기록 시스템 및 자동화된 신호 모 니터링 및 경고 시스템에 관한 것이다. 본원의 교시는 실시간 데이터 수집 및 고가치 모바일 자산에 대한 기록 시스템에 의해 기록된 이벤트 및 운영 데이터, 비디오 데이터 및 오디오 데이터와 같은 데이터에 대한 실시간 또는 거의 실시간 액세스를 제공할 수 있다. 적어도 하나의 모바일 자산에서 데이터를 처리하기 위한 하나의 구 현 방법은, 적어도 하나의 모바일 자산으로부터 멀리 떨어진 데이터 센터 및 적어도 하나의 모바일 자산에 탑재 된 데이터 센터 중 하나를 사용하여, 적어도 하나의 모바일 자산에 탑재된 적어도 하나의 데이터 소스, 및 적어 도 하나의 모바일 자산에서 멀리 떨어진 적어도 하나의 데이터 소스 중 적어도 하나로부터의 적어도 하나의 데 이터 신호에 기초하여 데이터를 수신하는 단계; 데이터 센터를 사용하여, 적어도 하나의 트리거(trigger) 조건 이 데이터에 기초하여 감지되었던 조건에서 데이터 센터의 제1 인공 지능 모델을 사용하여, 적어도 하나의 모바 일 자산이 선두(leading) 모바일 자산 및 제어 모바일 자산 중 적어도 하나인 것을 결정하는 단계; 데이터 센터 를 사용하여, 선두 모바일 자산 및 제어 모바일 자산 중 적어도 하나로부터 비디오 콘텐츠-여기서 비디오 콘텐 츠는 적어도 하나의 트리거 조건 이전에 구성 가능한 미리 결정된 양의 시간 동안 수집된 데이터의 구성 가능한 미리 결정된 양의 데이터를 포함함-를 획득하는 단계; 데이터 센터의 데이터베이스를 사용하여 비디오 콘텐츠를 저장하는 단계; 데이터 센터의 제2 인공 지능 모델을 사용하여, 비디오 콘텐츠에 기초하여 에피소드(episode)를 결정하는 단계; 데이터 센터의 데이터베이스를 사용하여 에피소드를 저장하는 단계; 및 데이터 센터를 사용하여, 미리 결정된 양의 사용자에게 전자 메시지를 전송하는 단계를 포함한다. 적어도 하나의 모바일 자산에서 데이터를 처리하기 위한 시스템의 한 구현은: 적어도 하나의 이미지 측정 장치, 적어도 하나의 비디오 측정 장치, 적어도 하나의 거리 측정 장치, 및 적어도 하나의 마이크로폰 중 적어도 하나; 적어도 하나의 이미지 측정 장치, 적어도 하나의 비디오 측정 장치, 적어도 하나의 거리 측정 장치, 적어 도 하나의 마이크로폰, 적어도 하나의 모바일 자산에 탑재된 적어도 하나의 데이터 소스, 및 적어도 하나의 모 바일 자산으로부터 멀리 떨어진 적어도 하나의 데이터 소스 중 적어도 하나로부터 적어도 하나의 데이터 신호를 수신하도록 구성되며, 적어도 하나의 모바일 자산에 탑재된 데이터 레코더; 적어도 하나의 데이터 신호에 기초하여 데이터를 수신하도록 구성된 데이터 센터; 데이터 센터의 제1 인공 지능 모델-여기서 제1 인공지능 모델은 데이터에 기초하여 데이터 센터에 의해 적어도 하나의 트리거 조건이 감지되었던 조건에서 적어도 하나의 모바 일 자산이 선두 모바일 자산과 제어 모바일 자산 중 적어도 하나인 것을 결정하도록 구성됨-; 데이터 센터의 데 이터베이스-여기서 데이터베이스는 적어도 하나의 이미지 측정 장치, 적어도 하나의 비디오 측정 장치, 적어도 하나의 거리 측정 장치, 적어도 하나의 마이크로폰, 적어도 하나의 모바일 자산에 탑재된 적어도 하나의 데이터 소스, 및 적어도 하나의 모바일 자산에서 멀리 떨어진 적어도 하나의 데이터 소스 중 적어도 하나로부터 획득된 비디오 콘텐츠를 저장하도록 구성됨-; 및 데이터 센터의 제2 인공 지능 모델을 포함하고, 제2 인공 지능 모델은 비디오 콘텐츠에 기초하여 에피소드를 결정하도록 구성된다. 본 발명의 이러한 측면 및 다른 측면에서의 변형은 이후에 추가적으로 상세하게 설명될 것이다."}
{"patent_id": "10-2021-7035338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본원에 개시된 실시간 데이터 획득 및 기록 시스템의 제1 실시예는, 자산 소유자, 운영자 및 조사관과 같은, 원 격 사용자에 대하여 고가의 자산과 관련된, 이벤트 및 운영 데이터, 비디오 데이터, 및 오디오 데이터와 같은, 광범위한 데이터에 대한 실시간 또는 거의 실시간 액세스를 제공한다. 데이터 수집 및 기록 시스템은 자산과 관 련된 데이터 레코더를 통해 데이터를 기록하고, 사고가 발생하기 전, 발생하는 동안, 발생 후 원격 데이터 저장 소 및 원격지에 위치한 사용자에게 데이터를 스트리밍한다. 데이터는 실시간 또는 거의 실시간으로 원격 데이터 저장소로 스트리밍되어 최소한 사고 또는 비상 상황이 발생 한 시점까지 정보가 사용될 수 있어, 이에 따라, 사실상 자산과 연관된 사고를 조사하기 위해 \"블랙 박스\"를 찾 아 다운로드할 필요가 없으며, 사용자 정의 애플리케이션을 사용하여 데이터를 보기 위해서 파일을 찾아서 전송 하기 위하여 특정 데이터의 다운로드를 요청하기 위해 자산 상의 데이터 레코더와 상호작용할 필요가 없다. 본 발명의 시스템은 일반적인 기록 성능을 유지하고 사고 이전, 도중, 및 이후에 원격 데이터 저장소 및 원격 최종 사용자에게 데이터를 스트리밍하는 성능을 추가한다. 대부분의 상황에서, 데이터 레코더에 기록된 정보는 중복 되며 데이터가 이미 획득되어 원격 데이터 저장소에 저장되어 있으므로 필요하지 않다. 본 발명의 시스템 이전에, 사건이 발생한 후 조사가 필요한 \"블랙박스\" 또는 \"이벤트 레코더\"에서 데이터를 추 출했다. \"블랙박스\"에 의해 기록된 시간 세그먼트를 포함하는 데이터 파일은 \"블랙박스\"에서 다운로드 및 검색 된 다음 독점 소프트웨어를 사용하는 사용자가 볼 수 있어야 했다. 사용자는 자산에 대한 물리적 또는 원격 액 세스를 획득하고, \"블랙 박스\"에서 다운로드할 원하는 데이터를 선택하며, 원하는 정보가 포함된 파일을 컴퓨팅 장치로 다운로드하고, 컴퓨팅 장치에서 작동하는 맞춤형 애플리케이션을 사용하여, 원하는 데이터가 있는 적절 한 파일을 찾아야 했다. 본 발명의 시스템은 사용자가 이러한 단계를 수행할 필요성을 제거하고 사용자가 원하 는 데이터를 검색하기 위해 공통 웹 브라우저를 사용하기만 하면 된다. 원격지에 위치한 사용자는 실시간 또는 거의 실시간으로 자산의 운영 효율성과 안전성을 보고 분석하기 위해 선택한 자산과 관련된 원하는 데이터를 검 색하기 위해 공통 웹 브라우저에 액세스할 수 있다. 자산 소유자, 운영자 및/또는 조사관과 같은 원격 사용자는, 자산의 운영 효율성과 안전성을 실시간 또는 거의 실시간으로 보고 분석하기 위해, 공통 웹 브라우저에 액세스하여 선택된 자산과 관련된 라이브 및/또는 과거 원 하는 데이터를 검색할 수 있다. 실시간 또는 거의 실시간으로 거동을 볼 수 있어, 거동이 신속하게 평가되고 조 정될 수 있다. 예를 들어, 사고 중에 실시간 정보 및/또는 데이터는 상황 분류를 용이하게 하고 최초 대응자에 게 귀중한 정보를 제공할 수 있다. 예를 들어, 정상 작동 중에 실시간 정보 및/또는 데이터를 사용하여 승무원의 성과를 감사하고 네트워크 전체의 상황 인식을 지원할 수 있다. 데이터에는, 속도, 압력, 온도, 전류, 전압, 자산 및/또는 주변 자산에서 발생하는 가속도, 스위치 위치와 같은 부울(Boolean) 데이터, 액츄에이터 위치, 경고등 조명 및 액츄에이터 명령, 글로벌 포지셔닝 시스템(GPS, Global Positioning System) 데이터 및/또는 위치, 속도 및 고도, 현재 위치에서 자산에 대한 속도 제한과 같은 내부 생성 정보와 같은 지리 정보 시스템(GIS) 데이터, 자산 안, 위 또는 자산 주변의 다양한 위치에 있는 카메 라의 비디오 및 이미지 정보, 자산 내부 또는 자산 주위의 다양한 위치에 있는 마이크의 오디오 정보, 데이터 센터에서 자산으로 전송되는 경로, 일정 및 화물 목록(manifest) 정보와 같은 자산의 운영 계획에 대한 정보, 자산이 현재 운영 중이거나 운영 예정인 지역의 현재 및 예상 기상 조건을 포함하는 환경 조건에 대한 정보, 기 관차의 포지티브 열차 제어(PTC, Positive Train Control)와 같은 시스템에서 생성된 자산 제어 상태 및 운영 데이터, 및 위의 임의의 조합으로부터 도출되나 이들에 제한되지는 않는 데이터, 부가적인 데이터, 비디오, 및 오디오 분석 및 해석과 같은, 아날로그 및 주파수 파라미터가 포함될 수 있지만 이에 제한되지는 않는다. 도 1 및 2는, 본 발명의 측면들이 구현될 수 있는, 예시적인 실시간 데이터 획득 및 기록 시스템(DARS)(100, 200)의 제1 실시예 및 제2 실시예의 현장 구현을 각각 도시한다. DARS(100, 200)는 실시간 정보를 데이터 기록 장치에서 원격지에 있는 최종 사용자에게 전달하는 시스템이다. DARS(100, 200)는 차량 또는 모바일 자산(148, 248)에 설치되고, 무선 데이터 링크와 같은 데이터 링크를 통하는, DARS(100, 200)의 데이터 센터(150, 250)를 통한 무선 게이트웨이/라우터 또는 오프보드 정보 소스와 같은, 탑재된 유선 및/또는 무선 데이터 링크 (170, 270)의 임의의 조합을 통해 다양한 정보 소스와 통신하는 데이터 레코더(154, 254)를 포함한다. 데이터 기록기(154, 254)는 탑재형 데이터 관리자(120, 220), 데이터 인코더(122, 222), 차량 이벤트 감지기(156, 256), 대기열 저장소(158, 258), 및 무선 게이트웨이/라우터(172, 272)를 포함한다. 또한, 이러한 구현에서, 데 이터 레코더(154, 254)는 POE(Power over Ethernet)를 갖거나 갖지 않는 내충격형 메모리 모듈(118, 218) 및/ 또는 이더넷 스위치(162, 262)를 포함할 수 있다. 예시적인 강화 메모리 모듈(118, 218)은, 예를 들어, 연방 규 정 및/또는 연방 철도청 규정을 준수하는 충돌 방지 이벤트 레코더 메모리 모듈, 연방 규정 및/또는 연방 항공 국 규정을 준수하는 충돌 생존 메모리 유닛, 적용 가능한 연방 규정 코드를 준수하는 내충격형 메모리 모듈, 또는 당 업계에 공지된 임의의 다른 적절한 강화 메모리 장치일 수 있다. 제2 실시예에서, 도 2에 도시된 바와 같이, 데이터 레코더는 선택적인 비-내충격형 강화 제거 가능한 저장 장치를 더 포함할 수 있다. 유선 및/또는 무선 데이터 링크(170, 270)는 이산적인 신호 입력, 표준 또는 독점 이더넷, 직렬 연결, 및 무선 연결 중 임의의 하나 또는 이들의 조합을 포함할 수 있다. 이더넷 연결 장치는 데이터 레코더(154, 254)의 이더 넷 스위치(162, 262)를 사용할 수 있으며 POE를 사용할 수 있다. 이더넷 스위치(162, 262)는 내부 또는 외부일 수 있고 POE를 지원할 수 있다. 부가적으로, 도 1 및 도 2의 구현에서, 맵 구성요소(164, 264), 경로/승무원 목 록 구성요소(124, 224), 및 날씨 구성요소(126, 226)와 같은 원격 데이터 소스로부터의 데이터는 무선 데이터 링크(146, 246) 및 무선 게이트웨이/라우터(172, 272)를 통해 데이터 센터(150, 250)로부터 탑재형 데이터 관리 자(120, 220) 및 차량 이벤트 감지기(156, 256)에 이용가능하다. 데이터 레코더(154, 254)는 탑재형 데이터 링크(170, 270)를 통해 자산의 구성에 따라 광범위하게 변화할 수 있 는 다양한 소스로부터 데이터 또는 정보를 수집한다. 데이터 인코더(122, 222)는 규제 기관에 의해 일반적으로 정의되는 데이터의 적어도 최소 세트를 인코딩한다. 이러한 구현에서, 데이터 인코더(122, 222)는 다양한 자산 (148, 248) 소스 및 데이터 센터(150, 250) 소스로부터 데이터를 수신한다. 정보 소스는, 아날로그 입력(102, 202), 디지털 입력(104, 204), I/O 모듈(106, 206), 차량 제어기(108, 208), 엔진 제어기(110, 210), 관성 센 서(112, 212), 지리 정보 시스템(GPS, Global Positioning System)(114, 214), 카메라(116, 216), 포지티브 열 차 제어(PTC, Positive Train Control)/신호 데이터(166, 266), 연료 데이터(168, 268), 셀룰러 전송 감지기 (도시되지 않음), 내부 구동 데이터 및 추가적인 데이터 신호, 및 경로/승무원 목록 구성요소(124, 224), 날씨 구성요소(126, 226), 맵 구성요소(164, 264), 및 임의의 추가적인 데이터 신호와 같은, 데이터 센터(150, 250) 내의 구성 요소의 수와 같은, 자산(148, 248)의 구성 요소의 임의의 수를 포함할 수 있다. 데이터 인코더(122, 222)는 데이터를 압축하거나 인코딩하고 원격 데이터 저장소(130, 230)로의 효율적인 실시간 전송 및 복제를 용 이하게 하기 위해 데이터를 시간 동기화한다. 데이터 인코더(122, 222)는 인코딩된 데이터를 탑재형 데이터 관 리자(120, 220)로 전송하고, 이어서 데이터 센터(150, 250) 내에 위치한 원격 데이터 관리자(132, 232)를 통해 원격 데이터 저장소(130, 230)로 데이터를 복제하기 위해 내충격형 메모리 모듈(118, 218) 및 대기열 저장소 (158, 258)에 인코딩된 데이터를 저장한다. 선택적으로, 탑재형 데이터 관리자(120, 220)는 인코딩된 데이터의 3차 사본을 도 2에 도시된 제2 실시예의 비-내충격형 강화 제거 가능한 저장 장치에 저장할 수 있다. 탑재 형 데이터 관리자(120, 220) 및 원격 데이터 관리자(132, 232)는 데이터 복제 프로세스를 관리하기 위해 함께작동한다. 데이터 센터(150, 250)의 단일 원격 데이터 관리자(132, 232)는 복수의 자산(148, 248)으로부터 데이 터의 복제를 관리할 수 있다. 다양한 입력 구성요소로부터의 데이터 및 운전실 내 오디오/그래픽 사용자 인터페이스(GUI)(160, 260)로부터의 데이터는 차량 이벤트 감지기(156, 256)로 전송된다. 차량 이벤트 감지기(156, 256)는 자산(148, 248)과 관련된 이벤트, 사건 또는 다른 미리 정해진 상황이 발생했는지 여부를 결정하기 위해 데이터를 처리한다. 차량 이벤트 감지기(156, 256)가 미리 정해진 이벤트가 발생했음을 나타내는 신호를 감지할 때, 차량 이벤트 감지기(156, 256)는 미리 정해진 이벤트를 둘러싼 지원 데이터와 함께 미리 정해진 이벤트가 발생한 처리된 데이터를 탑재형 데이터 관리자(120, 220)로 전송한다. 차량 이벤트 감지기(156, 256)는, 자산의 구성에 따라 다를 수 있는, 아 날로그 입력(102, 202), 디지털 입력(104, 204), I/O 모듈(106, 206), 차량 제어기(108, 208), 엔진 제어기 (110, 210), 관성 센서(112, 212), GPS(114, 214), 카메라(116, 216), 경로/승무원 목록 구성요소(124, 224), 날씨 구성요소(126, 226), 맵 구성요소(164, 264), PTC/신호 데이터(166, 266), 및 연료 데이터(168, 268)와 같은, 다양한 소스로부터의 데이터에 기초하여 이벤트를 감지한다. 차량 이벤트 감지기(156, 256)가 이벤트를 감지하면, 감지된 자산 이벤트 정보는 대기열 저장소(158, 258)에 저장되고 선택적으로 운전실 내 오디오/그래 픽 사용자 인터페이스(GUI)(160, 260)를 통해 자산(148, 248)의 승무원에게 제공될 수 있다. 탑재형 데이터 관리자(120, 220)는 또한 데이터를 대기열 저장소로 전송한다. 거의 실시간 모드에서, 탑재 형 데이터 관리자(120, 220)는 데이터 인코더(122, 222)로부터 수신된 인코딩된 데이터 및 임의의 이벤트 정보 를 내충격형 메모리 모듈(118, 218) 및 대기열 저장소(158, 258)에 저장한다. 도 2의 제2 실시예에서, 탑재형 데이터 관리자는 인코딩된 데이터를 비-내충격형 강화 제거 가능한 저장 장치에 선택적으로 저장할 수 있다. 5분 동안 인코딩된 데이터가 대기열 저장소(158, 258)에 축적된 후, 탑재형 데이터 관리자(120, 220) 는 5분간의 인코딩된 데이터를 원격 데이터 관리자(132, 232)를 통하여, 무선 게이트웨이/라우터(172, 272)를 통해 액세스되는 무선 데이터 링크(146, 246)를 통해, 데이터 센터(150, 250) 내의 원격 데이터 저장소(130, 230)에 저장한다. 실시간 모드에서, 탑재형 데이터 관리자(120, 220)는 데이터 인코더(122, 222)로부터 수신된 인코딩된 데이터 및 임의의 이벤트 정보를 내충격형 메모리 모듈(118, 218)에 저장하고, 선택적으로 도 2의 비- 내충격형 강화 제거 가능한 저장 장치에 저장하며, 그리고 무선 게이트웨이/라우터(172, 272)를 통해 액세 스되는 무선 데이터 링크(146, 246)를 통하여, 데이터 센터(150, 250)의 원격 데이터 관리자(132, 232)를 통해, 원격 데이터 저장소(130, 230)로 저장된다. 탑재형 데이터 관리자(120, 220) 및 원격 데이터 관리자(132, 232) 는, 무선 게이트웨이/라우터(172, 272)를 사용하는, Wi-Fi, 셀룰러, 위성 및 개인 무선 시스템과 같은, 다양한 무선 통신 링크를 통해 통신할 수 있다. 무선 데이터 링크(146, 246)는, 예를 들어, 무선 근거리 통신 네트워크 (WLAN), 무선 대도시 지역 네트워크(WMAN), 무선 광역 네트워크(WWAN), 개인 무선 시스템, 휴대 전화 네트워크, 또는 DARS(100, 200)의 데이터 레코더(154, 254)로부터, 본 예에서는, DARS(100, 200)의 원격 데이터 관리자 (130, 230)로 데이터를 전송하는 다른 수단일 수 있다. 무선 데이터 연결을 사용할 수 없는 경우, 무선 연결이 복원되고 데이터 복제 프로세스가 재개될 수 있을 때까지, 데이터는 메모리에 저장되고 대기열 저장소(158, 258)에 저장된다. 데이터 기록과 병행하여, 데이터 레코더(154, 254)는 연속적으로 원격 데이터 저장소(130, 230)에 데이터를 자 동으로 복제한다. 복제 프로세스에는 실시간 모드와 거의 실시간 모드의 두 가지 모드가 있다. 실시간 모드에서, 데이터는 1초마다 원격 데이터 저장소(130, 230)에 복제된다. 거의 실시간 모드에서, 데이터는 매 매 5분마다 원격 데이터 저장소(130, 230)에 복제된다. 거의 실시간 모드에 사용되는 속도는 구성 가능하며, 실시 간 모드에 사용되는 속도는 0.10초마다 원격 데이터 저장소(130, 230)에 데이터를 복제하여 고해상도 데이터를 지원하도록 조정될 수 있다. DARS(100, 200)가 거의 실시간 모드에 있을 때, 탑재형 데이터 관리자(120, 220)는 원격 데이터 관리자(132, 232)에 데이터를 복제하기 전에 대기열 저장소(158, 258)에 데이터를 저장한다. 탑재 형 데이터 관리자(120, 220)는 또한 대기열 저장소(158, 258)에 대기열에 있는 차량 이벤트 감지기 정보를 원격 데이터 관리자(132, 232)로 복제한다. 거의 실시간 모드는 데이터 복제 프로세스의 효율성을 향상시키기 위해 대부분의 조건에서 정상 작동 중에 사용된다. 실시간 모드는 자산(148, 248)에 탑재된 차량 이벤트 감지기(156, 256) 또는 데이터 센터(150, 250)로부터 시작 된 요청에 의해 발생하고 감지하는 이벤트에 기초하여 시작될 수 있다. 원격지에 있는 사용자(152, 252)가 웹 클라이언트(142, 242)로부터 실시간 정보를 요청했을 때, 실시간 모드에 대한 일반적인 데이터 센터(150, 250) 시작 요청이 개시된다. 실시간 모드가 자산(148, 248)에서 시작되는 일반적인 이유는 차량 이벤트 감지기(156, 256)에 의해, 운영자의 비상 정지 요청 개시, 비상 제동 활동, 임의의 축에서 급격한 가속 또는 감속, 또는 데 이터 레코더(154, 254)에 대한 입력 전원의 손실과 같은, 이벤트 또는 사건의 감지이다. 거의 실시간 모드에서실시간 모드로 전환할 때, 원격 데이터 저장소(130, 230)에 아직 복제되지 않은 모든 데이터는 복제되어 원격 데이터 저장소(130, 230)에 저장된 다음 라이브 복제가 시작된다. 거의 실시간 모드와 실시간 모드 사이의 전환 은 일반적으로 5초 이내에 발생한다. 사건 또는 사건 발생 후 일정 시간이 경과한 후, 미리 결정된 비활성 시간 또는 사용자(152, 252)가 자산(148, 248)으로부터 실시간 정보를 더 이상 원하지 않을 때, 데이터 레코더(154, 254)는 거의 실시간 모드로 되돌아간다. 전환을 시작하는 데 필요한 미리 결정된 시간은 구성 가능하며 일반적 으로 10분으로 설정된다. 데이터 레코더(154, 254)가 실시간 모드에 있을 때, 탑재형 데이터 관리자(120, 220)는 원격 데이터 관리자 (132, 232)에 대한 대기열을 지속적으로 비우고 내충격형 메모리 모듈(118, 218)에, 선택적으로는 도 2의 비-내 충격형 강화 이동식 저장 장치에, 데이터를 저장하려고 시도하며, 동시에 데이터를 원격 데이터 관리자 (132, 232)에 전송한다. 탑재형 데이터 관리자(120, 220)는 또한 대기열 저장소(158, 258)에 대기 중인 감지된 차량 정보를 원격 데이터 관리자(132, 232)로 전송한다. 맵 구성요소(164, 264)로부터의 데이터와 함께 데이터 레코더(154, 254)로부터 복제될 데이터를 수신하면, 경로 /승무원 목록 구성요소(124, 224) 및 날씨 구성요소(126, 226), 원격 데이터 관리자(132, 232)는 압축된 데이터 를 DARS(100, 200)의 데이터 센터(150, 250) 내의 원격 데이터 저장소(130, 230)에 저장한다. 원격 데이터 저 장소(130, 230)는, 예를 들어, 클라우드 기반 데이터 저장소 또는 임의의 다른 적절한 원격 데이터 저장소일 수 있다. 데이터가 수신되면, 데이터 디코더(136, 236)가 원격 데이터 저장소(130, 230)에 대하여/원격 데이터 저 장소(130, 230)로부터 최근 복제된 데이터를 디코딩하고, 디코딩된 데이터를 원격 이벤트 감지기(134, 234)로 전송하게 하는 프로세스가 개시된다. 원격 데이터 관리자(132, 232)는 차량 이벤트 정보를 원격 데이터 저장소 (130, 230)에 저장한다. 원격 이벤트 감지기(134, 234)가 디코딩된 데이터를 수신할 때, 관심 이벤트가 디코딩 된 데이터에서 발견되는지 여부를 결정하기 위해 디코딩된 데이터가 처리된다. 디코딩된 정보는 자산(148, 24 8)과 함께 발생하는 데이터에서 이벤트, 사건 또는 기타 미리 정의된 상황을 감지하기 위해 원격 이벤트 감지기 (134, 234)에 의해 사용된다. 디코딩된 데이터에서 관심 이벤트를 감지되면, 원격 이벤트 감지기(134, 234)는 이벤트 정보 및 지원 데이터를 원격 데이터 저장소(130, 230)에 저장한다. 원격 데이터 관리자(132, 232)가 원 격 이벤트 감지기(134, 234) 정보를 수신할 때, 원격 데이터 관리자(132, 232)는 원격 데이터 저장소(130, 23 0)에 정보를 저장한다. 원격지에 위치한 사용자(152, 252)는, 웹 브라우저 또는 본 구현에서 선택된 카메라의 썸네일 이미지를 표시할 수 있는 가상 현실 장치(도시되지 않음)와 같은, 표준 웹 클라이언트(142, 242)를 사용하여, 특정 자산(148, 248) 또는 복수의 자산과 관련된 차량 이벤트 감지기 정보를 포함한 정보에 액세스할 수 있다. 웹 클라이언트 (142, 242)는 공통 웹 표준, 프로토콜 및 기술을 사용하여 네트워크(144, 244)를 통해 웹 서버(140, 240)에 정 보에 대한 사용자의 요청(152, 252)을 전달한다. 네트워크(144, 244)는 예를 들어 인터넷일 수 있다. 또한, 네 트워크(144, 244)는 근거리 통신 네트워크(LAN), 대도시 지역 네트워크(MAN), 광역 네트워크(WAN), 가상 사설 네트워크(VPN), 휴대 전화 네트워크, 또는 웹 서버(140, 240)로부터, 본 예에서는, 웹 클라이언트(142, 242)로 데이터를 전송하는 임의의 다른 수단일 수 있다. 웹 서버(140, 240)는 데이터 디코더(136, 236)로부터 원하는 데이터를 요청한다. 데이터 디코더(136, 236)는 웹 서버(140, 240)로부터의 요청에 따라 원격 데이터 저장소 (130, 230)로부터 특정 자산(148, 248) 또는 복수의 자산과 관련된 요청된 데이터를 획득한다. 데이터 디코더 (136, 236)는 요청된 데이터를 디코딩하고 디코딩된 데이터를 로컬라이저(localizer)(138, 238)로 전송한다. 로 컬리제이션(Localization)은 데이터를 사용자가 선호하는 언어 및 측정 단위로 변환하는 것과 같이 최종 사용자 가 원하는 형식으로 데이터를 변환하는 프로세스이다. 원시 인코딩된 데이터 및 감지된 이벤트 정보가 협정 세 계시(UTC) 및 국제 단위 시스템(SI 단위)을 사용하여 원격 데이터 저장소(130, 230)에 저장됨에 따라, 로컬라이 저(138, 238)는 웹 클라이언트(142, 242)에 액세스하여 사용자(152, 252)가 설정한 프로필 설정을 식별하고 프 로필 설정을 사용하여 사용자(152, 252)에게 표시하기 위해 웹 클라이언트(142, 242)로 전송되는 정보를 준비한 다. 로컬라이저(138, 238)는 디코딩된 데이터를 사용자(152, 252)의 선호 언어 및 측정 단위와 같은 사용자 (152, 252)가 원하는 포맷으로 변환한다. 로컬라이저(138, 238)는 요청에 따라 웹 서버(140, 240)에 사용자의 선호 형식(152, 252)으로 로컬라이즈된 데이터를 전송한다. 이어서, 웹 서버(140, 240)는 표준 비디오 및 360도 비디오의 재생 및 실시간 디스플레이를 제공하는 보기 및 분석을 위해 자산 또는 복수의 자산의 현지화된 데이 터를 웹 클라이언트(142, 242)로 전송한다. 웹 클라이언트(142, 242)는 디스플레이될 수 있고 사용자(152, 25 2)는 단일 자산에 대한 데이터, 비디오 및 오디오를 보거나 복수의 자산에 대한 데이터, 비디오 및 오디오를 동 시에 볼 수 있다. 또한, 웹 클라이언트(142, 242)는, 자산 상, 자산 내, 또는 자산 근처에서, 및/또는 원격지에 위치한 사이트에서, 표준 및 360도 비디오 소스 모두로부터의 복수의 비디오 및 오디오 데이터와 함께 데이터의동기 재생 및 실시간 디스플레이를 제공할 수 있다. 도 3은 본 발명의 구현에 따라 자산(148, 248)으로부터 데이터 및/또는 정보를 기록하기 위한 프로세스를 도시하는 흐름도이다. 데이터 레코더(154, 254)는 자산(148, 248) 및 데이터 센터(150, 250)로부터 물리적 또는 계산된 데이터 요소를 포함하는 다양한 입력 구성요소로부터, 속도, 위도 좌표, 경도 좌표, 경적 감지, 스로틀 위치, 날씨 데이터, 맵 데이터, 또는 승무원 데이터와 같은, 데이터 신호를 수신한다. 데이터 인코더(122, 222)는 데이터 신호 정보를 구성하고 기록하는 데 사용되는 구조화된 일련의 비트를 포함하는 레코드를 생 성한다. 이어서, 인코딩된 레코드는 최대 5분의 데이터를 포함하는 레코드 블록으로 시간순으로 일련의 레 코드를 순차적으로 결합하는 탑재형 데이터 관리자(120, 220)로 전송된다. 중간 레코드 블록에는 5분 미만의 데 이터가 포함되고 전체 레코드 블록에는 전체 5분 데이터가 포함된다. 각각의 레코드 블록에는 데이터 무결성 검 사를 포함하여 포함된 신호를 완전히 디코딩하는 데 필요한 모든 데이터가 포함된다. 적어도, 레코드 블록은 시 작 레코드로 시작하고 끝 레코드로 끝나야 한다. 모든 인코딩된 신호 데이터가 내충격형 메모리 모듈에 저장되도록 하기 위해, 선택적으로 도 2의 비-내충 격형 강화 제거 가능한 저장 장치에 저장되도록 하기 위해, 데이터 레코더(154, 254)가 충돌 또는 기타 치 명적인 사건으로 인해 정전되거나 극한의 온도 또는 기계적 스트레스를 받는 경우, 탑재형 데이터 관리자(120, 220)는 미리 결정된 비율로 내충격형 메모리 모듈에 중간 기록 블록을 저장하고, 선택적으로 도 2의 비-내충격형 강화 제거 가능한 저장 장치에 저장한다. 여기서, 미리 결정된 비율은 예시적인 표현으로 도 5에 도시된 바와 같이 구성 가능 및/또는 가변적이다. 중간 레코드 블록은 초당 한 번 이상 저장되지만 10분의 1초마다 한 번씩 자주 저장할 수도 있다. 중간 레코드 블록이 저장되는 속도는 각각의 신호의 샘플링 속도에 따 라 다르다. 모든 중간 레코드 블록에는 마지막 전체 레코드 블록 이후의 전체 레코드 세트가 포함된다. 데이터 레코더(154, 254)가 내충격형 메모리 모듈(118, 218) 또는 선택적으로 도 2의 데이터 레코더의 비-내충격 형 강화 제거 가능한 저장 장치에 데이터를 저장하는 동안 전원을 잃을 때 1초 이상의 데이터 손상 또는 손실을 방지하기 위해 각각의 중간 레코드 블록을 기록할 경우, 데이터 레코더(154, 254)는 내충격형 메모리 모 듈(118, 218)의 2개의 임시 저장 위치 사이에서, 선택적으로 도 2의 비-내충격형 강화 제거 가능한 저장 장치 에서, 교대될 수 있다. 새 임시 레코드 블록이 임시 내충격형 메모리 위치에 저장될 때마다, 대응하는 위 치에 기존에 저장된 임시 레코드 블록이 덮어쓰기된다. 매 5분마다, 이러한 구현에서, 데이터 레코더(154, 254)가 거의 실시간 모드에 있을 때, 탑재형 데이터 관리자 (120, 220)는 인코딩된 신호 데이터의 마지막 5분을 포함하는 전체 레코드 블록을 내충격형 메모리 모듈(118, 218)의 레코드 세그먼트에 저장하며, 도 7에 도시된 바와 같이, 전체 레코드 블록의 사본을 원격 데이터 관리자 (132, 232)로 전송하여 원격 데이터 저장소(130, 230)에 2년과 같은 미리 결정된 보존 기간 동안 저장한다. 내충격형 메모리 모듈(118, 218) 및/또는 도 2의 데이터 레코더의 선택적인 비내충격형 제거 가 능한 저장 장치는 명령된 저장 기간 동안 가장 최근의 레코드 블록의 레코드 세그먼트를 저장하며, 이는 본 구현에서는 데이터 레코더(154, 254)가 추가적인 24시간 버퍼와 함께 강화 메모리 모듈(118, 218)에 작동 데 이터 또는 비디오 데이터를 저장해야 하며 이어서 덮어쓰기되어야 하는 연방 규정 기간이다. 도 4는 본 발명의 일 구현에 따른 정전 후 자산(148, 248)으로부터 데이터 및/또는 정보를 첨부하기 위한 프로 세스를 도시하는 흐름도이다. 전원이 복구되면, 데이터 레코더(154, 254)는, 모든 레코드 블록의 끝 레코드에 포함된 32비트 순환 중복 검사를 사용하여, 2개의 임시 내충격형 메모리 위치 중 하나에 저장된 마지막 중간 기록 블록을 식별하고 마지막 중간 기록 블록을 검증한다. 검증된 임시 레코드 블록은 내충격형 메 모리 레코드 세그먼트에 추가되고, 정전이 발생하기 전에 최대 5분의 데이터를 포함할 수 있는 그러한 레코드 세그먼트는 보존 기간 동안 저장되도록 원격 데이터 관리자(132, 232)로 전송된다. 인코딩된 신호 데이터 는, 지정된 저장 기간의 순환 버퍼 내의, 내충격형 메모리 모듈(118, 218)에 저장되고/저장되거나, 도 2의 데이 터 레코더의 선택적인 비-내충격형 강화 제거 가능한 저장 장치에 저장된다. 내충격형 메모리 레코드 세그먼트가 여러 레코드 블록으로 분할되기 때문에, 전체 레코드 블록이 내충격형 메모리 모듈(118, 218) 및/또 는 도 2의 데이터 레코더의 선택적인 비-내충격형 강화 제거 가능한 저장 장치에 저장될 때마다 메모 리 공간을 확보하는 데 필요할 경우, 데이터 레코더(154, 254)는 오래된 레코드 블록을 제거한다. 도 6은 전력 손실 이전 및 데이터 레코더(154, 254)에 대한 전력 복원 이후의 예시적인 중간 기록 블록을 도시 하는 도면이다. (2016년 2월 1일 오전 10:10:08)의 임시 위치 2에 저장된 임시 레코드 블록이 유효한 경우, 해당 임시 레코드 블록이 내충격형 메모리 모듈(118, 218)의 레코드 세그먼트(도 7)에 첨부되고/첨 부되거나, 도 7에 도시된 바와 같이, 도 2의 데이터 레코더의 선택적인 비-내충격형 강화 제거 가능한 저 장 장치에 첨부된다. 임시 위치 2(2016년 2월 1일 오전 10시 10분 08초)에 저장된 임시 레코드 블록이 유효하지 않은 경우, 임시 위치 1의 임시 레코드 블록(2016년 2월 1일 오전 10시 10분 07초)이 검증되고, 유효한 경우, 내충격형 메모리 모듈(118, 218)의 레코드 세그먼트에 첨부되고/첨부되거나, 도 2의 데이터 레코더 의 선택적인 비-내충격형 강화 제거 가능한 저장 장치에 첨부된다. 임의의 레코드 블록이 내충격형 메모리 모듈(118, 218) 및/또는 도 2의 데이터 레코더의 선택적 비-내충격 형 강화 제거 가능한 저장 장치에 저장될 필요가 있을 때마다, 레코드 세그먼트는 즉시 디스크로 플러시된 다(flushed). 데이터 레코더(154, 254)는 중간 기록 블록을 저장할 때 2개의 서로 다른 임시 저장 위치 사이를 교대하기 때문에, 내충격형 메모리 또는 비 내충격형 이동식 저장 장치로 수정되거나 플러시되지 않는 임시 저 장 위치가 항상 하나 있어서, 임시 저장 위치에 저장된 두 개의 임시 레코드 블록 중 적어도 하나는 확실히 유 효하며, 해당 데이터 레코더(154, 254)는 데이터 레코더(154, 254)가 전력을 잃을 때마다 최대 1초 이상의 데이 터를 잃지 않을 것이다. 유사하게, 데이터 레코더(154, 254)가 데이터 레코더의 내충격형 메모리 모듈 (118, 218) 및/또는 도 2의 선택적인 비내충격형 이동식 저장 장치에 데이터를 10분의 1초마다 기록할 때, 데이터 레코더(154, 254)는 데이터 레코더(154, 254)가 전원을 잃을 때마다 최대 1/10초 이상의 데이터를 잃지 않을 것이다. 설명의 단순화를 위해, 프로세스 및 프로세스가 일련의 단계로 도시 및 설명된다. 그러나, 본 발명에 따른 단계들은 다양한 순서로 및/또는 동시에 일어날 수 있다. 부가적으로, 본 발명에 따른 단계는 본원에 제시 및 설명되지 않은 다른 단계와 함께 발생할 수 있다. 또한, 설명된 모든 단계가 개시된 주제에 따른 방법을 구 현하는 데 필요한 것은 아니다. 본원에 설명된 실시간 데이터 수집 및 기록 시스템 및 뷰어의 제3 실시예는, 자산 소유자, 운영자 및 조사관과 같은 원격 위치에 있는 사용자를 위한 고가치 자산의 이벤트 및 운영 데이터, 비디오 데이터 및 오디오 데이터 와 같은, 광범위한 데이터에 대한 실시간 또는 거의 실시간 액세스를 제공한다. 데이터 수집 및 기록 시스템은 자산과 관련된 데이터 레코더를 통해 데이터를 기록하고 사고가 발생하기 전, 발생하는 동안, 발생 후 원격 데 이터 저장소 및 원격에 위치한 사용자에게 데이터를 스트리밍한다. 데이터는 실시간 또는 거의 실시간으로 원격 데이터 저장소로 스트리밍되어 최소한 사고 또는 비상 상황이 발생한 시점까지 정보가 사용될 수 있게 하여, 자 산과 관련된 사건을 조사하기 위해 \"블랙박스\"를 찾아 다운로드할 필요가 거의 없으며, 파일을 찾아 전송하고 사용자 지정 애플리케이션을 사용하여 데이터를 보기 위하여 특정 데이터의 다운로드를 요청하기 위해 자산의 데이터 레코더와 상호 작용할 필요가 없다. 본 발명의 시스템은 일반적인 기록 능력을 유지하고, 대부분의 상황 에서, 사건 이전, 도중 및 이후에 원격 데이터 저장소 및 원격 최종 사용자에게 데이터를 스트리밍하는 성능을 추가하며, 데이터 레코더에 기록된 정보는 중복되며 데이터가 이미 획득되어 원격 데이터 저장소에 저장되어 있 으므로 필요하지 않다. 본 발명의 시스템 이전에, 사건이 발생한 후 조사가 필요한 \"블랙박스\" 또는 \"이벤트 레코더\"에서 데이터가 추 출되었다. \"블랙박스\"에 의해 기록된 시간 세그먼트를 포함하는 데이터 파일은 \"블랙박스\"에서 다운로드 및 검 색된 다음 독점 소프트웨어를 사용하는 사용자가 볼 수 있어야 했다. 사용자는 자산에 대한 물리적 또는 원격 액세스 권한을 획득하고 \"블랙 박스\"에서 다운로드할 원하는 데이터를 선택하여 원하는 정보가 포함된 파일을 컴퓨팅 장치에 다운로드하며 컴퓨팅 장치에서 작동하는 사용자 지정 애플리케이션을 사용하여 원하는 데이터가 있는 적절한 파일을 찾아야 했다. 본 발명의 시스템은 사용자가 이러한 단계를 수행할 필요성을 제거하고 사용 자가 원하는 데이터를 탐색하기 위해 공통 웹 브라우저를 사용하기만 하면 된다. 원격지에 위치한 사용자는 실 시간 또는 거의 실시간으로 자산의 운영 효율성과 안전성을 보고 분석하기 위해 선택한 자산과 관련된 원하는 데이터를 탐색하기 위해 공통 웹 브라우저에 액세스할 수 있다. 자산 소유자, 운영자 및/또는 조사관과 같은 원 격 사용자는, 실시간 또는 거의 실시간으로, 공통 웹 브라우저에 액세스하여 자산의 운영 효율성 및 안전성을 보고 분석하기 위해 선택한 자산과 관련된 라이브 및/또는 과거 원하는 데이터를 내비세이션할 수 있다. 실시간 또는 거의 실시간으로 거동을 볼 수 있는 기능을 통해, 거동을 신속하게 평가하고 조정할 수 있다. 예를 들어, 사건이 발생하는 동안, 실시간 정보 및/또는 데이터는 상황 분류를 용이하게 하고 최초 대응자에게 귀중한 정보 를 제공할 수 있다. 예를 들어, 정상 작동 중에, 실시간 정보 및/또는 데이터를 사용하여 승무원의 성과를 감 사하고 네트워크 전체의 상황 인식을 지원할 수 있다. 제3 실시예의 실시간 데이터 수집 및 기록 시스템은, 데이터 수집 및 기록 시스템의 일부로 모바일 자산 내부, 위 또는 근처에 있는, 이미지 측정 장치, 비디오 측정 장치, 거리 측정 장치 중 적어도 하나 또는 임의의 조합 을 사용한다. 이미지 측정 장치 및/또는 비디오 측정 장치에는 360도 카메라, 고정된 카메라, 내로우 뷰 카메라 (narrow view camera), 와이드 뷰 카메라(wide view camera), 360도 어안 뷰 카메라 및/또는 기타 카메라가 포 함되지만 이에 제한되지 않는다. 거리 측정 장치에는 레이더 및 빛 감지 및 거리 측정(\"LIDAR\")이 포함되지만이에 제한되지 않는다. LIDAR는 펄스 레이저 광을 대상물에 비추고 반사된 펄스를 센서로 측정하여 대상물까지 의 거리를 측정하는 측량 방식이다. 본 발명의 시스템 이전에, \"블랙박스\" 및/또는 \"이벤트 레코더\"에는 360도 카메라 또는 모바일 자산 내부, 상부 또는 주위에 있는 기타 카메라가 포함되지 않았다. 본 발명의 시스템은 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라, 레이더, LIDAR, 및 /또는, 원격 데이터 저장소 및 원격 사용자 및 조사자에 대한 모바일 자산 내부, 상부 또는 근처의 360도 뷰, 내로우 뷰, 와이드 뷰, 어안 뷰 및/또는 다른 뷰를 제공하는, 모바일 자산과 관련된 사고가 발생하기 전, 발생 하는 동안 및 이후의, 데이터 수집 및 기록 시스템의 일부인 다른 카메라를 사용하여 비디오를 사용하고 녹화하 는 기능을 추가한다. 거동을 실시간 또는 거의 실시간으로 볼 수 있어, 360도 비디오 및/또는 기타 비디오는 승 무원 행동을 신속하게 평가하고 조정할 수 있다. 소유자, 운영자 및 조사관은 운영 효율성, 사람, 차량 및 인프 라의 안전을 보고 분석할 수 있으며 사고를 조사하거나 검사할 수 있다. 모바일 자산에서 360도 비디오 및/또는 기타 비디오를 볼 수 있는 기능을 통해 승무원 행동을 신속하게 평가하고 조정할 수 있다. 예를 들어, 사건이 발생하는 동안, 360도 비디오 및/또는 기타 비디오는 상황 분류를 용이하게 하고 최초 대응자와 조사관에게 귀 중한 정보를 제공할 수 있다. 예를 들어 정상 작동 중에는, 360도 비디오 및/또는 기타 비디오를 사용하여 승무 원의 성과를 감사하고 네트워크 전체의 상황 인식을 지원할 수 있다. 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라, 레이더, LIDAR 및/또는 기타 카메라는, 법 집행 기관 및/또 는 철도 경찰을 위한 감시 비디오의 제공, 주요 기반 시설 검사, 철도 건널목 모니터링, 트랙 작업 진행 상황 보기, 운전실 내부와 마당에서 승무원 감사, 실시간 원격 감시를 제공하기 위해, 상황에 대한 완전한 사진을 제 공한다. 이전 시스템에서는, 사용자가 독점 소프트웨어 애플리케이션 또는 기타 외부 비디오 재생 애플리케이션을 사용 하여 비디오 파일을 보기 위해 시간 세그먼트가 포함된 비디오 파일을 다운로드해야 했다. 본 발명의 데이터 획 득 및 기록 시스템은, 가상 현실 장치 및/또는 표준 웹 클라이언트를 통해 원격 사용자에게 표시될 수 있는, 360도 비디오, 기타 비디오, 이미지 정보 및 오디오 정보, 거리 측정 정보를 제공하여, 비디오를 보기 위해 외 부 애플리케이션을 다운로드하고 사용할 필요가 없다. 부가적으로, 원격 위치에 있는 사용자는 가상 현실 장치 를 사용하거나 웹 브라우저와 같은 표준 웹 클라이언트를 통해 다양한 모드에서 360도 비디오 및/또는 기타 비 디오를 볼 수 있고, 비디오를 보기 위해 외부 애플리케이션을 다운로드하고 사용할 필요가 없다. 이전 비디오 시스템에서는 사용자가 별도로 구매해야 하는 독점 애플리케이션 소프트웨어 또는 기타 외부 비디오 재생 애플 리케이션을 통해서만 볼 수 있는 데이터의 시간 세그먼트가 포함된 비디오 파일을 다운로드해야 했다. 데이터에는 자산 내부, 자산 상부 또는 자산 주위의 다양한 위치에 있는 카메라의 비디오 및 이미지 정보와 자 산 내부, 자산 상부 또는 자산 주변의 다양한 위치에 위치한 마이크로폰의 오디오 정보가 포함될 수 있지만 이 에 제한되지 않는다. 360도 카메라는 360도 구면 뷰, 360도 반구 뷰 및/또는 360도 어안 뷰를 제공하는 카메라 이다. 자산 내부, 상부 또는 주변에서, 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라 및/또는 다른 카메라의 사용은, DARS의 일부로서 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라 및/또는 기타 카메라를 사용하여, 비디오를 사용하고 녹화 하는 기능을 제공하여, 사고가 발생하기 이전, 도중 및 후에, 원격 데이터 저장소, 원격지에 위치한 사용자, 및 조사관에 대하여, 자산 내부, 상부 또는 주위에서 360도 뷰 및/또는 기타 뷰를 사용할 수 있게 한다. 도 8은 본 발명의 측면들이 구현될 수 있는 예시적인 실시간 데이터 획득 및 기록 시스템(DARS)의 제3 실 시예의 현장 구현을 도시한다. DARS는 모바일 자산의 데이터 레코더로부터 실시간 정보, 비디오 정보 및 오디오 정보를 데이터 센터를 통해 원격지 위치한 최종 사용자에게 전달하는 시스템이다. 데이터 레코더는 차량 또는 모바일 자산에 설치되고 무선 게이트웨이/라우터(도시되지 않음)와 같은 유선 및 /또는 무선 데이터 링크의 임의의 조합을 통해 다양한 정보 소스와 통신한다. 데이터 레코더는 내충격형 메모리 모듈, 탑재형 데이터 관리자, 및 데이터 인코더를 포함한다. 제4 실시예에서, 데이터 레 코더는 또한 비-내충격형 강화된 제거 가능한 저장 장치(도시되지 않음)를 포함할 수 있다. 예시적인 강화 메모리 모듈은, 예를 들어, 연방 규정 및/또는 연방 철도청 규정을 준수하는, 충돌 방지 이벤트 레코더 메 모리 모듈, 연방 규정 및/또는 연방 항공국 규정을 준수하는 충돌 생존 메모리 유닛, 적용 가능한 연방 규정 코 드를 준수하는 내충격형 메모리 모듈, 또는 당업계에 공지된 임의의 다른 적절한 강화 메모리 장치일 수 있다. 유선 및/또는 무선 데이터 링크는 개별 신호 입력, 표준 또는 독점 이더넷, 직렬 연결 및 무선 연결 중 하나 또 는 조합을 포함할 수 있다. 데이터 레코더는 탑재형 데이터 링크를 통해 자산의 구성에 따라 달라질 수 있는 매우 다양한 소스로부터 비디오 데이터, 오디오 데이터 및 기타 데이터 및/또는 정보를 수집한다. 이러한 구현에서, 데이터 레코더는, 자산 내, 상부 또는 근처에 위치하는, 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라, 레이더, LIDAR 및/또는 기타 카메라 및 고정된 카메라로부터, 비디오 데이터 및 오디오 데이터를 연속적으로 기록하는 비디오 관리 시스템으로부터 데이터를 수신하며, 비디오 관리 시스템은 비디오 및 오디오 데이터를 내충격형 메모리 모듈에 저장하며 또한 비디오 및 오디오 데이터를 제2 실시예의 비내충격형된 제거 가능한 저장 장치에 저장할 수 있다. 다른 버전의 비디오 데이터는 다른 비트 전송률 또는 공간 해상도를 사용하여 생성되며 이러한 버전은, 썸네일, 5분 저해상도 세그먼트 및 5 분 고해상도 세그먼트와 같은, 가변 길이의 세그먼트로 분리된다. 데이터 인코더는 규제 기관에 의해 일반적으로 정의되는 데이터의 적어도 최소 세트를 인코딩한다. 데이터 인코더는, 원격 데이터 저장소로의 효율적인 실시간 전송 및 복제를 용이하게 하기 위해, 비디오 관 리 시스템으로부터 비디오 및 오디오 데이터를 수신하고 데이터를 압축 또는 인코딩하고 데이터를 시간 동 기화한다. 데이터 인코더는, 원격지에 위치한 사용자의 주문형 요청에 응답하여, 또는 자산에서 관찰되는 특정 작동 조건에 대한 응답하여, 인코딩된 데이터를 탑재형 데이터 관리자로 전송한 다음 인코 딩된 비디오 및 오디오 데이터를 데이터 센터에 위치한 원격 데이터 관리자를 통해 원격 데이터 저장 소로 전송한다. 탑재형 데이터 관리자 및 원격 데이터 관리자는 데이터 복제 프로세스를 관리하 기 위해 협력한다. 데이터 센터의 원격 데이터 관리자는 복수의 자산으로부터 데이터의 복제를 관리 할 수 있다. 원격 데이터 저장소에 저장된 비디오 및 오디오 데이터는 원격 위치 사용자가 액세스할 수 있도록 웹 서버에서 이용 가능하다. 탑재형 데이터 관리자는 또한 대기열 저장소(미도시)에 데이터를 전송한다. 탑재형 데이터 관리자는, 비디오 관리 시스템에 의해, 내충격형 메모리 모듈, 그리고 제2 실시예의 선택적인 비-내충격형 강화 제거 가능한 저장 장치에 저장된 비디오 및 오디오 데이터를 모니터링하고, 데이터가 거의 실시간 모드인지 실 시간 모드인지를 결정한다. 거의 실시간 모드에서, 탑재형 데이터 관리자는 비디오 데이터, 오디오 데이터, 및 데이터 인코더로부터 수신된 임의의 다른 데이터 또는 정보를 포함하는 인코딩된 데이터 및 임 의의 이벤트 정보를 내충격형 메모리 모듈, 및 선택적으로 제2 실시예의 비-내충격형 강화 제거 가능한 저 장 장치에, 그리고 대기열 저장소에 저장한다. 탑재형 데이터 관리자는, 무선 데이터 링크를 통하여, 데이터 센터의 원격 데이터 관리자를 통해 원격 데이터 저장소에 5분간의 인코딩된 데이터를 저 장한다. 실시간 모드에서, 탑재형 데이터 관리자는, 데이터 인코더로부터 수신된 비디오 데이터, 오 디오 데이터 및 다른 데이터 또는 정보 및 다른 이벤트 정보를 포함하는, 인코딩된 데이터를, 데이터 센터 내의 원격 데이터 관리자를 통해, 원격 데이터 저장소에 저장한다. 탑재형 데이터 관리자 및 원 격 데이터 관리자는 다양한 무선 통신 링크를 통해 통신할 수 있다. 무선 데이터 링크는, 예를 들어, 데이터 레코더에서 원격 데이터 관리자로 데이터를 전송하는, 무선 근거리 통신 네트워크(WLAN), 무 선 대도시 지역 네트워크(WMAN), 무선 광역 네트워크(WWAN), 사설 무선 시스템, 휴대 전화 네트워크, 또는 임의 의 다른 수단일 수 있다. 자산에서 원격으로 비디오 데이터 및 오디오 데이터를 보내고 검색하는 프로세스 는 자산과 데이터 센터 사이의 무선 데이터 연결을 필요로 한다. 무선 데이터 연결을 사용할 수 없는 경우, 데이터는 무선 연결이 복원될 때까지 내충격형 메모리 모듈 및 제4 실시예의 선택적 비-내충격형 강 화 제거 가능한 저장 장치에 저장되고 대기한다. 비디오, 오디오 및 기타 추가적인 데이터 검색 프로세스는 무 선 연결이 복원되는 즉시 재개된다. 데이터 기록과 병행하여, 데이터 레코더는 원격 데이터 저장소에 데이터를 지속적으로 자율적으로 복 제한다. 복제 프로세스에는 실시간 모드와 거의 실시간 모드의 두 가지 모드가 있다. 실시간 모드에서, 데이터 는 1초마다 원격 데이터 저장소에 복제된다. 거의 실시간 모드에서, 데이터는 매 매 5분마다 원격 데이터 저장소에 복제된다. 거의 실시간 모드에 사용되는 속도는 구성 가능하고, 실시간 모드에 사용되는 속도는 0.10초마다 원격 데이터 저장소에 데이터를 복제함으로써 고해상도 데이터를 지원하도록 조정될 수 있다. 거의 실시간 모드는 데이터 복제 프로세스의 효율성을 향상시키기 위해 대부분의 조건에서 정상 작동 중에 사용 된다. 실시간 모드는 자산에서 발생하는 이벤트를 기반으로 시작되거나 데이터 센터에서 개시된 요청에 의 해 개시될 수 있다. 원격 위치에 있는 사용자가 웹 클라이언트로부터 실시간 정보를 요청했을 경우, 실시간 모드에 대한 일반적인 데이터 센터 개시 요청이 개시된다. 실시간 모드가 자산에서 시작되는 일반적인 이유는, 운영자의 비상 정지 요청을 개시, 비상 제동 활동, 임의의 축에서 급격한 가속 또는 감속, 또 는 데이터 레코더에 대한 입력 전원 손실과 같은, 이벤트 또는 사건의 감지이다. 거의 실시간 모드에서 실 시간 모드로 전환할 때, 원격 데이터 저장소에 아직 복제되지 않은 모든 데이터는 복제되어 원격 데이터저장소에 저장된 다음 라이브 복제가 시작된다. 거의 실시간 모드와 실시간 모드 사이의 전환은 일반적으 로 5초 이내에 발생한다. 이벤트 또는 사건 이후 소정의 시간이 경과한 후, 소정의 비활동 시간이 경과한 후, 또는 사용자가 자산으로부터 실시간 정보를 더 이상 원하지 않을 때, 데이터 레코더는 거의 실 시간 모드로 되돌아간다. 전환을 시작하는 데 필요한 미리 결정된 시간은 구성 가능하며 일반적으로 10분으로 설정된다. 데이터 레코더가 실시간 모드에 있을 때, 탑재형 데이터 관리자는 원격 데이터 관리자에 대한 대기열을 지속적으로 비우려고 시도하며, 내충격형 메모리 모듈 및 제2 실시예의 선택적 비-내충격형 강화 제거 가능한 저장 장치에 데이터를 저장하고, 동시에 데이터를 원격 데이터 관리자에 전송한다. 데이터 레코더로부터 복제될 비디오 데이터, 오디오 데이터 및 기타 데이터 또는 정보를 수신하면, 원격 데이터 관리자는 데이터를 데이터 센터의 원격 데이터 저장소에 저장한다. 원격 데이터 저장소 는, 예를 들어, 클라우드 기반 데이터 저장소 또는 임의의 다른 적절한 원격 데이터 저장소일 수 있다. 데 이터가 수신되면, 데이터 디코더(도시되지 않음)가 원격 데이터 저장소로부터 최근에 복제된 데이터를 디 코딩하고 디코딩된 데이터를 원격 이벤트 감지기(도시되지 않음)로 전송하게 하는 프로세스가 개시된다. 원격 데이터 관리자는 원격 데이터 저장소에 차량 이벤트 정보를 저장한다. 원격 이벤트 감지기가 디코딩 된 데이터를 수신하면 디코딩된 데이터를 처리하여 관심 이벤트가 디코딩된 데이터에서 발견되는지 확인한다. 디코딩된 정보는, 자산과 함께 발생하는 데이터에서 이벤트, 사건 또는 기타 미리 정의된 상황을 감지하기 위해, 원격 이벤트 감지기에 의해 사용된다. 원격 데이터 저장소에 미리 저장된 디코딩된 데이터에서 관심 이벤트가 감지되면, 원격 이벤트 감지기는 원격 데이터 저장소에 이벤트 정보 및 지원 데이터를 저장한다. 비디오 데이터, 오디오 데이터 및 기타 데이터 또는 정보는 사용자의 주문형 요청에 응답하여 사용자(83 4)에 의해 사용될 수 있고/있거나, 자산에서 관찰되는 특정 작동 조건에 응답하여 탑재형 데이터 관리자 에 의해 원격 데이터 저장소로 전송된다. 원격 데이터 저장소에 저장된 비디오 데이터, 오디오 데이터, 및 임의의 다른 데이터 또는 정보는 사용자가 액세스할 수 있도록 웹 서버에서 이용 가능하 다. 원격 위치에 있는 사용자는 표준 웹 클라이언트를 사용하여 원격 데이터 저장소에 저장된 특정 자산 또는 복수의 자산과 관련된, 웹 브라우저 또는 이러한 구현에서 선택된 카메라의 썸네일 이미지 를 표시할 수 있는 가상 현실 장치와 같은, 비디오 데이터, 오디오 데이터 및 기타 데이터 또는 정보에 액 세스할 수 있다. 웹 클라이언트는 비디오, 오디오 및/또는 기타 정보에 대한 사용자 요청을 공통 웹 표준 프로토콜 및 기술을 사용하여 네트워크를 통해 웹 서버에 전달한다. 네트워크는, 예를 들 어, 인터넷일 수 있다. 네트워크는, 웹 서버로부터 이러한 예에서는 웹 클라이언트로 데이터를 전송하는, 근거리 통신 네트워크(LAN), 대도시 지역 네트워크(MAN), 광역 네트워크(WAN), 가상 사설 네트워크 (VPN), 휴대 전화 네트워크 또는 기타 수단일 수도 있다. 웹 서버는 원격 데이터 저장소로부터 원하 는 데이터를 요청한다. 이어서, 웹 서버는 표준 비디오, 360도 비디오, 및/또는 다른 비디오의 재생 및 실 시간 디스플레이를 제공하는 웹 클라이언트에 요청된 데이터를 전송한다. 웹 클라이언트는 보기 및 분석을 위해 360도 비디오 데이터 및/또는 다른 비디오 데이터 및/또는 정지 이미지 데이터와 상호작용할 수 있 는 사용자를 위한 비디오 데이터, 오디오 데이터, 및 임의의 다른 데이터 또는 정보를 재생한다. 사용자 는 또한 웹 클라이언트를 사용하여 비디오 데이터, 오디오 데이터, 및 임의의 다른 데이터 또는 정보 를 다운로드할 수 있고, 이어서 가상 현실 장치를 사용하여 보기 및 분석을 위해 360도 비디오 데이터와 상호작용할 수 있다. 웹 클라이언트는 다양한 상이한 모드에서 360도 비디오 및/또는 다른 비디오의 재생을 제공하는 소프트웨 어 애플리케이션으로 개선될 수 있다. 사용자는 소프트웨어 애플리케이션이, 예를 들어, 도 11의 어안 뷰, 도 12의 파노라마 뷰, 더블 파노라마 뷰(도시되지 않음), 도 13의 쿼드 뷰, 도 14의 왜곡이 없는 뷰와 같은, 비 디오 재생을 제공하는 모드를 선택할 수 있다. 도 9는, 본 발명의 구현에 따른, 자산으로부터 비디오 데이터, 오디오 데이터, 및/또는 정보를 기록하기 위한 프로세스를 도시하는 흐름도이다. 비디오 관리 시스템은, 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라, 레이더, LIDAR, 및/또는 다른 카메라와 자산의 상부, 내부 또는 근처에 고정된 카메라와 같은, 다양한 입력 구성요소로부터 데이터 신호를 수신한다. 비디오 관리 시스템은, 예를 들어, 정지 이미지, 썸네일, 정지 이미지 시퀀스 또는 압축된 비디 오 형식과 같은, 산업 표준 형식의 모든 조합을 사용하여, 비디오 데이터, 오디오 데이터, 및/또는 정보를 내충 격형 메모리 모듈에 저장하며, 그리고 제4 실시예의 선택적인 비내충격형 제거 가능한 저장 장치에 저장한다. 데이터 인코더는 데이터 신호 정보를 구성 및 기록하는 데 사용되는 구조화된 일련의 비트를 포함하는 레코드를 생성한다. 거의 실시간 모드에서, 비디오 관리 시스템은, 원격 데이터 자징소(820, 848)에 탑재되어 있지 않는, 썸네일 또는 매우 짧은 저해상도 비디오 세그먼트와 같은 제한된 비디오 데이터만 전송하면서, 비디오 데이터를 내충격형 메모리 모듈, 및 제4 실시예의 선택적 비-내충격형 강화 제거 가능 한 저장 장치에 저장한다. 또다른 실시예에서, 이어서 인코딩된 레코드는 최대 5분의 데이터를 포함하는 레코드 블록으로 시간순으로 일련 의 레코드를 순차적으로 결합하는 탑재형 데이터 관리자로 전송된다. 중간 레코드 블록에는 5분 미만의 데 이터가 포함되고 전체 레코드 블록에는 전체 5분 데이터가 포함된다. 각각의 레코드 블록에는 데이터 무결성 검 사를 포함하여 포함된 신호를 완전히 디코딩하는 데 필요한 모든 데이터가 포함된다. 최소한, 레코드 블록은 시 작 레코드로 시작하고 끝 레코드로 끝나야 한다. 모든 인코딩된 신호 데이터가 내충격형 메모리 모듈 및 제4 실시예의 선택적 비-내충격형 강화 제거 가능 한 저장 장치에 저장되도록 하기 위해, 데이터 레코더가 전원을 잃는 경우, 탑재형 데이터 관리자는, 미리 결정된 비율로, 내충격형 메모리 모듈 및 제4 실시예의 선택적 비-내충격형 강화 제거 가능한 저장 장치에 임시 기록 블록을 저장하며, 미리 결정된 비율은 구성 가능 및/또는 가변적이다. 중간 레코드 블록은 초 당 한 번 이상 저장되지만 10분의 1초마다 한 번씩 자주 저장될 수도 있다. 중간 레코드 블록이 저장되는 속도 는 각각의 신호의 샘플링 속도에 따라 다르다. 모든 중간 레코드 블록에는 마지막 전체 레코드 블록 이후의 전 체 레코드 세트가 포함된다. 내충격형 메모리 모듈에 데이터 저장하는 동안에 데이터 레코더의 전원 이 손실될 때 1초 이상의 데이터 손상 또는 손실을 방지하기 위해 각각의 중간 레코드 블록을 기록할 경우, 데 이터 레코더는 내충격형 메모리 모듈에서 2개의 임시 저장 위치 사이를 교대로 사용할 수 있다. 새 임시 레코드 블록이 임시 내충격형 메모리 위치에 저장될 때마다 대응하는 위치에 기존에 저장된 임시 레코드 블록이 덮어쓰기된다. 본 구현에서는 매 5분마다, 데이터 레코더가 거의 실시간 모드에 있을 때, 탑재형 데이터 관리자는 마지막 5분의 인코딩된 신호 데이터를 포함하는 전체 기록 블록을 내충격형 메모리 모듈 및 제4 실시예의 선택적 비-내충격형 강화 제거 가능한 저장 장치의 레코드 세그먼트에 저장하며, 5분의 비디오 데이터, 오디오 데이터 및/또는 정보를 포함하는 전체 기록 블록의 사본을 원격 데이터 관리자에 전송하여 2년과 같은 미 리 결정된 보존 기간 동안 원격 데이터 저장소에 저장한다. 내충격형 메모리 모듈, 및 제4 실시예의 선택적 비-내충격형 강화 제거 가능한 저장 장치는, 본 구현에서 데이터 레코더가 작동 또는 비디오 데이 터를 추가적인 24시간 버퍼와 함께 내충격형 메모리 모듈에 저장해야 하는 연방 규정 기간인, 규정된 저장 기간 동안 가장 최근의 레코드 블록의 레코드 세그먼트를 저장하며, 이어서 데이터는 덮어쓰기된다. 도 10은 웹 브라우저 또는 가상 현실 장치를 통해 자산으로부터 데이터 및/또는 정보를 보기 위한 프로세 스를 보여주는 흐름도이다. 이벤트가 발생하거나 또는 원격지에 위치한 인증된 사용자가 웹 클라이언 트를 통해 내충격형 메모리 모듈에 저장된 비디오 데이터의 세그먼트를 요청할 때, 탑재형 데이터 관 리자는 이벤트에 따라 무선 데이터 링크의 대역폭이 주어지면 이용 가능한 최상의 해상도로 실시간으 로 비디오 데이터를 오프 보드(off board)로 보내기 시작할 것이다. 원격지에 위치한 사용자는, 네트워크 를 통해, 웹 서버에 요청을 전달하는 웹 클라이언트를 통하여 특정 뷰 모드에서 특정 비디 오 및/또는 오디오 데이터에 대한 요청을 개시한다. 웹 서버는 원격 데이터 저장소로부터 특정 비디 오 및/또는 오디오 데이터를 요청하고 요청된 비디오 및/또는 오디오 데이터를 네트워크를 통해 웹 클라이 언트(826, 854)로 전송한다. 웹 클라이언트는 사용자(834, 856)에 의해 지정된 보기 모드에서 비디오 및/ 또는 오디오 데이터를 표시한다. 이어서, 사용자는 가상 현실 장치에서 보기 위해 특정 비디오 및/또 는 오디오 데이터를 다운로드할 수 있다. 또다른 구현에서, 실시간 모드에서, 썸네일 이미지가 먼저 1초 간격으 로 전송된 다음, 저해상도 비디오의 짧은 세그먼트가 전송되며, 이어서 고해상도 비디오의 짧은 세그먼트가 전 송된다. 설명의 편의를 위해, 프로세스 및 프로세스는 일련의 단계로서 도시되고 설명된다. 그러나, 본 발명 에 따른 단계들은 다양한 순서로 및/또는 동시에 일어날 수 있다. 부가적으로, 본 발명에 따른 단계는 본원에 제시 및 설명되지 않은 다른 단계와 함께 발생할 수 있다. 또한, 설명된 모든 단계가 개시된 주제에 따른 방법 을 구현하는 데 필요한 것은 아니다. 본원에 설명된 실시간 데이터 수집 및 기록 시스템 및 비디오 분석 시스템의 다섯 번째 실시예는, 원격 위치에 있는 사용자에 대한 고가치 자산의 이벤트 및 운영 데이터, 비디오 데이터 및 오디오 데이터와 같은, 광범위한 데이터에 대한 실시간 또는 거의 실시간 액세스를 제공한다. 데이터 수집 및 기록 시스템은 자산과 관련된 데이터를 기록하고 사고가 발생하기 전, 발생하는 동안, 발생 후 원격 데이터 저장소 및 원격지에 있는 사용자에게 데이터를 스트리밍한다. 데이터는 실시간 또는 거의 실시간으로 원격 데이터 저장소로 스트리밍되어 최소한 사 고 또는 비상 상황이 발생한 시점까지 정보가 사용될 수 있도록 하여, 실시간 또는 거의 실시간으로 원격 데이 터 저장소로 정보를 스트리밍하여 자산과 관련된 사건을 조사하기 위해 \"블랙박스\"를 찾아 다운로드할 필요가 거의 없으며, 적어도 치명적인 사건이 일어나기 전까지의 정보가 이용될 수 있다. DARS는 모바일 자산에 기록된 비디오 데이터의 비디오 분석을 수행하여, 예를 들어, 운전실 점유, 트랙 감지 및 트랙 근처의 물체 감지를 판 단한다. 원격 위치에 있는 사용자는 공통 웹 브라우저를 사용하여 선택한 자산과 관련된 원하는 데이터를 탐색 하고 볼 수 있으며, 특정 데이터의 다운로드를 요청하고 파일을 찾거나 전송하며 사용자 지정 애플리케이션을 사용하여 데이터를 보기 위해, 자산의 데이터 수집 및 기록 시스템과 상호 작용할 필요가 없다. DARS는, 사고 이전, 도중, 이후에 원격 데이터 저장소와 원격지에 위치한 사용자에게 데이터를 스트리밍함으로 써, 원격 사용자에게 비디오 분석 시스템이 수행하는 비디오 데이터 및 비디오 분석에 대한 액세스를 제공하여, 사용자가 수동으로 비디오를 다운로드, 추출 및 재생하여 사고 중에 승무원 또는 승인되지 않은 사람이 있었던 경우와 같은 운전실 점유, 트랙 감지, 트랙 근처의 물체 감지, 조사 또는 기타 관심 있는 시간을 결정하기 위해 비디오 데이터를 검토할 필요가 없다. 부가적으로, 비디오 분석 시스템은 실시간으로 이미지 및 비디오 데이터 를 처리하여 캡 점유 상태 결정, 트랙 감지, 트랙 주변 물체 감지, 리드 및 트레일(lead and trail) 단위 결정 을 제공하여, 사용자가 항상 올바른 데이터를 사용할 수 있도록 한다. 예를 들어, 실시간 영상처리를 통해 트레 일 기관차로 지정된 기관차가 리드 서비스를 하지 않도록 하여 철도안전을 강화한다. 종래의 시스템은 디스패치 시스템에서 열차 구성 기능을 사용하여 열차 내에서 기관차 위치를 제공했다. 때로는, 정보가 실시간으로 업데 이트되지 않고 승무원이 필요하다고 판단되는 경우, 기관차를 변경할 수 있으므로 디스패치 시스템 정보가 쓸모 없게 될 수 있다. 본 발명의 시스템 이전에, 검사 직원 및/또는 자산 직원은 트랙 상태를 수동으로 검사해야 했으며, 차량이 리드 또는 트레일 위치에 있는지 수동으로 확인해야 했고, 관심 있는 각각의 개별적인 물체의 위치를 수동으로 조사 해야 했으며, 관심 있는 모든 물체의 지리적 위치 데이터베이스를 수동으로 생성해야 했고, 각각의 관심 대상에 대한 수동 현장 조사를 주기적으로 수행하여 위치를 확인하고 원래 조사와 다른 지리적 위치의 변경 사항을 식 별해야 했으며, 원본 데이터베이스가 생성된 이후의 수리 또는 추가 인프라 개발로 인해 관심 물체의 위치가 변 경된 경우 데이터베이스를 수동으로 업데이트해야 했고, 디지털 비디오 레코더 및/또는 데이터 레코더에서 원하 는 데이터를 선택 및 다운로드하며 다운로드한 데이터 및/또는 비디오를 오프라인으로 검사하고 장애물이 있는 지 트랙을 확인해야 했으며, 차량 운전자는 장애물 및/또는 스위치 변경 사항이 있는지 물리적으로 확인해야 했 다. 본 발명의 시스템은 사용자가 이러한 단계를 수행할 필요성을 제거하고 사용자가 원하는 데이터를 탐색하기 위해 공통 웹 브라우저를 사용하기만 하면 되게 한다. 자산 소유자 및 운영자는 모바일 자산의 효율성과 안전성 을 실시간으로 자동화 및 개선할 수 있으며 트랙 상태를 능동적으로 모니터링하고 실시간으로 경고 정보를 얻을 수 있다. 본 발명의 시스템은 자산 소유자 및 운영자가 트랙 상태를 모니터링하고 사건을 조사하기 위해 데이터 레코더로부터 데이터를 다운로드할 필요를 제거한다. 능동적인 안전 시스템으로서, DARS는 운영자가 장애물을 확인하고, 실시간으로 경고를 보내거나 정보를 오프라인으로 저장하고, 원격 모니터링 및 저장을 위해 경고 정 보를 보낼 수 있도록 지원한다. 현재 및 과거 트랙 감지 정보 및/또는 트랙 근처의 물체 감지와 관련된 정보는 원격 데이터 저장소에 실시간으로 저장되어 필요할 때 사용자가 정보를 보는 데 도움을 줄 수 있다. 원격지에 위치한 사용자는, 실시간 또는 거의 실시간으로, 자산의 운영 효율성 및 안전성을 보고 분석하기 위해 선택된 자산과 관련된 원하는 데이터를 검색하기 위해 공통 웹 브라우저에 액세스할 수 있다. 제5 실시예의 실시간 데이터 수집 및 기록 시스템은, 관심 물체가 이동했거나 또는 손상되었거나, 잎사귀로 인 해 방해를 받았거나, 파손되어 유지보수가 필요한 경우, 관심 물체를 지속적으로 모니터링하고 실시간으로 식별 하는 데 사용할 수 있다. DARS는, 비디오 내의 철도 트랙과 같은, 비디오, 이미지 및/또는 오디오 정보를 활용 하여 다양한 인프라 물체를 감지하고 식별하며, 모바일 자산이 이동함에 따라 트랙을 따라갈 수 있고, 지리적 위치에 대한 관심 물체의 데이터베이스를 생성, 감사, 및 주기적으로 업데이트할 수 있다. 제5 실시예의 실시간 데이터 수집 및 기록 시스템은, 데이터 수집 및 기록 시스템의 일부로, 모바일 자산 내, 상부 또는 근처의 이미 지 측정 장치, 비디오 측정 장치 및 거리 측정 장치 중 적어도 하나 또는 이들의 조합을 사용한다. 이미지 측정 장치 및/또는 비디오 측정 장치에는 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라 및/또는 다른 카메라가 포함되지만 이에 제한되지 않는다. 거리 측정 장치에는 레이더 및 빛 감 지 및 거리 측정(\"LIDAR\")이 포함되지만 이에 제한되지 않는다. LIDAR는 펄스 레이저 광을 대상물에 비추고 반 사된 펄스를 센서로 측정하여 대상물까지의 거리를 측정하는 측량 방식이다.DARS는, 존재하는 트랙의 수를 세고, 모바일 자산이 이동 중인 현재 트랙을 식별하며, 밸러스트의 유실, 파손된 트랙, 게이지를 벗어난 트랙, 잘못 정렬된 스위치, 스위치 런오버, 트랙의 홍수, 눈 축적 등과 같은 존재하는 장애물이나 결함 감지와 같은 트랙 상태를 자동으로 검사할 수 있으며, 치명적인 사건을 피하기 위해 예방적 유 지보수를 계획한다. DARS는 또한 철도 트랙 스위치를 감지하고 트랙 변경을 추적할 수 있다. DARS는 물체가 누 락, 방해 및/또는 예상 위치에 없는지 여부를 포함하여 데이터의 위치 변경 사항을 추가로 감지할 수 있다. 트 랙 감지, 인프라 진단 정보 및/또는 인프라 모니터링 정보는 웹 브라우저와 같은 표준 웹 클라이언트를 사용하 여 사용자에게 표시될 수 있어, 종래의 시스템에서 요구되는 바와 같이, 데이터 레코더에서 파일을 다운로드하 고 전용 애플리케이션 소프트웨어 또는 기타 외부 애플리케이션을 사용하여 필요한 정보를 볼 필요가 없다. 본 프로세스는 관심 물체의 지리적 위치로 데이터베이스를 자동으로 생성, 감사 및/또는 업데이트하고 연방 규정을 준수하도록 확장될 수 있다. 본 발명의 시스템으로, 연방 규정을 준수하기 위해 이전에 설치된 카메라는 이전에 인간 상호 작용, 특수 차량 및/또는 대체 장비를 필요로 했던 다양한 작업을 수행하는 데 활용된다. DARS를 사 용하면 모바일 자산이 정상적인 수익 서비스 및 일일 운영의 일부로 지역 전체를 이동할 때 이러한 작업을 자동 으로 수행할 수 있다. DARS는 이전에 수동 작업이 필요했던 작업을 수행하기 위해 차량 및 이전에 설치된 카메 라의 정상적인 작동을 활용하여 수동 작업의 수많은 인시(person-hours)를 절약하는 데 사용할 수 있습니다. DARS는 이전에 특수 차량을 사용하여 수행했던 작업도 수행할 수 있고, 종종 수익 서비스의 손실을 초래하는 트 랙 및 관심 물체를 검사하고 찾기 위한 트랙 세그먼트의 폐쇄를 방지하며, 고가의 장비를 구입 및 유지할 필요 가 없다. DARS는 사람이 철도 트랙 근처에 있어야 하는 시간을 더욱 줄여, 전체 사고와 잠재적인 인명 손실이 감소한다. 데이터에는 모바일 자산 및/또는 모바일 자산 주변에서의 속도, 압력, 온도, 전류, 전압 및 가속도와 같은 측정 된 아날로그 및 주파수 파라미터; 스위치 위치, 액츄에이터 위치, 경고등 조명 및 액츄에이터 명령과 같은 측정 된 부울 데이터; 글로벌 포지셔닝 시스템(GPS)으로부터의 위치, 속도 및 고도 정보, 및 다양한 관심 대상의 위 도 및 경도와 같은 지리 정보 시스템(GIS)의 추가적인 데이터; 현재 위치에서 모바일 자산에 대한 규제 속도 제 한과 같은 내부 생성 정보; 포지티브 열차 제어(PTC)와 같은 시스템에서 생성된 열차 제어 상태 및 운영 데이터; 속도, 가속도 및 GPS로부터 수신된 위치와 같은 차량 및 관성 파라미터; 다양한 관심 물체의 위도 및 경도와 같은 GIS 데이터; 모바일 자산 내, 상부 또는 주변의 다양한 위치에 위치한 적어도 하나의 카메라로부터 의 비디오 및 이미지 정보; 모바일 자산 내, 상부 또는 주위의 다양한 위치에 위치한 적어도 하나의 마이크로폰 으로부터의 오디오 정보; 경로, 일정 및 화물 목록 정보와 같은, 데이터 센터에서 모바일 자산으로 전송되는 모 바일 자산에 대한 운영 계획에 대한 정보; 모바일 자산이 현재 운영 중이거나 운영 예정인 지역의 현재 및 예상 날씨와 같은 환경 조건에 대한 정보; 및 추가적인 데이터, 비디오, 오디오 분석 및 분석학을 포함하여 위 소스 의 조합에서 파생된 데이터가 포함될 수 있지만 이에 제한되지 않는다. \"트랙\"에는 기관차 및/또는 기차 운송에 사용되는 철도의 레일 및 침목이 포함될 수 있지만 이에 제한되지 않는 다. \"관심 물체\"에는, 자산 카메라 이미지 및 비디오의 감독된 학습 또는 강화 학습과 같은, 인공 지능을 사용 하여 식별될 수 있는, 철도 선로 인근에 설치 및 유지 관리되는 다양한 기반 시설 물체가 포함될 수 있지만 이 에 제한되지 않는다. 감독된 학습 및/또는 강화 학습은, 모바일 자산 내부, 상부 또는 주변에 있는 카메라의 시 야 내에서 원격 및 자율적으로 물체를 식별할 수 있게 하는, \"훈련\" 데이터로 정의된 이전에 레이블이 지정된 데이터 세트를 활용한다. 감독된 학습 및/또는 강화 학습은 신경망 모델을 훈련하여 카메라에서 얻은 시각적 이 미지 내에서 발생하는 패턴을 식별한다. 사람, 건널목, 자동차, 나무, 신호, 스위치 등과 같은 이러한 패턴은 단일 이미지 내에서만 발견될 수 있다. 비디오 내의 연속 프레임은 깜박이는 신호, 움직이는 자동차, 잠들어 있 는 사람 등과 같은 패턴에 대해 분석할 수도 있다. DARS는 감독된 학습 및/또는 강화 학습에 필요한 훈련 데이 터 세트에 레이블을 지정하는 것을 포함하지만 이에 제한되지 않는 구현의 모든 단계에서 인간의 상호 작용을 요구할 수도 있고 요구하지 않을 수도 있다. 관심 물체에는 트랙, 트랙 중심선 지점, 이정표 표지판, 신호, 교 차로, 스위치, 교차로 및 텍스트 기반 표지판이 포함되지만 이에 제한되지 않는다. \"비디오 분석\"은, 모바일 자 산 내, 상부 또는 주위의 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라, 레이더, LIDAR 및/또는 다른 카메라와 같은, 적어도 하나의 카메라와 같은, 비디오, 이미지, 거리 측정 장치에서 기록된 비디오 및/또는 이미지를 분석하여 수집된, 관심 물체, 물체의 지리적 위치, 장애물 추적, 관 심 물체와 모바일 자산 사이의 거리, 트랙의 정렬 불량 등과 같은 그러나 이들에 제한되지는 않는, 모든 이해할 수 있는 정보를 의미한다. 비디오 분석 시스템은 비디오 감시를 향상시키기 위해 감시 카메라가 있는 모든 모바 일 자산, 주거 지역, 공간 또는 방에서도 사용할 수 있다. 모바일 자산에서, 비디오 분석 시스템은 원격 위치에 있는 사용자에게 경제적이고 효율적으로 자율적인 운전실 점유 이벤트 감지를 제공한다.도 15는 본 발명의 양상들이 구현될 수 있는 예시적인 실시간 데이터 획득 및 기록 시스템(DARS)의 제5 실 시예의 현장 구현을 도시한다. DARS는 모바일 자산의 데이터 레코더로부터 실시간 정보, 비디오 정보 및 오디오 정보를 데이터 센터를 통해 원격지에 위치한 최종 사용자에게 전달하는 시스템이다. 데이터 레코더는 차량 또는 모바일 자산에 설치되고 무선 게이트웨이/라우터(도시되지 않음)와 같은 유선 및/또는 무선 데이터 링크의 임의의 조합을 통해 임의의 수의 다양한 정보 소스와 통신한다. 데이터 레코더는 탑재형 데이터 링크를 통해 자산의 구성에 따라 달라질 수 있는 매우 다양한 소스로부터 비 디오 데이터, 오디오 데이터 및 다른 데이터 또는 정보를 수집한다. 데이터 레코더는 내충격형 메모리 모 듈, 탑재형 데이터 관리자, 및 자산의 데이터 인코더와 같은 로컬 메모리 구성요소를 포함 한다. 제6 실시예에서, 데이터 레코더는 또한 비-내충격형 강화 제거 가능한 저장 장치(도시되지 않음)를 포함할 수 있다. 예시적인 강화 메모리 모듈은, 예를 들어, 연방 규정 및/또는 연방 철도청 규정을 준수하 는, 충돌 방지 이벤트 레코더 메모리 모듈일 수 있으며, 연방 규정 및/또는 연방 항공 협회 규정을 준수하는 충 돌 생존 메모리 장치일 수 있고, 적용 가능한 연방 규정 코드를 준수하는 내충격형 메모리 모듈일 수 있거나, 또는 당업계에 공지된 임의의 다른 적절한 강화 메모리 장치일 수 있다. 유선 및/또는 무선 데이터 링크는 개별 신호 입력, 표준 또는 독점 이더넷, 직렬 연결 및 무선 연결 중 하나 또는 이들의 조합을 포함할 수 있다. DARS는 트랙 및/또는 물체 탐지 및 기반시설 모니터링 구성요소를 포함하는 비디오 분석 시스템(91 0)을 더 포함한다. 트랙 감지 및 기반 시설 모니터링 구성요소는 감독된 학습 및/또는 강화 학습 구성요소 , 또는 다른 신경망 또는 인공 지능 구성 요소, 물체 감지 및 위치 구성요소, 및 트랙 상에 또는 근 처에 있는 장애물 및/또는 카메라 시야를 차단하는 사람과 같은 카메라 장애물을 감지하는 장애물 감지 구성요 소를 포함한다. 이러한 구현에서, 라이브 비디오 데이터는 자산의 운전실, 자산 상에, 또는 자 산 근체에 장착된 적어도 하나의 카메라에 의해 캡처된다. 카메라는 자산 내부 및 주변의 비디오 데이터를 캡처하고 추가적인 처리를 위한 충분한 양의 뷰를 획득하기 위해 적절한 높이 및 각도에 배치 된다. 라이브 비디오 데이터 및 이미지 데이터는 카메라에 의해 자산 전방 및/또는 주변에서 캡처되 고, 분석을 위해 트랙 및/또는 물체 감지 및 기반시설 모니터링 구성요소에 공급된다. 비디오 분석 시스템 의 트랙 감지 및 기반 시설 모니터링 구성요소는 철도 트랙 및 임의의 관심 대상의 존재를 감지하기 위해 프레임별로 라이브 비디오 및 이미지 데이터를 처리한다. 높이, 각도, 이동, 초점 거리 및 시야와 같은 카 메라 위치 파라미터는 트랙 및/또는 물체 감지 및 기반 시설 모니터링 구성요소에 공급될 수 있거나, 또는 카메라는 비디오 분석 시스템이 카메라 위치 및 파라미터를 감지하고 결정할 수 있도록 구성될 수 있 다. 운전실 점유 감지와 같은 상태 확인을 위해, 비디오 분석 시스템은, 예를 들어, 카메라로부터의 비디 오 데이터, 속도, GPS 데이터 및 관성 센서 데이터와 같은 자산 데이터, 날씨 구성요소 데이터, 및 경로/승무원, 목록 및 GIS 구성요소 데이터를 평가하기 위해, 감독된 학습 및/또는 강화 학습 구성요소 , 및/또는 기타 인공 지능 및 학습 알고리즘을 사용한다. 운전실 점유 감지는 자산이 이동하는 동안 건물 과 나무를 통과하는 햇빛 및 구름에서 반사되는 빛과 같은 환경 소음 소스에 본질적으로 취약하다. 환경 소음을 처리하기 위해, 속도, GPS 데이터 및 관성 센서 데이터, 날씨 구성 요소 데이터 및 다른 학습 알고리즘을 포함할 수 있는, 강화된 학습 및/또는 강화 학습 구성요소, 물체 감지 및 위치 구성요소, 장애물 감 지 구성요소, 자산 구성요소 데이터는 함께 구성되어 모바일 자산과 관련된 내부 및/또는 외부 상태 결정을 형성한다. 트랙 및/또는 물체 감지 및 기반 시설 모니터링 구성요소는 또한, 기관차 보안 시스템의 일부로 기관차에 대한 액세스를 허용하기 위해 구성된 안면 인식 시스템, 승무원 경보를 모니터링하도록 구성된 피로 감지 구성 요소, 및 흡연과 같은 무단 활동을 감지하는 활동 감지 구성 요소를 포함할 수 있다. 부가적으로, 비디오 분석 시스템은 자산 소유자로부터 정지 신호, 교통 신호, 속도 제한 신호 및/또는 트 랙 근처의 물체 신호와 같은 신호의 위도 및 경도 좌표를 포함하는 위치 정보를 수신할 수 있다. 이어서, 비디 오 분석 시스템은 자산 소유자로부터 수신된 위치 정보가 정확한지 여부를 결정한다. 위치정보가 정확하면, 비디오 분석 시스템은 정보를 저장하고, 매월 위치 정보 확인과 같은, 미리 결정된 시간 동안 위치 정보를 다시 확인하지 않는다. 위치정보가 정확하지 않을 경우, 비디오 분석 시스템은 정확한 위치 정보를 결정하고 정확한 위치 정보를 자산 소유자에게 보고하며 위치 정보를 저장하고, 매월 위치 정보 확인과 같은, 미리 결정된 시간 동안 위치 정보를 다시 확인하지 않는다. 위치 정보를 저장하면 정지 신호, 교통 신호, 속도 제한 신호 및/또는 트랙 근처의 물체 신호와 같은 신호를 더 용이하게 감지할 수 있다. 감독된 학습 및/또는 강화 학습 구성요소를 사용하여, 그리고 학습된 데이터를 결정하기 위한 관성 센서 데이터 및 GPS 데이터를 포함하는 데이터 센터 및 차량 데이터 구성요소로부터 수신된 추가적인 정보를 사용하여, 트랙의 강화된 학습 및/또는 강화 학습이 비디오 및/또는 이미지의 연속 프레임에서 얻은 다양한 정보를 사용하여 수행된다. 물체 감지 및 위치 구성요소는, 물체 감지 데이터를 결정하기 위해, 감독 학습 및/또는 강화 학습 구성요소로부터 수신된 학습된 데이터와, 트랙 너비 및 곡률, 침목의 위치, 및 철도 트 랙, 표지판, 신호 등을 다른 물체와 구별하기 위한 차량 속도와 같은, 모바일 자산 및 철도에 대한 특정 정보를 활용한다. 장애물 감지 구성요소는 물체 감지 및 위치 구성요소로부터 수신된, 트랙 위 또는 근처에 있는 카메라 뷰를 차단하는 사람 및 날씨 구성요소의 추가적인 정보, 경로/승무원 목록 데이터 및 GIS 데이터 구성요소 및 관성 센서 데이터를 포함하는 차량 데이터 구성요소와 정확도를 높이고 장애 물 감지 데이터를 결정하기 위한 GPS 데이터 등의 장애물 및/또는 카메라 장애물에 대한 정보와 같은, 물체 감 지 데이터를 활용한다. 차량 데이터 구성요소로부터의 모바일 자산 데이터는 속도, 위치, 가속도, 요/피치 레이트, 및 철도 건널목을 포함하지만 이에 제한되지 않는다. 데이터 센터로부터 수신 및 활용되는 추가적 인 정보에는 모바일 자산의 주야간 세부사항 및 지리적 위치가 포함되지만 이에 제한되지 않는다. 관심 기 반 시설 물체, 트랙 및/또는 물체 탐지 및 기반 시설 모니터링 구성요소에 의해 처리된 정보, 및 진단 및 모니터링 정보는 데이터를 인코딩하기 위해 탑재형 데이터 링크를 통해 데이터 레코더의 데이터 인코 더로 전송된다. 데이터 레코더는 인코딩된 데이터를 내충격형 메모리 모듈에, 그리고 선택적인 비-내충격형 강화 제거 가능한 저장 장치에 저장하며, 인코딩된 정보를 무선 데이터 링크를 통해 데이터 센터의 원격 데이터 관리자로 전송한다. 원격 데이터 관리자는 인코딩된 데이터를 데이터 센터 의 원격 데이터 저장소에 저장한다. 자산 전방의 트랙의 존재, 트랙 상부 및/또는 주위의 물체, 트랙 상부 또는 주위의 장애물, 및/또는 카메라 뷰 를 차단하는 장애물과 같은 장애물 감지 또는 물체 감지를 결정하기 위해, 차량 분석 시스템 은 강화된 학습 및/또는 강화 학습 구성요소 또는 다른 인공 지능, 물체 감지 및 위치 구성 요소 , 그리고 장애물 감지 구성요소, 및 카메라로부터의 카메라 이미지 및 비디오 데이터를 실시간 으로 처리하고 평가하기 위한 다른 이미지 처리 알고리즘을 사용한다. 트랙 및/또는 물체 감지 및 기반 시설 모 니터링 구성요소는, 리드 및 트레일 모바일 자산과 같은 외부 상태를 실시간으로 결정하기 위해, 속도, GPS 데이터 및 관성 센서 데이터, 날씨 구성 요소 데이터, 경로/승무원, 목록 및 GIS 구성 요소 데이 터를 포함할 수 있는, 자산 구성요소 데이터와 함께 처리된 비디오 데이터를 사용한다. 예를 들어, 트랙 및/또는 물체 감지를 위해 이미지 및 비디오 데이터를 처리할 때, 비디오 분석 시스템은 트랙 감지에 필요 한 카메라 파라미터를 자동으로 구성하고, 스위치를 통해 실행을 감지하며, 트랙 수를 계산하고, 자산 측면을 따라 추가적인 트랙을 감지하며, 자산이 현재 운행 중인 트랙을 결정하고, 트랙의 기하학적 결함을 감지하며, 트랙의 정의된 한계 내에서 트랙 근처의 물 감지와 같은 트랙이 유실되는 시나리오를 감지하 고, 누락된 경사 또는 트랙 시나리오를 감지한다. 물체 감지 정확도는 자산 내부 및 주변의 기존 조명 조 건에 따라 다르다. DARS는 자산에 탑재되고 데이터 센터에서 수집된 추가적인 데이터의 지원으 로 다양한 조명 조건을 처리한다. DARS는, 다양한 기상 조건에서 작업하기 위해, 더 많은 관심 물체를 감 지하기 위해, 기존 데이터베이스 시스템과 통합되어 데이터를 자동으로 생성, 감사 및 업데이트하기 위해, 복수 의 트랙을 감지하기 위해, 곡선 트랙과 일관되게 작업하기 위해, 장애물을 감지하기 위해, 안전 문제를 일으킬 수 있는 트랙 결함을 감지하기 위해, 그리고 저비용 임베디드 시스템에서 작동하기 위해 다양한 조명 조건에서 작동하도록 개선되었다. 운전실 점유, 트랙 감지 및 트랙 근처의 물체 감지, 트랙 위 또는 주위의 장애물 및 카메라를 차단하는 장애물 과 같은 장애물 감지 등의 물체 감지 및 위치와 같은, 비디오 분석 시스템으로부터의 내부 및/또는 외부 상태 결정이 차량 관리 시스템(VMS) 또는 디지털 비디오 레코더 구성요소로부터 탑재형 데이터 링크 를 통해 임의의 데이터와 함께 데이터 레코더에 제공된다. 데이터 레코더는 내부 및/또는 외부 상태 결정, 물체 감지 및 위치 구성요소 데이터, 및 장애물 감지 구성요소 데이터를 내충격형 메모리 모듈 에 저장하고, 선택적으로 제2 실시예의 비내충격형 제거 가능한 저장 장치에 저장하며, 데이터 센터 에 위치한 원격 데이터 관리자를 통해 원격 데이터 저장소에 저장한다. 웹 서버는, 요청 시, 웹 클라이언트를 통해 원격지에 위치한 사용자에게 내부 및/또는 외부 상태 결정, 물체 감지 및 위치 구 성요소 정보, 및 장애물 감지 구성요소 정보를 제공한다. 데이터 인코더는 규제 기관에 의해 일반적으로 정의되는 데이터의 적어도 최소 세트를 인코딩한다. 데이터 인코더는 카메라, 비디오 분석 시스템 및 비디오 관리 시스템 중 임의의 것으로부터 비디 오, 이미지 및 오디오 데이터를 수신하며, 원격 데이터 저장소로의 효율적인 실시간 전송 및 복제를 용이 하게 하기 위해 데이터를 압축하거나 인코딩하고 시간을 동기화한다. 데이터 인코더는, 사용자의 주 문형 요청에 응답하여 또는 자산에서 관찰되는 특정 작동 조건에 응답하여, 인코딩된 데이터를 탑재형 데이터 관리자로 전송한 다음 인코딩된 비디오, 이미지 및 오디오 데이터를 데이터 센터에 위치한 원격 데이터 관리자를 통해 원격 데이터 저장소로 전송한다. 탑재형 데이터 관리자 및 원격 데이터 관리자는 데이터 복제 프로세스를 관리하기 위해 함께 작동한다. 데이터 센터의 원격 데이터 관리자 는 복수의 자산으로부터 데이터의 복제를 관리할 수 있다. 탑재형 데이터 관리자는 내부 및/또는 외부 상태 결정, 물체 감지 및 위치, 및/또는 장애물 감지와 같은 이벤트가 감지되었는지 여부를 결정하고, 감지된 이벤트의 우선 순위에 따라 즉시 대기열에 넣거나 전송해야 한 다. 예를 들어, 정상적인 작동 상황에서, 트랙에서 장애물을 감지하는 것이 자산의 운전실에 누군가 있는 지 감지하는 것보다 훨씬 더 시급하다. 탑재형 데이터 관리자는 또한 대기열 저장소(미도시)에 데이터를 전송한다. 거의 실시간 모드에서, 탑재형 데이터 관리자는 데이터 인코더로부터 수신된 인코딩된 데이터 및 임의의 이벤트 정보를 내충격형 메모리 모듈 및 대기열 저장소에 저장한다. 5분 동안 인코딩된 데이터 가 대기열 저장소에 축적된 후, 탑재형 데이터 관리자는, 무선 데이터 링크를 통하여, 데이터 센터 의 원격 데이터 관리자를 통해 5분의 인코딩된 데이터를 원격 데이터 저장소에 저장한다. 실시 간 모드에서, 탑재형 데이터 관리자는, 무선 데이터 링크를 통하여, 데이터 센터의 원격 데이터 관리자를 통해, 데이터 인코더로부터 수신된 인코딩된 데이터 및 임의의 이벤트 정보를 내충격형 메 모리 모듈 및 원격 데이터 저장소에 저장한다. 이러한 구현에서, 탑재형 데이터 관리자는, 무선 데이터 링크를 통해, 데이터 센터의 원격 데이 터 관리자를 통하연, 비디오 데이터, 오디오 데이터, 내부 및/또는 외부 상태 결정, 물체 감지 및 위치 정 보, 장애물 감지 정보, 및 임의의 다른 데이터 또는 이벤트 정보를 원격 데이터 저장소로 전송한다. 무선 데이터 링크는, 예를 들어, 데이터 레코더로부터, 본 예에서는, 원격 데이터 관리자까지의, 무 선 근거리 통신 네트워크(WLAN), 무선 대도시 지역 네트워크(WMAN), 무선 광역 네트워크(WWAN), 무선 가상 사설 네트워크(WVPN), 셀룰러 전화 네트워크 또는 기타 데이터 전송 수단일 수 있다. 자산에서 원격으로 데이터 를 검색하는 프로세스는 자산과 데이터 센터 사이의 무선 연결을 필요로 한다. 무선 데이터 연결을 사용할 수 없는 경우, 무선 연결이 복원될 때까지 데이터가 저장되고 대기열에 추가된다. 데이터 기록과 병행하여, 데이터 레코더는 원격 데이터 저장소에 데이터를 지속적으로 자율적으로 복 제한다. 복제 프로세스에는 실시간 모드와 거의 실시간 모드의 두 가지 모드가 있다. 실시간 모드에서, 데이터 는 1초마다 원격 데이터 저장소에 복제된다. 거의 실시간 모드에서, 데이터는 매 5분마다 원격 데이터 저장 소에 복제된다. 거의 실시간 모드에 사용되는 속도는 구성 가능하며 실시간 모드에 사용되는 속도는 0.10초 마다 원격 데이터 저장소에 데이터를 복제하여 고해상도 데이터를 지원하도록 조정될 수 있다. 거의 실시간 모드는 데이터 복제 프로세스의 효율성을 향상시키기 위해 대부분의 조건에서 정상 작동 중에 사용된다. 실시간 모드는 자산에서 발생하는 이벤트를 기반으로 시작하거나 데이터 센터에서 시작된 요청에 의 해 시작될 수 있다. 실시간 모드에 대한 일반적인 데이터 센터 개시 요청은 원격에 위치한 사용자가 웹 클라이언트로부터 실시간 정보를 요청했을 때 개시된다. 실시간 모드가 자산에서 시작되는 일반적 인 이유는, 비상 정지 요청을 개시하는 운영자, 비상 제동 활동, 임의의 축에서 급격한 가속 또는 감속, 또는 데이터 레코더에 대한 입력 전원 손실과 같은, 자산과 관련된 이벤트 또는 사건의 감지이다. 거의 실 시간 모드에서 실시간 모드로 전환할 때, 원격 데이터 저장소에 아직 복제되지 않은 모든 데이터는 복제되 어 원격 데이터 저장소에 저장된 다음 라이브 복제가 시작된다. 거의 실시간 모드와 실시간 모드 사이의 전환은 일반적으로 5초 이내에 발생한다. 이벤트 또는 사건 이후 미리 결정된 시간이 경과한 후, 미리 결정된 비활성 시간이 지난 후, 또는 사용자가 자산으로부터 실시간 정보를 더 이상 원하지 않을 때, 데이터 레코더는 거의 실시간 모드로 되돌아간다. 전환을 시작하는 데 필요한 미리 결정된 시간은 구성 가능하며 일반적으로 10분으로 설정된다. 데이터 레코더가 실시간 모드에 있을 때, 탑재형 데이터 관리자는, 내충격형 메모리 모듈에 데 이터를 저장하고 선택적으로 제6 실시예의 선택적인 비-내충격형 강화 제거 가능한 저장 장치에 데이터를 저장 하면서 그리고 동시에 데이터를 원격 데이터 관리자에 전송하면서, 원격 데이터 관리자에 대한 대기 열을 지속적으로 비우려고 시도한다. 비디오 데이터, 오디오 데이터, 내부 및/또는 외부 상태 결정, 물체 감지 및 위치 정보, 장애물 감지 정보, 및 데이터 레코더로부터 복제될 다른 데이터 또는 정보를 수신하면, 원격 데이터 관리자는 인코딩된 데 이터 및 감지된 이벤트 데이터와 같은, 탑재형 데이터 관리자로부터 수신된 데이터를 데이터 센터 내 의 원격 데이터 저장소에 저장한다. 원격 데이터 저장소는, 예를 들어, 클라우드 기반 데이터 저장소또는 임의의 다른 적절한 원격 데이터 저장소일 수 있다. 데이터가 수신되면, 데이터 디코더가 원격 데이 터 저장소로부터 최근에 복제된 데이터를 디코딩하고 디코딩된 데이터를 추가적인 '후처리' 이벤트에 대해 저장된 데이터를 검사하는 트랙/물체 감지/위치 정보 구성요소로 전송하게 하는 프로세스가 개시된다. 트 랙/물체 감지/위치 정보 구성요소는 본 구현에서 내부 및/또는 외부 상태 결정, 물체 감지 및 위치 정보, 장애물 감지 정보를 결정하기 위한 물체/장애물 감지 구성요소를 포함한다. 내부 및/또는 외부 정보, 물체 감지 및 위치 정보, 및/또는 장애물 감지 정보를 감지하면, 트랙/물체 감지/위치 정보 구성요소는 정보를 원격 데이터 저장소에 저장한다. 원격지에 위치한 사용자는, 웹 브라우저와 같은 표준 웹 클라이언트 또는 본 구현에서 선택된 카메라 의 썸네일 이미지를 표시할 수 있는 가상 현실 장치(도시되지 않음)를 사용하여, 특정 자산 또는 복수의 자산과 관련하여, 트랙 정보, 자산 정보 및 운전실 점유 정보를 포함하는, 비디오 데이터, 오디오 데이터, 내부 및/또는 외부 상태 결정, 물체 감지 및 위치 정보, 장애물 감지 정보, 및 원격 데이터 저장소에 저장된 임 의의 다른 정보에 액세스할 수 있다. 웹 클라이언트는 공통 웹 표준, 프로토콜 및 기술을 사용하여 네트워 크를 통해 웹 서버에 정보에 대한 사용자 요청을 전달한다. 네트워크는 예를 들어 인터넷 일 수 있다. 네트워크는 근거리 통신 네트워크(LAN), 대도시 지역 네트워크(MAN), 광역 네트워크(WAN), 가 상 사설 네트워크(VPN), 셀룰러 전화 네트워크 또는 웹 서버로부터, 본 예에서는, 웹 클라이언트로 데이터를 전송하는 임의의 다른 수단일 수도 있다. 웹 서버는 원격 데이터 저장소로부터 원하는 데이 터를 요청하고, 데이터 디코더는 웹 서버로부터의 요청에 따라 원격 데이터 저장소로부터 특정 자산과 관련된 요청된 데이터를 획득한다. 데이터 디코더는 요청된 데이터를 디코딩하고 디코딩된 데 이터를 로컬라이저로 전송한다. 원시 인코딩 데이터 및 감지된 트랙/물체 감지/위치 정보가 협정 세계시 (UTC) 및 국제 단위계(SI 단위)를 사용하여 원격 데이터 저장소에 저장됨에 따라, 로컬라이저는 웹 클라이언트에 액세스하여 사용자가 설정한 프로필 설정을 식별하고 프로필 설정을 사용하여 사용자 에게 표시하기 위해 웹 클라이언트로 전송되는 정보를 준비한다. 로컬라이저는 디코딩된 데이터 를 사용자가 선호하는 측정 단위 및 언어와 같은 사용자가 원하는 포맷으로 변환한다. 로컬라이저 는 요청에 따라 웹 서버에 사용자의 선호 형식으로 현지화된 데이터를 전송한다. 이어서, 웹 서버 는, 내부 및/또는 외부 상태 결정과 함께, 트랙 및/또는 물체 감지(도 16a), 트랙 및 스위치 감지(도 16b), 트랙 및/또는 물체 감지, 트랙 수의 계산, 신호 감지(도 16c), 횡단 및 추적 및/또는 물체 감지(도 16d), 이중 오버헤드 신호 감지(도 16e), 다중 트랙 및/또는 다중 물체 감지(도 16f), 스위치 및 트랙 및/또는 물체 감지(도 16g), 스위치 감지(도 16h)와 같은, 표준 비디오 및 360도 비디오의 재생 및 실시간 디스플레이, 물체 감지 및 위치 정보, 장애물 감지 정보를 제공하면서, 로컬화된 데이터를 보고 분석하기 위해 웹 클라이언트 에 전송한다. 웹 클라이언트는 다양한 상이한 모드에서 360도 비디오 및/또는 다른 비디오의 재생을 제공하는 소프트웨 어 애플리케이션으로 개선된다. 사용자는, 예를 들어, 어안 뷰, 디워프 뷰, 파노라마 뷰, 이중 파노라마 뷰, 및 쿼드 뷰와 같은 소프트웨어 애플리케이션이 비디오 재생을 제공하는 모드를 선택할 수 있다. 도 17은 본 발명의 구현에 따른 자산의 내부 상태를 결정하기 위한 프로세스를 도시하는 흐름도이다. 비디오 분석 시스템은, 자산 상, 내, 또는 자산 근처의 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라, 레이더, LIDAR 및/또는 다른 카메라 등의 카메라, 차량 데이터 구성요소, 날씨 구성 요소, 경로/목록 및 GIS 구성 요소와 같은, 다양한 입력 구성요소로 부터 데이터 신호를 수신한다. 비디오 분석 시스템은 강화된 학습 및/또는 강화 학습 구성요소를 사 용하여 데이터 신호를 처리하고 운전실 점유와 같은 내부 상태를 결정한다. 도 18은 본 발명의 구현에 따라 자산의 외부 및 내부에서 발생하는 물체 감지/위치 및 장애물 감지를 결정 하기 위한 프로세스를 나타내는 흐름도이다. 비디오 분석 시스템은, 자산 상, 내, 또는 자산 근처의 360도 카메라, 고정된 카메라, 내로우 뷰 카메라, 와이드 뷰 카메라, 360도 어안 뷰 카메라, 레이더, LIDAR 및/ 또는 다른 카메라 등의 카메라, 차량 데이터 구성요소, 날씨 구성 요소, 경로/목록 및 GIS 구성 요소와 같은, 다양한 입력 구성요소로부터 데이터 신호를 수신한다. 비디오 분석 시스템은 강화 된 학습 및/또는 강화 학습 구성요소, 물체 감지/위치 구성요소, 및 장애물 감지 구성요소(928 984) 를 사용하여 데이터 신호를 처리하고, 장애물 감지 및 물체 감지 및 트랙 존재와 같은 위치를 결정한 다. 설명의 편의를 위해, 프로세스 및 프로세스는 일련의 단계로서 도시되고 설명된다. 그러나, 본 발명 에 따른 단계들은 다양한 순서로 및/또는 동시에 일어날 수 있다. 부가적으로, 본 발명에 따른 단계는 본원에제시 및 설명되지 않은 다른 단계와 함께 발생할 수 있다. 또한, 설명된 모든 단계가 개시된 주제에 따른 방법 을 구현하는 데 필요한 것은 아니다. 본원에 설명된 실시간 데이터 수집 및 기록 시스템 및 자동화된 신호 준수 모니터링 및 경고 시스템의 제7 실 시예는, 고가치 자산과 관련된 이벤트 및 운영 데이터, 비디오 데이터, 오디오 데이터와 같은, 광범위한 데이터 에 대한 실시간 또는 거의 실시간 액세스를, 자산 소유자, 운영자 및 조사관과 같은, 원격지에 위치한 사용자에 제공한다. 자동화된 신호 준수 모니터링 및 경고 시스템은 자산과 관련된 데이터 레코더를 통해 데이터를 기록 하고 사고가 발생하기 전, 발생 중, 발생 후 원격 데이터 저장소 및 원격 위치 사용자에게 데이터를 스트리밍한 다. 데이터는 실시간 또는 거의 실시간으로 원격 데이터 저장소로 스트리밍되어 최소한 사고 또는 비상 상황이 발생한 시점까지 정보가 사용될 수 있도록 하여, 자산과 관련된 사건을 조사하기 위해 \"블랙박스\"를 찾아 다운 로드할 필요가 거의 없으며, 자산의 데이터 레코더와 상호 작용하여 특정 데이터 다운로드를 요청하고 파일을 찾아 전송하며 데이터를 보기 위해 맞춤형 애플리케이션을 사용할 필요가 없다. 본 발명의 시스템은 일반적인 기록 능력을 유지하고, 사고 이전, 도중 및 이후에, 원격 데이터 저장소 및 원격지의 최종 사용자에게 데이터를 스트리밍하는 성능을 추가한다. 대부분의 상황에서, 데이터 레코더에 기록된 정보는 중복되며 데이터가 이미 획 득되어 원격 데이터 저장소에 저장되어 있으므로 필요하지 않다. 자동 신호 모니터링 및 경고 시스템은, 정지 신호, 교통 신호 및/또는 속도 제한 신호와 같은 신호의 위반 또는 정지 신호, 교통 신호 및/또는 속도 제한 신호와 같은 신호 준수를 유지하기 위해 모바일 자산을 안전하지 않게 작동하는 행위와 관련된, 기관차, 기차, 비행기, 자동차와 같은, 모바일 자산에 대한 기록 및 실시간 경고를 자 동으로 모니터링하고 제공한다. 자동화된 신호 모니터링 및 경고 시스템은, 예를 들어, 모바일 자산이 정지하지 않고 권한을 얻기 전에 정지 신호를 지나치는 경우와 같은(적색 신호 위반), 모바일 자산이 감소된 속도 제한을 나타내는 제한 신호를 위반하여 더 빠른 속도로 이동하는 경우와 같은, 모바일 자산이 안전 작동 규칙을 위반하 는 경우, 그리고 모바일 자산이, 정지 신호/적색 신호를 통과하기 이전에 정지하기 위해, 늦게 및/또는 과도하 게 제동력을 가하는 경우, 모바일 자산에 탑승중이고/탑승중이거나 탑승하고 있지 않는 사람에게 실시간으로 경 고하기 위해, 이미지 분석의 사용, GPS 위치, 제동력 및 차량 속도를 결합한다. 본 발명의 자동화된 신호 모니터링 및 경보 시스템 이전에, 운영 센터 직원은 안전한 운영 규칙을 위반할 때 보 고하기 위해 모바일 자산 직원에 의존했다. 때때로 모바일 자산이 충돌하는 치명적인 사고가 발생했으며, 후속 조사에서 안전 작동 규칙을 위반한 것이 발견되었다. 부가적으로, 과도한 제동력으로 인해 모바일 자산의 부품 에서 기계적 고장이 발생할 수 있고, 모바일 자산인 기관차 및/또는 기차가 과도한 제동력으로 인해 탈선한 상 황에서, 후속 조사를 통해 안전 작동 규칙 위반이 근본 원인으로 드러나는 경우도 있다. 본 발명의 시스템은 기 계적 고장, 충돌, 탈선 및/또는 다른 사고가 발생하기 전에, 안전 작동 규칙 위반이 발생할 때 사용자가 모니터 링 및/또는 경고를 받을 수 있도록 한다. 최종 사용자는 경고를 받는 데에 동의할 수 있고, 안전 작동 규칙 위반이 발생했으며 실제 이벤트가 발생한 후 몇 분 이내에 이메일, 문자 메시지 및/또는 브라우저 내 전자 알림을 수신할 것이다. 최종 사용자는 이력 기록 을 활용하여 데이터를 분석하여 예를 들어 문제 위치, 손실된 시야, 결함이 있는 장비 및 숙련되지 않은 직원과 같은 패턴을 식별할 수 있고, 이는 새롭고 안전한 운영 규칙을 구현하거나 지속적인 개선을 위한 승무원 교육 기회를 구현하는 데 유용할 수 있다. 본 발명의 시스템은 최종 사용자가 안전한 작동 규칙 위반 및/또는 신호 비준수로 인해 모바일 자산이 안전하지 않게 작동하는 때를 항상 이해하기 위해 지속적인 전자 모니터링 및 광 범위한 이미지 분석을 활용할 수 있다. 자동화된 신호 모니터링 및 경고 시스템은 차량 및/또는 모바일 자산 소유자, 운영자 및 조사자가 모바일 자산 의 운영 효율성과 안전성을 실시간으로 보고 분석하는 데 사용된다. 실시간으로 작업을 볼 수 있는 기능을 통해 행동을 신속하게 평가하고 조정할 수 있다. 사고가 발생하는 도중의 실시간 정보는 상황 분류를 용이하게 하고 최초 대응자에게 귀중한 정보를 제공할 수 있다. 정상 작동 중에 실시간 정보를 사용하여 승무원의 성과를 감사 하고 네트워크 전체의 운영 안전 및 인식을 지원할 수 있다. 자동 신호 모니터링 및 경고 시스템은, 모바일 자산 직원 및 경영진에게 실시간 피드백을 제공하기 위해 안전하 지 않고 잠재적으로 치명적인 운영 관행을 식별하기 위해, 완전히 통합된 시간 동기화 자동화 시스템의 차량, 기차 및/또는 모바일 자산 브레이크 압력 센서 데이터 뿐만 아니라, 외부 카메라 및/또는 다른 카메라, GPS 위 치, 속도 및 가속도를 활용한다. 자동화된 신호 모니터링 및 경고 시스템은 또한 경고 시점의 운영 환경에 대한 완전한 지식을 허용하기 위해 다양한 데이터 소스와 함께 사용자에게 자동화된 데이터 및 비디오 다운로드를 제 공한다.데이터에는 속도, 압력, 온도, 전류, 전압 및 가속도와 같은 자산 및/또는 주변 자산에서 발생하는 아날로그 및 디지털 파라미터, 스위치 위치와 액츄에이터 위치와 경고등 조명 및 액츄에이터 명령과 같은 부울 데이터, 위치 와 속도 및 고도와 같은 글로벌 포지셔닝 시스템(GPS) 데이터 및/또는 지리정보시스템(GIS) 데이터, 자산의 현 재 위치에서 자산에 대한 규제 속도 제한과 같은 내부 생성 정보, 자산 내, 상부 또는 자산 주변의 다양한 위치 에 있는 카메라의 비디오 및 이미지 정보, 자산 내부, 상부 또는 자산 주변의 다양한 위치에 있는 마이크로폰의 오디오 정보, 경로와 일정과 화물 목록 정보 등 데이터 센터에서 자산으로 전송되는 자산의 운영 계획에 대한 정보, 자산이 현재 운영 중이거나 운영 예정인 지역의 현재 및 예상 기상 조건을 포함하는 환경 조건에 대한 정 보, 기관차의 포지티브 열차 제어(PTC)와 같은 시스템에서 생성된 자산 제어 상태 및 운영 데이터, 및 부가적인 데이터, 비디오 및 오디오 분석과 분석학을 포함하나 이들에 제한되지 않는 위의 조합에서 파생된 데이터가 포 함될 수 있지만 이에 제한되지 않는다. 도 19는, 본 발명의 측면들이 구현될 수 있는, 예시적인 실시간 데이터 획득 및 기록 시스템(DARS) 및 자 동화된 신호 모니터링 및 경고 시스템의 제7 실시예의 현장 구현을 도시한다. DARS는 데이터 기록 장치에서 원격지에 있는 최종 사용자에게 실시간 정보를 전달하는 시스템이다. DARS는 차량 또는 모바일 자산에 설치되고, 무선 데이터 링크와 같은 데이터 링크를 통해 DARS의 데이터 센터를 통하여, 탑재형 유선 및/또는 무선 게이트웨이/라우터 또는 오프보드 정보 소스와 같은 무선 데이터 링크(107 0)의 조합을 통해, 다양한 정보 소스와 통신하는 데이터 레코더를 포함한다. 데이터 레코더는 탑재 형 데이터 관리자, 데이터 인코더, 차량 이벤트 감지기(l056), 대기열 저장소, 및 무선 게이 트웨이/라우터를 포함한다. 부가적으로, 본 구현에서, 데이터 레코더는, 이더넷(POE)을 통한 전력 이 있거나 없는, 내충격형 메모리 모듈 및/또는 이더넷 스위치를 포함할 수 있다. 예시적인 강화 메모리 모듈은, 예를 들어, 연방 규정 및/또는 연방 철도청 규정을 준수하는 충돌 방지 이벤트 레코더 메 모리 모듈일 수 있으며, 연방 규정 및/또는 연방 항공국 규정을 준수하는 충돌 생존 가능 메모리 장치일 수 있 고, 적용 가능한 연방 규정 코드를 준수하는 내충격형 메모리 모듈 또는 해당 기술 분야에 알려진 다른 적절한 강화 메모리 장치일 수 있다. 제8 실시예에서, 데이터 레코더는 선택적인 비-내충격형 강화 제거 가능한 저장 장치(도시되지 않음)를 더 포함할 수 있다. 유선 및/또는 무선 데이터 링크는 개별적인 신호 입력, 표준 또는 독점 이더넷, 직렬 연결 및 무선 연결 중 임의의 하나 또는 이들의 조합을 포함할 수 있다. 이더넷 연결 장치는 데이터 레코더의 이더넷 스위치 를 사용할 수 있으며 POE를 사용할 수 있다. 이더넷 스위치는 내부 또는 외부일 수 있고 POE를 지 원할 수 있다. 부가적으로, 도 19의 구현에서의, 맵 구성요소, 경로/승무원 목록 구성요소 및 날씨 구성요소와 같은 원격 데이터 소스로부터의 데이터는 무선 데이터 링크 및 무선 게이트웨이/라우터 를 통해 데이터 센터로부터 탑재형 데이터 관리자 및 차량 이벤트 감지기에서 이용가 능하다. 데이터 레코더는 탑재형 데이터 링크를 통해 자산의 구성에 따라 광범위하게 변화할 수 있는 다양 한 소스로부터 데이터 또는 정보를 수집한다. 데이터 인코더는 규제 기관에 의해 일반적으로 정의되는 데 이터의 적어도 최소 세트를 인코딩한다. 이러한 구현에서, 데이터 인코더는 다양한 자산 소스 및 데이터 센터 소스로부터 데이터를 수신한다. 정보 소스는, 임의의 아날로그 입력, 디지털 입력 , PO 모듈, 차량 제어기, 엔진 제어기, 관성 센서, 글로벌 포지셔닝 시스템 (GPS), 카메라, 포지티브 트레인 제어(PTC)/신호 데이터, 연료 데이터, 셀룰러 전송 감지기(미도시), 내부 구동 데이터 및 추가적인 데이터 신호, 및 경로/승무원 목록 구성 요소 중 임의의 것과 같은 데이터 센터의 임의의 수의 구성 요소, 날씨 구성요소, 맵 구성요소 및 임의의 추 가적인 데이터 신호와 같은, 자산의 구성 요소 수를 포함할 수 있다. 또한, 자산 정보 소스는 유선 또는 무선 데이터 링크의 임의의 조합을 통해 데이터 레코더에 연결될 수 있다. 데이터 인코더 는 원격 데이터 저장소로의 효율적인 실시간 전송 및 복제를 용이하게 하기 위해 데이터를 압축하 거나 인코딩하고 시간을 동기화한다. 데이터 인코더는 인코딩된 데이터를 탑재형 데이터 관리자로 전송하고, 이어서 탑재형 데이터 관리자는 내충격형 메모리 모듈 및 대기열 저장소에 인코딩 된 데이터를, 데이터 센터에 위치한 원격 데이터 관리자를 통해 원격 데이터 저장소로 복제 하기 위해, 저장한다. 선택적으로, 탑재형 데이터 관리자는 제8 실시예의 비-내충격형 강화 제거 가능한 저장 장치에 인코딩된 데이터의 3차 사본을 저장할 수 있다. 탑재형 데이터 관리자 및 원격 데이터 관리 자는 데이터 복제 프로세스를 관리하기 위해 협력한다. 데이터 센터 내의 단일 원격 데이터 관리자 는 복수의 자산으로부터의 데이터 복제를 관리할 수 있다.다양한 입력 구성요소로부터의 데이터 및 운전실 내 오디오/그래픽 사용자 인터페이스(GUI)로부터의 데이 터는 차량 이벤트 감지기로 전송된다. 차량 이벤트 감지기는 자산과 관련된 이벤트, 사건 또 는 다른 미리 정의된 상황이 발생했는지 여부를 결정하기 위해 데이터를 처리한다. 차량 이벤트 감지기가 미리 정의된 이벤트가 발생했음을 나타내는 신호를 감지하면, 차량 이벤트 감지기는 사전 정의된 이벤트 를 둘러싼 지원 데이터와 함께 사전 정의된 이벤트가 발생한 처리된 데이터를 탑재형 데이터 관리자로 전 송한다. 차량 이벤트 감지기는, 자산의 구성에 따라 다를 수 있는, 아날로그 입력, 디지털 입력 , I/O 모듈, 차량 제어기, 엔진 제어기, 관성 센서, GPS, 카메라, 경로/승무원 목록 구성요소, 날씨 구성요소, 맵 구성요소, PTC/신호 데이터 및 연료 데이터와 같은, 다양한 소스의 데이터를 기반으로 이벤트를 감지한다. 차량 이벤트 감지기가 이벤 트를 감지하면, 감지된 자산 이벤트 정보는 대기열 저장소에 저장되고 선택적으로 운전실 내 오디오/그래 픽 사용자 인터페이스(GUI)를 통해 자산의 승무원에게 제공될 수 있다. 자산의 위치가 신호와 교차되었음을 나타낼 때, 과도한 제동이 발생했으며, 자산은 신호 의 가까운 위치 내에서 멈췄거나, 또는 신호 양상에 의해 속도 제한이 적용되며, 도 20에 도시된 바와 같 이, 탑재형 데이터 관리자는 신호의 의미 또는 측면을 결정하기 위해 외부를 향한 카메라 이미지 분석을 시작한다. 최첨단 이미지 처리 기술을 사용하여, 외부를 향한 카메라 영상은 이전에 훈련된 신경망 또는 인공 지능 구성 요소에 의해 분석되어 신호 양상 및 작동 규칙 의미를 해독할 수 있다. 이러한 예시적인 구현에 서, 신경망 또는 인공 지능 구성요소에 의한 분석 및/또는 처리는 백 오피스(back office)에서 수행된다. 또다 른 실시예에서, 신경망 또는 인공 지능 구성 요소에 의한 분석 및/또는 처리는 자산 상에서 수행된다. 본 예시적인 구현에서, 자산이 철도 트랙을 점유하여 신호의 지시를 크게 위반하여 열차 충돌로 이어질 수 있는지 여부를 결정하기 위해, 또는 신호 준수를 달성하기 위한 안전한 방식이 아닌 방식으로 작동했는지 여부 를 결정하기 위해, 신호 양상의 디코딩의 출력은 다른 센서 데이터와 결합된다. 자산이 규정을 준수하지 않는 것으로 드러나면, 신호 및 자산 운영에 철도의 비즈니스 규칙을 연관시킨 후, 전자 경보는 백 오피스에 저 장되고 그러한 경고의 수신에 동의한 사용자에게 전달된다. 이어서, 이러한 경고는 데이터베이스를 통해 직접 또는 웹사이트 그래픽 사용자 인터페이스 또는 사용자에게 제공되는 웹 클라이언트를 사용하여 마이닝될 (mined) 수 있다. 부가적으로, 자산의 운전실에 임박한 신호 위반, 승무원이 산만한 경우 그렇지 않으면 트랙 장애물, 정지 신호에 주의를 기울이지 않는 경우 및/또는 자산이 신호가 더 낮은 속도 제한을 요구하는 구역에서 과속 하는 경우 승무원이 더 빨리 응답 할 수 있게 하는, 임박한 안 좋은 상황에 대해 승무원에게 경고하는 가청 경 고가 추가될 수 있다. 자동 신호 모니터링 및 경고 시스템도, 모니터링된 자산이 신호를 교차할 때마다 신호 의미를 결정하기 위해, 자산에 과도한 제동력이 가해지고 사전 정의된 거리 내에서 정지할 때마다 신호의 의미를 결정하기 위해, 그리고 자산 속도를 모니터링하여 자산이 신호 양상에 의해 결정된 대로 승인된 것보다 더 빠른 속도로 이동하 는지 여부를 결정하기 위해, 비디오 분석을 자동으로 수행하도록 개선되었다. 이미지 분석은 실제 이벤트와 사 용자 및/또는 동의자 사이에서 전자 통지의 지연을 줄이기 위해 자산에서 수행된다. 자동화된 신호 모니 터링 및 경보 시스템의 기능은, 사용자 경험을 향상하고 이벤트를 조사하는 데 필요한 작업을 줄이기 위 해, 경보 시 자동화된 내부 및 외부 대면 비디오 다운로드를 허용하도록 개선되었다. 자동화된 신호 모니터링 및 경고 시스템의 기능은 또한, 주의가 산만하거나 신호 규칙 및 의미와 관련하여 안전한 운항 관행을 따 르지 않는 기타 이유가 있는 경우 승무원에게 경고하기 위해, 비준수 자산 내에서 실시간 가청 신호를 제 공하도록 개선되었다. 부가적으로, 자동화된 신호 모니터링 및 경고 시스템 및/또는 비디오 분석 시스템은, 트랙 근처의 정지 신호, 교통 신호, 속도 제한 신호 및/또는 물체 신호와 같은, 신호의 위도 및 경도 좌표를 포함하는, 자산 소유자로부터의 위치 정보를 수신할 수 있다. 비디오 분석 시스템은 자산 소유자로부터 수신된 위치 정보 가 정확한지 여부를 결정한다. 위치정보가 정확하다면, 비디오 분석 시스템은 정보를 저장하고 월 단위로 위치 정보를 확인하는 것과 같이 미리 결정된 시간 동안 위치 정보를 다시 확인하지 않는다. 위치정보가 정확하 지 않을 경우, 비디오 분석 시스템은 정확한 위치 정보를 결정하고 자산 소유자에게 정확한 위치 정보를 보고하며, 위치 정보를 저장하고, 월 단위로 위치 정보를 확인하는 것과 같은 일정 시간 동안 위치 정보를 다시 확인하지 않는다. 위치 정보를 저장하면, 정지 신호, 교통 신호, 속도 제한 신호 및/또는 트랙 근처의 물체 신 호와 같은 신호를 더 용이하게 감지할 수 있다. 탑재형 데이터 관리자는 또한 데이터를 대기열 저장소로 전송한다. 거의 실시간 모드에서, 탑재형 데이터 관리자는 데이터 인코더로부터 수신된 인코딩된 데이터 및 임의의 이벤트 정보를 내충격형 메모리 모듈 및 대기열 저장소에 저장한다. 제8 실시예에서, 탑재형 데이터 관리자는 인코딩 된 데이터를 비-내충격형 강화 제거 가능한 저장 장치에 선택적으로 저장할 수 있다. 5분 동안 인코딩된 데이터 가 대기열 저장소에 축적된 후, 탑재형 데이터 관리자는, 무선 게이트웨이/라우터를 통해 액 세스된 무선 데이터 링크를 통해, 5분간의 인코딩된 데이터를 원격 데이터 관리자를 통해 데이터 센터 내의 원격 데이터 저장소에 저장한다. 실시간 모드에서, 탑재형 데이터 관리자는 데이 터 인코더로부터 수신된 인코딩된 데이터 및 임의의 이벤트 정보를 내충격형 메모리 모듈에 저장하 며, 선택적으로 비-내충격형 강화 제거 가능한 저장 장치에 저장하고, 무선 게이트웨이/라우터를 통해 액 세스된 무선 데이터 링크를 통해, 데이터 센터 내의 원격 데이터 관리자를 통해 원격 데이터 저장소에 저장한다. 원격 데이터 저장소에 데이터를 복제하는 프로세스는 자산과 데이터 센 터 사이의 무선 데이터 연결을 필요로 한다. 탑재형 데이터 관리자 및 원격 데이터 관리자는 무선 게이트웨이/라우터를 이용하는 Wi-Fi, 셀룰러, 위성 및 개인 무선 시스템과 같은 다양한 무선 통신 링크를 통해 통신할 수 있다. 무선 데이터 링크는, 예를 들어, DARS의 데이터 레코더로부터, 본 예에서는, DARS의 원격 데이터 관리자로 데이터 전송하는, 무선 근거리 통신 네트워크(WLAN), 무선 대도시 지역 네트워크(WMAN), 무선 광역 네트워크(WWAN), 사설 무선 시스템, 휴대 전화 네트워크 또는 기 타 수단일 수 있다. 무선 데이터 연결을 사용할 수 없는 경우, 데이터는 무선 연결이 복원되고 데이터 복제 프 로세스가 재개될 수 있을 때까지 메모리에 저장되고 대기열 저장소에 저장된다. 데이터 기록과 병행하여, 데이터 레코더는 원격 데이터 저장소에 데이터를 지속적으로 자율적으로 복제한다. 복제 프로세스에는 실시간 모드와 거의 실시간 모드의 두 가지 모드가 있다. 실시간 모드에서, 데이 터는 1초마다 원격 데이터 저장소에 복제된다. 거의 실시간 모드에서, 데이터는 매 5분마다 원격 데이터 저장소에 복제된다. 거의 실시간 모드에 사용되는 속도는 구성 가능하며, 실시간 모드에 사용되는 속도는 0.10초마다 원격 데이터 저장소에 데이터를 복제함으로써 고해상도 데이터를 지원하도록 조정될 수 있다. DARS가 거의 실시간 모드일 때, 탑재형 데이터 관리자는 데이터를 원격 데이터 관리자에 복 제하기 전에 대기열 저장소에 데이터를 대기시킨다. 탑재형 데이터 관리자는 또한 대기열 저장소 에 대기하고 있는 차량 이벤트 감지기 정보를 원격 데이터 관리자에 복제한다. 거의 실시간 모드는, 데이터 복제 프로세스의 효율성을 향상시키기 위해, 대부분의 조건에서 정상 작동 중에 사용된다. 실시간 모드는, 자산에 탑재된 차량 이벤트 감지기에 의해, 또는 데이터 센터에서 시작된 요 청에 의해, 발생 및 감지된 이벤트에 기초하여 시작될 수 있다. 원격지에 위치한 사용자가 웹 클라이언트 로부터 실시간 정보를 요청했을 경우, 실시간 모드에 대한 일반적인 데이터 센터 시작 요청이 시작 된다. 실시간 모드가 자산에서 시작되는 일반적인 이유는, 비상 정지 요청을 시작하는 운전자, 비상 제동 활동, 임의의 축에서 급격한 가속 또는 감속, 또는 데이터 레코더에 대한 입력 전원의 손실과 같은, 차량 이벤트 감지기에 의한 이벤트 또는 사건의 감지이다. 거의 실시간 모드에서 실시간 모드로 전환할 때, 원 격 데이터 저장소에 아직 복제되지 않은 모든 데이터가 복제되어 원격 데이터 저장소에 저장된 다 음 라이브 복제가 시작된다. 거의 실시간 모드와 실시간 모드 사이의 전환은 일반적으로 5초 이내에 발생한다. 이벤트 또는 사고 발생 후 일정 시간이 경과한 후, 미리 결정된 비활성 시간이 경과된 후 또는 사용자가 자산의 실시간 정보를 더 이상 원하지 않을 때, 데이터 레코더는 거의 실시간 모드로 되돌아간다. 전환을 시작하는 데 필요한 미리 결정된 시간은 구성 가능하며 일반적으로 10분으로 설정된다. 데이터 레코더가 실시간 모드에 있을 때, 탑재형 데이터 관리자는 원격 데이터 관리자에 대 한 대기열을 지속적으로 비우려고 시도하고, 내충격형 메모리 모듈 및 선택적으로 비-내충격형 강화 제거 가능한 저장 장치에 데이터를 저장하며, 동시에 데이터를 원격 데이터 관리자에 전송한다. 탑재형 데이터 관리자는 또한 대기열 저장소에 대기 중인 감지된 차량 정보를 원격 데이터 관리자로 전송한 다. 맵 구성요소, 경로/승무원 목록 구성요소 및 날씨 구성요소의 데이터와 함께, 데이터 레코더 로부터 복제할 데이터를 수신하면, 원격 데이터 관리자는 압축된 데이터를 DARS의 데이터 센 터에 있는 원격 데이터 저장소에 저장한다. 원격 데이터 저장소는, 예를 들어, 클라우드 기 반 데이터 저장소 또는 임의의 다른 적절한 원격 데이터 저장소일 수 있다. 데이터가 수신되면, 데이터 디코더 가 원격 데이터 저장소에 대하여/원격 데이터 저장소로부터 최근 복제된 데이터를 디코딩하 고 디코딩된 데이터를 원격 이벤트 감지기로 전송하게 하는 프로세스가 개시된다. 원격 데이터 관리자 는 차량 이벤트 정보를 원격 데이터 저장소에 저장한다. 원격 이벤트 감지기가 디코딩된 데이터를 수신할 경우, 관심 이벤트가 디코딩된 데이터에서 발견되는지를 결정하기 위해 디코딩된 데이터를 처리 한다. 디코딩된 정보는 자산과 함께 발생하는 데이터에서 이벤트, 사건 또는 기타 미리 정의된 상황을 감 지하기 위해 원격 이벤트 감지기에 의해 사용된다. 디코딩된 데이터로부터 관심 이벤트를 감지하면, 원격 이벤트 감지기는 이벤트 정보 및 지원 데이터를 원격 데이터 저장소에 저장한다. 원격 데이터 관리 자가 원격 이벤트 감지기 정보를 수신할 경우, 원격 데이터 관리자는 정보를 원격 데이터 저 장소에 저장한다. 원격 위치에 있는 사용자는, 웹 브라우저 또는 가상 현실 장치(미도시)와 같은 표준 웹 클라이언트(104 2)를 사용하여, 특정 자산 또는 복수의 자산과 관련된 차량 이벤트 감지기 정보를 포함하는 정보에 액세 스할 수 있고, 이러한 구현에서 선택된 카메라의 썸네일 이미지를 표시할 수 있다. 웹 클라이언트는 공통 웹 표준, 프로토콜 및 기술을 사용하여 네트워크를 통해 웹 서버에 정보에 대한 사용자 요청 을 전달한다. 네트워크는 예를 들어 인터넷일 수 있다. 네트워크는 근거리 통신 네트워크(LAN), 대 도시 지역 네트워크(MAN), 광역 네트워크(WAN), 가상 사설 네트워크(VPN), 셀룰러 전화 네트워크, 또는 웹 서버 로부터, 본 예에서는, 웹 클라이언트로 데이터를 전송하는 임의의 다른 수단일 수도 있다. 웹 서버 는 데이터 디코더에 원하는 데이터를 요청한다. 데이터 디코더는 웹 서버로부터의 요 청에 따라 원격 데이터 저장소로부터 특정 자산 또는 복수의 자산과 관련된 요청된 데이터를 획득 한다. 데이터 디코더는 요청된 데이터를 디코딩하고 디코딩된 데이터를 로컬라이저로 전송한다. 로 컬리제이션은 데이터를 사용자가 선호하는 언어 및 측정 단위로 변환하는 것과 같이 최종 사용자가 원하는 형식 으로 데이터를 변환하는 프로세스이다. 원시 인코딩 데이터 및 감지된 이벤트 정보가 협정 세계시(UTC) 및 국제 단위 시스템(SI 단위)을 사용하여 원격 데이터 저장소에 저장됨에 따라, 로컬라이저는 웹 클라이언 트에 액세스하여 사용자에 의해 설정된 프로필 설정을 식별하고 프로필 설정을 사용하여 사용자 에게 표시하기 위해 웹 클라이언트에 전송되는 정보를 준비한다. 로컬라이저는 디코딩된 데 이터를 사용자가 선호하는 언어 및 측정 단위와 같은 사용자가 원하는 포맷으로 변환한다. 로컬라 이저는 요청에 따라 사용자가 선호하는 형식의 로컬라이즈된 데이터를 웹 서버에 전송한다. 이어서, 웹 서버는, 표준 비디오, 360도 비디오 및/또는 다른 비디오의 재생 및 실시간 표시를 제공하면 서, 검토 및 분석을 위해 자산 또는 복수의 자산의 로컬화된 데이터를 웹 클라이언트로 전송한다. 웹 클 라이언트는 디스플레이할 수 있고, 사용자는 단일 자산에 대한 데이터, 비디오 및 오디오를 보거나 복수의 자산에 대한 데이터, 비디오 및 오디오를 동시에 볼 수 있다. 웹 클라이언트는 또한, 자산 상부, 자산 내부, 또는 자산 근처로부터의, 자산 주위로부터의, 및/또는 원격지에 의치한 사이트로부터의 이미지 측정 소스, 표준 비디오 소스, 360도 비디오 소스, 및/또는 다른 비디오 소스, 및/또는 거리 측정 소스로부터의 복수 의 비디오 및 오디오 데이터와 함께 데이터의 동기 재생 및 실시간 디스플레이를 제공할 수 있다. 도 21은 본 발명의 구현에 따른 신호 준수를 결정하기 위한 프로세스의 예시된 제1 실시예를 도시하는 흐 름도이다. DARS 및 카메라가 설치되고, 자산의 아날로그 입력, 디지털 입력, I/O 모듈, 차량 제어기, 엔진 제어기, 관성 센서, 글로벌 포지셔닝 시스템 (GPS), 카메라, 포지티브 열차 제어(PTC)/신호 데이터, 연료 데이터, 셀룰러 전송 감 지기(도시되지 않음), 내부 구동 데이터 및 추가적인 데이터 신호와 같은, 다양한 센서에 연결된 후, 다 양한 센서 및/또는 이벤트 시작 비디오 및/또는 정지 이미지의 탑재된 데이터는 매 5분마다 백 오피스 데이터 센터로 전송되며, 카메라 이미지는 72시간 이상의 용량으로 자산에 저장된다. 백 오피스 데 이터 센터 서비스는 트리거 조건에 대한 데이터를 지속적으로 스캔한다. 에피소드 비즈니스 로직 트리거 조건이 충족되지 않으면, 워크플로가 취소되고 에피소드 이벤트가 기록되지 않는다. 자산이 백오피스 데이터 센터(1074, 1110)에 저장된 모든 신호의 위도 및 경도 좌표에 의해 참조되는 트랙 신호 를 지나 이동한 경우 및/또는 자산이 신호 앞에서 특정 거리 내에서 정지하고 신호(1082, 1112)를 지나 횡단하기 전에 정지를 허용하기 위해 과도한 제동력을 사용하는 경우, 백 오피스 데이터 센터 서비 스는 데이터를 스캔하여, 이 예시된 실시예에서 열차 차량이 선두, 제어 또는 기차 자산(1048, 1114)의 제1 위 치에 있는지를 결정한다. 기차 차량이 기차 자산의 선두, 제어 또는 제1 위치에 있지 않은 경우, 에피소 드 비즈니스 로직 트리거 조건이 충족되지 않으며, 워크플로가 취소되고 에피소드 이벤트가 기록되지 않는다 . 열차 차량이 열차 자산의 선두, 제어 또는 제1 위치에 있는 경우, 백 오피스 데이터 센터 는 제1 인공 지능 모델을 사용하여 열차 차량이 열차 자산(1048, 1116)의 선두, 제어 또는 제1 위치에 있는지를 결정합니다. 열차 차량이 열차 자산의 선두, 제어 또는 제1 위치에 있지 않은 경우, 에피소드 비즈니스 로직 트리거 조건이 충족되지 않으며, 워크플로우가 취소되고 에피소드 이벤트가 기록되지 않는다. 열차 차량이 열차 자산의 선두, 제어 또는 제1 위치에 있는 경우, 백 오피스 데이터 센터는 선두, 제어,또는 제1 위치 기관차로부터, 신호를 횡단하기 전의 짧은 시간의 및/또는 자산이 멈출 때의, 비디오 콘텐츠를 요청한다. 검색된 비디오 콘텐츠는 백 오피스 데이터 센터에 전달 및/또는 저장되고, 신 호가 의미하는 STOP을 나타내는지 결정하기 위해, 각각의 신호등의 색상 조합과 같은 신호 양상을 결정하기 위해 비디오 콘텐츠를 스캔하는 제2 인공 지능 모델에 전달된다. 백 오피스 데이터 센터(107 4)는 신호 양상이 자산이 정지해야 하고 신호(1082, 1122)를 통과할 수 없음을 표시하는지 여부를 결정한다. 신호 양상이 자산이 정지해야 하고 신호를 통과할 수 없음을 나타내지 않으면, 에 피소드 비즈니스 로직 트리거 조건이 충족되지 않으며, 워크플로우가 취소되고 에피소드 이벤트가 기록되지 않 는다. 신호 양상이 자산이 정지해야 하고 신호를 통과할 수 없음을 나타내며 정지 신 호가 존재하는 경우, 에피소드가 트리거되어, 백 오피스 데이터 센터 데이터베이스에 저장되며, 그러한 조건이 존재할 때 알림을 받도록 이전에 선택된 사용자에게 이메일이 전송된다. 설명의 편의를 위해, 프로세스는 일련의 단계로서 도시되고 설명된다. 그러나, 본 발명에 따른 단계들은 다양한 순서로 및/또는 동시에 일어날 수 있다. 부가적으로, 본 발명에 따른 단계는 본원에 제시 및 설명되지 않은 다른 단계와 함께 발생할 수 있다. 또한, 설명된 모든 단계가 개시된 주제에 따른 방법을 구현하는 데 필 요한 것은 아니다. 본 애플리케이션에서 사용된 바와 같이, \"또는\"이라는 용어는 배타적인 \"또는\"이 아니라 포괄적인 \"또는\"을 의 미한다. 즉, 달리 명시되지 않거나 문맥상 명확하지 않은 한, \"X는 A 또는 B를 포함한다\"는 임의의 자연적 포괄 적 순열을 의미하도록 의도된다. 즉, X가 A를 포함하는 경우; X가 B를 포함하는 경우; 또는 X가 A와 B를 모두 포함하는 경우, \"X는 A 또는 B를 포함한다\"는 전술한 경우 중 어느 하나에 해당한다. 또한, \"X는 A 및 B 중 적 어도 하나를 포함한다\"는 임의의 자연적 포함 순열을 의미하도록 의도된다. 즉, X가 A를 포함하는 경우; X가 B 를 포함하는 경우; 또는 X가 A와 B를 모두 포함하는 경우, \"X는 A 및 B 중 적어도 하나를 포함한다\"는 전술한 경우 중 어느 것이라도 충족된다. 본 출원 및 첨부된 청구범위에 사용된 관사 \"a\" 및 \"an\"은 달리 명시되지 않 거나 문맥상 단수 형태로 지시되지 않는 한 일반적으로 \"하나 이상\"을 의미하는 것으로 해석되어야 한다. 또한, 전체에 걸쳐 \"일 구현\" 또는 \"하나의 구현\"이라는 용어의 사용은 그와 같이 기술되지 않는 한 동일한 실시예, 측면 또는 구현을 의미하도록 의도되지 않는다. 본 발명이 특정 실시예와 관련하여 설명되었지만, 본 발명은 개시된 실시예로 제한되지 않고, 반대로 첨부된 청 구범위의 범위 내에 포함된 다양한 수정 및 관련된 배열을 포함하도록 의도된 것으로 이해되어야 하며, 청구범 위는 법에 따라 허용되는 모든 수정 및 동등한 구조를 포함하도록 가장 광범위한 해석에 따라야 한다."}
{"patent_id": "10-2021-7035338", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본원의 설명은 첨부된 도면을 참조하며, 여기서 유사한 참조 번호는 여러 도면에 걸쳐 유사한 부분을 지칭한다. 도 1은, 본 발명의 구현에 따른, 예시적인 실시간 데이터 획득 및 기록 시스템의 제1 실시예의 현장 구현을 도 시한다. 도 2는, 본 발명의 구현에 따른, 예시적인 실시간 데이터 획득 및 기록 시스템의 제2 실시예의 현장 구현을 도 시한다. 도 3은, 본 발명의 구현에 따른, 모바일 자산으로부터 데이터 및/또는 정보를 기록하기 위한 프로세스의 흐름도 이다. 도 4는, 본 발명의 구현에 따른, 정전 후 모바일 자산으로부터 데이터 및/또는 정보를 첨부하기 위한 프로세스 의 흐름도이다. 도 5는, 본 발명의 구현에 따른, 내충격형 메모리 모듈에 저장된 예시적인 중간 기록 블록들 및 전체 기록 블록 들을 도시하는 도면이다 도 6은, 본 발명의 구현에 따른, 정전 이전 및 전원 복원 이후의 내충격형 메모리 모듈의 예시적인 중간 기록 블록들을 도시하는 도면이다 도 7은, 본 발명의 구현에 따른, 전력이 복구된 후의 내충격형 메모리 모듈의 예시적인 레코드 세그먼트를 도시 하는 도면이다. 도 8은, 본 발명의 구현에 따른, 실시간 데이터 획득 및 기록 시스템 뷰어의 제1 실시예의 현장 구현을 도시한 다. 도 9는, 본 발명의 구현에 따른, 모바일 자산으로부터의 비디오 데이터, 오디오 데이터, 및/또는 정보를 기록하 기 위한 프로세스의 흐름도이다. 도 10은, 본 발명의 구현에 따른, 모바일 자산으로부터의 비디오 데이터, 오디오 데이터, 및/또는 정보를 기록 하기 위한 프로세스의 흐름도이다. 도 11은, 본 발명의 구현에 따른, 실시간 데이터 획득 및 기록 시스템 뷰어의 360도 카메라의 예시적인 어안 뷰 를 도시하는 흐름도이다. 도 12는, 본 발명의 구현에 따른, 실시간 데이터 획득 및 기록 시스템 뷰어의 360도 카메라의 예시적인 파노라 마 뷰를 도시하는 다이어그램이다. 도 13은, 본 발명의 구현에 따른, 실시간 데이터 획득 및 기록 시스템 뷰어의 360도 카메라의 예시적인 쿼드 뷰 를 도시하는 다이어그램이다. 도 14는, 본 발명의 구현에 따른, 실시간 데이터 획득 및 기록 시스템 뷰어의 360도 카메라의 예시적인 디워프 된(dewarped) 뷰를 예시하는 다이어그램이다. 도 15는, 본 발명의 구현에 따른, 데이터 획득 및 기록 시스템 비디오 콘텐츠 분석 시스템의 제1 실시예의 현장 구현을 도시한다. 도 16a는, 본 발명의 구현에 따른, 예시적인 트랙 감지를 도시하는 도면이다.도 16b는, 본 발명의 구현에 따른, 예시적인 트랙 감지 및 스위치 감지를 도시하는 도면이다. 도 16c는, 본 발명의 구현에 따른, 예시적인 트랙 감지, 트랙들의 수 카운트, 및 신호 감지을 도시하는 도면이 다. 도 16d는, 본 발명의 구현에 따른, 예시적인 교차로 및 트랙 검출을 도시하는 도면이다. 도 16e는, 본 발명의 구현에 따른, 예시적인 이중 오버헤드 신호 검출을 도시하는 도면이다. 도 16f는, 본 발명의 구현에 따른, 예시적인 다중 트랙 감지를 도시하는 도면이다. 도 16g는, 본 발명의 구현에 따른, 예시적인 스위치 및 트랙 감지를 도시하는 도면이다. 도 16h는, 본 발명의 구현에 따른, 예시적인 스위치 감지를 도시하는 도면이다. 도 17은, 본 발명의 구현에 따른, 모바일 자산의 내부 상태를 결정하기 위한 프로세스의 흐름도이다. 도 18은, 본 발명의 구현에 따른, 모바일 자산 외부에서 발생하는 물체 감지 및 장애물 감지를 결정하기 위한 프로세스의 흐름도이다. 도 19는, 본 발명의 구현에 따른, 예시적인 실시간 데이터 획득 및 기록 시스템의 제7 실시예의 현장 구현을 도 시한다. 도 20은, 본 발명의 구현에 따른, 자동화된 신호 준수 모니터링 및 경고 시스템의 예시적인 신호 감지를 도시하 는 도면이다. 도 21은, 본 발명의 구현에 따른, 신호 준수를 결정하기 위한 프로세스의 제1 실시예의 흐름도이다."}
