{"patent_id": "10-2021-0167543", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0080110", "출원번호": "10-2021-0167543", "발명의 명칭": "가족 데이터 기반의 개인 데이터 서비스 제공 시스템 및 그 방법", "출원인": "한국전자통신연구원", "발명자": "박영수"}}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가족력 데이터 및 가족관계 데이터 중 적어도 어느 하나를 제공하는 사용자 단말; 가족 데이터 기반의 개인 데이터 서비스를 홈챗봇 기능을 통해 제공하는 홈챗봇 제공 장치; 및댁 외의 서비스를 제공하기 위해 상기 홈챗봇 제공 장치와 연결되는 레거시 시스템을 포함하는 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 홈챗봇 제공 장치는, 상기 사용자 단말과 메시지 및 데이터를 송수신하는 대화형 인터페이스를 제공하는 인터페이스부; 상기 대화형 인터페이스를 통해 사용자와 상호작용하는 패밀리봇부; 수신된 데이터를 이용하여 필요한 대화형 서비스를 판단하고, 지식 자원 관리를 수행하고 상기 댁 외의 서비스를 제공하기 위해 상기 레거시 시스템과의 연결을 제공하는 홈챗봇관리부; 및상기 개인 데이터 서비스 제공을 위한 대화형 음성 모델 및 상기 지식 자원을 저장하는 데이터베이스부를 포함하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 패밀리봇부는 규칙 또는 인공지능을 이용하여 상기 사용자 단말과 상호작용을 수행하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 패밀리봇부는 대화 내용에서 기정의된 키워드를 인식하여 대화를 이해하고 준비된 응답을 출력하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 패밀리봇부는 사전 시나리오에 따라 사용자 입력에 대한 응답으로 가족사, 가족력 및 개인 기록물 중 적어도 어느 하나를 제공하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템. 공개특허 10-2023-0080110-3-청구항 6 제2항에 있어서, 상기 홈챗봇관리부는 상기 수신된 데이터를 참조하여 조건이 충족된 서비스 기능을 제공하기 위한 구성정보를생성하고, 상기 구성정보를 기록 및 저장하여 상기 지식 자원을 관리하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서, 상기 레거시 시스템은 상기 홈챗봇 제공 장치가 파악한 사용자 의도에 상응하는 댁 외의 서비스를 제공하며, 기관에서 관리하는 사용자 관련 정보를 제공하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서, 상기 홈챗봇 제공 장치는 상기 사용자 단말로부터 관계 정의 데이터를 수신하여, 사용자와의 관계를 정의하고저장하며, 사용자 캐릭터를 생성하여 관계별 성격을 생성하고, 관계 성격 데이터베이스를 구축하며, 상기 사용자 단말로부터 대화가 요청되면 대화 인터페이스를 제공하고, 성격에 의문이 제기되는 경우 상기 의문을 오류피드백으로 하여 재저장하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서, 상기 홈챗봇 제공 장치는 상기 사용자 단말로부터 수신한 질의 데이터에서 키워드를 획득하고, 상기 질의 데이터의 요소별로 의도를 분류하며, 분류에 따라 기설정된 서비스 범위에 해당되는 개인 데이터 서비스를제공하고, 기설정된 서비스 범위 외의 댁 외 서비스 요청이 있는 경우 상기 레거시 시스템의 서비스를 제공하는것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서, 상기 홈챗봇 제공 장치는 가족력 및 가족관계 서비스 안내서에 대한 데이터를 획득하고, 획득된 데이터에 대한수집, 가공 및 적재를 통해 개인 데이터를 처리하며, 자연어 데이터 기반의 분야별 데이터베이스를 구축하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 홈챗봇 제공 장치는 상기 사용자 단말로부터 수신한 문자 및 음성 정보에 대해 자연어 처리를 통해 키워드와 연관어를 추출하고, 추출 결과를 이용하여 데이터베이스 검색 및 질의응답을 수행하며, 상기 질의응답의 내공개특허 10-2023-0080110-4-용을 개인 데이터 서비스에 반영하여 사용자에게 피드백을 제공하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 시스템."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "(a) 사용자 단말로부터 가족력 및 가족관계 데이터를 수신하는 단계; (b) 상기 (a) 단계에서 수신된 데이터 기반의 개인 데이터 서비스를 홈챗봇 기능을 통해 제공하는 단계; 및(c) 사용자의 의도 파악 결과 기설정된 상기 개인 데이터 서비스 외의 댁외 서비스가 요청되는 경우, 외부 레거시 시스템의 서비스를 제공하는 단계를 포함하는 가족 데이터 기반의 개인 데이터 서비스 제공 방법."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 (b) 단계는 관계 정의 데이터를 이용하여 사용자와의 관계를 정의하고, 사용자 캐릭터를 생성하고, 캐릭터기반 관계별 성격을 생성하여, 관계 성격 데이터베이스를 구축하고, 상기 사용자 단말로부터 의문이 제기되는경우, 이를 오류 피드백으로 하여 재저장하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 방법."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 (b) 단계는 상기 사용자 단말로부터 획득한 질의 데이터의 요소별로 상기 개인 데이터 서비스에 해당하는지 여부에 대해 의도 분류를 수행하고, 기설정된 상기 개인 데이터 서비스의 범위에 해당하는 것으로 확인되는경우, 해당 개인 데이터 서비스를 제공하고, 상기 (c) 단계는 상기 기설정된 개인 데이터 서비스의 범위에 해당되지 않는 경우 외부 레거시 시스템을 통해상기 사용자 단말로부터 획득한 질의에 대한 응답을 제공하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 방법."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서, 상기 (b) 단계는 상기 사용자 단말로부터 수신한 데이터를 가공 및 적재하여 개인 데이터를 처리하고, 자연어데이터 기반의 분야별 데이터베이스를 구축하고, 상기 가족력 및 가족관계 서비스에 대해 구축한 데이터베이스를 활용하여 상기 개인 데이터 서비스를 제공하는 것인 가족 데이터 기반의 개인 데이터 서비스 제공 방법."}
{"patent_id": "10-2021-0167543", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 (b) 단계는 가족력 및 가족관계 데이터 기반 개인 데이터 서비스 제공을 위한 안내서를 작성하고, 상기 안내서를 기반으로 자연어 리스트를 포함하는 데이터베이스를 구축하는 것공개특허 10-2023-0080110-5-인 가족 데이터 기반의 개인 데이터 서비스 제공 방법."}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 가족 데이터 기반의 개인 데이터 서비스 제공 시스템 및 그 방법에 관한 것이다. 본 발명에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템은 가족력 데이터 및 가족관계 데이터를 제 공하는 사용자 단말과, 가족 데이터 기반의 개인 데이터 서비스를 홈챗봇 기능을 통해 제공하는 홈챗봇 제공 장 치 및 댁 외의 서비스를 제공하기 위해 홈챗봇 제공 장치와 연결되는 레거시 시스템을 포함한다."}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가족 데이터 기반의 개인 데이터 서비스 제공 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래 기술에 따르면, 핵가족화된 가족 형태에 따라 이혼, 청소년 문제, 노인 문제가 심각해지고 있으며, 주변 친척들과의 왕래나 연락도 줄어들고 있어 가족사에 대한 훼손을 초래하는 문제점이 있다. 이에, 보편화된 정보통신기기를 활용한 가족사 관리 시스템 또는 가족사 챗봇이 필요한 실정이며, 사용자 친화 적이고 자료의 업데이트 및 관리가 용이한 시스템의 도입이 필요하다."}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위해 제안된 것으로, 가족력 및 가족관계 데이터를 처리하고, 처리된 데이 터를 이용하여 개인 데이터 서비스를 제공하는 시스템 및 방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템은 가족력 데이터 및 가족관계 데이터를 제 공하는 사용자 단말과, 가족 데이터 기반의 개인 데이터 서비스를 홈챗봇 기능을 통해 제공하는 홈챗봇 제공 장 치 및 댁 외의 서비스를 제공하기 위해 홈챗봇 제공 장치와 연결되는 레거시 시스템을 포함한다. 상기 홈챗봇 제공 장치는, 상기 사용자 단말과 메시지 및 데이터를 송수신하는 대화형 인터페이스를 제공하는 인터페이스부; 상기 대화형 인터페이스를 통해 사용자와 상호작용하는 패밀리봇부; 수신된 데이터를 이용하여 필요한 대화형 서비스를 판단하고, 지식 자원 관리를 수행하고 상기 댁 외의 서비스를 제공하기 위해 상기 레거 시 시스템과의 연결을 제공하는 홈챗봇관리부; 및 상기 개인 데이터 서비스 제공을 위한 대화형 음성 모델 및 상기 지식 자원을 저장하는 데이터베이스부를 포함한다. 상기 패밀리봇부는 규칙 또는 인공지능을 이용하여 상기 사용자 단말과 상호작용을 수행한다. 상기 패밀리봇부는 대화 내용에서 기정의된 키워드를 인식하여 대화를 이해하고 준비된 응답을 출력한다. 상기 패밀리봇부는 사전 시나리오에 따라 사용자 입력에 대한 응답으로 가족사, 가족력 및 개인 기록물 중 적어 도 어느 하나를 제공한다. 상기 홈챗봇관리부는 상기 수신된 데이터를 참조하여 조건이 충족된 서비스 기능을 제공하기 위한 구성정보를 생성하고, 상기 구성정보를 기록 및 저장하여 상기 지식 자원을 관리한다. 상기 레거시 시스템은 상기 홈챗봇 제공 장치가 파악한 사용자 의도에 상응하는 댁 외의 서비스를 제공하며, 기 관에서 관리하는 사용자 관련 정보를 제공한다. 상기 홈챗봇 제공 장치는 상기 사용자 단말로부터 관계 정의 데이터를 수신하여, 사용자와의 관계를 정의하고 저장하며, 사용자 캐릭터를 생성하여 관계별 성격을 생성하고, 관계 성격 데이터베이스를 구축하며, 상기 사용 자 단말로부터 대화가 요청되면 대화 인터페이스를 제공하고, 성격에 의문이 제기되는 경우 상기 의문을 오류 피드백으로 하여 재저장한다. 상기 홈챗봇 제공 장치는 상기 사용자 단말로부터 수신한 질의 데이터에서 키워드를 획득하고, 상기 질의 데이 터의 요소별로 의도를 분류하며, 분류에 따라 기설정된 서비스 범위에 해당되는 개인 데이터 서비스를제공하고, 기설정된 서비스 범위 외의 댁 외 서비스 요청이 있는 경우 상기 레거시 시스템의 서비스를 제공한다. 상기 홈챗봇 제공 장치는 가족력 및 가족관계 서비스 안내서에 대한 데이터를 획득하고, 획득된 데이터에 대한 수집, 가공 및 적재를 통해 개인 데이터를 처리하며, 자연어 데이터 기반의 분야별 데이터베이스를 구축한다. 상기 홈챗봇 제공 장치는 상기 사용자 단말로부터 수신한 문자 및 음성 정보에 대해 자연어 처리를 통해 키워드 와 연관어를 추출하고, 추출 결과를 이용하여 데이터베이스 검색 및 질의응답을 수행하며, 상기 질의응답의 내 용을 개인 데이터 서비스에 반영하여 사용자에게 피드백을 제공한다. 본 발명에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 방법은 (a) 사용자 단말로부터 가족력 및 가족관 계 데이터를 수신하는 단계와, (b) 상기 (a) 단계에서 수신된 데이터 기반의 개인 데이터 서비스를 홈챗봇 기능 을 통해 제공하는 단계 및 (c) 사용자의 의도 파악 결과 기설정된 개인 데이터 서비스 외의 댁외 서비스가 요청 되는 경우, 외부 레거시 시스템의 서비스를 제공하는 단계를 포함한다. 상기 (b) 단계는 관계 정의 데이터를 이용하여 사용자와의 관계를 정의하고, 사용자 캐릭터를 생성하고, 캐릭터 기반 관계별 성격을 생성하여, 관계 성격 데이터베이스를 구축하고, 상기 사용자 단말로부터 의문이 제기되는 경우, 이를 오류 피드백으로 하여 재저장한다. 상기 (b) 단계는 상기 사용자 단말로부터 획득한 질의 데이터의 요소별로 상기 개인 데이터 서비스에 해당하는 지 여부에 대해 의도 분류를 수행하고, 기설정된 상기 개인 데이터 서비스의 범위에 해당하는 것으로 확인되는 경우, 해당 개인 데이터 서비스를 제공하고, 상기 (c) 단계는 상기 기설정된 개인 데이터 서비스의 범위에 해당 되지 않는 경우 외부 레거시 시스템을 통해 상기 사용자 단말로부터 획득한 질의에 대한 응답을 제공한다. 상기 (b) 단계는 상기 사용자 단말로부터 수신한 데이터를 가공 및 적재하여 개인 데이터를 처리하고, 자연어 데이터 기반의 분야별 데이터베이스를 구축하고, 상기 가족력 및 가족관계 서비스에 대해 구축한 데이터베이스 를 활용하여 상기 개인 데이터 서비스를 제공한다. 상기 (b) 단계는 가족력 및 가족관계 데이터 기반 개인 데이터 서비스 제공을 위한 안내서를 작성하고, 상기 안 내서를 기반으로 자연어 리스트를 포함하는 데이터베이스를 구축한다."}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 정형화된 질의응답 자료 수집을 통해 음성기반 빅데이터를 축적하고, 홈챗봇 장치를 제공하 여, 댁내 개인 데이터 서비스 제공을 위한 소통 채널을 확보하고, 정보 공유의 수단으로 활용 가능한 효과가 있 다. 개인용 기록물의 입력 시, 사용자 안내서 설정을 토대로 개인 기록용 데이터를 생성한 후, 개인 기록물 관리용 홈챗봇 장치를 통해 사용자가 원하는 정보를 제공함으로써, 개인 기록물에 대한 용이한 관리 및 내용 공유가 가 능한 효과가 있다. 핵가족화된 가정환경에 특화된 서비스를 제공하여, 가족 구성원 간의 화합을 유지하고, 상호 유대 관계를 향상 시키는 효과가 있다. 또한, 핵가족화된 가정환경에 특화된 서비스 즉, 가족 구성원 간의 화합을 유지하고 상호 유대 관계를 향상할 수 있는 효과가 있다. 홈챗봇 제공 장치를 통해 개인과 그 집안의 역사 정보에 대해 검색하고, 활동 기록을 확인하며, 개인의 사후 기 록을 간편하게 파악할 수 있다."}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 전술한 목적 및 그 이외의 목적과 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2021-0167543", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "으며, 단지 이하의 실시예들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 목적, 구성 및 효과를 용이하게 알려주기 위해 제공되는 것일 뿐으로서, 본 발명의 권리범위는 청구항의 기재에 의해 정의 된다. 한편, 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한 다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성소자, 단계, 동작 및/또는 소자가 하나 이상의 다른 구성소자, 단계, 동작 및/또는 소자의 존재 또는 추가됨을 배제하지 않는다. 이하에서는, 당업자의 이해를 돕기 위하여 본 발명이 제안된 배경에 대하여 먼저 서술하고, 본 발명의 실시예에 대하여 서술하기로 한다. 인공지능 기술의 발전에 따라서 음성과 같은 자연어 대화방식으로 기계를 조작하고, 원하는 서비스를 얻을 수 있도록 하는 대화형 인공지능 시스템의 활용이 늘어나고 있다. 이에, 온라인 상담 센터나 쇼핑몰 등의 분야에서 사용자는 대화형 인공지능 시스템을 통하여 원하는 서비스를 제공받을 수 있다. 대화형 인공지능 시스템은 사용 자 입력에 따른 의도를 이해하고 그에 부합하는 적절한 대화를 진행하기 위하여 다양한 지식베이스 모델을 활용 한다. 최근 고정 시나리오 기반의 문답 대화 서비스만을 제공하던 대화형 인공지능 시스템을 넘어서, 자유 발화 형태 의 음성을 입력으로 더 복잡한 도메인의 서비스를 제공받고자 하는 요구가 늘어나고 있다. 이에, 대화형 인공지 능 시스템은 다양한 지식베이스 모델의 구축 및 갱신을 위하여 지속적인 학습이 필요하며, 학습 데이터로는 실 제 사람들 간의 대화 로그들, 예컨대 실제 사람들 간의 대화를 녹취한 녹취록(상담 센터의 고객과 상담원 간의 대화 녹취록) 내의 대화 로그들 등이 대표적으로 활용된다. 실제 사람들 간의 대화 녹취록에는 다양한 엔티티 정보들(이름, 주민등록번호, 사용자 ID, 전화번호, 이메일, 주소 등을 비롯한 각종 개인정보 등)이 포함될 수 있는데, 이러한 정보는 개인정보보호법을 비롯한 각종 다른 법규 등에 따라 비식별화가 요구될 수 있다. 따라서, 녹취록을 이용하여 대화형 인공지능 시스템을 학습시키기 이전에, 녹취록에 나타나는 정보 중 비식별화가 필요한 정보를 삭제하거나, 비식별화 처리를 수행할 필요가 있 다(다만, 대화형 인공지능 시스템을 위한 학습의 목적에 따라서 비식별화 처리하여야 할 필요가 있다). 정보통신 기술 발전에 힘입어 전자장치들의 보급 및 이용이 급속도로 증가하고 있으며, 스마트폰의 경우에는 음 성통화나 문자메시지 서비스 이외에 사진 촬영, 영상통화, 멀티미디어 데이터통신, 이동방송 수신 등 다양한 기 능들이 새롭게 부가되어 그 활용도가 증가하였다. 이러한 다양한 활용 중 자신의 개인 기록물을 작성하기 위하 여 사용자는 다양한 애플리케이션을 실행시킨 후, 자신이 기록하고자 하는 내용을 직접 입력하는데, 다양한 개인 기록물에 대한 관리가 필요하다. 최근의 가족 형태는 부부와 자녀로 구성되는 핵가족이 대부분이고, 사회적인 현상으로 이혼이 증가하고, 청소년, 노인 문제 등이 심각해지고 있다. 또한, 가족 구성원이 직장이나 학교 등에 오랫동안 나가 있어서 가족 구성원 간의 친밀한 애정 관계를 맺을 기회가 적다. 주변 친척들과의 왕래나 연락도 줄어들기 때문에 부부간의 문제가 발생 시 가족사에 대한 심각한 훼손을 초래한다. 이에 부부와 그 자녀를 중심으로 한 가족의 화합을 유 도하고, 주변 친척들과의 원만한 인간관계를 정립할 수 있는 시스템의 도입이 시급한 실정이다. 이러한 문제를 해결하기 위한 수단으로서, 가족사 관리 시스템 또는 가족사 챗봇 등을 제안할 수 있는데, 사용자 친화적이고 자료의 업데이트가 쉬운 시스템이 필요하다. 또한, 개인 및 집안의 역사와 같이 개인의 활동을 체계적으로 분류하여, 개인과 그 집안의 역사 정보에 대한 용 이한 검색을 지원하고, 개인의 활동 기록을 쉽게 확인할 수 있으며, 개인의 사후에 기록을 간편하게 파악할 수 있는 기록물(개인 및 집안의 역사, 활동 기록 등) 관리 시스템이 필요하다. 개인 및 집안의 자료라는 점에서, 개인화된 맞춤형 학습된 데이터베이스 구축과 함께 효율성 및 신뢰성을 확보하여야 한다. 한편, 금융, 의료보건 등 개인정보의 사회경제적 가치가 높아지는 분야가 많아지면서, 개인정보의 체계적인 수 집 및 활용에 관한 관심이 커지고 있으며, 개인의 관심사 변화와 급속한 사회 발전 등으로 정보 제공 서비스의 개인화가 필요하다. 본 발명은 전술한 배경에 따라 제안된 것으로, 가족력 및 가족관계 데이터를 포함하는 가족 데이터(유서, 일기 등의 개인 기록물, 개인 및 집안의 역사, 개인의 활동에 관련한 정보를 포함)를 처리하고, 처리된 데이터를 이 용하여 개인 데이터 서비스를 제공하는 시스템 및 방법을 제안한다. 본 발명의 실시예에 따르면, 핵가족화된 가정 환경에 특화된 서비스를 제공하며, 혈연 공동체인 가족의 챗봇을 운영하여 다양한 가족사에 대한 정보를 관리하고 공유하여 상호 유대 관계를 도모한다. 개인 및 집안의 역사는 물론, 개인의 활동이 수집·저장되고, 개인 및 집안의 역사가 시스템을 통해 체계적으로 분류되어 개인과 그 집 안의 역사 정보에 대한 용이한 검색이 가능하고, 개인의 활동 기록에 대해 음성 대화를 통한 확인이 가능하며, 개인의 사후 기록을 손쉽고 간편하게 파악하는 것이 가능하다. 본 발명의 실시예에 따른 개인 데이터 서비스는 대화로 유전 질환 등을 포함한 가족력과 가족관계 정보를 제공 한다. 가족관계 정보는 가계도(부부/자녀/부모/형제, 사망/생존 나이, 질병력, 현재 동거)에 따른 족보 운영) 및 생태도(친척, 직장, 의료, 교육, 은행, 종교) 등을 포함한다. 본 발명의 실시예에 따르면, 개인 데이터 서비스 제공 시스템을 위한 지식베이스 모델의 자동 구축 및 갱신을 수행하고, 모델을 기반으로 한 개인기록 데이터의 관리를 수행한다. 본 발명의 실시예에 따르면, 다양한 형태의 개인용 기록물에 대한 입력 및 관리 기능을 제공한다. 상담 및 대응 이 가능한 홈챗봇을 제공하여 개인 데이터 서비스를 제공하고, 사용자의 음성을 인식하여 키워드 및 연관어를 추출하고, 패턴에 따른 음성 안내를 실행하며, 개인정보를 제공한다. 본 발명의 실시예에 따르면, 온라인 홈챗봇 제공 장치를 운영하여 긴밀한 상호유대 관계를 형성할 수 있는 온라 인 가족사 관리 시스템을 제공함으로써, 가족 구성원 간의 화합을 유지 발전시키며, 핵가족으로 인한 이혼 증가, 청소년 문제, 친척 간의 소통 부재 등의 문제점을 해결한다. 또한, 개인 및 집안의 역사를 데이터베이스 를 통해 체계적으로 분류함으로써, 개인과 그 집안의 역사 정보에 대한 용이한 검색이 가능하도록 하고, 개인의 활동 기록을 확인할 수 있도록 하며, 음성 인식을 수단으로 확인 가능하도록 한다. 또한, 사용자의 가족사에 관 련된 타 학습 요소(질병 지식, 의료지식, 건강 지식, 교육지식 등)에 대한 지식맵을 미리 구축하고, 사용자와의 대화를 통하여 그 지식을 전달한다. 도 1은 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템을 도시한다. 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템은 사용자 단말, 홈챗봇 제 공 장치, 레거시 시스템을 포함한다. 이는 본 발명의 목적을 달성하기 위한 바람직한 실시예일 뿐이 며, 필요에 따라 일부 구성 요소가 추가되거나 삭제될 수 있고, 적어도 하나의 구성 요소가 실제 물리적 환경에 서는 서로 통합되는 형태로 구현될 수도 있다. 사용자 단말은 개인 데이터 서비스를 사용하기 위해 사용자에 의해 이용되는 단말로, 컴퓨팅 기능과 통신 기능이 갖춰진 노트북, 랩톱 및 스마트폰 등이 이용될 수 있다. 사용자는 사용자 단말에 탑재된 앱(app)또는 웹(web), 통신 인터페이스에 기반하여 홈챗봇 제공 장치가 제공하는 개인 데이터 서비스를 사용한다. 홈챗봇 제공 장치는 홈챗봇 기능을 제공하는 컴퓨팅 장치이다. 컴퓨팅 장치는 노트북, 데스크톱, 랩톱, AI 스피커, AI 셋탑 및 스마트폰 등이 될 수 있으나, 이에 국한되는 것은 아니며, 컴퓨팅 기능 및 통신 기능이 갖 춰진 임의의 컴퓨팅 장치로 구현될 수 있다. 다수의 사용자에게 원활한 홈챗봇 기능을 제공하기 위해, 홈챗봇 제공 장치는 고성능의 컴퓨팅 장치로 구현되는 것이 바람직하다. 레거시 시스템은 홈챗봇 제공 장치가 사용자 의도를 파악하여 그에 상응하는 댁 외의 서비스를 제공 할 수 있도록 연결하는 대상 시스템이다. 레거시 시스템이 댁 외의 서비스로 제공하는 데이터는 금융기관 과 공공기관 등이 관리하는 본인 관련 정보나 서비스 요청자의 고객 데이터 맞춤형의 개인화된 서비스의 정보가 대상이 된다. 도 2는 본 발명의 실시예에 따른 홈챗봇 제공 장치의 구성을 도시한다. 본 발명의 실시예에 따른 홈챗봇 제공 장치는 인터페이스부, 패밀리봇부, 홈챗봇관리부 및 데이 터베이스부를 포함한다. 인터페이스부는 네트워크를 통하여 실시간으로 사용자 단말과 메시지 및 데이터를 주고받는 대화형 인터페이스이다. 고유의 유무선 통신기술 및 인터넷 등의 일반적인 네트워크 환경을 지원한다. 인터페이스부 를 통해 입력된 개인용 데이터와 관련하여서는 정보 및 일자와 같은 설정이 가능하다. 패밀리봇부는 인터페이스부 상에서 규칙이나 인공지능으로 사용자 단말과 상호작용하는 봇(bo t)이다. 대화 내용 중에 미리 정의된 키워드를 인식하여 대화를 이해하고 그에 맞는 준비된 응답을 출력하는 검 색 방식, 또는 사전 시나리오에 따라서 사용자 입력에 대한 동작과 응답을 출력하는 시나리오 방식을 통해, 가 족사, 가족력 및 개인 기록물 등을 제공한다. 지정된 지식베이스 모델 내에서 단어 또는 짧은 구의 존재를 인식 하여 키워드 인식을 수행하고, 사용자 발화 의도를 이해하기 위하여 대화를 이루는 문장을 컴퓨터가 이해하도록 정보에 대한 가공 처리를 수행하여 대화 이해를 수행한다. 도 3은 본 발명의 실시예에 따른 가족사(족보) 열람에 대한 시나리오 대화의 예시이고, 도 4는 본 발명의 실시 예에 따른 가족사(족보) 열람에 대한 시나리오 결정 트리의 예시이다. 홈챗봇관리부는 인터페이스부를 통해 수신한 데이터를 참조하여 필요한 개인 데이터 서비스를 판단한 다. 또한, 필요하다고 판단되면 수신한 데이터를 참조로 하여 조건을 충족하는지 판단하고, 조건이 충족된 서비 스 기능을 제공하기 위하여 구성정보를 생성하고, 구성정보를 기록 및 저장하여 지식자원을 관리한다. 홈챗봇관 리부는 사용자가 요청한 개인 데이터 서비스를 제공하기 위하여 레거시 시스템과 연결하는 인터페이 스 기능을 수행한다. 데이터베이스부는 사용자가 요청한 개인 데이터 서비스를 제공하기 위한 대화형 음성 모델 및 홈챗봇관리 부에서 관리하는 지식자원을 저장한다. 도 5는 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템의 데이터 송수신 과정을 도시한다. 사용자 단말은 가족력 및 가족관계 데이터를 제공하고(S501), 홈챗봇 제공 장치는 이를 수신하여 저장한다 (S502). 홈챗봇 제공 장치는 사용자 단말로부터 사용자와 관계를 정의하는 관계 정의 데이터를 수신하여 (S503), 사용자와 관계를 정의하고 저장한다(S504). 홈챗봇 제공 장치는 사용자 캐릭터를 생성하고(S505), 캐릭터를 기반으로 관계별 성격을 생성하고(S506), 관계 성격 데이터베이스를 구축한다(S507). 사용자 단말에서 대화를 요청하면 홈챗봇 제공 장치는 대화 인터페이스를 제공하고(S508), 사용자 단 말로부터 성격에 의문을 제기하는 단어 또는 문장이 입력되는 경우(S509), 홈챗봇 제공 장치는 성격 의문을 오류 피드백으로 하여 재저장한다(S510). 전술한 단계들의 순서는 예시적인 것으로 이에 한정되지 않고, 각 단계의 순서는 상호 변동 가능하며, 이 중 일부 단계들은 동시에 실행되거나 삭제될 수 있다. 도 6은 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템의 동작 과정을 도시한다. 홈챗봇 제공 장치는 사용자 단말로부터 질의가 발생되면(S610), 질의에 관한 데이터를 획득한다 (S620). 이어서, S630 단계는 획득된 데이터의 요소별로 개인 데이터 서비스에 해당하는지를 여부에 대한 의도 분류를 수행한다. S630 단계에서 기설정된 개인 데이터 서비스 범위에 해당하는 것으로 확인되면, S640 단계는 해당 개인 데이터 서비스를 제공한다. S630 단계에서 외부의 레거시 시스템이 제공하는 서비스를 원하는 것으로 확인되면, S650 단계는 레거시 시스템 서비스를 제공한다. S660 단계는 개인 데이터 서비스 또는 레거시 시스템 서비스를 통해 질의에 대한 응답을 제공한다. 도 7는 본 발명의 일 실시 예에 따른 가족력 및 가족관계 서비스에 대한 데이터베이스 구축을 도시한다. 데이터베이스 구축을 위해, S710 단계는 가족력 및 가족관계 서비스 안내서에 대한 데이터를 획득한다. S720 단계는 획득된 자료를 수집, 가공 및 적재하여 개인 데이터를 처리한다. S730 단계는 가족력 및 가족관계 서비스에 대한 대화형 홈챗봇을 생성하기 위해, 자연어 데이터 기반의 분야별 데이터베이스를 구축하고, 빠른 반응속도와 데이터의 지속적인 업데이트를 위해, 분야별 데이터베이스를 구축한 다. S730 단계는 유전 질환, 가계도, 가족사, 생태도, 기록물, 기타 등 분야별 데이터베이스를 구축한다. 본 발명의 실시예에 따르면, 자연어처리 기술이 반영된 질의응답 방식의 대화형 홈챗봇을 생성하기 위해, 입력 된 문자/음성 정보에서 키워드 및 연관어를 추출하고, 추출된 내용을 비교하여 데이터베이스 검색 및 질의응답 을 수행하며, 질의응답 내용을 개인 데이터 서비스에 반영하여 사용자에게 문자/음성으로 피드백을 제공한다. 대화형 개인 데이터 서비스에서, 텍스트 분석, 음성인식, 음성합성, 질의응답 및 대화처리를 위한 시나리오 및 데이터베이스 구축과 함께 학습시킴으로써 오류를 최소화한다. 본 발명의 실시예에 따른 대화형 홈챗봇 기술의 각 내용은 도 8에 도시한 바와 같다. 본 발명의 실시예에 따른 홈챗봇 제공 장치는 가족력 및 가족관계 서비스에 최적화된 개인 데이터 서비스 제공을 위해, 가족력 및 가족관계 서비스 안내서를 제작한다. 도 9는 본 발명의 실시예에 따른 가족력 및 가족 관계 서비스 안내서의 예시에 관한 것으로, 가족력에 2개 분야(유전 질환, 기타) 및 가족관계 2개 분야(가계도, 생태도)에 대한 안내서를 제작한다. 도 10은 본 발명의 실시예에 따른 가족력 및 가족관계 데이터 기반 개인 데이터 서비스 제공 방법을 도시한다. 본 발명의 실시예에 따른 홈챗봇 제공 장치는 가족력 및 가족관계 데이터 기반 개인 데이터 서비스 제공을 위한 서비스 안내서를 작성한다(S1010). S1020 단계는 S1010 단계에서 제작된 개인 데이터 서비스 안내서를 기반으로, 개인 데이터 서비스 전용 자연어 리스트를 포함하는 데이터베이스를 구축한다. S1030 단계는 S1020 단계에서 구축된 데이터베이스를 기반으로 대화 가능한 음성인식 홈챗봇을 생성하고, S1040 단계는 홈챗봇을 이용하여 사용자 단말로부터 수신한 질의에 대한 응답을 출력한다. 전술한 단계들의 순서는 예시적인 것으로 이에 한정되지 않고, 각 단계의 순서는 상호 변동 가능하며, 이 중 일 부 단계들은 동시에 실행되거나 삭제될 수 있다. 한편, 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 방법은 컴퓨터 시스템에서 구현되 거나, 또는 기록매체에 기록될 수 있다. 컴퓨터 시스템은 적어도 하나 이상의 프로세서와, 메모리와, 사용자 입 력 장치와, 데이터 통신 버스와, 사용자 출력 장치와, 저장소를 포함할 수 있다. 전술한 각각의 구성 요소는 데 이터 통신 버스를 통해 데이터 통신을 한다. 컴퓨터 시스템은 네트워크에 커플링된 네트워크 인터페이스를 더 포함할 수 있다. 프로세서는 중앙처리 장치 (central processing unit (CPU))이거나, 혹은 메모리 및/또는 저장소에 저장된 명령어를 처리하는 반도체 장치 일 수 있다. 메모리 및 저장소는 다양한 형태의 휘발성 혹은 비휘발성 저장매체를 포함할 수 있다. 예컨대, 메모리는 ROM 및 RAM을 포함할 수 있다. 따라서, 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 방법은 컴퓨터에서 실행 가능한 방법으로 구현될 수 있다. 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 방법이 컴퓨 터 장치에서 수행될 때, 컴퓨터로 판독 가능한 명령어들이 본 발명에 따른 가족 데이터 기반의 개인 데이터 서 비스 제공 방법을 수행할 수 있다. 한편, 상술한 본 발명에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 방법은 컴퓨터로 읽을 수 있는 기록 매체에 컴퓨터가 읽을 수 있는 코드로서 구현되는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록 매체로는 컴퓨터 시스템에 의하여 해독될 수 있는 데이터가 저장된 모든 종류의 기록 매체를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플래시 메모리, 광 데이터 저장장치 등 이 있을 수 있다. 또한, 컴퓨터로 판독 가능한 기록매체는 컴퓨터 통신망으로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 읽을 수 있는 코드로서 저장되고 실행될 수 있다. 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 방법은 (a) 사용자 단말로부터 가족력 및 가족관계 데이터를 수신하는 단계와, (b) 상기 (a) 단계에서 수신된 데이터 기반의 개인 데이터 서비스를 홈 챗봇 기능을 통해 제공하는 단계 및 (c) 사용자의 의도 파악 결과 기설정된 개인 데이터 서비스 외의 댁외 서비 스가 요청되는 경우, 외부 레거시 시스템의 서비스를 제공하는 단계를 포함한다. (b) 단계는 관계 정의 데이터를 이용하여 사용자와의 관계를 정의하고, 사용자 캐릭터를 생성하고, 캐릭터 기반 관계별 성격을 생성하여, 관계 성격 데이터베이스를 구축하고, 상기 사용자 단말로부터 의문이 제기되는 경우, 이를 오류 피드백으로 하여 재저장한다. (b) 단계는 상기 사용자 단말로부터 획득한 질의 데이터의 요소별로 상기 개인 데이터 서비스에 해당하는지 여 부에 대해 의도 분류를 수행하고, 기설정된 상기 개인 데이터 서비스의 범위에 해당하는 것으로 확인되는 경우, 해당 개인 데이터 서비스를 제공하고, (c) 단계는 상기 기설정된 개인 데이터 서비스의 범위에 해당되지 않는 경우 외부 레거시 시스템을 통해 상기 사용자 단말로부터 획득한 질의에 대한 응답을 제공한다. (b) 단계는 상기 사용자 단말로부터 수신한 데이터를 가공 및 적재하여 개인 데이터를 처리하고, 자연어 데이터 기반의 분야별 데이터베이스를 구축하고, 상기 가족력 및 가족관계 서비스에 대해 구축한 데이터베이스를 활용 하여 상기 개인 데이터 서비스를 제공한다. (b) 단계는 가족력 및 가족관계 데이터 기반 개인 데이터 서비스 제공을 위한 안내서를 작성하고, 상기 안내서 를 기반으로 자연어 리스트를 포함하는 데이터베이스를 구축한다."}
{"patent_id": "10-2021-0167543", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템을 도시한다. 도 2는 본 발명의 실시예에 따른 홈챗봇 제공 장치의 구성을 도시한다. 도 3은 본 발명의 실시예에 따른 가족사(족보) 열람에 대한 시나리오 대화의 예를 도시한다. 도 4는 본 발명의 실시예에 따른 가족사(족보) 열람에 대한 시나리오 결정 트리의 예를 도시한다. 도 5는 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템의 데이터 송수신 과정을 도시한다. 도 6은 본 발명의 실시예에 따른 가족 데이터 기반의 개인 데이터 서비스 제공 시스템의 동작 과정을 도시한다. 도 7는 본 발명의 일 실시 예에 따른 가족력 및 가족관계 서비스에 대한 데이터베이스 구축을 도시한다. 도 8은 본 발명의 실시예에 따른 대화형 홈챗봇 기술을 도시한다. 도 9는 본 발명의 실시예에 따른 가족력 및 가족관계 서비스 안내서의 예를 도시한다. 도 10은 본 발명의 실시예에 따른 가족력 및 가족관계 데이터 기반 개인 데이터 서비스 제공 방법을 도시한다."}
