{"patent_id": "10-2023-0049372", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0161342", "출원번호": "10-2023-0049372", "발명의 명칭": "지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 방법 및", "출원인": "(주)인티그리트", "발명자": "이대윤"}}
{"patent_id": "10-2023-0049372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율주행과정에서 시각화 센서로 획득한 실내공간 내에 위치한 목적물의 위치정보를 전송하는 자율주행로봇 또는 모빌리티; 및상기 실내공간의 전체적인 지형 및 사물정보가 맵핑된 자율주행하는 로봇의 사물정보가 포함된 가상화된 맵을사전에 미리 생성하고, 상기 가상공간 내에 상기 자율주행로봇 또는 모빌리티와 목적물 위치정보를 표시하고,상기 가상공간 내에서 상기 자율주행로봇 또는 모빌리티가 상기 목적물까지 이동하기 위한 주행명령어가 반영된메타지도를 생성한 후, 상기 메타지도 내의 가상공간 좌표체계를 현실좌표 체계로 변환하여 상기 자율주행로봇또는 모빌리티로 제공하는 클라우드 서버를 포함하고,상기 자율주행로봇 또는 모빌리티는상기 메타지도 내의 가상공간 좌표체계를 현실좌표 체계로 변환한 정보를 기초로 실내공간 내의 목적물까지 이동하는 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 시스템."}
{"patent_id": "10-2023-0049372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 클라우드 서버는상기 자율주행로봇 또는 모빌리티이 자율주행과정에서 측정한 사람 및/또는 사물의 위치정보, 특성정보, 상기자율주행로봇 또는 모빌리티가 주행하는 실내공간의 현실좌표 정보를 외부서버로부터 수집하는 정보수집부;상기 실내공간의 실내좌표를 기반으로 디지털트윈 기법을 이용하여 3차원 가상공간으로 모델링하는 가상공간 모델링부;가상공간 내에 위치하는 에이전트인 자율주행로봇 또는 모빌리티의 아바타가 목적물까지의 이동하기 위한 주행명령어를 제공하는 주행정보 에이전트부;상기 가상공간 내의 목적물까지 자율주행로봇 또는 모빌리티의 아바타가 이동하기 위한 주행 명령어를 포함하는메타지도를 생성하는 메타지도 생성부를 포함하는 것을 특징으로 하는 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 시스템."}
{"patent_id": "10-2023-0049372", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 메타지도 생성부는상기 가상공간 모델링부에서 생성한 디지털 트윈 공간인 가상공간의 공간좌표와 현실세계의 공간좌표를 맵핑한맵핑 지도를 생성하는 맵핑부;상기 맵핑 지도 내에 현실세계의 자율주행로봇 또는 모빌리티의 위치정보와 가상공간 내의 자율주행로봇 또는모빌리티의 아바타의 위치를 동기화시키는 동기화부;상기 맵핑지도 내에 외부단말에서 지정한 위치로 목표물을 지정 또는 생성하는 목표물 지정부;상기 맵핑지도 내에 자율주행로봇 또는 모빌리티의 위치로부터 상기 목표물까지의 이동경로를 산출하여 제공하는 이동경로 생성부; 및상기 이동경로 생성부에서 생성된 이동경로 및 상기 이동경로 내에 상기 주행정보 에이전트에서 제공하는 주행공개특허 10-2023-0161342-3-명령어가 반영된 메타지도를 생성하여 현실세계의 자율주행로봇 또는 모빌리티로 전송하는 상기 메타지도 제공및 갱신부를 포함하고,상기 메타지도 제공 및 갱신부는 메타지도에 표시된 이동경로를 따라 이동중에 감지되는 장애물(이동객체)을 감지한 감지정보를 실시간으로 반영하여 목표물까지의 이동경로를 재산출한 메타지도로 기존 메타지도를 갱신하여제공하는 것을 특징으로 하는 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 시스템."}
{"patent_id": "10-2023-0049372", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 시스템은 자율주행과정에서 시각화 센서로 획득한 실내공간 내에 위치한 목적물의 위치정보를 전송하는 자율주행 로봇 또는 모빌리티; 및 상기 실내공간의 전체적인 지형 및 사물정보가 맵핑된 자율주행하는 로봇의 사물정보가 (뒷면에 계속)"}
{"patent_id": "10-2023-0049372", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-0049372", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "3차원 GIS(Geographic Information System)의 기본 기술인 3차원 공간정보 기술은 2차원 위치정보에 높이(심도), 영상, 속성 등을 추가하여 현실세계와 유사하게 표현한 정보기술을 의미한다. 이러한, 3차원 공간정보 기술의 핵심은 3차원의 전자지도를 생성하여 그 내부에 관련되는 제반 정보를 포함시켜, u-City, 텔레매틱스, LBS(Location Based Service), 도시계획개발, 재난방재, 교통 제어 및 환경 등 공공 분야 및 관련 산업의 기반을 마련하는 것이라 할 수 있다. 또한, 최근에는 특정 장소로 이동하고자 할 때 차량용 내비게이션, 휴대단말 등을 통한 지도 서비스를 이용하는 것이 매우 일반적이다. 이러한 지도 서비스는 건물이나 도로 등을 2차원 평면 형태로 제공하는 2차원(2D) 지도 서비스가 보편적이었으나, 최근에는 3차원(3D) 지도 서비스까지 출현하고 있다. 이러한 3차원 지도 서비스는 실 세계를 동일하게 투영함에 따라 그 활용 가능성이 점점 더 증가하고 있으며, 특히 어디서나 접근 가능한 웹 기 반의 3차원 지도 서비스는 현재 많은 국가와 기업에서 이미 제공되고 있다. 이에 본 발명은 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 방법 및 시 스템을 개시하고자 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-2242834호"}
{"patent_id": "10-2023-0049372", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 종래의 문제점을 해결할 수 있는 지능형 실내 자율주행 로봇이 취득한 공간 데이터를 이용한 가상화된 메타지도 제작 방법 및 시스템을 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2023-0049372", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이 용한 가상화된 메타지도 제작 시스템은 자율주행과정에서 시각화 센서로 획득한 실내공간 내에 위치한 목적물의 위치정보를 전송하는 자율주행로봇 또는 모빌리티; 및 상기 실내공간의 전체적인 지형 및 사물정보가 맵핑된 자율주행하는 로봇의 사물정보가 포함된 가상화된 맵을 사전에 미리 생성하고, 상기 가상공간 내에 상기 자율주행 로봇 또는 모빌리티와 목적물 위치정보를 표시하고, 상기 가상공간 내에서 상기 자율주행로봇 또는 모빌리티가 상기 목적물까지 이동하기 위한 주행명령어가 반영된 메타지도를 생성한 후, 상기 메타지도 내의 가상공간 좌표 체계를 현실좌표 체계로 변환하여 상기 자율주행로봇 또는 모빌리티로 제공하는 클라우드 서버를 포함하고, 상 기 자율주행로봇 또는 모빌리티는 상기 메타지도 내의 가상공간 좌표체계를 현실좌표 체계로 변환한 정보를 기 초로 실내공간 내의 목적물까지 이동하는 것을 특징으로 한다. 일 실시예에서, 상기 클라우드 서버는 상기 자율주행로봇 또는 모빌리티이 자율주행과정에서 측정한 사람 및/또 는 사물의 위치정보, 특성정보, 상기 자율주행로봇 또는 모빌리티가 주행하는 실내공간의 현실좌표 정보를 외부 서버로부터 수집하는 정보수집부; 상기 실내공간의 실내좌표를 기반으로 디지털트윈 기법을 이용하여 3차원 가 상공간으로 모델링하는 가상공간 모델링부; 가상공간 내에 위치하는 에이전트인 자율주행로봇 또는 모빌리티의 아바타가 목적물까지의 이동하기 위한 주행명령어를 제공하는 주행정보 에이전트부; 상기 가상공간 내의 목적물 까지 자율주행로봇 또는 모빌리티의 아바타가 이동하기 위한 주행 명령어를 포함하는 메타지도를 생성하는 메타 지도 생성부를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 메타지도 생성부는 상기 가상공간 모델링부에서 생성한 디지털 트윈 공간인 가상공간의 공 간좌표와 현실세계의 공간좌표를 맵핑한 맵핑 지도를 생성하는 맵핑부; 상기 맵핑 지도 내에 현실세계의 자율주 행로봇 또는 모빌리티의 위치정보와 가상공간 내의 자율주행로봇 또는 모빌리티의 아바타의 위치를 동기화시키 는 동기화부; 상기 맵핑지도 내에 외부단말에서 지정한 위치로 목표물을 지정 또는 생성하는 목표물 지정부; 상 기 맵핑지도 내에 자율주행로봇 또는 모빌리티의 위치로부터 상기 목표물까지의 이동경로를 산출하여 제공하는 이동경로 생성부; 및 상기 이동경로 생성부에서 생성된 이동경로 및 상기 이동경로 내에 상기 주행정보 에이전 트에서 제공하는 주행명령어가 반영된 메타지도를 생성하여 현실세계의 자율주행로봇 또는 모빌리티로 전송하는 상기 메타지도 제공 및 갱신부를 포함하고, 상기 메타지도 제공 및 갱신부는 메타지도에 표시된 이동경로를 따 라 이동중에 감지되는 장애물(이동객체)을 감지한 감지정보를 실시간으로 반영하여 목표물까지의 이동경로를 재 산출한 메타지도로 기존 메타지도를 갱신하여 제공하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0049372", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 시스템 및 방법을 이용하면, 가상공간 내의 디지털 오브젝트의 조작명령에 따른 움직임을 현실세계에서 투영시 켜 자율주행로봇 또는 모빌리티를 원격제어할 수 있다는 이점이 있다. 또한, 자율주행로봇 또는 모빌리티로부터 취득한 이벤트를 가상공간에 투영시킬 수 있고, 이를 반영한 메타지도 를 제작할 수 있다는 이점이 있다."}
{"patent_id": "10-2023-0049372", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그 리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하 여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드 의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어 레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~ 부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기술 된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하, 첨부된 도면들에 기초하여 본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터 를 이용한 가상화된 메타지도 제작 시스템 및 방법을 보다 상세하게 설명하도록 한다. 먼저, 본 발명을 설명하기에 앞서, 본원에서 언급하는 디지털 트윈과 메타버스 간의 차이점을 간략하게 설명하 도록 한다. 디지털 트윈과 메타버스는 가상세계를 통해 구현된 다는 큰 틀은 비슷하지만 현실세계를 어떻게 바라보느냐가 다르다. 디지털 트윈의 경우 도시, 기계, 공장 등 현실세계의 객체를 가상세계에 구현하고 이를 바탕으로 현실 세계와 동일하게 작동하는 기술이다. 가상세계에 현실을 쌍둥이처럼 구현해서 디지털 트윈이라는 불린다. 간단한 예로 스크린 골프에서 채를 휘둘러 공을 치는 행위는 현실에서 벌어지지만, 공이 날아가고 점수를 얻는 행위는 모두 가상에서 이루어진다. 초기 단계의 디지털 트윈의 경우는 단순히 현실을 가상세계에 모방하는 것에 그쳤지만, 최근에 사물 인터넷, 컴 퓨팅, 인공지능 기술 등의 발달로 현실적인 제약으로 시뮬레이션 하지 못하는 다양한 시나리오들을 가상에서 대 신 구현할 수 있게 되었다. 단순한 결과 예측이 아닌 각종 센서와 실 데이터 등을 바탕으로 현실에 가깝게 예측하고 실시간으로 문제에 대 응할 수 있게 되었다. 실제 GE(General Electronics)에서 활용하는 프레딕스는 스마트 팩토리의 지원을 위해서 GE의 설비 와 소프트웨 어를 산업용 인터넷에 통합하기 위한 클라 우드 플랫폼이다. 이를 활용해서 현실에서의 다양한 기계와 설비들을 프레딕스를 통해 안전하게 데이터를 수 집하고 분석한다. 결과를 바탕으로 현실에서 설비들을 더욱 효율적으로 운용하는 디지털 트윈 플랫폼이다 도 1a는 현실에서 모델 데이터와 센서로 수집한 데이터를 토대로 현실 객체를 디지털 모델로 생성하고 데이터 분석과 예측, 상황 인식을 시각화를 통해 다시 현실에서 구현하는 디지털 트윈의 구조를 나타낸 것이다. 메타버스의 경우 초월을 뜻하는 메타와 현실세계를 뜻하는 유니버스를 합성한 용어이다. 메타버스는 본인을 투 영한 아바타로 다양한 가상세계를 경험하지만 디지털 트윈과는 다르게 가상세계가 현실세계를 구현한 것을 의미 하진 않는다. 메타버스는 초기의 3D 가상세 계에서 벗어나 현실과의 교차를 통하여 가상과 현실세계 사이의 상 호작용을 통해 다양한 경험과 가치를 생산하고 공유하는 것에 있다. 네이버 제트가 운영하는 메타 버스 플랫폼 제페토(Zepeto)는 얼굴인식과 증강현실을 기반으로 아바타와 가상세 계를 구현하는 플랫폼이다. 가상세계인 맵과 맵을 구성하는 빌드잇과 아바타의 의 상을 만드는 제페토 스튜디오를 토대로 운영된다. 사용 자는 아바타를 통해 다양한 가상공간에서 다른 아바타 와 직접적으로 소통을 할 수 있다. 이외에도 방탄소년 단 의 경우 신곡을 게임 포트나이트 안에서 콘서트처럼 발표하기도 했다. 마이크소프트의 원격 협업 플랫폼인 메쉬는 서로 다른 지역 사용자들이 아바타를 통해 같은 공간에서 일하는 것 처럼 느낄 수 있게 하는 혼합현실 (Mixed Reality, MR)을 기반으로 하는 메타버스 플랫 폼이다. 이처럼 메타버스는 게임, 산업, 모임이나 쇼핑 같은 일상의 영역까지 확대되고 있다. 앞으로 현실의 더욱더 많 은 영역과 활동들이 가상과 융합되는 현상이 가 속화될 것이다. 도 1b는 메타버스의 증강현실, 물리적 세계에 추가 정보를 더해서 구현한 거울세계, 인간이 경험하는 감정, 움직임, 신체 등과 같은 정보를 가상에서 재현하 는 라이프 로깅, 가상세계로 대표되는 4가지 요소들과 XR(Extended Reality), 데이터 기술 등의 메타버스 범용 기술로 현실과 가상을 연결해주는 메타버 스의 개념을 나타낸 도이다. 도 2는 본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지 도 제작 시스템의 네트워크 구성도이고, 도 3는 도 2에 도시된 자율주행로봇 또는 모빌리티의 세부 구성도이고, 도 4는 도 2에 도시된 클라우드 서버의 세부 구성도이고, 도 5는 도 4에 도시된 메타지도 생성부의 세부 구성도 이고, 도 6은 도 2에 도시된 클라우드 서버에서 지원하는 현실좌표로 변환되는 메타지도 및 현실좌표를 가상공 간 좌표로 변환과정을 나타낸 예시도이다. 먼저, 도 2에 도시된 바와 같이, 본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터 를 이용한 가상화된 메타지도 제작 시스템은 자율주행로봇 또는 모빌리티 및 클라우드 서버를 포함한다. 여기서, 각 구성은 네트워크 통신하며, 상기 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일예에는 네트워크는, PAN(personal area network), LAN(local area network), CAN(campus area network), MAN(metropolitan area network), WAN(wide area network), BBN(broadband network), 인터넷 등의 네트워크 중 하나 이상의 임의의 네트워크를 포함할 수 있다. 또한, 네트워크는 버스 네트워크, 스타 네트워크, 링 네트워크, 메쉬 네트워크, 스타-버 스 네트워크, 트리 또는 계층적(hierarchical) 네트워크 등을 포함하는 네트 워크 토폴로지 중 임의의 하나 이상을 포함할 수 있으나, 이에 제한되지 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다할 것이다. 상기 복수의 자율주행로봇 또는 모빌리티는 각각이 서로 다른 지정된 실내공간을 주행하면서 사람 및/또는 사물의 특성정보를 수집하기 위한 구성일 수 있다. 또한, 상기 복수의 자율주행로봇 또는 모빌리티는 지정된 이동 경로 상에서 장애물 감지 회피, 온도, 습도, 또는 공기 상태 등과 같은 환경 정보 인지, 추적, 변화 감지, 고속 이동, 영상 감시, 또는 사각지대 결정 등 다양한 동작들을 수행할 수 있다. 실시 예에 따라 자율 주행 로봇 또는 모빌리티는 이동 로봇, 감시용 이동 로봇, 또는 감시용 로봇 등 다양한 용 어들로 호칭될 수 있다. 상기 자율주행로봇 또는 모빌리티는 프로세서, 메모리, 로봇 카메라, 라이다 센서, 자율주행부 및 통신부를 포함한다. 상기 프로세서는 후술하는 클라우드 서버에서 제공된 메타지도 내의 이행명령(조작정보)에 따라 자율 주행 로봇 또는 모빌리티의 주행동작들을 제어하는 명령들을 실행한다. 또한, 상기 프로세서는 후술하는 로봇 카메라 및 라이다 스캐너에서 검출된 사물 및/또는 사람 의 특성정보, 공간좌표정보를 추출 또는 산출하는 구성일 수 있다. 또한, 상기 프로세서는 로봇 카메라의 촬영정보 및 라이다 센서에서 검출한 라이다 신호를 통해 상기 실내 공간에 위치하는 사람 및/또는 사물을 검출하고, 검출된 사물 및 사람의 외형특성을 객체 인식 모델을 통해 추 출하는 구성일 수 있다. 상기 객체 인식 모델은 SIFT(Scale Invariant Feature Transform) 알고리즘, HOG(Histogram of Oriented Grandients) 알고리즘, Haar 알고리즘, Ferm 알고리즘 등 다 양한 알고리즘을 이용하여 구현될 수 있다. 또한, 상기 프로세서는 상기 사물 및/또는 사람을 검출한 위치 및 상기 사람 및/또는 사물과의 검출거리를 기초로 실내공간 내에 상기 사물 및 사람의 위치 및 밀집도 등을 산출하는 구성일 수 있다. 여기서, 밀집도는 특정 영역에 분포 또는 위치되어 있는 라이다 데이터들의 개수를 기준으로 판단되며, 라이다 데이터들의 연관성은 라이다 데이터들 사이의 유클리드 거리, 반사율, 법선 벡터 등을 기준으로 판단된다. 즉, 프로세서는 라이다 데이터들이 분포되어 있는 정도와 라이다 데이터들 사이의 유사도를 기준으로 유사 한 영역에 분포되고 유사한 속성을 가지는 라이다 데이터들을 판별하여 이들을 개별적인 그룹으로 군집화할 수 있다. 또한, 상기 프로세서는 상기 사물 및/또는 사람의 특성 데이터를 추출하는 데 필요한 센서 데이터 및 상기 특성 데이터를 암호화된 메시지로 가공처리한 후, 후술하는 메모리(버퍼)에 저장하는 구성일 수 있다. 또한, 메모리(버퍼)에 저장된 메시지들을 워커 스레드에서 하나의 레코드로 가공처리하여 제공하는 구성일 수 있다. 또한, 메모리는 프로세서에서 처리된 레코드를 저장하는 구성일 수 있다. 또한, 메모리는 자율주행 중 수집되는 다양한 환경정보(소리 등)를 저장하는 공간일 수 있다. 또한, 메모리는 자율주행로봇 또는 모빌리티의 동작을 위한 데이터들, 명령어들(응용프로그램)을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 메모리 는 플래시 메모리 타입(Flash Memory Type), 하드 디스크 타입(Hard Disk Type), 멀티미디어 카드 마이크로 타 입(Multimedia Card Micro Type), 카드 타입의 메모리(예를 들면, SD 또는 XD 메모리 등), 자기 메모리, 자기 디스크, 광디스크, 램(Random Access Memory: RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory: ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory) 중 적어도 하나의 저장매체를 포함할 수 있다.상기 로봇 카메라는 이동경로 상의 실내공간을 촬영하는 구성일 수 있다. 촬영영상은 상술한 프로세서에서 사물 및/또는 사람인지를 인식 또는 판단하고, 사물 및/또는 사람의 특성정보(얼굴, 신체, 성별 등)을 추출하는 데 사용된다. 상기 라이다 센서부는 사물 및/또는 사람의 위치를 측정하는 구성일 수 있다. 참고로, 라이다 센서는 원거리에 폭 넓은 시야각으로 공간의 사물 위치 측정이 가능하여 일부 물체의 위치에 변경이 있더라도 공간의 제한된 영역 안에서 자신의 위치를 추종하는 데 사용되는 구성이다. 참고로, 라이다 센서부는 레이더 파장의 빛을 외부로 방출하고, 이 방출된 빛이 외부 객체에 반사되어 되 돌아오는 데 소요되는 시간을 측정하여 사물 및/또는 사람의 위치에 대한 정보(라이다 데이터)를 생성한다. 한편, 본 발명의 라이다 센서부는 라이다 데이터를 이용하여 객체(사물 및 사람)의 존재 여부뿐만 아니라, 객체의 종류도 분류하도록 하기 위하여 2D 라이다 센서가 복수의 레이어로 구성된 3차원 라이다 센서일 수 있다. 다만 2D 라이다 센서를 틸팅시키거나 회전시키는 경우 3차원 정보가 포함된 라이다 데이터가 확보될 수 있으므 로, 본 발명에서 이용되는 라이다 센서부는 틸팅 또는 회전이 가능하도록 구성된 2D 라이다 센서로 구현될 수 있음은 물론이다. 상기 자율주행부는 설정된 동선으로 자율적 주행이 가능한 구성으로, 장 애물을 감지하는 라이다 센서, 위 성 항법 자율주행 알고리즘 등이 탑재된 구성으로, 자율주행에 대한 기술은 공지된 기술에 불과함으로 보다 상 세한 설명은 생략하도록 한다. 상기 통신부는 후술하는 디지털 트윈 맵 제작서버와 양방향 통신하는 구성으로, 유/무선 통신망을 통해 내 부의 임의의 구성 요소 또는 외부의 임의의 적어도 하나의 단말기와 통신 연결한다. 이때, 상기 외부의 임의의 단말기는 서버(미도시), 다른 단말(미도시) 등을 포함할 수 있다. 여기서, 무선 인터 넷 기술로는 무선랜(Wireless LAN: WLAN), DLNA(Digital Living Network Alliance), 와이브로(Wireless Broadband: Wibro), 와이맥스(World Interoperability for Microwave Access: Wimax), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), IEEE 802.16, 롱 텀 에볼루션(Long Term Evolution: LTE), LTE-A(Long Term Evolution-Advanced), 광대역 무선 이동 통신 서비스(Wireless Mobile Broadband Service: WMBS) 등이 있으며, 상기 통신부는 상기에서 나열되지 않은 인터넷 기술까지 포함한 범위에 서 적어도 하나의 무선 인터넷 기술에 따라 데이터를 송수신하게 된다. 또한, 근거리 통신 기술로는 블루투스 (Bluetooth), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association: IrDA), UWB(Ultra Wideband), 지그비(ZigBee), 인접 자장 통신(Near Field Communication: NFC), 초음파 통신(Ultra Sound Communication: USC), 가시광 통신(Visible Light Communication: VLC), 와이 파이(Wi-Fi), 와이 파이 다이렉트(Wi-Fi Direct) 등이 포함될 수 있다. 또한, 유선 통신 기술로는 전력선 통신(Power Line Communication: PLC), USB 통신, 이더넷(Ethernet), 시리얼 통신(serial communication), 광/동축 케이블 등이 포함될 수 있다. 또한, 상기 통신부는 유니버설 시리얼 버스(Universal Serial Bus: USB)를 통해 임의의 단말과 정보를 상 호 전송할 수 있다. 또한, 상기 통신부는 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE- A(Long Term Evolution-Advanced) 등)에 따라 구축된 이동 통신망 상에서 기지국, 상기 서버, 상기 다른 단말 등과 무선 신호를 송수신한다. 다음으로, 클라우드 서버는 상기 실내공간의 좌표정보를 맵핑한 가상화 공간을 생성하고, 상기 가상화 공 간 내에 상기 목적물 좌표정보를 표출하고, 상기 자율주행로봇 또는 모빌리티의 주행명령정보를 기록한 제어정 보가 기록된 메타 지도를 생성하여 상기 자율주행로봇 또는 모빌리티로 제공하는 구성일 수 있다. 또한, 클라우드 서버는 상기 실내공간 내에서 주행하는 자율주행로봇 또는 모빌리티에서 실시간으로 감지 된 장애물 또는 객체의 위치정보를 상기 가상공간의 좌표에 반영하여 상기 메타지도를 업데이트하고, 상기 장애물 또는 객체의 위치정보에 따라 목표물까지의 주행경로 및 주행정보를 업데이트하는 구성일 수 있다. 또한, 클라우드 서버는 상기 실내공간의 전체적인 지형 및 사물정보가 맵핑된 자율주행하는 로봇의 사물정 보가 포함된 가상화된 맵을 사전에 미리 생성하고, 상기 가상공간 내에 상기 자율주행로봇 또는 모빌리티와 목 적물 위치정보를 표시하고, 상기 가상공간 내에서 상기 자율주행로봇 또는 모빌리티가 상기 목적물까지 이동하 기 위한 주행명령어가 반영된 메타지도를 생성한 후, 상기 메타지도 내의 가상공간 좌표체계를 현실좌표 체계로 변환하여 상기 자율주행로봇 또는 모빌리티로 제공하는 구성일 수 있다. 보다 구체적으로, 상기 클라우드 서버는 정보수집부, 가상공간 모델링부, 주행정보 에이전트부 및 메타지도 생성부를 포함한다. 상기 정보수집부는 기 등록된 자율주행로봇 또는 모빌리티에서 측정한 측정정보를 수집하는 구성일 있다. 여기서 측정정보는 자율주행과정에서 측정한 사람 및/또는 사물의 위치정보, 특성정보를 포함하는 정보일 수 있다. 또한, 상기 정보수집부는 자율주행로봇 또는 모빌리티가 주행하는 실내공간의 현실좌표 정보를 외부서버로 부터 수십하는 구성일 수 있다. 다음으로, 가상공간 모델링부는 실내공간의 실내좌표를 기반으로 3차원 가상공간으로 모델링하는 구성일 수 있다. 여기서, 가상세계의 공간인 3차원 가상공간은 공간의 특징에 따라 VS(Virtual Space), MS(Mixed Space) 및/또 는 DTS(Digital Twin Space)의 형태로 구성될 수 있다. VS(Virtual Space)는 순수 디지털 기반의 공간일 수 있으며, DTS(Digital Twin Space)는 실세계 기반의 가상의 공간일 수 있으며, MS(Mixed Space)는 VS와 DTS가 혼합된 공간일 수 있다. MS의 경우, 실 세계의 환경에 자율주행로봇 또는 모빌리티가 적응하는 형태로 제공되거나 또는 실세계의 환경을 가상세계상에서 렌더링하는 형태로 제공될 수 있다. 가상세계의 공간은 자율주행로봇 또는 모빌리티가 활동할 수 있는 기본 가상공간의 개념일 수 있다. 이러한 가상세계의 공간은 사용자에 따라 다양하게 생성 및 활용될 수 있다. 한편, 가상세계의 공간은 다수의 에이전트가 존재하며, 에이전트는 가상세계의 공간상에서의 사용자 또는 프로 그램을 의미할 수 있다. 여기서, 프로그램으로서의 에이전트는 인공지능 에이전트의 형태로, 제3자 사업자를 대신하여 존재하는 가상의 아바타 또는 페르소나(person a)일 수 있다. 이러한 에이전트에는 해당 에이전트가 속한 가상세계의 공간의 물 리적 특징이 적용될 수 있으며, 해당 가상세계의 공간에 설정된 서비스 규약(service profile)이 적용될 수 있 다. 또한, 에이전트는 사용자가 이용하는 물리적인 장치의 정보에 기반한 특징을 가질 수 있다. 예를 들어, 에이전 트는 사용자가 이용하는 물리적인 장치의 디스플레이의 특징에 따른 시야각을 갖거나 또는 해당 물리적인 장치 의 컨트롤러에 따른 제어 특징을 가질 수 있다. 또한, 가상세계의 공간은 다양한 디지털 오브젝트(digital object)가 위치하며, 가상세계의 공간상에서 세계정 보를 구성하는 핵심 요소로서 에이전트와의 상호 인터렉션 기능을 제공하는 오브젝트들을 총칭할 수 있다. 이때, 디지털 오브젝트는 가상세계의 공간이 포함하는 에어리어인 오브젝트 에어리어(Object Area, OA)에 형성 될 수 있다. 또한, 디지털 오브 젝트는 디스플레이 오브젝트(Display Object, DO), 인터렉션 오브젝트(Interaction Object, IO), 웹 오브젝트(Web Object, WO) 및 스트리밍 오브젝트(Streaming Object, SO)를 포함할 수 있다. 이때, 디스플레이 오브젝트, 인터렉션 오브젝트, 웹 오브젝트 및 스트리밍 오브젝트 각각은 콘텐츠의 표시를 위 한 디스플레이 에어리어(Display Area)를 선택적으로 포함할 수 있다. 상기 가상공간 모델링부에서 생성한 가상공간은 현실세계에 존재하는 도로, 건물 및 랜드마크를 포함한 현 실세계 환경을 가상공간에 동일하게 투영시킨 공간일 수 있다. 상기 가상공간 모델링부는 특정 공간에 대한 3차원적인 정보에 기초하여 해당 공간을 디지털 트윈 기법을 이용하여 가상 공간으로 모사하여 생성한다. 예컨대, 특정 공간에 대한 3차원적인 정보는 해당 공간에 대한 설계도, 3D 스캔한 자료, 평면도, 특정 공간을 실측하여 생성된 자료 중 어느 하나일 수 있다. 또한, 가상공간 모델링부는 초기 위치(Initial position)를 기반으로 디지털 트윈에 배치된 3D 모델(3D model Reconstruction)을 이용하여 객체 감지 데이터 내 객체와의 차이를 계산하며, 차이를 최소화하는 최적화 (optimization)를 통해 객체의 위치 및 각도를 포함하는 지리적 데이터를 추정하여 추정된 지리적 데이터를 디 지털 트윈공간으로 구현할 수 있다. 본 발명에서 언급하는 디지털 트윈은 제조, 의료, 운송, 항공우주, 건설 등 다양한 시스템과 산업에 사용되는 것으로, 표준화된 데이터를 사용하여 IoT 데이터(IoT Data), 3D 객체(3D Objects) 및 3D 맵(3DGeographic Map) 기반으로 형성된 것일 수 있다 참고로, 디지털 트윈(Digital Twin) 기술은 실시간으로 역학적 해석이 가능한 실제 물리 모델이나 실제 센서 정 보 모델 등과 동일성 및 일관성을 유지하는 디지털 트윈 모델을 이용하여 실제 물리 모델이나 실제 센서 정보 모델 등의 미래 현상을 예측하여 실제 물리 모델이나 실제 센서 정보 모델 등을 제어할 수 있는 기술로 알려져 있다. 또한, 가상공간 모델링부에서 생성된 가상공간은 소정 규격의 격자(Grid) 형태로 구분되며 각각의 격자에 고유 좌표값이 포함된 주소정보 및 공간정보가 부여된다. 다음으로, 상기 주행정보 에이전트부는 가상공간 내에 위치하는 에이전트인 자율주행로봇 또는 모빌리티의 아바타가 목적물까지의 이동하기 위한 주행명령어를 제공하는 구성일 수 있다. 여기서, 주행명령어는 가상공간의 현 위치에서부터 목적물까지의 이동경로, 이동속도, 이동방향 등에 대한 명령 어일 수 있다. 또한, 상기 주행정보 에이전트부는 실시간으로 실내공간의 주행경로 상에 위치하는 사람 및/또는 사물을 검출하고, 검출된 사람 및/또는 사물의 위치에 따른 목적물까지의 이동경로, 이동속도, 이동방향을 보정 또는 수정한 주행명령어를 제공하는 구성일 수 있다. 다음으로, 상기 메타지도 생성부는 가상공간 모델링부에서 생성된 VS(Virtual Space), MS(Mixed Space) 및/또는 DTS(Digital Twin Space)의 형태로 구성된 가상세계의 공간 내의 목적물까지 현실세계의 자율주 행로봇 또는 모빌리티가 이동하기 위한 주행 명령어를 포함하는 메타지도를 생성하는 구성일 수 있다. 또한, 상기 메타지도 생성부에서 생성된 메타지도는 현실세계의 자율주행로봇 또는 모빌리티가 인식가능하 도록 가상공간 3차원 좌표를 현실좌표로 변환한 메타지도로서, 현실세계의 자율주행로봇 또는 모빌리티에서 취 득한 공간 데이터, 사물 및/사물의 특성정보, 위치정보 등을 포함하는 지도일 수 있다. 보다 구체적으로, 상기 메타지도 생성부는 맵핑부, 동기화부, 목표물 지정부, 이동경로 생 성부 및 메타지도 제공 및 갱신부를 포함한다. 상기 맵핑부는 가상공간 모델링부에서 생성한 디지털 트윈 공간인 가상공간의 공간좌표와 현실세계의 공간좌표를 맵핑한 맵핑 지도를 생성하는 구성일 수 있다. 상기 동기화부는 맵핑 지도 내에 현실세계의 자율주행로봇 또는 모빌리티의 위치정보와 가상공간 내의 자 율주행로봇 또는 모빌리티의 아바타의 위치를 동기화시키는 구성일 수 있다. 또한, 목표물 지정부는 맵핑지도 내에 외부단말에서 지정한 위치로 목표물을 지정 또는 생성하는 구성일 수 있다. 상기 이동경로 생성부는 맵핑지도 내에 자율주행로봇 또는 모빌리티의 위치로부터 상기 목표물까지의 이동 경로를 산출하여 제공하는 구성일 수 있다. 참고로, 상기 이동경로 생성부는 산출된 이동경로로 이동하는 현실세계의 자율주행로봇 또는 모빌리티가 이동경로 상에 장애물(이동객체 등)을 감지할 경우, 감지된 장애물을 회피하는 추가 이동경로를 재 산출하여 제공한다. 상기 메타지도 제공 및 갱신부는 상기 이동경로 생성부에서 생성된 이동경로 및 상기 이동경로 내에 상기 주행정보 에이전트에서 제공하는 주행명령어가 반영된 메타지도를 생성하여 상술한 현실세계의 자율주행로 봇 또는 모빌리티로 전송하는 구성일 수 있다. 또한, 상기 메타지도 제공 및 갱신부는 메타지로에 표시된 이동경로를 따라 이동중에 감지되는 장애물(이 동객체)을 감지한 감지정보를 실시간으로 반영하여 목표물까지의 이동경로를 재산출한 메타지도로 기존 메타지 도를 갱신하여 제공하는 구성일 수 있다. 도 6은 본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지 도 제작 방법을 설명한 흐름도이다. 도 6을 참조하면, 본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상 화된 메타지도 제작 방법(S700)은 먼저, 자율주행로봇 또는 모빌리티에서 시각화 센서로 취득한 실내공간정보 및 상기 실내공간정보 내의 위치한 목적물의 위치 데이터를 취득(S710)한 후, 상기 목적물의 특징을 분석하고, 위치 좌표를 산출한 후, 클라우드 서버에 제공(S720)하면, 클라우드 서버에서 상기 실내공간과 맵핑되는 가상공간의 메타지도를 생성(S730)하고, 생성된 메타지도 내에 자율주행로봇 및 목적물의 위치 및 특성정보를 표출(S740)하고, 가상화 맵(공간)에서 자율주행로봇 또는 모빌리티가 목적물까지 주행하기 위한 주행명령어를 제공하면(S750), 주행명령어가 기록된 메타지도 내의 좌표를 자율주행로봇 또는 모빌리티가 인식가능한 실제 좌 표 체계로 변환하여 전송(S760)하면, 자율주행로봇 또는 모빌리티에서 메타지도 내의 주행명령어를 이행하 는 과정을 포함할 수 있다. 또한, 상기 S700 과정은 상기 자율주행로봇 또는 모빌리티에서 사람 및/또는 사물에 대한 객체정보가 주행동선 내에 위치하면, 상기 사람 및/또는 사물을 우회하기 위한 새로운 주행명령어를 생성하여 업데이트하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지도 제작 시스템 및 방법을 이용하면, 가상공간 내의 디지털 오브젝트의 조작명령에 따른 움직임을 현실세계에서 투영시 켜 자율주행로봇 또는 모빌리티를 원격제어할 수 있다는 이점이 있다. 또한, 자율주행로봇 또는 모빌리티로부터 취득한 이벤트를 가상공간에 투영시킬 수 있고, 이를 반영한 메타지도 를 제작할 수 있다는 이점이 있다. 또한, 사용자(관리자)가 가상화 맵을 열람하여 로봇의 위치를 조작, 이동하는 등의 명령어 제공 및 모니터링할 수 있고, 가상화된 맵의 위치 데이터를 실제 로봇이 인식하는 좌표 체계로 변환하여 제공할 수 있다는 이점을 제공한다. 도 7은 본 명세서에 개진된 하나 이상의 실시예가 구현될 수 있는 예시적인 컴퓨팅 환경을 도시하는 도면으로, 상술한 하나 이상의 실시예를 구현하도록 구성된 컴퓨팅 디바이스를 포함하는 시스템의 예시를 도 시한다. 예를 들어, 컴퓨팅 디바이스는 개인 컴퓨터, 서버 컴퓨터, 핸드헬드 또는 랩탑 디바이스, 모바일 디바이스(모바일폰, PDA, 미디어 플레이어 등), 멀티프로세서 시스템, 소비자 전자기기, 미니 컴퓨터, 메인프레 임 컴퓨터, 임의의 전술된 시스템 또는 디바이스를 포함하는 분산 컴퓨팅 환경 등을 포함하지만, 이것으로 한정 되는 것은 아니다. 컴퓨팅 디바이스는 적어도 하나의 프로세싱 유닛 및 메모리를 포함할 수 있다. 여기서, 프로 세싱 유닛은 예를 들어 중앙처리장치(CPU), 그래픽처리장치(GPU), 마이크로프로세서, 주문형 반도체 (application Specific Integrated Circuit, ASIC), Field Programmable Gate Arrays(FPGA) 등을 포함할 수 있으며, 복수의 코어를 가질 수 있다. 메모리는 휘발성 메모리(예를 들어, RAM 등), 비휘발성 메모리(예 를 들어, ROM, 플래시 메모리 등) 또는 이들의 조합일 수 있다. 또한, 컴퓨팅 디바이스는 추가적인 스토 리지를 포함할 수 있다. 스토리지는 자기 스토리지, 광학 스토리지 등을 포함하지만 이것으로 한정 되지 않는다. 스토리지에는 본 명세서에 개진된 하나 이상의 실시예를 구현하기 위한 컴퓨터 판독 가능한명령이 저장될 수 있고, 운영 시스템, 애플리케이션 프로그램 등을 구현하기 위한 다른 컴퓨터 판독 가능한 명 령도 저장될 수 있다. 스토리지에 저장된 컴퓨터 판독 가능한 명령은 프로세싱 유닛에 의해 실행되 기 위해 메모리에 로딩될 수 있다. 또한, 컴퓨팅 디바이스는 입력 디바이스(들) 및 출력 디 바이스(들)을 포함할 수 있다. 여기서, 입력 디바이스(들)은 예를 들어 키보드, 마우스, 펜, 음성 입력 디바이스, 터치 입력 디바이스, 적외선 카메라, 비디오 입력 디바이스 또는 임의의 다른 입력 디바이스 등을 포함할 수 있다. 또한, 출력 디바 이스(들)은 예를 들어 하나 이상의 디스플레이, 스피커, 프린터 또는 임의의 다른 출력 디바이스 등을 포 함할 수 있다. 또한, 컴퓨팅 디바이스는 다른 컴퓨팅 디바이스에 구비된 입력 디바이스 또는 출력 디바이 스를 입력 디바이스(들) 또는 출력 디바이스(들)로서 사용할 수도 있다. 또한, 컴퓨팅 디바이스는 컴퓨팅 디바이스가 다른 디바이스(예를 들어, 컴퓨팅 디바이스)와 통신할 수 있게 하는 통신접속(들)을 포함할 수 있다. 여기서, 통신 접속(들)은 모뎀, 네트워크 인터페이스 카드(NIC), 통합 네트워크 인터페이스, 무선 주파수 송신기/수신기, 적외선 포트, USB 접속 또는 컴퓨팅 디바이스를 다른 컴퓨팅 디바이스에 접속시키기 위한 다른 인터페이스를 포함할 수 있다. 또한, 통신 접속(들)은 유선 접속 또는 무선 접속을 포함할 수 있다. 상술한 컴퓨팅 디바이스의 각 구성요소는 버스 등의 다양한 상호접속(예를 들어, 주변 구성요소 상호접속 (PCI), USB, 펌웨어(IEEE 1394), 광학적 버스 구조 등)에 의해 접속될 수도 있고, 네트워크에 의해 상호 접속될 수도 있다. 본 명세서에서 사용되는 \"구성요소\", \"시스템\" 등과 같은 용어들은 일반적으로 하드웨어, 하 드웨어와 소프트웨어의 조합, 소프트웨어, 또는 실행중인 소프트웨어인 컴퓨터 관련 엔티티를 지칭하는 것이다. 예를 들어, 구성요소는 프로세서 상에서 실행중인 프로세스, 프로세서, 객체, 실행 가능물(executable), 실행 스레드, 프로그램 및/또는 컴퓨터일 수 있지만, 이것으로 한정되는 것은 아니다. 예를 들어, 컨트롤러 상에서 구동중인 애플리케이션 및 컨트롤러 모두가 구성요소일 수 있다. 하나 이상의 구성요소는 프로세스 및/또는 실 행의 스레드 내에 존재할 수 있으며, 구성요소는 하나의 컴퓨터 상에서 로컬화될 수 있고, 둘 이상의 컴퓨터 사 이에서 분산될 수도 있다. 이상에서 설명한 것은 본 발명에 의한 자율 주행 기기를 이용한 사용자 맞춤 정보 제공 시스템을 실시하기 위한 하나의 실시예에 불과한 것으로서, 본 발명은 상기 실시예에 한정되지 않고, 이하의 특허청구범위에서 청구하는 바와 같이 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변경 실시가 가능한 범위까지 본 발명의 기술적 정신이 있다고 할 것이다."}
{"patent_id": "10-2023-0049372", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a은 디지털 트윈의 아키텍쳐이고, 도 1b는 메타버스의 아케텍쳐이다. 도 2는 본 발명의 일 실시예에 따른 지능형 실내 자율주행 로봇이 취득한 공간데이터를 이용한 가상화된 메타지 도 제작 시스템의 네트워크 구성도이다. 도 3은 도 2에 도시된 자율주행로봇 또는 모빌리티의 세부 구성도이다. 도 4는 도 2에 도시된 클라우드 서버의 세부 구성도이다. 도 5는 도 4에 도시된 메타지도 생성부의 세부 구성도이다. 도 6은 도 2에 도시된 클라우드 서버에서 지원하는 현실좌표로 변환되는 메타지도 및 현실좌표를 가상공간 좌표 로 변환과정을 나타낸 예시도이다. 도 7은 본 명세서에 개진된 하나 이상의 실시예가 구현될 수 있는 예시적인 컴퓨팅 환경을 도시한 도이다."}
