{"patent_id": "10-2023-0010433", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0117952", "출원번호": "10-2023-0010433", "발명의 명칭": "진단 영상의 피드백을 이용한 통증 데이터 판단, 치료법 및 제품을 통한 통증 해결 방법 및", "출원인": "김명환", "발명자": "김명환"}}
{"patent_id": "10-2023-0010433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 의해 수행되는, 진단 영상의 피드백을 이용한 통증 데이터를 판단하는 방법에 있어서,고객 단말 장치로부터 복수의 통증 부위 중 하나의 통증 부위를 선택하는 요청을 수신한 것에 응답하여, 상기선택된 통증 부위에 대응하는 질문 리스트를 상기 고객 단말 장치로 전송하는 단계;상기 고객 단말 장치로부터, 상기 질문 리스트의 답변을 나타내는 고객 답변 정보를 수신하는 단계;상기 고객 단말 장치로부터, 상기 선택된 통증 부위와 관련된 통증 수치 및 진단 영상을 수신하는 단계;상기 고객 답변 정보 및 상기 진단 영상에 기초하여, 상기 선택된 통증 부위에 관한 통증 유발 원인을 분석하는단계;복수의 솔루션들 중, 상기 분석된 통증 유발 원인과 관련된 적어도 하나의 솔루션을 선택하는 단계;상기 선택된 적어도 하나의 운동 영상을 상기 고객 단말 장치로 전송하는 단계;상기 적어도 하나의 솔루션이 상기 고객 단말 장치에서 재생이 완료된 것에 응답하여, 상기 고객 단말 장치로부터 상기 선택된 통증 부위와 관련된 통증 수치를 재 수신하는 단계; 및상기 선택된 통증 부위와 관련된 통증 수치의 변화 이력을, 상기 고객 단말 장치에 대응하는 고객의 정보에 매칭하여 데이터베이스에 저장하는 단계를 포함하는, 판단 방법."}
{"patent_id": "10-2023-0010433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 선택된 통증 부위에 관한 통증 유발 원인을 분석하는 단계는,상기 선택된 통증 부위와 관련된 진단 영상에 포함된 고객의 통증 부위를 식별하는 단계;상기 고객의 통증 부위에 포함된 미리 지정된 복수의 포인트를 식별하는 단계;상기 진단 영상에 포함된 상기 복수의 포인트의 위치를 트래킹 하는 단계; 및상기 트래킹된 복수의 포인트의 위치 및 상기 고객 답변 정보에 기초하여, 기 지정된 복수의 통증 유발 원인 중상기 선택된 통증 부위에 관한 통증 유발 원인을 판단하는 단계를 포함하는, 판단 방법."}
{"patent_id": "10-2023-0010433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 기 지정된 복수의 통증 유발 원인은,허리 통증과 관련된, 몸통 회전(trunk rotation), 햄스트링(hamstring), 고관절 외회전(hip joint externalrotation), 고관절 내회전(hip joint internal rotation) 및 장요근 스트레칭(iliopsoas stretching)과,상하체 통증과 관련된, 흉곽 열림(ribcage open), 둔근 약화(gluteus weak), 기립근 긴장(erector tight) 및복압(intral abdominal pressure, IAP)을 포함하는, 판단 방법."}
{"patent_id": "10-2023-0010433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 질문 리스트는,상기 기 지정된 복수의 통증 유발 원인 각각에 대한, 적어도 하나의 테스트 이미지 및 상기 적어도 하나의 테스트 이미지에 관련된 적어도 하나의 테스트 질문을 더 포함하는, 판단 방법.공개특허 10-2024-0117952-3-청구항 5 제2항에 있어서,상기 선택된 통증 부위에 관한 통증 유발 원인을 분석하는 단계는,상관 모델에 상기 고객 답변 정보 및 상기 진단 영상을 입력하는 단계; 및상기 상관 모델로부터, 상기 선택된 통증 부위에 관한 통증 유발 원인을 획득하는 단계를 포함하고,상기 상관 모델은, 기계 학습 알고리즘에 따라, 복수의 고객 단말 장치 각각으로부터 수신한 통증 부위에 대한고객 답변 정보, 진단 영상의 세트 및 전문가의 임상적 데이터를 입력 데이터로 하고, 상기 통증 부위에 관한통증 유발 원인들의 세트를 출력 데이터로 하여, 상기 입력 데이터 및 상기 출력 데이터 사이의 상관 관계를 모델링하여 구축된 상관 모델인, 판단 방법."}
{"patent_id": "10-2023-0010433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 고객 단말 장치로, 상기 선택된 통증 부위와 관련된 통증 수치의 변화 이력 및 상기 변화 이력을 분석한결과를 포함하는 분석 리포트를 미리 설정된 주기로 전송하는 단계를 더 포함하는, 판단 방법."}
{"patent_id": "10-2023-0010433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,치료사 단말 장치로, 상기 고객 답변 정보, 상기 통증 유발 원인 및 상기 통증 수치의 변화 이력을 전송하는 단계;상기 치료사 단말 장치로부터, 상기 고객에 대한 평가 정보를 수신하는 단계;상기 고객에 대한 평가 정보를 상기 고객의 정보에 매칭하여 상기 데이터베이스에 저장하는 단계를 더포함하는, 판단 방법."}
{"patent_id": "10-2023-0010433", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 통증 유발 원인을 분석하는 단계는,상기 전자 장치와 연결되고, 복수의 영역들로 구분되어 압력을 측정하는 마사지 기구로부터 측정된 압력 정보에기초하여 상기 통증 유발 원인을 분석하는 단계를 포함하고,상기 판단 방법은,상기 분석된 통증 유발 원인에 기초하여 기구 제어 정보를 상기 마사지 기구로 전달하는 단계를 더 포함하는 것을 특징으로 하는, 판단 방법."}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따른 전자 장치에 의해 수행되는, 진단 영상의 피드백을 이용한 통증 데이터를 판단 하는 방법은, 고객 단말 장치로부터 복수의 통증 부위 중 하나의 통증 부위를 선택하는 요청을 수신한 것에 응답 하여, 상기 선택된 통증 부위에 대응하는 질문 리스트를 상기 고객 단말 장치로 전송하는 단계; 질문 리스트의 (뒷면에 계속)"}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 진단 영상의 피드백을 이용한 통증 데이터를 판단하는 기술에 관한 것이다."}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "환자의 통증 부위를 분석하기 위하여, 의사가 환자를 직접 대면하여 통증 부위 및 통증 정도를 확인하고, 의사 의 임상적 지식과 경험을 기초로 진단하고 있다. 이 경우, 환자는 통증을 줄이기 위하여, 물리 치료사에게 치 료를 받거나, 직접 치료와 관련된 운동을 자체적으로 수행할 수 있다.또한, 최근에는 병원에서 환자의 특정 자세를 촬영하고, 이에 기초하여, 통증이 있는지 없는지 여부를 판단하는 기술도 개발되고 있다."}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따르면, 특정 부위에 통증이 발생하였는지 여부만이 아니라 통증이 발생한 원인을 찾고 간단히 해결방법을 종합적으로 고객(환자)에게 제공하는 것을 기술적 해결 과제로 한다. 본 개시의 다양한 실시예에 따르면, 고객의 다양한 신체적인 활동에 대한 신체적인 문제를 파악해주는 것과, 그 것에 대한 기기 및 제품을 통한 솔루션을 제공할 수 있다. 예컨대 솔루션에는 운동 도구 종류의 제안, 운동 기 구 활용법, 체형 분석자료, 의료기기 및 일상제품 활용법, 내원의 필요 여부를 포함할 수 있으며, 특히 운동 방 법을 포함할 수 있다. 본 개시에서는 운동 방법을 제공하는 것을 기술적 해결 과제로 한다."}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따른 전자 장치에 의해 수행되는, 진단 영상의 피드백을 이용한 통증 데이터를 판단 하는 방법은, 고객 단말 장치로부터 복수의 통증 부위 중 하나의 통증 부위를 선택하는 요청을 수신한 것에 응 답하여, 상기 선택된 통증 부위에 대응하는 질문 리스트를 상기 고객 단말 장치로 전송하는 단계; 상기 고객 단 말 장치로부터, 상기 질문 리스트의 답변을 나타내는 고객 답변 정보를 수신하는 단계; 상기 고객 단말 장치로 부터, 상기 선택된 통증 부위와 관련된 통증 수치 및 진단 영상을 수신하는 단계; 상기 고객 답변 정보 및 상기 진단 영상에 기초하여, 상기 선택된 통증 부위에 관한 통증 유발 원인을 분석하는 단계; 복수의 운동 영상 중, 상기 분석된 통증 유발 원인과 관련된 적어도 하나의 운동 영상을 선택하는 단계; 상기 선택된 적어도 하나의 운동 영상을 상기 고객 단말 장치로 전송하는 단계; 상기 적어도 하나의 운동 영상이 상기 고객 단말 장치에서 재생이 완료된 것에 응답하여, 상기 고객 단말 장치로부터 상기 선택된 통증 부위와 관련된 통증 수치를 재 수 신하는 단계; 상기 선택된 통증 부위와 관련된 통증 수치의 변화 이력을, 상기 고객 단말 장치에 대응하는 고객 의 정보에 매칭하여 데이터베이스에 저장하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 분석된 통증 유발 원인과 관련된 적어도 하나의 운동 영상은, 고객에게 제공하는 다양한 피드백 중 하나일 수 있다. 고객에 게 제공하는 다양한 피드백은, 운동 영상 뿐만 아니라, 운동 도구 종류의 제안, 운동 기구 활용법, 체형 분석자 료, 의료기기 솔루션파트 - 기기, 제품 추천 추가 활용법 또는 내원의 필요 여부 중 적어도 하나의 정보를 포함 할 수 있다. 다양한 실시예에 따른 상기 선택된 통증 부위에 관한 통증 유발 원인을 분석하는 단계는, 상기 선택된 통증 부 위와 관련된 진단 영상에 포함된 고객의 통증 부위를 식별하는 단계; 상기 고객의 통증 부위에 포함된 미리 지 정된 복수의 포인트를 식별하는 단계; 상기 진단 영상에 포함된 상기 복수의 포인트의 위치를 트래킹하는 단계; 및 상기 트래킹된 복수의 포인트의 위치 및 상기 고객 답변 정보에 기초하여, 기 지정된 복수의 통증 유발 원인 중 상기 선택된 통증 부위에 관한 통증 유발 원인을 판단하는 단계를 포함할 수 있다. 다양한 실시예에 따른 상기 복수의 통증 유발 원인은, 허리 통증과 관련된, 몸통 회전(trunk rotation), 햄스트 링(hamstring), 고관절 외회전(hip joint external rotation), 고관절 내회전(hip joint internal rotation) 및 장요근 스트레칭(iliopsoas stretching)과, 상하체 통증과 관련된, 흉곽 열림(ribcage open), 둔근 약화 (gluteus weak), 기립근 긴장(erector tight) 및 복압(intral abdominal pressure, IAP)을 포함할 수 있다. 다양한 실시예에 따른 상기 질문 리스트는, 기 지정된 기간 내에 부상 이력이 있는지에 관한 제1 질문, 신체적 으로 이상 증상이 있는지에 관한 제2 질문, 통증 부위에 관한 불편함이 있는지에 관한 제3 질문, 주된 업무 환 경에 관한 제4 질문, 생활 습관에 대한 제5 질문, 연령에 관한 제6 질문을 포함할 수 있다. 다양한 실시예에 따른 상기 질문 리스트는, 상기 복수의 통증 유발 원인 각각에 대한, 적어도 하나의 테스트 이 미지 및 상기 적어도 하나의 테스트 이미지에 관련된 적어도 하나의 테스트 질문을 더 포함할 수 있다. 다양한 실시예에 따른 상기 선택된 통증 부위에 관한 통증 유발 원인을 분석하는 단계는, 상관 모델에 상기 고 객 답변 정보 및 상기 진단 영상을 입력하는 단계; 및 상기 상관 모델로부터, 상기 선택된 통증 부위에 관한 통 증 유발 원인을 획득하는 단계를 포함하고, 상기 상관 모델은, 기계 학습 알고리즘에 따라, 복수의 고객 단말 장치 각각으로부터 수신한 통증 부위에 대한 고객 답변 정보 및 진단 영상의 세트를 입력 데이터로 하고, 상기 통증 부위에 관한 통증 유발 원인들의 세트를 출력 데이터로 하여, 상기 입력 데이터 및 상기 출력 데이터 사이의 상관 관계를 모델링하여 구축된 상관 모델일 수 있다. 일 실시예에 따른 상기 선택된 통증 부위에 관한 통증 유발 원인을 분석하는 단계는, 상술한 상관 모델 이외에 도 다양한 기계 학습 모델을 이용할 수 있다. 다양한 기계 학습 모델은, 고객의 통증 부위에 관한 답변 정보 및 진단 영상을 학습용(훈련용) 입력 데이터로 사용하고, 이에 대응하는 통증 유발 원인을 학습용 출력 데이터 로 사용하여 학습된 모델일 수 있다. 기계 학습 모델은, 예를 들어, 심층 신경망, 합성곱 신경망, 순환 신경망, 강화 학습 모델 또는 분류-회귀 분석을 위한 머신 러닝 모델 중 하나일 수 있다. 다양한 실시예에 따른 판단 방법은, 상기 고객 단말 장치로, 상기 선택된 통증 부위와 관련된 통증 수치의 변화 이력 및 상기 변화 이력을 분석한 결과를 포함하는 분석 리포트를 미리 설정된 주기로 전송하는 단계를 더 포함 할 수 있다. 다양한 실시예에 따른 판단 방법은, 치료사 단말 장치로, 상기 고객 답변 정보, 상기 통증 유발 원인 및 상기 통증 수치의 변화 이력을 전송하는 단계; 상기 치료사 단말 장치로부터, 상기 고객에 대한 평가 정보를 수신하 는 단계; 상기 고객에 대한 평가 정보를 상기 고객의 정보에 매칭하여 상기 데이터베이스에 저장하는 단계를 더 포함할 수 있다. 다양한 실시예에 따른 상기 통증 수치는 통증 평가 척도(visual analogue scale)에 관한 수치일 수 있다."}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따르면, 특정 부위에 통증이 발생하였는지 여부만이 아니라 통증이 발생한 원인까지 종합적으로 고객(예: 환자)에게 제공할 수 있다. 본 개시의 다양한 실시예에 따르면, 고객의 다양한 신체적인 활동에 대한 피드백 및 솔루션을 제공할 수 있다."}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참조하여 실시예들을 상세하게 설명한다. 본 개시의 실시예들은 본 개시의 기술적 사상을 설명하기 위한 목적으로 예시된 것이다. 본 개시에 따른 권리범위가 이하에 제시되는 실시예들이나 이들 실시예들에 대한 구체적 설명으로 한정되는 것은 아니다. 본 개시에 사용되는 모든 기술적 용어들 및 과학적 용어들은, 달리 정의되지 않는 한, 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 일반적으로 이해되는 의미를 갖는다. 본 개시에 사용되는 모든 용어들은 본 개시를 더욱 명확히 설명하기 위한 목적으로 선택된 것이며 본 개시에 따른 권리범위를 제한하기 위해 선택 된 것이 아니다. 본 개시에서 사용되는 \"포함하는\", \"구비하는\", \"갖는\" 등과 같은 표현은, 해당 표현이 포함되는 어구 또는 문 장에서 달리 언급되지 않는 한, 다른 실시예를 포함할 가능성을 내포하는 개방형 용어(open-ended terms)로 이 해되어야 한다.본 개시에서 기술된 단수형의 표현은 달리 언급하지 않는 한 복수형의 의미를 포함할 수 있으며, 이는 청구범위 에 기재된 단수형의 표현에도 마찬가지로 적용된다. 본 개시에서 사용되는 \"제1\", \"제2\" 등의 표현들은 복수의 구성요소들을 상호 구분하기 위해 사용되며, 해당 구 성요소들의 순서 또는 중요도를 한정하는 것은 아니다. 본 개시에서 사용되는 \"~에 기초하여\"라는 표현은, 해당 표현이 포함되는 어구 또는 문장에서 기술되는, 결정, 판단의 행위 또는 동작에 영향을 주는 하나 이상의 인자를 기술하는데 사용되며, 이 표현은 결정, 판단의 행위 또는 동작에 영향을 주는 추가적인 인자를 배제하지 않는다. 본 개시에서, 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 경우, 상기 어 떤 구성요소가 상기 다른 구성요소에 직접적으로 연결될 수 있거나 접속될 수 있는 것으로, 또는 새로운 다른 구성요소를 매개로 하여 연결될 수 있거나 접속될 수 있는 것으로 이해되어야 한다. 첨부된 도면에서, 동일하거나 대응하는 구성요소에는 동일한 참조부호가 부여되어 있다. 또한, 이하의 실시예 들의 설명에 있어서, 동일하거나 대응하는 구성요소를 중복하여 기술하는 것이 생략될 수 있다. 그러나, 구성 요소에 관한 기술이 생략되어도, 그러한 구성요소가 어떤 실시예에 포함되지 않는 것으로 의도되지는 않는다. 도 1은 본 개시의 다양한 실시예에 따른 진단 영상의 피드백을 이용하여 통증 데이터를 판단하는 서비스를 제공 하기 위한 시스템을 도시한 도면이다. 다양한 실시예에 따른 시스템은, 전자 장치, 고객 단말 장치 및 치료사 단말 장치를 포함할 수 있다. 전자 장치는 고객 단말 장치 및 치료사 단말 장치와 통신망을 통해 유선 또는 무선으 로 통신 연결될 수 있다. 고객 단말 장치는 고객(또는 환자)이 소유한 단말 장치를 의미할 수 있고, 치료 사 단말 장치는 물리 치료사가 소유한 단말 장치를 의미할 수 있다. 본 도면에서는 설명의 편의를 위해 하나의 고객 단말 장치 및 하나의 치료사 단말 장치가 시스템에 포함되는 것으로 도시하였지만, 복수의 고객 각각이 소유하는 복수의 고객 단말 장치 및 복수의 물리 치료사 각각이 소유하는 복수의 치료 사 단말 장치가 시스템에 포함될 수도 있다. 다양한 실시예에 따른 전자 장치는, 고객 단말 장치로 통증 데이터를 판단(또는 분석)하고 적절한 피 드백을 제공할 수 있는 서비스를 운용하는 서버 장치일 수 있다. 상기 서비스는 애플리케이션을 통해 운용될 수 있다. 고객(또는 환자)는 고객 단말 장치를 통해 해당 애플리케이션을 다운로드 받고, 해당 애플리케 이션을 통해 상기 서비스를 이용할 수 있다. 본 문서에 개시된 통증 데이터란, 고객의 통증 부위에 관한 다양 한 데이터를 의미한다. 다양한 실시예에 따른 고객 단말 장치는 통증이 있는 통증 부위에 관한 다양한 정보를 전자 장치로 전송할 수 있다. 고객 단말 장치는, 사용자 입력에 기초하여, 복수의 통증 부위 중 하나를 선택할 수 있 다. 이 경우, 고객 단말 장치는 하나의 통증 부위를 선택하는 요청을 전자 장치로 전송할 수 있고, 전자 장치는 상기 요청을 수신한 것에 대한 응답으로, 선택된 통증 부위에 대응하는 질문 리스트를 고객 단말 장치로 전송할 수 있다. 복수의 통증 부위는, 예를 들어, 상체, 허리 및 하체를 포함할 수 있다. 고객 단말 장치는, 질문 리스트에 대한 답변을 입력하는 사용자 입력을 수신할 수 있다. 예를 들어, 고객 은 고객 단말 장치를 통해 질문 리스트에 포함된 복수의 질문 각각에 대한 답변을 입력할 수 있다. 질문 리스트에 대한 답변이 완료된 경우, 고객 단말 장치는 질문 리스트의 답변을 나타내는 고객 답변 정보를 전자 장치로 전송할 수 있다. 고객 단말 장치는 통증 부위와 관련된 통증 수지를 전자 장치로 전송할 수 있다. 통증 수치는, 예를 들어, 통증 평가 척도(visual analogue scale, VAS)에 관한 수치일 수 있다. 예를 들어, 통증 수치는 0부터 10 중 하나로 선택될 수 있다. 고객 단말 장치는 사용자 입력에 기초하여 통증 부위와 관련된 진단 영상을 촬영 및 데이터를 전송할 수 있다. 예를 들어, 고객은 고객 단말 장치의 카메라를 통해 통증 부위와 관련된 진단 영상을 촬영하거나 관련 데이터를 전송할 수 있다. 고객 단말 장치는 촬영한 통증 부위와 관련된 진단 영상을 전자 장치 로 전송할 수 있다. 전자 장치는 고객 단말 장치로부터 수신한 통증 부위와 관련된 고객 답변 정보, 통증 수치 및 진단 영상을 분석함으로써, 고객의 통증 부위에 관한 통증 유발 원인을 판단할 수 있다. 전자 장치는 상술한 고객의 정보에 기초하여, 기 지정된 복수의 통증 유발 원인 중 고객의 통증 부위에 관한 통증 유발 원인을 판단할 수 있다. 통증 유발 원인을 분석하는 구체적인 방법은 후술하기로 한다. 복수의 통증 유발 원인은, 예시적으로 허리 통증과 관련된, 몸통 회전(trunk rotation), 햄스트링(hamstring), 고관절 외회전(hip joint external rotation), 고관절 내회전(hip joint internal rotation) 및 장요근 스트레 칭(iliopsoas stretching)과, 상하체 통증과 관련된, 흉곽 열림(ribcage open), 둔근 약화(gluteus weak), 기 립근 긴장(erector tight) 및 복압(intral abdominal pressure, IAP)을 포함할 수 있다. 예를 들어, 전자 장 치는 고객 단말 장치로부터 수신한 고객의 통증 부위에 관한 정보를 분석하여, 고객의 통증 부위에 관한 통증 유발 원인이 몸통 회전이라고 판단할 수 있다. 다양한 실시예에 따른 고객 단말 장치는, 통증 부위와 관련된 다양한 분석 결과 및 피드백을 전자 장치 로부터 수신할 수 있다. 고객 단말 장치는 전자 장치로부터 통증 부위에 관한 통증 유발 원인 에 관한 정보를 수신할 수 있다. 고객 단말 장치는 전자 장치로부터 통증 유발 원인과 관련된 적어 도 하나의 운동 영상을 비롯한 솔루션을 수신할 수 있다. 고객 단말 장치는 전자 장치로부터 통증 수치의 변화 이력 및 이를 분석한 결과를 포함하는 분석 리포트를 수신할 수 있다. 통증 수치의 변화 이력이란, 예를 들어, 고객이 고객 단말 장치를 통해 입력한 통증 수치의 이력에 관한 것일 수 있다. 예 를 들어, 통증 수치의 변화 이력이란, 이전에는 통증 수치에 관한 수치인 VAS 수치가 8이었고, 현재는 VAS 수치 가 4로 줄었다는 정보를 나타내는 이력일 수 있다. 다양한 실시예에 따른 치료사 단말 장치는 전자 장치로부터 고객과 관련된 고객 답변 정보 및 통증 수치의 변화 이력을 수신할 수 있다. 치료사는 수신한 정보들에 기초하여, 고객에 대한 물리 치료를 실시하거 나, 기기 및 제품을 추천함으로써 전반적인 솔루션을 제공할 수 있고, 해당 치료의 결과를 치료사 단말 장치 에 입력 및 피드백 받을 수 있다. 물리 치료사는 고객에 대한 평가 정보를 치료사 단말 장치에 입력 할 수 있고, 치료사 단말 장치는 고객에 대한 평가 정보를 전자 장치로 전송할 수 있다. 고객에 대 한 평가 정보는, 예를 들어, 물리 치료에 관한 고객의 현재 상태에 관한 정보일 수 있다. 본 개시의 다양한 실시예에 따르면, 고객은 고객 단말 장치를 통해, 질문 리스트에 답변하고, 통증 부위에 대한 진단 영상을 촬영함으로써, 통증 부위에 대한 통증 유발 원인 및 통증 부위의 회복을 위한 솔루션 을 제공 받을 수 있다. 이 때, 솔루션은 각자 상황에 맞는 운동 영상/기기/제품의 추천을 의미할 수 있다. 예시적으로, 기기는 후술하는 마사지 기구일 수 있고, 제품은 통증 부위에 도포하는 크림 제품일 수 있다. 또한, 고객은 통 증 부위에 대한 분석 결과 및 변화 이력을 제공받음으로써, 지속적으로 통증 부위에 관해서 피드백을 받을 수 있다. 다양한 실시예에 따른 전자 장치는 상기 서비스를 수행 완료한 고객 단말 장치로 소정의 보상을 제공할 수 있다. 보상은, 예를 들어, 상기 서비스를 이용할 때 사용 가능한 포인트(point)일 수도 있고, 암호 화폐(또는 코인)일 수도 있다. 그러나, 본 개시의 실시예에 따른 보상은 이에 국한되지 않는다. 본 개시의 다양한 실시예에 따르면, 복수의 고객으로부터 통증 부위에 관한 다양한 정보를 수신하고, 이러한 정 보를 분석하고 수치화하여 저장함으로써, 통증 정보를 분석하기 위한 최적의 시스템을 구축할 수 있다. 나 아가, 고객의 정보뿐만 아니라, 고객을 치료한 물리 치료사로부터 평가 정보를 수신하여 분석하고 저장함으로써, 통증 정보를 분석하기 위한 최적의 시스템을 구축할 수 있다. 본 개시의 다양한 실시예에 따르면, 물리 치료사는 치료사 단말 장치를 통해 고객들에 대한 다양한 케이스를 경험할 수 있고, 고객들 에 대한 다양한 케이스를 교육 자료로 활용할 수 있다. 도 2는 다양한 실시예에 따른 전자 장치의 구성의 예시도이다. 일 실시예에 따른 전자 장치는 프로세서, 메모리, 통신 회로 및 데이터베이스를 포함 한다. 일실시예에 따른 전자 장치는 상술한 시스템을 운영하기 위한 서버 장치일 수 있다. 프로세서 는 본 문서에 개시된 적어도 하나의 장치들을 포함하거나, 본 문서에 개시된 적어도 하나의 방법을 수행할 수 있다. 메모리는 상술한 방법과 관련된 정보를 저장하거나 상술한 방법이 구현된 프로그램을 저장할 수 있다. 메모리는 휘발성 메모리 또는 비휘발성 메모리일 수 있다. 프로세서는 프로그램을 실행하고, 전자 장치를 제어할 수 있다. 프로세서에 의하여 실행되는 프로그램의 코드는 메모리에 저장될 수 있다. 전자 장치는 입출력 장치(미도시)를 통하여 외부 장치 (예를 들어, 퍼스널 컴퓨터 또는 네트워크)에 연결되고, 데이터를 교환할 수 있다. 프로세서는 전자 장치 의 구성 요소들과 작동적으로 연결될 수 있다. 프로세서는 전자 장치의 다른 구성 요소로부터 수신된 명령 또는 데이터를 메모리에 로드하고 메모리에 저장된 명령 또는 데이터를 처리하고, 결과데이터를 저장할 수 있다. 통신 회로는 외부 장치(예: 고객 단말 장치, 치료사 단말 장치)와 통신 채널을 설립하고, 외부 장치와 다양한 데이터를 송수신할 수 있다. 다양한 실시예에 따르면, 통신 회로는 셀룰러 통신 모듈을 포 함하여 셀룰러 네트워크(예: 3G, LTE, 5G, Wibro 또는 Wimax)에 연결되도록 구성할 수 있다. 다양한 실시예에 따르면, 통신 회로는 근거리 통신 모듈을 포함하여 근거리 통신(예를 들면, Wi-Fi, Bluetooth, Bluetooth Low Energy(BLE), UWB)을 이용해 외부 장치와 데이터 송수신을 할 수 있으나, 이에 제한되지 않는다. 데이터베이스는 다양한 정보를 저장할 수 있다. 데이터베이스는, 프로세서의 제어 하에, 복수 의 고객 각각에 대한 정보를 저장할 수 있다. 고객에 대한 정보는, 예를 들어, 고객의 통증 부위, 통증 수치, 진단 영상, 고객의 데이터, 솔루션에 대한 피드백등을 포함할 수 있다. 데이터베이스는, 프로세서의 제어 하에, 분석한 통증 부위에 관한 통증 유발 원인을 분석한 결과를 고객과 매칭하여 저장할 수 있다. 데이 터베이스는, 프로세서의 제어 하에, 통증 부위와 관련된 통증 수치의 변화 이력을 고객의 정보에 매 칭하여 저장할 수 있다. 데이터베이스는, 프로세서의 제어 하에, 치료사 단말 장치로부터 수신한 고 객에 대한 평가 정보를 고객의 정보에 매칭하여 저장할 수 있다. 데이터베이스는 복수의 통증 유발 원인에 관한 정보를 저장할 수 있다. 데이터베이스는 통증 부위를 회복(또는 치료)하기 위한 복수의 운동 영상을 저장할 수 있다. 데이터베이스는 복수의 통증 유발 원인 각각에 매칭되는 복수의 운동 영상 및 솔루션의 모니터링 데이터를 저장할 수 있다. 다양한 실시예에 따르면, 데이터베이스에 저장된 복수의 고객에 대한 통증 데이터는, BPS(biopsychosocial) 모델을 개발하기 위해 사용될 수 있다. 복수의 고객에 대한 통증 데이터는 최적의 분석 결과를 제공하기 위한 인공지능 모델을 구축하는데 이용될 수 있다. 도 3은 본 개시의 다양한 실시예에 따른 전자 장치의 동작 흐름도이다. 동작 흐름도 300을 참조하면, 다양한 실시예에 따른 전자 장치의 프로세서는, 동작 301에서, 고객 단 말 장치로부터 복수의 통증 부위 중 하나의 통증 부위를 선택하는 요청을 수신한 것에 응답하여, 선택된 통증 부위에 대응하는 질문 리스트를 고객 단말 장치로 전송할 수 있다. 고객 단말 장치는 복수의 통증 부위(예: 상체, 허리, 하체) 중 하나의 통증 부위를 선택하는 사용자 입력을 수신할 수 있다. 예를 들어, 고객이 허리에 통증이 있는 경우, 복수의 통증 부위 중 허리를 선택할 수 있다. 이 경우, 고객 단말 장치(12 0)는 하나의 통증 부위를 선택하는 요청을 전자 장치로 전송할 수 있다. 전자 장치는 하나의 통증 부위를 선택하는 요청을 수신한 것에 응답하여, 선택된 통증 부위에 대응하는 질문 리스트를 식별할 수 있다. 예를 들어, 전자 장치는 복수의 통증 부위 각각에 대응하는 복수의 질문 리스트를 저장할 수 있고, 고객이 선택한 통증 부위에 대응하는 질문 리스트를 식별할 수 있다. 전자 장치의 프로세서는 선택된 통증 부위에 대응하는 질문 리스트를 고객 단말 장치로 전송할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 303에서, 고객 단말 장치로부터 질문 리스트의 답변을 나타 내는 고객 답변 정보를 수신할 수 있다. 고객 단말 장치는 전자 장치로부터 수신한 질문 리스트를 표시할 수 있고, 질문 리스트에 답변을 수행하는 사용자 입력을 수신할 수 있다. 즉, 고객은 고객 단말 장치 를 통해 질문 리스트에 대한 답변을 수행할 수 있다. 질문 리스트는 복수의 질문을 포함할 수 있다. 질문 리스트는 고객의 현재 상태를 파악하기 위한 복수의 기초 질문을 포함할 수 있다. 질문 리스트는, 기 지정된 기간 내에 부상 이력이 있는지에 관한 제1 질문, 신체적으 로 이상 증상이 있는지에 관한 제2 질문, 통증 부위에 관한 불편함이 있는지에 관한 제3 질문, 주된 업무 환경 에 관한 제4 질문, 생활 습관에 대한 제5 질문, 연령에 관한 제6 질문을 포함할 수 있다. 기 지정된 기간 내에 부상 이력이 있는지에 관한 제1 질문은, 예를 들어, \"최근(6개월 이내) 넘어지거나 다친 적이 있나요?\"와 같은 질문일 수 있다. 고객은 고객 단말 장치를 통해 제1 질문에 대해 \"예\" 또는 \"아니 오\"로 답변할 수 있다. 신체적으로 이상 증상이 있는지에 관한 제2 질문은, 예를 들어, \"현재 신체적으로 아래의 이상 증상이 있나 요?\"와 같은 질문일 수 있다. 고객은, 고객 단말 장치를 통해 제2 질문에 대해 \"감각 이상\", \"저림\", \"힘 빠짐\", 또는 \"없음\" 중 하나로 답변할 수 있다. 통증 부위에 관한 불편함이 있는지에 관한 제3 질문은, 예를 들어, \"평소 허리에 불편함이 있으신가요?\"와 같은 질문일 수 있다. 고객은 고객 단말 장치를 통해 제3 질문에 대해 \"불편함 없음\", \"약한 불편함(8 이하)\",또는 \"극심한 불편함(8 이상)\" 중 하나로 답변할 수 있다. 주된 업무 환경에 관한 제4 질문은, 예를 들어, \"현재 주된 업무 환경이 어떠신가요?\"와 같은 질문일 수 있다. 고객은 고객 단말 장치를 통해 제4 질문에 대해 \"고정된 자세로 서서\", \"고정된 자세로 앉아서\", \"서있는 상태로 이동\", 또는 \"복합적\" 중 하나로 답변할 수 있다. 생활 습관에 대한 제5 질문은, 예를 들어, \"다음의 습관이 있으신가요?\"와 같은 질문일 수 있다. 고객은 고객 단말 장치를 통해 제5 질문에 대해, \"의자에 앉아서 양반다리 하기\", \"의자에 앉아서 다리 꼬기\", \"의자에 앉았을 때 다리를 벌려서 앉기\", \"앉을 때 한쪽 무릎을 세워서 앉기\", \"서 있을 때 짝다리로 서있기\", \"팔짱 끼 고 있는 습관\", \"턱 괴고 있는 습관\", \"아래를 보고 걷는 습관\", \"오른손 잡이\", \"왼손 잡이\", 및 \"없음\" 중 적 어도 하나를 선택함으로써 답변할 수 있다. 연령에 관한 제6 질문은, 예를 들어, \"현재 연령대는 어떻게 되나요?\"와 같은 질문일 수 있다. 고객은, 고객 단말 장치를 통해 제6 질문에 대해 \"20대\", \"30대\", \"40대\", \"50대\", \"60대\" 또는 \"70대\" 중 하나로 답변 할 수 있다. 다양한 실시예에 따른 질문 리스트는, 복수의 통증 유발 원인 각각에 대한, 적어도 하나의 테스트 이미지 및 상 기 적어도 하나의 테스트 이미지에 관련된 적어도 하나의 테스트 질문을 더 포함할 수 있다. 질문 리스트는, 예를 들어, 복수의 통증 유발 원인 중 햄스트링에 관한 테스트 이미지(예: 햄스트링의 상태를 판단하기 위한 테스트 영상) 및 이와 관련된 적어도 하나의 테스트 질문을 더 포함할 수 있다. 테스트 질문은 예를 들어, \"허리를 펴고 앉았을 때, 무릎을 펴고 발목을 당겨서 다리를 들어 올렸을 때 허리가 움직이지 않고 들어지나요?\"와 같은 질문일 수 있고, 고객은 고객 단말 장치를 통해 상기 테스트 질문에 대해 \"예\" 또는 \"아니오\"로 답변할 수 있다. 마찬가지의 방법으로, 질문 리스트에는 복수의 통증 유발 원인 각각에 대한, 적어 도 하나의 테스트 이미지 및 이와 관련된 적어도 하나의 테스트 질문이 포함될 수 있다. 다양한 실시예에 따른 프로세서는, 동작 305에서, 고객 단말 장치로부터 선택된 통증 부위와 관련된 통증 수치 및 진단 영상을 수신할 수 있다. 통증 수치는 통증 평가 척도(VAS)에 관한 수치일 수 있고, 이는 0 부터 10 중 하나의 숫자일 수 있다. 예를 들어, 고객 단말 장치는, 선택된 통증 부위에 관련된 통증 수치 가 8이라고 입력하는 사용자 입력을 수신할 수 있고, 선택된 통증 부위에 관련된 통증 수치가 8이라는 정보를 전자 장치로 전송할 수 있다. 진단 영상은 고객이 통증 부위에 관한 활동을 촬영한 영상일 수 있다. 예 를 들어, 고객은 통증 부위에 관한 활동을 고객 단말 장치를 이용하여 촬영하고, 촬영된 영상을 진단 영상 으로서 전자 장치에 전송할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 307에서, 고객 답변 정보, 통증 수치 및 진단 영상에 기초하여, 선택된 통증 부위에 관한 통증 유발 원인을 분석할 수 있으며 이는 일반적인 뼈의 구조만을 가지고 판단하는 단 순한 기계 원리가 아닌 치료사 및 전문가의 임상학적 데이터와 앞에서 수집한 다양한 고객의 정보를 기반으로 평가된다. 프로세서는, 상술한 고객의 정보를 종합적으로 분석하여, 기 지정된 복수의 통증 유발 원인 중, 해당 통증 부위와 관련된 통증 유발 원인이 무엇인지 분석할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 309에서, 복수의 운동 영상 중 분석된 통증 유발 원인과 관련된 적어도 하나의 운동 영상을 선택할 수 있다. 프로세서는 데이터베이스에 저장된 복수의 운동 영상 중 상기 분석된 통증 유발 원인과 관련된 적어도 하나의 운동 영상을 식별할 수 있다. 예를 들어, 복수의 운동 영상 각각은, 복수의 통증 유발 원인 각각과 대응하여 데이터베이스에 저장될 수 있다. 이 경우, 프로세 서는 복수의 운동 영상 중 분석된 통증 유발 원인과 관련된 적어도 하나의 운동 영상을 선택할 수 있다. 또한 고객의 상태에 따라 운동이 아닌 기타 솔루션(기기/제품)을 추천할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 311에서, 선택된 적어도 하나의 운동 영상 및 솔루션을 고객 단말 장치로 전송할 수 있다. 고객 단말 장치는, 사용자 입력에 기초하여, 적어도 하나의 운동 영상을 재 생할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 313에서, 적어도 하나의 운동 영상 및 솔루션이 고객 단말 장치 에서 재생이 완료된 것에 응답하여, 고객 단말 장치로부터, 선택된 통증 부위와 관련된 통증 수치를 재 수신할 수 있다. 고객 단말 장치는 적어도 하나의 운동 영상에 대한 재생이 완료된 경우, 재생 완료 사실을 전자 장치에 통지할 수 있다. 전자 장치는 상기 통지를 수신한 경우, 적어도 하나의 운동 영 상이 고객 단말 장치에서 재생이 완료되었다고 판단할 수 있다.고객 단말 장치는, 적어도 하나의 운동 영상에 대한 재생이 완료된 경우, 통증 부위에 관한 통증 수치를 재입력하는 사용자 입력을 수신할 수 있다. 예를 들어, 고객 단말 장치는 기존에 입력하였던 통증 수치를 표시하면서, 현재 통증 수치를 입력할 수 있는 사용자 인터페이스를 표시할 수 있다. 이 경우, 기존에 입력하 였던 통증 수치는 수정 불가하도록 표시될 수 있다. 고객 단말 장치는 재입력된 통증 부위에 관한 통증 수치를 전자 장치로 전송할 수 있다. 전자 장치는 고객 단말 장치로부터 선택된 통증 부위와 관련된 통증 수치를 재 수신할 수 있다. 예를 들어, 고객은 이전에 통증 부위에 관한 통증 수치가 8이라고 입력할 수 있고, 이후 적어도 하나의 운동 영 상을 통해 운동을 수행하고, 운동을 수행한 이후 현재 통증 부위에 관한 통증 수치가 6으로 낮아졌다고 입력할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 315에서, 선택된 통증 부위와 관련된 통증 수치의 변화 이력을, 고객 단말 장치에 대응하는 고객의 정보에 매칭하여 데이터베이스에 저장할 수 있다. 추가적으로, 다양한 실시예에 따른 프로세서는 고객 단말 장치로 선택된 통증 부위와 관련된 통증 수 치의 변화 이력 및 변화 이력을 분석한 결과를 포함하는 분석 리포트를 미리 설정된 주기로 전송할 수 있다. 예를 들어, 프로세서는, 1주일에 한 번씩 고객에 대한 분석 리포트를 생성하고 고객 단말 장치로 전 송할 수 있다. 변화 이력을 분석한 결과는, 예를 들어, 고객의 통증 정도가 20% 완화되었다는 정보를 포함할 수 있다. 도 4는 본 개시의 다양한 실시예에 따른 전자 장치의 동작 흐름도이다. 구체적으로 도 4는 도 3의 동작 307에 관한 동작 흐름도이다. 동작 흐름도 400을 참조하면, 다양한 실시예에 따른 프로세서는, 동작 410에서, 선택된 통증 부위와 관련 된 진단 영상에 포함된 고객의 통증 부위를 식별할 수 있다. 프로세서는, 고객이 선택된 통증 부위가 진 단 영상에서 어디인지 식별할 수 있다. 예를 들어, 고객이 통증 부위로 허리를 선택한 경우, 진단 영상에서 허 리 부분을 식별할 수 있다. 영상에서 특정 부위를 식별하는 방법은 다양한 인공지능 모듈을 이용하여 수행될 수 있다. 다양한 실시예에 따른 프로세서는, 동작 420에서, 고객의 통증 부위에 포함된 미리 지정된 복수의 포인트 를 식별할 수 있다. 예를 들어, 프로세서는 식별한 허리 부분에 포함되고, 미리 지정된 복수의 포인트(마 킹 지점)를 식별할 수 있다. 복수의 포인트를 식별하는 방법은 다양한 인공지능 모듈을 이용하여 수행될 수 있 다. 다양한 실시예에 따른 프로세서는, 동작 430에서, 진단 영상에 포함된 복수의 포인트의 위치를 트래킹할 수 있다. 프로세서는 진단 영상 내에서 복수의 포인트의 위치의 변화를 트래킹 할 수 있다. 상기 복수 포인트들을 식별하고, 위치를 트래킹하는 방법은 2D에서 포인트들을 특정하는 것뿐만 아니라, 3D에서 포인트들을 특정하는 실시예까지 모두 포함할 수 있다. 예시적으로, 프로세서는 포인트들 간의 깊이(depth) 차 이를 식별함으로써 3차원에서 포인트들의 위치를 트래킹하는 모든 방법을 이용할 수 있다. 그러나, 본 개시의 실시예에 따른 트래킹 방법은 이에 국한되지 않고, 모든 트래킹 방법을 이용할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 440에서, 트래킹된 복수의 포인트의 위치 및 고객 답변 정보에 기 초하여, 기 지정된 복수의 통증 유발 원인 중 선택된 통증 부위에 관한 통증 유발 원인을 식별할 수 있다. 도 5a는 본 개시의 다양한 실시예에 따른 전자 장치의 동작 흐름도이다. 구체적으로 도 5a는 도 3의 동작 307에 관한 동작 흐름도이다. 동작 흐름도 500을 참조하면, 다양한 실시예에 따른 프로세서는, 동작 510에서, 미리 구축된 상관 모델에, 고객 단말 장치로부터 수신한, 고객 답변 정보 및 진단 영상을 입력할 수 있다. 상관 모델은, 기계 학습 알고리즘에 따라 구축된 딥러닝 모델로서, 질문 리스트에 대한 고객의 답변 정보 및 진단 영상을 입력하는 경우, 통증 유발 원인이 무엇인지 출력하도록 학습된 인공지능 모델일 수 있다. 구체적으로, 상관 모델은, 기 계 학습 알고리즘을 통해, 복수의 고객 단말 장치 각각으로부터 수신한 통증 부위에 대한 고객 답변 정보 및 진단 영상의 세트를 입력 데이터로 하고, 상기 통증 부위에 관한 통증 유발 원인들의 세트를 출력 데이터로 하여, 상기 입력 데이터 및 상기 출력 데이터 사이의 상관 관계를 모델링하여 구축된 상관 모델일 수 있다. 즉, 상관 모델은, 복수의 고객 각각에 대한 통증 부위에 대한 고객 답변 정보 및 진단 영상의 세트를 학습용 입 력 데이터로 사용하고, 복수의 통증 유발 원인 중 상기 통증 부위에 관한 통증 유발 원인들의 세트를 학습용 출력 데이터로 하여 학습된 모델일 수 있다. 일 실시예에 따르면, 프로세서는 트래킹된 복수의 포인트의 위치를 상관 모델의 입력 데이터로 더 포함시 킬 수 있고, 통증 부위에 관한 통증 유발 원인들의 세트를 출력 데이터로 함으로써 상관 모델을 학습시킬 수 있 다. 일 실시예에 따르면, 선택된 통증 부위에 관한 통증 유발 원인을 분석하기 위하여, 상술한 상관 모델 이외에도 다양한 기계 학습 모델을 이용할 수 있다. 다양한 기계 학습 모델은, 고객의 통증 부위에 관한 답변 정보 및 진단 영상을 학습용(훈련용) 입력 데이터로 사용하고, 이에 대응하는 통증 유발 원인을 학습용 출력 데이터로 사용하여 학습된 모델일 수 있다. 기계 학습 모델은, 예를 들어, 심층 신경망, 합성곱 신경망, 순환 신경망, 강화 학습 모델 또는 분류-회귀 분석을 위한 머신 러닝 모델 중 하나일 수 있다. 다양한 실시예에 따른 프로세서는, 동작 520에서, 상관 모델로부터, 상기 선택된 통증 부위에 관한 통증 유발 원인을 획득할 수 있다. 프로세서는, 획득한 통증 유발 원인을 고객의 통증 유발 원인으로 판단할 수 있다. 도 5b는 본 개시의 다양한 실시예에 따른 복수의 포인트들을 도시한 도면이다. 도 5b를 참조하면, 프로세서는 사용자의 복수의 포인트들을 식별함으로써 각 포인트들을 트래킹할 수 있고, 트래킹된 포인트들의 위치 관계를 획득할 수 있다. 예시적으로, 프로세서는 사용자가 허리를 숙이는 동작에서 각 포인트들의 위치 관계를 획득할 수 있고, 위치 관계에 기초하여 요추 굴곡의 각도와 골반 굴곡의 각도를 판단할 수 있다. 프로세서는 포인트들의 위치 관계에 따라 판단된 신체부위 상태(예시적으로, 요추 굴곡 각도 및 골반 굴곡 각도)를 상관 모델의 입력 데이터로 하고, 통증 부위에 관한 통증 유발 원인들의 세트를 출력 데이터로 하는 학 습 데이터 세트를 생성할 수 있고, 학습 데이터 세트에 기초하여 상관 모델을 학습시킬 수 있다. 이 때, 출력 데이터로 하는 통증 유발 원인은 전문가의 평가 코멘트로 구성될 수 있다. 즉, 각 신체부위 상태에 대한 전문가의 평가 코멘트가 학습 데이터 세트가 될 수 있다. 예시적으로, 전문가의 평가 코멘트는 \"골반이 앞 으로 숙여지지 않고 허리만 숙여짐\", \"골반에서의 숙여짐이 발생하지 않고 허리에서만 숙여짐이 발생함\", \"무릎 을 뒤로 보내는 보상으로 골반의 운동을 보상한 상태로 허리만 숙여짐\"이 서로 다른 신체부위 상태에 대응되는 학습 데이터 세트로 구성될 수 있다. 이에 따라, 프로세서는 추론 과정에서 입력되는 신체 포인트들의 위치 변화에 따라 전문가의 평가 코멘트 가 통증 유발 원인으로 생성할 수 있다. 본 개시의 실시예에 따른 프로세서는 26개의 포인트들을 식별하고, 포인트들의 위치를 트래킹함으로써, 특 정 포인트만 한정되어 통증 유발 원인을 분석하는데에 사용하지 않고, 모든 포인트들을 활용하여 통증 유발 원 인을 정확하게 분석할 수 있는 방법을 제공할 수 있다. 도 6은 본 개시의 다양한 실시예에 따른 전자 장치의 동작 흐름도이다. 동작 흐름도 600을 참조하면, 다양한 실시예에 따른 전자 장치의 프로세서는, 동작 610에서, 치료사 단말 장치로, 고객에 관한 고객 답변 정보, 분석한 통증 유발 원인 및 통증 수치의 변화 이력등을 전송할 수 있다. 물리 치료사는 치료사 단말 장치로 수신한 상기 정보들에 기초하여, 보다 적합한 치료를 고객에 게 제공할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 620에서, 치료사 단말 장치로부터 고객에 대한 평가 정보를 수신할 수 있다. 물리 치료사는 고객에 대한 물리 치료를 완료한 이후, 치료사 단말 장치로 고객에 대한 평가 정보를 입력할 수 있다. 고객에 대한 평가 정보는, 예를 들어, 고객의 통증 부위에 관한 현재 상태, 수행 한 물리 치료 및 솔루션에 관한 정보를 포함할 수 있다. 다양한 실시예에 따른 프로세서는, 동작 630에서, 고객에 대한 평가 정보를 고객의 정보에 매칭하여 데이 터베이스에 저장할 수 있다. 프로세서는 치료사 단말 장치로부터 수신한 고객에 대한 평가 정 보도 고객의 정보에 매칭하여 저장함으로써, 고객에게 보다 정확한 분석 결과를 제공할 수 있다. 도 3 내지 6에 도시된 흐름도에서 프로세스 단계들, 방법 단계들, 알고리즘들 등이 순차적인 순서로 설명되었지 만, 그러한 프로세스들, 방법들 및 알고리즘들은 임의의 적합한 순서로 작동하도록 구성될 수 있다. 다시 말하 면, 본 개시의 다양한 실시예들에서 설명되는 프로세스들, 방법들 및 알고리즘들의 단계들이 본 개시에서 기술된 순서로 수행될 필요는 없다. 또한, 일부 단계들이 비 동시적으로 수행되는 것으로서 설명되더라도, 다른 실 시예에서는 이러한 일부 단계들이 동시에 수행될 수 있다. 또한, 도면에서의 묘사에 의한 프로세스의 예시는 예시된 프로세스가 그에 대한 다른 변화들 및 수정들을 제외하는 것을 의미하지 않으며, 예시된 프로세스 또는 그의 단계들 중 임의의 것이 본 개시의 다양한 실시예들 중 하나 이상에 필수적임을 의미하지 않으며, 예시된 프로세스가 바람직하다는 것을 의미하지 않는다. 도 7은 본 개시의 실시예에 따른 마사지 기구 및 제어 장치를 도시한 도면이다. 도 7을 참조하면, 마사지 기구는 복수의 영역으로 구분될 수 있고, 프로세서는 서로 독립적으로 각 영역을 동작시킬 수 있다. 예시적으로, 마사지 기구는 허리를 지탱하는 의자 및 바닥 등의 구조물과 사용자 사이에 배치되어 사용될 수 있다. 제어 장치는 마사지 기구에 연결될 수 있고, 마사지 기구로부터 측정된 센싱 값을 디스플레이하며, 마사지 모드를 선택할 수 있다. 제어 장치는 터치 스크린으로 구성되어 횟수, 시간, 강도 변화를 출력할 수 있다. 예시적으로, 제어 장치는 압력 등 정보를 게이지 이미지로 표시할 수 있고, 압력 수치 변화를 표시할 수도 있다. 또한, 제어 장치는 시간, 강도, 횟수 등 마사지 진행 상태를 텍스트로 표시할 수 있고, 모드 정 보 등 실제 수행중인 내용에 대한 정보를 송출할 수도 있다. 제어 장치는 사용자로부터 모드를 입력 받을 수 있고, 모드는 예시적으로 선택, 평가, 치료 모드로 구성될 수 있다. 선택 모드는 신체 부위를 선택하는 모드로서 신체 부위는 허리, 다리 등으로 사용자에 의해 선택될 수 있다. 평가 모드는 일상적 활동, 운동 능력을 선택하는 모드로 구성될 수 있다. 치료 모드는 열치료, 마사지, 저주파 등을 선택하는 모드로 구성될 수 있다. 제어 장치는 진행 상태 표시 부위를 포함할 수 있고, 현재 진행중인 신체 부위 표시 및 능력 정도를 표시하"}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 이미지 표시 부위 및 정리 요약 공간으로 구성되는 텍스트 표시 부위로 구성될 수 있다. 즉, 제어 장치는 마사지 기구에서 센싱된 수치를 디지털로 측정하여 표시할 수 있다. 제어 장치는 인식된 압력을 수치화하여 디스플레이할 수 있고, 어플리케이션 블루투스 등을 통한 데이터 전송을 수행할 수도 있다. 또한, 제어 장치는 부위, 평가, 치료, 모니터링 및 안마 의자 등의 다양한 모드를 선택할 수 있고, 진행 전 후의 데이터를 저장하거나 전송할 수 있다. 제어 장치는 전원이 켜지면 개인 정보등 기존 정보를 연동시킬 수 있다. 이 때, 기존 정보는 어플리케이션 의 연동을 통해 송수신되는 정보일 수 있다. 사용자는 제어 장치를 켜고 모드를 선택하여 마사지 기구 에 일정 수준의 압력을 제공할 수 있다. 제어 장치는 마사지 기구를 통해 부위별 상태 평가를 수행할 수 있고, 부위별 상태 평가는 선술하였으므로 자세한 설명은 생략하도록 한다. 제어 장치는 모드 선택에 따라 선술한 실시예에서 제공하는 솔루션을 실행할 수 있고, 진행 상황 결과 및 모니터링을 어플리케이션과 송수신하고 저장할 수도 있다. 일실시예에 따르면, 통증 유발 원인이 분석되고, 분석된 통증 유발 원인과 관련된 운동 영상이 선택되어 고객 단말 장치로 제공될 때, 프로세서는 기구 제어 신호를 마사지 기구로 전송할 수 있다. 기구 제어 신호는 복 수의 영역들 중 동작시키는 영역에 대한 동작 신호일 수 있고, 마사지 기구는 동작 신호에 기초하여 사용자 에게 전달하는 압력의 크기를 조절할 수 있다. 예시적으로, 복수의 영역들 중 일부 영역은 압력을 높여 외부로 밀어내는 외력을 강하게 조절할 수 있다. 즉, 마사지 기구는 허리 통증을 유발하는 세부 부위에 대해서만 외력을 제공할 수 있다. 일실시예에 따르면, 마사지 기구는 사용자에 의해 가해지는 압력을 측정할 수 있고, 복수의 영역들로 구분 된 마사지 기구는 각 영역들마다 압력을 구분하여 측정할 수 있다. 마사지 기구가 사용자와 바닥 사이 에 배치되어 이용되는 경우, 사용자가 마사지 기구를 허리에 대고 압력 측정 후 한쪽 다리 들기를 통해 압 력 변화가 가장 크게 식별되는 영역이 어느 영역인지 여부를 판단할 수 있다. 또는, 마사지 기구가 사용자 와 의자 사이에 배치되어 이용되는 경우, 일정 시간마다 측정함으로써 압력 변화가 가장 크게 식별되는 영역이 어느 영역인지 여부를 판단할 수 있다. 프로세서는 각 영역마다 식별된 압력에 대한 정보를 상관 모델의 입력 데이터로 구성할 수 있고, 입력 데 이터에 기초하여 상관 모델을 학습시키거나 추론 데이터를 생성할 수 있다. 마사지 기구는 외부로 밀어내는 외력을 조절하는 것뿐만 아니라, 저주파 등 치료 파장을 제공할 수 있고, 진동 등 물리적 치료를 제공할 수도 있으며, 열 에너지를 제공할 수도 있다. 상기 방법은 특정 실시예들을 통하여 설명되었지만, 상기 방법은 또한 컴퓨터로 읽을 수 있는 기록매체에 컴퓨 터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의 해 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광데이터 저장장치 등을 포함할 수 있다. 또한, 컴퓨 터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고, 상기 실시예들을 구현하기 위한 기능적인(functional) 프로그"}
{"patent_id": "10-2023-0010433", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "램, 코드 및 코드 세그먼트들은 본 개시가 속하는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 이상 일부 실시예들과 첨부된 도면에 도시된 예에 의해 본 개시의 기술적 사상이 설명되었지만, 본 개시가 속하 는 기술 분야에서 통상의 지식을 가진 자가 이해할 수 있는 본 개시의 기술적 사상 및 범위를 벗어나지 않는 범 위에서 다양한 치환, 변형 및 변경이 이루어질 수 있다는 점을 알아야 할 것이다. 또한, 그러한 치환, 변형 및 변경은 첨부된 청구범위 내에 속하는 것으로 생각되어야 한다."}
{"patent_id": "10-2023-0010433", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 다양한 실시예에 따른 진단 영상의 피드백을 이용하여 통증 데이터를 판단하는 서비스를 제공 하기 위한 시스템을 도시한 도면이다. 도 2는 다양한 실시예에 따른 전자 장치의 구성의 예시도이다. 도 3은 본 개시의 다양한 실시예에 따른 전자 장치의 동작 흐름도이다. 도 4는 본 개시의 다양한 실시예에 따른 전자 장치의 동작 흐름도이다. 도 5a는 본 개시의 다양한 실시예에 따른 전자 장치의 동작 흐름도이다. 도 5b는 본 개시의 다양한 실시예에 따른 복수의 포인트들을 도시한 도면이다. 도 6은 본 개시의 다양한 실시예에 따른 전자 장치의 동작 흐름도이다. 도 7은 본 개시의 실시예에 따른 마사지 기구 및 제어 장치를 도시한 도면이다."}
