{"patent_id": "10-2022-0095679", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0115860", "출원번호": "10-2022-0095679", "발명의 명칭": "다차원 데이터 기반 질병 진단 시스템 및 방법", "출원인": "주식회사 데이터스펙트럼리서치", "발명자": "한만우"}}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 차원의 제1 검사 결과 데이터를 전처리하여, 제1 크기의 제1 특징화 벡터를 생성하는 단계;상기 제1 차원과 다른 제2 차원의 제2 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제2 특징화 벡터를 생성하는 단계;상기 제1 차원 및 상기 제2 차원과 다른 제3 차원의 제3 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제3특징화 벡터를 생성하는 단계;상기 제1 내지 제3 특징화 벡터를 연결하여, 입력 데이터를 생성하는 단계; 및상기 입력 데이터를 미리 학습된 인공지능 모델에 제공하여, 질병 분류 정보를 생성하는 단계를 포함하는 다차원 데이터 질병 진단 방법."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 제1 검사 결과 데이터는 CT 검사 결과 데이터 및 MRI 검사 결과 데이터 중 적어도 하나를 포함하고, 상기 제2 검사 결과 데이터는 X-ray 검사 결과 데이터 및 초음파 검사 결과 데이터 중 적어도 하나를 포함하고, 상기 제3 검사 결과 데이터는 혈액 검사 결과 데이터를 포함하는 다차원 데이터 질병 진단 방법."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 제1 특징화 벡터를 생성하는 단계는,상기 제1 검사 결과 데이터에 대해 합성곱 연산하여, 상기 제1 특징화 벡터를 생성하는 단계를 더 포함하는 다차원 데이터 질병 진단 방법."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 제2 특징화 벡터를 생성하는 단계는,상기 제2 검사 결과 데이터를 상기 제1 차원으로 변환하는 단계; 및상기 제1 차원으로 변환된 상기 제2 검사 결과 데이터에 대해 합성곱 연산하여, 상기 제2 특징화 벡터를 생성하는 단계를 더 포함하는 다차원 데이터 질병 진단 방법."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 제3 검사 결과 데이터는 제1 데이터 타입의 제1 검사 항목 및 제2 데이터 타입의 제2 검사 항목을 포함하고,공개특허 10-2023-0115860-3-상기 제3 특징화 벡터를 생성하는 단계는,상기 제1 검사 항목을 범주형 및 수치형 중 어느 하나로 분류하는 단계;상기 제2 검사 항목을 상기 범주형 및 상기 수치형 중 어느 하나로 분류하는 단계;상기 범주형으로 분류된 검사 항목을 원핫인코딩(one-hot encoding)하여 범주 데이터로 변환하는 단계;상기 수치형으로 분류된 검사 항목을 정규화하여 수치 데이터로 변환하는 단계;상기 범주 데이터 및 상기 수치 데이터를 연결하여 상기 제3 검사 결과 데이터를 재생성하는 단계; 및상기 제3 검사 결과 데이터를 오토인코더에 제공하여 상기 제3 특징화 벡터를 생성하는 단계를 더 포함하는 다차원 데이터 질병 진단 방법."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 차원의 제1 검사 결과 데이터를 전처리하여, 제1 크기의 제1 특징화 벡터를 생성하고, 상기 제1 차원과 다른 제2 차원의 제2 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제2 특징화 벡터를 생성하고, 상기 제1 차원 및 상기 제2 차원과 다른 제3 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제3 특징화 벡터를 생성하는전처리부;상기 제1 내지 제3 특징화 벡터를 연결하여, 입력 데이터를 생성하는 연결부; 및상기 입력 데이터를 미리 학습된 인공지능 모델에 제공하여, 질병 분류 정보를 생성하는 질병진단부를 포함하는다차원 데이터 질병 진단 시스템."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 제1 검사 결과 데이터는 CT 검사 결과 데이터 및 MRI 검사 결과 데이터 중 적어도 하나를 포함하고, 상기 제2 검사 결과 데이터는 X-ray 검사 결과 데이터 및 초음파 검사 결과 데이터 중 적어도 하나를 포함하고, 상기 제3 검사 결과 데이터는 혈액 검사 결과 데이터를 포함하는 다차원 데이터 질병 진단 시스템."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 전처리부는 상기 제1 검사 결과 데이터에 대해 합성곱 연산하여, 상기 제1 특징화 벡터를 생성하는 다차원데이터 질병 진단 시스템."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 전처리부는 상기 제2 검사 결과 데이터를 상기 제1 차원으로 변환하고, 상기 제1 차원으로 변환된 상기 제2 검사 결과 데이터에 대해 합성곱 연산하여, 상기 제2 특징화 벡터를 생성하는 다차원 데이터 질병 진단 시스템."}
{"patent_id": "10-2022-0095679", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,공개특허 10-2023-0115860-4-상기 제3 검사 결과 데이터는 제1 데이터 타입의 제1 검사 결과 및 제2 데이터 타입의 제2 검사 결과를 포함하고,상기 전처리부는 상기 제1 검사 결과를 범주형 및 수치형 중 어느 하나로 분류하고, 상기 제2 검사 결과를 상기범주형 및 상기 수치형 중 어느 하나로 분류하고, 상기 범주형으로 분류된 검사 결과를 원핫인코딩하여 범주 데이터로 변환하고, 상기 수치형으로 분류된 검사 결과를 정규화하여 수치 데이터로 변환하고, 상기 범주 데이터및 상기 수치 데이터를 연결하여 상기 제3 검사 결과 데이터를 재생성하고, 상기 제3 검사 결과 데이터를 오토인코더에 제공하여 상기 제3 특징화 벡터를 생성하는 다차원 데이터 질병 진단 시스템."}
{"patent_id": "10-2022-0095679", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 다차원 데이터 기반 질병 진단 시스템 및 방법을 개시한다. 상기 다차원 데이터 기반 질병 진단 시스 템은, 제1 차원의 제1 검사 결과 데이터를 전처리하여, 제1 크기의 제1 특징화 벡터를 생성하고, 상기 제1 차원 과 다른 제2 차원의 제2 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제2 특징화 벡터를 생성하고, 상기 제 1 차원 및 상기 제2 차원과 다른 제3 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제3 특징화 벡터를 생성 하는 전처리부, 상기 제1 내지 제3 특징화 벡터를 연결하여, 입력 데이터를 생성하는 연결부, 및 상기 입력 데이 터를 미리 학습된 인공지능 모델에 제공하여, 질병 분류 정보를 생성하는 질병진단부를 포함한다."}
{"patent_id": "10-2022-0095679", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다차원 데이터 기반 질병 진단 시스템 및 방법에 관한 것이다. 구체적으로, 본 발명은 차원이 다른 데이터들을 통합 분석하여 질병을 진단하는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0095679", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 실시예에 대한 배경 정보를 제공할 뿐 종래기술을 구성하는 것은 아니다. 질병관리청 국가 건강 정보 포털에 의하면, 질병 진단을 하기 위해 진행하는 검사는 총 57개로 검사 종류 대상 인 검체의 종류와 검사 결과의 데이터 차원 및 형태도 다양하다. 의사는 환자의 질병 진단을 위해 다양한 형태의 검사를 진행하는 경우가 일반적이며, 검사 종류마다 산출되는 다양한 형태의 데이터를 주관적 의견으로 종합하여 진단한다. 일반적으로 많이 진행하는 검사는, CT(Computed Tomography), MRA(Magnetic Resonance Angiography), MRI(Magnetic Resonance Imaging), MR(Magnetic Resonance), X-ray, 초음파(ultrasonography) 및 혈액 검사 (Blood Test) 등이 있다. 정확도 높은 진단을 위해 인공 지능(AI, Artificial intelligence)을 기반으로 진단하는 연구가 시도되고 있으 나, 처리하는 데이터의 차원 및 형태가 다양한 경우가 많아 질병 또는 검사 종류에 따라 구분된 연구 중심으로 연구가 각각 진행되고 있다."}
{"patent_id": "10-2022-0095679", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 과제는, 데이터의 차원 및 형태가 다양한 검사 결과를 통합적으로 고려하여 질병을 진단하는 시스템 을 제공하는 것이다. 또한, 본 발명의 다른 과제는, 데이터의 차원 및 형태가 다양한 검사 결과를 하나의 인공지능 모듈을 이용하여 질병을 진단하는 방법을 제공하는 것이다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2022-0095679", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 본 발명의 몇몇 실시예에 따른 다차원 데이터 질병 진단 방법은, 제1 차원의 제1 검 사 결과 데이터를 전처리하여, 제1 크기의 제1 특징화 벡터를 생성하는 단계, 상기 제1 차원과 다른 제2 차원의 제2 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제2 특징화 벡터를 생성하는 단계, 상기 제1 차원 및 상기 제2 차원과 다른 제3 차원의 제3 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제3 특징화 벡터를 생성 하는 단계, 상기 제1 내지 제3 특징화 벡터를 연결하여, 입력 데이터를 생성하는 단계 및 상기 입력 데이터를 미리 학습된 인공지능 모델에 제공하여, 질병 분류 정보를 생성하는 단계를 포함한다. 또한, 상기 제1 검사 결과 데이터는 CT 검사 결과 데이터 및 MRI 검사 결과 데이터 중 적어도 하나를 포함하고, 상기 제2 검사 결과 데이터는 X-ray 검사 결과 데이터 및 초음파 검사 결과 데이터 중 적어도 하나를 포함하고, 상기 제3 검사 결과 데이터는 혈액 검사 결과 데이터를 더 포함할 수 있다. 또한, 상기 제1 특징화 벡터를 생성하는 단계는, 상기 제1 검사 결과 데이터에 대해 합성곱 연산하여, 상기 제1 특징화 벡터를 생성하는 단계를 더 포함할 수 있다. 또한, 상기 제2 특징화 벡터를 생성하는 단계는, 상기 제2 검사 결과 데이터를 상기 제1 차원으로 변환하는 단 계 및 상기 제1 차원으로 변환된 상기 제2 검사 결과 데이터에 대해 합성곱 연산하여, 상기 제2 특징화 벡터를 생성하는 단계를 더 포함할 수 있다. 또한, 상기 제3 검사 결과 데이터는 제1 데이터 타입의 제1 검사 항목 및 제2 데이터 타입의 제2 검사 항목을 포함하고, 상기 제3 특징화 벡터를 생성하는 단계는, 상기 제1 검사 항목을 범주형 및 수치형 중 어느 하나로 분류하는 단계, 상기 제2 검사 항목을 범주형 및 수치형 중 어느 하나로 분류하는 단계, 상기 범주형으로 분류 된 검사 항목을 원핫인코딩(one-hot encoding)하여 범주 데이터로 변환하는 단계, 상기 수치형으로 분류된 검사 항목을 정규화하여 수치 데이터로 변환하는 단계, 상기 범주 데이터 및 상기 수치 데이터를 연결하여 제3 검사 결과 데이터를 생성하는 단계 및 상기 제3 검사 결과 데이터를 오토인코더에 제공하여 상기 제3 특징화 벡터를 생성하는 단계를 더 포함할 수 있다. 상기 과제를 해결하기 위한 본 발명의 몇몇 실시예에 따른 다차원 데이터 질병 진단 시스템에 있어서, 제1 차원 의 제1 검사 결과 데이터를 전처로 하여, 제1 크기의 제1 특징화 벡터를 생성하고, 상기 제1 차원과 다른 제2 차원의 제2 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제2 특징화 벡터를 생성하고, 상기 제1 차원 및 상기 제2 차원과 다른 제3 검사 결과 데이터를 전처리하여, 상기 제1 크기의 제3 특징화 벡터를 생성하는 전처 리부, 상기 제1 내지 제3 특징화 벡터를 연결하여, 입력 데이터를 생성하는 연결부 및 상기 입력 데이터를 미리 학습된 인공지능 모델에 제공하여, 질병 분류 정보를 생성하는 질병진단부를 포함한다. 또한, 상기 제1 검사 결과 데이터는 CT 검사 결과 데이터 및 MRI 검사 결과 데이터 중 적어도 하나를 포함하고, 상기 제2 검사 결과 데이터는 X-ray 검사 결과 데이터 및 초음파 검사 결과 데이터 중 적어도 하나를 포함하고, 상기 제3 검사 결과 데이터는 혈액 검사 결과 데이터를 포함할 수 있다. 또한, 상기 전처리부는 상기 제1 검사 결과 데이터에 대해 합성곱 연산하여, 상기 제1 특징화 벡터를 생성할 수 있다. 또한, 상기 전처리부는 상기 제2 검사 결과 데이터를 상기 제1 차원으로 변환하고, 상기 제1 차원으로 변환된 상기 제2 검사 결과 데이터에 대해 합성곱 연산하여, 상기 제2 특징화 벡터를 생성할 수 있다. 또한, 상기 전처리부는 상기 제1 검사 항목을 범주형 및 수치형 중 어느 하나로 분류하고, 상기 제2 검사 항목 을 범주형 및 수치형 중 어느 하나로 분류하고, 상기 범주형으로 분류된 검사 항목을 원핫인코딩하여 범주 데이 터로 변환하고, 상기 수치형으로 분류된 검사 항목을 정규화하여 수치 데이터로 변환하고, 상기 범주 데이터 및 상기 수치 데이터를 연결하여 제3 검사 결과 데이터를 생성하고, 상기 제3 검사 결과 데이터를 오토인코더에 제 공하여 상기 제3 특징화 벡터를 생성할 수 있다."}
{"patent_id": "10-2022-0095679", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다차원 데이터 질병 진단 시스템 및 방법은, 차원 및 타입이 다른 데이터들을 전처리하여 하나의 인 공지능 모델을 기초로 질병을 진단할 수 있다. 이에 따라, 각 데이터의 차원에 대응한 인공지능 모델을 각각 구 축할 필요가 없다. 상술한 내용과 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2022-0095679", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 특허청구범위에서 사용된 용어나 단어는 일반적이거나 사전적인 의미로 한정하여 해석되어서는 아 니된다. 발명자가 그 자신의 발명을 최선의 방법으로 설명하기 위해 용어나 단어의 개념을 정의할 수 있다는 원 칙에 따라, 본 발명의 기술적 사상과 부합하는 의미와 개념으로 해석되어야 한다. 또한, 본 명세서에 기재된 실 시예와 도면에 도시된 구성은 본 발명이 실현되는 하나의 실시예에 불과하고, 본 발명의 기술적 사상을 전부 대 변하는 것이 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형 및 응용 가능한 예 들이 있을 수 있음을 이해하여야 한다. 본 명세서 및 특허청구범위에서 사용된 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. '및/또는' 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함 한다. 본 명세서 및 특허청구범위에서 사용된 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서 \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해서 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 또한, 본 발명의 각 실시예에 포함된 각 구성, 과정, 공정 또는 방법 등은 기술적으로 상호 간 모순되지 않는 범위 내에서 공유될 수 있다. 이하에서는, 도 1 내지 도 7을 참조하여 다차원 데이터 질병 진단 시스템에 대해 서술한다. 도 1은 본 발명의 몇몇 실시예들에 따른 다차원 데이터 질병 진단 시스템의 블록도이다. 도 2는 도 1의 전처리 부를 설명하기 위한 블록도이다.도 1을 참조하면, 다차원 데이터 질병 진단 시스템은 전처리부, 연결부 및 질병진단부를 포함한다. 전처리부는 제공받은 둘 이상의 검사 결과 데이터(D)를 전처리하여 특징화 벡터(FV)를 생성할 수 있다. 예 를 들어, 도 2를 참조하면, 전처리부는 제1 전처리부, 제2 전처리부 및 제3 전처리부를 포함할 수 있다. 제1 전처리부는 제1 검사 결과 데이터(D1)를 제공받아 제1 특징화 벡터(FV1)를 생성할 수 있다. 제2 전처리부는 제2 검사 결과 데이터(D2)를 제공받아 제2 특징화 벡터(FV2)를 생성할 수 있다. 제3 전처리 부는 제3 검사 결과 데이터(D3)를 제공받아 제3 특징화 벡터(FV3)를 생성할 수 있다. 검사 결과 데이터(D)는 질병을 진단하기 위해 실시하는 검사의 검사 결과물로, 서로 다른 차원의 데이터를 포함 할 수 있다. 예를 들어, 검사 결과 데이터(D)는 CT(computed tomography) 검사 결과 데이터, MRI(magnetic resonance imaging) 검사 결과 데이터, X-ray 검사 결과 데이터, 초음파 결과 데이터 및 혈액 검사 결과 데이터 를 포함할 수 있다. 예를 들어, CT 검사 결과 데이터는 3차원 데이터일 수 있다. 또한, MRI 검사 결과 데이터는 3차원 데이터일 수 있다. 또한, X-ray 검사 결과 데이터 및 초음파 결과 데이터는 2차원 데이터일 수 있다. 추 가적으로, 혈액 검사 결과 데이터는 서로 다른 데이터 타입인 복수의 결과 데이터를 포함할 수 있다. 다만, 이 러한 설명은 단순히 예시적인 것이며, 본 발명의 실시예가 이에 한정되는 것은 아니다. 설명의 편의를 위해, 제1 차원의 결과 데이터는 제1 검사 결과 데이터(D1)이고, 제2 차원의 결과 데이터는 제2 검사 결과 데이터(D2)이고, 제3 차원의 결과 데이터는 제3 검사 결과 데이터(D3)로 정의한다. 몇몇 실시예에 따 르면, 제3 검사 결과 데이터(D3)는 서로 다른 데이터 타입을 포함할 수 있다. 이에 대한 구체적 설명은 후술한 다. 도 1 및 도 2를 참조하면, 연결부는 전처리부에서 생성한 둘 이상의 특징화 벡터(FV)를 연결하여 입력 데이터(I)를 생성할 수 있다. 예를 들어, 연결부는 둘 이상의 특징화 벡터(FV)를 결합(concatenate)하여 각 특징화 벡터(FV)의 손실 없이 입력 데이터(I)를 생성할 수 있다. 몇몇 실시예에 따르면 연결부는 둘 이상의 특징화 벡터(FV)를 미리 정한 순서를 기초로 결합할 수 있다. 다른 몇몇 실시예에 따르면, 연결부는 둘 이상의 특징화 벡터(FV)를 미리 정한 기준을 기초로 결합할 수 있 다. 예를 들어, 미리 정한 기준은, 특징화 벡터(FV)의 기초가 되는 검사 결과 데이터(D)의 차원 순서에 따를 수 있으나 실시예들이 이에 제한되지는 않는다. 다른 몇몇 실시예에 따르면, 연결부는 특징화 벡터(FV)의 기초가 되는 검사 결과 데이터(D)의 차원이 서로 동일한 특징화 벡터(FV)끼리 먼저 그룹핑하고, 그룹핑된 특징화 벡터(FV)를 특정 기준에 따라 결합할 수 있다. 설명의 편의를 위해, 복수의 특징화 벡터(FV)가 결합된 데이터를 입력 데이터(I)로 정의한다. 다시 말해서, 연 결부는 복수의 특징화 벡터(FV)를 연결하여, 입력 데이터(I)를 생성할 수 있다. 다만, 이러한 설명은 단순 히 예시적인 것이며, 본 발명의 실시예가 이에 한정되는 것은 아니다. 본 발명의 다른 실시예에서 다양하게 변 형되어 실시될 수 있다. 질병진단부는 입력 데이터(I)를 제공받을 수 있다. 질병진단부는 제공받은 입력 데이터(I)를 인공지능 모델에 제공하여, 질병 분류 정보를 생성할 수 있다. 여기에서, 인공지능 모델은 검사 결과 데이터(D)를 기초로 질병을 진단하는 인공지능 모델이다. 인공지능 모델 은, 미리 학습된 인공지능 모델로서 검사 결과 데이터와 다른 검사 결과 학습 데이터로 학습될 수 있다. 또한, 인공지능 모델은 지도 학습 또는 비지도 학습 중 어느 하나를 기준으로 학습될 수 있다. 다만, 이러한 설명은 단순히 예시적인 것이며, 실시예들이 이에 제한되지는 않는다. 질병 분류 정보는 검사 결과 데이터(D)에 대응한 사람의 질병 여부와, 질병 종류 및 질병 진행 단계를 포함할 수 있다. 질병 종류는 고지혈증, 당뇨, 갑상선질환, 췌장질환, 신부전, 빈혈, 간질환 및 종양을 포함할 수 있으 며, 진행 단계는 각 질병 종류마다 다를 수 있다. 이는 단순히 예시적인 것으로, 실시예들이 이러한 설명에 제 한되는 것은 아니다. 이하에서는, 도 3 내지 도 7을 참조하여 전처리부에 대해 자세히 설명한다. 도 3은 도 2의 제1 전처리부를 설명하기 위한 도면이다. 도 4는 도 2의 제2 전처리부를 설명하기 위한 도면이다. 도 5는 도 2의 제3 전처리부를 설명하기 위한 도면이다. 도 6은 도 5 및 도 7의 제3 검사 결과 데이터의 예시를 나타내는 도면이다. 도 7은 도 5의 인코딩 모듈을 설명하기 위한 블록도이다. 도 3을 참조하면, 제1 전처리부는 제1 차원의 제1 검사 결과 데이터(D1)를 전처리하여 제1 크기(A*B*C, A, B 및 C는 0 또는 자연수)의 제1 특징화 벡터(FV1)를 생성할 수 있다. 구체적으로, 제1 전처리부는 제1 차원의 제1 검사 결과 데이터(D1)에 대해 합성곱(Convolution) 연산하여 제1 특징화 벡터(FV1)를 생성할 수 있다. 추가적으로, 제1 전처리부는 제1 특징화 벡터(FV1)를 생성함에 있 어서, 풀링(Pooling) 연산을 사용할 수도 있다. 풀링 연산은 평균 풀링 및 최대 풀링 중 어느 하나일 수 있다. 다만, 본 발명의 실시예가 이에 한정되는 것은 아니며, 제1 전처리부는 다양한 연산을 통해 제1 검사 결과 데이터(D1)를 기초로 제1 크기(A*B*C)의 벡터를 생성할 수 있다. 예를 들어, 제1 차원의 제1 검사 결과 데이터(D1)는 3차원의 CT 검사 결과 데이터 및 MRI 검사 결과 데이터 중 적어도 하나를 포함할 수 있다. 다만, 실시예들이 이에 제한되는 것은 아니며, 제1 검사 결과 데이터(D1)는 3차 원으로 결과가 나오는 모든 검사 결과 데이터에 대응할 수 있다. 도 4를 참조하면, 제2 전처리부는 제2 차원의 제2 검사 결과 데이터(D2)에 대해 합성곱 연산하여 제2 특징 화 벡터(FV2)를 생성할 수 있다. 구체적으로, 제2 전처리부는 제2 차원의 제2 검사 결과 데이터(D2)를 제1 차원으로 변환하고, 제1 차원으로 변환된 제2 검사 결과 데이터(D2)에 대해 합성곱 연산하여 제2 특징화 벡터(FV2)를 생성할 수 있다. 제2 차원은 제1 차원과 다른 차원일 수 있다. 예를 들어, 제2 차원은 2차원을 의미할 수 있으나, 실시예들이 이 에 제한되지는 않는다. 즉, 제2 전처리부는 제1 차원과 다른 제2 차원의 제2 검사 결과 데이터(D2)를 제1 차원으로 변환할 수 있다. 제2 전처리부는 제1 차원으로 변환된 제2 검사 결과 데이터(D2)에 대해 합성곱 연산하여 제2 특징화 벡터 (FV2)를 생성할 수 있다. 추가적으로, 제2 전처리부는 제2 특징화 벡터(FV2)를 생성함에 있어서, 풀링 연산 을 추가적으로 사용할 수 있다. 다만, 본 발명의 실시예가 이에 한정되는 것은 아니며, 풀링 연산은 통상의 기 술자가 실시예에 따라 평균 풀링 및 최대 풀링 중 어느 하나를 실시할 수 있다. 다만, 실시예들이 이에 제한되 는 것은 아니며, 제2 전처리부는 다양한 연산을 통해, 제2 검사 결과 데이터(D2)를 기초로 제1 크기(A*B* C)의 벡터를 생성할 수 있다. 몇몇 실시예에 따르면, 제2 검사 결과 데이터(D2)는 2차원의 X-ray 검사 결과 데이터 및 초음파 검사 결과 데이 터 중 적어도 하나를 포함할 수 있다. 다만, 실시예들이 이에 제한되는 것은 아니며, 제2 검사 결과 데이터(D 2)는 2차원으로 결과가 나오는 모든 검사 결과 데이터에 대응할 수 있다. 도 5를 참조하면, 제3 전처리부는 제3 검사 결과 데이터(D3)를 전처리하여 제1 크기(A*B*C)의 제3 특징화 벡터(FV3)를 생성할 수 있다. 제3 전처리부는 분류 모듈(13a), 제1 처리 모듈(13b), 제2 처리 모듈(13c) 및 인코딩 모듈(13d)을 포함할 수 있다. 제3 검사 결과 데이터(D3)는 분류 모듈(13a)에 제공될 수 있다. 분류 모듈(13a)은 제3 검사 결과 데이터(D3)를 제공받아, 이를 제1 데이터 타입(mt1), 제2 데이터 타입(mt2), 제3 데이터 타입(mt3) 및 제4 데이터 타입(mt4) 중 적어도 하나로 분류할 수 있다. 보다 구체적인 설명을 위해 도 6을 더 참고한다. 설명의 편의를 위해, 제3 검사 결과 데이터(D3)가 혈액 검사 결과에 관한 데이터인 것을 예로 들어 설명한다. 도 6을 참조하면, 제1 데이터 타입(mt1)은 범주형 데이터이고, 데이터가 계층적으로 분포할 수 있는 데이터를 포함할 수 있다. 예를 들어, 제1 데이터 타입(mt1)은 혈액 시험반응을 포함할 수 있다. 제2 데이터 타입(mt2)은 범주형 데이터이고, 데이터가 비계층적으로 분포할 수 있는 데이터를 포함할 수 있다. 예를 들어, 제2 데이터 타입(mt2)은 혈액형 및 성별을 포함할 수 있다.제3 데이터 타입(mt3)은 수치형 데이터이고, 데이터의 수치가 연속적인 데이터를 포함할 수 있다. 예를 들어, 제3 데이터 타입(mt3)은 나이, 체중 및 혈압을 포함할 수 있다. 제4 데이터 타입(mt4)은 수치형 데이터이고, 데이터의 수치가 불연속적인 데이터를 포함할 수 있다. 예를 들어, 제4 데이터 타입(mt4)은 백혈구 수, 적혈구 수 및 혈소판 수를 포함할 수 있다. 다만, 이러한 설명은 단순히 예 시적인 것이며, 본 발명의 실시예가 이에 한정되는 것은 아니다. 분류 모듈(13a)은 제1 데이터 타입(mt1) 및/또는 제2 데이터 타입(mt2)으로 분류된 데이터를 제1 처리 모듈 (13b)에 제공할 수 있다. 다시 말해서, 분류 모듈(13a)은 범주형 데이터를 제1 처리 모듈(13b)에 제공할 수 있 다. 제1 처리 모듈(13b)은 제공받은 데이터를 원핫인코딩(one-hot encoding)하고, 원핫인코딩된 데이터를 인코 딩 모듈(13d)에 제공할 수 있다. 원핫인코딩은 데이터를 목록화하고, 각 목록에 대한 이진 값을 생성하는 것이다. 제1 처리 모듈(13b) 은 범주형 데이터인 제1 및 제2 데이터 타입(mt1, mt2)의 데이터를 원핫인코딩하여 수치형으로 전처리할 수 있다. 또한, 분류 모듈(13a)은 제3 데이터 타입(mt3) 및 제4 데이터 타입(mt4)으로 분류된 데이터를 제2 처리 모듈 (13c)에 제공할 수 있다. 다시 말해서, 분류 모듈(13a)은 수치형 데이터를 제2 처리 모듈(13c)에 제공할 수 있 다. 제2 처리 모듈(13c)은 제공받은 데이터를 정규화하고, 정규화된 데이터를 인코딩 모듈(13d)에 제공할 수 있 다. 예를 들어, 제2 처리 모듈(13c)은 제공받은 데이터를 최소-최대 정규화(min-max normalization)하여 인코딩 모 듈(13d)에 제공할 수 있다. 최소-최대 정규화는 검사 결과로 가능한 최소값을 0으로 정하고, 검사 결과로 가능 한 최대값을 1로 정하여 분류할 검사 결과 값을 정규화하는 방식이다. 몇몇 실시예에 따르면, 인코딩 모듈(13d)은 제1 처리 모듈(13b)로부터 원핫인코딩된 데이터를 제공받고, 제2 처 리 모듈(13c)로부터 정규화된 데이터를 제공받을 수 있다. 다만, 이는 예시적인 설명일 뿐이며 실시예들이 이에 제한되는 것은 아니다. 본 발명의 기술 분야에서 통상의 지식을 가진 자는, 필요에 따라 원핫인코딩 및 정규화 외에도 다른 전처리 과정을 이용할 수 있을 것이다. 제1 처리 모듈(13b)의 출력과, 제2 처리 모듈(13c)의 출력은 인코딩 모듈(13d)에 제공될 수 있다. 인코딩 모듈 (13d)은 제1 처리 모듈(13b)의 출력과 제2 처리 모듈(13c)의 출력을 이용하여 제3 특징화 벡터(FV3)를 생성할 수 있다. 다시 말해서, 제3 전처리부는 서로 다른 데이터 타입을 포함하는 제3 검사 결과 데이터(D3)를 분류하고, 분 류된 제3 검사 결과 데이터(D3)를 전처리하여, 제1 크기(A*B*C)의 제3 특징화 벡터(FV3)를 생성할 수 있다. 이하에서는, 도 7을 참조하여, 본 발명의 다른 몇몇 실시예들에 따른 전처리부를 설명한다. 도 7을 참조하면, 전처리부는 오토인코더를 포함할 수 있다. 예를 들어, 오토인코더는 검사 결과 데이터(D)를 제공받아 제1 크기인 특징화 벡터(FV)를 생성할 수 있다. 오토인코더는 인코더(EN) 및 디코더(DC)를 포함할 수 있다. 또한, 오토인코더는 인코더(EN) 및 디코더 (DC)를 통해 전달받은 데이터와 동일한 출력 데이터를 생성할 수 있다. 예를 들어, 인코더(EN)는 제공받은 검사 결과 데이터(D)를 압축시켜 제1 크기(A*B*C)인 특징화 벡터(FV)로 축소시킬 수 있다. 디코더(DC)는 특징화 벡터 (FV)를 검사 결과 데이터(D)로 동일하게 변환하여 출력할 수 있다. 이때, 오토인코더는 제공받은 검사 결과 데이터(D)와, 디코더(DC)를 통해 생성된 검사 결과 데이터(D)의 오 차를 산출할 수 있다. 또한, 오차가 미리 정한 기준에 부합하는 경우, 전처리부는 인코더(EN)가 생성한 벡터를 최종적으로 특징화 벡터(FV)로 정할 수 있다. 이와 반대로, 오차가 미리 정한 기준에 부합하지 못한 경우, 전처리부는 오차가 미리 정한 기준에 부합할 수 있도록 가중치를 업데이트하여 특징화 벡터(FV)를 생성할 수 있다. 다만, 이러한 설명은 단순히 예시적인 것이며, 실시예들이 이러한 설명에 제한되는 것은 아니다. 오토인코더는 LSTM 오토인코더일 수 있으며, 본 발명의 다른 실시예에서 다양하게 변형되어 실시될 수 있다. 제1 전처리부, 제2 전처리부 및 제3 전처리부 중 적어도 하나는 오토인코더를 포함할 수 있다. 또한, 제3 전처리부의 인코딩 모듈(13d)는 오토인코더일 수 있다. 다만, 이러한 설명은 단순히 예시적 인 것으로, 본 발명의 실시예들이 이러한 설명에 제한되는 것은 아니다. 이하에서는, 도 8 내지 도 11을 참조하여, 본 발명의 몇몇 실시예들에 따른 다차원 데이터 기반 질병 진단 방법 에 대해 설명하도록 한다. 도 8은 본 발명의 몇몇 실시예들에 따른 다차원 데이터 질병 진단 방법을 세부적으로 설명하기 위한 순서도이다. 도 9 내지 도 11은 도 8의 특징화 벡터를 생성하는 방법을 세부적으로 설명하기 위한 순서도이다. 도 8을 참조하면, 전처리부는 서로 다른 차원인 둘 이상의 검사 결과 데이터(D)를 각각 전처리하여 둘 이상 의 특징화 벡터(FV)를 생성할 수 있다(S100). 예를 들어, 전처리부는 검사 결과 데이터(D)를 검사 결과 데 이터(D)의 차원에 기초하여 전처리하고. 검사 결과 데이터(D)에 대응한 특징화 벡터(FV)를 생성할 수 있다. 즉, 제1 차원의 제1 검사 결과 데이터(D1)를 전처리하는 방법은, 제1 차원과 다른 제2 차원의 제2 검사 결과 데이터 (D2)를 전처리하는 방법과 다를 수 있다. 다만, 이러한 설명은 단순히 예시적인 것이며, 본 발명의 실시예가 이 에 한정되는 것은 아니다. 검사 결과 데이터(D)는 질병을 진단하기 위해 실시하는 검사의 결과물로, 서로 다른 차원의 데이터를 포함할 수 있다. 예를 들어, 검사 결과 데이터(D)는 3차원 데이터인 CT 검사 결과 데이터 및 MRI 검사 결과 데이터를 포함 할 수 있다. 또한, 검사 결과 데이터(D)는 2차원 데이터인 X-ray 검사 결과 데이터 및 초음파 결과 데이터를 포 함할 수 있다. 또한, 검사 결과 데이터(D)는 서로 다른 데이터 타입(mt)인 복수의 결과 데이터를 포함할 수 있다. 예를 들어, 검사 결과 데이터(D)는 혈액 검사 결과 데이터를 포함할 수 있다. 다만, 이러한 설명은 단순히 예시적인 것이며, 본 발명의 실시예가 이에 한정되는 것은 아니다. 전처리부가 특징화 벡터(FV)를 생성하는 방법은, 도 9 내지 도 11을 참조하여 후술하도록 한다. 이어서, 연결부는 둘 이상의 특징화 벡터(FV)를 연결하여 입력 데이터(I)를 생성할 수 있다(S200). 예를 들 어, 연결부는 전처리부에서 생성한 제1 크기(A*B*C)의 둘 이상의 특징화 벡터(FV)를 결합하여 입력 데 이터(I)를 생성할 수 있다. 몇몇 실시예에 따르면 연결부는 둘 이상의 특징화 벡터(FV)를 미리 정한 순서를 기초로 결합할 수 있다. 다른 몇몇 실시예에 따르면, 연결부는 둘 이상의 특징화 벡터(FV)를 미리 정한 기준을 기초로 결합할 수 있 다. 예를 들어, 미리 정한 기준은, 특징화 벡터(FV)의 기초가 되는 검사 결과 데이터(D)의 차원 순서에 따를 수 있으나 실시예들이 이에 제한되지는 않는다. 또 다른 몇몇 실시예에 따르면, 연결부는 특징화 벡터(FV)의 기초가 되는 검사 결과 데이터(D)의 차원이 서 로 동일한 특징화 벡터(FV)끼리 먼저 그룹핑하고, 그룹핑된 특징화 벡터(FV)를 특정 기준에 따라 결합할 수 있 다. 다만, 이러한 설명은 단순히 예시적인 것이며, 본 발명의 실시예가 이에 한정되는 것은 아니다. 본 발명의 다른 실시예에서 다양하게 변형되어 실시될 수 있다. 이어서, 연결부는 생성한 입력 데이터(I)를 질병진단부에 제공할 수 있다. 질병진단부는 입력 데이 터(I)를 학습된 인공지능 모델에 제공하여, 질병 분류 정보를 생성할 수 있다(S300). 여기에서, 인공지능 모델은 검사 결과 데이터(D)를 기초로 질병을 진단하는 인공지능 모델이다. 인공지능 모델 은 ANN(Artificial Neural Network), CNN(Convolutional Neural Network), RNN(Recurrent Neural Network) 및 GAN(Graph Neural Network) 및 오토인코더(Autoencoder) 중 적어도 어느 하나를 포함할 수 있다. 또한, 인공지 능 모델은 서로 다른 둘 이상의 뉴럴 네트워크를 포함한 앙상블 네트워크 모델일 수 있다. 추가적으로, 인공지능 모델은 검사 결과 데이터(D)와 다른 검사 결과 학습 데이터로 미리 학습될 수 있으며, 학습은 지도 학습 또는 비지도 학습 중 어느 하나일 수 있다. 다만, 이러한 설명은 단순히 예시적인 것이며, 실 시예들이 이러한 설명에 제한되는 것은 아니다. 질병 분류 정보는 검사 결과 데이터(D)에 대응한 사람의 질병 여부와, 질병 종류 및 질병 진행 단계를 포함할 수 있다. 질병 분류 정보는 앞서 설명하였음으로 자세한 설명은 생략하도록 한다. 이하에서는, 전처리부가 검사 결과 데이터(D)를 전처리하여 특징화 벡터(FV)를 생성하는 방법에 대해 서술 한다. 또한, 중복된 설명은 생략하도록 한다. 도 9를 참조하면, 제1 전처리부는 제1 차원의 제1 검사 결과 데이터(D1)를 수신할 수 있다(S110). 여기에서 제1 차원의 제1 검사 결과 데이터(D1)는 3차원의 CT 검사 결과 데이터 및 MRI 검사 결과 데이터를 포함할 수 있 다. 다만 실시예들이 이에 제한되는 것은 아니며, 제1 검사 결과 데이터(D1)는 3차원으로 결과가 나오는 모든 검사 결과 데이터에 대응할 수 있다. 이어서, 제1 전처리부는 제1 검사 결과 데이터(D1)에 대해 합성곱 연산하여, 제1 특징화 벡터(FV1)를 생성 할 수 있다(S111). 추가적으로, 제1 전처리부는 제1 특징화 벡터(FV1)를 생성함에 있어서, 풀링 연산을 사용할 수 있다. 풀링 연산은 평균 풀링 및 최대 풀링 중 어느 하나일 수 있으며, 본 발명의 실시예가 이에 한정되는 것은 아니다. 다시 말해, 제1 전처리부는 다양한 연산을 통해 제1 검사 결과 데이터(D1)를 기초로 제1 크기(A*B*C)의 벡 터를 생성할 수 있다. 또한, 제1 전처리부는 제1 검사 결과 데이터(D1)에 대해 합성곱 연산 외 공지된 다양 한 연산을 적용할 수 있음은 통상의 기술자에게 자명하다. 도 10을 참조하면, 제2 전처리부는 제2 차원의 제2 검사 결과 데이터(D2)를 수신할 수 있다(S120). 제2 차 원은 제1 차원과 다른 차원일 수 있다. 예를 들어, 제2 차원은 2차원을 의미할 수 있으나, 실시예들이 이에 제 한되지는 않는다. 이어서, 제2 전처리부는 제2 검사 결과 데이터(D2)를 제1 차원으로 변환할 수 있다(S121). 예를 들어, 제2 차원이 2차원인 경우, 제2 전처리부는 2차원인 제2 검사 결과 데이터(D2)를 제1 차원인 3차원으로 변환할 수 있다. 즉, 제2 전처리부는 제1 차원과 다른 제2 차원의 제2 검사 결과 데이터(D2)를 제1 차원으로 변환할 수 있다. 이어서, 전처리부는 제1 차원으로 변환된 제2 검사 결과 데이터(D2)에 대해 합성곱 연산하여, 제2 특징화 벡터(FV2)를 생성할 수 있다(S122). 추가적으로, 제2 전처리부는 제2 특징화 벡터(FV2)를 생성함에 있어서, 풀링 연산을 추가적으로 사용할 수 있다. 다만, 본 발명의 실시예가 이에 한정되는 것은 아니며, 풀링 연산은 통상의 기술자가 실시예에 따라 평균 풀링 및 최대 풀링 중 어느 하나를 실시할 수 있다. 다만, 실시예들이 이 에 제한되는 것은 아니다. 즉, 제2 전처리부는 다양한 연산을 통해, 제2 검사 결과 데이터(D2)를 기초로 제1 크기(A*B*C)의 제2 특징 화 벡터(FV2)를 생성할 수 있다. 몇몇 실시예에 따르면, 제2 검사 결과 데이터(D2)는 2차원의 X-ray 검사 결과 데이터 및 초음파 검사 결과 데이 터 중 적어도 하나를 포함할 수 있다. 다만, 실시예들이 이에 제한되는 것은 아니며, 제2 검사 결과 데이터(D 2)는 2차원으로 결과가 나오는 모든 검사 결과 데이터에 대응할 수 있다. 도 11을 참조하면, 제3 전처리부는 제공받은 제3 검사 결과 데이터(D3)를 제1 데이터 타입(mt1), 제2 데이 터 타입(mt2), 제3 데이터 타입(mt3) 및 제4 데이터 타입(mt4) 중 적어도 하나로 분류할 수 있다(S130). 또한, 제1 내지 제4 데이터 타입(mt1 내지 mt4)을 쉽게 설명하고자, 검사 결과가 혈액 검사인 경우를 예로 들어 설명한다. 제1 데이터 타입(mt1)은 범주형 데이터이고, 데이터가 계층적으로 분포할 수 있는 데이터를 포함할 수 있다. 예 를 들어, 제1 데이터 타입(mt1)은 혈액 시험반응율을 포함할 수 있다. 제2 데이터 타입(mt2)은 범주형 데이터이고, 데이터가 비계층적으로 분포할 수 있는 데이터를 포함할 수 있다. 예를 들어, 제2 데이터 타입(mt2)은 혈액형 및 성별을 포함할 수 있다. 제3 데이터 타입(mt3)은 수치형 데이터이고, 데이터의 수치가 연속적인 데이터를 포함할 수 있다. 예를 들어, 제3 데이터 타입(mt3)은 나이, 체중 및 혈압을 포함할 수 있다. 제4 데이터 타입(mt4)은 수치형 데이터이고, 데이터의 수치가 불연속적인 데이터를 포함할 수 있다. 예를 들어, 제4 데이터 타입(mt4)은 백혈구 수, 적혈구 수 및 혈소판 수를 포함할 수 있다. 다만, 이러한 설명은 단순히 예 시적인 것이며, 본 발명의 실시예가 이에 한정되는 것은 아니다. 이어서, 제3 전처리부는 제1 및/또는 제2 데이터 타입으로 분류된 데이터를 원핫인코딩하여 인코딩 모듈 (13d)에 제공할 수 있다(S131). 또한, 제3 전처리부는 제3 및/또는 제4 데이터 타입으로 분류된 데이터를 정규화하여 인코딩 모듈(13d)에 제공할 수 있다(S132). 원핫인코딩 및 정규화는 공지된 기술이며, 앞서 설명하였음으로 자세한 설명은 생략한다. 이어서, 인코딩 모듈(13d)은 원핫인코딩된 데이터 및/또는 정규화된 데이터를 기초로 제3 특징화 벡터를 생성할 수 있다(S133). 예를 들어, 인코딩 모듈(13d)은 제공받은 데이터를 오토인코더에 제공함으로써 제1 크기인 제3 특징화 벡터를 생성할 수 있다. 다만, 이러한 설명은 단순히 예시적인 것으로, 본 발명의 실시예들이 이러한 설명에 제한되는 것은 아니다. 이하에서는, 도 12을 참조하여, 본 발명의 또 다른 몇몇 실시예들에 따른 특징화 벡터를 생성하는 방법을 서술 한다. 도 12는 본 발명의 또 다른 몇몇 실시예들에 따른 특징화 벡터를 생성하는 방법을 설명하기 위한 순서도이다. 도 12를 참조하면, 전처리부는 검사 결과 데이터(D)를 오토인코더에 제공하여 제1 크기인 벡터를 생성 할 수 있다(S140). 예를 들어, 제1 전처리부는 제1 검사 결과 데이터(D1)를 오토인코더에 제공하여 제1 크기인 벡터를 생성할 수 있다. 또한, 제2 전처리부는 제2 검사 결과 데이터(D2)를 오토인코더에 제공 하여 제1 크기인 벡터를 생성할 수 있다. 또한, 제3 전처리부는 제3 검사 결과 데이터(D3)를 오토인코더 에 제공하여 제1 크기인 벡터를 생성할 수 있다. 다만, 이러한 설명은 단순히 예시적인 것으로, 본 발명의 실시예들이 이러한 설명에 제한되는 것은 아니다. 오토인코더는 인코더(EN) 및 디코더(DC)를 포함할 수 있다. 또한, 오토인코더는 인코더(EN) 및 디코더 (DC)를 통해 전달받은 데이터와 동일한 출력 데이터를 생성할 수 있다. 예를 들어, 인코더(EN)는 제공받은 검사 결과 데이터(D)를 압축시켜 제1 크기(A*B*C)인 출력 데이터로 축소시킬 수 있다. 디코더(DC)는 인코더(EN)의 출 력 데이터를 검사 결과 데이터(D)로 동일하게 변환하여 출력할 수 있다. 이어서, 전처리부는 디코더(DC)가 출력한 출력 데이터와, 인코더(EN)가 제공받은 검사 결과 데이터(D)의 오 차를 산출할 수 있다(S141). 이어서, 오차가 미리 정한 기준에 부합하는 경우, 전처리부는 인코더(EN)의 출력 데이터를 최종적으로 특징 화 벡터(FV)로 추출할 수 있다(S143). 예를 들어, 오차가 미리 정한 기준보다 작은 경우, 전처리부는 인코 더(EN)의 출력 데이터를 특징화 벡터(FV)로 추출할 수 있다. 이와 반대로, 오차가 미리 정한 기준에 부합하지 못한 경우, 전처리부는, 오차가 미리 정한 기준에 부합할 수 있도록 오토인코더의 가중치를 업데이트하여 특징화 벡터(FV)를 추출할 수 있다(S144). 예를 들어, 오차 가 미리 정한 기준보다 큰 경우, 전처리부는 오토인코더의 가중치를 업데이트하고, 업데이트된 오토인 코더를 통해 특징화 벡터(FV)를 추출한다. 다만, 이러한 설명은 단순히 예시적인 것이며, 실시예들이 이러한 설명에 제한되는 것은 아니다. 도 13은 다차원 데이터 질병 진단 방법을 수행하는 시스템의 하드웨어 구현을 설명하기 위한 도면이다. 도 13을 참조하면, 본 발명의 몇몇 실시예들에 따른 다차원 데이터 질병 진단 시스템은 전자 장치로 구현 될 수 있다. 전자 장치는 컨트롤러(1010, controller), 입출력 장치(1020, I/O), 메모리 장치(1030, memory device), 인터페이스(1040, interface) 및 버스(1050, bus)를 포함할 수 있다. 컨트롤러, 입출력 장치, 메모리 장치 및/또는 인터페이스는 버스를 통하여 서로 결합될 수 있다. 이때, 버스는 데이터들이 이동되는 통로(path)에 해당한다. 구체적으로, 컨트롤러는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit), 마이크로프로세서, 디지털 신호 프로세스, 마이크로컨트롤 러, 어플리케이션 프로세서(AP, application processor) 및 이들과 유사한 기능을 수행할 수 있는 논리 소자들 중에서 적어도 하나를 포함할 수 있다. 입출력 장치는 키패드(keypad), 키보드, 터치스크린 및 디스플레이 장치 중 적어도 하나를 포함할 수 있 다. 메모리 장치는 데이터 및/또는 프로그램 등을 저장할 수 있다. 인터페이스는 통신 네트워크로 데이터를 전송하거나 통신 네트워크로부터 데이터를 수신하는 기능을 수행 할 수 있다. 인터페이스는 유선 또는 무선 형태일 수 있다. 예컨대, 인터페이스는 안테나 또는 유 무선 트랜시버 등을 포함할 수 있다. 도시하지 않았지만, 메모리 장치는 컨트롤러의 동작을 향상시 키기 위한 동작 메모리로서, 고속의 디램 및/또는 에스램 등을 더 포함할 수도 있다. 메모리 장치는 내부 에 프로그램 또는 어플리케이션을 저장할 수 있다. 본 발명의 실시예들에 따른 다차원 데이터 질병 진단 시스템은 각각 복수의 전자 장치가 네트워크를 통해 서 서로 연결되어 형성된 시스템일 수 있다. 이러한 경우에는 각각의 모듈 또는 모듈의 조합들이 전자 장치 로 구현될 수 있다. 단, 본 실시예가 이에 제한되는 것은 아니다. 추가적으로, 다차원 데이터 질병 진단 시스템은 워크스테이션(workstation), 데이터 센터, 인터넷 데이터 센터 (internet data center(IDC)), DAS(direct attached storage) 시스템, SAN(storage area network) 시스템, NAS(network attached storage) 시스템, RAID(redundant array of inexpensive disks, or redundant array of independent disks) 시스템, 및 EDMS(Electronic Document Management) 시스템 중 적어도 하나로 구현될 수 있 으나, 본 실시예가 이에 제한되는 것은 아니다. 또한, 다차원 데이터 질병 진단 시스템은 네트워크를 통해서 외부 장치에 질병 분류 정보를 제공할 수 있다. 네 트워크는 유선 인터넷 기술, 무선 인터넷 기술 및 근거리 통신 기술에 의한 네트워크를 포함할 수 있다. 유선 인터넷 기술은 예를 들어, 근거리 통신망(LAN, Local area network) 및 광역 통신망(WAN, wide area network) 중 적어도 하나를 포함할 수 있다. 무선 인터넷 기술은 예를 들어, 무선랜(Wireless LAN: WLAN), DMNA(Digital Living Network Alliance), 와이브 로(Wireless Broadband: Wibro), 와이맥스(World Interoperability for Microwave Access: Wimax), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), IEEE 802.16, 롱 텀 에볼루션(Long Term Evolution: LTE), LTE-A(Long Term Evolution-Advanced), 광대역 무선 이동 통신 서비스 (Wireless Mobile Broadband Service: WMBS) 및 5G NR(New Radio) 기술 중 적어도 하나를 포함할 수 있다. 단, 본 실시예가 이에 제한되는 것은 아니다. 근거리 통신 기술은 예를 들어, 블루투스(Bluetooth), RFID(Radio Frequency Identification), 적외선 통신 (Infrared Data Association: IrDA), UWB(Ultra-Wideband), 지그비(ZigBee), 인접 자장 통신(Near Field Communication: NFC), 초음파 통신(Ultra Sound Communication: USC), 가시광 통신(Visible Light Communication: VLC), 와이 파이(Wi-Fi), 와이 파이 다이렉트(Wi-Fi Direct), 5G NR (New Radio) 중 적어도 하 나를 포함할 수 있다. 단, 본 실시예가 이에 제한되는 것은 아니다. 네트워크를 통해서 통신하는 다차원 데이터 질병 진단 시스템은 이동통신을 위한 기술표준 및 표준 통신 방식을 준수할 수 있다. 예를 들어, 표준 통신 방식은 GSM(Global System for Mobile communication), CDMA(CodeDivision Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTEA(Long Term Evolution-Advanced) 및 5G NR(New Radio) 중 적어도 하나를 포함할 수 있다. 단, 본 실시예가 이에 제한되는 것은 아니다. 이상의 설명은 본 실시예의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 실시예가 속하는 기술 분 야에서 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변 형이 가능할 것이다. 따라서, 본 실시예들은 본 실시예의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위 한 것이고, 이러한 실시예에 의하여 본 실시예의 기술 사상의 범위가 한정되는 것은 아니다. 본 실시예의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0095679", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 몇몇 실시예들에 따른 다차원 데이터 질병 진단 시스템의 블록도이다. 도 2는 도 1의 전처리부를 설명하기 위한 블록도이다. 도 3은 도 2의 제1 전처리부를 설명하기 위한 도면이다. 도 4는 도 2의 제2 전처리부를 설명하기 위한 도면이다. 도 5는 도 2의 제3 전처리부를 설명하기 위한 도면이다. 도 6은 도 5 및 도 7의 제3 검사 결과 데이터의 예시를 나타내는 도면이다. 도 7은 본 발명의 다른 몇몇 실시예들에 따른 도 2 내지 도5의 전처리부를 설명하기 위한 블록도이다. 도 8은 본 발명의 몇몇 실시예들에 따른 다차원 데이터 질병 진단 방법을 세부적으로 설명하기 위한 순서도이다. 도 9 내지 도 11은 도 8의 특징화 벡터를 생성하는 방법을 세부적으로 설명하기 위한 순서도이다. 도 12는 본 발명의 또 다른 몇몇 실시예들에 따른 특징화 벡터를 생성하는 방법을 설명하기 위한 순서도이다. 도 13은 다차원 데이터 질병 진단 방법을 수행하는 시스템의 하드웨어 구현을 설명하기 위한 도면이다."}
