{"patent_id": "10-2025-7001583", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0024996", "출원번호": "10-2025-7001583", "발명의 명칭": "채널 상태 정보 결정 방법, 전자 설비 및 저장 매체", "출원인": "지티이 코포레이션", "발명자": "루 자오후아"}}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "N 개의 채널 정보에 따라 M 개의 채널 정보를 획득하는 단계;상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 단계; 및상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하는 단계; 를 포함하며, 여기서 N은 1보다 큰 정수이고, M은 1보다 크거나 같은 정수인 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 N 개의 채널 정보는 참조 슬롯 이전의 채널 정보이고, 상기 M 개의 채널 정보는 참조 슬롯 이후의 채널 정보인 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 단계는,상기 M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 단계를 포함하며, 여기서 M은 양의 정수이고, K는M보다 작거나 같은 양의 정수인 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 단계는,상기 M 개의 채널 정보를 각각에 대응되는 슬롯의 크기에 따라 K 개의 채널 정보 그룹으로 분할하는 단계; 및상기 K 개의 채널 정보 그룹을 K 개의 제2 유형 프리코딩 정보로 처리하는 단계; 를 포함하며, 여기서 상기 K및 상기 M은 1보다 크거나 같은 정수이고, 상기 K는 상기 M보다 작거나 같은 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3 항에 있어서,상기 M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 단계는,상기 M 개의 채널 정보를 상기 M 개의 채널 정보가 위치하는 슬롯의 크기에 따라 순차적으로 인코딩한 후 하나의 상기 채널 상태 정보로 처리하는 단계를 포함하는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3 항에 있어서,상기 M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 단계는,상기 M 개의 채널 정보를 M 개의 채널 상태 정보로 처리하는 단계를 포함하며, 여기서 하나의 채널 정보는 하나의 채널 상태 정보에 대응하는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3 항에 있어서,공개특허 10-2025-0024996-3-상기 M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 단계는,상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에순차적으로 매핑하는 단계를 포함하는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 슬롯 크기에 따라 결정되거나,상기 K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 인덱스 크기에 따라 결정되는채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에순차적으로 매핑하는 단계는:상기 업링크 전송 자원을 K 개의 시간 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 시간영역 자원 그룹에 매핑하는 것-여기서, k는 K보다 작거나 같은 양의 정수이고;상기 업링크 전송 자원을 K 개의 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 주파수 영역 자원 그룹에 매핑하는 것;상기 업링크 전송 자원을 K 개의 시간 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 시간 주파수 영역 자원 그룹에 매핑하는 것; 중 하나를 포함하는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제4 항에 있어서,상기 K 개의 채널 정보 그룹 중의 i 번째 상기 채널 정보 그룹은 Xi 개의 채널 정보를 포함하며, 여기서 Xi는양의 정수이고, i=1, …, K인 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7 항에 있어서,상기 K 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하는 단계는,하나의 채널 상태 정보 보고에 대응되는 전송 자원에서 상기 K 개의 채널 정보의 채널 상태 정보를 전송하는 단계를 포함하는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항 또는 제11 항에 있어서,제1 지시 정보를 피드백하는 단계를 더 포함하고, 상기 제1 지시 정보는 채널 상태 정보 유형을 지시하도록 구성되는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제3 항에 있어서,상기 K 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하는 단계는,K 개의 채널 상태 정보 보고에 대응하는 전송 자원에서 상기 K 개의 채널 정보의 채널 상태 정보를 전송하는 단계를 포함하는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2025-0024996-4-제13 항에 있어서,상기 K 개의 채널 상태 정보 보고의 보고 식별 정보는 동일한 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서,상기 K 개의 채널 상태 정보 보고의 보고 식별 정보는 상이한 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13 항에 있어서,상기 K 개의 채널 상태 정보 보고는 하나의 슬롯에서 보고되는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13 항에 있어서,상기 K 개의 채널 상태 정보 보고는 K 개의 슬롯에서 보고되는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1 항에 있어서,상기 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보에 대응하는 채널 상태 정보를 전송하는 전송 자원에 대응하는 슬롯이 더 작은 것;상기 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보를 전송하는 전송 자원에 대응하는 슬롯이 더 작은것;상기 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보에 대응하는 채널 상태 정보 보고에 대응하는 슬롯이 더 작은 것;상기 채널 상태 정보에 대응하는 슬롯이 작을수록, 상기 채널 상태 정보에 대응하는 채널 상태 정보 보고에 대응하는 슬롯이 더 작은 것;상기 채널 상태 정보에 대응하는 슬롯이 작을수록, 상기 채널 상태 정보를 전송하는 전송 자원에 대응하는 슬롯이 더 작은 것; 중 하나를 더 포함하는 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1 항에 있어서,상기 M 개의 채널 정보에 대응하는 채널 상태 정보의 제1 결정 시간은 상기 N 개의 채널 정보의 채널 상태 정보를 결정하는 제2 결정 시간보다 작은 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "채널 상태 정보를 획득하는 단계; 및상기 채널 상태 정보에 대응하는 M 개의 채널 정보 또는 M 개의 채널 정보의 채널 상태 정보를 결정하는 단계;를 포함하며, 여기서 상기 M 개의 채널 정보는 N 개의 정보에 의해 결정되고, N은 1보다 큰 정수이고, M은 1보다 크거나 같은 정수인 채널 상태 정보 결정 방법."}
{"patent_id": "10-2025-7001583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "하나 이상의 프로세서;하나 이상의 프로그램을 저장하도록 구성된 메모리; 를 포함하며, 상기 하나 이상의 프로그램이 상기 하나 이상의 프로세서에 의해 실행될 경우, 상기 하나 이상의 프로세서가 제1 항 내지 제20 항 중 어느 한 항에 따른 방법을 구현하도록 하는 전자 설비.공개특허 10-2025-0024996-5-청구항 22 컴퓨터 프로그램이 저장된 컴퓨터 판독 가능한 저장 매체에 있어서,상기 컴퓨터 프로그램이 프로세서에 의해 실행될 경우, 제1 항 내지 제20 항 중 어느 한 항에 따른 방법을 구현하는 컴퓨터 판독 가능한 저장 매체."}
{"patent_id": "10-2025-7001583", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원 실시예는 채널 상태 정보 결정 방법, 전자 설비 및 저장 매체를 제공하며, 해당 방법은, N 개의 채널 정 보에 따라 M 개의 채널 정보를 획득하는 단계; 상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 단 계; 및 상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하는 단계; 를 포함하며, 여기서 N은 1보다 큰 정수이고, M은 1보다 크거나 같은 정수이다."}
{"patent_id": "10-2025-7001583", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "[관련 출원에 대한 상호 참조] 본 출원은 2022년 07월 18일에 중국 특허청에 제출된 출원번호가 202210843620.6인 중국 특허 출원의 우선권을 주장하는 바, 상기 출원의 전부 내용은 참조로서 본 출원에 포함된다."}
{"patent_id": "10-2025-7001583", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "본 출원은 무선통신 기술분야에 관한 것으로, 특히 채널 상태 정보 결정 방법, 전자 설비 및 저장 매체에 관한 것이다."}
{"patent_id": "10-2025-7001583", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 무선통신 기술의 발전에 따라 인공지능(Artificial Intelligence, AI)을 무선통신 시스템에 도입하는 것이 공통된 인식으로 광범위해졌다. 무선통신 시스템에서 AI가 응용되는 하나의 주요 시나리오는 채널 상태 정보 (Channel State Information, CSI)의 예측이며, AI의 강력한 특징 추출 능력으로 인해 과거 채널 정보의 특징 을 추출하여 추출된 과거 채널 정보의 특징에 따라 미래의 채널 정보를 예측할 수 있다. 예를 들어, CSI 피드백 에서 어느 한 참조 슬롯 n에서 참조 슬롯 n 이전의 N 개의 슬롯의 채널 정보에 따라 참조 슬롯 n 이후의 M 개의 슬롯의 채널 정보를 예측한다. 물론, N 개 슬롯의 채널 정보로부터 미래의 M 개 슬롯의 채널 정보를 AI가 아닌 방식으로 예측할 수도 있다. 그리고 상기 M 개의 채널 정보를 채널 상태 정보로 처리한다. 그러나 상기 M 개의 채널 정보를 채널 상태 정보로 처리하고, 채널 상태 정보를 피드백하는 방법은 현재로서는 여전히 연구가 필요 하다."}
{"patent_id": "10-2025-7001583", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원 실시예는 예측된 채널 정보의 채널 상태 정보 결정을 구현하고, 채널 전송 품질을 개선하며 사용자의 사용 경험을 향상시킬 수 있는 채널 상태 정보 결정 방법, 전자 설비 및 저장 매체를 제공한다."}
{"patent_id": "10-2025-7001583", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원 실시예는 채널 상태 정보 결정 방법을 제공하며, 해당 방법은, N 개의 채널 정보에 따라 M 개의 채널 정보를 획득하는 단계; 상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 단계; 상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하는 단계; 를 포함하며, 여기서 N은 1보다 큰 정수 이고, M은 1보다 크거나 같은 정수이다. 본 출원 실시예는 채널 상태 정보 결정 방법을 더 제공하며, 해당 방법은, 채널 상태 정보를 획득하는 단계; 상기 채널 상태 정보에 대응하는 M 개의 채널 정보 또는 M 개의 채널 정보의 채널 상태 정보를 결정하는 단계; 를 포함하며, 여기서 상기 M 개의 채널 정보는 N 개의 정보에 의해 결정되고, N은 1보다 큰 정수이고, M은 1보 다 크거나 같은 정수이다. 본 출원 실시예는 전자 설비를 더 제공하며, 해당 전자 설비는, 하나 이상의 프로세서; 하나 이상의 프로그램을 저장하도록 구성된 메모리; 를 포함하며, 상기 하나 이상의 프로그램이 상기 하나 이상 의 프로세서에 의해 실행될 경우, 상기 하나 이상의 프로세서가 본 출원 실시예에 따른 임의의 방법을 구현하도 록 한다. 본 출원 실시예는 컴퓨터 프로그램이 저장된 컴퓨터 판독 가능한 저장 매체를 더 제공하며, 상기 컴퓨터 프로그 램이 프로세서에 의해 실행될 경우, 본 출원 실시예에 따른 임의의 방법을 구현한다"}
{"patent_id": "10-2025-7001583", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "여기에 설명된 구체적인 실시는 단지 본 출원을 설명하기 위해 사용될 뿐, 본 출원을 한정하기 위해 사용되지 않는다는 것을 이해해야 한다. 후속의 설명에서, 구성 요소를 나타내기 위해 사용되는 \"모듈\", \"부재\" 또는 \"유닛\" 등과 같은 접미사는 본 출 원의 설명을 유리하게 하기 위해 사용된 것일 뿐, 그 자체로는 특별한 의미를 갖지 않으므로, \"모듈\", \"부재\" 또는 \"유닛\"은 혼합하여 사용될 수 있다. 본 출원의 실시예에서 이동통신망(3세대 이동통신기술(3rd-Generation, 3G), 4세대 이동통신기술(the 4th generation mobile communication technology, 4G), 5세대 이동통신기술(5th-Generation, 5G) 및 미래 이동통 신망을 포함)의 네트워크 아키텍처는 네트워크측 설비(예를 들어 기지국을 포함하지만 이에 한정되지 않음) 및 수신측 설비(예를 들어 단말을 포함하지만 이에 한정되지 않음)를 포함할 수 있다. 또한, 본 예시에서, 다운링 크의 제1 통신 노드(제1 통신 노드 설비라고도 함)는 기지국측 설비일 수 있고, 제2 통신 노드(제2 통신 노드 설비라고도 함)는 단말측 설비일 수 있으며, 물론 업링크의 제1 통신 노드가 단말측 설비일 수 있고, 제2 통신 노드가 기지국측 설비일 수도 있음을 이해해야 한다. 두 통신 노드가 설비 대 설비인 통신에서, 제1 통신 노드 와 제2 통신 노드가 모두 기지국 또는 단말일 수 있다. 본 출원에서 기지국은 롱텀에볼루션(Long Term Evolution, LTE), 롱텀에볼루션 어드밴스드(Long Term Evolution advanced, LTE-A)의 기지국 또는 진화형 기지국(Evolutional Node B, eNB 또는 eNode B), 5G 네트워 크의 기지국 설비, 또는 미래 통신 시스템의 기지국 등이 될 수 있으며, 기지국에는 다양한 매크로 기지국, 마 이크로 기지국, 홈 기지국, 무선 원격 조정, 재구성 가능한 지능형 표면(Reconfigurable Intelligent Surfaces, RISs), 라우터, 무선 와이파이(Wireless Fidelity, WIFI) 설비 또는 프라이머리 셀(primary cell)과 세컨더리 셀(secondary cell) 등 다양한 네트워크측 설비가 포함될 수 있다. 본 출원에서, 단말은 무선 송수신기능을 구비하는 설비로서, 실내 또는 실외, 핸드헬드, 웨어러블 또는 차량탑 재를 포함한 육상에 배치될 수 있고, 또는 수상(예를 들어 선박 등)에 배치될 수도 있으며, 또는 공중(예를 들 어 비행기, 기구 및 위성 등)에 배치될 수도 있다. 상기 단말은 휴대폰(mobile phone), 태블릿 컴퓨터(Pad), 무 선 송수신 기능을 구비하는 컴퓨터, 가상현실(Virtual Reality, VR) 단말, 증강현실(Augmented Reality, AR) 단말, 산업 제어(industrial control)에서의 무선 단말, 자율주행(self driving)에서의 무선 단말, 원격진료 (remote medical)에서의 무선 단말, 스마트 그리드(smart grid)에서의 무선 단말, 운송 보안(transportation safety)에서의 무선 단말, 스마트 시티(smart city)에서의 무선 단말, 스마트 홈(smart home)에서의 무선 단말 등일 수 있다. 본 출원의 실시예는 응용 시나리오에 대해 한정하지 않는다. 단말은 때로 사용자, 사용자 설비 (User Equipment, UE), 접속 단말, UE 유닛, UE국, 이동국, 이동대, 원격국, 원격 단말, 모바일 설비, UE 단말, 무선 통신 설비, UE 프록시 또는 UE 장치 등으로 칭할 수 있다. 본 출원의 실시예에서는 이에 대해 한정 하지 않는다. 본 출원에서, 상위 계층 시그널링은 무선 자원 제어(Radio Resource Control, RRC), 미디어 액세스 제어-제어 유닛(Media Access Control control element, MAC CE)을 포함하지만 이에 한정되지 않으며, 기지국 및 단말 간 은 물리 계층 시그널링도 전송 가능하며, 예를 들어 물리적 다운링크 제어 채널(Physical Downlink Control CHannel, PDCCH)에서 물리 계층 시그널링을 전송하고, 물리적 업링크 제어 채널(Physical Uplink Control CHannel, PUCCH)에서 물리 계층 시그널링을 전송한다. 본 출원에서, 여러 파라미터에 대한 지시(Indicator)를 인덱스(Index), 또는 식별자(Identifier, ID)라고 칭할 수도 있으며, 이는 완전히 등가적인 개념이다. 예를 들어, 무선 시스템의 자원 식별자의 경우, 무선 시스템의 자원은 하나의 참조신호 자원, 참조신호 자원 그룹, 참조신호 자원 구성, 채널 상태 정보(Channel State Information, CSI) 보고, CSI 보고 집합, 단말, 기지국, 패널, 신경망, 하위 신경망, 신경망 레이어 등에 대응 하는 인덱스 중 하나를 포함하지만 이에 한정되지 않는다. 기지국은 다양한 상위 계층 시그널링이나 물리 계층 시그널링을 통해 하나 또는 한 그룹의 자원의 식별자를 단말에게 지시할 수 있다. 일부 실시예에서, 인공지능(Artificial Intelligence, AI)은 기계 학습(Machine learning, ML), 심층 학습, 강 화 학습, 전이 학습, 심층 강화 학습, 메타 학습 등 자가 학습 기능을 구비하는 설비, 컴포넌트, 소프트웨어, 모듈을 포함한다. 일부 실시예에서, 인공지능은 인공지능 네트워크(또는 신경망)를 통해 구현되며, 신경망은 복 수 개의 계층을 포함하고, 각각의 계층은 적어도 하나의 노드를 포함한다. 일 예시에서, 신경망은 입력층, 출력 층, 및 적어도 하나의 은닉층을 포함하며, 여기서 각각의 계층의 신경망은 완전 연결 레이어, 덴스 레이어, 컨 볼루션 레이어, 전치 컨볼루션 레이어, 직접 연결 레이어, 활성화 함수, 정규화 레이어, 풀링 레이어 등 중 적 어도 하나를 사용하는 것을 포함하나 이에 한정되지 않는다. 일부 실시예에서, 신경망의 각각의 계층은 잔여 블 록(Residual Network block, 또는 Resnet block), 덴스 네트워크(Densenet Block), 순환 신경망(Recurrent Neural Network, RNN) 등과 같은 하위 신경망을 포함할 수 있다. 인공지능 네트워크는 신경망 모델 및/또는 신 경망 모델에 대응하는 신경망 파라미터를 포함하며, 여기서, 신경망 모델은 네트워크 모델로 약칭할 수 있고, 신경망 파라미터는 네트워크 파라미터로 약칭할 수 있다. 하나의 네트워크 모델은 신경망의 레이어 수, 각 레이 어의 크기, 활성화 함수, 링크 상태, 컨볼루션 커널 크기 및 컨볼루션 스트라이드(stride), 컨볼루션 유형(예: 1D 컨볼루션, 2D 컨볼루션, 3D 컨볼루션, 아트로스 컨볼루션, 전치 컨볼루션, 분리가능 컨볼루션, 그룹화 컨볼 루션, 확장 컨볼루션 등) 등 네트워크 아키텍처를 정의하며, 네트워크 파라미터는 네트워크 모델의 각 계층의 가중치 및/또는 오프셋 및 이들의 값이다. 하나의 네트워크 모델은 상이한 시나리오에 적응하기 위해 여러 세트 의 상이한 신경망 파라미터 값에 대응할 수 있다. 하나의 신경망 모델은 여러 개의 상이한 신경망 파라미터 값 에 대응할 수 있다. 온라인 훈련이나 오프라인 훈련을 통해 신경망의 파라미터를 얻는다. 예를 들어, 적어도 하 나의 샘플과 라벨을 입력함으로써, 상기 신경망 모델을 훈련하여 신경망 파라미터를 얻도록 한다. 일부 실시예에서, 슬롯은 슬롯(slot) 또는 서브 슬롯(mini slot)일 수 있다. 하나의 슬롯 또는 서브 슬롯은 적 어도 하나의 심볼을 포함한다. 여기서 심볼은 하나의 서브 프레임 또는 프레임 또는 슬롯의 시간 단위를 말하며, 예를 들어 하나의 직교 주파수 분할 다중화(Orthogonal Frequency Division Multiplexing, OFDM) 심볼, 단일 반송파 주파수 분할 다중 접속(Single-Carrier Frequency Division Multiple Access, SC-FDMA) 심 볼, 직교 주파수 분할 다중 접속(Orthogonal Frequency Division Multiple Access, OFDMA) 심볼일 수 있다. 일부 실시예에서, 전송은 송신 또는 수신을 포함한다. 예를 들어 데이터 또는 신호를 송신하고, 데이터 또는 신 호를 수신한다. 일부 실시예에서, 채널 상태 정보를 계산하거나 채널 추정, 이동성 관리, 포지셔닝 등을 수행하기 위해, 기지국 또는 사용자는 참조신호(RS, Reference Signal)를 송신해야 하고, 참조신호는 채널 상태 정보 참조신호(ChannelState Information-reference signal, CSI-RS)를 포함하나 이에 한정되지 않으며, 이는 제로 전력 CSI-RS(Zero Power CSI-RS, ZP CSI-RS) 및 비-제로 전력 CSI-RS(Non-Zero Power CSI-RS, NZP CSI-RS)를 포함하며, 채널 상 태 정보 간섭 측정 신호(Channel State Information-Interference Measurement, CSI-IM), 사운딩 참조신호 (Sounding Reference Signal, SRS), 동기화 신호 블록(Synchronization Signals Block, SSB), 물리적 브로드캐 스트 채널(Physical Broadcast Channel, PBCH), 동기 브로드캐스트 블록/물리적 브로드캐스트 채널(SSB/PBCH), NZP CSI-RS는 채널이나 간섭을 측정하는 데 사용될 수 있으며, CSI-RS는 추적에도 사용될 수 있고, 이를 추적 참조신호(CSI-RS for Tracking, TRS)라고 하며, CSI-IM은 일반적으로 간섭 측정에 사용되고, SRS는 채널 추정 에 사용된다. 또한, 참조신호 전송에 사용되는 시간-주파수 자원에 포함되는 자원 요소(Resource Elements, R E)의 집합을 참조신호 자원이라고 하며, 예를 들어 CSI-RS resource, SRS resource, CSI-IM resource, SSB resource이다. 본 문에서, SSB는 동기 신호 블록 및/또는 물리적 브로드캐스트 채널을 포함한다. 일부 실시예에서, 통신 시스템에서 참조신호를 전송하는 자원을 참조신호 자원이라 칭할 수 있고, 시그널링 오 버헤드 등을 절약하기 위해, 복수 개의 참조신호 자원은 복수 개의 집합(예를 들어 CSI-RS resource set, CSI- IM resource set, SRS resource set 등)으로 분할될 수 있으며, 참조신호 자원 집합은 적어도 하나의 참조신호 자원을 포함하고, 복수 개의 참조신호 자원 집합은 모두 동일한 참조신호 자원 설정(예를 들어 CSI-RS resource setting, SRS resource setting, CSI-RS resource setting, 여기서 CSI-RS resource setting은 CSI-IM resource setting과 병합할 수 있으며, 모두 CSI-RS resource setting이라 칭함)을 통해 파라미터 정보를 구성 할 수 있다. 일부 실시예에서, 기지국은 측정 자원 정보를 구성하고, 측정 자원 정보는 채널 상태 정보를 얻는 데 사용된다. 여기서, 측정 자원 정보는 CN개의 채널 측정 자원(Channel Measurement Resource, CMR) 정보와 CM개의 간섭 측 정 자원(Interference Measurement Resource, IMR) 정보를 포함하고, CN과 CM은 양의 정수이다. 기지국은 하나 의 보고 구성(report config) 또는 보고 설정(reporting settings)에 측정 자원 정보를 구성한다. 일부 예시에서, 데이터 또는 신호를 더 잘 전송하기 위해 기지국 또는 단말은 채널 상태 정보를 얻어야 하며, 여기서 채널 상태 정보는 채널 상태 정보-참조신호 자원 지시(CSI-RS Resource Indicator, CRI), 동기 신호 블 록 자원 지시(Synchronization Signals Block Resource Indicator, SSBRI), 참조신호 수신 전력(Reference Signal Received Power, RSRP), 차동 RSRP(Differential RSRP), 채널 품질 지시(Channel Quality Indicator, CQI), 프리코딩 행렬 지시(Precoding Matrix Indicator, PMI), 레이어 지시(Layer Indicator, LI), 랭크 지시 (Rank Indicator, RI), 레벨 1 신호 대 간섭 및 잡음비(Level 1 Signal to Interference plus Noise Ratio, L1-SINR), 차동 L1-SINR(Differential L1-SINR) 중 적어도 하나를 포함할 수 있다. 여기서, 프리코딩 행렬 지 시는 프리코딩 정보의 한 유형, 즉 제1 유형 프리코딩 정보와 같은 코드북을 기반으로 프리코딩 정보를 구현하 는 방법을 포함한다. 프리코딩 정보는 제2 유형 프리코딩 정보와 같은 비코드북을 기반으로 구현하는 방법도 포 함한다. 일 예시에서, 제 1 유형 프리코딩 정보만을 포함하는 CSI를 제 1 유형 CSI라 칭하고, 일 예시에서 제 2 유형 프리코딩 정보를 포함하는 CSI를 제 2 유형 CSI라 칭한다. 일부 실시예에서, 단말과 기지국은 제1 유형 프리코딩 정보를 통해 채널에 매칭되는 채널 상태 정보를 전송하고, 제1 유형 프리코딩 정보는 기존의 채널 특징 행렬 또는 특징 행렬의 양자화된 값을 기반으로 구성된 프리코딩 정보이다. 예를 들어, 코드북 기반의 방법이며, 예를 들어 LTE에서의 N 안테나의 코드북-여기서 N=2, 4, 8, 12, 16, 24, 32이고, NR에서의 type I 코드북, type II 코드북, type II port selection 코드북, enhanced type II 코드북, enhanced type II selection 코드북, Further enhanced type II selection 코드북 에 기반한다. 여기서 코드북은 L개의 코드워드를 포함하며, 이의 주요 사상은 기지국과 단말이 규정된 공식 또 는 표 또는 사전의 방식에 따라 L개의 코드워드를 미리 저장하는 것이다. 일부 예시에서, 코드워드는 하나의 벡 터이다. 일부 예시에서 코드워드는 행렬이고, 행렬은 r개의 열을 포함하며, 각각의 열은 또한 하나의 벡터이다. 바람직하게, 상기 행렬의 각각의 열은 서로 직교한다. 일부 예시에서, 코드워드를 구성하는 벡터는 하나의 0-1 벡터이고, 여기서 전체 벡터 중 한 값만 1이고, 기타 값은 0이다. 일부 예시에서, 코드워드를 구성하는 벡터는 하나의 DFT 벡터(이산 푸리에 변환(Discrete Fourier Transform, DFT))이다. 일부 예시에서, 코드워드를 구성 하는 벡터는 2개 또는 2개 이상의 DFT 벡터의 텐서 곱(kronecker 곱)을 통해 얻은 것이다. 일부 예시에서, 코드 워드를 구성하는 벡터는 2개 또는 2개 이상의 DFT 벡터에 상이한 위상을 곱하고 회전하여 연결함으로써 얻은 것 이다. 일부 예시에서, 코드워드를 구성하는 벡터는 2개 또는 2개 이상의 DFT 벡터의 텐서 곱(kronecker 곱) 및 2개 또는 2개 이상의 DFT 벡터에 위상을 곱하고 회전하여 얻은 것이다. 기지국이나 단말은 L개의 코드워드를 검 색하고, 채널과 가장 매칭되는 코드워드를 찾아 최적의 코드워드로 하여 데이터나 신호를 전송하도록 한다. 여 기서 채널과 매칭되는 코드워드는 다음 중 적어도 하나를 포함하지만 이에 한정되지 않는다: 코드워드와 채널의거리가 가장 작은 것, 코드워드와 채널의 관련성이 가장 큰 것, 코드워드와 채널의 최적 우측 특이 벡터 또는 행렬의 거리가 가장 작은 것, 코드워드와 채널의 최적 우측 특이 벡터 또는 행렬의 관련성이 가장 큰 것, 계산 된 코드워드와 채널의 신호 대 잡음비가 가장 큰 것 등이다. L은 1보다 큰 정수이며, 일반적으로 송신 안테나수 보다 크다. 일부 예시에서, 단말과 기지국은 제2 유형 프리코딩 정보를 통해 채널과 매칭되는 채널 상태 정보를 전송하고, 제2 유형 프리코딩 정보는 AI에 기초하여 얻은 채널 상태 정보이다. 일 예시에서, 기지국과 단말은 오토인코더 의 인코더를 통해 채널 상태 정보를 얻고, 오토인코더는 하나의 인코더와 디코더를 포함하며, 여기서, 인코더는 단말에 있고 디코더는 기지국측에 있다. 단말은 인코더를 통해 획득된 채널 H를 압축하여 압축된 채널 상태 정 보 H1을 얻고, 압축된 채널 상태 정보 H1을 양자화하여 기지국에 피드백하며, 기지국은 양자화된 H1을 수신하고, 이를 역영자화하여 디코더에 입력하며, 디코더는 압축해제하여 H를 복원한다. 일 예시에서, H는 K0 개의 요소를 포함하고, 단말은 H에서 K개의 요소를 선택하여 H1로 하고, H1을 양자화하여 피드백하며, 기지국은 상기 K개의 양자화된 요소를 수신하여 이를 역영자화하며, 역 영자화된 K 개의 요소를 AI 모듈에 입력하고, AI 모듈은 H의 복원으로서 K0개의 요소를 출력하여 상기 H의 프리코딩 행렬을 얻는다. 여기서, K와 K0은 1보다 큰 정수이고, K<K0이다. 여기서, 압축기를 거친 H1 또는 H에서 선택된 K 개의 요소는 모두 제2 유형 채널 상태 정 보이다. 또한, 단순화를 위해, 양자화된 H1도 제2 유형 채널 상태 정보라고 한다. 일 예시에서, 제2 유형 프리 코딩 정보도 기타 비 AI 방식에 의해 생성된, 제1 유형 프리코딩 정보와 다른 프리코딩 행렬일 수 있다. 일 예 시에서, 제2 유형 프리코딩 정보는 상기 제1 유형 프리코딩 정보 이외의 프리코딩 행렬일 수도 있다. 일부 예시에서, CSI를 전송하기 위해, 예를 들어 단말은 CSI를 피드백하고, 기지국은 CSI를 수신하며, 단말과 기지국은 하나의 CSI 보고(CSI report 또는CSI report congfig)를 정의해야 하며, 여기서 CSI 보고는, CSI를 피드백하는 데 사용되는 시간-주파수 자원, CSI에 포함된 reportQuantity, CSI 피드백의 시간 영역 유형 reportConfigType, 측정 채널 자원, 측정 간섭 자원, 측정된 대역폭 크기 등 정보 중 적어도 하나의 파라미터를 정의한다. 여기서 CSI 보고는 업링크 전송 자원을 통해 전송될 수 있으며, 여기서 업링크 전송 자원은 업링크 시그널링 또는 데이터를 전송하는 데 사용되는 자원이며, 물리적 업링크 공유 채널(Physical Uplink Shared Channel, PUSCH) 및 물리적 업링크 제어 채널(Physical Uplink Control Channel, PUCCH)을 포함하지만 이에 한 정되지 않으며, CSI report는 시간 영역 특성을 포함하고, 주기적인 CSI 보고(periodic CSI report, P-CSI), 비주기적인 CSI 보고(aperiodic CSI report, A-CSI) 및 반지속적인 CSI 보고(semi-persistent CSI report, SP- CSI)를 포함한다. 일반적으로, P-CSI 전송은 비트수가 비교적 작고 PUCCH에서 전송되며, A-CSI 전송은 비트 수 가 비교적 많고 일반적으로 PUSCH에서 전송되며, SP-CSI는 PUSCH를 기반으로 전송될 수도 있고, PUCCH를 기반으 로 전송될 수도 있다. 여기서, PUCCH를 기반으로 전송되는 P-CSI는 일반적으로 상위계층 시그널링(무선 자원 제 어(Radio Resource Control, RRC))에 의해 구성되고, PUCCH를 기반으로 전송되는 SP-CSI도 상위계층 시그널링 (RRC 및/또는 MAC CE)에 의해 구성 또는 활성화되는 반면, PUSCH를 기반으로 전송되는 SP-CSI 또는 A-CSI는 모 두 물리적 계층 시그널링(다운링크 제어 정보(Downlink control information, DCI))에 의해 트리거되며, DCI는 일반적으로 물리적 다운링크 제어 채널(Physical downlink control channel, PDCCH)에서 전송된다. 일부 실시예에서, 피드백은 송신 또는 전송으로 대체될 수 있으며, 이는 모두 시그널링 또는 데이터 또는 채널 상태 정보를 하나의 통신 노드에서 다른 통신 노드로 전송하는 것을 말한다. 일부 실시예에서, 기지국은 상위 계층 시그널링 및/또는 물리 계층 시그널링을 통해 기지국으로 피드백하여야 할 N개의 CSI 보고(CSI report)를 단말에 구성하고, 각각의 CSI 보고는 모두 하나의 인덱스 값(identity, ID) 을 가지며, CSI reportID라 칭하며, 단말은 자신의 컴퓨팅 능력이나 처리 능력 및 기지국의 요구에 따라 N개의 CSI 보고 중에서 M개의 CSI 보고를 선택할 수 있다. 그리고 업링크 피드백 자원에 따라, 상기 M개의 CSI 보고 중 적어도 하나의 CSI 보고를 피드백하며, 여기서 N과 M은 양의 정수이고, M<=N이다. 일 예시에서, M개의 CSI 보고를 피드백하여야 하는데, 상기 M개의 보고 중 적어도 두 개 보고의 피드백 자원이 충돌하며, 상기 두 개 보 고의 피드백 자원이 충돌한다는 것은 상기 두 개의 보고의 피드백에 대응되는 전송 자원(예를 들어, PUCCH 또는 PUSCH) 중 적어도 하나의 심볼이 동일하고 및/또는 적어도 하나의 부반송파가 동일함을 말한다. 일부 예시에서, 단말은 복수의 CSI 보고를 피드백해야 하며, 여기서, 복수의 CSI 보고 중 적어도 L 개의 CSI 보 고에 대응되는 전송 자원에 충돌이 있다. 일 예시에서, 충돌이 있는 L 개의 CSI 보고 중 적어도 하나는 제2 유 형 프리코딩 정보를 포함하는 보고이며, 여기서 L은 양의 정수이다. 우선 순위 계산 공식에 따라 L 개의 충돌하 는 CSI 보고의 우선 순위 값(priority value, PV)을 계산하고, 우선 순위 값이 작은 것부터 큰 것 순에 따라, 그 중에서 우선 순위 값이 작은 적어도 하나의 CSI 보고를 선택하여 업링크 전송 자원에서 전송한다.일부 실시예에서, 일부 예시에서, 안테나는 물리적 안테나이다. 일부 예시에서, 안테나는 논리 안테나이다. 일 부 예시에서, 포트와 안테나는 호환될 수 있는 개념이다. 일부 예시에서, 안테나는 송신 안테나이다. 일부 예시 에서, 안테나는 수신 안테나이다. 일부 예시에서, 안테나는 송신 안테나와 수신 안테나의 안테나 쌍을 포함한다. 일부 예시에서, 안테나는 균일한 선형 어레이일 수 있다. 일부 예시에서, 안테나는 균일한 평면 어레 이(예를 들어 Ng 행 Mg 열을 포함하며, Ng 및 Mg는 양의 정수임)이다. 일부 예시에서, 안테나는 균일한 원형 어 레이이다. 일부 예시에서, 안테나는 불균일한 선형 어레이일 수 있다. 일부 예시에서, 안테나는 불균일한 평면 어레이이다. 일부 예시에서, 안테나는 불균일한 원형 어레이이다. 일부 예시에서, 안테나는 지향성 안테나이고, 일부 예시에서 안테나는 전방향성 안테나이다. 일부 예시에서, 안테나는 이중편파 안테나(Bipolar antenna)이다. 일부 예시에서 안테나는 단일편파 안테나이다. 일부 예시에서, 채널 정보는 참조 신호(예를 들어 CSI-RS)에 따라 획득한 통신 노드 간의 채널 환경을 기술하기 위한 정보로, 예를 들어 시간 영역 채널 행렬, 주파수 영역 채널 행렬이다. 일부 예시에서, 채널 정보는 송신 안테나 수 Nt, 수신 안테나 수 Nr 및 자원 요소(Resource Element, RE)와 관련된 하나의 다중 행렬(complex matrix)이다. 예를 들어, 하나의 물리적 자원 블록(Physical Resource Block)에는 적어도 하나의 Nr*Nt 채널 행렬이 있다. 기지국은 N 개의 슬롯에서 채널 측정을 위한 참조 신호를 전송한다. 단말은 적어도 하나의 슬롯에 서 상기 N 개의 슬롯에서 송신된 채널 측정을 위한 참조 신호를 각각 수신하여 측정한다. 수신된 상기 N 개의 슬롯에서 송신된 채널 측정을 위한 참조 신호에 따라 대응하는 슬롯의 채널 정보 Hi를 획득하며, i=1, …, N이 다. 여기서, N 개의 슬롯은 참조 슬롯 이전의 슬롯이다. 일부 실시예에서, 참조 슬롯은: 기지국과 단말이 예약 한 하나의 슬롯, 또는 N 개의 채널 정보에 따라 M 개의 채널 정보를 획득하는 동작을 수행하기 위한 하나의 현 재 슬롯; 또는 기지국이 지시하는 하나의 슬롯; 또는 기지국이 지시하는 하나의 슬롯에 하나의 고정 바이어스를 더하여 얻은 슬롯; 또는 단말이 기지국 지시 시그널링을 수신한 슬롯에 하나의 고정 바이어스를 더하여 얻은 슬 롯; 중 하나를 포함한다. 일부 예시에서, N 개의 채널 정보에 따라 M 개의 채널 정보를 획득한다. 예를 들어, N 개의 채널 정보를 순차적 으로 인코딩하여 제1 AI 모듈에 입력하고, 제1 AI 모듈은 M 개의 채널 정보를 출력한다. 일부 예시에서, 채널 정보를 인코딩하는 것은: 채널 행렬의 요소를 정규화 처리(예를 들어 한 요소의 범위를 구간 [0,1] 또는 [- 0.5,0.5]에 정규화함)하는 것, 채널 행렬의 요소를 실수화 처리(예를 들어 한 복소수를 실수부, 허수부로 나 눔)하는 것, 채널 행렬을 샘플링하는 것, 채널 행렬을 그룹화하는 것, 복수의 채널 행렬을 공동 조작하는 것, 중 하나를 포함하지만 이에 한정되지 않는다. 여기서, N 개의 채널 정보는 참조 슬롯 이전의 채널 정보이다. M 개의 채널 정보는 참조 슬롯 이후의 채널 정보이다. N은 1보다 큰 정수이고, M은 1보다 크거나 같은 정수이다. 일부 예시에서, 도 1을 참조하면, 상기 M 개의 채널 정보에 대응되는 채널 상태 정보를 결정한다. 일 예시에서, M 개의 채널 정보를 인코딩하여 제2 AI 모듈에 입력하고, 제2 AI 모듈은 하나의 CSI를 출력한다. 일 예시에서, M 개의 채널 정보를 인코딩하여 각각 제2 AI 모듈에 입력하고, 제2 AI 모듈은 M 개의 CSI를 각각 출력한다. 일 예시에서, M 개의 채널 정보를 K 그룹의 채널 정보로 나누고, 각 그룹의 채널 정보를 인코딩하여 각각 제2 AI 모듈에 입력하며, 제2 AI 모듈은 K 개의 CSI를 각각 출력한다. 일 예시에서, M 개의 채널 정보를 K 그룹의 채널 정보로 나누고, i 번째 채널 정보를 인코딩하여 제2 AI 모듈에 입력하며, 제2 AI 모듈은 i 개의 CSI를 출력하고, i=1, …, K이다. 여기서, M은 1보다 크거나 같은 정수이고, K는 1보다 크거나 같은 정수이며, K<M이 다. 일부 예시에서, 상기 M 개의 채널 정보의 채널 상태 정보(CSI)를 피드백한다. 예를 들어, 업링크 전송 자원에서 상기 CSI를 전송한다. 일부 예시에서, 상기 M 개의 채널 정보에 대응하는 CSI는 적어도 하나의 비주기적인 PUSCH에 베어러되어 전송된다. 일부 예시에서, 상기 M 개의 채널 정보에 대응하는 CSI는 적어도 하나의 반지속 적인 PUSCH에 베어러되어 전송된다. 일부 예시에서, 상기 M 개의 채널 정보에 대응하는 CSI는 적어도 하나의 주 기적인 PUCCH에 베어러되어 전송된다. 일부 실시예에서, 하나의 채널 상태 정보를 피드백하는 것은 CSI를 하나 의 업링크 전송 자원에 베어러하여 전송하는 것을 말한다. 일부 실시예에서, 하나의 채널 상태 정보 보고를 통 해 적어도 하나의 채널 상태 정보를 피드백하는 것은, 상기 적어도 하나의 채널 상태 정보를 상기 채널 상태 정 보 보고에 의해 지시되는 업링크 전송 자원에 베어러하고, 상기 업링크 전송 자원을 통해 다른 통신 노드로 전 송하는 것을 말한다. 도 2는 본 출원의 실시예에서 제공하는 채널 상태 정보 결정 방법의 흐름도이고, 본 출원 실시예는 채널 상태 정보를 결정하는 경우에 적용될 수 있으며, 상기 채널 상태 정보에 대응되는 채널 정보는 과거 또는 참조 슬롯 이전의 채널 정보를 통해 예측 및 생성되며, 상기 방법은 본 출원 실시예의 채널 상태 정보 결정 장치에 의해실행될 수 있으며, 상기 장치는 소프트웨어 및/또는 하드웨어로 구현될 수 있으며 일반적으로 단말에 집성된다. 도 2를 참조하면, 본 출원 실시예에서 제공하는 방법은 구체적으로 다음과 같은 단계를 포함한다: 단계(S110), N 개의 채널 정보에 따라 M 개의 채널 정보를 획득한다. 본 출원 실시예에서, N 개의 채널 정보를 기반으로 M 개의 채널 정보를 획득할 수 있으며, 획득하는 방법으로는 인공지능 방법을 통해 N 개의 채널 정보에 따라 예측하여 M 개의 채널 정보를 결정할 수 있으며, 물론 본 출원 에서는 AI가 아닌 방식을 통해 N 개의 채널 정보로부터 M 개의 채널 정보를 획득할 수도 있다. 예를 들어, N 개 의 채널 정보를 순차적으로 인코딩하여 제1 AI 모듈에 입력하고, 제1 AI 모듈이 M 개의 채널 정보를 출력한다. 단계(S120), M 개의 채널 정보에 대응하는 채널 상태 정보를 결정한다. 예를 들어, M 개의 채널 정보에 대응하는 채널 상태 정보를 결정할 수 있고, 상기 결정은 AI를 통해 구현될 수 있으며, 예를 들어, M 개의 채널 정보를 인코딩하여 제2 AI 모듈에 입력하고, 제2 AI 모듈이 하나의 CSI를 출력 한다. 일 예시에서, M 개의 채널 정보를 인코딩하여 각각 제2 AI 모듈에 입력하고, 제2 AI 모듈이 각각 M 개의 CSI를 출력한다. 일 예시에서, M 개의 채널 정보를 K 그룹의 채널 정보로 나누고, 각 그룹의 채널 정보를 인코 딩하여 각각 제2 AI 모듈에 입력하고, 제2 AI 모듈이 각각 K 개의 CSI를 출력한다. 일 예시에서, M 개의 채널 정보를 K 그룹의 채널 정보로 나누고, i 번째 채널 정보를 인코딩하여 제2 AI 모듈에 입력하고, 제2 AI 모듈이 i 개의 CSI를 출력하며, i=1, …, K이다. 여기서, M은 1보다 크거나 같은 정수이고, K는 1보다 크거나 같은 정 수이며, K<M이다. 단계(S130), M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하며, 여기서 N은 1보다 큰 정수이고, M은 1 보다 크거나 같은 정수이다. 본 출원 실시예에서, 채널 상태 정보를 결정한 후, M 개의 채널 정보의 채널 상태 정보를 피드백한다. 일부 실시예에서, N 개의 채널 정보는 참조 슬롯 이전의 채널 정보이고, M 개의 채널 정보는 참조 슬롯 이후의 채널 정보이다. 본 출원 실시예에서, 참조 슬롯 이전의 하나 이상의 채널 정보를 통해 참조 슬롯 이후의 하나 이상의 채널 정보 를 결정할 수 있다. 도 3은 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이고, 본 출원 실시예는 상기 출원 실시예의 기초상에 구체화된 것이며, 도 3을 참조하면, 본 출원 실시예에서 제공하는 방법은 구체적으로 다음과 같은 단계를 포함한다: 단계(S210), N 개의 채널 정보에 따라 M 개의 채널 정보를 획득한다. 단계(S220), M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하며, 여기서 M은 양의 정수이고, K는 M보다 작 거나 같은 양의 정수이다. 본 출원 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리할 수 있고, 상기 처리 과정은 채널 정 보를 프리코딩 행렬로 매핑하는 것, 즉 채널 정보를 제1 유형 프리코딩 정보 또는 제2 유형 프리코딩 정보로 변 환하거나, 제1 유형 프리코딩 정보 또는 제2 유형 프리코딩 정보를 사용하여 상기 채널 정보를 기술하는 것을 포함할 수 있으며, 여기서 K는 1보다 작거나 M과 같은 양의 정수이다. 단계(S230), 하나의 채널 상태 정보 보고에 대응되는 전송 자원에서 K 개의 채널 정보의 채널 상태 정보를 피드 백한다. 예를 들어, K 개의 채널 정보에 대응하는 생성된 채널 상태 정보를 하나의 채널 상태 정보 보고에서 피드백할 수 있으며, 예를 들어, 상기 채널 상태 정보 보고는 업링크 전송 자원을 지시하며, 상기 업링크 전송 자원에서 상기 K 개의 채널 정보에 대응하는 채널 상태 정보를 피드백한다. 일부 실시예에서, 제1 지시 정보는: 물리적 계층 시그널링, 물리적 계층 시그널링의 하나의 필드, 상위계층 시 그널링, 상위계층 시그널링의 하나의 필드, 또는 CSI 보고에 포함된 하나의 필드 중 하나일 수 있다. 상기 제1 지시 정보는 채널 상태 정보 유형을 지시하는 데 사용된다. 일 예시에서, 채널 상태 정보 보고는 제1 지시 정보 를 포함한다. 본 출원 실시예에서, 제1 지시 정보를 피드백하고, 상기 제1 지시 정보는 채널 상태 정보 유형 등을 지시하는 데 사용된다.예를 들어, 제1 지시 정보는 구체적으로 채널 상태 정보 그룹에 대응하는 채널 상태 정보의 채널 상태 정보 유 형을 지시하는 데 사용될 수 있으며, 상기 채널 상태 정보 유형은 제1 유형 프리코딩 정보와 제2 유형 프리코딩 정보를 포함하고, 채널 상태 정보 그룹에 대응하는 채널 상태 정보의 채널 상태 정보 유형을 지시하는 데 사용 될 수 있으며, 예를 들어, 제1 지시 정보를 통해 채널 상태 정보 그룹에 대응하는 채널 상태 정보의 채널 상태 정보 유형을 지시할 수 있으며, 제1 지시 정보가 제1 값을 취할 경우, 단말 및/또는 기지국은 제1 유형 프리코 딩 정보를 사용하여 채널 정보 그룹 내의 채널 정보를 기술하고, 예를 들어, 채널 정보 그룹 내의 채널 정보를 제1 유형 프리코딩 정보로 결정하며, 제1 지시 정보가 제2 값을 취할 경우, 단말 및/또는 기지국은 제2 유형 프 리코딩 정보를 사용하여 채널 정보 그룹 내의 채널 정보를 기술하고, 예를 들어, 채널 정보 그룹 내의 채널 정 보를 제2 유형 프리코딩 정보로 결정한다. 일 예시적인 실시형태에서, 제1 값이 0이고 제2 값이 1이거나, 또는 제1 값이 0이고 제2 값이 0이 아닌 값이거나; 또는 제1 값이 FALSE이고 제2 값이 TRUE이다. 물론, 여기서 제1 값과 제2 값은 다른 상황의 실수 값을 취할 수도 있으며, 두 가지 상황을 구별할 수만 있으면 된다. 일 예시적 인 실시형태에서, 단말은 상기 제1 지시 정보를 피드백하고, 상기 제1 지시 정보는 제1 값을 취하며, 단말은 채 널 정보 그룹 내의 채널 정보를 제1 유형 프리코딩 정보로 결정하고, 상기 제1 유형 프리코딩 정보를 피드백하 며, 기지국은 상기 제1 지시 정보와 제1 유형 프리코딩 정보를 수신한다. 일 예시적인 실시형태에서, 단말은 상 기 제1 지시 정보를 피드백하고, 상기 제1 지시 정보는 적어도 하나의 비트를 포함하며, 채널 상태 정보를 기술 하는 데 사용되는 상기 제1 지시 정보는 제2 값을 취하며, 단말은 채널 정보 그룹 내의 채널 정보를 제2 유형 프리코딩 정보로 결정하고, 상기 제2 유형 프리코딩 정보를 피드백한다. 기지국은 채널 상태 정보를 기술하는 데 사용되는 상기 제1 지시 정보 및 제2 유형 프리코딩 정보를 수신한다. 일부 실시예에서, 상기 K 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하는 것은, K 개의 채널 상태 정보 보고에 대응하는 전송 자원에서 K 개의 채널 정보에 대응하는 채널 상태 정보를 전송하 는 것을 포함한다. 본 출원 실시예에서, K 개의 채널 정보에 대응하는 채널 상태 정보는 K 개의 채널 상태 정보 보고에 대응하는 전송 자원에서 전송될 수 있다. 상기 K 개의 채널 상태 정보 보고에 대응하는 전송 자원은 첫 번째 슬롯 또는 복수의 슬롯에서 상기 K 개의 채널 정보에 대응하는 채널 상태 정보를 전송할 수 있다. 일부 실시예에서, K 개의 채널 상태 정보 보고의 보고 식별 정보는 동일하다. 예를 들어, K 개의 채널 상태 정보를 피드백하는 K 개의 채널 상태 정보 보고는 동일한 보고 식별 정보를 가질 수 있으며, 예를 들어 동일한 보고 번호 Report ID를 가질 수 있다. 다른 일부 실시예에서, K 개의 채널 상태 정보 보고의 보고 식별 정보는 상이하다. 본 출원 실시예에서, K 개의 채널 상태 정보를 피드백하는 K 개의 채널 상태 정보 보고는 상이한 보고 식별 정 보를 가질 수 있으며, 예를 들어 K 개의 채널 상태 정보 보고는 상이한 보고 번호 Report ID를 가질 수 있다. 일부 실시예에서, K 개의 채널 상태 정보 보고는 하나의 슬롯에서 보고된다. 다른 일부 실시예에서, K 개의 채널 상태 정보 보고는 K0 개의 슬롯에서 보고되며, K0은 K보다 작거나 같고 1보 다 큰 정수이다. 도 4는 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이고, 도 4를 참조하면, 본 출 원 실시예는 상기 출원 실시예의 기초상에 구체화된 것이며, 본 출원 실시예에서 제공하는 채널 상태 정보 결정 방법은 구체적으로 다음과 같은 단계를 포함한다: 단계(S310), N 개의 채널 정보에 따라 M 개의 채널 정보를 획득한다. 단계(S320), M 개의 채널 정보를 각각에 대응되는 슬롯의 크기에 따라 K 개의 채널 정보 그룹으로 분할한다. 본 출원 실시예에서, M 개의 채널 정보는 각각 위치하는 슬롯 크기에 따라 K 개의 채널 정보 그룹으로 분할될 수 있으며, 각 채널 정보 그룹에는 하나 이상의 채널 정보가 포함될 수 있다. 단계(S330), K 개의 채널 정보 그룹을 K 개의 제2 유형 프리코딩 정보로 처리하며, 여기서 K 및 M은 1보다 크거 나 같은 정수이고, K는 M보다 작거나 같다. 본 출원 실시예에서, 분할된 K 개의 채널 정보 그룹을 K 개의 제2 유형 프리코딩 정보로 처리할 수 있다. 예를 들어, i 번째 그룹을 i 번째 채널 상태 정보로 처리할 수 있고, 상기 처리 과정은 AI에 기반하여 구현될 수 있으며, i는 1, ……, K의 정수이다. 단계(S340), M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백한다. 일부 실시예에서, K 개의 채널 정보 그룹 중의 i 번째 채널 정보 그룹은 Xi 개의 채널 정보를 포함하며, 여기서 Xi는 양의 정수이고, i는 1, …, K이다. 본 출원 실시예에서, 분할된 K 개의 채널 정보 그룹에서, 각 채널 정보 그룹은 적어도 1 개의 채널 정보를 포함 한다. 하나의 더 구체적인 실시예에서, 각 채널 정보 그룹에 포함된 채널 정보의 수는 각각 다음 중 하나이다: 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 여기서 X1 및 X2는 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하며, 여기서 X1, X2 및 X3은 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하고, 네 번째 채널 정보 그룹은 X4 개의 채널 정보 를 포함하며, 여기서 X1 및 X2, X3, X4는 양의 정수이다. 일부 실시예에서, 채널 정보 그룹 내에 채널 정보를 포함하는 방식은 다음 중 적어도 하나일 수 있다: 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다;첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함하며, 세 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함하며, 세 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함한다. 일 예시적 실시형태에서, 채널 정보 그룹이 1 개의 채널 정보만 포함하고 제1 지시 정보가 제1 값을 취하는 경 우, 1 개의 채널 정보를 제1 유형 프리코딩 정보로 처리하고; 채널 정보 그룹이 적어도 2 개의 채널 정보를 포 함하고 제1 지시 정보가 제1 값을 취하는 경우, 적어도 2 개의 채널 정보를 적어도 1 개의 제1 유형 프리코딩 정보로 처리한다. 본 출원 실시예에서, 채널 정보 그룹이 1 개의 채널 정보만 포함하고 제1 지시 정보가 제1 값을 취하는 경우, 채널 정보 그룹에 포함된 1 개의 채널 정보를 제1 유형 프리코딩 정보로 처리할 수 있고, 상기 처리 과정은 TypeII, eTypeII 등 DFT 관련 코드북 방식을 기반으로 상기 채널 정보를 기술할 수 있다. 채널 정보 그룹이 적 어도 2 개의 채널 정보를 포함하고, 제1 지시 정보가 제1 값을 취하는 경우, 채널 정보 그룹에 포함된 적어도 1 개의 채널 정보를 각각 제1 유형 프리코딩 정보로 처리할 수 있고, 각 채널 정보의 처리 과정은 모두 TypeII 코 드북, eTypeII 등 DFT 관련 코드북 방식을 기반으로 상기 채널 정보를 기술할 수 있다. 일 실시예에서, 상기 출원 실시예의 기초상에, 제1 지시 정보를 피드백하는 것을 더 포함하며, 상기 제1 지시 정보는 채널 상태 정보 유형을 기술 또는 지시하는 데 사용된다. 도 5는 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이고, 도 5를 참조하면, 본 출 원 실시예는 상기 출원 실시예의 기초상에 구체화된 것이며, 본 출원 실시예에서 제공하는 채널 상태 정보 결정 방법은 구체적으로 다음과 같은 단계를 포함한다: 단계(S410), N 개의 채널 정보에 따라 M 개의 채널 정보를 획득한다. 단계(S420), M 개의 채널 정보를 그들이 위치하는 슬롯의 크기에 따라 순차적으로 인코딩한 후 하나의 채널 상 태 정보로 처리한다. 본 출원 실시예에서, M 개의 채널 정보를 그들이 위치하는 슬롯의 크기 순서에 따라 인코딩 처리할 수 있으며, 큰 슬롯에 위치한 채널 정보일 수록 먼저 인코딩 처리되고, M 개의 채널 정보를 하나의 채널 상태 정보로 처리 할 수 있다. 단계(S430), M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백한다. 도 6은 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이고, 도 6을 참조하면, 본 출 원 실시예는 상기 출원 실시예의 기초상에 구체화된 것이며, 본 출원 실시예에서 제공하는 채널 상태 정보 결정 방법은 구체적으로 다음과 같은 단계를 포함한다: 단계(S510), N 개의 채널 정보에 따라 M 개의 채널 정보를 획득한다. 단계(S520), M 개의 채널 정보를 M 개의 채널 상태 정보로 처리하며, 여기서 하나의 채널 정보는 하나의 채널 상태 정보에 대응한다. 본 출원 실시예에서, M 개의 채널 정보를 각각 M 개의 채널 상태 정보로 처리할 수 있으며, 각 채널 정보를 각 각 하나의 채널 상태 정보로 처리할 수 있다. 단계(S530), M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백한다. 도 7은 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이고, 도 7을 참조하면, 본 출 원 실시예는 상기 출원 실시예의 기초상에 구체화된 것이며, 본 출원 실시예에서 제공하는 채널 상태 정보 결정 방법은 구체적으로 다음과 같은 단계를 포함한다: 단계(S610), N 개의 채널 정보에 따라 M 개의 채널 정보를 획득한다. 단계(S620), M 개의 채널 정보를 K 개의 채널 상태 정보로 처리한다. 단계(S630), K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에 순차적으로 매핑한다. 본 출원 실시예에서, K 개의 채널 상태 정보를 우선순위 값에 따라 업링크 전송 자원에 순차적으로 매핑할 수 있으며, 상기 업링크 전송 자원은 하나의 채널 상태 정보 보고에 대응될 수 있다. 단계(S640), M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백한다. 일 실시예에서, 상기 출원 실시예의 기초상에, K 개의 채널 상태 정보의 우선순위 값의 크기는 K 개의 채널 상 태 정보에 대응되는 슬롯 크기에 따라 결정되거나, K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 인덱스 크기에 따라 결정된다. 본 출원 실시예에서, 채널 상태 정보의 우선순위 값은 그에 대응되는 슬롯 크기에 따라 결정되며, K 개의 채널 상태 정보에 있어서, 대응되는 슬롯 크기가 클수록 그에 대응되는 우선순위 값이 더 크다. 또는, 채널 상태 정 보의 우선순위 값은 그에 대응되는 인덱스 크기에 따라 결정되며, 인덱스가 클수록 우선순위 값이 작으며, 예를 들어, i 번째 채널 상태 정보의 인덱스에 대응되는 우선순위 값은 j 번째 채널 상태 정보의 인덱스에 대응되는 우선순위 값보다 작으며, 여기서 j<i이며, i, j=1, …, K이다. 일부 실시예에서, 상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에 순차적으로 매핑하는 단계는: 상기 업링크 전송 자원을 K 개의 시간 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 시간 영역 자원 그룹에 매핑하는 것; 상기 업링크 전송 자원을 K 개의 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 주 파수 영역 자원 그룹에 매핑하는 것; 상기 업링크 전송 자원을 K 개의 시간 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번 째 시간 주파수 영역 자원 그룹에 매핑하는 것; 중 하나를 포함한다. 본 출원 실시예에서, 업링크 전송 자원은 시간 영역 자원, 주파수 영역 자원 또는 시간 주파수 영역 자원 중 적 어도 하나일 수 있고, 업링크 전송 자원은 K 그룹으로 분할될 수 있으며, K 개의 채널 상태 정보는 각각 한 그 룹의 업링크 전송 자원에 매핑될 수 있다. 이해할 수 있는 것은, 업링크 전송 자원이 시간 영역 자원을 포함할 수 있는 경우, K 개의 채널 상태 정보는 시간 영역 자원으로 분할된 K 개의 시간 영역 자원 그룹 중 하나에 각 각 매핑될 수 있으며, 각 시간 영역 자원 그룹은 L1 개의 시간 영역 심볼 자원(예를 들어 연속 또는 비연속적인 L1 개 심볼의 서로 다른 부반송파의 자원 요소를 포함)을 포함할 수 있으며; 업링크 전송 자원이 주파수 영역 자원을 포함할 수 있는 경우, K 개의 채널 상태 정보는 주파수 영역 자원으로 분할된 K 개의 주파수 영역 자원 그룹 중 하나에 각각 매핑될 수 있으며, 각 주파수 영역 자원 그룹은 L2 개의 부반송파 자원, 예를 들어 하나 이상의 물리적 자원 블록 자원(Physical Resource Block, PRB), 하나 이상의 서브밴드를 포함할 수 있으며; 업 링크 전송 자원이 시간 주파수 영역 자원을 포함하는 경우, K 개의 채널 상태 정보는 시간 주파수 영역 자원으 로 분할된 K 개의 시간 주파수 영역 자원 그룹 중 하나에 각각 매핑될 수 있으며, 각 시간 주파수 영역 자원 그 룹은 L1 개의 시간 영역 심볼 자원 및 L2 개의 부반송파 자원을 포함할 수 있으며, 여기서 K, L1, L2는 양의 정 수이다. 일 실시예에서, 상기 출원 실시예의 기초상에, 채널 상태 정보 결정 방법은 다음 중 적어도 하나를 더 포함한다: 채널 정보에 대응하는 슬롯이 작을수록, 채널 정보에 대응하는 채널 상태 정보를 전송하는 전송 자원에 대응하 는 슬롯이 더 작다; 채널 정보에 대응하는 슬롯이 작을수록, 채널 정보를 전송하는 전송 자원에 대응하는 슬롯이 더 작다; 채널 정보에 대응하는 슬롯이 작을수록, 채널 정보에 대응하는 채널 상태 정보 보고에 대응하는 슬롯이 더 작다; 채널 상태 정보에 대응하는 슬롯이 작을수록, 채널 상태 정보에 대응하는 채널 상태 정보 보고에 대응하는 슬롯 이 더 작다; 채널 상태 정보에 대응하는 슬롯이 작을수록, 채널 상태 정보를 전송하는 전송 자원에 대응하는 슬롯이 더 작다.즉, 먼저 결정된 채널 상태 정보일수록 먼저 전송된다. 여기서, 먼저는 전송 슬롯의 크기로 구현되며, 슬롯이 작다는 것은 먼저 전송됨을 의미한다. 일 실시예에서, M 개의 채널 정보에 대응하는 채널 상태 정보의 제1 결정 시간은 N 개의 채널 정보의 채널 상태 정보를 결정하는 제2 결정 시간보다 작다. 본 출원 실시예에서, M 개의 채널 정보의 채널 상태 정보를 결정하는 제1 결정 시간은 N 개의 채널 정보의 채널 상태 정보를 결정하는 제2 결정 시간보다 작으며, 예를 들어, 제2 결정 시간은 제1 결정 시간의 정수배이다. 도 8은 본 출원의 실시예에서 제공하는 채널 상태 정보 결정 방법의 흐름도이고, 본 출원 실시예는 채널 상태 정보를 결정하는 경우에 적용될 수 있으며, 상기 채널 상태 정보에 대응되는 채널 정보는 과거 또는 참조 슬롯 이전의 채널 정보에 의해 결정된다. 상기 방법은 본 출원 실시예의 채널 상태 정보 결정 장치에 의해 실행될 수 있으며, 상기 장치는 소프트웨어 및/또는 하드웨어로 구현될 수 있으며 일반적으로 단말에 집성된다. 도 8을 참 조하면, 본 출원 실시예에서 제공하는 방법은 구체적으로 다음과 같은 단계를 포함한다: 단계(S710), 채널 상태 정보를 획득한다. 예를 들어, 하나 이상의 CSI 보고를 수신하는 것을 통해 채널 상태 정보를 획득할 수 있고, 상기 채널 상태 정 보는 M 개의 채널 정보 처리에 따라 얻은 채널 상태 정보이다. 단계(S720), 채널 상태 정보에 대응하는 M 개의 채널 정보 또는 M 개의 채널 정보의 채널 상태 정보를 결정하며, 여기서 M 개의 채널 정보는 N 개의 정보에 의해 결정되고, N은 1보다 큰 정수이고, M은 1보다 크거나 같은 정수이다. 본 출원 실시예에서, 수신된 채널 상태 정보에 따라 M 개의 채널 정보 또는 M 개의 채널 상태 정보를 결정할 수 있으며, 상기 M 개의 채널 정보는 N 개의 채널 정보에 의해 결정될 수 있다. 일 예시적인 실시형태에서, 채널 상태 정보는 K 개의 제2 유형 프리코딩 정보에 기반하여 피드백되며, i 번째 제2 유형 프리코딩 정보에 따라 대 응하는 채널 정보를 결정할 수 있다. 다른 예시적인 실시형태에서, 채널 상태 정보는 제1 유형 프리코딩 정보에 기반하여 피드백되며, 채널 상태 정보에 따라 M 개의 채널 상태 정보를 각각 결정할 수 있으며, 예를 들어 i 번 째 제1 유형 프리코딩 정보에 따라 i 번째 채널 상태 정보를 결정한다. i는 M보다 작거나 같은 양의 정수이다. 일부 실시예에서, N 개의 채널 정보는 참조 슬롯 이전의 채널 정보이고, M 개의 채널 정보는 참조 슬롯 이후의 채널 정보이다. 일부 실시예에서, 상기 채널 상태 정보는 K 개이고, 상기 K 개의 채널 상태 정보는 M 개의 채널 정보 처리에 의 해 획득되며, 여기서 M은 양의 정수이고, K는 M보다 작거나 같은 양의 정수이다. 일부 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 것은: 상기 M 개의 채널 정보를 각각에 대응되는 슬롯의 크기에 따라 K 개의 채널 정보 그룹으로 분할하는 것; 상기 K 개의 채널 정보 그룹을 K 개의 제2 유형 프리코딩 정보로 처리하는 것; 을 포함하며, 여기서 상기 K 및 상기 M은 1보다 크거나 같은 정수이고, 상기 K는 상기 M보다 작거나 같다. 일부 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 것은: 상기 M 개의 채널 정보를 그들이 위치하는 슬롯의 크기에 따라 순차적으로 인코딩한 후 하나의 상기 채널 상태 정보로 처리하는 것을 포함한다. 일부 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 것은: 상기 M 개의 채널 정보를 M 개의 채널 상태 정보로 처리하는 것을 포함하며, 여기서 하나의 채널 정보는 하나의 채널 상태 정보에 대응한다. 일부 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 것은: 상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에 순차적으로 매핑하는 것을 포함한다. 일부 실시예에서, K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 슬롯 크기에 따라 결정되거나, 상기 K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 인덱스 크기에 따라 결정된다. 일부 실시예에서, 상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에 순차적으로 매핑하는 것은: 상기 업링크 전송 자원을 K 개의 시간 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 시간 영역 자원 그룹에 매핑하는 것; 상기 업링크 전송 자원을 K 개의 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 주 파수 영역 자원 그룹에 매핑하는 것; 상기 업링크 전송 자원을 K 개의 시간 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번 째 시간 주파수 영역 자원 그룹에 매핑하는 것; 중 하나를 포함한다. 여기서, k=1, ..., K이고, k는 K보다 작거나 같은 양의 정수이다. 일부 실시예에서, K 개의 채널 정보 그룹 중의 i 번째 채널 정보 그룹은 Xi 개의 채널 정보를 포함하며, 여기서 Xi는 양의 정수이고, i=1, ……, K이다. 본 출원 실시예에서, 분할된 K 개의 채널 정보 그룹에서, 각 채널 정보 그룹은 적어도 1 개의 채널 정보를 포함 한다. 하나의 더 구체적인 실시예에서, 각 채널 정보 그룹에 포함된 채널 정보의 수는 각각 다음 중 하나이다: 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 여기서 X1 및 X2는 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하며, 여기서 X1, X2 및 X3은 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하고, 네 번째 채널 정보 그룹은 X4 개의 채널 정보 를 포함하며, 여기서 X1 및 X2, X3, X4는 양의 정수이다. 일부 실시예에서, 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹 은 2 개의 채널 정보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함하며, 세 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함하며, 세 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함한다. 일부 실시예에서, 상기 채널 정보 그룹이 1 개의 채널 정보만 포함하고 제1 지시 정보가 제1 값을 취하는 경우, 상기 1 개의 채널 정보를 제1 유형 프리코딩 정보로 처리하고; 상기 채널 정보 그룹이 적어도 2 개의 채널 정보 를 포함하고 제1 지시 정보가 제1 값을 취하는 경우, 상기 적어도 2 개의 채널 정보를 적어도 1 개의 제1 유형 프리코딩 정보로 처리한다. 일부 실시예에서, 채널 상태 정보를 획득하는 것은, 하나의 채널 상태 정보 보고에 대응하는 전송 자원에서, 전 송되는 K 개의 채널 정보의 채널 상태 정보 중 피드백되는 상기 채널 상태 정보를 획득하는 것을 포함한다. 일부 실시예에서, 제1 지시 정보를 수신하는 것을 더 포함하고, 상기 제1 지시 정보는 채널 상태 정보 유형을 지시하는 데 사용된다. 일부 실시예에서, K 개의 채널 상태 정보 보고에 대응하는 전송 자원에서, 전송되는 K 개의 채널 정보의 채널 상태 정보를 획득한다. 일부 실시예에서, 상기 채널 상태 정보 보고는 제1 지시 정보를 포함하고, 상기 제1 지시 정보는 상기 채널 정 보 그룹에 대응하는 채널 상태 정보의 채널 상태 정보 유형을 지시하는 데 사용된다. 일부 실시예에서, 채널 상태 정보를 획득하는 것은, K 개의 채널 상태 정보 보고에서, 피드백되는 상기 채널 상 태 정보를 획득하는 것을 포함한다. 일부 실시예에서, K 개의 채널 상태 정보 보고의 보고 식별 정보는 동일하다. 일부 실시예에서, K 개의 채널 상태 정보 보고의 보고 식별 정보는 상이하다. 일부 실시예에서, K 개의 채널 상태 정보 보고는 하나의 슬롯에서 보고된다. 일부 실시예에서, K 개의 채널 상태 정보 보고는 K 개의 슬롯에서 보고된다. 일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보에 대응하는 채널 상태 정보를 전송하 는 전송 자원에 대응하는 슬롯이 더 작다. 일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보를 전송하는 전송 자원에 대응하는 슬 롯이 더 작다. 일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보에 대응하는 채널 상태 정보 보고에 대응하는 슬롯이 더 작다. 일부 실시예에서, 채널 상태 정보에 대응하는 슬롯이 작을수록, 상기 채널 상태 정보에 대응하는 채널 상태 정 보 보고에 대응하는 슬롯이 더 작다. 일부 실시예에서, 채널 상태 정보에 대응하는 슬롯이 작을수록, 상기 채널 상태 정보를 전송하는 전송 자원에 대응하는 슬롯이 더 작다. 일부 실시예에서, M 개의 채널 정보에 대응하는 채널 상태 정보의 제1 결정 시간은 상기 N 개의 채널 정보의 채 널 상태 정보를 결정하는 제2 결정 시간보다 작다. 일 예시적인 실시형태에서, 채널 정보는 하나의 CSI로 공동 처리되고, 1 개의 채널 상태 정보 보고를 통해 피드 백된다. M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 것은, M 개의 채널 정보를 하나의 채널 상태 정보(Channel State Information, CSI)로 공동 처리하는 것을 말한다. M 개의 채널 정보가 H1, H2, ..., HM이고, 각각 슬롯 n1, …, nM의 채널 정보이며, 이들이 송수신 안테나의 수 및 대역폭과 관련된 채널 행렬이라고 가정한 다. 또한, n1, …, nM은 오름차순으로 정렬된 양의 정수이다. M 개의 채널 정보를 대응되는 슬롯의 크기에 따라 순차적으로 인코딩한 후 하나의 CSI에 매핑하고, 하나의 CSI 보고를 통해 피드백한다. 다른 예시적인 실시형태에서, 채널 정보는 각각 M 개의 CSI로 처리되어 하나의 채널 상태 정보 보고에서 피드백 된다. M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 것은 M 개의 채널 정보를 각각 M 개의 CSI로 처 리하는 것을 말한다. M 개의 채널 정보가 H1, H2, ..., HM이고, 각각 슬롯 n1, …, nM의 채널 정보이며, 이들이 송수신 안테나의 수 및 대역폭과 관련된 채널 행렬이라고 가정한다. 또한, n1, …, nM은 오름차순으로 정렬된 양 의 정수이고, i 번째 채널 정보 Hi는 i 번째 CSIi에 매핑된다. 일 실시예에서, i 번째 CSI의 우선순위 값은 j 번째 CSIj보다 작고, 여기서 1<=i<j<=M이다. 인코딩시 우선순위 값의 오름차순에 따라 첫 번째 CSI를 먼저 코딩하고 두 번째 CSI를 코딩하며, CSI report가 지시하는 업링크 전 송 자원이 인코딩 요구 사항을 충족하지 못할 때까지 순차적으로 인코딩한다. 일 실시예에서, CSI의 인코딩은 업링크 전송 자원에서 매핑될 수 있으며, 업링크 전송 자원은 시간 영역 자원, 주파수 영역 자원 및 시간 주파수 영역 자원을 포함할 수 있다. 도 9를 참조하면, 시간 영역에서 순차적으로 CSI1, CSI2, CSIM을 인코딩하고; 도 10을 참조하면, 주파수 영역에서 순차적으로 CSI1, CSI2, CSIM을 인코딩하고; 도 11을 참조하면, 선 주파수 영역 후 시간 영역에서 순차적으로 CSI1, CSI2, CSIM을 인코딩한다. 인코딩된 M 개 의 CSI는 하나의 CSI report에 대응되는 업링크 전송 자원에서 전송된다. 일 예시적인 실시형태에서, 채널 정보는 K 개의 CSI로 처리되고, 즉, 하나의 채널 정보에 대응되는 CSI도 있고, 적어도 두 개의 채널 정보에 대응되는 CSI도 있으며, 하나의 채널 상태 정보 보고를 통해 피드백된다. M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 것은 M 개의 채널 정보를 각각 K 개의 CSI로 매핑하는 것을 말한다. M 개의 채널 정보가 H1, H2, ..., HM이고, 각각 슬롯 n1, …, nM의 채널 정보이며, 이들이 송수신 안테나 의 수 및 대역폭과 관련된 채널 행렬이라고 가정한다. 또한, n1, …, nM은 오름차순으로 정렬된 양의 정수이다. 상기 M 개의 채널을 슬롯의 크기에 따라 K 개의 그룹으로 나누고, 각 그룹은 적어도 하나의 채널 정보를 포함한 다. i 번째 그룹의 채널 정보를 i 번째 CSIi에 매핑하고, i=1, …, K이다. 일 실시예에서, i 번째 CSI의 우선순위 값은 j 번째 CSIj보다 작고, 여기서 1<=i<j<=K이다. 인코딩시 우선순위 값의 오름차순에 따라 첫 번째 CSI를 먼저 코딩하고 두 번째 CSI를 코딩하며, CSI report가 지시하는 전송 자원 이 인코딩 요구 사항을 충족하지 못할 때까지 순차적으로 인코딩한다. 일 예로, 시간 영역에서 순차적으로 CSI1, CSI2, …, CSIK를 인코딩한다. 일 예로, 주파수 영역에서 순차적으로 CSI1, CSI2, …, CSIK를 인코딩한다. 일 예로, 선 주파수 영역, 후 시간 영역 방식으로 순차적으로 CSI1, CSI2, …, CSIK를 인코딩한다. 인코딩된 K 개의 CSI는 하나의 CSI report에서 피드백된다. 일 예시에서, K 그룹의 채널 정보에서 i 번째 채널 그룹은 Xi 개의 채널 정보를 포함하며, Xi는 양의 정수이고, i=1, …, K이다. 더 구체적인 일 예시로, 각 채널 정보 그룹에 포함된 채널 정보의 수는 각각 다음 중 하나이다: 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 여기서 X1 및 X2는 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하며, 여기서 X1, X2 및 X3은 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하고, 네 번째 채널 정보 그룹은 X4 개의 채널 정보 를 포함하며, 여기서 X1 및 X2, X3, X4는 양의 정수이다. 다른 하나의 더 구체적인 예로, K 그룹의 채널 정보를 두 개 이상의 그룹으로 나누며, 각 그룹에 포함되는 채널 정보의 수는 다음과 같을 수 있다: 첫 번째 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 2 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 1 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 2 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 3 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 1 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 3 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 2 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 3 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 4 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 1 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 4 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 2 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 4 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 3 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 4 개의 채널 정보를 포함한 다; 첫 번째 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 2 개의 채널 정보를 포함하 며, 세 번째 채널 정보 그룹은 2 개의 채널 정보를 포함한다; 첫 번째 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 2 개의 채널 정보를 포함하 며, 세 번째 채널 정보 그룹은 1 개의 채널 정보를 포함한다. 각 그룹의 채널 정보의 채널 상태 정보를 결정할 때, 예를 들어 첫 번째 CSI를 별도로 처리하거나 하나의 CSI를 별도로 압축한다.채널 정보 H에서 CSI로의 처리 과정에서 채널 정보를 CSI로 처리하는 성능이 좋지 않은 경우, 즉 상기 CSI가 상 기 채널 정보와 매칭될 수 없거나 관련성이 적으면, 예를 들어, 제1 지시 정보가 제1 값을 취할 경우, 단말 및/ 또는 기지국은 제1 유형 프리코딩 정보를 사용하여 채널 정보 그룹 내의 채널 정보를 기술하고, 예를 들어, 채 널 정보 그룹 내의 채널 정보를 제1 유형 프리코딩 정보로 결정한다. 제1 지시 정보가 제2 값을 취할 경우, 단 말 및/또는 기지국은 제2 유형 프리코딩 정보를 사용하여 채널 정보 그룹 내의 채널 정보를 기술하고, 예를 들 어, 채널 정보 그룹 내의 채널 정보를 제2 유형 프리코딩 정보로 결정한다. 여기서, 제1 값이 0이고 제2 값이 1 이거나, 또는 제1 값이 0이고 제2 값이 0이 아닌 값이거나; 또는 제1 값이 FALSE이고 제2 값이 TRUE이다. 물론, 여기서 제1 값과 제2 값은 다른 상황의 실수 값을 취할 수도 있으며, 두 가지 상황을 구별할 수만 있으면 된다. 바람직하게는, 상기 H 그룹이 1 개의 H만 포함하는 경우, TypeII, eTypeII 등 DFT 관련 코드북 방식을 기반으로 채널 정보를 기술할 수 있다. 적어도 2 개의 H를 포함하고 제1 지시 정보가 제1 값이면, 채널 정보 그룹에 포함 된 적어도 2 개의 채널 정보를 각각 제1 유형 프리코딩 정보로 처리할 수 있고, 각 채널 정보의 처리는 모두 TypeII 코드북, eTypeII 등 DFT 관련 코드북 방식을 기반으로 상기 채널 정보를 기술할 수 있다. 일 실시예에서, 상기 출원 실시예의 기초상에, 제1 지시 정보를 피드백하는 것을 더 포함하며, 상기 제1 지시 정보는 채널 상태 정보 유형을 기술하는 데 사용된다. 일 예시적인 실시형태에서, M 개의 채널 정보에 기반하여 각각 M 개의 CSI를 획득하고, M 개의 채널 상태 정보 보고를 통해 피드백한다. M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 것은, M 개의 채널 정보를 M 개의 CSI에 각각 매핑하는 것을 말한다. M 개의 채널 정보가 H1, H2, ..., HM이고, 각각 슬롯 n1, …, nM의 채널 정보이며, 이들이 송수신 안테나의 수 및 대역폭과 관련된 채널 행렬이라고 가정한다. 또한, n1, …, nM은 오름 차순으로 정렬된 양의 정수이다. i 번째 그룹의 채널 정보를 i 번째 CSIi에 매핑하고, i=1, …, K이며, i 번째 CSI report로 K 번째 CSI를 피드백한다. 일 실시예에서, M 개의 report는 동일한 reportID를 가진다. 상기 M 개의 report는 하나의 슬롯에서 보고된다. 그럴 경우, 주파수 영역 그룹의 인덱스 크기에 따라 순차적으로 상기 M 개의 CSI를 피드백한다. 예를 들어, i 번째 주파수 영역 그룹은 i 번째 CSI report에 대응하는 CSI를 베어러하는 데 사용된다. 다른 실시예에서, M 개의 report는 동일한 reportID를 가진다. 상기 M 개의 report는 M 개의 슬롯에서 보고된다. 그럴 경우, 슬롯의 인덱스 크기에 따라 순차적으로 상기 M 개의 CSI를 피드백한다. 예를 들어, i 번 째 슬롯은 i 번째 CSI report에 대응하는 CSI를 베어러하는 데 사용된다. 다른 실시예에서, M 개의 report는 상이한 reportID를 가진다. 상기 M 개의 report는 M 개의 슬롯에서 보고된다. 그럴 경우, reportID의 크기, 슬롯의 인덱스 크기에 따라 순차적으로 피드백한다. 예를 들어, i 번째 슬롯은 i 번째로 큰 reportID에 대응하는 CSI report의 CSI를 베어러하는 데 사용된다. 도 12는 본 출원의 실시예에서 제공하는 채널 상태 정보 결정 장치의 구조 개략도이고, 본 출원 임의의 실시예 에서 제공하는 채널 상태 정보 결정 방법을 실행할 수 있으며, 방법을 실행하는데 상응한 기능 모듈 및 유익한 효과를 구비한다. 상기 장치는 소프트웨어 및/또는 하드웨어로 구현될 수 있으며 일반적으로 단말에 집성되며, 구체적으로, 정보 예측 모듈, 채널 상태 모듈 및 정보 피드백 모듈을 포함한다. 정보 예측 모듈은 N 개의 채널 정보에 따라 M 개의 채널 정보를 획득하는 데 사용된다. 채널 상태 모듈은 상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 데 사용된다. 정보 피드백 모듈은 상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하는 데 사용되며, 여기서 N은 1보다 큰 정수이고, M은 1보다 크거나 같은 정수이다. 일부 실시예의 장치에서, N 개의 채널 정보는 참조 슬롯 이전의 채널 정보이고, 상기 M 개의 채널 정보는 참조 슬롯 이후의 채널 정보이다. 일부 실시예의 장치에서, 채널 상태 모듈은: 상기 M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 데 사용되는 처리 유닛을 포함하며, 여기서 M은 양 의 정수이고, K는 M보다 작거나 같은 양의 정수이다. 일부 실시예에서, 처리 유닛은 상기 M 개의 채널 정보를 각각에 대응되는 슬롯의 크기에 따라 K 개의 채널 정보 그룹으로 분할하고; 상기 K 개의 채널 정보 그룹을 K 개의 제2 유형 프리코딩 정보로 처리하는 데 사용되며, 여기서 상기 K 및 상기 M은 1보다 크거나 같은 정수이고, 상기 K는 상기 M보다 작거나 같다. 다른 일부 실시예에서, 처리 유닛은 상기 M 개의 채널 정보를 그들이 위치하는 슬롯의 크기에 따라 순차적으로 인코딩한 후 하나의 상기 채널 상태 정보로 처리하는 데 사용된다. 다른 일부 실시예에서, 처리 유닛은 상기 M 개의 채널 정보를 M 개의 채널 상태 정보로 처리하는 데 사용되며, 여기서 하나의 채널 정보는 하나의 채널 상태 정보에 대응한다. 다른 일부 실시예에서, 처리 유닛은 상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에 순차적으로 매핑하는 데 사용된다. 다른 일부 실시예에서, K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 슬롯 크기에 따라 결정되거나, 상기 K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 인덱스 크기 에 따라 결정된다. 다른 일부 실시예에서, 상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응 하는 업링크 전송 자원에 순차적으로 매핑하는 것은: 상기 업링크 전송 자원을 K 개의 시간 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 시간 영역 자원 그룹에 매핑하는 것; 상기 업링크 전송 자원을 K 개의 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 주 파수 영역 자원 그룹에 매핑하는 것; 상기 업링크 전송 자원을 K 개의 시간 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번 째 시간 주파수 영역 자원 그룹에 매핑하는 것; 중 하나를 포함한다. 일부 실시예의 장치에서, K 개의 채널 정보 그룹 중의 i 번째 상기 채널 정보 그룹은 Xi 개의 채널 정보를 포함 하며, 여기서 Xi는 양의 정수이고, i=1, …, K이다. 본 출원 실시예에서, 분할된 K 개의 채널 정보 그룹에서, 각 채널 정보 그룹은 적어도 1 개의 채널 정보를 포함 한다. 하나의 더 구체적인 실시예에서, 각 채널 정보 그룹에 포함된 채널 정보의 수는 각각 다음 중 하나이다: 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 여기서 X1 및 X2는 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하며, 여기서 X1, X2 및 X3은 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하고, 네 번째 채널 정보 그룹은 X4 개의 채널 정보 를 포함하며, 여기서 X1 및 X2, X3, X4는 양의 정수이다. 다른 일부 실시예에서, 장치는 다음 중 하나를 포함한다: 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다;첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함하며, 세 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함하며, 세 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함한다. 다른 일부 실시예에서, 장치는 하나의 모듈을 더 포함하며, 상기 모듈은 다음 중 하나를 실행하도록 구성된다: 상기 채널 정보 그룹이 1 개의 채널 정보만 포함하고, 제1 지시 정보가 제1 값인 경우, 상기 1 개의 채널 정보 를 제1 유형 프리코딩 정보로 처리한다; 상기 채널 정보 그룹이 적어도 2 개의 채널 정보를 포함하고, 제1 지시 정보가 제1 값인 경우, 상기 적어도 2 개의 채널 정보를 적어도 1 개의 제1 유형 프리코딩 정보로 처리한다. 다른 일부 실시예에서, 장치는 하나의 모듈을 더 포함하며, 상기 모듈은 제1 지시 정보를 피드백하도록 구성되 고, 상기 제1 지시 정보는 채널 상태 정보 유형을 지시하는 데 사용된다. 다른 일부 실시예에서, 정보 피드백 모듈은 구체적으로 하나의 채널 상태 정보 보고에 대응되는 전송 자원 에서 상기 K 개의 채널 정보의 채널 상태 정보를 전송하는 데 사용된다. 다른 일부 실시예의 장치에서, 채널 상태 정보 보고는 제1 지시 정보를 포함하고, 상기 제1 지시 정보는 상기 채널 정보 그룹에 대응하는 채널 상태 정보의 채널 상태 정보 유형을 지시하는 데 사용된다. 다른 일부 실시예에서, 정보 피드백 모듈은 구체적으로 K 개의 채널 상태 정보 보고에 대응하는 전송 자원 에서 상기 K 개의 채널 정보의 채널 상태 정보를 전송하는 데 사용된다. 일부 실시예에서, K 개의 채널 상태 정보 보고의 보고 식별 정보는 동일하다. 일부 실시예에서, K 개의 채널 상태 정보 보고의 보고 식별 정보는 상이하다. 일부 실시예에서, K 개의 채널 상태 정보 보고는 하나의 슬롯에서 보고된다. 일부 실시예에서, K 개의 채널 상태 정보 보고는 K 개의 슬롯에서 보고된다. 일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보에 대응하는 상기 채널 상태 정보의 전송 자원에 대응하는 슬롯이 더 작다.일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보를 전송하는 전송 자원에 대응하는 슬 롯이 더 작다. 일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보에 대응하는 채널 상태 정보 보고에 대응하는 슬롯이 더 작다. 일부 실시예에서, 채널 상태 정보에 대응하는 슬롯이 작을수록, 상기 채널 상태 정보에 대응하는 채널 상태 정 보 보고에 대응하는 슬롯이 더 작다. 일부 실시예에서, 채널 상태 정보에 대응하는 슬롯이 작을수록, 상기 채널 상태 정보를 전송하는 전송 자원에 대응하는 슬롯이 더 작다. 일부 실시예에서, M 개의 채널 정보에 대응하는 채널 상태 정보의 제1 결정 시간은 상기 N 개의 채널 정보의 채 널 상태 정보를 결정하는 제2 결정 시간보다 작다. 도 13은 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 장치의 구조 개략도이고, 본 출원 임의의 실 시예에서 제공하는 채널 상태 정보 결정 방법을 실행할 수 있으며, 방법을 실행하는 데 상응한 기능 모듈 및 유 익한 효과를 구비한다. 상기 장치는 소프트웨어 및/또는 하드웨어로 구현될 수 있으며 일반적으로 단말에 집성 되며, 구체적으로, 정보 획득 모듈 및 정보 결정 모듈을 포함한다. 정보 획득 모듈은 채널 상태 정보를 획득하는 데 사용된다. 정보 결정 모듈은 채널 상태 정보에 대응하는 M 개의 채널 정보 또는 M 개의 채널 정보의 채널 상태 정보 를 결정하는 데 사용되며, 여기서 M 개의 채널 정보는 N 개의 정보에 의해 결정되고, N은 1보다 큰 정수이며, M 은 1보다 크거나 같은 정수이다. 일부 실시예에서, N 개의 채널 정보는 참조 슬롯 이전의 채널 정보이고, M 개의 채널 정보는 참조 슬롯 이후의 채널 정보이다. 일부 실시예에서, 상기 채널 상태 정보는 K 개이고, 상기 K 개의 채널 상태 정보는 M 개의 채널 정보 처리에 의 해 획득되며, 여기서 M은 양의 정수이고, K는 M보다 작거나 같은 양의 정수이다. 일부 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 것은: 상기 M 개의 채널 정보를 각각에 대응되는 슬롯의 크기에 따라 K 개의 채널 정보 그룹으로 분할하는 것; 상기 K 개의 채널 정보 그룹을 K 개의 제2 유형 프리코딩 정보로 처리하는 것; 을 포함하며, 여기서 상기 K 및 상기 M은 1보다 크거나 같은 정수이고, 상기 K는 상기 M보다 작거나 같다. 일부 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 것은: 상기 M 개의 채널 정보를 그들이 위치하는 슬롯의 크기에 따라 순차적으로 인코딩한 후 하나의 상기 채널 상태 정보로 처리하는 것을 포함한다. 일부 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 것은: 상기 M 개의 채널 정보를 M 개의 채널 상태 정보로 처리하는 것을 포함하며, 여기서 하나의 채널 정보는 하나의 채널 상태 정보에 대응한다. 일부 실시예에서, M 개의 채널 정보를 K 개의 채널 상태 정보로 처리하는 것은: 상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에 순차적으로 매핑하는 것을 포함한다. 일부 실시예에서, K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 슬롯 크기에 따라 결정되거나, 상기 K 개의 채널 상태 정보의 우선순위 값은 K 개의 채널 상태 정보에 대응되는 인덱스 크기에 따 라 결정된다. 일부 실시예에서, 상기 K 개의 채널 상태 정보를 우선순위 값에 따라 하나의 채널 상태 정보 보고에 대응하는 업링크 전송 자원에 순차적으로 매핑하는 것은: 상기 업링크 전송 자원을 K 개의 시간 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 시간 영역 자원 그룹에 매핑하는 것;상기 업링크 전송 자원을 K 개의 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번째 주 파수 영역 자원 그룹에 매핑하는 것; 상기 업링크 전송 자원을 K 개의 시간 주파수 영역 자원 그룹으로 나누고, k 번째 상기 채널 상태 정보를 k 번 째 시간 주파수 영역 자원 그룹에 매핑하는 것; 중 하나를 포함한다. 일부 실시예에서, K 개의 채널 정보 그룹 중의 상기 i 번째 채널 정보 그룹은 Xi 개의 채널 정보를 포함하며, 여기서 Xi는 양의 정수이고, i=1, …, K이다. 본 출원 실시예에서, 분할된 K 개의 채널 정보 그룹에서, 각 채널 정보 그룹은 적어도 1 개의 채널 정보를 포함 한다. 하나의 더 구체적인 실시예에서, 각 채널 정보 그룹에 포함된 채널 정보의 수는 각각 다음 중 하나이다: 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 여기서 X1 및 X2는 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하며, 여기서 X1, X2 및 X3은 양의 정수이다; 첫 번째 채널 정보 그룹은 X1 개의 채널 정보를 포함하고, 두 번째 채널 정보 그룹은 X2 개의 채널 정보를 포함 하며, 세 번째 채널 정보 그룹은 X3 개의 채널 정보를 포함하고, 네 번째 채널 정보 그룹은 X4 개의 채널 정보 를 포함하며, 여기서 X1 및 X2, X3, X4는 양의 정수이다. 일부 실시예에서, 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹 은 2 개의 채널 정보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 1 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 3 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 3 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 4 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 4 개의 채널 정 보를 포함한다; 첫 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함하며, 세 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함한다; 첫 번째 상기 채널 정보 그룹은 2 개의 채널 정보를 포함하고, 두 번째 상기 채널 정보 그룹은 2 개의 채널 정 보를 포함하며, 세 번째 상기 채널 정보 그룹은 1 개의 채널 정보를 포함한다. 일부 실시예에서, 상기 채널 정보 그룹이 1 개의 채널 정보만 포함하고 제1 지시 정보가 제1 값인 경우, 상기 1 개의 채널 정보를 제1 유형 프리코딩 정보로 처리하고; 상기 채널 정보 그룹이 적어도 2 개의 채널 정보를 포함 하고 제1 지시 정보가 제1 값인 경우, 상기 적어도 2 개의 채널 정보를 적어도 1 개의 제1 유형 프리코딩 정보 로 처리한다. 일부 실시예에서, 상기 장치는 모듈을 더 포함하고, 상기 모듈은 제1 지시 정보를 수신하도록 구성되며, 상기 제1 지시 정보는 채널 상태 정보 유형을 지시하는 데 사용된다. 일부 실시예에서, 정보 획득 모듈은, 하나의 채널 상태 정보 보고에 대응하는 전송 자원에서, 전송되는 K 개의 채널 정보의 채널 상태 정보 중 피드백되는 상기 채널 상태 정보를 획득하는 방식을 통해 채널 상태 정보 를 획득한다. 일부 실시예에서, 채널 상태 정보 보고는 제1 지시 정보를 포함하고, 상기 제1 지시 정보는 채널 상태 정보 유 형을 지시하는 데 사용된다. 일부 실시예에서, 상기 정보 획득 모듈은, K 개의 채널 상태 정보 보고에 대응되는 전송 자원에서, 전송되 는 K 개의 채널 정보의 채널 상태 정보를 획득하는 방식을 통해 채널 상태 정보를 획득한다. 일부 실시예에서, K 개의 채널 상태 정보 보고의 보고 식별 정보는 동일하다. 일부 실시예에서, K 개의 채널 상태 정보 보고의 보고 식별 정보는 상이하다. 일부 실시예에서, K 개의 채널 상태 정보 보고는 하나의 슬롯에서 보고된다. 일부 실시예에서, K 개의 채널 상태 정보 보고는 K 개의 슬롯에서 보고된다. 일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보에 대응하는 상기 채널 상태 정보의 전송 자원에 대응하는 슬롯이 더 작다. 일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보를 전송하는 전송 자원에 대응하는 슬 롯이 더 작다. 일부 실시예에서, 채널 정보에 대응하는 슬롯이 작을수록, 상기 채널 정보에 대응하는 채널 상태 정보 보고에 대응하는 슬롯이 더 작다. 일부 실시예에서, 채널 상태 정보에 대응하는 슬롯이 작을수록, 상기 채널 상태 정보에 대응하는 채널 상태 정 보 보고에 대응하는 슬롯이 더 작다. 일부 실시예에서, 채널 상태 정보에 대응하는 슬롯이 작을수록, 상기 채널 상태 정보를 전송하는 전송 자원에 대응하는 슬롯이 더 작다. 일부 실시예에서, M 개의 채널 정보에 대응하는 채널 상태 정보의 제1 결정 시간은 상기 N 개의 채널 정보의 채 널 상태 정보를 결정하는 제2 결정 시간보다 작다. 도 14는 본 출원의 실시예에서 제공하는 전자 설비의 구조 개략도이고, 상기 전자 설비는 프로세서, 메모리 입력 장치 및 출력 장치를 포함하며; 전자 설비에서 프로세서의 수는 하나 이상일 수 있으며, 도 14에서는 하나의 프로세서를 예로 들며; 전자 설비에서 프로세서, 메모리 입력 장치 및 출 력 장치는 버스 또는 기타 방식에 의해 연결될 수 있으며, 도 14에서는 버스를 통한 연결을 예로 든다. 메모리는 컴퓨터 판독 가능한 저장 매체로서, 소프트웨어 프로그램, 컴퓨터 실행 가능한 프로그램 및 모듈, 예를 들어, 본 출원 실시예의 채널 상태 정보 결정 장치에 대응하는 모듈(정보 예측 모듈, 정보 상태 모듈 및 정보 피드백 모듈, 또는 정보 획득 모듈 및 정보 결정 모듈)을 저장하도록 설치될 수 있다. 프로세서는 메모리에 저장되어 있는 소프트웨어 프로그램, 명령 및 모듈을 작동하여 전자 설비의 다양한 애플리케이션 및 데이터 처리를 실행하여 상기 방법을 구현한다. 메모리는 주로 프로그램 저장 영역 및 데이터 저장 영역을 포함할 수 있으며, 여기서, 프로그램 저장 영역 은 운영 시스템(Operating System), 적어도 하나의 기능에 필요되는 응용 프로그램을 저장할 수 있고; 데이터 저장 영역은 전자 설비의 사용에 따라 생성된 데이터 등을 저장할 수 있다. 또한, 메모리는 고속 랜덤 액세 스 메모리를 포함할 수 있고, 또한 적어도 하나의 자기 디스크 저장 소자, 플래시 메모리 소자, 또는 기타 비휘 발성 고체 상태 저장 소자와 같은 비휘발성 메모리를 포함할 수 있다. 일부 예시에서, 메모리는 프로세서 에 대해 원격으로 설치된 메모리를 더 포함할 수 있고, 이러한 원격 메모리는 네트워크를 통해 전자 설비에 연결될 수 있다. 상기 네트워크의 예는 인터넷, 인트라넷, 근거리 통신망, 이동 통신망 및 이들의 조합을 포함 하지만 이에 한정되지 않는다. 입력 장치는 입력된 숫자 또는 문자 정보를 수신하고, 전자 설비의 사용자 설정 및 기능 제어와 관련된 키 신호 입력을 생성하는데 사용될 수 있다. 출력 장치는 디스플레이 스크린 등 디스플레이 설비를 포함할 수 있다. 본 출원의 실시예는 컴퓨터 실행 가능한 명령을 포함하는 저장 매체를 더 제공하며, 상기 컴퓨터 실행 가능한 명령은 컴퓨터 프로세서에 의해 실행될 때 채널 상태 정보 결정 방법을 실행하며, 해당 방법은: N 개의 채널 정보에 따라 M 개의 채널 정보를 획득하는 단계; 상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 결정하는 단계; 상기 M 개의 채널 정보에 대응하는 채널 상태 정보를 피드백하는 단계; 를 포함하며, 여기서 N은 1보다 큰 정수 이고, M은 1보다 크거나 같은 정수이다. 또는, 채널 상태 정보를 획득하는 단계; 상기 채널 상태 정보에 대응하는 M 개의 채널 정보 또는 M 개의 채널 정보의 채널 상태 정보를 결정하는 단계; 를 포함하며, 여기서 상기 M 개의 채널 정보는 N 개의 정보에 의해 결정되고, 여기서, N은 1보다 큰 정수이고, M은 1보다 크거나 같은 정수이다. 상술한 실시형태에 대한 기술에 따르면, 본 출원은 소프트웨어 및 필요한 범용 하드웨어에 의해 구현될 수 있고, 물론 하드웨어에 의해 구현될 수도 있지만, 많은 경우 전자가 더 나은 실시 방식이라는 것을 당업자는 명 백하게 이해할 수 있다. 이러한 이해에 기초하여, 본 출원의 기술방안은 실질적으로 또는 종래 기술에 대해 기 여한 부분은 소프트웨어 제품의 형태로 구현될 수 있고, 해당 컴퓨터 소프트웨어 제품은 컴퓨터로 판독 가능한 저장 매체, 예를 들어 컴퓨터의 플로피디스크, 읽기 전용 메모리(Read-Only Memory, ROM), 랜덤 액세스 메모리 (Random Access Memory, RAM), 플래쉬 메모리(FLASH), 하드 디스크 또는 컴팩트 디스크 등에 저장될 수 있고, 복수의 명령을 포함하여 하나의 컴퓨터 설비(개인용 컴퓨터, 서버 또는 네트워크 설비 등)가 본 출원의 각 실시 예에 따른 방법을 수행하도록 한다. 상기 장치의 실시예에서, 포함된 각 유닛과 모듈은 기능적 논리에 따라 구분되었을 뿐, 상응하는 기능을 구현할 수 있는 한, 상기 구분에 한정되지 않고; 또한, 각 기능 유닛의 명칭은 단지 구분의 편의를 위한 것일 뿐, 본 출원의 보호범위를 제한하기 위해 사용된 것은 아님을 유의해야 한다. 본 분야 일반 기술자는 상기에 개시된 방법 중의 전부 또는 일부 단계, 시스템 및 설비 중의 기능 모듈/유닛이 소프트웨어, 펌웨어, 하드웨어 및 그 적절한 조합으로 구현될 수 있음을 이해할 수 있다. 하드웨어 실시형태에서, 위의 기술에서 언급된 기능 모듈/유닛 사이의 구분은 반드시 물리적 컴포넌트의 구분과 반드시 대응되는 것은 아니다. 예를 들어, 하나의 물리적 컴포넌트가 여러 기능을 가질 수 있거나, 하나의 기능 또는 단계가 여러 물리적 컴포넌트에 의해 협력적으로 실행될 수 있다. 일부 물리적 컴포넌트 또는 모든 물리적 컴포넌트는 중앙처리장치, 디지털 신호 프로세서 또는 마이크로 프로세서와 같은 프로세서에 의해 실행되는 소 프트웨어, 또는 하드웨어, 또는 주문형 집적 회로와 같은 집적 회로로서 구현될 수 있다. 이러한 소프트웨어는 컴퓨터 판독 가능 매체에 배치될 수 있으며, 컴퓨터 판독 가능 매체는 컴퓨터 저장 매체(또는 비일시적 매체)와 통신 매체(또는 일시적 매체)를 포함할 수 있다. 본 분야 일반 기술자에게 잘 알려진 바와 같이, 컴퓨터 저장 매체라는 용어는 정보(예를 들어, 컴퓨터 판독 가능 명령, 데이터 구조, 프로그램 모듈 또는 기타 데이터)를 저 장하는데 사용되는 임의의 방법 또는 기술을 구현하는 휘발성 및 비휘발성, 착탈형 및 비착탈형 매체를 포함한다. 컴퓨터 저장 매체에는 RAM, ROM, 전기적 소거 가능한 읽기 전용 메모리(Electrically Erasable Programmable Read-Only Memory, EEPROM), 플래시 메모리 또는 기타 메모리 기술, 컴팩트 디스크 읽기 전용 메 모리(Compact Disc Read-Only Memory, CD-ROM), 디지털 다기능 디스크(Digital Versatile Disc, DVD) 또는 기 타 광 디스크 메모리, 자기 카트리지, 테이프, 디스크 메모리 또는 기타 자기 저장 장치, 또는 원하는 정보를 저장하는데 사용할 수 있으며 컴퓨터에 의해 액세스될 수 있는 임의의 기타 매체를 포함하지만 이에 한정되지 않는다. 또한, 통신 매체는 일반적으로 컴퓨터 판독 가능 명령, 데이터 구조, 프로그램 모듈, 또는 캐리어 또는 기타 전송 메커니즘과 같은 변조된 데이터 신호 중의 기타 데이터를 포함하고, 임의의 정보 전달 매체를 포함할 수 있음은 본 분야 일반 기술자에게 잘 알려져 있다. 이상으로 도면을 참조하여 본 출원의 바람직한 실시예를 설명하였지만, 이로써 본 출원의 권리범위가 한정되는 것은 아니다. 당업자가 본 출원의 범위 및 실질적 내용을 벗어나지 않고 진행한 임의의 수정, 등가적 교체 및 개선은 모두 본 출원의 권리범위 내에 있어야 한다."}
{"patent_id": "10-2025-7001583", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 출원의 실시예에서 제공하는 채널 상태 정보 예측의 예시도이다. 도 2는 본 출원의 실시예에서 제공하는 채널 상태 정보 결정 방법의 흐름도이다. 도 3은 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이다. 도 4는 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이다. 도 5는 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이다. 도 6은 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이다. 도 7은 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 방법의 흐름도이다. 도 8은 본 출원의 실시예에서 제공하는 채널 상태 정보 결정 방법의 흐름도이다. 도 9는 본 출원의 실시예에서 제공하는 시간 영역 자원에서 채널 상태 정보를 인코딩하는 예시도이다. 도 10은 본 출원의 실시예에서 제공하는 주파수 영역 자원에서 채널 상태 정보를 인코딩하는 예시도이다. 도 11은 본 출원의 실시예에서 제공하는 시간 주파수 영역 자원에서 채널 상태 정보를 인코딩하는 예시도이다. 도 12는 본 출원의 실시예에서 제공하는 채널 상태 정보 결정 장치의 구조 개략도이다. 도 13은 본 출원의 실시예에서 제공하는 다른 채널 상태 정보 결정 장치의 구조 개략도이다. 도 14는 본 출원의 실시예에서 제공하는 전자 설비의 구조 개략도이다."}
