{"patent_id": "10-2021-0040427", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0071085", "출원번호": "10-2021-0040427", "발명의 명칭": "안전정보제공장치", "출원인": "광주과학기술원", "발명자": "전해곤"}}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "학습모델이 탑재되어 상기 학습모델로 위치정보가 입력되고, 상기 위치정보에 대응하는 안전정보를 제공하는 인공지능장치이고, 상기 학습모델을 학습하는 네트워크 장치에는, 일탈행위가 일어난 곳의 복수의 이미지와 상기 일탈행위의 클래스를 포함하는 입력데이터를 인코딩하는 인코더;상기 복수의 이미지가 인코딩된 이미지의 특징점을 매칭하는 어텐션 모듈;상기 어텐션 모듈로 추출한 특징점과, 상기 인코딩된 피쳐를 업셈플링(Upsampling)하여 업셈플링된 피쳐를 생성하는 업셈플러; 및상기 업셈플링된 피처를 학습하여 상기 학습모델을 제공하는 시공간뉴럴네트워크가 포함되는, 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 인코더는 ResNet(Resifual network)기반의 인코더인 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 복수의 이미지는, 100미터를 등간격으로 구분하는 16장의 이미지를 포함하는 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 시공간뉴럴네트워크로는 변형된 HATNet(Holistic Appearance and Temporal Network)를 사용하는 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 일탈행위는 네 개의 클래스로 구분되어 학습되는 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 네트워크장치의 손실함수는, 이고, 여기거, LD는 판별손실이고, LC는 분류손실이고, 람다 1은 스케일링 팩터인 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 상기 분류손실은공개특허 10-2022-0071085-3-이고, 여기서, y는 참 값(ground truth)이고, y햇은 예측값이고, 람다 2는 상기 람다 1과 유사하게 하인리히 손실 H과크로스 엔트로피 사이의 밸런스 팩터이고, 상기 하인리히 손실 H는이고, 여기서, prior는 이전 클래스를 의미하고, y는 참 값(ground truth)이고, y햇은 예측값인, 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 h는, h1=0.909, h2=0.088(29/330), 및 h3=0.003인, 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서, 상기 위치정보로서 이미지정보가 입력되고, 상기 학습모델은, 상기 이미지정보에 근거하여 안전한지의 여부를 안정정보로서 출력하는 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서, 상기 위치정보로서 출발지정보 및 목적지정보가 입력되고, 상기 학습모델은, 상기 출발지정보 및 상기 목적지정보를 이용하여, 상기 출발지로부터 상기 목적지에 이르는안전한 경로정보를 제공하는 안전정보제공장치."}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 안전정보제공장치는, 학습모델이 탑재되어 상기 학습모델로 위치정보가 입력되고, 상기 위치정보에 대 응하는 안전정보를 제공하는 인공지능장치이다."}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 안전정보를 제공하는 안전정보제공장치에 관한 것이다. 상기 안전정보에는 경로정보를 포함할 수 있 다. 상기 경로는 사람이 안전하게 이동할 수 있는 경로를 포함할 수 있다."}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "초행지에서 출발지로부터 목적지를 찾아가는 것은, 일반적인 차량 네비게이션 또는 보행 네비게이션을 통하여 제공받은 경로를 이용하여, 손쉽게 수행할 수 있다. 그러나, 상기 경로가 안전한지 불안전한지는 제대로 알지 못한다. 예를 들어, 제 1 경로가 제 2 경로보다 보행거리는 멀더라도, 제 2 경로가 안전하다면 제 2 경로를 경로로 제공 하는 것은, 보행자에게 큰 이익이 된다고 할 수 있다. 물론, 동일한 수준의 안전정도를 얻을 수 있다면, 보행자 는 짧은 거리를 걷는 것이 바람직할 것이다. 종래 거주자의 안전을 고려하는 방법으로는, 먼저, RSS-CNN의 방법(제 1 종래기술)이 있다. 상기 제 1 종래기술 은 깨진 창문이론에 기반하여 거리의 개별 이미지를 이용하여 도시의 안전성을 판단하는 방법 제안한다. 다른 방법으로는, SEHNet의 방법(제 2 종래기술)이 있다. 상기 제 2 종래기술은 거리의 개별 이미지를 참조하여 환경 및 건강의 차이를 제시하는 문헌이 있다. 상기 종래기술은 개별 이미지를 이용하여 도시의 안전성 및 거주환경의 적합성을 제시하였다. 상기 종래기술은 보행자가 출발지로부터 목적지로가는 안전을 고려하는 최적경로를 제공할 수 없는 문제점이 있다. 선행기술문헌 비특허문헌 (비특허문헌 0001) RSS-CNN: Abhimanyu Dubey, Nikhil Naik, Devi Parikh, Ramesh Raskar, and Cesar A Hidalgo. Deep learning the city: Quantifying urban perception at a global scale. In In Proceedings of the European conference on computer vision. Springer, 2016. (비특허문헌 0002) SEHNet: Esra Suel, John W Polak, James E Bennett, and Majid Ezzati. Measuring social, environmental and health inequalities using deep learning and street imagery. Scientific reports, 9:1-10, 2019."}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 사람이 출발지로부터 목적지로 안전하게 안전하게 이동하는 경로를 제공하는 안전정보제공장치를 제 안한다. 본 발명은 사람의 일탈행위에 기반하여 타인의 다양한 위해로부터 안전하게 이동할 수 있는 경로를 제공하는 안 전정보제공장치를 제안한다."}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 안전정보제공장치는, 학습모델이 탑재되어 상기 학습모델로 위치정보가 입력되고, 상기 위치정보에 대응하는 안전정보를 제공하는 인공지능장치이다. 상기 상기 학습모델을 학습하는 네트워크 장치에는, 일탈행위가 일어난 곳의 복수의 이미지와 상기 일탈행위의 클래스를 포함하는 입력데이터를 인코딩하는 인코더; 상기 복수의 이미지가 인코딩된 이미지의 특징점을 매칭하 는 어텐션 모듈; 상기 어텐션 모듈로 추출한 특징점과, 상기 인코딩된 피쳐를 업셈플링(Upsampling)하여 업셈플 링된 피쳐를 생성하는 업셈플러; 및 상기 업셈플링된 피처를 학습하여 상기 학습모델을 제공하는 시공간뉴럴네 트워크가 포함된다. 상기 인코더는 ResNet(Resifual network)기반의 인코더로 제공될 수 있다. 상기 복수의 이미지는, 100미터를 등간격으로 구분하는 16장의 이미지를 포함하여, 동적으로 변하는 더 많은 정 보를 포함할 수 있다. 더 많은 정보가 학습됨으로써, 인공지능의 성능을 더 향상시킬 수 있다. 상기 시공간뉴럴네트워크로는 변형된 HATNet(Holistic Appearance and Temporal Network)를 사용할 수 있다. 상기 일탈행위는 네 개의 클래스로 구분되어 학습될 수 있다. 상기 네트워크장치의 손실함수는, 이고, 여기거, LD는 판별손실이고, LC는 분류손 실이고, 람다 1은 스케일링 팩터로 제공될 수 있다. 상기 분류손실은 이고, 여기서, y는 참 값(ground truth)이고, y햇은 예측값이 고, 람다 2는 상기 람다 1과 유사하게 하인리히 손실 H과 크로스 엔트로피 사이의 밸런스 팩터일 수 있다. 상기 하인리히 손실 H는 이고, 여기서, prior는 이전 클래스를 의미하고, y 는 참 값(ground truth)이고, y햇은 예측값일 수 있다. 상기 h는, h1=0.909, h2=0.088(29/330), 및 h3=0.003로서, 하인리히법칙을 반영하여 예측의 정확도를 크게 할 수 있다. 상기 위치정보로서 이미지정보가 입력되고, 상기 학습모델은, 상기 이미지정보에 근거하여 안전한지의 여부를 안정정보로서 출력할 수 있다. 상기 위치정보로서 출발지정보 및 목적지정보가 입력되고, 상기 학습모델은, 상기 출발지정보 및 상기 목적지정 보를 이용하여, 상기 출발지로부터 상기 목적지에 이르는 안전한 경로정보를 제공할 수 있다."}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 현재 특정의 거리가 타인의 위해로부터 안전한지를 쉽게 알아낼 수 있다. 본 발명에 따르면, 출발지로부터 목적지를 향하는 안전한 경로를 제공받을 수 있다."}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 구체적인 실시예를 상세하게 설명한다. 다만, 본 발명의 사상은 이하의 실시예에 제한되지 아니하고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에 포함되는 다른 실 시예를 구성요소의 부가, 변경, 삭제, 및 추가 등에 의해서 용이하게 제안할 수 있을 것이나, 이 또한 본 발명 사상의 범위 내에 포함된다고 할 것이다. 실시예에 따른 안전정보제공장치는 사람의 일탈행위를 네 단계(클래스)로 구분하고, 상기 네 클래스로 구분되는 일탈행위의 발생을 안전정보에 활용하는 것을 일 특징으로 한다. 상기 일탈행위는 보행의 안전에 영향을 줄 수 있다. 상기 클래스는, 문화, 및 지역 등에 따라서 서로 달라질 수 있으며, 예를 들어, 상기 클래스는 다음과 같이 네 개의 클래스로 구분될 수 있다. 제 1 클래스로서 중요범죄(Consensus crimes)이 포함될 수 있다. 상기 중요범죄에는, 살인(Homicide), 성적학대 (Sexual abuse), 납치(Kidnap), 절도(Theft), 강도(Robbery), 아동관련범외(Offense involving children), 중 대살인(Grand larceny) 등의 일탈이 포함될 수 있다. 제 2 클래스로서 충돌범죄 또는 기타범죄(Conflict crimes)가 포함될 수 있다. 상기 기타범죄에는, 매춘 (Prostitution), 도박(Gambling), 약물사범(Drug abuse), 차량절도(Motor vehicle theft), 마약(Narcotics), 총기사고(Weapons violation), 성범죄(Sex crime), 위험약물(Dangerous drugs) 등의 일탈이 포함될 수 있다. 제 3 크래스로서, 사회일탈(Social deviations)이 포함될 수 있다. 상기 사회일탈에는, 교통사고(Traffic accident), 자살(Suicide), 공적충돌(Interference with officer), 학대(Harassment) 등의 일탈이 포함될 수 있다. 제 4 클래스로는, 사회비행(Social diversions)이 포함될 수 있다. 상기 사회비행에는, 층간소음(Inter-floor noise), 사회평화저해(Public peace violation), 고성방가(Loud music/Party), 기술파손(Blocked hydrant) 등 의 일탈이 포함될 수 있다. 상기 클래스의 각 일탈행위는 위치, 법체계, 지역, 및 법감정 등에 따라서 달라질 수 있다, 그러나 숫자가 낮을 수록 중대한 일탈행위이고, 숫자가 높을 수록 가벼운 일탈행위인 것은 명확하다. 상기 1-4 클래스로 구분되지 않는 정보는 제 5 클래스라고 할 수 있다. 제 5 클래스는 일탈행위가 전혀없거나, 사람이 없어서 일탈이 발생할 수 없는 곳을 말할 수 있다. 도 1은 실시예에 따른 안전정보제공장치의 구성도이다. 도 1을 참조하면, 학습된 모델(학습모델)이 탑재되는 인공지능장치가 포함될 수 있다. 상기 인공지능장치 에는 상기 학습모델이 동작하기 위한 메모리, 전원장치, 통신장치 및 기타 여러 구성이 포함되는 것은 당 연히 이해할 수 있을 것이다. 상기 학습모델은 위치정보를 입력받을 수 있다. 상기 학습모델은 상기 위치정보에 기반하여 안정정보를 제공할 수 있다. 상기 학습모델은 상기 위치정보에 기반하여 경로정보를 제공할 수 있다. 상기 위치정보에는, 사용자가 입력하는 거리의 이미지정보, 사용자가 위치하는 출발지정보, 사용자가 가고자 하 는 목적지정보가 입력될 수 있다. 상기 위치정보로서, 상기 이미지정보가 입력될 수 있다. 상기 이미지정보는 사람이 현재 위치하는 곳의 이미지 정보일 수 있다. 이 경우에, 상기 학습모델은 상기 이미지정보를 참조하여 이미지가 상기 1-4 클래스 중의 어디 에 포함되는지를 판단할 수 있다. 예를 들어, 상기 이미지정보와 대응하는 클래스가 제 1 클래스인 경우에는 상 기 안정정보로서 위험한 장소인 것을 출력할 수 있다. 상기 위치정보로서, 상기 출발지정보 및 상기 목적지정보가 입력될 수 있다. 상기 출발지정보 및 상기 목적지 정보는 지도 상의 특정지점일 수 있다. 상기 특정지점은 GPS정보일 수 있다. 상기 학습모델은, 상기 출발지정보 및 상기 목적지정보를 이용하여, 상기 출발지로부터 상기 목적지에 이르는 안전한 경로정보를 제공할 수 있다. 이 경우에, 상기 출발지와 목적지를 잇는 경로상의 각 거리(street)는 이미지정보를 이용하여 안전한 곳인지 안 전하지 않는 곳인지가 미리 판단되어 있을 수 있다. 이 경우에 안전정보는 상기 경로정보에 반영될 수 있다. 예 를 들어, 대상이 되는 영역의 각 거리(street)의 이미지정보를 이용하여 그 거리가 안전한지의 여부가 미리 판 단되어 있을 수 있다. 사용자는 상기 인공지능장치를 이용하여, 안전정보 또는 경로정보를 제공받을 수 있다. 도 2는 상기 인공지능장치에 탑재되는 학습모델을 제공하는 네트워크장치를 보이는 도면이다. 도 2를 참조하면, 어느 상기 클래스에 포함되는 일탈행위가 발생한 곳의 이미지를 입력데이트로 입력받을 수 있다. 상기 입력데이터는 소정의 거리를 간격으로 이어지는 10-20장의 개별 이미지가 입력될 수 있다. 예를 들 어, 100미터를 등간격으로 구분하는 16장의 이미지가 입력될 수 있다. 예를 들어, 상기 입력데이터의 각 이미지 는 시간 순으로 정렬될 수 있다. 예를 들어, 상기 입력데이터의 크기는 [3(RGB), 16(slice), 224(H), 224(W)] 로 제공될 수 있다. 상기 입력데이터는 인코더에서 인코딩될 수 있다. 상기 인코더는 ResNet(Resifual network)기반의 인코더 일 수 있다. 상기 인코더는 상기 각 이미지의 피쳐를 인코딩할 수 있다. 상기 인코더에서 인코딩 된 결과물에는, 어텐션(attention) 모듈이 적용될 수 있다. 상기 어텐션 모듈은 슈퍼포인트(SuperPoint) 기반의 모듈이 적용될 수 있다. 상기 SuperPoint는 이미지의 특징점을 찾아서 비슷한 포인트를 매칭하는 네트워크일 수 있다. 상기 입력데이터 에 포함되는 정렬되는 각 이미지의 특성에 의해서, 상기 각 이미지가 넓은 간격을 가질 수 있다. 이 문제를 해 결하기 위하여, 상기 superpoint 네트워크 중의 Attention 모듈이 본 네트워크 장치에 적용될 수 있다. 이후 SuperPoint 기반의 어텐션 모듈로 추출한 특징점과, ResNet을 통해 생성한 피쳐를 업셈플러에서 업 셈플링(Upsampling)할 수 있다. 상기 업셈플러에 의해서 비디오에 대한 피쳐를 생성할 수 있다. 상기 피처를 시공간뉴럴네트워크(spatio-temporal neural network)로 학습할 수 있다. 상기 시공간뉴럴네트 워크로는 변형된 Holistic Appearance and Temporal Network(HATNet)가 적용될 수 있다. 상기 HATNet는 Ali Diba, Mohsen Fayyaz, Vivek Sharma, Manohar Paluri, Jurgen Gall, Rainer Stiefelhagen, and Luc Van Gool. Large scale holistic video understanding. In In Proceedings of the European Conference on Computer Vision. Springer, 2020.에 개시되어 있고, 그 상세한 정보는 개시된 내용이 본 설명에 포함되는 것으로 할 수 있다. 상기 HATNet는 2D, 3D 컨볼루션 블록을 병렬형식으로 구성하는 모델이다. 본 실시예는 상기 HATNet를 변형할 수 있다. 구체적으로, 3D 컨볼루션 블록을 (2+1)로 대체하고 블럭 끝에 넌로 컬(Non-local) 모듈을 추가하여 비교적 좋은 성능과 최적화 안정성을 얻도록 할 수 있다. 특히, 2D 컨볼루션 블록은 개별 이미지의 정적인 특징을 학습하고, (2+1)D 블록과 Non-local 블록은 이미지 프레임간의 상대적인 시 간적 정보를 학습할 수 있다. 상기 HATNet의 변형과 관련해서는 Du Tran, Heng Wang, Lorenzo Torresani, Jamie Ray, Yann LeCun, and Manohar Paluri. A closer look at spatiotemporal convolutions for action recognition. In Proceedings of the IEEE conference on Computer Vision and Pattern Recognition, 2018.에 개시되어 있고, 그 상세한 정보는 개시된 내용이 본 설명에 포함되는 것으로 할 수 있다. 상기 시공간뉴럴네트워크의 마지막 블럭은, 2D와 3D 블록에서 추출된 정보를 병합하여 상기 학습모델을 제공할 수 있다. 상기 학습모델을 제공하는 네트워크장치의 손실함수는 수학식 1로 주어질 수 있다. 수학식 1"}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 수학식 1의 손실 함수는, 판별손실(LD)과 분류손실(LC)의 합으로 구성될 수 있다. 상기 판별손실(LD)은 해 당 입력(이미지)가 일탈을 포함하는지 여부를 판별할 수 있다. 상기 분류손실(LC)은 해당 입력(이미지)가 일탈을 포함하는 경우 어떤 일탈 클래스에 해당되는지 판단할 수 있다. 상기 각 손실은, 크로스 엔트로피로 계산될 수 있다. 상기 람다 1은, 상기 판별손실과 상기 분류손실을 대략 동일하게 유지하도록 선택되는 스케일링 팩터일 수 있다. 상기 분류손실은 수학식 2와 같이 정의할 수 있다. 수학식 2"}
{"patent_id": "10-2021-0040427", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, y는 참 값(ground truth)이고, y햇은 예측값이고, 람다 2는 상기 람다 1과 유사하게 하인리히 손실 H과 크로스 엔트로피 사이의 밸런스 팩터이다. 상세하게, 상기 하인리히 손실 H는 로 정의할 수 있다. 여기서, prior는 이전 클래스를 의미하고, y는 참 값(ground truth)이고, y햇은 예측값이고, H는 인접 클래스 간의 관계를 반영할 수 있다. 상기 가중치 h는 하인리히 법칙을 따르는 1:29:300 비율의 가중치를 적용할 수 있다. 여기서 하인리히 법칙은, 어떤 대형 사고가 발생하기 전에는 그와 관련된 수십 차례의 경미한 사고와 수백 번의 징후들이 반드시 나타난 다는 것을 뜻하는 통계적 법칙이다. 상기 하인리히 법칙을 따라서, h1=0.909(300/330), h2=0.088(29/330), 및 h3=0.003(1/330)과 같이 설정할 수 있다. 상기 하인리히 법칙은 사고에 대하여 적용이 가능한 것으로 제시되었 으나, 실시예와 같이 사람에 기인하는 재난에 대하여도 적용할 수 있다. 실시예의 클래스는 이미 본 바와 같이 네 개의 클래스로 구분할 수 있기 때문에, 상기 하인리히 법칙이 적용될 수 있다. 상기 손실함수를 이용하여 다수의 상기 입력데이터에 대하여 학습이 수행될 수 있다. 이미 설명한 바와 같이, 상기 학습모델은 상기 인공지능장치에 탑재될 수 있다. 상기 인공지능장치는 안전 정보제공장치로 동작할 수 있다. 좁은 의미에서 상기 인공지능장치는 경로를 제공하는 안정정보제공장치로 동작 할 수 있다. 본 발명에 따른 안전정보제공장치의 동작결과를 도 3을 참조하여 설명한다. 도 3은 실시예의 안전정보제공장치의 수행결과를 표로 나타내는 도면이다. 도 3을 참조하면, 서울, 인천, 부산, 대구, 및 대전의 각 거리를 이미지정보를 상기 학습모델에 입력한 결과를 보이고 있다. 각 이미지정보를 입력하였을 때, 그 이미지정보가 속하는 클래스를 네 개의 클래스로 잘 구분해 내는 것을 확인할 수 있다. 상기 제 5 클래스는 일탈행위와는 무관한 것으로서, 일탈행위가 발생한 적이 없는 것을 나타낼 수 있다. 도 4는 실시예의 안전정보제공장치가 경로를 제공하는 경우의 수행결과를 설명하는 도면으로서, 도 4(a)는 뉴욕 의 범죄기록을 거리에 나타낸 도면이고, 도 4(b)는 실제 출발지와 목적지로 경로검색을 수행한 결과를 나타낸다. 도 4를 참조하면, RSS-CNN, 및 SEHNet에 비하여 실시예의 장치(DevianceNet)가 가장 좋은 결과를 얻은 것을 볼 수 있다. 여기서, 좋은 결과라는 것은, 위험한 클래스의 거리를 잘 피하는 것, 및 가급적 짧은 경로를 제안하는 것의 결과를 의미할 수 있다. 상기 RSS-CNN는 경로는 짧지만 일탈행위가 발생한 곳을 통과하도록 경로를 제공하는 문제점이 있다. 상기 SEHNet는 일탈행위가 발생한 곳은 피하지만, 거리가 멀어지는 문제점이 있다. 산업상 이용가능성 본 발명에 따르면, 사람이 익숙하지 않는 곳에서, 거리(street)의 안전정보를 더 정확하게 판단하고 이동할 수 있다. 본 발명은 사람 및 차량의 이동을 안내하는 장치에 이용될 수 있다."}
{"patent_id": "10-2021-0040427", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 안전정보제공장치의 구성도. 도 2는 인공지능장치에 탑재되는 학습모델을 제공하는 네트워크장치를 보이는 도면. 도 3은 실시예의 안전정보제공장치의 수행결과를 표로 나타내는 도면. 도 4는 실시예의 안전정보제공장치가 경로를 제공하는 경우의 수행결과를 설명하는 도면으로서, 도 4(a)는 뉴욕 의 범죄기록을 거리에 나타낸 도면이고, 도 4(b)는 실제 출발지와 목적지로 경로검색을 수행한 결과를 나타내는 도면."}
