{"patent_id": "10-2023-0119599", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0021933", "출원번호": "10-2023-0119599", "발명의 명칭": "하우징과 힌지 하우징을 포함하는 접이식 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이지훈"}}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "접이식 전자 장치에 있어서,제1 하우징;제2 하우징;상기 제1 하우징과 상기 제2 하우징을 연결하는 적어도 하나의 힌지 구조물;상기 제1 하우징과 상기 제2 하우징 및 상기 적어도 하나의 힌지 구조물 상에 놓이는 플렉서블 디스플레이;상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되는 힌지 하우징;을 포함하고, 상기 제1 하우징은 상기 접이식 전자 장치가 접힘 상태일 때, 상기 힌지 하우징을 바라보는 제1 방향을 기준으로, 상기 힌지 하우징의 일측과 적어도 일부가 중첩되는 제1 돌출 구조;를 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 돌출 구조는, 상기 접이식 전자 장치가 접힘 상태일 때, 상기 제1 하우징의 내측면에서 상기 힌지 하우징의 방향으로 돌출되어 상기 힌지 하우징의 상단 위에 배치되는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 접이식 전자 장치가 펼침 상태일 때, 상기 힌지 하우징의 배면과 대면되는 제1 하우징의 내측 곡면의 중심점은 상기 제1 돌출 구조의 중심점과 일치되며,상기 접이식 전자 장치가 접힘 상태일 때, 상기 제1 하우징의 내측 곡면의 중심점은 상기 제1 돌출 구조의 중심점과 일치되는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 힌지 하우징은, 상기 플렉서블 디스플레이 방향으로 개구되어 상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되며, 상기제1 방향의 단면의 적어도 일부가 곡선을 포함하는 힌지 하우징 바디; 상기 힌지 하우징 바디의 양측 가장자리에 형성된 제1 힌지 하우징 측벽 및 제2 힌지 하우징 측벽;을 포함하고, 상기 접이식 전자 장치는 상기 제1 힌지 하우징 측벽에 거치되는 보호 부재;를 더 포함하고,상기 보호 부재는,상기 제1 돌출 구조의 적어도 일부가 안착되는 제1 홈;을 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제1 하우징은, 공개특허 10-2025-0021933-3-상기 제1 하우징의 외측면에서 내측면 방향으로 관통되는 하우징 홀;을 포함하고,상기 제1 돌출 구조는 상기 제1 하우징의 외측면에서 상기 하우징 홀에 삽입되어 제1 힌지 하우징 측벽 방향으로 돌출되는, 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 제1 돌출 구조와 상기 하우징 홀을 형성하는 주변부 사이의 적어도 일부 영역에 배치되는 접착 부재;상기 하우징 홀을 형성하는 주변부와 상기 제1 돌출 구조 사이 적어도 일부 영역에 배치되는 패킹 부재; 중 적어도 하나를 더 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 하우징 홀은 상기 제1 하우징의 외곽에서 내측면으로 갈수록 개구의 크기가 변경되는 것을 특징으로 하는접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 하우징 홀은 제1 크기의 제1 하우징 홀과, 상기 제1 하우징 홀과 연결되며 상기 제1 크기보다 작은 제2 크기의 제2 하우징 홀을 포함하고,상기 제1 돌출 구조는, 상기 제1 하우징 홀에 안착되는 제1 지지 구조 및 상기 제2 하우징 홀에 일부가 안착되면서 상기 힌지 하우징 방향으로 더 돌출되는 제1 돌출 부분을 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제5항에 있어서,상기 접이식 전자 장치가 접힘 상태일 때, 제1 돌출 구조의 중심의 위치와 상기 접이식 전자 장치가 펼침 상태일 때 상기 제1 돌출 구조의 중심의 위치는 동일한 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제4항에 있어서,상기 제2 하우징은 상기 접이식 전자 장치가 접힘 상태일 때, 상기 제1 방향을 기준으로, 상기 힌지 하우징의 타측과 적어도 일부가 중첩되는 제2 돌출 구조;를 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 보호 부재는, 상기 제2 돌출 구조의 적어도 일부가 거치되는 제2 홈;을 더 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 제2 하우징은, 상기 제2 하우징의 외측면에서 내측면 방향으로 관통되는 제2 하우징 홀;을 포함하고,공개특허 10-2025-0021933-4-상기 제2 돌출 구조는 상기 제2 하우징의 외측면에서 상기 제2 하우징 홀에 삽입되어 제2 힌지 하우징 측벽 방향으로 돌출되는, 것을특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 제2 돌출 구조와 상기 제2 하우징 홀을 형성하는 주변부 사이의 적어도 일부 영역에 배치되는 접착 부재;를 더 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,상기 접이식 전자 장치가 펼침 상태일 때, 상기 힌지 하우징의 배면과 대면되는 제2 하우징의 내측 곡면의 중심점은 상기 제2 돌출 구조의 중심점과 일치되며, 상기 접이식 전자 장치가 접힘 상태일 때, 상기 제2 하우징의 내측 곡면의 중심점은 상기 제2 돌출 구조의 중심점과 일치되는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서,상기 접이식 전자 장치가 접힘 상태일 때, 제2 돌출 구조의 중심의 위치와 상기 접이식 전자 장치가 펼침 상태일 때 상기 제2 돌출 구조의 중심의 위치는 동일한 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "접이식 전자 장치에 있어서, 제1 하우징;제2 하우징;상기 제1 하우징과 상기 제2 하우징을 연결하는 적어도 하나의 힌지 구조물;상기 제1 하우징과 상기 제2 하우징 및 상기 적어도 하나의 힌지 구조물 상에 놓이는 플렉서블 디스플레이;상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되는 힌지 하우징;상기 힌지 하우징의 양측 가장자리 중 적어도 하나에 배치되는 보호 부재; 상기 보호 부재에 형성된 부재 홀을 통해 상기 제1 하우징의 내측면으로 돌출되는 제1 돌출 구조;를 포함하고,상기 접이식 전자 장치가 접힘 상태일 때, 상기 힌지 하우징을 바라보는 제1 방향을 기준으로, 상기 제1 돌출구조의 적어도 일부는 상기 힌지 하우징의 일측과 중첩되는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제1 하우징은 상기 제1 돌출 구조의 일단이 거치되는 제1 홈;을 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서, 상기 부재 홀은 제1 크기의 제1 부재 홀; 공개특허 10-2025-0021933-5-상기 제1 크기보다 작은 제2 크기를 가지며 상기 제1 부재 홀과 연결된 제2 부재 홀;을 포함하고, 상기 제1 돌출 구조는, 상기 제1 부재 홀에 안착되는 제2 지지 구조;상기 제2 지지 구조와 연결되며 상기 제2 부재 홀에 일부가 안착되는 제2 돌출 부분;을 포함하는 것을 특징으로하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 부재 홀을 형성하는 주변부와 상기 제1 돌출 구조 사이 적어도 일부 영역에 배치되는 접착 부재; 상기 부재 홀을 형성하는 주변부와 상기 제1 돌출 구조 사이 적어도 일부 영역에 배치되는 패킹 부재; 중 적어도 하나를 더 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서,상기 제2 돌출 부분은상기 제2 부재 홀에 안착되는 제1 부분;상기 제1 부분과 연결되며 상기 제2 부재 홀로부터 상기 제1 하우징 방향으로 돌출되면서 상기 제1 부분과 다른재질로 형성되는 제2 부분;을 더 포함하는 것을 특징으로 하는 접이식 전자 장치."}
{"patent_id": "10-2023-0119599", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 기재는, 제1 하우징, 제2 하우징, 상기 제1 하우징과 상기 제2 하우징을 연결하는 적어도 하나의 힌지 구조물, 상기 제1 하우징과 상기 제2 하우징 및 상기 적어도 하나의 힌지 구조물 상에 놓이는 플렉서블 디스플레 이, 상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되는 힌지 하우징을 포함하고, 상기 제1 하우징은 상 기 접이식 전자 장치가 접힘 상태일 때, 상기 힌지 하우징을 바라보는 제1 방향을 기준으로, 상기 힌지 하우징의 일측과 적어도 일부가 중첩되는 제1 돌출 구조를 포함하는 접이식 전자 장치를 개시한다."}
{"patent_id": "10-2023-0119599", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서의 다양한 실시 예는 힌지 하우징과 복수의 하우징들을 포함하는 접이식 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0119599", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트폰과 같은 휴대용 전자 장치는 다양한 종류의 어플리케이션을 기반으로 통화 기능 및 다양한 컨텐츠 검색 및 제공 기능을 지원할 수 있다. 휴대용 전자 장치는 다양한 기능 제공 과정에서 각 기능에 대응하는 화면을 출 력할 수 있다. 사용자는 상술한 다양한 기능을 이용함에 있어서, 보다 넓은 화면을 이용하기를 원할 수 있다. 일반적인 휴대용 전자 장치에서 화면 표시를 위해 디스플레이 장치를 확장하고자 할 경우 전체 크기가 커지기 때문에 휴대성이 떨어질 수 있다. 이에 따라, 휴대성을 유지하면서도 화면의 크기를 키울 수 있도록, 접이식 휴 대용 전자 장치가 제공되고 있다. 접이식 휴대용 전자 장치는 접힘 및 펼침 상태를 가질 수 있다. 사용자는 접 이식 전자 장치를 사용하는 과정에서 의도치 않게 접이식 전자 장치를 놓치는 경우가 빈번하게 발생하고, 이로 인해, 접이식 전자 장치에 충격이 가해지는 경우가 있다. 접이식 전자 장치에 가해진 충격은 접이식 전자 장치 의 하우징 뿐만 아니라 내부 구조물에 충격을 전달하여, 내부 구조물의 파손이 발생할 수 있다."}
{"patent_id": "10-2023-0119599", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 기재의 다양한 실시 예에 따른 접이식 전자 장치(또는 휴대용 전자 장치, 휴대용 통신 장치, 폴더블 전자 장 치, 또는 통신 기능을 가지는 접이식 전자 장치)는 제1 하우징, 제2 하우징, 상기 제1 하우징과 상기 제2 하우 징을 연결하는 적어도 하나의 힌지 구조물, 상기 제1 하우징과 상기 제2 하우징 및 상기 적어도 하나의 힌지 구 조물 상에 놓이는 플렉서블 디스플레이, 상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되는 힌지 하우 징을 포함하고, 상기 제1 하우징은 상기 접이식 전자 장치가 접힘 상태일 때, 상기 힌지 하우징을 바라보는 제1 방향을 기준으로, 상기 힌지 하우징의 일측과 적어도 일부가 중첩되는 제1 돌출 구조를 포함할 수 있다. 본 기재의 다양한 실시 예에 따른 접이식 전자 장치(또는 휴대용 전자 장치, 휴대용 통신 장치, 폴더블 전자 장 치, 또는 통신 기능을 가지는 접이식 전자 장치)는 제1 하우징, 제2 하우징, 상기 제1 하우징과 상기 제2 하우 징을 연결하는 적어도 하나의 힌지 구조물, 상기 제1 하우징과 상기 제2 하우징 및 상기 적어도 하나의 힌지 구 조물 상에 놓이는 플렉서블 디스플레이, 상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되는 힌지 하우 징, 상기 힌지 하우징의 양측 가장자리 중 적어도 하나에 배치되는 보호 부재, 상기 보호 부재에 형성된 부재 홀을 통해 상기 제1 하우징의 내측면으로 돌출되는 제1 돌출 구조를 포함하고, 상기 접이식 전자 장치가 접힘 상태일 때, 상기 힌지 하우징을 바라보는 제1 방향을 기준으로, 상기 제1 돌출 구조의 적어도 일부는 상기 힌지 하우징의 일측과 중첩될 수 있다. 기타, 본 기재는 다양한 실시 예를 제시한다."}
{"patent_id": "10-2023-0119599", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 이하 본 문서의 다양한 실시 예는 하우징(또는 케이스, 프레임, 브라켓)과 힌지 하우징의 적어도 일부분에 돌출 구조(또는 지지 영역, 지지부, 돌출부, 지지 리브, 거치부)을 마련하여, 외부 충격이 가해지는 경우, 하우징과 힌지 하우징이 서로 간의 간격을 유지할 수 있도록 하는 구조를 제안한다. 이러한 본 문서의 다양한 실시 예는 외부 충격이 힌지 하우징에 가해지는 경우, 하우징 일측에 마련된 지지 영역에 의해 힌지 하우징이 하우징 내측 으로 지정 위치 이상 진입하지 못하도록 방지함으로써, 힌지 하우징에 의한 내부 구조물의 파손을 개선(또는 방 지)할 수 있다. 일 예로서, 접이식 전자 장치가 전자 펜을 지원하는 경우, 일 실시 예에 따른 접이식 전자 장치 는 외부 충격 발생 시, 디스플레이에 인접되게 배치된 디지타이저 부품과 힌지 하우징과의 충돌을 방지할 수 있 으며, 또한, 디스플레이의 변형 또는 디지타이저의 변형을 방지할 수 있다. 이와 같이, 본 기재의 실시 예는 접 이식 전자 장치에 충격이 가해지는 환경에서도 내부 구조물의 파손을 방지하거나 내부 구조물이 충격에 보다 견고하게 반응할 수 있도록 하는 힌지 구조물과 주변 구조물을 제시한다. 기타 본 기재의 실시 예에 따른 소기의 목적들은 각 실시 예들을 설명하는 과정에서 필요에 따라 언급하기로 한 다. 기타, 다양한 실시 예에 따른 힌지 구조물을 포함하는 접이식 전자 장치가 제공하는 다양한 목적 및 효과가 상 세한 설명의 실시 예에 따라 언급될 수 있다. 도 1은 일 실시 예에 따른 접이식 전자 장치의 접힌 상태의 외관의 한 예를 나타낸 도면이다. 도 2는 일 실시 예에 따른 접이식 전자 장치의 분해 사시도이다. 도 1 및 도 2를 참조하면, 일 실시 예에 따른 접이식 전자 장치(또는 전자 장치, 휴대용 전자 장치, 휴대 용 통신 장치, 폴더블 전자 장치, 휴대용 장치)는, 제1 하우징, 제2 하우징, 힌지 하우징, 윙 플레이트들(131, 132)(또는 플레이트들), 디스플레이 및 적어도 하나의 힌지 구조물(200a, 200b, 200c)을 포함할 수 있다. 상기 접이식 전자 장치에서 상기 윙 플레이트들(131, 132)은 제거되거나 또는 다른 구조 물(예: 디스플레이)에 부착되거나 또는 일체화될 수 있다. 추가적으로 또는 대체적으로 상기 접이식 전자 장치는 보조 디스플레이(160a) 및 카메라(cam)를 더 포함할 수 있으며, 또한, 하우징 일측에 배치된 스피 커 홀, 커넥터 홀과 같은 접이식 전자 장치의 사용자 기능과 관련한 구조물을 더 포함할 수 있다. 일 실시 예에 따르면, 상기 접이식 전자 장치는 접힘 상태일 때, 디스플레이의 접힘 영역의 적어도 일부가 물방울 형상(또는 디스플레이의 전면 방향에서 후면 방향으로 바라볼 때(예: z축에서 -z축 방향으 로 볼 때), 후면 방향으로 볼록한 물방울 형상이나 덤벨 형상)을 형성함으로써, 디스플레이의 접힘 영역에 크랙이나 버클링(좌굴)이 일어나지 않도록 하는 폴딩 R(곡률)을 확보 할 수 있다. 또한, 상기 접이식 전자 장치 는 덤벨 형상의 디스플레이 접힘 영역을 하우징들(110, 120)의 일정 공간 내에 배치하여, 접이식 전 자 장치가 접힘 상태일 때 하우징들(110, 120) 간의 배치 간극을 기준 값 이하로 유지하거나 또는 11자 모 양으로 유지할 수 있다. 상술한 구조의 접이식 전자 장치는 하우징들(110, 120) 및 힌지 하우징 중 적어도 일부에 적어도 하나의 지지 구조들을 마련하여, 접이식 전자 장치에 외부 충격이 가해지는 동안 힌 지 하우징이 하우징들(110, 120)의 내측으로 이동되지 않도록 방지함으로써, 접이식 전자 장치의 내 부 구조물의 파손을 예방하거나 저감할 수 있다. 일 실시 예에 따르면, 제1 하우징은 적어도 하나의 힌지 구조물(200a, 200b, 200c)을 이용하여 제2 하우징 과 연결될 수 있다. 제1 하우징은 디스플레이가 안착되는 제1 바닥 영역(110_bot)과, 상기 제1 바닥 영역(110_bot)의 가장자리에 배치되어 디스플레이의 테두리 또는 상기 디스플레이가 안착되는 영역의 가장자리를 둘러싸는 측벽들(예: 110a, 110b, 110c) 또는 별도로 마련된 프레임을 포함할 수 있다. 일 예로, 제1 하우징은 제2 하우징을 마주보는 제1 측부(110d)의 양측 가장자리에서 상기 제1 측부 (110d)의 길이 방향에 수직한 방향으로 배치된 제1 측벽(110a), 상기 제1 측벽(110a)의 일측 끝단으로부터 연장 되며 상기 제1 측부(110d)와 나란하게 배치되는 제2 측벽(110b), 상기 제2 측벽(110b)의 일측 끝단에서 상기 제 1 측벽(110a)과 나란하게 배치되는 제3 측벽(110c)을 포함할 수 있다. 상기 제1 내지 제3 측벽들(110a, 110b, 110c)은 상기 제1 바닥 영역(110_bot)의 바닥면으로부터 상측(예: z축 방향)으로 사전 설계된 높이만큼 돌출되 도록 형성될 수 있다. 상기 제1 측부(110d)의 적어도 일부는 힌지 하우징의 적어도 일부가 놓일 수 있도록 상기 제1 바닥 영역(110_bot)의 바닥면으로부터 하측(예: -z축 방향)으로 일정 곡률을 가지며 음각된 형상을 가 질 수 있다. 추가로, 제1 하우징의 배면에는 후면 커버가 배치될 수 있다. 여기서 후면 커버는 생략될 수 도 있다. 제1 하우징의 적어도 일부는 디스플레이의 제1 영역과 접착될 수 있다. 또는, 제1 하 우징의 전면의 가장자리의 일부는 디스플레이의 제1 영역의 가장자리 적어도 일부와 접착될 수 있다. 이와 관련하여, 제1 하우징의 전면과 디스플레이의 제1 영역 사이에는 접착층이 배치될 수 있다. 일 실시 예에 따르면, 제1 하우징은 내측의 적어도 일부가 중공 형태(또는 비어있는 형태)로 마련될 수 있 다. 제1 하우징 내부에는 적어도 하나의 회로 기판, 적어도 하나의 배터리, 적어도 하나의 카메라 모듈의 적어도 일부 중 적어도 하나가 배치될 수 있다. 제1 하우징 내에 배치된 회로기판 및 배터리는 연성 기판 (미도시)을 통해 제2 하우징 내부에 배치되는 적어도 하나의 회로 기판 및 적어도 하나의 배터리와 전기적 으로 연결될 수 있다. 예를 들어, 연성 기판(미도시)은 제1 하우징의 일부 영역으로부터 힌지 하우징(15 0)을 가로질러 제2 하우징의 일부 영역까지 연장될 수 있다. 연성 기판(미도시)의 일부 영역은 힌지 하우 징의 내부에 위치할 수 있다. 예를 들어, 제1 하우징에 배치된 회로 기판에는 프로세서 및 메모리가 배치될 수 있다. 일 실시 예에 따르면, 제1 하우징은 적어도 일부가 금속 재질로 형성되거나, 또는 적어도 일부가 비금속 재질로 마련될 수 있다. 제1 하우징은 디스플레이의 적어도 일부를 지지할 수 있도록 일정 크기의 강 성을 가지는 재질로 형성될 수 있다. 일 실시 예에서, 접이식 전자 장치가 펼침 상태일 때, 제1 하우징 중 제2 하우징과 대면하는 제1 측부(110d) 적어도 일부분은, 힌지 하우징이 배치될 수 있도록 적어도 일부가 함몰된 함몰 부분을 포함할 수 있다. 일 실시 예에 따르면, 제1 하우징은 적어도 하나의 힌지 구조물(200a, 200b, 200c)에 연결되고, 외부에서 가해지는 외압에 의해, -x축 ~ x축 사이 임의의 지점에서 z축 ~ -z축 사이의 임의의 지점으로 이동하는 시계 방 향 회전 또는 반 시계 방향 회전 운동을 할 수 있다. 접이식 전자 장치가 접힘 상태에서, 제1 하우징(11 0)은 z축에 나란하게 배치되거나 또는, 제2 하우징과 나란하게 배치될 수 있다. 제1 하우징이 제2 하 우징과 나란하게 배치되는 동안(또는 접이식 전자 장치가 접힘 상태일 때), 제1 하우징의 3개의 측벽들(110a, 110b, 110c)(또는 테두리, 또는 가장자리)(예: 접이식 전자 장치가 펼침 상태에서 제2 하우징 과 인접되는 테두리(예: 제1 측부(110d))를 제외한 나머지 테두리) 중 적어도 일부는 제2 하우징의 3 개의 측벽들(120a, 120b, 120c)(또는 접이식 전자 장치가 펼침 상태에서 제1 하우징의 제1 측부 (110d)와 인접되는 제2 측부(120d)를 제외한 나머지 테두리)에 접촉되거나, 대면되거나, 인접되도록 배치될 수 있다. 일 실시 예에 따르면, 제1 하우징은 외부에서 충격이 가해지는 동안 힌지 하우징이 하우징 내측으로 돌출되지 않도록 제1 측벽(110a) 및 제3 측벽(110c) 중 적어도 하나의 일 부분에 지지 구조물이 형성될 수 있다. 일 예로, 제1 측벽(110a)과 제1 측부(110d)가 만나는 제1 구역(110ad) 또는 제3 측벽(110c)과 제1 측부 (110d)가 만나는 제2 구역(110cd) 중 적어도 한 곳에 상기 지지 구조물이 형성될 수 있다. 일 실시 예에 따르면, 제2 하우징은 적어도 하나의 힌지 구조물(200a, 200b, 200c)을 통해 제1 하우징 과 연결(또는 체결, 결합)될 수 있다. 제2 하우징은 디스플레이의 적어도 일부(예: 제2 영역 )가 안착되는 전면(또는 제2 바닥 영역(120_bot)), 상기 전면 또는 상기 디스플레이의 제2 영역(16 2)의 적어도 일부의 테두리를 감싸는 프레임을 포함할 수 있다. 제2 하우징의 적어도 일부는 디스플레이 의 제2 영역과 접착될 수 있다. 또는, 제2 하우징의 전면의 가장자리의 일부는 디스플레이(16 0)의 제2 영역의 가장자리와 접착될 수 있다. 이와 관련하여, 제2 하우징의 전면과 디스플레이 의 제2 영역 사이에는 접착층이 배치될 수 있다. 일 실시 예에 따르면, 제2 하우징은 제1 하우징과 유사하게, 내측의 적어도 일부에 중공이 형성될 수 있다. 제2 하우징 내부에는 적어도 하나의 회로 기판, 적어도 하나의 배터리가 배치될 수 있다. 또는, 적 어도 하나의 배터리는 제1 하우징 및 제2 하우징 중 어느 하나에 배치되거나, 또는 양쪽 모두에 배치 될 수 있다. 제2 하우징 내에 배치된 인쇄회로기판 또는 배터리 중 적어도 하나는 연성 기판을 통해 제1 하우징 내에 배치된 구성(예: 인쇄회로기판 또는 배터리 중 적어도 하나)과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제2 하우징은 제1 하우징과 유사하게 적어도 일부가 금속 재질로 형성되거나, 또는 적어도 일부가 비금속 재질로 마련될 수 있다. 제2 하우징은 디스플레이의 적어도 일부를 지지 할 수 있도록 일정 크기의 강성을 가지는 재질로 형성될 수 있다. 상기 제2 하우징의 측벽 구조는 상기 제 1 하우징의 측벽 구조에 대응되도록 형성될 수 있다. 일 실시 예에서, 접이식 전자 장치가 펼침 상태 일 때, 제2 하우징은 제1 하우징과 대면하는 제2 측부(120d)(또는 제1 하우징에 인접되는 부 분), 제2 측부(120d)를 둘러싸는 제4 내지 제6 측벽들(120a, 120b, 120c)을 포함할 수 있다. 제2 측부(120d)는 힌지 하우징이 배치될 수 있도록 적어도 일부가 함몰된 함몰 부분(예: 리세스 부분)을 포함할 수 있다. 제 2 하우징의 함몰 부분은 제1 하우징의 함몰 부분과 인접되게 배치될 수 있다. 제2 하우징의 후 면에는 후면 커버가 배치될 수 있다. 여기서, 상기 후면 커버는 생략될 수도 있다. 접이식 전자 장치가 펼 침 상태일 때, 제4 측벽(120a)은 제1 측벽(110a)과 일정 틈을 두고 이어진 형상과 유사하게 배치되고, 제6 측벽 (120c)은 제3 측벽(110c)과 일정 틈을 두고 이어진 형상과 유사하게 배치될 수 있다. 제5 측벽(120b)은 제2 측 부(120d) 또는 제1 측부(110d)를 기준으로 제2 측벽(110b)과 마주보도록 배치되거나 관측 방향(예: -y축에서 y 축을 바라볼 때)에 따라, 제1 측벽(110a) 및 제4 측벽(120a)의 폭만큼 이격된 위치에서 y축 방향으로 나란하게 배치될 수 있다. 일 실시 예에 따르면, 상기 제2 하우징은 외부 충격이 가해지는 동안 힌지 하우징이 하우징 내측으로 진입하지 못하도록 적어도 하나의 지지 구조를 포함할 수 있다. 상기 지지 구조는 제1 하우징과 유사하게, 제4 측벽(120a)과 제2 측부(120d)과 만나는 제3 구역(120ad)(또는 제1 구역(110ad)과 인접된 제4 측벽(120a)의일 부분) 또는 제6 측벽(120c)과 제2 측부(120d)과 만나는 제4 구역(120cd)(또는 제2 구역(110cd)과 인접된 제 6 측벽(120c)의 일 부분) 중 적어도 한 곳에 배치될 수 있다. 일 예로서, 제2 하우징에 형성된 적어도 하 나의 지지 구조는 제1 하우징에 형성된 적어도 하나의 지지 구조와 쌍으로 배치될 수 있다. 일 실시 예에 따르면, 상기 힌지 하우징은 접이식 전자 장치가 펼침 상태일 때 제1 하우징 및 제2 하우징이 마주보는 부분 또는 인접되는 부분(예: 제1 측부(110d) 및 제2 측부(120d))에 형성된 함몰 부분들에 적어도 일부가 배치될 수 있다. 힌지 하우징은 전체적으로 x축 방향보다 y축 방향으로 길게 연장 된 형태로 마련될 수 있다. 그러나 본 기재가 이에 한정되는 것은 아니며 접이식 전자 장치의 타입에 따라 x축 방향이 y축 방향보다 긴 형태를 가지거나 x축과 y축 방향의 길이가 동일 또는 일정 범위 내에서 유사할 수 도 있다. 일 실시 예에 따르면, 힌지 하우징은 y축 방향으로 길게 형성된 힌지 하우징 바디(150_b), 힌지 하우징 바디(150_b)의 양측 가장자리에 배치된 힌지 하우징 측벽들(150_wr, 150_wl)(또는 힌지 측벽들, 또는 측 벽들)을 포함할 수 있다. 일 실시 예에 따르면, 상기 힌지 하우징 바디(150_b)의 z축 단면은 접이식 전자 장치가 펼침 상태일 때 제 1 측부(110d) 및 제2 측부(120d) 상에 안착되고 접이식 전자 장치가 접힘 상태에 따라 제1 하우징과 제2 하우징 사이를 통해 외부로 노출되며 평평하게 형성된 평평한 영역, 상기 평평한 영역의 양측 가장자 리에서 z축 방향으로 곡률을 가지며 연장된 굴곡 영역들을 포함할 수 있다. 상기 굴곡 영역들은 상기 평평한 영 역의 양측 가장자리에 날개 형상으로 배치될 수 있다. 일 예로, 힌지 하우징 바디(150_b)의 z축 단면은 바닥 부 분의 적어도 일부가 평평한 형성된 반 원형 또는 반 타원형의 형상을 가질 수 있다. 상기 힌지 하우징 바디 (150_b)의 내측은 빈 공간을 포함하고, 상기 힌지 하우징 바디(150_b)의 내측 빈 공간에는 적어도 하나의 힌지 구조물(200a, 200b, 200c) 및 FPCB의 적어도 일부가 배치될 수 있다. 상기 제1 힌지 하우징 측벽(150_wr)(또는 우측 힌지 하우징 측벽)은 힌지 하우징 바디(150_b)의 중심을 기준으로 제1 측 가장자리(예: -y축 가장자리)를 폐구하도록(막도록) 배치될 수 있다. 일 예로, 제1 힌지 하우징 측벽(150_wr)은 힌지 하우징 바디(150_b)의 z축 단면의 형상에 대응되는 형상을 포함할 수 있다. 제2 힌지 하우징 측벽(150_wl)(또는 우측 힌지 하우징 측벽)은 제1 힌지 하우징 측벽(150_wr)과 유사 또는 동일한 형상을 가지며, 힌지 하우징 바디(150_b)의 중심을 기준으로 제1 힌지 하우징 측벽(150_wr)과 대칭되는 위치(예: 제2 측 가장자리로서, y축 가장자리)에 형성될 수 있다. 상 술한 힌지 하우징은 접이식 전자 장치가 낙하에 의해 지면과 충돌하는 과정에서, 하우징들(110, 12 0)의 지지 구조에 z축 방향으로의 돌출(또는 변형 돌출)이 억제될 수 있다. 이에 따라, 힌지 하우징과 접 이식 전자 장치의 내부 구조물과의 충돌이 방지(또는 개선)될 수 있다. 일 실시 예에 따르면, 디스플레이의 적어도 일부는 가요성(flexibility)을 가질 수 있다. 예를 들어, 디스 플레이는 적어도 일부가 제1 하우징 상에 배치되는 제1 영역, 적어도 일부가 제2 하우징 상에 배치되는 제2 영역 및 제1 영역과 제2 영역 사이에 위치되는 제3 영역(또는 접힘 영 역, 또는 폴딩 영역)을 포함할 수 있다. 일 예로서, 접이식 전자 장치가 접힘 또는 펼침 상태일 때, 제1 영역 및 제2 영역의 적어도 일부는 평평한 상태로 배치되고, 제3 영역은 접이식 전자 장치(10 0)가 접힘 상태일 때 적어도 일부가 굴곡진 상태를 가질 수 있다. 예를 들어, 제1 영역 및 제2 영역 은 접이식 전자 장치의 상태와 무관하게 평면인 상태를 유지할 수 있고(평면의 배치 위치는 변경됨), 제3 영역은 접이식 전자 장치의 상태에 대응하여 굴곡진 상태 또는 평평한 상태로 변형될 수 있다. 예를 들어, 제3 영역은 접이식 전자 장치가 펼침 상태일 때, 평면 상태(또는 평평한 상태)를 가지고, 접이 식 전자 장치가 접힘 상태일 때, 적어도 일부가 곡면 상태(또는 굴곡진 상태)를 가질 수 있다. 일 실시 예에 따르면, 디스플레이는 다양한 층들(layers)을 포함할 수 있다. 예를 들어, 디스플레이 는 일정량의 투명도를 가지며 지정된 크기를 가지는 외부 보호층(또는 글라스층, 또는 폴리머 층), 외부 보호층 하부에 배치되어 화면을 표시하는 표시 패널층, 표시 패널층 하부에 배치되는 적어도 하나의 제1 후면층을 포함 할 수 있다. 상기 제1 후면층(또는 후면 패널, 후면 부분)은 충격흡수층(또는 엠보), 방열층(또는 금속 시트층, 금속층, 도전성 시트) 중 적어도 하나의 층(또는 상술한 층들 중 적어도 하나를 제외한 층)을 포함할 수 있다. 추가적으로 또는 대체적으로 제1 후면층은 전자기 유도 패널(예: digitizer)을 더 포함할 수도 있다. 디스플레 이는 제1 후면층 하부에 배치되는 제2 후면층을 더 포함할 수 있다. 제2 후면층(또는 후면 패널, 후면 부 분)은 적어도 일부가 금속 재질로 마련되는 적어도 하나의 금속층(또는 금속 시트)을 포함할 수 있다. 제2 후면 층의 적어도 일부가 구부러질 수 있도록, 지정된 패턴(예: lattice 패턴, 슬릿 패턴)을 포함할 수 있다. 또는, 제2 후면층의 적어도 일부는 구부러질 수 있는 다른 재질(예: 폴리머 재질, 고무, 가죽 재질)로 형성될 수도 있 다. 상기 제1 후면 층 및 제2 후면 층 중 적어도 하나는 생략될 수 있다. 적어도 하나의 힌지 구조물(200a, 200b, 200c)은 힌지 하우징에 배치될 수 있으며, 복수개의 힌지 구조물 (200a, 200b, 200c) 중 적어도 일부는 서로 유사한 구조 및 형태를 가지고, 나머지 힌지 구조물과는 다른 구조 및 형태를 가질 수 있다. 또는 3개의 힌지 구조물(200a, 200b, 200c)이 모두 동일 또는 유사한 구조를 가지며, 배치되는 방향이 다를 수 있다. 한편, 도시된 도면에서는, 3개의 힌지 구조물(200a, 200b, 200c)이 배치되는 형 태를 예시하였으며, 상기 접이식 전자 장치는 2개의 힌지 구조물 또는 4개 이상의 힌지 구조물이 배치될 수도 있다. 윙 플레이트들(131, 132)은 적어도 하나의 힌지 구조물(200a, 200b, 200c) 상에 놓이거나 적어도 하나의 힌지 구조물(200a, 200b, 200c)과 결합하여, 접이식 전자 장치가 펼침 상태일 때 적어도 하나의 힌지 구조물 (200a, 200b, 200c)의 z축 방향의 면을 덮도록 배치된다. 윙 플레이트들(131, 132)은 하우징들(110, 120)과 분 리된 형태로 제공될 수 있다. 이에 따라, 윙 플레이트들(131, 132)과 하우징들(110, 120) 사이에 갭이 형성될 수 있다. 윙 플레이트들(131, 132)은 디스플레이의 제3 영역의 하부면(예: -z축 방향의 면) 적어도 일부에 대응되게 배치될 수 있다. 윙 플레이트들(131, 132)은 적어도 하나의 힌지 구조물(200a, 200b, 200c)의 힌지 동작에 따라, 시계 방향 또는 반시계 방향으로 회전한다. 예컨대, 제1 윙 플레이트가 반시계 방향으 로 회전하는 동안, 제2 윙 플레이트는 시계 방향으로 회전하고, 제1 윙 플레이트가 시계 방향으로 회 전하는 동안, 제2 윙 플레이트는 반시계 방향으로 회전할 수 있다. 제1 윙 플레이트는 덤벨 형상으로 접히는 디스플레이의 제3 영역 중 평평한 제1 면을 지지하고, 제2 윙 플레이트는 덤벨 형상으로 접히는 디스플레이의 제3 영역 중 평평한 제2 면(z축을 기준으로 제1 면과 대칭되는 면)을 지지할 수 있다. 상술한 접이식 전자 장치는, 접힘 상태에서 z축 방향에서 바라볼 때, 제1 하우징 및 제2 하우징(12 0)의 일정 영역(예: 제1 구역(110ad), 제2 구역(110cd), 제3 구역(120ad) 및 제4 구역(120cd) 중 적어도 한 구 역)에 형성되며 힌지 하우징의 측벽들과 적어도 일부가 중첩되도록 형성된 지지 구조(예: 돌출 구조)를 포 함할 수 있다. 이를 기반으로, 일 실시 예에 따른 접이식 전자 장치는 힌지 하우징이 하우징들(110, 120) 내부로 진입하지 않도록 방지함으로써, 힌지 하우징에 의한 디스플레이의 파손 또는 기타 접이 식 전자 장치 내부에 배치된 다양한 내부 구조물의 파손을 방지 또는 감소시킬 수 있다. 도 3은 일 실시 예에 따른 접이식 전자 장치의 힌지 하우징과 하우징들의 형상의 한 예를 나타낸 도면이다. 도 4는 도 3의 A-A` 절단선을 따라 절단한 단면의 한 예를 나타낸 도면이다. 도 1 내지 도 4를 참조하면, 일 실시 예에 따른 접이식 전자 장치는 예컨대, 적어도 제1 하우징, 제2 하우징 및 힌지 하우징을 포함할 수 있다. 추가적으로 또는 대체적으로 앞서 설명한 바와 같이, 상기 접이식 전자 장치는 제1 하우징과 제2 하우징이 힌지 동작을 수행하면서 접힘 또는 펼침 상태를 가지도록 하는 적어도 하나의 힌지 구조물(200a, 200b, 200c)을 포함할 수 있으며, 힌지 하우징 일측에 배 치된 제1 보호 부재(또는 보호 캡) 및 제1 먼지 방지부(또는 먼지 차단부)를 포함할 수 있다. 상기 제1 보호 부재 및 제1 먼지 방지부는 접이식 전자 장치가 접힘 상태일 때, 힌지 하우징 및 하우징들(110, 120)에 의해 가려짐에 따라, 외부로 노출되지 않도록 배치될 수 있다. 접이식 전자 장치가 펼침 상태일 때, 상기 제1 보호 부재 및 제1 먼지 방지부의 적어도 일부는 외부로 노출되도록 배치될 수 있다. 일 실시 예에 따르면, 상기 제1 하우징 및 제2 하우징은 접이식 전자 장치가 접힘 상태일 때, 도시된 바와 같이, z축 방향으로 나란하게 배치될 수 있다. 접이식 전자 장치가 접힘 상태일 때, 도시된 바와 같이, 힌지 하우징은 -z축 방향으로 적어도 일부가 외부로 노출된 상태를 가질 수 있다. 일 실시 예 에 따르면, -y축에서 y축 방향(예: 힌지 하우징을 바라보는 제1 방향)으로 관측할 때, 제1 하우징의 제1 측벽(110a)의 일측은 힌지 하우징의 일측과 중첩된 상태를 가질 수 있으며, 제2 하우징의 제4 측 벽(120a)의 일측은 힌지 하우징의 타측과 중첩된 상태를 가질 수 있다. 일 실시 예에 따르면, 상기 힌지 하우징의 일측 끝단에는 제1 힌지 하우징 측벽(150_wr)이 형성될 수 있다. 상기 제1 힌지 하우징 측벽(150_wr)은 예컨대, 힌지 하우징 바디(150_b)의 바닥면으로부터 상측(예: z축 방향)으로 일정 간격 이격된 2개의 서브 측벽들(150_w1, 150_w2)을 포함할 수 있다. 또는, 상기 제1 힌지 하우 징 측벽(150_wr)은 제1 보호 부재의 적어도 일부가 삽입될 수 있도록 z축에서 -z축 방향으로 일정 깊이를 가지는 제1 부재 수용부(150_r)(또는 제1 홈, 또는 제1 수용부)을 포함할 수 있다. 상기 제1 부재 수용부 (150_r)는 예컨대, 힌지 하우징 바디(150_b)의 바닥면으로부터 상측(예: z축 방향)으로 일정 간격 이격된 2개의 서브 측벽들(150_w1, 150_w2) 사이의 공간으로 정의될 수 있다. 상기 제1 부재 수용부(150_r)에는 제1 보호 부 재의 적어도 일부가 삽입될 수 있다. 일 예로서, 제1 부재 수용부(150_r)에는 제1 보호 부재 중 하부영역이 삽입 및 고정될 수 있다. 일 실시 예에 따르면, 상기 힌지 하우징의 타측 끝단에도 상술한 제1 힌지 하우징 측벽(150_wr)과 동일한 또는 유사한 구조의 제2 힌지 하우징 측벽(150_wl)이 형성될 수 있다. 상기 제2 힌지 하우징 측벽(150_wl)은 제 1 보호 부재에 대응하는 제2 보호 부재의 적어도 일부가 삽입될 수 있도록 z축에서 -z축 방향으로 일정 깊 이를 가지는 제2 부재 수용부(또는 상기 제1 부재 수용부(150_r)와 동일 또는 유사한 부재 수용부, 또는 제2 홈)을 포함할 수 있다. 상기 제2 부재 수용부는 예컨대, 힌지 하우징 바디(150_b)의 바닥면으로부터 상측(예: z 축 방향)으로 일정 간격 이격된 2개의 서브 측벽들(예: 상기 2개의 서브 측벽들(150_w1, 150_w2)에 대응하는 서 브 측벽들) 사이의 공간으로 정의될 수 있다. 상기 제1 힌지 하우징 측벽(150_wr) 및 제2 힌지 하우징 측벽 (150_wl)은 힌지 하우징과 동일한 재질로 형성될 수 있다. 일 실시 예에 따르면, 제1 하우징은 제1 돌출부(110_p)(또는 제1 돌출 구조, 제1 거치부)를 포함하며, 제2 하우징은 제2 돌출부(120_p)(또는 제2 돌출 구조, 제2 거치부)를 포함할 수 있다. 상기 제1 돌출부(110_ p)는 예컨대, 제1 하우징의 제1 측벽(110a)의 내측에서 제3 측벽(110c) 방향으로 돌출되도록 형성될 수 있 다. 상기 제1 하우징은 제1 돌출부(110_p)의 중심에 해당하는 제1 회전 축(110_ax)(또는 제1 가상 축)을 기준으로 회전할 수 있다. 상기 제2 하우징은 제2 돌출부(120_p)의 중심에 해당하는 제2 회전 축(120_ax) 을 기준으로 회전할 수 있다. 상기 제1 돌출부(110_p)와 상기 제2 돌출부(120_p)는 사전 설계된 일정 간격으로 이격된 위치에 형성될 수 있다. 일 실시 예에 따르면, 제1 돌출부(110_p)는 힌지 하우징에 배치된 제1 보 호 부재의 제1 홈에 적어도 일부가 거치될 수 있다. 상기 제1 돌출부(110_p)는 제1 하우징과 동일한 재질(예: 금속 재질)로 형성될 수 있다. 또는, 상기 제1 돌출부(110_p)는 제1 하우징과 다른 재질(예: 비 금속 재질로서, 사전 설계된 일정 크기 이상의 강도를 가진 재질)로 형성될 수도 있다. 제1 돌출부(110_p)가 제 1 측벽(110a)의 내측면에서 -y축 방향에서 y축 방향으로 돌출되도록 형성됨에 따라, z축 방향에서 -z축 방향으 로 바라볼 때, 제1 돌출부(110_p)의 적어도 일부와 힌지 하우징의 제1 힌지 하우징 측벽(150_wr)의 적어도 일부는 중첩되게 배치될 수 있다. 일 실시 예에 따르면, 상기 제2 돌출부(120_p)는 예컨대, 제2 하우징의 제4 측벽(120a)의 내측에서 제6 측 벽(120c) 방향으로 돌출되도록 형성될 수 있다. 상기 제2 돌출부(120_p)는 제2 하우징의 외측면(120_out) 에서 내측면(120_in) 방향으로 돌출되며, 제2 하우징의 내측면(120_in)의 주변보다 제1 보호 부재 방 향으로 더 돌출되도록 형성될 수 있다. 제2 돌출부(120_p)의 형상과 크기, 재질 중 적어도 하나는 상술한 제1 돌출부(110_p)의 형상과 크기, 재질 중 적어도 하나와 동일하게 형성될 수 있다. 일 예로서, 제2 돌출부(120_ p)는 z축 방향에서 -z축 방향(예: 접이식 전자 장치가 펼침 상태일 때 디스플레이를 바라보는 방향) 으로 볼 때, 제2 힌지 하우징 측벽(150_wl)(또는 힌지 하우징의 적어도 일부, 또는 힌지 하우징의 개 구부를 형성하는 상단 적어도 일부)과 적어도 일부가 중첩되게 배치될 수 있다. 일 실시 예에 따르면, 제2 돌출 부(120_p)는 제1 보호 부재의 제2 홈에 적어도 일부가 거치될 수 있다. 제2 돌출부(120_p)는 제2 하우징 또는 제1 돌출부(110_p)와 동일한 재질로 형성될 수 있다. 일 실시 예에 따르면, 상기 제1 보호 부재는 힌지 하우징의 일측 가장자리에서 힌지 하우징의 상단보다 z축 방향으로 더 높게 돌출되도록 형성되어, 외부에서 접이식 전자 장치의 내부가 관측되지 않도 록 차단하는 역할을 수행할 수 있다. 또는, 제1 보호 부재는 힌지 하우징의 일측 가장자리에 배치되 어 외부로부터 접이식 전자 장치 내측으로의 이물질 유입을 방지 또는 감소시키는 역할을 수행할 수 있다. 상기 제1 보호 부재는 y축의 두께가 z축 또는 x축의 길이보다 작은 판재 형상을 가질 수 있다. 제1 보호 부재의 -y축 방향의 외측면의 적어도 일부는 힌지 하우징의 -y축 방향의 외측면과 동일한 면상에 위 치할 수 있다. 또는, 제1 보호 부재는 힌지 하우징의 제1 힌지 하우징 측벽(150_wr)의 최외곽면(예: -y축에서 y축 방향을 바라보는 방향에서 볼 때의 일면)보다 -y축 방향으로 더 돌출되지 않도록 배치될 수 있다. 제1 보호 부재는 힌지 하우징과 유사한 금속 재질로 형성될 수 있다. 또는, 제1 보호 부재는 힌 지 하우징과 다른 플라스틱 재질 또는 폴리머 재질 중 적어도 하나의 재질로 형성될 수 있다. 상기 제1 보 호 부재는 제1 하우징의 제1 돌출부(110_p)의 적어도 일부가 거치되는(또는 삽입되는) 제1 홈 및 제2 하우징의 제2 돌출부(120_p)의 적어도 일부가 거치되는(또는 삽입되는) 제2 홈을 포함할 수 있다. 일 실시 예에 따르면, 상기 접이식 전자 장치의 힌지 하우징은 제2 힌지 하우징 측벽(150_wl)에 배치 되는 제2 보호 부재를 더 포함할 수 있으며, 상기 제2 보호 부재는 상기 제1 보호 부재의 모양, 크기, 재 질 중 적어도 하나가 동일 또는 유사하게 형성될 수 있다. 상술한 바와 같이, 일 실시 예에 따른 접이식 전자 장치는 제1 하우징의 제1 돌출부(110_p) 및 제2 하우징의 제2 돌출부(120_p)가 제1 힌지 하우징 측벽(150_wr)과 z축 방향으로 중첩되게 배치됨에 따라, 제 1 힌지 하우징 측벽(150_wr) 방향에 외부 압력이 가해지더라도 힌지 하우징이 제1 하우징 및 제2 하 우징 내측으로 진입되지 않고 초기 상태를 유지할 수 있다. 이와 유사하게, 일 실시 예에 따른, 접이식 전 자 장치는 제1 하우징의 제3 돌출부(제1 돌출부(110_p)와 동일 또는 유사한 구조를 가지며 제3 측벽 (110c)에 형성되는 돌출부) 및 제2 하우징의 제4 돌출부(제2 돌출부(120_p)와 동일 또는 유사한 구조를 가 지며 제6 측벽(120c)에 형성되는 돌출부)가 제2 힌지 하우징 측벽(150_wl)과 z축 방향으로 중첩되게 배치됨에 따라, 제2 힌지 하우징 측벽(150_wl) 방향에 외부 압력이 가해지더라도 힌지 하우징이 제1 하우징 및 제2 하우징 내측으로 진입되지 않고 초기 상태를 유지할 수 있다. 도 5는 일 실시 예에 따른 전자 장치의 힌지 하우징과 하우징들의 접힘 상태의 한 예를 나타낸 도면이다. 도 6 은 일 실시 예에 따른 전자 장치의 힌지 하우징과 하우징들의 펼침 상태의 한 예를 도면이다. 도 1 내지 도 6을 참조하면, 일 실시 예에 따른 접이식 전자 장치는 제1 하우징, 제2 하우징, 제1 보호 부재 및 제1 먼지 방지부를 포함할 수 있다. 일 실시 예에 따르면, 상기 접이식 전자 장치가 접힘 상태일 때(또는 닫힘 상태)(500_c), 제1 하우징 및 제2 하우징은 z축 방향을 향하도록 11자 형태로 나란하게 배치될 수 있다. 제1 보호 부재는 힌지 하우징의 일측 가장자리(예: 제1 힌지 하우징 측벽(150_wr)이 형성된 가장자리)에 고정 됨에 따라, 접이식 전자 장치가 접힘 또는 펼침 동작을 수행하는 동안 상태 변화 없이 초기 상태를 유지할 수 있다. 일 실시 예에 따르면, 상기 제1 보호 부재는 판재 형상의 보호 바디(cap_b)를 포함하여, 상기 보호 바디 (cap_b)의 적어도 일부는 힌지 하우징에 삽입 고정되며, 나머지 일부는 힌지 하우징의 상측(예: z축 방향)으로 일정 높이만큼 돌출되게 형성될 수 있다. 이에 대응하여, 제1 보호 부재의 보호 바디(cap_b)의 z축 높이는 힌지 하우징의 상단보다 높게 형성될 수 있다. 제1 보호 부재의 보호 바디(cap_b)의 일측 에는 제1 하우징에 형성된 제1 돌출부(110_p)의 적어도 일부가 거치되는(또는 배치되는, 삽입되는) 제1 홈 (cap_r1) 및 제2 하우징에 형성된 제2 돌출부(120_p)의 적어도 일부가 거치되는(또는 배치되는, 삽입되는) 제2 홈(cap_r2)이 형성될 수 있다. 상기 제1 보호 부재는 금속 분말 사출 성형(MIM, metal injection molding)으로 형성될 수 있다. 일 예로서, 상기 제1 보호 부재의 적어도 일부는 MIM 용 F75 복합 소재 금 속으로 형성될 수 있다. 다양한 실시 예에 따르면, 힌지 하우징의 제2 힌지 하우징 측벽(150_wl)에 배치되는 제2 보호 부재는 상기 제1 보호 부재와 동일 또는 유사한 구조와 크기를 가질 수 있다. 일 실시 예에 따르면, 상기 제1 먼지 방지부는 상기 제1 보호 부재에 인접되게 배치될 수 있다. 상기 제1 먼지 방지부는 예컨대, 방지부 중심 영역(200_cen), 제1 날개(200_w1) 및 제2 날개(200_w2)를 포함할 수 있다. 상기 방지부 중심 영역(200_cen)은 제1 하우징과 제2 하우징 사이의 일 영역에 삽입되면서, 제1 보호 부재에 인접되게 배치될 수 있다. 일 실시 예에 따르면, 방지부 중심 영역(200_cen)의 z축 방향 의 높이 및 형상은 제1 보호 부재의 z축 방향의 높이 및 형상과 동일 또는 유사하게 형성될 수 있다. 상기 제1 먼지 방지부의 제1 날개(200_w1)는 제1 하우징의 일측(예: 제1 측벽(110a) 내측 적어도 일부 공 간 내)에 배치되고, 제2 날개(200_w2)는 제2 하우징의 일측(예: 제4 측벽(120a) 내측 적어도 일부 공간 내)에 배치될 수 있다. 이에 따라, 접이식 전자 장치가 접힘 상태일 때(500_c), 제1 날개(200_w1)와 제2 날개(200_w2)의 적어도 일부는 제1 하우징 및 제2 하우징의 배치 상태에 대응되도록 배치될 수 있다. 또는, 제1 날개(200_w1) 및 제2 날개(200_w2)는 서로 마주보도록(또는 대향되도록) 배치될 수 있다. 상기 제1 먼지 방지부는 예컨대 고무, 플라스틱, 폴리머 또는 그들의 혼합물로 형성될 수 있다. 일 예로서, 상기 제 1 먼지 방지부는 적어도 일부가 TPU(열 가소성 폴리우레탄) 재질을 포함할 수 있다. 다양한 실시 예에 따르면, 힌지 하우징의 제2 힌지 하우징 측벽(150_wl)에도 상기 제1 먼지 방지부와 동일 또는 유사한 제2 먼지 방지부가 배치될 수 있다. 상기 제2 먼지 방지부는 상기 제1 먼지 방지부와 동 일 또는 유사한 크기, 모양, 재질, 위치 중 적어도 하나를 가질 수 있다. 일 실시 예에 따르면, 상기 접이식 전자 장치가 펼침 상태일 때(또는 열림 상태)(500_o), 상기 제1 보호 부재는 힌지 하우징에 고정된 상태를 유지할 수 있다. 이 상태에서, 제1 보호 부재의 제1 홈 (cap_r1)에는 제1 하우징의 제1 돌출부(110_p)의 적어도 일부가 거치 또는 삽입되고, 제1 보호 부재 의 제2 홈(cap_r2)에는 제2 하우징의 제2 돌출부(120_p)의 적어도 일부가 거치 또는 삽입된 상태를 유지할 수 있다. 일 실시 예에 따르면, 제1 하우징의 제1 측벽(110a)에 적어도 일부가 삽입된 제1 날개(200_w1) 및 제2 하 우징의 제4 측벽(120a)에 적어도 일부가 삽입된 제2 날개(200_w2)는 접이식 전자 장치의 펼침 상태 (500_o)에 대응하여, 동일한 방향을 향하도록 배치될 수 있다. 일 예에 따르면, 제1 날개(200_w1)의 상부면 및 제2 날개(200_w2)의 상부면이 모두 상측 방향(예: 디스플레이가 관측되는 방향)을 향하도록 배치될 수 있 다. 상기 제1 날개(200_w1) 및 제2 날개(200_w2)의 적어도 일부는 제1 측벽(110a)의 내측 및 제4 측벽(120a)의 내측에 배치됨에 따라, 외부에서 관측되지 않을 수 있으며, 방지부 중심 영역(200_cen)의 적어도 일부는 접이식 전자 장치가 펼침 상태일 때(500_o), 외부에서 관측되고, 접이식 전자 장치가 접힘 상태(500_c)일 때 외부에서 관측되지 않을 수 있다. 도 7은 일 실시 예에 따른 접힘 상태의 제1 하우징 및 제2 하우징의 부분의 한 예를 나타낸 도면이다. 도 8은 일 실시 예에 따른 펼침 상태의 제1 하우징 및 제2 하우징의 부분의 한 예를 나타낸 도면이다. 도 1 내지도 8을 참조하면, 일 실시 예에 따른 접이식 전자 장치는 적어도 제1 하우징 및 제2 하우징 을 포함할 수 있다. 일 실시 예에 따르면, 상기 제1 하우징은 예컨대, 제1 바닥 영역(110_bot), 제1 하우징 측벽(110_swl)(또 는 제1 측벽(110a) 및 제3 측벽(110c) 중 적어도 하나), 제1 하우징 내측 커브 영역(110_crv), 제1 하우징 내측 공간(110_spa), 제1 커팅 영역(110_tcut) 및 제1 돌출부(110_p)를 포함할 수 있다. 일 예로서 상기 제1 하우징 측벽(110_swl)은 앞서 도 2에서 설명한 제3 측벽(110c)(또는 제1 측벽(110a))의 적어도 일부가 될 수 있다. 상 기 제1 하우징 내측 커브 영역(110_crv), 제1 하우징 내측 공간(110_spa), 제1 커팅 영역(110_tcut) 및 제1 돌 출부(110_p) 중 적어도 하나는 제1 측벽(110a) 또는 제3 측벽(110c)에 각각 또는 적어도 어느 한 곳에 형성될 수 있다. 일 실시 예에 따르면, 상기 제1 바닥 영역(110_bot)는 후면 커버(또는 보조 디스플레이(160a))가 놓이는 외측면 과 접이식 전자 장치의 내부 부품이 놓이는 내측면을 포함할 수 있다. 상기 제1 바닥 영역(110_bot)의 외 측면 높이는 주변(예: 제1 내지 제3 측벽들(110a, 110b, 110c)의 상단)보다 낮게 형성될 수 있다. 상기 제1 바 닥 영역(110_bot)의 외측면과 주변 사이의 높이 차는 후면 커버의 두께에 대응할 수 있다. 상기 제1 바닥 영역 (110_bot)의 내측면에는 접이식 전자 장치 운용과 관련한 다양한 내부 구조물 또는 내부 부품이 놓일 수 있도록 다양한 형상을 포함할 수 있다. 일 예로서, 제1 바닥 영역(110_bot)의 내측면의 적어도 일부는 금속 재 질로 형성되고, 나머지 적어도 일부는 사출물로 형성될 수 있다. 일 실시 예에 따르면, 상기 제1 하우징 측벽(110_swl)은 상기 제1 바닥 영역(110_bot)의 일정 지점에 대하여 수 직한 방향(또는 0보다 큰 각도를 가지는 방향)으로 연장될 수 있다. 제1 하우징 측벽(110_swl)은 예컨대, 제1 측벽(110a) 또는 제3 측벽(110c) 중 적어도 하나가 될 수 있다. 제1 하우징 측벽(110_swl)은 디스플레이의 일측 가장자리를 감싸도록 형성될 수 있다. 일 실시 예에 따르면, 상기 제1 하우징 내측 커브 영역(110_crv)은 제1 바닥 영역(110_bot) 중 제1 측부(110d) 또는 제2 구역(110cd)(또는 제1 구역(110ad))에 가까운 영역에 배치되며, 힌지 하우징의 외측면 적어도 일 부의 곡률에 대응하는 곡률을 가질 수 있다. 상기 제1 하우징 내측 커브 영역(110_crv)은 접이식 전자 장치 가 펼침 상태일 때, 힌지 하우징의 일 부분(예: 힌지 하우징의 하우징 측벽을 바라보는 방향의 중심선을 기준으로 일측(예: 좌측 후면)을 감싸도록 배치될 수 있다. 접이식 전자 장치가 접힘 상태일 때, 제1 하우징 내측 커브 영역(110_crv)은 힌지 하우징의 후면 일측과 이격된 상태(예: 힌지 하우징의 후면과 직각으로 배치된 상태)를 가질 수 있다. 일 실시 예에 따르면, 상기 제1 하우징 내측 공간(110_spa)은 적어도 제1 하우징 내측 커브 영역(110_crv)에 의 해 형성될 수 있다. 제1 하우징 내측 공간(110_spa)에는 힌지 하우징의 일 부분(예: 힌지 하우징의 중심선을 기준으로 좌측 부분)이 안착될 수 있다. 일 실시 예에 따르면, 제1 하우징 내측 공간(110_spa)에는 힌 지 하우징에 적어도 일부가 안착되는 힌지 구조물(200a, 200b, 200c)의 일부가 배치될 수 있다. 일 실시 예에 따르면, 상기 제1 커팅 영역(110_tcut)은 제1 하우징 측벽(110_swl) 중 제1 돌출부(110_p)를 제외 한 적어도 일 부분을 포함할 수 있다. 제1 돌출부(110_p)를 형성하는 과정에서, 금속 재질의 제1 하우징 측벽 (110_swl)에 커팅 가공이 적용되어 제1 돌출부(110_p)보다 긴 길이(예: 제1 커팅 영역(110_tcut)과 제1 돌출부 (110_p)를 포함한 길이)의 돌출 영역이 형성될 수 있다. 추가적으로, 제1 보호 부재의 홈 크기에 대응되도 록 제1 돌출부(110_p)의 크기 및 모양이 결정되면, 커팅 가공(예: CNC(computerized numerical control) T-cut 가공)에 의해 제1 커팅 영역(110_tcut)이 형성되고, 제1 돌출부(110_p)가 형성될 수 있다. 일 실시 예에 따르면, 상기 제1 돌출부(110_p)는 제1 하우징 측벽(110_swl)의 내측면에서 주변보다 더 돌출되도 록 형성될 수 있다. 이러한 제1 돌출부(110_p)는 제1 하우징 내측 공간(110_spa)에 형성되며, 힌지 하우징(15 0)에 배치된 제1 보호 부재의 제1 홈(cap_r1)에 결합될 수 있다. 일 실시 예에 따르면, 제1 돌출부(110_ p)는 중심 영역과, 주변 영역을 포함하고, 중심 영역은 적어도 일부가 평평하게 형성되며, 주변 영역은 z축 방 향에서 중심으로 갈수록 또는 -z축 방향에서 중심으로 일정 곡률을 가질 수 있다. 중심 영역은 다각형(예: 사각 형) 형상이거나 또는 원형(또는 타원형)의 형상을 가질 수 있다. 일 실시 예에 따르면, 상기 제2 하우징은 상기 제1 하우징과 동일 또는 일정 범위 내에서 유사한 구 조를 가질 수 있다. 예컨대, 상기 제2 하우징은 제2 바닥 영역(120_bot), 제2 하우징 측벽(120_swl)(또는 제4 측벽(120a) 및 제6 측벽(120c) 중 적어도 하나), 제2 하우징 내측 커브 영역(120_crv), 제2 하우징 내측 공 간(120_spa), 제2 커팅 영역(120_tcut) 및 제2 돌출부(120_p)를 포함할 수 있다. 일 예로서 상기 제2 하우징 측벽(120_swl)은 앞서 도 2에서 설명한 제6 측벽(120c)(또는 제4 측벽(120a))의 적어도 일부가 될 수 있다. 상 기 제2 하우징 내측 커브 영역(120_crv), 제2 하우징 내측 공간(120_spa), 제2 커팅 영역(120_tcut) 및 제2 돌 출부(120_p) 중 적어도 하나는 상기 제4 측벽(120a) 및 상기 제6 측벽(120c) 중 적어도 한 곳에 형성될 수 있다. 일 실시 예에 따르면, 상기 제2 바닥 영역(120_bot)는 제1 바닥 영역(110_bot)와 동일 또는 유사하게 후면 커버 (또는 보조 디스플레이(160a))가 놓이는 외측면과 접이식 전자 장치의 내부 부품이 놓이는 내측면을 포함 할 수 있다. 일 예로서, 제1 하우징에 놓이는 구조물과 다른 경우, 제2 바닥 영역(120_bot)의 형상은 제1 바닥 영역(110_bot)의 형상과 다를 수도 있다. 일 실시 예에 따르면, 상기 제2 하우징 측벽(120_swl)은 예컨대, 제4 측벽(120a) 또는 제6 측벽(120c) 중 적어 도 하나가 될 수 있다. 제2 하우징 측벽(120_swl)은 디스플레이의 타측 가장자리를 감싸도록 형성될 수 있 다. 이러한 제2 하우징 측벽(120_swl)은 제1 하우징 측벽(110_swl)과 동일 또는 유사한 구조와 크기, 재질을 가 질 수 있다. 일 실시 예에 따르면, 상기 제2 하우징 내측 커브 영역(120_crv)은 상기 제1 하우징 내측 커브 영역(110_crv)에 대응될 수 있으며, 상기 제2 하우징 내측 공간(120_spa)은 제1 하우징 내측 공간(110_spa)에 대응될 수 있고, 상기 제2 커팅 영역(120_tcut)은 제1 커팅 영역에 대응될 수 있다. 일 실시 예에 따르면, 상기 제2 돌출부(120_p)는 제1 돌출부(110_p)와 유사하게, 제2 하우징 측벽(120_swl)의 내측면에서 주변보다 더 돌출되도록 형성될 수 있다. 제2 돌출부(120_p)의 돌출 높이는 제1 돌출부(110_p)의 돌 출 높이와 동일할 수 있다. 디스플레이가 접히는 폴딩 축을 기준으로 제2 돌출부(120_p)는 제1 돌출부 (110_p)와 대칭되는 위치에 배치될 수 있다. 도 9는 일 실시 예에 따른 접이식 전자 장치의 펼침 상태에서의 일부 구성을 나타낸 도면이다. 도 10은 도 9의 절단선들을 따라 절단한 단면의 한 예를 나타낸 도면이다. 도 1 내지 도 10을 참조하면, 일 실시 예에 따른 접이식 전자 장치는 적어도 힌지 하우징을 포함할 수 있다. 추가적으로 또는 대체적으로 상기 접이식 전자 장치는 제1 보호 부재, 제1 먼지 방지부 를 포함할 수 있다. 또한, 앞서 설명한 바와 같이, 상기 접이식 전자 장치는 제1 보호 부재에 대응되는 제2 보호 부재 및 제1 먼지 방지부에 대응되는 제2 먼지 방지부를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 힌지 하우징은 힌지 하우징 바디(150_b)를 포함하며, 상기 힌지 하우징 바디 (150_b)는 평평한 힌지 바닥 영역(150bc), 상기 힌지 바닥 영역(150bc)의 일측(예: 좌측)으로 연장된 제1 굴곡 부(150_bl)(또는 좌측 굴곡부) 및 상기 힌지 바닥 영역(150bc)의 타측(예: 우측)으로 연장된 제2 굴곡부 (150_br)(또는 우측 굴곡부)를 포함할 수 있다. 추가적으로 또는 대체적으로 상기 힌지 하우징은 앞서 도 4에서 설명한 바와 같이, 힌지 하우징 바디(150_b)의 길이 방향(또는 디스플레이가 접히는 폴딩 축 방향) 의 양측 가장자리에 배치되는 힌지 하우징 측벽들(150_wr, 150_wl)을 더 포함할 수 있다. 현재 도시된 도면은 제1 힌지 하우징 측벽(150_wr)(또는 우측 하우징 측벽)이 관측되는 위치를 나타낸 것이다. 상기 제1 힌지 하우 징 측벽(150_wr)은 앞서 설명한 바와 같이, 제1 보호 부재의 적어도 일부가 삽입될 수 있는 제1 부재 수용 부(150_r)를 포함하여, 상기 제1 부재 수용부(150_r)에는 제1 보호 부재의 하부가 삽입될 수 있다. 일 실시 예에 따르면, 상기 제1 보호 부재는 판재 형상으로 마련되며, 제1 하우징의 제1 돌출부 (110_p)의 적어도 일부가 거치되는(또는 삽입되는) 제1 홈(cap_r1) 및 제2 하우징의 제2 돌출부(120_p)의 적어도 일부가 거치되는(또는 삽입되는) 제2 홈(cap_r2)을 포함할 수 있다. 상기 제1 보호 부재는 제1 먼지 방지부와 인접되게 배치될 수 있다. 상기 제1 보호 부재의 상단 적어도 일부는 접이식 전자 장치 가 펼침 상태일 때, 외부로 노출될 수 있으며, 접이식 전자 장치가 접힘 상태에 따라, 제1 하우징 및 제2 하우징에 의해 적어도 일부가 가려질 수 있다. 일 실시 예에 따르면, 상기 제1 먼지 방지부는 접이식 전자 장치가 펼침 상태(900_o)일 때, 제1 날개 (200_w1) 및 제2 날개(200_w2)가 방지부 중심 영역(200_cen)을 기준으로 좌우로 수평하게 펼쳐진 상태를 가질 수 있다. 상기 제1 날개(200_w1)는 앞서 설명한 바와 같이, 제1 측벽(110a)의 일측(예: 제1 측벽(110a)과 제1 측벽(110a) 상부에 배치되는 데코 사이, 또는 제1 측벽(110a)의 z축 단면이 역 L자 형상으로 마련될 경우, 제1 측벽(110a)의 상단 아래)에 배치될 수 있다. 제1 날개(200_w1)는 제1 하우징의 회전 동작에 따라 회전할 수 있다. 상기 제2 날개(200_w2)는 제4 측벽(120a)의 일측(예: 제4 측벽(120a)과 제4 측벽(120a) 상부에 배치 되는 데코 사이, 또는 제4 측벽(120a)의 z축 단면이 역 L자 형상으로 마련될 경우, 제4 측벽(120a)의 상단 아래)에 배치될 수 있다. 제2 날개(200_w2)는 제2 하우징의 회전 동작에 따라 회전할 수 있다. 일 예로서, 접이식 전자 장치가 접힘 상태(900_c)일 때, 방지부 중심 영역(200_cen)은 물방울 형상으로 휘어지고, 제1 날개(200_w1)와 제2 날개(200_w2)는 z축 방향으로 배치될 수 있다. 일 실시 예에 따르면, 도 9에 도시된 접이식 전자 장치의 일부 구성에 대하여 D1-D1` 절단선을 고려한 단 면 형태(1000a)를 보면, 접이식 전자 장치는 디스플레이의 가장자리 상부에 제1 먼지 방지부의 적어도 일부가 놓이며, 제1 먼지 방지부에 인접되게 제1 보호 부재가 배치될 수 있다. 제1 보호 부재 는 힌지 하우징에 마련된 제1 부재 수용부(150_r)에 안착될 수 있다. 접이식 전자 장치가 펼침 상태(900_o)에서 디스플레이가 노출되는 방향(예: -z축에서 z축 방향)에서 볼 때, 제1 보호 부재의 일부(예: 외측면)는 힌지 하우징의 외측면과 적어도 일부가 중첩될 수 있다. 도 9에 도시된 접이식 전자 장치의 일부 구성에 대하여 D2-D2` 절단선을 고려한 단면 형태(1000b)를 보면, 접이식 전자 장치는 디스플레이의 가장자리 상부에 제1 먼지 방지부의 적어도 일부가 놓이며, 제1 먼지 방지부에 인접되게 제1 보호 부재가 배치될 수 있다. 제1 보호 부재는 힌지 하우징 에 마련된 제1 부재 수용부(150_r)에 안착될 수 있다. 제1 보호 부재의 제2 홈(cap_r2)에는 제2 하우 징의 제2 돌출부(120_p)의 적어도 일부가 거치될 수 있다. 접이식 전자 장치가 펼침 상태(900_o)에서 디스플레이가 노출되는 방향에서 볼 때, 제1 보호 부재의 일부(예: 외측면), 제2 돌출부(120_p)의 적 어도 일부 및 힌지 하우징의 외측면은 적어도 일부가 중첩된 상태로 배치될 수 있다. 도 11은 일 실시 예에 따른 접이식 전자 장치의 축 관계의 한 예를 나타낸 도면이다. 도 1 내지 도 11을 참조하면, 일 실시 예에 따른 접이식 전자 장치는 제1 하우징, 제2 하우징, 힌지 하우징을 포함하며, 힌지 하우징에 안착되는 적어도 하나의 힌지 구조물(200a, 200b, 200c)을 포함할 수 있다. 일 실시 예에 따르면, 상기 힌지 구조물(200a, 200b, 200c)은 제1 하우징의 회전에 관여하며 제1 축 (rot1_ax)(가상의 제1 축)을 기준으로 회전하는 제1 회전 부재(200a_rot1)와, 제2 하우징의 회전에 관여하 며 상기 제1 축(rot1_ax)과 다른 제2 축(rot2_ax)(가상의 제2 축)을 기준으로 회전하는 제2 회전 부재 (200a_rot2)를 포함할 수 있다. 추가적으로 또는 대체적으로 상기 힌지 구조물(200a, 200b, 200c)은 상기 제1 회전 부재(200a_rot1) 회전에 대응하여 회전하면서 제1 회전 부재(200a_rot1)와 다른 제3 축(예: 제1 실축)을 기준으로 회전하는 제1 암 부재, 제2 회전 부재(200a_rot2) 회전에 대응하여 회전하면서 제2 회전 부재 (200a_rot2)와 다른 제4 축(예: 제2 실축)을 기준으로 회전하는 제2 암 부재, 상기 제1 암 부재와 상기 제2 암 부재 회전에 대응하여 회전하는 적어도 하나의 기어(예: 제1 암 부재에 결합된 제1 메인 기어, 제2 암 부재에 결합된 제2 메인 기어, 제1 메인 기어와 상기 제2 메인 기어를 연결하는 제1 및 제2 아이들 기어), 캠 구조물, 복수의 탄성 부재를 포함할 수 있다. 상기 제1 회전 부재(200a_rot1) 및 제2 회전 부재(200a_rot2)는 예컨대, 힌지 구조물(200a, 200b, 200c) 중 적어도 하나에 포함될 수 있다. 힌지 구조물(200a, 200b, 200c)은 힌지 하 우징 내에 고정될 수 있다. 제1 회전 부재(200a_rot1)는 제1 하우징과 결합할 수 있으며, 제2 회전 부재(200a_rot2)는 제2 하우징과 결합할 수 있다. 일 실시 예에 따르면, 제1 회전 부재(200a_rot1)가 힌지 구조물(200a, 200b, 200c)에 마련된 고정 브라켓의 레 일을 따라 회전하는 경우, 제1 회전 부재(200a_rot1)는 제1 축(rot1_ax)(또는 제1 가상의 축)을 기준으로 회전 운동을 수행할 수 있다. 일 예로서, 접이식 전자 장치가 펼침 상태에서 접힘 동작을 수행할 때, 제1 회전 부재(200a_rot1)는 제1 축(rot1_ax)을 기준으로 시계 방향으로 회전하고, 접힘 상태에서 펼침 동작을 수행할 때, 제1 회전 부재(200a_rot1)는 제1 축(rot1_ax)을 기준으로 반시계 방향으로 회전할 수 있다. 제1 회전 부재(200a_rot1)가 제1 축(rot1_ax)을 기준으로 회전하는 동안, 제1 하우징은 제1 돌출부(110_p)의 중심점에 대응하는 제1 회전 축(110_ax)을 기준으로 회전 운동을 할 수 있다. 여기서, 제1 회전 축(110_ax)은 제1 축 (rot1_ax)과 위치가 다를 수 있다. 일 실시 예에 따르면, 제2 회전 부재(200a_rot2)가 힌지 구조물(200a, 200b, 200c)에 마련된 고정 브라켓의 레 일을 따라 회전하는 경우, 제2 회전 부재(200a_rot2)는 제2 축(rot2_ax)(또는 제2 가상의 축)을 기준으로 회전 운동을 수행할 수 있다. 상기 제2 축(rot2_ax)은 상기 제1 축(rot1_ax)과 다른 위치에 형성될 수 있다. 일 예로 서, 접이식 전자 장치가 펼침 상태에서 접힘 동작을 수행할 때, 제2 회전 부재(200a_rot2)는 제2 축 (rot2_ax)을 기준으로 반시계 방향으로 회전하고, 접힘 상태에서 펼침 동작을 수행할 때, 제2 회전 부재 (200a_rot2)는 제2 축(rot2_ax)을 기준으로 시계 방향으로 회전할 수 있다. 제2 회전 부재(200a_rot2)가 제2 축(rot2_ax)을 기준으로 회전하는 동안, 제2 하우징은 제2 돌출부(120_p)의 중심점에 대응하는 제2 회전 축(120_ax)을 기준으로 회전 운동을 할 수 있다. 여기서, 제2 회전 축(120_ax)은 제2 축(rot2_ax)과 위치가 다 를 수 있다. 또한, 상기 제2 회전 축(120_ax)은 제1 회전 축(110_ax)과 다른 위치에 형성될 수 있다. 일 실시 예에 따르면, 상기 제1 축(rot1_ax)과 상기 제2 축(rot2_ax) 사이의 거리는 상기 제1 회전 축(110_a x)과 상기 제2 회전 축(120_ax) 사이의 거리보다 더 길게 형성될 수 있다. 또는, 상기 제1 회전 축(110_ax)과 상기 제2 회전 축(120_ax) 사이의 거리는 상기 제1 축(rot1_ax)과 상기 제2 축(rot2_ax) 사이의 거리보다 더 짧 게 형성될 수 있다. 일 실시 예에 따르면, 접이식 전자 장치가 펼침 상태일 때, 제1 하우징 및 제2 하우징의 후면을 기준으로, 상기 제1 축(rot1_ax) 및 상기 제2 축(rot2_ax)의 z축 방향의 위치는 상기 제1 회전 축(110_ax) 및 상기 제2 회전 축(120_ax)의 z축 방향의 위치보다 더 위에 형성될 수 있다. 또는, 접이식 전자 장치가 펼침 상태일 때, 상기 제1 축(rot1_ax) 또는 상기 제2 축(rot2_ax)과 디스플레이의 전면 (또는 후면) 사이의 거리는 상기 제1 회전 축(110_ax) 또는 상기 제2 회전 축(120_ax)과 상기 디스플레이 의 전면(또는 후면) 사이의 거리보다 짧게 형성될 수 있다. 또는, 접이식 전자 장치가 펼침 상태일 때, 상 기 제1 축(rot1_ax) 또는 상기 제2 축(rot2_ax)이 상기 제1 회전 축(110_ax) 또는 상기 제2 회전 축(120_ax) 보다 상기 디스플레이의 전면(또는 후면)에 더 가깝게 배치될 수 있다. 도 12는 일 실시 예에 따른 회전 축들과 주변 구조물 사이의 관계의 한 예를 나타낸 도면이다. 도 1 내지 도 12를 참조하면, 일 실시 예에 따른 접이식 전자 장치는 제1 하우징, 제2 하우징, 힌지 하우징을 적어도 포함할 수 있다. 앞서 설명한 바와 같이, 제1 하우징은 내측에 형성된 제1 돌 출부(110_p)의 중심점에 해당하는 제1 회전 축(110_ax)을 기준으로 지정된 각도 범위 내에서 회전할 수 있다. 이와 유사하게, 제2 하우징은 내측에 형성된 제2 돌출부(120_p)의 중심점에 해당하는 제2 회전 축(120_a x)을 기준으로 지정된 각도 범위 내에서 회전할 수 있다. 일 실시 예에 따르면, 상기 힌지 하우징의 힌지 하우징 바디(150_b)는 적어도 일부가 평평하게 형성되는 힌지 바닥 영역(150bc), 상기 힌지 바닥 영역(150bc)의 일측(예: 좌측)으로 연장된 제1 굴곡부(150_bl) 및 상기 힌지 바닥 영역(150bc)의 타측(예: 우측)으로 연장된 제2 굴곡부(150_br)를 포함할 수 있다. 상기 제1 굴곡부 (150_bl)의 외측면의 굴곡을 포함하는 가상의 원의 중심점은 제1 돌출부(110_p)의 중심점이 될 수 있다. 상기 제2 굴곡부(150_br)의 외측면의 굴곡을 포함하는 가상의 원의 중심점은 제2 돌출부(120_p)의 중심점이 될 수 있 다. 일 실시 예에 따르면, 상기 접이식 전자 장치가 펼침 상태일 때, 상기 제1 굴곡부(150_bl)의 외부면은 상 기 제1 하우징의 내측에 형성된 제1 하우징 내측 커브 영역(110_crv)의 내측면과 대면될 수 있다. 이와 유 사하게, 상기 접이식 전자 장치가 펼침 상태일 때, 상기 제2 굴곡부(150_br)의 외부면은 상기 제2 하우징 의 내측에 형성된 제2 하우징 내측 커브 영역(120_crv)의 내측면과 대면될 수 있다. 상기 제2 하우징 내측 커브 영역(120_crv)을 포함하는 가상의 원의 중심점은 제2 돌출부(120_p)의 중심점이 될 수 있다. 또한, 상기 제1 하우징 내측 커브 영역(110_crv)을 포함하는 가상의 원의 중심점은 제1 돌출부(110_p)의 중심점이 될 수 있 다. 일 실시 예에 따르면, 상기 제1 굴곡부(150_bl)의 굴곡을 호(arc)로서 포함하는 가상의 원과, 제1 하우징 내측 커브 영역(110_crv)의 굴곡을 호로서 포함하는 가상의 원은 상기 접이식 전자 장치가 펼침 상태일 때 또는 접힘 상태 일 때(또는 0도 ~ 180도 사이의 특정 각도로 거치된 상태일 때) 동일한 중심점(예: 제1 돌출부 (110_p)의 중심점)을 가질 수 있다. 상기 제2 굴곡부(150_br)의 굴곡을 호(arc)로서 포함하는 가상의 원과, 제2 하우징 내측 커브 영역(120_crv)의 굴곡을 호로서 포함하는 가상의 원은 동일한 중심점(예: 제2 돌출부(120_p) 의 중심점)을 가질 수 있다. 일 실시 예에 따르면, 상기 접이식 전자 장치가 접힘 상태일 때와 펼침 상태일 때(또는 0도 ~ 180도 사이 의 특정 각도로 거치된 상태일 때)의 제1 하우징 내측 커브 영역(110_crv)의 적어도 일부 굴곡(또는 호 영역)은 제1 돌출부(110_p)를 중심점으로 하는 하나의 가상의 원 상에 위치할 수 있다. 상기 접이식 전자 장치가 접힘 상태일 때와 펼침 상태일 때(또는 0도 ~ 180도 사이의 특정 각도로 거치된 상태일 때)의 제2 하우징 내측 커브 영역(120_crv)의 적어도 일부 굴곡(또는 호 영역)은 제2 돌출부(120_p)를 중심점으로 하는 하나의 가상의 원 상에 위치할 수 있다. 도 13은 일 실시 예에 따른 접이식 전자 장치의 힌지 하우징과 하우징들의 제1 변형 예를 나타낸 도면이다. 도 14는 도 13의 A1-A1` 절단선을 따라 절단한 단면의 한 예를 나타낸 도면이다. 도 1 내지 도 14를 참조하면, 일 실시 예에 따른 접이식 전자 장치 또는 제1 변형된 접이식 전자 장치는 예컨대, 적어도 제1 변형 하우징(110_1), 제2 변형 하우징(120_1) 및 힌지 하우징을 포함할 수 있다. 일 예로서, 상기 제1 변형된 접이식 전자 장치는 제1 변형 하우징(110_1)과 제2 변형 하우징(120_1)이 힌지 동작을 수행하면서 접힘 또는 펼침 상태를 가지도록 하는 적어도 하나의 힌지 구조물(200a, 200b, 200c)을 포함 할 수 있으며, 힌지 하우징 일측에 배치된 제1 보호 부재 및 제1 먼지 방지부를 포함할 수 있다. 여기서, 상기 힌지 하우징, 제1 보호 부재, 제1 먼지 방지부는 앞서 설명한 힌지 하우징 , 제1 보호 부재 및 제1 먼지 방지부와 비교하여 구조와 크기 및 재질 중 적어도 하나가 동일 또는 유사할 수 있다. 예컨대, 힌지 하우징은 힌지 하우징 바디(150b) 및 제1 힌지 하우징 측벽(150_wr)을 포함할 수 있다. 제1 힌지 하우징 측벽(150_wr)은 서브 측벽들(150_w1, 150_w2)과, 일정 간격 이격된 서브 측벽 들(150_w1, 150_w2)에 의해 정의되는 제1 부재 수용부(150_r)를 포함할 수 있다. 상기 제1 부재 수용부(150_ r)에는 제1 보호 부재의 적어도 일부가 안착될 수 있다. 상기 제1 변형 하우징(110_1) 및 제2 변형 하우징(120_1)은 각각 돌출 구조물들(140_p1, 140_p2)을 제외하고 앞 서 도 3 내지 도 4에서 설명한 하우징들(110, 120)과 비교하여, 구조, 크기 및 재질 중 적어도 하나가 동일 또 는 유사하게 형성될 수 있다. 일 예로서, 제1 변형 하우징(110_1)은 제1 돌출 구조물(140_p1)을 포함하고, 제2 변형 하우징(120_1)은 제2 돌출 구조물(140_p2)을 포함할 수 있다. 추가적으로 또는 대체적으로, 제1 변형 하우 징(110_1) 및 제2 변형 하우징(120_1)은 제1 돌출 구조물(140_p1) 및 제2 돌출 구조물(140_p2)이 각각 안착될 수 있는 하우징 홀을 포함할 수 있다. 일 실시 예에 따르면, 제2 변형 하우징(120_1)은 앞서 도 3 및 도 4에서 설명한 제2 돌출부(120_p)가 별도의 구 조물로 마련된 후, 제2 변형 하우징(120_1)에 결합되는 구조를 가질 수 있다. 제1 변형 하우징(110_1)은 상기 제2 변형 하우징(120_1)과 동일한 구조 및 크기를 가질 수 있다. 일 실시 예에 따르면, 제2 변형 하우징(120_1)은 제2 하우징 외측면(120_out)(또는 제4 측벽(120a) 및 제6 측벽 (120c) 중 적어도 하나의 외측면)에서 내측면(120_in) (또는 제4 측벽(120a) 및 제6 측벽(120c) 중 적어도 하나 의 내측면)을 관통하는 하우징 홀(120_h)(또는 -y축에서 y축 방향으로 관통하는 관통홀)이 형성될 수 있다. 제1 변형된 접이식 전자 장치가 접힘 상태일 때, 상기 하우징 홀(120_h)은 예컨대, 제1 하우징 홀(120_h1) 및 제2 하우징 홀(120_h2)을 포함할 수 있다. 상기 제1 하우징 홀(120_h1)은 상기 제2 하우징 외측면(120_out)에서 제2 하우징 내측면(120_in) 방향으로 제1 깊이를 가지며, z축 단면의 크기가 제1 크기를 가질 수 있다. 상기 제 2 하우징 홀(120_h2)은 제1 하우징 홀(120_h1)과 적어도 일부가 연결되며, 제2 변형 하우징(120_1)의 일 부분 (예: 제1 하우징 홀(120_h1)의 y축 방향)에서 제2 하우징 내측면(120_in) 방향으로 제2 깊이를 가지며, z축 단 면의 크기가 제2 크기를 가질 수 있다. 상기 제1 깊이는 제2 깊이보다 크거나 같을 수 있다. 상기 제1 크기는 상기 제2 크기보다 크거나 같을 수 있다. 일 실시 예에 따르면, 상기 제1 하우징 홀(120_h1)과 제2 하우징 홀 (120_h2)은 동일한 중심을 가질 수 있다. 일 실시 예에 따르면, 상기 하우징 홀(120_h)은 제2 하우징 외측면 (120_out)(또는 제1 하우징의 외측면)에서 내측면(120_in)(또는 제1 하우징의 내측면)을 관통하도록 형성되며, 다단(또는 단차진 형상, 계단 형상)으로 형성될 수 있다. 일 실시 예에 따르면, 하우징 홀(120_h)은 제2 하우징 외측면(120_out)(또는 제1 하우징 외측면)에서 내측면(120_in)(또는 제1 하우징 내측면)을 관통하면서 개구의 크기가 변경될 수 있다. 상기 제1 변형된 접이식 전자 장치는 하우징 홀(120_h)에 안착되면서, 제2 하우징 내측면(120_in)보다 y축 방향으로 더 돌출되도록 배치되는 제2 돌출 구조물(140_p2)을 포함할 수 있다. 일 실시 예에 따르면, 제1 돌출 구조물(140_p1)은 제2 돌출 구조물(140_p2)과 비교하여 구조, 크기 및 재질 중 적어도 하나가 동일할 수 있다. 상기 제2 돌출 구조물(140_p2)은 하우징 홀(120_h)을 통하여, 제2 하우징 외측면(120_out)에서 제2 하우징 내측 면(120_in) 방향으로 삽입되고, 제2 하우징 내측면(120_in)의 주변보다 제1 보호 부재 방향으로 더 돌출될수 있다. 일 실시 예에 따르면, 제2 돌출 구조물(140_p2)은 제1 하우징 홀(120_h1)에 안착되는 제1 지지 구조 (또는 제1 부분), 제2 하우징 홀(120_h2)에 일부가 안착되면서 제2 하우징 홀(120_h2)을 관통하여 제2 하 우징 내측면(120_in)의 주변보다 제1 보호 부재 방향(또는 디스플레이 방향 또는 제2 변형 하우징 (120_1)의 중심 방향)으로 더 돌출되도록 배치되는 제1 돌출 부분(또는 제2 부분, 또는 연장 부분)을 포함 할 수 있다. 상기 제1 지지 구조와 상기 제1 돌출 부분은 연속된 구조를 가질 수 있다. 상기 제1 돌 출 부분은 디스플레이가 접히는 폴딩축과 나란한 방향으로 돌출될 수 있다. 제2 돌출 구조물(140_p 2)은 예컨대, z축 방향의 단면이 우측으로 90도 회전된 T자 형상을 가질 수 있다. 상기 제2 돌출 구조물 (140_p2)(또는 제1 돌출 구조물(140_p1))은 제2 변형 하우징(120_1) 또는 힌지 하우징과 동일한 재질(예: 금속 재질 또는 탄성 재질)을 가질 수 있다. 상기 제1 변형 하우징(110_1)은 제1 돌출 구조물(140_p1)의 중심에 대응하는 제1 회전 축(110_ax)을 기준으로 회전하며, 상기 제2 변형 하우징(120_1)은 제2 돌출 구조물(140_p2) 의 중심에 대응하는 제2 회전 축(120_ax)을 기준으로 회전할 수 있다. 일 실시 예에 따르면, 상기 제1 변형된 접이식 전자 장치는 제1 하우징 홀(120_h1)의 바닥부 또는 제2 하 우징 홀(120_h2)을 형성하는 주변부에 배치되는 패킹 부재들(141a, 141b)을 포함할 수 있다. 상기 패킹 부재들 (141a, 141b)은 일 예로서, 제2 돌출 구조물(140_p2)의 제1 지지 구조와 제1 하우징 홀(120_h1)의 바닥면 사이에 배치될 수 있다. 상기 패킹 부재들(141a, 141b)은 적어도 일부가 탄성 재질 또는 고무 재질로 형성될 수 있다. 도시된 도면에서는 2개의 패킹 부재들(141a, 141b)이 배치되는 것으로 도시하였으나, 제1 패킹 부재 (141a) 및 제2 패킹 부재(141b)는 연속된 링 형상에 포함될 수 있다. 상기 패킹 부재들(141a, 141b)에 의해, 제 2 돌출 구조물(140_p2)이 배치된 영역을 통한 이물질 유입을 방지 또는 감소시킬 수 있다. 상기 패킹 부재들 (141a, 141b)은 상기 제2 돌출 구조물(140_p2)의 일 부에 해당할 수 있다. 또는, 상기 패킹 부재들(141a, 141b)은 상기 제2 돌출 구조물(140_p2)과 별도의 독립된 구성이 될 수도 있다. 상기 제1 보호 부재는 앞서 도 3 및 도 4에서 설명한 바와 같이, 보호 바디, 제1 홈 및 제2 홈을 포함할 수 있다. 이러한 제1 보호 부재는 도 4에서 설명한 보호 부재와 동일 또는 유사한 구조를 가질 수 있다. 일 실시 예에 따르면, 돌출 구조물들(140_p1, 140_p2)의 형상이 달라질 경우, 제1 홈 및 제2 홈의 형상이 달라 질 수 있다. 예컨대, 돌출 구조물들(140_p1, 140_p2)의 z축 방향의 단면 모양이 다각형 또는 타원형인 경우, 제 1 보호 부재의 제1 홈 및 제2 홈의 형상은 다각형 또는 타원형이 될 수 있다. 제1 보호 부재의 제1 홈 및 제2 홈의 크기는 상기 돌출 구조물들(140_p1, 140_p2)의 제2 하우징 내측면(120_in)에서 돌출된 부분의 z 축 단면의 크기와 동일하거나 더 크게 형성될 수 있다. 일 실시 예에 따르면, 제1 변형된 접이식 전자 장치 는 제1 및 제2 돌출 구조물들(140_p1, 140_p2)과 하우징 홀을 형성하는 변형 하우징의 적어도 일부 사이에 접착 부재(또는 접착 물질, 또는 접착층)를 더 포함할 수 있다. 상술한 제1 변형된 접이식 전자 장치는 제1 및 제2 돌출 구조물들(140_p1, 140_p2)을 별도로 마련한 후, 변형 하우징들(110_1, 120_1)에 결합하는 구조를 채택함으로써, 보다 단순한 가공 공정을 통해 변형 하우징들 (110_1, 120_1)을 가공할 수 있다. 추가로, 패킹 부재들(141a, 141b)(또는 하나의 패킹 부재)을 통해, 외부 이 물질 유입을 차단할 수 있다. 일 실시 예에 따르면, 상기 제1 변형된 접이식 전자 장치는 변형 하우징들 (110_1, 120_1)의 내측면에 돌출부를 구현하는 과정에서 T-cut 가공을 적용하지 않음에 따라, 하우징들의 두께 를 충분히 확보할 수 있어, 설계에 따른 강성을 쉽게 확보할 수 있다. 상기 제1 변형된 접이식 전자 장치 는 변형 하우징들(110_1, 120_1)의 내외측면을 단순화하고 돌출 구조물들(140_p1, 140_p2)을 별도로 마련함으로 써, 전자 장치의 조립을 용이하게 하고, 변형 하우징들(110_1, 120_1)의 회전공간 확보를 위한 조립 상대물(예: 보호캡)의 살빼기(예: 조립 상대물의 적어도 일부를 제거하는 공정)를 줄임으로써(더 작게 수행함으로써), 조립 대상물의 강성 유지 확보를 용이하게 할 수 있다. 도 15는 일 실시 예에 따른 접이식 전자 장치의 힌지 하우징과 하우징들의 제2 변형 예를 나타낸 도면이다. 도 16은 도 15의 A2-A2` 절단선을 따라 절단한 단면의 한 예를 나타낸 도면이다. 도 1 내지 도 16을 참조하면, 일 실시 예에 따른 접이식 전자 장치 또는 제2 변형된 접이식 전자 장치는 예컨대, 적어도 제3 변형 하우징(110_2), 제4 변형 하우징(120_2) 및 힌지 하우징을 포함할 수 있다. 일 예로서, 상기 제2 변형된 접이식 전자 장치는 제3 변형 하우징(110_2)과 제4 변형 하우징(120_2)이 힌지 동작을 수행하면서 접힘 또는 펼침 상태를 가지도록 하는 적어도 하나의 힌지 구조물(200a, 200b, 200c)을 포함 할 수 있으며, 힌지 하우징 일측에 배치된 변형 보호 부재(300_1)(또는 보호 부재) 및 제1 먼지 방지부 를 포함할 수 있다. 여기서, 상기 힌지 하우징, 제1 먼지 방지부는 앞서 설명한 힌지 하우징 및 제1 먼지 방지부와 비교하여 구조와 크기 및 재질 중 적어도 하나가 동일 또는 유사할 수 있다. 예컨대, 힌지 하우징은 힌지 하우징 바디(150_b) 및 제1 힌지 하우징 측벽(150_wr)을 포함할 수 있다. 제1힌지 하우징 측벽(150_wr)은 서브 측벽들(150_w1, 150_w2)과, 일정 간격 이격된 서브 측벽들(150_w1, 150_w2) 에 의해 정의되는 제1 부재 수용부(150_r)를 포함할 수 있다. 상기 제1 부재 수용부(150_r)에는 변형 보호 부재 (300_1)의 적어도 일부가 안착될 수 있다. 상기 제3 변형 하우징(110_2) 및 제4 변형 하우징(120_2)은 각각 제3 돌출 구조물(150_p1)과 제4 돌출 구조물 (150_p2)이 거치될 수 있는 홈들이 배치될 수 있다. 일 실시 예에 따르면, 제4 변형 하우징(120_2)은 외부에서 관측되는 외측면(120_out)과, 외부에서 관측되지 않는 내측면(120_in)을 포함하고, 상기 내측면(120_in)에는 제 4 돌출 구조물(150_p2)의 적어도 일부가 거치될 수 있는 홈(120_rec)(예: T-cut 가공 홈)이 형성될 수 있다. 상 기 홈(120_rec)은 상기 제4 변형 하우징(120_2)은 내측면(120_in)에서 외측면(120_out) 방향으로 일정 깊이만큼 음각된 형상을 포함할 수 있다. 상기 홈(120_rec)의 형상은 제4 돌출 구조물(150_p2)의 첨단 적어도 일부 형상 에 대응되는 형상을 포함할 수 있다. 상기 제3 변형 하우징(110_2)은 상기 제4 변형 하우징(120_2)과 동일 또는 유사한 구조를 가질 수 있다. 일 예로서, 상기 제3 변형 하우징(110_2)은 제3 돌출 구조물(150_p1)의 적어도 일 부가 안착될 수 있는 홈이 내측면에 형성될 수 있으며, 상기 제3 변형 하우징(110_2)의 내측면에 형성된 홈은 상기 제4 변형 하우징(120_2)의 내측면(120_in)에 형성된 홈(120_rec)과 동일 또는 유사한 형상을 가질 수 있다. 상기 변형 보호 부재(300_1)는 상기 힌지 하우징의 제1 부재 수용부(150_r)에 수용되는 일부와, 상기 디스 플레이 방향으로 돌출되는 나머지 일부를 포함할 수 있다. 상기 변형 보호 부재(300_1)는 y축 방향에서 -y 축 방향(또는 제4 변형 하우징(120_2)의 내측면(120_in)에서 외측면(120_out) 방향)으로 형성된 부재 홀(150_ h)을 포함할 수 있다. 상기 부재 홀(150_h)의 형상(또는 부재 홀(150_h)을 형성하는 변형 보호 부재(300_1)의 적어도 일부 형상은, y축 방향에서 -y축 방향(또는 제4 변형 하우징(120_2)(또는 제3 변형 하우징(110_2))의 내 측면(120_in)에서 외측면(120_out) 방향)으로 가면서 홀의 크기가 변경된 형상을 포함할 수 있다. 일 실시 예에 따르면, 상기 부재 홀(150_h)은 다단(또는 단차진 형상, 또는 계단 형상)으로 형성될 수 있다. 일 실시 예에 따 르면, 부재 홀(150_h)은 z축 단면의 크기가 제3 크기인 제1 부재 홀(150_h1), z축 단면의 크기가 제4 크기인 제 2 부재 홀(150_h2)을 포함할 수 있다. 일 실시 예에 따르면, 상기 제3 크기는 상기 제4 크기보다 더 클 수 있다. 일 실시 예에 따르면, 제1 부재 홀(150_h1)의 깊이는 제2 부재 홀(150_h2)의 깊이보다 작을 수 있다. 또 는, 제2 부재 홀(150_h2)의 깊이가 제1 부재 홀(150_h1)의 깊이보다 클 수 있다. 상기 제2 부재 홀(150_h2)은 제1 부재 홀(150_h1)과 연결되고, 제1 부재 홀(150_h1)과 제2 부재 홀(150_h2)은 동일함 중심점을 가질 수 있다. 상기 부재 홀(150_h)에는 제4 돌출 구조물(150_p2)의 적어도 일부가 삽입 고정될 수 있다. 일 실시 예에 따르면, 상기 변형 보호 부재(300_1)는 복수개의 부재 홀(예: 2개의 부재 홀)을 포함하고, 복수개의 부재 홀에 는 각각 제3 돌출 구조물(150_p1) 및 제4 돌출 구조물(150_p2)이 관통 배치될 수 있다. 상기 제4 돌출 구조물(150_p2)은 부재 홀(150_h)에 배치되면서, 제4 변형 하우징(120_2) 방향으로 돌출되는 구 조를 가질 수 있다. 일 예로서, 상기 제4 돌출 구조물(150_p2)은 제1 부재 홀(150_h1)에 안착되는 제2 지지 구 조, 제2 부재 홀(150_h2)에 안착되면서 제2 부재 홀(150_h2)보다 제4 변형 하우징(120_2) 방향으로 더 돌 출되는 제2 돌출 부분(또는 연장 부분)을 포함할 수 있다. 상기 제2 지지 구조와 상기 제2 돌출 부분 은 일체로 형성될 수 있다. 상기 제4 돌출 구조물(150_p2)의 z축 단면의 형상은 좌측으로 90도 회전된 T자 형상을 가질 수 있다. 상기 제4 돌출 구조물(150_p2)은 변형 보호 부재(300_1)와 동일한 재질로 형성될 수 있다. 또는, 제4 돌출 구조물(150_p2)은 제4 변형 하우징(120_2)(또는 힌지 하우징)의 재질과 동일한 재질 로 형성될 수 있다. 일 실시 예에 따르면, 제4 돌출 구조물(150_p2)은 탄성 재질(예: 폴리머, 고무, 플라스틱) 로 형성될 수 있다. 또는 제4 돌출 구조물(150_p2)은 금속 재질이면서 일정 크기의 탄성을 가진 재질로 형성될 수 있다. 상기 제2 변형된 접이식 전자 장치는 적어도 하나의 패킹 부재들(151a, 151b)을 더 포함할 수 있 다. 예컨대, 제1 부재 홀(150_h1)을 형성하는 변형 보호 부재(300_1)의 내벽과 제2 지지 구조 사이에 배치 되는 제1 패킹 부재(151a), 제2 부재 홀(150_h2)을 형성하는 변형 보호 부재(300_1)의 내벽과 제2 돌출 부분 사이에 배치되는 제2 패킹 부재(151b)를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 제3 돌출 구조물 (150_p1)은 상술한 제4 돌출 구조물(150_p2)과 동일 또는 유사한 구조와 재질을 가질 수 있다. 일 실시 예에 따르면, 제2 변형된 접이식 전자 장치는 제3 및 제4 돌출 구조물들(150_p1, 150_p2)과 부재 홀(150_h)을 형성하는 변형 보호 부재(300_1) 사이 적어도 일부 영역에 접착 부재(또는 접착 물질, 또는 접착층)를 더 포함할 수 있다. 도 17은 일 실시 예에 따른 접이식 전자 장치의 힌지 하우징과 하우징들의 제3 변형 예를 나타낸 도면이다. 도 1 내지 도 17을 참조하면, 일 실시 예에 따른 접이식 전자 장치 또는 제3 변형된 접이식 전자 장치는 예컨대, 적어도 제3 변형 하우징(110_2), 제4 변형 하우징(120_2) 및 힌지 하우징을 포함할 수 있으며, 힌 지 하우징일측에 배치되는 제5 돌출 구조물(150_p3)을 더 포함할 수 있다. 일 실시 예에 따르면, 상술한 상기 제3 변형된 접이식 전자 장치는 제3 변형 하우징(110_2)과 제4 변형 하 우징(120_2)이 힌지 동작을 수행하면서 접힘 또는 펼침 상태를 가지도록 하는 적어도 하나의 힌지 구조물(200a, 200b, 200c)을 포함할 수 있으며, 힌지 하우징 일측에 배치된 변형 보호 부재(300_1) 및 제1 먼지 방지부 를 포함할 수 있다. 여기서, 상기 제3 변형 하우징(110_2), 제4 변형 하우징(120_2), 힌지 하우징, 변형 보호 부재(300_1), 제1 먼지 방지부는 앞서 도 16에서 설명한 구성들과 비교하여 구조와 크기 및 재 질 중 적어도 하나가 동일 또는 유사할 수 있다. 예컨대, 힌지 하우징은 힌지 하우징 바디(150_b) 및 제1 힌지 하우징 측벽(150_wr)을 포함할 수 있다. 제1 힌지 하우징 측벽(150_wr)은 서브 측벽들(150_w1, 150_w2)과, 일정 간격 이격된 서브 측벽들(150_w1, 150_w2)에 의해 정의되는 제1 부재 수용부(150_r)를 포함할 수 있다. 상기 제1 부재 수용부(150_r)에는 변형 보호 부재(300_1)의 적어도 일부가 안착될 수 있다. 상기 변형 보호 부재(300_1)는 다단으로 형성된 부재 홀(150_h)을 포함하며, 상기 부재 홀(150_h)은 제1 부재 홀(150_h1) 및 제2 부재 홀(150_h2)을 포함할 수 있다. 상술한 부재 홀(150_h)(또는 제1 부재 홀(150_h1) 및 제2 부재 홀(150_h2))은 앞서 도 16에서 설명한 부재 홀(150_h)과 동일한 구조를 가질 수 있다. 일 실시 예에 따르면, 상기 변형 보호 부재(300_1)는 복수개의 부재 홀(예: 2개의 부재 홀)을 포함할 수 있다. 상기 제5 돌출 구조물(150_p3)은 부재 홀(150_h)에 배치되면서, 제4 변형 하우징(120_2) 방향으로 돌출되는 구 조를 가질 수 있다. 일 예로서, 상기 제5 돌출 구조물(150_p3)은 제1 부재 홀(150_h1)에 안착되는 제2 지지 구 조, 제2 부재 홀(150_h2)에 안착되는 제2 변형 돌출 부분(152_1), 제2 변형 돌출 부분(152_1)과 연결되면 서 변형 보호 부재(300_1)의 일면(예: -y축을 향하는 면)보다 -y축 방향(또는 제4 변형 하우징(120_2) 방향)으 로 더 돌출된 첨단 거치 부분을 포함할 수 있다. 상기 제2 지지 구조와 상기 제2 변형 돌출 부분 (152_1)은 일체로 형성될 수 있다. 상기 제2 변형 돌출 부분(152_1)과 상기 첨단 거치 부분은 서로 다른 재질로 형성되면서 일체로 형성될 수 있다. 일 실시 예에 따르면, 상기 제2 변형 돌출 부분(152_1)은 탄성체 재 질(예: 고무, 플라스틱, 폴리머 또는 그들의 조합물 중 적어도 하나)로 형성되고, 상기 첨단 거치 부분은 제2 변형 돌출 부분(152_1)과 다른 재질(예: 금속 재질)로 형성될 수 있다. 일 예로서, 상기 첨단 거치 부분 은 제4 변형 하우징(120_2)의 홈(120_rec)에 거치될 수 있다. 일 실시 예에 따르면, 제3 변형된 접이식 전자 장치는 제5 돌출 구조물(150_p3)과 부재 홀(150_h)을 형성 하는 변형 보호 부재(300_1) 사이 적어도 일부 영역에 접착 부재(또는 접착 물질, 또는 접착층)를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 제3 변형된 접이식 전자 장치는 적어도 하나의 패킹 부재들(151a, 151b)을 더 포함할 수 있다. 예컨대, 제1 부재 홀(150_h1)을 형성하는 변형 보호 부재(300_1)의 내벽과 제2 지지 구조 사이에 배치되는 제1 패킹 부재(151a), 제2 부재 홀(150_h2)을 형성하는 변형 보호 부재(300_1)의 내벽과 제2 변형 돌출 부분(152_1) 사이에 배치되는 제2 패킹 부재(151b)를 더 포함할 수 있다. 상술한 설명에서는, 하나의 제5 돌출 구조물(150_p3)에 대해서 설명하였으나, 제3 변형된 접이식 전자 장치는 제4 변형 하우징(120_ 2)의 홈에 거치되는 구조물과 함께, 상기 제3 변형 하우징(110_2)의 홈에 첨단 거치 부분이 거치되는 다른 제5 돌출 구조물을 더 포함할 수 있다. 상술한 제3 변형된 접이식 전자 장치는 변형 보호 부재(300_1)의 조립 과정에서 변형된 하우징들(110_2, 120_2)의 내측면과 돌출 구조물들의 충돌에 의한 스크래치 발생을 저감할 수 있으며, 첨단 거치 부분의 강성을 강화할 수 있다. 상술한 바와 같이, 본 기재의 실시 예에 따른 접이식 전자 장치는 하우징들(또는 변형된 하우징들)과 보호 부재 (또는 변형 보호 부재) 중 적어도 하나에, 접힘 상태의 z축 방향에서 관측할 때 상기 하우징들과 힌지 하우징을 직접적으로 또는 간접적으로 적어도 일부가 중첩되도록 돌출부 또는 돌출 구조물을 마련함으로써, 외부 충격 발 생 시에도 힌지 하우징이 하우징들의 내측으로 진입하는 것을 방지하여 내부 구조물의 파손을 방지(또는 개선) 할 수 있으며, 접이식 전자 장치의 내외부 변형의 방지(또는 개선)할 수 있다. 도 18은 일 실시 예에 따른 접이식 전자 장치의 다른 형태의 예를 나타낸 도면이다. 도 18을 참조하면, 일 실시 예에 따른 접이식 전자 장치는 디스플레이가 배치되는 제1 하우징 , 입력 모듈이 배치되는 제2 하우징, 적어도 하나의 힌지 구조물이 배치된 힌지 하우징을 포 함할 수 있으며, 상기 힌지 하우징이 배치된 영역에는, 앞서 도 1 내지 도 17에서 설명한 돌출부 및 돌출 구조물 적어도 하나를 포함하는 구조물들(1800_p1, 1800_p2)을 포함할 수 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징들은 적어도 하나의 힌지 구조물에 의해 결합하고, 상기 힌지 구조물은 상기 힌지 하우징에 적어도 일부가 안착될 수 있다. 상기 힌지 하우징은 예컨 대, 앞서 도 2에서 설명한 힌지 하우징 150을 포함할 수 있으며, 상기 힌지 하우징의 양측 가장자리에는 제1 구조물(1800_p1) 및 제2 구조물(1800_p2)이 배치될 수 있다. 상기 제1 구조물(1800_p1) 및 제2 구조물 (1800_p2) 중 적어도 하나는 앞서 도 1 내지도 17에서 설명한 돌출부 또는 돌출 구조물 중 어느 하나에 해당할 수 있다. 상술한 바와 같이, 일 실시 예에 따른 노트북 타입의 접이식 전자 장치에도 본 기재에서 설명하는 구조물 들(1800_p1, 1800_p2)이 배치됨에 따라, 노트북 타입의 접이식 전자 장치의 힌지 하우징 부분에 외 부 충격이 가해지더라도, 힌지 하우징이 제1 및 제2 하우징들(1810, 1820) 내측으로 진입되지 않도록 방 어됨에 따라, 노트북 타입의 접이식 전자 장치는 제1 및 제2 하우징들(1810, 1820) 내측에 배치된 내부 구조물의 파손을 저감 또는 방지할 수 있다. 도 19는 일 실시 예에 따른 접이식 전자 장치의 또 다른 형태의 예를 나타낸 도면이다. 도 19를 참조하면, 일 실시 예에 따른 접이식 전자 장치는 연속된 복수의 디스플레이들(또는 접힘 이 가능한 하나의 디스플레이)이 배치되는 복수의 하우징들(1910, 1920, 1930), 접히는 영역에 배치되는 적어도 하나의 힌지 구조물, 적어도 하나의 힌지 구조물이 배치되는 적어도 하나의 힌지 하우징을 포함할 수 있 으며, 상기 힌지 하우징이 배치된 영역에는, 앞서 도 1 내지 도 17에서 설명한 돌출부 및 돌출 구조물 적 어도 하나를 포함하는 구조물들(1900_p1, 1900_p2)을 포함할 수 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징들은 적어도 하나의 제1 타입 힌지 구조물에 의해 결합하며, 제2 하우징과 제3 하우징들은 적어도 하나의 제2 타입 힌지 구조물에 의해 결합될 수 있 다. 일 실시 예에 따르면, 상기 제1 타입 힌지 구조물들의 적어도 일부는 상기 힌지 하우징에 적어도 일 부가 안착될 수 있다. 상기 힌지 하우징은 예컨대, 앞서 도 2에서 설명한 힌지 하우징 150을 포함할 수 있으며, 상기 힌지 하우징의 양측 가장자리에는 제1 구조물(1900_p1) 및 제2 구조물(1900_p2)이 배치될 수 있다. 상기 제1 구조물(1900_p1) 및 제2 구조물(1900_p2) 중 적어도 하나는 앞서 도 1 내지도 17에서 설명한 돌출부 또는 돌출 구조물 중 어느 하나에 해당할 수 있다. 상술한 바와 같이, 일 실시 예에 따른 복수의 인폴딩 및 아웃폴딩 타입의 접이식 전자 장치에도 본 기재 에서 설명하는 구조물들(1900_p1, 1900_p2)이 배치됨에 따라, 인폴딩 및 아웃폴딩 타입의 접이식 전자 장치 의 힌지 하우징 부분에 외부 충격이 가해지더라도, 힌지 하우징이 제1 및 제2 하우징들 (1910, 1920) 내측으로 진입되지 않도록 방어됨에 따라, 인폴딩 및 아웃폴딩 타입의 접이식 전자 장치는 제1 및 제2 하우징들(1910, 1920) 내측에 배치된 내부 구조물의 파손을 저감 또는 방지할 수 있다. 한편, 상술한 설명에서는, 접히는 2개의 하우징들 모두에 돌출 구조가 배치되는 형태를 예시하였으나, 본 기재 가 이에 한정되는 것은 아니다. 일 실시 예에 따르면, 제1 하우징(또는 변형 하우징들 중 한쪽)에만 돌출 구조 (또는 돌출부)가 형성되고, 제2 하우징(또는 변형 하우징들 중 다른 한쪽)에는 별도의 돌출 구조(도는 돌출부) 가 형성되지 않을 수 있다. 또한, 상술한 설명에서는 동일한 돌출 구조(또는 돌출부)가 하우징들에 각각 형성되는 예를 제시하였으나, 본 기재가 이에 한정되는 것은 아니다. 예컨대, 제1 하우징과 제2 하우징(또는 변형 하우징들 각각)에 형성되는 돌 출 구조는 서로 다를 수 있다. 일 예로서, 도 3 내지 도 12에서 설명한 접이식 전자 장치의 돌출부, 도 13 및 도 14에서 설명한 제1 변형된 접이식 전자 장치의 제1 타입 돌출 구조, 도 15 및 도 16에서 설명한 제2 변형된 접이식 전자 장치의 제2 타입 돌출 구조, 도 17에서 설명한 제3 변형된 접이식 전자 장치의 제3 타입 돌출 구조 중 적어도 하나는 하나의 접이식 전자 장치에 모두 적용되거나, 또는, 일부 구조만 하나의 접이식 전자 장치에 적용될 수 있다. 또는, 일 실시 예에 따르면, 하나의 접이식 전자 장치에서, 하나의 하우징 (예: 제1 하우징)에 서로 다른 타입의 돌출 구조(또는 돌출부)가 적용될 수 있다. 또는, 일 실시 예에 따르면, 하나의 접이식 전자 장치에서, 다른 하우징(예: 제1 하우징 및 제2 하우징)에 서로 다른 타입의 돌출 구조(또는 돌출부)가 적용될 수 있다. 상술한 바와 같이, 본 기재의 돌출부 또는 다양한 타입의 돌출 구조는 특정 도면의 접이식 전자 장치에 한정되어 적용되는 것이 아니라, 다양한 형태로 접이식 전자 장치에 적용될 수 있다. 다양 한 실시 예에 따르면, 상기 보호 부재는 상기 힌지 하우징 측벽과 일체화될 수도 있다. 이 경우, 보호 부재의 홈들은 힌지 하우징 측벽에 형성되는 홈에 해당할 수 있다. 상술한 바와 같이, 일 실시 예에 따른 접이식 전자 장치는, 제1 하우징, 제2 하우징, 상기 제1 하우징과 상기 제2 하우징을 연결하는 적어도 하나의 힌지 구조물, 상기 제1 하우징과 상기 제2 하우징 및 상기 적어도 하나의 힌지 구조물 상에 놓이는 플렉서블 디스플레이, 상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되는 힌 지 하우징을 포함하고, 상기 제1 하우징은 상기 접이식 전자 장치가 접힘 상태일 때, 상기 힌지 하우징을 바라 보는 제1 방향을 기준으로, 상기 힌지 하우징의 일측과 적어도 일부가 중첩되는 제1 돌출 구조를 포함할 수 있 다. 일 실시 예에 따르면, 상기 제1 돌출 구조는, 상기 접이식 전자 장치가 접힘 상태일 때, 상기 제1 하우징의 내 측면에서 상기 힌지 하우징의 방향으로 돌출되어 상기 힌지 하우징의 상단 위에 배치되는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 접이식 전자 장치가 펼침 상태일 때, 상기 힌지 하우징의 배면과 접촉되는(또는 대 면되는) 제1 하우징의 내측 곡면의 중심점은 상기 제1 돌출 구조의 중심점과 일치되는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 힌지 하우징은, 상기 플렉서블 디스플레이 방향으로 개구되어 상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되며, 상기 제1 방향의 단면의 적어도 일부가 곡선을 포함하는 힌지 하우징 바디, 상기 힌지 하우징 바디의 양측 가장자리에 형성된 제1 힌지 하우징 측벽 및 제2 힌지 하우징 측벽을 포함 하고, 상기 접이식 전자 장치는 상기 제1 힌지 하우징 측벽에 거치되는 보호 부재를 더 포함하고, 상기 보호 부 재는, 상기 제1 돌출 구조의 적어도 일부가 안착되는 제1 홈을 포함하는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 제1 하우징은, 상기 제1 하우징의 외측면에서 내측면 방향으로 관통되는 하우징 홀 을 포함하고, 상기 제1 돌출 구조는 상기 제1 하우징의 외측면에서 상기 하우징 홀에 삽입되어 제1 힌지 하우징 측벽 방향으로 돌출되는, 것을 특징으로 한다. 일 실시 예에 따르면, 상기 접이식 전자 장치는 상기 제1 돌출 구조와 상기 하우징 홀을 형성하는 주변부 사이 의 적어도 일부 영역에 배치되는 접착 부재 및 상기 하우징 홀을 형성하는 주변부와 상기 제1 돌출 구조 사이 적어도 일부 영역에 배치되는 패킹 부재 중 적어도 하나를 더 포함하는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 하우징 홀은 상기 제1 하우징의 외곽에서 내측면으로 갈수록 개구의 크기가 변경되 는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 하우징 홀은 제1 크기의 제1 하우징 홀과, 상기 제1 하우징 홀과 연결되며 상기 제1 크기보다 작은 제2 크기의 제2 하우징 홀을 포함하고, 상기 제1 돌출 구조는, 상기 제1 하우징 홀에 안착되는 제1 지지 구조 및 상기 제2 하우징 홀에 일부가 안착되면서 상기 힌지 하우징 방향으로 더 돌출되는 제1 돌출 부분을 포함하는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 접이식 전자 장치가 접힘 상태일 때, 제1 돌출 구조의 중심의 위치와 상기 접이식 전자 장치가 펼침 상태일 때 상기 제1 돌출 구조의 중심의 위치는 동일한 것을 특징으로 한다. 일 실시 예에 따르면, 상기 제2 하우징은 상기 접이식 전자 장치가 접힘 상태일 때, 상기 제1 방향을 기준으로, 상기 힌지 하우징의 타측과 적어도 일부가 중첩되는 제2 돌출 구조를 포함하는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 보호 부재는, 상기 제2 돌출 구조의 적어도 일부가 거치되는 제2 홈을 더 포함하는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 제2 하우징은, 상기 제2 하우징의 외측면에서 내측면 방향으로 관통되는 제2 하우징 홀을 포함하고, 상기 제2 돌출 구조는 상기 제2 하우징의 외측면에서 상기 제2 하우징 홀에 삽입되어 제2 힌지 하우징 측벽 방향으로 돌출되는, 것을 특징으로 한다. 일 실시 예에 따르면, 상기 접이식 전자 장치는 상기 제2 돌출 구조와 상기 제2 하우징 홀을 형성하는 주변부 사이의 적어도 일부 영역에 배치되는 접착 부재를 더 포함하는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 접이식 전자 장치가 펼침 상태일 때, 상기 힌지 하우징의 배면과 접촉되는(또는 대 면되는) 제2 하우징의 내측 곡면의 중심점은 상기 제2 돌출 구조의 중심점과 일치되는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 접이식 전자 장치가 접힘 상태일 때, 제2 돌출 구조의 중심의 위치와 상기 접이식 전자 장치가 펼침 상태일 때 상기 제2 돌출 구조의 중심의 위치는 동일한 것을 특징으로 한다. 상술한 바와 같이, 일 실시 예에 따른 접이식 전자 장치는 제1 하우징, 제2 하우징, 상기 제1 하우징과 상기 제 2 하우징을 연결하는 적어도 하나의 힌지 구조물, 상기 제1 하우징과 상기 제2 하우징 및 상기 적어도 하나의 힌지 구조물 상에 놓이는 플렉서블 디스플레이, 상기 적어도 하나의 힌지 구조물의 적어도 일부가 안착되는 힌지 하우징, 상기 힌지 하우징의 양측 가장자리 중 적어도 하나에 배치되는 보호 부재, 상기 보호 부재에 형성된 부재 홀을 통해 상기 제1 하우징의 내측면으로 돌출되는 제1 돌출 구조를 포함하고, 상기 접이식 전자 장치가 접힘 상태일 때, 상기 힌지 하우징을 바라보는 제1 방향을 기준으로, 상기 제1 돌출 구조의 적어도 일부는 상기 힌지 하우징의 일측과 중첩되는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 제1 하우징은 상기 제1 돌출 구조의 일단이 거치되는 제1 홈을 포함하는 것을 특징 으로 한다. 일 실시 예에 따르면, 상기 부재 홀은 제1 크기의 제1 부재 홀, 상기 제1 크기보다 작은 제2 크기를 가지며 상 기 제1 부재 홀과 연결된 제2 부재 홀을 포함하고, 상기 제1 돌출 구조는, 상기 제1 부재 홀에 안착되는 제2 지 지 구조, 상기 제2 지지 구조와 연결되며 상기 제2 부재 홀에 일부가 안착되는 제2 돌출 부분을 포함하는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 접이식 전자 장치는 상기 부재 홀을 형성하는 주변부와 상기 제1 돌출 구조 사이 적 어도 일부 영역에 배치되는 접착 부재 및 상기 부재 홀을 형성하는 주변부와 상기 제1 돌출 구조 사이 적어도 일부 영역에 배치되는 패킹 부재 중 적어도 하나를 더 포함하는 것을 특징으로 한다. 일 실시 예에 따르면, 상기 제2 돌출 부분은 상기 제2 부재 홀에 안착되는 제1 부분, 상기 제1 부분과 연결되며 상기 제2 부재 홀로부터 상기 제1 하우징 방향으로 돌출되면서 상기 제1 부분과 다른 재질로 형성되는 제2 부분 을 포함하는 것을 특징으로 한다. 도 20은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 20을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네 트워크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로 세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈 , 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관 리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생 략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센 서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 상술한 전자 장치에 포함된 적어도 하나의 구성은 앞서 설명한 접이식 전자 장치 또는 변형된 접이식 전자 장치(101, 102, 103) 중 적어도 하나에 적용될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘 발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로 세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일 부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예 에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행 되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경 망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트 워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사 항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하 여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다.상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치 와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(2002, 또는 2004) 각각은 전자 장 치와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작 들의 전부 또는 일부는 외부의 전자 장치들(2002, 2004, 또는 2008) 중 하나 이상의 외부의 전자 장치들에서 실 행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로 부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대 신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라 고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달 할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어 도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅 (MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예 를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버(200 8)는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예:전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20"}
{"patent_id": "10-2023-0119599", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 접이식 전자 장치의 접힌 상태의 외관의 한 예를 나타낸 도면이다. 도 2는 일 실시 예에 따른 접이식 전자 장치의 분해 사시도이다. 도 3은 일 실시 예에 따른 접이식 전자 장치의 힌지 하우징과 하우징들의 형상의 한 예를 나타낸 도면이다. 도 4는 도 3의 A-A` 절단선을 따라 절단한 단면의 한 예를 나타낸 도면이다. 도 5는 일 실시 예에 따른 전자 장치의 힌지 하우징과 하우징들의 접힘 상태의 한 예를 나타낸 도면이다. 도 6은 일 실시 예에 따른 전자 장치의 힌지 하우징과 하우징들의 펼침 상태의 한 예를 도면이다. 도 7은 일 실시 예에 따른 접힘 상태의 제1 하우징 및 제2 하우징의 부분의 한 예를 나타낸 도면이다. 도 8은 일 실시 예에 따른 펼침 상태의 제1 하우징 및 제2 하우징의 부분의 한 예를 나타낸 도면이다. 도 9는 일 실시 예에 따른 접이식 전자 장치의 펼침 상태에서의 일부 구성을 나타낸 도면이다. 도 10은 도 9의 절단선들을 따라 절단한 단면의 한 예를 나타낸 도면이다. 도 11은 일 실시 예에 따른 접이식 전자 장치의 축 관계의 한 예를 나타낸 도면이다. 도 12는 일 실시 예에 따른 회전 축들과 주변 구조물 사이의 관계의 한 예를 나타낸 도면이다. 도 13은 일 실시 예에 따른 접이식 전자 장치의 힌지 하우징과 하우징들의 제1 변형 예를 나타낸 도면이다. 도 14는 도 13의 A1-A1` 절단선을 따라 절단한 단면의 한 예를 나타낸 도면이다. 도 15는 일 실시 예에 따른 접이식 전자 장치의 힌지 하우징과 하우징들의 제2 변형 예를 나타낸 도면이다. 도 16은 도 15의 A2-A2` 절단선을 따라 절단한 단면의 한 예를 나타낸 도면이다. 도 17은 일 실시 예에 따른 접이식 전자 장치의 힌지 하우징과 하우징들의 제3 변형 예를 나타낸 도면이다. 도 18은 일 실시 예에 따른 접이식 전자 장치의 다른 형태의 예를 나타낸 도면이다. 도 19는 일 실시 예에 따른 접이식 전자 장치의 또 다른 형태의 예를 나타낸 도면이다. 도 20은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다."}
