{"patent_id": "10-2020-0146756", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0060776", "출원번호": "10-2020-0146756", "발명의 명칭": "디스플레이의 형태에 기반하여 디스플레이 영역을 조정하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김영도"}}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제 1 방향으로 연장되는 하우징;상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이;상기 하우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동하는 디스플레이 드라이버 IC; 및프로세서를 포함하고,상기 플렉서블 디스플레이의 패널은, EM 신호 라인과 연결된 픽셀에 의해 이미지를 표시하는 표시 영역, 및 상기 표시 영역의 주변에 위치하고 상기 EM 신호 라인이 연결되는 EM 드라이버를 포함하는 비표시 영역을 포함하고,상기 비표시 영역에는, 상기 제 1 방향을 따라 간격을 두고 배열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스플레이의 변형에 따라 저항 값이 가변되는 가변 저항, 및 상기 가변 저항의 저항 값을 입력받아 상기 EM드라이버와 상기 EM 신호 라인 사이의 연결을 제어하는 비교기가 위치하는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 EM 드라이버는 EM 신호를 출력하고,상기 비교기는 상기 가변 저항의 저항 값에 따라 상기 EM 드라이버로부터 출력된 상기 EM 신호가 상기 EM 신호라인에 공급되는 것을 제어하는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 비교기는,상기 가변 저항의 저항 값이 기준 저항 값보다 작거나 같으면 상기 EM 신호를 상기 EM 신호 라인에 공급하고,상기 가변 저항의 저항 값이 상기 기준 저항 값보다 크면 상기 EM 신호를 상기 EM 신호 라인에 공급하지 않는,전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 가변 저항의 저항 값은 상기 하우징이 상기 제 1 방향으로 연장되는 것에 의해 상기 플렉서블 디스플레이의 적어도 일부분이 변형되면 상기 기준 저항 값보다 커지는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 비교기로부터 상기 EM 신호 라인에 공급되는 출력 신호는 상기 프로세서 또는 상기 디스플레이 드라이버IC에 공급되는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,공개특허 10-2022-0060776-3-상기 비표시 영역에는,상기 EM 드라이버로부터 복수의 EM 신호들을 입력받고, 상기 복수의 EM 신호들의 전압 레벨에 따라 EM 변환 신호를 상기 비교기에 공급하는 논리 소자가 위치하는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 논리 소자는 AND 게이트 소자를 포함하고, 복수의 EM 신호들의 전압이 모두 하이 상태이면 상기 EM 변환신호를 상기 비교기에 공급하는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 논리 소자에 입력되는 복수의 EM 신호들은 3 수평 기간 동안 하이 상태로 출력되고, 1 수평 기간씩 위상이지연되도록 출력되는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서,상기 논리 소자는 OR 게이트 소자를 포함하고, 복수의 EM 신호들 중에서 적어도 하나의 전압이 하이 상태이면상기 EM 변환 신호를 상기 비교기에 공급하는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 논리 소자에 입력되는 복수의 EM 신호들은 1 수평 기간 동안 하이 상태로 출력되고, 1 수평 기간씩 위상이지연되도록 출력되는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 비표시 영역에는,상기 비교기로부터 제 k EM 출력 신호를 입력받고, 입력된 상기 제 k EM 출력 신호를 출력하는 제 1트랜지스터, 및상기 비교기로부터 제 k-1 EM 출력 신호를 입력받고, 상기 제 k-1 EM 출력 신호에 응답하여 상기 제 1 트랜지스터로부터 출력된 상기 제 k EM 출력 신호를 상기 EM 신호 라인에 공급하는 제 2 트랜지스터가 위치하는, 전자장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 장치의 방법에 있어서,상기 전자 장치는,제 1 방향으로 연장되는 하우징;상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이;상기 하우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동하는 디스플레이 드라이버 IC; 및프로세서를 포함하고,상기 플렉서블 디스플레이의 패널은, EM 신호 라인과 연결된 픽셀에 의해 이미지를 표시하는 표시 영역, 및 상기 표시 영역의 주변에 위치하고 상기 EM 신호 라인이 연결되는 EM 드라이버를 포함하는 비표시 영역을 포함하고,공개특허 10-2022-0060776-4-상기 전자 장치의 방법은,상기 EM 드라이버가 EM 신호를 출력하는 동작; 및상기 비표시 영역에 위치한 비교기가 가변 저항의 저항 값을 입력받아 상기 EM 드라이버와 상기 EM 신호 라인사이의 연결을 제어하는 동작을 포함하고,상기 가변 저항은 상기 제 1 방향을 따라 간격을 두고 배열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스플레이의 변형에 따라 저항 값이 가변되는, 방법."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 비교기가, 상기 가변 저항의 저항 값이 기준 저항 값보다 작거나 같은 것에 따라 상기 EM 신호를 상기 EM신호 라인에 공급하는 동작; 및상기 비교기가, 상기 가변 저항의 저항 값이 상기 기준 저항 값보다 큰 것에 따라 상기 EM 신호를 상기 EM 신호라인에 공급하지 않는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 가변 저항의 저항 값은 상기 하우징이 상기 제 1 방향으로 연장되는 것에 의해 상기 플렉서블 디스플레이의 적어도 일부분이 변형되면 상기 기준 저항 값보다 커지는, 방법."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 12 항에 있어서,상기 비교기가 상기 EM 신호 라인에 공급되는 출력 신호를 상기 프로세서 또는 상기 디스플레이 드라이버 IC에공급하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치에 있어서,제 1 방향으로 연장되는 하우징;상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이;상기 하우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동하는 디스플레이 드라이버 IC; 및프로세서를 포함하고,상기 플렉서블 디스플레이의 패널은, EM 신호 라인과 연결된 픽셀에 의해 이미지를 표시하는 표시 영역, 및 상기 표시 영역의 주변에 위치하고 상기 EM 신호 라인이 연결되는 EM 드라이버를 포함하는 비표시 영역을 포함하고,상기 비표시 영역에는, 상기 제 1 방향을 따라 간격을 두고 배열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스플레이의 변형에 따라 저항 값이 가변되는 가변 저항, 및 상기 가변 저항의 저항 값을 입력받아 상기 EM드라이버에 대한 클럭 신호의 공급 여부를 제어하는 비교기가 위치하는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15 항에 있어서,상기 비교기는,상기 가변 저항의 저항 값이 기준 저항 값보다 작거나 같으면 상기 클럭 신호를 상기 EM 드라이버에 공급하고,상기 가변 저항의 저항 값이 상기 기준 저항 값보다 크면 상기 클럭 신호를 상기 EM 드라이버에 공급하지 않는,공개특허 10-2022-0060776-5-전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 16 항에 있어서,상기 가변 저항의 저항 값은 상기 하우징이 상기 제 1 방향으로 연장되는 것에 의해 상기 플렉서블 디스플레이의 적어도 일부분이 변형되면 상기 기준 저항 값보다 커지는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 16 항에 있어서,상기 비교기로부터 상기 EM 드라이버에 공급되는 클럭 신호는 상기 프로세서 또는 상기 디스플레이 드라이버 IC에 공급되는, 전자 장치."}
{"patent_id": "10-2020-0146756", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 16 항에 있어서,상기 비교기는, 상기 클럭 신호를 지정된 개수의 EM 드라이버들 포함하는 하나의 그룹당 하나씩 공급하는, 전자장치."}
{"patent_id": "10-2020-0146756", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 디스플레이의 형태에 기반하여 디스플레이 영역을 조정하는 전자 장치에 관한 것으 로, 제 1 방향으로 연장되는 하우징, 상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의 해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이, 상기 하우징의 내부에 위치하며, 상기 플렉서블 디 (뒷면에 계속)"}
{"patent_id": "10-2020-0146756", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 디스플레이의 형태에 기반하여 디스플레이 영역을 조정하는 전자 장치에 관한 것 이다."}
{"patent_id": "10-2020-0146756", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디스플레이 기술이 발전하면서, 플렉서블(flexible) 디스플레이를 이용한 전자 장치에 대한 연구 및 개발이 활 발히 진행되고 있다. 플렉서블 디스플레이는 접거나, 구부리거나, 말거나, 또는 펼칠 수 있으므로 전자 장치의 부피 감소, 또는 전자 장치의 디자인 변화에 큰 기여를 할 것으로 기대된다."}
{"patent_id": "10-2020-0146756", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "최근에는 하우징의 적어도 일부분의 형태가 변경되는 것에 연동하여 외부로 노출되는 플렉서블 디스플레이의 폭 이 가변되는 전자 장치들이 소개되고 있다. 본 발명의 다양한 실시예는 플렉서블 디스플레이가 노출되는 폭이 가변됨에 따라 표시되는 화면의 비율 또는 표 시 영역을 동적으로 조정하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2020-0146756", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시예들에 따른 전자 장치는, 제 1 방향으로 연장되는 하우징, 상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이, 상 기 하우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동하는 디스플레이 드라이버 IC, 및 프로세서를 포함하고, 상기 플렉서블 디스플레이의 패널은, EM 신호 라인과 연결된 픽셀에 의해 이미지를 표시하는 표시 영 역, 및 상기 표시 영역의 주변에 위치하고 상기 EM 신호 라인이 연결되는 EM 드라이버를 포함하는 비표시 영역 을 포함하고, 상기 비표시 영역에는, 상기 제 1 방향을 따라 간격을 두고 배열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스플레이의 변형에 따라 저항 값이 가변되는 가변 저항, 및 상기 가변 저항의 저항 값을 입력 받아 상기 EM 드라이버와 상기 EM 신호 라인 사이의 연결을 제어하는 비교기가 위치할 수 있다. 본 발명의 다양한 실시예들에 따른 전자 장치의 방법에 있어서, 상기 전자 장치는, 제 1 방향으로 연장되는 하 우징, 상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이, 상기 하우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동하는 디스플레이 드라이버 IC, 및 프로세서를 포함하고, 상기 플렉서블 디스플레이의 패널은, EM 신호 라인과 연결된 픽셀 에 의해 이미지를 표시하는 표시 영역, 및 상기 표시 영역의 주변에 위치하고 상기 EM 신호 라인이 연결되는 EM 드라이버를 포함하는 비표시 영역을 포함하고, 상기 전자 장치의 방법은, 상기 EM 드라이버가 EM 신호를 출력하 는 동작, 및 상기 비표시 영역에 위치한 비교기가 가변 저항의 저항 값을 입력받아 상기 EM 드라이버와 상기 EM 신호 라인 사이의 연결을 제어하는 동작을 포함하고, 상기 가변 저항은 상기 제 1 방향을 따라 간격을 두고 배 열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스플레이의 변형에 따라 저항 값이 가변될 수 있다. 본 발명의 다양한 실시예들에 따른 전자 장치는, 제 1 방향으로 연장되는 하우징, 상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이, 상 기 하우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동하는 디스플레이 드라이버 IC, 및 프로세서를 포함하고, 상기 플렉서블 디스플레이의 패널은, EM 신호 라인과 연결된 픽셀에 의해 이미지를 표시하는 표시 영 역, 및 상기 표시 영역의 주변에 위치하고 상기 EM 신호 라인이 연결되는 EM 드라이버를 포함하는 비표시 영역 을 포함하고, 상기 비표시 영역에는, 상기 제 1 방향을 따라 간격을 두고 배열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스플레이의 변형에 따라 저항 값이 가변되는 가변 저항, 및 상기 가변 저항의 저항 값을 입력 받아 상기 EM 드라이버에 대한 클럭 신호의 공급 여부를 제어하는 비교기가 위치할 수 있다."}
{"patent_id": "10-2020-0146756", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예들에 따른 전자 장치는 플렉서블 디스플레이가 노출되는 폭이 가변됨에 따라 표시되는 화면의 비율 또는 표시 영역을 동적으로 조정함으로써 사용자에게 빠르고 직관적인 인터페이스를 제공할 수 있 다."}
{"patent_id": "10-2020-0146756", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성 요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예들에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2a 및 도 2b는 본 발명의 다양한 실시예들에 따른 폐쇄 상태 및 개방 상태를 나타낸 전자 장치의 전면 사시도이다. 도 3a 및 도 3b는 본 발명의 다양한 실시예들에 따른 폐쇄 상태 및 개방 상태를 나타낸 전자 장치 의 후면 사시도이다. 도 2a의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시예들을 더 포함할 수 있다 도 2a 내지 도 3b를 참고하면, 전자 장치는 하우징(housing)(예: 측면 프레임) 및 하우징으로부 터 적어도 부분적으로 이동 가능하게 결합되고, 플렉서블 디스플레이의 적어도 일부를 지지하는 슬라이드 플레이트를 포함할 수 있다. 한 실시예에 따르면, 슬라이드 플레이트는 단부에 결합되는 벤딩 가능한 힌지 레일(예: 도 4의 힌지 레일)을 포함할 수 있다. 예컨대, 슬라이드 플레이트가 하우징에서 슬라이딩 동작을 수행할 경우, 힌지 레일(예: 도 4의 힌지 레일)은 플렉서블 디스플레이를 지지하면 서 하우징의 내부 공간(예: 도 4의 내부 공간)으로 인입될 수 있다. 한 실시예에 따르면, 전자 장치 는 Z 축 방향(예: 제 3 방향)을 향하는 전면(210a)(예: 제1면), Z 축 방향과 반대인 - Z 축 방향(예: 제 4 방향)을 향하는 후면(210b)(예: 제2면) 및 전면(210a)과 후면(210b) 사이의 공간을 둘러싸고, 적어도 부분적 으로 외부로 노출되는 측면(210c)을 포함하는 하우징 구조(housing structure)를 포함할 수 있다. 한 실시 예에 따르면, 후면(210b)은 하우징에 결합되는 후면 커버를 통해 형성될 수 있다. 한 실시예에 따르 면, 후면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또 는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 어떤 실시예에서, 후면은 하우징과 일체로 형성될 수도 있다. 한 실시예에 따르면, 측면(210c)의 적어도 일부는 하우징을 통해 외부로 노출되도록 배치될 수 있다. 다양한 실시예들에 따르면, 하우징은 제1길이를 갖는 제1측면, 제1측면으로부터 수직한 방향으 로 제1길이보다 긴 제2길이를 갖도록 연장되는 제2측면, 제2측면으로부터 제1측면과 평행하게연장되고 제1길이를 갖는 제3측면 및 제3측면으로부터 제2측면과 평행하게 연장되고 제2길이를 갖는 제4측면을 포함할 수 있다. 한 실시예에 따르면, 슬라이드 플레이트는 플렉서블 디스플레이 를 지지하고, 제2측면으로부터 제4측면 방향(예: X 축 방향, 제 1 방향)으로 개방됨으로서 플렉 서블 디스플레이의 표시 면적을 확장시키거나, 제4측면으로부터 제2측면 방향(예: - X 축 방향, 제 2 방향)으로 폐쇄됨으로서, 플렉서블 디스플레이의 표시 면적을 축소시킬 수 있다. 한 실시예에 따르면, 전자 장치는 제1측면 및 제3측면을 커버하기 위한 제1측면 커버(240a) 및 제2측면 커버 (240b)를 포함할 수 있다. 한 실시예에 따르면, 제1측면 및 제3측면은 제1측면 커버(240a) 및 제2측 면 커버(240b)를 통해 외부로 노출되지 않도록 배치될 수 있다. 다양한 실시예들에 따르면, 전자 장치는 슬라이드 플레이트의 지지를 받도록 배치되는 플렉서블 디스 플레이를 포함할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이는 슬라이드 플레이트의 지 지를 받는 평면부(예: 도 4의 평면부) 및 평면부로부터 연장되고, 힌지 레일의 지지를 받는 굴 곡 가능부(예: 도 4의 굴곡 가능부)를 포함할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 굴곡 가능부는, 전자 장치가 폐쇄 상태(예: 슬라이드 플레이트가 하우징으로 인입된 상 태)에서, 하우징의 내부 공간(예: 도 4의 내부 공간)으로 인입되고, 외부로 노출되지 않도록 배치될 수 있으며, 전자 장치가 개방 상태(예: 슬라이드 플레이트가 하우징으로부터 인출된 상태)에서, 힌지 레일의 지지를 받으면서 평면부로부터 연장되도록 외부로 노출될 수 있다. 따라서, 전자 장치 는 하우징으로부터 슬라이드 플레이트의 이동에 따라 플렉서블 디스플레이의 표시 화면의 면적이 변경되는 롤러블 타입(rollable type) 전자 장치를 포함할 수 있다. 다양한 실시예들에 따르면, 슬라이드 플레이트는 하우징으로부터 적어도 부분적으로 인입되거나 인출 되도록 슬라이딩 방식으로 이동 가능하게 결합될 수 있다. 예컨대, 전자 장치는, 폐쇄 상태에서, 제2측면 으로부터 제4측면까지의 제1폭(w1)를 갖도록 구성될 수 있다. 한 실시예에 따르면, 전자 장치는, 개방 상태에서, 하우징의 내부에 인입된 힌지 레일이 전자 장치의 외부로 이동된 폭 (w2)을 가질 수 있다. 제2폭(w)은 제1폭(w1)보다 클 수 있다. 다양한 실시예들에 따르면, 슬라이드 플레이트는 사용자의 조작을 통해 동작될 수 있다. 어떤 실시예에서, 슬라이드 플레이트는 하우징의 내부 공간(예: 도 4의 내부 공간)에 배치되는 구동 메카니즘을 통해 자동으로 동작될 수도 있다. 한 실시예에 따르면, 전자 장치는 프로세서(예: 도 1의 프로세서) 를 통해, 전자 장치의 개폐 상태 천이를 위한 이벤트를 검출하면, 구동 메카니즘을 통해 슬라이드 플레이 트의 동작을 제어하도록 설정될 수 있다. 어떤 실시예에서, 전자 장치의 프로세서(예: 도 1의 프로세 서)는 슬라이드 플레이트의 개방 상태, 폐쇄 상태 또는 중간 상태에 따라, 변화된 플렉서블 디스플레 이의 표시 면적에 대응하여, 다양한 방식으로 객체를 표시하고, 응용 프로그램을 실행하도록 제어할 수도 있다. 다양한 실시예들에 따르면, 전자 장치는, 입력 장치, 음향 출력 장치(206, 207), 센서 모듈(204, 217), 카메라 모듈(205, 216), 커넥터 포트, 키 입력 장치(미도시) 또는 인디케이터(미도시) 중 적어도 하 나를 포함할 수 있다. 다른 실시예로, 상기 전자 장치는, 상술한 구성 요소들 중 적어도 하나를 생략하거 나 다른 구성 요소들이 추가적으로 포함될 수도 있다. 다양한 실시예들에 따르면, 입력 장치는, 마이크를 포함할 수 있다. 어떤 실시예에서는, 입력 장치 는 소리의 방향을 감지할 수 있도록 배치되는 복수의 마이크를 포함할 수도 있다. 음향 출력 장치 (206, 207)는 스피커들(206, 207)을 포함할 수 있다. 스피커들(206, 207)은, 외부 스피커 및 통화용 리시 버를 포함할 수 있다. 다른 실시예로, 음향 출력 장치(206, 207)는 별도의 스피커 홀이 배제된 채, 동작되는 스피커(예: 피에조 스피커)를 포함할 수도 있다. 다양한 실시예들에 따르면, 센서 모듈(204, 217)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상 태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(204, 217)은, 예를 들어, 전자 장치의 전면에 배치된 제1센서 모듈(예: 근접 센서 또는 조도 센서) 및/또는 후면에 배치된 제2센서 모듈(예: HRM 센서)를 포함할 수 있다. 한 실시예에 따르면, 제1센서 모듈은 전자 장치의 전면에서, 플렉서블 디스플레이 아래에 배치될 수 있다. 한 실시예에 따르면, 제1센서 모듈은 근접 센서, 조도 센서, TOF(time of flight) 센서, 초음파 센서, 지문 인식 센서, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서 또는 습도 센서 중 적어도 하나를 더 포함할 수 있다.다양한 실시예들에 따르면, 카메라 장치(205, 216)는, 전자 장치의 전면에 배치된 제1카메라 장치, 및 후면에 배치된 제2카메라 장치를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제2카메라 장 치 근처에 위치되는 플래시를 포함할 수 있다. 한 실시예에 따르면, 카메라 장치들(205, 216)은, 하 나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 한 실시예에 따르면, 제1카메라 장치는 플렉서블 디스플레이 아래에 배치되고, 플렉서블 디스플레이의 활성화 영역 중 일부를 통해 피사체를 촬영하도록 구성될 수도 있다. 한 실시예에 따르면, 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 어떤 실시예에서는, 2개 이상의 렌즈들 (광각 및 망원 렌즈) 및 이미지 센서들이 상기 전자 장치의 한 면에 배치될 수 있다. 다양한 실시예들에 따르면, 전자 장치는 적어도 하나의 안테나(미도시 됨)를 포함할 수 있다. 한 실시예에 따르면, 적어도 하나의 안테나는, 예를 들어, 외부 전자 장치(예: 도 1의 전자 장치)와 무선으로 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신할 수 있다. 한 실시예에 따르면, 안테나는 legacy antenna, mmWave antenna, NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 다양한 실시예들에 따르면, 하우징(예: 측면 프레임)은 적어도 부분적으로 도전성 소재(예: 금속 소재)로 형성될 수 있다. 한 실시예에 따르면, 하우징은, 슬라이드 플레이트의 구동에 관여하지 않는, 적어도 제1측면 및/또는 제3측면이 도전성 소재로 형성될 수 있으며, 비도전성 소재를 통해 전기적으로 절연 된 복수의 도전성 부분들으로 분할될 수 있다. 한 실시예에 따르면, 복수의 도전성 부분들은 전자 장치의 내부에 배치되는 무선 통신 회로(예: 도 1의 무선 통신 모듈)와 전기적으로 연결됨으로써 다양한 주파수 대역에서 동작하는 안테나들로 활용될 수 있다. 도 4는 본 발명의 다양한 실시예들에 따른 전자 장치의 분리 사시도이다. 도 4를 참고하면, 전자 장치는 제1면, 제1면과 반대 방향을 향하는 제2면 및 제1면 과 제2면 사이의 내부 공간을 둘러싸는 측면(예: 도 2a의 측면(210c))을 포함하는 하우징 , 하우징의 내부 공간에서 제1면과 대면하도록 배치되는 브라켓 하우징, 브라켓 하 우징으로부터 슬라이딩 가능하게 결합되는 힌지 레일을 포함하는 슬라이드 플레이트, 슬라이드 플레이트와 힌지 레일의 지지를 받도록 배치되는 플렉서블 디스플레이 및 제2면과 대면하 도록 배치되는 후면 커버를 포함할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이는 슬라이드 플레이트의 지지를 받는 평면부 및 평면부로부터 연장되고, 힌지 레일의 지지를 받는 굴곡 가능부를 포함할 수 있다. 한 실시예에 따르면, 하우징은 적어도 하나의 측면(예: 제4측면)으로 부터 내부 공간으로, 적어도 부분적으로 연장되는 지지 플레이트를 포함할 수 있다. 한 실시예에 따 르면, 지지 플레이트는 전자 장치의 내부 공간에 배치되는 전자 부품들(예: 브라켓 하우징)을 지지하기 위한 구조를 갖도록 형성될 수 있다. 어떤 실시예에서, 지지 플레이트는 하우징과 구조적으 로 결합될 수도 있다. 한 실시예에 따르면, 하우징은 제1길이를 갖는 제1측면, 제1측면으로부터 수직한 방향으로 제1길이보다 긴 제2길이를 갖도록 연장되는 제2측면, 제2측면으로부터 제1측면(24 1)과 평행하게 연장되고 제1길이를 갖는 제3측면 및 제3측면으로부터 제2측면과 평행하게 연장 되고 제2길이를 갖는 제4측면을 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제1측면 및 제3측면을 커버하기 위한 제1측면 커버(240a) 및 제2측면 커버(240b)를 포함할 수 있다. 한 실시예에 따르 면, 제1측면 및 제3측면은 제1측면 커버(240a) 및 제2측면 커버(240b)를 통해 외부로 노출되지 않도 록 배치될 수 있다. 어떤 실시예에서, 플렉서블 디스플레이의 굴곡 가능부가 하우징의 내부 공 간에 인입된 상태(예: 슬라이드 인(slide-in) 상태)에서, 굴곡 가능부의 적어도 일부는 후면 커버 를 통해 외부로부터 보일 수 있게 배치될 수도 있다. 이러한 경우, 후면 커버는 투명 소재 및/또는 반투명 소재로 형성될 수 있다. 도 5a는 롤러가 전자 장치의 제 2 방향(-x 방향)에 위치한 본 발명의 일 실시예에 따른 전자 장치의 폐쇄 상태 를 나타낸 단면도이다. 도 5b는 롤러가 전자 장치의 제 2 방향(-x 방향)에 위치한 본 발명의 일 실시예에 따른 전자 장치의 개방 상태를 나타낸 단면도이다. 도 5a 및 도 5b에 도시된 전자 장치는, 도 2a 내지 도 4에 도시된 전자 장치와 적어도 일부 유사하거 나, 전자 장치의 다른 실시예들을 더 포함할 수 있다. 이하, 도 5a 및 도 5b를 참조하여 도 2a 내지 도 4 에 도시된 전자 장치로부터 달라지거나 미설명된 특징만을 기재한다. 도 5a 및 도 5b를 참조하면, 일 실시예에 따른 전자 장치는, 하우징, 및 하우징으로부터 제 1 방향(x 방향)으로 연장 가능한 슬라이드 플레이트를 포함할 수 있다. 본 문서에서, 하우징은 제 1 하 우징으로 정의되고, 슬라이드 플레이트는 제 2 하우징으로 정의될 수 있다. 일 실시예에 따르면, 전자 장치는, 롤러를 포함할 수 있고, 롤러는 하우징의 내부 공간(예: 도 4의 내부 공간)에 배치될 수 있다. 예를 들면, 롤러는 슬라이드 플레이트(예: 도 4의 슬라이드 플레이트)에 포함될 수 있다. 일 실시예에 따르면, 롤러는 전자 장치의 제 2 방향(-x 방향)에 위치할 수 있고, 슬라이드 플레이트 의 움직임에 기반하여 지정된 방향으로 회전할 수 있다. 일 실시예에 따르면, 롤러는 전자 장치(20 0)의 제 2 측면(예: 도 4의 제2측면)에 인접하게 위치할 수 있다. 일 실시예에 따르면, 롤러는 슬라이드 플레이트가 제 1 방향(x 방향)으로 움직이는 것에 연동하여 시 계 방향으로 회전할 수 있다. 롤러는 슬라이드 플레이트가 제 2 방향(-x 방향)으로 움직이는 것에 연 동하여 반시계 방향으로 회전할 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 롤러가 회전하는 것에 연동하여 표시 면적이 가변될 수 있다. 예를 들면, 도 5a에 도시된 바와 같이, 롤러는 슬라이드 플레이트가 제 2 방향(-x 방향)으로 움직이 는 것에 연동하여 반시계 방향으로 회전할 수 있다. 롤러가 반시계 방향으로 회전하면, 플렉서블 디스플레 이의 적어도 일부(예: 도 4의 굴곡 가능부)는 전자 장치의 제 2 방향(-x 방향)에 위치한 제 2 에지 부분(EG2)을 통해 하우징의 내부로 슬라이드 인 될 수 있다. 제 2 에지 부분(EG2)은 전자 장치 의 제 2 측면(예: 도 4의 제2측면)에 인접한 하우징의 일부분으로 정의될 수 있다. 일 실시예에 따르 면, 플렉서블 디스플레이의 적어도 일부(예: 굴곡 가능부)가 하우징의 내부로 슬라이드 인 되면, 플렉서블 디스플레이의 표시 면적은 제 1 폭(W1)을 가질 수 있다. 예를 들면, 플렉서블 디스플레이 의 표시 면적은, 도 5a에 도시된 바와 같이, 전자 장치의 폐쇄 상태에서 제 1 폭(W1)을 가질 수 있다. 예를 들면, 도 5b에 도시된 바와 같이, 롤러는 슬라이드 플레이트가 제 1 방향(x 방향)으로 움직이는 것에 연동하여 시계 방향으로 회전할 수 있다. 롤러가 시계 방향으로 회전하면, 도 5b의 화살표 511과 같 이, 하우징의 내부에 위치한 플렉서블 디스플레이의 적어도 일부(예: 굴곡 가능부)는 전자 장치 의 제 2 방향(-x 방향)에 위치한 제 2 에지 부분(EG2)을 통해 슬라이드 아웃 될 수 있다. 일 실시예에 따 르면, 플렉서블 디스플레이의 적어도 일부(예: 굴곡 가능부)가 하우징의 내부로부터 슬라이드 아웃 되면, 플렉서블 디스플레이의 표시 면적은 제 1 폭(W1) 및 제 2 폭(W2)을 합한 폭을 가질 수 있다. 예를 들면, 플렉서블 디스플레이의 표시 면적은, 도 5b에 도시된 바와 같이, 전자 장치의 개방 상태 에서 제 1 폭(W1) 및 제 2 폭(W2)을 합한 폭을 가질 수 있다. 일 실시예에 따르면, 도 5a 및 도 5b에 도시된 바와 같이, 전자 장치의 폐쇄 상태에서 하우징의 내부 로 슬라이드 인 되어 있는 플렉서블 디스플레이의 적어도 일부분(예: 도 4의 굴곡 가능부)는 하우징 의 외부로 노출되는 플렉서블 디스플레이의 다른 일부분(예: 도 4의 평면부))와 나란하게 배치될 수 있다. 도 6a는 롤러가 전자 장치의 제 1 방향(x 방향)에 위치한 본 발명의 일 실시예에 따른 전자 장치의 폐쇄 상태를 나타낸 단면도이다. 도 6b는 롤러가 전자 장치의 제 1 방향(x 방향)에 위치한 본 발명의 일 실시예에 따른 전자 장치의 개방 상태를 나타낸 단면도이다. 도 6a 및 도 6b에 도시된 전자 장치는, 도 2a 내지 도 4에 도시된 전자 장치와 적어도 일부 유사하거 나, 전자 장치의 다른 실시예들을 더 포함할 수 있다. 이하, 도 6a 및 도 6b를 참조하여 도 2a 내지 도 4 에 도시된 전자 장치로부터 달라지거나 미설명된 특징만을 기재한다. 도 6a 및 도 6b를 참조하면, 일 실시예에 따른 전자 장치는, 하우징, 및 하우징으로부터 제 1 방향(x 방향)으로 연장 가능한 슬라이드 플레이트를 포함할 수 있다. 본 문서에서, 하우징은 제 1 하 우징으로 정의되고, 슬라이드 플레이트는 제 2 하우징으로 정의될 수 있다. 일 실시예에 따르면, 전자 장치는, 롤러를 포함할 수 있고, 롤러는 하우징의 내부 공간(예: 도 4의 내부 공간)에 배치될 수 있다. 예를 들면, 롤러는 슬라이드 플레이트(예: 도 4의 슬라이드 플레이트)에 포함될 수 있다.일 실시예에 따르면, 롤러는 전자 장치의 제 1 방향(x 방향)에 위치할 수 있고, 슬라이드 플레이트 의 움직임에 기반하여 지정된 방향으로 회전할 수 있다. 일 실시예에 따르면, 롤러는 전자 장치(20 0)의 제 4 측면(예: 도 4의 제4측면)에 인접하게 위치할 수 있다. 일 실시예에 따르면, 롤러는 슬라이드 플레이트가 제 1 방향(x 방향)으로 움직이는 것에 연동하여 반 시계 방향으로 회전할 수 있다. 롤러는 슬라이드 플레이트가 제 2 방향(-x 방향)으로 움직이는 것에 연동하여 시계 방향으로 회전할 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이는 롤러가 회전하는 것에 연동하여 표시 면적이 가변될 수 있다. 예를 들면, 도 6a에 도시된 바와 같이, 롤러는 슬라이드 플레이트가 제 2 방향(-x 방향)으로 움직이 는 것에 연동하여 시계 방향으로 회전할 수 있다. 롤러가 시계 방향으로 회전하면, 플렉서블 디스플레이 의 적어도 일부(예: 굴곡 가능부)는 전자 장치의 제 1 방향(x 방향)에 위치한 제 1 에지 부분 (EG1)을 통해 하우징의 내부로 슬라이드 인 될 수 있다. 제 1 에지 부분(EG1)은 전자 장치의 제 4 측 면(예: 도 4의 제4측면)에 인접한 슬라이드 플레이트의 일부분으로 정의될 수 있다. 일 실시예에 따 르면, 플렉서블 디스플레이의 적어도 일부(예: 굴곡 가능부)가 하우징의 내부로 슬라이드 인 되 면, 플렉서블 디스플레이의 표시 면적은 제 1 폭(W1)을 가질 수 있다. 예를 들면, 플렉서블 디스플레이 의 표시 면적은, 도 6a에 도시된 바와 같이, 전자 장치의 폐쇄 상태에서 제 1 폭(W1)을 가질 수 있다. 예를 들면, 도 6b에 도시된 바와 같이, 롤러는 슬라이드 플레이트가 제 1 방향(x 방향)으로 움직이는 것에 연동하여 반시계 방향으로 회전할 수 있다. 롤러가 반시계 방향으로 회전하면, 도 6b의 화살표 611과 같이, 하우징의 내부에 위치한 플렉서블 디스플레이의 적어도 일부(예: 도 4의 굴곡 가능부 )는 전자 장치의 제 1 방향(x 방향)에 위치한 제 1 에지 부분(EG1)을 통해 슬라이드 아웃 될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이의 적어도 일부(예: 굴곡 가능부)가 하우징의 내부로부터 슬라이드 아웃 되면, 플렉서블 디스플레이의 표시 면적은 제 1 폭(W1) 및 제 2 폭(W2)을 합한 폭을 가질 수 있다. 예를 들면, 플렉서블 디스플레이의 표시 면적은, 도 6b에 도시된 바와 같이, 전자 장 치의 개방 상태에서 제 1 폭(W1) 및 제 2 폭(W2)을 합한 폭을 가질 수 있다. 도 7a는 롤러가 전자 장치의 제 2 방향(-x 방향)에 위치한 본 발명의 다른 실시예에 따른 전자 장치의 폐쇄 상 태를 나타낸 단면도이다. 도 7b는 롤러가 전자 장치의 제 2 방향(-x 방향)에 위치한 본 발명의 다른 실시예에 따른 전자 장치의 개방 상태를 나타낸 단면도이다. 도 7a 및 도 7b에 도시된 전자 장치는, 도 5a 및 도 5b에 도시된 전자 장치와 적어도 일부 유사하거 나, 전자 장치의 다른 실시예들을 더 포함할 수 있다. 이하, 도 7a 및 도 7b를 참조하여 도 5a 및 도 5b에 도시된 전자 장치로부터 달라지거나 미설명된 특징만을 기재한다. 도 7a 및 도 7b를 참조하면, 일 실시예에 따른 전자 장치는, 롤러를 포함할 수 있고, 롤러는 하 우징의 내부 공간(예: 도 4의 내부 공간)에 배치될 수 있다. 예를 들면, 롤러는 슬라이드 플레 이트(예: 도 4의 슬라이드 플레이트)에 포함될 수 있다. 일 실시예에 따르면, 롤러는 전자 장치의 제 2 방향(-x 방향)에 위치할 수 있고, 슬라이드 플레이트 의 움직임에 기반하여 지정된 방향으로 회전할 수 있다. 일 실시예에 따르면, 롤러는 전자 장치(20 0)의 제 2 측면(예: 도 4의 제2측면)에 인접하게 위치할 수 있다. 일 실시예에 따르면, 롤러는 슬라이드 플레이트가 제 1 방향(x 방향)으로 움직이는 것에 연동하 여 시계 방향으로 회전할 수 있다. 롤러는 슬라이드 플레이트가 제 2 방향(-x 방향)으로 움직이는 것 에 연동하여 반시계 방향으로 회전할 수 있다. 일 실시예에 따르면, 도 7a에 도시된 바와 같이, 플렉서블 디스플레이의 적어도 일부분(예: 도 4의 굴곡 가능부)은 롤러가 반시계 방향으로 회전하는 것에 연동하여 하우징의 내부로 슬라이드 인 될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이의 적어도 일부분은 하우징의 내부로 슬라이드 인 되 면서 롤러의 외주면을 따라 감길 수 있다. 예를 들면, 플렉서블 디스플레이의 적어도 일부분은 전자 장치의 폐쇄 상태에서 롤러의 외주면에 젤리 롤(jelly roll) 형태로 감길 수 있다. 일 실시예에 따르면, 도 7b의 화살표 711과 같이, 플렉서블 디스플레이의 적어도 일부분(예: 도 4의 굴곡 가능부)은 롤러가 시계 방향으로 회전하는 것에 연동하여 하우징의 내부로부터 슬라이드 아웃 될 수 있다. 예를 들면, 롤러의 외주면을 따라 감겨 있는 플렉서블 디스플레이의 적어도 일부분은 롤 러가 시계 방향으로 회전하는 것에 연동하여 하우징의 외부로 슬라이드 아웃될 수 있다. 도 8a는 롤러가 전자 장치의 제 1 방향(x 방향) 및 제 2 방향(-x 방향) 각각에 위치한 본 발명의 다른 실시예에 따른 전자 장치의 폐쇄 상태를 나타낸 단면도이다. 도 8b는 롤러가 전자 장치의 제 1 방향(x 방향) 및 제 2 방 향(-x 방향) 각각에 위치한 본 발명의 다른 실시예에 따른 전자 장치의 개방 상태를 나타낸 단면도이다. 도 8a 및 도 8b에 도시된 전자 장치는, 도 2a 내지 도 4에 도시된 전자 장치와 적어도 일부 유사하거 나, 전자 장치의 다른 실시예들을 더 포함할 수 있다. 이하, 도 8a 및 도 8b를 참조하여 도 2a 내지 도 4 에 도시된 전자 장치로부터 달라지거나 미설명된 특징만을 기재한다. 도 8a 및 도 8b를 참조하면, 일 실시예에 따른 전자 장치는, 제 2 방향(-x 방향)으로 연장 가능한 제 1 하 우징, 제 1 방향(x 방향)으로 연장 가능한 제 2 하우징을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는, 제 1 롤러 및 제 2 롤러를 포함할 수 있고, 제 1 롤러 및 제 2 롤러는 하우징의 내부 공간(예: 도 4의 내부 공간)에 배치될 수 있다. 일 실시예에 따르면, 제 1 롤러는 전자 장치의 제 1 방향(x 방향)에 위치할 수 있고, 제 2 하우징 의 움직임에 기반하여 지정된 방향으로 회전할 수 있다. 일 실시예에 따르면, 제 1 롤러는 전자 장치 의 제 4 측면(예: 도 4의 제4측면)에 인접하게 위치할 수 있다. 일 실시예에 따르면, 제 1 롤러는 제 2 하우징이 제 2 방향(-x 방향)으로 움직이는 것에 연동하여 시 계 방향으로 회전할 수 있다. 예를 들면, 도 8a에 도시된 바와 같이, 제 1 롤러가 시계 방향으로 회전하면, 플렉서블 디스플레이의 적어도 일부분은 제 1 에지 부분(EG1)을 통해 제 2 하우징의 내부 로 슬라이드 인 될 수 있다. 제 1 에지 부분(EG1)은 전자 장치의 제 4 측면(예: 도 4의 제4측면)에 인접한 제 2 하우징의 일부분으로 정의될 수 있다. 일 실시예에 따르면, 제 1 롤러는 제 2 하우징이 제 1 방향(x 방향)으로 움직이는 것에 연동하 여 반시계 방향으로 회전할 수 있다. 예를 들면, 도 8b에 도시된 바와 같이, 제 1 롤러가 반시계 방향으로 회전하면, 플렉서블 디스플레이의 적어도 일부분은 제 1 에지 부분(EG1)을 통해 제 2 하우징의 내부 로부터 슬라이드 아웃 될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이의 표시 면적은 플렉서블 디 스플레이의 적어도 일부분이 제 1 에지 부분(EG1)을 통해 슬라이드 아웃 됨에 따라 제 1 방향(x 방향)으로 부터 제 3 폭(W3)만큼 증가할 수 있다. 일 실시예에 따르면, 제 2 롤러는 제 1 하우징이 제 1 방향(x 방향)으로 움직이는 것에 연동하여 반 시계 방향으로 회전할 수 있다. 예를 들면, 도 8a에 도시된 바와 같이, 제 1 롤러가 반시계 방향으로 회전 하면, 플렉서블 디스플레이의 적어도 일부분은 제 2 에지 부분(EG2)을 통해 제 1 하우징의 내부로 슬 라이드 인 될 수 있다. 제 2 에지 부분(EG2)은 전자 장치의 제 2 측면(예: 도 4의 제2측면)에 인접한 제 1 하우징의 일부분으로 정의될 수 있다. 일 실시예에 따르면, 제 2 롤러는 제 1 하우징이 제 2 방향(-x 방향)으로 움직이는 것에 연동하 여 시계 방향으로 회전할 수 있다. 예를 들면, 도 8b에 도시된 바와 같이, 제 2 롤러가 시계 방향으로 회 전하면, 플렉서블 디스플레이의 적어도 일부분은 제 2 에지 부분(EG2)을 통해 제 1 하우징의 내부로 부터 슬라이드 아웃 될 수 있다. 일 실시예에 따르면, 플렉서블 디스플레이의 표시 면적은 플렉서블 디스 플레이의 적어도 일부분이 제 2 에지 부분(EG2)을 통해 슬라이드 아웃 됨에 따라 제 2 방향(-x 방향)으로 부터 제 2 폭(W2)만큼 증가할 수 있다. 도 8a를 참조하면, 플렉서블 디스플레이의 적어도 일부(예: 굴곡 가능부)가 제 1 하우징 및/또 는 제 2 하우징의 내부로 슬라이드 인 되면, 플렉서블 디스플레이의 표시 면적은 제 1 폭(W1)을 가질 수 있다. 예를 들면, 플렉서블 디스플레이의 표시 면적은, 도 8a에 도시된 바와 같이, 전자 장치의 폐쇄 상태에서 제 1 폭(W1)을 가질 수 있다. 도 8b를 참조하면, 플렉서블 디스플레이의 적어도 일부(예: 굴곡 가능부)가 제 1 하우징 및 제 2 하우징의 내부로부터 슬라이드 아웃 되면, 플렉서블 디스플레이의 표시 면적은 제 1 폭(W1), 제 2 폭(W2), 제 3 폭(W3)을 합한 폭을 가질 수 있다. 예를 들면, 플렉서블 디스플레이의 표시 면적은, 도 8b에 도시된 바와 같이, 전자 장치의 개방 상태에서 제 1 폭(W1), 제 2 폭(W2), 제 3 폭(W3)을 합한 폭을 가질수 있다. 도 9는 다양한 실시예들에 따른 전자 장치의 블록도이다. 도 9에 도시된 전자 장치는, 도 2a 내지 도 4에 도시된 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실시예들을 더 포함할 수 있다. 이하, 도 9를 참조하여 도 2a 내지 도 4에 도시된 전자 장치 로부터 달라지거나 미설명된 특징만을 기재한다. 도 9를 참조하면, 전자 장치는, 프로세서(120(예: 도 1의 프로세서120)), 및 디스플레이 모듈(예: 도 1의 디스플레이 모듈)을 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은, 디스플레이 드라 이버 IC(display driver integrated circuit, 이하 “DDI”라 한다) 및 디스플레이 패널을 포함할 수 있다. 일 실시예에 따르면, DDI는 인터페이스 모듈(미도시), 메모리(예: 버퍼 메모리)), 이미지 처리 모듈(미도 시), 또는 맵핑 모듈(미도시)을 포함할 수 있다. DDI는, 예를 들면, 인터페이스 모듈을 통하여 프로세서 또는 프로세서의 기능과 독립적으로 운영되는 보조 프로세서(예: 도 1의 보조 프로세서)로부터 영상 데이터, 또는 상기 영상 데이터를 제어하기 위한 명령에 대응하는 영상 제어 신호를 포함하는 영상 정보를 수신할 수 있다. DDI는 터치 회로(미도시) 또는 센서 모듈(미도시) 등과 상기 인터페이스 모듈을 통하여 커뮤니케이션할 수 있다. 또한, DDI는 프로세서로부터 수신된 영상 정보 중 적어도 일부를 메모리에, 예를 들면, 프레임 단위로 저장할 수 있다. DDI의 이미지 처리 모듈은, 예를 들면, 상기 영상 데이터의 적어도 일부를 상기 영상 데이터의 특성 또는 디스플레이 패널의 특성에 적어도 기반하여 전처리 또는 후처리(예: 해상도, 밝 기, 또는 크기 조정))를 수행할 수 있다. DDI의 맵핑 모듈은 디스플레이 패널의 픽셀들의 속성 (예: 픽셀들의 배열(RGB stripe 또는 pentile)), 또는 서브 픽셀들 각각의 크기)에 적어도 일부 기반하여, 이미 지 처리 모듈를 통해 전처리 또는 후처리된 상기 영상 데이터를 상기 픽셀들을 구동할 수 있는 전압 값 또 는 전류 값으로 변환할 수 있다. 디스플레이 패널의 적어도 일부 픽셀들은, 예를 들면, 상기 전압 값 또는 전류 값에 기반하여 구동됨으로써 상기 영상 데이터에 대응하는 시각적 정보(예: 텍스트, 이미지, 또는 아 이콘))가 디스플레이 패널에 표시될 수 있다. 일 실시예에 따르면, 디스플레이 패널은 플렉서블한 재질로 형성될 수 있다. 예를 들면, 디스플레이 패널 은, OLED(organic light emitting diodes)를 포함하는 OLED 디스플레이 패널일 수 있다. 일 실시예 에 따르면, 디스플레이 패널은, 플렉서블한 기판(예: 폴리이미드(polyimides) 기판))을 포함함으로써 접거 나, 구부리거나, 말거나, 또는 펼칠 수 있다. 일 실시예에 따르면, 디스플레이 패널은 OLED를 포함하는 복수의 픽셀들, 복수의 픽셀들을 구동 하기 위한 EM(emission) 드라이버, 가변 저항, 비교기, 및/또는 논리 소자를 포함할 수 있다. 다양한 실시예들에 따르면, 논리 소자는 생략될 수 있다. 일 실시예에 따르면, 디스플레이 패널은 표시 영역(예: 도 11의 표시 영역(AA)) 및 비표시 영역(예: 도 11 의 비표시 영역(NA))을 포함할 수 있다. 예를 들면, 디스플레이 패널의 표시 영역(AA)에는 복수의 픽셀들 이 위치하고, 복수의 픽셀들은 매트릭스 형태로 배열될 수 있다. 복수의 픽셀들은 표시 영역 (AA)에 형성된 복수의 EM 신호 라인들(예: 도 11의 EM 신호 라인들(EML1~EMLn))을 통해 EM 출력 신호들(예: 도 11의 복수의 EM 출력 신호들(Vout1~Voutn))을 공급받을 수 있다. 복수의 픽셀들은 EM 출력 신호 (Vout1~Voutn)에 응답하여 지정된 영상을 표시할 수 있다. 디스플레이 패널의 비표시 영역(NA)에는 복수의 픽셀들을 구동하기 위한 EM(emission) 드라이버, 가변 저항, 비교기, 및/또는 논리 소자 가 위치할 수 있다. EM 드라이버는 DDI 또는 프로세서로부터 공급된 제어 신호(예: 도 11의 스타트 신호(SS))에 응 답하여 복수의 EM 신호들(예: 도 11의 EM 신호들(EM1~EMn))을 순차적으로 생성할 수 있다. EM 드라이버는 생성된 복수의 EM 신호들(EM1~EMn)을 비교기로 공급할 수 있다. 비교기는 가변 저항의 저항 값을 입력받고, 가변 저항의 저항 값에 따라 복수의 EM 출력 신호들 (Vout1~Voutn)을 복수의 EM 신호 라인들(EML1~EMLn)을 통해 출력할 수 있다. 예를 들면, 비교기는 가변 저항의 저항 값이 기준 저항 값(Rref)(예: 도 12의 기준 저항 값(Rref))보다 작거나 같은 경우 EM 드라이 버로부터 수신된 EM 신호들(EM1~EMn)을 EM 출력 신호(Vout1~Voutn)로서 출력할 수 있다. 비교기는 가변 저항의 저항 값이 기준 저항 값(Rref)보다 큰 경우 EM 출력 신호(Vout1~Voutn)를 출력하지 않을 수있다. 일 실시예에 따르면, 가변 저항은 배선 형태의 가변 저항일 수 있다. 예를 들면, 가변 저항은 디스플레이 패널의 비표시 영역(NA)에서 배선 형태로 형성되고, 플렉서블 디스플레이가 슬라이드 인 또는 슬라이드 아웃되는 방향으로 배열되는 복수의 배선들을 포함할 수 있다. 예를 들면, 배선 형태인 가변 저 항들은 도 2a 내지 도 4에 도시된 제 1 방향(x 방향) 또는 제 2 방향(-x 방향)으로 간격을 두고 형성될 수 있다. 일 실시예에 따르면, 가변 저항의 저항 값은 가변 저항을 형성하는 배선의 곡률에 따라 가변될 수 있다. 예를 들면, 상기 배선의 곡률은 디스플레이 패널의 형태에 따라 가변될 수 있다. 일 실시예에 따 르면, 가변 저항의 저항 값은 상기 배선의 곡률이 증가할수록 증가할 수 있다. 예를 들면, 가변 저항(93 3)의 저항 값은 롤러(예: 도 6a의 롤러)와 접촉하거나 근접한 디스플레이 패널의 일부분에서 상대적 으로 높은 값(예를 들어, 기준 저항보다 높은 저항 값)을 가질 수 있다. 가변 저항의 저항 값은 롤러(62 0)와 근접하지 않고 평평한 디스플레이 패널의 일부분에서 상대적으로 낮은 값(예를 들어, 기준 저항보다 낮은 저항 값)을 가질 수 있다. 논리 소자(예: 논리 회로, 도 16의 논리 소자 또는 도 19의 논리 소자)는 복수의 EM 드라이버 들로부터 복수의 EM 신호들(EM1~EMn)을 입력 받고, 복수의 EM 신호들(EM1~EMn)의 전압 값(예: 하이 상태 (H) 또는 로우 상태(L))에 따라 EM 변환 신호를 출력할 수 있다. 예를 들면, 논리 소자는 복수의 EM 신호 들(EM1~EMn)의 전압 값에 따라 EM 변환 신호를 출력하는 OR 게이트 소자(예: OR 게이트 회로), 및/또는 AND 게 이트 소자(예: AND 게이트 회로)일 수 있다. OR 게이트 소자는 입력된 복수의 EM 신호들(EM1~EMn) 중에서 적어 도 하나의 전압 값이 하이 상태(H)이면, 하이 상태(H)의 EM 변환 신호를 출력하고, 복수의 EM 신호들(EM1~EMn) 모두의 전압 값이 로우 상태(L)이면 EM 변환 신호를 출력하지 않을 수 있다. AND 게이트 소자는 복수의 EM 신호 들(EM1~EMn) 모두의 전압이 하이 상태(H)이면 하이 상태(H)의 EM 변환 신호를 출력하고, 복수의 EM 신호들 (EM1~EMn) 중에서 적어도 하나의 전압 값이 로우 상태(L)이면 EM 신호를 출력하지 않을 수 있다. 일 실시예에 따르면, 논리 소자는 복수의 EM 신호들(EM1~EMn)의 전압 값에 따라 생성된 EM 변환 신호를 비교기로 공급할 수 있다. 어떤 실시예에서, 논리 소자는 생략될 수 있다. 도 10은 복수의 픽셀들 중에서 하나의 픽셀을 구동하기 위한 픽셀 구동 회로를 설명한 예시이다. 다양한 실시예들에 따르면, 디스플레이 패널(예: 도 9의 디스플레이 패널)은, OLED를 포함하는 복수의 픽 셀들(예: 도 9의 복수의 픽셀들)을 포함할 수 있다. 다양한 실시예들에 따르면, 1 개의 픽셀에 포함된 부품들 및 상기 부품들의 회로적인 연결은 공지된 방법과 동일 또는 유사할 수 있다. 예를 들면, 하나의 픽셀에 대한 등가 회로는 대한민국 공개특허공보 제10-2016-0007982호(패밀리출원: US 9390655 B2)에 의해 개시된 등가 회로와 동일하거나 또는 적어도 일부가 유사할 수 있다. 예를 들면, 도 10에 도시된 바와 같이, 하 나의 픽셀은 7개의 박막 트랜지스터(TR1~TR7), 1 개의 커패시터(CST), 및 유기 발광 다이오드(OLED)를 포 함할 수 있다. 도 10에 도시된 박막 트랜지스터 TR5 및 TR6은 EM 신호 라인(EML)을 통해 공급된EM 신호(예: 도 11의 EM 출력 신호(Vout))에 응답하여 턴온될 수 있다. TR5 및 TR6은 턴온시 OLED에 픽셀 데이터(DATA)에 대응 하는 구동 전류(ID)를 공급할 수 있다. OLED는 구동 전류(ID)에 따라 픽셀 데이터(DATA)에 대응하는 지정된 계 조를 표시할 수 있다. 본 발명의 다양한 실시예들에 따른 전자 장치(예: 도 2의 전자 장치)는, 제 1 방향으로 연장되는 하우징 (예: 도 2a의 하우징), 상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이(예: 도 2a의 플렉서블 디스플레이), 상기 하 우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동하는 디스플레이 드라이버 IC, 및 프 로세서(예: 도 1의 프로세서)를 포함하고, 상기 플렉서블 디스플레이의 패널은, EM 신호 라인(예: 도 11의 EM 신호 라인(EML))과 연결된 픽셀에 의해 이미지를 표시하는 표시 영역(예: 도 11의 표시 영역(AA)), 및 상기 표시 영역(AA)의 주변에 위치하고 상기 EM 신호 라인(EML)이 연결되는 EM 드라이버를 포함하는 비표 시 영역(예: 도 11의 비표시 영역(NA))을 포함하고, 상기 비표시 영역(NA)에는, 상기 제 1 방향을 따라 간격을 두고 배열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스플레이의 변형에 따라 저항 값이 가변 되는 가변 저항, 및 상기 가변 저항의 저항 값을 입력받아 상기 EM 드라이버와 상기 EM 신호 라 인(EML) 사이의 연결을 제어하는 비교기가 위치할 수 있다. 일 실시예에 따르면, 상기 EM 드라이버는 EM 신호를 출력하고, 상기 비교기는 상기 가변 저항의 저항 값에 따라 상기 EM 드라이버로부터 출력된 상기 EM 신호가 상기 EM 신호 라인(EML)에 공급되는 것을 제어할 수 있다. 일 실시예에 따르면, 상기 비교기는, 상기 가변 저항의 저항 값이 기준 저항 값보다 작거나 같으면 상기 EM 신호를 상기 EM 신호 라인(EML)에 공급하고, 상기 가변 저항의 저항 값이 상기 기준 저항 값보다 크면 상기 EM 신호를 상기 EM 신호 라인(EML)에 공급하지 않을 수 있다. 일 실시예에 따르면, 상기 가변 저항의 저항 값은 상기 하우징이 상기 제 1 방향으로 연장되는 것에 의해 상기 플렉서블 디스플레이의 적어도 일부분이 변형되면 상기 기준 저항 값보다 커질 수 있다. 일 실시예에 따르면, 상기 비교기로부터 상기 EM 신호 라인(EML)에 공급되는 출력 신호는 상기 프로세서 또는 상기 디스플레이 드라이버 IC에 공급될 수 있다. 일 실시예에 따르면, 상기 비표시 영역(NA)에는, 상기 EM 드라이버로부터 복수의 EM 신호들을 입력받고, 상기 복수의 EM 신호들의 전압 레벨에 따라 EM 변환 신호를 상기 비교기에 공급하는 논리 소자가 위치할 수 있다. 일 실시예에 따르면, 상기 논리 소자는 AND 게이트 소자를 포함하고, 복수의 EM 신호들의 전압이 모두 하이 상 태이면 상기 EM 변환 신호를 상기 비교기에 공급할 수 있다. 일 실시예에 따르면, 상기 논리 소자에 입력되는 복수의 EM 신호들은 3 수평 기간 동안 하이 상태로 출력되고, 1 수평 기간씩 위상이 지연되도록 출력될 수 있다. 일 실시예에 따르면, 상기 논리 소자는 OR 게이트 소자를 포함하고, 복수의 EM 신호들 중에서 적어도 하나의 전 압이 하이 상태이면 상기 EM 변환 신호를 상기 비교기에 공급할 수 있다. 일 실시예에 따르면, 상기 논리 소자에 입력되는 복수의 EM 신호들은 1 수평 기간 동안 하이 상태로 출력되고, 1 수평 기간씩 위상이 지연되도록 출력될 수 있다. 일 실시예에 따르면, 상기 비표시 영역(NA)에는, 상기 비교기로부터 제 k EM 출력 신호를 입력받고, 입력 된 상기 제 k EM 출력 신호를 출력하는 제 1 트랜지스터, 및 상기 비교기로부터 제 k-1 EM 출력 신호를 입 력받고, 상기 제 k-1 EM 출력 신호에 응답하여 상기 제 1 트랜지스터로부터 출력된 상기 제 k EM 출력 신호를 상기 EM 신호 라인(EML)에 공급하는 제 2 트랜지스터가 위치할 수 있다. 본 발명의 다양한 실시예들에 따른 전자 장치(예: 도 2의 전자 장치)의 방법에 있어서, 상기 전자 장치 는, 제 1 방향으로 연장되는 하우징(예: 도 2a의 하우징), 상기 하우징의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉서블 디스플레이(예: 도 2a의 플렉서블 디스플레이), 상기 하우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동 하는 디스플레이 드라이버 IC, 및 프로세서(예: 도 1의 프로세서)를 포함하고, 상기 플렉서블 디스플 레이의 패널은, EM 신호 라인(EML)과 연결된 픽셀에 의해 이미지를 표시하는 표시 영역(AA), 및 상기 표시 영역(AA)의 주변에 위치하고 상기 EM 신호 라인(EML)이 연결되는 EM 드라이버를 포함하는 비표시 영역(N A)을 포함하고, 상기 전자 장치의 방법은, 상기 EM 드라이버가 EM 신호를 출력하는 동작, 및 상기 비 표시 영역(NA)에 위치한 비교기가 가변 저항의 저항 값을 입력받아 상기 EM 드라이버와 상기 EM 신호 라인(EML) 사이의 연결을 제어하는 동작을 포함하고, 상기 가변 저항은 상기 제 1 방향을 따라 간격 을 두고 배열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스플레이의 변형에 따라 저항 값이 가변될 수 있다. 일 실시예에 따르면, 상기 비교기가, 상기 가변 저항의 저항 값이 기준 저항 값보다 작거나 같은 것 에 따라 상기 EM 신호를 상기 EM 신호 라인(EML)에 공급하는 동작, 및 상기 비교기가, 상기 가변 저항 의 저항 값이 상기 기준 저항 값보다 큰 것에 따라 상기 EM 신호를 상기 EM 신호 라인(EML)에 공급하지 않 는 동작을 더 포함할 수 있다. 일 실시예에 따르면, 상기 가변 저항의 저항 값은 상기 하우징이 상기 제 1 방향으로 연장되는 것에 의해 상기 플렉서블 디스플레이의 적어도 일부분이 변형되면 상기 기준 저항 값보다 커질 수 있다. 일 실시예에 따르면, 상기 비교기가 상기 EM 신호 라인(EML)에 공급되는 출력 신호를 상기 프로세서 또는 상기 디스플레이 드라이버 IC에 공급하는 동작을 더 포함할 수 있다. 본 발명의 다양한 실시예들에 따른 전자 장치는, 제 1 방향으로 연장되는 하우징, 상기 하우징 의 연장에 의해 노출되는 영역이 변경되고, 노출되는 영역에 의해 상기 전자 장치의 일면을 형성하는 플렉 서블 디스플레이, 상기 하우징의 내부에 위치하며, 상기 플렉서블 디스플레이를 구동하는 디스플레이 드라이버 IC, 및 프로세서를 포함하고, 상기 플렉서블 디스플레이의 패널은, EM 신호 라 인(EML)과 연결된 픽셀에 의해 이미지를 표시하는 표시 영역(AA), 및 상기 표시 영역(AA)의 주변에 위치하고 상 기 EM 신호 라인(EML)이 연결되는 EM 드라이버를 포함하는 비표시 영역(NA)을 포함하고, 상기 비표시 영역 (NA)에는, 상기 제 1 방향을 따라 간격을 두고 배열되고, 상기 하우징의 연장에 의한 상기 플렉서블 디스 플레이의 변형에 따라 저항 값이 가변되는 가변 저항, 및 상기 가변 저항의 저항 값을 입력받아 상기 EM 드라이버에 대한 클럭 신호의 공급 여부를 제어하는 비교기(예: 도 24의 비교기)가 위치할 수 있다. 일 실시예에 따르면, 상기 비교기는, 상기 가변 저항의 저항 값이 기준 저항 값보다 작거나 같으면 상기 클럭 신호를 상기 EM 드라이버에 공급하고, 상기 가변 저항의 저항 값이 상기 기준 저항 값보다 크면 상기 클럭 신호를 상기 EM 드라이버에 공급하지 않을 수 있다. 일 실시예에 따르면, 상기 가변 저항의 저항 값은 상기 하우징이 상기 제 1 방향으로 연장되는 것에 의해 상기 플렉서블 디스플레이의 적어도 일부분이 변형되면 상기 기준 저항 값보다 커질 수 있다. 일 실시예에 따르면, 상기 비교기로부터 상기 EM 드라이버에 공급되는 클럭 신호는 상기 프로세서 또는 상기 디스플레이 드라이버 IC에 공급될 수 있다. 일 실시예에 따르면, 상기 비교기는, 상기 클럭 신호를 지정된 개수의 EM 드라이버들 포함하는 하나 의 그룹당 하나씩 공급할 수 있다. 도 11은 본 발명의 일 실시예에 따른 디스플레이 패널의 구성도이다. 도 11을 참조하면, 일 실시예에 따른 디스플레이 패널은, 표시 영역 및 비표시 영역을 포함할 수 있다. 일 실시예에 따르면, 표시 영역(AA)에는 복수의 픽셀들(예: 도 9의 복수의 픽셀)이 배치되고, 복수의 픽셀 들은 매트릭스 형태로 배열될 수 있다. 복수의 픽셀들은 1 행 단위로 EM 신호 라인(EML)과 연결되고, EM 신호 라인(EML)을 통해 EM 출력 신호(Vout)를 공급받을 수 있다. 예를 들면, 제 1 행에 배열되는 제 1 픽셀 들(Pixels_H1)은 제 1 EM 신호 라인(EML1)을 통해 제 1 EM 출력 신호(Vout1)를 공급받고, 제 2 행에 배열되는 제 2 픽셀들(Pixels_H2)은 제 2 EM 신호 라인(EML2)을 통해 제 2 EM 출력 신호(Vout2)를 공급받고, 제 n 행에 배열되는 제 n 픽셀들(Pixels_Hn)은 제 n EM 신호 라인(EMLn)을 통해 제 n EM 출력 신호(Voutn)를 공급받을 수 있다. 일 실시예에 따르면, 비표시 영역(NA)에는 EM 드라이버, 비교기, 및 가변 저항이 배치될 수 있 다. EM 드라이버는 복수의 EM 드라이버들(932_1~932_n)을 포함할 수 있다. 복수의 EM 드라이버들 (932_1~932_n)은 복수의 픽셀들에게 1 행 단위로 EM 신호를 공급하기 위하여 복수의 픽셀들의 행의 개수에 대응 하는 n개의 EM 드라이버를 포함할 수 있다. 예를 들면, 제 1 EM 드라이버(932_1)는 제 1 EM 신호(EM1)를 출력하고, 제 2 EM 드라이버(932_2)는 제 2 EM 신호(EM2)를 출력하고, 제 n EM 드라이버(932_n)는 제 n EM 신 호(EMn)를 출력할 수 있다. 일 실시예에 따르면, EM 드라이버는 프로세서(예: 도 1의 프로세서) 또는 DDI(예: 도 9의 DDI(92 0))로부터 공급되는 스타트 신호(SS)에 응답하여 클럭 신호(CLK)에 기반한 EM 신호들(EM1~EMn)을 순차적으로 출 력할 수 있다. 예를 들면, 복수의EM 드라이버들(932_1~932_n)은 클럭 신호(CLK)에 기반한 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn)를 순차적으로 출력할 수 있다. 비교기는 복수의 비교기들(934_1~934_n)을 포함할 수 있다. 비교기는 복수의 픽셀들에게 1 행 단위로 EM 출력 신호(Vout)를 공급하기 위하여 복수의 픽셀들의 행의 개수에 대응하는 n개의 비교기(934_1~934_n)를 포 함할 수 있다. 예를 들면, 제 1 비교기(934_1)는 제 1 EM 출력 신호(Vout1)를 출력하고, 제 2 비교기(934_2)는 제 2 EM 출력 신호(Vout2)를 출력하고, 제 n 비교기(934_n)는 제 n EM 출력 신호(Voutn)를 출력할 수 있다. 제 1 EM 출력 신호(Vout1)는 제 1 EM 신호 라인(EML1)을 통해 제 1 픽셀들(Pixels_H1)에게 공급될 수 있다. 제 2 EM 출력 신호(Vout2)는 제 2 EM 신호 라인(EML2)을 통해 제 2 픽셀들(Pixels_H2)에게 공급될 수 있다. 제 n EM 출력 신호(Voutn)는 제 n EM 신호 라인(EMLn)을 통해 제 n 픽셀들(Pixels_Hn)에게 공급될 수 있다. 비교기는 EM 드라이버로부터 EM 신호(EM)를 입력받고, 가변 저항(Ri1~Rin)의 저항 값을 입력받을 수 있다. 복수의 비교기들은 가변 저항(Ri1~Rin)의 저항 값에 따라 복수의 EM 출력 신호들(Vout1~Voutn)을 복 수의 EM 신호 라인들(EML1~EMLn)을 통해 출력할 수 있다. 예를 들면, 비교기는 가변 저항(Ri1~Rin)의 저항값이 기준 저항 값(Rref)(예: 도 12의 기준 저항 값(Rref))보다 작거나 같은 경우 EM 드라이버로부터 수신 된 EM 신호(EM)를 EM 출력 신호(Vout)로서 출력할 수 있다. 비교기는 가변 저항(Ri1~Rin)의 저항 값이 기 준 저항 값(Rref)보다 큰 경우 EM 출력 신호(Vout)를 출력하지 않을 수 있다. 예를 들면, 비교기는 가변 저항(Ri1~Rin)의 저항 값이 기준 저항 값(Rref)보다 큰 경우 EM 드라이버로부터 EM 신호(EM)가 수신되더라 도, 수신된 EM 신호(EM)를 EM 출력 신호(Vout)로서 출력하지 않을 수 있다. 다양한 실시예들에 따르면, 비교기의 출력인 EM 출력 신호(Vout)는 EM 신호 라인들(EML1~EMLn)에 공급될 뿐만 아니라, 도시되지 않은 별도의 신호 라인을 통해 DDI 또는 프로세서로 공급될 수 있다. DDI 또는 프로세서는 EM 출력 신호(Vout)를 입력받고, 영상 정보의 속성을 변경할 수 있다. 예를 들 면, DDI 또는 프로세서는 EM 출력 신호(Vout)가 지정된 타이밍에 출력되는지 여부를 결정하고, 상기 결정에 기반하여 디스플레이 패널을 통해 표시할 영상의 해상도를 변경할 수 있다. DDI 또는 프로세 서는, 1 프레임 기간 중에서 특정 EM 출력 신호(Vout)가 출력되도록 지정된 타이밍, 예컨대 k 번째 EM 출 력 신호(Voutk)의 출력 타이밍에 k 번째 EM 출력 신호(Voutk)가 출력되지 않으면, 디스플레이 패널의 일부 분(예: k 번째 비교기가 위치한 부분)이 슬라이드 인 된 것으로 결정하고, 표시할 영상의 해상도를 변경할 수 있다. 다양한 실시예들에 따르면, DDI 또는 프로세서는 EM 출력 신호(Vout)가 지정된 타이밍에 출력되는지 여부에 기반하여 디스플레이 패널을 통해 표시할 영상의 해상도를 변경하거나, 또는 영상의 레이아웃을 변 경할 수 있다. 예를 들면, DDI 또는 프로세서는 EM 출력 신호(Vout)가 지정된 타이밍에 출력되는지 여부에 기반하여 제 1 어플리케이션과 관련하여 표시되는 제 1 사용자 인터페이스를 제 2 사용자 인터페이스로 변경할 수 있다. 일 실시예에 따르면, 가변 저항(Ri1~Rin)은 배선 형태의 가변 저항(Ri1~Rin)일 수 있다. 예를 들면, 가변 저항 (Ri1~Rin)은 디스플레이 패널의 비표시 영역(NA)에서 배선 형태로 형성되고, 플렉서블 디스플레이가 슬라이드 아웃되는 제 1 방향(x 방향)으로부터 플렉서블 디스플레이가 슬라이드 인 되는 제 2 방향(-x 방 향)으로 배열되는 복수의 배선들(Ri1~Rin)을 포함할 수 있다. 일 실시예에 따르면, 복수의 배선들(Ri1~Rin)에 의해 형성되는 가변 저항(Ri1~Rin)의 저항 값은 비교기로 입력될 수 있다. 다양한 실시예들에 따른 전자 장치는, 프로세서나 별도 연산 장치 없이 디스플레이 패널에 내장 된 배선 형태의 가변 저항(Ri1~Rin)을 이용하여 디스플레이 패널의 형태에 따라 디스플레이 패널의 표시 면적을 빠르게 제어할 수 있다. 다양한 실시예들에 따른 전자 장치는, 디스플레이 패널에 내장된 아날로그 소자, 즉 가변 저항 (Ri1~Rin)을 이용하여 표시 면적을 변경하므로, 프로세서나 별도 연산 장치에서 별도의 센서를 이용하여 디스플레이 패널의 형태 변경을 감지하는 비교예에 비하여 디스플레이 패널의 부분적인 온-오프 스위 칭을 빠르게 수행할 수 있다. 다양한 실시예들에 따른 전자 장치는, 프로세서에서 디스플레이 패널의 형태 변경을 감지함에 있어서, 디스플레이 패널에 내장된 아날로그 소자, 즉 가변 저항(Ri1~Rin)을 이용함에 따라 연산량을 줄일 수 있고, 소비 전력을 줄일 수 있다. 도 12는 가변 저항의 저항 값과 기준 저항의 차이에 따른 비교기의 출력 전압을 설명한 예시이다. 도 13은 가변 저항의 곡률에 따른 비교기의 출력 전압을 설명한 예시이다. 이하, 도 11내지 도 13을 결부하여, 비교기(예: 도 11의 비교기)의 출력 전압(예: 도 11의 EM 출력 신호 (Vout))를 설명한다. 도 11 및 도 12를 참조하면, 비교기는 제 1 입력 단자(예: V+ 입력 단자)를 통해 기준 저항 값(Rref)에 대 응하는 제 1 전압을 입력받고, 제 2 입력 단자(예: V- 입력 단자)를 통해 가변 저항(Ri1~Rin)의 저항 값에 대응 하는 제 2 전압을 입력받을 수 있다. 비교기는 제 1 전압과 제 2 전압의 크기를 비교하고, 제 2 전압의 크기가 제 1 전압보다 작거나 같은 경우 EM 드라이버(예: 도 11의 EM 드라이버로부터 수신된 EM 신호(EM)를 EM 출력 신호(Vout)로서 출력할 수 있 다. 예를 들면, 비교기는 제 2 전압의 크기가 제 1 전압보다 작거나 같은 경우 하이 상태(H)에 대응하는 전압을 EM 신호 라인(예: 도 11의 EM 신호 라인(EML))을 통해 출력할 수 있다. EM 신호 라인(EML)을 통해 하이 상태(H)에 대응하는 전압을 공급받은 1 행의 픽셀들은 지정된 계조를 표시할 수 있다.비교기는 제 1 전압과 제 2 전압의 크기를 비교하고, 제 2 전압의 크기가 제 1 전압 큰 경우 EM 출력 신호 (Vout)를 출력하지 않을 수 있다. 예를 들면, 비교기는 제 2 전압의 크기가 제 1 전압보다 큰 경우 로우 상태(L)에 대응하는 전압을 EM 신호 라인(EML)을 통해 출력할 수 있다. EM 신호 라인(EML)을 통해 로우 상태 (L)에 대응하는 전압을 공급받은 1 행의 픽셀들은 0 계조를 표시하거나 비활성화 상태로 구동될 수 있다. 도 11 및 도 13을 참조하면, 가변 저항(Ri1~Rin)의 저항 값은 가변 저항(Ri1~Rin)을 형성하는 배선의 곡률에 따 라 가변될 수 있다. 예를 들면, 상기 배선의 곡률은 디스플레이 패널의 형태에 따라 가변될 수 있다. 일 실시예에 따르면, 가변 저항(Ri1~Rin)의 저항 값은 상기 배선의 곡률이 증가할수록 증가할 수 있다. 예를 들면, 가변 저항(Ri1~Rin)의 저항 값은 배선의 곡률에 대응하는 각도가 기준 각도(RA)인 경우 기준 저항 값(Rref)을 가질 수 있다. 예를 들면, 가변 저항(Ri1~Rin)의 저항 값이 기준 저항 값(Rref)보다 크거나 같다는 것은 가변 저항(Ri1~Rin)을 형성하는 배선의 곡률에 대응하는 각도가 기준 각도(RA)보다 크거나 같다는 것을 의미할 수 있 다. 예를 들면, 가변 저항(Ri1~Rin)의 저항 값이 기준 저항 값(Rref)보다 작다는 것은 가변 저항(Ri1~Rin)을 형 성하는 배선의 곡률에 대응하는 각도가 기준 각도(RA)보다 작다는 것을 의미할 수 있다. 비교기는 가변 저항(Ri1~Rin)을 형성하는 배선의 곡률에 대응하는 각도가 기준 각도(RA)보다 작은 경우, 하이 상태(H)인 EM 출력 신호(Vout)를 EM 신호 라인(EML)을 통해 출력할 수 있다. 비교기는 가변 저항(Ri1~Rin)을 형성하는 배선의 곡률에 대응하는 각도가 기준 각도(RA)보다 크거나 같은 경우, 로우 상태(L) 상태인 EM 출력 신호(Vout)를 EM 신호 라인(EML)을 통해 출력할 수 있다. 본 문서에서 EM 신호(EM)가 출력된다는 것은 EM 신호(EM)가 하이 상태(H)의 전압 레벨을 갖는다는 것으로 정의 될 수 있다. 본 문서에서 EM 신호(EM)가 출력되지 않는다는 것은 EM 신호(EM)가 로우 상태(L)의 전압 레벨을 갖는다는 것으 로 정의될 수 있다. 본 문서에서 EM 출력 신호(Vout)가 출력된다는 것은 EM 출력 신호(Vout)가 하이 상태(H)의 전압 레벨을 갖는다 는 것으로 정의될 수 있다. 본 문서에서 EM 출력 신호(Vout)가 출력되지 않는다는 것은 EM 출력 신호(Vout)가 로우 상태(L)의 전압 레벨을 갖는다는 것으로 정의될 수 있다. 도 14는 일 실시예에 따른 전자 장치가 개방 상태일 때 도 11에 도시된 EM 드라이버의 출력 신호 및 비교기의 출력 신호를 나타낸 예시이다. 도 14를 참조하면, 일 실시예에 따른 전자 장치가 개방 상태일 때 EM 드라이버는 순차적으로 EM 신호 (EM)를 출력할 수 있다. 예를 들면, EM 드라이버는 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn)를 순차적으 로 출력할 수 있다. 제 1 EM 신호 내지 제 n EM 신호들(EM1~EMn) 각각은 1 수평 기간(1H) 동안 하이 상태(H)로 출력될 수 있다. 비교기(예: 도 9의 비교기)는 순차적으로 출력되는 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn)를 입력받고, 가변 저항의 저항 값에 따라 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn)를 EM 출력 신호(Vout)로서 출력할 수 있다. 예를 들면, 전자 장치가 개방 상태일 때, 디스플레이 패널(예: 도 9의 디스플레이 패널)의 전체적인 형태는 평평할 수 있다. 디스플레이 패널의 전체적인 형태가 평평하면, 가변 저항(Ri1~Rin)을 형 성하는 배선의 곡률이 기준 각도보다 작거나 같고, 가변 저항(Ri1~Rin)의 저항 값은 기준 저항 값(Rref)보다 작 거나 같을 수 있다. 비교기는 가변 저항(Ri1~Rin)의 저항 값이 기준 저항 값(Rref)보다 작거나 같은 것에 따라 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn) 모두를 EM 출력 신호(Vout)로서 출력할 수 있다. 도 15는 일 실시예에 따른 전자 장치가 폐쇄 상태 또는 중간 상태일 때 도 11에 도시된 EM 드라이버의 출력 신 호 및 비교기의 출력 신호를 나타낸 예시이다. 도 15를 참조하면, 일 실시예에 따른 전자 장치가 폐쇄 상태 또는 중간 상태일 때 EM 드라이버는 순 차적으로 EM 신호들(EM1~EMn)을 출력할 수 있다. 예를 들면, EM 드라이버는 1 프레임 기간 동안 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn)를 순차적으로 출력할 수 있다. 제 1 EM 신호 내지 제 n EM 신호들 EM1~EMn 각각은 1 수평 기간(1H) 동안 하이 상태(H)로 출력될 수 있다. 비교기(예: 도 9의 비교기)는 순차적으로 출력되는 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn)를 입력받고, 가변 저항(Ri1~Rin)의 저항 값에 따라 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn) 중에서 적어도 일부를 EM 출력신호(Vout)로서 출력할 수 있다. 예를 들면, 전자 장치가 폐쇄 상태 또는 중간 상태일 때, 디스플레이 패 널의 적어도 일부분은 곡면 형태를 가질 수 있다. 예를 들어, 플렉서블 디스플레이 중에서 롤러(예: 도 6a의 롤러)와 접촉하거나 롤러와 인접한 적어도 일부분은 곡면 형태를 가질 수 있다. 디스플레이 패널(예: 도 9의 디스플레이 패널)의 형태가 곡면 형태를 갖게 되면, 가변 저항(Ri1~Rin)을 형성하는 배선 의 곡률이 기준 각도보다 크고, 가변 저항(Ri1~Rin)의 저항 값은 기준 저항 값(Rref)보다 클 수 있다. 비교기 는 가변 저항(Ri1~Rin)의 저항 값이 기준 저항 값(Rref)보다 큰 것에 따라 제 1 EM 신호 내지 제 n EM 신 호(EM1~EMn) 중에서 일부만을 EM 출력 신호(Vout)로서 출력할 수 있다. 예를 들어, 도시된 바와 같이, 제 k EM 신호(EMk)를 출력하는 제 k EM 드라이버와 인접한 가변 저항(예: 제 k 가변 저항(Rik))부터 제 n EM 신호(EMn)를 출력하는 제 n EM 드라이버에 인접한 가변 저항(예: 제 n 가변 저항 (Rik))까지의 가변 저항들(Rik~Rin)은 기준 저항 값(Rref)보다 클 수 있다. 상기 가변 저항들(Rik~Rin)의 저항 값들이 기준 저항 값(Rref)보다 크면, 비교기는 제 1 EM 출력 신호(Vout1)부터 제 k-1 EM 출력 신호 (Voutk-1)는 순차적으로 출력하되, 제 k EM 출력 신호(Voutk)부터 제 n EM 출력 신호(Voutn)는 출력하지 않을 수 있다. 예를 들면, 비교기는 EM 드라이버가 제 1 EM 신호(EM1)를 출력하는 기간부터 EM 드라이버 가 제 k-1 EM 신호(EMk-1)를 출력하는 T1 기간까지는 EM 출력 신호(Vout)를 출력할 수 있다. 비교기(93 4)는 EM 드라이버가 제 k EM 신호(EMk)를 출력하는 T2 기간부터 EM 드라이버가 제 n EM 신호(마지막 EM 신호, EMn)를 출력하는 기간까지는 EM 출력 신호(Vout)를 출력하지 않을 수 있다. 도 16은 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 16에 도시된 디스플레이 패널은 도 11에 도시된 디스플레이 패널과 적어도 일부 유사하거나, 디스 플레이 패널의 다른 실시예들을 더 포함할 수 있다. 이하, 도 16을 참조하여, 도 11에 도시된 디스플레이 패널로부터 달라지거나 미설명된 특징만을 기재한다. 도 16을 참조하면, EM 드라이버로부터 출력되는 복수의 EM 신호들(EM1~EMn)은 그룹(G1~Gm) 단위로 논리 소 자에 입력될 수 있다. 예를 들면, EM 드라이버는 지정된 개수(예: 3개 이상)의 EM 드라이버들이 하나의 그룹(G)으로 정의되고, 하나의 그룹(G)에 포함된 지정된 개수의 EM 드라이버들로부터 출력되는 EM 신호들(예: EMk-1, EMk, EMk+1))은 하나의 논리 소자에 입력될 수 있다. 도시된 예에 따르면, EM 드라이버는 3개의 EM 드라이버들(931_k-1, 931_k, 931_k+1)이 하나의 그룹(G)으 로 정의되고, 하나의 그룹(G)에 포함된 3개의 EM 드라이버들(931_k-1, 931_k, 931_k+1)로부터 출력되는 EM 신호 들(EMk-1, EMk, EMk+1)은 하나의 논리 소자에 입력될 수 있다. 예를 들면, 제 1 EM 드라이버 내지 제 3 EM 드라이버(931_1~931_3)는 제 1 그룹(G1)으로 정의되고, 제 1 그룹(G1)에 포함된 제 1 EM 드라이버 내지 제 3 EM 드라이버(931_1~931_3)로부터 출력되는 제 1 EM 신호 내지 제 3 EM 신호들(EM1~EM3)은 제 1 논리 소자 (935_1)로 입력될 수 있다. 예를 들면, 제 4 EM 드라이버 내지 제 6 EM 드라이버(931_4~931_6)는 제 2 그룹 (G2)으로 정의되고, 제 2 그룹(G2)에 포함된 제 4 EM 드라이버 내지 제 6 EM 드라이버(931_4~931_6)로부터 출력 되는 제 4 EM 신호 내지 제 6 EM 신호들(EM4~EM6)은 제 2 논리 소자로 입력될 수 있다. 다양한 실시예들에 따르면, 하나의 그룹(G)에 포함되는 EM 드라이버의 개수는 3개에 국한되지 않고 복수개 로 정의될 수 있다. 다양한 실시예들에 따르면, 복수의 EM 드라이버들(931_1~931n)은 m 개의 그룹(G1~Gm)으로 정의될 수 있다. 논리 소자(예: 논리 회로)는 복수의 EM 드라이버들(931_1~931)이 m 개의 그룹(G1~Gm)으로 정의되는 것에 따라 m 개의 논리 소자(935_1~935_m)를 포함할 수 있다. m 개의 논리 소자(935_1~935_m) 각각은 하나의 그룹 (G)에 포함된 복수의 EM 드라이버들(931_k-1, 931_k, 931_k+1)로부터 복수의 EM 신호들(EMk-1, EMk, EMk+1)을 입력 받고, 입력된 복수의 EM 신호들(EMk-1, EMk, EMk+1)의 전압 값에 따라 EM 변환 신호를 출력할 수 있다. 예 를 들면, 논리 소자는 복수의 EM 신호들(EMk-1, EMk, EMk+1)의 전압 값에 따라 EM 변환 신호를 출력하는 AND 게이트 소자(예: AND 게이트 회로)일 수 있다. 일 실시예에 따르면, AND 게이트 소자인 논리 소자들은 입력된 복수의 EM 신호들(EMk-1, EMk, EMk+1) 모두 의 전압이 하이 상태(H)이면 EM 변환 신호를 출력하고, 복수의 EM 신호들(EMk-1, EMk, EMk+1) 중에서 적어도 하 나의 전압 값이 로우 상태(L)이면 EM 변환 신호를 출력하지 않을 수 있다. 일 실시예에 따르면, 논리 소자들은 복수의 EM 신호들(EMk-1, EMk, EMk+1)의 전압 값에 따라 생성된 EM 변 환 신호들을 비교기로 공급할 수 있다. 비교기는 논리 소자로부터 EM 변환 신호를 입력받고, 가변 저항의 저항 값에 따라 입력된 EM 변 환 신호를 EM 출력 신호(Vout)로서 출력할 수 있다. 도 17은 다른 실시예에 따른 전자 장치가 개방 상태일 때 도 16에 도시된 EM 드라이버의 출력 신호 및 비교기의 출력 신호를 나타낸 예시이다. 도 16 및 도 17을 참조하면, 일 실시예에 따른 전자 장치가 개방 상태일 때 EM 드라이버는 순차적으 로 EM 신호들(EM1~EMn)을 출력할 수 있다. 예를 들면, EM 드라이버는 제 1 EM 신호 내지 제 n EM 신호 (EM1~EMn)를 순차적으로 출력할 수 있다. 제 1 EM 신호 내지 제 n EM 신호들(EM1~EMn) 각각은 3 수평 기간(3H) 동안 하이 상태(H)로 출력되고, 1 수평 기간(1H)씩 위상이 지연되도록 출력될 수 있다. 예를 들면, 제 1 EM 신 호 내지 제 3 EM 신호(EM1~EM3) 각각은 3 수평 기간(3H) 동안 출력되고, 제 2 EM 신호(EM2)는 제 1 EM 신호 (EM1)보다 1 수평 기간(1H) 위상이 지연되고, 제 3 EM 신호(EM3)는 제 2 EM 신호(EM2)보다 1 수평 기간(1H) 위 상이 지연될 수 있다. 일 실시예에 따르면, 논리 소자는 AND 게이트 소자일 수 있고, 하나의 그룹(Gk)으로부터 입력된 복수의 EM 신호들(EMk-1, EMk, EMk+1) 모두의 전압이 하이 상태(H)이면 EM 변환 신호를 출력할 수 있다. 예를 들면, 제 1 논리 소자(935_1)는 제 1 그룹(G1)에 포함된 제 1 EM 드라이버 내지 제 3 EM 드라이버(931_1~931_3)로부터 제 1 EM 신호 내지 제 3 EM 신호(EM1~EM3)를 입력받고, 제 1 EM 신호 내지 제 3 EM 신호(EM1~EM3)의 전압이 모두 하이 상태(H)인 T1 기간에 하이 상태(H)를 갖는 제 1 EM 변환 신호를 출력할 수 있다. 예를 들면, 제 2 논리 소 자(935_2)는 제 2 그룹(G2)에 포함된 제 4 EM 드라이버 내지 제 6 EM 드라이버(931_4~931_6)로부터 제 4 EM 신 호 내지 제 6 EM 신호(EM4~EM6)를 입력받고, 제 4 EM 신호 내지 제 6 EM 신호(EM4~EM6)의 전압이 모두 하이 상 태(H)인 T2 기간에 하이 상태(H)를 갖는 제 2 EM 변환 신호를 출력할 수 있다. 비교기는 논리 소자로부터 EM 변환 신호를 순차적으로 입력받고, 가변 저항(Ri1~Rim)의 저항 값에 따 라 논리 소자로부터 입력된 제 1 EM 변환 신호 내지 제 m EM 변환 신호를 EM 출력 신호(Vout)로서 출력할 수 있다. 예를 들면, 전자 장치가 개방 상태일 때, 디스플레이 패널의 전체적인 형태는 평평할 수 있 다. 디스플레이 패널의 전체적인 형태가 평평하면, 가변 저항(Ri1~Rim)을 형성하는 배선의 곡률이 기준 각 도보다 작거나 같고, 가변 저항(Ri1~Rim)의 저항 값은 기준 저항 값(Rref)보다 작거나 같을 수 있다. 비교기 는 가변 저항(Ri1~Rim)의 저항 값이 기준 저항 값(Rref)보다 작거나 같은 것에 따라 논리 소자로부터 입력된 제 1 EM 변환 신호 내지 제 m EM 변환 신호 모두를 EM 출력 신호(Vout)로서 출력할 수 있다. 예를 들면, T1 기간에 논리 소자로부터 출력되는 제 1 EM 변환 신호는 제 1 비교기(934_1)로 입력되고, 제 1 비교기 (934_1)는 가변 저항(Ri1~Rim)의 저항 값이 기준 저항 값(Rref)보다 작거나 같은 것에 따라 제 1 EM 변환 신호 를 제 1 EM 출력 신호(Vout1)로서 출력할 수 있다. 제 1 비교기(934_1)의 제 1 EM 출력 신호는 제 1 EM 신호 라인 내지 제 3 EM 신호 라인(EML1~EML3)을 통해 제 1 픽셀들 내지 제 3 픽셀들(Pixels_H1~Pixels_H3)에 공급 될 수 있다. 예를 들면, T2 기간에 논리 소자로부터 출력되는 제 2 EM 변환 신호는 제 2 비교기(934_2)로 입력되고, 제 2 비교기(934_2)는 제 2 가변 저항(Ri2)의 저항 값이 기준 저항 값(Rref)보다 작거나 같은 것에 따라 제 2 EM 변환 신호를 제 2 EM 출력 신호(Vout2)로서 출력할 수 있다. 제 2 EM 출력 신호(Vout)는 제 4 EM 신호 라인 내지 제 6 EM 신호 라인(EML4~EML6)을 통해 제 4 픽셀들 내지 제 6 픽셀들(Pixels_H4~Pixels_H6)에 공급될 수 있다. 도 18은 다른 실시예에 따른 전자 장치가 폐쇄 상태 또는 중간 상태일 때 도 16에 도시된 EM 드라이버의 출력 신호 및 비교기의 출력 신호를 나타낸 예시이다. 도 16 및 도 18을 참조하면, 일 실시예에 따른 전자 장치가 폐쇄 상태 또는 중간 상태일 때 EM 드라이버 는 순차적으로 EM 신호들(EM1~EMn)을 출력할 수 있다. 예를 들면, EM 드라이버는 제 1 EM 신호 내지 제 n EM 신호(EM1~EMn)를 순차적으로 출력할 수 있다. 제 1 EM 신호 내지 제 n EM 신호들(EM1~EMn) 각각은 3 수평 기간(3H) 동안 하이 상태(H)로 출력되고, 1 수평 기간(1H)씩 위상이 지연되도록 출력될 수 있다. 일 실시예에 따르면, 논리 소자는 AND 게이트 소자일 수 있고, 하나의 그룹(Gk)으로부터 입력된 복수의 EM 신호들(EMk-1, EMk, EMk+1) 모두의 전압이 하이 상태(H)이면 EM 변환 신호를 출력할 수 있다. 예를 들어, 논리 소자는 제 1 EM 신호 내지 제 3 EM 신호(EM1~EM3)의 전압이 모두 하이 상태인 T1 기간에 제 1 EM 변환 신 호를 출력할 수 있고, 제 1 EM 변환 신호는 비교기에 공급되어 제 1 EM 출력 신호(Vout1)로서 출력될 수 있다. 비교기는 논리 소자로부터 EM 변환 신호를 순차적으로 입력받고, 가변 저항(Ri1~Rim)의 저항 값에 따 라 논리 소자로부터 입력된 제 1 EM 변환 신호 내지 제 m EM 변환 신호를 EM 출력 신호(Vout)로서 출력할수 있다. 예를 들면, 전자 장치가 폐쇄 상태 또는 중간 상태일 때, 디스플레이 패널의 적어도 일부분 은 곡면 형태를 가질 수 있다. 예를 들어, 플렉서블 디스플레이 중에서 롤러(예: 도 6a의 롤러)와 접 촉하거나 롤러와 인접한 적어도 일부분은 곡면 형태를 가질 수 있다. 디스플레이 패널의 형태가 곡면 형태를 갖게 되면, 가변 저항(Ri1~Rim)을 형성하는 배선의 곡률이 기준 각도보다 크고, 가변 저항(Ri1~Rim)의 저항 값은 기준 저항 값(Rref)보다 클 수 있다. 비교기는 가변 저항(Ri1~Rim)의 저항 값이 기준 저항 값(Rref)보다 큰 것에 따라 제 1 EM 변환 신호 내지 제 m EM 변환 신호 중에서 일부만을 EM 출력 신호(Vout)로서 출력할 수 있다. 예를 들어, 제 k 그룹의 EM 드라 이버(931_k-1, 931_k, 931_k+1)들과 인접한 제 k 가변 저항(Rik)부터 제 m 그룹의 EM 드라이버들(931_n-2, 931_n-1, 931_n)과 인접한 제 m 가변 저항(Rim)까지의 가변 저항들(Rik~Rim) 각각의 저항 값은 기준 저항 값 (Rref)보다 클 수 있다. 상기 가변 저항(Rik~Rim)들의 저항 값들이 기준 저항 값(Rref)보다 큰 것은 상기 가변 저항(Rik~Rim)들이 위치한 디스플레이 패널의 일부분이 곡면 형태인 것을 의미할 수 있다. 비교기는, 상기 가변 저항(Rik~Rim)들의 저항 값들이 기준 저항 값(Rref)보다 크면, 제 1 EM 출력 신호 (Vout1)부터 제 k-1 EM 출력 신호(Voutk-1)까지 순차적으로 출력하되, 제 k EM 출력 신호(Voutk))부터 제 m EM 출력 신호(Voutm)는 출력하지 않을 수 있다. 도 19는 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 19에 도시된 디스플레이 패널은 도 16에 도시된 디스플레이 패널과 적어도 일부 유사하거나, 디스 플레이 패널의 다른 실시예들을 더 포함할 수 있다. 이하, 도 19를 참조하여, 도 16에 도시된 디스플레이 패널로부터 달라지거나 미설명된 특징만을 기재한다. 도 19를 참조하면, 논리 소자는 하나의 그룹(Gk)으로부터 입력된 복수의 EM 신호들(EMk-1, EMk, EMk+1)의 전압 값에 따라 EM 변환 신호를 출력하는 OR 게이트 소자(예: OR 게이트 회로)일 수 있다. 일 실시예에 따르면, OR 게이트 소자인 논리 소자는 하나의 그룹(Gk)으로부터 입력된 복수의 EM 신호들 (EMk-1, EMk, EMk+1) 중에서 적어도 하나의 전압 값이 하이 상태(H)이면, EM 변환 신호를 출력하고, 하나의 그 룹(Gk)으로부터 입력된 복수의 EM 신호들(EMk-1, EMk, EMk+1) 모두의 전압 값이 로우 상태(L)이면 EM 변환 신호 를 출력하지 않을 수 있다. 일 실시예에 따르면, 논리 소자들은 하나의 그룹(Gk)으로부터 입력된 복수의 EM 신호들(EMk-1, EMk, EMk+1)의 전압 값에 따라 생성된 EM 변환 신호를 비교기로 공급할 수 있다. 비교기는 논리 소자로부터 EM 변환 신호를 입력받고, 가변 저항(Ri1~Rim)의 저항 값에 따라 입력된 EM 변환 신호를 EM 출력 신호(Vout)로서 출력할 수 있다. 도 20은 다른 실시예에 따른 전자 장치가 폐쇄 상태 또는 중간 상태일 때 도 19에 도시된 EM 드라이버의 출력 신호 및 비교기의 출력 신호를 나타낸 예시이다. 도 19 및 도 20을 참조하면, 일 실시예에 따른 제 1 EM 신호 내지 제 n EM 신호들 각각은 1 수평 기간 동안 하 이 상태(H)로 출력되고, 1 수평 기간씩 위상이 지연되도록 출력될 수 있다. 일 실시예에 따르면, 논리 소자는 OR 게이트 소자일 수 있고, 하나의 그룹(Gk)으로부터 입력된 복수의 EM 신호들(EMk-1, EMk, EMk+1) 중에서 적어도 하나의 전압이 하이 상태(H)이면 EM 변환 신호를 출력할 수 있다. EM 변환 신호는 3 수평 기간(3H) 동안 하이 상태로 출력될 수 있다. 예를 들면, OR 게이트 소자인 논리 소자는 제 1 EM 신호 내지 제 3 EM 신호(EM1~EM3)의 전압이 순차적으로 하이 상태가 되는 T1 기간에 제 1 EM 변환 신호를 출력할 수 있다. 제 1 EM 변환 신호는 3 수평 기간(3H) 동안 하이 상태로 출력될 수 있다. 제 1 EM 변환 신호는 비교기에 공급되어 제 1 EM 출력 신호(Vout1)로서 출력 될 수 있다. 비교기는 논리 소자로부터 EM 변환 신호를 입력받고, 가변 저항(Ri1~Rim)의 저항 값에 따라 제 1 EM 변환 신호 내지 제 m EM 변환 신호 중에서 적어도 일부를 EM 출력 신호(Vout)로서 출력할 수 있다. 예를 들면, 전자 장치가 폐쇄 상태 또는 중간 상태일 때, 디스플레이 패널의 적어도 일부분은 곡면 형태를 가질 수 있다. 예를 들어, 플렉서블 디스플레이 중에서 롤러(예: 도 6a의 롤러)와 접촉하거나 롤러와 인접한 적어도 일부분은 곡면 형태를 가질 수 있다. 디스플레이 패널의 형태가 곡면 형태를 갖게 되면, 가 변 저항을 형성하는 배선의 곡률이 기준 각도보다 크고, 가변 저항(Ri1~Rim)의 저항 값은 기준 저항 값(Rref)보다 클 수 있다. 비교기는 가변 저항(Ri1~Rim)의 저항 값이 기준 저항 값(Rref)보다 큰 것에 따라 제 1 EM 변환 신호 내지 제 m EM 변환 신호 중에서 일부만을 EM 출력 신호(Vout)로서 출력할 수 있다. 예를 들어, 제 k 그룹의 EM 드라 이버(931_k-1, 931_k, 931_k+1)들과 인접한 제 k 가변 저항(Rik)부터 제 m 그룹의 EM 드라이버들(931_n-2, 931_n-1, 931_n)과 인접한 제 m 가변 저항(Rim)까지의 가변 저항들(Rik~Rim) 각각의 저항 값은 기준 저항 값 (Rref)보다 클 수 있다. 상기 가변 저항(Rik~Rim)들의 저항 값들이 기준 저항 값(Rref)보다 큰 것은 상기 가변 저항(Rik~Rim)들이 위치한 디스플레이 패널의 일부분이 곡면 형태인 것을 의미할 수 있다. 비교기는, 상기 가변 저항(Rik~Rim)들의 저항 값들이 기준 저항 값(Rref)보다 크면, 제 1 EM 출력 신호 (Vout1)부터 제 k-1 EM 출력 신호(Voutk-1)까지 순차적으로 출력하되, 제 k EM 출력 신호(Voutk))부터 제 m EM 출력 신호(Voutm)는 출력하지 않을 수 있다. 도 21은 전자 장치가 폐쇄 상태 또는 중간 상태일 때 플렉서블 디스플레이의 굴곡 가능부의 적어도 일부분이 젤 리롤 형태로 감기는 일 실시예에 따른 전자 장치에서 가변 저항의 값을 설명한 예시이다. 도 21에 도시된 플렉서블 디스플레이는 도 7a 내지 도 7b에 도시된 플렉서블 디스플레이와 적어도 일 부 유사하거나, 플렉서블 디스플레이의 다른 실시예들을 더 포함할 수 있다. 이하, 도 21를 참조하여, 도 7a 내지 도 7b 에 도시된 플렉서블 디스플레이로부터 달라지거나 미설명된 특징만을 기재한다. 도 21을 참조하면, 플렉서블 디스플레이는 슬라이드 플레이트(예: 도 4의 슬라이드 플레이트)가 움직 이는 것에 연동하여 적어도 일부분이 감길 수 있다. 예를 들면, 플렉서블 디스플레이는, 화살표 2101과 같 이, 슬라이드 플레이트의 움직임에 연동하여 좌우 뱡향(예: 도 2a 내지 도 4의 제 1 방향(x 방향) 및 제 2 방향(-x 방향))으로 움직이고, 적어도 일부분의 형태가 변경될 수 있다. 예를 들면, 플렉서블 디스플레이 는 평평한 제 1 부분 및 젤리롤 형태로 감겨 있는 제 2 부분을 포함할 수 있다. 일 실시예에 따르면, 가변 저항(Ri1~Ri5)(예: 도 11의 가변 저항(Ri1~Rin))은 플렉서블 디스플레이가 움직 이는 방향을 따라 간격을 두고 형성될 수 있다. 도시된 예에서, 평평한 플렉서블 디스플레이의 제 1 부분 에는 가변 저항 Ri1, Ri2가 위치하고, 가변 저항 Ri1, Ri2의 저항 값들은 플렉서블 디스플레이의 형태가 평평하므로 기준 저항 값(예: 도 13의 기준 저항 값(Rref))보다 작을 수 있다. 도시된 예에서, 젤리롤 형태로 감겨 있는 플렉서블 디스플레이의 제 2 부분에는 가변 저항 Ri3, Ri4, Ri5가 위치하고, 가변 저항 Ri3, Ri4, Ri5의 저항 값들은 플렉서블 디스플레이의 형태가 곡면 형태이므로 기준 저항 값(Rref)보다 클 수 있 다. 일 실시예에 따르면, 저항 값이 기준 저항 값(Rref)보다 작은 가변 저항 Ri1, Ri2이 위치하는 플렉서블 디스플 레이의 제 1 부분에서는 EM 출력 신호(Vout)가 픽셀들에게 공급되고, 플렉서블 디스플레이의 제 1 부 분은 지정된 영상을 표시할 수 있다. 일 실시예에 따르면, 저항 값이 기준 저항 값(Rref)보다 큰 가변 저항 Ri3, Ri4, Ri5이 위치하는 플렉서블 디스 플레이의 제 2 부분에서는 EM 출력 신호(Vout)가 픽셀들에게 공급되지 않고, 플렉서블 디스플레이의 제 2 부분은 비활성화(또는 오프)될 수 있다. 도 22는 전자 장치가 폐쇄 상태 또는 중간 상태일 때 플렉서블 디스플레이의 굴곡 가능부의 적어도 일부분이 평 면부와 나란하게 배치되는 일 실시예에 따른 전자 장치에서 가변 저항의 값을 설명한 예시이다. 도 22에 도시된 플렉서블 디스플레이는 도 5a 내지 도 6b에 도시된 플렉서블 디스플레이와 적어도 일 부 유사하거나, 플렉서블 디스플레이의 다른 실시예들을 더 포함할 수 있다. 이하, 도 22를 참조하여, 도 5a 내지 도 6b 에 도시된 플렉서블 디스플레이로부터 달라지거나 미설명된 특징만을 기재한다. 도 22을 참조하면, 플렉서블 디스플레이(예: 도 4의 플렉서블 디스플레이)는 슬라이드 플레이트(예: 도 4 의 슬라이드 플레이트)가 움직이는 것에 연동하여 적어도 일부분이 감길 수 있다. 예를 들면, 플렉서블 디 스플레이는, 화살표 2201과 같이, 슬라이드 플레이트의 움직임에 연동하여 좌우 뱡향(예: 도 2a 내지 도 4의 제 1 방향(x 방향) 및 제 2 방향(-x 방향))으로 움직이고, 적어도 일부분의 형태가 변경될 수 있다. 예 를 들면, 플렉서블 디스플레이는 평평한 제 1 부분 및 제 1 부분으로부터 이어지고 밴딩된 곡면을 포함하 는 제 2 부분, 제 2 부분으로부터 이어지고 상기 제 1 부분과 나란하게 형성되는 제 3 부분을 포함할 수 있다. 일 실시예에 따르면, 가변 저항(Ri1~Ri5)(예: 도 11의 가변 저항(Ri1~Rin))은 플렉서블 디스플레이가 움직 이는 방향을 따라 간격을 두고 형성될 수 있다. 도시된 예에서, 평평한 플렉서블 디스플레이의 제 1 부분에는 가변 저항 Ri1, Ri2가 위치하고, 가변 저항 Ri1, Ri2의 저항 값들은 플렉서블 디스플레이의 형태가 평평하므로 기준 저항 값(예: 도 13의 기준 저항 값(Rref))보다 작을 수 있다. 도시된 예에서, 밴딩된 곡면을 포함하는 플렉서블 디스플레이의 제 2 부분에는 가변 저항 Ri3, Ri4가 위치하고, 가변 저항 Ri3, Ri4의 저 항 값들은 플렉서블 디스플레이의 형태가 곡면 형태이므로 기준 저항 값(Rref)보다 클 수 있다. 도시된 예 에서, 제 1 부분과 나란한 플렉서블 디스플레이의 제 3 부분에는 가변 저항 Ri5가 위치하고, 가변 저항 Ri5의 저항 값은 플렉서블 디스플레이의 형태가 평평하므로 기준 저항 값(Rref)보다 작을 수 있다. 일 실시예에 따르면, 저항 값이 기준 저항 값(Rref)보다 작은 가변 저항 Ri1, Ri2이 위치하는 플렉서블 디스플 레이의 제 1 부분에서는 EM 출력 신호(Vout)가 픽셀들에게 공급되고, 플렉서블 디스플레이의 제 1 부 분은 지정된 영상을 표시할 수 있다. 일 실시예에 따르면, 저항 값이 기준 저항 값(Rref)보다 큰 가변 저항 Ri3, Ri4이 위치하는 플렉서블 디스플레 이의 제 2 부분에서는 EM 출력 신호(Vout)가 픽셀들에게 공급되지 않고, 플렉서블 디스플레이의 제 2 부분은 비활성화(또는 오프)될 수 있다. 일 실시예에 따르면, 저항 값이 기준 저항 값(Rref)보다 작은 가변 저항 Ri5 이 위치하는 플렉서블 디스플레이 의 제 3 부분에서는 EM 출력 신호(Vout)가 픽셀들에게 공급되고, 플렉서블 디스플레이의 제 3 부분 은 지정된 영상을 표시할 수 있다. 플렉서블 디스플레이의 제 3 부분은 실질적으로 하우징 의 내부에 삽입된 부분으로서 전자 장치의 외부에서 보이지 않을 수 있다. 따라서, 도 5a 내지 도 6b 에 도시된 전자 장치에 있어서, 플렉서블 디스플레이의 제 3 부분이 비활성화(또는 오프)되기 위한 추가적인 부품 및 설계가 필요할 수 있다. 이하, 도 5a 내지 도 6b 에 도시된 전자 장치에 있어서, 플렉서블 디스플레이의 제 3 부분을 비활성화(또는 오프)되기 위한 방법을 도 23을 결부하여 설명한 다. 도 23은 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 23에 도시된 디스플레이 패널은 도 16에 도시된 디스플레이 패널과 적어도 일부 유사하거나, 디스 플레이 패널의 다른 실시예들을 더 포함할 수 있다. 이하, 도 23를 참조하여, 도 16에 도시된 디스플레이 패널로부터 달라지거나 미설명된 특징만을 기재한다. 도 23을 참조하면, 다른 실시예에 따른 전자 장치의 디스플레이 패널은, EM 출력 신호를 출력하는 비 교기의 출력 단자와 EM 신호 라인(EML) 사이에 스위칭 소자(TR8, TR9)가 더 형성될 수 있다. 일 실시예에 따르면, 스위칭 소자(TR8, TR9)는 박막 트랜지스터로 형성된 TR8, TR9를 포함할 수 있다. TR8의 게이트는 인접한 비교기의 출력 단자로부터 EM 출력 신호를 입력받을 수 있다. 예를 들면, k번째 비 교기와 인접하게 위치한 TR8의 게이트는 k번째 비교기의 출력 단자로부터 제 k EM 출력 신호(Voutk) 를 입력받을 수 있다. TR8은, T8의 드레인과 게이트가 전기적으로 연결됨으로써 다이오드로 동작할 수 있다. 예 를 들면, TR8의 게이트에 입력된 제 k EM 출력 신호(Voutk)는 TR8의 소스를 통해 TR9의 드레인으로 공급될 수 있다. T9의 게이트는 이전 비교기의 출력 단자로부터 EM 출력 신호(Voutk-1)를 입력받을 수 있다. 예를 들면, TR9의 게이트는 k-1번째 비교기의 출력 단자로부터 제 k-1 EM 출력 신호(Voutk-1)를 입력받을 수 있다. T9 의 드레인은 TR8의 소스를 통해 인접한 비교기의 출력 단자로부터 출력된 제 k EM 출력 신호(Voutk)를 입 력받고, k-1번째 비교기의 출력 단자로부터 입력된 제 k-1 EM 출력 신호(Voutk-1)에 응답하여 제 k EM 출 력 신호(Voutk)를 EM 신호 라인(EML)에 공급할 수 있다. 도시된 예에 따른 전자 장치는, k-1 번째 EM 출력 신호(Voutk-1)가 출력되는 경우에만 k 번째 EM 출력 신 호(Voutk)가 EM 신호 라인(EML)에 공급될 수 있다. 이에 따라, 도 22에서 설명한 플렉서블 디스플레이의 제 2 부분이 비활성화(또는 오프)되는 경우, 플렉서블 디스플레이의 제 3 부분도 비활성화될 수 있 다. 도 24는 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 24에 도시된 디스플레이 패널은 도 11에 도시된 디스플레이 패널과 적어도 일부 유사하거나, 디스 플레이 패널의 다른 실시예들을 더 포함할 수 있다. 이하, 도 24를 참조하여, 도 11에 도시된 디스플레이 패널로부터 달라지거나 미설명된 특징만을 기재한다.도 24을 참조하면, 비교기는 EM 드라이버의 출력단이 아닌 EM 드라이버의 이전단에 배치될 수 있다. 예를 들면, 도 24에 도시된 다른 실시예에 따른 디스플레이 패널은, 도 11에 도시된 실시예와 달리, 비교기가 EM 드라이버의 이전단에 배치될 수 있다. 일 실시예에 따르면, 비교기는 클럭 신호(CLK) 및 가변 저항의 저항 값을 입력받고, 가변 저항 의 저항 값에 따라 입력된 클럭 신호(CLK)를 EM 드라이버에 공급할 수 있다. 예를 들면, 비교기는 가 변 저항(Ri1~Rin)의 저항 값이 기준 저항 값(Rref)(예: 도 12의 기준 저항 값(Rref))보다 작거나 같은 경우 클 럭 신호(CLK)를 EM 드라이버에 공급할 수 있다. 비교기는 가변 저항(Ri1~Rin)의 저항 값이 기준 저항 값(Rref)보다 큰 경우 클럭 신호(CLK)를 EM 드라이버에 공급하지 않을 수 있다. 일 실시예에 따르면, EM 드라이버는, 비교기로부터 클럭 신호(CLK)가 입력되는 경우 EM 신호(EM)를 EM 신호 라인들(EML1~EMLn)을 통해 출력할 수 있다. 일 실시예에 따르면, EM 드라이버는, 비교기로부 터 클럭 신호(CLK)가 입력되지 않는 경우 EM 신호(EM)를 EM 신호 라인들(EML1~EMLn)을 통해 출력하지 않을 수 있다. 예를 들면, EM 드라이버는, 비교기로부터 제 1 클럭 신호(CLK1)가 입력되는 것에 기반하여 제 1 EM 신호(EM1)를 출력할 수 있다. 예를 들면, EM 드라이버는, 비교기로부터 제 2 클럭 신호(CLK2)가 입력되지 않는 것에 기반하여 제 2 EM 신호(EM2)부터 제 n EM 신호(EMn)(예: 마지막 EM 신호)를 출력하지 않을 수 있다. 도 25는 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 25에 도시된 디스플레이 패널은 도 25에 도시된 디스플레이 패널과 적어도 일부 유사하거나, 디스 플레이 패널의 다른 실시예들을 더 포함할 수 있다. 이하, 도 25를 참조하여, 도 24에 도시된 디스플레이 패널로부터 달라지거나 미설명된 특징만을 기재한다. 도 25을 참조하면, 비교기를 통해 출력되는 클럭 신호(CLK)는 EM 드라이버에게 적어도 부분적으로 공 급될 수 있다. 예를 들면, 도 25에 도시된 다른 실시예에 따른 디스플레이 패널은, 도 24에 도시된 실시예 와 달리, 비교기를 통해 출력되는 클럭 신호(CLK)가, 지정된 개수의 EM 드라이버들을 포함하는 그룹(G) 당 하나씩 공급될 수 있다. 도시된 예에 따르면, EM 드라이버는 3개의 EM 드라이버들(931_k-1, 931_k, 931_k+1)이 하나의 그룹(G)으 로 정의되고, 하나의 그룹(G)에 포함된 3개의 EM 드라이버들(931_k-1, 931_k, 931_k+1)로부터 출력되는 EM 신호 들(EMk-1, EMk, EMk+1)은 EM 신호 라인들(EML1~EMLn)을 통해 출력될 수 있다. 예를 들면, 제 1 EM 드라이버 내 지 제 3 EM 드라이버(931_1~931_3)는 제 1 그룹(G1)으로 정의되고, 제 1 그룹(G1)에 포함된 제 1 EM 드라이버 내지 제 3 EM 드라이버(931_1~931_3)로부터 출력되는 제 1 EM 신호 내지 제 3 EM 신호들(EM1~EM3) 각각은 제 1 EM 신호 라인 내지 제 3 EM 신호 라인(EML1~EML3) 각각을 통해 출력될 수 있다. 일 실시예에 따르면, 비교기는 클럭 신호(CLK) 및 가변 저항의 저항 값을 입력받고, 가변 저항 의 저항 값에 따라 입력된 클럭 신호(CLK)를 EM 드라이버에 공급하되, 클럭 신호(CLK)를 지정된 개수의 EM 드라이버들을 포함하는 그룹(G) 당 하나씩 공급될 수 있다. 예를 들면, 비교기를 통해 출력되는 클럭 신호 (CLK)는 하나의 그룹(G)에 포함된 지정된 개수, 예컨대 3개의 EM 드라이버들(931_k-1, 931_k, 931_k+1) 중에서 첫 번째 EM 드라이버들(예: 931_k-1)에만 공급될 수 있다. 일 실시예에 따르면, 하나의 그룹(G)에 포함된 지정 된 개수, 예컨대 3개의 EM 드라이버들(931_k-1, 931_k, 931_k+1) 중에서 비교기를 통해 출력되는 클럭 신 호(CLK)를 입력받지 않은 나머지 EM 드라이버들(예: 931_k, 931_k+1)은, 비교기를 경유하지 않은 클럭 신 호(CLK)를 입력받을 수 있다. 일 실시예에 따르면, 상기 나머지 EM 드라이버들(예: 931_k, 931_k+1)은 클럭 신 호(CLK)를 입력받더라도, 첫 번째 EM 드라이버들(예: 931_k-1)가 비교기로부터 클럭 신호(CLK)를 입력받지 아니한 경우 EM 신호를 출력하지 않을 수 있다.도면 도면1 도면2a 도면2b 도면3a 도면3b 도면4 도면5a 도면5b 도면6a 도면6b 도면7a 도면7b 도면8a 도면8b 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22 도면23 도면24 도면25"}
{"patent_id": "10-2020-0146756", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a 및 도 2b는 본 발명의 다양한 실시예들에 따른 폐쇄 상태 및 개방 상태를 나타낸 전자 장치의 전면 사시 도이다. 도 3a 및 도 3b는 본 발명의 다양한 실시예들에 따른 폐쇄 상태 및 개방 상태를 나타낸 전자 장치의 후면 사시 도이다. 도 4는 본 발명의 다양한 실시예들에 따른 전자 장치의 분리 사시도이다. 도 5a는 롤러가 전자 장치의 제 2 방향에 위치한 본 발명의 일 실시예에 따른 전자 장치의 폐쇄 상태를 나타낸 단면도이다. 도 5b는 롤러가 전자 장치의 제 2 방향에 위치한 본 발명의 일 실시예에 따른 전자 장치의 개방 상태를 나타낸 단면도이다. 도 6a는 롤러가 전자 장치의 제 1 방향에 위치한 본 발명의 일 실시예에 따른 전자 장치의 폐쇄 상태를 나타낸 단면도이다. 도 6b는 롤러가 전자 장치의 제 1 방향에 위치한 본 발명의 일 실시예에 따른 전자 장치의 개방 상태를 나타낸 단면도이다. 도 7a는 롤러가 전자 장치의 제 2 방향에 위치한 본 발명의 다른 실시예에 따른 전자 장치의 폐쇄 상태를 나타 낸 단면도이다. 도 7b는 롤러가 전자 장치의 제 2 방향에 위치한 본 발명의 다른 실시예에 따른 전자 장치의 개방 상태를 나타 낸 단면도이다. 도 8a는 롤러가 전자 장치의 제 1 방향 및 제 2 방향 각각에 위치한 본 발명의 다른 실시예에 따른 전자 장치의 폐쇄 상태를 나타낸 단면도이다. 도 8b는 롤러가 전자 장치의 제 1 방향 및 제 2 방향 각각에 위치한 본 발명의 다른 실시예에 따른 전자 장치의 개방 상태를 나타낸 단면도이다. 도 9는 다양한 실시예들에 따른 전자 장치의 블록도이다.도 10은 복수의 픽셀들 중에서 하나의 픽셀을 구동하기 위한 픽셀 구동 회로를 설명한 예시이다. 도 11은 본 발명의 일 실시예에 따른 디스플레이 패널의 구성도이다. 도 12는 가변 저항의 저항 값과 기준 저항의 차이에 따른 비교기의 출력 전압을 설명한 예시이다. 도 13은 가변 저항의 곡률에 따른 비교기의 출력 전압을 설명한 예시이다. 도 14는 일 실시예에 따른 전자 장치가 개방 상태일 때 도 11에 도시된 EM 드라이버의 출력 신호 및 비교기의 출력 신호를 나타낸 예시이다. 도 15는 일 실시예에 따른 전자 장치가 폐쇄 상태 또는 중간 상태일 때 도 11에 도시된 EM 드라이버의 출력 신 호 및 비교기의 출력 신호를 나타낸 예시이다. 도 16은 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 17은 다른 실시예에 따른 전자 장치가 개방 상태일 때 도 16에 도시된 EM 드라이버의 출력 신호 및 비교기의 출력 신호를 나타낸 예시이다. 도 18은 다른 실시예에 따른 전자 장치가 폐쇄 상태 또는 중간 상태일 때 도 16에 도시된 EM 드라이버의 출력 신호 및 비교기의 출력 신호를 나타낸 예시이다. 도 19는 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 20은 다른 실시예에 따른 전자 장치가 폐쇄 상태 또는 중간 상태일 때 도 19에 도시된 EM 드라이버의 출력 신호 및 비교기의 출력 신호를 나타낸 예시이다. 도 21은 전자 장치가 폐쇄 상태 또는 중간 상태일 때 플렉서블 디스플레이의 굴곡 가능부의 적어도 일부분이 젤 리롤 형태로 감기는 일 실시예에 따른 전자 장치에서 가변 저항의 값을 설명한 예시이다. 도 22는 전자 장치가 폐쇄 상태 또는 중간 상태일 때 플렉서블 디스플레이의 굴곡 가능부의 적어도 일부분이 평 면부와 나란하게 배치되는 일 실시예에 따른 전자 장치에서 가변 저항의 값을 설명한 예시이다. 도 23은 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 24는 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다. 도 25는 본 발명의 다른 실시예에 따른 디스플레이 패널의 구성도이다."}
