{"patent_id": "10-2020-0172052", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0082292", "출원번호": "10-2020-0172052", "발명의 명칭": "K-SPACE 도메인에 인공신경망을 적용한 자기 공명 영상 처리 장치 및 그 방법", "출원인": "주식회사 에어스 메디컬", "발명자": "이진구"}}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자기 공명 영상 처리 장치에 의한 자기 공명 영상 처리 방법에 있어서,서브 샘플링된 자기 공명 신호를 기초로 산출되는 제1 k-space 데이터를 획득하는 단계;상기 제1 k-space 데이터로부터 제1 인공 신경망 모델을 이용하여 제2 k-space 데이터를 획득하는 단계; 및상기 제2 k-space 데이터로부터 역 퓨리에 연산을 이용하여 제1 자기 공명 영상을 획득하는 단계를 포함하는,자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 자기 공명 영상 데이터로부터 제2 인공 신경망 모델을 이용하여 제2 자기 공명 영상을 획득하는 단계를 포함하는, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 k-space 데이터를 상기 제1 인공 신경망 모델에 입력하는 경우, 획득되는 상기 제1 자기 공명 영상은멀티 도메인 아티팩트(multi domain artifact)를 포함하고, 상기 멀티 도메인 아티팩트는 k-space 데이터에 인공 신경망 모델이 적용되는 경우에 발생하는 것인, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 멀티 도메인 아티팩트는 엘리어싱 아티팩트(aliasing artifact), 깁스 링잉 아티팩트(gibbs-ringingartfact), 화이트 닷 아티팩트(white-dot artifact), 스무딩 아티팩트(smoothing artifact), 텍스쳐 아티팩트(texture artifact) 및 할루시네이션 아티팩트(hallucination artifact) 중 적어도 어느 하나를 포함하는, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 제1 자기 공명 영상이 멀티 도메인 아티팩트를 복수개로 포함하는 경우 각각의 아티팩트는 위상 인코딩 방향으로 나열되는, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제1 인공 신경망 모델에 상기 제1 k-space 데이터를 전처리하여 입력하고, 상기 제1 인공 신경망 모델에서출력된 상기 제2 k-space 데이터를 후처리하는 경우,상기 후처리된 제2 k-space 데이터로부터 획득되는 제1 자기 공명 영상은 멀티 도메인 아티팩트를 포함하지 않는, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제1 k-space 데이터를 전처리하는 것은, 상기 제1 k-space 데이터에 적용되는 선형 함수 전처리 기법을 이공개특허 10-2022-0082292-3-용하여 수행되는 것인, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제1 자기 공명 영상을 후처리하는 것은, 상기 선형 함수의 역변환 함수를 이용하여 수행되는 것인, 자기공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 선형 함수가 포함하는 계수는 상기 제1 k-space 데이터, 상기 제2 k-space 데이터 및 상기 제1 자기 공명영상 데이터 중 적어도 어느 하나에 기초하여 산출되는 것인, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "자기 공명 영상 처리 장치에 의한 자기 공명 영상 처리 방법에 있어서,서브 샘플링된 자기 공명 신호를 기초로 산출되는 제1 k-space 데이터를 획득하는 단계;상기 제1 k-space 데이터로부터 역 퓨리에 연산을 이용하여 제1 자기 공명 영상을 획득하는 단계; 및상기 제1 자기 공명 영상 데이터로부터 제2 인공 신경망 모델을 이용하여 제2 자기 공명 영상을 획득하는 단계를 포함하고, 상기 제1 자기 공명 영상 데이터를 상기 제2 인공 신경망 모델에 입력하는 경우, 획득되는 상기 제2 자기 공명영상은 멀티 도메인 아티팩트를 포함하고, 상기 멀티 도메인 아티팩트는 자기 공명 영상에 인공 신경망 모델이적용되는 경우에 발생하는 것인, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 멀티 도메인 아티팩트는 엘리어싱 아티팩트(aliasing artifact), 깁스 링잉 아티팩트(gibbs-ringingartfact), 화이트 닷 아티팩트(white-dot artifact), 스무딩 아티팩트(smoothing artifact), 텍스쳐 아티팩트(texture artifact) 및 할루시네이션 아티팩트(hallucination artifact) 중 적어도 어느 하나를 포함하는, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 제2 자기 공명 영상이 멀티 도메인 아티팩트를 복수개로 포함하는 경우 각각의 아티팩트는 위상 인코딩 방향으로 나열되는, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 제2 인공 신경망 모델에 상기 제1 자기 공명 영상 데이터를 전처리하여 입력하고, 상기 제2 인공 신경망모델에서 출력된 상기 제2 자기 공명 영상을 후처리하는 경우,상기 후처리된 제2 자기 공명 영상은 멀티 도메인 아티팩트를 포함하지 않는, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제1 자기 공명 영상 데이터를 전처리하는 것은, 상기 제1 자기 공명 영상 데이터에 적용되는 선형 함수 전처리 기법을 이용하여 수행되는 것인, 자기 공명 영상 처리 방법.공개특허 10-2022-0082292-4-청구항 15 제14항에 있어서,상기 제2 자기 공명 영상을 후처리하는 것은, 상기 선형 함수의 역변환 함수를 이용하여 수행되는 것인, 자기공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 선형 함수가 포함하는 계수는 상기 제1 k-space 데이터, 상기 제2 k-space 데이터 및 상기 제1 자기 공명영상 데이터 중 적어도 어느 하나에 기초하여 산출되는 것인, 자기 공명 영상 처리 방법."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "자기 공명 영상 처리 방법을 실행하기 위한 자기 공명 영상 처리 장치에 있어서,자기 공명 영상 처리 프로그램이 저장된 메모리; 및상기 프로그램을 실행하는 프로세서를 포함하고,상기 프로세서는 상기 프로그램의 실행에 따라, 서브 샘플링된 자기 공명 신호를 기초로 산출되는 제1 k-space데이터를 획득하고, 상기 제1 k-space 데이터로부터 제1 인공 신경망 모델을 이용하여 제2 k-space 데이터를 획득하고, 상기 제2 k-space 데이터로부터 역 퓨리에 연산을 이용하여 제1 자기 공명 영상을 획득하는, 자기 공명영상 처리 장치."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "자기 공명 영상 처리 방법을 실행하기 위한 자기 공명 영상 처리 장치에 있어서,자기 공명 영상 처리 프로그램이 저장된 메모리; 및상기 프로그램을 실행하는 프로세서를 포함하고,상기 프로세서는 상기 프로그램의 실행에 따라, 서브 샘플링된 자기 공명 신호를 기초로 산출되는 제1 k-space데이터를 획득하고, 상기 제1 k-space 데이터로부터 역 퓨리에 연산을 이용하여 제1 자기 공명 영상을획득하고, 상기 제1 자기 공명 영상 데이터로부터 제2 인공 신경망 모델을 이용하여 제2 자기 공명 영상을 획득하며,상기 제1 자기 공명 영상 데이터를 상기 제2 인공 신경망 모델에 입력하는 경우, 획득되는 상기 제2 자기 공명영상은 멀티 도메인 아티팩트를 포함하고, 상기 멀티 도메인 아티팩트는 자기 공명 영상에 인공 신경망 모델이적용되는 경우에 발생하는 것인, 자기 공명 영상 처리 장치."}
{"patent_id": "10-2020-0172052", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항 내지 제16항 중 어느 한 항에 따른 방법을 실행하는 프로그램이 저장된 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2020-0172052", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른, 자기 공명 영상 처리 장치에 의한 자기 공명 영상 처리 방법에 있어서, 서브 샘플 링된 자기 공명 신호를 기초로 산출되는 제1 k-space 데이터를 획득하는 단계; 상기 제1 k-space 데이터로부터 제1 인공 신경망 모델을 이용하여 제2 k-space 데이터를 획득하는 단계; 및 상기 제2 k-space 데이터로부터 역 퓨리에 연산을 이용하여 제1 자기 공명 영상을 획득하는 단계를 포함하는, 자기 공명 영상 처리 방법을 제공하고 자 한다."}
{"patent_id": "10-2020-0172052", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자기 공명 영상 처리 장치 및 그 방법에 관한 것으로서 인공 신경망을 이용하여 자기 공명 신호로부 터 자기 공명 영상을 획득하는 것을 가속화하는 자기 공명 영상 처리 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2020-0172052", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 의료용 영상 장치는 환자의 신체 정보를 획득하여 영상을 제공하는 장치이다. 의료용 영상 장치는 X 선 촬영 장치, 초음파 진단 장치, 컴퓨터 단층 촬영 장치, 자기 공명 영상(Magnetic Resonance Imaging, MRI) 촬영 장치 등이 있다. 자기 공명 영상은 인체에 해가 없는 자장과 비전리 방사선을 이용하여 체내의 수소 원자핵에 핵자기 공명 현상 을 일으켜 원자핵의 밀도 및 물리/화학적 특성을 영상화한 것이다. 자기 공명 영상 촬영 장치는 영상 촬영 조건 이 상대적으로 자유롭고, 연부 조직에서의 다양한 진단 정보를 포함하고 우수한 대조도를 가지는 영상을 제공해 주기 때문에 의료용 영상을 이용한 진단 분야에서 중요한 위치를 차지하고 있다. 한편, 자기 공명 영상 촬영 장치에 의한 촬영은 촬영 부위와 MR 영상의 종류 등에 따라 짧게는 20여분에서 길게 는 1시간 이상이 소요될 수 있다. 즉, 자기 공명 영상 촬영 장치의 촬영 시간은 다른 의료용 영상 촬영 장치에 비해 상대적으로 길다는 단점이 있다. 이러한 단점은 환자에게 촬영 부담을 줄 수 있으며, 특히 폐쇄공포증이 있는 환자에게는 시행 자체를 곤란하게 한다. 따라서, 촬영 시간을 단축하려는 기술들이 최근까지 개발되고 있 으며, 더불어 영상의 질적인 면에서도 개선이 요구되고 있는 실정이다."}
{"patent_id": "10-2020-0172052", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에 따른 자기 공명 영상 처리 장치 및 그 방법은 자기 공명 영상 촬영 시간을 단축시키는 것으로 인해 발생하는 자기 공명 영상의 품질 저하를 극복하여 향상된 품질의 자기 공명 영상을 제공하고자 한다."}
{"patent_id": "10-2020-0172052", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른, 자기 공명 영상 처리 장치에 의한 자기 공명 영상 처리 방법에 있어서, 서브 샘플 링된 자기 공명 신호를 기초로 산출되는 제1 k-space 데이터를 획득하는 단계; 상기 제1 k-space 데이터로부터 제1 인공 신경망 모델을 이용하여 제2 k-space 데이터를 획득하는 단계; 및 상기 제2 k-space 데이터로부터 역 퓨리에 연산을 이용하여 제1 자기 공명 영상을 획득하는 단계를 포함하는, 자기 공명 영상 처리 방법을 제공하 고자 한다. 본 실시예에 있어서, 상기 제1 자기 공명 영상 데이터로부터 제2 인공 신경망 모델을 이용하여 제2 자기 공명 영상을 획득하는 단계를 포함하는, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 제1 k-space 데이터를 상기 제1 인공 신경망 모델에 입력하는 경우, 획득되는 상기 제1 자기 공명 영상은 멀티 도메인 아티팩트(multi domain artifact)를 포함하고, 상기 멀티 도메인 아티팩트는 k-space 데이터에 인공 신경망 모델이 적용되는 경우에 발생하는 것인, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 멀티 도메인 아티팩트는 엘리어싱 아티팩트(aliasing artifact), 깁스 링잉 아티팩트 (gibbs-ringing artfact), 화이트 닷 아티팩트(white-dot artifact), 스무딩 아티팩트(smoothing artifact), 텍스쳐 아티팩트(texture artifact) 및 할루시네이션 아티팩트(hallucination artifact) 중 적어도 어느 하나 를 포함하는, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 제1 자기 공명 영상이 멀티 도메인 아티팩트를 복수개로 포함하는 경우 각각의 아티 팩트는 위상 인코딩 방향으로 나열되는, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 제1 인공 신경망 모델에 상기 제1 k-space 데이터를 전처리하여 입력하고, 상기 제1 인공 신경망 모델에서 출력된 상기 제2 k-space 데이터를 후처리하는 경우, 상기 후처리된 제2 k-space 데이터 로부터 획득되는 제1 자기 공명 영상은 멀티 도메인 아티팩트를 포함하지 않는, 자기 공명 영상 처리 방법을 제 공할 수 있다. 본 실시예에 있어서, 상기 제1 k-space 데이터를 전처리하는 것은, 상기 제1 k-space 데이터에 적용되는 선형 함수 전처리 기법을 이용하여 수행되는 것인, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 제1 자기 공명 영상을 후처리하는 것은, 상기 선형 함수의 역변환 함수를 이용하여 수행되는 것인, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 선형 함수가 포함하는 계수는 상기 제1 k-space 데이터, 상기 제2 k-space 데이터 및 상기 제1 자기 공명 영상 데이터 중 적어도 어느 하나에 기초하여 산출되는 것인, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치에 의한 자기 공명 영상 처리 방법에 있어서, 서브 샘플 링된 자기 공명 신호를 기초로 산출되는 제1 k-space 데이터를 획득하는 단계; 상기 제1 k-space 데이터로부터역 퓨리에 연산을 이용하여 제1 자기 공명 영상을 획득하는 단계; 및 상기 제1 자기 공명 영상 데이터로부터 제 2 인공 신경망 모델을 이용하여 제2 자기 공명 영상을 획득하는 단계를 포함하고, 상기 제1 자기 공명 영상 데 이터를 상기 제2 인공 신경망 모델에 입력하는 경우, 획득되는 상기 제2 자기 공명 영상은 멀티 도메인 아티팩 트를 포함하고, 상기 멀티 도메인 아티팩트는 자기 공명 영상에 인공 신경망 모델이 적용되는 경우에 발생하는 것인, 자기 공명 영상 처리 방법을 제공하고자 한다. 본 실시예에 있어서, 상기 멀티 도메인 아티팩트는 엘리어싱 아티팩트(aliasing artifact), 깁스 링잉 아티팩트 (gibbs-ringing artfact), 화이트 닷 아티팩트(white-dot artifact), 스무딩 아티팩트(smoothing artifact), 텍스쳐 아티팩트(texture artifact) 및 할루시네이션 아티팩트(hallucination artifact) 중 적어도 어느 하나 를 포함하는, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 제2 자기 공명 영상이 멀티 도메인 아티팩트를 복수개로 포함하는 경우 각각의 아티 팩트는 위상 인코딩 방향으로 나열되는, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 제2 인공 신경망 모델에 상기 제1 자기 공명 영상 데이터를 전처리하여 입력하고, 상 기 제2 인공 신경망 모델에서 출력된 상기 제2 자기 공명 영상을 후처리하는 경우, 상기 후처리된 제2 자기 공 명 영상은 멀티 도메인 아티팩트를 포함하지 않는, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 제1 자기 공명 영상 데이터를 전처리하는 것은, 상기 제1 자기 공명 영상 데이터에 적용되는 선형 함수 전처리 기법을 이용하여 수행되는 것인, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 제2 자기 공명 영상을 후처리하는 것은, 상기 선형 함수의 역변환 함수를 이용하여 수행되는 것인, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 실시예에 있어서, 상기 선형 함수가 포함하는 계수는 상기 제1 k-space 데이터, 상기 제2 k-space 데이터 및 상기 제1 자기 공명 영상 데이터 중 적어도 어느 하나에 기초하여 산출되는 것인, 자기 공명 영상 처리 방법을 제공할 수 있다. 본 발명의 일 실시예에 따른 자기 공명 영상 처리 방법을 실행하기 위한 자기 공명 영상 처리 장치에 있어서, 자기 공명 영상 처리 프로그램이 저장된 메모리; 및 상기 프로그램을 실행하는 프로세서를 포함하고, 상기 프로 세서는 상기 프로그램의 실행에 따라, 서브 샘플링된 자기 공명 신호를 기초로 산출되는 제1 k-space 데이터를 획득하고, 상기 제1 k-space 데이터로부터 제1 인공 신경망 모델을 이용하여 제2 k-space 데이터를 획득하고, 상기 제2 k-space 데이터로부터 역 퓨리에 연산을 이용하여 제1 자기 공명 영상을 획득하는, 자기 공명 영상 처 리 장치를 제공하고자 한다. 본 발명의 일 실시예에 따른 자기 공명 영상 처리 방법을 실행하기 위한 자기 공명 영상 처리 장치에 있어서, 자기 공명 영상 처리 프로그램이 저장된 메모리; 및 상기 프로그램을 실행하는 프로세서를 포함하고, 상기 프로 세서는 상기 프로그램의 실행에 따라, 서브 샘플링된 자기 공명 신호를 기초로 산출되는 제1 k-space 데이터를 획득하고, 상기 제1 k-space 데이터로부터 역 퓨리에 연산을 이용하여 제1 자기 공명 영상을 획득하고, 상기 제 1 자기 공명 영상 데이터로부터 제2 인공 신경망 모델을 이용하여 제2 자기 공명 영상을 획득하며, 상기 제1 자 기 공명 영상 데이터를 상기 제2 인공 신경망 모델에 입력하는 경우, 획득되는 상기 제2 자기 공명 영상은 멀티 도메인 아티팩트를 포함하고, 상기 멀티 도메인 아티팩트는 자기 공명 영상에 인공 신경망 모델이 적용되는 경 우에 발생하는 것인, 자기 공명 영상 처리 장치를 제공하고자 한다."}
{"patent_id": "10-2020-0172052", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 자기 공명 영상 처리 장치 및 그 방법은 자기 공명 영상 촬영 시간을 단축시켜도 양질의 복원 영상을 획득할 수 있는 자기 공명 영상 처리 장치 및 그 방법을 제공하여 환자의 병변 부위 진단을 용이하게 할 수 있다. 또한, 본 발명의 실시예들에 따른 자기 공명 영상 처리 장치 및 그 방법은 k-space 데이터로부터 자기 공명 영 상을 획득하고, 제1 인공 신경망 모델 및 제2 인공 신경망 모델을 활용하여 복원된 정확도 높은 출력 자기 공명 영상을 제공하는 것으로서 환자의 병변 부위 진단을 용이하게 하는 효과가 있다."}
{"patent_id": "10-2020-0172052", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여 기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위한 설명과 관계없 는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다."}
{"patent_id": "10-2020-0172052", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 명세서가 실시예들의 모든 요소들을 설명하는 것은 아니며, 본 발명이 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한다. 명세서에서 사용되는 ‘부’(part, portion)라는 용어는 소프트 웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 ‘부’가 하나의 요소(unit, element)로 구현 되거나, 하나의 ‘부’가 복수의 요소들을 포함하는 것도 가능하다. 본 명세서에서 '영상'은 이산적인 이미지 요소들(예를 들어, 2차원 이미지에 있어서의 픽셀들 및 3차원 이미지 에 있어서의 복셀들)로 구성된 다차원(multi-dimensional) 데이터를 의미할 수 있다. 예를 들어, 영상은 자기 공명 영상 촬영 장치, 컴퓨터 단층 촬영(CT) 장치, 초음파 촬영 장치, 또는 엑스레이 촬영 장치 등의 의료 영상 장치에 의해 획득된 의료 영상을 포함할 수 있다. 본 명세서에서 '대상체(object)'는 촬영의 대상이 되는 것으로서, 사람, 동물, 또는 그 일부를 포함할 수 있다. 예를 들어, 대상체는 신체의 일부(장기 또는 기관 등; organ) 또는 팬텀(phantom) 등을 포함할 수 있다. 팬텀은 생물의 밀도와 실효 원자 번호에 아주 근사한 부피를 갖는 물질을 의미하는 것으로, 신체와 유사한 성질을 갖는 구형(sphere)의 팬텀을 포함할 수 있다. 자기 공명 영상(Magnetic Resonance Image, MRI) 시스템은 특정 세기의 자기장에서 발생하는 RF(Radio Frequency) 신호에 대한 자기 공명(Magnetic Resonance, MR) 신호의 세기를 명암 대비로 표현하여 대상체의 단 층 부위에 대한 이미지를 획득하는 시스템이다. MRI 시스템은 주자석이 정자장(static magnetic field)을 형성하도록 하고, 정자장 속에 위치한 대상체의 특정 원자핵의 자기 쌍극자 모멘트 방향을 정자장 방향으로 정렬시킨다. 경사자장 코일은 정자장에 경사 신호를 인가 하여, 경사자장을 형성시켜, 대상체의 부위 별로 공명 주파수를 다르게 유도할 수 있다. RF 코일은 영상 획득을 원하는 부위의 공명 주파수에 맞추어 자기 공명 신호를 조사할 수 있다. 또한, RF 코일은 경사자장이 형성됨에 따라, 대상체의 여러 부위로부터 방사되는 서로 다른 공명 주파수의 자기 공명 신호들을 수신할 수 있다. MRI 시스템은 이러한 단계를 통해 수신된 자기 공명 신호들에 영상 복원 기법을 적용하여 영상을 획득한다. 또한, MRI 시스템은 다채널 RF 코일에 의해 수신되는 복수의 자기 공명 신호에 대하여 직렬적 또는 병렬적 신호 처리 를 수행하여 복수의 자기 공명 신호를 영상 데이터로 재구성할 수도 있다. 이하에서는 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치에 대하여 설명하기로 한다. 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치는 전술한 MRI 시스템에 직/간접적으로 적용되어 자기 공 명 신호로부터 자기 공명 영상을 획득하는 것을 가속화하는 자기 공명 영상 처리 장치에 관한 것이다. 자기 공명 영상 처리 장치는, 자체적으로 자기 공명 신호를 감지하여 자기 공명 영상을 획득할 수 있는 MRI 시 스템뿐만 아니라, 외부에서 획득된 영상을 처리하는 영상 처리 장치, 자기 공명 영상에 대한 프로세싱 기능을 구비한 스마트폰, 태블릿 PC, PC, 스마트 TV, 마이크로 서버, 기타 가전 기기 및 기타 모바일 또는 비 모바일 컴퓨팅 장치일 수 있으나 이에 제한되지 않는다. 또한, 자기 공명 영상 처리 장치는 통신 기능 및 데이터 프로 세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 디바이스일 수 있다. 도 1은 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치의 구성을 보여주는 구성도이다. 도 1을 참조하면, 자기 공명 영상 처리 장치는 통신 모듈, 메모리, 프로세서, 데이터베이스(DB: 140)를 포함할 수 있다. 통신 모듈은 통신망과 연동하여 자기 공명 영상 처리 장치에 통신 인터페이스를 제공하는데, MRI 촬영 장 치, 사용자 단말 및 관리 서버와 데이터를 송수신하는 역할을 수행할 수 있다. 여기서, 통신 모듈은 다른 네트 워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치일 수 있다. 메모리는 자기 공명 영상 처리 프로그램이 기록된 저장 매체일 수 있다. 또한, 메모리는 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행할 수 있다. 여기서, 메모리는 휘발성 저 장 매체(volatile storage media) 또는 비휘발성 저장 매체(non-volatile storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 프로세서는 자기 공명 영상 처리 장치에서 자기 공명 영상 처리 프로그램이 수행하는 전체 과정을 제어할 수 있다. 프로세서가 수행하는 과정의 각 단계에 대해서는 도 2 내지 도 17을 참조하여 후술하기로 한다. 여기서, 프로세서는 프로세서(processor)와 같이 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 여기서, '프로세서(processor)'는, 예를 들어 프로그램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로서, 마이크로프로세서(microprocessor), 중앙처리장치 (central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망 라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 데이터베이스는 자기 공명 영상 처리 장치가 프로그램을 실행하기 위해 필요한 각종 데이터가 저장된 것일 수 있다. 예를 들어, 데이터베이스에는 후술할 인공 신경망의 학습 데이터, 자기 공명 신호 데이터, k-space 데 이터 및 자기 공명 영상 데이터 등이 저장된 것일 수 있다. 한편, 본 발명에서 ‘단말’은 휴대성 및 이동성이 보장된 무선 통신 장치일 수 있으며, 예를 들어 스마트폰, 태블릿 PC 또는 노트북 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치일 수 있다. 또한 ‘ 단말’은 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드, 및 반지 등의 웨어러블 기기일 수도 있다. 또한, ‘단말’은 네트워크를 통해 다른 단말 또는 서버 등에 접속할 수 있는 PC 등의 유선 통신 장치인 것도 가능하다. 또한, 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷 (WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례 에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 블루투스 통신, 적외선 통신, 초음파 통신, 가시 광 통신(VLC: Visible Light Communication), 라이파이(LiFi) 등이 포함되나 이에 한정되지는 않는다. 이하에서는, 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치에 의해 수행되는 자기 공명 영상 처리 방법 에 대하여 상세히 설명하기로 한다. 도 2는 본 발명의 일 실시예에 따른 자기 공명 영상 처리 방법의 순서를 보여주는 순서도이다. 도 3은 본 발명 의 일 실시예에 따른 자기 공명 영상 처리 방법을 보여주는 개략도이다. 도 2 및 도 3을 참조하면 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치에 의해 수행되는 자기 공명 영 상 처리 방법에 있어서, 먼저 서브 샘플링된 자기 공명 신호를 획득하는 단계(미도시)가 수행될 수 있다. 도 4는 본 발명의 일 실시예에 따른 서브 샘플링과 풀 샘플링의 차이점을 설명하기 위한 개략도이다. 도 4를 참조하면, 서브 샘플링된 자기 공명 신호는 나이키스트 샘플링 레이트보다 낮은 샘플링 레이트로 샘플링된 자기 공명 신호일 수 있다. 또한, 서브 샘플링된 자기 공명 영상은 나이키스트 샘플링 레이트보 다 낮은 샘플링 레이트로 자기 공명 신호를 샘플링하여 획득된 영상이다. 한편, 풀 샘플링된 자기 공명 영상은 나이키스트 샘플링 레이트 이상의 샘플링 레이트로 k-space 데이터를 샘플링하여 획득된 영상일 수 있다. 예를 들어, 풀 샘플링된 자기 공명 신호의 라인(line) 수가 n개이고 서브 샘플링된 자기 공명 신호의 라인 (line) 수가 n/2개일 수 있다. 여기서 샘플링 라인의 감소된 정도가 1/2 배수이면 자기 공명 영상 촬영의 가속 화 지수가 2라고 할 수 있다. 샘플링 라인의 감소된 정도가 1/3 배수, 1/4 배수이면 가속화 지수는 각각 3, 4라 고 할 수 있다. 그리고, 서브 샘플링 방법은 균일 서브 샘플링과 비균일 서브 샘플링으로 나뉠 수 있다. 균일 서브 샘플링은 샘 플링되는 라인의 간격을 일정하게 유지하여 샘플링을 수행하는 것일 수 있다. 반면, 비균일 서브 샘플링은 일반 적으로 샘플링 데이터의 중앙 부분으로 갈수록 샘플링되는 라인의 간격을 좁혀 샘플링을 많이 하고, 중앙 부분 에서 멀어질수록 샘플링되는 라인의 간격을 넓히면서 샘플링을 적게하는 것을 의미할 수 있다. 한편, 자기 공명 영상 처리 장치는 MRI 시스템에 포함되어, RF 코일로부터 수신한 자기 공명 신호에 기초하여, 서브 샘플링된 자기 공명 신호에 대응되는 입력 데이터를 획득할 수 있다. 또한, 자기 공명 영상 처리 장 치는 외부의 자기 공명 영상 촬영 장치, 외부 서버 및 데이터 베이스 중 적어도 어느 하나로부터 서브 샘플링된 자기 공명 신호에 대응되는 입력 데이터를 획득할 수도 있다. 다시 도 2 및 도 3을 참조하면, 서브 샘플링된 자기 공명 신호로부터 병렬 영상 기법을 이용하여 제1 k- space 데이터를 획득하는 단계(S210)가 수행될 수 있다. 여기서, 병렬 영상 기법은 서브 샘플링된 자기 공명 신호 및/또는 k-space 데이터로부터 풀 샘플링된 k- space 데이터 및/또는 자기 공명 영상과 같이 정확도 높은 k-space 데이터 및/또는 자기 공명 영상을 획득하기 위한 일종의 영상 복원 기법이다. 병렬 영상 기법에 따른 영상 복원의 수행에 있어, 공지 기술인 SPACE RIP(Sensitivity Profiles From an Array of Coils for Encoding and Reconstruction in Parallel), SMASH(Simultaneous acquisition of spatial harmonics), PILS(Partially Parallel Imaging With Localized Sensitivitie), GRAPPA(Generalized Autocalibrating Partially Parallel Acquisitions) SPIRiT(iterative Self-consistent Parallel Imaging Reconstruction)등의 병렬 영상 기법에 적용될 수 있는 것이라면 제한 없이 적용이 가능하다. 단계(S210) 다음으로, 제1 k-space 데이터로부터 제1 인공 신경망 모델을 이용하여 제2 k-space 데 이터를 획득하는 단계(S220)가 수행될 수 있다. 도 5는 본 발명의 일 실시예에 따른 제1 인공 신경망 모델을 이용하여 제1 k-space 데이터로부터 제2 k-space 데이터를 획득하는 것을 보여주는 개략도이다.도 5를 참조하면, 제1 인공 신경망 모델은 통계적 기계 학습 결과를 이용하여, 적어도 하나의 서브 샘플링 된 제1 k-space 데이터와 적어도 하나의 풀 샘플링된 제1 k-space 데이터의 상관 관계를 학습하는 알고리 즘의 집합일 수 있다. 제1 인공 신경망 모델은 적어도 하나의 뉴럴 네트워크를 포함할 수 있다. 뉴럴 네트 워크는 DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), MLP(Multilayer Perceptron), CNN(Convolutional Neural Network)과 같은 방식의 네트워크 모델들을 포함할 수 있으나, 이에 한정되지 않는다. 예를 들어, 제1 인공 신경망 모델은 뉴럴 네트워크를 이용하여 적어도 하나의 서브 샘플링된 제1 k-space 데이터 및 적어도 하나의 풀 샘플링된 제1 k-space 데이터의 상관 관계를 위상 인코딩 방향(Ky)에 따라 스 택되는 적어도 하나의 샘플링 라인의 픽셀들을 단위로 학습하여 구축된 모델일 수 있다. 도 4를 참조하면, 위상 인코딩 방향(Ky)이란 자기 공명 신호를 샘플링하는 과정에서 샘플링된 라인이 스택 (stack)되는 방향과 평행하게 연장된 방향일 수 있다. 그리고 리드아웃 방향(Kx)이란 샘플링된 라인이 연장된 방향일 수 있다. 한편 Kz방향은 코일의 축방향이거나 후술할 위상 인코딩 방향(Ky) 및 리드아웃 방향(Kx)과 각 각 직교하는 제1방향(Kz)으로 명명될 수 있다. 한편, 서브 샘플링된 자기 공명 신호가 복수개인 경우 제1 k-space 데이터 및 제2 k-space 데이터 는 각각 복수개로 획득될 수 있다. 즉, 자기 공명 신호를 수신하는 RF 코일이 복수개인 경우 각각의 채널별로 수신되는 복수개의 자기 공명 신호에 대응하여 생성된 복수개의 복원 영상이 제1 자기 공명 영상 이 되는 것이다. 또한, 제1 인공 신경망 모델은 서브 샘플링된 제1 k-space 데이터 및 풀 샘플링된 제1 k-space 데이 터 이외에도 다양한 추가 데이터를 이용하여 구축될 수 있다. 예를 들어, 추가 데이터로서 제1 k-space 데이터 에 대응되는, 실수 데이터, 허수 데이터, 크기 데이터, 위상 데이터 중 적어도 어느 하나가 이용될 수 있다. 한편, 제1 k-space 데이터 및/또는 제2 k-space 데이터를 역퓨리에 연산하여 획득되는 제1 자기 공명 영상은 멀티 도메인 아티팩트(multi domain artifact)를 포함할 수 있다. 도 6은 자기 공명 영상 복원에 따른 타겟 영상 및 복수개의 멀티 도메인 아티팩트 영상을 보여주는 도면이다. 도 7은 자기 공명 영상 복원 복원에 따른 복수개의 멀티 도메인 아티팩트 영상을 보여주는 도면이다. 도 6 및 도 7을 참조하면, 멀티 도메인 아티팩트는 자기 공명 영상이 인공신경망을 이용하여 획득되는 것으로 인하여 발생하는 것일 수 있다. 구체적으로, 멀티 도메인 아티팩트는 자기 공명 영상의 기초가 되는 k-space 데 이터가 k-space 영역에서 인공 신경망 모델을 통해 복원되고, 복원된 데이터가 이미지 영역으로 변환 이동되면 서 발생하는 것일 수 있다. 한편, 이미지 도메인에서 상술한 위상 인코딩 방향(Ky) 및 리드아웃 방향(Kx)은 각 각 도 6의 (a)에 표시한 y방향 및 x방향과 대응하는 방향일 수 있다. 멀티 도메인 아티팩트는 엘리어싱 아티팩트(aliasing artifact), 깁스 링잉 아티팩트(gibbs-ringing artfact) 및 화이트 닷 아티팩트(white-dot artifact), 스무딩 아티팩트(smoothing artifact), 텍스쳐 아티팩트(texture artifact) 및 할루시네이션 아티팩트(hallucination artifact) 중 적어도 어느 하나를 포함할 수 있다. 그리고, 자기 공명 영상이 멀티 도메인 아티팩트를 복수로 포함하는 경우 각각의 아티팩트는 위상 인코딩 방향 으로 나열될 수 있다. 여기서, 엘리어싱 아티팩트는 타겟 영상(도 6의 (a) 참조)과 비교했을 때 여러 개의 타겟 영상이 겹쳐 보이는 듯한 아티팩트(도 6 (b) 참조)로서 인공 신경망을 이용한 이미지 복원에서 데이터 손실이 심한 경우 및/또는 FoV(Field of View)가 이미지화 되는 대상체보다 작은 경우 발생할 수 있다. 여기서, 타겟 영상은 풀 샘플링된 자기 공명 신호를 기초로 복원한 자기 공명 영상이다. 깁스 링잉 아티팩트는 타겟 영상과 비교했을 때 타겟 영상이 경계면에서 요동치는 것처럼 보이는 아티팩트(도 6 의 (c) 참조)로서 인공 신경망을 이용하여 복원된 k-space 데이터가 k-space 영역에서 이미지 영역으로 데이터 변환 및 이동하는 것에 의해 발생할 수 있다. 화이트 닷 아티팩트는 타겟 영상과 비교했을 때 타겟 영상의 일부분에 하얀 점이 생기는 아티팩트(도 6의 (d) 참조)이며, 인공 신경망을 이용한 이미지 복원에서 불필요한 바이어스(bias) 성분이 생성되는 경우에 발생할 수 있다. 일반적으로 인공 신경망은 예측 성능을 높이기 위해 인공 신경망을 형성하는 뉴런에 바이어스가 생기거나 활성화 함수(activation function)가 포함되는데, 이러한 인공 신경망의 구조 때문에 출력되는 자기 공명 영상 자체에 바이어스가 형성될 수 있는 것이다.스무딩 아티팩트는 이미지의 텍스쳐와 디테일이 사라져 보이는 아티팩트(도 7의 (a) 참조)이다. 자기 공명 영상 복원에 인공신경망을 이용하는 경우 및/또는 비선형 데이터 최적화를 사용하는 경우에 입력 데이터의 정보량이 충분치 않거나, 인공신경망의 경우 학습데이터의 학습이 미완료되거나 실패한 경우에 발생할 수 있다. 텍스쳐 아티팩트는 이미지의 텍스쳐가 변질되어 보이는 아티팩트(도 7의 (b) 참조)이다. 예를 들어 도 7의 (b) 에서 실제로 존재하지 않는 지그재그 모양의 텍스쳐가 형성된 것을 볼 수 있다. 텍스쳐 아티팩트가 생기는 이유 는 첫째로 신호 대 잡음비(SNR: Signal to Noise Ratio)가 낮은 데이터에서 인공신경망을 이용해 이미지를 복원 하는 경우, 엘리어싱 때문에 수평적으로 이미지가 반복되는 것처럼 보이는데, 이 수평적 패턴이 복원된 이미지 에서 없어지지 않고 남아있는 경우가 있다. 둘째로 CNN의 경우 각 컨볼루셔널 레이어(Convolutional Layer)에서 보조맵을 학습하는데, 이들의 학습이 잘못되면 이미지를 복원할 때 잘못된 텍스쳐를 사용하게 되어 텍스쳐 아티 팩트가 생기게 된다. 할루시네이션 아티팩트는 실제로 존재하지 않는 구조가 존재하는 것처럼 보이는 아티팩트(도 7의 (c) 참조)이다. 도 7의 (c)를 보면 확대된 부분 중간에 동그랗게 생긴 구조는 뇌 이미지 오른쪽 아래의 혈관 형태와 비슷하게 생겼는데, 실제로는 존재하지 않는 구조이며 인공신경망으로 인해 생성된 형상이다. 할루시네이션 아 티팩트가 생기는 이유는 여러가지가 있을 수 있는데, 인공신경망 모델이 서브샘플링된 k-space 데이터 입력에 대해 실제로는 존재하지 않는 대상체에서 얻은 데이터라고 판단하여 이미지를 복원하는 경우 발생할 수 있다. 이러한 아티팩트들을 제거하기 위한 것으로서, 제1 인공 신경망 모델에 제1 k-space 데이터를 전처리 하여 입력하고, 제1 인공 신경망 모델에서 출력된 제2 k-space 데이터를 후처리하여 제1 인공 신경망 모델에 입력하여 출력된 제1 자기 공명 영상은 멀티 도메인 아티팩트를 포함하지 않을 수 있다. 도 8은 본 발명의 일 실시예에 따른 제1 k-space 데이터 전처리 및 제2 k-space 데이터 후처리를 적 용한 자기 공명 영상 처리 방법의 순서를 보여주는 순서도이다. 도 8을 참조하면, 제1 k-space 데이터를 전처리하는 것은 제1 k-space 데이터에 적용되는 선형 함수 전처리 기법을 이용하여 수행(S221)되는 것일 수 있다. 선형 함수 전처리 기법이란 아래의 수학식을 기초로 수행되는 데이터 처리 기법이다. y = a*x+b y : 전처리된 k-space 데이터 x : 전처리되기 전 k-space 데이터 a, b : 계수 여기서, 선형 함수가 포함하는 계수 a, b는 제1 k-space 데이터, 제2 k-space 데이터 및 제1 자기 공명 영상 데이터 중 적어도 어느 하나에 기초하여 인공 신경망을 통해 산출되는 것일 수 있다. 그리고, 전처리된 제1 k-space 데이터를 제1 인공 신경망 모델을 통해 복원을 수행하여 제2 k-space 데이터를 획득할 수 있다(S222). 그리고, 제2 k-space 데이터를 후처리하는 것은 상기 선형 함수의 역변환 함수를 이용하여 수행(S223)되는 것일 수 있다. 단계(S223) 다음으로, 후처리된 제2 k-space 데이터로부터 역 퓨리에(IFFT) 연산을 이용하여 제1 자기 공 명 영상을 획득하는 단계(S230)가 수행될 수 있다. 예를 들어, 그라파는 완전한 k-스페이스 형태의 영상 데이터를 역 퓨리에 변환하여 복원 영상인 제1 자기 공명 영상을 생성할 수 있다. 단계(S230) 다음으로, 제1 자기 공명 영상으로부터 제2 인공 신경망 모델을 이용하여 제2 자기 공명 영상을 획득하는 단계(S240)가 수행될 수 있다. 도 9는 본 발명의 일 실시예에 따른 제2 인공 신경망 모델을 이용하여 제1 자기 공명 영상으로부터 제2 자기 공명 영상을 획득하는 것을 보여주는 개략도이다. 도 9를 참조하면, 제2 인공 신경망 모델은 통계적 기계 학습 결과를 이용하여, 적어도 하나의 서브 샘플링 된 자기 공명 영상과 적어도 하나의 풀 샘플링된 자기 공명 영상 간의 상관 관계를 학습하는 알고리즘의 집합일 수 있다. 제2 인공 신경망 모델은 적어도 하나의 뉴럴 네트워크를 포함할 수 있다. 뉴럴 네트워크는DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), MLP(Multilayer Perceptron), CNN(Convolutional Neural Network)과 같은 방식의 네트워크 모델들을 포함할 수 있으나, 이에 한정되지 않는다. 예를 들어, 제2 인공 신경망 모델은 뉴럴 네트워크를 이용하여 적어도 하나의 서브 샘플링된 자기 공명 영 상 및 적어도 하나의 풀 샘플링된 자기 공명 영상 간의 상관 관계를 위상 인코딩 방향(Ky)에 따라 스택되는 적 어도 하나의 샘플링 라인의 픽셀들을 단위로 학습하여 구축된 모델일 수 있다. 또한, 제2 인공 신경망 모델은 서브 샘플링된 자기 공명 영상 및 풀 샘플링된 자기 공명 영상 이외에도 다 양한 추가 데이터를 이용하여 구축될 수 있다. 예를 들어, 추가 데이터로서 제1 자기 공명 영상에 대응되 는 k-space 데이터, 실수 영상 데이터, 허수 영상 데이터, 크기 영상 데이터, 위상 영상 데이터 중 적어도 어느 하나가 이용될 수 있다. 한편, 제1 자기 공명 영상 데이터를 제2 인공 신경망 모델에 입력하는 경우, 획득되는 제2 자기 공명 영상은 멀티 도메인 아티팩트를 포함하고, 멀티 도메인 아티팩트는 자기 공명 영상에 인공 신경망 모델이 적용되는 경우에 발생하는 것일 수 있다. 여기서 멀티 도메인 아티팩트는 엘리어싱 아티팩트(aliasing artifact), 깁스 링잉 아티팩트(gibbs-ringing artfact), 화이트 닷 아티팩트(white-dot artifact), 스무딩 아티팩트(smoothing artifact), 텍스쳐 아티팩트 (texture artifact) 및 할루시네이션 아티팩트(hallucination artifact) 중 적어도 어느 하나를 포함할 수 있 다. 제2 자기 공명 영상이 멀티 도메인 아티팩트를 복수개로 포함하는 경우 각각의 아티팩트는 위상 인코 딩 방향으로 나열될 수 있다. 다만, 제2 인공 신경망 모델에 제1 자기 공명 영상 데이터를 전처리하여 입력하고, 제2 인공 신경망 모델에서 출력된 제2 자기 공명 영상을 후처리하는 경우, 후처리된 제2 자기 공명 영상은 멀티 도메인 아티팩트를 포함하지 않을 수 있다. 구체적으로, 제1 자기 공명 영상 데이터를 전처리하는 것은, 제1 자기 공명 영상 데이터에 적용되는 선형 함수 전처리 기법을 이용하여 수행되는 것일 수 있다. 제2 자기 공명 영상을 후처리하는 것은, 선형 함수의 역변환 함수를 이용하여 수행되는 것일 수 있다. 여기서 선형 함수 전처리 기법은 상술한 k-space 도메 인에 적용되는 것과 동일 또는 유사한 형태의 수학식을 이용한 방법일 수 있다. 그리고, 선형 함수가 포함하는 계수는 상기 제1 k-space 데이터, 제2 k-space 데이터 및 상기 제1 자 기 공명 영상 데이터 중 적어도 어느 하나에 기초하여 산출되는 것일 수 있으며, 상술한 k-space 도메인에 적용되는 선형 함수 기법의 계수와는 서로 다를 수 있다. 그리고, 제2 자기 공명 영상을 획득하는 단계(S240)에서, 제1 자기 공명 영상에 보조맵이 적용되어 제1 자기 공명 영상 세트로 형성되는 과정이 수행될 수 있다. 도 10은 본 발명의 일 실시예에 따른 복수개의 보조맵 중 노이즈 패턴맵을 설명하기 위한 도면이다. 도 11은 본 발명의 일 실시예에 따른 복수개의 보조맵 중 코일 감도맵을 설명하기 위한 도면이다. 도 12는 본 발명의 일 실 시예에 따른 복수개의 보조맵 중 레지듀얼맵을 설명하기 위한 도면이다. 도 13은 본 발명의 일 실시예에 따른 복수개의 보조맵 중 어답티브 컴바인맵을 설명하기 위한 도면이다. 도 10 내지 도 13을 참조하면, 보조맵은 노이즈 패턴맵(NP, Noise Pattern Map), 코일 감도맵(Coil Sensitivity Map), 레지듀얼맵(Residual Map) 및 어답티브 컴바인 맵(adaptive combine map) 중 적어도 어느 하나를 포함할 수 있다. 도 10을 참조하면, 노이즈 패턴맵(NP)은 복원된 영상에서 대상체의 각 부분에 따라 노이즈의 발생 정도를 기초 로 가중치를 적용하여 구분 표시한 영상일 수 있다. 일 예로 노이즈 패턴맵(NP)은 서브 샘플링된 자기 공명 영 상에 일반적인 인공 신경망 모델을 적용하여 복원된 영상을 풀 샘플링된 자기 공명 영상과 비교하여 감지된 노 이즈에 따라 생성된 패턴맵일 수 있다. 구체적으로 도 10의 (a)를 참조하면, 서브 샘플링된 자기 공명 영상을 인공 신경망 모델의 입력으로 하여 출력된 복원 영상과 풀 샘플링된 자기 공명 영상을 대비한 대비 영상을 보면, 영상의 중앙부분에 세 워진 타원 형태로 노이즈가 다량 발생한 부분(Poor-conditiond; PC)을 확인할 수 있다. 또한, 영상의 외측으로 가면 비교적 노이즈가 적게 발생한 부분(Good-conditioned; GC)을 확인할 수 있다. 이러한 대상체의 부분별로노이즈의 생성 격차를 기초로 생성된 것이 노이즈 패턴맵(NP)이다. 도 10의 (b)를 참조하면, 서브 샘플링된 자기 공명 영상과 노이즈 패턴맵(NP)을 인공 신경망 모델의 입력 으로 하여 출력된 복원 영상과 풀 샘플링된 자기 공명 영상을 대비한 대비 영상을 보면, 영상의 전체 에 걸쳐 노이즈가 줄어든 것을 확인할 수 있다. 도 11을 참조하면, 코일 감도맵은 복수개의 코일을 사용해서 촬영하는 경우 각각 코일의 특성(형태, 크기, 위치, 대상체와의 거리 등)에 따라 다르게 획득되는 자기 공명 영상 데이터와 이로부터 출력되는 자기 공명 영 상을 보완하기 위한 것이다. 예를 들어 16개의 코일로 대상체를 촬영하는 경우, 16개의 코일 각각에 대응하는 코일 감도맵을 해당하는 코일 로부터 얻어진 자기 공명 영상 데이터에 적용하여 최종 자기 공명 영상을 출력하면 품질이 향상된 이미지를 획 득할 수 있다. 도 12를 참조하면, 레지듀얼맵은 타겟 영상과 복원 영상의 차이값 데이터를 포함하는 영상일 수 있다. 예를 들 어 제2 인공 신경망 모델에 입력되는 서브 샘플링된 자기 공명 데이터를 기초로 생성된 제1 자기 공명 영 상의 복원 영상이 있고, 풀 샘플링된 자기 공명 데이터를 기초로 생성된 타겟 영상이 있는 경우 레지듀얼 맵은 타겟 영상에서 복원 영상을 제거한 데이터를 기초로 생성될 수 있다. 도 13을 참조하면, 어답티브 컴바인 맵은 멀티채널 이미지 도메인 데이터를 컴바인하여 이미지로 만들 때 필요 한 각 픽셀에 할당되는 계수 정보를 가진 맵이라고 할 수 있다. 예를 들어, i 번째 코일의 어답티브 컴바인 맵 을 Ci*(x) 라고 하고, 이미지를 mi(x)라고 할 때, 컴바인 이미지 m(x)는 수식으로 m(x) = ∑i Ci*(x)*mi(x)로 표 현할 수 있다. 도 14는 본 발명의 일 실시예에 따른 보조맵 생성 인공 신경망 모듈을 포함하는 제2 인공 신경망 모델의 구조를 보여주는 개략도이다. 도 14를 참조하면, 보조맵은 보조맵 생성 인공 신경망 모듈(Sub Map Net)을 이용하여 생성되는 것일 수 있다. 보조맵 생성 인공 신경망 모듈은 제1 자기 공명 영상, 제2 자기 공명 영상 및 타겟 영상을 기초로 학 습된 것일 수 있다. 예를 들어 제1 자기 공명 영상(Input image)이 제2 인공 신경망 모델에 입력되면 복원 인공 신경망 모듈(Recon net)과 보조맵 생성 인공 신경망 모듈(Sub map net)에 각각 입력되고, 보조맵 생 성 인공 신경망 모듈의 출력 값은 복원 인공 신경망 모듈의 제1 자기 공명 영상 복원에 보조적으로 사용되 기 위해 복원 인공 신경망 모듈에 제2의 입력으로 활용될 수 있다. 또한, 보조맵은 제1 k-space 데이터 및 제1 자기 공명 영상 중 적어도 어느 하나를 기초로 수학적 모델을 이용 하여 생성될 수 있다. 일반적으로 보조맵은 멀티채널 k-space 데이터 mi(x)를 입력으로 하고 보조맵 Ci(x)를 출 력으로 하는 함수 M : mi → Ci 을 이용하여 생성된다. 다만, 수학적 모델은 인공신경망을 이용하지 않기 때문에 함수 M에 인공지능 학습되는 파라미터가 계수로 들어가지 않는다. 예를 들어 코일 감도맵은 이스피릿(ESPIRIT) 알고리즘을 통해 생성될 수 있다. 이스피릿 알고리즘은 자기 공명 영상의 각 픽셀마다 코일간의 상관관계가 존재하는 것을 전제로 한 널-스페이스 조건(Null Space Condition)을 만족하는 수학식을 이용하는 것으로, 자기 공명 영상의 각 픽셀당 감도 정보를 얻을 수 있다. 노이즈 패턴맵은 k-space 데이터에 임의로 노이즈를 인가한 후 복원 알고리즘을 이용하여 이미지를 복원하는 것을 반복하고, 이 를 노이즈를 인가하지 않은 이미지와 비교하여 생성할 수 있다. 레지듀얼 맵은 서브 샘플링된 자기 공명 영상 데이터와 풀 샘플링된 자기 공명 영상 데이터의 차이를 기초로 생성할 수 있다. 어답티브 컴바인 맵은 자기 공 명 영상의 각 픽셀마다 신호 대 잡음비를 최대화하는 각 코일들의 특성 계수를 종합하여 얻을 수 있다. 도 15는 본 발명의 일 실시예에 따른 보조맵을 기초로 제1 자기 공명 영상 세트를 형성하는 것을 보여주는 개략도이다. 도 15를 참조하면, 보조맵은 복수개로 구비되며 제1 자기 공명 영상은 복수개의 보조맵을 기초로 컴바인된 복수개의 제1 자기 공명 영상 세트로 형성될 수 있다. 예를 들어, 노이즈 패턴맵, 코일 감도맵, 레지듀얼 맵, 어답티브 컴바인맵 중 적어도 어느 하나가 각각 복수개 생성될 수 있다. 즉, 코일 감도맵이 서로 다른 특성 을 가지고 3개 생성되는 경우, 제1 자기 공명 영상은 코일 감도맵 1(Sub map 1), 코일 감도맵 2(Sub map 2), 코일 감도맵 3(Sub map 3)과 각각 컴바인되어 제1 영상 세트(Image set 1), 제2 영상 세트(Image set 2), 제3 영상 세트(Image set 1)를 형성하고, 최종적으로 제1 자기 공명 영상과 함께 영상 복원 인공 신경망(Recon Net)에 입력되어 복원 영상(Recon image)을 생성할 수 있다. 복수개의 제1 자기 공명 영상 세트는 서로 컴바인되어 제2 인공 신경망 모델에 입력될 수 있다. 예를 들어, 제1 영상 세트, 제2 영상 세트, 제3 영상 세트는 각각 제1 자기 공명 영상과 컴바인되어 제2 인공 신경망 모델에 입력될 수 있다. 또한, 제1 영상 세트, 제2 영상 세트, 제3 영상 세트 각각이 서로 컴바인 되어 제2 인공 신경망 모델에 입력될 수 있다. 한편, 이미지 도메인에서의 경우와 마찬가지로 k-space 도메인에서 제2 k-space 데이터를 획득하는 단계에 서, 제1 k-space 데이터에 보조맵이 적용되어 제1 k-space 데이터 세트로 형성되는 과정이 수행될 수 있다. 보조맵은 코일 감도맵, 노이즈 패턴맵, 레지듀얼맵 및 어답티브 컴바인 맵 중 적어도 어느 하나를 포함할 수 있 다. 보조맵은 보조맵 생성 인공 신경망 모듈을 이용하여 생성되는 것이고, 보조맵 생성 인공 신경망 모듈은 제1 자기 공명 영상 및 제2 자기 공명 영상을 기초로 학습된 것일 수 있다. 보조맵은 복수개로 구비되며, 제1 k-space 데이터는 복수개의 보조맵이 각각 적용된 복수개의 제1 k-space 데이터 세트로 형성될 수 있다. 복수개의 제1 자기 공명 영상 세트는 서로 컴바인되어 제2 인공 신경망 모델에 입력될 수 있다. 도 16은 본 발명의 일 실시예에 따른 자기 공명 영상 복원 방법의 자 기 공명 영상 복원 과정을 보여주는 개략 도이다. 도 16을 참조하면, 제2 인공 신경망 모델은 서브 샘플링된 자기 공명 신호를 기초로 산출된 k-space 데이터로부터 획득되는 자기 공명 영상과 풀 샘플링된 자기 공명 신호를 기초로 산출된 k-space 데이터로 부터 획득되는 자기 공명 영상의 차이값(이하 '풀-서브 차이값')을 학습한 것일 수 있다. 그리고, 제2 인공 신경망 모델은 제1 자기 공명 영상으로부터 풀-서브 차이값을 산출하고, 제1 자기 공명 영상에 풀-서브 차이값을 적용하여 제2 자기 공명 영상을 출력하는 것일 수 있다. 간단하게 설명하면, 제1 자기 공명 영상에 딥러닝을 통해 미리 산출된 풀-서브 차이값을 더해서 영상을 복 원하면 타겟 영상과 유사도가 매우 높은 복원 영상을 획득할 수 있다. 그리고, 제1 자기 공명 영상은 제2 인공 신경망 모델에 입력될 때 리스케일링(Rescaling) 전처리되고, 제2 인공 신경망 모델로부터 출력될 때 리스토어링(Restoring) 후처리될 수 있다. 도 17은 본 발명의 일 실시예에 따른 풀-서브 차이값의 리스케일링을 설명하기 위한 도면이다. 도 17을 참조하면, 리스케일링은 포괄적으로 인공 신경망 모델을 이용해 생산된 데이터를 학습 데이터 또는 입 력 데이터에 최적화된 형태 및 스케일로 가공하는 것을 의미한다. 예를 들어, 리스케일링은 데이터가 규칙 없이 넓은 범위에 산포되어 있거나, 복수의 집합 특성에 따라 유사한 특성의 데이터끼리 모여있는 형태로 분산되어 존재하는 경우에, 이러한 데이터를 가공하여 산포도가 낮은 형태로 만드는 것일 수 있다. 리스케일링은 데이터 의 정규화 및 표준화 중 적어도 어느 하나를 포함할 수 있다. 여기서, 정규화는 데이터에서 불필요한 영향을 제거하고 특정한 목적을 위해서 데이터들을 비교할 수 있도록 하 는 것으로, 수치적 양에 가해지는 연산 또는 관계 모형에서 예외를 제거하기 위하여 하나의 속성에 하나의 데이 터가 들어가도록 작성하여 중복을 배제하는 원칙을 공식화한 것을 의미한다. 그리고, 표준화는 데이터에 어떤 계수를 곱해서 일정한 범위에 들어가도록 하는 것을 의미하거나, 데이터의 부 동 소수점 표시에서 가수부의 왼쪽 끝에 유효 숫자가 오도록 지수부를 변경하는 것을 의미한다. 그리고, 리스토어링은 표준화나 정규화로 리스케일링된 제1 자기 공명 영상 데이터를 역변환하거나, 풀-서 브 차이값에 제1 k-space 데이터, 제1 자기 공명 영상 데이터 및 리스케일링된 제1 자기 공명 영상 데이터 중 적어도 어느 하나를 적용하여 수행되는 것일 수 있다. 여기서, 적용한다는 것은 제1 k-space 데이터나 제1 자기 공명 영상의 특성을 풀-서브 차이값에 반영 하는 것으로서, 상술한 리스토어링의 기능을 수행할 수 있다면 어떤 형태로든 진행될 수 있다. 예를 들어, 풀- 서브 차이값에 제1 k-space 데이터 또는 제1 자기 공명 영상 데이터를 더하거나, 빼거나, 곱하거나, 나누는 방식 또는 이러한 사칙 연산의 조합으로 이루어진 연산이 수행될 수 있고, 제1 k-space 데이터 또 는 제1 자기 공명 영상 데이터의 특성값, 공통값 또는 대표값을 풀-서브 차이값에 반영하는 연산이 수행될 수 있다. 이로써, 리스케일링이 적용되어 복원된 자기 공명 영상의 특성이 입력된 데이터에 대응하게 정렬될 수있다. 한편, 상술한 제1 k-space 데이터로부터 제1 인공 신경망 모델을 이용하여 제2 k-space 데이터(33 0)를 획득하는 과정에서, 제1 인공 신경망 모델은 서브 샘플링된 자기 공명 신호를 기초로 산출된 k- space 데이터로부터 획득된 자기 공명 영상을 기초로 하는 데이터와 풀 샘플링된 자기 공명 신호를 기초로 산출된 k-space 데이터로부터 획득된 자기 공명 영상을 기초로 하는 데이터의 차이값을 학습한 것일 수 있다. 여기서, 제1 인공 신경망 모델은 제1 k-space 데이터로부터 풀-서브 차이값을 산출하고, 제1 k-space 데이터에 차이값을 적용하여 제2 k-space 데이터를 출력하는 것일 수 있다. 제1 k-space 데이터는 제1 인공 신경망 모델에 입력될 때 리스케일링 전처리되고, 제1 인공 신경망 모델로부터 출력될 때 리스토어링 후처리될 수 있다. 여기서, 리스케일링은 정규화 및 표준화 중 적어도 어느 하나를 포함할 수 있다. 리스토어링은 풀-서브 차이값에 제1 k-space 데이터, 제1 자기 공명 영상 데이터 및 리스케일링된 제1 자기공명 영상 데이터 중 적어도 어느 하나를 적용하여 수행되는 것일 수 있 다. 한편, 일 실시예에서, 자기 공명 영상 처리 장치는 전술한 제1 인공 신경망 모델 및 제2 인공 신경망 모델 을 자체적으로 구축할 수 있다. 다른 일 실시예에서, 자기 공명 영상 처리 장치는 외부 서버 또는 외부 디 바이스에서 구축된 제1 인공 신경망 모델 및 제2 인공 신경망 모델을 외부 서버 또는 외부 디바이스 로부터 획득할 수도 있다. 그리고, 자기 공명 영상 처리 장치는 뉴럴 네트워크를 이용한 제1 인공 신경망 모델 및 제2 인공 신경망 모델에 기초하여, 서브 샘플링된 자기 공명 영상에 대한 복원 영상인 제2 자기 공명 영상을 획득함으로써 영상 획득 속도 가속화 및 영상 품질의 향상 목적을 달성할 수 있다. 여기서 획득된 제2 자기 공명 영상은 사용자 단말에 제공되어 환자의 병변부위 진단에 활용될 수 있다. 한 편, 제2 자기 공명 영상의 정확도를 높이기 위한 추가적인 자기 공명 영상 처리 단계가 수행될 수 있다. 예를 들어, 단계(S240) 다음으로, 제2 자기 공명 영상으로부터 퓨리에 연산을 이용하여 제3 k-space 데이 터를 획득하는 단계가 수행될 수 있다. 제3 k-space 데이터를 획득하는 단계는, 제2 자기 공명 영상을 디컴바인(decombine)하여 복수개의 제2 자 기 공명 영상을 획득하는 단계를 포함할 수 있다. 제2 자기 공명 영상은 각각의 보조맵 정보를 기초 로 디컴바인되어 복수개의 자기 공명 영상으로 생성될 수 있다. 그리고 제3 k-space 데이터를 획득하는 단계는, 제2 자기 공명 영상으로부터 퓨리에 연산을 이용하여 제3 k-space 데이터를 획득하는 단계를 포함할 수 있다. 이로써, 제2 자기 공명 영상으로부터 생성된 복수개의 자기 공명 영상에 퓨리에 변환을 적용하여 복수개의 제3 k-space 데이터를 획득할 수 있다. 그 다음으로, 제3 k-space 데이터로부터 병렬 연산 기법을 이용하여 제4 k-space 데이터를 획득하는 단계가 수 행될 수 있다. 여기서 병렬 연산 기법은 풀 샘플링된 제3 k-space 데이터로부터 보정된 풀 샘플링된 제4 k- space 데이터를 획득할 수 있는 병렬 연산 기법일 수 있다. 여기서 적용되는 병렬 연산 기법으로는 전술한 스피 릿(SPIRiT) 기법이 사용될 수 있다. 예를 들어, 제1 병렬 연산 기법으로 그라파가 사용되고, 제2 병렬 연산 기법으로 스피릿이 사용됨에 따라, 복원 영상을 획득하는 과정에서 보다 정확도 높은 복원 영상이 획득되는 효과가 있다. 그 다음으로, 제4 k-space 데이터로부터 인공 신경망 모델을 이용하여 제5 k-space 데이터를 획득하는 단계가 수행될 수 있다. 여기서 인공 신경망 모델은 전술한 제1 인공 신경망 모델과 동일한 인공 신경망 모델이 사용될 수 있다. 또는 제1 인공 신경망 모델과 다른 인공 신경망 모델이 사용될 수도 있다. 이후로는 제5 k-space 데이터를 기초로 전술한 단계(S230)에서 단계(S240)까지의 과정을 한 세트로 하여 반복 수행되어 최종적으로 자기 공명 영상(이하 '출력 자기 공명 영상')이 출력될 수 있다. 그리고 출력 자기 공명 영상은 사용자 단말에 제공되어 환자의 병변부위 진단 영상으로 사용될 수 있다. 이상으로 설명한 본 발명의 실시예들에 따른 자기 공명 영상 처리 장치 및 그 방법은 자기 공명 영상 촬영 장치 로 자기 공명 영상을 촬영하는 시간을 단축하고, 영상 복원을 통해 정확도 높은 자기 공명 영상을 생성하는 효 과가 있다. 또한, 본 발명의 실시예들에 따른 자기 공명 영상 처리 장치 및 그 방법은 복수개의 자기 공명 영상을 획득하고, 이를 전처리하여 입력 데이터를 생성하며, 제1 인공 신경망 모델 및 제2 인공 신경망 모델을 활용하여 복원된 정확도 높은 출력 자기 공명 영상을 제공하는 것으로서 환자의 병변부위 진단을 용이하게 하는 효과가 있다. 한편, 본 발명의 일 실시예에 따른 자기 공명 영상 처리 방법은 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방 법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 본 발명의 방법 및 시 스템은 특정 실시예와 관련하여 설명되었지만, 그것들의 구성 요소 또는 동작의 일부 또는 전부는 범용 하드웨 어 아키텍쳐를 갖는 컴퓨터 시스템을 사용하여 구현될 수 있다. 이상의 설명은 본 발명의 기술적 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야 에서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가능할 것이다. 따라서, 본 발명에 개시된 실시예는 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2020-0172052", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 자기 공명 영상 처리 장치의 구성을 보여주는 구성도이다. 도 2는 본 발명의 일 실시예에 따른 자기 공명 영상 처리 방법의 순서를 보여주는 순서도이다. 도 3은 본 발명의 일 실시예에 따른 자기 공명 영상 처리 방법을 보여주는 개략도이다. 도 4는 본 발명의 일 실시예에 따른 서브 샘플링과 풀 샘플링의 차이점을 설명하기 위한 개략도이다. 도 5는 본 발명의 일 실시예에 따른 제1 인공 신경망 모델을 이용하여 제1 k-space 데이터로부터 제2 k-space 데이터를 획득하는 것을 보여주는 개략도이다. 도 6은 자기 공명 영상 복원 복원에 따른 타겟 영상 및 복수개의 멀티 도메인 아티팩트 영상을 보여주는 도면이 다. 도 7은 자기 공명 영상 복원 복원에 따른 복수개의 멀티 도메인 아티팩트 영상을 보여주는 도면이다. 도 8은 본 발명의 일 실시예에 따른 제1 k-space 데이터 전처리 및 제2 k-space 데이터 후처리를 적용한 자기 공명 영상 처리 방법의 순서를 보여주는 순서도이다. 도 9는 본 발명의 일 실시예에 따른 제2 인공 신경망 모델을 이용하여 제1 자기 공명 영상으로부터 제2 자기 공 명 영상을 획득하는 것을 보여주는 개략도이다. 도 10은 본 발명의 일 실시예에 따른 복수개의 보조맵 중 노이즈 패턴맵을 설명하기 위한 도면이다. 도 11은 본 발명의 일 실시예에 따른 복수개의 보조맵 중 코일 감도맵을 설명하기 위한 도면이다. 도 12는 본 발명의 일 실시예에 따른 복수개의 보조맵 중 레지듀얼맵을 설명하기 위한 도면이다. 도 13은 본 발명의 일 실시예에 따른 복수개의 보조맵 중 어답티브 컴바인맵을 설명하기 위한 도면이다. 도 14는 본 발명의 일 실시예에 따른 보조맵 생성 인공 신경망 모듈을 포함하는 제2 인공 신경망 모델의 구조를 보여주는 개략도이다. 도 15는 본 발명의 일 실시예에 따른 보조맵을 기초로 제1 자기 공명 영상 세트를 형성하는 것을 보여주는 개략 도이다. 도 16은 본 발명의 일 실시예에 따른 자기 공명 영상 복원 방법의 자기 공명 영상 복원 과정을 보여주는 개략도 이다. 도 17은 본 발명의 일 실시예에 따른 풀-서브 차이값의 리스케일링을 설명하기 위한 도면이다."}
