{"patent_id": "10-2023-0072268", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0173718", "출원번호": "10-2023-0072268", "발명의 명칭": "IoMT 기반의 욕창방지 의료 결정지원 시스템 및 방법", "출원인": "주식회사 바이패스", "발명자": "강석봉"}}
{"patent_id": "10-2023-0072268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "IoMT 기반의 욕창방지 의료 결정지원 시스템에 있어서,센서로부터 압력, 기울기, 동작상태, 동작속도를 포함하는 모니터링 데이터 및 환자 상태 정보를 수집하고, 수집된 모니터링 데이터를 서버로 전송하는 욕창방지 매트리스;상기 욕창방지 매트리스로부터 모니터링 데이터를 수신하고, 욕창 방지 매트리스 각각의 형태와 동작을 주기적으로 제어하고, 제어 후 각 욕창방지 매트리스의 상태를 확인하는 서버;상기 욕창방지 매트리스로부터 환자 상태 정보를 수집하여 모니터링하고, 환자 상태 정보에 따라 욕창방지 매트리스를 원격제어 하는 간호 스테이션; 을 포함하고상기 환자 상태 정보는상기 욕창방지 매트리스에 의해 생성된 환자 모니터링 영상 및 외부 센서로부터 획득한 생체정보를 포함하는 것을 특징으로 하는 IoMT 기반의 욕창방지 의료 결정지원 시스템."}
{"patent_id": "10-2023-0072268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 욕창방지 매트리스; 는동작감지센서, 압력감지 센서, 속도 감지 센서, 전류, 전압, 주파수 모니터링 센서 및 환자를 촬영하여 환자 상태 정보를 영상으로 생성하는 카메라를 포함하는 센서부;상기 센서부로부터 욕창방지 매트리스 모니터링 데이터를 수집하여 서버로 전송하고, 환자 상태 정보를 간호 스테이션으로 전송하는 통신부; 및서버 또는 간호 스테이션으로부터 제어신호를 수신하여, 수신한 제어신호에 따라 욕창방지 매트리스를 제어하는제어부; 를 포함하는 것을 특징으로 하는 IoMT 기반의 욕창방지 의료 결정지원 시스템"}
{"patent_id": "10-2023-0072268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 서버; 는복수개의 욕창방지 매트리스로부터 모니터링 정보를 수집하는 수집부;욕창방지 매트리스의 마지막 변경 시점 및 환자 상태 정보에 따라 욕창방지 매트리스 제어 신호를 생성하는 생성부;환자 상태 정보를 모니터링하여 환자의 낙상, 호흡 곤란 자세를 포함하는 이상상태를 감지하는 감지부; 및욕창방지 매트리스의 모니터링 데이터 분석을 통해, 매트리스 별 고장여부를 판단하는 판단부; 를 포함하는 것을 특징으로 하는 IoMT 기반의 욕창방지 의료 결정지원 시스템."}
{"patent_id": "10-2023-0072268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 서버; 는DNN(Deep Neural Network), CNN(Convolutional Neural Network) RNN(Recurrent Neural Network) 및BRDNN(Bidirectional Recurrent Deep Neural Network) 중 적어도 하나를 포함하는 딥러닝 뉴럴 네트워크를 트레이닝 데이터 셋으로 학습시켜 매트리스 제어 모델, 이상상태 감지모델, 고장 여부 판단 모델을 포함하는 딥러공개특허 10-2024-0173718-3-닝 모델을 구현하는 것을 특징으로 하는 IoMT 기반의 욕창방지 의료 결정지원 시스템."}
{"patent_id": "10-2023-0072268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 감지부; 는환자 상태 정보 및 욕창방지 매트리스의 모니터링 데이터 분석을 통해, 환자의 낙상 예측을 수행하고, 낙상 예측을 통해 낙상 가능성이 일정 수준 이상으로 산출된 경우, 낙상 예측 결과를 간호 스테이션으로 전달하고, 낙상 예방을 위한 욕창방지 매트리스 제어신호를 생성하는 것을 특징으로 하는 IoMT 기반의 욕창방지 의료 결정지원 시스템."}
{"patent_id": "10-2023-0072268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 감지부; 는 환자 상태정보와 욕창방지 매트리스 모니터링 정보를 통해 사용자 민감도, 활성도, 환자 자세를 포함하는 환자특성정보를 파악하고, 상기 환자 특성정보를 낙상 예측 모델에 입력하여 낙상 가능성을 획득하고, 상기 환자 특성 정보를 욕창 발생 예측 모델에 입력하여, 욕창 발생 가능성을 획득하는 것을 특징으로 하는 IoMT 기반의 욕창방지 의료 결정지원 시스템."}
{"patent_id": "10-2023-0072268", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "인공지능과 IoMT 기반의 욕창방지 의료 결정지원 방법에 있어서,(A) 욕창방지 매트리스에서 센서로부터 압력, 기울기, 동작상태, 동작속도를 포함하는 모니터링 데이터 및 환자상태 정보를 수집하고, 수집된 모니터링 데이터를 서버로 전송하는 단계;(B) 서버에서 상기 욕창방지 매트리스로부터 모니터링 데이터를 수신하고, 욕창 방지 매트리스 각각의 형태와동작을 주기적으로 제어하고, 제어 후 각 욕창방지 매트리스의 상태를 확인하는 단계; 및 (C) 간호 스테이션에서 상기 욕창방지 매트리스로부터 환자 상태 정보를 수집하여 모니터링하고, 환자 상태 정보에 따라 욕창방지 매트리스를 원격제어 하는 단계; 를 포함하고,상기 환자 상태 정보는상기 욕창방지 매트리스에 의해 생성된 환자 모니터링 영상 및 외부 센서로부터 획득한 생체정보; 를 포함하는것을 특징으로 하는 IoMT 기반의 욕창방지 의료 결정지원 방법."}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 따른 IoMT 기반의 욕창방지 의료 결정지원 시스템 및 방법은 욕창방지 매트리스에 부착된 센서를 통해, 욕창방지 매트리스의 압력, 모션 정보 및 환자의 동작정보를 포함하는 모니터링 데이터를 수집하고 분석하여, 모 니터링 데이터 분석 결과에 따라 욕창방지 매트리스를 주기적으로 제어한다. 이를 통해, 움직임이 불가능한 환자 의 자세를 노동력 투입 없이 자동으로 변화시킬 수 있도록 하고, 입원환자의 경우, 간호 스테이션에서 병실의 욕 창 매트리스를 제어하여 환자의 체위를 변화시킬 수 있도록 한다. 실시예에서는 인공지능 기반의 딥러닝 모델을 통해 환자에게 필요한 자세와 체위 변경 주기를 산출하여, 산출 결과대로 욕창 매트리스를 제어할 수 있다."}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 IoMT 기반의 욕창방지 의료 결정지원 시스템 및 방법에 관한 것으로 구체적으로, 욕창방지 매트 리스로부터 압력제어, 동작제어, 동작 감지에 대한 모니터링 데이터를 수집하고, 모니터링 데이터에 기반하여 자세 변경을 원격으로 제어하는 IoMT 기반의 의료 결정지원 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 의료 결정 지원 시스템(MDSS, Medical Decision Support System)은 의료 전문가들이 의사 결정을 할 때 도움을 주는 컴퓨터 기반 시스템이다. 의료 결정 지원 시스템은 의료 정보, 환자 데이터, 의료 지식 등을 분석하고 해석하여 의료 전문가에게 의사 결정을 지원하고 가이드한다. 의료 결정 지원 시스템은 의료 분야에서 다양한 목 적으로 사용될 수 있다. 예를 들어, 다양한 의료 기록 및 이미지를 분석하여 진단을 도와주는 시스템, 의약품 처방 시 오류를 방지하고 안전성을 향상시키는 시스템, 임상 지침과 최신 연구 결과를 제공하여 의사 결정을 업 데이트하는 시스템 등으로 활용될 수 있다. 의료 결정 지원 시스템은 의료 전문가의 의사 결정에 보조적인 역할 을 하며, 의료 진단과 치료에 대한 정확성과 효율성을 향상시키는 데 도움을 줄 수 있다. 한편, 욕창은 몸을 움직일 수 없는 환자가 같은 자세로 누워있어 체압으로 피부가 괴사하는 질병이다. 욕창은 중환자의 경우 18퍼센트, 장기 입원 환자의 경우 28퍼센트 및 가정의료환경에서 29퍼센트에 달하는 매우 높은 발명율을 보인다. 한국은 고령화 속도가 매우 빠르게 진행되고 있고, 고령화에 따른 만성 퇴행성 질환 또한 증 가 추세이다. 이로 인해, 욕창 발생을 방지하는 기술 수요가 매우 높다. 종래에는 입원환자의 경우, 도 1에 도시된 바와 같이 움직일 수 없는 환자를 간호사나 간병인이 직접 이동시켜 환자의 체위를 변화시켜왔다. 환자의 체위 변경은 주기적으로 수행해야 하기 때문에, 간호사와 간병인의 업무를 가중시키는 문제가 있다. 아울러, 체중이 일정 수준을 초과하는 환자의 경우 주기적인 체위 변경은 간호사와 간 병인의 중노동을 필요로 하여, 간호사의 조기 퇴사 원인으로 지적되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 한국 특허공개 제10-2022-0080936호 (2022.06.15) (특허문헌 0002) 2. 한국 특허등록 제10-1174025호 (2012.08.08)"}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예에 따른 IoMT 기반의 욕창방지 의료 결정지원 시스템 및 방법은 욕창방지 매트리스에 부착된 센서를 통해, 욕창방지 매트리스의 압력, 모션 정보 및 환자의 동작정보를 포함하는 모니터링 데이터를 수집하고 분석 하여, 모니터링 데이터 분석 결과에 따라 욕창방지 매트리스를 주기적으로 제어한다. 이를 통해, 움직임이 불가 능한 환자의 자세를 노동력 투입 없이 자동으로 변화시킬 수 있도록 하고, 입원환자의 경우, 간호 스테이션에서 병실의 욕창 매트리스를 제어하여 환자의 체위를 변화시킬 수 있도록 한다. 실시예에서는 인공지능 기반의 딥러닝 모델을 통해 환자에게 필요한 자세와 체위 변경 주기를 산출하여, 산출 결과대로 욕창 매트리스를 제어할 수 있다. 또한, 실시예에서는 욕창 매트리스 모니터링 데이터 분석을 통해, 욕창 매트리스의 상태 정보와 환자 자세 정보 및 환자의 낙상 여부정보를 간호 스테이션의 관리자 단말 및 간병인 단말로 전송할 수 있다."}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 인공지능과 IoMT 기반의 욕창방지 의료 결정지원 시스템은 센서로부터 압력, 기울기, 동작상태, 동작속도를 포함하는 모니터링 데이터 및 환자 상태 정보를 수집하고, 수 집된 모니터링 데이터를 서버로 전송하는 욕창방지 매트리스; 욕창방지 매트리스로부터 모니터링 데이터를 수신 하고, 욕창 방지 매트리스 각각의 형태와 동작을 주기적으로 제어하고, 제어 후 각 욕창방지 매트리스의 상태를 확인하는 서버; 욕창방지 매트리스로부터 환자 상태 정보를 수집하여 모니터링하고, 환자 상태 정보에 따라 욕 창방지 매트리스를 원격제어 하는 간호 스테이션; 을 포함하고 환자 상태 정보는 욕창방지 매트리스에 의해 생 성된 환자 모니터링 영상 및 외부 센서로부터 획득한 생체정보를 포함한다."}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같은 IoMT 기반의 욕창방지 의료 결정지원 시스템 및 방법은 욕창방지 매트리스로부터 수집한 모니 터링 데이터와 환자 정보를 이용하여 욕창 매트리스의 압력, 기울기, 모션 등을 원격 제어하여 움직일 수 없는 환자의 체위를 주기적으로 변경시킬 수 있다. 이를 통해, 욕창을 예방하고, 의료인의 노동력을 대폭 절감할 수 있다. 또한, 실시예에서는 욕창방지 매트리스로부터 수집된 모니터링 데이터 분석 결과를 통해, 매트리스의 정상 동작 여부를 예측하고 환자의 체위와 상태 변화 정보를 파악하여 환자 관리를 더욱 용이하게 수행할 수 있다. 또한, 실시예에서는 예측된 환자 상태에 따라 욕창 방지 매트리스를 자동 제어함으로써, 거동이 힘든 환자가 보 다 편안한 상태에서 누워 있을 수 있도록 한다."}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1개의 유닛이 2개 이상의 하드웨어를 이용하여 실현되어도 되 고, 2개 이상의 유닛이 1개의 하드웨어에 의해 실현되어도 된다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기술 된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 이하, 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 2는 실시예에 따른 IoMT 기반의 욕창방지 의료 결정지원 시스템 구성을 나타낸 도면이다. 도 2를 참조하면, 실시예에 따른 IoMT 기반의 욕창방지 의료 결정지원 시스템은 욕창방지 매트리스, 서버 및 간호 스테이션을 포함하여 구성될 수 있다. 실시예에서 욕창방지 매트리스는 환자 상태 정 보와 욕창방지 매트리스 모니터링 정보를 수집한다. 실시예에서 환자 상태 정보는 환자의 모니터링 영상을 포함 하고, 욕창방지 매트리스 모니터링 정보는 매트리스에 구성된 각 센서로부터 수집한 매트리스의 영역별 압력, 기울기, 동작상태, 동작속도, 전류, 전압, 주파수 등을 포함할 수 있다. 실시예에서 욕창방지 매트리스는 수집된 모니터링 데이터와 환자 상태 정보를 서버로 전송한다. 실시예에서 욕창방지 매트리스는 수집 한 환자 상태 정보를 간호 스테이션으로 전송한다. 서버는 욕창방지 매트리스로부터 모니터링 데이터와 환자 상태 정보를 수신하고, 욕창 방지 매트리스 각각 의 형태와 동작 주기적으로 제어하고, 제어 후 각 욕창방지 매트리스의 상태를 확인한다. 실시예에서 서버(20 0)는 매트리스 상태 확인 후, 매트리스의 설정 경도 제어 매칭 정확도, 설정 동작 주기 매칭 정확도, 설정 동작 범위 매칭 정확도 및 설정 동작 속도 매칭 정확도를 파악한다. 또한, 실시예에서 서버는 환자 상태 정보와 욕창방지 매트리스 모니터링 정보를 기반으로 환자의 낙상 확 률을 산출하고, 이상상태를 감지한다. 또한, 서버는 욕창방지 매트리스로부터 수집한 모니터링 데이터를 분석하여 매트리스 각각의 고장 여부를 판단할 수 있다. 실시예에서 간호 스테이션은 욕창방지 매트리스로부터 환자 상태 정보를 수집하여 모니터링하고, 환 자 상태 정보에 따라 욕창방지 매트리스를 원격제어 한다. 실시예에서 환자 상태 정보는 욕창방지 매트리스에 의해 생성된 환자 모니터링 영상 및 외부 센서로부터 획득한 생체정보를 포함할 수 있다. 실시예에서 생체정보는 심박수, 혈압, 온도, 맥박 등을 포함할 수 있다. 실시예에 따른 인공지능과 IoMT 기반의 욕창방지 의료 결정지원 시스템 및 방법은 욕창방지 매트리스에 부착된 센서를 통 해, 욕창방지 매트리스의 압력, 모션 정보 및 환자의 동작정보를 포함하는 모니터링 데이터를 수집하고 분석하 여, 모니터링 데이터 분석 결과에 따라 욕창방지 매트리스를 주기적으로 제어한다. 이를 통해, 움직임이 불가능 한 환자의 자세를 노동력 투입 없이 자동으로 변화시킬 수 있도록 하고, 입원환자의 경우, 간호 스테이션에서 병실의 욕창 매트리스를 제어하여 환자의 체위를 변화시킬 수 있도록 한다. 실시예에서는 인공지능 기반의 딥러닝 모델을 통해 환자에게 필요한 자세와 체위 변경 주기를 산출하여, 산출 결과대로 욕창 매트리스를 제어할 수 있다. 또한, 실시예에서는 욕창 매트리스 모니터링 데이터 분석을 통해, 욕창 매트리스의 상태 정보와 환자 자세 정보 및 환자의 낙상 여부정보를 간호 스테이션의 관리자 단말 및 간병인 단말로 전송할 수 있다. 도 3은 실시예에 따른 욕창방지 매트리스의 데이터 처리 구성을 나타낸 도면이다. 도 3을 참조하면, 실시예에 따른 욕창방지 매트리스는 센서부, 통신부 및 제어부를 포함하여 구 성될 수 있다. 본 명세서에서 사용되는 '부' 라는 용어는 용어가 사용된 문맥에 따라서, 소프트웨어, 하드웨어 또는 그 조합을 포함할 수 있는 것으로 해석되어야 한다. 예를 들어, 소프트웨어는 기계어, 펌웨어(firmware), 임베디드코드(embedded code), 및 애플리케이션 소프트웨어일 수 있다. 또 다른 예로, 하드웨어는 회로, 프로세 서, 컴퓨터, 집적 회로, 집적 회로 코어, 센서, 멤스(MEMS; Micro-Electro-Mechanical System), 수동 디바이스, 또는 그 조합일 수 있다. 센서부는 욕창 방지 매트리스에 설치된 센서로부터 센싱 데이터를 수집한다. 실시예에서 욕창방지 매트리 스에 설치된 센서는 동작감지센서, 압력감지 센서, 속도 감지 센서, 전류, 전압, 주파수 모니터링 센서, 기울기 감지 센서 및 환자를 촬영하여 환자 상태 정보를 영상으로 생성하는 카메라 등을 포함할 수 있고 이에 한정하지 않는다. 통신부는 센서부로부터 각 센서에서 센싱된 욕창방지 매트리스 모니터링 데이터를 수집하여 서버로 전송하고, 환자 상태 정보를 간호 스테이션으로 전송한다. 제어부는 서버 또는 간호 스테이션으로부터 제어신호를 수신하여, 수신한 제어신호에 따라 욕창방지 매트 리스를 제어한다. 또한, 실시예에서 제어부는 환자 상태 정보에 따라 매트리스를 직접 제어하여, 환자의 체위 또는 자세를 변화시킬 수 있다. 예컨대, 제어부는 낙상 확률이 일정 수준을 초과하거나, 환자가 호흡 곤란 자세를 일정 시간 이상 취하고 있는 경우를 포함하는 이상상태가 감지되면, 욕창방지 매트리스를 직접 제 어하여 환자의 체위 또는 자세를 변경시킬 수 있다. 실시예에서 제어부는 이상상태가 감지되는 경우에는 간호 스테이션에 이를 알린다. 또한, 실시예에서 제어부는 환자의 주기적인 모션이 감지되는 경우, 주기적 인 모션을 불편 패턴으로 인식하고, 모션에 매칭된 제어정보에 따라 욕창방지 매트리스를 제어할 수 있다. 예컨 대, 제어부는 환자가 다리를 들어올리려는 동작이 주기적으로 인식된 경우, 매트리스의 하체 부분의 각도 를 변경시키는 제어를 수행할 수 있다. 또한, 제어부는 환자가 상체를 들어올리려는 동작을 주기적으로 인 식한 경우, 매트리스 상체 부분의 기울기를 증가시키는 제어를 수행할 수 있다. 도 4는 실시예에 따른 서버의 데이터 처리 구성을 나타낸 도면이다. 도 4를 참조하면, 실시예에 따른 서버는 수집부, 전처리부, 딥러닝부, 생성부, 감지 부, 판단부 및 피드백부를 포함하여 구성될 수 있다. 수집부는 복수개의 욕창방지 매트리스로부터 모니터링 정보와 환자 상태 정보를 수집한다. 또한, 수집부 는 딥러닝 모델의 트레이닝 데이터 셋을 수집할 수 있다. 실시예에서 딥러닝 모델은 매트리스 제어모델, 이상상태 감지 모델 및 고장 판단 모델을 포함할 수 있다. 매트리스 제어모델의 트레이닝 데이터 셋은 센서 데 이터, 사용자 피드백, 제어 알고리즘, 시스템 상태 정보 등을 포함할 수 있다. 이상상태 감지 모델의 트레이닝 데이터 셋은 환자가 촬영된 영상상태에서의 이상상태 정보 및 각 이상상태에서의 매트리스 모니터링 데이터를 포함할 수 있다. 고장 판단 모델의 트레이닝 데이터 셋은 정상적인 모니터링 데이터 및 고장 진단 이력 정보 등 을 포함할 수 있다. 또한, 실시예에서 수집부는 조기 IoT 데이터 수집 처리를 위한 사물 보드(thing Board) 기반 스냅 인 어플 리케이션(snap in application)을 통해 욕창방지 매트리스의 모니터링 데이터를 수집한다. 실시예에서 사물 보 드(Thing Board)는 오픈 소스 IoT 플랫폼으로, 센서 데이터를 수집하고 관리한다. 실시예에서 수집부는 사 물 보드(Thing Board)를 사용하여 욕창 방지 매트리스의 센서 데이터인 모니터링 데이터를 수집하고 저장한다. 스냅 인(Snap-in) 어플리케이션은 사물 보드 플랫폼에 추가되는 확장 기능으로, 특정 기능을 수행하거나 사용자 정의 기능을 제공한다. 욕창 방지 매트리스의 경우, 스냅 인 애플리케이션을 통해 매트리스의 데이터 수집, 처 리 및 모니터링을 담당할 수 있다. 실시예에서는 수집부는 사물 보드(Thing Board) 기반 스냅 인(Snap-in) 애플리케이션을 사용하여 욕창 방지 매트리스에서 생성되는 다양한 모니터링 데이터를 수집할 수 있다. 모니터 링 데이터는 매트리스의 압력, 온도, 사용자의 몸의 위치 및 움직임, 매트리스 사용 시간 등을 포함할 수 있다. 실시예에서 수집된 데이터는 사물 보드 플랫폼에 저장되며, 필요에 따라 실시간으로 모니터링하거나 분석을 위 해 다른 시스템과 통합될 수 있다. 실시예에서는 모니터링 데이터를 기반으로 욕창 방지 매트리스의 효율성을 평가하고, 환자의 건강 상태를 모니터링하고 예방 조치를 취할 수 있다. 전처리부는 수집된 인공지능 학습 트레이닝 데이터 셋 중 편향성이나 차별성을 가진 데이터를 제거하기 위 해, 수집된 학습데이터를 전처리한다. 실시예에서 전처리부는 수집된 데이터를 전처리하여 인공지능 모델 학습에 적합한 형태로 가공한다. 예컨대, 전처리부는 노이즈 제거, 이상치 제거, 결측치 처리 등의 과정을 수행할 수 있다. 또한, 전처리부는 데이터 전처리를 통해 데이터를 정규화하거나, 이상치를 제거하거나, 데이터의 배율 조정 등을 수행하여 모델이 불필요한 패턴을 학습하는 것을 방지할 수 있다. 딥러닝부는 딥러닝 뉴럴 네트워크를 트레이닝 데이터 셋으로 학습시켜 매트리스 제어 모델, 이상상태 감지 모델, 고장 여부 판단 모델을 포함하는 딥러닝 모델을 구현한다. 실시예에서 매트리스 제어 모델은 욕창방지 모 니터링 데이터 및 환자 상태 정보에 따라 욕창방지 매트리스를 제어하여, 환자의 체위를 조정하고, 서버 및 간 호 스테이션으로부터 수신하는 제어 패턴을 파악하여 욕창방지 매트리스를 제어하는 딥러닝 모델이다. 이상상태 감지모델은 욕창방지 매트리스로부터 획득한 환자 상태 정보와 모니터링 데이터에 따라 환자의 이상상태를 감지 하는 딥러닝 모델이다. 실시예에서 환자의 이상상태는 낙상 가능성이 일정 수준을 초과하는 경우, 호흡 곤란 자 세를 일정 수준 이상 유지하는 경우, 욕창 발생 가능성이 일정 수준을 초과하는 경우 등을 포함할 수 있다. 고 장 여부 판단 모델은 욕창방지 매트리스 모니터링 데이터를 분석하여, 욕창방지 매트리스의 고장 여부 및 고장 부분을 파악하는 딥러닝 모델이다. 실시예에서 딥러닝 뉴럴 네트워크는 DNN(Deep Neural Network), CNN(Convolutional Neural Network) RNN(Recurrent Neural Network) 및 BRDNN(Bidirectional Recurrent Deep Neural Network) 중 적어도 하나를포함할 수 있고, 이에 한정하지 않는다. 생성부는 욕창방지 매트리스의 마지막 변경 시점 및 환자 상태 정보에 따라 욕창방지 매트리스 제어 신호 를 생성한다. 실시예에서 욕창방지 매트리스 제어신호는 매트리스 부분 별 기울기, 움직임, 움직임 속도를 제어 하는 신호를 포함할 수 있다. 실시예에서 생성부는 매트리스 제어 모델에 마지막 제어 시점 및 환자 상태 정보를 입력하여, 욕창방지 매트리스를 자동으로 제어할 수 있다. 이를 위해, 실시예에서 생성부는 매트리 스의 마지막 변경 시점을 확인하기 위해, 시스템은 저장된 데이터를 조회하여 매트리스의 최근 변경 이벤트를 파악한다. 실시예에 따른 최근 변경 이벤트는 매트리스의 구성, 설정 또는 상태가 변경된 마지막 시점을 포함한 다. 또한, 매트리스 제어는 환자의 상태에 따라 조정되어야 하므로 생성부는 다양한 센서로부터 환자 상태 정보를 수집한다. 예컨대, 생성부는 환자의 심박수, 호흡 속도, 체온, 움직임 등을 측정하여 환자의 현재 상태를 파악한다. 이후, 생성부는 욕창방지 매트리스 제어 신호를 생성한다. 실시예에서 매트리스의 욕창 방지 매트리스 제 어 신호는 마지막 변경 시점과 환자 상태 정보를 기반으로 생성된다. 이를 위해 제어 알고리즘은 이전에 훈련된 모델을 활용하거나 사전에 정의된 규칙을 따른다. 예를 들어, 제어 알고리즘은 환자의 특정 위치에 대한 압력을 조정하거나, 환자가 움직일 때 자동으로 매트리스의 위치를 조정하여 압력을 분산시키는 등의 제어 신호를 생성 한다. 실시예에서 생성된 제어 신호는 매트리스에 전달되어 실제로 욕창방지 매트리스를 제어한다. 매트리스는 환자를 편안하게 유지하면서 욕창 예방을 위한 적절한 압력을 분산시킬 수 있도록 하고, 환자 체위를 안전하게 변화시킬 수 있도록 한다. 실시예에서 생성부는 제어신호 전송 후 욕창방지 매트리스로부터 상태 정보를 수신하여, 제어 신호의 반영 여부를 확인한다. 실시예에서 상태 정보는 매트리스의 경도, 동작주기, 동작 속도 등을 포함한다. 실시예에서 생성부는 제어신호에 포함된 매트리스의 경도, 동작주기, 동작 속도에 대한 매트리스가 실제 제어된 매트 리스의 경도, 동작주기, 동작 속도의 비율로 매트리스의 설정 경도 제어 매칭 정확도, 설정 동작 주기 매칭 정 확도, 설정 동작 범위 매칭 정확도 및 설정 동작 속도 매칭 정확도를 산출한다. 실시예에서 생성부는 산출 된 설정 경도 제어 매칭 정확도, 설정 동작 주기 매칭 정확도, 설정 동작 범위 매칭 정확도 및 설정 동작 속도 매칭 정확도가 일정 수준 미만인 경우, 원격 제어 오류로 판단하고 이를 관리자 및 간호 스테이션에 알릴 수 있 다. 감지부는 환자 상태 정보를 모니터링하여 환자의 이상상태를 감지한다. 실시예에서 이상상태는 환자의 낙 상 가능성이 일정 수준 이상인 경우, 호흡 곤란 자세 등을 포함할 수 있다. 실시예에서 감지부는 환자 상 태 정보 중 환자를 촬영한 영상 분석을 통해 이상상태를 감지할 수 있다. 실시예에서 감지부는 인공지능 머신러닝을 통한 이미지 인식(image recognition)과정을 통해 환자의 이상 상태를 감지할 수 있다. 인공지능 이미지 인식은 기계가 마치 사람처럼 사진으로부터 사물을 인식하고 장면을 이해하는 것으로, 컴퓨터 비전 기술 중 하나에 해당한다. 실시예에서는 이미지 인식을 위해, 환자 촬영 영상의 이미지에 포함된 환자 객체 분류(classification), 검출(detection) 및 개체를 픽셀 단위로 식별하여 분할 (segmentation)하는 데이터 처리 과정을 수행한다. 실시예에서 감지부는 노이즈 대응 외 학습하지 못한 패 턴 처리를 위해 학습 외 분포 데이터 탐지(out of distribution detection)과정을 수행한다. 학습 외 분포 데이 터 탐지는 인공지능에 입력된 이미지가 학습된 확률분포 데이터 인지 아닌지 식별하는 것이다. 실시예에서는 학 습 외 분포 데이터 탐지를 통해 인공 신경망이 판단하기 어려운 이미지를 걸러내거나 예외 처리하여 안정성과 신뢰성을 높일 수 있도록 한다. 실시예에서는 학습 외 분포 데이터 탐지를 위해서 딥러닝 판정에 대해 얼마나 확신(confidence)하는지를 나타내는 확률 값을 보정(calibration)하거나 학습 외 분포 데이터를 생성적 대립 신 경망(GAN, Generative Adversarial Network)으로 생성하고 학습하여 탐지 정확도를 향상시킬 수 있도록 한다. 또한, 실시예에서는 이미지 인식 정확도를 유지하면서 모델의 크기를 줄이기 위해, 연산을 간소화하는 경량 딥 러닝 기술을 이용하여 체형박스를 최종 확정할 수 있도록 한다. 실시예에서는 이미지 인식을 위해 콘볼루션 신 경망(CNN, Convolution Neural Network)에서 콘볼루션 필터를 변형하여 연산 차원을 축소(Reduction)하거나 큰 영향이 없는 신경망의 가중치(weight)를 삭제하는 가지치기, 가중치 값의 부동 소수점을 줄여 연산을 간소화하 는 양자화 과정을 수행하여 데이터 경량화를 가능하도록 한다. 또한, 실시예에서는 미리 학습시킨 큰 신경망의 출력을 작은 신경망에서 모방 학습하도록 하여 연산을 간소화하며 정확도를 유지할 수 있도록 한다. 또한, 실시예에서 감지부는 이상상태 감지 모델에 환자 상태 정보를 입력하여, 환자의 이상상태 정보를 획득할 수 있다. 또한, 감지부는 이상상태를 감지하기 위해 여러 센서를 사용하여 환자 상태 정보를 수집한다. 예컨대, 감 지부는 가속도계 센서를 사용하여 환자의 움직임을 모니터링하고, 호흡 소음 센서를 사용하여 호흡 소리를 감지한다. 추가적으로, 환자의 심박수, 산소 포화도, 체온 등의 생체 신호 데이터도 수집한다. 이후 감지부 는 수집된 센서 데이터를 분석하여 환자의 상태를 평가한다. 예를 들어, 가속도계 데이터를 분석하여 낙상 을 감지하거나, 호흡 소음 데이터는 호흡 곤란 자세를 포함한 이상한 호흡 패턴을 식별하는 데 사용한다. 또한, 감지부는 수집한 생체 신호 데이터를 정상 범위와 비교하여 이상 상태를 식별할 수 있다. 실시예에서 감 지부는 상태 분석을 기반으로 이상상태 감지를 수행하기 위해 이상상태 감지 알고리즘 및 이상상태 감지 모델을 이용한다. 실시예에서 감지부는 이상상태 감지 알고리즘 및 이상상태 감지 모델을 통해, 수집된 데 이터를 사용하여 환자의 상태를 평가하고, 사전에 정의된 기준과 비교하여 이상 상태 여부를 결정한다. 실시예 에서 감지부는 이상 상태가 감지되면 적절한 조치를 취하기 위해 이상 상태 알림을 생성한다. 이를 위해 경고 메시지를 전송하거나 의료진에게 경고 신호를 보낼 수 있다. 또한, 실시예에서 감지부는 환자 상태 정보 및 욕창방지 매트리스의 모니터링 데이터 분석을 통해, 환자의 낙상 예측을 수행하고, 낙상 예측을 통해 낙상 가능성이 일정 수준 이상으로 산출된 경우, 낙상 예측 결과를 간호 스테이션으로 전달하고, 낙상 예방을 위한 욕창방지 매트리스 제어신호를 생성한다. 또한, 실시예에서 감지부는 환자 상태정보와 욕창방지 매트리스 모니터링 정보를 통해 사용자 민감도, 활 성도, 환자 자세를 포함하는 환자 특성정보를 파악하고, 환자 특성정보를 낙상 예측 모델에 입력하여 낙상 가능 성을 획득한다. 이후, 환자 특성 정보를 욕창 발생 예측 모델에 입력하여, 욕창 발생 가능성을 획득할 수 있다. 예컨대, 감지부는 사용자 민감도, 활성도, 환자 자세 파악한다. 실시예에서 감지부는 환자 상태 정보 와 욕창 방지 매트리스의 모니터링 정보를 분석하여 사용자의 민감도, 활성도 및 환자 자세와 관련된 특성을 파 악한다. 실시예에서 감지부는 환자의 움직임 패턴, 자세의 변화, 압력 분산 요구 등을 분석하여 사용자의 민감도와 활성도를 추론할 수 있다. 또한, 감지부는 사용자의 민감도, 활성도 및 환자 자세와 관련된 특성 을 기반으로 환자 특성 정보를 구성한다. 실시예에서 환자 특성 정보는 환자의 움직임 능력, 근력, 욕창 발생 위험 요인 등을 포함할 수 있다. 이후, 감지부는 낙상 가능성을 예측하기 위해 훈련된 낙상 예측 모델을 통해, 환자의 낙상 가능성을 산출한다. 실시예에서 낙상 예측 모델은 환자의 특성 정보를 입력으로 받아 환자의 낙상 가능성을 평가한다. 예를 들어, 기계 학습 알고리즘을 사용하여 환자의 특성 정보와 이전 낙상 이력, 환자 의 움직임 패턴 등을 기반으로 낙상 가능성을 예측할 수 있다. 또한, 감지부는 욕창 발생 가능성을 예측하 기 위해 훈련된 욕창 발생 예측 모델에 환자 특성 정보를 입력하여, 욕창 발생 가능성을 평가한다. 실시예에서 욕창 발생 예측 모델은 환자의 자세, 압력 분산 요구, 압력 포인트 등과 같은 정보를 사용하여 욕창 발생 가능 성을 예측할 수 있다. 판단부는 욕창방지 매트리스의 모니터링 데이터 분석을 통해, 매트리스 별 고장여부를 판단한다. 실시예에 서 판단부는 욕창 방지 매트리스의 센서나 IoT 장치를 통해 매트리스의 모니터링 데이터를 수집한다. 매트 리스 모니터링 데이터는 매트리스의 다양한 파라미터와 상태를 측정한 정보이다. 이후, 수집된 데이터를 전처리 하여 분석에 적합한 형태로 가공한다. 이 단계에서는 데이터의 노이즈 제거, 이상치 처리, 데이터 정규화 등의 작업을 수행할 수 있다. 전처리된 데이터는 고장 판단 모델에 입력으로 사용된다. 실시예에서 판단부는 고 장 판단 모델을 사용하여 새로운 매트리스의 상태를 평가한다. 예컨대, 판단부는 매트리스의 모니터링 데 이터를 모델에 입력하고, 모델은 입력된 데이터를 기반으로 고장 여부를 예측한다. 예를 들어, 모델은 압력 분 포가 정상 범위를 벗어나거나 특정한 고장 패턴이 나타날 경우 해당 매트리스를 고장으로 판단할 수 있다. 이후, 판단부는 고장 판단 결과를 통보한다. 이는 매트리스 관리자나 유지 보수 담당자 및 간호 스테이션 에 알림을 전송하거나 시스템에 경고 신호를 보내는 등의 방식으로 이루어질 수 있다. 피드백부는 학습된 인공신경망 모델 및 딥러닝 모델을 평가한다. 실시예에서 피드백부는 정확도 (Accuracy), 정밀도 (Precision) 및 재현율 (Recall) 중 적어도 하나를 통해, 인공신경망 모델을 평가할 수 있 다. 정확도는 인공 신경망 모델이 예측한 결과가 실제 결과와 얼마나 일치하는지를 측정하는 지표이다. 정밀도 는 양성으로 예측한 결과 중 실제 양성인 비율을 측정하는 지표이다. 재현율은 실제 양성 중에서 모델이 양성으 로 예측한 비율을 측정하는 지표이다. 실시예에서 피드백부는 인공신경망 모델의 정확도, 정밀도 및 재현 율을 산출하고, 산출된 지표 중 적어도 하나를 기반으로 인공신경망 모델을 평가할 수 있다. 실시예에서 피드백부는 인공신경망 모델의 정확도를 평가 데이터셋을 사용하여 측정할 수 있다. 평가 데이 터셋은 모델이 학습에 사용하지 않은 데이터로 구성되어 있으며, 모델의 성능을 객관적으로 평가하는 데 사용된 다. 실시예에서 피드백부는 평가 데이터셋을 사용하여 인공신경망 모델을 실행하고, 각 입력 데이터에 대 한 인공신경망 모델의 예측 값과 해당 데이터의 실제 정답 값을 비교한다. 이후, 비교 결과를 통해, 모델이 얼마나 정확하게 예측하는지를 측정할 수 있다. 예컨대, 피드백부에서 정확도는 전체 데이터 중에서 모델이 맞게 예측한 데이터의 비율로 계산될 수 있다. 또한, 피드백부는 정밀도와 재현율의 조화 평균으로 계산되는 지표인 정밀도와 재현율의 균형을 나타내는 지표인 F1 스코어(F1 Score)를 산출하고, 산출된 F1 스코어를 기반으로 인공신경망 모델을 평가하고, 분류 모델 의 성능을 그래프로 시각화한 지표인 AUC-ROC 곡선을 생성하고, 생성된 AUC-ROC 곡선을 기반으로 인공신경망 모 델을 평가할 수 있다. 실시예에서 피드백부는 ROC 곡선 아래 면적 (AUC)이 1에 가까울수록 모델의 성능이 좋은 것으로 평가할 수 있다. 또한, 피드백부는 인공신경망 모델의 해석 가능성을 평가할 수 있다. 실시예에서 피드백부는 SHAP (SHapley Additive exPlanations), LIME (Local Interpretable Model-agnostic Explanations) 방법을 통해, 인공신경망 모델의 해석 가능성을 평가한다. SHAP (SHapley Additive exPlanations)는 모델이 예측한 결과에 대한 해석을 제공하는 라이브러리로서, 피드백부는 라이브러리에서 SHAP 값을 추출한다. 실시예에서 피드 백부는 SHAP값 추출을 통해, 모델에 입력된 특성정보가 모델 예측에 얼마나 영향을 미쳤는지를 예측할 수 있다. LIME (Local Interpretable Model-agnostic Explanations) 방법은 개별 샘플에 대한 모델의 예측을 설명하는 방법이다. 실시예에서 피드백부는 LIME 방법을 통해, 샘플을 해석 가능한 모델로 근사하여 각 특성정보의 중요도를 계산한다. 또한, 피드백부는 모델의 내부 가중치와 편향 값을 분석하여 각 특성 변수의 영향력을 추정할 수 있다. 피드백부는 인공신경망 모델의 공정성이 낮거나 차별성을 보이는 경우, 개선 작업을 수행한다. 실시예에서 피드백부는 특정 집단의 데이터가 일정수준 이상 부족한 경우 상기 특정 집단을 대표하는 데이터를 추가로 수집하고, 데이터 전처리 과정을 수행한다. 실시예에서 피드백부는 데이터 정규화, 이상치 제거, 데이터의 배율 조정을 포함하는 데이터 전처리 과정을 수행하여 모델이 불필요한 패턴을 학습하는 것을 방지한다. 또한, 실시예에서 피드백부는 모델 학습 알고리즘에 특정 조건을 추가하여 차별성을 방지하거나, 공정성을 보장 할 수 있다. 실시예에서 피드백부는 공정성 보장을 위해, 혼돈행렬(Confusion Matrix) 분석을 통해, 모델의 예측 결과 를 실제 결과와 비교하여 모델의 성능을 평가한다. 혼돈 행렬(confusion matrix)은 지도 학습에서 모델의 분류 성능을 평가하는 행렬이다. 혼돈 행렬은 모델이 예측한 결과와 실제 결과를 비교하여 분류 결과를 표시한다. 실 시예에서 피드백부는 혼돈행렬 분석을 통해, 각각의 클래스에 대한 정확도와 오분류율을 계산하여 모델의 성능을 평가할 수 있다. 또한, 실시예에서 피드백부는 학습데이터에 대한 시각화 분석을 통해 데이터의 분포를 확인할 수 있도록 한다. 예를 들어, 이미지 데이터의 경우 각 클래스에 대한 이미지 샘플을 시각화 하여 데이터의 다양성과 공정 성을 평가할 수 있다. 또한, 피드백부는 인공신경망 모델의 편향(Bias) 검증을 수행한다. 실시예에서 피드백부는 학습정보 에 대한 편향(Bias) 검증을 통해, 모델이 특정 클래스나 속성에 대해 편향되어 있는지 여부를 확인한다. 이를 위해 피드백부는 각 클래스에 대한 샘플의 수를 비교하거나, 각 클래스에 대한 분류 성능을 평가한다. 또한, 피드백부는 공정성(Fairness) 검증 및 평가 지표 계산을 통해, 학습데이터의 공정성과 다양항을 검 증하고 인공신경망 모델을 개선할 수 있도록 한다. 실시예에서 공정성 검증은 학습정보에 대해 인공신경망 모델 이 성별, 인종, 연령 등의 특정속성에 대해 차별성을 보이는지 여부를 확인하는 것이다. 실시예에서 피드백부 는 각 속성에 대한 샘플의 수를 비교하거나, 각 속성에 대한 분류 성능을 평가하여, 특정 속성에 대한 차 별성 여부를 확인할 수 있다. 또한, 피드백부는 인공신경망 모델의 성능을 평가하기 위한 다양한 지표를 계산한다. 예를 들어, 정확도, 정밀도, 재현율, F1-score 등의 지표를 계산하여 모델의 성능을 평가할 수 있다. 이때, 각 클래스에 대한 지표 를 계산하여 모델의 공정성과 다양성을 평가할 수 있다. 또한, 피드백부는 인공신경망 모델이 실제 환경에서 사용되면서 발생하는 문제점에 대한 피드백을 수집하 고, 수집된 피드백을 인공신경망 모델에 반영하여 인공신경망 모델을 지속적으로 개선한다. 이하에서는 인공지능과 IoMT 기반의 욕창방지 의료 결정지원 방법에 대해서 차례로 설명한다. 실시예에 따른 인 공지능과 IoMT 기반의 욕창방지 의료 결정지원 방법의 작용(기능)은 시스템의 기능과 본질적으로 같은 것이므로도 2 내지 도 4와 중복되는 설명은 생략하도록 한다. 도 5는 실시예에 따른 인공지능과 IoMT 기반의 욕창방지 의료 결정지원 시스템의 신호 흐름도이다. 도 5를 참조하면, S100 단계에서는 욕창방지 매트리스에서 센서로부터 압력, 기울기, 동작상태, 동작속도를 포 함하는 모니터링 데이터 및 환자 상태 정보를 수집하고, 수집된 모니터링 데이터를 서버로 전송한다. S200 단계 에서는 서버에서 욕창방지 매트리스로부터 모니터링 데이터를 수신하고, 욕창 방지 매트리스 각각의 형태와 동 작을 주기적으로 제어하고, 제어 후 각 욕창방지 매트리스의 상태를 확인한다. S300 단계에서는 간호 스테이션 에서 욕창방지 매트리스로부터 환자 상태 정보를 수집하여 모니터링하고, 환자 상태 정보에 따라 욕창방지 매트 리스를 원격제어 한다. 실시예에서 환자 상태 정보는 욕창방지 매트리스에 의해 생성된 환자 모니터링 영상 및 외부 센서로부터 획득한 생체정보를 포함할 수 있다. 실시예에서 생체정보는 심박수, 혈압, 온도, 맥박 등을 포 함할 수 있다. 이상에서와 같은 인공지능과 IoMT 기반의 욕창방지 의료 결정지원 시스템 및 방법은 욕창방지 매트리스로부터 수집한 모니터링 데이터와 환자 정보를 이용하여 욕창 매트리스의 압력, 기울기, 모션 등을 원격 제어하여 움직 일 수 없는 환자의 체위를 주기적으로 변경시킬 수 있다. 이를 통해, 욕창을 예방하고, 의료인의 노동력을 대폭 절감할 수 있다. 또한, 실시예에서는 욕창방지 매트리스로부터 수집된 모니터링 데이터 분석 결과를 통해, 매트리스의 정상 동작 여부를 예측하고 환자의 체위와 상태 변화 정보를 파악하여 환자 관리를 더욱 용이하게 수행할 수 있다. 또한, 실시예에서는 예측된 환자 상태에 따라 욕창 방지 매트리스를 자동 제어함으로써, 거동이 힘든 환자가 보 다 편안한 상태에서 누워 있을 수 있도록 한다."}
{"patent_id": "10-2023-0072268", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "개시된 내용은 예시에 불과하며, 특허청구범위에서 청구하는 청구의 요지를 벗어나지 않고 당해 기술분야에서 통상의 지식을 가진 자에 의하여 다양하게 변경 실시될 수 있으므로, 개시된 내용의 보호범위는 상술한 특정의 실시예에 한정되지 않는다."}
{"patent_id": "10-2023-0072268", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 간호사에 의한 환자 체위 변화 과정을 나타낸 도면 도 2는 실시예에 따른 IoMT 기반의 욕창방지 의료 결정지원 시스템 구성을 나타낸 도면 도 3은 실시예에 따른 욕창방지 매트리스의 데이터 처리 구성을 나타낸 도면 도 4는 실시예에 따른 서버의 데이터 처리 구성을 나타낸 도면 도 5는 실시예에 따른 IoMT 기반의 욕창방지 의료 결정지원 시스템의 신호 흐름도"}
