{"patent_id": "10-2019-0140515", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0054395", "출원번호": "10-2019-0140515", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "길태호"}}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,적어도 하나의 인스트럭션(instruction)을 저장하는 메모리; 및상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서;를 포함하고,상기 프로세서는,상기 적어도 하나의 인스트럭션을 실행함으로써,사용자 입력 데이터로부터 대상 키워드 및 목적 키워드를 획득하고,상기 대상 키워드 및 상기 목적 키워드에 기초하여 복수의 구매 물품 각각에 대한 식별 정보를 획득하고,상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물품 리스트를 획득하는, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 다른 구매 물품에대응되는 식별 정보로 대체하여 상기 구매 물품 리스트를 획득하는, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는,상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 제외한 식별 정보를 포함하는 상기 구매 물품 리스트를 획득하는, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 사용자와 관련된 정보는,사용자의 국적, 연령, 성별, 구매 히스토리 또는 선호 판매자 정보 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,상기 대상 키워드가 음식 이름이고, 상기 목적 키워드가 조리 행위와 관련된 키워드이면, 상기 음식의 조리에공개특허 10-2021-0054395-3-필요한 재료 각각에 대한 식별 정보를 획득하고,상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물품 리스트를 획득하고,상기 사용자와 관련된 정보는,사용자의 국적, 연령, 성별, 구매 히스토리, 선호 판매자 정보, 알러지 정보, 또는 미각 정보 중 적어도 하나를포함하는, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서는,인공 지능 모델을 이용하여 상기 사용자 입력 데이터로부터 대상 키워드 및 목적 키워드를 획득하며,상기 인공 지능 모델은,입력 데이터로부터 물품 구매와 관련된 키워드를 획득하도록 학습된, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,디스플레이;를 더 포함하며,상기 프로세서는,상기 구매 물품 리스트를 디스플레이하도록 상기 디스플레이를 제어하며,사용자 입력에 기초하여 상기 구매 물품 리스트에서 포함된 적어도 하나의 물품에 대응되는 식별 정보를 변경하고,상기 변경된 식별 정보에 기초하여 획득된 구매 물품 리스트를 디스플레이하도록 상기 디스플레이를 제어하는,전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 사용자 입력 데이터는,텍스트 데이터, 이미지 데이터 또는 음성 데이터 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는,상기 사용자 입력 데이터로부터 획득된 텍스트 정보에 대응되는 언어를 식별하고,상기 식별된 언어에 기초하여 상기 복수의 구매 물품 각각에 대한 식별 정보를 획득하는, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2021-0054395-4-제1항에 있어서,상기 프로세서는,상기 구매 물품 리스트에 포함된 구매 물품 각각의 매장 내 위치 정보에 기초하여 상기 구매 물품 리스트에 포함된 구매 물품 각각의 구매 순서를 결정하고,상기 결정된 구매 순서에 기초하여 상기 구매 물품 리스트를 변경하는, 전자 장치."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "적어도 하나의 인스트럭션(instruction)을 저장하는 전자 장치의 제어 방법에 있어서,상기 적어도 하나의 인스트럭션을 실행함으로써, 사용자 입력 데이터로부터 대상 키워드 및 목적 키워드를 획득하는 단계;상기 대상 키워드 및 상기 목적 키워드에 기초하여 복수의 구매 물품 각각에 대한 식별 정보를 획득하는 단계;및상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물품 리스트를 획득하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 구매 물품 리스트를 획득하는 단계는,상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 다른 구매 물품에대응되는 식별 정보로 대체하여 상기 구매 물품 리스트를 획득하는, 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 구매 물품 리스트를 획득하는 단계는,상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 제외한 식별 정보를 포함하는 상기 구매 물품 리스트를 획득하는, 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 사용자와 관련된 정보는,사용자의 국적, 연령, 성별, 구매 히스토리 또는 선호 판매자 정보 중 적어도 하나를 포함하는, 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 식별 정보를 획득하는 단계는,상기 대상 키워드가 음식 이름이고, 상기 목적 키워드가 조리 행위와 관련된 키워드이면, 상기 음식의 조리에필요한 재료 각각에 대한 식별 정보를 획득하고,공개특허 10-2021-0054395-5-상기 구매 물품 리스트를 획득하는 단계는,상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물품 리스트를 획득하고,상기 사용자와 관련된 정보는,사용자의 국적, 연령, 성별, 구매 히스토리, 선호 판매자 정보, 알러지 정보, 또는 미각 정보 중 적어도 하나를포함하는, 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 대상 키워드 및 상기 목적 키워드를 획득하는 단계는,인공 지능 모델을 이용하여 상기 사용자 입력 데이터로부터 대상 키워드 및 목적 키워드를 획득하며,상기 인공 지능 모델은,입력 데이터로부터 물품 구매와 관련된 키워드를 획득하도록 학습된, 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 전자 장치의 제어 방법은,상기 구매 물품 리스트를 디스플레이하며,사용자 입력에 기초하여 상기 구매 물품 리스트에서 포함된 적어도 하나의 물품에 대응되는 식별 정보를 변경하는 단계; 및상기 변경된 식별 정보에 기초하여 획득된 구매 물품 리스트를 디스플레이하는 단계;를 더 포함하는, 제어방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 사용자 입력 데이터는,텍스트 데이터, 이미지 데이터 또는 음성 데이터 중 적어도 하나를 포함하는, 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 식별 정보를 획득하는 단계는,상기 사용자 입력 데이터로부터 획득된 텍스트 정보에 대응되는 언어를 식별하고,상기 식별된 언어에 기초하여 상기 복수의 구매 물품 각각에 대한 식별 정보를 획득하는, 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,공개특허 10-2021-0054395-6-상기 전자 장치의 제어 방법은,상기 구매 물품 리스트에 포함된 구매 물품 각각의 매장 내 위치 정보에 기초하여 상기 구매 물품 리스트에 포함된 구매 물품 각각의 구매 순서를 결정하는 단계; 및상기 결정된 구매 순서에 기초하여 상기 구매 물품 리스트를 변경하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2019-0140515", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 본 전자 장치는 상술한 목적을 달성하기 위한 본 실시 예에 따른 전자 장치는 적어도 하 나의 인스트럭션(instruction)을 저장하는 메모리 및 메모리와 연결되어 전자 장치를 제어하는 프로세서를 포함 하고, 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 사용자 입력 데이터로부터 대상 키워드 및 목적 키 워드를 획득하고, 대상 키워드 및 목적 키워드에 기초하여 복수의 구매 물품 각각에 대한 식별 정보를 획득하고, 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물품 리스트를 획득한다."}
{"patent_id": "10-2019-0140515", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어방법에 관한 것으로, 더욱 상세하게는 하는 사용자 입력 데이터에 기초하여 쇼 핑 정보를 제공하는 전자 장치 및 그 제어방법에 대한 것이다."}
{"patent_id": "10-2019-0140515", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자가 온라인에서 구매 물품을 입력하면 구매 물품을 종합하여 하나의 쇼핑 리스트를 생성하는 서비스 제공 방법이 있을 수 있다. 쇼핑 리스트 제공 서비스는 서비스 제공 장치를 통해 사용자가 구매하고자 하는 복수이 구매 물품에 대한 정보를 종합하여 쇼핑 목록, 쇼핑 경로, 재고 상황 등을 안내할 수 있다. 쇼핑 리스트를 제공받는 경우 사용자는 자신이 구매하고자 했던 많은 물품들을 기억하기 편하며, 쇼핑 경로를 통해 이동한다면 쇼핑 시간을 단축시킬 수 있다. 최근, 쇼핑과 관련하여 다양한 서비스 제공 방법이 개시되고 있다. 하지만, 서비스를 제공하는 서버에서 사용자 의 입력에 기초하여 텍스트 자체에 대한 물품 검색이 이루어진다는 문제점이 있다. 텍스트 자체에 대한 검색이 이루어지는 경우 텍스트에 대응되는 물품이 검색되지 않으면 사용자에게 결과 물품들을 보여줄 수 없는 문제점 이 있다. 또한, 사용자가 입력한 텍스트가 물품이 아닌 경우, 사용자에게 원하는 결과를 제공할 수 없다. 예를 들어, 사용자가 카레 재료를 입력하였다고 가정한다. 사용자는 완성된 카레 물품이 아닌 카레를 조리하는 데 필요한 재료를 찾기를 원할 수 있다. 하지만, 기존 서비스 제공 장치는 카레 재료에 대한 텍스트 정보를 이 용하여 대응되는 제품을 검색할 뿐, 카레를 만드는데 필요한 재료들을 검색해주지 않는 문제점이 있다. 또한, 사용자 입력 데이터에 기초하여 복수의 물품들을 사용자에게 제공함에 있어, 사용자 정보를 반영하지 않 는 문제점이 있을 수 있다. 예를 들어, 사용자가 특정 식품에 대한 알러지가 있는 경우를 가정한다. 일반적인 검색으로는 알러지를 유발하는 특정 식품을 제외시키지 않아 사용자가 실수로 특정 식품을 구매하는 경우가 발 생할 수 있다."}
{"patent_id": "10-2019-0140515", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제를 개선하기 위해 고안된 것으로, 본 개시의 목적은 사용자의 의도를 파악하여 사용자 의 도에 대응되는 쇼핑 정보를 제공 하는 전자 장치 및 그의 제어 방법을 제공함에 있다."}
{"patent_id": "10-2019-0140515", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 실시 예에 따른 전자 장치는 적어도 하나의 인스트럭션(instruction)을 저장하 는 메모리 및 상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서를 포함할 수 있고, 상기 프로세서는 상기 적어도 하나의 인스트럭션을 실행함으로써, 사용자 입력 데이터로부터 대상 키워드 및 목적 키워드를 획득 할 수 있고, 상기 대상 키워드 및 상기 목적 키워드에 기초하여 복수의 구매 물품 각각에 대한 식별 정보를 획 득할 수 있고, 상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 변 경하여 구매 물품 리스트를 획득할 수 있다. 여기서, 상기 프로세서는 상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 다른 구매 물품에 대응되는 식별 정보로 대체하여 상기 구매 물품 리스트를 획득할 수 있다. 또한, 상기 프로세서는 상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 제외한 식별 정보를 포함하는 상기 구매 물품 리스트를 획득할 수 있다. 한편, 상기 사용자와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리 또는 선호 판매자 정보 중 적어 도 하나를 포함할 수 있다. 또한, 상기 프로세서는 상기 대상 키워드가 음식 이름이고, 상기 목적 키워드가 조리 행위와 관련된 키워드이면, 상기 음식의 조리에 필요한 재료 각각에 대한 식별 정보를 획득할 수 있고, 상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물품 리스트를 획득할 수 있고, 상기 사용자와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리, 선호 판매자 정보, 알러지 정 보, 또는 미각 정보 중 적어도 하나를 포함할 수 있다. 한편, 상기 프로세서는 인공 지능 모델을 이용하여 상기 사용자 입력 데이터로부터 대상 키워드 및 목적 키워드 를 획득할 수 있고, 상기 인공 지능 모델은 입력 데이터로부터 물품 구매와 관련된 키워드를 획득하도록 학습될 수 있다. 한편, 전자 장치는 디스플레이를 더 포함할 수 있고, 상기 프로세서는 상기 구매 물품 리스트를 디스플레이하도 록 상기 디스플레이를 제어할 수 있고, 사용자 입력에 기초하여 상기 구매 물품 리스트에서 포함된 적어도 하나 의 물품에 대응되는 식별 정보를 변경할 수 있고, 상기 변경된 식별 정보에 기초하여 획득된 구매 물품 리스트 를 디스플레이하도록 상기 디스플레이를 제어할 수 있다. 한편, 상기 사용자 입력 데이터는 텍스트 데이터, 이미지 데이터 또는 음성 데이터 중 적어도 하나를 포함할 수 있다. 여기서, 상기 프로세서는 상기 사용자 입력 데이터로부터 획득된 텍스트 정보에 대응되는 언어를 식별할 수 있 고, 상기 식별된 언어에 기초하여 상기 복수의 구매 물품 각각에 대한 식별 정보를 획득할 수 있다. 한편, 상기 프로세서는 상기 구매 물품 리스트에 포함된 구매 물품 각각의 매장 내 위치 정보에 기초하여 상기 구매 물품 리스트에 포함된 구매 물품 각각의 구매 순서를 결정할 수 있고, 상기 결정된 구매 순서에 기초하여 상기 구매 물품 리스트를 변경할 수 있다. 본 개시의 일 실시 예에 따른 적어도 하나의 인스트럭션(instruction)을 저장하는 전자 장치의 제어 방법에 있 어서, 상기 적어도 하나의 인스트럭션을 실행함으로써, 사용자 입력 데이터로부터 대상 키워드 및 목적 키워드 를 획득하는 단계, 상기 대상 키워드 및 상기 목적 키워드에 기초하여 복수의 구매 물품 각각에 대한 식별 정보 를 획득하는 단계 및 상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정 보를 변경하여 구매 물품 리스트를 획득하는 단계를 포함할 수 있다. 여기서, 상기 구매 물품 리스트를 획득하는 단계는 상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정 보 중 적어도 하나의 식별 정보를 다른 구매 물품에 대응되는 식별 정보로 대체하여 상기 구매 물품 리스트를 획득할 수 있다. 또한, 상기 구매 물품 리스트를 획득하는 단계는 상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식별 정보를 제외한 식별 정보를 포함하는 상기 구매 물품 리스트를 획득할 수 있다. 한편, 상기 사용자와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리 또는 선호 판매자 정보 중 적어 도 하나를 포함할 수 있다. 한편, 상기 식별 정보를 획득하는 단계는 상기 대상 키워드가 음식 이름이고, 상기 목적 키워드가 조리 행위와 관련된 키워드이면, 상기 음식의 조리에 필요한 재료 각각에 대한 식별 정보를 획득할 수 있고, 상기 구매 물품 리스트를 획득하는 단계는 상기 사용자와 관련된 정보에 기초하여 상기 복수의 식별 정보 중 적어도 하나의 식 별 정보를 변경하여 구매 물품 리스트를 획득할 수 있고, 상기 사용자와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리, 선호 판매자 정보, 알러지 정보, 또는 미각 정보 중 적어도 하나를 포함할 수 있다. 또한, 상기 대상 키워드 및 상기 목적 키워드를 획득하는 단계는 인공 지능 모델을 이용하여 상기 사용자 입력 데이터로부터 대상 키워드 및 목적 키워드를 획득할 수 있고, 상기 인공 지능 모델은 입력 데이터로부터 물품 구매와 관련된 키워드를 획득하도록 학습될 수 있다. 한편, 상기 전자 장치의 제어 방법은 상기 구매 물품 리스트를 디스플레이할 수 있고, 사용자 입력에 기초하여 상기 구매 물품 리스트에서 포함된 적어도 하나의 물품에 대응되는 식별 정보를 변경하는 단계 및 상기 변경된 식별 정보에 기초하여 획득된 구매 물품 리스트를 디스플레이하는 단계를 더 포함할 수 있다.한편, 상기 사용자 입력 데이터는 텍스트 데이터, 이미지 데이터 또는 음성 데이터 중 적어도 하나를 포함할 수 있다. 여기서, 상기 식별 정보를 획득하는 단계는 상기 사용자 입력 데이터로부터 획득된 텍스트 정보에 대응되는 언 어를 식별할 수 있고, 상기 식별된 언어에 기초하여 상기 복수의 구매 물품 각각에 대한 식별 정보를 획득할 수 있다. 한편, 상기 전자 장치의 제어 방법은 상기 구매 물품 리스트에 포함된 구매 물품 각각의 매장 내 위치 정보에 기초하여 상기 구매 물품 리스트에 포함된 구매 물품 각각의 구매 순서를 결정하는 단계 및 상기 결정된 구매 순서에 기초하여 상기 구매 물품 리스트를 변경하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2019-0140515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다.A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 본 명세서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 1은 본 개시의 일 실시 예에 따른 전자 장치를 도시한 블록도이다. 도 1을 참조하면, 전자 장치는 메모리 및 프로세서로 구성될 수 있다. 본 명세서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 데스크탑 PC, 랩탑 PC, PDA, PMP(portable multimedia player), MP3 플레이어 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM)중 적어도 하나를 포함할 수 있다. 메모리는 프로세서에 포함된 롬(ROM)(예를 들어, EEPROM(electrically erasable programmable read- only memory)), 램(RAM) 등의 내부 메모리로 구현되거나, 프로세서와 별도의 메모리로 구현될 수도 있다. 이 경우, 메모리는 데이터 저장 용도에 따라 전자 장치에 임베디드된 메모리 형태로 구현되거나, 전 자 장치에 탈부착이 가능한 메모리 형태로 구현될 수도 있다. 예를 들어, 전자 장치의 구동을 위한 데이터의 경우 전자 장치에 임베디드된 메모리에 저장되고, 전자 장치의 확장 기능을 위한 데이터의 경우 전자 장치에 탈부착이 가능한 메모리에 저장될 수 있다. 한편, 전자 장치에 임베디드된 메모리의 경우 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나로 구현되고, 전자 장 치에 탈부착이 가능한 메모리의 경우 메모리 카드(예를 들어, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 등), USB 포트에 연결 가능한 외부 메모리(예를 들어, USB 메모리) 등과 같은 형태로 구현될 수 있다. 메모리는 적어도 하나의 인스트럭션(instruction)을 저장할 수 있다. 메모리에 저장된 인스트럭션에 기초하여 프로세서는 다양한 동작을 수행할 수 있다. 프로세서는 전자 장치의 전반적인 제어 동작을 수행할 수 있다. 구체적으로, 프로세서는 전자 장치의 전반적인 동작을 제어하는 기능을 한다. 프로세서는 디지털 영상 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크 로 프로세서(microprocessor), GPU(Graphics Processing Unit), AI(Artificial Intelligence) 프로세서, TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세 서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있 고, ASIC(application specific integrated circuit), FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 또한, 프로세서는 메모리에 저장된 컴퓨터 실행가능 명령어(computer executable instructions)를 실행함으로써 다양한 기능을 수행할 수 있다. 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 사용자 입력 데이터로부터 대상 키워드 및 목적 키 워드를 획득할 수 있고, 대상 키워드 및 목적 키워드에 기초하여 복수의 구매 물품 각각에 대한 식별 정보를 획 득할 수 있고, 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구 매 물품 리스트를 획득할 수 있다. 프로세서는 사용자 입력 데이터를 수신할 수 있다. 사용자 입력 데이터는 사용자가 검색을 위해 입력하는 데이터를 의미할 수 있으며, 검색의 목적은 쇼핑, 물품 주문, 쇼핑 리스트 생성일 수 있다. 그리고, 전자 장치 는 전자 장치에 포함된 입출력 인터페이스를 통해 사용자 입력 데이터를 수신할 수 있다. 한편, 사용자 입력 데이터는 텍스트 데이터, 이미지 데이터 또는 음성 데이터 중 적어도 하나를 포함할 수 있다. 사용자 입력 데이터가 텍스트 데이터인 경우, 프로세서는 텍스트 데이터 자체를 기초로 분석을 수행하여 텍스트 데이터에 포함된 구매 물품에 대한 식별 정보를 획득할 수 있다. 사용자 입력 데이터가 이미지 데이터인 경우, 프로세서는 이미지 데이터를 분석하여 이미지 데이터에 포함 된 구매 물품에 대한 식별 정보를 획득할 수 있다. 여기서, 이미지 분석 동작을 위해 프로세서는 이미지 분석과 관련된 인공 지능 모듈을 이용할 수 있다. 구매 물품에 대한 식별 정보가 음성 데이터인 경우 음성 데이터를 분석하기 위하여 프로세서는 음성 인식 동작을 수행하여, 구매 물품에 대한 식별 정보를 획득할 수 있다. 음성 인식 동작을 위해 프로세서는 음성 인식과 관련된 인공 지능 모듈을 이용할 수 있다. 프로세서는 인공 지능 모델을 이용하여 사용자 입력 데이터로부터 대상 키워드 및 목적 키워드를 획득할 수 있고, 인공 지능 모델은 입력 데이터로부터 물품 구매와 관련된 키워드를 획득하도록 학습될 수 있다. 한편, 프로세서는 사용자 입력 데이터를 분석하여 구매 물품 정보에 대한 식별 정보를 획득할 수 있다. 프 로세서는 사용자 입력 데이터를 텍스트 정보로 변환할 수 있다. 프로세서는 변환된 텍스트 정보에 기 초하여 사용자 입력 데이터 안에 포함된 구매 물품을 식별할 수 있다. 그리고, 프로세서는 식별된 구매 물 품과 관련된 식별 정보를 획득할 수 있다. 여기서, 변환된 텍스트 정보는 사용자 입력 데이터에 대응되는 텍스 트 정보로 기재할 수 있다. 구매 물품과 관련된 식별 정보란 사용자 입력 데이터에 대응되는 적어도 하나의 물품에 대한 정보를 의미할 수 있다. 구매 물품에 대한 식별 정보는 상품명, 상표명, 제조회사, 유통 기한, 제조일자, 재고 수량, 식별 번호 중 적어도 하나를 포함할 수 있다. 프로세서는 사용자 입력 데이터를 텍스트 정보로 변환하는 과정에서 인식율을 높이기 위하여 도메인을 한 정할 수 있다. 도메인이란 입력 데이터에 대한 결과를 검색하는데 이용되는 데이터 그룹을 의미할 수 있다. 프 로세서는 상품 구매와 관련된 도메인을 한정하여 분석 동작을 수행할 수 있다. 특정 도메인을 한정하여 분 석 동작을 수행하는 방법은 다양한 주제와 관련된 도메인에 기초하여 분석 동작을 수행하는 경우보다 분석 시간 단축 시키고 상품 구매와 관련된 입력 데이터에 대하여 인식율을 높일 수 있다. 예를 들어, 사용자 입력 데이터 가 “sansung TV”로 잘못 입력되었다고 가정한다. 여기서, 상품 구매와 관련된 도메인으로 한정하는 경우 프로 세서는 “sansung TV”가 아닌 “samsung TV”로 빠르게 분석할 수 있다. 다양한 도메인에 의한 분석 동작 은 “sansung”에 대한 다양한 분야의 검색 결과를 수행하지만, 상품 구매와 관련된 도메인으로 한정된 분석 동 작은 “sansung”이 잘못된 입력임을 빠르게 판단할 수 있다. 한편, 일반적인 검색 엔진에서 다양한 주제와 관련된 도메인이 아닌 특정 도메인을 한정하는 경우 인식률이 떨 어질 수 있다. 하지만, 전자 장치는 구매 목록 리스트를 획득하는 것을 목적으로 하므로 상품 구매와 관련 된 사용자 입력 데이터가 수신되는 경우가 대부분일 수 있다. 상품 구매와 관련되지 않은 사용자 입력 데이터가 수신되는 경우, 인식률이 떨어질 가능성이 있다. 하지만, 본 개시에 따른 전자 장치는 상품 구매와 관련된 검색 기능을 제공하는 것이므로, 상품 구매와 관련되지 않은 사용자 입력 데이터에 대한 인식률이 떨어지는 것 이 전자 장치의 성능과 직접적으로 연관되지 않을 수 있다. 잘못된 사용자 입력 데이터에 대하여 결과를 제공하지 않는 것이 바람직할 수 있기 때문이다. 한편, 프로세서는 사용자 입력 데이터로부터 획득된 텍스트 정보에 대응되는 언어 정보를 식별할 수 있고, 식별된 언어 정보에 기초하여 복수의 구매 물품 각각에 대한 식별 정보를 획득할 수 있다. 여기서, 프로세서는 사용자 입력 데이터에 포함된 텍스트, 이미지 또는 음성 중 적어도 하나가 어느 언어 로 작성된 것인지 판단할 수 있다. 그리고, 프로세서는 사용자 입력 데이터에 대응되는 언어 정보에 기초 하여 구매 물품에 대한 식별 정보를 획득할 수 있다. 프로세서는 언어 정보에 기초하여 서로 다른 구매 물 품에 대한 식별 정보를 획득할 수 있다. 예를 들어, 사용자 입력 데이터의 텍스트 정보가 카레이고 한국어인 경 우, 프로세서는 한국 카레에 대한 식별 정보를 획득할 수 있다. 사용자 입력 데이터의 텍스트 정보가 카레 이고 인도인 경우, 프로세서는 인도 카레에 대한 식별 정보를 획득할 수 있다. 사용자 입력 데이터에 대응되는 언어 정보를 고려하면, 사용자가 원하는 구매 물품을 결과로 제공할 확률이 높 아질 수 있다. 따라서, 사용자의 만족도를 높일 수 있다. 한편, 프로세서는 사용자 입력 데이터가 정확하게 인식되었는지 판단할 수 있다. 사용자 입력 데이터가 정 확하게 인식되었는지 판단하는 것은 사용자의 의도와 다른 구매 물품이 식별된 것인지 판단하는 것을 의미할 수 있다. 사용자 의도와 달리 사용자 입력 데이터가 정확하게 인식되지 않는 이유는 타이핑 실수, 발음 부정확, 이 미지 저화질 등이 있을 수 있다. 프로세서는 사용자 입력 데이터를 텍스트 데이터로 변환하고 변환된 텍스트 데이터의 신뢰도 분석을 수행 할 수 있다. 신뢰도 분석은 텍스트 전체의 완성 단어 판단, 기 저장된 상품 단어 비교 중 적어도 하나에 기초하 여 수행될 수 있다. 신뢰도 분석이 인공 지능 모델에 기초하여 이루어지는 경우, 결과값이 확률값과 함께 획득 될 수 있다. 예를 들어, A데이터를 수신하면, 결과값은 A일 확률 90%, AB일 확률 10%로 획득될 수 있다. 여기서, 획득되는 확률값 중 가장 높은 확률 값이 임계값 이하인 경우, 프로세서는 사용자 입력 데이터가 잘못 입력된 것으로 판단하거나 사용자 입력 데이터가 정확하게 인식되지 않은 것으로 판단할 수 있다. 프로세서는 사용자 입력 데이터가 정확하게 인식되지 않은 것(오인식)으로 식별하면, 사용자 입력 데이터 에 대응되는 텍스트 데이터를 변경할 수 있다. 일 실시 예에 따라, 프로세서는 사용자 입력 데이터가 잘못 입력된 것으로 판단하면, 프로세서는 사 용자 입력 데이터에 대응되는 텍스트 정보를 기 설정된 단어로 자동으로 변경할 수 있다. 예를 들어, “sansung ”에 대한 단어가 입력되면 “samsung”으로 자동으로 변경할 수 있다. 다른 실시 예에 따라, 프로세서는 사용자 입력 데이터가 잘못 입력된 것으로 판단하면, 추천 워드 정보를 제공할 수 있다. 프로세서는 잘못 입력된 사용자 입력 데이터와 유사한 추천 워드 정보를 사용자에게 제공 할 수 있다. 여기서, 추천 워드 정보는 사용자 입력 데이터에 대응되는 텍스트 정보에 기초하여 획득될 수 있다. 예를 들어, “melom”이 입력되었다고 가정한다.“melom”에 대응되는 구매 물품 정보가 인식되지 않으면, 프로세서는 “melom”과 유사한 “melon”, “water melon”, “rock melon” 중 적어도 하나를 선택하도록 가이드하는 UI를 제공할 수 있다. 여기서, 프로세서는 사용자가 이전에 구매한 이력 정보에 기초하여 추천 워드 정보를 획득할 수 있다. 예 를 들어, 사용자가 이전 이력에서 watermelon을 임계값 이상 구매한 것으로 식별되면, 프로세서는 “melom ” 입력에 대하여 “watermelon”이라는 추천 워드 정보를 획득할 수 있다. 또 다른 실시 예에 따라, 프로세서는 사용자 입력 데이터가 잘못 입력된 것으로 판단하면, 사용자가 다시 데이터를 입력하도록 가이드할 수 있다. 여기서, 가이드 방법은 UI제공 또는 음성 알림 제공이 있을 수 있다. 한편, 프로세서는 사용자 입력 데이터에 기초하여 사용자의 의도를 분석할 수 있다. 사용자의 의도 분석이 란, 사용자 입력 데이터가 구매 물품 자체를 구매하기 위하여 입력한 것인지, 특정 목적을 위하여 입력한 것인 지 분석하는 것을 의미할 수 있다. 프로세서는 사용자 입력 데이터는 대상 키워드 또는 목적 키워드 중 적어도 하나를 포함할 수 있다. 여기 서, 대상 키워드는 구매 물품과 관련된 키워드를 의미할 수 있다. 그리고, 목적 키워드는 구매 물품에 대응되는 행위와 관련된 키워드를 의미할 수 있다. 예를 들어, 대상 키워드는 “카레”일 수 있으며, 목적 키워드는 “재 료”일 수 있다. 목적 키워드는 기 저장된 단어일 수 있으며, 재료, 준비, 준비물, 조리, 조리 재료, 조리법, 요리, 요리재료, 요리법, 청소, 청소도구, 청소방법 중 적어도 하나를 포함할 수 있다. 사용자 입력 데이터에 대상 키워드만 존재하는 경우, 프로세서는 사용자가 상품 자체를 주문하는 것으로 판단할 수 있다. 예를 들어, 사용자 입력 데이터가 “카레”인 경우, 프로세서는 “카레”에 대응되는 구 매 물품에 대한 식별 정보를 획득할 수 있다. 또한, 사용자 입력 데이터에 목적 키워드가 포함된 경우, 프로세서는 사용자가 상품 자체를 주문하는 것이 아닌 특정 목적에 대한 구매 물품을 구매하려고 하는 것으로 판단할 수 있다. 예를 들어, 사용자 입력 데이터가 “청소방법”인 경우, 프로세서는 청소 방법과 관련된 다양한 구매 물품에 대한 식별 정보를 획득할 수 있 다. 또한, 사용자 입력 데이터에 대상 키워드 및 목적 키워드가 모두 포함된 경우, 프로세서는 대상 키워드 및 목적 키워드에 기초하여 복수의 구매 물품에 대한 식별 정보를 획득할 수 있다. 구체적으로, 프로세서는 대상 키워드로 목적 키워드를 수행하는 것과 관련된 다양한 구매 물품을 식별할 수 잇다. 일 예로, 대상 키워드 가 “카레”이고 목적 키워드가 “재료”인 경우, 프로세서는 카레를 만들기 위한 재료를 분석하고, 카레 를 만들기 위한 복수의 재료들(“카레 가루”, “감자”, “양파”, “당근”, “햄”)에 대한 식별 정보를 획 득할 수 있다. 다른 예로, 대상 키워드가 “화장실”이고 목적 키워드가 “청소”인 경우, 프로세서는 화 장실을 청소하기 위한 복수의 구매 물품에 대한 식별 정보를 획득할 수 있다. 한편, 프로세서는 사용자 입력 데이터에 대한 분석 결과의 수가 임계값 이상인 경우, 특정 물품군으로 한 정하기 위하여 사용자에게 세부 사항을 결정하도록 유도할 수 있다. 프로세서는 세부 사항을 결정하도록 유도하기 위하여 디스플레이에 UI를 표시할 수 있다. 일 실시 예에 따른 UI는 카테고리 정보를 포함할 수 있다. 여기서, 카테고리는 특정 분류로 그룹화 시킬 수 있는 단어를 의미할 수 있다. 카테고리는 과일 및 채소, 생선 및 육류, 냉동식품, 스낵류, 주방용품, 욕실용품, 음료수, 술 중 적어도 하나일 수 있다. 복수의 카테고리 중 하나의 카테고리가 사용자에 의해 선택되면, 프로세서는 선택된 카테고리에 대응되는 구매 물품에 대한 식 별 정보를 획득할 수 있다. 다른 실시 예에 따른 UI는 제조사 정보를 포함할 수 있다. 복수의 제조사 중 하나의 제조사가 사용자에 의해 선택되면, 프로세서는 선택된 제조사에 기초하여 구매 물품에 대한 식별 정보를 획득할 수 있다. 한편, 대상 키워드 및 목적 키워드에 대한 분석 결과의 수가 임계값 이상인 경우, 프로세서는 분석 결과의 수를 감소시키기 위하여 세부 사항을 결정하도록 유도하기 위하여 디스플레이에 UI를 표시할 수 있다. 일 실시 예에 따른 UI는 대상 키워드 및 목적 키워드에 대한 분석 결과를 줄이기 위하여 대상 또는 목적을 구체적 으로 한정하기 위한 단어일 수 있다. 예를 들어, 사용자 입력 데이터가 “카레 재료”인 것으로 가정한다. 여기 서, 어떤 카레를 만드느냐에 따라 다양한 카레 재료들이 존재할 수 있으며, 분석 결과의 수가 임계값 이상일 수 있다. 예를 들어, 한국식 카레, 인도식 카레, 일본식 카레와 같이 다양한 카레가 있을 수 있으며, 각각의 재료 들이 상이할 수 있다. “카레 재료”에 대한 분석 결과의 수가 임계값 이상이면, 프로세서는 한국식 카레, 인도식 카레, 일본식 카레 중 하나의 카레를 선택하도록 가이드하는 UI를 제공할 수 있다. 한편, 프로세서는 사용자와 관련된 정보에 기초하여 획득된 구매 물품에 대한 식별 정보를 변경할 수 있다. 여기서, 사용자와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리 또는 선호 판매자 정보 중 적어도 하나를 포함할 수 있다. 프로세서는 대상 키워드 및 목적 키워드를 이용하여 복수의 구매 물품에 대한 식별 정보를 획득할 수 있다. 여기서, 프로세서는 획득된 복수의 구매 물품에 대한 식별 정보들을 사용자 정보와 관련된 정보에 기초하여 변경할 수 있다. 예를 들어, 사용자 입력 데이터가 “카레 재료”이고 사용자의 국적인 한국인 경우, 프로세서는 한국식 카레를 만들기 위한 재료들의 식별 정보를 획득할 수 있다. 또한, 프로세서는 대상 키워드가 음식 이름이고, 목적 키워드가 조리 행위와 관련된 키워드이면, 음식의 조리에 필요한 재료 각각에 대한 식별 정보를 획득할 수 있고, 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물품 리스트를 획득할 수 있고, 사용자와 관련된 정보는 사 용자의 국적, 연령, 성별, 구매 히스토리, 선호 판매자 정보, 알러지 정보, 또는 미각 정보 중 적어도 하나를포함할 수 있다. 또한, 프로세서는 사용자 정보에 기초하여 이미 획득하 식별 정보를 변경할 수 있다. 예를 들어, 사용자가 당근 알러지가 있다고 가정한다. 사용자 입력 데이터가 “카레 재료”이고 분석 결과로서 “카레 가루, 감자, 양파, 당근, 햄”에 대한 식별 정보가 획득되었다고 가정한다. 프로세서는 사용자에게 당근 알러지가 있음 을 식별하고, 당근에 대한 구매 물품을 변경할 수 있다. 또한, 프로세서는 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적어도 하나의 식별 정보를 다른 구매 물품에 대응되는 식별 정보로 대체하여 구매 물품 리스트를 획득할 수 있다. 사용자가 당근 알러지가 있는 상술한 가정에서, 프로세서는 당근 대신에 다른 품목으로 변경할 수 있다. 예를 들어, 프로세서는 당 근에 대한 식별 정보를 버섯에 대한 식별 정보로 변경할 수 있다. 결과적으로, 프로세서는 “카레 가루, 감자, 양파, 버섯, 햄”에 대한 식별 정보를 획득하고 획득된 식별 정보에 기초하여 구매 물품 리스트를 생성할 수 있다. 또한, 프로세서는 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적어도 하나의 식별 정보를 제외 한 식별 정보를 포함하는 구매 물품 리스트를 획득할 수 있다. 사용자가 당근 알러지가 있는 상술한 가정에서, 프로세서는 당근에 대한 식별 정보를 삭제할 수 있다. 결과적으로, 프로세서는 “카레 가루, 감자, 양파, 햄”에 대한 식별 정보를 획득하고 획득된 식별 정보에 기초하여 구매 물품 리스트를 생성할 수 있다. 또한, 사용자와 관련된 정보에 기초하여 식별 정보를 변경함에 있어 일 실시 예에 따른 프로세서는 자동으 로 식별 정보를 변경할 수 있다. 메모리에 저장된 사용자와 관련된 정보에 기초하여 프로세서는 기존 획득한 식별 정보를 자동으로 변경할 수 있다. 또한, 사용자와 관련된 정보에 기초하여 식별 정보를 변경함에 있어 일 실시 예에 따른 프로세서는 사용자 에게 식별 정보를 변경하기 위한 UI를 제공할 수 있다. 프로세서는 UI를 통해 사용자의 의사를 다시 한번 확인할 수 있다. 한편, 프로세서는 획득한 구매 물품에 대한 식별 정보에 기초하여 주문을 완료할 것인지 확인하는 UI를 디 스플레이할 수 있다. 사용자의 최종 확인이 수신되면, 프로세서는 확인된 식별 정보에 기초하여 구매 물품 리스트를 생성하고 생성된 구매 물품 리스트를 디스플레이할 수 있다. 또한, 프로세서는 사용자 입력 데이터 입력 단계, 최종 확인 단계, 구매 물품 리스트 생성 단계 또는 구매 물품 리스트 생성 이후 단계 중 어느 하나의 단계에서 획득된 식별 정보를 변경할 수 있다. 여기서, 변경은 대 체, 제외, 추가 중 적어도 하나를 의미할 수 있다. 예를 들어, 사용자의 입력에 기초하여 프로세서는 기존 획득한 구매 물품에 대한 식별 정보를 대체, 제외할 수 있으며, 새로운 구매 물품에 대한 식별 정보를 추가할 수 있다. 또한, 프로세서는 구매 물품 리스트를 디스플레이하도록 디스플레이를 제어할 수 있고, 사용자 입력에 기 초하여 구매 물품 리스트에서 포함된 적어도 하나의 물품에 대응되는 식별 정보를 변경할 수 있고, 변경된 식별 정보에 기초하여 획득된 구매 물품 리스트를 디스플레이하도록 디스플레이를 제어할 수 있다. 한편, 프로세서는 획득된 구매 물품 리스트에 기초하여 쇼핑 순서를 획득할 수 있다. 쇼핑 순서를 결정하 기 위하여 프로세서는 매장 정보, 재고 정보, 구매 물품 정보를 고려할 수 있다. 여기서, 매장 정보는 매장 위치 정보, 매장내 구매 물품들의 배치 위치 정보 또는 영업 시간 정보 중 적어도 하 나를 포함할 수 있다. 여기서, 재고 정보는 구매 물품들의 재고 상황에 대한 정보를 의미할 수 있다. 여기서, 구매 물품 정보는 보관 온도 정보, 무게 정보, 부피 정보, 변형 가능성 정보 중 적어도 하나를 포함할 수 있다. 보관 온도 정보란 구매 물품의 적정 보관 온도를 의미할 수 있으며, 보관 온도 정보에 다라 구매 물품이 실온 보관용, 냉장 보관용, 냉동 보관용으로 구분될 수 있다. 프로세서는 보관 온도 정보에 따라 쇼핑 순서를 결정할 수 있다. 구체적으로, 프로세서는 보관 온도 정보가 낮은 구매 물품을 상대적으로 후순위가 되도록 결정할 수 있다. 보관 온도가 낮은 냉동 식품(예를 들어, 아이스크림)의 경우 바구니에 먼저 담으면, 녹을 가능 성이 있기 때문이다. 무게 정보는 구매 물품의 절대적인 무게 값을 포함할 수 있다. 프로세서은 임계값 이상의 무게값을 갖는 구매 물품을 후순위가 되도록 결정할 수 있다. 무거운 구매 물품을 바구니에 먼저 담으면, 사용자의 손이 아프 거나 다른 쇼핑을 하기에 적합하지 않을 수 있기 때문이다. 단 여기서, 사용자가 이동식 쇼핑 카트를 이용하는 경우 무게 정보는 무시될 수 있다. 부피 정보는 구매 물품의 절대적인 부피 값을 포함할 수 있다. 프로세서는 임계값 이상의 부피값의 갖는 구매 물품을 후순위가 되도록 결정할 수 있다. 부피가 큰 품목을 먼저 바구니에 담으면, 많은 구매 물품을 고르 는 것이 어렵기 때문이다. 변형 가능성 정보는 구매 물품이 변형이 쉬운 제품인지에 대한 정보를 포함할 수 있다. 예를 들어, 바나나, 딸 기와 같은 과일류는 변형이 쉬운 구매 물품에 해당할 수 있다. 프로세서는 변형이 쉬운 구매 물품을 후순 위가 되도록 결정할 수 있다. 변형이 쉬운 구매 물품을 바구니에 먼저 담으면(쇼핑 카트 아래쪽에 위치하면), 추가로 담아지는 구매 물품들에 의하여 변형될 수 있기 때문이다. 또한, 프로세서는 매장 정보, 재고 정보 또는 구매 물품 정보 중 적어도 하나에 기초하여 쇼핑 리스트 및 이동 동선을 제공할 수 있다. 여기서, 이동 동선은 상술한 기준을 적용하는 동시에 최단시간 또는 최단 이동거 리를 기준으로 결정될 수 있다. 또한, 프로세서는 구매 물품 리스트에 포함된 구매 물품 각각의 매장 내 위치 정보에 기초하여 구매 물품 리스트에 포함된 구매 물품 각각의 구매 순서를 결정할 수 있고, 결정된 구매 순서에 기초하여 구매 물품 리스 트를 변경할 수 있다. 또한, 프로세서는 매장 정보에 기초하여 구매 물품이 매장 어느 위치에 배치되어 있는지 식별할 수 있다. 그리고, 프로세서는 구매 물품 각각의 매장 내 위치 정보에 기초하여 구매 물품들의 구매 순서를 분석할 수 있다. 그리고, 기존 구매 물품 리스트의 순서를 분석된 구매 순서에 기초하여 변경할 수 있다. 한편, 프로세서는 구매 물품 리스트에 포함된 총 무게 정보를 획득하여, 배송 방법 또는 포장 방법을 결정 할 수 있다. 여기서, 프로세서는 총 무게 정보를 획득한 이후, 쇼핑 인원 정보를 획득할 수 있다. 쇼핑 인원 정보는 쇼 핑 주체가 되는 인원의 성별, 나이, 인원 수 정보 중 적어도 하나를 포함할 수 있다. 쇼핑 인원 정보에 기초하 여 사용자의 무게 한도가 결정될 수 있다. 예를 들어, 성인 여자의 무게 한도는 10kg 이고 성인 남자의 무게 한 도는 30kg일 수 있다. 각각의 구체적인 값은 사용자의 설정에 의해 변경될 수 있다. 쇼핑 인원 정보가 성인 여 자 1명, 성인 남자 3명인 경우, 총 무게 한도는 100kg일 수 있다. 여기서, 프로세서는 쇼핑 인원 정보 및 총 무게 정보를 비교할 수 있다. 여기서, 구매 물품 리스트에 포함 된 총 무게 정보가 무게 한도를 초과하는 경우, 프로세서는 별도의 배송 방법(택배)이 있는지 확인하거나 사용자에게 일부 품목을 제외하도록 가이드하는 UI를 제공할 수 있다. 또한, 프로세서는 구매 물품 리스트에 포함된 총 무게 정보 및 쇼핑 인원 정보를 획득하여, 포장 방법을 결정할 수 있다. 일 예로, 프로세서는 복수의 상자(또는 비닐 봉지)로 구매 물품을 구분하면서 각각의 상 자들이 균일한 무게가 되도록 구매 물품을 구분할 수 있다. 다른 예로, 프로세서는 사용자의 무게 한도를 고려하여 구매 물품을 구분할 수 있다. 성인 여자 1명, 성인 남자 3명이 쇼핑 인원이고 총 무게 정보가 100kg 이라고 가정한다. 프로세서는 100kg의 구매 물품들을 10kg, 30kg, 30kg, 30kg으로 구분하도록 물품의 구분 위치를 제공할 수 있다. 한편, 일 실시 예에 따른 전자 장치는 이동형 로봇에 적용될 수 있다. 일 예로, 이동형 로봇을 사용자 입 력 데이터를 수신할 수 있다. 일반적으로, 이동형 로봇은 키보드 또는 마이크 중 적어도 하나를 포함할 수 있다. 다른 예로, 이동형 로봇은 외부 단말 장치로부터 사용자 입력 데이터를 수신할 수 있다. 이동형 로봇의 경우, 사용자의 설정에 의해 lock 기능이 활성화 될 수 있으며, lock 기능이 활성화 되어 있는 경우 구매 물품 리스트에 대한 변경이 불가하도록 설정될 수 있다. 도 2는 도 1의 전자 장치의 구체적인 구성을 설명하기 위한 블록도이다. 도 2를 참조하면, 전자 장치는 메모리, 프로세서, 통신 인터페이스, 사용자 인터페이스 , 입출력 인터페이스 및 디스플레이를 포함할 수 있다. 메모리 및 프로세서의 동작 중에서 앞서 설명한 것과 동일한 동작에 대해서는 중복 설명은 생략한다. 프로세서는 메모리에 저장된 각종 프로그램을 이용하여 전자 장치의 동작을 전반적으로 제어한 다. 구체적으로, 프로세서는 RAM, ROM, 메인 CPU, 제1 내지 n 인터페이스, 버스를 포함한다. RAM, ROM, 메인 CPU, 제1 내지 n 인터페이스 등은 버스를 통해 서로 연결될 수 있다. ROM에는 시스템 부팅을 위한 명 령어 세트 등이 저장된다. 턴온 명령이 입력되어 전원이 공급되면, 메인 CPU는 ROM에 저장된 명령어에 따라 메 모리에 저장된 O/S를 RAM에 복사하고, O/S를 실행시켜 시스템을 부팅시킨다. 부팅이 완료되면, 메인 CPU는 메모리에 저장된 각종 어플리케이션 프로그램을 RAM에 복사하고, RAM에 복사된 어플리케이션 프로그램을 실행시켜 각종 동작을 수행한다. 메인 CPU는 메모리에 액세스하여, 메모리에 저장된 O/S를 이용하여 부팅을 수행한다. 그리고, 메모리에 저장된 각종 프로그램, 컨텐츠 데이터 등을 이용하여 다양한 동작을 수행한다. 제1 내지 n 인터페이스는 상술한 각종 구성 요소들과 연결된다. 인터페이스들 중 하나는 네트워크를 통해 외부 장치와 연결되는 네트워크 인터페이스가 될 수도 있다. 통신 인터페이스는 다양한 유형의 통신 방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성이다. 통신 인터페이스는 와이파이 모듈, 블루투스 모듈, 적외선 통신 모듈 및 무선 통신 모듈 등을 포함한다. 여기서, 각 통신 모듈은 적어도 하나의 하드웨어 칩 형태로 구현될 수 있다. 와이파이 모듈, 블루투스 모듈은 각각 WiFi 방식, 블루투스 방식으로 통신을 수행한다. 와이파이 모듈이나 블루 투스 모듈을 이용하는 경우에는SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 적외선 통신 모듈은 시 광선과 밀리미터파 사이에 있는 적외선을 이용하여 근거리에 무선으로 데이터를 전송하 는 적외선 통신(IrDA, infrared Data Association)기술에 따라 통신을 수행한다. 무선 통신 모듈은 상술한 통신 방식 이외에 지그비(zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE-A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 통신을 수행하는 적어도 하나의 통신 칩을 포함할 수 있다. 그 밖에 통신 인터페이스는LAN(Local Area Network) 모듈, 이더넷 모듈, 또는 페어 케이블, 동축 케이블 또는 광섬유 케이블 등을 이용하여 통신을 수행하는 유선 통신 모듈 중 적어도 하나를 포함할 수 있다. 일 예에 따라 통신 인터페이스는 리모컨과 같은 외부 장치 및 외부 서버와 통신하기 위해 동일한 통신 모 듈(예를 들어, Wi-Fi 모듈)을 이용할 수 있다. 다른 예에 따라 통신 인터페이스는 리모컨과 같은 외부 장치 및 외부 서버와 통신하기 위해 상이한 통신 모듈(예를 들어, Wi-Fi 모듈)을 이용할 수 있다. 예를 들어, 통신 인터페이스는 외부 서버와 통신하기 위 해 이더넷 모듈 또는 WiFi 모듈 중 적어도 하나를 이용할 수 있고, 리모컨과 같은 외부 장치와 통신하기 위해 BT 모듈을 이용할 수도 있다. 다만 이는 일 실시 예에 불과하며 통신 인터페이스는 복수의 외부 장치 또는 외부 서버와 통신하는 경우 다양한 통신 모듈 중 적어도 하나의 통신 모듈을 이용할 수 있다. 사용자 인터페이스는 버튼, 터치 패드, 마우스 및 키보드와 같은 장치로 구현되거나, 상술한 디스플레이 기능 및 조작 입력 기능도 함께 수행 가능한 터치 스크린으로도 구현될 수 있다. 여기서, 버튼은 전자 장치 의 본체 외관의 전면부나 측면부, 배면부 등의 임의의 영역에 형성된 기계적 버튼, 터치 패드, 휠 등과 같 은 다양한 유형의 버튼이 될 수 있다. 입출력 인터페이스는 HDMI(High Definition Multimedia Interface), MHL (Mobile High-Definition Link), USB (Universal Serial Bus), DP(Display Port), 썬더볼트(Thunderbolt), VGA(Video Graphics Array) 포트, RGB 포트, D-SUB(D-subminiature), DVI(Digital Visual Interface) 중 어느 하나의 인터페이스일 수 있 다. 입출력 인터페이스는 오디오 및 비디오 신호 중 적어도 하나를 입출력 할 수 있다. 구현 예에 따라, 입출력 인터페이스는 오디오 신호만을 입출력하는 포트와 비디오 신호만을 입출력하는 포 트를 별개의 포트로 포함하거나, 오디오 신호 및 비디오 신호를 모두 입출력하는 하나의 포트로 구현될 수 있다. 전자 장치는 디스플레이를 포함하지 않는 장치로 구현되어, 별도의 디스플레이 장치로 영상 신호를 전송할 수 있다.한편, 전자 장치는 마이크를 포함하는 외부 장치로부터 사용자 음성 신호를 수신할 수 있다. 이 경우, 수 신된 사용자 음성 신호는 디지털 음성 신호일 수 있으나, 구현 예에 따라 아날로그 음성 신호일 수 있다. 일 예 로, 전자 장치는 Bluetooth 또는 Wi-Fi 등의 무선 통신 방법을 통해 사용자 음성 신호를 수신할 수 있다. 여기서, 외부 장치는 원격 제어 장치 또는 스마트폰으로 구현될 수 있다. 전자 장치는 외부 장치로부터 수신된 음성 신호의 음성 인식을 위해, 외부 서버로 해당 음성 신호를 전송 할 수 있다. 이 경우, 외부 장치 및 외부 서버와의 통신을 위한 통신 모듈은 하나로 구현되거나, 별개로 구현될 수 있다. 예 를 들어, 외부 장치와는 Bluetooth 모듈을 이용하여 통신하고, 외부 서버와는 이더넷 모뎀 또는 Wi-Fi모듈을 이 용하여 통신할 수 있다. 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel) 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이내에는 a- si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 한편, 디스플레이는 터치 센서와 결합된 터치 스크린, 플 렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등으로 구현될 수 있다. 또한, 본 개시의 일 실시 예에 따른, 디스플레이는 영상을 출력하는 디스플레이 패널뿐만 아니라, 디스플 레이 패널을 하우징하는 베젤을 포함할 수 있다. 특히, 본 개시의 일 실시 예에 따른, 베젤은 사용자 인터렉션 을 감지하기 위한 터치 센서(미도시)를 포함할 수 있다. 전자 장치는 스피커(미도시)를 포함할 수 있다. 스피커(미도시)는 입출력 인터페이스에서 처리된 각 종 오디오 데이터뿐만 아니라 각종 알림 음이나 음성 메시지 등을 출력하는 구성요소일 수 있다. 전자 장치는 마이크(미도시)를 더 포함할 수 있다. 마이크는 사용자 음성이나 기타 소리를 입력 받아 오디 오 데이터로 변환하기 위한 구성이다. 마이크(미도시)는 활성화 상태에서 사용자의 음성을 수신할 수 있다. 예를 들어, 마이크는 전자 장치의 상 측이나 전면 방향, 측면 방향 등에 일체형으로 형성될 수 있다. 마이크는 아날로그 형태의 사용자 음성을 수집 하는 마이크, 수집된 사용자 음성을 증폭하는 앰프 회로, 증폭된 사용자 음성을 샘플링하여 디지털 신호로 변환 하는 A/D 변환 회로, 변환된 디지털 신호로부터 노이즈 성분을 제거하는 필터 회로 등과 같은 다양한 구성을 포 함할 수 있다. 전자 장치는 사용자의 아날로그 음성 신호가 마이크를 통해 수신되면, 아날로그 음성 신호를 디지털 음성 신호로 변환할 수 있다. 이 경우, 전자 장치는 음성 인식 어플리케이션을 이용하여 디지털 음성 신호에 대 한 음성 인식을 수행할 수 있다. 여기서, 음성 인식 어플리케이션은 상술한 원격 제어 어플리케이션과 동일하거 나, 상이한 어플리케이션일 수 있다. 전자 장치는 디지털 음성 신호에 대한 음성 인식 인식이 수행되면, 음성 인식 결과에 기초하여 원격 제어 어플리케이션을 이용하여 전자 장치을 원격으로 제어할 수 있다. 다 만, 다른 실시 예에 따르면, 스마트 폰은 적외선, 와이파이 또는 블루투스 통신 방식 중 적어도 하나를 이용하 여 변환된 디지털 음성 신호를 전자 장치으로 전송할 수 있다. 이 경우, 전자 장치는 디지털 음성 신 호가 외부 장치로부터 수신되면, 수신된 디지털 음성 신호에 기초하여 음성 인식을 수행하고, 음성 인식 결과에 기초하여 제어 동작을 수행할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치는 음성 인식 서버로 수신된 디지털 음성 신호를 전송할 수 있다. 이 경우, 음성 인식 서버는 STT(Speech To Text)를 이용하여 디지털 음성 신호를 텍스트 정보로 변환할 수 있다. 이 경우, 음성 인식 서버는 텍스트 정보에 대응되는 검색을 수행하기 위하여 다른 서버 또는 전자 장치로 텍스트 정보를 전송할 수 있으며, 경우에 따라서는 직접 검색을 수행하는 것도 가능하다. 한편, 본 개시의 다른 실시 예에 따른 전자 장치는 디지털 음성 신호에 직접 STT(Speech To Text) 기능을 적용하여 텍스트 정보로 변환하고 변환된 텍스트 정보를 외부 서버에 전송할 수도 있다. 도3은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 3을 참조하면, 전자 장치는 사용자 입력 데이터를 수신할 수 있다 (S305). 그리고, 전자 장치는 사용자 입력 데이터를 분석하여 사용자 입력 데이터에 대응되는 구매 물품을 식별할 수 있다 (S310). 그리고, 전자 장치는 식별된 구매 물품에 대한 식별 정보를 획득할 수 있다.한편, 전자 장치는 사용자와 관련된 정보에 기초하여 구매 물품을 변경할 수 있다 (S315). 여기서, 사용자 와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리 또는 선호 판매자 정보 중 적어도 하나를 포함할 수 있다. 예를 들어, 전자 장치는 사용자 입력 데이터에 기초하여 제1 구매 물품을 식별하고, 제1 구매 물 품에 대응되는 식별 정보를 획득할 수 있다. 그리고, 전자 장치는 사용자와 관련된 정보에 기초하여 제1 구매 물품에 대응되는 식별 정보를 변경할 수 있다. 변경이란 대체, 삭제, 추가 등을 의미할 수 있다. 일 실시 예에 따른 전자 장치는 사용자와 관련된 정보에 기초하여 구매 물품을 대체할 수 있다. 전자 장치 는 사용자와 관련된 정보에 기초하여 제1 구매 물품에 대응되는 식별 정보를 제2 구매 물품에 대응되는 식 별 정보로 대체할 수 있다. 다른 실시 예에 따른 전자 장치는 사용자와 관련된 정보에 기초하여 구매 물품을 삭제할 수 있다. 전자 장 치는 사용자 입력 데이터에 기초하여 제1 구매 물품에 대응되는 식별 정보를 삭제할 수 있다. 또 다른 실시 예에 따른 전자 장치는 사용자와 관련된 정보에 기초하여 새로운 구매 물품을 추가할 수 있 다. 전자 장치는 사용자와 관련된 정보에 기초하여 제1 구매 물품과 맵핑된 제2 구매 물품에 대한 식별 정 보를 추가할 수 있다. 전자 장치는 사용자 입력 데이터에 기초하여 적어도 하나의 구매 물품에 대응되는 식별 정보를 획득할 수 있다. 여기서, 식별 정보는 복수의 구매 물품에 대응되는 정보일 수 있다. 그리고, 획득된 식별 정보는 사용자 와 관련된 정보에 기초하여 변경될 수 있다. 그리고, 전자 장치는 최종적으로 구매 물품을 확정할 수 있다. 구매 물품이 확정되면, 전자 장치는 확정된 구매 물품에 기초하여 구매 물품 리스트를 생성할 수 있 다. 그리고, 전자 장치는 생성된 구매 물품 리스트를 사용자에게 제공할 수 있다 (S320). 사용자에게 제공 하는 방법은 구매 물품 리스트를 디스플레이에 표시하는 것일 수 있다. 사용자 입력에 기초하여 전자 장치 는 구매 물품 리스트를 변경할 수 있다. 사용자는 구매 물품 리스트에서 일부 구매 품목을 제외하거나 추 가할 수 있다. 구매 물품 리스트가 사용자에 의해 확정되면, 전자 장치는 구매 물품 리스트에 기초하여 쇼핑 순서를 획득 할 수 있다. 전자 장치는 구매 물품 리스트에 포함된 복수의 구매 물품들의 쇼핑 순서를 획득할 수 있다. 그리고, 전자 장치는 구매 물품 리스트에 기초한 쇼핑 순서를 사용자에게 제공할 수 있다 (S325). 쇼핑 순 서를 제공하는 방법은, 디스플레이에 표시하는 것일 수 있다. 한편, 전자 장치는 구매 물품 리스트에 기초하여 무게 정보를 획득할 수 있다. 구체적으로, 구매 물품 리 스트에 포함된 각각의 구매 물품들의 무게 정보를 획득할 수 있다. 그리고, 획득된 무게 정보에 기초하여 부가 서비스를 제공할 수 있다 (S330). 여기서, 부가 서비스는 사용자의 무게 한도를 고려하여 일부 구매 물품을 제 외하는 서비스 또는 최종 구매한 물품들의 포장 방법을 제공하는 서비스를 제공할 수 있다. 부가 서비스에 대한 구체적인 설명은 도 18 및 도 19에서 후술한다. 도4는 본 개시의 일 실시 예에 따른 사용자 입력 데이터를 인식하는 동작을 설명하기 위한 흐름도이다. 도 4를 참조하면, 전자 장치는 사용자 입력 데이터를 수신할 수 있다 (S405). 그리고, 전자 장치는 수신된 사용자 입력 데이터를 분석하여 텍스트 (또는 텍스트 데이터)로 변환할 수 있다 (S410). 그리고, 전자 장치는 변환된 텍스트가 정상적으로 인식되는지 판단할 수 있다 (S415). 정상적으로 인식되는지에 대한 판 단 기준은 변환된 텍스트에 기초하여 결과값이 획득되는지 여부일 수 있다. 구체적으로, 변환된 텍스트에 기초 하여 검색 결과가 획득되면 정상적으로 인식되는 것이며 변환된 텍스트에 기초하여 검색 결과가 획득되지 않으 면 정상적으로 인식되지 않을 수 있다. 변환된 텍스트가 정상적으로 인식되지 않으면, 전자 장치는 변환된 텍스트를 변환된 텍스트에 대응되는 기 설정된 단어로 자동으로 변경할 수 있다 (S420). 변환된 텍스트가 정상적으로 인식되지 않는 것은 잘못 입력된 단어일 수 있으며, 이러한 잘못된 단어에 맵핑되는 기 설정된 단어들이 메모리에 저장될 수 있다. 변환된 텍스트가 정상적으로 인식되면, 전자 장치는 사용자 입력 데이터에 대응되는 구매 물품을 식별할 수 있다 (S425). 도 5는 텍스트 자동 변환 동작을 설명하기 위한 도면이다. 도 5를 참조하면, 전자 장치는 사용자가 입력한 사용자 입력 데이터에 기초하여 텍스트 데이터를 획득할 수 있다. 전자 장치는 구매 물품과 관련된 서비스를 제공하는 장치에 해당하며, 사용자 입력 데이터에 대 응되는 구매 물품을 식별하는 동작을 수행한다. 따라서, 전자 장치는 사용자 입력 데이터에 대응되는 구매물품을 식별할 수 있다. 전자 장치는 사용자 입력 데이터에 대응되는 구매 물품을 식별하기 위하여 획득된 텍스트 데이터가 정상 인식되는지 판단할 수 있다. 정상 인식 판단 기준은 획득된 텍스트 데이터에 기초하여 구 매 물품이 식별되는지 여부일 수 있다. 사용자 입력 데이터에 의하여 구매 물품이 식별되지 않는다면, 전자 장 치는 사용자 입력 데이터가 정상 인식되지 않은 것으로 판단할 수 있다. 그리고, 사용자 입력 데이터에 대응되는 구매 물품이 식별되지 않으면, 전자 장치는 사용자 입력 데이터가 잘못 입력된 것으로 판단할 수 있다. 그리고, 전자 장치는 사용자 입력 데이터에 대응되는 텍스트를 자동 변환할 수 있다. 여기서, 자동 변환되는 데이터는 메모리 등에 기 저장될 수 있다. 도 5를 참조하면, 사용자가 “sansung TV”를 발화하였다고 가정한다. 전자 장치는 전자 장치에 부착 된 마이크(미도시)를 통해 사용자 입력 데이터(“sansung TV”)를 수신할 수 있다. 그리고, 전자 장치는 수신된 사용자 입력 데이터(음성 데이터)를 텍스트 데이터(“sansung TV”)로 변경할 수 있다. 전자 장치 는 텍스트 데이터(“sansung TV”)에 대응되는 구매 물품이 있는지 식별할 수 있다. 여기서, sansung TV에 대응 되는 구매 물품이 검색되지 않는다고 가정한다. 여기서, 전자 장치는 텍스트 데이터(“sansung TV”)가 잘 못 입력된 것으로 판단할 수 있다. 그리고, 전자 장치는 잘못 입력된 것으로 판단한 텍스트 데이터(“ sansung TV”)를 자동으로 기 설정된 단어(“samsung TV”)로 변경할 수 있다. 여기서, 기 설정된 단어(“ samsung TV”)는 특정 단어(“sansung TV”)와 미리 맵핑된 단어일 수 있다. 구체적으로, 전자 장치는 사 용자들이 잘못 입력하는 단어들을 정확히 입력한 단어들과 맵핑하여 저장하도록 메모리를 제어할 수 있다. 결과적으로, 전자 장치는 텍스트 데이터(“sansung TV”)를 기 설정된 단어(“samsung TV”)로 변경하고, 변경된 단어(“samsung TV”)에 기초하여 구매 물품을 식별할 수 있다. 그리고, 전자 장치는 변경된 단어 에 기초하여 구매 물품을 식별한다는 알림을 UI로 제공할 수 있다. 도 6은 본 개시의 다른 실시 예에 따른 사용자 입력 데이터를 인식하는 동작을 설명하기 위한 흐름도이다. 도 6을 참조하면, 전자 장치는 사용자 입력 데이터를 수신할 수 있다 (S605). 그리고, 전자 장치는 사용자 입력 데이터를 분석하여 텍스트 변환 동작을 수행할 수 있다 (S610). 그리고, 전자 장치는 변환된 텍스트가 정상 인식되었는지 판단할 수 있다 (S615). 여기서, S605, S610, S615 단계는 도 4의 S405, S410, S415 단계와 대응될 수 있으며, 중복되는 설명은 생략한다. 한편, 변환된 텍스트가 정상 인식되지 않은 경우, 전자 장치는 변환된 텍스트에 기초하여 추천 단어를 사 용자에게 제공할 수 있다(S620). 사용자에게 제공된 복수의 추천 단어 중 특정 단어가 선택될 수 있다. 전자 장 치는 특정 단어를 선택 받기 위하여 사용자 입력을 수신할 수 있다(S621). 전자 장치는 적어도 하나 의 추천 단어 중 사용자 입력에 의해 선택된 적어도 하나의 특정 단어를 획득할 수 있다. 그리고, 전자 장치 는 획득된 적어도 하나의 특정 단어에 기초하여 구매 물품을 식별할 수 있다?(S625). 결국 전자 장치(10 0)는 사용자 입력 데이터에 대응되는 단어(사용자에 의해 선택된)에 기초하여 구매 물품을 식별할 수 있다. 도 7은 추천 워드를 제공하는 동작을 설명하기 위한 도면이다. 도 7을 참조하면, 사용자 입력 데이터에 대응되는 구매 물품이 식별되지 않는 경우, 전자 장치는 사용자 입력 데이터에 대응되는 추천 워드를 제공할 수 있다. 그리고, 전자 장치는 사용자에게 적어도 하나의 추 천 워드를 선택 받기 위하여 추천 워드를 UI로 표시할 수 있다. 사용자 입력 데이터(“melom”)인 것으로 가정한다. 전자 장치는 사용자 입력 데이터(“melom”)에 대응되 는 구매 물품을 식별하지 못하는 경우, 사용자 입력 데이터(“melom”)에 대응되는 적어도 하나의 추천 단어(“ melon”, “watermelon”, “rock melon”)를 디스플레이에 표시함으로써 사용자에게 제공할 수 있다. 그 리고, 전자 장치는 사용자 입력에 의하여 선택된 특정 추천 단어를 수신할 수 있다. 그리고, 전자 장치 는 사용자 입력에 의하여 선택된 특정 추천 단어에 기초하여 구매 물품을 식별할 수 있다. 도 8은 언어 정보를 고려하여 구매 물품을 식별하는 방법에 대한 흐름도이다. 도 8을 참조하면, 전자 장치는 사용자 입력 데이터를 수신할 수 있다 (S805). 그리고, 전자 장치는 사용자 입력 데이터에서 언어 정보를 식별할 수 있다 (S810). 여기서, 언어 정보는 특정 국가의 언어, 특정 문 화권의 언어를 의미할 수 있다. 또한, 언어 정보는 음성 언어 또는 문자 언어 중 적어도 하나를 포함할 수 있다. 사용자 입력 데이터가 음성 데이터인 경우, 전자 장치는 사용자 입력 데이터를 분석하여 사용자의 음성이 어느 언어로 발화하였는지 판단할 수 있다. 또한, 사용자 입력 데이터가 타이핑으로 입력된 데이터 혹은 이미지 분석 기술에 의하여 획득된 데이터인 경우, 해당 문자가 어느 언어에 해당하는지 판단할 수 있다. 그리 고, 전자 장치는 판단된 언어에 기초하여 사용자 입력 데이터에 대응되는 구매 물품을 식별할 수 있다(S815). 예를 들어, 전자 장치는 사용자 입력 데이터에 대응되는 언어 정보가 한국어인 것으로 판단할 수 있다. 여 기서, 전자 장치는 한국과 관련된 구매 물품을 위주로 결과를 제공할 수 있다. 만약, 사용자 입력 데이터 에 대응되는 언어 정보가 프랑스어이면, 전자 장치는 프랑스와 관련된 구매 물품을 위주로 결과를 제공할 수 있다. 도 9는 도 8의 일 실시 예를 설명하기 위한 도면이다. 도 9를 참조하면, 전자 장치는 사용자 입력 데이터(“pomme de terre”)를 분석하여 언어 정보를 식별할 수 있다. 전자 장치는 “pomme de terre”가 프랑스어에 해당하는 것으로 판단할 수 있다. 프랑스어 “ pomme de terre”는 감자를 의미한다. 전자 장치는 언어 정보(프랑스어)에 기초하여 사용자 입력 데이터 (“pomme de terre”)를 기초로 구매 물품을 식별할 수 있다. 전자 장치는 감자에 대한 결과를 사용자에게 제공하면서 프랑스와 관련된 구매 물품 결과를 제공할 수 있다. 구체적으로, 사용자 입력 데이터(“pomme de terre”) 및 언어 정보(프랑스어)에 기초하여, 전자 장치는 감자에 대응되는 구매 물품들(A-프랑스감자, B-프랑스감자, C-프랑스감자)을 표시할 수 있다. 도 10은 도 8의 다른 실시 예를 설명하기 위한 도면이다. 도 10을 참조하면, 전자 장치는 사용자 입력 데이터(“potato”)를 분석하여 언어 정보를 식별할 수 있다. 전자 장치는 “potato”가 영어에 해당하는 것으로 판단할 수 있다. 따라서, 전자 장치는 언어 정보 를 영어로 식별할 수 있다. 그리고, 식별된 언어 정보(영어)에 기초하여 구매 물품을 식별할 수 있다. 전자 장 치는 감자에 대한 결과를 사용자에게 제공하면서 영어 국가와 관련된 구매 물품 결과를 제공할 수 있다. 전자 장치는 사용자 입력 데이터(“potato”) 및 언어 정보(영어)에 기초하여 감자에 대응되는 구매 물품들(A-미국감자, B-영국감자, C-호주감자)을 표시할 수 있다. 도 11은 대상 키워드 및 목적 키워드에 기초하여 구매 물품을 식별하는 방법에 대한 흐름도이다. 도 11을 참조하면, 전자 장치는 사용자 입력 데이터를 수신할 수 있다 (S1105). 그리고, 전자 장치는 사용자 입력 데이터에서 대상 키워드 및 목적 키워드를 식별할 수 있다 (S1110). 구체적으로, 전자 장치는 사용자 입력 데이터를 텍스트 데이터로 변환할 수 있으며, 변환된 텍스트 데이터에서 대상 키워드 및 목적 키워 드를 식별할 수 있다. 여기서, 대상 키워드는 구매 물품과 관련된 키워드를 의미할 수 있다. 그리고, 목적 키워드는 구매 물품에 대응 되는 행위와 관련된 키워드를 의미할 수 있다. 예를 들어, 대상 키워드는 “카레”일 수 있으며, 목적 키워드는 “재료”일 수 있다. 목적 키워드는 기 저장된 단어일 수 있으며, 재료, 준비, 준비물, 조리, 조리 재료, 조리 법, 요리, 요리재료, 요리법, 청소, 청소도구, 청소방법 중 적어도 하나를 포함할 수 있다. 전자 장치는 대상 키워드 및 목적 키워드에 기초하여 구매 물품을 식별할 수 있다 (S1115). 한편, 다른 실 시 예에 따라 전자 장치는 목적 키워드만을 기초로 구매 물품을 식별할 수 있다. 이 경우, 대상이 특정되 지 않아 결과값으로 획득되는 구매 물품이 많을 수 있다. 이 경우, 결과값이 임계값 이상인 경우 전자 장치 는 사용자에게 대상 키워드에 대응되는 입력을 가이드하는 UI를 제공할 수 있다. 그리고, 사용자로부터 대 상 키워드에 대응되는 입력이 수신되면, 전자 장치는 대상 키워드 및 목적 키워드에 기초하여 구매 물품을 식별할 수 있다. 도 12는 도 11의 일 실시 예를 설명하기 위한 도면이다. 도 12를 참조하면, 전자 장치는 사용자 입력 데이터에 기초하여 “욕실 청소”라는 텍스트를 수신하였다고 가정한다. 전자 장치는 사용자 입력 데이터(“욕실 청소”)에서 대상 키워드 및 목적 키워드를 식별할 수 있다. 대상 키워드 및 목적 키워드는 메모리에 기 저장된 단어일 수 있으므로, 전자 장치는 사용자 입력 데이터에 포함된 단어들(“욕실”, “청소”)이 어느 키워드에 해당하는지 판단할 수 있다. 최종적으로, 전자 장치는 사용자 입력 데이터(“욕실 청소”)에서 대상 키워드(“욕실”) 및 목적 키워드(“청소”)를 획득할 수 있다. 전자 장치는 대상 키워드(“욕실”) 및 목적 키워드(“청소”)에 기초하여 욕실에서 청소하는데 필요한 복 수의 물품을 식별할 수 있다. 욕실을 청소하는데 필요한 복수의 물품은 이미 메모리에 저장될 수 있다. 전 자 장치는 욕실을 청소하는데 필요한 복수의 물품들(“욕실 솔, 고무 장갑, 물때 제거제, 욕실 스펀지”) 에 대한 정보를 UI를 통해 사용자에게 제공할 수 있다. 여기서, 대상 키워드가 변경되면, 전자 장치는 목적 키워드가 동일하더라도 다른 구매 물품을 식별할 수 있다. 따라서, 대상 키워드 또는 목적 키워드 중 적어도 하나가 달라지면, 전자 장치는 다른 결과를 식별할 수 있다. 도 13은 도 11의 다른 실시 예를 설명하기 위한 도면이다. 도 13을 참조하면, 전자 장치는 사용자 입력 데이터에 기초하여 “카레 재료”라는 텍스트를 수신하였다고 가정한다. 전자 장치는 사용자 입력 데이터(“카레 재료”)에서 대상 키워드 및 목적 키워드를 식별할 수 있다. 대상 키워드 및 목적 키워드는 메모리에 기 저장된 단어일 수 있으므로, 전자 장치는 사용자 입력 데이터에 포함된 단어들(“카레”, “재료”)이 어느 키워드에 해당하는지 판단할 수 있다. 최종적으로, 전자 장치는 사용자 입력 데이터(“카레 재료”)에서 대상 키워드(“카레”) 및 목적 키워드(“재료”)를 획득할 수 있다. 전자 장치는 대상 키워드(“카레”) 및 목적 키워드(“재료”)에 기초하여 카레를 조리하는데 필요한 복수 의 물품을 식별할 수 있다. 전자 장치는 카레를 조리하는데 필요한 복수의 물품들(“카레 가루, 감자, 양 파, 당근, 햄”)에 대한 정보를 UI를 통해 사용자에게 제공할 수 있다. 도 14는 사용자 정보를 고려하여 구매 물품을 식별하는 일 실시 예를 설명하기 위한 도면이다. 도 14을 참조하면, 전자 장치는 도 13의 실시 예에서 사용자 정보를 추가로 고려할 수 있다. 여기서, 사용 자와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리 또는 선호 판매자 정보 중 적어도 하나를 포함 할 수 있다. 도 14의 실시 예에서 사용자와 관련된 정보는 한국국적임을 가정한다. 일 실시 예에 따라, 전자 장치는 대상 키워드(“카레”), 목적 키워드(“재료”) 및 사용자와 관련된 정보 (“한국 국적”)를 모두 고려하여 구매 물품을 식별할 수 있다. 결과적으로, 전자 장치는 “한국식 카레 가루, 감자, 양파, 당근, 햄”을 구매 물품 결과로서 사용자에게 UI로 제공할 수 있다. 다른 실시 예에 따라, 전자 장치는 대상 키워드(“카레”) 및 목적 키워드(“재료”)에 기초하여 카레를 조리하는데 필요한 복수의 물품(“카레 가루, 감자, 양파, 당근, 햄”)을 식별할 수 있다. 그리고, 여기서, 카 레 가루에 대한 구매 물품이 “한국식 카레 가루”, “인도식 카레 가루”, “일본식 카레 가루”가 모두 식별 될 수 있다. 전자 장치는 사용자와 관련된 정보(“한국 국적”)을 고려하여 “인도식 카레 가루” 및 “일 본식 카레 가루”를 검색 결과에서 제외시키고, “한국시 카레 가루”에 대한 정보만을 사용자에게 제공할 수 있다. 결과적으로, 전자 장치는 “한국식 카레 가루, 감자, 양파, 당근, 햄”을 구매 물품 결과로서 사용 자에게 UI로 제공할 수 있다. 도 15는 사용자 정보를 고려하여 구매 물품을 식별하는 다른 실시 예를 설명하기 위한 도면이다. 도 15를 참조하면, 전자 장치는 사용자 정보 중 알러지 정보를 고려하여 구매 물품을 식별할 수 있다. 사 용자가 특정 식품에 대하여 알러지가 있는 경우 해당 식품을 구매하지 않도록 가이드할 수 있다. 사용자가 알러 지 정보를 입력하면, 전자 장치는 알러지 정보에 대응되는 구매 물품을 구매하지 않도록 가이드할 수 있다. 일 실시 예에 따라, 전자 장치는 알러지 정보(“당근 알러지”)에 대응되는 구매 물품(“당근”)을 자동으 로 대체하여 구매 물품에 대한 정보를 UI 로 제공할 수 있다. 예를 들어, 획득된 구매 물품에 당근 알러 지 정보에 대응되는 구매 물품(“당근”) 이 포함되면, 전자 장치는 알러지 정보에 대응되는 구매 물품(“ 당근”) 대신에 대체가 가능한 구매 물품(“버섯”)을 사용자에게 제공할 수 있다. 다른 실시 예에 다라, 전자 장치는 알러지 정보(“당근 알러지”)에 대응되는 구매 물품(“당근”)을 대체 할 것이라는 별도의 확인 UI(미도시)를 제공할 수 있다. 결과적으로, 전자 장치는 대상 키워드(“카레”), 목적 키워드(“재료”) 고려하여 구매 물품(“카레 가루, 감자, 양파, 당근, 햄”)을 식별할 수 있다. 그리고, 식별된 구매 물품(“카레 가루, 감자, 양파, 당근, 햄”)에 사용자와 관련된 정보(“당근 알러지”)에 대응되는 구매 물품(“당근”)이 포함되어 있으면, 전자 장 치는 구매 물품(“당근”)을 다른 대체 물품(“버섯”)으로 변경할 수 있다. 도 16은 사용자 정보를 고려하여 구매 물품을 식별하는 또 다른 실시 예를 설명하기 위한 도면이다. 도 16을 참조하면, 전자 장치는 전자 장치는 대상 키워드(“카레”), 목적 키워드(“재료”) 고려하 여 구매 물품(“카레 가루, 감자, 양파, 당근, 햄”)을 식별할 수 있다. 그리고, 식별된 구매 물품(“카레 가루, 감자, 양파, 당근, 햄”)에 사용자와 관련된 정보(“당근 알러지”)에 대응되는 구매 물품(“당근”)이포함되어 있으면, 전자 장치는 구매 물품(“당근”)을 제외할 수 있다. 도 17은 다양한 키워드를 고려하여 구매 물품을 식별하는 실시 예를 설명하기 위한 도면이다. 도 17을 참조하면, 전자 장치는 사용자 입력 데이터에서 수량 키워드를 획득할 수 있다. 그리고, 전자 장 치는 수량 키워드에 기초하여 구매 물품의 구매 물품의 개수 또는 구매 물품의 용량을 결정할 수 있다. 예 를 들어, 전자 장치는 사용자 입력 데이터(“카레 재료 3인분”)을 수신하면, 전자 장치는 대상 키워 드(“카레”), 목적 키워드(“재료”), 수량 키워드(“3인분”)를 식별할 수 있다. 그리고, 전자 장치는 대상 키워드(“카레”), 목적 키워드(“재료”)에 기초하여 구매 물품을 식별하고, 수량 키워드(“3인분”)에 기초하여 식별된 구매 물품의 개수 또는 용량을 결정할 수 있다. 예를 들어, 전자 장치는 3인분의 카레 재 료가 카레 가루(200g), 감자(500g), 양파(300g), 당근(200g), 햄(500g)이라는 UI를 사용자에게 제공할 수 있다. 수량 키워드에 대응되는 정보가 더 많은 양을 의미하는 것이라면 구매 물품의 개수 또는 용량이 증가 할 수 있다. 예를 들어, 사용자 입력 데이터가 “카레 재료 6인분 인 경우), 전자 장치는 6인분의 카레 재 료가 카레 가루(400g), 감자(1000g), 양파(600g), 당근(400g), 햄(1000g)이라는 UI를 사용자에게 제공할 수 있다. 도 18은 무게 정보를 이용하여 무게 한도를 계산하는 동작을 설명하기 위한 도면이다. 도 18을 참조하면, 전자 장치는 구매 물품에 대한 각각의 무게 정보를 획득하고, 구매 물품의 총 무게 정 보를 획득할 수 있다. 예를 들어, 전자 장치는 쌀 30kg, 물 10kg, TV 20kg, 오렌지 10kg, 맥주 30kg을 획 득한 경우, 총 무게가 100kg을 획득할 수 있다. 여기서, 전자 장치는 사용자의 무게 한도 정보를 획득할 수 있다. 사용자의 무게 한도란 적어도 하나의 인 원이 어느 무게까지 운반이 가능한지 나타내는 정보를 의미할 수 있다. 예를 들어, 성인 남자의 무게 한도는 30kg이고 성인 여자의 무게 한도는 10kg으로 기 설정될 수 있다. 그리고, 전자 장치는 사용자의 무게 한도 정보 및 구매 물품 총 무게 정보를 비교할 수 있다. 그리고, 구 매 물품 총 무게 정보가 사용자의 무게 한도 정보보다 큰 경우, 전자 장치는 구매 물품 중 적어도 하나를 제외할 수 있다. 성인 남자 3명이 운반 가능한 경우를 가정하면, 사용자 무게 정보는 90kg이 될 수 있다. 성인 남자 3명에 대한 정보는 구매 물품을 확정하거나 구매 물품 리스트를 생성한 이후 사용자의 입력에 의해 수신될 수 있다. 구매 물품 총 무게 정보(“100kg”)가 사용자의 무게 한도 정보(“90kg”)보다 큰 경우, 전자 장치는 구매 물품 중 적어도 하나(“물” 또는 “오렌지”)를 제외할 수 있다. 여기서, 전자 장치는 구매 물품 총 무게 정보 (“100kg”)가 사용자의 무게 한도 정보(“90kg”)의 차이값(“10kg)을 고려하여 제외 가능한 물품(“물” 또는 “오렌지”)을 선택적으로 UI(1810,1820)를 통해 사용자에게 제공할 수 있다. 전자 장치는 제외 가능한 물 품을 사용자로부터 입력 받으면 구매 물품에서 선택된 물품을 제외할 수 있다. 도 19는 무게 정보를 이용하여 포장 방법을 결정하는 동작을 설명하기 위한 도면이다. 도 19를 참고하면, 전자 장치는 구매 물품의 총 무게 정보를 획득할 수 있다. 그리고, 전자 장치는 사용자 무게 한도 정보가 구매 물품의 총 무게 정보보다 크지 않으면, 구매 물품들의 분류 방법을 결정할 수 있 다. 분류 방법을 결정하면 구매 물품을 직접 운반해야 하는 경우 균등하게 구매 물품을 나눌 수 있다. 사용자가 구매한 물품 과 그 가격이 쌀(30kg), 물(10kg), TV(20kg), 맥주(30kg)이라고 가정한다. 전자 장치 는 구매 물품들의 총 무게가 90kg 이라고 가정한다. 그리고, 사용자 무게 한도가 성인 남자 3명 (1901,1902,1903) 기준으로 90kg으로 가정한다 (성인 남자당 무게 한도 30kg). 여기서, 전자 장치는 구매 물품들 각각의 무게 정보에 기초하여 구매 물품을 분류할 수 있다. 예를 들어, 전자 장치는 제1 사용자 에 대응되는 구매 물품을 쌀 (30kg)으로 결정하고, 제2 사용자에 대응되는 구매 물품을 TV(20kg), 물(10kg)로 결정하고, 제3 사용자에 대응되는 구매 물품을 맥주(30kg)로 결정할 수 있다. 그리고, 전자 장치는 각 사용자에 대응되는 구매 물품을 UI를 통해 사용자에게 제공할 수 있다. 사용자별로 어느 물품을 운반할 것인지 결정하는 방법은 구매 물품들을 쉽게 운반하는 것에 도움이 될 수 있다. 각 바구니에 대하여 무게가 균등하게 분배 되기 때문에 각 사용자의 무게 한도를 넘지 않기 때문이다. 만약, 임 의로 구매 물품을 분류하는 경우, 특정 바구니에 40kg의 구매 물품이 포함될 수 있으며, 사용자의 무게 한도가 30kg 이므로 특정 사용자는 40kg 바구니를 운반하지 못할 수 있다. 하지만, 상술한 구매 물품 분류에 대한 UI를 제공하면, 상술한 문제점을 해결할 수 있다.도20은 본 개시의 다른 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 20을 참조하면, 본 개시의 일 실시 예에 따른 적어도 하나의 인스트럭션(instruction)을 저장하는 전자 장치 의 제어 방법은 적어도 하나의 인스트럭션을 실행함으로써, 사용자 입력 데이터로부터 대상 키워드 및 목적 키 워드를 획득할 수 있다 (S2005). 그리고, 제어 방법은 대상 키워드 및 목적 키워드에 기초하여 복수의 구매 물품 각각에 대한 식별 정보를 획득 할 수 있다 (S2010). 그리고, 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물품 리스트를 획득할 수 있다 (S2015). 여기서, 구매 물품 리스트를 획득하는 단계(S2015)는 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적 어도 하나의 식별 정보를 다른 구매 물품에 대응되는 식별 정보로 대체하여 구매 물품 리스트를 획득할 수 있다. 또한, 구매 물품 리스트를 획득하는 단계(S2015)는 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적어 도 하나의 식별 정보를 제외한 식별 정보를 포함하는 구매 물품 리스트를 획득할 수 있다. 한편, 사용자와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리 또는 선호 판매자 정보 중 적어도 하 나를 포함할 수 있다. 한편, 식별 정보를 획득하는 단계(S2010)는 대상 키워드가 음식 이름이고, 목적 키워드가 조리 행위와 관련된 키워드이면, 음식의 조리에 필요한 재료 각각에 대한 식별 정보를 획득할 수 있고, 구매 물품 리스트를 획득하 는 단계는 사용자와 관련된 정보에 기초하여 복수의 식별 정보 중 적어도 하나의 식별 정보를 변경하여 구매 물 품 리스트를 획득할 수 있고, 사용자와 관련된 정보는 사용자의 국적, 연령, 성별, 구매 히스토리, 선호 판매자 정보, 알러지 정보, 또는 미각 정보 중 적어도 하나를 포함할 수 있다. 또한, 대상 키워드 및 목적 키워드를 획득하는 단계(S2005)는 인공 지능 모델을 이용하여 사용자 입력 데이터로 부터 대상 키워드 및 목적 키워드를 획득할 수 있고, 인공 지능 모델은 입력 데이터로부터 물품 구매와 관련된 키워드를 획득하도록 학습될 수 있다. 한편, 전자 장치의 제어 방법은 구매 물품 리스트를 디스플레이할 수 있고, 사용자 입력에 기초하여 구매 물품 리스트에서 포함된 적어도 하나의 물품에 대응되는 식별 정보를 변경하는 단계 및 변경된 식별 정보에 기초하여 획득된 구매 물품 리스트를 디스플레이하는 단계를 더 포함할 수 있다. 한편, 사용자 입력 데이터는 텍스트 데이터, 이미지 데이터 또는 음성 데이터 중 적어도 하나를 포함할 수 있다. 여기서, 식별 정보를 획득하는 단계(S2010)는 사용자 입력 데이터로부터 획득된 텍스트 정보에 대응되는 언어를 식별할 수 있고, 식별된 언어에 기초하여 복수의 구매 물품 각각에 대한 식별 정보를 획득할 수 있다. 한편, 전자 장치의 제어 방법은 구매 물품 리스트에 포함된 구매 물품 각각의 매장 내 위치 정보에 기초하여 구 매 물품 리스트에 포함된 구매 물품 각각의 구매 순서를 결정하는 단계 및 결정된 구매 순서에 기초하여 구매 물품 리스트를 변경하는 단계를 더 포함할 수 있다. 한편, 도 20과 같은 전자 장치의 제어 방법은 도 1 또는 도 2의 구성을 가지는 전자 장치 상에서 실행될 수 있으며, 그 밖의 구성을 가지는 전자 장치 상에서도 실행될 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 전자 장치에 설치 가능한 어플리케이션 형태 로 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 전자 장치에 대한 소프트웨어 업그레이드, 또 는 하드웨어 업그레이드 만으로도 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들은 전자 장치에 구비된 임베디드 서버, 또는 전자 장치 및 디스플레이 장치 중 적어도 하나의 외부 서버를 통해 수행되는 것도 가능하다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시 예들에 따른 전자 장치(예: 전자 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서 가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명 령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신호 (signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적 으로 저장됨을 구분하지 않는다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동 작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2019-0140515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2019-0140515", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 전자 장치를 도시한 블록도이다. 도 2는 도 1의 전자 장치의 구체적인 구성을 설명하기 위한 블록도이다. 도3은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도4는 본 개시의 일 실시 예에 따른 사용자 입력 데이터를 인식하는 동작을 설명하기 위한 흐름도이다. 도 5는 텍스트 자동 변환 동작을 설명하기 위한 도면이다. 도 6은 본 개시의 다른 실시 예에 따른 사용자 입력 데이터를 인식하는 동작을 설명하기 위한 흐름도이다. 도 7은 추천 워드를 제공하는 동작을 설명하기 위한 도면이다. 도 8은 언어 정보를 고려하여 구매 물품을 식별하는 방법에 대한 흐름도이다. 도 9는 도 8의 일 실시 예를 설명하기 위한 도면이다. 도 10은 도 8의 다른 실시 예를 설명하기 위한 도면이다. 도 11은 대상 키워드 및 목적 키워드에 기초하여 구매 물품을 식별하는 방법에 대한 흐름도이다. 도 12는 도 11의 일 실시 예를 설명하기 위한 도면이다. 도 13은 도 11의 다른 실시 예를 설명하기 위한 도면이다. 도 14는 사용자 정보를 고려하여 구매 물품을 식별하는 일 실시 예를 설명하기 위한 도면이다. 도 15는 사용자 정보를 고려하여 구매 물품을 식별하는 다른 실시 예를 설명하기 위한 도면이다. 도 16은 사용자 정보를 고려하여 구매 물품을 식별하는 또 다른 실시 예를 설명하기 위한 도면이다. 도 17은 다양한 키워드를 고려하여 구매 물품을 식별하는 실시 예를 설명하기 위한 도면이다. 도 18은 무게 정보를 이용하여 무게 한도를 계산하는 동작을 설명하기 위한 도면이다. 도 19는 무게 정보를 이용하여 포장 방법을 결정하는 동작을 설명하기 위한 도면이다. 도20은 본 개시의 다른 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
