{"patent_id": "10-2019-0150648", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0062428", "출원번호": "10-2019-0150648", "발명의 명칭": "영상 촬영 장치의 원격 제어 방법 및 장치", "출원인": "엘지전자 주식회사", "발명자": "이광용"}}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 발화 음성을 발화 텍스트로 변환하거나 발화 텍스트를 입력 받는 단계;상기 발화 텍스트에 생성적 모델(generative model) 기반의 제 1 학습 모델을 적용하여 상기 발화 텍스트의 컨텍스트(context)에 대응하는 속성을 갖는 영상을 생성하는 단계; 및상기 영상과 상기 발화 텍스트를 외부로 전송하는 단계를 포함하는,원격 제어 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제 1 학습 모델은 텍스트 또는 음성을 입력으로 하여 상기 입력의 컨텍스트(context)에 대응하는 속성을가진 영상을 출력하도록 훈련된 제 1 학습 모델로서, 생성적 적대 신경망(GAN: Generative AdversarialNetwork), 조건부 생성적 적대 신경망(cGAN: conditional GAN), 심층 컨볼루션 GAN(DCGAN: Deep ConvolutionGAN), 오토 인코더(Auto-Encoder) 또는 VAE(Variational Auto-Encoder) 중에서 어느 하나를 포함한 생성적 모델(generative model) 기반의 학습 모델인,원격 제어 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 영상을 생성하는 단계는,상기 발화 텍스트를 단어(word) 벡터와 문장(sentence) 벡터로 변환하는 단계;상기 단어 벡터 및 상기 문장 벡터로부터 각각 단어 어텐션 및 문장 어텐션(attention)을 추정하는 단계; 및생성적 모델 기반의 상기 제 1 학습 모델에서 상기 단어 어텐션 및 상기 문장 어텐션에 기반하여 상기 영상을생성하는 단계를 포함하는,원격 제어 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 단어 어텐션 및 상기 문장 어텐션을 추정하는 단계는,상기 발화 텍스트에서 상기 단어 벡터 및 상기 문장 벡터에 기반하여 두 개 이상의 의도(intent)를 추정하는 단계;상기 두 개 이상의 의도 중 영상 생성을 위한 의도에 가중치를 부여하는 단계; 및상기 가중치에 기반하여 상기 단어 어텐션 및 상기 문장 어텐션을 추정하는 단계를 더 포함하는,공개특허 10-2021-0062428-3-원격 제어 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "텍스트 또는 음성을 포함하는 제 1 입력 및 제 1 영상을 포함하는 제 2 입력을 수신하는 단계;상기 제 1 입력에 기반하여 적어도 하나 이상의 제 2 영상을 촬영하는 단계;상기 제 1 영상과 상기 제 2 영상을 비교하는 단계; 및상기 제 1 영상과 상기 제 2 영상의 비교 결과에 대응하여, 상기 제 2 영상을 전송하는 단계를 포함하고,상기 제 1 영상은,상기 제 1 입력에 생성적 모델(generative model) 기반의 제 1 학습 모델을 적용하여 획득된 영상으로서, 상기제 1 입력의 컨텐스트(context)에 대응하는 속성을 갖는 영상인,영상 촬영 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 제 1 영상과 상기 제 2 영상을 비교하는 단계는,두 장의 영상을 입력으로 하여 영상의 유사성을 추정하도록 훈련된 머신 러닝 기반의 제 2 학습 모델을 상기 제1 영상 및 상기 제 2 영상에 적용하는 단계를 포함하는,영상 촬영 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서,상기 제 1 영상과 상기 제 2 영상을 비교하는 단계는,상기 제 1 영상 및 상기 제 2 영상으로부터 각각 특징 벡터를 추출하는 단계; 및상기 제 1 영상 및 상기 제 2 영상으로부터 추출된 특징 벡터들을 비교하는 단계를 포함하는,영상 촬영 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5 항에 있어서,상기 제 2 영상을 촬영하는 단계는,상기 제 1 입력에 자연어 처리 인공 신경망에 기반한 의도 분류 학습 모델을 적용하는 단계; 및상기 의도 분류 학습 모델의 출력에 기반하여 상기 제 2 영상을 촬영하는 단계를 포함하는,영상 촬영 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,공개특허 10-2021-0062428-4-상기 자연어 처리 인공 신경망은 상기 제 1 입력으로부터 적어도 두 개 이상의 의도(intent)를 출력하도록 훈련된 자연어 처리 인공 신경망인,영상 촬영 장치의 제어 방법."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "사용자의 발화 음성을 발화 텍스트로 변환하거나 발화 텍스트를 입력 받는 제 1 발화 수신부;상기 발화 텍스트에 생성적 모델(generative model) 기반의 제 1 학습 모델을 적용하여 상기 발화 텍스트의 컨텍스트(context)에 대응하는 속성을 갖는 영상을 생성하는 영상 생성부; 및상기 영상과 상기 발화 텍스트를 외부로 전송하는 제 1 전송부를 포함하는,원격 제어 장치."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 제 1 학습 모델은 텍스트 또는 음성을 입력으로 하여 상기 입력의 컨텍스트(context)에 대응하는 속성을가진 영상을 출력하도록 훈련된 제 1 학습 모델로서, 생성적 적대 신경망(GAN: Generative AdversarialNetwork), 조건부 생성적 적대 신경망(cGAN: conditional GAN), 심층 컨볼루션 GAN(DCGAN: Deep ConvolutionGAN), 오토 인코더(Auto-Encoder) 또는 VAE(Variational Auto-Encoder) 중에서 어느 하나를 포함한 생성적 모델(generative model) 기반의 학습 모델인,원격 제어 장치."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서,상기 발화 텍스트를 단어(word) 벡터와 문장(sentence) 벡터로 변환하는 벡터 변환부; 및상기 단어 벡터 및 상기 문장 벡터로부터 각각 단어 어텐션(attention) 및 문장 어텐션을 추정하는 어텐션 추출부를 더 포함하고,상기 영상 생성부는,상기 생성적 모델 기반의 제 1 학습 모델에서 상기 단어 어텐션 및 상기 문장 어텐션에 기반하여 상기 영상을생성하는,원격 제어 장치."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 어텐션 추출부는,상기 발화 텍스트에서 두 개 이상의 의도(intent)를 추정하고, 상기 두 개 이상의 의도 중 영상 생성을 위한 의도에 가중치를 부여하고, 상기 가중치에 기반하여 상기 단어 어텐션 및 상기 문장 어텐션을 추정하는,원격 제어 장치.공개특허 10-2021-0062428-5-청구항 14 텍스트 또는 음성을 포함하는 제 1 입력을 수신하는 제 2 발화 수신부;제 1 영상을 포함하는 제 2 입력을 수신하는 생성영상 수신부;상기 제 1 입력에 기반하여 적어도 하나 이상의 제 2 영상을 촬영하는 영상 촬영부;상기 제 1 영상과 상기 제 2 영상을 비교하는 비교부; 및상기 제 1 영상과 상기 제 2 영상의 비교 결과에 대응하여, 상기 제 2 영상을 전송하는 제 2 전송부를포함하고,상기 제 1 영상은,상기 제 1 입력에 생성적 모델(generative model) 기반의 제 1 학습 모델을 적용하여 획득된 영상으로서, 상기제 1 입력의 컨텐스트(context)에 대응하는 속성을 갖는 영상인,영상 촬영 장치."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 비교부는,두 장의 영상을 입력으로 하여 영상의 유사성을 추정하도록 훈련된 머신 러닝 기반의 제 2 학습 모델을 상기 제1 영상 및 상기 제 2 영상에 적용하는,영상 촬영 장치."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 항에 있어서,상기 비교부는,상기 제 1 영상 및 상기 제 2 영상으로부터 각각 특징 벡터를 추출하고, 상기 제 1 영상 및 상기 제 2 영상으로부터 추출된 특징 벡터들을 비교하여 상기 제 1 영상 및 상기 제 2 영상의 유사성을 판단하는,영상 촬영 장치."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 14 항에 있어서,상기 제 1 입력에 자연어 처리 인공 신경망에 기반한 의도 분류 학습 모델을 적용하는 의도 판별부를 더 포함하고,상기 영상 촬영부는,상기 의도 분류 학습 모델의 출력에 기반하여 상기 제 2 영상을 촬영하는,영상 촬영 장치."}
{"patent_id": "10-2019-0150648", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,공개특허 10-2021-0062428-6-상기 자연어 처리 인공 신경망은 상기 제 1 입력으로부터 적어도 두 개 이상의 의도(intent)를 출력하도록 훈련된 자연어 처리 인공 신경망인,영상 촬영 장치."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사물 인터넷을 위해 연결된 5G 환경에서 인공지능(artificial intelligence, AI) 알고리즘 및/또는 기계학습 (machine learning) 알고리즘을 실행하여 영상 촬영 장치를 원격에서 제어하기 위한 방법 및 장치가 개시된다. 본 발명의 일 실시 예에 따른 원격 제어 장치의 제어 방법은, 사용자의 발화 음성을 발화 텍스트로 변환하거나 (뒷면에 계속)"}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 탑재된 인공지능(artificial intelligence, AI) 알고리즘 및/또는 기계학습(machine learning) 알고 리즘을 실행하여 영상 촬영 장치를 원격에서 제어할 수 있도록 하는 영상 촬영 장치의 원격 제어 방법 및 장치 에 관한 것이다."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "생성적 적대 신경망(GAN: Generative Adversarial Network)이란 두 개의 네트워크로 구성된 심층 신경망 구조 이다. GAN은 생성기(generator)라고 불리는 하나의 신경망이 새로운 데이터 인스턴스(instance)를 생성하고 다 른 하나인 판별기(discriminator)는 데이터의 진위를 평가한다. 즉 판별기는 검토한 각각의 데이터 인스턴스가 실제 트레이닝 데이터 세트인지 아닌지를 판단하게 된다. 따라서 판별기(판별 알고리즘)는 피쳐(feature)를 레 이블(lable)에 매핑(mapping)한다. 즉, 피쳐와 레이블간의 상관관계에만 집중하게 된다. 반면 생성기(생성 알고 리즘)는 이와 반대로 작동한다. 생성 알고리즘은 주어진 특정 피쳐로부터 레이블을 예측하는 대신 주어진 특정 레이블에서 피쳐를 예측하는 방식이다."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 일 과제는, 탑재된 인공지능(artificial intelligence, AI) 알고리즘 및/또는 기계학습(machine learning) 알고리즘을 실행하여 영상 촬영 장치를 원격에서 제어할 수 있도록 하는데 있다. 본 개시의 일 과제는, 서로 다른 장소에 위치한 생성 모델 기반으로 생성된 영상을 원격의 영상 촬영 장치의 제 어를 위한 입력으로 사용하여, 원격의 영상 촬영 장치가 효과적으로 명령 처리를 수행할 수 있도록 하는데 있다. 본 개시의 일 과제는, 생성 모델 기반 기기에서 사용자 발화 음성에 기초하여 영상을 생성하고, 분류 모델 기반 기기에서 촬영된 영상과 생성 모델에서 생성된 영상의 매칭을 수행할 수 있도록 하는데 있다. 본 개시의 일 과제는, 생성 모델 기반 기기에서 발화 텍스트의 컨텍스트에 대응하는 속성을 갖는 영상을 생성하 도록 하는데 있다. 본 개시의 일 과제는, 생성 모델 기반 기기에서 사용자 발화 음성에 기초하여 영상을 생성하고, 내부의 판별 모 델을 통해 생성된 영상과 실제 영상과의 판별을 수행하는 과정을 반복하여 생성 모델의 학습을 수행할 수 있도 록 하는데 있다. 본 개시의 일 과제는, 분류 모델 기반 기기에서 사용자 발화 음성에 기초한 텍스트 분류 및 이미지 분류를 각각 수행할 수 있도록 하는데 있다. 본 개시의 실시예의 목적은 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 영상 촬영 장치의 원격 제어 방법은, 생성 모델 기반 기기에서 탑재된 인공지능 알고리즘 및/또는 기계학습 알고리즘을 실행하여 분류 모델 기반 기기를 원격 제어할 수 있도록 하는데 있다. 구체적으로 본 개시의 일 실시 예에 따른 원격 제어 장치의 제어 방법은, 사용자의 발화 음성을 발화 텍스트로 변환하거나 발화 텍스트를 입력 받는 단계와, 발화 텍스트에 생성적 모델(generative model) 기반의 제 1 학습 모델을 적용하여 발화 텍스트의 컨텍스트(context)에 대응하는 속성을 갖는 영상을 생성하는 단계와, 영상과 발 화 텍스트를 외부로 전송하는 단계를 포함할 수 있다. 본 개시의 일 실시 예에 따른 원격 제어 장치의 제어 방법을 통하여, 생성 모델 기반 기기에서 발화 텍스트의 어텐션(attention)을 추출하여 컨텍스트에 대응하는 속성을 갖는 영상을 생성하고, 내부의 판별 모델을 통해 생 성된 영상과 실제 영상과의 판별을 수행하는 과정을 반복하여 생성 모델의 학습을 수행할 수 있도록 함으로써, 원격 제어 장치의 영상 생성 모델의 성능이 향상되도록 할 수 있다. 또한 본 개시의 일 실시 예에 따른 영상 촬영 장치의 제어 방법은, 텍스트 또는 음성을 포함하는 제 1 입력 및 제 1 영상을 포함하는 제 2 입력을 수신하는 단계와, 제 1 입력에 기반하여 적어도 하나 이상의 제 2 영상을 촬 영하는 단계와, 제 1 영상과 제 2 영상을 비교하는 단계와, 제 1 영상과 제 2 영상의 비교 결과에 대응하여, 제 2 영상을 전송하는 단계를 포함할 수 있다. 본 개시의 일 실시 예에 따른 영상 촬영 장치의 제어 방법을 통하여, 분류 모델 기반 기기에서 사용자 발화 음 성에 기초한 텍스트 분류 및 이미지 분류를 각각 수행할 수 있도록 함으로써, 텍스트 정보와 이미지 정보에 기 초하여 사용자의 명령 의도를 보다 정확하게 판단하도록 할 수 있다. 이 외에도, 본 발명의 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램이 저장된 컴퓨터로 판독 가능한 기록매체가 더 제공될 수 있다. 전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 특허청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시 예에 의하면, 서로 다른 장소에 위치한 생성 모델 기반 기기와 분류 모델 기반 기기가 양방향 통신하면서 기기에 탑재된 인공지능 알고리즘 및/또는 기계학습 알고리즘을 실행하여 원격 제어를 수행함으로써, 음성 명령 처리를 효과적으로 수행하도록 할 수 있다. 또한, 생성 모델 기반의 기기에서 사용자 발화 음성에 기초하여 영상을 생성하고, 분류 모델 기반의 기기에서 촬영된 영상과 생성 모델에서 생성된 영상의 매칭을 수행하여 매칭 결과를 생성 모델 기반 기기에 제공함으로써, 원거리에 위치한 기기를 효과적으로 제어할 수 있도록 하여 사용자의 만족도를 향상시킬 수 있다. 또한, 생성 모델 기반 기기에서 발화 텍스트의 어텐션을 추출하여 컨텍스트에 대응하는 속성을 갖는 영상을 생 성하도록 함으로써, 영상 생성 결과의 정확도를 향상시킬 수 있다. 또한, 생성 모델 기반 기기에서 사용자 발화 음성에 기초하여 영상을 생성하고, 내부의 판별 모델을 통해 생성 된 영상과 실제 영상과의 판별을 수행하는 과정을 반복하여 생성 모델의 학습을 수행할 수 있도록 함으로써, 트 레이닝 데이터로 커버하지 못하는 영역을 보완하여 생성 모델의 성능을 향상시킬 수 있다. 또한, 분류 모델 기반 기기에서 사용자 발화 음성에 기초한 텍스트 분류 및 이미지 분류를 각각 수행하고, 각각 수행한 결과를 조합하여 특정 의도한 동작이 수행되도록 함으로써, 보다 많은 정보로 사용자의 명령 의도를 효 율적이고 정확하게 판단하도록 할 수 있다. 또한, 5G 네트워크 기반 통신을 통해 원격 제어 장치 및 영상 촬영 장치의 제어를 수행함으로써, 신속한 데이터 처리가 가능하므로 원격 제어 장치 및 영상 촬영 장치의 제어 시스템의 성능을 보다 향상시킬 수 있다."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시 예들 을 참조하면 명확해질 것이다. 그러나 본 발명은 아래에서 제시되는 실시 예들로 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 아래에 제시되는 실시 예들은 본 발명의 개시가 완전하도록 하며, 본 발"}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, 포함하 다 또는 가지다 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또 는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 이하, 본 발명에 따른 실시 예들을 첨부된 도면을 참조하여 상세히 설명하기로 하며, 첨부 도면을 참조하여 설 명함에 있어, 동일하거나 대응하는 구성요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하 기로 한다. 또한 본 실시 예에서는 원격 제어 장치가 원격 제어 장치의 제어 시스템 환경에서 구현되고, 영상 촬영 장치가 영상 촬영 장치의 제어 시스템 환경에서 구현될 수 있다. 그러나 본 실시 예에서는, 원격 제어 장치 및 영상 촬 영 장치가 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 환경에서 구현되는 것으로 설명하도록 한다. 도 1은 본 발명의 일 실시 예에 따른 클라우드 네트워크를 포함하는 AI 시스템 기반 원격 제어 장치 및 영상 촬 영 장치의 제어 시스템 환경의 예시도이다. 도 1을 참조하면, 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 환경은 AI 서버, 로봇(30a), 자율 주행 차량(30b), XR 장치(30c), 사용자 단말기(30d) 또는 가전(30e) 및 클라우드 네트워크를 포함할 수 있다. 이 때, 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 환경에서는, AI 서버, 로봇(30a), 자율 주행 차량 (30b), XR 장치(30c), 사용자 단말기(30d) 또는 가전(30e) 중에서 적어도 하나 이상이 클라우드 네트워크와 연결될 수 있다. 여기서, AI 기술이 적용된 로봇(30a), 자율 주행 차량(30b), XR 장치(30c), 사용자 단말기 (30d) 또는 가전(30e) 등을 AI 장치(30a 내지 30e)라 칭할 수 있다. 이때, 로봇(30a)은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계를 의미할 수 있 다. 특히, 환경을 인식하고 스스로 판단하여 동작을 수행하는 기능을 갖는 로봇을 지능형 로봇이라 칭할 수 있다. 로봇(30a)은 사용 목적이나 분야에 따라 산업용, 의료용, 가정용, 군사용 등으로 분류할 수 있다. 자율 주행 차량(30b)은 사용자의 조작 없이 또는 사용자의 최소한의 조작으로 주행하는 차량(Vehicle)을 의미하 며, AutonomousDriving Vehicle이라고도 할 수 있다. 예컨대, 자율 주행에는 주행중인 차선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절하는 기술, 정해진 경로를 따라 자동으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하는 기술 등이 모두 포함될 수 있다. 이때, 자율 주행 차량 은 자율 주행 기능을 가진 로봇으로 볼 수 있다. XR 장치(30c)는 확장 현실(XR: eXtended Reality)을 이용하는 장치로, 확장 현실은 가상 현실(VR: Virtual Reality), 증강 현실(AR: Augmented Reality), 혼합 현실(MR: Mixed Reality)을 총칭한다. VR 기술은 현실 세 계의 객체나 배경 등을 CG 영상으로만 제공하고, AR 기술은 실제 사물 영상 위에 가상으로 만들어진 CG 영상을 함께 제공하며, MR 기술은 현실 세계에 가상 객체들을 섞고 결합시켜서 제공하는 컴퓨터 그래픽 기술이다. XR 기술은 HMD(Head-Mount Display), HUD(Head-Up Display), 휴대폰, 태블릿 PC, 랩탑, 데스크탑, TV, 디지털 사 이니지 등에 적용될 수 있고, XR 기술이 적용된 장치를 XR 장치(XR Device)라 칭할 수 있다. 사용자 단말기(30d)는 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 애플리케이션 또는 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 사이트에 접속한 후 인증 과정을 통하여 원격 제어 장치 및 영상 촬영 장치의 제 어 시스템의 작동 또는 제어를 위한 서비스를 제공받을 수 있다. 본 실시 예에서 인증 과정을 마친 사용자 단말 기(30d)는 원격 제어 장치 및 영상 촬영 장치의 제어 시스템을 작동시키고, 제어할 수 있다. 본 실시 예에서 사 용자 단말기(30d)는 사용자가 조작하는 데스크 탑 컴퓨터, 스마트폰, 노트북, 태블릿 PC, 스마트 TV, 휴대폰, PDA(personal digital assistant), 랩톱, 미디어 플레이어, 마이크로 서버, GPS(global positioning system) 장치, 전자책 단말기, 디지털방송용 단말기, 네비게이션, 키오스크, MP3 플레이어, 디지털 카메라, 가전기기 및 기타 모바일 또는 비모바일 컴퓨팅 장치일 수 있으나, 이에 제한되지 않는다. 또한, 사용자 단말기(30d)는 통신 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 단말기 일 수 있다. 사 용자 단말기(30d)는 상술한 내용에 제한되지 아니하며, 웹 브라우징이 가능한 단말기는 제한 없이 차용될 수 있 다. 가전(30e)은 가정 내 구비되는 모든 전자 디바이스 중 어느 하나를 포함할 수 있으며, 특히 음성인식, 인공지능 등이 구현 가능한 단말, 오디오 신호 및 비디오 신호 중 하나 이상을 출력하는 단말 등을 포함할 수 있다. 또한 가전(30e)은 특정 전자 디바이스에 국한되지 않고 다양한 홈 어플라이언스(예를 들어, 세탁기, 건조기, 의류 처 리 장치, 에어컨, 김치 냉장고 등)를 포함할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, 원격 제어 장치 및 영상 촬영 장치 의 제어 시스템 환경을 구성하는 각 장치들(30a 내지 30e, 20)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(30a 내지 30e, 20)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않고 직접 서로 통신할 수도 있다. 이러한 클라우드 네트워크는 예컨대 LANs(local area networks), WANs(Wide area networks), MANs(metropolitan area networks), ISDNs(integrated service digital networks) 등의 유선 네트워크나, 무선 LANs, CDMA, 블루투스, 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것 은 아니다. 또한 클라우드 네트워크는 근거리 통신 및/또는 원거리 통신을 이용하여 정보를 송수신할 수 있 다. 여기서 근거리 통신은 블루투스(bluetooth), RFID(radio frequency identification), 적외선 통신(IrDA, infrared data association), UWB(ultra-wideband), ZigBee, Wi-Fi(Wireless fidelity) 기술을 포함할 수 있 고, 원거리 통신은 CDMA(code division multiple access), FDMA(frequency division multiple access), TDMA(time division multiple access), OFDMA(orthogonal frequency division multiple access), SC- FDMA(single carrier frequency division multiple access) 기술을 포함할 수 있다. 또한, 클라우드 네트워크는 허브, 브리지, 라우터, 스위치 및 게이트웨이와 같은 네트워크 요소들의 연결을 포함할 수 있다. 클라우드 네트워크는 인터넷과 같은 공용 네트워크 및 안전한 기업 사설 네트워크와 같은 사설 네트워크를 비롯한 하나 이상의 연결된 네트워크들, 예컨대 다중 네트워크 환경을 포함할 수 있다. 클라우 드 네트워크에의 액세스는 하나 이상의 유선 또는 무선 액세스 네트워크들을 통해 제공될 수 있다. 더 나아 가 클라우드 네트워크는 사물 등 분산된 구성 요소들 간에 정보를 주고받아 처리하는 IoT(Internet of Things, 사물인터넷) 망 및/또는 5G 통신을 지원할 수 있다.AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. 또한, AI 서버는 각종 인공 지능 알고리즘을 적용하는데 필요한 빅데이터와, 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 환경을 동작시키는 데이터를 제공하는 데이터베이스 서버일 수 있다. 그 밖에 AI 서버 는 사용자 단말기(30d)에 설치된 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 애플리케이션 또는 원격 제 어 장치 및 영상 촬영 장치의 제어 시스템 웹 브라우저를 이용하여 원격 제어 장치 및 영상 촬영 장치의 제어 시스템의 동작을 원격에서 제어할 수 있도록 하는 웹 서버 또는 애플리케이션 서버를 포함할 수 있다. 또한, AI 서버는 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 환경을 구성하는 AI 장치들인 로봇 (30a), 자율 주행 차량(30b), XR 장치(30c), 사용자 단말기(30d) 또는 가전(30e) 중에서 적어도 하나 이상과 클 라우드 네트워크를 통하여 연결되고, 연결된 AI 장치들(30a 내지 30e)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이때, AI 서버는 AI 장치(30a 내지 30e)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학 습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(30a 내지 30e)에 전송할 수 있다. 이때, AI 서버는 AI 장치(30a 내지 30e)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결 과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치(30a 내지 30e)로 전송할 수 있다. 또는, AI 장치(30a 내지 30e)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. 여기서 인공 지능(artificial intelligence, AI)은, 인간의 지능으로 할 수 있는 사고, 학습, 자기계발 등을 컴 퓨터가 할 수 있도록 하는 방법을 연구하는 컴퓨터 공학 및 정보기술의 한 분야로, 컴퓨터가 인간의 지능적인 행동을 모방할 수 있도록 하는 것을 의미할 수 있다. 또한, 인공 지능은 그 자체로 존재하는 것이 아니라, 컴퓨터 과학의 다른 분야와 직간접적으로 많은 관련을 맺 고 있다. 특히 현대에는 정보기술의 여러 분야에서 인공 지능적 요소를 도입하여, 그 분야의 문제 풀이에 활용 하려는 시도가 매우 활발하게 이루어지고 있다. 머신 러닝(machine learning)은 인공 지능의 한 분야로, 컴퓨터에 명시적인 프로그램 없이 배울 수 있는 능력을 부여하는 연구 분야를 포함할 수 있다. 구체적으로 머신 러닝은, 경험적 데이터를 기반으로 학습을 하고 예측을 수행하고 스스로의 성능을 향상시키는 시스템과 이를 위한 알고리즘을 연구하고 구축하는 기술이라 할 수 있다. 머신 러닝의 알고리즘들은 엄격하게 정해진 정적인 프로그램 명령들을 수행하는 것이라기 보다, 입력 데이터를 기반으로 예측이나 결정을 이끌어내기 위해 특정한 모델을 구축하는 방식을 취할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 통신 환경을 개략적으로 설명하기 위하여 도시한 도면이다. 도 1에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 2를 참조하면, 원격 제어 장치 및 영상 촬영 장치의 제어 시스템은 원격 제어 장치, 영상 촬영 장치 , 서버 및 네트워크를 포함할 수 있다. 원격 제어 장치, 영상 촬영 장치 및 서버 는 5G 통신 환경에서 서로 연결될 수 있다. 본 실시 예에서, 원격 제어 장치 및 영상 촬영 장치의 제어 시스템은 사용자의 발화 음성을 발화 텍스트로 변환 하거나 발화 텍스트를 입력 받는 원격 제어 장치와, 텍스트 또는 음성을 포함하는 제 1 입력 및 제 1 영상 을 포함하는 제 2 입력을 수신하고, 제 1 입력에 기반하여 적어도 하나 이상의 제 2 영상을 촬영하는 영상 촬영 장치를 포함할 수 있다. 또한 원격 제어 장치 및 영상 촬영 장치의 제어 시스템은 원격 제어 장치를 통해 입력 받은 발화 텍스트에 생성적 모델(generative model) 기반의 제 1 학습 모델을 적용하여 발화 텍스트 의 컨텍스트(context)에 대응하는 속성을 갖는 영상을 생성하고, 영상과 발화 텍스트를 영상 촬영 장치로 전송하는 서버를 포함할 수 있다. 또한 서버는 제 1 영상과 제 2 영상을 비교하고, 제 1 영상과 상기 제 2 영상의 비교 결과에 대응하여, 제 2 영상을 원격 제어 장치에 전송할 수 있다. 다만, 본 실시 예에서는, 원격 제어 장치가 발화 텍스트에 생성적 모델(generative model) 기반의 제 1 학 습 모델을 적용하여 발화 텍스트의 컨텍스트(context)에 대응하는 속성을 갖는 영상을 생성하고, 영상과 발화 텍스트를 영상 촬영 장치 및/또는 서버로 전송할 수 있다. 그리고 영상 촬영 장치가 제 1 영상 과 제 2 영상을 비교하고, 제 1 영상과 제 2 영상의 비교 결과에 대응하여, 제 2 영상을 원격 제어 장치 및/또는 서버에 전송할 수 있다. 즉 본 실시 예는, 서로 다른 장소에 위치하는 원격 제어 장치 및 영상 촬영 장치에서 하나의 음성 입 력을 각각 수신하고, 원격 제어 장치에서는 텍스트 투 이미지로 바꿀 수 있는 생성 모델을 포함하여, 입력 된 음성에 대응하여 이미지를 생성할 수 있다. 그리고 영상 촬영 장치에서는 원격 제어 장치로부터음성 입력과 함께 원격 제어 장치에서 생성된 이미지를 같이 입력 데이터로 수신하여 이를 분류 모델을 통 해 결과를 출력하고 액션 실행까지 완료한 후 결과를 다시 원격 제어 장치에 리턴 할 수 있다. 즉 본 실시 예는, 이미지 생성 모델과 음성 인식 모델을 결합한 원격 제어 장치에서 원거리에 떨어져 있는 영상 촬영 장치를 제어할 수 있는 것에 관한 것이다. 즉 본 실시 예는, 떨어진 두 장소에서 두 개의 머신 러닝 모델 로 구성되어, 각각 한쪽은 생성모델(Generative)이고 다른 한쪽은 분류모델(Discriminative)로 결합되어 양방향 통신하면서 음성명령 처리를 매우 효과적으로 처리할 수 있는 기기에 관한 것이다. 보다 구체적으로, 원격 제어 장치는 음성 인식 모델 및 제 1 학습 모델을 포함하는 것으로, 예를 들어, 인 공지능(AI) 기능이 탑재된 스마트폰, 인공지능 스피커 또는 커뮤니케이션 로봇 등과 같은 음성 인식 기능을 수 행할 수 있는 다양한 전자 기기들을 포함할 수 있다. 이때 제 1 학습 모델은 텍스트를 이미지로 생성 가능하도록 훈련된 이미지 생성 모델일 수 있다. 즉 본 실시 예 에서 원격 제어 장치는 사용자 발화 음성을 입력 받아 음성 인식을 수행하여 발화 텍스트로 변환하고, 발 화 텍스트를 기반으로 하여 이미지를 생성할 수 있다. 다만 본 실시 예에서는 외부 기기로부터 변환된 발화 텍 스트가 입력되거나, 사용자로부터 텍스트 자체가 입력될 수 있다. 본 실시 예에서, 음성 인식은 사용자의 발화 정보를 수신하고, 인식 및 분석을 통하여 음성 인식 서비스를 제공 하는 일련의 과정을 의미할 수 있다. 여기서 음성 인식 서비스라 함은, 사용자의 발화 정보를 수신하여 기동어 및 발화 음성을 구별하고, 발화 음성에 대한 음성 인식 처리 결과를 사용자가 인지할 수 있도록 출력하는 것을 포함할 수 있다. 본 실시 예에서, 발화 정보는 기동어와 발화 음성을 포함할 수 있다. 기동어는 원격 제어 장치의 음성 인 식 기능을 활성화 시키는 특정 명령어로서, 웨이크업 워드(wake-up word)로 명명될 수 있다. 발화 정보에 기동 어가 포함되어 있어야 음성 인식 기능이 활성화 될 수 있고, 발화 정보에 기동어가 포함되어 있지 않은 경우 음 성 인식 기능이 비활성화(예를 들어, 슬립 모드) 상태를 유지할 수 있다. 이러한 기동어는 기설정되어 후술하는 메모리(도 4의 150)에 저장될 수 있다. 또한 발화 음성은 기동어에 의해 원격 제어 장치의 음성 인식 기능이 활성화된 후에 처리되는 것으로서, 원격 제어 장치가 실질적으로 처리하여 출력을 생성할 수 있는 음성 명령어를 포함할 수 있다. 예를 들어, 사용자의 발화 정보가 \"하이 엘지, 아이를 좀 찾아줘\"인 경우, 기동어는 \"하이 엘지\"일 수 있고, 발화 음성은 \"아이를 좀 찾아줘\"일 수 있다. 원격 제어 장치는 사용자의 발화 정보로부터 기동어의 존재를 판단하고, 발화 음성을 분석하여 원격 제어 장치를 제어할 수 있을 뿐만 아니라 영상 촬영 장치가 동작하도록 제어할 수 있다. 이때, 원격 제어 장치는 사용자의 발화 음성을 사용자 발화 텍스트로 변환할 수 있다. 예를 들어, 원격 제 어 장치는 STT(Speech to Text) 알고리즘을 통해 발화 음성을 발화 텍스트로 변환할 수 있다. 그리고 원격 제어 장치는 텍스트로 변경된 발화자의 명령에 자연어 처리를 수행하여 명령의 의미를 분석하고, 이를 통 해 발화 텍스트에 대응하는 응답 메시지를 생성할 수 있다. 다만 본 실시 예에서, 원격 제어 장치는 발화 텍스트를 기반으로 이미지를 생성하는 과정을 수행할 수 있 으며, 발화 텍스트를 영상 촬영 장치에 전송할 수 있다. 원격 제어 장치는 발화 텍스트에 생성적 모델 기반의 제 1 학습 모델을 적용하여 발화 텍스트의 컨텍스트 에 대응하는 속성을 갖는 영상을 생성할 수 있다. 이때, 제 1 학습 모델은 텍스트 또는 음성을 입력으로 하여 입력의 컨텍스트에 대응하는 속성을 가진 영상을 출력하도록 훈련된 제 1 학습 모델로서, 생성적 적대 신경망 (GAN: Generative Adversarial Network), 조건부 생성적 적대 신경망(cGAN: conditional GAN), 심층 컨볼루션 GAN(DCGAN: Deep Convolution GAN), 오토 인코더(Auto-Encoder) 또는 VAE(Variational Auto-Encoder) 중에서 어느 하나를 포함한 생성적 모델(generative model) 기반의 학습 모델일 수 있다. 여기서, 생성적 적대 신경망 은 생성기(generator)와 판별기(discriminator), 두 개의 서로 다른 인공지능이 경쟁하며 성능을 개선하는 머신 러닝 방법이다. 이 경우 생성기는 새로운 데이터를 창조하는 모형으로, 원본 데이터를 기반으로 새로운 데이터 를 생성할 수 있다. 즉 생성기는 임의의 랜덤(정규분포) 데이터로부터 내가 원하는 특정 분포의 데이터를 만들 어 내는 딥러닝 기법이다. 또한 판별기는 데이터의 패턴을 인식하는 모형으로, 입력된 데이터가 원본 데이터인 지 또는 생성기에서 생성한 새로운 데이터인지 여부를 감별하는 역할을 수행할 수 있다. 즉 판별기는 특정 이미 지나 텍스트 데이터(특정 데이터 분포)를 입력으로 받아서 그것이 무엇인지 분류하는 딥러닝 기법이다. 그리고 생성기는 판별기를 속이지 못한 데이터를 입력 받아 학습하며, 판별기는 생성기로부터 속은 데이터를 입력 받아학습할 수 있다. 이에 따라 생성기는 판별기를 최대한 잘 속이도록 진화할 수 있고, 판별기는 원본 데이터와 생 성기에 의해 생성된 데이터를 잘 구분하도록 진화할 수 있다. 즉 본 실시 예에서는, 생성기는 텍스트 또는 음성을 입력으로 하여 입력의 컨텍스트에 대응하는 속성을 가진 가 짜 영상 데이터를 생성할 수 있다. 그리고 판별기는 영상 데이터가 입력되면 기 입력된 훈련 데이터인지 또는 생성된 영상 데이터인지 판별할 수 있다. 여기서, 컨텍스트는 사용자가 명령을 발화한 때(moment)의 사용자의 상황 정보를 의미할 수 있다. 즉, 컨텍스트 는 사용자가 어떠한 상황에서 해당 명령을 발화하였는 지를 나타내는 정보이다. 특히, 사용자의 현재 컨텍스트 정보는 사용자가 음성 입력을 발화한 때의 사용자의 상황 정보를 의미할 수 있다. 예를 들어 원격 제어 장치 가 음성 입력을 입력인터페이스(도 4의 120)로 직접 획득한 경우 현재 컨텍스트 정보는 음성 입력을 획득 한 때의 사용자의 상황 정보를 의미할 수 있다. 원격 제어 장치가 음성 입력을 제 1 통신부(도 4의 110)를 통해 외부 전자 기기로부터 수신한 경우, 사용자의 현재 컨텍스트 정보는 외부 전자 기기가 음성 입력을 획득한 때의 사용자의 상황 정보를 포함할 수 있다. 또한, 컨텍스트 정보는 사용자의 상황을 나타내는 다양한 유형의 정보를 포함할 수 있다. 예를 들어, 사용자의 현재 컨텍스트 정보는 사용자가 음성 입력을 발화한 시간, 사용자가 음성 입력을 발화한 장소, 사용자가 이동 중인지 여부, 사용자의 이동 속도 및 사용자가 사용 중인 디바이스에 대한 정보 중 적어도 하나를 포함할 수 있 다. 원격 제어 장치는 제 1 센싱부(도 4의 160)를 통해 사용자의 현재 컨텍스트 정보를 수집 및/또는 제 1 통신부를 통해 사용자가 소지한 전자 기기로부터 사용자의 현재 컨텍스트 정보를 수신할 수 있다. 영상 촬영 장치는 이동이 가능한 로봇일 수 있다. 영상 촬영 장치는 제 2 센싱부를 포함할 수 있고, 제 2 센싱부를 통해 사용자와 인터랙션을 할 수 있다. 제 2 센싱부는 카메라 및 마이크를 포함 할 수 있고, 영상 촬영 장치는 카메라를 통해 사용자를 인식하고, 마이크를 통해 사용자로부터 음성 명령 을 수신할 수 있다. 특히, 영상 촬영 장치는 사용자 발화 텍스트 또는 사용자 발화 음성을 획득하여 분석하고, 사용자 발화가 지시하는 명령을 적어도 하나의 액션으로 분류하고, 분류된 액션 중 사용자 의도 분석에 의해 최종 액션을 결정 할 수 있다. 그리고 영상 촬영 장치는 최종 액션을 실행하고 그 결과에 기반한 응답을 생성하여 원격 제어 장치 및/또는 서버에 전송함으로써 사용자에게 출력할 수 있다. 예를 들어, 영상 촬영 장치는 미아를 찾기 위해 일정 공간 내에서 어린 아이들을 촬영하고, 촬영한 어린 아이들이 미아와 일치하는지 판별하는 액션을 수행할 수 있다. 여기서, 액션은 음성 입력이 지시하는 명령을 수 행하기 위하여 영상 촬영 장치가 실행하는 태스크로서, 음성 입력은 액션의 대상이 되는 개체명(Named Entity)을 포함할 수 있다. 음성 처리를 수행하는 과정에서 영상 촬영 장치는 네트워크를 통해 서버 와 통신할 수 있다. 서버는 자연어 처리를 수행할 수 있는 서버 연산 시스템이거나 언어 처리를 위한 신경망 모델을 생성할 수 있는 트레이닝 연산 시스템일 수 있다. 또한 영상 촬영 장치의 음성 처리 과정은 상기 원격 제어 장치의 음성 인식 과정과 동일하게 구현될 수 있으므로 구체적인 설명을 생략하도록 한다. 로봇으로 구현된 영상 촬영 장치는 실내 공간을 이동하면서 영상 촬영 및 사용자와 커뮤니케이션을 수행할 수 있다. 한편, 도 2에서는 영상 촬영 장치가 로봇으로 구현되었지만, 인공지능 스피커, 스마트폰, 태블릿, 컴퓨터 등 다양한 전자기기로 구현될 수 있다. 도 3은 본 발명의 일 실시 예에 따른 영상 촬영 장치의 예시도이다. 도 3을 참조하여 영상 촬영 장치가 실 내에서 사용되는 경우를 설명할 수 있다. 예를 들어, 로봇으로 구현된 영상 촬영 장치는 공항에서 사용될 수 있다. 특히 공항에서 어린 아이를 잃어버린 경우 보호자는 원격 제어 장치를 통해 어린 아이의 인상 착 의를 포함하여 미아 찾기 서비스를 신청할 수 있다. 원격 제어 장치는 어린 아이의 인상 착의를 포함하는 사용자 발화 음성 또는 사용자 발화 텍스트를 영상 촬영 장치에 전송하고, 영상 촬영 장치는 공항 내 를 이동하면서 영상을 촬영하여 어린 아이를 찾을 수 있도록 할 수 있다. 즉 원격 제어 장치는 사용자의 발화를 수신할 수 있는 근접한 영역에 위치하는 기기이고, 영상 촬영 장치는 사용자로부터 원거리에 위치 하여 원격 제어 장치로부터 수신한 사용자의 발화에 기초하여 액션을 수행하는 기기일 수 있으나, 그 위치 가 이에 한정되는 것은 아니다. 서버는 각종 인공지능 알고리즘을 적용하는데 필요한 빅데이터 및, 원격 제어 장치 및 영상 촬영 장 치를 동작시키는 데이터를 제공하는 데이터베이스 서버일 수 있다. 본 실시 예에서 서버는 원격 제어 장치를 통해 입력 받은 사용자 발화의 자연어 처리를 수행하고, 발화 텍스트에 생성적 모델 기반의 제 1학습 모델을 적용하여 발화 텍스트의 컨텍스트에 대응하는 속성을 갖는 영상을 생성할 수 있다. 그리고 서버 는 사용자 발화에 기초하여 영상 촬영 장치에서 수행해야 할 액션을 판단하고, 생성 영상과 촬영 영 상을 비교하여 동일 여부를 판단할 수 있다. 다만, 원격 제어 장치 및 영상 촬영 장치의 프로세싱 능 력에 따라, 상술한 사용자 발화 텍스트로의 변환, 이미지 생성, 액션 판단, 생성 영상과 촬영 영상 비교 중 적 어도 일부는 원격 제어 장치 및/또는 영상 촬영 장치에 의해 수행될 수 있다. 네트워크는 원격 제어 장치 및 영상 촬영 장치와, 서버를 연결하는 역할을 수행할 수 있다. 이러한 네트워크는 예컨대 LANs(local area networks), WANs(wide area networks), MANs(metropolitan area networks), ISDNs(integrated service digital networks) 등의 유선 네트워크나, 무선 LANs, CDMA, 블루투스, 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것 은 아니다. 또한 네트워크는 근거리 통신 및/또는 원거리 통신을 이용하여 정보를 송수신할 수 있다. 여기 서 근거리 통신은 블루투스(bluetooth), RFID(radio frequency identification), 적외선 통신(IrDA, infrared data association), UWB(ultra-wideband), ZigBee, Wi-Fi (wireless fidelity) 기술을 포함할 수 있고, 원거리 통신은 CDMA(code division multiple access), FDMA(frequency division multiple access), TDMA(time division multiple access), OFDMA(orthogonal frequency division multiple access), SC-FDMA(single carrier frequency division multiple access) 기술을 포함할 수 있다. 네트워크는 허브, 브리지, 라우터, 스위치 및 게이트웨이와 같은 네트워크 요소들의 연결을 포함할 수 있 다. 네트워크는 인터넷과 같은 공용 네트워크 및 안전한 기업 사설 네트워크와 같은 사설 네트워크를 비롯 한 하나 이상의 연결된 네트워크들, 예컨대 다중 네트워크 환경을 포함할 수 있다. 네트워크에의 액세스는 하나 이상의 유선 또는 무선 액세스 네트워크들을 통해 제공될 수 있다. 더 나아가 네트워크는 사물 등 분 산된 구성 요소들 간에 정보를 주고 받아 처리하는 IoT(Internet of Things, 사물인터넷) 망 및/또는 5G 통신을 지원할 수 있다. 도 4는 본 발명의 일 실시 예에 따른 원격 제어 장치 및 영상 촬영 장치를 개략적으로 나타낸 블록도이다. 도 1 내지 도 3에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 4를 참조하면, 원격 제어 장치는 제 1 통신부, 입력인터페이스, 출력인터페이스, 제 1 제어부, 메모리, 제 1 센싱부 및 제 1 정보 처리부를 포함할 수 있다. 제 1 통신부는 네트워크와 연동하여 원격 제어 장치 및/또는 영상 촬영 장치 및/또는 서버 간의 송수신 신호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공할 수 있다. 또한 제 1 통신부는 원격 제어 장치로부터 소정의 정보 요청 신호를 서버로 전송하고, 서버가 처리 한 응답 신호를 수신하여, 원격 제어 장치로 전송할 수 있다. 또한 제 1 통신부는 다른 네트워크 장 치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프 트웨어를 포함하는 장치일 수 있다. 또한, 제 1 통신부는 각종 사물 지능 통신(IoT(internet of things), IoE(internet of everything), IoST(internet of small things) 등)을 지원할 수 있으며, M2M(machine to machine) 통신, V2X(vehicle to everything communication) 통신, D2D(device to device) 통신 등을 지원할 수 있다. 입력인터페이스는 사용자 인터페이스 중 입력을 위한 입력 수단으로, 예를 들어 마이크, 조작부, 디스플레 이 등을 포함할 수 있다. 마이크는 주변 소음 및 발화자의 음성을 수집할 수 있다. 또한 마이크는 사용자의 발 화 정보(예를 들어 기동어 및 발화 음성)을 입력 받아 제 1 제어부로 전송할 수 있고, 제 1 제어부는 사용자의 발화 정보를 제 1 정보 처리부로 전송할 수 있다. 이때 마이크는 하나 이상 구비될 수 있으며, 사용자의 발화 음성을 더 정확하게 수신하기 위해 복수의 마이크가 구비될 수 있다. 여기서, 복수의 마이크 각 각은 서로 다른 위치에 이격되어 배치될 수 있고, 수신한 사용자의 발화 음성을 전기적인 신호로 처리할 수 있 다. 조작부는 복수의 조작 버튼을 구비하여, 입력되는 버튼에 대응하는 신호를 제 1 제어부로 전송할 수 있다. 이러한 조작부는 사용자의 터치 또는 누름 조작을 인식할 수 있는 센서 또는 버튼, 스위치 구조로 구성될 수 있 다. 본 실시 예에서 조작부는 디스플레이에 표시되는 원격 제어 장치의 구동과 관련한 각종 정보를 확인하 거나, 변경하기 위해 사용자가 조작하는 조작 신호를 제 1 제어부로 전송할 수 있다. 출력인터페이스는 사용자 인터페이스 중 출력을 위한 출력 수단으로, 예를 들어 스피커, 디스플레이 등을 포함할 수 있다. 스피커는 음성 인식에 따른 응답 결과 등을 음성으로 사용자에게 출력할 수 있다. 디스플레이는 제 1 제어부의 제어 하에 원격 제어 장치의 구동 상태를 디스플레이 할 수 있다. 실시 예에 따라서, 디스플레이는 터치패드와 상호 레이어 구조를 이루어 터치스크린으로 구성될 수 있다. 이 경우에, 디스플레이는 사용자의 터치에 의한 정보의 입력이 가능한 조작부로도 사용될 수 있다. 이를 위해 디스 플레이는 터치 인식 디스플레이 제어기 또는 이외의 다양한 입출력 제어기로 구성될 수 있다. 일 예로, 터치 인 식 디스플레이 제어기는 장치와 사용자 사이에 출력 인터페이스 및 입력 인터페이스를 제공할 수 있다. 터치 인 식 디스플레이 제어기는 전기 신호를 제 1 제어부와 송수신할 수 있다. 또한, 터치 인식 디스플레이 제어 기는 사용자에게 시각적인 출력을 표시하며, 시각적 출력은 텍스트, 그래픽, 이미지, 비디오와 이들의 조합을 포함할 수 있다. 이와 같은 디스플레이는 예를 들어 터치 인식이 가능한 OLED(organic light emitting display) 또는 LCD(liquid crystal display) 또는 LED(light emitting display)와 같은 소정의 디스플레이 부 재일 수 있다. 제 1 제어부는 입력인터페이스 및/또는 제 1 통신부를 통하여 입력 받은 사용자의 발화 음성 또 는 발화 텍스트를 정보 처리부 및 영상 촬영 장치로 전송할 수 있다. 그리고 제 1 제어부는 정 보 처리부로부터 수신한 음성 인식 처리 결과, 이미지 생성 결과를 출력인터페이스를 통하여 시각적 정보 및 청각적 정보로 제공할 수 있다. 또한 제 1 제어부는 정보 처리부로부터 수신한 이미지 생성 결과를 제 1 통신부를 통하여 영상 촬영 장치로 전송할 수 있다. 제 1 제어부는 일종의 중앙처리장치로서 메모리에 탑재된 제어 소프트웨어를 구동하여 원격 제어 장 치 전체의 동작을 제어할 수 있다. 제 1 제어부는 프로세서(processor)와 같이 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 여기서, '프로세서(processor)'는, 예를 들어 프로그램 내에 포함된 코드 또는 명령어로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로써, 마이크로프로세서 (microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세 서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 본 실시 예에서 제 1 제어부는 원격 제어 장치가 최적의 음성 처리 및 영상 생성 결과를 출력하도록, 사용자 발화 음성에 대하여 딥러닝(Deep Learning) 등 머신 러닝(machine learning)을 수행할 수 있고, 메모리 는, 머신 러닝에 사용되는 데이터, 결과 데이터 등을 저장할 수 있다. 머신 러닝의 일종인 딥러닝(deep learning) 기술은 데이터를 기반으로 다단계로 깊은 수준까지 내려가 학습할 수 있다. 딥러닝은 단계를 높여갈수록 복수의 데이터들로부터 핵심적인 데이터를 추출하는 머신 러닝 알고리즘 의 집합을 나타낼 수 있다. 딥러닝 구조는 인공신경망(ANN)을 포함할 수 있으며, 예를 들어 딥러닝 구조는 CNN(convolutional neural network), RNN(recurrent neural network), DBN(deep belief network) 등 심층신경망(DNN)으로 구성될 수 있다. 본 실시 예에 따른 딥러닝 구조는 공지된 다양한 구조를 이용할 수 있다. 예를 들어, 본 발명에 따른 딥 러닝 구조는 CNN, RNN, DBN 등을 포함할 수 있다. RNN은, 자연어 처리 등에 많이 이용되고 있으며, 시간의 흐름 에 따라 변하는 시계열 데이터(time-series data) 처리에 효과적인 구조로 매 순간마다 레이어를 쌓아 올려 인 공신경망 구조를 구성할 수 있다. DBN은 딥러닝 기법인 RBM(restricted boltzman machine)을 다층으로 쌓아 구 성되는 딥러닝 구조를 포함할 수 있다. RBM 학습을 반복하여, 일정 수의 레이어가 되면 해당 개수의 레이어를 가지는 DBN을 구성할 수 있다. CNN은 사람이 물체를 인식할 때 물체의 기본적인 특징들을 추출되는 다음 뇌 속 에서 복잡한 계산을 거쳐 그 결과를 기반으로 물체를 인식한다는 가정을 기반으로 만들어진 사람의 뇌 기능을 모사한 모델을 포함할 수 있다. 한편, 인공신경망의 학습은 주어진 입력에 대하여 원하는 출력이 나오도록 노드간 연결선의 웨이트(weight)를 조정(필요한 경우 바이어스(bias) 값도 조정)함으로써 이루어질 수 있다. 또한, 인공신경망은 학습에 의해 웨이 트(weight) 값을 지속적으로 업데이트시킬 수 있다. 또한, 인공신경망의 학습에는 역전파(back propagation) 등 의 방법이 사용될 수 있다. 메모리는 원격 제어 장치의 동작에 필요한 각종 정보들을 저장하고, 원격 제어 장치를 동작시킬 수 있는 제어 소프트웨어를 저장할 수 있는 것으로, 휘발성 또는 비휘발성 기록 매체를 포함할 수 있다. 예를 들어, 메모리에는 사용자의 발화 음성으로부터 기동어의 존재를 판단하기 위한 기설정된 기동어가 저장될수 있다. 한편, 기동어는 제조사에 의해 설정될 수 있다. 예를 들어, \"하이 엘지\"가 기동어로 설정될 수 있고, 사용자에 의해 설정 변경할 수 있다. 이러한 기동어는 원격 제어 장치를 활성화시키기 위해 입력되는 것으 로, 사용자가 발화한 기동어를 인식한 원격 제어 장치는 음성 인식 활성화 상태로 전환할 수 있다. 또한, 메모리는 입력인터페이스를 통하여 수신되는 사용자의 발화 정보(기동어 및 발화 음성) 저장할 수 있고, 제 1 센싱부가 감지한 정보를 저장할 수 있으며, 정보 처리부가 처리한 정보를 저장할 수 있다. 메모리는 하나 이상의 프로세서와 연결되는 것으로, 프로세서에 의해 실행될 때, 프로세서로 하여금 원격 제어 장치를 제어하도록 야기하는(cause) 코드들을 저장할 수 있다. 또한 메모리는 제 1 정보 처리부가 실행할 명령어 예를 들어, 음성 명령어를 포함하는 사용자의 발화 음성을 사용자 발화 텍스트로 변환하는 명령어, 사용자 발화 텍스트에 대하여 특징 벡터로 변환하는 명령어, 사 용자 발화 텍스트의 특징 벡터에 대하여 어텐션을 추정하는 명령어, 사용자 발화 텍스트를 영상(이미지)으로 생 성하는 명령어, 생성 이미지와 훈련 이미지를 분류하여 훈련 이미지인지 여부를 판단하는 명령어 등을 저장할 수 있다. 또한 메모리는 사용자 발화 텍스트에 대하여 문법적 분석 또는 의미적 분석을 수행하여, 사용자 발화 텍스트가 속하는 도메인, 사용자 발화 텍스트가 가지는 의도를 탐색하고, 사용자 발화 텍스트가 포함하는 개체명 인식의 결과로 하나 이상의 개체명을 탐색하는 명령어 등을 저장할 수 있다. 또한 메모리는 제 1 정보 처리부가 처리하는 각종 정보를 저장할 수 있다. 여기서, 메모리는 자기 저장 매체(magnetic storage media) 또는 플래시 저장 매체(flash storage medi a)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 이러한 메모리는 내장 메모리 및/ 또는 외장 메모리를 포함할 수 있으며, DRAM, SRAM, 또는 SDRAM 등과 같은 휘발성 메모리, OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, NAND 플래시 메모리, 또는 NOR 플래시 메모리 등과 같은 비휘발성 메모리, SSD. CF(compact flash) 카드, SD 카드, Micro-SD 카드, Mini-SD 카드, Xd 카드, 또는 메모리 스틱(memory stick) 등과 같은 플래시 드라이브, 또는 HDD와 같은 저장 장치를 포함할 수 있다. 제 1 센싱부는 원격 제어 장치의 주변 상황을 센싱하는 각종 센서를 포함할 수 있으며, 근접센서(미 도시) 및 영상센서(미도시)를 포함할 수 있다. 근접센서는 적외선 등을 활용하여 원격 제어 장치 주변에 위치한 객체(예를 들어 사용자)의 위치 데이터를 획득할 수 있다. 한편, 근접센서가 획득한 사용자의 위치 데 이터는 메모리에 저장될 수 있다. 영상센서는 원격 제어 장치 주변을 촬영할 수 있는 카메라(미도시)를 포함할 수 있으며, 촬영 효율을 위해 복수 개가 설치될 수 있다. 예를 들어, 카메라는 적어도 하나의 광학렌즈와, 광학렌즈를 통과한 광에 의해 상이 맺히는 다수개의 광다이오드(photodiode, 예를 들어, pixel)를 포함하여 구성된 이미지센서(예를 들어, CMOS image sensor)와, 광다이오드들로부터 출력된 신호를 바탕으로 영상을 구성하는 디지털 신호 처리기(DSP: digital signal processor)를 포함할 수 있다. 디지털 신호 처리기는 정지영상은 물론이고, 정지영상으로 구성 된 프레임들로 이루어진 동영상을 생성할 수 있다. 한편, 영상센서로서의 카메라가 촬영하여 획득된 영상은 메 모리에 저장될 수 있다. 본 실시 예에서 제 1 센싱부를 근접센서 및 영상센서로 한정하고 있으나, 이에 국한되지 않고, 원격 제어 장치의 주변 상황을 감지할 수 있는 센서 예를 들어, 라이다 센서(Lidar sensor), 무게 감지 센서, 조도 센서(illumination sensor), 터치 센서(touch sensor), 가속도 센서(acceleration sensor), 자기 센서 (magnetic sensor), 중력 센서(G-sensor), 자이로스코프 센서(gyroscope sensor), 모션 센서(motion sensor), RGB 센서, 적외선 센서(IR 센서: infrared sensor), 지문인식 센서(finger scan sensor), 초음파 센서 (ultrasonic sensor), 광 센서(optical sensor), 마이크로폰(microphone), 배터리 게이지(battery gauge), 환 경 센서(예를 들어, 기압계, 습도계, 온도계, 방사능 감지 센서, 열 감지 센서, 가스 감지 센서 등), 화학 센서 (예를 들어, 전자 코, 헬스케어 센서, 생체 인식 센서 등) 중 적어도 하나를 포함할 수 있다. 한편, 본 실시 예에서 원격 제어 장치는 이러한 센서들 중 적어도 둘 이상의 센서에서 센싱되는 정보들을 조합하여 활용 할 수 있다. 제 1 정보 처리부는 사용자의 발화 음성을 발화 텍스트로 변환하거나 발화 텍스트를 입력 받아, 발화 텍스 트에 생성적 모델 기반의 제 1 학습 모델을 적용하여 발화 텍스트의 컨텍스트에 대응하는 속성을 갖는 영상을 생성하고, 영상과 발화 텍스트를 외부로 전송할 수 있다. 또한 제 1 정보 처리부는 발화 텍스트를 단어 (word) 벡터와 문장(sentence) 벡터로 변환하고, 단어 벡터 및 문장 벡터로부터 각각 단어 어텐션 및 문장 어텐션을 추출하여, 생성적 모델 기반의 제 1 학습 모델에서 단어 어텐션 및 문장 어텐션에 기반하여 영상을 생성할 수 있도록 할 수 있다. 그리고 제 1 정보 처리부는 발화 텍스트에서 두 개 이상의 의도(intent)를 추정하 고, 두 개 이상의 의도 중 영상 생성을 위한 의도에 가중치를 부여하고, 가중치에 기반하여 단어 어텐션 및 문 장 어텐션을 추정할 수 있다. 본 실시 예에서 제 1 정보 처리부는 제 1 제어부와 연계하여 학습을 수행하거나, 제 1 제어부로 부터 학습 결과를 수신할 수 있다. 본 실시 예에서 제 1 정보 처리부는 도 4에 도시된 바와 같이 제 1 제 어부 외부에 구비될 수도 있고, 제 1 제어부 내부에 구비되어 제 1 제어부처럼 동작할 수도 있 고, 도 2의 서버 내부에 구비될 수도 있다. 이하 제 1 정보 처리부의 상세한 내용은 도 5 및 도 6을 참조하여 설명하기로 한다. 도 4를 참조하면, 영상 촬영 장치는 제 2 통신부, 제 2 센싱부, 제 2 제어부, 전원공급부 , 이동부 및 제 2 정보 처리부를 포함할 수 있다. 제 2 통신부는 네트워크와 연동하여 영상 촬영 장치 및/또는 원격 제어 장치 및/또는 서버 간의 송수신 신호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공할 수 있다. 또한 제 2 통신부는 영상 촬영 장치로부터의 소정의 정보 요청 신호를 서버로 전송하고, 서버가 처 리한 응답 신호를 수신하여, 영상 촬영 장치로 전송할 수 있다. 또한 제 2 통신부는 상술하는 원격 제어 장치의 제 1 통신부와 동일하게 구현될 수 있는 바, 구체적인 설명은 생략하도록 한다. 제 2 센싱부는 카메라 및 마이크를 포함할 수 있으며, 카메라는 주변 환경 및 발화자 등의 이미지를 촬영할 수 있고, 마이크는 주변 소음 및 발화자의 음성을 수집할 수 있다. 특히 본 실시 예에서 카메라는 원격 제어 장치 및/또는 서버, 또는 사용자가 요청하는 물체(사람, 동물, 사물 등)의 영상을 촬영할 수 있다. 즉 카메라는 객체 인식 기능, 얼굴 인식 기능 등을 포함할 수 있다. 또한, 제 2 센싱부는 상술하는 원격 제어 장치의 제 1 센싱부와 동일하게 구현될 수 있는 바, 구체적인 설 명은 생략하도록 한다. 제 2 제어부는 제 2 센싱부 및/또는 제 2 통신부를 통하여 사용자의 발화 음성 또는 발화 텍스 트를 수신할 수 있다. 또한 제 2 제어부는 제 2 통신부를 통하여 원격 제어 장치로부터 사용자 의 발화 음성 또는 텍스트를 포함하는 제 1 입력을 수신할 수 있다. 그리고 제 2 제어부는 제 2 통신부 를 통하여 원격 제어 장치로부터 제 1 영상을 포함하는 제 2 입력을 수신할 수 있다. 여기서 제 1 영 상은 제 1 입력에 생성적 모델(generative model) 기반의 제 1 학습 모델을 적용하여 획득된 영상으로서, 제 1 입력의 컨텐스트(context)에 대응하는 속성을 갖는 영상일 수 있다. 제 2 제어부는 제 1 입력에 기반하여, 카메라를 통해 적어도 하나 이상의 제 2 영상을 촬영할 수 있 다. 또한 제 2 제어부는 제 1 영상과 제 2 영상을 비교하고, 비교 결과에 대응하여 제 2 영상을 원격 제어 장치 및/또는 서버로 전송할 수 있다. 제 2 제어부는 일종의 중앙처리장치로서 저장부(미도시)에 탑재된 제어 소프트웨어를 구동하여 영상 촬영 장치 전체의 동작을 제어할 수 있다. 제 2 제어부는 프로세서(processor)와 같이 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 본 실시 예에서 제 2 제어부는 영상 촬영 장치가 최적의 음성 처리 및 영상 분류 결과를 출력하도록, 사용자 발화 음성에 대하여 딥러닝(Deep Learning) 등 머신 러닝 (machine learning)을 수행할 수 있고, 저장부는 머신 러닝에 사용되는 데이터, 결과 데이터 등을 저장할 수 있 다. 또한, 제 2 제어부는 상술하는 원격 제어 장치의 제 1 제어부와 동일하게 구현될 수 있는 바, 구체적인 설명은 생략하도록 한다. 저장부(미도시)는 영상 촬영 장치의 동작에 필요한 각종 정보들을 저장하고, 영상 촬영 장치를 동작 시킬 수 있는 제어 소프트웨어를 저장할 수 있는 것으로, 휘발성 또는 비휘발성 기록 매체를 포함할 수 있다. 또한, 저장부는 제 2 센싱부가 감지한 정보를 저장할 수 있으며, 제 2 정보 처리부가 처리한 정보를 저장할 수 있다. 저장부는 하나 이상의 프로세서와 연결되는 것으로, 프로세서에 의해 실행될 때, 프로세서로 하여금 영상 촬영 장치를 제어하도록 야기하는(cause) 코드들을 저장할 수 있다. 또한, 저장부는 제 2 정보 처리부가 실행할 명령어 예를 들어, 사용자 발화 텍스트에 대하여 특징 벡터로 변환하는 명령어, 사용자 발화 텍스트의 특징 벡터에 대하여 문법적 분석 또는 의미적 분석을 수행하여, 사용자 발화 텍스트가 가지는 의도를 추정하는 명령어, 사용자 발화 텍스트에 기초하여 액션을 수행하는 명령어, 생성 이미지와 촬영 이미지를 비교하여 동일 여부를 판별하는 명령어 등을 저장할 수 있다. 또한 저장부는 사용자 어텐션을 추출하는 명령어, 사용자 발화 텍스트에 대하여 문법적 분석 또는 의미적 분석을 수행하여, 사용자 발화 텍스트가 속하는 도메인, 사용자 발화 텍스트가 포함하는 개체명 인식의 결과로 하나 이상의 개체명을 탐색하는 명령어 등을 저장할 수 있다. 또한 저장부 제 2 정보 처리부가 처리하는 각종 정보를 저장할 수 있다. 또한, 저장부는 원격 제어 장치의 메모리와 동일하게 구현될 수 있는 바, 구체적인 설명은 생략하도 록 한다. 본 실시 예에서, 간단한 음성 인식은 영상 촬영 장치가 수행하고, 자연어 처리 등 고차원의 음성 인식은 서버에서 수행될 수 있다. 예를 들어, 사용자가 발화한 단어가 기설정된 기동어인 경우, 영상 촬영 장치 는 음성 명령어로서의 발화 음성을 수신하기 위한 상태로 전환할 수 있다. 이 경우에, 영상 촬영 장치 는 기동어 음성 입력 여부까지의 음성 인식 과정만 수행하고, 이후의 발화문에 대한 음성 인식은 서버 를 통하여 수행할 수 있다. 영상 촬영 장치의 시스템 자원에는 한계가 있으므로, 복잡한 자연어 인식 및 처리는 서버를 통하여 수행될 수 있다. 전원공급부는 영상 촬영 장치가 동작할 수 있도록 전원을 공급하는 기능을 수행할 수 있다. 전원공급 부는 자체 배터리로부터 또는 외부 전원과 연결되어 전원을 공급할 수 있다. 이동부는 영상 촬영 장치 또는 영상 촬영 장치가 설치된 장비를 이동시키기 위한 기능을 수행할 수 있다. 제 2 정보 처리부는 텍스트 또는 음성을 포함하는 제 1 입력 및 제 1 영상을 포함하는 제 2 입력을 수신하 고, 제 1 입력에 기반하여 적어도 하나 이상의 제 2 영상을 촬영할 수 있다. 또한 제 2 정보 처리부는 제 1 영상과 제 2 영상을 비교하고, 비교 결과에 대응하여 제 2 영상을 전송할 수 있다. 또한 제 2 정보 처리부 는 두 장의 영상을 입력으로 하여 영상의 유사성을 추정하도록 훈련된 머신 러닝 기반의 제 2 학습 모델을 제 1 영상 및 제 2 영상에 적용할 수 있다. 또한, 제 2 정보 처리부는 제 1 영상 및 제 2 영상으로부터 각 각 특징 벡터를 추출하고, 제 1 영상 및 상기 제 2 영상으로부터 추출된 특징 벡터들을 비교할 수 있다. 본 실시 예에서 제 2 정보 처리부는 제 2 제어부와 연계하여 학습을 수행하거나, 제 2 제어부로 부터 학습 결과를 수신할 수 있다. 본 실시 예에서 제 2 정보 처리부는 도 4에 도시된 바와 같이 제 2 제 어부 외부에 구비될 수도 있고, 제 2 제어부 내부에 구비되어 제 2 제어부처럼 동작할 수도 있 고, 도 2의 서버 내부에 구비될 수도 있다. 이하 제 2 정보 처리부의 상세한 내용은 도 5 및 도 6을 참조하여 설명하기로 한다. 도 5는 본 발명의 일 실시 예에 따른 원격 제어 장치 및 영상 촬영 장치를 보다 구체적으로 설명하기 위한 도면 이다. 도 1 내지 도 4에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 5를 참조하면, 원격 제어 장치의 제 1 정보 처리부는 제 1 발화 수신부, 벡터 변환부(172-1, 172-2), 어텐션 추출부(173-1, 173-2), 영상 생성부 및 제 1 전송부를 포함할 수 있다. 선택적 실시 예로, 제 1 정보 처리부는 하나 이상의 프로세서를 포함할 수 있다. 선택적 실시 예로 제 1 발화 수신부 내지 제 1 전송부는 하나 이상의 프로세서에 대응될 수 있다. 선택적 실시 예로, 제 1 발화 수신부 내지 제 1 전송부는 하나 이상의 프로세서에 의해 실행되도록 구성된 소프트웨어 구성 요소 (component)에 대응될 수 있다. 제 1 발화 수신부는 사용자의 발화 음성을 발화 텍스트로 변환하거나 발화 텍스트를 입력 받을 수 있다. 즉 제 1 발화 수신부는 사용자의 발화 음성을 수신하여 발화 텍스트로 변환하거나 변환된 발화 텍스트를 입력 받을 수 있다. 예를 들어, 제 1 발화 수신부는 find orange T-shirt boy라는 사용자의 발화 음성이 수신되면 발화 텍스트로 변환할 수 있다. 그리고 영상 생성부는 발화 텍스트에 생성적 모델 기반의 제 1 학습 모델을 적용하여 발화 텍스트의 컨텍 스트에 대응하는 속성을 갖는 영상을 생성할 수 있다. 여기서 제 1 학습 모델은, 텍스트 또는 음성을 입력으로 하여 상기 입력의 컨텍스트(context)에 대응하는 속성을 가진 영상을 출력하도록 훈련된 학습 모델로서, 본 실 시 예에서는 생성적 적대 신경망(GAN: Generative Adversarial Network)을 포함한 생성적 모델(generative model) 기반의 학습 모델일 수 있다. 특히 본 실시 예에서, 영상 생성부는 텍스트 투 이미지 변환이 가능 한 생성적 모델 기반의 제 1 학습 모델을 이용할 수 있으며, 이를 위해 발화 텍스트에 대하여 벡터로 변환하고 어텐션(attention)을 추정하는 과정을 수행할 수 있다. 즉, 영상 생성부는 벡터 변환부(172-1, 172-2) 및 어텐션 추출부(173-1, 173-2)를 포함할 수 있다. 본 실 시 예에서는 벡터 변환부(172-1, 172-2)를 발화 텍스트를 단어 벡터로 변환하는 제 1 벡터 변환부(172-1) 및 발 화 텍스트를 문장 벡터로 변환하는 제 2 벡터 변환부(172-2)로 구분될 수 있다. 또한 본 실시 예에서 어텐션 추출부(173-1, 173-2)는 단어 벡터로부터 단어 어텐션을 추정하는 제 1 어텐션 추 출부(173-1) 및 문장 벡터로부터 문장 어텐션을 추정하는 제 2 어텐션 추출부(173-2)로 구분될 수 있다. 예를 들어, 본 실시 예에서 제 1 학습 모델은 RNN(Recurrent Neural Networks) 알고리즘을 포함할 수 있다. RNN은 히든 노드가 방향을 가진 엣지로 연결돼 순환구조를 이루는(directed cycle) 인공신경망의 한 종류이다. 즉 RNN은 음성, 문자 등 순차적으로 등장하는 데이터 처리에 적합한 모델이나, 관련 정보와 그 정보를 사용하는 지점 사이 거리가 멀 경우 역전파시 그래디언트가 점차 줄어 학습 능력이 저하될 수 있다. 이에 본 실시 예에서 는 어텐션을 추출하는 과정을 수행할 수 있다. 또한 벡터 변환부(172-1, 172-2)에서 단어 벡터로만 변환하게 되 는 경우에는, 문장의 단어 순서 및 문장의 의미가 무시될 수 있다. 따라서 본 실시 예에서는 제 2 벡터 변환부 (172-2)에서 발화 텍스트를 문장 벡터로 변환하고, 제 2 어텐션 추출부(173-2)에서 문장 레벨에서의 어텐션을 추정할 수 있다. 보다 구체적으로, 벡터 변환부(172-1, 172-2)는 복수의 단어로 구성된 사용자 발화 텍스트를 입력으로 하여, 복 수의 단어 각각을 기 설정된 키워드로 맵핑한 키워드 맵핑 텍스트를 생성하는 인코딩을 수행할 수 있다. 즉 벡 터 변환부(172-1, 172-2)는 인코더(encoder)일 수 있다. 그리고 어텐션 추출부(173-1, 173-2)는 키워드 맵핑 텍스트를 어텐션 모델에 입력하여 키워드의 각각에 대한 어 텐션 정보를 생성할 수 있다. 또한 어텐션 추출부(173-1, 173-2)는 어텐션 정보를 이용하여 사용자 발화 텍스트 에 대응하는 두 개 이상의 발화 의도를 출력하는 디코딩을 수행할 수 있다. 즉 어텐션 추출부(173-1, 173-2)는 디코더(decoder)를 포함할 수 있다. 벡터 변환부(172-1, 172-2)는 복수의 단어로 구성된 사용자 발화 텍스트를 입력으로 하여, 복수의 단어 각각을 데이터베이스(미도시)에 저장된 기설정된 키워드로 맵핑한 키워드 맵핑 텍스트를 생성하여 출력할 수 있다. 본 실시 예에서 데이터베이스에는 사용자 발화 텍스트에 포함된 단어에 대응하여 맵핑할 키워드가 저장되어 있다. 여기서 키워드는 대응 의도가 무엇인지 지정되어 있을 수 있다. 예를 들어, 사용자 발화 텍스트에 찾음, 찾아줘, 찾는 등의 단어가 포함되어 있는 경우, 벡터 변환부(172-1, 172-2)는 데이터베이스를 액세스하여 키워 드로 <find>를 선택하고, 사용자 발화 텍스트의 해당 단어에 키워드인 <find>를 맵핑 할 수 있다. 이와 같은 벡터 변환부(172-1, 172-2)의 키워드 맵핑 텍스트 생성으로 어텐션 추출부(173-1, 173-2)에 더 많은 특징 정보를 전송하여, 어텐션 추출부(173-1, 173-2)의 의도(intent) 출력 성능을 개선할 수 있다. 어텐션 추출부(173-1, 173-2)는 키워드 맵핑 텍스트를 어텐션 모델(미도시)에 입력하여 키워드의 각각에 대한 어텐션 정보를 생성할 수 있다. 어텐션 모델은 미리 학습된 뉴럴 네트워크를 이용하여 키워드 특징 정보에 상응 하는 어텐션 정보를 생성하는 모델을 나타낼 수 있다. 여기서, 어텐션 정보(attention information)는 디코딩 과정 이후 출력되는 두 개 이상의 의도 중 어느 의도에 가중치를 두어야 하는지를 나타내는 정보일 수 있다. 어텐션 모델은 예를 들어 RNN 인코더-디코더(encoder-decoder) 모델에서, 인코더의 히든 스테이트(hidden state)를 이용하여 생성된 인코딩과 현재까지 생성한 디코더의 히든 스테이트(hidden state)를 입력으로 하여, 입력 중 어느 위치(어느 키워드)를 주의해서 봐야 할 지 결정할 수 있다. 어텐션 모델은 주의해서 봐야 할 위치 (키워드)에 더 높은 가중치(어텐션 정보)를 할당할 수 있다. 즉, 어텐션 모델은 어느 위치에 있는 키워드가 현 재 출력을 생성하는데 중요한 역할을 했는지에 따라, 키워드 별로 서로 다른 어텐션 정보를 출력할 수 있다. 또한 본 실시 예에서, 영상 생성부에서는 생성적 모델 기반의 제 1 학습 모델이 단어 어텐션 및 문장 어텐 션에 기반하여 영상을 생성할 수 있다. 또한 영상 생성부는 발화 텍스트에서 두 개 이상의 의도(intent)를 추정하고, 두 개 이상의 의도 중 영상 생성을 위한 의도에 가중치를 부여하고, 가중치에 기반하여 단어 어텐션 및 문장 어텐션을 추정함으로써, 영상을 생성할 수 있다. 영상 생성부는 사용자 발화 텍스트에 대하여, 문법적 분석(syntactic analyze) 또는 의미적 분석(semantic analyze)을 수행하여 사용자 발화 음성에 대한 도메인 및 의도를 분석할 수 있다. 여기서, 문법적 분석은 사용 자 발화 텍스트를 문법적 단위(예: 단어, 구, 형태소 등)로 나누고, 나누어진 단위가 어떤 문법적인 요소를 갖 는지 파악할 수 있다. 본 실시 예에서 사용자 발화 텍스트를 토크나이징하여 단어들로 분류하는 기술이 문법적 분석에 포함될 수 있다. 또한 의미적 분석은 의미(semantic) 매칭, 룰(rule) 매칭, 포뮬러(formula) 매칭 등을 이용하여 수행할 수 있다. 본 실시 예에서 도메인은 사용자가 동작시키려고 하는 영상 촬영 장치를 지정하 는 정보 및 영상 촬영 장치를 제어하고자 하는 제어 기능 정보 등을 포함할 수 있다. 또한 본 실시 예에서의도는 도메인에 포함되는 영상 촬영 장치의 제어 기능을 통해 세부적으로 어떤 동작을 수행하도록 할 것 인지, 예를 들어 어떤 사람을 찾을 것인지를 나타내는 정보를 포함할 수 있다. 예를 들어, 사용자 발화 텍스트 가 <주황색 티셔츠 입은 남자 아이 찾아줘>인 경우, 본 실시 예에서는, 도메인으로 영상 촬영 장치 및 미 아 찾기를 출력할 수 있고, 의도로 주황색, 남자 아이를 출력할 수 있다. 즉 영상 생성부는 예를 들어, <주황색>, <남자 아이>에 가중치를 할당하고, <티셔츠>도 추가로 조합하여 이미지를 생성할 수 있다. 또한 영상 생성부는 문장 레벨에서 벡터를 변환하고, 문장의 의미적 요소까지 고려하여 문장간 유사도를 계산함으로써 정보 손실을 최소화할 수 있다. 즉 본 실시 예에서는, 복수의 문장이 있을 수 있으며, 복수의 문장 중에서 주요 문장을 추출할 수 있다. 제 1 전송부는 영상 생성부에서 생성한 영상과 제 1 발화 수신부에서 수신한 발화 텍스트를 외 부로 전송할 수 있다. 본 실시 예에서, 제 1 전송부는 생성한 영상과 발화 텍스트를 영상 촬영 장치 및/또는 서버에 전송할 수 있다. 한편, 본 실시 예에서, 제 1 정보 처리부는 판별부를 더 포함할 수 있다. 선택적 실시 예로 판별부 는 하나 이상의 프로세서에 대응될 수 있다. 선택적 실시 예로, 판별부는 하나 이상의 프로세서에 의 해 실행되도록 구성된 소프트웨어 구성 요소에 대응될 수 있다. 도 6은 본 발명의 일 실시 예에 따른 원격 제어 장치의 판별부 예시도이다. 도 6을 참조하면, 판별부는 영 상 생성부에서 생성한 영상 또는 훈련된 영상(실제 영상)을 번갈아 가며 분류 모델에 입력할 수 있다. 분 류 모델은 훈련된 영상이 입력되었는지 여부를 분류하는 학습 모델로, 훈련된 영상이 입력되었다고 판단되면 참 (true) 결과를 출력할 수 있다. 그리고 판별부는 분류 모델의 출력 결과를 영상 생성부로 피드백 할 수 있다. 이때 영상 생성부는 학습 모델 출력 결과가 거짓(false)으로 피드백 되면 새로 영상을 생성하여 분류 모델의 출력이 참(true)로 나오는 방향(벡터)으로 업데이트될 수 있다. 따라서 본 실시 예에서, 영상 생성 부의 생성 모델을 통해 만들어진 가짜 데이터는 진짜 데이터(in-domain)를 모사하면서 훈련된 데이터로 커 버하지 못하는 영역이 보완되도록 할 수 있다. 즉 본 실시 예에서는 새로운 데이터를 생성하는 생성기와 이 데 이터를 평가하는 판별기가 서로 대립하며 각각의 성능을 높이는 목적을 달성하는 경쟁 끝에 진짜와 같은 가상의 새로운 이미지가 만들어지도록 할 수 있다. 또한 도 5를 참조하면, 영상 촬영 장치의 제 2 정보 처리부는 제 2 발화 수신부, 의도 판단부 , 영상 촬영부, 생성영상 수신부, 비교부 및 제 2 전송부를 포함할 수 있다. 선택적 실시 예로, 제 2 정보 처리부는 하나 이상의 프로세서를 포함할 수 있다. 선택적 실시 예로 제 2 발화 수 신부 내지 제 2 전송부는 하나 이상의 프로세서에 대응될 수 있다. 선택적 실시 예로, 제 2 발화 수 신부 내지 제 2 전송부는 하나 이상의 프로세서에 의해 실행되도록 구성된 소프트웨어 구성 요소 (component)에 대응될 수 있다. 제 2 발화 수신부는 텍스트 또는 음성을 포함하는 제 1 입력을 수신할 수 있다. 제 2 발화 수신부는 사용자의 발화 음성을 수신하여 발화 텍스트로 변환하거나, 변환된 발화 텍스트를 입력 받을 수 있다. 예를 들 어, 제 2 발화 수신부는 find orange T-shirt boy라는 사용자의 발화 음성이 수신되면 발화 텍스트로 변환 할 수 있다. 의도 판단부는 제 1 입력에 자연어 처리 인공 신경망에 기반한 의도 분류 학습 모델을 적용할 수 있다. 여 기서 자연어 처리 인공 신경망은 제 1 입력으로부터 적어도 두 개 이상의 의도를 출력하도록 훈련된 자연어 처 리 인공 신경망일 수 있다. 본 실시 예에서, 자연어 처리 인공 신경망에 기반한 의도 분류 학습 모델은 예를 들 어, RNN 기반 LSTM(Long Short Term Memory) 모델일 수 있다. LSTM은 RNN의 장기의존성 문제를 보완할 수 있는 것으로, 단일 네트워크 레이어를 가지지 않고 4개의 상호 작용 가능한 구조로 이루어져 있다. 또한 본 실시 예 에서 자연어 처리 인공 신경망에 기반한 의도 분류 학습 모델은 양방향 LSTM 네트워크를 사용하는 시퀀스-시퀀 스 모델로, 슬롯을 채우고 동시에 의도를 예측할 수 있다. 예를 들어, find orange T-shirt boy라는 문장이 주 어지면, 태스크는 {action: find people} 및 {who: boy} 슬롯을 올바르게 출력하거나 채울 수 있다. 따라서 영상 촬영 장치는 사용자가 발화한 음성 입력을 획득하고, 음성 입력을 분석하여 음성 입력이 지시 하는 명령을 적어도 하나의 액션으로 분류하고, 분류된 액션 중 사용자 의도 분석에 의해 최종 액션을 결정할 수 있다. 액션은 음성 입력이 지시하는 명령을 수행하기 위하여 영상 촬영 장치가 실행하는 태스크로서, 음성 입력은 액션의 대상이 되는 개체명(Named Entity)을 포함할 수 있다. 또한 영상 촬영 장치는 음성 입 력을 분석하여 음성 입력이 지시하는 명령을 도출할 수 있다. 음성 입력이 지시하는 명령은 명령의 대상 및 명령의 내용을 포함할 수 있다. 여기서 명령의 대상은 개체명에 대응하고 명령의 내용은 액션에 대응할 수 있다. 선택적 실시 예로, 하나의 음성 입력이 지시하는 명령은 복수의 도메인에 대한 액션으로 분류될 수 있다. 도메 인(domain)은 액션의 기능적 범주를 의미한다. 예를 들어, 'A 찾아줘'라는 명령은 찾기 기능을 지원하는 다양한 도메인에 대한 액션으로 분류될 수 있다. 예를 들어, 사람 찾기, 음악, 웹, 메모, 주소록, 앱, 가전제어, 날씨, 메시지 및 장소는 모두 찾기 기능을 지원하는 도메인에 해당할 수 있다. 'A 찾아줘'라는 명령은 'A라는 사람 찾 기'(제 1 액션) 또는 'A라는 장소를 찾기'(제 2 액션)으로 분류될 수 있다. 이와 같이 복수의 액션으로 분류 가 능한 음성 입력을 중의적 발화라고 한다. 이때 영상 촬영 장치는 복수의 액션으로 분류될 수 있는 중의적인 음성 입력에 대한 최종 액션을 결정하기 위하여 사용자 의도 분석을 수행할 수 있다. 음성 인식 서비스에서 사용자 의도 분석은 사용자가 발화한 음성 입력을 미리 정의된 액션 중 하나로 분류하는 것을 의미할 수 있다. 사용자 의도 분석은 사용자의 발화 의도에 부합하는 응답을 제공하는 데에 기여할 수 있다. 즉, 영상 촬영 장치는 사용자 의도 분석을 이용하여 복수 의 후보 액션 중 사용자의 의도에 가장 부합하는 것으로 판단된 하나의 액션을 최종 액션으로 선택할 수 있다. 예를 들어, 'A 찾아줘'라는 명령에 의해 사용자가 의도한 도메인이 무엇인 지에 따라 앞선 예에서 분류한 결과 얻어진 제 1 액션 및 제 2 액션 중 하나의 액션을 최종적으로 선택하게 된다. 본 실시 예에서는 사용자가 의도한 도메인이 사람 찾기라고 판단하여, 카메라를 통해 제 1 입력에 기반하 여 적어도 하나 이상의 제 2 영상을 촬영할 수 있다. 즉 영상 촬영부는 의도 분류 학습 모델의 출력에 기 반하여 제 2 영상을 촬영할 수 있으며, 제 2 영상은 설정 영역 내의 사람들의 영상일 수 있다. 예를 들어, 공항 에서 남자 아이를 찾아달라는 의도가 분석된 경우, 영상 촬영 장치는 공항 내를 이동하면서 남자 아이들의 영상을 촬영할 수 있다. 즉 영상 촬영부는 제 1 입력에 기반하여 적어도 하나 이상의 제 2 영상을 촬영할 수 있으며, 의도 분류 학 습 모델의 출력에 기반하여 제 2 영상을 촬영할 수 있다. 생성영상 수신부는 제 1 영상을 포함하는 제 2 입력을 수신할 수 있다. 즉 생성영상 수신부는 원격 제어 장치로부터 사용자 발화에 기초하여 생성된 영상을 수신할 수 있다. 비교부는 제 1 영상과 제 2 영상을 비교할 수 있다. 이때, 제 1 영상은 제 1 입력에 생성적 모델 (generative model) 기반의 제 1 학습 모델을 적용하여 획득된 영상으로서, 제 1 입력의 컨텐스트(context)에 대응하는 속성을 갖는 영상일 수 있다. 제 2 영상은 카메라에 의해 촬영된 영상일 수 있다. 즉 비교부 는 사용자 발화에 기초하여 생성된 영상과 카메라에 의해 촬영된 영상을 비교하여 동일 여부를 판단 할 수 있다. 비교부는 두 장의 영상을 입력으로 하여 영상의 유사성을 추정하도록 훈련된 머신 러닝 기반의 제 2 학습 모델을 제 1 영상 및 제 2 영상에 적용할 수 있다. 예를 들어, 비교부는 샴 네트워크가 적용될 수 있다. 샴 네트워크는 카테고리별 학습 데이터(traing data)가 충분치 않은 인식기에 사용될 수 있는 뉴럴 네트워크이 다. 샴 네트워크는 데이터로부터 유사성 측정을 학습할 수 있다. 샴 네트워크는 적어도 부분적으로 가중치를 공 유하는 2 이상의 뉴럴 네트워크들(서브 네트워크들)과 뉴럴 네트워크들로부터 출력을 입력받는 비교 모듈을 포 함할 수 있다. 샴 네트워크에는 적어도 2 개의 이미지가 입력될 수 있다. 샴 네트워크는 입력되는 2 개의 이미 지의 유사도를 판단한 결과를 출력할 수 있다. 이미지 처리를 위하여 샴 네트워크는 이미지를 입력 받는 2개의 컨벌루셔널 뉴럴 네트워크를 포함할 수 있다. 샴 네트워크에서 이미지를 입력 받는 2 개의 컨벌루셔널 뉴럴 네 트워크는 가중치의 적어도 일부를 공유할 수 있다. 샴 네트워크에 포함된 서브 네트워크들은 가중치 공유 모듈 에 의하여 가중치를 공유할 수 있으며, 서브 네트워크들이 가중치를 공유 함으로써, 샴 네트워크는 입력된 두 데이터에 대해 공통된 가중치로 피쳐를 추출하여 비교할 수 있다. 또한, 비교부는 제 1 영상 및 제 2 영상으로부터 각각 특징 벡터를 추출하고, 제 1 영상 및 제 2 영상으로 부터 추출된 특징 벡터들을 비교할 수 있다. 즉 비교부는 생성 영상인 제 1 영상의 특징 벡터를 추출하고, 촬영 영상인 제 2 영상의 특징 벡터를 추출한 후, 벡터의 값으로 유사도를 비교할 수 있다. 예를 들어 유사도 값은 0.0~ 1.0으로 추출될 수 있으며, 유사한 정도에 따라 1.0에 가깝게 추출될 수 있다. 따라서 비교부는 복수의 촬영 영상을 각각 생성 영상과 비교하여 유사도 값을 추출할 수 있으며, 기준 유사도 값 이상으로 추출 되는 촬영 영상에 대해 동일(true)의 결과가 출력될 수 있다. 기준 유사도 값은 비교 영상이 동일하다고 판단될 수 있는 기준 값으로 미리 설정될 수 있다. 제 2 전송부는 제 1 영상과 제 2 영상의 비교 결과에 대응하여, 제 2 영상을 전송할 수 있다. 즉 제 2 전 송부는 생성 영상과 촬영 영상을 비교한 결과, 동일하다고 판단되는 경우 촬영 영상을 원격 제어 장치 및/또는 서버에 전송할 수 있다. 도 7은 본 발명의 일 실시 예에 따른 원격 제어 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 1 내지 도 6 에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 7을 참조하면, S110단계에서, 원격 제어 장치는 사용자의 발화 음성을 발화 텍스트로 변환하거나 발화 텍스트를 입력 받는다. 즉 원격 제어 장치는 사용자의 발화 음성을 수신하여 발화 텍스트로 변환하거나 변 환된 발화 텍스트를 입력 받을 수 있다. 예를 들어, 원격 제어 장치는 find orange T-shirt boy라는 사용 자의 발화 음성이 수신되면 발화 텍스트로 변환할 수 있다. S120단계에서, 원격 제어 장치는 발화 텍스트에 생성적 모델(generative model) 기반의 제 1 학습 모델을 적용하여 발화 텍스트의 컨텍스트(context)에 대응하는 속성을 갖는 영상을 생성한다. 여기서 제 1 학습 모델은, 텍스트 또는 음성을 입력으로 하여 상기 입력의 컨텍스트에 대응하는 속성을 가진 영상을 출력하도록 훈련된 제 1 학습 모델로서, 본 실시 예에서는 생성적 적대 신경망(GAN: Generative Adversarial Network)을 포함한 생성적 모델 기반의 제 1 학습 모델일 수 있다. 특히 본 실시 예에서, 원격 제어 장치는 텍스트 투 이미지 변환이 가능한 생성적 모델 기반의 제 1 학습 모델을 이용할 수 있으며, 이를 위해 발화 텍스트에 대하 여 벡터로 변환하고 어텐션(attention)을 추출하는 과정을 수행할 수 있다. 즉 원격 제어 장치는 단어와 문장 정보를 어텐션으로 연산하여 입력 문장에 최적화된 이미지를 생성할 수 있다. 이때 원격 제어 장치는 진짜 이미지(실제 이미지, 훈련된 이미지, 레이블링된 이미지)인지 가짜 이미지(생성된 이미지)인지 구분하도록 학습된 판별기(discriminator)를 포함할 수 있다. 즉 원격 제어 장치는 판별기를 속여서 진짜 이미지를 만 들도록 학습함으로써, 학습 할수록 점점 더 진짜에 가까운 이미지를 생성할 수 있다. 다시 말해, 원격 제어 장 치는 입력을 텍스트로 받아서 출력을 영상으로 하는 생성 모델을 포함하며, 생성 모델 내부에 또 다른 분 류모델을 가지고 있어서 실제 영상(Label을 가지고 있는 정답 label)와 생성 모델로 만들어진 영상을 분류할 수 있고, 분류와 생성을 반복하면서 생성 모델을 학습할 수 있다. 또한 원격 제어 장치는 입력 텍스트를 개별 단어와 문장 벡터(vector)로 변환 후 각각에 어텐션 파라미터(attention parameter)를 적용하여 텍스트에 의미 를 충분히 담고 있는 최적의 벡터를 만들고 그것을 생성 모델로 입력할 수 있다. S130단계에서, 원격 제어 장치는 영상과 발화 텍스트를 외부로 전송한다. 즉 원격 제어 장치는 발화 텍스트와, 발화 텍스트에 기초하여 생성한 영상을 외부로 전송할 수 있으며, 예를 들어 영상 촬영 장치 및 /또는 서버에 전송할 수 있다. 도 8은 본 발명의 일 실시 예에 따른 영상 촬영 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 1 내지 도 7 에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 8을 참조하면, S210단계에서, 영상 촬영 장치는 텍스트 또는 음성을 포함하는 제 1 입력 및 제 1 영상 을 포함하는 제 2 입력을 수신한다. 즉 영상 촬영 장치는 텍스트 또는 음성을 포함하는 제 1 입력을 수신 할 수 있다. 또한 영상 촬영 장치는 사용자의 발화 음성을 수신하여 발화 텍스트로 변환하거나, 변환된 발 화 텍스트를 입력 받을 수 있다. 예를 들어, 영상 촬영 장치는 find orange T-shirt boy라는 사용자의 발 화 음성이 수신되면 발화 텍스트로 변환하거나, 변환된 상기 텍스트를 수신할 수 있다. 그리고 영상 촬영 장치 는 원격 제어 장치로부터 제 1 영상을 포함하는 제 2 입력을 수신할 수 있다. 즉 영상 촬영 장치 는 원격 제어 장치로부터 사용자 발화에 기초하여 생성된 영상을 수신할 수 있다. 다만 실시 예에 따 라 제 1 입력 및 제 2 입력은 서버로부터 수신될 수도 있다. S220단계에서, 영상 촬영 장치는 제 1 입력에 기반하여 적어도 하나 이상의 제 2 영상을 촬영한다. 즉 영 상 촬영 장치는 제 1 입력에 자연어 처리 인공 신경망에 기반한 의도 분류 학습 모델을 적용하여 제 1 입 력의 의도를 분석할 수 있다. 여기서 자연어 처리 인공 신경망은 제 1 입력으로부터 적어도 두 개 이상의 의도 를 출력하도록 훈련된 자연어 처리 인공 신경망일 수 있다. 다시 말해, 영상 촬영 장치는 사용자가 발화한 음성 입력을 획득하고, 음성 입력을 분석하여 음성 입력이 지시하는 명령을 적어도 하나의 액션으로 분류하고, 분류된 액션 중 사용자 의도 분석에 의해 최종 액션을 결정할 수 있다. 본 실시 예에서는 사용자가 의도한 도메 인이 사람 찾기라고 판단하여, 카메라를 통해 제 1 입력에 기반하여 적어도 하나 이상의 제 2 영상을 촬영 할 수 있다. 즉 영상 촬영 장치는 의도 분류 학습 모델의 출력에 기반하여 제 2 영상을 촬영할 수 있으며, 제 2 영상은 설정 영역 내의 사람들의 영상일 수 있다. 예를 들어, 공항에서 남자 아이를 찾아달라는 의도가 분 석된 경우, 영상 촬영 장치는 공항 내를 이동하면서 남자 아이들의 영상을 촬영할 수 있다.S230단계에서, 영상 촬영 장치는 제 1 영상과 제 2 영상을 비교한다. 이때, 제 1 영상은 제 1 입력에 생성 적 모델 기반의 제 1 학습 모델을 적용하여 획득된 영상으로서, 제 1 입력의 컨텐스트에 대응하는 속성을 갖는 영상일 수 있다. 제 2 영상은 카메라에 의해 촬영된 영상일 수 있다. 즉 영상 촬영 장치는 사용자 발 화에 기초하여 생성된 영상과 카메라에 의해 촬영된 영상을 비교하여 동일 여부를 판단할 수 있다. 영상 촬영 장치는 두 장의 영상을 입력으로 하여 영상의 유사성을 추정하도록 훈련된 머신 러닝 기반의 제 2 학 습 모델을 제 1 영상 및 제 2 영상에 적용함으로써 제 1 영상과 제 2 영상을 비교할 수 있다. 또한 영상 촬영 장치는 제 1 영상 및 제 2 영상으로부터 각각 특징 벡터를 추출하고, 제 1 영상 및 제 2 영상으로부터 추 출된 특징 벡터들을 비교함으로써, 제 1 영상 및 제 2 영상을 비교할 수도 있다. 한편, 영상 촬영 장치는 텍스트의 의도(intent)를 분류하기 위한 의도 분류기(intent classifier)와 영상 을 비교하기 위한 이미지 분류기(image classifier)을 포함할 수 있다. 즉 의도 분류기는 입력된 문장(사용자 명령)이 어떤 의미인지를 추출하는 것으로, 추출된 의도에 기초하여 영상 촬영 장치가 특정 액션을 수행할 수 있도록 한다. 그리고 이미지 분류기는 생성 모델(generative)의 출력 영상을 레이블로 하여 이미지 분류기의 아웃풋 결과와 비교할 수 있다. 즉 이미지 분류기는 입력으로 들어온 영상(예를 들어 카메라로 촬영된 영상)을 분류기 내에서 신경망(neural net) 연산을 통해 레이블링된 영상과 동일한 영상인지 아닌지를 분류할 수 있다. S240단계에서, 영상 촬영 장치는 제 1 영상과 제 2 영상의 비교 결과에 대응하여, 제 2 영상을 전송한다. 즉 영상 촬영 장치는 생성 영상과 촬영 영상을 비교한 결과, 동일하다고 판단되는 경우 촬영 영상을 원격 제어 장치 및/또는 서버에 전송할 수 있다. 본 개시의 실시 예에 의하면, 서로 다른 장소에 위치한 생성 모델 기반 기기와 분류 모델 기반 기기가 양방향 통신하면서 기기에 탑재된 인공지능 알고리즘 및/또는 기계학습 알고리즘을 실행하여 원격 제어를 수행함으로써, 음성 명령 처리를 효과적으로 수행하도록 할 수 있다. 또한, 생성 모델 기반의 기기에서 사용자 발화 음성에 기초하여 영상을 생성하고, 분류 모델 기반의 기기에서 촬영된 영상과 생성 모델에서 생성된 영상의 매칭을 수행하여 매칭 결과를 생성 모델 기반 기기에 제공함으로써, 원거리에 위치한 기기를 효과적으로 제어할 수 있도록 하여 사용자의 만족도를 향상시킬 수 있다. 또한, 생성 모델 기반 기기에서 발화 텍스트의 어텐션을 추출하여 컨텍스트에 대응하는 속성을 갖는 영상을 생 성하도록 함으로써, 영상 생성 결과의 정확도를 향상시킬 수 있다. 또한, 생성 모델 기반 기기에서 사용자 발화 음성에 기초하여 영상을 생성하고, 내부의 판별 모델을 통해 생성 된 영상과 실제 영상과의 판별을 수행하는 과정을 반복하여 생성 모델의 학습을 수행할 수 있도록 함으로써, 트 레이닝 데이터로 커버하지 못하는 영역을 보완하여 생성 모델의 성능을 향상시킬 수 있다. 또한, 분류 모델 기반 기기에서 사용자 발화 음성에 기초한 텍스트 분류 및 이미지 분류를 각각 수행하고, 각각 수행한 결과를 조합하여 특정 의도한 동작이 수행되도록 함으로써, 보다 많은 정보로 사용자의 명령 의도를 효 율적이고 정확하게 판단하도록 할 수 있다. 또한, 5G 네트워크 기반 통신을 통해 원격 제어 장치 및 영상 촬영 장치의 제어를 수행함으로써, 신속한 데이터 처리가 가능하므로 원격 제어 장치 및 영상 촬영 장치의 제어 시스템의 성능을 보다 향상시킬 수 있다."}
{"patent_id": "10-2019-0150648", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 상술한 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다. 이상 설명된 본 발명에 따른 실시 예는 컴퓨터 상에서 다양한 구성요소를 통하여 실행될 수 있는 컴퓨터 프로그 램의 형태로 구현될 수 있으며, 이와 같은 컴퓨터 프로그램은 컴퓨터로 판독 가능한 매체에 기록될 수 있다. 이때, 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매 체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메 모리 등과 같은, 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 한편, 상기 컴퓨터 프로그램은 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 프로그램의 예에는, 컴파일러에 의하여 만들어지는 것 과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함될 수 있다. 본 발명의 명세서(특히 특허청구범위에서)에서 \"상기\"의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 또한, 본 발명에서 범위(range)를 기재한 경우 상기 범위에 속하는 개별적인 값을 적용한 발명을 포함하는 것으로서(이에 반하는 기재가 없다면), 발명의 상세한 설명에 상기 범위를 구성하 는 각 개별적인 값을 기재한 것과 같다. 본 발명에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 발명이 한정되는 것은 아니 다. 본 발명에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사용은 단순히 본 발명을 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 발명의 범위 가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2019-0150648", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 클라우드 네트워크를 포함하는 AI 시스템 기반 원격 제어 장치 및 영상 촬 영 장치의 제어 시스템 환경의 예시도이다. 도 2는 본 발명의 일 실시 예에 따른 원격 제어 장치 및 영상 촬영 장치의 제어 시스템 통신 환경을 개략적으로 설명하기 위하여 도시한 도면이다. 도 3은 본 발명의 일 실시 예에 따른 영상 촬영 장치의 예시도이다. 도 4는 본 발명의 일 실시 예에 따른 원격 제어 장치 및 영상 촬영 장치를 개략적으로 나타낸 블록도이다. 도 5는 본 발명의 일 실시 예에 따른 원격 제어 장치 및 영상 촬영 장치를 보다 구체적으로 설명하기 위한 도면 이다. 도 6은 본 발명의 일 실시 예에 따른 원격 제어 장치의 판별부 예시도이다. 도 7은 본 발명의 일 실시 예에 따른 원격 제어 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 8은 본 발명의 일 실시 예에 따른 영상 촬영 장치의 제어 방법을 설명하기 위한 흐름도이다."}
