{"patent_id": "10-2018-0047781", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0123895", "출원번호": "10-2018-0047781", "발명의 명칭": "디지털 트윈 기반 건설기계 지능화를 위한 실시간 데이터 처리 방법", "출원인": "전자부품연구원", "발명자": "안재훈"}}
{"patent_id": "10-2018-0047781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "현실 세계의 장비를 컴퓨팅 시스템에 가상화하는 단계;장비의 내부 데이터를 수집하는 단계;획득한 내부 데이터를 이용하여 가상화된 장비를 시뮬레이션하는 단계;를 포함하는 것을 특징으로 하는 장비 관리 방법."}
{"patent_id": "10-2018-0047781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,시뮬레이션 결과를 피드백하는 단계;를 더 포함하는 것을 특징으로 하는 장비 관리 방법."}
{"patent_id": "10-2018-0047781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,내부 데이터는,장비의 상태 데이터, 작업 데이터, 이력 데이터 및 품질 보증 데이터 중 적어도 하나를 포함하는 것을 특징으로하는 장비 관리 방법."}
{"patent_id": "10-2018-0047781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,장비의 외부 데이터를 획득하는 단계;를 더 포함하고,시뮬레이션 단계는,획득한 내부 데이터와 외부 데이터를 이용하여 가상화된 장비를 시뮬레이션하는 것을 특징으로 하는 장비 관리방법."}
{"patent_id": "10-2018-0047781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,시뮬레이션 결과를 기초로, 장비의 부품들에 대한 잔존 수명을 파악하는 단계;를 더 포함하는 것을 특징으로 하는 장비 관리 방법."}
{"patent_id": "10-2018-0047781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "에 있어서,고장 예측 단계는,고장 예측에 사용되는 인자들을 추출하고, 추출한 인자들을 이용하여 장비의 고장을 예측하는 것을 특징으로 하는 장비 관리 방법."}
{"patent_id": "10-2018-0047781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "현실 세계의 장비와 통신하는 통신부;현실 세계의 장비를 가상화하고, 통신부를 통해 장비의 내부 데이터를 수집하고, 획득한 내부 데이터를 이용하여 가상화된 장비를 시뮬레이션하는 프로세서;를 포함하는 것을 특징으로 하는 컴퓨팅 시스템."}
{"patent_id": "10-2018-0047781", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "디지털 트윈 기반 건설기계 지능화를 위한 실시간 데이터 처리 방법이 제공된다. 본 발명의 실시예에 따른 장비 관리 방법은, 현실 세계의 장비를 컴퓨팅 시스템에 가상화하고, 장비의 내부 데이터를 수집하여 가상화된 장비를 시뮬레이션한다. 이에 의해, 디지털 트윈을 기반으로 건설기계 장비를 가상세계에 디지털 시뮬레이션 모델화하여 관리할 수 있게 된다."}
{"patent_id": "10-2018-0047781", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 건설기계 장비 관리 기술에 관한 것으로, 더욱 상세하게는 디지털 트윈을 기반으로 건설기계 장비를 가상세계에 디지털 시뮬레이션 모델화하여 관리하는 방법에 관한 것이다."}
{"patent_id": "10-2018-0047781", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "건설기계 장비의 증가에 따라 건설기계 부품은 기하급수적으로 늘어나게 됐는데, 하나의 건설기계만 하더라도 수많은 부품들로 구성되어 있어 부품 각각의 잔여 수명이나 노후 여부 상태를 사람의 직관만으로 판단하기에는 어려운 상황이 되었다. 기존 건설기계 장비를 위한 텔레매틱스 서비스는 장비 활용에만 국한된 기술에 치중하고 있고, 기존 BI(Business Intelligence) 기반 기술로는 직관성/실시간성의 한계 때문에 모든 요구사항을 만족시키는 기능 제 공에 어려움이 있다. 또한, 이들은 건설 작업 환경과 운전자의 숙련도에 의존함에 따라 제공 기술의 활용도가 낮다. 이에, 건설기계, 부품의 현재 상태를 실시간으로 모니터링하고, 시간에 따른 상태 변화와 부품의 잔여 유효수명 을 계산하고, 이를 통해 고장이 일어나기 전까지 부품을 활용할 수 있도록 상태 기반 유지보수 제공 기술이 요 원한 실정이다."}
{"patent_id": "10-2018-0047781", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로서, 본 발명의 목적은, 디지털 트윈을 기반으로 건설기계 장비를 가상세계에 디지털 시뮬레이션 모델화하여 관리하는 방법을 제공함에 있다."}
{"patent_id": "10-2018-0047781", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른, 장비 관리 방법은, 현실 세계의 장비를 컴퓨팅 시스템 에 가상화하는 단계; 장비의 내부 데이터를 수집하는 단계; 획득한 내부 데이터를 이용하여 가상화된 장비를 시 뮬레이션하는 단계;를 포함한다.그리고, 본 발명의 실시예에 따른 장비 관리 방법은, 시뮬레이션 결과를 피드백하는 단계;를 더 포함할 수 있다. 또한, 내부 데이터는, 장비의 상태 데이터, 작업 데이터, 이력 데이터 및 품질 보증 데이터 중 적어도 하나를 포함할 수 있다. 그리고, 본 발명의 실시예에 따른 장비 관리 방법은, 장비의 외부 데이터를 획득하는 단계;를 더 포함하고, 시 뮬레이션 단계는, 획득한 내부 데이터와 외부 데이터를 이용하여 가상화된 장비를 시뮬레이션할 수 있다. 또한, 본 발명의 실시예에 따른 장비 관리 방법은, 시뮬레이션 결과를 기초로, 장비의 부품들에 대한 잔존 수명 을 파악하는 단계;를 더 포함할 수 있다. 그리고, 본 발명의 실시예에 따른 장비 관리 방법은, 시뮬레이션 결과를 기초로, 장비의 고장을 예측하는 단 계;를 더 포함할 수 있다. 또한, 고장 예측 단계는, 고장 예측에 사용되는 인자들을 추출하고, 추출한 인자들을 이용하여 장비의 고장을 예측할 수 있다. 한편, 본 발명의 다른 실시예에 따른, 컴퓨팅 시스템은, 현실 세계의 장비와 통신하는 통신부; 현실 세계의 장 비를 가상화하고, 통신부를 통해 장비의 내부 데이터를 수집하고, 획득한 내부 데이터를 이용하여 가상화된 장 비를 시뮬레이션하는 프로세서;를 포함한다."}
{"patent_id": "10-2018-0047781", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상 설명한 바와 같이, 본 발명의 실시예들에 따르면, 디지털 트윈을 기반으로 건설기계 장비를 가상세계에 디 지털 시뮬레이션 모델화하여 관리할 수 있게 된다. 또한, 본 발명의 실시예들에 따르면, 건설기계, 부품의 현재 상태를 실시간으로 모니터링하고, 시간에 따른 상 태변화와 부품이 기능을 수행할 수 있는 최소한의 조건을 고려하여 잔여 유효수명을 계산하고, 이를 통해 고장 이 일어나기 전까지 부품을 활용할 수 있도록 상태 기반 유지보수가 가능해진다."}
{"patent_id": "10-2018-0047781", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명을 보다 상세하게 설명한다. 도 1은 본 발명의 일 실시예에 따른 건설기계 장비 관리 시스템을 도시한 도면이다. 본 발명의 실시예에 따른 건설기계 장비 관리 시스템은, 생산성이 높은 건설기계 장비를 위해 지능화하고 IoT/ 빅데이터 기반 원격 모니터링 및 예측 기술을 활용하여 작업 환경과 운전자의 숙련도에 의존하지 않고도 높은 작업 생산성을 갖고 주요 부품의 효율성을 높이는 내구성 향상을 위한 서비스를 제공한다. 이를 위해, 본 발명의 실시예에 따른 건설기계 장비 관리 시스템은, 디지털 트윈 기반으로 건설기계 장비를 가 상화하여 시뮬레이션하고 부품의 잔존기간과 고장 등을 예측한다. 이와 같은 기능을 수행하는, 본 발명의 실시예에 따른 건설기계 장비 관리 시스템은, 도 1에 도시된 바와 같이, 건설기계 장비, 건설기계 장비 유지관리 시스템, 공공 데이터 서버 및 사용자 단말이 상호 통 신가능하도록 연결되어 구축된다.건설기계 장비는 현실 세계에 실존하는 장비로, 건설기계 장비 유지관리 시스템에 내부 데이터를 실시 간으로 전달한다. 내부 데이터에는, 건설기계 장비의 상태 데이터, 작업 데이터, 장비 이력(고장/수리 내역) 데이터, 품질 보증 데이터 등이 포함된다. 공공 데이터 서버는 기상 데이터, 건설현장 데이터 등의 외부 데이터를 건설기계 장비 유지관리 시스템 에 제공한다. 건설기계 장비 유지관리 시스템는 건설기계 장비에 대한 디지털 트윈을 생성하여 건설기계 장비를 가상화하고, 건설기계 장비로부터 수집한 건설기계 장비의 내부 데이터와 공공 데이터 서버로부터 수집한 외부 데이터를 이용하여 가상화된 건설기계 장비 모델을 시뮬레이션하여 유지관리한다. 사용자 단말는 건설기계 장비 유지관리 시스템에 의한 시뮬레이션 결과 및 유지관리를 위한 안내를 제 공받기 위한 사용자의 단말이다. 도 1에 도시된 건설기계 장비 유지관리 시스템에 의한 건설기계 장비 유지관리 방법에 대해 도 2를 참조하 여 상세히 설명한다. 도 2는 본 발명의 다른 실시예에 따른 건설기계 장비 유지관리 방법의 설명에 제공되는 흐 름도이다. 도 2에 도시된 바와 같이, 먼저 건설기계 장비 유지관리 시스템이 디지털 트윈 기반으로 건설기계 장비 를 가상화 한다(S210). 이에 의해, 건설기계 장비 유지관리 시스템에는 가상의 건설기계 장비 모델이 생성된다. 구체적으로, 건설기계 장비 모델은 건설기계 장비를 구성하는 부품들에 대한 모델들을 생성하고, 이들을 상호 연결하여 생성된다. 다음, 건설기계 장비 유지관리 시스템이 건설기계 장비로부터 내부 데이터를 실시간으로 수집한다 (S220). 내부 데이터에는, 건설기계 장비의 상태 데이터, 작업 데이터, 장비 이력(고장/수리 내역) 데이터, 품질 보증 데이터 등이 포함됨은 전술한 바 있다. 그리고, 건설기계 장비 유지관리 시스템은 공공 데이터 서버로부터 외부 데이터를 실시간으로 수집한 다(S230). 외부 데이터에는, 기상 데이터, 건설현장 데이터 등이 포함됨은 전술한 바 있다. 이후, 건설기계 장비 유지관리 시스템은 S220단계와 S230단계에서 수집된 데이터들을 이용하여 가상화된 건설기계 장비 모델을 시뮬레이션하고(S240), 시뮬레이션 결과를 지식 DB에 반영/업데이트한다(S250). 나아가, 건설기계 장비 유지관리 시스템은 S240단계에서의 시뮬레이션 결과를 사용자 단말에 피드백한 다(S260). 피드백은 건설기계 장비에 대한 직관적인 3D View 타입으로 이루어진다. 한편, 건설기계 장비 유지관리 시스템은 S240단계에서의 시뮬레이션 결과를 기초로 건설기계 장비의 부품 들에 대한 잔존 수명을 파악하여, 사용자 단말에 피드백할 수 있다(S270). 나아가, 건설기계 장비 유지관리 시스템은 S240단계에서의 시뮬레이션 결과를 기초로 건설기계 장비의 고장을 예측하고, 예측 결과를 사용자 단말에 피드백할 수 있다(S280). 도 3에는 Rule-Based Complex Event Processing을 통해 건설기계 장비의 데이터를 기반으로 부품 모델에 대한 고장 예측과 예지 보전의 개념을 나타내었고, 도 4에는 부품 모델에 대한 고장 예측의 절차를 구체적으로 나타 내었으며, 도 5에는 패턴 비교를 통한 고장 예측 방법을 예시하였다. 고장 예측은, 지식 DB에 저장되어 있는 시뮬레이션 결과들로부터 고장 예측에 사용할 인자들을 추출하고, 추출 한 인자들을 이용하여 장비의 고장을 예측함으로써 이루어진다. 고장 예측에 이용할 인자들은 딥러닝, 기계학습 등의 인공지능 기술을 활용하여 추출할 수 있다. 도 6은, 도 1에 도시된 건설기계 장비 유지관리 시스템의 블럭도이다. 도시된 바와 같이, 건설기계 장비 유지관리 시스템은, 통신부, 프로세서 및 DB를 포함하는 컴퓨팅 시스템으로 구현된다. 통신부는 건설기계 장비, 공공 데이터 서버 및 사용자 단말과 통신하는 인터페이스 수단이다. 프로세서는 도 2에 도시된 건설기계 장비 유지관리 절차를 수행하고, 시뮬레이션 결과 등을 통신부를 통해 사용자 단말에 피드백한다. DB는 도 2에 도시된 건설기계 장비 유지관리를 위해 필요한 지식 DB가 구축된다. 지금까지, 디지털 트윈 기반 건설기계 지능화를 위한 실시간 데이터 처리 방법에 대해 바람직한 실시예를 들어 상세히 설명하였다. 위 실시예에서는, 디지털 트윈을 기반으로 건설기계 장비의 상태 데이터를 가상세계에 디지털 시뮬레이션 모델 화를 제공하고, 건설기계 장비의 부품 단위 관리/서비스 모델 및 고장 예측이 가능하도록 지능형 건설기계의 실 시간 데이터 처리 방법을 제시하고, 인공 지능/기계학습의 활용을 통해 지능형 유지관리 시스템 플랫폼을 제공 하였다. 디지털 트윈 기술을 구현함으로서 물리적 현실세계의 건설기계를 가상화하여 상황을 시뮬레이션하고 그 결과를 다시 피드백 함으로써 지식베이스의 신뢰성을 향상시켰으며, 건설기계에 대한 디지털 트윈을 구성하여 장비 상 태, 작업정보 등의 데이터를 실시간으로 수집하고 3D 형태의 직관적 View 제공하였다. 또한, 공공데이터(도로공사, 기상청 등), SNS 등 외부 데이터와 기계 고장/수리, 품질보증 등 내부데이터를 수 집하여 빅데이터 플랫폼으로 통합 제공하고, 빅데이터(내부, 외부, 장비 데이터)와 지식 DB를 통한 딥러닝을 수 행하여 고장 진단에 사용되는 특징 인자를 추출하고, 이를 바탕으로 고장진단 및 예측 문제를 해결g하는 것이 가능하다. 나아가, 서비스 사용자에게 장비의 상태를 실시간으로 확인하고 주요 부품별 잔존 기대수명을 예측하여 관리할 수 있도록 하고, Rule-Based Complex Event Processing을 통해 건설기계 데이터를 기반으로 주요 부품 및 Function 별 분석 모델을 개발하고 이를 바탕으로 고장예측, 예지보전에 활용한다. 본 발명의 실시예에 따른 장치와 방법의 기능을 수행하게 하는 컴퓨터 프로그램을 수록한 컴퓨터로 읽을 수 있 는 기록매체에도 본 발명의 기술적 사상이 적용될 수 있음은 물론이다. 또한, 본 발명의 다양한 실시예에 따른 기술적 사상은 컴퓨터로 읽을 수 있는 기록매체에 기록된 컴퓨터로 읽을 수 있는 코드 형태로 구현될 수도 있다. 컴퓨터로 읽을 수 있는 기록매체는 컴퓨터에 의해 읽을 수 있고 데이터를 저장할 수 있는 어떤 데이터 저 장 장치이더라도 가능하다. 예를 들어, 컴퓨터로 읽을 수 있는 기록매체는 ROM, RAM, CD-ROM, 자기 테이프, 플 로피 디스크, 광디스크, 하드 디스크 드라이브, 등이 될 수 있음은 물론이다. 또한, 컴퓨터로 읽을 수 있는 기 록매체에 저장된 컴퓨터로 읽을 수 있는 코드 또는 프로그램은 컴퓨터간에 연결된 네트워크를 통해 전송될 수도 있다. 또한, 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시"}
{"patent_id": "10-2018-0047781", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2018-0047781", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 건설기계 장비 관리 시스템을 도시한 도면, 도 2는 본 발명의 다른 실시예에 따른 건설기계 장비 유지관리 방법의 설명에 제공되는 흐름도, 도 3 내지 도 5는 Rule-Based Complex Event Processing을 통한 건설기계 장비의 고장 예측과 예지 보전의 개 념 설명에 제공되는 도면들, 도 6은, 도 1에 도시된 건설기계 장비 유지관리 시스템의 블럭도이다."}
