{"patent_id": "10-2020-0088358", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0013529", "출원번호": "10-2020-0088358", "발명의 명칭": "사용자 체험을 관리하기 위한 시스템 및 그 방법", "출원인": "휴지 글로벌 엘티디.", "발명자": "안톤 고플린"}}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 애플리케이션(304) 및 제2 애플리케이션(308)을 포함하는, 복수의 애플리케이션을 호스팅하는 애플리케이션포털(104, 202)에서 사용자 체험을 관리하기 위한 시스템(102)으로서:- 상기 제1 애플리케이션 내의 제1 사용자(302, 402)의 행동에 상응하는 데이터를 캡쳐하도록 구성된 애플리케이션 기록기(106); 및- 상기 애플리케이션 기록기에 통신 가능하게 커플링된 프로세싱 유닛(108)을 포함하고, 상기 프로세싱 유닛은:- 제1 모듈(110)로서: - 상기 애플리케이션 기록기로부터 캡쳐된 데이터를 획득하도록; 그리고 - 상기 제1 사용자의 행동을 시뮬레이트하게끔, 캡쳐된 데이터를 기초로 제1 디지털 개체(306, 404)를 훈련시키도록 구성되는, 제1 모듈(110); 및- 상기 제1 사용자를 위해서 행동을 실시하게끔 상기 제2 애플리케이션 내에서 제1 디지털 개체를 구현하도록구성된 제2 모듈(112)을 포함하는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제2 모듈(112)은,- 상기 제2 애플리케이션 내에서 상기 제1 디지털 개체에 의해서 달성된 레벨을 결정하는 것;- 상기 제2 애플리케이션 내의 상기 제1 디지털 개체의 행동을 중단시키는 것; 및- 상기 제1 사용자가 상기 제1 디지털 개체에 의해서 달성된 레벨에 후속되는 레벨에서 상기 제2 애플리케이션에 진입할 수 있게 하는 것에 의해서, 상기 제2 애플리케이션 내에서 상기 제1 디지털 개체(306, 404)에 의해서 실시되는 행동을 기초로, 상기 제2 애플리케이션(308) 내의 상기 제1 사용자(302, 402)의 진입 지점을 제어하도록 구성되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 제2 애플리케이션(308)은, 상기 제1 디지털 개체(306, 404)와 상기 제2 애플리케이션의 양립성을 체크하기위한 애플리케이션 프로그램 인터페이스를 포함하고, 상기 애플리케이션 프로그램 인터페이스는, 상기 제1 디지털 개체가 상기 제2 애플리케이션과 양립 가능한 경우에, 상기 제2 모듈(112)이 상기 제1 디지털 개체(306,404)를 상기 제2 애플리케이션 내에서 구현할 수 있게 허용하도록 구성되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 프로세싱 유닛(108)은 제3 모듈(114)을 더 포함하고, 상기 제3 모듈은, 상기 제1 사용자(302, 402)가, 상기 애플리케이션 포털(104, 202) 내의 복수의 애플리케이션에서, 그에 상응하는 제1 디지털 개체(306, 404)의구현에 관한 하나 이상의 승인을 설정할 수 있게 허용하도록 구성되는, 시스템(102).공개특허 10-2021-0013529-3-청구항 5 제4항에 있어서, 상기 제3 모듈(114)은, 상기 제2 애플리케이션에 상응하는 상기 제1 사용자(302, 402)에 의해서 설정된 하나 이상의 승인을 기초로, 상기 제1 디지털 개체(306, 404)의 구현을 위한 상기 제2 애플리케이션(308)에 대한 상기제2 모듈(112)의 접속을 초기 레벨의 미리 결정된 수까지로 제한하도록 추가적으로 구성되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서, 상기 애플리케이션 기록기(106)는, 상기 제1 애플리케이션(304) 상의 제2 사용자(406)의 행동에 상응하는 데이터를 캡쳐하도록 추가적으로 구성되고, 상기 프로세싱 유닛(108)은 제4 모듈(116)을 더 포함하고, 상기 제4 모듈은:- 상기 제2 사용자에 대한 캡쳐된 데이터와 상기 제1 사용자(302, 402)에 대한 캡쳐된 데이터를 비교하도록; - 상기 비교를 기초로 매칭 스코어를 결정하도록; 그리고 - 상기 매칭 스코어가 미리 결정된 문턱값보다 큰 경우에, 그에 의한 구현을 위해서, 상기 제1 사용자(302,402)의 생성된 제1 디지털 개체(306, 404)를 상기 제2 사용자의 프로파일과 연관시키도록 구성되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서, 상기 프로세싱 유닛(108)은 제5 모듈(118)을 더 포함하고, 상기 제5 모듈은:- 상기 제1 사용자(302, 402)로부터 상기 제1 애플리케이션(304)에 대한 등급 값을 수신하도록;- 상기 애플리케이션 포털(104, 202) 내의 복수의 애플리케이션 내의 제1 디지털 개체(306, 404)를 연속적으로구현하도록; 그리고- 상기 제1 사용자로부터 수신된 제1 애플리케이션에 대한 등급 값을 기초로, 상기 복수의 애플리케이션의 각각에 대해서 등급 값을 계산하도록 구성되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제5 모듈(118)은, 상기 각각의 계산된 등급 값을 기초로, 상기 제1 사용자(302, 402)를 위한, 복수의 애플리케이션으로부터의 하나 이상의 애플리케이션의 권장을 생성하도록 추가적으로 구성되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 애플리케이션 기록기(106)는, 상기 애플리케이션 포털(104, 202) 내의, 상기 제1 애플리케이션(304)이 아닌, 하나 이상의 다른 애플리케이션 상의 상기 제1 사용자(302, 402)의 행동에 상응하는 데이터를 연속적으로캡쳐하도록 추가적으로 구성되고, 상기 제1 모듈(110)은, 상기 하나 이상의 다른 애플리케이션 상의 상기 제1사용자의 행동에 상응하는 데이터를 기초로, 상기 제1 디지털 개체(306, 404)를 반복적으로 훈련시키도록 추가공개특허 10-2021-0013529-4-적으로 구성되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서, 상기 애플리케이션 포털(104, 202)이 클라우드 서버이고, 상기 애플리케이션 기록기(106) 및 상기 프로세싱 유닛(108) 중 적어도 하나가 상기 클라우드 서버 내에서 실행되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서, 상기 애플리케이션 기록기(106)에 의해서 캡쳐된 데이터는: 상기 제1 사용자(302, 402)가 상기 제1 애플리케이션(304) 내에서 각각의 행동을 실시하는데 소요된 시간의 지속시간, 상기 제1 애플리케이션 내에서 각각의 행동을 실시하기 위해서 상기 제1 사용자에 의해서 실행된 스킬, 및 상기 제1 애플리케이션 내에서 상기 제1 사용자에 의해서 성공적으로 완료된 레벨의 수 중 적어도 하나를 포함하는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 내지 제11항 중 어느 한 항에 있어서, 상기 제1 모듈(110)은 상기 제1 디지털 개체(306, 404)의 훈련을 위한 기계 학습 알고리즘을 구현하는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제12항 중 어느 한 항에 있어서, 상기 시스템이 상기 복수의 애플리케이션의 베타 테스팅을 위해서 구현되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항 내지 제13항 중 어느 한 항에 있어서, 상기 애플리케이션 포털(104, 202)은 비디오 게임 라이브러리이고, 상기 제1 애플리케이션(304) 및 상기 제2 애플리케이션(308)은 동일한 장르의 비디오 게임인, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제14항 중 어느 한 항에 있어서, 상기 제1 사용자(302, 402)와 연관된 상기 제1 디지털 개체(306, 404)가 인공 지능 봇인, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항 내지 제15항 중 어느 한 항에 있어서, 상기 제1 애플리케이션(304)이 제1 게임이고 상기 제2 애플리케이션(308)은 제2 게임이며, 상기 제1 게임이 상기 제2 게임과 상이한, 시스템(102).공개특허 10-2021-0013529-5-청구항 17 제1항 내지 제16항 중 어느 한 항에 있어서, 상기 애플리케이션 포털(104, 202)은, 적어도, 상기 제1 애플리케이션(304)을 호스팅하는 제1 애플리케이션 포털 및 상기 제2 애플리케이션(308)을 호스팅하는 제2 애플리케이션 포털을 포함하고, 상기 제1 애플리케이션 포털은 상기 제2 애플리케이션 포털과 독립적인, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항 내지 제17항 중 어느 한 항에 있어서, 상기 제2 모듈(112)은 \"N\"개의 상기 복수의 애플리케이션에서 상기 제1 디지털 개체(306, 404)를 연속적으로 구현하도록 추가적으로 구성되고, 상기 제1 디지털 개체는 N개의 복수의 애플리케이션에서 제1 사용자(302, 402)를 대신하여 행동을 실시하도록 구성되는, 시스템(102)."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1 애플리케이션(304) 및 제2 애플리케이션(308)을 포함하는, 복수의 애플리케이션을 호스팅하는 애플리케이션포털(104, 202)에서 사용자 체험을 관리하기 위한 컴퓨터 구현된 방법으로서:- 상기 제1 애플리케이션에서 제1 사용자(302, 402)의 행동에 상응하는 데이터를 캡쳐하는 단계;- 상기 제1 사용자의 행동을 시뮬레이트하도록 상기 캡쳐된 데이터를 기초로 제1 디지털 개체(306, 404)를 훈련시키는 단계; 및- 상기 제1 사용자를 위해서 행동을 실시하도록 상기 제2 애플리케이션 내의 상기 제1 디지털 개체를 구현하는단계를 포함하는, 방법."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, - 상기 제2 애플리케이션 내에서 상기 제1 디지털 개체에 의해서 달성된 레벨을 결정하는 것;- 상기 제2 애플리케이션 내의 상기 제1 디지털 개체의 행동을 중단시키는 것; 및- 상기 제1 사용자가 상기 제1 디지털 개체에 의해서 달성된 레벨에 후속되는 레벨에서 상기 제2 애플리케이션에 진입할 수 있게 하는 것에 의해서,상기 제2 애플리케이션 내에서 상기 제1 디지털 개체(306, 404)에 의해서 실시되는 행동을 기초로 상기 제2 애플리케이션(308) 내의 상기 제1 사용자(302, 402)의 진입 지점을 제어하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제19항 또는 제20항에 있어서,- 상기 제1 디지털 개체(306, 404)와 상기 제2 애플리케이션(308)의 양립성을 체크하는 단계; 및 - 상기 제1 디지털 개체가 상기 제2 애플리케이션과 양립 가능한 경우에, 상기 제2 애플리케이션 내에서 상기제1 디지털 개체를 구현하는 것을 허용하는 단계를 더 포함하는, 방법.공개특허 10-2021-0013529-6-청구항 22 제19항 내지 제21항 중 어느 한 항에 있어서, 상기 제1 사용자(302, 402)가, 상기 애플리케이션 포털(104, 202) 내의 복수의 애플리케이션에서, 그에 상응하는 상기 제1 디지털 개체(306, 404)의 구현에 관한 하나 이상의 승인을 설정할 수 있게 허용하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 제2 애플리케이션에 상응하는 상기 제1 사용자(302, 402)에 의해서 설정된 하나 이상의 승인을 기초로, 상기 제2 애플리케이션(308) 내의 상기 제1 디지털 개체(306, 404)의 구현을 초기 레벨의 미리 결정된 수까지로제한하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제19항 내지 제23항 중 어느 한 항에 있어서,- 상기 제1 애플리케이션(304)에서 제2 사용자(406)의 행동에 상응하는 데이터를 캡쳐하는 단계;- 상기 제2 사용자에 대한 캡쳐된 데이터와 상기 제1 사용자(302, 402)에 대한 캡쳐된 데이터를 비교하는 단계; - 상기 비교를 기초로 매칭 스코어를 결정하는 단계; 및 - 상기 매칭 스코어가 미리 결정된 문턱값보다 큰 경우에, 그에 의한 구현을 위해서, 상기 제1 사용자의 생성된제1 디지털 개체(306, 404)를 상기 제2 사용자의 프로파일과 연관시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제19항 내지 제24항 중 어느 한 항에 있어서,- 상기 제1 사용자(302, 402)로부터 상기 제1 애플리케이션(304)에 대한 등급 값을 수신하는 단계;- 상기 애플리케이션 포털(104, 202) 내의 복수의 애플리케이션 내의 제1 디지털 개체(306, 404)를 연속적으로구현하는 단계; 및- 상기 제1 사용자로부터 수신된 상기 제1 애플리케이션에 대한 등급 값을 기초로, 상기 복수의 애플리케이션의각각에 대해서 등급 값을 계산하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제25항에 있어서, 상기 각각의 계산된 등급 값을 기초로, 상기 제1 사용자(302, 404)를 위한, 상기 복수의 애플리케이션으로부터하나 이상의 애플리케이션의 권장을 생성하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2020-0088358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제19항 내지 제26항 중 어느 한 항에 있어서,- 상기 애플리케이션 포털(104, 202) 내의, 상기 제1 애플리케이션(304)이 아닌, 하나 이상의 다른 애플리케이션 상의 상기 제1 사용자(302, 402)의 행동에 상응하는 데이터를 연속적으로 캡쳐하는 단계; 및공개특허 10-2021-0013529-7-- 상기 하나 이상의 다른 애플리케이션 상의 상기 제1 사용자의 행동에 상응하는 데이터를 기초로 상기 제1 디지털 개체(306, 404)를 반복적으로 훈련시키는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2020-0088358", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "애플리케이션 포털(104, 202) 내의 사용자의 체험을 관리하기 위한 시스템. 그러한 시스템은 애플리케이션 기록기, 그리고 제1 모듈 및 제2 모듈을 포함하는 프로세싱 유닛을 포함한다. 애플리케이션 기록기는 제1 애플리케이션 내의 제1 사용자(302, 402)의 행동에 상응하는 데이터를 캡쳐하도록 구성된다. 프로세싱 유닛은 애플리케이션 기록기에 통신 가능하게 커플링된다. 제1 모듈은, 애플리케이션 기록기로부터 캡 쳐된 데이터를 획득하도록, 그리고 제1 사용자의 행동을 시뮬레이트하게끔 캡쳐된 데이터를 기초로 제1 디지털 개체(306, 404)를 훈련시키도록 구성된다. 제2 모듈은 행동을 실시하게끔 제1 디지털 개체를 제2 애플리케이션 내에서 구현하도록 구성된다."}
{"patent_id": "10-2020-0088358", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시 내용은 일반적으로 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하는 것; 그리고 보다 구체적으로, 애플리케이션 포털에서 애플리케이션 내의 사용자를 대신하여 행동을 실시하기 위 한 디지털 개체를 제공하는 것에 관한 것이다."}
{"patent_id": "10-2020-0088358", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 몇 년간, 사람들의 일반적인 오락 거리 중 하나는 디지털 게임을 플레이하는 것 이었다. 그러한 디지털 게 임은 개별적으로 또는 개인들의 그룹으로 플레이된다. 개인들은 그러한 디지털 게임을 플레이하는 것으로 그들 의 자유 시간을 즐기는 경향이 있다. 디지털 게임은, 매혹적인 그리고 몰입하게 하는 체험을 제공하는 것에 의 해서, 개인이 그 콘텐츠에 계속 몰입하게 한다. 디지털 게임은 일반적으로 휴대 전화, 랩탑, 태블릿 및 기타와 같은 사용자-장치의 도움을 받아 플레이된다. 또한, 디지털 게임은 온라인 서버 또는 단독형 사용자-장치를 이 용하여 플레이될 수 있다. 또한, 디지털 게임은 특정 제약을 기초로 플레이된다. 디지털 게임을 플레이하는 개인은, 사용자-장치의 화면과 같은 사용자 인터페이스 상에서 나타나는 특정 지시를 통해서 제약을 따르도록 안내된다. 또한, 디지털 게임은 그 과정 전체를 통해서 다수의 레벨의 콘텐츠 및 복잡성을 포함한다. 디지털 게임의 과정 중에 개인은, 디지털 게임의 플레이와 관련된 제약을 학습하는 것에 의해서 레벨을 통해서 발전한다. 특히, 개인은, 게임을 플레이하는 동안, 디지털 게임의 제약을 학습하고 디지털 게임의 플레이에서 체험을 획득 한다. 또한, 개인은 상이한 레벨들의 디지털 게임 또는 유사한 콘텐츠 및 복잡성을 갖는 임의의 다른 디지털 게 임을 플레이하는데 관심을 가질 수 있다. 개인은 다른 디지털 게임의 레벨을 플레이하기 위해서 획득 체험을 이 용할 수 있다. 그러나, 개인은, 유사한 콘텐츠로 인해서, 다른 디지털 게임을 플레이하는 동안 따분함을 느낄 수 있다. 또한, 개인은, 다른 디지털 게임의 유사한 콘텐츠로 인해서, 학습이 부족하다고 느낄 수 있다. 결과적 으로, 개인은 플레이를 하는데 있어서 관심을 잃을 수 있다. 또한, 게임 내의 학습 지점에 도달하기 위해서 유 사한 레벨을 플레이하는 것은 시간 및 노력의 낭비를 초래할 수 있다. 그에 따라, 관심 부족은 개인의 사용자 체험 불만족을 초래한다. 그에 따라, 전술한 설명에 비추어 볼 때, 디지털 게임 애플리케이션을 이용하는 동안 사용자 체험의 관리와 연 관된 전술한 단점을 극복할 필요가 존재한다."}
{"patent_id": "10-2020-0088358", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시 내용은 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 시스템 을 제공하고자 한다. 본 개시 내용은 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한, 컴퓨터 구현된 방법을 제공하고자 한다. 본 개시 내용은, 사용자에게 전체적으로 만족스러운 체 험을 제공하기 위해서, 게임을 플레이하는 동안 사용자가 체험하는 기존의 지루함 및 단조로움 문제에 대한 해 결책을 제공하고자 한다. 본 개시 내용의 목적은, 종래 기술에서 직면하는 문제점을 적어도 부분적으로 극복하 는 해결책을 제공하고, 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 효율적이고 매끄러운 접근방식을 제공한다. 일 양태에서, 본 개시 내용의 실시예는, 제1 애플리케이션 및 제2 애플리케이션을 포함하는, 복수의 애플리케이 션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 시스템을 제공하고, 그러한 시스템은:- 제1 애플리케이션 내의 제1 사용자의 행동에 상응하는 데이터를 캡쳐하도록 구성된 애플리케이션 기록기; 및 - 애플리케이션 기록기에 통신 가능하게 커플링된 프로세싱 유닛을 포함하며, 프로세싱 유닛은: - 애플리케이션 기록기로부터 캡쳐된 데이터를 획득하도록, 그리고 제1 사용자의 행동을 시뮬레이트하도록 캡쳐 된 데이터를 기초로 제1 디지털 개체를 훈련시키도록 구성된 제1 모듈; 및 - 제1 사용자를 위해서 행동을 실시하게끔 제2 애플리케이션 내에서 제1 디지털 개체를 구현하도록 구성된 제2 모듈을 포함한다. 다른 양태에서, 본 개시 내용의 실시예는, 제1 애플리케이션 및 제2 애플리케이션을 포함하는, 복수의 애플리 케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 컴퓨터 구현 방법을 제공하고, 그러 한 방법은: - 제1 애플리케이션에서 제1 사용자의 행동에 상응하는 데이터를 캡쳐하는 단계; - 제1 사용자의 행동을 시뮬레이트하게끔 캡쳐된 데이터를 기초로 제1 디지털 개체를 훈련시키는 단계; 및 - 제1 사용자를 위해서 행동을 실시하게끔 제2 애플리케이션 내에서 제1 디지털 개체를 구현하는 단계를 포함한 다. 본 개시 내용의 실시예는 종래 기술과 관련하여 언급된 문제를 실질적으로 제거하거나 적어도 부분적으로 해결 하고, 복수의 애플리케이션에서 사용자가 반복적인 행동을 실시하는 것을 줄임으로써, 복수의 애플리케이션에서 사용자의 관심을 유지할 수 있게 한다. 결과적으로, 시스템은 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 효율적으로 그리고 매끄럽게 관리한다. 본 개시 내용의 부가적인 양태, 장점, 특징 그리고 목적이, 이하의 첨부된 청구항과 관련하여 기술된 예시적인 실시예에 관한 도면 및 상세한 설명으로부터 명확해질 것이다. 첨부된 청구항에 의해서 규정되는 바와 같은 본 개시 내용의 범위로부터 벗어나지 않고도, 본 개시 내용의 특징 들이 다양한 조합으로 조합될 수 있다는 것을 이해할 수 있을 것이다."}
{"patent_id": "10-2020-0088358", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 설명은 본 개시 내용의 실시예, 그리고 그러한 실시예가 구현될 수 있는 방식을 설명한다. 비록 본 개 시 내용이 일부 실행 모드가 개시되었지만, 당업자는 본 개시 내용을 실행 또는 실시하기 위한 다른 실시예가 또한 가능하다는 것을 인지할 수 있을 것이다. 일 양태에서, 본 개시 내용의 실시예는, 제1 애플리케이션 및 제2 애플리케이션을 포함하는, 복수의 애플리케이 션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 시스템을 제공하고, 그러한 시스템은: - 제1 애플리케이션 내의 제1 사용자의 행동에 상응하는 데이터를 캡쳐하도록 구성된 애플리케이션 기록기; 및 - 애플리케이션 기록기에 통신 가능하게 커플링된 프로세싱 유닛을 포함하고, 프로세싱 유닛은: - 애플리케이션 기록기로부터 캡쳐된 데이터를 획득하도록, 그리고 제1 사용자의 행동을 시뮬레이트하도록 캡쳐 된 데이터를 기초로 제1 디지털 개체를 훈련시키도록 구성된 제1 모듈; 및 - 제1 사용자를 위해서 행동을 실시하게끔 제2 애플리케이션 내에서 제1 디지털 개체를 구현하도록 구성된 제2 모듈을 포함한다. 다른 양태에서, 본 개시 내용의 실시예는, 제1 애플리케이션 및 제2 애플리케이션을 포함하는, 복수의 애플리케 이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 컴퓨터 구현 방법을 제공하고, 그러한 방법은: - 제1 애플리케이션에서 제1 사용자의 행동에 상응하는 데이터를 캡쳐하는 단계; - 제1 사용자의 행동을 시뮬레이트하게끔 캡쳐된 데이터를 기초로 제1 디지털 개체를 훈련시키는 단계; 및 - 제1 사용자를 위해서 행동을 실시하게끔 제2 애플리케이션 내에서 제1 디지털 개체를 구현하는 단계를 포함한 다. 본원에서 개시된 시스템 및 방법은 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관 리하기 위한 효율적이고 매끄러운 접근방식을 제공한다. 본원에서, 사용자 체험은, 제어된 그리고 조직화된 방 식으로 다른 애플리케이션과 상호 작용하는데 있어서 사용자를 보조하는 디지털 개체를 제공하는 것에 의해서 향상된다. 유리하게, 시스템은, 실질적으로 감소된 기간 내에 복수의 애플리케이션을 이용하는 동안 사용자가 상당히 발전할 수 있게 한다. 또한, 시스템은, 복수의 애플리케이션에서 사용자가 실시하여야 하는 반복적인 행동을 줄임으로써, 복수의 애플리케이션에서 사용자의 관심을 유지하는데 도움을 준다. 특히, 시스템은 또한, 사용자의 관심에 따라 예측될 수 있는 하나 이상의 애플리케이션의 선택에 있어서 사용자를 보조한다. 또한, 사용자는, 동시에 상당한 기간을 절감하면서, 복수의 애플리케이션 내의 진행을 제어할 수 있다. 또한, 본원에 서 개시된 시스템 및 방법은 애플리케이션 포털과 독립적이다.본 개시 내용은 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 시스템 을 제공한다. 본 개시 내용의 전체를 통해서, 본원에서 사용된 바와 같은 \"애플리케이션 포털\"이라는 용어는, 한 명 이상의 사용자에 의해서 접속될 수 있는 복수의 관련된 애플리케이션을 포함하는 인터랙티브 플랫폼을 지 칭한다. 사용자는 제1 사용자, 그리고 선택적으로 제2 사용자를 포함할 수 있다. 일반적으로, 애플리케이션 포 털은, 한 명 이상의 사용자가 애플리케이션 포털에 접속하기 위해서 이용될 수 있는 클라우드 서버에서 구현될 수 있다. 보다 선택적으로, 애플리케이션 포털은, 한 명 이상의 사용자의 등록을 요구하는 암호 보호형 플랫폼 이다. 또한, 애플리케이션 포털은, 웹-서비스 제공자가 애플리케이션 포털 상의 사용자-활동과 관련된 상세 내 용을 추적할 수 있게 허용하도록 구성될 수 있다. 시스템은, 비제한적으로 전자상거래 포털, 온라인 채팅 포털, 게이밍 포털 및 기타를 포함하는 상이한 유형의 애플리케이션 포털들을 위해서 구현될 수 있다. 실시예 에 따라, 애플리케이션 포털이라는 용어는 또한, 2개의 독립적인 애플리케이션 포털이 애플리케이션 포털을 형 성하는 상황을 지칭할 수 있다. 선택적으로, 이와 관련하여, 애플리케이션 포털은, 적어도, 제1 애플리케이션을 호스팅하는 제1 애플리케이션 포털 및 제2 애플리케이션을 호스팅하는 제2 애플리케이션 포털을 포함하고, 제1 애플리케이션 포털은 제2 애플리케이션 포털과 독립적이다. 본 개시 내용의 전체를 통해서, \"클라우드 서버\"라는 용어는, 정보를 저장, 프로세스 및/또는 공유하도록 구성 된 프로그래밍이 가능한 및/또는 프로그래밍이 가능하지 않은 구성요소를 포함하는 구조 및/또는 모듈을 포함하 는, 가상 서버 또는 플랫폼을 지칭한다. 클라우드 서버는 일반적으로 인터넷을 경유하여 클라우드 컴퓨팅 플랫 폼을 통해서 구축되고, 호스팅되고 그리고 전달된다. 또한, 클라우드 서버는 제1 사용자 및 제2 사용자에 의해 서 원격적으로 접속될 수 있다. 설명된 바와 같이, 애플리케이션 포털은, 제1 애플리케이션 및 제2 애플리케이션을 포함하는 복수의 애플리케이 션을 호스팅한다. 바람직하게, 애플리케이션 포털은 비디오 게임 라이브러리이고, 제1 애플리케이션 및 제2 애 플리케이션은 동일한 장르의 비디오 게임이다. 예에서, 애플리케이션 포털이 게이밍 포털일 수 있다. 게이밍 포털은, 예를 들어, Microsoft XboxTM, Nintendo WiiTM, Sony PlayStationTM 등을 포함할 수 있다. 예에서, 게이 밍 포털과 같은 애플리케이션 포털은 게이밍 애플리케이션과 같은 복수의 애플리케이션을 포함할 수 있다. 제1 사용자는, 애플리케이션 포털에서 이용 가능한 게이밍 애플리케이션에 접속하기 위해서 애플리케이션 포털에 등 록할 필요가 있을 수 있다. 또한, 제1 사용자는, 애플리케이션 포털 상의 게이밍 애플리케이션에 접속하기 위해 서, 애플리케이션 포털에 등록하면서 제1 사용자에 의해서 미리-설정된 암호를 입력할 필요가 있을 수 있다. 이하에서, 애플리케이션 포털은, 달리 언급하지 않는 한, 복수의 게이밍을 호스팅하는 게이밍 포털이다. 또한, 선택적으로, 제1 애플리케이션은 제1 게임이고 제2 애플리케이션은 제2 게임이며, 제1 게임은 제2 게임과 상이 하다. 본 개시 내용의 전체를 통해서, \"복수의 애플리케이션\"이라는 용어는, 제1 사용자가 접속을 위해서 애플리케이 션 포털 상에서 이용될 수 있게 만들어진, 제1 사용자를 위한 구체적인 기능, 과제 또는 활동을 실시하도록 설 계된 완전히 독립적인 컴퓨터 프로그램을 지칭한다. 선택적으로, 복수의 애플리케이션이 게이밍 애플리케이션이 다. 예를 들어, 게이밍 포털과 같은 애플리케이션 포털은, 레이싱 게임, 어드벤처 게임, 퍼즐 게임, 베팅 게임, 액션 게임, 롤-플레잉 게임(RPG), 전략 게임, 슈팅 게임, 시뮬레이션 게임 등과 같은, 다양한 장르의 많은 수의 게이밍 애플리케이션을 포함할 수 있다. 예에서, 게이밍 애플리케이션은 게임을 플레이할 수 있도록 인터랙티브 환경을 제1 사용자에게 제공하도록 설계된다. 제1 사용자는, 제1 사용자가 게이밍 애플리케이션에 접속한 후에, 게이밍 애플리케이션에서 게임을 플레이할 수 있다. 제1 사용자는, 애플리케이션의 특징에 따라, 실시간 모드, 거의 실시간인 모드 또는 오프라인 모드로 애플리케이션에서 게임을 플레이 할 수 있을 것이다. 애플리케이션은 1인-플레이어 게이밍 애플리케이션 또는 다중 플레이어 게이밍 애플리케이션일 수 있다. 전술한 바와 같이, 복 수의 애플리케이션이 제1 애플리케이션 및 제2 애플리케이션을 포함한다. 선택적으로, 제1 애플리케이션 및 제 2 애플리케이션이 동일한 장르의 애플리케이션에 속하고, 예를 들어 제1 애플리케이션이 전쟁-기반의 전략 게임 인 경우에, 제2 애플리케이션이 또한 전쟁-기반의 전략 게임일 수 있다. \"제1 애플리케이션\" 및 \"제2 애플리케 이션\"이라는 용어가 본원의 청구항의 범위를 과도하게 제한하지 않아야 한다는 것을 이해할 수 있을 것이다. \"제1 애플리케이션\" 및 \"제2 애플리케이션\"이라는 용어는 제1 사용자에 의해서 접속되는 애플리케이션 포털 내 의 2개의 애플리케이션을 단순히 나타낸 것이다. 애플리케이션 포털이, 제1 애플리케이션 및 제2 애플리케이션 을 포함하는, 제1 사용자가 접속할 수 있는 복수의 애플리케이션을 호스팅한다는 것을 이해하여야 한다. 이러 한 개시 내용의 목적을 위해서, (이하에서 더 구체적으로 설명되는 바와 같이) 제1 디지털 개체로부터의 어떠한 간섭도 없이 제1 사용자에 의해서 접속되는 애플리케이션 중 임의의 애플리케이션이 \"제1 애플리케이션\"으로 지 칭되고, 애플리케이션이 제1 디지털 개체에 의해서 접속된 후에 제1 사용자가 향하는 임의의 애플리케이션(제1애플리케이션 이외의 다른 애플리케이션)이 \"제2 애플리케이션\"으로 지칭된다. 특히, 사용자는, 복수의 애플리케이션에 입력을 제공하기 위해서 사용자 장치와 연관되는 마우스, 키보드, 조이 스틱, 터치 감응형 입력 장치와 같은 통상적인 포인팅 장치의 이용을 통해서 애플리케이션 포털과 상호 작용할 수 있다. 본 개시 내용의 전체를 통해서, \"사용자 장치\"라는 용어는 일반적으로, 사용자가 애플리케이션 포털 과 연관된 특정 과제를 실시할 수 있게 하는, 사용자와 연관된(또는 사용자에 의해서 사용되는) 전자 장치에 관 한 것이다. 또한, 사용자 환경은, 무선 통신 네트워크에 걸친 음성 및/또는 데이터 통신을 위해서 사용될 수 있는 임의의 전자 장치를 포함하는 것으로 넓게 해석될 수 있다. 사용자 장치는 모바일 전화, 스마트폰, 모바 일 인터넷 장치(MID), 태블릿 컴퓨터, 울트라-모바일 개인용 컴퓨터(UMPC), 패블릿 컴퓨터, 개인정보단말기 (PDA), 웹 패드, 개인용 컴퓨터(PC), 핸드헬드 PC, 랩탑 컴퓨터, 데스크탑 컴퓨터, 네트워크-부착 저장(NAS) 장 치, PC가 내장된 대형 터치 스크린, 및 인터랙티브 엔터테인먼트 장치, 예를 들어 게임 콘솔, 텔레비전(TV) 세 트 및 셋-탑 박스(STB), 비디오 슬롯 머신, 비디오 포커 머신, 키오스크, 카지노 개인 장치를 포함할 수 있고 그러한 것으로 제한되지 않으며, 전형적으로 게이밍 기기와 관련하여 전술한 요소들 중 많은 요소 또는 그 전부 를 포함한다. 그러한 사용자 장치를 통해서, 제1 사용자 및 제2 사용자를 포함하는 많은 수의 사용자가 제1 애플리케이션 및 제2 애플리케이션을 포함하는 복수의 애플리케이션에 접속할 수 있다는 것을 이해할 수 있을 것이다. 예에서, 제1 사용자 및 제2 사용자가 동일 사용자 장치를 통해서 애플리케이션 포털에 접속할 수 있다. 다른 예에서, 제1 사용자 및 제2 사용자가 2개의 상이한 사용자 장치를 통해서 애플리케이션 포털에 접속할 수 있다. 특히, 많은 수의 사용자가 그들의 각각의 사용자 장치를 통해서 동시에 애플리케이션 포털에 접속할 수 있다. 본 개 시 내용 전체를 통해서, 본원에서 사용된 바와 같은 \"사용자\"라는 용어는, 복수의 애플리케이션에 접속하기 위 해서 애플리케이션 포털을 사용하는 사람(즉, 인간)과 관련된다. 특히, \"제1 사용자\" 및 \"제2 사용자\"는 애플 리케이션 포털에 접속하는 2명의 상이한 사용자를 단순히 나타낸 것이고, 본원의 청구항의 범위를 과도하게 제 한하지 않는다. 이하에서, 많은 수의 다른 사용자와 함께 \"제1 사용자\" 및 \"제2 사용자\"라는 용어는 종종 \"사 용자\"로서 통합적으로 지칭될 수 있다. 선택적으로, 각각의 사용자의 사용자 장치와 연관된 사용자 인터페이스를 통해서, 애플리케이션 포털과 사용자 가 인터랙티브 방식으로 접속될 수 있다. 본 개시 내용의 전체를 통해서, \"사용자 인터페이스\"라는 용어는, 사 용자 장치와 연관된 디스플레이 화면 상에 제공된 사용자 인터페이스 요소의 구조화된 세트에 관한 것이다. 선 택적으로, 디스플레이 화면 상에서 제공되는 사용자 인터페이스(UI)는 연관된 디지털 시스템에 의해서 실행될 수 있는 명령어의 임의의 집합 또는 세트에 의해서 생성된다. 또한, 사용자 인터페이스(UI)는 그래픽 및/또는 문자 정보를 전달하기 위해서 그리고 사용자로부터 입력을 수신하기 위해서 상호 작용하도록 동작될 수 있다. 구체적으로, 본원에서 사용되는 사용자 인터페이스(UI)는 그래픽 사용자 인터페이스(GUI)이다. 또한, 사용자 인터페이스(UI) 요소는, 사용자 인터페이스(UI) 내에서 크기 및 위치를 가지는 시각적 물체를 지칭한다. 사용 자 인터페이스 요소는 가시적일 수 있으나, 사용자 인터페이스 요소가 은폐되는 시간이 있을 수 있다. 사용자 인터페이스 제어는 사용자 인터페이스 요소인 것으로 간주된다. 텍스트 블록, 라벨, 텍스트 상자, 목록 상자, 라인, 및 이미지 창, 다이알로그 상자, 프레임, 패널, 메뉴, 버튼, 아이콘, 등이 사용자 인터페이스 요소의 예 이다. 크기 및 위치에 더하여, 사용자 인터페이스 요소는, 가장자리, 공간 또는 기타와 같은, 다른 특성을 가 질 수 있다. 유리하게, 사용자 인터페이스는 애플리케이션 포털 내의 게이밍 애플리케이션 내의 사용자 상호 작용을 돕는다. 본 개시 내용의 목적을 위해서, 이제 예시적인 네트워크 환경이 고려될 것이고, 애플리케이션 기록기 및 프로세 싱 유닛을 포함하는 시스템이 통신 네트워크를 통해서 애플리케이션 포털과 통신한다. 본 개시 내용의 전체를 통해서, \"통신 네트워크\"라는 용어는, 출원 시에 입수가 가능하거나 알려져 있든 간에 또는 추후에 개발되든 간 에, 하나 이상의 전자 장치들 및/또는 데이터베이스들 사이의 데이터 통신을 돕도록 구성된, 상호 연결된 프로 그래밍이 가능한 및/또는 프로그래밍이 가능하지 않은 구성요소의 배열체를 지칭한다. 또한, 통신 네트워크는, 비제한적으로, 하나 이상의 P2P 네트워크, 하이브리드 P2P 네트워크를 포함할 수 있다. 본원에서, 통신 네트워 크는, 서로 상호 연결되고 하나의 큰 네트워크로서 기능하는, 개별적인 네트워크들의 집합일 수 있다. 그러한 개별적인 네트워크들은 유선, 무선, 또는 그 조합일 수 있다. 그러한 개별적인 네트워크의 예는, 비제한적으로, 근거리 네트워크(LAN), 광역 네트워크(WAN), 대도시 네트워크(MAN), 무선 LAN(WLAN), 무선 WAN(WW), 무선MAN(WMAN), 인터넷, 2 세대(2G) 통신 네트워크, 3 세대(3G) 통신 네트워크, 4 세대(4G) 통신 네 트워크 및 와이맥스(WiMAX) 네트워크를 포함한다. 부가적으로 또는 대안적으로, 컴퓨팅 장치는, 를 다른 전자 장치와의 동기화를 위해서, 그 자체의 Bluetooth® 네트워크를 가질 수 있고, Bluetooth® 서버에 연결될 수 있다. 여러 가지 가능한 시나리오에 따라, 네트워크 환경이 다양한 방식으로 구현될 수 있다는 것을 이해할 수 있을 것이다. 하나의 예시적인 시나리오에서, 네트워크 환경은 서버 및 데이터베이스의 공간적으로 합쳐진 배열체의 방식으로 구현될 수 있다. 다른 예시적인 시나리오에서, 네트워크 환경은, 통신 네트워크를 통해서 통신적으로 상호 커플링된 애플리케이션 기록기 및 프로세싱 유닛의 공간적으로 분포된 배열체를 통해서 구현될 수 있다. 또 다른 예시적인 시나리오에서, 애플리케이션 기록기 및 프로세싱은 클라우드 서버를 통해서 구현될 수 있다. 애플리케이션 기록기는, 제1 애플리케이션 내의 제1 사용자의 행동에 상응하는 데이터를 캡쳐하도록 구성된다. 본 개시 내용의 전체를 통해서, 본원에서 사용된 바와 같은 \"애플리케이션 기록기\"라는 용어는, 게이밍 애플리 케이션과 같은 제1 애플리케이션 내에서 사용자에 의해서 실시되는 행동에 상응하는 데이터를 캡쳐하도록 구성 된 하나 이상의 소프트웨어를 지칭한다. 예에서, 애플리케이션 기록기는 독립적인 유닛으로 기능할 수 있고 클 라우드 서버 내에서 실행될 수 있다. 다른 예에서, 애플리케이션 기록기는 제1 사용자와 연관된 사용자 장치 내에 통합된 모듈로서 구현된다. 부가적인 예에서, 애플리케이션 기록기는 애플리케이션 코드 내에 포함된 소 프트웨어 라이브러리 구성요소이다. 그러한 예에서, 소프트웨어 라이브러리 구성요소는, 애플리케이션이 실행될 때, 행동 및 기능 호출을 기록 및 수집하도록 구성된다. 애플리케이션 기록기는, 제1 애플리케이션 내의 제1 사 용자의 행동에 상응하는 데이터를 연속적으로 캡쳐하도록 구성된다. 예에서, 제1 사용자가 \"N\"의 횟수로 제1 애플리케이션에 접속하는 경우에, 애플리케이션 기록기는 \"N\"의 횟수로 제1 사용자의 행동에 상응하는 데이터를 캡쳐하도록 구성된다. 또한, 애플리케이션 기록기는, 제1 애플리케이션 상의 제2 사용자의 행동에 상응하는 데 이터를 캡쳐하도록 구성된다. 또한, 애플리케이션 기록기는 애플리케이션 포털 내의, 제1 애플리케이션이 아닌, 하나 이상의 다른 애플리케이션 상의 제1 사용자의 행동에 상응하는 데이터를 연속적으로 캡쳐하도록 구 성된다. 선택적으로, 사용자는 애플리케이션 기록기의 기능을 조절하기 위해서 애플리케이션 기록기에 접속할 수 있다. 예를 들어, 사용자는, 사용자의 희망에 따라, 애플리케이션 기록기의 기능을 에이블링 또는 디스에이 블링시킬 수 있다. 선택적으로, 애플리케이션 기록기에 의해서 캡쳐된 데이터는: 제1 사용자가 제1 애플리케이션 내에서 각각의 행 동을 실시하는데 소요된 지속시간, 제1 애플리케이션 내에서 각각의 행동을 실시하기 위해서 제1 사용자에 의해 서 실행된 스킬(skill), 및 제1 애플리케이션 내에서 제1 사용자에 의해서 성공적으로 완료된 레벨의 수 중 적 어도 하나를 포함한다. 예에서, 제1 사용자가 제1 애플리케이션 내에서 각각의 행동을 실시하는데 소요된 지속 시간은 제1 애플리케이션 내에서 장애물을 피하기 위해서 제1 사용자가 제1 애플리케이션 내의 캐릭터 또는 도 구를 이동시키는데 소요된 지속 시간, 제1 사용자가 제1 애플리케이션 내의 샷 발사에 반응하는데 소요된 지속 시간 또는 제1 사용자가 샷의 발사를 개시하는데 소요된 지속 시간, 제1 애플리케이션 내에서 제1 사용자가 특 정 위치에 도달하는데 소요된 지속 시간 등에 상응할 수 있다. 예에서, 제1 애플리케이션 내에서 각각의 행동 을 실시하기 위해서 제1 사용자에 의해서 실행되는 스킬은, 전쟁-기반의 게임에서 헤드 샷(head shot)을 취하는 것 또는 레이싱 게임에서 급커브를 취하는 것과 같은 행동의 실시 정확도, 전략-기반 게임 또는 베팅-기반 게임 에서 자원의 관리와 같은 스킬을 가능하게 하는 결정, 게임 내에서 수집된 가장 큰 보상 및 기타에 상응할 수 있다. 애플리케이션 기록기에 의해서 캡쳐된 데이터가 애플리케이션 포털 내에서 호스팅되는 애플리케이션의 유형을 기초로 할 수 있다는 것을 이해할 수 있을 것이다. 특히, 데이터는, 입력이 포인팅 장치에 의해서 수신될 때, 사용자 장치로부터 획득된다. 예에서, 입력이 사용 자 장치와 연관된 터치 스크린을 통해서 수신될 때, 데이터는, 제1 애플리케이션 내에서 캐릭터를 제어하기 위 해서 제1 사용자에 의해서 터치 스크린이 터치된(즉, 탭핑된) 횟수 및 터치 스크린 상에서 터치한 위치로서 획 득된다. 다른 예에서, 입력이 사용자 장치와 연관된 키패드를 통해서 수신될 때, 데이터는, 제1 애플리케이션 내에서 캐릭터를 제어하기 위해서 지정된 특정 행동을 실시하기 위해 제1 사용자가 특정 키(또는 키의 세트/조 합)를 누른 횟수로서 획득된다. 또 다른 예에서, 데이터는, 예를 들어 모션-기반 애플리케이션(예를 들어, 카 레이싱 게이밍 애플리케이션)의 경우에, 사용자 장치의 모션으로서 획득될 수 있다. 여기에서, 데이터는, 제1 애플리케이션에서 캐릭터(본원에서, 예를 들어 자동차)를 제어하기 위해서 사용자 장치가 (예를 들어, 사용자 장치의 자이로스코프 또는 가속도계에 의해서 측정된 바와 같은) 기울어진 특정 각도로서 획득된다. 데이터가, 데이터가 사용자와 연관된 사용자 장치의 유형을 기초로 애플리케이션 기록기에 의해서 기록될 수 있는 많은 수 의 방식이 있을 수 있다는 것을 이해할 수 있을 것이다. 선택적으로, 애플리케이션 기록기에 의해서 획득된 데이터가 데이터베이스 내에 저장된다. 데이터베이스는 애 플리케이션 기록기에 그리고 프로세싱 유닛에 통신 가능하게 커플링된다. 본 개시 내용의 전체를 통해서, 본원 에서 사용된 바와 같은 \"데이터베이스\"라는 용어는, 데이터 또는 조직화된 그 본체가 나타나는 방식과관계없이, 디지털 정보의 조직화된 본체를 지칭한다. 선택적으로, 데이터베이스는 소프트웨어, 펌웨어 및/또는 그 임의의 조합일 수 있다. 예를 들어, 관련된 데이터의 조직화된 본체는 표, 맵, 그리드, 패킷, 데이터그램, 파일, 문서, 목록의 형태 또는 임의의 다른 형태일 수 있다. 데이터베이스는, 예를 들어 IBM DB2 및 Oracle 9와 유사한 관계형 데이터베이스와 같은, 임의의 데이터 저장 소프트웨어 및 시스템을 포함한다. 선택적으로, 당업 계에서 일반적인 바와 같이, 데이터베이스는 본원에서 데이터베이스 관리 시스템으로서 상호 교환 가능하게 사 용될 수 있다. 또한, 데이터베이스 관리 시스템은 하나 이상의 데이터베이스를 생성 및 관리하기 위한 소프트 웨어 프로그램을 지칭한다. 선택적으로, 당업자가 이해할 수 있는 바와 같이, 데이터베이스는, 관계형 모델을 엄격하게 준수할 것을 강요하는지의 여부와 관계없이, 관계형 동작을 지원하도록 동작될 수 있다. 선택적으로, 애플리케이션 기록기는 사용자 장치와 연관된 메모리 내에 캡쳐된 데이터를 저장한다. 본원에서 사 용된 바와 같은 \"메모리\"라는 용어는, 장치가 임의의 지속시간 동안 데이터 또는 소프트웨어를 저장할 수 있는, 전기 회로, 자기 디스크, 가상 메모리 또는 광학 디스크와 같은, 휘발성의 또는 지속적인 매체를 지칭한다. 선 택적으로, 메모리는 물리적 저장 매체와 같은 비-휘발성 대량 저장장치이다. 또한, 시스템이 분산된 시나리오에 서, 메모리는 분산될 수 있다. 프로세싱 유닛은 애플리케이션 기록기에 통신 가능하게 커플링된다. 본 개시 내용의 전반을 통해서, \"프로세싱 유닛\"이라는 용어는, 시스템을 구동하는 명령어에 응답하도록 동작될 수 있고, 그러한 명령어를 프로세스한다. 선택적으로, 프로세서는, 비제한적으로, 마이크로프로세서, 마이크로제어기, 복합 명령어 세트 컴퓨팅(CISC) 마 이크로프로세서, RISC(reduced instruction set) 마이크로프로세서, VLIW(very long instruction word) 마이크 로프로세서, 또는 임의의 다른 유형의 프로세싱 회로를 포함한다. 또한, \"프로세서 유닛\"이라는 용어는 하나 이 상의 개별적인 프로세서, 프로세싱 장치, 및 다른 프로세싱 장치들에 의해서 공유될 수 있는 프로세싱 장치와 연관된 다양한 요소들을 지칭할 수 있다. 또한, 하나 이상의 개별적인 프로세서, 프로세싱 장치, 및 요소는, 시 스템을 구동하는 명령어에 응답하기 위한 그리고 그러한 명령어를 프로세스하기 위한 다양한 아키텍처로 배열된 다. 애플리케이션 기록기에 의해서 획득된 데이터가 추가적인 프로세싱을 위해서 프로세싱 유닛에 전달된다. 선택 적으로, 애플리케이션 기록기로부터 획득된 데이터는, 이하에서 훈련 데이터세트로 지칭되는, 데이터 세트의 형 태로 프로세싱 유닛에 전달된다. 예에서, 제1 사용자가 제1 시간 동안 제1 애플리케이션 상에서 행동을 실시할 때, 훈련 데이터의 제1 세트가 생성된다. 또한, 제1 사용자가 제1 애플리케이션 상에서 후속 행동을 실시할 때, 훈련 데이터의 제2 세트가 생성된다. 유사하게, 제1 훈련 데이터세트, 제2 훈련 데이터세트, 및 N번째 훈 련 데이터세트까지와 같은, \"N\"의 수의 훈련 데이터세트가 생성된다. 제1 애플리케이션에서 제1 사용자의 행동 에 의해서 생성된 훈련 데이터세트의 각각이 이어서 프로세싱 유닛에 전달된다. 프로세싱 유닛은 제1 모듈을 포함한다. 제1 모듈은, 캡쳐된 데이터를 애플리케이션 기록기로부터 획득하도록 구성된다. 예에서, 제1 모듈은 애플리케이션 기록기에 의해서 전달된 바와 같은 많은 수의 훈련 데이터세트를 수신하도록 구성된다. 선택적으로, 제1 모듈은 애플리케이션 기록기로부터 캡쳐된 데이터를 수신하기 위한 수 신 유닛을 포함한다. 또한, 제1 모듈은 제1 사용자의 행동을 시뮬레이트하기 위해서 캡쳐된 데이터를 기초로 제1 디지털 개체를 훈련시키도록 구성된다. 특히, 제1 디지털 개체는 제1 모듈에 의해서 생성되고 그에 의해서 캡쳐된 데이터를 기초로 제1 사용자의 행동을 시뮬레이트하도록 훈련된다. 본원에서, 제1 디지털 개체는, 제1 사용자의 행동을 모방하는 가상의 플레이어를 지칭한다. 제1 디지털 개체는 제1 사용자의 행동을 복제하도록 구성된다. 또한, 제1 디지털 개체는 제1 사용자의 각각의 그리고 모든 행동을 복제할 수 있도록 구성될 수 있다. 일부 실시예에서, 제1 디지털 개체는 제1 사용자보다 더 숙련되도록 훈련될 수 있다. 제1 디지털 개체는, 제1 애플리케이션 내에서 제1 사용자에 의해서 획득된 유사한 스킬 레벨을 가질 것이다. 예에서, 제1 사용자가 제1 애플리케이션을 플레이하는데 있어서 전문가 레벨을 가지는 경우에, 제1 디지털 개체는 제1 사용 자와 동일한 경험 레벨을 가지도록 구성된다. 선택적으로, 제1 모듈은 제1 디지털 개체의 훈련을 위한 기계 학습 알고리즘을 구현한다. 특히, 제1 디지털 개 체는 제1 모듈에 의해서 수신된 훈련 데이터세트를 기초로 훈련된다. 본 개시 내용의 전반을 통해서, 본원에서 사용된 바와 같은 \"기계 학습 알고리즘\"이라는 용어는 소프트웨어-기반의 알고리즘을 지칭하고, 그러한 알고리 즘은 컴퓨팅 하드웨어에서 실행될 수 있고, 컴퓨팅 하드웨어 상에서 실행될 때, 소프트웨어-기반의 알고리즘에 제공되는 정보에 따라서 적응형 방식으로 그 동작 매개변수를 적응시키고 조정하도록 동작될 수 있다. 선택적으 로, 기계 학습 알고리즘은, 반복 신경망, 재귀 신경망, 피드-포워드 신경망, 컨볼루션 신경망(convolutional neural network), 딥 빌리프 네트워크(deep belief network), 및 컨볼루션 딥 빌리프 네트워크와 같은 신경망; 자가-조직화 맵; 딮 볼츠만 기계(deep Boltzmann machine); 그리고 적층형 노이즈-제거 자동-인코더(stackedde-noising auto-encoder)를 포함한다. 선택적으로, 기계 학습 알고리즘은 이하의 연산 기술: 구속 조건 프로그 램, 퍼지 논리, 분류, 기호 조작, 퍼지 세트 이론, 진화 연산, 사이버네틱스, 데이터 채굴, 근사 추론, 미분-없 는 최적화(derivative-free optimization), 의사 결정 트리 또는 소프트 컴퓨팅 중 임의의 하나 또는 그 조합을 이용한다. 또한, 본 명세서에서 사용되는 바와 같은 \"신경망\"이라는 용어는, 각각 선택적으로 로컬 메모리와 연 관된, 고도로 상호 연결된 처리 요소들의 네트워크를 포함할 수 있다. 일 예에서, 신경망은 코오넨 맵(Kohonen map), 자가-조직화 맵, 다층 퍼셉트론(multi-layer perceptron) 등일 수 있다. 또한, 신경망의 프로세싱 요소 는 \"인공 신경 유닛\", \"인공 뉴런\", \"신경 유닛\", \"뉴런\", \"노드\"등일 수 있다. 또한, 뉴런은 입력부 또는 하 나 이상의 다른 뉴런으로부터 데이터를 수신할 수 있고, 데이터를 프로세스할 수 있고, 프로세스된 데이터를 출 력부 또는 하나 이상의 다른 뉴런으로 전송할 수 있다. 신경망 또는 그 하나 이상의 뉴런은 하드웨어, 소프트웨 어 또는 하드웨어 및 소프트웨어의 조합으로 생성될 수 있으며, 신경망은 추후에 훈련될 수 있다. 제1 모듈이 기계 학습 알고리즘을 구현함에 따라, 제1 디지털 개체를 훈련 시키는데 이용될 수 있는 훈련 데이터세트의 수 가 많을수록, 제1 사용자의 행동을 시뮬레이트하는 것과 관련하여 제1 디지털 개체의 정확도가 더 커진다는 것 을 이해할 수 있을 것이다. 선택적으로, 제1 사용자와 연관된 제1 디지털 개체는 인공 지능 봇(artificial intelligence bot)이다. 인공 지능 봇은, 클라우드 서버, 또는 애플리케이션 포털에서 복수의 애플리케이션과 상호 작용하는 사용자 장치와 같은 네트워크 상에 존재하는, 인공 지능을 통해 훈련된 자율적 프로그램을 지칭한다. 여기에서, 본 개시 내용 에서, 인공 지능 봇은, 게이밍 애플리케이션 상에서 게임을 하는 사용자와 유사한 방식으로 거동하도록 구성된 다. 예를 들어, 인공 지능 봇은, 게이밍 애플리케이션과 같은 애플리케이션의 레벨을 클리어하기 위해 사용자에 의해 실시되는 행동과 같은, 사용자의 거동을 모방한다. 본원에서 사용된 바와 같은 \"인공 지능\"이라는 용어는, 컴퓨팅 환경 내의 제1 디지털 개체 또는 다른 요소와 같은, 봇을 제어하기 위해서 지식, 기술 및 방법 론을 조합하는 임의의 메커니즘 또는 연산 지능 시스템에 관한 것이다. 또한, 인공 지능(AI)은 지식을 적용하도 록 구성되고, 변화하는 환경에서 자가 적응할 수 있고 더 잘 수행하는 법을 배울 수 있다. 또한, 임의의 연산 지능 기술을 이용하여, 인공 지능(AI)은 성능을 개선하기 위해 알 수 없거나 변화되는 환경에 적응하도록 동작 될 수 있다. 인공 지능(AI)은 퍼지 로직 엔진, 의사-결정 엔진, 미리-설정된 타겟팅 정확도 수준, 및/또는 프로 그래밍 방식으로 지능적인 소프트웨어를 포함한다. 본 개시 내용의 맥락에서, 인공지능(AI)은 소프트웨어-기반 의 알고리즘과 관련되며, 그러한 알고리즘은 컴퓨팅 하드웨어에서 실행될 수 있고, 컴퓨팅 하드웨어 상에서 실 행될 때, 소프트웨어-기반의 알고리즘에 제공되는 정보에 따라서 적응형 방식으로 그 동작 매개변수를 적응시키 고 조정하도록 동작될 수 있다. 선택적으로, 인공 지능(AI)은 이하의 연산 기술: 구속 조건 프로그램, 퍼지 논 리, 분류, 통상적인 인공 지능, 기호 조작, 퍼지 세트 이론, 진화 연산, 사이버네틱스, 데이터 채굴, 근사 추론, 미분-없는 최적화, 의사 결정 트리 또는 소프트 컴퓨팅 중 임의의 하나 또는 그 조합을 이용한다. 선택적으로, 제1 모듈은, 많은 횟수로 제1 애플리케이션 상의 제1 사용자의 행동에 상응하는 데이터를 기초로 제1 디지털 개체를 반복적으로 훈련시키도록 구성된다. 예에서, 제1 사용자가 최초로 제1 애플리케이션 상에서 행동을 실시할 때, 제1 훈련 데이터세트가 생성되고, 제1 모듈은 최초로 제1 디지털 개체를 훈련시키도록 구성 된다. 또한, 제1 사용자가 2번째로 제1 애플리케이션 상에서 행동을 실시할 때, 제2 훈련 데이터세트가 생성되 고, 제1 모듈은 2번째로 제1 디지털 개체를 훈련시키도록 구성된다. 유사한 방식으로, 제1 사용자가 N번째로 제1 애플리케이션 상에서 행동을 실시할 때, N번째 훈련 데이터세트가 생성되고, 제1 모듈은 N번째로 제1 디지 털 개체를 훈련시키도록 구성된다. 설명된 바와 같이, 제1 사용자가 제1 애플리케이션에 많은 횟수로 접속할 때, 제1 디지털 개체는 반복적으로 훈련되고 제1 모듈에 의해서 수신된 훈련 데이터세트를 기초로 일정하게 업 데이트된다. 특히, 제1 애플리케이션이 \"N\"의 횟수로 접속되었을 때, 제1 디지털 개체는 총 \"N\"의 횟수로 훈련 되었을 수 있다. 제1 사용자가 제1 애플리케이션에서 발전함에 따라, 제1 디지털 개체가 애플리케이션 기록기 로부터 수신된 반복적인 훈련 데이터세트를 기초로 지속적으로 업데이트된다는 것을 이해할 수 있을 것이다. 예를 들어, 게이밍 애플리케이션의 경우에, 제1 사용자는 제1 애플리케이션 내에서 1번째보다 2번째 또는 3번째 에서 보다 양호한 성과를 전달할 수 있고, 이어서 제1 디지털 개체는 2번째의 제1 사용자의 성과에 따라 스킬과 관련하여 업데이트될 것이다. 선택적으로, 제1 모듈은, 하나 이상의 다른 애플리케이션 상의 제1 사용자의 행동에 상응하는 데이터를 기초로 제1 디지털 개체를 반복적으로 훈련시키도록 추가적으로 구성된다. 예에서, 제1 사용자가 \"i\"의 횟수로 제1 애 플리케이션 상에서 행동을 실시할 때, \"i\"의 수의 훈련 데이터세트가 연속적으로 생성되고, 제1 모듈은 상응하 는 생성 데이터세트에서 \"i\"의 횟수로 제1 디지털 개체를 반복적으로 훈련시키도록 구성된다. 또한, 제1 사용 자가 \"j\"의 횟수로 제2 애플리케이션 상에서 행동을 실시할 때, \"j\"의 수의 훈련 데이터세트가 연속적으로 생성 되고, 제1 모듈은 상응하는 생성 데이터세트에서 \"j\"의 횟수로 제1 디지털 개체를 반복적으로 훈련시키도록 구성된다. 또한, 제1 사용자가 \"k\"의 횟수로 N번째 애플리케이션 상에서 행동을 실시할 때, \"k\"의 수의 훈련 데 이터세트가 연속적으로 생성되고, 제1 모듈은 상응하는 생성 데이터세트에서 \"k\"의 횟수로 제1 디지털 개체를 반복적으로 훈련시키도록 구성된다. 설명된 바와 같이, 제1 사용자가 \"i\" 횟수, \"j\" 횟수, 및 \"k\" 횟수의 각각 에 대해서 제1 애플리케이션, 제2 애플리케이션 및 N번째 애플리케이션까지 접속할 때, 제1 사용자와 연관된 제 1 디지털 개체는 제1 모듈에 의해서 수신된 훈련 데이터세트를 기초로 반복적으로 훈련되고 지속적으로 업데이 트된다. 특히, N번째 애플리케이션이 \"k\"의 횟수로 접속되었을 때, 제1 디지털 개체는 총 (i+j+k)의 횟수로 훈 련된다. 제1 사용자가 제1 애플리케이션, 제2 애플리케이션, 및 N번째 애플리케이션의 각각에서 발전됨에 따라, 제1 디지털 개체가, 애플리케이션 기록기로부터 수신된 \"i\"의 수의 훈련 데이터세트, \"j\"의 수의 훈련 데 이터세트 및 \"k\"의 수의 훈련 데이터세트를 기초로 반복적으로 업데이트된다는 것을 이해할 수 있을 것이다. 또한, 프로세싱 유닛은 제2 모듈을 포함한다. 제2 모듈은, 행동을 실시하게끔 제2 애플리케이션 내에서 제1 디 지털 개체를 구현하도록 구성된다. 즉, 제1 사용자의 행동을 시뮬레이트하도록 훈련되는 제1 디지털 개체가 제 2 애플리케이션 내에 구현된다. 특히, 제1 디지털 개체가 제2 애플리케이션에 접속할 때, 제1 디지털 개체는, 일반적으로 제1 사용자가 실시하였을 수 있는 것과 유사한 방식으로, 제2 애플리케이션 상에서 행동을 실시한다. 언급한 바와 같이, 제1 디지털 개체는, 제1 사용자의 행동을 시뮬레이트하여 제2 애플리케이션 내에 서 특정 캐릭터 또는 도구를 제어하기 위해서 제2 애플리케이션에 접속하는 인공 지능 봇이다. 선택적으로, 제2 애플리케이션은, 제1 디지털 개체와 제2 애플리케이션의 양립성(compatibility)을 체크하기 위 한 애플리케이션 프로그램 인터페이스를 포함한다. 본원에서 사용된 바와 같은 \"애플리케이션 프로그램 인터페 이스\"라는 용어는, 다른 프로그램의 특징에 접속하기 위해서 애플리케이션 프로그램으로부터 호출될 수 있는 기 능의 세트를 지칭한다. 또한, 애플리케이션 프로그램 인터페이스(API)는, 하나 이상의 루틴, 데이터 구조, 객체 분류, 및/또는 아카이빙 플랫폼(archiving platform) 및 저장 시스템의 상호 작용을 지원하는 프로토콜을 포함 하는, 소프트웨어 인터페이스이다. 애플리케이션 프로그램 인터페이스(API)는, 예를 들어, 특정 애플리케이션 또는 동작 환경과 일치되는 소프트웨어 애플리케이션의 구축을 가능하게 하는 구축 블록을 포함한다. API는, 애 플리케이션 구축 시간에 컴파일링될 수 있는 프로그래밍 언어와 관련하여 특정될 수 있다. 특히, 애플리케이션 프로그램 인터페이스는, 제1 디지털 개체가 제2 애플리케이션과 양립 가능한 경우에, 제2 모듈이 제1 디지털 개 체를 제2 애플리케이션 내에서 구현할 수 있게 허용하도록 구성된다. 실시예에서, 제2 모듈은, - 제2 애플리케이션 내에서 제1 디지털 개체에 의해서 달성된 레벨을 결정하는 것; - 제2 애플리케이션 내의 제1 디지털 개체의 행동을 중단시키는 것; 및 - 제1 사용자가 제1 디지털 개체에 의해서 달성된 레벨에 후속되는 레벨에서 제2 애플리케이션에 진입할 수 있 게 하는 것에 의해서, 제2 애플리케이션 내에서 제1 디지털 개체에 의해서 실시되는 행동을 기초로, 제2 애플리케이션 내의 제1 사용 자의 진입 지점을 제어하도록 구성된다. 여기에서, \"진입 지점\"이라는 용어는, 제1 사용자가 접속할 수 있는 또는 그로부터 시작할 수 있는, 제2 애플리 케이션 내의 지점 또는 레벨을 지칭한다. 여기에서, 진입 지점은, 제1 사용자가, 제1 디지털 개체의 중단 지점 으로부터, 제2 애플리케이션 내에서 행동을 재개하도록 지시 받는 제2 애플리케이션 내의 레벨일 수 있다. 특 히, 제2 애플리케이션 내의 제1 사용자의 진입 지점은 제1 디지털 개체의 진출 지점을 계승한다. 제1 사용자의 진입 지점은 제2 애플리케이션 내의 하나의 지점 이후이며, 그러한 제2 애플리케이션의 하나의 지점 이후에는 제1 디지털 개체가 제2 애플리케이션에 접속할 수 없다. 또한, 제1 디지털 개체가 제2 애플리케이션에 접속할 수 있는 가능성은, 제1 디지털 개체에 의해서 획득된 스킬 레벨에 따라 달라진다. 유리하게, 제2 모듈은 제2 애플리케이션의 진입 지점에 대한 제1 사용자의 직접적인 접속을 제공하도록, 그리고 제2 애플리케이션 내의 초 기 지점에 대한 접속을 제공하지 않도록 구성된다. 예에서, 제2 애플리케이션이 10개의 레벨을 포함하고, 제1 디지털 개체는 제2 애플리케이션에서 5개의 레벨을 클리어하도록 운영되면, 제2 애플리케이션 내의 제1 사용자 의 진입은 6번째 레벨이 된다. 제1 사용자가 최초로 제2 애플리케이션과 상호 작용할 때, 제1 사용자는, 제2 애플리케이션 내에서 이전의(초기의) 5개의 레벨을 클리어할 필요가 없이, 6번째 레벨로 지시 받는다. 그 이후 에, 시스템은, 사용자가, 초기 레벨로부터 각각의 그리고 모든 게임을 플레이하는 것과 관련된 지루함을 피하면 서, 상이한 비디오 게임을 플레이하는 즐거움을 체험할 수 있게 한다. 또한, 제1 사용자가 제2 애플리케이션의 불필요한 레벨을 건너 뛸 수 있음에 따라, 시스템은 컴퓨팅 자원을 절감할 수 있다.실시예에 따라, 프로세싱 유닛은 제3 모듈을 더 포함한다. 제3 모듈은, 제1 사용자가, 애플리케이션 포털 내의 복수의 애플리케이션에서, 그에 상응하는 제1 디지털 개체의 구현에 관한 하나 이상의 승인을 설정할 수 있게 허용하도록 구성된다. 여기에서, 하나 이상의 승인은, 비제한적으로, 애플리케이션의 특정 장르에 대한 접속의 승인, 규정된 등급 보다 높은 애플리케이션에 대한 접속의 승인, 규정된 기간 동안 제2 애플리케이션에 대한 접 속의 승인, 제2 애플리케이션 내의 특정 레벨까지의 제2 애플리케이션에 대한 접속의 승인, 등을 포함할 수 있 다. 선택적으로, 제3 모듈은 제1 사용자의 프로파일을 생성하고, 제1 디지털 개체를 제1 사용자의 프로파일에 연관시킨다. 제1 사용자의 프로파일은 또한, 사용자 명의를 규정하는 것 그리고 제1 사용자의 프로파일에 특유 한 암호를 설정하는 것에 의해서, 사용자에 의해서 맞춤될 수 있다. 또한, 제1 사용자는, 제1 사용자에 특유한 사용자명 및 암호의 유효 조합을 입력하는 것에 의해서 그 자신의 프로파일에 접속할 수 있고, 애플리케이션 포 털 내의 제1 디지털의 구현에 관한 하나 이상의 승인을 설정할 수 있다. 특히, 전술한 바와 같이, 제1 디지털 개체는, 하나 이상의 애플리케이션 내에서 구현될 때 제1 사용자의 행동을 시뮬레이트하는 인공 지능 봇이다. 그러나, 제1 디지털 개체의 구현을 제어하여 제1 사용자의 필요에 따라 제1 디지털 개체를 개인화할 수 있도록, 특정 승인이 제1 사용자에 의해서 규정될 수 있다. 선택적으로, 제3 모듈은, 제2 애플리케이션에 상응하는 제1 사용자에 의해서 설정된 하나 이상의 승인을 기초로, 제1 디지털 개체의 구현을 위한 제2 애플리케이션에 대한 제2 모듈의 접속을 초기 레벨의 미리 결정된 수까지로 제한하도록 추가적으로 구성된다. 애플리케이션 포털과 연관된 사용자의 각각에 대한 프로파일을 생성하도록 제3 모듈이 구성된다는 것을 이해할 수 있을 것이다. 선 택적으로, 사용자의 각각의 프로파일이 데이터베이스 내에 저장될 수 있고, 통신 네트워크를 통해서 각각의 사 용자에 의해서 접속될 수 있다. 대안적으로, 사용자의 프로파일은, 각각의 사용자의 각각의 사용자 장치와 연 관된 메모리 내에 저장된다. 선택적으로, 제1 사용자는, 제1 디지털 개체가 제2 애플리케이션 내에서 행동을 실시하도록 허여되는 초기 레벨 을 규정할 수 있다. 미리 결정된 레벨을 넘어서 제1 디지털 개체가 구현되는 것을 제한하기 위한 승인을 제1 사용자가 설정할 때, 제2 애플리케이션에 대한 제2 모듈의 접속은 제2 애플리케이션 내의 미리 결정된 레벨까지 만 허용된다. 예에서, 제1 사용자는, 제1 디지털 개체에 의해서 접속될 수 있는 제2 애플리케이션 내의 레벨 5 까지의 승인을 설정할 수 있다. 그에 따라, 제2 모듈은, 행동을 실시하도록 그리고 레벨 5까지만 게임 플레이 를 완료하도록, 제1 디지털 개체를 제2 애플리케이션 내에서 구현할 것이다. 제2 모듈은 레벨 5를 넘어서는 제 1 디지털 개체의 접속을 제공하지 않을 것이다. 또한, 제1 사용자가 제2 애플리케이션과 상호 작용할 때, 제1 사용자의 진입 지점은 레벨 6이 되는 한편, 레벨 6 이전의 모든 레벨은 제1 디지털 개체에 의해서 이미 클리어 되었을 수 있다. 실시예에 따라, 프로세싱 유닛은 제4 모듈을 더 포함한다. 제4 모듈은 제2 사용자에 대한 캡쳐된 데이터를 제1 사용자에 대한 캡쳐된 데이터와 비교하도록 구성된다. 선택적으로, 제1 사용자의 훈련 데이터세트의 각각은 제 2 사용자의 데이터세트의 각각과 비교된다. 구체적으로, 동일한 제1 애플리케이션 내에서 제1 사용자에 의해서 실시된 행동과 제2 사용자에 의해서 실시된 행동 사이의 비교가 이루어진다. 또한, 제4 모듈은 그러한 비교를 기초로 매칭 스코어(matching score)를 결정하도록 구성된다. 여기에서, 매칭 스코어는, 제1 사용자의 훈련 데 이터세트가 제2 사용자의 훈련 데이터세트와 얼마나 밀접하게 관련되는지를 결정하는, 계산된 값이다. 매칭 스 코어는 제1 사용자의 훈련 데이터세트와 제2 사용자의 훈련 데이터세트 사이의 상호-관련성의 정량적인 측정치 이다. 매칭 스코어가 일반적으로 제1 사용자 및 제2 사용자의 플레잉 스킬들 사이의 유사성의 측정치라는 것을 이해할 수 있을 것이다. 또한, 매칭 스코어가 미리 결정된 문턱값보다 큰 경우에, 제4 모듈은, 그에 의한 구현을 위해서, 제1 사용자의 생성된 제1 디지털 개체를 제2 사용자의 프로파일과 연관시키도록 구성된다. 여기에서, 미리 결정된 문턱값은 매칭 스코어의 최소의 계산된 값이고, 그러한 최소의 계산된 값 미만에서 제1 사용자의 행동 및 제2 사용자의 행동은 유사한 것으로 간주될 수 없다. 제1 사용자 및 제2 사용자에 대해서 결정된 매칭 스코어가 미리 결정된 문턱값을 초과한다는 것이 결정된 경우에, 제2 디지털 개체는 생성될 필요가 없고, 제1 디지털 개체가 제2 사용 자와 또한 연관된다. 예에서, 제2 사용자와 연관된 제1 디지털 개체는, 제2 사용자와 연관된 제1 디지털 개체 의 복제물일 수 있다. 그 후에, 제1 디지털 개체는 제1 사용자 및 제2 사용자 모두와 동시에 연관될 수 있고, 복수의 애플리케이션 중 임의의 애플리케이션 내에서 구현될 수 있다. 실시예에 따라, 프로세싱 유닛은 제5 모듈을 더 포함한다. 제5 모듈은 제1 사용자로부터 제1 애플리케이션에 대한 등급 값을 수신하도록 구성된다. 제1 사용자는 제1 애플리케이션에 접속하고, 제1 애플리케이션에서의 제 1 사용자의 체험을 기초로 제1 애플리케이션에 대한 등급 값을 제공한다. 특히, 제1 사용자는, 제1 애플리케이 션의 그래픽, 제1 애플리케이션의 제어 용이성, 제1 애플리케이션의 음성 및 시각 효과, 제1 애플리케이션과 상호 작용/플레이하는 동안의 엔터테인먼트 인자, 제1 애플리케이션의 시장 명성, 제1 애플리케이션의 대중성, 및 기타와 같은 많은 수의 매개변수를 기초로 등급 값을 제공할 수 있다. 특히, 등급 값은 제1 사용자의 선호사항 에 따라 달라진다. 그에 따라, 제1 사용자로부터 제1 애플리케이션에 대해서 수신된 등급 값은 제2 사용자로부 터 수신된 등급 값과 상이할 수 있다. 또한, 제5 모듈은 애플리케이션 포털 내의 복수의 애플리케이션 내의 제1 사용자와 연관된 제1 디지털 개체를, 연속적으로, 구현하도록 구성된다. 특히, 제1 디지털 개체는, 제1 디지털 개체에 의해서 접속된 복수의 애플리 케이션의 각각에서 제1 사용자의 스킬을 시뮬레이트하도록 구성된다. 또한, 제5 모듈은, 제1 사용자로부터 수 신된 제1 애플리케이션에 대한 등급 값을 기초로, 복수의 애플리케이션의 각각에 대해서 등급 값을 계산하도록 구성된다. 복수의 애플리케이션의 각각에 대한 등급 값은 제1 디지털 개체와 복수의 애플리케이션의 각각의 상 호 작용을 기초로 한다. 복수의 애플리케이션의 각각과 상호 작용하는 동안 제1 디지털 개체가 제1 사용자의 거동과 유사한 방식으로 거동할 때, 제5 모듈은, 제1 디지털 개체가 상호 작용하는 복수의 애플리케이션의 각각 에 대한 등급 값을 계산하도록 구성된다. 복수의 애플리케이션의 각각에 대한 등급 값은, 제1 애플리케이션에 대한 등급 값을 기준으로 고려하는 것에 의해서 계산된다. 등급 값이 제한된 수치적 등급(예를 들어, 10이 가 장 높은, 1 내지 10의 스케일(scale)의 숫자)이 아니라, 문자 등급, 별 등급, 영숫자 등급, 또는 기타를 또한 포함할 수 있다는 것을 이해할 수 있을 것이다. 선택적으로, 제5 모듈은, 각각의 계산된 등급 값을 기초로, 제1 사용자를 위한, 복수의 애플리케이션으로부터 하나 이상의 애플리케이션의 권장을 생성하도록 추가적으로 구성된다. 구체적으로, 제5 모듈은, 제1 애플리케 이션의 등급 값을 복수의 애플리케이션의 각각에 대해서 계산된 등급 값과 비교하여, 제1 사용자가 가장 선호할 만한 하나 이상의 애플리케이션을 결정하도록 구성된다. 이를 위해서, 복수의 애플리케이션의 각각의 등급 값 을 계층화하여, 우선 순위로 배열된 복수의 애플리케이션을 가지는 목록을 형성한다. 이러한 목록으로부터, 하 나 이상의 애플리케이션이 목록의 상단부로부터 선택되고, 제1 사용자에게 권장사항으로서 제공된다. 예에서, 권장된 하나 이상의 애플리케이션의 목록이, 제1 사용자와 관련된 사용자 인터페이스에서 제1 사용자에게 제공 되고, 제1 사용자는 하나 이상의 애플리케이션의 권장 목록으로부터 선택할 수 있다. 다른 예에서, 제1 사용자 가 이전의 애플리케이션의 플레이를 완료하고 다른 애플리케이션으로 이동하고자 할 때마다 하나씩, 하나 이상 의 애플리케이션이 생성된 바와 같은 우선 순위로 제1 사용자에게 하나씩 제공될 수 있다. 그러한 시스템은, 각각의 사용자의 관심 사항과 유사한 특정 게임을 플레이하게 사용자를 안내하도록 그리고 복수의 애플리케이션 으로부터 단순한 임의의 무작위적인 게임을 안내하지 않도록 보장한다. . 실시예에서, 제2 모듈은 \"N\"개의 복수의 애플리케이션에서 제1 디지털 개체를 연속적으로 구현하도록 추가적으 로 구성되고, 제1 디지털 개체는 N개의 복수의 애플리케이션에서 제1 사용자를 대신하여 행동을 실시하도록 구 성된다. 애플리케이션 포털과 관련하여, 제1 애플리케이션이 제1 사용자에 의해서 접속되고, 제1 사용자의 유사 성(likeness)을 나타내는 등급 값(즉, R1)이 사용자로부터 수신된다. 또한, 제1 사용자의 행동을 시뮬레이트하 는 제1 디지털 개체가 생성된다. 이어서, 생성된 제1 디지털 개체가, 애플리케이션 포털로부터의 제2 애플리케 이션에서, 제3 애플리케이션에서, 제4 애플리케이션에서, N번째 애플리케이션까지에서 구현된다. 제1 애플리케 이션의 등급 값을 기초로, 복수의 애플리케이션의 각각에 대한 등급 값이 계산되고, 다시 말해서 제2 애플리케 이션, 제3 애플리케이션, 제4 애플리케이션, 및 N번째 애플리케이션에 각각 상응하는 R2, R3, R4 및 RN이 계산 된다. 또한, 등급(R2, R3, R4, RN까지)의 각각이 우선 순위로 배열되고, 이어서 하나 이상의 애플리케이션이 제1 사용자에게 권장된다. 실시예에 따라, 시스템은 복수의 애플리케이션의 베타 테스팅을 구현하도록 추가적으로 구성된다. 본 개시 내 용 전반을 통해서, \"베타 테스팅\"이라는 용어는, 게이밍 애플리케이션과 같은 애플리케이션의 품질 제어를 위해 서 사용되는 소프트웨어 테스팅 프로세스를 지칭한다. 여기에서, 베타 테스팅은 제1 디지털 개체에 의해서 실시 된다. 언급한 바와 같이, 제1 디지털 개체는 복수의 애플리케이션 내에서 구현될 수 있고, 이어서 등급 값이 제1 디지털 개체에 의해서 접속된 복수의 애플리케이션의 각각에 대해서 계산될 수 있다. 베타 테스팅을 위해 서, (전문 게이머와 같은) 최적 수행 사용자의 일부의 프로파일이 (그로부터의 승인의 수신 후에) 접속될 수 있 고, 이어서, 주로 애플리케이션의 론칭 전에, 최적 수행 사용자의 각각의 디지털 개체가 특정 애플리케이션의 테스팅을 실시하여 애플리케이션의 품질을 평가할 수 있다. 베타 테스팅을 구현하기 위한 그러한 시스템은, 복 수의 애플리케이션, 특히 컴퓨터 게임을 위한 경제적이고 빠른 베타 테스팅이다. 전술한 바와 같이, 본 개시 내용은 또한 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험 을 관리하기 위한, 컴퓨터 구현된 방법을 제공한다. 그러한 방법은 이하에서 더 구체적으로 설명된다. 전술한 실시예 및 상세 내용은, 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위 한 전술한 방법을 준용한다. 선택적으로, 방법은, - 제2 애플리케이션 내에서 제1 디지털 개체에 의해서 달성된 레벨을 결정하는 것; - 제2 애플리케이션 내에서 제1 디지털 개체의 행동을 중단시키는 것; 및 - 제1 사용자가 제1 디지털 개체에 의해서 달성된 레벨에 후속되는 레벨에서 제2 애플리케이션에 진입할 수 있 게 하는 것에 의해서, 제2 애플리케이션 내에서 제1 디지털 개체에 의해서 실시되는 행동을 기초로 제2 애플리케이션 내의 제1 사용자 의 진입 지점을 제어하는 단계를 더 포함한다. 선택적으로, 방법은 제1 디지털 개체와 제2 애플리케이션의 양립성을 체크하는 단계; 및 제1 디지털 개체가 제2 애플리케이션과 양립 가능한 경우에, 제2 애플리케이션 내의 제1 디지털 개체의 구현을 허용하는 단계를 더 포 함한다. 선택적으로, 방법은, 제1 사용자가, 애플리케이션 포털 내의 복수의 애플리케이션에서, 그에 상응하는 제1 디 지털 개체의 구현에 관한 하나 이상의 승인을 설정할 수 있게 허용하는 단계를 더 포함한다. 선택적으로, 방법은, 제2 애플리케이션에 상응하는 제1 사용자에 의해서 설정된 하나 이상의 승인을 기초로, 제 2 애플리케이션 내의 제1 디지털 개체의 구현을 초기 레벨의 미리 결정된 수까지로 제한하는 단계를 더 포함한 다. 선택적으로, 방법은 제1 애플리케이션 상의 제2 사용자의 행동에 상응하는 데이터를 캡쳐하는 단계; 제2 사용자 에 대한 캡쳐된 데이터를 제1 사용자에 대한 캡쳐된 데이터에 비교하는 단계; 비교를 기초로 매칭 스코어를 결 정하는 단계; 및 매칭 스코어가 미리 결정된 문턱값을 초과하는 경우에, 구현을 위해서, 제1 사용자의 생성된 제1 디지털 개체를 제2 사용자의 프로파일과 연관시키는 단계를 더 포함한다. 선택적으로, 방법은 제1 사용자로부터 제1 애플리케이션에 대한 등급 값을 수신하는 단계; 애플리케이션 포털 내의 복수의 애플리케이션에서 제1 디지털 개체를 연속적으로 구현하는 단계; 및 제1 사용자로부터 수신된 제1 애플리케이션에 대한 등급 값을 기초로 복수의 애플리케이션의 각각에 대한 등급 값을 계산하는 단계를 더 포함 한다. 선택적으로, 방법은, 각각의 계산된 등급 값을 기초로, 제1 사용자를 위한, 복수의 애플리케이션으로부터 하나 이상의 애플리케이션의 권장을 생성하는 단계를 더 포함한다. 선택적으로, 방법은: - 애플리케이션 포털 내의, 제1 애플리케이션이 아닌, 하나 이상의 다른 애플리케이션 상의 제1 사용자의 행동 에 상응하는 데이터를 연속적으로 캡쳐하는 단계; 및 - 하나 이상의 다른 애플리케이션 상의 제1 사용자의 행동에 상응하는 데이터를 기초로 제1 디지털 개체를 반복 적으로 훈련시키는 단계를 더 포함한다. 도면의 상세한 설명 도 1을 참조하면, 본 개시 내용의 실시예에 따른 네트워크 환경의 블록도가 도시되어 있다. 네트워크 환경 은 시스템 및 애플리케이션 포털을 포함한다. 시스템은 복수의 애플리케이션을 호스팅하는 애플 리케이션 포털 내의 사용자 체험을 관리한다. 도시된 바와 같이, 시스템은 애플리케이션 기록기 및 프로세싱 유닛을 포함한다. 프로세싱 유닛은 애플리케이션 기록기에 통신 가능하게 커 플링된다. 또한, 프로세싱 유닛은 제1 모듈, 제2 모듈, 제3 모듈, 제4 모듈, 및 제 5 모듈을 포함한다. 도 1이 단지 예라는 것, 그리고 도 1은 본원의 청구항의 범위를 과도하게 제한하지 않아야 한다는 것을 이해할 수 있을 것이다. 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한시스템에 대한 구체적인 명칭이 예로서 제공된 것이고, 시스템을 (애플리케이션 기록기와 같은) 애플리케이션 기록기, (프로세싱 유닛과 같은) 프로세싱 유닛, (제1 모듈, 제2 모듈, 제3 모듈 , 제4 모듈, 및 제5 모듈과 같은) 모듈의 특정 숫자, 유형, 또는 배열로 제한하도록 구성된 것 이 아님을 이해할 수 있을 것이다. 당업자는 본 개시 내용의 실시예의 많은 변경, 대안, 및 수정을 인지할 수 있을 것이다. 도 2를 참조하면, 본 개시 내용의 다른 실시예에 따른, 애플리케이션 포털과 많은 수의 사용자, 예를 들어 제1 사용자(204A), 제1 사용자(206A) 및 제3 사용자(208A) 사이의 상호 작용을 보여주는 네트워크 환경이 도시되어 있다. 도시된 바와 같이, 애플리케이션 포털은 \"N\"의 수의 애플리케이션(즉, \"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\", \"N\"까지)을 포함한다. 도시된 바와 같이, 제1 디지털 개체(204B)는 제1 사용자 (204A)와 연관되고, 제2 디지털 개체(206B)는 제2 사용자(206A)와 연관되고, 제3 디지털 개체(208B)는 제3 사용 자(208A)와 연관된다. 한 순간에, 제1 사용자(204A)가 1번째 애플리케이션에 접속할 수 있는 한편, 제1 디지털 개체(204B)가 2번째 애플리케이션에 접속할 수 있다. 또한, 제2 사용자(206A)가 4번째 애플리케이션에 접속할 수 있는 한편, 제2 디지털 개체(206B)가 5번째 애플리케이션에 접속할 수 있다. 또한, 제3 사용자(208A)가 4번 째 애플리케이션에 접속할 수 있는 한편, 제3 디지털 개체(208B)가 5번째 애플리케이션에 접속할 수 있다. 도 3a를 참조하면, 본 개시 내용의 실시예에 따른, 하나의 순간에 사용자 및 연관된 디지털 개체와 애플리케이 션 포털의 상호 작용을 보여주는 블록도(300A)가 도시되어 있다. 제1 순간에, 제1 사용자는 제1 애플리케 이션 상에서 행동을 실시하고, 제1 애플리케이션 내의 제1 사용자의 행동에 상응하는 데이터가 기록된다. 또한, 제1 디지털 개체가 훈련되어(\"T\") 제1 사용자의 행동을 시뮬레이트하고 제1 사용자 와 연관된다. 이어서, 제1 사용자를 위해서 행동을 실시하도록, 제1 디지털 개체가 제2 애플리케이 션 내에서 구현된다. 다음에, 도 3b를 참조하면, 본 개시 내용의 실시예에 따른, 다른 순간에 사용자 및 연관된 디지털 개체와 애플 리케이션 포털의 상호 작용을 보여주는 블록도(300B)가 도시되어 있다. 이러한 순간에, 제1 사용자는 제2 애플리케이션 상에서 행동을 실시하고, 제2 애플리케이션 내의 제1 사용자의 행동에 상응하는 데이터가 기록된다. 제1 디지털 개체가 추가적으로 훈련되어(\"T\") 제2 애플리케이션 내의 제1 사용 자의 행동에 상응하는 제1 디지털 개체의 스킬을 업데이트한다. 이어서, 행동을 실시하도록, 제1 디 지털 개체가 제3 애플리케이션 내에서 추가적으로 구현된다. 도 4a를 참조하면, 본 개시 내용의 실시예에 따른, 제1 사용자와 제1 디지털 개체의 연관화를 위한 프로세스(400A)를 도시한 블록도가 도시되어 있다. 도시된 바와 같이, 제1 디지털 개체는 제1 사용자 와 연관되고, 제1 디지털 개체는 제1 사용자의 행동을 시뮬레이트하도록 훈련된다. 도 4b를 참조하면, 본 개시 내용의 실시예에 따른, 2명의 사용자 사이의 행동의 유사성을 기초로 사용자와 디지 털 개체를 연관화시키기 위한 프로세스(400B)의 개략도가 도시되어 있다. 단계(402B)에서, 제1 애플리케이션 상의 제2 사용자의 행동에 상응하는 데이터가 캡쳐된다. 단계(404B)에서, 제2 사용자에 대한 캡쳐된 데이터가 제1 사용자에 대한 캡쳐된 데이터와 비교된다. 단계(406B)에서, 제1 사용자에 대한 캡쳐된 데이터와 제2 사용 자에 대한 캡쳐된 데이터 사이의 비교를 기초로, 매칭 스코어가 결정된다. 단계(408B)에서, 매칭 스코어가 미 리 결정된 문턱값보다 큰지의 여부에 대한 결정이 이루어진다. 특히, 매칭 스코어가 미리 결정된 문턱값을 초 과할 때 경로(\"Y\")를 따르고, 매칭 스코어가 미리 결정된 문턱값을 미만일 때 경로(\"N\")를 따른다. 경로(\"Y\") 를 따르는 경우에, 단계(410B)에서, 제1 사용자의 제1 디지털 개체가 제2 사용자와 연관된다. 경로(\"N\")를 따 르는 경우에, 단계(412B)에서, 제2 디지털 개체가 생성되고 제1 애플리케이션 상의 제2 사용자의 행동에 상응하 게 훈련된다. 도 4c 및 도 4d를 참조하면, 본 개시 내용의 실시예에 따른, 도 4b에 도시된 바와 같은 경우에 따라 디지털 개 체와 2명의 사용자를 연관화하기 위한 프로세스(400C 및 400D)를 보여주는 블록도가 도시되어 있다. 도 4c에 도시된 바와 같이, 제1 디지털 개체는 제1 사용자 및 제2 사용자 모두와 연관된다. 매칭 스코 어가 미리 결정된 문턱값보다 클 때, 제1 사용자 및 제2 사용자가 제1 디지털 개체와 연관된다 는 것을 이해할 수 있을 것이다. 도 4d에 도시된 바와 같이, 제2 사용자는 제2 디지털 개체와 연관 된다. 매칭 스코어가 미리 결정된 문턱값보다 작을 때, 제2 사용자가 제2 디지털 개체와 연관된다는 것을 이해할 수 있을 것이다. 도 5를 참조하면, 본 개시 내용의 실시예에 따른, 사용자를 위한 하나 이상의 애플리케이션에 관한 권장사항의 생성을 보여주는 블록도가 도시되어 있다. 도시된 바와 같이, 단계에서, 제1 등급 값(\"R1\")이 제1애플리케이션 내에서 실시되는 행동에 대해서 제1 사용자로부터 수신된다. 또한, 단계에서, 제1 디지털 개체가 생성된다. 또한, 단계에서, 애플리케이션 포털 내의 복수의 애플리케이션 내의 제1 사용자의 행동 을 시뮬레이트하도록, 제1 디지털 개체가 구현된다. 즉, 제1 디지털 개체는 애플리케이션 포털 내의 \"N\"의 수 의 애플리케이션(즉, \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\" 및 \"N\") 내에서 연속적으로 구현된다. 또한, 등급 값이 애플리케이션 포털 내의 복수의 애플리케이션의 각각에 대해서 계산된다. 도시된 바와 같이, 등급 값 (\"R2\")은 애플리케이션(\"2\")에 상응하여 계산되고, 등급 값(\"R3\")은 애플리케이션(\"3\")에 상응하여 계산되고, 등급 값(\"R4\")은 애플리케이션(\"4\")에 상응하여 계산되고, 등급 값(\"R5\")은 애플리케이션(\"5\")에 상응하여 계산 되고, 등급 값(\"R6\")은 애플리케이션(\"6\")에 상응하여 계산되고, 등급 값(\"R7\")은 애플리케이션(\"7\")에 상응하 여 계산되고, 등급 값(\"R8\")은 애플리케이션(\"8\")에 상응하여 계산되고, 등급 값(\"RN\")은 애플리케이션(\"N\")에 상응하여 계산된다. 특히, 권장사항(\"R2\", \"R3\", \"R4\", \"R5\", \"R6\" 및 \"RN\")은 등급 값(\"R1\")을 기초로 계산 된다. 단계에서, 권장사항(\"R2\", \"R3\", \"R4\", \"R5\", \"R6\" 및 \"RN\")은 제1 사용자의 참조를 위해서 사용 자 인터페이스에서 디스플레이된다. 도 6a를 참조하면, 본 개시 내용의 실시예에 따른, 제1 디지털 개체를 반복적으로 훈련시키기 위한 프로세스 (600A)의 개략도가 도시되어 있다. 단계(602A)에서, 제1 사용자는 \"N\"의 횟수로 제1 애플리케이션에서 행동을 실시한다. 단계(604A)에서, \"N\"의 수의 훈련 데이터세트가 생성된다. 여기에서, 제1 훈련 데이터세트는 1번째 로 제1 사용자가 제1 애플리케이션에 접속할 때 생성되고, 제2 훈련 데이터세트는 2번째로 제1 사용자가 제1 애 플리케이션에 접속할 때 생성되고, N번째 훈련 데이터세트는 N번째로 제1 사용자가 제1 애플리케이션에 접속할 때 생성된다. 단계(606A)에서, 제1 디지털 개체가 생성된 훈련 데이터세트를 기초로 반복적으로 훈련되고 지속 적으로 업데이트된다. 특히, 제1 애플리케이션이 \"N\"의 횟수로 접속되었을 때, 제1 디지털 개체는 총 \"N\"의 횟 수로 훈련된다. 도 6b를 참조하면, 본 개시 내용의 실시예에 따른, 하나 이상의 다른 애플리케이션 상의 제1 사용자의 행동에 상응하는 데이터를 기초로, 제1 디지털 개체를 반복적으로 훈련시키기 위한 프로세스(600B)의 개략도가 도시되 어 있다. 단계(602B)에서, 제1 사용자는 \"i\"의 횟수로 제1 애플리케이션에서 행동을 실시한다. 단계(604B)에 서, \"i\"의 수의 훈련 데이터세트가 연속적으로 생성된다. 단계(606B)에서, 제1 사용자는 \"j\"의 횟수로 제2 애 플리케이션에서 행동을 실시한다. 단계(608B)에서, \"j\"의 수의 훈련 데이터세트가 연속적으로 생성된다. 단계 (610B)에서, 제1 사용자는 \"k\"의 횟수로 N번째 애플리케이션에서 행동을 실시한다. 단계(612B)에서, \"k\"의 수 의 훈련 데이터세트가 연속적으로 생성된다. 단계에서, 제1 사용자와 연관된 제1 디지털 개체가 반복적으 로 훈련된다. 특히, N번째 애플리케이션이 \"k\"의 횟수로 접속되었을 때, 제1 디지털 개체는 총 (i+j+k)의 횟수 로 훈련된다. 도 7은, 본 개시 내용의 실시예에 따른, (예를 들어, 도 1의 시스템과 같은) 복수의 애플리케이션을 호스 팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 시스템의 구현에 관한 예시적인 시퀀스 도표 의 개략도가 도시되어 있다. 단계(S1.1)에서, 제1 애플리케이션은 제1 사용자와 연관된 사용자 장치 상에 서 작동되고, 제1 사용자의 행동이 애플리케이션 기록기에 의해서 캡쳐되고 데이터베이스에 저장된다. 단 계(S2.1)에서, 데이터베이스로부터의 데이터가, 제1 디지털 개체의 훈련을 위해서, 제1 모듈에 의해서 획 득된다. 단계(S3.1)에서, 제1 디지털 개체가 제2 모듈에 전달된다. 단계(S4.1)에서, 제1 디지털 개체가 제2 애플리케이션에서 구현된다. 도 8을 참조하면, 본 개시 내용의 실시예에 따른, 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사 용자 체험을 관리하기 위한 방법의 흐름도가 도시되어 있다. 단계에서, 제1 사용자의 행동에 상응하 는 데이터가 제1 애플리케이션에서 캡쳐된다. 단계에서, 제1 사용자의 행동을 시뮬레이트하기 위해서, 캡 쳐된 데이터를 기초로 제1 디지털 개체가 훈련된다. 단계에서, 제1 사용자를 위해서 행동을 실시하도록, 제1 디지털 개체가 제2 애플리케이션에서 구현된다. 단계(802 내지 806)는 단지 예시적인 것이고, 본원의 청구항의 범위로부터 벗어나지 않고도, 하나 이상의 단계 가 부가된, 하나 이상의 단계가 제거된, 또는 하나 이상의 단계가 다른 순서로 제공되는 다른 대안들이 또한 제 공될 수 있다. 첨부된 청구항에 의해서 규정되는 바와 같은 본 개시 내용의 범위로부터 벗어나지 않고도, 전술한 본 개시 내용 의 실시예에 대한 수정이 이루어질 수 있다. 본 개시 내용을 설명하고 청구하기 위해서 사용된 \"포괄하는\", \" 포함하는\", \"통합하는\", \"가지는\", \"~인\"과 같은 표현은 비-배타적인 방식으로 구성되는 것을 의미하고, 다시 말해서 명백하게 설명되지 않은 물품, 구성요소 또는 요소가 제시될 수 있게 한다는 것을 의미한다. 단수형에대한 언급은 또한 복수와 관련되는 것으로 간주될 수 있다."}
{"patent_id": "10-2020-0088358", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부 도면과 함께 읽을 때, 전술한 요지뿐만 아니라 이하의 예시적인 실시예에 관한 구체적인 설명이 더 잘 이 해될 수 있을 것이다. 본 개시 내용을 설명하기 위한 목적으로, 개시 내용의 예시적인 구성을 도면에 도시하였 다. 그러나, 본 개시 내용은 본원에서 개시된 구체적인 방법 및 기구로 제한되지 않는다. 또한, 당업자는, 도 면이 실제 축척(scale)이 아니라는 것을 이해할 수 있을 것이다. 가능한 경우에, 유사한 요소들을 동일한 번호 로 표시하였다. 이제, 단지 예로서 이하의 도면을 참조하여 본 개시 내용의 실시예를 설명할 것이다. 도 1은, 본 개시 내용의 실시예에 따른, 네트워크 환경 내의 애플리케이션 포털과 연관된 시스템의 블록도이다. 도 2는, 본 개시 내용의 실시예에 따른, 애플리케이션 포털과 많은 수의 사용자 사이의 상호 작용을 도시하는 네트워크 환경의 개략도이다. 도 3a 및 도 3b는, 본 개시 내용의 여러 실시예에 따른, 사용자와 애플리케이션 포털을 갖는 연관된 디지털 개 체의 상호 작용을 도시한 블록도이다. 도 4a는, 본 개시 내용의 실시예에 따른, 제1 사용자와 제1 디지털 개체의 연관화를 위한 프로세스를 도시하는 블록도의 개략도이다. 도 4b는, 본 개시 내용의 실시예에 따른, 2명의 사용자 사이의 행동의 유사성을 기초로 사용자와 디지털 개체를 연관화시키기 위한 프로세스의 개략도이다. 도 4c 및 도 4d는, 본 개시 내용의 실시예에 따른, 도 4b에 도시된 바와 같은 경우에 따라 디지털 개체와 2명의 사용자를 연관화하기 위한 프로세스를 도시하는 블록도의 개략도이다.도 5는, 본 개시 내용의 실시예에 따른, 사용자를 위한 하나 이상의 애플리케이션에 관한 권장사항을 생성하기 위한 프로세스를 도시하는 블록도의 개략도이다. 도 6a 및 도 6b는, 본 개시 내용의 실시예에 따른, 제1 디지털 개체를 반복적으로 훈련시키기 위한 프로세스의 개략도이다. 도 7은, 본 개시 내용의 실시예에 따른, (예를 들어, 도 1의 시스템과 같은) 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험을 관리하기 위한 시스템의 구현예의 예시적인 시퀀스 도표의 개략도이다. 도 8은, 본 개시 내용의 실시예에 따른, 복수의 애플리케이션을 호스팅하는 애플리케이션 포털에서 사용자 체험 을 관리하기 위한 방법의 흐름도를 도시한다. 첨부 도면에서, 밑줄이 그어진 숫자는, 밑줄이 그어진 숫자가 위에 배치된 물품 또는 밑줄이 그어진 숫자가 인 접하는 물품을 나타내기 위해서 이용된 것이다. 밑줄이 그어지지 않은 숫자는 밑줄이 그어지지 않은 숫자를 물 품에 연계시키는 라인에 의해서 식별되는 물품과 관련된다. 숫자가 밑줄이 그어지지 않고 연관된 화살표를 수 반할 때, 밑줄이 그어지지 않은 숫자는, 화살표가 향하는 일반적인 물품을 식별하기 위해서 사용된다"}
