{"patent_id": "10-2022-0169461", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0084787", "출원번호": "10-2022-0169461", "발명의 명칭": "빅데이터 기반의 인공장기 제작 시스템", "출원인": "채혁주", "발명자": "채혁주"}}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제작할 인공장기에 대한 사용자의 요구 조건을 입력값으로 입력받는 입력부;인공장기 제작에 필요한 빅데이터를 저장하는 데이터베이스부;상기 데이터베이스부를 기반으로 학습된 인공장기 제작 알고리즘에 상기 입력값을 입력하여 인공장기를 제작할수 있는 공정 변수를 산출하는 제어부; 및상기 제어부의 제어에 따라 상기 공정 변수로 인공장기를 제작하는 바이오 프린터;를 포함하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 입력값은 인공장기의 경도, 인장강도, 인성 및 연성을 포함하는 것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 입력값은 수치값인 것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 데이터베이스부는 인공장기 제작에 필요한 복수의 원료, 각 원료의 무게, 전처리 조건, 온도, 촉매 조건및 반응 시간에 대한 데이터를 저장하는 것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 데이터베이스부는 복수의 원료를 합성할 때, 원료의 비율에 따른 영률(Young's Modulus), 최대 인장 강도(Ultimate Tensile Strength), 인성(Toughness) 및 골절지점(Fracture point)을 포함하는 기계적 특성 데이터를 저장하는 것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 데이터베이스부는 Agarose, Acrylamide, MBA, TEMED, DI Water, APS 및 Temp에 대한 데이터를 저장하는것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 바이오 프린터는 3D 바이오 프린터인 것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,공개특허 10-2024-0084787-3-상기 제어부는 상기 입력값으로 학습된 인공장기 제작 알고리즘을 이용하여 상기 공정 변수를 포함하는 인공장기 모델링 파일(STL)을 생성하고, 생성한 인공장기 모델링 파일(STL)을 상기 바이오 프린터로 제공하여 인공장기를 바이오 프린팅하는 것을 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 인공장기 제작 알고리즘은,기계학습에 필요한 가상 데이터를 역설계 기술을 이용하여 생성하는 데이터 역설계 모델; 및상기 데이터 역설계 모델이 생성한 가상 데이터로 기계학습을 수행한 후, 사용자의 요구 조건을 입력값으로 하여 사용자 맞춤형 인공장기를 상기 바이오 프린터를 제어하여 제작하는 인공장기 제작 모델;을 포함하는 것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 데이터 역설계 모델은,분자 지문을 통해 원료에서 피처를 추출하고 타겟 물성(기계적 물성, 전기 소작 특성 및 3D 인쇄성)을 예측하는대리 모델;타겟 물성을 합성할 수 있는 공정 변수와 원료 선택을 수행하는 역설계 딥러닝 모델; 및합성 변수 공간의 데이터 분포를 추정하여 가상 데이터를 생성하는 가상 데이터 모델;을 포함하는 것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 인공장기 제작 모델은,사용자의 요구 조건(환자의 생리적(BMI, 3차원 조직 모델), 유전적, Demographic(나이, 성별)) 정보를 바탕으로장기 조직별 최적 디자인을 도출하는 기계학습 모델;상기 빅데이터를 기반으로 한 기계학습으로 공정 변수를 포함하는 자동화된 합성 프로세스를 디자인하는 인공지능 모델; 및상기 공정 변수를 상기 바이오 프린터의 제어에 적용하여 사용자 맞춤형 인공장기를 제작하는 프린터 제어모델;을 포함하는 것을 특징으로 하는 빅데이터 기반의 인공장기 제작 시스템."}
{"patent_id": "10-2022-0169461", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 빅데이터 기반의 인공장기 제작 시스템에 관한 것이다. 본 발명에 따른 인공장기 제작 시스템은 제작 할 인공장기에 대한 사용자의 요구 조건을 입력값으로 입력받는 입력부; 인공장기 제작에 필요한 데이터를 저장 하는 데이터베이스부; 상기 데이터베이스부를 기반으로 학습된 인공장기 제작 알고리즘에 상기 입력값을 입력하 여 인공장기를 제작하는 제어부; 및 상기 제어부의 제어에 따라 인공장기를 제작하는 바이오 프린터;를 포함한다."}
{"patent_id": "10-2022-0169461", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공장기 제작 시스템에 관한 것으로, 더욱 상세하게는 빅데이터를 기반으로 인공장기를 제작하는 시 스템에 관한 것이다."}
{"patent_id": "10-2022-0169461", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공장기를 제작하는 방법으로 바이오 프린팅(bioprinting)이 활용되고 있다. 바이오 프린팅은 조직 공학, 재생 의학, 약동학 그리고 보다 일반적으로 생물학적 연구를 위한 살아있는 조직 및 장기를 개발하기 위해 컴퓨터의 제어하에 층별 증착을 통해 순차적으로 배치함으로써, 살아있는 세포 및 기타 생물학적 제품, 생체 물질, 생화 학 물질 또는 생체 적합성의 공간 구조화를 허용한다. 이러한 바이오 프린팅을 이용하여 인공장기를 제작하고자 할 시, 원하는 조건의 인공장기를 제작하기 위해서는, 해당 조건에 부합하도록 하기 위하여 실험 후 제작을 진행하고 있다. 인공장기는 여러 경우에 이용되고 있는데, 그 중 의학 실습용으로도 사용되고 있다. 실습용으로 사용하는 인공 장기의 경우 다양한 케이스의 인공장기가 필요하다. 하지만 다양한 케이스에 부합하는 인공장기가 필요할 때마다 연구 및 실험을 통해 제작하는데 한계가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1954953호 (2019.02.27.등록)"}
{"patent_id": "10-2022-0169461", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명의 목적은 인공장기와 관련된 빅데이터를 기반으로 사용자가 요청하는 조건에 대응하는 인공장기 를 제작할 수 있는 빅데이터 기반의 인공장기 제작 시스템을 제공하는 데 있다."}
{"patent_id": "10-2022-0169461", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명은 제작할 인공장기에 대한 사용자의 요구 조건을 입력값으로 입력받는 입력부; 인공장기 제작에 필요한 빅데이터를 저장하는 데이터베이스부; 상기 데이터베이스부를 기반으로 학습된 인공장기 제작 알고리즘에 상기 입력값을 입력하여 인공장기를 제작할 수 있는 공정 변수를 산출하는 제어부; 및 상기 제어부의 제어에 따라 상기 공정 변수로 인공장기를 제작하는 바이오 프린터;를 포함하는 빅데이터 기 반의 인공장기 제작 시스템을 제공한다. 상기 입력값은 인공장기의 경도, 인장강도, 인성 및 연성을 포함할 수 있다. 상기 입력값은 수치값일 수 있다. 상기 데이터베이스부는 인공장기 제작에 필요한 복수의 원료, 각 원료의 무게, 전처리 조건, 온도, 촉매 조건 및 반응 시간에 대한 데이터를 저장할 수 있다. 상기 데이터베이스부는 복수의 원료를 합성할 때, 원료의 비율에 따른 영률(Young's Modulus), 최대 인장 강도 (Ultimate Tensile Strength), 인성(Toughness) 및 골절지점(Fracture point)을 포함하는 기계적 특성 데이터 를 저장할 수 있다. 상기 데이터베이스부는 Agarose, Acrylamide, MBA, TEMED, DI Water, APS 및 Temp에 대한 데이터를 저장할 수 있다. 상기 바이오 프린터는 3D 바이오 프린터일 수 있다. 상기 제어부는 상기 입력값으로 학습된 인공장기 제작 알고리즘을 이용하여 상기 공정 변수를 포함하는 인공장 기 모델링 파일(STL)을 생성하고, 생성한 인공장기 모델링 파일(STL)을 상기 바이오 프린터로 제공하여 인공장 기를 바이오 프린팅할 수 있다. 상기 인공장기 제작 알고리즘은, 기계학습에 필요한 가상 데이터를 역설계 기술을 이용하여 생성하는 데이터 역 설계 모델; 및 상기 데이터 역설계 모델이 생성한 가상 데이터로 기계학습을 수행한 후, 사용자의 요구 조건을 입력값으로 하여 사용자 맞춤형 인공장기를 상기 바이오 프린터를 제어하여 제작하는 인공장기 제작 모델;을 포 함할 수 있다. 상기 데이터 역설계 모델은, 분자 지문을 통해 원료에서 피처를 추출하고 타겟 물성(기계적 물성, 전기 소작 특 성 및 3D 인쇄성)을 예측하는 대리 모델; 타겟 물성을 합성할 수 있는 공정 변수와 원료 선택을 수행하는 역설 계 딥러닝 모델; 및 합성 변수 공간의 데이터 분포를 추정하여 가상 데이터를 생성하는 가상 데이터 모델;을 포 함할 수 있다. 그리고 상기 인공장기 제작 모델은, 사용자의 요구 조건(환자의 생리적(BMI, 3차원 조직 모델), 유전적, Demographic(나이, 성별)) 정보를 바탕으로 장기 조직별 최적 디자인을 도출하는 기계학습 모델; 상기 빅데이터 를 기반으로 한 기계학습으로 공정 변수를 포함하는 자동화된 합성 프로세스를 디자인하는 인공지능 모델; 및 상기 공정 변수를 상기 바이오 프린터의 제어에 적용하여 사용자 맞춤형 인공장기를 제작하는 프린터 제어 모델;을 포함할 수 있다."}
{"patent_id": "10-2022-0169461", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 인공장기와 관련된 빅데이터를 기반으로 사용자가 요청하는 조건에 대응하는 인공장기를 제 작할 수 있다. 즉 다양한 인공장기의 제작하는 과정에서 확보된 빅데이터를 기반으로 사용자의 요구 조건을 입 력값으로 하여 바이오 프린팅으로 사용자 맞춤형 인공장기를 제작할 수 있다. 입력값은 인공장기의 경도, 인장강도, 인성 및 연성에 대한 수치값이기 때문에, 입력값으로 수치를 입력하여 그 에 맞는 인공장기를 맞춤형으로 제작할 수 있고, 같은 스펙을 가진 인공장기의 경우， 단 한번의 입력 으로 대량 생산이 가능한 이점이 있다. 본 발명에 따른 인공장기 제작 시스템은 빅데이터를 기반으로 하기 때문에, 실험, 제조 및 검증에 필요한 시간 을 줄일 수 있다."}
{"patent_id": "10-2022-0169461", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "하기의 설명에서는 본 발명의 실시예를 이해하는데 필요한 부분만이 설명되며, 그 이외 부분의 설명은 본 발명 의 요지를 벗어나지 않는 범위에서 생략될 것이라는 것을 유의하여야 한다. 이하에서 설명되는 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해 석되어서는 아니 되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념으로 적절 하게 정의할 수 있다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 바람직한 실시예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 보다 상세하게 설명하고자 한다. 도 1은 본 발명의 실시예에 따른 빅데이터 기반의 인공장기 제작 시스템을 보여주는 블록도이다. 그리고 도 2는 도 1의 데이터베이스부를 보여주는 블록도이다. 도 1 및 도 2를 참조하면, 본 실시예에 따른 인공장기 제작 시스템은 빅데이터를 기반으로 학습된 인공장 기 제작 알고리즘을 이용한 바이오 프린팅으로 사용자 맞춤형 인공장기를 제작하는 시스템이다. 이러한 본 실시예에 따른 인공장기 제작 시스템은 입력부, 데이터베이스부, 제어부 및 바이오 프린터를 포함한다. 입력부는 제작할 인공장기에 대한 사용자의 요구 조건을 입력값으로 입력받는다. 데이터베이스부는 인공장기 제작에 필요한 빅데이터를 저장한다. 제어부는 데이터베이스부를 기반 으로 학습된 인공장기 제작 알고리즘에 입력값을 입력하여 인공장기를 제작할 수 있는 공정 변수를 산출한 다. 그리고 바이오 프린터는 제어부의 제어에 따라 공정 변수로 인공장기를 제작한다. 여기서 입력부는 사용자로부터 제작할 인공장기에 대한 요구 조건을 입력값으로 입력받는다. 사용자의 요구 조건은 환자의 생리적(BMI, 3차원 조직 모델), 유전적, Demographic(나이, 성별) 정보를 포함할 수 있다. 입력 값은 인공장기의 종류와 물성에 대한 정보를 포함할 수 있다. 물성에 대한 정보는 인공장기의 경도, 인장강도, 인성 및 연성을 포함하고, 해당 입력값은 수치값으로 입력된다. 또는 물성에 대한 정보가 문언적으로 입력될 수 있다. 제어부는 문언적으로 입력된 물성에 대한 정보를 빅 데이터를 기반으로 수치값으로 변환할 수 있다. 입력부는 키보드, 마우스 등과 같은 사용자로부터 직접 요구 조건을 입력받는 물리적인 입력 장치일 수 있 다. 또는 입력부는 사용자 단말을 통하여 요구 조건을 입력받는 통신부일 수 있다. 데이터베이스부는 다양한 인공장기의 제작 시 사용된 빅데이터를 저장한다. 이러한 데이터베이스부는 인공장기 제작에 필요한 복수의 원료, 각 원료의 무게, 전처리 조건, 온도, 촉매 조건 및 반응 시간에 대한 데 이터를 저장한다. 예컨대 데이터베이스부는 Agarose, Acrylamide, MBA, TEMED, DI Water, APS 및 Temp 등 의 인공장기 제작 시 필요한 데이터를 저장할 수 있으며，이는 일 실시예에 따른 소재로， 이에 한 정하는 것은 아니다． 빅데이터로서, 도 3 내지 도 9에 도시된 바와 같이, 인공장기를 제작할 때 사용하는 원료를 합성할 때, 모노머 (Agarose, Acrylamide) 또는 첨가제(MBA)에 대한 비율별로 기계적 특성 데이터(Young's Modulus, Ultimate Tensile Strength, Toughness, Fracture point)를 수집한다. 도 8에서, 'Agar'은 Agarose를 나타내고, 'AM'은 Acrylamide를 나타낸다. 원료를 합성할 때, 모노머 및 첨가제의 양이 증가할수록 인성과 강도가 증가하는 것을 확인할 수 있다. 따라서 인공장기를 제작하기 위해서, 원료를 합성할 때, 상기한 모노머 및 참가제의 양에 따른 기계적 특성 데 이터를 기반으로, 사용자의 요구 조건에 적합한 원료의 합성 조건(공정 변수)을 기계학습을 통하여 도출할 수 있다. 여기서 도 3 내지 도 5는 모노머(Agarose, Acrylamide) 및 첨가제(MBA)에 대한 응력-변형률(stress-strain) 특 성을 보여주는 그래프이다. 도 3은 Agarose의 응력-변형률 특성을 보여준다. 도 4는 Acrylamide의 응력-변형률 특성을 보여준다. 그리고 도 5는 첨가제(MBA)의 응력-변형률 특성을 보여준다. 데이터베이스부는 사용자의 요구 조건을 입력값으로 학습된 인공장기 제작 알고리즘을 이용하여 생성된 인공장기 모델링 파일(STL)을 저장할 수 있다. 바이오 프린터는 제어부의 제어에 따라 학습된 인공장기 제작 알고리즘에 의해 인공장기를 제작한 다. 바이오 프린터는 3D 바이오 프린터이다. 즉 바이오 프린터는 학습된 인공장기 제작 알고리즘으 로 작성된 인공장기 모델링 파일(STL)을 입력받아 3D 바이오 프린팅으로 인공장기를 제작한다. 여기서 인공장기는 3D 바이오 프린팅으로 제작된 것으로, 예컨대 인공피부, 인공혈관(출혈 및 지혈), 인공복막 등을 포함할 수 있으며, 이것에 한정되는 것은 아니다. 3D 바이오 프린팅은 목표 구조물을 삼차원으로 스캐닝하여 이미지를 얻어, 세포와 바이오 잉크를 통해 스캐닝한 이미지를 삼차원 구조 형태로 만드는 것이다. 일반적인 3D 프린팅의 기술로는 압출기반 프로세스, 잉크젯기반 프로세스 및 레이저기반 프로세스가 있는데, 이중에 세포와 함께 삼차원 구조 형태를 만드는 바이오 프린팅으로 주로 압출기반 프로세스가 많이 사용되고 있다. 바이오 프린팅은 살아있는 세포를 포함하는 것이 핵심이므로, 세포와 함께 섞여서 삼차원 구조를 이루는 물질인 바이오 잉크는 3D 바이오 프린팅에서 가장 중요한 부분이다. 한편 본 실시예에 따른 인공장기가 의료 교육용으로 활용되는 경우에 있어서, 바이오 잉크를 구성하는 원료 모 두가 생체 적합한 물질일 필요는 없다. 그리고 제어부는 인공장기 제작 시스템의 전반적인 제어를 수행하는 마이크로프로세서이다. 제어부 는 빅데이터를 기반으로 학습된 인공장기 제작 알고리즘을 이용한 바이오 프린팅으로 사용자 맞춤형 인 공장기 제작을 제어한다. 즉 제어부는 제작할 인공장기에 대한 사용자의 요구 조건을 입력값으로 학습된 인 공장기 제작 알고리즘을 이용하여 인공장기 모델링 파일(STL)을 생성한다. 그리고 제어부는 인공장기 모델링 파일(STL)을 바이오 프린터로 제공함으로써, 사용자 맞춤형 인공장기를 바이오 프린팅을 통하여 제 작한다. 본 실시예에 따른 인공장기 제작 알고리즘은 빅데이터를 기반으로 트랜드를 분석한 후, 예측률이 높은 알고 리즘을 선택해 원료를 역설계하는 방법을 이용한다. 또한 사용자의 다양한 요구 조건, 예컨대 성별, 나이 등에따라 시행착오를 최소화할 수 있도록, 기계학습을 이용해 사용자 맞춤형 인공장기를 제공할 수 있다. 여기서 기계학습은 다양한 알고리즘이 있으며, 데이터에 따라 적절한 알고리즘이 선택될 수 있다. 기계학습 알 고리즘은 지도 학습(Supervised learning), 비지도 학습(Unsupervised learning), 준지도 학습(Semi- supervised learning) 및 강화 학습(Reinforcement learning)을 포함한다. 지도 학습은 컴퓨터가 학습하는 데이터에 레이블이 포함된 데이터로 학습을 수행한다. 여기서 레이블은 데이터 에 대한 정답 값을 의미하며, 컴퓨터는 새로운 입력에 대해 어느 정답 값과 비슷한 것인지를 판단한다. 즉 지도 학습은 정답이 있는 데이터를 활용해 데이터를 학습시키는 방법이다. 이러한 지도 학습의 알고리즘으로는 K-최근접 이웃(k-Nearest Neighbors), 선형 회귀(Linear Regression), 로 지스틱 회귀(Logistic Regression), 가우시안 회귀(Gaussian Process Regression), 서포트 벡터 머신(SVM, Support Vector Machine), 결정 트리(Decision Tree)와 랜덤 포레스트(Random Forest), 신경망(Neural Network) 등이 있으며, 이것에 한정되는 것은 아니다. 비지도 학습은 컴퓨터가 학습하는 데이터에 레이블이 포함되지 않은 데이터로 학습을 수행한다. 즉 비지도 학습 은 입력 데이터에 정답이 포함되어 있지 않아 컴퓨터 스스로 비슷한 것끼리 군집(그룹)화 하여 새로운 데이터에 대한 결과를 예측하는 방법이다. 이러한 비지도 학습의 알고리즘은 군집(Clustering), 시각화(Visualization)와 차원 축소(Dimensionality Reduction), 연관 규칙 학습(Association Rule Learning)을 포함하며, 이것에 한정되는 것은 아니다. 군집은 K-평균(k-Means), 계층 군집 분석(HCA, Hierarchical Cluster Analysis), 기댓값 최대화(Expectation Maximization) 등을 포함할 수 있다. 시각화와 자원 축소는 주성분 분석(PCA, Principal Component Analysis), 커널 PCA(Kernel PCA), 지역적 선형 임베딩(LLE, Locally-Linear Embedding), t-SNE(t-distributed Stochastic Neighbor Embedding) 등을 포함할 수 있다. 그리고 연관 규칙 학습은 어프라이어리(Apriori), 이클 렛(Eclat) 등을 포함할 수 있다. 준지도 학습은 지도 학습과 비지도 학습의 혼합으로 데이터 중 일부가 레이블을 포함하는 데이터로 학습을 수행 한다. 즉 준지도 학습은 지도 학습의 성능을 높이고자 하나, 데이터에 레이블 할 자원의 한계가 있을 때, 일부 데이터에만 레이블을 사용하는 학습 방법이다. 그리고 강화 학습은 주어진 환경에서 어떤 행동을 취하고 이로부터 피드백을 받으면서 시행착오를 통해 학습을 수행한다. 강화 학습은 기계학습 모델에 명시적인 데이터를 주지 않고, 프로그램이 결정을 하게 하고, 그 결정 에 의해 옳은 결정인지 잘못된 결정인지를 피드백을 받는 방식으로 학습을 수행한다. 여기서 피드백은 보상 (Reward)이라고 하며, 다음 결정에서는 긍정적 보상을 받는 방향으로 결정하고, 되도록 부정적 보상을 받는 방 향으로 결정하지 않도록 학습을 수행한다. 이러한 인공장기 제작 알고리즘은, 도 10 및 도 11에 도시된 바와 같이, 데이터 역설계 모델과 인공장 기 제작 모델을 포함한다. 여기서 도 10은 본 발명의 실시예에 따른 인공장기 제작 알고리즘을 보여주 는 블록도이다. 도 11은 도 10의 인공장기 제작 알고리즘을 구성하는 모델을 보여주는 상세 블록도이다. 데이터 역설계 모델은 인공장기 제작 모델의 학습에 필요한 데이터를 역설계 기술을 이용하여 생성한다. 그리고 인공장기 제작 모델은 데이터 역설계 모델이 생성한 데이터로 기계학습을 수행한 후, 사용자의 요구 조건을 입력값으로 하여 사용자 맞춤형 인공장기를 바이오 프린터를 제어하여 제작한다. 데이터 역설계 모델에 대해서 설명하면 다음과 같다. 일반적으로 인체 장기는 환자 개개인마다 그 물성이 매우 상이하기 때문에, 많은 고객을 확보하기 위해서는 다 양한 물성을 가지는 인공장기를 제작하기 위한 원료를 확보할 필요가 있다. 하지만, 원료는 특성의 다양성과 복 잡성으로 인해 타겟 물성을 지니는 원료를 모두 직접적으로 합성하는 것은 시간적으로나 비용면에서 노력이 많 이 소요된다. 따라서 본 실시예에서는 데이터 역설계 모델을 기반으로 기계학습을 통한 원료의 역설계 기술 을 사용하였다. 데이터 역설계 모델은 인공장기 제작 모델을 학습하기 위한 가상 데이터를 아래와 같이 생성하였다. 즉 실험 데이터의 부족을 해결하고 역설계 모델의 성능을 높이기 위해서, 데이터 역설계 모델은 온디맨드(On- Demand)로 새로운 데이터 포인트(가상 데이터)를 생성하는 기술을 사용하였다.이러한 데이터 역설계 모델은 대리 모델(61; Surrogate Model), 역설계 딥러닝 모델 및 가상 데이터 모 델을 포함할 수 있다. 이때 데이터 역설계 모델은 타겟 물성 예측 정확도 90% 및 역설계 공정 변수 추 정 정확도 80%를 목표로 모델을 개발하였다. 대리 모델은 분자 지문을 통해 원료에서 피처를 추출하고 타겟 물성(기계적 물성, 전기 소작 특성, 3D 인쇄 성)을 예측한다. 역설계 딥러닝 모델은 타겟 물성을 합성할 수 있는 공정 변수와 원료 선택을 수행한다. 그리고 가상 데이터 모델은 광범위한 합성 변수 공간의 데이터 분포를 추정하여 가상 데이터 생성한다. 인공장기 제작 모델은 기계학습 모델, 인공기능 모델 및 프린터 제어 모델을 포함한다. 사용자(환자)의 생리적, 나이, 성별 등의 조건에 따른 인공장기들의 최적 디자인 파라미터가 매우 상이하지만, 이를 예측하여 고객 맞춤형 인공장기 제공하는 방법이 기존에 존재하지 않았다. 최적 타겟 디자인 파라미터가 정해지더라도 데이터 역설계 모델이 기계학습을 할 때 사용하는 실험 데이터는 전체 변수의 공간을 모두 추 정하기에 한계가 있다. 따라서 본 실시예에서는 인공장기 제작 모델이 다양한 환자 조건에 따른 타겟 장기의 디자인 파라미터를 추 정하고 한정된 데이터로부터 체계적으로 제조 공정 및 물질 조성비를 수정해 나가는 효율적인 프로세스를 구축 한다. 인공장기 제작 모델은 환자의 최적화 디자인 변수 예측 정확도 80%, 타겟 변수를 획득하기 위해 제작 공정 및 조성 등의 수정 반복 평균 횟수 5회로 목표로 제작하였다. 기계학습 모델은 사용자의 요구 조건, 예컨대 다양한 환자의 생리적(BMI, 3차원 조직 모델 등), 유전적, Demographic(나이, 성별 등) 정보를 바탕으로 장기 조직별 최적 디자인을 도출한다. 인공지능 모델은 빅데이터를 기반으로 한 다양한 기계학습으로 공정 변수를 포함하는 자동화된 합성 프로세 스를 디자인할 수 있다. 인공지능 모델은 빅데이터에 포함된 데이터에 따라 적절한 기계학습 알고리즘이 선 택되어 사용될 수 있다. 예컨대 인공지능 모델은 가우시안 프로세스와 베이지안 기법을 기반으로 최적화된 공정 변수를 포함하는 자동화된 합성 프로세스를 디자인할 수 있으며, 이것에 한정되는 것은 아니다. 그리고 프린터 제어 모델은 인공지능 모델에서 디자인한 공정 변수를 3D 바이오 프린터의 제어에 적용 하여 사용자 맞춤형 인공장기를 제작한다. 이와 같이 인공장기 제작 알고리즘에 입력값을 입력하여 인공장기를 제작하는 과정을 예를 들어 설명하면 다음과 같다. 그리고 3D 바이오 프린터에 인공장기 모델링 파일(STL)을 입력함으로써, 3D 바이오 프린팅으로 인공장기를 제작 한다. 본 실시예에 따르면, 인공장기와 관려된 빅데이터를 기반으로 사용자가 요청하는 조건에 대응하는 인공장기를 제작할 수 있다. 즉 다양한 인공장기의 제작하는 과정에서 확보된 빅데이터를 기반으로 사용자의 요구 조건을 입력값으로 하여 바이오 프린팅으로 사용자 맞춤형 인공장기를 제작할 수 있다. 입력값은 인공장기의 경도, 인장강도, 인성 및 연성에 대한 수치값이기 때문에, 입력값으로 수치를 입력하여 그 에 맞는 인공장기를 제작할 수 있고, 이로 인해 대량 생산이 가능한 이점이 있다. 그리고 본 실시예에 따른 인공장기 제작 시스템은 빅데이터를 기반으로 하기 때문에, 실험, 제조 및 검증 에 필요한 시간을 줄일 수 있다. 한편, 본 명세서와 도면에 개시된 실시예들은 이해를 돕기 위해 특정 예를 제시한 것에 지나지 않으며, 본 발명 의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시예들 이외에도 본 발명의 기술적 사상에 바탕을 둔"}
{"patent_id": "10-2022-0169461", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 변형예들이 실시 가능하다는 것은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게는 자명한 것이다."}
{"patent_id": "10-2022-0169461", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 빅데이터 기반의 인공장기 제작 시스템을 보여주는 블록도이다. 도 2는 도 1의 데이터베이스부를 보여주는 블록도이다. 도 3 내지 도 5는 모노머(Agarose, Acrylamide) 및 첨가제(MBA)에 대한 응력-변형률(stress-strain) 특성을 보 여주는 그래프이다. 도 6은 첨가제의 기계적 특성 중 영률(Young's Modulus), 최대 인장 강도(Ultimate Tensile Strength) 및 인성 (Toughness)을 보여주는 그래프이다. 도 7은 첨가제의 기계적 특성 중 골절지점(Fracture point)을 보여주는 그래프이다. 도 8은 인공장기 제작에 사용되는 원료의 데이터 프로세싱 결과를 보여주는 표이다. 도 9는 모노머(Agarose, Acrylamide) 및 첨가제(MBA)에 대한 비율별 기계적 특성을 보여주는 그래프이다. 도 10은 본 발명의 실시예에 따른 인공장기 제작 알고리즘을 보여주는 블록도이다. 도 11은 도 10의 인공장기 제작 알고리즘을 구성하는 모델을 보여주는 상세 블록도이다."}
