{"patent_id": "10-2022-0183070", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0100920", "출원번호": "10-2022-0183070", "발명의 명칭": "배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템", "출원인": "주식회사 젠트로피", "발명자": "임봉재"}}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "배터리 교환기의 내부 온도를 감지하는 적어도 하나의 온도 센서; 및상기 배터리 교환기의 내부 온도를 미리 결정된 온도 범위에 유지시키기 위해 상기 배터리 교환기의 내부 공기를 가열하거나 냉각시키는 온도 유지부;를 포함하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 배터리 교환기는 복수개의 휴대용 배터리팩의 충전을 수행하는 복수개의 충전 슬롯을 포함하고, 각각의 상기 충전 슬롯이 각각의 상기 휴대용 배터리팩을 충전하도록 구성되고, 상기 미리 결정된 온도 범위는 16℃~24℃인 것을 특징으로 하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 휴대용 배터리팩은 고출력 리튬 계열 배터리셀인 것을 특징으로 하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 온도 유지부는,상기 미리 결정된 온도 범위의 하한값 미만으로 상기 배터리 교환기의 내부 온도가 떨어진 경우 상기 내부 공기를 가열하거나 또는 상기 미리 결정된 온도 범위의 상한값을 초과하여 상기 배터리 교환기의 내부 온도가 상승된 경우 상기 내부 공기를 냉각시키는 냉온풍기를 포함하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,충전을 수행 중인 충전 슬롯의 개수를 감지하는 관리 제어부;를 더 포함하고,상기 온도 유지부는 상기 충전을 수행 중인 충전 슬롯의 개수 및 상기 배터리 교환기의 내부 온도에 기초하여상기 냉온풍기의 가열 온도 및 가열 시간 또는 냉각 온도 및 냉각 시간을 설정하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 관리 제어부는 상기 충전을 수행 중인 충전 슬롯의 개수가 임계치를 초과하는 일별 시간대, 주별 시간대및 월별 시간대를 결정하고, 상기 온도 유지부는 상기 충전을 수행 중인 충전 슬롯의 개수가 임계치를 초과하는 일별 시간대, 주별 시간대및 월별 시간대를 추가로 고려하여 상기 냉온풍기의 가열 온도 및 가열 시간 또는 냉각 온도 및 냉각 시간을 설정하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 4에 있어서, 상기 냉온풍기의 온풍 또는 냉풍을 충전을 수행중인 충전 슬롯으로 지향시킬 수 있도록 구성된 복수의 지향판;공개특허 10-2024-0100920-3-및상기 온풍 또는 상기 냉풍을 순환시키는 순환팬;을 더 포함하고,각각의 상기 지향판 및 상기 순환팬은 상기 배터리 교환기의 일 측면으로부터 중앙 공간으로 돌출되도록 구성된것을 특징으로 하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,각각의 상기 지향판은 상기 냉온풍기의 온풍 또는 냉풍의 유동 방향을 조절하기 위해 복수의 기울기로 조절가능하도록 구성된, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 2에 있어서, 상기 배터리 교환기의 내부 온도가 40도를 초과하는 경우 상기 충전 슬롯의 충전을 중단하는 안전 차단부;를 더포함하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 2에 있어서,상기 복수개의 충전 슬롯은 4개의 이상의 충전 슬롯 그리고 64개의 이하의 충전 슬롯으로 구성된 것을 특징으로하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 2에 있어서,상기 휴대용 배터리팩은 전기 이륜차 또는 전기 자동차용 인것을 특징으로 하는, 배터리 교환기의 냉난방 시스템."}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 배터리 교환기의 냉난방 시스템은 배터리 교환기의 내부 온도를 감지하는 적어도 하 나의 온도 센서; 및 상기 배터리 교환기의 내부 온도를 미리 결정된 온도 범위에 유지시키기 위해 상기 배터리 교환기의 내부 공기를 가열하거나 냉각시키는 온도 유지부;를 포함한다."}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 배터리 교환기의 냉난방 시스템에 관한 것으로, 보다 상세하게는 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템 시스템에 관한 것이다."}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "요즘 들어 환경오염과 지구 온난화에 대한 전 세계적인 관심이 급속히 증대되면서 다양한 산업 분야에서 CO2 및 유해 배기물을 적극적으로 저감시켜야 하는 상황이 전개되고 있다. 특히 수송 분야는 CO2 배출과 지구 온난화에 가장 큰 영향을 미치는 분야로 인식되어 각국 정부에서는 자동차 업계에 온실가스 배출을 줄일 수 있는 친환경, 고효율 운송 수단의 생산 및 시판을 독려하고 있다. 전기 이륜차는 정부의 친환경차 전환 정책에 따라 보조금을 지원 받을 수 있음에도 배달산업 종사자들에게 외면 받아 왔다. 이유는 배터리 용량이 적어 배달하기엔 주행거리가 부족했기 때문이다. 일반적으로 배달 이륜차는 하루에 100~120km를 달려야 하는데 중간 2~3시간의 충전 시간은 수익 증대에 치명적 일 수밖에 없다. 이런 상황하에서 배터리 교환 방식 전기 이륜차가 주목받고 있다. 인근 배터리 교환 스테이션에서 방전된 배터 리를 넣고 완충된 배터리를 전기 이륜차에 장착하는 방식이다. 주행 거리가 아쉽고 충전 시간이 짧아 선 듯 전 기 이륜차를 선택하지 못했던 이용자들에게 유효한 대안이 될 있다. 배달 종사자들은 일을 하다가 배터리 잔량이 얼마 없으면 배터리 스테이션에 찾아가 배터리를 교환하면 된다. 충전기에서 완충하려면 2시간 30분이 걸리지만 배터리 교환을 하면 1분이면 완충되는 것이다. 그러나, 종래의 배터리 스테이션에는 배터리 최적 충전 온도 유지를 위한 구성이 없어 이에 대한 요구가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허 공보 10-2021-0109108 (2021.09.06)"}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템을 제공 하고자 한다. 본 발명의 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재 로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템은, 배터리 교환기의 내부 온도를 감지하는 적어도 하나의 온도 센서; 및 상기 배터리 교환기의 내부 온도를 미리 결정된 온도 범위에 유지시키기 위해 상기 배터리 교환기의 내부 공기 를 가열하거나 냉각시키는 온도 유지부;를 포함한다. 바람직하게는, 상기 배터리 교환기는 복수개의 휴대용 배터리팩의 충전을 수행하는 복수개의 충전 슬롯을 포함하고, 각각의 상 기 충전 슬롯이 각각의 상기 휴대용 배터리팩을 충전하도록 구성되고, 상기 미리 결정된 온도 범위는 16℃~24℃인 것을 특징으로 한다. 바람직하게는, 상기 휴대용 배터리팩은 전압 기준 100V 이하, 연속 충전 0.3C 이상, 연속 방전 1.0C이상, 고출력 리튬 계열 배 터리셀인 것을 특징으로 한다. 바람직하게는, 상기 온도 유지부는, 상기 미리 결정된 온도 범위의 하한값 미만으로 상기 배터리 교환기의 내부 온도가 떨어진 경우 상기 내부 공기 를 가열하거나 또는 상기 미리 결정된 온도 범위의 상한값을 초과하여 상기 배터리 교환기의 내부 온도가 상승 된 경우 상기 내부 공기를 냉각시키는 냉온풍기를 포함한다. 바람직하게는, 충전을 수행 중인 충전 슬롯의 개수를 감지하는 관리 제어부;를 더 포함하고, 상기 온도 유지부는 상기 충전을 수행 중인 충전 슬롯의 개수 및 상기 배터리 교환기의 내부 온도에 기초하여 상기 냉온풍기의 가열 온도 및 가열 시간 또는 냉각 온도 및 냉각 시간을 설정한다. 바람직하게는, 상기 관리 제어부는 상기 충전을 수행 중인 충전 슬롯의 개수가 임계치를 초과하는 일별 시간대, 주별 시간대 및 월별 시간대를 결정하고, 상기 온도 유지부는 상기 충전을 수행 중인 충전 슬롯의 개수가 임계치를 초과하는 일별 시간대, 주별 시간대 및 월별 시간대를 추가로 고려하여 상기 냉온풍기의 가열 온도 및 가열 시간 또는 냉각 온도 및 냉각 시간을 설 정한다. 바람직하게는, 상기 냉온풍기의 온풍 또는 냉풍을 충전을 수행중인 충전 슬롯으로 지향시킬 수 있도록 구성된 복수의 지향판; 및 상기 온풍 또는 상기 냉풍을 순환시키는 순환팬;을 더 포함하고, 상기 지향판 및 상기 순환팬은 상기 배터리 교환기의 일 측면으로부터 중앙 공간으로 돌출되도록 구성된 것을 특징으로 한다. 바람직하게는, 각각의 상기 지향판은 상기 냉온풍기의 온풍 또는 냉풍의 유동 방향을 조절하기 위해 복수의 기울기로 조절가능 하도록 구성된다. 바람직하게는, 상기 배터리 교환기의 내부 온도가 40도를 초과하는 경우 상기 충전 슬롯의 충전을 중단하는 안전 차단부;를 더 포함한다. 바람직하게는, 상기 복수개의 충전 슬롯은 4개의 이상의 충전 슬롯 그리고 64개의 이하의 충전 슬롯으로 구성된 것을 특징으 로 한다. 바람직하게는, 상기 휴대용 배터리팩은 전기 이륜차 또는 전기 자동차용 인것을 특징으로 한다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템은 배터리 교환기의 내부 온 도를 배터리팩의 충전에 최적인 온도로 유지할 수 있다. 본 발명에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템은 히터 또는 냉각기 즉, 에 어컨의 소비 전력을 최소로 유지하면서도 배터리 교환기의 내부 온도를 효율적으로 유지할 수 있다."}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "다만, 본 발명의 효과들은 이상에서 언급한 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하"}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 본 명세서에서 기술하는 실시예들은 본 발명의 이상적인 예시도인 단면도 및/또는 평면도들을 참고하여 설명될 것이다. 도면들에 있어서, 구성들의 두께는 기술적 내용의 효과적인 설명을 위해 과장된 것이다. 따라서, 도면 에서 예시된 구성들은 개략적인 속성을 가지며, 도면에서 예시된 구성들의 모양은 구성의 특정 형태를 예시하기 위한 것이며 발명의 범주를 제한하기 위한 것이 아니다. 본 명세서의 다양한 실시예들에서 제1, 제2, 제3 등의 용어가 다양한 구성요소들을 기술하기 위해서 사용되었지만, 이들 구성요소들이 이 같은 용어들에 의해서 한정 되어서는 안 된다. 이들 용어들은 단지 어느 구성요소를 다른 구성요소와 구별시키기 위해서 사용되었을 뿐이다. 여기에 설명되고 예시되는 실시예들은 그것의 상보적인 실시예들도 포함한다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자에 하나 이상의 다 른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 이하, 도면을 참조하여, 본 발명의 개념 및 이에 따른 실시예들에 대해 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 개략도를 도시한 도면 이다. 본 발명에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기는 복수개의 휴대용 배터리팩의 충전을 수행하는 복수개의 충전 슬롯을 포함한다. 배터리 교환기는 편리한 배터리 공유 서비스를 제공하기 위해 대형 마트, 편의점, 공중전화 부스 등 접근성이 좋은 장소에 설치될 수 있다. 복수개의 충전 슬롯의 각각의 충전 슬롯은 각각의 하나의 휴대용 배터리팩을 충전하도록 구성된다. 본 발명의 일 실시예에 따른 휴대용 배터리팩은 전압 기준 100V 이하, 연속 충전 0.3C 이상, 연속 방전 1.0C이 상, 고출력 리튬 계열 배터리셀이다. 휴대용 배터리팩의 상기의 리튬 계열 배터리셀에 한정되는 것은 아니며, 전기 이륜차 또는 전기 자동차용으로 사용될 수 있는 임의의 배터리팩을 포함할 수 있다. 리튬 배터리의 경우, 배터리팩이 사용되는 외부 환경 온도는 배터리팩의 성능 및 수명에 큰 영향을 미친다. 일 반적으로 배터리 셀의 최적 사용 온도 조건은 대략 25℃ 전후이며, 방전 시 배터리 셀에 대한 보증 온도는 -20 ℃ ~ 70℃이다. 온도에 민감한 배터리는 저온 상태일 때 효율이 급격히 떨어진다. 저온 상태에서는 1회 충전 후 주행 가능 거리 가 평소보다 줄어들 수 있는데, 이는 액체 전해질로 구성된 리튬 이온 배터리의 특성 때문이다. 액체 전해질은 리튬 이온이 양극을 오가도록 돕는 매개체 역할을 하는데, 기온이 떨어지면 전해질이 굳어 내부 저항이 커지면서 배터리 효율도 떨어진다. 이런 불편을 해소하기 위해 본 발명은 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템을 제공한다. 본 발명의 배터리 교환기의 냉난방 시스템은 온도 센서 및 온도 유지부를 포함한다. 온도 센서는 배터리 교환기의 크기에 따라 적어도 하나의 온도 센서를 포함할 수 있고, 온도 센서는 배터리 교환기의 내부 온도를 감지한다. 배터리 교환기 외부의 온도를 감지하기 위한 추가의 온도 센서를 포함할 수 있다. 본 발명에 따른 배터리 교환 기의 냉난방 시스템은 계절과 온도를 모두 고려하여 최적의 온도 범위를 미리 결정할 수 있다. 온도 유지부는 배터리 교환기의 내부 온도를 미리 결정된 온도 범위에 유지시키기 위해 배터리 교환기의 내부 공기를 가열하거나 냉각시킨다. 본 발명의 배터리 교환기의 냉난방 시스템은 배터리 교환기의 내부 온도를 휴대용 배터리팩의 최적의 온도 인 16℃~24℃로 유지한다. 추가로, 본 발명의 배터리 교환기의 냉난방 시스템은 배터리 교환기의 내부 온도가 40도를 초과하는 경우 충전 슬롯의 충전을 중단하는 안전 차단부(미도시)를 포함할 수 있다. 본 발명의 일 실시예에 따른 온도 유지부는 미리 결정된 온도 범위의 하한값 미만으로 배터리 교환기의 내부 온 도가 떨어진 경우 내부 공기를 가열하거나 또는 미리 결정된 온도 범위의 상한값을 초과하여 배터리 교환기의 내부 온도가 상승된 경우 내부 공기를 냉각시키는 냉온풍기를 포함한다. 본 발명의 다른 실시예에 따른 온도 유지부는 미리 결정된 온도 범위의 하한값 미만으로 배터리 교환기의 내부 온도가 떨어진 경우 내부 공기를 가열하는 히터 및 미리 결정된 온도 범위의 상한값을 초과하여 배터리 교환기 의 내부 온도가 상승된 경우 내부 공기를 냉각시키는 냉각기를 포함할 수 있다. 온도 유지부를 냉온풍기로 구성하는 것은 배터리 온풍기를 일체형으로 구성하는 일 실시예를 예시한 것이고, 이 에 온도 유지부를 히터와 냉각기로 구성하는 것은 별도의 컴포넌트로 구성하는 다른 실시예를 예시한 것이다. 도 2는 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 사시도를 도시한 것으 로, 도 2a는 측면 사시도이고, 도 2b는 후면 사시도이다. 도 2a는 본 발명의 일 실시예에 따른 배터리 교환기의 측면 사시도를 도시한다. 도 2a에 도시된 바와 같이 배터 리 교환기의 전면부에는 휴대용의 배터리팩의 충전을 위한 충전 슬롯이 제공된다. 도 2a에 도시된 배터리 교환기는 4개의 충전 슬롯을 포함하고 있으나, 이는 일 예를 도시한 것으로 이에 한정되는 것은 아니다. 본 발명의 일 실시예에 따른 배터리 교환기는 전기 이륜차 또는 전기 자동차용 휴대용 배터리팩의 충전을 위한 것으로, 4개의 이상의 충전 슬롯 그리고 64개의 이하의 충전 슬롯으로 구성될 수 있다. 도 2b는 배터리 교환기의 후면 사시도를 도시한 것으로, 도 2b는 온도 유지부를 포함한다. 도 2b에 도시된 바와 같이 온도 유지부는 냉온풍기(150-1) 및 실외기(150-2)를 포함할 수 있다. 상기에서 언급한 바와 같이, 온도 유지부는 냉온풍기(150-1)의 일체형으로 구성될 수 있거나 또는 히터 및 에어컨의 별도의 컴포넌트로 구성될 수도 있다. 온도 유지부는 배터리 교환기의 전면부의 충전 슬롯의 후방의 공간의 내부 공기를 가열 또는 냉 각 시킬 수 있다. 도 2b에 도시된 냉온풍기(150-1)의 냉풍 또는 온풍의 순환을 통하여 배터리 교환기의 내부 온도를 16℃~24 ℃로 유지할 수 있다. 본 발명의 일 실시예에 따른 온도 유지부는 냉온풍기를 이용하여 16℃~24℃의 하한값 미만으로 배터리 교 환기의 내부 온도가 떨어진 경우 내부 공기를 가열하거나 또는 16℃~24℃의 상한값을 초과하여 배터리 교 환기의 내부 온도가 상승된 경우 내부 공기를 냉각시킨다. 본 발명의 일 실시예에 따른 배터리 교환기의 냉난방 시스템은 충전을 수행 중인 충전 슬롯의 개수를 감지하는 관리 제어부(미도시)를 더 포함한다. 온도 유지부는 충전을 수행 중인 충전 슬롯의 개수 및 배터리 교환기의 내부 온도에 기초하여 냉온풍기의 가열 온도 및 가열 시간 또는 냉각 온도 및 냉각 시간을 설정한다. 본 발명의 일 실시예에 따른 관리 제어부는 충전을 수행 중인 충전 슬롯의 개수가 임계치를 초과하는 일별 시간대, 주별 시간대 및 월별 시간대를 결정할 수 있다. 배터리 충전기에서 충전을 수행 중인 충전 슬롯의 개수가 많을 수록 배터리 충전기의 내부 온도 는 증가할 것이다. 따라서, 본 발명의 일 실시예에 따른 냉온풍기(150-1)는 충전을 수행 중인 충전 슬롯의 개수가 임계치를 초과하는 경우를 결정하여 해당 시간대에 가동되도록 구성될 수 있다. 상기 임계치는 충전 슬롯의 개수에 따라 달라지 수 있다. 예를 들어, 8개의 충전 슬롯이 구비된 배터리 충전기 는 임계치를 4개로 설정할 수 있다. 64개의 충전 슬롯이 구비된 배터리 충전기는 임계치를 32개로 설 정할 수 있다. 임계치는 사용자의 설정에 따라 달라질 수 있으며, 상기에서 제시된 4개 또는 32개는 예시를 위한 것으로 임계 치가 이에 한정되는 것은 아니다. 즉, 구체적으로 배터리 충전기에서 배터리팩의 많이 이용하는 시간대 예를 들어, 출퇴근 시간이나 주말에 배달 주문이 많은 시간대를 결정할 수 있다. 이렇게 결정된 충전을 수행 중인 충전 슬롯의 개수가 임계치를 초과하는 일별 시간대, 주별 시간대 및 월별 시 간대를 추가로 고려하여 온도 유지부는 냉온풍기의 가열 온도 및 가열 시간 또는 냉각 온도 및 냉각 시간 을 설정한다. 도 3a은 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템의 공 기 순환부의 개략도를 도시한 도면이다. 도 3a은 본 발명의 일 실시예에 따른 냉난방 시스템의 공기 순환부의 구성을 도시한 것이다. 공기 순환부는 도 2b에 도시된 공기의 순환이 도시된 부분에 설치될 수 있다. 즉, 냉온풍기(150-1)의 냉풍 또는 온풍의 유출구가 배치된 공간의 전방에 그리고 충전 슬롯의 후방의 공간에 공기 순환부가 배치 될 수 있다. 공기 순환부는 냉온풍기(150-1)의 온풍 또는 냉풍을 충전을 수행중인 충전 슬롯으로 지향시킬 수 있도록 구성된 복수의 지향판 및 온풍 또는 상기 냉풍을 순환시키는 순환팬을 포함하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 각각의 지향판 및 순환팬은 배터리 교환기의 일 측면으로부터 중앙 공간으로 돌출되도록 구성될 수 있다. 각각의 지향판은 냉온풍기(150-1)의 온풍 또는 냉풍의 유동 방향을 조절하기 위해 복수의 기울기로 조절가 능 하도록 구성된다. 예를 들어, 64개의 충전 슬롯을 갖는 배터리 충전기는 한 대의 냉온풍기(150-1)를 이용하여 내부 공기를 원하는 적정 온도를 유지하는데 소비 전력이 과다할 수 있다. 이를 해결하기 위해 지향판과 순환팬을 이용하여 배터리 교환기의 내부 온도를 효율적으로 적정 온도로 유지하게 할 수 있다.냉온풍기(150-1)의 냉풍 또는 온풍의 유출구의 근처의 배터리 충전기의 측면에 제1 지향판을 설치하 고, 제1 지향판은 냉풍 또는 온풍을 배터리 충전기의 대향 측면으로 보낼 수 있도록 기울기가 조절될 수 있다. 제1 지향판이 설치된 측면과 대향하는 측면에는 제2 지향판이 설치되어 제1 지향판으로부터 보 내진 냉풍 또는 온풍을 현재 충전중인 충전 슬롯이 위치된 위쪽 또는 아래쪽 방향으로 보내도록 기울기가 조절 될 수 있다. 제1 지향판과 제2 지향판의 중간에는 순환팬이 설치되어 배터리 교환기의 내부에 온풍 또 는 냉풍의 순환을 보조할 수 있다. 순환팬은 온도 유지부에 별도로 구비될 수 있음은 물론이며, 필요한 경우 내부의 임의의 위치에도 마 련될 수 있다. 도 3b는 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템의 지 향판의 사시도를 도시한 도면이다. 도 3b에 도시된 바와 같이 지향판(310-1, 310-2, 310-3, 310-4)은 냉온풍기(150-1)의 유출구의 좌측에 종방향 으로 일정 간격을 두고 장착될 수 있다. 지향판은 충전 슬롯으로 온풍 또는 냉풍의 순환을 보조하기 위해 설치 된다. 도 3b에는 4개의 지향판이 도시되어 있으나, 지향판의 개수는 충전 슬롯의 개수에 따라 변화될 수 있다. 도 3b에는 지향판이 냉온풍기(150-1)의 유출구의 좌측에 설치되어 있으나, 충전 슬롯의 개수가 늘어나면, 냉온 풍기(150-1)의 유출구의 우측에도 설치될 수 있다. 한편, 지향판의 일측에는 지향판을 구동하는 모터가 설치되어 있다. 도 3c는 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템의 지 향판의 정면도를 도시한 도면이다. 도 3d는 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템의 지 향판의 측면도를 도시한 도면이다. 도 3d에 도시된 바와 같이, 지향판(310-1, 310-2)은 소정 각도로 경사지게 조정되어 앞쪽으로 돌출되어 온풍 또 는 냉풍이 충전 슬롯으로 지향되는 것을 돕는다. 지향판(310-3, 310-4)은 돌출되지 않고, 냉온풍기(150-1)의 평면상에 위치된다. 도 4는 본 발명의 다양한 실시예에 따른 장치 및/또는 시스템을 구현할 수 있는 예시적인 컴퓨팅 장치를 도시한 도면이다. 도 4를 참조하여 본 개시의 몇몇 실시예에 따른 장치들을 구현할 수 있는 예시적인 컴퓨팅 장치를 보다 구 체적으로 설명하기로 한다. 컴퓨팅 장치는 하나 이상의 프로세서, 버스, 통신 인터페이스, 프로세서에 의하여 수 행되는 컴퓨터 프로그램을 로드(load)하는 메모리와, 컴퓨터 프로그램을 저장하는 스토리지 를 포함할 수 있다. 다만, 도 4에는 본 개시의 실시예와 관련 있는 구성 요소들 만이 도시되어 있다."}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "따라서, 본 개시가 속한 기술분야의 통상의 기술자라면 도 4에 도시된 구성 요소들 외에 다른 범용적인 구성 요 소들이 더 포함될 수 있음을 알 수 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 개시의 기술 분야에 잘 알려진 임의의 형태의 프로세서를 포함하여 구성될 수 있다. 또한, 프로세서 는 본 개시의 실시예들에 따른 방법을 실행하기 위한 적어도 하나의 애플리케이션 또는 프로그램에 대한 연산을 수행할 수 있다. 컴퓨팅 장치는 하나 이상의 프로세서를 구비할 수 있다. 컴퓨팅 장치는 인공 지능(AI)을 지칭할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 실시예들에 따른 방법을 실행하기 위하여 스토리지로부터 하나 이상의 프로그램을 로드 할 수 있다. 메모리는 RAM과 같 은 휘발성 메모리로 구현될 수 있을 것이나, 본 개시의 기술적 범위가 이에 한정되는 것은 아니다. 버스는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한다. 버스는 주소 버스(Address Bus), 데 이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인 터넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본 개시의 기술 분 야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 몇몇 실시예들에 따르면, 통신 인터페이스는 생략될 수도 있다. 스토리지는 상기 하나 이상의 프로그램과 각종 데이터를 비임시적으로 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 개시가 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드 될 때 프로세서로 하여금 본 개시의 다양한 실시예에 따른 방 법/동작을 수행하도록 하는 하나 이상의 명령들을 포함할 수 있다. 즉, 프로세서는 상기 하나 이상의 명령 들을 실행함으로써, 본 개시의 다양한 실시예에 따른 방법/동작들을 수행할 수 있다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2022-0183070", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "정되지 아니하며, 특허청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에 서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기 술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다.도면 도면1 도면2a 도면2b 도면3a 도면3b 도면3c 도면3d 도면4"}
{"patent_id": "10-2022-0183070", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 개략도를 도시한 도면 이다.도 2는 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 사시도를 도시한 것으 로, 도 2a는 측면 사시도이고, 도 2b는 후면 사시도이다. 도 3a은 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템의 공 기 순환부의 개략도를 도시한 도면이다. 도 3b는 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템의 지 향판의 사시도를 도시한 도면이다. 도 3c는 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템의 지 향판의 정면도를 도시한 도면이다. 도 3d는 본 발명의 일 실시예에 따른 배터리 최적 충전 온도 유지를 위한 배터리 교환기의 냉난방 시스템의 지 향판의 측면도를 도시한 도면이다. 도 4는 본 발명의 다양한 실시예에 따른 장치 및/또는 시스템을 구현할 수 있는 예시적인 컴퓨팅 장치를 도시한 도면이다."}
