{"patent_id": "10-2023-0104122", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0023085", "출원번호": "10-2023-0104122", "발명의 명칭": "품질관리 시스템", "출원인": "주식회사 한국오픈솔루션", "발명자": "이상부"}}
{"patent_id": "10-2023-0104122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "품질관리 시스템에 있어서,수집대상 장비로부터 분석대상 데이터와, 상기 수집대상 장비 주변의 환경 데이터와, 상기 수집대상 장비에 의해 생상된 제품의 이미지 데이터를 수집하는 수집부;상기 수집부에 수집된 데이터를 분석하여 제품의 품질을 판정하는 분석부;상기 분석부의 정보에 기초하여 학습모델과 매칭하여 딥러닝 학습을 수행하는 학습부; 및상기 분석 데이터를 출력하는 출력부;를 포함하는 품질관리 시스템."}
{"patent_id": "10-2023-0104122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 딥러닝 학습 결과를 토대로 상기 수집대상 장비와 대응하는 분석대상 데이터 및 학습대상 데이터 각각에대한 장비이력을 수치화하는 장비관리부를 더 포함하는 품질관리 시스템."}
{"patent_id": "10-2023-0104122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 분석부에 의한 품질 판정의 결과와 해당 제품의 생산중에 상기 수집부에 의해 수집된 분석대상 데이터와환경 데이터를 모두 매칭하여 통계화하는 통계화 처리부를 더 포함하는 품질관리 시스템."}
{"patent_id": "10-2023-0104122", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 품질관리 시스템에 관한 것으로, 수집대상 장비로부터 분석대상 데이터와 상기 수집대상 장비 주변의 환경 데이터와 상기 수집대상 장비에 의해 생상된 제품의 이미지 데이터를 수집하는 수집부와, 상기 수집부에 수 집된 데이터를 분석하여 제품의 품질을 판정하는 분석부와, 상기 분석부의 정보에 기초하여 학습모델과 매칭하여 딥러닝 학습을 수행하는 학습부 및, 상기 분석 데이터를 출력하는 출력부를 포함한다."}
{"patent_id": "10-2023-0104122", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 품질관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0104122", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "제조 분야에서는 관련된 데이터의 수집, 분석 및 활용은 어려운 작업이다. 인공지능, 딥러닝, 예비보전 등의 데 이터 분석 기술이 제조분야 적용되는 것에 한계가 있다. 이를 개선한 스마트 공장(smart factory)이 연구되고 있지만, 도입 비용이 높고, 이를 관리할 수 있는 전문인력 확보가 어렵기에, 대기업 일부 공장에만 보급되어 있다. 따라서, 대부분의 산업 현장에서는 데이터 분석에 따른 품질분석, 공정 최적화, 인공지능 등의 기술이 적절하게 활용되지 못한다. 이와 같이, 빅데이터를 확보하여 공정 및 품질을 개선하기 위해, 고가의 스마트 공장을 도입하지 않으면서도, 데이터마이닝을 실행하는 기술, 확보된 데이터를 분석하는 기술, 전문가 없이도 분석된 데이터를 제조 현장에서 직접 사용할 수 있도록 직관적으로 가공하는 기술에 대한 요구는 매우 높은 실정이다."}
{"patent_id": "10-2023-0104122", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 수집된 데이터를 기반으로 통계 분석을 수행하되, 전문가 없이도 분석 결과를 현장에 직접 적용함으로써 최적화된 공정 및 품질 관리를 할 수 있는 품질관리 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0104122", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 품질관리 시스템에 있어서, 수집대상 장비로부터 분석대상 데이터와 상기 수집대상 장비 주변의 환경 데이터와 상기 수집대상 장비에 의해 생상된 제품의 이미지 데이터를 수집하는 수집부와, 상기 수집부에 수집된 데이터를 분석하여 제품의 품질을 판정하는 분석부와, 상기 분석부의 정보에 기초하여 학습모델과 매칭하여 딥 러닝 학습을 수행하는 학습부 및, 상기 분석 데이터를 출력하는 출력부를 포함한다. 여기서, 상기 딥러닝 학습 결과를 토대로 상기 수집대상 장비와 대응하는 분석대상 데이터 및 학습대상 데이터 각각에 대한 장비이력을 수치화하는 장비관리부를 더 포함하는 것이 바람직하다. 상기 분석부에 의한 품질 판정의 결과와 해당 제품의 생산중에 상기 수집부에 의해 수집된 분석대상 데이터와 환경 데이터를 모두 매칭하여 통계화하는 통계화 처리부를 더 포함하는 품질관리 시스템."}
{"patent_id": "10-2023-0104122", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 구성을 갖는 본 발명에 따르면, 수집된 데이터를 기반으로 통계 분석을 수행하되, 전문가 없이도 분석 결과를 현장에 직접 적용함으로써 최적화된 공정 및 품질 관리를 할 수 있다."}
{"patent_id": "10-2023-0104122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부도면을 참조하여 본 발명의 실시예에 따른 품질관리 시스템을 구체적으로 설명한다. 도 1을 참조하면, 실시예에 따른 품질관리 시스템은 수집부, 분석부, 학습부, 출력부(14 0)를 포함한다. 수집부는 수집대상 장비로부터 분석대상 데이터와, 수집대상 장비 주변의 환경 데이터와, 수집대상 장비에 의해 생상된 제품의 이미지 데이터를 수집한다. 또한, 수집부는 제품을 생산중인 생산설비에서의 진동의 발생과 발생한 진동의 세기를 측정하는 하나 이상 의 진동 센서, 제품을 생산중인 생산설비 주변의 온도와 습도를 측정하는 하나 이상의온습도 센서 그리고 생산 된 제품의 외형을 하나 이상의 방향에서 촬영하는 하나 이상의 이미지 센서를 포함한다. 그리고, 수집부는 제품을 생산중인 생산설비에서 발생하는 소음의 크기를 측정하는 소음 센서, 제품을 생 산중인 생산설비에서의 연기의 발생을 감지하는 연기 센서, 제품을 생산중인 생산설비에서 발생하는 가스의 종 류를 감지하고 그 농도를 측정하는 다종류의 가스 센서, 생산설비 또는 생산된 제품 중 어느 하나 이상의 비파 괴 검사를 실시하는 초음파 센서 또는 생산된 제품의 무게를 측정하는 하중 센서 중 어느 하나 이상을 생산설비 의 종류에 따라 더 포함한다. 수집부는 센서부에 의해 생성되는 측정값, 감지값, 결과값 그리고 이미지를 모두 수집하여 분석부 로 전송하는 통신부를 더 포함한다. 분석부는 수집부에 수집된 데이터를 분석하여 제품의 품질을 판정한다. 이러한 분석부는 분석대상 데 이터와 환경 데이터 그리고 제품의 이미지를 수신하여 분석을 실시한다. 분석부는 수집부에 의해 수집된 하나 이상의 이미지를 분석하여 제품의 품질을 판정하는 판정부(12 2)를 포함한다. 판정부는 기저장된 제품의 정상 이미지를 기준으로 하여 하나 이상의 이미지 센서에 의해 실시간으로 수집되는 제품의 이미지를 대조함으로써 신규로 생산되는 제품의 외형에 대한 품질을 기설정된 판정기준에 따라 판정한다. 학습부는 분석부의 정보에 기초하여 학습모델과 매칭하여 딥러닝 학습을 수행한다. 이러한 학습부는 파라미터, 최적화 로직, 학습할 데이터의 컬럼, 샘플링 방법, 분산처리를 수행할 데이터 및 분산처리 수행 결과의 저장 경로를 포함하는 학습정의 데이터에 따라 학습을 수행하도록 구성되며, 학습정의 데이터에 대한 샘플링을 달리하여 학습할 수 있다. 본 발명은 학습부의 딥러닝 학습 결과를 토대로 수집대상 장비와 대응하는 분석대상 데이터 및 학습대상 데이터 각각에 대한 장비이력을 수치화하는 장비관리부를 포함한다. 정비관리부는 학습부의 딥러닝 학습 결과를 토대로 수집대상 장비와 대응하는 분석대상 데이터 및 학 습대상 데이터 각각에 대한 정비이력을 수치화한 정비이력서를 생성하여 저장 및 관리한다. 본 발명은 분석부에 의한 품질 판정의 결과와 해당 제품의 생산중에 수집부에 의해 수집된 분석대상 데이터와 환경 데이터를 모두 매칭하여 통계화하는 통계화 처리부를 포함한다. 통계화 처리부는 판정부에 의해 점수화되어 점수로 표시되거나 등급화되어 등급으로 표시되는 품질 판정의 결과를 그 품질 판정의 기반이 된 작동 데이터와 환경 데이터를 구성하는 세부 항목들과 매칭하여 저장 하고 통계화함으로써 판정부에 의해 최상위의 점수나 최상위의 등급으로 판정될 수 있는 제품을 생산하기 위한 최적의 조건이 통계적으로 확인될 수 있도록 한다."}
{"patent_id": "10-2023-0104122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 본 발명의 실시예를 첨부도면을 참조하여 설명하였지만, 당해 기술분야에 숙련된 사람은 하기의 청구범위 에 기재된 본 발명의 기술적 사상으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경할 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0104122", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 품질관리 시스템을 도시하는 구성도이다."}
