{"patent_id": "10-2020-0173082", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0079355", "출원번호": "10-2020-0173082", "발명의 명칭": "플렉서블 디스플레이를 포함하는 전자 장치 및 그 운용 방법", "출원인": "삼성전자주식회사", "발명자": "김상욱"}}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 슬라이딩 동작하는 제1 하우징;상기 제1 하우징과 체결되며 적어도 하나의 개구부가 형성된 제2 하우징;상기 제1 하우징의 상기 슬라이딩 동작에 대응하여 노출 영역의 크기가 변경되는 플렉서블 디스플레이;적어도 하나의 센서;프로세서; 및상기 플렉서블 디스플레이, 상기 적어도 하나의 센서, 및 상기 프로세서와 작동적으로 연결되고, 인스트럭션들을 저장하는 메모리;를 포함하고, 상기 인스트럭션들은, 상기 프로세서에 의해 실행될 때, 상기 전자 장치가, 상기 적어도 하나의 센서를 이용하여 상기 적어도 하나의 개구부를 통하여 상기 전자 장치의 외부로 시각적으로노출되는 상기 플렉서블 디스플레이의 제1 영역을 식별하고,상기 제1 영역을 활성화하고,상기 적어도 하나의 개구부에 대한 제1 사용자 입력을 수신하여 기설정된 기능을 실행하도록 구성된,전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 인스트럭션들은, 상기 프로세서에 의해 실행될 때, 상기 전자 장치가, 상기 적어도 하나의 센서를 이용하여 상기 전자 장치의 형태 변화를 감지하고,상기 적어도 하나의 개구부를 통하여 상기 전자 장치의 외부로 시각적으로 노출되는 상기 플렉서블 디스플레이의 제2 영역을 식별하고,상기 제2 영역을 활성화하고,상기 적어도 하나의 개구부에 대한 제2 사용자 입력을 수신하여 상기 기설정된 기능을 실행하도록 구성된,전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 인스트럭션들은, 상기 프로세서에 의해 실행될 때, 상기 전자 장치가, 상기 적어도 하나의 센서를 이용하여 상기 전자 장치의 형태 변화에 따른 상기 플렉서블 디스플레이의 이동량을식별하고,상기 플렉서블 디스플레이의 이동량에 기반하여 상기 제2 영역을 식별하도록 구성된, 공개특허 10-2022-0079355-3-전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 적어도 하나의 개구부는 제1 개구부 및 제2 개구부를 포함하고,상기 제1 영역은 상기 제1 개구부에 대응되는 제3 영역 및 상기 제2 개구부에 대응되는 제4 영역을 포함하고,상기 인스트럭션들은, 상기 프로세서에 의해 실행될 때, 상기 전자 장치가,상기 제3 영역 및 상기 제4 영역에 서로 다른 기능을 매핑하도록 구성된,전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 제1 개구부 및 상기 제2 개구부는 격벽에 의해 이격된,전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 상기 기설정된 기능은 볼륨 조절 기능, 전원 제어 기능, 또는 인공 지능 소프트웨어 호출 기능 중 적어도 하나를 포함하는,전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 인스트럭션들은, 상기 프로세서에 의해 실행될 때, 상기 전자 장치가,상기 제1 영역을 통하여 알림(notification)을 표시하도록 구성되는,전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 상기 알림은 상기 전자 장치의 배터리 잔량, 메시지 수신, 또는 부재 중 전화 중 적어도 하나를 포함하는,전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서, 상기 인스트럭션들은, 상기 프로세서에 의해 실행될 때, 상기 전자 장치가,공개특허 10-2022-0079355-4-상기 제1 사용자 입력에 응답하여 피드백(feedback)을 제공하도록 구성되는,전자 장치."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "슬라이더블 전자 장치의 동작 방법으로서, 적어도 하나의 개구부를 통해 상기 전자 장치의 외부로 시각적으로 노출되는 플렉서블 디스플레이의 제1 영역을식별하는 동작;상기 제1 영역을 활성화하는 동작; 및상기 적어도 하나의 개구부에 대한 제1 사용자 입력을 수신하여 기설정된 기능을 실행하는 동작;을 포함하는,방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 전자 장치의 형태 변화를 감지하는 동작;상기 적어도 하나의 개구부를 통해 상기 전자 장치의 외부로 시각적으로 노출되는 상기 플렉서블 디스플레이의제2 영역을 식별하는 동작;상기 제2 영역을 활성화하는 동작; 및상기 적어도 하나의 개구부에 대한 제2 사용자 입력을 수신하여 상기 기설정된 기능을 실행하는 동작;을 더 포함하는,방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서, 상기 전자 장치의 형태 변화에 따른 상기 플렉서블 디스플레이의 이동량을 식별하는 동작;상기 플렉서블 디스플레이의 이동량에 기반하여 상기 제2 영역을 식별하는 동작;을 더 포함하는,방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10 항에 있어서, 상기 적어도 하나의 개구부는 제1 개구부 및 제2 개구부를 포함하고,상기 제1 영역은 상기 제1 개구부에 대응되는 제3 영역 및 상기 제2 개구부에 대응되는 제4 영역을 포함하고,상기 제3 영역 및 상기 제4 영역에 서로 다른 기능을 매핑하는 동작;을 더 포함하는,방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2022-0079355-5-제13 항에 있어서,상기 제1 개구부 및 상기 제2 개구부는 격벽에 의해 이격된,방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서,상기 기설정된 기능은 볼륨 조절 기능, 전원 제어 기능, 또는 인공 지능 소프트웨어 호출 기능 중 적어도 하나를 포함하는,방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10 항에 있어서,상기 제1 영역을 통하여 알림(notification)을 표시하는 동작;을 더 포함하는,방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 알림은 상기 전자 장치의 배터리 잔량, 메시지 수신, 또는 부재 중 전화 중 적어도 하나를 포함하는,방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10 항에 있어서,상기 제1 사용자 입력에 응답하여 피드백(feedback)을 제공하는 동작;을 더 포함하는, 방법."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "적어도 하나의 프로세서에 의하여 실행 가능한 하나 이상의 인스트럭션들을 저장하는 컴퓨터 판독 가능 기록 매체에 있어서, 상기 하나 이상의 인스트럭션들은, 상기 적어도 하나의 프로세서에 의해 실행 시, 상기 적어도 하나의 프로세서가적어도 하나의 개구부를 통해 전자 장치의 외부로 시각적으로 노출되는 플렉서블 디스플레이의 제1 영역을 식별하는 동작;상기 제1 영역을 활성화하는 동작; 및상기 적어도 하나의 개구부에 대한 제1 사용자 입력을 수신하여 기설정된 기능을 실행하는 동작;을 수행하도록설정된,공개특허 10-2022-0079355-6-컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2020-0173082", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서.상기 전자 장치의 형태 변화를 감지하는 동작;상기 적어도 하나의 개구부를 통해 상기 전자 장치의 외부로 시각적으로 노출되는 상기 플렉서블 디스플레이의제2 영역을 식별하는 동작;상기 제2 영역을 활성화하는 동작; 및상기 적어도 하나의 개구부에 대한 제2 사용자 입력을 수신하여 상기 기설정된 기능을 실행하는 동작;을 더 수행하도록 설정된,컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2020-0173082", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치는 슬라이딩 동작하는 제1 하우징, 상기 제1 하우징과 체결되며 적어도 하나의 개구부가 형성된 제2 하 우징, 상기 제1 하우징의 상기 슬라이딩 동작에 대응하여 노출 영역의 크기가 변경되는 플렉서블 디스플레이, 적 어도 하나의 센서, 프로세서, 및 상기 플렉서블 디스플레이, 상기 적어도 하나의 센서, 및 상기 프로세서와 작동 (뒷면에 계속)"}
{"patent_id": "10-2020-0173082", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(disclosure)의 다양한 실시예들은 플렉서블 디스플레이를 포함하는 전자 장치 및 그 운용 방법에 관한 것이다."}
{"patent_id": "10-2020-0173082", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양한 형태를 가지는 전자 장치가 개발되고 있다. 전자 장치의 형태는 외력(예: 사용자 조작, 구동 장치)에 의 해 변경될 수 있다. 전자 장치는 전자 장치의 기능(예: 전원, 볼륨 증감)을 제어하기 위한 물리 키를 포함할 수 있다. 사용자는 물 리 키를 조작하여 전자 장치의 기능을 제어할 수 있다."}
{"patent_id": "10-2020-0173082", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일실시예 따른 전자 장치의 폴더블 디스플레이 중 전자 장치 내부에 인입되어 롤링되는 부분은 외력에 취약하여 전자 장치의 하우징으로 보호될 수 있다. 하지만 플렉서블 디스플레이가 하우징 내부로 들어간 상태에서는 디스 플레이의 표시 영역이 하우징으로 가려져 있기 때문에 하우징 내부로 들어간 디스플레이의 활용이 어려워질 수 있다. 전자 장치의 일 측이 연장되거나 수축되는 슬라이더블 전자 장치의 경우, 전자 장치의 형태 변화에 따라 구성들 간의 위치가 변화하므로 물리 키 구현이 어려울 수 있다."}
{"patent_id": "10-2020-0173082", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 전자 장치는, 슬라이딩 동작하는 제1 하우징, 제1 하우징과 체결되며 적 어도 하나의 개구부가 형성된 제2 하우징, 제1 하우징의 슬라이딩 동작에 대응하여 노출 영역의 크기가 변경되 는 플렉서블 디스플레이, 적어도 하나의 센서, 프로세서, 및 플렉서블 디스플레이, 적어도 하나의 센서, 및 프 로세서와 작동적으로 연결되고, 인스트럭션들을 저장하는 메모리를 포함하고, 인스트럭션들은, 프로세서에 의해 실행될 때, 전자 장치가, 적어도 하나의 센서를 이용하여 적어도 하나의 개구부를 통하여 전자 장치의 외부로 시각적으로 노출되는 플렉서블 디스플레이의 제1 영역을 식별하고, 제1 영역을 활성화하고,' 적어도 하나의 개 구부에 대한 제1 사용자 입력을 수신하여 기설정된 기능을 실행하도록 구성될 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 전자 장치의 운용 방법은, 적어도 하나의 개구부를 통해 전자 장 치의 외부로 시각적으로 노출되는 플렉서블 디스플레이의 제1 영역을 식별하는 동작, 제1 영역을 활성화하는 동 작, 및 적어도 하나의 개구부에 대한 제1 사용자 입력을 수신하여 기설정된 기능을 실행하는 동작을 포함할 수있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 적어도 하나의 프로세서에 의하여 실행 가능한 하나 이상의 인스 트럭션들을 저장하는 컴퓨터 판독 가능 기록 매체에 있어서, 하나 이상의 인스트럭션들은, 적어도 하나의 프로 세서에 의해 실행 시, 적어도 하나의 프로세서가 적어도 하나의 개구부를 통해 전자 장치의 외부로 시각적으로 노출되는 플렉서블 디스플레이의 제1 영역을 식별하는 동작, 제1 영역을 활성화하는 동작, 및 적어도 하나의 개 구부에 대한 제1 사용자 입력을 수신하여 기설정된 기능을 실행하는 동작을 포함할 수 있다."}
{"patent_id": "10-2020-0173082", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 실시 예들에 따르면, 전자 장치는 하우징의 개구부을 통하여 시각적으로 노출되는 플렉서블 디스플레이의 적어도 일부를 기능 키로 활용하여 물리 키를 대체할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다. 본 개시의 다양한 실시 예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않 은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0173082", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버를 통하여 전자 장치(10 4)와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자 , 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예 에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구 성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다.센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다.안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다 른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들 간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또 는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청 할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있 다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로 서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부 의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망 을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워 크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또 는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하 나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소 와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미 한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치 들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2a는 본 문서에 개시된 다양한 실시예에 따른 전자 장치를 도시한다. 도 2b는 본 문서에 개시된 다양한 실시 예에 따른 전자 장치를 도시한다. 도 2a는 전자 장치(예: 도 1의 전자 장치)의 플렉서블 디스플레이(예: 도 1의 디스플레이 모듈 )의 일부분(예: 제2 영역(A2))이 제2 구조물에 수납된 상태를 나타내는 도면이다. 도 2b는 전자 장치 의 플렉서블 디스플레이의 대부분이 제2 구조물의 외부로 노출된 상태를 나타내는 도면이다. 도 2a에 도시된 상태는 제2 구조물에 대하여 제1 구조물이 폐쇄(closed)된 것으로 정의될 수 있으며, 도 2b에 도시된 상태는 제2 구조물에 대하여 제1 구조물이 개방(open)된 것으로 정의될 수 있다. 실 시예에 따라, \"폐쇄된 상태(closed state)\" 또는 \"개방된 상태(opened state)\"는 전자 장치가 폐쇄되거나 개방된 상태로 정의될 수 있다. 도 2a와 도 2b를 참조하면, 전자 장치는 제1 구조물과 제1 구조물에서 이동 가능하게 배치되는 제2 구조물을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에서 제1 구조물이 제2 구조물 상에서 슬라이드 이동 가능하게 배치된 구조로 해석될 수 있다. 한 실시예에 따르면, 제1 구조물은 제2 구조물을 기준으로 도시된 방향, 예를 들어, 화살표 ①로 지시된 방향으로 일정 거리만큼 왕복 운동이 가능하게 배치될 수 있다. 다양한 실시예에 따르면, 제1 구조물은, 예를 들면, 제1 하우징, 슬라이드부 또는 슬라이드 하우징으로 칭 해질 수 있으며, 제2 구조물 상에서 왕복 운동 가능하게 배치될 수 있다. 한 실시예에서, 제2 구조물(20 2)은, 예를 들면, 제2 하우징, 메인부 또는 메인 하우징으로 칭해질 수 있으며, 인쇄회로 기판이나 배터리와 같 은 각종 전기, 전자 부품을 수용할 수 있다. 플렉서블 디스플레이의 일부분(예: 제1 영역(A1))이 제1 구조 물에 안착될 수 있다. 어떤 실시예에서, 플렉서블 디스플레이의 다른 일부분(예: 제2 영역(A2))은, 제1 구조물이 제2 구조물에 대하여 이동(예: 슬라이드 이동)함에 따라, 제2 구조물의 내부로 수 납(예: 슬라이드-인(slide-in) 동작)되거나, 제2 구조물의 외부로 노출(예: 슬라이드-아웃(slide-out) 동 작)될 수 있다. 여기서, 플렉서블 디스플레이의 일부분(예: 제1 영역(A1))은 플렉서블 디스플레이가 슬라이드-인 상태에서의 기본 사용 영역일 수 있고, 플렉서블 디스플레이의 다른 일부분(예: 제2 영역 (A2))은 슬라이드-아웃 상태에서의 확장 영역일 수 있다. 도 2a 내지 도 2c에 도시된 실시예에서는 플렉서블 디 스플레이의 슬라이드-인 상태에서의 기본 사용 영역이 제1 구조물에 안착된 실시예가 도시된다. 다양한 실시예에 따르면, 제1 구조물은 제1 플레이트(211a)(예: 슬라이드 플레이트)를 포함할 수 있으며, 제1 플레이트(211a)의 적어도 일부분을 포함하여 형성된 제1 면(F1; 도 2c 참조) 및 제1 면(F1)과 반대 방향으 로 향하는 제2 면(F2)을 포함할 수 있다. 한 실시예에 따르면, 제2 구조물은 제2 플레이트(221a; 도 2c 참 조)(예: 후면 케이스), 제2 플레이트(221a)에서 연장된 제1 측벽(223a), 제1 측벽(223a)과 제2 플레이트(221 a)에서 연장된 제2 측벽(223b) 및 제1 측벽(223a)과 제2 플레이트(221a)에서 연장되고, 제2 측벽(223b)에 평행 한 제3 측벽(223c), 및/또는 후면 플레이트(221b)(예: 리어 윈도우)를 포함할 수 있다. 어떤 실시예에서, 제2 측벽(223b)과 제3 측벽(223c)은 제1 측벽(223a)과 수직하게 형성될 수 있다. 한 실시예에 따르면, 제2 플레이트 (221a), 제1 측벽(223a), 제2 측벽(223b) 및 제3 측벽(223c)은 제1 구조물의 적어도 일부를 수용하도록 (또는 감싸도록) 일측(예: 전면(front face))이 오픈되게 형성할 수 있다. 예컨대, 제1 구조물은 적어도 부분적으로 감싸지는 상태로 제2 구조물에 결합하며, 제2 구조물의 안내를 받으면서 제1 면(F1) 또는 제2 면(F2)과 평행한 방향, 예를 들어, 화살표 ① 방향으로 슬라이드 이동할 수 있다. 다양한 실시예에 따르면, 제2 측벽(223b) 또는 제3 측벽(223c)은 생략될 수 있다. 한 실시예에 따르면, 제2 플 레이트(221a), 제1 측벽(223a), 제2 측벽(223b) 및/또는 제3 측벽(223c)은 별개의 구조물로 형성되어 결합 또는 조립될 수 있다. 후면 플레이트(221b)는 제2 플레이트(221a)의 적어도 일부를 감싸게 결합할 수 있다. 어떤 실 시예에서, 후면 플레이트(221b)는 실질적으로 제2 플레이트(221a)와 일체형으로 형성될 수 있다. 한 실시예에 따르면, 제2 플레이트(221a) 또는 후면 플레이트(221b)는 플렉서블 디스플레이의 적어도 일부를 덮을 수 있다. 예컨대, 플렉서블 디스플레이는 적어도 부분적으로 제2 구조물의 내부로 수납될 수 있으며, 제 2 플레이트(221a) 또는 후면 플레이트(221b)는 제2 구조물의 내부로 수납된 플렉서블 디스플레이의 일부를 덮을 수 있다. 다양한 실시예에 따르면, 제1 구조물은 제2 플레이트(221a)(예: 후면 케이스) 및 제2 측벽(223b)에 평행한 제1 방향(예: ① 방향)으로 제2 구조물에 대하여 개방 상태 및 폐쇄 상태로 이동 가능하며, 제1 구조물 이 폐쇄 상태에서 제1 측벽(223a)으로부터 제1 거리에 놓여지고, 개방 상태에서 제1 측벽(223a)으로부터 제1 거리보다 큰 제2 거리에 놓여지도록 이동할 수 있다. 어떤 실시예에서, 폐쇄 상태일 때, 제1 구조물은 제1 측벽(223a)의 일부분을 감싸게 위치할 수 있다. 다양한 실시예에 따르면, 전자 장치는 플렉서블 디스플레이, 키 입력 장치, 커넥터 홀, 오 디오 모듈(245a, 245b, 247a, 247b) 또는 카메라 모듈을 포함할 수 있다. 도시되지는 않지만, 전자 장치 는 인디케이터(예: LED 장치) 또는 각종 센서 모듈을 더 포함할 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이는 제1 영역(A1)과 제2 영역(A2)을 포함할 수 있다. 한 실시 예에서, 제1 영역(A1)은 실질적으로 제1 면(F1)의 적어도 일부를 가로질러 연장되어 제1 면(F1)에 배치될 수 있 다. 제2 영역(A2)은 제1 영역(A1)으로부터 연장되며, 제1 구조물의 슬라이드 이동에 따라 제2 구조물 (예: 메인 하우징)의 내부로 삽입 또는 수납되거나, 상기 제2 구조물의 외부로 노출될 수 있다. 후술 하겠지만, 제2 영역(A2)은 실질적으로 제2 구조물에 장착된 롤러(251; 도 2c 참조)의 안내를 받으면서 이 동하여 상기 제2 구조물의 내부로 수납되거나 외부로 노출될 수 있다. 예컨대, 제1 구조물이 슬라이 드 이동하는 동안 제2 영역(A2)의 일부분이 롤러에 대응하는 위치에서 곡면 형태로 변형될 수 있다. 다양한 실시예에 따르면, 제1 플레이트(211a)(예: 슬라이드 플레이트)의 상부에서 바라볼 때, 제1 구조물 이 폐쇄 상태에서 개방 상태로 이동하면, 제2 영역(A2)이 점차 제2 구조물의 외부로 노출되면서 제1 영역 (A1)과 함께 실질적으로 평면을 형성할 수 있다. 플렉서블 디스플레이는 터치 감지 회로, 터치의 세기(압력)을 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 한 실시예에서, 제2 영역(A2)은 적어도 부분적으로 제2 구조물의 내부로 수납될 수 있으며, 도 2a에 도시된 상태(예: 폐쇄 상태)에서도 제2 영역(A2)의 일부는 외부로 노출될 수 있다. 어떤 실 시예에서, 폐쇄 상태 또는 개방 상태와 무관하게, 노출된 제2 영역(A2)의 일부는 롤러 상에 위치될 수 있 으며, 롤러에 대응하는 위치에서 제2 영역(A2)의 일부는 곡면 형태를 유지할 수 있다. 키 입력 장치는 제2 구조물의 제2 측벽(223b) 또는 제3 측벽(223c)에 배치될 수 있다. 외관과 사용 상태에 따라, 도시된 키 입력 장치가 생략되거나, 추가의 키 입력 장치(들)을 포함하도록 전자 장치 가 설계될 수 있다. 어떤 실시예에서, 전자 장치는 도시되지 않은 키 입력 장치, 예를 들면, 홈 키 버튼, 또는 홈 키 버튼 주변에 배치되는 터치 패드를 포함할 수 있다. 다른 실시예에 따르면, 키 입력 장치의 적 어도 일부는 제1 구조물의 일 영역에 위치할 수 있다. 다양한 실시예에 따르면, 커넥터 홀은, 실시예에 따라 생략될 수 있으며, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터(예: USB 커넥터)를 수용할 수 있다. 도시되지 않지만, 전자 장치는 복수 의 커넥터 홀을 포함할 수 있으며, 복수의 커넥터 홀 중 일부는 외부 전자 장치와 오디오 신호를 송 수신하기 위한 커넥터 홀로서 기능할 수 있다. 도시된 실시예에서, 커넥터 홀은 제3 측벽(223c)에 배치되 어 있지만, 본 발명이 이에 한정되지 않으며, 커넥터 홀 또는 도시되지 않은 커넥터 홀이 제1 측벽(223a) 또는 제2 측벽(223b)에 배치될 수 있다. 다양한 실시예에 따르면, 오디오 모듈(245a, 245b, 247a, 247b)은 스피커 홀(245a, 245b), 또는 마이크 홀 (247a, 247b)을 포함할 수 있다. 스피커 홀(245a, 245b) 중 하나는 음성 통화용 리시버 홀로서 제공될 수 있으 며, 다른 하나는 외부 스피커 홀로서 제공될 수 있다. 마이크 홀(247a, 247b)은 외부의 소리를 획득하기 위한 마이크가 내부에 배치될 수 있고, 어떤 실시예에서는 소리의 방향을 감지할 수 있도록 복수 개의 마이크가 배치 될 수 있다. 어떤 실시예에서는, 스피커 홀(245a, 245b)과 마이크 홀(247a, 247b)이 하나의 홀로 구현되거나, 스피커 홀(245a, 245b) 없이 스피커가 포함될 수 있다.(예: 피에조 스피커) 한 실시예에 따르면, 참조번호 \"245b\"로 지시된 스피커 홀은 제1 구조물에 배치되어 음성 통화용 리시버 홀로 활용될 수 있으며, 참조번 호 \"245a\"로 지시된 스피커 홀(예: 외부 스피커 홀), 또는 마이크 홀(247a, 247b)은 제2 구조물(예: 측면 들(223a, 223b, 223c) 중 하나)에 배치될 수 있다. 카메라 모듈은 제2 구조물에 제공되며 플렉서블 디스플레이의 제1 영역(A1)과는 반대 방향에서 피사체를 촬영할 수 있다. 전자 장치는 복수의 카메라 모듈을 포함할 수 있다. 예컨대, 전자 장치 는 광각 카메라, 망원 카메라 또는 접사 카메라를 포함할 수 있으며, 실시예에 따라, 적외선 프로젝터 및/ 또는 적외선 수신기를 포함함으로써 피사체까지의 거리를 측정할 수 있다. 카메라 모듈은 하나 또는 복수 의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 도시되지는 않지만, 전자 장치 는 플렉서블 디스플레이의 제1 영역(A1)과는 반대 방향에서 피사체를 촬영하는 카메라 모듈(예: 전면 카메라)을 더 포함할 수 있다. 예를 들어, 전면 카메라는 제1 영역(A1)의 주위에 또는 플렉서블 디스플레이 과 중첩하는 영역에 배치될 수 있으며, 플렉서블 디스플레이과 중첩하는 영역에 배치된 경우 플렉서 블 디스플레이를 투과하여 피사체를 촬영할 수 있다. 다양한 실시예에 따르면, 전자 장치의 인디케이터(미도시)는 제1 구조물 또는 제2 구조물에 배 치될 수 있으며, 발광 다이오드를 포함함으로써 전자 장치의 상태 정보를 시각적인 신호로 제공할 수 있다. 전자 장치의 센서 모듈(미도시)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈은, 예를 들어, 근접 센서, 지문 센서 또는 생 체 센서(예: 홍채/안면 인식 센서 또는 HRM 센서)를 포함할 수 있다. 다른 실시예에서, 센서 모듈, 예를 들어, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 더 포함할 수 있다. 도 2c는 본 문서에 개시된 다양한 실시예에 따른 전자 장치를 나타내는 분리 사시도이다. 도 2c를 참조하면, 전자 장치는 제1 구조물, 제2 구조물(예: 메인 하우징), 플렉서블 디스플레 이, 안내 부재(예: 롤러), 지지 시트(support sheet), 및/또는 다관절 힌지 구조를 포함 할 수 있다. 플렉서블 디스플레이의 일부분(예: 제2 영역(A2))은 롤러의 안내를 받으면서 제2 구조물 의 내부로 수납될 수 있다. 다양한 실시예에 따르면, 제1 구조물은 제1 플레이트(211a)(예: 슬라이드 플레이트), 제1 플레이트(211a) 에 장착되는 제1 브라켓(211b) 및/또는 제2 브라켓(211c)을 포함할 수 있다. 제1 구조물, 예를 들어, 제1 플레이트(211a), 제1 브라켓(211b) 및/또는 제2 브라켓(211c)은 금속 재질 및/또는 비금속(예: 폴리머) 재질로 형성될 수 있다. 제1 플레이트(211a)는 제2 구조물(예: 메인 하우징)에 장착되어 제2 구조물의 안내 를 받으면서 일 방향(예: 도 1의 화살표 ① 방향)으로 직선 왕복 운동할 수 있다. 한 실시예에서, 제1 브라켓 (211b)은 제1 플레이트(211a)에 결합하여 제1 플레이트(211a)와 함께 제1 구조물의 제1 면(F1)을 형성할 수 있다. 플렉서블 디스플레이의 제1 영역(A1)은 실질적으로 제1 면(F1)에 장착되어 평판 형태로 유지될 수 있다. 제2 브라켓(211c)은 제1 플레이트(211a)에 결합하여 제1 플레이트(211a)와 함께 제1 구조물의 제 2 면(F2)을 형성할 수 있다. 한 실시예에 따르면, 제1 브라켓(211b) 및/또는 제2 브라켓(211c)은 제1 플레이트 (211a)와 일체형으로 형성될 수 있다. 이는 제작되는 제품의 조립 구조나 제작 공정을 고려하여 적절하게 설계 될 수 있다. 제1 구조물 또는 제1 플레이트(211a)는 제2 구조물에 결합하여 제2 구조물에 대하 여 슬라이드 이동할 수 있다. 다양한 실시예에 따르면, 다관절 힌지 구조는 복수의 바(bar) 또는 막대(rod)을 포함할 수 있으며, 제1 구조물의 한 단부에 연결될 수 있다. 예를 들어, 제1 구조물이 슬라이드 이동함에 따라, 다관절 힌지 구조가 제2 구조물에 대하여 이동할 수 있으며, 폐쇄 상태(예: 도 1에 도시된 상태)에서는 실질 적으로 제2 구조물의 내부로 수납될 수 있다. 어떤 실시예에서, 폐쇄 상태라 하더라도, 다관절 힌지 구조 의 일부는 제2 구조물의 내부로 수납되지 않을 수 있다. 예를 들어, 폐쇄 상태에서도, 다관절 힌지 구조의 일부는 제2 구조물의 외부에서 롤러에 대응하게 위치될 수 있다. 복수의 막대는 일 직선으로 연장되어 롤러의 회전축(R)에 평행하게 배치되고, 회전축(R)에 수직인 방향을 따라, 예를 들어, 제1 구조물이 슬라이드 이동하는 방향을 따라 배열될 수 있다. 이로써, 제1 구조물이 슬라이드 이동함에 따라, 복수의 막대들은 곡면 형태를 이루게 배열되거나 평 면 형태를 이루게 배열될 수 있다. 예를 들어, 제1 구조물이 슬라이드 이동함에 따라, 롤러와 마주보 는 부분에서 다관절 힌지 구조는 곡면을 형성하고, 롤러와 마주보지 않는 부분에서 다관절 힌지 구조 는 평면을 형성할 수 있다. 한 실시예에서, 플렉서블 디스플레이의 제2 영역(A2)은 다관절 힌지 구조 에 장착 또는 지지되며, 개방 상태(예: 도 2에 도시된 상태)에서 제1 영역(A1)과 함께 제2 구조물의 외부로 노출될 수 있다. 제2 영역(A2)이 제2 구조물의 외부로 노출된 상태에서, 다관절 힌지 구조는 실질적으로 평면을 형성함으로써 제2 영역(A2)을 평탄한 상태로 지지 또는 유지할 수 있다. 다양한 실시예에 따르면, 제2 구조물(예: 메인 하우징)은 제2 플레이트(221a)(예: 후면 케이스), 인쇄 회 로 기판(미도시), 후면 플레이트(221b), 제3 플레이트(221c)(예: 전면 케이스), 지지 부재(221d)를 포함할 수 있다. 제2 플레이트(221a), 예를 들어, 후면 케이스는 제1 플레이트(211a)의 제1 면(F1)과는 반대 방향을 향하 게 배치될 수 있으며, 실질적으로 제2 구조물 또는 전자 장치의 외관 형상을 제공할 수 있다. 한 실 시예에서, 제2 구조물은 제2 플레이트(221a)에서 연장된 제1 측벽(223a), 제2 플레이트(221a)에서 연장되 면서 제1 측벽(223a)과 실질적으로 수직을 이루게 형성된 제2 측벽(223b) 및 제2 플레이트(221a)에서 연장되면 서 제1 측벽(223a)과 실질적으로 수직을 이루고 제2 측벽(223b)과는 평행한 제3 측벽(223c)을 포함할 수 있다. 도시된 실시예에서, 제2 측벽(223b)과 제3 측벽(223c)은 제2 플레이트(221a)와는 별도의 부품으로 제작되어 제2 플레이트(221a)에 장착 또는 조립되는 구조가 예시되지만, 제2 플레이트(221a)와 일체형으로 형성될 수 있다. 제2 구조물은 상기 다관절 힌지 구조와 중첩되지 않는 공간에 근접 무선 통신용 안테나, 무선 충전용 안테나 또는 MST(magnetic secure transmission)용 안테나를 수용할 수 있다. 다양한 실시예에 따르면, 후면 플레이트(221b)는 제2 플레이트(221a)의 외측면에 결합할 수 있으며, 실시예에 따라 제2 플레이트(221a)와 일체형으로 제작될 수 있다. 한 실시예에서, 제2 플레이트(221a)는 금속 또는 폴리 머 재질로 제작될 수 있으며, 후면 플레이트(221b)가 금속, 유리, 합성수지 또는 세라믹과 같은 재질로 제작되 어 전자 장치의 외관에서 장식 효과를 제공할 수 있다. 한 실시예에 따르면, 제2 플레이트(221a) 및/또는 후면 플레이트(221b)는 적어도 부분적(예: 보조 디스플레이 영역)으로 빛을 투과하는 재질로 제작될 수 있다. 예를 들어, 플렉서블 디스플레이의 일부(예: 제2 영역(A2))가 제2 구조물의 내부로 수납된 상태에서, 전자 장치는 제2 구조물의 내부로 수납된 플렉서블 디스플레이의 일부 영역을 이용하여 시각적 인 정보를 출력할 수 있다. 보조 디스플레이 영역은 제2 구조물 내부에 수납된 영역에서 출력된 시각적인 정보를 제2 구조물의 외부로 제공할 수 있다. 다양한 실시예에 따르면, 제3 플레이트(221c)는 금속 또는 폴리머 재질로 제작되며, 제2 플레이트(221a)(예: 후 면 케이스), 제1 측벽(223a), 제2 측벽(223b) 및/또는 제3 측벽(223c)과 결합하여 제2 구조물의 내부 공간 을 형성할 수 있다. 실시예에 따라 제3 플레이트(221c)는 \"전면 케이스\"라고 칭하여 질 수 있으며, 제1 구조물, 예를 들어, 제1 플레이트(211a)는 실질적으로 제3 플레이트(221c)와 마주보는 상태로 슬라이드 이동할 수 있다. 어떤 실시예에서, 제1 측벽(223a)은 제2 플레이트(221a)에서 연장된 제1 측벽부(223a-1)와, 제3 플레 이트(221c)의 일측 가장자리에 형성된 제2 측벽부(223a-2)의 조합으로 형성될 수 있다. 다른 실시예에서, 제1 측벽부(223a-1)가 제3 플레이트(221c)의 일측 가장자리, 예컨대, 제2 측벽부(223a-2)를 감싸게 결합할 수 있으 며, 이 경우, 제1 측벽부(223a-1) 자체가 제1 측벽(223a)을 형성할 수 있다. 다양한 실시예에 따르면, 지지 부재(221d)는 제2 플레이트(221a)와 제3 플레이트(221c) 사이의 공간에 배치될 수 있으며, 금속 또는 폴리머 재질로 제작된 평판 형상을 가질 수 있다. 지지 부재(221d)는 제2 구조물의 내부 공간에서 전자기 차폐 구조를 제공하거나, 제2 구조물의 기계적인 강성을 향상시킬 수 있다. 한 실시 예에서, 제2 구조물의 내부로 수납된 때, 다관절 힌지 구조 및/또는 플렉서블 디스플레이의 일 부 영역(예: 제2 영역(A2))은 제2 플레이트(221a)와 지지 부재(221d) 사이의 공간에 위치할 수 있다. 다양한 실시예에 따르면, 도시되지 않은 인쇄 회로 기판은 제3 플레이트(221c)와 지지 부재(221d) 사이의 공간 에 배치될 수 있다. 예컨대, 인쇄 회로 기판은 제2 구조물의 내부에서 다관절 힌지 구조 및/또는 플 렉서블 디스플레이의 일부 영역이 수용되는 공간으로부터 지지 부재(221d)에 의해 분리된 공간에 수용될 수 있다. 인쇄 회로 기판에는, 프로세서, 메모리, 및/또는 인터페이스가 장착될 수 있다. 프로세서는, 예를 들 어, 중앙처리장치, 어플리케이션 프로세서, 그래픽 처리 장치, 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서 중 하나 또는 그 이상을 포함할 수 있다. 메모리(예: 도 1의 메모리)는, 예를 들어, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이 스, SD카드 인터페이스, 및/또는 오디오 인터페이스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치 를 외부 전자 장치와 전기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이는, 유기 발광 다이오드에 기반한 플렉서블 디스플레이로서, 대체로 평면 형태로 유지되면서 적어도 부분적으로 곡면 형태로 변형될 수 있다. 한 실시예에서, 플렉서블 디스 플레이의 제1 영역(A1)은 제1 구조물의 제1 면(F1)에 장착 또는 부착되어 실질적으로 평판 형태로 유 지될 수 있다. 제2 영역(A2)은 제1 영역(A1)으로부터 연장되며, 다관절 힌지 구조에 지지되거나 부착될 수 있다. 예컨대, 제2 영역(A2)은 제1 구조물의 슬라이드 이동 방향을 따라 연장되며, 다관절 힌지 구조(21 3)와 함께 제2 구조물의 내부로 수납될 수 있고, 다관절 힌지 구조의 변형에 따라 적어도 부분적으로 곡면 형상을 이루게 변형될 수 있다. 다양한 실시예에 따르면, 제1 구조물이 제2 구조물 상에서 슬라이드 이동함에 따라, 외부로 노출되는 플렉서블 디스플레이의 면적이 달라질 수 있다. 전자 장치(예: 프로세서)는 외부로 노출되는 플렉서 블 디스플레이의 면적에 기반하여 활성화되는 플렉서블 디스플레이의 영역을 변경할 수 있다. 예를 들어, 개방 상태에서 또는 폐쇄 상태와 개방 상태의 중간 위치에서, 전자 장치는 플렉서블 디스플레이 의 전체 면적 중 제2 구조물의 외부로 노출된 영역을 활성화할 수 있다. 폐쇄 상태에서, 전자 장치 는 플렉서블 디스플레이의 제1 영역(A1)을 활성화하고, 제2 영역(A2)을 비활성화할 수 있다. 폐쇄 상 태에서, 일정 시간(예: 30초 또는 2분) 동안 사용자 입력이 없다면, 전자 장치는 플렉서블 디스플레이 의 전체 영역을 비활성화할 수 있다. 어떤 실시예에서는, 플렉서블 디스플레이의 전체 영역이 비활성 화된 상태에서, 필요에 따라(예: 사용자 설정에 따른 알림, 부재 중 전화 / 메시지 도착 알림) 전자 장치 는 플렉서블 디스플레이의 일부 영역을 활성화하여 보조 디스플레이 영역(예: 빛을 투과하는 재질로 제작 된 제2 플레이트(221a) 및/또는 후면 플레이트(221b)의 일부분)을 통해 시각적인 정보를 제공할 수 있다. 다양한 실시예에 따르면, 개방 상태(예: 도 2에 도시된 상태)에서, 실질적으로 플렉서블 디스플레이의 전 체 영역(예: 제1 영역(A1)과 제2 영역(A2))이 외부로 노출될 수 있으며, 제1 영역(A1)과 제2 영역(A2)은 평면을 이루게 배치될 수 있다. 한 실시예에서, 개방된 상태라 하더라도, 제2 영역(A2) 중 일부(예: 한 단부)는 롤러 에 대응하게 위치할 수 있으며, 제2 영역(A2) 중에서 롤러에 대응하는 부분은 곡면 형상으로 유지될 수 있다. 예컨대, 본 문서에 개시된 다양한 실시예에서, \"개방된 상태에서, 제2 영역(A2)이 평면을 이루게 배치 된다\"라고 언급하더라도 제2 영역(A2)의 일부는 곡면 형태로 유지될 수 있으며, 이와 유사하게, \"폐쇄된 상태에 서, 다관절 힌지 구조 및/또는 제2 영역(A2)이 제2 구조물의 내부로 수납된다\"라고 언급하더라도, 다 관절 힌지 구조 및/또는 제2 영역(A2)의 일부는 제2 구조물의 외부로 위치될 수 있다.다양한 실시예에 따르면, 안내 부재, 예를 들어, 롤러는 제2 구조물(예: 제2 플레이트(221a))의 일측 가장자리에 인접하는 위치에서, 제2 구조물에 회전 가능하게 장착될 수 있다. 예를 들어, 롤러는 제1 측벽(223a)과 평행한 제2 플레이트(221a)의 가장자리(예: 참조번호 'IE'로 지시된 부분))과 인접하게 배치될 수 있다. 도면에 참조번호를 부여하지는 않았지만, 롤러에 인접하는 제2 플레이트(221a)의 가장자리에서 또 다른 측벽이 연장될 수 있으며, 롤러에 인접하는 측벽은 제1 측벽(223a)과 실질적으로 평행할 수 있다. 앞 서 언급한 바와 같이, 롤러와 인접하는 제2 구조물의 측벽은 빛을 투과하는 재질로 제작될 수 있으며, 제2 영역(A2)의 일부는 제2 구조물에 수용된 상태에서 제2 구조물의 일부분을 투과하여 시각 적인 정보를 제공할 수 있다. 다양한 실시예에 따르면, 롤러의 한 단부는 제2 측벽(223b)에 회전 가능하게 결합하고, 다른 단부는 제3 측벽(223c)에 회전 가능하게 결합할 수 있다. 예를 들어, 롤러는 제2 구조물에 장착되어, 제1 구조물 의 슬라이드 이동 방향(예: 도 2a 또는 도 2b의 화살표 ① 방향)에 대하여 수직하는 회전축(R)을 중심으로 회전할 수 있다. 회전축(R)은 실질적으로 제1 측벽(223a)과 평행하게 배치되며, 제1 측벽(223a)과는 멀게, 예를 들면, 제2 플레이트(221a)의 일측 가장자리에 위치할 수 있다. 한 실시예에서, 롤러의 외주면과 제2 플레 이트(221a) 가장자리의 내측면 사이에 형성된 간격은 다관절 힌지 구조 또는 플렉서블 디스플레이가 제2 구조물의 내부로 진입하는 입구를 형성할 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이가 곡면 형태로 변형될 때, 롤러는 플렉서블 디스플레 이의 곡률 반경을 일정 정도로 유지함으로써, 플렉서블 디스플레이의 과도한 변형을 억제할 수 있다. \"과도한 변형\"이라 함은 플렉서블 디스플레이에 포함되는 픽셀이나 신호 배선이 손상될 정도로 지나치게 작은 곡률 반경을 가지게 플렉서블 디스플레이가 변형되는 것을 의미할 수 있다. 예컨대, 플렉서블 디스플 레이는 롤러의 안내를 받으면서 이동 또는 변형될 수 있으며, 과도한 변형으로 인한 손상으로부터 보 호받을 수 있다. 어떤 실시예에서, 다관절 힌지 구조 또는 플렉서블 디스플레이가 제2 구조물에 삽입되거나 외부로 취출되는 동안 롤러가 회전할 수 있다. 예컨대, 다관절 힌지 구조(또는 플렉서블 디스플레이)와 제2 구조물 사이의 마찰을 억제하여 다관절 힌지 구조(또는 플렉서블 디스플레이 )가 제2 구조물의 삽입 / 취출 동작을 원활하게 할 수 있다. 다양한 실시예에 따르면, 지지 시트(support sheet)는, 유연성과 일정 정도의 탄성을 가지는 재질, 예를 들어, 실리콘(silicone)이나 고무(rubber)와 같은 탄성체를 포함하는 물질로 제작될 수 있으며, 롤러에 장 착 또는 부착되어 롤러가 회전함에 따라 선택적으로 롤러에 감겨질 수 있다(may be wound). 도시된 실시예에서, 지지 시트는 롤러의 회전축(R) 방향을 따라 복수(예: 4개)로 배열될 수 있다. 예를 들어, 복수의 지지 시트들은 인접하는 다른 지지 시트와 일정 간격을 두고 롤러에 장착될 수 있 으며, 회전축(R)에 수직하는 방향을 따라 연장될 수 있다. 다른 실시예에서, 1개의 지지 시트가 롤러에 장 착 또는 부착될 수 있다. 예를 들어, 1개의 지지 시트는, 도 2c에서 지지 시트들이 배치된 영역과 지지 시 트들 사이의 영역에 대응하는 크기와 형상을 가질 수 있다. 이와 같이, 지지 시트의 수와 크기 또는 형상은 실제 제작되는 제품에 따라 적절하게 변경될 수 있다. 어떤 실시예에서, 지지 시트는 롤러가 회전함에 따라 롤러의 외주면에 말아지거나 롤러로부터 벗어나 플렉서블 디스플레이와 제3 플레 이트(221c) 사이에서 평판 형태로 펼쳐질 수 있다. 다른 실시예에서, 지지 시트는 \"지지 벨트\", \"보조 벨 트\", \"지지 필름\" 또는 \"보조 필름\"이라 칭하여 질 수 있다. 다양한 실시예에 따르면, 지지 시트의 단부가 제1 구조물, 예를 들어, 제1 플레이트(211a)(예: 슬라 이드 플레이트)에 연결되며, 폐쇄 상태(예: 도 1에 도시된 상태)에서 지지 시트가 롤러에 말아질 수 있다. 따라서, 제1 플레이트(211a)가 개방 상태(예: 도 2a에 도시된 상태)로 이동하면, 지지 시트는 점차 제2 구조물(예: 제3 플레이트(221c))과 플렉서블 디스플레이(예: 제2 영역(A2))사이로, 또는 제2 구 조물(예: 제3 플레이트(221c))과 다관절 힌지 구조 사이로 위치할 수 있다. 예컨대, 지지 시트 는 적어도 일부분이 다관절 힌지 구조와 마주보게 위치할 수 있으며, 제1 플레이트(211a)의 슬라이드 이동 에 따라 롤러에 선택적으로 감겨질 수 있다. 지지 시트는 대체로 다관절 힌지 구조과 접촉하게 배치되지만, 롤러에 말아진 부분은 실질적으로 다관절 힌지 구조로부터 분리될 수 있다. 다양한 실시예에 따르면, 지지 시트가 롤러에 감겨진 정도에 따라 플렉서블 디스플레이의 표면 과 제2 플레이트(221a)의 가장자리 내측면 사이의 간격(예: 배치 간격(G))이 다를 수 있다. 배치 간격(G)이 작 을수록 외부의 이물질이 유입되는 것을 방지하기 용이하지만, 지나치게 작아지면 플렉서블 디스플레이가 제2 플레이트(221a)와 접촉 또는 마찰할 수 있다. 직접적인 접촉이나 마찰이 발생하는 경우 플렉서블 디스플레이의 표면이 손상되거나 제1 구조물의 슬라이드 동작에 장애가 될 수 있다. 다양한 실시예에 따르면, 폐쇄 상태에서 지지 시트가 롤러에 감겨짐으로써, 플렉서블 디스플레이 의 표면이 제2 플레이트(221a)와 접촉하지 않는 상태를 유지하면서, 플렉서블 디스플레이의 표면과 제2 플레이트(221a)의 가장자리 내측면 사이의 간격을 줄일 수 있다. 예컨대, 폐쇄 상태에서 배치 간격(G)을 줄 여 외부의 이물질이 제2 구조물의 내부로 유입되는 것을 차단할 수 있다. 한 실시예에서, 제1 구조물 (예: 제1 플레이트(211a) 또는 슬라이드 플레이트)가 점차 개방 상태로 이동함에 따라 지지 시트가 롤러에서 벗어나 점차 제2 구조물(예: 제2 플레이트(221a) 또는 제3 플레이트(221c))과 다관절 힌지 구조 사이로 이동할 수 있다. 예컨대, 제1 구조물이 개방 상태로 이동함에 따라 배치 간격(G)이 점차 증가하여 플렉서블 디스플레이와 다른 구조물(예: 제2 플레이트(221a))의 직접적인 마찰이나 접촉을 억제 하고, 마찰이나 접촉으로 인해 플렉서블 디스플레이의 표면이 손상되는 것을 방지할 수 있다. 어떤 실시예 에서, 일단(예: 롤러에 고정된 부분)으로부터 타단(예: 제1 플레이트(211a)에 고정된 부분)에 가까울수록 지지 시트의 두께가 점차 증가할 수 있다. 이러한 지지 시트의 두께 프로파일(profile)을 이용하여, 폐쇄 상태와 개방 상태에서의 배치 간격(G)이 조절될 수 있다. 다양한 실시예에 따르면, 전자 장치은 스펀지와 같은 저밀도 탄성체 또는 브러쉬(brush)로 제작된 적어도 하나의 탄성 부재(231, 233)를 포함할 수 있다. 예를 들면, 전자 장치은 플렉서블 디스플레이의 한 단부에 장착된 제1 탄성 부재를 포함할 수 있으며, 실시예에 따라, 제2 플레이트(221a)의 가장자리 내측면 에 장착된 제2 탄성 부재를 더 포함할 수 있다. 제1 탄성 부재는 실질적으로 제2 구조물의 내부 공간으로 배치되며, 개방 상태(예: 도 2a에 도시된 상태)에서는 제2 플레이트(221a)의 가장자리에 대응하게 위 치할 수 있다. 한 실시예에서, 제1 탄성 부재는 제1 구조물의 슬라이드 이동에 따라, 제2 구조물 의 내부 공간에서 이동할 수 있다. 폐쇄 상태에서 개방 상태로 제1 구조물이 이동할 때, 제1 탄성 부 재는 제2 플레이트(221a)의 가장자리를 향해 이동할 수 있다. 제1 구조물이 개방 상태에 이르면, 제1 탄성 부재는 제2 플레이트(221a)의 가장자리 내측면에 접촉할 수 있다. 예컨대, 개방 상태에서, 제1 탄성 부재는 제2 플레이트(221a)의 가장자리 내측면과 플렉서블 디스플레이 표면 사이의 간격을 밀봉할 수 있다. 다른 실시예에서, 폐쇄 상태에서 개방 상태로 이동할 때, 제1 탄성 부재는 제2 플레이트(221a)와 접 촉하면서 이동(예: 미끄럼 접촉)할 수 있다. 예를 들어, 폐쇄 상태에서 제2 영역(A2)과 제2 플레이트(221a) 사 이의 간격으로 이물질이 유입된 상태라면, 개방 상태로 이동할 때, 제1 탄성 부재가 이물질을 제2 구조물 의 외부로 배출시킬 수 있다. 다양한 실시예에 따르면, 제2 탄성 부재는 제2 플레이트(221a)의 가장자리에서 내측면에 부착될 수 있으며, 실질적으로 플렉서블 디스플레이의 내측면과 마주보게 배치될 수 있다. 폐쇄 상태에서, 플렉서블 디스플레이의 표면과 제2 플레이트(221a)의 가장자리 내측면 사이의 간격(예: 배치 간격)은 실질적으로 제 2 탄성 부재에 의해 결정될 수 있다. 한 실시예에 따르면, 폐쇄 상태에서, 제2 탄성 부재는 플렉서블 디스플레이 표면에 접촉함으로써, 실질적으로 배치 간격(G)을 밀봉할 수 있다. 한 실시예에 따르면, 제2 탄성 부재는 스펀지와 같은 저밀도 탄성체 또는 브러쉬로 제작되어 플렉서블 디스플레이와 직접 접촉 하더라도 플렉서블 디스플레이의 표면을 손상시키지 않을 수 있다. 다른 실시예에서, 제1 구조물이 점차 개방 상태로 이동함에 따라 배치 간격(G)이 증가할 수 있다. 예컨대, 플렉서블 디스플레이는 실질적 으로 제2 탄성 부재와 접촉 또는 마찰하지 않으면서, 제2 영역(A2)을 제2 구조물의 외부로 점차 노출 시킬 수 있다. 제1 구조물이 개방 상태에 이르면, 제1 탄성 부재가 제2 탄성 부재와 접촉할 수 있다. 예컨대, 개방 상태에서는 제1 탄성 부재와 제2 탄성 부재가 배치 간격(G)을 밀봉함으로써 외부 이물질의 유입을 차단할 수 있다. 다양한 실시예에 따르면, 전자 장치는 가이드 레일(들) 및/또는 구동 부재(actuating member) (들)를 더 포함할 수 있다. 가이드 레일(들)은 제2 구조물, 예를 들어, 제3 플레이트(221c)에 장착되 어 제1 구조물(예: 제1 플레이트(211a) 또는 슬라이드 플레이트)의 슬라이드 이동을 안내할 수 있다. 구동 부재(들)는 그의 양단을 서로 멀어지게 하는 방향으로 탄성력을 제공하는 스프링 또는 스프링 모듈을 포함 할 수 있다. 구동 부재(들)의 한 단은 제2 구조물에 회동 가능하게 지지되고, 다른 한 단은 제1 구조 물에 회동 가능하게 지지될 수 있다. 제1 구조물이 슬라이드 이동할 때, 폐쇄 상태와 개방 상태 사이 의 어느 한 지점에서 구동 부재(들)의 양단이 가장 근접하게 위치(이하, '최근접점')할 수 있다. 예컨대, 최근접점과 폐쇄 상태 사이의 구간에서 구동 부재(들)는 폐쇄 상태를 향해 이동하는 방향으로 제1 구조물 에 탄성력을 제공하고, 최근접점과 개방 상태 사이의 구간에서 구동 부재(들)는 개방 상태를 향해 이 동하는 방향으로 제1 구조물에 탄성력을 제공할 수 있다.이하의 상세한 설명에서는, 선행 실시예를 통해 용이하게 이해할 수 있는 구성에 관해 도면의 참조번호를 동일 하게 부여하거나 생략하고, 그 상세한 설명 또한 생략될 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치(예: 도 1 내지 도 2c의 전자 장치)는 서로 다른 실시예의 구성이 선택적으로 조합되어 구현될 수 있 으며, 한 실시예의 구성이 다른 실시예의 구성에 의해 대체될 수 있다. 예컨대, 본 발명이 특정한 도면이나 실 시예에 한정되지 않음에 유의한다. 도 3a는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 도시한다. 일 실시 예에 따르면, 전자 장치(예: 도 2a의 전자 장치)는 프로세서, 메모리, 제1 하우징 , 제2 하우징, 플렉서블 디스플레이, 및/또는 적어도 하나의 센서를 포함할 수 있다. 일 실시예에 따르면, 프로세서, 메모리, 플렉서블 디스플레이, 또는 적어도 하나의 센서는 도 1의 프로세서, 메모리, 디스플레이 모듈, 또는 센서 모듈에 각각 대응할 수 있다. 일 실시예에 따르면, 제1 하우징(예: 도 2a의 제1 구조물) 및 제2 하우징(예: 도 2a의 제2 구조 물)은 전자 장치의 외관을 형성할 수 있다. 전자 장치에 포함된 구성 요소들(예: 메모리, 플렉서블 디스플레이, 적어도 하나의 센서)은 제1 하우징 및 제2 하우징에 의해 형성된 공 간에 배치될 수 있다. 일 실시예에 따르면, 제2 하우징은 제1 하우징 및 플렉서블 디스플레이의 일부를 수용하는 고정 커버 역할을 할 수 있다. 일 실시예에 따르면, 제1 하우징은 플렉서블 디스플레이의 일측이 고정되는 슬라이딩 커버 역할을 할 수 있다. 일 실시예에 따르면, 전자 장치는 슬라이딩 동작하는 제1 하우징, 제1 하우징과 체결되며 적어 도 하나의 개구부가 형성된 제2 하우징, 제1 하우징의 슬라이딩 동작에 대응하여 노출 영역의 크기가 변경되는 플렉서블 디스플레이, 적어도 하나의 센서, 프로세서, 및 플렉서블 디스플레이, 적어도 하나의 센서, 및 프로세서와 작동적으로 연결되고, 인스트럭션들을 저장하는 메모리를 포함할 수 있다. 인스트럭션들은, 프로세서에 의해 실행될 때, 전자 장치가, 적어도 하나의 센서 를 이용하여 적어도 하나의 개구부(예: 도 3b의 적어도 하나의 개구부 참조)를 통하여 전자 장치 의 외부로 시각적으로 노출되는 플렉서블 디스플레이의 제1 영역(예: 도 3b의 제3 영역 참조)을 식별하고, 제1 영역을 활성화하고, 적어도 하나의 개구부에 대한 제1 사용자 입력을 수신하여 기설정된 기능을 실행하도록 구성될 수 있다. 일 실시예에 따르면, 인스트럭션들은, 프로세서에 의해 실행될 때, 전자 장치 가, 적어도 하나의 센서를 이용하여 전자 장치의 형태 변화를 감지하고, 적어도 하나의 개구부 를 통하여 전자 장치의 외부로 시각적으로 노출되는 플렉서블 디스플레이의 제2 영역(예: 도 3b의 제 4 영역 참조)을 식별하고, 제2 영역을 활성화하고, 적어도 하나의 개구부에 대한 제2 사용자 입력을 수신 하여 기설정된 기능을 실행하도록 구성될 수 있다. 일 실시예에 따르면, 인스트럭션들은, 프로세서에 의해 실행될 때, 전자 장치가, 적어도 하나의 센서 를 이용하여 전자 장치의 형태 변화에 따른 플렉서블 디스플레이의 이동량을 식별하고, 플렉서 블 디스플레이의 이동량에 기반하여 제2 영역을 식별하도록 구성될 수 있다. 일 실시예에 따르면, 적어도 하나의 개구부는 제1 개구부 및 제2 개구부를 포함하고, 제1 영역은 제1 개구부에 대응되는 제3 영역(예: 도 3b의 복수의 영역들) 및 제2 개구부에 대응되는 제4 영역(예: 도 3b의 복수의 영역들)을 포함하고, 인스트럭션들은, 프로세서에 의해 실행될 때, 전자 장치가, 제3 영역 및 제4 영 역에 서로 다른 기능을 매핑하도록 구성될 수 있다. 일 실시예에 따르면, 제1 개구부 및 제2 개구부는 격벽에 의해 이격될 수 있다. 일 실시예에 따르면, 기설정된 기능은 볼륨 조절 기능, 전원 제어 기능, 또는 인공 지능 소프트웨어 호출 기능 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 인스트럭션들은, 프로세서에 의해 실행될 때, 전 자 장치가, 제1 영역을 통하여 알림(notification)을 표시하도록 구성될 수 있다. 예를 들어, 알림은 전자 장치의 배터리 잔량, 메시지 수신, 또는 부재 중 전화 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 인스트럭션들은, 프로세서에 의해 실행될 때, 전자 장치가, 제1 사용자 입력에 응답하여 피드백(feedback)을 제공하도록 구성될 수 있다. 도 3b는 본 개시의 일 실시 예에 따른 전자 장치의 단면을 도시한다. 도 3b를 참조하면, 제1 하우징은 제2 하우징을 기준으로 제1 방향(예: +X 축 방향)으로 이동되거나 제2 방향(예: 상기 제1 방향과 반대되는 -X 축 방향)으로 이동될 수 있다. 전자 장치는 제1 하우징의 이동에 따라 폐쇄된 상태(350a)(예: 도 2a의 폐쇄된 상태) 또는 개방된 상태(350b)(예: 도 2a의 개방된 상태)를 가질 수 있다. 폐쇄된 상태(350a)에서, 전자 장치의 크기는 최소 크기일 수 있다. 플렉서블 디스플레이는 제1-1 영 역 및 제1-2 영역으로 구분될 수 있다. 제1-1 영역은 플렉서블 디스플레이 중 전자 장치 의 전면(예: +Z 축 방향)에 노출된 영역일 수 있다. 개방된 상태(350b)에서, 전자 장치의 크기는 최대 크기일 수 있다. 플렉서블 디스플레이는 제2-1 영 역 및 2-2 영역으로 구분될 수 있다. 제2-1 영역은 플렉서블 디스플레이 중 전자 장치 의 전면(예: +Z 축 방향)에 노출된 영역일 수 있다. 일 실시예에 따르면, 제2 하우징에는 적어도 하 나의 개구부가 형성될 수 있다. 예를 들어, 적어도 하나의 개구부는 롤러(예: 도 2c의 롤러)와 지정된 거리 이내에 형성될 수 있다. 다른 예를 들어, 적어도 하나의 개구부는 전자 장치의 측면(-X 축 방향)에 형성될 수 있다. 일 실시예에 따르면, 적어도 하나의 개구부에는 개구부를 통해 노출되는 플렉서블 디스플레이를 보호하면서 화면의 시인성을 강화하기 위하여 투명한 강화 글라스 또는 강화 플라스틱 커버가 덮일 수 있다. 폐쇄된 상태(350a) 및 개방된 상태(350b)를 참조하면, 제1-2 영역 및 제2-2 영역의 적어도 일부는 제 1 하우징 및 제2 하우징 중 적어도 하나의 내측에 감겨져 배치되거나 또는 펼쳐져 배치될 수 있다. 예를 들어, 제1-2 영역 및 제2-2 영역의 적어도 일부는 롤러을 따라 휘어져 배치될 수 있다. 일 실시예에 따르면, 폐쇄된 상태(350a)에서, 제1-2 영역의 적어도 일부인 제3 영역은 제2 하우징 의 개구부를 통해 시각적으로 노출될 수 있다. 개방된 상태(350b)에서, 제2-2 영역의 적어도 일 부인 제4 영역은 제2 하우징의 개구부를 통해 시각적으로 노출될 수 있다. 폐쇄된 상태(350a)와 개방된 상태(350b)에서, 플렉서블 디스플레이 중 제2 하우징의 개구부를 통해 시각적으로 노출 되는 영역의 위치는 상이할 수 있다. 일 실시예에 따르면, 적어도 하나의 개구부가 복수인 경우, 제3 영역 및 제4 영역은 복수의 개구부 각각을 통해 시각적으로 노출되는 복수의 영역을 포함할 수 있다. 일 실시예에 따르면, 제1-1 영역 및 제2-1 영역은 활성화 상태로 동작할 수 있다. 일 실시예에 따르면, 제1-1 영역 및 제2-1 영역은 사용자 입력에 기반하여 턴 온(turn-on)/턴 오프(turn-off)되거나, AoD(always on display) 모드로 동작할 수 있다. 일 실시예에 따르면, 제1-2 영역 및 제2-2 영역은 비활성화 상태로 동작할 수 있다. 일 실시예에 따르면, 제1-2 영역 및 제2-2 영역은 턴 오프되거나, 저전력 모드로 동작할 수 있다. 일 실시예에 따르면, 프로세서는 플렉서블 디스플레이 상에서 제3 영역 또는 제4 영역의 위치를 식별할 수 있다. 프로세서는 적어도 하나의 센서를 통해 식별되는 제1 하우징 및 제2 하 우징 간의 겹쳐진 정도에 기반하여 제3 영역 또는 제4 영역의 위치를 식별할 수 있다. 프로세서 는 적어도 하나의 센서를 통해 식별되는 제2 하우징이 제1 하우징을 기준으로 이동한 정도 에 기반하여 제3 영역 또는 제4 영역의 위치를 식별할 수 있다. 프로세서는 적어도 하나의 센서 를 통해 식별되는 롤러의 회전 정도에 기반하여 제3 영역 또는 제4 영역의 위치를 식별할 수 있다. 일 실시예에 따르면, 프로세서는 제3 영역 또는 제4 영역을 식별하고, 식별된 제3 영역 또 는 제4 영역을 활성화할 수 있다. 일 실시예에 따르면, 프로세서는 제3 영역 또는 제4 영역 의 터치 센서, 픽셀, 또는 이들의 조합을 활성화할 수 있다. 일 실시예에 따르면, 프로세서는 제3 영역 또는 제4 영역의 픽셀을 통해 사용자 인터페이스(UI, user interface)를 표시할 수 있다. 일 실시예에 따르면, 프로세서는 적어도 하나의 개구부에 대한 사용자 입력을 수신할 수 있다. 적어 도 하나의 개구부에 대한 사용자 입력은 제3 영역 또는 제4 영역을 통해 식별될 수 있다. 예를 들어, 프로세서는 제3 영역 또는 제4 영역의 활성화된 터치 센서를 이용하여 사용자 입력을 전 기적 신호로 획득할 수 있다. 획득된 전기적 신호는 터치 입력 또는 호버링 입력에 관한 정보(예: 위치, 면적, 압력, 또는 시간)를 포함할 수 있다. 일 실시예에 따르면, 프로세서는 사용자 입력에 대응하는 기능을 제공할 수 있다. 예를 들어, 사용자 입력 은 터치 입력, 또는 롱-터치 입력을 포함할 수 있다. 프로세서는 사용자 입력이 인가되는 시간에 따라 서로 다른 기능을 실행할 수 있다. 다른 예를 들어, 사용자 입력은 제스처 입력일 수 있다. 사용자가 제3 영역 또는 제4 영역 상에서 특정 동작을 수행하는 경우, 프로세서는 적어도 하나의 센서를 이 용하여 사용자의 제스처를 인식할 수 있다. 일 실시예에 따르면, 사용자 입력에 대응하는 기능은 알림 표시, 볼 륨 조절, 전원 제어, 인공지능 소프트웨어 호출, 또는 이들의 조합을 포함할 수 있다. 일 실시예에 따르면, 제3 영역 또는 제4 영역이 복수의 영역을 포함하는 경우, 프로세서는 각 영역에 대한 사용자 입력을 식별할 수 있다. 프로세서는 각 영역에 대한 사용자 입력에 대응하는 기능을 제공할 수 있다. 프로세서는 각 영역에 대하여 서로 다른 기능을 매핑할 수 있다. 도 3b에 도시된 전자 장치의 형태(폐쇄된 상태(350a), 개방된 상태(350b))는 예시적인 것으로, 전자 장치 의 형태는 슬라이딩 정도에 따라 폐쇄된 상태(350a)와 개방된 상태(350b)의 중간 상태일 수 있다. 프로세 서는 전자 장치가 중간 상태인 경우, 제1 하우징이 제2 하우징을 기준으로 하여 이동한 정 도에 따라 플렉서블 디스플레이 중 제2 하우징의 개구부를 통해 시각적으로 노출되는 영역을 식 별할 수 있다. 이 때, 제2 하우징의 개구부를 통해 시각적으로 노출되는 영역은 제3 영역과 제4 영역 사이에 위치하는 영역일 수 있다. 도 4는 다양한 방향으로 확장 또는 축소되는 전자 장치를 도시한다. 다양한 실시 예들에 따르면, 전자 장치(200a, 200b, 200c, 200d)(예: 도 3a의 전자 장치)는 제1 하우징 (예: 도 3a의 제1 하우징)의 슬라이딩 동작에 따라 형태가 변할 수 있다. 예를 들어, 전자 장치(200a, 200b, 200c, 200d)는 제1 하우징의 슬라이딩 방향으로 확장되거나, 또는 축소될 수 있다. 일 실시예에 따 르면, 제1 하우징이 슬라이딩하는 경우, 플렉서블 디스플레이는 롤러(예: 도 2c의 롤러)의 회전 방향에 따라 이동할 수 있다. 롤러는 전자 장치(200a, 200b, 200c, 200d)의 일 측에 구비될 수 있다. 예를 들어, 플렉서블 디스플레이는 일 측으로 말려들어가거나, 일 측으로부터 펼쳐질 수 있다. 일 실시예에 따르면, 전자 장치(200a)의 제1 하우징은 X 축을 따라 슬라이딩될 수 있다. 전자 장치(200a) 의 폐쇄된 상태는 제1 하우징이 -X 축 방향으로 슬라이딩되어 전자 장치(200a)가 최소 크기로 축소된 형태를 도시한 것이다. 일 실시예에 따르면, 전자 장치(200a)가 폐쇄된 상태를 가질 경우, 플렉서블 디스 플레이(예: 도 3a의 플렉서블 디스플레이) 중 전자 장치의 전면(+Z 축 방향)에 시각적으로 노출되는 영역(이하, 노출 영역)의 크기는 최소일 수 있다. 전자 장치(200a)의 개방된 상태는 제1 하우징이 +X 축 방향으로 슬라이딩되어 전자 장치(200a)가 최대 크기로 확장된 형태를 도시한 것이다. 일 실시예에 따르면, 전자 장치(200a)가 개방된 상태를 가질 경우, 노출 영역의 크기는 최대일 수 있다. 일 실시예에 따르면, 전자 장치(200b)의 제1 하우징은 X 축을 따라 슬라이딩될 수 있다. 전자 장치(200b) 의 폐쇄된 상태는 제1 하우징이 +X 축 방향으로 슬라이딩되어 전자 장치(200b)가 최소 크기로 축소된 형태를 도시한 것이다. 일 실시예에 따르면, 전자 장치(200b)가 폐쇄된 상태를 가질 경우, 노출 영역의 크 기는 최소일 수 있다. 전자 장치(200b)의 개방된 상태는 제1 하우징이 -X 축 방향으로 슬라이딩되어 전자 장치(200b)가 최대 크기로 확장된 형태를 도시한 것이다. 일 실시예에 따르면, 전자 장치(200b)가 개방된 상태를 가질 경우, 노출 영역의 크기는 최대일 수 있다. 일 실시예에 따르면, 전자 장치(200c)의 제1 하우징은 Y 축을 따라 슬라이딩될 수 있다. 전자 장치(200c) 의 폐쇄된 상태는 제1 하우징이 -Y 축 방향으로 슬라이딩되어 전자 장치(200c)가 최소 크기로 축소된 형태를 도시한 것이다. 일 실시예에 따르면, 전자 장치(200c)가 폐쇄된 상태를 가질 경우, 노출 영역의 크 기는 최소일 수 있다. 전자 장치(200c)의 개방된 상태는 제1 하우징이 +Y 축 방향으로 슬라이딩되어 전자 장치(200c)가 최대 크기로 확장된 형태를 도시한 것이다. 일 실시예에 따르면, 전자 장치(200c)가 개방된 상태를 가질 경우, 노출 영역의 크기는 최대일 수 있다. 일 실시예에 따르면, 전자 장치(200d)의 제1 하우징은 Y 축을 따라 슬라이딩될 수 있다. 전자 장치(200d) 의 폐쇄된 상태는 제1 하우징이 +Y 축 방향으로 슬라이딩되어 전자 장치(200d)가 최소 크기로 축소된 형태를 도시한 것이다. 일 실시예에 따르면, 전자 장치(200d)가 폐쇄된 상태를 가질 경우, 노출 영역의 크 기는 최소일 수 있다. 전자 장치(200d)의 개방된 상태는 제1 하우징이 -Y 축 방향으로 슬라이딩되어 전자 장치(200d)가 최대 크기로 확장된 형태를 도시한 것이다. 일 실시예에 따르면, 전자 장치(200d)가 개방된 상태를 가질 경우, 노출 영역의 크기는 최대일 수 있다. 도 4에서는 전자 장치(200a, 200b, 200c, 200d)의 형태가 최소 크기인 경우 및 최대 크기인 경우를 도시하였으 나, 전자 장치(200a, 200b, 200c, 200d)는 슬라이딩 정도에 따라 폐쇄된 상태(410, 420, 430, 440)와 개방된 상태(415, 425, 435, 445) 사이의 중간 형태를 가질 수 있다. 도 4에 도시된 전자 장치(200a, 200b, 200c, 200d)의 형태 변화는 예시일 뿐, 본 문서의 실시예들이 이에 제한 되는 것은 아니다. 일 실시예에 따르면, 전자 장치는 적어도 두 개의 방향(예: +X 축 및 -X 축, 또는 +Y 축 및 -Y 축) 방향으로 확장되거나 축소될 수 있다. 도 5는 일 실시 예에 따른 전자 장치의 동작을 설명한다. 동작 510에서, 프로세서는 적어도 하나의 개구부(예: 도 3b의 적어도 하나의 개구부)를 통하여 전자 장치(예: 도 3a의 전자 장치)의 외부에 시각적으로 노출되는 플렉서블 디스플레이의 제1 영역(예: 도 3b의 제3 영역)을 식별할 수 있다. 일 실시예에 따르면, 적어도 하나의 개구부는 제2 하우징 에 형성 될 수 있다. 일 실시예에 따르면, 적어도 하나의 개구부는 전자 장치의 측면(예: 도 4의 -X 축 방향)에 형 성될 수 있다. 동작 520에서, 프로세서는 제1 영역을 활성화할 수 있다. 일 실시예에 따르면, 프로세서는 제1 영역 의 터치 센서, 픽셀, 또는 이들의 조합을 활성화할 수 있다. 동작 530에서, 프로세서는 적어도 하나의 개구부에 대한 사용자 입력을 수신하여 기설정된 기능을 실행할 수 있다. 적어도 하나의 개구부에 대한 사용자 입력은 제1 영역에 대한 사용자 입력으로도 이해될 수 있다. 일 실시예에 따르면, 수신된 사용자 입력은 제1 영역의 활성화된 터치 센서를 통해 전기적 신호로 획득될 수 있다. 획득된 전기적 신호는 터치 입력 또는 호버링 입력에 관한 정보(예: 위치, 면적, 압력, 또는 시간)를 포함할 수 있다. 일 실시예에 따르면, 기설정된 기능은 알림 표시, 볼륨 조절, 전원 제어, 인공지능 소프트웨어 호출, 또는 이들 의 조합을 포함할 수 있다. 일 실시예에 따르면, 적어도 하나의 개구부가 복수인 경우, 제1 영역은 복수의 개구부 각각을 통해 시각적으로 노출되는 복수의 영역을 포함할 수 있다. 프로세서는 복수의 영역 각각에 대한 사용자 입력을 식별하고 식 별된 사용자 입력에 대응하는 기능을 제공할 수 있다. 이 경우, 프로세서는 복수의 영역 각각에 대하여 서 로 다른 기능을 매핑할 수 있다. 예를 들어, 프로세서는 복수의 영역 중 일 영역에 대한 사용자 입력을 식 별하여 전자 장치의 볼륨을 증가시키고, 복수의 영역 중 일 영역에 대한 사용자 입력을 수신하여 전자 장 치의 볼륨을 감소시킬 수 있다. 동작 540에서, 프로세서는 전자 장치의 형태 변화를 감지할 수 있다. 일 실시예에 따르면, 프로세서 는 적어도 하나의 센서를 이용하여 제1 하우징(예: 도 3a의 제1 하우징)의 슬라이딩 동작 을 감지할 수 있다. 일 실시예에 따르면, 프로세서는 적어도 하나의 센서를 이용하여 제1 하우징 의 슬라이딩 동작에 따른 플렉서블 디스플레이의 이동을 감지할 수 있다. 동작 550에서, 프로세서는 적어도 하나의 개구부를 통하여 전자 장치의 외부에 시각적으로 노출되는 플렉서블 디스플레이의 제2 영역(예: 도 3b의 제4 영역)을 식별할 수 있다. 일 실시예에 따르면, 프 로세서는 적어도 하나의 센서를 통해 식별되는 제1 하우징 및 제2 하우징 간의 겹쳐진 정 도에 기반하여 제2 영역의 위치를 식별할 수 있다. 프로세서는 적어도 하나의 센서를 통해 식별되는 제1 하우징이 제2 하우징을 기준으로 이동한 정도에 기반하여 제2 영역의 위치를 식별할 수 있다. 프 로세서는 적어도 하나의 센서를 통해 식별되는 롤러(예: 도 2c의 롤러)의 회전 정도에 기반하여 제2 영역의 위치를 식별할 수 있다. 동작 560에서, 프로세서는 제2 영역을 활성화할 수 있다. 제2 영역은 제1 영역과 다른 영역일 수 있다. 일 실시예에 따르면, 프로세서는 제2 영역의 터치 센서, 픽셀, 또는 이들의 조합을 활성화할 수 있다. 동작 570에서, 프로세서는 적어도 하나의 개구부에 대한 사용자 입력을 수신하여 기설정된 기능을 실행할 수 있다. 동작 570에서 실행되는 기설정된 기능은 동작 530에서 실행되는 기설정된 기능과 동일할 수 있다. 도 6은 일 실시예에 따른 전자 장치의 측면을 도시한 것이다. 참조 번호 600a 및 600b의 전자 장치(예: 도 3a의 전자 장치)는 도 3b의 전자 장치의 측면(-X 축 방 향)을 도시한 것이다. 참조 번호 600a는 전자 장치의 개구부가 하나인 경우를 도시한다. 참조 번호 600b는전자 장치의 개구부가 복수인 경우를 도시한다. 일 실시예에 따르면, 참조 번호 600a에서, 전자 장치의 측면에는 개구부가 형성될 수 있다. 프로세서 (예: 도 3a의 프로세서)는 개구부를 통하여 기설정된 기능을 제공할 수 있다. 예를 들어, 프로세서 는 개구부를 통하여 알림(notification)을 제공할 수 있다. 알림은 개구부에 대응하는 플렉서블 디스플레이(예: 도 3a의 플렉서블 디스플레이)의 일 영역(예: 도 5의 제1 영역 또는 제2 영역)에 표시될 수 있다. 알림은 예를 들어, 배터리 잔량, 메시지 수신, 및/또는 부재 중 전화와 관련된 정보를 포함할 수 있다. 알림에 대한 설명은 예시적인 것으로, 프로세서는 개구부를 통하여 추가적인 알림을 더 표시할 수 있다. 일 실시예에 따르면, 참조 번호 600b에서, 전자 장치의 측면에는 복수의 개구부가 형성될 수 있다. 복수의 개구부는 제1 개구부, 제2 개구부, 제3 개구부를 포함할 수 있다. 프로세서는 복수의 개구 부를 통하여 기설정된 기능을 제공할 수 있다. 복수의 개구부는 각각 상이한 기능을 제공할 수 있다. 예를 들어, 프로세서는 제1 개구부에 대한 사용자 입력을 수신하여 전자 장치의 볼륨을 증가시킬 수 있다. 예를 들어, 프로세서는 제2 개구부에 대한 사용자 입력을 수신하여 전자 장치의 볼륨을 감소시킬 수 있다. 예를 들어, 프로세서는 제3 개구부에 대한 사용자 입력을 수신하여 메모리(예: 도 3a의 메모리)에 저장된 인공지능 소프트웨어를 호출할 수 있다. 기설정된 기능에 대한 설명은 예시적인 것으로, 프로세서는 복수의 개구부를 통하여 추가적인 기능을 제공할 수 있다. 예를 들어, 프로세서는 제3 개구부에 대한 사용자 입력을 수신하여 전원 제어와 관련된 기능을 제공할 수 있다. 도 6의 기설정된 기능에 대한 설명은 예시적인 것으로 본 문서의 실시예가 이에 제한되는 것은 아니다. 일 실시 예에 따르면, 참조 번호 600a의 전자 장치도 개구부에 대한 사용자 입력을 수신하여 전원 제어와 관 련된 기능을 제공할 수 있다. 일 실시예에 따르면, 참조 번호 600b의 전자 장치도 제1 개구부, 제2 개구부, 및/또는 제3 개구부를 통하여 알림을 제공할 수 있다. 일 실시예에 따르면, 제1 개구부 및 제2 개구부 사이 또는 제2 개구부 및/또는 제3 개구부 사이에는 격벽(예: 돌출부)이 형성될 수 있다. 사용자는 격벽을 통하여 전자 장치를 직접 보지 않고도 복수의 개구부 영역(예: 제1 개구부, 제2 개구부, 및/또는 제3 개구부)을 구분 할 수 있 다. 일 실시예에 따르면, 개구부, 제1 개구부, 제2 개구부 및/또는 제3 개구부 주변부에 돌출부가 형성될 수 있다. 예를 들어, 개구부, 제1 개구부, 제2 개구부 및/또는 제3 개구부 는 돌출부에 의해 둘러싸일(surrounded) 수 있다. 일 실시예에 따르면, 프로세서는 적어도 하나의 개구부에 대한 사용자 입력에 응답하여 피드백(feedback) 을 제공할 수 있다. 예를 들어, 프로세서는 진동 모터를 이용하여 전자 장치를 지정된 시간(예: 0.5 초)동안 진동시킬 수 있다. 도 7은 다양한 실시예들에 따른, 표시 장치의 블록도이다. 도 7를 참조하면, 표시 장치는 디스플레이(예: 도 3a의 플렉서블 디스플레이), 및 이를 제어하 기 위한 디스플레이 드라이버 IC(DDI)를 포함할 수 있다. DDI는 인터페이스 모듈, 메모리 (예: 버퍼 메모리), 이미지 처리 모듈, 또는 맵핑 모듈을 포함할 수 있다. DDI은, 예를 들면, 영상 데이터, 또는 상기 영상 데이터를 제어하기 위한 명령에 대응하는 영상 제어 신호를 포함하는 영상 정보를 인터페이스 모듈을 통해 전자 장치(예: 도 3a의 전자 장치)의 다른 구성요소로부터 수신할 수 있다. 예를 들면, 일실시예에 따르면, 영상 정보는 프로세서(예: 메인 프로세서(예: 어플리케이션 프로세서) 또는 메인 프로세서의 기능과 독립적으로 운영되는 보조 프로세서(예: 그래픽 처리 장치) 로부터 수신될 수 있다. DDI는 터치 회로 또는 센서 모듈(예: 도 3a의 적어도 하나의 센서 ) 등과 상기 인터페이스 모듈을 통하여 커뮤니케이션할 수 있다. 또한, DDI는 상기 수신된 영상 정보 중 적어도 일부를 메모리에, 예를 들면, 프레임 단위로 저장할 수 있다. 이미지 처리 모듈은, 예를 들면, 상기 영상 데이터의 적어도 일부를 상기 영상 데이터의 특성 또는 디스플레이의 특성에 적어도 기반하여 전처리 또는 후처리(예: 해상도, 밝기, 또는 크기 조정)를 수행할 수 있다. 맵핑 모듈은 이미지 처리 모듈를 통해 전처리 또는 후처리된 상기 영상 데이터에 대응하는 전압 값 또는 전류 값을 생성할 수 있다. 일실시예에 따르면, 전압 값 또는 전류 값의 생성은 예를 들면, 디스플레이의 픽셀들의 속성(예: 픽 셀들의 배열(RGB stripe 또는 pentile 구조), 또는 서브 픽셀들 각각의 크기)에 적어도 일부 기반하여 수행될수 있다. 디스플레이의 적어도 일부 픽셀들은, 예를 들면, 상기 전압 값 또는 전류 값에 적어도 일부 기반 하여 구동됨으로써 상기 영상 데이터에 대응하는 시각적 정보(예: 텍스트, 이미지, 또는 아이콘)가 디스플레이 를 통해 표시될 수 있다. 일실시예에 따르면, 표시 장치는 터치 회로를 더 포함할 수 있다. 터치 회로는 터치 센서 및 이를 제어하기 위한 터치 센서 IC를 포함할 수 있다. 터치 센서 IC는, 예를 들면, 디스플레이 의 특정 위치에 대한 터치 입력 또는 호버링 입력을 감지하기 위해 터치 센서를 제어할 수 있다. 예 를 들면, 터치 센서 IC는 디스플레이의 특정 위치에 대한 신호(예: 전압, 광량, 저항, 또는 전하량) 의 변화를 측정함으로써 터치 입력 또는 호버링 입력을 감지할 수 있다. 터치 센서 IC는 감지된 터치 입력 또는 호버링 입력에 관한 정보(예: 위치, 면적, 압력, 또는 시간)를 프로세서 에 제공할 수 있다. 일실시 예에 따르면, 터치 회로의 적어도 일부(예: 터치 센서 IC)는 디스플레이 드라이버 IC, 또는 디 스플레이의 일부로, 또는 표시 장치의 외부에 배치된 다른 구성요소(예: 보조 프로세서)의 일부 로 포함될 수 있다. 일실시예에 따르면, 표시 장치는 센서 모듈의 적어도 하나의 센서(예: 지문 센서, 홍채 센서, 압력 센서 또는 조도 센서), 또는 이에 대한 제어 회로를 더 포함할 수 있다. 이 경우, 상기 적어도 하나의 센서 또 는 이에 대한 제어 회로는 표시 장치의 일부(예: 디스플레이 또는 DDI) 또는 터치 회로의 일부에 임베디드될 수 있다. 예를 들면, 표시 장치에 임베디드된 센서 모듈이 생체 센서(예: 지문 센 서)를 포함할 경우, 상기 생체 센서는 디스플레이의 일부 영역을 통해 터치 입력과 연관된 생체 정보(예: 지문 이미지)를 획득할 수 있다. 다른 예를 들면, 표시 장치에 임베디드된 센서 모듈이 압력 센서를 포함할 경우, 상기 압력 센서는 디스플레이의 일부 또는 전체 영역을 통해 터치 입력과 연관된 압력 정보 를 획득할 수 있다. 일실시예에 따르면, 터치 센서 또는 센서 모듈은 디스플레이의 픽셀 레이어 의 픽셀들 사이에, 또는 상기 픽셀 레이어의 위에 또는 아래에 배치될 수 있다.도면 도면1 도면2a 도면2b 도면2c 도면3a 도면3b 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2020-0173082", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시 예들에 따른, 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2a는 본 문서에 개시된 다양한 실시예에 따른 전자 장치를 도시한다. 도 2b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치를 도시한다. 도 2c는 본 문서에 개시된 다양한 실시예에 따른 전자 장치를 나타내는 분리 사시도이다. 도 3a는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 도시한다. 도 3b는 본 개시의 일 실시 예에 따른 전자 장치의 단면을 도시한다. 도 4는 다양한 방향으로 확장 또는 축소되는 전자 장치를 도시한다. 도 5는 일 실시 예에 따른 전자 장치의 동작을 설명한다. 도 6은 일 실시예에 따른 전자 장치의 측면을 도시한 것이다. 도 7는 다양한 실시예들에 따른, 표시 장치의 블록도이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
