{"patent_id": "10-2020-0158173", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0071011", "출원번호": "10-2020-0158173", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "이현승"}}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,복수의 신경망 모델이 저장된 메모리; 및상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서;를 포함하고,상기 프로세서는,입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득하고,상기 입력 이미지를 상기 복수의 신경망 모델 각각에 입력하여 복수의 이미지를 획득하고,상기 가중치 맵에 기초하여 상기 복수의 이미지를 가중합하여 출력 이미지를 획득하며,상기 복수의 신경망 모델 각각은,이미지를 업스케일링하도록 학습된 모델인, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 신경망 모델은, 제1 신경망 모델 및 제2 신경망 모델을 포함하고,상기 프로세서는,상기 입력 이미지를 상기 제1 신경망 모델에 입력하여 제1 이미지를 획득하고,상기 입력 이미지를 상기 제2 신경망 모델에 입력하여 제2 이미지를 획득하며,상기 제1 이미지 및 상기 제2 이미지를 상기 가중치 맵에 기초하여 가중합하여 상기 출력 이미지를 획득하고,상기 제1 신경망 모델은, 상기 객체 영역의 업스케일링 처리가 강화된 모델이고,상기 제2 신경망 모델은, 배경 영역의 업스케일링 처리가 강화된 모델인, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는,상기 제1 이미지에 포함된 객체 영역에 상기 제2 이미지에 포함된 객체 영역보다 높은 가중치를 부여하고, 상기제1 이미지에 포함된 배경 영역에 상기 제2 이미지에 포함된 배경 영역보다 낮은 가중치를 부여하여 상기 제1이미지 및 상기 제2 이미지를 가중합하는, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는,상기 입력 이미지로부터 상기 객체 영역을 식별하고,상기 객체 영역에 대응되는 가중치가 나머지 영역에 대응되는 가중치와 상이한 가중치 맵을 획득하는, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2022-0071011-3-제4항에 있어서,상기 프로세서는,상기 객체 영역의 중심을 기준으로 가중치가 점차 변경되는 가중치 맵을 획득하는, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서는,상기 입력 이미지가 임계 해상도이면, 상기 입력 이미지를 상기 복수의 신경망 모델 중 상기 임계 해상도에 대응되는 제1 모델들 각각에 입력하고,상기 입력 이미지가 상기 임계 해상도보다 크면 상기 입력 이미지를 전처리하고, 상기 전처리된 이미지를 상기복수의 신경망 모델 중 제2 모델들 각각에 입력하는, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는,상기 입력 이미지가 상기 임계 해상도보다 크면 상기 입력 이미지를 셔플링(shuffling)하여 복수의 서브 이미지로 구분하고,상기 복수의 서브 이미지를 상기 제2 모델들 각각에 입력하는, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 프로세서는,상기 입력 이미지가 임계 해상도이면, 상기 입력 이미지를 상기 복수의 신경망 모델 중 상기 임계 해상도에 대응되는 제1 모델들 각각에 입력하고,상기 입력 이미지가 상기 임계 해상도보다 크면 상기 입력 이미지를 샘플링하여 상기 입력 이미지를 상기 임계해상도로 변경하고, 상기 임계 해상도로 변경된 이미지를 상기 제1 모델들 각각에 입력하는, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 객체 영역은,인체 영역, 얼굴 영역, 글자 영역, 그래픽 영역, 인공물 영역 또는 자연물 영역 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치의 제어 방법에 있어서,입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득하는 단계;상기 입력 이미지를 복수의 신경망 모델 각각에 입력하여 복수의 이미지를 획득하는 단계; 및상기 가중치 맵에 기초하여 상기 복수의 이미지를 가중합하여 출력 이미지를 획득하는 단계;를 포함하며,상기 복수의 신경망 모델 각각은,이미지를 업스케일링하도록 학습된 모델인, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2022-0071011-4-제10항에 있어서,상기 복수의 신경망 모델은, 제1 신경망 모델 및 제2 신경망 모델을 포함하고,상기 복수의 이미지를 획득하는 단계는,상기 입력 이미지를 상기 제1 신경망 모델에 입력하여 제1 이미지를 획득하고,상기 입력 이미지를 상기 제2 신경망 모델에 입력하여 제2 이미지를 획득하며,상기 출력 이미지를 획득하는 단계는,상기 제1 이미지 및 상기 제2 이미지를 상기 가중치 맵에 기초하여 가중합하여 상기 출력 이미지를 획득하고,상기 제1 신경망 모델은, 상기 객체 영역의 업스케일링 처리가 강화된 모델이고,상기 제2 신경망 모델은, 배경 영역의 업스케일링 처리가 강화된 모델인, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 출력 이미지를 획득하는 단계는,상기 제1 이미지에 포함된 객체 영역에 상기 제2 이미지에 포함된 객체 영역보다 높은 가중치를 부여하고, 상기제1 이미지에 포함된 배경 영역에 상기 제2 이미지에 포함된 배경 영역보다 낮은 가중치를 부여하여 상기 제1이미지 및 상기 제2 이미지를 가중합하는, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 가중치 맵을 획득하는 단계는,상기 입력 이미지로부터 상기 객체 영역을 식별하고,상기 객체 영역에 대응되는 가중치가 나머지 영역에 대응되는 가중치와 상이한 가중치 맵을 획득하는, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 가중치 맵을 획득하는 단계는,상기 객체 영역의 중심을 기준으로 가중치가 점차 변경되는 가중치 맵을 획득하는, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서,상기 복수의 이미지를 획득하는 단계는,상기 입력 이미지가 임계 해상도이면, 상기 입력 이미지를 상기 복수의 신경망 모델 중 상기 임계 해상도에 대응되는 제1 모델들 각각에 입력하고,상기 입력 이미지가 상기 임계 해상도보다 크면 상기 입력 이미지를 전처리하고, 상기 전처리된 이미지를 상기복수의 신경망 모델 중 제2 모델들 각각에 입력하는, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제2 모델들 각각에 입력하는 단계는,상기 입력 이미지가 상기 임계 해상도보다 크면 상기 입력 이미지를 셔플링(shuffling)하여 복수의 서브 이미지공개특허 10-2022-0071011-5-로 구분하고,상기 복수의 서브 이미지를 상기 제2 모델들 각각에 입력하는, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서,상기 복수의 이미지를 획득하는 단계는,상기 입력 이미지가 임계 해상도이면, 상기 입력 이미지를 상기 복수의 신경망 모델 중 상기 임계 해상도에 대응되는 제1 모델들 각각에 입력하고,상기 입력 이미지가 상기 임계 해상도보다 크면 상기 입력 이미지를 샘플링하여 상기 입력 이미지를 상기 임계해상도로 변경하고, 상기 임계 해상도로 변경된 이미지를 상기 제1 모델들 각각에 입력하는, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서,상기 객체 영역은,인체 영역, 얼굴 영역, 글자 영역, 그래픽 영역, 인공물 영역 또는 자연물 영역 중 적어도 하나를 포함하는, 제어 방법."}
{"patent_id": "10-2020-0158173", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치의 동작 방법을 실행하기 위한 프로그램이 저장된 비일시적 컴퓨터 판독가능 기록매체에 있어서,상기 동작 방법은,입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득하는 단계;상기 입력 이미지를 복수의 신경망 모델 각각에 입력하여 복수의 이미지를 획득하는 단계; 및상기 가중치 맵에 기초하여 상기 복수의 이미지를 가중합하여 출력 이미지를 획득하는 단계;를 포함하며,상기 복수의 신경망 모델 각각은,이미지를 업스케일링하도록 학습된 모델인, 기록 매체."}
{"patent_id": "10-2020-0158173", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 본 전자 장치는 복수의 신경망 모델이 저장된 메모리 및 메모리와 연결되어 전자 장치를 제어하는 프로세서를 포함하고, 프로세서는 입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득하고, 입력 이미지를 복수의 신경망 모델 각각에 입력하여 복수의 이미지를 획득하고, 가중치 맵에 기초하여 복수의 이 미지를 가중합하여 출력 이미지를 획득하며, 복수의 신경망 모델 각각은 이미지를 업스케일링하도록 학습된 모델 일 수 있다. 본 개시는 기계 학습 알고리즘을 활용하는 인공지능(AI) 시스템 및 그 응용에 관련된 것이다."}
{"patent_id": "10-2020-0158173", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어 방법에 대한 것으로, 더욱 상세하게는 이미지를 영상 처리하는 전자 장치 및 그 제어 방법에 대한 것이다. 또한, 본 개시는 기계 학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 인공 지능 (Artificial Intelligence, AI) 시스템 및 그 응용에 관한 것이다."}
{"patent_id": "10-2020-0158173", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 시스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템으로서 기계가 스스로 학습하고 판단하며, 사용 할수록 인식률이 향상되는 시스템이다. 인공지능 기술은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘을 이용하는 기계학습(딥러닝) 기술 및 기계학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 요소 기술들로 구성된다. 요소기술들은, 예로, 인간의 언어/문자를 인식하는 언어적 이해 기술, 사물을 인간의 시각처럼 인식하는 시각적 이해 기술, 정보를 판단하여 논리적으로 추론하고 예측하는 추론/예측 기술, 인간의 경험 정보를 지식데이터로 처리하는 지식 표현 기술 및 차량의 자율 주행, 로봇의 움직임을 제어하는 동작 제어 기술 중 적어도 하나를 포 함할 수 있다.최근 다양한 형태의 학습 기반 업스케일링 방법들이 딥러닝 기술의 발전과 더불어 활발히 개발되고 있다. 학습 기반 업스케일링 방법은 학습을 통해 파라미터 값(웨이트 값)이 결정된 대용량 고복잡도의 네트워크를 사 용하여 저화질 저해상도의 영상을 고화질 고해상도의 영상으로 변형/확대(Transformation/Upscaling)한다. 여기 서 사용되는 네트워크는 다양한 구조로 설계될 수 있으며, 네트워크의 깊이, 파라미터의 수 등을 조절하여 다양 한 방식으로 구현될 수 있다. 일반적으로, 네트워크가 복잡할수록 고성능의 확보가 가능하다. 네트워크의 학습을 위해서 저해상도 영상 및 고해상도 영상이 각각 네트워크의 입력 및 출력으로서 이용된다. 여기서, 네트워크의 입력과 출력은 모두 단일 패스로 구성되어 있으며 하나의 영상에 대해서 하나의 영상을 출 력하게 된다. 이러한 방식은 기존의 신호 처리나 보간 기반 업스케일링(Bicubic, Bilinear, Lanczos)에 비해서 우수한 영상의 복원 성능을 보여준다. 다만, 단일 입력, 단일 출력의 네트워크는 복원 과정에서 다양한 객체의 특성을 고려하지 못하는 문제가 있다. 예를 들어, 다양한 객체는 사람, 글자, 그래픽 객체, 인공 물(빌딩, 조각, 자동차), 자연물(동물, 식물) 등을 포함할 수 있으며, 서로 구별되는 특징이 있다. 가령, 글자나 그래픽 객체는 윤곽이 선명하면서 강한 연결성을 가지며, 사람의 얼굴은 윤곽이 부드럽게 연결되고 눈, 코, 입과 같은 얼굴 성분이 대비를 이루며, 자연물은 잡 음 특성(Stochastic)이 강한 재질을 주로 포함한다. 이러한 다양한 객체 별 특징들은 하나의 네트워크의 학습을 통해 학습이 어려우며, 학습 데이터를 복합적으로 구성하더라도 네트워크의 학습 과정에서 객체의 개별 특징이 반영되지 못하는 문제가 있다. 결국, 전체 에러를 최소화하는 학습이 수행되고, 하나의 네트워크는 목표 영상의 평균적인 화질을 출력하게 된다. 도 1은 이러한 문제를 해결하기 위한 종래 기술로서 SFTGAN(Spatial Feature Transform GAN) 구조를 도시하였 다. SFTGAN은 입력 영상의 객체 정보를 나타내는 상태(Condition)에 따라서 네트워크의 중간 결과 값을 변화 (Transform)시킬 수 있는 구조이다. SFTGAN은 학습 과정에서 저화질/고화질 영상뿐만 아니라 영역의 상태 정보 도 함께 사용하여 네트워크가 국부(Local) 영역에 따라 적응적으로 동작할 수 있다. SFTGAN은 상태 정보의 정확도가 보장되는 경우 우수한 성능을 보인다. 다만, 상태 정보가 암묵적으로 네트워크 의 중간 결과에 영향을 주므로, 객체별 구분되는 특징을 재현하기 위해서는 추론 네트워크(상단 네트워크)와 병 렬적으로 Condition Network(하단 좌측 네트워크)의 출력이 네트워크 전반에 연결되어야 한다. 이러한 연결은 객체 별 재현에 필요한 최소 연산 및 메모리의 제한은 고려되지 않고, 하나의 네트워크에서 모든 객체에 대한 처리를 수행해야 하므로 적절한 동작을 위해서는 고용량의 네트워크를 필요로 한다. 이러한 방법은 비실시간 처리의 방대한 연산이 가능한 클라우드 시스템과 같은 환경에서는 사용 가능하지만, TV 나 모바일 장치와 같이 제한적인 환경에서는 사용하기 어렵다. 그에 따라, 리소스가 제한된 환경에서 사용할 수 있는 경량화된 모델을 이용하면서도 다양한 객체의 특성을 고 려하며 이미지를 처리할 수 있는 방법이 개발될 필요가 있다."}
{"patent_id": "10-2020-0158173", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 필요성에 따른 것으로, 본 개시의 목적은 이미지를 처리하기 위한 모델을 경량화하면서도 처 리 성능이 개선된 전자 장치 및 그 제어 방법을 제공함에 있다."}
{"patent_id": "10-2020-0158173", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이상과 같은 목적을 달성하기 위한 본 개시의 일 실시 예에 따르면, 전자 장치는 복수의 신경망 모델이 저장된 메모리 및 상기 메모리와 연결되어 상기 전자 장치를 제어하는 프로세서를 포함하고, 상기 프로세서는 입력 이 미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득하고, 상기 입력 이미지를 상기 복수의 신경망 모델 각각 에 입력하여 복수의 이미지를 획득하고, 상기 가중치 맵에 기초하여 상기 복수의 이미지를 가중합하여 출력 이 미지를 획득하며, 상기 복수의 신경망 모델 각각은 이미지를 업스케일링하도록 학습된 모델일 수 있다. 또한, 상기 복수의 신경망 모델은 제1 신경망 모델 및 제2 신경망 모델을 포함하고, 상기 프로세서는 상기 입력 이미지를 상기 제1 신경망 모델에 입력하여 제1 이미지를 획득하고, 상기 입력 이미지를 상기 제2 신경망 모델 에 입력하여 제2 이미지를 획득하며, 상기 제1 이미지 및 상기 제2 이미지를 상기 가중치 맵에 기초하여 가중합 하여 상기 출력 이미지를 획득하고, 상기 제1 신경망 모델은 상기 객체 영역의 업스케일링 처리가 강화된 모델 이고, 상기 제2 신경망 모델은 배경 영역의 업스케일링 처리가 강화된 모델일 수 있다. 그리고, 상기 프로세서는 상기 제1 이미지에 포함된 객체 영역에 상기 제2 이미지에 포함된 객체 영역보다 높은 가중치를 부여하고, 상기 제1 이미지에 포함된 배경 영역에 상기 제2 이미지에 포함된 배경 영역보다 낮은 가중 치를 부여하여 상기 제1 이미지 및 상기 제2 이미지를 가중합할 수 있다. 또한, 상기 프로세서는 상기 입력 이미지로부터 상기 객체 영역을 식별하고, 상기 객체 영역에 대응되는 가중치 가 나머지 영역에 대응되는 가중치와 상이한 가중치 맵을 획득할 수 있다. 그리고, 상기 프로세서는 상기 객체 영역의 중심을 기준으로 가중치가 점차 변경되는 가중치 맵을 획득할 수 있 다. 또한, 상기 프로세서는 상기 입력 이미지가 임계 해상도이면, 상기 입력 이미지를 상기 복수의 신경망 모델 중 상기 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 상기 입력 이미지가 상기 임계 해상도보다 크면 상 기 입력 이미지를 전처리하고, 상기 전처리된 이미지를 상기 복수의 신경망 모델 중 제2 모델들 각각에 입력할 수 있다. 그리고, 상기 프로세서는 상기 입력 이미지가 상기 임계 해상도보다 크면 상기 입력 이미지를 셔플링 (shuffling)하여 복수의 서브 이미지로 구분하고, 상기 복수의 서브 이미지를 상기 제2 모델들 각각에 입력할 수 있다. 또한, 상기 프로세서는 상기 입력 이미지가 임계 해상도이면, 상기 입력 이미지를 상기 복수의 신경망 모델 중 상기 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 상기 입력 이미지가 상기 임계 해상도보다 크면 상 기 입력 이미지를 샘플링하여 상기 입력 이미지를 상기 임계 해상도로 변경하고, 상기 임계 해상도로 변경된 이 미지를 상기 제1 모델들 각각에 입력할 수 있다. 그리고, 상기 객체 영역은 인체 영역, 얼굴 영역, 글자 영역, 그래픽 영역, 인공물 영역 또는 자연물 영역 중 적어도 하나를 포함할 수 있다. 한편, 본 개시의 일 실시 예에 따르면, 전자 장치의 제어 방법은 입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득하는 단계, 상기 입력 이미지를 복수의 신경망 모델 각각에 입력하여 복수의 이미지를 획득하 는 단계 및 상기 가중치 맵에 기초하여 상기 복수의 이미지를 가중합하여 출력 이미지를 획득하는 단계를 포함 하며, 상기 복수의 신경망 모델 각각은 이미지를 업스케일링하도록 학습된 모델일 수 있다. 또한, 상기 복수의 신경망 모델은 제1 신경망 모델 및 제2 신경망 모델을 포함하고, 상기 복수의 이미지를 획득 하는 단계는 상기 입력 이미지를 상기 제1 신경망 모델에 입력하여 제1 이미지를 획득하고, 상기 입력 이미지를 상기 제2 신경망 모델에 입력하여 제2 이미지를 획득하며, 상기 출력 이미지를 획득하는 단계는 상기 제1 이미 지 및 상기 제2 이미지를 상기 가중치 맵에 기초하여 가중합하여 상기 출력 이미지를 획득하고, 상기 제1 신경 망 모델은 상기 객체 영역의 업스케일링 처리가 강화된 모델이고, 상기 제2 신경망 모델은 배경 영역의 업스케 일링 처리가 강화된 모델일 수 있다. 또한, 상기 출력 이미지를 획득하는 단계는 상기 제1 이미지에 포함된 객체 영역에 상기 제2 이미지에 포함된 객체 영역보다 높은 가중치를 부여하고, 상기 제1 이미지에 포함된 배경 영역에 상기 제2 이미지에 포함된 배경 영역보다 낮은 가중치를 부여하여 상기 제1 이미지 및 상기 제2 이미지를 가중합할 수 있다. 그리고, 상기 가중치 맵을 획득하는 단계는 상기 입력 이미지로부터 상기 객체 영역을 식별하고, 상기 객체 영 역에 대응되는 가중치가 나머지 영역에 대응되는 가중치와 상이한 가중치 맵을 획득할 수 있다. 또한, 상기 가중치 맵을 획득하는 단계는 상기 객체 영역의 중심을 기준으로 가중치가 점차 변경되는 가중치 맵 을 획득할 수 있다. 그리고, 상기 복수의 이미지를 획득하는 단계는 상기 입력 이미지가 임계 해상도이면, 상기 입력 이미지를 상기 복수의 신경망 모델 중 상기 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 상기 입력 이미지가 상기 임 계 해상도보다 크면 상기 입력 이미지를 전처리하고, 상기 전처리된 이미지를 상기 복수의 신경망 모델 중 제2 모델들 각각에 입력할 수 있다.또한, 상기 제2 모델들 각각에 입력하는 단계는 상기 입력 이미지가 상기 임계 해상도보다 크면 상기 입력 이미 지를 셔플링(shuffling)하여 복수의 서브 이미지로 구분하고, 상기 복수의 서브 이미지를 상기 제2 모델들 각각 에 입력할 수 있다. 그리고, 상기 복수의 이미지를 획득하는 단계는 상기 입력 이미지가 임계 해상도이면, 상기 입력 이미지를 상기 복수의 신경망 모델 중 상기 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 상기 입력 이미지가 상기 임 계 해상도보다 크면 상기 입력 이미지를 샘플링하여 상기 입력 이미지를 상기 임계 해상도로 변경하고, 상기 임 계 해상도로 변경된 이미지를 상기 제1 모델들 각각에 입력할 수 있다. 또한, 상기 객체 영역은 인체 영역, 얼굴 영역, 글자 영역, 그래픽 영역, 인공물 영역 또는 자연물 영역 중 적 어도 하나를 포함할 수 있다. 한편, 본 개시의 일 실시 예에 따르면, 전자 장치의 동작 방법을 실행하기 위한 프로그램이 저장된 비일시적 컴 퓨터 판독가능 기록매체에 있어서, 상기 동작 방법은 입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득하는 단계, 상기 입력 이미지를 복수의 신경망 모델 각각에 입력하여 복수의 이미지를 획득하는 단계 및 상 기 가중치 맵에 기초하여 상기 복수의 이미지를 가중합하여 출력 이미지를 획득하는 단계를 포함하며, 상기 복 수의 신경망 모델 각각은 이미지를 업스케일링하도록 학습된 모델일 수 있다."}
{"patent_id": "10-2020-0158173", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 본 개시의 다양한 실시 예에 따르면, 전자 장치는 객체의 타입 별로 특화된 복수의 신경망 모델을 이용함에 따라 이미지 처리 성능이 향상될 수 있다. 또한, 복수의 신경망 모델은 객체의 타입 별로 특화되어 경량화가 가능함에 따라 모델의 용량을 줄일 수 있다."}
{"patent_id": "10-2020-0158173", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 명세서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공 지능 전자 장치)를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 다양한 실시 예를 보다 상세하게 설명한다. 도 2a는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블록도이다. 전자 장치는 입력 이미지를 영상 처리하는 장치로서, TV, 데스크탑 PC, 노트북, 비디오 월(video wall), LFD(large format display), Digital Signage(디지털 간판), DID(Digital Information Display), 프로젝터 디 스플레이, DVD(digital video disk) 플레이어, 스마트폰, 태블릿 PC, 모니터, 스마트 안경, 스마트 워치 등과 같이 디스플레이를 구비하고, 획득된 그래픽 이미지를 직접 디스플레이하는 장치일 수 있다. 또는, 전자 장치 는 셋탑박스(STB), 스피커, 컴퓨터 본체 등과 같이 디스플레이가 구비되지 않은 장치로서, 획득된 그래픽 이미지를 디스플레이 장치로 제공하는 장치일 수도 있다. 다만, 이에 한정되는 것은 아니며, 전자 장치는 입력 이미지를 영상 처리할 수 있는 장치라면 어떠한 장치라도 무방하다. 전자 장치는 도 2a에 도시된 바와 같이, 메모리 및 프로세서를 포함한다. 메모리는 프로세서 등이 접근할 수 있도록 데이터 등의 정보를 전기 또는 자기 형태로 저장하는 하드 웨어를 지칭할 수 있다. 이를 위해, 메모리는 비휘발성 메모리, 휘발성 메모리, 플래시 메모리(Flash Memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD), RAM, ROM 등 중에서 적어도 하나의 하드웨어로 구현될 수 있다. 메모리에는 전자 장치 또는 프로세서의 동작에 필요한 적어도 하나의 인스트럭션(instruction) 또는 모듈이 저장될 수 있다. 여기서, 인스트럭션은 전자 장치 또는 프로세서의 동작을 지시하는 부 호 단위로서, 컴퓨터가 이해할 수 있는 언어인 기계어로 작성된 것일 수 있다. 모듈은 작업 단위의 특정 작업을 수행하는 일련의 인스트럭션의 집합체(instruction set)일 수 있다. 메모리에는 문자, 수, 영상 등을 나타낼 수 있는 비트 또는 바이트 단위의 정보인 데이터가 저장될 수 있 다. 예를 들어, 메모리에는 복수의 신경망 모델이 저장될 수 있다. 복수의 신경망 모델 각각은 이미지를 업스케일링하도록 학습된 모델일 수 있다. 다만, 이에 한정되는 것은 아니며, 복수의 신경망 모델 각각은 노이 즈를 제거하기 위한 모델일 수도 있으며, 이미지를 처리하는데 이용되는 모델이라면 어떠한 것이라도 무방하다. 메모리는 프로세서에 의해 액세스되며, 프로세서에 의해 인스트럭션, 모듈 또는 데이터에 대한 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 프로세서는 전자 장치의 동작을 전반적으로 제어한다. 구체적으로, 프로세서는 전자 장치 의 각 구성과 연결되어 전자 장치의 동작을 전반적으로 제어할 수 있다. 예를 들어, 프로세서는 메모 리 등과 같은 구성과 연결되어 전자 장치의 동작을 제어할 수 있다. 일 실시 예에 따라 프로세서는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세 서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리 장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러 (controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서 (communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있 다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration) 로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 프로세서는 입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득할 수 있다. 프로세서는 입 력 이미지로부터 객체 영역을 식별하고, 객체 영역에 대응되는 가중치가 나머지 영역에 대응되는 가중치와 상이 한 가중치 맵을 획득할 수 있다. 예를 들어, 프로세서는 입력 이미지에서 얼굴 영역 등과 같은 기설정된 객체 영역을 식별하고, 식별된 객체 영역을 다른 영역과 구분되도록 가중치 맵을 생성할 수 있다.프로세서는 객체 영역의 중심을 기준으로 가중치가 점차 변경되는 가중치 맵을 획득할 수 있다. 예를 들어, 가중치 맵은 입력 이미지의 크기와 동일하고, 가중치 맵에서 객체 영역은 흰색으로 표현되고, 객체 영역 의 중심부에서 멀어질수록 어두운 색으로 표현될 수 있다. 여기서, 객체 영역은 인체 영역, 얼굴 영역, 글자 영 역, 그래픽 영역, 인공물 영역 또는 자연물 영역 중 적어도 하나를 포함할 수 있다. 다만, 이에 한정되는 것은 아니며, 프로세서는 얼마든지 다양한 형태로 가중치 맵을 획득할 수도 있다. 또 는, 프로세서는 가중치 맵 대신 객체 영역을 나타내는 좌표 값을 획득할 수도 있으며, 객체 영역의 위치를 나타낼 수 있는 방법이라면 어떠한 방법이라도 무방하다. 또한, 가중치 맵의 크기는 입력 이미지보다 클 수도 있다. 가령, 가중치 맵의 크기는 후술할 입력 이미지가 업스케일링된 이미지의 크기와 동일할 수도 있다. 또한, 프로세서는 입력 이미지에 포함된 복수의 타입의 객체 영역에 기초하여 가중치 맵을 획득할 수도 있 다. 예를 들어, 프로세서는 입력 이미지에 포함된 얼굴 영역 및 글자 영역에 기초하여 가중치 맵을 획득할 수도 있다. 이 경우, 얼굴 영역은 흰색으로 표현되고, 글자 영역은 붉은색으로 표현되며, 배경 영역은 검은색으 로 표현될 수도 있다. 프로세서는 입력 이미지를 복수의 신경망 모델 각각에 입력하여 복수의 이미지를 획득하고, 가중치 맵에 기초하여 복수의 이미지를 가중합하여 출력 이미지를 획득할 수 있다. 예를 들어, 복수의 신경망 모델은 제1 신경망 모델 및 제2 신경망 모델을 포함하고, 프로세서는 입력 이미 지를 제1 신경망 모델에 입력하여 제1 이미지를 획득하고, 입력 이미지를 제2 신경망 모델에 입력하여 제2 이미 지를 획득하며, 제1 이미지 및 제2 이미지를 가중치 맵에 기초하여 가중합하여 출력 이미지를 획득할 수 있다. 여기서, 제1 신경망 모델은 객체 영역의 업스케일링 처리가 강화된 모델이고, 제2 신경망 모델은 배경 영역의 업스케일링 처리가 강화된 모델일 수 있다. 여기서, 출력 이미지는 입력 이미지가 업스케일링된 이미지이며, 객체 영역은 제1 신경망 모델에 의해 처리된 제1 이미지의 가중치가 높게 반영되고, 배경 영역은 제2 신경망 모델에 의해 처리된 제2 이미지의 가중치가 높 게 반영될 수 있다. 즉, 프로세서는 제1 이미지에 포함된 객체 영역에 제2 이미지에 포함된 객체 영역보다 높은 가중치를 부여 하고, 제1 이미지에 포함된 배경 영역에 제2 이미지에 포함된 배경 영역보다 낮은 가중치를 부여하여 제1 이미 지 및 제2 이미지를 가중합할 수 있다. 여기서, 객체 영역 및 배경 영역의 경계는 가중치가 동일할 수도 있다. 영역 별로 가중치가 상이하게 반영됨에 따라 각 영역 별로 영역 특성이 좀더 반영된 업스케일링 처리가 가능하 다. 이상에서는 두 개의 신경망 모델이 이용되는 것으로 설명하였으나, 이에 한정되는 것은 아니다. 예를 들어, 복 수의 신경망 모델은 얼굴 영역의 업스케일링 처리가 강화된 제1 신경망 모델, 글자 영역의 업스케일링 처리가 강화된 제2 신경망 모델 및 인공물 영역의 업스케일링 처리가 강화된 제3 신경망 모델을 포함하고, 프로세서 는 입력 이미지를 제1 신경망 모델 내지 제3 신경망 모델 각각에 입력하여 3개의 이미지를 획득할 수도 있 다. 또한, 프로세서는 얼굴 영역, 글자 영역 및 인공물 영역에 기초한 가중치 맵을 이용하여 3개의 이미지 를 가중합하여 출력 이미지를 획득할 수도 있다. 한편, 프로세서는 입력 이미지가 임계 해상도이면, 입력 이미지를 복수의 신경망 모델 중 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 입력 이미지가 임계 해상도보다 크면 입력 이미지를 전처리하고, 전처리 된 이미지를 복수의 신경망 모델 중 제2 모델들 각각에 입력할 수 있다. 예를 들어, 프로세서는 입력 이미지가 SD 해상도이면, 입력 이미지를 복수의 신경망 모델 중 SD 해상도에 대응되는 제1 모델들 각각에 입력하고, 입력 이미지가 SD 해상도보다 크면 입력 이미지를 전처리하고, 전처리된 이미지를 복수의 신경망 모델 중 제2 모델들 각각에 입력할 수 있다. 여기서, 제1 모델들은 SD 해상도의 샘플 이미지들에 기초하여 학습된 모델이고, 제2 모델들은 SD 해상도보다 큰 입력 이미지의 해상도와 동일한 샘플 이 미지들에 기초하여 학습된 모델일 수 있다. 프로세서는 입력 이미지가 임계 해상도보다 크면 입력 이미지를 셔플링(shuffling)하여 복수의 서브 이미 지로 구분하고, 복수의 서브 이미지를 제2 모델들 각각에 입력할 수 있다. 예를 들어, 프로세서는 입력 이 미지가 FHD 해상도이면, 픽셀의 위치에 기초하여 입력 이미지를 4개의 채널로 분할할 수 있다. 가령, 프로세서 는 제1 픽셀을 제1 채널로, 제1 픽셀 우측의 제2 픽셀을 제2 채널로, 제1 픽셀 하측의 제3 픽셀을 제3 채 널로, 제3 픽셀 우측의 제4 픽셀을 제4 채널로 분할하고, 나머지 픽셀들에 대하여도 동일한 방법을 적용하여 입력 이미지를 4개의 채널로 분할할 수 있다. 즉, 프로세서는 입력 이미지를 복수의 채널로 분할하는 전처리 를 수행할 수도 있다. 또는, 프로세서는 입력 이미지가 임계 해상도이면, 입력 이미지를 복수의 신경망 모델 중 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 입력 이미지가 임계 해상도보다 크면 입력 이미지를 샘플링하여 입력 이 미지를 임계 해상도로 변경하고, 임계 해상도로 변경된 이미지를 제1 모델들 각각에 입력할 수도 있다. 예를 들어, 프로세서는 입력 이미지가 SD 해상도이면, 입력 이미지를 복수의 신경망 모델 중 SD 해상도에 대응되는 제1 모델들 각각에 입력하고, 입력 이미지가 SD 해상도보다 크면 입력 이미지를 샘플링하여 입력 이미 지를 SD 해상도로 변경하고, SD 해상도로 변경된 이미지를 제1 모델들 각각에 입력할 수도 있다. 이상과 같이 전자 장치는 고해상도의 이미지를 처리하기 위한 라인 ㅁ메모리(SRAM)을 구비할 필요가 없으 며, 저해상도의 이미지를 처리하기 위한 라인 메모리을 구비하더라도 고해상도의 이미지를 처리할 수 있다. 또 한, 전자 장치가 저해상도의 이미지를 처리하기 위한 라인 메모리를 구비함에 따라 제조 비용을 절감할 수 있다. 도 2b는 본 개시의 일 실시 예에 따른 전자 장치의 세부 구성을 나타내는 블럭도이다. 전자 장치는 메모리 및 프로세서를 포함할 수 있다. 또한, 도 2b에 따르면, 전자 장치는 통신 인터페이스 , 디스플레이 또는 사용자 인터페이스 중 적어도 하나를 더 포함할 수도 있다. 도 2b에 도시된 구성요소들 중 도 2a에 도시된 구성요소와 중복되는 부분에 대해서는 자세한 설명을 생략하도록 한다. 전자 장치는 STB와 같이 디스플레이가 구비되지 않은 장치일 수도 있으나, TV와 같이 디스플레이를 구비한 장치로 구현될 수도 있다. 이 경우, 전자 장치는 통신 인터페이스, 디스플레이 및 사용 자 인터페이스 등을 구비하여 입력 이미지를 외부로부터 수신하고, 사용자 명령에 따라 입력 이미지를 처 리하여 디스플레이할 수도 있다. 통신 인터페이스는 다양한 유형의 통신방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성이다. 예를 들어, 전자 장치는 통신 인터페이스를 통해 외부 장치로부터 입력 이미지, 신경망 모델 등을 수 신할 수 있다. 통신 인터페이스는 와이파이 모듈, 블루투스 모듈, 적외선 통신 모듈 및 무선 통신 모듈 등을 포함할 수 있다. 여기서, 각 통신 모듈은 적어도 하나의 하드웨어 칩 형태로 구현될 수 있다. 와이파이 모듈, 블루투스 모듈은 각각 WiFi 방식, 블루투스 방식으로 통신을 수행한다. 와이파이 모듈이나 블루 투스 모듈을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 적외선 통신 모듈은 시 광선과 밀리미터파 사이에 있는 적외 선을 이용하여 근거리에 무선으로 데이터를 전송하는 적외선 통신(IrDA, infrared Data Association)기술에 따 라 통신을 수행한다. 무선 통신 모듈은 상술한 통신 방식 이외에 지그비(zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE-A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 통신을 수행하는 적어도 하나의 통신 칩을 포함할 수 있다. 또는, 통신 인터페이스는 HDMI, DP, 썬더볼트, USB, RGB, D-SUB, DVI 등과 같은 유선 통신 인터페이스를 포함할 수 있다. 그 밖에 통신 인터페이스는 LAN(Local Area Network) 모듈, 이더넷 모듈, 또는 페어 케이블, 동축 케이블 또는 광섬유 케이블 등을 이용하여 통신을 수행하는 유선 통신 모듈 중 적어도 하나를 포함할 수도 있다. 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel) 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이 내에는 a- si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 한편, 디스플레이는 터치 센서와 결합된 터치 스크린, 플 렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등으로 구현될 수 있다. 프로세서는 출력 이미지를 디스플레이하도록 디스플레이를 제어할 수 있다. 다만, 전자 장치가 디스플레이를 구비하지 않은 경우, 프로세서는 출력 이미지를 TV와 같은 장치로 전송하도록 통신 인터페이스를 제어할 수도 있다. 사용자 인터페이스는 버튼, 터치 패드, 마우스 및 키보드 등으로 구현되거나, 상술한 디스플레이 기능 및 조작 입력 기능도 함께 수행 가능한 터치 스크린으로도 구현될 수 있다. 여기서, 버튼은 전자 장치의 본체 외관의 전면부나 측면부, 배면부 등의 임의의 영역에 형성된 기계적 버튼, 터치 패드, 휠 등과 같은 다양한 유 형의 버튼이 될 수 있다. 한편, 전자 장치는 마이크(미도시)를 더 구비하고, 마이크를 통해 사용자 음성을 수신할 수도 있다. 전자 장치는 마이크를 통해 수신된 사용자 음성을 디지털화하고, 디지털화된 사용자 음성에 기초하여 대응되는 동작을 수행할 수도 있다. 또는, 전자 장치는 원격 제어 장치(미도시)와 같은 별도의 장치에 의해 입력된 사용자 음성을 해당 장치로부터 수신할 수도 있다. 여기서, 원격 제어 장치는 전자 장치를 제어하기 위해 제조된 장치일 수 있다. 다만, 이에 한정되는 것은 아니며, 원격 제어 장치는 스마트폰과 같은 장치에 전자 장치를 제어하기 위한 어플리케이션이 설치된 장 치일 수도 있다. 이 경우, 전자 장치는 IR 수신부를 포함하며, IR 수신부를 통해 원격 제어 장치로부터의 제어 신호를 수신 할 수 있다. 다만, 이에 한정되는 것은 아니며, 전자 장치는 블루투스, 와이파이 등을 통해 원격 제어 장 치로부터 제어 신호를 수신할 수도 있으며, 원격 제어 장치로부터 제어 신호를 수신할 수 있는 통신 규격이라면 어떠한 것이라도 무방하다. 원격 제어 장치는 사용자 음성을 수신하기 위한 마이크 및 수신된 사용자 음성을 디지털화하고, 디지털화된 사 용자 음성을 전자 장치로 전송하기 위한 통신부를 포함할 수 있다. 여기서, 프로세서는 디지털화된 사용자 음성을 직접 식별할 수도 있으나, STT 서버와 같은 외부 서버로 전 송하고 외부 서버로부터 대응되는 제어 명령을 수신할 수도 있다. 한편, 본 개시에 따른 인공 지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP 등과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같 은 인공 지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인공 지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공 지능 전용 프로세서인 경우, 인공 지 능 전용 프로세서는 특정 인공 지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규 칙 또는 인공 지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만들어진다는 것은, 기본 인공 지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들 을 이용하여 학습됨으로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공 지능 모델이 만들어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공 지능이 수행되는 기기 자체에서 이루어질 수 도 있고, 별도의 서버 및/또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습 (supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또 는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공 지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공 지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN(Convolutional Neural Network), DNN (Deep Neural Network), RNN(Recurrent Neural Network), RBM(Restricted Boltzmann Machine), DBN(Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network), GAN(Generative Adversarial Network) 또는 심층 Q-네트워크(Deep Q-Networks) 등이 있으나, 이에 한정되는 것은 아니다. 이상과 같이 전자 장치는 객체의 타입 별로 특화된 복수의 신경망 모델을 이용함에 따라 이미지 처리 성능 이 향상될 수 있다.이하에서는 도 3 내지 도 7을 통해 전자 장치의 동작을 좀더 구체적으로 설명한다. 도 3 내지 도 7에서는 설명의 편의를 위해 개별적인 실시 예에 대하여 설명한다. 다만, 도 3 내지 도 7의 개별적인 실시 예는 얼마든 지 조합된 상태로 실시될 수도 있다. 도 3은 본 개시의 일 실시 예에 따른 가중치 맵의 획득 방법을 설명하기 위한 도면이다. 프로세서는 입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득할 수 있다. 구체적으로, 프로세 서는 입력 이미지로부터 객체 영역을 식별하고, 객체 영역에 대응되는 가중치가 나머지 영역에 대응되는 가중치와 상이한 가중치 맵을 획득할 수 있다. 여기서, 객체 영역은 사용자에 의해 선택된 타입의 객체 영역일 수 있다. 예를 들어, 도 3에 도시된 바와 같이, 얼굴 영역이 객체 영역으로서 선택되면, 프로세서는 입력 이미지로 부터 얼굴 영역을 식별하고, 얼굴 영역에 대응되는 가중치가 나머지 영역에 대응되는 가중치와 상이한 가중치 맵을 획득할 수 있다. 가중치 맵은 특정 영역과 나머지 영역을 구별하도록 생성될 수 있다. 예를 들어, 도 3에 도시된 바와 같이, 가 중치 맵은 얼굴 영역이 흰색으로 표현되고, 나머지 영역이 검은색으로 표현될 수 있다. 또한, 얼굴 영역의 중심 으로부터 멀어질수록 흰색에서 검은색으로 변화할 수 있다. 한편, 사용자가 복수의 타입의 객체 영역을 선택할 수도 있다. 예를 들어, 사용자가 얼굴 영역과 글자 영역을 선택하는 경우, 프로세서는 얼굴 영역과 글자 영역을 식별하고, 얼굴 영역, 글자 영역 및 나머지 영역이 상이하게 표현되도록 가중치 맵을 획득할 수도 있다. 한편, 프로세서는 가중치 맵을 입력 이미지의 해상도에 대응되는 크기로 획득할 수 있다. 이 경우, 프로세 서는 복수의 신경망 모델 각각으로부터 출력되는 복수의 이미지를 가중합하는 경우에 가중치 맵을 복수의 이미지의 크기에 대응되도록 업스케일링할 수 있다. 또는, 프로세서는 가중치 맵을 획득하는 단계에서 복수의 신경망 모델 각각으로부터 출력되는 복수의 이미 지의 크기에 대응되도록 가중치 맵을 업스케일링할 수도 있다. 도 4는 본 개시의 일 실시 예에 따른 출력 이미지를 획득하는 동작을 설명하기 위한 도면이다. 도 4의 상단 부 분은 객체 식별 동작(Object Detection) 및 가중치 맵 획득 동작(Object Gain Control)을 도시한 것으로, 도 3 과 중복되는 설명은 생략한다. 메모리에는 제1 신경망 모델 및 제2 신경망 모델을 포함하는 네트워크 뱅크가 저장될 수 있다. 도 4에서는 설명의 편의를 위해 2개의 신경망 모델만을 도시하였으나, 네트워크 뱅크는 얼마든지 다양한 신경망 모델을 포함할 수도 있다. 네트워크 뱅크는 제2 신경망 모델과 같이 특정 타입의 객체 영역의 처리가 강화된 모델을 포함할 수 있다. 예를 들어, 제2 신경망 모델은 자연물 영역의 처리가 강화된 모델로서, 자연물이 포함된 샘플 이미지 및 해당 샘플 이미지의 저해상도 이미지를 학습한 모델일 수 있다. 다만, 이에 한정되는 것은 아니며, 네트워크 뱅크는 제1 신경망 모델과 같이 복수의 타입의 객체 영역의 처리가 강화된 모델을 포함할 수도 있다. 가령, 제1 신경망 모델은 얼굴 영역의 처리 및 인체 영역의 처리 가 강화된 모델로서, 얼굴 영역 및 인체 영역이 포함된 샘플 이미지 및 해당 샘플 이미지의 저해상도 이미지를 학습한 모델일 수 있다. 이 경우, 제1 신경망 모델은 얼굴 영역의 처리가 강화된 이미지 및 인체 영역의 처리가 강화된 이미지를 모두 출력할 수도 있다. 프로세서는 입력 이미지를 제1 신경망 모델 및 제2 신경망 모델에 각각 입력하여, 제1 신경망 모델로부터 제1 이미지 및 제2 이미지를 획득하고, 제2 신경망 모델로부터 제3 이미지를 획득할 수 있다. 프로세서는 가중치 맵에 기초하여 제1 이미지, 제2 이미지 및 제3 이미지를 가중합하여 출력 이미지를 획 득할 수 있다. 여기서, 가중합 동작은 픽셀 별로 수행될 수 있다. 예를 들어, 프로세서는 제1 이미지, 제2 이미지 및 제3 이미지의 좌측 상단의 픽셀을 가중합하는 경우, 가중치 맵의 좌측 상단 값을 이용할 수 있다. 설명의 편의를 위해, 제1 신경망 모델로부터의 제1 이미지 및 제2 신경망 모델로부터 제3 이미지를 가중합하는 경우, 프로세서는 하기의 수학식 1에 기초하여 출력 이미지를 획득할 수 있다. [수학식 1] Y = w·Y1 + (1-w)·Y2 여기서, Y는 출력 이미지 픽셀 값이고, Y1은 제1 이미지의 픽셀 값이며, Y2는 제3 이미지의 픽셀 값이고, w는 가중치일 수 있다. 프로세서는 이상의 수학식 1을 모든 픽셀 값에 적용하여 출력 이미지를 획득할 수 있다. 한편, 제1 신경망 모델로부터의 제1 이미지, 제2 이미지 및 제2 신경망 모델로부터 제3 이미지를 가 중합하는 경우, 프로세서는 각 이미지의 강화 타입에 기초하여 가중치 값을 적용할 수 있다. 가령, 프로세 서는 제1 이미지가 얼굴 영역이 강화된 이미지인 경우 얼굴 영역에 대하여 0.9의 가중치를 적용하고, 제2 이미지가 인체 영역이 강화된 이미지인 경우 얼굴 영역에 대하여 0.1의 가중치를 적용하며, 제3 이미지가 자연 물 영역이 강화된 이미지인 경우 얼굴 영역에 대하여 0의 가중치를 적용할 수 있다. 이상에서는 복수의 이미지를 가중합하는 방법을 설명하였으나, 이에 한정되는 것은 아니다. 예를 들어, 프로세 서는 픽셀 단위가 아닌 기설정된 크기의 영역 단위로 가중치 맵을 획득하고, 획득된 가중치 맵에 기초하여 복수의 이미지를 가중합할 수도 있다. 도 5 및 도 6은 본 개시의 다양한 실시 예에 따른 라인 메모리의 용량을 줄이는 방법을 설명하기 위한 도면이다. 설명의 편의를 위해, SD와 FHD 해상도의 이미지를 UHD 해상도로 확대하는 것으로 가정한다. 종래에는 FHD 해상 도의 이미지를 실시간 확대하기 위해 수평 해상도에 대응되는 크기의 라인 메모리가 이용되었으며, SD 해상도의 이미지가 입력되면 라인 메모리의 일부만이 이용되었으나, 본 개시에 의하면 수평 해상도의 절반 크기의 라인 메모리로서 구현될 수 있다. SD와 FHD 해상도의 이미지를 UHD 해상도로 확대하기 위해서는 SD의 경우 4배로 확대하기 위한 네트워크가 필요 하며 FHD의 경우 2배로 확대하기 위한 네트워크가 필요하다. 프로세서는 도 5에 도시된 바와 같이, 입력 이미지가 SD 해상도이면, 입력 이미지를 복수의 신경망 모델 중 SD 해상도에 대응되는 제1 모델들 각각에 입력하고, 입력 이미지가 FHD 해상도이면 입력 이미지를 샘플링하 여 입력 이미지를 SD 해상도로 변경하고, SD 해상도로 변경된 이미지를 제1 모델들 각각에 입력할 수 있다. 이 경우, 모델들의 입력은 SD 해상도로 모두 동일하므로, 모델들의 웨이트 값이 해상도에 따라 달라지지 않는다. 또는, 프로세서는 도 6에 도시된 바와 같이, 입력 이미지가 SD 해상도이면, 입력 이미지를 복수의 신경망 모델 중 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 입력 이미지가 FHD 해상도이면 입력 이미지를 셔 플링(shuffling, 610)하여 가령 4개의 서브 이미지로 구분하고, 4개의 서브 이미지를 제2 모델들 각각에 입력할 수도 있다. 여기서, 프로세서는 입력 이미지가 SD 해상도이면 입력 이미지를 컨볼루션 블록에 입력하나, 입력 이 미지가 FHD 해상도이면 입력 이미지를 컨볼루션 블록 다음의 WRB(Wide Activation Residual Block) 블록 에 입력할 수 있다. 컨볼루션 블록은 입력 이미지의 R, G, B 3 채널의 데이터가 입력되도록 구현될 수 있고, WRB 블록은 12 채널의 데이터가 입력되도록 구현될 수 있다. 여기서, 12채널은 R, G, B 3 채널과 4개의 서브 이미지로의 구분에 따른 채널의 개수이다. 또한, 샘플링 방법과는 달리 셔플링 방법의 경우, 도 6의 신경망 모델의 형태는 동일하나, 신경망 모델의 웨이 트 값은 SD 해상도의 이미지가 입력되는 경우와 FHD 해상도의 이미지가 입력되는 경우가 상이할 수 있다. 이는, FHD 해상도의 이미지가 입력되는 경우, 4개의 서브 이미지로 셔플링되어 인접한 픽셀 간의 관계가 바뀌므로 SD 해상도로 학습된 모델을 이용할 수 없기 때문이다. 즉, FHD 해상도의 이미지가 입력되는 경우는 동일한 방법으로 셔플링 후 획득된 샘플 이미지들을 이용하여 신경망 모델이 학습될 수 있다. 이상과 같은 방법은 해상도의 축소 과정에서 일부 데이터의 손실이 발생할 수도 있으나, 독립적으로 구성한 General 네트워크 패스 결과와의 융합을 통해서 보상이 가능하다. General 네트워크 패스는 연산 복잡도를 낮추 는 대신 FHD 기준의 수평 라인메모리를 사용하여 연산을 수행할 수 있다. 또한, 이상과 같은 방법을 이용하는 경우, 해상도에 따른 분리 구현이 필요 없이 제조 비용을 절감할 수 있다. 도 7은 본 개시의 일 실시 예에 따른 WRB 블록을 설명하기 위한 도면이다. 도 7의 WRB 블록은 적은 수의 웨이트 값을 사용하여 넓은 활성층을 가지는 구조이다. 입력은 12 채널이지만 Conv/ReLu 블록은 48 채널의 출력, Conv/ReLu 블록는 12 채널의 출력, Concat 블록은 24 채널 의 출력, Conv 블록은 12 채널의 출력으로 감소하게 된다. WRB 블록의 내부 채널 수는 허용 리소스에 따라 얼마든지 다양하게 구현될 수 있다. 도 8은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 먼저, 입력 이미지에 포함된 객체 영역에 기초하여 가중치 맵을 획득한다(S810). 그리고, 입력 이미지를 복수의 신경망 모델 각각에 입력하여 복수의 이미지를 획득한다(S820). 그리고, 가중치 맵에 기초하여 복수의 이미지를 가중합하여 출력 이미지를 획득한다(S830). 여기서, 복수의 신경망 모델 각각은 이미지를 업스케일링하도록 학 습된 모델일 수 있다. 여기서, 복수의 신경망 모델은 제1 신경망 모델 및 제2 신경망 모델을 포함하고, 복수의 이미지를 획득하는 단 계(S820)는 입력 이미지를 제1 신경망 모델에 입력하여 제1 이미지를 획득하고, 입력 이미지를 제2 신경망 모델 에 입력하여 제2 이미지를 획득하며, 출력 이미지를 획득하는 단계(S830)는 제1 이미지 및 제2 이미지를 가중치 맵에 기초하여 가중합하여 출력 이미지를 획득할 수 있다. 여기서, 제1 신경망 모델은 객체 영역의 업스케일링 처리가 강화된 모델이고, 제2 신경망 모델은 배경 영역의 업스케일링 처리가 강화된 모델일 수 있다. 그리고, 출력 이미지를 획득하는 단계(S830)는 제1 이미지에 포함된 객체 영역에 제2 이미지에 포함된 객체 영 역보다 높은 가중치를 부여하고, 제1 이미지에 포함된 배경 영역에 제2 이미지에 포함된 배경 영역보다 낮은 가 중치를 부여하여 제1 이미지 및 제2 이미지를 가중합할 수 있다. 한편, 가중치 맵을 획득하는 단계(S810)는 입력 이미지로부터 객체 영역을 식별하고, 객체 영역에 대응되는 가 중치가 나머지 영역에 대응되는 가중치와 상이한 가중치 맵을 획득할 수 있다. 여기서, 가중치 맵을 획득하는 단계(S810)는 객체 영역의 중심을 기준으로 가중치가 점차 변경되는 가중치 맵을 획득할 수 있다. 한편, 복수의 이미지를 획득하는 단계(S820)는 입력 이미지가 임계 해상도이면, 입력 이미지를 복수의 신경망 모델 중 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 입력 이미지가 임계 해상도보다 크면 입력 이미 지를 전처리하고, 전처리된 이미지를 복수의 신경망 모델 중 제2 모델들 각각에 입력할 수 있다. 여기서, 제2 모델들 각각에 입력하는 단계는 입력 이미지가 임계 해상도보다 크면 입력 이미지를 셔플링 (shuffling)하여 복수의 서브 이미지로 구분하고, 복수의 서브 이미지를 제2 모델들 각각에 입력할 수 있다. 한편, 복수의 이미지를 획득하는 단계(S820)는 입력 이미지가 임계 해상도이면, 입력 이미지를 복수의 신경망 모델 중 임계 해상도에 대응되는 제1 모델들 각각에 입력하고, 입력 이미지가 임계 해상도보다 크면 입력 이미 지를 샘플링하여 입력 이미지를 임계 해상도로 변경하고, 임계 해상도로 변경된 이미지를 제1 모델들 각각에 입 력할 수 있다. 그리고, 객체 영역은 인체 영역, 얼굴 영역, 글자 영역, 그래픽 영역, 인공물 영역 또는 자연물 영역 중 적어도 하나를 포함할 수 있다. 이상과 같은 본 개시의 다양한 실시 예에 따르면, 전자 장치는 객체의 타입 별로 특화된 복수의 신경망 모델을 이용함에 따라 이미지 처리 성능이 향상될 수 있다. 또한, 복수의 신경망 모델은 객체의 타입 별로 특화되어 경량화가 가능함에 따라 모델의 용량을 줄일 수 있다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다.기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실 시 예들에 따른 전자 장치(예: 전자 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세 서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저 장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신 호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시 적으로 저장됨을 구분하지 않는다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어 (hardware) 또는 이들의 조합을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 일부 경우에 있어 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있 다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨 어 모듈들로 구현될 수 있다. 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 한편, 상술한 다양한 실시 예들에 따른 기기의 프로세싱 동작을 수행하기 위한 컴퓨터 명령어(computer instructions)는 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium)에 저장될 수 있 다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어는 특정 기기의 프로세서에 의해 실행되었 을 때 상술한 다양한 실시 예에 따른 기기에서의 처리 동작을 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반영구 적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작 들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생 략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2020-0158173", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2020-0158173", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술을 설명하기 위한 도면이다. 도 2a는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블록도이다. 도 2b는 본 개시의 일 실시 예에 따른 전자 장치의 세부 구성을 나타내는 블럭도이다. 도 3은 본 개시의 일 실시 예에 따른 가중치 맵의 획득 방법을 설명하기 위한 도면이다. 도 4는 본 개시의 일 실시 예에 따른 출력 이미지를 획득하는 동작을 설명하기 위한 도면이다. 도 5 및 도 6은 본 개시의 다양한 실시 예에 따른 라인 메모리의 용량을 줄이는 방법을 설명하기 위한 도면이다. 도 7은 본 개시의 일 실시 예에 따른 WRB 블록을 설명하기 위한 도면이다. 도 8은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
