{"patent_id": "10-2020-0066269", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0149929", "출원번호": "10-2020-0066269", "발명의 명칭": "복약관리장치 및 이를 이용한 복약관리방법 및 복약관리시스템", "출원인": "중앙대학교 산학협력단", "발명자": "윤영철"}}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복용자에 대한 처방정보가 기록된 처방전을 촬영하거나, 상기 복용자가 복용하고자 하는 약을 촬영하는 카메라부;상기 카메라부로부터 상기 처방전의 이미지를 전달받아서 상기 복용자에 대한 처방정보를 얻을 수 있으며, 상기복용자가 복용하고자 하는 약이 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부를 확인받고자 하는 상기 복용자의 선택에 따라 상기 카메라부에서 촬영하여 얻어진 상기 약의 이미지를 상기 카메라부로부터 전달받아서 상기 복용자가 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부를 판단할 수 있는 판단제어부; 상기 판단제어부의 제어에 따라 상기 처방정보를 저장하거나 저장된 상기 처방정보를 상기 판단제어부로 전달하며, 상기 처방정보에 따라 상기 복용자가 복용해야할 약이 올바르게 선택되었는지 여부를 상기 판단제어부가 판단할 수 있도록 상기 처방정보에 따라 복용해야할 약의 표준이미지가 저장된 저장부; 및상기 판단제어부의 제어에 따라 상기 복용자가 상기 처방정보에 따른 상기 약의 복용시간에 상기 복용자가 상기약을 복용할 수 있도록 복용안내를 출력하는 출력부;를 포함하는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 판단제어부의 제어에 따라 상기 복용자로부터 상기 복용자의 생체정보를 얻는 측정부; 를 더 포함하고, 상기 판단제어부는 상기 측정부에서 측정하여 얻어진 상기 생체정보를 상기 복용자의 복용기록에 포함시켜서 상기 저장부에 저장시키는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 출력부는, 상기 복용자가 상기 처방정보에 따른 상기 약의 복용시간, 상기 처방정보에 따라 복용해야할 약의 표준이미지,상기 복용자가 복용하고자 하는 약이 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부및 상기 복용자의 상기 생체정보 중 적어도 어느 하나 이상을 상기 복용자에게 시각적으로 제공하여 주는 디스플레이장치를 포함하는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서, 상기 출력부는, 상기 복용자가 상기 처방정보에 따른 상기 약의 복용시간, 상기 복용자가 복용하고자 하는 약이 상기 처방정보에 따라 복용해야할 약이 맞는지 여부 및 상기 복용자의 상기 생체정보 중 적어도 어느 하나 이상을 상기 복용자에게 청각적으로 알려주는 스피커를 포함하는 것을 특징으로 하는 복약관리장치.공개특허 10-2021-0149929-3-청구항 5 제 4항에 있어서, 상기 생체정보에는,상기 복용자의 체온, 혈압, 맥박수 및 혈당량 중 적어도 어느 하나 이상이 포함된 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서, 상기 생체정보로서 상기 복용자의 체온이 측정된 경우, 상기 판단제어부는, 상기 복용자의 체온이 정상체온범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 상기복용자의 체온측정치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 체온의 변화추이를 판단하고, 상기 복용자의 체온, 상기 복용자의 체온이 정상체온범위 내에 속하는지 여부 및 과거에 측정되어 저장된 상기복용자의 체온 측정치와의 비교를 통하여 얻어지는 체온의 변화추세 중 적어도 어느 하나 이상을 상기 디스플레이장치 또는 상기 스피커가 출력하도록 제어하는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서, 상기 복용자의 상기 처방정보에 따라 복용해야할 약에 해열제가 포함되어 있고, 상기 복용자의 체온이 정상체온범위 내에 있는 것으로 측정된 경우, 상기 판단제어부는, 상기 복용자에게 상기 복용자의 체온이 정상체온임을 안내하면서 상기 처방전을 작성한 의료인에게 재진찰을 받아볼 것을 권고하는 안내를 상기 디스플레이장치 또는 상기 스피커가 출력하도록 제어하는 것을 특징으로 하는복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5항에 있어서, 상기 생체정보로서 상기 복용자의 혈압이 측정된 경우, 상기 판단제어부는, 상기 복용자의 혈압이 정상혈압범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 상기복용자의 혈압측정치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 혈압의 변화추이를 판단하고, 상기 복용자의 혈압, 상기 복용자의 혈압이 정상혈압범위 내에 속하는지 여부 및 과거에 측정되어 저장된 상기복용자의 혈압 측정치와의 비교를 통하여 얻어지는 혈압의 변화추이 중 적어도 어느 하나 이상을 상기 디스플레이장치 또는 상기 스피커가 출력하도록 제어하는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 5항에 있어서, 상기 생체정보로서 상기 복용자의 맥박수가 측정된 경우, 공개특허 10-2021-0149929-4-상기 판단제어부는, 상기 복용자의 맥박수가 정상맥박수범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 상기 복용자의 맥박수의 측정치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 맥박수의 변화추이를 판단하고, 상기 복용자의 맥박수, 상기 복용자의 맥박수가 정상맥박수의 범위 내에 속하는지 여부 및 과거에 측정되어 저장된 상기 복용자의 맥박수 측정치와의 비교를 통하여 얻어지는 맥박수의 변화추이 중 적어도 어느 하나 이상을상기 디스플레이장치 또는 상기 스피커가 출력하도록 제어하는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 5항에 있어서, 상기 생체정보로서 상기 복용자의 혈당량이 측정된 경우, 상기 판단제어부는, 상기 복용자의 혈당량이 정상혈당량범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 상기 복용자의 혈당량 측정치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 혈당량의 변화추이를 판단하고, 상기 복용자의 혈당량, 상기 복용자의 혈당량이 정상혈당량범위 내에 속하는지 여부 및 과거에 측정되어 저장된상기 복용자의 혈당량 측정치와의 비교를 통하여 얻어지는 혈당량의 변화추세 중 적어도 어느 하나 이상을 상기디스플레이장치 또는 상기 스피커가 출력하도록 제어하는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 5항에 있어서,상기 판단제어부는, 상기 복용자의 약복용패턴을 학습하여 복용관리를 할 수 있도록 딥러닝프로그램을 갖춘 인공지능을 포함하는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서, 상기 판단제어부는, 상기 복용자의 음성을 인식하여 상기 복용자의 복용시간 또는 복용스케쥴을 조정 또는 관리할 수 있는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 2항에 있어서, 상기 판단제어부의 제어에 따라 상기 저장부에 저장된 상기 복용기록을 복약관리서버로 전송하는 통신부;를 더포함하는 것을 특징으로 하는 복약관리장치."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 2항에 있어서,상기 처방전에 표시된 바코드를 스캐닝하여 상기 복용자에 대한 상기 처방정보를 얻을 수 있는 바코드스캐너부;를 더 포함하는 것을 특징으로 하는 복약관리장치.공개특허 10-2021-0149929-5-청구항 15 복용자에 대한 처방정보를 입력받거나 전달받는 처방정보획득단계;상기 처방정보획득단계에서 얻어진 상기 처방정보에 따른 약복용시간 또는 상기 복용자의 선택에 따른 약복용시간이 되면, 상기 복용자가 상기 약을 복용할 수 있도록 복용안내를 제공하는 복용안내단계;상기 복용안내단계에서 복용안내를 받은 상기 복용자의 선택에 따라, 상기 복용자가 복용하고자 하는 약의 이미지와 상기 처방정보에 따라 상기 복용자가 복용해야할 약의 표준이미지를 비교하여 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부를 판단하고 상기 복용자에게 안내하는 복용약확인단계; 및 상기 복용약확인단계에서 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택된 약을 상기 복용자가 복용하였는지 여부를 확인하고 복용기록을 업데이트하여 저장하는 복용여부확인단계; 를 포함하는 것을 특징으로 하는 복약관리방법."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 복용약확인단계에서 상기 복용자로부터 상기 복용자의 생체정보를 측정하여 얻고, 상기 복용여부확인단계에서 업데이트하여 저장되는 상기 복용기록에 상기 생체정보를 포함시켜서 저장하는 것을특징으로 하는 복약관리방법."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16항에 있어서, 상기 복용여부확인단계에서, 상기 생체정보와 상기 복용기록을 상기 복용자가 파악할 수 있도록 외부로 표시하는 것을 특징으로 하는 복약관리방법."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17항에 있어서, 상기 생체정보에는, 상기 복용자의 체온, 혈압, 맥박수 및 혈당량 중 적어도 어느 하나 이상이 포함된 것을 특징으로 하는 복약관리방법."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서, 상기 처방전을 작성한 의료인이 상기 복용자의 상기 복용기록을 확인할 수 있도록,상기 복용여부확인단계에서, 상기 생체정보가 포함되어 기록된 상기 복용기록을 복약관리서버로 전송하는 것을 특징으로 하는 복약관리방법."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "공개특허 10-2021-0149929-6-복용자가 처방전의 처방정보에 따라 약의 복용시간에 복용안내를 제공하고, 상기 복용자가 복용해야할 약이 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부를 상기 복용자의 선택에 따라 확인하여주며, 상기 복용자의 복약기록을 업데이트하여 저장 및 관리하는 복약관리장치; 상기 복약관리장치로부터 상기 복용자의 복용기록을 전달받아서 저장하는 복약관리서버; 및상기 복약관리서버로부터 상기 복용자의 복용기록을 전달받아서 상기 처방전을 처방한 의사가 상기 복용기록을열람할 수 있도록 표시하는 의료단말기;를 포함하는 것을 특징으로 하는 복약관리시스템."}
{"patent_id": "10-2020-0066269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20항에 있어서, 상기 복약관리장치는,제 1항 내지 제 14항 중 어느 한 항에 따른 복약관리장치인 것을 특징으로 하는 복약관리시스템."}
{"patent_id": "10-2020-0066269", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 복약관리장치 및 이를 이용한 복약관리방법 및 복약관리시스템에 관한 것으로, 본 발명에 따르면, 복 용자가 복용하고자 하는 약을 촬영하는 카메라부; 복용자의 선택에 따라 복용자가 복용해야할 약이 올바르게 선 택되었는지 여부를 판단하는 판단제어부; 복용기록을 저장하는 저장부 및 복용안내를 출력하기 위한 출력부를 포 함하므로 복용자가 처방전에 따른 올바른 약을 복용할 수 있도록 관리하여 주며 복약 치료의 정확성과 효율성을 향상시켜줄 수 있는 기술이 개시된다."}
{"patent_id": "10-2020-0066269", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 약의 규칙적인 복용을 위한 복약관리장치에 관한 것으로, 보다 상세하게는 처방전에 따른 약의 복용 을 안내 및 관리하기 위한 복약관리장치 및 이를 이용한 복약관리방법 및 복약관리시스템에 관한 것이다."}
{"patent_id": "10-2020-0066269", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 질병이나 상해 등 건강상의 이유로 약을 복용하는 경우가 많다. 특정 질환이 있는 사람의 경우에는 장기간 주기적으로 복약을 해야 하는 경우도 있다. 이러한 약들은 각기 서로 다른 화학적 성분으로 이루어져 있기 때문에 약마다 체내에서 흡수되고 분해되는 작용 과정이 다르므로 대부분 복약시간이 미리 정해져 있다. 따라서, 올바른 투약효과를 기대하기 위해서는 약의 성분과 목적 및 약효의 지속시간을 고려하여 일정 간격으로 정해진 시간에 정해진 약제를 복용하는 것이 중요하다. 즉, 약에 대한 처방전을 작성하는 의사나 약사는 투약시간에 대해 기상후, 식전, 식후 및 취침전 등과 같이 가 능한 일반인의 생활패턴에 맞추어 복용약제, 복약시간 및 복용방법 등에 관하여 안내를 하고 있지만, 복약지도 는 의사 또는 약사의 구두에 따라 설명되며, 이후 복약과정에서 복용자의 기억과 주의에 전적으로 의존하고 있 으므로 복용자 개개인이 주의를 미처 기울이지 못한다면 복약 스케쥴에 따른 효과적인 복약을 기대하기가 어렵 다. 종래에는 복약관리를 보조하는 별도의 기록지를 이용하여 왔다. 별도의 기록지란 복용약제 및 복약시기가 제공 되어 복용자가 이에 따라 복약한 뒤 복약사실을 하나하나 기록하는 노트나 메모를 하였으나, 기록지를 이용한 복약관리는 사람이 수기로 작성하는 것이어서 관리의 효율성에 한계가 있었으며 복용자가 매번 복약시마다 기록 지에 복약사실을 수기로 기록하는 것은 누락이나 오기의 우려가 크며, 양로원이나 보육시설 등에서 간호인에게 기록하도록 하는 경우에라도 모든 복약여부를 빠짐없이 기록하기는 쉽지 않다. 따라서, 올바르고 효과적인 복약을 위하여 복약을 안내하고 관리하여 줄 수 있는 기술이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-1773242호"}
{"patent_id": "10-2020-0066269", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2020-0066269", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 상기한 바와 같은 종래의 문제점을 해결하기 위한 것으로, 정해진 복약시간에 정확한 약을 복 약할 수 있도록 안내 또는 관리를 할 수 있는 복약관리장치 및 이를 이용한 복약관리방법 및 복약관리시스템을 제공함에 있다."}
{"patent_id": "10-2020-0066269", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 실시 예에 따른 복약관리장치는, 복용자에 대한 처방정보가 기록 된 처방전을 촬영하거나, 상기 복용자가 복용하고자 하는 약을 촬영하는 카메라부; 상기 카메라부로부터 상기 처방전의 이미지를 전달받아서 상기 복용자에 대한 처방정보를 얻을 수 있으며, 상기 복용자가 복용하고자 하는 약이 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부를 확인받고자 하는 상기 복용자의 선택에 따라 상기 카메라부에서 촬영하여 얻어진 상기 약의 이미지를 상기 카메라부로부터 전달받아서 상기 복 용자가 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부를 판단할 수 있는 판단제어부; 상기 판단제어부의 제어에 따라 상기 처방정보를 저장하거나 저장된 상기 처방정보를 상기 판단제어부로 전달하 며, 상기 처방정보에 따라 상기 복용자가 복용해야할 약이 올바르게 선택되었는지 여부를 상기 판단제어부가 판 단할 수 있도록 상기 처방정보에 따라 복용해야할 약의 표준이미지가 저장된 저장부; 및 상기 판단제어부의 제 어에 따라 상기 복용자가 상기 처방정보에 따른 상기 약의 복용시간에 상기 복용자가 상기 약을 복용할 수 있도 록 복용안내를 출력하는 출력부;를 포함하는 것을 하나의 특징으로 할 수도 있다. 여기서, 상기 판단제어부의 제어에 따라 상기 복용자로부터 상기 복용자의 생체정보를 얻는 측정부; 를 더 포함 하고, 상기 판단제어부는 상기 측정부에서 측정하여 얻어진 상기 생체정보를 상기 복용자의 복용기록에 포함시 켜서 상기 저장부에 저장시키는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 출력부는, 상기 복용자가 상기 처방정보에 따른 상기 약의 복용시간, 상기 처방정보에 따라 복용 해야할 약의 표준이미지, 상기 복용자가 복용하고자 하는 약이 상기 처방정보에 따라 복용해야할 약으로서 올바 르게 선택되었는지 여부 및 상기 복용자의 상기 생체정보 중 적어도 어느 하나 이상을 상기 복용자에게 시각적 으로 제공하여 주는 디스플레이장치를 포함하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 출력부는, 상기 복용자가 상기 처방정보에 따른 상기 약의 복용시간, 상기 복용자가 복용하고자 하는 약이 상기 처방정보에 따라 복용해야할 약이 맞는지 여부 및 상기 복용자의 상기 생체정보 중 적어도 어느 하나 이상을 상기 복용자에게 청각적으로 알려주는 스피커를 포함하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 생체정보에는, 상기 복용자의 체온, 혈압, 맥박수 및 혈당량 중 적어도 어느 하나 이상이 포함된 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 생체정보로서 상기 복용자의 체온이 측정된 경우, 상기 판단제어부는, 상기 복용자의 체온이 정상 체온범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 상기 복용자의 체온측정치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 체온의 변화추이를 판단하고, 상기 복용자의 체온, 상기 복용자의 체온이 정상체온범위 내에 속하는지 여부 및 과거에 측정되어 저장된 상기 복용자의 체온 측정치와의 비교를 통 하여 얻어지는 체온의 변화추세 중 적어도 어느 하나 이상을 상기 디스플레이장치 또는 상기 스피커가 출력하도 록 제어하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 복용자의 상기 처방정보에 따라 복용해야할 약에 해열제가 포함되어 있고, 상기 복용자의 체온이 정상체온범위 내에 있는 것으로 측정된 경우, 상기 판단제어부는, 상기 복용자에게 상기 복용자의 체온이 정상 체온임을 안내하면서 상기 처방전을 작성한 의료인에게 재진찰을 받아볼 것을 권고하는 안내를 상기 디스플레이 장치 또는 상기 스피커가 출력하도록 제어하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 생체정보로서 상기 복용자의 혈압이 측정된 경우, 상기 판단제어부는, 상기 복용자의 혈압이 정상 혈압범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 상기 복용자의 혈압측정치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 혈압의 변화추이를 판단하고, 상기 복용자의 혈압, 상기 복용자의 혈압이 정상혈압범위 내에 속하는지 여부 및 과거에 측정되어 저장된 상기 복용자의 혈압 측정치와의 비교를 통 하여 얻어지는 혈압의 변화추이 중 적어도 어느 하나 이상을 상기 디스플레이장치 또는 상기 스피커가 출력하도 록 제어하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 생체정보로서 상기 복용자의 맥박수가 측정된 경우, 상기 판단제어부는, 상기 복용자의 맥박수가 정상맥박수범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 상기 복용자의 맥박수의 측 정치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 맥박수의 변화추이를 판단하고, 상기 복용자의 맥박수, 상기 복용자의 맥박수가 정상맥박수의 범위 내에 속하는지 여부 및 과거에 측정되어 저장된 상기 복용 자의 맥박수 측정치와의 비교를 통하여 얻어지는 맥박수의 변화추이 중 적어도 어느 하나 이상을 상기 디스플레 이장치 또는 상기 스피커가 출력하도록 제어하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 생체정보로서 상기 복용자의 혈당량이 측정된 경우, 상기 판단제어부는, 상기 복용자의 혈당량이 정상혈당량범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 상기 복용자의 혈당량 측정 치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 혈당량의 변화추이를 판단하고, 상기 복용자의 혈당량, 상기 복용자의 혈당량이 정상혈당량범위 내에 속하는지 여부 및 과거에 측정되어 저장된 상기 복용자의 혈당량 측정치와의 비교를 통하여 얻어지는 혈당량의 변화추세 중 적어도 어느 하나 이상을 상기 디스플레이장치 또는 상기 스피커가 출력하도록 제어하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 판단제어부는, 상기 복용자의 약복용패턴을 학습하여 복용관리를 할 수 있도록 딥러닝프로그램을 갖춘 인공지능을 포함하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 판단제어부는, 상기 복용자의 음성을 인식하여 상기 복용자의 복용시간 또는 복용스케쥴을 조정 또는 관리할 수 있는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 판단제어부의 제어에 따라 상기 저장부에 저장된 상기 복용기록을 복약관리서버로 전송하는 통신 부;를 더 포함하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 처방전에 표시된 바코드를 스캐닝하여 상기 복용자에 대한 상기 처방정보를 얻을 수 있는 바코드 스캐너부;를 더 포함하는 것을 또 하나의 특징으로 할 수도 있다. 상기와 같은 목적을 달성하기 위한 본 발명의 실시 예에 따른 복약관리장치를 이용한 복약관리방법은 복용자에 대한 처방정보를 입력받거나 전달받는 처방정보획득단계; 상기 처방정보획득단계에서 얻어진 상기 처방정보에 따른 약복용시간 또는 상기 복용자의 선택에 따른 약복용시간이 되면, 상기 복용자가 상기 약을 복용할 수 있도 록 복용안내를 제공하는 복용안내단계; 상기 복용안내단계에서 복용안내를 받은 상기 복용자의 선택에 따라, 상 기 복용자가 복용하고자 하는 약의 이미지와 상기 처방정보에 따라 상기 복용자가 복용해야할 약의 표준이미지 를 비교하여 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부를 판단하고 상기 복용자에 게 안내하는 복용약확인단계; 및 상기 복용약확인단계에서 상기 처방정보에 따라 복용해야할 약으로서 올바르게 선택된 약을 상기 복용자가 복용하였는지 여부를 확인하고 복용기록을 업데이트하여 저장하는 복용여부확인단계; 를 포함하는 것을 하나의 특징으로 할 수도 있다. 여기서, 상기 복용약확인단계에서 상기 복용자로부터 상기 복용자의 생체정보를 측정하여 얻고, 상기 복용여부 확인단계에서 업데이트하여 저장되는 상기 복용기록에 상기 생체정보를 포함시켜서 저장하는 것을 또 하나의 특 징으로 할 수도 있다. 여기서, 상기 복용여부확인단계에서, 상기 생체정보와 상기 복용기록을 상기 복용자가 파악할 수 있도록 외부로 표시하는 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 생체정보에는, 상기 복용자의 체온, 혈압, 맥박수 및 혈당량 중 적어도 어느 하나 이상이 포함된 것을 또 하나의 특징으로 할 수도 있다. 여기서, 상기 처방전을 작성한 의료인이 상기 복용자의 상기 복용기록을 확인할 수 있도록, 상기 복용여부확인 단계에서, 상기 생체정보가 포함되어 기록된 상기 복용기록을 복약관리서버로 전송하는 것을 또 하나의 특징으 로 할 수도 있다. 상기와 같은 목적을 달성하기 위한 본 발명의 실시 예에 따른 복약관리장치를 포함하는 복약관리시스템은 복용 자가 처방전의 처방정보에 따라 약의 복용시간에 복용안내를 제공하고, 상기 복용자가 복용해야할 약이 상기 처 방정보에 따라 복용해야할 약으로서 올바르게 선택되었는지 여부를 상기 복용자의 선택에 따라 확인하여 주며, 상기 복용자의 복약기록을 업데이트하여 저장 및 관리하는 복약관리장치; 상기 복약관리장치로부터 상기 복용자 의 복용기록을 전달받아서 저장하는 복약관리서버; 및 상기 복약관리서버로부터 상기 복용자의 복용기록을 전달 받아서 상기 처방전을 처방한 의사가 상기 복용기록을 열람할 수 있도록 표시하는 의료단말기;를 포함하는 것을 하나의 특징으로 할 수도 있다."}
{"patent_id": "10-2020-0066269", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따른 복약관리장치 및 이를 이용한 복약관리방법 및 복약관리시스템은 예정된 복약시간에 복용자가 처방전에 따른 올바른 약을 복용할 수 있도록 관리하여 주므로 복약 치료의 효율성을 증진시켜주는 효 과가 있다."}
{"patent_id": "10-2020-0066269", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명에 대하여 보다 구체적으로 이해할 수 있도록 첨부된 도면을 참조한 바람직한 실시 예를 들 어 설명하기로 한다. 본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하 고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유 사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시 예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 도 1은 본 발명의 실시 예에 따른 복약관리장치를 개략적으로 나타낸 블록도이다. 도 1을 참조하면, 본 발명의 실시 예에 따른 복약관리장치는 카메라부, 판단제어부, 저장부 및 출력부를 포함하며, 측정부, 통신부 및 입력부를 더 포함할 수 있다. 본 발명을 설명함에 있어서, 복용자는 처방전에 기록된 처방정보에 따라 약을 복용하고자 하는 사람을 말한다. 그리고 처방정보는 기본적으로 복용할 약의 이름과 복용할 수량이 기본적으로 포함되며, 약을 복용할 시간, 약 의 복용방법, 약의 복용시 유의사항도 포함한다. 카메라부는 전기적 신호를 주고받을 수 있도록 판단제어부와 연결되어 있다. 카메라부는 복용자 에 대한 처방정보가 기록된 처방전을 스캔 또는 촬영하거나, 복용자가 복용하고자 하는 약을 촬영한다. 카메라 부에 의해 촬영된 처방전 이미지 또는 복용자가 복용하고자 하는 약을 촬영하여 얻어진 이미지는 판단제어 부로 전달된다. 판단제어부는 카메라부, 저장부, 출력부, 측정부, 통신부 및 입력부와 전 기적 신호를 주고 받을 수 있도록 연결되어 있다. 판단제어부는 카메라부로부터 처방전의 이미지를 전달받아서 복용자에 대한 처방정보를 얻을 수 있다. 판단제어부에는 처방전의 이미지로부터 문자를 인식하여 처방정보를 얻는다. 판단제어부에는 문자인식을 할 수 있도록 문자인식프로그램이 적용되어 있다. 여기서, 처방정보에는 복용자에게 처방된 약들의 이름, 복약기간, 복약횟수, 복용시간, 복용방법, 주의사항 등 이 포함되어 있으며, 의사의 처방에 따른 복용스케쥴도 포함될 수 있다. 아울러 판단제어부는 음성인식을 통한 복약시간 또는 복용스케쥴을 조정 또는 관리할 수 있다. 그리고, 복 용자의 약 복용 패턴에 적응하여 복용관리를 할 수 있도록 할 수 있도록 딥러닝프로그램을 갖춘 인공지능(A. I.)를 포함할 수 있다. 판단제어부는, 복용자가 복용하고자 하는 약이 처방정보에 따라 복용해야할 약으로서 올바르게 선택되었는 지 여부를 확인받고자 하는 복용자의 선택에 따라 카메라부에서 촬영하여 얻어진 약의 이미지를 카메라부 로부터 전달받아서 복용자가 처방정보에 따라 복용해야할 약이 맞는지 여부를 판단할 수 있다. 여기서, 복용자가 복용하고자 하는 약의 선택이란, 약을 복용하기 위하여 약상자 또는 약봉지로부터 복용하기 위하여 약을 골라내는 것을 말한다. 그리고 판단제어부는 복용자에게 복용하고자 하는 약이 올바르게 선택되었는지 여부를 확인받을 것을 먼저 권고할 수도 있다. 복용시간이 되어 복용자에게 약을 복용할 시간이 되었음을 알리고, 처방정보에 따라 복용해야할 약으로서 올바 르게 선택하였는지 확인받을 것을 디스플레이장치를 통한 시각적 표시 또는 스피커를 통한 음성으로 권고한다. 복용자가 약을 확인받겠다고 음성으로 답변을 하면 복용자의 음성을 인식하고, 카메라부에 확인받을 약을 위치시켜줄 것을 출력부을 통해 안내한다. 복용자가 확인받고자 하는 약을 카메라부의 렌즈 앞에 위 치시키면 판단제어부의 제어에 따라 카메라부가 약을 촬영하고, 카메라부으로부터 약의 이미지 를 판단제어부가 전달받는다. 복용자의 선택인 확인요청에 의해, 처방정보에 따라 복용자가 복용해야할 약으로서 올바르게 선택되었는지 여부 의 판단은 판단제어부가 카메라부에서 촬영하여 얻어진 약의 이미지와 처방정보에 따라 복용해야할 약의 표준이미지를 비교하여 판단할 수 있다. 또한, 복용자가 복용하고자하는 약의 이미지와 처방정보에 따라 복용해야할 약의 표준이미지와의 일치율을 계산하여 알려주는 것 또한 가능하다. 여기서, 제약회사로부터 제공된 약의 이미지를 복약관리서버로부터 전달받아서 표준이미지로서 이용할 수도 있 으며, 복용자가 약을 복용하는 기간동안 복용시간별로 반복적으로 촬영되어 학습된 약의 이미지를 표준이미지로 서 이용할 수도 있다. 이러한 표준이미지는 판단제어부의 제어에 따라 후술할 저장부에 저장될 수 있 다. 판단제어부는 복용자가 복용하고자하는 약의 이미지와 처방정보에 따라 복용해야할 약의 표준이미지가 일 정 비율 이상으로 일치된다고 판단되면 복용자가 복용해야할 약으로서 올바르게 선택되었다고 판단한다. 처방정보에 따라 복용자가 복용해야할 약으로서 올바르게 선택된 것으로 판단되면, 판단제어부는 복용하여 도 좋다는 안내의 메시지를 출력부를 통해 복용자에게 제공한다.복용자가 복용해야할 약으로서 올바르게 선택되지 않았다고 판단되면, 복용자에게 약을 다시 선택할 것을 안내 한다. 이 때 불일치되는 약의 표준이미지를 출력부의 디스플레이장치를 통해 표시하여 복용자가 약을 다시 선택함에 있어서 올바르게 선택할 수 있도록 안내할 수 있다. 판단제어부는 처방정보를 토대로 하여 복용자의 복용여부를 확인 또는 판단을 하는데, 입력부를 통한 사용자의 입력이나 입력부에 포함된 마이크를 통해 감지되는 복용자의 음성을 인식하여 확인 또는 판단을 할 수 있다. 예를 들어 판단제어부는 처방정보에 따라 지정된 복약시간에 복용자에게 복약여부를 확인하는 질문을 음성 메시지로서 스피커를 통해 출력시킬 수 있으며, 이에 대한 복용자의 반응 즉, 복용자의 음성을 인식하여서 복용 자의 복용여부를 확인 또는 판단할 수 있다. 또는 복용자가 약을 복용하는 행동이나 동작을 인식하여 복용자의 약 복용여부를 확인 또는 판단할 수도 있다. 이처럼, 복약시각과 복약방법은 처방정보와 복약자의 반응과 동작, 현재 시간을 기반으로 하여 결정될 수 있으 며, 스피커 또는 디스플레이장치를 포함하는 출력부를 통해 약의 복용여부 문의와 권고가 이루어질 수 있 다. 그리고 복용자의 행동을 모니터링하여, 식사 전 혹은 식사 중 또는 식사 후에 약을 복용할 수 있도록 안내하여 준다. 복용자가 식사 중에 복용하여야 하는 당뇨약의 경우 복용자의 식사행동을 카메라부을 통해 확인하고, 식사 전 또는 식사 중에 약을 복용할 수 있도록 시각적 또는 청각적으로 알려줄 수 있다. 식사 후 30분에 복용하는 약의 경우, 복용자의 구두로 문의 또는 복용자의 식사행동 파악후 일정시간 경과시전 에 음성으로 복용시점을 알릴 수 있다. 그리고 복용자의 행동을 인식한 결과와, 약을 복용할 것은 안내하는 질문 및 답변의 내용을 판단하여 복약자의 복약여부를 확인할 수 있다. 그리고, 판단제어부는 복용자의 복약여부에 대한 정보를 복약기록에 포함시켜서 저장부에 저장하고 통신부을 통해 후술할 복약관리서버로 전송시킬 수 있다. 따라서, 처방전을 작성한 의사 또는 복용자의 보 호자가 복약관리서버로부터 복용자의 복약여부를 복약기록을 통해 확인할 수도 있다. 한 편, 처방전에 처방정보에 대한 바코드가 표기되어 있는 경우 처방전의 바코드를 스캐닝하여 복용자에 대한 처방정보를 얻을 수 있는 바코드스캐너부를 더 포함하는 형태도 가능하다. 그리고 판단제어부는 복용자가 약을 복용한 시간에 따라 다음 복약예정시간 또는 복약스케쥴을 조정할 수 도 있다. 예를 들어, 처방정보에 따라 지정된 복약시간과 복약자가 실제로 복약한 시간 차이를 산출하고, 산출 된 시간차에 따라서 다음 복용순번의 복용시간을 조정할 수 있다. 아울러 판단제어부는 복용자에 의해 입 력된 요일별 복약한 시간, 식사시간 등을 고려하여 복용시간을 조정할 수 도 있다. 복약시간을 조정하는 예로서, 복약여부를 묻는 음성메시지에 대해 복용자가 '30분 후에 약복용을 알려줘' 라고 답변하면, 판단제어부는 복용자의 답변을 음성인식하여 복용시간알람을 30분 후로 변경조정한다. 예를 들 어 12:00으로 설정되어 있던 복약시간이 30분 후인 12:30으로 변경설정된다. 이처럼 판단제어부는 음성인식을 통한 복약시간 또는 복용스케쥴을 조정 또는 관리할 수 있다. 그리고, 복 용자의 약 복용 패턴에 적응하여 복용관리를 할 수 있도록 할 수 있도록 딥러닝프로그램을 갖는 인공지능(A. I.)를 포함할 수 있다. 저장부는 앞서 언급한 바와 같이, 판단제어부의 제어에 따라 처방정보를 저장하거나 저장된 상기 처 방정보를 판단제어부로 전달하며, 처방정보에 따라 복용자가 복용해야할 약이 올바르게 선택되었는지 여부 를 판단제어부가 판단할 수 있도록 처방정보에 따라 복용해야할 약의 표준이미지가 저장되어 있다. 저장부는 복용자의 질환 및 증상에 대한 정보와 복용자의 복약 이력에 대한 정보, 복용자에게 처방된 약들 의 목록에 대한 정보, 약품들의 복약기간, 복약횟수, 복약시간, 복약방법, 주의사항 등에 대한 정보를 저장한다. 약품의 유통기한에 대한 정보도 저장될 수 있다. 출력부 판단제어부의 제어에 따라 복용자가 처방정보에 따른 약의 복용시간에 복용자가 약을 복용할 수 있도록 복용안내를 출력한다. 또한 복약자의 생체정보와 복용기록도 출력할 수 있다. 이러한 출력부에는 디스플레이장치가 포함된다. 디스플레이장치는 복용자가 처방정보에 따른 약의 복용시간, 복용자가 복용하고자 하는 약이 처방정보에 따라 복용해야할 약이 올바르게 선택되었는지 여부 및 복용자의 상기 생체정보를 복용자에게 시각적으로 제공하여 준 다. 그리고, 출력부에는 스피커가 포함된다. 출력부의 스피커는 복용자가 처방정보에 따른 약의 복용시간, 복용자가 복용하고자 하는 약이 처방정보에 따라 복용해야할 약이 맞는지 여부 및 복용자의 생체정보 를 복용자에게 청각적으로 제공하여 준다. 여기서, 생체정보에는 복용자의 체온, 혈압, 맥박수 및 혈당량 중 적어도 어느 하나 이상이 포함된 것이 바람직 하다. 측정부는 전기적으로 연결된 판단제어부의 제어에 따라 복용자로부터 복용자의 생체정보를 얻는다. 이러한 측정부에는 광센서로 측정할 수 있는 체온계 또는 혈류측정장치나 맥박측정장치 등이 포함될 수 있 으며, 혈당량 측정기 또는 혈압측정기도 역시 포함될 수 있다. 판단제어부는 측정부에서 측정하여 얻어진 생체정보를 복용자의 복용기록에 포함시켜서 저장부 에 저장시킨다. 따라서, 복용자가 약을 복용할 당시의 체온, 맥박수, 혈압, 혈당량 등과 같은 생체정보를 복용 기록을 확인할 때 함께 확인할 수도 있으며, 약을 복용하는 기간 동안의 체온, 맥박수, 혈압, 혈당량 등의 변화 추이를 확인할 수도 있다. 예를 들어, 생체정보로서 복용자의 체온이 측정된 경우에 판단제어부는, 복용자의 체온이 정상체온범위 내 에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 복용자의 체온측정치와 함께 비교하여 시간의 흐름에 따른 상기 복용자의 체온의 변화추이를 판단한다. 정상체온범위는 섭씨 35.8도 내지 37.2도로 알려져 있다. 따라서, 복용자의 측정된 체온이 정상체온범위는 섭씨 35.8도 내지 37.2도 사이의 범위에 속하는지 여부를 판단제어부가 판단을 한다. 그리고, 판단제어부는 복용자의 체온, 복용자의 체온이 정상체온범위 내에 속하는지 여부 및 과거에 측정 되어 저장된 복용자의 체온 측정치와의 비교를 통하여 얻어지는 체온의 변화추세 중 적어도 어느 하나 이상을 디스플레이장치 또는 스피커가 출력하도록 제어할 수 있다. 즉, 시간의 흐름에 따른 복용자의 체온의 변화추이는, 과거의 측정된 복용자의 체온 측정치와 현재 측정된 복용 자의 체온 측정치를 종합하여 시간의 흐름에 따라 복용자의 체온이 감소추세에 있는지 또는 증가추세에 있는지 를 판단하고 복용자에게 안내하여 줄 수 있다. 또한, 약복용시간 별 체온의 그래프를 디스플레이장치로 표시하여 복용자에게 보여줄 수도 있다. 또한 직전의 약복용시 측정된 복용자의 체온에 비하여 현재 약복용시 측정된 복용자의 체온이 높은지 낮은지 그리고 정상체 온범위 내에 있는지 아닌지를 스피커를 통해 안내할 수도 있다. 여기서, 복용자의 처방정보에 따라 복용해야할 약에 해열제가 포함되어 있고, 복용자의 체온이 정상체온범위 내 에 있는 것으로 측정된 경우, 판단제어부는 복용자에게 복용자의 체온이 정상체온임을 안내하면서 처방전 을 작성한 의료인에게 재진찰을 받아볼 것을 권고하는 안내를 디스플레이장치 또는 스피커가 출력하도록 제어할 수 있다. 그리고, 생체정보로서 복용자의 혈압이 측정된 경우에 판단제어부는 복용자의 혈압이 정상혈압범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 복용자의 혈압측정치와 함께 비교하여 시간의 흐 름에 따른 복용자의 혈압의 변화추이를 판단한다. 그리고 판단제어부는 복용자의 혈압, 복용자의 혈압이 정상혈압범위 내에 속하는지 여부 및 과거에 측정되 어 저장된 복용자의 혈압 측정치와의 비교를 통하여 얻어지는 혈압의 변화추이 중 적어도 어느 하나 이상을 디 스플레이장치 또는 스피커가 출력하도록 제어한다. 정상혈압범위는 수축기 120mmHg 미만, 이완기 80mmHg미만 로 알려져 있으며, 저혈압은 수축기 90mmHg 미만, 이 완기 60mmHg 미만이고, 고혈압전단계는 수축기 120 ~ 139mmHg 미만 , 이완기 80~89mmHg 미만이며, 고혈압은 수 축기 140mmHg 초과, 이완기 90mmHg 초과인 것으로 알려져 있다. 따라서, 판단제어부는 복용자의 측정된 혈압이 정상혈압범위에 속하는지 여부 또는 고혈압, 고혈압전단계, 저혈압 중 어느 단계에 속하는지를 판단을 하고, 복용자에게 복용자의 혈압을 안내하여 준다.시간의 흐름에 따른 복용자의 혈압의 변화추이는, 과거의 측정된 복용자의 혈압 측정치와 현재 측정된 복용자의 혈압 측정치를 종합하여 시간의 흐름에 따라 복용자의 혈압이 감소추세에 있는지 또는 증가추세에 있는지를 판 단하고 복용자에게 안내하여 줄 수 있다. 또한, 판단제어부는 약복용시간 별 복용자의 측정된 혈압의 그래프를 디스플레이장치로 표시하여 복용자에 게 보여줄 수도 있다. 또한 직전의 약복용시 측정된 복용자의 혈압에 비하여 현재 약복용시 측정된 복용자의 혈 압이 높은지 낮은지 그리고 정상혈압범위 내에 있는지 아닌지를 스피커를 통해 안내할 수도 있다. 여기서, 복용자의 처방정보에 따라 복용해야할 약에 혈압제가 포함되어 있지 않으나, 복용자의 혈압이 고혈압범 위에 있는 것으로 측정된 경우, 판단제어부는 복용자에게 복용자의 혈압이 고혈압에 해당됨을 안내하면서 처방전을 작성한 의료인에게 혈압진찰을 받아볼 것을 권고하는 안내를 디스플레이장치 또는 스피커가 출력하도 록 제어할 수 있다. 그리고, 생체정보로서 복용자의 맥박수가 측정된 경우에 판단제어부는, 복용자의 맥박수가 정상맥박수범위 내에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 복용자의 맥박수의 측정치와 함께 비교하여 시간의 흐름에 따른 복용자의 맥박수의 변화추이를 판단한다. 그리고, 판단제어부는 복용자의 맥박수, 복용자의 맥박수가 정상맥박수의 범위 내에 속하는지 여부 및 과 거에 측정되어 저장된 복용자의 맥박수 측정치와의 비교를 통하여 얻어지는 맥박수의 변화추이 중 적어도 어느 하나 이상을 디스플레이장치 또는 스피커가 출력하도록 제어할 수 있다. 정상맥박수의 범위는 성인 남성의 경우 70~90회/분 이고 성인 여성의 경우 70~85회/분으로 알려져 있다. 영유아 의 경우 분당 100~140회, 초등학생의 경우 70~110회, 고령의 경우 60~70회 로 알려져 있다. 따라서, 복용자의 측정된 맥박수가 정상맥박수범위에 속하는지 여부를 판단제어부가 판단을 한다. 판단제어부는 복용자의 맥박수, 복용자의 맥박수가 정상맥박수범위 내에 속하는지 여부 및 과거에 측정되 어 저장된 복용자의 맥박수 측정치와의 비교를 통하여 얻어지는 맥박수의 변화추세 중 적어도 어느 하나 이상을 디스플레이장치 또는 스피커가 출력하도록 제어할 수 있다. 즉, 시간의 흐름에 따른 복용자의 맥박수의 변화추이는, 과거의 측정된 복용자의 맥박수 측정치와 현재 측정된 복용자의 맥박수 측정치를 종합하여 시간의 흐름에 따라 복용자의 맥박수가 감소추세에 있는지 또는 증가추세에 있는지를 판단하고 복용자에게 안내하여 줄 수 있다. 또한, 판단제어부는 약복용시간 별 맥박수의 그래프를 디스플레이장치로 표시하여 복용자에게 보여줄 수도 있다. 또한 직전의 약복용시 측정된 복용자의 맥박수에 비하여 현재 약복용시 측정된 복용자의 맥박수가 높은지 낮은지 그리고 정상맥박수범위 내에 있는지 아닌지를 스피커를 통해 안내할 수도 있다. 측정된 복용자의 맥박수가 정상맥박수범위로부터 너무 높거나 너무 낮은 것으로 판단된 경우 판단제어부는 측정된 복용자의 맥박수에 대한 안내와 함께 정상맥박수범위로부터 너무 높거나 너무 낮다고 안내하면서 처방전 을 작성한 의료인에게 진찰을 받아볼 것을 권고하는 안내를 디스플레이장치 또는 스피커가 출력하도록 제어할 수 있다. 또한 생체정보로서 복용자의 혈당량이 측정된 경우에 판단제어부는 복용자의 혈당량이 정상혈당량범위 내 에 속하는지 여부 또는 적어도 1회 이상 과거에 측정되어 저장된 복용자의 혈당량 측정치와 함께 비교하여 시간 의 흐름에 따른 복용자의 혈당량의 변화추이를 판단한다. 그리고, 판단제어부는 복용자의 혈당량, 복용자의 혈당량이 정상혈당량범위 내에 속하는지 여부 및 과거에 측정되어 저장된 복용자의 혈당량 측정치와의 비교를 통하여 얻어지는 혈당량의 변화추세 중 적어도 어느 하나 이상을 디스플레이장치 또는 스피커가 출력하도록 제어할 수 있다. 이때 정상혈당량범위는 공복시에는 100mmg/dL 미만이고, 식후 2시간후는 140mg/dL 미만이므로 복용자가 식사 전 인지 식사 후인지에 따라 정상혈당량범위를 달리 적용하여 혈당량이 정상혈당량범위 내에 속하는지 여부를 판단 한다. 복용자가 식사 전인지 식사 후인지의 여부는, 예를 들어, 판단제어부의 제어에 따르는 디스플레이장치나 스피커를 통해 복용자에게 식사 여부를 확인하는 질문에 대한 복용자의 답변으로부터 파악할 수도 있으며, 식사 시간과 약을 복용하려는 현재의 시간으로부터 판단할 수도 있다.측정된 복용자의 혈당량이 정상적인 혈당량 범위보다 높게 측정되면 판단제어부는 측정된 혈당량에 대한 안내를 하면서 처방전을 작성한 의료인에게 혈당량에 관한 진찰을 받아볼 것을 권고하는 안내를 디스플레이장치 또는 스피커가 출력하도록 제어할 수 있다. 통신부는 판단제어부의 제어에 따라 저장부에 저장된 복용기록을 복약관리서버로 전송할 수 있다. 그리고 통신부는 복약관리서버로부터 복약자의 복약을 관리하기 위한 정보를 수신할 수도 있다. 그리고, 이러한 복약관리장치에 입력부를 더 포함하는 형태도 충분히 가능하다. 입력부는 복용자로부터 복용시간 또는 복용기록의 내용에 대한 제공요청을 입력받기 위하여 마련될 수 있 다. 이러한 입력부에는 마이크(mic)가 마련될 수 있다. 마이크는 복용자의 음성을 감지하기 위한 것으로, 복용자의 복용관련 정보제공요청 또는 복용자의 복약여부에 대한 복용자의 음성을 감지한다. 복용자가 복용시간이나 복용기록에 대한 확인이 필요한 경우 복용자가 질문을 하면, 질문이 마이크를 통해 입력 되어 판단제어부로 전달된다. 판단제어부는 마이크를 통해 입력받은 질문을 인식하고, 복용자의 질문 에 대응되는 답변을 출력부인 스피커를 통해 답변의 형태로 알려주거나 디스플레이장치를 통해 답변내용을 표시할 수도 있다. 예를 들어, 복용자가 복용시간이 얼마나 남았는지 물으면 마이크가 복용자의 음성을 감지한다. 그리고 마이크로 감지된 복용자의 음성이 전기적 신호로 판단제어부에 전달되고 판단제어부는 복용자의 음성을 인식하 게 된다. 그리고 복용시간에 대한 복용자의 정보제공요청을 판단제어부로 전달한다. 판단제어부는 복용자의 요 청에 따라 현재시간과 복용시간을 파악하고 출력부인 스피커나 디스플레이장치를 통해 복용시간을 복용자 에게 알려줄 수 있다. 이러한 복약관리장치는 복용자의 처방전으로부터 처방정보를 얻을 수 있고, 약의 이미지를 학습할 수 있다. 그리고 현재시간, 복용자의 행동분석, 복용자와의 질의 및 답변의 대화분석을 통해 약 복용시간을 환자에 게 안내할 수 있다. 필요에 따라서는 처방정보에 따른 올바른 약이 선택되었는지 여부를 확인받을 것을 권고할 수 있으며. 복용자의 선택에 따라 복용자가 선택한 약이 올바르게 선택되었는지 여부를 판단하여 복용자에게 안내할 수 있다. 그리고 복용자의 행동을 인식하여 복용자의 복용패턴을 학습하고, 복용자의 복용패턴에 따라 복용자에게 약의 복용을 안내할 수도 있다. 다음으로 이와 같은 복약관리장치를 이용한 복약관리방법에 대하여 도 2를 더 참조하여 설명하기로 하며, 후술할 복약관리방법에 대한 설명을 통하여 본 발명의 실시 예에 따른 복약관리장치도 좀 더 이해될 수 있다. 도 2는 본 발명의 실시 예에 따른 복약관리장치를 이용한 복약관리방법을 개략적으로 나타낸 순서도이다. 도 2를 더 참조하면, 본 발명의 실시 예에 따른 복약관리장치를 이용한 복약관리방법은 처방정보획득단계, 복용 안내단계, 복용약확인단계 및 복용여부확인단계를 포함한다. 처방정보획득단계에서는 복용자에 대한 처방정보를 복약관리장치가 입력받거나 전달받는다(S100). 복용자 에 대한 약의 처방정보는 처방전을 통해 입력받을 수 있다. 즉, 복약관리장치의 카메라부를 통해 처 방전을 촬영하여 처방전에 기재된 처방정보를 입력받을 수 있다. 카메라부에서 촬영된 처방전 이미지는 판단제어부으로 전달된다. 판단제어부는 OCR(Optical Character Recognition)프로그램에 따라 처방전에 문자로 기재된 처방정보를 인식하여 입력받는다. 판단제어부 는 입력된 처방정보를 저장부에 저장시킨다. 또는 복약관리장치가 복약관리서버로부터 처방정보를 전달받는 것도 충분히 가능하다. 복약관리서버 로부터 전달받은 처방정보도 판단제어부에 의해 저장부에 저장될 수 있다. 이와 같이 복약관리장치가 처방정보를 입력받음으로써 처방정보에 포함된 복용시간과 복용할 약을 파악할 수 있다.그리고, 복용안내단계에서는 처방정보획득단계에서 얻어진 처방정보에 따른 약의 복용시간이 되면(S110), 복용 자가 약을 복용할 수 있도록 복용안내를 제공한다(S120). 즉, 복약관리장치의 판단제어부가 현재시각이 처방정보에 따른 복용시간이 되었는지 판단을 하고 (S110), 복용시간이 되었다고 판단되면 출력부를 통해 복용자가 복용시간임을 인지할 수 있도록 복용안내 를 제공한다(S120)는 것이다. 복용안내는 판단제어부의 제어에 따라 출력부에 포함되는 스피커 또는 디스플레이장치를 통해 복용자 에게 복용안내를 제공할 수 있다. 스피커를 통하여 제공되는 복용안내는 청각적으로 제공될 수 있다. 예를 들어, \"아침 식사 전에 당뇨약 드실 시 간입니다\", \" 주무실 시간입니다. 취침 전에 드실 약이 있습니다.\" 와 같이 대화의 형태로 약의 복용을 안내할 수 있다. 디스플레이장치를 통해 제공되는 복용안내는 시각적으로 제공될 수 있다. 디스플레이 화면에 주무실 시간입니다. 취침 전에 드실 약이 있습니다.\"와 같은 문구를 표시할 수도 있으며, 복용자가 복용해야할 약의 이 미지를 화면으로 표시하여 보여줄 수도 있다. 복용해야할 약의 이미지를 화면에 미리 표시해 줌으로써 복용자가 복용해야할 약을 좀 더 쉽게 선택할 수 있도록 도와줄 수 있다. 이어서 복용약확인단계에서는 복용안내단계에서 복용안내를 받은 복용자의 선택에 따라 복용하고자 하는 약의 이미지와 처방정보에 따라 복용자가 복용해야할 약의 표준이미지를 비교하여 처방정보에 따라 복용해야할 약으 로서 올바르게 선택되었는지 여부를 판단하고 복용자에게 안내한다. 그리고, 복용약확인단계에서는 복용자로부터 복용자의 생체정보를 측정하여 얻는다. 복용자의 생체정보 측정은 복용자가 복용하려는 약을 카메라부가 촬영할 때 병행적으로 측정부가 복용자의 생체정보를 측정하여 이루어질 수 있다. 측정부에서 측정하여 얻어진 복용자의 생체정보는 후술할 복용여부확인단계(S160)에서 복용기록에 포함되 어 저장부에 저장된다. 도 3은 본 발명의 실시 예에 따른 복약관리장치를 이용하여 복용자가 복용하고자 하는 약을 확인받는 모습을 개 략적으로 나타낸 도면이다. 도 3에 나타낸 바와 같이 복용자가 복용하고자 하는 약(d1, d2, d3, d4)을 손바닥에 놓고 카메라부의 렌즈 앞에 위치시키면 카메라부는 약(d1, d2, d3, d4)을 촬영하여 약의 이미지를 얻을 수 있다(S130). 카메라부 에서 촬영하여 얻어진 약(d1, d2, d3, d4)의 이미지는 판단제어부으로 전달된다. 판단제어부는 복용자의 선택에 따라 복용자가 복용하고자 하는 약(d1, d2, d3, d4)의 이미지와 처방정보에 따라 복용자가 복용해야할 약의 표준이미지를 비교하여 처방정보에 따라 복용해야할 약으로서 올바르게 선택되 었는지 여부를 판단한다(S140). 처방정보에 따라 복용해야할 약의 표준이미지와 불일치하는 것으로 판단되면, 판단제어부는 불일치된 것으 로 판단되 처방정보에 따른 약의 표준이미지를 디스플레이장치를 통해 표시하여 복용자에게 안내하면서 처방정 보에 따른 올바른 약을 선택할 수 있도록 안내를 한다(S145). 따라서, 복용자는 디스플레이장치에 표시된 약의 표준이미지를 보고 올바른 약을 다시 선택하여 복용준비를 할 수 있다. 처방정보에 따른 약에 일치되는 약을 올바르게 선택되었다고 판단되면, 후술할 다음 단계인 복용여부확인단계에 따라 현재 복용자가 선택한 약이 정확하게 선택되었으며 복용가능함을 복용자에게 안내하고 선택된 약을 복용하 였는지 여부를 확인한다(S150). 그리고, 카메라부가 복용자의 손바닥에 놓여있는 약을 촬영하는 동안에 복용자의 손목부위로부터 측정부 가 복용자의 생체정보를 측정하여 얻을 수 있다(S130). 여기서, 생체정보에는, 복용자의 체온, 혈압, 맥박수 및 혈당량 중 적어도 어느 하나 이상이 포함된 것이 바람 직하다. 예를 들어, 복용자의 체온, 맥박수, 혈류량 또는 혈압과 같은 생체정보를 측정하여 얻을 수 있다는 것이다. 물 론 혈당측정기가 측정부에 포함된 경우 매 복용시간 마다 혈당량을 측정하는 것 또한 충분히 가능하다. 복용여부확인단계에서는 앞서 언급한 바와 같이 복용약확인단계에서 처방정보에 따라 복용해야할 약으로서 올바 르게 선택된 약을 복용자가 복용하였는지 여부를 확인(S150)하고 복용기록을 업데이트하여 저장한다(S160). 그 리고 복용여부확인단계에서 업데이트하여 저장되는 복용기록에 생체정보를 포함시켜서 저장한다(S160). 그리고 판단제어부는 처방정보에 따라 다음 복용차례로서 복용할 예정인 약이 남아있는지를 여부를 처방정 보로부터 확인한다(S170). 다음 복용차례로서 복용할 예정인 약이 남아 있는 것으로 확인되면 판단제어부 는 앞서 설명한 처방정보획득(S100) 이후의 단계를 다시 반복하여 수행한다. 처방정보에 따라 다음 복용차례로서 복용할 예정인 약이 더 이상 남아있지 않는 것으로 확인되면, 판단제어부 는 출력부의 디스플레이장치와 스피커를 통해 처방받은 약을 모두 복용하였음을 안내하고, 의사로부 터 재진찰 받아서 그에 따라 처방을 다시 받아볼 것을 권장하는 안내를 할 수 있다. 이와 같이 복약관리장치를 통해 기본적인 복약관리방법이 수행될 수 있다. 따라서, 다음의 몇가지 예와 같은 행동인식, 음성질의 및 답변 대화가 구현될 수 있다. 예 1) 복약관리장치 \"안녕히 주무셨나요? 아침 식사 하시기 전에 당뇨약을 드셔야할 시간입니다.\"하고 안내되고, 복용자가 \"아침식사를 1시간 후에 하려고 하니 1시간후에 다시 알려줘. \"라고 답변이 된 경우, 복약관리장치 가 복용자의 답변을 인식하고 1시간 후에 다시 복용안내를 한다. 예 2) 복약관리장치가 현재 시각과 식탁에 밥상을 셋팅하는 복용자의 행동을 인식하여, 복용자가 식사 준비하는 것으로 판단한 경우 \" 식사하실건가요? 식사하시기전에 당뇨약 먼저 드세요 \" 라고 복약할 것을 권유할 수도 있 다. 예3) 복약관리장치가 복용자의 침실 이동시간과 동작을 인식하여 \" 주무실 건가요? \" 하고 질문을 하고, \"응\" 또는 \"그래\" 라는 복용자의 답변이 인식되면 \"취침전에 드셔야할 약이 있으니 약을 복용하고 주무세요 \" 라고 약을 복용할 것을 안내할 수도 있다. 한 편, 복용자의 요청에 따라 복용기록을 복용자가 파악할 수 있도록 외부로 표시할 수도 있다. 예를 들어, 출 력부에 포함되는 디스플레이장치를 통해 시각적으로 표시할 수 있다. 도 4는 본 발명의 실시 예에 따른 복약관리장치의 디스플레이를 통해 표시될 수 있는 생체정보의 일 예를 개략 적으로 나타낸 도면이다. 도 4에서 참조되는 바와 같이, 복용자가 과거의 복용시간에 약을 복용할 때의 생체정보인 체온을 측정 확인함으 로써 복용자의 몸상태를 파악하는데 도움이 되며, 생체정보인 체온의 변화추이를 통해 향후의 변화를 추측할 수 도 있다. 생체정보로서 복용자의 체온이 측정된 경우, 복용자의 체온이 정상체온범위 내에 속하는지 여부 또는 적어도 1 회 이상 과거에 측정되어 저장된 복용자의 체온측정치와 함께 비교하여 시간의 흐름에 따른 복용자의 체온의 변 화추이를 판단한다. 정상체온범위는 섭씨 35.8도 내지 37.2도로 알려져 있다. 따라서, 복용자의 측정된 체온이 정상체온범위는 섭씨 35.8도 내지 37.2도 사이의 범위에 속하는지 여부를 판단을 한다. 그리고, 복용자의 체온, 상기 복용자의 체온이 정상체온범위 내에 속하는지 여부 및 과거에 측정되어 저장된 상 기 복용자의 체온 측정치와의 비교를 통하여 얻어지는 체온의 변화추세 중 적어도 어느 하나 이상을 디스플레이 장치 또는 스피커가 출력할 수 있다. 즉, 시간의 흐름에 따른 복용자의 체온의 변화추이는, 과거의 측정된 복용자의 체온 측정치와 현재 측정된 복용 자의 체온 측정치를 종합하여 시간의 흐름에 따라 복용자의 체온이 감소추세에 있는지 또는 증가추세에 있는지 를 판단하고 복용자에게 안내하여 준다. 또한, 약복용시간 별 체온의 그래프를 디스플레이장치로 표시하여 복용자에게 보여줄 수도 있다. 또한 직전의 약복용시 측정된 복용자의 체온에 비하여 현재 약복용시 측정된 복용자의 체온이 높은지 낮은지 그리고 정상체온범위 내에 있는지 아닌지를 스피커를 통해 안내할 수도 있다. 도 4에 도시된 바와 같은 체온의 변화그래프를 통해 해열제를 식후 30분이내인 매 복용시간마다 복용하였을 때 체온의 감소 추세와 정상체온의 범위(즉, 섭씨 35.8도 내지 섭씨 37.2도 사이의 범위)를 확인할 수 있으며, 다 음 복용시간 때의 체온이 어느 정도 수준에 있을 것인지 예측할 수 있다. 여기서, 복용자의 처방정보에 따라 복용해야할 약에 해열제가 포함되어 있고, 복용자의 체온이 정상체온범위 내 에 있는 것으로 측정된 경우, 복용자에게 복용자의 체온이 정상체온임을 안내하면서 처방전을 작성한 의료인에 게 재진찰을 받아볼 것을 권고하는 안내를 할 수 있다. 그리고, 처방전을 작성한 의사와 같은 의료인이 복용자의 복용기록을 확인할 수 있도록, 복용여부확인단계에서, 복용자의 생체정보가 포함되어 기록된 복용기록을 복약관리서버로 전송할 수도 있다. 따라서, 처방전을 작성한 의료인은 복용자에 대하여 좀 더 정확한 진단을 하는데 도움을 받을 수 있다. 도 5는 본 발명의 실시 예에 따른 복약관리장치를 포함하는 복약관리시스템을 개략적으로 나타낸 도면이다. 도 5를 더 참조하면, 본 발명의 실시 예에 따른 복약관리장치를 이용한 복약관리시스템은 복약관리장치, 복약관리서버 및 의료단말기을 포함한다. 의료단말기는 의사가 환자의 질환 및 증상, 환자에게 처방된 약품들의 목록, 약품들 각각의 복약기간, 복약횟수, 복약시간, 복약방법 및 주의사항 등을 입력하기 위한 것으로, 복약관리서버와 유/무선을 통해 연결되며 의사가 입력한 정보들을 복약관리서버로 전송할 수 있다. 그리고 의료단말기를 통해 의사는 복약관리서버에 저장된 정보들을 조회하여 볼 수 있다. 복약관리서버는 의료단말기 또는 복약관리장치으로부터 정보를 수신하고 이를 저장한다. 복약관 리서버는 각 환자의이름, 주민등록번호 또는 ID, 주소, 전화번호 등을 포함하는 복용자 정보와 각 환자(즉, 복용자)의 질환 및 증상에 대한 정보와 각 환자의 복약이력에 대한 정보, 각 환자에게 처방된 약품들 의 목록에 대한 정보, 처방된 약품들의 복약기간, 복약횟수, 복약시간, 복약방법, 주의사항 등에 대한 처방정보 를 저장한다. 또한 복약관리서버는 제조사로부터 제공된 각 약품들의 표준이미지, 일반적인 복약횟수, 복 약시간, 복약방법, 주의사항 등에 대한 정보도 저장할 수 있다. 복약관리장치의 저장부에 저장된 복약기록은 복약관리서버로 전송될 수 있으며, 복약관리서버 의 저장부에 저장된다. 그리고, 처방전을 작성한 의사가 의료단말기를 이용하여 복약관리서버에 접속할 수 있다. 복약관리서버에 접속된 의료단말기는 복약관리서버으로부터 복약자의 복약기록을 전달받고, 의 사가 복약기록을 확인할 수 있도록 전시할 수 있다. 여기서, 복용자가 복용 당시 측정된 체온, 혈당량, 혈압과 같은 생체정보가 복약기록에 포함되어 있으므로 의사는 복약기록을 확인하면서 복용자의 생체정보도 확인해볼 수 있다. 의사는 복약기록을 통해 복약자가 처방약을 복용하는 기간 동안 처방약을 정해진 복용시간에 잘 맞춰 복용을 했 는지 여부와 처방약 복용시 복용자의 생체정보를 통해 복용자의 상태를 체크할 수 있으므로 진료계획 수립 또는 복용자에 대한 진찰에 도움을 준다. 한 편, 상술한 본 발명의 실시 예는 컴퓨터 시스템에서 구현될 수도 있다. 도 6은 본 발명의 실시 예가 구현될 수 있는 컴퓨터 시스템을 개략적으로 나타낸 도면이다. 도 6에서 참조되는 바와 같이, 컴퓨터 시스템은 버스를 통하여 서로 통신하는 하나 이상의 프로세서, 메모리, 사용자 인터페이스 입력 장치, 사용자 인터페이스 출력장치 및 스토리을 포함할 수 있다. 또한, 컴퓨터 시스템은 네트워크에 연결되는 하나 이상의 네트워크 인터페이스를 더 포함할 수 있다. 프로세서는 중앙처리장치 또는 메모리 또는 스토리지에 저장된 프로세싱 인스트럭션들을 실행하 는 반도체 장치일 수 있다. 메모리 및 스토리지는 다양한 형태의 휘발성 또는 비휘발성 저장매체일 수 있다. 예를 들어 메모리는 ROM이나 RAM을 포함할 수 있다. 그리고 IoT 시대를 대비하여 컴퓨터 시스템을 소형 컴퓨팅 디바이스로 구현시킨 경우, 컴퓨팅 디바이스에 이더넷 케이블을 연결하면 무선공유기처럼 동작해서 모바일 디바이스가 무선으로 게이트웨이에 붙어서 암호복호 화 기능을 할 수 있으므로, 이를 위해 컴퓨터 시스템은 무선 통신 칩(wi-fi 칩)을 추가로 포함할 수있다. 따라서 본 발명의 실시 예는 컴퓨터로 구현된 방법이나 컴퓨터에서 실행가능한 명령어들이 기록된 비일시적인, 컴퓨터에서 읽을 수 있는 매체로 구현될 수도 있다. 컴퓨터에서 읽을 수 있는 명령어들이 프로세서에 의해서 수 행될 때 컴퓨터에서 읽을 수 있는 명령어들은 본 발명의 적어도 한 가지 태양에 따른 방법을 수행할 수도 있다. 이와 같이, 본 발명의 실시 예에 따른 복약관리장치 및 이를 이용한 복약관리방법 및 복약관리시스템에 따르면, 복용자의 처방전에 따른 복약의 정확성과 효율성을 증진시키는데 도움이 되는 장점이 있다. 이상에서 설명된 바와 같이, 본 발명에 대한 구체적인 설명은 첨부된 도면을 참조한 실시 예들에 의해서 이루어 졌지만, 상술한 실시 예들은 본 발명의 바람직한 실시 예를 들어 설명하였을 뿐이기 때문에, 본 발명이 상기의 실시 예에만 국한되는 것으로 이해되어져서는 아니되며, 본 발명의 권리범위는 후술하는 청구범위 및 그 등가개 념으로 이해되어져야 할 것이다."}
{"patent_id": "10-2020-0066269", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 복약관리장치를 개략적으로 나타낸 블록도이다. 도 2는 본 발명의 실시 예에 따른 복약관리장치를 이용한 복약관리방법을 개략적으로 나타낸 순서도이다. 도 3은 본 발명의 실시 예에 따른 복약관리장치를 이용하여 복용자가 복용하고자 하는 약을 확인받는 모습을 개 략적으로 나타낸 도면이다. 도 4는 본 발명의 실시 예에 따른 복약관리장치의 디스플레이를 통해 표시될 수 있는 생체정보의 일 예를 개략 적으로 나타낸 도면이다. 도 5는 본 발명의 실시 예에 따른 복약관리장치를 포함하는 복약관리시스템을 개략적으로 나타낸 도면이다. 도 6은 본 발명의 실시 예가 구현될 수 있는 컴퓨터 시스템을 개략적으로 나타낸 도면이다."}
