{"patent_id": "10-2023-0031665", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0138222", "출원번호": "10-2023-0031665", "발명의 명칭": "캠핑용품 판매관리 시스템", "출원인": "주식회사 헬로스팩토리", "발명자": "윤상영"}}
{"patent_id": "10-2023-0031665", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "각 캠핑장에 구비된 복수의 카메라들을 통해 촬영된 복수의 캠핑이미지들을 전송받아 저장 DB에 수집하는 수집부;상기 복수의 캠핑이미지들 각각으로부터 검출된 캠핑용품객체를 웹을 통해 이미지검색하여 캠핑 용품 정보를 탐색하는 탐색부;상기 캠핑용품객체로부터 일정거리 이격된 인물객체를 분류하는 인공지능 기반의 고객분류 모델을 통해 고객 유형 정보를 도출하고, 상기 고객 유형 정보와 상기 캠핑 용품 정보를 소스데이터로 병합하여 리스트화하는 데이터관리부; 및상기 고객단말로부터 캠핑용품 쇼핑몰 사이트를 통해 입력받는 고객정보로부터 확인된 고객 유형 정보에 기초하여, 기등록된 복수의 캠핑용품들로부터 맞춤형 캠핑용품을 추출하여 메인 광고 대상으로 상기 고객단말에 제공하는 통합서비스부를 포함하는, 캠핑용품 판매관리 시스템."}
{"patent_id": "10-2023-0031665", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 통합서비스부는 상기 고객단말로부터 상기 캠핑용품 쇼핑몰 사이트를 통해 입력받는 캠핑장정보에 기초하여, 상기 복수의 캠핑이미지들로부터 해당 위치에 대응되는 적어도 하나의 캠핑이미지를 추출하고 각 캠핑이미지에 캠핑 용품 정보를 태깅하여 상기 고객단말에 제공하는, 캠핑용품 판매관리 시스템."}
{"patent_id": "10-2023-0031665", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 통합서비스부는 상기 캠핑용품 쇼핑몰 사이트를 통해 고객단말로부터 주문받는 어느 하나의 캠핑용품에 기초하여, 예약 가능한 캠핑장 예약서비스를 상기 고객단말에 제공하는 서비스제공부;상기 고객단말로부터 상기 캠핑장 예약서비스를 통해 입력받는 예약정보에 응답하여, 상기 예약정보로부터 확인된 해당 캠핑장의 후기리뷰 커뮤니티로 페이지 전환시키는 웹페이지관리부; 및 상기 후기리뷰 커뮤니티로부터 기설정된 횟수 이상 검출되는 키워드에 연관된 캠핑용품들을 탐색하여, 상기 고객단말에 맞춤형 기획 상품 세트 정보로 제공하는 맞춤형상품 제공부를 포함하는, 캠핑용품 판매관리 시스템."}
{"patent_id": "10-2023-0031665", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 캠핑용품 판매관리 시스템에 관한 것으로, 보다 상세하게는 캠핑용품 쇼핑몰 사이트를 통해 입력받는 고객정보에 기초하여, 맞춤형 캠핑용품을 추출하여 메인 광고 대상으로 제공할 수 있는 캠핑용품 판매관리 시스 템에 관한 것이다. 이를 위해, 캠핑용품 판매관리 시스템은 각 캠핑장에 구비된 복수의 카메라들을 통해 촬영된 (뒷면에 계속)"}
{"patent_id": "10-2023-0031665", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 캠핑용품 판매관리 시스템에 관한 것으로, 보다 상세하게는 캠핑용품 쇼핑몰 사이트를 통해 입력받는 고객정보에 기초하여, 맞춤형 캠핑용품을 추출하여 메인 광고 대상으로 제공할 수 있는 캠핑용품 판매관리 시스 템에 관한 것이다."}
{"patent_id": "10-2023-0031665", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 캠핑이 늘어나고 있으며, 이러한 변화는 야외 활동의 참여를 활발하게 만들었고, 그 중 캠핑은 심신의 경 험을 통해서 내적 즐거움 및 삶의 만족감, 행복감을 느낄 수 있는 여가 활동으로 인지되고 있다."}
{"patent_id": "10-2023-0031665", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이에 따라 해당 기술분야에 있어서는 캠핑지에서 제공되는 캠핑용품의 판매, 대여, 중고판매, 장비보관, 셀프텐 트세척, 바비큐판매 등의 서비스와 더불어 사용자 맞춤형 캠핑용품을 제공하도록 하기 위한 기술개발이 요구되고 있다."}
{"patent_id": "10-2023-0031665", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로서, 본 발명의 목적은 캠핑용품 쇼핑몰 사이트를 통해 입 력받는 고객정보에 기초하여, 맞춤형 캠핑용품을 추출하여 메인 광고 대상으로 제공할 수 있는 캠핑용품 판매관 리 시스템을 제공하기 위한 것이다. 본 발명의 상기 및 다른 목적과 이점은 바람직한 실시예를 설명한 하기의 설명으로부터 분명해질 것이다."}
{"patent_id": "10-2023-0031665", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 일실시예에 따른 캠핑용품 판매관리 시스템은 각 캠핑장에 구비된 복수의 카메라들을 통해 촬영된 복수의 캠핑이미지들을 전송받는 저장 DB에 수집하는 수집부, 상기 복수의 캠핑 이미지들 각각으로부터 검출된 캠핑용품객체를 웹을 통해 이미지검색하여 캠핑 용품 정보를 탐색하는 탐색부, 상기 캠핑용품객체로부터 일정거리 이격된 인물객체를 분류하는 인공지능 기반의 고객분류 모델을 통해 고객 유 형 정보를 도출하고, 상기 고객 유형 정보와 상기 캠핑 용품 정보를 소스데이터로 병합하여 리스트화하는 데이 터관리부 및 상기 고객단말로부터 캠핑용품 쇼핑몰 사이트를 통해 입력받는 고객정보로부터 확인된 고객 유형 정보에 기초하여, 기등록된 복수의 캠핑용품들로부터 맞춤형 캠핑용품을 추출하여 메인 광고 대상으로 상기 고 객단말에 제공하는 통합서비스부를 포함한다. 실시예에 있어서, 상기 통합서비스부는 상기 고객단말로부터 상기 캠핑용품 쇼핑몰 사이트를 통해 입력받는 캠 핑장정보에 기초하여, 상기 복수의 캠핑이미지들로부터 해당 위치에 대응되는 적어도 하나의 캠핑이미지를 추출 하고 각 캠핑이미지에 캠핑 용품 정보를 태깅하여 상기 고객단말에 제공한다. 실시예에 있어서, 상기 통합서비스부는 상기 캠핑용품 쇼핑몰 사이트를 통해 고객단말로부터 주문받는 어느 하 나의 캠핑용품에 기초하여, 예약 가능한 캠핑장 예약서비스를 상기 고객단말에 제공하는 서비스제공부, 상기 고 객단말로부터 상기 캠핑장 예약서비스를 통해 입력받는 예약정보에 응답하여, 상기 예약정보로부터 확인된 해당 캠핑장의 후기리뷰 커뮤니티로 페이지 전환시키는 웹페이지관리부 및 상기 후기리뷰 커뮤니티로부터 기설정된 횟수 이상 검출되는 키워드에 연관된 캠핑용품들을 탐색하여, 상기 고객단말에 맞춤형 기획 상품 세트 정보로 제공하는 맞춤형상품 제공부를 포함한다."}
{"patent_id": "10-2023-0031665", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 캠핑용품 판매관리 시스템은 고객정보에 따른 맞춤형 캠핑용품을 추출하여 메인 광 고 대상으로 제공함으써, 고객이 원하는 캠핑용품을 보다 효율적으로 노출시킬 수 있다."}
{"patent_id": "10-2023-0031665", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예와 도면을 참조하여 본 발명을 상세히 설명한다. 이들 실시예는 오로지 본 발명을 보다 구체적으로 설명하기 위해 예시적으로 제시한 것일 뿐, 본 발명의 범위가 이들 실시예에 의해 제한되지 않는다 는 것은 당업계에서 통상의 지식을 가지는 자에 있어서 자명할 것이다. 또한, 달리 정의하지 않는 한, 본 명세서에서 사용되는 모든 기술적 및 과학적 용어는 본 발명이 속하는 기술 분야의 숙련자에 의해 통상적으로 이해되는 바와 동일한 의미를 가지며, 상충되는 경우에는, 정의를 포함하는 본 명세서의 기재가 우선할 것이다. 도면에서 제안된 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하 여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 그리고, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포 함할 수 있는 것을 의미한다. 또한, 명세서에서 기술한 \"부\"란, 특정 기능을 수행하는 하나의 단위 또는 블록을 의미한다. 각 단계들에 있어 식별부호(제1, 제2, 등)는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순 서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르 게 실시될 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 실시될 수도 있고 실질적으로 동시에 실시될 수도 있으며 반대의 순서대로 실시될 수도 있다. 도 1은 본 발명의 실시예에 따른 캠핑용품 판매관리 시스템을 개략적으로 나타내는 도이고, 도 2는 캠핑 이미지에 대한 실시예들이다. 도 1과 도 2를 참조하면, 캠핑용품 판매관리 시스템은 수집부, 탐색부, 데이터관리부 및 통합서비스부를 포함할 수 있다. 먼저, 수집부는 각 캠핑장에 구비된 복수의 카메라들(110_1~110_N)을 통해 촬영된 복수의 캠핑이미지들을 전송받아 저장 DB에 수집할 수 있다. 여기서, 복수의 캠핑이미지들은 도 2에 도시된 바와 같이, 캠핑용품객체와 인물객체가 모두 포함된 이미지를 의 미할 수 있다. 다음으로, 탐색부는 복수의 캠핑이미지들 각각으로부터 검출된 캠핑용품객체를 웹을 통해 이미지검색하여 캠핑 용품 정보를 탐색할 수 있다. 다음으로, 데이터관리부는 캠핑용품객체로부터 일정거리 이격된 인물객체를 분류하는 인공지능 기반의 고 객분류 모델을 통해 고객 유형 정보를 도출하고, 고객 유형 정보와 캠핑 용품 정보를 소스데이터로 병합하여 리 스트화할 수 있다. 여기서, 고객 유형 정보는 나이, 성별, 성격유형 및 패션스타일 중 적어도 어느 하나를 포함할 수 있다. 이때, 인공지능 기반의 고객분류 모델은 복수의 인물객체들을 입력으로 하고, 인물객체별 고객 유형 정보를 출 력으로 하는 머신러닝을 통해 학습함에 따라 사전에 도출되는 인공신경망 알고리즘일 수 있다. 다음으로, 통합서비스부는 고객단말로부터 캠핑용품 쇼핑몰 사이트를 통해 입력받는 고객정보로부터 확인된 고객 유형 정보에 기초하여, 기등록된 복수의 캠핑용품들로부터 맞춤형 캠핑용품을 추출하여 메인 광고 대상으로 고객단말에 제공할 수 있다. 이러한 통합서비스부는 고객단말로부터 캠핑용품 쇼핑몰 사이트를 통해 가입시 고객정보 예컨대, 나이, 성별, 성격유형 및 패션스타일을 확인하기 위한 질의 리스트를 제공함에 따라 입력받을 수 있다. 여기서, 캠핑용품 쇼핑몰 사이트는 캠핑용품의 판매, 대여, 중고판매, 장비보관, 셀프텐트세척, 바비큐판매 등 의 서비스를 모바일과 웹을 통해 제공하는 온라인 기반의 쇼핑몰일 수 있다. 실시예에 따라, 통합서비스부는 고객단말로부터 캠핑용품 쇼핑몰 사이트를 통해 입력받는 캠핑장 위치 에 기초하여, 복수의 캠핑이미지들로부터 해당 위치에 대응되는 적어도 하나의 캠핑이미지를 추출하고, 각 캠핑 이미지에 캠핑 용품 정보를 태깅하여 고객단말에 제공할 수 있다. 이하, 구체적인 실시예와 비교예를 통하여 본 발명의 구성 및 그에 따른 효과를 보다 상세히 설명하고자 한다. 그러나, 본 실시예는 본 발명을 보다 구체적으로 설명하기 위한 것이며, 본 발명의 범위가 이들 실시예에 한정 되는 것은 아니다. 도 3은 도 1의 통합서비스부에 대한 실시예를 나타내는 블록도이다. 도 1 내지 도 3을 참조하여 설명하면, 통합서비스부는 서비스제공부, 웹페이지 관리부 및 맞춤 형 상품제공부를 포함할 수 있다. 먼저, 서비스제공부는 고객단말로부터 캠핑용품 쇼핑몰 사이트를 통해 주문받는 어느 하나의 캠핑용품 에 응답하여, 예약 가능한 캠핑장 예약서비스를 고객단말에 서비스할 수 있다. 다음으로, 웹페이지 관리부는 고객단말로부터 캠핑장 예약서비스를 통해 입력받는 예약정보에 기초하 여, 예약정보로부터 확인된 해당 캠핑장의 후기리뷰 커뮤니티로 페이지 전환시킬 수 있다. 다음으로, 맞춤형 상품제공부는 후기리뷰 커뮤니티로부터 기설정된 횟수 이상 검출되는 키워드에 연관된 캠핑용품들을 탐색하여 고객단말에 맞춤형 기획 상품 세트 정보로 제공할 수 있다. 본 명세서에서는 본 발명자들이 실행한 다양한 실시예 가운데 몇 개의 예만을 들어 설명하는 것이나 본 발명의 기술적 사상은 이에 한정하거나 제한되지 않고, 당업자에 의해 변형되어 다양하게 실시될 수 있음은 물론이다."}
{"patent_id": "10-2023-0031665", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 캠핑용품 판매관리 시스템을 개략적으로 나타내는 도이다. 도 2는 캠핑이미지에 대한 실시예들이다. 도 3은 도 1의 통합서비스부에 대한 실시예를 나타내는 블록도이다."}
