{"patent_id": "10-2022-0066185", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0167194", "출원번호": "10-2022-0066185", "발명의 명칭": "수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법, 장치 및 프로그램", "출원인": "(주)휴톰", "발명자": "정태영"}}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 장치에 의해 수행되는, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법에 있어서,환자의 신체를 스캔함으로서 출력된 하나 이상의 스캔 이미지를 획득하는 단계;상기 환자에 대해 진행될 특정 수술의 타입을 제1 UI(user interface)를 통해 입력받는 단계;상기 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하는 단계;상기 획득된 정보에 기초하여, 인공 지능(artificial intelligence, AI) 모델을 통해 상기 하나 이상의 스캔 이미지 상에서 상기 장기 및 혈관 각각에 대한 이미지를 분할하여 식별하는 단계;상기 식별된 장기 및 혈관 각각에 대한 이미지를 이용하여, 상기 장기 및 혈관 각각의 3D 모델링 데이터를 생성하는 단계; 및상기 생성된 3D 모델링 데이터 정합하여 상기 특정 수술의 진행을 위한 3D 모델을 생성하는 단계를 포함하는,방법."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 하나 이상의 스캔 이미지는 상기 환자의 신체에 대한 하나 이상의 컴퓨터 단층촬영(computer tomography,CT) 이미지를 포함하고,상기 하나 이상의 CT 이미지를 획득하는 단계는,상기 환자의 신체를 스캔한 제2 장치 또는 상기 제2 장치와 연결된 클라우드 서버 중의 적어도 하나로부터 상기하나 이상의 CT 이미지를 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하는 단계는,복수의 수술 타입 별로 대응되는 장기 및 혈관에 대한 정보를 저장한 데이터베이스(database)를 구축하거나 로드(load)하는 단계; 및상기 데이터베이스에서 상기 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하는 단계를포함하는, 방법."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 AI 모델은,상기 복수의 수술 타입 별로 대응되는 장기 및 혈관에 대한 이미지를 식별할 수 있는, 상기 복수의 수술 타입별 기 학습된 알고리즘 모듈을 포함하는, 방법."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 식별하는 단계는,제2 UI 상에서 상기 복수의 수술 타입 별 기 학습된 알고리즘 모듈 중 상기 입력된 특정 수술의 타입에 대응되공개특허 10-2023-0167194-3-는 장기 및 혈관에 대한 이미지를 식별할 수 있는 알고리즘 모듈을 선택하는 단계; 및상기 선택된 알고리즘 모듈을 이용하는 상기 AI 모델을 통해, 상기 하나 이상의 CT 이미지 상에서 상기 장기 및혈관 각각에 대한 이미지를 분할하여 식별하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 3D 모델링 데이터를 생성하는 단계는,상기 하나 이상의 스캔 이미지 상에서 식별된 상기 장기 및 혈관 각각에 대한 이미지의 위치, 크기, 및 형태를검수하기 위한 제3 UI를 제공하는 단계; 및상기 제3 UI를 통해 입력된 검수 결과에 따라 상기 장기 및 혈관 각각에 대한 이미지를 수정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제3 UI는,상기 식별된 장기 및 혈관 각각에 대한 이미지의 위치를 이동시키는 제1 툴(tool), 삭제하는 제2 툴, 또는 추가적인 이미지를 생성하는 제3 툴 중의 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 정합하는 단계는,상기 생성된 3D 모델링 데이터의 위치를 상기 환자의 움직임 또는 상기 하나 이상의 CT 이미지 상에서 공통으로나타나는 혈관의 위치에 기초하여 조정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 제1 장치에 있어서,하나 이상의 통신 모듈;하나 이상의 메모리(memory); 및하나 이상의 프로세서를 포함하고,상기 하나 이상의 프로세서는,환자의 신체를 스캔함으로서 출력된 하나 이상의 스캔 이미지를 획득하고;상기 환자에 대해 진행될 특정 수술의 타입을 제1 UI(user interface)를 통해 입력받고;상기 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하고;상기 획득된 정보에 기초하여, 인공 지능(artificial intelligence, AI) 모델을 통해 상기 하나 이상의 스캔 이미지 상에서 상기 장기 및 혈관 각각에 대한 이미지를 분할하여 식별하고;상기 식별된 장기 및 혈관 각각에 대한 이미지를 이용하여, 상기 장기 및 혈관 각각의 3D 모델링 데이터를 생성하고; 및상기 생성된 3D 모델링 데이터 정합하여 상기 특정 수술의 진행을 위한 3D 모델을 생성하도록 설정되는, 제1 장치."}
{"patent_id": "10-2022-0066185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 제1 장치와 결합되어, 제1항 내지 제8항 중 어느 한 항의 수술 종류에 따라 장기 및 혈관에 대한 3D공개특허 10-2023-0167194-4-모델을 생성하는 방법을 실행시키기 위하여 컴퓨터 판독 가능 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "제1 장치에 의해 수행되는, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법을 개시한다. 상기 방법은, 환자의 신체를 스캔함으로서 출력된 하나 이상의 스캔 이미지를 획득하는 단계; 상기 환자에 대해 진행 될 특정 수술의 타입을 제1 UI를 통해 입력받는 단계; 상기 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하는 단계; 상기 획득된 정보에 기초하여, AI 모델을 통해 상기 하나 이상의 스캔 이미지 상 에서 상기 장기 및 혈관 각각에 대한 이미지를 분할하여 식별하는 단계; 상기 식별된 장기 및 혈관 각각에 대한 이미지를 이용하여, 상기 장기 및 혈관 각각의 3D 모델링 데이터를 생성하는 단계; 및 상기 생성된 3D 모델링 데 이터 정합하여 상기 특정 수술의 진행을 위한 3D 모델을 생성할 수 있다."}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 3D 모델을 생성하는 방법, 장치 및 프로그램에 관한 것이다. 보다 상세하게는, 본 개시는 수술 종류 에 따라 자동으로 장기 및 혈관에 대한 3D 모델을 생성하는 방법, 장치 및 프로그램에 관한 것이다."}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 병원에서 수술하는 경우, 수술을 수행하기 전, 환자의 상태, 수술 수행 조건을 확인하고 수술 성공의 확률을 높이기 위하여, 환자의 수술 부위에 대한 3D 시뮬레이션(입체영상)으로 생성하고, 실제 수술과 동일한 조건 하에 가상으로 수술을 시행하고 있다. 이러한, 가상 모의 수술의 경우, 환자 신체에 대해 정밀한 진단을 내리고 수술 계획을 사전에 세울 수 있다. 이 에 따라, 전문의의 직감에 의존하는 것이 아니라 가상 모의 수술을 수행함으로써, 수술과 관련된 아주 작은 오 차까지도 줄여 나갈 수 있다. 다만, 기존의 가상 모의 수술을 위한 시뮬레이션의 경우 수술 종류와는 무관하게 해부학적 구조에 기초하여 개 발되어 왔다. 이에 따라, 기존의 가상 모의 수술을 위한 시뮬레이션은 수술 종류에 따른 특성이 반영되지 않는 다는 문제점이 존재한다. 선행기술문헌 특허문헌 (특허문헌 0001) 미국 특허등록공보 10178157 (2019.01.08) (특허문헌 0002) 일본 특허공개공보 2017-535337 (2017.11.30)"}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술된 문제점을 해결하기 위해 안출된 것으로서, 본 개시가 해결하고자 하는 과제는 수술 종류에 따 라 자동으로 장기 및 혈관에 대한 3D 모델을 생성하는 방법, 장치 및 프로그램을 제공함에 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 개시의 일 실시예에 따른, 제1 장치에 의해 수행되는, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법은, 환자의 신체를 스캔함으로서 출력된 하나 이상의 스캔 이미지를 획 득하는 단계; 상기 환자에 대해 진행될 특정 수술의 타입을 제1 UI(user interface)를 통해 입력받는 단계; 상 기 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하는 단계; 상기 획득된 정보에 기초 하여, 인공 지능(artificial intelligence, AI) 모델을 통해 상기 하나 이상의 스캔 이미지 상에서 상기 장기 및 혈관 각각에 대한 이미지를 분할하여 식별하는 단계; 상기 식별된 장기 및 혈관 각각에 대한 이미지를 이용 하여, 상기 장기 및 혈관 각각의 3D 모델링 데이터를 생성하는 단계; 및 상기 생성된 3D 모델링 데이터 정합하 여 상기 특정 수술의 진행을 위한 3D 모델을 생성하는 단계를 포함할 수 있다. 그리고, 상기 하나 이상의 스캔 이미지는 상기 환자의 신체에 대한 하나 이상의 컴퓨터 단층촬영(computer tomography, CT) 이미지를 포함하고, 상기 하나 이상의 CT 이미지를 획득하는 단계는, 상기 환자의 신체를 스캔 한 제2 장치 또는 상기 제2 장치와 연결된 클라우드 서버 중의 적어도 하나로부터 상기 하나 이상의 CT 이미지 를 수신하는 단계를 포함할 수 있다.그리고, 상기 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하는 단계는, 복수의 수술 타입 별로 대응되는 장기 및 혈관에 대한 정보를 저장한 데이터베이스(database)를 구축하거나 로드(load)하는 단계; 및 상기 데이터베이스에서 상기 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하 는 단계를 포함할 수 있다. 그리고, 상기 AI 모델은, 상기 복수의 수술 타입 별로 대응되는 장기 및 혈관에 대한 이미지를 식별할 수 있는, 상기 복수의 수술 타입 별 알고리즘 모듈을 포함할 수 있다. 그리고, 상기 식별하는 단계는, 제2 UI 상에서 상기 복수의 수술 타입 별 알고리즘 모듈 중 상기 입력된 특정 수술의 타입에 대응되는 장기 및 혈관에 대한 이미지를 식별할 수 있는 알고리즘 모듈을 선택하는 단계; 및 상 기 선택된 알고리즘 모듈을 이용하는 상기 AI 모델을 통해, 상기 하나 이상의 CT 이미지 상에서 상기 장기 및 혈관 각각에 대한 이미지를 분할하여 식별하는 단계를 포함할 수 있다. 그리고, 상기 3D 모델링 데이터를 생성하는 단계는, 상기 하나 이상의 스캔 이미지 상에서 식별된 상기 장기 및 혈관 각각에 대한 이미지의 위치, 크기, 및 형태를 검수하기 위한 제3 UI를 제공하는 단계; 및 상기 제3 UI를 통해 입력된 검수 결과에 따라 상기 장기 및 혈관 각각에 대한 이미지를 수정하는 단계를 포함할 수 있다. 그리고, 상기 제3 UI는, 상기 식별된 장기 및 혈관 각각에 대한 이미지의 위치를 이동시키는 제1 툴(tool), 삭 제하는 제2 툴, 또는 추가적인 이미지를 생성하는 제3 툴 중의 적어도 하나를 포함할 수 있다. 그리고, 상기 정합하는 단계는, 상기 생성된 3D 모델링 데이터의 위치를 상기 환자의 움직임 또는 상기 하나 이 상의 CT 이미지 상에서 공통으로 나타나는 혈관의 위치에 기초하여 조정하는 단계를 포함할 수 있다. 상술한 과제를 해결하기 위한 본 개시의 일 실시예에 따른 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생 성하는 제1 장치는, 하나 이상의 통신 모듈; 하나 이상의 메모리(memory); 및 하나 이상의 프로세서를 포함하고, 상기 하나 이상의 프로세서는, 환자의 신체를 스캔함으로서 출력된 하나 이상의 스캔 이미지를 획득 하고; 상기 환자에 대해 진행될 특정 수술의 타입을 제1 UI(user interface)를 통해 입력받고; 상기 입력된 특 정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득하고; 상기 획득된 정보에 기초하여, 인공 지능 (artificial intelligence, AI) 모델을 통해 상기 하나 이상의 스캔 이미지 상에서 상기 장기 및 혈관 각각에 대한 이미지를 분할하여 식별하고; 상기 식별된 장기 및 혈관 각각에 대한 이미지를 이용하여, 상기 장기 및 혈 관 각각의 3D 모델링 데이터를 생성하고; 및 상기 생성된 3D 모델링 데이터 정합하여 상기 특정 수술의 진행을 위한 3D 모델을 생성하도록 설정될 수 있다. 이 외에도, 본 개시를 구현하기 위한 실행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 더 제공될 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기 록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 전술한 과제 해결 수단에 의하면, 수술 종류에 따라 자동으로 장기 및 혈관에 대한 3D 모델을 생성하 는 방법, 장치 및 프로그램이 제공될 수 있다. 또한, 본 개시의 전술한 과제 해결 수단에 의하여, 수술 종료 별 특성이 반영/결합된 3D 모델에 기초하여 3D 시 뮬레이션을 생성함으로써, 실제 환자의 인체 구조의 확인이 가능하며, 실제 수술에 도움을 줄 수 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명하"}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한다. 명세서에서 사용되는 '부, 모듈, 부재, 블록'이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실 시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우 뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제 1, 제 2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 본 개시를 설명함에 있어서, \"영상\"은 이산적인 영상 요소들(예를 들어, 2차원 영상에 있어서의 픽셀들 및 3D 영상에 있어서의 복셀들)로 구성된 다차원(multi-dimensional) 데이터를 의미할 수 있다. 예를 들어, 영상은 CT 촬영 장치에 의해 획득된 대상체의 의료 영상 등을 포함할 수 있다. 본 개시를 설명함에 있어서 \"오브젝트(object)\"는 사람(예로, 환자) 또는 동물, 또는 사람 또는 동물의 일부 또 는 전부일수 있다. 예를 들어, 대상체는 간, 심장, 자궁, 뇌, 유방, 복부 등과 같은 장기, 및 혈관(예로, 동맥 (artery) 또는 정맥(vein) 등), 지방 조직 등 중 적어도 하나를 포함할 수 있다. 그리고, “타겟 오브젝트”는 실제 수술의 대상이 되는 사람의 일 부분을 의미할 수 있다. 본 개시를 설명함에 있어서, \"사용자\"는 의료 전문가로서 의사, 간호사, 임상 병리사, 의료 영상 전문가 등이 될 수 있으며, 의료 장치를 수리하는 기술자가 될 수 있으나, 이에 한정되지 않는다. 본 개시를 설명함에 있어서, “3D 모델링 데이터”는 특정 오브젝트를 3D로 형상화한 데이터를 의미하여, “3D 모델”은 하나 이상의 3D 모델링 데이터의 결합을 통해 생성된 시뮬레이션의 일 요소를 의미할 수 있다. “3D 모델링 데이터” 또는/및 “3D 모델”은 사용자에게 제공되는 디스플레이 상에서 2D로 제공되나, 3D의 형 태로 보여지도록 제공되거나, 또는 증강현실과 같이 해당 디스플레이를 통하여 실제 공간상에 신체 부위가 나타 나는 것처럼 보여지도록 제공될 수 있다.본 개시를 설명함에 있어서, \"제1 장치\"(즉, 환자 맞춤형 3D 수술 시뮬레이션 방법을 수행하는 장치)는 연산처 리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들이 모두 포함된다. 예를 들어, 상기 장치는 데스크 탑 PC, 노트북(Note Book) 뿐만 아니라 스마트폰(Smart phone), 태블릿 PC, 셀 룰러폰(Cellular phone), 피씨에스폰(PCS phone; Personal Communication Service phone), 동기식/비동기식 IMT-2000(International Mobile Telecommunication-2000)의 이동 단말기, 팜 PC(Palm Personal Computer), 개 인용 디지털 보조기(PDA; Personal Digital Assistant) 등도 해당될 수 있다. 또한, 헤드마운트 디스플레이 (Head Mounted Display; HMD) 장치가 컴퓨팅 기능을 포함하는 경우, HMD장치가 상기 장치가 될 수 있다. 또한, 장치는 클라이언트로부터 요청을 수신하여 정보처리를 수행하는 별도의 서버로 구현될 수 있다. 도 1은 본 개시의 일 실시예에 따른, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법을 구현하 기 위한 시스템의 개략도이다. 도 1에 도시된 바와 같이, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법을 구현하기 위한 시 스템은, 제1 장치, 병원 서버, 데이터 베이스 및 AI 모델을 포함할 수 있다. 여기서, 도 1에는 제1 장치가 하나의 데스크 탑의 형태로 구현될 것으로 도시되어 있으나, 이에 한정되는 것은 아니다. 제1 장치는 상술한 바와 같이 다양한 유형의 장치 또는 하나 이상의 유형의 장치가 연결된 장치 군을 의미할 수 있다. 시스템에 포함된 제1 장치, 병원 서버, 데이터 베이스, 및 인공 지능(artificial intelligence, AI) 모델은 네트워크(W)를 통해 통신을 수행할 수 있다. 여기서, 네트워크(W)는 유선 네트 워크와 무선 네트워크를 포함할 수 있다. 예를 들어, 네트워크는 근거리 네트워크(LAN: Local Area Network), 도시권 네트워크(MAN: Metropolitan Area Network), 광역 네트워크(WAN: Wide Area Network) 등의 다양한 네트 워크를 포함할 수 있다. 또한, 네트워크(W)는 공지의 월드 와이드 웹(WWW: World Wide Web)을 포함할 수도 있다. 그러나, 본 개시의 실 시예에 따른 네트워크(W)는 상기 열거된 네트워크에 국한되지 않고, 공지의 무선 데이터 네트워크나 공지의 전 화 네트워크, 공지의 유무선 텔레비전 네트워크를 적어도 일부로 포함할 수도 있다. 제1 장치는 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법을 제공할 수 있다. 예로, 제1 장치는 환자의 신체를 스캔(scan)함으로써 출력된 스캔 이미지를 획득하고, 환자에 대해 진행될 특정 수술의 타입을 사용자로부터 입력받을 수 있다. 제1 장치는 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득할 수 있다. 제1 장치는, 획득된 정보에 기초하여, AI 모델을 통해 하나 이 상의 스캔 이미지 상에서 장기 및 혈관 각각에 대한 이미지를 분할하여 식별할 수 있다. 제1 장치는 식별 된 장기 및 혈관 각각에 대한 이미지를 이용하여, 장기 및 혈관 각각의 3D 모델링 데이터를 생성하고, 생성된 3D 모델링 데이터를 정합하여 특정 수술의 진행을 위한 3D 모델을 생성할 수 있다. 병원 서버(예로, 클라우드 서버 등)는 환자의 신체에 대해 스캔을 하여 획득한 스캔 이미지(예로, 컴퓨터 단층촬영(computer tomography, CT) 이미지)를 저장할 수 있다. 병원 서버는 제1 장치, 데이터 베이 스, 또는 AI 모델로 저장한 스캔 이미지를 전송할 수 있다. 병원 서버는 CT 이미지의 대상을 가명화 또는 익명화하여 신체의 개인 정보를 보호할 수 있다. 또한, 병원 서버는 사용자에 의해 입력된 CT 이미지의 대상이 되는 환자의 나이/성별/키/몸무게/출산 여부와 관련된 정보를 암호화하여 저장할 수 있다. 데이터 베이스는 제1 장치에 의해 생성된 각종 오브젝트/수술 장비에 대한 3D 모델링 데이터 및 3D 모델을 저장할 수 있다. 또 따른 예로, 데이터 베이스는 복수의 수술 타입 별로 대응되는 장기 및 혈관에 대한 정보를 저장할 수 있다. 도 1에서는 데이터 베이스가 제1 장치 외부에 구현된 경우를 도시하고 있으나, 데이터 베이스는 제1 장치의 일 구성 요소로 구현될 수도 있다. AI 모델은 하나 이상의 스캔 이미지 상에서 상기 장기 및 혈관 각각에 대한 이미지를 분할하여 식별하도록 학습된 인공지능 모델이다. AI 모델은 실제 수술 영상 또는 CT 이미지 및 해부학 관련 자료 등으로 구축된 데이터 셋을 통해 하나 이상의 스캔 이미지 상에서 상기 장기 및 혈관 각각에 대한 이미지를 분할하여 식별하도 록 학습될 수 있다. 학습 방식은 지도 학습(supervised training)/비지도 학습(unsupervised training) 등을 포함할 수 있으나, 이에 한정되는 것은 아니다.도 1은 AI 모델이 제1 장치 외부에 구현(예로, 클라우드 기반(cloud-based)으로 구현)된 경우를 도시 하고 있으나, 이에 한정되는 것은 아니며, 제1 장치에 일 구성 요소로 구현될 수 있다. 도 2는 본 개시의 일 실시예에 따른, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 제1 장치(10 0)의 구성을 설명하기 위한 블록도이다. 도 2에 도시된 바와 같이, 제1 장치는 메모리, 통신 모듈, 디스플레이, 입력 모듈 및 프로세서를 포함할 수 있다. 다만, 이에 국한되는 것은 아니며, 제1 장치는 필요한 동작에 따라 당업 자 관점에서 자명한 범위 내에서 소프트웨어 및 하드웨어 구성이 수정/추가/생략될 수 있다. 메모리는 본 제1 장치의 다양한 기능을 지원하는 데이터와, 프로세서의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들(예를 들어, 음악 파일, 정지영상, 동영상 등)을 저장할 있고, 본 장치에 서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 본 제1 장치 의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 이러한, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입 (Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 본 장치와는 분리되어 있으나, 유선 또는 무선으로 연결된 데이터베이스를 포함할 수 있다. 즉, 도 1에 도시된 데이터 베이스는 메모리의 일 구성 요소로 구현될 수 있다. 통신 모듈는 외부 장치와 통신을 가능하게 하는 하나 이상의 구성 요소를 포함할 수 있으며, 예를 들어, 방송 수신 모듈, 유선통신 모듈, 무선통신 모듈, 근거리 통신 모듈, 위치정보 모듈 중 적어도 하나를 포함할 수 있다. 유선 통신 모듈은, 지역 통신(Local Area Network; LAN) 모듈, 광역 통신(Wide Area Network; WAN) 모듈 또는 부가가치 통신(Value Added Network; VAN) 모듈 등 다양한 유선 통신 모듈뿐만 아니라, USB(Universal Serial Bus), HDMI(High Definition Multimedia Interface), DVI(Digital Visual Interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 다양한 케이블 통신 모듈을 포함할 수 있다. 무선 통신 모듈은 와이파이(Wifi) 모듈, 와이브로(Wireless broadband) 모듈 외에도, GSM(global System for Mobile Communication), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), UMTS(universal mobile telecommunications system), TDMA(Time Division Multiple Access), LTE(Long Term Evolution), 4G, 5G, 6G 등 다양한 무선 통신 방식을 지원하는 무선 통신 모듈을 포함할 수 있 다. 디스플레이는 본 제1 장치에서 처리되는 정보(예를 들어, 3D 모델링 데이터/모델 또는 3D 모델링 데 이터/모델에 기초한 시뮬레이션 화면)를 표시(출력)한다. 예를 들어, 디스플레이는 본 제1 장치에서 구동 되는 응용 프로그램(일 예로, 어플리케이션)의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 디스플레이에서 출력되는 UI에 대한 종류는 후술하도록 한다. 입력 모듈는 사용자로부터 정보를 입력받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력되면, 프로 세서는 입력된 정보에 대응되도록 본 제1 장치의 동작을 제어할 수 있다. 이러한, 입력 모듈은 하드웨어식 물리 키(예를 들어, 본 장치의 전면, 후면 및 측면 중 적어도 하나에 위 치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 소프트웨어식 터치 키를 포함할 수 있다. 일 예로서, 터치 키는, 소프트웨어적인 처리를 통해 터치스크린 타입의 디스플레이 상에 표시되는 가상 키 (virtual key), 소프트 키(soft key) 또는 비주얼 키(visual key)로 이루어지거나, 상기 터치스크린 이외의 부 분에 배치되는 터치 키(touch key)로 이루어질 수 있다. 한편, 상기 가상키 또는 비주얼 키는, 다양한 형태를 가지면서 터치스크린 상에 표시되는 것이 가능하며, 예를 들어, 그래픽(graphic), 텍스트(text), 아이콘(icon),비디오(video) 또는 이들의 조합으로 이루어질 수 있다. 프로세서는 본 제1 장치 내의 구성요소들의 동작을 제어하기 위한 알고리즘 또는 알고리즘을 재현한 프로그램에 대한 데이터를 저장하는 메모리, 및 메모리에 저장된 데이터를 이용하여 전술한 동작을 수행하는 적 어도 하나의 프로세서(미도시)로 구현될 수 있다. 이때, 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있 다. 또는, 메모리와 프로세서는 단일 칩으로 구현될 수도 있다. 또한, 프로세서는 이하의 도 3 내지 도 7에서 설명되는 본 개시에 따른 다양한 실시 예들을 본 제1 장치 상에서 구현하기 위하여, 위에서 살펴본 구성요소들을 중 어느 하나 또는 복수를 조합하여 제어할 수 있 다. 도 3은 본 개시의 일 실시예에 따른, 환자의 신체를 스캔함으로서 출력된 하나 이상의 스캔 이미지를 획득할 수 있다(S310). 예를 들어, 제1 장치는 병원 서버로부터 환자의 신체를 스캔한 컴퓨터 하나이사의 단층촬영(computer tomography, CT) 이미지를 수신할 수 있다. 구체적으로, 장치는 환자에 대해 진행될 특정 수술 대상(예로, 타겟 오브젝트)의 이미지가 포함된 특정 환자의 CT 이미지를 요청하는 신호를 병원 서버(또는, 병원이 제어하는 장치)로 전송할 수 있다. 병원이 제어하는 제2 장치는 환자의 신체에 대해 스캔하여 하나 이상의 CT 이미지를 획득할 수 있다. 제2 장치와 연결된 병원 서버(또는, 클라우드 서버)는 제1 장치의 요청 신호에 따라 상기 특정 수술 대상의 이미지가 포함된 특정 환자의 하나 이상의 CT 이미지를 장치로 전송할 수 있다. 다만, 이는 일 실시예에 불과하며, 제1 장치는 제1 장치와 무선/유선으로 연결된 CT 촬영 장치로부터 특정 수술 대상의 이미지가 포함된 CT 이미지를 수신할 수 있다. 제1 장치는 환자에 대해 진행될 특정 수술의 타입을 제1 UI를 통해 입력받을 수 있다(S320). 예로, 제1 UI는 도 5와 같이 도시될 수 있다. 제1 장치는 제1 UI 상의 UI 엘리먼트를 통해 특정 수술의 타입(즉, 수술이 진행 될 특정 장기/혈관/지방 조직 등)을 선택받을 수 있다. 제1 장치는 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득할 수 있다(S330). 그리고, 제1 장치는, 획득된 정보에 기초하여, AI 모델을 통해 하나 이상의 스캔 이미지 상에서 장기 및 혈관 각각에 대 한 이미지를 분할하여 식별할 수 있다(S340). S330 및 S340는 도 4를 참조하여 더욱 구체적으로 설명하도록 한 다. 제1 장치는 식별된 장기 및 혈관 각각에 대한 이미지를 이용하여, 장기 및 혈관 각각의 3D 모델링 데이터를 생 성할 수 있다(S350). 구체적으로, 제1 장치는 하나 이상의 스캔 이미지 상에서 식별된 장기 및 혈관 각각에 대한 이미지의 위치, 크 기, 및 형태를 검수하기 위한 제3 UI를 사용자에게 제공할 수 있다. 제1 장치는 제3 UI를 통해 사용자로부터 입 력된 검수 결과에 따라 장기 및 혈관 각각에 대한 이미지를 수정할 수 있다. 예를 들어, 제3 UI는 수술 타입 별로 정의된 장기/혈관 데이터베이스를 바탕으로 검수 항목을 지정할 수 있다. 예로, 수술 타입이 위암일 경우, 위암과 관련된 장기는 간(liver), 복부(stomach), 비장(spleend) 등을 포함할 수 있으며, 위암과 관련된 동맥 혈관을 이루는 세부 혈관으로 AORTA , CHA, SA, PHA 등을 포함할 수 있으며, 위 암과 관련된 정맥 혈관을 이루는 세부 혈관으로 PV, SV, GCT, SMV 등을 포함할 수 있다. 그리고, 제3 UI는 식별된 장기 및 혈관 각각에 대한 이미지의 위치를 이동시키는 제1 툴(tool), 삭제하는 제2 툴(예로, 지우개(eraser) 툴), 또는 추가적인 이미지를 생성하는 제3 툴(예로, 브러시(brush) 툴 등) 중의 적어 도 하나를 포함할 수 있다. 예로, 사용자는 지우개 툴을 이용하여 제1 장치가 잘못 예측한 간(liver) 모델링 데이터를 지울 수 있다. 또 다 른 예로, 사용자는 브러시 툴을 이용하여 생략된 간 모델링 데이터를 추가할 수 있다. 이 때, 사용자의 검수 기준은 수술 유형 별로 정의된 검수 항목이 제대로 확인되는지, 그 구조가 해부학적으로 용인되는지에 기초할 수 있다. 또 다른 예로, 사용자의 검수 기준은 인체 해부학을 참조하여 검수 항목들이 올 바른 크기와 위치 가지는지 확인할 수 있다. 예로, 사용자는 동맥 혈관들의 여러 분지점 형태를 고려하여 모델 링을 검수할 수 있다. 제1 장치는 생성된 3D 모델링 데이터 정합하여 특정 수술의 진행을 위한 3D 모델을 생성할 수 있다(S360). 구체적으로, 제1 장치는 생성된 3D 모델링 데이터의 위치를 환자의 움직임 또는 하나 이상의 CT 이미지 상에서 공통으로 나타나는 혈관의 위치에 기초하여 조정할 수 있다. 예로, 환자에게 적용될 수술의 유형이 위암인 경우를 가정한다. 제2 장치는 위암과 관련된 장기 위치를 2번 이 상 스캔하여 복수의 CT 이미지를 획득하고, 획득된 복수의 CT 이미지를 제1 장치로 전송할 수 있다. 제1 장치는 복수의 CT 이미지에서 공통적으로 확인되는 혈관을 기준으로 생성된 복수의 3D 모델링 데이터(즉, 위암과 관련 된 복수의 장기에 대한 3D 모델링 데이터)를 정합할 수 있다. 예로, 도 7의 (a)에 도시된, 정맥을 구성하는 세부 혈관이 복수의 CT 이미지에 공통적으로 확인되는 경우를 가 정한다. 복수의 CT 이미지에 공통적으로 확인된 상기 혈관의 위치가 각 CT 이미지 별로 x, y, z 좌표기준 (- 10mm, 3mm, -5mm) 차이 값이 존재하는 경우, 제1 장치는 다른 장기/혈관의 위치(예로, 도 7의 (b)에 도시된 동 맥을 구성하는 세부 혈관)도 상기 차이 값을 적용하여 조정할 수 있다. 그리고, 제1 장치는 위치를 조정한 각 장기/혈관에 대한 모델링 데이터를 정합하여 위암 수술의 진행을 위한 3D 모델(예로, 도 7의 (c)에 도시된 3D 모델과 같이)을 생성할 수 있다. 제1 장치는 생성된 3D 모델을 이용하여 특정 수술의 진행(즉, 가상 모의 수술)을 위한 시뮬레이션을 생성할 수 있다. 도 4는 본 개시의 일 실시예에 따른, 스캔 이미지 상에서 장기 및 혈관을 분할/식별하는 방법을 설명하기 위한 순서도이다. 즉, 도 4는 S330 및 S340를 구체적으로 설명하기 위한 순서도이다. 제1 장치는 복수의 수술 타입 별로 대응되는 장기 및 혈관에 대한 정보를 저장한 데이터베이스를 구축하거나 로 드(load)할 수 있다(S410). 예를 들어, 제1 장치는 특정 수술에 대응되는 장기/혈관/기타 조직에 대한 정보를 수집하여 데이터 베이스를 구 축할 수 있다. 또는, 제1 장치는 특정 수술(에로, 위암 수술)에 대응되는 장기/혈관/기타 조직에 대한 정보에 기초하여 구축된 데이터 베이스를 외부 장치로부터 로드(또는, 수신)할 수 있다. 상기 특정 수술이 위암 수술인 경우, 데이터 베이스에는 위암 수술과 관련된 장기(예로, 간, 복부, 비장, 쓸개 (Gallbladder), 콩팥(Pancreas)), 해당 장기의 동맥을 이루는 세부 혈관(예로, AORTA, CT, CHA, SA, PHA, GDA 등 총 16가지의 혈관), 해당 장기의 정맥을 이루는 세부 혈관(예로, PV, SV, GCT, SMV, LGV, LGEV 등 총 12가 지의 혈관), 그 외 조직(예로, 피부, Lib, 복벽(Abdominal Wall) 등)을 포함할 수 있다. 제1 장치는 데이터베이스에서 입력된 특정 수술의 타입과 관련된 장기 및 혈관과 관련된 정보를 획득할 수 있다 (S420). 제1 장치는 제2 UI 상에서 입력된 특정 수술의 타입에 대응되는 장기 및 혈관에 대한 이미지를 식별할 수 있는 알고리즘 모듈을 선택할 수 있다(S430). 구체적으로, AI 모델은 복수의 수술 타입 별로 대응되는 장기 및 혈관에 대한 이미지를 식별할 수 있는, 복수의 수술 타입 별 기 학습된 알고리즘 모듈을 포함할 수 있다. 여기서, 알고리즘 모듈은 AI 모델이 특정 동작을 수 행하기 위해 학습된 알고리즘을 의미할 수 있다. AI 모델은 복수의 수술 타입 별로 대응되는 장기 및 혈관에 대 한 이미지를 식별하도록 학습되었는 바, AI 모델은 복수의 수술 타입 별 기 학습된 알고리즘 모듈을 포함할 수 있다. 사용자는 제2 UI 상에서 복수의 수술 타입 별 기 학습된 알고리즘 모듈 중 특정 수술 타입에 대응되는 알고리즘 모듈을 선택할 수 있다. 이에 따라, AI 모델은 선택된 알고리즘 모듈을 이용하여 특정 수술 타입과 관련된 장기 /혈관/기타 조직을 식별할 수 있다. 제2 UI는, 일 예시로, 도 6에 도시된 바와 같이 구현될 수 있다. 제2 UI는 복수의 수술 타입 별 기 학습된 알고 리즘 모듈을 선택할 수 있는 UI 엘리먼트(610, 620)를 포함할 수 있다. 사용자는 UI 엘리먼트(610, 620)를 통해 특정 알고리즘 모듈을 선택할 수 있다. 제1 장치는, 선택된 알고리즘 모듈을 이용하는 AI 모델을 통해, 하나 이상의 CT 이미지 상에서 장기 및 혈관 각 각에 대한 이미지를 분할하여 식별할 수 있다(S450). 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2022-0066185", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2022-0066185", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법을 구현하 기 위한 시스템의 개략도이다. 도 2는 본 개시의 일 실시예에 따른, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 장치의 구성을 설명하기 위한 블록도이다. 도 3은 본 개시의 일 실시예에 따른, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방법을 설명하기 위한 순서도이다. 도 4는 본 개시의 일 실시예에 따른, 스캔 이미지 상에서 장기 및 혈관을 분할/식별하는 방법을 설명하기 위한 순서도이다. 도 5 내지 도 7은 본 개시의 일 실시예에 따른, 수술 종류에 따라 장기 및 혈관에 대한 3D 모델을 생성하는 방 법을 설명하기 위한 도면이다."}
