{"patent_id": "10-2023-7030647", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0153398", "출원번호": "10-2023-7030647", "발명의 명칭": "물 공급 시스템에서의 물/에너지 낭비 감소", "출원인": "옥토퍼스 에너지 히팅 리미티드", "발명자": "코노왈크지크 피터"}}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "유출구로 공급되는 물 공급을 제어하는 물 공급 시스템용 히터 배열 시스템으로서, 상기 유출구는 온수를 사용자에게 공급하도록 배열되고, 상기 히터 배열 시스템은,상기 유출구로부터 원격으로 배치된 물 가열 장치; 및상기 물 가열 장치에 통신 가능하게 연결된 제어 유닛;을 포함하며,상기 제어 유닛은, a) 상기 유출구가 개방된 것으로 검출할 경우 초기 시간 값으로부터 카운트하기 시작하도록타이머를 설정하는 동작, 및 b) 상기 타이머의 경과 시간이 제1 임계 시간 값을 경과한 경우 경보를 야기시키는동작을 수행하도록 구성되고, 상기 제어 유닛은 c) 상기 타이머의 경과 시간이 상기 제1 임계 시간 값보다 높은제2 임계 시간 값을 경과한 경우 상기 유출구로 공급되는 물의 흐름을 중단하는 동작을 수행하도록 더구성되며, 상기 제1 및 제2 임계 시간 값은 상기 제어 유닛에 의해 실행되는 인공 지능 알고리즘에 의해 설정되고, 상기 인공 지능 알고리즘은 상기 물 공급 시스템의 과거 사용에 기초하여 상기 제1 및 제2 임계 시간 값의값을 예측하는, 히터 배열 시스템."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 물 가열 장치는 열 펌프와 열에너지 저장 장치를 포함하는, 히터 배열 시스템."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 열에너지 저장 장치는 상변화 물질 장치인, 히터 배열 시스템."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상변화 물질은 파라핀 왁스인, 히터 배열 시스템."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 파라핀 왁스는 40℃ 내지 60℃의 온도에서 녹는, 히터 배열 시스템."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항, 제4항 또는 제5항 중 어느 한 항에 있어서,상변화 물질의 잠열용량은 약 180kJ/kg 내지 230kJ/kg이고, 상변화 물질의 비열용량은 액상에서 약 2.27Jg-1K-1이며 고상에서 2.1Jg-1K-1인, 히터 배열 시스템."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 제어 유닛은 c) 물 사용 데이터를 수집하고, 이에 따른 사용 보고서를 생성하는 동작을 수행하도록 또 구성되는, 히터 배열 시스템.공개특허 10-2023-0153398-3-청구항 8 물 공급 시스템 내 유출구로 공급되는 물 공급을 제어하는 방법으로서, 상기 유출구는 물 가열 장치로부터 사용자에게 온수를 제공하도록 배열되며, 상기 방법은,a) 상기 유출구가 개방된 것으로 검출할 경우 초기 시간 값으로부터 카운트하기 시작하도록 타이머를 설정하는단계; 및b) 상기 타이머의 경과 시간이 제1 임계 시간 값보다 높은 제1 임계 시간 값을 경과한 경우 경보를 야기시키는단계;를 포함하며,제1 및 제2 임계 시간 값은 제어 유닛에 의해 실행되는 인공 지능 알고리즘에 의해 설정되고,상기 인공 지능 알고리즘은 상기 물 공급 시스템의 과거 사용에 기초하여 제1 및 제2 임계 시간 값의 값을 예측하는, 유출구로 공급되는 물 공급의 제어 방법."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 물 가열 장치는 열 펌프와 열에너지 저장 장치를 포함하는, 유출구로 공급되는 물 공급의 제어 방법."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 열에너지 저장 장치는 상변화 물질 장치인, 유출구로 공급되는 물 공급의 제어 방법."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상변화 물질은 파라핀 왁스인, 유출구로 공급되는 물 공급의 제어 방법."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "기계-판독가능 코드를 포함하는 컴퓨터-판독가능 매체로서, 상기 기계-판독가능 코드는 프로세서에 의해 실행될때 상기 프로세서로 하여금 제8항 내지 제11항 중 어느 한 항의 방법을 수행하게 하는, 컴퓨터-판독가능 매체."}
{"patent_id": "10-2023-7030647", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "통신 채널을 통해 물 공급 시스템의 작동을 제어하도록 구성된 제어 모듈로서, 상기 물 공급 시스템은 본관으로부터의 물을 가열하도록 구성되고 상기 제어 모듈에 의해 제어되는 가열 시스템을 포함하며, 상기 물 공급 시스템은 상기 가열 시스템에 의해 가열된 물을 하나 이상의 유출구들 측 사용자에게 공급하도록 구성되고, 상기 제어 모듈은 제8항 내지 제11항 중 어느 한 항의 방법을 수행하는 소프트웨어가 실행되게 하는 프로세서를 포함하거나 제8항 내지 제11항 중 어느 한 항의 방법을 수행하도록 구성된 사전에 구성된 하드웨어 논리 구성요소들을지니는, 제어 모듈."}
{"patent_id": "10-2023-7030647", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "유출구로 공급되는 물 공급을 제어하는 물 공급 시스템용 히터 배열 시스템으로서, 상기 유출구는 온수를 사용자 에게 공급하도록 배열되고, 상기 히터 배열 시스템은, 상기 유출구로부터 원격으로 배치된 물 가열 장치; 및 상 기 물 가열 장치에 통신 가능하게 연결된 제어 유닛;을 포함하며, 상기 제어 유닛은, a) 상기 유출구가 개방된 것으로 검출할 경우 초기 시간 값으로부터 카운트하기 시작하도록 타이머를 설정하는 동작, 및 b) 상기 타이머의 경과 시간이 제1 임계 시간 값을 경과한 경우 경보를 야기시키는 동작을 수행하도록 구성된, 히터 배열 시스템."}
{"patent_id": "10-2023-7030647", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시내용은 일반적으로 건물 내 복수 개의 유출구들(탭들)에 온수를 공급하기 위한 물 공급 시스템용 히터 배열 시스템과 같은 물 공급 시스템에서의 물/에너지 흐름 공공설비 관리에 관한 것이다. 구체적으로 말하면, 본 개시내용은 물 및/또는 에너지를 절약하기 위한 물 공급 시스템에서의 유출구로의 물 및/또는 에너지 흐름 낭비 감소에 관한 것이다."}
{"patent_id": "10-2023-7030647", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "상업용 환경이든 가정용 환경이든 일년 내내 하루 종일 온수가 필요하다. 온수를 공급하려면 깨끗한 물과 열원 양자 모두가 필요하다는 것은 말할 필요도 없다. 온수를 제공하기 위해, 예컨대 사용자에 의해 설정된 소정 온 도에 이르기까지 물을 가열하기 위해 종종 중앙집중식으로 이루어진 물 공급 시스템에 가열 시스템이 제공되고, 사용되는 열원은 통상적으로 하나 이상의 전기 가열 요소들이거나 천연 가스를 연소시킨 것이다. 현재 공익설비로서의 깨끗한 물이 많은 주목을 받고 있다. 깨끗한 물이 부족해짐에 따라 깨끗한 물의 절약에 대 해 대중을 교육함과 아울러 물의 흐름을 줄이기 위한 폭기 샤워기 및 탭, 움직임이 검출되지 않을 때 물의 흐름 을 멈추는 움직임 센서가 장착된 샤워기 및 탭 등과 같은, 물의 소비를 줄이는 시스템 및 장치를 개발하는데 많 은 노력이 이루어졌다. 그러나 이러한 시스템과 장치는 단일의 특정 용도로 제한되어 있으며 문제가 되는 물의 소비 습관에 미치는 영향은 단지 제한적이었다. 에너지 소비가 환경에 미치는 영향에 대한 우려가 커지면서, 최근 가정용 온수 공급 방식으로 열 펌프 기술을 이용하는 것에 대한 관심이 높아져 왔다. 열 펌프는 열원으로부터 열 저장소로 열에너지를 전달하는 장치이다. 비록 열원으로부터 열 저장소로 열에너지를 전달하는 작동을 달성하기 위해서는 열 펌프에 전기가 필요하지만, 열 펌프는 일반적으로 열 펌프의 성능 계수가 적어도 3 또는 4인 것이 전형적이므로 전기 저항 히터(전기 가열 요소)보다 효율적이다. 이것이 의미하는 것은 동일한 전기 사용 하에서 전기 저항 히터에 비해 열 펌프를 통해 사용자에게 최대 3배 또는 4배의 열량이 제공될 수 있다는 것이다. 열에너지를 반송(搬送)하는 열 전달 매체를 냉매(refrigerant)라고 알려져 있다. 공기(예컨대, 외부 공기 또는 집 내 더운 방의 공기) 또는 지열 열원(ground source)(예컨대, 지열 루프 또는 물로 채워진 보어홀(water filled borehole))의 열에너지는 수납형 열 교환기에 의해 추출되어 자급식 냉매(contained refrigerant)로 전 달된다. 현재 에너지가 상대적으로 높은 냉매는 압축됨으로써 냉매의 온도가 상당히 상승하게 되며, 현재 뜨거 운 이러한 냉매는 열 교환기를 통해 열에너지를 난방수 루프(heating water loop)로 교환한다. 온수 공급의 맥 락에서, 열 펌프에 의해 추출되는 열은 열에너지 저장소의 역할을 하는 단열 탱크 내 물로 전달될 수 있으며, 온수는 나중에 필요할 때 사용될 수 있다. 온수는 필요에 따라 하나 이상의 유출구, 예컨대, 탭, 샤워기, 라디 에이터로 전용(轉用)될 수 있다. 그러나 열 펌프는 일반적으로 물을 원하는 온도에 이르기까지 올리는 데 전기 저항 히터에 비해 더 많은 시간이 필요하다. 다양한 가정, 작업장 및 상업 공간에서는 온수 사용에 대한 요구사항과 선호도가 다르기 때문에 열 펌프가 전기 히터에 대한 실용적인 대안이 될 수 있게 하도록 새로운 온수 공급 방식이 바람직하다. 더욱이, 에너지와 물을 절약하기 위해서는, 물 및 에너지 흐름이 낭비되고 있을 때를 검출하고 그러한 낭비를 회피하려고 시도하는 적 절한 조치를 취하는 것이 바람직하다. 본 발명은 청구항 제1항에 기재된 바와 같은, 유출구에 제공되는 물 공급을 제어하기 위한 물 공급 시스템용 히 터 배열 시스템을 제공한다. 본 발명은 또한 청구항 제8항에 기재된 바와 같은, 유출구에 제공되는 물 공급을 제어하는 방법을 제공한다. 본 발명은 청구항 제12항 및 제13항에 기재된 바와 같은, 대응하는 프로그램 제품 및 제어 모듈을 추가로 제공 한다. 본 개시내용의 실시 예들은 지금부터 첨부도면들을 참조하여 설명될 것이다."}
{"patent_id": "10-2023-7030647", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 내용을 고려하여, 본 개시내용은 가정 환경에서 물과 에너지를 포함한 공익설비의 사용을 제어하기 위한 다양한 수법을 제공한다. 일 실시예에 의하면, 유출구로부터 나오는 온수의 온도 및/또는 유량은, (물의 낮은 유량에 기인한) 물 사용 및/또는 (물의 낮은 온도에 기인한) 에너지 사용이 필요하지 않을 때 감소되게 하도록 유출구 아래에 어떠한 물체도 없는 것으로 결정되는 경우 감소된다. 한 보완적인 실시 예에 의하면, 유출구에서 제1 기간 동안 계속해서 온수가 공급되고 있는 것으로 결정되는 경우 사운드 또는 섬광(閃光)과 같은 경보가 야기되고, 유출구에서 제1 기간보다 긴 제2 기간 동안 계속해서 온수가 공급되고 있는 것으로 결정되는 경우 온수 공급이 중단되며, 그럼으로써 불필요한 것으로 간주되는 경우 물 및/또는 에너지 사용이 감소되게 할 수 있고 더욱이 물이 넘치는 것이 방지되게 할 수 있다. 추가 보완적인 실시예에 의하면, 예를 들어 사용자에게 사용자 의 사용 습관을 수정할 것을 프롬프트하도록 수집된 온수 사용 데이터에 기초하여 보고서가 생성될 수 있다. 이하의 실시예들에서는, 개인 주택이나 상업 공간과 같은 건물 내 탭, 샤워기, 라디에이터 등을 포함하는 복수 개의 유출구에 중앙 집중식으로 이루어진 물 가열 시스템에 의해 온수가 공급된다. 상기 물 가열 시스템은 하나 이상의 전기 가열 요소들에 공급되는 에너지의 양에 의해 제어되는 온도로 냉수를 직접 가열하기 위한 하나 이 상의 전기 가열 요소들을 포함할 수 있다. 상기 물 가열 시스템은 예를 들어 주변으로부터 열에너지를 추출하기 위한 열 펌프 및/또는 열에너지 저장소의 형태로 덜 직접적이고 느리게 작동하지만 비용이 절약되고 환경 친화 적인 물 가열을 위한 열원을 더 포함할 수 있으며, 상기 열에너지 저장소는 예컨대 상기 열에너지 저장소 내에 저장된 열에너지의 양에 의해 결정되는 온도로 냉수를 가열하기 위해 나중에 추출될 열에너지를 저장하기 위한 상변화 물질을 포함한다. 상기 물 가열 시스템은 예를 들어 상기 열 펌프에 공급되는 전력을 활성화하거나 이와 는 달리 제어 및 조절하기 위해 하나 이상의 전기 가열 요소들에 공급되는 전력을 조절하도록 구성된, 상기 물 가열 시스템에 통신 가능하게 연결된 제어 모듈에 의해 제어된다. 물 공급 시스템 본 기법들의 실시 예들에서, 냉수 및 온수는 중앙 집중식 물 공급 시스템에 의해 가정용 또는 상업용 환경 내 건물용 탭, 샤워기, 라디에이터 등을 포함하는 복수 개의 유출구들에 제공된다. 일 실시 예에 따른 한 대표적인 물 공급 시스템은 도 1에 도시되어 있다. 본 실시 예에서, 상기 물 공급 시스템은 제어 모듈을 포함 하며, 상기 제어 모듈은 머신 학습 알고리즘(machine learning algorithm)을 포함할 수 있다. 상기 제어 모듈은 예를 들어 시스템 내부 및 외부로의 물 흐름을 제어하도록 배열된 하나 이상의 밸브들의 형태 를 이루는 흐름 제어부, 주변의 열을 추출하고 추출된 열을, 물을 가열하는데 사용되는 열에너지 저장소 에 축적하도록 구성된 (지열 열원(ground source) 또는 공기 열원(air source)) 열 펌프, 및 하나 이상의 전기 가열 요소들 - 하나 이상의 전기 가열 요소들은 하나 이상의 전기 가열 요소들에 공급되는 에너지량을 제어함으로써 냉수를 원하는 온도로 직접 가열하도록 구성됨 -; 을 포함하는, 상기 물 공 급 시스템의 여러 요소에 통신 가능하게 연결되고 상기 물 공급 시스템의 여러 요소를 제어하도록 구성된다. 그 후 온수는 상기 열에너지 저장소에 의해 가열되든 상기 전기 가열 요소들에 의해 가열되든 필요에 따 라 그리고 필요할 때 하나 이상의 유출구들에 보내진다. 상기 실시 예들에서, 상기 열 펌프는 주변으로부 터 열을 추출하여 추출된 열을 상기 열에너지 저장소 내 열에너지 저장 매체 내로 전달한다. 상기 열에너 지 저장 매체는 다른 열원들에 의해 추가로 가열될 수 있다. 상기 열에너지 저장 매체는 원하는 작동 온도에 도 달할 때까지 가열되고, 그 후에 냉수, 예컨대 본관으로부터의 냉수는 상기 열에너지 저장 매체에 의해 원하는 온도로 가열될 수 있다. 그 후에, 온수는 시스템 내 여러 유출구로 공급될 수 있다. 본 실시 예에서, 상기 제어 모듈은 복수 개의 센서들(170-1, 170-2, 170-3, ..., 170-n)로부터의 입력을 수신하도록 구성된다. 상기 복수 개의 센서들(170-1, 170-2, 170-3, ..., 170-n)은 예를 들어 실내 및/또는 실 외에 배치되는 하나 이상의 기온 센서들, 하나 이상의 수온 센서들, 하나 이상의 수압 센서들, 하나 이상의 타 이머들, 하나 이상의 움직임 센서들을 포함할 수 있으며, GPS 신호 수신기, 달력, 예컨대 거주자가 휴대하고 통 신 채널을 통해 상기 제어 모듈과 통신하는 스마트폰 상의 일기 예보 앱과 같은, 상기 물 공급 시스템에 직접 연계되어 있지 않은 다른 센서들을 포함할 수 있다. 본 실시 예에서, 상기 제어 모듈은 수신된 입력 을 사용하여 예를 들어 상기 흐름 제어부를 통해 열에너지 저장소 또는 전기 가열 요소들로 물 흐름을 제어하여 물을 가열하는 여러 제어 기능을 수행하도록 구성된다. 열 펌프가 일반적으로 전기 저항 히터에 비해 물을 가열하는 데 더 에너지 효율적이지만, 열 펌프에서는 충분한 양의 열에너지가 물을 가열하는 데 사용될 수 있기 전에 원하는 작동 온도에 도달하기 위해 충분한 양의 열에너 지를 열에너지 저장 매체로 전달하는데 시간이 소요되며, 따라서 열 펌프는 전기 저항 히터에 비해 동일한 양의 물을 동일한 온도로 가열하는 데 더 오랜 시간이 걸린다. 또한, 일부 실시 예들에서, 상기 열 펌프는 가열 시 고체로부터 액체로 변하는 상변화 물질(phase change material; PCM)을 열에너지 저장 매체로서 사용할 수 있다. 그러므로 액화된 열에너지 저장 매체의 온도를 추가로 높이기 전에 상기 PCM이 고형화되는 경우 상기 PCM 을 고체로부터 액체로 변화시키는데 추가 시간이 필요할 수 있다. 비록 이러한 물 가열 수법의 속도는 느리지만, 전기 가열 요소들에 비해 물을 가열하는 데 소비되는 에너지가 적어서, 전체적으로는 에너지가 절약 되고 온수를 공급하는데 드는 비용이 절감된다.상변화 물질 본 실시 예들에서는, 열 펌프용 열 저장 매체로서 상변화 물질이 사용될 수 있다. 하나의 적합한 클래스의 상변 화 물질은 가정용 온수 공급원용으로 그리고 열 펌프들과의 조합으로 사용하기 위해 관심 온도에서 고체-액체 상변화를 지니는 파라핀 왁스이다. 특히 관심이 있는 것은 섭씨 40 내지 60도(℃) 범위의 온도에서 녹는 파라핀 왁스이며, 이러한 범위 내에서 특정 애플리케이션들에 맞게 다양한 온도에서 녹는 왁스가 구해질 수 있다. 일반 적인 잠열 용량은 약 180kJ/kg 내지 230kJ/kg이며, 비열 용량은 액상에서 약 2.27Jg-1K-1, 고상에서 2.1Jg-1K-1이 다. 여기서 알 수 있는 점은 융합 잠열을 이용하여 매우 많은 양의 에너지가 저장될 수 있다는 것이다. 상변화 액체를 그의 녹는점 이상으로 가열함으로써 상대적으로 더 많은 에너지가 저장될 수도 있다. 예를 들어, 비수기 기간에 전기 비용이 상대적으로 낮은 경우 상기 열 펌프는 열에너지 저장소를 정상보다 높은 온도로 \"충전\"하여 열에너지 저장소를 \"과열(overheat)\"시키도록 작동될 수 있다. 적절히 선택된 왁스는 n-트리코산 C23 또는 파라핀 C20-C33과 같이 녹는점이 약 48℃인 왁스일 수 있으며, 이 때 문에 열 펌프가 약 51℃의 온도에서 작동하여야 하며 주방 탭, 샤워기/욕실 탭에 충분한 일반 가정용 온수의 경 우 약 45℃의 만족스러운 온도로 물을 가열하는 것이 가능하다. 원하는 경우 수온을 낮추기 위해 냉수가 흐름에 추가될 수 있다. 열 펌프의 온도 성능이 고려된다. 일반적으로 열 펌프에 의해 가열된 유체의 유입 온도와 유출 온도 간 최대 차이는 비록 10℃만큼 높을 수 있으나 5℃ 내지 7℃ 범위로 유지되는 것이 바람직하다. 파라핀 왁스가 열에너지 저장 매체로서 사용하기에는 바람직한 재료이지만, 다른 적합한 재료도 사용될 수 있다. 예를 들어, 염수화물(salt hydrates)은 현재의 것과 같은 잠열에너지 저장 시스템에도 적합하다. 이러한 맥락에서 염수화물은 무기염과 물의 혼합물이며, 상변화에서는 염수화물의 물 중의 전부 또는 대부분이 손실된 다. 상 전이시, 수화물 결정은 무수(또는 상대적으로 물이 덜 존재하는) 염과 물로 나뉜다. 염수화물의 이점은 파라핀 왁스보다 열 전도율이 훨씬 높고(2 내지 5배 더 높음) 상 전이에 따른 부피 변화가 훨씬 작다는 것이다. 현재 애플리케이션에 적합한 염수화물은 Na2S2O3·5H2O이며, 이에 대해 녹는점은 약 48℃ 내지 49℃이고 잠열은 200 내지 220kJ/kg이다. MLA들의 개요 당 업계에는 여러 다양한 유형의 MLA(machine learning algorithm)가 공지되어 있다. 대체로 보면, MLA에는 지 도 학습 기반 MLA, 비-지도 학습 기반 MLA, 강화 학습 기반 MLA의 세 가지 유형이 있다. 지도 학습 MLA 프로세스는 주어진 세트의 예측 변수들(또는 독립 변수들)로부터 예측되는 타깃-성과(target- outcome) 변수(또는 종속 변수)에 기초하여 이루어진다. 이러한 세트의 변수들을 사용하여 (훈련 중의) MLA는 입력을 원하는 출력에 매핑(mapping) 하는 함수를 생성한다. 훈련 프로세스는 MLA가 검증 데이터에 대해 원하는 레벨의 정확도를 달성할 때까지 속행된다. 지도 학습 기반 MLA의 예로는 회귀, 의사결정 트리, 랜덤 포레스트, 로지스틱 회귀 등이 있다. 비-지도 학습 MLA에는 타깃 또는 성과 변수 자체를 예측하는 것이 포함되지 않는다. 이러한 MLA는 가치들의 집 단(population of values)을 다양한 그룹으로 클러스터링하는 데 사용되며, 이는 특정 개입을 위해 고객들을 다 양한 그룹으로 분할하는 데 널리 사용된다. 비-지도 학습 MLA의 예로는 어프라이오리(Apriori) 알고리즘, K-평 균이 있다. 강화 학습 MLA는 특정한 결정을 내리도록 훈련된 것이다. 훈련 중에, MLA는 시행착오를 통해 지속적으로 자체 훈련하는 훈련 환경에 노출된다. MLA는 과거 경험을 통해 배우고 정확한 결정을 내리기 위해 가능한 최고의 지 식을 포획하려고 시도한다. 강화 학습 MLA의 일 예는 마르코프(Markov) 결정 프로세스이다. 여기서 이해하여야 할 점은 다양한 구조나 토폴로지를 지니는 다양한 유형의 MLA가 여러 태스크에 사용될 수 있 다는 것이다. 한 특정 유형의 MLA에는 신경 네트워크(neural network; NN)로서 공지된 인공 신경 네트워크 (artificial neural network; ANN)가 포함된다. 신경 네트워크(NN) 일반적으로 말하면, 주어진 NN은 계산에 대한 커넥셔니스트 수법(connectionist approach)을 사용하여 정보를 프로세싱하는 인공 \"뉴런(neuron)\"들의 상호연결된 그룹으로 이루어진다. NN은 입력과 출력 간의 복잡한 관계를 (실제로는 상기 관계를 알지 못한 채) 모델링하거나 데이터 내 패턴을 찾아내는 데 사용된다. NN은 먼저 알고 있는 세트의 \"입력\"들과 (모델링되려고 시도되고 있는 주어진 상황에 대해) 적절한 출력을 생성하도록 NN을 적응시키기 위한 정보가 NN에 제공되는 훈련 단계에서 조정(conditioning)된다. 이러한 훈련 단계 동안, 주어진 NN은 학습 되고 있는 상황에 적응하고 주어진 NN이 (학습된 상황에 기초하여) 새로운 상황에서 주어진 입력에 대해 합리적인 예측 출력을 제공할 수 있게 하도록 주어진 NN의 구조를 변경한다. 따라서 주어진 NN은, 주어진 상황에 대한 복잡한 통계적 배열이나 수학적 알고리즘을 결정하려고 시도하기보다는 상황에 대한 \"인상 (feeling)\"에 기초하여 \"직관적인\" 답변을 제공하는 것을 목표로 한다. 따라서 주어진 NN은 \"박스(box)\" 내에서 이루어지는 것이 중요하지 않은 상황에서 주어진 세트의 입력들에 대해 합리적인 답변을 결정하는 데 사용될 수 있는 훈련된 \"블랙 박스(black box)\"로서 간주 된다. NN은 일반적으로 주어진 입력에 기초하여 출력을 알아내는 것이 중요하지만 그러한 출력이 어떻게 파생되는지가 상대적으로 덜 중요하거나 중요하지 않은 많은 상황에서 사용된다. 예를 들어, NN은 필터링, 클러스터링, 신호 분리, 압축, 벡터 생성 등을 포함해 서버 간 그리고 데이터 프로세싱 내 웹-트래픽의 배포를 최적화하는 데 일 반적으로 사용된다. 심층 신경 네트워크 본 기술의 일부 비-제한적인 실시 예들에서, NN은 심층 신경 네트워크로서 구현될 수 있다. 여기서 이해하여야 할 점은 NN이 여러 클래스의 NN들로 분류될 수 있으며 이러한 클래스들의 NN들 중 하나의 클래스의 NN들이 순환 신경 네트워크(recurrent neural network; RNN)들을 포함한다는 것이다. 순환 신경 네트워크(RNN) RNN은 RNN의 \"내부 상태\"(저장된 메모리)를 사용하여 입력 시퀀스를 프로세싱하도록 이루어진다. 이는 RNN을 예 를 들어 분할되지 않은 수기 인식(handwriting recognition) 및 음성 인식과 같은 태스크들에 매우 적합하게 한 다. RNN의 이러한 내부 상태는 제어될 수 있으며 \"게이팅된(gated)\" 상태 또는 \"게이팅된\" 메모리로서 언급된다. 또한 여기서 유념하여야 할 점은 RNN 자체 역시 다양한 하위-클래스의 RNN들로 분류될 수 있다는 것이다. 예를 들어, RNN은 LSTM(Long Short-Term Memory) 네트워크, GRU(Gated Recurrent Unit), BRNN(Bidirectional RNN) 등을 포함한다. LSTM 네트워크는 어떤 의미에서는 이전에 매우 짧고 개별적인 시간 단계 동안 이루어졌던 이벤트들에 대한 \"메 모리들\"이 필요한 태스크들을 학습할 수 있는 심층 학습 시스템이다. LSTM 네트워크의 토폴로지는 LSTM 네트워 크가 수행하기 위해 \"학습\"하는 특정 태스크들에 기초하여 달라질 수 있다. 예를 들어, LSTM 네트워크는 이벤트 들 간에 상대적으로 긴 지연들이 발생하거나 이벤트들이 낮은 빈도와 높은 빈도에서 함께 발생하는 태스크들을 수행하도록 학습할 수 있다. 특정 게이팅된 메커니즘을 지니는 RNN은 GRU로서 언급된다. LSTM 네트워크와는 달 리, GRU에는 \"출력 게이트\"가 없으므로 LSTM 네트워크보다 매개변수가 적다. BRNN에는 과거와 미래 상태의 정보 를 사용하여 허용 가능한 양 방향으로 연결된 뉴런의 \"은닉 계층(hidden layer)\"이 있을 수 있다. 잔여 신경 네트워크(ResNet) 본 기술의 비-제한적인 실시 예들을 구현하는 데 사용될 수 있는 NN의 또 다른 예는 ResNet(residual neural network)이다. 심층 네트워크는 물론 낮은/중간/높은 레벨의 특징들과 분류자들을 엔드-투-엔드 다층 방식으로 통합하며, 그러 한 \"레벨\"의 특징들은 적층된 계층들의 개수(깊이) 만큼 풍부해질 수 있다."}
{"patent_id": "10-2023-7030647", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하자면, 본 기술의 맥락에서 하나 이상의 MLA들 중 적어도 일부의 구현은 크게 훈련 단계와 사용 단계의 2 개의 단계로 분류될 수 있다. 먼저, 주어진 MLA는 하나 이상의 적절한 훈련 데이터 세트들을 사용하여 상기 훈 련 단계에서 훈련된다. 그 후에, 일단 주어진 MLA가 입력으로서 예상할 데이터와 출력으로서 제공할 데이터를 학습하면 상기 사용 단계에서 사용 중인 데이터를 사용하여 주어진 MLA가 실행된다. 도 2는 예를 들어 가정 환경에서 공공설비 사용을 제어하는 방법의 일 실시예를 보여준다. 본 방법은 유출구(예 컨대, 욕실 세면대 탭)가 유출구로부터 원격으로 배치된 물 가열 시스템에 의해 공급되는 온수를 받기 위해 사 용자에 의해 작동되거나 턴온되는 경우 참조번호 S2001에서 시작되며, 상기 물 가열 시스템은 유출구 아래에 물 체(예를 들어, 손을 씻고 있는 사람의 손)가 존재함을 감지하기 위해 유출구에 배치되거나 유출구 부근에 배치 되는 센서(예를 들어, 도 1에 도시된 센서들 중 하나의 센서(170-n)와 통신하는 도 1의 제어 모듈에 의해 제어 된다. 참조번호 S2002에서, 상기 제어 모듈은 상기 센서로부터의 신호를 수신하고 참조번호 S2003에서 유 출구 아래에 물체가 존재하는 지를 결정한다. 물체가 존재한다고 상기 제어 모듈이 결정하면, 상기 방법은 참조번호 S2002로 뒤돌아가고 상기 제어 모듈은 상기 센서로부터의 신호를 계속 모니터링한다. 유출구 아래에 어떠 한 물체도 존재하지 않는 것으로 상기 제어 모듈이 결정하면, 참조번호 S2004에서 상기 제어 모듈은 상기 물 가 열 시스템을 제어하여 유출구로 공급되는 온수의 온도를 낮추고 그리고/또는 유출구로 공급되는 온수의 유량을 감소시킨다. 그 후에, 상기 방법은 참조번호 S2002로 되돌아가고 상기 제어 모듈은 상기 센서로부터의 신호를 계속 모니터링한다. 그렇게 하면 온수는 유출구로 계속 공급될 수 있지만 에너지 및/또는 물 사용이 줄어들게 된다. 예를 들어, 사용자가 탭 아래에서 온수로 자신의 손을 씻을 때, 사용자가 예컨대 비누에 손을 뻗도록 탭 아래에서 자신의 손을 떼는 경우, 상기 제어 모듈은 온도와 온수의 흐름을 줄여 에너지와 물을 절약할 수 있으 며, 그 후에 일단 사용자가 탭으로 자신의 손을 복귀시키면, 온도와 온수의 흐름이 초기 레벨로 되돌려질 수 있 게 된다. 사용자가 탭을 턴오프하는 것을 잊어버릴 수 있는 경우가 있을 수 있다. 따라서, 대안 실시예에서 또는 이전 실 시예에 추가하여, 유출구가 온수를 공급하도록 작동되면, 상기 제어 모듈과 통신하는 타이머가 경과 시간을 기 록하도록 작동된다. 참조번호 S2005에서, 상기 제어 모듈은 상기 타이머로부터의 신호를 수신하여 유출구로부터 온수를 계속 공급하는 데 소요되는 경과 시간(T)을 결정한다. 참조번호 S2006에서 경과 시간(T)이 사전에 결정 된 제1 임계값(T1)을 초과하지 않는 것으로 상기 제어 모듈이 결정하면, 상기 방법은 참조번호 S2005로 되돌아 가고 상기 제어 모듈은 상기 타이머로부터의 신호를 계속 모니터링한다. 참조번호 S2006에서 경과 시간(T)이 제 1 임계값(T1)을 초과하는 것으로 상기 제어 모듈이 결정하면, 상기 제어 모듈은 참조번호 S2007에서 경보 시퀀 스를 야기시키고, 상기 경보 시퀀스는 온수가 더는 필요하지 않은 경우 유출구를 턴오프시킬 것을 사용자에게 프롬프트하도록 유출구가 시간(T1) 동안 계속 턴온되어 있음을 사용자에게 알려주기 위한 유출구에서나 또는 유 출구 부근에서의 사운드의 생성 또는 광신호의 활성화를 포함할 수 있다. 참조번호 S2008에서, 상기 제어 모듈 은 경과 시간(T)이 제1 임계값(T1)보다 큰 사전에 결정된 제2 임계값(T2)을 초과하는지를 결정한다. 경과 시간 (T)가 상기 제2 임계값(T2)을 초과하지 않는 것으로 결정되면, 상기 방법은 참조번호 S2005로 되돌아가고 상기 제어 모듈은 상기 타이머로부터의 신호를 계속 모니터링한다. 상기 참조번호 S2008에서 경과 시간(T)이 상기 제 2 임계값(T2)을 초과하는 것으로 상기 제어 모듈이 결정하면, 그 후에 상기 제어 모듈은 유출구가 완전히 폐쇄 되도록 상기 물 가열 시스템을 제어하고, 그럼으로써 참조번호 S2009에서 유출구로의 온수 공급을 중단한다. 이 렇게 하면 온수가 더는 필요하지 않을 때 에너지와 물이 낭비되지 않게 된다. 예를 들어, 사용자가 손을 씻은 후 탭을 턴오프하는 것을 잊어버리거나 어린이가 놀기 위해 탭을 턴온해 놓은 경우, 온수의 공급이 자동으로 중 단되어 에너지와 물을 절약할 수 있게 된다. 상기 2개의 임계값(T1, T2)은, 사전에 결정된 값들인 것 외에도, 물의 사용이 특정한 가정용 또는 상업용 건물에 대해 일반적인 상황에서 경보가 발생되지 않고 물이 턴오프되지 않도록 특정 건물 내 물 흐름의 과거 사용에 기초하여 훈련된 (심층 학습, 또는 다른 MLA와 같은) 인공지능 알 고리즘에 따라 예측값을 획득함으로써 결정될 수 있다. 일 실시예에서, 시간 경과에 따라 수집된 온수 사용 데이터(S2010)는 사용자에게 에너지 및 물 사용을 줄이기 위해 사용자의 사용 습관을 검토하고 잠재적으로 수정할 것을 프롬프트하는 도구로서 사용 보고서를 생성 (S2011)하는 데 사용될 수 있다. 상기 제어 모듈은 위에서 설명되고 도 2의 단계들에 도시된 기능들을 수행하도록 소프트웨어로 프로그래밍 된다. 대안으로, 상기 제어 모듈은 위에서 설명한 기능들을 수행하기 위해 하드웨어 로직으로 고정배선된다. 당업자라면 이해하겠지만, 본 기법들은 시스템, 방법 또는 컴퓨터 프로그램 제품으로서 구현될 수 있다. 따라서, 본 기법들은 완전한 하드웨어 실시 예, 완전한 소프트웨어 실시 예, 또는 소프트웨어와 하드웨어를 조 합한 실시 예의 형태를 취할 수 있다. 더욱이, 본 기법들은 컴퓨터 판독가능 프로그램 코드가 구현된 컴퓨터 판독가능 매체에 구현된 컴퓨터 프로그램 제품의 형태를 취할 수 있다. 상기 컴퓨터 판독가능 매체는 컴퓨터 판독가능 신호 매체 또는 컴퓨터 판독가능 저장 매체일 수 있다. 컴퓨터 판독가능 매체는 예를 들어 전자, 자기, 광학, 전자기, 적외선, 반도체 시스템, 장치 또는 기기, 또는 이들의 임의의 적합한 조합일 수 있지만 이에 국한되지는 않는다. 본 기법들의 작동들을 수행하기 위한 컴퓨터 프로그램 코드는 객체-지향 프로그래밍 언어 및 기존의 절차적 프 로그래밍 언어를 포함하는 하나 이상의 프로그래밍 언어의 임의의 조합으로 작성될 수 있다. 예를 들어, 본 기법들의 작동을 수행하기 위한 프로그램 코드는 C와 같은 (인터프리트되거나 컴파일된) 기존 프 로그래밍 언어로 이루어진 소스, 객체 또는 실행가능 코드, 또는 어셈블리 코드, ASIC(Application Specific Integrated Circuit) 또는 FPGA(Field Programmable Gate Array)를 설정하거나 제어하기 위한 코드, 또는 VerilogTM 또는 VHDL(Very high-speed integrated circuit Hardware Description Language)과 같은 하드웨어설명 언어용 코드를 포함할 수 있다. 코드 구성요소들은 절차, 방법 등으로서 구체화될 수 있으며 고유 명령어 세트의 직접 기계 명령어들에서부터 상위 레벨의 컴파일되거나 인터프리트된 언어 구성들에 이루기까지 임의의 추상화 레벨에서 명령어들 또는 명령 어 시퀀스들의 형태를 취할 수 있는 하위 구성요소들을 포함할 수 있다. 또한, 당업자에게 명백하게 되겠지만, 본 기법들의 바람직한 실시 예들에 따른 논리적 방법의 전부 또는 일부는 방법의 단계들을 수행하기 위해 논리 요소들을 포함하는 논리 장치에서 적절하게 구체화될 수 있으며, 이러한 논리 요소들은 예를 들어 프로그램 가능한 논리 어레이 또는 주문형 집적회로 내 논리 게이트들과 같은 구성요 소들을 포함할 수 있다. 이러한 논리 배열은 예를 들어 고정되거나 또는 전송 가능한 캐리어 매체를 사용하여 저장 및 전송될 수 있는 가상 하드웨어 디스크립터 언어를 사용하여 이러한 어레이 또는 회로 내 논리 구조들을 일시적으로 또는 영구적으로 확립하기 위한 요소들을 인에이블(enable)하는 데 추가로 구체화될 수 있다. 여기에서 인용된 예들 및 조건부 언어는 독자가 본 기술의 원리를 이해하는 데 도움을 주도록 의도된 것이며 그 의 범위를 이러한 구체적으로 인용된 예들 및 조건으로 국한하려고 의도된 것이 아니다. 당업자라면 이해하겠지 만, 당업자는 여기에 명시적으로 설명되거나 도시되지는 않았지만 그럼에도 본 기술의 원리를 구체화하고 첨부 된 청구범위에 정의된 바와 같은 본 기술의 범위 내에 포함되는 여러 배열을 고안할 수 있다. 또한, 이해를 돕기 위해, 위의 설명은 본 기술의 비교적 단순화된 구현들을 설명한 것일 수 있다. 당업자라면 이해하겠지만, 본 기술의 여러 구현은 더 복잡한 것일 수 있다. 어떤 경우에는, 본 기술에 대한 수정들의 도움 되는 예들이라고 생각되는 것이 제시될 수도 있다. 이는 단지 이 해를 돕기 위한 것뿐이며, 본 기술의 범위를 제한하거나 범위를 설정하려는 것이 아니다. 이러한 수정들은 완전 한 리스트가 아니며, 당업자는 그럼에도 본 기술의 범위 내에 있으면서 다른 수정을 할 수 있다. 또한, 어떠한 수정의 예들도 제시되지 않은 경우, 수정이 가능하지 않다는 것으로 그리고/또는 설명된 내용이 본 기술의 해당 요소를 구현하는 유일한 방식인 것으로 해석되어서는 아니 된다. 더욱이, 본 기술의 원리, 실시형태 및 구현뿐만 아니라 본 기술의 특정 예들을 인용하는 모든 설명은 현재 공지 되어 있든 미래에 개발되든 구조적 및 기능적 등가물을 모두 포함하도록 의도된 것이다. 따라서, 예를 들어, 당 업자라면 이해하겠지만, 여기에서의 임의의 블록도가 본 기술의 원리를 구체화하는 예시적인 회로의 개념도를 나타낸다. 마찬가지로, 당업자라면 이해하겠지만, 임의의 플로차트, 흐름도, 상태 전이도, 의사 코드 등은 컴퓨 터 판독가능 매체에 실질적으로 표현될 수 있고 그래서 컴퓨터 또는 프로세서가 명시적으로 도시되어 있든 도시 되어 있지 않든 컴퓨터 또는 프로세서에 의해 실행될 수 있는 여러 프로세스를 나타낸다. 도면들에 도시된 여러 요소의 기능들은 전용 하드웨어와 아울러 적절한 소프트웨어와 연계하여 소프트웨어를 실 행할 수 있는 하드웨어의 사용을 통해 제공될 수 있다. 프로세서 또는 제어 모듈에 의해 제공되는 경우, 상기 기능들은 단일 전용 프로세서, 단일 공유 프로세서, 또는 복수 개의 개별 프로세서들에 의해 제공될 수 있으며, 그 중 일부는 공유될 수 있다. 더욱이, \"프로세서\" 또는 \"컨트롤러\"라는 용어의 명시적인 사용은 소프트웨어를 실행할 수 있는 하드웨어만을 언급하는 것으로 해석되어서는 아니 되며, 디지털 신호 프로세서(DSP) 하드웨어, 네트워크 프로세서, 주문형 집적회로(ASIC), 필드 프로그램가능 게이트 어레이(FPGA), 소프트웨어 저장을 위한 판독 전용 메모리(ROM), RAM(random access memory) 및 비휘발성 저장소를 제한을 두지 않고 암시적으로 포함할 수 있다. 기존 및/또는 맞춤형의 기타 하드웨어도 포함될 수 있다. 소프트웨어 모듈들, 또는 간단히 소프트웨어라고 암시되는 모듈들은 여기에서 프로세스 단계의 수행 및/또는 텍 스트 설명을 나타내는 플로차트 요소들 또는 기타 요소들의 임의 조합으로서 표현될 수 있다. 이러한 모듈들은 명시적으로 또는 암시적으로 도시된 하드웨어에 의해 실행될 수 있다. 당업자에게는 명백해지겠지만, 본 기법들의 범위를 벗어나지 않고 전술한 대표적인 실시 예들에 대해 많은 개선 및 수정이 이루어질 수 있다.도면 도면1 도면2"}
{"patent_id": "10-2023-7030647", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 대표적인 물 공급 시스템의 개략적인 시스템 개요를 보여주는 도면이다. 도 2는 한 대표적인 물 공급 시스템에서의, 에너지 및/또는 물의 흐름의 일시적인 감소에 관련된 단계들을 보여 주는 흐름도이다."}
