{"patent_id": "10-2022-0135420", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0055922", "출원번호": "10-2022-0135420", "발명의 명칭": "무인 이동체, 무인 이동체의 엘리베이터 승하차 결정 방법, 시스템 및 프로그램", "출원인": "주식회사 클로봇", "발명자": "함형하"}}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무인 이동체의 엘리베이터 승하차 결정 방법에 있어서,상기 엘리베이터의 문이 열리기 전에, 상기 엘리베이터에 장착된 무게 센서를 통해 획득된 엘리베이터의 무게정보를 수신받는 단계;상기 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 상기 엘리베이터의 문이 열리면, 상기 무인 이동체의 카메라를 통해 획득된 영상 내의 물체를 수신받는 단계;상기 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로이동하는 단계;상기 영상 내의 물체가 상기 제1 시간 동안 충돌 감지 영역에 있는 경우, 상기 영상 내의 물체에게 상기 충돌감지 영역에서 벗어나도록, 상기 무인 이동체의 스피커를 통해 음성으로 알리는 단계;상기 음성으로 알림이 완료되고, 상기 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 없는 경우,기 설정된 정지 동작과 이동 동작을 반복하여 목표 탑승 지점으로 이동하는 단계; 및상기 목표 탑승 지점으로 이동이 완료되고, 상기 무인 이동체와 통신을 수행하는 서버로부터 긴급 하차 정보 및다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받으면, 상기 엘리베이터의 문이 열릴 때에 하차하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 이동 단계는,상기 영상 내의 물체가 상기 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 상기 기 설정된 정지 동작과 이동 동작을 반복하여 상기 목표 탑승 지점으로 이동하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 하차 단계는,상기 긴급 하차 정보 및 상기 다른 목적지에서 필요한 긴급 작업 정보를 수신받으면, 기 설정된 목적지의 층에도달하기 전의 이전 층에서 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 하차 단계는,상기 목표 탑승 지점으로 이동이 완료되고, 상기 무인 이동체의 음성 인식부를 통해 적어도 하나의 탑승자로부터 위급 상황에 대한 음성 데이터를 더 수신받으며,상기 음성 데이터의 수신이 완료되면, 상기 카메라를 통해 획득된 위급 상황에 대한 영상을 더 수신받고,상기 위급 상황에 대한 영상 내의 객체를 기반으로 위급 상황인지를 더 판단하며,상기 위급 상황이면, 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0055922-3-엘리베이터까지의 이동 경로와 목적지까지의 이동 경로가 저장된 메모리; 및상기 엘리베이터의 승하차를 결정하기 위한 동작을 제어하는 프로세서를 포함하고,상기 프로세서는,상기 엘리베이터의 문이 열리기 전에, 상기 엘리베이터에 장착된 무게 센서를 통해 획득된 엘리베이터의 무게정보를 수신받으며,상기 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 상기 엘리베이터의 문이 열리면, 카메라를 통해획득된 영상 내의 물체를 수신받고,상기 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로이동하며,상기 영상 내의 물체가 상기 제1 시간 동안 충돌 감지 영역에 있는 경우, 상기 영상 내의 물체에게 상기 충돌감지 영역에서 벗어나도록, 스피커를 통해 음성으로 알리고,상기 음성으로 알림이 완료되고, 상기 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 없는 경우,기 설정된 정지 동작과 이동 동작을 반복하여 목표 탑승 지점으로 이동하며,상기 목표 탑승 지점으로 이동이 완료되고, 서버로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업정보 중 적어도 하나를 수신받으면, 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 하는, 무인 이동체."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 프로세서는,상기 영상 내의 물체가 상기 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 상기 기 설정된 정지 동작과 이동 동작을 반복하여 상기 목표 탑승 지점으로 이동하는 것을 특징으로 하는, 무인 이동체."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 프로세서는,상기 긴급 하차 정보 및 상기 다른 목적지에서 필요한 긴급 작업 정보를 수신받으면, 기 설정된 목적지의 층에도달하기 전의 이전 층에서 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 하는, 무인 이동체."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 목표 탑승 지점으로 이동이 완료되고, 상기 무인 이동체의 음성 인식부를 통해 적어도 하나의 탑승자로부터 위급 상황에 대한 음성 데이터를 더 수신받으며,상기 음성 데이터의 수신이 완료되면, 상기 카메라를 통해 획득된 위급 상황에 대한 영상을 더 수신받고,상기 위급 상황에 대한 영상 내의 객체를 기반으로 위급 상황인지를 더 판단하며,상기 위급 상황이면, 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 하는, 무인 이동체."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "엘리베이터의 승하차를 결정하는 무인 이동체;상기 엘리베이터의 일측에 장착되고, 상기 무인 이동체와 통신을 수행하는 무게 센서; 및상기 무인 이동체와 통신을 수행하고, 상기 무인 이동체에 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작공개특허 10-2024-0055922-4-업 정보를 제공하는 서버; 를 포함하며,상기 무인 이동체는,상기 엘리베이터의 문이 열리기 전에, 상기 무게 센서를 통해 획득된 엘리베이터의 무게 정보를 수신받으며,상기 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 상기 엘리베이터의 문이 열리면, 카메라를 통해획득된 영상 내의 물체를 수신받고,상기 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로이동하며,상기 영상 내의 물체가 상기 제1 시간 동안 충돌 감지 영역에 있는 경우, 상기 영상 내의 물체에게 상기 충돌감지 영역에서 벗어나도록, 스피커를 통해 음성으로 알리고,상기 음성으로 알림이 완료되고, 상기 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 없는 경우,기 설정된 정지 동작과 이동 동작을 반복하여 목표 탑승 지점으로 이동하며,상기 목표 탑승 지점으로 이동이 완료되고, 상기 서버로부터 상기 긴급 하차 정보 및 상기 다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받으면, 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로하는, 무인 이동체의 엘리베이터 승하차 결정 시스템."}
{"patent_id": "10-2022-0135420", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 컴퓨터와 결합되어, 제1항 내지 제4항 중 어느 한 항의 무인 이동체의 엘리베이터 승하차 결정 방법을 실행시키기 위하여 컴퓨터 판독 가능한 기록 매체에 저장된, 프로그램."}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 무인 이동체의 엘리베이터 승하차 결정 방법에 있어서, 엘리베이터의 문이 열리기 전에, 엘리베이터에 장착된 무게 센서를 통해 획득된 엘리베이터의 무게 정보를 수신받는 단계; 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 엘리베이터의 문이 열리면, 무인 이동체의 카메라를 통해 획득된 영상 내의 물체를 수신받 (뒷면에 계속)"}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무인 이동체에 관한 것이다. 보다 상세하게는, 본 개시는 무인 이동체, 무인 이동체의 엘리베이터 승 하차 결정 방법, 시스템 및 프로그램에 관한 것이다."}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업혁명 시대를 맞이하여 유통, 호텔, 물류 등 다양한 산업 분야에서 무인 이동체의 도입이 증가하는 추세 이다. 일반적으로, 무인 이동체는 엘리베이터를 탑승하려고 할 때에, 엘리베이터의 대기 존으로 이동하고, 엘리베이터 의 문이 열리면, 엘리베이터의 탑승을 시도하였다. 그런데, 종래 무인 이동체는 엘리베이터의 승차 여부를 빠르게 결정하지 못하여, 목표 탑승 지점으로 이동을 완 료하는데에 소요되는 시간이 증가하였다. 또한, 종래 무인 이동체는 엘리베이터의 탑승을 시도하다가 탑승이 불가능할 경우, 엘리베이터로부터 하차하므 로, 엘리베이터를 이용하는 사람들에게 불편함을 제공하였다. 따라서, 최근에는 엘리베이터의 승하차 여부를 빠르게 결정하여, 엘리베이터의 탑승 가능시에 물체와의 충돌없 이 목표 탑승 지점으로 이동을 완료하거나, 엘리베이터의 탑승 불가능시에 엘리베이터의 탑승을 시도하지 않고 엘리베이터를 빠르게 보낼 수 있으며, 작업 수행 취소에 따른 긴급 하차 또는 위급 상황에 따른 하차를 빠르게 수행할 수 있는 무인 이동체의 연구가 지속적으로 행해져 오고 있다. 선행기술문헌 특허문헌"}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "(특허문헌 0001) 대한민국 공개특허공보 제10-2022-0009078호(2022.01.24) 발명의 내용"}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에 개시된 실시예는, 엘리베이터의 탑승 가능시에, 물체와의 충돌없이 목표 탑승 지점으로 이동을 완료 할 수 있는 것을 제공하는데 그 목적이 있다. 또한, 본 개시에 개시된 실시예는, 엘리베이터의 탑승 불가능시에, 엘리베이터의 탑승을 시도하지 않고, 엘리베 이터를 빠르게 보낼 수 있는 것을 제공하는데 그 목적이 있다. 또한, 본 개시에 개시된 실시예는, 작업 수행 취소에 따른 긴급 하차 또는 위급 상황에 따른 하차를 빠르게 수 행할 수 있는 것을 제공하는데 그 목적이 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 본 개시의 일 측면에 따른 무인 이동체의 엘리베이터 승하차 결정 방법은, 상기 엘리베이터의 문이 열리기 전에, 상기 엘리베이터에 장착된 무게 센서를 통해 획득된 엘리베이터의 무게 정보를 수신받는 단계; 상기 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 상기 엘리베이터의 문이 열리면, 상기 무인 이동체의 카메라를 통해 획득된 영상 내의 물체를 수신받는 단계; 상기 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로 이동하는 단계; 상기 영상 내의 물체가 상기 제1 시간 동안 충돌 감지 영역에 있는 경우, 상기 영상 내의 물체에게 상기 충돌 감지 영역에 서 벗어나도록, 상기 무인 이동체의 스피커를 통해 음성으로 알리는 단계; 상기 음성으로 알림이 완료되고, 상 기 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 정지 동작과 이동 동작 을 반복하여 목표 탑승 지점으로 이동하는 단계; 및 상기 목표 탑승 지점으로 이동이 완료되고, 상기 무인 이동 체와 통신을 수행하는 서버로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받으면, 상기 엘리베이터의 문이 열릴 때에 하차하는 단계; 를 포함할 수 있다. 또한, 상기 이동 단계는, 상기 영상 내의 물체가 상기 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 상기 기 설정된 정지 동작과 이동 동작을 반복하여 상기 목표 탑승 지점으로 이동하는 것을 특징으로 할 수 있 다. 또한, 상기 하차 단계는, 상기 긴급 하차 정보 및 상기 다른 목적지에서 필요한 긴급 작업 정보를 수신받으면, 기 설정된 목적지의 층에 도달하기 전의 이전 층에서 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으 로 할 수 있다. 또한, 상기 하차 단계는, 상기 목표 탑승 지점으로 이동이 완료되고, 상기 무인 이동체의 음성 인식부를 통해 적어도 하나의 탑승자로부터 위급 상황에 대한 음성 데이터를 더 수신받으며, 상기 음성 데이터의 수신이 완료 되면, 상기 카메라를 통해 획득된 위급 상황에 대한 영상을 더 수신받고, 상기 위급 상황에 대한 영상 내의 객 체를 기반으로 위급 상황인지를 더 판단하며, 상기 위급 상황이면, 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 할 수 있다. 또한, 본 개시의 다른 측면에 따른 무인 이동체는, 엘리베이터까지의 이동 경로와 목적지까지의 이동 경로가 저 장된 메모리; 및 상기 엘리베이터의 승하차를 결정하기 위한 동작을 제어하는 프로세서를 포함하고, 상기 프로 세서는, 상기 엘리베이터의 문이 열리기 전에, 상기 엘리베이터에 장착된 무게 센서를 통해 획득된 엘리베이터 의 무게 정보를 수신받으며, 상기 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 상기 엘리베이터의 문이 열리면, 카메라를 통해 획득된 영상 내의 물체를 수신받고, 상기 영상 내의 물체가 기 설정된 제1 시간 동 안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로 이동하며, 상기 영상 내의 물체가 상기 제1 시 간 동안 충돌 감지 영역에 있는 경우, 상기 영상 내의 물체에게 상기 충돌 감지 영역에서 벗어나도록, 스피커를 통해 음성으로 알리고, 상기 음성으로 알림이 완료되고, 상기 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 정지 동작과 이동 동작을 반복하여 목표 탑승 지점으로 이동하며, 상기 목표 탑승 지점으로 이동이 완료되고, 서버로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보 중 적 어도 하나를 수신받으면, 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 할 수 있다. 또한, 상기 프로세서는, 상기 영상 내의 물체가 상기 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 상 기 기 설정된 정지 동작과 이동 동작을 반복하여 상기 목표 탑승 지점으로 이동하는 것을 특징으로 할 수 있다. 또한, 상기 프로세서는, 상기 긴급 하차 정보 및 상기 다른 목적지에서 필요한 긴급 작업 정보를 수신받으면, 기 설정된 목적지의 층에 도달하기 전의 이전 층에서 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으 로 할 수 있다. 또한, 상기 프로세서는, 상기 목표 탑승 지점으로 이동이 완료되고, 상기 무인 이동체의 음성 인식부를 통해 적 어도 하나의 탑승자로부터 위급 상황에 대한 음성 데이터를 더 수신받으며, 상기 음성 데이터의 수신이 완료되 면, 상기 카메라를 통해 획득된 위급 상황에 대한 영상을 더 수신받고, 상기 위급 상황에 대한 영상 내의 객체 를 기반으로 위급 상황인지를 더 판단하며, 상기 위급 상황이면, 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 할 수 있다. 또한, 본 개시의 또 다른 측면에 따른 무인 이동체의 엘리베이터 승하차 결정 시스템은, 엘리베이터의 승하차를 결정하는 무인 이동체; 상기 엘리베이터의 일측에 장착되고, 상기 무인 이동체와 통신을 수행하는 무게 센서; 및 상기 무인 이동체와 통신을 수행하고, 상기 무인 이동체에 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보를 제공하는 서버; 를 포함하며, 상기 무인 이동체는, 상기 엘리베이터의 문이 열리기 전에, 상기 무 게 센서를 통해 획득된 엘리베이터의 무게 정보를 수신받으며, 상기 엘리베이터의 무게 정보가 기 설정된 수준 을 만족할 경우, 상기 엘리베이터의 문이 열리면, 카메라를 통해 획득된 영상 내의 물체를 수신받고, 상기 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로 이동하며, 상기 영상 내의 물체가 상기 제1 시간 동안 충돌 감지 영역에 있는 경우, 상기 영상 내의 물체에게 상기 충돌 감지 영역에서 벗어나도록, 스피커를 통해 음성으로 알리고, 상기 음성으로 알림이 완료되고, 상기 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 정지 동작과 이동 동작을 반복하여 목 표 탑승 지점으로 이동하며, 상기 목표 탑승 지점으로 이동이 완료되고, 상기 서버로부터 상기 긴급 하차 정보 및 상기 다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받으면, 상기 엘리베이터의 문이 열릴 때에 하차하는 것을 특징으로 할 수 있다. 이 외에도, 본 개시를 구현하기 위한 실행하기 위한 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 더 제공될 수 있다. 이 외에도, 본 개시를 구현하기 위한 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기 록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 전술한 과제 해결 수단에 의하면, 엘리베이터의 탑승 가능시에, 물체와의 충돌없이 목표 탑승 지점으 로 이동을 완료할 수 있다. 또한, 본 개시의 전술한 과제 해결 수단에 의하면, 엘리베이터의 탑승 불가능시에, 엘리베이터의 탑승을 시도하 지 않고, 엘리베이터를 빠르게 보낼 수 있다. 또한, 본 개시의 전술한 과제 해결 수단에 의하면, 작업 수행 취소에 따른 긴급 하차 또는 위급 상황에 따른 하 차를 빠르게 수행할 수 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 개시가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는‘부, 모듈, 부재, 블록’이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우 뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제 1, 제 2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 본 명세서에서 본 개시에 따른 무인 이동체의 제어부는 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들이 모두 포함된다. 예를 들어, 본 개시에 따른 제어부는, 컴퓨터, 서버를 모두 포함하거나, 또는 어느 하나의 형태가 될 수 있다. 여기에서, 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop), 태블릿 PC, 슬레이트 PC, 싱글보드 컴퓨터 등을 포함할 수 있다. 서버 장치는 외부 장치와 통신을 수행하여 정보를 처리하는 서버로써, 애플리케이션 서버, 컴퓨팅 서버, 데이터 베이스 서버, 파일 서버, 메일 서버, 프록시 서버 및 웹 서버 등을 포함할 수 있다. 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), WiBro(Wireless Broadband Internet) 단말, 스마트 폰(Smart Phone) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치와 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted- device(HMD) 등과 같은 웨어러블 장치를 포함할 수 있다. 본 개시에 따른 무인 이동체는, 엘리베이터의 문이 열리기 전에, 엘리베이터에 장착된 무게 센서를 통해 획득된 엘리베이터의 무게 정보를 수신받으며, 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 엘리베이터의 문이 열리면, 카메라를 통해 획득된 영상 내의 물체를 수신받고, 영상 내의 물체가 기 설정된 제1 시간 동안 충 돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로 이동하며, 영상 내의 물체가 제1 시간 동안 충돌 감 지 영역에 있는 경우, 영상 내의 물체에게 충돌 감지 영역에서 벗어나도록, 스피커를 통해 음성으로 알리고, 음 성으로 알림이 완료되고, 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 정지 동작과 이동 동작을 반복하여 목표 탑승 지점으로 이동하며, 목표 탑승 지점으로 이동이 완료되고, 서버로 부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보를 수신받으면, 엘리베이터의 문이 열릴 때에 하차할 수 있다. 이러한, 무인 이동체는, 엘리베이터의 탑승 가능시에 물체와의 충돌없이 목표 탑승 지점으로 이동을 완료하거나, 엘리베이터의 탑승 불가능시에 엘리베이터의 탑승을 시도하지 않고 엘리베이터를 빠르게 보낼 수 있으며, 작업 수행 취소에 따른 긴급 하차 또는 위급 상황에 따른 하차를 빠르게 수행할 수 있다.이하에서는, 무인 이동체를 자세하게 살펴보기로 한다. 도 1은 본 개시에 따른 무인 이동체의 엘리베이터 승하차 결정 시스템의 구성을 나타낸 도면이다. 도 1을 참조하면, 무인 이동체는 사람의 도움없이 스스로 외부 환경을 인식해 상황을 판단하고 임무를 수 행하는 이동체일 수 있다. 이때, 무인 이동체는 엘리베이터의 승하차를 결정할 수 있다. 예를 들어, 무인 이동체는 이동 로봇일 수 있다. 무인 이동체는 통신부, 센서부, 카메라, 제어부 , 구동부, 스피커를 포함할 수 있다. 통신부는 제어부와 전기적으로 연결될 수 있고, 엘리베이터의 일측에 장착된 무게 센서와 통 신을 수행할 수 있으며, 서버로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보를 수신받을 수 있다. 이때, 통신부는 와이파이(Wifi) 모듈, 와이브로(Wireless broadband) 모듈 외에도, GSM(global System for Mobile Communication), CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), UMTS(universal mobile telecommunications system), TDMA(Time Division Multiple Access), LTE(Long Term Evolution), 4G, 5G, 6G 등 다양한 무선 통신 방식을 지원하는 무선 통신 모듈을 포함 할 수 있다. 센서부는 초음파 센서, 레이더 센서, 라이다 센서 중 적어도 하나를 포함할 수 있다. 센서부는 라이 다 센서를 통해 라이다 데이터를 획득할 수 있다. 여기에서, 센서부는 엘리베이터에 있는 물체와의 거 리 정보를 획득할 수 있다. 이때, 물체는 정적 물체와 동적 물체일 수 있다. 예를 들어, 정적 물체는 장애물과 물건 중 적어도 하나의 고정형 물체일 수 있고, 동적 물체는 사람과 반려 동물 중 적어도 하나의 이동형 물체일 수 있다. 카메라는 이미지 센서를 이용하는 영상 카메라로 제공될 수 있다. 카메라는 이미지 센서를 통해 획득 한 정지영상 또는 동영상 등의 화상 프레임을 처리할 수 있다. 한편, 카메라가 복수개일 경우, 매트릭스 구조를 이루도록 배치될 수 있다. 이러한 매트릭스 구조를 이루는 영상 카메라들을 통해 다양한 각도 또는 초점 을 갖는 복수의 영상정보가 입력될 수 있다. 또한, 영상 카메라들은 3차원의 입체영상을 구현하기 위한 좌 영상 및 우 영상을 획득하도록, 스트레오 구조로 배치될 수 있다. 또한, 카메라는 AI 카메라로 제공될 수도 있 다. AI 카메라는 인간의 망막을 모방하여 만들어진 광각센서를 통해 인식된 이미지를, 뇌신경망 알고리즘으로 미세하게 조정할 수 있다. AI 카메라는 셔터 속도, 광노출, 포화도, 색 농도, 동적 범위, 대비 등을 조절할 수 있다. 또한, AI 카메라는 촬영된 영상을 양질의 영상으로 출력할 수 있다. 여기에서, 카메라는 영상 내의 물체를 획득할 수 있다. 이때, 물체는 정적 물체와 동적 물체일 수 있다. 예를 들어, 정적 물체는 장애물과 물 건 중 적어도 하나의 고정형 물체일 수 있고, 동적 물체는 사람과 반려 동물 중 적어도 하나의 이동형 물체일 수 있다. 제어부는 본 장치 내의 구성요소들의 동작을 제어하기 위한 알고리즘 또는 알고리즘을 재현한 프로그램에 대한 데이터를 저장하는 메모리, 및 메모리에 저장된 데이터를 이용하여 전술한 동작을 수행하는 적 어도 하나의 프로세서로 구현될 수 있다. 여기에서, 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있다. 또한, 메모리와 프로세서는 단일 칩으로 구현될 수도 있다. 메모리는 본 장치의 다양한 기능을 지원하는 데이터와, 제어부의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들을 저장할 있고, 본 장치에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 본 장치의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로 그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 이러한, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입 (Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 메모리는 본 장치와는 분리되어 있으나, 유선 또는 무선으로 연결된 데이터베이스가 될 수도 있다. 메모리는 엘리베이터까지의 이동 경로와 목적지까지의 이동 경로가 저장될 수 있고, 엘리베이터의 승하차를 결정하기 위한 데이터가 저장될 수 있다. 프로세서는 엘리베이터의 승하차를 결정하기 위한 동작을 제어할 수 있다.프로세서는 엘리베이터의 문이 열리기 전에, 엘리베이터에 장착된 무게 센서를 통해 획득된 엘리베이터의 무게 정보를 수신받을 수 있다. 프로세서는 엘리베이터의 무게 정보가 기 설정된 수준을 만족하지 않을 경우, 엘리베이터의 탑승 동작을 중지할 수 있다. 프로세서는 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 엘리베이터의 문이 열리면, 카메라를 통해 획득된 영상 내의 물체를 수신받을 수 있다. 여기에서, 프로세서는 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로 이동할 수 있다. 또한, 프로세서는 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 엘리베이터의 문이 열리면, 360도 회전하는 카메라를 통해 획득된 영상 내의 물체를 수신받을 수도 있다. 여기에서, 프로세서 는 영상 내의 물체가 기 설정된 신체적 약자를 포함하고 있는 경우, 신체적 약자가 엘리베이터를 탑승 할 때까지 대기하고 있다가, 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정 된 목표 탑승 지점으로 이동할 수 있다. 예를 들어, 신체적 약자는 노인, 어린이, 거동이 불편한 환자, 장애인 등일 수 있다. 이때, 프로세서는 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 제1 정지 동작과 제1 이동 동작을 반복하여 목표 탑승 지점으로 구동부를 통해 무인 이동체를 이동할 수 있다. 구동부는 제1 정지 동작과 제1 이동 동작을 반복하여 목표 탑승 지점까지 무인 이동체를 이동 할 수 있다. 이때, 충돌 감지 영역은 영상 내의 물체와 충돌이 가능한 것으로 판단되는 영역일 수 있다. 예를 들어, 구동부는 무인 이동체들의 주행에 필요한 동력을 제공하기 위해, 배터리 및 배터리로부터 전원 을 공급받는 전자적인 부품, 배터리 및 배터리로부터 전원을 공급받아 구동하는 바퀴 또는 구동벨트 등의 기계 적인 구동 부품을 포함할 수 있다. 프로세서는 영상 내의 물체가 제1 시간 동안 충돌 감지 영역에 있는 경우, 영상 내의 물체에게 충돌 감지 영역에서 벗어나도록, 스피커를 통해 음성으로 알릴 수 있다. 프로세서는 음성으로 알림이 완료되고, 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 있는 경우, 엘리베이터의 탑승 동작을 중지할 수 있다. 프로세서는 영상 내의 물체가 제2 시간 동안 충돌 감지 영역에 있는 경우, 엘리베이터의 내부가 혼잡한 상태로 판단하여, 엘리베이터의 탑승 동작을 중지할 수 있다. 프로세서는 음성으로 알림이 완료되고, 영상 내의 물체가 기 설정된 제2 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 제2 정지 동작과 제2 이동 동작을 반복하여 목표 탑승 지점으로 구동부를 통해 무인 이동 체를 이동할 수 있다. 구동부는 제2 정지 동작과 제2 이동 동작을 반복하여 목표 탑승 지점까지 무인 이동체를 이동할 수 있다. 이때, 제2 시간은 제1 시간보다 이후의 시간일 수 있고, 제2 정지 동작 및 제2 이동 동작의 반복 동작에 대한 속도는 제1 정지 동작 및 제1 이동 동작의 반복 동작에 대한 속도보다 늦을 수 있다. 즉, 프로세서는 영상 내의 물체가 제2 시간 동안 충돌 감지 영역에 없는 경우, 영상 내의 물체와 충 돌을 미연에 방지하도록, 제2 정지 동작 및 제2 이동 동작의 반복 동작에 대한 속도를 제1 정지 동작 및 제1 이 동 동작의 반복 동작에 대한 속도보다 늦출 수 있다. 프로세서는 목표 탑승 지점으로 이동이 완료되고, 서버로부터 긴급 하차 정보 및 다른 목적지에서 필 요한 긴급 작업 정보 중 적어도 하나를 수신받으면, 엘리베이터의 문이 열릴 때에 하차할 수 있다. 여기에 서, 프로세서는 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받으면, 기 설정된 목적지의 층에 도달하기 전의 이전 층에서 엘리베이터의 문이 열릴 때에 하차할 수 있다. 이때, 프로세서는 무인 이동체의 음성 인식부를 통해 엘리베이터가 음성으로 발화하는 층에 대한 해당 음성 데이터를 더 수신받을 수도 있다. 여기에서, 프로세서는 엘리베이터가 음성으로 발화하는 층에 대한 해당 음성 데이터의 수신이 완료되면, 서버로부터 수신된 다른 목적지에서 필요한 긴급 작업 정 보 중 해당 음성 데이터에 상응하여 기 설정된 해당 층의 목적지 별 긴급 작업 정보를 기반으로, 해당 층의 해 당 목적지에서 긴급 작업이 필요한 상태인지를 더 판단할 수도 있다. 이때, 프로세서는 해당 층의 해당 목 적지에서 긴급 작업이 필요한 상태이면, 기 설정된 목적지의 층에 도달하기 전의 해당 층에서 엘리베이터의 문이 열릴 때에 하차하여, 해당 목적지로 이동할 수도 있다. 예를 들어, 긴급 하차 정보는, 임무를 부여받은 작 업 수행의 취소에 따라, 목적지의 층에 도달하기 전의 해당 층에서 하차 명령을 수신받은 정보일 수 있다. 다른 예를 들어, 다른 목적지에서 필요한 긴급 작업 정보는, 임무를 부여받은 작업 수행의 취소에 따라, 목적지의 층에 도달하기 전에 해당 층의 해당 목적지에서 긴급 작업 명령을 수신받은 정보일 수 있다. 이때, 긴급 작업 정 보는 물류 이송 작업, 적재/하차 작업, 배달 작업 중 적어도 하나일 수 있다. 프로세서는 목표 탑승 지점으로 이동이 완료되고, 무인 이동체의 음성 인식부를 통해 적어도 하 나의 탑승자로부터 위급 상황에 대한 음성 데이터를 더 수신받을 수 있다. 여기에서, 프로세서는 음성 데 이터의 수신이 완료되면, 카메라를 통해 획득된 위급 상황에 대한 영상을 더 수신받을 수 있고, 위급 상황 에 대한 영상 내의 객체를 기반으로 위급 상황인지를 더 판단할 수 있다. 이때, 프로세서는 위급 상황이면, 엘리베이터의 문이 열릴 때에 하차할 수 있다. 도 2 내지 도 4는 본 개시에 따른 무인 이동체의 엘리베이터 승하차 결정 방법을 나타낸 순서도들이다. 도 5 내 지 도 8은 본 개시에 따른 무인 이동체의 엘리베이터 탑승이 가능한 상태를 일 예로 나타낸 도면들이다. 도 9는 본 개시에 따른 무인 이동체의 엘리베이터 탑승이 불가능한 상태를 일 예로 나타낸 도면이다. 도 10 및 도 11은 본 개시에 따른 무인 이동체의 엘리베이터 하차 상태를 일 예로 나타낸 도면이다. 도 2 내지 도 11을 참조하면, 무인 이동체의 엘리베이터 승하차 결정 방법은, 제1 수신 단계(S211), 제1 판단 단계(S212), 제2 수신 단계(S221), 제2 판단 단계(S222), 제1 이동 단계(S223), 음성 알림 단계(S224), 제3 판 단 단계(S225), 탑승 중지 단계(S226), 제2 이동 단계(S227), 제4 판단 단계(S231), 제1 탑승 유지 단계 (S232), 제1 하차 단계(S233), 제5 판단 단계(S234), 제2 탑승 유지 단계(S235), 제3 수신 단계(S236), 제6 판 단 단계(S237), 제2 하차 단계(S238)를 포함할 수 있다. 제1 수신 단계는, 엘리베이터의 문이 열리기 전에, 엘리베이터에 장착된 무게 센서를 통해 획득된 엘리베이터의 무게 정보를 프로세서를 통해 수신받을 수 있다(S211). 제1 판단 단계는, 프로세서를 통해, 엘리베이터의 무게 정보가 기 설정된 수준을 만족하지 않을 경우 (S212의 아니오), 엘리베이터의 탑승 동작을 중지할 수 있다(S226). 이때, 프로세서는 엘리베이터(1 0)의 무게 정보가 기 설정된 수준을 만족하지 않을 경우, 엘리베이터의 내부가 혼잡한 상태로 판단하여, 엘 리베이터의 탑승 동작을 중지할 수 있다. 예를 들어, 프로세서는 엘리베이터의 무게 정보에 상응 하는 물체를 포함하는 총 무게 값이 기 설정된 기준 무게 값보다 클 경우, 엘리베이터의 내부가 혼잡한 상 태로 판단하여, 엘리베이터의 탑승 동작을 중지할 수 있다. 제2 수신 단계는, 프로세서를 통해, 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우(S212의 예), 엘리베이터의 문이 열리면, 카메라를 통해 획득된 영상 내의 물체를 프로세서를 통해 수신 받을 수 있다(S221). 또한, 제2 수신 단계는, 프로세서를 통해, 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우(S212의 예), 엘리베이터의 문이 열리면, 360도 회전하는 카메라를 통해 획득된 영 상 내의 물체를 프로세서를 통해 수신받을 수도 있다. 이때, 프로세서는 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 엘리베이터의 내부가 여유있는 상태로 판단하여, 카메라 또는 360도 회전하는 카메라를 통해 획득된 영상 내의 물체를 수 신받을 수 있다. 예를 들어, 프로세서는 엘리베이터의 무게 정보에 상응하는 물체를 포함하는 총 무 게 값이 기 설정된 기준 무게 값보다 작을 경우, 엘리베이터의 내부가 여유있는 상태로 판단하여, 카메라 또는 360도 회전하는 카메라를 통해 획득된 영상 내의 물체를 수신받을 수 있다. 제2 판단 단계는, 프로세서를 통해, 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 있는지 를 판단할 수 있다(S222). 제1 이동 단계는, 프로세서를 통해, 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경 우(S222의 아니오), 기 설정된 목표 탑승 지점으로 이동할 수 있다(S223). 또한, 제1 이동 단계는, 프로세서 를 통해, 360도 회전하는 카메라에 의해 획득된 영상 내의 물체가 기 설정된 신체적 약자를 포함하고 있는 경우, 신체적 약자가 엘리베이터를 탑승할 때까지 대기하고 있다가, 영상 내의 물체가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점으로 이동할 수 있다. 제1 이동 단계는, 프로 세서를 통해, 영상 내의 물체가 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 제1 정지 동작과 제1 이동 동작을 반복하여 목표 탑승 지점으로 구동부를 통해 무인 이동체를 이동할 수 있다. 여기에서, 구동부는 제1 정지 동작과 제1 이동 동작을 반복하여 목표 탑승 지점까지 무인 이동체를 이동할 수 있다. 무인 이동체는 영상 내의 물체가 충돌 감지 영역에 들어오지 않으면 이동 속도를 멈추지 않도록 제어할 수 있고, 영상 내의 물체가 충돌 감지 영역에 들어오면 감속하도록 제어할 수 있다. 이러한, 무인 이동체는 정밀하고 저속 주행 속도로 목표 탑승 지점까지 이동할 수 있다. 음성 알림 단계는, 프로세서를 통해, 영상 내의 물체가 제1 시간 동안 충돌 감지 영역에 있는 경우(S222의 예), 영상 내의 물체에게 충돌 감지 영역에서 벗어나도록, 무인 이동체의 스피커를 통해 음성으로 알 릴 수 있다(S224). 예를 들어, 스피커는 영상 내의 물체에게 충돌 감지 영역에서 벗어나도록, \"엘리베이터 안쪽으로 조금씩만 들어가주십시요!\"라는 음성으로 알릴 수 있다. 제3 판단 단계는, 음성으로 알림이 완료되고, 프로세서를 통해, 영상 내의 물체가 기 설정된 제2 시간 동 안 충돌 감지 영역에 있는지를 판단할 수 있다(S225). 탑승 중지 단계는, 음성으로 알림이 완료되고, 프로세서를 통해, 영상 내의 물체가 기 설정된 제2 시간 동 안 충돌 감지 영역에 있는 경우(S225의 예), 엘리베이터의 탑승 동작을 중지할 수 있다(S226). 이때, 프로 세서는 영상 내의 물체가 제2 시간 동안 충돌 감지 영역에 있는 경우, 엘리베이터의 내부가 혼잡한 상태로 판단하여, 엘리베이터의 탑승 동작을 중지할 수 있다. 제2 이동 단계는, 음성으로 알림이 완료되고, 프로세서를 통해, 영상 내의 물체가 제2 시간 동안 충돌 감 지 영역에 없는 경우(S225의 아니오), 기 설정된 제2 정지 동작과 제2 이동 동작을 반복하여 목표 탑승 지점으 로 구동부를 통해 무인 이동체를 이동할 수 있다(S227). 여기에서, 구동부는 제2 정지 동작과 제2 이동 동작을 반복하여 목표 탑승 지점까지 무인 이동체를 이동할 수 있다. 무인 이동체는 영상 내의 물체가 충돌 감지 영역에 들어오지 않으면 이동 속도를 멈추지 않도록 제어할 수 있고, 영상 내의 물체가 충돌 감지 영역에 들어오면 감속하도록 제어할 수 있다. 이러한, 무인 이동체는 더욱 정밀하고 저속 주행 속도로 조심스럽게 목표 탑승 지점까지 이동할 수 있다. 이때, 제2 시간은 제1 시간보다 이후의 시간일 수 있고, 제2 정지 동작 및 제2 이동 동작의 반복 동작에 대한 속도는 제1 정지 동작 및 제1 이동 동작의 반복 동 작에 대한 속도보다 늦을 수 있다. 즉, 프로세서는 영상 내의 물체가 제2 시간 동안 충돌 감지 영역에 없 는 경우(S225의 아니오), 영상 내의 물체와 충돌을 미연에 방지하도록, 제2 정지 동작 및 제2 이동 동작의 반복 동작에 대한 속도를 제1 정지 동작 및 제1 이동 동작의 반복 동작에 대한 속도보다 늦출 수 있다. 도 3에 도시된 바와 같이, 제4 판단 단계는, 목표 탑승 지점으로 이동이 완료되고, 프로세서를 통해, 서버 로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받았는지를 판단 할 수 있다(S231). 예를 들어, 긴급 하차 정보는, 임무를 부여받은 작업 수행의 취소에 따라, 목적지의 층에 도 달하기 전의 해당 층에서 하차 명령을 수신받은 정보일 수 있다. 다른 예를 들어, 다른 목적지에서 필요한 긴급 작업 정보는, 임무를 부여받은 작업 수행의 취소에 따라, 목적지의 층에 도달하기 전에 해당 층의 해당 목적지 에서 긴급 작업 명령을 수신받은 정보일 수 있다. 이때, 긴급 작업 정보는 물류 이송 작업, 적재/하차 작업, 배 달 작업 중 적어도 하나일 수 있다. 제1 탑승 유지 단계는, 프로세서를 통해, 서버로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보를 수신받지 않으면(S231의 아니오), 엘리베이터의 탑승을 유지할 수 있다(S232). 제1 하차 단계는, 프로세서를 통해, 서버로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받으면(S231의 예), 엘리베이터의 문이 열릴 때에 하차할 수 있다(S233). 여기 에서, 프로세서는 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받으 면, 기 설정된 목적지의 층에 도달하기 전의 이전 층에서 엘리베이터의 문이 열릴 때에 하차할 수 있다. 이 때, 프로세서는 음성 인식부를 통해 엘리베이터가 음성으로 발화하는 층에 대한 해당 음성 데이 터를 더 수신받을 수도 있다. 여기에서, 프로세서는 엘리베이터가 음성으로 발화하는 층에 대한 해당 음성 데이터의 수신이 완료되면, 서버로부터 수신된 다른 목적지에서 필요한 긴급 작업 정보 중 해당 음성 데이터에 상응하여 기 설정된 해당 층의 목적지 별 긴급 작업 정보를 기반으로, 해당 층의 해당 목적지에서 긴 급 작업이 필요한 상태인지를 더 판단할 수도 있다. 이때, 프로세서는 해당 층의 해당 목적지에서 긴급 작 업이 필요한 상태이면, 기 설정된 목적지의 층에 도달하기 전의 해당 층에서 엘리베이터의 문이 열릴 때에 하차하여, 해당 목적지로 이동할 수도 있다. 도 4에 도시된 바와 같이, 제5 판단 단계는, 무인 이동체의 음성 인식부를 통해 획득된 적어도 하나 의 탑승자로부터 위급 상황에 대한 음성 데이터를 프로세서를 통해 수신받았는지를 더 판단할 수 있다 (S234). 예를 들어, 프로세서는 음성 인식부를 통해 획득된 적어도 하나의 탑승자로부터 \"응급 환자 발생\" 또는 \"위급 환자 발생\" 등의 음성 데이터를 수신받았는지를 판단할 수 있다. 제2 탑승 유지 단계는, 프로세서를 통해, 적어도 하나의 탑승자로부터 위급 상황에 대한 음성 데이터를 수 신받지 않으면(S234의 아니오), 엘리베이터의 탑승을 유지할 수 있다(S235). 제3 수신 단계는, 프로세서를 통해, 위급 상황에 대한 음성 데이터의 수신이 완료되면, 카메라를 통 해 획득된 위급 상황에 대한 영상을 수신받을 수 있다(S236). 예를 들어, 프로세서는 카메라를 통해 획득된 응급 환자에 대한 영상을 수신받을 수 있다. 제6 판단 단계는, 프로세서를 통해, 영상 내의 응급 환자가 인공지능 모델을 통해 학습된 위급 상황에 상 응하는 응급 환자인지를 판단할 수 있다(S237). 제2 하차 단계는, 프로세서를 통해, 위급 상황이면(S237의 예), 엘리베이터의 문이 열릴 때에 하차할 수 있다(S238). 이때, 프로세서는 위급 상황이 아니면(S237의 아니오), 엘리베이터의 탑승을 유지할 수 있다(S235). 예를 들어, 도 5에 도시된 바와 같이, 무인 이동체는 엘리베이터의 문(D)이 열리기 전에, 엘리베이터 에 장착된 무게 센서를 통해 획득된 엘리베이터의 무게 정보를 프로세서를 통해 수신받을 수 있다. 무인 이동체는 엘리베이터의 무게 정보가 기 설정된 수준을 만족하지 않을 경우, 엘리베이터 의 내부가 혼잡한 상태로 판단하여, 엘리베이터의 탑승 동작을 중지할 수 있다. 다른 예를 들어, 도 6에 도시된 바와 같이, 무인 이동체는 엘리베이터의 무게 정보가 기 설정된 수준 을 만족할 경우, 엘리베이터의 문(D)이 열리면, 카메라를 통해 획득된 영상 내의 물체(A, B)를 프로세 서를 통해 수신받을 수 있다. 또한, 무인 이동체는 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 엘리베이터의 문(D)이 열리면, 360도 회전하는 카메라를 통해 획득된 영상 내의 물체(A, B, Z)를 프로세서를 통해 수신받을 수도 있다. 이때, 무인 이동체는 엘리베이터의 무게 정보가 기 설정된 수준을 만족할 경우, 엘리베이터의 내부가 여유있는 상태로 판단하여, 카메라 또는 360도 회전하는 카메라를 통해 획득된 영상 내의 물체(A, B, Z)를 수신받을 수 있다. 이때, A와 B는 엘리베이터 에 탑승한 탑승자이고, Z는 엘리베이터를 대기하고 있는 신체적 약자일 수 있다. 또 다른 예를 들어, 도 7에 도시된 바와 같이, 무인 이동체는 영상 내의 물체(A, B)가 기 설정된 제1 시간 동안 충돌 감지 영역(R)에 있는지를 판단할 수 있다. 이 후, 무인 이동체는 영상 내의 물체(A, B)가 제1 시간 동안 충돌 감지 영역(R)에 없는 경우, 기 설정된 제1 정지 동작과 제1 이동 동작을 반복하여 목표 탑승 지 점(G)으로 구동부를 통해 이동할 수 있다. 또한, 무인 이동체는 360도 회전하는 카메라에 의해 획득된 영상 내의 물체(Z)가 기 설정된 신체적 약자를 포함하고 있는 경우, 신체적 약자가 엘리베이터를 탑승할 때까지 대기하고 있다가, 영상 내의 물체 (A, B, Z)가 기 설정된 제1 시간 동안 충돌 감지 영역에 없는 경우, 기 설정된 목표 탑승 지점(G)으로 이동할 수 있다. 무인 이동체는 영상 내의 물체(A, B, Z)가 제1 시간 동안 충돌 감지 영역(R)에 없는 경우, 기 설 정된 제1 정지 동작과 제1 이동 동작을 반복하여 목표 탑승 지점(G)으로 구동부를 통해 이동할 수 있다. 여기에서, 무인 이동체는 목표 탑승 지점(G)으로의 이동이 완료되면, 엘리베이터의 문(D)을 바라보도 록 제자리 회전을 수행한 후, 탑승을 완료할 수 있다. 또 다른 예를 들어, 도 8에 도시된 바와 같이, 무인 이동체는 엘리베이터의 문(D)이 열리면, 영상 내 의 물체(A, B, Z)가 기 설정된 제1 시간 동안 충돌 감지 영역(R)에 있는지를 판단할 수 있다. 이때, 무인 이동 체는 영상 내의 물체(A, B)가 기 설정된 제1 시간 동안 충돌 감지 영역(R)에 있는지를 판단할 때에, Gilbert-Johnson-Keerthi(GJK) distance algorithm을 기반으로, 영상 내의 물체(A, B)와 충돌 영역 도형 간의 충돌 여부를 판단할 수 있다. 예를 들어, 프로세서는 GJK distance algorithm을 기반으로, 충돌 영역 도형 에서 목표점에 가장 가까운 두 꼭지점(A，B)을 검출하고, 두 꼭지점(A，B)을 잇는 벡터를 구하며, 목표점 방향 의 가장 먼 꼭지점을 찾고，이 거리와 목표점 간의 거리를 비교할 수 있다. 이 후, 무인 이동체는 영상 내의 물체(A, B)가 제1 시간 동안 충돌 감지 영역(R)에 있는 경우, 영상 내의 물체(A, B)에게 충돌 감지 영역에서 벗어나도록, 스피커를 통해 음성으로 알릴 수 있다. 예를 들어, 스피 커는 영상 내의 물체(A, B)에게 충돌 감지 영역에서 벗어나도록, \"엘리베이터 안쪽으로 조금씩만 들어가주 십시요!\"라는 음성으로 알릴 수 있다. 무인 이동체는 음성으로 알림이 완료된 경우, 영상 내의 물체(A, B)가 기 설정된 제2 시간 동안 충돌 감지 영역(R)에 있는지를 판단할 수 있다. 이 후, 무인 이동체는 영상 내의 물체(A, B)가 제2 시간 동안 충돌 감지 영역(R)에 없는 경우, 기 설정된 제2 정지 동작과 제2 이동 동작을 반복하여 목표 탑승 지점(G)으로 구동부를 통해 이동할 수 있다. 여기에서, 구동부는 제2 정지 동작과 제2 이동 동작을 반복하여 목표 탑 승 지점(G)까지 무인 이동체를 이동할 수 있다. 무인 이동체는 목표 탑승 지점(G)으로의 이동이 완료 되면, 엘리베이터의 문(D)을 바라보도록 제자리 회전을 수행한 후, 탑승을 완료할 수 있다. 또 다른 예를 들어, 도 9에 도시된 바와 같이, 무인 이동체는 엘리베이터의 문(D)이 열리면, 영상 내 의 물체(A, B)가 기 설정된 제1 시간 동안 충돌 감지 영역(R)에 있는지를 판단할 수 있다. 이때, 무인 이동체 는 영상 내의 물체(A, B)가 기 설정된 제1 시간 동안 충돌 감지 영역(R)에 있는지를 판단할 때에, Gilbert-Johnson-Keerthi(GJK) distance algorithm을 기반으로, 영상 내의 물체(A, B)와 충돌 영역 도형 간의 충돌 여부를 판단할 수 있다. 이 후, 무인 이동체는 영상 내의 물체(A, B)가 제1 시간 동안 충돌 감지 영역(R)에 있는 경우, 영상 내의 물체(A, B)에게 충돌 감지 영역에서 벗어나도록, 스피커를 통해 음성으로 알릴 수 있다. 예를 들어, 스피 커는 영상 내의 물체(A, B)에게 충돌 감지 영역에서 벗어나도록, \"엘리베이터 안쪽으로 조금씩만 들어가주 십시요!\"라는 음성으로 알릴 수 있다. 무인 이동체는 음성으로 알림이 완료된 경우, 영상 내의 물체(A, B)가 기 설정된 제2 시간 동안 충돌 감지 영역(R)에 있는지를 판단할 수 있다. 이때, 무인 이동체는 영상 내의 물체(A, B)가 기 설정된 제2 시간 동 안 충돌 감지 영역(R)에 있는지를 판단할 때에, Gilbert-Johnson-Keerthi(GJK) distance algorithm을 기반으로, 영상 내의 물체(A, B)와 충돌 영역 도형 간의 충돌 여부를 판단할 수 있다. 이 후, 무인 이동체는 영상 내의 물체(A, B)가 제2 시간 동안 충돌 감지 영역(R)에 있는 경우, 엘리베이터 의 내부가 혼잡한 상태로 판단하여, 엘리베이터의 탑승 동작을 중지할 수 있다. 또 다른 예를 들어, 도 10에 도시된 바와 같이, 무인 이동체는 서버로부터 긴급 하차 정보 및 다른 목 적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받았는지를 판단할 수 있다. 이때, 무인 이동체는 서버로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보를 수신받지 않으면, 엘리베이터(1 0)의 탑승을 유지할 수 있다. 또한, 무인 이동체는 서버로부터 긴급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보 중 적어 도 하나를 수신받으면, 엘리베이터의 문(D)이 열릴 때에 하차할 수 있다. 여기에서, 무인 이동체는 긴 급 하차 정보 및 다른 목적지에서 필요한 긴급 작업 정보 중 적어도 하나를 수신받으면, 기 설정된 목적지의 층 에 도달하기 전의 이전 층에서 엘리베이터의 문(D)이 열릴 때에 하차할 수 있다. 이때, 무인 이동체는 음성 인식부를 통해 엘리베이터가 음성으로 발화하는 층에 대한 해당 음성 데이터를 더 수신받을 수도 있다. 여기에서, 무인 이동체는 엘리베이터가 음성으로 발화하는 층에 대한 해당 음성 데이터의 수신 이 완료되면, 서버로부터 수신된 다른 목적지에서 필요한 긴급 작업 정보 중 해당 음성 데이터에 상응하여 기 설정된 해당 층의 목적지 별 긴급 작업 정보를 기반으로, 해당 층의 해당 목적지에서 긴급 작업이 필요한 상 태인지를 더 판단할 수도 있다. 이 후, 무인 이동체는 해당 층의 해당 목적지에서 긴급 작업이 필요한 상 태이면, 기 설정된 목적지의 층에 도달하기 전의 해당 층에서 엘리베이터의 문이 열릴 때에 하차하여, 해당 목적지로 이동할 수도 있다. 예를 들어, 무인 이동체는 엘리베이터가 음성으로 발화하는 \"5층입니다\" 에 대한 해당 음성 데이터의 수신이 완료되면, 서버로부터 수신된 다른 목적지에서 필요한 긴급 작업 정보 중 해당 음성 데이터에 상응 하여 기 설정된 5층의 목적지 별 긴급 작업 정보를 기반으로, 5층의 해당 목적지에서 긴급 작업이 필요한 상태 인지를 더 판단할 수도 있다. 이 후, 무인 이동체는 5층의 해당 목적지에서 긴급 작업이 필요한 상태이면, 기 설정된 목적지의 10층에 도달하기 전의 5층에서 엘리베이터의 문이 열릴 때에 하차하여, 5층의 해당 목 적지로 이동할 수도 있다. 또 다른 예를 들어, 도 11에 도시된 바와 같이, 무인 이동체는 음성 인식부를 통해 획득된 적어도 하 나의 탑승자로부터 위급 상황에 대한 음성 데이터를 프로세서를 통해 수신받았는지를 판단할 수 있다. 예 를 들어, 무인 이동체는 음성 인식부를 통해 획득된 적어도 하나의 탑승자로부터 \"응급 환자 발생\" 또는 \"위급 환자 발생\" 등의 음성 데이터를 수신받았는지를 판단할 수 있다. 이때, 무인 이동체는 적어도 하나의 탑승자로부터 위급 상황에 대한 음성 데이터를 수신받지 않으면, 엘리베이터의 탑승을 유지할 수 있 다. 또한, 무인 이동체는 위급 상황에 대한 음성 데이터의 수신이 완료되면, 카메라를 통해 획득된 위급 상황에 대한 영상을 수신받을 수 있다. 예를 들어, 무인 이동체는 카메라를 통해 획득된 응급 환자(x)에 대한 영상을 수신받을 수 있다. 이때, 무인 이동체는 영상 내의 응급 환자(x)가 인공지능 모델을 통해 학습된 위급 상황에 상응하는 응급 환자인지를 판단할 수 있다. 여기에서, 무인 이동체는 위급 상황이 아니면 엘리베이터의 탑승을 유지 할 수 있고, 위급 상황이면 엘리베이터의 문(D)이 열릴 때에 하차할 수 있다. 이때, 무인 이동체는 엘 리베이터에서 하차함과 동시에 \"응급환자 발생! 비켜주십시요!\"라는 음성으로 위급 상황에 대해 빠르게 대 처하고자 하는 음성을 알릴 수 있고, 위급 상황에 대해 빠르게 조취를 취하도록 서버 또는 병원 서버 등의 외부 서버로 위급 상황 정보를 전송할 수도 있다. 도 1에 도시된 구성 요소들의 성능에 대응하여 적어도 하나의 구성요소가 추가되거나 삭제될 수 있다. 또한, 구 성 요소들의 상호 위치는 시스템의 성능 또는 구조에 대응하여 변경될 수 있다는 것은 당해 기술 분야에서 통상 의 지식을 가진 자에게 용이하게 이해될 것이다. 도 2 내지 도 4는 복수의 단계를 순차적으로 실행하는 것으로 기재하고 있으나, 이는 본 실시예의 기술 사상을"}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "예시적으로 설명한 것에 불과한 것으로서, 본 실시예가 속하는 기술분야에서 통상의 지식을 가진 자라면 본 실 시예의 본질적인 특성에서 벗어나지 않는 범위에서 도 2 내지 도 4에 기재된 순서를 변경하여 실행하거나 복수 의 단계 중 하나 이상의 단계를 병렬적으로 실행하는 것으로 다양하게 수정 및 변형하여 적용 가능할 것이므로, 도 2 내지 도 4는 시계열적인 순서로 한정되는 것은 아니다. 한편, 개시된 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명 령어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2022-0135420", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형 태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2022-0135420", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시에 따른 무인 이동체의 엘리베이터 승하차 결정 시스템의 구성을 나타낸 도면이다. 도 2 내지 도 4는 본 개시에 따른 무인 이동체의 엘리베이터 승하차 결정 방법을 나타낸 순서도들이다. 도 5 내지 도 8은 본 개시에 따른 무인 이동체의 엘리베이터 탑승이 가능한 상태를 일 예로 나타낸 도면들이다. 도 9는 본 개시에 따른 무인 이동체의 엘리베이터 탑승이 불가능한 상태를 일 예로 나타낸 도면이다. 도 10 및 도 11은 본 개시에 따른 무인 이동체의 엘리베이터 하차 상태를 일 예로 나타낸 도면이다."}
