{"patent_id": "10-2023-0005320", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0110203", "출원번호": "10-2023-0005320", "발명의 명칭": "사용자의 시선을 추적하여 맞춤형 상품을 제공하는 휴대 단말 및 방법과, 이를 위한 추천 시", "출원인": "(주)브랜디", "발명자": "이재성"}}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 시선을 추적하고, 상기 추적된 시선에 기반하여 맞춤형 상품을 제공하는 휴대 단말에 있어서,상품 구매 어플리케이션을 통해 복수의 제1 상품들을 포함하는 제1 화면을 표시하는 표시하는 표시부;상기 사용자에 대한 이미지를 획득하는 카메라;서버와 통신하는 통신부; 및상기 표시부, 상기 카메라, 및 상기 통신부와 전기적으로 연결된 프로세서를 포함하며,상기 프로세서는,상기 제1 화면을 보고 있는 상기 사용자의 동작이 감지되면, 상기 카메라를 활성화하여 이미지를 획득하고-상기사용자의 동작이 감지되지 않으면, 상기 카메라를 비활성화시킴-,상기 획득된 이미지에서 상기 사용자의 얼굴을 식별하고,상기 획득된 이미지에서 상기 사용자의 얼굴을 제외한 나머지 부분을 블러처리하고,상기 블러처리된 이미지를 분석하여, 상기 표시부에 표시된 상기 복수의 제1 상품들 중에서 상기 사용자의 시선이 머무르는 시간이 가장 긴 상품을 식별하고-상기 사용자의 시선이 머무르는 시간이 가장 긴 상품은 상기 사용자의 시선이 상기 상품에서 이탈된 후 다시 상기 상품에 머무르는 경우, 상기 사용자의 구매 욕구가 가장 큰 상품인 것으로 결정됨-,상기 사용자의 시선이 머무르는 시간이 가장 긴 상품에 대한 정보를 상기 통신부를 통해 상기 서버로 전송하고,상기 상품에 대한 정보의 전송에 응답하여, 상기 서버로부터 상기 식별된 상품에 관련된 복수의 제2 상품들에대한 정보 및 상기 복수의 제2 상품들이 상기 상품 구매 어플리케이션을 통해 표시되는 순서를 결정하는 명령어들을 포함하는 데이터를 상기 통신부를 통해 수신하고,상기 제1 화면 상에 스크롤 입력이 감지되면, 상기 수신된 데이터를 분석하여 상기 복수의 제2 상품들이 표시되는 순서를 결정하는 명령어들을 식별하고,상기 식별된 명령어들에 기반하여 상기 복수의 제2 상품들을 정렬하고,상기 식별된 명령어들에 기반하여 정렬된 복수의 제2 상품들을 포함하는 제2 화면을 구성하고,상기 상품 구매 어플리케이션 상의 스크롤 입력에 대응하여, 상기 수신된 복수의 제2 상품들을 포함하는 상기제2 화면을 상기 제1 화면의 하단에 이어서 실시간으로 표시하도록 설정되며-상기 제2 화면에는 대표 이미지를포함하며, 상기 대표 이미지는 인터넷 상의 신문 기사, 게시글을 통해 획득되어 상기 제2 화면의 가장 상단에표시됨-,상기 제1 화면의 하단에 이어서 표시되는 상기 제2 화면에 포함된 복수의 제2 상품들은, 상기 식별된 상품과 동일한 종류의 상품들이며, 상기 서버가 비전 인공지능을 통해 선정한 상품들임을 특징으로하는 휴대 단말."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 프로세서는,상기 표시된 복수의 제1 상품들 각각에 대해 상기 사용자의 시선이 머무르는 시간을 측정하고,공개특허 10-2023-0110203-3-상기 측정된 시간이 일정 시간을 초과하는 상품을 식별하도록 설정된 휴대 단말."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 프로세서는,상기 표시부를 통해 상기 제1 화면 상에 스크롤 입력이 감지되면, 우선순위에 기반하여 상기 복수의 제2 상품들을 정렬하고,상기 정렬된 복수의 제2 상품들을 포함하는 제2 화면을 구성하고,상기 스크롤 입력에 대응하여 상기 구성된 제2 화면을 상기 표시부를 통해 표시하도록 설정된 휴대 단말."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 복수의 제2 상품들은,상기 식별된 상품의 특성에 기반하여 결정되며,상기 특성은 종류, 가격, 색상, 및 크기 중 적어도 하나를 포함하는 휴대 단말."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 프로세서는,상기 사용자가 상기 복수의 제1 상품들 중에서 현재 어느 상품을 보고 있는지를 상기 카메라를 통해 실시간으로식별하고,상기 복수의 제1 상품들 중에서 상기 사용자의 시선이 머무르는 시간이 가장 많은 상품을 식별하고,상기 식별된 상품에 대한 정보를 구성하고,상기 구성된 정보를 상기 통신부를 통해 상기 서버로 전송하도록 설정된 휴대 단말."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 식별된 상품에 대한 정보는,종류, 가격, 색상, 및 크기 중 적어도 하나를 포함하는 휴대 단말."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "휴대 단말을 통해 사용자의 시선을 추적하고, 상기 추적된 시선에 기반하여 맞춤형 상품을 제공하는 방법에 있어서,상품 구매 어플리케이션을 통해 복수의 제1 상품들을 포함하는 제1 화면을 표시하는 과정;상기 제1 화면을 보고 있는 상기 사용자의 동작이 감지되면, 카메라를 활성화하여 상기 사용자에 대한 이미지를획득하는 과정-상기 사용자의 동작이 감지되지 않으면, 상기 카메라를 비활성화시킴-;공개특허 10-2023-0110203-4-상기 획득된 이미지에서 상기 사용자의 얼굴을 식별하는 과정;상기 획득된 이미지에서 상기 사용자의 얼굴을 제외한 나머지 부분을 블러처리하는 과정;상기 블러처리된 이미지를 분석하여, 상기 복수의 제1 상품들 중에서 상기 사용자의 시선이 머무르는 시간이 가장 긴 상품을 식별하는 과정-상기 사용자의 시선이 머무르는 시간이 가장 긴 상품은 상기 사용자의 시선이 상기상품에서 이탈된 후 다시 상기 상품에 머무르는 경우, 상기 사용자의 구매 욕구가 가장 큰 상품인 것으로 결정됨-;상기 사용자의 시선이 머무르는 시간이 가장 긴 상품에 대한 정보를 서버로 전송하는 과정;상기 상품에 대한 정보의 전송에 응답하여, 상기 서버로부터 상기 식별된 상품에 관련된 복수의 제2 상품들에대한 정보 및 상기 복수의 제2 상품들이 상기 상품 구매 어플리케이션을 통해 표시되는 순서를 결정하는 명령어들을 포함하는 데이터를 수신하는 과정; 상기 제1 화면 상에 스크롤 입력이 감지되면, 상기 수신된 데이터를 분석하여 상기 복수의 제2 상품들이 표시되는 순서를 결정하는 명령어들을 식별하는 과정;상기 식별된 명령어들에 기반하여 상기 복수의 제2 상품들을 정렬하는 과정;상기 식별된 명령어들에 기반하여 정렬된 복수의 제2 상품들을 포함하는 제2 화면을 구성하는 과정; 및상기 상품 구매 어플리케이션 상의 스크롤 입력에 대응하여 상기 수신된 복수의 제2 상품들을 포함하는 상기 제2 화면을 상기 제1 화면의 하단에 이어서 실시간으로 표시하는 과정을 포함하며-상기 제2 화면에는 대표 이미지를 포함하며, 상기 대표 이미지는 인터넷 상의 신문 기사, 게시글을 통해 획득되어 상기 제2 화면의 가장 상단에 표시됨-,상기 제1 화면의 하단에 이어서 표시되는 상기 제2 화면에 포함된 복수의 제2 상품들은, 상기 식별된 상품과 동일한 종류의 상품들이며, 상기 서버가 비전 인공지능을 통해 선정한 상품들임을 특징으로하는 방법."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 사용자의 시선이 향하는 상품을 식별하는 과정은,상기 표시된 복수의 제1 상품들 각각에 대해 상기 사용자의 시선이 머무르는 시간을 측정하는 과정; 및상기 측정된 시간이 일정 시간을 초과하는 상품을 식별하는 과정을 포함하는 방법."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 제2 화면을 표시하는 과정은,상기 제1 화면 상에 스크롤 입력이 감지되면, 우선순위에 기반하여 상기 복수의 제2 상품들을 정렬하는 과정;상기 정렬된 복수의 제2 상품들을 포함하는 제2 화면을 구성하는 과정; 및상기 스크롤 입력에 대응하여 상기 구성된 제2 화면을 표시하는 과정을 포함하는 방법."}
{"patent_id": "10-2023-0005320", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "사용자의 시선을 추적하고, 상기 추적된 시선에 기반하여 맞춤형 상품을 제공하는 추천 시스템에 있어서,상품 구매 어플리케이션을 통해 복수의 제1 상품들을 포함하는 제1 화면을 표시하고, 상기 사용자의 동작이 감공개특허 10-2023-0110203-5-지되면, 카메라를 활성화하여 상기 사용자에 대한 이미지를 획득하고, 상기 사용자의 동작이 감지되지 않으면상기 카메라를 비활성화시키고, 상기 획득된 이미지에서 상기 사용자의 얼굴을 식별하고, 상기 획득된 이미지에서 상기 사용자의 얼굴을 제외한 나머지 부분을 블러처리하고, 상기 블러처리된 이미지를 분석하여, 상기 복수의 제1 상품들 중에서 상기 사용자의 시선이 머무르는 시간이 가장 긴 상품을 식별하고, 상기 식별된 상품에 대한 정보를 서버로 전송하는 휴대 단말-상기 사용자의 시선이 머무르는 시간이 가장 긴 상품은 상기 사용자의 시선이 상기 상품에서 이탈된 후 다시 상기 상품에 머무르는 경우, 상기 사용자의 구매 욕구가 가장 큰 상품인 것으로 결정됨-; 및상기 식별된 상품에 대한 정보의 수신에 기반하여 상기 식별된 상품에 관련된 복수의 제2 상품들에 대한 정보를획득하고, 상기 획득된 복수의 제2 상품들에 대한 정보 및 상기 복수의 제2 상품들이 상기 상품 구매 어플리케이션을 통해 표시되는 순서를 결정하는 명령어들을 포함하는 데이터를 상기 휴대 단말로 전송하는 상기 서버를포함하며,상기 휴대 단말은,상기 상품에 대한 정보의 전송에 응답하여, 상기 서버로부터 상기 식별된 상품에 관련된 복수의 제2 상품들에대한 정보 및 상기 복수의 제2 상품들이 상기 상품 구매 어플리케이션을 통해 표시되는 순서를 결정하는 명령어들을 포함하는 데이터를 수신하고, 상기 제1 화면 상에 스크롤 입력이 감지되면, 상기 수신된 데이터를 분석하여 상기 복수의 제2 상품들이 표시되는 순서를 결정하는 명령어들을 식별하고, 상기 식별된 명령어들에 기반하여 상기 복수의 제2 상품들을 정렬하고, 상기 식별된 명령어들에 기반하여 정렬된 복수의 제2 상품들을 포함하는 제2 화면을 구성하고, 상기 상품 구매 어플리케이션 상의 스크롤 입력에 대응하여, 상기 수신된 복수의 제2상품들을 포함하는 상기 제2 화면을 상기 제1 화면의 하단에 이어서 실시간으로 표시하며-상기 제2 화면에는 대표 이미지를 포함하며, 상기 대표 이미지는 인터넷 상의 신문 기사, 게시글을 통해 획득되어 상기 제2 화면의가장 상단에 표시됨-,상기 제1 화면의 하단에 이어서 표시되는 상기 제2 화면에 포함된 복수의 제2 상품들은, 상기 식별된 상품과 동일한 종류의 상품들이며, 상기 서버가 비전 인공지능을 통해 선정한 상품들임을 특징으로하는 추천 시스템."}
{"patent_id": "10-2023-0005320", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사용자의 시선을 추적하여 맞춤형 상품을 제공하는 휴대 단말 및 방법과, 이를 위한 추천 시스템 및 프로그램에 관한 것이다. 이를 위해, 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고, 상기 추적된 시선에 기반하여 맞춤형 상품 을 제공하는 휴대 단말은, 복수의 제1 상품들을 포함하는 제1 화면을 표시하는 표시부, 상기 제1 화면을 보고 있 는 상기 사용자의 동공에 대한 이미지를 획득하는 카메라, 서버와 통신하는 통신부, 및 상기 표시부, 상기 카메 라, 및 상기 통신부와 전기적으로 연결된 프로세서를 포함할 수 있다."}
{"patent_id": "10-2023-0005320", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자의 시선을 추적하여 맞춤형 상품을 제공하는 휴대 단말 및 방법과, 이를 위한 추천 시스템 및 프로그램에 관한 것이다."}
{"patent_id": "10-2023-0005320", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 소비자는 상품을 구매하고자 할 경우, 오프라인 매장에 직접 방문하여 자신이 필요한 의류를 구매한 다. 그러나, 바쁜 현대인에게는 이러한 오프라인 매장을 직접 방문할 시간적인 여유가 부족하기 때문에, 휴대 단말을 통해 자신이 원하는 다양한 상품을 구매한다. 이를 위해, 상품을 판매하는 생산하는 업체는 고객의 요구에 부합되도록 많은 다양한 상품들을 생산한다. 그리 고, 판매 회사는 고객의 상품 구매율을 높이기 위해 휴대 단말 상에서 상품을 효과적으로 보여주는 방식에 대해 개발하고 있다. 그런데, 종래에는 사용자가 자신이 구매하고자 하는 상품에 대한 키워드(예: 운동화, 셔츠 등)를 휴대 단말을 통해 입력하는 경우, 휴대 단말은 단지 입력된 키워드에 해당되는 상품들을 사용자에게 제공하기 때문에, 사용 자는 관심이 없는 상품들까지 보게 되는 상품 구매에 대한 불편함이 있었다. 따라서, 사용자가 어느 상품에 관심을 갖는지를 능동적으로 판단하여, 사용자가 관심을 갖는 상품에 관련된 다 른 상품들을 사용자에게 선택적으로 보여줌으로써, 상품에 대한 구매율을 높일 필요성이 제기된다."}
{"patent_id": "10-2023-0005320", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래에는 사용자가 직접 입력한 키워드에 해당되기는 하지만, 사용자의 관심이 없는 상품들까지 보여줌으로써, 사용자가 상품 구매에 있어서 불편함이 느꼈다. 따라서, 본 발명은 사용자가 어느 상품에 관심을 갖는지를 능동적으로 판단하여, 사용자가 관심을 갖는 상품과 유사도가 높은 다른 상품들을 사용자에게 선택적으로 보여주는 사용자의 시선을 추적하여 맞춤형 상품을 제공하 는 휴대 단말 및 방법과, 이를 위한 추천 시스템 및 프로그램을 제공하는 것이다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2023-0005320", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위해 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고, 상기 추적된 시선에 기 반하여 맞춤형 상품을 제공하는 휴대 단말은, 복수의 제1 상품들을 포함하는 제1 화면을 표시하는 표시부, 상기 제1 화면을 보고 있는 상기 사용자의 동공에 대한 이미지를 획득하는 카메라, 서버와 통신하는 통신부, 및 상기 표시부, 상기 카메라, 및 상기 통신부와 전기적으로 연결된 프로세서를 포함할 수 있다. 그리고, 상기 프로세서는 상기 카메라를 통해 획득된 이미지를 획득하고, 상기 획득된 이미지를 분석하여, 상기 표시부에 표시된 상기 복수의 제1 상품들 중에서 상기 사용자의 시선이 향하는 상품을 식별하고, 상기 식별된 상품에 대한 정보를 상기 통신부를 통해 상기 서버로 전송하고, 상기 상품에 대한 정보의 전송에 응답하여, 상 기 서버로부터 상기 식별된 상품에 관련된 복수의 제2 상품들에 대한 정보를 상기 통신부를 통해 수신하고, 상 기 수신된 복수의 제2 상품들을 포함하는 제2 화면을 상기 표시부를 통해 표시할 수 있다. 또한, 본 발명의 일 실시 예에 따른 휴대 단말을 통해 사용자의 시선을 추적하고, 상기 추적된 시선에 기반하여 맞춤형 상품을 제공하는 방법은, 복수의 제1 상품들을 포함하는 제1 화면을 표시하는 과정, 상기 제1 화면을 보 고 있는 상기 사용자의 동공에 대한 이미지를 획득하는 과정, 상기 획득된 이미지를 분석하여, 상기 복수의 제1 상품들 중에서 상기 사용자의 시선이 향하는 상품을 식별하는 과정, 상기 식별된 상품에 대한 정보를 서버로 전 송하는 과정, 상기 상품에 대한 정보의 전송에 응답하여, 상기 서버로부터 상기 식별된 상품에 관련된 복수의 제2 상품들에 대한 정보를 수신하는 과정, 및 상기 수신된 복수의 제2 상품들을 포함하는 제2 화면을 표시하는 과정을 포함할 수 있다. 또한, 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고, 상기 추적된 시선에 기반하여 맞춤형 상품을 제 공하는 추천 시스템은, 복수의 제1 상품들을 포함하는 제1 화면을 표시하고, 상기 제1 화면을 보고 있는 상기 사용자의 동공에 대한 이미지를 획득하고, 상기 획득된 이미지를 분석하여, 상기 복수의 제1 상품들 중에서 상 기 사용자의 시선이 향하는 상품을 식별하고, 상기 식별된 상품에 대한 정보를 서버로 전송하는 휴대 단말, 및 상기 식별된 상품에 대한 정보의 수신에 기반하여 상기 식별된 상품에 관련된 복수의 제2 상품들에 대한 정보를 획득하고, 상기 획득된 복수의 제2 상품들에 대한 정보를 상기 휴대 단말로 전송하는 상기 서버를 포함하며, 상 기 휴대 단말은 상기 상품에 대한 정보의 전송에 응답하여, 상기 서버로부터 상기 식별된 상품에 관련된 복수의 제2 상품들에 대한 정보를 수신하고, 상기 수신된 복수의 제2 상품들을 포함하는 제2 화면을 표시할 수 있다. 또한, 본 발명의 일 실시 예에 따른 휴대 단말을 통해 사용자의 시선을 추적하고, 상기 추적된 시선에 기반하여 맞춤형 상품을 제공하는 명령어들을 포함하는 프로그램은, 복수의 제1 상품들을 포함하는 제1 화면을 표시하는 명령어들, 상기 제1 화면을 보고 있는 상기 사용자의 동공에 대한 이미지를 획득하는 명령어들, 상기 획득된 이 미지를 분석하여, 상기 복수의 제1 상품들 중에서 상기 사용자의 시선이 향하는 상품을 식별하는 명령어들, 상 기 식별된 상품에 대한 정보를 서버로 전송하는 명령어들, 상기 상품에 대한 정보의 전송에 응답하여, 상기 서 버로부터 상기 식별된 상품에 관련된 복수의 제2 상품들에 대한 정보를 수신하는 명령어들, 및 상기 수신된 복 수의 제2 상품들을 포함하는 제2 화면을 표시하는 명령어들을 포함할 수 있다."}
{"patent_id": "10-2023-0005320", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 복수의 제1 상품들 중에서 사용자의 시선이 향하는 상품에 대한 정보를 서버로 전송하고, 상기 서버 로부터 상기 식별된 상품에 관련된 복수의 제2 상품들에 대한 정보를 수신하여 표시함으로써, 사용자의 취향에 부합되는 상품들을 사용자에게 효과적으로 제공할 수 있다.또한, 본 발명은 복수의 상품들 각각에 대해 사용자의 시선이 머무르는 시간을 측정하고, 상기 측정된 시간이 일정 시간을 초과하는 상품을 식별함으로써, 사용자가 가장 관심을 갖는 상품이 어떤 상품이고, 상품에 관련된 다른 상품들을 효과적으로 판단할 수 있다. 또한, 본 발명은 복수의 제1 상품들을 포함하는 제1 화면 상에 스크롤 입력이 감지되면, 우선순위에 기반하여 복수의 제2 상품들을 정렬하고, 상기 정렬된 복수의 제2 상품들을 포함하는 제2 화면을 구성하여 표시함으로써, 사용자는 자신이 관심을 갖고 있는 상품들을 선택적으로 볼 수 있고, 이에 따라 상품 구매율은 향상될 수 있다. 또한, 본 발명은 사용자가 관심을 갖는 복수의 상품들을 종류, 가격, 색상, 및 크기 중 적어도 하나에 기반한 특성을 통해서 추천 상품을 결정함으로써, 사용자의 관심이 높은 상품들을 선별할 수 있다. 또한, 본 발명은 사용자가 복수의 상품들 중에서 현재 어느 상품을 보고 있는지를 카메라를 통해 실시간으로 식 별하고, 상기 복수의 상품들 중에서 사용자의 시선이 머무르는 시간이 가장 많은 상품을 식별하고, 상기 식별된 상품에 대한 정보를 서버로 전송함으로써, 서버는 사용자에게 최우선으로 제공할 추천 상품을 효율적으로 선정 할 수 있다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2023-0005320", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시 예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 비록 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한 되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것으 로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 이하에서 구성요소의 \"상부 (또는 하부)\" 또는 구성요소의 \"상 (또는 하)\"에 임의의 구성이 배치된다는 것은, 임의의 구성이 상기 구성요소의 상면 (또는 하면)에 접하여 배치되는 것뿐만 아니라, 상기 구성요소와 상기 구 성요소 상에 (또는 하에) 배치된 임의의 구성 사이에 다른 구성이 개재될 수 있음을 의미할 수 있다. 또한 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서 로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개재\"되거나, 각 구성 요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다. 명세서 전체에서, 특별히 반대되는 기재가 없는 한, 각 구성요소는 단수일수도 있고 복수일 수도 있다. 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않 을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 명세서 전체에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B 를 의미 하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 이하에서는, 본 발명의 몇몇 실시 예에 따른 사용자의 시선을 추적하고, 상기 추적된 시선에 기반하여 맞춤형 상품을 제공하는 휴대 단말 및 방법과, 이를 위한 추천 시스템 및 프로그램을 설명하도록 한다. 도 1은 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고 상기 추적된 시선에 기반하여 맞춤형 상품을 제 공하는 추천 시스템을 나타낸 예시도이다. 도 1을 참조하면, 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고 상기 추적된 시선에 기반하여 맞춤형 상품을 제공하는 추천 시스템은 휴대 단말 및 서버를 포함할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말은 상품 판매 어플리케이션을 실행하고, 실행된 상품 판매 어플리케 이션을 통해 구매자의 상품 구매 서비스를 제공할 수 있다. 이러한, 상품 구매 서비스를 제공하기 위해, 휴대 단말은 구매자가 휴대 단말에 표시된 복수의 상품 들 중에서 어느 상품을 보고 있는지를 식별하기 위해, 구매자의 동공에 대한 이미지를 카메라를 통해 획득할 수 있다. 그리고, 상기 휴대 단말은 상기 획득된 이미지를 분석하여 구매자가 복수의 상품들 중에서 어느 상 품을 보고 있는지를 식별하고, 상기 식별된 상품에 대한 정보를 네트워크를 통해 서버로 전송할 수 있다. 또한, 상기 휴대 단말은 상기 상품에 대한 정보의 전송에 응답하여, 상기 서버로부터 상기 식별된 상 품에 관련된 복수의 상품들에 대한 정보를 수신하고, 상기 서버로부터 수신된 복수의 상품들에 대한 정보 를 상기 상품 판매 어플리케이션 상에 표시할 수 있다. 일 실시 예에 따르면, 상기 서버는 구매자의 휴대 단말로부터 구매자의 동공 식별에 기반하여 식별된 적어도 하나의 상품에 대한 정보를 수신할 수 있다. 그리고, 상기 서버는 상기 수신된 적어도 하나의 상품 에 대한 정보에 포함된 상품의 종류, 가격, 색상, 및 크기 중 적어도 하나를 식별할 수 있다. 또한, 상기 서버는 상품의 종류, 가격, 색상, 및 크기 중 적어도 하나의 식별에 기반하여, 상기 상품에 관 련된 복수의 상품들에 대한 정보를 획득할 수 있다. 그리고, 상기 서버는 상기 획득된 복수의 상품들에 대 한 정보를 네트워크를 통해 휴대 단말로 전송할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고 상기 추적된 시선에 기반하여 맞춤형 상품을 제 공하는 추천 시스템의 블록도이다. 도 2를 참조하면, 휴대 단말은 통신부, 메모리, 표시부, 카메라, 및 프로세서 를 포함할 수 있다. 도 2에 도시된 휴대 단말의 구성은 일 실시 예에 따른 것이고, 휴대 단말의 구성 요소들이 도 2에 도 시된 실시 예에 한정되는 것은 아니며, 필요에 따라 일부 구성 요소가 부가, 변경 또는 삭제될 수 있다. 일 실시 예에 따르면, 상기 통신부는 서버의 통신부와 적어도 하나의 신호 또는 정보를 네트워 크를 통해 송수신할 수 있는 적어도 하나의 회로를 포함할 수 있다. 또한, 상기 통신부는 상품 판매 어플리케이션을 상기 서버로부터 수신할 수 있다. 일 실시 예에 따르면, 상기 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 예를 들면, 상기 메모리는 상품 판매 어플리케이션과, 상기 서버로부터 수신되는 상품에 대한 다양한 정보를 저 장할 수 있다. 또한, 상기 메모리는 구매자의 동공을 촬영한 이미지를 저장할 수 있다. 일 실시 예에 따르면, 상기 표시부는 상품 판매 어플레이션을 표시할 수 있다. 또한, 상기 표시부는 상품 판매 어플리케이션을 통해 복수의 상품을 표시할 수 있고, 구매자(예: 사용자)의 시선에 기반하여 식별된 복수의 상품들에 대한 정보를 표시할 수 있다. 이러한 표시부는 터치 또는 호버링 기반의 입력을 수신할 수 있다. 일 실시 예에 따르면, 상기 카메라는 사용자에 대한 이미지(예: 동공에 대한 이미지)를 획득할 수 있다. 또한, 상기 카메라는 사용자에 대한 이미지(예: 동공에 대한 이미지)를 획득하고, 획득된 이미지를 실시간 으로 프로세서로 전달할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 휴대 단말의 동작을 전반적으로 제어할 수 있다. 예를 들면, 상기 프로세서는 상품 판매 어플리케이션을 상기 표시부에 표시할 수 있다. 또한, 상기 프로세서는 상기 표시부에 표시된 상품 판매 어플리케이션을 통해 입력되는 사용자 입력 을 처리할 수 있다. 도 2를 참조하면, 서버는 메모리, 통신부, 및 프로세서를 포함할 수 있다. 도 2에 도시된 서버의 구성은 일 실시 예에 따른 것이고, 서버의 구성 요소들이 도 2에 도시된 실시 예에 한정되는 것은 아니며, 필요에 따라 일부 구성 요소가 부가, 변경 또는 삭제될 수 있다. 일 실시 예에 따르면, 상기 메모리는 상기 서버의 동작에 필요한 정보, 데이터, 프로그램, 어플리케 이션, 소프트웨어, 명령어 등을 저장할 수 있다. 또한, 상기 메모리는 예를 들면, 플래시 메모리 타입 (flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM), 롬(EEPROM 등) 중 적어도 하나 의 타입의 저장매체를 포함할 수 있다. 상기 메모리는 소비자의 휴대 단말에게 제공되는 상품 판매 어플리 케이션을 저장할 수 있다. 그리고, 상기 서버는 상품 판매를 관리하는 업체에서 관리될 수 있다. 일 실시 예에 따르면, 상기 메모리는 복수의 상품들 각각에 대해 관련된 복수의 상품들에 대한 정보를 저 장할 수 있다. 예를 들면, 상기 메모리는 휴대 단말에서 선택한 특정 상품에 대한 정보(예: 종류, 가 격, 색상, 및 크기 등)에 관련된 복수의 상품들에 대한 정보(예: 종류, 가격, 색상, 및 크기 등)를 저장하고 있 다. 예를 들면, 특정 상품이 운동화이고, 운동화의 가격이 4만원이고, 색상이 흰색이고, 크기가 270mm이면, 프로세 서는 상품의 종류가 운동화이고, 운동화의 가격이 3-5만원대이고, 색상이 흰색 계열이고, 크기가 260mm- 280mm인 복수의 운동화에 대한 정보를 상기 메모리로부터 획득할 수 있다. 이와 같이, 상기 메모리는 상품의 종류, 가격, 색상, 및 크기 등과 같이 각 상품의 특성에 관련된 복수의 상품들에 대한 정보를 저장하고 있다. 또한, 상기 메모리는 성별에 따라 복수의 상품들 각각에 대한 정보 를 저장하고 있다. 일 실시 예에 따르면, 상기 통신부는 유선 또는 무선을 통해 휴대 단말과 통신할 수 있으며, 상품 구 매에 따른 다양한 신호 또는 데이터를 송수신할 수 있다. 상기 통신부는 상기 휴대 단말의 통신부와 적어도 하나의 신호 또는 정보를 네트워크를 통 해 송수신할 수 있는 적어도 하나의 회로를 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 메모리, 및 통신부로부터 수신된 명령 또는 데이터를 상 기 메모리에 로드하여 처리하고, 처리된 데이터를 메모리에 저장할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 인공지능 알고리즘을 수행할 수 있다. 또는, 상기 인공지능 알고리 즘은 상기 프로세서에 의해 구현될 수 있다. 상기 인공지능은 인간의 뇌 신경망을 모방한 프로그램으로서 다양한 데이터를 스스로 분석, 인지, 추론, 판단하는 딥러닝 알고리즘을 지원할 수 있다. 예를 들면, 상기 인공 지능은 비전 인공지능(vision artificial intelligence)을 포함할 수 있다. 상기 비전 인공지능은 상품의 종류, 가격, 색상, 및 크기 등에 기반하여 관련된(또는 유사도가 높은) 복수의 상 품들을 선별하는 솔루션이며, 상기 프로세서는 이러한 비전 인공지능을 통해 식별된 상품과 유사도가 높은 복수의 상품들을 선정할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 구매자의 휴대 단말(예: 상품 판매 어플리케이션)로부터 구매 자가 가장 관심을 갖는 상품에 대한 정보를 통신부를 통해 수신할 수 있다. 그리고, 상기 프로세서는 구매자가 가장 관심을 갖는 것으로 판단된 상품과 유사도가 높은 복수의 상품들 을 인공지능 알고리즘을 통해 선택하고, 선택된 복수의 상품들에 대한 정보를 휴대 단말로 네트워크 를 통해 전송할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고 상기 추적된 시선에 기반하여 맞춤형 상품을 제 공하는 추천 시스템의 방법을 나타낸 순서도이다. 도 4는 본 발명의 일 실시 예에 따른 사용자가 휴대 단말에 표시된 복수의 상품들 중 하나를 보고 있는 상태를 나타낸 예시도이다. 도 5는 본 발명의 일 실시 예에 따른 사 용자의 시선을 통해 선택된 상품에 관련된 복수의 상품들에 대한 정보를 표시한 예시도이다. 이하, 도 3, 도 4, 및 도 5를 참조하여, 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고 상기 추적된 시선에 기반하여 맞춤형 상품을 제공하는 추천 시스템의 방법을 설명하면 다음과 같다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 사용자가 복수의 상품들(예: 제1 상품들)을 포함하는 화면을 보고 있는 사용자의 동작(예: 머리 움직임, 시선 움직임 등)이 감지되면, 카메라를 활성 화할 수 있다. 또한, 상기 휴대 단말(예: 프로세서)은 사용자가 복수의 상품들(예: 제1 상품들)을 포 함하는 화면이 표시부에 표시된 상태에서 사용자의 동작(예: 머리 움직임, 시선 움직임 등)이 감지되지 않 으면, 카메라를 비활성 상태로 유지하거나, 또는 비활성화시킬 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 카메라를 통해 획득된 이미지에서 사용 자의 얼굴을 식별하고, 상기 획득된 이미지에서 사용자의 얼굴을 제외한 나머지 부분을 블러처리할 수 있다. 이와 같이, 획득된 이미지에서 사용자의 얼굴을 제외한 나머지 부분을 블러 처리함으로써, 주변 사람이 노출되 는 것을 방지할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 사용자(또는 구매자)의 동공이 식별되는지 판 단할 수 있다(S310). 상기 휴대 단말(예: 프로세서)은 표시부를 통해 표시된 상품 구매 어플리 케이션 상에 복수의 상품들(예: 제1 상품들)을 표시할 수 있다. 그리고, 상기 휴대 단말(예: 프로세서 )은 카메라에서 획득한 사용자의 동공에 대한 이미지를 분석하여 상기 표시부에 표시된 복수의 상품들(예: 제1 상품들) 중에서 사용자가 현재 어느 상품을 보고 있는지를 판단하기 위해, 동공의 방향(또는 시 선 방향)을 식별할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 휴대 단말(110(예: 표시부)에 표시된 복 수의 상품들 중에서 시선이 향하는 상품을 식별할 수 있다(S312). 예를 들면, 상기 휴대 단말(예: 프로세 서)은 복수의 상품들(예: 제1 상품들) 각각이 표시부 또는 상품 구매 어플리케이션 상에 표시된 위치 를 판단할 수 있다. 그리고, 상기 휴대 단말(예: 프로세서)은 사용자의 동공에 대한 이미지를 분석하 여 시선이 어디로 향하는지를 판단할 수 있다. 이를 통해, 상기 휴대 단말(예: 프로세서)은 상기 복수의 상품들(예: 제1 상품들) 중에서 사용자가 현재 어느 상품을 보고 있는지를 실시간으로 판단할 수 있다. 도 4를 참조하면, 상기 휴대 단말은 복수의 상품들(421, 422, 423, 424, 425, 426)을 포함하는 화면 (예: 제1 화면)를 상품 구매 어플리케이션 상에 표시할 수 있다. 예를 들면, 복수의 상품들(421, 422, 423, 424, 425, 426)은 서로 다른 종류이거나 또는 사용자가 입력한 키워드에 대응되는 상품일 수 있다. 그리고, 상기 화면(예: 제1 화면)의 일 측(예: 우측 또는 하단)에는 스크롤 바가 표시될 수 있다. 일 실시 예에 따르면, 상기 휴대 단말의 전면에 배치된 카메라는 실시간으로 사용자의 동공에 대한 이미지를 획득할 수 있다. 그리고, 카메라는 사용자의 동공에 대한 이미지를 프로세서로 전달할 수 있다. 그리고, 휴대 단말(예: 프로세서)은 사용자의 동공에 대한 이미지를 분석하여 사용자가 현재 특 정 상품을 보고 있는 것으로 판단할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 상기 식별된 상품에 시선이 머무르는 시간을 측정할 수 있다(S314). 상기 휴대 단말(예: 프로세서)은 복수의 상품들(예: 제1 상품들) 각각에 대해 사용자의 시선이 머무르는 시간을 실시간으로 측정할 수 있다. 예를 들면, 상기 휴대 단말(예: 프로세서 )은 복수의 상품들(예: 제1 상품들)이 표시되고, 사용자의 동공 방향(또는 시선 방향)이 식별되면, 타이머를 구동하여 각각의 상품에 대해 시선이 머무르는 시간을 실시간으로 측정할 수 있다. 예를 들면, 휴대 단말(예: 프로세서)은 사용자의 동공에 대한 이미지를 분석하여 사용자가 현재 특정 상품을 보고 있는 시간을 측정할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 상기 측정된 시간이 일정 시간을 초과하는 상 품에 대한 정보를 획득할 수 있다(S316). 상기 휴대 단말(예: 프로세서)은 복수의 상품들(예: 제1 상품들) 각각에 대해 사용자의 시선이 머무르는 시간을 측정하고, 상기 측정된 시간이 일정 시간(예: 5초)을 초과하는 상품을 식별할 수 있다. 또는, 상기 휴대 단말(예: 프로세서)은 복수의 상품들(예: 제1 상 품들) 중에서 시선이 가장 오래 머무는 상품을 식별할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 획득된 이미지에서 얼굴을 제외한 나머지 부 분이 블러처리된 이미지를 분석하여, 복수의 제1 상품들 중에서 사용자의 시선이 머무르는 시간이 가장 긴 상품 을 식별할 수 있다. 예를 들면, 상기 휴대 단말(예: 프로세서)은 사용자의 시선이 상품에서 이탈된 후 다시 상기 상품에 돌아오는 것을 카메라를 통해 식별할 수 있다. 이를 통해, 상기 휴대 단말(예: 프로세서)은 사용자의 시선이 상품에서 이탈된 후 다시 머무르는 경우, 상품(즉, 사용자의 시선이 머무르 는 시간이 가장 긴 상품)을 구매 욕구가 가장 큰 상품인 것으로 결정할 수 있다. 또한, 휴대 단말(예: 프로세서)은 사용자의 시선이 머무르지 않는 경우, 해당 상품의 구매 욕구는 없 는 것으로 결정할 수 있다. 휴대 단말(예: 프로세서)은 이러한 결정(즉, 구매 욕구가 가장 큰 상품 또는 구매 욕구가 없는 상품)에 대한 정보를 서버로 전송하면, 서버는 이러한 결정(즉, 구매 욕구가 가장 큰 상품 또는 구매 욕구가 없는 상품)에 기반하여 상품들을 선택할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 상기 획득된 상품에 대한 정보를 서버로 전송할 수 있다(S318). 상기 휴대 단말(예: 프로세서)은 사용자의 시선에 기반하여 식별된 적어도 하 나의 상품에 대한 정보(예: 상품의 종류, 가격, 색상, 및 크기 중 적어도 하나)를 네트워크를 통해 서버 로 전송할 수 있다. 이와 같이, 상기 휴대 단말(예: 프로세서)은 사용자(또는 구매자)가 복수의 상품들(예: 제1 상품들) 중에서 현재 어느 상품을 보고 있는지를 카메라를 통해 실시간으로 식별하고, 상기 복수의 상품들(예: 제1 상품들) 중에서 사용자의 시선이 머무르는 시간이 가장 많은 상품을 식별할 수 있다. 그리고, 상기 휴대 단말 (예: 프로세서)은 상기 식별된 상품에 대한 정보(예: 상품의 특성에 대한 정보, 휴대 단말의 식 별자(예: 전화 번호), 및 휴대 단말의 소유자에 대한 정보 등)를 구성하고, 상기 구성된 정보를 통신부 를 통해 서버로 전송할 수 있다. 일 실시 예에 따르면, 상기 서버(예: 프로세서)는 상품 정보에 기반하여 유사도가 높은 복수의 상품 들을 선택할 수 있다(S320). 상기 서버(예: 프로세서)는 상기 휴대 단말로부터 상품에 대한 정 보가 수신되면, 상기 식별된 상품에 관련된 복수의 상품들(예: 제2 상품들)에 대한 정보를 메모리로부터 획득할 수 있다. 예를 들면, 상기 서버(예: 프로세서)는 상기 식별된 상품의 종류, 가격, 색상, 및 크기 중 적어도 하 나를 고려하여 유사도가 높은 복수의 상품들(예: 제2 상품들)을 선택할 수 있다. 예를 들면, 상기 서버(예: 프로세서)는 상기 식별된 상품의 특성에 기반하여 결정될 수 있다. 상기 특성은 종류, 가격, 색상, 및 크기 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 상기 서버(예: 프로세서)는 선택된 복수의 상품들에 대한 정보를 전송할 수 있 다(S322). 상기 서버(예: 프로세서)는 상기 획득된 복수의 상품들(예: 제2 상품들)에 대한 정보를 통 신부를 통해 휴대 단말로 전송할 수 있다. 또는, 상기 서버(예: 프로세서)는 선택된 복수의 상품들 각각의 우선 순위를 고려하여 상기 휴대 단 말의 어플리케이션에서 표시되는 순서를 결정하는 명령어들과 상기 획득된 복수의 상품들(예: 제2 상품 들)에 대한 정보를 포함하는 데이터를 생성할 수 있다. 그리고, 상기 서버(예: 프로세서)는 상기 생 성된 데이터를 휴대 단말로 전송할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 스크롤 입력을 감지할 수 있다(S324). 상기 휴대 단말(예: 프로세서)은 서버로부터 수신된 정보 또는 데이터를 메모리에 저장한 후, 사용자가 스크롤 바를 통한 명령을 입력하는지를 식별할 수 있다. 상기 스크롤 바는 상품 구매 어플리케이션의 하나의 화면 안에서 모든 상품을 표시할 수 없는 경우, 상품 구매 어플리케이션의 일 측(예: 우측 또는 하단)에 표시된다. 그리고, 이러한 스크롤 바는 현재 화면의 정보가 전체 에서 어디쯤 위치하는지를 나타낸다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 수신된 복수의 상품들을 표시할 수 있다 (S326). 상기 휴대 단말(예: 프로세서)은 복수의 상품들(예: 제1 상품들)이 화면(예: 제1 화면)에 표시되고 있는 상태에서 스크롤 바를 이용한 입력이 감지되면, 상기 서버로부터 수신된 복수의 상품들(예: 제2 상품들)에 대한 정보를 포함하는 화면(예: 제2 화면)을 제1 화면에 이어서 표시부(또는, 상품 구매 어 플리케이션) 상에 표시할 수 있다. 일 실시 예에 따르면, 상기 제2 화면에는 대표 이미지를 포함하는데, 상기 대표 이미지는 인터넷 상의 신문 기 사, 게시글을 통해 획득되어 상기 제2 화면의 가장 상단에 표시된다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 제1 화면 상에 스크롤 입력이 감지되면, 우선 순위에 기반하여 복수의 제2 상품들을 정렬하고, 상기 정렬된 복수의 제2 상품들을 포함하는 제2 화면을 구성할 수 있다. 그리고, 상기 휴대 단말(예: 프로세서)은 상기 스크롤 입력에 대응하여 상기 구성된 제2 화 면을 표시부를 통해 상품 구매 어플리케이션 상에 표시할 수 있다. 또는, 상기 휴대 단말(예: 프로세서)은 상기 서버로부터 수신된 데이터를 분석하여 상품이 표시 되는 순서를 결정하는 명령어들을 식별할 수 있다. 그리고, 상기 휴대 단말(예: 프로세서)은 상기 식 별된 명령어들에 기반하여, 복수의 상품들(예: 제2 상품들) 각각이 어플리케이션에서 표시되는 순서를 결정할 수 있고, 결정된 순서에 기반하여 복수의 상품들을 어플리케이션 상에 표시할 수 있다. 도 5를 참조하면, 상기 휴대 단말(예: 프로세서)은 도 4에서 제1 화면이 표시되고 있는 상태에 서, 스크롤 바를 이용한 입력(또는 터치 앤 드래그 입력)이 감지되면, 상기 서버로부터 수신된 복수 의 상품들(예: 제2 상품들)에 대한 정보를 포함하는 화면(예: 제2 화면)을 구성할 수 있다. 일 실시 예에 따르면, 스크롤 바가 아래 방향으로 스크롤링되면, 상기 휴대 단말(예: 프로세서(25 0))은 복수의 상품들(예: 제2 상품들)에 대한 정보를 포함하는 화면(예: 제2 화면)을 구성하고, 상기 구성 된 제2 화면을 상기 제1 화면의 하단에 이어서 실시간으로 표시할 수 있다. 예를 들면, 상기 제2 화면은 도 4의 제1 화면에서 사용자의 시선에 기반하여 선택된 상품의 특성(예: 종류, 가격, 색상, 및 크기 중 적어도 하나)에 기반하여 결정된 복수의 상품들(521, 522, 523, 524)(예: 제2 상 품들)을 포함할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 사용자의 동공이 식별되는지 판단할 수 있다 (S328). 상기 휴대 단말(예: 프로세서)은 복수의 상품들(521, 522, 523, 524)(예: 제2 상품들) 각각 이 어플리케이션에서 표시된 상태에서, 카메라를 통해 사용자(또는 구매자)의 동공의 방향(또는 시선 방향)을 실시간으로 식별할 수 있다. 일 실시 예에 따르면, 상기 휴대 단말(예: 프로세서)은 상기 제2 화면가 표시되고 있는 상태에 서, 사용자의 시선을 카메라를 통해 실시간으로 추적하고, 이러한 추적에 기반하여 사용자가 현 재 보고 있는 상품을 실시간으로 식별할 수 있다. 그리고, 사용자(또는 구매자)의 동공의 방향(또는 시선 방향)이 식별되면, 상기 휴대 단말(예: 프로세서 )은 상기 과정(S312)과 같이 사용자의 시선이 향하는 상품을 식별할 수 있다. 상술한 바와 같이, 본 발명은 사용자가 복수의 제1 상품들 중에서 현재 어느 상품을 보고 있는지를 실시간으로 식별하여 사용자의 시선이 머무르는 시간이 가장 많은 상품을 식별하고, 상기 식별된 상품에 대한 정보를 서버 로 전송할 수 있다. 그리고, 서버는 상기 식별된 상품에 관련된 복수의 제2 상품들에 대한 정보를 획득하 고, 상기 획득된 복수의 제2 상품들에 대한 정보를 휴대 단말로 전송할 수 있다. 그리고, 스크롤 입력(또는 터치 앤 드래그 입력)에 기반하여, 휴대 단말은 사용자의 관심이 높은 상품과 관련된 (또는 유사도가 높은) 상품들을 실시간으로 표시할 수 있다. 이상에서 상술한 각각의 순서도에서의 각 단계는 도시된 순서에 무관하게 동작될 수 있거나, 또는 동시에 수행 될 수 있다. 또한, 본 발명의 적어도 하나의 구성 요소와, 상기 적어도 하나의 구성 요소에서 수행되는 적어도 하나의 동작은 하드웨어 및/또는 소프트웨어로 구현 가능할 수 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다.부호의 설명 110: 휴대 단말 120: 서버 130: 네트워크 210: 통신부 220: 메모리 230: 표시부 240: 카메라 250: 프로세서"}
{"patent_id": "10-2023-0005320", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고 상기 추적된 시선에 기반하여 맞춤형 상품을 제 공하는 추천 시스템을 나타낸 예시도이다. 도 2는 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고 상기 추적된 시선에 기반하여 맞춤형 상품을 제 공하는 추천 시스템의 블록도이다. 도 3은 본 발명의 일 실시 예에 따른 사용자의 시선을 추적하고 상기 추적된 시선에 기반하여 맞춤형 상품을 제 공하는 추천 시스템의 방법을 나타낸 순서도이다. 도 4는 본 발명의 일 실시 예에 따른 사용자가 휴대 단말에 표시된 복수의 상품들 중 하나를 보고 있는 상태를 나타낸 예시도이다. 도 5는 본 발명의 일 실시 예에 따른 사용자의 시선을 통해 선택된 상품에 관련된 복수의 상품들에 대한 정보를 표시한 예시도이다."}
