{"patent_id": "10-2014-0130723", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0038244", "출원번호": "10-2014-0130723", "발명의 명칭": "인공발", "출원인": "근로복지공단", "발명자": "김현철"}}
{"patent_id": "10-2014-0130723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "발몸체와, 상기 발몸체의 일단에 회전가능하게 위치되는 발가락부재와, 상기 발몸체와 상기 발가락부재를 연결하는 관절부를 포함하는 인공발."}
{"patent_id": "10-2014-0130723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 일측이 상기 발가락부재와 결합된 상기 발몸체의 타측에는 노면으로부터 전해지는 충격을흡수할 수 있도록 한 쿠션부를 더 포함할 수 있는 인공발."}
{"patent_id": "10-2014-0130723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 쿠션부는 탄성재질로 이루어지는 인공발."}
{"patent_id": "10-2014-0130723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 발가락부재는 2개 내지 3개로 분할되게 구성되는 인공발."}
{"patent_id": "10-2014-0130723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 관절부는일단이 상기 발몸체와 고정결합되고 타단이 상기 발가락부재와 회전가능하게 결합되는 지지부재와, 일단이 상기 지지부재와 고정결합되고 타단이 상기 발가락부재를 탄성지지하는 탄성부재로 구성되는 인공발."}
{"patent_id": "10-2014-0130723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 관절부는 상기 발가락부재와 접촉되는 일단에 미끄럼 가능하도록 슬라이딩부재를 더포함할 수 있는 인공발."}
{"patent_id": "10-2014-0130723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 상기 슬라이딩부재는 플라스틱 재질로 이루어지는 인공발."}
{"patent_id": "10-2014-0130723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 상기 발가락부재의 일측에는 돌출턱이 형성되고 상기 발몸체에는 단턱이 형성되어 상기 발몸체에 대해 상기 발가락부재의 회전시 상기 돌출턱이 상기 단턱에 접촉되면서 하방향으로의 회전을 제한할 수있는 인공발."}
{"patent_id": "10-2014-0130723", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 인공발이 개시된다. 본 발명의 일 실시예에 따른 인공발은 발몸체와, 상기 발몸 체의 일단에 회전가능하게 위치되는 발가락부재와, 상기 발몸체와 상기 발가락부재를 연결하는 관절부를 포함하 는 인공발이 제공된다."}
{"patent_id": "10-2014-0130723", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공발에 관한 것으로, 더욱 상세하게는, 하퇴, 대퇴 절단환자에 착용되는 인공의지와 연결되는 인공 발로서 보행시 경사면의 효과적인 접지와 불특정한 노면 보행에 대한 적응력을 강화시켜 정상적인 족관절 운동 을 구현할 수 있도록 하는 동시에 안정적으로 보행할 수 있도록 한 인공발에 관한 것이다."}
{"patent_id": "10-2014-0130723", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 신체적 장애를 가지고 있는 개개인을 위해 기본적인 삶을 영위할 수 있게 운동기능을 회복시키거나 움직임에 도움을 줄 수 있도록 하고 있다. 즉, 대퇴나 하퇴 절단자들과 같이 다리가 없어 양발로 보행할 수 없 는 장애인들을 위해 양발로 서서 걸을 수 있게 다양한 보조 장비를 개발하여 기본적인 삶을 영위할 수 있도록 하고 있다. 이를 위해, 그 동안 인공발에 대한 많은 연구 발전이 있어 왔고, 재활공학의 눈부신 발전에 따라 고기능성 의지 의 출현, 의지 소재의 경량화, 부품의 모듈화를 통한 비용의 저렴화, 마이크로 프로세서를 탑재한 인공지능 의 지의 개발, 소켓 소재의 다양화 및 여러 종의 에너지 저장형 인공발 개발등이 이루어졌다. 그러나, 아직도 많은 의지 착용자들이 보행을 통한 일상생활에 겪는 불편함은 정상인과 비교해 많은 차이가 있 다. 즉, 기존의 인공발은 현재까지 평탄로나 낮은 경사로에서의 보행까지만 가능하다 정상인으로서는 생활상 보통 접하는 계단이나 급한 경사면이 의지장착 환자에게는 특수한 상황으로 단독 보행이 어려운 실정이다. 특히, 굴곡이나 돌출물이 많은 지면에서의 인공발 보행은 발목 관절 및 발가락 관절의 움직임이 제한되어 몸의 균형을 유지할 수 없어 보행에 어려움을 겪고 있다. 통상 발목 관절 굽힘 각도의 일정 범위 고정성은 동적 정렬의 안정성 즉, 양호한 보행을 결정하는데 적합한 정 렬의 안정성 때문에 필요하지만 이로 인하여 부정 노면에 대한 대응성이 부족하고, 경사로 보행의 불편함이나 굽 있는 구두의 착용시 많은 제한이 따르는 불편이 있는 것이다. 구체적으로, 정상 보행 주기는 발뒤꿈치가 땅에 닿는 발뒤꿈치 닿기와, 발뒤꿈치가 땅에 닿은 후 바로 발바닥에 닿는 발바닥 닿기와, 신체의 무게중심이 발뒤꿈치에서 앞꿈치로, 즉 무게중심이 발바닥의 중심을 지나는 입각 중기와, 발뒤꿈치가 떨어지는 입각 말기, 그리고 발가락 끝이 지면에서 떨어지는 발 끝 떼기로 이루어진 입각기 (stance phase)와, 다리가 바닥에서 떨어져 있는 유각기(swing phase)로 구별되는데, 종래의 인공발의 경우 발가락 끝이 지면에서 떨어지는 발 끝 떼기 시에 발가락 관절의 각도를 조절할 수 있는 수단이 구비되어 있지 않아 착용자가 보행의 불안정성으로 인하여 보행이 불편한 단점이 있었으며, 특히 노면이 울퉁불퉁한 곳에서는 몸의 균형을 유지하기가 어려웠다. 이를 위해 본 출원인이 1999년 12월에 인공발용 다축 관절장치를 출원 및 공개하였으나, 이 마저도 도 1에 도시 된 바와 같이, 단순히 발가락 부분을 탄성재로 사용함으로써, 일정 각도 정도 구부러질 수 있도록 하여 보 행시 도움을 줄 수 있도록 하였으나, 사람의 관절과 같이 구부러지지 않아 안전성을 보장하기 어려웠으며 실용 성이 떨어지는 단점이 있다. 따라서, 본 출원인은 상술한 바와 같은 종래의 문제점을 해결할 수 있는 인공발을 강구하게 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 특2001-0055393"}
{"patent_id": "10-2014-0130723", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면 인공발의 일측 끝단에 발가락 관절을 형성하여 착용한 상태에서 서있을 경우 균 형유지가 용이하고 보행시 발가락 관절의 각도가 가변될 수 있도록 함으로써 안정적으로 보행할 수 있도록 한 인공발을 제공하고자 한다."}
{"patent_id": "10-2014-0130723", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 인공발이 개시된다. 본 발명의 일 실시예에 따른 인공발은 발몸체와, 상기 발몸 체의 일단에 회전가능하게 위치되는 발가락부재와, 상기 발몸체와 상기 발가락부재를 연결하는 관절부를 포함하 는 인공발이 제공된다."}
{"patent_id": "10-2014-0130723", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공발은 보행시 착용자의 움직임에 따라 발가락 관절이 회전할 수 있어 노면이 불 규칙적인 지역에서도 발가락 관절의 각도가 변경되면서 안정적으로 서 있을 수 있을 수 있는 등 안전성이 향상 된다."}
{"patent_id": "10-2014-0130723", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공발은 발몸체에 대해 발가락부재가 회전할 수 있도록 함으로써, 경사진 노면 및 울퉁불퉁한 노면에서 노면의 상황에 따라 발가락부재의 각도가 변경되어 안정적으로 지지할 수 있도록 함으로써, 착용자가 안전하게 보행할 수 있도록 한 것이다. 이하, 도면을 참고하여 본 발명의 실시예들에 따른 인공발에 대하여 보다 상세히 설명하기로 한다. 도 2는 본 발명의 일 실시예에 따른 인공발을 개략적으로 도시한 도면이다. 도 2를 참고하면, 본 발명의 일 실시예에 따른 인공발은 발몸체와, 상기 발몸체의 일단에 회전 가능하게 설치되는 발가락부재와, 상기 발몸체와 상기 발가락부재를 연결하는 관절부를 포 함할 수 있다. 발몸체는 하퇴, 대퇴 절단환자에 착용되는 인공의지와 일측이 연결되어 착용자의 하중을 지지할 수 있도록 한 것으로, 입각기 보행시 착용자의 체중심 이동을 지지할 수 있도록 형성된다. 구체적으로, 상기 발몸체는 착용자를 지지하여 기립할 수 있도록 소정의 면적을 갖도록 형성되며, 일측에 는 의지와 연결될 수 있도록 한 연결구가 마련된다. 여기서, 상기 발몸체는 착용자를 안정적으로 지지할 수 있는 형상이라면 그 형상에 제한을 두지 않으나, 통상의 사람 발 모양과 유사하게 소정의 길이를 갖도록 형성할 수 있다. 또한, 보행시 노면으로부터 전해지는 충격을 흡수할 수 있도록 발몸체의 하부 일측, 즉, 발 뒤꿈치에 해당 되는 부분에는 도 2에 도시된 바와 같이, 쿠션부를 구비할 수 있다. 즉, 상기 쿠션부는 탄성력을 갖는 재질로 이루어져 보행시 착용자에 편안한 느낌을 얻을 수 있도록 한 것으로, 입각기 보행시 발 뒤꿈치가 지면과 접촉될 때 발생하는 충격을 흡수하여 착용자가 안정적으로 보행이 이 루어질 수 있도록 하는 것이다. 또한, 본 발명의 일 실시예에서는 상기 쿠션부를 탄성재질로 형성하였으나, 경우에 따라선 탄성력이 없는 재질로도 형성할 수 있다. 즉, 착용자를 안정적으로 지지할 수 있는 재질이라면 그 재질에 제한을 두지 않는다. 아울러, 본 발명의 일 실시예에서는 도 2에 도시된 바와 같이, 발몸체의 하부 일측에 상술한 바와 같은 쿠 션부를 구비하도록 하고 있으나, 도 3에 도시된 바와 같이, 쿠션부를 구비하지 않을 수도 있다. 또한, 상기 쿠션부가 구비된 상기 발몸체의 타측 끝단에는 불특정 노면에 대한 하중을 분산하고, 접 지력을 향상시키는 동시에 회전을 통해 지면 저항을 줄여 안정적인 보행이 이루어질 수 있도록 한 발가락부재 가 설치된다.구체적으로, 도 4 및 도 5를 참고하면, 상기 발가락부재는 상기 발몸체의 일단에 관절부를 통해 회전가능하게 설치되되, 2개 내지 3개로 분할되게 구성되어 울퉁불퉁한 노면 및 경사진 노면 등과 같은 불규칙 적인 노면에서 착용자의 하중을 분산 지지할 수 있도록 함으로써, 안정적으로 보행 가능하도록 할 수 있다. 여기서, 본 발명의 일 실시예에서는 상술한 바와 같이 상기 발가락부재의 갯수를 2개 내지 3개로 한정하고 있으나, 이는 사용상의 편의성을 향상시키기 위한 것으로, 발가락부재의 갯수는 선택적으로 3개 이상을 구 비하도록 할 수도 있다. 한편, 관절부는 일단이 상기 발몸체와 고정결합되고 타단이 상기 발가락부재와 회전가능하게 결 합되는 지지부재와, 일단이 상기 지지부재와 고정결합되고 타단이 상기 발가락부재를 탄성지지 하는 탄성부재를 포함할 수 있다. 즉, 도 5에 도시된 바와 같이, 지지부재의 일단이 상기 발몸체의 상측에 고정결합된 상태에서 상기 지지부재의 타단에 발가락부재가 힌지핀을 통해 회전가능하게 결합된다. 이후, 상기 발몸체 의 상측에 고정결합된 지지부재의 상측에 탄성부재의 일단이 고정결합되고, 상기 탄성부재(13 4)의 타단은 상기 발가락부재를 하방향으로 탄성지지하는 구조이다. 이때, 상기 탄성부재에 의해 탄성지지되는 발가락부재는 도 6에 도시된 바와 같이, 힌지결합된 하부 에 돌출턱을 형성하여 상기 발몸체의 단턱과 접촉될 수 있도록 함으로써, 하방향으로의 회전을 제한할 수 있도록 한다. 즉, 상방향으로의 회전은 가능하나 하방향으로의 회전은 제한되도록 함으로써 착용자가 안정적으로 보행할 수 있도록 한다. 한편, 본 발명의 일 실시예에 따른 인공발은 상기 발가락부재를 탄성지지하는 탄성부재의 일단 에 슬라이딩부재를 더 포함할 수 있다. 이때, 상기 슬라이딩부재는 도 7a 및 7b에 도시된 바와 같이, 발가락부재의 상측을 가압하는 상태에 서 상기 발가락부재의 회전시 화살표 방향으로 슬라이딩되는 것으로 마찰을 최소화하여 원활한 슬라이딩이 이루어질 수 있도록 플라스틱재질로 이루어진다. 덧붙여, 본 발명의 일 실시예에서는 상기 슬라이딩부재를 플라스틱재질로 형성하도록 하였으나, 경우에 따 라 실리콘, 고무 등 상기 발가락부재에 대해 원활하게 슬라이딩될 수 있는 재질이라면 그 재질에 제한을 두지 않는다. 따라서, 상기과 같은 구성으로 이루어진 본 발명의 일 실시예에 따른 인공발은 발몸체에 대해 발가락 부재가 회전될 수 있도록 함으로써, 의지환자가 안정적으로 보행할 수 있다. 이상, 본 발명의 실시예들에 대하여 설명하였으나, 해당 기술 분야에서 통상의 지식을 가진 자라면 특허청구범 위에 기재된 본 발명의 사상으로부터 벗어나지 않는 범위 내에서, 구성 요소의 부가 변경, 삭제 또는 추가 등에 의해 본 발명을 다양하게 수정 및 변경시킬 수 있을 것이며, 이 또한 본 발명의 권리범위 내에 포함된다고 할 것이다."}
{"patent_id": "10-2014-0130723", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 인공발을 개략적으로 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 인공발을 개략적으로 도시한 도면이다. 도 3은 본 발명의 실시예에 따른 인공발의 변형예를 개략적으로 도시한 도면 도 4는 본 발명의 일 실시예에 따른 인공발의 측면사시도이다. 도 5는 본 발명의 일 실시예에 따른 인공발의 분해사시도이다. 도 6은 본 발명의 일 실시예에 따른 인공발의 측면도를 개략적으로 도시한 도면이다. 도 7a 및 7b는 본 발명의 일 실시예에 따른 인공발의 발가락부가 회전되는 모습을 개략적으로 도시한 작동도이 다."}
