{"patent_id": "10-2024-0140737", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0155827", "출원번호": "10-2024-0140737", "발명의 명칭": "컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법", "출원인": "단국대학교 천안캠퍼스 산학협력단", "발명자": "우정권"}}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 장치를 이용한 어문 저작물 IP(Intellectual Property)의 거래 중개 방법에 있어서,저작물 IP의 판매자로부터 적어도 하나의 판매저작물 정보를 입력받는 단계;저작물 IP의 구매자로부터 적어도 하나의 구매요청 정보를 입력받는 단계;상기 판매저작물 정보로부터, 상기 판매저작물의 장르, 주제, 인물, 사건, 배경 중 적어도 하나에 대한 정보값을 포함하는 제1 요약정보와, 판매자 측 가격 정보를 추출하는 단계;상기 구매요청 정보로부터, 상기 구매자가 획득하고자 하는 저작물의 장르, 주제, 인물, 사건, 배경 중 적어도하나에 대한 정보값을 포함하는 제2 요약정보와, 구매자 측 가격 정보를 추출하는 단계;상기 제1 요약정보와 상기 제2 요약정보 간에 상기 각각의 요약 정보값을 비교함으로써 각각의 요약 정보값에대한 적어도 하나의 일치율을 계산하는 단계;상기 적어도 하나의 일치율을 포함하는 스토리 평가 지수를 계산하는 단계;상기 판매자 측 가격 정보와 상기 구매자 측 가격 정보를 기반으로, 상기 판매자와 상기 구매자가 각각 기존에성사시킨 저작물 IP 거래 기록으로부터 유래한 평균 거래 성사 가격을 참조하여, 상기 판매저작물의 추천 가격정보를 생성하는 단계;상기 스토리 평가 지수 및 상기 추천 가격 정보에 기반하여 상기 판매저작물 정보와 상기 구매요청 정보 간의매칭 점수를 계산하는 단계; 및상기 IP 판매자와 상기 IP 구매자 중 일방 또는 쌍방에게 상기 스토리 평가 지수의 구성에 관한 정보, 상기 매칭 점수에 관한 정보, 및 상기 추천 가격 정보를 포함하는 거래중개정보를 전송하는 단계; 를 포함하는, 컴퓨터장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제1 요약정보를 추출하는 단계는, 자연어로 작성된 상기 판매저작물 정보에 대한 자연어 처리에 의하여 적어도 하나의 상기 제1 요약정보를 추출하도록 구성되고,상기 제2 요약정보를 추출하는 단계는, 자연어로 작성된 상기 구매요청 정보에 대한 자연어 처리에 의하여 적어도 하나의 상기 제2 요약정보를 추출하도록 구성되는 것;을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항 또는 제 2 항 중 어느 한 항에 있어서,상기 판매저작물 정보에는 상기 판매저작물의 장르, 주제, 인물, 사건, 배경 중 적어도 하나에 대한 제1 태그정보가 포함되어 있고,상기 구매요청 정보에는 상기 구매자가 획득하고자 하는 저작물의 장르, 주제, 인물, 사건, 배경 중 적어도 하나에 대한 제2 태그 정보가 포함되어 있고,상기 제1 요약정보를 추출하는 단계는, 상기 제1 태그 정보를 읽어들이는 단계를 포함하고,상기 제2 요약정보를 추출하는 단계는, 상기 제2 태그 정보를 읽어들이는 단계를 포함하는 것;을 특징으로공개특허 10-2024-0155827-3-하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 적어도 하나의 일치율을 계산하는 단계는,상기 제1 요약정보의 제1 항목에 지정된 제1 정보값을 읽어들이는 단계;상기 제2 요약정보의 상기 제1 항목에 지정된 제2 정보값을 읽어들이는 단계;상기 제1 정보값과 상기 제2 정보값을 자연어 처리 장치에 입력하여 단어 벡터 공간에서의 유사도를 계산하는단계; 및상기 계산된 유사도를 상기 제1 항목에 대한 일치율로 결정하는 단계;를 포함하는 것을 특징으로 하는, 컴퓨터장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 매칭 점수를 계산하는 단계는,상기 스토리 평가 지수에 포함되는 적어도 하나의 일치율을 합산, 평균, 가중 합산, 가중 평균 중 하나 이상의계산법을 이용해 병합한 일치 점수를 계산하는 단계;상기 판매저작물의 이용자 조회수, 이용자 평가 점수, 이용자의 리뷰 내용, 판매저작물의 용량 또는 재생시간중 적어도 하나에 기반하는 인기 점수를 계산하는 단계;상기 판매자 측 가격 정보, 상기 구매자 측 가격 정보, 및 상기 추천 가격 정보 중 적어도 일부 간의 비교에 기반하는 가격 점수를 결정하는 단계; 및상기 일치 점수, 상기 인기 점수, 및 상기 가격 점수를 가중 합산하여 상기 매칭 점수를 계산하는 단계;를 포함하는 것을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 일치 점수, 상기 인기 점수, 및 상기 가격 점수를 가중 합산하여 상기 매칭 점수를 계산하는 단계는,상기 일치 점수에 제1 백분율 비중을, 상기 인기 점수에 제2 백분율 비중을, 상기 가격 점수에 제3 백분율 비중을 각각 곱한 뒤 그 결과를 합산하는 단계;인 것을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 제1 백분율 비중, 상기 제2 백분율 비중, 및 상기 제3 백분율 비중은 각각 40%, 30%, 30%인 것을 특징으로하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2024-0155827-4-제 6 항에 있어서,상기 제1 백분율 비중, 상기 제2 백분율 비중, 및 상기 제3 백분율 비중은, 기계 학습 인공지능에 의하여 가변적으로 결정되고,상기 기계 학습 인공지능이 기존에 성사시킨 저작물 IP 거래 기록에 기반하여 상기 제1 백분율 비중, 상기 제2백분율 비중, 및 상기 제3 백분율 비중 중 거래 성사에 높게 관련된 비중을 상향하고, 낮게 관련된 비중을 하향하는 단계;를 더 포함하는 것을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,복수의 판매저작물 정보와 하나의 구매요청 정보에 대하여, 각각 상기 스토리 평가 지수의 구성에 관한 정보,상기 매칭 점수에 관한 정보, 및 상기 추천 가격 정보를 포함하는 복수의 거래중개정보를 생성하는 단계;를 더포함하고,상기 거래중개정보를 전송하는 단계는, 상기 복수의 거래중개정보를 상기 구매자에게 전송하는 단계;를 포함하는 것을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,하나의 판매저작물 정보와 복수의 구매요청 정보에 대하여, 각각 상기 스토리 평가 지수의 구성에 관한 정보,상기 매칭 점수에 관한 정보, 및 상기 추천 가격 정보를 포함하는 복수의 거래중개정보를 생성하는 단계;를 더포함하고,상기 거래중개정보를 전송하는 단계는, 상기 복수의 거래중개정보를 상기 판매자에게 전송하는 단계;를 포함하는 것을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 판매저작물 정보, 적어도 하나의 상기 제1 요약정보, 및 상기 판매 판매자 측 가격 정보를 연관시킨 레코드를 데이터베이스(Database)에 저장하는 단계;를 더 포함하고,상기 적어도 하나의 일치율을 계산하는 단계는, 상기 일치율의 계산을 위해 상기 레코드를 상기 데이터베이스로부터 불러오는 단계;를 포함하는 것을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 판매저작물 정보는, 상기 판매저작물의 저작권자에 의해 제공되는 정보이고, 상기 저작권자 및 상기 판매자 중 적어도 하나에 대한 프로파일 정보를 포함하는 것을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서,상기 구매요청 정보는, 상기 판매저작물의 2차 저작물을 제작하고자 하는 제작자들에 의해 제공되는 정보이고,공개특허 10-2024-0155827-5-상기 제작자 및 상기 구매자 중 적어도 하나에 대한 프로파일 정보를 포함하는 것을 특징으로 하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서,상기 판매자 및 상기 구매자 중 적어도 일방으로부터 상기 거래중개정보 중 적어도 하나에 기반하여 실행된 저작물 IP 거래에 관한 정보를 수신하는 단계; 및상기 저작물 IP 거래에 관한 정보를 상기 저작물 IP 거래 기록에 추가하는 단계;를 더 포함하는 것을 특징으로하는, 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "어문 저작물 IP(Intellectual Property)의 거래 중개 기능을 가진 컴퓨터 장치에 있어서,프로세서;메모리;저작물 IP의 판매자로부터 적어도 하나의 판매저작물 정보를 입력받도록 구성되는, 제1입력부;저작물 IP의 구매자로부터 적어도 하나의 구매요청 정보를 입력받도록 구성되는, 제2입력부;상기 판매저작물 정보로부터, 상기 판매저작물의 장르, 주제, 인물, 사건, 배경 중 적어도 하나에 대한 정보값을 포함하는 제1 요약정보와, 판매자 측 가격 정보를 추출하도록 구성되는, 제1추출부;상기 구매요청 정보로부터, 상기 구매자가 획득하고자 하는 저작물의 장르, 주제, 인물, 사건, 배경 중 적어도하나에 대한 정보값을 포함하는 제2 요약정보와, 구매자 측 가격 정보를 추출하도록 구성되는, 제2추출부;상기 제1 요약정보와 상기 제2 요약정보 간에 상기 각각의 요약 정보값을 비교함으로써 각각의 요약 정보값에대한 적어도 하나의 일치율을 계산하도록 구성되는, 일치율 계산부;상기 적어도 하나의 일치율을 포함하는 스토리 평가 지수를 계산하도록 구성되는, 지수계산부;상기 판매자 측 가격 정보와 상기 구매자 측 가격 정보를 기반으로, 상기 판매자와 상기 구매자가 각각 기존에성사시킨 저작물 IP 거래 기록으로부터 유래한 평균 거래 성사 가격을 참조하여, 상기 판매저작물의 추천 가격정보를 생성하도록 구성되는, 추천 가격 정보 생성부;상기 스토리 평가 지수 및 상기 추천 가격 정보에 기반하여 상기 판매저작물 정보와 상기 구매요청 정보 간의매칭 점수를 계산하도록 구성되는 매칭계산부; 및상기 IP 판매자와 상기 IP 구매자 중 일방 또는 쌍방에게 상기 스토리 평가 지수의 구성에 관한 정보, 상기 매칭 점수에 관한 정보, 및 상기 추천 가격 정보를 포함하는 거래중개정보를 전송하는 거래중개정보 전송부; 를포함하는, 컴퓨터 장치."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 제1추출부는, 자연어로 작성된 상기 판매저작물 정보에 대한 자연어 처리에 의하여 적어도 하나의 상기 제1 요약정보를 추출하도록 구성되고,상기 제2추출부는, 자연어로 작성된 상기 구매요청 정보에 대한 자연어 처리에 의하여 적어도 하나의 상기 제2요약정보를 추출하도록 구성되는 것;을 특징으로 하는, 컴퓨터 장치.공개특허 10-2024-0155827-6-청구항 17 제 15 항에 있어서,상기 일치율 계산부는,상기 제1 요약정보의 제1 항목에 지정된 제1 정보값을 읽어들이고,상기 제2 요약정보의 상기 제1 항목에 지정된 제2 정보값을 읽어들이고,상기 제1 정보값과 상기 제2 정보값을 자연어 처리 장치에 입력하여 단어 벡터 공간에서의 유사도를 계산하고,그리고상기 계산된 유사도를 상기 제1 항목에 대한 일치율로 결정하도록 구성되는 것;을 특징으로 하는, 컴퓨터 장치."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 1 항에 있어서,상기 매칭계산부는,상기 스토리 평가 지수에 포함되는 적어도 하나의 일치율을 합산, 평균, 가중 합산, 가중 평균 중 하나 이상의계산법을 이용해 병합한 일치 점수를 계산하고,상기 판매저작물의 이용자 조회수, 이용자 평가 점수, 이용자의 리뷰 내용, 판매저작물의 용량 또는 재생시간중 적어도 하나에 기반하는 인기 점수를 계산하고,상기 판매자 측 가격 정보, 상기 구매자 측 가격 정보, 및 상기 추천 가격 정보 중 적어도 일부 간의 비교에 기반하는 가격 점수를 결정하고, 그리고상기 일치 점수, 상기 인기 점수, 및 상기 가격 점수를 가중 합산하여 상기 매칭 점수를 계산하도록 구성되는것;을 특징으로 하는, 컴퓨터 장치."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1 항에 있어서,상기 판매저작물 정보, 적어도 하나의 상기 제1 요약정보, 및 상기 판매 판매자 측 가격 정보를 연관시킨 레코드를 데이터베이스(Database)에 저장하도록 구성되는 데이터베이스부;를 더 포함하고,상기 일치율 계산부는, 상기 일치율의 계산을 위해 상기 레코드를 상기 데이터베이스부로부터 불러오도록 구성되는 것;을 특징으로 하는, 컴퓨터 장치."}
{"patent_id": "10-2024-0140737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "명령어들을 포함하는 컴퓨터 판독 가능 기록 매체로서,상기 명령어들은, 프로세서에서 실행될 때, 상기 프로세서로 하여금,저작물 IP의 판매자로부터 적어도 하나의 판매저작물 정보를 입력받고;저작물 IP의 구매자로부터 적어도 하나의 구매요청 정보를 입력받고;;상기 판매저작물 정보로부터, 상기 판매저작물의 장르, 주제, 인물, 사건, 배경 중 적어도 하나에 대한 정보값을 포함하는 제1 요약정보와, 판매자 측 가격 정보를 추출하고;상기 구매요청 정보로부터, 상기 구매자가 획득하고자 하는 저작물의 장르, 주제, 인물, 사건, 배경 중 적어도하나에 대한 정보값을 포함하는 제2 요약정보와, 구매자 측 가격 정보를 추출하고;상기 제1 요약정보와 상기 제2 요약정보 간에 상기 각각의 요약 정보값을 비교함으로써 각각의 요약 정보값에공개특허 10-2024-0155827-7-대한 적어도 하나의 일치율을 계산하고;상기 적어도 하나의 일치율을 포함하는 스토리 평가 지수를 계산하고;상기 판매자 측 가격 정보와 상기 구매자 측 가격 정보를 기반으로, 상기 판매자와 상기 구매자가 각각 기존에성사시킨 저작물 IP 거래 기록으로부터 유래한 평균 거래 성사 가격을 참조하여, 상기 판매저작물의 추천 가격정보를 생성하고;상기 스토리 평가 지수 및 상기 추천 가격 정보에 기반하여 상기 판매저작물 정보와 상기 구매요청 정보 간의매칭 점수를 계산하고; 그리고상기 IP 판매자와 상기 IP 구매자 중 일방 또는 쌍방에게 상기 스토리 평가 지수의 구성에 관한 정보, 상기 매칭 점수에 관한 정보, 및 상기 추천 가격 정보를 포함하는 거래중개정보를 전송하도록 구성된 것; 을 특징으로하는, 컴퓨터 판독가능 기록 매체."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법에 대한 것으로, 보다 상세하게는, 자연어 처"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "요약", "paragraph": 2, "content": "리를 바탕으로 판매저작물과 구매요청을 동일한 요약정보 메타데이터로 변환함으로써 자동화된 방법으로 거래중 개정보를 생성하여 IP 거래를 중개하는 방법 및 이를 구현한 시스템에 관한 것이다. 본 발명에 따른 IP 거래 중 (뒷면에 계속)"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법에 대한 것으로, 보다 상세하게는, 자연어 처"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "리를 바탕으로 판매저작물과 구매요청을 동일한 요약정보 메타데이터로 변환함으로써 자동화된 방법으로 거래중 개정보를 생성하여 IP 거래를 중개하는 방법 및 이를 구현한 시스템에 관한 것이다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양한 창작 이야기에 토대를 둔 문화저작물의 유통이 증가하는 추세에 있다. 특히 최근에는 개인 저작자가 발 표한 1차 저작물이 다양한 유형의 2차 저작물로 제작되어 상업적 성공을 거두는 사례 또한 이어지고 있다. 예를 들어, 어문 저작물을 2차 저작물로서 영상화하여 상업화하는 등의 목적을 위해 1차 저작물에 대한 지식재산권 (Intellectual Property, IP) 시장 규모가 확대되는 추세에 있다. 종래에는 2차 저작물의 상업화를 추진하는 제작자가 1차 저작물 또는 그 저작권자를 탐색하는 과정에 다양한 어 려움이 있었다. 공개되는 1차 저작물의 양이 방대하기 때문에, IP 거래에 있어서 2차 저작물의 제작자와 1차 저 작물의 작가 간에는 1차 저작물의 유통을 담당하는 플랫폼 또는 콘텐츠 공급사(CP)가 중개자로서 개입하게 되는 경우가 빈번하였다. 그러나 이 같은 저작물의 중간 유통 구조는 2차 저작물을 제작하고자 하는 제작자 입장에서 작품 탐색의 다양성을 제한하고, 1차 저작물의 작가에게는 IP의 공급 조건 등에 관련하여 불리하거나 불공정한 계약 체결이 강요되는 등의 문제를 발생시키곤 하였다. 특히 1차 저작물 작가의 입장에서는 본인의 저작물 IP를 중간 중개자를 거치지 않고 직접 다양한 2차 저작물 제 작자들에게 노출하고 싶고, 중개자의 존재로 인해 침해되는 본인의 IP 관련 수익을 보다 안전하게 보호하고, 나 아가 2차 저작물 제작자들에 대하여 직접 시장조사를 실시하여 상업적 창작활동에 반영하는 등, 현재 유통구조 에서는 기대하기 어려운 서비스 경험들을 기대하게 된다. 그럼에도 불구하고, 상술하였듯 1차 저작물의 양이 방대하고, 또한 1차 저작물의 판권을 획득하고자 하는 2차 저작물 제작자 또한 적은 수가 아니기에, 그 양자 간의 IP 거래를 중개하는 주체가 존재할 수밖에 없다는 한계 가 있다. 이러한 영역에서 종래의 해결책으로는 1차 저작물을 상품과 유사한 방식으로 추천하는 기술이 존재하였다. 이러 한 기술은 1차 저작물을 직접 소비하는 소비자 또는 구독자를 대상으로 서점, 영화관, 영상 콘텐츠 플랫폼과 같 은 곳에서 사용하여 왔다. 종래기술에서는 다수의 소비자의 소비 패턴을 분석하여 소비자의 구독수가 높은 것에 가중치를 두거나, 소비자의 연속적 선택을 분석하여 연관 작품을 추천하는 등의 분석을 활용하였다. 또한 1차 저작물에 인력(人力)으로 태그(Tag)를 부여하여 저작물의 속성에 대한 검색을 가능하게 하는 방법을 활용하였다. 그러나 소비자의 소비 패턴을 분석하여 1차 저작물을 추천하기 위해서는 다수의 소비자가 이미 저작물을 소비한 기록으로부터 결과를 도출하여야 하므로, 시장 또는 플랫폼에 새로이 진입한 소비자를 대상으로 하는 추천의 정확도가 낮게 되었다. 또한, 2차 저작물 제작자와 같이 대량소비를 전제로 하지 않고 엄선된 1차 저작물을 선별 하는 데 집중하는 경우에는 대응하기 어려웠다. 결국 종래 기술을 이용하여서도 저작물 거래에 있어 중개자의 개입을 배제하는 데에 어려움이 있었다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 종래 배경기술의 한계를 극복하기 위하여 어문 저작물의 거래 중개 과정을 자동화하고자 하는 것이다. 종래기술이 가지는 본질적 한계는 방대한 1차 저작물의 양으로부터 기인한다. 방대한 양의 어문 저작물 의 존재로 인해 작가와 제작자 간의 직거래가 사실상 불가능하며, 중개를 전업으로 하는 자가 개입되지 않으면 합리적인 시장이 형성되기 어렵다. 상술하였던 CP 및 플랫폼에 의한 부당대우 또한 이러한 중개자의 필연성으로 부터 기인하는 바가 크다. 따라서, 본 발명은 이러한 중개 절차에 중개자의 개입을 최소화하고 대부분의 절차를 자동화하는 것을 목적으로 한다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 문제점을 해결하기 위한 본 발명의 일 양태에 따른 프로세서를 포함하는 컴퓨터 장치를 이용한 어문 저 작물 IP(Intellectual Property)의 거래 중개 방법은, 상기 프로세서가 저작물 IP의 판매자로부터 적어도 하나 의 판매저작물 정보를 입력받는 단계, 상기 프로세서가 저작물 IP의 구매자로부터 적어도 하나의 구매요청 정보"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "를 입력받는 단계, 상기 프로세서가 상기 판매저작물 정보로부터 제1 요약정보를 추출하는 단계, 상기 프로세서"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "가 상기 구매요청 정보로부터 제2 요약정보를 추출하는 단계, 상기 프로세서가 상기 제1 요약정보와 제2 요약정 보간의 상관성에 기반하여 스토리 평가 지수를 계산하는 단계, 상기 프로세서가 상기 스토리 평가 지수에 기반 하여 상기 판매저작물 정보와 상기 구매요청 정보 간의 매칭 점수를 계산하는 단계, 및 상기 프로세서가 상기 IP 판매자와 상기 IP 구매자 중 일방 또는 쌍방에게 상기 매칭 점수에 관한 정보를 전송하는 단계; 를 포함할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "상기 제1 요약정보와 제2 요약정보는, 콘텐츠 유형, 장르, 주제, 인물, 사건, 배경 중 적어도 하나의 항목, 그 리고 상기 각각의 항목에 대응하는 스토리 정보값을 포함하는 저작물 메타데이터일 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 5, "content": "상기 스토리 평가 지수를 계산하는 단계는, 상기 프로세서가 상기 제1 요약정보와 제2 요약정보를 구성하는 적 어도 하나의 항목들마다 각각의 항목에 지정된 정보값을 서로 비교하여 적어도 하나의 일치율을 계산하는 단계, 상기 프로세서가 상기 항목들 별로 상기 일치율을 대응시킨 스토리 평가 지수를 구성하는 단계를 포함할 수 있 다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 6, "content": "상기 프로세서가 상기 각각의 항목에 지정된 정보값을 서로 비교하는 방법은, 상기 제1 요약정보의 제1 항목에"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 7, "content": "지정된 제1 정보값을 읽어들이고, 상기 제2 요약정보에서 상기 제1 항목에 지정된 제2 정보값을 읽어들이고, 상 기 제1 정보값과 상기 제2 정보값을 자연어 처리 장치에 입력하여 단어 벡터 공간에서의 일치율을 계산하고, 상 기 단어 벡터 공간에서의 일치율을 상기 제1 항목에 대한 일치율로 결정하고, 그리고 상기의 절차를 상기 프로 세서가 상기 각각의 항목에 대하여 수행하는 것일 수 있다. 상기 판매저작물 정보는 상기 판매자가 판매저작물에 대하여 책정한 희망 가격 정보를 포함하고, 상기 구매요청 정보는 상기 구매자가 임의의 판매저작물에 지불할 의향이 있는 예상 가격 정보를 포함하고, 상기 매칭 점수는, 상기 스토리 평가 지수를 합산, 평균, 가중 합산, 가중 평균 중 하나 이상의 계산법을 이용해 병합한 일치 점수, 상기 판매저작물의 이용자 조회수, 이용자 평가 점수, 이용자의 리뷰 내용, 판매저작물의 용량 또는 재생 시간 중 적어도 하나에 기반하는 인기 점수, 그리고 상기 희망 가격 정보와 예상 가격 정보의 금액의 비교에 기 반하여 결정되는 가격 점수를 상기 프로세서가 가중 합산한 것일 수 있다. 상기 프로세서가 상기 매칭 점수를 가중 합산하는 방법은, 상기 일치 점수에 제1 백분율 비중을, 상기 인기 점 수에 제2 백분율 비중을, 상기 가격 점수에 제3 백분율 비중을 각각 곱한 뒤 그 결과를 합산하는 것일 수 있다. 상기 프로세서가 상기 매칭 점수에 관한 정보를 전송하는 단계는, 상기 프로세서가 상기 희망 가격 정보와 예상 가격 정보를 기반으로 판매저작물의 추천 가격 정보를 생성하는 단계, 및 상기 프로세서가 상기 추천 가격 정보를 상기 매칭 점수와 함께 전송하는 단계를 더 포함할 수 있다. 상기 프로세서가 상기 매칭 점수에 관한 정보를 전송하는 단계는, 상기 프로세서가 하나의 상기 판매저작물 정 보와 복수의 상기 구매요청 정보 간에 각각 계산된 복수의 매칭 점수를 전송하는 단계, 및 상기 프로세서가 복 수의 상기 판매저작물 정보와 하나의 상기 구매요청 정보 간에 각각 계산된 복수의 매칭 점수를 전송하는 단계 중 적어도 하나를 더 포함할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 8, "content": "상기 제1 요약정보와 상기 제2 요약정보 중 적어도 하나는 자연어 처리 장치에 의해 추출될 수 있다. 상기의 프로세서를 포함하는 컴퓨터 장치를 이용한 어문 저작물 IP의 거래 중개 방법은, 상기 프로세서가 상기"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 9, "content": "판매저작물 정보와 상기 제1 요약정보 중 적어도 하나를 데이터베이스(Database)로부터 불러들이는 단계를 더 포함할 수 있다. 상술한 문제점을 해결하기 위한 본 발명의 일 양태에 따른 어문 저작물 IP의 거래 중개 기능을 가진 프로세서를 포함하는 컴퓨터 장치는, 저작물 IP의 판매자로부터 적어도 하나의 판매저작물 정보를 입력받는 제1입력부, 저 작물 IP의 구매자로부터 적어도 하나의 구매요청 정보를 입력받는 제2입력부, 상기 판매저작물 정보로부터 제1"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 10, "content": "요약정보를 추출하는 제1추출부, 상기 구매요청 정보로부터 제2 요약정보를 추출하는 제2추출부, 상기 제1 요약"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 11, "content": "정보와 제2 요약정보간의 상관성에 기반하여 스토리 평가 지수를 계산하는 지수계산부, 상기 스토리 평가 지수 에 기반하여 상기 판매저작물과 상기 구매요청 정보 간의 매칭 점수를 계산하는 매칭계산부, 및 상기 IP 판매자 와 상기 IP 구매자 중 일방 또는 쌍방에게 상기 매칭 점수에 관한 정보를 전송하는 전송부를 포함할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 12, "content": "상기 제1 요약정보와 제2 요약정보는, 콘텐츠 유형, 장르, 주제, 인물, 사건, 배경 중 적어도 하나의 항목, 그리고 상기 각각의 항목에 대응하는 스토 리 정보값을 포함하는 저작물 메타데이터일 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 13, "content": "상기 지수계산부는, 상기 제1 요약정보와 제2 요약정보를 구성하는 적어도 하나의 항목들마다 각각의 항목에 지 정된 정보값을 서로 비교하여 계산한 적어도 하나의 일치율에 기반하여, 상기 항목들 별로 상기 일치율을 대응 시킨 스토리 평가 지수를 출력하도록 구성될 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 14, "content": "상기 지수계산부가 상기 각각의 항목에 지정된 정보값을 서로 비교하는 방법은, 상기 제1 요약정보의 제1 항목"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 15, "content": "에 지정된 제1 정보값을 읽어들이고, 상기 제2 요약정보에서 상기 제1 항목에 지정된 제2 정보값을 읽어들이고, 상기 제1 정보값과 상기 제2 정보값을 자연어 처리 장치에 입력하여 단어 벡터 공간에서의 일치율을 계산하고, 상기 단어 벡터 공간에서의 일치율을 상기 제1 항목에 대한 일치율로 결정하고, 그리고 상기의 절차를 상기 프 로세서가 상기 각각의 항목에 대하여 수행하는 것일 수 있다. 상기 판매저작물 정보는 상기 판매자가 판매저작물에 대하여 책정한 희망 가격 정보를 포함하고, 상기 구매요청 정보는 상기 구매자가 임의의 판매저작물에 지불할 의향이 있는 예상 가격 정보를 포함하고, 상기 매칭 점수는, 상기 스토리 평가 지수를 합산, 평균, 가중 합산, 가중 평균 중 하나 이상의 계산법을 이용해 병합한 일치 점수, 상기 판매저작물의 이용자 조회수, 이용자 평가 점수, 이용자의 리뷰 내용, 판매저작물의 용량 또는 재생 시간 중 적어도 하나에 기반하는 인기 점수, 그리고 상기 희망 가격 정보와 예상 가격 정보의 금액의 비교에 기 반하여 결정되는 가격 점수를 상기 매칭계산부가 가중 합산한 것일 수 있다. 상기 매칭계산부는, 상기 일치 점수에 제1 백분율 비중을, 상기 인기 점수에 제2 백분율 비중을, 상기 가격 점 수에 제3 백분율 비중을 각각 곱한 뒤 그 결과를 합산하여 상기 매칭 점수를 출력하도록 구성될 수 있다. 상기 매칭계산부는, 상기 희망 가격 정보와 예상 가격 정보를 기반으로 판매저작물의 추천 가격 정보를 생성하 고, 상기 전송부는, 상기 추천 가격 정보를 상기 매칭 점수와 함께 전송하도록 구성될 수 있다. 상기 전송부는, 하나의 상기 판매저작물 정보와 복수의 상기 구매요청 정보 간에 각각 계산된 복수의 매칭 점수, 및 복수의 상기 판매저작물 정보와 하나의 상기 구매요청 정보 간에 각각 계산된 복수의 매칭 점수 중 적 어도 하나를 더 전송하도록 구성될 수 있다. 상기 제1 추출부 또는 제2 추출부 중 적어도 하나는 자연어 처리 장치에 의해 동작할 수 있다. 상기 어문 저작물 IP의 거래 중개 기능을 가진 프로세서를 포함하는 컴퓨터 장치는, 상기 판매저작물 정보와 상"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 16, "content": "기 제1 요약정보 중 적어도 하나를 저장하는 데이터베이스(Database)를 더 포함할 수 있다. 상술한 문제점을 해결하기 위한 본 발명의 일 양태에 따른 컴퓨터 판독가능 기록 매체는, 프로세서에서 실행될 수 있는 명령어들을 포함하고, 상기 명령어들은, 프로세서에서 실행될 때 상기 프로세서로 하여금, 저작물 IP의 판매자로부터 적어도 하나의 판매저작물 정보를 입력받고, 저작물 IP의 구매자로부터 적어도 하나의 구매요청"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 17, "content": "정보를 입력받고, 상기 판매저작물 정보로부터 제1 요약정보를 추출하고, 상기 구매요청 정보로부터 제2 요약정"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 18, "content": "보를 추출하고, 상기 제1 요약정보와 제2 요약정보간의 상관성에 기반하여 스토리 평가 지수를 계산하고, 상기 스토리 평가 지수에 기반하여 상기 판매저작물 정보와 상기 구매요청 정보 간의 매칭 점수를 계산하고, 그리고 상기 IP 판매자와 상기 IP 구매자 중 일방 또는 쌍방에게 상기 매칭 점수에 관한 정보를 전송하도록 구성될 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "어문 저작물의 메타데이터화를 통해 IP 거래의 중개 절차를 자동화함으로써, 중개의 효율을 극대화하면서도 중 개자가 개입할 수 있는 영역을 최소화할 수 있다. 이를 통하여 1차 저작물 작가와 2차 저작물 제작자 간에 보다 직접적인 IP 거래를 성사시켜, 쌍방에 이익이 되는 결과를 도출할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. \"및/또는\"이라는 용어는 복수의 관련된 기재된 항 목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 본 출원에서 발명을 설명함에 있어 \"장치\" 또는 \"부\"라는 용어를 사용하는 경우, 이는 장치 또는 기능부로서 구 현될 수 있는 본 발명의 어떠한 기능을 나타내는 실시예를 설명하기 위한 것이며, 반드시 해당 기능이 독립적인 단일 장치나 기능부로서 구현되어야 함을 의미하지 않는다. 예를 들어, 하나의 장치는 동일한 기능을 수행하는 복수의 장치로 구현될 수도 있으며, 반대로 복수의 장치 기능을 동시에 수행하기 위한 하나의 장치가 설치될 수 도 있다. 어떤 장치 또는 기능부의 기능은 소프트웨어적 수단을 통해 다른 장치나 기능부에 의해 또는 일반적 컴퓨터 및 정보처리 장치에 의해서 구현될 수 있다. 또한 복수의 장치 또는 기능부는 서로 정보통신 네트워크로 만 연결되고 물리적 공간에서는 이격되어 있을 수 있다. 이는 동일한 기술적 사상을 구현하기 위하여 정보처리 기술 분야에 익숙한 통상의 기술자가 취할 수 있는 다양한 실시예의 영역이므로, 여하의 상세한 구현 방법은 모 두 본 출원상 발명의 기술적 사상 영역에 포함되는 것으로 해석되어야 한다. 이하, 첨부한 도면들을 참조하여, 본 출원 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 본 발명 을 설명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부 호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 본 발명은 어문 저작물의 거래 중개 과정을 자동화하고자 하는 목적을 가진다. 이를 위하여, 본 발명에서는 판"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "매를 목적으로 게시되는 어문 저작물로부터 표준화된 메타데이터 양식의 요약정보를 추출하는 한편, 이러한 어"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "문 저작물의 저작권을 획득하고자 하는 제작자들의 구매요청 정보로부터도 동일한 양식의 요약정보를 추출하여, 대량의 저작물과 구매요청을 자동으로 비교할 수 있도록 한다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 4, "content": "도 1은 본 발명의 기본 개념을 요약한 개념도이다. 판매저작물 정보는 어문 저작물의 저작권자에 의해 제"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "공되는 정보이다. 판매저작물 정보는 판매저작물의 내용 본문이나 그에 대한 요약 정보를 포함할 수 있다. 한편, 저작권을 획득하여 2차 저작물을 제작하고자 하는 제작자들은 구매요청 정보를 제공한다. 구매요청 정보는 찾고 있는 원천 저작물에 대해 서술한 문장, 기획서 등의 문건, 검색 쿼리를 포함할 수 있다. 판매저작물 정보와 구매요청 정보는 모두 자연어로 작성된 문서일 수 있다. 여기에서 자연어란 인공 어와 대비되는 개념으로, 어떤 인공적인 규칙이나 언어 체계에 의해 정서된 것이 아닌, 일상적으로 사용되는 문 어체 또는 구어체의 언어에 의해 작성된 것이라는 의미를 나타낸다. 도 6은 판매저작물 정보 및 구매요청 정보의 공통서식에 관한 일 실시예를 나타낸 예시도이다. 도 6에 나타난 \"스토리 세트\"는 판매저작물을 판 매하고자 하는 저작권자 또는 판매자가, 또는 저작권을 획득하고자 하는 2차 저작물 제작자가 직접 작성하여 제"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "출할 수 있는 정보 시트이다. 본 발명의 목적 달성을 위하여서는 이러한 자연어 기반의 요약 정보 간에 자동화 된 방법으로 상호 간 유사성을 대조할 필요가 있다. 자연어로 작성된 문서는 언어적 특성으로 인해 상호 간의 유사성을 대조하기가 매우 까다롭다. 예를 들어, 인간 의 직관에 의하여 어떠한 어문 저작물과 어떠한 제작사 기획서가 동일한 내용을 서술하고 있다고 판단할 수 있 으나, 두 문서 정보의 원본을 기계적으로 비교하여 유사함을 판단하는 것은 매우 어렵다. 동일한 의미도 다른 형태의 문장이나 단어를 이용해 표기될 수 있으므로, 단순히 정보의 일대일 대조를 넘어서는 별도의 기술 적 조치가 필요하다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "본 발명에서는 판매저작물 정보를 제1 요약정보로, 구매요청 정보를 제2 요약정보로 각각 변환한다. 바람직하게는, 상기 각 변환 과정은 동일한 방식으로 구현된 자연어 처리 장치에 의해 동작할 수 있"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "다. 또한 바람직하게는, 상기 제1 요약정보와 제2 요약정보는 동일한 양식을 가진 메타데이터 형식일"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "수 있다. 자연어 처리 장치는 대량의 언어 콘텐츠를 자동으로 요약하여 그 요지를 추출하는 기능을 가질 수 있 으므로, 두 저작물을 동일한 자연어 처리 장치에 입력하여 동일한 양식의 메타데이터를 추출하는 경우, 두 정보 가 용이하게 비교될 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "비교 과정에서 각 메타데이터는 의미 집합 단위로 비교될 수 있다. 예를 들어, 제1 요약정보에 수록"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "된 메타데이터 중 '장르' 필드가 판매저작물의 장르를 '판타지'로 정의하는 경우, 이 정도는 제2 요약정보(25 5)에 수록된 '장르'필드의 메타데이터와 직접 비교될 수 있다. 이 때, 각 메타데이터 필드는 일치 여부에 대한"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "예/아니오식 판단이 아닌, 일치 정도에 따른 수치적 판단에 의해 비교될 수 있다. 예를 들어, 제2 요약정보"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "에 기재된 '장르' 필드 메타데이터의 값이 상기 제1 요약정보와 동일하게 '판타지'인 경우, 완전히일치하는 것으로 판단할 수 있는 한편, 해당 값이 'SF'인 경우, '판타지'와 의미적으로 유사한 지점이 있으므로 부분적으로 일치하고 있다고 판단할 수 있다. 상술한 바와 같은 부분적 일치의 판단 또한 자연어 처리 장치를 통해 이루어질 수 있다. 자연어 처리 기술을 사 용하여 특정한 단어가 다른 단어와 어느 정도의 의미적 유사성을 가지고 있는지 파악할 수 있다. 예를 들어, 종 래에 제시되어 있는 Word2Vec과 같은 방법론은, 인공지능 학습 체계를 이용하여 단어를 벡터 공간의 정보로 변 환하고, 벡터 공간에서 두 단어가 가리키는 벡터 간의 차이를 비교함으로써 단어 간의 연관 정도를 자동적 수단 에 의해 측정할 수 있는 도구를 제공한다. 본 발명에서는 상술한 Word2Vec이나, 그 밖에 유사한 기능을 가진 다 른 알고리즘을 사용하여 단어 간의 연관도를 파악하여 그 정도에 기반해 비교를 실시할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "상술한 바와 같이 표준화된 요약정보 형태로 변경된 정보를 상호 대조하는 방식을 사용하면, 대량의 판매저작물 정보와 대량의 구매요청 정보에 대하여 고속으로 비교를 실시할 수 있으며, 또한 상술한 바와 같은 자연어 처리 기반의 의미적 유사성 판단을 거치는 경우, 일치 여부가 아닌 일치의 정도를 수치화하여 도출할 수 있다. 이 같 은 과정을 거치면, 특정 판매저작물과 특정 구매요청 간에 높은 일치율이 확인되는 경우, 이를 바탕으로 상호 간의 저작권 거래를 중개할 수 있음은 자명하다. 본 발명을 통해 이처럼 자동화된 방식을 사용하여 어문 저작물 IP의 수요와 공급 간을 효율적으로 연결하여 거래를 중개할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 15, "content": "도 2는 본 발명에 의한 어문 저작물의 요약정보화 과정과 이를 바탕으로 한 IP 거래 중개 방법을 나타낸 개념도 이다. 어문 저작물 IP 거래 중개 시스템에 있어서, 거래의 참여자로는 판매자와 구매자를 상정한다. 상기 판매자는 어문 저작물의 저작자 및/또는 저작권자로서, 1차 저작물의 IP를 보유하고 이를 타인에게 판매할 의향이 있는 자를 의미한다. 상기 판매자는 어문 저작물의 저작자 본인일 수도 있고, 저작자 본인 으로부터 IP 거래 사무를 위탁 받은 제삼자일 수도 있다. 상기 구매자는 어문 저작물의 IP를 구매하고자 하는 자로서, 2차 저작물 제작을 위해 1차 저작물의 IP를 소정의 계약조건 하에 구매할 의향이 있는 자를 의미 한다. 예를 들어, 개작 창작자, 영상물 제작자, 콘텐츠 공급사(CP) 등이 구매자가 될 수 있다. 상기 판매자는 IP 거래 중개 시스템에 판매저작물 정보를 업로드한다. 판매저작물 정보는 IP 판매의 대상이 되는 어문 저작물, 즉 판매제작물의 원본과 그에 연관된 부수정보를 포함하는 정보집합일 수 있다. 바람직하게는, 판매저작물 정보는 판매저작물의 원본 데이터, 판매저작물의 제목, 작가, 장르,"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "배경, 사건, 인물, 태그 등 요약정보, 판매저작물에 판매자가 책정한 희망 가격 정보 중 적어도 하나를 포 함하는 정보집합일 수 있다. 또한, IP 거래 중개 시스템은 다수의 판매자로부터 다수의 판매저작물 정보를 제공받아 활용할 수 있다. 상기 판매저작물 정보는 제1 입력부를 통해 상기 시스템에 입력된다. 제1 입력부에 입력된 상기 판매저작물 정보는 제1 추출부로 전달된다. 제1 추출부는 상기 판매저작물 정보를 제"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "1 요약정보로 변환한다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "상기 제1 추출부는 상기 판매저작물 정보로부터 상기 제1 요약정보를 추출하기 위하여 자연어 처리 장치를 사용할 수 있다. 상기 자연어 처리 장치는 자연어 해석 능력을 구비한 컴퓨터 프로세서 에 의해 동작하는 장치로서, 바람직하게는, 해석 인공지능에 의하여 구동되는 것일 수 있다. 본 발명의 일 실시예에 따르면, 상기 자연어 처리 장치의 해석 인공지능은 사전학습 언어모델에 기반하여 동작하도록 구현될 수 있다. 바람직하게는, BERT(Bidirectional Encoder Representations from Transformers) 계열의 모델, 보다 구체적으로는, \"XML-RoBERTA-paraphrase\" 와 같은 유의어 판별 기능을 갖춘 모델이 사용될 수 있다. 상기 모델은 문장 분석 작업에 특화된 것으로, 관련 작업에 특화된 데이터로 사전에 전이학습(Fine- tuning)이 수행된 모델일 수 있다. 상기 모델은, 일례로, 2019년 Conneau, A. 등이 arXiv를 통해 발표한 논문에 제시된 종래의 것을 사용할 수 있으나, 이에 한정되지 아니하며, 본 발명의 자연어 처리 목적을 달성할 수 있는 어떠한 언어모델이 사용되어도 본 발명에 포함된다 할 것이다. 상기와 같은 학습 모델에 의하여 상기 자연어 처리 장치는 입력되는 문장의 의미적 또는 내재적 정보를 파 악하고, 필요 시 유사성을 분석하는 동작을 수행할 수 있다. 상기 자연어 처리 장치의 자연어 처리 인공지능 학습을 위해서는 초기 학습이 진행될 수 있다. 초기 학습"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "을 위해서는 기존에 알려져 있는 어문 저작물의 원문과 이를 요약한 정보를 매칭시킨 비정형 학습 데이터베이스 를 사용할 수 있다.상기 비정형 학습 데이터베이스는, 예를 들어, 출판사에 의해 발표된 어문 저작물의 본문과 해당 어문 저작물의"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "제목, 작가, 장르, 배경, 사건, 인물, 태그, 줄거리를 요약한 요약정보를 포함할 수 있다. 상기와 같은 요약정"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "보는 본 발명의 자연어 처리 장치가 어문 저작물 본문을 자동으로 요약정보로 변환하기 위한 학습 자료로 사용될 수 있다. 또는, 상기 비정형 학습 데이터베이스는 SNS 또는 기타 수단을 통하여 수집된 한국어 일상 대화 기반의 데이터 셋 및 말뭉치로서 단어의 문맥 파악이 가능한 자료를 포함할 수 있다. 상기와 같은 데이터는 본 발명의 자연어 처리 장치가 동의어 또는 유의어를 상호 비교하고 그 의미적 일치 정도를 도출하기 위한 학습 자료로 사용 될 수 있다. 본 발명의 일 실시예에서, 상기 비정형 학습 데이터베이스는 상기 자연어 처리 장치의 한국어 사전학습 언 어모델을 학습시키기 위한 것으로서, SNS 사용 데이터로부터 유래한 기계학습 병렬 말뭉치 데이터셋일 수 있다. 상기 데이터셋은, 일례로, 2019년 Conneau, A. 등이 arXiv를 통해 발표한 논문에 제시한 Facebook AI Research 제공의 약 100여개 언어에 대응하는 기계학습 번역 병렬 말뭉치 데이터셋을 사용하여도 무방하나, 이에 한정되 지 아니하며, 본 발명의 자연어 처리 목적을 달성할 수 있는 어떠한 자료를 이용하여 학습하더라도 그 결과물은 본 발명에 포함된다 할 것이다. 상기 비정형 학습 데이터베이스는 정제를 위해 전처리되어 투입될 수 있다. 상기 전처리 과정은 자언어 처리 장 치가 정상적으로 처리하지 못하는 데이터에 대하여 단어 의미의 보정, 오타 수정, 맞춤법 수정 등을 적용하는 과정일 수 있다. 상기 전처리 과정에서는 정규식 기반의 정제 프로그램을 사용하여 문단 및 문장 분리, 숫자 또 는 영어 표현, 특수문자 또는 이모티콘, 문장부호 등 어문 저작물 내부의 양식적 요소를 같은 양식으로 변환하 거나 또는 저작물로부터 제거하여 학습 대상이 되는 어문 저작물 원본의 데이터 균일성을 강화할 수 있다. 상기 전처리 과정에서는 학습 대상이 되는 데이터의 균일성을 더욱 향상시키기 위해 문장을 사전 분할하는 토크 나이징(Tokenizing) 절차를 적용할 수 있다. 주어진 자연어 문장의 어절 간의 띄어쓰기, 품사의 형태소 분석, Byte Pair Encoding 등의 방법을 통하여 분절하여, 자연어 처리 장치로 하여금 어휘의 지식체게 (Vocabulary)를 구축하도록 할 수 있다. 상기와 같이 학습된 자연어 처리 장치는 심층신경망(Deep Neural Network)과 얕은신경망(Shallow Neural Network)중 어느 하나 또는 둘 모두를 사용하도록 구성될 수 있다. 예를 들어, 심층신경망에 의해서는 어문 저"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "작문의 원문을 분석하여 요약정보를 추출하는 과정을, 얕은신경망에 의해서는 Word2Vec을 포함하는 단어 대조 방식에 의하여 단어의 의미 일치율을 판단하는 과정을 수행하도록 구성될 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "상기 자연어 처리 장치를 사용하여 제1 추출부에 의해 추출된 제1 요약정보는 본 발명의 시스템 에서 사용하는 표준화된 포맷의 저작물 메타데이터 형식으로 되어 있으며, 콘텐츠 유형, 장르, 주제, 인물, 사건, 배경 중 적어도 하나의 항목, 그리고 상기 각각의 항목에 대응하는 스토리 정보값으로 구성되어 있 을 수 있다. 상기 항목들 가운데 콘텐츠 유형이란, 판매저작물을 통해 2차 저작물 제작을 희망하는 콘텐츠 매체"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "의 유형 정보를 열거한 것일 수 있다. 예를 들면, 도 3의 제1 요약정보 예(250a)와 같이, \"콘텐츠 유형: 웹툰,"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "TV드라마, 영화; 장르: 로맨스; 사건: 사랑; 배경: 해변\"과 같은 형태로 요약된 제1 요약정보는, 상응하는 판매저작물 정보가 웹툰, TV드라마, 영화 등으로의 개작을 희망하는 로맨스 장르의 저작물로 해변에서 일 어나는 사랑 이야기임을 표현할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "상기 제1 요약정보는, 바람직하게는, 판매저작물 데이터베이스에 저장되어 활용될 수 있다. 상술하였 던 바와 같이, IP 거래 중개 시스템에는 복수의 판매자가 동시에 참여할 수 있다. 판매자는 IP 거래 중개 시스템에 임의의 원하는 시점에 판매저작물 정보를 제공하고, 시스템은 해당 정보를"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "제1 요약정보의 형태로 변환하여 상기 판매저작물 정보와 함께 판매저작물 데이터베이스에 축적 한 뒤, 임의의 시점에, 바람직하게는 구매자의 구매요청 정보가 입력되는 시점에, 판매저작물 데이터"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 28, "content": "베이스에 저장된 복수의 판매저작물 정보 및 제1 요약정보를 이용하여 IP 거래 중개를 시도할 수 있다. 한편, 상기 구매자는 IP 거래 중개 시스템에 구매요청 정보를 업로드한다. 구매요청 정보 는 구매자가 2차 저작물 제작을 목적으로 획득하고자 하는 저작물 IP에 관한 내용을 담은 정보로, 저작물 을 검색하기 위한 단어 또는 문장 형태의 검색 쿼리(Query), 구매요청서의 형태로서 구매자가 희망하는 어문 저"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "작물의 장르, 배경, 사건, 인물, 태그 등 요약정보, 임의의 판매저작물의 IP 구매를 위하여 구매자가 지불 할 의향이 있는 금액에 대한 예상 가격 정보 중 적어도 하나를 포함하는 정보집합일 수 있다. 또한, IP 거래 중개 시스템은 다수의 구매자로부터 다수의 구매요청 정보를 제공받아 활용할 수 있다. 상기 구매요청 정보는 제2 입력부를 통해 상기 시스템에 입력된다. 제2 입력부에 입력된 상기 구매요청 정보는 제2 추출부로 전달된다. 제2 추출부는 상기 구매요청 정보를 제2 요 약정보로 변환한다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 30, "content": "상기 제2 추출부는 상기 구매요청 정보로부터 상기 제2 요약정보를 추출하기 위하여 자연어 처 리 장치를 사용할 수 있다. 상기 자연어 처리 장치는 자연어 해석 능력을 구비한 컴퓨터 프로세서에 의해 동작하는 장치로서, 바람직하게는, 해석 인공지능에 의하여 구동되는 것일 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 31, "content": "또한, 바람직하게는, 상기 제1 요약정보 추출을 위해 제1 추출부가 호출한 자연어 처리 장치와"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 32, "content": "동일한 학습 데이터에 의해 학습되어 동일한 방식으로 동작하는 장치일 수 있다. 이는 제1 요약정보와 제2"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 33, "content": "요약정보의 메타데이터 양식이 가급적 동일하여야만 이후 매칭부에서 수행될 IP 거래 중개 과정이 용 이하기 때문이나, 반드시 이러한 구현에 한정되어야만 하는 것은 아니며, 매칭을 원활하게 하여 본 발명의 목적 을 양호하게 달성하기 위한 목적 하에서라면 제1 추출부와 제2 추출부가 호출하는 자연어 처리 장치 는 각각 상이한 학습 데이터 및/또는 방식으로 동작하여도 무방하다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 34, "content": "상기 자연어 처리 장치를 사용하여 제2 추출부에 의해 추출된 제2 요약정보는 본 발명의 시스템 에서 사용하는 표준화된 포맷의 저작물 메타데이터 형식으로 되어 있으며, 콘텐츠 유형, 장르, 주제, 인물, 사건, 배경 중 적어도 하나의 항목, 그리고 상기 각각의 항목에 대응하는 스토리 정보값으로 구성되어 있 을 수 있다. 상기 항목들 가운데 콘텐츠 유형이란, 구매자가 2차 저작물 제작을 추진하는 콘텐츠 매체의"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 35, "content": "유형 정보를 열거한 것일 수 있다. 예를 들면, 도 3의 제2 요약정보 예(255a)와 같이,\"콘텐츠 유형: TV드라마,"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 36, "content": "영화; 장르: 로맨스; 사건: 연애; 배경: 산\"과 같은 형태로 요약된 제2 요약정보는, 상응하는 구매요청 정 보가 웹툰, TV드라마, 영화 등으로의 개작을 위해 로맨스 장르의 산에서 일어나는 연애 이야기를 담은 저 작물을 탐색하고 있음을 표현할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 37, "content": "상기 제2 요약정보는, 구매자의 구매요청 정보가 접수되는 경우에 이에 응하여 생성될 수도 있 으나, 본 발명의 다른 실시예에서는, 미리 생성된 뒤 구매요청 데이터베이스에 저장되어 활용될 수 있다. 상술하였던 바와 같이, IP 거래 중개 시스템에는 복수의 구매자가 동시에 참여할 수 있다. 구매자 는 IP 거래 중개 시스템에 미리 구매요청 정보를 제공하고, 시스템은 해당 정보를 제2 요 약정보의 형태로 변환하여 상기 구매요청 정보와 함께 구매요청 데이터베이스에 축적한 뒤, 임 의의 시점에, 바람직하게는 판매자가 구매요청 정보와의 매칭을 요청하는 시점에, 구매요청 데이터베이스"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 38, "content": "에 저장된 복수의 구매요청 정보 및 제2 요약정보를 이용하여 IP 거래 중개를 시도할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 39, "content": "상술한 바와 같이 적어도 하나의 제1 요약정보와 제2 요약정보가 준비되면, 이를 바탕으로 매칭부 에서 IP 거래 중개 절차를 수행할 수 있다. 매칭부의 동작은 크게 지수계산부와 매칭계산부 로 나누어 설명할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 40, "content": "지수계산부에서는 상기 제1 요약정보와 제2 요약정보간의 상관성에 기반하여 스토리 평가 지수"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 41, "content": "를 계산할 수 있다. 상기 제1 요약정보와 제2 요약정보는, 바람직하게는, 동일한 메타데이터 양식으"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 42, "content": "로 되어 있을 수 있다. 따라서, 각각의 요약정보를 구성하는 메타데이터의 개별 항목별로 각각의 항목에 지정된 정보값을 서로 비교할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 43, "content": "본 발명의 일 실시예에 의한 상기 정보값의 비교 과정을 보다 상세히 설명한다. 먼저 상기 제1 요약정보의"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 44, "content": "제1 항목에 지정된 제1 정보값을 읽어들이고, 상기 제2 요약정보에서 동일한 제1 항목에 지정된 제2 정보"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 45, "content": "값을 읽어들인다. 즉, 같은 항목에 대해 각각의 요약정보로부터 정보를 읽어낸다. 그 다음, 상기 제1 정보값과 상기 제2 정보값의 일치 정도를 판단할 수 있다. 이 때, 일치 정도의 판단은 단순히 제1 정보값과 제2 정보값이 동일한지의 여부로 판단할 수도 있으나, 바람직하게는, 제1 정보값과 제2 정보값을 자연어 처리 장치에 입력하고, 각각의 정보값을 구성하는 단어를 자연어 처리 장치에 입력하여 서로 간의 의미가 일치하는 정 도를 계산함으로써 판단할 수도 있다. 특히, 본 발명의 일 실시예에 따르면, 상기 일치하는 정도의 계산은, 상기 제1 정보값과 제2 정보값을 자연어 처리 장치에 의해 단어 벡터 공간에 투영 후 비교하는 방법으로 구현될 수 있다. 단어 벡터 공간이란 Word2Vec과 같은 인공지능 기반의 자연어 처리 방법에서 사용되는 개념으로, 어떠한 단어를 다른 단어들과의 상 관관계를 통해 소정의 의미를 나타내는 벡터로 정의하고, 이 벡터를 벡터 공간 내에서 다른 벡터와 대조함으로 써 단어 뜻의 일치나 문맥에서 적합한 정도를 수학적 계산에 의해 판단할 수 있는 방법을 의미한다.본 발명의 일 실시예에서, 상기 일치하는 정도의 계산을 위한 자연어 처리 장치의 동작은 도 7에 나타난 것과 같은 절차에 의해 이루어질 수 있다. 상기 제1 정보값과 제2 정보값은 데이터의 균일성을 더욱 향상 시키기 위해 문장을 사전 분할하는 토크나이저에 투입되어 토큰화될 수 있다. 토큰화된 각 정보값(730, 735)은 사전학습 언어모델에 투입되어 문장 벡터(750, 755)로 변환된 뒤 상호 비교 처리될 수 있다. 상기 사전학습 언어모델은, 상술하였듯이 BERT 계열의 모델일 수 있다. 상기 상호 비교 과정을 위한 벡터의 해석 과 정에는 인덱싱 테이블이 사용될 수 있다. 상기 상호 비교 과정에서는, 입력 문장 간의 언어 모델 사용 비 교에 의한 의미적/내재적 유사성 점수와, 어휘 분절을 통해 추출된 토큰이 공통된 정도에 의한 표현적/명시적 유사성 점수를 각각 판단하고, 상기 두 유사성 점수의 조화평균을 도출하는 방식으로 종합 유사성 점수를 획득 할 수 있다. 상기 비교 과정에 대한 실시예는 본 발명 구현을 위한 여러 가지 실시예 중 하나에 해당하며, 그 밖에 자연어 처리 알고리즘으로써 서로 다른 두 단어의 의미적, 문맥적, 표현적 일치 정도를 비교할 수 있는 어떠한 알고리 즘 또는 구현 방법이어도 무방하다. 상기의 비교 절차는 지수계산부에 의하여 상기 각각의 항목에 대하여 반복적으로 수행될 수 있다. 이를 통"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 46, "content": "해, 제1 요약정보와 제2 요약정보 각각에 속한 모든 항목의 정보값이 비교될 수 있다. 이 비교 결과는 항목 별 로 일치하는 정도를 대응시켜 나타내는 새로운 메타데이터로서 형성될 수 있으며, 이를 본 발명에서는 스토리 평가 지수라고 부르기로 한다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 47, "content": "지수계산부에 의하여 상술한 제1 요약정보와 제2 요약정보의 항목 별 정보값 비교를 통해 스토 리 평가 지수를 도출하는 과정을 도 3을 참조하여 간략히 설명하고자 한다. 하기 설명하는 바는 상기 정보값의 비교 과정을 개념적으로 설명하기 위해 단순화하여 만든 인위적 사례에 불과하므로, 도 3 및 하기의 서술은 본 발명을 한정하지 아니하며, 예시된 것과 동일한 항목, 정보값, 비교 결과, 및 결과 수치가 도출되어야 함을 의 미하지 않는다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 48, "content": "도 3에서는, 제1 요약정보 예(250a) 는“콘텐츠 유형: 웹툰, TV드라마, 영화; 장르: 로맨스; 사건: 사랑; 배경:"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 49, "content": "해변\"이고, 제2 요약정보 예(255a)는 콘텐츠 유형: 웹툰, TV드라마, 영화; 장르: 로맨스; 사건: 연애; 배경:"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 50, "content": "산\"인 경우를 가정한다. 상기의 두 예시적 요약정보(250a, 255a)의 각 항목을 비교함으로써, 지수계산부 는 스토리 평가 지수를 도출하고자 한다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 51, "content": "제1 요약정보 예(250a)와 제2 요약정보 예(255a)에서 각각 \"콘텐츠 유형\" 항목의 정보값을 읽어들여 서로 비교 하면, 두 항목에 열거된 정보값들 간에 \"TV드라마, 영화\"가 일치하고 있음을 확인할 수 있다. 이 경우, 판 매자가 판매저작물 정보를 통해 희망한 콘텐츠 유형과 구매자가 구매요청 정보를 통해 희 망한 콘텐츠 유형이 부분적으로나마 일치하여, 거래가 성사될 가능성이 높다고 간주할 수 있다. 따라서 이 항목"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 52, "content": "은 두 요약정보 간에 \"일치\"한다고 판단하고 그 세부 내역을 스토리 평가 지수에 포함하여 출력할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 53, "content": "제1 요약정보 예(250a)와 제2 요약정보 예(255b)에서 각각 \"장르\" 항목의 정보값을 읽어들여 서로 비교하 면, 두 항목의 정보값이 \"로맨스\"로 동일함을 확인할 수 있다. 이 경우, 해당 항목의 정보값은 \"100%\" 일치한다 고 판단할 수 있으며, 이를 스토리 평가 지수에 포함하여 출력할 수 있다."}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 54, "content": "제1 요약정보 예(250a)와 제2 요약정보 예(255b)에서 각각 \"사건\" 항목의 정보값을 읽어들여 서로 비교하 면, 두 항목의 정보값이 각각 \"사랑\"과 \"연애\"임을 확인할 수 있다. 이 경우, 해당 항목의 정보값은 비록 그 단 어에 있어서 상이하지만, 의미적으로는 비교적 유사함을 알 수 있다. 이 때, 의미의 유사함은 상술한 바와 같이 자연어 처리 장치에 의해 Word2Vec 등을 이용하여 단어 벡터 공간에서 수학적 방법에 의해 계산되는 벡터 간의 일치율에 따라 구해질 수 있다. 이러한 유사도 판단의 결과에 따라, 두 단어 간의 일치율이 \"70%\"로 판단 된 경우, 이를 스토리 평가 지수에 포함하여 출력할 수 있다. 한편, 상기와 같은 방법으로 \"배경\" 항목의 정보값을 비교하면, 각각 \"산\"과 \"바다\"로서 의미가 비교적 상이함 을 알 수 있다. 이 경우 위와 같은 단어 벡터 공간에서의 일치율은 상대적으로 낮게, 예시적으로는 \"30%\"로 판 단될 수 있으며, 이를 스토리 평가 지수에 포함하여 출력할 수 있다. 도 3의 예시에서, 스토리 평가 지수를 구성하는 값의 양식은 \"일치/불일치\" 양식과 백분율 양식이 제시되"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 55, "content": "어 있다. 그러나 본 발명은 이러한 양식에 한정되지 아니하며, 두 요약정보 간에 일치 또는 유사한 정도를 척도 화할 수 있는 다양한 기법들이 응용될 수 있다. 예를 들어, 본 발명의 다른 실시예에서는, 상기 스토리 평가 지"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 56, "content": "수는 항목 별로 5점 만점의 정수 점수로 표기될 수 있다.상기 예시와 같이, 지수계산부는 제1 요약정보와 제2 요약정보를 서로 비교하여 스토리 평가 지"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 57, "content": "수를 생성할 수 있다. 상기 스토리 평가 지수에 기반하여, 매칭계산부에서는 제1 요약정보와 제2 요 약정보간의 매칭율을 계산할 수 있다. 상기 매칭율은 두 정보의 연관성을 점수화한 것으로, 매칭율이 높은 경우 판매저작물과 구매요청 간의 상관도가 높은 것으로 판단할 수 있는 점수이다. 상기 매칭율을 근거로 하여, 판매자 및 구매자는 자신이 업로드한 판매저작물 정보 또는 구매요청 정보에 가장 근접하는 상대측 정보를 식별 할 수 있게 된다. 상기 매칭계산부에서 매칭율을 계산하는 방법은, 본 발명의 일 실시예에 따르면, 하나의 판매저작물 정보 와 구매요청 정보에 대응하는 일치 점수, 인기 점수, 가격 점수 등 세 가지 점수를 계산한 뒤 이를 가중 합산하는 것일 수 있다. 일치 점수는, 지수계산부에서 계산된 스토리 평가 지수의 각 항목별 일치 정도를 나타내는 값들을 병합한 것일 수 있다. 바람직하게는, 상기 일치 점수는, 상기 스토리 평가 지수의 개별 항목 값을 모두 합산한 총점일 수 있다. 그러나 병합 방식은 반드시 이에 한정되지 아니하며, 단순 합산 외에도 항목 별 가중치를 적용한 합산 을 적용하거나, 산술 또는 기하 평균을 적용하거나, 항목 별 가중치를 적용하여 평균을 내거나, 그 외에 항목별 수치를 병합하여 단일 점수로 변환하기 위한 다양한 수학적 수단이 사용될 수 있으며, 상기 수학적 수단은 본 발명을 실시하고자 하는 이가 필요에 따라 임의로 선택할 수 있다. 인기 점수는, 상기 판매저작물 정보를 통해 제공될 수 있는 정보에 기반하여 계산되는 점수이다. 상기 인 기 점수의 계산 과정에는 판매저작물의 대중적 인기를 나타내는 각종 지표가 포함될 수 있다. 예를 들어, 판매 저작물이 온라인에 공개된 어문 저작물인 경우, 판매저작물의 온라인 조회수가 포함될 수 있다. 판매저작물이 출판된 어문 저작물인 경우, 출판물의 판매량 또는 판매처 인기순위가 포함될 수 있다. 판매저작물에 대해 열람 자 또는 독자가 부여한 평점이 포함될 수 있다. 판매저작물에 대해 열람자 또는 독자가 작성한 평가, 감상, 후 기, 및 사용자 지정 해시태그(Hashtag)등의 비정형 인기도 데이터 또한 포함될 수 있으며, 이러한 비정형 인기"}
{"patent_id": "10-2024-0140737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 58, "content": "도 데이터는 추가적으로 자연어 처리 장치에 의하여 처리될 수 있고, 제1 요약정보 또는 제2 요약정 보와 비교되는 방식으로 처리될 수도 있다. 상기 인기 점수는 상기 나열한 것 또는 그 밖의 판매저작물의 인기와 관련된 지표를 정규화 및/또는 병합한 것 일 수 있다. 본 발명의 일 실시예에 따르면, 상기 인기 점수는, 적어도 하나의 인기 지표 값을 백분율 기준으로 정규화한 뒤, 상기 적어도 하나의 정규화된 인기 지표 값을 평균함으로써 병합한 점수일 수 있다. 정규화 방식 은, 판매저작물 데이터베이스에 저장된 모든 판매저작물 정보의 동일한 인기 지표 값 중 현재 처리 중인 판매저작물 정보의 값이 위치하는 상위 백분율을 구하는 것일 수 있으나, 반드시 이에 한정되지는 않는다. 병합 방식또한 상기 서술한 것에 한정되지 아니하며, 단순 합산 또는 항목 별 가중치를 적용한 합산을 적용하거 나, 산술 또는 기하 평균을 적용하거나, 항목 별 가중치를 적용하여 평균을 내거나, 그 외에 항목별 수치를 병 합하여 단일 점수로 변환하기 위한 다양한 수학적 수단이 사용될 수 있다. 상기 정규화 및 상기 병합을 처리하 기 위한 수학적 수단은 본 발명을 실시하고자 하는 이가 필요에 따라 임의로 선택할 수 있다. 가격 점수는, 판매저작물에 대해 판매자가 책정하여 상기 판매제작물 정보에 기재한 희망 가격 정보 와, 임의의 판매저작물의 IP 구매를 위하여 구매자가 지불할 의향이 있는 금액을 결정하여 상기 구매요청 정보에 기재한 예상 가격 정보를 비교하여, 상호의 가격대가 일치하는 정도에 기반하여 결정될 수 있다. 본 발명의 일 실시예에 따르면, 상기 희망 가격 정보와 상기 예상 가격 정보는 각각 최소값과 최대값으로 구성 된 범위로 정의되며, 상기 가격 점수는, 상기 각각의 범위가 전부 또는 일부 겹치는 경우 가격이 상호 일치하는 것으로 판단하여 결정되고, 상기 각각의 범위가 겹치지 않는 경우 금액대가 낮은 쪽의 최대치와 금액대가 높은 쪽의 최소치 간의 차이를 기반으로 일치 정도를 판단하여 결정될 수 있다. 본 발명의 다른 실시예에 따르면, 상기 가격 점수는, 화폐단위에 의한 추천 가격 정보의 형태로 계산되는 것으 로, 상기 희망 가격 정보, 상기 예상 가격 정보, 상기 평균 거래 성사 가격에 기반하여 매칭계산부에 의해 계산되는 저작물 IP 거래 추천 가격일 수 있다. 본 발명의 또다른 실시예에 따르면, 상기 가격 점수는, 판매저작물의 판매자와 구매요청을 입력한 구매자 가 각각 기존에 성사시킨 어문 저작물 IP 거래 기록으로부터 유래한 평균 거래 성사 가격을 참조하여 상향 또는 하향 조정될 수 있다. 특히, 상기 가격 점수가 상술한 일 실시예와 같이 거래 추천 가격 정보인 경우, 거 래 추천 가격의 조정이 종래의 거래 기록을 참조하여 이루어질 수 있다. 상기 조정은 정보처리 알고리즘에 의해 이루어질 수 있으며, 바람직하게는, 상기 IP 거래 기록을 입력으로 받아 학습한 기계 학습 인공지능에 의해 수행될 수 있다. 상기 기술한 바와 같이 일치 점수, 인기 점수, 가격 점수가 결정되면, 매칭계산부는 상기 각각의 점수를 병합하여 최종적인 매칭 점수를 도출할 수 있다. 상기 매칭 점수는, 바람직하게는, 상기 일치 점수, 상기 인기 점수, 상기 가격 점수 각각에 소정의 가산치를 부여하여 가중 합산한 것으로, 상기 일치 점수에 제1 백분율 비 중을, 상기 인기 점수에 제2 백분율 비중을, 상기 가격 점수에 제3 백분율 비중을 각각 곱한 뒤 그 결과를 합산 한 것일 수 있다. 본 발명의 일 실시예에 따르면, 상기 제1 백분율 비중은 40%, 상기 제2 백분율 비중은 30%, 상기 제3 백분율 비 중은 30%로 정의될 수 있다. 본 발명의 다른 실시예에 따르면, 상기 제1, 제2, 제3 백분율 비중은 가변적으로 적용되는 것이고, 기존에 판매자와 구매자간 상사된 어문 저작물 IP 거래의 기록에 기반하여 조정될 수 있다. 상기 조정은 정보처리 알고리즘에 의해 이루어질 수 있으며, 바람직하게는, 상기 IP 거래 기록을 입력 으로 받아 학습한 기계 학습 인공지능에 의해 수행될 수 있다. 예를 들어, 종래의 IP 거래 기록으로부터 가격 면에서 다소간의 불일치가 있더라도 거래가 성사된 기록이 다수 학습된다면, 상기 인공지능은 가격 점수에 할당 되는 제3 백분율 비중을 하향 조정하는 것과 같이 동작할 수 있다. 본 발명에서 상기 조정의 방법은 상술한 실 시예로 제한되지 아니하며, 본 발명의 실시자가 본 발명의 취지에 부응하는 범위 내에서 다양하게 변경하여 실 시할 수 있다. 상기의 절차를 모두 완료하면, 거래중개정보가 생성된다. 상기 거래개정보는 상기 매칭부에서 계산된 매칭 점수를 포함하는 정보 집합으로, 바람직하게는, 상기 매칭 점수, 판매자의 프로파일, 구매자 의 프로파일, 판매저작물 정보, 구매요청 정보, 그리고 상기 실시예에 따라 계산된 추천 가격 정보를 포함할 수 있다. 상기 거래중개정보는, 본 발명의 다양한 실시예에 따르면, 하나의 판매저작물 정보에 대하여 하나의 구매요청 정보를 대응한 것일 수 있고, 하나의 판매저작물 정보에 대하여 복수의 구매요청 정보(22 5)를 대응한 것일 수 있고, 복수의 판매저작물 정보에 대하여 하나의 구매요청 정보를 대응한 것일 수 있고, 도 4에 도시한 예와 같이, 복수의 판매저작물 정보에 대하여 복수의 구매요청 정보를 대응 한 것일 수도 있다. 상기 복수의 대응 관계를 포함하는 거래중개정보의 생성을 위하여, 상기 판매저작권 정보 와 구매요청 정보를 각각 변환 및 비교하는 일체의 절차가 필요한 횟수만큼 반복적으로 수행된 뒤 그 결과가 하나의 정보로서 종합될 수 있다. 상기 거래중개정보는 전송부에 의하여 판매자 및 구매자 중 일방 또는 쌍방에게 전송될 수 있다. 이후 판매자와 구매자는 상기 거래중개정보에 나타난 매칭 점수 등의 정보에 기반하여 어 문 저작물 IP 거래 여부를 결정할 수 있으며, 이를 통하여 본 발명이 달성하고자 하는 어문 저작물의 자동화된 IP 거래라는 목적이 달성된다. 본 발명의 일 실시예에 따르면, 상기 시스템은 상기 거래중개정보를 수신한 판매자및 구매자 로 하여금 실제 어문 저작물 IP 거래의 성사 여부와 그 가격 조건과 관련된 정보를 IP 거래 기록으로서 시 스템에 입력하도록 요청할 수 있다. 입력된 IP 거래 기록은 상술한 일부 실시예에서 서술한 바와 같이 종 래의 거래 기록을 토대로 동작하는 일부 알고리즘에서 기준 자료로서 활용할 수 있다. 도 5는 본 발명의 실시예 상 시스템을 구현하기 위한 프로세서를 포함하는 컴퓨터 장치를 나타낸다. 도 5를 참 조하면, 컴퓨터 장치는 프로세서(Processor, 510), 메모리(Memory, 520) 및 통신부(Transceiver, 530)를 포함한다. 프로세서는 본 명세서에서 설명된 기능, 과정 및/또는 방법을 구현하도록 구성될 수 있다. 본 발명에서 기능부로서 설명된 각각의 기능들은 프로세서에서 구현될 수 있다. 메모리는 프로세서와 연결되어, 프로세서를 구동하기 위한 다양한 정보를 저장한다. 통신부 는 프로세서와 연결되어, 통신 네트워크로 통신 신호를 전송하거나, 통신 네트워크로부터 통신 신호를 수신한다. 프로세서은 ASIC(application-specific integrated circuit), 다른 칩셋, 논리 회로 및/또는 데이터 처리 장치를 포함할 수 있다. 메모리는 ROM(read-only memory), RAM(random access memory), 플래시 메모리, 메모리 카드, 저장 매체 및/또는 다른 저장 장치를 포함할 수 있다. 통신부는 외부로부터의 통신 신호를 통하여 소정의 정보를 수신하고, 외부로의 통신 신호를 통하여 소정의 신호를 발신 또는 수신하기 위한 TCP-IP 기반의 네트워크 접속 장치를 포함할 수 있다. 도 2에 나타난 것과 같은 본 발명의 실시예상 시스템이 도 5에 나타난 것과 같은 컴퓨터 장치로서 구 현될 때, 바람직하게는, 상기 통신부가 판매자 및 구매자의 접속을 수용하고, 판매저작물 정보 와 구매요청 정보를 수신하고, 그리고 거래중개정보를 상기 판매자 및 구매자 중 일방 또는 쌍 방에게 전송하는 기능을 수행하도록 하고, 상기 프로세서가 상기 판매저작물 정보와 상기 구매요청 정보를 입력으로 하여 상기 거래중개정보가 도출되기까지의 제 과정을 수행하도록 구성될 수 있다. 또한, 상기 메모리는 대용량 기억장치를 포함하고, 이를 활용하여 데이터베이스(260, 265)를 저장 및 운용 하도록 구성될 수 있다. 본 발명의 실시예가 소프트웨어로 구현될 때, 상술한 기법은 상술한 기능을 수행하는 모듈(과정, 기능 등)로 구 현될 수 있다. 모듈은 메모리에 저장되고, 프로세서에 의해 실행될 수 있다. 메모리는 프로세서 내부 또는 외부에 있을 수 있고, 잘 알려진 다양한 수단으로 프로세서와 연결될 수 있다. 이상 도면 및 실시예를 참조하여 설명하였지만, 본 발명의 보호범위가 상기 도면 또는 실시예에 의해 한정되는 것을 의미하지는 않으며 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2024-0140737", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 기본 개념을 요약한 개념도,"}
{"patent_id": "10-2024-0140737", "section": "도면", "subsection": "도면설명", "item": 2, "content": "도 2는 본 발명에 의한 어문 저작물의 요약정보화 과정과 이를 바탕으로 한 IP 거래 중개 방법을 나타낸 개념도,"}
{"patent_id": "10-2024-0140737", "section": "도면", "subsection": "도면설명", "item": 3, "content": "도 3은 제1 요약정보와 제2 요약정보의 항목 별 정보값 비교를 통해 스토리 평가 지수를 도출하는 과정에 대한 개념도, 도 4는 복수의 판매저작물 정보에 대하여 복수의 구매요청 정보를 대응한 거래중개정보의 예시도, 도 5는 본 발명의 실시예 상 시스템을 구현하기 위한 프로세서를 포함하는 컴퓨터 장치의 개념도, 도 6은 판매저작물 정보 및 구매요청 정보의 공통서식에 관한 일 실시예를 나타낸 개념도, 도 7은 일치하는 정도의 계산을 위한 자연어 처리 장치의 동작을 나타낸 개념도이다."}
