{"patent_id": "10-2023-0137745", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0024447", "출원번호": "10-2023-0137745", "발명의 명칭": "케이블의 타입에 기초하여 디스플레이의 정보를 업데이트하는 디스플레이 장치 및 그 제어 방", "출원인": "삼성전자주식회사", "발명자": "이정현"}}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디스플레이 장치에 있어서,통신 인터페이스;디스플레이; 및상기 통신 인터페이스 및 상기 디스플레이와 연결되어 상기 디스플레이 장치를 제어하는 하나 이상의 프로세서;를 포함하며,상기 프로세서는,상기 통신 인터페이스에 케이블이 연결되면, 상기 통신 인터페이스에 포함된 제1 핀에 인가된 전압에 기초하여상기 케이블이 지원하는 통신 규격을 식별하며,상기 케이블이 지원하는 통신 규격에 기초하여 상기 디스플레이에 대한 식별 정보를 설정하는, 디스플레이장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 식별 정보는,상기 디스플레이에 대한 EDID(extended display identification data) 및 DPCD(displayport configurationdata)를 포함하는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는,상기 식별된 전압이 0V이면 상기 케이블을 제1 통신 규격의 케이블로 식별하고,상기 식별된 전압이 0V를 초과하고 제1 전압 구간 내의 전압이면 상기 케이블을 제2 통신 규격의 케이블로 식별하고,상기 식별된 전압이 0V를 초과하고 상기 제1 전압 구간보다 큰 구간의 제2 전압 구간 내의 전압이면 상기 케이블을 제3 통신 규격의 케이블로 식별하는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는,상기 케이블이 지원하는 통신 규격에 따른 비트 전송률이 상기 프로세서의 비트 수신률보다 낮은 경우, 상기 케이블을 통해 영상 재생이 불가능하다는 메시지를 디스플레이하도록 상기 디스플레이를 제어하는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 프로세서는,상기 케이블이 지원하는 통신 규격 및 상기 디스플레이의 스펙에 기초하여 상기 EDID 및 상기 DPCD를 설정하는,공개특허 10-2025-0024447-3-디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 프로세서는,상기 통신 인터페이스에 포함된 제2 핀을 통해 상기 케이블의 상기 통신 인터페이스에 대한 연결 여부를 식별하고,상기 케이블이 상기 통신 인터페이스에 연결된 것으로 식별되면 상기 제1 핀에 인가된 전압을 식별하는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,메모리;를 더 포함하며,상기 프로세서는,상기 메모리에 저장된 EDID 및 DPCD를 각각 상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경하고,상기 EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하도록 상기 디스플레이를 제어하는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,메모리; 및사용자 인터페이스;를 더 포함하며,상기 프로세서는,상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD가 각각 상기 메모리에 저장된 EDID 및 DPCD와 상이하면, 상기 EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하도록 상기 디스플레이를 제어하고,상기 사용자 인터페이스를 통해 변경 명령이 수신되면 상기 메모리에 저장된 EDID 및 DPCD를 각각 상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경하는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,상기 프로세서는,상기 EDID 및 상기 DPCD를 설정한 후 상기 케이블을 통해 전자 장치가 연결된 것으로 식별되면, HPD(hot plugdetect) 신호를 상기 전자 장치로 전송하도록 상기 통신 인터페이스를 제어하는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서,상기 프로세서는,상기 통신 인터페이스에 상기 케이블이 연결되고 상기 케이블을 통해 전자 장치가 연결된 것으로 식별되면, 상기 제1 핀에 인가된 전압을 식별하고,상기 식별된 전압에 기초하여 상기 케이블이 지원하는 통신 규격을 식별하며,상기 케이블이 지원하는 통신 규격에 기초하여 상기 EDID 및 상기 DPCD를 설정한 후, HPD 신호를 상기 전자 장공개특허 10-2025-0024447-4-치로 전송하도록 상기 통신 인터페이스를 제어하는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 EDID 및 상기 DPCD는,상기 케이블의 연결에 기초하여 상기 통신 인터페이스를 통해 전자 장치로 제공되는, 디스플레이 장치."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "디스플레이 장치의 제어 방법에 있어서,상기 디스플레이 장치의 통신 인터페이스에 케이블이 연결되면, 상기 통신 인터페이스에 포함된 제1 핀에 인가된 전압에 기초하여 상기 케이블이 지원하는 통신 규격을 식별하는 단계; 및상기 케이블이 지원하는 통신 규격에 기초하여 상기 디스플레이 장치의 디스플레이에 대한 식별 정보를 설정하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 식별 정보는,상기 디스플레이에 대한 EDID(extended display identification data) 및 DPCD(displayport configurationdata)를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 식별하는 단계는,상기 식별된 전압이 0V이면 상기 케이블을 제1 통신 규격의 케이블로 식별하고,상기 식별된 전압이 0V를 초과하고 제1 전압 구간 내의 전압이면 상기 케이블을 제2 통신 규격의 케이블로 식별하고,상기 식별된 전압이 0V를 초과하고 상기 제1 전압 구간보다 큰 구간의 제2 전압 구간 내의 전압이면 상기 케이블을 제3 통신 규격의 케이블로 식별하는, 제어 방법."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 케이블이 지원하는 통신 규격에 따른 비트 전송률이 상기 디스플레이 장치의 비트 수신률보다 낮은 경우,상기 케이블을 통해 영상 재생이 불가능하다는 메시지를 디스플레이하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 설정하는 단계는,상기 케이블이 지원하는 통신 규격 및 상기 디스플레이의 스펙에 기초하여 상기 EDID 및 상기 DPCD를 설정하는,제어 방법."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서,상기 통신 인터페이스에 포함된 제2 핀을 통해 상기 케이블의 상기 통신 인터페이스에 대한 연결 여부를 식별하는 단계;를 더 포함하며,공개특허 10-2025-0024447-5-상기 식별하는 단계는,상기 케이블이 상기 통신 인터페이스에 연결된 것으로 식별되면 상기 제1 핀에 인가된 전압을 식별하는, 제어방법."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서,상기 설정하는 단계는,상기 디스플레이 장치에 저장된 EDID 및 DPCD를 각각 상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및DPCD로 변경하고,상기 제어 방법은,상기 EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서,상기 설정하는 단계는,상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD가 각각 상기 디스플레이 장치에 저장된 EDID 및DPCD와 상이하면, 상기 EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하고,변경 명령이 수신되면 상기 디스플레이 장치에 저장된 EDID 및 DPCD를 각각 상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경하는, 제어 방법."}
{"patent_id": "10-2023-0137745", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서,상기 EDID 및 상기 DPCD를 설정한 후 상기 케이블을 통해 전자 장치가 연결된 것으로 식별되면, HPD(hot plugdetect) 신호를 상기 전자 장치로 전송하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0137745", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "디스플레이 장치가 개시된다. 본 디스플레이 장치는 통신 인터페이스, 디스플레이 및 통신 인터페이스 및 디스플 레이와 연결되어 디스플레이 장치를 제어하는 하나 이상의 프로세서를 포함하며, 프로세서는 통신 인터페이스에 케이블이 연결되면, 통신 인터페이스에 포함된 제1 핀에 인가된 전압에 기초하여 케이블이 지원하는 통신 규격을 식별하며, 케이블이 지원하는 통신 규격에 기초하여 디스플레이에 대한 식별 정보를 설정할 수 있다."}
{"patent_id": "10-2023-0137745", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 디스플레이 장치 및 그 제어 방법에 대한 것으로, 더욱 상세하게는 케이블의 타입에 기초하여 디스플 레이의 정보를 업데이트하는 디스플레이 장치 및 그 제어 방법에 대한 것이다."}
{"patent_id": "10-2023-0137745", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디스플레이 장치에서 EDID(extended display identification data)와 DisplayPort를 지원하는 디스플레이 장치 에서의 DPCD(displayport configuration data)는 소스(source) 장치가 싱크(sink) 장치의 동작 사양을 식별하 고, 이에 대응되는 영상을 제공할 수 있게 하는 설계 사양이다. 즉, EDID와 DPCD는 디스플레이 장치의 필수 요 소이다. 싱크 장치는 EDID를 통해 지원하는 해상도, color depth, 색 공간 뿐만 아니라 VRR(variable refresh rate)과 같은 특수 기능 지원 여부를 나타낼 수 있다. 따라서, EDID가 변경된다는 것은 이상에서 언급한 싱크 장치의 여 러 특성이 변경됨을 의미할 수 있다. 또한, DPCD는 DisplayPort를 지원하는 싱크 장치의 특성을 나타내는 register로 DisplayPort 연결시 필수적으로 진행되는 link training을 통해 형성될 DisplayPort Main Link의 bit rate, lane 수를 결정하며 DisplayPort 특화 기능 지원 여부를 나타낼 수 있다. 즉, EDID와 DPCD는 싱크 장치의 특성을 나타내며 EDID와 DPCD가 변경된다는 것은 싱크 장치가 지원할 수 있는 기본적인 특성이 변경됨을 의미할 수 있다. 따라서, DisplayPort 버젼에 따라 EDID와 DPCD의 변경이 필요하다. 또한, 소스 장치는 싱크 장치의 capability 뿐만 아니라 케이블의 capability를 고려하여 싱크 장치로 영상을 제공할 수 있다. 케이블이 지원하는 인터페이스의 버젼에 따라 최대 지원 해상도가 달라지므로 케이블의capability에 따라 EDID와 DPCD의 변경이 필요하다. 종래에는 OSD(on screen display) 메뉴에서 DisplayPort 버젼(1.2/1.4)을 선택하여 EDID와 DPCD가 변경되었다. 즉, 케이블이 지원하는 인터페이스의 버젼에 따라 자동으로 EDID와 DPCD가 설정되는 것이 아니라, 사용자가 소 스 장치의 그래픽 카드나 게임 콘솔이 지원하는 DisplayPort 버젼 및 케이블의 DisplayPort 버젼을 파악하고, 그에 따라 OSD 메뉴의 DisplayPort 버젼을 선택해야 하는 불편이 있었다. 또한, 사용자가 케이블의 버젼을 모르는 경우나, 케이블의 버젼에 대응되는 OSD 메뉴 상의 DisplayPort 버젼을 설정하지 않는 경우, 화면이 표시되지 않을 수도 있다. 예를 들어, DisplayPort 1.2을 지원하는 소스 장치를 사 용하면서 OSD 메뉴의 DisplayPort 버젼을 1.4로 설정하면, DisplayPort 1.4의 EDID와 DPCD가 전달되면서 DisplayPort 1.4는 지원하지만 DisplayPort 1.2에서 지원하지 않는 해상도는 출력되지 않을 수 있다. 또한, DisplayPort 1.4의 EDID와 DPCD를 처리하지 못하는 호환성 문제가 발생하여 화면이 전혀 출력되지 않을 수도 있 다. 최근에는 DisplayPort 2.1의 도입으로 유저 시나리오가 더욱 복잡해졌다. 현재 대부분의 케이블은 DisplayPort 2.1을 지원하지 않으므로 소비자가 DisplayPort 2.1을 지원하는 싱크 장치를 사용할 때 잘못된 케이블을 사용할 가능성이 높다. 종래에는 케이블에 따라 자동으로 싱크 장치의 EDID와 DPCD가 변경되지 않으므로, 소스 장치, 싱크 장치 및 케 이블이 지원하는 DisplayPort 버젼이 하나라도 일치하지 않을 경우 호환성 문제가 발생할 가능성이 높다. 예를 들어, DisplayPort 2.1의 소스 장치와 DisplayPort 2.1의 싱크 장치를 DisplayPort 1.4의 케이블로 연결하는 경우, OSD 메뉴의 DisplayPort 버젼이 자동으로 2.1에서 1.4로 변경되지 않으므로, UHBR-10 이상 band width를 가지는 해상도의 영상은 소스 장치로부터 싱크 장치로 전달되지 않을 수 있다. 또한, 소스 장치, 싱크 장치 및 케이블의 DisplayPort 버젼이 일치하더라도, OSD 메뉴의 DisplayPort 버젼이 변경되지 않아 DisplayPort 버젼 이 1.4로 유지되는 경우, UHBR-10 이상 band width를 사용하여 출력 가능한 해상도의 영상을 소비자가 선택할 수 없는 문제가 발생할 수 있다."}
{"patent_id": "10-2023-0137745", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이상과 같은 목적을 달성하기 위한 본 개시의 일 실시 예에 따르면, 디스플레이 장치는 통신 인터페이스, 디스 플레이 및 상기 통신 인터페이스 및 상기 디스플레이와 연결되어 상기 디스플레이 장치를 제어하는 하나 이상의 프로세서를 포함하며, 상기 프로세서는 상기 통신 인터페이스에 케이블이 연결되면, 상기 통신 인터페이스에 포 함된 제1 핀에 인가된 전압에 기초하여 상기 케이블이 지원하는 통신 규격을 식별하며, 상기 케이블이 지원하는 통신 규격에 기초하여 상기 디스플레이에 대한 식별 정보를 설정할 수 있다. 그리고, 상기 식별 정보는 상기 디스플레이에 대한 EDID(extended display identification data) 및 DPCD(displayport configuration data)를 포함할 수 있다. 또한, 상기 프로세서는 상기 식별된 전압이 0V이면 상기 케이블을 제1 통신 규격의 케이블로 식별하고, 상기 식 별된 전압이 0V를 초과하고 제1 전압 구간 내의 전압이면 상기 케이블을 제2 통신 규격의 케이블로 식별하고, 상기 식별된 전압이 0V를 초과하고 상기 제1 전압 구간보다 큰 구간의 제2 전압 구간 내의 전압이면 상기 케이 블을 제3 통신 규격의 케이블로 식별할 수 있다. 그리고, 상기 프로세서는 상기 케이블이 지원하는 통신 규격에 따른 비트 전송률이 상기 프로세서의 비트 수신 률보다 낮은 경우, 상기 케이블을 통해 영상 재생이 불가능하다는 메시지를 디스플레이하도록 상기 디스플레이 를 제어할 수 있다. 또한, 상기 프로세서는 상기 케이블이 지원하는 통신 규격 및 상기 디스플레이의 스펙에 기초하여 상기 EDID 및 상기 DPCD를 설정할 수 있다. 그리고, 상기 프로세서는 상기 통신 인터페이스에 포함된 제2 핀을 통해 상기 케이블의 상기 통신 인터페이스에 대한 연결 여부를 식별하고, 상기 케이블이 상기 통신 인터페이스에 연결된 것으로 식별되면 상기 제1 핀에 인 가된 전압을 식별할 수 있다. 또한, 메모리를 더 포함하며, 상기 프로세서는 상기 메모리에 저장된 EDID 및 DPCD를 각각 상기 케이블이 지원 하는 통신 규격에 대응되는 EDID 및 DPCD로 변경하고, 상기 EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하도록 상기 디스플레이를 제어할 수 있다. 그리고, 메모리 및 사용자 인터페이스를 더 포함하며, 상기 프로세서는 상기 케이블이 지원하는 통신 규격에 대 응되는 EDID 및 DPCD가 각각 상기 메모리에 저장된 EDID 및 DPCD와 상이하면, 상기 EDID 및 DPCD의 변경을 안내 하는 메시지를 디스플레이하도록 상기 디스플레이를 제어하고, 상기 사용자 인터페이스를 통해 변경 명령이 수 신되면 상기 메모리에 저장된 EDID 및 DPCD를 각각 상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD 로 변경할 수 있다. 또한, 상기 프로세서는 상기 EDID 및 상기 DPCD를 설정한 후 상기 케이블을 통해 전자 장치가 연결된 것으로 식 별되면, HPD(hot plug detect) 신호를 상기 전자 장치로 전송하도록 상기 통신 인터페이스를 제어할 수 있다. 그리고, 상기 프로세서는 상기 통신 인터페이스에 상기 케이블이 연결되고 상기 케이블을 통해 전자 장치가 연 결된 것으로 식별되면, 상기 제1 핀에 인가된 전압을 식별하고, 상기 식별된 전압에 기초하여 상기 케이블이 지 원하는 통신 규격을 식별하며, 상기 케이블이 지원하는 통신 규격에 기초하여 상기 EDID 및 상기 DPCD를 설정한 후, HPD 신호를 상기 전자 장치로 전송하도록 상기 통신 인터페이스를 제어할 수 있다. 또한, 상기 EDID 및 상기 DPCD는 상기 케이블의 연결에 기초하여 상기 통신 인터페이스를 통해 전자 장치로 제 공될 수 있다. 한편, 본 개시의 일 실시 예에 따르면, 디스플레이 장치의 제어 방법은 상기 디스플레이 장치의 통신 인터페이 스에 케이블이 연결되면, 상기 통신 인터페이스에 포함된 제1 핀에 인가된 전압에 기초하여 상기 케이블이 지원 하는 통신 규격을 식별하는 단계 및 상기 케이블이 지원하는 통신 규격에 기초하여 상기 디스플레이 장치의 디 스플레이에 대한 식별 정보를 설정할 수 있다. 그리고, 상기 식별 정보는 상기 디스플레이에 대한 EDID(extended display identification data) 및 DPCD(displayport configuration data)를 포함할 수 있다. 또한, 상기 식별하는 단계는 상기 식별된 전압이 0V이면 상기 케이블을 제1 통신 규격의 케이블로 식별하고, 상 기 식별된 전압이 0V를 초과하고 제1 전압 구간 내의 전압이면 상기 케이블을 제2 통신 규격의 케이블로 식별하 고, 상기 식별된 전압이 0V를 초과하고 상기 제1 전압 구간보다 큰 구간의 제2 전압 구간 내의 전압이면 상기 케이블을 제3 통신 규격의 케이블로 식별할 수 있다. 그리고, 상기 케이블이 지원하는 통신 규격에 따른 비트 전송률이 상기 디스플레이 장치의 비트 수신률보다 낮 은 경우, 상기 케이블을 통해 영상 재생이 불가능하다는 메시지를 디스플레이하는 단계를 더 포함할 수 있다. 또한, 상기 설정하는 단계는 상기 케이블이 지원하는 통신 규격 및 상기 디스플레이의 스펙에 기초하여 상기 EDID 및 상기 DPCD를 설정할 수 있다. 그리고, 상기 통신 인터페이스에 포함된 제2 핀을 통해 상기 케이블의 상기 통신 인터페이스에 대한 연결 여부 를 식별하는 단계를 더 포함하며, 상기 식별하는 단계는 상기 케이블이 상기 통신 인터페이스에 연결된 것으로 식별되면 상기 제1 핀에 인가된 전압을 식별할 수 있다. 또한, 상기 설정하는 단계는 상기 디스플레이 장치에 저장된 EDID 및 DPCD를 각각 상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경하고, 상기 제어 방법은 상기 EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하는 단계를 더 포함할 수 있다. 그리고, 상기 설정하는 단계는 상기 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD가 각각 상기 디스플 레이 장치에 저장된 EDID 및 DPCD와 상이하면, 상기 EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하고, 변경 명령이 수신되면 상기 디스플레이 장치에 저장된 EDID 및 DPCD를 각각 상기 케이블이 지원하는 통신 규격 에 대응되는 EDID 및 DPCD로 변경할 수 있다. 또한, 상기 EDID 및 상기 DPCD를 설정한 후 상기 케이블을 통해 전자 장치가 연결된 것으로 식별되면, HPD(hot plug detect) 신호를 상기 전자 장치로 전송하는 단계를 더 포함할 수 있다. 그리고, 상기 식별하는 단계는 상기 통신 인터페이스에 상기 케이블이 연결되고 상기 케이블을 통해 전자 장치 가 연결된 것으로 식별되면, 상기 제1 핀에 인가된 전압을 식별하고, 상기 제어 방법은 상기 케이블이 지원하는 통신 규격에 기초하여 상기 EDID 및 상기 DPCD를 설정한 후, HPD 신호를 상기 전자 장치로 전송하는 단계를 더 포함할 수 있다.또한, 상기 EDID 및 상기 DPCD는 상기 케이블의 연결에 기초하여 상기 통신 인터페이스를 통해 전자 장치로 제 공될 수 있다."}
{"patent_id": "10-2023-0137745", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 목적은 케이블의 DisplayPort 버젼에 따라 EDID 및 DPCD를 자동으로 업데이트하는 디스플레이 장치 및 그 제어 방법을 제공함에 있다. 이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 명세서에서, 사용자라는 용어는 디스플레이 장치를 사용하는 사람 또는 디스플레이 장치를 사용하는 장치(예: 인공 지능 전자 장치)를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 다양한 실시 예를 보다 상세하게 설명한다. 도 1은 본 개시의 일 실시 예에 따른 디스플레이 장치의 구성을 나타내는 블럭도이다. 디스플레이 장치는 영상을 디스플레이하는 장치로, TV, 데스크탑 PC, 노트북, 스마트폰, 태블릿 PC 등과 같이 디스플레이를 구비한 장치이며, 싱크 장치로 지칭될 수 있다. 여기서, 디스플레이 장치는 소스 장치 로 지칭되는 전자 장치와 케이블로 연결되며, 전자 장치로부터 영상을 수신할 수 있다. 다만, 이에 한정되는 것 은 아니며, 디스플레이 장치는 영상을 디스플레이할 수 있는 장치라면 어떤 장치라도 무방하다. 도 1에 도시된 바와 같이, 디스플레이 장치는 통신 인터페이스, 디스플레이 및 프로세서를 포함할 수 있다. 통신 인터페이스는 다양한 유형의 통신 방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성이다. 예를 들어, 디스플레이 장치는 통신 인터페이스를 통해 서버 또는 전자 장치와 통신을 수 행할 수 있다. 통신 인터페이스는 와이파이 모듈, 블루투스 모듈, 적외선 통신 모듈 및 무선 통신 모듈 등을 포함할 수 있다. 여기서, 각 통신 모듈은 적어도 하나의 하드웨어 칩 형태로 구현될 수 있다. 와이파이 모듈, 블루투스 모듈은 각각 WiFi 방식, 블루투스 방식으로 통신을 수행한다. 와이파이 모듈이나 블루 투스 모듈을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 적외선 통신 모듈은 시 광선과 밀리미터파 사이에 있는 적외 선을 이용하여 근거리에 무선으로 데이터를 전송하는 적외선 통신(IrDA, infrared Data Association)기술에 따 라 통신을 수행한다. 무선 통신 모듈은 상술한 통신 방식 이외에 지그비(zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE-A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 통신을 수행하는 적어도 하나의 통신 칩을 포함할 수 있다. 또는, 통신 인터페이스는 HDMI, DisplayPort, 썬더볼트, USB, RGB, D-SUB, DVI 등과 같은 유선 통신 인터 페이스를 포함할 수 있다. 그 밖에 통신 인터페이스는 LAN(Local Area Network) 모듈, 이더넷 모듈, 또는 페어 케이블, 동축 케이블 또는 광섬유 케이블 등을 이용하여 통신을 수행하는 유선 통신 모듈 중 적어도 하나를 포함할 수도 있다. 디스플레이는 이미지를 디스플레이하는 구성으로, LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel) 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이 내에는 a-si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 한편, 디스플레이는 터 치 센서와 결합된 터치 스크린, 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등으로 구현될 수 있다. 프로세서는 영상을 디스플레이하도록 디스플레이를 제어할 수 있다. 프로세서는 디스플레이 장치의 동작을 전반적으로 제어한다. 구체적으로, 프로세서는 디스플레 이 장치의 각 구성과 연결되어 디스플레이 장치의 동작을 전반적으로 제어할 수 있다. 예를 들어, 프 로세서는 통신 인터페이스, 디스플레이, 메모리(미도시) 등과 같은 구성과 연결되어 디스플레이 장치의 동작을 제어할 수 있다. 하나 이상의 프로세서는 CPU, GPU(Graphics Processing Unit), APU(Accelerated Processing Unit), MIC(Many Integrated Core), NPU(Neural Processing Unit), 하드웨어 가속기 또는 머신 러닝 가속기 중 하나 이상을 포 함할 수 있다. 하나 이상의 프로세서는 디스플레이 장치의 다른 구성 요소 중 하나 또는 임의의 조합을 제 어할 수 있으며, 통신에 관한 동작 또는 데이터 처리를 수행할 수 있다. 하나 이상의 프로세서는 메모리에 저장 된 하나 이상의 프로그램 또는 명령어(instruction)을 실행할 수 있다. 예를 들어, 하나 이상의 프로세서는 메 모리에 저장된 하나 이상의 명령어를 실행함으로써, 본 개시의 일 실시 예에 따른 방법을 수행할 수 있다. 본 개시의 일 실시 예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 하나의 프로세서에 의해 수 행될 수도 있고, 복수의 프로세서에 의해 수행될 수도 있다. 예를 들어, 일 실시 예에 따른 방법에 의해 제1 동 작, 제2 동작, 제3 동작이 수행될 때, 제1 동작, 제2 동작 및 제3 동작 모두 제1 프로세서에 의해 수행될 수도 있고, 제1 동작 및 제2 동작은 제1 프로세서(예를 들어, 범용 프로세서)에 의해 수행되고 제3 동작은 제2 프로 세서(예를 들어, 인공지능 전용 프로세서)에 의해 수행될 수도 있다. 하나 이상의 프로세서는 하나의 코어를 포함하는 단일 코어 프로세서(single core processor)로 구현될 수도 있 고, 복수의 코어(예를 들어, 동종 멀티 코어 또는 이종 멀티 코어)를 포함하는 하나 이상의 멀티 코어 프로세서 (multicore processor)로 구현될 수도 있다. 하나 이상의 프로세서가 멀티 코어 프로세서로 구현되는 경우, 멀 티 코어 프로세서에 포함된 복수의 코어 각각은 캐시 메모리, 온 칩(On-chip) 메모리와 같은 프로세서 내부 메 모리를 포함할 수 있으며, 복수의 코어에 의해 공유되는 공통 캐시가 멀티 코어 프로세서에 포함될 수 있다. 또한, 멀티 코어 프로세서에 포함된 복수의 코어 각각(또는 복수의 코어 중 일부)은 독립적으로 본 개시의 일 실 시 예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있고, 복수의 코어 전체(또는 일 부)가 연계되어 본 개시의 일 실시 예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있 다. 본 개시의 일 실시 예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 멀티 코어 프로세서에 포함 된 복수의 코어 중 하나의 코어에 의해 수행될 수도 있고, 복수의 코어에 의해 수행될 수도 있다. 예를 들어, 일 실시 예에 따른 방법에 의해 제1 동작, 제2 동작 및 제3 동작이 수행될 때, 제1 동작, 제2 동작 및 제3 동작 모두 멀티 코어 프로세서에 포함된 제1 코어에 의해 수행될 수도 있고, 제1 동작 및 제2 동작은 멀티 코어 프로 세서에 포함된 제1 코어에 의해 수행되고 제3 동작은 멀티 코어 프로세서에 포함된 제2 코어에 의해 수행될 수 도 있다. 본 개시의 실시 예들에서, 하나 이상의 프로세서는 적어도 하나의 프로세서 및 기타 전자 부품들이 집적된 시스 템 온 칩(SoC), 단일 코어 프로세서, 멀티 코어 프로세서, 또는 단일 코어 프로세서 또는 멀티 코어 프로세서에 포함된 코어를 의미할 수 있으며, 여기서 코어는 CPU, GPU, APU, MIC, NPU, 하드웨어 가속기 또는 기계 학습 가 속기 등으로 구현될 수 있으나, 본 개시의 실시 예들이 이에 한정되는 것은 아니다. 다만, 이하에서는 설명의 편의를 위해, 프로세서라는 표현으로 디스플레이 장치의 동작을 설명한다. 프로세서는 통신 인터페이스에 케이블이 연결되면, 통신 인터페이스에 포함된 제1 핀에 인가된 전압에 기초하여 케이블이 지원하는 통신 규격을 식별할 수 있다. 여기서, 통신 규격은 전송 규격, 전송 표준, 전송 방법, 전송 속도, 전송 타입 등을 포함할 수 있다. 예를 들어, 프로세서는 식별된 전압이 0V이면 케이블을 제1 통신 규격의 케이블로 식별하고, 식별된 전압 이 0V를 초과하고 제1 전압 구간 내의 전압이면 케이블을 제2 통신 규격의 케이블로 식별하고, 식별된 전압이 0V를 초과하고 제1 전압 구간보다 큰 구간의 제2 전압 구간 내의 전압이면 케이블을 제3 통신 규격의 케이블로 식별할 수 있다. 여기서, 제1 통신 규격의 케이블은 DisplayPort 1.4를 지원하는 케이블 또는 그 이하의 규격을 지원하는 케이블이고, 제2 통신 규격의 케이블은 DisplayPort 2.1 UHBR-10을 지원하는 케이블이고, 제3 통신 규 격의 케이블은 DisplayPort 2.1 UHBR-20을 지원하는 케이블일 수 있다. DisplayPort 1.4를 지원하는 케이블 및 그 이하의 규격을 지원하는 케이블은 pin 13 및 14에 각각 대응되는 CONFIG1 핀 및 CONFIG2 핀 사이에 저항이 없고, DisplayPort 2.1 UHBR-10을 지원하는 케이블은 CONFIG1 핀 및 CONFIG2 핀 사이에 680kohm의 저항이 이용되고, DisplayPort 2.1 UHBR-20을 지원하는 케이블은 CONFIG1 핀 및 CONFIG2 핀 사이에 220kohm의 저항이 이용될 수 있다. 일 실시 예에 따라, 프로세서는 CONFIG2 핀의 전압 을 식별하고, 식별된 전압이 0V이면 케이블을 DisplayPort 1.4를 지원하는 케이블 또는 그 이하의 규격을 지원 하는 케이블로 식별하고, 식별된 전압이 0.33~0.50V이면 케이블을 DisplayPort 2.1 UHBR-10을 지원하는 케이블 로 식별하고, 식별된 전압이 0.86~1.20V이면 케이블을 DisplayPort 2.1 UHBR-20을 지원하는 케이블로 식별할 수 있다. 프로세서는 케이블이 지원하는 통신 규격에 기초하여 디스플레이에 대한 식별 정보를 설정할 수 있다. 여기서, 식별 정보는 EDID(extended display identification data) 또는 DPCD(displayport configuration data) 중 적어도 하나를 포함할 수 있다. 예를 들어, 프로세서는 케이블이 DisplayPort 2.1 UHBR-20을 지원하는 케이블로 식별되면, OSD 메뉴의 DisplayPort 버젼을 2.1로 변경하고, DisplayPort 2.1에 대응되는 EDID 및 DPCD를 설정할 수 있다. 여기서, EDID 및 DPCD는 케이블의 연결에 기초하여 통신 인터페이스를 통해 전자 장치로 제공될 수 있다. 전자 장 치는 케이블을 통해 디스플레이 장치와 연결된 장치일 수 있다. 디스플레이 장치는 메모리를 더 포함하며, 프로세서는 메모리에 저장된 EDID 및 DPCD를 각각 케이블 이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경하고, EDID 및 DPCD의 변경을 안내하는 메시지를 디스플 레이하도록 디스플레이를 제어할 수 있다. 즉, 프로세서는 케이블이 지원하는 통신 규격에 기초하여 EDID 및 DPCD를 자동으로 변경하고, 변경을 안내하는 메시지를 사용자에게 제공할 수 있다. 또는, 디스플레이 장치는 메모리 및 사용자 인터페이스를 더 포함하며, 프로세서는 케이블이 지원하 는 통신 규격에 대응되는 EDID 및 DPCD가 각각 메모리에 저장된 EDID 및 DPCD와 상이하면, EDID 및 DPCD의 변경 을 안내하는 메시지를 디스플레이하도록 디스플레이를 제어하고, 사용자 인터페이스를 통해 변경 명령이 수신되면 메모리에 저장된 EDID 및 DPCD를 각각 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경할 수도 있다. 즉, 프로세서는 케이블이 지원하는 통신 규격에 기초하여 EDID 및 DPCD를 자동으로 변경하 지 않고, 사용자의 확인 후에 EDID 및 DPCD를 변경할 수도 있다. 프로세서는 케이블이 지원하는 통신 규격 및 디스플레이의 스펙에 기초하여 EDID 및 DPCD를 설정할 수도 있다. 예를 들어, 프로세서는 케이블이 지원하는 통신 규격에 따라 케이블이 지원하는 해상도보다 디 스플레이가 지원하는 해상도가 낮은 경우, 디스플레이의 스펙에 기초하여 EDID 및 DPCD를 설정할 수 도 있다. 프로세서는 케이블이 지원하는 통신 규격에 따른 비트 전송률이 프로세서의 비트 수신률보다 낮은 경 우, 케이블을 통해 영상 재생이 불가능하다는 메시지를 디스플레이하도록 디스플레이를 제어할 수 있다. 예를 들어, 프로세서는 비트 수신률이 13.5인 경우, 13.5에 기초하여 EDID 및 DPCD를 설정하고, 케이블을 통해 디스플레이 장치와 연결된 전자 장치는 수신된 EDID 및 DPCD에 기초하여 13.5의 비트 전송률로 영상 을 제공할 수 있다. 다만, 케이블은 비트 전송률이 10이므로, 프로세서는 영상 수신이 지연됨에 따라 현재 의 케이블을 통해 영상 재생이 불가능하다는 메시지를 디스플레이하도록 디스플레이를 제어할 수 있다. 프로세서는 통신 인터페이스에 포함된 제2 핀을 통해 케이블의 통신 인터페이스에 대한 연결 여 부를 식별하고, 케이블이 통신 인터페이스에 연결된 것으로 식별되면 제1 핀에 인가된 전압을 식별할 수 있다. 즉, 프로세서는 케이블의 연결 여부를 먼저 식별하고, 케이블이 통신 인터페이스에 연결된 것으로 식별되면 케이블이 지원하는 통신 규격을 식별하기 위해 제1 핀에 인가된 전압을 식별할 수도 있다. 프로세서는 EDID 및 DPCD를 설정한 후 케이블을 통해 전자 장치가 연결된 것으로 식별되면, HPD(hot plug detect) 신호를 전자 장치로 전송하도록 통신 인터페이스를 제어할 수 있다. 즉, 케이블의 일측이 디스플 레이 장치에 먼저 연결된 후, 케이블의 타측이 전자 장치에 연결되면, EDID 및 DPCD가 이미 설정된 상태일 수 있으며, 별도의 추가 동작 없이 HPD 신호가 전자 장치로 전송될 수 있다. 또는, 프로세서는 통신 인터페이스에 케이블이 연결되고 케이블을 통해 전자 장치가 연결된 것으로 식별되면, 제1 핀에 인가된 전압을 식별하고, 식별된 전압에 기초하여 케이블이 지원하는 통신 규격을 식별하며, 케이블이 지원하는 통신 규격에 기초하여 EDID 및 DPCD를 설정한 후, HPD 신호를 전자 장치로 전송하 도록 통신 인터페이스를 제어할 수도 있다. 즉, 케이블의 일측이 전자 장치에 먼저 연결된 후, 케이블의 타측이 디스플레이 장치에 연결되면, EDID 및 DPCD가 설정되기 전에 HPD 신호가 전자 장치로 전송될 수도 있으나, 프로세서는 HPD 신호의 전송 시점을 EDID 및 DPCD를 설정한 후로 지연시킬 수 있다. 다만, 이에 한정되는 것은 아니며, HPD 신호의 전송 시점을 지연시키지 않고 재전송할 수도 있다. 예를 들어, 프로세서는 통신 인터페이스에 케이블이 연결되고 케이블을 통해 전자 장치가 연결된 것으로 식별되 면, HPD 신호를 전자 장치로 전송하도록 통신 인터페이스를 제어할 수 있다. 이후, 프로세서는 제1 핀에 인가된 전압을 식별하고, 식별된 전압에 기초하여 케이블이 지원하는 통신 규격을 식별하며, 케이블이 지 원하는 통신 규격에 기초하여 EDID 및 DPCD를 설정한 후, HPD 신호를 전자 장치로 재전송하도록 통신 인터페이 스를 제어할 수도 있다. 도 2는 본 개시의 일 실시 예에 따른 디스플레이 장치의 세부 구성을 나타내는 블럭도이다. 디스플레이 장 치는 통신 인터페이스, 디스플레이 및 프로세서를 포함할 수 있다. 또한, 도 2에 따르면, 디스플레이 장치는 메모리, 사용자 인터페이스, 마이크, 스피커, 카메라를 더 포함할 수도 있다. 도 2에 도시된 구성 요소들 중 도 1에 도시된 구성 요소와 중복되는 부분에 대해서는 자세한 설명을 생략하도록 한다. 메모리는 프로세서 등이 접근할 수 있도록 데이터 등의 정보를 전기 또는 자기 형태로 저장하는 하드 웨어를 지칭할 수 있다. 이를 위해, 메모리는 비휘발성 메모리, 휘발성 메모리, 플래시 메모리(Flash Memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD), RAM, ROM 등 중에서 적어도 하나의 하드웨어로 구현될 수 있다. 메모리에는 디스플레이 장치 또는 프로세서의 동작에 필요한 적어도 하나의 인스트럭션 (instruction)이 저장될 수 있다. 여기서, 인스트럭션은 디스플레이 장치 또는 프로세서의 동작을 지 시하는 부호 단위로서, 컴퓨터가 이해할 수 있는 언어인 기계어로 작성된 것일 수 있다. 또는, 메모리에는 디스플레이에 대한 EDID 및 DPCD가 저장될 수도 있다. 메모리에는 문자, 수, 영상 등을 나타낼 수 있는 비트 또는 바이트 단위의 정보인 데이터가 저장될 수 있 다. 예를 들어, 메모리에는 디스플레이 장치의 사용 이력, 디스플레이 장치의 조리 모드에 대한정보, 디스플레이 장치의 동작 방법에 대한 정보 등이 저장될 수 있다. 메모리는 프로세서에 의해 액세스되며, 프로세서에 의해 인스트럭션, 인스트럭션 집합체 또는 데이터에 대한 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 사용자 인터페이스는 버튼, 터치 패드, 마우스 및 키보드 등으로 구현되거나, 디스플레이 기능 및 조작 입 력 기능도 함께 수행 가능한 터치 스크린으로도 구현될 수 있다. 여기서, 버튼은 디스플레이 장치의 본체 외관의 전면부나 측면부, 배면부 등의 임의의 영역에 형성된 기계적 버튼, 터치 패드, 휠 등과 같은 다양한 유 형의 버튼이 될 수 있다. 마이크는 사운드를 입력받아 오디오 신호로 변환하기 위한 구성이다. 마이크는 프로세서와 전기 적으로 연결되며, 프로세서의 제어에 의해 사운드를 수신할 수 있다. 예를 들어, 마이크는 디스플레이 장치의 상측이나 전면 방향, 측면 방향 등에 일체화된 일체형으로 형성될 수 있다. 또는, 마이크는 디스플레이 장치와는 별도의 리모컨 등에 구비될 수도 있다. 이 경 우, 리모컨은 마이크를 통해 사운드를 수신하고, 수신된 사운드를 디스플레이 장치로 제공할 수도 있 다. 마이크는 아날로그 형태의 사운드를 수집하는 마이크, 수집된 사운드를 증폭하는 앰프 회로, 증폭된 사운 드를 샘플링하여 디지털 신호로 변환하는 A/D 변환회로, 변환된 디지털 신호로부터 노이즈 성분을 제거하는 필 터 회로 등과 같은 다양한 구성을 포함할 수 있다. 한편, 마이크는 사운드 센서의 형태로 구현될 수도 있으며, 사운드를 수집할 수 있는 구성이라면 어떠한 방식이라도 무방하다. 프로세서는 마이크를 통해 사용자 명령을 수신할 수도 있다. 스피커는 프로세서에서 처리된 각종 오디오 데이터 뿐만 아니라 각종 알림 음이나 음성 메시지 등을 출력하는 구성요소이다. 프로세서는 스피커를 통해 다양한 메시지를 사용자에게 제공할 수도 있다. 카메라는 렌즈, 셔터, 조리개, 고체 촬상 소자, AFE(Analog Front End), TG(Timing Generator)를 포함한 다. 셔터는 피사체에 반사된 빛이 카메라로 들어오는 시간을 조절하고, 조리개는 빛이 들어오는 개구부의 크기를 기계적으로 증가 또는 감소시켜 렌즈에 입사되는 광량을 조절한다. 고체 촬상 소자는 피사체에 반사된 빛이 광전하로 축적되면, 광전하에 의한 상을 전기 신호로 출력한다. TG는 고체 촬상 소자의 픽셀 데이터를 리 드아웃 하기 위한 타이밍 신호를 출력하며, AFE는 고체 촬상 소자로부터 출력되는 전기 신호를 샘플링하여 디지 털화한다. 이상과 같이, 디스플레이 장치는 케이블의 DisplayPort 버젼을 식별하고, DisplayPort 버젼에 기초하여 EDID 및 DPCD를 자동으로 업데이트할 수 있어, 사용자가 수동으로 EDID 및 DPCD를 변경해야 하는 불편을 해소할 수 있다. 이하에서는 도 3 내지 도 7을 통해 디스플레이 장치의 동작을 좀더 구체적으로 설명한다. 도 3 내지 도 7 에서는 설명의 편의를 위해 개별적인 실시 예에 대하여 설명한다. 다만, 도 3 내지 도 7의 개별적인 실시 예는 얼마든지 조합된 상태로 실시될 수도 있다. 도 3은 본 개시의 일 실시 예에 따른 케이블의 구조를 설명하기 위한 도면이다. 도 3에서는 설명의 편의를 위해, 영상을 제공하는 전자 장치를 소스(source) 장치로, 영상을 수신하는 디스플레이 장치를 싱크 (sink) 장치로 표시하였다. 디스플레이 장치 및 전자 장치는 케이블을 통해서 연결될 수 있다. 케이블은 DisplayPort 2.1 규격일 수 있으며, 지원하는 비트 레이트(bit rate)가 UHBR-10인 경우 680kohm의 저항을 포함하며, 지원하 는 비트 레이트(bit rate)가 UHBR-20인 경우 220kohm의 저항을 포함할 수 있다. 도 3에서는 설명의 편의를 위해 케이블이 저항을 포함하는 경우만을 도시하였으나, 이에 한정되는 것은 아 니다. 예를 들어, 케이블이 DisplayPort 1.4 규격 또는 그 이하의 규격인 경우, DisplayPort 2.1 규격에 서 680kohm의 저항 또는 220kohm의 저항에 대응되는 위치에 저항을 포함하지 않고 단락된 상태일 수 있다. 케이블이 연결되면 CONFIG1 핀이 케이블의 19번 핀인 DP_PWR 핀에 연결되어 CONFIG1 핀 및 CONFIG2 핀 사이에 전압이 인가될 수 있다. 프로세서는 GPIO(general purpose input/output) 핀을 이용하여 CONFIG2 핀의 전압을 식별할 수 있다. 프로세서는 식별된 전압이 0V이면 케이블을 DisplayPort 1.4를 지원하는 케이블로 식별하고, OSD 메뉴의 DisplayPort 버젼을 1.4로 변경하고 DisplayPort 버젼 1.4에 기초하여 EDID 및 DPCD를 설정할 수 있다. 또는, 프로세서는 식별된 전압이 0.33~0.50V 또는 0.86~1.20V이면 케이블을 DisplayPort 2.1을 지원하는 케이블로 식별하고, OSD 메뉴의 DisplayPort 버젼을 2.1로 변경하고 DisplayPort 버젼 2.1에 기초하여 EDID 및 DPCD를 설정할 수 있다. 도 4는 본 개시의 일 실시 예에 따른 EDID 및 DPCD의 전달 과정을 설명하기 위한 도면이다. 도 4에서는 소스 장치인 전자 장치 및 싱크 장치인 디스플레이 장치의 케이블을 통한 상호 작용을 레이어 단위로 나타내었다. 소스 장치 링크 레이어(link layer) 및 싱크 장치 링크 레이어 각각은 장치 간 신호를 전달 하는 물리 계층을 이용하여 네트워크 상의 주변 장치들 간 데이터를 전송하는 레이어로, 주소 할당, 오류 감지 등이 이루어질 수 있다. 소스 장치 PHY 레이어(physical layer) 및 싱크 장치 PHY 레이어 각각은 전송 데이터를 물리적인 전송 신호로 변환하고 인코딩/디코딩하는 레이어일 수 있다. EDID 및 DPCD는 각 레이어를 통해 전송될 수 있다. 디스플레이 장치가 케이블에 연결되면, HPD 신호가 전자 장치의 TX Link Policy Maker로 제공될 수 있다 (S410). TX Link Policy Maker는 전자 장치의 Source Stream Policy Maker로 Hot Plug Notice를 제공하고 (S420), Source Stream Policy Maker는 DisplayID or Legacy EDID Read 신호를 디스플레이 장치의 Sink Stream Policy Maker로 제공하여(S430), Sink Stream Policy Maker로부터 DisplayID or Legacy EDID를 수신할 수 있다. 이 과정이 이루어지기까지 디스플레이 장치의 프로세서는 케이블이 지원하는 통신 규격에 기초하여 EDID 및 DPCD를 설정해둔 상태일 수 있다. 다만, 이에 한정되는 것은 아니며, 프로세서는 케이블이 지원하는 통신 규격에 기초하여 EDID 및 DPCD를 설정한 후, HPD 신호를 전자 장치로 제공할 수도 있다. 또는, 프로세서는 HPD 신호를 전자 장치로 제공하 고, 케이블이 지원하는 통신 규격에 기초하여 EDID 및 DPCD를 설정한 후, 다시 HPD 신호를 전자 장치로 제공할 수도 있다. Source Stream Policy Maker는 Link Inquiry(Stream Ready)를 TX Link Policy Maker로 제공하고(S440), TX Link Policy Maker는 DPCD Read 신호를 디스플레이 장치의 RX Link Policy Maker로 제공하여(S450), RX Link Policy Maker로부터 DPCD를 수신할 수 있다. 이상과 같은 과정을 거쳐, 디스플레이 장치의 EDID 및 DPCD가 전자 장치로 제공될 수 있다. 도 5는 본 개시의 일 실시 예에 따른 DisplayPort 버젼을 나타내는 도면이다. 프로세서는 통신 인터페이스에 케이블이 연결되면, 통신 인터페이스에 포함된 제1 핀에 인가된 전압을 식별하고, 식별된 전압에 기초하여 케이블이 지원하는 통신 규격을 식별하며, 케이블이 지원하는 통신 규격에 기초하여 디스플레이에 대한 EDID 및 DPCD를 설정하고, EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하도록 디스플레이를 제어할 수 있다. 예를 들어, 프로세서는 도 5에 도시된 바와 같이, 통신 인터페이스에 케이블이 연결되면, 통신 인터 페이스에 포함된 제1 핀에 인가된 전압을 식별하고, 식별된 전압에 기초하여 케이블이 지원하는 통신 규격 이 DisplayPort 2.1의 규격으로 식별하며, DisplayPort 2.1에 기초하여 디스플레이에 대한 EDID 및 DPCD 를 설정하고, EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하도록 디스플레이를 제어할 수 있다. 다만, 이에 한정되는 것은 아니며, 프로세서는 도 5와 같은 화면으로 OSD 메뉴를 제공하여 사용자에게 DisplayPort 버젼을 수동으로 변경할 수 있는 옵션을 제공할 수도 있다. 도 6은 본 개시의 일 실시 예에 따른 케이블이 지원하는 통신 규격이 낮은 경우를 설명하기 위한 도면이다. 프로세서는 케이블이 지원하는 통신 규격에 따른 비트 전송률이 프로세서의 비트 수신률보다 낮은 경 우, 케이블을 통해 영상 재생이 불가능하다는 메시지를 디스플레이하도록 디스플레이를 제어할 수 있다. 예를 들어, 프로세서는 케이블이 지원하는 통신 규격이 DisplayPort 2.1의 규격으로 식별되면, DisplayPort 2.1의 규격에 기초하여 EDID 및 DPCD를 설정할 수 있다. 여기서, EDID 및 DPCD에는 케이블의 비트전송률이 포함되지 않고, 디스플레이 장치의 비트 수신률 13.5가 포함될 수 있다. 이 경우, 전자 장치는 디스플레이 장치의 비트 수신률에 기초하여 영상을 디스플레이 장치로 제공할 수 있다. 케이블이 DisplayPort 2.1 UHBR-20을 지원하는 경우라면 문제가 발생하지 않으나, 케이블이 DisplayPort 2.1 UHBR-10을 지원하는 경우라면 13.5보다 낮으므로 영상이 제대로 전송되지 않을 수 있다. 프로세서는 영상 전송이 지연됨을 식별하고, 도 6에 도시된 바와 같이, \"현재의 케이블을 통해 영상 재생 이 불가능합니다\"와 같은 메시지를 제공할 수 있다. 도 7은 본 개시의 일 실시 예에 따른 케이블이 지원하는 통신 규격에 따른 EDID 및 DPCD의 변경을 안내하는 도 면이다. 프로세서는 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD가 각각 메모리에 저장된 EDID 및 DPCD와 상이하면, EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하도록 디스플레이를 제어할 수 있 다. 예를 들어, 프로세서는 도 7에 도시된 바와 같이, 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD 가 각각 메모리에 저장된 EDID 및 DPCD와 상이하면, \"EDID 및 DPCD를 변경하시겠습니까?\"와 같은 메시지 를 디스플레이하도록 디스플레이를 제어할 수 있다. 프로세서는 사용자 인터페이스를 통해 변경 명령이 수신되면 메모리에 저장된 EDID 및 DPCD를 각각 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경할 수 있다. 즉, 프로세서는 케이블이 지원하는 통신 규격에 기초하여 EDID 및 DPCD를 설정할 수도 있으나, 사용자에게 EDID 및 DPCD의 변경 여부를 문의할 수도 있다. 프로세서는 마이크를 통해 획득된 사운드 또는 카메라를 통해 획득된 촬영 이미지 중 적어도 하 나에 기초하여 사용자가 식별되면, 사용자에게 EDID 및 DPCD의 변경 여부를 문의할 수 있다. 즉, 프로세서(13 0)는 사용자의 존재가 식별되면 사용자에게 EDID 및 DPCD의 변경 여부를 문의하고, 사용자의 존재가 식별되지 않으면 EDID 및 DPCD를 자동으로 변경할 수도 있다. 도 8은 본 개시의 일 실시 예에 따른 디스플레이 장치의 제어 방법을 설명하기 위한 흐름도이다. 먼저, 디스플레이 장치의 통신 인터페이스에 케이블이 연결되면, 통신 인터페이스에 포함된 제1 핀에 인가된 전 압에 기초하여 케이블이 지원하는 통신 규격을 식별한다(S810). 그리고, 케이블이 지원하는 통신 규격에 기초하 여 디스플레이 장치의 디스플레이에 대한 식별 정보를 설정할 수 있다(S820). 그리고, 식별 정보는 EDID(extended display identification data) 및 DPCD(displayport configuration dat a)를 포함할 수 있다. 또한, 식별하는 단계(S810)는 식별된 전압이 0V이면 케이블을 제1 통신 규격의 케이블로 식별하고, 식별된 전압 이 0V를 초과하고 제1 전압 구간 내의 전압이면 케이블을 제2 통신 규격의 케이블로 식별하고, 식별된 전압이 0V를 초과하고 제1 전압 구간보다 큰 구간의 제2 전압 구간 내의 전압이면 케이블을 제3 통신 규격의 케이블로 식별할 수 있다. 그리고, 케이블이 지원하는 통신 규격에 따른 비트 전송률이 디스플레이 장치의 비트 수신률보다 낮은 경우, 케 이블을 통해 영상 재생이 불가능하다는 메시지를 디스플레이하는 단계를 더 포함할 수 있다. 또한, 설정하는 단계(S820)는 케이블이 지원하는 통신 규격 및 디스플레이의 스펙에 기초하여 EDID 및 DPCD를 설정할 수 있다. 그리고, 통신 인터페이스에 포함된 제2 핀을 통해 케이블의 통신 인터페이스에 대한 연결 여부를 식별하는 단계 를 더 포함하며, 식별하는 단계(S810)는 케이블이 통신 인터페이스에 연결된 것으로 식별되면 제1 핀에 인가된 전압을 식별할 수 있다. 또한, 설정하는 단계(S820)는 디스플레이 장치에 저장된 EDID 및 DPCD를 각각 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경하고, 제어 방법은 EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하는 단 계를 더 포함할 수 있다. 그리고, 설정하는 단계(S820)는 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD가 각각 디스플레이 장치 에 저장된 EDID 및 DPCD와 상이하면, EDID 및 DPCD의 변경을 안내하는 메시지를 디스플레이하고, 변경 명령이수신되면 디스플레이 장치에 저장된 EDID 및 DPCD를 각각 케이블이 지원하는 통신 규격에 대응되는 EDID 및 DPCD로 변경할 수 있다. 또한, EDID 및 DPCD를 설정한 후 케이블을 통해 전자 장치가 연결된 것으로 식별되면, HPD(hot plug detect) 신 호를 전자 장치로 전송하는 단계를 더 포함할 수 있다. 그리고, 식별하는 단계(S810)는 통신 인터페이스에 케이블이 연결되고 케이블을 통해 전자 장치가 연결된 것으 로 식별되면, 제1 핀에 인가된 전압을 식별하고, 제어 방법은 케이블이 지원하는 통신 규격에 기초하여 EDID 및 DPCD를 설정한 후, HPD 신호를 전자 장치로 전송하는 단계를 더 포함할 수 있다. 또한, EDID 및 DPCD는 케이블의 연결에 기초하여 통신 인터페이스를 통해 전자 장치로 제공될 수 있다. 이상과 같은 본 개시의 다양한 실시 예에 따르면, 디스플레이 장치는 케이블의 DisplayPort 버젼을 식별하고, DisplayPort 버젼에 기초하여 EDID 및 DPCD를 자동으로 업데이트할 수 있어, 사용자가 수동으로 EDID 및 DPCD를 변경해야 하는 불편을 해소할 수 있다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media)에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실 시 예들에 따른 전자 장치(예: 전자 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세 서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저 장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신 호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시 적으로 저장됨을 구분하지 않는다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어 (hardware) 또는 이들의 조합을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 일부 경우에 있어 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있 다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨 어로서 구현될 수도 있다. 소프트웨어 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 한편, 상술한 다양한 실시 예들에 따른 기기의 프로세싱 동작을 수행하기 위한 컴퓨터 명령어(computer instructions)는 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium)에 저장될 수 있 다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어는 특정 기기의 프로세서에 의해 실행되었 을 때 상술한 다양한 실시 예에 따른 기기에서의 처리 동작을 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반영구 적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작 들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생 략되거나, 또는 다른 동작이 추가될 수 있다."}
{"patent_id": "10-2023-0137745", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에 한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2023-0137745", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 디스플레이 장치의 구성을 나타내는 블럭도이다. 도 2는 본 개시의 일 실시 예에 따른 디스플레이 장치의 세부 구성을 나타내는 블럭도이다. 도 3은 본 개시의 일 실시 예에 따른 케이블의 구조를 설명하기 위한 도면이다. 도 4는 본 개시의 일 실시 예에 따른 EDID 및 DPCD의 전달 과정을 설명하기 위한 도면이다. 도 5는 본 개시의 일 실시 예에 따른 DisplayPort 버젼을 나타내는 도면이다. 도 6은 본 개시의 일 실시 예에 따른 케이블이 지원하는 통신 규격이 낮은 경우를 설명하기 위한 도면이다. 도 7은 본 개시의 일 실시 예에 따른 케이블이 지원하는 통신 규격에 따른 EDID 및 DPCD의 변경을 안내하는 도 면이다. 도 8은 본 개시의 일 실시 예에 따른 디스플레이 장치의 제어 방법을 설명하기 위한 흐름도이다."}
