{"patent_id": "10-2017-0181156", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0079157", "출원번호": "10-2017-0181156", "발명의 명칭": "온라인 기반의 건강 관리 방법 및 장치", "출원인": "임민혁", "발명자": "임민혁"}}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디바이스에서 수행되는 온라인을 기반으로한 건강 관리 방법에 있어서,사용자의 개인 정보를 수집하는 단계;상기 사용자의 인구학적 정보 또는 질환 정보를 수집하는 단계;온라인을 통하여 하나 이상의 건강 질문들을 디바이스로 제공하는 단계로서, 상기 하나 이상의 건강 질문들은하나 이상의 일상 생활 방식 질문들 또는 하나 이상의 임상 질문들을 포함하는, 상기 하나 이상의 건강 질문들을 제공하는 단계;상기 건강 질문들에 대한 하나 이상의 건강 답변들을 수집하는 단계로서, 상기 하나 이상의 건강 답변들은 상기하나 이상의 일상 생활 방식 질문들에 대한 하나 이상의 일상 생활 방식 답변들 또는 상기 하나 이상의 임상 질문들에 대한 하나 이상의 임상 답변들을 포함하는, 상기 하나 이상의 건강 답변들을 수집하는 단계;상기 하나 이상의 건강 질문들 및 상기 하나 이상의 건강 답변들에 기초하여 건강 특징 벡터를 도출하는 단계로서, 상기 건강 특징 벡터는 상기 하나 이상의 일상 생활 방식 질문들 및 상기 하나 이상의 일상 생활 방식 답변들에 기초하여 도출된 일상 생활 방식 특징 벡터, 및 상기 하나 이상의 임상 질문들 및 상기 하나 이상의 임상답변들에 기초하여 도출된 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 도출하는 단계;도출된 상기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 이용하여 의심 질병 정보 또는 위험 요인 정보를 포함하는 건강 평가 정보를 생성하는 단계;생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계; 및특정인의 액세스를 허가하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 사용자의 개인 정보를 수집하는 단계는, 온라인 상에 상기 사용자의 개인 정보를 기초로 사용자 계정을 생성하거나 또는 온라인을 통하여 사용자 계정제공자로부터 상기 사용자의 개인 정보와 관련된 사용자 계정을 제공받는 단계를 포함하고, 상기 인구학적 정보, 상기 질환 정보, 상기 하나 이상의 건강 질문들, 상기 하나 이상의 건강 답변들, 상기 건강 특징 벡터, 및 상기 건강 평가 정보 중 하나 이상은 상기 사용자 계정과 관련된 사용자 데이터에 저장된, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 인구학적 정보 또는 질환 정보를 수집하는 단계는, 상기 디바이스로부터 인구학적 정보 또는 질환 정보를 입력받는 단계; 또는상기 사용자 데이터에 상기 인구학적 정보 또는 질환 정보가 저장된 경우에, 상기 사용자 데이터로부터 상기 인구학적 정보 또는 질환 정보를 제공받는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 인구학적 정보 또는 질환 정보를 입력받는 단계는, 온라인을 통하여 하나 이상의 인구학적 질문들 또는 질공개특허 10-2019-0079157-3-환 질문들을 디바이스로 제공하고,상기 제공된 상기 하나 이상의 인구학적 질문들 또는 질환 질문들에 대한 하나 이상의 인구학적 답변들 또는 질환 답변들을 수집하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 인구학적 정보 또는 질환 정보를 수집하는 단계는, 가족력에 관한 정보, 과거력에 관한 정보, 사회력에 관한 정보, 행동 방식에 대한 정보, 인체에 대한 정보, 및기분에 대한 정보 중 하나 이상을 수집하는 단계를 더 포함하고, 상기 가족력에 관한 정보는 가족들의 과거 질환 이력을 포함하고, 상기 과거력에 관한 정보는 과거 질환 이력, 약제 복용 이력, 수술 이력, 및 치료 이력 중 하나 이상을 포함하고, 상기 사회력에 관한 정보는 흡연 이력, 흡연 패턴, 음주 이력, 및 음주 패턴 중 하나 이상을 포함하고,상기 행동 방식에 대한 정보는 직업 활동 수행 패턴, 운동 수행 패턴, 컴퓨터 사용 패턴, 가사 노동 수행 패턴,여가 활동 수행 패턴, 및 수면 패턴 중 하나 이상을 포함하고, 상기 인체에 대한 정보는 나이, 성별, 체중, 키, 월경, 임신 이력, 손상 이력, 신체 계측치, 활력 징후 정보 패턴, 혈액 검사 수치, 및 영상 검사 중 하나 이상을 포함하고, 상기 기분에 대한 정보는 우울감을 느끼는 빈도 및 정도, 외로움을 느끼는 빈도 및 정도, 슬픔을 느끼는 빈도및 정도, 스트레스를 느끼는 빈도 및 정도, 및 일상 생활을 영위하는 데에 방해가 되는 생각을 하는 빈도 및 정도 중 하나 이상을 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2 항에 있어서, 상기 하나 이상의 건강 질문들을 제공하는 단계는, 상기 사용자 데이터에 기초하여 사용자 맞춤형 건강 질문들을 제공하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 상기 사용자 맞춤형 건강 질문들을 제공하는 단계는,상기 사용자 데이터에 기초하여, 스크리닝 형태의 포괄적인 질문들을 제공하는 단계; 및상기 포괄적인 질문들에 대한 사용자의 답변들이 사용자 데이터에 저장된 이후에, 상기 사용자 데이터를 머신러닝 또는 인공지능에 의해 분석하고, 상기 분석 결과를 반영하여 세부적인 질문들을 제공하는 단계를 포함하는,온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 2 항에 있어서,상기 특정인의 액세스를 허가하는 단계는,한명 이상의 특정인들이 상기 사용자 데이터를 열람하는 것을 허가하는 단계; 또는한명 이상의 특정인들이 상기 사용자 데이터 중 일부를 정정하는 것을 허가하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,공개특허 10-2019-0079157-4-상기 특정인이 상기 사용자 데이터를 열람하는 것을 허가하는 단계는, 사용자가 특정인이 열람할 수 있는 데이터 수준을, 특정인에 따라 조절할 수 있는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 2 항에 있어서,상기 특정인의 액세스를 허가하는 단계는,친구 맺기 단계를 포함하고, 상기 친구 맺기 단계는, 사용자가 특정인을 친구로 초대하는 경우에, 상기 초대된 특정인이 상기 사용자의 사용자 데이터를 열람할 수 있는 권한을 갖는 단계인, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서, 상기 건강 평가 정보는,상기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡터를 포함하는 상기 건강 특징 벡터로부터 도출된 의심 질병의 진단명을 포함하며, 상기 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계는 상기 의심 질병의 진단명을 사용자에게 제공하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서, 상기 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계는,상기 건강 평가 정보를 시각화 또는 도표화시켜 사용자에게 제공하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서, 상기 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계는,상기 건강 평가 정보에 기초하여 치료 정보를 도출하는 단계; 및도출된 상기 치료 정보를 사용자에게 제공하는 단계를 포함하고, 상기 치료 정보는 치료를 위한 정보 또는 증상 개선을 위한 정보를 포함하는, 온라인을 기반으로한 건강 관리방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서, 상기 일상 생활 방식 질문들은 직업 활동, 학습 활동, 가사 활동, 운동, 여가 활동, 컴퓨터 사용, 식이 섭취,수면, 및 활동시 기분 중 하나 이상에 대한 패턴 또는 주변 환경 요인에 대한 질문을 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서,상기 임상 질문들은 증상의 시간적 정보, 증상의 심한 정도, 증상의 특징, 증상의 위치, 증상의 악화 요인, 증상의 완화 요인, 증상의 만성 상태, 증상과 관계된 사건, 식이 상태, 수면 양상, 활력 징후 정보, 체지방 검사수치, 혈액 검사 수치, 유전자 검사 수치, 영상검사 결과, 복통, 소화불량, 토혈, 혈변, 구토, 변비, 설사, 황달, 가슴통증, 실신, 두근거림, 고혈압, 이상지질혈증, 기침, 콧물, 코막힘, 객혈, 호흡곤란, 다뇨, 핍뇨, 붉은공개특허 10-2019-0079157-5-색 소변, 배뇨이상, 소변찔금증, 발열, 멍, 피로, 체중 증가, 체중 감소, 관절통증, 목통증, 피부통증, 발진,기분변화, 불안, 수면장애, 기억력저하, 어지러움, 두통, 경련, 근력 약화, 감각이상, 의식장애, 떨림증, 유방통, 유방멍울, 질분비물, 월경이상, 산전 진찰, 임신, 성장 지연, 발달지연, 예방접종, 고혈당, 약물 오용, 및약물 남용 중 하나 이상에 대한 질문을 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 1 항에 있어서, 상기 의심 질병 정보는 의심 질병의 진단명의 목록, 의심 질병의 확률, 및 의심 질병의 중증도를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1 항에 있어서, 상기 위험 요인 정보는, 상기 일상 생활 방식 특징 벡터로부터 도출된 일상 생활 위험 요인 정보 또는 상기 임상 특징 벡터로부터 도출된 임상 위험 요인 정보를 포함하며, 상기 일상 생활 위험 요인 정보는, 직업 활동, 학습 활동, 가사 활동, 운동, 여가 활동, 컴퓨터 사용, 식이 섭취, 수면, 및 활동시 기분 중 하나 이상에 대한 정보를 포함하고, 상기 임상 위험 요인은, 증상의 시간적 정보, 증상의 심한 정도, 증상의 특징, 증상의 위치, 증상의 악화 요인,증상의 완화 요인, 증상의 만성 상태, 증상과 관계된 사건, 식이 상태, 수면 양상, 활력 징후 정보, 체지방 검사 수치, 혈액 검사 수치, 유전자 검사 수치, 및 영상 검사 중 하나 이상에 대한 정보를 포함하는,온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 1 항에 있어서, 상기 개인 정보는 이름, 아이디, 이메일주소, SNS 계정, 휴대폰 번호, 및 비밀번호 중 하나 이상을 포함하는,온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1 항에 있어서, 상기 인구학적 정보는 주민등록번호, 나이, 주소, 및 성별 중 하나 이상을 포함하는, 온라인을 기반으로한 건강관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "디바이스에 의해 사용자의 건강 정보를 모니터링하는 방법에 있어서, 특정한 주기를 포함하고, 상기 특정한 주기에 따라 제 1 항에 기재된 온라인을 기반으로한 건강 관리 방법을 실행하는, 주기적 건강 관리 방법 실행 단계; 또는 디바이스 조작에 의해 제 1 항에 기재된 온라인을 기반으로한 건강 관리 방법을 실행하는, 수시 건강 관리 방법실행 단계를 포함하고, 상기 주기적 건강 관리 방법 실행 단계 또는 상기 수시 건강 관리 방법 실행 단계에서, 특정인의 액세스가 허가된 경우에, 상기 특정인의 요청에 의해 제 1 항에 기재된 온라인을 기반으로한 건강 관리 방법을 실행하는 3 자건강 관리 방법 실행 단계를 포함하는, 사용자의 건강 정보를 모니터링하는 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "온라인을 기반으로한 건강 관리 장치에 있어서,사용자의 개인 정보를 수집하는 개인 정보 수집부;상기 사용자의 인구학적 정보 또는 질환 정보를 수집하는 인구학적 정보 또는 질환 정보 수집부;공개특허 10-2019-0079157-6-온라인을 통하여 디바이스로 하나 이상의 건강 질문들을 디바이스로 제공하는 건강 질문 제공부로서, 상기 하나이상의 건강 질문들은 하나 이상의 일상 생활 방식 질문들 또는 하나 이상의 임상 질문들을 포함하는, 상기 건강 질문 제공부;상기 건강 질문들에 대한 하나 이상의 건강 답변들을 수집하는 건강 답변 수집부로서, 상기 하나 이상의 건강답변들은 상기 하나 이상의 일상 생활 방식 질문들에 대한 하나 이상의 일상 생활 방식 답변들 또는 상기 하나이상의 임상 질문들에 대한 하나 이상의 임상 답변들을 포함하는, 상기 건강 답변 수집부;상기 하나 이상의 건강 질문들 및 상기 하나 이상의 건강 답변들에 기초하여 건강 특징 벡터를 도출하는 건강특징 벡터 도출부로서, 상기 건강 특징 벡터는 상기 하나 이상의 일상 생활 방식 질문들 및 상기 하나 이상의일상 생활 방식 답변들에 기초하여 도출된 일상 생활 방식 특징 벡터, 및 상기 하나 이상의 임상 질문들 및 상기 하나 이상의 임상 답변들에 기초하여 도출된 임상 특징 벡터를 포함하는 상기 건강 특징 벡터 도출부;도출된 상기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 이용하여 의심 질병 정보 또는 위험 요인 정보를 포함하는 건강 평가 정보를 생성하는 건강 평가 정보 생성부;생성된 상기 건강 평가 정보를 사용자에게 제공하는 건강 평가 제공부; 및특정인의 액세스를 허가하는 특정인의 액세스 허가부를 포함하는, 온라인을 기반으로한 건강 관리 장치."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 21 항에 있어서, 상기 개인 정보 수집부는, 온라인 상에 상기 사용자의 개인 정보를 기초로 사용자 계정을 생성하거나 또는 온라인을 통하여 사용자 계정제공자로부터 상기 사용자의 개인 정보와 관련된 사용자 계정을 제공받는 사용자 계정 수신부를 포함하고, 상기 인구학적 정보, 상기 질환 정보, 상기 하나 이상의 건강 질문들, 상기 하나 이상의 건강 답변들, 상기 건강 특징 벡터, 및 상기 건강 평가 정보 중 하나 이상은 상기 사용자 계정과 관련된 사용자 데이터에 저장된, 온라인을 기반으로한 건강 관리 장치."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22 항에 있어서, 상기 인구학적 정보 또는 질환 정보 수집부는, 상기 디바이스로부터 인구학적 정보 또는 질환 정보를 입력받는 인구학적 정보 또는 질환 정보 입력부; 또는상기 사용자 데이터에 상기 인구학적 정보 또는 질환 정보가 저장된 경우에, 상기 사용자 데이터로부터 상기 인구학적 정보 또는 질환 정보를 제공받는 인구학적 정보 또는 질환 정보 수신부를 포함하는, 온라인을 기반으로한 건강 관리 장치."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 22 항에 있어서, 상기 건강 질문 제공부는, 상기 사용자 데이터에 기초하여 사용자 맞춤형 건강 질문들을 제공하는 사용자 맞춤형 건강 질문 제공부를 포함하는, 온라인을 기반으로한 건강 관리 장치."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서, 상기 사용자 맞춤형 건강 질문 제공부는,상기 사용자 데이터에 기초하여, 스크리닝 형태의 포괄적인 질문들을 제공하는 포괄 질문 제공부; 및상기 포괄적인 질문들에 대한 사용자의 답변들이 사용자 데이터에 저장된 이후에, 상기 사용자 데이터를 머신러닝 또는 인공지능에 의해 분석하고, 상기 분석 결과를 반영하여 세부적인 질문들을 제공하는 세부 질문 제공부를 포함하는, 온라인을 기반으로한 건강 관리 장치.공개특허 10-2019-0079157-7-청구항 26 제 22 항에 있어서,상기 특정인의 액세스 허가부는,한명 이상의 특정인들이 상기 사용자 데이터를 열람하는 것을 허가하는 열람 허가부; 또는한명 이상의 특정인들이 상기 사용자 데이터 중 일부를 정정하는 것을 허가하는 정정 허가부를 포함하는, 온라인을 기반으로한 건강 관리 장치."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "디바이스에서 수행되는 온라인을 기반으로한 건강 관리 방법에 있어서,사용자의 개인 정보를 수집하는 단계;상기 사용자의 인구학적 정보, 질환 정보, 또는 일상 생활 방식 정보를 수집하는 단계;수집된 상기 인구학적 정보, 상기 질환 정보, 또는 상기 일상 생활 방식 정보에 기초하여 온라인을 통하여 하나이상의 건강 질문들을 디바이스로 제공하는 단계로서, 수집된 상기 인구학적 정보, 상기 질환 정보 또는 상기일상 생활 방식 정보를 분석하는 단계; 및 상기 분석에 의해 하나 이상의 건강 질문들을 디바이스로 제공하는단계를 포함하고, 상기 하나 이상의 건강 질문들은 하나 이상의 일상 생활 방식 질문들 또는 하나 이상의 임상질문들을 포함하는, 상기 하나 이상의 건강 질문들을 제공하는 단계;상기 건강 질문들에 대한 하나 이상의 건강 답변들을 수집하는 단계로서, 상기 하나 이상의 건강 답변들은 상기하나 이상의 일상 생활 방식 질문들에 대한 하나 이상의 일상 생활 방식 답변들 또는 상기 하나 이상의 임상 질문들에 대한 하나 이상의 임상 답변들을 포함하는, 상기 하나 이상의 건강 답변들을 수집하는 단계;상기 하나 이상의 건강 질문들 및 상기 하나 이상의 건강 답변들에 기초하여 건강 특징 벡터를 도출하는 단계로서, 상기 건강 특징 벡터는 상기 하나 이상의 일상 생활 방식 질문들 및 상기 하나 이상의 일상 생활 방식 답변들에 기초하여 도출된 일상 생활 방식 특징 벡터, 및 상기 하나 이상의 임상 질문들 및 상기 하나 이상의 임상답변들에 기초하여 도출된 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 도출하는 단계;도출된 상기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 이용하여 의심 질병 정보 또는 위험 요인 정보를 포함하는 건강 평가 정보를 생성하는 단계;생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계; 및특정인의 액세스를 허가하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 27 항에 있어서, 상기 사용자의 개인 정보를 수집하는 단계는, 온라인 상에 상기 사용자의 개인 정보를 기초로 사용자 계정을 생성하거나 또는 온라인을 통하여 사용자 계정제공자로부터 상기 사용자의 개인 정보와 관련된 사용자 계정을 제공받는 단계를 포함하고, 상기 인구학적 정보, 상기 질환 정보, 상기 일상 생활 방식 정보, 상기 하나 이상의 건강 질문들, 상기 하나 이상의 건강 답변들, 상기 건강 특징 벡터, 및 상기 건강 평가 정보 중 하나 이상은 상기 사용자 계정과 관련된사용자 데이터에 저장된, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 28 항에 있어서, 상기 인구학적 정보, 질환 정보, 또는 일상 생활 방식 정보를 수집하는 단계는, 상기 디바이스로부터 인구학적 정보, 질환 정보, 또는 일상 생활 방식 정보를 입력받는 단계; 또는상기 사용자 데이터에 상기 인구학적 정보, 질환 정보, 또는 일상 생활 방식 정보가 저장된 경우에, 상기 사용공개특허 10-2019-0079157-8-자 데이터로부터 상기 인구학적 정보, 질환 정보 또는 일상 생활 방식 정보를 제공받는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 28 항에 있어서, 상기 하나 이상의 건강 질문들을 제공하는 단계는, 상기 사용자 데이터에 기초하여 사용자 맞춤형 건강 질문들을 제공하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 30 항에 있어서, 상기 사용자 맞춤형 건강 질문들을 제공하는 단계는,상기 사용자 데이터에 기초하여, 스크리닝 형태의 포괄적인 질문들을 제공하는 단계; 및상기 포괄적인 질문들에 대한 사용자의 답변들이 사용자 데이터에 저장된 이후에, 상기 사용자 데이터를 머신러닝 또는 인공지능에 의해 분석하고, 상기 분석 결과를 반영하여 세부적인 질문들을 제공하는 단계를 포함하는,온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제 28 항에 있어서,상기 특정인의 액세스를 허가하는 단계는,한명 이상의 특정인들이 상기 사용자 데이터를 열람하는 것을 허가하는 단계; 또는한명 이상의 특정인들이 상기 사용자 데이터 중 일부를 정정하는 것을 허가하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법."}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "디바이스에서 수행되는 온라인을 기반으로한 건강 관리 방법에 있어서, 사용자의 개인 정보를 수집하는 단계, 사 용자의 인구학적 정보 또는 질환 정보를 수집하는 단계, 온라인을 통하여 하나 이상의 건강 질문들을 디바이스로 제공하는 단계로서, 하나 이상의 건강 질문들은 하나 이상의 일상 생활 방식 질문들 또는 하나 이상의 임상 질문 (뒷면에 계속)"}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 컴퓨터, 태블릿 PC, 스마트폰 등의 디바이스에서 수행되는 것으로서, 온라인을 기반으로 사용자들이 자신의 일상 생활 방식 정보 및 임상 관련 질문에 따른 답변을 입력하여, 일상 생활 방식 및 건강 수준을 평가 하고, 건강을 관리하며, 질병 진단을 수행하는, 온라인 기반의 건강 관리 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷과 같은 온라인을 통한 정보의 송신과 수신이 자유로워짐에 의료분야에서도 따라 원격의료와 같은 새로운 형태의 진료방법이 도입되었다. 원격의료는 원격의료장비를 이용하여 의사가 실시할 수 있는 문진, 청진, 시진을 하여 환자의 신체상태를 파악하고 검사결과를 온라인을 통해 환자에게 송신하는 방식을 활용한다. 의료서비스를 받을 수 없는 열악한 환경이나 거동이 불편한 고령자들로 구성된 실버타운과 같이 주기적이고 지 속적인 의료서비스가 필요한 장소인 경우, 원격진료를 활용한다면 피진료자가 공간 및 시간적 제약을 받지 않고 진료를 받을 수 있다는 장점이 있다. 또한 이러한 경우 외에도 지속적으로 환자의 생활관리가 필요한 당뇨 병이나 심장병 또는 암수술 후의 환자와 같은 경우, 원격진료를 통해 환자의 이상징후를 온라인 상에서 선도적 으로 파악함으로써 환자가 주기적으로 병원에 진찰을 받으러 가야만 하는 불편함을 해소할 수 있다. 다만, 이와 같은 종래의 원격진료방법은 의료진이 적극적으로 개입하여 병/의원의 의료서비스의 적용 범위를 넓 히는 것에 불과하다. 따라서, 본원에 기재된 것과 같이, 사용자 스스로 사용자의 상태를 지속적으로 기록 및 파악하므로써, 특히, 환자가 의료기관을 방문했을 때 경험하는 문진의 범위를 넘어, 사용자의 일상 생활 방 식까지 확대하여 사용자의 상태를 지속적으로 기록 및 파악하므로써, 의료 기관 외의 일상생활에서 수집될 수 있는 주기적이고 적극적인 건강정보를 기초로하여 질환의 근본적인 원인을 해결하기 위한 발명이 필요하다. 본 발명의 배경이 되는 기술은 등록특허공보 제10-0737382호 및 공개특허공보 제2002-0019229호에 개시되어 있 다"}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "의료에 있어서 건강 정보를 수집하는 전통적인 방식은 환자가 병원 또는 의원 등의 의료기관에 방문하였을 때, 질병과 관련된 정보들을 전자의무기록 (Electric Health Record) 에 기록하는 것이다. 이러한 방식은 의료 기관에서 환자에 대한 관한 정보를 집중적으로 파악하고 진료를 할 수 있지만, 짧은 시간 내에 환자에게 필요한 건강 정보를 수집해야 한다는 한계가 있다. 따라서, 환자의 현재 건강 상태의 문제점 이외에, 환자의 건강 상태의 근본적인 원인이 되는 환자의 삶의 방식, 습관, 주변 환경 등의 일상에 대한 일상 생활 방식 정보를 수 집하기 어렵고, 설사 이러한 일상 생활 방식 정보를 수집하더라도, 환자의 주관적 기억에 의존하기 때문에 부정 확할 수 있다는 단점이 있다. 또한, 환자의 일상 생활 방식 정보를 파악하기 위해서 상당한 시간을 들여야 한다는 부담이 있다. 또한, 전통적인 방식은 의료기관에 방문한 환자를 대상으로 질병과 관련된 정보들을 조사하므로, 특이적인 증상이나 질병이 나타나기 이전의 건강한 사람 또는 질병에 대한 인식이 없는 사람에 대 해서는, 일상 생활 방식 정보를 수집하기 어렵다는 한계가 있다. 이와 같이, 환자의 건강 상태의 근본적인 원인을 해결하고, 질병의 진행을 막기 위해, 그리고, 질병의 진행을 사전에 차단하는 등의 예방 조치를 조기에 실시하기 위해, 효과적으로 사용자의 일상 생활 방식 정보를 수집하는 방법이 요구된다. 또한, 환자의 과거력에 관해 기록하는 전자의무기록 차트는 대체적으로 자유 서술 노트 형식으로 기술되며, 이 는 자연어처리 (Natural Language Processing) 등의 특수한 알고리즘을 이용하여 처리하지 않는 한, 자동화된 데이터 처리를 기대하기 어렵고, 대부분의 우리나라의 임상 현장에서는 임상 노트에 기록된 정보에 대해 자동화 된 처리를 시행하고 있지 않다. 따라서, 환자의 건강 정보를 구조화된 데이터 형태로 기록해야할 필요가 있 다. 질병의 진행을 예방하기 위해서 환자의 일상 생활에서의 변화가 필요한 경우가 많지만 개인의 노력만으로는 기 존의 삶의 방식이나 습관, 주변 환경 등을 바꾸기 어렵다. 근본적인 변화를 위해서는 지속적인 모니터링 및 개입이 효과적일 수 있으나 의료진이 병원 밖의 환자에게 이를 행하는 것은 경제적, 사회적 부담과 환자의 사생 활 침해 등의 문제의 소지가 있다. 따라서, 환자 일상 생활 방식 및 건강에 대한 이상 증상/징후에 관한 정 보를 효과적으로 모니터링하는 방법이 필요하다. 기존의 온라인 기반 질병 진단 시스템은 사용자에게 건강 정보를 수집한 후 의심 질병, 질환 정보, 약국/의원/ 병원 등의 정보를 제공하고 있다. 하지만, 이와 같은 시스템은 단발성의 질병의 진행을 차단하는 데는 효과 적일 수 있으나 지속적인 관리가 필요한 질환에 효과를 내기 어려운 한계가 있다. 한편으로, 기존의 당뇨, 만성 신부전 등의 온라인기반 모니터링 시스템은 사용자에게 건강 정보를 수집하여 의사가 이를 효율적으로 이 용할 수 있도록 정보를 가공하여 제공하고 환자에게 필요한 건강 관리 정보를 제공한다. 하지만, 이와 같은 시스템은 질병이 의료진에 의하여 진단된 이후의 상태에서만 적용이 가능하며 일상 생활에서 사용자의 삶의 방 식, 습관, 주변 환경을 근본적으로 변화를 시키기 위한 모니터링 및 개입은 한계가 있다. 따라서, 의심 질 병을 제시하며, 질환의 위험 요인과 관계된 사용자의 인구학적 또는 일상 생활 요인들의 개선을 위하여 지속적 으로 사용자의 일상 생활이 변화되고 건강 관리 및 증진을 도모할 수 있도록, 모니터링 및 개입을 할 수 있는 방법이 요구된다."}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른, 디바이스에서 수행되는 온라인을 기반으로한 건강 관리 방법은, 사용자의 개인 정 보를 수집하는 단계; 상기 사용자의 인구학적 정보 또는 질환 정보를 수집하는 단계; 온라인을 통하여 하나 이 상의 건강 질문들을 디바이스로 제공하는 단계로서, 상기 하나 이상의 건강 질문들은 하나 이상의 일상 생활 방 식 질문들 또는 하나 이상의 임상 질문들을 포함하는, 상기 하나 이상의 건강 질문들을 제공하는 단계; 상기 건 강 질문들에 대한 하나 이상의 건강 답변들을 수집하는 단계로서, 상기 하나 이상의 건강 답변들은 상기 하나 이상의 일상 생활 방식 질문들에 대한 하나 이상의 일상 생활 방식 답변들 또는 상기 하나 이상의 임상 질문들 에 대한 하나 이상의 임상 답변들을 포함하는, 상기 하나 이상의 건강 답변들을 수집하는 단계; 상기 하나 이상 의 건강 질문들 및 상기 하나 이상의 건강 답변들에 기초하여 건강 특징 벡터를 도출하는 단계로서, 상기 건강 특징 벡터는 상기 하나 이상의 일상 생활 방식 질문들 및 상기 하나 이상의 일상 생활 방식 답변들에 기초하여 도출된 일상 생활 방식 특징 벡터, 및 상기 하나 이상의 임상 질문들 및 상기 하나 이상의 임상 답변들에 기초하여 도출된 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 도출하는 단계; 도출된 상기 일상 생활 방식 특 징 벡터 및 상기 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 이용하여 의심 질병 정보 또는 위험 요인 정보를 포함하는 건강 평가 정보를 생성하는 단계; 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계; 및 특정인의 액세스를 허가하는 단계를 포함한다. 본 발명의 일시예에 있어서, 상기 사용자의 개인 정보를 수집하는 단계는, 온라인 상에 상기 사용자의 개인 정 보를 기초로 사용자 계정을 생성하거나 또는 온라인을 통하여 사용자 계정 제공자로부터 상기 사용자의 개인 정 보와 관련된 사용자 계정을 제공받는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학 적 정보, 상기 질환 정보, 상기 하나 이상의 건강 질문들, 상기 하나 이상의 건강 답변들, 상기 건강 특징 벡터 및 상기 건강 평가 정보 중 하나 이상은 상기 사용자 계정과 관련된 사용자 데이터에 저장될 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보 또는 질환 정보를 수집하는 단계는, 상기 디바이스로부터 인구학적 정보 또는 질환 정보를 입력받는 단계; 또는 상기 사용자 데이터에 상기 인구학적 정보 또는 질환 정 보가 저장된 경우에, 상기 사용자 데이터로부터 상기 인구학적 정보 또는 질환 정보를 제공받는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보 또는 질환 정보를 입력받는 단계는, 온라인을 통하여 하나 이상의 인구학적 질문들 또는 질환 질문들을 디바이스로 제공하는 단계; 및 상기 제공된 상기 하나 이상의 인구학적 질문들 또는 질환 질문들에 대한 하나 이상의 인구학적 답변들 또는 질환 답변들을 수집하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보 또는 상기 질환 정보는 생활습 관 정보를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보 또는 질환 정보를 수집하는 단계는, 가족력에 관한 정보, 과거력에 관한 정보, 사회력에 관한 정보, 행동 방식에 대한 정보, 인체에 대한 정보 및 기분에 대한 정보 중 하나 이상을 수집하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 가족력에 관한 정보 는 가족들의 과거 질환 이력을 포함할 수 있다. 상기 과거력에 관한 정보는 과거 질환 이력, 약제 복용 이 력, 수술 이력, 및 치료 이력 중 하나 이상을 포함할 수 있다. 상기 사회력에 관한 정보는 흡연 이력, 흡연 패턴, 음주 이력, 및 음주 패턴 중 하나 이상을 포함할 수 있다. 상기 행동 방식에 대한 정보는 직업 활동 수행 패턴, 운동 수행 패턴, 컴퓨터 사용 패턴, 가사 노동 수행 패턴, 여가 활동 수행 패턴 및 수면 패턴 중 하 나 이상을 포함할 수 있다. 상기 인체에 대한 정보는 나이, 성별, 체중, 키, 월경, 임신 이력, 손상 이력, 신체 계측치, 활력 징후 정보 패턴, 혈액 검사 수치 및 영상 검사 중 하나 이상을 포함할 수 있다. 상기 기 분에 대한 정보는 우울감을 느끼는 빈도 및 정도, 외로움을 느끼는 빈도 및 정도, 슬픔을 느끼는 빈도 및 정도 및 스트레스를 느끼는 빈도 및 정도, 및 일상 생활을 영위하는데에 방해가 되는 생각을 하는 빈도 및 정도 중 하나 이상을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 하나 이상의 건강 질문들을 제공하는 단계는, 상기 사용자 데이터에 기초 하여 사용자 맞춤형 건강 질문들을 제공하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 사용자 맞춤형 건강 질문들을 제공하는 단계는, 상기 사용자 데이터에 기 초하여, 스크리닝 형태의 포괄적인 질문들을 제공하는 단계; 및 상기 포괄적인 질문들에 대한 사용자의 답변들 이 사용자 데이터에 저장된 이후에, 상기 사용자 데이터를 머신러닝 또는 인공지능에 의해 분석하고, 상기 분석 결과를 반영하여 세부적인 질문들을 제공하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 특정인의 액세스를 허가하는 단계는, 특정인이 상기 사용자 데이터를 열람 하는 것을 허가하는 단계; 또는 특정인이 상기 사용자 데이터 중 일부를 정정하는 것을 허가하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 특정인이 상기 사용자 데이터를 열람하는 것을 허가하는 단 계는, 사용자가 특정인이 열람할 수 있는 데이터 수준을 조절할 수 있는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 특정인의 액세스를 허가하는 단계는, 친구 맺기 단계를 포함하고, 상기 친 구 맺기 단계는, 사용자가 특정인을 친구로 초대하는 경우에, 상기 초대된 특정인이 상기 사용자의 사용자 데이 터를 열람할 수 있는 권한을 갖는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 건강 평가 정보는, 상기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡 터를 포함하는 상기 건강 특징 벡터로부터 도출된 의심 질병의 진단명을 포함할 수 있다. 본 발명의 일 실 시예에 있어서, 상기 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계는 상기 의심 질병의 진단명을 사 용자에게 제공하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계는, 상기 건강 평 가 정보를 시각화 또는 도표화시켜 사용자에게 제공하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계는, 상기 건강 평 가 정보에 기초하여 치료 정보를 도출하는 단계; 및 도출된 상기 치료 정보를 사용자에게 제공하는 단계를 포함 할 수 있다. 본 발명의 일 실시예에 있어서, 상기 치료 정보는 치료를 위한 정보 또는 증상 개선을 위한 정 보를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 일상 생활 방식 질문들은 직업 활동, 학습 활동, 가사 활동, 운동, 여가 활동, 컴퓨터 사용, 식이 섭취, 수면 및 활동시 기분 중 하나 이상에 대한 패턴 또는 주변 환경 요인에 대한 질 문을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 임상 질문들은 통증의 정도, 통증의 양상, 통증의 위치, 통증의 빈도, 증 상의 시간적 정보, 증상의 심한 정도, 증상의 특징, 증상의 위치, 증상의 악화 요인, 증상의 완화 요인, 증상의 만성 상태, 증상과 관계된 사건, 식이 상태, 수면 양상, 활력 징후 정보, 체지방 검사 수치, 혈액 검사 수치, 유전자 검사 수치, 영상검사 결과, 복통, 소화불량, 토혈, 혈변, 구토, 변비, 설사, 황달, 가슴통증, 실신, 두 근거림, 고혈압, 이상지질혈증, 기침, 콧물, 코막힘, 객혈, 호흡곤란, 다뇨, 핍뇨, 붉은색 소변, 배뇨이상, 소 변찔금증, 발열, 멍, 피로, 체중 증가, 체중 감소, 관절통증, 목통증, 피부통증, 발진, 기분변화, 불안, 수면장 애, 기억력저하, 어지러움, 두통, 경련, 근력 약화, 감각이상, 의식장애, 떨림증, 유방통, 유방멍울, 질분비물, 월경이상, 산전 진찰, 임신, 성장 지연, 발달지연, 예방접종, 고혈당, 약물 오용 및 약물 남용 중 하나 이상에 대한 질문을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 의심 질병 정보는 의심 질병의 진단명의 목록, 확률 및 중증도를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 위험 요인 정보는, 상기 일상 생활 방식 특징 벡터로부터 도출된 일상 생 활 위험 요인 정보 또는 상기 임상 특징 벡터로부터 도출된 임상 위험 요인 정보를 포함할 수 있다. 본 발 명의 일 실시예에 있어서, 상기 일상 생활 위험 요인 정보는, 직업 활동, 학습 활동, 가사 활동, 운동, 여가 활 동, 컴퓨터 사용, 식이 섭취, 수면 및 활동시 기분 중 하나 이상에 대한 정보를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 임상 위험 요인은, 증상의 시간적 정보, 증상의 심한 정도, 증상의 특징, 증상의 위 치, 증상의 악화 요인, 증상의 완화 요인, 증상의 만성 상태, 증상과 관계된 사건, 식이 상태, 수면 양상, 활력 징후 정보, 체지방 검사 수치, 혈액 검사 수치, 유전자 검사 수치 및 영상 검사 중 하나 이상에 대한 정보를 포 함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 개인 정보는 이름, 아이디, 이메일주소, SNS 계정, 휴대폰 번호 및 비밀번 호 중 하나 이상을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보는 주민등록번호, 나이, 주소 및 성별 중 하나 이상을 포함 할 수 있다. 본 발명의 일 실시예에 있어서, 상기 질환 정보는 현재 가지고 있는 질환, 현재 가지고 있는 질환의 증상, 현재 질환에 대한 치료 방법, 과거에 가졌던 질환, 과거에 가졌던 질환의 증상, 과거 질환에 대한 치료 방법, 증상의 정도, 증상의 양상, 증상의 위치, 증상의 과거력, 증상의 빈도, 및 증상의 발현 패턴 중 하나 이상을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 디바이스에 의해 사용자의 건강 정보를 모니터링하는 방법은, 특정한 주기를 포 함하고, 상기 특정한 주기에 따라 상기 온라인을 기반으로한 건강 관리 방법을 실행하는 주기적 건강 관리 방법 실행 단계; 또는 디바이스의 조작에 의해 상기 온라인을 기반으로한 건강 관리 방법을 수시로 실행하는 수시 건 강 관리 방법 실행 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 디바이스에 의해 사용자의 건강 정보를 모니터링하는 방법은 상기 주기적 건강 관리 방법 실행 단계 또는 상기 수시 건강 관리 방법 실행 단계 에서, 특정인의 액세스가 허가된 경우에, 상기 특정인의 요청에 의해 제 1 항에 기재된 온라인을 기반으로한 건 강 관리 방법을 실행하는 3 자 건강 관리 방법 수행 단계 포함할 수 있다. 본 발명의 일 실시예에 있어서, 온라인을 기반으로한 건강 관리 장치는, 사용자의 개인 정보를 수집하는 개인 정보 수집부; 상기 사용자의 인구학적 정보 또는 질환 정보를 수집하는 인구학적 정보 또는 질환 정보 수집부; 온라인을 통하여 디바이스로 하나 이상의 건강 질문들을 디바이스로 제공하는 건강 질문 제공부로서, 상기 하나 이상의 건강 질문들은 하나 이상의 일상 생활 방식 질문들 또는 하나 이상의 임상 질문들을 포함하는, 상기 건 강 질문 제공부; 상기 건강 질문들에 대한 하나 이상의 건강 답변들을 수집하는 건강 답변 수집부로서, 상기 하나 이상의 건강 답변들은 상기 하나 이상의 일상 생활 방식 질문들에 대한 하나 이상의 일상 생활 방식 답변들 또는 상기 하나 이상의 임상 질문들에 대한 하나 이상의 임상 답변들을 포함하는, 상기 건강 답변 수집부; 상기 하나 이상의 건강 질문들 및 상기 하나 이상의 건강 답변들에 기초하여 건강 특징 벡터를 도출하는 건강 특징 벡터 도출부로서, 상기 건강 특징 벡터는 상기 하나 이상의 일상 생활 방식 질문들 및 상기 하나 이상의 일상 생활 방식 답변들에 기초하여 도출된 일상 생활 방식 특징 벡터, 및 상기 하나 이상의 임상 질문들 및 상기 하 나 이상의 임상 답변들에 기초하여 도출된 임상 특징 벡터를 포함하는 상기 건강 특징 벡터 도출부; 도출된 상 기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 이용하여 의심 질병 정보 또는 위험 요인 정보를 포함하는 건강 평가 정보를 생성하는 건강 평가 정보 생성부; 생성된 상기 건강 평 가 정보를 사용자에게 제공하는 건강 평가 제공부; 및 특정인의 액세스를 허가하는 특정인의 액세스 허가부를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 개인 정보 수집부는, 온라인 상에 상기 사용자의 개인 정보를 기초로 사용 자 계정을 생성하거나 또는 온라인을 통하여 사용자 계정 제공자로부터 상기 사용자의 개인 정보와 관련된 사용 자 계정을 제공받는 사용자 계정 수신부를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보, 상기 질환 정보, 상기 하나 이상의 건강 질문들, 상기 하나 이상의 건강 답변들, 상기 건강 특징 벡터 및 상기 건강 평가 정보 중 하나 이상은 상기 사용자 계정과 관련된 사용자 데이터에 저장될 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보 또는 질환 정보 수집부는, 상기 디바이스로부터 인구학적 정보 또는 질환 정보를 입력받는 인구학적 정보 또는 질환 정보 입력부; 또는 상기 사용자 데이터에 상기 인구 학적 정보 또는 질환 정보가 저장된 경우에, 상기 사용자 데이터로부터 상기 인구학적 정보 또는 질환 정보를 제공받는 인구학적 정보 또는 질환 정보 수신부를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 건강 질문 제공부는, 상기 사용자 데이터에 기초하여 사용자 맞춤형 건강 질문들을 제공하는 사용자 맞춤형 건강 질문 제공부를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 사용자 맞춤형 건강 질문 제공부는, 상기 사용자 데이터에 기초하여, 스크 리닝 형태의 포괄적인 질문들을 제공하는 포괄 질문 제공부; 및 상기 포괄적인 질문들에 대한 사용자의 답변들 이 사용자 데이터에 저장된 이후에, 상기 사용자 데이터를 머신러닝 또는 인공지능에 의해 분석하고, 상기 분석 결과를 반영하여 세부적인 질문들을 제공하는 세부 질문 제공부를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 특정인의 액세스 허가부는, 한명 이상의 특정인들이 상기 사용자 데이터를 열람하는 것을 허가하는 열람 허가부; 또는 한명 이상의 특정인들이 상기 사용자 데이터 중 일부를 정정하는 것 을 허가하는 정정 허가부를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 디바이스에서 수행되는 온라인을 기반으로한 건강 관리 방법은, 사용자의 개인 정보를 수집하는 단계; 상기 사용자의 인구학적 정보, 질환 정보 또는 일상 생활 방식 정보를 수집하는 단계; 수집된 상기 인구학적 정보, 상기 질환 정보 또는 상기 일상 생활 방식 정보에 기초하여 온라인을 통하여 하나 이상의 건강 질문들을 디바이스로 제공하는 단계로서, 수집된 상기 인구학적 정보, 상기 질환 정보 또는 상기 일상 생활 방식 정보를 분석하는 단계; 및 상기 분석에 의해 하나 이상의 건강 질문들을 디바이스로 제공하는 단계를 포함하고, 상기 하나 이상의 건강 질문들은 하나 이상의 일상 생활 방식 질문들 또는 하나 이상의 임상 질문들을 포함하는, 상기 하나 이상의 건강 질문들을 제공하는 단계; 상기 건강 질문들에 대한 하나 이상의 건 강 답변들을 수집하는 단계로서, 상기 하나 이상의 건강 답변들은 상기 하나 이상의 일상 생활 방식 질문들에 대한 하나 이상의 일상 생활 방식 답변들 또는 상기 하나 이상의 임상 질문들에 대한 하나 이상의 임상 답변들 을 포함하는, 상기 하나 이상의 건강 답변들을 수집하는 단계; 상기 하나 이상의 건강 질문들 및 상기 하나 이 상의 건강 답변들에 기초하여 건강 특징 벡터를 도출하는 단계로서, 상기 건강 특징 벡터는 상기 하나 이상의 일상 생활 방식 질문들 및 상기 하나 이상의 일상 생활 방식 답변들에 기초하여 도출된 일상 생활 방식 특징 벡 터, 및 상기 하나 이상의 임상 질문들 및 상기 하나 이상의 임상 답변들에 기초하여 도출된 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 도출하는 단계; 도출된 상기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡 터를 포함하는 상기 건강 특징 벡터를 이용하여 의심 질병 정보 또는 위험 요인 정보를 포함하는 건강 평가 정 보를 생성하는 단계; 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계; 및 특정인의 액세스를 허가하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 사용자의 개인 정보를 수집하는 단계는, 온라인 상에 상기 사용자의 개인 정보를 기초로 사용자 계정을 생성하거나 또는 온라인을 통하여 사용자 계정 제공자로부터 상기 사용자의 개인 정보와 관련된 사용자 계정을 제공받는 단계를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보, 상기 질환 정보, 상기 일상 생활 방식 정보, 상기 하나 이상의 건강 질문들, 상기 하나 이상의 건강 답변들, 상기 건강 특징 벡터 및 상기 건강 평가 정보 중 하나 이상은 상기 사용자 계정과 관련된 사용자 데이 터에 저장될 수 있다. 본 발명의 일 실시예에 있어서, 상기 인구학적 정보, 질환 정보 또는 일상 생활 방식 정보를 수집하는 단계는, 상기 디바이스로부터 인구학적 정보, 질환 정보 또는 일상 생활 방식 정보를 입력받는 단계; 또는 상기 사용자 데이터에 상기 인구학적 정보, 질환 정보 또는 일상 생활 방식 정보가 저장된 경우에, 상기 사용자 데이터로부 터 상기 인구학적 정보, 질환 정보 또는 일상 생활 방식 정보를 제공받는 단계를 포함할 수 있다."}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "-자가 건강 모니터링- 본 발명에 의하면, 사용자의 건강 상태에 대하여, 의료 전문 지식이 바탕이 되는 구조화된 질문 및 질문/답변을 통한 주기적인 모니터링이 이루어질 수 있다. 이는 사용자의 건강 평가 정보를 기초로 최적의 질문을 선별 하여 능동적으로 질문을 송신하고 이에 따른 답변을 기록할 수 있다. 사용자가 기저 질환을 가지고 있다고 의심되거나 특정 질병이 확진된 경우에, 이러한 질환이 더 악화되는 것을 방지하는 역할을 할 수 있다. 사 용자가 질환을 앓고 있지 않는 경우에도, 생활 습관 인자를 파악하여 꾸준한 건강 관리를 유도하여 질환을 예방 할 수 있다. 이는 병원에서 기록된 환자 정보 데이터를 바탕으로 하는 전자의무기록 (Electric Health Record) 의 영역을 확장하여, 사용자의 일상 생활 방식 정보를 습득하는 개인화된 건강 기록 (Personalized Health Record) 의 역할을 할 수 있다. 또한, 사용자에게 제공되는 질문 및 답변은 수치화 또는 구조화될 수 있고, 사용자의 건강에 관한 정보들은 구조화되어 저장될 수 있고, 이를 시각화 또는 수치화 등을 통해 재구 성하여 사용자 또는 특정인에게 정확하고 편리하게 정보를 전달될 수 있다. 또한, 본 발명은 사용자의 증상 이 발생한 시기에 맞추어 증상을 기록하고, 사용자의 증상에 대한 적절한 질문을 제공할 수 있다. -가족 및 지인 간 건강정보 공유- 본 발명에 따르면, 사용자가 특정인의 액세스를 허가한 경우에, 사용자 이외의 특정인이 사용자의 건강을 모니 터링할 수 있으며, 건강 관리나 이상 징후 발견을 더욱 효과적으로 할 수 있다. 또한, 사용자 본인이 알아 차리지 못하는 위험 신호에 대해서도 더욱 쉽게 발견할 수 있다. 사용자가 특정인의 액세스를 허가하는 것 은, 소셜 네트워크 서비스 (Social Network Service) 에서의 친구맺기와 같은 기능으로 실현될 수 있으며, 이때, 사용자와 액세스가 허가된 특정인은 각 건강질문에 대한 답변을 공유하며, 서로의 건강 정보를 손쉽게 파 악할 수 있다. 한편으로 친구 맺기를 통한, 주변 사람들과의 커뮤니케이션을 기반으로, 건강 개선을 위한 일상 생활 행태 변화를 극대화시킬 수 있다. 또한, 본 발명은 특정인의 액세스를 허가하는 단계를 포함함으로써, 사용자가 자신의 건강 정보를 공유하고자 하는 사람들에게 쉽게 구조화된 건강 정보를 제공할 수 있으며, 액세스가 허가된 사람들은 사용자의 건강 상태 를 확인하고, 모니터링 및 개입을 할 수 있다. 또한, 본 발명은 주변 사람들의 영향으로 사용자의 삶의 방 식, 습관, 주변 환경 등이 변화할 수 있도록 유도할 수 있고, 이러한 변화의 방향을 인공 지능 및 머신 러닝 기 법을 이용하여 제시할 수 있다. 한편으로 사용자가 병원/의원의 액세스를 허용하는 경우, 병원/의원의 의료 진이 사용자의 건강 정보에 액세스 할 수 있도록 하여, 질병 진행을 조기에 차단하도록 권고 사항을 전달하거나 조기 병원 방문을 하도록 할 수 있다. -임상 환경에서 진료에 도움이 되는 추가적인 정보 제공- 기록된 건강 질문에 대한 답변을 바탕으로, 실제 임상 현장에서 문진을 보완하는 방향으로 활용할 수 있다. 대부분의 임상 현장에서는 과거의 기억에 의존하여 환자의 과거력을 파악하는 경우가 많다. 하지만, 본 발 명을 이용하면, 이상 징후가 있을 당시의 기록이 그 당시에 즉각적 경험에 비추어 보존되어 있기 때문에, 기억 에 의존하는 기존의 과거력 탐색보다 정확한 과거력 파악이 가능하다. 또한 과거의 건강 정보 데이터는 기"}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "록된 상태 그대로 (raw) 의료진에게 제공되는 방식과 중요한 이벤트 및 정보를 요약 및 시각화하여 제공되는 방 식을 모두 사용할 수 있다. -온라인 설명간호사를 통한 의료진의 설명 보완- 기존 임상 현장에서 단시간 내에 이루어지는 의료진의 진찰 및 설명을 보완하여, 사용자의 증상, 질병, 건강 상 태, 관리 전략 등에 대한 추가적인 설명을 제공할 수 있다. 이는 사용자의 진단명 및 건강 수준/상태에 맞 추어 진료 시간에 충분히 이루어지지 못한 설명을 온라인 상에서 보완할 수 있다."}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 일 실시예는 온라인을 기반으로 질병의 진단, 일상 생활 방식 (life style) 의 평가 및 건강 관리 방 법 및 그 장치에 관한 것으로서, 일정 등록 절차에 따라 회원 가입된 개인 (회원) 에게 온라인 기반으로 건강 및 일상생활 방식에 관한 질문을 제공하고, 질문에 대한 답변을 바탕으로 건강 수준 및 일상 생활 방식을 평가 할 수 있다. 본 발명의 일 실시예는, 가능성이 높은 의심 질병의 진단명의 목록과 확률 및 중증도를 제공하 고, 질환의 원인, 병리, 치료 등의 관련 설명 및 일상 생활에서의 관리 방법을 제공할 수 있다. 본 발명의 일 실시예는, 사용자의 동의 하에 질환에 관한 특정 정보를 타인에게 제공 및 공유하여, 타인이 함께 건강 관리 를 할 수 있게 하고, 사용자 개인의 동의 하에 의료기관에 자신의 건강 정보를 제공하여, 임상 현장에서 실제 치료와 연계되도록 할 수 있다. 본 발명의 일 실시예는, 통증 등의 근골격계 질환, 우울증 등의 정신과적 질환, 비만, 당뇨, 고혈압 등의 대사 성 질환 등 지속적인 관리가 필요한 질환을 예방하거나 관리하기 위해 사용될 수 있다. 본 발명의 일 실시 예는, 신속하게 의료기관에 방문이 필요한 질환에 대해 주의를 환기시킬 수 있고, 사용자 또는 사용자에게 액세 스 허가를 받은 특정인 그리고 사용자에게 액세스 허가를 받은 의료기관에 의해, 사용자의 질병을 모니터링할 수 있다. 본 발명의 일 실시예에 따르면, 사용자는 현재의 의심 질병의 진단명과 관련 질환에 대한 설명을 제공받을 수 있고, 사용자는 의심 질병과 관련하여 스스로의 일상 생활 방식을 분석한 정보를 제공받을 수 있고, 일상 생활 방식에 대하여 조언을 받을 수 있다. 본 발명의 일 실시에 따르면, 사용자는 자신의 건강 상태를 이해하기 쉽게 가공된 형태의 정보로 제공받을 수 있고, 액세스가 허가된 특정인에게 상기 정보를 제공함으로써 함께 건 강 관리를 할 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 의료 기관의 액세스를 허가하는 경우, 의 료기관에 건강 정보를 제공하여, 건강 진단 및 치료에 사용될 수 있다. 본 발명의 일 실시예에 따른 디바이스에 의해 사용자의 건강 정보를 모니터링하는 방법에 있어서, 앞서 기술된 건강 관리 방법을 주기적 또는 수시로 실행하여, 사용자의 건강 관련 정보를 지속적으로 수집할 수 있고, 사용 자의 건강 관련 정보를 데이터베이스화 할 수 있다. 본 발명의 일 실시예에 따르면, 지속적으로 수집된 사 용자의 건강 관련 데이터를, 질병 및 예방에 대한 연구를 하기 위해 사용할 수 있고, 건강 보건에 관한 전략 또 는 정책을 수립하기 위해 사용할 수 있고, 또한 환자의 상태에 따른 맞춤형 정보 또는 서비스를 제공하기 위해 사용할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 정보는 주기적으로 수집되거나 사용자가 필요에 의해 입력하는 건강 질문을 바탕으로 수집될 수 있으며, 건강 질문을 바탕으로 사용자의 건강 특성을 파악하고 분류할 수 있다. 본 발명의 일 실시예에 따르면, 디바이스를 통하여 사용자에게 제공되는 질문 내용은 건강 정도를 이 해하기 위한 인구학적 정보 (예: 나이, 성별, 직업 등) 와 질환 정보 (예: 현재 가지고 있는 질환, 현재 가지고 있는 질환의 증상, 현재 질환에 대한 치료 방법, 과거에 가졌던 질환, 과거에 가졌던 질환의 증상, 과거 질환에 대한 치료 방법, 증상의 정도, 증상의 양상, 증상의 위치, 증상의 과거력, 증상의 빈도, 증상의 발현 패턴 등), 그리고 질환의 발생 또는 악화와 연관될 수 있는 일상 생활 요인 (자세, 습관, 식이, 환경 등) 과 관련될 수 있 다. 본 발명의 일 실시예에 따르면, 질문 설계는 의사 결정 나무 (decision tree) 기법을 포함하는 머신러닝 기법 등의 기법으로 구조화가 될 수 있고, 중요도 순서 또는 시간 순서로 도표, 그림 등으로 시각화되어 화 면상에 표시될 수 있다. 본 발명의 일 실시예에 따르면, 디바이스를 통하여 사용자에게 제공되는 질문 내용 은, 먼저 스크리닝 형태의 포괄적인 질문으로 결정될 수 있고, 상기 포괄적인 질문에 대한 사용자의 답변을 머 신러닝 및 인공지능으로 분석한 뒤에, 분석 결과를 반영하여 세부적인 질문 내용으로 결정될 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 답변들은 사용자의 건강 상태 및 건강 수준을 수치화시킬 수 있도록 설계될 수 있으며, 사용자의 건강 상태 및 건강 수준의 분류 및 판별의 데이터로 사용 될 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 디바이스에 주기적으로 건강 관련 질문이 표시되도록 할 수 있으며, 따라서, 사용자가 스스로의 건강에 대한 관심을 환기시킬 수 있고, 지속적으로 건강 질문에 대한 답변을 작성하 도록 유도할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 디바이스로 제공되는 질문들을 결정하는 경우에, 사용자의 건강 상태 및 건강 수준을 분류하기 위해서, 머신러닝 및 인공지능 분야의 방법론을 활용할 수 있다. 본 발명의 일 실 시예에 따르면, 디바이스로 제공된 질문들 및 디바이스에서 수집된 답변들을 기초로, 의사 결정 나무 (decision tree), 서포트벡터머신 (support vector machine), 로지스틱 및 선형 회귀 (Logistic and linear regression), k-nearest neighbor, 또는 인공 신경망 등을 바탕으로한 부스팅(Boosting) 기법을 통해 환자의 현재 상태를 분류 및 파악할 수 있고, 환자의 향후 상태를 예측할 수 있다. 본 발명의 일 실시예에 따르면, 환자의 현재 상태를 분류하는 방법으로, 라벨링 (labeling) 을 활용한 지도학습 (supervised learning) 또는 자체적으로 기준을 세워 분류하는 비지도학습 (unsupervised learning) 을 통한 데이터 기반 학습 방법이 사용 될 수 있다. 본 발명의 일 실시예에 따르면, 환자의 현재 상태를 분류하는 방법으로, 임상 진료의 교과서적 지식을 활용한 가이드라인 및 프로토콜 기반의 정답 기반 학습 방법이 사용될 수 있다. 본 발명의 일 실시 예에 따르면, 환자의 현재 상태를 분류하는 방법으로, 상기 데이터 기반 학습 방법 및 상기 정답 기반 학습 방 법이 병용적으로 사용될 수 있다. 본 발명의 일 실시예에 따르면, 건강 질문들에 대한 답변들은, 머신러닝 기법 등에 의하여, 사용자의 건강 정보 를 나타내는 특징 벡터 (feature vector) 로 변환될 수 있으며, 사용자는 상기 특징 벡터를 기초로하여 사용자 스스로의 건강 상태를 파악할 수 있다. 본 발명의 일 실시예에 따르면, 사용자는 상기 특징 벡터를 기초로 하여, 사용자 스스로의 건강 상태가, 전체 사용자에 대하여 어떠한 수준 및 범위에 포함되어있는지를 파악할 수 있다. 본 발명의 일 실시예에 따르면, 건강 특징 벡터는 사용자의 건강 정보를 기술하기 위한 높은 차원 벡터일 수 있 으며, 이와 같은 높은 차원의 벡터를 낮은 차원의 벡터로 변환하여 시각화하기 위해서, 주성분분석(PCA) 또는 t-SNE 등의 방법이 사용될 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 특징 벡터에 기초하여, 사용자의 건강 수준 및 일상 생활 방식을 평가할 수 있고, 사용자의 건강 특징 벡터에 기초하여 사용자의 생활 습관을 교정하기 위한 정보를 제공할 수 있고, 사용자에게 진료를 권고할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 특징 벡터에 기초한 사용자의 건강 평가 정보를 시각화하여 제공 할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 평가 정보는, 머신러닝, 인공지능 방법론 또는 임상 진료의 교과서적 지식을 활용한 가이드라인 및 프로토콜 등에 의해 도출된 의심 질병의 목록을 포함할 수 있으며, 각각의 질환에 대한 의심 정도, 질환 정보, 치료 방법을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 평가 정보는, 사용자의 과거 또는 현재의 건강 상태 및 건강 수준, 상기 사용자의 건강 상태 및 건강 수준과 연관성이 높다고 도출된 인구학적/질환/일상 생활 요인을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 평가 정보는, 사용자에게 단기 및 장기 목표를 부여할 수 있고, 상기 목표 를 달성하기 위한 장기 및 단기 계획을 포함할 수 있고, 사용자의 일상 생활 방식에 대한 정보를 제공할 수 있 다. 본 발명의 일 실시예에 따르면, 사용자가 특정인의 액세스를 허가하는 경우, 사용자의 건강 정보는 상기 특정인 에게 공유될 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 특정인의 액세스를 허가하는 것은, 소셜네 트워크 서비스의 친구 맺기 기능에 의해 구현될 수 있다. 본 발명의 일 실시예에 따르면, 사용자는 친구를 맺은 다른 사용자와 건강 정보를 공유할 수 있다. 본 발명의 일 실시예에 따르면, 건강 정보를 공유 받은 사용자는, 건강 정보를 공유한 사용자에게 피드백을 줄 수 있다. 본 발명의 일 실시예에 따르면, 상기 피드 백은 커뮤니케이션을 위한 대화 창구 (예, 댓글) 에 의해 구현될 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 정보가 업데이트가 되면 자동적으로 친구의 디바이스에 업데이트 표시가 입력될 수 있다. 본 발명의 일 실시예에 따르면, 친구 맺기는 사용자가 언제든지 활성화 또는 비활 성화 시킬 수 있다. 본 발명의 일 실시예에 따르면, 본원에 기재된 온라인 기반의 건강 관리 방법은 친구 맺기가 된 사용자들 상호 간의 커뮤니케이션을 가능하게 함으로써, 사용자의 일상 생활 요인 및 질환 요인이 개 선될 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 의료진의 액세스를 허가하는 경우에는, 의료진은 사용자 데이터에 액 세스 할 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 의료진의 액세스를 허가하는 경우에는, 상호 간 의 커뮤니케이션이 가능한 대화창구를 통하여, 의료진은 사용자와 커뮤니케이션을 할 수 있고, 따라서, 의료진 은 사용자에게 병원 방문 및 의료진의 진료를 권유할 수 있다. 본 발명의 일 실시예에 따르면, 본원에 기재 된 온라인 기반의 건강 관리 방법에 의해 도출된 사용자의 건강 평가 정보가, 의료진의 판단과 다른 경우에는, 의료진이 상기 사용자 데이터 내의 건강 평가 정보를 변경할 수 있다. 본 발명의 일 실시예에 따르면, 의료 진은 상기 사용자 데이터 내의 건강 평가 정보 중 의심 질병의 목록을 변경할 수 있으며, 본원에 기재된 온라인 기반의 건강 관리 방법은 의심 질병의 변경에 따라, 건강 평가 정보 내의 치료에 대한 설명, 현재 건강 상태 및 건강 수준, 사용자의 일상 생활 방식에 대한 정보 등이 변경될 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 평가 정보 및 사용자의 단말기로부터의 위치 정보를 이용하여 근 거리의 병원 등을 자동적으로 공개할 수 있고, 사용자의 건강 평가 정보를 기초로 디바이스로 의원 또는 병원과 관련된 광고를 제공할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 평가 정보에 기초하여 디바이스로 음식물, 기호품 또는 의료 기 기와 관련된 광고를 제공할 수 있다. 본 발명의 일 실시예에 따르면, 사용자의 건강 평가 정보 및 위치정보 를 이용하여 음식물 기호품 또는 의료 기기에 대한 경영전략, 판매전략 또는 생산전략 세울 수 있다. 도 1 은 본 발명을 실시하기 위한 구체적인 실시예로서, 온라인 기반 건강 관리 방법 의 블럭도이다. 일 실시예로서, 온라인 기반 건강 관리 방법 은 디바이스에 의해 수행되며, 상기 디바이스는 컴퓨터, 노트북, 핸드폰, 스마트 폰, 스마트 시계, 테블릿 피시 등의 사용자 단말기를 포함한다. 일 실시예로서, 온라인 기반 건강 관리 방법 은 사용자의 개인 정보 수집 단계 , 인구학적 정보 또 는 질환 정보 수집 단계 , 건강 질문들 제공 단계 , 건강 답변들 수집 단계 , 건강 특징 벡터 도출 단계 , 건강 평가 정보 생성 단계 , 건강 평가 정보 제공 단계 및 특정인의 액세스 허가 단계 를 포함한다. 도 2 는 개인 정보 수집 단계 의 블럭도이다. 개인 정보 수집 단계 는 수집된 개인 정보에 기 초하여 사용자 계정 존재 여부를 판단 하는 단계를 포함한다. 사용자 계정이 없는 경우에는, 사용자 계정 생성 단계 에서, 수집된 사용자 개인 정보에 기초하여 새로운 사용자 계정을 생성한다. 사용자 계정이 있는 경우에는, 사용자 계정 제공 단계 에서 기존의 사용자 계정을 불러온다. 사용자 계정은 디바이스와 연결되어 있는 온라인 상의 서버, 클라우드 서버, 디바이스에 저장되어 있을 수 있다. 또한, 사 용자 계정은 상기 온라인 기반 건강 관리 방법 이 수행되는 디바이스 내에 저장되어, 오프라인 상태에서 도, 개인 정보에 기초한 사용자 계정을 불러올 수 있다. 일 실시예에서는, 사용자 계정 생성 단계 는 회원가입 단계로 구현될 수 있고, 사용자 계정 제공 단계 는 로그인 단계로 구현될 수 있다. 일 실시 예에서는, 사용자의 개인 정보는 사용자의 아이디, 이메일, 이름 또는 비밀번호를 포함한다. 일 실시예에서 는, 사용자 계정 생성 단계 또는 사용자 계정 제공 단계 로부터의 사용자 계정을 이용하여, 특정 사용자의 지속적인 건강 관리를 가능하게 할 수 있다. 도 3 은 본 발명의 일 실시예에 따른 사용자 계정 및 사용자 데이터를 나타낸다. 일 실시예에서, 개인 정보 수집 단계 는 디바이스에 의해 수집된 개인 정보에 기초하여, 서버로부터 사용자 계정을 제공한다. 일 실시예에서, 서버로부터 제공된 사용자 계정은 사용자 데이터와 관련되어 있다. 일 실시예에서는, 사용 자 계정은 사용자 데이터를 포함하고 있을 수 있고, 또한 사용자 계정은 사용자 데이터가 저장된 위치를 포함하 고 있을 수 있다. 일 실시예에서, 사용자 데이터는 사용자의 인구학적 정보, 질환 정보, 사용자에게 제공된 건강 질문들, 사용자의 건강 답변들, 사용자의 건강 특징 벡터, 및 건강 평가 정보 중 하나 이상을 포함할 수 있다. 도 4 는 본 발명의 일 실시예에 따른 인구학적 정보 또는 질환 정보 수집 단계 의 블럭도이다. 일 실시예에서, 인구학적 정보 또는 질환 정보 수집 단계 는 디바이스로부터 인구학적 정보 또는 질환 정보를 입력받는 단계를 포함할 수 있다. 일 실시예에서, 상기 인구학적 정보 또는 질환 정보를 입력받는 단계 는, 온라인을 통하여 인구학적 질문들 또는 질환 질문들을 디바이스로 제공하는 단계 및 상기 인구학적 질문들 또는 질환 질문들에 대한 인구학적 답변들 또는 질환 답변들을 수집하는 단계를 포함할 수 있다. 일 실시예 에서, 상기 인구학적 정보 또는 질환 정보를 입력받은 단계는, 상기 인구학적 질문들 또는 질환 질문들 및 상기 인구학적 답변들 및 질환 답변들을 기초로 인구학적 정보 또는 질환 정보를 도출하는 단계를 포함할 수 있다. 일 실시예에서, 인구학적 정보 또는 질환 정보 수집 단계 는 사용자 데이터에 인구학적 정보 또는 질 환 정보가 저장된 경우에, 사용자 데이터로부터 상기 인구학적 정보를 제공받는 단계를 포함한다. 일 실시 예에서, 상기 인구학적 정보 또는 질환 정보 수집 단계 에서의 사용자의 인구학적 정보 또는 질환 정보는 사용자로부터 새롭게 입력될 수 있고, 또한, 온라인으로부터 사용자 데이터에 입력된 인구학적 정보 또는 질환 정보를 제공받을 수 있다. 일 실시예에서, 건강 질문들 제공 단계 는 온라인을 통하여 디바이스로 건강 질문들을 제공하는 단계로서, 상기 건강 질문들은 일상 생활 방식 질문들 또는 임상 질문들을 포함한다. 상기 건강 질문들 제 공 단계 에서 제공되는 건강 질문들은, 사용자 데이터에 기초하여 사용자 맞춤형 건강 질문들을 제공하는 단계를 포함한다. 도 5 는 본 발명의 일 실시예에 따른, 사용자 데이터에 기초한 사용자 맞춤형 건강 질문들을 제공하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법의 블럭도이다. 일 실시예에서, 사용자 맞춤형 건강 질문들 은 사용자 데이터에 기초하여 결정될 수 있다. 일 실시예에서, 사용자 맞춤형 건강 질문들은 사용자 데이터 에 저장된 인구학적 정보, 질환 정보, 건강 질문들, 건강 답변들, 건강 특징 벡터 및 건강 평가 정보 중 하나 이상에 기초하여 결정될 수 있다. 일 실시예에 있어서, 상기 사용자 데이터에 기초하여 사용자 맞춤형 건강 질문들을 제공하는 단계는 사용자 데이터에 기초하여 의사 결정 나무 (decision tree) 기법을 포함하는 머신러 닝 기법을 사용할 수 있다. 또한, 상기 사용자 맞춤형 건강 질문들을 제공하는 단계는, 상기 사용자 데이터 에 기초하여, 스크리닝 형태의 포괄적인 질문들을 제공하는 단계; 및 상기 포괄적인 질문들에 대한 사용자의 답 변들이 사용자 데이터에 저장된 이후에, 상기 사용자 데이터를 머신러닝 또는 인공지능에 의해 분석하고, 상기 분석 결과를 반영하여 세부적인 질문들을 제공하는 단계를 포함할 수 있다. 일 실시예에서, 상기 일상 생활 방식 질문들은 직업 활동, 학습 활동, 가사 활동, 운동, 여가 활동, 컴퓨터 사 용, 식이 섭취, 수면 및 활동시 기분 중 하나 이상에 대한 패턴 또는 주변 환경 요인에 대한 질문을 포함할 수 있다. 일 실시예에서, 상기 일상 생활 방식 질문들은 다음과 같은 형태로 표현될 수 있다. \"하루에 의 자에 앉아있는 시간이 몇 시간입니까?\", \"앉아 있는 도중에 중간에 쉬는 타임을 얼마나 자주 가지십니까? (잠깐 서거나 걷기)\", \"독서를 할 때 독서대를 사용하십니까?\", \"하루에 핸드폰 사용 시간은 몇 시간입니까?\" 또는 \" 격렬한 운동을 얼마나 자주 하십니까?\" 일 실시예에서, 상기 일상 생활 방식 질문들은 사용자의 일상 생활 방식 정보를 얻기 위한 것으로서, 사용자의 질환과 직접적으로 연관되지 않는 사용자의 평소 일상 생활에 대한 질문들일 수 있다. 일 실시예에서, 상기 임상 질문들은 증상의 발현 패턴, 증상의 시간적 정보, 증상의 심한 정도, 증상의 특징, 증상의 위치, 증상의 악화 요, 증상의 완화 요인, 증상의 만성 상태, 증상과 관계된 사건, 식이 상태, 수면 양 상, 활력 징후 정보, 체지방 검사 수치, 혈액 검사 수치, 유전자 검사 수치, 영상검사 결과, 복통, 소화불량, 토혈, 혈변, 구토, 변비, 설사, 황달, 가슴통증, 실신, 두근거림, 고혈압, 이상지질혈증, 기침, 콧물, 코막힘, 객혈, 호흡곤란, 다뇨, 핍뇨, 붉은색 소변, 배뇨이상, 소변찔금증, 발열, 멍, 피로, 체중 증가, 체중 감소, 관 절통증, 목통증, 피부통증, 발진, 기분변화, 불안, 수면장애, 기억력저하, 어지러움, 두통, 경련, 근력 약화, 감각이상, 의식장애, 떨림증, 유방통, 유방멍울, 질분비물, 월경이상, 산전 진찰, 임신, 성장 지연, 발달지연, 예방접종, 고혈당, 약물 오용 및 약물 남용 중 하나 이상에 대한 질문을 포함할 수 있다. 일 실시예에서, 상기 임상 질문들은 다음과 같은 형태로 표현될 수 있다. \"통증의 정도를 0부터 10점 사이의 점수로 나타내 면 몇 점입니까?\", \"통증이 생긴 지 시간이 얼마나 되었습니까?\", 또는 \"통증의 위치는 어디입니까?\" 일 실시예에서, 상기 임상 질문들은, 사용자의 임상 정보를 얻기 위한 질문으로서, 사용자의 질환과 직접적으로 연관된 질문들일 수 있다. 일 실시예에서, 상기 임상 질문들은 질병과 밀접하게 관계된 질문들을 일컫는 것으로, 질환에 대한 구체적인 질 문이며, 상기 일상 생활 방식 질문들은 일상 생활에서의 수행 패턴 및 환경을 일컫는 것으로, 사용자의 일상 생 활에 대한 구체적인 질문으로 구별될 수 있다. 예를 들어, 사용자가 허리 통증 환자인 경우, 임상 질문들은 허리 통증에 대한 내용 및 부가적인 증상에 대한 질문들 (예를 들어, 통증 정도, 위치, 기간, 위약감 등) 이 될수 있다. 한편, 일상 생활 질문들은 허리 통증을 야기할 만한 일상 생활 동작에 대한 질문들 (예를 들어, 무거운 물체를 드는 경우가 많은 지, 수면 자세, 운동 습관 등) 이 될 수 있다. 일 실시예에서, 건강 답변들을 수집하는 단계 는 온라인을 통하여 디바이스로 제공된 건강 질문들에 대 한 건강 답변들을 수집하는 단계로서, 상기 건강 답변들은 일상 생활 방식 질문들에 대한 일상 생활 방식 답변 들 또는 임상 질문들에 대한 임상 답변들을 포함할 수 있다. 일 실시예에서, 상기 건강 답변들은 답변들이 입력되는 부분이 구조화되어, 객관적으로 선택될 수 있는 답변들 일 수 있다. 일 실시예에서, 상기 건강 답변들은 수치화된 형태로 수집될 수 있는 답변들일 수 있다. 예를 들어, 디바이스로 \"환부가 어디입니까?\"라는 임상 질문이 제공된 경우에, 사람 모양의 신체 모형에서 마우 스 커서 또는 모바일 앱을 터치에 의해 환부를 선택하여 건강 답변을 수집할 수 있다. 또한, 디바이스로 \" 환부에 통증이 얼마나 느껴지십니까?\"라는 임상 질문이 제공된 경우에, 마우스 커서등을 이용하여, 아픔의 정도 를 1 내지 10 중 하나로 선택할 수 있도록하여, 건강 답변을 수집할 수 있다. 일 실시예에서 건강 특징 벡터 도출 단계 는 건강 질문들 및 건강 답변들에 기초하여 건강 특징 벡터를 도출할 수 있다. 일 실시예에서, 건강 특징 벡터는 일상 생활 방식 특징 벡터 및 임상 특징 벡터를 포함할 수 있다. 일 실시예에서, 일상 생활 방식 특징 벡터는 일상 생활 방식 질문들 및 일상 생활 방식 답변들에 기초하여 도출될 수 있다. 일 실시예에서, 임상 특징 벡터는 임상 질문들 및 임상 답변들에 기초하여 도출 될 수 있다. 도 6 은 본 발명의 일 실시예에 따른 건강 특징 벡터를 나타낸다. 일 실시예에서, 건강 특징 벡터는 일상 생활 방식 특징 벡터 및 임상 특징 벡터 뿐만아니라, 인구학적 정보 또는 질환 정보로부터 도출된 인구학적 특 징 벡터 또는 질환 특징 벡터를 더 포함할 수도 있다. 일 실시예에서, 건강 평가 정보 생성 단계 는 상기 일상 생활 방식 특징 벡터 및 임상 특징 벡터를 포함 하는 건강 특징 벡터를 이용하여 건강 평가 정보를 생성할 수 있다. 일 실시예에서, 상기 건강 평가 정보는 의심 질병 정보 또는 위험 요인 정보를 포함할 수 있다. 일 실시예에서, 상기 의심 질병 정보는 의심 질병 의 진단명의 목록, 확률 및 중증도를 포함할 수 있다. 일 실시예에 있어서, 상기 위험 요인 정보는 건강 평가의 한 부분으로서, 'A질환'이 의심되는 사람이 B의 '위험 요인'을 가지고 있을 때 질환이 악화될 가능성이 높을 수 있음을 의미한다. 예를 들어 '허리 디스크 탈출증'이 의심되는 사람이 '직업: 공장 노동자'라는 요인을 가지고 있는 경우, 상기 직업 요인에 의해 상기 의 심 질병이 악화될 가능성이 있으며, 따라서, 상기 직업 요인은 위험 요인에 포함될 수 있다. 일 실시예에 있어서, 상기 위험 요인 정보는 예를 들어, '중-고령의 나이', '폐경기 여성', '높은 체질량 지수', '좌식 습관' 또는 '육아' 등을 포함할 수 있다. 일 실시예에 있어서, 위험 요인 정보는 상기 위험 요인 정보는, 상기 일상 생활 방식 특징 벡터로부터 도출된 일상 생활 위험 요인 정보, 또는, 상기 임상 특징 벡터로부터 도출된 임상 위험 요인 정보를 포함할 수 있다. 일 실시예에 있어서, 상기 일상 생활 위험 요인 정보는, 직업 활동, 학습 활동, 가사 활동, 운동, 여가 활동, 컴퓨터 사용, 식이 섭취, 수면 및 활동시 기분 중 하나 이상에 대한 정보를 포함할 수 있다. 일 실시 예에 있어서, 상기 임상 위험 요인은, 증상의 시간적 정보, 증상의 심한 정도, 증상의 특징, 증상의 위치, 증상 의 악화 요인, 증상의 완화 요인, 증상의 만성 상태, 증상과 관계된 사건, 식이 상태, 수면 양상, 활력 징후 정 보, 체지방 검사 수치, 혈액 검사 수치, 유전자 검사 수치 및 영상 검사 중 하나 이상에 대한 정보를 포함할 수 있다. 일 실시예에서, 상기 건강 평가 정보는 상기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡터를 포함하는 상 기 건강 특징 벡터로부터 도출된 의심 질병의 진단명을 포함할 수 있다. 일 실시예에서, 건강 평가 정보 생 성 단계 는 건강 평가 정보 제공 단계 에서 건강 평가 정보를 시각화 또는 도표화시켜 사용자에게 제공할 수 있도록, 높은 차원의 건강 특징 벡터를 낮은 차원의 벡터로 변환시켜 건강 평가 정보에 포함시킬 수 있다. 일 실시예에서는, 높은 차원의 건강 특징 벡터를 낮은 차원의 벡터로 변환시키기 위하여, 주성분분석 (PCA) 또는 t-SNE 등의 방법을 사용할 수 있다. 일 실시예에서, 건강 평가 정보 제공 단계 는 건강 평가 정보 생성 단계 에서 생성된 건강 평가 정 보를 디바이스로 제공할 수 있다. 일 실시예에서, 건강 평가 정보 제공 단계 는 건강 평가 정보를 시 각화 또는 도표화시켜 사용자에게 제공할 수 있다. 일 실시예에서, 건강 평가 정보 제공 단계 는 건 강 평가 정보에 기초하여 치료 정보를 도출하고, 도출된 상기 치료 정보를 사용자에게 제공할 수 있다. 일실시예에서, 상기 치료 정보는 치료를 위한 정보 또는 증상 개선을 위한 정보를 포함할 수 있다. 일 실시예 에서는, 생성 단계 에서 생성된 의심 질병의 진단명을 사용자에게 제공할 수 있다. 일 실시예에 있어서, 특정인의 액세스 허가 단계 는 특정인이 사용자 데이터를 열람하는 것을 허가하는 단계; 또는 특정인이 사용자 데이터 중 일부를 정정하는 것을 허가하는 단계를 포함할 수 있다. 일 실시예 에 있어서, 상기 특정인이 상기 사용자 데이터를 열람하는 것을 허가하는 단계는, 사용자가 특정인이 열람할 수 있는 데이터 수준을 조절할 수 있는 단계를 포함할 수 있다. 일 실시예에 있어서, 특정인이 사용자 데이터 중 일부를 정정하는 것을 허가하는 단계는 의료기관이 건강 평가 정보 생성 단계 에서 생성된 건강 평가 정보 중 일부를 정정하는 것을 허가하는 단계를 포함할 수 있다. 일 실시예에 있어서, 특정인이 사용자 데 이터 중 일부를 정정하는 것을 허가하는 단계는, 의료기관이 건강 평가 정보 생성 단계 에서 생성된 건강 평가 정보 중 진단명을 정정하는 것을 허가하는 단계를 포함할 수 있다. 일 실시예에 있어서, 특정인의 액 세스 허가 단계 는 친구 맺기 기능으로 구현될 수 있다. 일 실시예에 있어서, 사용자가 특정인을 친 구로 초대하는 경우, 상기 특정인이 상기 사용자의 사용자 데이터에 대한 열람 권한을 가지도록 할 수 있다. 일 실시예에 있어서, 특정인의 액세스 허가 단계 는 특정인의 요청에 따라 디바이스에서 수행되는 온라 인 기반 건강 관리 방법 을 실행시킬 수 있도록, 특정인에게 권한을 부여할 수 있다. 도 7 은 본 발명의 일 실시예에 따른 사용자 건강 정보 모니터링 방법 의 블럭도이다. 일 실시예에 있어서, 사용자 건강 정보 모니터링 방법 은 본원에 기재된 온라인 기반 건강 관리 방법 에 대한 주기적 건강 관리 방법 실행 단계 또는 수시 건강 관리 방법 실행 단계 를 포함할 수 있다. 일 실시예에 있어서, 주기적 건강 관리 방법 실행 단계 은 특정한 주기에 따라 온라인 기반 건강 관리 방법 을 실행할 수 있다. 일 실시예에 있어서, 수시 건강 관리 방법 실행 단계 는 디바이스 의 조작에 따라 수시로 온라인 기반 건강 관리 방법 을 실행할 수 있다. 일 실시예에 있어서, 사용 자는 주기적 건강 관리 방법 실행 단계 의 주기를 변경할 수 있다. 일 실시예에 있어서, 사용자 건강 정보 모니터링 방법 은 본원에 기재된 온라인 기반 건강 관리 방법 에 대한 3 자 건강 관리 방법 실행 단계 를 더 포함할 수 있다. 일 실시예에 있어서, 주기적 건강 관리 방법 실행 단계 또는 수시 건강 관리 방법 실행 단계 에 의해, 온라인 기반 건강 관리 방법 이 실행되어, 특정인의 액세스 허가 단계 에서 액세스를 허가받은 특정인이 있는 경우, 3 자 건강 관리 방법 실행 단계 는 특정인의 요청에 의해서 온라인 기반 건강 관리 방법 을 실행시킬 수 있다. 일 실시예에 있어서, 3 자 건강 관리 방법 실행 단계 는, 특정인이 특정 시간을 입력하여, 상기 입력된 시간에 온라인 기반 건강 관리 방법 을 실행 시킬 수 있다. 일 실시예에 있어서, 디바이스에서 수행되는 온라인을 기반으로한 건강 관리 방법은, 사용자의 개인 정보를 수 집하는 단계; 상기 사용자의 인구학적 정보, 질환 정보 또는 일상 생활 방식 정보를 수집하는 단계; 수집된 상 기 인구학적 정보, 상기 질환 정보 또는 상기 일상 생활 방식 정보에 기초하여 온라인을 통하여 하나 이상의 건 강 질문들을 디바이스로 제공하는 단계로서, 수집된 상기 인구학적 정보, 상기 질환 정보 또는 상기 일상 생활 방식 정보를 분석하는 단계; 및 상기 분석에 의해 하나 이상의 건강 질문들을 디바이스로 제공하는 단계를 포함 하고, 상기 하나 이상의 건강 질문들은 하나 이상의 일상 생활 방식 질문들 또는 하나 이상의 임상 질문들을 포 함하는, 상기 하나 이상의 건강 질문들을 제공하는 단계; 상기 건강 질문들에 대한 하나 이상의 건강 답변들을 수집하는 단계로서, 상기 하나 이상의 건강 답변들은 상기 하나 이상의 일상 생활 방식 질문들에 대한 하나 이 상의 일상 생활 방식 답변들 또는 상기 하나 이상의 임상 질문들에 대한 하나 이상의 임상 답변들을 포함하는, 상기 하나 이상의 건강 답변들을 수집하는 단계; 상기 하나 이상의 건강 질문들 및 상기 하나 이상의 건강 답변 들에 기초하여 건강 특징 벡터를 도출하는 단계로서, 상기 건강 특징 벡터는 상기 하나 이상의 일상 생활 방식 질문들 및 상기 하나 이상의 일상 생활 방식 답변들에 기초하여 도출된 일상 생활 방식 특징 벡터, 및 상기 하 나 이상의 임상 질문들 및 상기 하나 이상의 임상 답변들에 기초하여 도출된 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 도출하는 단계; 도출된 상기 일상 생활 방식 특징 벡터 및 상기 임상 특징 벡터를 포함하는 상기 건강 특징 벡터를 이용하여 의심 질병 정보 또는 위험 요인 정보를 포함하는 건강 평가 정보를 생성하는 단계; 생성된 상기 건강 평가 정보를 사용자에게 제공하는 단계; 및 특정인의 액세스를 허가하는 단계를 포함할 수 있다. 본 명세서에서 개시된 방법 또는 장치의 각 단계는 일 예로서 설명된 것이다. 따라서 필요에 따라 각 단계 들의 순서는 본 발명의 사상 내에서 조정될 수 있다. 또한 본 명세서에서 개시된 장치 및 시스템은 본 명세서에서 설명된 기능들을 수행할 수 있는 수단들을 포함할 수 있고, 필요에 따라 독립된 장치 또는 시스템으로 구현되거나 또는 다른 시스템과 연동되거나 통합된 형태로 존재할 수도 있다. 본 명세서에서 설명된 기술들은 적어도 부분적으로 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 임의의 조합으 로 구현될 수도 있다. 이들은 예를 들어 하나 이상의 프로세서들, DSP, ASIC, FPGA, 또는 등가의 로직 회로, 또는 이들 중 적어도 하나 이상의 임의의 조합으로 구현될 수도 있다. 이러한 하드웨어, 소프트웨어 및 펌웨어는 본 명세서에 개시된 동작들 및 기능들을 지원하기 위해 하나의 또는 복수개의 시스템이나 디바이스 내에서 구현될 수 있고, 또는 다른 시스템이나 디바이스와 연동되거나 통합된 형태로 구현될 수도 있다. 또 한, 본 명세서에서 설명된 컴포넌트들은 별개이지만 상호 운용 가능한 로직 디바이스들과 함께 또는 별개로 구 현될 수도 있다. 본 명세서에서 구분되어 설명된 각 기능 및 동작들은 각각의 기능을 강조하기 위하여 그와 같이 설명된 것일 뿐, 그러한 기능들이 각각 별개의 하드웨어, 펌웨어 또는 소프트웨어 컴포넌트들에 실현되어 야 하는 것은 아니며, 공통의 또는 별개의 하드웨어 및/또는 소프트웨어의 조합 내에 통합될 수도 있다. 또한, 본 명세서에서 설명된 기술들은 명령들을 포함하는 컴퓨터 판독가능 저장 매체에서 구현되거나 저장될 수 도 있다. 그리고 컴퓨터 판독가능 저장 매체에 저장된 명령들은 프로세서에 의해 그 명령과 관련된 방법 및 동작이 수행되게 할 수 있다. 컴퓨터 판독가능 저장 매체는 RAM, ROM, PROM, EPROM, EEPROM, 플래시 메모 리, 하드 디스크, CD-ROM, 자기 매체, 광학 매체, 또는 기타 저장 매체들을 포함할 수도 있다. 본문에 개시되어 있는 본 발명의 실시예들에 대해서, 특정한 구조적 내지 기능적 설명들은 단지 본 발명의 실시 예를 설명하기 위한 목적으로 예시된 것으로, 본 발명의 실시예들은 다양한 형태로 실시될 수 있으며 본문에 설 명된 실시예들에 한정되는 것으로 해석되어서는 아니 된다. 본 발명은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는바, 특정 실시예들을 도면에 예시하고 본 문에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 할 것 이다."}
{"patent_id": "10-2017-0181156", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기에서는 본 발명을 바람직한 실시예를 참조하여 설명하였지만, 해당 기술분야의 숙련된 당업자는 하기의 특 허청구범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 본 명세서에서 그리고 특히 청구범위에서 사용된 사용자, 특정인 및 특정인들과 같은 단수 용어 및/또는 복수 용어의 사용에 대해서, 당업자는 문맥 및/또는 명세서에 적당하도록 복수에서 단수로 및/또는 단수에서 복수로 해석할 수 있다. 다양한 단수/복수의 치환은 간결함을 위해 본 명세서에서 명백히 전개될 수도 있다. 일반적으로, 본 명세서에서 그리고 특히 청구범위에서 사용되는 용어는 일반적으로 \"개방적인\" 용어들 (예를 들 어, \"포함하는\" 이라는 용어는 \"포함하지만 한정되지 않는\" 으로 해석되어야 하고, \"갖는\" 이라는 용어는 \"적어 도 갖는\" 으로 해석되어야 하고, \"포함한다\" 라는 용어는 \"포함하지만 한정되지 않는다\" 로 해석되어야 한다) 로서 의도된다는 것이 당업자에 의해 이해될 것이다. 또한, 도입된 청구항 기재의 특정한 수가 의도되는 경 우, 이러한 의도는 청구항에 명시적으로 기재될 것이며, 이러한 기재의 부존재 시에는 그러한 의도가 없다는 것 이 당업자에 의해 이해될 것이다. 예를 들어, 이해를 돕기 위하여, 다음의 첨부된 청구범위는 청구항 기재 를 도입하기 위한 \"적어도 하나\" 및 \"하나 이상\" 의 서두 어구의 사용을 포함할 수도 있다. 그러나, 이러한 어구의 사용은, 동일 청구항이 서두 어구 \"하나 이상\" 또는 \"적어도 하나\" 는 통상적으로 \"하나 이상\" 또는 \"적 어도 하나\" 를 의미하도록 해석되어야 한다. 또한, 도입되는 청구항 기재의 구체적 수가 명시적으로 기재되 는 경우에도, 당업자는 이러한 기재가 적어도 기재된 수 (예를 들어, 다른 수식어 없이, \"2 개의 기재\" 에 대한 그대로의 기재는, 적어도 2 개의 기재들 또는 2 개 이상의 기재들을 의미한다) 를 의미하는 것으로 해석되어야 한다는 것을 인식할 것이다. 또한, \"A, B 및 C 등 중 적어도 하나\" 와 유사한 관례가 사용되는 경우들에서, 일반적으로 이러한 구성은 당업자가 그 관례를 이해할 것이라는 의미로 의도된다 (예를 들어, \"A, B 및 C 중 적 어도 하나를 갖는 시스템\" 은 A 만을, B 만을, C 만을, A 및 B 를 함께, A 및 C 를 함께, B 및 C 를 함께, 및/ 또는 A, B 및 C 를 함께 등을 갖는 시스템을 포함하지만 이에 한정되지 않을 것이다). \"A, B 또는 C 등 중 적어도 하나\" 와 유사한 관례가 사용되는 경우들에서, 일반적으로 이러한 구성은 당업자가 그 관례를 이해할 것 이라는 의미로 의도된다 (예를 들어, \"A, B 또는 C 중 적어도 하나를 갖는 시스템\" 은 A 만을, B 만을, C 만을, A 및 B 를 함께, A 및 C 를 함께, B 및 C 를 함께, 및/또는 A, B 및 C 를 함께 등을 갖는 시스템을 포함하지만 이에 한정되지 않을 것이다). 또한, 상세한 설명, 청구범위 또는 도면에서, 2 개 이상의 택일적 용어를 나 타내는 실질적으로 임의의 이접 단어 및/또는 어구가 용어들 중 하나, 용어들 중 어느 한쪽 또는 양 용어 모두를 포함할 가능성들을 고려하도록 이해되어야 한다는 것이 당업자에 의해 이해될 것이다. 예를 들어, 어구 \"A 또는 B\" 는 \"A\" 또는 \"B\" 또는 \"A 및 B\" 의 가능성을 포함하도록 이해될 것이다."}
{"patent_id": "10-2017-0181156", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명의 일 실시예에 따른 온라인 기반 건강 관리 방법 의 블럭도이다. 도 2 는 본 발명의 일 실시예에 따른 개인 정보 수집 단계 의 블럭도이다. 도 3 은 본 발명의 일 실시예에 따른 개인 정보와 관련된 사용자 계정 및 사용자 계정과 관련된 사용자 데이터 를 나타낸다. 도 4 는 본 발명의 일 실시예에 따른 인구학적 정보, 질환 정보 수집 단계 의 블럭도이다. 도 5 는 본 발명의 일 실시예에 따른, 사용자 데이터에 기초한 사용자 맞춤형 건강 질문들을 제공하는 단계를 포함하는, 온라인을 기반으로한 건강 관리 방법의 블럭도이다. 도 6 은 본 발명의 일 실시예에 따른 건강 특징 벡터를 나타낸다. 도 7 은 본 발명의 일 실시예에 따른 사용자 건강 정보 모니터링 방법 의 블럭도이다."}
