{"patent_id": "10-2023-0133906", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0051035", "출원번호": "10-2023-0133906", "발명의 명칭": "객체인식기반의 전력저감 모니터 및 그 제어방법", "출원인": "(주)대우루컴즈", "발명자": "박대우"}}
{"patent_id": "10-2023-0133906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모니터 제어부를 갖는 객체인식기반의 전력저감 모니터 및 모니터 신호발생 장치를 포함하는 모니터 절전제어시스템으로서, 상기 모니터 신호발생 장치는, (a) 사용자의 컴퓨터 정보 및 모니터 정보를 읽어서(S11), 모니터 핸들 값 정보를 획득하는 단계(S12); (b) 상기 (a) 단계 이후, 사용자의 화면을 캡처하는 함수를 만들어 일정 주기가 지나면 화면캡처를 수행할 수있게끔 구성함으로써, 화면 캡처를 진행하는 단계(S13); (c) 상기 (b) 단계 이후, 화면을 모델 인풋에 맞게끔 resize를 진행할 수 있는 함수를 구성하여, 캡처된 화면의리사이즈를 진행하게 되는 단계(S14); (d) 상기 (c) 단계 이후, resize된 화면은 모델의 입력단으로 들어가게 되며, 모델의 아웃풋은 각 객체의 label과 좌표값을 추출(inference)하게 되며(S15), 전처리된 화면 이미지는 학습된 객체인식모델(MobileNet-SSD) 모델을 활용하여 분석이 시행되고, 화면 분석 결과 현재 사용자 화면에서 창들의 위치와 밝기 패턴값을 추출하게되는 단계(S16); (e) 상기 (d) 단계 이후, 상기 밝기 패턴값들의 평균값을 산출하는 단계(S17); 및(f) 상기 (e) 단계 이후, 상기 밝기 패턴값들의 평균값을 기반으로 모니터 밝기 제어값을 산출하는 단계(S18);를 수행하고, 상기 모니터 제어부는, 상기 모니터 밝기 제어값에 따라 모니터 백라이트를 제어하는 것을 특징으로 하는 객체인식기반의 전력저감 모니터."}
{"patent_id": "10-2023-0133906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "객체인식기반의 전력저감 모니터의 제어방법으로서, (a) 사용자의 컴퓨터 정보 및 모니터 정보를 읽어서(S11), 모니터 핸들 값 정보를 획득하는 단계(S12); (b) 상기 (a) 단계 이후, 사용자의 화면을 캡처하는 함수를 만들어 일정 주기가 지나면 화면캡처를 수행할 수있게끔 구성함으로써, 화면 캡처를 진행하는 단계(S13); (c) 상기 (b) 단계 이후, 화면을 모델 인풋에 맞게끔 resize를 진행할 수 있는 함수를 구성하여, 캡처된 화면의리사이즈를 진행하게 되는 단계(S14); (d) 상기 (c) 단계 이후, resize된 화면은 모델의 입력단으로 들어가게 되며, 모델의 아웃풋은 각 객체의 label과 좌표값을 추출(inference)하게 되며(S15), 전처리된 화면 이미지는 학습된 객체인식모델(MobileNet-SSD) 모델을 활용하여 분석이 시행되고, 화면 분석 결과 현재 사용자 화면에서 창들의 위치와 밝기 패턴값을 추출하게되는 단계(S16); (e) 상기 (d) 단계 이후, 상기 밝기 패턴값들의 평균값을 산출하는 단계(S17); (f) 상기 (e) 단계 이후, 상기 밝기 패턴값들의 평균값을 기반으로 모니터 밝기 제어값을 산출하는 단계(S18);및 (h) 상기 (f) 단계 이후, 상기 모니터 밝기 제어값에 따라 모니터를 제어하는 단계(S20); 를 포함하는 것을 특징으로 하는 객체인식기반의 전력저감 컴퓨터의 제어 방법."}
{"patent_id": "10-2023-0133906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 공개특허 10-2025-0051035-3-상기 밝기 패턴값은, '화이트 패턴'의 '0 단계' 에서부터 '블랙 패턴'의 '4 단계' 까지, 다섯 단계로 분류되는것을 특징으로 하는 객체인식기반의 전력저감 컴퓨터의 제어 방법."}
{"patent_id": "10-2023-0133906", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항 또는 제 3 항에 있어서, 상기 (h) 단계는, (h1) 상기 (f) 단계에서 산출된 모니터 밝기 제어값을 DDC-CI를 통해 모니터 제어부로 전송하는 단계(S21)와, (h2) 상기 (h1) 단계 이후, 모니터 제어부는 상기 모니터 밝기 제어값에 따라서 백라이트 밝기를 조절하게 되는단계(S22)와, (h3) 상기 (h2) 단계 이후, 각 픽셀의 픽셀 값을 보정하여 자연스러운 영상이 모니터로 디스플레이 되도록 하는단계(S23)로 이루어지는 것을 특징으로 하는 객체인식기반의 전력저감 컴퓨터의 제어 방법."}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 화면을 캡처(Capture)하여 딥러닝 모델을 이용하여 화면을 분석한 후 현재 사용자가 사용하는 창들을 감지한 다음 창들에 대한 밝기 단계를 추출하여, 밝기 단계들을 종합 후 모니터 백라이트 조절하는 방법으로서, 사용자의 별도 조작 없이 현재 하고 있는 화면을 캡처하여 인공지능 모델을 활용하여 분석을 한 후 사용자가 사 용하고 있는 창들을 감지하여 각 창들에 대한 밝기 단계를 추출하는 것이 가능하다는 장점이 있다"}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 모니터 밝기를 제어하는 전력저감 모니터 및 그 제어방법에 관한 것으로, 특히 인공지능을 이용하여 화면을 캡처한 딥러닝으로 학습된 모델을 이용하여서 적합한 밝기 단계를 도출하는 객체인식기반의 전력저감 모 니터 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 컴퓨터는 사용중 대기 모드(절전모드)나 모니터 전원 끄기 모드시에 화면을 꺼서 소비전력을 줄이 게 되는 데, 이때 모니터 화면은 꺼지지만 모니터의 전원은 계속 공급되어 전력을 소비하게 된다. 즉, 화면이 꺼진 상태에서도 모니터의 제어 보드에는 지속적으로 대기전력이 공급되어, 불필요한 대기전력 소모가 발생하게 된다. 따라서 모니터에 상용 전원을 공급하기 위한 플러그를 빼지 않고 공급 전력을 차단하여 전력 낭비를 방지하기 위한 다양한 연구가 진행되고 있었는바, 그 예로써, 대한민국 특허공개 제2013-0109060호 (컴퓨터 및 컴퓨터 주 변기기의 대기전력 차단 장치) 에 개시된 종래기술은 컴퓨터로 전원 공급이 되는 전단에 전원 스위칭부를 구비 하고, 컴퓨터 전원 오프시 컴퓨터는 물론 주변기기(모니터)의 전원을 차단하여, 대기전력을 차단하도록 한다. 즉, 컴퓨터 내부에는 외부 상용 전원을 제공받아 컴퓨터의 내부 각 구성요소들의 동작 전원을 제공하는 전원 스 위칭부, 주변기기의 전원을 차단/공급하기 위한 콘센트 전원 스위칭부, 주변기기 콘센트를 구비하 고, 컴퓨터가 대기모드(절전모드)가 되면 메모리 전원을 이용하여 콘센트 전원 스위칭부를 제어하여, 컴퓨 터 주변기기로 공급되는 전원(AC 전원)을 차단한다. 이러한 과정을 통해 대기전력을 차단하여 절전 낭비를 방지 하게 된다. 그러나 상기 제1 종래기술은 컴퓨터 전원 오프나 절전모드시 주변 기기의 전력 낭비를 방지할 수 있는 장점은 있으나, 컴퓨터의 내부에 전원 스위칭부, 콘센트 전원 스위칭부, 주변기기 콘센트를 내장해야 하므 로, 컴퓨터의 구성이 복잡해지고, 절전을 위한 장치의 구현 비용이 많이 들어, 실제 컴퓨터와 주변기기에 용이 하게 적용하기에는 어려움이 있었다. 이를 해결하기 위한 제2 종래기술로서, 대한민국 특허공개 제2015-0123435호 (컴퓨터 연동을 통한 모니터 대기 전력 차단장치) 가 개시되어 있는바, 상기 제2 종래기술은, 컴퓨터 오프 또는 컴퓨터 절전시 본체의 VGA신호를 이용하여 자동으로 모니터의 대기전력을 차단하고, 컴퓨터 구동시 자동으로 모니터에 전력을 공급하여 사용자의 조작을 최소화시켜 편의성 향상을 도모하도록 한 컴퓨터 연동을 통한 모니터 대기전력 차단장치를 제공하는 것 이다. 즉, 상기 제2 종래기술은, 컴퓨터에서 모니터의 대기전력을 차단하기 위한 별도의 구성을 부가하지 않고, 기존 컴퓨터에서 모니터로 전송하는 VGA신호만을 이용하여 모니터의 대기전력을 차단할 수 있도록 함으로써, 모니터 의 대기전력을 차단하기 위한 구성을 단순화하고 장치 구현 비용을 최소화할 수 있도록 한 컴퓨터 연동을 통한모니터 전력 차단장치를 제공하는 것이다. 이를 도 2 및 도 3을 참조하여 상술하면, 도 2에서 보는 바와 같이, 상기 제2 종래기술에 따른 컴퓨터 연동을 통한 모니터 대기전력 차단장치는, 입력 장치, 컴퓨터 본체 및 모니터를 포함한다. 상기 컴퓨터 본체는 상기 모니터의 대기 전력을 제어하기 위한 디지털 인터페이스 신호(DVI신호)를 발생하여 상기 모니터에 전달하는 역할을 한다. 이러한 컴퓨터 본체는 상기 입력장치의 입력 신호를 인터페이스 하는 입출력 보드, 컴퓨터 본체에 구동용 전원을 공급해주는 전원부, 상기 입출력 보드로 부터 출력되는 입력 신호 또는 스위치 조작에 따른 신호를 기초로 컴퓨터의 사용 상태 또는 비사용 상태를 판별 하고, 상기 판별한 컴퓨터의 상태에 따라 디지털 인터페이스 신호의 출력을 제어하는 중앙처리장치(CPU), 상기 중앙처리장치의 제어에 따라 상기 모니터에 디지털 인터페이스 신호를 발생하는 VGA보드, 상기 중앙처리장치와 연결된 메모리를 포함한다. 여기서 상기 컴퓨터 본체는 전원 온 상태, 전원 오프 상태, 절전 상태에 따라 상기 디지털 인터페이스 신 호를 차등적으로 발생하는 것이 바람직하다. 아울러 상기 디지털 인터페이스 신호는 상기 컴퓨터 본체에서 상기 모니터에 전달하는 VGA 신호를 이 용하며, 상기 전원 온 상태시에는 상기 VGA신호는 하이신호(5V)로 발생하고, 상기 전원 오프 상태 또는 절전 상 태에는 상기 VGA신호는 로우신호(0V)로 발생하는 것을 특징으로 한다. 상기 모니터는 상기 컴퓨터 본체에서 발생하는 디지털 인터페이스 신호를 전력 제어용 신호로 사용하 여 전력을 차단 또는 공급하는 역할을 한다. 이러한 모니터는 상기 컴퓨터 본체에서 출력되는 디지털 인터페이스 신호(DVI; Digital Visual Interface)를 인터페이스하기 위한 비디오 커넥터, 상기 비디오 커넥터에서 수신한 디지털 인터페이 스 신호에 따라 스위칭 모드 파워 서플라이(SMPS)에서 출력되는 모니터 동작 전원(DC12V)을 차단 또는 공 급하여 전력을 제어하는 직류 전압 차단부, 상기 직류 전압 차단부에 의해 공급되는 모니터 동작 전 원으로 구동하여 모니터의 전체 동작을 제어하는 모니터 제어 보드를 포함한다. 여기서 컴퓨터 본체 와 비디오 커넥터가 HDMI(High-Definition Multimedia Interface) 방식으로 접속될 경우, 상기 디지털 인 터페이스 신호는 HDMI신호로 대체된다. 상기 직류 전압 차단부는 도 2에 도시한 바와 같이, 상기 비디오 커넥터에서 출력되는 디지털 인터페 이스 신호(DVI신호)에 따라 스위칭 동작을 하는 스위칭 소자(Q1); 상기 스위칭 소자(Q1)와 연동하여 상기 모니 터 동작 전원을 차단 또는 공급하는 모스펫(MOSFET)을 포함한다. 상기 스위칭 소자(Q1)는 전계효과트랜지스터(FET)를 이용하며, 상기 전계효과트랜지스터(Q1)의 베이스에 상기 디지털 인터페이스 신호가 연결되고, 상기 전계효과트랜지스터의 콜렉터에는 상기 모스펫의 게이트가 연결 되고, 상기 모스펫의 소스에는 상기 모니터 동작 전원이 연결되며, 상기 모스펫의 드레인에는 상기 모니터 동작 전원의 출력단이 연결된다. 그리하여, 컴퓨터 본체에 정상적으로 전원이 공급되고, 입력 장치의 입력 신호를 검사한 결과 절전 모 드가 아닌 사용 모드일 경우, 중앙처리장치는 VGA보드를 제어하여 디지털 인터페이스 신호(DVI5V)가 정상적으로(하이신호) 발생하도록 한다. 여기서 VGA보드에서는 통상 9번 핀을 이용하여 디지털 인터페이스 신호를 모니터로 전송한다. 이렇게 발생하는 디지털 인터페이스 신호는 모니터로 전송되고, 모니터 의 비디오 커넥터를 통해 직류 전압 차단부에 전달된다. 여기서 비디오 커넥터는 입력되는 디지털 인터페이스 신호를 14번 핀을 이용하여 직류 전압 차단부에 전달한다. 직류 전압 차단부는 도 3에 도시한 바와 같이, 상기 하이레벨의 디지털 인터페이스 신호에 의해 스위칭 소 자(Q1)의 베이스가 고 전위가 되어 상기 스위치 소자(Q1)가 턴-온 된다. 상기 스위칭 소자(Q1)가 턴-온되면 컬 렉터에 연결된 P타입 모스펫의 게이트는 전위가 낮아져 상기 모스펫을 턴-온시킨다. 모스펫이 턴-온되면 상기 모스펫의 소스에 연결된 스위칭 모드 파워 서플라이에서 출력되는 모니터 동작 전원 (DC12V)은 드레인으로 흘러 모니터 동작 전원을 모니터 제어 보드에 공급한다. 이로써 모니터는 정상 적으로 동작을 하여, 해당 데이터를 화면에 디스플레이하게 된다. 즉, 컴퓨터 본체가 정상적으로 동작하는 상태에서는 VGA신호가 정상적으로 발생되어 모니터에 전달되 고, 모니터는 그 전달되는 정상적인 VGA신호를 이용하여 스위칭 모드 파워 서플라이에서 생성한 모니터 동 작 전원을 모니터 제어 보드에 정상적으로 공급하여, 모니터가 정상적으로 동작하도록 한다.이와는 달리 컴퓨터 본체에 전원이 오프되거나 입력 장치의 입력 신호를 검사한 결과 절전 모드여서 비 사용중일 경우, 중앙처리장치는 VGA보드를 정상적으로 제어할 수 없어, VGA 보드는 디지털인 터페이스 신호(DVI5V)를 정상적으로(하이신호)로 발생하지 못하게 된다. 즉, 전기적으로 로우신호(0V)를 발생하 게 된다. 여기서 VGA보드에서는 통상 9번 핀을 이용하여 디지털 인터페이스 신호를 모니터로 전송한 다. 이렇게 발생하는 로우 레벨의 디지털 인터페이스 신호는 모니터로 전송되고, 모니터의 비디오 커 넥터를 통해 직류 전압 차단부에 전달된다. 여기서 비디오 커넥터는 입력되는 로우 레벨의 디지 털 인터페이스 신호를 14번 핀을 이용하여 직류 전압 차단부에 전달한다. 상기 비디오 커넥터는 디지 털 인터페이스 방식이 HDMI 인터페이스 방식일 경우, 18번 핀을 이용하여 디지털 인터페이스 신호를 출력한다. 직류 전압 차단부는 도 2에 도시한 바와 같이, 상기 로우 레벨의 디지털 인터페이스 신호에 의해 스위칭소 자(Q1)의 베이스가 저 전위 상태가 되어 상기 스위치 소자(Q1)가 턴-오프 된다. 상기 스위칭 소자(Q1)가 턴-오 프되면 컬렉터에 연결된 P타입 모스펫의 게이트는 전위가 높아져 상기 모스펫을 턴-오프시킨다. 모스 펫이 턴-오프되면 상기 모스펫의 소스에 연결된 스위칭 모드 파워 서플라이에서 출력되는 모니 터 동작 전원(DC12V)은 드레인으로 흐르지 못해 모니터 동작 전원이 모니터 제어 보드에 공급되는 것을 차 단한다. 이로써 모니터는 꺼진 상태가 된다. 이 경우 기존에는 모니터 화면만 꺼진 상태가 되었으나, 상기 제2 종래기술은 모니터 제어 보드에 공급되는 전 력(모니터 동작 전원)을 원천적으로 차단하여, 전력 낭비를 방지하게 된다. 즉, 컴퓨터 본체가 비 사용상에서는 VGA신호가 발생하지 않아 로우 레벨의 디지털 인터페이스 신호가 모니 터에 전달되고, 모니터는 그 전달되는 로우 레벨의 VGA신호를 이용하여 스위칭 모드 파워 서플라이에 서 생성한 모니터 동작 전원이 모니터 제어 보드에 공급되는 것을 차단한다. 한편, 상기와 같이 모니터 구동 전원인 전력을 자체적으로 차단한 상태에서, 상기 컴퓨터 본체가 다시 정 상 상태로 복귀되면, 중앙처리장치의 제어에 의해 VGA 보드는 제어되어 하이 레벨의 디지털 인터페이 스 신호를 발생하여 모니터에 전달한다. 그리고 모니터는 그 전달되는 하이 레벨의 디지털 인터페이 스 신호를 이용하여 다시 스위칭 모드 파워 서플라이에서 생성된 모니터 구동 전원(DC12V)을 모니터 제어 보드로 공급하여, 모니터를 다시 정상상태로 동작시키게 된다. 이와 같이 상기 제2 종래기술은 사용자의 조작 없이, 컴퓨터 본체에서 모니터로 발생하는 VGA신호(디 지털 인터페이스 신호)를 그대로 이용하여, 모니터의 전력(모니터 동작 전원)을 자동으로 공급 또는 차단함으로 써, 사용자에게 매우 편리함을 제공해준다. 특히, 모니터의 전력 제어를 위한 별도의 제어장치를 구성하지 않고, 기존컴퓨터 본체와 모니터 간에 이루어지는 VGA신호만을 이용하여, 모니터의 대기전력을 제어할 수 있어, 전력 차단을 위한 장치 구현 비용도 최소화할 수 있게 되는 것이다. 그러나, 상기 제2 종래기술 역시, PC의 전원상태를 체크하기 위해 모니터의 감지 동작을 위한 전원 소비가 필요 하며, 구체적으로 전원모드는 크게 '전원ON모드', '절전모드(DPMS)', '전원OFF모드'가 있는데, 절전모드 시 일 반적으로 이를 감지하고 체크하기 위한 직류전압 차단부 등의 동작을 위해 1.4W 정도가 소모된다. 화면은 꺼져있는 상태이지만 바로 켜질 수 있는 상태를 위해 인버터 전원만 OFF하고, 직류전압 차단부 등 의 동작 회로에는 전원이 공급되고 있는 상태이다. 기존의 CRT 등의 모니터에서는 화면이 나오는 시간이 길어서 이러한 기술이 필요하지만, 최근 모니터는 전원을 켜면 바로 모니터가 활성화되기 때문에 절전모드는 거의 필요하지 않지만, 그럼에도 불구하고 여전히 이상의 에 너지를 낭비하는 요인이 되고 있다. 더욱이, 종래기술의 경우, 기존 모니터는 에너지 절감을 위해 디밍(Diming) 제어, 전원제어 등 다양한 제어부 및 제어소자에 의한 전원의 공급, 전압강하 또는 절전기능 등을 지원하였다. 이는 단일 신호가 아닌 여러 가지 신호들을 확인하여 전원의 상태를 파악하기 때문에 회로가 복잡하고 구현 가격이 높았다. 또한 수동적으로 PC에 서 들어오는 신호에 따른 변화를 주는 기술이 대부분이어서 에너지 절감 효율에 한계가 있다. 다른 한편, 일반적으로 액정표시장치(LCD;Liquid Crystal Display)는 인가전압에 따른 액정의 투과도의 변화를 이용하여 각종 장치에서 발생되는 여러 가지 전기적인 정보를 화상정보로 변환시키는 액정패널과 상기 액정패널 에 광을 공급하는 백라이트 유닛으로 구성된다. 도 4a에는 종래의 일반적인 직하형 액정 디스플레이 장치의 일례를 나타낸 단면도가 도시되어 있다. 도면을 참 조하면, 종래 LCD(Liquid Crystal Display)는, 빛의 투과도를 조절하여 광 밸브 역할을 하는 액정픽셀이 들어 있는 액정패널과, 이 액정패널에 빛을 공급하는 백라이트유닛을 구비한다. 상기 백라이트유닛은 CCFL(Cold Cathode Fluorescence Lamp;11a), 혹은 EEFL(External Electrode Fluorescence Lamp), 혹은 백색광 LED(Light Emitting Diode), 혹은 R, G, B의 삼색을 내는 LED 등이 포함되는 광원어셈블리 부분과, 상기 광원에서 나오는 광을 광원 아래에 위치한 반사체(11b)에서 반사시키거나 골고 루 혼합하여 다수의 액정픽셀로 뿌려주는 광 시트들로 구성되어 있다. 여기서 R, G, B는 각각 Red, Green, Blue의 약자이고, 이후에는 별도의 표시 없이도 R, G, B는 적색, 녹색, 청색을 의미한다. 상기 광 시트는, 기본적으로 확산판, 확산시트, 집광시트, 반사형 편광시트, 그리고 보호필름 등으로 구성되어 시야각과 휘도를 적절하게 조정한다. 한편, 도 4b는 종래의 일반적인 측면형 백라이트 유닛을 채택하는 액정표시장치를 나타낸다. 측면형 백라이트 유닛의 경우, 광도파로와, 상기 광도파로의 측면에 배치되는 CCFL 또는 LED(11-1)의 광원을 포함한다. 상기 직하형과 마찬가지로 상기 광도파로와 액정패널 사이에는 확산시트, 집광시트, 반사형 편 광시트, 보호필름이 배치되고, 상기 광도파로의 하부면에는 산란패턴과 반사필름가 구비되 어, 광의 균일도와 휘도를 향상시킨다. 도 4 및 도 5에 도시된 바와 같이, 상기 액정패널은, 후면 유리기판, 전면 유리기판, 후면 유리기 판과 전면 유리기판 사이에 설치되는 다수의 액정픽셀, 전면 유리기판의 내부에 설치되는 R, G, B 컬러필터, 후면 유리기판에 부착되는 편광시트A, 전면 유리기판에 부착되는 편광시트 B 등이 주요한 광학적 역할을 담당한다. 각각의 액정픽셀은, R, G, B 3색의 영상을 구현하는 R, G, B 액정하위픽셀로 구성되며, 각각의 R, G, B 액정하위픽셀 전면부에는 R, G, B 광을 투과시키는 R, G, B 컬러필터 (24; 24a, 24b, 24c)가 설치되어 있다. 또한, 서로 이웃한 컬러필터 사이의 경계선에는 블랙 매트릭스(Black matrix; 24d)가 설치되어 있어서 서로 이웃한 하위픽셀 사이의 색 혼신(Color crosstalk)을 제거하는 역할을 한다. 위와 같은 종래의 LCD에서 컬러 영상을 구현하는 방법은, 화소의 최소단위가 되는 하나의 액정픽셀 속에 R, G, B 3색의 영상을 구현하는 R, G, B 액정하위픽셀을 설치하고, 각각의 액정하위픽셀 전면부에 R, G, B 컬러필터를 설치하며, 백라이트유닛은 액정패널 전체에 걸쳐서 균일한 백색광을 뿌려주는데, 상기 백색광이 각각의 하위픽 셀 별로 R, G, B 광만 통과하도록 함으로써 컬러 영상이 이루어진다. 종래의 LCD에서는 백라이트유닛에서 나오는 백색광의 파워가 액정픽셀의 앞과 뒤에 설치되어 있는 편광 시트(21, 26), 컬러필터, 그리고 액정픽셀의 개구율에 의해서 대부분 소실되고 약 5%에서 10% 사이의 광만이 LCD 밖으로 빠져나오기 때문에 LCD의 광 에너지 효율은 상당히 낮은 문제점이 있었다. 따라서, LCD의 광 에너지 효율 개선은 LCD의 경쟁력 강화와 에너지 절약에 중요한 과제이다. LCD의 광 에너지 손실은 편광시트 (21, 26)에서 약 50%, 액정픽셀의 개구율에서 약 30% ~ 50%, 컬러필터에서 약 70%에 달하여 전체적으로 약 90% 이상의 광 손실이 발생하여 LCD의 높은 전력 소모를 유발한다. 특히, 컬러필터는 컬러 영상을 구현 하는 핵심 소자이지만, 흡수로 인한 많은 광 손실을 유발하는 문제점이 있었다. 상기 컬러필터는 컬러 영상을 구현하는 핵심적인 소자이지만, 백색광이 컬러필터를 통과하면서 약 30% 는 투과되고, 약 70%는 흡수되어 손실되기 때문에 LCD에서 발생하는 광 에너지의 손실 중에서 가장 많은 부분을 차지한다. 그리하여, 이러한 문제점을 해결하고자, 대한민국 특허공개 제10-2012-0108479호 (백라이트 유닛) 와 같은 기술 (제3 종래기술) 이 제안되었다. 이하, 첨부된 도면 도 6a 내지 도 7을 참조하여, 상기 제3 종래기술에 따른 백라이트 유닛을 설명하면 다음과 같다. 상기 제3 종래기술에 따른 백라이트 유닛이 적용된 액정표시장치는, 3색 광원과, 광도파로 어레이 와, 제1렌티큘러렌즈 어레이 시트를 포함한다. 상기 백라이트 유닛은 3색 광원에 각각 대응하는 복수의 액정하위픽셀을 포함하는 액정패널 의 하부에 배치되어 상기 3색 광원으로부터 조사되는 3색의 광을 상기 액정패널로 조사하는 역 할을 한다. 여기서 상기 3색의 광은, 통상적으로 컬러 영상을 구현하기 위한 적색(R;Red), 녹색(G;Green), 청색(B;Blue)을 의미한다. 그러나 시안(Cyan), 마젠타(Magenta), 옐로우(Yellow)도 컬러 영상구현이 가능하므로, 상기 3색의 광 은 시안, 마젠타, 옐로우일 수도 있다. 다만, 이하에서는 설명의 편의를 위해 상기 3색의 광은 적색(R), 녹색 (G), 청색(B)인 경우를 예시적으로 설명하도록 하며, 이는 본 명세서 전체에서 동일하게 적용된다. 상기 백라이트 유닛의 상부에 배치되는 상기 액정패널은 적색, 녹색, 청색의 3색 광(R,G,B)에 각각 대응하는 다수의 액정하위픽셀(210;210R,210G,210B)과 편광필름(240,250) 및 확산시트를 포함한다. 상기 액정패널의 하부에 배치되는 상기 백라이트 유닛은, 빛의 3원색을 구성하는 적색, 녹색, 청색의 3색 광(R,G,B)을 각각 조사하는 복수의 3색 광원(310;310R,310G,310B)을 포함한다. 이러한 3색 광원으로 는 각각 적색, 녹색, 청색의 광을 방출하는 LED 발광소자(LED;Light Emitting Diode)를 사용하거나, 또는 백색 LED에서 나오는 백색광을 회절격자와 같은 분광소자를 사용하여 분광하여 적색, 녹색, 청색의 광으로 분해하여 얻을 수도 있다. 또는, 상기 3색 광원은 유기발광소자(OLED;Organic Light Emitting Diode), 또는 양자점 (Quantum Dot)을 사용할 수도 있다. 상기 광도파로 어레이는 서로 나란하게 배치되는 복수의 광도파로(110;110R,110G,110B)를 포함한다. 상기 각 광도파로(110;110R,110G,110B)는 상기 액정패널 속에 설치된 복수의 R,G,B 액정하위픽셀에 각각 대응하도록 설치되어 상기 3색 광원으로부터 조사된 3색의 광(R,G,B)을 각 색에 대응하는 액정하위픽셀 쪽으로 각각 분기하는 광분기구조를 포함한다. 상기 광도파로 어레이의 상부와 상기 액정패널 사이에는 제1렌티큘러렌즈 어레이 시트가 배치되 며, 상기 제1렌티큘러렌즈 어레이 시트는 상기 3색 광원에서 조사된 3색 광(R,G,B)을 각각 평행광으 로 변환시키는 역할을 한다. 혹은, 도 7에서 보는 바와 같이, 3색 자발광원 어레이와, 제1렌티큘러렌즈 어레이 시트를 포함하는 백라이트 유닛을 사용할 수도 있다. 더욱이, 반사형 편광필름과, 제2렌티큘러렌즈 어레이 시트 를 선택적으로 더 구비할 수 있다. 이때, 상기 백라이트 유닛의 상부에 설치되는 액정패널은 3색의 광(R,G,B)에 각각 대응하는 다수의 액정하위픽셀(210;210R,210G,210B)을 포함한다. 상기 백라이트유닛은 상기 액정패널의 하부에 배치되며, 3색의 광(R,G,B)을 조사하는 다수의 3색 자 발광원(150;150R,150G,150B)을 포함한다. 이러한 3색 자발광원으로는 적색, 녹색, 청색의 유기발광소자 (OLED;Organic Light Emitting Diode,150), 또는 적색, 녹색, 청색의 양자점(Quantum Dot)을 사용할 수 있다. 양자점 자발광원은 직경 약 10 나노미터의 반도체 결정(예; CdS, CdSe, ZnS 등)으로서, 바깥층에 폴리머가 코팅 될 수도 있으며, 반도체 결정의 직경의 크기에 따라서 적색, 녹색, 청색 등의 파장의 빛을 발생할 수 있어서 OLED와 함께 3색 자발광원으로 사용할 수 있다. 상기 3색의 자발광원 어레이(150;150R,150G,150B)는 상기 다수의 액정하위픽셀(210;210R,210G,210B)과 동일한 간격으로 설치되며, 상기 3색의 자발광원 어레이는 후면판의 상부에 구비된다. 상기 제1렌티큘러렌즈 어레이 시트는 반사차광층과, 슬릿과, 투명기판과, 렌티큘러 렌즈 어레이로 이루어지고, 상기 반사차광층 이 구비됨으로 인하여 이웃하는 픽셀 사이의 색혼신을 방지할 수 있게 된다. 렌티큘러렌즈 사이에 차광벽이 추가되면 색혼신이 거의 없어져서 컬러필터를 제가하는 것이 가능하게 된다. 또한, 상기 반사차광층은 별도의 슬릿시트로 제1렌티큘러렌즈 어레이 시트(40 0)와 3색 자발광원 어레이 사이에 설치되거나, 또는 상기 3색 자발광원의 상면에 일체형으로 설치될 수도 있다. 이 경우에는, 상기 액정패널 내부에 설치되는 R,G,B 컬러필터는 제거될 수도 있지만, 화면의 안정성 과 색혼신을 최소화하기 위하여 그대로 둘 수도 있다. 즉, 상기 컬러필터는 필수적으로 구비되는 것은 아 니며, 선택적으로 구비될 수 있다. 또한, 3색의 광(R,G,B)을 상기 액정하위픽셀(210;210R,210G,210B)과 컬러필터 속으로 집광하여 효율을 더 향상시키는 제2렌티큘러렌즈 어레이 시트을 선택적으로 추가 설치 가능하다. 그리하여, 상기 제3 종래기술에 의하면, 적색, 녹색, 청색의 3색 광원에 각각 대응하는 광도파로를 이용하여 적 색, 녹색, 청색에 각각 대응하는 액정하위픽셀에 직접 적색, 녹색, 청색의 광을 뿌려주는 백라이트 유닛을 통하 여 액정표시장치의 광 투과 효율을 향상시킬 수 있으며, 더욱이, 3색 광원으로 LED 대신에 R, G, B OLED 또는R, G, B 양자점(Quantum Dot)과 같은 자발광원을 사용하는 경우에는, 광원의 구조를 더욱 단순화하고, 액정표시 장치의 장점과 자발광원의 장점을 모두 살림으로써 높은 효율과 화질을 달성할 수 있다. 그러나, 여전히, 상기 제3 종래기술의 경우에도, 백라이트 광원의 대부분이 차단되면서, 디스플레이의 색상 형 성에는 그 일부만이 사용된다는 문제점을 완전히 회피할 수는 없다. 이러한 제3 종래기술의 문제점을 해결하기 위하여, 특허공개 제10-2008-0081511호 (입력 영상의 히스토그램에 기반한 디스플레이 장치의 전력제어 방법 및 장치 및 디스플레이 장치)와 같은 기술 (제4 종래기술) 및 특허공 개 제10-2006-0120673호 (백릿 디스플레이의 화상 최적화를 위한 방법 및 장치) 의 기술 (제5 종래기술) 이 제 안되었다. 상기 제4 종래기술은, 입력 영상 신호의 휘도 분포에 기반하여 출력 영상 신호의 휘도 및 백라이트의 휘도를 상 보적으로 제어함으로써, 결과적으로 디스플레이되는 출력 영상 신호의 휘도 저하를 최소화하면서도 디스플레이 장치의 전력을 절감할 수 있는 방법, 장치, 및 이러한 기능을 가지는 디스플레이 장치에 관한 것이다. 즉, 종래 기술에 의한 디스플레이 장치는 최대 절전모드 및 최소 절전모드에서 동작하고, 이러한 최대/최소 절 전모드는 입력 영상 신호와 상관없이 백라이트의 휘도를 감소시키며, 절전 모드의 선택에 따라서 감소되는 휘도 가 결정되지만, 종래 기술에 의한 전력 절감 방법은, 모든 입력 영상 신호에 대해서 사용자에 의하여 선택된 소 정의 휘도 감소치를 일괄적으로 적용하므로, 출력되는 영상은 전체적으로 어두워지며, 특히 밝은 장면에서 영상 신호의 밝기를 잃어버리는 왜곡 현상이 발생한다. 그러므로, 출력 영상 신호의 휘도에 영향을 주지 않으면서도 디스플레이 장치의 소비 전력을 감소시키기 위한 기술이 절실히 요구되었다. 첨부한 도면 도 8 및 도 9를 참조하여 상기 제4 종래기술을 설명하는바, 도 8은 상기 제4 종래기술에 의한 디스 플레이 장치의 전력 제어 장치를 개념적으로 나타내는 블록도이고, 도 9는 상기 제4 종래기술에 의한 디스 플레이 장치의 전력 제어 방법을 개념적으로 나타내는 흐름도이다. 도 8은 상기 제4 종래기술에 의한 디스플레이 장치의 전력 제어 장치는 히스토그램 분석부, 영상 휘 도 보상부, 색상 보상부, 및 백라이트 휘도 조절부를 포함한다. 입력 영상 신호가 수신되면, 히스토그램 분석부는 입력 영상 신호의 밝기 분포를 계산하고 이를 이용하여 클리핑 계조(IC)를 결정한다. 클리핑 계조(IC)가 결정되면 영상 휘도 보상부는 결정된 클리핑 계조(IC)를 이용하여 계조 증가율을 계산하고, 그 결과를 입력 영상 신호의 각 색성분에 적용한다. 색상 보상부는 계조 증가율에 따라서 계조가 증가된 영상 신호의 각 색성분 중에서, 포화가 발생한 색성분 의 계조를 재조정한다. 또한, 백라이트 휘도 조절부는 클리핑 계조(IC)를 이용하여 백라이트 휘도 조절 신 호를 생성하여 백라이트의 휘도를 조절한다. 도 8에 도시된 전력 제어 장치를 이용하면, 디스플레이 장치 의 소비 전력을 절감하면서도, 사용자는 휘도의 변화를 거의 느낄 수 없다. 그 이유는 백라이트 휘도 조절부 가 입력 영상 신호의 밝기 분포를 고려하여 백라이트의 휘도를 감소시킴으로써 전력을 절감하는데 상응하 여, 영상 휘도 보상부가 입력 영상 신호의 휘도를 상승시키기 때문이다. 더 상세히는, 히스토그램 분석부는 입력 영상 신호의 밝기 분포를 이용하여 클리핑 계조(IC)를 결정한다. 클리핑 계조(IC)는 픽셀의 누적 히스토그램 또는 픽셀의 누적 왜곡값으로 결정한다. 클리핑 계조(IC)가 결정되면, 영상 휘도 보상부는 클리핑 계조(IC)를 히스토그램 분석부로부터 수신 하고, 이를 이용하여 계조 증가율을 연산한다. 또한, 연산된 계조 증가율을 입력 영상 신호의 각 색성분에 적용 하여 계조가 증가된 출력 영상 신호를 생성한다. 출력 영상 신호의 색성분은 색상 보상부를 통하여 보상된다. 백라이트 휘도 조절부는 히스토그램 분석부에서 출력된 클리핑 계조(IC)를 이용하여 이에 상응하도록 백라이트의 휘도를 감소시키기 위한 백라이트 휘도 제어 신호를 생성한다. 백라이트의 휘도를 제어하기 위하여 는 전류 및 전압이 사용될 수 있는데, 흔히 전압을 이용하여 백라이트의 휘도를 제어할 수 있다. 그런데, 백라 이트에 인가되는 전압의 크기와 백라이트의 휘도는 선형적으로 변화되지 않는다. 그러므로, 수신된 클리핑 계조 (IC)에 상응하는 만큼의 백라이트 휘도의 감소치에 대응되는 백라이트 휘도 조절 신호는 실험적으로 결정될 수 있다. 이 경우, 수신되는 클리핑 계조(IC)의 값 및 출력되는 백라이트 휘도 조절 신호 간의 관계는 룩업 테이블 의 형태로 저장될 수 있다. 상기 제4 종래기술에서, 백라이트의 휘도를 감소시킴에 따라서 소모 전류량이 30% 절감될 때, 소모되는 전력량은 무려 50%까지 절감될 수 있다는 것을 실험적으로 알 수 있다.다음, 상기 제4 종래기술에 의한 디스플레이 장치의 전력 제어 방법을 도 9를 참조하여 설명한다. 우선, 입력 영상 신호가 수신되면(S610), 수신된 영상 신호의 히스토그램을 분석하고, 분석된 히스토그램에 기 반하여 소정의 클리핑 계조를 결정한다(S620). 클리핑 계조(IC)는 입력 영상 신호 중에서 상위 몇 %에 해당하는 휘도 분포를 이용하여 결정되거나, 누적 휘도 에러를 이용하여 결정될 수 있음은 전술된 바와 같다. 클리핑 계조(IC)가 결정되면 이를 이용하여 입력 영상 신호의 계조 증가율을 연산한다. 그러면, 연산된 계조 증 가율을 이용하여 각 색성분을 승산함으로써 계조가 증가된 출력 영상 신호를 생성한다(S630). 이 경우 색성분에 포화가 발생되었는지를 판단하고(S640), 포화가 발생하였을 경우에 색성분을 보상한다(S650). 색성분을 보상하 기 위하여는 최대 및 최소 증가율을 가중치 부여하여 신규한 계조 증가율을 연산하거나, 양자화 노이즈를 모델 링할 수 있음은 전술된 바와 같다. 색성분에 포화가 발생하지 않는다면, 즉, 입력 영상 신호의 휘도가 원래 낮아서 색성분을 증가시켜도 포화가 발 생하지 않는 경우에는 계조 증가율에 기반하여 백라이트의 휘도를 감소시킨다(S660). 백라이트의 휘도를 감소시 키기 위하여 선결된 룩업 테이블을 이용할 수 있음은 전술된 바와 같다. 입력 영상 신호의 휘도를 증가시키고 백라이트의 휘도를 감소시켰기 때문에, 최종적인 출력 영상 신호의 히스토 그램은 입력 영상 신호의 히스토그램과 거의 유사한 것을 알 수 있다. 즉, 상기 제4 종래기술에 의하면, 입력 영상 신호의 히스토그램에 적응적으로 영상 신호의 밝기를 상승시키며, 동시에 영상 신호 상승분에 반비례하게 백라이트의 휘도를 감소시킴으로써, 사용자가 밝기 손실을 인식하지 못 하면서도 디스플레이 장치의 전력 소비량을 감소시킬 수 있다. 한편, 상기 제5 종래기술 역시, 대부분의 전자 디바이스에서 밝은 백라이트가 현저하게 전력 소모를 하고, 전지 수명을 향상시키기 위해 백라이트의 레벨을 감소시키면, 판독성과 명료성도 감소된다는 일반적인 문제점을 해결 하기 위하여, 백라이트가 조정될 때 색 LCD 상에 관측가능한 화상의 최적화에 사용하기 위한 방법 및 장치를 제 안하고 있다. 상기 제5 종래기술은, 도 10에서 보는 바와 같이, 전자 디바이스에서의 사용을 위해 단순화된 디스플레이 장치 가 개시되는바, 상기 디스플레이 장치는 시각적 화상을 제공하기 위한 디스플레이, 디스플레이 를 조명하기 위해 백라이트의 강도를 결정하기 위한 프로세서, 및 백라이트의 강도에 따라 시각적 화상을 최적화하기 위해 디스플레이와 프로세서에 결합된 제어기를 가진다. 제어기는 입력과 출력을 갖는다. 출력은 다디스플레이를 구동하기 위한 중화된 접속 세트일 수 있다. 디스플레이는 대부분 화소 어레이를 형성하는 개별 화소들을 포함한다. 출력을 갖는 프로세서는 디스플레이를 조명하는 백라이트를 구동하기 위해 사용될 수 있다. 프로세서 는 백라이트의 레벨이나 강도를 통신하기 위해서 및 화소 데이터를 액세스하기 위해서 접속을 통해 제어기에 결합될 수 있다. 디스플레이 장치와 특정 전자 디바이스의 물리적 구성에 따라, 한 개 이상의 추 가 백라이트들이 채택될 수 있고, 또한 프로세서에 의해 구동될 수 있다. 프로세서와 제어기는 도시 된 것처럼 한 디바이스에 물리적이나 논리적으로 배치될 수 있다. 백라이트의 레벨은 어떤 형태의 사 용자 인터페이스를 통해 사용자에 의해 선택될 수 있거나, 다른 요인에 기초하여 프로세서에 의해 자동으 로 조정될 수 있다. LCD 디스플레이의 특성은 스크린이 화소라고 불리우는 작은 세그멘트들로 분리된다는 점이다. 화소 는 디스플레이의 해상도와 구성의 유형에 따라 크기가 달라질 수 있다. 각 픽셀의 색조(hue), 채도 (saturation), 및 밝기는 화소에 대한 적색, 녹색, 및 청색(\"RGB\") 하위 성분의 설정에 따라 대부분 결정 된다. 화소에 대한 RGB 설정을 조정하여, 색조와 채도만이 아니라, 명암도나 밝기도 설정될 수 있다. 어레 이의 픽셀들의 각각에 대한 적색, 청색, 및 녹색 설정들을 조정하여 시각적 화상이 최적화될 수 있다. 이상의 조정에서, 적색, 녹색, 및 청색 설정 사이에 일정한 스케일링을 유지하는 것은 화소의 색조와 채도 를 변경하지 않고 화소의 명암도, 밝기, 광도, 또는 휘도가 변경되도록 한다. 이것은 원래 설정들을 동일 한 스케일링 인자로 스케일링하거나 또는 각 명도를 동일한 퍼센트 증가로 증가시킴으로써 이루어질 수 있다. 색조와 채도를 유지하면서, 명암도, 밝기, 광도, 또는 휘도를 조정하기 위해 적색, 녹색, 및 청색의 설정들을 스케일링하기 위한 프로시져, 방법, 및 장치가 동일하므로, 밝기라는 용어는 화소 명도, 밝기, 광도, 또는 휘도 를 나타내기 위해 사용될 것이다. 이 LCD 디스플레이의 특성을 적용하여, 백라이트 레벨이 감소함에 따라 화소의 밝기를 증가시켜 화상이 최적화될 수 있다. 부연하면, 백라이트의 강도에 반비례하게 화소의 밝기를 조정하여 시각적 화상 이 최적화될 수 있다. 화상의 무결성은 화소 어레이의 각 화소의 색조와 채도를 유지하여 보존된다. 화소가 이미 비교적 높은 밝기를 가질 수 있고 백라이트의 강도가 감소되는 일례에서, 적색, 청색, 및 녹색 설정 중의 하나 이상은 최대 설정 이상으로의 조정이 요구될 것이다. 조명 목적으로, 화소에 대한 적색, 청색, 및 녹색 설정이 0 내지 255의 범위일 수 있다고 가정하자. 이 예에서, 적색은 200에 있고, 녹색은 150에 있고, 청색은 100에 있어서, 결과적으로 중간 브라운 색조가 된다. 최대 효과를 갖는 것으로서 실험적으 로 조정되는 것처럼, 백라이트 강도의 15% 감소(광, 광 센서, 또는 다른 메커니즘을 구동하는 전류에 의해 측정되는 것처럼)에는 대응하는 화소 밝기의 증가, 예를 들면 20% 증가가 후속된다. 20% 증가는 새로운 적 색, 녹색, 청색 명암도를 각각 240, 180, 및 120으로 결과적으로 되게 하고, 더 밝은 브라운 톤이 되며, 여전히 색조를 유지하면서, 더 높은 밝기를 제공한다. 그러나, 백라이트 강도가 35% 감소할 때, 화소의 명암 도는, 예를 들어, 대응하는 35% 높게 조정되어, 결과적 적색 값 270은 최대치를 초과할 것이다. 이들 예시에서, 적색 값이 255에 설정되어, (255-200)/200의 27.5%의 증가 비율을 설정할 수 있다. 남은 녹색과 청색 값은 각각 27.5% 증가되어, 적색, 녹색, 청색 각각에 255, 191, 및 128의 화소에 대한 최종 설정(전체 수에 반올림됨)을 제공한다. 이것은 여전히 브라운 색조이고, 그 색조를 유지하면서 이용가능한 가장 높은 밝기를 갖 는다. 즉, 최대 설정이 한계값을 초과할 때까지, 백라이트의 강도에 역으로 비례하게 적색, 녹색, 및 청색 설정 들이 조정된다. 그 다음, 그 설정은 최대치로 설정되고, 그 설정의 퍼센트 증가는 남은 설정을 증가시키기 위해 사용된다. 주어진 백라이트 레벨에서 화소가 한계값에 도달했음을 계산하는 능력은 백라이트 레벨을 조정하여 근접한 밝기 채도에 또는 그 근처를 지정하여, 전체 색 강도와 백라이트 레벨의 혼합을 제공하기 위해 사용될 수 있다. 이 비율 조정과 한계값의 사용은 또한, 백라이트 강도가 증가될 때, 어두운 색조(낮은 적색, 녹색, 청색 설정) 에 적용할 수도 있다. 대응하는 색조나 밝기의 감소는, 색 성분들이 모두 동등하게 감소되면, 임의의 색조의 효 과적 감소를 유발할 것이다(검정). 다시 말하면, 대비가 상실되고 제공된 임의의 화상이 단순히 검게 되는 시점 까지 휘도가 낮아지지 않도록 한계값이 적용될 수 있다. 이 경우, 낮은 한계값, 예를 들어, 50이 설정될 수 있 다. 더 밝은 백라이트로 조정할 때, 임의의 값이 50 이하로 감소될 때, 50 이하의 값은 50으로 설정될 것이고, 그 설정의 퍼센트 감소는 남은 설정의 값을 감소시키기 위해 사용될 것이다. 도 10으로 돌아가서, 백라이트 레벨 변화가 발생할 때, 제어기는 여러 방법들 중의 임의의 것을 사용 하여 화소 어레이의 화소를 위한 새로운 값을 계산할 수 있다. 예시적인 일 실시예에서, 제어기는 룩업테 이블(look up table)에 따른 고정값으로 화소 어레이의 모든 화소들을 조절하여 시각적 화상을 최적화할 수 있 다. 단지 설명 목적으로만 사용되는 일례로서, 룩업테이블에는 백라이트 레벨이 약 0%보다 큰 것에서부터 약 15%로 감소하는데 대해, 화소 밝기가 8% 내지 10%로 증가됨이 설명된다. 백라이트를 약 15%보다 큰 것 에서부터 약 25%로 감소하면 화소 휘도가 18% 내지 20% 증가된다. 이 같은 어떠한 조절도 상술한 최대값을 고려 하며 색조와 채도를 유지하면서 이루어질 수 있다. 혹은, 각 화소는 백라이트 강도의 변화에 기초하 여 그 화소에 대한 새 값을 실시간으로 계산하여 조절할 수 있고, 상술된 것처럼 백라이트 디스플레이 변 화를 위한 보상을 포함하거나 또는 포함하지 않을 것이다. 화소 어레이는 부분들로 분리될 수 있고, 그 부분에 대한 새 조절 값이 계산되어 그 화소들에 적용된다. 상기 제5 종래기술의 동작을 설명하면, 도 11에서 보는 바와 같이, 백라이트 강도, 또는 더 적절히는 백라이트 강도 변화를 우선 결정하여, 밝기 스케일 인자가 계산된다. 즉, 백라이트 강도에 따른 화상을 조절하 기 위한 인자가 결정되는바, 디스플레이에서 모든 화소들에 대해 일정치 밝기 스케일 인자가 결정될 수 있 다. 이는, 특정한 디스플레이 구성에 대해 경험적으로 구동될 수 있고 스케일링 인자의 실시간 계산을 가속하는 이득을 얻을 수 있는 미리 결정된 값들의 표에 따라 모든 화소들에 대해 일정치 밝기 스케일 인자가 결정 될 수 있다. 또한, 스케일 인자들의 제2 룩업테이블이 계산될 수 있고, 0에서 최대값까지 각 색 구성요소 값에 대한 엔트리를 포함한다. 또는, 스크린의 다른 영역들에서 백라이트 레벨의 변화가 설명될 수 있다. 밝기 스케 일링 인자가 결정된 후, 스크린의 일부의 백라이트 강도에 기초하여, 디스플레이의 그 부분의 화상을 조절하기 위해 제2 인자가 사용될 수 있다. 이것은 특히, 백라이트로부터의 광의 광학적 특성이나 비균일한 분포 때문에, 스크린의 일부 영역들은 항상 다른 영역들보다 더 밝게 되는 경우의 상황에 적용가능하다. 주어진 위치에서 백 라이트 강도의 변화 및 관찰된 강도의 변화 모두에 따른 밝기 조절은 디스플레이 뷰잉 영역에서 지각된 균일성 을 생성하도록 한다. 밝기 스케일링 인자의 결정시 추가 고려사항은 화상의 색조와 채도를 유지하는 것이다. 적색, 녹색, 및 청색의 원색들로 구성된 화소들로 특징지어지는 디스플레이에는, 세 가지 성분들의 각각을 비례하게 조절하여 디스플레이되는 화상의 색조와 채도를 유지하는 것이 행해진다. 화소 성분이나 색 구성요소에 대한 한계값이 결정된다. 한계값은 디스플레이 자체에 의해 부가된 것, 즉, 지원되는 최대 휘도 또는 밝기일 수 있거나, 또는 그것은 색 구별이나 관찰되는 색 채도를 위해 필요한 것으로 결정되는 낮은 값과 같은 실험적 한계값일 수도 있다. 스크린의 다른 영역들에 대해서는 한계값이 다를 수 있다. 상술한 것처럼, 스크린은 계산의 용이성을 위해 또는 백라이트 변동의 보상을 단순화하기 위해 섹션들로 분할될 수 있다. 색 구성요소 값들은 색 구성요소 한계값을 초과하는지를 보기 위해 테스트된다. 성분이나 색 구성요소 값 들 중의 임의의 것이 한계값을 초과하면, 적색, 녹색, 및 청색 성분들 중의 한 개 이상의 크기가 한계값을 초과 할 때, 가장 큰 양만큼 한계를 초과하는 설정이 최대값 또는 다른 미리 결정된 값으로 설정될 수 있다. 가 장 높은 원래 색 구성성분 값과 동일한 퍼센트 증가만큼 나머지 색 구성요소 값들에 대한 설정이 증가된다 . 한계 상황에서 밝기 값, 즉, 적색, 녹색, 및 청색 화소 설정들의 크기를 결정할 때, 화소의 원래 색조와 채도를 유지하는 것이 바람직하지만, 필수 사항은 아니다. 신속한 계산, 반올림 오류, 또는 표탐색 매칭 을 위해 엄격한 비례 조절의 변화가 이루어질 수 있다. 최대값들에 도달되고 비례성이 유지되지 않을 때와 같이, 정해진 한계값을 초과하는 설정이 없거나 또는 색조와 채도가 유지되지 않을 때, 도면부호 308의 아니오 분기가 뒤따른다. 화소의 화상에 적색, 녹색, 및 청색 설정의 새 값들이 적용되어 밝기 스케일 인자를 사용하여 화상을 조절한다. 제어기로부터의 디스플레 이 값들을 판독하고, 전체적으로 또는 부분적으로, 화상에서 동작하고, 그 다음, 제어기로 최적화된 데이 터를 다시 재기록한다. 디스플레이의 모든 화소나 섹션이 조절되었는지를 판정하기 위해 테스트가 수행된 다. 만약 그렇지 않다면, 프로세스는 도면부호 308에서 계속된다. 모든 프로세싱이 완료되면, 도면부호 318의 예 분기가 뒤따르고, 프로세싱을 종료한다. 적색, 녹색, 및 청색 성분의 크기의 새 값들은 디스플레이의 강도의 변경에 반비례하는 관계에서 계산된다 . 한편, '308' 단계에서의 판단 결과, 한계값들이 검사되지 않으면, 프로세싱은 도면부호 314로 계속된다. 그런데, 상기 제4 종래기술 및 제5 종래기술은, 휘도의 변경에 따른 픽셀 값의 조정을 행하는 개념에 대해서는 부분적으로 기재되어 있으나, 모니터 전체적인 절전 대책과 관련하여 전반적인 모니터 절전 대책과는 분리되어 있어, 실제 적용에는 한계가 있다. 다른 한편, 상기 제4 종래기술 및 제5 종래기술의 문제점을 개선하기 위하여, 본 발명자는, 제6 종래기술로서, 대한민국 특허 제1816249호 (모니터 휘도 보정을 통한 절전형 디스플레이의 제어 장치 및 방법) 을 제안한 바 있으며, 이에 대하여 도 12 내지 도 16을 참조하여 설명한다. 도 12는 제6 종래기술에 따른 모니터 휘도 보정을 통한 절전형 디스플레이의 제어 장치 및 주변 장치의 블록도 이고, 도 13은 제6 종래기술에 따른 모니터 휘도 보정을 통한 절전형 디스플레이의 제어 방법의 동작흐름도이고, 도 14는 제6 종래기술의 변형에 따른 모니터 휘도 보정을 통한 절전형 디스플레이의 제어 방법 의 동작흐름도이고, 도 15는 제6 종래기술에서의 PWM 방식에 의한 휘도 변조를 설명하는 개념도이며, 도 16은 제6 종래기술에서의 화소 데이터 보상을 설명하는 개념도이다. 제6 종래기술의 모니터 휘도 보정을 통한 절전형 디스플레이의 제어 장치는, 도 12에서 보는 바와 같이, 디스플 레이에 전원을 공급하는 SMPS, SMPS로부터의 전압을 인버팅하여 디스플레이 화면의 백 라이트로 동작하는 LCD 패널(미 도시됨)에 공급하는 인버터, 모니터의 동작을 제어하는 모니터 제어부, 메인 보드로부 터의 비디오 신호(모니터 신호)를 모니터 제어부로 제공하는 수신측 커넥터, 그리고 모니터의 동작 설정을 위한 버튼들로 이루어지는 키 컨트롤부를 포함하되, 상기 모니터 제어부는, 전체 제어부의 동작을 행하 는 MCU, 수신측 커넥터와 인터페이싱을 행하면서 SMPS로부터의 전원 공급 여부를 제어하는 디스플 레이 컨트롤러(30'), 인버터 및 LCD 패널과 인터페이싱을 행하면서 이들에 대한 제어를 행하는 LVDS 패널 인터페이스, 및 펌웨어를 포함하며, 이외에도 파워 관리자(Power management), OSD 및 플래시 메모리 등이 추가될 수 있다. 더 상세하게는, 상기 MCU는 전체 제어부의 동작을 행하는 주체로서, 펌웨어 및 플래시 메모리 그리고 키 컨트롤부와의 인터페이싱을 행하면서, 실제 제6 종래기술에서의 비디오 신호를 통한 각종 제어 동작을 수행하게 된다. 더욱이, 상기 수신측 커넥터(TMDS Rx)는, 메인 보드의 VGA와 같은 그래픽 컨트롤러와 인터페이싱하 는 송신측 커넥터(TMDS Tx)와, 일례로 TMDS(Transition Minimized Differential Signaling: 변화 최소화 차분 신호) 프로토콜에 따라 모니터 신호 (일례로 R. G. B.) 및 클럭 신호(SCL)를, 각각의 고유 채널 (Channel 0, 1, 2, Clock Channel)의 모니터 케이블을 통해, 전송받게 되는바, 상기 수신측 커넥터(TMDS Rx)는 수신 측 인코더 컨버터(40a) 및 PLL(40b)를 가지며, 이에 대응하여 상기 송신측 커넥터(TMDS Tx) 역시, 송신측 인코더 컨버터(19a) 및 PLL(19b)를 가지고 있다. 한편, 상기 SCL 신호와 역방향으로, 상기 그래픽 컨트롤러(1 8)로부터 모니터 데이터를 받은 디스플레이 컨트롤러(30')는, DDC 단자를 통해, 상기 그래픽 컨트롤러의 DDC 단자로, 모니터가 제대로인지 여부를 확인해 주는 신호(SDL)를 전송하여 에코백하게 된다. 일례로, R. G. B. 신호는 각각 8비트의 데이터일 수 있으며, 따라서 색상 파레트 정보는 총 24비트 데이터일 수 있고, 일례로 총 224=1600만개의 화소 파레트 정보를 갖게 된다. 특히, 상기 SMPS와 상기 인버터의 사이에는 제1 스위칭 소자가 삽입되며, 상기 제1 스위칭 소자 는 상기 MCU에 의해 제어되도록 함으로써, 결국 상기 MCU에 의해 상기 SMPS로부터 상기 인버터 로의 구동전원(19V)의 공급이 제어되도록 하며, 상기 SMPS와 상기 디스플레이 컨트롤러(30')의 사이에 도 제2 스위칭 소자가 삽입되며, 상기 제2 스위칭 소자 역시, 상기 MCU에 의해 제어되도록 함으로 써, 결국 상기 MCU에 의해 상기 SMPS로부터 상기 디스플레이 컨트롤러(30')로의 동작전원(5V)의 공급이 제어되도록 한다. 추가적으로, 상기 MCU는, 상기 SMPS로부터 상기 인버터로의 전원(19V) 제어를 행하도록 한다. 즉, 상기 SCL 신호를 'GPIO 4' 단자를 통해 파악한 슬립(Sleep) 모드에서, 상기 MCU는, 'GPIO 3' 단자를 통해 상기 제1 스위치 및 제2 스위치를 온/오프함으로서, 상기 인버터 및 디스플레이 컨트롤러(30')의 전원을 ON/OFF 시키며, 특히 MCU 스스로가 모니터 화면을 자체 분석하여 유저의 PC 사용이 아닌 경우로 판단하게 되는 경우에도 강제로 슬립 모드로 이행하도록 제어할 수도 있고, 더욱이 특정 시간 내에 웨이크업(Wake up) 신 호가 입력되지 않을 경우에는 펌웨어만을 제외하고 모두 비활성화시키는 최대 절전 모드로 이행하게 된다. 특히, 상기 모니터 신호의 화소 데이터가 상기 디스플레이 컨트롤러(30') 및 상기 LVDS 패널 인터페이스를 통해 상기 인버터 및 LCD 패널로 직접 인가되는 대신, 제6 종래기술에서는, 오리지널 화소 데이터(Original PIXEL data)가 상기 디스플레이 컨트롤러(30')의 'O_PIXEL' 단자를 통해 상기 MCU의 'GPIO 5' 의 단자로 입력된 다음, 제1 믹서(31a)를 통해 보정된 화소 데이터(PIXEL Correction data)가 'PIXEL_C' 단자를 통해 비 로소 인버터로 출력되어 진다. 유사하게, LCD 패널의 휘도 정보(Brightness)는 상기 LVDS 패널 인터페이스 로부터 상기 MCU의 'GPIO 6' 의 단자로 입력된 다음, 제2 믹서(31b)를 통해 변조된 휘도 정보 (Brightness Modulation)가 'BM' 단자를 통해 비로소 인버터로 출력되어 진다. 상기 제1 및 제2 믹서(31a, 31b)의 보정 및 변조 제어 신호는, 미리 설정된 룩업테이블을 참조하게 되는바, 룩업테이블이 위치하는 펌웨어 로부터 'GPIO 1' 단자를 통해 입력되어지며, 룩업테이블 정보로부터의 제어값에 의해 보정 및 변조가 이루 어진다. 이에 대해서는 도 15 및 도 16을 참조하여 후술한다. 부가적으로, 상기 MCU는, 키 컨트롤부의 키 컨트롤 신호를 'GPIO 2' 단자를 통해 받아들이거나, 역으 로 딥 슬립 모드 시에 'GPIO 2' 단자를 통해 키 컨트롤부의 전원 오프 버튼이 눌려지도록 하는 파워 오프 효과가 발생하도록 적절한 신호를 발생시킬 수도 있다. 이에 대해서는 본 발명자의 선출원 제2016-164287호 (딥 슬립 모드를 지원하는 절전형 모니터의 제어 장치 및 방법) 에 상세히 개시되어 있다. 따라서, 상기 슬립 모드가 되면 모니터 제어부는 펌웨어만을 동작시키는 0.3W 정도의 최소전원으로 입력신 호를 받을 수 있으며, 웨이크업 이벤트(wake up Event)가 들어오면 비로소 모니터 전원을 턴온시킨다. 즉, 슬립 모드로 이행하는 상기 트리거 신호는, 메인 모드로부터의 웨이크업 상태를 체크할 수 있는 펌웨어만이 활성화된 상태이며 (이때, 이를 인식할 수 있도록 상기 MCU는 상기 SMPS로부터 1.2V의 최소 동작전압을 인가받는다), 나머지 모니터 제어부 전체를 비활성화하는 상기 키 컨트롤부에서 유저가 파워 오프 버튼을 누르는 신호 (일례로 50ms 정도의 오프 신호) 와 동일한 신호가 된다. 한편, 데스크탑의 메인보드 상의 CPU 및 그래픽 컨트롤러에 의해 디스플레이의 수신측 커넥터로 출 력되는 비디오 신호 중에서, 클럭 신호는 동시에 상기 MCU에도 직결되는바, 따라서 컴퓨터의 메인 보드로부 터 VGA 신호에 의해 상기 MCU가 동작 개시 및 중지를 하도록 하는 것도 가능하며, 상기 펌웨어의 룩업테이 블에 따라, 이에 응하여 키 컨트롤부의 파워 스위치가 트리거되거나, 휘도 변조 및 화소 데이터 보정이 이루어 지도록 할 수도 있다. 아울러, 상기 스위칭 소자로의 제어신호는, MCU로부터 인가되어 지는바, 이는 다시 펌웨어나 키 컨 트롤과 함께 연동하여 지며, '슬립 모드'로 진입시, MCU는 상기 스위칭 소자로의 제어신호를 'H'로하여 상기 스위칭 소자가 턴오프되도록 함으로써, 상기 SMPS를 통해 상기 인버터로의 전원인가가 중단되도록 하 는 슬립 모드(S3 모드)로 이행하게 되며, 더욱이 최대 절전모드에서는 상기 펌웨어만을 제외하고 모니터 제 어부를 모두 비활성화시키는 최대 절전모드로 이행하게 된다. 이를 간단히 정리하자면, 비디오 신호 중의 클럭 신호가 없거나 유저가 모니터 사용을 하지 않을 시에는 모니터 'off' 상태가 유지되며, 그 후에도 계속해 서 웨이크 업이 일어나지 않을 시에는 모니터 파워 버튼을 완전히 오프하도록 하며, 한편 동작 중에라도 화면의 변화가 별로 없을 시에는 어두운 화소의 휘도를 감소시켜서 전원을 절약하도록 한다. 이제, 상기 모니터 제어부의 동작을 도 13 및 도 14 를 참조하여 더 상세히 설명한다. 우선, 상기 모니터 제어부의 기본 동작을 도 13 을 참조하여 설명하면, 제6 종래기술의 모니터 휘도 보정을 통 한 절전형 디스플레이의 제어 방법은, 모니터 전원이 '턴온' 되면(S10), 모니터 부팅을 행하게 되는바(S11), 먼 저 모니터 화면의 화면 변화율 분석을 실행하게 된다(S30). 일례로 모니터 화면 변화가 초당 30 프레임(frame) 이하인지 여부를 체크하게 된다. 이는, 모니터가 동영상 실행인지 여부를 체크하기 위함이며, 동영상 실행 중에 는 휘도 감쇠의 의미가 없기 때문에, 먼저 휘도 감쇠를 행하기 전에 이를 체크하게 된다. 그리하여, 상기 S30의 판단 결과, 화면 변화가 초당 10 프레임 이하가 아니면 (동영상 실행이라고 판단되면), 계속해서 체크하고, 화면 변화가 초당 10 프레임 이하이면 (동영상 실행이 아니라고 판단되면), 이제 일정 이하 의 밝기일 경우, 휘도의 밝기를 지시하는 PWM 신호에 대해, 펌웨어 상의 룩업테이블에 기하여 제2 믹서 (31b)에서 휘도 값 데이터를 변조하여, 변조된 휘도 값을 인버터를 통하거나 아니면 직접 LCD 패널로 출력 하여, 휘도를 떨어뜨리는 제어를 행하게 된다(S31). 이때, 바람직하게는 \"Bright\" 신호의 진폭 변조 방식보다는 펄스폭 변조 방식을 택하는바, 제어가 용이하기 때문이며, 일례로 듀티비를 50% 로 하여 휘도를 50% 떨어뜨리는 PWM 방식에 대하여, 도 15에서 예시하고 있다. 다만, 이 50%는 예시에 불과하고, 오리지날 화소 데이터의 밝기 를 고려하여 3단계로 휘도를 떨어뜨리도록 룩업테이블을 작성할 수도 있다. 동시에, 오리지날 입력 화상의 화소 데이터(O_PIXEL)를, 백 라이트의 휘도 변조에 따라 보상하여 주어야 하는바, 즉, 백라이트의 휘도 변조(BM) 후에는 휘도가 감소하기 때문에 디스플레이 된 이미지의 휘도도 감소하 게 되므로, 표시되는 픽셀의 휘도 저하를 보상하기 위해 화소 데이터의 화소 보상(PIXEL_C)을 해 주게 된다 (S32). 예를들어, 도 16의 (b)에서 보는 바와 같이, 오리지날 입력 화소 데이터는 'C' 컬러를 표현하여야 하는 것이었 으나, 에너지 절약을 위하여, 50% 정도 휘도를 떨어드리게 되면, 'C' 컬러가 디스플레이되어 버려, 실제보다 더 어두운 컬러가 출력되어 버릴 것이므로, 보정되는 화소 데이터는 오리지날 입력 화소 데이터(일례로, R=1111111, G=0, B=0) 보다 더 밝은 'D' 컬러를 표현하는 보정되는 화소 데이터(일례로, R=1111110, G=0, B= 0)로 보정하여 출력하게 된다. 이는 컬러 파레트 및 디스플레이의 특성을 고려하여 미리 룩업테이블에 보정값을 저장하여 둔 후에, 이를 활용하면 된다. 유사하게, 원래 오리지날 입력 화소 데이터는 'A' 컬러를 표현하여야 하는 것이었으나, 에너지 절약을 위하여, 25% 정도 휘도를 떨어드리게 되면, 'B' 컬러가 디스플레이되어 버려, 실제보다 더 어두운 컬러가 출력되어 버릴 것이므로, 보정되는 화소 데이터는 오리지날 입력 화소 데이터 보다 더 밝은 'A' 컬러를 표현하는 보정되는 화소 데이터로 보정하여 출력하게 된다. 결국, 더 어둡게 변조된 휘도와 보정된 화소 데이터에 의해 광 차단이 덜 되는 보정된 화소 제어가 이루어지게 되므로, 백라이트를 덜 켜므로서 에너지를 절약하면서도 동일한 색상의 화소가 모니터에 표시 되어진다. 다만, 이상의 휘도 제어는 동영상 출력 중이 아닐 것과, 또한 어느 정도 어두운 화소이여야 할 것이 요구되는바, 극단적으로 아주 밝은 화소 데이터에 대해서는 밝은 휘도 하에서도 화소 데이터가 최대로 열려져야 하는 것일 것이므로, 휘도를 어둡게 하면 화소 데이터의 보정을 통해 동일한 색상을 디스플레이할 수 없기 때문 이다. 역시 이에 대한 룩업테이블 역시, 미리 작성되어 있을 것을 필요로 한다. 이후, 모니터 끄기인가 여부를 판단하여(S60), 그렇지 않으면 계속해서 체크하고, 모니터 끄기인 것으로 판단되 면, MCU는 'GPIO 3'을 'Low'로 하여, 제1 및 제2 스위치(51, 61)를 모두 오프시켜, SMPS로부터 출력되 는 전원을 모두 차단함으로써, 최소한의 대기 전원(PIO 1.2V)을 제외한 모든 동작 전원이 오프되도록 한다. 다시, 일정 시간 간격으로, 메인 보드로부터 웨이크업이 발생하였는지 여부를 체크하는바(S80), 웨이크업이 발생한 것으로 판단되며, 상기 S30 단계로 리턴하여 다시 시작하고, 그렇지 않으면, 'GPIO 2' 단자를 '로우'로 하여, 키 컨트롤부의 파워 스위치가 오프된 것처럼 파워 제어 신호가 인가되도록 함으로써, 디스플레이를 완전 오프시키게 된다.이제, 도 14를 참조하여, 제6 종래기술의 변형예에 대하여 상세히 설명한다. 먼저, 본 변형예에서는, 모니터 전원이 '턴온' 되면(S10), 메인 보드의 그래픽 컨트롤러로부터의 클럭 신호 (SCL 신호) 가 오프인지 여부를 MCU의 'GPIO 4' 단자를 통해 체크하게 되는바(S20), 클럭 신호 (SCL 신호) 가 오프이면 상기 S70 단계로 이행하여, 'GPIO 3' 단자를 통해, 바로 전원을 오프하게 되며, 그냥 종료하 거나 도 13의 S80 단계 및 S90 단계를 이행하여 종료하거나 할 수 있다. 이후, 도 13에서와 같이, 모니터 화면의 화면 변화율 분석을 실행하여 동영상 실행 여부를 체크하게 된다(S30). 역시, 상기 S30의 판단 결과, 화면 변화가 초당 10 프레임 이하가 아니면 (동영상 실행이라고 판단되면), 계속 해서 체크하고, 화면 변화가 초당 10 프레임 이하이면 (동영상 실행이 아니라고 판단되면), 이제 일정 이하의 밝기일 경우, 휘도의 밝기를 지시하는 PWM 신호에 대해, 펌웨어 상의 룩업테이블에 기하여 제2 믹서(31b)에 서 휘도 값 데이터를 변조하여, 변조된 휘도 값을 인버터를 통하거나 아니면 직접 LCD 패널로 출력하여, 휘 도를 떨어뜨리는 제어를 행하게 된다. 동시에, 오리지날 입력 화상의 화소 데이터(O_PIXEL)를, 백 라이트의 휘도 변조에 따라 보상하여 주어, 백라이 트의 휘도 변조(BM) 후에 디스플레이 된 이미지의 휘도 감소를 보상하기 위한 화소 데이터의 화소 보상 (PIXEL_C)을 해 주게 된다(S32). 이제, 도 13과 달리, 유저가 모니터를 사용 중인가 여부를 판단하게 되는바(S40 ~ SS51), 우선, 반복 회수 체크 용 파라미터 N 및 Y를 '1'로 초기화한다(S40). 이후, 모니터의 전체 화면을 캡쳐 후 저장하고(S41), 변화 화면을 캡쳐 후 저장하는바(S42), 이때 모니터 전체 를 모두 캡쳐 및 저장할 수도 있고, 일부만을 (K번째 행 및 K번째 열의 픽셀만을) 캡쳐 및 저장할 수 있다. 후 자의 경우, K배수 픽셀의 변화가 있는지 여부를 체크하여(S43), 없으면 계속해서 체크하고, 있으면, 화면 변화 가 x% 이하인지? (일례로 20% 이하인지?) 여부를 판단하게 된다(S44). 상기 S44 단계에서의 판단 결과, x% 이하이면 S30 단계로 리턴하여 동영상 실행인지 여부부터 다시 시작하고, 변화가 일어난 화소가 일정 비율(x%) 초과이면 (일례로 20% 이상의 화소가 변화되었으면), 전체 화면의 사용 중 으로 판단하게 되며, 이제 화면 변화가 초당 10 프레임 이상인지 여부를 다시 체크하게 된다(S45). 그리하여, 화면 변화가 초당 10 프레임 이상이면 동영상을 실행하는 것이므로, 역시 S30 단계로 리턴하고, 화면 변화가 초당 10 프레임 미만이면 일단 동영상 실행은 아니라고 판단하여, 이후 화면 변화에 반복적인 것이 있는 가? 여부를 판단하게 된다(S46). 상기 S46 단계에서의 판단 결과, 화면 변화에 반복적인 것이 있으면, 플래시 광고 실행으로 판단하는바, 계속해 서 화면 변화가 가로 방향으로 지속되는가? 여부를 판단하게 되며(S47), S47 단계에서와 같이 체크하는 이유는 유저가 문자를 천천히 타이핑하는 경우라면 화면의 변화가 그다지 많지 않아도 유저가 컴퓨터를 사용중인 것이 기 때문에 모니터를 정지시키지 않아야 하기 때문이다. 만약, 상기 S47 단계에서의 판단 결과, 화면 변화가 가로 방향으로 지속되는 경우이면, 역시 상기 S30 단계로 리턴하여 처음부터 계속해서 실행하고, 화면 변화가 가로 방향으로 지속되는 경우가 아니면, 파라미터 'N'를 인 크리먼트한 후(S48), 'N>No 인지' (일례로 No=15) 여부를 체크하여(S49), 일정 회수 (일례로 15회) 반복이 아니 면, S42 단계로 리턴하여, S42 내지 S49 단계를 일정 회수 (일례로 15회) 에 이를 때까지 반복해서 수행하고, 상기 S49 단계에서의 판단 결과, 'N>No 이면' (일례로 No>15 이면), S70 단계로 진행하여 MCU의 'GPIO 3' 단자의 출력을 'Low'로 하여 모니터 전원을 오프시킨다. 이후의 프로세스는 도 13의 S80 및 S90 단계로 진행할 수도 있고, 바로 종료할 수도 있다. 특히, 상기 S46 단계에서의 판단 결과, 화면 변화에 반복적인 것이 없으면, 화면 변화가 거의 없고 동영상 실행 도 아니며 플래시 광고도 아니므로,역시 S70 단계로 진행하여 MCU의 'GPIO 3' 단자의 출력을 'Low'로 하여 모니터 전원을 오프시킨다. 한편, 상기 S49 단계에서의 판단 결과, 한 번의 체크만으로는 오류가 있을 수 있으므로, 또다른 파라미터 'Y'를 인크리먼트 하여(S50), 'Y'가 일정 기준값 Yo (일례로 Yo=10) 회수 만큼 반복한 후에, 비로소 Yo 회수 만큼 반 복한 경우에도 모니터 사용이 아니라고 판단되는 경우에만 MCU의 'GPIO 3' 단자의 출력을 'Low'로 하여 모 니터 전원을 오프시키고, 그렇지 않은 경우에는 상기 S41 단계로 리턴하여 S41 내지 S51 단계를 반복해서 수행 하는 것이 더욱 바람직하다.참고로, 파워 전원 '턴오프' 상태이더라도, 모니터 전원 플러그를 뽑은 상태가 아니라면 모니터에 전원을 공급 하기 위한 SMPS에 여전히 전원이 연결된 상태이므로, 0.3W 정도의 전력은 소비하게 되는바, 이는 사용자가 최종 적으로 모니터 전원 플러그를 뽑은 상태와는 상이하며, 다만, 이 정도의 전력 소비는 거의 무시해도 되는 정도 이다. 따라서, 종래의 모니터 제어부의 경우에는 슬립 모드에서도 1.4W의 소비전력이 소비되었으나, 이상의 제6 종래 기술의 모니터 휘도 보정을 통한 절전형 디스플레이의 제어 방법에 의하면, 최대 절전 모드에서, 기존의 모니터 의 소비전력이, 1.4W 정도에서 0.3W까지로 줄어들어, PC 1대당 약 1.1W 정도를 절약할 수 있게 되었으며, 게다 가 모니터 사용 중이라도 실제 모니터에 표시되는 색상을 변화시키지 않으면서도, 모니터 전원의 대부분을 차지 하는 LCD 패널의 파워를 절반 정도로 줄여서, 상시적으로도 에너지를 절약할 수 있게 된다. 상기 제6 종래기술의 경우, 최대 절전 모드에서는 물론, 모니터 사용 중이라도 화면 변화 상태에 따라서 실제 모니터에 표시되는 색상을 변화시키지 않으면서 모니터 전원의 대부분을 차지하는 LCD 패널의 파워를 줄여서 상 시적으로도 에너지를 절약할 수 있게 된다는 장점이 있기는 하지만, 이상의 화면 변화 상태를 모니터 측에서 화 면 캡쳐를 통해 판단하게 되므로 컴퓨터 본체 상의 사용량을 충분히 반영하지 못하는 상황이 발생되고, 일정 기 준을 일률적으로 정해서 절전을 행하게 되는 경우에는 유저마다 사용 패턴이 다르기 때문에, 사용 패턴이 상이 한 본인의 의도와 무관하게 절전이 행하여져 버리게 되므로 유저들은 불편을 느끼게 되고, 더 이상 그러한 절전 동작을 꺼버리고 컴퓨터를 사용하게 되는 경우가 많았다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허공개 제2013-0109060호 (컴퓨터 및 컴퓨터 주변기기의 대기전력 차단 장치) (특허문헌 0002) 대한민국 특허공개 제2015-0123435호 (컴퓨터 연동을 통한 모니터 대기전력 차단장치) (특허문헌 0003) 대한민국 특허공개 제10-2012-0108479호 (백라이트 유닛) (특허문헌 0004) 대한민국 특허공개 제10-2008-0081511호 (입력 영상의 히스토그램에 기반한 디스플레이 장치의 전력제어 방법 및 장치 및 디스플레이 장치) (특허문헌 0005) 대한민국 특허공개 제10-2006-0120673호 (백릿 디스플레이의 화상 최적화를 위한 방법 및 장치) (특허문헌 0006) 대한민국 특허 제1816249호 (모니터 휘도 보정을 통한 절전형 디스플레이의 제어 장치 및 방법)"}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 상기 제1 및 제2 종래기술의 문제점에 대한 대책으로서의 모니터 절전 대책을 강구하면서, 거기에다 가 제3 내지 제6 종래기술의 문제점에 대한 대책까지를 총체적으로 세움으로써, 실질적인 모니터 절전이 가능하 되, 특히 인공지능에 의한 딥러닝 학습 방법을 적용하여 각 유저에게 최적화된 절전 동작을 행하도록 하는 객체 인식기반의 전력저감 모니터 및 그 제어방법을 제공하는 것이다."}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위한 본 발명의 일 측면에 따른 모니터 절전제어 시스템은, 모니터 제어부를 갖는 객체 인식기반의 전력저감 모니터 및 모니터 신호발생 장치를 포함하는 모니터 절전제어 시스템으로서, 상기 모니터 신호발생 장치는, (a) 사용자의 컴퓨터 정보 및 모니터 정보를 읽어서(S11), 모니터 핸들 값 정보를 획득하는 단계(S12); (b) 상기 (a) 단계 이후, 사용자의 화면을 캡처하는 함수를 만들어 일정 주기가 지나면 화면캡처를 수행할 수 있게끔 구성함으로써, 화면 캡처를 진행하는 단계(S13); (c) 상기 (b) 단계 이후, 화면을 모델 인풋 에 맞게끔 resize를 진행할 수 있는 함수를 구성하여, 캡처된 화면의 리사이즈를 진행하게 되는 단계(S14); (d)상기 (c) 단계 이후, resize된 화면은 모델의 입력단으로 들어가게 되며, 모델의 아웃풋은 각 객체의 label과 좌표값을 추출(inference)하게 되며(S15), 전처리된 화면 이미지는 학습된 객체인식모델(MobileNet-SSD) 모델을 활용하여 분석이 시행되고, 화면 분석 결과 현재 사용자 화면에서 창들의 위치와 밝기 패턴값을 추출하게 되는 단계(S16); (e) 상기 (d) 단계 이후, 상기 밝기 패턴값들의 평균값을 산출하는 단계(S17); 및 (f) 상기 (e) 단 계 이후, 상기 밝기 패턴값들의 평균값을 기반으로 모니터 밝기 제어값을 산출하는 단계(S18); 를 수행하고, 상 기 모니터 제어부는, 상기 모니터 밝기 제어값에 따라 모니터 백라이트를 제어하는 것을 특징으로 한다. 또한, 상기의 목적을 달성하기 위한 본 발명의 다른 측면에 따른 객체인식기반의 전력저감 모니터의 제어방법은, (a) 사용자의 컴퓨터 정보 및 모니터 정보를 읽어서(S11), 모니터 핸들 값 정보를 획득하는 단계 (S12); (b) 상기 (a) 단계 이후, 사용자의 화면을 캡처하는 함수를 만들어 일정 주기가 지나면 화면캡처를 수행 할 수 있게끔 구성함으로써, 화면 캡처를 진행하는 단계(S13); (c) 상기 (b) 단계 이후, 화면을 모델 인풋에 맞 게끔 resize를 진행할 수 있는 함수를 구성하여, 캡처된 화면의 리사이즈를 진행하게 되는 단계(S14); (d) 상기 (c) 단계 이후, resize된 화면은 모델의 입력단으로 들어가게 되며, 모델의 아웃풋은 각 객체의 label과 좌표값 을 추출(inference)하게 되며(S15), 전처리된 화면 이미지는 학습된 객체인식모델(MobileNet-SSD) 모델을 활용 하여 분석이 시행되고, 화면 분석 결과 현재 사용자 화면에서 창들의 위치와 밝기 패턴값을 추출하게 되는 단계 (S16); (e) 상기 (d) 단계 이후, 상기 밝기 패턴값들의 평균값을 산출하는 단계(S17); (f) 상기 (e) 단계 이후, 상기 밝기 패턴값들의 평균값을 기반으로 모니터 밝기 제어값을 산출하는 단계(S18); 및 (h) 상기 (f) 단계 이 후, 상기 모니터 밝기 제어값에 따라 모니터를 제어하는 단계(S20); 를 포함하는 것을 특징으로 하는 객체인식 기반의 전력저감 컴퓨터의 제어 방법. 바람직하게는, 상기 밝기 패턴값은, '화이트 패턴'의 '0 단계' 에서부터 '블랙 패턴'의 '4 단계' 까지, 다섯 단 계로 분류되는 것을 특징으로 한다. 더욱 바람직하게는, 상기 (h) 단계는, (h1) 상기 (f) 단계에서 산출된 모니터 밝기 제어값을 DDC-CI를 통해 모 니터 제어부로 전송하는 단계(S21)와, (h2) 상기 (h1) 단계 이후, 모니터 제어부는 상기 모니터 밝기 제어값에 따라서 백라이트 밝기를 조절하게 되는 단계(S22)와, (h3) 상기 (h2) 단계 이후, 각 픽셀의 픽셀 값을 보정하여 자연스러운 영상이 모니터로 디스플레이 되도록 하는 단계(S23)로 이루어지는 것을 특징으로 한다."}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 객체인식기반의 전력저감 모니터 및 그 제어방법에 따르면, 화면을 캡처(Capture)하여 딥러닝 모델을 이용하여 화면을 분석한 후 현재 사용자가 사용하는 창들을 감지한 다음 창들에 대한 밝기 단계를 추출 하여, 밝기 단계들을 종합 후 모니터 백라이트 조절하는 방법으로서, 사용자의 별도 조작 없이 현재 하고 있는 화면을 캡처(Capture)하여 인공지능 모델을 활용하여 분석을 한 후 사용자가 사용하고 있는 창들을 감지하여 각 창들에 대한 밝기 단계를 추출하는 것이 가능하다는 장점이 있다. 또한, 종전의 인공지능 기반의 컴퓨터 전력 저감기술에서 사용한 이미지를 통해 단순한 화면 밝기에 대한 분류 (Classification) 방법이 아니라, 객체 탐지(Object Detection) 방법을 사용하여, 여러 개의 창이 실행되고 있 을 때도 각 창에 대한 탐지를 하여 각 창들의 밝기 단계를 추출하도록 구성하는 것이 가능하다. 상기 목적 및 효과 외에 본 발명의 다른 목적 및 이점들은 첨부한 도면을 참조한 실시예에 대한 상세한 설명을 통하여 명백하게 드러나게 될 것이다."}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 첨부도면을 참고하여 본 발명에 따른 바람직한 실시예를 상세하게 설명하기로 한다. 도 17은 본 발명의 객체인식기반의 전력저감 모니터의 제어방법의 사전 작업으로서 인공지능 모델 학습의 흐름 도이고, 도 18은, 도 17의 데이터 캡처 및 수집 단계에서 캡처된 모니터 화면의 예이고, 도 19는, 도 17의 데이 터 캡처 및 수집 단계에서 수집된 모니터 화면의 예이고, 도 20은, 도 17의 이미지 리사이즈 단계를 설명하는 도면이고, 도 21은, 도 17의 데이터 분석 및 레이블링 단계에서 레이블링 작업 및 레이블링 데이터의 예이며, 도 22는, 도 17의 딥러닝 모델 학습 평가에서의 손실함수의 그래프이다. 도 23은 본 발명의 객체인식기반의 전력저감 모니터의 제어방법의 전체 흐름도이고, 도 24는, 도 23의 DDC-CI를 통한 모니터 제어 단계의 상세 흐름도이고, 도 25는, 도 23의 객체인식모델을 사용하여 분석을 행한 결과 화면 이며, 도 26은, 도 23의 객체인식모델을 사용하기 위해 캡처한 결과 화면 및 RGB 밝기 패턴값이다. 도 27은 본 발명의 객체인식기반의 전력저감 모니터의 GUI 구성의 예이고, 도 28a 내지 도 28i 는, 실제 화면 캡처 및 분석 결과의 예시를 보여주는 도면이다."}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다만, 첨부된 도면은 본 발명의 내용을 보다 쉽게 개시하기 위하여 설명되는 것일 뿐, 본 발명의 범위가 첨부된 도면의 범위로 한정되는 것이 아님은 당해 기술 분야의 통상의 지식을 가진 자라면 용이하게 알 수 있을것이다. (본 발명의 실시예) 우선, 본 발명의 최적 실시예에 따른 객체인식기반의 전력저감 모니터의 제어방법은, 딥러닝에 기초한 인공지능 모델 학습에 따라서, 모델링 및 레이블링이 이루어져야 한다. 그리고, 본 발명에 따른 모니터 절전 시스템은, 화면을 캡처(Capture)하여 딥러닝 모델을 이용하여 화면을 분석 한 후 딥러닝으로 학습된 모델을 이용하여서 적합한 모니터 밝기 단계를 도출하도록 한다. 즉, 사용자가 직접 모니터 밝기를 조절하려면 어느 정도의 숙련자가 아닌 이상 직접 조정하기가 어렵고 숙련자라 할지라도 수시로 모니터를 조정하기에는 불편함이 있는바, 개인용 컴퓨터에서 사용자가 실행하는 응용 프로그램이나 컨텐츠에 의 해 실행되는 작업 내용에 따라 인공지능이 모니터를 적절한 밝기로 조절하여, 사용자가 모니터를 볼 때 불편하 지 않으면서도 불필요한 전력을 절감할 수 있는 기술이다. 즉, 화면을 캡처(Capture)하여 딥러닝 모델을 이용하여 화면을 분석한 후 현재 사용자가 사용하는 창들을 감지 한 다음 창들에 대한 밝기 단계를 추출하여, 밝기 단계들을 종합 후 모니터 백라이트 조절하도록 하는 것이다. 아울러, 사용자의 별도 조작 없이 현재 실행하고 있는 화면을 캡처(Capture)하여 인공지능 모델을 활용하여 분 석을 한 후, 현재 사용자가 사용하는 창(윈도우)의 개수와 평균 밝기 정보를 같이 추출하는바, 참고로 도 25에 서 탐지된 창의 수는 3개이고, 평균 밝기 단계는 '1' 이다. 특히, 본 발명의 경우에는, 인공지능 기반의 모니터 전력 저감기술에서 사용한 이미지를 통해 단순한 분류(Classification) 방법이 아니라 객체 탐지(Object Detection) 방법을 사용하여 여러 개의 창이 실행되고 있을 때도, 탐지된 창의 수와 각 창들의 밝기 단계들이 추출이 되면 평균 밝기 단계 계산하고, 파악된 평균 밝기 단계에 맞추어 모니터의 backlight를 조절하고 그에 따라 픽셀 값들을 보정하게 된다. 즉, 별도의 조작 없이도 사용자가 화면에서 사용하고 있는 윈도우 창들의 패턴에 따른 평균 밝기에 따라 모니터 의 백라이트 및 픽셀값을 조절함으로써, 사용자가 사용하는데 큰 불편함 없이 불필요한 모니터 전력을 감소시키 는 것이 특징이다. 추가적으로, 데이터 구성을 다양화하여, 직접 수집한 데이터뿐만 아니라 수요처에서 얻은 데이터도 학습에 이용 하여 범용성을 높이도록 한다. 그리하여, 본 발명에 의하면, 객체 탐지 알고리즘을 적용하고, 실행 창들의 평균 밝기 단계 체크 기술을 추가하 며, 데이터 다양화를 통해, 다양한 환경과 작업상태, 컴퓨터 모델에 적용이 가능한 기술인바, 인공지능 모델을 활용하여, 최적으로 소비전력 절감을 도모하는 것이다. 추가적으로, CNN의 'ResNet50' 알고리즘을 사용하는 경우에는 일례로 2300만개 정도의 파라미터를 학습하여야 하는 관계로 프로그램 로딩이 많이 걸리나, 'Mobilenet-SSD'의 경우에는 540만개 정도의 파라미터를 학습하여 충분하므로 모델의 경량화가 가능하며, 인공지능 모델의 연산량이 1/4가량 줄어들므로, 'Mobilenet-SSD'의 경우 가 보다 바람직하며, 이로 인하여 모델 추론을 할 때 사용 전력량이 줄어들게 되고 당사의 프로그램 부하가 줄 어들게 되며, 속도 개선이 이루어질 수 있다. 보다 구체적으로, 도 17을 주로 참조하고, 도 18 내지 도 22를 보조적으로 참조하여, 본 발명의 객체인식기반의 전력저감 모니터의 제어방법의 사전 작업으로서 인공지능 모델 학습 방법을 설명하면, 도 17에서 보는 바와 같 이, 데이터 캡처 및 수집을 행하게 된다(S1). 즉, 도 18에서 보는 바와 같이, 직접 모델 학습을 진행하기 위해 데이터 수집 프로그램을 개발하였는바, 이에 의해 사무 환경은 듀얼 모니터 사용이 많기 때문에 모니터의 정보 를 받아와 사용 모니터 개수 파악 및 해상도 정보를 파악하며, 사용화면 이미지 외에도 현재 프로세서의 이름, CPU 사용량, 메모리 사용량, 키보드 마우스 입력 횟수, 화면 사이즈 등의 정보를 CSV 형태로 저장하게 된다. 도 12의 (a) 내지 (c)에는, 직접 캡처한 모니터 화면의 저장된 파일들이 예시되어 있다. 더욱이, 그러한 수집 프로그램을 배포하여 꾸준한 데이터 수집을 진행하며, 협의가 되는 수요처에 배포를 하여 수요처가 사용하는 프로그램, 화면 정보, 사용화면 이미지, CPU 사용량 등의 정보 수집 진행하게 된다. 도 13에는, 회사 및 수요처를 대상으로 지속적으로 수집된 여러가지 데이터로서, 모니터 화면의 저장된 파일들 이 예시되어 있다. 이후, 선택적으로 수집된 이미지 리사이즈(Resize)를 수행하게 되는바(S2), 일례로, 캡처된 이미지는 학습하기 에는 너무 크기 때문에 일례로 1920x1080 사이즈를 224x224 으로 리사이즈를 진행하게 된다. 즉, 학습을 하기위해서 사용되는 이미지들은 모니터의 해상도 만큼의 size이기 때문에 학습 모델 입력으로는 너무 커서 적절하 지 않으므로, 리사이징 작업을 통해 이미지들을 줄여 주는 것이 좋다. 이후, 데이터 분석 및 레이블링을 행하게 되는바(S3), 수집된 데이터를 분석하여 정리하고 학습에 필요한 데이 터를 추출하며, 학습을 위해 추출된 데이터의 레이블링을 행하게 된다. 일례로, 본 실시 예에서 학습용으로 구성한 데이터들은, training data set 과 validation data set, 및 test data set 의 세 가지로 구분하여 구성을 하였다. 이들 각 set의 목적 및 개수는 다음 [표 1]에서와 같다. 표 1 컴퓨터 학습 데이터 셋(10,409개) Training data set Validation data set Test data set 9454개 423개 532개 데이터 학습을 위함 학습 중간 평가를 위함 모델을 평가하기 위함 참고로, 상기 예의 경우, 사무 환경에서 데이터를 수집하였기 때문에 사용자가 회의나 자리를 비운 상황일 경우 같은 패턴의 데이터가 수집될 수 있으며, 같은 데이터는 모델 학습을 진행할 때 과적합(Over-fitting) 문제를 일으킬 수 있기 때문에 데이터 정리가 필요하다. 저장된 CSV 파일을 이용하여 마우스 입력과 키보드 입력 횟수 가 없을 경우에는 사용자가 자리를 비웠다고 판단하고 그때의 이미지는 제외한다. 최근 사무환경은 Window 10 과 Window 11의 환경이므로 Window 10에서 수집된 데이터와 Window 11 수집된 데이터 분류를 시행하였는바, 정 리 결과 Window 10 환경에서는 13,981개의 데이터를 추출하였고 Window 11 환경에서는 10409개의 데이터를 사용 하여 학습에 이용하였다. 데이터 분석과 함께, 객체 인식 모델을 적용하기 위해 추출된 데이터의 레이블링 작업을 시행되어야 하는바, 화 면에서 객체가 있는 영역의 좌표 값, 즉 x_min, x_max, y_min, y_max의 좌표 값과 그 영역의 작업 상태가 무엇 인지 label 작업을 시행한 후, 좌표값과 작업 상태 label은 일례로 xml 형태로 저장되며, 화면 밝기 패턴 label 은 일례로 0에서 4 단계로 분류될 수 있다. 즉, '0 단계'는 도 26의 (a)에서 보는 바와 같은 '화이트 패턴'이고, '4 단계'는 도 26의 (b)에서 보는 바와 같은 '블랙 패턴'이며, 도 26의 (c)에서와 같이 그 사이의 패턴은 '1 단계' 에서 '3 단계'로 적절히 분류되도록 한다. 도 21의 (a) 및 (b)는 레이블링 작업의 예를 보여주고, 도 21의 (c)는 레이블링 데이터를 저장한 상태를 보여주 고 있다. 이후, 레이블링된 데이터들을 이용하여 딥러닝 모델을 선정한 후, 딥러닝 모델 학습을 진행하게 된다(S4). 일례 로, 전처리된 (즉, resize된) 화면 이미지는 학습된 객체인식모델(MobileNet-SSD) 모델을 활용하여 분석이 시행 되는바, 즉, 전처리된 화면 이미지와 그에 대응하는 Label들은 객체 인식을 위한 Model인 Mobilenet SSD를 활용 하여 학습을 진행을 하고, 현재 사용자 화면에서 윈도우 창의 좌표값과, 그 창의 작업 상태를 학습에 이용하게 된다. 일례로, 모델 학습을 위해 Backbone network로 Mobilenet을 활용하는바, 구글 연구진들이 만든 MobileNet은 자 원이 열악한 모바일 환경에서도 문제없이 실행될 수 있도록 만든 Network 이다. 이때, Depthwise separable convolution이라는 일반적인 convolution 연산과 비교하여 연산량을 많이 줄일 수 있는 방법을 사용하였으며, Bottlenect 접근을 통해 연산량을 줄이면서도 정확도를 유지할 수 있었다. 또한, 유명한 CNN(Convolutional Neural Network)인 GoogleNet, VGG16, ResNet과 비교하여도 성능이 크게 감소하지 않으며, 적은 파라미터를 사 용하여 연산량이 적다는 것이 확인되었으며, 본 실시예에서는, 기존 기술에서 활용되었던 ResNet이 가지고 있었 던 연산량이 많아 프로그램 로딩이 많이 걸리며 inference 속도가 오래 걸리는 문제를 개선하고자, Mobilenet을 활용하여 학습을 진행하였다. 더욱이, 사용자가 모니터에서 작업 상태와 작업의 수를 파악하기 위해 객체 탐지 (Object detection) 알고리즘의 한 종류인 SSD(Single-Shot-Detector)를 활용하는 것이 바람직한바, SSD는 탐 지 속도를 높인 1-stage detector 로써, 여러 개의 feature map들을 탐지에 활용하는 방식으로서, 다양한 크기 의 객체들을 찾기 위하여 Default Box(Anchor)를 사용하여 다양한 크기의 객체를 탐지할 수 있으며, NMS(Non Max Suppression) 통해서 탐지된 데이터들 중 하나의 데이터를 추출하게 된다. 추가적으로, 상기 딥러닝 모델 선정 후 학습 진행에 따른, 손실함수로서 Classification 함수는 Weighted CrossEntropy 함수를 사용하였으며, Localization 함수는 Weighted Smooth l1 함수, batch size는 32로 설정하 여 학습을 진행하였는바, 도 16은 도 11의 딥러닝 모델 학습 평가에서의 손실함수의 그래프로서, 도 14의 (a)는Classification loss 그래프이고, 도 14의 (b)는 Localization loss 그래프이며, 도 14의 (c)는 Total loss 그 래프이다. 마지막으로, 테스트 데이터 set로 모델 평가를 진행하고, 최종 학습된 딥러닝 모델을 AW Application에서 적용 될 수 있도록 모델 파일을 추출하게 된다(S5). 즉, 최종 학습된 객체 탐지(Mobilenet) 모델 파일을 PB (proto buffer) 파일로 변환하여 SW Application에서 사용할 수 있게끔 모델 파일을 추출한다. 즉, SW Application에 적용할 모델 파일을 추출하는바, 학습된 모델은 PB(Proto Buffer) 파일로 변환하여 SW Application에서 사용할 수 있게끔 모델 파일을 추출하게 된다. 부연하자면, 이와 같이 인공지능(딥러닝)을 사용하여 학습하는 이유는, 사용자가 사용하는 작업 환경은 매우 다 양하며, 기존의 특징점을 이용하여 작업 상태나 화면 상태를 판단하는 방식에서는 오류가 많을 수밖에 없기 때 문에, 딥러닝을 사용하여 사용자가 현재 작업하고 있는 화면을 분석하고, 작업 상태와 화면 상태를 도출하여 적 용하면서 다양한 패턴에 적용이 가능하기 때문이며, 컴퓨터 성능이 급속하게 발전함에 따라 딥러닝 기술도 적용 이 가능하게 되었고, 다양한 패턴을 학습하기 때문에 새로운 환경에서도 적용이 쉬우며, 수요처별 이미지 학습 을 통해 커스터마이징된 작업환경도 제공이 가능하고, 모델 업데이트 방식으로 성능을 쉽게 업그레이드 가능하 기 때문이다. 이제, 도 17 내지 도 20을 참조하여, 일례로 SW Application에 의해 이루어지는, 본 발명의 객체인식기반의 전 력저감 모니터의 제어방법 중, 학습된 모델을 이용하여 모니터 전력 조절 방법에 대하여 상술한다. 먼저, 사용자의 컴퓨터 정보 및 모니터 정보, 즉 모니터의 사용 개수, 해상도 값을 읽어서(S11), 모니터 핸들 값 정보를 획득한다(S12), 즉, SW Application을 통하여 사용자 사용환경 정보를 받아와, 모니터 사용 개수, 해 상도, 모니터 핸들 등의 정보를 획득하게 되는바, 이때, 모니터의 사용 개수, 해상도, DDC-CI 컨트롤을 위한 모 니터 핸들 값들의 정보를 받아오며, 필요시 모니터의 모델명도 함께 읽어오게 된다. 이후, 사용자의 화면을 캡처하는 함수를 만들어 일정 주기가 지나면 화면캡처를 수행할 수 있게끔 구성함으로써, 화면 캡처를 진행한다(S13). 즉, 설정된 일정 주기마다 화면 캡처를 실행하는바, 종전의 기술에 서는 resnet 모델이 너무 무거워서 30s로 설정을 하였는데, 본 실시예의 모델은 가볍고 연산량이 적으며 빠르기 때문에 default 값은 5초로 설정을 하였으며, 다만 1~10초 범위 내에서 사용자가 임의로 조절할 수 있도록 하는 것이 바람직하다. Defalut 값이 5초인 것은 내부 테스트 결과 5초 정도면 사용자가 사용하는데 무리가 없다고 판단하여 설정을 하였는바, 내부테스트 결과, SW상에서 학습 결과 값 도출 시 5초가 최적인 것으로 확인되었다. 계속해서, 화면이 캡처가 되면 화면을 모델 인풋에 맞게끔 resize를 진행할 수 있는 함수를 구성하여, 캡처된 화면의 리사이즈를 진행하게 되는바(S14), 일례로 캡처된 화면은 224x224 사이즈로 Resize 되어 딥러닝 모델의 입력부로 활용된다 (도 20 참조). 참고로, 최근 Full-HD 화면뿐만 아니라 4K 디스플레이도 많이 활용하고 있기 때문에, 캡처된 화면 데이터 Resize 작업이 \"사실상 반드시\"라고 할 정도로 필요하다고 할 것이다. 이후, resize된 화면은 모델의 입력단으로 들어가게 되며, 모델의 아웃풋은 각 객체의 label과 좌표값을 추출 (inference)하게 된다(S15). 그리하여, 전처리된 화면 이미지는 학습된 객체인식모델(MobileNet-SSD) 모델을 활용하여 분석이 시행되고, 화 면 분석 결과 현재 사용자 화면에서 창들의 위치와 밝기 패턴값을 추출하게 되는바(S16), 즉, 각 객체의 label 과 좌표값 정보를 이용하여, 현재 사용자 화면에서 창들의 개수와 밝기 패턴값들을 추출하게 된다. 참고로, 도 25에서의 분석 결과는, 탐지된 창(윈도우)의 수가 3개이고, 평균 밝기 단계는 '1 단계'임을 나타내고 있다. 일 례로, 도 26에서 보는 바와 같이, 객체인식모델의 label 데이터를 구성하여 학습을 진행하였으며, 화면 밝기 패 턴 label 은, 상술한 바와 같이, 도 26의 (a)에서 보는 바와 같은 '화이트 패턴'의 '0 단계' 에서부터 도 26의 (b)에서 보는 바와 같은 '블랙 패턴'의 '4 단계' 까지로 분류되도록 한다. 참고로, 상기 언급한 [표 1]에서의 10,409개의 컴퓨터 학습 데이터 셋을 분석한 결과, 0 ~ 4 단계의 각 화면 패 턴 단계들의 개수가, 하기 [표 2]에 예시된 바와 같았다. 표 2 화면 패턴 단계 개수 0(White) 3,394 1 2,169 2 899 3 4654(Black) 3,482 합계 10,409 이후, 밝기 패턴값들의 평균값을 산출하는바(S17), 상술한 inference 결과 화면에 있는 각 객체의 좌표값과 밝 기 단계의 값(Label) 값들이 추출되고, 각 창의 밝기 단계가 추출되면, 탐지된 창의 수와 밝기 단계에 대한 데 이터들을 저장하고, 현재 실행되고 있는 창들의 밝기 데이터들의 평균값을 산출하게 된다. 이후, 상기 밝기 패턴값들의 평균값(0~4)을 기반으로 모니터 밝기 제어값을 산출하도록 하며(S18), 이에 따라 모니터를 제어함으로써 모니터 전력절감을 시행하도록 한다. 모니터 제어 단계(S20)에 대해서는, 도 24를 참조하여 더욱 상세히 설명한다. 먼저, 상기 S18 단계에서 산출된 모니터 밝기 제어값을 DDC-CI를 통해 모니터 제어부로 전송하면(S21), 모니터 제어부는 상기 제어값에 따라서 백라이트 밝기를 조절하고(S22), 추가적으로 필요시 백라이트 밝기 조절에 따른 콘트라스트나 기타 색상 왜곡 현상을 최소화하도록 픽셀 값을 보정하여 자연스러운 영상이 모니터로 디스플레이 되도록 한다(S23). 참고로, 도 27은 본 발명의 객체인식기반의 전력저감 모니터의 GUI 구성의 예인바, 사용자가 편리하게 사용할 수 있게끔 프로그램 종료 시 PC의 CPU 성능을 복원, 전력절감 기능을 on/off 할 수 있는 체크박스 등을 구성하 여 여러 제품에 테스트를 진행하도록 한다. 먼저, 모니터 모델명을 출력하게끔 구성을 하였는바, 최근 사무 환 경은 듀얼모니터를 사용하는 경우가 많기 때문에 사용하는 모니터를 출력하게끔 구성을 하였다. 또한 사용자 임 의로 밝기 범위 조절을 할 수 있게끔 구성을 하였으며, 모니터 자동 밝기 조절 기능을 on/off 할 수 있는 버튼 을 구성하였고, 또한 모니터 밝기가 변하는 주기도 사용자가 설정을 할 수 있게끔 구성을 하였다. 마지막으로, 도 28a 내지 도 28i 는, 실제 화면 캡처 및 분석 결과의 예시를 보여주는 도면인바, 이를 간략히 설명한다. 도 28a 내지 도 28c에서 보는 바와 같이, 사무 환경에서 수집된 데이터 결과들은, 각 화면을 모니터 개수와 해 상도에 따라 화면 캡처 파일을 이미지로 저장하는바, 프로세스의 상태, CPU 사용량, 메모리 사용량 등의 데이터 는 CSV 파일 형태로 저장된다. 즉, 저장된 이미지 파일 형식과 프로세스 상태나 CPU 사용량, 메모리 사용량, 마우스 입력 횟수, 키보드 입력 횟수, 등의 여러 데이터가 저장된 CSV 데이터와 함께, 저장하게 된다. 도 28a는 수집 데이터 폴더를 나타내고, 도 28b는 저장된 이미지파일, CSV파일 등을 나타내고, 도 28c는 CSV 파일 구성요소를 보여준다. 일례로, 도 28d 및 도 28e에서는, 총 71,849개의 CSV 데이터가 수집되었으며, 수집된 프로세스 종류는 111개로 구성되어 있고, 수집된 데이터들은 프로세스에 따라 데이터(CPU 평균값, 메모리 평균값)가 도 28d의 표 및 도 28e의 그래프와 같이 정리되어 있다. 이 결과에 따르면 가장 많이 사용된 프로세서들은 chrome으로 나타났다. 하지만 이렇게 수집된 데이터들은 같은 패턴의 데이터들이 너무 많아서, 같은 패턴의 데이터들은 삭제를 하였는 바, 같은 패턴들의 데이터가 많으면 모델 학습 시 overfitting을 유발할 수 있기 때문에 같은 패턴의 데이터들 은 삭제를 하는 것이 바람직하다. 그리고, 이를 위해서 저장된 CSV 데이터 중 키보드 마우스 입력값을 활용하여, 키보드 마우스 움직임 값이 0 일 경우에는, 사용자가 컴퓨터를 사용하고 있지 않다고 판단하여 그 데 이터를 제외하였는바, 결국 총 71,849 개의 순수 데이터 중에서, 키보드 마우스 입력 데이터가 없을 경우의 데 이터 44,216개를 제외하고, 27,633개의 학습용 유효 데이터가 얻어졌으며, 이때 105개의 유효 프로세스 종류가 얻어졌다. 도 28f 및 도 28g는, 총 27,633개의 학습용 유효 데이터를 정리한 표 및 그래프이다. 더욱이, 상기 27,633개의 유효 데이터를, 다시 눈으로 보고 [표 1] 에서와 같이 총 10,409개의 데이터를 구성을 하였는바, Object detection 알고리즘을 적용을 위해 화면의 창들의 위치값, 즉 xmin xmax ymin ymax 값들과; 그 객체의 밝기 패턴, 즉 label을, 도 28h에서와 같이 0에서 4 단계의 다섯 단계로 분류하여 레이블링 작업을 하였다. 상기 [표 2]가 상기 레이블링 작업의 결과 (각 화면 밝기 패턴 단계의 개수) 를 표로 정리한 것이며, 도 28i는 각 화면 밝기 패턴 단계의 개수를 그래프로 정리한 것이다. 이상, 이와 같은 본 발명의 객체인식기반의 전력저감 모니터 및 그 제어방법에 의하면, 화면을 캡처(Capture)하 여 딥러닝 모델을 이용하여 화면을 분석한 후, 인공지능 모델을 활용하여, 창이 여러 개 출력되고 있을 때에도화면패턴을 종합적으로 분석하여 소비전력 절감 도모하는 것이 가능하고, 객체 탐지 알고리즘 적용하여 다양한 창을 감지할 수 있는 기술이 추가되었으며, 데이터 다양화를 통해 다양한 환경과 작업상태 하에서의 모니터 모 델에 적용이 가능하다. 본 발명은, 단순히 모니터의 백라이트를 조정하는 방식이 아니라, 사용자가 사용하고 있는 화면을 분석하여 적 절한 백라이트 밝기를 제공하여 전력 소모를 감소시키는 방향으로 이루어지면, 예를 들어, 확장자 정보를 기초 로 문서 프로그램을 실행하는지 동영상 프로그램을 실행하는지 판단하여 이에 맞추어 모니터의 밝기를 조절하는 기술과 화면의 각 프레임의 픽셀 데이터를 활용하여 이전 프레임과 현재 프레임을 비교하여 변화가 없을 시 전 력을 차단하는 방법, 그래픽 드라이버의 데이터를 읽어 자연 영상인지 업무 영상인지 판단하여 전력 절감을 하 는 방식으로도 이루어지는 것이 가능하다."}
{"patent_id": "10-2023-0133906", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서는 본 발명의 일 실시예에 따라 본 발명을 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자가 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 변경 및 변형한 것도 본 발명에 속함은 당연 하다."}
{"patent_id": "10-2023-0133906", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 제1 종래기술에 따른 컴퓨터 및 주변기기의 대기전력 차단 장치의 블록도. 도 2는 제2 종래기술에 따른 컴퓨터 연동을 통한 모니터 대기전력 차단장치의 블록 구성도, 도 3은 도 2의 비디오 커넥터 및 직류 전압 차단부의 실시예 회로도. 도 4a는 종래의 일반적인 직하형 액정 표시 장치의 일 예를 나타낸 구조도. 도 4b는 종래의 일반적인 측면형 백라이트 유닛을 채택하는 액정표시장치의 일 예를 나타낸 구조도. 도 5는 종래의 일반적인 컬러필터의 구조를 나타낸 평면도. 도 6a는 제3 종래기술에 따른 백라이트 유닛이 적용된 액정표시장치를 도시한 구조도.도 6b는 도 6a에 도시된 백라이트 유닛의 구조를 도시한 사시도. 도 7은 제3 종래기술에 따른 또다른 백라이트 유닛이 적용된 액정표시장치를 도시한 구조도. 도 8은 제4 종래기술에 의한 디스플레이 장치의 전력 제어 장치를 개념적으로 나타내는 블록도. 도 9는 제4 종래기술에 의한 디스플레이 장치의 전력 제어 방법을 개념적으로 나타내는 흐름도. 도 10은 제5 종래기술에 의한 전자 디바이스에서 사용하는 디스플레이 장치의 블록도. 도 11은 제5 종래기술에 의한 백라이트가 조정될 때 LCD 디스플레이 보상을 위한 방법의 흐름도. 도 12는 제6 종래기술에 의한 모니터 휘도 보정을 통한 절전형 디스플레이의 제어 장치 및 주변 장치의 블록도. 도 13은 제6 종래기술에 의한 모니터 휘도 보정을 통한 절전형 디스플레이의 제어 방법의 동작흐름도. 도 14는 제6 종래기술의 변형에 따른 모니터 휘도 보정을 통한 절전형 디스플레이의 제어 방법의 동작흐름도. 도 15는 제6 종래기술에서의 PWM 방식에 의한 휘도 변조를 설명하는 개념도. 도 16은 제6 종래기술에서의 화소 데이터 보상을 설명하는 개념도. 도 17은 본 발명의 객체인식기반의 전력저감 모니터의 제어방법의 사전 작업으로서 인공지능 모델 학습의 흐름 도. 도 18은, 도 17의 데이터 캡처 및 수집 단계에서 캡처된 모니터 화면의 예. 도 19는, 도 17의 데이터 캡처 및 수집 단계에서 수집된 모니터 화면의 예. 도 20은, 도 17의 이미지 리사이즈 단계를 설명하는 도면. 도 21은, 도 17의 데이터 분석 및 레이블링 단계에서 레이블링 작업 및 레이블링 데이터의 예. 도 22는, 도 17의 딥러닝 모델 학습 평가에서의 손실함수의 그래프. 도 23은 본 발명의 객체인식기반의 전력저감 모니터의 제어방법의 전체 흐름도. 도 24는, 도 23의 DDC-CI를 통한 모니터 제어 단계의 상세 흐름도. 도 25는, 도 23의 객체인식모델을 사용하여 분석을 행한 결과 화면. 도 26은, 도 23의 객체인식모델을 사용하기 위해 캡처한 결과 화면 및 RGB 밝기 패턴값. 도 27은 본 발명의 객체인식기반의 전력저감 모니터의 GUI 구성의 예. 도 28a 내지 도 28i 는, 실제 화면 캡처 및 분석 결과의 예시를 보여주는 도면."}
