{"patent_id": "10-2020-0097104", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0017059", "출원번호": "10-2020-0097104", "발명의 명칭": "스피커 모듈 및 스피커 모듈을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "박영배"}}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,스피커 유닛과, 제1 방향에서 상기 스피커 유닛에 결합되고 상기 스피커 유닛을 수용하는 제1 스피커 하우징을포함하고 상기 전자 장치의 내부 공간에 배치되는 스피커 모듈;상기 전자 장치의 내부 공간을 외부와 연통시키는 방음구; 및상기 방음구와 상기 스피커 모듈의 스피커 유닛에서 소리가 방사되는 부분을 연결하는 음향 통로;를 포함하고,상기 스피커 모듈은,상기 스피커 유닛에서 방사되는 소리가 상기 음향 통로로 전달되도록 상기 스피커 모듈과 상기 음향 통로 사이를 기밀하는 기밀 부재를 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 스피커 모듈의 기밀 부재는,상기 제1 스피커 하우징에 배치되는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 스피커 모듈은,상기 음향 통로를 형성하는 관로 부재를 더 포함하고,상기 스피커 모듈의 기밀 부재는, 상기 관로 부재에 배치되는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 스피커 모듈은,상기 제1 방향에서 상기 제1 스피커 하우징에 결합되는 제2 스피커 하우징과,상기 제1 스피커 하우징과 상기 제2 스피커 하우징에 의해 형성되는 공명 공간을 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 스피커 모듈의 제2 스피커 하우징에는,상기 전자 장치의 포함된 적어도 하나의 전자 부품이 배치되는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 스피커 모듈의 제2 스피커 하우징에는,상기 전자 장치의 안테나가 배치되는 전자 장치.공개특허 10-2022-0017059-3-청구항 7 제1항에 있어서,상기 스피커 모듈의 기밀 부재는,상기 스피커 유닛의 외주에 대응되도록 형성되어 상기 스피커 유닛에 배치되는 기밀 프레임과, 상기 기밀 프레임과 상기 음향 통로 사이를 기밀하도록 상기 기밀 프레임에 배치되고 탄성력을 갖는 소재로 형성된 기밀부를포함하는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 스피커 모듈의 스피커 유닛은,유닛 프레임과, 적어도 일부분이 상기 유닛 프레임에 고정되는 진동판과, 상기 진동판에 결합되는 보이스 코일(voice coil)과, 상기 보이스 코일에 인접하게 배치되는 자석과, 상기 자석을 수용하는 요크를 포함하는 전자장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 스피커 모듈의 스피커 유닛의 요크는,제1 요크부와 상기 제1 요크부의 두께보다 두께가 작은 제2 요크부를 포함하고,상기 스피커 모듈의 제1 스피커 하우징의 적어도 일부분은,상기 스피커 유닛의 요크의 제2 요크부에 배치되는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 스피커 모듈의 제1 스피커 하우징의 적어도 일부분은,상기 스피커 유닛의 유닛 프레임에 배치되는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 스피커 모듈의 제1 스피커 하우징의 적어도 일부분은,상기 스피커 유닛의 외면으로 적어도 일부분이 돌출된 상기 스피커 유닛의 자석에 배치되는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "스피커 모듈에 있어서,스피커 유닛; 제1 방향에서 상기 스피커 유닛에 결합되고 상기 스피커 유닛을 수용하는 제1 스피커 하우징; 및상기 스피커 유닛과 상기 스피커 유닛에서 소리가 방사되는 부분을 연결하는 음향 통로를 기밀하는 기밀 부재;를 더 포함하는 스피커 모듈."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 기밀 부재는,상기 스피커 유닛의 외주에 대응되도록 형성되어 상기 스피커 유닛에 배치되는 기밀 프레임과, 상기 기밀 프레공개특허 10-2022-0017059-4-임과 상기 음향 통로 사이를 기밀하도록 상기 기밀 프레임에 배치되고 탄성력을 갖는 소재로 형성된 기밀부를포함하는 스피커 모듈."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 기밀 부재는,상기 제1 스피커 하우징에 배치되는 스피커 모듈."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 음향 통로를 형성하는 관로 부재;를 더 포함하고,상기 기밀 부재는, 상기 관로 부재에 배치되는 전자 장치."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 제1 방향에서 상기 제1 스피커 하우징에 결합되는 제2 스피커 하우징; 및상기 제1 스피커 하우징과 상기 제2 스피커 하우징에 의해 형성되는 공명 공간;을 더 포함하는 스피커 모듈."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제2 스피커 하우징에는,상기 스피커 모듈이 포함된 전자 장치의 안테나가 배치되는 스피커 모듈."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12항에 있어서,상기 스피커 유닛은,유닛 프레임과, 적어도 일부분이 상기 유닛 프레임에 고정되는 진동판과, 상기 진동판에 결합되는 보이스 코일(voice coil)과, 상기 보이스 코일에 인접하게 배치되는 자석과, 상기 자석을 수용하는 요크를 포함하는 스피커모듈."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 스피커 유닛의 요크는,제1 요크부와 상기 제1 요크부의 두께보다 두께가 작은 제2 요크부를 포함하고,상기 제1 스피커 하우징의 적어도 일부분은,상기 스피커 유닛의 요크의 제2 요크부에 배치되는 스피커 모듈."}
{"patent_id": "10-2020-0097104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서,상기 제1 스피커 하우징의 적어도 일부분은,공개특허 10-2022-0017059-5-상기 스피커 유닛의 외면으로 적어도 일부분이 돌출된 상기 스피커 유닛의 자석에 배치되는 스피커 모듈."}
{"patent_id": "10-2020-0097104", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 스피커 유닛과, 제1 방향에서 상기 스피커 유닛에 결합되 고 상기 스피커 유닛을 수용하는 제1 스피커 하우징을 포함하고 상기 전자 장치의 내부 공간에 배치되는 스피커 모듈, 상기 전자 장치의 내부 공간을 외부와 연통시키는 방음구 및 상기 방음구와 상기 스피커 모듈의 스피커 유 닛에서 소리가 방사되는 부분을 연결하는 음향 통로를 포함할 수 있고, 상기 스피커 모듈은, 상기 스피커 유닛에 서 방사되는 소리가 상기 음향 통로로 전달되도록 상기 스피커 모듈과 상기 음향 통로 사이를 기밀하는 기밀 부 재를 더 포함할 수 있다. 이 밖에도 다양한 실시예가 가능할 수 있다."}
{"patent_id": "10-2020-0097104", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들은, 스피커 모듈과 스피커 모듈을 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2020-0097104", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소리를 재생하기 위한 스피커 유닛을 포함하는 스피커 모듈이 전자 장치에 포함될 수 있다. 점차 더 많은 컨텐 츠들이 전자 장치를 통해 재생되면서 음향 성능에 대한 사용자들의 관심도 점차 증가하고 있다. 전자 장치의 조립 편의성을 고려하여 스피커 유닛은 스피커 모듈(module) 형태로 제작되고 있다. 방진 및 방수 기능을 갖는 전자 장치는 스피커 유닛에서 방사되는 소리를 전자 장치의 외부로 전달하기 위한 구 멍(hole)을 통해 유입될 수 있는 외부 이물질과 수분을 차단할 수 있어야 한다. 이러한 기밀성을 고려하여 방수 기능을 갖는 접착 물질이 이용될 수 있다."}
{"patent_id": "10-2020-0097104", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "방진 및 방수를 고려하여 방수 기능을 갖는 접착 물질을 이용하는 경우, 접착 물질과 기구물의 부착을 위한 압 착 공정이 필요할 수 있다. 이러한 압착 공정에서 전자 장치의 전자 부품 또는 스피커 모듈이 손상될 수 있다. 또한, 스피커 유닛에서 방사되는 위상이 서로 반대인 소리가 상쇄되지 않도록 스피커 유닛을 수용하는 하우징은 위상이 서로 반대인 소리가 전달되는 공간을 분리할 수 있는 구조를 포함할 수 있다. 공간 분리를 위하여 스피 커 유닛을 수용하는 하우징이 차지하는 체적이 증가하면 전자 장치의 내부 공간 활용 효율이 감소할 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 방진 및 방수 기능을 보장하면서도 별도의 압착 공정이 요구되지 않 는 기밀 구조와 전자 장치 내부 공간 활용성을 개선할 수 있는 스피커 모듈 및 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2020-0097104", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 스피커 유닛과, 제1 방향에서 상기 스피커 유닛에 결합되 고 상기 스피커 유닛을 수용하는 제1 스피커 하우징을 포함하고 상기 전자 장치의 내부 공간에 배치되는 스피커 모듈, 상기 전자 장치의 내부 공간을 외부와 연통시키는 방음구 및 상기 방음구와 상기 스피커 모듈의 스피커 유닛에서 소리가 방사되는 부분을 연결하는 음향 통로를 포함할 수 있고, 상기 스피커 모듈은, 상기 스피커 유 닛에서 방사되는 소리가 상기 음향 통로로 전달되도록 상기 스피커 모듈과 상기 음향 통로 사이를 기밀하는 기 밀 부재를 더 포함할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 스피커 모듈은, 스피커 유닛, 제1 방향에서 상기 스피커 유닛에 결합되 고 상기 스피커 유닛을 수용하는 제1 스피커 하우징 및 상기 스피커 유닛과 상기 스피커 유닛에서 소리가 방사 되는 부분을 연결하는 음향 통로를 기밀하는 기밀 부재를 더 포함할 수 있다."}
{"patent_id": "10-2020-0097104", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따르면, 스피커 모듈을 전자 장치에 설치하는 과정에서 압착 공정이 필요하 지 않으므로 압착 공정에서 발생할 수 있는 전자 부품, 스피커 모듈의 손상 위험을 해소할 수 있다. 또한, 전자 장치의 내부 공간 활용 효율을 향상시킬 수 있다."}
{"patent_id": "10-2020-0097104", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“또는 B 중 적어도 하나,”\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,”및 “B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열 된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어와 함께 또는 이런 용어 없이, “커플드” 또는 “커넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a는, 본 문서에 개시된 다양한 실시예에 따른 스피커 유닛의 사시도이다. 도 2b는, 도 2a에 도시된 스피커 유닛을 A-A선을 따라 절개한 단면도이다. 본 문서에 개시된 다양한 실시예에 따른 스피커 유닛은, 전자 장치(예: 도 1의 전자 장치)에 배치되 어 소리를 출력하는 장치를 의미할 수 있다. 스피커 유닛은 어플리케이션 또는 기능의 실행에 따라 전자 장치의 오디오 모듈(예: 도 1의 오디오 모듈)을 통해 처리된 오디오 신호를 수신하여 그 신호를 소리로 출 력할 수 있다. 예를 들어, 스피커 유닛은 도 1의 음향 출력 장치(예: 도 1의 155)일 수 있다. 다양한 실시예에 따르면, 유닛 프레임은 스피커 유닛에 포함된 다양한 구성들을 지지할 수 있다. 도 2a 및 도 2b에 도시된 유닛 프레임의 형상은 예시에 불과하며, 유닛 프레임의 형상은 도 2a 및 도 2b 에 도시된 형태로 한정되지 않는다. 유닛 프레임는 스피커 유닛이 배치될 공간에 따라 다양한 형태로 제작될 수 있다. 유닛 프레임는 다양한 소재로 형성될 수 있다. 예를 들어, 유닛 프레임는 합성 수지소재로 형성될 수 있다. 다양한 실시예에 따르면, 도 2a 및 도 2b에 도시된 것과 같이, 진동 부재는 유닛 프레임의 적어도 일 부분에 의해 지지될 수 있다. 진동 부재의 적어도 일부에는 보이스 코일(voice coil)이 결합될 수 있 다. 진동 부재은 보이스 코일의 움직임에 의해 진동될 수 있다. 일 실시예에서, 진동 부재는 제 1 진동부와 제2 진동부를 포함할 수 있다. 제1 진동부는 적어도 일부가 유닛 프레임에 지 지될 수 있다. 제1 진동부는 유연 소재로 형성될 수 있다. 제1 진동부는 예를 들어, 탄성 중합체 (elastomer), 합성 수지, 얇은 금속판, 고무(rubber), 필름(film)으로 형성될 수 있다. 제2 진동부는 적 어도 일부분이 제1 진동부에 결합될 수 있다. 제2 진동부는 제1 진동부보다 상대적으로 단단한 소재(예: 제1 진동부에 비해 상대적으로 탄성 계수가 높은 소재)로 형성될 수 있다. 예를 들어, 제2 진동 부는 금속, 합성 수지, 합금으로 형성될 수 있다. 도 2a를 참조하면, 제1 진동부는 유닛 프레임(21 0)의 외주에 배치되고, 제2 진동부는 제1 진동부에 의해 지지될 수 있다. 진동 부재와 결합된 보이스 코일의 움직임에 의해 유연 소재로 형성된 제1 진동부가 진동하고, 제1 진동부에 지지된 제2 진동부가 제1 진동부의 진동에 의해 함께 진동할 수 있다. 진동 부재의 진동에 의해 소리가 발생할 수 있다. 다른 실시예에서 진동 부재는 제1 진동부 및 제2 진동부로 구분되지 않고 하나 의 소재로 형성될 수 있다. 다양한 실시예에 따르면, 보이스 코일은 전선(미도시)이 와인딩(winding)되어 형성될 수 있다. 보이스 코 일에 전류가 흐르면, 보이스 코일에 흐르는 전류에 의해 형성되는 자기장과 보이스 코일에 인접 한 자석 사이의 반발력에 의해 보이스 코일은 상하로 진동할 수 있다. 상술한 바와 같이, 보이스 코 일에 고정된 진동 부재은 보이스 코일의 진동에 의해 진동할 수 있다. 진동 부재의 진동에 의해 소리가 출력될 수 있다. 보이스 코일의 진동은 보이스 코일에 흐르는 전류로 제어될 수 있다. 다양한 실시예에 따르면, 전자 회로는 전자 장치(예: 도 1의 전자 장치)의 인쇄 회로 기판(미도시)에 전기적으로 연결되어 전기 신호를 보이스 코일에 인가할 수 있다. 전자 회로는 탄성력을 갖는 소재로 형성될 수 있다. 전자 회로는 진동 부재에 인접하게 배치되어 진동 부재의 진동 정도(예: 감쇠 비(damping ratio))를 조절할 수 있다. 다양한 실시예에 따르면, 요크에는 자석이 배치될 수 있다. 요크는 자성을 띈 재질로 형성될 수 있다. 예를 들어, 요크는 자성을 갖는 금속이나, 자성을 갖는 금속을 포함하는 소재로 형성될 수 있다. 다양한 실시예에 따르면, 자석은 제1 자석(240-1) 및 제2 자석(240-2)을 포함할 수 있다. 도 2b에 도시된 것과 같이, 제1 자석(240-1)은 요크의 중앙 부분에 배치된 자석일 수 있고, 제2 자석(240-2)는 요크 의 측부에 배치된 자석일 수 있다. 보이스 코일은 제1 자석(240-1)과 제2 자석(240-2) 사이에 배치될 수 있다. 다양한 실시예에 따르면, 플레이트은 자석의 적어도 일부분을 덮도록 배치될 수 있다. 플레이트(27 0)는 자속을 차폐할 수 있는 소재로 형성될 수 있다. 다양한 실시예에 따르면, 자석, 요크 및 플레이트는 스피커 유닛의 구동을 위한 자기 회로 를 형성할 수 있다. 자석, 요크 및 플레이트가 형성하는 자기 회로와 보이스 코일의 전류 흐름에 의해 형성되는 자기장의 반발에 의해 보이스 코일이 진동할 수 있다. 도 2a 및 도 2b에 도시된 스피커 유닛의 형태와 구조는 예시에 불과하며 이하에서 설명되는 스피커 유닛 이 도 2a 및 도 2b에 도시된 형태와 구조로 한정되는 것은 아니다. 예를 들어, 스피커 유닛은 도 6a 내지 도 6c에 도시된 형태와 구조로 변경될 수 있다. 도 3a는, 본 문서에 개시된 다양한 실시예에 다른 스피커 모듈의 분리 사시도이다. 도 3b는, 본 문서에 개시된 다양한 실시예에 따른 스피커 모듈의 사시도이다. 도 3c는, 도 3b에 도시된 스피커 모듈을 A-A선을 따라 절개한 단면도이다. 다양한 실시예에 따르면, 도 3a 내지 도 3c에 도시된 것과 같이, 스피커 모듈은 스피커 유닛(예: 도 2a 및 도 2b의 스피커 유닛), 제1 스피커 하우징, 제2 스피커 하우징 및 기밀 부재를 포함 할 수 있다. 상술한 구성 요소 중 일부는 스피커 모듈에서 생략될 수 있다. 예를 들어, 스피커 모듈 은 제2 스피커 하우징을 포함하지 않을 수 있다(도 5a 참조).다양한 실시예에 따르면, 제1 스피커 하우징은 제1 방향에서 스피커 유닛에 결합될 수 있다. 제1 방 향은 도 3a 내지 도 3c를 기준으로 -Z 방향을 의미할 수 있다. 제1 스피커 하우징과 스피커 유닛의 결합은 다양한 방식으로 이루어질 수 있다. 예를 들어, 접착성 소재를 통해 제1 스피커 하우징과 스피커 유닛이 결합될 수 있고, 스피커 유닛은 스피커 유닛과 대응되는 모양으로 제1 스피커 하우징 에 형성된 부분에 끼워질 수 있다. 제1 스피커 하우징은 스피커 유닛을 수용할 수 있다. 제1 스 피커 하우징은 전자 장치(예: 도 1의 전자 장치) 내부에 배치될 수 있다. 제1 스피커 하우징은 다양한 소재로 형성될 수 있다. 예를 들어, 합성 수지, 금속 또는 복합 소재로 형성될 수 있다. 다양한 실시예에 따르면, 제2 스피커 하우징은 제1 방향에서 제1 스피커 하우징에 결합될 수 있다. 제2 스피커 하우징과 제1 스피커 하우징의 결합은 다양한 방식으로 이루어질 수 있다. 예를 들어, 접 착성 소재를 통해 제1 스피커 하우징과 제2 스피커 하우징이 결합될 수 있고, 제1 스피커 하우징 은 제1 스피커 하우징과 대응되는 모양으로 제2 스피커 하우징에 형성된 부분에 끼워질 수 있다. 또 다른 예로, 제1 스피커 하우징과 제2 스피커 하우징은 나사 결합될 수 있다. 제2 스피커 하 우징은 다양한 소재로 형성될 수 있다. 예를 들어, 합성 수지, 금속 또는 복합 소재로 형성될 수 있다. 일 실시예에서 제2 스피커 하우징은 제1 스피커 하우징과 동일한 소재로 형성될 수 있다. 다양한 실시예에 따르면, 제2 스피커 하우징에는 전자 장치에 포함된 전자 부품 중 적어도 하나가 배치될 수 있다. 예를 들어, 제2 스피커 하우징에는 전자 장치의 안테나가 배치될 수 있다. 안테나는 전자 장치의 통신 모듈(예: 도 1의 통신 모듈)에 연결되어 통신 관련 신호를 송신 또는 수신할 수 있는 기구물을 의미 할 수 있다. 이 밖에도 제2 스피커 하우징에는 다양한 전자 부품이 배치될 수 있다. 다양한 실시예에 따르면, 도 3c에 도시된 것과 같이, 제1 스피커 하우징과 제2 스피커 하우징 사이에 는 공명 공간이 형성될 수 있다. 공명 공간은 제1 스피커 하우징의 일부 및 제2 스피커 하우징 의 일부에 둘러싸여 형성된 공간일 수 있다. 공명 공간은 적어도 일부가 스피커 유닛과 연결될 수 있다. 도 3c에 도시된 것과 같이, 공명 공간은 스피커 유닛에 대해 제1 방향에 배치될 수 있다. 스피커 유닛에서 주된 소리가 방사되는 방향은 제1 방향의 반대 방향인 제2 방향일 수 있다. 제1 방향은 도 3a 내지 도 3c를 기준으로 -Z 방향을 의미할 수 있다. 제2 방향은 도 3a 내지 도 3c를 기준으로 +Z 방향을 의미할 수 있다. 스피커 유닛의 진동판의 진동에 의해 발생된 소리는 제2 방향 및 제1 방향으로 방사될 수 있다. 제2 방향으로 진행되는 소리와 제1 방향으로 진행되는 소리의 위상이 서로 반대이므로, 각각의 방향으로 진행되는 소리는 서로 분리될 필요가 있다. 공명 공간은 스피커 유닛의 주된 소리 방사 방향인 제2 방향과 반대 방향인 제1 방향에 배치되어, 제1 방향으로 방사되는 소리가 제1 방향으로 방사되는 소리와 분리되 도록 할 수 있다. 또한, 공명 공간은 제1 방향으로 방사된 소리를 공명시켜 전자 장치 외부로 출력되는 소 리의 크기(볼륨)을 증가시킬 수 있다. 다양한 실시예에 따르면, 스피커 모듈의 제1 스피커 하우징은 스피커 유닛에서 제1 방향으로 방 사되어 공명 공간으로 진행되는 소리와 스피커 유닛에서 제2 방향으로 진행되는 소리가 서로 간섭되 지 않도록 공간을 분리할 수 있다. 다양한 실시예에 따르면, 기밀 부재는 제2 방향에서 제1 방향으로 스피커 유닛에 결합될 수 있다. 기 밀 부재는, 스피커 유닛에서 제2 방향으로 방사되는 소리가 전자 장치 내부 공간로 누설되는 것을 방 지할 수 있다. 또한, 기밀 부재는 후술하는 음향 통로(예: 도 4b의 음향 통로)와 스피커 유닛 사이를 기밀하여 음향 통로로 유입될 수 있는 외부 이물질 또는 수분이 전자 장치의 내부 공간으로 이동되는 것 을 차단할 수 있다. 다양한 실시예에 따르면, 기밀 부재는 기밀 프레임과 기밀부를 포함할 수 있다. 일 실시예에서, 기밀 프레임은 스피커 유닛의 외주와 대응되도록 형성될 수 있다. 스피커 유닛에서 제2 방향으 로 방사되는 소리가 기밀 부재를 통과하도록 기밀 프레임에는 개구(opening)가 형성될 수 있다. 기밀 프레임은 합성 수지, 금속 또는 복합 소재로 형성될 수 있다. 일 실시예에서, 기밀부는 탄성력 을 갖는 소재로 형성될 수 있다. 예를 들어, 기밀부는 고무(rubber), 실리콘(silicone), 액체 실리콘 고무 (liquid silicone rubber; LSR)과 같은 소재로 형성될 수 있다. 기밀부는 다양한 방식으로 기밀 프레임 에 배치될 수 있다. 예를 들어, 이중 사출 방식을 통해 기밀 프레임에 기밀부를 형성할 수 있다. 기밀부는 음향 통로를 형성하는 기구물과 밀착되어 음향 통로를 기밀할 수 있다. 다른 실시예에서, 기밀 부재는 탄성력을 갖는 소재로 형성될 수 있다. 예를 들어, 앞서 설명한 기밀 프레임와 기밀부 가 일체로 형성되고 기밀 프레임과 기밀부는 탄성력을 갖는 소재로 형성될 수 있다. 또 다른 실시예에서 기밀 프레임은 제1 기밀 프레임과 제2 기밀 프레임으로 구분될 수 있다. 제1 기밀 프레임에 제2 기밀 프레임이 이중 사출 방식으로 형성되고, 제1 기밀 프레임 또는 제2 기밀 프레임에 탄성력을 갖는 소재로 형성된 기밀부가 이중 사출 방식으로 형성될 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 스피커 유닛에 결합되는 기밀 부재에 의해 이물질 또는 수분이 유입될 수 있는 음향 통로가 기밀될 수 있다. 따라서, 음향 통로와 방음구 사이에 외부 이물질 또는 수 분을 차단하는 기구물을 배치할 필요가 없어 전자 장치의 공간 활용 효율이 향상될 수 있다. 또한 기밀 부재 는 탄성력을 갖는 소재에 의해 기밀을 수행하고 방수 소재의 접착 물질을 이용하지 않으므로, 본 문서에 개시된 스피커 모듈의 조립 과정에서 방수 소재 접착을 위한 압착 가공이 불필요하다. 따라서, 압착 가공 에 의한 전자 장치의 전자 부품 또는 스피커 모듈의 손상 우려가 해소될 수 있다. 도 4a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 사시도이다. 도 4b는, 도 4a에 도시된 전자 장치 를 B-B 선을 따라 절개한 단면도이다. 이하 설명에서는 도 3a 내지 도 3c에서 설명한 구성 요소와 동일 또는 유 사한 구성 요소에 대해서는 도 3a 내지 도 3c와 동일한 부재 번호를 사용하고, 자세한 설명은 생략하도록 한다. 도 4b를 참조하면, 스피커 모듈은 전자 장치의 내부 공간에 배치될 수 있다. 스피커 모듈은 전자 장 치의 하우징에 배치되어 그 위치가 고정될 수 있다. 스피커 유닛을 기준으로 제1 방향에는 전자 장치 의 플레이트가 배치될 수 있다. 전자 장치의 플레이트는 스피커 모듈의 제2 스피커 하우징(33 0)과 대면할 수 있다. 스피커 유닛을 기준으로 제1 방향의 반대 방향인 제2 방향에는 전자 장치의 디스플 레이 모듈이 배치될 수 있다. 제1 방향은 도 4b를 기준으로 -Z 방향을 의미할 수 있고, 제2 방향은 도 4b 를 기준으로 +Z 방향을 의미할 수 있다. 일 실시예에서, 스피커 유닛의 제2 방향에는 전자 장치의 하우징 또는 전자 장치의 전면 방향(예: 도 4b를 기준으로 +Z 방향)에 배치된 전자 부품(예: 디스플레이 모듈)을 지지하는 전면 플레이트(미도시)가 배치될 수도 있다. 다양한 실시예에 따르면, 음향 통로는 전자 장치의 하우징과 디스플레이 모듈 사이에 마련된 공 간일 수 있다. 일 실시예에서, 스피커 유닛의 제2 방향에 전자 장치의 하우징 또는 전면 플레이트(미도 시)가 배치된 경우, 음향 통로는 전자 장치의 하우징 또는 전면 플레이트(미도시) 사이에 마련된 공간일 수도 있다. 음향 통로는 스피커 유닛에서 제2 방향으로 방사되는 소리가 전달되는 공간일 수 있다. 음향 통로와 스피커 유닛 사이에는 스피커 모듈의 기밀 부재가 배치될 수 있다. 기밀 부재(34 0)는 음향 통로와 스피커 유닛 사이를 기밀할 수 있다. 기밀 부재는 음향 통로를 통해 유 입될 수 있는 외부 이물질 또는 수분이 음향 통로와 스피커 유닛 사이로 전달되는 것을 차단할 수 있 다. 다른 실시예에서 음향 통로는 디스플레이 모듈을 지지하는 기구물과 전자 장치의 하우징 사 이에 마련된 공간일 수 있다. 다양한 실시예에 따르면, 도 4a에 도시된 것과 같이, 방음구는 전자 장치의 하우징과 디스플레이 모 듈 사이에 마련된 개구부(opening)일 수 있다. 방음구는 전자 장치 외부와 음향 통로를 연결할 수 있다. 다른 실시예에서 방음구는 디스플레이 모듈을 지지하는 기구물과 전자 장치의 하우징 사이에 마련된 공간일 수 있다. 다양한 실시예에 따르면, 스피커 유닛의 제2 방향으로 방사되는 소리는 음향 통로에 전달되어 음향 통로와 연결된 방음구를 통해 외부로 출력될 수 있다. 스피커 유닛의 제1 방향으로 방사되는 소 리는 제1 스피커 하우징 및 제2 스피커 하우징에 의해 형성된 공명 공간으로 방사될 수 있다. 도 5a 내지 도 5d는, 본 문서에 개시된 다양한 실시예들에 따른 스피커 모듈과 그 주변 구성 요소의 단면도이다. 이하에서는 도 3a 내지 도 3c 및 도 4b을 통해 설명한 스피커 모듈 및 전자 장치와의 차이점을 중 심으로 설명하도록 한다. 다양한 실시예에 따르면, 도 5a에 도시된 것과 같이, 스피커 모듈의 제2 스피커 하우징은 생략될 수 있다. 스피커 모듈의 제1 스피커 하우징은 전자 장치의 플레이트와 대면할 수 있다. 이 경우, 스피커 유닛의 제1 방향(예: 도 5a의 -Z 방향)으로 방사되는 소리를 위한 공명 공간은 제1 스피커 하 우징과 전자 장치의 플레이트로 둘러싸인 공간일 수 있다. 다양한 실시예에 따르면, 도 5b에 도시된 것과 같이, 스피커 모듈은 음향 통로를 형성하는 관로 부재 를 포함할 수 있다. 관로 부재는 스피커 유닛에 결합되어 스피커 유닛에서 방사되는 소리 를 방음구(예: 도 4b의 방음구)가 배치된 방향으로 전달하는 음향 통로를 형성할 수 있다. 본 실시예 에서, 기밀 부재는 관로 부재에 배치될 수 있다. 기밀 부재는 탄성력을 갖는 소재로 형성될 수 있다. 예를 들어, 기밀 부재는 고무(rubber), 실리콘(silicone), 액체 실리콘 고무(liquid silicone rubber; LSR)과 같은 소재로 형성될 수 있다. 기밀 부재는 관로 부재에 이중 사출 방식으로 형성될 수 있다. 기밀 부재는 관로 부재와 관로 부재와 접하는 기구물 사이를 기밀할 수 있다. 다양한 실시예에 따르면, 도 5c 및 도 5d에 도시된 것과 같이, 기밀 부재는 스피커 모듈의 제1 스피 커 하우징에 배치될 수 있다. 기밀 부재는 예를 들어, 도 5c과 같이, 제1 스피커 하우징에서 도 5c을 기준으로 +Z 방향에 배치될 수 있고, 도 5d와 같이, 제1 스피커 하우징에서 도 5d를 기준으로 +X 방 향 및 -X 방향에 배치될 수 있다. 이처럼 기밀 부재는 제1 스피커 하우징과 전자 장치의 하우징 사이를 기밀할 수 있는 위치에 배치되어 전자 장치의 하우징과 제1 스피커 하우징 사이를 기밀할 수 있다. 기밀 부재는 탄성력을 갖는 소재로 형성될 수 있다. 예를 들어, 기밀 부재는 고무(rubber), 실 리콘(silicone), 액체 실리콘 고무(liquid silicone rubber; LSR)과 같은 소재로 형성될 수 있다. 기밀 부재 는 제1 스피커 하우징에 이중 사출 방식으로 형성될 수 있다. 도 6a 내지 도 6c는, 본 문서에 개시된 다양한 실시예들에 따른 스피커 유닛과 제1 스피커 하우징의 결합 관계 를 설명하기 위한 도면이다. 이하에서 설명되는 스피커 유닛의 부재 번호는 도 2a 및 도 2b에 도시된 스피커 유 닛의 부재 번호를 이용하도록 한다. 다양한 실시예에 따르면, 스피커 유닛은 제1 스피커 하우징과 다양한 방식으로 결합될 수 있다. 스피 커 유닛의 형상은 제1 스피커 하우징과의 결합을 고려하여 다양하게 변경될 수 있다. 예를 들어, 스피커 유닛의 요크는 단차 설계될 수 있다. 도 6a에 도시된 것과 같이, 요크는 제1 요크부(250A)와 제2 요크부(250B)를 포함할 수 있다. 제2 요크부(250B)의 두께는 제1 요크부(250A)의 두께보다 작을 수 있다. 제1 요크부(250A)와 제2 요크부(250B) 사이에 단차가 형성될 수 있다. 제1 스피커 하우징의 일부분이 요크의 제2 요크부(250B)에 결합될 수 있다. 제1 스피커 하우징의 일부분과 제2 요크부 (250B)는 다양한 방식으로 결합될 수 있다. 예를 들어, 제1 스피커 하우징과 제2 요크부(250B)는 접착력을 갖는 소재에 의해 접착되어 결합될 수 있다. 다른 예로, 제1 스피커 하우징의 일부분은 스피커 유닛의 유닛 프레임에 결합될 수 있다. 스피 커 유닛의 유닛 프레임은 제1 스피커 하우징의 일부분에 결합될 수 있도록 도 6b를 기준으로 +Z 방향으로 연장될 수 있다. 제1 스피커 하우징의 일부분과 유닛 프레임은 다양한 방식으로 결합될 수 있다. 예를 들어, 제1 스피커 하우징과 유닛 프레임은 접착력을 갖는 소재에 의해 접착되어 결합될 수 있다. 또 다른 예로, 제1 스피커 하우징의 일부분은 스피커 유닛의 자석에 결합될 수 있다. 스피커 유 닛의 자석은 도 6c를 기준으로 X 축 방향으로 연장될 수 있다. 제1 스피커 하우징의 일부분과 자석은 다양한 방식으로 결합될 수 있다. 예를 들어, 제1 스피커 하우징과 자석은 접착력을 갖 는 소재에 의해 접착되어 결합될 수 있다. 일 실시예에서, 제1 스피커 하우징에서 자석과 결합되는 부분은 자력을 차폐할 수 있는 소재로 형성될 수 있다. 다양한 실시예에 따르면, 스피커 유닛에 포함된 진동판의 진동에 의해 제1 방향(도 6a 내지 도 6c를 기준 으로 -Z 방향)으로 소리가 방사되고, 스피커 유닛에서 제1 방향의 반대 방향인 제2 방향(도 6a 내지 도 6c 를 기준으로 +Z 방향)으로 소리가 방사될 수 있다. 제1 스피커 하우징은 스피커 유닛과 결합되어 제1 방향으로 방사되는 소리와 제2 방향으로 방사되는 소리가 서로 만나 상쇄되지 않도록 제1 방향으로 방사되는 소 리가 전달되는 공간과 제2 방향으로 방사되는 소리가 전달되는 공간을 분리할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 스피커 유닛과, 제1 방향에서 상기 스피커 유닛에 결합되 고 상기 스피커 유닛을 수용하는 제1 스피커 하우징을 포함하고 상기 전자 장치의 내부 공간에 배치되는 스피커 모듈, 상기 전자 장치의 내부 공간을 외부와 연통시키는 방음구 및 상기 방음구와 상기 스피커 모듈의 스피커 유닛에서 소리가 방사되는 부분을 연결하는 음향 통로를 포함할 수 있고, 상기 스피커 모듈은, 상기 스피커 유 닛에서 방사되는 소리가 상기 음향 통로로 전달되도록 상기 스피커 모듈과 상기 음향 통로 사이를 기밀하는 기밀 부재를 더 포함할 수 있다. 또한, 상기 스피커 모듈의 기밀 부재는, 상기 제1 스피커 하우징에 배치될 수 있다. 또한, 상기 스피커 모듈은, 상기 음향 통로를 형성하는 관로 부재를 더 포함할 수 있고, 상기 스피커 모듈의 기 밀 부재는, 상기 관로 부재에 배치될 수 있다. 또한, 상기 스피커 모듈은, 상기 제1 방향에서 상기 제1 스피커 하우징에 결합되는 제2 스피커 하우징과, 상기 제1 스피커 하우징과 상기 제2 스피커 하우징에 의해 형성되는 공명 공간을 더 포함할 수 있다. 또한, 상기 스피커 모듈의 제2 스피커 하우징에는, 상기 전자 장치의 포함된 적어도 하나의 전자 부품이 배치될 수 있다. 또한, 상기 스피커 모듈의 제2 스피커 하우징에는, 상기 전자 장치의 안테나가 배치될 수 있다. 또한, 상기 스피커 모듈의 기밀 부재는, 상기 스피커 유닛의 외주에 대응되도록 형성되어 상기 스피커 유닛에 배치되는 기밀 프레임과, 상기 기밀 프레임과 상기 음향 통로 사이를 기밀하도록 상기 기밀 프레임에 배치되고 탄성력을 갖는 소재로 형성된 기밀부를 포함할 수 있다. 또한, 상기 스피커 모듈의 스피커 유닛은, 유닛 프레임과, 적어도 일부분이 상기 유닛 프레임에 고정되는 진동 판과, 상기 진동판에 결합되는 보이스 코일(voice coil)과, 상기 보이스 코일에 인접하게 배치되는 자석과, 상 기 자석을 수용하는 요크를 포함할 수 있다. 또한, 상기 스피커 모듈의 스피커 유닛의 요크는, 제1 요크부와 상기 제1 요크부의 두께보다 두께가 작은 제2 요크부를 포함할 수 있고, 상기 스피커 모듈의 제1 스피커 하우징의 적어도 일부분은, 상기 스피커 유닛의 요크 의 제2 요크부에 배치될 수 있다. 또한, 상기 스피커 모듈의 제1 스피커 하우징의 적어도 일부분은, 상기 스피커 유닛의 유닛 프레임에 배치될 수 있다. 또한, 상기 스피커 모듈의 제1 스피커 하우징의 적어도 일부분은, 상기 스피커 유닛의 외면으로 적어도 일부분 이 돌출된 상기 스피커 유닛의 자석에 배치될 수 있다. 본 문서에 개시된 다양한 실시예에 따른 스피커 모듈은, 스피커 유닛, 제1 방향에서 상기 스피커 유닛에 결합되 고 상기 스피커 유닛을 수용하는 제1 스피커 하우징 및 상기 스피커 유닛과 상기 스피커 유닛에서 소리가 방사 되는 부분을 연결하는 음향 통로를 기밀하는 기밀 부재를 더 포함할 수 있다. 또한, 상기 기밀 부재는, 상기 스피커 유닛의 외주에 대응되도록 형성되어 상기 스피커 유닛에 배치되는 기밀 프레임과, 상기 기밀 프레임과 상기 음향 통로 사이를 기밀하도록 상기 기밀 프레임에 배치되고 탄성력을 갖는 소재로 형성된 기밀부를 포함할 수 있다. 또한, 상기 기밀 부재는, 상기 제1 스피커 하우징에 배치될 수 있다. 또한, 상기 음향 통로를 형성하는 관로 부재를 더 포함할 수 있고, 상기 기밀 부재는, 상기 관로 부재에 배치될 수 있다. 또한, 상기 제1 방향에서 상기 제1 스피커 하우징에 결합되는 제2 스피커 하우징 및 상기 제1 스피커 하우징과 상기 제2 스피커 하우징에 의해 형성되는 공명 공간을 더 포함할 수 있다. 또한, 상기 제2 스피커 하우징에는, 상기 스피커 모듈이 포함된 전자 장치의 안테나가 배치될 수 있다. 또한, 상기 스피커 유닛은, 유닛 프레임과, 적어도 일부분이 상기 유닛 프레임에 고정되는 진동판과, 상기 진동 판에 결합되는 보이스 코일(voice coil)과, 상기 보이스 코일에 인접하게 배치되는 자석과, 상기 자석을 수용하 는 요크를 포함할 수 있다. 또한, 상기 스피커 유닛의 요크는, 제1 요크부와 상기 제1 요크부의 두께보다 두께가 작은 제2 요크부를 포함할 수 있고, 상기 제1 스피커 하우징의 적어도 일부분은, 상기 스피커 유닛의 요크의 제2 요크부에 배치될 수 있다. 또한, 상기 제1 스피커 하우징의 적어도 일부분은, 상기 스피커 유닛의 외면으로 적어도 일부분이 돌출된 상기 스피커 유닛의 자석에 배치될 수 있다. 그리고 본 명세서와 도면에 개시된 본 문서에 개시된 실시예들은 본 문서에 개시된 실시예에 따른 기술 내용을 쉽게 설명하고 본 문서에 개시된 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 문서에 개시된 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 문서에 개시된 다양한 실시예의 범위는 여기에 개시 된 실시예들 이외에도 본 문서에 개시된 다양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변 형된 형태가 본 문서에 개시된 다양한 실시예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0097104", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2a는, 본 문서에 개시된 다양한 실시예에 따른 스피커 유닛의 사시도이다. 도 2b는, 도 2a에 도시된 스피커 유닛을 A-A선을 따라 절개한 단면도이다. 도 3a는, 본 문서에 개시된 다양한 실시예에 다른 스피커 모듈의 분리 사시도이다. 도 3b는, 본 문서에 개시된 다양한 실시예에 따른 스피커 모듈의 사시도이다. 도 3c는, 도 3b에 도시된 스피커 모듈을 A-A선을 따라 절개한 단면도이다. 도 4a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 사시도이다. 도 4b는, 도 4a에 도시된 전자 장치를 B-B 선을 따라 절개한 단면도이다. 도 5a 내지 도 5d는, 본 문서에 개시된 다양한 실시예들에 따른 스피커 모듈과 그 주변 구성 요소의 단면도이다. 도 6a 내지 도 6c는, 본 문서에 개시된 다양한 실시예들에 따른 스피커 유닛과 제1 스피커 하우징의 결합 관계 를 설명하기 위한 도면이다."}
