{"patent_id": "10-2025-7001783", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0022866", "출원번호": "10-2025-7001783", "발명의 명칭": "채널 상태 정보 피드백 방법 및 장치", "출원인": "베이징 시아오미 모바일 소프트웨어 컴퍼니 리미", "발명자": "까오, 슈에위엔"}}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "단말 기기에 의해 수행되는 채널 상태 정보 피드백 방법에 있어서, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는 단계; 상기 코드북 지시 정보가 포함된 채널 상태 정보(CSI)를 상기 네트워크측 기기에 송신하는 단계 - 상기 코드북지시 정보는 상기 네트워크측 기기가 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 것을 지시하는데 사용됨 - ; 를 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는 단계는, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계; 상기 길이 및 상기 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북지시 정보를 결정하는 단계; 를 포함하는, 것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계는, 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계를 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의공개특허 10-2025-0022866-3-배와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의CSI-RS 자원의 개수의 배와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는 단계 - 상기 은 양의정수이고, 상기 는 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고, 상기 는 시간 도메인의 압축 유닛임 - ; 를 포함하는, 것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는 단계를 포함하고;상기 Wmeas는 상기 CSI-RS 측정 윈도우의 크기이고, 상기 d는 상기 인접 CSI 측정 시각 사이의 간격, 또는 상기인접 CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값인,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의CSI 측정 횟수의 배와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 상기 는 양의 정수이고, 상기 B는 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 상기 는 시간 도메인의 압축 유닛임 - ; 를 포함하는, 공개특허 10-2025-0022866-4-것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서,상기 제1 파라미터는 파라미터 W이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 여기서,, 상기 는 시간 도메인의 압축 유닛임 - ; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 여기서,, 는 올림이고, 는 내림임 - ; 를 포함하고, 상기 파라미터 W는, 1) CSI 보고 시각에 대응되는 슬롯; 2) CSI 참조 자원이 위치한 슬롯; 3) CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 및4) CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정되는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항 내지 제7항 중 어느 한 항에 있어서,상기 시간 도메인의 압축 유닛 를 결정하는 단계를 더 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 압축 유닛 는 이고, 상기 는 1보다 작거나 같은 정수이고, 상기 는 채널 가간섭성시간이고; 또는 상기 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는 상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 은 인접 CSI의 측정 간격이고; 또는 공개특허 10-2025-0022866-5-상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 는 인접 CSI에 의해 측정된최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값인,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서,상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계는, 상기 단말 기기에 의해 CSI-RS로써 예측하여 획득된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는 단계를 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제2항에 있어서,상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계는, 상기 네트워크측 기기에 의해 설정된 TD 기본 벡터 또는 DD 기본 벡터의 길이를 수신하는 단계를 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 내지 제11항 중 어느 한 항에 있어서,상기 코드북 지시 정보는 적어도 하나의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 적어도 하나의 TD 기본 벡터 또는 DD 기본 벡터로 구성된행렬 중의 적어도 하나 또는 여러 조합을 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "네트워크측 기기에 의해 수행되는 채널 상태 정보 피드백 방법에 있어서,시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계; 단말 기기에 코드북 파라미터를 설정하는 단계; 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이 및 상기 코드북 파라미터를 상기 단말 기기에 송신하는 단계; 상기 단말 기기에 의해 상기 길이 및 상기 코드북 파라미터를 통해 결정된 데이터 전송층에 대응되는 코드북 지시 정보를 수신하는 단계; 및상기 코드북 지시 정보에 따라 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 단계; 를 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2025-0022866-6-제13항에 있어서,상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계는, 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계를 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의배와 같은 것을 결정하는 단계; 또는상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의CSI-RS 자원의 개수의 배와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는 단계 - 상기 은 양의정수이고, 상기 는 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고, 상기 는 시간 도메인의 압축 유닛임 - ; 를 포함하는, 것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는 단계를 포함하고;상기 Wmeas는 상기 CSI-RS 측정 윈도우의 크기이고, 상기 d는 상기 인접 CSI 측정 시각 사이의 간격, 또는 상기인접 CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값인,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "공개특허 10-2025-0022866-7-제14항에 있어서,상기 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와같은 것을 결정하는 단계; 또는상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의CSI 측정 횟수의 배와 같은 것을 결정하는 단계; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 상기 는 양의 정수이고, 상기 B는 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 상기 는 시간 도메인의 압축 유닛임 - ; 를 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제14항에 있어서,상기 제1 파라미터는 파라미터 W이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계- 여기서,, 상기 는 시간 도메인의 압축 유닛임 - ; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 여기서,, 는 올림이고, 는 내림임 - ; 를 포함하고,상기 파라미터 W는, 1) CSI 보고 시각에 대응되는 슬롯; 2) CSI 참조 자원이 위치한 슬롯; 3) CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 4) CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정되는,것을 특징으로 하는 채널 상태 정보 피드백 방법. 공개특허 10-2025-0022866-8-청구항 19 제15항 내지 제18항 중 어느 한 항에 있어서,상기 시간 도메인의 압축 유닛 를 결정하는 단계를 더 포함하는, 것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 압축 유닛 는 이고, 상기 는 1보다 작거나 같은 정수이고, 상기 는 채널 가간섭성시간이고; 또는 상기 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는 상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 은 인접 CSI의 측정 간격이고; 또는 상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 는 인접 CSI에 의해 측정된최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값인,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제13항에 있어서,상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계는, 상기 단말 기기에 의해 보고된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, 상기 TD 기본 벡터 또는DD 기본 벡터의 길이를 결정하는 단계를 포함하는,것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제13항 내지 제21항 중의 어느 한 항에 있어서,상기 코드북 지시 정보에 따라 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 단계는, 상기 코드북 지시 정보 및 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이의 결정 방식에 따라, 코드북 구조 또는프리코딩 행렬 표시자(PMI) 예측 알고리즘으로써 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 단계를 포함하는, 것을 특징으로 하는 채널 상태 정보 피드백 방법."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "통신 장치에 있어서,시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된 코드공개특허 10-2025-0022866-9-북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는 처리 모듈; 상기 코드북 지시 정보가 포함된 채널 상태 정보(CSI)를 상기 네트워크측 기기에 송신하는 송수신 모듈 - 상기코드북 지시 정보는 상기 네트워크측 기기가 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 것을 지시하는데 사용됨 - ; 을 포함하는, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,상기 처리 모듈은, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하고; 상기 길이 및 상기 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북지시 정보를 결정하는데 사용되는, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서,상기 처리 모듈은, 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용되는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제25항에 있어서,상기 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고; 상기 처리 모듈은, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의배와 같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의CSI-RS 자원의 개수의 배와 같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는데 사용되고; 상기 은양의 정수이고, 상기 는 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정윈도우 내의 CSI-RS 자원의 개수이고, 상기 는 시간 도메인의 압축 유닛인,공개특허 10-2025-0022866-10-것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제25항에 있어서,,상기 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격이고; 상기 처리 모듈은, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는데 사용되고; 상기Wmeas는 상기 CSI-RS 측정 윈도우의 크기이고, 상기 d는 상기 인접 CSI 측정 시각 사이의 간격, 또는 상기 인접CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값인,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제25항에 있어서,,상기 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고; 상기 처리 모듈은, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의CSI 측정 횟수의 배와 같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용되고; 상기 는 양의정수이고, 상기 B는 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 상기 는 시간 도메인의 압축 유닛인,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제25항에 있어서,상기 제1 파라미터는 파라미터 W이고; 상기 처리 모듈은, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하고; 여기서, ,상기 는 시간 도메인의 압축 유닛임 - ; 또는공개특허 10-2025-0022866-11-상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용되고; 여기서, , 는 올림이고, 는 내림이고; 상기 파라미터 W는, 1) CSI 보고 시각에 대응되는 슬롯; 2) CSI 참조 자원이 위치한 슬롯; 3) CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 및4) CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정되는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제26항 내지 제29항 중 어느 한 항에 있어서,상기 처리 모듈은 또한, 상기 시간 도메인의 압축 유닛 를 결정하는데 사용되는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제30항에 있어서,상기 압축 유닛 는 이고, 상기 는 1보다 작거나 같은 정수이고, 상기 는 채널 가간섭성시간이고; 또는상기 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는 상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 은 인접 CSI의 측정 간격이고; 또는 상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 는 인접 CSI에 의해 측정된최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값인, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제24항에 있어서,상기 처리 모듈은, 상기 단말 기기에 의해 CSI-RS로써 예측하여 획득된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용되는,공개특허 10-2025-0022866-12-것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제23항에 있어서,상기 송수신 모듈은 또한, 상기 네트워크측 기기에 의해 설정된 TD 기본 벡터 또는 DD 기본 벡터의 길이를 수신하는데 사용되는, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제23항 내지 제33항 중 어느 한 항에 있어서,상기 코드북 지시 정보는 적어도 하나의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 적어도 하나의 TD 기본 벡터 또는 DD 기본 벡터로 구성된행렬 중의 적어도 하나 또는 여러 조합을 포함하는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "통신 장치에 있어서,처리 모듈 및 송수신 모듈을 포함하고;상기 처리 모듈은 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하고; 상기 처리 모듈은 또한, 단말 기기에 코드북 파라미터를 설정하는데 사용되고;상기 송수신 모듈은 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이 및 상기 코드북 파라미터를 상기 단말 기기에송신하고; 상기 송수신 모듈은 또한, 상기 단말 기기에 의해 상기 길이 및 상기 코드북 파라미터를 통해 결정된 데이터 전송층에 대응되는 코드북 지시 정보를 수신하는데 사용되고; 상기 처리 모듈은 또한, 상기 코드북 지시 정보에 따라 부동한 시각에 대응되는 프리코딩 행렬을 결정하는데 사용되는, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제35항에 있어서,상기 처리 모듈은, 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용되는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "공개특허 10-2025-0022866-13-제35항에 있어서,상기 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고; 상기 처리 모듈은, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의배와 같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의CSI-RS 자원의 개수의 배와 같은 것을 결정하며; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용되고; 상기 은양의 정수이고, 상기 는 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정윈도우 내의 CSI-RS 자원의 개수이고, 상기 는 시간 도메인의 압축 유닛인, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제36항에 있어서,상기 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격이고; 상기 처리 모듈은, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용되고; 상기Wmeas는 상기 CSI-RS 측정 윈도우의 크기이고, 상기 d는 상기 인접 CSI 측정 시각 사이의 간격, 또는 상기 인접CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값인,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제36항에 있어서,상기 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고; 상기 처리 모듈은, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와같은 것을 결정하고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의CSI 측정 횟수의 배와 같은 것을 결정하며; 또는 공개특허 10-2025-0022866-14-상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용되고; 상기 는 양의정수이고, 상기 B는 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 상기 는 시간 도메인의 압축 유닛인,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제36항에 있어서,상기 제1 파라미터는 파라미터 W이고; 상기 처리 모듈은, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하고; 여기서, ,상기 는 시간 도메인의 압축 유닛이고; 또는 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용되고; 여기서, , 는 올림이고, 는 내림이고; 상기 파라미터 W는, 1) CSI 보고 시각에 대응되는 슬롯; 2) CSI 참조 자원이 위치한 슬롯; 3) CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 및4) CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정되는, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제37항 내지 제40항 중 어느 한 항에 있어서,상기 처리 모듈은 또한 상기 시간 도메인의 압축 유닛 를 결정하는데 사용되는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "제41항에 있어서,상기 압축 유닛 는 이고, 상기 는 1보다 작거나 같은 정수이고, 상기 는 채널 가간섭성시간이고; 또는 공개특허 10-2025-0022866-15-상기 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 은 인접 CSI의 측정 간격이고; 또는상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 는 인접 CSI에 의해 측정된최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값인,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "제35항에 있어서,상기 처리 모듈은, 상기 단말 기기에 의해 보고된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, 상기 TD 기본 벡터 또는DD 기본 벡터의 길이를 결정하는데 사용되는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "제35항 내지 제43항 중 어느 한 항에 있어서,상기 처리 모듈은, 상기 코드북 지시 정보 및 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이의 결정 방식에 따라, 코드북 구조 또는프리코딩 행렬 표시자(PMI) 예측 알고리즘으로써 부동한 시각에 대응되는 프리코딩 행렬을 결정하는데사용되는,것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "통신 장치에 있어서,프로세서 및 컴퓨터 프로그램이 저장되어 있는 메모리를 포함하고, 상기 프로세서는 상기 메모리에 저장된 컴퓨터 프로그램을 수행함으로, 상기 통신 장치가 제1항 내지 제12항 중 어는 한 항의 방법이 수행하도록 하는, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "통신 장치에 있어서,프로세서 및 컴퓨터 프로그램이 저장되어 있는 메모리를 포함하고, 상기 프로세서는 상기 메모리에 저장된 컴퓨터 프로그램을 수행함으로, 상기 통신 장치가 제13항 내지 제22항 중 어는 한 항의 방법이 수행하도록 하는, 것을 특징으로 하는 통신 장치."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "공개특허 10-2025-0022866-16-명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체에 있어서,상기 명령이 수행될 경우, 제1항 내지 제12항 중 어느 한 항의 방법이 구현되는,것을 특징으로 하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2025-7001783", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체에 있어서,상기 명령이 수행될 경우, 제13항 내지 제22항 중 어느 한 항의 방법이 구현되는,것을 특징으로 하는 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2025-7001783", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 실시예는 채널 상태 정보 피드백 방법 및 장치를 제공한다. 여기서, 당해 방법은, 단말 기기시간 도메 인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된 코드북 파라미터 에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는 단계; 단말 기기가 코드북 지시 정보를 포함하 (뒷면에 계속)"}
{"patent_id": "10-2025-7001783", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 통신 기술 분야에 관한 것으로, 특히 채널 상태 정보 피드백 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2025-7001783", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "중고속으로 이동하는 단말 기기에 대해, 채널이 시간 도메인에서 신속히 변화하므로, 채널 상태 정보(Channel State Information, CSI)는 여전히 전통 Type II 코드북을 기반으로 피드백하고, 피드백된 CSI 및 현재 채널 정보는 더는 매칭되지 않아, 시스템 성능의 저하를 초래한다. 따라서, 어떻게 중고속 이동 장면 하의 단말 기기 에 의해 피드백된 CSI를 현재 채널 정보와 매칭되도록 하는 것이, 시급히 해결해야 할 문제로 되고 있다. 본 출원의 실시예는 채널 상태 정보 피드백 방법 및 장치를 제공하고, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정함으로, 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터 를 결정하고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터 를 도입하도록 하고, 부동한 시각에 대응되는 프리코딩을 결정할 수 있을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코드북 파라미터의 중복 보고를 방지할 수도 있고, 시그널링 오버헤드를 감소한다. 제1 측면에 따르면, 본 출원의 실시예는 단말 기기에 의해 수행되는 채널 상태 정보 피드백 방법을 제공하고, 상기 방법은, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된 코드 북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는 단계; 상기 코드북 지시 정보가 포함된 채널 상태 정보(CSI)를 상기 네트워크측 기기에 송신하는 단계 - 상기 코드북 지시 정보는 상기 네트워크측 기기가 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 것을 지시하는데 사용 됨 - ; 를 포함한다. 당해 기술 수단에서, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정함으로, 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기 반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 미래 시각의 프리코딩 계산 또는 예측을 구현하여, 계산 또는 예측된 프리코딩과 미래 해당 시각의 채널이 매칭되도록 하고, 부동한 시각에 대응되는 프리코딩을 결정할 수 있을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코드북 파라미터의 중복 보고를 방지할 수도 있고, 시그널링 설정 오버헤드 또는 보고 피드백 오버헤드를 감소할 수 있다. 일 구현 방식에서, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는 단계는, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계; 상기 길이 및 상기 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는 단계; 를 포함한다. 일 구현 방식에서, 상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계 는, 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는 단계를 포함한다. 일 구현 가능한 방식에서, 상기 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측 정 윈도우 내의 CSI-RS 자원의 개수이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는 단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 의 배와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수의 배와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 상기 은 양의 정수이고, 상기 는 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고, 상기 는 시간 도메인의 압축 유닛 임 - ; 를 포함한다. 일 구현 가능한 방식에서, 상기 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격 이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결 정하는 단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단 계를 포함하고; 상기 Wmeas는 상기 CSI-RS 측정 윈도우의 크기이고, 상기 d는 상기 인접 CSI 측정 시각 사이의 간격, 또는 상기 인접 CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값이다. 일 구현 가능한 방식에서, 상기 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이 고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정 하는 단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI- RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI 측정 횟수의 배와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 상기 는 양의 정수이고, 상기 B상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 상기 는 시간 도메인의 압축 유닛 임 - ; 를 포함한다. 일 구현 가능한 방식에서, 상기 제1 파라미터는 파라미터 W이고; 상기 네트워크측 기기에 의해 설정된 제1 파라 미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는 단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 여기서, , 상기 는 시간 도메인의 압축 유닛 임 - ; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 여 기서, , 는 올림이고, 는 내림임 - ; 를 포함한다. 상기 파라미터 W는 하기의, 1)CSI 보고 시각에 대응되는 슬롯; 2)CSI 참조 자원이 위치한 슬롯; 3)CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 및 4)CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정 된다. 일 구현 가능한 방식에서, 상기 방법은, 상기 시간 도메인의 압축 유닛 를 결정하는 단계를 더 포함한다. 일 구현 가능한 방식에서, 상기 압축 유닛 는 이고, 상기 는 1보다 작거나 같은 정수이고, 상기"}
{"patent_id": "10-2025-7001783", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "는 채널 가간섭성(coherence) 시간이고; 또는, 상기 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는, 상 기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 은 인접 CSI의 측정 간격이고; 또는, 상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 는 인접 CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값이다. 일 구현 방식에서, 상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계 는, 상기 단말 기기에 의해 CSI-RS로써 예측하여 획득된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는 단계를 포함한다. 일 구현 방식에서, 상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계 는, 상기 네트워크측 기기에 의해 설정된 TD 기본 벡터 또는 DD 기본 벡터의 길이를 수신하는 단계를 포함한다. 일 구현 방식에서, 상기 코드북 지시 정보는 적어도 하나의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계 수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 적어도 하나의 TD 기본 벡터 또는 DD 기본 벡터로 구성된 행렬 중의 적어도 하나 또는 여러 조합을 포함한다. 제2 측면에 따르면, 본 출원의 실시예는 네트워크측 기기에 의해 수행되는 다른 채널 상태 정보 피드백 방법을 제공하고, 상기 방법은, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계; 단말 기기에 코드북 파라미터를 설정하는 단계; 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이 및 상기 코 드북 파라미터를 상기 단말 기기에 송신하는 단계; 상기 단말 기기에 의해 상기 길이 및 상기 코드북 파라미터 를 통해 결정된 데이터 전송층에 대응되는 코드북 지시 정보를 수신하는 단계; 및 상기 코드북 지시 정보에 따 라 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 단계; 를 포함한다. 당해 기술 수단에서, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정함으로, 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기 반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 미래 시각의 프리코딩 계산 또는 예측을 구현하여, 계산 또는 예측된 프리코딩과 미래 해당 시각의 채널이 매칭되도록 하고, 부동한 시각에 대응되는 프리코딩을 결정할 수 있을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코드북 파라미터의 중복보고를 방지할 수도 있고, 시그널링 설정 오버헤드 또는 보고 피드백 오버헤드를 감소할 수 있다. 일 구현 방식에서, 상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계 는, 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정 하는 단계를 포함한다. 일 구현 가능한 방식에서, 상기 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측 정 윈도우 내의 CSI-RS 자원의 개수이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는 단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트 워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의 배와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이 가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수의 배와 같은 것을 결 정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단계 - 상기 은 양의 정수이고, 상기 는 상기 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또 는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고, 상기 는 시간 도메인의 압축 유닛dla - ; 를 포함한 다. 일 구현 가능한 방식에서, 상기 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격 이고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결 정하는 단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는 단 계를 포함하고; 상기 Wmeas는 상기 CSI-RS 측정 윈도우의 크기이고, 상기 d는 상기 인접 CSI 측정 시각 사이의 간격, 또는 상기 인접 CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값이다. 일 구현 가능한 방식에서, 상기 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이 고; 상기 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정 하는 단계는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟 수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 상기 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI 측정 횟수의 배와 같은 것을 결정하는 단계; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이 가 와 같은 것을 결정하는 단계 - 상기 는 양의 정수이고, 상기 B상기 네트워크측 기기에 의해 설정 된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 상기 는 시간 도메인의 압축 유닛임 - ; 를 포함한다. 일 구현 가능한 방식에서, 상기 제1 파라미터는 파라미터 W이고; 상기 네트워크측 기기에 의해 설정된 제1 파라 미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는 단계는, 상기 TD 기본 벡터 또는 DD 기본 벡 터의 길이가 와 같은 것을 결정하는 단계 - 여기서, , 상기 는 시간 도메인의 압 축 유닛이고; 또는, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하 는 단계 - 여기서, , 는 올림이고, 는 내림임 - ; 를 포함하고; 상기 파라미터 W는 하기의, 1)CSI 보고 시각에 대응되는 슬롯; 2)CSI 참조 자원이 위치한 슬롯; 3)CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 4)CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대 응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정된다. 일 구현 가능한 방식에서, 상기 방법은, 상기 시간 도메인의 압축 유닛 를 결정하는 단계를 더 포함한다. 일 구현 가능한 방식에서, 상기 압축 유닛 는 이고, 상기 는 1보다 작거나 같은 정수이고, 상기"}
{"patent_id": "10-2025-7001783", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "는 채널 가간섭성 시간이고; 또는, 상기 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는, 상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 은 인접 CSI의 측정 간격이고; 또는, 상기 압축 유닛 는 이고, 상기 는 1보다 크거나 같은 정수이고, 상기 는 인접 CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값이다. 일 구현 방식에서, 상기 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는 단계 는, 상기 단말 기기에 의해 보고된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는 단계를 포함한다. 일 구현 방식에서, 상기 코드북 지시 정보에 따라 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 단계는, 상기 코드북 지시 정보 및 상기 TD 기본 벡터 또는 DD 기본 벡터의 길이의 결정 방식에 따라, 코드북 구조 또는 프리코딩 행렬 표시자(PMI) 예측 알고리즘으로써 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 단계를 포 함한다. 제3 측면에 따르면, 본 출원의 실시예는 통신 장치를 제공하고, 당해 통신 장치는 상기 제1 측면에 따른 방법에 서 단말 기기의 일부 또는 모든 기능을 구비한다. 예를 들면, 통신 장치의 기능은 본 출원의 일부 또는 모든 실 시예의 기능을 구비할 수 있고, 본 출원의 임의의 실시예를 단독 수행하는 기능을 구비할 수도 있다. 상기 기능 은 하드웨어를 통해 구현 가능하고, 하드웨어를 통해 해당 소프트웨어를 구현함으로 구현될 수도 있다. 상기 하 드웨어 또는 소프트웨어는 하나 또는 복수의 상기 기능에 대응되는 유닛 또는 모듈을 포함한다. 일 구현 방식에서, 당해 통신 장치의 구조는 송수신 모듈 및 처리 모듈을 포함하고, 상기 처리 모듈은 통신 장 치가 상기 방법의 해당 기능을 수행하는 것을 서포트하도록 구성된다. 상기 송수신 모듈은 통신 장치와 기타 기 기 사이의 통신을 서포트하도록 구성된다. 상기 통신 장치는 저장 모듈을 더 포함하고, 상기 저장 모듈은 송수 신 모듈 및 처리 모듈과 결합하도록 구성되고, 통신 장치에 필요되는 컴퓨터 프로그램 및 데이터를 저장한다. 예시로서, 처리 모듈은 프로세서일 수 있고, 송수신 모듈은 트랜시버 또는 통신 인터페이스일 수 있고, 저장 모 듈은 메모리일 수 있다. 제4 측면에 따르면, 본 출원의 실시예는 통신 장치를 제공하고, 당해 통신 장치는 상기 제2 측면에 따른 방법에 서 단말 기기의 일부 또는 모든 기능을 구비한다. 예를 들면, 통신 장치의 기능은 본 출원의 일부 또는 모든 실 시예의 기능을 구비할 수 있고, 본 출원의 임의의 실시예를 단독 수행하는 기능을 구비할 수도 있다. 상기 기능 은 하드웨어를 통해 구현 가능하고, 하드웨어를 통해 해당 소프트웨어를 구현될 수도 있다. 상기 하드웨어 또는 소프트웨어는 하나 또는 복수의 상기 기능에 대응되는 유닛 또는 모듈을 포함한다. 일 구현 방식에서, 당해 통신 장치의 구조는 송수신 모듈 및 처리 모듈을 포함하고, 당해 처리 모듈은 통신 장 치가 상기 방법의 해당 기능을 수행하는 것을 서포트하도록 구성된다. 송수신 모듈은 통신 장치와 기타 기기 사 이의 통신을 서포트하도록 구성된다. 상기 통신 장치는 저장 모듈을 더 포함하고, 상기 저장 모듈은 송수신 모 듈 및 처리 모듈과 결합하도록 구성되고, 통신 장치 필요의 컴퓨터 프로그램 및 데이터를 저장한다. 예시로서, 처리 모듈은 프로세서일 수 있고, 송수신 모듈은 트랜시버 또는 통신 인터페이스일 수 있고, 저장 모 듈은 메모리일 수 있다. 제5 측면에 따르면, 본 출원의 실시예는 통신 장치를 제공하고, 당해 통신 장치는 프로세서를 포함하고, 당해 프로세서가 메모리의 컴퓨터 프로그램을 스케줄링할 경우, 상기 제1 측면의 방법을 구현한다. 제6 측면에 따르면, 본 출원의 실시예는 통신 장치를 제공하고, 당해 통신 장치는 프로세서를 포함하고, 당해 프로세서가 메모리의 컴퓨터 프로그램을 스케줄링할 경우, 상기 제2 측면의 방법을 구현한다. 제7 측면에 따르면, 본 출원의 실시예는 통신 장치를 제공하고, 당해 통신 장치는 프로세서 및 컴퓨터 프로그램 이 저장되어 있는 메모리를 포함하고; 상기 프로세서는 당해 메모리에 저장된 컴퓨터 프로그램을 수행하여, 당 해 통신 장치가 상기 제1 측면의 방법을 수행하도록 한다. 제8 측면에 따르면, 본 출원의 실시예는 통신 장치를 제공하고, 당해 통신 장치는 프로세서 및 컴퓨터 프로그램 이 저장되어 있는 메모리를 포함하고; 상기 프로세서는 당해 메모리에 저장된 컴퓨터 프로그램을 수행하여, 당 해 통신 장치가 상기 제2 측면의 방법을 수행하도록 한다. 제9 측면에 따르면, 본 출원의 실시예는 통신 장치를 제공하고, 당해 장치는 프로세서 및 인터페이스 회로를 포 함하고, 당해 인터페이스 회로는 코드 명령을 수신하고 당해 프로세서에 전송하는데 사용되고, 당해 프로세서는 상기 코드 명령을 작동시켜 당해 장치가 상기 제1 측면의 방법을 수행하도록 하는데 사용된다. 제10 측면에 따르면, 본 출원의 실시예는 통신 장치를 제공하고, 당해 장치는 프로세서 및 인터페이스 회로를 포함하고, 당해 인터페이스 회로는 코드 명령을 수신하고 당해 프로세서에 전송하는데 사용되고, 당해 프로세서 는 상기 코드 명령을 작동시켜 당해 장치가 상기 제2 측면의 방법을 수행하도록 하는데 사용된다. 제11 측면에 따르면, 본 출원의 실시예는 채널 상태 정보 피드백 시스템을 제공하고, 당해 시스템은 제3 측면에 따른 통신 장치 및 제4 측면에 따른 통신 장치, 또는, 당해 시스템은 제5 측면에 따른 통신 장치 및 제6 측면에 따른 통신 장치를 포함하고, 또는, 당해 시스템은 제7 측면에 따른 통신 장치 및 제8 측면에 따른 통신 장치를 포함하고, 또는, 당해 시스템은 제9 측면에 따른 통신 장치 및 제10 측면에 따른 통신 장치를 포함한다. 제12 측면에 따르면, 본 발명의 실시예는 상기 단말 기기에 의해 사용되는 명령을 저장하는 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 명령이 수행될 경우, 상기 단말 기기는 상기 제1 측면의 방법을 수행한다. 제13 측면에 따르면, 본 발명의 실시예는 상기 네트워크측 기기에 의해 사용되는 명령을 저장하는 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 명령이 수행될 경우, 상기 네트워크측 기기는 상기 제2 측면의 방법을 수행한 다. 제14 측면에 따르면, 본 출원은 컴퓨터 프로그램을 저장하는 컴퓨터 프로그램 제품을 제공하고, 이가 컴퓨터에 서 작동될 경우, 컴퓨터는 상기 제1 측면의 방법을 수행한다. 제15 측면에 따르면, 본 출원은 컴퓨터 프로그램을 저장하는 컴퓨터 프로그램 제품을 제공하고, 이가 컴퓨터에 서 작동될 경우, 컴퓨터는 상기 제2 측면의 방법을 수행한다. 제16 측면에 따르면, 본 발명은 칩 시스템을 제공하고, 당해 칩 시스템은 적어도 하나의 프로세서 및 인터페이 스를 포함하고, 단말 기기가 제1 측면에 언급된 기능을 구현하도록 서포트하는데 사용된다. 예를 들면, 상기 방 법에 언급된 데이터 및 정보 중의 적어도 하나를 결정 또는 처리한다. 일 가능한 설계에서, 상기 칩 시스템은 단말 기기에 필요한 컴퓨터 프로그램 및 데이터를 저장하는 메모리를 더 포함한다. 당해 칩 시스템은, 칩에 의 해 구성될 수 있고, 칩 및 기타 분립 컴포넌트를 포함할 수도 있다. 제17 측면에 따르면, 본 발명은 칩 시스템을 제공하고, 당해 칩 시스템은 적어도 하나의 프로세서 및 인터페이 스를 포함하고, 네트워크측 기기가 제2 측면에 언급된 기능을 구현하도록 서포트하는데 사용된다. 예를 들면, 상기 방법에 언급된 데이터 및 정보 중의 적어도 하나를 결정 또는 처리한다. 일 가능한 설계에서, 상기 칩 시 스템은 네트워크측 기기에 필요한 컴퓨터 프로그램 및 데이터를 저장하는 메모리를 더 포함한다. 당해 칩 시스 템은, 칩에 의해 구성될 수 있고, 칩 및 기타 분립 컴포넌트를 포함할 수도 있다. 제18 측면에 따르면, 본 발명은 컴퓨터 프로그램을 제공하고, 그것이 컴퓨터에서 작동될 경우, 컴퓨터는 상기 제1 측면의 방법을 수행한다. 제19 측면에 따르면, 본 발명은 컴퓨터 프로그램을 제공하고, 그것이 컴퓨터에서 작동될 경우, 컴퓨터는 상기 제2 측면의 방법을 수행한다."}
{"patent_id": "10-2025-7001783", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래는 본 발명의 실시예를 상세히 설명하고, 상기 실시예의 예시는 도면에서 나타내고, 시종일관 동일하거나 유사한 레이블은 동일하거나 유사한 소자 또는 동일하거나 유사한 기능을 구비한 소자를 나타낸다. 아래의 참조 도면을 통해 설명된 실시예는 예시적인 것이고, 본 발명을 설명하기 위한 것이고, 본 발명에 대한 한정으로 간 주되서는 안된다. 여기서, 본 발명의 설명에서, 별도로 설명하지 않는 한, \"또는\" 은 또는이라는 의미를 나타낸 다. 예를 들면, A 또는 B는 A 또는 B를 나타낼 수 있고, 예를 들면 본 설명의 \"TD 기본 벡터 또는 DD 기본 벡터\"는 TD 기본 벡터 또는 DD 기본 벡터를 나타낼 수 있고; 본 설명의 \"및/또는\"은 오직 관련 대상의 관련 관 계를 설명하고, 3종 관계가 존재할 수 있다는 것을 나타낸다. 예를 들면, A 및/또는 B는, A의 단독 존재, A 및 B의 동시 존재, B의 단독 존재 상황을 나타낸다. 중고속으로 이동하는 단말 기기에 대해, 채널이 시간 도메인에서 신속히 변화하므로, 채널 상태 정보(Channel State Information, CSI)는 여전히 전통 Type II 코드북을 기반으로 피드백하고, 피드백된 CSI 및 현재 채널 정보는 더는 매칭되지 않아, 시스템 성능의 저하를 초래한다. 당해 문제를 해결하기 위해, 연구에 따르면 Rel- 16 또는 17 Type II 코드북의 기반에서 시간 도메인 또는 도플러(Doppler) 도메인 기본 벡터를 도입하고, 미래 시각의 프리코딩 예측을 구현할 수 있어, 예측된 프리코딩과 미래 해당 시각의 채널이 매칭되도록 한다. Rel-16 또는 17 Type II 코드북을 기반으로 하는 강된 CSI 피드백에 대응되는 코드북 구조는 또는 로 쓸 수 있다. 여기서, 당해 2종 코드북 구조 의 은 복수의 공간 도메인(Spatial Domain, SD) 기본 벡터로 구성된 행렬 또는 적어도 하나의 단위 벡터로 구성된 단위 행렬을 나타내고, 는 조합 계수 행렬을 나타내고, 는 복수의 주파수 도메인(Frequency Domain, FD) 기본 벡터로 구성된 행렬을 나타내며, 는 복수의 도플러 도메인(Doppler Domain, DD) 기본 벡터로 구성된 행렬을 나타내고, 는 복수의 시간 도메인(Time Domain, TD) 기본 벡터로 구성된 행렬을 나 타낸다. 코드북에 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하기 위해, TD 기본 벡터의 길이 N4 또는 DD 기본 벡터의 길이 N4를 먼저 결정해야 한다. 현재, 길이 N4의 결정 방법이 없다. 주의해야 할 것은, 중고속 이동 장면에서, TD 기본 벡터 또는 DD 기본 벡터를 도입하여 Rel-16 또는 17 Type II 코드북에 대해 증강 설계를 할 경우, 우선 TD 기본 벡터의 길이 N4 또는 DD 기본 벡터의 길이 N4를 결정하여, 부 동한 시각에 대응되는 프리코딩을 결정해야 한다. 따라서, 본 출원의 실시예는 채널 상태 정보 피드백 방법 및 장치를 제공하고, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정함으로, 당해 길 이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기반 에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 부동한 시각에 대응되는 프리코 딩을 결정할 수 있을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코드북 파라미터의 중복 보고를 방지할 수도 있고, 시그널링 오버헤드를 감소한다. 본 출원의 실시예에서 제공하는 채널 상태 정보 피드백 방법을 더 잘 이해하기 위해, 아래는 우선 본 출원의 실 시예에 적용되는 통신 시스템을 설명한다. 도1은 본 출원의 실시예에 따른 통신 시스템의 아키텍처 다이어그램이다. 당해 통신 시스템은 1개의 네트워크측 기기 및 1개의 단말 기기를 포함하나 이에 한정되지 않고, 도1에 도시된 바와 같은 기기 수량 및 형태는 예시에 만 사용되고 본 출원의 실시예에 대한 한정을 구성하지 않고, 실제 응용에서 2개의 또는 2개 이상의 네트워크측 기기, 2개의 또는 2개 이상의 단말 기기를 포함할 수 있다. 도1에 도시된 바와 같은 통신 시스템은 1개의 네트 워크측 기기, 1개의 단말 기기를 포함하는 것을 예로 든다. 설명해야 할 것은, 본 출원 실시예의 기술 수단은 롱 텀 에볼루션(long term evolution, LTE) 시스템, 5세대 (5th generation, 5G) 이동 통신 시스템, 5G 엔알(new radio, NR) 시스템, 또는 기타 미래의 신형 이동 통신 시스템 등과 같은 각 통신 시스템에 적용될 수 있다. 본 출원 실시예의 네트워크측 기기는 네트워크측의 신호를 송신 또는 수신하는 엔티티이다. 예를 들면, 네 트워크측 기기는 이노드비(evolved NodeB, eNB), 전송 포인트(transmission reception point, TRP), NR 시스템의 차세대 기지국(next generation NodeB, gNB), 기타 미래 이동 통신 시스템의 기지국 또는 무선 충실도 (wireless fidelity, WiFi) 시스템의 액세스 노드 등일 수 있다. 본 출원의 실시예는 네트워크측 기기에서 사용 하는 구체적인 기술 및 구체적인 기기 형태에 대해 한정하지 않는다. 본 출원의 실시예에서 제공된 네트워크측 기기는 집중 유닛(central unit, CU)과 분산 유닛(distributed unit, DU)으로 구성된 것일 수 있고, 여기서, CU는 제어 유닛(control unit)이라고 할 수도 있고, CU-DU의 구조로써 네트워크측 기기, 예를 들면 기지국의 프 로토콜 계층을 분해할 수 있고, 일부 프로토콜 계층의 기능은 CU에서 집중 제어하고, 기타 부분 또는 모든 프로 토콜 계층의 기능은 DU에 분산되고, CU는 DU를 집중 제어한다. 본 출원 실시예의 단말 기기는 휴대폰과 같이 사용자측의 신호를 수신 또는 송신하는 엔티티이다. 단말 기 기는 단말 기기(terminal), 사용자 기기(user equipment, UE), 이동국(mobile station, MS), 모바일 단말 기기 (mobile terminal, MT)등으로 불리울 수 있다. 단말 기기는 통신 기능을 구비한 자동차, 스마트 자동차, 휴대폰 (mobile phone), 웨어러블 기기, 태블릿 PC(Pad), 무선 송수신 기능을 구비한 컴퓨터, 가상 현실(virtual reality, VR) 단말 기기, 증강 현실(augmented reality, AR) 단말 기기, 산업 제어(industrial control)의 무 선 단말 기기, 자율 주행(self-driving)의 무선 단말 기기, 원격 수술(remote medical surgery)의 무선 단말 기기, 스마트 그리드(smart grid)의 무선 단말 기기, 운송 안전(transportation safety)의 무선 단말 기기, 스 마트 시티(smart city)의 무선 단말 기기, 스마트 홈(smart home)의 무선 단말 기기 등일 수 있다. 또한 본 발 명의 실시예에서, 단말 기기는 중계(Relay) 등 네트워크측 기기(예를 들면, 기지국)와 데이터 통신을 수행할 수 있는 기타 기기를 더 포함할 수 있다. 본 출원의 실시예는 단말 기기에서 사용하는 구체적인 기술 및 구체적인 기기 형태를 한정하지 않는다. 이해해야 할 것은, 본 출원의 실시예에서 설명된 통신 시스템은 본 출원 실시예의 기술 수단을 더 명확하게 설 명하기 위한 것이고, 본 출원의 실시예에서 제공된 기술 수단에 대한 한정으로 구성되지 않고, 당업자는 시스템 구조의 발전 및 신규 업무 장면의 나타남의 따라, 본 출원의 실시예에서 제공하는 기술 수단은 유사한 기술적 과제에도 적용된다는 것을 알 수 있다. 아래는 도면과 결합하여 본 출원에서 제공하는 채널 상태 정보 피드백 방법채널 상태 정보 피드백 방법 및 장치 를 상세히 설명한다. 도2를 참조하면, 도2는 본 출원의 실시예에 따른 채널 상태 정보 피드백 방법의 개략적인 흐름도이다. 설명해야 할 것은, 본 출원 실시예의 채널 상태 정보 피드백 방법은 단말 기기에 의해 수행될 수 있다. 즉 본 출원 실시 예의 채널 상태 정보 피드백 방법은 단말 기기측에 설명된다. 도2에 도시된 바와 같이, 당해 채널 상태 정보 피 드백 방법은 단계201 내지 202를 포함할 수 있지만 이에 한정 되지 않는다. 단계201에서, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정한다. 선택적으로, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정할 수 있다. 일 구현 방식에서, 당해 길이는 단말 기기에 의해 관련 정보에 따라 결정된 것일 수 있고, 또는, 네트워크측 기기에 의 해 설정된 것일 수도 있다. 예를 들면, 단말 기기는 네트워크측 기기에 의해 설정된 관련 파라미터에 따라 시간 도메인(TD) 기본 벡터의 길이 또는 도플러 도메인(DD) 기본 벡터의 길이를 암시적으로 결정할 수 있다. 또는, 단말 기기는 예측된 Doppler 오프셋 정보, Doppler 확장 등 정보에 따라 시간 도메인(TD) 기본 벡터의 길이 또 는 도플러 도메인(DD) 기본 벡터의 길이를 결정할 수 있다. 또는, 단말 기기는 네트워크측 기기에 의해 설정된 시간 도메인(TD) 기본 벡터의 길이 또는 도플러 도메인(DD) 기본 벡터의 길이를 수신할 수도 있다. 일 구현 방식에서, 단말 기기는 네트워크측 기기(예를 들면 기지국)에서 송신된 코드북 파라미터를 수신할 수 있고, 당해 코드북 파라미터는 네트워크측 기기에 의해 설정된 것이고, 단말 기기가 CSI 정보를 피드백하는 최 대 서포트 파라미터를 지시하는데 사용된다. 일 구현 가능한 방식에서, 단말 기기는 네트워크측 기기(예를 들면 기지국)에 의해 설정된 코드북 파라미터를 수신할 수 있고, 당해 코드북 파라미터 및 TD 기본 벡터의 길이에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정한다. 여기서, 본 출원의 실시예에서, 당해 코드북 지시 정보는 적어도 하나의 공간 도메인(SD) 기 본 벡터로 구성된 행렬, 조합 계수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 적어도 하나의 TD 기본 벡터로 구성된 행렬 중의 적어도 하나 또는 여러 조합을 포함하지만 이에 한정되지 않는다. 여 기서, 당해 TD 기본 벡터의 길이는 코드북에 사용된 TD 기본 벡터를 결정하는데 사용되고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터를 도입한다. 여기서, 당해 \"적어도 하나\"는 하나 또는 복수로 이 해할 수 있고, 다른 구체적인 한정이 있지 않는 한, 당해 \"복수의\"는 2개, 3개와 같이 적어도 2개를 의미한다. 일 구현 가능한 방식에서, 단말 기기는 네트워크측 기기(예를 들면 기지국)에 의해 설정된 코드북 파라미터를 수신할 수 있고, 당해 코드북 파라미터 및 DD 기본 벡터의 길이에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정한다. 여기서, 본 출원의 실시예에서, 당해 코드북 지시 정보는 적어도 하나의 공간 도메인(SD) 기 본 벡터로 구성된 행렬, 조합 계수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 적어도 하나의 DD 기본 벡터로 구성된 행렬 중의 적어도 하나 또는 여러 조합을 포함하나 이에 한정되지 않는다. 여기 서, 당해 DD 기본 벡터의 길이는 코드북에 사용된 DD 기본 벡터를 결정하는데 사용되고, Rel-16 또는 17 Type II 코드북의 기반에서 도플러 도메인 기본 벡터를 도입한다. 단계202에서, 코드북 지시 정보를 포함하는 채널 상태 정보(CSI)를 네트워크측 기기에 송신하고, 여기서, 코드 북 지시 정보는 네트워크측 기기가 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 것을 지시하는데 사용된 다. 선택적으로, 단말 기기는 데이터 전송층에 대응되는 코드북 지시 정보를 결정할 경우, 당해 코드북 지시 정보를 포함하는 채널 상태 정보(CSI)를 네트워크측 기기에 송신할 수 있다. 네트워크측 기기는 단말 기기에서 송신된 당해 CSI를 수신하였을 경우, 당해 CSI의 코드북 지시 정보에 따라, 부동한 시각에 대응되는 프리코딩 행렬을 결정할 수 있다. 일 구현 방식에서, 코드북 지시 정보에 복수의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 복 수의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 복수의 TD 기본 벡터로 구성된 행렬이 포함될 수 있는 것 을 예로 들면, 네트워크측 기기는 당해 코드북 지시 정보를 포함하는 CSI를 수신하였을 경우, 당해 코드북 지시 정보에 따라, 코드북 구조 로써 부동한 시각에 대응되는 프리코딩 행렬을 계산하고, 또는 프리코딩 행렬 표시자(Pre-coding Matrix Indicator, PMI) 예측 알고리즘으로써 부동한 시각에 대응되는 프리코딩 행렬을 예측할 수 있다. 여기서, 은 복수의 공간 도메인 기본 벡터로 구성된 행렬 또는 적어도 하나의 단위 벡터로 구성된 단위 행렬을 나타내고, 는 조합 계수 행렬을 나타내고, 는 복수의 주파수 도메인 기본 벡터로 구성된 행렬을 나타내며, 는 복수의 TD 기본 벡터로 구성된 행렬을 나타낸다. 일 구현 방식에서, 코드북 지시 정보에 복수의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 복 수의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 복수의 DD 기본 벡터로 구성된 행렬이 포함될 수 있는 것 을 예로 들면, 네트워크측 기기는 당해 코드북 지시 정보를 포함하는 CSI를 수신하였을 경우, 당해 코드북 지시 정보에 따라, 코드북 구조 로써 부동한 시각에 대응되는 프리코딩 행렬을 계산하 고, 또는 프리코딩 행렬 표시자(Pre-coding Matrix Indicator, PMI) 예측알고리즘으로써 부동한 시각에 대응되 는 프리코딩 행렬을 예측할 수 있다. 여기서, 은 복수의 공간 도메인 기본 벡터로 구성된 행렬 또는 적어 도 하나의 단위 벡터로 구성된 단위 행렬을 나타내고, 는 조합 계수 행렬을 나타내고, 는 복수의 주 파수 도메인 기본 벡터로 구성된 행렬을 나타내며, 는 복수의 DD 기본 벡터로 구성된 행렬을 나타낸다. 본 출원의 실시예를 수행하여, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정함 으로, 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 미래 시각의 프리 코딩 계산 또는 예측을 구현하여, 계산 또는 예측된 프리코딩과 미래 해당 시각의 채널이 매칭되도록 하고, 부 동한 시각에 대응되는 프리코딩을 결정할 수 있을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코드북 파라 미터의 중복 보고를 방지할 수도 있고, 시그널링 설정 오버헤드 또는 보고 피드백 오버헤드를 감소할 수 있다. 설명해야 할 것은, 단말 기기는 네트워크측 기기에 의해 설정된 관련 파라미터에 따라 TD 기본 벡터의 길이 또 는 DD 기본 벡터의 길이를 암시적으로 결정할 수 있다. 본 출원의 일부 실시예에서, 도3에 도시된 바와 같이, 당해 채널 상태 정보 피드백 방법은 단계301 내지 303을 포함하나 이에 한정되지 않는다. 단계301에서, 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정한다. 선택적으로, 단말 기기는 네트워크측 기기에 의해 설정된 제1 파라미터에 따라 TD 기본 벡터의 길이 또는 DD 기 본 벡터의 길이를 암시적으로 결정할 수 있다. 여기서, 본 출원의 일부 실시예에서, 당해 제1 파라미터는 하기의, 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수; CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수; CSI-RS 측정 윈도우의 크기; 인접 CSI 측정 시각 사이의 간격; CSI 측정 횟수; CSI-RS 측정 윈도우 내의 CSI 측정 횟수; 및 파라미터 W; 중의 적어도 하나를 포함할 수 있지만 이에 한정되지 않는다. 설명해야 할 것은, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우는 CSI-RS 가 일정한 시간 범위 내에 한 번 또는 여러 번의 채널 측정을 수행하는 것을 설명하기 위한 것이고, 네트워크측 기기는 당해 CSI-RS 측정 윈도우를 설정하지 않을 수도 있다. 일 구현 방식에서, 당해 제1 파라미터가 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈도 우 내의 CSI-RS 자원의 개수인 것을 예로 들 경우, 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수에 따라, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이를 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정할 수 있다. 예를 들면, 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 NCSI-RS가 4인 것을 예로 들 경우, TD 기본 벡터의 길 이 또는 DD 기본 벡터의 길이 N4가 4인 것을 결정할 수 있다. 또 예를 들면, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수 가 6인 것을 예로 들 경우, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이 N4가 6인 것을 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의 배와 같은 것을 결정할 수 있다. 여기서, 은 양의 정수이다. 예를 들면, 이 1 이고, 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 NCSI-RS가 4인 것을 예로 들 경우, TD 기본 벡터의 길 이 또는 DD 기본 벡터의 길이 N4가 4인 것을 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측 정 윈도우 내의 CSI-RS 자원의 개수의 배와 같은 것을 결정할 수 있고; 여기서, 은 양의 정수이다. 예를 들면, 이 1이고, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수 가 6인 것을 예로 들 경우, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이 N4가 6인 것을 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 인 것을 결정할 수 있고; 여기서, 은 양의 정수이고, 는 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고, 는 시간 도메인의 압축 유닛이다. 예를 들면, 이 1이고, 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 가 4이고, 가 2ms인 것을 예로 들 경우, TD 기 본 벡터의 길이 또는 DD 기본 벡터의 길이 N4가 인 것을 결정할 수 있다. 즉, 당해 TD 기본 벡터 의 길이 또는 DD 기본 벡터의 길이 N4는 2이다. 설명해야 할 것은, 본 출원의 실시예에서, 상기 CSI-RS 자원의 개수 가 1보다 클 경우, 당해 개의 CSI-RS 자원은 시간 도메인 유형이 동일하거나 부동할 수 았다. 시간 도메인 유형은 주기, 반 지속 및 비주기를 포함한다. 또한, 본 출원의 실시예에서, 상기 CSI-RS 자원의 개수 가 1보다 클 경 우, 당해 개의 CSI-RS 자원은 부동한 기능의 CSI-RS 자원일 수도 있다. 예를 들면, 1개의 CSI-RS는 채널 획득하는 CSI-RS 자원으로 설정되고, 나머지 설정은 시간 주파수 추적하는 CSI-RS 자원으로 설정된다. 본 출원의 일부 실시예에서, 당해 제1 파라미터가 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간 격인 것을 계로 들 경우, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우의 크기 및 인접 CSI 측정 시각 사 이의 간격에 따라, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이를 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 인 것을 결정할 수 있 고; 여기서, Wmeas는 CSI-RS 측정 윈도우의 크기이고, d는 인접 CSI 측정 시각 사이의 간격이고, 또는 d는 인접 CSI 측정의 최대 또는 최소 간격일 수 있고, 또는 d는 복수의 인접 CSI 측정 간격의 평균값일 수도 있다. 본 출원의 일부 실시예에서, 당해 제1 파라미터가 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수 인 것을 예로 들 경우, 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수에 따라, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이를 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정한다. 예를 들면, 네트워크측 기기에 의해 설정된 CSI 측정 횟수 B가 2인 것을 예로 들 경우, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이 N4는 2이다. 또 예를 들면, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI 측정 횟수 B가 2인 것을 예로 들 경우, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이 N4는 2이다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와 같은 것을 결정할 수 있고; 여기서, 는 양의 정수이다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측 정 윈도우 내의 CSI 측정 횟수의 배와 같은 것을 결정할 수 있고; 여기서, 는 양의 정수이다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정할 수 있고; 여 기서, 는 양의 정수이고, B는 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 는 시간 도메인의 압축 유닛이다. 예를 들면, 가 1이고, 네트워크측 기기에 의해 설 정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수 B가 4이고, 가 2ms인 것을 예로 들 경우, TD 기본 벡터 또는 DD 기본 벡터의 길이는 이다. 즉, 당해 TD 기본 벡터의 길이 또는 DD 기본 벡 터의 길이 N4는 2이다. 본 출원의 일부 실시예에서, 당해 제1 파라미터가 파라미터 W인 것을 예로 들 경우, 네트워크측 기기에 의해 설 정된 파라미터 W에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정할 수 있고; 여기서, 는 시간 도메인의 압축 유닛이고, 는 나머지 함수를 나타낸다. 예를 들면, 파라미터 W의 수치가 4이고, 인 것을 예로 들 경우, TD 기본 벡터 또는 DD 기본 벡터의 길이 N4 는 2이다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이 와 같은 것을 결정하 고; 여기서, , 는 올림이고, 는 내림이다. 예를 들면, 파라미터 W의 수치가 5이고, 인 것을 예로 들 경우, TD 기본 벡터 또는 DD 기본 벡터의 길이 N4는 이고, 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이 N4는 =2이다. 여기서, 본 출원의 일부 실시예에서, 당해 파라미터 W는, 1)CSI 보고 시각에 대응되는 슬롯; 2)CSI 참조 자원이 위치한 슬롯; 3)CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 및 4)CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정 될 수 있다. 설명해야 할 것은, CSI 보고 윈도우는 네트워크측 기기에 의해 설정된 것이고, CSI 보고 윈도우를 설정하는 것은 CSI가 일정한 시간 범위 내에 CSI를 한 번 보고한 것을 설명하는데 편리하고, CSI 보고 윈도우를 설정하지 않을 수도 있다. 예를 들면, 당해 파라미터 W는 CSI 보고 윈도우의 길이 WCSI를 나타낼 수 있다. 즉 W=WCSI이다. 또는, 당해 파라 미터 W는 CSI 측정 윈도우의 길이 Wmeas를 나타낼 수 있다. 즉 W=Wmeas이다. 또는, 당해 파라미터 W는 CSI-RS 자원 을 수신하고 CSI 측정을 수행하는 시각에 대응되는 첫 번째 슬롯에서 CSI 보고 윈도우의 오른쪽 경계가 위치하 는 시각에 대응되는 슬롯 까지의 기간을 나타내고, 당해 기간의 단위는 1개의 슬롯이다. 또는, 당해 파라미터 W 는 CSI-RS 측정 윈도우의 오른쪽 경계 또는 왼쪽 경계에 대응되는 슬롯에서 CSI 보고 윈도우의 오른쪽 경계가 위치하는 시각에 대응되는 슬롯 까지의 기간을 나타낸다. 또는, 당해 파라미터 W는 CSI 참조 자원에 대응되는 슬롯에서 CSI 보고 윈도우의 오른쪽 경계가 위치하는 시각에 대응되는 슬롯 까지의 기간을 나타낸다. 설명해야 할 것은, 본 출원의 실시예에서, 상기 설명의 NCSI-RS, B, d, , Wmeas 및 Wmeas의 값은 단말 기기 에 의해 보고될 수 있고, 또는, 네트워크측 기기에 의해 설정될 수 있고, 또는, 단말 기기 및 네트워크측 기기 에 의해 사전 정의될 수도 있다. 본 출원의 일부 실시예에서, 단말 기기는 시간 도메인의 압축 유닛 를 더 결정해야 한다. 여기서, 당해 압축 유닛 는 하기의 임의의 방식을 통해 결정될 수 있다. 일 구현 가능한 방식에서, 당해 압축 유닛 는 일 수 있고, 여기서, 는 1보다 작거나 같은 정수이고, 는 채널 가간섭성 시간이다. 여기서, 당해 채널 가간섭성 시간은 , 당해 는 채널의 Doppler 확장이다. 일 구현 가능한 방식에서, 당해 압축 유닛 는 CSI-RS 자원의 측정 주기일 수 있다. 일 구현 가능한 방식에서, 당해 압축 유닛 는 일 수 있고, 여기서, 는 1보다 크거나 같은 정수이고, 은 인접 CSI의 측정 간격이다. 예를 들면, 균등한 여러 번의 CSI 측정에 있어서, 은 인접 CSI의 측정 간 격일 수 있고, 당해 및 의 수치로써 당해 압축 유닛 를 결정할 수 있다. 일 구현 가능한 방식에서, 당해 압축 유닛 는 일 수 있고, 여기서, 는 1보다 크거나 같은 정수이고, 는 인접 CSI 측정의 최대 또는 최소 간격이고, 또는 는 복수의 인접 CSI 측정 간격의 평균값일 수도 있 다. 예를 들면, 불 균등한 여러 번의 CSI 측정에 있어서, 는 인접 CSI 측정의 최대 또는 최소 간격일 수 있 고, 당해 및 의 수치로써 당해 압축 유닛 를 결정할 수 있다. 설명해야 할 것은, 본 출원의 실시예에서, 상기 설명의 및 의 값은 단말 기기에 의해 보고될 수 있고, 또는, 네트워크측 기기에 의해 설정될 수 있고, 또는 단말 기기 및 네트워크측 기기에 의해 사전 정의될 수도 있다. 단계302에서, 네트워크측 기기에 의해 설정된 코드북 파라미터 및 길이에 따라, 데이터 전송층에 대응되는 코드 북 지시 정보를 결정한다. 여기서, 단계302는 본 출원의 각 실시예 중의 임의의 방식으로써 구현될 수 있고, 본 출원의 실시예는 이에 대 해 한정하지 않고, 더는 설명하지 않는다. 단계303에서, 코드북 지시 정보를 포함하는 채널 상태 정보(CSI)를 네트워크측 기기에 송신하고, 여기서, 코드 북 지시 정보는 네트워크측 기기가 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 것을 지시하는데 사용된 다. 여기서, 단계302는 본 출원의 각 실시예 중의 임의의 방식으로써 구현될 수 있고, 본 출원의 실시예는 이에 대 해 한정하지 않고, 더는 설명하지 않는다. 본 출원의 실시예를 수행함으로, 네트워크측 기기에 의해 설정된 관련 파라미터에 따라 TD 또는 DD 기본 벡터의 길이를 암시적으로 결정할 수 있음으로, 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 미래 시각의 프리코딩 계산 또는 예측을 구현하여, 계산 또는 예측된 프리코딩과 미래 해당 시각의 채널이 매칭되도록 하고, 부동한 시각에 대응되는 프리코딩을 결정할 수 있을 뿐만 아니라, 코드북 파라 미터의 중복 설정 또는 코드북 파라미터의 중복 보고를 방지할 수도 있고, 시그널링 설정 오버헤드 또는 보고 피드백 오버헤드를 감소할 수 있다. 설명해야 할 것은, 본 출원의 일부 실시예에서, 단말 기기는 예측된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정할 수 있다. 예를 들면, 단말 기기는 네트워크측 기기에 의해 설정된 CSI-RS 자원을 수신하고, 당해 CSI-RS 자원으로써 CSI 측정 처리를 수행하여, 도플러 (Doppler) 오프셋 정보 및 Doppler 확장을 획득하고, 단말 기기는 예측된 도플러(Doppler) 오프셋 정보 및 Doppler 확장 TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정함으로, 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 미래 시각의 프리코딩 계산 또는 예측을 구현하여, 계산 또는 예 측된 프리코딩과 미래 해당 시각의 채널이 매칭되도록 하고, 부동한 시각에 대응되는 프리코딩을 결정할 수 있 을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코드북 파라미터의 중복 보고를 방지할 수도 있고, 시그널 링 설정 오버헤드 또는 보고 피드백 오버헤드를 감소할 수 있다. 본 출원의 일부 실시예에서, 단말 기기는 네트워크측 기기에 의해 설정된 TD 기본 벡터 또는 DD 기본 벡터의 길 이를 수신할 수 있다. 즉, 당해 TD 기본 벡터 또는 DD 기본 벡터의 길이는 네트워크측 기기에 의해 단말 기기에 설정된 것일 수 있다. 여기서, 네트워크측 기기는 네트워크측 기기에 의해 설정된 관련 파라미터(예를 들면 상기 설명의 제1 파라미터)에 따라 당해 TD 기본 벡터 또는 DD 기본 벡터의 길이를 암시적으로 결정할 수 있고, 또는, 당해 네트워크측 기기는 단말 기기에 의해 보고된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라 당해 TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정할 수 있다. 네트워크측 기기는 단말 기기의 TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정할 경우, 당해 TD 기본 벡터 또는 DD 기본 벡터의 길이를 단말 기기에 송신함 으로, 단말 기기가 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 미래 시각의 프리코딩 계산 또는 예측을 구현하여, 계산 또는 예측된 프리코딩과 미래 해당 시각의 채널이 매칭되도 록 하고, 부동한 시각에 대응되는 프리코딩을 결정할 수 있을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코드북 파라미터의 중복 보고를 방지할 수도 있고, 시그널링 설정 오버헤드 또는 보고 피드백 오버헤드를 감소 할 수 있다. 이해해야 할 것은, 상기 실시예는 단말 기기측에서 본 출원 실시예의 채널 상태 정보 피드백 방법의 구현 방식 을 설명한다. 본 출원의 실시예는 다른 채널 상태 정보 피드백 방법을 더 제공하고, 아래는 네트워크측 기기에 서 당해 채널 상태 정보 피드백 방법의 구현 방식을 설명한다. 도4를 참조하면, 도4는 본 출원의 실시예에 따른 또 다른 채널 상태 정보 피드백 방법의 개략적인 흐름도이다. 설명해야 할 것은, 본 출원 실시예의 채널 상태 정보 피드백 방법은 네트워크측 기기에 의해 수행될 수 있다. 도4에 도시된 바와 같이, 당해 채널 상태 정보 피 드백 방법은 단계401 내지 405를 포함한다. 단계401에서, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정한다. 선택적으로, 네트워크측 기기는 네트워크측 기기에 의해 설정된 관련 파라미터에 따라 시간 도메인(TD) 기본 벡 터의 길이 또는 도플러 도메인(DD) 기본 벡터의 길이를 암시적으로 결정할 수 있다. 또는, 네트워크측 기기는 단말 기기에 의해 보고된 Doppler 오프셋 정보, Doppler 확장 등 정보에 따라 시간 도메인(TD) 기본 벡터의 길 이 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정할 수도 있다. 예를 들면, 단말 기기는 네트워크측 기기에 의해 설정된 CSI-RS 자원을 수신하고, 당해 CSI-RS 자원으로써 CSI 측정 처리를 수행하여, 도플러(Doppler) 오 프셋 정보 및 Doppler 확장을 획득하고, 단말 기기는 예측된 Doppler 오프셋 정보 및 Doppler 확장을 네트워크 측 기기에 보고할 수 있어, 네트워크측 기기가 단말 기기에 의해 보고된 Doppler 오프셋 정보, Doppler 확장 등 정보에 따라 시간 도메인(TD) 기본 벡터의 길이 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하도록 한다. 단계402에서, 단말 기기에 코드북 파라미터를 설정한다. 단계403에서, TD 기본 벡터 또는 DD 기본 벡터의 길이 및 코드북 파라미터를 단말 기기에 송신한다. 일 구현 방식에서, 네트워크측 기기는 TD 기본 벡터 또는 DD 기본 벡터의 길이 및 코드북 파라미터를 단말 기기 에 송신하여, 단말 기기가 네트워크측 기기에서 송신된 TD 기본 벡터 또는 DD 기본 벡터의 길이 및 코드북 파라 미터에 따라 데이터 전송층에 대응되는 코드북 지시 정보를 결정하도록 한다. 일 구현 가능한 방식에서, 단말 기기는 네트워크측 기기(예를 들면 기지국)에 의해 설정된 코드북 파라미터 및 TD 기본 벡터의 길이를 수신하고, 당해 코드북 파라미터 및 TD 기본 벡터의 길이에 따라, 데이터 전송층에 대응 되는 코드북 지시 정보를 결정할 수 있다. 여기서, 본 출원의 실시예에서, 당해 코드북 지시 정보는 적어도 하 나의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터 로 구성된 행렬 및 적어도 하나의 TD 기본 벡터로 구성된 행렬 중의 적어도 하나 또는 여러 조합을 포함할 수 있다. 여기서, 당해 TD 기본 벡터의 길이는 코드북에 사용된 TD 기본 벡터를 결정하는데 사용되고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터를 도입힌다. 일 구현 가능한 방식에서, 단말 기기는 네트워크측 기기(예를 들면 기지국)에 의해 설정된 코드북 파라미터 및 DD 기본 벡터의 길이를 수신하고, 코드북 파라미터 및 DD 기본 벡터의 길이에 따라 데이터 전송층에 대응되는 코드북 지시 정보를 결정할 수 있다. 여기서, 본 출원의 실시예에서, 당해 코드북 지시 정보는 적어도 하나의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터로 구 성된 행렬 및 적어도 하나의 DD 기본 벡터로 구성된 행렬 중의 적어도 하나 또는 여러 조합을 포함하나 이에 한 정되지 않는다. 여기서, 당해 DD 기본 벡터의 길이는 코드북에 사용된 DD 기본 벡터를 결정하는데 사용되고, Rel-16 또는 17 Type II 코드북의 기반에 도플러 도메인 기본 벡터를 도입한다. 단계404에서, 단말 기기에 의해 길이 및 코드북 파라미터에 따라 결정된 데이터 전송층에 대응되는 코드북 지시 정보를 수신한다. 선택적으로, 단말 기기는 TD 기본 벡터 또는 DD 기본 벡터의 길이 및 코드북 파라미터를 통해 데이터 전송층에 대응되는 코드북 지시 정보를 결정한 후, 당해 코드북 지시 정보를 네트워크측 기기에 송신하여, 네트워크측 기 기가 단말 기기에서 송신된 당해 코드북 지시 정보를 수신하도록 할 수 있다. 단계405에서, 코드북 지시 정보에 따라 부동한 시각에 대응되는 프리코딩 행렬을 결정한다. 선택적으로, 당해 코드북 지시 정보에 따라, 코드북 구조 공식으로써 부동한 시각에 대응되는 프리코딩 행렬을 계산하고, 또는 PMI 예측 알고리즘으로써 부동한 시각에 대응되는 프리코딩 행렬을 예측할 수 있다. 일 구현 방식에서, 코드북 지시 정보에 복수의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 복 수의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 복수의 TD 기본 벡터로 구성된 행렬이 포함될 수 있는 것 을 예로 들면, 네트워크측 기기는 당해 코드북 지시 정보를 포함하는 CSI를 수신하였을 경우, 당해 코드북 지시 정보에 따라, 코드북 구조 로써 부동한 시각에 대응되는 프리코딩 행렬을 계산하고, 또는 프리코딩 행렬 표시자(Pre-coding Matrix Indicator, PMI) 예측 알고리즘으로써 부동한 시각에 대응되는 프리코딩 행렬을 예측할 수 있다. 여기서, 은 복수의 공간 도메인 기본 벡터로 구성된 행렬 또는 적어도 하나의 단위 벡터로 구성된 단위 행렬을 나타내고, 는 조합 계수 행렬을 나타내고, 는 복수의 주파수 도메인 기본 벡터로 구성된 행렬을 나타내며, 는 복수의 TD 기본 벡터로 구성된 행렬을 나타낸다. 일 구현 방식에서, 코드북 지시 정보에 복수의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 복 수의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 복수의 DD 기본 벡터로 구성된 행렬이 포함될 수 있는 것 을 예로 들면, 네트워크측 기기는 당해 코드북 지시 정보를 포함하는 CSI를 수신하였을 경우, 당해 코드북 지시 정보에 따라, 코드북 구조 로써 부동한 시각에 대응되는 프리코딩 행렬을 계산하 고, 또는 프리코딩 행렬 표시자(Pre-coding Matrix Indicator, PMI) 예측알고리즘으로써 부동한 시각에 대응되 는 프리코딩 행렬을 예측할 수 있다. 여기서, 은 복수의 공간 도메인 기본 벡터로 구성된 행렬 또는 적어 도 하나의 단위 벡터로 구성된 단위 행렬을 나타내고, 는 조합 계수 행렬을 나타내고, 는 복수의 주 파수 도메인 기본 벡터로 구성된 행렬을 나타내며, 는 복수의 DD 기본 벡터로 구성된 행렬을 나타낸다. 본 출원의 실시예를 수행하여, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정함 으로, 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 미래 시각의 프리 코딩 계산 또는 예측을 구현하여, 계산 또는 예측된 프리코딩과 미래 해당 시각의 채널이 매칭되도록 하고, 부 동한 시각에 대응되는 프리코딩을 결정할 수 있을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코드북 파라 미터의 중복 보고를 방지할 수도 있고, 시그널링 설정 오버헤드 또는 보고 피드백 오버헤드를 감소할 수 있다. 설명해야 할 것은, 단말 기기는 네트워크측 기기에 의해 설정된 관련 파라미터에 따라 TD 기본 벡터의 길이 또 는 DD 기본 벡터의 길이를 암시적으로 결정할 수 있다. 본 출원의 일부 실시예에서, 도5에 도시된 바와 같이, 당해 채널 상태 정보 피드백 방법은 단계501 내지 505을 포함하나 이에 한정되지 않는다 단계501에서, 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정한다. 선택적으로, 네트워크측 기기는 네트워크측 기기에 의해 설정된 제1 파라미터에 따라 TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이를 암시적으로 결정할 수 있다. 여기서, 본 출원의 일부 실시예에서, 당해 제1 파라미터는 하기의, 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수; CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수; CSI-RS 측정 윈도우의 크기; 인접 CSI 측정 시각 사이의 간격; CSI 측정 횟수; CSI-RS 측정 윈도우 내의 CSI 측정 횟수; 및 파라미터 W; 중의 적어도 하나를 포함할 수 있지만 이에 한정되지 않는다. 설명해야 할 것은, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우는 CSI-RS 가 일정한 시간 범위 내에 한 번 또는 여러 번의 채널 측정을 수행하는 것을 설명하기 위한 것이고, 네트워크측 기기는 당해 CSI-RS 측정 윈도우를 설정하지 않을 수도 있다. 일 구현 방식에서, 당해 제1 파라미터가 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈도 우 내의 CSI-RS 자원의 개수인 것을 예로 들 경우, 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수에 따라, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이를 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자 원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정할 수 있다. 예를 들면, 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 NCSI-RS가 4인 것을 예로 들 경우, TD 기본 벡터 의 길이 또는 DD 기본 벡터의 길이 N4가 4인 것을 결정할 수 있다. 또 예를 들면, 네트워크측 기기에 의해 설정 된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수 가 6인 것을 예로 들 경우, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이 N4가 6인 것을 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의 배와 같은 것을 결정할 수 있다. 여기서, 은 양의 정수이다. 예를 들면, 이 1 이고, 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 NCSI-RS가 4인 것을 예로 들 경우, TD 기본 벡터의 길 이 또는 DD 기본 벡터의 길이 N4가 4인 것을 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측 정 윈도우 내의 CSI-RS 자원의 개수의 배와 같은 것을 결정할 수 있고; 여기서, 은 양의 정수이다. 예를 들면, 이 1이고, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수 가 6인 것을 예로 들 경우, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이 N4가 6인 것을 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 인 것을 결정할 수 있고; 여기서, 은 양의 정수이고, 는 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수이고, 는 시간 도메인의 압축 유닛이다. 예를 들면, 이 1이고, 네 트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 가 4이고, 가 2ms인 것을 예로 들 경우, TD 기 본 벡터의 길이 또는 DD 기본 벡터의 길이 N4가 인 것을 결정할 수 있다. 즉, 당해 TD 기본 벡터 의 길이 또는 DD 기본 벡터의 길이 N4는 2이다. 설명해야 할 것은, 본 출원의 실시예에서, 상기 CSI-RS 자원의 개수 가 1보다 클 경우, 당해 개의 CSI-RS 자원은 시간 도메인 유형이 동일하거나 부동할 수 았다. 시간 도메인 유형은 주기, 반 지속 및 비주기를 포함한다. 또한, 본 출원의 실시예에서, 상기 CSI-RS 자원의 개수 가 1보다 클 경 우, 당해 개의 CSI-RS 자원은 부동한 기능의 CSI-RS 자원일 수도 있다. 예를 들면, 1개의 CSI-RS는 채널 획득하는 CSI-RS 자원으로 설정되고, 나머지 설정은 시간 주파수 추적하는 CSI-RS 자원으로 설정된다. 본 출원의 일부 실시예에서, 당해 제1 파라미터가 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간 격인 것을 계로 들 경우, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우의 크기 및 인접 CSI 측정 시각 사 이의 간격에 따라, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이를 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 인 것을 결정할 수 있 고; 여기서, Wmeas는 CSI-RS 측정 윈도우의 크기이고, d는 인접 CSI 측정 시각 사이의 간격이고, 또는 d는 인접 CSI 측정의 최대 또는 최소 간격일 수 있고, 또는 d는 복수의 인접 CSI 측정 간격의 평균값일 수도 있다. 본 출원의 일부 실시예에서, 당해 제1 파라미터가 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수 인 것을 예로 들 경우, 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수에 따라, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이를 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정한다. 예를 들면, 네트워크측 기기에 의해 설정된 CSI 측정 횟수 B가 2인 것을 예로 들 경우, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이 N4는 2이다. 또 예를 들면, 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI 측정 횟수 B가 2인 것을 예로 들 경우, TD 기본 벡터의 길이 또는 DD 기본 벡터의 길이 N4는 2이다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와 같은 것을 결정할 수 있고; 여기서, 는 양의 정수이다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측 정 윈도우 내의 CSI 측정 횟수의 배와 같은 것을 결정할 수 있고; 여기서, 는 양의 정수이다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정할 수 있고; 여 기서, 는 양의 정수이고, B는 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 는 시간 도메인의 압축 유닛이다. 예를 들면, 가 1이고, 네트워크측 기기에 의해 설 정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수 B가 4이고, 가 2ms인 것을 예로 들 경우, TD 기본 벡터 또는 DD 기본 벡터의 길이는 이다. 즉, 당해 TD 기본 벡터의 길이 또는 DD 기본 벡 터의 길이 N4는 2이다. 본 출원의 일부 실시예에서, 당해 제1 파라미터가 파라미터 W인 것을 예로 들 경우, 네트워크측 기기에 의해 설 정된 파라미터 W에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정할 수 있다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정할 수 있고; 여기서, 는 시간 도메인의 압축 유닛이고, 는 나머지 함수를 나타낸다. 예를 들면, 파라미터 W의 수치가 4이고, 인 것을 예로 들 경우, TD 기본 벡터 또는 DD 기본 벡터의 길이 N4 는 2이다. 일 구현 가능한 방식에서, TD 기본 벡터 또는 DD 기본 벡터의 길이 와 같은 것을 결정하 고; 여기서, , 는 올림이고, 는 내림이다. 예를 들면, 파라미터 W의 수치가 5이고, 인 것을 예로 들 경우, TD 기본 벡터 또는 DD 기본 벡터의 길이 N4는 이고, 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이 N4는 =2이다. 여기서, 본 출원의 일부 실시예에서, 당해 파라미터 W는, 1)CSI 보고 시각에 대응되는 슬롯; 2)CSI 참조 자원이 위치한 슬롯; 3)CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 및 4)CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정 될 수 있다. 설명해야 할 것은, CSI 보고 윈도우는 네트워크측 기기에 의해 설정된 것이고, CSI 보고 윈도우를 설정하는 것은 CSI가 일정한 시간 범위 내에 CSI를 한 번 보고한 것을 설명하는데 편리하고, CSI 보고 윈도우를 설정하지 않을 수도 있다. 예를 들면, 당해 파라미터 W는 CSI 보고 윈도우의 길이 WCSI를 나타낼 수 있다. 즉 W=WCSI이다. 또는, 당해 파라 미터 W는 CSI 측정 윈도우의 길이 Wmeas를 나타낼 수 있다. 즉 W=Wmeas이다. 또는, 당해 파라미터 W는 CSI-RS 자원 을 수신하고 CSI 측정을 수행하는 시각에 대응되는 첫 번째 슬롯에서 CSI 보고 윈도우의 오른쪽 경계가 위치하 는 시각에 대응되는 슬롯 까지의 기간을 나타내고, 당해 기간의 단위는 1개의 슬롯이다. 또는, 당해 파라미터 W 는 CSI-RS 측정 윈도우의 오른쪽 경계 또는 왼쪽 경계에 대응되는 슬롯에서 CSI 보고 윈도우의 오른쪽 경계가 위치하는 시각에 대응되는 슬롯 까지의 기간을 나타낸다. 또는, 당해 파라미터 W는 CSI 참조 자원에 대응되는 슬롯에서 CSI 보고 윈도우의 오른쪽 경계가 위치하는 시각에 대응되는 슬롯 까지의 기간을 나타낸다. 설명해야 할 것은, 본 출원의 실시예에서, 상기 설명의 NCSI-RS, B, d, , Wmeas 및 Wmeas의 값은 단말 기기 에 의해 보고될 수 있고, 또는, 네트워크측 기기에 의해 설정될 수 있고, 또는, 단말 기기 및 네트워크측 기기 에 의해 사전 정의될 수도 있다. 본 출원의 일부 실시예에서, 네트워크 기기는 시간 도메인의 압축 유닛 를 더 결정해야 한다. 여기서, 당해 압축 유닛 는 하기의 임의의 방식을 통해 결정될 수 있다. 일 구현 가능한 방식에서, 당해 압축 유닛 는 일 수 있고, 여기서, 는 1보다 작거나 같은 정수이고, 는 채널 가간섭성 시간이다. 여기서, 당해 채널 가간섭성 시간은 이고, 당해 는 채널의 Doppler 확장이다. 일 구현 가능한 방식에서, 당해 압축 유닛 는 CSI-RS 자원의 측정 주기이다. 일 구현 가능한 방식에서, 당해 압축 유닛 는 일 수 있고, 여기서, 는 1보다 크거나 같은 정수이고, 은 인접 CSI의 측정 간격이다. 예를 들면, 균등한 여러 번의 CSI 측정에 있어서, 은 인접 CSI의 측정 간 격일 수 있고, 당해 및 의 수치로써 당해 압축 유닛 를 결정할 수 있다. 일 구현 가능한 방식에서, 당해 압축 유닛 는 일 수 있고, 여기서, 는 1보다 크거나 같은 정수이고, 는 인접 CSI 측정의 최대 또는 최소 간격이고, 또는 는 복수의 인접 CSI 측정 간격의 평균값일 수도 있 다. 예를 들면, 불 균등한 여러 번의 CSI 측정에 있어서, 는 인접 CSI 측정의 최대 또는 최소 간격일 수 있 고, 당해 및 의 수치로써 당해 압축 유닛 를 결정할 수 있다. 예를 들면, 단말 기기(UE)의 이동 속도가 27 Km 또는 h이고, UE가 위치하는 셀의 시스템 반송 주파수가 4 GHz라 고 가정할 경우, 당해 사용자의 최대 Doppler 확장 이고, 사용자 채널의 가간섭성 시간은를 나타낼 수 있다. TD 또는 DD 기본 벡터 길이 N4를 결정하는 압축 유닛은 이고, 가 네트워크에 의해 설정된 0.5일 경우, 압축 유닛은 ms이다. 또 예를 들면, 네트워크측 기기에 의해 설정된 인접 CSI-RS 자원 측정 간격이 d=2 ms일 경우, 압축 유닛은 이다. 의 값이 사전 정의된 디폴트 값이 1이라고 가정할 경우, 압축 유닛은 ms이다. TD 또는 DD 기본 벡터의 길이 N4는 W 또는 와 같다. 여기서, W의 의미는 상기 설명의 임의의 하나로 나타낸 다. 설명해야 할 것은, 본 출원의 실시예에서, 상기 설명의 및 의 값은 단말 기기에 의해 보고될 수 있고, 또는, 네트워크측 기기에 의해 설정될 수 있고, 또는 단말 기기 및 네트워크측 기기에 의해 사전 정의될 수도 있다. 또한, 상기 설명의 는 단말 기기에 의해 네트워크측 기기에 보고된 것일 수 있다. 단계502에서, 단말 기기에 코드북 파라미터를 설정한다. 여기서, 단계502는 본 출원의 각 실시예 중의 임의의 방식으로써 구현될 수 있고, 본 출원의 실시예는 이에 대 해 한정하지 않고, 더는 설명하지 않는다. 단계503에서, TD 기본 벡터 또는 DD 기본 벡터의 길이 및 코드북 파라미터를 단말 기기에 송신한다. 여기서, 단계503는 본 출원의 각 실시예 중의 임의의 방식으로써 구현될 수 있고, 본 출원의 실시예는 이에 대 해 한정하지 않고, 더는 설명하지 않는다. 단계504에서, 단말 기기에 의해 길이 및 코드북 파라미터에 따라 결정된 데이터 전송층에 대응되는 코드북 지시 정보를 수신한다. 여기서, 단계504는 본 출원의 각 실시예 중의 임의의 방식으로써 구현될 수 있고, 본 출원의 실시예는 이에 대 해 한정하지 않고, 더는 설명하지 않는다. 단계505에서, 코드북 지시 정보에 따라 부동한 시각에 대응되는 프리코딩 행렬을 결정한다. 일 구현 방식에서, 코드북 지시 정보 및 TD 기본 벡터 또는 DD 기본 벡터 길이의 결정 방식에 따라, 코드북 구 조 또는 프리코딩 행렬 표시자(PMI) 예측 알고리즘으로써 부동한 시각에 대응되는 프리코딩 행렬을 결정할 수 있다. 즉, TD 기본 벡터 또는 DD 기본 벡터의 길이 N4의 결정 방식이 부동할 경우, 부동한 방식으로써 당해 프 리코딩 행렬을 획득한다. 예를 들면, 예측 알고리즘으로써 프리코딩 행렬의 예측을 수행하고, 또는, 직접 코드 북 구조로써 프리코딩 행렬을 계산한다. 예를 들면, 네트워크측 기기(예를 들면 기지국)가 단말 기기(UE)에 1개의 비주기 CSI-RS 자원 세트를 설정한다 고 가정하고, 당해 자원 세트에는 4개의 비주기 CSI-RS 자원이 포함된다. 당해 4개 비주기의 CSI-RS 자원은 1개 의 CSI-RS 측정 윈도우 내에서 4개의 부동한 시각의 다운링크 채널 정보를 측정하고, 인접 CSI-RS 자원의 간격 은 d이다. 도6에 도시된 바와 같이, 시간 도메인에서 CSI-RS를 기반으로 하는 측정과 CSI 보고의 관계이고, 여 기서, 첫 번째 CSI-RS 자원의 측정 시각은 t0이고, 마지막 CSI-RS 자원의 측정 시각은 t0+3으로 기록한다. UE는 당해 4개의 부동한 시각의 CSI-RS 자원에 의해 측정된 다운링크 채널을 기반으로, 기지국에 의해 설정된 코드북 파라미터에 따라 코드북의 복수의 SD 기본 벡터로 구성된 , 조합 계수 복수의 FD 기본 벡터로 구성 된 및 복수의 TD 또는 DD 기본 벡터로 구성된 UE는 t0+n 시각에서 당해 파라미터 정보를 기지국에 보고하고, 기지국은 로써 길이가 N4개 시각에 대응되는 프리코딩 행렬을 계산할 수 있다. t0+n 및 t0+l은 각각 CSI 보고 윈도우의 왼쪽 경계 및 오른쪽 경계를 나타낸다. TD 또는 DD 기본 벡터의 길이 N4는 도6에 도시된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수 4와 같을 수 있고, 또는TD 또는 DD 기본 벡터 길이 N4는 CSI-RS 측정 윈도우 내의 CSI-RS 측정 횟수 B=4와 같을 수 있고, 또는 TD 또는 DD 기본 벡터 길이 N4는 =4와 같고, 여기서, Wmeas, =4, =1. N4=4일 경우, 기지국은 PMI 예 측 알고리즘으로써 t0+3에서 t0+l 시간 범위 내의 부동한 시각에 대응되는 프리코딩 행렬을 계산할 수 있다. 예를 들면, TD 또는 DD 기본 벡터의 길이 N4를 로 정의할 경우, 여기서, 는 CSI 보고 윈도우의 길 이이고, 는 시간 도메인의 압축 유닛이고; 당해 길이 N4는 기지국에 의해 무선 자원 제어(Radio Resource Control, RRC) 시그널링을 통해 UE에 설정되고, UE가 선택된 S(여기서 S>1)개의 길이 N4의 기본 벡터를 기지국 에 보고할 경우, 기지국은 상기 코드북 공식으로써 보고 윈도우 내의 부동한 시각에 대응되는 프리코딩 행렬을 직접 계산할 수 있다. 또 예를 들면, TD 또는 DD 기본 벡터의 길이 N4가 B의 Q배와 같을 경우, 또는, TD 또는 DD 기본 벡터의 길이 N4 가 B 또는 의 Q배와 같을 경우, 여기서, B=4, Q=5 =1, 즉 N4=20이다. V 개 TD 또는 DD 기본 벡터로 구성된 행렬은 로 나타내고, 여기서 v번째 TD 또는 DD 기본 벡 터는 로 나타낸다. N4개의 시각에 대응되는 프리코딩 행렬은 을 통해 계산하여 획득될 수 있다. 여기서, 및 는 전통적인 Rel-16 또는 17 Type II의 계산 방식을 계 속하여 사용하고, 는 길이가 N4인 기본 벡터로 구성된 코드북에서 V개의 기본 벡터를 선택한 다. N4개 시각 이후의 N5 시각 프리코딩 행렬의 계산, 즉 N5 N4개의 시각에 대응되는 프리코딩 행렬의 예측은 하기 의 방식을 통해 계산할 수 있다. 우선 일 경우, 이고, 여기서, 이다. 그리고, 기지국은 을 통해 N5 시각에 대응되는 프리코딩 행렬을 계산한다. 상기에 설명된 바와 같이, 본 출원은 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정함으로, 당해 길이로써 코드북에서 사용된 TD 기본 벡터 또는 DD 기본 벡터를 결정하고, Rel-16 또는 17 Type II 코드북의 기반에서 시간 도메인 기본 벡터 또는 도플러 도메인 기본 벡터를 도입하도록 하고, 미래 시 각의 프리코딩 계산 또는 예측을 구현하여, 계산 또는 예측된 프리코딩과 미래 해당 시각의 채널이 매칭되도록 하고, 부동한 시각에 대응되는 프리코딩을 결정할 수 있을 뿐만 아니라, 코드북 파라미터의 중복 설정 또는 코 드북 파라미터의 중복 보고를 방지할 수도 있고, 시그널링 설정 오버헤드 또는 보고 피드백 오버헤드를 감소할 수 있다. 상기 본 출원에서 제공하는 실시예는, 각각 단말 기기, 네트워크측 기기의 각도에서 본 출원의 실시예에서 제공 하는 방법을 설명하였다. 상기 본 출원의 실시예에서 제공하는 방법의 각 기능을 구현하기 위해, 단말 기기, 네 트워크측 기기는 하드웨어 구조, 소프트웨어 모듈, 하드웨어 구조, 소프트웨어 모듈, 또는 하드웨어 구조와 소 프트웨어 모듈을 포함하는 형식으로 상기 각 기능을 구현한다. 상기 각 기능의 어느 하나의 기능은 하드웨어 구조, 소프트웨어 모듈, 또는 하드웨어 구조와 소프트웨어 모듈의 방식으로 수행될 수 있다. 도7을 참조하면, 본 출원의 실시예에 따른 통신 장치의 구조 개략도이다. 도7에 도시된 통신 장치는 송 수신 모듈 및 처리 모듈을 포함한다. 송수신 모듈은 송신 기능을 구현하는 송신 모듈 및 수신 기능을 구현하는 수신 모듈을 포함할 수 있고, 송수신 모듈은 송신 기능 및 수신 기능을 구현할 수 있다. 통신 장치는 단말 기기일 수 있고, 단말 기기의 장치일 수 있고, 단말 기기와 매칭되어 사용 가능한 장치일 수도 있다. 또는, 통신 장치는 네트워크측 기기일 수 있고, 네트워크측 기기의 장치일 수 있고, 네트워크측 기기와 매칭되어 사용 가능한 장치일 수도 있다. 통신 장치가 단말 기기일 경우, 처리 모듈은 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지 시 정보를 결정하는데 사용되고; 송수신 모듈은 코드북 지시 정보를 포함하는 채널 상태 정보(CSI)를 네트 워크측 기기에 송신하는데 사용되고; 여기서, 코드북 지시 정보는 네트워크측 기기가 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 것을 지시하는데 사용된다. 일 구현 방식에서, 처리 모듈은 구체적으로, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡 터의 길이를 결정하고; 당해 길이 및 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는데 사용된다. 일 구현 방식에서, 처리 모듈은 구체적으로, 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기 본 벡터 또는 DD 기본 벡터의 길이를 결정하는 데 사용된다. 일 구현 가능한 방식에서, 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈 도우 내의 CSI-RS 자원의 개수이고; 처리 모듈은 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의 배와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수의 배와 같은 것을 결정하며; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는데 사용되고; 여기서, 은 양의 정수이고, 는 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원 의 개수이고, 는 시간 도메인의 압축 유닛이다. 일 구현 가능한 방식에서, 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격이고; 처리 모듈은 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결 정하는데 사용되고; 여기서, Wmeas는 CSI-RS 측정 윈도우의 크기이고, d는 인접 CSI 측정 시각 사이의 간격, 또 는 상기 인접 CSI 측정의 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값이다. 일 구현 가능한 방식에서, 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고; 처 리 모듈은 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측 정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와 같은 것을 결정하고; 또는, TD 기본 벡 터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI 측정 횟수의 배와 같은 것을 결정하며; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사 용되고; 여기서, 는 양의 정수이고, B는 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정윈도우 내의 CSI 측정 횟수이고, 는 시간 도메인의 압축 유닛이다. 일 구현 가능한 방식에서, 제1 파라미터는 파라미터 W이고; 처리 모듈은 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하고; 여기서, 는 시간 도메인의 압축 유닛이고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하고; 여기 서, , 는 올림이고, 는 내림이고; 여기서, 파라미터 W는 하기의, 1)CSI 보고 시각 에 대응되는 슬롯; 2)CSI 참조 자원이 위치한 슬롯; 3)CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대 응되는 슬롯; 4)CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터 를 통해 결정된다. 일 구현 가능한 방식에서, 처리 모듈은 또한, 시간 도메인의 압축 유닛 를 결정하는데 사용된다. 일 구현 가능한 방식에서, 압축 유닛 는 이고, 여기서, 는 1보다 작거나 같은 정수이고, 는 채널 가간섭성 시간이고; 또는, 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는, 압축 유닛 는 이고, 여기서, 는 1보다 크거나 같은 정수이고, 은 인접 CSI의 측정 간격이고; 또는, 압축 유닛 는 이 고, 여기서, 는 1보다 크거나 같은 정수이고, 는 인접 CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수 의 인접 CSI 측정 간격의 평균값이다. 일 구현 가능한 방식에서, 처리 모듈은 구체적으로, 단말 기기에 의해 CSI-RS로써 예측하여 획득된 도플러 (Doppler) 오프셋 정보 및 Doppler 확장에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용된 다. 일 구현 가능한 방식에서, 송수신 모듈은 또한, 네트워크측 기기에 의해 설정된 TD 기본 벡터 또는 DD 기 본 벡터의 길이를 수신하는데 사용된다. 일 구현 가능한 방식에서, 코드북 지시 정보는 적어도 하나의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 적어도 하나의 TD 기본 벡터 또는 DD 기본 벡터로 구성된 행렬 중의 적어도 하나 또는 여러 조합을 포함한다. 통신 장치가 네트워크측 기기일 경우, 처리 모듈은 시간 도메인(TD) 기본 벡터 또는 도플러 도메인 (DD) 기본 벡터의 길이를 결정하는데 사용되고; 처리 모듈은 또한 단말 기기에 코드북 파라미터를 설정하 는데 사용되고; 송수신 모듈은 TD 기본 벡터 또는 DD 기본 벡터의 길이 및 코드북 파라미터를 단말 기기에 송신하는데 사용되고; 송수신 모듈은 또한 단말 기기에 의해 길이 및 코드북 파라미터에 따라 결정된 데이 터 전송층에 대응되는 코드북 지시 정보를 수신하는데 사용되고; 처리 모듈은 또한 코드북 지시 정보에 따 라 부동한 시각에 대응되는 프리코딩 행렬을 결정하는데 사용된다. 일 구현 방식에서, 처리 모듈은 구체적으로, 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기 본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용된다. 일 구현 가능한 방식에서, 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈 도우 내의 CSI-RS 자원의 개수이고; 처리 모듈은 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의 배와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수의 배와 같은 것을 결정하며; 또는, TD 기본 벡터 또는DD 기본 벡터의 길이가 과 같은 것을 결정하는데 사용되고; 여기서, 은 양의 정수이고, 는 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원 의 개수이고, 는 시간 도메인의 압축 유닛이다. 일 구현 가능한 방식에서, 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격이고; 처리 모듈은 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결 정하는데 사용되고; 여기서, Wmeas는 CSI-RS 측정 윈도우의 크기이고, d는 인접 CSI 측정 시각 사이의 간격, 또 는 상기 인접 CSI 측정의 최대 또는 최소 간격, 또는 복수의 인접 CSI 측정 간격의 평균값이다. 일 구현 가능한 방식에서, 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고; 처 리 모듈은 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측 정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와 같은 것을 결정하고; 또는, TD 기본 벡 터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI 측정 횟수의 배와 같은 것을 결정하며; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사 용되고; 여기서, 는 양의 정수이고, B는 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고, 는 시간 도메인의 압축 유닛이다. 일 구현 가능한 방식에서, 제1 파라미터는 파라미터 W이고; 처리 모듈은 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하고; 여기서, 는 시간 도메인의 압축 유닛이고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사 용되고; 여기서, , 는 올림이고, 는 내림이고; 여기서, 파라미터 W는 하기의, 1)CSI 보고 시각에 대응되는 슬롯; 2)CSI 참조 자원이 위치한 슬롯; 3)CSI-RS 측정 윈도우의 왼쪽 경계 또는 오 른쪽 경계에 대응되는 슬롯; 4)CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정된다. 일 구현 가능한 방식에서, 처리 모듈은 또한 시간 도메인의 압축 유닛 를 결정하는데 사용된다. 일 구현 가능한 방식에서, 압축 유닛 는 이고, 여기서, 는 1보다 작거나 같은 정수이고, 는 채널 가간섭성 시간이고; 또는, 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는, 압축 유닛 는 이고, 여기서, 는 1보다 크거나 같은 정수이고, 은 인접 CSI의 측정 간격이고; 또는, 압축 유닛 는 이 고, 여기서, 는 1보다 크거나 같은 정수이고, 는 인접 CSI에 의해 측정된 최대 또는 최소 간격, 또는 복수 의 인접 CSI 측정 간격의 평균값이다. 일 구현 방식에서, 처리 모듈은 구체적으로, 단말 기기에 의해 보고된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용된다. 일 구현 가능한 방식에서, 처리 모듈은 구체적으로, 코드북 지시 정보 및 TD 기본 벡터 또는 DD 기본 벡터 길이의 결정 방식에 따라, 코드북 구조 또는 프리코딩 행렬 표시자(PMI) 예측 알고리즘으로써 부동한 시각에 대 응되는 프리코딩 행렬을 결정하는데 사용된다. 상기 실시예의 장치에 관련하여, 각 모듈이 동작을 수행하는 구체적인 방식은 이미 당해 방법에 관련된 실시예 에서 상세히 설명하였고, 여기서 상세히 설명하지 않는다. 도8을 참조하면, 도8은 본 출원의 실시예에 따라 다른 통신 장치의 구조 개략도이다. 통신 장치는 네트 워크측 기기일 수 있고, 단말 기기일 수 있고, 네트워크측 기기가 상기 방법을 구현하도록 서포트하는 칩, 칩 시스템, 또는 프로세서 등일 수 있고, 단말 기기가 상기 방법을 구현하도록 서포트하는 칩, 칩 시스템 또는 프 로세서 등일 수도 있다. 당해 장치는 상기 방법의 실시예에서 설명된 방법을 구현하는데 사용되고, 구체적으로 상기 방법 실시예의 설명을 참조할 수 있다. 통신 장치는 하나 또는 복수의 프로세서를 포함할 수 있다. 프로세서는 통용 프로세서 또는 전용 프로세서 등일 수 있다. 예를 들면 기저 대역 프로세서 또는 중앙 처리 장치일 수 있다. 기저 대역 프로세서는 통신 프로토콜 및 통신 데이터를 처리하고, 중앙 처리 장치는 통신 장치(예를 들면, 기지국, 기저 대역칩, 단말 기기, 단말 기기 칩, DU 또는 CU 등)를 제어하고, 컴퓨터 프로그램을 수행하고, 컴퓨터 프로그램의 데이터를 처 리하는데 사용될 수 있다. 선택적으로, 통신 장치는 컴퓨터 프로그램이 포함되어 있는 하나 또는 복수의 메모리를 더 포함 할 수 있고, 프로세서는 상기 컴퓨터 프로그램을 수행하여, 통신 장치가 상기 방법의 실시예에서 설명된 방법을 수행하도록 한다. 선택적으로, 상기 메모리에는 데이터가 더 저장되어 있다. 통신 장치 및 메모리는 단독 설치될 수 있고, 통합될 수도 있다. 선택적으로, 통신 장치는 트랜시버, 안테나를 더 포함할 수 있다. 트랜시버는 송수신 유닛, 트랜스폰더, 또는 송수신 회로 등으로 불리울 수 있고, 송수신 기능을 구현하는데 사용된다. 트랜시버는 수신기 및 송신기를 포함할 수 있고, 수신기는 접수기 또는 수신 회로 등으로 불리울 수 있고, 수신 기능을 구 현하는데 사용되고; 송신기는 송신 회로 등으로 불리울 수 있고, 송신 기능을 구현하는데 사용된다. 선택적으로, 통신 장치에는 하나 또는 복수의 인터페이스 회로를 더 포함할 수 있다. 인터페이스 회로 는 코드 명령을 수신하고 프로세서에 전송한다. 프로세서는 상기 코드 명령을 수행하여 통신 장 치가 상기 방법실시예에서 설명된 방법을 수행하도록 한다. 통신 장치가 단말 기기일 경우, 프로세서는 도2의 단계201; 도3의 단계301 및 단계302를 수행하는데 사용된다. 트랜시버는 도2의 단계202; 도3의 단계303을 수행하는데 사용된다. 통신 장치가 네트워크측 기기일 경우, 트랜시버는 도4의 단계401, 단계402 및 단계405; 도5의 단계 501, 단계502 및 단계505를 수행하는데 사용된다. 프로세서는 도4의 단계403 및 단계404; 도5의 단계503 및 단계504를 수행하는데 사용된다. 일 구현 방식에서, 프로세서는 수신 및 송신 기능을 구현하는 트랜시버를 포함할 수 있다. 예를 들면 당해 트랜시버는 송수신 회로, 또는 인터페이스, 또는 인터페이스 회로일 수 있다. 수신 및 송신 기능을 구현하는 송 수신 회로, 인터페이스 또는 인터페이스 회로는 분리된 것일 수 있고, 통합된 것일 수도 있다. 상기 송수신 회 로, 인터페이스 또는 인터페이스 회로는 코드/데이터의 판독 기록에 사용될 수 있고, 상기 송수신 회로, 인터페 이스 또는 인터페이스 회로는 신호의 전송 또는 전달에 사용될 수 있다. 일 구현 방식에서, 프로세서에는 컴퓨터 프로그램이 저장되어 있을 수 있고, 컴퓨터 프로그램은 프로세서에서 수행되고, 통신 장치가 상기 방법 실시예에서 설명된 방법을 수행하도록 한다. 컴퓨터 프로그램은 프로세서에 고정될 수 있고, 당해 상황에서, 프로세서는 하드웨어에 의해 구현될 수 있다. 일 구현 방식에서, 통신 장치는 회로를 포함할 수 있고, 상기 회로는 상기 방법 실시예의 송신 또는 수신 또는 통신 기능을 구현할 수 있다. 본 출원에서 설명된 프로세서 및 트랜시버는 직접 회로(integrated circuit, IC), 시뮬레이션 IC, 주파수 직접 회로(RFIC), 혼합 신호 IC, 주문형 직접 회로(application specific integrated circuit, ASIC), 인쇄 회로 기판(printed circuit board, PCB), 전자 기기 등에 구현될 수 있다. 당해 프로세서 및 트랜시버는 각 IC고정 기술로써 제조될 수 있다. 예를 들면 상보성 금속 산화막 반도체 (complementary metal oxide semiconductor, CMOS), N형 금속 산화물 반도체(nMetal-oxide-semiconductor, NMOS), P형 금속 산화물 반도체(positive channel metal oxide semiconductor, PMOS), 양극성 접합 트랜지스터(bipolar junction transistor, BJT), 양극 CMOS(BiCMOS), 실리콘 게르마늄(SiGe), 갈륨비고(GaAs) 등으로 제 공된다. 상기 실시예에서 설명된 통신 장치는 네트워크측 기기 또는 단말 기기일 수 있지만, 본 출원에서 설명된 통신 장치의 범위는 이에 한정되지 않고, 통신 장치의 구조는 도8에 의해 한정되지 않는다. 통신 장치는 독립된 기기 또는 비교적 큰 기기의 일부분일 수 있다. 예를 들면 상기 통신 장치는, 독립된 직접 회로 IC, 또는 칩, 또는, 칩 시스템 또는 서브 시스템; 하나 또는 복수의 IC를 구비한 세트; 선택적으로, 당해 IC 세스튼 데이터, 컴퓨터 프로그램을 저장하는 저 장 컴포넌트를 포함할 수 있고, 모뎀 같은 ASIC; 기타 기기 내에 삽입될 수 있는 모듈; 접수기, 단말 기기, 스마트 단말 기기, 셀 전화, 무선 기기, 휴대폰, 모바일 유닛, 차량 탑재 기기, 네트워 크측 기기, 클라우드 기기, 인공지능 기기 등; 기타 등등일 수 있다. 통신 장치가 칩 또는 칩 시스템인 경우에 대해, 도9에 도시된 칩의 구조 개략도를 참조할 수 있다. 도9에 도시 된 칩은 프로세서 및 인터페이스를 포함한다. 여기서, 프로세서의 수량은 하나 또는 다수일 수 있고, 인터페이스의 수량은 다수일 수 있다. 칩이 본 출원 실시예의 단말 기기의 기능을 구현하는데 사용되는 경우에 대해, 프로세서는 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이 및 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는데 사용되고; 인 터페이스는 코드북 지시 정보를 포함하는 채널 상태 정보(CSI)를 네트워크측 기기에 송신하는데 사용되고; 여기서, 코드북 지시 정보는 네트워크측 기기가 부동한 시각에 대응되는 프리코딩 행렬을 결정하는 것을 지시하 는데 사용된다. 일 구현 방식에서, 프로세서는 구체적으로, 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터 의 길이를 결정하고; 당해 길이 및 네트워크측 기기에 의해 설정된 코드북 파라미터에 따라, 데이터 전송층에 대응되는 코드북 지시 정보를 결정하는데 사용된다. 일 구현 방식에서, 프로세서는 구체적으로, 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용된다. 일 구현 가능한 방식에서, 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈 도우 내의 CSI-RS 자원의 개수이고; 프로세서는 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네 트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것 을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의 배와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수의 배와 같은 것을 결정하며; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는데 사용되고; 여기서, 은 양의 정수이고, 는 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원 의 개수이고, 는 시간 도메인의 압축 유닛이다. 일 구현 가능한 방식에서, 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격이고; 프로세서는 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 인 것을 결정하는 데 사용되고; 여기서, Wmeas는 CSI-RS 측정 윈도우의 크기이고, d는 인접 CSI 측정 시각 사이의 간격이고, 또는d는 인접 CSI 측정의 최대 또는 최소 간격일 수 있고, 또는 d는 복수의 인접 CSI 측정 간격의 평균값일 수도 있 다. 일 구현 가능한 방식에서, 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고; 프 로세서는 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡 터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI 측정 횟수의 배 와 같은 것을 결정하며; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용 되고; 여기서, 는 양의 정수이고, B는 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈 도우 내의 CSI 측정 횟수이고, 는 시간 도메인의 압축 유닛이다. 일 구현 가능한 방식에서, 제1 파라미터는 파라미터 W이고; 프로세서는 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하고; 여기서, 는 시간 도메인의 압축 유 닛이고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용 되고; 여기서, , 는 올림이고, 는 내림이고; 여기서, 파라미터 W는 하기의, 1)CSI 보고 시각에 대응되는 슬롯; 2)CSI 참조 자원이 위치한 슬롯; 3)CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 4)CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의 파라미터를 통해 결정된다. 일 구현 가능한 방식에서, 프로세서는 또한, 시간 도메인의 압축 유닛 를 결정하는데 사용된다. 일 구현 가능한 방식에서, 압축 유닛 는 이고, 여기서, 는 1보다 작거나 같은 정수이고, 는 채널 가간섭성 시간이고; 또는, 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는, 압축 유닛 는 이고, 여기서, 는 1보다 크거나 같은 정수이고, 은 인접 CSI의 측정 간격이고; 또는, 압축 유닛 는 이 고, 여기서, 는 1보다 크거나 같은 정수이고, 는 인접 CSI에 의해 측정된 최대 또는 최소 간격이고, 또는 는 복수의 인접 CSI 측정 간격의 평균값일 수도 있다. 일 구현 가능한 방식에서, 프로세서는 구체적으로, 단말 기기에 의해 CSI-RS로써 예측하여 획득된 도플러 (Doppler) 오프셋 정보 및 Doppler 확장에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용된 다. 일 구현 가능한 방식에서, 인터페이스는 또한, 네트워크측 기기에 의해 설정된 TD 기본 벡터 또는 DD 기본 벡터의 길이를 수신하는데 사용된다. 일 구현 가능한 방식에서, 코드북 지시 정보는 적어도 하나의 공간 도메인(SD) 기본 벡터로 구성된 행렬, 조합 계수 행렬, 적어도 하나의 주파수 도메인(FD) 기본 벡터로 구성된 행렬 및 적어도 하나의 TD 기본 벡터 또는 DD 기본 벡터로 구성된 행렬 중의 적어도 하나 또는 여러 조합을 포함한다. 칩이 본 출원 실시예의 네트워크측 기기의 기능을 구현하는데 사용되는 경우에 대해, 프로세서는 시간 도메인(TD) 기본 벡터 또는 도플러 도메인(DD) 기본 벡터의 길이를 결정하는데 사용되고; 프로세서는 또한 단말 기기에 코드북 파라미터를 설정하는데 사용되고; 인터페이스는 TD 기본 벡터또는 DD 기본 벡터의 길이 및 코드북 파라미터를 단말 기기에 송신하는데 사용되고; 인터페이스는 또한 단 말 기기에 의해 길이 및 코드북 파라미터에 따라 결정된 데이터 전송층에 대응되는 코드북 지시 정보를 수신하 는데 사용되고; 프로세서는 또한 코드북 지시 정보에 따라 부동한 시각에 대응되는 프리코딩 행렬을 결정 하는데 사용된다. 일 구현 방식에서, 프로세서는 구체적으로, 네트워크측 기기에 의해 설정된 제1 파라미터에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용된다. 일 구현 가능한 방식에서, 제1 파라미터는 채널 상태 정보 참조 신호(CSI-RS) 자원의 개수 또는 CSI-RS 측정 윈 도우 내의 CSI-RS 자원의 개수이고; 프로세서는 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네 트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수와 같은 것 을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수의 배와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI-RS 자원의 개수의 배와 같은 것을 결정하며; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정하는데 사용되고; 여기서, 은 양의 정수이고, 는 네트워크측 기기에 의해 설정된 CSI-RS 자원의 개수 또는 CSI-RS 측정 윈도우 내의 CSI-RS 자원 의 개수이고, 는 시간 도메인의 압축 유닛이다. 일 구현 가능한 방식에서, 제1 파라미터는 CSI-RS 측정 윈도우의 크기와 인접 CSI 측정 시각 사이의 간격이고; 프로세서는 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 과 같은 것을 결정 하는데 사용되고; 여기서, Wmeas는 CSI-RS 측정 윈도우의 크기이고, d는 인접 CSI 측정 시각 사이의 간격이고, 또는 d는 인접 CSI 측정의 최대 또는 최소 간격일 수 있고, 또는 d는 복수의 인접 CSI 측정 간격의 평균값일 수 도 있다. 일 구현 가능한 방식에서, 제1 파라미터는 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수이고; 프 로세서는 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈도우 내의 CSI 측정 횟수와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡 터의 길이가 네트워크측 기기에 의해 설정된 CSI 측정 횟수의 배와 같은 것을 결정하고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 네트워크측 기기에 의해 설정된 CSI-RS 측정 윈도우 내의 CSI 측정 횟수의 배 와 같은 것을 결정하며; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용 되고; 여기서, 는 양의 정수이고, B는 네트워크측 기기에 의해 설정된 CSI 측정 횟수 또는 CSI-RS 측정 윈 도우 내의 CSI 측정 횟수이고, 는 시간 도메인의 압축 유닛이다. 일 구현 가능한 방식에서, 제1 파라미터는 파라미터 W이고; 프로세서는 구체적으로, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하고; 여기서, 는 시간 도메인의 압축 유 닛이고; 또는, TD 기본 벡터 또는 DD 기본 벡터의 길이가 와 같은 것을 결정하는데 사용 되고; 여기서, , 는 올림이고, 는 내림이고; 여기서, 파라미터 W는 하기의, 1)CSI 보고 시각에 대응되는 슬롯; 2)CSI 참조 자원이 위치한 슬롯; 3)CSI-RS 측정 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 4)CSI 보고 윈도우의 왼쪽 경계 또는 오른쪽 경계에 대응되는 슬롯; 중의 적어도 하나의파라미터를 통해 결정된다. 일 구현 가능한 방식에서, 프로세서는 또한, 시간 도메인의 압축 유닛 를 결정하는데 사용된다. 일 구현 가능한 방식에서, 압축 유닛 는 이고, 여기서, 는 1보다 작거나 같은 정수이고, 는 채널 가간섭성 시간이고; 또는, 압축 유닛 는 CSI-RS 자원의 측정 주기이고; 또는, 압축 유닛 는 이고, 여기서, 는 1보다 크거나 같은 정수이고, 은 인접 CSI의 측정 간격이고; 또는, 압축 유닛 는 이 고, 여기서, 는 1보다 크거나 같은 정수이고, 는 인접 CSI에 의해 측정된 최대 또는 최소 간격이고, 또는 는 복수의 인접 CSI 측정 간격의 평균값일 수도 있다. 일 구현 방식에서, 프로세서는 구체적으로, 단말 기기에 의해 보고된 도플러(Doppler) 오프셋 정보 및 Doppler 확장에 따라, TD 기본 벡터 또는 DD 기본 벡터의 길이를 결정하는데 사용된다. 일 구현 가능한 방식에서, 프로세서는 구체적으로, 코드북 지시 정보 및 TD 기본 벡터 또는 DD 기본 벡터 길이의 결정 방식에 따라, 코드북 구조 또는 프리코딩 행렬 표시자(PMI) 예측 알고리즘으로써 부동한 시각에 대 응되는 프리코딩 행렬을 결정하는데 사용된다. 선택적으로, 칩은 필요되는 컴퓨터 프로그램 및 데이터를 저장하는 메모리를 더 포함한다. 당업자는 본 출원의 실시예에서 열거된 각 설명적인 논리 블록(illustrative logical block) 및 단계(step)는 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양자의 결합을 통해 구현될 수 있다는 것을 이해할 수 있다. 당해 기 능이 하드웨어를 통해 구현되는지 소프트웨어를 통해 구현되는 지는 특정된 응용 및 전체 시스템의 설계 요구에 의해 결정된다. 당업자는 각 종 특정 응용에 대해, 각 종 방법을 사용하여 상기 기능을 구현할 수 있지만, 당해 구현은 본 출원의 실시예에서 보호하려는 범위를 초과한 것으로 간주되서는 안된다. 본 출원의 실시예는 통신 시스템을 더 제공하고, 당해 시스템은 상기 도7의 실시예에서 단말 기기로서의 통신 장치 및 네트워크측 기기로서의 통신 장치를 포함하고, 또는, 당해 시스템은 상기 도8의 실시예에서 단말 기기 로서의 통신 장치 및 네트워크측 기기로서의 통신 장치를 포함한다. 본 출원은 명령이 저장되어 있는 컴퓨터 판독 가능 저장 매체를 더 제공하고, 당해 명령이 컴퓨터에 의해 수행 될 경우 상기 어느 하나의 방법 실시예의 기능이 구현된다. 본 출원은 컴퓨터 프로그램 제품을 더 제공하고, 당해 컴퓨터 프로그램 제품이 컴퓨터에 의해 수행될 경우 상기 어느 하나의 방법 실시예의 기능이 구현된다. 상기 실시예에서, 전부 또는 부분적으로 소프트웨어, 하드웨어, 펌웨어 또는 당해 임의의 조합을 통해 구현될 수 있다. 소프트웨어로써 구현할 경우, 전부 또는 부분적으로 컴퓨터 프로그램 제품의 형식으로 구현된다. 상기 컴퓨터 프로그램 제품은 하나 또는 복수의 컴퓨터 프로그램을 포함한다. 컴퓨터에서 상기 컴퓨터 프로그램을 로 딩 또는 수행할 경우, 전부 또는 부분적으로 본 출원의 실시예에 따른 프로세스 또는 기능을 생성한다. 상기 컴 퓨터는 통용 컴퓨터, 전용 컴퓨터, 컴퓨터 네트워크, 또는 기타 프로그램 가능 장치일 수 있다. 상기 컴퓨터 프 로그램은 컴퓨터 판독 가능 저장 매체에 저장될 수 있고, 또는 일 컴퓨터 판독 가능 저장 매체에서 다른 컴퓨터 판독 가능 저장 매체에 전송된다. 예를 들면, 상기 컴퓨터 프로그램은 1개의 웹 사이트, 컴퓨터, 서버 또는 데 이터 센터에서 유선(예를 들면 동축 케이블, 광섬유, 디지털 가입자 회선(digital subscriber line, DSL)) 또는 무선(예를 들면 적외선, 무선, 마이크로웨이브 등) 방식을 통해 다른 웹 사이트, 컴퓨터, 서버 또는 데이터 센 터에 전송로 전송할 수 있다. 상기 컴퓨터 판독 가능 저장 매체는 컴퓨터에 의해 액세스 가능한 임의의 사용 가 능한 매체 또는 하나 또는 복수의 사용 가능한 매체로 통합된 서버, 데이터 센터 등 데이터 저장 기기일 수 있 다. 상기 사용 가능한 매체는 자성 매체(예를 들면, 플로핏 디스켓, 하드 디스크, 자기 테이크), 광 매체(예를 들면, 고밀도 디지털 비디오 디스크(digital video disc, DVD)), 또는 반도체 매체(예를 들면, 솔리드 스테이트 디스크(solid state disk, SSD)) 등일 수 있다. 당업자는, 본 출원에 언급된 제1, 제2 등 각 수자 번호는 설명의 편리를 위해 구별된 것이고, 본 출원 실시예의 범위를 한정하기 위한 것이 아니고, 선후 순서를 나타내는 점을 이해할 수 있다. 본 출원의 적어도 하나는 하나 또는 복수로 설명될 수도 있고, 복수는 2개, 3개, 4개 또는 더 많을 수 있고, 본 출원에서 한정하지 않는다. 본 출원의 실시예에서, 기술 구성에 대해, \"제1\", \"제2\", \"제3\", \"A\", \"B\", \"C\" 및 \"D\"를 통해 당해 기술 구성 중의 기술 구성을 구별하고, 당해 \"제1 \", \"제2 \", \"제3 \", \"A\", \"B\", \"C\" 및 \"D\" 가 설명하는 기술 구성 사이는 선후 순서 또는 크기 순서가 존재하지 않는다. 본 출원의 각 테이블에 도시된 대응관계는 설정될 수 있고, 사전 정의된 것일 수도 있다. 각 리스트의 정보의 값은 예시 뿐이고, 기타 값으로 설정될 수 있고, 본 출원에서 한정하지 않는다. 설정 정보와 각 파라미터의 대 응관계를 설정할 경우, 반드시 각 테이블에 도시된 모든 대응관계를 설정하도록 요구하지 않는다. 예를 들면, 본 출원의 테이블에서, 일부 행에 도시된 대응관계는 설정하지 않아도 된다. 또 예를 들면, 상기 테이블을 기반 으로 적합한 변형 및 조정을 할 수 있다. 예를 들면, 분해, 합병 등을 할 수 있다. 상기 각 테이블에서 타이틀 에 나타내는 파라미터의 명칭은 통신 장치에 의해 이해 가능한 기타 명칭을 사용할 수도 있고, 당해 파라미터의 값 또는 표시 방식도 통신 장치에 의해 이해 가능한 기타 값 또는 표시 방식을 사용할 수도 있다. 상기 각 테이 블은 구현할 경우, 기타 데이터 구조를 사용할 수도 있다. 예를 들면 배열, 대기열, 용기, 스택, 선형 목록, 포 인터, 체인 테이블, 나무, 그래프, 구조체, 클래스, 힙, 해시 테이블 또는 해시 테이블 등을 사용할 수 있다. 본 출원의 사전 정의는 정의, 사전 정의, 저장, 사전 저장, 사전 협상, 사전 설정, 경화, 또는 사전 소성으로 이해할 수 있다. 당업자가 의식해야 하는 바, 본 출원의 설명에서 제공하는 실시예에서 설명된 각 예시의 유닛 및 알로리즘 단계 는, 전자 하드웨어, 또는 컴퓨터 소프트웨어 및 전자 하드웨어의 결합으로 구현될 수 있다. 당해 기능이 하드웨 어 방식으로 수행되는지 소프트웨어 방식으로 수행되는지는, 기술 수단의 특정 응용 및 설계 단속 조건에 의해 결정된다. 당업자는 각 특정된 응용에 대해 부동한 방법으로써 설명된 기능을 구현할 수 있지만, 당해 구현은 본 출원의 범위를 초과하는 것으로 간주되서는 안된다. 당업자가 명확히 이해해야 할 것은, 설명의 편리 및 간결을 위해, 상기 설명된 시스템, 장치 및 유닛의 구체적 인 작업 프로세스는, 상기 방법 실시예의 해당 프로세스를 참조할 수 있고, 여기서 더는 설명하지 않는다. 상기 설명은, 본 출원의 구체적인 수행 방식일 뿐이고, 본 출원의 보호 범위는 이에 한정되지 않고, 임의의 본 기술 분야에 익숙한 당업자는 본 출원에서 밝혀진 기술 범위를 포함하고, 변화 또는 교체를 쉽게 생각할 수 있 고, 모두 본 출원의 보호 범위 내에 포함되어야 한다. 따라서, 본 출원의 보호 범위는 상기 청구항의 보호 범위 를 기준으로 해야 한다."}
{"patent_id": "10-2025-7001783", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 실시예 또는 배경 기술의 기술 수단을 더 명확하게 설명하기 위해, 아래는 본 발명의 실시예 또는 배 경 기술에서 사용해야 하는 도면에 대해 설명한다. 도1은 본 출원의 실시예에 따른 통신 시스템의 아키텍처 다이어그램이다. 도2는 본 출원의 실시예에 따른 채널 상태 정보 피드백 방법의 개략적인 흐름도이다. 도3은 본 출원의 실시예에 따른 다른 채널 상태 정보 피드백 방법의 개략적인 흐름도이다. 도4는 본 출원의 실시예에 따른 또 다른 채널 상태 정보 피드백 방법의 개략적인 흐름도이다. 도5는 본 출원의 실시예에 따른 또 다른 채널 상태 정보 피드백 방법의 개략적인 흐름도이다. 도6은 본 출원의 실시예에 따른 시간 도메인에서 CSI를 기반으로 하는 측정과 CSI 보고의 관계 예시도이다. 도7은 본 출원의 실시예에 따른 통신 장치의 구조 개략도이다. 도8은 본 출원의 실시예에 따른 다른 통신 장치의 구조 개략도이다. 도9는 본 출원의 실시예에 따른 칩의 구조 개략도이다."}
