{"patent_id": "10-2023-0098048", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0017386", "출원번호": "10-2023-0098048", "발명의 명칭": "작물의 최적 생육 환경 생성 시스템 및 방법", "출원인": "전미선", "발명자": "전미선"}}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "작물의 최적 생육 환경 생성 시스템에 있어서,작물 촬영 이미지를 포함하는 작물 성장 정보를 수집하는 작물 성장 정보 수집 센서;온도, 습도, 일조량을 포함하는 환경정보를 수집하는 환경 정보 수집 센서;작물 주변에 설치되어, 온도, 습도, 토양상태, 일조량을 포함하는 생육환경을 변화시키는 환경 조절 장치; 및 상기 성장 정보 및 환경정보를 수집하고, 작물 별 최적 환경 조건을 추출하고, 추출된 최적 환경 조건과 환경정보를 비교하여, 비교 결과에 따라 환경 조절 장치를 조정하는 서버; 를 포함하고, 상기 서버; 는작물 성장 정보를 분석하여 작물 상태를 파악하고, 딥러닝 모델을 통해 상기 작물의 생육상태를 파악하는 것을특징으로 하는 작물의 최적 생육 환경 생성 시스템."}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 서버; 는작물 성장 정보, 환경정보 및 딥러닝 모델의 학습 데이터를 수집하는 수집부;작물 별 최적 환경 조건 정보를 추출하는 추출부;상기 추출된 작물 별 최적 환경 조건 정보와 환경정보를 비교하여, 상기 환경 정보를 최적 환경 정보로 변화시키기 위한 프로세스를 검출하는 비교부; 상기 검출된 프로세스에 따라 환경제어장치를 제어하는 제어부; 를 포함하는 것을 특징으로 하는 작물의 최적생육 환경 생성 시스템."}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 서버; 는작물이 생육하는 지역의 기온, 온도, 습도 변화를 포함하는 환경정보 변화를 예측하는 예측부;상기 환경정보 변화에 따라 작물이 생육하는 지역에 필요한 대비 프로세스를 생성하는 대응부; 를 더 포함하고제어부; 는상기 대비 프로세스에 따라 환경제어 장치를 제어하는 것을 특징으로 하는 작물의 최적 생육 환경 생성 시스템."}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 서버; 는성장 정보 중 작물 이미지 분석을 통해, 작물의 생육 상태 및 병충해, 면역력, 영양소 흡수 정도를 파악하는 분석부; 를 더 포함하고, 상기 생육 상태는작물의 식물체 크기, 잎의 색상과 모양, 줄기의 강도를 포함하는 것을 특징으로 하는 작물의 최적 생육 환경 생공개특허 10-2025-0017386-3-성 시스템."}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 환경 조절장치; 는가습기, 온풍기, 냉풍기, 차양막, 토양 영양공급 장치를 포함하는 것을 특징으로 하는 작물의 최적 생육 환경생성 시스템."}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 비교부; 는작물 생장에 필요한 온도, 토양성분, 습도, 조도를 포함하는 환경 조건 각각의 중요도를 작물 별로 산출하는 것을 특징으로 하는 작물의 최적 생육 환경 생성 시스템."}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서, 상기 예측부; 는 작물 성장 정보 수집 센서로부터 수집된 작물 성장 정보가 불완전하거나 딥러닝 학습에 적절하지 않은 경우, 상기 작물 성장 정보에서 작물을 심은 날짜 및 이전에 수집된 작물의 작물 성장 정보를 추출하고, 저장된 상기 작물의 일반적인 생장 상태를 추론하는 것을 특징으로 하는 작물의 최적 생육 환경 생성 시스템."}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "작물의 최적 생육 환경 생성 방법에 있어서,(A) 작물 성장 정보 수집 센서에서 작물 촬영 이미지를 포함하는 작물 성장 정보를 수집하는 단계;(B) 환경 정보 수집 센서에서 온도, 습도, 일조량을 포함하는 환경정보를 수집하는 단계;(C) 서버에서 상기 성장 정보 및 환경정보를 수집하고, 작물 별 최적 환경 조건을 추출하고, 추출된 최적 환경조건과 환경정보를 비교하여, 비교 결과에 따라 환경 조절 장치를 조정하는 단계; 및 (D) 환경 조절 장치에서 작물 주변에 설치되어, 온도, 습도, 토양상태, 일조량을 포함하는 생육환경을 변화시키는 단계; 를 포함하고, 상기 (C)의 단계; 는 작물 성장 정보를 분석하여 작물 상태를 파악하고, 딥러닝 모델을 통해 상기 작물의 생육상태를 파악하는 것을특징으로 하는 작물의 최적 생육 환경 생성 방법."}
{"patent_id": "10-2023-0098048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 (C); 의 단계; 는 수집부에서 작물 성장 정보, 환경정보 및 딥러닝 모델의 학습 데이터를 수집하는 단계;추출부에서 작물 별 최적 환경 조건 정보를 추출하는 단계;비교부에서 상기 추출된 작물 별 최적 환경 조건 정보와 환경정보를 비교하여, 상기 환경 정보를 최적 환경 정보로 변화시키기 위한 프로세스를 검출하는 단계; 및제어부에서 상기 검출된 프로세스에 따라 환경제어장치를 제어하는 단계; 를 포함하는 것을 특징으로 하는 작물공개특허 10-2025-0017386-4-의 최적 생육 환경 생성 방법."}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 따른 최적 생육 환경 생성 시스템 및 방법은 작물에 설치된 센서를 통해, 작물 성장 정보를 모니터링하 고, 작물 주변의 토양상태, 기후상태 및 성장 환경을 센싱한다. 실시예에서는 작물 별 최적 환경 정보를 추출하 고, 센싱된 작물 주변의 토양상태, 기후상태 및 성장 환경을 최적 환경 정보와 비교하여, 가습기, 제습기, 차양 막, 토양 영양 공급 장치 등의 환경 조절 장치를 통해, 작물의 생육 환경을 최적 환경으로 변화시킨다. 또한, 실 시예에서는 작물 성장 상태 모니터링 결과에 따라 해당 작물에 필요한 프로세스를 추출하여, 환경 조절 장치를 통해 제공할 수 있다. 또한, 실시예에서는 작물 성장 정보 모니터링 결과, 조치가 필요한 작물의 훼손, 병충해 등이 검출된 경우, 이를 관리자 단말로 알리고 조치할 수 있도록 한다."}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 최적 생육 환경 생성 시스템 및 방법에 관한 것으로 구체적으로, 작물 별 최적 환경 조건을 파악하여 작물의 토양상태, 기후상태 및 성장 환경을 최적 환경 조건으로 변화시키도록 하는 최적 생육 환경 생성 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 기후 변화는 강수량, 기온 및 기상 조건 등의 변화를 초래한다. 농작물은 기후 요인에 민감하게 반응하므로 예 상치 못한 기후 변화로 인해 수확량이 크게 영향을 받을 수 있다. 또한, 장마철의 지연, 가뭄, 폭염 등은 농작 물의 성장과 생산에 부정적인 영향을 미치고, 기후 변화는 새로운 병충해와 식물 질병의 발생 가능성을 증가시 킨다. 이로 인해 농업 경작에 많은 어려움이 생기며, 식량 생산에도 부정적인 영향을 미치는 것은 피할 수 없다. 또한, 대기 오염과 토양 오염은 농작물의 품질에 직접적인 영향을 미친다. 대기 오염으로 인해 유해한 화학 물 질이 농작물에 흡수되어 질병이 늘어날 수 있고, 지속적인 토양 오염은 농작물의 성장을 저해하고, 영양분의 흡 수를 방해하여 생산량과 품질에 영향을 줄 수 있다. 이러한 환경 오염은 농작물의 안전성과 영양가를 감소시키 며, 소비자 건강에도 부정적인 영향을 미칠 수 있다. 환경 변화로 인한 농작물의 위험성과 불안정성으로 인해 지속 가능한 농업의 수요가 커지고 있다. 아울러, 환경 정보 및 환경 정보에 따른 농작물의 성장과 수확량을 예측하는 기술에 대한 수요도 증가하고 있다. 지속 가능한 농업은 기후 변화에 대응하고 환경 오염을 최소화하여 농작물 생산을 지속할 수 있는 방법을 모색하는 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 한국 특허등록 제10-1923508호 (2018.11.23) (특허문헌 0002) 2. 한국 특허공개 제10-2019-0143680호 (2020.12.09)"}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예에 따른 최적 생육 환경 생성 시스템 및 방법은 작물에 설치된 센서를 통해, 작물 성장 정보를 모니터링 하고, 작물 주변의 토양상태, 기후상태 및 성장 환경을 센싱한다. 실시예에서는 작물 별 최적 환경 정보를 추출하고, 센싱된 작물 주변의 토양상태, 기후상태 및 성장 환경을 최 적 환경 정보와 비교하여, 가습기, 제습기, 차양막, 토양 영양 공급 장치 등의 환경 조절 장치를 통해, 작물의 생육 환경을 최적 환경으로 변화시킨다. 또한, 실시예에서는 작물 성장 상태 모니터링 결과에 따라 해당 작물에 필요한 프로세스를 추출하여, 환경 조절 장치를 통해 제공할 수 있다. 또한, 실시예에서는 작물 성장 정보 모니터링 결과, 조치가 필요한 작물의 훼손, 병충해 등이 검출된 경우, 이 를 관리자 단말로 알리고 조치할 수 있도록 한다."}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 작물의 최적 생육 환경 생성 시스템은 작물 촬영 이미지를 포함하는 작물 성장 정보를 수집하는 작물 성장 정보 수집 센서; 온도, 습도, 일조량을 포함하는 환경정보를 수집하는 환경 정보 수집 센서; 작물 주 변에 설치되어, 온도, 습도, 토양상태, 일조량을 포함하는 생육환경을 변화시키는 환경 조절 장치; 성장 정보 및 환경정보를 수집하고, 작물 별 최적 환경 조건을 추출하고, 추출된 최적 환경 조건과 환경정보를 비교하여, 비교 결과에 따라 환경 조절 장치를 조정하는 서버; 를 포함하고, 서버; 는 작물 성장 정보를 분석하여 작물 상 태를 파악하고, 딥러닝 모델을 통해 상기 작물의 생육상태를 파악한다."}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같은 작물의 최적 생육 환경 생성 시스템 및 방법은 작물 별 최적 생장 환경 조건을 제공하여, 작물 의 성장을 도움으로써, 농가의 수확 품질을 향상시킬 수 있다. 또한, 실시예를 통해 여러 기후변화에 대응할 수 있도록 함으로써, 농가의 생산성과 작물 품질을 일정 수준이상 으로 유지할 수 있도록 한다. 또한, 실시예를 통해, 작물 성장을 모니터링하고 조치가 필요한 이벤트가 검출된 경우, 이를 관리자에게 알려 신속하게 조치할 수 있도록 함으로써, 작물의 전염병, 훼손으로 인한 추가 피해가 발생하지 않도록 한다."}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1개의 유닛이 2개 이상의 하드웨어를 이용하여 실현되어도 되 고, 2개 이상의 유닛이 1개의 하드웨어에 의해 실현되어도 된다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기술 된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 이하, 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 실시예에 따른 작물의 최적 생육 환경 생성 시스템 구성을 나타낸 도면이다. 도 1을 참조하면, 실시예에 따른 작물의 최적 생육 환경 생성 시스템은 성장 정보 수집 센서, 환경 정보 수집 센서, 환경 조절 장치, 서버 및 관리자 단말을 포함하여 구성될 수 있다. 성장 정보 수집 센서은 작물 또는 작물 주변에 설치된 센서로서, 작물 성장 정보를 수집한다. 실시예에서 성장 정보 수집 센서는 카메라, 이미지 센서 등으로 구성될 수 있고, 작물 성장 정보는 카메라를 통해 수 집된 작물 이미지를 포함할 수 있다. 실시예에서 성장 정보 수집 센서는 작물 이미지를 주기적으로 수집하 여 수집된 이미지를 성장 정보로 서버에 전송한다. 환경정보 수집 센서는 작물이 자라는 주변의 환경정보를 수집한다. 실시예에서 환경정보 수집센서는 온도센서, 습도센서, 조도 센서, 양의 성분, 습도 등을 측정하기 위한 토양상태 측정센서 등을 포함하고 이에 한정하지 않는다. 실시예에서 환경정보 수집센서는 작물이 자라는 지역의 환경 정보를 주기적으로 수집하 여 서버로 전송한다. 또한, 실시예에서는 나무 내부의 수분, 산도 등을 측정하기 위해, 수목센서를 성장 정보 수집 센서로 설치 하거나, 타겟팅 하는 나무에 탐침을 위한 봉을 끼워 나무의 성장 정보를 수집할 수 있다. 또한, 실시예에서는 나무 등 작물 주변의 환경 정보를 센서로부터 수집하거나 기상청 서버로부터 수집할 수 있 다. 환경조절장치는 작물 주변에 설치되어, 온도, 습도, 토양상태, 조도를 포함하는 생육환경을 변화시킨다. 예컨대, 환경조절장치는 작물 주변 환경정보의 습도가 일정 수준 미만으로 낮아지는 경우, 가습장치를 구 동하여 습도를 향상시킬 수 있다. 실시예에서 환경조절장치는 가습기, 온풍기, 냉풍기, 차양막, 토양 영양 공급 장치 등을 포함하고 이에 한정하지 않는다. 또한, 일조량이 일정 수치를 초과하는 경우에는 차양막을 내려 작물에 전달되는 일조량을 조절할 수 있도록 한다. 서버는 작물 성장 정보 및 환경정보를 수집하고, 작물 별 최적 환경 조건을 추출하고, 추출된 최적 환경 조건과 환경정보를 비교하여, 비교 결과에 따라 환경 조절 장치를 조정한다. 실시예에서 서버는 작물 성장 정보를 분석하여 작물 상태를 파악하고, 답러닝 모델을 통해 작물의 생육상 태를 파악할 수 있다. 실시예에서 서버은 작물 성장 정보로 수집한 작물 이미지를 이미지 인식 모델로 분 석하여, 작물의 크기, 색, 잎의 크기, 색, 줄기 강도 등을 포함하는 작물의 생육 상태를 파악할 수 있다. 관리자 단말은 서버로부터 환경정보제어 장치의 가동 정보 및 작물 생육상태 분석 결과를 수신 한다. 또한, 실시예에서 서버는 작물 이미지 분석 결과 작물의 훼손, 병충해 발생 등의 이상상태가 검출되 는 경우 이에 대한 알림을 관리자 단말로 전송한다. 관리자 단말은 서버로부터 수신한 정보 출력 후, 환경 정보 제어 장치를 원격으로 제어할 수 있 다. 실시예에서 관리자 단말은 인증 절차를 수행하고, 관리자 인증이 정상 완료된 경우, 환경 정보 제어 장치를 원격으로 제어할 수 있다. 실시예에 따른 최적 생육 환경 생성 시스템 및 방법은 작물에 설치된 센서를 통해, 작물 성장 정보를 모니터링 하고, 작물 주변의 토양상태, 기후상태 및 성장 환경을 센싱한다. 실시예에서는 작물 별 최적 환경 정보를 추출하고, 센싱된 작물 주변의 토양상태, 기후상태 및 성장 환경을 최 적 환경 정보와 비교하여, 가습기, 제습기, 토양 영양 공급 장치 등의 환경 조절 장치를 통해, 작물의 생육 환 경을 최적 환경으로 변화시킨다. 또한, 실시예에서는 작물 성장 상태 모니터링 결과에 따라 해당 작물에 필요한 프로세스를 추출하여, 환경 조절 장치를 통해 제공할 수 있다. 또한, 실시예에서는 작물 성장 상태 모니터링 결과, 다른 조치가 필요한 작물의 훼손이 검출된 경우, 이를 관리 자 단말로 알리고 조치할 수 있도록 한다. 도 2는 실시예에 따른 서버의 데이터 처리 구성을 나타낸 도면이다. 도 2를 참조하면, 실시예에 따른 서버는 수집부, 전처리부, 딥러닝부, 추출부, 비교 부, 분석부, 예측부, 대응부 및 제어부를 포함하여 구성될 수 있다. 본 명세서에서 사용되는 '부' 라는 용어는 용어가 사용된 문맥에 따라서, 소프트웨어, 하드웨어 또는 그 조합을 포함할 수 있 는 것으로 해석되어야 한다. 예를 들어, 소프트웨어는 기계어, 펌웨어(firmware), 임베디드코드(embedded code), 및 애플리케이션 소프트웨어일 수 있다. 또 다른 예로, 하드웨어는 회로, 프로세서, 컴퓨터, 집적 회로, 집적 회로 코어, 센서, 멤스(MEMS; Micro-Electro-Mechanical System), 수동 디바이스, 또는 그 조합일 수 있 다. 수집부는 작물 성장 정보, 환경정보 및 딥러닝 모델의 학습 데이터를 수집한다. 실시예에서 수집부는 성장정보 수집 센서로부터 작물 이미지를 포함하는 작물 성장 정보를 수집한다. 또한, 환경 정보 수집 센서로부 터 온도, 조도, 습도, 대기질 등을 포함하는 환경정보를 수집한다. 또한, 수집부는 환경정보 및 작물 성장 정보 분석에 이용되는 딥러닝 모델의 학습 데이터를 수집한다. 실시예에서 딥러닝 모델은 이미지 인식 모델, 환 경정보 분석 모델, 작물 별 환경 조건 중요도 산출 모델 등을 포함하고 이에 한정하지 않는다. 실시예에서 이미지 인식 모델의 학습 데이터는 건강한 작물 이미지, 비정상적인 작물 이미지, 작물의 성장 단계 이미지 등을 포함할 수 있다. 기후데이터, 토양 데이터, 공기 오염 데이터, 식물 질병 데이터, 지리 데이터 등 을 포함할 수 있다. 실시예에서 작물 별 환경 조건 중요도 산출 모델의 학습 데이터는 작물 종류, 각 장물에 대 해 중요한 환경 조건 데이터, 작물 생육 데이터, 작물 재배 환경 데이터 등을 포함할 수 있다. 전처리부는 수집된 딥러닝 모델의 학습데이터 중 편향성이나 차별성을 가진 데이터를 제거하기 위해, 수집 된 학습데이터를 전처리한다. 실시예에서 전처리부는 수집된 데이터를 전처리하여 인공지능 모델 학습에 적합한 형태로 가공한다. 예컨대, 전처리부는 노이즈 제거, 이상치 제거, 결측치 처리 등의 과정을 수행할 수 있다. 또한, 전처리부는 데이터 전처리를 통해 데이터를 정규화하거나, 이상치를 제거하거나, 데이터의 배율 조정 등을 수행하여 모델이 불필요한 패턴을 학습하는 것을 방지할 수 있다. 딥러닝부는 딥러닝 뉴럴 네트워크를 학습 데이터로 학습시켜 이미지 인식 모델, 환경정보 분석 모델, 작물 별 환경 조건 중요도 산출 모델 등을 포함하는 딥러닝 모델을 구현한다. 실시예에서 딥러닝 뉴럴 네트워크는 DNN(Deep Neural Network), CNN(Convolutional Neural Network) RNN(Recurrent Neural Network) 및 BRDNN(Bidirectional Recurrent Deep Neural Network) 중 적어도 하나를 포함할 수 있고 이에 한정하지 않는다. 추출부는 작물 별 최적 환경 조건 정보를 추출한다. 실시예에서 추출부는 작물 별로 최적 환경 조건 정보를 추출하기 위해 기후 데이터, 토양 조건, 작물 생육 데이터 등 다양한 환경 데이터를 수집한다. 또한, 웹 크롤링 및 API를 이용하여 관련된 과학적 연구, 농업 전문가의 조언, 지역 농업 현장 등에서 데이터를 수집한다. 실시예에서 추출부는 수집된 데이터를 기반으로 통계 분석 및 기계 학습 모델을 사용하여 작물 별 최적 환경 조건을 추출한다. 실시예에서 통계 분석은 데이터 간의 상관 관계를 확인하고, 작물의 생육에 영 향을 주는 주요 변수를 식별하는 데 사용된다. 또한, 기계 학습 모델은 데이터를 학습하고 예측하여 최적 조건 을 도출한다. 실시예에서는 회귀 모델, 분류 모델, 군집화 등 다양한 기계 학습 알고리즘을 적용한다. 실시예에서 추출부는 작물의 종류에 따른 최적 환경 조건을 환경 정보의 카테고리에 따라 각각 추출할 수 있다. 예컨대. 추출부는 작물의 종류에 따른 최적 일조량, 온도, 습도, 토양상태, 강수량 조건을 추출할 수 있다. 구체적으로 추출부는 포도나무의 경우, 최적 일조량 조건을 하루에 6~8시간 이상의 직접적인 햇 빛으로 추출하고, 최적 온도 조건을 15°C에서 25°C 로 추출할 수 있다. 아울러, 최적 습도 조건을 60%에서70% 사이의 상대 습도로 추출하고, 최적 토양 조건을 pH 5.5에서 6.5 사이의 토양으로 추출할 수 있다. 아울러 최적 강수량 조건을 주당 25~50mm의 강수량으로 추출할 수 있다. 비교부는 추출된 작물 별 최적 환경 조건 정보와 환경정보를 비교하여, 환경 정보를 최적 환경 정보로 변 화시키기 위한 환경 변화 프로세스를 검출한다. 이를 위해 비교부는 최적 환경 조건 정보와 실제 환경 정보를 비교하여 차이를 분석한다. 실시예에서 비교 부는 통계 분석 알고리즘 및 데이터 분석 모델을 통해 최적 환경 조건 정보와 실제 환경 정보를 분석하여 차이를 파악한다. 실시예에서 비교부는 실제 환경 정보와 최적 조건 정보 간의 상관 관계, 차이의 크기, 특정 변수의 영향력 등을 분석할 수 있다. 이후, 비교부는 기계 학습 알고리즘을 사용하여 실제 환경 정보 를 최적 환경 조건 정보로 변화시키기 위한 프로세스를 모델링한다. 예컨대, 비교부는 회귀 모델, 분류 모 델, 군집화 등을 사용하여 최적 조건에 근접하도록 환경 정보를 변화시키는 모델을 학습시킬 수 있다. 이후, 비 교부는 환경 정보가 최적 환경 조건 정보와 일정 수준 이상 차이나는 경우, 환경 정보를 변화시키는 모델 을 통해, 환경 변화 프로세스를 추출한다. 이후, 환경 변화 프로세스에 따라 환경 정보 제어 장치를 조정할 수 있도록 한다. 구체적으로, 최적 환경 조건 정보가 토양의 영양정도가 일정 수준 이상이고, 실제 수집된 환경 정 보에서 토양의 영양정도가 일정 수준 미만인 경우, 비교부는 토양의 영양정도를 최적 조건에 근접하도록 변화시키기 위해, 토양에 영양을 제공하는 장치를 제어하는 프로세스를 환경 변화 프로세스로 생성할 수 있다. 또한, 실시예에서 비교부는 작물 생장에 필요한 온도, 토양성분, 습도, 조도를 포함하는 환경 조건 각각의 중요도를 작물 별로 산출한다. 이를 위해 비교부는 작물에 대한 이전 연구나 전문가들의 권고 사항을 검토하여 작물에 영향을 주는 주요 한 환경 요소들을 식별한다. 작물에 영향을 주는 환경 요소는 온도, 토양성분, 습도, 조도 등과 같은 요소를 포함할 수 있다. 이후, 작물 재배에 대한 경험이 있는 전문가나 농부들과의 인터뷰 자료 등 환경 조건 가중치 판단 정보를 수집하여 환경 요소들의 중요성에 대한 정보를 수집한다. 실시예에서 환경 조건 가중치 판단 정보 는 외부 서버로부터 수집하거나, 웹 크롤링을 통해 수집할 수 있다. 또한, 실시예에서 비교부는 수집된 환 경 조건 가중치 판단 정보를 분석하여 작물 생장에 각 환경 요소들이 어떤 영향을 미치는지 확인하고, 환경 조 건에 포함된 각 요소들의 상대적인 중요성을 파악한다. 이후, 비교부는 수집된 정보와 데이터를 종합하여 각 환경 요소들의 중요도에 대한 가중치를 평가한다. 실시예에서 비교부는 계층적 분석, 전문가 판단 등의 평가 방법을 사용하거나, 환경 조건 가중치 산출 모델을 이용하여 환경 조건에 포함된 각 요소들의 상대적 가중 치를 산출한다. 이후, 비교부는 가중치 평가를 통해 획득한 결과를 해석하고 작물 별로 환경 요소들의 중요도를 비교한다. 이를 통해 작물에게 가장 중요한 환경 조건이 무엇인지를 파악할 수 있다. 실시예에서는 특정 환경에서 생장하는 작물에게 가중치가 가장 높은 환경 조건을 추출하고, 추출된 가중치가 가 장 높은 환경 조건과 최적 환경 조건을 비교하여, 가중치가 가장 높은 환경 조건을 최적 환경 조건에 유사하도 록 변화시킬 수 있다. 분석부는 성장 정보 중 작물 이미지 분석을 통해, 작물의 생육 상태 및 병충해, 면역력, 영양소 흡수 정도 를 파악한다. 실시예에서 생육 상태는 작물의 식물체 크기, 잎의 색상과 모양, 줄기의 강도 등을 포함한다. 이를 위해 분석부는 작물의 다양한 생육 상태, 병충해 발생, 영양 상태를 포함한 이미지를 수집한다. 이는 작물의 잎, 줄기, 꽃, 열매 등을 포함한 다양한 작물 부위의 이미지를 포함하고, 정기적으로 촬영된 이미지 또 는 작물 재배 시 과학적인 실험에서 얻은 이미지를 사용할 수 있다. 실시예에서 분석부는 수집된 작물 이미지에서 객체 검출 및 분할한다. 예컨대, 분석부는 작물 이미지 에서 작물 부위(잎, 줄기, 꽃, 열매 등)를 객체로 검출하고 분할한다. 이는 컴퓨터 비전 기술을 사용하여 작물 부위를 식별하고, 객체 경계를 정확하게 추출하는 과정이다. 이후, 분석부는 추출된 작물 부위의 이미지에 서 특징을 추출한다. 이는 작물의 생육 상태, 병충해 증상, 면역력 및 영양 상태와 관련된 특징을 선택하고 추 출하는 과정이다. 실시예에서 분석부는 색상, 질감, 형태, 크기 등의 특징을 추출할 수 있다. 실시예에서 분석부는 추출된 특징을 사용하여 작물의 생육 상태, 병충해 발생, 면역력 및 영양소 흡수 정도를 분류하 는 모델을 학습시킨다. 이는 기계 학습 알고리즘을 사용하여 분류 모델을 구축하고, 이미지 특징과 작물의 상태 간의 관계를 학습하는 과정이다. 이후, 분석부는 학습된 모델을 사용하여 새로운 작물 이미지를 분석하고 결과를 분석하고 분석 결과를 시각화 한다. 실시예에서 분석 결과는 작물의 생육 상태, 병충해 발생 여부, 면역력 및 영양소 흡수 정도에 대한 정보를 제공한다. 또한, 실시예에서 분석부는 인공지능 머신러닝을 통한 이미지 인식(image recognition)과정을 통해 작물 이미지 및 일러스트를 기준으로 작물의 생육 상태를 최종 확정할 수 있다. 인공지능 이미지 인식은 기계가 마치 사람처럼 사진으로부터 사물을 인식하고 장면을 이해하는 것으로, 컴퓨터 비전 기술 중 하나에 해당한다. 실시 예에서는 이미지 인식을 위해, 이미지에 포함된 작물을 개체 분류(classification), 검출(detection) 및 개체를 픽셀 단위로 식별하여 분할(segmentation)하는 데이터 처리 과정을 수행한다. 실시예에서 분석부는 노이즈 대응 외 학습하지 못한 패턴 처리를 위해 학습 외 분포 데이터 탐지(out of distribution detection)과정을 수 행한다. 학습 외 분포 데이터 탐지는 인공지능에 입력된 이미지가 학습된 확률분포 데이터 인지 아닌지 식별하 는 것이다. 실시예에서는 학습 외 분포 데이터 탐지를 통해 인공 신경망이 판단하기 어려운 이미지를 걸러내거 나 예외 처리하여 안정성과 신뢰성을 높일 수 있도록 한다. 실시예에서는 학습 외 분포 데이터 탐지를 위해서 딥러닝 판정에 대해 얼마나 확신(confidence)하는지를 나타내는 확률 값을 보정(calibration)하거나 학습 외 분 포 데이터를 생성적 대립 신경망(GAN, Generative Adversarial Network)으로 생성하고 학습하여 탐지 정확도를 향상시킬 수 있도록 한다. 또한, 실시예에서는 이미지 인식 정확도를 유지하면서 모델의 크기를 줄이기 위해, 연산을 간소화하는 경량 딥 러닝 기술을 이용하여 체형박스를 최종 확정할 수 있도록 한다. 실시예에서는 이미지 인식을 위해 콘볼루션 신 경망(CNN, Convolution Neural Network)에서 콘볼루션 필터를 변형하여 연산 차원을 축소(Reduction)하거나 큰 영향이 없는 신경망의 가중치(weight)를 삭제하는 가지치기, 가중치 값의 부동 소수점을 줄여 연산을 간소화하 는 양자화 과정을 수행하여 데이터 경량화를 가능하도록 한다. 또한, 실시예에서는 미리 학습시킨 큰 신경망의 출력을 작은 신경망에서 모방 학습하도록 하여 연산을 간소화하며 정확도를 유지할 수 있도록 한다. 또한, 예측부는 작물 성장 정보 수집 센서로부터 수집된 작물 성장 정보가 불완전하거나 딥러닝 학습에 적 절하지 않은 경우, 작물 성장 정보에서 작물을 심은 날짜 및 이전에 수집된 작물의 작물 성장 정보를 추출하고, 성장 예측 모델을 통해, 저장된 작물의 일반적인 생장 상태를 추론한다. 이를 위해, 예측부는 작물 성장 정보를 수집하는 센서를 사용하여 작물 이미지를 포함하는 작물의 성장 정 보를 수집한다. 이후, 수집된 작물 성장 정보를 검증하고, 불완전하거나 딥러닝 학습에 적절하지 않은 데이터를 식별한다. 예를 들어, 누락된 데이터, 이상치 등을 처리하거나 필터링한다. 이후, 예측부는 작물 성장 정 보 전처리 후에도, 작물 성장 정보가 불완전하거나 딥러닝 학습에 적절하지 않은 경우, 수집된 작물 성장 정보 에서 작물을 심은 날짜를 추출한다. 실시예에서 작물 성장 정보가 불완전하거나 딥러닝 학습에 적절하지 않은 경우는 불완전한 데이터를 획득한 경 우, 노이즈와 이상치가 포함된 경우, 측정오차가 발생한 경우, 데이터 품질에 문제가 있는 경우 및 샘플이 부족 한 경우 등을 포함할 수 있다. 실시예에서 불완전한 데이터를 획득한 경우는 작물 성장 정보 수집 센서가 오작동하거나 외부 요인에 의해 데이 터가 일부 손실된 경우를 포함한다. 예를 들어, 센서의 결함으로 인해 일부 데이터가 누락되거나 부정확한 측정 이 발생하는 경우를 포함한다. 실시예에서 노이즈와 이상치가 포함된 경우는 작물 성장 정보 수집 중에 외부 요인이나 잘못된 센서 캘리브레이 션 등으로 인해 데이터에 노이즈나 이상치가 포함되는 경우이다. 실시예에서 측정 오차가 발생한 경우는 작물 성장 정보를 수집하는 센서의 측정 오차가 존재하는 경우로서, 수 집된 데이터가 실제 작물의 성장 상태와 차이가 일정 수준 이상 확인되는 경우를 포함할 수 있다. 구체적으로, 작물의 키, 줄기의 굵기, 잎의 크기 등을 포함하는 성장 상태가 측정데이터와 일정 수준 이상 차이가 나는 경우 이다. 또한, 데이터 품질에 문제가 있는 경우는 작물 성장 정보 수집 센서에서 수집된 데이터가 적절하지 않은 해상도, 빈번한 누락, 불균형한 분포 등으로 인해 딥러닝 학습에 적합하지 않는 경우이다. 예를 들어, 센서의 측정 주기가 너무 길거나 데이터가 일관성 없이 수집되는 경우 등을 포함할 수 있다. 또한, 샘플이 부족한 경우는 작물 성장 정보 수집 센서를 통해 수집된 데이터의 양이 부족한 경우로서, 이로 인 해 딥러닝 모델이 충분한 정보를 학습하기 어려울 수 있다. 실시예에서 예측부는 작물 성장 정보가 불완전하거나 딥러닝 학습에 적절하지 않은 경우, 수집된 작물 성 장 정보에서 작물을 심은 날짜를 추출하기 위해, 심어진 시점의 데이터를 식별하는 알고리즘 또는 이미지 인식기술을 이용할 수 있다. 예컨대, 예측부는 작물이 처음으로 식별되거나 성장하는 초기 단계의 특정 패턴을 감지하여 심은 날짜를 추론할 수 있다. 또한, 예측부는 작물을 심은 날짜를 기준으로 이전에 수집된 작물 성장 정보를 추출한다. 실시예에서 예측 부는 이전 데이터에서는 작물의 생장 상태, 성장률, 영양 상태 등과 관련된 정보를 확인할 수 있다. 이후, 예측부는 추출된 작물의 이전 성장 정보를 활용하여 해당 작물의 일반적인 생장 상태를 추측한다. 이를 위해 예측부는 기계 학습 알고리즘 또는 작물 성장 예측 모델을 사용하거나 도메인 지식을 활용할 수 있다. 또한, 예측부는 이전 작물 성장 정보를 기반으로 작물의 생장 패턴, 예상 성장률, 건강 상태 등을 분석하여 작물의 현재 상태를 추론할 수 있다. 예측부는 작물이 생육하는 지역의 기온, 온도, 습도 변화를 포함하는 환경정보 변화를 예측한다. 이를 위 해 예측부는 작물이 생육하는 지역의 기온, 온도, 습도와 같은 환경 데이터를 수집한다. 환경 데이터는 기 상청, 기후 관측소, 센서 네트워크 등에서 수집된 실시간 또는 과거의 환경 데이터를 포함한다. 이후 예측부 는 환경 데이터로 환경 예측 모델 학습 후, 현재 측정된 온도, 습도, 조도, 일조량 등의 환경 정보를 입력 받아 미래의 환경 정보를 예측할 수 있다. 또한, 실시예에서 예측부는 예측 모델에 활용하기 위해 수집된 환경 데이터에 대한 특성을 추출하거나 변 환한다. 예컨대, 예측부는 일별 평균 기온, 최고 기온과 최저 기온의 차이, 습도 변화율 등과 같은 특성을 생성할 수 있다. 이후 예측부는 수집된 환경 데이터를 사용하여 예측 모델을 학습시킨다. 예컨대, 예측부 는 회귀, 시계열 분석, 신경망 등의 기계학습 알고리즘을 활용하여 환경 데이터와 작물 생육 상태 사이의 관계를 학습한다. 실시예에서 모델은 기온, 온도, 습도와 같은 환경 변수를 입력으로 받아 작물의 생육 상태 변 화를 예측할 수 있도록 학습된다. 이후 예측부는 학습된 모델을 사용하여 미래의 환경 데이터를 입력으로 받아 작물의 생육 상태 변화를 예측한다. 이는 다음 시간대의 기온, 온도, 습도와 같은 환경 정보를 예측하는 것이다. 대응부는 환경정보 변화에 따라 작물이 생육하는 지역에 필요한 대비 프로세스를 생성한다. 이를 위해 대 응부는 환경 정보와 성장 정보를 수집하고, 수집한 환경 정보를 분석하여 작물 생육에 영향을 미치는 주요 요소를 식별한다. 예컨대, 대응부는 기온, 강수량, 토양의 영양 상태에 따른 작물 생장 정도, 병해충 발생 여부를 분석한다. 이후 대응부는 분석한 환경 정보와 생장 정보를 기반으로 작물 생육에 영향을 미치는 요 소들 간의 관계를 파악한다. 실시예에서 대응부는 환경 정보 및 성장정보 분석 모델을 통해, 작물 생육에 영향을 미치는 요소들을 파악할 수 있다. 이후, 대응부는 환경 정보에 따른 작물 생육에 적합한 대비 프로 세스를 생성한다. 이는 예를 들어, 기온이 높아질 경우 물을 더 많이 주거나 그림자를 제공하는 등의 조치를 취 하기 위한 프로세스이다. 제어부는 검출된 프로세스에 따라 환경제어장치를 제어한다. 예컨대, 제어부는 모니터링된 환경 정보 를 분석하여 자라고 있는 작물의 최적 생육 조건에서 부족하거나 넘치는 환경 조건이 센싱되는 경우, 해당 환경 조건을 최적 환경 조건과 유사하게 변화시키도록 환경 제어장치를 제어한다. 예컨대, 일조량이 최적 환경 조건 보다 일정 수준 이상인 경우, 도 3에 도시된 바와 같이, 차양막을 제어하여 작물에게 전달되는 일조량을 줄일 수 있도록 한다. 실시예에서 딥러닝부는 학습된 인공신경망 모델을 평가한다. 실시예에서 딥러닝부는 정확도 (Accuracy), 정밀도 (Precision) 및 재현율 (Recall) 중 적어도 하나를 통해, 인공신경망 모델을 평가할 수 있 다. 정확도는 인공 신경망 모델이 예측한 결과가 실제 결과와 얼마나 일치하는지를 측정하는 지표이다. 정밀도 는 양성으로 예측한 결과 중 실제 양성인 비율을 측정하는 지표이다. 재현율은 실제 양성 중에서 모델이 양성으 로 예측한 비율을 측정하는 지표이다. 실시예에서 딥러닝부는 인공신경망 모델의 정확도, 정밀도 및 재현 율을 산출하고, 산출된 지표 중 적어도 하나를 기반으로 인공신경망 모델을 평가할 수 있다. 실시예에서 딥러닝부는 인공신경망 모델의 정확도를 평가 데이터셋을 사용하여 측정할 수 있다. 평가 데이 터셋은 모델이 학습에 사용하지 않은 데이터로 구성되어 있으며, 모델의 성능을 객관적으로 평가하는 데 사용된 다. 실시예에서 딥러닝부는 평가 데이터셋을 사용하여 인공신경망 모델을 실행하고, 각 입력 데이터에 대 한 인공신경망 모델의 예측 값과 해당 데이터의 실제 정답 값을 비교한다. 이후, 비교 결과를 통해, 모델이 얼 마나 정확하게 예측하는지를 측정할 수 있다. 예컨대, 딥러닝부에서 정확도는 전체 데이터 중에서 모델이 맞게 예측한 데이터의 비율로 계산될 수 있다. 또한, 딥러닝부는 정밀도와 재현율의 조화 평균으로 계산되는 지표인 정밀도와 재현율의 균형을 나타내는 지표인 F1 스코어(F1 Score)를 산출하고, 산출된 F1 스코어를 기반으로 인공신경망 모델을 평가하고, 분류 모델 의 성능을 그래프로 시각화한 지표인 AUC-ROC 곡선을 생성하고, 생성된 AUC-ROC 곡선을 기반으로 인공신경망 모 델을 평가할 수 있다. 실시예에서 딥러닝부는 ROC 곡선 아래 면적 (AUC)이 1에 가까울수록 모델의 성능이 좋은 것으로 평가할 수 있다. 또한, 딥러닝부는 인공신경망 모델의 해석 가능성을 평가할 수 있다. 실시예에서 딥러닝부는 SHAP (SHapley Additive exPlanations), LIME (Local Interpretable Model-agnostic Explanations) 방법을 통해, 인공신경망 모델의 해석 가능성을 평가한다. SHAP (SHapley Additive exPlanations)는 모델이 예측한 결과에 대한 해석을 제공하는 라이브러리로서, 딥러닝부는 라이브러리에서 SHAP 값을 추출한다. 실시예에서 딥러 닝부는 SHAP값 추출을 통해, 모델에 입력된 특성정보가 모델 예측에 얼마나 영향을 미쳤는지를 예측할 수 있다. LIME (Local Interpretable Model-agnostic Explanations) 방법은 개별 샘플에 대한 모델의 예측을 설명하는 방법이다. 실시예에서 딥러닝부는 LIME 방법을 통해, 샘플을 해석 가능한 모델로 근사하여 각 특성정보의 중요도를 계산한다. 또한, 딥러닝부은 모델의 내부 가중치와 편향 값을 분석하여 각 특성 변수의 영향력을 추정할 수 있다. 이하에서는 작물의 최적 생육 환경 생성 방법에 대해서 차례로 설명한다. 실시예에 따른 작물의 최적 생육 환경 생성 방법의 작용(기능)은 시스템의 기능과 본질적으로 같은 것이므로 도 1 내지 도 3과 중복되는 설명은 생략 하도록 한다. 도 4는 실시예에 따른 작물의 최적 생육 환경 생성 시스템의 신호 흐름도이다. 도 4를 참조하면, S10 단계에서는 작물 성장 정보 수집 센서에서 작물 촬영 이미지를 포함하는 작물 성장 정보 를 수집한다. S20 단계에서는 환경 정보 수집 센서에서 온도, 습도, 일조량을 포함하는 환경정보를 수집한다. S30 단계에서는 서버에서 성장 정보 및 환경정보를 수집하고, S40 단계에서는 작물 별 최적 환경 조건을 추출하고, 추출된 최적 환경 조건과 환경정보를 비교하여, 비교 결과에 따라 환경 조절 장치를 조정한다. S50 단계에서는 환경 조절 장치에서 작물 주변에 설치되어, 온도, 습도, 토양상태, 일조량을 포함하는 생육환경을 변화시킨다. 도 5는 실시예에 따른 서버의 데이터 처리 과정을 나타낸 도면이다. 도 5를 참조하면, S100 단계에서는 수집부에서 작물 성장 정보, 환경정보 및 딥러닝 모델의 학습 데이터를 수집 한다. S200 단계에서는 추출부에서 작물 별 최적 환경 조건 정보를 추출한다. S300 단계에서는 비교부에서 추출 된 작물 별 최적 환경 조건 정보와 환경정보를 비교하여, 상기 환경 정보를 최적 환경 정보로 변화시키기 위한 프로세스를 검출한다. S400 단계에서는 제어부에서 검출된 프로세스에 따라 환경제어장치를 제어한다. 이상에서와 같은 작물의 최적 생육 환경 생성 시스템 및 방법은 작물 별 최적 생장 환경 조건을 제공하여, 작물 의 성장을 도움으로써, 농가의 수확 품질을 향상시킬 수 있다. 또한, 실시예를 통해 여러 기후변화에 대응할 수 있도록 함으로써, 농가의 생산성과 작물 품질을 일정 수준이상 으로 유지할 수 있도록 한다. 또한, 실시예를 통해, 작물 성장을 모니터링하고 조치가 필요한 이벤트가 검출된 경우, 이를 관리자에게 알려 신속하게 조치할 수 있도록 함으로써, 작물의 전염병, 훼손으로 인한 추가 피해가 발생하지 않도록 한다."}
{"patent_id": "10-2023-0098048", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "개시된 내용은 예시에 불과하며, 특허청구범위에서 청구하는 청구의 요지를 벗어나지 않고 당해 기술분야에서 통상의 지식을 가진 자에 의하여 다양하게 변경 실시될 수 있으므로, 개시된 내용의 보호범위는 상술한 특정의 실시예에 한정되지 않는다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2023-0098048", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 작물의 최적 생육 환경 생성 시스템 구성을 나타낸 도면 도 2는 실시예에 따른 서버의 데이터 처리 구성을 나타낸 도면 도 3은 환경 조절 장치 제어 실시예를 나타낸 도면 도 4는 실시예에 따른 작물의 최적 생육 환경 생성 시스템의 신호 흐름도 도 5는 실시예에 따른 서버의 데이터 처리 과정을 나타낸 도면"}
