{"patent_id": "10-2022-0152030", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0077655", "출원번호": "10-2022-0152030", "발명의 명칭": "미세기포를 포함하는 저유전성 유리섬유 및 이의 제조방법", "출원인": "광주과학기술원", "발명자": "김복현"}}
{"patent_id": "10-2022-0152030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "유리 성분을 기반으로 섬유소재; 및상기 섬유소재 상에 분포되는 복수 개의 미세기포를 포함하는,저유전성 유리섬유."}
{"patent_id": "10-2022-0152030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수 개의 미세기포의 총 체적은 1 내지 40 vol%인 것인,저유전 특성을 갖는 유리섬유."}
{"patent_id": "10-2022-0152030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 복수 개의 미세기포의 총 체적은 5 내지 30 vol%인 것인,저유전 특성을 갖는 유리섬유."}
{"patent_id": "10-2022-0152030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 미세기포의 크기는 상기 섬유소재 외경의 0.001 배 내지 0.2 배 범위인 것인,저유전 특성을 갖는 유리섬유."}
{"patent_id": "10-2022-0152030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "유리원료 혼합물을 제조하는 단계;상기 유리원료 혼합물을 용융(melting)하여 유리용융물을 제조하는 단계; 및상기 유리용융물을 방사(spinning)하여 유리 섬유를 제조하는 단계를 포함하며,상기 용융 및 상기 방사 중 적어도 하나는 초음파 처리를 수행하는 것인,저유전 특성을 갖는 유리섬유의 제조방법."}
{"patent_id": "10-2022-0152030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 유리원료 혼합물은 유리 전구체를 더 포함하는 것인,공개특허 10-2023-0077655-3-저유전 특성을 갖는 유리섬유의 제조방법."}
{"patent_id": "10-2022-0152030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 유리 전구체는 탄산염(carbonate), 수화물(hydrate), 질산염(nitrate), 황산염(surfate) 및 붕산(H3BO3)으로 이루어진 군에서 선택되는 1 이상인 것인,저유전 특성을 갖는 유리섬유의 제조방법."}
{"patent_id": "10-2022-0152030", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 초음파 처리는 초음파 주파수 대역; 초음파 세기; 초음파 빈도; 및 초음파 시간 중 어느 하나 이상을 제어하는 것인,저유전 특성을 갖는 유리섬유의 제조방법."}
{"patent_id": "10-2022-0152030", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 미세기포를 포함하는 저유전성 유리섬유 및 이의 제조방법으로, 미세기포를 유리섬유 상에 형성하여, 저유전성을 갖는 유리섬유 및 이의 제조방법에 관한 것이다."}
{"patent_id": "10-2022-0152030", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 미세기포를 포함하는 저유전성 유리섬유 및 이의 제조방법으로, 미세기포를 유리섬유 상에 형성하여, 저유전성을 갖는 유리섬유 및 이의 제조방법에 관한 것이다."}
{"patent_id": "10-2022-0152030", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "클라우드 컴퓨팅, 5G 통신, OTT 서비스, 인공지능 관련 시장의 성장에 따라 모바일 기기 및 기지국, 최신 데이 터 센터 구축에 필요한 서버용 초고다층 PCB의 수요가 급속도로 증가하고 있다, 초고속 통신용 고다층 전자회로 기판(PCB: Printed Circuit Board)은 이러한 미래 IT 기기에 필요한 핵심부품이다. 인쇄회로기판(Printed Circuit Board, PCB) 개발에 사용되는 CCL(Copper Clad Laminate, 동박적층판)은 크게 무기소재인 유리섬유, 유기소재인 수지(필러), 그리고 동박으로 구성되고, 유리섬유는 CCL을 구성하는 프리프레 그(Prepreg, 절연층)의 기본 골격을 이루어 전기적 절연 특성과 함께 절연층의 기계적 및 열적 변형을 최소화하 는 기능을 담당하는 핵심 소재이다. 특히, 5G 이상의 통신에서 고속·대용량화에 따라서 통신장비, 기지국 레이더, 안테나, 서버보드 등에 들어가는 기판소재(CCL)의 경우 1GHz 이상의 고주파 신호 대역에서 낮은 유전 손실 특성을 갖는 소재 확보가 중요하고, 이를 위해서는 CCL을 구성하고 있는 낮은 유전상수(dielectric constant, εr)와 유전손실(dielectric dissipation factor, tanδ) 특성을 갖는 유리섬유 소재 기술의 확보가 필수적이다. 저속의 PCB에 사용되는 기존의 E-glass의 경우 일예로 SiO2 54.3 wt%, B2O3 6 wt%, Al2O3 14 wt%, MgO+CaO 22.7 wt%, Li2O+Na2O+K2O 1.0 wt%, FeO2 0.3 wt%를 함유하고 있다. 이러한 E-glass의 경우 1 MHz에서 6.6~6.9 범위의 특성을 가지고 있어 1GHz 이상의 고주파 대역에서는 높은 에너지 손실로 인하여 사용이 어렵다. 이러한 문제를 해결하기 위하여 산화물계 유리를 구성하는 물질의 조성을 조절하는 방법을 이용할 수가 있다. 일례로 실리카(SiO2) 및 붕소(B2O3)가 다량 함유된 유리조성이 개발되었으며, 이러한 유리를 저유전 유리(low dielectric glass)라고 한다. 저유전 유리의 경우 일례로 SiO2 60~68 wt%, B2O3 7~12 wt%, Al2O3 9~14 wt%, CaO+MgO 8~18 wt%, Li2O+Na2O+K2O 0~4 wt%의 조성범위를 가지고 있다. 이러한 조성의 경우 융점이 높아져서 방사 가 어렵고 물에 대한 내성이 약해지며 기계적 강도가 약해지는 등 여러 가지 문제가 발생할 수 있어서 부가적인첨가물을 사용하거나 조성을 최적화해야 하는 어려움이 따른다. 도 1은 종래기술에 따라 유리섬유 내에 축방향으로 연결된 미세홀이 형성된 유리섬유 형태를 보여주고 있다. PCB 기판의 경우 유리섬유를 일부층에 함유시켜 이를 식각하고 홀구조를 만드는 가공을 하게 된다. 이러한 과정 에서 유리섬유의 일부는 절단 또는 가공되어 외부로 노출되므로 종래기술에 따른 미세홀 구조를 가진 유리섬유 의 경우, 미세홀이 외부로 노출되어 미세홀 내부로 수분 및 오염물질의 유입이 발생할 수 있어 PCB기판이 일정 하고 안정적인 유전특성 및 전기적 특성을 갖는데 문제를 만들 수 있다. 본 발명은 이러한 종래 기술의 문제점을 해결하고 저유전 특성을 갖는 유리 및 이를 이용한 유리섬유 기술을 제 공하는 것에 목적이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 미국 등록특허 8,697,590 B2(“LOW DIELECTRIC GLASS AND FIBER GLASS FOR ELECTRONIC APPLICATIONS”)"}
{"patent_id": "10-2022-0152030", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 종래 기술이 가지는 여러 가지 문제를 해결하기 위한 것으로, 유리 내지 유리섬유 내의 미세기포를 형성하여 유전특성이 우수한 유리섬유을 제공하는 것이다."}
{"patent_id": "10-2022-0152030", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적들을 달성하기 위하여, 본 발명의 일 실시예에 따른 저유전성 유리섬유는 유리 성분을 기반으로 섬 유소재; 및 상기 섬유소재 상에 분포되는 복수 개의 미세기포을 포함한다. 상기 복수 개의 미세기포의 총 체적은 1 내지 40 vol%일 수 있다. 상기 복수 개의 미세기포의 총 체적은 5 내지 30 vol%일 수 있다. 상기 미세기포의 크기는 상기 섬유소재 외경의 0.001배 내지 0.2배 범위일 수 있다. 발명의 일 실시예에 따른 저유전성 유리섬유의 제조방법은 유리원료 혼합물을 제조하는 단계; 상기 유리원료 혼합물을 용융(melting)하여 유리용융물을 제조하는 단계; 및 상기 유리용융물을 방사(spinning)하여 유리 섬유 를 제조하는 단계를 포함하며, 상기 용융 및 상기 방사 중 적어도 하나는 초음파 처리를 수행하는 것일 수 있다. 상기 유리원료 혼합물은 유리 전구체를 더 포함하는 것일 수 있다. 상기 유리 전구체는 탄산염(carbonate), 수화물(hydrate), 질산염(nitrate), 황산염(surfate) 및 붕산(H3BO3)으 로 이루어진 군에서 선택되는 1 또는 2 이상인 것일 수 있다. 상기 초음파 처리는 초음파 주파수 대역; 초음파 세기; 초음파 빈도; 및 초음파 시간 중 어느 하나 이상을 제어 하는 것일 수 있다."}
{"patent_id": "10-2022-0152030", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 유리 내의 미세기포를 이용하여 유전특성이 우수한 산화물계 유리 및 이를 이용한 유리섬유를 얻을 수 있다. 본 발명에 따른 산화물계 유리는 미세기포가 분산되어 있어 유전율 및 유전손실이 낮은 특성을 가지고 있다. 본 발명에 따른 산화물계 유리는 미세기포의 크기 및 분산을 조절하여 산화물계 유리의 유전특성을 조절할 수 있다. 본 발명에 따르면 미세기포 발생물질을 이용하여 미세기포의 분포를 제어할 수 있다. 본 발명에 따르면 미세기포 발생장치를 이용하여 미세기포의 분포를 제어할 수 있다. 또한, 본 발명에 따른 미세 기포가 일정하게 분산된 산화물계 유리 및 이를 이용한 유리섬유는 초고속 통신에 사용되는 고성능 PCB 제작에 사용할 수 있다."}
{"patent_id": "10-2022-0152030", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고, 여러 가지 실시예들을 가질 수 있는 바, 특정 실시예들을 도면에 예시 하고 이를 상세히 설명하고자 한다. 청구범위에 개시된 발명의 다양한 특징들은 도면 및 상세한 설명을 고려하여 더 잘 이해될 수 있을 것이다. 명 세서에 개시된 장치, 방법, 제법 및 다양한 실시예들은 예시를 위해서 제공되는 것이다. 개시된 구조 및 기능상 의 특징들은 통상의 기술자로 하여금 다양한 실시예들을 구체적으로 실시할 수 있도록 하기 위한 것이고, 발명 의 범위를 제한하기 위한 것이 아니다. 개시된 용어 및 문장들은 개시된 발명의 다양한 특징들을 이해하기 쉽게 설명하기 위한 것이고, 발명의 범위를 제한하기 위한 것이 아니다. 본 발명의 목적은 낮은 유전율 및 낮은 유전손실 그리고 유리 방사에 적합한 열특성 및 기계적 특성을 갖는 산 화물계 유리 및 이를 이용한 유리섬유 기술을 제공하는 것이다. 도 2는 본 발명의 일 실시예에 따른 저유전성 유리 섬유의 모식도를 도시한 것이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 유리섬유는 유리 성분을 기반으로 섬유소재; 및 섬유 소재 상에 분포되는 복수 개의 미세기포을 포함한다. 유리섬유는 섬유소재 상에 복수 개의 미세기포을 균일하게 분포시켜 산화물계 유리의 유전 특성 을 제어할 수 있다. 유리섬유의 유전율은 1에 근사하며, 유전손실도 1×10-7 이하이다. 따라서, 섬유소재 상에 미세기포 을 고르게 분포시킴으로써 유리의 기본 조성을 변경하지 않고 유리섬유의 유전율을 조절할 수 있다. 유리섬유는 복수 개의 미세기포가 작은 크기의 독립된 형태로 섬유소재 내에 균일하게 분포하므 로 PCB 가공공정에 의하여 미세기포가 외부로 누출되는 문제가 발생되지 않는다. 반면에, 도 1에서 처럼 유리섬유 내에 축방향으로 연결된 미세홀이 형성된 유리섬유의 경우, 미세홀이 외부로 노출되어 미세홀 내부로 수분 및 오염물질의 유입이 발생할 수 있어 PCB기판이 일정하고 안정적인 유전특성 및 전기적 특성을 갖는데 문 제를 만들 수 있다. 섬유소재는 길이 방향으로 연장된 섬유 형태의 소재로서, 섬유소재는 유리 성분을 주요 구성물질로 포함하는 것일 수 있다. 상기 유리 성분은 유리의 기지(matrix) 조성을 구성하는 물질일 수 있다. 상기 유리 성분은 실리카(SiO2)를 포함하는 것일 수 있으며, 바람직하게 상기 유리 성분은 실리카(SiO2), 삼산화 붕소(B2O3) 및 알루미나(Al2O3) 등의 산화물을 포함하는 것일 수 있다. 이때, 상기 삼산화붕소(B2O3)는 삼산화붕 소수화물(B2O3·xH2O) 또는 붕산(H2BO3)으로부터 제공된 것일 수 있다. 또한, 상기 유리 성분은 실리카(SiO2), 삼산화붕소(B2O3) 및 알루미나(Al2O3)를 포함하며, 상기 유리 성분은 알칼 리토 산화물; 알칼리 산화물; 전이금속 산화물; 및 희토류 산화물 중 어느 하나 이상을 더 포함하는 것일 수 있 다. 상기 알칼리토 산화물은 산화마그네슘(MgO), 산화칼슘(CaO), 산화바륨(BaO) 및 산화스트로튬(SrO) 중 어느 하나 이상일 수 있으며, 상기 알칼리 산화물은 산화리튬(Li2O), 산화소듐(Na2O) 및 산화칼륨(K2O) 중 어느 하나 이상 일 수 있으며, 상기 전이금속 산화물은 이산화티타늄(TiO2), 산화철(Ⅲ)(Fe2O3), 산화철(Ⅱ)(FeO), 산화아연 (ZnO), 지르코니아(ZrO2) 중 어느 하나 이상일 수 있으며, 상기 희토류 산화물은 산화란탄륨(La2O3)일 수 있다. 유리섬유에서 차지하는 섬유소재의 총 체적은 60 내지 99 vol%일 수 있으며, 바람직하게, 70 내지 95 vol%일 수 있다. 유리섬유에서 차지하는 복수 개의 미세기포의 총 체적은 1 내지 40 vol%일 수 있으며, 바람직하게는 5 내지 30 vol%일 수 있다. 보다 구체적으로, 복수 개의 미세기포의 총 체적이 40 vol%를 초과하는 경우 미세기포 균일한 분포 제어가 어렵고 유리섬유의 강도를 저하시킬 수 있다. 또한, 보다 바람직하게는 충분한 저유전 특성 및 유리 섬유의 제조 안정 확보를 위하여 상기 섬유소재 내에 분포된 복수 개의 미세기포 의 총 체적은 5 내지 30 vol%일 수 있다. 미세기포의 크기(내경)는 섬유소재 외경의 0.001 배 내지 0.2배 범위인 것일 수 있다. 보다 바람직하 게 미세기포의 크기는 섬유소재 외경의 0.001 배 내지 0.1배 범위일 수 있다. 일례로 섬유소재 의 외경이 수십 μm인 경우, 미세기포의 크기는 수 nm 내지 수 μm 크기를 갖는 것일 수 있으며, 일례로 섬유소재의 외경이 10 μm 인 경우 미세기포의 크기는 10 nm 내지 2μm 일 수 있다. 미세기포는 O2, N2, CO, CO2, NO, NO2, SO2 및 SO3으로 이루어진 군에서 선택되는 1 이상의 기체일 수 있다. 도 3은 본 발명의 일 실시예에 따른 저유전 특성을 갖는 유리섬유의 제조를 위한 유리섬유 제조장치의 모식도를 도시한 것이다. 도 3의 유리섬유 제조장치는 전기로 내에 설치된 용융용기를 포함하는 용융부(melting module); 방사 (spinning)을 위한 부싱부(bushing module); 및 초음파 발생장치로 구성될 수 있다.부싱부는 최종적으로 유리섬유화 과정이 진행되는 부싱노즐; 및 용융부에서 공급된 유리용융물 을 부싱노즐로 전달하는 이송부로 구성될 수 있다. 초음파 발생장치는 이송부측에 구비되는 것일 수 있으며, 초음파 발생장치를 통하여 유리섬유 의 미세기포 분포를 제어하는 것일 수 있다. 초음파 발생장치를 통하여 발생된 초음파는 용융부, 이송부 및 부싱노즐에 전달하므로써 유리섬유의 미세기포의 분포를 제어할 수 있다. 초음파 발생장치는 초음파 주파수 대역, 세기, 빈도 또는 시간을 제어할 수 있는 것일 수 있으며, 상기 초음파 주파수 대역, 세기, 빈도 또는 시간은 미세기포 발생물질 및 유리의 기지조성에 따라 제어되는 것일 수 있다. 초음파 발생장치는 초음파를 초음파 전달부를 이용하여 유리용융물에 전달할 수 있다. 초음파 전달부는 금속재질의 길이부재일 수 있으며, 초음파 전달부 일단은 초음파 발생장치와 연결되는 것이며, 초음파 전달부 타단은 이송부와 연결되는 것일 수 있다. 초음파 전달부는 초음파 용융부와 초음파 발생장치를 서로 이격시키는 것일 수 있다. 이를 통하 여 용용부의 고온에 의하여 초음파 발생장치가 파손되는 것을 막을 수 있다. 도 4는 본 발명의 일 실시예에 따른 저유전 특성을 갖는 유리섬유의 제조방법 순서도를 도시한 것이다. 본 발명의 일 실시예에 따른 저유전 특성을 갖는 유리섬유의 제조방법의 제조방법은 유리섬유 제조장치를 이용하는 것일 수 있다. 본 발명의 일 실시예에 따른 저유전 특성을 갖는 유리섬유의 제조방법의 제조방법은 유리원료 혼합물을 제조하 는 단계(S100); 상기 유리원료 혼합물을 용융(melting)하여 유리용융물을 제조하는 단계(S200); 및 상기 유리용 융물을 방사(spinning)하여 유리 섬유를 제조하는 단계(S300)를 포함하며, 상기 용융 및 상기 방사 중 적어도 하나는 초음파 처리를 수행하는 것일 수 있다. 유리원료 혼합물을 제조하는 단계(S100)는 준비된 유리 성분 및/또는 유리 전구체를 포함하는 유리원료 혼합물 을 제조하는 것일 수 있다. 보다 구체적으로, 상기 유리원료 혼합물은 용융부의 용융용기 내에 유리 성분 을 투입하여 제조하거나, 용융부의 용융용기 내에 유리 성분 및 유리 전구체를 함께 투입 후 혼합하여 제 조되는 것일 수 있다. 상기 유리원료 혼합물은 유리 성분을 포함하며, 바람직하게는 상기 유리 성분 및 유리 전구체를 포함하는 것일 수 있다. 상기 유리 성분은 유리의 기지(matrix) 조성을 구성하는 물질일 수 있으며, 상기 유리 전구체는 고온 내지 화학 적 반응에 의하여 상기 유리 성분을 제공하는 물질일 수 있다. 상기 유리 성분은 실리카(SiO2)를 포함하는 것일 수 있으며, 바람직하게 상기 유리 성분은 실리카(SiO2) 및 알루 미나(Al2O3)를 포함하는 것일 수 있으며, 보다 더 바람직하게 상기 유리 성분은 실리카(SiO2), 삼산화붕소(B2O3) 및 알루미나(Al2O3)를 포함하는 것일 수 있다. 이때, 상기 삼산화붕소(B2O3)는 삼산화붕소수화물(B2O3·xH2O) 또 는 붕산(H2BO3)으로부터 제공된 것일 수 있다. 또한, 상기 유리 성분은 실리카(SiO2), 삼산화붕소(B2O3) 및 알루미나(Al2O3)를 포함하며, 상기 유리 성분은 알칼 리토 산화물; 알칼리 산화물; 전이금속 산화물; 및 희토류 산화물 중 어느 하나 이상을 더 포함하는 것일 수 있 다. 알칼리토 산화물; 알칼리 산화물; 전이금속 산화물; 및 희토류 산화물은 용융 또는 방사 공정의 고온에서 기체를 발생시켜 미세기포를 형성하는 것일 수 있다. 상기 알칼리토 산화물은 산화마그네슘(MgO), 산화칼슘(CaO), 산화바륨(BaO) 및 산화스트로튬(SrO) 중 어느 하나 이상일 수 있으며, 상기 알칼리 산화물은 산화리튬(Li2O), 산화소듐(Na2O) 및 산화칼륨(K2O) 중 어느 하나 이상 일 수 있으며, 상기 전이금속 산화물은 이산화티타늄(TiO2), 산화철(Ⅲ)(Fe2O3), 산화철(Ⅱ)(FeO), 산화아연 (ZnO), 지르코니아(ZrO2) 중 어느 하나 이상일 수 있으며, 상기 희토류 산화물은 산화란탄륨(La2O3)일 수 있다. 상기 유리 전구체는 고온 내지 화학적 반응에 의하여 상기 유리 성분을 제공함과 동시에 미세기포를 형성하는 것으로, 상기 유리 전구체는 고온 내지 화학적 반응에 의하여 O2, N2, CO, CO2, NO, NO2, SO2 및 SO3으로 이루어 진 군에서 선택되는 1 이상의 기체를 형성시키는 것일 수 있다. 구체적으로, 상기 유리 전구체는 탄산염(carbonate), 수화물(hydrate), 질산염(nitrate), 황산염(surfate) 및 붕산(H3BO3)으로 이루어진 군에서 선택되는 1 또는 2 이상일 수 있다. 상기 탄산염은 용융 또는 방사 공정의 고온에서 이산화탄소(CO2) 기체를 발생시켜 미세기포를 형성하는 것일 수 있으며, 상기 탄산염은 Na2CO3, Li2CO3, K2CO3, MgCO3, CaCO3 및 SrCO3으로 이루어진 군에서 선택되는 1 또는 2 이 상일 수 있으며, 이에 제한되는 것은 아니다. 상기 수화물은 용융 또는 방사 공정의 고온에서 수증기(H2O) 또는 산소(O2) 기체를 발생시켜 미세기포를 형성하 는 것일 수 있다. 상기 수화물은 B2O3·xH2O, MgCl2·xH2O 및 Mg(OH)2으로 이루어진 군에서 선택되는 1 또는 2 이 상일 수 있다. 상기 질산염은 용융 또는 방사 공정의 고온에서 이산화질소(NO2) 또는 삼산화질소(NO3) 기체를 발생시켜 미세기 포를 형성하는 것일 수 있다. 상기 질산염은 NaNO3일 수 있다. 상기 황산염은 용융 또는 방사 공정의 고온에서 이산화황(SO2) 또는 삼산화황(SO3) 기체를 발생시켜 미세기포를 형성하는 것일 수 있다. 상기 황산염은 Na2SO4일 수 있다. 상기 붕산(H3BO3)은 용융 또는 방사 공정의 고온에서 수증기(H2O) 또는 산소(O2) 기체를 발생시켜 미세기포를 형 성하고 삼산화붕소(B2O3)를 제공하는 것일 수 있다. 상기 유리원료 혼합물은 발포제를 더 포함하는 것일 수 있으며, 보다 구체적으로 상기 유리원료 혼합물은 유리 성분; 및 발포제를 포함하며, 바람직하게는 상기 유리원료 혼합물은 유리 성분; 유리 전구체; 및 발포제를 포함 하는 것일 수 있다. 상기 유리원료 혼합물은 용융부의 용융용기 내에 유리 성분 및/또는 유리 전구체와 함께 발포제를 투입후 혼합하여 제조되는 것일 수 있다. 상기 발포제는 고온 내지 화학적 반응에 의하여 미세기포를 형성하는 것으로, 고온 내지 화학적 반응에 의하여 O2, N2, CO, CO2, NO, NO2, SO2 및 SO3으로 이루어진 군에서 선택되는 1 이상의 기체를 형성시키는 것일 수 있다. 상기 발포제는 Sb2O3, Sb2O5, As2O3, As2O5, (NH4)2NO3, SnO2, CeO2, Ce2O3으로 이루어진 군에서 선택되는 1 또는 2 이상일 수 있다. 상기 유리원료 혼합물 100 wt%에 대하여, 상기 발포제의 함량은 0.01 내지 4 wt%일 수 있으며, 바람직하게는 0.1 내지 3 wt%일 수 있다. 보다 구체적으로, 상기 발포제의 함량이 4 wt%를 초과하는 경우, 미세기포가 과도하 게 발생되며, 상기 발포제의 함량이 0.01 wt% 미만인 경우 미세기포 발생량이 현저히 부족한 문제점이 있다. 또 한, 보다 바람직하게는, 미세기포의 발생을 적절하게 제어하기 위해서 상기 발포제의 함량은 0.1 내지 3 wt%일 수 있다.유리용융물을 제조하는 단계(S200)는 상기 유리혼합물을 소정의 온도 및 시간에서 용융시키는 용융공정일 수 있 으며, 용융공정을 통해 상기 유리용융물을 제조하는 것일 수 있다. 유리용융물을 제조하는 단계(S200)는 상기 용융공정을 통하여 유리섬유 내 분포하는 미세기포의 분포(미세기포 의 크기 및 갯수)를 제어할 수 있다. 유리용융물을 제조하는 단계(S200)에서 상기 용융은 초음파 처리를 포함하는 것일 수 있으며, 보다 구체적으로 상기 용융공정을 수행함에 있어 동시에 초음파 처리를 통하여 유리용융물을 제조하는 것일 수 있으며, 초음파 처리를 통하여 미세기포의 분포(미세기포의 크기 및 갯수)를 제어할 수 있다. 상기 초음파 처리는 초음파 주파 수 대역; 초음파 세기; 초음파 빈도; 및 초음파 시간 중 어느 하나 이상을 제어하는 것일 수 있다. 유리용융물을 제조하는 단계(S200)는 유리원료 혼합물을 유리섬유 제조장치의 용융부의 용융용기 내에 유리 성분을 투입하여 용융공정을 통하여 제조하거나, 용융부의 용융용기 내에 유리 성분 및 유리 전구체 를 함께 혼합하여 투입 후 용융공정을 통하여 제조되는 것일 수 있다. 용융부의 용융용기는 고온에 견디도 록 백금(Pt) 또는 백금(Pt)-로듐(Rh) 합금 용기를 사용하는 것이 바람직하다. 상기 용융공정을 수행함에 있어 동시에 초음파 처리를 통하여 유리용융물을 제조하는 것일 수 있다. 또한, 유리용융물을 제조하는 단계(S200)는 상기 유리원료 혼합물을 별도의 도가니에서 전기로와 같은 가열장치 내에 넣은 후 가열과정을 통하여 1차 용융공정으로 모유리를 제조하고 제조된 모유리를 유리섬유 제조장치 의 용융부의 용융용기에 투입하여 2차 용융공정을 통하여 제조하는 것일 수 있다. 상기 1차 용융공정 및 상기 2차 용융공정을 수행함에 있어 초음파 처리를 통하여 유리용융물을 제조하는 것일 수 있다. 유리섬유를 제조하는 단계(S300)는 상기 유리용융물을 소정의 온도 및 시간에서 방사(spinning)시키는 방사공정 일 수 있으며, 방사공정을 통해 유리섬유를 제조하는 것일 수 있다. 유리섬유를 제조하는 단계(S300)는 상기 방사공정을 통하여 유리섬유 내 분포하는 미세기포의 분포(미세기포의 크기 및 갯수)를 제어할 수 있다. 유리섬유를 제조하는 단계(S300)에서 상기 방사는 초음파 처리를 수행하는 것일 수 있으며, 보다 구체적으로 상 기 방사공정을 수행함에 있어 동시에 초음파 처리를 통하여 유리섬유를 제조하는 것일 수 있으며, 초음파 처리 를 통하여 미세기포의 분포(미세기포의 크기 및 갯수)를 제어할 수 있다. 상기 초음파 처리는 초음파 주파수 대 역; 초음파 세기; 초음파 빈도; 및 초음파 시간 중 어느 하나 이상을 제어하는 것일 수 있다. 유리용융물을 제조하는 단계(S200) 또는 유리섬유를 제조하는 단계(S300)에서, 상기 초음파 처리는 유리섬유 제 조장치 중 이송부 측에 인가되는 것일 수 있다. 이송부 측에 인가됨으로써, 용융부, 이송부 및 부싱노즐에 동시 또는 선택적으로 초음파 인가가 가능할 수 있으며, 이는 상기 유리용융물 또는 상기 유리섬유에 대하여 동시 또는 선택적으로 초음파 인가가 가능할 수 있다. 유리용융물을 제조하는 단계(S200) 또는 유리섬유를 제조하는 단계(S300)에서, 상기 초음파 주파수는 상기 유리 원료 혼합물의 조성, 미세기포의 성분 및 부싱모듈에 따라 결정되는 것일 수 있다. 상기 초음파 주파수는 10 kHz 내지 50 MHz일 수 있다. 미세기포 발생량, 크기, 및 분포 제어를 위하여 유리 초음파 적용 빈도 및 초음파 적용시간을 적절히 제어한다. 유리용융물을 제조하는 단계(S200) 또는 유리섬유를 제조하는 단계(S300)에서, 상기 초음파 시간은 초음파를 인 가하는 시간일 수 있으며, 상기 초음파를 인가하는 시간이 길어질수록 미세기포 발생량 및 크기가 증가할 수 있 다. 유리용융물을 제조하는 단계(S200) 또는 유리섬유를 제조하는 단계(S300)에서, 상기 초음파 시간은 5 내지 120 분(min)일 수 있다.유리섬유 방사 시 상기 유리용융물에 초음파 처리를 수행하면 유리섬유는 초음파 에너지에 의해 미세기포의 크 기 및 개수가 증가하게 된다. 도 4에서의 본 발명의 일 실시예에 따른 저유전 특성을 갖는 유리섬유의 제조방법을 도 3의 유리섬유 제조장치 에 따라 설명하면 다음과 같다. 유리원료 혼합물을 제조하는 단계(S100)에서, 유리섬유를 구성하는 유리 성분을 준비하여 용융용기에 투입하여 유리원료 혼합물을 제조하는 것일 수 있으며, 바람직하게는 유리 성분 및 유리 전구체를 준비하여 용융용기에 투입하여 유리원료 혼합물을 제조하는 것일 수 있으며, 보다더 바람직하게는 유리 성분, 유리 전구체 및 발포제 를 준비하여 용융용기에 투입하여 유리원료 혼합물을 제조하는 것일 수 있다. 이후, 유리용융물을 제조하는 단계(S200)에서, 소정의 온도 및 시간으로 유리원료 혼합물을 용융시켜 유리용융 물을 제조한다. 이후, 유리섬유를 제조하는 단계(S300)에서, 초음파 발생장치와 초음파 전달부를 통하여 상기 유리용융물을 초 음파 처리할 수 있으며, 상기 유리용융물이 부싱노즐로 이동하는 이송부에서 초음파 처리에 따른 미세기포가 발 생하여, 부싱노즐을 통하여 제조된 유리섬유 상에 미세기포를 형성한다. 이하 실시예 및 실험예를 통하여 보다 상세히 설명한다. 비교예 1. 원료물질로서, SiO2 40 wt%, H3BO3 16 wt%, Al2O3 11 wt%, CaCO3 29 wt%, MgCO3 2 wt%, Na2CO3 1.5 wt%, K2CO3 0.5 wt%를 준비한다. 준비된 원료물질의 혼합 및 분쇄를 위하여 회전속도 150 rpm 로 4시간 동안 볼밀공정 수행 하여 혼합물을 제조하였다. 혼합물을 전기로(Super kanthal)에서 용융온도로 1600 ℃에서 2 시간(hr) 동안 가열 하여 유리 용융물을 제조하였다. 제조된 유리용융물을 백금 용융 용기에 투입하여 1330 내지 1350 ℃에서 가열 하면서 부싱(Bushing) 모듈을 통하여 유리섬유 방사를 진행하여 방사온도 1350 ℃, 방사속도 800 rpm에서 미세 기포를 포함하지 않는 유리섬유를 제조하였다. 실시예 1-1. 원료물질로서, SiO2 40 wt%, H3BO3 16 wt%, Al2O3 11 wt%, CaCO3 29 wt%, MgCO3 2 wt%, Na2CO3 1.5 wt%, K2CO3 0.5 wt%를 준비한다. 준비된 원료물질의 혼합 및 분쇄를 위하여 회전속도 150 rpm 로 4시간 동안 볼밀공정 수행 하여 혼합물을 제조하였다. 혼합물을 전기로(Super kanthal)에서 용융온도로 1600 ℃에서 2 시간(hr) 동안 가열 하여 유리 용융물을 제조하였다. 제조된 유리용융물을 백금 용융 용기에 투입하여 1330 내지 1350 ℃에서 가열 하면서 부싱(Bushing) 모듈을 통하여 유리섬유의 방사를 진행하며, 동시에 부싱 모듈에 초음파 전달부를 이용하 여 초음파 발생장치와 연결시켜 부싱모듈(이송부)에 초음파를 전달하였으며, 방사되는 유리섬유에 0.1~2.4 MHz 범위의 초음파 처리하여 미세기포 발생을 유도하면서, 방사온도 1350 ℃ 및 방사속도 800 rpm에서 유리섬유 를 제조하였다. 실시예 1-2. 실시예 1-1과 동일하게 수행하되, 원료물질로서, SiO2 54.8 wt%, B2O3 15.9 wt%, Al2O3 20.9 wt%, MgCO3 3.0 wt%, CaCO3 5.0 wt% 및 Sb2O3 0.4 wt%를 준비하였으며, 유리용융물을 1390 내지 1400 ℃에서 가열하면서 부싱 (Bushing) 모듈을 통하여 방사온도 1330 oC 및 방사속도 400 rpm에서 유리섬유의 방사를 진행하였다. 측정예. 미세기포의 확인 상기 비교예 1에서 제조된 유리섬유와, 상기 실시예 1-1 및 1-2에서 제조된 미세섬유에 대하여, 현미경 이미지 를 촬영하여 미세기포의 분포 여부를 확인하였다. 도 5는 상기 비교예 1에서 제조된 유리섬유의 현미경 이미지로서, 도 5를 참조하면, 상기 비교예 1에서 제조된 유리섬유 내에는 미세기포가 관찰되지 않는 것을 확인할 수 있다. 한편, 도 6은 상기 실시예 1-1에서 제조된 유리섬유의 현미경 이미지로서, 도 6을 참조하면, 유리섬유 내 미세 기포가 분포되어 있는 것을 확인할 수 있다. 또한, 도 6에서 관찰되는 유리섬유의 외경은 180 ㎛이고, 유리섬유 내 분포되어 있는 미세기포의 크기(직경)은 유리섬유의 외경의 0.025(1/40) 내지 0.05(1/20) 배 수준의 크기를 갖는 것을 확인할 수 있다. 도 7은 상기 실시예 1-2에서 제조된 유리섬유의 현미경 이미지로서, 도 7을 참조하면, 유리섬유 내 미세기포가 분포되어 있는 것을 확인할 수 있다. 또한, 도 6에서 관찰되는 유리섬유의 외경은 700 ㎛이고, 상기 실시예 1-1 과 대비하여 추가적인 발포제(Sb2O3)를 포함하으로써 유리섬유 내 미세기포 형성되어 있음을 보다 명확히 관찰할 수 있다. 실험예 1. 초음파 처리에 따른 미세기포 형성 확인 실시예 1-1에서의 원료물질을 동일하게 준비하여, 유리용융물을 제조하는 과정에서 유리용융물에 대하여 실시예 1-1과 동일한 조건으로 초음파 처리하여 유리판을 제조하였으며, 부싱모듈을 통한 유리섬유를 제조하기 위한 유 리섬유 방사는 수행하지 않았다. 제조된 유리판에 대한 사진이미지를 도 8에 도시하였다. 도 8을 참조하면, 초음파 처리에 의하여 유리판 내에 수 μm에서 수백 μm 의 크기를 갖는 미세기포가 분포되는 것을 확인할 수 있다. 비교예 2. 비교예 1과 동일하게 실시하되, 원료물질로서 SiO2 40 wt%, H3BO3 14.5 wt%, Al2O3 13.0 wt%, CaCO3 28.0 wt%, MgCO3 1.5 wt%, Na2CO3 2.0 wt%, K2CO3 1.0 wt%를 사용하여 미세기포를 함유하지 않은 유리섬유를 제조한다. 제 조된 유리섬유의 10 GHz에서의 유전율은 6.80이고 유전손실은 0.007이다. 실시예 2. 비교예 2와 동일한 원료물질을 사용하여 실시예 1-1과 동일한 방식으로 실시하되, 유리섬유의 방사는 방사되는 유리섬유에 1.2~2.6 MHz 범위의 초음파를 수행하여, O2로 이루어진 미세기포를 전체 체적의 35 vol%로 분포시킨 유리섬유를 제조한다. 비교예 3. 비교예 1과 동일하게 실시하되, 원료물질로서 SiO2 40 wt%, B2O3 17 wt%, Al2O3 24 wt%, La2O3 19 wt%를 사용하여 미세기포를 함유하지 않은 유리섬유를 제조한다. 제조된 유리섬유의 10 GHz에서의 유전율이 5.80 이고 유전손실 이 0.0055이다. 실시예 3-1. 비교예 3과 동일한 원료물질을 사용하여 실시예 1-1과 동일한 방식으로 실시하되, 유리섬유의 방사는 방사되는 유리섬유에 1.6~2.6 MHz 범위의 초음파를 인가하고 방사속도 1200 rpm에서 수행하여 유리섬유를 제조하여, O2로 이루어진 미세기포를 전체 체적의 20 vol%로 분포시킨 유리섬유를 제조한다.실시예 3-2. 비교예 3과 동일한 원료물질을 사용하여 실시예 1-1과 동일한 방식으로 실시하되, 유리섬유의 방사는 방사되는 유리섬유에 1.6~2.6 MHz 범위의 초음파를 인가하고 방사온도 1370 ℃에서 수행하여, O2로 이루어진 미세기포를 전체 체적의 40 vol%로 분포시킨 유리섬유를 제조한다. 실시예 3-2에서는 실시예 3-1 대비 방사온도를 높이고 동시에 방사속도를 감소시켜 미세기포 발생수를 늘리도록 하였다. 비교예 4. 비교예 1과 동일하게 실시하되, 원료물질로서 SiO2 52.0 wt%, B2O3 10.0 wt%, Al2O3 20.0 wt%, CaCO3 8.0 wt%, MgCO3 9.8 wt%, Na2CO3 0.2 wt%를 사용하고, 전기로를 사용하여 1640 ℃에서 3 시간(hr) 동안 가열하여 유리 용 융물을 제조하며, 유리섬유의 방사는 방사온도 1370 ℃에서 수행하여 미세기포를 함유하지 않은 유리섬유를 제 조한다. 유리섬유의 10 GHz에서의 유전율은 5.20이고 유전손실은 0.004인 미세기포를 함유하지 않은 유리섬유를 준비한다. 실시예 4-1. 비교예 4와 동일한 원료물질을 사용하여 실시예 1-1과 동일한 방식으로 실시하되, 유리섬유의 방사는 방사되는 유리섬유에 1.8~3.2 MHz 범위의 초음파를 인가하고 방사온도 1370 ℃ 및 방사속도 1200 rpm에서 수행하여, O2로 이루어진 미세기포를 전체 체적의 10 vol%로 분포시킨 유리섬유를 제조한다. 실시예 4-1에서는 SiO2 및 B2O3 함량이 높아질수록 유리의 밀도가 낮아지므로 그에 따른 공진 주파수를 높이도록 하였으며, 또한 SiO2 및 B2O3 함량이 높아질수록 유리의 융점이 높아지므로 유리의 점성을 낮추어 기포 발생을 용이하도록 하기 위하여 유리 섬유 방사온도를 높이도록 하였다. 실시예 4-2. 비교예 4와 동일한 원료물질을 사용하여 실시예 1-1과 동일한 방식으로 실시하되, 유리섬유의 방사는 방사되는 유리섬유에 1.8~3.2 MHz 범위의 초음파를 인가하고 방사온도 1390 ℃에서 수행하여, O2로 이루어진 미세기포를 전체 체적의 20 vol%로 분포시킨 유리섬유를 제조한다. 실시예 4-2에서는 실시예 4-1 대비 방사온도를 높이고 동시에 방사속도를 감소시켜 미세기포 발생수를 늘리도록 하였다. 비교예 5. 비교예 1과 동일하게 실시하되, 원료물질로서 SiO2 55.7 wt%, B2O3 15.0 wt%, Al2O3 21.4 wt%, CaO 4.8 wt%, MgO 3.1 wt%를 사용하고, 전기로를 사용하여 1650 ℃에서 3 시간(hr) 동안 가열하여 유리 용융물을 제조하며, 유리 섬유의 방사는 방사온도 1380 ℃에서 수행하여 미세기포를 함유하지 않은 유리섬유를 제조한다. 제조된 유리섬 유의 10 GHz에서의 유전율은 4.8 이고 유전손실은 0.003인 미세기포를 함유하지 않은 유리섬유를 준비한다. 실시예 5-1. 비교예 5의 원료물질 100 중량부를 기준으로 미세기포 발생을 촉진하기 위하여 첨가제로서 발포제인 Na2SO4 0.2 중량부 및 SnO2 0.2 중량부를 더 첨가하여 원료물질을 준비하고, 실시예 1-1과 동일한 방식으로 실시하되, 유리 섬유의 방사는 방사되는 유리섬유에 2.0~3.6 MHz 범위의 초음파를 인가하고 방사온도 1380 ℃ 및 방사속도 1000rpm에서 수행하여, O2로 이루어진 미세기포를 전체 체적의 30 vol%로 분포시킨 유리섬유를 제조한다. 실시예 5-2. 실시예 5-1과 동일한 원료물질을 사용하여 실시예 1-1과 동일한 방식으로 실시하되, 유리섬유의 방사는 방사되 는 유리섬유에 2.0~3.6 MHz 범위의 초음파를 인가하여 방사온도 1395 ℃에서 수행하여, O2로 이루어진 미세기포 를 전체 체적의 40 vol%로 분포시킨 유리섬유를 제조한다. 실험예 2. 유전율 및 유전손실 분석 실시예 2 내지 실시예 5-2에 따른 유리섬유에 대하여 유전율(dielectric constant, εr) 및 유전손실 (dielectric dissipation factor, tanδ)을 측정하였으며, 임피던스 분석기를 이용한 평행판 측정방식 (Parallel plate capacitor method) 또는 벡터 네트워크 분석기를 이용한 공진기 측정방식(Resonance cavity method)을 사용하여 분석하였다. 실시예 2에 따른 유리섬유의 유전율은 10 GHz에서의 4.77이고 유전손실은 0.0046이다. 실시예 3-1에 따른 유리섬유의 유전율은 10 GHz에서의 4.84이고 유전손실은 0.0044이고, 실시예 3-2에 따른 유 리섬유의 유전율은 10 GHz에서의 3.88 이고 유전손실은 0.0033이다. 실시예 4-1에 따른 유리섬유의 유전율은 10 GHz에서의 4.78 이고 유전손실은 0.0036 이고, 실시예 4-2에 따른 유리섬유의 유전율은 10 GHz에서의 4.36 이고 유전손실은 0.0032 이다. 실시예 5-1에 따른 O2로 이루어진 미세기포를 유리 체적의 30% 정도 함유시킬 경우 유리의 유전율은 10 GHz에서 의 3.66 이고 유전손실은 0.0021 이고, 실시예 5-2에 따른 O2로 이루어진 미세기포를 유리 체적의 40% 정도 함 유시킬 경우 얻어지는 유전율은 10 GHz에서의 3.28 이고 유전손실은 0.0018이다. 실험예를 참조하면, 미세기포를 유리섬유 내에 분포시킴으로써, 가장 낮은 저유전 물질의 하나인 실리카(SiO2) 유리 수준의 낮은 유전특성을 확보할 수 있음을 확인할 수 있다. 본 명세서에 개시된 실시예들은 본 발명의 기술적 사상을 한정하기 위한 것이 아니라, 설명하기 위한 것이고, 이러한 실시예들에 의하여 본 발명의 범위가 한정되는 것은 아니다. 본 발명의 보호범위는 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 이해되어야 한다."}
{"patent_id": "10-2022-0152030", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래기술에 따라 유리섬유 내에 축방향으로 연결된 미세홀이 형성된 유리섬유 형태를 도시한 것이다. 도 2는 본 발명의 일 실시예에 따른 저유전성 유리 섬유의 모식도를 도시한 것이다. 도 2는 본 발명의 일 실시예에 따른 저유전성 유리 섬유의 모식도를 도시한 것이다. 도 3은 본 발명의 일 실시예에 따른 저유전 특성을 갖는 유리섬유의 제조를 위한 유리섬유 제조장치의 모식도를 도시한 것이다. 도 4는 본 발명의 일 실시예에 따른 저유전 특성을 갖는 유리섬유의 제조방법 순서도를 도시한 것이다. 도 5는 본 발명의 비교예에 따른 유리섬유의 현미경 이미지를 도시한 것이다. 도 6은 본 발명의 일 실시예에 따른 유리섬유의 현미경 이미지를 도시한 것이다. 도 7은 본 발명의 일 실시예에 따른 유리섬유의 현미경 이미지를 도시한 것이다. 도 8은 본 발명의 일 실시예에 따른 초음파 처리에 따른 유리판의 미세기포 형성을 확인한 현미경 이미지를 도 시한 것이다."}
