{"patent_id": "10-2016-0034322", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0110236", "출원번호": "10-2016-0034322", "발명의 명칭": "이동체 정보 저장 시스템 및 방법", "출원인": "동국대학교 경주캠퍼스 산학협력단", "발명자": "송유진"}}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이동이 가능한 이동체에 배치되고, 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성하는 엣지 디바이스(edge device);상기 이동체에 배치되고, 상기 엣지 디바이스로부터 상기 제1 암호화문 E(m)을 제공받으며, 제공받은 상기 제1암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하고, 생성된 상기 제2 암호화문F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성하는 이동체 제어장치;상기 이동체와 이격되어 배치되고, 상기 이동체 제어장치가 임의의 범위 내에 존재할 때, 무선 통신 방법으로상기 이동체 제어장치로부터 상기 제3 암호화문 F(m)를 제공받는 중간 연결장치; 및유선 또는 무선 네트워크를 통해 상기 중간 연결장치로부터 상기 제3 암호화문 F(m)를 제공받아 저장하는 서버를 포함하는 이동체 정보 저장 시스템."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "이동이 가능한 이동체에 배치되고, 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 생성하거나 저장하고 있는 엣지 디바이스(edge device);상기 이동체에 배치되고, 상기 엣지 디바이스로부터 상기 이동체 정보 m을 제공받으며, 제공받은 상기 이동체정보 m을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성하는 이동체 제어장치;상기 이동체와 이격되어 배치되고, 상기 이동체 제어장치가 임의의 범위 내에 존재할 때, 무선 통신 방법으로상기 이동체 제어장치로부터 상기 제1 암호화문 E(m)을 제공받으며, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하고, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성하는 중간 연결장치; 및유선 또는 무선 네트워크를 통해 상기 중간 연결장치로부터 상기 제3 암호화문 F(m)를 제공받아 저장하는 서버를 포함하는 이동체 정보 저장 시스템."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "이동이 가능한 이동체에 배치되고, 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성하는 엣지 디바이스(edge device);상기 이동체에 배치되고, 상기 엣지 디바이스로부터 상기 제1 암호화문 E(m)을 제공받는 이동체 제어장치;상기 이동체와 이격되어 배치되고, 상기 이동체 제어장치가 임의의 범위 내에 존재할 때, 무선 통신 방법으로상기 이동체 제어장치로부터 상기 제1 암호화문 E(m)을 제공받고, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하며, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성하는 중간 연결장치; 및유선 또는 무선 네트워크를 통해 상기 중간 연결장치로부터 상기 제3 암호화문 F(m)를 제공받아 저장하는 서버를 포함하는 이동체 정보 저장 시스템."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항, 제2항 및 제3항 중 어느 한 항에 있어서, 상기 제1 암호법은타원 곡선 암호(Elliptic Curve Cryptography; ECC)인 것을 특징으로 하는 이동체 정보 저장 시스템."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2017-0110236-3-제1항, 제2항 및 제3항 중 어느 한 항에 있어서, 상기 제2 암호법은완전 동형 암호(Fully Homomorphic Encryption)인 것을 특징으로 하는 이동체 정보 저장 시스템."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항, 제2항 및 제3항 중 어느 한 항에 있어서, 상기 서버는상기 중간 연결장치와 신호를 주고받을 수 있는 복수의 분산 서버들을 포함하고,상기 중간 연결장치는상기 제3 암호화문 F(m)을 상기 분산 서버들에 분산 저장시키는 것을 특징으로 하는 이동체 정보 저장 시스템."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항, 제2항 및 제3항 중 어느 한 항에 있어서, 상기 이동체는 자율 주행 자동차이고,상기 중간 연결장치는 신호등 또는 가로등에 포함되어 있는 것을 특징으로 하는 이동체 정보 저장 시스템."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항, 제2항 및 제3항 중 어느 한 항에 있어서, 상기 이동체는 무인 비행 장치이고,상기 중간 연결장치는 무인 비행 관제 장치에 포함되어 있는 것을 특징으로 하는 이동체 정보 저장 시스템."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "이동이 가능한 이동체에 배치된 엣지 디바이스(edge device)가 상기 이동체에 대한 정보(이하, '이동체 정보m'이라 함)을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성하는 단계;상기 이동체에 배치된 이동체 제어장치가 상기 엣지 디바이스로부터 상기 제1 암호화문 E(m)을 제공받고, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하며, 생성된 상기제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성하는단계; 및상기 이동체와 이격되어 배치된 중간 연결장치가 임의의 범위 내에 존재하는 상기 이동체 제어장치로부터 무선통신 방법으로 상기 제3 암호화문 F(m)를 제공받고, 제공받은 상기 제3 암호화문 F(m)를 유선 또는 무선 네트워크를 통해 서버로 제공하여 저장시키는 단계를 포함하는 이동체 정보 저장 방법."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "이동이 가능한 이동체에 배치된 이동체 제어장치가 상기 이동체에 배치된 엣지 디바이스(edge device)로부터 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)를 제공받고, 제공받은 상기 이동체 정보 m을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성하는 단계; 및상기 이동체와 이격되어 배치된 중간 연결장치가 임의의 범위 내에 존재하는 상기 이동체 제어장치로부터 무선통신 방법으로 상기 제1 암호화문 E(m)을 제공받고, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하며, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성하고, 생성된 상기 제3 암호화문 F(m)를 유선 또는 무선 네트워크를 통해 서버로 제공하여 저장시키는 단계를 포함하는 이동체 정보 저장 방법."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "이동이 가능한 이동체에 배치된 엣지 디바이스(edge device)가 상기 이동체에 대한 정보(이하, '이동체 정보m'이라 함)을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성하는 단계;상기 이동체에 배치된 이동체 제어장치가 상기 엣지 디바이스로부터 상기 제1 암호화문 E(m)을 제공받는 단계;및상기 이동체와 이격되어 배치된 중간 연결장치가 임의의 범위 내에 존재하는 상기 이동체 제어장치로부터 무선통신 방법으로 상기 제1 암호화문 E(m)을 제공받고, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암공개특허 10-2017-0110236-4-호화하여 제2 암호화문 F(E(m))을 생성하며, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성하고, 제공받은 상기 제3 암호화문 F(m)를 유선 또는 무선네트워크를 통해 서버로 제공하여 저장시키는 단계를 포함하는 이동체 정보 저장 방법."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항, 제10항 및 제11항 중 어느 한 항에 있어서, 상기 제1 암호법은타원 곡선 암호(Elliptic Curve Cryptography; ECC)인 것을 특징으로 하는 이동체 정보 저장 방법."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항, 제10항 및 제11항 중 어느 한 항에 있어서, 상기 제2 암호법은완전 동형 암호(Fully Homomorphic Encryption)인 것을 특징으로 하는 이동체 정보 저장 방법."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항, 제10항 및 제11항 중 어느 한 항에 있어서, 상기 서버는상기 중간 연결장치와 신호를 주고받을 수 있는 복수의 분산 서버들을 포함하고,상기 중간 연결장치가 상기 제3 암호화문 F(m)를 상기 서버로 제공하여 저장시키는 단계에서는,상기 제3 암호화문 F(m)을 상기 분산 서버들에 분산 저장시키는 것을 특징으로 하는 이동체 정보 저장 방법."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항, 제10항 및 제11항 중 어느 한 항에 있어서, 상기 이동체는 자율 주행 자동차이고,상기 중간 연결장치는 신호등 또는 가로등에 포함되어 있는 것을 특징으로 하는 이동체 정보 저장 방법."}
{"patent_id": "10-2016-0034322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항, 제10항 및 제11항 중 어느 한 항에 있어서, 상기 이동체는 무인 비행 장치이고,상기 중간 연결장치는 무인 비행 관제 장치에 포함되어 있는 것을 특징으로 하는 이동체 정보 저장 방법."}
{"patent_id": "10-2016-0034322", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "지능형 분산 컴퓨팅 환경에서 이동체에 대한 정보를 저장하여 보안을 강화시킬 수 있는 이동체 정보 저장 시스템 및 방법이 개시된다. 이러한 이동체 정보 저장 시스템은 엣지 디바이스, 이동체 제어장치, 중간 연결장치 및 서 버를 포함한다. 상기 엣지 디바이스는 이동체 정보 m을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생 (뒷면에 계속)"}
{"patent_id": "10-2016-0034322", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이동체 정보 저장 시스템 및 방법에 관한 것으로, 자동차와 같이 이동하는 이동체에 대한 정보를 저 장하여 보안을 강화시킬 수 있는 이동체 정보 저장 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2016-0034322", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사물 인터넷(Internet of Things; IoT)은 각종 사물에 센서와 통신 기능을 내장하여 인터넷에 연결하는 기술을 의미한다. 여기서 사물에는 가전제품, 모바일 장비, 웨어러블 컴퓨터 등 다양한 임베디드 시스템이 포함될 수 있다. 또한, 사물 인터넷에 연결되는 사물들은 자신을 구별할 수 있는 유일한 아이피를 가지고 인터넷으로 연 결되어야 하고, 외부 환경으로부터의 데이터 취득을 위해 센서를 내장할 수 있다. 이러한 사물인터넷이 활성화되면 네트워크 트래픽(network traffic)이 폭발적으로 증가하고 있다. 이러한 트래 픽의 증가는 네트워크의 성능 저하로 직결될 수 있다. 또한, 증가한 트래픽에 대한 빅데이터(big data) 분석을 위해 클라우드 서비스(cloud service)를 이용하는 사례가 늘어남에 따라, 데이터의 이동 경로가 길어질 수 있고 이는 전체 네트워크의 과부하를 초래할 수 있다. 따라서, 네트워크 엣지(network edge)와 가까운 곳에서 일정 비율 이상의 데이터를 우선 처리할 수 있도록 서비스를 제공하기는 것이 필요해졌고, 이를 해결하기 위해 개발 된 것이 지능형 분산 컴퓨팅(Distributed Intelligence Computing), 예를 들어 포그 컴퓨팅(fog computing)이 다. 이와 같이, 포그 컴퓨팅이란 클라우드 컴퓨팅 서비스를 네트워크 엣지단으로 확장한 패러다임이다. 데이터, 컴 퓨팅, 스토리지(storage) 및 애플리케이션 서비스를 사용자에게 제공한다는 개념 자체는 클라우드 컴퓨팅과 비슷하지만, 사용자와의 근접성, 고밀도의 지리적 분포도, 모빌리티(motility) 지원 등에서 클라우드 컴퓨팅과 큰 차별점을 가질 수 있다. 포그 컴퓨팅 환경에서는 네트워크 엣지나 심지어 셋톱박스(set-top box), 엑세스 포인 트(access point) 등 단말기기가 직접 사용되는 곳에서 서비스를 제공할 수 있다. 이렇게 사용자와 가까운 곳 에서 서비스를 제공함으로써 서비스 지연을 줄이고, 사용자의 필요나 환경에 따라 품질을 개선한 맞춤형 서비스 를 제공할 수 있다. 포그 컴퓨팅은 사물 영역, 포그 영역 및 클라우드 영역으로 구분될 수 있다. 우선, 사물 영역은 주변 환경을 감지할 수 있는 다양한 사물들로 구성될 수 있다. 포그 영역은 일반적인 사물에 비해 연산 능력이 높은 포그 디바이스들로 구성되며, 대표적인 예로서, PC, 라우터(router) 및 가전제품 등을 들 수 있다. 사물 영역의 사 물들과 포그 영역의 포그 디바이스들은 근거리 무선통신을 이용하여 연결되어 있다. 포그 디바이스들은 유/무 선 통신을 이용하여 클라우드 영역과 연결되고, 포그 디바이스 사이에서도 유기적인 연결이 존재할 수 있다. 한편, 포그 컴퓨팅은 인간의 조작 없이 인공지능에 의해 자동으로 주행할 수 있는 자율 주행 자동차에도 적용될 수 있다. 이러한 자율 주행 자동차는 자동차를 식별하는 식별 정보, 자동차의 소유자 정보뿐만 아니라 카메라 또는 센서에서 획득한 각종 주변 환경 정보를 생성할 수 있고, 이러한 정보들은 포그 영역을 경유하여 클라우드 영역으로 제공될 수 있다. 그러나, 자율 주행 자동차에서 생성되는 다양한 정보들에는 외부에 노출되면 안 되는 민감한 정보가 포함되어 있을 수 있다. 따라서, 이러한 정보를 안전하게 저장하기 위한 기술 개발이 요구되어진다."}
{"patent_id": "10-2016-0034322", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 이러한 문제점을 해결하기 위한 것으로, 본 발명의 해결하고자 하는 과제는 지능형 분산 컴 퓨팅 환경에서 이동체에 대한 정보를 저장하여 보안을 강화시킬 수 있는 이동체 정보 저장 시스템을 제공하는 것이다. 또한, 본 발명의 해결하고자 하는 다른 과제는 상기 이동체 정보 저장 시스템을 이용한 이동체 분산 방법을 제 공하는 것이다."}
{"patent_id": "10-2016-0034322", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 의한 이동체 정보 저장 시스템은 엣지 디바이스(edge device), 이동체 제어장치, 중간 연결장치 및 서버를 포함한다. 상기 엣지 디바이스는 이동이 가능한 이동체에 배치되고, 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성한다. 상기 이동체 제어장치는 상기 이동체에 배치되고, 상기 엣지 디바이스로부터 상기 제1 암호화문 E(m)을 제공받으며, 제공받은 상기 제1 암호화문 E(m) 을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하고, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성한다. 상기 중간 연결장치는 상기 이동체와 이격되어 배치되고, 상기 이동체 제어장치가 임의의 범위 내에 존재할 때, 무선 통신 방법으로 상기 이동체 제어장치로부터 상기 제3 암호화문 F(m)를 제공받는다. 상기 서버는 유선 또는 무선 네트워크를 통해 상기 중간 연결장치로부터 상기 제3 암호화문 F(m)를 제공받아 저장한다. 이어서, 본 발명의 다른 실시예에 의한 이동체 정보 저장 시스템은 엣지 디바이스(edge device), 이동체 제어장 치, 중간 연결장치 및 서버를 포함한다. 상기 엣지 디바이스는 이동이 가능한 이동체에 배치되고, 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 생성하거나 저장하고 있다. 상기 이동체 제어장치는 상기 이동체에 배치되고, 상기 엣지 디바이스로부터 상기 이동체 정보 m을 제공받으며, 제공받은 상기 이동체 정보 m을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성한다. 상기 중간 연결장치는 상기 이동체와 이격되어 배치되고, 상기 이동체 제어장치가 임의의 범 위 내에 존재할 때, 무선 통신 방법으로 상기 이동체 제어장치로부터 상기 제1 암호화문 E(m)을 제공받으며, 제 공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하고, 생성된 상 기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성한 다. 상기 서버는 유선 또는 무선 네트워크를 통해 상기 중간 연결장치로부터 상기 제3 암호화문 F(m)를 제공받아 저장한다. 이어서, 본 발명의 또 다른 실시예에 의한 이동체 정보 저장 시스템은 엣지 디바이스(edge device), 이동체 제 어장치, 중간 연결장치 및 서버를 포함한다. 상기 엣지 디바이스는 이동이 가능한 이동체에 배치되고, 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성한다. 상기 이동체 제어장치는 상기 이동체에 배치되고, 상기 엣지 디바이스로부터 상기 제1 암호화문 E(m)을 제공받는다. 상기 중간 연결장치는 상기 이동 체와 이격되어 배치되고, 상기 이동체 제어장치가 임의의 범위 내에 존재할 때, 무선 통신 방법으로 상기 이동 체 제어장치로부터 상기 제1 암호화문 E(m)을 제공받고, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하며, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되 는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성한다. 상기 서버는 유선 또는 무선 네트워크를 통해 상 기 중간 연결장치로부터 상기 제3 암호화문 F(m)를 제공받아 저장한다. 위의 실시예들에서, 상기 제1 암호법은 타원 곡선 암호(Elliptic Curve Cryptography; ECC)일 수 있다. 위의 실시예들에서, 상기 제2 암호법은 완전 동형 암호(Fully Homomorphic Encryption)일 수 있다. 위의 실시예들에서, 상기 서버는 상기 중간 연결장치와 신호를 주고받을 수 있는 복수의 분산 서버들을 포함할 수 있고, 상기 중간 연결장치는 상기 제3 암호화문 F(m)을 상기 분산 서버들에 분산 저장시킬 수 있다. 위의 실시예들에서, 상기 이동체는 자율 주행 자동차일 수 있고, 상기 중간 연결장치는 신호등 또는 가로등에 포함되어 있을 수 있다. 위의 실시예들에서, 상기 이동체는 무인 비행 장치일 수 있고, 상기 중간 연결장치는 무인 비행 관제 장치에 포 함되어 있을 수 있다. 한편, 본 발명의 일 실시예에 의한 이동체 정보 저장 방법으로, 우선 이동이 가능한 이동체에 배치된 엣지 디바 이스(edge device)가 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성한다. 이어서, 상기 이동체에 배치된 이동체 제어장치가 상기 엣지 디바이스로부터 상기 제1 암호화문 E(m)을 제공받고, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암 호화문 F(E(m))을 생성하며, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성한다. 이어서, 상기 이동체와 이격되어 배치된 중간 연결장치가 임의의 범위 내에 존재하는 상기 이동체 제어장치로부터 무선 통신 방법으로 상기 제3 암호화문 F(m)를 제공받고, 제공 받은 상기 제3 암호화문 F(m)를 유선 또는 무선 네트워크를 통해 서버로 제공하여 저장시킨다. 이어서, 본 발명의 다른 실시예에 의한 이동체 정보 저장 방법으로, 우선 이동이 가능한 이동체에 배치된 이동 체 제어장치가 상기 이동체에 배치된 엣지 디바이스(edge device)로부터 상기 이동체에 대한 정보(이하, '이동 체 정보 m'이라 함)를 제공받고, 제공받은 상기 이동체 정보 m을 제1 암호법에 따라 암호화하여 제1 암호화문 E(m)을 생성한다. 이어서, 상기 이동체와 이격되어 배치된 중간 연결장치가 임의의 범위 내에 존재하는 상기 이동체 제어장치로부터 무선 통신 방법으로 상기 제1 암호화문 E(m)을 제공받고, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하며, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성하고, 생성된 상기 제3 암호화 문 F(m)를 유선 또는 무선 네트워크를 통해 서버로 제공하여 저장시킨다. 이어서, 본 발명의 또 다른 실시예에 의한 이동체 정보 저장 방법으로, 우선 이동이 가능한 이동체에 배치된 엣 지 디바이스(edge device)가 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 제1 암호법에 따라 암 호화하여 제1 암호화문 E(m)을 생성한다. 이어서, 상기 이동체에 배치된 이동체 제어장치가 상기 엣지 디바이 스로부터 상기 제1 암호화문 E(m)을 제공받는다. 이어서, 상기 이동체와 이격되어 배치된 중간 연결장치가 임 의의 범위 내에 존재하는 상기 이동체 제어장치로부터 무선 통신 방법으로 상기 제1 암호화문 E(m)을 제공받고, 제공받은 상기 제1 암호화문 E(m)을 제2 암호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성하며, 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성 하고, 제공받은 상기 제3 암호화문 F(m)를 유선 또는 무선 네트워크를 통해 서버로 제공하여 저장시킨다. 위의 실시예들에서, 상기 제1 암호법은 타원 곡선 암호(Elliptic Curve Cryptography; ECC)일 수 있다. 위의 실시예들에서, 상기 제2 암호법은 완전 동형 암호(Fully Homomorphic Encryption)일 수 있다. 위의 실시예들에서, 상기 서버는 상기 중간 연결장치와 신호를 주고받을 수 있는 복수의 분산 서버들을 포함할 수 있다. 이때, 상기 중간 연결장치가 상기 제3 암호화문 F(m)를 상기 서버로 제공하여 저장시키는 단계에서는, 상기 제3 암호화문 F(m)을 상기 분산 서버들에 분산 저장시킬 수 있다. 위의 실시예들에서, 상기 이동체는 자율 주행 자동차일 수 있고, 상기 중간 연결장치는 신호등 또는 가로등에 포함되어 있을 수 있다. 위의 실시예들에서, 상기 이동체는 무인 비행 장치일 수 있고, 상기 중간 연결장치는 무인 비행 관제 장치에 포 함되어 있을 수 있다."}
{"patent_id": "10-2016-0034322", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이 본 발명에 의한 이동체 정보 저장 시스템 및 방법에 따르면, 이동체 정보 m이 제1 암호법에 따라 암 호화되어 제1 암호화문 E(m)이 생성되고, 상기 제1 암호화문 E(m)이 제2 암호법에 따라 다시 암호화되어 제2 암 호화문 F(E(m))이 생성되며, 상기 제2 암호화문 F(E(m))이 상기 제1 암호법에 대응되는 복호법에 따라 복호화되 어 제3 암호화문 F(m)이 생성된 후 서버로 제공되어 저장됨에 따라, 상기 이동체 정보 m이 암호화된 상태로 전 송 및 저장되어 외부로 노출되는 것이 억제될 수 있다."}
{"patent_id": "10-2016-0034322", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 본문에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포 함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구 성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있고, 유사하게 제2 구성 요소도 제1 구 성 요소로 명명될 수 있다. 본 출원에서 사용한 용어는 단지 특정한 실시예들을 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예들을 보다 상세하게 설명한다. <실시예 1> 도 1은 본 발명의 제1 실시예에 의한 이동체 정보 저장 시스템이 자율 주행 자동차에 적용된 일 예를 나타낸 개 념도이고, 도 2는 도 1의 이동체 정보 저장 시스템이 무인 비행 장치에 적용된 일 예를 나타낸 개념도이고, 도 3은 도 1의 이동체 정보 저장 시스템에서의 계층 관계의 일 예를 도시한 블록도이다. 도 1 및 도 3을 참조하면, 본 실시예에 의한 이동체 정보 저장 시스템은 이동이 가능한 이동체, 예를 들어 도 1과 같은 자율 주행 자동차, 도 2와 같은 무인 비행 장치 등에 대한 정보들을 암호화하여 저장시킬 수 있는 시스템이다. 이때, 상기 이동체 정보 저장 시스템은 도 1과 같은 자율 주행 자동차에 적용되거나 도 2와 같은 무인 비행 장치, 예를 들어 드론(drone)에 적용될 수 있다. 상기 이동체에는 적어도 하나의 엣지 디바이스(edge device; 10) 및 상기 엣지 디바이스과 전기적으로 연결된 이동체 제어장치가 배치될 수 있다. 상기 엣지 디바이스는 상기 이동체에 대한 정보(이하, '이동체 정보 m'이라 함)을 생성하거나 저장하 고 있을 수 있다. 예를 들어, 상기 엣지 디바이스은 상기 이동체의 위치, 속도, 주변 날씨, 차량 상 태 등을 각각 측정할 수 있는 다양한 종류의 센서이거나, 상기 이동체의 식별 정보, 등록 정보, 소유자 정 보 등을 각각 저장하고 있는 전자 디바이스일 수 있다. 따라서, 상기 이동체 정보 m에는 상기 이동체의 위치 정보, 주변 날씨 정보, 속도 정보, 차량 상태 정보, 식별 정보, 등록 정보, 소유자 정보 등이 포함될 수 있다. 상기 이동체 제어장치는 상기 이동체에 배치되어 상기 엣지 디바이스과 유선 또는 무선 통신으로 신호를 주고받을 수 있고, 상기 엣지 디바이스을 제어할 수도 있다. 예를 들어, 상기 이동체 제어장치(2 0)는 상기 엣지 디바이스로부터 각종 정보를 제공받아 외부로 전달할 수 있는 게이트 웨이를 포함할 수 있 다. 상기 중간 연결장치는 상기 이동체와 이격되어 배치되고, 상기 이동체 제어장치가 임의의 범위 내 에 존재할 때, 무선 통신으로 상기 이동체 제어장치와 신호를 주고받을 수 있다. 상기 중간 연결장치 는 상기 이동체 제어장치와 접속되어 상기 이동체 제어장치를 제어할 수도 있다. 여기서, 상기 중간 연결장치는 유선 또는 무선 네트워크를 통해 외부의 다른 장치와 연결시킬 수 있는 라우터(router)를 포함 할 수 있다. 한편, 상기 이동체가 자율 주행 자동차일 경우, 도 1과 같이 상기 중간 연결장치는 신호등 및 가로등 중 적어도 하나에 포함되어 있을 수 있다. 또한, 상기 이동체가 드론과 같은 무인 비행 장치일 경우, 도 2와 같이 상기 중간 연결장치는 건물, 가로등, 신호등 등에 설치된 무인 비행 관제 장치에 포함되어 있을 수 있다. 상기 서버는 유선 또는 무선 네트워크, 예를 들어 인터넷을 통해 상기 중간 연결장치와 신호를 주고받 을 수 있고, 상기 중간 연결장치를 제어할 수도 있다. 예를 들어, 상기 서버는 상기 이동체 제어장치 로 클라우드 컴퓨팅 서비스를 제공할 수 있는 클라우드 서버일 수도 있다. 도 4는 도 1의 이동체 정보 저장 시스템에서, 이동체 정보가 암호화되어 저장되는 과정을 설명하기 위한 도면이 다. 도 4를 참조하면, 우선 상기 엣지 디바이스가 상기 이동체 정보 m을 생성하거나 내부 메모리에 저장하고 있 을 수 있다. 이후, 상기 엣지 디바이스가 상기 이동체 정보 m을 제1 암호법에 따라 암호화하여 제1 암호화 문 E(m)을 생성하고, 생성된 상기 제1 암호화문 E(m)를 상기 이동체 제어장치로 제공할 수 있다. 이때, 상 기 제1 암호법은 예를 들어, 타원 곡선 암호(Elliptic Curve Cryptography; ECC)일 수 있다. 이어서, 상기 이동체 제어장치가 상기 엣지 디바이스로부터 제공받은 상기 제1 암호화문 E(m)을 제2 암 호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성할 수 있다. 이때, 상기 제2 암호법은 암호된 채로 연산 수행이 가능한 암호법으로, 예를 들어 완전 동형 암호(Fully Homomorphic Encryption)일 수 있다. 이후, 상기 이동체 제어장치가 이와 같이 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성한다. 예를 들어, 타원 곡선 암호에 따른 복호법으로 상기 제2 암호화문 F(E(m))을 복호할 경우, 상기 제2 암호화문 F(E(m)) 내에서 상기 제1 암호화문 E(m)이 상기 이동 체 정보 m으로 복호화되어 상기 제3 암호화문 F(m)이 생성될 수 있다. 이후, 상기 이동체 제어장치가 상기 중간 연결장치가 임의의 범위 내에 존재할 때, 생성된 상기 제3 암호화문 F(m)을 무선 통신 방법으로 상기중간 연결장치로 제공할 수 있다. 이어서, 상기 중간 연결장치가 상기 이동체 제어장치로부터 제공받은 상기 제3 암호화문 F(m)를 유선 또는 무선 네트워크, 예를 들어 인터넷을 통해상기 서버로 제공할 수 있다. 이어서, 상기 서버가 상기 중간 연결장치로부터 제공받은 상기 제3 암호화문 F(m)를 제공받아 저장할 수 있다. 한편, 이와 같이 저장된 상기 제3 암호화문 F(m)은 복호권한을 갖고 있는 사용자에게 제공되어 복호될 수 있다. 예를 들어, 사용자는 사용자 단말기를 통해 상기 서버에 접속한 후, 상기 제3 암호화문 F(m)을 제공받아 상 기 제2 암호법에 대응되는 복호법에 따라 복호화하여 상기 이동체 정보 m을 확인할 수 있다. 이와 같이 본 실시예에 따르면, 상기 엣지 디바이스가 상기 이동체 정보 m을 상기 제1 암호법에 따라 암호 화하여 상기 제1 암호화문 E(m)을 생성하고, 상기 이동체 디바이스가 상기 제1 암호화문 E(m)을 상기 제2 암호법에 따라 암호화하여 상기 제2 암호화문 F(E(m))을 생성하고, 다시 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 상기 제3 암호화문 F(m)을 생성한 후, 상기 중간 연결장치을 통해 상기 서버로 제공하 여 저장시킴에 따라, 상기 이동체 정보 m이 암호화된 상태로 전송 및 저장되어 외부로 노출되는 것이 억제될 수 있다. <실시예 2> 도 5는 본 발명의 제2 실시예에 의한 이동체 정보 저장 시스템에서, 이동체 정보가 암호화되어 저장되는 과정을 설명하기 위한 도면이다. 본 실시예에 의한 이동체 정보 저장 시스템은 이동체 정보가 암호화되어 저장되는 과정을 제외하면, 도 1 내지 도 4를 통해 설명한 제1 실시예에 의한 이동체 정보 저장 시스템과 실질적으로 동일하므로, 상기 제1 실시예에 동일한 구성요소들에 대해서는 동일한 참조 부호를 부여하고 이에 대한 자세한 설명은 생략하기로 한다. 도 5를 참조하면, 우선 상기 엣지 디바이스가 상기 이동체 정보 m을 생성하거나 내부 메모리에 저장하고 있 을 수 있다. 이후, 상기 엣지 디바이스가 상기 이동체 정보 m을 상기 이동체 제어장치로 제공할 수 있 다. 이어서, 상기 이동체 제어장치가 상기 엣지 디바이스로부터 제공받은 상기 이동체 정보 m을 제1 암호법 에 따라 암호화하여 제1 암호화문 E(m)을 생성한 후, 상기 중간 연결장치가 임의의 범위 내에 존재할 때, 생성된 상기 제1 암호화문 E(m)을 무선 통신 방법으로 상기 중간 연결장치로 제공할 수 있다. 이어서, 상기 중간 연결장치가 상기 이동체 제어장치로부터 제공받은 상기 제1 암호화문 E(m)을 제2 암 호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성할 수 있다. 이때, 상기 제2 암호법은 암호된 채로 연산 수행이 가능한 암호법으로, 예를 들어 완전 동형 암호(Fully Homomorphic Encryption)일 수 있다. 이어서, 상기 중간 연결장치가 이와 같이 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성할 수 있다. 예를 들어, 타원 곡선 암호에 따른 복호법으 로 상기 제2 암호화문 F(E(m))을 복호할 경우, 상기 제2 암호화문 F(E(m)) 내에서 상기 제1 암호화문 E(m)이 상 기 이동체 정보 m으로 복호화되어 상기 제3 암호화문 F(m)이 생성될 수 있다. 이후, 상기 중간 연결장치가 이와 같이 생성된 상기 제3 암호화문 F(m)을 유선 또는 무선 네트워크, 예를 들어 인터넷을 통해 상기 서버(4 0)로 제공할 수 있다. 이어서, 상기 서버가 상기 중간 연결장치로부터 제공받은 상기 제3 암호화문 F(m)를 제공받아 저장할 수 있다. 이와 같이 본 실시예에 따르면, 상기 이동체 디바이스가 상기 이동체 정보 m을 상기 제1 암호법에 따라 암 호화하여 상기 제1 암호화문 E(m)을 생성하고, 상기 중간 연결장치가 상기 제1 암호화문 E(m)을 상기 제2 암호법에 따라 암호화하여 상기 제2 암호화문 F(E(m))을 생성하고, 다시 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 상기 제3 암호화문 F(m)을 생성한 후, 상기 서버로 제공하여 저장시킴에 따라, 상기 이동 체 정보 m이 암호화된 상태로 전송 및 저장되어 외부로 노출되는 것이 억제될 수 있다. <실시예 3> 도 6은 본 발명의 제3 실시예에 의한 이동체 정보 저장 시스템에서, 이동체 정보가 암호화되어 저장되는 과정을 설명하기 위한 도면이다. 본 실시예에 의한 이동체 정보 저장 시스템은 이동체 정보가 암호화되어 저장되는 과정을 제외하면, 도 1 내지 도 4를 통해 설명한 제1 실시예에 의한 이동체 정보 저장 시스템과 실질적으로 동일하므로, 상기 제1 실시예에 동일한 구성요소들에 대해서는 동일한 참조 부호를 부여하고 이에 대한 자세한 설명은 생략하기로 한다. 도 6을 참조하면, 우선 상기 엣지 디바이스가 상기 이동체 정보 m을 생성하거나 내부 메모리에 저장하고 있 을 수 있다. 이후, 상기 엣지 디바이스가 상기 이동체 정보 m을 제1 암호법에 따라 암호화하여 제1 암호화 문 E(m)을 생성하고, 생성된 상기 제1 암호화문 E(m)를 상기 이동체 제어장치로 제공할 수 있다. 이때, 상 기 제1 암호법은 예를 들어, 타원 곡선 암호(Elliptic Curve Cryptography; ECC)일 수 있다. 이어서, 상기 이동체 제어장치가 상기 엣지 디바이스로부터 제공받은 상기 제1 암호화문 E(m)을, 상기 중간 연결장치가 임의의 범위 내에 존재할 때, 무선 통신 방법으로 상기 중간 연결장치로 제공할 수 있 다. 이어서, 상기 중간 연결장치가 상기 이동체 제어장치로부터 제공받은 상기 제1 암호화문 E(m)을 제2 암 호법에 따라 암호화하여 제2 암호화문 F(E(m))을 생성할 수 있다. 이때, 상기 제2 암호법은 암호된 채로 연산 수행이 가능한 암호법으로, 예를 들어 완전 동형 암호(Fully Homomorphic Encryption)일 수 있다. 이어서, 상기 중간 연결장치가 이와 같이 생성된 상기 제2 암호화문 F(E(m))을 상기 제1 암호법에 대응되는 복호법에 따라 복호화하여 제3 암호화문 F(m)를 생성할 수 있다. 예를 들어, 타원 곡선 암호에 따른 복호법으 로 상기 제2 암호화문 F(E(m))을 복호할 경우, 상기 제2 암호화문 F(E(m)) 내에서 상기 제1 암호화문 E(m)이 상 기 이동체 정보 m으로 복호화되어 상기 제3 암호화문 F(m)이 생성될 수 있다. 이후, 상기 중간 연결장치가 이와 같이 생성된 상기 제3 암호화문 F(m)을 유선 또는 무선 네트워크, 예를 들어 인터넷을 통해 상기 서버(4 0)로 제공할 수 있다. 이어서, 상기 서버가 상기 중간 연결장치로부터 제공받은 상기 제3 암호화문 F(m)를 제공받아 저장할 수 있다. 이와 같이 본 실시예에 따르면, 상기 엣지 디바이스가 상기 이동체 정보 m을 상기 제1 암호법에 따라 암호 화하여 상기 제1 암호화문 E(m)을 생성하고, 상기 중간 연결장치가 상기 제1 암호화문 E(m)을 상기 제2 암 호법에 따라 암호화하여 상기 제2 암호화문 F(E(m))을 생성하고, 다시 상기 제1 암호법에 대응되는 복호법에 따 라 복호화하여 상기 제3 암호화문 F(m)을 생성한 후, 상기 서버로 제공하여 저장시킴에 따라, 상기 이동체 정보 m이 암호화된 상태로 전송 및 저장되어 외부로 노출되는 것이 억제될 수 있다. <실시예 4> 도 7은 본 발명의 제4 실시예에 의한 이동체 정보 저장 시스템의 계층 관계의 일 예를 도시한 블록도이고, 도 8 은 도 7의 이동체 정보 저장 시스템에서, 이동체 정보가 암호화되어 저장되는 과정을 설명하기 위한 도면이다. 본 실시예에 의한 이동체 정보 저장 시스템은 이동체 정보가 분산 저장된다는 것을 제외하면, 도 1 내지 도 4를 통해 설명한 제1 실시예에 의한 이동체 정보 저장 시스템과 실질적으로 동일하므로, 상기 제1 실시예에 동일한 구성요소들에 대해서는 동일한 참조 부호를 부여하고 이에 대한 자세한 설명은 생략하기로 한다. 도 7 및 도 8을 참조하면, 상기 서버는 상기 중간 연결장치와 신호를 주고받을 수 있는 복수의 분산 서 버들을 포함할 수 있다. 이때, 상기 분산 서버들은 서로 분산되어 배치되어 인터넷을 통해 연결되어 있을 수 있다. 한편, 상기 중간 연결장치가 상기 제3 암호화문 F(m)를 상기 서버로 제공하여 저장시킬 때, 상기 제3 암호화문 F(m)을 복수개로 분할하여 상기 분산 서버들에 분산 저장시킬 수 있다. 이러한 분산 저장 기법은 도 1 내지 도 4에 따른 제1 실시예 뿐만 아니라, 도 5에 따른 제2 실시예 그리고 도 6에 따른 제3 실시예에서도 동 일하게 적용될 수 있다. 이와 같이 본 실시예에 따르면, 상기 제3 암호화문 F(m)이 복수개로 분할되어 상기 분산 서버들에 분산 저장됨 에 따라, 상기 이동체 정보 m에 대한 보안성이 더욱 향상될 수 있다. 앞서 설명한 본 발명의 상세한 설명에서는 본 발명의 바람직한 실시예들을 참조하여 설명하였지만, 해당 기술분"}
{"patent_id": "10-2016-0034322", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "야의 숙련된 당업자 또는 해당 기술분야에 통상의 지식을 갖는 자라면 후술될 특허청구범위에 기재된 본 발명의 사상 및 기술 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할수 있을 것이다."}
{"patent_id": "10-2016-0034322", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 제1 실시예에 의한 이동체 정보 저장 시스템이 자율 주행 자동차에 적용된 일 예를 나타낸 개 념도이다. 도 2는 도 1의 이동체 정보 저장 시스템이 무인 비행 장치에 적용된 일 예를 나타낸 개념도이다. 도 3은 도 1의 이동체 정보 저장 시스템에서의 계층 관계의 일 예를 도시한 블록도이다. 도 4는 도 1의 이동체 정보 저장 시스템에서, 이동체 정보가 암호화되어 저장되는 과정을 설명하기 위한 도면이 다. 도 5는 본 발명의 제2 실시예에 의한 이동체 정보 저장 시스템에서, 이동체 정보가 암호화되어 저장되는 과정을 설명하기 위한 도면이다. 도 6은 본 발명의 제3 실시예에 의한 이동체 정보 저장 시스템에서, 이동체 정보가 암호화되어 저장되는 과정을 설명하기 위한 도면이다. 도 7은 본 발명의 제4 실시예에 의한 이동체 정보 저장 시스템의 계층 관계의 일 예를 도시한 블록도이다. 도 8은 도 7의 이동체 정보 저장 시스템에서, 이동체 정보가 암호화되어 저장되는 과정을 설명하기 위한 도면이 다."}
