{"patent_id": "10-2021-0172321", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0154917", "출원번호": "10-2021-0172321", "발명의 명칭": "운동식단 추천 시스템 어플리케이션", "출원인": "김영민", "발명자": "김영민"}}
{"patent_id": "10-2021-0172321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "운동식단 추천 시스템 어플리케이션에 있어서, 상기 운동식단 추천아이콘에 체질측정아이콘에 사용자가 신체정보를 입력해 체질측정을 하는 제질측정부; 상기 체질측정부에 이어서, 체질측정 아이콘에 사용자가 입력한 정보를 바탕으로 지수를 판단하는 비만판단부; 상기 비만판단부의 결과에 의한 사용자의 체질개선을 위한 다이어트를 추천하는 다이어트추천부; 상기 다이어트추천부의 추천에 의해 먼저 운동 등의 처방을 체질측정 아이콘에사용자가 입력한 정보를 바탕으로 벌크업 또는 개인 맞춤 운동을 인공지능을 통해 운동루틴을 추전받는 운동처방추천부;상기 다이어트추천부의 추천에 의해 다음으로 음식 등의 처방을 사용자의 정보입력으로 식단을 평가하고 인공지능으로 사용자의 건강 개선을 위한 식단을 추천받는 식단처방추천부로 구성되어진 것을 특징으로 하는 운동식단 추천 시스템 어플리케이션"}
{"patent_id": "10-2021-0172321", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 운동식단 추천 어플리케이션에 관한 것으로서 사용시 조금이나마 이용자가 건강에 문제없이 체질개선 을 할수 있도록 함을 목적으로 한 것이다"}
{"patent_id": "10-2021-0172321", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 운동식단 추천 시스템 어플리케이션에 관한 것으로서, 더욱 상세하게는 운동식단 추천앱에 있어서 상 기 사용자가 운동식단 추천 애플리케이션을 동작하는 스마트폰, 상기 운동식단 추천아이콘에 체질측정아이콘에 사용자가 신체정보를 입력해 체질측정, 상기 체질측정 아이콘에 사용자가 입력한 정보를 바탕으로 지수를 판단 해 사용자의 체질개선을 위한 다이어트, 상기 체질측정 아이콘에 사용자가 입력한 정보를 바탕으로 지수를 판단 해 사용자의 체질개선을 위한 벌크업, 상기 운동추천 아이콘에 사용자가 입력한 체질측정 정보를 바탕으로 진단 을 내려 개인 맞춤 운동루틴을 제작하는 인공지능, 상기 운동 아이콘에, 무산소 운동, 무산소 운동 아이콘에, 사용자 선택으로 다문항 2택 무산소 운동, 상기 운동 아이콘에, 유산소 운동, 유산소 운동 아이콘에, 사용자 선 택으로 다문항 2택 유산소 운동, 상기 식단 아이콘에 사용자의 정보입력으로 식단을 평가하는 인공지능으로 개 선 식단, 상기 식단 아이콘에 사용자가 제출한 식단에 근거로 사용자의 건강 개선을 위한 식단추천, 상기 피드 백 아이콘에 인공지능 만으로는 부족한 개선을 비대면 조언 전문가의 조언에 있어서, 개인의 건강과 삶의 질을 개선 하기 위한 것이다."}
{"patent_id": "10-2021-0172321", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 운동과 식단은 전문가에게 조언을 구하거나 기초지식이 있는 경우에만 효과적으로 계획할수 있다. 그러나, 상기한 바와 같은 다이어트 혹은 벌크업은 이행중 건강에 문제가 생길수 있고 요요현상이 오는 문제점 이 있었다."}
{"patent_id": "10-2021-0172321", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에, 상기한 바와 같은 다이어트 혹은 벌크업은 이행중 건강에 문제가 생길수 있고 요요현상이 오는 문제점을 해결하고 어플리케이션에 의해서 운동 및 식단 처방을 체계적이고 정교하게 프로그래밍되어 제공하고자 하는 것 이다."}
{"patent_id": "10-2021-0172321", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "즉 본 발명은 운동식단 추천 시스템 어플리케이션에 있어서, 상기 운동식단 추천아이콘에 체질측정아이콘에 사 용자가 신체정보를 입력해 체질측정을 하는 제질측정부; 상기 체질측정부에 이어서, 체질측정 아이콘에 사용자 가 입력한 정보를 바탕으로 지수를 판단하는 비만판단부; 상기 비만판단부의 결과에 의한 사용자의 체질개선을 위한 다이어트를 추천하는 다이어트추천부; 상기 다이어트추천부의 추천에 의해 먼저 운동 등의 처방을 체질측 정 아이콘에 사용자가 입력한 정보를 바탕으로 벌크업 또는 개인 맞춤 운동을 인공지능을 통해 운동루틴을 추전 받는 운동처방추천부;상기 다이어트추천부의 추천에 의해 다음으로 음식 등의 처방을 사용자의 정보입력으로 식단을 평가하고 인공지능으로 사용자의 건강 개선을 위한 식단을 추천받는 식단처방추천부로 구성되어진 것을특징으로 하는 운동식단 추천 시스템 어플리케이션으로 구성하여서, 다이어트 혹은 벌크업은 이행중 건강에 문 제가 생길수 있고 요요현상이 오는 문제점을 해결하고 어플리케이션에 의해서 운동 및 식단 처방을 체계적이고 정교하게 프로그래밍되어 제공하는 것을 목적으로 한다"}
{"patent_id": "10-2021-0172321", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같은 다이어트 혹은 벌크업은 이행중 건강에 문제가 생길수 있고 요요현상이 오는 문제점을 해결하 고자 하는 것이다."}
{"patent_id": "10-2021-0172321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "운동식단 추천 시스템 어플리케이션에 있어서, 또한, 상기 운동식단 추천아이콘에 체질측정아이콘에 사용자가 신체정보를 입력해 체질측정을 하는 제질측정부 또한, 상기 체질측정부에 이어서, 체질측정 아이콘에 사용자가 입력한 정보를 바탕으로 지수를 판단하는 비만판 단 또한, 상기 비만판단부의 결과에 의한 사용자의 체질개선을 위한 다이어트를 추천하는 다이어트추천부 또한, 상기 다이어트추천부의 추천에 의해 먼저 운동 등의 처방을 체질측정 아이콘에 사용자가 입력한 정보를 바탕으로 벌크업 또는 개인 맞춤 운동을 인공지능을 통해 운동루틴을 추전받는 운동처방추천부 또한, 상기 다이어트추천부의 추천에 의해 다음으로 음식 등의 처방을 사용자의 정보입력으로 식단을 평가하 고 인공지능으로 사용자의 건강 개선을 위한 식단을 추천받는 식단처방추천부로 구성되어진 것을 특징으로 하는 운동식단 추천 시스템 어플리케이션으로 구성된다."}
{"patent_id": "10-2021-0172321", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본발명의 실시예에 따른 실시도이다."}
