{"patent_id": "10-2023-0019357", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0126905", "출원번호": "10-2023-0019357", "발명의 명칭": "사물인터넷 기반의 실내 환경 자동 관리 시스템", "출원인": "김형성", "발명자": "김형성"}}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "거주지를 구획하는 복수의 공간 및 상기 복수의 공간 상에 위치하는 제품의 내부를 포함하는 복수의 관리 영역에 개별적으로 배치되어, 상기 개별적으로 배치된 관리 영역을 대상으로 환경 정보를 검출하는 하나 이상의 검출 장치;상기 하나 이상의 검출 장치로부터 상기 환경 정보를 수신하고, 상기 환경 정보를 분석하여 상기 관리 영역의상태 정보를 생성하고, 상기 상태 정보에 따라 상기 관리 영역의 환경을 제어하기 위한 제어 정보를 생성하는관리 서버; 및상기 관리 서버로부터 상기 제어 정보를 수신하고, 상기 하나 이상의 검출 장치와 대응하는 상기 관리 영역에배치되어 상기 관리 영역의 환경을 개별적으로 제어하는 하나 이상의 환경 제어 장치; 를 포함하는 실내 환경자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 관리 서버로부터 상기 환경 정보, 상기 상태 정보 및 상기 제어 정보 중 적어도 하나를 수신하여 출력하는사용자 단말기; 를 더 포함하는 것을 특징으로 하는, 실내 환경 자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 관리 서버는상기 하나 이상의 검출 장치로부터 수신한 온도 및 습도를 포함하는 환경 정보를 누적 저장하고, 상기 누적 저장된 환경 정보를 기초로 온도 및 습도와 곰팡이와의 상관 관계가 기계 학습(machine learning)된 인공 지능(Artificial Intelligence, AI)을 이용하여, 곰팡이 발생 여부를 상기 상태 정보로 추정하는 것을 특징으로 하는, 실내 환경 자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서, 상기 환경 제어 장치는자외선조사장치, 송풍팬, 커튼제어장치, 도어제어장치, 제습장치 및 발열장치 중 적어도 하나를 포함하고,상기 관리 서버는상기 추정 결과, 곰팡이가 발생된 것으로 추정된 경우, 곰팡이가 발생된 것으로 추정된 검출 장치와 대응하는환경 제어 장치를 제어하여, 사전 설정된 시간 동안 자외선(ultraviolet-C)을 조사하도록 하는 제어 정보를 생성하고, 상기 환경 제어 장치에 상기 제어 정보를 전송하고, 상기 제어 정보에 따라 상기 환경 제어 장치의 동작이 완료되면, 상기 검출 장치에 의해 누적 저장된 상기 환경 정보를 갱신하는 것을 특징으로 하는, 실내 환경자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 관리 서버는 하나 이상의 검출 장치 중 특정 검출 장치의 환경 정보 변화량이 사전 설정된 값보다 높은 경우, 상기 특정 검출 장치와 가장 근거리에 위치한 다른 검출 장치로부터 검출된 환경 정보를 수신하고, 상기 다른 검출 장치로부터 수신한 환경 정보를 기초로 상기 특정 검출 장치의 검출 오류 여부를 판단하는 것을 특징으로 하는, 실내 환경 자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0126905-3-제1 항에 있어서,상기 관리 서버와 정보를 송수신하고, 블루투스(Bluetooth) 통신을 통해 상기 복수의 검출 장치와 데이터를 송수신하는 허브(hub); 를 더 포함하고, 상기 하나 이사의 검출 장치는 검출된 환경 정보를 상기 허브를 통해 상기 관리 서버에 전송하되, 페어링(pairing) 과정에서 중계기로부터 응답이 수신되지 않는 경우, 인접한 다른 검출 장치에 페어링을 시도하고, 응답이 수신되는 다른 검출 장치 중 하나에 상기 환경 정보를 전송하여, 상기 다른 검출 장치를 경유하여 상기 중계기에 상기 환경 정보를 전송하는 것을 특징으로 하는, 실내 환경 자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2 항에 있어서, 상기 관리 서버는상기 하나 이상의 검출 장치로부터 수신한 환경 정보를 누적 저장하고, 상기 누적 저장된 환경 정보를 기초로환경 정보의 변화 주기를 통해 해당 관리 영역의 활용 빈도를 나타내는 빈도 지수를 산출하고, 상기 빈도 지수가 사전 설정된 값보다 차이가 날 경우, 긴급 상황에 대한 이벤트 신호를 생성하여 상기 사용자 단말기에 전송하는 것을 특징으로 하는, 실내 환경 자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 상기 관리 서버는상기 누적 저장된 환경 정보를 기초로 환경 정보의 변화 주기를 통해 해당 관리 영역의 시간별 활용 빈도를 나타내는 시간별 빈도 지수를 산출하고, 각 시간별로 빈도 지수가 사전 설정된 값보다 차이가 날 경우, 긴급 상황에 대한 이벤트 신호를 생성하여 상기 사용자 단말기에 전송하는 것을 특징으로 하는, 실내 환경 자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2 항에 있어서, 상기 관리 서버는상기 하나 이상의 검출 장치로부터 수신한 온도 및 습도를 포함하는 환경 정보의 변화량이 사전 설정된 값보다높고, 상기 변화량이 사전 설정된 값보다 높은 환경 정보가 일정 시간 유지되는 경우, 상기 관리 영역에 구비된도어가 개방된 것으로 판단하고, 도어 개방에 대한 이벤트 신호를 생성하여 상기 사용자 단말기에 전송하는 것을 특징으로 하는, 실내 환경 정보 자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서, 상기 관리 서버는거리를 기반으로 복수의 거주지를 그룹핑(grouping)하고, 상기 복수의 거주지 각각에 구비된 검출 장치로부터각 거주지의 환경 정보 평균 값을 산출하고, 상기 복수의 거주지 중 상기 환경 정보 평균 값의 차이가 사전 설정된 값보다 높은 거주지와 대응하는 사용자 단말기에 맞춤형 정보를 제공하는 것을 특징으로 하는, 실내 환경자동 관리 시스템."}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 거주지 내에 각 방이나 화장실 등의 공간과 각 공간 내에 위치한 장롱, 신발장, 서랍 등의 제품 내부 에 대한 환경을 개별적으로 분석하고, 자동 관리하기 위한 사물인터넷(IoT)을 이용한 실내 환경 자동 관리 시스 템을 제안한다. (뒷면에 계속)"}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 실내 환경을 자동 관리하기 위한 시스템에 관한 것이다. 보다 상세하게는, 거주지 내에 각 방이나 화 장실 등의 공간과 각 공간 내에 위치한 장롱, 신발장, 서랍 등의 제품 내부에 대한 환경을 개별적으로 분석하고, 자동 관리하기 위한 사물인터넷(IoT) 기반의 실내 환경 자동 관리 시스템에 관한 것이다."}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사물인터넷(Internet of Things, IoT)은 각종 사물에 센서와 통신 기능을 내장하여 인터넷에 연결하여, 무선 통 신을 통해 각종 사물을 연결하는 기술을 의미한다. 여기서, 사물은 가전제품, 모바일 장비, 웨어러블 디바이스 등 다양한 임베디드 시스템이 될 수 있다. 이러한, 사물은 자신을 구별할 수 있는 유일한 아이피(IP)를 가지고인터넷으로 연결되어야 하며, 외부 환경으로부터의 데이터 취득을 위해 센서를 내장할 수 있다. 최근에는 TV, 보일러, 냉장고, 세탁기, 공기청정기 등 사물인터넷 기능을 가진 다양한 생활 가전제품 들도 개발되고 있다. 한편, 곰팡이는 균사로 이루어진 생물의 한 분류로, 두꺼운 세포벽을 가지고 있으며 식물과 비슷하지만, 스스 로 양분을 만들어 살아갈 수 없는 종속영양생물이다. 이러한, 곰팡이는 실내의 공기질을 오염시켜서 각종 호 흡기 질환과 아토피 같은 피부질환, 두통 등 각종 호흡기를 감염시키는 세균을 번식시킨다. 이에 따라, 최근에는 실내 환경에서 곰팡이를 제거하기 위하여 다양한 자외선 살균 장치, 곰팡이 방지 벽지, 곰 팡이 제거 약품 등이 지속적으로 개발되고 있다. 그러나, 곰팡이는 거주지 내에서 각 방이나 화장실 등의 공간과 각 공간 내에 위치한 장롱, 신발장, 서랍 등의 제품 내부의 온도 및 습도에 따라 특정 영역에 발생될 수 있으며, 특정 영역의 고유한 환경적 요인에 따라 발생 되는 장소나 시점이 다양하게 변화될 수 있다. 이에 따라, 거주지 내에서 각 공간 또는 제품 내부에서 발생되는 곰팡이를 효율적으로 관리할 수 있는 방안이 필요한 실정이다. 또한, 최근 시간적, 공간적, 물질적 삶의 질이 향상되면서, 공간과 물건을 편리하고 쾌적하게 관리하기 위한 정 리 수납과 관련한 관심이 집중됨에 따라, 수납 공간과 옷장 등을 쾌적하게 관리할 수 있는 방안이 필요한 실정 이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2006-0026921호, ‘온도/습도조절이 가능한 장롱’, (2006.03.24. 공개)"}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 거주지 내에 각 방이나 화장실 등의 공간과 각 공간 내에 위치한 장롱, 신발장, 서랍 등의 제 품 내부에 대한 환경을 개별적으로 분석하고, 자동 관리하기 위한 사물인터넷(IoT) 기반의 실내 환경 자동 관리 시스템을 제공하는 데 있다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 바와 같은 기술적 과제를 달성하기 위하여, 본 발명은 거주지 내에 각 방이나 화장실 등의 공간과 각 공 간 내에 위치한 장롱, 신발장, 서랍 등의 제품 내부에 대한 환경을 개별적으로 분석하고, 자동 관리하기 위한 사물인터넷(IoT) 기반의 실내 환경 자동 관리 시스템을 제안한다. 상기 시스템은 거주지를 구획하는 복수의 공간 및 상기 복수의 공간 상에 위치하는 제품의 내부를 포함하는 복 수의 관리 영역에 개별적으로 배치되어, 상기 개별적으로 배치된 관리 영역을 대상으로 환경 정보를 검출하는 하나 이상의 검출 장치, 상기 하나 이상의 검출 장치로부터 상기 환경 정보를 수신하고, 상기 환경 정보를 분석 하여 상기 관리 영역의 상태 정보를 생성하고, 상기 상태 정보에 따라 상기 관리 영역의 환경을 제어하기 위한 제어 정보를 생성하는 관리 서버 및 상기 관리 서버로부터 상기 제어 정보를 수신하고, 상기 하나 이상의 검출 장치와 대응하는 상기 관리 영역에 배치되어 상기 관리 영역의 환경을 개별적으로 제어하는 하나 이상의 환경 제어 장치를 포함하는 실내 환경 자동 관리 시스템을 포함한다. 구체적으로, 상기 시스템은 상기 관리 서버로부터 상기 환경 정보, 상기 상태 정보 및 상기 제어 정보 중 적어 도 하나를 수신하여 출력하는 사용자 단말기를 더 포함할 수 있다. 상기 관리 서버는 상기 적어도 하나의 검출 장치로부터 수신한 온도 및 습도를 포함하는 환경 정보를 누적 저장 하고, 상기 누적 저장된 환경 정보를 기초로 온도 및 습도와 곰팡이와의 상관 관계가 기계 학습(machine learning)된 인공 지능(Artificial Intelligence, AI)을 이용하여, 곰팡이 발생 여부를 상기 상태 정보로 추정할 수 있다. 상기 환경 제어 장치는 자외선조사장치, 송풍팬, 커튼제어장치, 도어제어장치, 제습장치 및 발열장치 중 적어도 하나를 포함하고, 상기 관리 서버는 상기 추정 결과, 곰팡이가 발생된 것으로 추정된 경우, 상기 환경 제어 장 치를 제어하여 사전 설정된 시간 동안 자외선(ultraviolet-C)을 조사하도록 하는 제어 정보를 생성하여, 상기 환경 제어 장치에 상기 제어 정보를 전송하고, 상기 제어 정보에 따라 상기 환경 제어 장치의 동작이 완료되면, 상기 검출 장치에 의해 누적 저장된 상기 환경 정보를 갱신할 수 있다. 상기 관리 서버는 적어도 하나의 검출 장치 중 특정 검출 장치의 환경 정보 변화량이 사전 설정된 값보다 높은 경우, 상기 특정 검출 장치와 가장 근거리에 위치한 다른 검출 장치로부터 검출된 환경 정보를 수신하고, 상기 다른 검출 장치로부터 수신한 환경 정보를 기초로 상기 특정 검출 장치의 검출 오류 여부를 판단할 수 있다. 상기 시스템은 상기 관리 서버와 정보를 송수신하고, 블루투스(Bluetooth) 통신을 통해 상기 복수의 검출 장치 와 데이터를 송수신하는 허브(hub)를 더 포함할 수 있다. 상기 적어도 하나의 검출 장치는 검출된 환경 정보를 상기 허브를 통해 상기 관리 서버에 전송하되, 페어링 (pairing) 과정에서 상기 중계기로부터 응답이 수신되지 않는 경우, 인접한 다른 검출 장치에 페어링을 시도하 고, 응답이 수신되는 다른 검출 장치 중 하나에 상기 환경 정보를 전송하여, 상기 다른 검출 장치를 경유하여 상기 중계기에 상기 환경 정보를 전송할 수 있다. 상기 관리 서버는 상기 적어도 하나의 검출 장치로부터 수신한 환경 정보를 누적 저장하고, 상기 누적 저장된 환경 정보를 기초로 환경 정보의 변화 주기를 통해 해당 관리 영역의 활용 빈도를 나타내는 빈도 지수를 산출하 고, 상기 빈도 지수가 사전 설정된 값보다 차이가 날 경우, 긴급 상황에 대한 이벤트 신호를 생성하여 상기 사 용자 단말기에 전송할 수 있다. 상기 관리 서버는 상기 누적 저장된 환경 정보를 기초로 환경 정보의 변화 주기를 통해 해당 관리 영역의 시간 별 활용 빈도를 나타내는 시간별 빈도 지수를 산출하고, 각 시간별로 빈도 지수가 사전 설정된 값보다 차이가 날 경우, 긴급 상황에 대한 이벤트 신호를 생성하여 상기 사용자 단말기에 전송할 수 있다. 상기 관리 서버는 상기 하나 이상의 검출 장치로부터 수신한 온도 및 습도를 포함하는 환경 정보의 변화량이 사 전 설정된 값보다 높고, 상기 변화량이 사전 설정된 값보다 높은 환경 정보가 일정 시간 유지되는 경우, 상기 관리 영역에 구비된 도어가 개방된 것으로 판단하고, 도어 개방에 대한 이벤트 신호를 생성하여 상기 사용자 단 말기에 전송할 수 있다. 상기 관리 서버는 거리를 기반으로 복수의 거주지를 그룹핑(grouping)하고, 상기 복수의 거주지 각각에 구비된 하나 이상의 검출 장치로부터 각 거주지의 환경 정보 평균 값을 산출하고, 상기 복수의 거주지 중 상기 환경 정 보 평균 값이 사전 설정된 값보다 차이 나는 거주지와 대응하는 사용자 단말기에 맞춤형 정보를 제공할 수 있다. 기타 실시 예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예들에 따르면, 복수의 관리 영역에 적어도 하나의 검출 장치를 배치하고, 적어도 하나의 검출 장치로부터 검출된 환경 정보를 개별적으로 분석하고, 분석된 결과에 따라 각 관리 영역을 개별적으로 제어하기 위한 제어 정보를 생성하여, 각 관리 영역의 환경을 각각 제어함으로써, 거주지 내에서 각 공간 또는 제품 내부 의 환경을 효율적으로 관리할 수 있다."}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과로 제한되지 아니하며, 언급되지 않은 또 다른 효과들은 청구범위의"}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "기재로부터 본 발명이 속한 기술분야의 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0019357", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 기술적 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하 려는 의도가 아님을 유의해야 한다. 또한, 본명세서에서 사용되는 기술적 용어는 본 명세서에서 특별히 다른 의 미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 명세서에서 사용되는 기술적인 용어가 본 발명의 사상을 정확하게 표현하지 못하는 잘못된 기술 적 용어일 때에는, 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또한, 본 발명에서 사용되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하 며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, '구성된다' 또는 '가지다' 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여 러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 본 명세서에서 사용되는 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으 면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있고, 유사하게 제2 구성 요소도 제1 구성 요소로 명명될 수 있다. 어떤 구성 요소가 다른 구성 요소에 '연결되어' 있다거나 '접속되어' 있다고 언급된 때에는, 그 다른 구성 요소 에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성 요소가 존재할 수도 있다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"'직접 연결되어' 있다거나 '직접 접속되어' 있다고 언급된 때에는, 중간에 다른 구성 요소가 존재하지 않는 것으로 이해되어야 할 것이다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일 하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 발명의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 발명의 사상이 제한되는 것으로 해석되어서는 아니 됨을 유의해야 한다. 본 발 명의 사상은 첨부된 도면 외에 모든 변경, 균등물 내지 대체물에 까지도 확장되는 것으로 해석되어야 한다. 한편, 최근에는 실내 환경에서 곰팡이를 제거하기 위하여 다양한 자외선 살균 장치, 곰팡이 방지 벽지, 곰팡이 제거 약품 등이 지속적으로 개발되고 있다. 그러나, 곰팡이는 거주지 내에서 각 방이나 화장실 등의 공간과, 각 공간 내에 위치한 장롱, 신발장, 서랍 등의 제품 내부의 온도 및 습도에 따라, 특정 영역에 발생될 수 있으며, 변화되는 환경에 따라 발생되는 장소나 시점 이 바뀔 수 있다. 이에 따라, 거주지 내에서 각 공간 또는 제품 내부에서 발생되는 곰팡이를 효율적으로 관리할 수 있는 방안이 필요한 실정이다. 더하여, 최근에는 시간적, 공간적, 물질적으로 삶의 질이 향상될 수 있도록, 편리하고 쾌적하게 공간과 물건을 관리하는 정리 수납과 관련한 관심이 집중됨에 따라, 수납 공간과 옷장 등을 쾌적하게 관리할 수 있는 방안이 필요한 실정이다. 이러한 한계를 극복하고자, 본 발명은 거주지 내에 각 방이나 화장실 등의 공간과, 각 공간 내에 위치한 장롱, 신발장, 서랍 등의 제품 내부에 대한 환경을 분석하여 자동 관리할 수 있는 다양한 수단들을 제안하고자 한다.도 1은 본 발명의 일 실시예에 따른 실내 환경 자동 관리 시스템의 구성도이고, 도 2는 본 발명의 다른 실시예 에 따른 실내 환경 자동 관리 시스템의 구성도이다. 도 1 및 도 2를 참조하면, 본 발명의 일 실시예에 따른 실내 환경 자동 관리 시스템은 적어도 하나의 검출 장치 (100-1, 100-2 쪋 100-n, 100), 적어도 하나의 환경 제어 장치(200-1 쪋 200-m, 200), 관리 서버 및 사용 자 단말기를 포함하여 구성될 수 있다. 도 1에 도시된 바와 같이, 적어도 하나의 검출 장치(100-1, 100-2 쪋 100-n, 100), 적어도 하나의 (200-1 쪋 200-m, 200) 및 관리 서버는 유선 통신(wire communication)으로 연결될 수 있다. 이 경우, 본 발명의 일 실시예에 따른 실내 환경 자동 관리 시스템은 실내 환경 관리를 위한 데이터(온도, 습도, O2 농도, CO2 농도) 수 집의 신뢰성을 확보할 수 있다. 도 2에 도시된 바와 같이, 적어도 하나의 검출 장치(100-1, 100-2 쪋 100-n, 100), (200-1 쪋 200-m, 200) 및 관리 서버는 무선 통신(wireless communication)으로 연결될 수 있다. 이를 위하여, 실내 환경 자동 관리 시스템은 검출 장치(100-1, 100-2 쪋 100-n, 100) 및 적어도 하나의 (200-1 쪋 200-m, 200)로부터 발신된 무선 신호를 중계(pass through)하기 위한 네트워크 허브(network hub, 20)를 더 포함하여 구성될 수 있다. 하지만, 이에 한정된 것은 아니고, 적어도 하나의 검출 장치(100-1, 100-2 쪋 100-n, 100), 및 적어도 하나의 (200-1 쪋 200-m, 200)는 허브를 거치지 않고, 각각 개별적으로 관리 서버에 신호를 전송하도록 구성될 수도 있다. 특히, 적어도 하나의 검출 장치(100-1, 100-2 쪋 100-n, 100), (200-1 쪋 200-m, 200) 및 허브는 블 루투스(bluetooth) 통신을 통해 데이터를 송수신할 수 있다. 여기서, 허브는 네트워크 허브(hub), 리피터 (repeater), 스위치(switch), 브릿지(bridge), 라우터(router), 게이트웨이(gateway), 블루투스 인공지능 스피 커(bluetooth AI speaker), 티비 셋톱박스(TV set-top box) 중 어느 하나가 될 수 있으며, 이에 한정되지 않는 다. 이와 같은, 본 발명의 실시예들에 따른 실내 환경 자동 관리 시스템의 구성 요소들은 기능적으로 구분되는 요소 들을 나타낸 것에 불과하므로, 어느 하나 이상의 구성 요소가 실제 물리적 환경에서는 서로 통합되어 구현될 수 있다. 실내 환경 자동 관리 시스템의 각 구성 요소에 대해 보다 구체적으로 설명하면, 적어도 하나의 검출 장치 는 거주지를 구획하는 복수의 공간 및 복수의 공간 상에 위치하는 제품의 내부를 포함하는 복수의 관리 영역 중 적어도 하나에 배치될 수 있다. 여기서, 거주지는 사람이 거주하는 지역으로, 주택지뿐만 아니라 상업, 공업 등 거주가 이루어지는 모든 지역이 적용될 수 있다. 예를 들어, 복수의 공간은 거주지 내에 각 방이나 화장실 등의 공간이 될 수 있다. 제품은 각 공간 내에 위치한 장롱, 신발장, 서랍 등이 될 수 있다. 즉, 적어도 하나의 검출 장치는 각 방의 벽면, 화장실 내부, 장롱 내부, 신발장 내부, 서랍 내부에 등에 설치될 수 있다. 이러한, 적어도 하나의 검출 장치는 설치된 관리 영역을 대상으로 환경 정보를 개별적으로 검출할 수 있다. 여기서, 환경 정보는 온도, 습도, 산소(O2)농도 및 이산화탄소(CO2)농도 중 적어도 하나를 포함할 수 있다. 하지만, 이에 한정된 것은 아니고, 환경 정보는 관리 영역의 환경에 관한 다양한 정보가 적용될 수 있다. 즉, 적어도 하나의 검출 장치는 온도 센서(temperature sensor), 습도 센서(humidity sensor), 산소 센서 (oxygen sensor), 적외선 센서(infrared ray sensor) 등이 될 수 있다. 이러한, 온도 센서, 습도 센서, 산소 센서, 적외선 센서 등은 하나의 모듈로 구성되거나, 각 관리 영역의 용도에 맞게 별도로 구비될 수 있다. 적어도 하나의 검출 장치는 검출된 환경 정보를 관리 서버에 직접 전송할 수 있다. 하지만, 이에 한 정된 것은 아니고, 검출 장치는 블루투스 통신을 통해 허브에 환경 정보를 전송하여, 허브를 통해 관리 서버로 환경 정보를 전송하도록 할 수 있다. 이때, 적어도 하나의 검출 장치는 검출된 환경 정보를 허브를 통해 관리 서버에 전송하되, 허브 와 블루투스 페어링(pairing)을 수행하는 과정에서 허브로부터 응답이 수신되지 않는 경우, 인접한 다 른 검출 장치에 페어링을 시도할 수 있다. 즉, 적어도 하나의 검출 장치는 사용자에 의해 특정 관리 영역 에 설치되면, 최초 관리 서버와 데이터 송수신을 중계하는 허브와 블루투스 페어링을 수행하게 된다. 이때, 적어도 하나의 검출 장치는 페어링 과정에서 허브로부터 응답이 수신되지 않는 경우, 허브 와의 거리가 블루투스 통신이 불가한 거리로 판단하고, 인접한 다른 검출 장치에 페어링을 시도할 수 있다. 여 기서, 다른 검출 장치는 허브와의 페어링이 완료된 상태일 수 있다. 즉, 적어도 하나의 검출 장치는 인접한 다른 검출 장치와 페어링을 수행하고, 페어링 완료된 다른 검출 장치를 경유하여 허브에 환경 정보 를 전송할 수 있다. 이로 인해, 적어도 하나의 검출 장치는 블루투스 통신 가능한 거리보다 허브와의거리가 멀리 있는 경우에도 별도의 추가 허브 설치 없이 환경 정보를 전송할 수 있다. 다음으로 구성으로, 적어도 하나의 환경 제어 장치는 검출 장치와 대응하는 관리 영역에 배치되어 관 리 영역의 환경을 제어할 수 있다. 여기서, 적어도 하나의 환경 제어 장치는 적어도 하나의 검출 장치 와 일체로 구비되거나 별도로 구비될 수 있다. 즉, 적어도 하나의 환경 제어 장치는 적어도 하나의 검출 장치 각각과 서로 대응하는 영역에 함께 배치될 수 있다. 이러한, 적어도 환경 제어 장치는 자외선(ultraviolet-C)을 조사하는 자외선조사장치, 환기를 위한 송풍팬 (blast fan), 커튼제어장치, 도어제어장치, 제습장치, 발열장치 등이 될 수 있다. 예를 들어, 적어도 하나의 환 경 제어 장치는 온도 센서 및 습도 센서를 포함하는 적어도 하나의 검출 장치와 일체로 구성되어, 온 도 센서 및 습도 센서에 의해 검출된 환경 정보를 기초로 생성된 제어 정보에 따라, 280nm 내지 100nm 파장의 자외선을 조사하여 곰팡이를 제거하도록 할 수 있다. 다음 구성으로, 관리 서버는 적어도 하나의 검출 장치로부터 환경 정보를 수신할 수 있다. 관리 서버 는 적어도 하나의 검출 장치로부터 온도, 습도, 산소(O2)농도 및 이산화탄소(CO2)농도 중 적어도 하나 를 포함하는 환경 정보를 수신하고, 수신한 환경 정보를 누적 저장하여 빅 데이터(big data)를 구성할 수 있다. 생성된 빅 데이터는 환경 정보를 분석하여 상태 정보 및 제어 정보를 생성하는데 이용될 수 있다. 여기서, 관리 서버는 복수의 관리 영역 별로 각각 배치된 검출 장치를 사용자 단말기를 통해 등 록 받을 수 있다. 예를 들어, 관리 서버는 '1번 검출 장치 - 신발장', '2번 검출 장치 - 안방 드레스룸', '3번 검출 장치 - 아들방 붙박이장', '4번 검출 장치 - 딸방 붙박이장'와 같이, 사용자가 검출 장치를 관 리 영역에 설치하는 과정에서 사용자 단말기로부터 각 검출 장치가 설치된 위치 정보를 입력받을 수 있다. 또한, 관리 서버는 환경 정보를 분석하여 관리 영역의 상태 정보를 생성하고, 상태 정보에 따라 관리 영역 의 환경을 제어하기 위한 제어 정보를 생성할 수 있다. 이러한, 관리 서버는 서버라는 용어에 한정되지 아니하고, 데스크탑(desktop), 워크스테이션(workstation) 또는 서버(server) 등과 같은 고정식 컴퓨팅 장치 중 어느 하나가 될 수 있다. 특히, 관리 서버는 세대 내 에서 조명 제어, 가스밸브제어, 난방제어, 도어폰 제어, 센서 제어 등을 관리하는 홈 오토메이션(home automation) 서버가 될 수 있다. 이하, 관리 서버의 상세한 구성에 대해서는 도 3 및 도 4를 참조하여 상세히 설명하도록 한다. 다음 구성으로, 사용자 단말기는 관리 서버로부터 환경 정보, 상태 정보 및 제어 정보 중 적어도 하 나를 수신하여 출력할 수 있다. 예를 들어, 사용자 단말기는 관리 서버를 통해 적어도 하나의 검출 장치로부터 검출된 각 관리 영역의 온도 및 습도 정보를 수신하여 화면 상에 수치 또는 그래프 형태로 출 력하거나, 온도 및 습도 정보를 분석하여 도출된 각 영역의 곰팡이 발생 여부를 수신하여 알림 형태로 출력할 수 있으며, 자외선조사장치를 포함하는 적어도 하나의 환경 제어 장치를 제어하기 위한 제어 정보를 출력 하거나, 자외선조사장치의 작동 여부, 자동 시간 등을 출력할 수 있다. 이러한, 사용자 단말기는 3GPP(3rd Generation Partnership Project)에서 규정하고 있는 사용자 장치 (User Equipment, UE) 또는 IEEE(Institute of Electrical and Electronics Engineers)에서 규정하고 있는 모 바일 스테이션(Mobile Station, MS)에 한정되지 아니하며, 적어도 하나의 검출 장치, 적어도 하나의 환경 제어 장치 및 관리 서버와 데이터를 송수신하고, 송수신된 데이터를 기초로 연산을 수행할 수 있는 장치라면 어떠한 장치라도 허용될 수 있다. 예를 들어, 사용자 단말기는 데스크탑(desktop), 워크스테이션 (workstation) 또는 서버(server)와 같은 고정식 컴퓨팅 장치, 또는 스마트폰(smart phone), 랩탑(laptop), 태 블릿(tablet), 패블릿(phablet), 휴대용 멀티미디어 재생장치(Portable Multimedia Player, PMP), 개인용 휴대 단말기(Personal Digital Assistants, PDA) 또는 전자책 단말기(E-book reader)과 같은 이동식 컴퓨팅 장치 중 어느 하나가 될 수 있다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 적어도 하나의 검출 장치, 적어도 하나의 환경 제 어 장치 및 관리 서버가 유선 통신으로 연결된 경우, 적어도 하나의 검출 장치, 적어도 하나의 환경 제어 장치 및 관리 서버는 전용 케이블(dedicated cable) 이용한 폐쇄 네트워크(closed network)를 구성할 수 있다. 이와 다르게, 적어도 하나의 검출 장치, 적어도 하나의 환경 제어 장치 및 관리 서버는 공용 유선 통신망을 이용하여 개방 네트워크(open network)를 구성할 수도 있다. 이 경우, 공용 유선 통신망은 이더넷(ethernet), 디지털가입자선(x Digital Subscriber Line, xDSL), 광동축 혼합선(Hybrid Fiber Coax, HFC) 또는 광가입자선(Fiber To The Home, FTTH)을 이용한 네트워크가 될 수 있으나, 이 에 한정되는 것도 아니다. 도 2에 도시된 바와 같이, 본 발명의 다른 실시예에 따른 적어도 하나의 검출 장치, 적어도 하나의 환경 제어 장치 및 관리 서버가 무선 통신으로 연결된 경우, 적어도 하나의 검출 장치, 적어도 하나 의 환경 제어 장치 및 관리 서버는 근거리 무선 통신망, 또는 이동 통신망을 이용하여 데이터를 송수 신할 수 있다. 이 경우, 근거리 무선 통신망은 블루투스(Bluetooth), 지그비(Zigbee), NFC(Near Field Communication), 와이파이, 와이맥스(Wimax), 및 와이브로(Wibro) 중 어느 하나가 될 수 있으나, 이에 한정되는 것은 아니다. 그리고, 이동 통신망은 코드 분할 다중 접속(Code Division Multiple Access, CDMA), 와이드 밴 드 코드 분할 다중 접속(Wideband CDMA, WCDMA), 고속 패킷 접속(High Speed Packet Access, HSPA), 롱텀 에볼 루션(Long Term Evolution, LTE) 및 5G(5th Generation Mobile Telecommunication) 중 어느 하나가 될 수 있으 나, 이에 한정되는 것은 아니다. 그리고, 본 발명의 실시예들에 따른 적어도 하나의 검출 장치, 적어도 하나의 환경 제어 장치, 관리 서버 및 사용자 단말기는 공용 유선 통신망, 또는 이동 통신망 중 하나 이상의 조합을 이용하여 데이 터를 송수신할 수 있다. 이하, 상술한 바와 같은 관리 서버의 구성에 대하여 보다 구체적으로 설명하기로 한다. 도 3은 본 발명의 일 실시예에 따른 관리 서버의 논리적 구성도이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 관리 서버는 통신부, 입출력부, 학습 정보 생성 부, 환경 정보 분석부, 상태 정보 생성부 및 제어 정보 생성부를 포함하여 구성될 수 있다. 이와 같은, 관리 서버의 구성 요소들은 기능적으로 구분되는 요소들을 나타낸 것에 불과하므로, 어느 하나 이상의 구성 요소가 실제 물리적 환경에서는 서로 통합되어 구현될 수 있다. 관리 서버의 각 구성 요소에 대해 보다 구체적으로 설명하면, 통신부는 적어도 하나의 검출 장치 로부터 검출된 환경 정보를 수신할 수 있다. 예를 들어, 통신부는 온도, 습도, 산소(O2)농도 및 이산 화탄소(CO2)농도 중 적어도 하나를 수신할 수 있다. 또한, 통신부는 환경 정보를 기초로 생성한 상태 정보 및 제어 정보 중 적어도 하나를 환경 제어 장치 및 사용자 단말기 적어도 하나에 전송할 수 있다. 또한, 통신부는 사용자 단말기로부터 적어도 하나의 검출 장치 및 적어도 하나의 환경 제어 장 치를 등록하기 위한 등록 정보들을 수신할 수 있다. 예를 들어, 등록 정보는 적어도 하나의 검출 장치 각각의 위치 정보와 대응될 수 있는 정보, 적어도 하나의 환경 제어 장치의 각각의 위치 정보와 대 응될 수 있는 정보 등이 될 수 있다. 또한, 등록 정보는 적어도 하나의 검출 장치 및 적어도 하나의 환경 제어 장치 각각의 기능 및 기능을 제어하기 위한 정보가 될 수 있다. 다음 구성으로, 입출력부는 적어도 하나의 검출 장치로부터 수신한 환경 정보를 출력할 수 있다. 즉, 입출력부는 각 검출 장치로부터 수신한 온도, 습도, 산소(O2)농도 및 이산화탄소(CO2)농도 등을 수치 또는 그래프 형태로 출력할 수 있다. 또한, 입출력부는 환경 정보를 기초로 생성한 상태 정보, 제어 정보 등을 출력할 수 있다. 또한, 입출력부는 적어도 하나의 검출 장치 및 적어도 하나의 환경 제어 장치 각각의 동작과 관련한 상태 정보를 출력할 수 있다. 다음 구성으로, 저장부는 적어도 하나의 검출 장치로부터 수신한 환경 정보를 누적 저장할 수 있다. 즉, 저장부는 각 검출 장치로부터 수신한 온도, 산소(O2)농도 및 이산화탄소(CO2)농도 등을 각 검출 장치 별로 저장할 수 있다. 또한, 저장부는 상태 정보를 생성하기 위한 알고리즘, 제어 정보를 생성 하기 위한 알고리즘 등을 저장할 수 있다. 다음 구성으로, 기계 학습부는 적어도 하나의 검출 장치로부터 수신한 환경 정보를 저장부에 누 적 저장시킬 수 있다. 즉, 기계 학습부는 적어도 하나의 검출 장치로부터 수신한 온도, 습도, 산소 (O2)농도 및 이산화탄소(CO2)농도를 저장부에 누적 저장시켜 빅 데이터(big data)를 구성할 수 있다.또한, 기계 학습부는 구성된 빅 데이터를 기반으로 인공 지능(Artificial Intelligence, AI)을 기계 학습 (machine learning) 시킬 수 있다. 예를 들어, 기계 학습부는 누적 저장된 환경 정보를 기초로 온도 및 습 도와 곰팡이와의 상관 관계를 기계 학습시킬 수 있다. 여기서, 기계 학습부는 온도 및 습도와, 곰팡이와의 상관 관계를 기계 학습시키기 위하여, 누적 저장된 온도 및 습도 이외에도, 해당 온도 및 습도가 검출된 장소에 대한 정보, 후술할 상태 정보 생성부에 의해 추정된 정보가 다시 학습 모델로 입력될 수 있다. 다음 구성으로, 상태 정보 생성부는 적어도 하나의 검출 장치로부터 검출된 환경 정보를 기초로 상태 정보를 생성할 수 있다. 여기서, 상태 정보는 환경 정보가 검출된 각 검출 장치가 위치한 관리 영역에 대 한 환경과 관련한 정보가 될 수 있다. 예를 들어, 상태 정보 생성부는 20 ~ 30℃의 온도와 60 ~ 80% 습도 가 사전 설정된 시간 동안 유지되는 경우, 곰팡이가 발생된 것으로 판단할 수 있다. 또한, 상태 정보 생성부는 기계 학습부에 의해 누적 저장된 환경 정보를 기초로 온도 및 습도와 곰팡 이와의 상관 관계가 기계 학습(machine learning)된 인공 지능(Artificial Intelligence, AI)을 이용하여, 곰 팡이 발생 여부를 상태 정보로 추정할 수 있다. 즉, 상태 정보 생성부는 누적 저장된 온도 및 습도 정보를 기계 학습부에 의해 학습된 인공지능 모델에 입력하여, 곰팡이 발생 여부를 추정할 수 있다. 또한, 상태 정보 생성부는 복수의 검출 장치 중 특정 검출 장치의 환경 정보 변화량이 사전 설정된 값보다 높은 경우, 환경 정보 변화량이 사전 설정된 값보다 높은 것을 의미하는 이벤트 신호를 생성하여 사용자 단말기에 전송할 수 있다. 이때, 상태 정보 생성부는 복수의 검출 장치 중 특정 검출 장치의 환경 정보 변화량이 사전 설정된 값보다 높은 경우, 특정 검출 장치와 가장 근거리에 위치한 다른 검출 장치로부터 검출된 환경 정보를 수신할 수 있다. 그리고, 상태 정보 생성부는 다른 검출 장치로부터 수신한 환경 정보를 기초로 환경 정보 변화량 이 사전 설정된 값보다 높은 검출 장치의 검출 오류 여부를 판단할 수 있다. 예를 들어, 상태 정보 생성부는 특정 검출 장치의 온도가 20°에서 70°로 급격하게 변한 경우, 화재가 발 생한 것으로 판단할 수 있다. 따라서, 상태 정보 생성부는 화재 발생에 관한 이벤트 신호를 생성하여 사용 자 단말기에 전송할 수 있다. 이때, 상태 정보 생성부는 가장 근거리에 위치한 다른 검출 장치의 온 도와 특정 검출 장치의 온도를 비교할 수 있다. 상태 정보 생성부는 다른 검출 장치와의 온도 차이가 사전 설정된 값보다 높은 경우, 오류로 판단하고, 사용자 단말기에 오류에 관한 이벤트 신호를 다시 생성하여 전송할 수 있다. 또한, 상태 정보 생성부는 검출 장치로부터 수신한 환경 정보를 누적 저장하고, 누적 저장된 환경 정 보를 기초로 환경 정보의 변화 주기를 통해 해당 관리 영역의 활용 빈도를 나타내는 빈도 지수를 산출할 수 있 다. 예를 들어, 상태 정보 생성부는 서랍장에 설치된 검출 장치로부터 온도 및 습도에 대한 정보를 지속적으로 수신하고, 일정 시간 동안의 온도 및 습도 변화 횟수를 체크하고, 변화 횟수에 따라 특정 점수를 부여한 빈도 지수를 산출할 수 있다. 즉, 상태 정보 생성부는 온도 및 습도 변화량을 통해 서랍장을 열고 닫는 횟수를 추정할 수 있다. 여기서, 빈도 지수는 사용자가 서랍장을 열고 닫는 횟수에 따른 활용 빈도를 나타낼 수 있다. 여기서, 상태 정보 생성부는 시간대 별로 활용 빈도를 판단할 수 있다. 즉, 상태 정보 생성부는 누적 저장된 환경 정보를 기초로 환경 정보의 변화 주기를 통해 해당 관리 영역의 시간별 활용 빈도를 나타내는 시간 별 빈도 지수를 산출할 수 있다. 그리고, 상태 정보 생성부는 빈도 지수가 사전 설정된 값보다 차이가 날 경우, 긴급 상황에 대한 이벤트 신호를 생성하여 사용자 단말기에 전송할 수 있다. 여기서, 상태 정보 생성부는 사용자의 설정에 따라, 이벤트 신호를 보호자가 소지하고 있는 보호자 단말기 또는 긴급 상황을 관리하는 기관 등에 이벤트 신호를 전송하도록 설정될 수 있다. 예를 들어, 상태 정보 생성부는 사용자가 서랍장을 특정 시간동안 평균 10회 열고 닫는데 반해, 특정 시간 동안에 서랍장을 여닫는 횟수가 0회일 경우, 사용자가 응급 상황인 것으로 판단하고, 사용자 단말기에 긴 급 상황에 대한 이벤트 신호를 생성하여 전송할 수 있다. 또한, 상태 정보 생성부는 적어도 하나의 검출 장치로부터 수신한 온도 및 습도를 포함하는 환경 정 보의 변화량이 사전 설정된 값보다 높고, 변화량이 사전 설정된 값보다 높은 환경 정보가 일정 시간 유지되는 경우, 관리 영역에 구비된 도어가 개방된 것으로 판단하고, 도어 개방에 대한 이벤트 신호를 생성하여 상기 사용자 단말기에 전송할 수 있다. 예를 들어, 상태 정보 생성부는 옷장에 설치된 검출 장치로부터 검출된 온도 및 습도 중 적어도 하나의 변 화량이 사전 설정된 값보다 높은 경우, 옷장 문이 열린 것으로 판단할 수 있다. 이때, 상태 정보 생성부는 외부로부터 계절과 관련한 계절 정보를 수신하고, 수신된 계절 정보를 기준으로 옷장 문이 열린 상태인지 닫힌 상태인지 판단할 수 있다. 여기서, 계절 정보는 계절별 평균 온도 및 습도가 될 수 있다. 즉, 상태 정보 생성부 는 외부 온도 및 습도를 기초로 검출 장치로부터 검출된 온도 및 습도와 비교하여 해당 도어의 열림 또는 닫힘을 판단할 수 있다. 그리고, 상태 정보 생성부는 옷장 문이 열린 상태로 사전 설정된 시간 동안 유지되는 경우, 옷장 문이 개 방된 정보가 포함된 이벤트 신호를 생성하여 사용자 단말기에 전송할 수 있다. 또한, 상태 정보 생성부는 거리를 기반으로 복수의 거주지를 그룹핑(grouping)하고, 복수의 거주지 각각에 구비된 검출 장치로부터 각 거주지의 환경 정보 평균 값을 산출할 수 있다. 즉, 상태 정보 생성부는 거리 를 기반으로 인접한 거주지를 그룹핑하고, 인접한 거주지 각각의 환경 정보 평균 값을 산출할 수 있다. 또한, 상태 정보 생성부는 복수의 거주지 중 생성된 환경 정보 평균 값이 사전 설정된 값보다 차이 나는 거주지를 검출하고, 해당 거주지와 대응하는 사용자 단말기에 맞춤형 정보를 제공할 수 있다. 예를 들어, 상태 정보 생성부는 그룹핑 된 거주지 중 특정 거주지의 습도가 인근 거주지의 습도보다 높은 경우, 해당 거지주에 거주하는 사용자 단말기에 \"환기가 필요 합니다\", \"건조기 작동이 필요합니다\"와 같은 이벤트 신 호를 사용자 단말기에 전송하거나, 후술할, 제어 정보 생성부를 통해 습도를 낮출 수 있는 기능을 갖 는 환경 제어 장치의 작동을 제어할 수 있다. 다음 구성으로, 제어 정보 생성부는 상태 정보 생성부에 의해 추정 결과, 곰팡이가 발생된 것으로 추 정된 경우, 적어도 하나의 환경 제어 장치를 개별적으로 제어하여 사전 설정된 시간 동안 자외선 (ultraviolet-C)을 조사하도록 하는 제어 정보를 생성할 수 있다. 하지만, 이에 한정된 것은 아니고, 제어 정보 생성부는 상태 정보에 따라 사전 설정된 제어 테이블(table)에 의해 송풍팬(blast fan), 커튼제어장치, 도 어제어장치, 제습장치, 발열장치 등을 제어하는 제어 정보를 생성하여 전송할 수 있다. 또한, 제어 정보 생성부는 환경 제어 장치에 제어 정보를 전송한 이후에 제어 정보에 따라 적어도 하 나의 환경 제어 장치의 동작이 완료되면, 검출 장치에 의해 누적 저장된 환경 정보를 갱신할 수 있다. 즉, 제어 정보 생성부는 관리 영역에 곰팡이가 발생된 것으로 판단되면, 설정된 시간 동안 자외선을 조사하도록 하고, 사전 설정된 시간동안 자외선 조사가 완료되면 곰팡이가 사라진 것으로 추정하고, 자외선 조 사를 중지시키는 제어 신호를 생성하여 환경 제어 장치에 전송하고, 다시 곰팡이 발생 여부를 판단하기 위 하여, 기존 누적된 환경 정보를 갱신할 수 있다. 이하, 상술한 바와 같은 관리 서버의 논리적 구성 요소들을 구현하기 위한 하드웨어에 대해 보다 구체적으 로 설명하기로 한다. 도 4는 본 발명의 일 실시예에 따른 관리 서버의 하드웨어 구성도이다. 도 4에 도시된 바와 같이, 관리 서버는 프로세서(processor, 350), 메모리(memory, 355), 송수신기 (transceiver, 360), 입출력장치(input/output device, 365), 데이터 버스(bus, 370) 및 스토리지(storage, 375)를 포함하여 구성될 수 있다. 프로세서는 메모리에 상주된 실내 환경 자동 관리 방법이 구현된 소프트웨어(380a)에 따른 명령어를 기초로, 관리 서버의 동작 및 기능을 구현할 수 있다. 메모리에는 실내 환경 자동 관리 방법이 구현 된 소프트웨어(380a)가 상주(loading)될 수 있다. 송수신기는 검출 장치로부터 검출된 환경 정보를 수신할 수 있다. 또한, 송수신기는 환경 정보를 기초로 생성한 상태 정보 및 제어 정보 중 적어도 하나를 환경 제어 장치 및 사용자 단말기 적어도 하나에 전송할 수 있다. 입출력장치는 관리 서버(30 0)의 동작에 필요한 데이터를 입력 받고, 환경 정보, 상태 정보 및 제어 정보 생성 결과를 출력할 수 있다. 데 이터 버스는 프로세서, 메모리, 송수신기, 입출력장치 및 스토리지와 연결되어, 각각의 구성 요소 사이가 서로 데이터를 전달하기 위한 이동 통로의 역할을 수행할 수 있다. 스토리지는 실내 환경 자동 관리 방법이 구현된 소프트웨어(380a)의 실행을 위해 필요한 애플리케이션 프 로그래밍 인터페이스(Application Programming Interface, API), 라이브러리(library) 파일, 리소스(resource)파일 등을 저장할 수 있다. 스토리지는 적어도 하나의 검출 장치로부터 수신한 환경 정보를 누적 저 장할 수 있다. 또한, 스토리지는 상태 정보를 생성하기 위한 알고리즘, 제어 정보를 생성하기 위한 알고리 즘 등을 저장할 수 있다. 메모리에 상주되거나 또는 스토리지에 저장된 실내 환경 자동 관리 방법을 구현하기 위한 소프트웨어 (380a, 380b)는 검출 장치로부터 거주지를 구획하는 복수의 공간 및 상기 복수의 공간 상에 위치하는 제품의 내 부를 포함하는 복수의 관리 영역 중 적어도 하나에 배치되고, 상기 관리 영역을 대상으로 개별적으로 환경 정보 를 검출하는 적어도 하나의 검출 장치로부터 환경 정보를 수신하는 단계, 상기 적어도 하나의 검출 장치로부터 상기 환경 정보를 수신하고, 상기 환경 정보를 분석하여 상기 관리 영역의 상태 정보를 생성하고, 상기 상태 정 보에 따라 상기 관리 영역의 환경을 제어하기 위한 제어 정보를 생성하는 관리 서버 및 상기 제어 정보를 수신 하고, 상기 적어도 하나의 검출 장치와 대응하는 상기 관리 영역에 배치되어 상기 관리 영역의 환경을 제어하는 적어도 하나의 환경 제어 장치에 제어 정보를 전송하는 단계를 실행시키기 위하여, 기록 매체에 기록된 컴퓨터 프로그램이 될 수 있다. 보다 구체적으로, 프로세서는 ASIC(Application-Specific Integrated Circuit), 다른 칩셋(chipset), 논 리 회로 및/또는 데이터 처리 장치를 포함할 수 있다. 메모리는 ROM(Read-Only Memory), RAM(Random Access Memory), 플래쉬 메모리, 메모리 카드, 저장 매체 및/또는 다른 저장 장치를 포함할 수 있다. 송수신기 는 유무선 신호를 처리하기 위한 베이스밴드 회로를 포함할 수 있다. 입출력장치는 키보드 (keyboard), 마우스(mouse), 및/또는 조이스틱(joystick) 등과 같은 입력 장치 및 액정표시장치(Liquid Crystal Display, LCD), 유기 발광 다이오드(Organic LED, OLED) 및/또는 능동형 유기 발광 다이오드(Active Matrix OLED, AMOLED) 등과 같은 영상 출력 장치 프린터(printer), 플로터(plotter) 등과 같은 인쇄 장치를 포 함할 수 있다. 본 명세서에 포함된 실시 예가 소프트웨어로 구현될 경우, 상술한 방법은 상술한 기능을 수행하는 모듈(과정, 기능 등)로 구현될 수 있다. 모듈은 메모리에 상주되고, 프로세서에 의해 실행될 수 있다. 메모리 는 프로세서의 내부 또는 외부에 있을 수 있고, 잘 알려진 다양한 수단으로 프로세서와 연결될 수 있다. 도 4에 도시된 각 구성요소는 다양한 수단, 예를 들어, 하드웨어, 펌웨어(firmware), 소프트웨어 또는 그것들의 결합 등에 의해 구현될 수 있다. 하드웨어에 의한 구현의 경우, 본 발명의 일 실시예는 하나 또는 그 이상의 ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 프로세서, 콘트롤러, 마이크로 콘트롤러, 마이크로 프로세서 등에 의해 구현될 수 있다. 또한, 펌웨어나 소프트웨어에 의한 구현의 경우, 본 발명의 일 실시예는 이상에서 설명된 기능 또는 동작들을 수행하는 모듈, 절차, 함수 등의 형태로 구현되어, 다양한 컴퓨터 수단을 통하여 판독 가능한 기록매체에 기록 될 수 있다. 여기서, 기록매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함 할 수 있다. 기록매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨 터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 예컨대 기록매체는 하드 디스크, 플로피 디스 크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD-ROM(Compact Disk Read Only Memory), DVD(Digital Video Disk)와 같은 광 기록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체 (Magneto-Optical Media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치를 포함한다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 이러한, 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어로서 작동하도록 구 성될 수 있으며, 그 역도 마찬가지이다. 이하, 상술한 관리 서버를 통한 실내 환경 자동 관리 방법에 대하여 구체적으로 설명하도록 한다. 도 5는 본 발명의 일 실시예에 따른 실내 환경 자동 관리 방법을 나타낸 순서도이다. 도 5를 참조하면, S110 단계에서 관리 서버는 복수의 검출 장치로부터 각각 설치된 관리 영역에 대한 환경 정보 를 수신할 수 있다. 여기서, 환경 정보는 온도 및 습도가 될 수 있다.다음으로, S120 단계에서 관리 서버는 복수의 검출 장치로부터 수신한 환경 정보를 각각 분석할 수 있다. 구체적으로, 관리 서버는 복수의 검출 장치부터 검출된 환경 정보를 기초로 상태 정보를 생성할 수 있다. 여기 서, 상태 정보는 환경 정보를 분석하여, 환경 정보가 검출된 각 검출 장치가 위치한 관리 영역에 대한 환경과 관련한 정보가 될 수 있다. 예를 들어, 관리 서버는 20 ~ 30℃의 온도와 60 ~ 80% 습도가 사전 설정된 시간 동 안 유지되는 경우, 곰팡이가 발생된 것으로 판단할 수 있다. 하지만, 이에 한정된 것은 아니고, 관리 서버는 누적 저장된 환경 정보를 기초로 온도 및 습도와 곰팡이와의 상 관 관계가 기계 학습(machine learning)된 인공 지능(Artificial Intelligence, AI)을 이용하여, 곰팡이 발생 여부를 상태 정보로 추정할 수 있다. 즉, 관리 서버는 누적 저장된 온도 및 습도 정보를 학습된 인공지능 모델 에 입력하여, 곰팡이 발생 여부를 추정할 수 있다. 다음으로, S130 단계에서 곰팡이가 발생되지 않은 경우, 관리 서버는 S120 단계로 돌아가 복수의 검출 장치로부 터 수신한 환경 정보를 지속적으로 분석할 수 있다. S130 단계에서 곰팡이가 발생된 경우, S140 단계에서 관리 서버는 환경 제어 장치를 제어하기 위한 제어 정보를 생성할 수 있다. 구체적으로, 관리 서버는 S120 단계에 의해 추정 결과, 곰팡이가 발생된 것으로 추정된 경우, 해당 검출 장치와 대응하는 환경 제어 장치를 제어하여 사전 설정된 시간 동안 자외선(ultraviolet-C)을 조사하도록 하는 제어 정 보를 생성할 수 있다. 하지만, 이에 한정된 것은 아니고, 관리 서버는 상태 정보에 따라 사전 설정된 제어 테이 블(table)에 의해 송풍팬(blast fan), 커튼제어장치, 도어제어장치, 제습장치, 발열장치 등을 제어하는 제어 정 보를 생성할 수 있다. 그리고, S150 단계에서 관리 서버는 환경 제어 장치에 제어 정보를 전송할 수 있다. 이때, 관리 서버는 제어 정 보를 전송한 이후에 제어 정보에 따라 환경 제어 장치의 동작이 완료되면, 검출 장치에 의해 누적 저장된 환경 정보를 갱신할 수 있다. 즉, 관리 서버는 관리 영역에 곰팡이가 발생된 것으로 판단되면, 설정된 시간 동안 자 외선을 조사하도록 하고, 사전 설정된 시간동안 자외선 조사가 완료되면 곰팡이가 사라진 것으로 추정하고, 자 외선 조사를 중지시키는 제어 신호를 생성하여 환경 제어 장치에 전송하고, 다시 곰팡이 발생 여부를 판단하기 위하여, 기존 누적된 환경 정보를 갱신할 수 있다. 이와 같이, 본 발명의 실시 예에 따른 실내 환경 자동 관리 방법에 따르면, 복수의 관리 영역 중 적어도 하나에 검출 장치를 배치하고, 검출 장치로부터 검출된 환경 정보를 분석하여 관리 영역을 제어하기 위한 제어 정보를 생성하여 각 관리 영역의 환경을 제어함으로써, 거주지 내에서 각 공간 또는 제품 내부의 환경을 효율적으로 관 리할 수 있다. 도 6 및 도 7은 본 발명의 일 실시예에 따른 실내 환경 관리 방법을 설명하기 위한 예시도이다. 도 6에 도시된 바와 같이, 복수의 검출 장치(100-1, 100-2, 100-3, 100-4)는 블루투스 통신을 통해 허브에 환경 정보를 전송하여, 허브를 통해 관리 서버로 환경 정보를 전송하도록 할 수 있다. 이때, 검출 장치(100-1, 100-2, 100-3, 100-4)는 검출된 환경 정보를 허브를 통해 관리 서버에 전송 하되, 허브와 블루투스 페어링(pairing)을 수행하는 과정에서 허브로부터 응답이 수신되지 않는 경우, 인접한 다른 검출 장치에 페어링을 시도할 수 있다. 즉, 검출 장치(100-1, 100-2, 100-3, 100-4)는 사용자에 의해 특정 관리 영역에 설치되면, 최초 관리 서버와 데 이터 송수신을 중계하는 허브와 블루투스 페어링을 수행하게 된다. 이때, 검출 장치(100-1, 100-2, 100-3, 100-4)는 페어링 과정에서 허브로부터 응답이 수신되지 않는 경우, 허브와의 거리가 블루투스 통신이 불가한 거리로 판단하고, 인접한 다른 검출 장치에 페어링을 시도할 수 있다. 여기서, 다른 검출 장치는 허브와의 페어링이 완료된 상태일 수 있다. 즉, 도 6에 도시된 바와 같이, 상대적으로 허브와 거리가 가까운 검출 장치(100-1, 100-4)들은 허브와 블루투스 통신 가능 거리 이내에 위치하여 페어링이 가능하지만, 허브와 상대적으로 거리가 먼 검출 장치 (100-2, 100-3)들은 블루투스 통신 가능 거리를 벗어나 페어링이 불가능할 수 있다. 이에 따라, 허브와와 상대적으로 거리가 먼 검출 장치(100-2, 100-3)는 상대적으로 허브와 거리가 가까 운 검출 장치(100-1, 100-4)와 페어링을 수행하고, 페어링 완료된 다른 검출 장치를 경유하여 허브에 환경 정보를 전송할 수 있다. 이에 따라, 본 발명은 검출 장치가 블루투스 통신 가능한 거리보다 허브와의 거리가 멀리 있는 경우에도 별 도의 추가 허브 설치 없이 환경 정보를 전송할 수 있다. 그리고, 관리 서버는 검출 장치부터 검출된 환경 정보를 기초로 상태 정보를 생성하고, 생성된 상태 정보를 기 초로 각 검출 장치(100-1, 100-2, 100-3, 100-4)가 위치한 관리 영역의 환경을 제어하는 환경 제어 장치의 동작 을 제어할 수 있다. 이때, 도 7에 도시된 바와 같이, 관리 서버는 거리를 기반으로 복수의 거주지를 그룹핑(grouping)하고, 복수의 거주지 각각에 구비된 검출 장치로부터 각 거주지의 환경 정보 평균 값을 산출할 수 있다. 이때, 각 거주지는 아파트(A)나 전원주택(B) 등의 각 세대가 될 수 있다. 즉, 관리 서버는 거리를 기반으로 인접한 거주지를 그룹핑(Group A, Group B)하고, 인접한 거주지 각각의 환경 정보 평균 값을 산출할 수 있다. 그리고, 관리 서버는 복수의 거주지 중 생성된 환경 정보 평균 값이 사전 설정된 값보다 차이 나는 거주지를 검 출하고, 해당 거주지와 대응하는 사용자 단말기에 맞춤형 정보를 제공할 수 있다. 이상과 같이, 본 명세서와 도면에는 본 발명의 바람직한 실시예에 대하여 개시하였으나, 여기에 개시된 실시예 외에도 본 발명의 기술적 사상에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은 본 발명이 속하는 기술 분 야에서 통상의 지식을 가진 자에게 자명한 것이다. 또한, 본 명세서와 도면에서 특정 용어들이 사용되었으나, 이는 단지 본 발명의 기술 내용을 쉽게 설명하고 발명의 이해를 돕기 위한 일반적인 의미에서 사용된 것이지, 본 발명의 범위를 한정하고자 하는 것은 아니다. 따라서, 상술한 상세한 설명은 모든 면에서 제한적으로 해석되 어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적해석에 의해 선정 되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2023-0019357", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 실내 환경 자동 관리 시스템의 구성도이다. 도 2는 본 발명의 다른 실시예에 따른 실내 환경 자동 관리 시스템의 구성도이다. 도 3은 본 발명의 일 실시예에 따른 관리 서버의 논리적 구성도이다. 도 4는 본 발명의 일 실시예에 따른 관리 서버의 하드웨어 구성도이다.도 5는 본 발명의 일 실시예에 따른 실내 환경 자동 관리 방법을 나타낸 순서도이다. 도 6 및 도 7은 본 발명의 일 실시예에 따른 실내 환경 자동 관리 방법을 설명하기 위한 예시도이다."}
