{"patent_id": "10-2022-0113611", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0013628", "출원번호": "10-2022-0113611", "발명의 명칭": "콩을 분류하는 방법 및 이를 지원하는 전자 장치", "출원인": "주식회사 마인드포지", "발명자": "황태진"}}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,카메라 모듈; 및적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는,상기 카메라 모듈을 통하여, 콩에 대한 복수의 이미지들을 획득하고,상기 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하고, 및상기 확률들에 기반하여, 상기 콩을 분류하도록 구성된 전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 카메라 모듈은 복수의 카메라 모듈들을 포함하고,상기 적어도 하나의 프로세서는,상기 복수의 카메라 모듈들을 통하여, 상기 콩의 서로 다른 면들에 대한 복수의 이미지들을 획득하도록 구성된전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,미러(mirror)를 더 포함하고,상기 적어도 하나의 프로세서는,상기 카메라 모듈을 통하여, 상기 콩의 일면에 대한 이미지 및 상기 미러에 의한 상기 콩의 상기 일면과 다른면에 대한 이미지를 획득하도록 구성된 전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 적어도 하나의 프로세서는,상기 콩이 이동하는 동안, 상기 카메라 모듈을 통하여, 서로 다른 시간들에서 상기 콩에 대한 복수의 이미지들을 획득하도록 구성된 전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,적어도 하나의 패치를 더 포함하고,공개특허 10-2024-0013628-3-상기 적어도 하나의 프로세서는,상기 카메라 모듈을 통하여 상기 적어도 하나의 패치에 대한 이미지를 획득하고, 및상기 적어도 하나의 패치에 대한 이미지에 기반하여, 상기 카메라 모듈의 자동 화이트 밸런스(auto whitebalance) 및/또는 자동 색 보정(auto color correction)과 관련된 설정을 설정하도록 구성된 전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 적어도 하나의 프로세서는,상기 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하는 경우, 상기 제 1 이미지에서 상기 콩이 상기복수의 분류 항목들 각각에 속할 제 1 확률들을 산출하고, 상기 제 2 이미지에서 상기 콩이 상기 복수의 분류항목들 각각에 속할 제 2 확률들을 산출하고,상기 제 1 확률들 중에서 가장 높은 제 3 확률을 가지는 제 1 분류 항목을 확인하고, 상기 제 2 확률들 중에서가장 높은 제 4 확률을 가지는 제 2 분류 항목을 확인하고, 및상기 제 1 분류 항목 및 상기 제 2 분류 항목에 기반하여, 상기 콩을 분류하도록 구성된 전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,적어도 하나의 프로세서는,상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 지정된 분류 항목에 해당하는지 여부를 확인하고, 및상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 상기 지정된 분류 항목에 해당하는 경우, 상기 지정된 분류 항목에 대응하는 제 1 임계 값에 기반하여, 상기 콩을 분류하도록 구성된 전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 적어도 하나의 프로세서는,상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 정상두에 해당하는지 여부, 상기 제 1 분류 항목의 상기제 3 확률 및 상기 제 2 분류 항목의 제 4 확률 간 차이가 제 2 임계 값 이상인지 여부, 및/또는 상기 제 1 분류 항목 및 상기 제 2 분류 항목의 가중치들에 기반하여, 상기 콩을 분류하도록 구성된 전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 적어도 하나의 프로세서는,사용자 입력에 기반하여, 상기 제 1 임계 값, 상기 제 2 임계 값, 및/또는 상기 가중치들을 설정하도록 구성된전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,공개특허 10-2024-0013628-4-상기 적어도 하나의 프로세서는,사용자 별로 학습된 학습 데이터에 기반하여, 상기 제 1 임계 값, 상기 제 2 임계 값, 및/또는 상기 가중치들을설정하도록 구성된 전자 장치."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에서 콩을 분류하는 방법에 있어서,상기 전자 장치의 카메라 모듈을 통하여, 콩에 대한 복수의 이미지들을 획득하는 동작;상기 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하는 동작; 및상기 확률들에 기반하여, 상기 콩을 분류하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 콩에 대한 상기 복수의 이미지들을 획득하는 동작은,상기 전자 장치의 복수의 카메라 모듈들을 통하여, 상기 콩의 서로 다른 면들에 대한 상기 복수의 이미지들을획득하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서,상기 콩에 대한 상기 복수의 이미지들을 획득하는 동작은,상기 카메라 모듈을 통하여, 상기 콩의 일면에 대한 이미지 및 상기 전자 장치의 미러에 의한 상기 콩의 상기일면과 다른 면에 대한 이미지를 획득하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 11 항에 있어서,상기 콩에 대한 상기 복수의 이미지들을 획득하는 동작은,상기 콩이 이동하는 동안, 상기 카메라 모듈을 통하여, 서로 다른 시간들에서 상기 콩에 대한 복수의 이미지들을 획득하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 11 항에 있어서,상기 카메라 모듈을 통하여 상기 전자 장치의 적어도 하나의 패치에 대한 이미지를 획득하는 동작; 및상기 적어도 하나의 패치에 대한 이미지에 기반하여, 상기 카메라 모듈의 자동 화이트 밸런스 및/또는 자동 색보정과 관련된 설정을 설정하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11 항에 있어서,공개특허 10-2024-0013628-5-상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하는 동작은,상기 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하는 경우, 상기 제 1 이미지에서 상기 콩이 상기복수의 분류 항목들 각각에 속할 제 1 확률들을 산출하고, 상기 제 2 이미지에서 상기 콩이 상기 복수의 분류항목들 각각에 속할 제 2 확률들을 산출하는 동작을 포함하고,상기 콩을 분류하는 동작은,상기 제 1 확률들 중에서 가장 높은 제 3 확률을 가지는 제 1 분류 항목을 확인하고, 상기 제 2 확률들 중에서가장 높은 제 4 확률을 가지는 제 2 분류 항목을 확인하는 동작; 및상기 제 1 분류 항목 및 상기 제 2 분류 항목에 기반하여, 상기 콩을 분류하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 콩을 분류하는 동작은,상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 지정된 분류 항목에 해당하는지 여부를 확인하는 동작; 및상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 상기 지정된 분류 항목에 해당하는 경우, 상기 지정된 분류 항목에 대응하는 제 1 임계 값에 기반하여, 상기 콩을 분류하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 콩을 분류하는 동작은,상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 정상두에 해당하는지 여부, 상기 제 1 분류 항목의 상기제 3 확률 및 상기 제 2 분류 항목의 제 4 확률 간 차이가 제 2 임계 값 이상인지 여부, 및/또는 상기 제 1 분류 항목 및 상기 제 2 분류 항목의 가중치들에 기반하여, 상기 콩을 분류하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,사용자 입력에 기반하여, 상기 제 1 임계 값, 상기 제 2 임계 값, 및/또는 상기 가중치들을 설정하는 동작을 더포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,사용자 별로 학습된 학습 데이터에 기반하여, 상기 제 1 임계 값, 상기 제 2 임계 값, 및/또는 상기 가중치들을설정하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0113611", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른 전자 장치는, 카메라 모듈 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세 서는, 상기 카메라 모듈을 통하여, 콩에 대한 복수의 이미지들을 획득하고, 상기 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하고, 및 상기 확률들에 기반하여, 상기 콩을 분류하도 록 구성될 수 있다. 본 개시는 서울특별시 서울산업진흥원 2021년도 인공지능 기술사업화 지원사업(CY210016) \"AI 기반 커피 원두 자 동분류 시스템\"을 통해 개발된 기술에 관한 것이다."}
{"patent_id": "10-2022-0113611", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 콩을 분류하는 방법 및 이를 지원하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2022-0113611", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "콩(예: 커피콩)은 다양한 종류들로 분류될 수 있다. 예를 들어, 콩은, 콩의 형상, 모양, 및/또는 색상 등에 따 라, 정상두, 흑두, 과발효두, 곰팡이두, 벌레먹은두, 건조두, 백화두, 기형두, 조개두, 파손된 두, 갈라진 두, 및 이물질과 같이, 12 종류로 분류될 수 있다. 전자 장치는, 카메라를 통하여 콩의 한 면에 대한 이미지를 획득하고 획득된 이미지에 기반하여 콩의 종류를 분 류하고 있다. 본 개시는 서울특별시 서울산업진흥원 2021년도 인공지능 기술사업화 지원사업(CY210016) \"AI 기반 커피 원두 자동분류 시스템\"을 통해 개발된 기술에 관한 것이다."}
{"patent_id": "10-2022-0113611", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "콩의 한 면에 대한 이미지에 기반하여 콩의 종류를 분류하는 경우, 콩을 정확하게 분류하지 못할 수 있다. 예를 들어, 콩의 한 면은 정상두에 해당하는 형상, 모양, 및/또는 색상을 가지고, 콩의 다른 면은 벌레먹은두에 해당 하는 형상, 모양, 및/또는 색상을 가질 수 있다. 이러한 경우, 콩의 한 면에 대한 이미지에 기반하여 콩의 종류 를 결정하는 경우, 콩의 종류가, 카메라를 통하여 촬영되는 콩의 면에 따라, 정상두 또는 벌레먹은두로 분류될 수 있다. 이에 따라, 콩의 서로 다른 면들을 촬영한 이미지들에 기반하여, 콩을 분류할 필요가 있다. 본 개시는 콩에 대한 복수의 이미지들에 기반하여 콩을 정확하게 분류할 수 있는, 콩을 분류하는 방법 및 이를 지원하는 전자 장치에 관한 것이다. 본 개시가 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2022-0113611", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 문서와 관련된 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0113611", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 전자 장치는, 카메라 모듈 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로 세서는, 상기 카메라 모듈을 통하여, 콩에 대한 복수의 이미지들을 획득하고, 상기 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하고, 및 상기 확률들에 기반하여, 상기 콩 을 분류하도록 구성될 수 있다. 일 실시예에서, 전자 장치에서 콩을 분류하는 방법은, 상기 전자 장치의 카메라 모듈을 통하여, 콩에 대한 복수 의 이미지들을 획득하는 동작, 상기 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하는 동작, 및 상기 확률들에 기반하여, 상기 콩을 분류하는 동작을 포함할 수 있다. 일 실시예에서, 컴퓨터 실행 가능 명령어들을 기록한 비-일시적인 컴퓨터 판독 가능 매체에 있어서, 상기 컴퓨 터 실행 가능 명령어들은, 실행 시, 적어도 하나의 프로세서를 포함하는 전자 장치가, 상기 카메라 모듈을 통하 여, 콩에 대한 복수의 이미지들을 획득하고, 상기 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하고, 및 상기 확률들에 기반하여, 상기 콩을 분류하도록 할 수 있다."}
{"patent_id": "10-2022-0113611", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 콩을 분류하는 방법 및 이를 지원하는 전자 장치는 콩의 서로 다른 면들에 대한 복수의 이미지 들에 기반하여 콩을 정확하게 분류할 수 있다."}
{"patent_id": "10-2022-0113611", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에 기재된 실시예는 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 다양한 실시예들에 따 르면, 사상을 명확히 설명하기 위한 것이므로, 본 개시가 이하에 기재된 실시예에 의해 한정되는 것은 아니며, 다양한 실시예들에 따르면, 본 개시의 범위는, 본 개시의 사상을 벗어나지 아니하는 수정예 또는 변형예를 포함 하는 것으로 해석되어야 한다. 본 개시에서 사용되는 용어는 본 개시에서의 기능을 고려하여 가능한 현재 널리 사용되고 있는 일반적인 용어를 선택하였으나 이는 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자의 의도, 관례 또는 새로운 기술의 출현 등에 따라 달라질 수 있다. 다만, 이와 달리 특정한 용어를 임의의 의미로 정의하여 사용하는 경우에는 그 용어의 의미에 관하여 별도로 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌 그 용어가 가진 실질적인 의미와 본 개시의 전반에 걸친 내용을 토대로 해석되어야 한다. 본 개시에 첨부된 도면은 본 개시를 용이하게 설명하기 위한 것으로 도면에 도시된 형상은 다양한 실시예들에 따르면, 이해를 돕기 위하여 필요에 따라 과장되어 표시된 것일 수 있으므로 본 개시가 도면에 의해 한정되는 것은 아니다. 본 개시에서 본 개시에 관련된 공지의 구성 또는 기능에 대한 구체적인 설명이 요지를 흐릴 수 있다고 판단되는 경우에 이에 관한 자세한 설명은 필요에 따라 생략하기로 한다. 본 개시의 다양한 실시예들 및 이에 사용된 용어들은 본 개시에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",\"A 또는 B 중 적어도 하나,\"\"A, B 또 는 C,\" \"A, B 및 C 중 적어도 하나,\"및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해 당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \" 제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 개시에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들 면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 개시의 실시예들에 기재된 기기(machine)의 동작들은, 기기에 의해 읽을 수 있는 기록 매체(또는 저장 매체 (storage medium))에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기의 제어 회로(예: 프로세서)는, 기록 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시 적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체 에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 개시에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있다. 다양한 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통 합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수 의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 1은, 일 실시예에 따른, 전자 장치에 대한 평면도이다. 도 2는, 일 실시예에 따른, 전자 장치에 대한 측면도이다. 도 1 및 도 2를 참조하면, 일 실시예에서, 전자 장치는, 회전 부재(110, 121, 122), 카메라 모듈, 회전판, 디스플레이 모듈(미도시)(예: 도 7의 디스플레이 모듈), 메모리(미도시)(예: 도 7의 메모리 ), 및/또는 프로세서(미도시)(예: 도 7의 프로세서)을 포함할 수 있다. 일 실시예에서, 회전 부재는, 회전 부재의 중심 부분을 형성하는 제 1 부분, 제 1 부분 및 제 3 부분 과 연결되는 복수의 제 2 부분들(\"복수의 날개들\"로도 지칭됨), 및 회전 부재의 테두리를 형성하는 제 3 부분을 포함할 수 있다. 일 실시예에서, 제 1 부분, 복수의 제 2 부분들, 제 3 부분, 및 회전판에 의해, 복수의 공 간들(예: 141, 142, 143, 151, 152, 153)(이하, \"복수의 공간들\"로 지칭함)이 형성될 수 있다. 예를 들어, 도 1에 도시된 바와 같이, 제 1 부분, 복수의 제 2 부분들, 제 3 부분, 및 회전판에 의해, 12개의 복수의 공간들이 형성될 수 있다. 다만, 이에 제한되지 않는다. 예를 들어, 복수의 공간들의 개수는 복 수의 제 2 부분들의 개수와 동일할 수 있다. 예를 들어, 복수의 공간들의 개수는 12 미만이거나 12를 초과할 수 있다. 일 실시예에서, 콩을 분류하는 동작이 수행되는 동안, 복수의 공간들 마다 하나의 콩이 배치될 수 있다. 일 실시예에서, 복수의 공간들 중에서, 제 1 공간은 콩이 투입되는 공간일 수 있다. 일 실시예에서, 복수 의 공간들 중에서, 제 2 공간 상에 카메라 모듈이 배치될 수 있다. 예를 들어, 도 2에 도시된 바와 같이, 제 2 공간에 대하여 Z축으로 일정 거리 이격된 위치에 카메라 모듈이 배치될 수 있다. 일 실시예에서, 복수의 공간들 중에서 제 3 공간(예: 공간, 공간, 공간)은, 종류(또는 분류 항 목)이 결정된 콩이 배출되는 공간일 수 있다. 콩이 제 3 공간 각각으로부터 배출되도록, 회전판에서 제 3 공간에 대응하는 부분이, 프로세서의 제어에 의해, 오픈(open)될 수 있다. 회전판에서 제 3 공간에 대응하 는 부분이 오픈됨으로써, 제 3 공간에 홀(hole)이 형성되고, 형성될 홀을 통하여 분류된 콩은, 도 2에 도시된 바와 같이, 제 3 공간 아래 배치된 부재(\"배출구\"로도 지칭됨)에 수집될 수 있다. 도 2에서는 콩을 수집하기 위한 하나의 부재를 예시하고 있지만, 이에 제한되지 않으며, 콩이 분류될 종류의 개수에 기반하여, 분 류된 콩을 수집하기 위한 복수의 부재들이 전자 장치에 포함할 수 있다. 일 실시예에서, 회전 부재는, 프로세서의 제어에 의해, 회전판 상에서 시계 방향(또는 반시계 방향) 으로 회전될 수 있다. 예를 들어, 회전 부재는, 프로세서의 제어에 의해 구동 모터(미도시)가 구동되는 경 우, 구동 모터에 의해 시계 방향으로 회전될 수 있다. 일 실시예에서, 회전 부재는 지정된 시간 간격으로(예: 주기적으로) 회전될 수 있다. 예를 들어, 회전 부재는, 지정된 시간 마다, 회전하는 동작 및 회전을 중지하는 동작을 반복적으로 수행할 수 있다. 일 실시예에서, 회전 부재는, 지정된 시간 마다, 복수의 공간들 중 하나의 공간에 대응하는 각도 간격만큼 회전될 수 있다. 예를 들어, 회전 부재의 제 2 부분(예: 제 2 부분들 중 하나)은, 제 1 시간에, 도 1에 도시된 위치에 배치될 수 있다. 회전 부재는, 회전 부재의 제 2 부분이 제 1 시간 다음의 제 2 시간(예: 제 1 시간의 다음 주기에 해당하는 제 2 시간)에 회전 부재의 제 2 부분 (예: 제 2 부분들 중 하나)이 제 1 시간에 배치되었던 위치에 배치되도록, 회전될 수 있다. 회전 부재는 제 2 시간으로부터 지정된 시간 후 다시 회전될 수 있다. 일 실시예에서, 회전판은 회전 부재를 지지할 수 있다. 일 실시예에서, 회전판은 복수의 공간들 각각에 대응하는 영역들을 포함할 수 있다. 일 실시예에서, 회전 판의 일부 영역들은, 프로세서의 제어에 의해, 오픈(open) 또는 클로즈(close)될 수 있다. 예를 들어, 회전판의 일부 영역들 각각은, 복수의 공간들 중 제 3 공간(예: 공간, 공간, 공간) 각각에 배치된 콩을 배출하기 위하여 오픈될 수 있다. 예를 들어, 회전판의 일부 영역들 각각은, 회전판 이 회전하는 동안, 제 3 공간(예: 공간, 공간, 공간) 각각에 배치된 콩이 배출되지 않도록, 클로즈될 수 있다. 일 실시예에서, 회전판에서 오픈 또는 클로즈되는 영역들 각각은 콩의 분류 항목(또는 콩의 종류)에 대응 하는 영역일 수 있다. 예를 들어, 공간에 대응하는 회전판의 영역은, 프로세서에 의해 정상두로 분류된 콩이 배출되는 영역일 수 있다. 공간에 대응하는 회전판의 영역은, 프로세서에 의해 곰 팡이두로 분류된 콩이 배출되는 영역일 수 있다. 공간에 대응하는 회전판의 영역은, 프로세서에 의해 조개두로 분류된 콩이 배출되는 영역일 수 있다. 예를 들어, 회전 부재의 회전에 의해, 프로세서에 의해 정상두로 분류된 콩이 공간에 대응하는 회전판의 영역에 위치하는 경우, 공간에 대응하는 회전판의 영역은 오픈될 수 있다. 회전 부재의 회전에 의해, 프로세서에 의해 곰팡이두로 분류된 콩 이 공간에 대응하는 회전판의 영역에 위치하는 경우, 곰팡이두로 분류된 콩이 공간에 대응하는 회전판의 영역을 통하여 배출되지 않도록 공간에 대응하는 회전판의 영역은 클로즈될 수 있다. 회전 부재의 회전에 의해, 프로세서에 의해 곰팡이두로 분류된 콩이 공간에 대응하는 회전판의 영역에 위치하는 경우, 공간에 대응하는 회전판의 영역이 오픈됨으로써, 프로세서에 의해 곰팡 이두로 분류된 콩이 배출될 수 있다. 일 실시예에서, 카메라 모듈은, 회전 부재의 회전에 의해 콩이 카메라 모듈의 화각(화각 영역)에 위 치하는 경우, 콩에 대한 이미지를 획득할 수 있다. 예를 들어, 카메라 모듈은, 제 1 공간에 투입된 콩이 회전 부재의 회전에 의해, 카메라 모듈의 화각에 범위에 있는 제 2 공간에 위치하는 경우, 콩을 촬영함으로써 콩에 대한 이미지를 획득할 수 있다. 다만, 이에 제한되지 않는다. 예를 들어, 카메라 모듈 은, 회전 부재의 회전에 의해, 카메라 모듈의 화각에 범위에 있는 공간(예: 제 2 공간에 인접한 공간), 제 2 공간, 및 공간(예: 제 2 공간에 인접한 공간)에 위치하는 경우, 공간, 제 2 공간, 및 공간 각각에 배치된 콩을 촬영함으로써 콩에 대한 복수의 이미지들을 획득할 수 있다. 일 실시예에서, 카메라 모듈의 위치에 대응하는 제 2 공간(및 제 2 공간에 인접한 공간들)에 대 응하는 회전판의 영역은 투명한 영역으로 구현될 수 있다. 다만, 이에 제한되지 않으며, 회전판의 적 어도 일부 영역은 투명한 영역(예: 투명 판)으로 구현될 수 있다. 일 실시예에서, 회전판의 적어도 일부 영역은, 회전 부재의 회전에 의해, 콩이 구르도록 하는 마찰력을 가 진 재질로 구현될 수 있다. 예를 들어, 회전판의 적어도 일부 영역이 회전 부재가 회전판 상에서 회 전됨에 따라 콩이 구르도록 구현되는 경우, 카메라 모듈을 통하여 콩의 복수의 면들 각각에 대한 이미지가 획득될 수 있다. 일 실시예에서, 카메라 모듈에 의해 촬영되는 콩의 복수의 면들은, 각각, 서로 중첩되는 부분을 갖지 않거나, 중첩되는 부분을 가질 수 있다. 일 실시예에서, 전자 장치는, 카메라 모듈을 통하여, 콩에 대한 복수의 이미지들을 획득할 수 있다. 예를 들어, 전자 장치는, 카메라 모듈을 통하여, 콩의 복수의 면들 각각에 대한 복수의 이미지들을 획득할 수 있다. 도 1 및 도 2에서는, 전자 장치가 하나의 카메라를 포함하는 것으로 예시하고 있지만, 이 에 제한되지 않는다. 예를 들어, 전자 장치는 복수의 카메라 모듈들을 포함할 수 있다. 이하 도 4 내 지 도 6을 참조하여, 전자 장치가 콩에 대한 복수의 이미지들(예: 하나의 콩에 대한 복수의 이미지들)을 획득하는 방법에 대하여 보다 상세히 설명하도록 한다. 도 3은, 일 실시예에 따른, 복수의 카메라들을 포함하는 전자 장치를 나타내는 도면이다. 도 3을 참조하면, 일 실시예에서, 전자 장치는, 복수의 카메라 모듈들(131, 132)을 포함할 수 있다. 일 실시예에서, 전자 장치는, 콩의 일면(예: 콩의 상면)을 촬영하기 위한 제 1 카메라 모듈 및 콩의 상기 일면과 다른 일면(예: 콩의 하면)을 촬영하기 위한 제 2 카메라 모듈을 포함할 수 있다. 일 실시예에서, 콩의 하면을 촬영하기 위한 제 2 카메라 모듈이 회전판 아래 배치되는 경우, 제 2 카메라 모듈이 회전판 상에 배치된 콩을 촬영할 수 있도록, 제 2 카메라 모듈에 대응하는 회전판의 영역(예: 제 2 카메라 모듈의 화각의 중심을 나타내는 라인이 회전판과 교차하는 지점을 포함하는 회전판의 영 역)은 투명 판으로 구현될 수 있다. 일 실시예에서, 참조 부호 301에 도시된 바와 같이, 전자 장치는 회전 부재의 일 면에 수직하게 형성되는 라인 상에 배치되는 제 1 카메라 모듈 및 제 2 카메라 모듈을 포함할 수 있다. 제 1 카메라 모듈 및 제 2 카메라 모듈은, 각각, 화각들(331, 332) 내에 배치된 콩의 상면 및 콩의 하면을 동시에 촬 영함으로써, 콩의 상면에 대한 제 1 이미지 및 콩의 하면에 대한 제 2 이미지를 획득할 수 있다. 제 1 카메라 모듈 및 제 2 카메라 모듈은, 회전 부재가 회전하는 동안, 회전 부재(예: 회전 부재의 제 2 부분)에 의해 이동됨으로써 지정된 공간에 배치되는 콩의 상면에 대한 이미지 및 콩의 하면에 대한 이미지를 획득할 수 있다. 일 실시예에서, 참조 부호 302에 도시된 바와 같이, 전자 장치는 회전 부재의 일 면에 수직하게 형성되는 서로 다른 라인들 각각에 배치되는 제 1 카메라 모듈 및 제 2 카메라 모듈을 포함할 수 있다. 예를 들어, 제 1 카메라 모듈 및 제 2 카메라 모듈은, 상호 간에 화각들(예: 화각 영역들)(333, 334)이 중 첩되지 않도록, 배치될 수 있다. 제 1 카메라 모듈은, 제 1 콩이 제 1 카메라 모듈에 대응하는 회전판의 제 1 영역에 위치하는 경우, 제 1 콩의 일면에 대한 이미지를 획득할 수 있다. 제 1 콩 은 회전 부재의 회전에 의해 제 2 카메라 모듈에 대응하는 회전판의 제 2 영역으로 이동될 수 있다. 제 1 콩은 회전판의 제 1 영역으로부터 회전판의 제 2 영역으로 이동되는 동안, 회전판 의 마찰력에 의해(또는 회전 부재의 제 2 부분에 의해) 굴려질 수 있다. 제 2 카메라 모듈은, 제 1 콩이 굴려짐에 따라 회전판의 제 2 영역에 배치되는 경우, 제 1 콩의 상기 일면과 다른 일면에 대한 이미지를 획득할 수 있다. 도 4는, 일 실시예에 따른, 카메라 모듈 및 미러를 포함하는 전자 장치를 나타내는 도면이다. 도 4를 참조하면, 일 실시예에서, 전자 장치는, 하나의 카메라 모듈 및 미러(거울)을 포함할 수 있다. 일 실시예에서, 카메라 모듈은, 카메라 모듈의 화각 내에 배치된 콩의 일면(예: 콩의 상면)에 대한 이미지를 획득하고, 미러에 의한 상기 콩의 일면과 다른 면에 대한 상에 대한 이미지를 획 득할 수 있다. 일 실시예에서, 콩의 하면에 대한 상을 형성하는 미러가 회전판 아래 배치되는 경우, 카메 라 모듈이 미러에 의해 형성되는 콩의 하면에 대한 상을 촬영할 수 있도록, 미러에 대응하 는 회전판의 영역(예: 콩 및 미러에 반사된 광이 카메라 모듈로 입사하는 라인이 회전판 과 교차하는 지점을 포함하는 회전판의 영역)은 투명 판으로 구현될 수 있다. 일 실시예에서, 참조 부호 401에 도시된 바와 같이, 전자 장치는 하나의 카메라 모듈 및 미러를 이용하여, 카메라 모듈의 화각 내에 있는 콩의 복수의 면들 각각에 대응하는 복수의 이미지들을 획득할 수 있다.일 실시예에서, 참조 부호 401에 도시된 바와 같이, 전자 장치는 하나의 카메라 모듈 및 복수의 미러 들(422, 422)을 포함할 수 있다. 카메라 모듈은, 카메라 모듈의 화각 내에 위치하는 콩에 대한 이미지와 함께, 제 1 미러 및 제 2 미러 각각에 형성된 콩의 상들(442, 443)에 대한 이미 지들을 획득할 수 있다. 도 5는, 일 실시예에 따른, 복수의 이미지들을 획득하기 위한 전자 장치를 설명하기 위한 도면이다. 도 5를 참조하면, 일 실시예에서, 전자 장치는 하나의 카메라 모듈을 포함할 수 있다. 카메라 모듈 은, 서로 다른 시간들에서 획득된 콩(예: 하나의 콩)에 대한 복수의 이미지들을 획득할 수 있다. 일 실시예에서, 도 5에서, 회전 부재에 의해 콩이 이동됨에 따라, 콩의 위치(예: 콩이 배치되는 회전 판의 영역)은 변경될 수 있다. 카메라 모듈은, 제 1 시간에서, a1에 위치하는 콩에 대한 이미지 를 획득하고, 제 1 시간으로부터 지정된 시간 후의 제 2 시간에서, a2에 위치하는 콩에 대한 이미지를 획 득하고, 제 2 시간으로부터 지정된 시간 후의 제 3 시간에서, a3에 위치하는 콩에 대한 이미지를 획득할 수 있다. 일 실시예에서, 콩의 위치들을 나타내는 a1, a2, 및 a3는, 각각, 도 1의 공간, 제 2 공간, 공 간에 대응할 수 있다. 예를 들어, 카메라 모듈은, 회전 부재에 의해 이동되는 콩이 카메라 모듈(13 0)의 화각 내에 위치하는 공간, 제 2 공간, 공간 각각에 배치되는 경우, 콩을 촬영함 으로써, 콩의 복수의 면들에 대한 이미지들을 획득할 수 있다. 도 6은, 일 실시예에 따른, 패치를 포함하는 전자 장치를 설명하기 위한 도면이다. 도 6을 참조하면, 일 실시예에서, 전자 장치는, 회전 부재(110, 121, 122), 복수의 카메라 모듈들(631, 632), 회전판, 디스플레이 모듈(미도시)(예: 도 7의 디스플레이 모듈), 메모리(미도시)(예: 도 7의 메모리), 프로세서(미도시)(예: 도 7의 프로세서) 외에, 적어도 하나의 패치(621, 622)를 더 포함할 수 있다. 일 실시예에서, 적어도 하나의 패치(621, 622)는, 회전 부재의 제 1 부분 및/또는 회전 부재의 제 2 부분 들에 배치될 수 있다. 일 실시예에서, 적어도 하나의 패치(621, 622)는, 복수의 카메라 모듈들에 의해 촬 영 가능하도록 배치될 수 있다. 예를 들어, 제 1 패치는 제 1 카메라 모듈에 의해 촬영 가능하도록 배치되고, 제 2 패치는 제 2 카메라 모듈에 의해 촬영 가능하도록 배치될 수 있다. 일 실시예에서, 전자 장치는, 적어도 하나의 패치(621, 622)를 이용하여, 밝기 값, 노출 값, 및/또는 색 온도를 포함하는, 카메라 모듈의 설정을 설정할 수 있다. 일 실시예에서, 전자 장치는, 콩에 대한 복수의 이미지들을 획득하는 동안, 적어도 하나의 패치(621, 622)를 이용하여, 자동 화이트 밸런스(auto white balance)를 수행할 수 있다. 예를 들어, 전자 장치는, 제 1 카메라 모듈을 통하여 제 1 패치(예: 화이트 색상을 가지는 패치)에 대한 제 1 이미지를 획득할 수 있다. 전자 장치는, 제 2 카메라 모듈을 통하여 제 2 패치(예: 제 1 패치와 동일한 화이트 색상 을 가지는 패치)에 대한 제 2 이미지를 획득할 수 있다. 전자 장치는, 제 1 이미지 및 제 2 이미지에 기반 하여, 제 1 카메라 모듈에 의해 획득될 이미지 및 제 2 카메라 모듈에 의해 획득될 이미지가 동일한 색 온도를 가지도록, 제 1 카메라 모듈 및/또는 제 2 카메라 모듈의 화이트 밸런스를 조정하기 위한 값을 설정할 수 있다. 전술한 예시에서는, 화이트 밸런스 조정을 위하여 패치(621, 622)를 이용하는 것으로 예시하고 있지만, 이에 제 한되지 않는다. 예를 들어, 패치(621, 622)를 대체하여 또는 추가적으로, 회전 부재 및/또는 회전판을 화 이트 색상으로 구현함으로써, 카메라 모듈의 화이트 밸런스를 설정하기 위한 값을 설정할 수 있다. 일 실시예에서, 전자 장치는, 적어도 하나의 패치(621, 622)를 이용하여, 자동 색 보정(auto color correction)을 수행할 수 있다. 예를 들어, 전자 장치는, 제 1 카메라 모듈을 통하여 제 1 패치(예: 제 1 화소 값(예: gray scale)을 가지는 레드(red) 색상의 패치)에 대한 제 1 이미지를 획득할 수 있다. 전자 장치는, 제 2 카메라 모듈을 통하여 제 2 패치(예: 제 1 패치와 동일한 제 1 화소 값을 가지는 레드 색상의 패치)에 대한 제 2 이미지를 획득할 수 있다. 전자 장치는, 제 1 이미지 및 제 2 이미지에 기 반하여, 제 1 카메라 모듈에 의해 획득될 이미지 및 제 2 카메라 모듈에 의해 획득될 이미지가 동일한 화소 값 의 레드 색상을 가지도록, 제 1 카메라 모듈 및/또는 제 2 카메라 모듈의 색상을 보정하기 위한 값을 설정할 수있다. 전술한 예시에서는, 색 보정을 위하여, 레드 색상을 이용하는 것으로 예시하고 있지만 이에 제한되지 않 는다. 예를 들어, 적어도 하나의 패치는, 레드 색상 외에, 그린(green) 색상 및/또는 블루(blue) 색상을 보정하 기 위하여 이용되는 패치들을 더 포함할 수 있다. 일 실시예에서, 전자 장치는, 적어도 하나의 패치(621, 622)를 더 포함함으로써, 제 1 카메라 모듈에 의해 획득될 이미지 및 제 2 카메라 모듈에 의해 획득될 이미지가, 동일한 색 온도 및/또는 색상(밝기 값 및/또는 노 출 값)을 가지도록, 할 수 있다. 일 실시예에서, 전자 장치는, 적어도 하나의 패치(621, 622)에 대한 이미지에 기반하여, 전자 장치 (예: 회전 부재 및/또는 회전판)에 묻을 수 있는 이물질의 정도를 판단할 수 있다. 전자 장치는, 상 기 이물질 정도에 기반하여, 사용자에게 전자 장치를 청소할 것을 알리는 알림을 출력할 수 있다. 도 7은, 일 실시예에 따른, 전자 장치의 블록 도면이다. 도 7을 참조하면, 일 실시예에서, 전자 장치는, 카메라 모듈, 디스플레이 모듈, 메모리, 및/또는 프로세서를 포함할 수 있다. 다만, 이에 제한되지 않으며, 전자 장치는, 도 1 내지 도 6을 통하여 설명한 바와 같이, 회전 부재, 회전판, 미러(421, 422, 423), 패치(621, 622), 분류된 콩을 수집 하기 위한 부재, 회전 부재를 회전시키기 위한 구동 모터, 및/또는 회전판의 적어도 일부 영역을 오 픈/클로즈하기 위한 구성을 더 포함할 수 있다. 일 실시예에서, 카메라 모듈은, 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예서, 카메라 모듈은 하나 이상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 일 실시예에서, 카메라 모듈(예: 카메라 모듈(130, 131, 132, 133, 134, 631, 632))은, 회전 부재가 회전 하는 동안, 콩에 대한 이미지를 획득할 수 있다. 예를 들어, 회전 부재가 지정된 시간 간격으로 회전하는 동안, 회전 부재(예: 회전 부재의 제 2 부분)에 의해 콩은 이동될 수 있다. 카메라 모듈은, 이동하는 콩의 복수 의 면들 각각에 대한 복수의 이미지들을 획득할 수 있다. 일 실시예에서, 디스플레이 모듈은, 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 일 실시예서, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생 되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 일 실시예에서, 디스플레이 모듈은, 콩을 분류하는 동작을 수행하는 동안, 다양한 정보를 표시할 수 있다. 디스플레이 모듈은, 콩을 분류하기 위한 모드를 설정하기 위한 사용자 입력을 수신하기 위하여, 다양한 화 면들을 표시할 수 있다. 디스플레이 모듈이 표시하는 정보 및/또는 화면에 대해서는 상세히 후술하도록 한 다. 일 실시예에서, 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련된 명령에 대 한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포 함할 수 있다. 일 실시예에서, 메모리는 콩을 분류하기 위한 동작을 수행하기 위한 정보를 저장할 수 있다. 메모리 가 저장하는 정보에 대하여 상세히 후술하도록 한다. 일 실시예에서, 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전 자 장치의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양 한 데이터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성요소로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미 지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 일 실시예에서, 프로세서는, 콩을 분류하기 위한 전반적인 동작을 제어할 수 있다. 일 실시예에서, 프로세 서는, 콩을 분류하기 위한 동작을 수행하기 위한 하나 이상의 프로세서들을 포함할 수 있다.이하, 도 8 내지 도 15를 참조하여, 프로세서가 콩을 분류하기 위하여 수행하는 동작에 대하여 상세히 설 명하도록 한다. 일 실시예에 따른 전자 장치는, 카메라 모듈 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로 세서는, 상기 카메라 모듈을 통하여, 콩에 대한 복수의 이미지들을 획득하고, 상기 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하고, 및 상기 확률들에 기반하여, 상기 콩 을 분류하도록 구성될 수 있다. 일 실시예에서, 상기 카메라 모듈은 복수의 카메라 모듈들을 포함하고, 상기 적어도 하나의 프로세서는, 상기 복수의 카메라 모듈들을 통하여, 상기 콩의 서로 다른 면들에 대한 복수의 이미지들을 획득하도록 구성될 수 있 다. 일 실시예에서, 상기 전자 장치는 미러(mirror)를 더 포함하고, 상기 적어도 하나의 프로세서는, 상기 카메라 모듈을 통하여, 상기 콩의 일면에 대한 이미지 및 상기 미러에 의한 상기 콩의 상기 일면과 다른 면에 대한 이 미지를 획득하도록 구성될 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 상기 콩이 이동하는 동안, 상기 카메라 모듈을 통하여, 서로 다른 시간들에서 상기 콩에 대한 복수의 이미지들을 획득하도록 구성될 수 있다. 일 실시예에서, 상기 전자 장치는 적어도 하나의 패치를 더 포함하고, 상기 적어도 하나의 프로세서는, 상기 카 메라 모듈을 통하여 상기 적어도 하나의 패치에 대한 이미지를 획득하고, 및 상기 적어도 하나의 패치에 대한 이미지에 기반하여, 상기 카메라 모듈의 자동 화이트 밸런스(auto white balance) 및/또는 자동 색 보정(auto color correction)과 관련된 설정을 설정할 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 상기 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하 는 경우, 상기 제 1 이미지에서 상기 콩이 상기 복수의 분류 항목들 각각에 속할 제 1 확률들을 산출하고, 상기 제 2 이미지에서 상기 콩이 상기 복수의 분류 항목들 각각에 속할 제 2 확률들을 산출하고, 상기 제 1 확률들 중에서 가장 높은 제 3 확률을 가지는 제 1 분류 항목을 확인하고, 상기 제 2 확률들 중에서 가장 높은 제 4 확 률을 가지는 제 2 분류 항목을 확인하고, 및 상기 제 1 분류 항목 및 상기 제 2 분류 항목에 기반하여, 상기 콩 을 분류하도록 구성될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는, 상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 지정된 분류 항목에 해당하는지 여부를 확인하고, 및 상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 상기 지정된 분류 항목에 해당하는 경우, 상기 지정된 분류 항목에 대응하는 제 1 임계 값에 기반하여, 상기 콩을 분류하도록 구 성될 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 정상두에 해당하는지 여부, 상기 제 1 분류 항목의 상기 제 3 확률 및 상기 제 2 분류 항목의 제 4 확률 간 차이가 제 2 임계 값 이상인지 여부, 및/또는 상기 제 1 분류 항목 및 상기 제 2 분류 항목의 가중치들에 기반하여, 상기 콩 을 분류하도록 구성될 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 사용자 입력에 기반하여, 상기 제 1 임계 값, 상기 제 2 임계 값, 및/또는 상기 가중치들을 설정하도록 구성될 수 있다. 일 실시예에서, 상기 적어도 하나의 프로세서는, 사용자 별로 학습된 학습 데이터에 기반하여, 상기 제 1 임계 값, 상기 제 2 임계 값, 및/또는 상기 가중치들을 설정하도록 구성될 수 있다. 도 8은, 일 실시예에 따른, 콩을 분류하는 방법을 설명하기 위한 흐름도이다. 도 8을 참조하면, 동작 801에서, 일 실시예에서, 프로세서는, 카메라 모듈을 통하여, 콩에 대한 복수 의 이미지들을 획득할 수 있다. 일 실시예에서, 프로세서는, 복수의 카메라 모듈들을 통하여, 콩(예: 하나의 콩)의 복수의 면들 각각에 대 한 복수의 이미지들을 획득할 수 있다. 예를 들어, 프로세서는, 도 3을 통하여 설명한 바와 같이, 콩의 일 면(예: 콩의 상면)을 촬영하기 위한 제 1 카메라 모듈(131, 133) 및 콩의 상기 일면과 다른 일면(예: 콩의하면)을 촬영하기 위한 제 2 카메라 모듈(132, 134)을 통하여, 콩의 일면에 대한 제 1 이미지 및 콩의 다른 일 면에 대한 이미지를 획득할 수 있다. 일 실시예에서, 프로세서는, 카메라 모듈 및 적어도 하나의 미러를 통하여, 콩(예: 하나의 콩)의 복 수의 면들 각각에 대한 복수의 이미지들을 획득할 수 있다. 예를 들어, 프로세서는, 도 4를 통하여 설명한 바와 같이, 카메라 모듈의 화각 내에 배치된 콩의 일면(예: 콩의 상면)에 대한 이미지를 획득하고, 미러 에 의한 상기 콩의 일면과 다른 면에 대한 상에 대한 이미지를 획득할 수 있다. 일 실시예에서, 프로세서는, 카메라 모듈을 통하여, 서로 다른 시간들에서 콩에 대한 복수의 이미지 들을 획득할 수 있다. 예를 들어, 도 5를 통하여 설명한 바와 같이, 회전 부재에 의해 콩이 이동됨에 따라, 콩 의 위치(예: 콩이 배치되는 회전판의 영역)는 변경될 수 있다. 프로세서는, 카메라 모듈을 통하 여, 제 1 시간에서, 회전판의 제 1 영역에 위치하는 콩에 대한 이미지를 획득하고, 제 1 시간으로부터 지 정된 시간 후의 제 2 시간에서, 회전판의 제 2 영역에 위치하는 콩에 대한 이미지를 획득하고, 제 2 시간 으로부터 지정된 시간 후의 제 3 시간에서, 회전판의 제 3 영역에 위치하는 콩에 대한 이미지를 획득할 수 있다. 전술한 예시들에서, 도 3, 도 4, 및 도 5를 통하여 콩에 대한 복수의 이미지들을 획득하는 동작들은 독립적 동 작들인 것으로 예시하고 있지만, 이에 제한되지 않는다. 예를 들어, 프로세서는, 도 3의 예시에서 복수의 카메라 모듈들을 통하여 콩을 촬영하는 동안, 도 5의 예시와 같이 복수의 카메라 모듈들 각각을 통하여. 서로 다른 시간들에서 콩에 대한 복수의 이미지들을 획득할 수 있다. 동작 803에서, 일 실시예에서, 프로세서는, 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출할 수 있다. 일 실시예에서, 프로세서는, 복수의 이미지들을 획득한 후, 콩의 종류를 결정하기 위하여, 복수의 이미지 들을 처리하는 동작을 수행할 수 있다. 일 실시예에서, 프로세서는, 복수의 이미지들 각각에서 콩을 검출할 수 있다. 예를 들어, 프로세서는, 콩을 검출하기 위한 지정된 알고리즘 또는 지정된 인공지능 모델을 이용하여, 복수의 이미지 들 각각에서, 콩을 검출할 수 있다. 예를 들어, 프로세서는, 복수의 이미지들 각각에서, 콩을 포함하는 영 역을 검출할 수 있다. 프로세서는, 복수의 이미지들 각각에서, 콩이 검출된 영역으로서, 콩을 포함하는 바 운딩 박스(bounding box)를 결정할 수 있다. 프로세서는, 복수의 이미지들 각각에서, 콩을 포함하는 영역 (예: 콩을 포함하는 바운딩 박스의 영역)을 크롭(crop)할 수 있다. 프로세서는, 복수의 이미지들로부터, 콩을 포함하는 크롭된 영역들(이하, \"크롭된 복수의 영역들\"로 지칭함)을 획득할 수 있다. 일 실시예에서, 프로세서는, 크롭된 복수의 영역들에 기반하여, 콩이 복수의 분류 항목들 각각에 속할 확 률들을 산출할 수 있다. 일 실시예에서, 콩과 관련된 복수의 분류 항목들은, 12개의 분류 항목들을 포함할 수 있다. 예를 들어, 콩과 관 련된 복수의 분류 항목들은 아래와 같을 수 있다. 표 1 콩의 분류 항목 (콩의 종류)분류 항목의 설명 정상두 결함(결점)이 없는 생두 흑두 생두의 내·외부의 표면이 완전 검은색으로 된 생두, 너무 늦게 수확하거나 흑과의 접 촉으로 발효되며 생김 과발효두 전체적으로 노르스름하거나 붉은 갈색을 띄는 두, 과숙하거나 과습 상태의 나무에서 발효, 체리나 땅에 떨어진 체리를 수확 하여 생김 곰팡이두 곰팡이가 피며 노란색이나 적갈색을 띄는 두. 주로 유통과정에서 보관 온도 및 습도가 맞지 않아 발생 벌레먹은두 주로 천공충에 의해 발생하고, 외관에 1개 이상의 구멍이 보이는 두 건조두 일부 혹은 전부 마른 껍질에 싸여 있는 형태의 두 백화두 하얗게 색이 바랜 두, 잘못된 건조나 보관, 가공 후 수분이 빠지며 발생 기형두 표면이 주름지고 은피 색깔이 녹색, 옅은 노란색을 띄는 두, 미성숙한 상태에서 수확 하여 발생조개두 얇은 조개껍질이나 귀 모양을 한 기형적인 생두로 유전적인 요인에 의해 발생 파손두 잘못된 펄핑이나 탁공의 과정 등으로 깨진 두 갈라짐두 끝이 갈라짐, 잘못된 건조과정에서 발생하는 두 이물질 돌, 나무, 유리 조각 등의 수확이나 선별과정에서 제거되지 못한 이물질 다만, [표 1]은, 콩을 분류하는 예시이며, 프로세서가, 콩을 분류하기 위하여 이용하는 분류 항목들은, [표 1]과 다를 수 있다. 일 실시예에서, 프로세서는, 인공지능 모델을 이용하여, 크롭된 복수의 영역들에 기반하여, 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출할 수 있다. 일 실시예에서, 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델 이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버를 통해 수행될 수도 있다. 학습 알고리즘은, 예 를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 일 실시예에서, 프로세서는, 복수의 이미지들 각각에서, 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출할 수 있다. 예를 들어, 프로세서는, 크롭된 복수의 영역들 각각에서, 콩의 일면의 형상, 모양, 및/또 는 색상에 기반하여, 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출할 수 있다. 예를 들어, 프로세서 는, 크롭된 복수의 영역들의 개수가 3개인 경우, 크롭된 3 개의 영역들 각각은, 콩의 일면을 포함할 수 있 다. 프로세서는, 크롭된 3개의 영역들 각각에서, 콩의 일면의 형상, 모양, 및/또는 색상에 기반하여, 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출할 수 있다. 전술한 예시에서는, 인공지능 모델을 이용하여, 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하는 것으 로 예시하고 있지만 이에 제한되지 않는다. 예를 들어, 프로세서는, 지정된 알고리즘을 이용하여, 크롭된 복수의 영역들에 기반하여, 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출할 수 있다. 동작 805에서, 일 실시예에서, 프로세서는, 콩이 복수의 분류 항목들 각각에 속할 확률들에 기반하여, 콩 을 분류할 수 있다. 일 실시예에서, 프로세서는, 콩이 복수의 분류 항목들 각각에 속할 확률들에 기반하여, 복수의 이미지들 (예: 크롭된 복수의 영역들) 별로, 가장 높은 확률을 가지는 콩의 분류 항목(종류)를 확인할 수 있다. 예를 들 어, 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하는 경우, 프로세서는, 제 1 이미지에 기반하 여 제 1 콩이 정상두에 속할 확률이 가장 높음을 확인하고 것으로 결정하고, 제 2 이미지에 기반하여 제 1 콩이 조개두에 속할 확률이 가장 높음을 확인할 수 있다. 일 실시예에서, 프로세서는, 복수의 이미지들에서 가장 높은 확률을 가지는 콩의 분류 항목들이 동일한 경 우, 상기 동일한 분류 항목을 콩의 종류로 결정할 수 있다. 예를 들어, 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하는 경우, 프로세서는, 제 1 이미지에서 제 1 콩이 정상두에 속할 확률이 가장 높고, 제 2 이미지에서 제 1 콩이 정상두에 속할 확률이 가장 높은 경우, 콩의 종류를 정상두로 결정할 수 있다. 일 실시예에서, 프로세서는, 복수의 이미지들에서 가장 높은 확률을 가지는 콩의 분류 항목들이 다른 경우 (예: 가장 높은 확률을 가지는 콩의 분류 항목들이 존재하는 경우), 가장 높은 확률을 가지는 콩의 종류가 지정 된 종류에 해당하는지 여부, 정상두로 확인된 이미지가 존재하는지 여부, 가장 높은 확률들 간의 차이, 및/또는 콩의 종류에 부여된 가중치에 기반하여, 콩의 종류를 결정할 수 있다. 이에 관련하여, 도 9 및 도 10을 참조하 여 상세히 설명하도록 한다. 도 9는, 일 실시예에 따른, 콩을 분류하는 방법을 설명하기 위한 흐름도이다. 도 9를 참조하면, 동작 901에서, 일 실시예에서, 프로세서는, 가장 높은 확률을 가지는 콩의 종류가 지정 된 종류에 해당하는지 여부를 확인할 수 있다. 일 실시예에서, 전술한 바와 같이, 프로세서는, 콩이 복수의 분류 항목들 각각에 속할 확률들에 기반하여, 복수의 이미지들(예: 크롭된 복수의 영역들) 별로, 가장 높은 확률을 가지는 콩의 분류 항목(종류)를 확인할 수 있다. 일 실시예에서, 프로세서는, 가장 높은 확률을 가지는 콩의 분류 항목들이, 사용자에 의해 지정된 분류 항 목들에 속하는지 여부를 확인할 수 있다. 예를 들어, 프로세서는, 사용자 입력에 기반하여, [표 1]의 분류 항목들 중에서, 흑두, 과발효두, 곰팡이두, 벌레먹은두, 및 이물질을 지정된 분류 항목들로 지정할 수 있다. 일 실시예에서, 흑두, 과발효두, 곰팡이두, 및 벌레먹은두를 이용하여 커피를 제조하는 경우, 맛없는 커피를 제조 할 가능성이 높은 분류 항목들일 수 있다. 이물질은, 커피를 제조하는 장치의 고장을 유발할 수 있는 분류 항목 일 수 있다. 동작 903에서, 일 실시예에서, 프로세서는, 지정된 종류에 대응하는 제 1 임계 값에 기반하여, 콩을 분류 할 수 있다. 일 실시예에서, 프로세서는, 가장 높은 확률을 가지는 콩의 종류가 지정된 종류에 해당하는 경우, 콩의 가 장 높은 확률 및 지정된 종류에 대응하는 제 1 임계 값(이하, \"제 1 임계 값\" 또는 \"제 1 임계 확률\"로 지칭 함)을 비교할 수 있다. 예를 들어, 프로세서는, 제 1 이미지에서 콩이 이물질에 속할 확률이 가장 높은 경 우, 상기 확률과 제 1 임계 값을 비교할 수 있다. 예를 들어, 프로세서는, 제 1 이미지에서 콩이 이물질에 속할 확률이 가장 높고 제 2 이미지에서 콩이 기형두에 속할 확률이 가장 높은 경우, 콩이 이물질에 속할 확률 및 제 1 임계 값을 비교할 수 있다. 일 실시예에서, 상기 제 1 임계 값은 상기 지정된 종류들에 대해서만 설정될 수 있다. 예를 들어, 제 1 임계 값 은, 흑두, 과발효두, 곰팡이두, 벌레먹은두, 및 이물질 각각에 대해서만 설정될 수 있다. 예를 들어, 흑두, 과 발효두, 곰팡이두, 벌레먹은두, 및 이물질 각각에 대하여 설정되는 제 1 임계 값들 중 적어도 일부는, 서로 다 른 값으로 설정될 수 있다. 일 실시예에서, 프로세서는, 적어도 하나의 이미지에서 지정된 종류에 해당하는 콩의 가장 높은 확률이 제 1 임계 값 이상인 경우, 콩의 지정된 종류를 제 1 임계 값에 대응하는 콩의 종류로 결정할 수 있다. 예를 들어, 프로세서는, 제 1 이미지에서 콩이 이물질에 속할 확률 40%(예: 제 1 이미지에서 콩이 이물질에 속할 확률 40%가 콩이 다른 분류 항목들에 속할 확률들 각각 보다 큰 경우)이고 제 1 임계 값이 37%인 경우, 콩의 종류를 이물질로 결정할 수 있다. 예를 들어, 제 1 이미지에서 콩이 이물질에 속할 확률이 40%(예: 제 1 이미지에서 콩 이 이물질에 속할 확률 40%가 콩이 다른 분류 항목들에 속할 확률들 각각 보다 큰 경우)이고 제 1 임계 값이 37%일 수 있다. 제 2 이미지에서 콩이 기형두에 속할 확률 50%(예: 제 2 이미지에서 콩이 기형두에 속할 확률 50%가 콩이 다른 분류 항목들에 속할 확률들 각각 보다 큰 경우)일 수 있다. 이와 같이, 제 2 이미지로부터 콩 이 기형두에 속할 확률 50%가 제 1 이미지로부터 콩이 이물질에 속할 확률 40% 보다 큰 경우에도, 프로세서 는, 콩이 이물질에 속할 확률이 40%가 이물질에 대응하는 제 1 임계 값 37% 이상임을 확인함에 기반하여, 콩의 종류를 기형두가 아닌 이물질로 결정할 수 있다. 일 실시예에서, 프로세서는, 가장 높은 확률을 가지는 콩의 종류가 지정된 종류에 해당하지 않거나, 가장 높은 확률을 가지는 콩의 종류가 지정된 종류에 해당하더라도 콩의 가장 높은 확률이 제 1 임계 값 미만인 경우, 정상두로 확인된 이미지가 존재하는지 여부, 가장 높은 확률들 간의 차이, 및/또는 콩의 종류에 부여된 가중치에 기반하여, 콩의 종류를 결정할 수 있다. 이에 대하여, 도 10을 참조하면, 보다 상세히 설명하도록 한 다. 도 10은, 일 실시예에 따른, 콩을 분류하는 방법을 설명하기 위한 흐름도이다. 도 10을 참조하면, 동작 1001에서, 일 실시예에서, 프로세서는, 정상두로 확인된 콩을 포함하는 이미지가 존재하는지 여부를 확인할 수 있다. 전술한 바와 같이, 일 실시예에서, 프로세서는, 가장 높은 확률을 가지는 콩의 종류가 지정된 종류에 해당 하지 않거나, 가장 높은 확률을 가지는 콩의 종류가 지정된 종류에 해당하더라도 지정된 종류에 해당하는 콩의 가장 높은 확률이 제 1 임계 값 미만인 경우, 정상두로 확인된 이미지가 존재하는지 여부를 확인할 수 있다.일 실시예에서, 프로세서는, 복수의 이미지들 중에서, 콩이 정상두에 속할 확률이 가장 큰 이미지가 존재 하는지 여부를 확인할 수 있다. 동작 1001에서 정상두로 확인된 콩을 포함하는 이미지가 존재하는 것으로 확인된 경우, 동작 1003에서, 일 실시 예에서, 프로세서는, 나머지 이미지에 포함된 콩의 종류에 기반하여 콩을 분류할 수 있다. 예를 들어, 프 로세서는, 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하는 경우, 제 1 이미지에서 콩이 속할 확률이 가장 큰 종류가 정상두임을 확인하고, 제 2 이미지에서 콩이 속할 확률이 가장 큰 종류가 기형두임을 확 인할 수 있다. 프로세서는, 나머지 이미지로서 제 2 이미지에서 가장 큰 확률을 가지는 기형두를 콩의 종 류로 결정할 수 있다. 동작 1001에서 정상두로 확인된 콩을 포함하는 이미지가 존재하지 않는 것으로 확인된 경우, 동작 1005에서, 일 실시예에서, 프로세서는, 복수의 이미지들에서 산출된 가장 큰 확률들 간 차이가 제 2 임계 값 이상인지 여부를 확인할 수 있다. 일 실시예에서, 프로세서는, 복수의 이미지들에서 산출된 가장 큰 확률들 간 차이를 확인할 수 있다. 예를 들어, 프로세서는, 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하는 경우, 제 1 이미지에서 콩 이 기형두에 속할 확률이 가장 큰 확률로서 70%이고, 제 2 이미지에서 콩이 파손두에 속할 확률이 가장 큰 확률 로서 87%임을 확인할 수 있다. 프로세서는, 상기 70% 및 상기 87% 간 차이가 17%임을 확인할 수 있다. 일 실시예에서, 복수의 이미지들에서 산출된 가장 큰 확률들 간 차이와, 제 2 임계 값(이하, \"제 2 임계 값\"으 로 지칭함)을 비교할 수 있다. 동작 1005에서 복수의 이미지들에서 산출된 가장 큰 확률들 간 차이가 제 2 임계 값 이상인 경우, 동작 1007에 서, 일 실시예에서, 프로세서는, 복수의 이미지들에서 산출된 가장 큰 확률들 중에서, 다른 확률에 비하여 높은 확률(예: 가장 높은 확률)을 가지는 분류 항목으로 콩을 분류할 수 있다. 일 실시예에서, 프로세서는, 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하는 경우, 제 1 이미 지에서 콩이 기형두에 속할 확률이 가장 큰 확률로서 70%이고, 제 2 이미지에서 콩이 파손두에 속할 확률이 가 장 큰 확률로서 87%임을 확인할 수 있다. 프로세서는, 상기 70% 및 상기 87% 간 차이가 17%임을 확인할 수 있다. 프로세서는, 상기 차이 17%가 제 2 임계 값 15% 이상임을 확인할 수 있다. 프로세서는, 70% 및 87% 중에서, 높은 확률 87%를 가진 파손두를 콩의 종류로서 결정할 수 있다. 동작 1005에서 복수의 이미지들에서 산출된 가장 큰 확률들 간 차이가 제 2 임계 값 미만인 경우, 동작 1009에 서, 일 실시예에서, 프로세서는, 콩의 분류 항목들 각각에 부여된 가중치들에 기반하여, 콩을 분류할 수 있다. 일 실시예에서, 프로세서는 콩의 분류 항목들 각각에 대하여 가중치(weight)(이하, \"가중치\"로 지칭함)(또 는 우선 순위)를 설정할 수 있다. 일 실시예에서, 프로세서는, 복수의 이미지들에서 산출된 가장 큰 확률들 및 가중치들에 기반하여, 콩을 분류할 수 있다. 예를 들어, 제 1 이미지에서 콩이 기형두에 속할 확률이 가장 큰 확률로서 80%이고, 제 2 이미 지에서 콩이 파손두에 속할 확률이 가장 큰 확률로서 87%임을 확인할 수 있다. 프로세서는, 기형두에 부여 된 가중치가 0.6이고 파손두에 부여된 가중치가 0.4인 경우, 기형두에 대하여 확률 80% 및 가중치 0.6을 곱한 값이, 파손두에 대하여 확률 87% 및 가중치 0.4를 곱한 값 보다 큰 경우, 콩의 종류를 기형두로 결정할 수 있다. 전술한 예시들에서, 프로세서가, 가장 높은 확률을 가지는 콩의 종류가 지정된 종류에 해당하는지 여부에 기반하여 콩을 분류하는 동작, 정상두로 확인된 이미지가 존재하는지 여부에 기반하여 콩을 분류하는 동작, 가 장 높은 확률들 간의 차이에 기반하여 콩을 분류하는 동작, 및 콩의 종류에 부여된 가중치에 기반하여 콩을 분 류하는 동작과 같은 순서로, 콩을 분류하는 동작들을 수행하는 것으로 예시하고 있지만, 이에 제한되지 않는다. 예를 들어, 프로세서는, 상기 순서와 다른 순서로, 전술한 콩을 분류하는 동작들을 수행할 수 있다. 예를 들어, 프로세서는, 전술한 콩을 분류하는 동작들 중 일부를 수행함 없이, 나머지 동작들을 수행함으로써, 콩을 분류할 수 있다. 도 11은, 일 실시예에 따른, 제 1 방식에 의해 콩을 분류하는 방법을 설명하기 위한 흐름도이다. 도 12는, 일 실시예에 따른, 제 1 방식에 의해 콩을 분류하는 방법을 설명하기 위한 예시도이다. 도 11 및 도 12를 참조하면, 일 실시예에서, 전자 장치는, 복수의 분류 단계들을 이용하는 방식(이하, \"제 1 방식\" 또는 \"케스케이드(cascade) 방식\"으로 지칭함)으로, 콩을 분류할 수 있다. 동작 1101에서, 일 실시예에서, 전자 장치는, 제 1 단계에서, 콩들을 정상두 및 비정상두로 분류할 수 있 다. 예를 들어, 전자 장치는, 도 8 내지 도 10을 통하여 설명한 동작들을 통하여, 콩들을 정상두 및 비정 상두(예: 정상두가 아닌 종류에 해당하는 콩들)로 분류할 수 있다. 일 실시예에서, 전자 장치는, 정상두로 분류된 콩들을 정상두에 대응하는 회전판의 영역을 통하여(예: 정상두에 대응하는 회전판의 영역을 오픈함으로써), 정상두로 분류된 콩들을 수집할 수 있다. 일 실시예에서, 전자 장치는, 비정상두로 분류된 콩들을 비정상두에 대응하는 회전판의 영역을 통하여(예: 비정상두에 대응하는 회전판의 영역을 오픈 함으로써), 비정상두로 분류된 콩들을 수집할 수 있다. 동작 1103에서, 일 실시예에서, 전자 장치는, 제 2 단계에서, 비정상두로 분류된 콩들을, 제 1 종류 및 제 2 종류로 분류할 수 있다. 예를 들어, 전자 장치는, 제 1 종류에 해당하는 콩들(예: 흑두, 과발효두, 곰팡 이두, 벌레먹은두, 및 이물질) 및 제 2 종류(예: 정상두 및 제 1 종류에 해당하지 않는 콩들)에 해당하는 콩들 을 분류할 수 있다. 일 실시예에서, 전자 장치는, 제 1 종류에 대응하는 회전판의 영역을 통하여(예: 제 1 종류에 대응하 는 회전판의 영역을 오픈함으로써), 제 1 종류로 분류된 콩들을 수집할 수 있다. 일 실시예에서, 전자 장 치는, 제 2 종류로 분류된 콩들을 제 2 종류에 대응하는 회전판의 영역을 통하여(예: 제 2 종류에 대 응하는 회전판의 영역을 오픈함으로써), 제 2 종류로 분류된 콩들을 수집할 수 있다. 동작 1105에서, 일 실시예에서, 전자 장치는, 제 3 단계에서, 제 2 종류로 분류된 콩들을, 제 3 종류 및 제 4 종류로 분류할 수 있다. 예를 들어, 전자 장치는, 제 3 종류에 해당하는 콩들(예: 커피 콩으로서 사 용 가능한 종류에 해당하는, 파손두, 갈라짐두, 및 기형두) 및 제 4 종류(예: 정상두, 제 1 종류, 및 제 3 종류 에 해당하지 않는 콩들)에 해당하는 콩들을 분류할 수 있다. 전술한 예시에서는, 제 1 단계, 제 2 단계, 및 제 3 단계와 같이, 3개의 단계를 예시하고 있지만, 이에 제한되 지 않는다. 예를 들어, 전자 장치는, 2개의 단계들 또는 4개 이상 단계들을 이용하여, 콩들을 분류할 수 있다. 전술한 예시에서는, 제 1 단계를 통하여 콩들이 정상두 및 비정상두로 분류되고, 제 2 단계를 통하여 비정상두 로 분류된 콩들이 제 1 종류 및 제 2 종류로 분류되고, 제 3 단계를 통하여 제 2 종류로 분류된 콩들이 제 3 종 류 및 제 3 종류로 분류되는 것으로 예시하고 있지만, 이에 제한되지 않는다. 예를 들어, 전자 장치는, 사 용자 입력에 기반하여, 제 1 단계, 제 2 단계, 및 제 3 단계 각각의 단계에서 분류할 콩의 종류를 선택할 수 있 다. 일 실시예에서, 전자 장치가 복수의 단계들(예: 제 1 단계, 제 2 단계, 및 제 3 단계)를 이용하여, 콩들을 분류함으로써, 전자 장치의 구조적 한계로 인한 크기의 제약 및 저장 용기의 제약을 해소할 수 있다. 일 실시예에서, 전자 장치는, 사용자 입력에 기반하여, 콩을 분류하는 복수의 단계들(예: 제 1 단계, 제 2 단계, 및 제 3 단계)를 선택적으로 수행함으로써, 사용자가 원하는 종류의 콩들만을 분류할 수 있다. 일 실시예에서, 프로세서는, 참조 부호 1201에 도시된 바와 같이, 디스플레이 모듈을 통하여, 복수의 콩의 종류들에 대응하는 복수의 오브젝트들(1231, 1232, 1233, 1234, 1235, 1236, 1237, 1238, 1239)을 포함하 는 화면을 표시할 수 있다. 프로세서는, 정상두에 대응하는 오브젝트를 선택하는 사용자 입력 에 기반하여, 콩들을 정상두 및 비정상두로 분류하는 동작을 수행할 수 있다. 화면에서, 슬롯 1은 사용자 입력에 의해 선택된 오브젝트에 대응하는 정상두로 분류될 콩들이 배출되는 배출구에 대응하는 오 브젝트일 수 있다. 화면에서, 오브젝트는 사용자 입력에 의해 선택된 콩의 종류를 제외한 나머지 콩의 종류(예: 선택되지 않은 분류 항목들)를 나타내는 오브젝트(예: 복수의 오브젝트들(1232, 1233, 1234, 1235, 1236, 1237, 1238, 1239)에 대응하는 분류 항목들을 나타내는 오브젝트)일 수 있다. 화면에서, 슬 롯 2는 사용자 입력에 의해 선택되지 않은 분류 항목들의 종류들의 콩들이 배출되는 배출구에 대응하는 오브젝트일 수 있다. 일 실시예에서, 프로세서는, 참조 부호 1202에 도시된 바와 같이, 디스플레이 모듈을 통하여, 복수의 콩의 종류들에 대응하는 복수의 오브젝트들(1231, 1232, 1233, 1234, 1235, 1236, 1237, 1238, 1239)을 포함하는 화면을 표시할 수 있다. 프로세서는, 정상두에 대응하는 오브젝트, 건조두/백화두에 대응 하는 오브젝트, 기형두에 대응하는 오브젝트, 조개두에 대응하는 오브젝트, 및 파손/갈라진 두에 대응하는 오브젝트를 선택하는 사용자 입력에 기반하여, 콩들을 상기 선택된 오브젝트들에 대응하는 종류들 및 나머지 종류들로 분류하는 동작을 수행할 수 있다. 도 13은, 일 실시예에 따른, 제 2 방식에 의해 콩을 분류하는 방법을 설명하기 위한 예시도이다. 도 13을 참조하면, 일 실시예에서, 전자 장치는, 제 1 임계 값, 제 2 임계 값, 및/또는 가중치를 사용자 입력에 의해 설정하는 방식(이하, \"제 2 방식\" 또는 \"유저 모드\"로 지칭함)을 이용하여, 콩을 분류할 수 있다. 일 실시예에서, 프로세서는, 디스플레이 모듈을 통하여, 제 1 임계 값을 설정하기 위한 화면을 표시 할 수 있다. 예를 들어, 프로세서는, 디스플레이 모듈을 통하여, 복수의 분류 항목들에 대응하는 복 수의 오브젝트들(1321, 1322. 1323, 1324, 1325), 제 1 임계 값을 설정하기 위한 오브젝트 및 오브젝트 가 이동되는 바(bar), 슬롯 1, 슬롯 2, 및/또는 오브젝트을 포함하는 화면 을 표시할 수 있다. 일 실시예에서, 프로세서는, 오브젝트를 이동시키는 사용자 입력(예: 드래그 입력)에 기반하여, 선 택된 오브젝트(예: 오브젝트)의 분류 항목(예: 정상두)에 대응하는 제 1 임계 값의 강도를 설정할 수 있 다. 예를 들어, 프로세서는, 제 1 임계 값의 강도가 \"약\"으로 설정된 경우, 제 1 임계 값을 60%로 설정할 수 있다. 프로세서는, 제 1 임계 값의 강도가 \"약\"으로 설정된 경우, 복수의 이미지들 중에서 가장 높은 확률을 가진 지정된 분류 항목의 상기 확률이 60% 이상인 적어도 하나의 이미지가 존재하는 경우, 콩의 종류를 상기 지정된 분류 항목으로 결정할 수 있다. 예를 들어, 프로세서는, 제 1 임계 값의 강도가 \"중\"으로 설 정된 경우, 제 1 임계 값을 80%로 설정할 수 있다. 프로세서는, 제 1 임계 값의 강도가 \"중\"으로 설정된 경우, 복수의 이미지들 중에서 가장 높은 확률을 가진 지정된 분류 항목의 상기 확률이 80% 이상인 적어도 하나 의 이미지가 존재하는 경우, 콩의 종류를 상기 지정된 분류 항목으로 결정할 수 있다. 예를 들어, 프로세서 는, 제 1 임계 값의 강도가 \"강\"으로 설정된 경우, 제 1 임계 값을 80%로 설정할 수 있다. 프로세서 는, 제 1 임계 값의 강도가 \"강\"으로 설정된 경우, 복수의 이미지들 전체에서 가장 높은 확률을 가진 분류 항목 이 지정된 분류 항목에 해당하고, 복수의 이미지들 전체에서 상기 지정된 분류 항목의 확률들이 80% 이상인 경 우에만, 콩의 종류를 상기 지정된 분류 항목으로 결정할 수 있다. 예를 들어, 프로세서는, 제 1 임계 값의 강도가 \"0\"으로 설정된 경우, 선택된 오브젝트의 분류 항목을 콩을 분류하는 항목들에서 제외할 수 있다. 도 14는, 일 실시예에 따른, 제 3 방식에 의해 콩을 분류하는 방법을 설명하기 위한 예시도이다. 도 14를 참조하면, 일 실시예에서, 전자 장치는, 제 1 임계 값, 제 2 임계 값, 및/또는 가중치를, 사용자 (예: 분류된 콩을 이용하여 커피를 제조하는 사람) 별로 학습된 학습 데이터에 기반하여 설정하는 방식(이하, \"제 3 방식\" 또는 \"적응형 모드\"으로 지칭함)을 이용하여, 콩을 분류할 수 있다. 일 실시예에서, 프로세서는, 사용자에 의해 종류가 분류된 콩들을 정답지(ground truth)로서 이용하여, 인 공지능 모델에 대한 학습을 수행할 수 있다. 일 실시예에서, 프로세서는, 사용자에 의해 종류가 분류된 콩 들을 전자 장치(예: 제 1 공간)에 순차적으로 투입한 후, 콩에 대한 이미지들을 획득할 수 있다. 예 를 들어, 참조 부호 1401에서, 프로세서는, 화면 상에서 정상두에 대응하는 오브젝트를 선택 하는 사용자 입력이 수신되고, 사용자에 의해 정상두로 분류된 콩들이 전자 장치로 투입된 경우, 투입된 콩들에 대한 복수의 이미지들을 획득할 수 있다. 상기 복수의 이미지들이 획득된 후, 참조 부호 1402에서, 프로 세서는, 화면 상에서 건조두/발화두에 대응하는 오브젝트를 선택하는 사용자 입력이 수신되고, 사용자에 의해 건조두/발화두로 분류된 콩들이 전자 장치로 투입된 경우, 투입된 콩들에 대한 복수의 이미지들을 획득할 수 있다. 참조 부호 1401 및 참조 부호 1402와 동일하게, 프로세서는, 순차적으 로, 나머지 종류들에 대응하는 오브젝트들을 선택하는 사용자 입력이 수신되고 사용자에 의해 해당 종류로 분류 된 콩들이 전자 장치로 투입된 경우, 해당 종류의 콩들에 대한 복수의 이미지들을 획득할 수 있다. 일 실시예에서, 프로세서는, 종류 별로 획득된 콩들에 대한 복수의 이미지들을 정답지로 이용하여, 인공지 능 모델을 학습하는 동작을 수행할 수 있다. 일 실시예에서, 상기 인공지능 모델을 학습하는 동작에 의해, 사용자 마다, 제 1 임계 값, 제 2 임계 값, 및/또 는 가중치가, 다르게 설정될 수 있다. 도 15는, 일 실시예에 따른, 사용자 입력에 기반하여, 콩을 분류하는 방식을 선택하는 방법을 설명하기 위한 예 시도이다. 도 15를 참조하면, 일 실시예에서, 프로세서는, 사용자 입력에 기반하여, 전술한 제 1 방식, 제 2 방식, 및 제 3 방식을 선택할 수 있다. 예를 들어, 프로세서는, 디스플레이 모듈을 통하여, 제 1 방식에 대 응하는 오브젝트들(1521, 1522), 제 2 방식에 대응하는 오브젝트들(1531, 1532, 1533), 및/또는 제 3 방식에 대응하는 오브젝트들(1541, 1542, 1543)을 포함하는 화면을 표시할 수 있다. 일 실시예에서, 프로세서는, 오브젝트을 선택하는 사용자 입력에 기반하여, 최상 품질의 정상두 및 그 외의 종류의 콩을 분류하는 동작을 수행할 수 있다. 프로세서는, 오브젝트의 선택에 의해 콩을 분류하는 동작이 수행된 후, 오브젝트가 선택된 경우, 정상두 및 커피 제조를 위하여 사용 가능한 종류의 콩을 분류하는 동작을 수행할 수 있다. 일 실시예에서, 프로세서는, 오브젝트을 선택하는 사용자 입력에 기반하여, 유저 모드 1(예: 사용자 1)에 의해 설정된 설정을 이용하여, 콩을 분류하는 동작을 수행할 수 있다. 일 실시예에서, 프로세서는, 오브젝트을 선택하는 사용자 입력에 기반하여, 적응형 모드 2(예: 사용 자 2)에 대응하는 학습 데이터를 이용하여 학습된 인공지능 모델을 이용하여, 콩을 분류하는 동작을 수행할 수 있다. 도 1 내지 도 15를 통하여 콩을 분류하는 동작에 대하여 설명하였지만, 분류 가능한 곡물은 콩에 제한되지 않는 다. 예를 들어, 본 개시의 실시예들은, 콩 외에, 낱알 형태를 가지는 곡물에 대해서도, 동일 또는 유사하게 적 용될 수 있다. 일 실시예에서, 전자 장치에서 콩을 분류하는 방법은, 상기 전자 장치의 카메라 모듈을 통하여, 콩에 대한 복수 의 이미지들을 획득하는 동작, 상기 복수의 이미지들에 기반하여, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하는 동작, 및 상기 확률들에 기반하여, 상기 콩을 분류하는 동작을 포함할 수 있다. 일 실시예에서, 상기 콩에 대한 상기 복수의 이미지들을 획득하는 동작은, 상기 전자 장치의 복수의 카메라 모 듈들을 통하여, 상기 콩의 서로 다른 면들에 대한 상기 복수의 이미지들을 획득하는 동작을 포함할 수 있다. 일 실시예에서, 상기 콩에 대한 상기 복수의 이미지들을 획득하는 동작은, 상기 카메라 모듈을 통하여, 상기 콩 의 일면에 대한 이미지 및 상기 전자 장치의 미러에 의한 상기 콩의 상기 일면과 다른 면에 대한 이미지를 획득 하는 동작을 포함할 수 있다. 일 실시예에서, 상기 콩에 대한 상기 복수의 이미지들을 획득하는 동작은, 상기 콩이 이동하는 동안, 상기 카메 라 모듈을 통하여, 서로 다른 시간들에서 상기 콩에 대한 복수의 이미지들을 획득하는 동작을 포함할 수 있다. 일 실시예에서, 상기 방법은, 상기 카메라 모듈을 통하여 상기 전자 장치의 적어도 하나의 패치에 대한 이미지 를 획득하는 동작 및 상기 적어도 하나의 패치에 대한 이미지에 기반하여, 상기 카메라 모듈의 자동 화이트 밸 런스 및/또는 자동 색 보정과 관련된 설정을 설정하는 동작을 더 포함할 수 있다. 일 실시예에서, 상기 콩이 복수의 분류 항목들 각각에 속할 확률들을 산출하는 동작은, 상기 복수의 이미지들이 제 1 이미지 및 제 2 이미지를 포함하는 경우, 상기 제 1 이미지에서 상기 콩이 상기 복수의 분류 항목들 각각 에 속할 제 1 확률들을 산출하고, 상기 제 2 이미지에서 상기 콩이 상기 복수의 분류 항목들 각각에 속할 제 2 확률들을 산출하는 동작을 포함하고, 상기 콩을 분류하는 동작은, 상기 제 1 확률들 중에서 가장 높은 제 3 확 률을 가지는 제 1 분류 항목을 확인하고, 상기 제 2 확률들 중에서 가장 높은 제 4 확률을 가지는 제 2 분류 항 목을 확인하는 동작 및 상기 제 1 분류 항목 및 상기 제 2 분류 항목에 기반하여, 상기 콩을 분류하는 동작을 포함할 수 있다. 일 실시예에서, 상기 콩을 분류하는 동작은, 상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 지정된 분류 항목에 해당하는지 여부를 확인하는 동작 및 상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 상기 지정된 분류 항목에 해당하는 경우, 상기 지정된 분류 항목에 대응하는 제 1 임계 값에 기반하여, 상기 콩을 분류하는동작을 포함할 수 있다. 일 실시예에서, 상기 콩을 분류하는 동작은, 상기 제 1 분류 항목 및/또는 상기 제 2 분류 항목이 정상두에 해 당하는지 여부, 상기 제 1 분류 항목의 상기 제 3 확률 및 상기 제 2 분류 항목의 제 4 확률 간 차이가 제 2 임 계 값 이상인지 여부, 및/또는 상기 제 1 분류 항목 및 상기 제 2 분류 항목의 가중치들에 기반하여, 상기 콩을 분류하는 동작을 포함할 수 있다. 일 실시예에서, 상기 방법은, 사용자 입력에 기반하여, 상기 제 1 임계 값, 상기 제 2 임계 값, 및/또는 상기 가중치들을 설정하는 동작을 더 포함할 수 있다. 일 실시예에서, 상기 방법은, 사용자 별로 학습된 학습 데이터에 기반하여, 상기 제 1 임계 값, 상기 제 2 임계 값, 및/또는 상기 가중치들을 설정하는 동작을 더 포함할 수 있다. 또한, 상술한 본 문서의 실시예에서 사용된 데이터의 구조는 컴퓨터로 읽을 수 있는 기록매체에 여러 수단을 통 하여 기록될 수 있다. 상기 컴퓨터로 읽을 수 있는 기록매체는 마그네틱 저장매체(예를 들면, 롬, 플로피 디스 크, 하드 디스크 등), 광학적 판독 매체(예를 들면, CD-ROM, DVD 등)와 같은 저장매체를 포함한다."}
{"patent_id": "10-2022-0113611", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 일 실시예에 따른, 전자 장치에 대한 평면도이다. 도 2는, 일 실시예에 따른, 전자 장치에 대한 측면도이다. 도 3은, 일 실시예에 따른, 복수의 카메라 모듈들을 포함하는 전자 장치를 나타내는 도면이다. 도 4는, 일 실시예에 따른, 카메라 모듈 및 미러(mirror)를 포함하는 전자 장치를 나타내는 도면이다. 도 5는, 일 실시예에 따른, 복수의 이미지들을 획득하기 위한 전자 장치를 설명하기 위한 도면이다. 도 6은, 일 실시예에 따른, 패치(patch)를 포함하는 전자 장치를 설명하기 위한 도면이다.도 7은, 일 실시예에 따른, 전자 장치의 블록 도면이다. 도 8은, 일 실시예에 따른, 콩을 분류하는 방법을 설명하기 위한 흐름도이다. 도 9는, 일 실시예에 따른, 콩을 분류하는 방법을 설명하기 위한 흐름도이다. 도 10은, 일 실시예에 따른, 콩을 분류하는 방법을 설명하기 위한 흐름도이다. 도 11은, 일 실시예에 따른, 제 1 방식에 의해 콩을 분류하는 방법을 설명하기 위한 흐름도이다. 도 12는, 일 실시예에 따른, 제 1 방식에 의해 콩을 분류하는 방법을 설명하기 위한 예시도이다. 도 13은, 일 실시예에 따른, 제 2 방식에 의해 콩을 분류하는 방법을 설명하기 위한 예시도이다. 도 14는, 일 실시예에 따른, 제 3 방식에 의해 콩을 분류하는 방법을 설명하기 위한 예시도이다. 도 15는, 일 실시예에 따른, 사용자 입력에 기반하여, 콩을 분류하는 방식을 선택하는 방법을 설명하기 위한 예 시도이다."}
