{"patent_id": "10-2018-0005689", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0087197", "출원번호": "10-2018-0005689", "발명의 명칭": "전자 장치, 그 제어 방법 및 컴퓨터 판독가능 기록 매체", "출원인": "삼성전자주식회사", "발명자": "윤상운"}}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,메모리;디스플레이; 및상기 디스플레이가 비활성 상태인 대기 모드로 동작하는 동안 사용자가 식별되면, 상기 메모리에 저장된 상기식별된 사용자의 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩하고,상기 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령이 입력되면, 상기 디스플레이를 활성화하고, 상기 적어도 하나의 컨텐츠 제공 소스 중 상기 제어 명령에 대응되는 컨텐츠 제공 소스의 화면을 표시하도록 상기 디스플레이를 제어하는 프로세서;를 포함하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,외부 장치와 통신하는 통신부;를 더 포함하고,상기 프로세서는,상기 적어도 하나의 컨텐츠 제공 소스 중에 상기 외부 장치로부터 제공되는 컨텐츠 제공 소스가 포함되면, 상기통신부를 통해 컨텐츠 제공 소스에 대한 정보를 상기 외부 장치로부터 수신하고, 상기 수신된 정보에 기초하여상기 외부 장치로부터 제공되는 컨텐츠 제공 소스를 프리 로딩하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는,상기 사용자가 식별된 시간에 따라 다른 컨텐츠 제공 소스를 프리 로딩하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는,상기 사용자가 식별되지 않으면, 상기 메모리에 저장된 복수의 사용자의 사용 이력에 기초하여 적어도 하나의컨텐츠 제공 소스를 프리 로딩하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,외부 장치와 통신하는 통신부;를 더 포함하고,상기 프로세서는,대기 모드로 동작하는 동안 상기 통신부를 통해 상기 외부 장치로부터 상기 외부 장치에서 제공하는 컨텐츠 제공 소스에 대한 정보를 수신하면, 상기 수신된 정보에 기초하여 상기 외부 장치에서 제공하는 컨텐츠 제공 소스를 프리 로딩하고,상기 외부 장치에 대한 파워 온 명령에 따른 상기 디스플레이의 활성화 명령이 상기 외부 장치로부터 수신되면,상기 외부 장치에서 제공하는 컨텐츠 제공 소스의 화면을 표시하도록 상기 디스플레이를 제어하는 전자 장치.공개특허 10-2019-0087197-3-청구항 6 제1항에 있어서,상기 프로세서는,입력된 지문, 입력된 성문(voice print) 및 입력된 스마트폰의 ID 중 적어도 하나에 기초하여 상기 사용자를 식별하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제어 명령은,상기 적어도 하나의 컨텐츠 제공 소스 중 하나의 컨텐츠 제공 소스의 실행 명령을 포함하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 프로세서는,인공 지능 기술을 이용하여 프리 로딩될 상기 적어도 하나의 컨텐츠 제공 소스를 식별하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는,상기 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 상기 전자 장치의 설정을 변경하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,IoT 장치와 통신하는 통신부;를 더 포함하고,상기 프로세서는,상기 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 상기 IoT 장치를 제어하기 위한제어 명령을 상기 IoT 장치에 전송하도록 상기 통신부를 제어하는 전자 장치."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치의 제어 방법에 있어서,디스플레이가 비활성 상태인 대기 모드로 동작하는 동안 사용자가 식별되면, 기저장된 상기 식별된 사용자의 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩하는 단계; 및상기 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령이 입력되면, 상기 디스플레이를 활성화하고, 상기 적어도 하나의 컨텐츠 제공 소스 중 상기 제어 명령에 대응되는 컨텐츠 제공 소스의 화면을 표시하는 단계;를 포함하는 방법."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 프리 로딩하는 단계는,상기 적어도 하나의 컨텐츠 제공 소스 중에 외부 장치로부터 제공되는 컨텐츠 제공 소스가 포함되면, 컨텐츠 제공 소스에 대한 정보를 상기 외부 장치로부터 수신하고, 상기 수신된 정보에 기초하여 상기 외부 장치로부터 제공되는 컨텐츠 제공 소스를 프리 로딩하는 방법.공개특허 10-2019-0087197-4-청구항 13 제11항에 있어서,상기 프리 로딩하는 단계는,상기 사용자가 식별된 시간에 따라 다른 컨텐츠 제공 소스를 프리 로딩하는 방법."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 프리 로딩하는 단계는,상기 사용자가 식별되지 않으면, 기저장된 복수의 사용자의 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공소스를 프리 로딩하는 방법."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 프리 로딩하는 단계는,대기 모드로 동작하는 동안 외부 장치로부터, 상기 외부 장치에서 제공하는 컨텐츠 제공 소스에 대한 정보를 수신하면, 상기 수신된 정보에 기초하여 상기 외부 장치에서 제공하는 컨텐츠 제공 소스를 프리 로딩하고,상기 외부 장치에 대한 파워 온 명령에 따른 상기 디스플레이의 활성화 명령이 상기 외부 장치로부터 수신되면,상기 외부 장치에서 제공하는 컨텐츠 제공 소스의 화면을 표시하는 방법."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,입력된 지문, 입력된 성문(voice print) 및 입력된 스마트폰의 ID 중 적어도 하나에 기초하여 상기 사용자를 식별하는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 프리 로딩하는 단계는,인공 지능 기술을 이용하여 프리 로딩될 상기 적어도 하나의 컨텐츠 제공 소스를 식별하고, 상기 식별된 적어도하나의 컨텐츠 제공 소스를 프리 로딩하는 방법."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 상기 전자 장치의 설정을 변경하는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 상기 IoT 장치를 제어하기 위한제어 명령을 상기 IoT 장치에 전송하는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2018-0005689", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치의 제어 방법을 실행하기 위한 프로그램을 포함하는 컴퓨터 판독가능 기록 매체에 있어서,상기 제어 방법은,공개특허 10-2019-0087197-5-상기 전자 장치가 파워 오프된 상태에서, 상기 전자 장치를 사용하고자 하는 사용자디스플레이가 비활성 상태인대기 모드로 동작하는 동안 사용자가 식별되면, 기저장된 상기 식별된 사용자의 사용 이력에 기초하여 적어도하나의 컨텐츠 제공 소스를 프리 로딩하는 단계; 및상기 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령이 입력되면, 상기 디스플레이를 활성화하고, 상기 적어도 하나의 컨텐츠 제공 소스 중 상기 제어 명령에 대응되는 컨텐츠 제공 소스의 화면을 표시하는 단계;를 포함하는 컴퓨터 판독가능 기록 매체."}
{"patent_id": "10-2018-0005689", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 본 개시의 전자 장치는, 메모리, 디스플레이 및 디스플레이가 비활성 상태인 대기 모드로 동작하는 동안 사용자가 식별되면, 메모리에 저장된 식별된 사용자의 사용 이력에 기초하여 적어도 하나의 컨텐 츠 제공 소스를 프리 로딩하고, 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령이 입력되면, 디스플레이를 활성화하고, 적어도 하나의 컨텐츠 제공 소스 중 제어 명령에 대응되는 컨텐츠 제공 소스의 화면을 표시하도록 디스플레이를 제어하는 프로세서를 포함한다."}
{"patent_id": "10-2018-0005689", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치, 그 제어 방법 및 컴퓨터 판독가능 기록 매체에 대한 것으로, 보다 상세하게는, 사용 이력 에 기초하여 컨텐츠 제공 소스를 프리 로딩함으로써 빠른 부팅이 가능하게 하는 전자 장치, 그 제어 방법 및 컴 퓨터 판독가능 기록 매체에 관한 것이다."}
{"patent_id": "10-2018-0005689", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 기술의 발달에 힘입어 다양한 유형의 전자 제품들이 개발 및 보급되고 있다. 특히, TV, 휴대폰, PC, 노트 북 PC, PDA, 셋탑박스 등과 같은 각종 전자 장치들은 대부분의 일반 가정에서도 많이 사용되고 있다. 전자 장치들의 사용이 늘면서 좀 더 다양한 기능에 대한 사용자 니즈(needs)도 증대되었다. 이에 따라, 사용자 니즈에 부합하기 위한 각 제조사들의 노력도 커져서, 종래에 없던 새로운 기능을 갖춘 제품들이 속속 등장하고 있다. 최근에는 디스플레이 장치에 셋탑박스, 블루레이 디스크, 오디오 장치, 모바일 장치 및 PC 등 외부 기기를 연결 하여 사용하고 있다. 이때, 사용자가 외부 기기에서 제공되는 컨텐츠를 이용하고자 하는 경우에는 도 1에 도시 된 바와 같은 과정을 거쳐야하는 불편함이 있었다. 구체적으로, 도 1을 참조하면, 종래에는 전자 장치의 전원이 오프된 상태에서, 전원 온 명령을 입력하면, 마지 막에 시청했던 채널 또는 마지막에 사용했던 입력 소스의 화면으로 부팅되었다. 이후, 사용자는 사용하고자 하 는 입력 소스를 선택하고, 선택된 입력 소스에서 제공하는 복수의 컨텐츠 중 원하는 컨텐츠를 선택하는 과정을 거쳐야 원하는 컨텐츠를 시청할 수 있었다. 이는 사용자에게 있어서 복잡하고 반복적인 조작 절차이며, 원하는 컨텐츠를 재생하기까지 많은 시간이 소요되는 문제점이 있었다. 이로 인해 전자 장치의 화면이 켜짐과 동시에 사용자가 원하는 컨텐츠가 재생되는 기술의 필요성이 대두되었다."}
{"patent_id": "10-2018-0005689", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 필요성에 따라 안출된 것으로, 본 개시의 목적은 사용 이력에 기초하여 컨텐츠 제공 소스를 프리 로딩하여 빠른 부팅이 가능한 전자 장치, 그 제어 방법 및 컴퓨터 판독가능 기록 매체를 제공하는 데 있다."}
{"patent_id": "10-2018-0005689", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치는, 메모리, 디스플레이 및 상기 디스플레이가 비활성 상태인 대기 모드 로 동작하는 동안 사용자가 식별되면, 상기 메모리에 저장된 상기 식별된 사용자의 사용 이력에 기초하여 적어 도 하나의 컨텐츠 제공 소스를 프리 로딩하고, 상기 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제 어 명령이 입력되면, 상기 디스플레이를 활성화하고, 상기 적어도 하나의 컨텐츠 제공 소스 중 상기 제어 명령 에 대응되는 컨텐츠 제공 소스의 화면을 표시하도록 상기 디스플레이를 제어하는 프로세서를 포함한다. 이 경우, 외부 장치와 통신하는 통신부를 더 포함하고, 상기 프로세서는, 상기 적어도 하나의 컨텐츠 제공 소스 중에 상기 외부 장치로부터 제공되는 컨텐츠 제공 소스가 포함되면, 상기 통신부를 통해 컨텐츠 제공 소스에 대 한 정보를 상기 외부 장치로부터 수신하고, 상기 수신된 정보에 기초하여 상기 외부 장치로부터 제공되는 컨텐 츠 제공 소스를 프리 로딩할 수 있다.한편, 상기 프로세서는, 상기 사용자가 식별된 시간에 따라 다른 컨텐츠 제공 소스를 프리 로딩할 수 있다. 한편, 상기 프로세서는, 상기 사용자가 식별되지 않으면, 상기 메모리에 저장된 복수의 사용자의 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩할 수 있다. 한편, 외부 장치와 통신하는 통신부를 더 포함하고, 상기 프로세서는, 대기 모드로 동작하는 동안 상기 통신부 를 통해 상기 외부 장치로부터 상기 외부 장치에서 제공하는 컨텐츠 제공 소스에 대한 정보를 수신하면, 상기 수신된 정보에 기초하여 상기 외부 장치에서 제공하는 컨텐츠 제공 소스를 프리 로딩하고, 상기 외부 장치에 대 한 파워 온 명령에 따른 상기 디스플레이의 활성화 명령이 상기 외부 장치로부터 수신되면, 상기 외부 장치에서 제공하는 컨텐츠 제공 소스의 화면을 표시하도록 상기 디스플레이를 제어할 수 있다. 한편, 상기 프로세서는, 입력된 지문, 입력된 성문(voice print) 및 입력된 스마트폰의 ID 중 적어도 하나에 기 초하여 상기 사용자를 식별할 수 있다. 한편, 상기 제어 명령은, 상기 적어도 하나의 컨텐츠 제공 소스 중 하나의 컨텐츠 제공 소스의 실행 명령을 포 함할 수 있다. 한편, 상기 프로세서는, 인공 지능 기술을 이용하여 프리 로딩될 상기 적어도 하나의 컨텐츠 제공 소스를 식별 할 수 있다. 한편, 상기 프로세서는, 상기 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 상기 전 자 장치의 설정을 변경할 수 있다. 한편, IoT 장치와 통신하는 통신부를 더 포함하고, 상기 프로세서는, 상기 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 상기 IoT 장치를 제어하기 위한 제어 명령을 상기 IoT 장치에 전송하도록 상기 통신부를 제어할 수 있다. 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법은, 디스플레이가 비활성 상태인 대기 모드로 동작하는 동 안 사용자가 식별되면, 기저장된 상기 식별된 사용자의 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공 소스 를 프리 로딩하는 단계 및 상기 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령이 입력되면, 상기 디스플레이를 활성화하고, 상기 적어도 하나의 컨텐츠 제공 소스 중 상기 제어 명령에 대응되는 컨텐츠 제 공 소스의 화면을 표시하는 단계를 포함할 수 있다. 한편, 상기 프리 로딩하는 단계는, 상기 적어도 하나의 컨텐츠 제공 소스 중에 외부 장치로부터 제공되는 컨텐 츠 제공 소스가 포함되면, 컨텐츠 제공 소스에 대한 정보를 상기 외부 장치로부터 수신하고, 상기 수신된 정보 에 기초하여 상기 외부 장치로부터 제공되는 컨텐츠 제공 소스를 프리 로딩할 수 있다. 한편, 상기 프리 로딩하는 단계는, 상기 사용자가 식별된 시간에 따라 다른 컨텐츠 제공 소스를 프리 로딩할 수 있다. 한편, 상기 프리 로딩하는 단계는, 상기 사용자가 식별되지 않으면, 기저장된 복수의 사용자의 사용 이력에 기 초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩할 수 있다. 한편, 상기 프리 로딩하는 단계는, 대기 모드로 동작하는 동안 외부 장치로부터, 상기 외부 장치에서 제공하는 컨텐츠 제공 소스에 대한 정보를 수신하면, 상기 수신된 정보에 기초하여 상기 외부 장치에서 제공하는 컨텐츠 제공 소스를 프리 로딩하고, 상기 외부 장치에 대한 파워 온 명령에 따른 상기 디스플레이의 활성화 명령이 상 기 외부 장치로부터 수신되면, 상기 외부 장치에서 제공하는 컨텐츠 제공 소스의 화면을 표시할 수 있다. 한편, 입력된 지문, 입력된 성문(voice print) 및 입력된 스마트폰의 ID 중 적어도 하나에 기초하여 상기 사용 자를 식별하는 단계를 더 포함할 수 있다. 한편, 상기 프리 로딩하는 단계는, 인공 지능 기술을 이용하여 프리 로딩될 상기 적어도 하나의 컨텐츠 제공 소 스를 식별하고, 상기 식별된 적어도 하나의 컨텐츠 제공 소스를 프리 로딩할 수 있다. 한편, 상기 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 상기 전자 장치의 설정을 변경하는 단계를 더 포함할 수 있다. 한편, 상기 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 상기 IoT 장치를 제어하기 위한 제어 명령을 상기 IoT 장치에 전송하는 단계를 더 포함할 수 있다.한편, 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 실행하기 위한 프로그램을 포함하는 컴퓨터 판독 가능 기록 매체에 있어서, 상기 제어 방법은, 상기 전자 장치가 파워 오프된 상태에서, 상기 전자 장치를 사용 하고자 하는 사용자디스플레이가 비활성 상태인 대기 모드로 동작하는 동안 사용자가 식별되면, 기저장된 상기 식별된 사용자의 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩하는 단계 및 상기 전자 장 치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령이 입력되면, 상기 디스플레이를 활성화하고, 상기 적 어도 하나의 컨텐츠 제공 소스 중 상기 제어 명령에 대응되는 컨텐츠 제공 소스의 화면을 표시하는 단계를 포함 할 수 있다."}
{"patent_id": "10-2018-0005689", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시의 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도 면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하 려는 것이 아니며, 발명된 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이 해되어야 한다. 실시 예들을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되 어서는 안 된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨 어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '모듈' 혹은 복수의 '부'는 특정한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일체화되어 적어 도 하나의 프로세서로 구현될 수 있다.아래에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 이하에서는 도면을 참조하여 본 개시에 대해 더욱 상세히 설명하기로 한다. 도 2는 본 개시의 일 실시 예에 따른 컨텐츠 제공 시스템을 설명하기 위한 도면이다. 도 2를 참조하면, 컨텐츠 제공 시스템은 전자 장치 및 전자 장치와 네트워크로 연결된 복수의 외부 장치(200-1 내지 200-4)를 포함한다. 전자 장치는 외부 장치(200-1 내지 200-4)로부터 컨텐츠를 수신하여 이를 처리할 수 있다. 여기서, 전자 장치는 TV, 휴대폰, 스마트폰, PDA, 노트북 PC, 모니터, 태블릿 PC, 전자 책, 전자 액자, 키오스크 등과 같이 디스플레이를 구비한 다양한 장치일 수 있다. 이 경우, 전자 장치는 처리된 컨텐츠를 표시할 수 있다. 한편, 전자 장치는 서버, 셋탑 박스 등과 같이 디스플레이를 구비하지 않은 다양한 장치일 수 있다. 이 경우, 전자 장치는 처리된 컨텐츠를 디스플레이를 구비한 다른 장치에 전송할 수 있다. 한편, 도 2에 도시되지는 않았으나, 전자 장치는 전자 장치와는 별도로 존재하며 전자 장치와 광 케이블로 연결되는 제어 박스를 포함한다. 제어 박스는 전자 장치를 제어하여 다양한 화면을 표시하도록하며, 전자 장치 동작 전반을 수행할 수 있다. 예를 들어, 제어 박스는 외부 장치로부터 수신된 영상 신호에 대응되는 화면을 분석하여 전자 장치에 전송할 수 있다. 그리고 제어 박스는, 사용자로부터 전자 장치를 통해 입력된 명령에 대응되는 제어 명령을 생성하고, 생성된 제어 명령을 외부 장치에 전송할 수도 있다. 이와 같이 별도의 제어 박스가 존재함에 따라, 전자 장치에 모든 주변기기를 복잡하게 연결할 필요 없이, 제어 박스에 주변기기들을 연결하고 제어 박스를 단일 선으로 전자 장치에 간편하게 연결할 수 있다. 따라서, 사용자의 편의성이 증대될 수 있다. 한편, 제어 박스는 상술한 기능에 기초하여 원 커넥트 박스 (One Connect(OC) box), 인비저블 박스 등으로 지칭될 수 있다. 외부 장치(200-1 내지 200-4)는 전자 장치에 컨텐츠를 전송하는 장치일 수 있다. 여기서, 외부 장치(200-1 내지 200-4)는 방송국 서버(200-1), 셋탑 박스(200-2), 게임용 콘솔(200-3), IoT 장치(200-4)를 포함할 수 있 다. 도시되지는 않았으나, 외부 장치는 상술한 장치 이외의 외부 메모리 장치, 블루레이 디스크, PC, 스마트폰 과 같은 모바일 장치 등을 더 포함할 수 있다. 그리고, 도 2에서는 전자 장치로 제어 가능한 IoT 장치 (200-4)로 전등을 도시하였으나, 이외에도 냉장고, 세탁기, 콘센트, 도어락 등 다양한 장치가 포함될 수 있다. 이때, 전자 장치와 외부 장치(200-1 내지 200-4)는 HDMI 등과 같은 유선 방식으로 연결될 수 있고, 와이파 이, 블루투스 등과 같은 무선 방식으로 연결될 수도 있다. 한편, 전자 장치는 연결된 외부 장치(200-1 내지 200-4)를 인식하여 이를 데이터 베이스(DB)로 구축하고, DB를 저장할 수 있다. 구체적으로, 전자 장치는 연결된 외부 장치(200-1 내지 200-4)를 제조한 사업자, 외 부 장치(200-1 내지 200-4)의 제품명, 외부 장치(200-1 내지 200-4)에 저장된 어플리케이션과 컨텐츠 등을 인식 하여 데이터 베이스로 구축할 수 있다. 데이터 베이스는 다양한 방식으로 구축 가능한데, 예를 들어 사용자가 전자 장치에 외부 장치(200-1 내지 200-4)에 대한 정보를 직접 입력할 수 있다. 또는, 본 개시의 또 다른 실시 예들에 따르면 자동으로 전자 장치 는 자동으로 외부 장치(200-1 내지 200-4)에 대한 정보를 인식할 수 있다. 예를 들어, 전자 장치는 외부 장치(200-1 내지 200-4)로부터 제공된 영상 신호에서 외부 장치(200-1 내지 200-4)에 대한 정보를 획득할 수 있다. 예컨대, 전자 장치는 외부 장치(200-1 내지 200-4)가 제공한 영상 신호에 대응되는 화면에서 로 고, 사업자명, 어플리케이션 등을 추출해서 외부 장치(200-1 내지 200-4)에 대한 정보를 획득할 수 있다. 한편, 전자 장치는 다양한 방식으로 사용자를 식별할 수 있고, 기저장된 전자 장치의 사용 이력에 기 초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩(pre-loading)할 수 있다. 구체적으로, 사용자가 자주 사용 하는 여러 개의 컨텐츠 제공 소스를 미리 실행해두고, 전자 장치의 디스플레이가 켜짐과 동시에 사용자가 원하는 컨텐츠 또는 컨텐츠 제공 소스의 화면을 바로 표시할 수 있다. 여기서, 컨텐츠 제공 소스라 함은 전자 장치에 컨텐츠를 제공하는 프로그램 등을 의미하는 것으로, 전자 장치에 설치된 어플리케이션 또는 외부 장치(200-1 내지 200-4)에 설치된 어플리케이션 등을 의미할 수 있다. 그리고, 프리 로딩은 어플리케이션의 화면을 표시하기 위한 데이터를 미리 수신하고, 수신된 데이터를 이용 하여 화면을 미리 생성하는 동작으로, 전자 장치의 디스플레이가 활성화되기 전에, 컨텐츠 또는 컨텐츠 제 공 소스의 화면을 생성할 수 있다. 예를 들어, 전자 장치가 영화 및 드라마 매니아인 사용자를 식별하고, 식별된 사용자의 사용 이력에 기초 하여, TV 채널 중 최근 자주 보는 채널의 화면 및 영화를 제공하는 어플리케이션의 홈 화면을 프리 로딩하고, 사용자가 'AA 영화'를 재생하기 위한 제어 명령을 입력하면, 디스플레이를 활성화하고, 바로 프리 로딩된 영화 어플리케이션의 홈 화면을 표시할 수 있다. 한편, 사용자가 'AA 영화'를 자주 재생한 경우, 전자 장치는 시청 이력에 기초하여 'AA 영화'의 시작 화면을 프리 로딩할 수 있으며, 사용자가 'AA 영화'를 재생하기 위한 제어 명령을 입력하면, 디스플레이를 활성화하고 바로 'AA 영화'를 재생할 수도 있다. 이로 인해, 전자 장치를 활성화하기 위한 명령의 입력에 따라 디스플레이가 켜짐과 동시에 사용자가 원하 는 컨텐츠의 화면이 바로 표시될 수 있다. 즉, 본 개시에 따르면 디스플레이가 켜진 후 부팅 없이 컨텐츠 화면 을 바로 표시할 수 있다. 도 3은 본 개시의 일 실시 예에 따른 전자 장치의 간략한 구성을 도시한 블럭도이다. 도 3을 참조하면, 전자 장치는 메모리, 프로세서 및 디스플레이를 포함할 수 있다. 메모리는 전자 장치의 동작에 필요한 각종 프로그램 및 데이터를 저장할 수 있다. 구체적으로는, 메 모리에는 전자 장치에서 제공 가능한 어플리케이션에 대한 정보 및 전자 장치의 사용 이력을 저 장할 수 있다. 구체적으로, 메모리에는 어플리케이션의 설치 정보 뿐만 아니라, 어플리케이션에서 제공 가능한 컨텐츠를 저장할 수 있다. 한편, 사용 이력은 사용자 별로 시청된 컨텐츠의 이름, 시청 시간, 횟수, 장르 정보 등과 같은 다양한 정보들이 포함될 수 있다. 그리고, 메모리에는 사용자 식별 정보가 저장될 수 있다. 구체적으로, 메모리에는 전자 장치를 사용하는 사용자가 누구인지 식별 가능하도록, 전자 장치를 사용하는 적어도 하나의 사용자의 지문 정보, 성문(voice print) 정보가 저장될 수 있다. 또한, 메모리에는 지문 정보 또는 성문 정보와 같은 사용자 고 유의 정보 이외에도, 사용자의 스마트폰 ID에 대한 정보가 저장될 수 있다. 상술한 지문 정보, 성문 정보 및 스 마트폰 ID에 대한 정보는 사용자가 미리 입력한 것일 수 있다. 프로세서는 전자 장치의 전반적인 동작 및 기능을 제어할 수 있다. 도시되지는 않았지만, 프로세서 는 전자 장치의 일부 구성만 활성화된 대기 모드에서 활성화된 구성을 제어하는 마이컴을 포함할 수 있다. 여기서, 대기 모드는 마이컴, 외부 장치와의 데이터 송수신을 위한 통신부(미도시), 메모리 등이 활 성화되고, 디스플레이는 비활성화된 상태일 수 있다. 디스플레이는 프로세서의 제어에 의해 영상 신호에 대응되는 화면을 표시할 수 있다. 구체적으로, 디 스플레이는 프로세서의 제어에 의해 컨텐츠를 표시하거나, 사용자에게 정보를 제공하기 위한 UI 또는 사용자의 확인을 받기 위한 UI를 표시할 수 있다. 한편, 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel) 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이 내에는 a- si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 또한, 디스플레이은 플렉서블 디스플레이로 구현될 수도 있다. 한편, 이상에서는 표시 기능과 제스처 감지 기능이 동일한 구성에서 수행되는 것으로 설명하였지만, 서로 다른 구성에서 수행될 수도 있다. 그리고, 다양한 실시 형태에 따라, 전자 장치에 디스플레이는 구비되지 않을 수도 있다. 한편, 프로세서는 디스플레이가 비활성 상태인 대기 모드로 동작하는 동안 사용자가 식별되면 사용자 의 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩할 수 있다. 구체적으로, 사용자가 식별 된다는 것은 전자 장치를 사용하고자 하는 사용자가 누구인지 식별하는 것을 의미할 수 있다. 구체적으로, 프로세서는 전자 장치에 입력된 지문, 입력된 성문 및 입력된 스마트폰의 ID 중 적어도 하나에 기초하여 사용자를 식별할 수 있다. 이때, 복수의 사용자의 지문, 성문, 스마트폰의 ID에 대한 데이터베이스는 메모리에 저장된 것일 수 있다. 사용자가 식별되면, 프로세서는 식별된 사용자가 전자 장치를 사용한 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩할 수 있다. 이때, 사용자의 사용 이력은 메모리에 축적된 것일 수 있다. 그리고, 프리 로딩되는 컨텐츠 제공 소스는 전자 장치에 설치된 어플리케이션, 컨텐츠, 외부 장치에 서 제공하는 어플리케이션 및 컨텐츠 중 적어도 하나일 수 있다. 구체적으로, 프로세서는 사용자 사용 이력에 기초하여 사용자가 자주 사용했던 입력 소스, 입력 소스에서 실행했던 어플리케이션, 컨텐츠 등을 식별할 수 있다. 이때, 프로세서는 사용자가 어플리케이션이나 컨텐 츠를 실행한 시간을 고려하여 컨텐츠 제공 소스를 식별할 수 있다. 즉, 사용자가 식별된 시간이 다르면 다른 컨 텐츠 제공 소스가 프리 로딩될 수 있다. 예를 들어, 프로세서는 복수의 컨텐츠 제공 소스의 각 선호도에 따라 기설정된 값 이상인 적어도 하나의 컨텐츠 제공 소스를 식별하여 프리 로딩할 수 있다. 또는, 프로세서는 선호도가 높은 순서대로 기설정된 개수의 컨텐츠 제공 소스를 식별하여 프리 로딩할 수 있다. 이때, 사용자가 자주 사용한 어플리케이션 또는 컨텐츠가 전자 장치에 저장된 것이라면, 프로세서는 디스플레이가 비활성화된 상태에서 어플리케이션 또는 컨텐츠의 화면을 프리 로딩할 수 있다. 또는, 사용 자가 자주 사용한 어플리케이션 또는 컨텐츠가 외부 장치에 저장된 것이라면, 프로세서는 디스플레이(13 0)가 비활성화된 상태에서 외부 장치와 연결하고, 외부 장치로부터 어플리케이션 또는 컨텐츠의 정보를 수신하 고, 수신된 정보를 이용하여 화면을 프리 로딩할 수 있다. 이러한 프로세서의 프리 로딩 동작은 기계 학습 알고리즘을 활용하는 인공지능((artificial intelligence, AI) 시스템 및 그 응용으로 구현될 수 있으며, 프로세서는 사용자 별 선호 컨텐츠 제공 소스를 학습하고, 프리 로딩될 컨텐츠 제공 소스를 식별할 수 있다. 구체적으로, 인공지능 시스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템으로서 기계가 스스로 학습하고 판 단하며, 사용할수록 인식률이 향상되는 시스템이다. 인공지능 기술은 입력 데이터들의 특징을 스스로 분류/학습 하는 알고리즘을 이용하는 기계 학습(딥러닝) 기술 및 기계 학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 요소 기술들로 구성된다. 요소 기술들은, 예로, 인간의 언어/문자를 인식하는 언어적 이해 기술, 사물을 인간의 시각처럼 인식하는 시각 적 이해 기술, 정보를 판단하여 논리적으로 추론하고 예측하는 추론/예측 기술, 인간의 경험 정보를 지식데이터 로 처리하는 지식 표현 기술 및 차량의 자율 주행, 로봇의 움직임을 제어하는 동작 제어 기술 중 적어도 하나를 포함할 수 있다. 영상 인식 기술과 관련하여, 시각적 이해는 사물을 인간의 시각처럼 인식하여 처리하는 기술로서, 객체 인식, 객체 추적, 영상 검색, 사람 인식, 장면 이해, 공간 이해, 영상 개선 등을 포함한다. 정보를 추천 기술과 관련하여, 추론 예측은 정보를 판단하여 논리적으로 추론하고 예측하는 기술로서, 지식/확 률 기반 추론, 최적화 예측, 선호 기반 계획, 추천 등을 포함한다. 쿼리 처리 기술과 관련하여, 지식 표현은 인간의 경험정보를 지식데이터로 자동화 처리하는 기술로서, 지식 구 축(데이터 생성/분류), 지식 관리(데이터 활용) 등을 포함한다. 그리고, 사용자가 전자 장치의 모드를 대기 모드에서 컨텐츠 재생 모드로 전환하기 위한 제어 명령을 입력 하면, 프로세서는 프리 로딩된 적어도 하나의 컨텐츠 제공 소스 중 제어 명령에 대응되는 컨텐츠 제공 소 스의 화면을 표시하도록 디스플레이를 제어할 수 있다. 구체적으로, 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령은, 디스플레이를 활성 화시키는 제어 명령을 포함할 수 있다. 예를 들어, 디스플레이가 비활성화되어 있어 전자 장치가 파 워 오프된 상태인 것으로 보이는 상태에서, 사용자가 파워 온 명령을 입력한 경우나, 연결된 원격 제어 장치의 임의의 버튼을 누를 경우, 프로세서는 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령이 입력된 것으로 식별할 수 있다. 이때, 원격 제어 장치는 전자 장치 전용 리모컨이거나, 전자 장치 를 제어할 수 있는 스마트폰일 수 있다. 한편, 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령은, 컨텐츠 제공 소스의 실행 명령 을 포함할 수 있다. 이때, 컨텐츠 제공 소스의 실행 명령에는, 실행을 위하여 전자 장치의 모드를 변경하기 위한 제어 명령이 포함될 수 있다. 이때, 실행 명령의 대상인 컨텐츠 제공 소스는 프리 로딩된 적어도 하나 의 컨텐츠 제공 소스 중 하나일 수 있다. 한편, 전자 장치를 사용하고자 하는 사용자가 있음은 감지되었으나, 사용자가 누구인지 식별할 수 없는 경 우, 프로세서는 메모리에 저장된 복수의 사용자의 사용 이력에 기초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩할 수 있다. 구체적으로, 복수의 사용자 별로 선호하는 컨텐츠 제공 소스를 프리 로딩할 수 있 다. 한편, 프로세서는 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 전자 장치 의 설정을 변경할 수 있다. 구체적으로, 프로세서는 사용자의 사용 이력에 기초하여 프리 로딩된 적 어도 하나의 컨텐츠 제공 소스 중 사용자의 제어 명령에 의해 실행되는 컨텐츠에 따라 전자 장치의 설정을 변경할 수 있다. 예를 들어, 사용자의 실행 명령에 대응되는 컨텐츠가 영화이면, 영화를 재생하기에 적합하도록 전자 장치 의 화질 및 음질에 대한 설정을 조절할 수 있다. 아래 표 1은 설명의 편의를 위해 컨텐츠의 종류에 따른 전자 장치의 설정의 예시를 나타낸 것이며, 이에 한정되지 않는다. [ 표 1 ]"}
{"patent_id": "10-2018-0005689", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한편, 프로세서는 제어 명령에 대응되는 컨텐츠 제공 소스에서 제공하는 컨텐츠에 기초하여 전자 장치 와 연결된 외부 장치의 설정을 변경할 수 있다. 이에 대해서는 이하 통신부가 도시된 도 4에서 자세히 설 명하기로 한다. 상술한 바와 같이, 사용자가 선호하는 컨텐츠 제공 소스를 프리 로딩함으로써, 사용자가 실행 명령을 입력했을 때 부팅 없이 바로 컨텐츠를 표시할 수 있다. 이로 인해 사용자는 향상된 사용 경험을 누릴 수 있게 된다. 도 4는 도 3의 전자 장치의 구체적인 구성을 도시한 블럭도이다. 도 4를 참조하면, 전자 장치는 메모리, 프로세서, 디스플레이, 통신부, 입력부 , 비디오 프로세서, 비디오 출력부, 오디오 프로세서 및 오디오 출력부를 포함할 수 있다. 여기서, 메모리 및 디스플레이는 도 3의 구성과 동일한 바, 중복된 기재는 생략한다. 프로세서는 RAM, ROM, CPU, GPU(Graphic Processing Unit), 버스를 포함할 수 있다. RAM, ROM, CPU, GPU(Graphic Processing Unit) 등은 버스를 통해 서로 연결될 수 있다. CPU는 메모리에 액세스하여, 메모리에 저장된 O/S를 이용하여 부팅을 수행한다. 그리고, 메모리 에 저장된 각종 프로그램, 컨텐츠, 데이터 등을 이용하여 다양한 동작을 수행한다. ROM에는 시스템 부팅을 위한 명령어 세트 등이 저장된다. 턴-온 명령이 입력되어 전원이 공급되면, CPU는 ROM에 저장된 명령어에 따라 메모리에 저장된 O/S를 RAM에 복사하고, O/S를 실행시 켜 시스템을 부팅시킨다. 부팅이 완료되면, CPU는 메모리에 저장된 각종 프로그램을 RAM에 복사 하고, RAM에 복사된 프로그램을 실행시켜 각종 동작을 수행한다. GPU는 전자 장치의 부팅이 완료되면, 디스플레이에 UI를 디스플레이한다. 구체적으로는, GPU는 연산부(미도시) 및 렌더링부(미도시)를 이용하여 아이콘, 이미지, 텍스트 등과 같은 다양한 객체를 포함하는 화면을 생성할 수 있다. 연산부는 화면의 레이아웃에 따라 각 객체들이 표시될 좌표값, 형태, 크기, 컬러 등과 같은 속성값을 연산한다. 렌더링부는 연산부에서 연산한 속성값에 기초하여 객체를 포함하는 다양한 레이아웃의 화면을 생성한다. 렌더링부에서 생성된 화면(또는 사용자 인터페이스 창)은 디스플레이로 제공 되어, 메인 표시 영역 및 서브 표시 영역에 각각 표시된다. 이상에서는 프로세서가 하나의 CPU만을 포함하는 것으로 설명하였지만, 구현시에는 복수의 CPU(또는 DSP, SoC 등)로 구현될 수 있다. 통신부는 외부 장치와 통신을 수행하는 구성이다. 구체적으로, 통신부는 외부 장치로부터 영상 신호 또는 제어 명령을 수신할 수 있다. 그리고, 프로세서에 의해 생성된 제어 명령을 외부 장치로 전송할 수 있다. 통신부는 유선 또는 무선 방식으로 외부 장치와 통신할 수 있다. 구체적으로, 통신부는 무선랜, 블루투스 등과 같은 무선 방식으로 외부 장치와 연결될 수 있다. 이외에도 통신부는 와이파이, 지그비, 적외선(IrDA)을 이용하여 외부 장치와 연결될 수 있다. 한편, 통신부는 유선 방식인 연결 포트를 포함할 수 있다. 이때, 통신부는 유선 Ethernet, HDMI(High Definition Multimedia Interface) 포트, 컴포넌트 포트, PC 포트, USB 포트 등을 포함할 수 있다. 이외에도, 통신부(14 0)는 DVI(Digital Visual Interface), RGB(Red Green Blue), DSUB, S-Video(Super Video) 등을 포함할 수 있 다. 구체적으로, 통신부는 프로세서의 제어에 의해 외부 장치로부터 컨텐츠 제공 소스에 대한 정보를 수 신할 수 있다. 구체적으로, 식별된 사용자의 사용 이력에 기초하여 사용자가 선호하는 컨텐츠 제공 소스가 외부 장치로부터 제공되는 컨텐츠 제공 소스가 포함되면, 프로세서는 통신부를 통해 외부 장치로부터 컨텐 츠 제공 소스에 대한 정보를 수신하고, 수신된 정보를 이용하여 컨텐츠 제공 소스를 프리 로딩할 수 있다. 한편, 통신부는 프로세서의 제어에 의해 외부 장치로부터 디스플레이 활성화 명령을 수신할 수 있다. 구체적으로, 전자 장치가 대기 모드로 동작하는 동안 외부 장치에서 제공하는 컨텐츠 제공 소스에 대한 정보가 통신부를 통해 수신되면, 프로세서는 수신된 정보에 기초하여 컨텐츠 제공 소스를 프리 로딩할 수 있다. 예를 들어, 전자 장치가 대기 모드로 동작하는 동안, 사용자가 외부 장치의 리모컨을 움직이거나, 작동시 키면, 외부 장치는 컨텐츠 제공 소스에 대한 정보를 전자 장치에 전송할 수 있다. 이때, 전자 장치에 전송되는 컨텐츠 제공 소스에 대한 정보는 외부 장치에 저장된 사용자 이력에 기초하여 외부 장치가 식별한 것 일 수 있다. 한편, 다른 실시 예로, 외부 장치에서 사용자가 외부 장치 제어를 위한 준비 동작을 수행함이 감지 되면, 외부 장치가 전자 장치에 감지된 정보를 전송하고, 전자 장치가 사용 이력에 기초하여 외부 장 치에 컨텐츠 제공 소스에 대한 정보를 요청할 수도 있다. 이후, 사용자가 외부 장치에서 제공하는 컨텐츠 제공 소스를 실행하는 명령을 외부 장치에 입력하면, 전자 장치 는 통신부를 통해 외부 장치로부터 디스플레이의 활성화 명령을 수신할 수 있다. 그리고, 프로 세서는 디스플레이를 활성화하고 바로 외부 장치에서 제공하는 컨텐츠 제공 소스의 화면을 표시할 수 있다. 즉, 전자 장치가 대기 모드일 때, 사용자가 전자 장치를 제어 없이, 전자 장치와 연결된 외부 장치를 제어하는 경우에도, 프로세서는 디스플레이를 활성화 시킨 후 바로 외부 장치에서 제공하는 컨텐츠를 표시할 수 있다. 이에 대해서는 이하 도 9 및 13을 참조하여 자세히 설명하기로 한다. 한편, 통신부는 IoT(Internet of Things) 장치와 통신할 수 있다. 구체적으로, 통신부는 전자 장치 를 통해 제어할 수 있는 전등, 냉장고, 세탁기, 도어락 등의 IoT 장치와 통신할 수 있다. 이때, 프로세서 는 IoT 장치를 제어하기 위한 제어 명령을 통신부를 통해 IoT 장치로 전송할 수 있다. 구체적으로, 프로세서는 제어 명령에 의해 실행되는 컨텐츠에 기초하여 IoT 장치를 제어하기 위한 제어 명령을 통신부 를 통해 IoT 장치에 전송할 수 있다. 예를 들어, 제어 명령에 의해 실행되는 컨텐츠가 영화이면, 프로세서 는 전자 장치와 연결된 IoT 장치 중 하나인 전등의 스위치를 끄는 제어 명령을 전등에 전송하거나, 주변 IoT 장치의 소음 저감 모드로 변경하도록 제어 명령을 전송할 수 있다. 이때, 프로세서는 실행되는 컨텐츠에 따라 IoT 장치의 제어 명령을 IoT 장치에 바로 전송할 수 있으나, 다른 실시 예로, 도 10에 도시된 바 와 같이, IoT 장치의 제어 명령을 전송하기 전 IoT 장치 제어에 대하여 사용자의 확인을 받기 위한 UI 화면을 디스플레이에 표시할 수 있다. 이와 같이, 실행되는 컨텐츠에 따라 주변 환경을 적합하게 제어함으로써 사용자의 편의를 향상시킬 수 있다. 입력부는 사용자의 음성, 사용자의 조작 등 사용자의 인터랙션을 입력받기 위한 구성이다. 구체적으로, 입력부는 사용자의 음성을 입력받는 마이크, 원격 제어 장치에서부터 사용자 입력(예를 들어, 터치, 눌림, 터치 제스처, 음성, 또는 모션)에 대응되는 광 신호를 수신하는 광 수신부, 전자 장치 의 본체 외관의 전면부나 측면부, 배면부 등의 임의의 영역에 형성된 버튼을 포함할 수 있다. 버튼은 기계적 버튼, 터치 패드, 휠 등과 같은 다양한 유형의 버튼을 포함할 수 있다. 그리고, 버튼 은 사용자의 음성 데이터 및 지문 데이터를 입력받기 위한 구성일 수 있다. 예를 들어, 사용자는 전자 장치 에 음성 입력을 위한 버튼을 누르고 음성을 입력할 수 있으며, 이때, 버튼의 표면에 지문 인식 기능 이 있는 경우, 전자 장치는 사용자의 지문도 함께 입력받을 수 있다. 이러한 버튼은 전자 장치 에 구비되어 있거나, 전자 장치와 통신하는 원격 제어 장치에 구비되어 있을 수도 있다. 한편, 도시되지는 않았지만, 실시 예에 따라, 입력부는 전자 장치 앞의 사용자를 존재를 감지하고, 사용자의 얼굴을 인식할 수 있도록 사용자 이미지를 촬상하는 카메라, 사용자의 터치를 입력받기 위한 터치 스 크린 또는 사용자의 움직임을 감지할 수 있는 센서를 더 포함할 수 있다. 비디오 프로세서는 통신부를 통해 수신된 컨텐츠 또는, 메모리에 저장된 컨텐츠에 포함된 비디 오 데이터를 처리하기 위한 구성요소이다. 비디오 프로세서에서는 비디오 데이터에 대한 디코딩, 스케일링, 노이즈 필터링, 프레임 레이트 변환, 해상도 변환 등과 같은 다양한 이미지 처리를 수행할 수 있다. 비디오 출력부는 비디오 프로세서에서 처리된 비디오 데이터를 출력할 수 있다. 이때, 전자 장치 에 디스플레이가 구비된 경우, 비디오 출력부는 디스플레이와 동일한 구성일 수 있으나, 전자 장치에 디스플레이가 구비되어 있지 않거나, 외부 디스플레이 장치에서 영상을 표시하고자 하는 경우에는, 외부 디스플레이 장치에 영상 신호를 제공하는 포트 형태일 수도 있다. 오디오 프로세서는 통신부를 통해 수신된 컨텐츠 또는, 메모리에 저장된 컨텐츠에 포함된 오디 오 데이터를 처리하기 위한 구성요소이다. 오디오 프로세서에서는 오디오 데이터에 대한 디코딩이나 증폭, 노이즈 필터링 등과 같은 다양한 처리가 수행될 수 있다. 프로세서는 멀티미디어 컨텐츠에 대한 재생 애플리케이션이 실행되면 비디오 프로세서 및 오디오 프 로세서를 구동시켜, 해당 컨텐츠를 재생할 수 있다. 이때, 디스플레이는 비디오 프로세서에서 생성한 이미지 프레임을 메인 표시 영역, 서브 표시 영역 중 적어도 하나의 영역에 디스플레이할 수 있다. 오디오 출력부는 오디오 프로세서에서 생성한 오디오 데이터를 출력한다. 이때, 오디오 출력부 는 전자 장치에 구비된 스피커와 같이 음성 신호를 소리로 변환하여 출력하는 구성일 수도 있고, 외부 스 피커에 음성 신호를 제공하는 포트 형태일 수도 있다. 이상에서는 비디오 출력부과 오디오 출력부가 별도의 구성인 것으로 기재하였으나, 전자 장치가 비디오 신호와 오디오 신호를 동시에 전송하는 HDMI 포트 등을 구비하고 있는 경우, 물리적으로 하나의 구성으 로 구현될 수 있다. 한편, 상술한 비디오 출력부를 통해 외부 디스플레이 장치로 영상을 전송하는 경우, 프로세서는 전송 되는 영상에 GUI(Graphic User Interface)를 부가하여 전송할 수 있다. 구체적으로, 프로세서는 비디오 처 리부에서 출력된 영상에 GUI가 부가된 영상을 외부 디스플레이 장치로 전송할 수 있다. 그 밖에, 도 4에 도시하지는 않았으나, 실시 예에 따라서는, 전자 장치 내에 USB 커넥터가 연결될 수 있는 USB 포트나, HDMI 포트, 헤드셋, 마우스, LAN 등과 같은 다양한 외부 단자와 연결하기 위한 다양한 외부 입력 포트, DMB(Digital Multimedia Broadcasting) 신호를 수신하여 처리하는 DMB 칩, 다양한 센서 등을 더 포함할 수 있음은 물론이다. 도 5는 본 개시의 일 실시 예에 따른 컨텐츠 재생 과정을 설명하기 위한 도면이다. 도 5를 참조하면, 전자 장치는 디스플레이가 비활성화된 상태인 대기 모드에서, 컨텐츠 재생 모드로 전환 하기 위한 제어 명령이 입력되면, 디스플레이를 활성화하고 제어 명령에 대응되는 컨텐츠를 바로 표시할 수 있다. 구체적으로, 전자 장치는 사용자가 식별되면, 기저장된 사용자의 사용 이력에 기초하여 적어도 하나의 컨 텐츠 제공 소스를 프리 로딩하고, 사용자의 제어 명령 이는 도 1에 도시된 종래 기술과 비교하였을 때, 사용자 제어 명령에 따라 디스플레이가 활성화된 후 입력 소스 를 선택하고, 어플리케이션 또는 컨텐츠를 선택하는 과정 없이 바로 원하는 컨텐츠가 표시될 뿐더러, 어플리케 이션 실행 명령에 따른 부팅 과정이 생략되므로 사용자의 사용 환경을 향상시킬 수 있다.도 6 내지 도 8은 사용자 식별 방식의 다양한 실시 예에 따른 컨텐츠 재생 과정을 설명하기 위한 도면이다. 구 체적으로, 도 6은 사용자의 음성 명령 입력에 따라 성문으로 사용자를 식별하는 실시 예, 도 7은 스마트폰의 ID 를 이용하여 사용자를 식별하는 실시 예, 그리고, 도 8은 지문 인식을 통해 사용자를 식별하는 실시 예를 도시 한 것이다. 도 6을 참조하면, 사용자는 전자 장치를 음성으로 제어하기 위한 트리거 음성을 발화할 수 있다. 전자 장 치는 저장된 복수의 사용자의 성문과 사용자가 발화한 트리거 음성의 성문을 비교하여 가장 유사한 사용자 를 식별할 수 있다. 한편, 사용자가 트리거 음성이 아닌 컨텐츠 실행 명령을 음성으로 입력한 경우에도, 입력된 명령의 일부 또는 전부를 이용하여 사용자를 식별할 수 있다. 그리고, 전자 장치는 식별된 사용자의 사용 이력을 이용하여 식별된 사용자가 선호하는 적어도 하나의 컨 텐츠 제공 소스를 프리 로딩할 수 있다. 그리고, 사용자가 전자 장치의 모드를 대기 모드에서 컨텐츠 재생 모드로 전환하기 위한 제어 명령을 입력 하면, 전자 장치는 디스플레이를 비활성 상태에서 활성 상태로 전환하고, 제어 명령에 대응되는 컨텐츠를 바로 표시할 수 있다. 구체적으로, 사용자가 컨텐츠 제공 소스의 실행 명령을 음성으로 입력하면, 전자 장치 는 비활성 상태의 디스플레이를 활성화하고, 프리 로딩된 적어도 하나의 컨텐츠 제공 소스 중 실행 명령에 대응되는 컨텐츠 제공 소스의 화면을 바로 표시할 수 있다. 도 7을 참조하면, 사용자는 전자 장치를 스마트폰으로 제어하기 위하여 전자 장치 원격 제어 어 플리케이션을 실행할 수 있다. 전자 장치는 저장된 복수의 사용자에 각각 대응되는 스마트폰의 ID와 사용자의 스마트폰의 ID를 비교하여 사용자를 식별할 수 있다. 한편, 원격 제어 어플리케이션을 실행하지 않더 라도 전자 장치에 사용자의 스마트폰이 연결되면, 전자 장치는 연결된 스마트폰의 ID를 이용 하여 사용자를 식별할 수 있다. 그리고, 전자 장치는 식별된 사용자의 사용 이력을 이용하여 식별된 사용자가 선호하는 적어도 하나의 컨 텐츠 제공 소스를 프리 로딩할 수 있다. 그리고, 사용자가 전자 장치의 모드를 대기 모드에서 컨텐츠 재생 모드로 전환하기 위한 제어 명령을 입력 하면, 전자 장치는 디스플레이를 비활성 상태에서 활성 상태로 전환하고, 제어 명령에 대응되는 컨텐츠를 바로 표시할 수 있다. 구체적으로, 스마트폰의 원격 제어 어플리케이션을 실행함에 따라 스마트폰에 표 시된 제어 UI에서 원하는 컨텐츠를 선택하면, 전자 장치는 비활성 상태의 디스플레이를 활성화하고, 프리 로딩된 적어도 하나의 컨텐츠 제공 소스 중 선택에 대응되는 컨텐츠 제공 소스의 화면을 바로 표시할 수 있다. 도 8을 참조하면, 사용자는 전자 장치를 원격 제어 장치로 제어하기 위한 동작을 수행할 수 있다. 구 체적으로, 사용자는 전자 장치를 켜기 위해 원격 제어 장치를 들고, 전원 버튼을 누를 수 있다. 이때, 원격 제어 장치의 전원 버튼에는 지문 인식 기능이 탑재될 수 있다. 한편, 사용자가 원격 제어 장치를 움직이고, 전원 버튼에 손가락을 올림에 따라 인식된 지문 정보가 전 자 장치에 전송되고, 전자 장치는 원격 제어 장치로부터 수신한 사용자의 지문 정보와 저장된 복 수의 사용자의 지문 정보를 비교하여 사용자를 식별할 수 있다. 도 8에서는 원격 제어 장치가 리모컨인 것으로 도시되었으나, 실제 구현시에는 도 7과 같은 스마트폰일 수 있으며, 스마트폰의 지문 인식 기능을 이용하여 사용자를 식별할 수도 있다. 그리고, 전자 장치는 식별된 사용자의 사용 이력을 이용하여 식별된 사용자가 선호하는 적어도 하나의 컨 텐츠 제공 소스를 프리 로딩할 수 있다. 그리고, 사용자가 전자 장치의 모드를 대기 모드에서 컨텐츠 재생 모드로 전환하기 위한 제어 명령을 입력 하면, 전자 장치는 디스플레이를 비활성 상태에서 활성 상태로 전환하고, 제어 명령에 대응되는 컨텐츠를 바로 표시할 수 있다. 구체적으로, 사용자가 컨텐츠 제공 소스의 실행 명령을 음성으로 입력하면, 전자 장치 는 비활성 상태의 디스플레이를 활성화하고, 프리 로딩된 적어도 하나의 컨텐츠 제공 소스 중 실행 명령에 대응되는 컨텐츠 제공 소스의 화면을 바로 표시할 수 있다. 도 9는 본 개시의 다른 실시 예에 따른 전자 장치의 컨텐츠 재생을 설명하기 위한 도면이다. 구체적으로, 본 개 시의 다른 실시 예에 따른 컨텐츠 제공 시스템은 전자 장치가 아닌 외부 장치를 제어하는 실시예를 도시한 것이다. 도 9를 참조하면, 사용자는 전자 장치가 대기 모드인 상태에서 외부 장치를 제어한 경우, 전자 장치는 디스플레이를 활성화한 후 바로 외부 장치에서 제공하는 화면을 표시할 수 있다. 도 9에 서는 외부 장치의 예시로 게임 콘솔을 도시하였다. 구체적으로, 전자 장치의 디스플레이가 비활성화된 대기 모드에서 사용자가 외부 장치인 게임 콘 솔 전용의 원격 제어 장치를 움직이면, 전자 장치는 외부 장치에서 제공하는 홈 화면 또는 컨텐츠를 프리 로딩할 수 있다. 이때, 전자 장치는 사용자의 외부 장치 사용 이력에 기초하여 적어도 하나 의 화면을 프리 로딩할 수 있으며, 프리 로딩된 화면을 식별하는 동작은 전자 장치 또는 외부 장치에 서도 가능할 수 있다. 그 다음, 사용자가 외부 장치에 대한 제어 명령을 입력하면, 전자 장치는 디스플레이를 활성화하 고, 바로 프리 로딩된 화면 중 제어 명령에 대응되는 화면을 표시할 수 있다. 상술한 바와 같은 외부 장치의 제어로 인한 전자 장치의 모드 변경 및 컨텐츠 제공 모드에서의 동작 제어에 대해서는 이하 도 13을 참조하여 자세히 설명하기로 한다. 한편, 이상에 기재한 바와 같이, 외부 장치의 제어로 인해 전자 장치를 활성화하고, 원하는 화면이 바로 표시되 도록 한다는 점에서 두 장치를 각각 제어해야 했던 사용자의 불편함을 감소시킬 수 있으며, 동시에 사용자에게 향상된 사용 경험을 제공할 수 있다. 도 10은 재생되는 컨텐츠에 따라 환경 설정하는 실시 예를 설명하기 위한 도면이다. 도 10을 참조하면, 전자 장치는 프리 로딩된 적어도 하나의 컨텐츠 제공 소스 중 실행되는 컨텐츠 제공 소 스의 컨텐츠에 기초하여 전자 장치 및 주변 장치의 설정 변경을 확인받기 위한 UI 화면을 표시할 수 있다. 구체적으로, 전자 장치는 재생되는 컨텐츠에 기초하여 전자 장치의 화질 및 음질에 대한 설정 을 변경할 수 있다. 그리고, 전자 장치는 전자 장치와 연결된 IoT 장치의 설정을 변경하기 위한 제어 명령을 전송할 수 있다. 예를 들어, 재생되는 컨텐츠가 액션 영화라면, 전자 장치는 액션 영화를 재생하는데 적합하도록 전자 장치 의 화질 및 음질에 대한 설정을 변경할 수 있다. 도 10에서는 UI 화면을 통해 사용자의 확인을 받는 것으로 도시하였지만, 실제 구현시에는 사용자의 확인 없이 설정이 변경될 수도 있다. 한편, 전자 장치는 액션 영화를 재생하는데 적합하도록 전자 장치와 연결된 IoT 장치에 대한 설정을 변경할 수 있다. 예를 들어, IoT 전등의 스위치를 끄기 위한 제어 명령, 주변 IoT 기기들의 모드를 소음 저감 모드로 변경하기 위한 제어 명령 또는 도어락을 잠그기 위한 명령을ㄹ 각 IoT 장치에 전송할 수 있다. 도 10에 서는 UI 화면을 통해 사용자의 확인을 받는 것으로 도시하였지만, 실제 구현시에는 사용자의 확인 없이 주변 IoT 장치의 설정이 변경될 수도 있다. 상술한 바와 같이, 재생되는 컨텐츠에 따라 사용자가 직접 변경해야 했던 설정을 자동으로 변경함으로써, 사용 자의 편의성 및 사용 경험을 향상할 수 있는 효과가 있다. 도 11은 본 개시의 일 실시 예에 따른 컨텐츠 재생 방법을 설명하기 위한 흐름도이다. 도 11을 참조하면, 우선 전자 장치는 대기 모드로 동작하는 동안 사용자가 식별되면, 사용자의 사용 이력에 기 초하여 적어도 하나의 컨텐츠 제공 소스를 프리 로딩할 수 있다(S1110). 구체적으로, 전자 장치는 사용자의 지문, 성문 및 스마트폰 ID 중 적어도 하나를 이용하여 사용자가 누구인지 식별되면, 사용자의 사용 이력에 기초하여 사용자가 자주 사용하는 적어도 하나의 컨텐츠 제공 소스를 식별할 수 있다. 그리고, 전자 장치는 식별된 적어도 하나의 컨텐츠 제공 소스를 프리 로딩할 수 있다. 이때, 컨텐츠 제공 소스 가 전자 장치에서 제공되는 것이면, 전자 장치는 저장된 컨텐츠 제공 소스에 대한 정보를 이용하여 프리 로딩할 수 있다. 한편, 적어도 하나의 컨텐츠 제공 소스에 외부 장치에서 제공되는 컨텐츠 제공 소스가 포함되면, 전자 장치는 외부 장치로부터 컨텐츠 제공 소스에 대한 정보를 수신하고, 수신된 정보를 이용하여 적어도 하나의 컨 텐츠 제공 소스의 화면을 프리 로딩할 수 있다. 그리고, 전자 장치의 모드를 컨텐츠 재생 모드로 전환하기 위한 제어 명령이 입력되면, 전자 장치는 디스플레이 를 활성화시키고, 제어 명령에 대응되는 컨텐츠 제공 소스의 화면을 표시할 수 있다(S1120). 구체적으로, 사용자가 대기 모드인 전자 장치의 전원 버튼을 누르거나, 디스플레이를 활성화하기 위한 동작 또 는 컨텐츠 제공 소스의 실행 명령을 입력하면, 전자 장치는 디스플레이를 활성화 시키고, 프리 로딩된 적어도 하나의 컨텐츠 제공 소스의 화면 중 사용자의 제어 명령에 대응되는 화면을 바로 표시할 수 있다. 도 12는 외부 장치로부터 제공되는 컨텐츠 제공 소스의 컨텐츠를 재생하는 방법을 설명하기 위한 시퀀스도이다. 우선 전자 장치는 대기 모드에서 사용자를 식별할 수 있다(S1210). 구체적으로, 전자 장치는 사용자 의 지문, 성문 및 스마트폰 ID 중 적어도 하나를 이용하여 사용자가 누구인지 식별할 수 있다. 그리고, 전자 장치는 식별된 사용자의 사용 이력에 기초하여 사용자가 자주 사용하는 컨텐츠 제공 소스가 외부 장치로부터 제공되는 것이면, 외부 장치에 컨텐츠 정보를 요청할 수 있다(S1220). 이때, 컨텐츠 정보는 외부 장치에서 제공하는 컨텐츠 제공 소스인 어플리케이션의 홈 화면 또는 외부 장치에 저장 되어 있는 컨텐츠를 포함할 수 있다. 외부 장치는 전자 장치의 컨텐츠 정보 요청에 따라 컨텐츠 정보를 전자 장치에 전송할 수 있다 (S1230). 전자 장치는 외부 장치로부터 수신된 컨텐츠 정보를 이용하여 컨텐츠의 화면을 프리 로딩할 수 있다 (S1240). 한편, 도 12에서는 사용자의 선호 컨텐츠가 외부 장치에서 제공되는 것으로 한정하여 도시하였으 나, 사용자가 선호하는 적어도 하나의 컨텐츠에 전자 장치로부터 제공되는 컨텐츠가 포함되면, 전자 장치 에서 제공하는 컨텐츠의 화면도 함께 프리 로딩할 수 있다. 즉, 사용자의 사용 이력에 기초하여 복수의 컨 텐츠가 프리 로딩될 수 있다. 그 다음, 전자 장치는 사용자로부터 제어 명령을 입력받을 수 있다(S1250). 구체적으로, 전자 장치는 대기 모드에서 컨텐츠 재생 모드로 전환하기 위한 사용자의 제어 명령을 입력받을 수 있다. 이때, 제어 명령은 사용자가 대기 모드인 전자 장치의 전원 버튼을 누르거나, 디스플레이를 활성화하기 위한 동작 또는 컨텐 츠 제공 소스의 실행 명령일 수 있다. 그 다음, 전자 장치는 대기 모드에서 컨텐츠 재생 모드로 변환하고, 컨텐츠를 표시할 수 있다(S1260). 구 체적으로, 전자 장치는 디스플레이를 활성화 시키고, 프리 로딩된 적어도 하나의 컨텐츠 중 사용자의 제어 명령에 대응되는 컨텐츠를 바로 표시할 수 있다. 도 13은 도 9에 도시된 외부 장치 제어를 통한 전자 장치의 컨텐츠 재생 방법을 설명하기 위한 시퀀스도이다. 우선, 전자 장치가 대기 모드인 상태에서, 외부 장치는 사용자를 감지할 수 있다(S1310). 그리고, 외 부 장치는 외부 장치 전용의 원격 제어 장치의 움직임을 감지하면, 외부 장치에서 제공하는 컨 텐츠 정보를 전자 장치에 제공할 수 있다(S1320). 이때, 전자 장치에 제공되는 컨텐츠 정보는 외부 장치에서 제공하는 홈 화면, 외부 장치에서 제공하는 컨텐츠 제공 소스인 어플리케이션의 홈 화면 또 는 외부 장치에서 제공하는 컨텐츠일 수 있다. 한편, 외부 장치는 사용자의 음성 또는 원격 제어 장치의 지문 인식 기능을 이용하여 수집된 데이터를 전 자 장치에 함께 전송할 수 있다. 그 다음, 전자 장치는 외부 장치로부터 수신된 컨텐츠 정보에 기초하여 컨텐츠를 프리 로딩할 수 있 다(S1330). 이때, 전자 장치는 여전히 디스플레이가 비활성 상태인 대기 모드일 수 있다. 그리고, 외부 장치는 사용자로부터 제어 명령을 입력받을 수 있다(S1340). 구체적으로, 외부 장치는 음성, 리모컨 또는 스마트폰과 같은 원격 제어 장치를 통해 사용자로부터 제어 명령을 입력받을 수 있다. 그리고, 외부 장치는 전자 장치에 디스플레이 활성화 명령을 전송할 수 있다(S1350). 구체적으로, 외 부 장치는 사용자의 제어 명령에 대응되는 컨텐츠를 표시하기 위해 전자 장치에 디스플레이 활성화 명령을 전송할 수 있다. 이때, 디스플레이 활성화 명령에는 외부 장치에 입력된 사용자의 실행 명령이 포 함될 수 있다. 이 경우, 전자 장치는 컨텐츠 실행 명령에 기초하여 디스플레이를 활성화하기 위한 제어 명 령을 생성할 수 있다.l 즉, 디스플레이 활성화 명령에는 전자 장치의 디스플레이를 활성화 하기 위한 직접 적인 명령 또는 간접적인 명령이 포함될 수 있다. 그 다음, 전자 장치는 모드를 대기 모드에서 컨텐츠 재생 모드로 변환하고, 컨텐츠를 표시할 수 있다 (S1360). 구체적으로, 전자 장치는 디스플레이를 활성화 시키고, 프리 로딩된 외부 장치의 컨텐츠를 바로 표시할 수 있다. 한편, 도시되지는 않았으나, 상술한 과정을 통해 전자 장치가 일반 모드에 해당하는 컨텐츠 재생 모드로 변환되었는 바, 이후 과정에서는 종래 기술과 같이 전자 장치를 제어함으로써 외부 장치를 제어할 수 있게 된다. 상술한 바와 같은 본 개시의 다양한 실시 예에 따르면, 어플리케이션 또는 컨텐츠를 선택하는 과정 없이 바로 원하는 컨텐츠가 표시될 뿐더러, 어플리케이션 실행 명령에 따른 부팅 과정이 생략되므로 사용자의 사용 환경을 향상시킬 수 있다. 또한, 외부 장치의 제어로 인해 전자 장치를 활성화하고, 원하는 화면이 바로 표시되도록 한다는 점에서 두 장치를 각각 제어해야 했던 사용자의 불편함을 감소시킬 수 있으며, 동시에 사용자에게 향상 된 사용 경험을 제공할 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합된 것 을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드 웨어적인 구현에 의하면, 본 개시에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기 (controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행 을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되 는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 상기 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 전자 장치의 제어 방법은 비일시적 판독 가능 매체(non- transitory readable medium) 에 저장될 수 있다. 이러한 비일시적 판독 가능 매체는 다양한 장치에 탑재되어 사용될 수 있다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 방법을 수행하기 위한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시"}
{"patent_id": "10-2018-0005689", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야 에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2018-0005689", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술에 따른 컨텐츠 재생 과정을 설명하기 위한 도면, 도 2는 본 개시의 일 실시 예에 따른 컨텐츠 제공 시스템을 설명하기 위한 도면, 도 3은 본 개시의 일 실시 예에 따른 전자 장치의 간략한 구성을 도시한 블럭도, 도 4는 도 3의 전자 장치의 구체적인 구성을 도시한 블럭도, 도 5는 본 개시의 일 실시 예에 따른 컨텐츠 재생 과정을 설명하기 위한 도면, 도 6 내지 도 8은 사용자 식별 방식의 다양한 실시 예에 따른 컨텐츠 재생 과정을 설명하기 위한 도면, 도 9는 본 개시의 다른 실시 예에 따른 전자 장치의 컨텐츠 재생을 설명하기 위한 도면, 도 10은 재생되는 컨텐츠에 따라 환경 설정하는 실시 예를 설명하기 위한 도면, 도 11은 본 개시의 일 실시 예에 따른 컨텐츠 재생 방법을 설명하기 위한 흐름도, 도 12는 외부 장치로부터 제공되는 컨텐츠 제공 소스의 컨텐츠를 재생하는 방법을 설명하기 위한 시퀀스도, 그 리고, 도 13은 도 9에 도시된 외부 장치 제어를 통한 전자 장치의 컨텐츠 재생 방법을 설명하기 위한 시퀀스도이다."}
