{"patent_id": "10-2021-0158053", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0071640", "출원번호": "10-2021-0158053", "발명의 명칭": "고빈도 증권 거래를 위한 장치 및 그 동작 방법", "출원인": "리벨리온 주식회사", "발명자": "김현성"}}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고빈도 증권 거래를 위한 장치에 있어서,하나 이상의 인스트럭션을 저장하는 제1 메모리;상기 제1 메모리의 하나 이상의 인스트럭션을 실행함으로써, 제1 증권 거래소의 제1 마켓 데이터 및 제2 증권거래소의 제2 마켓 데이터를 수신하고, 상기 제1 마켓 데이터 또는 상기 제2 마켓 데이터 중 적어도 하나를 기초로 기계학습 모델의 입력 데이터를 생성하도록 구성된 적어도 하나의 프로세서 - 상기 적어도 하나의 프로세서는 재프로그래밍 또는 설계 변경이 가능한 프로세서를 포함함 -;하나 이상의 인스트럭션을 저장하는 제2 메모리; 및상기 제2 메모리의 하나의 인스트럭션을 실행함으로써, 상기 생성된 기계학습 모델의 입력 데이터를 수신하고,상기 기계학습 모델을 위한 적어도 일부 연산을 처리하고, 상기 기계학습 모델로부터 출력된 데이터를 상기 적어도 하나의 프로세서에 제공하도록 구성된 상기 기계학습 모델을 위한 전용 가속기를 포함하고,상기 적어도 하나의 프로세서는, 상기 기계학습 모델로부터 출력된 데이터를 기초로 상기 제2 증권 거래소에서의 주문 데이터를 생성하도록 더 구성된,고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는, 필드 프로그래머블 게이트 어레이(FPGA)로 구현되고, 상기 기계학습 모델을 위한 전용 가속기는 뉴럴 처리 유닛을 위한 집적회로(NPU ASIC)로 구현되는,고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 기계학습 모델은, 하나 이상의 증권 거래소의 참조 마켓 데이터를 기초로 생성된 참조 입력 데이터를 이용하여 제2 증권 거래소에서의 증권 주문과 연관된 참조 출력 데이터를 추론하도록 구성된,고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는,상기 기계학습 모델의 입력 데이터를 기초로 예측 복잡도를 결정하고, 상기 결정된 예측 복잡도에 따라, 상기입력 데이터를 기초로 상기 주문 데이터를 생성할 시에 미리 결정된 규칙을 이용할지 또는 상기 기계학습 모델을 이용할지 판정하도록 더 구성되고,상기 미리 결정된 규칙으로 상기 주문 데이터를 생성하도록 판정된 경우, 상기 적어도 하나의 프로세서는, 상기입력 데이터를 기초로 상기 미리 결정된 규칙에 따라 상기 주문 데이터를 생성하도록 더 구성되고,공개특허 10-2023-0071640-3-상기 기계학습 모델을 이용하여 상기 주문 데이터를 생성하도록 판정된 경우, 상기 기계학습 모델을 위한 전용가속기는, 상기 기계학습 모델을 위한 적어도 일부 연산을 처리하고, 상기 기계학습 모델로부터 출력된 데이터를 상기 적어도 하나의 프로세서에 제공하도록 더 구성된,고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,트레이딩 엔진을 구동하도록 구성된 호스트 장치를 더 포함하고,상기 예측 복잡도는 복잡도에 따른 3개의 복잡도 클래스를 포함하고,상기 제2 증권 거래소에서의 주문 데이터를 생성하기 위하여, 상기 입력 데이터는 상기 3개의 복잡도 클래스에따라 상기 적어도 하나의 프로세서, 상기 호스트 장치 또는 상기 기계학습 모델을 위한 전용 가속기 중 적어도하나에 제공되는,고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는, 상기 제1 마켓 데이터 또는 제2 마켓 데이터의 적어도 하나를 파싱 및 디코딩하고, 상기 파싱 및 디코딩된 제1 마켓 데이터 또는 제2 마켓 데이터의 적어도 하나를 기초로 상기 기계학습 모델의 입력 데이터를 생성하도록 더 구성된,고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 기계학습 모델의 입력 데이터는, 하나 이상의 시점에서의 하나 이상의 종목에 대한 하나 이상의 입력 특징을 포함하는, 고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 하나 이상의 종목은 선행 지표를 나타내는 입력 종목 및 상기 제2 증권 거래소에서의 증권 주문 시 대상이되는 종목을 포함하는,고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는, 생성된 주문 데이터를 제2 증권 거래소에서 요구하는 프로토콜에 따라 처리하도록 더 구성된,공개특허 10-2023-0071640-4-고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 제1 증권 거래소의 제1 마켓 데이터는 제1 증권 거래소의 오더북에 대한 정보를 포함하고, 상기 제2 증권거래소의 제2 마켓 데이터는 제2 증권 거래소의 응답 데이터 및 하나 이상의 종목의 오더북에 대한 정보 중 적어도 일부를 포함하는,고빈도 증권 거래를 위한 장치."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "FPGA 및 NPU를 포함하는 고빈도 증권 거래 장치를 동작하는 방법에 있어서,상기 FPGA에 의해, 제1 증권 거래소의 제1 마켓 데이터 및 제2 증권 거래소의 제2 마켓 데이터를 수신하는단계;상기 FPGA에 의해, 상기 제1 마켓 데이터 또는 상기 제2 마켓 데이터 중 적어도 하나를 기초로 기계학습 모델의입력 데이터를 생성하는 단계;상기 NPU에 의해, 상기 기계학습 모델을 위한 적어도 일부 연산을 처리하는 단계;상기 NPU에 의해, 상기 기계학습 모델로부터 출력된 데이터를 상기 FPGA로 제공하는 단계; 및상기 FPGA에 의해, 상기 기계학습 모델로부터 출력된 데이터를 기초로 상기 제2 증권 거래소에서의 주문 데이터를 생성하는 단계를 포함하는, 고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 기계학습 모델은, 하나 이상의 증권 거래소의 참조 마켓 데이터를 기초로 생성된 참조 입력 데이터를 이용하여 타겟 증권 거래소에서의 증권 주문과 연관된 참조 출력 데이터를 추론하도록 구성된,고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 FPGA에 의해, 상기 기계학습 모델의 입력 데이터를 기초로 예측 복잡도를 결정하는 단계;상기 FPGA에 의해, 상기 결정된 예측 복잡도에 따라, 상기 입력 데이터를 기초로 상기 주문 데이터를 생성할 시에 미리 결정된 규칙 또는 상기 기계학습 모델을 사용할지 판정하는 단계;상기 미리 결정된 규칙으로 상기 주문 데이터를 생성하도록 판정된 경우, 상기 FPGA에 의해, 상기 입력 데이터를 기초로 상기 미리 결정된 규칙에 따라 상기 주문 데이터를 생성하는 단계; 및상기 기계학습 모델을 이용하여 상기 주문 데이터를 생성하도록 판정된 경우, 상기 NPU에 의해, 상기 기계학습모델을 위한 적어도 일부 연산을 처리하고, 상기 기계학습 모델로부터 출력된 데이터를 상기 FPGA로 제공하는단계공개특허 10-2023-0071640-5-를 더 포함하는, 고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 고빈도 증권 거래 장치는 트레이딩 엔진을 구동하도록 구성된 호스트 장치를 더 포함하고,상기 예측 복잡도는 복잡도에 따른 3개의 복잡도 클래스를 포함하고,상기 제2 증권 거래소에서의 주문 데이터를 생성하기 위하여, 상기 입력 데이터는 상기 3개의 복잡도 클래스에따라 상기 FPGA, 상기 호스트 장치 또는 상기 NPU 중 적어도 하나에 제공되는,고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 제1 마켓 데이터 또는 제2 마켓 데이터의 적어도 하나를 파싱 및 디코딩하는 단계; 및상기 파싱 및 디코딩된 제1 마켓 데이터 또는 제2 마켓 데이터의 적어도 하나를 기초로 상기 기계학습 모델의입력 데이터를 생성하는 단계를 더 포함하는, 고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 기계학습 모델의 입력 데이터는, 하나 이상의 시점에서의 하나 이상의 종목에 대한 하나 이상의 입력 특징을 포함하는, 고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 하나 이상의 종목은 선행 지표를 나타내는 입력 종목 및 상기 제2 증권 거래소에서의 증권 주문 시 대상이되는 종목을 포함하는,고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 FPGA에 의해, 상기 생성된 주문 데이터를 제2 증권 거래소에서 요구하는 프로토콜에 따라 처리하는 단계를 더 포함하는, 고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 제1 증권 거래소의 제1 마켓 데이터는 제1 증권 거래소의 오더북에 대한 정보를 포함하고, 상기 제2 증권공개특허 10-2023-0071640-6-거래소의 제2 마켓 데이터는 제2 증권 거래소의 응답 데이터 및 하나 이상의 종목의 오더북에 대한 정보 중 적어도 일부를 포함하는, 고빈도 증권 거래 장치를 동작하는 방법."}
{"patent_id": "10-2021-0158053", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항 내지 제19항 중 어느 한 항에 따른 방법을 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에저장된 컴퓨터 프로그램."}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 고빈도 증권 거래를 위한 장치에 관한 것이다. 고빈도 증권 거래를 위한 장치는 하나 이상의 인스트 럭션을 저장하는 제1 메모리, 제1 메모리의 하나 이상의 인스트럭션을 실행함으로써 제1 증권 거래소의 제1 마켓 데이터 및 제2 증권 거래소의 제2 마켓 데이터를 수신하고, 제1 마켓 데이터 또는 제2 마켓 데이터 중 적어도 하 (뒷면에 계속)"}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 고빈도 증권 거래를 위한 장치 및 그 동작 방법에 관한 것으로, 구체적으로, 기계학습 모델을 위한 가속기 및 재프로그래밍 또는 설계 변경이 가능한 적어도 하나의 프로세서를 이용하여 고빈도 증권 거래를 위한 주문 데이터를 생성하는 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "고빈도 증권 거래(high frequency trading)는 주식, 채권, 파생상품 등 유가 증권의 미세한 가격 변동을 이용하 여, 짧은 시간 안에 높은 빈도로(예를 들어, 1초에 수백 번에서 수천 번) 거래하는 거래 방식이다. 고빈도 증 권 거래에 있어서는 빠른 처리 속도가 매우 중요하다. 일반적으로, 입력된 정보를 기초로 트레이딩 알고리즘을 처리하여 출력을 내보내기까지의 시간을 단축할수록 거래에서 우위를 선점할 수 있다. 한편, 기계학습 모델을 이용한 고빈도 증권 거래는 시장의 복잡한 정보로부터 기존의 고전적인 알고리즘이 찾지 못하는 특징을 찾을 수 있다는 장점이 있다. 다만, 기계학습 모델의 연산을 저장하고 처리하기 위해서는 많은 저장 공간과 연산 자원을 보유한 프로세서가 필요한데, 일반적으로 고빈도 증권 거래에 사용되는 프로세서는 이 러한 자원을 보유하지 않는다는 문제점이 있다. 또한, 기계학습 모델 구동에 적합한 프로세서는 유연성이 클수록 효율성이 떨어져, 시장 상황에 따라 빈번하게 변경될 수 있는 전처리 과정 또는 후처리 과정을 수행하기에는 적합하지 않다는 문제점이 있다."}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상기와 같은 문제점을 해결하기 위한 고빈도 증권 거래를 위한 장치 및 그 동작 방법, 기록매체에 저 장된 컴퓨터 프로그램을 제공한다."}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 방법, 장치(시스템) 또는 판독 가능 저장 매체에 저장된 컴퓨터 프로그램을 포함한 다양한 방식으로 구현될 수 있다. 본 개시의 일 실시예에 따른 고빈도 증권 거래를 위한 장치는 하나 이상의 인스트럭션을 저장하는 제1 메모리, 제1 메모리의 하나 이상의 인스트럭션을 실행함으로써, 제1 증권 거래소의 제1 마켓 데이터 및 제2 증권 거래소 의 제2 마켓 데이터를 수신하고, 제1 마켓 데이터 또는 제2 마켓 데이터 중 적어도 하나를 기초로 기계학습 모 델의 입력 데이터를 생성하도록 구성된 적어도 하나의 프로세서 - 적어도 하나의 프로세서는 재프로그래밍 또는 설계 변경이 가능한 프로세서를 포함함 -, 하나 이상의 인스트럭션을 저장하는 제2 메모리 및 제2 메모리의 하 나의 인스트럭션을 실행함으로써, 생성된 기계학습 모델의 입력 데이터를 수신하고, 기계학습 모델을 위한 적어 도 일부 연산을 처리하고, 기계학습 모델로부터 출력된 데이터를 적어도 하나의 프로세서에 제공하도록 구성된기계학습 모델을 위한 전용 가속기를 포함하고, 적어도 하나의 프로세서는, 기계학습 모델로부터 출력된 데이터 를 기초로 제2 증권 거래소에서의 주문 데이터를 생성하도록 더 구성된다. 본 개시의 일 실시예에 따르면, 적어도 하나의 프로세서는, 필드 프로그래머블 게이트 어레이(FPGA)로 구현되고, 기계학습 모델을 위한 전용 가속기는 뉴럴 처리 유닛을 위한 집적회로(NPU ASIC)로 구현된다. 본 개시의 일 실시예에 따르면, 기계학습 모델은, 하나 이상의 증권 거래소의 참조 마켓 데이터를 기초로 생성 된 참조 입력 데이터를 이용하여 제2 증권 거래소에서의 증권 주문과 연관된 참조 출력 데이터를 추론하도록 구 성된다. 본 개시의 일 실시예에 따르면, 적어도 하나의 프로세서는, 기계학습 모델의 입력 데이터를 기초로 예측 복잡도 를 결정하고, 결정된 예측 복잡도에 따라, 입력 데이터를 기초로 주문 데이터를 생성할 시에 미리 결정된 규칙 을 이용할지 또는 기계학습 모델을 이용할지 판정하도록 더 구성되고, 미리 결정된 규칙으로 주문 데이터를 생 성하도록 판정된 경우, 적어도 하나의 프로세서는, 입력 데이터를 기초로 미리 결정된 규칙에 따라 주문 데이터 를 생성하도록 더 구성되고, 기계학습 모델을 이용하여 주문 데이터를 생성하도록 판정된 경우, 기계학습 모델 을 위한 전용 가속기는, 기계학습 모델을 위한 적어도 일부 연산을 처리하고, 기계학습 모델로부터 출력된 데이 터를 적어도 하나의 프로세서에 제공하도록 더 구성된다. 본 개시의 일 실시예에 따르면, 트레이딩 엔진을 구동하도록 구성된 호스트 장치를 더 포함하고, 예측 복잡도는 복잡도에 따른 3개의 복잡도 클래스를 포함하고, 제2 증권 거래소에서의 주문 데이터를 생성하기 위하여, 입력 데이터는 3개의 복잡도 클래스에 따라 적어도 하나의 프로세서, 호스트 장치 또는 기계학습 모델을 위한 전용 가속기 중 적어도 하나에 제공된다. 본 개시의 일 실시예에 따르면, 적어도 하나의 프로세서는, 제1 마켓 데이터 또는 제2 마켓 데이터의 적어도 하 나를 파싱 및 디코딩하고, 파싱 및 디코딩된 제1 마켓 데이터 또는 제2 마켓 데이터의 적어도 하나를 기초로 기 계학습 모델의 입력 데이터를 생성하도록 더 구성된다. 본 개시의 일 실시예에 따르면, 기계학습 모델의 입력 데이터는, 하나 이상의 시점에서의 하나 이상의 종목에 대한 하나 이상의 입력 특징을 포함한다. 본 개시의 일 실시예에 따르면, 하나 이상의 종목은 선행 지표를 나타내는 입력 종목 및 제2 증권 거래소에서의 증권 주문 시 대상이 되는 종목을 포함한다. 본 개시의 일 실시예에 따르면, 적어도 하나의 프로세서는, 기 생성된 주문 데이터를 제2 증권 거래소에서 요구 하는 프로토콜에 따라 처리하도록 더 구성된다. 본 개시의 일 실시예에 따르면, 제1 증권 거래소의 제1 마켓 데이터는 제1 증권 거래소의 오더북에 대한 정보를 포함하고, 제2 증권 거래소의 제2 마켓 데이터는 제2 증권 거래소의 응답 데이터 및 하나 이상의 종목의 오더북 에 대한 정보 중 적어도 일부(ToB)를 포함한다. 본 개시의 일 실시예에 따르면, FPGA 및 NPU를 포함하는 고빈도 증권 거래 장치를 동작하는 방법은 FPGA에 의해, 제1 증권 거래소의 제1 마켓 데이터 및 제2 증권 거래소의 제2 마켓 데이터를 수신하는 단계, FPGA에 의 해, 제1 마켓 데이터 또는 제2 마켓 데이터 중 적어도 하나를 기초로 기계학습 모델의 입력 데이터를 생성하는 단계, NPU에 의해, 기계학습 모델을 위한 적어도 일부 연산을 처리하는 단계, NPU에 의해, 기계학습 모델로부터 출력된 데이터를 FPGA로 제공하는 단계 및 FPGA에 의해, 기계학습 모델로부터 출력된 데이터를 기초로 제2 증권 거래소에서의 주문 데이터를 생성하는 단계를 포함한다. 본 개시의 일 실시예에 따르면, 기계학습 모델은, 하나 이상의 증권 거래소의 참조 마켓 데이터를 기초로 생성 된 참조 입력 데이터를 이용하여 타겟 증권 거래소에서의 증권 주문과 연관된 참조 출력 데이터를 추론하도록 구성된다. 본 개시의 일 실시예에 따르면, 방법은 FPGA에 의해, 기계학습 모델의 입력 데이터를 기초로 예측 복잡도를 결 정하는 단계, FPGA에 의해, 결정된 예측 복잡도에 따라, 입력 데이터를 기초로 주문 데이터를 생성할 시에 미리 결정된 규칙 또는 기계학습 모델을 사용할지 판정하는 단계, 미리 결정된 규칙으로 주문 데이터를 생성하도록 판정된 경우, FPGA에 의해, 입력 데이터를 기초로 미리 결정된 규칙에 따라 주문 데이터를 생성하는 단계 및 기 계학습 모델을 이용하여 주문 데이터를 생성하도록 판정된 경우, NPU에 의해, 기계학습 모델을 위한 적어도 일 부 연산을 처리하고, 기계학습 모델로부터 출력된 데이터를 FPGA로 제공하는 단계를 더 포함한다.본 개시의 일 실시예에 따르면, 고빈도 증권 거래 장치는 트레이딩 엔진을 구동하도록 구성된 호스트 장치를 더 포함하고, 예측 복잡도는 복잡도에 따른 3개의 복잡도 클래스를 포함하고, 제2 증권 거래소에서의 주문 데이터 를 생성하기 위하여, 입력 데이터는 3개의 복잡도 클래스에 따라 FPGA, 호스트 장치 또는 NPU 중 적어도 하나에 제공된다. 본 개시의 일 실시예에 따르면, 방법은 제1 마켓 데이터 또는 제2 마켓 데이터의 적어도 하나를 파싱 및 디코딩 하는 단계 및 파싱 및 디코딩된 제1 마켓 데이터 또는 제2 마켓 데이터의 적어도 하나를 기초로 기계학습 모델 의 입력 데이터를 생성하는 단계를 더 포함한다. 본 개시의 일 실시예에 따르면, 기계학습 모델의 입력 데이터는, 하나 이상의 시점에서의 하나 이상의 종목에 대한 하나 이상의 입력 특징을 포함한다. 본 개시의 일 실시예에 따르면, 하나 이상의 종목은 선행 지표를 나타내는 입력 종목 및 제2 증권 거래소에서의 증권 주문 시 대상이 되는 종목을 포함한다. 본 개시의 일 실시예에 따르면, 방법은 FPGA에 의해, 생성된 주문 데이터를 제2 증권 거래소에서 요구하는 프로 토콜에 따라 처리하는 단계를 더 포함한다. 본 개시의 일 실시예에 따르면, 제1 증권 거래소의 제1 마켓 데이터는 제1 증권 거래소의 오더북에 대한 정보를 포함하고, 제2 증권 거래소의 제2 마켓 데이터는 제2 증권 거래소의 응답 데이터 및 하나 이상의 종목의 오더북 에 대한 정보 중 적어도 일부를 포함한다. 본 개시의 일 실시예에 따른 방법을 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램이 제공된다."}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일부 실시예에 따르면, 기계학습 모델을 이용함으로써, 복잡한 시장 상황으로부터 고전적인 알고리즘 이 찾아내지 못하는 특징을 찾아내고 미래 시점의 시장 상황을 예측할 수 있으며, 이를 이용하여 주문을 생성함 으로써 거래에서 우위를 가져갈 수 있다. 본 개시의 일부 실시예에 따르면, 기계학습 모델을 구동하는 프로세서는 전용 가속기(예를 들어, NPU ASIC)로 구성함으로써 빠르고 효율적으로 기계학습 모델의 연산을 처리할 수 있으며, 전/후 처리 과정은 재프로그래밍 또는 재설계가 가능한 프로세서(예를 들어, FPGA)를 이용하여 처리함으로써 변화된 시장 상황에 맞춰 유연하게 전/후 처리 과정을 변경할 수 있다. 이와 같이, 서로 다른 두개 이상의 프로세서를 사용함으로써, 유연한 전/ 후 처리 과정의 구현 및 효율적이고 빠른 기계학습 모델의 연산 처리를 동시에 실현할 수 있다. 본 개시의 일부 실시예에 따르면, 입력 데이터를 기초로 예측 복잡도를 결정하고, 예측 복잡도가 높은 경우 기 계학습 모델을 이용하여 주문 관련 데이터를 생성함으로써 고전적인 알고리즘이 찾아내지 못하는 특징을 찾아내 고 미래 시점의 시장 상황을 예측할 수 있으며, 예측 복잡도가 낮은 경우 비교적 간단한 트레이딩 로직을 이용 하여 곧바로 주문 데이터를 생성함으로써 빠르게 주문을 전송하여 거래에서 우위를 선점할 수 있다. 본 개시의 일부 실시예에 따르면, 장치(예를 들어, FPGA) 내에서, 마켓 데이터에 대한 처리를 수행하고 이를 이 용하여 주문 데이터를 생성하여 주문을 전송하는 일련의 과정을 수행함으로써, 지연 시간(latency)를 최소화할 수 있다. 본 개시의 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급되지 않은 다른 효과들은 청구범위의 기재로부"}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자(“통상의 기술자”라 함)에게 명확하게 이해될 수 있 을 것이다."}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 실시를 위한 구체적인 내용을 첨부된 도면을 참조하여 상세히 설명한다. 다만, 이하의 설명에 서는 본 개시의 요지를 불필요하게 흐릴 우려가 있는 경우, 널리 알려진 기능이나 구성에 관한 구체적 설명은 생략하기로 한다. 첨부된 도면에서, 동일하거나 대응하는 구성요소에는 동일한 참조부호가 부여되어 있다. 또한, 이하의 실시예 들의 설명에 있어서, 동일하거나 대응되는 구성요소를 중복하여 기술하는 것이 생략될 수 있다. 그러나, 구성 요소에 관한 기술이 생략되어도, 그러한 구성요소가 어떤 실시예에 포함되지 않는 것으로 의도되지는 않는다. 개시된 실시예의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예 들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 개시가 완전하도록 하고, 본 개시가 통상의 기술 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 개시된 실시예에 대해 구체적으로 설명하기로 한다. 본 명세서에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 관련 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서, 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어 가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서의 단수의 표현은 문맥상 명백하게 단수인 것으로 특정하지 않는 한, 복수의 표현을 포함한다. 또한, 복수의 표현은 문맥상 명백하게 복수인 것으로 특정하지 않는 한, 단수의 표현을 포함한다. 명세서 전체 에서 어떤 부분이 어떤 구성요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에서 사용되는 '모듈' 또는 '부'라는 용어는 소프트웨어 또는 하드웨어 구성요소를 의미하며, '모 듈' 또는 '부'는 어떤 역할들을 수행한다. 그렇지만, '모듈' 또는 '부'는 소프트웨어 또는 하드웨어에 한정되 는 의미는 아니다. '모듈' 또는 '부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서, '모듈' 또는 '부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과,프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이 크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 또는 변수들 중 적어도 하나를 포 함할 수 있다. 구성요소들과 '모듈' 또는 '부'들은 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '모듈' 또는 '부'들로 결합되거나 추가적인 구성요소들과 '모듈' 또는 '부'들로 더 분리될 수 있다. 본 개시의 일 실시예에 따르면, '모듈' 또는 '부'는 프로세서 및 메모리로 구현될 수 있다. '프로세서'는 범용 프로세서, 중앙 처리 장치(CPU), 마이크로프로세서, 디지털 신호 프로세서(DSP), 제어기, 마이크로제어기, 상태 머신 등을 포함하도록 넓게 해석되어야 한다. 몇몇 환경에서, '프로세서'는 주문형 반도체(ASIC), 프로그램가 능 로직 디바이스(PLD), 필드 프로그램가능 게이트 어레이(FPGA) 등을 지칭할 수도 있다. '프로세서'는, 예를 들어, DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서들의 조합, DSP 코어와 결합한 하나 이상의 마 이크로프로세서들의 조합, 또는 임의의 다른 그러한 구성들의 조합과 같은 처리 디바이스들의 조합을 지칭할 수 도 있다. 또한, '메모리'는 전자 정보를 저장 가능한 임의의 전자 컴포넌트를 포함하도록 넓게 해석되어야 한 다. '메모리'는 임의 액세스 메모리(RAM), 판독-전용 메모리(ROM), 비-휘발성 임의 액세스 메모리(NVRAM), 프 로그램가능 판독-전용 메모리(PROM), 소거-프로그램가능 판독 전용 메모리(EPROM), 전기적으로 소거가능 PROM(EEPROM), 플래쉬 메모리, 자기 또는 광학 데이터 저장장치, 레지스터들 등과 같은 프로세서-판독가능 매체 의 다양한 유형들을 지칭할 수도 있다. 프로세서가 메모리로부터 정보를 판독하고/하거나 메모리에 정보를 기 록할 수 있다면 메모리는 프로세서와 전자 통신 상태에 있다고 불린다. 프로세서에 집적된 메모리는 프로세서 와 전자 통신 상태에 있다. 본 개시에서, '시스템'은 서버 장치와 클라우드 장치 중 적어도 하나의 장치를 포함할 수 있으나, 이에 한정되 는 것은 아니다. 예를 들어, 시스템은 하나 이상의 서버 장치로 구성될 수 있다. 다른 예로서, 시스템은 하나 이상의 클라우드 장치로 구성될 수 있다. 또 다른 예로서, 시스템은 서버 장치와 클라우드 장치가 함께 구성되 어 동작될 수 있다. 본 개시에서, '기계학습 모델'은 주어진 입력에 대한 해답(answer)을 추론하는데 사용하는 임의의 모델을 포함 할 수 있다. 일 실시예에 따르면, 기계학습 모델은 입력 레이어(층), 복수 개의 은닉 레이어 및 출력 레이어를 포함한 인공신경망 모델을 포함할 수 있다. 여기서, 각 레이어는 복수의 노드를 포함할 수 있다. 또한, 본 개 시에서, 기계학습 모델은 인공신경망 모델을 지칭할 수 있으며, 인공신경망 모델은 기계학습 모델을 지칭할 수 있다. 본 개시에서, '디스플레이'는 컴퓨팅 장치와 연관된 임의의 디스플레이 장치를 지칭할 수 있는데, 예를 들어, 컴퓨팅 장치에 의해 제어되거나 컴퓨팅 장치로부터 제공된 임의의 정보/데이터를 표시할 수 있는 임의의 디스플 레이 장치를 지칭할 수 있다. 본 개시에서, '복수의 A의 각각' 또는 '복수의 A 각각'은 복수의 A에 포함된 모든 구성 요소의 각각을 지칭하거 나, 복수의 A에 포함된 일부 구성 요소의 각각을 지칭할 수 있다. 본 개시에서, '종목'이란, 증권 시장에서 매매 거래의 대상이 되는 주식, 채권, 파생상품(옵션, 선물 등)과 같 은 유가 증권을 내용과 형식에 따라 분류한 것을 지칭할 수 있다. 종목은 개별 종목 이외에 지수 관련 종목, 산업 섹터와 관련된 종목, 특정 상품(예를 들어, 원유, 농산물, 금 등)에 대한 종목, 환율 관련 종목 등도 포함 할 수 있다. 본 개시에서, '증권 거래소'란, 적어도 하나의 국가에서 유통되는 유가 증권을 유통하는 곳으로서, 각 기업이나 정보 등이 발행한 유가 증권을 상장하여 거래할 수 있도록 중개하는 곳을 지칭할 수 있다. 일 실시예에서, 증 권 거래소는 증권 거래소의 시스템을 포함할 수 있다. 본 개시에서, '오더북(Order Book; OB)'은 증권 시장에 존재하는 매수 희망자와 매도 희망자의 매수 주문 또는 매도 주문(호가, 수량, 매수 희망자 또는 매도 희망자 정보 등)에 대한 정보를 기록한 목록을 포함할 수 있다. 본 개시에서, '오더북의 상단(Top of the Book; ToB)'은 가장 높은 매수가와 가장 낮은 매도가에 대한 정보를 포함할 수 있다. 도 1은 본 개시의 일 실시예에 따른 고빈도 증권 거래 장치의 작동 예시를 나타내는 개요도이다. 일 실시예에 따르면, 고빈도 증권 거래 장치는 마켓 데이터를 기초로 미래 시점(가까운 미래 시점, 예를 들어, 미리 정해진 시간 후)의 시장 상황을 예측할 수 있으며, 이를 기초로 타겟 종목에 대한 주문을 생성하여 타겟 증권 거래소 (제2 증권 거래소)에 전송할 수 있다. 고빈도 증권 거래(High Frequency Trading)에 있어서, 마켓 데이터를 기 초로 빠른 속도로 주문을 생성하여 전송하는 것이 매우 중요하다. 이 때문에, 고빈도 증권 거래에서는 마이크로초 단위의 지연 시간(latency)까지 고려되어야 하며, 지연 시간을 감소시키기 위해 고빈도 증권 거래 장치는 타겟 증권 거래소(제2 증권 거래소)의 서버와 가까운 곳에 위치(colocation)할 수 있다. 일 실시예에 따르면, 고빈도 증권 거래 장치는 제1 증권 거래소로부터 마켓 데이터를 수신할 수 있다. 여기서, 마켓 데이터는 제1 증권 거래소에서 거래되는 종목들에 대한 데이터를 포함할 수 있다. 예를 들어, 마켓 데이 터는 제1 증권 거래소에서 거래되는 종목들(중 적어도 일부)의 오더북을 포함할 수 있다. 일 실시예에서, 마켓 데이터는 타겟 종목에 대한 데이터를 포함할 수 있다. 예를 들어, 마켓 데이터는 타겟 종목의 오더북의 상단, 타겟 종목에 대한 (유효한) 주문 목록, 타겟 종목에 관한 이전 주문에 대한 제2 증권 거래소의 응답 등을 포함 할 수 있다. 다른 실시예에서, 고빈도 증권 거래 장치가 제1 증권 거래소 서버에서 멀리 위치하는 경우, 제1 증권 거래소의 데이터를 수신하는데 걸리는 지연 시간이 비교적 긴 것을 고려하여, 제1 증권 거래소의 데이터를 마켓 데이터에 포함시키지 않을 수 있다. 도 1에서 제1 증권 거래소는 하나의 증권 거래소인 것처럼 도시되었 으나, 이는 설명의 편의를 위한 것일 뿐이며, 제1 증권 거래소는 하나 이상의 증권 거래소를 포함할 수 있다. 또한, 도 1에서 제1 증권 거래소는 제2 증권 거래소와 다른 별개의 거래소인 것처럼 도시되었으나, 이 역시 설 명의 편의를 위한 것일 뿐이며, 제1 증권 거래소는 제2 증권 거래소를 포함할 수 있다. 일 실시예에 따르면, 고빈도 증권 거래 장치는 마켓 데이터를 분석하여 주문을 생성할 수 있다. 예를 들어, 고 빈도 증권 거래 장치는 마켓 데이터(또는 마켓 데이터를 기초로 생성된 입력 데이터)를 분석하여, 미래 시점(예 를 들어, 1초 후)에서의 시장 상황(예를 들어, 타겟 종목의 가격)을 예측하고, 이를 기초로 주문을 생성할 수 있다. 일 실시예에 따르면, 마켓 데이터(및/또는 이에 기초하여 생성된 입력 데이터)를 분석하는 과정은 기계학습 모 델(예를 들어, DNN)에 의해 수행될 수 있다. 기계학습 모델을 이용함으로써, 복잡한 시장 상황으로부터 고전적 인 알고리즘이 찾아내지 못하는 특징을 찾아내고 미래 시점의 시장 상황을 예측할 수 있으며, 이를 이용하여 주 문을 생성함으로써 거래에서 우위를 가져갈 수 있다. 한편, 고빈도 증권 거래에 있어서 마켓 데이터를 빠르게 분석하여 주문을 생성하는 것이 매우 중요한데, 일반적인 프로세서의 경우 복잡한 기계학습 모델의 연산을 처리 하기 위한 저장 공간과 연산 자원을 보유하고 있지 않아 일반적인 프로세서를 이용하여 기계학습 모델을 구동하 는 경우, 속도 및 효율이 매우 떨어진다는 문제점이 있다. 이에 따라, 본 개시의 일 실시예에 따른 고빈도 증 권 거래 장치는, 기계학습 모델을 위한 전용 가속기(예를 들어, 뉴럴 처리 유닛(Neural Processing Unit; NP U))를 포함할 수 있으며, 전용 가속기는 뉴럴 처리 유닛을 위한 집적회로(예를 들어, Application-Specific Integrated Circuit; ASIC)로 구현될 수 있다. 한편, 기계학습 모델을 이용하는 경우, 적절한 전/후 처리 과정이 필요할 수 있다. 예를 들어, 마켓 데이터로 부터 기계학습 모델의 입력 데이터를 생성하거나, 기계학습 모델로부터 출력된 데이터를 기초로 주문 데이터를 생성하는 과정이 필요할 수 있다. 이러한 전/후 처리 과정은 시장 상황, 규율, 마켓 메이커에 대한 보상 규정 등의 변화에 따라 지속적으로 변경될 수 있다. 이러한 전/후 처리 과정을 처리하는 프로세서를 특정 용도로 맞 춤 제작된 주문형 반도체(예를 들어, ASIC)로 구현하는 경우, 재설계가 불가능하여 전/후 처리 과정이 변경되는 경우 변경된 전/후 처리 과정을 수행하기 위한 프로세서를 다시 제작해야 한다는 문제점이 있다. 따라서, 기계 학습 모델의 구동을 제외한 과정은 재프로그래밍 및/또는 설계 변경이 가능한 프로세서(예를 들어, 필드 프로그 래머블 게이트 어레이(Field Programmable Gate Array; FPGA)로 구현된 프로세서)에 의해 수행될 수 있다. 상술한 바와 같이, 기계학습 모델을 구동하는 프로세서는 전용 가속기(예를 들어, NPU ASIC)로 구성함으로써 빠 르고 효율적으로 기계학습 모델의 연산을 처리할 수 있으며, 전/후 처리 과정은 재프로그래밍 또는 재설계가 가 능한 프로세서(예를 들어, FPGA)를 이용하여 처리함으로써 변화된 시장 상황에 맞춰 유연하게 전/후 처리 과정 을 변경할 수 있다. 이와 같이, 서로 다른 두 개 이상의 프로세서를 사용함으로써, 유연한 전/후 처리 과정의 구현 및 효율적이고 빠른 기계학습 모델의 연산 처리를 동시에 실현할 수 있다. 고빈도 증권 거래 장치의 내부 구성은 도 2 내지 도 4를 참조하여 상세히 후술된다. 도 2는 본 개시의 일 실시예에 따른 고빈도 증권 거래 장치의 내부 구성을 나타내는 블록도이다. 고빈도 증권 거래 장치는 메모리, 프로세서, 통신 모듈 및 입출력 인터페이스를 포함할 수 있다. 도 2에 도시된 바와 같이, 고빈도 증권 거래 장치는 통신 모듈을 이용하여 네트워크를 통해 정보 및/또는 데이터를 통신할 수 있도록 구성될 수 있다. 메모리는 비-일시적인 임의의 컴퓨터 판독 가능한 기록매체를 포함할 수 있다. 일 실시예에 따르면, 메모 리는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device)를 포함할수 있다. 다른 예로서, ROM, SSD, 플래시 메모리, 디스크 드라이브 등과 같은 비소멸성 대용량 저장 장치는 메 모리와는 구분되는 별도의 영구 저장 장치로서 고빈도 증권 거래 장치에 포함될 수 있다. 또한, 메모리 에는 운영체제와 적어도 하나의 프로그램 코드(예를 들어, 고빈도 증권 거래 장치에 설치되어 구동되 는 기계학습 모델의 연산 처리, 전/후 처리, 증권 주문 전송 등을 위한 코드)가 저장될 수 있다. 도 2에서, 메 모리는 단일 메모리인 것으로 도시되었지만, 이는 설명의 편의를 위한 것일 뿐이며, 메모리는 복수의 메모리를 포함할 수 있다. 이러한 소프트웨어 구성요소들은 메모리와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있 다. 이러한 별도의 컴퓨터에서 판독 가능한 기록매체는 이러한 고빈도 증권 거래 장치에 직접 연결가능한 기록 매체를 포함할 수 있는데, 예를 들어, 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카 드 등의 컴퓨터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 예로서, 소프트웨어 구성요소들은 컴퓨터에 서 판독 가능한 기록매체가 아닌 통신 모듈을 통해 메모리에 로딩될 수도 있다. 예를 들어, 적어도 하나의 프로그램은 개발자들 또는 어플리케이션의 설치 파일을 배포하는 파일 배포 시스템이 통신 모듈을 통해 제공하는 파일들에 의해 설치되는 컴퓨터 프로그램(예를 들어, 마켓 데이터 분석, 미래 시장 예측, 증권 주문 생성 및 전송 등을 위한 프로그램 등)에 기반하여 메모리에 로딩될 수 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리 또는 통신 모듈에 의해 사용자 단말(미도시) 또는 다른 외부 시스템 으로 제공될 수 있다. 예를 들어, 프로세서는 기계학습 모델을 이용하여, 입력 데이터를 기초로 출력 데 이터를 생성할 수 있으며, 출력 데이터를 기초로 주문 데이터를 생성할 수 있다. 이렇게 생성된 주문 데이터는 제2 증권 거래소 시스템으로 전송될 수 있다. 통신 모듈은 네트워크를 통해 사용자 단말(미도시)과 고빈도 증권 거래 장치가 서로 통신하기 위한 구성 또는 기능을 제공할 수 있으며, 고빈도 증권 거래 장치가 외부 시스템(일례로 별도의 클라우드 시스 템 등)과 통신하기 위한 구성 또는 기능을 제공할 수 있다. 일례로, 고빈도 증권 거래 장치의 프로세서 의 제어에 따라 제공되는 제어 신호, 명령, 데이터 등이 통신 모듈과 네트워크를 거쳐 사용자 단말 및/또는 외부 시스템의 통신 모듈을 통해 사용자 단말 및/또는 외부 시스템으로 전송될 수 있다. 예를 들어, 외부 시스템(증권 거래소 시스템)은 고빈도 증권 거래 장치로부터 주문 데이터 등을 전달받을 수 있다. 또한, 고빈도 증권 거래 장치의 입출력 인터페이스는 고빈도 증권 거래 장치와 연결되거나 고빈 도 증권 거래 장치가 포함할 수 있는 입력 또는 출력을 위한 장치(미도시)와의 인터페이스를 위한 수단일 수 있다. 예를 들면, 입출력 인터페이스는 PCI express 인터페이스, 이더넷(ethernet) 인터페이스 중 적 어도 하나를 포함할 수 있다. 도 2에서는 입출력 인터페이스가 프로세서와 별도로 구성된 요소로서 도시되었으나, 이에 한정되지 않으며, 입출력 인터페이스가 프로세서에 포함되도록 구성될 수 있다. 고빈도 증권 거래 장치는 도 2의 구성요소들보다 더 많은 구성요소들을 포함할 수 있다. 그러나, 대부분 의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 고빈도 증권 거래 장치의 프로세서는 복수의 사용자 단말 및/또는 복수의 외부 시스템으로부터 수신 된 정보 및/또는 데이터를 관리, 처리 및/또는 저장하도록 구성될 수 있다. 일 실시예에 따르면, 프로세서 는 제1 증권 거래소 시스템 및 제2 증권 거래소 시스템으로부터 마켓 데이터를 수신할 수 있다. 프로세서 는 수신된 마켓 데이터를 기초로 미래 시장 상황을 예측하고, 예측된 시장 상황에 기초하여 주문 데이터를 생성 할 수 있다. 도 2에서, 프로세서는 단일 프로세서인 것으로 도시되었지만, 이는 설명의 편의를 위한 것일 뿐이며, 프로세서는 복수의 프로세서를 포함할 수 있다. 예를 들어, 프로세서는 전처리 및 후처리를 위한 FPGA로 구현된 적어도 하나의 프로세서, 기계학습 모델을 위한 ASIC으로 구현된 전용 가속기를 포함할 수 있으며, FPGA로 구현된 적어도 하나의 프로세서는 제1 메모리에 저장된 하나 이상의 인스트럭션을 실행하고, ASIC으로 구현된 전용 가속기는 제2 메모리에 저장된 하나 이상의 인스트럭션을 실행할 수 있다. 도 3은 본 개시의 일 실시예에 따른 프로세서의 내부 구성을 나타내는 도면이다. 일 실시예에 따르면, 프로세 서(예를 들어, 고빈도 증권 거래 장치 또는 고빈도 증권 주문 데이터 생성 장치의 프로세서)는 전/후 처리 를 위한 적어도 하나의 프로세서(예를 들어, FPGA로 구현된 적어도 하나의 프로세서) 및 기계학습 모델을 위한 전용 가속기(예를 들어, ASIC으로 구현된 전용 가속기)를 포함할 수 있다. 전/후 처리를 위한 적어 도 하나의 프로세서는 입력 핸들러, 입력 생성부, 주문 생성부, 출력 핸들러를 포함 할 수 있다. 도 3에서 프로세서의 내부 구성을 기능별로 구분하여 설명하지만, 이는 반드시 물리적으로 구분되 는 것을 의미하지 않는다는 것을 밝혀 둔다. 또한, 도 3에서 도시한 프로세서의 내부 구성은 예시일 뿐이며,필수 구성만을 도시한 것은 아니다. 따라서, 일부 실시예에서 프로세서는 도시한 내부 구성 외 다른 구성을 추 가로 포함하거나, 도시한 구성 내부 중 일부 구성이 생략되는 등 다르게 구현될 수 있다. 일 실시예에 따르면, 프로세서는 하나 이상의 증권 거래소(예를 들어, 제1 증권 거래소, 제2 증권 거래소)로부 터 마켓 데이터를 수신할 수 있다. 일 실시예에서, 하나 이상의 증권 거래소는 타겟 증권 거래소를 포함할 수 있다. 수신되는 마켓 데이터는 하나 이상의 증권 거래소에서 거래되는 종목들에 대한 데이터를 포함할 수 있다. 예를 들어, 마켓 데이터는 증권 거래소에서 거래되는 종목들(중 적어도 일부)의 오더북을 포함할 수 있 으며, 추가적으로 마켓 데이터는 타겟 종목에 대한 데이터를 포함할 수 있다. 예를 들어, 마켓 데이터는 타겟 종목의 오더북의 상단, 타겟 종목에 대한 (유효한)주문 목록, 타겟 종목에 관한 이전 주문에 대한 타겟 증권 거 래소(제2 증권 거래소)의 응답 등을 포함할 수 있다. 프로세서는 마켓 데이터의 갱신이 필요할 때마다 하나 이 상의 증권 거래소로부터 마켓 데이터를 수신하거나, 하나 이상의 증권 거래소로부터 마켓 데이터를 주기적으로 (예를 들어, 0.1초마다) 수신할 수 있다. 고빈도 증권 거래에서는 빠른 속도로 데이터를 처리하는 것이 중요하 기 때문에 일 실시예에서 마켓 데이터는 데이터 전송 속도가 빠른 사용자 데이터그램 프로토콜(User Datagram Protocol; UDP)을 통해 수신될 수 있다. 다만, 일부 실시예에서, 필요에 따라(예를 들어, 데이터의 신뢰도를 확보하기 위해) 마켓 데이터 수신에 다른 통신 프로토콜(예를 들어, TCP/IP)이 사용될 수 있다. 입력 핸들러는 수신되는 마켓 데이터를 파싱(parsing)하고/하거나 디코딩(decoding)할 수 있다. 일 실시 예에 따르면, 마켓 데이터는 복수의 데이터 패킷으로 수신될 수 있으며, 복수의 라인을 통해 수신될 수 있다. 마켓 데이터가 복수의 라인을 통해 수신되는 경우, 각 입력 핸들러는 복수의 라인을 통해 수신된 마켓 데 이터의 데이터 형식이나 규격에 따라 다른 방식으로 파싱하고/하거나 디코딩할 수 있다. 입력 핸들러를 거쳐 파싱/디코딩된 마켓 데이터는 기계학습 모델의 입력 데이터를 생성하기 위해 입력 생성부로 제공될 수 있다. 입력 생성부는 마켓 데이터의 적어도 일부를 기초로 입력 데이터를 생성할 수 있다. 일 실시예에 따르면, 입력 생성부는 마켓 데이터 중 하나 이상의 종목에 대한 하나 이상의 입력 특징을 선별하여 입력 데이터를 구성할 수 있다. 예를 들어, 입력 생성부는 입력 데이터에 포함되는 입력 특징을 추출하거나 선별하기 위 한 특징 추출부를 포함할 수 있다. 일 실시예에서, 입력 데이터에 포함되는 하나 이상의 종목은 타겟 종목의 시장 상황 변동의 선행 지표가 될 수 있는 종목을 포함할 수 있다. 예를 들어, 주문의 대상이 되는 타겟 종목이 A사 주식(현물) 종목인 경우, A사 주식과 관련된 선물 종목, A사 주식과 관련된 옵션 종목, 다른 거래소에 포함된 A사 관련 종목, A사와 연관된 상품(예: 원유 등)에 대한 선물 종목 등에 대한 데이터가 입력 데이터에 포함될 수 있다. 또한, 일 실시예에서, 입력 데이터에 포함되는 하나 이상의 입력 특징은 타겟 종목의 시장 상황 예측에 의미 있는 정보를 포함할 수 있다. 예를 들어, 입력 특징은 시장 가격(거래 가격), 매수 측 오더북 상단의 가격, 수량, 매도 측 오더북 상단의 가격, 수량, 매수 희망자 수, 매도 희망자 수, 오더북 상단 다음 단계의 매수 호가, 오더북 상단 다음 단계의 매도 호가, 오더북에 포함된 호가의 분산 등 하나 이상의 종목의 오더북으로부터 추출할 수 있는 여러 정보, 이를 가공한 정보 및/또는 정보의 신뢰도 등을 포함할 수 있다. 입력 데이터의 구성은 도 8을 참조 하여 보다 상세히 후술된다. 입력 생성부에 의해 생성된 입력 데이터는 기계학습 모델을 위한 전용 가속기로 전달되어, 기계학습 모델(예를 들어, DNN)에 입력될 수 있다. 일 실시예에 따르면, 전용 가속기는 기계학습 모델의 연산 처리 에 특화된 뉴럴 처리 유닛(NPU)일 수 있으며, 기계학습 모델의 구동을 위해 특화된 주문형 반도체(ASIC)로서 구 현될 수 있다. 전용 가속기는 기계학습 모델을 이용하여, 입력 데이터를 기초로 타겟 종목에 대한 주문과 연관된 출력 데이터를 도출할 수 있다. 예를 들어, 전용 가속기는 기계학습 모델에 입력 데이터를 입력하 여, 미래 특정 시점의 타겟 종목의 가격(예를 들어, 시장 가격 또는 중간 가격)을 예측한 출력 데이터를 도출할 수 있다. 일 실시예에 따르면, 상기 미래 특정 시점은 현재 시점에 제2 증권 거래소로의 증권 주문에 걸리는 지연 시간(latency)을 더한 시점일 수 있다. 즉, 지연 시간을 고려하여, 제2 증권 거래소로 증권 주문이 도달 할 것으로 예상되는 시점 근방에서의 타겟 종목의 가격을 예측할 수 있다. 타겟 종목에 대한 주문과 연관된 출 력 데이터를 도출하는 기계학습 모델과 관련하여서는, 도 7 및 도 11을 참조하여 상세히 후술된다. 일 실시예에 따르면, 입력 생성부에 의해 생성된 입력 데이터를 곧바로 기계학습 모델을 위한 전용 가속기 로 제공하는 대신, 프로세서(예를 들어, 전/후 처리를 위한 적어도 하나의 프로세서)는 기계학습 모델을 이용할 지 여부를 결정한 뒤, 기계학습 모델을 이용하기로 결정한 경우에만 입력 데이터를 기계학습 모델을 위 한 전용 가속기로 전달할 수 있다. 예를 들어, 프로세서는 입력 생성부에 의해 생성된 입력 데이터를 기초로 예측 복잡도를 결정하고, 결정된 예측 복잡도에 따라 기계학습 모델을 이용하여 주문 데이터(또는 주 문 데이터와 연관된 출력 데이터)를 생성할 지, 미리 결정된 규칙을 이용하여 주문 데이터를 생성할 지 여부를 판정할 수 있다. 여기서 예측 복잡도는 복잡도에 따른 2개 이상의 복잡도 클래스(예를 들어, low, moderate, high 등)를 포함할 수 있다. 복잡도 판정부가 포함된 프로세서의 내부 구성 및 복잡도 판정부가 예측 복잡도를 결정하고, 이에 따라 입력 데이터를 처리하는 과정은 도 4 및 도 5를 참조하여 상세히 후술된다. 주문 생성부는 기계학습 모델로부터 출력된 데이터를 제공받을 수 있으며, 출력 데이터를 기초로 제2 증권 거래소에서의 주문 데이터를 생성할 수 있다. 예를 들어, 주문 생성부는 기계학습 모델로부터 추론된 미 래 시점에서의 타겟 종목의 예측 가격을 기초로, 미리 결정된 규칙에 따라 타겟 종목에 대한 주문 데이터를 생 성할 수 있다. 구체적 예로, 타겟 종목의 가격이 상승할 것으로 예측된 경우, 주문 생성부는 즉시 새로운 매수 요청 주문을 생성하거나, 기존의 매도 요청 주문의 호가를 정정할 수 있다. 일 실시예에 따르면, 주문 데 이터는 타겟 종목에 대한 주문 종류(신규 주문, 주문 취소, 주문 정정), 매수 또는 매도 여부, 가격(호가), 수 량 등에 대한 정보를 포함할 수 있다. 추가적으로, 주문 생성부에 의해 생성된 주문 데이터는 출력 핸들러로 전달될 수 있다. 일 실시예에 따르면, 출력 핸들러는 생성된 주문 데이터를 기초로 리스크를 체크하거나, 마켓 메이킹에 대한 규제를 만 족하는 지 여부를 판단할 수 있다. 추가적으로 또는 대안적으로 출력 핸들러는 제2 증권 거래소에서 요구 하는 주문 데이터 형식, 규격, 프로토콜에 따라 기 생성된 주문 데이터에 적절한 처리를 수행할 수 있다. 주문 생성부에 의해 생성된(또는 출력 핸들러에 의해 후처리된) 주문 데이터는 제2 증권 거래소로 전 송될 수 있다. 일 실시예에 따르면, 프로세서(예를 들어, 전/후 처리를 위한 적어도 하나의 프로세서)는 전송 된 주문 데이터에 대한 제2 증권 거래소의 응답을 수신할 수 있다. 이 경우, 프로세서는 수신된 응답을 기초로, 제2 증권 거래소 주문 내역을 갱신할 수 있으며, 제2 증권 거래소 주문 내역은 다음 주문을 생성하는데 마켓 데이터로서 이용되거나, 주문 생성부가 주문을 생성하기 위한 기초 데이터로 이용될 수 있다. 도 4는 본 개시의 일 실시예에 따라 예측 복잡도를 결정하는 복잡도 판정부가 포함된 프로세서의 내부 구 성을 나타내는 도면이다. 프로세서는 도 3에서 상술된 구성 이외에 복잡도 판정부, 트레이딩 엔진을 구동하기 위한 호스트 장치를 더 포함할 수 있다. 도 4에서는 도 3에서 상술한 프로세서의 내부 구성에서 새롭게 추가된 구성을 위주로 설명한다. 일 실시예에 따르면, 입력 생성부에 의해 생성된 입력 데이터를 곧바로 기계학습 모델을 위한 전용 가속기 로 제공하는 대신, 프로세서(예를 들어, FPGA로 구현된 적어도 하나의 프로세서)는 기계학습 모델을 이용할 지 여부를 결정한 뒤, 기계학습 모델을 이용하기로 결정한 경우에만 입력 데이터를 기계학습 모델을 위 한 전용 가속기로 제공할 수 있다. 예를 들어, 프로세서에 포함된 복잡도 판정부는 입력 데이터를 기초로 예측 복잡도를 결정하고, 결정된 예측 복잡도에 따라, 트레이딩 로직을 이용하여 주문 데이터(또는 주문 데이터와 연관된 출력 데이터)를 생성할 지, 기계학습 모델을 이용하여 주문 데이터(또는 주문 데이터와 연관된 출력 데이터)를 생성할 지, 호스트 장치에 포함된 트레이딩 엔진을 이용하여 주문 데이터(또 는 주문 데이터와 연관된 출력 데이터)를 생성할 지 여부를 판정할 수 있다. 예를 들어, 복잡도 판정부는 입력 데이터에 포함된 하나 이상의 종목의 현재 시장 가격, 주문 가격 별 주문 수량, 하나 이상의 종목의 거래 상대방의 수 등을 기초로 예측 복잡도를 결정할 수 있다. 다른 예로, 복잡도 판정부는 입력 데이터에 포 함된 하나 이상의 입력 특징의 데이터 패턴을 결정하고, 데이터 패턴이 미리 결정된 조건을 만족하는지 여부를 판정한 후, 판정 결과에 따라 예측 복잡도를 결정할 수 있다. 일 실시예에서, 복잡도 판정부가 트레이딩 로직을 이용하여 주문 데이터(또는 주문 데이터와 연관된 출력 데이터)를 생성하도록 판정한 경우, 주문 생성부는 트레이딩 로직(예를 들어, 미리 지정된 규칙)에 따라 주문 데이터를 생성할 수 있다. 다른 실시예에서, 복잡도 판정부가 기계학습 모델을 주문 데이터와 연관된 출력 데이터를 생성하도록 판정 한 경우, 입력 데이터는 기계학습을 위한 전용 가속기로 제공될 수 있으며, 전용 가속기는 기계학습 모델의 적어도 일부의 연산을 처리함으로써, 입력 데이터로부터 주문 데이터와 연관된 출력 데이터를 생성할 수 있다. 이렇게 생성된 출력 데이터는 프로세서의 주문 생성부로 제공되어, 출력 데이터를 기초로 주문 데 이터가 생성될 수 있다. 또 다른 실시예에서, 복잡도 판정부가 호스트 장치에 포함된 트레이딩 엔진을 이용하여 주문 데 이터(또는 주문 데이터와 연관된 출력 데이터)를 생성도록 판정한 경우, 입력 데이터는 호스트 장치로 제공될 수 있으며, 호스트 장치에 포함된 트레이딩 엔진은 미리 지정된 규칙을 기반으로 한 로직을 이용하여 주문 데이터를 생성하거나, 비교적 가벼운 기계학습 모델을 이용하여 입력 데이터를 기초로 주문 데이터와 연관 된 출력 데이터를 도출할 수 있다. 트레이딩 엔진에 의해 도출된 출력 데이터(주문 데이터와 연관된 출력 데이터)는 프로세서의 주문 생성부로 제공될 수 있다. 일 실시예에서, 트레이딩 엔진이 미리 지정된 규칙을 기반으로 한 로직을 이용하여 주문 데이터를 생성한 경우, 해당 주문 데이터는 프로세서의 주문 생성부 를 거치지 않고 곧바로 프로세서의 출력 핸들러에 제공될 수 있다. 입력 데이터를 기초로 예측 복잡도를 결정하고, 이에 따라 입력 데이터를 처리하는 방식은 도 5를 참조하여 보 다 상세히 후술된다. 도 5는 본 개시의 일 실시예에 따라, 예측 복잡도를 결정하고 결정된 예측 복잡도에 따라 기계학습 모델 을 이용할 지 여부를 판정하는 방법의 예시를 나타내는 도면이다. 고빈도 증권 거래 장치 또는 고빈도 증 권 주문 데이터 생성 장치의 적어도 하나의 프로세서(예를 들어, FPGA로 구현된 적어도 하나의 프로세서)는 마 켓 데이터를 기초로 입력 데이터(예를 들어, 입력 특징 맵)을 생성할 수 있고, 입력 데이터를 기초로 예측 복잡도를 결정할 수 있다. 일 실시예에 따르면, 예측 복잡도는 입력 데이터의 복잡도 또는 입력 데 이터를 기초로 주문과 연관된 데이터를 추론하기 위한 연산 복잡도 중 적어도 하나를 반영할 수 있다. 또한, 일 실시예에서, 예측 복잡도는 2개 이상의 복잡도 클래스로 분류될 수 있다. 예를 들어, 예측 복잡도는 도시된 바와 같이, low, moderate, high의 3개의 복잡도 클래스로 분류될 수 있다. 일 실시예에 따르면, 프로세서는 입력 데이터에 포함된 하나 이상의 종목의 현재 시장 가격, 주문 가격 별 주문 수량, 하나 이상의 종목의 거래 상대방의 수 등을 기초로 예측 복잡도를 결정할 수 있다. 다른 실시 예에 따르면, 프로세서는 입력 데이터에 포함된 하나 이상의 입력 특징의 데이터 패턴을 결정하고, 데이터 패턴이 미리 결정된 조건을 만족하는지 여부를 판정한 후, 판정 결과에 따라 예측 복잡도를 결정할 수 있 다. 예를 들어, 타겟 종목과 통계적으로 상관성이 매우 큰 입력 종목에 대해, 중간 가격(예를 들어, 매수 측 ToB 가 격, 매도 측 ToB 가격의 가중 평균)의 이동 평균의 변화량이 제1 미리 결정된 임계치 이상이거나 제2 미리 결정 된 임계치 이하인 경우, 프로세서는 예측 복잡도를 low 클래스로 분류할 수 있다. 구체적으로, 구간에서의 입력 종목의 중간 가격 이동 평균과 구간에 서의 입력 종목의 중간 가격 이동 평균을 비교하여, 전자가 후자에 비해 (>1)배 이상인 경우, 높은 확률로 타 겟 종목의 가격이 오를 것이라고 예측된다고 판단하여, 예측 복잡도를 low 클래스로 결정할 수 있다. 또는, 전 자가 후자에 비해 (<1)배 이하인 경우, 높은 확률로 타겟 종목의 가격이 내릴 것이라고 예측된다고 판단하여, 예측 복잡도를 low 클래스로 결정할 수 있다. 전자가 후자에 비해 (>1)배 이상 크거나 또는 비해 (<1)배 이하 작지 않을 경우, 예측 복잡도를 moderate 클래스 또는 high 클래스로 결정할 수 있다. 다른 예로, 입력 데이터에 포함된 모든 종목에 대해, 특정 시간 구간 동안의 중간 가격의 분산이 제3 미리 지정된 임계치 이하인 경우, 가격 변동의 가능성이 낮아, 스프레드에 따른 수익을 추구할 수 있다고 판단하여, 예측 복잡도를 low 클래스로 결정할 수 있다. 일 실시예에 따르면, 프로세서는 입력 데이터를 기초로, 예측 복잡도를 결정한 다음, 결정된 예측 복 잡도에 따라 기계학습 모델을 이용하여 주문 데이터(또는 주문과 연관된 출력 데이터)를 생성할지 여부를 판정 할 수 있다. 일 실시예에서, 예측 복잡도가 low 클래스로 결정된 경우, 프로세서(예를 들어, FPGA로 구현된 프 로세서)는 규칙 기반 로직에 따라 입력 데이터를 기초로 주문 데이터를 생성할 수 있다. 예를 들어, 타겟 종목과 통계적으로 상관성이 매우 큰 입력 종목에 대해, 중간 가격의 이동 평균의 변화량이 제1 미리 결정 된 임계치 이상인 경우, 타겟 종목의 가격이 오를 것이라고 판단하여, 타겟 종목에 대한 매수 주문을 생성할 수 있고, 중간 가격의 이동 평균의 변화량이 제2 미리 결정된 임계치 이하인 경우, 타겟 종목의 가격이 내릴 것이 라고 판단하여, 타겟 종목에 대한 매도 주문을 생성할 수 있다. 프로세서가 규칙 기반 로직에 따라 주문 데이터를 생성하는 다른 예로, 입력 데이터에 포함된 모든 종목에 대해 특정 시간 구간 동안의 중간 가격의 분산이 제3 미리 지정된 임계치 이하인 경우, 양측 ToB에 매수 주문 및 매도 주문을 생성하여 스프레드 에 따른 수익을 추구할 수 있다. 이 경우, 시간의 흐름에 따라, 상기 기준을 벗어나는 경우(분산이 커지는 경 우), 가격 변동에 따른 리스크를 최소화하기 위해 기존 주문을 취소하는 주문을 생성할 수 있다.다른 실시예에서, 예측 복잡도가 high 클래스로 결정된 경우, 프로세서는 기계학습 모델을 위한 전용 가속기(예를 들어, ASIC으로 구현된 전용 가속기)로 입력 데이터를 제공할 수 있으며, 전용 가속기 는 기계학습 모델(예를 들어, DNN)을 이용하여 입력 데이터를 기초로 타겟 종목에 대한 주문과 연관된 출력 데이터를 생성할 수 있다. 예를 들어, 전용 가속기는 기계학습 모델의 적어도 일부 연 산을 처리함으로써, 입력 데이터를 기초로 미래 특정 시점에서의 타겟 종목의 가격(시장 가격 또는 중간 가격)을 예측한 출력 데이터를 생성할 수 있다. 또 다른 실시예에서, 예측 복잡도가 moderate 클래스로 결정된 경우, 프로세서는 호스트 엔진으로 입 력 데이터를 제공할 수 있으며, 호스트 엔진은 규칙 기반 로직 또는 가벼운 기계학습 모델을 이 용하여, 주문 데이터 또는 주문과 연관된 출력 데이터를 생성할 수 있다. 상술한 바와 같이, 입력 데이터를 기초로 예측 복잡도를 결정하고, 예측 복잡도가 높은 경우 기계학습 모델을 이용하여 주문 관련 데이터를 생성함으로써 고전적인 알고리즘이 찾아내지 못하는 특징을 찾아내고 미래 시점의 시장 상황을 예측할 수 있으며, 예측 복잡도가 낮은 경우 비교적 간단한 트레이딩 로직을 이용하여 곧바로 주문 데이터를 생성함으로써 빠르게 주문을 전송하여 거래에서 우위를 선점할 수 있다. 도 6은 본 개시의 일 실시예에 따른 고빈도 증권 주문 데이터를 생성하는 방법의 예시를 나타내는 도면이다. 일 실시예에 따르면, 프로세서(예를 들어, 고빈도 증권 주문 데이터 생성을 위한 장치에 포함된 적어도 하나의 프로세서)는 마켓 데이터를 기초로 입력 데이터를 생성할 수 있으며, 기계학습 모델(예를 들어, DNN)을 이용하여, 입력 데이터를 기초로 주문과 연관된 출력 데이터를 생성할 수 있다. 이렇게 생성된 출 력 데이터는 주문 생성부로 제공될 수 있으며, 주문 생성부는 타겟 증권 거래소로의 타겟 종목에 대 한 주문 데이터를 생성할 수 있다. 일 실시예에 따르면, 주문 생성부가 생성하는 주문 데이터는 주문 종류(예를 들어, 신규 주문, 취소 주문, 정정 주문 등), 매수 또는 매도 여부, 가격, 주문 수량 등에 대한 정보를 포함할 수 있다. 여기서, 주문 데이 터는 하나 이상의 주문을 포함할 수 있다. 예를 들어, 주문 생성부는 도시된 바와 같이, 기계학습 모델 의 출력 데이터를 기초로 3개의 주문 '신규 / 매도 / $102.0 / 20 qty', '취소 / 매도 / $100.5 / 10 qty', '취소 / 매수 / $98.0 / 30 qty'(순서대로, 주문 종류 / 매수 또는 매도 여부 / 주문 가격 / 주문 수량 을 의미)을 포함하는 주문 데이터를 생성할 수 있다. 생성된 주문 데이터는 타겟 증권 거래소로 전송될 수 있으며, 프로세서는 전송된 주문에 대한 타겟 증권 거래소의 응답을 수신할 수 있다. 이러한 응답에 따라, 프로세서는 타겟 종목에 대한 주문 내역을 갱신할 수 있다. 여기서, 주문 내역이란, 고빈도 증권 주문 데이터 생성을 위한 장치가 전송한 주문 중 현재 유효한 주문 (취소 또는 체결되지 않은 주문)의 목록을 지칭할 수 있다. 예를 들어, 도 6에 도시된 주문 데이터가 타 겟 증권 거래소로 전송된 후, 타겟 증권 거래소로부터 주문 데이터에 포함된 3개의 주문이 모두 정상적으 로 접수되었다는 응답을 수신한 경우, 주문 데이터를 반영하여 타겟 종목에 대한 주문 내역을 갱신할 수 있다. 구체적으로, 주문 데이터를 전송하기 전 주문 내역이 '매도 / $ 101.0 / 10 qty', '매도 / $ 100.5 / 10 qty', '매수 / $ 99.5 / 20 qty', '매수 / $ 98.0 / 30 qty'였던 경우, 갱신된 주문 내역은 '매도 / $ 102.0 / 20 qty', '매도 / $ 101.0 / 10 qty', '매수 / $ 99.5 / 20 qty'로 변경될 수 있다. 갱신 된 주문 내역은 이후, 고빈도 증권 주문 데이터를 생성하기 위한 장치가 주문 데이터를 생성하는 데 기초 가 되는 데이터(예를 들어, 마켓 데이터 또는 주문 생성부에서 고려되는 데이터 등)에 포함될 수 있다. 주문 내 역은 오픈 오더(open order), 오더맵(order map)으로 지칭될 수도 있다. 도 7은 본 개시의 일 실시예에 따른 기계학습 모델이 입력 데이터를 기초로 출력 데이터를 출력 하는 예시를 나타내는 도면이다. 일 실시예에 따르면, 기계학습 모델은 입력 데이터를 기초로, 타겟 종목의 주문과 연관된 출력 데이터를 출력할 수 있다. 예를 들어, 기계학습 모델은 입력 데이터를 기초로 미래 특정 시점에서의 타겟 종목의 예측 가격(예를 들어, 시장 가격 또는 중간 가격 등)을 출력할 수 있 다. 일 실시예에 따르면, 기계학습 모델에 입력되는 입력 데이터는 하나 이상의 시점에서의 하나 이 상의 종목에 대한 하나 이상의 입력 특징을 포함하는 입력 특징 맵(input feature map)을 포함할 수 있다. 기 계학습 모델의 입력 데이터에 관하여는 도 8을 참조하여 상세히 후술된다. 일 실시예에 따르면, 기계학습 모델은 하나 이상의 증권 거래소의 참조 마켓 데이터를 기초로 생성된 참조 입력 데이터를 이용하여 타겟 증권 거래소에서의 증권 주문과 연관된 참조 출력 데이터를 추론하도록 학습될 수 있다. 예를 들어, 기계학습 모델은 제1 증권 거래소의 제1 참조 마켓 데이터 및 제2 증권 거래소의 제2 참조 마켓 데이터를 기초로 생성된 시점 t부터 시점 t+M-1까지의 참조 입력 데이터, 시점 t+1에서의 타겟 종목의 중간 가격 데이터를 이용하여, 총 M개의 연속된 시점을 포함하는 시간 구간에서의 입력 데이터를 기초로 다 음 시점에서의 타겟 종목의 중간 가격을 추론하도록 지도 학습될 수 있다. 기계학습 모델에 의해 출력된 출력 데이터는 타겟 증권 거래소에서의 증권 주문과 연관된 정보를 포 함할 수 있으며, 프로세서(예를 들어, 고빈도 증권 거래 장치 또는 고빈도 증권 주문 데이터 생성을 위한 장치 의 적어도 하나의 프로세서)는 출력 데이터를 기초로 미리 지정된 규칙에 기반하여, 타겟 종목에 대한 주 문 데이터를 생성할 수 있다. 일 실시예에 따르면, 본 개시의 기계학습 모델은 인공신경망 모델(예를 들어, DNN)일 수 있다. 인공신경 망 모델에 관하여는, 도 11을 참조하여 상세히 후술된다. 도 8은 본 개시의 일 실시예에 따른 기계학습 모델의 입력 데이터의 구성의 예시를 나타내는 도면이다. 고빈도 증권 거래 장치(예를 들어, 고빈도 증권 거래 장치에 포함된 적어도 하나의 프로세서)는 하나 이상의 거 래소로부터 수신된 마켓 데이터를 기초로, 입력 데이터를 생성할 수 있다. 일 실시예에 따르면, 입력 데 이터는 하나 이상의 시점에서의 하나 이상의 종목에 대한 하나 이상의 입력 특징을 포함하는 입력 특징 맵 (input feature map)을 포함할 수 있다. 예를 들어, 입력 특징 맵은, 도 8에 도시된 바와 같이 M개의 시점에서의 K개의 종목에 대한 N개의 입력 특징을 포함할 수 있다. 도시된 예에서, 입력 데이터에 포함된 입력 특징 맵 중 특정 시점(도 8에서, 시점 m)에서의 데이터는, 특정 시점에서의 하나 이상의 종목(도 8에서, 제1 종목, 제2 종목, 제3 종목)에 대한 하나 이상 의 입력 특징(도 8에서, 매수 측 오더북 상단의 가격, 수량, 매도 측 오더북 상단의 가격, 수량)을 포함할 수 있다. 또한, 입력 데이터에 포함된 입력 특징 맵 중 특정 입력 특징(도 8에서, n번째 입력 특징)에 대한 데이터 는 하나 이상의 시점(도 8에서, 시점 t-M+1부터 시점 t까지)에서의 하나 이상의 종목에 대한 특정 입력 특 징을 포함할 수 있다. 일 실시예에서, 입력 특징 맵은 서로 다른 종목에 대한 하나 이상의 입력 특징이 서로 교차되도록 생성될 수 있다. 일 실시예에 따르면, 입력 데이터에 포함되는 하나 이상의 종목은 주문 대상이 되는 타겟 종목의 시장 상 황의 선행 지표가 되는 종목일 수 있다. 예를 들어, 주문의 대상이 되는 타겟 종목이 A사 주식(현물) 종목인 경우, A사 주식과 관련된 선물 종목, A사 주식과 관련된 옵션 종목, 다른 거래소에 포함된 A사 관련 종목, A사 관련 상품에 대한 선물 종목 등이 상기 하나 이상의 종목에 포함될 수 있다. 일 실시예에서, 상기 하나 이상의 종목은 타겟 종목을 포함할 수 있다. 즉, 고빈도 증권 거래 장치는 타겟 종목에 대한 데이터를 포함한 입력 데 이터를 기반으로, 타겟 종목의 미래 시장 상황을 예측할 수 있다. 또한, 일 실시예에서, 각 입력 종목에 대한 정보는 각 입력 종목과 연관된 코드(symbol)로서 포함될 수 있다. 일 실시예에 따르면, 입력 데이터에 포함되는 하나 이상의 입력 특징은 타겟 종목의 시장 상황 예측에 의 미 있는 정보를 포함할 수 있다. 예를 들어, 입력 특징은 시장 가격(거래 가격), 매수 측 오더북 상단의 가격, 수량, 매도 측 오더북 상단의 가격, 수량, 매수 희망자 수, 매도 희망자 수, 오더북 상단 다음 단계의 매수 호 가, 오더북 상단 다음 단계의 매도 호가, 오더북에 포함된 호가의 분산 등 하나 이상의 종목의 오더북으로부터 추출할 수 있는 여러 정보, 이를 가공한 정보 및/또는 정보의 신뢰도 등을 포함할 수 있다. 일 실시예에서, 이 러한 하나 이상의 입력 특징은 상기 하나 이상의 종목 각각으로부터 추출될 수 있다. 상술한 바와 같이 구성된 입력 데이터는 프로세서(예를 들어, 고빈도 증권 거래 장치의 적어도 하나의 프 로세서)에 의해 기계학습 모델을 위한 전용 가속기로 전달되어, 기계학습 모델에 입력될 수 있다. 추가적으로 또는 대안적으로 프로세서는 입력 데이터를 기초로 예측 복잡도를 판정하여, 기계학습 모델을 이용할지, 호스트 엔진을 이용할지, 해당 프로세서 내에서 규칙 기반으로 주문 데이터를 생성할지 여부를 결정할 수 있다. 이러한 결정에 따라, 입력 데이터는 기계학습 모델을 위한 전용 가속기 또는 호스트 엔진으로 전달되거나, 해당 프로세서 내에서 규칙 기반으로 타겟 종목에 대한 주문과 연관된 출력 데이터를 도출하는데 사용될 수 있 다. 도 9는 본 개시의 일 실시예에 따른 FPGA 및 NPU를 포함하는 고빈도 증권 거래 장치를 동작하는 방법의 예 시를 나타내는 흐름도이다. 일 실시예에 따르면, 방법은 FPGA가 제1 증권 거래소의 제1 마켓 데이터 및 제2 증권 거래소(예를 들어, 타겟 증권 거래소)의 제2 마켓 데이터를 수신함으로써 개시될 수 있다(S910). 각 마켓 데이터는 각 증권 거래소에서 거래되는 종목들에 대한 거래 정보 등을 포함할 수 있다. 예를 들어, 제1 마켓 데이터는 제1 증권 거래소에서 거래되는 종목의 오더북에 대한 정보를 포함할 수 있으며, 제2 마켓 데이터 는 제2 증권 거래소의 응답 데이터 및 하나 이상의 종목의 오더북에 대한 정보 중 적어도 일부(예를 들어, 타겟종목의 ToB에 대한 정보)를 포함할 수 있다. 일 실시예에 따르면, 제1 증권 거래소는 복수의 증권 거래소를 포 함할 수 있다. 즉, 프로세서는 복수의 증권 거래소의 마켓 데이터를 수신하고, 이 중 적어도 일부를 주문 데이 터를 생성하는데 이용할 수 있다. 그런 다음, FPGA는 제1 마켓 데이터 또는 제2 마켓 데이터 중 적어도 하나를 기초로 기계학습 모델의 입력 데이 터를 생성할 수 있다(S920). 일 실시예에 따르면 입력 데이터는, 하나 이상의 시점에서의 하나 이상의 종목에 대한 하나 이상의 입력 특징을 포함할 수 있으며, 여기서 하나 이상의 종목에 대한 정보는 각 종목에 대한 코드 (symbol)로서 포함될 수 있다. 또한, 입력 데이터에 포함되는 하나 이상의 종목은 타겟 종목의 시장 상황 변동 의 선행 지표를 나타내는 종목 및 제2 증권 거래소에서의 증권 주문 대상이 되는 타겟 종목을 포함할 수 있다. 일 실시예에 따르면, 마켓 데이터로부터 입력 데이터를 생성하기 전에, 파싱 및 디코딩 과정이 수행될 수 있다. 예를 들어, FPGA는 제1 마켓 데이터 또는 제2 마켓 데이터 중 적어도 하나를 파싱 및 디코딩한 후, 이를 기초로 기계학습 모델의 입력 데이터를 생성할 수 있다. 그 후, NPU는 기계학습 모델을 위한 적어도 일부 연산을 처리할 수 있다(S930). 예를 들어, NPU는 FPGA로부터 생성된 입력 데이터를 제공받고, 입력 데이터를 기계학습 모델에 입력하여, 입력 데이터에 대해 일련의 연산을 수행하여 출력 데이터를 도출할 수 있다. 일 실시예에 따르면, 기계학습 모델은 하나 이상의 증권 거래소의 참 조 마켓 데이터를 기초로 생성된 참조 입력 데이터를 이용하여 타겟 증권 거래소에서의 증권 주문과 연관된 참 조 출력 데이터를 추론하도록 구성된 임의의 모델일 수 있다. 일 실시예에 따르면, FPGA는 생성된 입력 데이터를 곧바로 NPU로 제공하는 대신, 입력 데이터를 기초로 예측 복 잡도를 결정하고, 결정된 예측 복잡도에 기초하여, 미리 결정된 규칙을 기반으로 주문 데이터를 생성할 지 또는 기계학습 모델을 사용할 지 여부를 판정할 수 있다. 일 실시예에서, 미리 결정된 규칙으로 주문 데이터를 생성 하도록 판정된 경우, FPGA는 입력 데이터를 기초로 미리 결정된 규칙에 따라 주문 데이터를 생성할 수 있다. 다른 실시예에서, 기계학습 모델을 이용하여 주문 데이터를 생성하도록 판정된 경우, NPU는 기계학습 모델을 위 한 적어도 일부 연산을 처리하고, 기계학습 모델로부터 출력된 데이터를 FPGA에 제공할 수 있다. 추가적으로, 고빈도 증권 거래 장치는 트레이딩 엔진을 구동하도록 구성된 호스트 장치를 더 포함할 수 있으며, 예측 복잡도는 복잡도에 따른 3개의 복잡도 클래스를 포함할 수 있다. 예를 들어, 예측 복잡도는 복잡도에 따 라 high, moderate, low의 세가지 복잡도 클래스를 포함할 수 있다. 이 경우, 제2 증권 거래소에서의 주문 데 이터를 생성하기 위하여, 입력 데이터는 3개의 복잡도 클래스에 따라 FPGA, 호스트 장치, NPU 중 적어도 하나에 제공될 수 있다. 그런 다음, NPU는 기계학습 모델로부터 출력된 데이터를 FPGA로 제공할 수 있고(S940), FPGA는 기계학습 모델로 부터 출력된 데이터를 기초로 제2 증권 거래소에서의 주문 데이터를 생성할 수 있다(S950). 추가적으로, FPGA 는 생성된 주문 데이터를 제2 증권 거래소에서 요구하는 프로토콜에 따라 처리할 수 있다. 이렇게 생성된(제2 증권 거래소에서 요구하는 프로토콜에 따라 처리된) 주문 데이터는 제2 증권 거래소로 전송될 수 있다. 도 10은 본 개시의 일 실시예에 따른 고빈도 증권 주문 데이터를 생성하는 방법의 예시를 나타내는 흐름 도이다. 일 실시예에 따르면, 방법은 프로세서(예를 들어, 고빈도 증권 주문 데이터 생성을 위한 장치의 적어도 하나의 프로세서)가 하나 이상의 증권 거래소로부터 수집된 마켓 데이터에 기초하여 입력 데이터를 생성 함으로써 개시될 수 있다(S1010). 일 실시예에서, 입력 데이터는 하나 이상의 시점에서의 하나 이상의 종목에 대한 하나 이상의 입력 특징을 포함하는 입력 특징 맵을 포함할 수 있으며, 하나 이상의 입력 특징은 하나 이상 의 종목 각각으로부터 추출될 수 있다. 일 실시예에 따르면 입력 데이터에 포함되는 하나 이상의 종목은 타겟 종목을 포함할 수 있다. 그런 다음, 프로세서는 상기 생성된 입력 데이터를 기초로 기계학습 모델로부터 타겟 증권 거래소의 증권 주문 과 연관된 출력 데이터를 생성할 수 있다(S1020). 여기서, 기계학습 모델은 하나 이상의 증권 거래소의 참조 마켓 데이터를 기초로 생성된 참조 입력 데이터를 이용하여 타겟 증권 거래소에서의 증권 주문과 연관된 참조 출력 데이터를 추론하도록 구성된 임의의 기계학습 모델일 수 있다. 일 실시예에 따르면, 기계학습 모델로부 터 출력되는 출력 데이터는 특정 시점에서의 타겟 종목의 가격 예측과 연관된 데이터를 포함할 수 있으며, 여기 서 특정 시점은, 현재 시점에 타겟 증권 거래소로의 증권 주문에 걸리는 지연 시간(latency)을 더한 시점일 수 있다. 대안적으로, 프로세서는 입력 특징 맵을 기초로 예측 복잡도를 결정하고, 이에 기초하여 입력 데이터를 기계학 습 모델에 적용할지 여부를 결정한 뒤, 입력 데이터를 기계학습 모델에 적용하는 것으로 판정된 경우에만, 입력데이터를 기계학습 모델에 제공할 수 있다. 여기서, 예측 복잡도는 다양한 방식으로 결정될 수 있다. 예를 들 어, 프로세서는 입력 특징 맵에 포함된 정보 중 하나 이상의 종목의 현재 가격, 주문 가격 별 증권의 수 및 하 나 이상의 종목의 거래 상대방의 수를 기초로 예측 복잡도를 결정할 수 있다. 다른 예로, 프로세서는 입력 특 징 맵에 포함된 정보 중 하나 이상의 입력 특징의 데이터 패턴을 결정하고, 결정된 데이터 패턴이 미리 결정된 조건을 만족하는지 여부를 판정한 뒤, 판정 결과에 따라 예측 복잡도를 결정할 수 있다. 그 후, 프로세서는 출력 데이터에 기초하여, 타겟 증권 거래소의 타겟 종목에 대한 주문 데이터를 생성할 수 있 다(S1030). 일 실시예에 따르면, 주문 데이터는 타겟 종목에 대한 주문 종류(예를 들어, 신규 주문, 취소 주문, 정정 주문), 매수 또는 매도 여부, 가격, 수량에 대한 정보를 포함할 수 있다. 일 실시예에 따르면, 생성된 주문 데이터를 타겟 증권 거래소로 전송할 수 있으며, 타겟 증권 거래소로부터 주 문 데이터 전송에 따른 응답을 수신할 수 있다. 이 경우, 주문 데이터 전송에 따른 응답을 기초로, 타겟 거래 소 주문 내역을 갱신할 수 있으며, 갱신된 타겟 거래소 주문 내역은 마켓 데이터에 포함되어, 또 다른 주문 데 이터를 생성하는 데 사용될 수 있다. 도 11은 본 개시의 일 실시예에 따른 인공신경망 모델을 나타내는 예시도이다. 인공신경망 모델은, 기계학습 모델의 일 예로서, 기계학습(Machine Learning) 기술과 인지과학에서, 생물학적 신경망 의 구조에 기초하여 구현된 통계학적 학습 알고리즘 또는 그 알고리즘을 실행하는 구조이다. 일 실시예에 따르면, 인공신경망 모델은, 생물학적 신경망에서와 같이 시냅스의 결합으로 네트워크를 형 성한 인공 뉴런인 노드(Node)들이 시냅스의 가중치를 반복적으로 조정하여, 특정 입력에 대응한 올바른 출력과 추론된 출력 사이의 오차가 감소되도록 학습함으로써, 문제 해결 능력을 가지는 기계학습 모델을 나타낼 수 있 다. 예를 들어, 인공신경망 모델은 기계학습, 딥러닝 등의 인공지능 학습법에 사용되는 임의의 확률 모 델, 뉴럴 네트워크 모델 등을 포함할 수 있다. 일 실시예에 따르면, 인공신경망 모델은 하나 이상의 증권 거래소의 마켓 데이터를 기초로 생성된 입력 데이터를 이용하여 타겟 증권 거래소에서의 증권 주문과 연관된 데이터를 추론하도록 구성된 인공신경망 모델을 포함할 수 있다. 인공신경망 모델은 다층의 노드들과 이들 사이의 연결로 구성된 다층 퍼셉트론(MLP: multilayer perceptron)으로 구현된다. 본 실시예에 따른 인공신경망 모델은 MLP를 포함하는 다양한 인공신경망 모 델 구조들 중의 하나를 이용하여 구현될 수 있다. 도 11에 도시된 바와 같이, 인공신경망 모델은, 외부 로부터 입력 신호 또는 데이터를 수신하는 입력층, 입력 데이터에 대응한 출력 신호 또는 데이터 를 출력하는 출력층, 입력층과 출력층 사이에 위치하며 입력층으로부터 신호를 받아 특성을 추출하여 출력층으로 전달하는 n개(여기서, n은 양의 정수)의 은닉층(1130_1 내지 1130_n)으 로 구성된다. 여기서, 출력층은 은닉층(1130_1 내지 1130_n)으로부터 신호를 받아 외부로 출력한다. 인공신경망 모델의 학습 방법에는, 교사 신호(정답)의 입력에 의해서 문제의 해결에 최적화되도록 학습하 는 지도 학습(Supervised Learning) 방법과, 교사 신호를 필요로 하지 않는 비지도 학습(Unsupervised Learning) 방법이 있다. 일 실시예에서, 인공신경망 모델은 타겟 증권 거래소에서의 증권 주문과 연관된 데이터를 추론하도록 지도 학습 및/또는 비지도 학습될 수 있다. 예를 들어, 인공신경망 모델은 참조 입 력 데이터로부터 특정 시점에서의 타겟 종목의 참조 가격을 추론하도록 지도 학습될 수 있다. 이렇게 학습된 인공신경망 모델은 고빈도 증권 거래 장치의 메모리 또는 고빈도 증권 주문 데이터 생성을 위한 장치의 메모리(미도시)에 저장될 수 있으며, 통신 모듈 및/또는 메모리로부터 수신된 데이터의 입력에 응 답하여 타겟 증권 거래소에서의 증권 주문과 연관된 데이터를 추론할 수 있다. 일 실시예에 따르면, 타겟 증권 거래소에서의 증권 주문과 연관된 데이터를 추론하기 위한 인공신경망 모델의 입력 데이터는, 하나 이상의 시점에서의 하나 이상의 종목에 대한 하나 이상의 입력 특징을 포함할 수 있다. 예를 들어, 인공신경망 모델의 입력층에 입력되는 입력 데이터는, 하나 이상의 시점에서의 하나 이 상의 종목에 대한 하나 이상의 입력 특징에 대한 정보를 포함하는 데이터를 하나의 벡터 데이터 요소로 구성한, 벡터가 될 수 있다. 데이터의 입력에 응답하여, 인공신경망 모델의 출력층에서 출력되는 출 력 데이터는 타겟 증권 거래소에서의 증권 주문과 연관된 데이터를 나타내거나 특징화하는 벡터가 될 수 있다. 즉, 인공신경망 모델의 출력층은 타겟 증권 거래소에서의 증권 주문과 연관된 데이터를 나 타내거나 특징화하는 벡터를 출력하도록 구성될 수 있다. 본 개시에 있어서, 인공신경망 모델의 출력 데 이터는, 이상에서 설명된 유형에 한정되지 않으며, 타겟 증권 거래소에서의 증권 주문과 연관된 데이터를 나타내는 임의의 정보/데이터를 포함할 수 있다. 이와 같이, 인공신경망 모델의 입력층과 출력층에 복수의 입력 데이터와 대응되는 복수의 출 력 데이터가 각각 매칭되고, 입력층, 은닉층(1130_1 내지 1130_n) 및 출력층에 포함된 노드들 사이 의 시냅스 값이 조정됨으로써, 특정 입력에 대응한 올바른 출력이 추출될 수 있도록 학습될 수 있다. 이러한 학습 과정을 통해, 인공신경망 모델의 입력 데이터에 숨겨져 있는 특성을 파악할 수 있고, 입력 데이터에 기초하여 계산된 출력 데이터와 목표 출력 간의 오차가 줄어들도록 인공신경망 모델의 노드들 사이의 시 냅스 값(또는 가중치)을 조정할 수 있다. 이렇게 학습된 인공신경망 모델은 입력된 데이터에 응답하여, 타겟 증권 거래소에서의 증권 주문과 연관된 데이터 출력할 수 있다. 도 12는 본 개시의 일 실시예에 따른 고빈도 증권 거래 또는 고빈도 증권 주문 데이터 생성과 연관된 임의의 컴 퓨팅 장치의 구성도이다. 예를 들어, 컴퓨팅 장치는 정보 처리 시스템 및/또는 사용자 단말 을 포함할 수 있다. 도시된 바와 같이, 컴퓨팅 장치는 하나 이상의 프로세서, 버스, 통신 인터페이스, 프로세서에 의해 수행되는 컴퓨터 프로그램을 로드(load)하는 메모리 및 컴퓨터 프로그램을 저장하는 저장 모듈을 포함할 수 있다. 다만, 도 12에는 본 개시의"}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "실시예와 관련 있는 구성요소들만이 도시되어 있다. 따라서, 본 개시가 속한 기술분야의 통상의 기술자라면 도 12에 도시된 구성요소들 외에 다른 범용적인 구성 요소들이 더 포함될 수 있음을 알 수 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit), NPU(Neural Processing Unit) 또는 본 개시의 기술 분야에 잘 알려진 임의의 형태의 프로세서를 포함하여 구성 될 수 있다. 또한, 프로세서는 본 개시의 실시예들에 따른 방법을 실행하기 위한 적어도 하나의 애플리 케이션 또는 프로그램에 대한 연산을 수행할 수 있다. 컴퓨팅 장치는 하나 이상의 프로세서를 구비할 수 있다. 예를 들어, 컴퓨팅 장치는 FPGA로 구현된 프로세서, ASIC으로 구현된 기계학습 모델을 위한 전용 가속기(NPU ASIC)를 포함할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장할 수 있다. 메모리는 본 개시의 다양한 실시예 들에 따른 방법/동작을 실행하기 위하여 저장 모듈로부터 하나 이상의 컴퓨터 프로그램을 로드할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있으나, 본 개시의 기술적 범위는 이에 한정 되지 아니한다. 버스는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공할 수 있다. 버스는 주소 버스 (Address Bus), 데이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 인터넷 통신을 지원할 수 있다. 또한, 통신 인터페이스 는 인터넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본 개 시의 기술 분야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 저장 모듈은 하나 이상의 컴퓨터 프로그램을 비임시적으로 저장할 수 있다. 저장 모듈은 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 개시가 속하는 기술 분 야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 개시의 다양한 실시예들에 따 른 동작/방법을 수행하도록 하는 하나 이상의 인스트럭션들(instructions)을 포함할 수 있다. 즉, 프로세서 는 하나 이상의 인스트럭션들을 실행함으로써, 본 개시의 다양한 실시예들에 따른 동작/방법들을 수행할 수 있다. 예를 들어, 컴퓨터 프로그램은 하나 이상의 증권 거래소로부터 수집된 마켓 데이터에 기초하여 입력 데이 터를 생성하고, 생성된 입력 데이터를 기초로 기계학습 모델로부터 타겟 증권 거래소의 증권 주문과 연관된 출 력 데이터를 생성하고, 출력 데이터에 기초하여 타겟 증권 거래소의 타겟 종목에 대한 주문 데이터를 생성하기 위한 인스트럭션들을 포함할 수 있다. 다른 예로서, 컴퓨터 프로그램은 FPGA에 의해, 제1 증권 거래소의 제1 마켓 데이터 및 제2 증권 거래소의 제2 마켓 데이터를 수신하고, FPGA에 의해, 제1 마켓 데이터 또는 제2 마켓 데이터 중 적어도 하나를 기초로 기계학습 모델의 입력 데이터를 생성하고, NPU에 의해, 기계학습 모델을 위한 적어도 일부 연산을 처리하고, NPU에 의해, 기계학습 모델로부터 출력된 데이터를 FPGA로 제공하고, FPGA 에 의해, 기계학습 모델로부터 출력된 데이터를 기초로 제2 증권 거래소에서의 주문 데이터를 생성하기 위한 인스트럭션들을 포함할 수 있다. 상술한 방법은 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록매체에 저장된 컴퓨터 프로그램으로 제공될 수 있다. 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하 는 것일수도 있다. 또한, 매체는 단일 또는 수개 하드웨어가 결합된 형태의 다양한 기록 수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워크 상에 분산 존재하는 것일 수 도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체 의 예시로, 애플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다. 본 개시의 방법, 동작 또는 기법들은 다양한 수단에 의해 구현될 수도 있다. 예를 들어, 이러한 기법들은 하드 웨어, 펌웨어, 소프트웨어, 또는 이들의 조합으로 구현될 수도 있다. 본원의 개시와 연계하여 설명된 다양한 예시적인 논리적 블록들, 모듈들, 회로들, 및 알고리즘 단계들은 전자 하드웨어, 컴퓨터 소프트웨어, 또는 양자 의 조합들로 구현될 수도 있음을 통상의 기술자들은 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 대 체를 명확하게 설명하기 위해, 다양한 예시적인 구성요소들, 블록들, 모듈들, 회로들, 및 단계들이 그들의 기능 적 관점에서 일반적으로 위에서 설명되었다. 그러한 기능이 하드웨어로서 구현되는지 또는 소프트웨어로서 구 현되는 지의 여부는, 특정 애플리케이션 및 전체 시스템에 부과되는 설계 요구사항들에 따라 달라진다. 통상의 기술자들은 각각의 특정 애플리케이션을 위해 다양한 방식들로 설명된 기능을 구현할 수도 있으나, 그러한 구현 들은 본 개시의 범위로부터 벗어나게 하는 것으로 해석되어서는 안된다. 하드웨어 구현에서, 기법들을 수행하는 데 이용되는 프로세싱 유닛들은, 하나 이상의 ASIC들, DSP들, 디지털 신 호 프로세싱 디바이스들(digital signal processing devices; DSPD들), 프로그램가능 논리 디바이스들 (programmable logic devices; PLD들), 필드 프로그램가능 게이트 어레이들(field programmable gate arrays; FPGA들), 프로세서들, 제어기들, 마이크로제어기들, 마이크로프로세서들, 전자 디바이스들, 본 개시에 설명된 기능들을 수행하도록 설계된 다른 전자 유닛들, 컴퓨터, 또는 이들의 조합 내에서 구현될 수도 있다. 따라서, 본 개시와 연계하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 및 회로들은 범용 프로세서, DSP, ASIC, FPGA나 다른 프로그램 가능 논리 디바이스, 이산 게이트나 트랜지스터 로직, 이산 하드웨어 컴포넌트들, 또는 본원에 설명된 기능들을 수행하도록 설계된 것들의 임의의 조합으로 구현되거나 수행될 수도 있다. 범용 프로세서는 마이크로프로세서일 수도 있지만, 대안으로, 프로세서는 임의의 종래의 프로세서, 제어기, 마이크로 제어기, 또는 상태 머신일 수도 있다. 프로세서는 또한, 컴퓨팅 디바이스들의 조합, 예를 들면, DSP와 마이크 로프로세서, 복수의 마이크로프로세서들, DSP 코어와 연계한 하나 이상의 마이크로프로세서들, 또는 임의의 다 른 구성의 조합으로서 구현될 수도 있다. 펌웨어 및/또는 소프트웨어 구현에 있어서, 기법들은 랜덤 액세스 메모리(random access memory; RAM), 판독 전 용 메모리(read-only memory; ROM), 비휘발성 RAM(non-volatile random access memory; NVRAM), PROM(programmable read-only memory), EPROM(erasable programmable read-only memory), EEPROM(electrically erasable PROM), 플래시 메모리, 컴팩트 디스크(compact disc; CD), 자기 또는 광학 데이 터 스토리지 디바이스 등과 같은 컴퓨터 판독가능 매체 상에 저장된 명령들로서 구현될 수도 있다. 명령들은 하나 이상의 프로세서들에 의해 실행 가능할 수도 있고, 프로세서(들)로 하여금 본 개시에 설명된 기능의 특정 양태들을 수행하게 할 수도 있다. 소프트웨어로 구현되는 경우, 상기 기법들은 하나 이상의 명령들 또는 코드로서 컴퓨터 판독 가능한 매체 상에 저장되거나 또는 컴퓨터 판독 가능한 매체를 통해 전송될 수도 있다. 컴퓨터 판독가능 매체들은 한 장소에서 다른 장소로 컴퓨터 프로그램의 전송을 용이하게 하는 임의의 매체를 포함하여 컴퓨터 저장 매체들 및 통신 매 체들 양자를 포함한다. 저장 매체들은 컴퓨터에 의해 액세스될 수 있는 임의의 이용 가능한 매체들일 수도 있 다. 비제한적인 예로서, 이러한 컴퓨터 판독가능 매체는 RAM, ROM, EEPROM, CD-ROM 또는 다른 광학 디스크 스 토리지, 자기 디스크 스토리지 또는 다른 자기 스토리지 디바이스들, 또는 소망의 프로그램 코드를 명령들 또는 데이터 구조들의 형태로 이송 또는 저장하기 위해 사용될 수 있으며 컴퓨터에 의해 액세스될 수 있는 임의의 다 른 매체를 포함할 수 있다. 또한, 임의의 접속이 컴퓨터 판독가능 매체로 적절히 칭해진다. 예를 들어, 소프트웨어가 동축 케이블, 광섬유 케이블, 연선, 디지털 가입자 회선 (DSL), 또는 적외선, 무선, 및 마이크로파와 같은 무선 기술들을 사용하여 웹사이트, 서버, 또는 다른 원격 소스로부터 전송되면, 동축 케이블, 광섬유 케이블, 연선, 디지털 가입자 회선, 또는 적외선, 무선, 및 마이크로파와 같은 무선 기술들은 매 체의 정의 내에 포함된다. 본원에서 사용된 디스크(disk) 와 디스크(disc)는, CD, 레이저 디스크, 광 디스크, DVD(digital versatile disc), 플로피디스크, 및 블루레이 디스크를 포함하며, 여기서 디스크들(disks)은 보통 자기적으로 데이터를 재생하고, 반면 디스크들(discs) 은 레이저를 이용하여 광학적으로 데이터를 재생한다. 위의 조합들도 컴퓨터 판독가능 매체들의 범위 내에 포함되어야 한다. 소프트웨어 모듈은, RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터들, 하드 디스크, 이동식 디스크, CD-ROM, 또는 공지된 임의의 다른 형태의 저장 매체 내에 상주할 수도 있다. 예시적인 저장 매체는, 프로세서가 저장 매체로부터 정보를 판독하거나 저장 매체에 정보를 기록할 수 있도록, 프로세서 에 연결될 수 있다. 대안으로, 저장 매체는 프로세서에 통합될 수도 있다. 프로세서와 저장 매체는 ASIC 내에 존재할 수도 있다. ASIC은 유저 단말 내에 존재할 수도 있다. 대안으로, 프로세서와 저장 매체는 유저 단말에 서 개별 구성요소들로서 존재할 수도 있다. 이상 설명된 실시예들이 하나 이상의 독립형 컴퓨터 시스템에서 현재 개시된 주제의 양태들을 활용하는 것으로 기술되었으나, 본 개시는 이에 한정되지 않고, 네트워크나 분산 컴퓨팅 환경과 같은 임의의 컴퓨팅 환경과 연계 하여 구현될 수도 있다. 또 나아가, 본 개시에서 주제의 양상들은 복수의 프로세싱 칩들이나 장치들에서 구현 될 수도 있고, 스토리지는 복수의 장치들에 걸쳐 유사하게 영향을 받게 될 수도 있다. 이러한 장치들은 PC들, 네트워크 서버들, 및 휴대용 장치들을 포함할 수도 있다."}
{"patent_id": "10-2021-0158053", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 명세서에서는 본 개시가 일부 실시예들과 관련하여 설명되었지만, 본 개시의 발명이 속하는 기술분야의 통상 의 기술자가 이해할 수 있는 본 개시의 범위를 벗어나지 않는 범위에서 다양한 변형 및 변경이 이루어질 수 있 다. 또한, 그러한 변형 및 변경은 본 명세서에 첨부된 특허청구의 범위 내에 속하는 것으로 생각되어야 한다."}
{"patent_id": "10-2021-0158053", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 실시예들은, 이하 설명하는 첨부 도면들을 참조하여 설명될 것이며, 여기서 유사한 참조 번호는 유사 한 요소들을 나타내지만, 이에 한정되지는 않는다.도 1은 본 개시의 일 실시예에 따른 고빈도 증권 거래 장치의 작동 예시를 나타내는 개요도이다. 도 2는 본 개시의 일 실시예에 따른 고빈도 증권 거래 장치의 내부 구성을 나타내는 블록도이다. 도 3은 본 개시의 일 실시예에 따른 프로세서의 내부 구성을 나타내는 도면이다. 도 4는 본 개시의 일 실시예에 따라 예측 복잡도를 결정하는 복잡도 판정부가 포함된 프로세서의 내부 구성을 나타내는 도면이다. 도 5는 본 개시의 일 실시예에 따라, 예측 복잡도를 결정하고 결정된 예측 복잡도에 따라 기계학습 모델을 이용 할 지 여부를 판정하는 방법의 예시를 나타내는 도면이다. 도 6은 본 개시의 일 실시예에 따른 고빈도 증권 주문 데이터를 생성하는 방법의 예시를 나타내는 도면이다. 도 7은 본 개시의 일 실시예에 따른 기계학습 모델이 입력 데이터를 기초로 출력 데이터를 출력하는 예시를 나 타내는 도면이다. 도 8은 본 개시의 일 실시예에 따른 기계학습 모델의 입력 데이터의 구성의 예시를 나타내는 도면이다. 도 9는 본 개시의 일 실시예에 따른 FPGA 및 NPU를 포함하는 고빈도 증권 거래 장치를 동작하는 방법의 예시를 나타내는 흐름도이다. 도 10은 본 개시의 일 실시예에 따른 고빈도 증권 주문 데이터를 생성하는 방법의 예시를 나타내는 흐름도이다. 도 11은 본 개시의 일 실시예에 따른 인공신경망 모델을 나타내는 예시도이다. 도 12는 본 개시의 일 실시예에 따른 고빈도 증권 거래 또는 고빈도 증권 주문 데이터 생성과 연관된 임의의 컴 퓨팅 장치의 구성도이다."}
