{"patent_id": "10-2023-0081967", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0000293", "출원번호": "10-2023-0081967", "발명의 명칭": "불법광고물 관리방법", "출원인": "이병길", "발명자": "이병길"}}
{"patent_id": "10-2023-0081967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "불법광고물 관리장치(100)와, 합법광고물 게시대 운영장치(200), 불법광고물 정보입력 단말기(300), 불법광고물제거명령 이행자 단말기(400), 그리고 과태료부과 행정기관 단말기(500)로 이루어져 불법광고물을 관리하는 방법으로서,상기 불법광고물 관리장치(100)에서,상기 합법광고물 게시대 운영장치(200)로부터 설치 위치, 게시 공간과 같은 합법 게시 가능한 게시대의 정보를입력받아 저장하는 단계(S110)와;상기 불법광고물 정보입력 단말기(300)로부터 게시내용, 위치와 같은 불법광고물의 정보를 입력받아 저장하고,상기 합법광고물 게시대 운영장치(200)에 제공하는 단계(S120); 및,상기 단계(S120)에서 입력받은 불법광고물의 정보로부터 해당 광고물의 제거명령 이행자를 추출하여 해당 불법광고물의 정보에 기초한 불법 내용의 통지와 상기 단계(S110)에서 입력받은 게시대의 정보 안내를 상기 불법광고물 제거명령 이행자 단말기(400)에 제공하는 단계(S130);를 포함하여 수행하고,상기 합법광고물 게시대 운영장치(200)에서,상기 단계(S120)에서 입력받은 불법광고물의 정보를 게시대의 추가 설치에 활용하는 단계(S210)와;상기 단계(S210)에서 추가 설치된 게시대의 정보를 상기 단계(S110)에서 입력되는 합법 게시 가능한 게시대의정보에 업데이트하는 단계(S220);를 수행하는 것을 특징으로 하는 불법광고물 관리방법."}
{"patent_id": "10-2023-0081967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 단계(S120)에서 상기 합법광고물 게시대 운영장치(200)에 제공하는 불법광고물의 정보는, 상기 불법광고물의 위치인 것을 특징으로 하는 불법광고물 관리방법."}
{"patent_id": "10-2023-0081967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 단계(S130)에서 상기 불법광고물 제거명령 이행자 단말기(400)에 제공하는 게시대의 정보 안내는, 상기 불법광고물의 위치를 중심으로 하는 것을 특징으로 하는 불법광고물 관리방법."}
{"patent_id": "10-2023-0081967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 단계(S130)에서의 정보들을 제공받은 상기 광고물의 제거명령 이행자 단말기(400)로부터 소정 기간 내에불법광고물의 제거인증 입력이 확인되지 않은 경우, 상기 불법광고물의 정보를 활용하여 법 위반에 따른 과태료사전통지 대상자를 선정하여 상기 과태료부과 행정기관 단말기(500)에 제공하는 단계(S150);를 더 구비한 것을특징으로 하는 불법광고물 관리방법."}
{"patent_id": "10-2023-0081967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 불법광고물의 정보 활용은, 상기 단계(S120)에서 추출된 제거명령 이행자 정보를 활용하는 것을 특징으로하는 불법광고물 관리방법."}
{"patent_id": "10-2023-0081967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2025-0000293-3-제 4항에 있어서,상기 불법광고물의 제거인증 입력의 확인은, 상기 불법광고물 제거명령 이행자 단말기(400)로부터 입력받은 해당 불법광고물의 제거 전후를 촬영한 사진과 상기 단계(S120)에서 입력받아 저장된 해당 불법광고물의 정보와대비하여 하게 한 것을 특징으로 하는 불법광고물 관리방법."}
{"patent_id": "10-2023-0081967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 단계(S130)에서의 정보들을 제공받은 상기 광고물의 제거명령 이행자 단말기(400)로부터 소정 기간 내에불법광고물의 제거인증 입력이 확인되고, 합법 게시 가능한 게시대의 정보 안내에 따라 희망하는 게시대의 게시가능 공간의 입력이 확인되는 경우, 해당 게시대의 정보를 상기 합법광고물 게시대 운영장치(200)에 제공하는단계(S170);를 더 구비하는 것을 특징으로 하는 불법광고물 관리방법."}
{"patent_id": "10-2023-0081967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 희망하는 게시대의 게시가능 공간 입력의 확인은, 상기 불법광고물 제거명령 이행자 단말기(400)로부터 입력받은 상기 희망하는 게시대의 게시가능 공간 정보를 상기 단계(S110)에서 입력받아 저장된 해당 합법광고물의게시대 정보와 대비하여 하게 한 것을 특징으로 하는 불법광고물 관리방법."}
{"patent_id": "10-2023-0081967", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이 발명은 지정 게시대가 아닌 곳에 허가받지 않고 게시하는 현수막과 같은 불법광고물에 대해 인공지능 기술을 활용하여 게시 관련자가 자진하여 철거 후 합법적인 게시로 이어지게 하면서 만일 철거하지 않은 경우 나머지에 대해 집중적으로 과태료를 부과하고 또한 그 절차도 간소화되어 효율적으로 하여 법을 지키면서 주변 환경과 조 (뒷면에 계속)"}
{"patent_id": "10-2023-0081967", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이 발명은 불법광고물 관리방법에 관한 것으로, 보다 상세하게는 지정된 게시대가 아닌 곳에 허가받지 않고 게 시하는 현수막과 같은 불법광고물에 대해 인공지능을 적용하여 게시 관련자가 자진 철거 후 합법적인 게시로 이 어지게 하고, 철거하지 않은 경우 과태료를 부과하는 불법광고물 관리방법에 관한 것이다."}
{"patent_id": "10-2023-0081967", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 현수막은 여러 가지 광고 문안이나 선전 문구 등을 기재하여 사람들의 눈에 잘 띄는 장소에 양쪽의 각목과 같은 지지대를 끈으로 묶어 팽팽하게 당겨 게시함으로써, 홍보 및 선전 효과를 갖도록 하는 오프라인 광 고 중에 가장 오래되면서도 투자비용 대비 효과가 높은 광고 수단이다. 도 1은 현수막 형태로 수목 등에 게시된 불법광고물의 예와 게시된 상태로 방치된 불법광고물의 예를 나타낸 도 면들이고, 도 2는 광고물이 현수막 거치대에 합법적으로 게시된 예를 나타낸 도면들이다. 도 1의 (a)에 나타낸 바와 같이 불법 현수막은 주로 가로수, 지주, 전봇대 등에 묶는 방식으로 무분별하게 게시 되면서 도시의 미관을 해칠 뿐만 아니라 도 1의 (b)에 나타낸 바와 같이 방치되면서 보행자와 차량의 안전을 위 협하는 도구가 되기에, 각 지자체에서는 도 2에 나타낸 바와 같이 지정한 장소에 설치한 현수막 게시대를 이용 하여 합법적으로 광고물을 게시하게 한다. 그러나 현수막 게시대는 수요에 비해 턱없이 부족한 상황이므로 눈에 잘 띄는 주요 도로변 가로수나 지주, 전봇 대 사이에 불법으로 게시하고 있어 도시미관 훼손은 물론 철거와 설치의 악순환이 반복되고 또한 그대로 방치하 는 경우 안전을 위협하게 된다. 이에 따라 불법 현수막이 발견된 경우, 제거하거나 한두 차례 계도 후 개선되지 않으면 과태료를 부과하고 있지 만, 인력 부족, 민원 소지 등 한계가 있어, 4차 산업혁명 시대에 인공지능을 적용하여 실효성 있게 불법 현수막 의 근절 및 합법 현수막의 정착을 구현할 필요성이 있게 된다."}
{"patent_id": "10-2023-0081967", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이 발명은 위의 문제점을 해결하기 위한 것으로서, 지정 게시대가 아닌 곳에 허가받지 않고 게시하는 현수막과 같은 불법광고물에 대해 인공지능 기술을 활용하여 게시 관련자가 자진하여 철거 후 합법적인 게시로 이어지게 하면서 만일 철거하지 않은 경우 나머지에 대해 집중적으로 과태료를 부과하고 또한 그 절차도 간소화되어 효율 적으로 하여 법을 지키면서 주변 환경과 조화를 이루어 깨끗한 환경과 시민 안전으로 쾌적화된 도시 이미지를 조성하는 불법광고물 관리방법의 제공을 과제로 한다."}
{"patent_id": "10-2023-0081967", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 과제를 실현하기 위해 이 발명은, 불법광고물 관리장치와, 합법광고물 게시대 운영장치, 불법 광고물 정보입력 단말기, 불법광고물 제거명령 이행자 단말기, 그리고 과태료부과 행정기관 단말기 로 이루어져 불법광고물을 관리하는 방법으로서, 상기 불법광고물 관리장치에서, 상기 합법광고물 게 시대 운영장치로부터 설치 위치, 게시 공간과 같은 합법 게시 가능한 게시대의 정보를 입력받아 저장하는 단계(S110)와; 상기 불법광고물 정보입력 단말기로부터 게시내용, 위치와 같은 불법광고물의 정보를 입력 받아 저장하고, 상기 합법광고물 게시대 운영장치에 제공하는 단계(S120); 및, 상기 단계(S120)에서 입력 받은 불법광고물의 정보로부터 해당 광고물의 제거명령 이행자를 추출하여 해당 불법광고물의 정보에 기초한 불 법 내용의 통지와 상기 단계(S110)에서 입력받은 게시대의 정보 안내를 상기 불법광고물 제거명령 이행자 단말 기에 제공하는 단계(S130);를 포함하여 수행하고, 상기 합법광고물 게시대 운영장치에서, 상기 단계 (S120)에서 입력받은 불법광고물의 정보를 게시대의 추가 설치에 활용하는 단계(S210)와; 상기 단계(S210)에서 추가 설치된 게시대의 정보를 상기 단계(S110)에서 입력되는 합법 게시 가능한 게시대의 정보에 업데이트하는 단계(S220);를 수행하는 것을 특징으로 하는 불법광고물 관리방법을 제공한다. 바람직하게는, 상기 단계(S120)에서 상기 합법광고물 게시대 운영장치에 제공하는 불법광고물의 정보는, 상기 불법광고물의 위치일 수 있다. 바람직하게는, 상기 단계(S130)에서 상기 불법광고물 제거명령 이행자 단말기에 제공하는 게시대의 정보 안내는, 상기 불법광고물의 위치를 중심으로 할 수 있다. 바람직하게는, 상기 단계(S130)에서의 정보들을 제공받은 상기 광고물의 제거명령 이행자 단말기로부터 소 정 기간 내에 불법광고물의 제거인증 입력이 확인되지 않은 경우, 상기 불법광고물의 정보를 활용하여 법 위반 에 따른 과태료 사전통지 대상자를 선정하여 상기 과태료부과 행정기관 단말기에 제공하는 단계(S150);를 더 구비할 수 있다. 바람직하게는, 상기 불법광고물의 정보 활용은, 상기 단계(S120)에서 추출된 제거명령 이행자 정보를 활용할 수 있다. 바람직하게는, 상기 불법광고물의 제거인증 입력의 확인은, 상기 불법광고물 제거명령 이행자 단말기로부 터 입력받은 해당 불법광고물의 제거 전후를 촬영한 사진과 상기 단계(S120)에서 입력받아 저장된 해당 불법광 고물의 정보와 대비하여 하게 할 수 있다. 바람직하게는, 상기 단계(S130)에서의 정보들을 제공받은 상기 광고물의 제거명령 이행자 단말기로부터 소 정 기간 내에 불법광고물의 제거인증 입력이 확인되고, 합법 게시 가능한 게시대의 정보 안내에 따라 희망하는 게시대의 게시가능 공간의 입력이 확인되는 경우, 해당 게시대의 정보를 상기 합법광고물 게시대 운영장치(20 0)에 제공하는 단계(S170);를 더 구비할 수 있다. 바람직하게는, 상기 희망하는 게시대의 게시가능 공간 입력의 확인은, 상기 불법광고물 제거명령 이행자 단말기 로부터 입력받은 상기 희망하는 게시대의 게시가능 공간 정보를 상기 단계(S110)에서 입력받아 저장된 해 당 합법광고물의 게시대 정보와 대비하여 하게 할 수 있다."}
{"patent_id": "10-2023-0081967", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기의 해결 수단을 갖는 이 발명의 불법광고물 관리방법에 의하면, 불법 현수막을 제거하거나 과태료를 부과하 기 이전에 인공지능 기술을 활용하여 불법 현수막의 정보를 분석하고 이를 다음에 적용하여 불법 현수막의 제거 단속 또는 계도, 과태료부과와 같은 업무를 집중적이고 효율적으로 수행하여 불법 현수막을 줄이면서 이를 합법 현수막의 설치, 관리 및 인증 사업으로 전환해 합법 현수막을 정착시키는데, 여기에는 상업 현수막뿐만 아니라 예외의 최소 허용과 특권을 배제시켜 정당 게시물, 공공기관의 현수막도 포함하여 법질서를 확립함으로써 불법 현수막 없는 쾌적하고 안전한 거리 조성하고, 부수적으로 수입증대, 일자리 창출에도 기여할 수 있는 효과가 있 게 된다.먼저, 분석된 불법광고물의 정보로부터 추출된 제거명령 이행자에게 불법 내용을 통지하여 자진 제거하게 계도 하고, 동시에 불법 현수막의 현재 위치를 중심으로 장소를 안내하여 현수막의 합법 설치로 이어지게 한다. 여기에는, 분석된 불법광고물의 정보로부터 불법 현수막의 설치 장소를 활용하여 광고 효과 높은 합법 설치 가 능한 장소를 지속적으로 발굴 업데이트하여 광고 수요를 충족시킴으로써, 자진 제거 후 합법 설치로 이어짐을 뒷받침한다. 즉, 불법광고물 게시 장소들이 대개 사람들 눈에 잘 띄어 광고 효과가 높은 곳이므로 이를 기초로 주변 환경과 조화를 이루고 안전을 고려하면서 고단에서 저단까지 다양한 형태의 지정 게시대의 적합한 설치 장소를 추가로 다수 확보하여 불법광고물 게시자들에게 질과 양 측면에서 광고 수요를 충족할 수 있어, 불법광고물 게시자들에 게는 단순 제거 통지에 그치지 않고 합법적으로 게시할 수 있는 유용한 정보로 제공되어, 법을 지키면서 근거 있고 폭넓게 광고 계획을 수립 및 집행할 수 있어 광고 효과를 높이게 된다. 그리고 이로 인하여 합법광고물 게시대 운영자에게는 합법광고물의 정착으로 설치와 관리를 통한 수익 중대와 광고물에 대한 처리 등을 쉽게 할 수 있게 된다. 다음으로, 계도에 따르지 않은 나머지 자진 제거로 줄어든 불법 현수막에 대해서는 집중적으로 과태료를 부과하 고 또한 그 절차도 분석된 불법광고물의 정보로부터 예를 들어 추출된 제거명령 이행자 정보에서 대상자를 선정 하여 효율적으로 과태료를 부과할 수 있게 한다. 이로부터 지자체에서는, 불법광고물에 대한 철거, 과태료부과, 고발 조치 전에 원인 제공자인 제거명령 이행자 의 책임으로 사전에 자진 철거 및 광고 수요를 충족시켜 합법적인 게시로 이어지도록 함으로써, 행정처분 자체 가 줄어들면서 인력 투입 등 행정력 낭비를 줄일 수 있음과 동시에 불법광고물에 대해 예외없는 무관용의 과태 료부과를 통한 법 집행으로 법을 지키는 문화가 확고하게 자리 잡고 인력과 비용의 집중으로 쾌적하고 안전한 도시 거리를 조성하게 된다."}
{"patent_id": "10-2023-0081967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 이 발명의 바람직한 실시 예를 첨부하는 도면들을 참조하여 상세하게 설명하는데, 이는 이 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세하게 설명하기 위한 것이지, 이 로 인해 이 발명의 기술적인 사상 및 범주가 한정되는 것을 의미하지는 않는다. 도 3은 이 발명의 실시 예에 따른 불법광고물 관리방법을 구현하기 위한 시스템을 나타낸 블록도이고, 도 4는 도 3의 시스템에서 불법광고물 관리장치의 구성을 나타낸 블록도이고, 도 5는 옥외광고물법상 불법현수막의 행 정처분별 대상자를 나타낸 도면이다.이 발명의 실시 예에 따른 불법광고물 관리방법은, 도 3에 나타낸 바와 같이 불법광고물 관리장치와, 합법 광고물 게시대 운영장치, 불법광고물 정보입력 단말기, 불법광고물 제거명령 이행자 단말기, 그 리고 과태료부과 행정기관 단말기로 시스템을 이루어 구동하면서 수행될 수 있다. 상기 불법광고물 관리장치는, 도 4에 나타낸 바와 같이, 입력부와, 제어부와, 저장부, 그 리고 출력부를 구비할 수 있다. 상기 입력부는, 상기 합법광고물 게시대 운영장치로부터 설치 위치, 게시 가능 공간과 같은 게시대의 정보를 입력받는다. 그리고 상기 불법광고물 정보입력 단말기로부터 게시내용, 위치와 같은 불법광고물의 정보를 입력받는다. 또한, 상기 불법광고물 제거명령 이행자 단말기로부터 소정 기간 내 광고물 제거인증 과, 희망하는 게시대의 게시가능 공간정보를 입력받는다. 상기 제어부는, 제거명령 이행자 추출모듈과, 불법 내용 통지 및 게시대정보 안내모듈과, 제거 인증 확인모듈과, 희망 게시대 정보확인모듈, 그리고 정보 관리모듈을 구비한다. 상기 제거명령 이행자 추출모듈은, 상기 불법광고물 정보입력 단말기로부터 입력받은 게시내용, 위치 와 같은 불법광고물의 정보로부터 해당 광고물의 제거명령 이행자를 추출한다. 도 5에 나타낸 바와 같이, 과태료부과 대상에는 ‘표시하거나 설치한 자’이고, 과태료 사전통지 전에 제거 명 령을 할 수 있는 불법광고물의 제거명령 이행자에는 과태료부과 대상인 불법광고물을 ‘표시하거나 설치한 자’ 뿐만 아니라 ‘광고주, 관리하는 자, 옥외광고 사업자, 표시ㆍ설치를 승낙한 토지ㆍ건물 등의 소유자 또는 관리 자’ 중의 어느 하나를 포함하여 상기 불법광고물 정보입력 단말기에서 입력된 정보로부터 해당 불법광고 물의 제거명령 이행자를 쉽고 빠르게 분석 및 추출할 수 있고, 이는 자진 제거를 원활하고 빠르게 진행되게 하 는 요인이 될 수 있다. 그리고 상기 불법광고물 정보입력 단말기에서 입력된 현수막 형태의 불법광고물과 관련된 정보를 분석하여 해당 불법광고물의 제거명령 이행자를 추출하는 데에는, 인공지능 기술을 활용하여 촬영된 이미지 인식, 언어 처리, 데이터 분석 등의 과정을 자동으로 수행하게 할 수 있다. 먼저, 인공지능 기술을 활용하여 현수막에 포함된 정보를 분석하고, 검색어로 사용할 수 있는 형태로 변환한다. 이 과정에서 현수막 이미지를 OCR 기술을 이용하여 텍스트로 변환하는 등의 기술을 사용할 수 있다. 다음으로, 텍스트로 변환한 검색어를 기반으로 검색 엔진 또는 웹 스크래핑 기술 등을 이용하여 검색한다. 다음으로, 검색한 정보를 분석하여 예를 들어, 게시자의 이름, 상호, 단체, 주소, 메일주소, 전화번호 등을 찾 아 제거명령 이행자를 파악 추출할 수 있다. 이 과정에서는 텍스트 마이닝, 네트워크 분석, 기계학습 등의 기술 을 사용할 수 있다. 상기 불법 내용 통지 및 게시대정보 안내모듈은, 상기 제거명령 이행자 추출모듈에서 추출된 해당 광 고물의 제거명령 이행자에게, 상기 불법광고물 정보입력 단말기로부터 입력받아 상기 저장부에 저장 되어있는 해당 불법광고물의 정보에 기초한 불법 내용의 통지와 상기 합법광고물 게시대 운영장치로부터 입력받아 상기 저장부에 저장되어있는 게시대의 정보 안내를 상기 출력부를 통해 상기 불법광고물 제 거명령 이행자 단말기에 제공하여, 추출된 해당 광고물의 제거명령 이행자에 의한 자진 제거 또는 자진 제 거 후 합법 게시로 이어지게 유도한다. 상기 제거인증 확인모듈은, 상기 불법 내용 통지 및 게시대정보 안내모듈에서의 정보들을 제공받은 상기 광고물의 제거명령 이행자 단말기로부터 소정 기간 내에 불법광고물의 제거인증 입력이 확인되지 않 은 경우, 상기 불법광고물의 정보를 활용하여 법 위반에 따른 과태료 사전통지 대상자를 선정하여 상기 출력부 를 통해 과태료부과 행정기관 단말기에 상기 출력부를 통해 제공한다. 여기서, 상기 불법광고물의 제거인증 입력의 확인은, 상기 불법광고물 제거명령 이행자 단말기로부터 입력 되는 상기 불법광고물의 제거 전후를 촬영한 사진을, 상기 불법광고물 정보입력 단말기로부터 입력받아 상 기 저장부에 저장되어있는 해당 불법광고물의 정보와 대비하여 하게 한다. 그리고 법 위반에 따른 과태료 사전통지 대상자를 선정하는데 있어서, 상기 불법광고물의 정보 활용은, 해당 불 법 광고물에 대해 상기 제거명령 이행자 추출모듈에서 추출된 제거명령 이행자 정보로 할 수 있다. 상기 희망 게시대 정보확인모듈은, 상기 불법 내용 통지 및 게시대정보 안내모듈에서의 정보들을 제 공받은 상기 광고물의 제거명령 이행자 단말기로부터 소정 기간 내에 불법광고물의 제거인증 입력이 확인되고, 합법 게시 가능한 게시대의 정보 안내에 따라 희망하는 게시대의 게시가능 공간 입력이 확인되는 경우, 해당 정보를 상기 합법광고물 게시대 운영장치에 상기 출력부를 통해 제공하게 한다. 여기서, 상기 희망하는 게시대의 게시가능 공간정보 입력의 확인은, 상기 불법광고물 제거명령 이행자 단말기 로부터 입력되는 상기 희망하는 게시대의 게시가능 공간정보를, 상기 합법광고물 게시대 운영장치로 부터 입력받아 상기 저장부에 저장되어있는 해당 합법광고물의 게시대 정보와 대비하여 하게 한다. 상기 정보 관리모듈은, 상기 입력부를 통해 상기 불법광고물 정보입력 단말기로부터 입력받은 게시내용, 위치와 같은 불법광고물의 정보를 상기 저장부에 저장하고, 상기 출력부를 통해 상기 합법 광고물 게시대를 추가로 설치하는데 활용하는 자료로 상기 합법광고물 게시대 운영장치에 제공하여 수시로 또는 주기적으로 추가되는 게시대의 위치와 해당 게시대의 게시 가능 공간정보를 업데이트할 수 있게 한다. 여기서, 상기 합법광고물 게시대 운영장치에 제공하는 정보는 상기 불법광고물 정보입력 단말기로부 터 입력되는 불법광고물의 위치로서, 대개 눈에 잘 띄는 장소이므로 인공지능 기술을 적용하여 상기 합법광고물 게시대 운영장치에서 상기 합법광고물 게시대를 추가로 설치하는데 유용한 자료로 될 수 있다. 그리고 상기 정보 관리모듈은, 상기 입력부를 통해 상기 합법광고물 게시대 운영장치로부터 주 기적으로 또는 변동 발생 시마다 수시로 업데이트하면서 입력되는 게시대의 설치 위치와 해당 게시대의 게시 가 능 공간정보와 같은 게시대 정보를 상기 저장부에 저장한다. 또한, 상기 정보 관리모듈은, 상기 불법 내용 통지 및 게시대정보 안내모듈의 요청에 의해, 해당 불 법광고물을 게시한 위치를 중심으로 상기 저장부에 저장되어있는 게시대의 위치와 해당 게시대의 게시 가 능 공간정보를 제공하는데, 소정 면적으로 한정하는 주변 지역에 설치되는 개시대의 정보와 전 지역에 설치되어 있는 게시대의 정보로 구분하여 제공할 수 있게 관리한다. 그리고 상기 정보 관리모듈은, 불법광고물의 제거인증 입력의 확인을 위한 상기 제거인증 확인모듈의 요청에 의해, 상기 불법광고물 제거명령 이행자 단말기로부터 입력되는 상기 불법광고물의 제거 전후를 촬 영한 사진과 대비하게 상기 저장부에 저장되어있는 해당 불법광고물의 정보를 제공하며, 희망하는 게시대 의 게시가능 공간정보 입력의 확인을 위한 상기 희망 게시대 정보확인모듈의 요청에 의해, 상기 불법광고 물 제거명령 이행자 단말기로부터 입력되는 상기 희망하는 게시대의 게시가능 공간정보와 대비하게 상기 저장부에 저장되어있는 해당 합법광고물의 게시대 정보를 제공한다. 상기 저장부는, 합법광고물 게시대 정보 DB와 불법광고물 정보 DB를 구비한다. 상기 합법광고물 게시대 정보 DB는, 상기 정보 관리모듈을 통해 상기 합법광고물 게시대 운영장치 에서 업데이트되면서 입력되는 게시대의 설치 위치와 해당 게시대의 게시 가능 공간정보를 저장하고, 상기 불법 내용 통지 및 게시대정보 안내모듈에 제공한다. 또한, 상기 합법광고물 게시대 정보 DB는, 상기 희망 게시대 정보확인모듈의 요청에 의해 상기 정보 관리모듈을 통해 저장되어있는 합법광고물 게시대 정보를 제공하여 상기 불법광고물 제거명령 이행자 단말 기로부터 입력받은 희망하는 게시대의 게시 가능 공간정보와 대비하여 확인하게 한다. 상기 불법광고물 정보 DB는, 상기 정보 관리모듈을 통해 상기 불법광고물 정보입력 단말기에서 입력된 불법광고물 정보와 상기 제거명령 이행자 추출모듈에서 추출된 해당 불법광고물의 제거명령 이행자 정보를 저장하고, 상기 제거인증 확인모듈의 요청에 의해 저장되어있는 불법광고물 정보를 제공하여 상기 불법광고물 제거명령 이행자 단말기로부터 입력받은 해당 불법광고물 제거인증을 확인하게 하며, 제거인증 이 확인되지 않은 경우에 추출된 해당 불법광고물의 제거명령 이행자 정보를 활용하여 법 위반에 따른 과태료 사전통지 대상자를 선정하여 상기 출력부를 통해 상기 과태료부과 행정기관 단말기에 제공하게 한다. 상기 출력부는, 상기 제어부의 정보 관리모듈에서 상기 불법광고물 정보입력 단말기로부터 게시내용, 위치와 같은 불법광고물의 정보를 상기 합법광고물 게시대의 추가 설치에 활용하는 자료로 상기 합법 광고물 게시대 운영장치에 제공하게 출력하고, 상기 제거명령 이행자 추출모듈에서 추출된 해당 광고 물의 제거명령 이행자에 의한 자진 제거 또는 자진 제거 후 합법 게시로 이어지게 상기 불법 내용 통지 및 게시 대정보 안내모듈에서 해당 불법광고물의 정보에 기초한 불법 내용 통지와 게시대의 정보에 기초한 게시가 능 장소 안내를 상기 불법광고물 제거명령 이행자 단말기에 제공하게 출력하며, 상기 제거인증 확인모듈 에서 상기 불법광고물 제거명령 이행자 단말기로부터 소정 기간 내에 해당 불법광고물의 제거인증의 입력이 확인되지 않으면 과태료 사전통지 대상자로 선정하여 상기 과태료부과 행정기관 단말기에 제공하게출력하고, 상기 희망 게시대 정보확인모듈에서 희망하는 게시대의 게시 가능 공간정보의 입력이 확인되면 해당 불법광고물의 합법 게시절차를 진행하게 희망하는 게시대의 게시 가능 공간정보를 상기 합법광고물 게시대 운영장치에 제공하게 출력한다. 도 6은 도 3의 시스템에서 합법광고물 게시대 운영장치의 구성을 나타낸 블록도이다. 상기 합법광고물 게시대 운영장치는 합법광고물의 게시대 설치, 설치된 게시대의 게시 가능 공간에 광고물 설치 여부와 같은 게시대 현황을 관리하면서 운영하는 장치로서, 도 6에 나타낸 바와 같이, 입력부와, 제 어부와, 저장부, 그리고 출력부를 구비할 수 있다. 상기 입력부는, 상기 합법광고물 게시대 추가 설치에 따른 게시대의 정보와 추가로 설치된 게시대의 게시 가능 공간에 광고물 설치 여부와 같은 현황을 입력한다. 그리고 상기 불법광고물 관리장치로부터 게시대를 추가 설치하는데 활용하게 상기 불법광고물 정보입력 단말기의 불법광고물 정보를 입력받는다. 상기 제어부는, 상기 입력부에서 입력된 불법광고물 정보를 활용하여 상기 합법광고물 게시대를 추가 설치하게 제어하는데, 불법광고물의 위치가 대개 눈에 잘 띄는 장소이므로 해당 위치를 중심으로 주변 환경 등 을 인공지능 기술을 적용하여 광고 효과가 높은 장소인지를 판단하는 적합한 자료로 될 수 있다. 그리고 상기 제어부는, 추가로 설치되는 합법광고물 게시대의 정보를 기존 게시대의 정보에 주기적으로 또 는 변동 발생 시마다 업데이트하여 상기 불법광고물 관리장치에 입력하게 제어한다. 상기 저장부는, 상기 제어부의 제어에 의해 주기적으로 또는 변동 발생 시마다 업데이트되는 게시대 의 정보를 저장한다. 상기 출력부는, 상기 제어부의 제어에 의해 주기적으로 또는 변동 발생 시마다 업데이트되는 게시대 의 정보를 상기 불법광고물 관리장치에 출력한다. 즉, 상기 합법광고물 게시대의 정보는, 게시대의 위치를 나타내는 주소와 주변 지도, 게시대가 설치된 주변 사 진, 그리고 게시대의 게시 기간과 게시 여부를 변동 발생 시 또는 주기적으로 업데이트하여 게시대의 현황을 나 타내므로, 게시대마다 게시 가능 여부 및 개수 등을 알 수 있어 불법광고물 게시자뿐만 아니라 게시를 원하는 게시자가 희망하는 게시대를 쉽고 빠르게 파악할 수 있게 된다. 상기 불법광고물 정보입력 단말기는, PC, 스마트폰, 태블릿 등과 같이 텍스트나 이미지 등을 입력할 수 있 는 멀티미디어 단말기로서, 불법광고물의 게시내용, 위치와 같은 정보를 상기 불법광고물 관리장치에 입력 한다. 여기서, 불법광고물의 게시내용, 위치와 같은 정보는 해당 불법광고물의 제거명령 이행자를 분석 및 추출하는데 활용되며, 특히 게시 위치는 주변의 합법광고물 게시가 가능한 공간을 안내하고 새로이 발굴하여 추가 업데이트 하는데 매우 적절하게 활용된다. 또한, 상기 불법광고물 정보입력 단말기로서, ‘안전신문고’라는 어플리 케이션을 통해 불법광고물의 정보를 입력을 할 수도 있다. 상기 불법광고물 제거명령 이행자 단말기는, PC, 스마트폰, 태블릿 등과 같이 텍스트나 이미지 등을 입출 력할 수 있는 멀티미디어 단말기로서, 상기 불법광고물 관리장치로부터 해당 불법광고물의 제거명령을 이 행하라는 통지와 함께 합법광고물 게시대의 게시 가능 공간정보를 안내받고, 또한 이에 대해 소정 기간 내에 해 당 불법광고물의 제거인증 입력 여부와 희망하는 합법적으로 게시 가능 공간의 입력 여부를 상기 불법광고물 관 리장치에 제공한다. 이러한 상기 불법광고물 제거명령 이행자 단말기에는, 해당 불법광고물의 제거명령을 이행하라는 통지와 합법광고물 게시대의 게시 가능 공간정보의 안내를 문자나 이미지 형태로 확인할 수 있거나 또는 이메일이나 홈 페이지 게시판을 통해 확인할 수 있는 단말기이면 모두 해당될 수 있다. 상기 과태료부과 행정기관 단말기는, 상기 광고물의 제거명령 이행자 단말기에서 해당 불법광고물의 제거명령을 이행하라는 통지와 함께 합법광고물 게시대의 게시 가능 공간정보를 안내받고 소정 기간 내에 불법 광고물의 제거인증 입력이 확인되지 않음과 법 위반에 따른 과태료 사전통지 대상자를 상기 불법광고물 관리장 치로부터 통지받아 과태료부과 등의 절차를 간편하게 수행한다. 이하에서는 이 발명의 실시 예에 따른 불법광고물 관리방법을 구현하는 과정을 상기 불법광고물 관리장치 와 합법광고물 게시대 운영장치을 중심으로 첨부하는 도면들을 참조하여 상세하게 설명하면 다음과 같다.도 7은 이 발명의 실시 예에 따른 불법광고물을 관리하는 방법 중 도 4의 장치에서 구현하는 과정을 나타내는 흐름도이다. 도 7에 나타낸 바와 같이, 상기 불법광고물 관리장치 중 제어부의 정보 관리모듈에서는, 상기 합법광고물 게시대 운영장치로부터 설치 위치, 게시 가능 공간과 같은 게시대 정보를 입력받아 상기 저장 부의 합법광고물 게시대 정보 DB에 저장한다.(S110) 그리고, 상기 정보 관리모듈에서는, 상기 불법광고물 정보입력 단말기에서 입력된 게시내용, 위치와 같은 정보를 입력받아 상기 저장부의 불법광고물 정보 DB에 저장한다. 또한, 상기 불법광고물 정보입 력 단말기에서 입력된 불법광고물 정보를 상기 합법광고물 게시대를 추가 설치하는 자료로 활용하도록 상 기 합법광고물 게시대 운영장치에 제공한다.(S120) 상기 합법광고물 게시대를 추가 설치하는 자료로 활용하도록 제공되는 상기 불법광고물 정보입력 단말기에 서 입력된 불법광고물 정보는, 불법광고물의 위치일 수 있다. 그리고, 상기 단계(S120)에서 입력받은 불법광고물의 정보로부터 상기 제거명령 이행자 추출모듈에서는 해 당 불법광고물의 제거명령 이행자를 추출하는데, 해당 불법광고물의 제거명령 이행자 추출은 이미지 인식, 언어 처리, 데이터 분석 등의 인공지능 기술을 활용하여 자동으로 수행할 수 있다. 또한, 상기 불법 내용 통지 및 게시대정보 안내모듈에서는, 상기 단계(S120)에서 추출된 해당 광고물의 제 거명령 이행자에 의한 자진 철거 또는 자진 철거 후 합법 게시로 이어지게, 해당 불법광고물의 정보에 기초한 불법 내용의 통지와 상기 단계(S110)에서 입력받은 게시대의 정보 안내를 상기 불법광고물 제거명령 이행자 단 말기에 제공한다.(S130) 상기 단계(S130)에서 합법 게시 가능한 게시대의 정보 안내는, 상기 불법광고물의 위치를 중심으로 제공하게 할 수 있다. 그리고 상기 제거인증 확인모듈에서는, 상기 단계(S130)에서 불법 내용 통지와 게시가능 장소를 안내한 상 기 불법광고물 제거명령 이행자 단말기로부터 소정기간 내 광고물 제거인증 입력이 되었는지 확인한 다.(S140) 여기서, 불법광고물의 제거인증 입력이 확인되는지는, 상기 제거인증 확인모듈에서 상기 불법광고물 제거 명령 이행자 단말기로부터 입력받은 해당 불법광고물의 제거 전후 사진과 같은 인증 내용과 상기 불법광고 물 정보 DB로부터 받은 상기 불법광고물 정보입력 단말기에서 입력된 불법광고물 정보로서 게시된 사 진을 대비 판단한다. 그리고 상기 제거인증 확인모듈에서는, 상기 불법광고물 제거명령 이행자 단말기로부터 해당 불법광 고물의 제거인증 입력이 확인되지 않으면, 상기 불법광고물의 정보를 활용하여 법 위반에 따른 과태료 사전통지 대상자를 선정하여 상기 과태료부과 행정기관 단말기에 제공한다.(S150) 법 위반에 따른 과태료 사전통지 대상자를 선정하는데 활용하는 상기 불법광고물의 정보는, 해당 불법 광고물에 대해 상기 단계(S120)에서 추출된 제거명령 이행자 정보일 수 있다. 그리고, 상기 제거인증 확인모듈에서 해당 불법광고물의 제거인증 입력이 확인되면, 상기 희망 게시대 정 보확인모듈에서는 상기 불법광고물 제거명령 이행자 단말기로부터 희망하는 게시대의 해당 게시대의 게시 가능 공간의 입력을 확인한다.(S160) 합법 게시 가능한 곳 입력이 확인되는지는, 상기 불법광고물 관리모듈에서 상기 불법광고물 제거명령 이행 자 단말기로부터 입력받은 희망 게시개의 게시 가능한 공간과 상기 합법광고물 게시대 정보 DB에 저 장된 합법광고물 게시대 정보를 비교하여 수행할 수 있다. 여기서, 상기 희망 게시대 정보확인모듈에서는, 상기 불법광고물 제거명령 이행자 단말기로부터 합법 게시 가능한 장소의 입력이 확인되지 않으면 게시 의사가 없는 것으로 하여 자진 제거로 종료되고, 희망하는 합 법 게시 가능한 장소의 입력이 확인되면 해당 불법광고물을 희망하는 게시대의 게시 가능 공간에 합법적으로 게 시하는 절차를 진행하게 게시대 정보를 상기 합법광고물 게시대 운영장치에 제공한다.(S170) 도 8은 이 발명의 실시 예에 따른 불법광고물을 관리하는 방법 중 도 6의 장치에서 구현하는 과정을 나타내는 흐름도이다.도 8에 나타낸 바와 같이, 상기 합법광고물 게시대 운영장치의 상기 제어부에서는, 상기 불법광고물 관리장치로부터 입력받은 불법광고물의 정보를 게시대의 추가 설치에 활용한다.(S210) 그리고 상기 제어부에서는, 상기 단계(S210)에서 추가 설치된 게시대의 정보를 상기 단계(S110)에서 불법 광고물 관리장치에 입력되는 합법 게시 가능한 게시대의 정보에 업데이트한다.(S220) 이로부터 불법광고물 게시자들에게는 유용한 정보로 제공되어 법을 지키면서 근거 있고 폭넓게 광고 계획을 수 립 및 집행할 수 있어 광고 효과를 높이게 되고, 합법광고물 게시대 운영자에게는 불법광고물 게시 장소들 대부 분이 눈에 잘 띄어 광고 효과가 높은 곳이 많으므로 이를 기초로 주변 환경과 조화를 이루면서 안전을 확보할 수 있는 장소에 게시대 설치를 추가로 확보하는 것에 의해 높은 광고 효과를 기대할 수 있어 질과 양 측면에서 광고 수요를 충족할 수 있으므로 법을 지키고 광고 수익을 늘리면서 광고물에 대한 관리를 보다 쉽게 할 수 있 다. 도 9는 이 발명의 실시 예에 따른 불법광고물을 관리하는 방법이 지자체에서 불법광고물에 대한 과태료부과 절 차 중에서 수행되는 곳을 나타내는 도면이다. 이 발명의 실시 예에 따른 불법광고물 관리방법은, 도 9에 나타낸 바와 같이, 법 위반과 대상자 선정 사이에서 불법 내용 통지와 게시가능 장소 안내를 하면서 수행될 수 있으며, 이로부터 과태료부과 전에 게시 관련자 책임 으로 사전 제거 및 합법적인 게시로 이어지게 유도할 수 있어, 지자체에서는 과태료부과 자체가 줄어 행정처분 에 따른 인력 투입 등 행정력을 집중하여 불법광고물에 대해 예외 없는 과태료부과라는 철저한 법 집행으로 법 을 지키면서 적극적이고 공정한 과태료부과를 통해 업무 효율을 높이고 재정수입도 늘리게 된다. 이 발명의 실시 예에서는 광고물로 현수막을 설명하고 있지만, 이는 광고물의 하나의 예로서 설명한 것으로 광 고하는 게시물이면 모두 해당될 수 있다. 이 발명은 상기의 실시 예에 한정되지 않으며, 청구범위에 기재되는 발명의 범위 내에서 다양한 변형이 가능하 고, 이러한 변형도 이 발명의 범위 내에 포함된다."}
{"patent_id": "10-2023-0081967", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 현수막 형태로 수목 등에 게시된 불법광고물의 예와 게시된 상태로 방치된 불법광고물의 예를 나타낸 도 면들이고, 도 2는 광고물이 현수막 거치대에 합법적으로 게시된 예를 나타낸 도면들이고, 도 3은 이 발명의 실시 예에 따른 불법광고물 관리방법을 구현하기 위한 시스템을 나타낸 블록도이고, 도 4는 도 3의 시스템에서 불법광고물 관리장치의 구성을 나타낸 블록도이고, 도 5는 옥외광고물법상 불법현수막의 행정처분별 대상자를 나타낸 도면이고, 도 6은 도 3의 시스템에서 합법광고물 게시대 운영장치의 구성을 나타낸 블록도이고, 도 7은 이 발명의 실시 예에 따른 불법광고물을 관리하는 방법 중 도 4의 장치에서 구현하는 과정을 나타내는 흐름도이고, 도 8은 이 발명의 실시 예에 따른 불법광고물을 관리하는 방법 중 도 6의 장치에서 구현하는 과정을 나타내는 흐름도이고, 도 9는 이 발명의 실시 예에 따른 불법광고물을 관리하는 방법이 지자체에서 불법광고물에 대한 과태료부과 절 차 중에서 수행되는 곳을 나타내는 도면이다."}
