{"patent_id": "10-2022-0152174", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0070812", "출원번호": "10-2022-0152174", "발명의 명칭": "지중열과 히트펌프를 이용한 열교환시스템", "출원인": "동명대학교산학협력단", "발명자": "김기주"}}
{"patent_id": "10-2022-0152174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지중열과 히트펌프를 이용한 열교환시스템에 있어서, 각 위치에 설치되는 지온호스와 상기 지온호스와 연결되며, 태양열 또는 복사열에 의해 데워진 상기 지온호스내의 물을 회수하는 회수파이프로 이루어진 비닐하우스:상기 지중열로 데워진 지하수를 순환하기 위한 제1 열교환기와 상기 제1 열교환기에 에어를 공급하는 컴프레서와 상기 컴프레서와 이격 형성되어 상기 컴프레서로부터 에어를 공급받는 제2 열교환기로 이루어지고, 일단은저장탱크의 순환관로와 연결되고, 타단은 배관과 연결되어 저온의 열원에서 열을 흡수하고 고온의 열원으로 열을 공급하는 히트펌프; 상기 제2 열교환기로터 열교환 유체를 공급받으며, 상기 열교환 유체를 상기 비닐 하우스에 제공하는저장탱크;상기 저장탱크에 저장된 열교환 유체를 상기 제2 열교환기에 다시 공급되도록 하는 제어부;상기 저장탱크와 연결되며, 공기를 흡입하여 교반시켜 열 전달이 일어나도록 하고, 내부로 공급되는 공기 온도를 조절할수 있도록 하기 위하여 형성되는 팬코일을 포함하는 것을 특징으로 하는 지중열과 히트펌프를 이용한열교환시스템."}
{"patent_id": "10-2022-0152174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 히트펌프는 상기 팬코일을 이용하여 상기 비닐하우스 내부로 공급되는 공기의 온도를 조절할수 있는 것을특징으로 하는 지중열과 히트펌프를 이용한 열교환시스템."}
{"patent_id": "10-2022-0152174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 제어부는 상기 팬코일에 형성되어 있는 송풍기의 회전속도를 제어하는 것을 특징으로 하는 지중열과 히트펌프를 이용한 열교환시스템."}
{"patent_id": "10-2022-0152174", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 저장탱크에는 상기 지하수를 배출시키는 배출부가 형성되며, 상기 배출부의 양측으로는 상기 저장탱크의열교환 유체가 배출되는 제1 히트파이프와 제2 히트파이프가 일정거리 이격되어 각각 형성되어 있는 것을 특징으로 하는 지중열과 히트펌프를 이용한 열교환시스템."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 지중열과 히트펌프를 이용한 열교환시스템에 관한 것이다. 본 발명은, 상기 지중열로 데워진 지하수를 순환하기 위한 제1 열교환기와 상기 제1 열교환기에 에어를 공급하는 컴프레서와 상기 컴프레서와 이격 형성되어 상기 컴프레서로부터 에어를 공급받는 제2 열교환기와 상기 제2 열교환기로터 열교환 유체를 공급받으며, 상기 (뒷면에 계속)"}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지중열과 히트펌프를 이용한 열교환시스템에 관한 것으로, 더욱 자세하게는 지하수를 획득한 후, 상 기 히트펌프 열교환시스템을 이용하여 상기 지하수를 비닐하우스의 농작물 재배 또는 스마트 팜을 위한 용수로서 사용할수 있는 지중열과 히트펌프를 이용한 열교환 시스템에 관한 것이다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 친환경 에너지 중 지열을 이용한 냉난방 시스템(지중 열 교환 시스템)은 기후조건이나 계절의 변화 에 관계없이 냉ㆍ난방용으로 일정하게 이용할 수 있는 땅속 열원을 이용하는 것으로서, 열원을 가진 일정 깊이 이상의 땅속 지하수와 에너지 효율이 높은 히트펌프 사이의 열 교환을 통한 건물의 냉난방 에너지로 사용하는 시스템이다. 그리고, 지열(地熱)이란 지하수를 굴착하여 양수되는 지하수가 갖고 있는 고유 열과 지중의 열을 통칭하는 것으 로서, 일반적으로 지표 하부를 100m 이상 500m 내외의 깊은 깊이로 굴착한 후, 이곳에 열교환을 위한 히트 파이 프 등을 묻거나 일반 지하수를 사용하여 지하수 심정시설과 동일하게 지하수 심정펌프와 양수 파이프를 설치하 여 지하수를 양수한 후 지하수가 갖고 있는 열을 히트펌프를 사용하여 열을 이용한 후 열교환된 지하수를 환수 관을 이용하여, 다시금 지하수 심정 내부에 환수시키는 열교환 시스템을 이용하여 사용하고 있다. 지중 온도는 사계절 변함없이 15℃ 내지 17℃의 온도를 연중 유지하여 이 온도를 갖고 있는 지하수를 양수하여, 히트펌프를 사용하여 열을 이용하게 되는 경우 지하수 심정 펌프의 양수량이 시간당 1000리터에 이르고 온도차 가 4℃인 경우 시간당 4,000kcal에 이르는 열량 확보가 가능하고 이렇게 열교환되어 상승되거나 혹 낮아진 지하 수의 온도는 환수관을 통해 지하수 지열공 내부로 유입되어 지중의 열에 의해 다시금 열교환되어 지하수의 온도 는 낮아지거나 또는 다시금 높아진 상태를 유지하게 되면서 이러한 사이클이 지속적으로 사용가능한 상태를 유 지할 수 있게 된다. 이러한 원리를 이용한 시설이 지열을 이용한 냉난방시스템이다. 이러한 지열을 이용하여 비닐하우스 등의 냉난방을 목적으로 지하수와 같은 천연 열저장소를 이용하는 전기장치 인 지열 히트펌프 시스템은, 지중 열교환기를 구비하여 상기 열교환기에 의해 하절기에는 지중으로 열을 방출하 고 동절기에는 지중으로부터 열을 흡수하는 것으로, 연중 10 ~ 20℃로 거의 일정한 온도를 유지한 지온에 의해 냉난방성능이 저하되지 않아 안정적인 운전이 가능하다. 따라서, 설치 및 유지관리에 상대적으로 저렴한 비용이 소요되는 지열에너지를 이용한 냉·난방장치들이 많이 이용되고 있는데, 이것은 온도가 10~20℃인 지중의 열 에너지를 이용하는 기술이다. 통상적으로 사용되는 지열을 이용한 히트펌프 시스템은 지열을 회수하기 위한 지열 교환기와, 회수한 지열을 필 요한 장소로 이동시켜 냉난방을 실행하도록 하는 히트 파이프로 구성된다. 상기 히트 파이프는 열 전달수단으로서 이미 전기, 전자 등의 산업분야 및 농업분야 등에서 널리 사용되고 있는 것으로서, 진공상태의 금속관 내에 비점이 낮고 증발잠열이 큰 불활성가스 등의 작동 유체를 주입하여 제작되는 것으로, 저압의 조건에서 작동유체가 쉽게 액체에서 증기로 상변화한다는 특징을 이용하여 상변화 시의 잠열로 써 열을 전달하는 장치로 알려져 있다. 즉, 히트파이프는, 외부 열원에 의해 내부 작동 유체의 증발과 응축 과 정을 반복하는 과정으로 열을 전달한다. 이러한 지열 냉난방 시스템은 스마트팜과도 연계할 수 있도록 응용하여 에너지 절약을 위한 더욱 진일보된 히트 펌프 또는 히트파이프 시스템이 제조될 수 있도록 하기 위한 기술 개발이 필요한 실정이다. 그리고, 히트펌프는 냉매가 압축기, 응축기, 팽창밸브 그리고 증발기를 순환하도록 구성하여 부하측에 난방 또 는 냉방을 제공한다. 상기 히트펌프의 압축기에서 토출된 냉매는 응축기에서 물이나 공기 등의 2차 작동유체로 열을 방출하고, 팽창 밸브에서 저온저압 상태로 변환되며, 증발기에서 2차 작동유체로부터 열을 흡수한 후, 압축기로 흡입된다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "그러나, 최근의 전 세계적인 지구 온난화 상황으로 인하여 지구상에 물이 부족한 현상이 심화되고 있으며 우리 나라도 물부족 국가로 분류되어 미래를 위하여서도 더욱 수자원 개발을 비롯한 기술개발의 중요성이 매우 크게 수면으로 부상되고 있는 실정이다. 냉난방장치의 부품으로 주로 이용되는 히트 펌프를 토애 이러한 수자원 개발기술에 응용할수 있는 연구도 다각 적으로 이루어지고 있다. 따라서, 지열 냉난방 시스템과 연계하는 히트펌프를 이용하여 물을 생성 및 순환괴 공급을 할수 있는 기술 개발 이 절실한 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허공개 제10-2022-0020797호 (특허문헌 0002) 대한민국 특허등록 제10- 2093411호 (특허문헌 0003) 대한민국 특허공개 제10-2017-0102604호"}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 지중열과 히트펌프를 이용한 시스템을 구성하여 지하수를 이용한 물을 생성시켜 사용할 수 있으므로, 에너지 절약에 매우 일조할수 있는 히트펌프를 이용한 열교환 시스템을 제공하자 하는데 있는 것이다. 따라서, 본 발명은 계속적인 순환방식을 채택하여 별도의 물공급 시설이 없이도 작동이 역시 가능하며, 지하수 등의 고갈 문제 등도 해결할 수 있는 지중열과 히트펌프를 이용한 열교환시스템을 제공하자 하는데 있는 것이다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위하여 본 발명은 지중열과 히트펌프를 이용한 열교환시스템에 있어서, 각 위치에 설치 되는 지온호스와 상기 지온호스와 연결되며, 태양열 또는 복사열에 의해 데워진 상기 지온호스 내의 물을 회수 하는 회수파이프로 이루어진 비닐하우스와 상기 지중열로 데워진 지하수를 순환하기 위한 제1 열교환기와 상기 제1 열교환기에 에어를 공급하는 컴프레서와 상기 컴프레서와 이격 형성되어 상기 컴프레서로부터 에어를 공급 받는 제2 열교환기로 이루어지고, 일단은 저장탱크의 순환관로와 연결되고, 타단은 배관과 연결되어 저온의 열 원에서 열을 흡수하고 고온의 열원으로 열을 공급하는 히트펌프와 상기 제2 열교환기로터 열교환 유체를 공급 받으며, 상기 열교환 유체를 상기 비닐 하우스에 제공하는 저장탱크와 상기 저장탱크에 저장된 열교환 유체를 상기 제2 열교환기에 다시 공급되도록 하는 제어부와 상기 저장탱크와 연결되며, 공기를 흡입하여 교반시켜 열 전달이 일어나도록 하고, 내부로 공급되는 공기 온도를 조절할수 있도록 하기 위하여 형성되는 팬코일을 포함하 는 것을 특징으로 하는 것이다. 또한, 상기 히트펌프는 상기 팬코일을 이용하여 비닐하우스 내부로 공급되는 공기의 온도를 조절하는 것을 특징 으로 하는 것이다. 또한, 상기 제어부는 상기 팬코일에 형성된 송풍기의 회전속도를 제어하는 것을 특징으로 하는 것이다. 또한, 상기 저장탱크에는 상기 지하수를 배출하는 배출부가 형성되며, 상기 배출부의 양측으로는 상기 저장탱크 의 열교환 유체가 배출되는 제1 히트파이프와 제2 히트파이프가 일정거리 이격되어 각각 형성되어 있는 것을 특 징으로 하는 것이다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "따라서, 본 발명은 지중열 등을 이용하여 지하수를 채취, 저장하여 외부로부터의 지속적인 물공급이 없이도 영 구적으로 순환시킬수 있는 방식을 채택하여, 수자원 등과 같은 에너지를 절약할 수 있는 지중열과 히트펌프를 이용한 열교환시스템을 제공할수 있는 효과가 있다. 또한, 지하수를 저장하여 계속 순환시키므로, 물 자원의 고갈이 생기지 않도록 하여, 시설비 절감에도 일조할 수 있어 경제성을 향상시킬수 있는 효과도 있는 것이다. 또한, 본 발명의 냉난방 시스템에서 냉방시 Heat Sink로 사용하는 과정에서 설치된 용량이 남는 경우가 많이 발 생하는 데, 이러한 여분을 이용하여 태양전지의 냉각에 활용함으로써 결정계 태양전지의 표면온도를 지열로 낮 추게 되어 표면온도가 하락할 때마다 발전효율이 올라가는 효과를 얻을 수 있다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 양호한 실시예를 첨부된 도면을 참조하여 상세히 설명하기로 한다. 본 발명을 설명하기에 앞서, 우선 각 도면의 구성요소들에 참조부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도 면상에 표시가 되더라도 가능한 한 동일 부호를 가지도록 하고 있음에 유의하여야 한다. 또한, 하기에서 본 발명을 설명함에 있어 관련된 공지기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴수 있다고 판단되는 경우에는 그 상세한 설명을 생략한다. 또한, 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위하여 사용된 것에 불과하므로, 본 발명을 한정하려는 의도가 아니며 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현도 의미하는 것임 을 미리 밝혀두고자 한다. 도 1은 본 발명에 의한 지중열과 히트펌프를 이용한 열교환시스템의 개략적인 구성도이고, 도 2는 히트펌프의 전체적인 구성도이고, 도 3은 비닐하우스의 개략도이고, 도 4는 본 발명에 의한 지중열과 히트펌프를 이용한 열 교환시스템의 구성도이고, 도 5는 본 발명에 따른 지중열과 히트펌프를 이용한 열교환시스템이 하계 모드 상태 에 있을 때의 유체 순환 상태를 보여주는 개략적인 구성도이고, 도 6은 본 발명에 따른 지중열과 히트펌프를 이 용한 열교환시스템이 동계 모드 상태에 있을 때의 유체 순환 상태를 보여주는 개략적인 구성도이고, 도 7은 본 발명에 따른 지중열과 히트펌프를 이용한 열교환시스템이 \"동계-복원 모드\" 상태에 있을 때의 유체 순환 상태를 보여주는 개략적인 구성도이고, 도 8은 AI(인공지능)를 이용한 지능형 열교환시스템의 블록도이다. 본 발명을 설명하기에 앞서, 명세서에 등장하는 용어인 열교환 유체는 냉매 또는 액체 성분인 지하수를 의미한 다는 점을 미리 밝혀두고자 한다. 그리고, 열교환 시스템에서는 히트펌프와 냉동기를 포함할수 있지만, 본 발명 의 실시예에서는 히트펌프와 저장탱크 등 중심으로 하여 설명한다. 도 1은 지중열과 히트펌프를 이용한 열교환시스템의 개략적인 구성도인데, 도시된 바와 같이, 비닐하우스 와 히트 펌프 및 저장탱크로 크게 이루어진다. 도시된 바와 같이, 본 발명의 지중열과 히트펌프를 이용한 열교환 시스템은 비닐하우스를 통한 용수의 공 급과 땅속의 지중열을 통해 지하수가 데워진 지열수를 통하여 물로 하여금 열교환을 통하여 계속 순환시키는 것 이다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하에서는, 본 발명의 실시예에서 주요한 기능을 하는 히트펌프를 도 2를 참조하여 그 구성과 작동 원리에 대한 설명하기로 한다. 도 2에 도시된 바와 같이 히트펌프의 전체적인 구성은 열원측 열교환기에 해당하는 제1 열교환기, 부하 측 열교환기에 해당하는 제2 열교환기, 컴프레서, 팽창밸브 및 사방밸브를 포함하는 구성으로 이루어는 것이다. 즉, 히트펌프는 지중열로 데워진 지하수를 순환하기 위한 제1 열교환기와 상기 제1 열교환기에 에 어를 공급하는 컴프레서와 상기 컴프레서와 이격 형성되어, 상기 컴프레서로부터 에어를 공급받는 제2 열교환기로 이루어지고, 상기 히트펌프의 일단은 저장탱크의 순환관로(미도시)와 연결되고, 타단은 배관(미도시)과 연결되어 저온의 열원에서 열을 흡수하고 고온의 열원으로 열을 공급한다. 만일, 히트펌프가 난방 운전 모드이면, 제2 열교환기는 응축기로 동작하고, 제1 열교환기는 증발기 로 동작한다. 냉방 운전 모드이면, 제2 열교환기는 증발기로 동작하고, 제1 열교환기는 응축기로 동작 한다. 사방밸브는 난방/냉방 운전 모드에 따라, 컴프레서에서 배출되는 냉매를 제2 열교환기 또는 제1 열 교환기로 방향 전환한다. 즉, 사방밸브는 난방 운전 모드이면 컴프레서에서 배출되는 고온 고압의 냉매를 응축기인 제2 열교환기 로 유출하고, 냉방 운전 모드이면 컴프레서에서 배출되는 고온 고압의 냉매를 응축기인 제1 열교환기 로 유출한다. 난방 운전 모드인 경우, 냉매의 흐름은 다음과 같다. 냉매는 컴프레서에서 고온 고압의 기체 상태로 토출되어, 응축기로 동작하는 제2 열교환기로 유입된다. 상기 냉매는 제2 열교환기에서 물이나 공기 등의 부하측 작동 유체로 열을 방출하여 고온 고압의 액냉매로 변환된다. 액냉매는 팽창밸브를 통과하면서 저온저압의 액체와 기체 상태의 냉매로 변환되어 증발기로 동작 하는 제1 열교환기로 유입된다. 냉매는 상기 제1 열교환기를 지나는 동안 물이나 공기 등의 열원측 작동유체로부터 열을 흡수하여 포화 기 체 상태가 된다. 이후, 제1 열교환기에서 토출된 포화 기체 상태의 냉매는 컴프레서로 흡입된다. 이러한, 냉매 흐름을 통해 제2 열교환기에서 출수되는 부하측 작동유체는 냉매로부터 열을 흡수하고, 제1 열교환기에서 출수되는 열원측 작동유체는 냉매로 열을 방출한다. 냉방 운전 모드인 경우, 냉매는 사방밸브에 의해 응축기로 동작하는 제1 열교환기로 토출되고, 난방운 전 모드와 반대로 흘러 컴프레서에 흡입되는 구조인 것이다. 도 1을 보면, 비닐하우스가 상기에서 설명한 히트 펌프의 제1 열교환기와 연결되어 있는데, 상기 비닐하우스에 대한 설명을 도면을 참조하여 자세히 설명하기로 한다. 도 3에 도시된 비닐하우스의 형태는 일반적인 형태의 비닐하우스지만, 본 명세서에 그려진 도면의 형상으 로 본 발명의 권리범위가 제한되지 않는다는 점을 미리 밝혀두고자 한다. 상기 비닐하우스는 하우스 외피(130a)와 하우스 내피(130b)를 포함하는 반원기둥 형태의 구조를 이루는 구 조물이다. 상기 하우스 외피(130a)와 상기 하우스 내피(130b)는 주로 비닐로 적용되나 다른 재질로 대체될 수 있다.하우스 외피(130a)와 하우스 내피(130b)가 지지될수 있도록, 비닐하우스에는 군데군데 곳곳에 하우스 골조 파이프(130c)가 마련된다. 상기 하우스 골조 파이프(130c)는 내부가 빈 중공형의 파이프로 적용된다. 지온호스는 내부에 물이 유동되는 호스로서, 비닐하우스의 각 위치에 설치될 수 있다. 상기 지온호스 는 태양열 등에 의하여 데워질수 있는 것이다. 예컨대, 지온호스는 상기 비닐하우스의 내벽면, 상부 천장, 하부 바닥 전체에 배치될 수 있는데, 지 온호스가 많이 배치될수록 용수를 좀 더 많이 생산할 수 있어 유리할 수 있다. 특히, 비닐하우스의 골조를 이루는 하우스 골조 파이프(130c) 내에도 지온호스가 더 배치된다. 이와 같이, 비닐하우스 내에도 지온호스가 배치됨에 따라 자연적인 난방수를 생산할 수 있어 냉난방 시스 템을 구축하는데 도움이 될 수 있다. 회수파이프는 비닐하우스의 각 위치에 마련되는 지온호스와 연결되며, 태양열 또는 복사열 등에 의해 데워진 지온호스 내의 물을 회수하는 역할을 한다. 비닐하우스의 내벽면, 상부 천장에 배치된 지온호스로부터는 태양열에 의해 데워진 물이 회수파이프 로 회수될 것이고, 비닐하우스의 하부 바닥에 배치된 지온호스로부터는 복사열 또는 지열에 의 해 데워진 물이 회수파이프로 회수될 수 있다. 용수공급 파이프는 히트펌프의 제1 열교환기와도 연결되고 비닐하우스의 각 위치에 배치되며 경우에 따라, 상기 제 1열교환기를 통해서 열교환이 이루어진 용수를 비닐하우스의 각 위치로 공급하 는 역할을 한다. 이처럼 제1 열교환기는 내부 열교환이 이루어진 온, 냉수가 용수공급 파이프를 통해 비닐하우스 의 각 위치로 공급됨에 따라, 상기 비닐하우스를 난방이나 온방을 시킬 수 있음은 물론이고, 필요 시에는 온수 또는 냉수를 사용할 수 있는 이점이 있다. 그리고, 상기 제1 열교환기는 상기 비닐하우스의 용수공급 파이프를 통하여 흘러내린 용수와 함 께 땅속 열인 지중열(地中熱)로 데워진 지열수를 순환시키기 위한 기능과 역할도 하는 것이다. 즉, 상기 지열수는 땅속의 열로 인하여 온도가 상승한 액체를 의미하는 것으로, 지하의 열에너지로 인하여 데워 진 물인 것이다. 그리고, 상기 제1 열교환기는 열교환 유체와 지중 사이의 열교환이 이루어질수 잇도록 하는 역할을 하는 것 이다. 특히, 상기 제1 열교환기는 지중에 매립되어, 열교환 유체와 지중 사이의 열교환이 이루어지는 것이다. 그리고, 도면에는 제1 열교환기 이외에도 제2 열교환기가 형성되어 있는 데, 상기 열교환기(71, 72)들 은 다수개로 구성되어도 역시 무방하다는 점을 유의하여야 한다. 제1 열교환기와 제2 열교환기 사이에 에어를 공급하는 컴프레서(73: compressor)가 형성된다. 상기 컴 프레서는 에어 컴프레서로서, 에어를 압축하여 분사하는 것으로, 출력단에는 에어관(미도시)을 통해 상기 저장탱크와 연결되어 있고, 상기 저장탱크의 배출구에 연결되고 동작에 의해 내부에 저장된 에어를 전 달하는 배출호스(미도시)가 형성된 공지의 것이다. 또한, 상기 컴프레서에서 압축된 에어가 전달되는 과정에서 정압 장치인 기계식 에어 레귤레이터(도시는 생 략)를 장착하여 사전 설정된 압력 이상으로 공기압이 공급되지 못하도록 할 수 있다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 3, "content": "도 1을 보면, 상기 컴프레서와 일정거리 이격, 형성되어 상기 컴프레서로부터 에어를 공급받는 제2 열 교환기가 형성된다. 상기 제2 열교환기도 역시 제1 열교환기와 마찬가지로 동일하게 열교환 유체와 지중 사이의 열교환이 이루어지는 동일한 역할과 기능을 하는 것이다. 저장탱크는 히트펌프의 제2 열교환기로부터 열교환 유체를 공급받고 상기 컴프레서에서 에어를 공급받아, 상기 열교환 유체를 외부에 제공하는 것이다. 또한, 외부에 이격되어 설치된 제어판넬 형태의 제어부(미도시)에서는 제1 열교환기를 통한 열교환 유체를 컴프레서를 통하여 제2 열교환기로 공급하고, 상기 제2 열교환기에 공급된 열교환 유체인 지하수를 저장탱크에 저장시키는 것이다. 그러면, 상기 저장탱크를 통하여 내부에 저장된 열교환 유체인 지하수가 비닐하우스는 물론이고, 상 기 저장탱크와 연결된 또 다른 비닐하우스(미도시)에 전달되어 용수로 사용되는 것이다. 또한, 상기 저장탱크는 지중의 지하수를 공급받아 저장하고, 배출부를 통하여 배출된 지하수는 여름과 겨울에 따라 지하수의 온도가 달라질 수 있는데, 이에 관한 설명을 이하에서 하기로 한다. 도 4를 참조하여 팬코일에 대한 설명을 하기로 한다. 팬코일은 가열 또는 냉각 코일과 팬으로 구성되는 냉각 시스템으로서, 열교환이 원활하게 이루어지도록, 동 파이프 또는 알류미늄 재질의 파이프를 사용하는 것이 바람직할 것이다. 상기 팬코일은 앞서 서술한 저장탱크와 연결되어 있으며, 공기를 흡입하여 교반시켜 열 전달이 일어나 도록 하고, 비닐하우스의 내부로 공급되는 공기 온도를 조절할 수 있도록 하기 위하여 형성되는 것이다. 즉, 내부의 공기를 흡입한 후, 공기를 배출시키는 것으로서 내부 공기를 교반시켜 순환시켜 공기정화가 자동으 로 이루어지도록 하며, 팬코일에 구비되어 있는 송풍기(도시는 생략)를 통하여 겨울에는 온풍을 여름에는 냉풍을 불어주게 되므로 언제나 쾌적한 환경을 제공할수 있도록 하는 것이다. 그러므로, 온도를 항상 일정하게 유지시킬수 있는 것이다. 따라서, 공조(空調)시키려는 공간의 따뜻한 공기는 상기 팬코일로 흡수되어 냉수 등을 이용하여 냉각 및 제 습된 후, 상기 공조 공간으로 다시 공급되는 방식인 것이다. 그리고, 외부의 제어부에서는 상기 팬 코일에 형성된 송풍기의 회전속도를 제어할수 있는 기능이 있는데, 비닐하우스에 다수개의 온도센서(미도시)를 설치하여 상기 온도센서에서 전달되는 신호를 기계 학습하여 데이터베이스를 축적하여 상기 송풍기의 회전 속도를 얼마든지 제어할 수 있도록 하는 것이 바람직할 것이다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "히트펌프는 공기, 물 또는 토양으로부터 열을 포집하여 온도를 높여주는 장치로서, 저온의 공기로부터 열을 빼앗아 고온의 공기로 온도를 높여 공급시켜 주는 역할을 한다. 다시 도 4를 참조하면, 본 실시예에서의 히트펌프는 일단은 상기 저장탱크의 순환관로(미도시)와 연결 되고, 타단은 배관과 연결되어 저온의 열원에서 열을 흡수하여, 고온의 열원으로 열을 공급시켜 주는 기능 과 역할을 하는 것이다. 또한, 상기 히트펌프는 배관과 연결된 팬코일을 이용하여 제1 비닐하우스의 내부로 공급되는 공기의 온도도 조절할 수 있는 것인데 예를 들어, 공기의 공급 온도가 40~ 50℃ 이면, 배출 온도는 30 ~ 40℃가 되도록 조절하는 것이다. 따라서, 동절기에는 지하수를 이용하여 지중(地中)의 열을 내리도록 하고, 저장탱크를 이용하여 지하수를 비닐하우스로 공급하도록 하기 위하여 상기 팬 코일을 통하여 압축하면, 고온의 공기가 상기 비닐하우 스 또는 제1 비닐하우스로 유입되어 내부의 난방을 할 수 있는 것이다. 이하에서는 상기 도 4를 비롯하여, 도 5 내지 도 7을 참조하여 위와 같은 본 발명에 따른 지중열과 히트파이프 를 이용한 열교환 시스템의 구성과, 계절에 따라 본 발명의 열교환시스템에 의해 물이 저장되고 비닐하우스 로 배출되는 방식에 대하여 설명하기로 한다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 5, "content": "도 4는 본 발명에 따른 지중열과 히트파이프를 이용한 열교환 시스템의 개략적인 구성도가 도시되어 있다. 도시 된 것처럼, 본 발명에 따른 지중열과 히트파이프를 이용한 열교환 시스템은, 앞서 설명하였던 지중에 설치되어있는 제1 열교환기 와 제2 열교환기를 포함한다. 또한, 본 발명에 따른 지중열 히트파이프 열교환 시스템은, 배출관을 통해 제1 열교환기 및 제2 열교환 기로부터 배출된 열교환 유체와 비닐하우스로의 온수 공급을 위하여 제1 히트파이프를 순환하는 냉난방 유체 간의 열교환이 이루어지는 히트펌프를 포함하는 구성이다. 그리고, 저장탱크에는 지하수를 배출하는 배출부가 형성되며, 상기 배출부의 양측으로는 상기 저장 탱크의 열교환 유체가 배출되는 제1 히트파이프와 제2 히트파이프가 일정거리 이격되어 각각 형 성된다. 도 4에 도시된 바와 같이, 저장탱크에 연결되어 있는 상기 제1 히트파이프와 상기 배출관은 히트 펌프와도 서로 연통되어 있다. 즉, 히트펌프에는 비닐하우스로 유입되는 지하수의 고온이나 저온 의 공급을 위하여 유체(유체는 액체 또는 기체)가 순환하는 제1 히트파이프가 연결되어 있는 것이다. 따라서, 상기 배출관을 통해서 저장탱크로부터 배출된 열교환 유체는 히트펌프를 거치게 되면서 상 기 제1 히트파이프를 흐르는 냉난방 유체와 열교환을 한 다음에, 제1 히트파이프를 통해서 다시 저장 탱크로 유입되어 저장탱크 내에 이미 존재하던 열교환 유체와 혼합된다. 혼합된 열교환 유체는 다시 배 출관을 통해서 배출되고, 위와 같은 과정을 통한 순환 과정이 반복된다. 도 5에는 도 4에 도시된 본 발명에 의한 지중열을 이용한 열교환 시스템이 \"하계 모드\" 상태에 있을 때를 보여 주는 개략도가 도시되어 있다. 상기 \"하계 모드\"에서는, 여름의 높은 온도의 공기는 제1 히트파이프를 통해 히트펌프를 순환시킨다. 배출관을 통해서 저장탱크로부터 배출된 열교환 유체, 지하수는 히트펌프를 거쳐서 순환하게 되는 데, 상기 히트펌프에서는 제1 열교환기로부터 공급되는 열교환 유체와 제2 열교환기로부터의 열교 환 유체 간에 열교환이 이루어진다. 따라서, 제1 히트파이프 내를 흐르는 열교환 유체가 가지고 있던 열은 배출관을 통하여 히트펌프 로 유입된 상대적으로 낮은 온도를 가지는 열교환 유체로 전달된다. 따라서, 열을 빼앗긴 열교환 유체는 제1 히 트파이프를 통해 냉각된 상태로 비닐하우스로 공급되어 저온의 용수로서 이용된다. 히트펌프를 거치면서 열을 공급받은 열교환 유체는 제1 히트파이프를 통해 저장탱크로 또 유입된 다. 이와 같이, 상기 저장탱크로 유입된 열교환 유체는 저장탱크 내에서 이미 존재하던 상대적으로 낮 은 온도의 열교환 유체와 다시 혼합되어 비닐하우스로 흘러가게 되므로 다시 온도가 낮아지고, 온도가 낮 아진 열교환 유체는 배출관을 통하여 다시 히트펌프로 유입되는 것이다. 이러한 순환 과정의 반복을 통해 하계 모드에서는 저온의 용수가 제2 비닐하우스로 흘러 들어가게 되는 것 이다. 도 6에는 도 4에 도시된 본 발명에 따른 시스템이 동계 모드 상태에 있을 때를 보여주는 개략도가 도시되어 있 다. 겨울철에 비닐하우스로 지중의 지하수를 공급하는 \"동계 모드\"에서는, 지중에서의 낮은 온도의 열교환 유 체를 저장탱크의 제1 히트파이프를 통해 히트펌프로 보내게 된다. 상기 히트펌프에서는, 지중열을 공급받아 상대적으로 높은 온도를 가지고 있으며 배출관을 통하여 상기 히트펌프로 유입된 열교환 유체로부터, 제1 히트파이프 내를 흐르는 냉난방 유체로 열이 이동된다. 그에 따라, 상기 제1 히트파이프를 흐르는 냉난방 유체는 열을 얻게 되어 온도가 상승된 상태로 추운 겨울 에 비닐하우스로 유입되어 용수로 이용된다. 한편, 히트펌프를 거치면서 열을 빼앗긴 열교환 유체는 제1 히트파이프를 통해 저장탱크로 유입된 다. 상기 저장탱크는 지중열을 공급받아 높은 온도를 유지하던 열교환 유체가 이미 존재하고 있으므로, 상기 제1 히트파이프를 통해 저장탱크로 유입된 열교환 유체는 이미 존재하던 상대적으로 높은 온도의 열교환 유체와 혼합되면서 다시 온도가 높아지고, 계속하여 배출관을 통해 다시 히트펌프로 유입된다. 따라 서, 겨울에는 비교적 높은 온도의 용수가 비닐하우스로 공급되는 것이다. 도 7에는 상기 도 4에 도시된 본 발명에 의한 지중열 히트파이프 열교환 시스템이 동계 사용 모드 상태에 있을 때를 보여주는 개략도가 도시되어 있다. 앞서 설명한 것처럼, 겨울철에는 지반에 존재하던 지중열이 지속적으로 제1 열교환기와 제2 열교환기를 통하여 열교환 유체로 변환하여 저장탱크내로 유입 혼합되어, 지하수가 되어 비닐하우스로 흘러가서 농업용수로 이용된다. 물론, 여름철에는 비닐하우스로부터 회수한 열이 히트펌프를 통하여 지반으로 유입되어 지중열이 어느 정도 보충되지만, 겨울철에는 지반으로부터 비닐하우스로 흘러가는 지중열이, 여름철에 지반으로 보충되는 지중열보다 월등하게 크므로, 지반으로부터 지중열은 일방적으로 빠져나가게 된다. 따라서, 이러한 지중열의 일방적인 흐름이 지속될 경우, 지반이 보유하고 있는 지중열로 인하여 지하수는 증발 되거나 또는 고갈될 수밖에 없고, 그에 따라 동절기에는 급수량이 부족하게 되어, 비닐하우스의 급수 효율 등이 저하되는 문제점이 발생하게 된다. 이러한 상태를 방지하기 위해서 본 발명에서는 \"동계- 복원 모드\"를 통해서 소실된 열교환 유체를 제2 열교환기 로부터 수집한 열교환 유체로 보충하는 작동이 이루어지게 된다. 구체적으로 \"동계- 복원 모드\"에서는 배출 관을 통해서 제1 열교환기로부터 시작되어 저장탱크로부터 배출되는 열교환 유체는 상기 제2 열교 환기로 순환하게 된다. 제2 열교환기는, 지중으로 인하여 온도가 상승된 열교환 유체가 제1 히트파이프가 아닌 제2 히트파이 프를 통해서 순환하고 있으므로, 저장탱크로부터 배출된 열교환 유체는 상기 제2 열교환기를 지나 면서 상기 제2 히트파이프를 통해 순환하는 유체로부터 열을 공급받아 온도가 상승된다. 이렇게 제2 열교환기를 거치면서 온도가 상승된 열교환 유체는 제2 히트 파이프를 통해 다시 저장탱크 로 유입되고, 상기 저장탱크 내에 이미 존재하던 열교환 유체와 혼합되면서, 제1 열교환기와 제2 열교환기를 통해 가지고 있던 열을 혼합한 지하수가 저장탱크에 저장되어 이를 거쳐 비닐 하우스 로 전달하게 된다. 상기와 같이 서술한 대로, 본 발명은 겨울철에 지하수가 지속적으로 일방적으로 비닐하우스로 흘러감으로 인하여 열교환 유체의 소실로 인한 증발로 말미암아 급수에 문제가 생기게 될 경우, 상기 서술한 과정을 통하 여 열교환 유체를 비닐 하우스에 전달하여 지하수를 보충함으로써, 증발이나 소실된 지하수를 복원할 수 있게 된다. 따라서, 지중열 소실에 따른 지중열 교환 효율의 저하를 방지할 수 있게 된다. 즉, 지중열 소실이 발생하여 히 트펌프 내의 제1, 제2 열교환기(71, 72)에 의한 열교환 효율이 저하되는 상황이 발발했을 때, 사용자는 상 기 \"동계 - 복원 모드\"를 진행함으로써, 저하된 열교환 효율을 다시 정상 상태로 되돌릴 수 있게 되는 효과가 발휘되는 것이다. 더 나아가, 히트펌프에서 열교환을 마친 열교환 유체가 제1 히트파이프를 통하여 저장탱크로 다시 돌아왔을 때, 열교환 유체는 저장탱크에 담겨 있던 유체와 고르게 혼합된다. 따라서, 지반과 열교환 유체 간의 열교환이 고르게 일어나게 되는 효과가 생성되는 것이다. 이하에서는, AI(인공지능)를 이용하여 지능형 열교환 시스템으로 응용할수 있는데, 이에 대한 설명을 도면을 참 조하여 하기로 한다. 도 8에 도시된 대로, 본 발명은 AI 제어장치에 의해서 본 발명의 히트펌프와 지중열을 이용한 열교횐 시스 템에서의 하계 및 동계 사용 모드의 제어가 사용자의 환경에 맞게 조절 가능하도록 할수 있다. 먼저, 히트펌프의 제1 열교환기과 제2 열교환기에는 각각 온도 센서(71-1)와 이산화탄소(CO2) 농도 센서(72-1)가 각각 형성되고, 상기 온도센서(71-1)와 상기 이산화탄소(CO2) 농도 센서(72-1)의 데이터를 저장 및 송출할 수 있도록, 메인 보드가 형성된다. 그리고, 상기 메인 보드는 통신장치와 연결되어 있어서 유, 무선으로 AI 제어장치와 통신할 수 있도록 형성된다. 참고로, 상기 통신장치는 IoT(Internet of Things) 통신장치 형태인 것이 바람직할 것이다. 따라서, AI 제어장치로 하여금 온도와 농도를 측정하고, 각각 조절도 역시 가능할수 있도록 상기 AI 제어 장치에 의해서 컨트롤될 수 있는 것이다. 따라서, 상기 AI 제어장치 역시 컨트롤이 가능하도록 형성되고, 네트워크 통신을 이용하여 상기 메인 보드 와 통신할 수 있도록 형성된다. 그러므로, 상기 AI 제어장치는 히트펌프의 내부에 온도 센서(71-1)와 이산화탄소 농도 센서(72-1)가 PID 제어부(도시는 생략)를 통하여 상기 센서를 PID 제어할 수 있도록 형성된다. 상기 AI 제어장치는 PID 제어를 위한 산출값을 인공지능 신경망으로 데이터를 딥러닝할수 있도록 형성된다. 상기 인공지능 신경망은 제어알고리즘을 사용하는 것인데, 상기 제어 알고리즘은 지도학습 알고리즘을 사용하고 훈련세트(학습데이터)를 이용하여 기본 알고리즘을 최적화한 상태로 운영되는 것이다. 참고로, 상기 학습 데이터라는 것은 측정한 온도데이터, 이산화탄소 농도 및 AI 제어장치의 내부에 있는 센서(도시는 생략)들의 데이터를 시간대별, 일자별로 분류한 데이터이다. 상기 알고리즘의 보상예측 신경망과 상기 학습데이터를 더욱 심화학습한 심층강화학습 신경망은 모두 다 기본 알고리즘이 최적화된 상태에서 수행되는 것이 적당하다. 상기 신경망에 대한 자세한 설명은 널리 공지된 기술이 므로 자세한 설명은 생략하기로 한다. 상기 보상예측 신경망은 최적온도 예측신경망으로 구성되고, 상기 최적온도예측신경망은 온도와 습도의 변화에 대한 보상값을 산출할 수 있도록 보상함수를 적용한다. 그리고, 상기 인공지능 신경망의 PID제어 신경망을 통해서 PID값이 AI 제어장치에게 전달되어 자동으로 컨 트롤이 가능한 것이다. 상기 PID제어 신경망에서는 액션값을 학습 데이터로 저장하고, 머신러닝 기법을 사용하 여 최적의 PID값을 산출하고, 상기 AI 제어장치에게 송출하는 PID산출을 하는 것이다. 상기 인공지능 신경망을 활용하여, 이를 사용자의 선호도와 취향에 맞추어 딥러닝을 통해서 적극 반영하여 형성 한다. 이와 같이, 본 발명에 의한 지중열과 히트펌프를 이용한 열교환시스템의 작동이 AI 제어장치의 인공신경 지능망을 사용하여 제어되기 때문에, 하계 및 동계에 알맞는 열교환 시스템의 관리 등이 자체적인 학습을 통해 지능형으로 맞춤 제공될 수 있는 것이다. 상기와 같이 서술한 대로, 본 발명에 의한 지중열과 히트펌프를 이용한 열교환시스템은 비닐하우스에서 생성되 는 용수와 지하수를 이용하여 물을 지속하여 발생시킬 수 있으므로, 에너지 절약에 일조할 수 있는 장점이 있는 것이다. 따라서, 본 발명은 지하수를 저장은 물론이고, 계속 순환시킬수 있으므로, 수자원의 고갈이 생기지 않도록 할수 있으며, 관련되는 시설비 절감에도 일조할 수 있어 경제성을 도모할 수 있는 장점도 있는 것이다. 또한, 인공지능을 이용한 맞춤형 열교환 시스템을 제공할 수 있는 장점도 있는 것이다."}
{"patent_id": "10-2022-0152174", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "이상에서와 같은 내용의 본 발명이 속하는 기술분야의 당업자는 본 발명의 기술적 사상이나 필수적 특징을 변경 하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 상기 기술한 실시 예는 예시된 것이며 한정적인 것이 아닌 것으로서 이해해야만 한다. 본 발명의 범위는 상기 상세한 설명보다는 첨부된 특허청구범위에 의하여 나타내어지며, 특허청구 범위의 의미 및 범위 그리고 그 등가 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0152174", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 의한 지중열과 히트펌프를 이용한 열교환시스템의 개략적인 구성도. 도 2는 히트펌프의 전체적인 구성도. 도 3은 비닐하우스의 개략도. 도 4는 본 발명에 의한 지중열과 히트펌프를 이용한 열교환시스템의 구성도. 도 5는 본 발명에 따른 지중열과 히트펌프를 이용한 열교환시스템이 하계 모드 상태에 있을 때의 유체 순환 상 태를 보여주는 개략적인 구성도. 도 6은 본 발명에 따른 지중열과 히트펌프를 이용한 열교환시스템이 동계 모드 상태에 있을 때의 유체 순환 상 태를 보여주는 개략적인 구성도. 도 7은 본 발명에 따른 지중열과 히트펌프를 이용한 열교환시스템이 \"동계-복원 모드\" 상태에 있을 때의 유체 순환 상태를 보여주는 개략적인 구성도. 도 8은 AI를 이용한 지능형 열교환시스템의 블록도."}
