{"patent_id": "10-2021-0031714", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0127437", "출원번호": "10-2021-0031714", "발명의 명칭": "뉴로피드백 서비스장치 및 그 장치의 구동방법", "출원인": "최경호", "발명자": "최경호"}}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "뉴로피드백(Neurofeedback)의 뇌 훈련을 수행하는 사용자의 사용자 단말장치와 통신하는 통신 인터페이스부; 및상기 뇌 훈련을 위해 제공하는 간식과 음료(Food&Beverage), 음악(Music) 및 활동(Activity)의 각 요소가 융합되어 있는 뇌훈련 데이터를 이용한 훈련 결과를 상기 사용자 단말장치로부터 수신하며, 상기 수신한 훈련 결과를 분석하여 상기 사용자의 집중력을 평가하는 제어부;를포함하는 뉴로피드백 서비스장치."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 훈련 결과를 분석하여 상기 간식과 음료, 음악 및 활동의 각 요소가 상기 사용자의 집중력향상에 적합한지 더 평가하는 뉴로피드백 서비스장치."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어부는, 상기 훈련 결과로서 상기 사용자에 의해 쓰여진 글자나 색칠된 도안의 촬영 이미지를 분석하는뉴로피드백 서비스장치."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는, 다수의 사용자별로 반복되는 뇌 훈련의 분석 결과를 근거로 개인마다 맞춤화된 뇌훈련 데이터를생성해 제공하는 뉴로피드백 서비스장치."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제5항에 있어서,상기 제어부는, 상기 개인마다 맞춤화된 뇌훈련 데이터로서 조기 치매 진단, ADHD(Adult attention-deficitHyperactivity Disorder) 또는 공부 진단을 위한 뇌훈련 데이터를 생성해 제공하는 뉴로피드백 서비스장치."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제어부는 상기 훈련 결과를 분석하여 감각운동 리듬(SMR)을 더 평가하며, 상기 평가한 SMR에 근거해 이상발견시 상기 사용자 단말장치로 상기 이상에 대한 정밀 측정을 제안하는 뉴로피드백 서비스장치."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "통신 인터페이스부가, 뉴로피드백의 뇌 훈련을 수행하는 사용자의 사용자 단말장치와 통신하는 단계; 및제어부가, 상기 뇌 훈련을 위해 제공하는 간식과 음료(F&B), 음악(M) 및 활동(A)의 각 요소가 융합되어 있는 뇌훈련 데이터를 이용한 훈련 결과를 상기 사용자 단말장치로부터 수신하며, 상기 수신한 훈련 결과를 분석하여상기 사용자의 집중력을 평가하는 단계;를포함하는 뉴로피드백 서비스장치의 구동방법."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2022-0127437-3-제7항에 있어서,상기 평가하는 단계는,상기 훈련 결과를 분석하여 상기 간식과 음료, 음악 및 활동의 각 요소가 상기 사용자의 집중력 향상에 적합한지 더 평가하는 뉴로피드백 서비스장치의 구동방법."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 평가하는 단계는,상기 훈련 결과로서 상기 사용자에 의해 쓰여진 글자나 색칠된 도안의 촬영 이미지를 분석하는 뉴로피드백 서비스장치의 구동방법."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 평가하는 단계는, 다수의 사용자별로 반복되는 뇌 훈련의 분석 결과를 근거로 개인마다 맞춤화된 뇌훈련 데이터를 생성해 제공하는 단계를 포함하는 뉴로피드백 서비스장치의 구동방법."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 제공하는 단계는,상기 개인마다 맞춤화된 뇌훈련 데이터로서 조기 치매 진단, ADHD 또는 공부 진단을 위한 뇌훈련 데이터를 생성해 제공하는 뉴로피드백 서비스장치의 구동방법."}
{"patent_id": "10-2021-0031714", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 평가하는 단계는,상기 훈련 결과를 분석하여 감각운동 리듬(SMR)을 더 평가하며, 상기 평가한 SMR에 근거해 이상 발견시 상기 사용자 단말장치로 상기 이상에 대한 정밀 측정을 제안하는 단계를 포함하는 뉴로피드백 서비스장치의 구동방법."}
{"patent_id": "10-2021-0031714", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 뉴로피드백 서비스장치 및 그 장치의 구동방법에 관한 것으로서, 본 발명의 실시예에 따른 뉴로피드백 서비스장치는, 뉴로피드백의 뇌 훈련을 수행하는 사용자의 사용자 단말장치와 통신하는 통신 인터페이스부, 및 뇌 훈련을 위해 제공하는 간식과 음료(F&B), 음악(M) 및 활동(A)의 각 요소가 융합되어 있는 뇌훈련 데이터를 이 용한 훈련 결과를 사용자 단말장치로부터 수신하며, 수신한 훈련 결과를 분석하여 사용자의 집중력을 평가하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2021-0031714", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 뉴로피드백 서비스장치 및 그 장치의 구동방법에 관한 것으로서, 더 상세하게는 가령 고도로 수련된 보조 전문가의 도움 없이도 집중력 또는 감각운동 리듬(SMR) 향상 훈련이 스스로 가능하여 누구나 쉽게 뉴로피 드백이 가능한 뉴로피드백 서비스장치 및 그 장치의 구동방법에 관한 것이다."}
{"patent_id": "10-2021-0031714", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 인간 행동을 뇌기능과 관련하여 인간 삶의 질을 향상시키고자 하는 뇌와 관련된 연구가 활발히 진행되 고 있다. 뇌 연구는 치매 등 난치성 질환 극복은 물론이고 폭력이나 우울증 치료 등 폭넓은 분야에서 연구가 진 행되고 있다. 뉴로피드백 훈련은 고도의 집중력 및 신경반사 반응이 요구되는 종목의 선수들에게 긍정적인 효과 를 발휘하는 것으로 알려지고 있다. 뉴로피드백을 통한 다양한 효과 등은 널리 알려져 있고, 기술 또한 상당한 수준에 도달하여 있으나, 통상의 집 중력 향상 뉴로 피드백시스템은 기능적 자기공명영상(fMRI)나 뇌파(EEG) 장비를 사용하고 있으나, 이들 시스템 은 전문가의 보조가 필요한 복잡한 시스템이거나, 개인이 장비를 구입하여 훈련은 할 수 있으나, 프로그램이 매 우 단순하고, 반복적인 행위를 해야 일정 수준에 도달하는 시스템으로 되어 있다. 예를 들어 집중력을 높여야 공이 떠오르는 게임 등인데, 이는 EEG 장비를 착용하고, 반복적인 게임을 시행해야 집중력이 향상되는 시스템으로 되어 있다. EEG장비를 제대로 착용하지 않으면 훈련 자체가 불가하며(예: 소아는 스스로 착용 불가, 착용 싫어함) 또한 수회 반복하면 지겨워서 하기가 싫어진다. 소아의 경우는 EEG 장비 착용 자체를 한두번은 할 수 있으나, 반복해서 착용하는 것을 매우 싫어하며, 이러한 이유로 소아용 뉴로피드백 훈련 시스템이 아예 없는 게 현실이다. 현재의 SMR 훈련을 포함한 뉴로피드백 훈련의 과정을 살펴보면, 아동의 머리에 전극을 부착하고 뇌파를 측정하 며, 측정하는 동안 컴퓨터 모니터의 화면을 보게 되는데, 원하는 뇌파가 미리 정해놓은 수준 이상으로 나오면 화면에서 애니메이션(예: 게임, 보트 경주, 비행기 비행, 볼링)이 움직이고 음악이 나오는 것이 있다. 이것은 일종의 정신적 보상에 해당한다. 또다른 액티브 뉴로피드백의 경우 음악 등 다양한 두뇌 자극 신호를 사용하여 어떤 자극이 유효한지에 대한 기 준점이 없기에 음악, 그 중에서도 주파수 변이 뇌파 등등 변수가 많아 실현 가능성이 현저히 떨어진다. 그렇지 않으면 신호를 단순화시킨 따분하고 지겨운 훈련만 반복하도록 되어 있다. 이 또한 항상 EEG 장비를 사용해야만 훈련이 가능하다. 이러한 종래 시스템은 소아, 노인 등은 전혀 사용 불가하며, 대부분은 전문가 없이는 시행 불가한 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-1465613호(2014.11.20) (특허문헌 0002) 한국등록특허공보 제10-0792046호(2007.12.28) (특허문헌 0003) 한국등록특허공보 제10-1731471호(2017.04.24) (특허문헌 0004) 한국등록특허공보 제10-2038997호(2019.10.25) (특허문헌 0005) 한국공개특허공보 제10-2016-0108091호(2016.09.19) (특허문헌 0006) 한국공개특허공보 제10-2015-0122877호(2015.11.03) (특허문헌 0007) 한국공개특허공보 제10-2020-0128900호(2020.11.17) (특허문헌 0008) 한국공개특허공보 제10-2020-0128906호(2020.11.17) (특허문헌 0009) PCT국제공개특허공보 제2016-005870호(2016.01.14) (특허문헌 0010) 미국공개특허공보 제2016/0220783호(2016.08.04) (특허문헌 0011) 미국공개특허공보 제2015/0066104호(2015.03.05) (특허문헌 0012) 미국공개특허공보 제2011/0015469호(2011.01.20)"}
{"patent_id": "10-2021-0031714", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 가령 고도로 수련된 보조 전문가의 도움 없이도 집중력 또는 SMR 향상 훈련이 스스로 가능 하여 누구나 쉽게 뉴로피드백이 가능한 뉴로피드백 서비스장치 및 그 장치의 구동방법을 제공함에 그 목적이 있 다."}
{"patent_id": "10-2021-0031714", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 뉴로피드백 서비스장치는, 뉴로피드백(Neurofeedback)의 뇌 훈련을 수행하는 사용자의 사용자 단말장치와 통신하는 통신 인터페이스부, 및 상기 뇌 훈련을 위해 제공하는 간식과 음료 (Food&Beverage), 음악(Music) 및 활동(Activity)의 각 요소가 융합되어 있는 뇌훈련 데이터를 이용한 훈련 결 과를 상기 사용자 단말장치로부터 수신하며, 상기 수신한 훈련 결과를 분석하여 상기 사용자의 집중력을 평가하는 제어부를 포함한다. 상기 제어부는, 상기 훈련 결과를 분석하여 상기 간식과 음료, 음악 및 활동의 각 요소가 상기 사용자의 집중력 향상에 적합한지 더 평가할 수 있다. 상기 제어부는, 상기 훈련 결과로서 상기 사용자에 의해 쓰여진 글자나 색칠된 도안의 촬영 이미지를 분석할 수 있다. 상기 제어부는, 다수의 사용자별로 반복되는 뇌 훈련의 분석 결과를 근거로 개인마다 맞춤화된 뇌훈련 데이터를 생성해 제공할 수 있다. 상기 제어부는, 상기 개인마다 맞춤화된 뇌훈련 데이터로서 조기 치매 진단, ADHD(Adult attention-deficit Hyperactivity Disorder) 또는 공부 진단을 위한 뇌훈련 데이터를 생성해 제공할 수 있다. 상기 제어부는 상기 훈련 결과를 분석하여 감각운동 리듬(SMR)을 더 평가하며, 상기 평가한 SMR에 근거해 이상 발견시 상기 사용자 단말장치로 상기 이상에 대한 정밀 측정을 제안할 수 있다. 또한, 본 발명의 실시예에 따른 뉴로피드백 서비스장치의 구동방법은 통신 인터페이스부가, 뉴로피드백의 뇌 훈 련을 수행하는 사용자의 사용자 단말장치와 통신하는 단계, 및 제어부가, 상기 뇌 훈련을 위해 제공하는 간식과 음료(F&B), 음악(M) 및 활동(A)의 각 요소가 융합되어 있는 뇌훈련 데이터를 이용한 훈련 결과를 상기 사용자 단말장치로부터 수신하며, 상기 수신한 훈련 결과를 분석하여 상기 사용자의 집중력을 평가하는 단계를 포함한 다. 상기 평가하는 단계는, 상기 훈련 결과를 분석하여 상기 간식과 음료, 음악 및 활동의 각 요소가 상기 사용자의 집중력 향상에 적합한지 더 평가할 수 있다. 상기 평가하는 단계는, 상기 훈련 결과로서 상기 사용자에 의해 쓰여진 글자나 색칠된 도안의 촬영 이미지를 분 석할 수 있다. 상기 평가하는 단계는, 다수의 사용자별로 반복되는 뇌 훈련의 분석 결과를 근거로 개인마다 맞춤화된 뇌훈련 데이터를 생성해 제공하는 단계를 포함할 수 있다. 상기 제공하는 단계는, 상기 개인마다 맞춤화된 뇌훈련 데이터로서 조기 치매 진단, ADHD 또는 공부 진단을 위 한 뇌훈련 데이터를 생성해 제공할 수 있다. 상기 평가하는 단계는, 상기 훈련 결과를 분석하여 감각운동 리듬(SMR)을 더 평가하며, 상기 평가한 SMR에 근거 해 이상 발견시 상기 사용자 단말장치로 상기 이상에 대한 정밀 측정을 제안하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0031714", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 F.M.A(F: Food & Beverage, M: Music, A: Activity)의 융합 훈련 프로그램을 제공 함으로써 누구나 쉽게 반복적으로 사용하여도 재밌고, 다양한 활동과 연계된 융합 바이오피드백(예: 뉴로피드백) 시스템을 제공할 수 있을 것이다. 또한, 본 발명의 실시예는 F, M, A 각 요소는 다양하게 제공될 수 있어, 이 F.M.A 각 요소가 집중력 향상에 적 합한지 평가하는 평가 인증 플랫폼으로도 활용이 가능할 수 있을 것이다. 나아가, 본 발명의 실시예는 지속된 활동에 따른 개인별 변화 등을 지속적으로 관찰하며, 이를 바탕으로 개인별 맞춤형 프로그램을 제공할 수 있을 것이다."}
{"patent_id": "10-2021-0031714", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 뉴로피드백 시스템을 나타내는 도면이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 뉴로피드백 시스템은 사용자 단말장치, 통신망 및 뉴로피드백 서비스장치의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 통신망과 같은 일부 구성요소가 생략되어 사용자 단말장치 와 뉴로피드백 서비스장치가 다이렉트 통신(예: P2P 통신)을 수행하거나, 뉴로피드백 서비스장치 를 구성하는 구성요소의 일부 또는 전부가 통신망을 구성하는 네트워크장치(예: 무선교환장치 등)에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 사용자 단말장치는 가령 뉴로피드백의 뇌 훈련을 수행하는 사용자가 소지하는 스마트폰 등의 다양한 장치 를 포함한다. 본 발명의 실시예에 따른 사용자 단말장치는 스마트폰 이외에도 카메라를 탑재하거나 어플리 케이션(이하, 앱)을 다운로드받아 설치하고, 또 영상의 표시가 가능하다면 어떠한 장치여도 무관하다. 예를 들 어, 국내S사의 갤럭*기어와 같은 웨어러블장치나, 태블릿PC, 나아가 랩탑컴퓨터와 같은 다양한 장치가 얼마든지 가능할 수 있다. 물론 카메라 등은 사용자 단말장치에 케이블 등을 통해 외부에서 통해 연결하여 사용될 수도 있으므로 본 발명의 실시예에서는 어느 하나의 장치에 특별히 한정하지는 않을 것이다. 좀더 구체적으로 사용자 단말장치는 도 1의 뉴로피드백 서비스장치나 앱스토어에서 제공하는 본 발명 의 실시예에 따른 뉴로피드백 훈련 서비스 등을 위한 앱을 다운로드받아 설치한 후 이를 통해 서비스를 이용할 수 있다. 사용자 단말장치를 이용해 사용자는 앱을 실행하고, 자신이 활동한 활동(Activity)의 결과물을 촬영할 수 있고, 해당 결과물에 생성된 QR 코드를 통해 뉴로피드백 서비스장치에 자동으로 접속하여 결과 물을 전송할 수 있다. 이에 의해 뉴로피드백 서비스장치는 결과물의 글씨나 색칠 등을 인식하고, 결과물에 대한 행위의 결과를 뉴로피드백 서비스장치에서 인공지능(AI)이 판단하여 SMR 추정이 가능할 수 있으며, 필요시 정밀 측정을 유도할 수 있게 된다. 여기서, SMR은 감각운동 리듬을 말하며, 뇌 피질 중 감각피질과 운동 피질에서 발견되는 리듬을 의미한다. 이와 같이, 사용자의 사용자 단말장치는 뉴로피드백 훈련시 기존과 같이 보조 전문가의 도움을 필요로 하 지 않고, 두뇌에 좋은 간식과 음료(Food & Beverage), 집중력에 도움이 되는 음악(Music), 여기서 음악은 음악 테라피의 개스톤이 분류한 음악 중 집중력에 방해되지 않는 클래식 음악 위주이고, SMR(예: 12 ~ 15㎐) 유발 바 이뉴럴 시그널을 포함하는 음악을 포함할 수 있으며, 그리고 집중력 향상을 위한 컬러링(coloring) 즉 색칠하기 등의 다양한 활동(Activity)을 융합한 뉴로피드백 훈련에 관여할 수 있다. 본 발명의 실시예에 따라 사용자 단말장치로는 재밌고 즐거운 활동과 뇌혈류 증가를 위한 씹기(Chewing), 그리고 활동에 도움이 되는 음악 등을 동시 제공하는 형태로 집중력 향상 융합 뉴로피드백 서비스가 제공될 수 있다. 두뇌에 좋은 간식과 음료의 패키지와 다양한 활동(예: 컬러링)이 결합된 형태 즉 패키지를 버리지 않고, 자신의 작품이며, 향상 도구로 활용할 수 있다. 씹는 행위는 뇌혈류량을 증가시킨다. 또한, 컬러링 즉 색칠, 글 자쓰기, 문장외우기, 영어따라쓰기 등이 끝나고 스마트폰 등의 사용자 단말장치로 해당 결과물을 촬영하여 서버와 같은 뉴로피드백 서비스장치로 전송시 인공지능이 현재의 집중력을 판단하여 결과를 알려주는 융합 뉴로피드백 시스템이 되는 것이다. 물론 F&B는 과자만이 아닌 견과류/과일 등으로 영역을 확장하여 이의 인증이 가능한 플랫폼을 구축할 수도 있다. 집중력 향상 활동, 집중력 향상 과일 등 F&B는 SMR이 높아지는 과일, 같은 그림이어도 혈류량 증가 속도 혹은 과일의 향/입맛에 따라 SMR이 높아질 수 있으며, 한국인 다수의 SMR 증가를 보면 어느 하나의 두뇌과일로 평가될 수 있다. 이와 같이 본 발명의 실시예는 사용자의 흥미를 유발하고 지속된 피드백을 주어 뇌파를 증진시킬 수 있다. 이를 위해 개인 히스토리 즉 이력을 형성하고 개인 맞춤형으로 뉴로피드백을 제공할 수 있다. 통신망은 유무선 통신망을 모두 포함한다. 가령 통신망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망(PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망은 이에 한정되는 것이 아니며, 향후 구현될 차세대 이동통신 시스템의 접속망으로서 가령 클라우드 컴퓨팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가 령, 통신망이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지 만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데 이터를 처리하거나, BTS(Base Transceiver Station), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수 있다. 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피 코(pico) 기지국과 같은 소형 기지국을 포함한다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분류상 사용 자 단말장치 등을 최대 몇 대까지 접속할 수 있느냐에 따라 구분된다. 물론 액세스포인트는 사용자 단말장 치와 지그비 및 와이파이(Wi-Fi) 등의 근거리 통신을 수행하기 위한 근거리 통신 모듈을 포함한다. 액세스 포인트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근 거리 통신은 와이파이 이외에 블루투스, 지그비, 적외선(IrDA), UHF(Ultra High Frequency) 및 VHF(Very High Frequency)와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스포인트는 데이터 패킷의 위치를 추출하고, 추출된 위치에 대한 최상의 통신 경로를 지정하며, 지정 된 통신 경로를 따라 데이터 패킷을 다음 장치, 예컨대 뉴로피드백 서비스장치로 전달할 수 있다. 액세스 포인트는 일반적인 네트워크 환경에서 여러 회선을 공유할 수 있으며, 예컨대 라우터(router), 리피터 (repeater) 및 중계기 등이 포함된다. 뉴로피드백 서비스장치는 가령 뇌 훈련을 위한 플랫폼 서비스를 제공하며 기존의 뉴로피드백 훈련을 돕는 보조 전문가의 도움없이 사용자들이, 특히 소아나 노인들의 경우 자신의 사용자 단말장치를 이용해 집중력 향상을 위한 뉴로피드백 훈련을 수행하도록 하거나, SMR 향상을 위해 해당 훈련을 수행할 수 있도록 서비스를 제공한다. 뉴로피드백 훈련은 자신의 뇌에서 발생한 뇌파 정보를 활용하는 뇌파훈련으로, 보통 정상인의 경우엔 잠재능력 향상을 목적으로, 그리고 환자의 경우엔 임상증상 개선을 목적으로 시행된다. 뇌파(EEG)는 항상 살아 있는 뇌에서 끊이지않고 자연발생하고 있으며, 보통 1초에 50번 이하로 진동하는 uV수준의 미약한 전기적 신호 를 의미한다. 이는 뇌를 구성하는 흥분성 신경세포와 억제성 신경세포들의 복잡한 상호작용 결과로 나타나는 여 러가지 진동성분들로 이루어진 신호이다. 이러한 성분들 중 보통 1초에 4번미만(0-4Hz)으로 아주 느리게 진동하는 성분을 델타파라고 부르며 4-8Hz진동은 쎄타파라고 부른다. 8-13Hz 진동리듬은 알파파라고 부르며 뇌파의 고유리듬이기도 하다. 상대적으로 빠른 진동 성분에 속하는 13-30Hz는 베타파, 30-50Hz는 감마파라고 부른다. 뉴로피드백 훈련시 베타파는 12-15Hz(SMR), 15-20Hz(Mid-Beta), 20-30Hz(High-Beta)인 3부분으로 더 세분화되어 활용되기도 한다. 일반적으로 델타, 쎄타 는 수면, 마취, 졸림과 같이 의식이 저하되는 상태에서 우세해지며, 알파는 안정상태, 느린 베타는 집중상태, 빠른베타는 정서불안 및 각성상태, 감마는 복잡한 계산, 추리, 판단과 같은 고도의 인지작업시에 우세해지는 것으로 알려져 있다. 이를 도표로 정리하면 <표 1>과 같다. 표 1 Wave Frequency characteristics Theta(θ) Wave 4-8Hz related to contemplation and creative activity Alpha(α) Wave 8-12Hz related to relaxation and stability Beta(β) WaveSMR Wave 12-15Hzrelated to stand by for focusing and concentrating attention M Beta 15-20Hzrelated to absorption of learning or activity H Beta 20-30Hzrelated to excitement, tention or stress 무엇보다 본 발명의 실시예에 따른 뉴로피드백 서비스장치는 F.M.A의 융합 훈련 프로그램, 가령 뇌훈련 데 이터(예: 영상 콘텐츠 등)를 제공할 수 있으며, 이를 통해 이 F.M.A의 각 요소가 집중력 향상에 적합하지 평가 할 수 있으며, 지속된 활동에 따른 개인별 변화 등을 지속적으로 관찰하여 개인별 맞춤형 프로그램을 제공할 수 도 있다. 여기서, 맞춤형 프로그램을 통해 다양한 영상 콘텐츠를 제공하거나, 조기 치매 진단 키트, ADHD 키트, 공부 진단 키트 등을 제공할 수 있을 것이다. 본 발명의 실시예에서는 F.M.A의 융합 프로그램을 통해 누구나 쉽 게 반복적으로 사용하여도 재밌고, 다양한 활동과 연계된 융합 바이오피드백 즉 뉴로피드백 시스템을 제공할 수 있게 된다. 본 발명의 실시예에 따른 뉴로피드백 시스템, 더 정확하게는 뉴로피드백 서비스장치는 집중력 향상을 위한 간식과 음료(F&B), 음악, 활동(예: 색칠)의 융합 뉴로피드백 훈련 및 요소 평가 동작을 수행한다. 좀더 구 체적으로는 1) EEG를 통한 집중력 향상을 위한 F.M.A의 선택이 이루어지며, 상관관계의 지속적인 향상, 그리고 초기는 기존 데이터를 활용할 수 있으며, 개인별 데이터를 지속적으로 모아서 인공지능을 통해 향상시킬 수 있 다. 2) 활동 중 색칠의 경우 정밀도와 집중력의 상관관계가 있는 컬러링 결과를 인공지능에 훈련시킨다. 3) 또 한 F.M.A를 실행한 결과를 촬영하면 인공지능이 위 2)의 훈련 결과와 비교한 결과를 통보할 수 있다. 4) 개인별 이력(예: 정밀도, 집중력 향상 발전 정도)을 저장한 후 개인별 집중도에 대한 결과를 보고할 수도 있다. 이외에 도 뉴로피드백 서비스장치는 5) 개인의 현재 집중력 정도를 측정 학습에 적합한 두뇌, 즉 집중력이 충분히 준비되었는지에 대한 판단 키트로 사용되도록 할 수도 있다. 6) 색칠의 정밀도가 떨어지는 노인은 치매의 전조 증상임을 알리고, 정밀 검사를 요청(예: 개인의 나이, 성별 별로 히스토리가 있어야 함)할 수 있다. 예를 들어, 뉴로피드백 서비스장치는 공통 QR을 통해 음악선택(소수, 무료), FMA(예: 컬러링), 사진촬영, AI 판단 및 결과 생성 등의 동작을 수행한다. 또한, 개인용 QR을 통해서는 음악선곡, FMA, 사진촬영, AI 판단, 결과 생성, 개인기록 저장 및 과거(혹은 과거 데이터)와의 비교 등의 동작을 수행할 수도 있다. 통상 집중력 측정을 위한 EEG 측정은 국제표준 10-20 전극법에 의해 측정되며, 도 2에서 볼 때 Fp1, Fp2, 기준 점은 귀를 기준점으로 할 수 있다. 전극의 위치는 국제표준 10-20 전극법의 전전두엽(Fp1, Fp2) 2곳에서 EEG를 측정한다. 파워는 2개 채널의 평균으로 할 수 있다. 도 2는 EEG 측정 방법을 보여주고 있다. EEG 측정시 소아의 경우 특히 EOG, EMG 신호가 유입되므로, 도 3에서와 같이 ICA를 통하여 아티팩트(Artifact)를 제거하여 사용하 지만, 웨이블릿 변환을 수행하고 임계값 방법을 적용하여 눈 깜박임으로 EEG 신호의 아티팩트를 감지하고 제거 할 수도 있다. 도 3은 EOG 제거 방안 알고리즘의 프로세서를 보여주고 있다. 도 4는 EOG 제거 전과 후의 상태를 비교하여 보여주고 있다. 정리해보면, 본 발명의 실시예에 따른 뉴로피드백 서비스장치는 패키지의 융합 및 온오프(on-off) 프로그 램에 의한 동작을 수행한다고 볼 수 있다. 패키지 융합 동작은 FMA를 위한 Food&Beverage 패키지에 활동 중 색 칠 등이 가능한 밑그림이 포함되어 있고, QR(각종 코드)로 데이터에 접근하여 음악, 활동의 결과를 촬영하고, 인공지능에 판단을 의뢰하여 개인별 이력에 접근할 수 있다. 또한 온오프 프로그램 동작과 관련해서는 뇌파 기 계가 없어도 행위의 결과를 인공지능이 판단하여 SMR 추정이 가능하고, 필요시 정밀 측정을 유도할 수 있다. 온 -오프라인 프로그램에서 씹는 행위의 효과로 즉각적인 뇌혈류량이 증가하고 이를 통해 뇌 활동이 증가한다. 두 뇌에 좋은 재료를 사용하며, 소아는 카페인을 금지한다. 아트 테라피에 사용되는 집중력 향상에 도움이 되는 색 칠로 활동을 제공한다. 집중력을 방해하지 않는 환경 조성을 위한 집중력 중심의 클래식 등 음악을 사용한다. 각기 프로그램을 따로 제공할 수 있지만, 3가지를 혼합한 융합 뉴로 피드백을 제공한다. 본 발명의 실시예에 따른 뇌훈련을 통해 데이터가 쌓여감에 따라 개인 맞춤형(예: 그림, 음악)의 집중력 향상 환경을 제공하는 것이 가능해진다. QR, 바코드 등의 스티커를 통해 평가를 진행하여 실제 그림 및 환경으로 드 러나는 뇌파, 뇌활성화 유도를 인공지능으로 평가할 수 있으며, 이를 통해 심리상태를 확인하여 뇌파 활성화나 심리상태를 개선할 수 있다. 개인 QR(코드, 혹은 공동코드에 개인 비번 부여, 개인별 인식)이 사용될 수 있고, 다양한 환경에 노출됨(예: 그림, 음악)에 따른 개인별 선호도 자동 분석, 집중력 활성화를 위한 개인 맞춤형 프 로그램을 제공할 수 있다. 그림의 채색 및 다양함, 그리고 정교함에 따른 집중력을 인공지능으로 평가할 수 있 다. 뇌파 측정에 따른 주의 집중력 평가(인공지능)를 수행할 수도 있다. 2가지 중 한 가지만 제공할 수 있으나, 정교한 정밀 측정을 위하여는 2가지를 병합하는 것이 중요할 수 있다. 또한, 온-오프라인 프로그램으로서 미술 치료에 사용되는 기술에는 그림, 채색, 조각 또는 콜라주가 포함될 수 있다. 예술을 만들 때 표현된 결과물을 분석하고, 그림, 채색 및 정밀도 평가(인공지능)를 수행하며, 극단적인 패턴분석, 밑그림과의 정밀도 비교분석을 수행할 수 있다. 뇌파를 측정하여 실제 두뇌 활동 특히 집중력 평가/ 개선이 이루어질 수 있다. 위의 2가지를 혼합하면 두뇌의 집중력의 향상도를 평가하는 것이 가능할 수 있다. 빅 데이터가 쌓이게 되면 개인별 맞춤형 집중력 향상 로드맵을 제시할 수 있다. 이외에도 온-오프라인 프로그램으로는 사진 촬영 및 AI 평가를 진행해 그림 심리 상태평가를 수행할 수 있다. 그림의 좌우크기, 높이 크기로 기준점을 삼을 수 있다. 가장 안정적인 그림(예: 컬러 테라피스트의 조언에 따른 표준 그림 ) 대비 개인의 집중력을 비교할 수도 있다. 전체 그림의 스펙트럼을 조사하고 컬러의 표현도 확인할 수 있어 다수의 데이터와 비교하여 개인의 컬러 분포도를 확인하여 다수 대비 집중력을 확인할 수도 있다. 다수 대비 특정 색에 집중되었을 경우 이상으로 표현하고, 전문가의 평가(테라피스트) 입력, 지속적인 데이터를 확보 하여 개인의 심리 상태, 집중력을 평가할 수 있다. 뿐만 아니라, 각 기준점(접점) 대비 정밀도, 라인의 정밀도 확인(예: 세밀함 표현 정도: 불안한 심리, 안정적 심리), 정밀도 확인, 개인 맞춤형 집중력 향상 서비스 제공, F&B의 집중력 연관성, 연계성 증명, 시니어가 채색 력이나 정밀도가 떨어지면 두뇌 활동능력이 떨어지는 것을 사전 측정할 수 있고, 손으로 드로잉 등을 한다는 것 은 두뇌에 직접적인 자극을 가하는 것을 알 수 있고, 통상 게임만 하는 뉴로 피드백은 어린이들의 집중력을 이 끌어 내기가 매우 힘들다. 따라서 시각 혹은 음악, 특정 신호만의 자극을 통한 두뇌 활성화 프로그램을 통해 직 접적인 혈류량 증가, 두뇌 영양공급, 집중력 유도 실제 행위, 그리고 집중력 측정 등 영양분 공급과 실제 행동 과의 융합을 통한 두뇌 활성화 특히 집중력 집중 케어 서비스 융합을 수행할 수 있다. 온오프(라인)는 음악 자 극, 자연의 소리 ~ SMR파 음악까지를 포함할 수 있으며, 맞춤형을 위하여 화면에 그림을 그린다든지 등등의 온 오프의 다양한 방법을 제공할 수 있다. 상기와 같이, 본 발명의 실시예에 따른 뉴로피드백 서비스장치는 근본적으로 그림, 음악, 활동 등의 변경 이 가능하고 이를 통해 개인 맞춤형 서비스를 제공할 수 있다. 과자/음식은 씹는 행위, 개인에서 시작해서 여러 시도를 통해 개인 역사화(history), 이를 통해 집중력 향상 액션 프로그램을 제공할 수 있다. 나이/성별 대비는 SMR정도(유발), 정밀/색감 AI 평가가 이루어질 수 있다. 개인 히스토리를 가지고 있으므로 가장 개인적인 SMR 훈련 프로그램 제공이 가능하다. 재밌고 반복적으로 할 수 있는 다양한 융합 뉴로피드백 프로그램 제공이 가능 하다. 조기 치매 진단 키트, ADHD 키트, 시작해야 하는 때를 측정해 주는 공부 진단 키트 등을 제공할 수 있다. 부가적인 효과로는 각종과자/음료/과일 등을 평가하여 브레인 푸드로 평가 인증이 가능할 수 있다. 본 발명의 실시예에 따른 주요 특징으로는, 흥미를 가지고 간단하게 진단이 가능하고, 측정 가능 키트의 제공이 가능하며, 생활속 SMR 진단 키드, 개인/집단 결과 제공, 개인 맞춤형 SMR 향상 키트 제공, on/off 진단 시스템 을 제공할 수 있고, 예를 들어 그림 그리기를 수행할 수 있을 것이다. 개인 코드 스티커를 부여하며, 개인코드 를 도용/타 데이터 업로드시(예: 가짜 그림 업로드시) 급격한 이상신호를 발견할 수 있을 것이다. 또다른 특징 은 간단/누구나 현재의 두뇌 집중력 평가 키트로 공부할 수 있는 준비가 되었는지 확인 가능하고 현재 집중력이 얼마나 되는지, 개인 이력 대비를 수행할 수 있다. 개인 이력을 통해 치매 조기 진단이 가능할 수 있다. 이외에 도 개인 맞춤형 집중력 주파수, 음악 제공 및 온라인 공부시 자동 합성이 가능하다. 필요시 정밀 EEG SMR 측정 유도 표기, AI평가 후 스마트폰 화면에 자동 피드백을 제공할 수 있다. 뿐만 아니라, 본 발명의 실시예에 따른 시스템은 집중력 향상 훈련용(예: 융합 뉴로피드백 프로그램), 집중력 평가가 가능하여 개인의 학습 적합 시기 판단이 가능하다. 치매 조기 진단이 가능하여 정밀도가 떨어지고 현저 한 변화가 있는 경우(1. 색감, 2. 정밀도) 조기 경고가 가능하며, 조기 치매 발견, 초기 적극 치료 및 치매 늦 춤이 가능할 수 있다. 세상에서 가장 저렴하고 재밌는 치매 조기 진단 키트를 제공할 수 있을 것이다. 도 5는 도 1의 뉴로피드백 서비스장치의 세부구조를 예시한 블록다이어그램이다. 도 5에 도시된 바와 같이, 본 발명의 실시예에 따른 도 1의 뉴로피드백 서비스장치는 통신 인터페이스부 , 제어부, 뉴로피드백 처리부 및 저장부의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 뉴로피드백 서비스 장치가 구성되거나, 뉴로피드백 처리부와 같은 일부 구성요소가 제어부와 같은 다른 구성요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 통신 인터페이스부는 도 1의 통신망을 경유하여 사용자 단말장치와 통신한다. 통신 인터페이스 부는 본 발명의 실시예에 따른 뉴로피드백의 뇌훈련을 위해 온라인 또는 오프라인과 연계하여 동작할 수 있다. 여기서, 온라인은 사용자 단말장치로 뉴로피드백 뇌훈련을 위한, 또는 EEG 등의 측정을 위한 콘텐츠 (혹은 훈련 데이터)를 제공하고, 물론 여기서의 콘텐츠는 FMA의 융합 프로그램에 의한 콘텐츠이며, 이를 통해 뇌훈련에 따른 훈련 결과를 수신하여 제어부에 제공할 수 있다. 또한, 통신 인터페이스부는 오프라인과 연계하여 동작하기 위하여 물론 온라인에서도 마찬가지로 앱을 실 행해 동작이 이루어질 수 있지만, 오프라인상에서 사용자가 도안상에 색칠을 하거나, 또는 백지에 글씨 쓰기를 한 경우 카메라 등을 통해 사용자 단말장치에서 촬영하여 전송하는 사진 이미지와 관련되는 데이터 즉 훈 련 결과를 수신하여 제어부에 전달할 수 있다. 나아가 통신 인터페이스부는 상기와 같은 동작을 수행하는 과정에서 변/복조, 인코딩/디코딩, 먹싱/디먹싱 등의 다양한 동작을 수행할 수 있으며, 이는 당업자에게 자명하므로 더 이상의 설명은 생략하도록 한다. 제어부는 도 1의 뉴로피드백 서비스장치를 구성하는 도 5의 통신 인터페이스부, 뉴로피드백 처 리부 및 저장부의 전반적인 제어 동작을 담당한다. 대표적으로 제어부는 통신 인터페이스부를 통해 사용자 단말장치의 뉴로피드백을 위한 뇌훈련 데이터가 제공되면, 이를 저장부에 임시 저장한 후 불러내어 뉴로피드백 처리부로 제공해 평가를 요청한다. 또한, 제어부는 뉴로피드백 처리부에서 제공되는 사용자별 뇌훈련, 더 정확하게는 FMA 융합 프로그램 을 통해 분석되는 사용자의 뇌훈련 결과를 사용자 단말장치로 제공하도록 통신 인터페이스부를 제어 할 수 있다. 제어부는 뉴로피드백 처리부와 연계하여 다양한 동작을 수행할 수 있으며, 좀더 자세한 내용은 뉴로피드백 처리부에서 좀더 살펴보기로 한다. 뉴로피드백 처리부는 FMA를 이용한 EEG 측정, FMA를 이용한 패키지 융합 동작, 그리고 온오프라인을 연계 한 프로그램 제공 및 그에 따른 평가 등의 다양한 동작을 수행할 수 있다. 예를 들어, 뉴로피드백 처리부 는 FMA를 통한 EEG 측정과 관련하여 색칠과 SMR의 상관관계를 알기 위해 뇌파의 Beta wave 대비 SMR만의 파워를 측정하고 해당 파워로 집중력 지수를 표기하는 등의 동작을 수행할 수 있다. 또한, 정밀도와 SMR의 상관관계를 측정하거나, 개인의 반복적인 FMA는 SMR 지속력에 효과가 있는지 등을 측정할 수도 있다. <표 2>는 실험군을 나 타낸다. 표 2 A B C 연령 6 ~ 8세 15세 19세 남여 50: 50 인원 17 22 20 48% 40% 60% 먼저, 컬러링 즉 색칠이 SMR과 상관관계가 있는지를 알기 위하여 뇌파의 Beta Wave 대비(예: 파워) SMR만의 파 워로 집중력 지수가 계산될 수 있다. 이는 <수학식 1>과 같이 표현될 수 있다. [수학식 1] 집중력 지수 = ρSMR/ρβ 가령 눈을 감고 EEG를 측정할 때와 F.M.A를 3분동안 적용한 후 EEG를 측정할 때 파워를 비교해 보면 집중력이 40 ~ 60% 이상 상승하는 것을 확인할 수 있다. 가령 10초 동안 눈을 감고, EEG(FP1, FP2)를 1분 측정할 때의 EEG 결과와, 10초 휴식 후 F.M.A를 적용한 후 10초 휴식 후 EEG를 3분간 측정할 때의 EEG 결과는 전자 대비 후 자의 초기 1분 집중력 파워는 평균 48 ~ 63% 상승한다. 뇌파 비교시 FMC가 아무 행위 없는 것에 비하여 a- wave가 60% 향상한다. 또한 정밀도와 SMR이 상관관계가 있는지 확인하기 위하여 F.M.A 후 집중력이 측정될 수 있다. 같은 그림, 다른 시간, 같은 음악(50명 6회 시험)을 이용하여 정밀도(예: 밑그림 대비 색의 라인 차이), 서버에 업로드된(촬영된) 사진은 이미지 프로세싱을 통하여 색이 겹치는 곳을 경계선으로 하여 라인을 다시 그리게 되 며, 이렇게 처리된 이미지를 기존 밑그림 라인과 비교하여 매칭(정밀도)을 찾아내게 된다. 학습 인공지능(뉴럴 네트워크), 이미지 인식을 위한 신경망 구조는 3D 컨볼루션 신경망(Convolution Neural Network)을 사용한다. 94%의 정확도인 인간의 능력보다 최대 95%의 정확도로 이미지를 예측할 수 있다. 또한 사진의 컬러 스펙트럼을 분석하여 분포도의 다양성을 가지고 특정 색의 이미지가 강조되거나 하면 이상 결과로 나타내며, 반면 무채색의 경우 또한 이상 결과로 나타내게 되는데 좀더 심도있게는 개인 이력을 저장하기 위하여 연락처 등을 제공하였을 경우 개인의 상태 변화를 지속적으로 관찰하여 저장하게 되며, 결과를 알려주게 된다. 초등생, 15, 20 및 15명의 A, B, C의 그룹을 확인하였으며, 전체 50명의 색칠 정밀도 vs EEG(SMR)을 비교하였다. 색칠은 실험자의 87%가 SMR이 높아졌다. 색칠의 밑그림 라인 대비 정밀도가 30% 이내와 50% 이내 2 가지 비교시 30% 이내의 경우가 SMR 파워가 약 48% 높다. 이는 동일 인물, 다른 시간, 동일한 성별, 연령대 30 명 대비를 나타낸다. 같은 연령대, 같은 성별의 집단대비 어느 정도 수준에 속하며, 정밀도 측정을 위하여 인공 지능(AI)가 사용될 수 있다. 성인과 아이들의 그림에 정밀도는 차이가 있을 수 있으므로, 같은 연령대의 평균대비 위치, 점수를 알려주는 것 이다. 또한 국민 대비 %를 나타내어주어 자신감을 부여한다. 색감은 같은 연령, 성별 데이터 대비 색감 스펙트 럼이 높거나 낮을 수 있고, 색감의 화려함, 단순함 특정 색만 사용한다. 색감의 단순함보다 화려함, 독특함을 사용하여 이를 집중력의 지표로 삼을 수 있다. 색칠을 AI가 보고 성별/연령대 vs 정밀도 수준을 판단할 수있고, SMR의 파워를 측정할 수 있다. 개인 코드가 있을 시 코드를 찍고 음악을 선곡하며, 찍은 사진을 등록하고 이름 등을 남길 수 있다. 전체 집단 대비 SMR의 정도 표기는 히스토리로 저장한다. 나아가, 개인의 반복적인 FMA는 SMR 지속력에 효과가 있는지를 알 수 있다(혹은 측정할 수 있다). 같은 사람, 다양한 그림, 다양한 음악이 사용된다. 30여명을 초기 1회 FMA 후 30분 집중도(EEG)의 측정을 시작하여 파워 대 비 하락을 대비한다. 20여회 FMA 이후 집중도가 15 ~ 20초 유지에서 15~30분으로 대폭 증가된다. 1회 F.M.A 10 초후 SMR 지속성을 측정(30분)한다. 초기에는 15 ~ 30초 유지가 최대였으나, 20 ~ 30회 이후 최장 30분으로 지 속성이 매우 증가된다. 하락폭은 FMA가 끝난 직후 초기 집중력(100%)에 비하여 -25%를 기준으로 하였다. 예를 들어 선곡한 음악을 유지하면서 F.M.A 중단 후 공부 + 음악 환경하에서 음악보다 45%이상 집중력 지속이 더욱 오래 유지된다. 과제와 함께 음악을 제공받았을 경우 SMR이 훨씬 오래 유지되게 된다. 따라서 SMR훈련을 지속적으로 받으면 오랫동안의 집중력 유지가 되어 더 많은 과제를 해결할 수 있는 근거가 마련될 수 있다. 결 과는 지속적인 사용시 개인별 집중력 향상(SMR 증가) 서비스 패키지(예: 음료 혹은 씹는 식사, 그림, 음악) 제 공이 가능할 수 있다는 것이다. 또한, 뉴로피드백 처리부는 온라인 또는 오프라인상에서 이루어지는 FMA를 이용한 뇌훈련과 관련한 훈련 결과를 제공받아 이를 분석하고 분석 결과를 추출할 수 있다. 훈련 결과의 분석을 위하여 인공지능(AI) 프로그 램을 실행시킬 수 있으며, 이를 통해 개인별 맞춤 프로그램을 생성하여 이를 사용자별로 제공할 수도 있다. 다 시 말해, 뉴로피드백 처리부는 사용자에게 훈련 데이터를 제공할 때 사용자별로 FMA를 이용해 어떠한 요소 가 사용자에게 유익한지를 판단할 수 있게 된다. 예를 들어, 색칠과 관련한 훈련 데이터만을 사용자에게 제공했 을 때와 음악을 함께 병행할 때의 훈련 데이터를 근거로 사용자에게 어떠한 형태의 뇌훈련이 이루어져야 하는지 를 평가할 수 있다. 이러한 과정을 통해 수집되는 빅데이터를 AI 등을 통해 분석하여 치매 또는 학습 등을 위한 다양한 형태의 맞춤형 프로그램을 제공할 수 있다. 가령 키트(kit)의 형태로 제공할 수 있다. 다시 말해, 사용 자 단말장치로 해당 키트를 제공하여 반복 훈련이 이루어지도록 하는 것이다. 예를 들어, 뉴로피드백 처리부는 온라인 동작으로서, 도 1의 사용자 단말장치로 FMA가 융합된 게임 콘텐츠를 제공할 수 있지만, 도안을 제공하고 이를 화면상에서 색칠하도록 하며, 그에 대한 결과를 수신할 수 있다. 또는 음악을 제공한 후 사용자의 반응을 파악하고 이를 근거로 집중력 훈련이 이루어지도록 할 수도 있다. 또한, 오프라인 동작으로는 QR 코드 등이 부착되어 있는 도안에 사용자가 색칠을 하도록 하고, 색칠이 완 료되면 이를 앱의 실행 후 사진 촬영을 통해 제공되도록 하여 이를 AI로 분석하고 분석 결과를 사용자에게 제공 하거나, 사용자의 상태를 진단하여 진단 결과에 따른 뇌훈련이 이루어지도록 제안할 수 있다. 결론적으로 뉴로피드백 처리부는 FMA 중 가령 A(Activity)의 결과로서 색칠의 인공지능 측정을 통한 현재 상태의 집중력 평가 및 빅데이터화를 수행하고, 지속적이고 다양한 FMA를 통한 개인 맞춤형 집중력 유발, 증가 방법을 제공하여 필요시 개인별 집중력 도출 키트를 제공할 수 있다. 또한, 플랫폼을 활용하여 EEG로 상관성을 확보하고, 이를 근거로 하여 재미있고, 누구나 따라할 수 있는 Food & Beverage, Music, Activity 평가 및 인 증을 제공할 수 있다. 여기서, F&B는 행동, 씹는 행위, 카페인 마시기 등을 포함하며, 성분은 가바, 오메가 등 두뇌활성화 물질 기반의 간식 및 음료를 포함한다. 그림, 명언 등으로서 로봇, 명화, 지역 영웅 등, 따라 읽으 면 또 따라 그리면 집중력이 향상되는 영어공부책 등을 포함할 수 있다. 음악으로는 클래식, 명상, 가요 등을 포함할 수 있다. 뉴로피드백 처리부는 개인 맞춤형 동작을 수행한다. 이를 위해 개인별 QR을 제공할 수 있고, 그림과 음악 이 선택되도록 하며, 그림 정밀도 측정, 집중력 측정 등의 동작을 수행할 수 있다. 지속적인 업데이트를 통한 다수 사용자의 평균치 대비 개인의 도달도 보여줄 수 있다. 최종적으로 창의력 향상 맞춤형 서비스의 제공이 가 능할 수 있다. 개인의 정밀도, 컬러 스펙트럼의 저장이 가능하며, 센터에서 정기 집중력 측정이 가능할 수 있다. 예를 들어 다수 대비(예: 비슷한 연령대, 성별) 개인의 현상태를 비교할 수 있고, 필요시 집중훈련을 제 안할 수 있으며, 센터 방문을 통해 집중력 향상 로드맵 및 훈련이 제공되도록 할 수 있다. 저장부는 제어부의 제어하에 처리되는 다양한 데이터를 임시 저장한 후 출력할 수 있다. 제어부(51 0)는 도 1의 사용자 단말장치로 제공한 FMA를 이용한 훈련 데이터를 근거로 제공되는 훈련 결과를 저장한 후 뉴로피드백 처리부로 제공되도록 출력할 수 있을 것이다. 상기한 내용 이외에도 도 5의 통신 인터페이스부, 제어부, 뉴로피드백 처리부 및 저장부는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한 다.한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트정보의 연산동작을, 그리고 명령어해석부는 인터프리터나 컴파 일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지스 트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 도 1의 뉴로피드백 서비스장 치의 동작 초기에 뉴로피드백 처리부에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로 딩한 후 이를 실행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 도 6은 본 발명의 실시예에 따른 뉴로피드백 훈련 과정을 나타내는 흐름도로서, 오프라인 드로잉 프로세스를 예 시하여 보여주고 있으며, 도 7은 색칠하기에 사용된 도안의 예시도이다. 설명의 편의상 도 6을 도 1과 함께 참조하면, 본 발명의 실시예에 따른 도 1의 뉴로피드백 서비스장치는 사용자 단말장치에서 앱을 실행한 후 도 2에서와 같이 도안(drawing)에 삽입된 QR 코드를 리딩(혹은 독 출)하면, QR 코드의 코드 정보를 근거로 개인 코드인지 공통 코드인지를 판단할 수 있다(S600 ~ S620). 개인 코드로 판단되면, 본인 확인 및 다수 음악 선택이나 개인 추천 즉 맞춤 서비스를 제공할 수 있다(S630, S640). 반면 공통 코드인 경우 소수 선택 음악을 제공할 수 있다(S625). 이어, 뉴로피드백 서비스장치는 F.M.A를 이용한 훈련 동작을 수행할 수 있으며, QR 캡쳐 및 카메라 촬영을 통해 제공되는 색칠 데이터를 근거로 AI 평가를 진행하여 결과를 출력할 수 있다. 물론 이의 과정에서 뉴로피드 백 서비스장치는 이상시 정밀 측정을 제안할 수 있다(S650 ~ S680). 도 8은 본 발명의 다른 실시예에 따른 뉴로피드백 훈련 과정을 나타내는 흐름도이다. 설명의 편의상 도 8을 도 1과 함께 참조하면, 도 1의 뉴로피드백 서비스장치는 사용자 단말장치에서 ID, 비번 등을 입력하면 이를 근거로 기존 도안을 선택한다(S800, S810). 만약, 사용자가 신규도안을 요청하는 경우에는 신규 도안을 제시하며, 이의 과정에서 음악 선택도 가능할 수 있 다(S815). 이와 같이 FMA를 이용한 뇌훈련이 완료되면, 관련 데이터를 수신하여 AI 측정을 수행하며, 이의 과정에서 뉴로 피드백 서비스장치는 다수 대비 평가 및 개인 향상 평가를 수행하여 평가 점수를 출력할 수 있다(S820 ~ S850). 좀더 구체적으로, 본 발명의 실시예는 PC, 스마트폰 앱의 개인 접근을 통하여 음악과 도안은 선택 가능하며, 유 료의 경우 다수의 도안을 제시하고, 무료의 경우 소수의 도안, 소수의 음악만 제시될 수 있다. 그리고 무료의 경우 일정 기간 동안만의 히스토리를 나타내어 준다. 유료의 경우 기간별, 센터와의 정기 협약, 오프라인 두뇌 활동과 연계할 수 있을 것이다. 도 9는 본 발명의 실시예에 따른 도 1의 뉴로피드백 서비스장치의 구동과정을 나타내는 흐름도이다. 설명의 편의상 도 9를 도 1과 함께 참조하면, 본 발명의 실시예에 따른 뉴로피드백 서비스장치는 뉴로피드 백의 뇌 훈련을 수행하는 사용자의 사용자 단말장치와 통신한다(S900). 또한, 뉴로피드백 서비스장치는 뇌 훈련을 위해 사용되는 간식과 음료, 음악 및 활동의 각 요소가 융합된 뇌 훈련 데이터의 훈련 결과를 사용자 단말장치로부터 수신하며, 수신한 훈련 결과의 분석 결과로서 사용 자의 집중력을 평가한다(S910). 상기한 내용 이외에도 도 9의 뉴로피드백 서비스장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내 용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 한편, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었 다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각 각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프 로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일 시적 저장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써,본 발명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다. 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에"}
{"patent_id": "10-2021-0031714", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2021-0031714", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 뉴로피드백 시스템을 나타내는 도면, 도 2 내지 도 4는 집중력 측정을 위한 EEG 측정을 설명하기 위한 도면, 도 5는 도 1의 뉴로피드백 서비스장치의 세부구조를 예시한 블록다이어그램, 도 6은 본 발명의 실시예에 따른 뉴로피드백 훈련 과정을 나타내는 흐름도, 도 7은 색칠하기에 사용된 도안의 예시도, 도 8은 본 발명의 다른 실시예에 따른 뉴로피드백 훈련 과정을 나타내는 흐름도, 그리고도 9는 본 발명의 실시예에 따른 도 1의 뉴로피드백 서비스장치의 구동과정을 나타내는 흐름도이다."}
