{"patent_id": "10-2022-7043580", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0011991", "출원번호": "10-2022-7043580", "발명의 명칭": "개별 다발성 경화증 대상체의 조화된 치료를 촉진시키기 위한 빅 데이터 처리", "출원인": "에프. 호프만-라 로슈 아게", "발명자": "몰레로 레옹, 실비아 엘레나"}}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "방법으로서,클라우드-기반 애플리케이션 서버에서, 다발성 경화증의 치료를 식별하는 쿼리를 수신하는 단계,치료의 식별자를 이용해 데이터 저장소에 쿼리하는 단계 ― 상기 데이터 저장소는 의료 제공 개체의 분산 세트로부터 수신된 입력에 적어도 부분적으로 기초하여 채워짐 ― ,상기 쿼리에 응답하여, 대상체 식별자의 세트를 수신하는 단계 ― 상기 대상체 식별자의 세트 내 각각의 대상체식별자는 대상체 식별자에 대응하는 대상체가 치료를 받았다고 지시함 ― ,상기 대상체 식별자의 세트의 각각의 대상체 식별자에 대해:상기 데이터 저장소 내 데이터에 기초하여, 대상체 식별자에 대응하는 대상체가 치료를 개시한 때를 결정하는단계, 및대상체 식별자와 연관된 하나 이상의 레코드로부터: 치료의 결과를 지시하는 하나 이상의 메트릭, 및 하나 이상의 대상체 속성 ― 하나 이상의 메트릭의 추출은 치료가 개시된 때에 적어도 부분적으로 기초하였고,하나 이상의 대상체 속성 각각은 레코드-대응 대상체의 특성 또는 의학적 검사의 결과를 반영함 ― 을 추출하는 단계,추출된 메트릭 및 추출된 대상체 속성에 기초하여 치료에 대한 다른 대상체의 예측 반응을 생성하는 단계, 및상기 예측 반응에 대응하는 결과를 출력하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 대상체 식별자의 세트의 각각의 대상체 식별자에 대해:상기 데이터 저장소는 대상체-연관 스냅샷의 세트를 포함하며 ― 상기 대상체-연관 스냅샷의 세트 중 각각은 특정 시점에 대응하고 대상체는 대상체 식별자에 대응함 ― ,상기 대상체-연관 스냅샷의 세트의 서브세트 내 각각의 스냅샷은 치료와 연관되고,하나 이상의 메트릭이 상기 대상체-연관 스냅샷의 세트의 서브세트로부터 추출되는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 대상체-연관 스냅샷의 세트 중 적어도 일부에 대해, 데이터 저장소가 상이한 시점 후 시점과 연관된 대상체에 대한 또 다른 메트릭 값을 포함하지 않았다고 결정되고 스냅샷에 대응하는 특정 시점을초과하지 않으면, 하나 이상의 메트릭 중 적어도 하나가 상기 특정 시점 전 상이한 시점으로부터의 메트릭 값이도록 정의된, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서, 치료의 결과를 지시하는 하나 이상의 메트릭은 MRI 결과에 기초한하나 이상의 절대 또는 상대 통계치를 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 치료의 결과를 지시하는 하나 이상의 메트릭은 재발 보고에 기초한하나 이상의 절대 또는 상대 통계치를 포함하는, 방법.공개특허 10-2023-0011991-3-청구항 6 제1항 내지 제5항 중 어느 한 항에 있어서, 치료의 결과를 지시하는 하나 이상의 메트릭은 진행 평가에 기초한하나 이상의 절대 또는 상대 통계치를 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서, 치료의 결과를 지시하는 하나 이상의 메트릭은 장애 평가에 기초한하나 이상의 절대 또는 상대 통계치를 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,추출된 메트릭 및 추출된 대상체 속성을 이용해 머신-러닝 모델을 훈련하는 단계 ― 예측 반응은 훈련된 머신-러닝 모델을 이용해 생성됨 ― 를 더 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서,메트릭을 이용해 상기 대상체 식별자의 세트를 둘 이상의 그룹으로 분할하는 단계, 및다른 대상체와 연관된 다른 대상체 메트릭에 기초하여 상기 둘 이상의 그룹 중 한 그룹으로 상기 다른 대상체를할당하는 단계 ― 예측 반응은 그룹 할당에 기초하여 생성됨 ― 를 더 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서, 하나 이상의 대상체 속성 각각은 대상체가 치료를 시작한 시점과 연관된 대상체의 속성을 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서, 수신된 쿼리는 다른 대상체의 하나 이상의 특정 속성을 더 포함하고, 상기 쿼리는 하나 이상의 특정 속성에 기초하여 수행되는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 하나 이상의 특정 속성은 다른 대상체가 이전에 받은 다른 치료의 식별을 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제12항 중 어느 한 항에 있어서,상기 결과에 기초하여, 상기 치료가 다른 대상체에 대한 다발성 경화증을 효과적으로 치료할 것임을 예측하는단계, 및상기 다른 대상체를 상기 치료로 치료하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "데이터 플랫폼을 구축하고 이용해 다발성 경화증에 대한 치료의 지능적 선택을 촉진시키고 다발성 경화증 치료에 대한 지시자를 식별하기 위한 시스템 및 방법이 개시된다. 다발성 경화증 대상체와 연관된 레코드의 다양한 레코 드 스냅샷이 이종의, 구조화되지 않고, 분류되지 않은 데이터 세트를 탐색하여 정확하고 일반적인 가설 및 대상 체-특정 치료 예측을 생성하는 데 사용될 수 있는 효과적인 쿼리를 촉진시킨다."}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원의 교차-참조 본 출원은 그 내용이 전체로서 모든 목적으로 참조로서 본 명세서에 포함되는 2020년06월12일에 출원된 유럽 특 허 출원 번호 20179750.3의 출원일의 이익을 주장한다."}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "기술분야 본 명세서에 개시된 방법 및 시스템은 일반적으로 플랫폼을 이용해 진단 및 치료 전략을 결정하는 것과 관련하 여 태깅된 데이터를 저장 및 처리하기 위한 시스템 및 방법과 관련된다. 시간-민감성 처리가 사용되어, 시간 관 련 데이터를 예측하고 시계열 이벤트 체인에 기초하여 예측된 대상체 상태를 생성할 수 있다."}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다발성 경화증(MS)이 이질성 표현을 갖는 일반적인 질병이다. 예를 들어, 미국에서 약 300명 중 1명이 다발성 경화증을 앓고 있다(Wallin et al., \"The prevalence of MS in the United States\" Neurology, 92, 2019에 토대함). 다양한 위험 인자가 확인되었지만 질환의 원인은 아직 알려져 있지 않다. MS로 진단될 가능성은 (예를 들어) 가 족 구성원이 MS(또는 다른 자가면역 질환)로 진단되었는지 여부, 대상체의 거주지의 위도, 대상체가 해안 근처 에 거주하는지 여부, 대상체가 여성인지 여부, 대상체의 나이, 대상체의 인종, 대상체가 특정 바이러스(가령, 엡스타인-바(Epstein-Barr) 바이러스)에 감염되었는지 여부, 대상체의 흡연 여부 및 비만 여부에 따라 달라진다. 초기 질환 발현, 질환 진행 및 다양한 치료에 대한 반응성은 대상체에 따라 크게 달라서, 일부 전문가는 MS가 실제로는 상이한 질환의 세트인지 여부에 대해 의문을 제기한다. 의료계는 다양한 질환의 하위 유형을 식별하고 치료 결정을 알리는 데 사용될 수 있는 의학적 검사도 정의했다. 그럼에도, 선택된 치료가 종종 효과가 없다. 특정한 새 치료 또는 치료 조합의 효능을 결정하기 위해 임상 시험이 자주 수행된다. 그러나 자격 기준이 종종 제한적이어서, 시험에서의 대상체 그룹이 신경과 전문의에게 치료 조언을 요청하는 환자의 그룹을 대표하지 않 을 수 있다. 또한, 대상체 그룹의 상대적으로 작은 크기가 데이터 과학자가 효능에 기여하는 요인을 발견할 수 있는 범위를 제한할 수 있다. 다행히도, 다발성 경화증에 대한 치료 옵션의 수가 지난 10년 동안 폭발적으로 증가했다. 이는 대상체가 모든 치료 옵션에 반응하지 못할 가능성이 적다는 점에서 유익하다. 그러나 각각의 치료를 반복적으로 시도하는 것은 이제 추가적인 치료 가능성으로 인해 훨씬 더 비실용적이다. 치료가 진행 속도를 늦추고 있는지 여부를 결정하 는 데 종종 반년 또는 그 이상이 걸린다. 그 기간 동안 대상체의 다발성 경화증은 다른 치료가 사용된 경우보다 더 급격히 비가역적으로 진행될 수 있다. 따라서, 대상체 평가 및 치료 선택을 개선할 수 있는 시스템 또는 프 로세스가 사용될 수 있다면 바람직할 것이다. 많은 양의 의료 데이터가 디지털 방식으로 이용 가능하게 됨에 따라, 개인화된 의료를 위한 시스템 및 방법이 성장하고 있다. 한 예에서, 환자 커뮤니티의 환자 프로필에 기반한 의학적 병태 및 결과의 개인화된 관리 및 비 교가 미국 특허 출원 공개 번호 2015/0324530에 개시되어 있으며, MS를 비롯한 다양한 의학적 상태에 유용한 것으로 설명되어 있다. 그러나, 개시된 기술은 특정 MS 환자에 대해 효과적일 수 있는 제안된 치료 과정을 전향적 으로 식별하기 위해 이전 MS 치료 및 이들 치료가 적용됐을 때에 기초하여 환자와 매칭되지 않는다. 또 다른 지능형 의학 접근법이, 가령, MS를 비롯한 다양한 의학적 병태에 대해, 환자 임상 파라미터, 질병 템플 릿, 치료, 및 결과에 따라 서브그룹의 복수의 레벨로 분류되는 환자의 의학적 레코드 데이터를 이용해, 여러 소 스 및 상이한 지역으로부터의 많은 양의 의학적 정보를 분석하고, 분류하며, 매칭시키기 위한 기술을 기재하는 미국 특허 출원 공개 번호 2015/0161331에 의해 탐색되었다. 새로운 환자가 시스템에 들어올 때, 환자의 파라미 터 및 질병 템플릿이 가장 가까운 서브그룹에 대해 매칭되어 잠재적으로 유리한 결과를 가진 치료를 제안한다. 그러나, 다시 말하지만, 특정 MS 환자에 대해 효과적일 수 있는 제안된 치료 과정을 전향적으로 식별하기 위해 이전 MS 치료 및 이들 치료가 적용됐을 때에 기초한 환자 매칭이 기재되어 있지 않다. ALLAM ET AL.: \"Patient Similarity Analysis with Longitudinal Health Data\", ARXIV.ORG, 14 May 2020, XP081673418은 임상 의사 결정 개선을 위한 환자 유사성 분석을 위한 가능성을 논의하면서, 종단 데이터를 사용 한 환자 유사성 분석에 사용되는 도구 및 방법에 대한 포괄적인 개요를 제공한다. 그러나, 개시된 기술은 특정 MS 환자에 대해 효과적일 수 있는 제안된 치료 과정을 전향적으로 식별하기 위해 이전 MS 치료 및 이들 치료가 적용됐을 때에 기초하여 환자와 매칭되지 않는다."}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일부 실시예에서, 컴퓨터-구현형 방법이 제공된다. 상기 방법은, 클라우드-기반 애플리케이션 서버에서, 다발성 경화증의 치료를 식별하는 쿼리를 수신하는 단계 및 치료의 식별자를 이용해 데이터 저장소에 쿼리하는 단계를 포함하며, 상기 데이터 저장소는 의료 제공 개체의 분산 세트로부터 수신된 입력에 적어도 부분적으로 기초하여 채워진다. 제1 예시의 방법은 상기 쿼리에 응답하여, 대상체 식별자의 세트를 수신하는 단계를 더 포함하며, 상 기 대상체 식별자의 세트 내 각각의 대상체 식별자는 대상체 식별자에 대응하는 대상체가 치료를 받았다고 지시 한다. 제1 예시의 방법은, 대상체 식별자의 세트의 각각의 대상체 식별자에 대해, 데이터 저장소의 데이터에 기 초하여, 대상체 식별자에 대응하는 대상체가 치료를 개시한 때를 결정하는 단계, 및 대상체 식별자와 연관된 하 나 이상의 레코드로부터, 치료의 결과를 지시하는 하나 이상의 메트릭, 및 하나 이상의 대상체 속성을 추출하는 단계를 더 포함하고, 하나 이상의 메트릭의 추출은 치료가 개시된 때에 적어도 부분적으로 기초하였고, 하나 이 상의 대상체 속성 각각은 레코드-대응 대상체의 특성 또는 의학적 검사의 결과를 반영한다. 제1 예시의 방법은 추출된 메트릭 및 추출된 대상체 속성에 기초하여 치료에 대한 다른 대상체의 예측 반응을 생성하는 단계, 및 예측 반응에 대응하는 결과를 출력하는 단계를 더 포함한다. 일부 실시예에서, 하나 이상의 데이터 프로세서 및 하나 이상의 데이터 프로세서 상에서 실행될 때, 상기 하나 이상의 데이터 프로세서로 하여금 여기에 개시된 하나 이상의 방법 중 일부 또는 전부를 수행하게 하는 명령을 포함하는 비일시적 컴퓨터 판독형 저장 매체를 포함하는 시스템이 제공된다. 일부 실시예에서, 비일시적 기계 판독형 저장 매체에 유형적으로 구현되며, 하나 이상의 데이터 프로세서로 하 여금 여기에 개시된 하나 이상의 방법 중 일부 또는 전부를 수행하게 하도록 구성된 명령을 포함하는 컴퓨터-프 로그램 프로덕트가 제공된다. 본 개시내용의 일부 실시예는 하나 이상의 프로세서를 포함하는 시스템을 포함한다. 일부 실시예에서, 시스템은 하나 이상의 데이터 프로세서 상에서 실행될 때, 상기 하나 이상의 프로세서로 하여금 여기에 개시된 하나 이상 의 방법 중 일부 또는 전부 및/또는 하나 이상의 프로세스 중 일부 또는 전부를 수행하게 하는 명령을 포함하는 비일시적 컴퓨터 판독형 저장 매체를 포함한다. 본 개시내용의 일부 실시예는 비일시적 기계 판독형 저장 매체 에 유형적으로 구현되며, 하나 이상의 데이터 프로세서로 하여금 여기에 개시된 하나 이상의 방법 중 일부 또는 전부 및/또는 하나 이상의 프로세스 중 일부 또는 전부를 수행하게 하도록 구성된 명령을 포함하는 컴퓨터-프로 그램 프로덕트를 포함한다. 채용된 용어 및 표현은 한정이 아니라 설명의 용어로 사용되었으며, 이러한 용어 및 표현을 사용함에 있어 도시 및 설명된 특징 또는 그 일부의 등가물을 배제하려는 의도는 없으며, 청구된 발명의 범위 내에서 다양한 수정이 가능하다는 것이 인정된다. 따라서, 청구된 바와 같은 본 발명이 실시예 및 선택적인 특징에 의해 구체적으로 개시되었지만, 여기에 개시된 개념의 수정 및 변형이 통상의 기술자에 의해 사용될 수 있으며 그러한 수정 및 변형이 첨부된 청구범위에 의해 정의된 본 발명의 범위 내에 있다고 간주됨을 이해해야 한다."}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "I. 개요 다발성 경화증은 다양한 유형의 발현, 징후 및 결과를 갖는 이질성 질환이다. 이러한 상황이 신경과 전문의가 치료 전략을 선택하는 데 어렵게 한다. 그러나 불행한 높은 유병률이 다차원적 분석을 지원하여 더 효과적인 치 료 전략의 선택을 알리기 위해 빅 데이터가 수집되고 분석될 수 있게 하는 툴을 제공한다. 대부분의 임상 과정 및 환자 속성이 복잡한 비-이진, 비-범주, 비-숫자 데이터에 대응하기 때문에 임상 데이터 의 빅 데이터 분석은 복잡하다. 따라서 이 데이터의 대부분은 쿼리 및 집계하기 어려운, 구조화되지 않은 데이 터(가령, 의사 기록 또는 방사선 전문의 보고서)로 표현된다. 복잡한 평가를 범주형 또는 숫자형 변수로 변환하 기 위해 의료 분야에서 약간의 노력이 있었지만, 이는 정보 손실을 초래할 수 있고 변환을 수행하는 행위자 간 에 일관성이 없을 수 있다. 또한, 신경과 전문의가 자주 평가하는 정보 유형은 많은 데이터 유형에 걸쳐 있다. 따라서 단일 대상체의 파일 을 검토하더라도, 파일 유형이 상이한 여러 파일을 열어 검토하는 경우가 많다. 일부 파일은 상이한 관점에서 반복적으로 수집되는 뇌 및/또는 척수의 다양한 가상 슬라이스 이미지를 포함할 수 있는 큰 MRI 데이터를 포함 할 수 있다. 신경과 전문의는 최근 기간(또는 스냅샷)에서의 파일의 모음으로부터 정보를 대상체에 대응하는 데 이터의 과거 모음으로부터의 대응하는 정보에 비교한 후 임의의 변화가 허용 가능한지 여부를 결정하려 시도할 수 있다. 특히, 현재의 치료 옵션 중 거의 아무 것도 MS의 진행을 완전히 멈추는 것으로 보고되지 않았다. 오히 려, 이들은 MS의 진행을 늦추는 것으로 보고된다. 따라서 신경과 전문의는 임의의 관찰된 변화가 상이한 치료가 제공되었을 때보다 더 두드러지는지 여부에 대한 가설을 세워야 한다. 본 명세서에 개시된 일부 시스템 및 방법은 부분적으로 정량적 다변량 분석에 기초하여 개인에 대한 치료가 선 택되는 개인화된 의료를 촉진하기 위해 MS 빅 데이터 세트를 구축하고 사용하도록 구성된다. 특히, 클라우드-기 반 애플리케이션은 사용자(가령, 의료 제공자, 방사선 전문의, 검사실 및/또는 대상체)가 대상체의 상태를 특성 화하는 입력을 제공할 수 있도록 하는 인터페이스를 제공할 수 있다. 인터페이스는 (예를 들어, 일부 또는 모든 유형의 정보에 대해) 정의된 구조에 대응하는 입력을 선택적으로 수신하도록 구성될 수 있다. 인터페이스를 통 해 제공된 필드 데이터는 구조를 식별할 수 있다. 예를 들어, 인터페이스는 장애 관련 정보가 특정 척도(예를 들어, 확장 장애 상태 척도)에 따른 점수를 포함함 및/또는 MRI 정보가 특정 유형의 병변의 수를 포함함(예를 들어, 특정 유형의 스캔에서 검출될 때 증대/비-증대)을 지시할 수 있다. 일부 경우에, 인터페이스는 덜 구조화된, 반-구조화된 또는 구조화되지 않은 데이터를 수신하도록 더 구성될 수 있다. 구조화되지 않은 데이터에는 (예를 들어) 의사 기록, 대상체의 텍스트 자체 평가 보고서 등이 포함될 수 있다. 구조화되지 않은 데이터는 대응하는 구조화된 데이터를 식별하도록 (가령, 자연어 처리 및/또는 키워드 검출을 사용해) 처리될 수 있다. 어떤 경우에는, 구조화되지 않은 데이터는 보조 정보로 사용되어 구조화되지 않은 형태로 유지된다. 예를 들어, 하나 이상의 정량적 MRI 메트릭을 수신하는 것에 추가로, 인터페이스는 MRI 이미지를 수용할 수 있다. MRI 이미지는 MRI 표준을 준수할 수 있지만, 데이터의 정확한 구성은 (예를 들어) 사 용된 기계의 유형과 선택한 스캔에 따라 다를 수 있다.클라우드-기반 애플리케이션은 여러 유형의 사용자에게 여러 유형의 인터페이스를 제공하도록 구성될 수 있다. 예를 들어, 제1 인터페이스는 의사가 이용할 수 있고 대면 평가, 사무실 내 평가, 처방 근거 등에 대응하는 입 력을 수신하도록 구성된 하나 이상의 페이지를 포함할 수 있고, 하나 이상의 제2 인터페이스는 검사실 및/또는 영상 설비에서 사용될 수 있으며 의학적 검사 결과(가령, 혈액 검사 결과, MRI 이미지, MRI 통계 등)를 수신하 도록 구성된 하나 이상의 페이지를 포함할 수 있으며, 제3 인터페이스는 대상체가 이용할 수 있으며 자체 평가 응답 또는 자체 평가를 수신하도록 구성된 하나 이상의 페이지를 포함할 수 있다. 예를 들어, 대상체 인터페이 스는 건강 관련 질문을 제시하고 대응하는 답을 수신하도록 구성될 수 있다. 클라우드-기반 애플리케이션은 클 라우드-기반 애플리케이션을 액세스하는 각각의 사용자에 대해 역할 및 권한을 추가로 검출할 수 있다. 다양한 권한을 통해 사용자는 특정 유형의 정보(가령, 특정 필드에 대응)를 입력하고, 특정 유형의 동작(가령, 데이터 처리)을 개시 또는 제어 및/또는 특정 유형의 데이터(가령, 특정 필드 및/또는 특정 대상체에 대응)를 볼 수 있 다. 빅 데이터 쿼리를 촉진하는 대상체-평가 데이터를 수집하는 것외에도, 클라우드-기반 애플리케이션은 하나 이상 의 컨텍스트 데이터 포인트를 자동으로 수집하거나 입력을 통해 수집할 수 있다. 예를 들어, 클라우드-기반 애 플리케이션은 사용자 컴퓨터가 위치한 관할 구역 및/또는 (가령, 사용자가 입력한) 대상체의 주소에 해당하는 관할 구역을 검출할 수 있다. 다른 예로서, 클라우드-기반 애플리케이션은 평가, 의학적 검사 또는 입력에 대응 하는 기간(가령, 날짜, 시간, 날짜 기간 및/또는 시간 기간)을 자동으로 검출하거나 입력을 통해 검출할 수 있 다. 클라우드-기반 애플리케이션은 특정 대상체에 대한 정보를 더 수신할 수 있다. 정보는 인구통계학적 정보, 의학 적-내력 정보, 고용 정보 등을 포함할 수 있다. 정보는 대상체의 복용 약물(들), 약물(들)의 복용 기간, 기간 동안 경험한 임의의 이상 반응, 및 가능하다면, 대상체가 약물 복용을 중단한 이유에 대한 지시자를 포함할 수 있다. 특정 대상체 정보는 사용자로부터의 입력, 전자 의료 기록, 자동 문자 인식 등을 통해 검출될 수 있다. 일부 예에서, 클라우드-기반 애플리케이션은 데이터를 처리하여, 각각의 대상체에 대해, 개별 시간 기간을 (예 를 들어) 대상체가 받고 있는 임의의 약물, 장애 수준/점수, MRI 통계 또는 특성, 웰-빙 지수, 증상 발현 및/또 는 이상 반응과 연관시키는 시계열 데이터를 구축할 수 있다. 일부 예에서, 이벤트 체인은 일련의 타임 스탬프 및 연관된 임상, 바이오마커, 의학적-검사 및/또는 자체 평가 메트릭을 포함하는 데이터를 기반으로 생성될 수 있다. 따라서, 이벤트 체인은 대상체가 받은 치료, 다양한 치료를 받은 기간, 치료 시간 기간 동안 수행된 임상 평가, 치료 시간 기간 동안 받은 하나 이상의 MRI의 결과, 치료 시간 기간 동안의 대상체 보고서 또는 자체 평 가를 식별할 수 있다. 클라우드-기반 애플리케이션은 (예를 들어) 주어진 치료의 효과에 대응하는 예측을 생성하고, 주어진 치료의 효 과를 예측하며, 예후를 예측하고, 및/또는 권장 치료를 식별하기 위해 대상체의 이벤트 체인을 사용할 수 있다. 예를 들어, 클라우드-기반 애플리케이션은 대상체의 이벤트 체인을 사용하여 빅-데이터 모집단에 부과할 하나 이상의 대응하는 필터를 식별, 하나 이상의 하위 모집단 클래스를 식별 및/또는 하나 이상의 최근접 이웃을 식 별할 수 있다. 일부 예에서, 이벤트 체인은 하나 이상의 인공 지능 모델(가령, 하나 이상의 훈련된 머신-러닝 모델)에 입력되어 하나 이상의 치료 사용의 효능 및/또는 결과를 예측하는 하나 이상의 출력을 생성할 수 있다. 예를 들어, 하나 이상의 모델 각각은 대상체를 현재 치료에서 다른 모델-대응 치료로 전환할 것이라는 예측에 대응하는 출력을 생성할 수 있다. 출력은 (예를 들어) 예측된 절대값 또는 장애 점수의 변화, 병변 부하, 강화 병변의 수의 합 등을 포함할 수 있다. 그런 다음 출력(들)에 기초하여 치료가 선택될 수 있다. 또 다른 예로서, 이벤트 체인은 주어진 치료를 받은 유사한 대상체의 세트를 식별하는 데 사용될 수 있다. 유사 한 대상체는 주어진 대상체의 다차원적 이벤트 체인과 주어진 치료를 받은 다른 대상체의 세트의 각각의 대상체 사이의 거리 메트릭을 계산하고 특정 임계값 미만의 거리 메트릭과 연관된 다른 대상체의 세트의 서브세트를 식 별함으로써, 식별될 수 있다. 주어진 치료에 대한 주어진 대상체의 반응에 대한 예측이 상기 주어진 치료에 대 한 대상체의 서브세트의 반응(가령, 기간 내의 장애 진행의 평균 또는 중앙값, 기간 내 재발의 횟수 평균 또는 중앙값, 기간 내의 새 병변 수 평균 또는 중앙값)에 기초하여 정의될 수 있다. 인터페이스가 주어진 대상체와 연관하여 이루어진 각각의 치료 선택에 대해, 치료의 식별자(가령, 이름), 치료 가 개시된 날짜 또는 시간 기간, 치료와 연관된 대상체가 경험하는 임의의 이상 반응(가령, 그리고 그러한 부정 적 이벤트를 경험한 때), 및/또는 치료가 종료된 날짜 또는 기간을 식별하는 입력을 수신하도록 구성될 수 있다. 대상체의 이벤트 체인은 치료 정보의 일부 또는 전체를 반영하도록 업데이트될 수 있다. 일부 예에서, 주어진 대상체(가령, 대상체의 이벤트 체인)와 연관된 데이터는 하나 이상의 대응하는 대상체를 식별하는 데 사용될 수 있다. 대응하는 대상체(들)와 주어진 대상체는 서로 유사하거나 및/또는 하나 이상의 동 일하거나 유사한 속성과 연관될 수 있다. 예를 들어, 대응하는 대상체 각각은 대상체가 받고 있거나 받을 예정 이거나 고려 중인 것과 동일한 특정 치료를 받았을 수 있다. 대응하는 대상체와 주어진 대상체는 유사하거나 동 일한 유형의 다발성 경화증, 유사하거나 동일한 장애 점수, 유사하거나 동일한 치료 이력 등과 연관될 수 있다. 대응하는 대상체 세트의 정의에 영향을 미칠 속성은 사용자 입력을 통해 정의되거나, 모델에 의해 지정 또는 학 습될 수 있다. 일례로, 클라우드-기반 애플리케이션의 사용자는 필드 제약조건을 선택하고 대상체를 식별함으로써(완전히 걸을 수 있는 재발-완화형 다발성 경화증이 있는 대상체가 최근에 인터페론 베타 치료에서 오크렐리주맙 치료로 전환 되었을 수 있음) 쿼리를 개시할 수 있다. 인터페론 베타 치료에서 오크렐리주맙 치료로 전환될 때 또한 완전히 걸을 수 있으며 재발-완화 다발성 경화증으로 진단되었다는 필드 제약조건이 충족되는 다른 대상체를 식별하기 위해 데이터 저장소에 쿼리될 수 있다. 이 예시에서 필드 제약조건은 대상체의 실제 속성에 대응하지만 일부 상 황에서는 하나 이상의 제약조건이 잠재적 속성(가령, 대상체에 대해 고려 중인 치료)에 대응할 수도 있다. 특히, 이 쿼리는 주어진 대상체와 현재 연관되어 있는 다양한 특성과 이전에 연관되었던 대상체를 식별하기 위 해 역방향으로 볼 수 있다. 후향적 쿼리 수행을 촉진시키기 위해, 클라우드-기반 애플리케이션은 각각의 대상체에 대한 (치료가 개시, 변경 또는 종료되는) 각각의 치료 전환 지점에 대한 스냅샷을 생성 및 저장할 수 있다. 스냅샷은 마지막으로 보고된 정보 및/또는 계산된 정보를 포함할 수 있다. 스냅샷은 본 명세서에 기재된 필드 및/또는 정보, 가령, 가장 최 근의 치료, 하나 이상의 MRI 통계, 하나 이상의 보행 메트릭(가령, 대상체가 지팡이를 사용하는지 여부, 대상체 가 양측 보행 지지대를 사용하는지 여부, 대상자가 보행기를 사용하는지 여부 및/또는 대상자가 휠체어를 사용 하는지 여부), 다발성 경화증의 유형 등을 포함할 수 있다. 예를 들어 대상체가 2017년7월에 약물을 변경한 경 우, 다른 많은 분야에 대한 정보가 동시에 제공되지 않았을 수 있다. 그러나, 이전에 수신된 정보가 쿼리되어 (예를 들어) 가장 최근에 처방된 치료가 2016년01월이었고 핑골리모드(fingolimod)였으며, 2017년04월에 시행된 가장 최근의 MRI가 관련 MRI 통계 세트에 대응하며, 2017년03월 내원에 대응하는 데이터 입력이 대상체가 지팡 이를 사용하고 있었음을 지시하며, 2008년09월 가장 최근 진단은 광석 재발-완화형 다발성 경화증이었음을 검출 할 수 있다. 따라서 이 정보는 기본적으로 2017년07월 스냅샷으로 가져와진다. 따라서, 스냅샷은 동시에 관찰될 필요가 없는 제약조건을 사용하여 후향적 다차원 쿼리를 수행하는 것을 촉진시 킬 수 있다. 각각의 대응하는 대상체에 대해, 치료가 개시된 날짜가 시간 0으로 설정될 수 있다. 대응하는 대상 체 및 후속 시점(가령, 대응하는 대상체가 특정 치료의 사용을 종료한 날짜까지 포함)과 연관된 하나 이상의 데 이터 포인트가 수집될 수 있다. 후속 데이터 포인트는 (예를 들어) 이동성 또는 보행 수준, 장애 수준, 하나 이 상의 MRI 메트릭, 이상 반응 지시자 및/또는 임의의 치료-종료 지시자를 나타낼 수 있다. 그런 다음 후속 데이 터 포인트에 기초하고 잠재적으로 스냅샷 데이터에 기초하여 통합 통계가 생성될 수 있다. 예를 들어, 통합 통계는 대응하는 대상체가 특정 치료를 유지했던 기간의 분포를 포함할 수 있다. 또 다른 예로 서, 통합 통계는 각각의 기간에 대해, 대응하는 대상체에 걸쳐 검출된 다수의 새 병변, 다수의 새로운 강화 병 변, 특정 유형의 병변의 총 부피 변화, 장애 수준의 변화, 보행 수준의 변화, 웰빙 지수의 변화, 이상 반응의 존재, 유병률 또는 심각성 및/또는 재발 확률 또는 수를 특징화하는 통계(가령, 중앙값, 평균 또는 모드)를 포 함할 수 있다. 어떤 치료후 정보가 추적될지는 쿼리에 대응하는 입력에 기초하거나 지정 구성에 기초하여 결정 될 수 있다. 일부 경우에, 대응하는 대상체는 둘 이상의 그룹으로 분할될 수 있고, 각각의 그룹에 대해 통합 통계가 생성될 수 있다. 예를 들어, 제1 그룹은 적어도 지정 시간, 가령, 18개월 동안 치료를 계속 받은 대응하는 대상체를 포 함할 수 있고, 제2 그룹은 지정 시간 전에 치료를 중단한 대응하는 대상체를 포함할 수 있다. 또 다른 예로서, 제1 그룹은 적어도 제1 기간 동안(예를 들어, 적어도 6개월 동안) 치료를 받고 제2 기간에 걸쳐(가령, 12개월 내에) 확장 장애 상태 척도(EDSS) 점수가 동일하게 유지되거나 1.5점 만큼 적게 변경된 대응하는 대상체를 포함 할 수 있고, 제2 그룹은 적어도 제1 기간 동안 치료를 받았고 제2 기간에 걸쳐 EDSS 점수가 1.5 이상만큼 변경 된 대응하는 대상체를 포함할 수 있다. 어느 하나의 예와 관련하여, 그룹 각각에 대해, 생성된 통합 통계는 그룹 내 대상체에 대한 기준(시간 0)에서의 정보, 가령, 인구통계학적 정보(가령, 나이 분포, 성별 분포), 의료-병력 정보(가령, 동반 질환의 유병률), 기 준 MRI 통계(가령, 병변 부하, 총 병변 수, 강화 병변 수) 및/또는 장애 메트릭(가령, EDSS 점수 또는 보행 수 준)을 나타낼 수 있다. 따라서, 통합 통계는 어떤 유형의 대상체 속성 및/또는 맥락이 치료 효능 및/또는 치료중에 긍정적인 예후를 예측할 수 있는지를 예측하는 데 사용될 수 있다. 의료 제공자 또는 대상체는 대상체의 예측 및 특정 속성을 사용하여 치료를 선택할 것인지 또는 치료를 계속 사용할 것인지 결정할 수 있다. 일부 예 에서, 효능 및/또는 예후의 예측은 다중 치료 전략의 각각에 대해 생성될 수 있고(예를 들어, 상이한 대응하는 대상체 모집단과 연관됨), 예측에 기초하여 대상체에 대한 치료가 선택될 수 있다. 일부 예에서, 주어진 대상체가 치료를 개시한 후, 하나 이상의 데이터 포인트가 주어진 대상체에 대해 추적될 수 있고 대응하는 대상체 또는 대응하는 대상체 내의 하나 이상의 그룹에 대한 통합 통계와 비교될 수 있다. 예 를 들어, 치료 개시 4개월 후, T2 병변 부하의 변화, EDSS 점수의 변화 및 강화 병변의 수가 주어진 대상체에 대해 결정될 수 있다. 모델(가령, 분류기(classifier)) 또는 다변량 분석이 사용되어 대상체-특정 데이터 포인 트가 \"반응군\" 모집단 서브-그룹 또는 \"비반응군\" 모집단 서브-그룹(가령, 반응군 서브-그룹이 치료의 더 긴 사 용, 더 작은 MRI-기반 진행, 더 작은 장애 진행과 연관된 경우)에 더 강력하게 정렬된다. 의료 제공자 또는 대 상체는 예측을 사용하여 대상체에 대한 치료 전략을 변경할지 또는 동일하게 고려할지를 결정할 수 있다. 일부 예에서, 주어진 대상체와 연관된 증상 세트, 장애 점수 및/또는 검사 결과 세트에 대응하는 제약조건을 포 함하는 쿼리가 수행될 수 있다. 증상 세트, 장애 점수 및/또는 검사 결과는 다발성 경화증 진단을 뒷받침하기에 불충분할 수 있다(그러나 반드시 그러한 것은 아니다). 유사한 증상, 장애 점수 및/또는 검사 결과를 가진 다른 대상체의 모집단이 식별될 수 있다. 쿼리는 부정적인 제약조건(가령, 하나 이상의 다른 증상이 경험되지 않음을 나타냄)을 추가로 부과하기 위해 수행될 수 있다. 모집단은 사용된 치료 접근방식을 기반으로 세분될 수 있다. 모집단 내의 각각의 그룹에 대해, (예를 들어) 다발성 경화증의 다른 하위 유형 또는 다발성 경화증 진단으로 (가령, 시간의 함수로서 또는 기간 내에) 전환할 가능성, 장애 점수의 변화(가령, 기간 내에서 더 나쁜 점수가 발생할 시간 또는 확률의 함수로서의 변화의 중앙값), 시간의 함수로서 치료 변경 확률 등을 나타내는 통계가 생성될 수 있다. 그런 다음 의료 제공자가 다른 하위 유형으로 전환될 비교적 낮은 가능성, 장애 점수의 비교적 적은 변화(또는 변화 없음), 및/또는 치료 변경의 비교적 작은 확률과 연관된 치료를 권장할 수 있다. 클라우드-기반 애플리케이션은, 다양한 관할구역에 걸친 데이터-프라이버시 규칙에 의해 부과되는 제약조건을 만족하면서, 개체가 하나 이상의 데이터 레코드 또는 대상체(가령, 의학적 증상을 경험하고 있거나 및/또는 의 학적 병태의 진단의 가능성을 갖거나 확정된 대상체)를 특징짓는 다른 정보를 외부 개체와 송신 및/또는 수신할 수 있게 하는 데이터-프라이버시 프로토콜을 구현하도록 동작할 수 있다. 클라우드-기반 애플리케이션이 데이터 -프라이버시 위반을 알고리즘에 따라 평가하고 데이터 레코드를 자동으로 생략하거나, 난독화하거나, 그 밖의 다른 방식으로 수정하여 데이터-프라이버시 규칙을 준수할 수 있다. 예를 들어, 클라우드-기반 애플리케이션은 대응하는 대상체의 세트와 연관된 데이터에 기초하여 생성된 통합 통계가 식별 정보를 노출할 위험이 있는지 여 부를 결정하도록 구성될 수 있다. 그러한 정보는 (예를 들어) 대응하는 대상체를 식별하기 위한 제약조건이 특 히 협소하거나, 대응하는 대상체의 모집단(또는 이의 서브-그룹)의 크기가 특히 작거나, 사용되거나 제공되는 통합 통계의 수가 특히 높을 때 등, 노출될 가능성이 더 높을 수 있다. 예를 들어, 쿼리가 다른 세 가지 제약조 건과 함께 우편 번호 제약조건을 포함하고 대상체의 결과적인 모집단이 단 3명의 대상체만 포함하는 경우, 모든 3명의 대상체로부터의 데이터에 기초하여 생성된 통계의 제공조차 개인적으로 식별 가능한 정보를 노출시킬 위 험이 있을 수 있다. 쿼리에 응답하는 것이 개인 식별 정보를 노출할 위험이 있는 것으로 결정되면, 클라우드-기반 애플리케이션은 사용자가 데이터에 표현될 대상체에 대한 정보를 볼 권한이 있는지 여부를 결정할 수 있다. 그렇지 않은 경우, 클라우드-기반 애플리케이션은 쿼리를 거부하거나 덜 제한적인 제약조건을 포함하도록 쿼리를 잠재적으로 수정 할 수 있다. 본 개시의 일부 실시예는 데이터-프라이버스 규칙 위반 없이 외부 개체와 대상체 정보를 교환하도록 구성된 클 라우드-기반 애플리케이션을 제공함으로써 종래의 시스템에는 없는 기술적 이점을 제공한다. 클라우드-기반 애 플리케이션은 대상체 및 다른 사용자에 걸쳐 콘텐츠 및 포맷이 비교적 일관된 데이터 세트에 도달하기 위해 데 이터의 선택적 수집 및 처리를 촉진시킨다. 데이터 표현은 제약조건을 식별할 수 있는 필드가 식별 가능할 수 있다는 점에서 데이터 쿼리를 더욱 촉진할 수 있다. 그런 다음 대상체 모집단에 대한 쿼리는 자연어 처리 쿼리 를 수행하는 대신 논리 피연산자 및/또는 기본 검색을 활용하여 수행될 수 있다. 또한, 대상체 레코드를 이벤트 스트림으로 변환하는 것 및/또는 특정 중요한 이벤트에서 스냅샷을 생성하는 것이다양한 데이터 포인트가 시간 적으로 정렬되지 않은 경우 쿼리 수행을 촉진시킬 수 있다. 머신 러닝 모델(가령, 분류기)과 모집단 데이터를 사용하면 치료 효능 및/또는 내약성에 영향을 미치는 예측 요인의 개선을 촉진시킬 수 있다. 위의 개시내용은 다발성 경화증의 진단 및 치료를 촉진시키는 것과 관련하여 지능형 기능을 수행하도록 구성된 클라우드-기반 애플리케이션을 기술하지만, 클라우드-기반 애플리케이션은 임의의 질병, 병태, 연구 분야 또는 장애, 비제한적 예를 들어, 종양학, 가령, 폐, 유방, 결장직장, 전립선, 위, 간, 자궁경부(경부), 식도, 방광, 신장, 췌장, 자궁내막, 구강, 갑상선, 뇌, 난소, 피부 및 담낭의 암; 고형종양, 가령, 육종 및 암종, 면역계의 암, 가령, 림프종(가령, 호지킨(Hodgkin) 또는 비-호지킨), 및 혈액의 암(혈액암) 및 골수 암, 가령, 백혈병(가 령, 급성 림프구성 백혈병(ALL) 및 급성 골수성 백혈병(AML)), 림프종 및 골수종에 대한 잠재적 진단 또는 잠재 적 치료를 식별하도록 구성될 수 있다. 추가 장애에는 혈액 장애, 가령, 빈혈, 출혈 장애, 가령, 혈우병, 혈전, 안과 장애, 가령, 당뇨병성 망막병증, 녹내장 및 황반 변성, 신경계 장애, 가령, 파킨슨병, 척수성 근위축증, 헌팅턴병, 근위축성 측삭 경화증(ALS) 및 알츠하이머병, 자가면역 질환, 가령, 다발성 경화증, 당뇨병, 전신성 홍반성 루푸스, 중증 근무력증, 염증성 장 질환(IBD), 건선, 길랑-바레 증후군, 만성 염증성 탈수초 다발신경병 증(CIDP), 그레이브스병, 하시모토병, 습진, 혈관염, 알레르기 및 천식이 있다. 다른 질병 및 장애의 비제한적 예를 들면, 신장 질환, 간 질환, 심장 질환, 뇌졸중, 위장 질환, 가령, 셀리악병, 크론병, 게실 질환, 과민성 장 증후군(IBS), 위식도 역류 질환(GERD) 및 소화성 궤양, 관절염, 성병, 고혈압, 세균 및 바이러스 감염, 기생충 감염, 결합 조직 질환, 셀리악병, 골다공증, 당뇨, 루푸스, 중추 및 말 초 신경계 질환, 가령, 주의력 결핍/과잉행동 장애(ADHD), 강경증, 뇌염, 뇌전증 및 경련, 말초 신경병증, 뇌수 막염, 편두통, 척수병증, 자폐증, 양극성 장애 및 우울증이 있다."}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "II. MS 하위 유형, 진단 프로토콜, 관련 의학적 검사, 진행 평가 및 사용 가능한 치료의 요약 II.A. 다발성 경화증의 유형 의료계는 치료 선택에 영향을 미치고 예후를 알릴 수 있는 여러 유형의 MS를 정의했다. II.A.1. 재발-완화형 다발성 경화증(RRMS) 사례의 85-90%에서, 다발성 경화증은 먼저 재발-완화형 다발성 경화증(RRMS) 유형으로 나타난다. RRMS 환자는 새로운 신경 증상이 나타나거나 오래된 증상이 악화되는 별개의 악화(또는 \"재발\")를 경험한다. 지배적인 기전 가설은 악화가, 자가 반응성 백혈구가 말초에서 혈액-뇌 장벽을 가로질러 중추 신경계의 뉴런 돌출부에 있는 수 초 보호 층을 공격하는 자가면역 캐스케이드(autoimmune cascade)의 결과라는 것이다. 자가면역 캐스케이드는 주로 T 세포를 포함하지만 (가령, 대식세포를 모집, 보체 경로를 활성화 및/또는 T 세포 분화에 영향을 미치는 공동자극 분자를 생성하기 위해) 일부 B 세포도 포함하는 것으로 여겨진다. 또 다른 이론은 면역 조절 기전이 제대로 작동하지 않는 수초 특이적 T 세포에 의해 공격이 수행된다는 것이다. 각각의 악화는 하나 이상의 생리학적 증상을 유발할 수 있다. 생리학적 증상은 8가지 기능계 중 하나와 연관된 증상일 수 있다. 기능 시스템 및 선택 관련 증상에는 추체계(증상: 근육 약화 또는 사지 운동 곤란), 소뇌계(균 형 문제 또는 떨림), 뇌간계(말하기 또는 연하 곤란), 감각계(무감각 또는 따끔거림), 장 또는 방광계(요실금), 시각계(흐릿함 또는 실명), 대뇌계(기억력, 멀티태스킹 또는 사고력 결핍) 등이 있다. 악화들 사이에 증상이 부 분적으로 또는 완전히 사라질 수 있다. 재발로부터의 완전한 회복은 재발이 (나중 기간에 비해) 진단 날짜에 더 가까이 발생했을 때 더 가능성이 높다. 질환의 초기에 재발은 일반적으로 추체계, 소뇌계, 감각계, 또는 시각 기능계와 관련된다. 질환의 후기에 재발은 종종 뇌간계, 장 또는 방광계, 또는 대뇌 기능계와 관련된다. II.A.2. 활성 또는 비활성 이차 진행형 다발성 경화증(SPMS) 치료하지 않고 방치하면 RRMS의 약 90%가 25년 이내에 이차 진행형 다발성 경화증(SPMS)으로 전환될 것이다(약 50%가 10년 이내에 전환됨). 어떤 정확한 지표가 RRMS에서 SPMS로의 전환을 표시하는지에 대해 의료계에서 일반 적인 합의가 없다. 또한 증상이 있는 재발 및 염증을 계속 경험하는 SPMS 환자는 활성 SPMS를 갖는 것으로 간주되는 반면, 재발이 없는 환자는 비활성 SPMS를 갖는 것으로 특성화된다. 그러나, 그럼에도, 이들 환자는 일반적으로 신경 손상 또 는 손실의 결과로 기능의 점진적이고 일반적으로 단조로운 저하를 경험한다. 달리 말하면, SPMS 환자에서 관찰 되는 저하는 일반적으로 별개의 면역학적 공격으로 인한 것이 아니라 주로 신경변성으로 인한 것으로 이해된다. II.A.3. 일차 진행형 다발성 경화증(PPMS) 일부 MS 환자는 RRMS 형태로 진단된 적 없이 초기에 일차 진행형 다발성 경화증(PPMS)으로 진단된다. SPMS와 마 찬가지로, 이 환자들은 일반적으로 증상과 뇌 손상의 점진적이고 지속적인 악화를 경험한다. SPMS와 PPMS 모두, 수개월에서 수년에 걸쳐 점진적인 기능 손실이 발생하여 감지하기 어려울 수 있다. PPMS가 있는 대부분의 사람 들은 처음에 운동 증상을 나타낸다(반면 감각 및/또는 시각 증상은 RRMS에 더 널리 퍼져 있음). PPMS 진단의 지배적인 기준은 기능계 손상이 점진적으로 그리고 개별적인 재발과 독립적으로 발생한다는 것이다(점진적인 악화 는 재발에 의해 유발된 어떠한 잔여 손상의 결과가 아님). II.A.4. 진행-재발형 다발성 경화증 일부 사람들은 MS 진단 후 증상 재발 및/또는 병변 강화를 경험한다. 이러한 경우 환자는 진행형 MS의 초기 진 단이 폐기되지 않으므로 진행-재발형 MS로 진단된다. II.A.5. 임상적으로 고립된 증후군(CIS) 임상적으로 고립된 증후군(CIS)이 다발성 경화증의 하위 유형으로 간주되지만, CIS는 실제로 다발성 경화증과 구별된다. CIS의 진단은 대상체가 다른 의학적 병태(가령, 뇌졸중 또는 라임병)로 인한 것이 아니라 시간적으로 고립된 적어도 24시간 동안 첫 번째 신경학적 증상을 경험했음을 나타낸다. 대상체가 하나 이상의 이전의 다른 신경학적 증상을 회상하거나 MRI가 오래된(비-강화) 병변을 식별하는 경우, 대상체는 CIS가 아닌 다발성 경화증 으로 진단되어야 한다. CIS가 있는 대상체는 후속적으로 추가 증상을 경험하고 다발성 경화증 진단을 받을 수도 있고 그렇지 않을 수도 있다. CIS 환자는 선택된 다발성 경화증 약물을 받을 수 있으며, 이는 대상체가 다발성 경화증으로 진단될 확률 을 감소시키거나 시간을 연장할 수 있다. II.B. 다발성 경화증 진단 환자가 의료 제공자에게 증상을 보고하고, 의료 제공자가 수행한 기능 평가가 다발성 경화증 환자로 진단할지 여부를 결정할 때 및/또는 특정 하위 유형의 다발성 경화증 환자를 진단할 때 매우 관련이 있다. 그러나 여러 다른 의학적 검사 결과가 진단에 큰 영향을 미칠 수 있다. II.B.1. 다발성 경화증 진단에 잠재적으로 유용한 의학적 검사 II.B.1.a. 자기 공명 영상 자기 공명 영상(MRI) 기계는 강한 자기장을 생성하는 대형 자석을 포함한다. 이 장은 신체 내 양성자를 장과 정 렬되게 한다. 공명-주파수 무선 주파수(RF) 장은 양성자가 자기장에 대해 평형 상태에서 벗어나도록 한다. RF 장이 꺼지면 양성자는 자기장과 재정렬하면서 에너지를 방출한다. MRI 기계는 이 에너지 방출을 측정하기 위한 수신 코일을 포함한다. 상이한 유형의 생물학적 구조는 상이한 에너지-방출 프로필을 도출할 것이다(가령, 평형 상태로 돌아가는 데 경과된 시간 식별). 두 가지 작동 설정은 반복 시간과 에코 시간을 포함한다. 반복 시간은 연속적인 RF 펄스 사이의 시간이다. 반복 시간이 길면 모든 양성자가 다음 펄스 전에 자기장과 재정렬될 수 있 지만 반복 시간이 짧으면 많은 양성자가 부분적으로만 재정렬된다. 에코 시간은 양성자에 의해 생성된 신호가 측정되는 시간을 나타낸다. 에코 시간이 길수록 회색 및 백색 물질의 양성자가 위상을 벗어날 가능성이 높아져 신호가 더 길어질 수 있다. 한편, 유체는 이와 관련하여 덜 민감하므로 신호가 더 강하게 유지된다. MRI 영상은 T1-강조 영상(T1 영상), T2-강조 영상(T2 영상) 또는 FLAIR 영상을 포함할 수 있다. T1 이미지는 짧 은 에코 시간(가령, 14ms)과 짧은 반복 시간(가령, 500ms)에 대한 응답으로 생성된다. T1 이미지에서, 백질(가 령, 축삭)은 밝고, 회백질(가령, 신경 세포체 및 수상돌기)은 회색이며, 척수는 회색이고, 뇌척수액(CSF)은 어 둡고, 염증은 어둡다. 블랙홀(black hole)은 T1 이미지에서 저조도(어두운) 영역으로 나타난다. 조영제(가령, 가돌리늄)를 대상체에게 투여할 때, 혈액-뇌 장벽이 최근에 파괴된 경우에만 이 장벽을 통과할 수 있으며 최근 에 형성된 병변으로 누출될 수 있다. T1 영상은 이 병변을 밝은 영역으로 묘사할 것이다. T2 영상은 긴 에코 시간(가령, 90ms) 및 긴 반복 시간(가령, 4000ms)에 응답하여 생성된다. T2 영상에서, 백질 이 짙은 회색이고, 회백질이 밝은 회색이며, 척수가 밝은 회색이고, CSF가 밝고, 염증이 밝다. 따라서 T2 영상 은 새로운 및 오래된 병변(밝게 나타날 것임)을 검출하는 데 사용될 수 있다. FLAIR 영상은 더 긴 에코 시간(가 령, 114ms)과 더 긴 반복 시간(가령, 9000ms)에 응답하여 생성된다. FLAIR 영상에서, 백질이 짙은 회색이고, 회 백질이 밝은 회색이며, 척수가 밝은 회색이고, CSF가 어둡고, 염증이 밝다. FLAIR 영상은 T2 영상에 비해 CSF에 인접한 병변을 더 잘 볼 수 있다. 뇌 및/또는 척수의 MRI 영상이 사용되어, 다발성 경화증의 진단을 촉진시키거나, 특정 유형의 다발성 경화증의 진단을 촉진시키거나, 대상체에서 다발성 경화증의 진행을 특성화하는 것을 촉진시키거나, 치료가 대상체를 효 과적으로 치료하는 정도를 특성화하는 것을 촉진시키거나, 및/또는 대상체에 대한 치료 전략을 변경할지 여부를 결정하는 것을 촉진시킬 수 있다. 병변의 수, 위치, 크기 및 형태가 이들 결정 중 하나 이상에 영향을 줄 수 있다. 예를 들어, \"도슨 핑거(Dawson fingers)\"는 RRMS 환자에서 흔히 발생하는 병변이다. 도슨 핑거는 뇌의 뇌실 기반 정맥(심부 수질 정맥) 근처에 위치한 타원형의 복수의 병변이다. 병변은 어떠한 CNS 백질에서도 나타날 수 있지만 다발성 경화증 병변은 뇌실주위 백질, 소뇌, 뇌간 및 척수에서 자주 발생한다. MRI 분석은 종종 MRI 이미지가 임의의 조영제 강화 병변을 묘사하는지 여부를 결정하는 것을 포함하는데, 그러 한 병변은 일반적으로 대상체의 다발성 경화증이 최근에 활성이었음을 나타내기 때문이다. T2-강조 병변은 또한 총 병변 부피를 측정하는 데 자주 사용된다. 질환 진행 초기(가령, CIS 또는 RRMS)에서 측정된 T2 질환-부담 메 트릭은 대상체의 장기 장애 및/또는 질환 진행에 대한 정보를 제공할 수 있다. 또한, MRI는 (예를 들어, 척수의 분절에서의) 단면적 또는 (예를 들어, 뇌의) 체적을 식별하는 데 사용될 수 있 으며, 이는 대상체에서의 위축 정도를 추정하는 데 사용될 수 있다. 위축은 대상체의 최근 MRI에 기초하여 생성 된 면적/체적 메트릭을 대상체의 더 오래된 MRI에 기초하여 생성된 것과 비교함으로써 추정될 수 있다. 위축은 또한 대상체의 최근 MRI에 기초하여 생성된 면적/체적 메트릭을 비교 가능한 모집단에 기초하여 생성된 통계와 비교함으로써 추정될 수 있다. 위축 통계는 MS 진단 및/또는 치료 결정과 관련된 결정을 알리는 데 사용될 수 있다. 이하에서 더 설명될 바와 같이, 다중 해부학적 영역에서의 병변의 존재 및/또는 병변의 시간 분리된 등장은 다 발성 경화증 질환을 나타낸다. 상이한 시점에서 수집된 MRI들을 비교하거나 적어도 하나의 병변이 조영 증강되 고(최근 염증을 나타냄) 적어도 하나의 병변이 조영 증강되지 않음을 검출함으로써, 병변의 시간-분리된 등장은 검출될 수 있다. II.B.1.b. 뇌척수액 분석 다발성 경화증이 있는 대부분의 대상체(및 다른 염증성 의학적 병태를 갖는 많은 대상체)의 뇌척수액(CSF)은 일 반 모집단에 비해 상대적으로 높은 농도의 면역글로불린 G(IgG)를 포함한다. IgG는 다발성 경화증의 2차 효과인 것으로 보이지만 여전히 유용한 바이오마커를 제공한다. 따라서, CSF의 분석은 다발성 경화증의 진단 단계에서 자주 수행된다. CSF는 척수 천자를 통해 대상체로부터 수 집된다. 하나 이상의 실험실 검사(가령, 단백질 전기영동, 웨스턴 블롯 또는 등전점 초점 및 은 염색의 조합)는 각각의 CSF 샘플 및 잠재적으로 혈청 샘플(가령, 희석된 혈청 샘플)에서 단백질을 검출하기 위해 수행된다. CSF에서 IgG 밴드를 검출하는 것은 다발성 경화증 진단과 일치한다. 추가로 또는 대안으로, CSF 내 추가 밴드와 함께 CSF 및 혈청 내 올리고클론성 밴드를 검출하는 것이 또한 다발성 경화증 진단과 일치한다. 이들 검출 중 임의의 것이 CIS를 갖는 대상체가 임상적으로 명확한 MS로 전환될 것인지 여부를 추가로 예측한다. IgG CSF 지수는 혈청 중 알부민에 대한 IgG의 비에 비교되는 CSF 내 알부민에 대한 IgG의 비로 정의된다. 1보다 큰 값은 중추 신경계가 IgG를 생성하고 있음을 나타낸다. IgG CSF 지수는 또한 IgG 합성 속도를 생성하는 데 사 용될 수 있다. II.B.1.c. 시각적 유발 전위 축삭의 수초화는 활동 전위가 축삭을 따라 이동하는 속도를 증가시킨다. 따라서, 수초 코스팅이 염증성 다발성 경화증 공격을 통해 공격을 받으면 후속적으로 신경 충동의 전도가 느려질 수 있다. 다발성 경화증의 진단에 도 움이 될 수 있는 한 가지 검사는 활동 전위를 유발하고 이의 전파 속도를 측정하는 것이다. 일반적으로, 이 평 가를 위해, (가령, 후두 피질에서의) 뇌 신호가 비침습적으로 (가령, 뇌파 검사를 통해) 기록되는 동안 특정 시 각적 자극(가령, 이진, 동적 바둑판)을 제시함으로써 전위가 유발된다. 그러나 청각 또는 체성 감각 자극이 대 안으로 사용될 수 있다. 유발 전위는 두 개의 음의 피크와 (두 개의 음의 피크 사이의) 한 개의 양의 피크를 포 함한다. 이들 피크 각각의 크기 및/또는 시간은 다발성 경화증의 진단 및/또는 예후에 정보가 될 수 있다. 예를 들어, 시신경염이라고 하는 다발성 경화증의 증상은 양의 피크의 손실 및/또는 고도로 감쇠된 반응을 초래할 수 있다. II.B.2. 다발성 경화증 진단에 사용되는 기준 대상체가 다발성 경화증을 가지고 있는지 여부를 확실하게 결정하는 단일 검사 또는 단일 평가는 없다. 어떤 경 우에는, 단일 검사 결과(가령, MRI 이미지의 세트)가 다발성 경화증 진단에 충분할 수 있지만, 해당 검사 결과 가 대상체와 상황에 따라 신뢰할만하게 결정적이지 않다. 많은 의료 제공자가 임상의가 관찰된 이상에 대한 잠재적인 다른 원인을 배제할 검사를 처방하고 분석을 수행한 다는 점에서 다발성 경화증의 진단을 배제의 진단으로 특징짓는다. 예를 들어, 많은 신경학적 증상 및/또는 MRI 결과가 감염성 질환(가령, 라임병), 척수 압박, 비타민 B12 결핍 또는 비-MS 염증성 탈-수초 질환(가령, 유육종 증, 전신성 홍반성 루푸스, 신경척수염 또는 급성 파종성 뇌척수염)으로 설명될 수 있다. 그러한 대체 설명이 확인되지 않으면 다발성 경화증의 진단이 적절하다. 불행히도, 배제 진단은 빠른 진단이 아니다. 대상체가 다양한 검사를 받고 검사 결과를 기다리고 의료 제공자의 평가를 기다리는 동안, 다발성 경화증이 계속 진행될 가능성이 있다. 이러한 상황을 고려하기 위해 다양한 프로 토콜 및 질환 특성화가 시도되었다. 예를 들어, 다발성 경화증의 진단을 위한 대부분의 기준은 모든 잠재적인 대체 원인을 배제하는 것에 의존하지 않으며(일부 사람들은 다발성 경화증 진단 후 몇 년이 지난 후 실제로 다 른 의학적 병태를 가지고 있음을 발견할 수 있지만), 게다가, 임상적으로 고립된 증후군(CIS)의 확립으로 의사 들은 확인된 다발성 경화증 진단에 아직 도달하지 않았음에도 불구하고 진행을 늦출 수 있는 일부 다발성 경화 증 약물을 처방할 수 있었다. II.B.2.a. 맥도날드 기준 다발성 경화증을 진단하기 위한 지배적인 기준이 맥도날드 기준(McDonald Criteria)이다. 이 기준의 토대는 의 사가 일반적으로 다발성 경화증을 가진 대상체를 진단하기 위해 공간과 시간의 분리에 대한 증거를 가지고 있어 야 한다는 것이다. 공간의 분리는 신체의 상이한 부분 또는 상이한 기능계에 영향을 미치는 증상 또는 중추 신 경계의 상이한 부분에 존재하는 병변에 대응할 수 있다. 시간의 분리는 상이한 시점에서 수행되는 여러 평가(가 령, 여러 MRI 또는 여러 임상/증상 평가)를 통해 또는 일부 조영-증강 병변(가령, 최근 염증을 나타냄) 및 일부 비-증강 병변(가령, 최근에 형성되지 않았음을 나타냄)을 검출함으로 검출될 수 있는 상이한 시점에 나타나는 증상 및/또는 병변에 대응할 수 있다. 맥도날드 기준은 다발성 경화증 진단에 자주 사용되는 표준으로 떠오르고 있다. 이 기준에 의거해, 다음 상황 중 어느 하나에 해당하는 경우 다발성 경화증 진단을 받게 되며, 그 외에는 다발성 경화증 진단을 내리지 않는 다. · 두 번 이상의 재발 및 둘 이상의 병변의 증상이 있는 임상 증거 · 두 번 이상의 재발, 중추신경계의 병변의 임상적 증거, 및 다발성 경화증의 전형적인 하나 이상의 병변 · 두 번 이상의 재발, 중추신경계의 병변의 임상적 증거, 및 중추신경계의 다른 부분의 손상을 나타내는 또 다 른 재발 · 한 번의 재발, 둘 이상의 병변에 대한 임상 증거(가령, 둘 이상의 기능계 또는 신체의 둘 이상의 부위의 손 상), 및 다수의 시간-분리된 척수 천자에 기초하여 식별된 올리고클론성 밴드에 의해 입증되는 이질적인 면역계 활동 · 한 번의 재발, 둘 이상의 병변에 대한 임상 증거(가령, 둘 이상의 기능계 또는 신체의 둘 이상의 부위의 손 상), 및 이전 스캔 이후의 새로운 병변의 MRI 증거 · 한 번의 재발, 둘 이상의 병변에 대한 임상 증거(가령, 둘 이상의 기능계 또는 신체의 둘 이상의 부위의 손 상), 및 추가 증상이 있는 재발 · 한 번의 재발, 하나의 병변에 대한 임상 증거, 다발성 경화증의 전형적인 하나 이상의 MRI 병변 · 한 번의 재발, 하나의 병변의 임상 증거, 올리고클론성 밴드로 지시되는 중추신경계의 상이한 부분에서의 활 동을 나타내는 또 다른 재발, 이전 스캔 또는 새로운 재발 이후 새로운 병변을 묘사하는 MRI · 한 번의 재발, 하나의 병변에 대한 임상 증거, 다발성 경화증의 전형적인 하나 이상의 MRI 병변, 또는 · 1년 동안 다발성 경화증의 전형적인 신경학적 증상의 점진적 진행과 함께 다음 중 임의의 두 가지: 다발성 경화증의 전형적인 뇌 병변 적어도 하나, 척수 내 병변 둘 이상, 또는 척수액 내 올리고클론성 밴드. II.C. 다발성 경화증 진행 평가 대상체가 다발성 경화증으로 진단된 후, 다양한 기능을 평가하고 현재 또는 최근 증상을 전달하기 위해 일반적 으로 신경과 전문의와의 정기적인 약속이 이루어진다. 어떤 경우에는 이러한 약속이 정기적으로(가령, 6개월마 다) 스케줄링된다. 어떤 경우에는, 대상체가 새로운 증상 악화, 약물 부작용 등에 대해 논의하기 위해 하나 이 상의 약속을 요청한다. 신경과 전문의는 또한 대상체가 주기적으로 MRI를 받을 것을 권장한다. 다시 말하지만,MRI는 일반적으로 진행을 평가하기 위해 주기적으로 스케줄링되거나, 새로운 잠재적 또는 실제 증상이 악화에 해당할 가능성이 높은지 여부를 결정하거나, 현재의 치료가 질환의 진행을 늦추거나 멈추는 데 효과적이었는지 여부를 결정하기 위해 촬영될 수 있다. 따라서, 의사는 다음 중 하나 이상에 기초하여 대상체의 다발성 경화증이 진행되고 있는지 여부 및/또는 정도를 결정할 수 있다: 새로운 증상의 빈도, 새로운 증상의 중증도, 기존 증상의 악화, 증상을 겪고 있는 기능계의 수 의 변화, 새 병변 발달의 빈도, 병변 부하의 변화, 위축의 변화, 및/또는 대상체의 자체 평가. 다발성 경화증의 진행을 보다 객관적으로 평가하기 위해 다양한 척도가 개발되었다. 일부 척도는 대상체의 웰빙을 평가하도록 설 계되었으며 일련의 질문에 대한 대상체의 답을 기반으로 한다. 일부 척도는 대상체의 기능적 능력에 대한 의사의 평가를 기반으로 한다. 그러한 기능 기반 척도 중 하나는 확 장 장애 상태 척도이다. 이 척도는 대상체의 보행 능력에 크게 의존한다. 척도 범위는 0에서 10까지이며 0.5 증 분으로 구분된다. 0 내지 4.5의 점수는 대상체가 증상 또는 장애를 겪고 있는 기능계의 양과 증상/장애의 중증 도에 기초하여 구별된다. 4.5 내지 7.5의 점수는 대상체가 얼마나 멀리 움직일 수 있는지, 그리고 움직임에 필 요한 보행 보조기구의 유형 및/또는 보행 보조기구의 필요 여부에 따라 구별된다. 7.5 내지 9.5의 점수는 대상 체가 침대에 제한되고 기능을 유지하는 정도에 기초하여 구별된다. 10의 점수는 다발성 경화증으로 인한 사망을 나타낸다. II.D. 다발성 경화증 치료 최근 몇 년 동안 많은 새로운 다발성 경화증 치료제가 시장에 출시되었다. 치료제는 기전(대부분 부분적으로만 이해됨), 투여 경로 및 치료가 1선 접근 방식인지 2선 또는 3선 접근 방식인지에 기초하여 구별될 수 있다. 주사 가능한 약물은 인터페론-베타(interferon-beta) 및 글라티라머 아세테이트(glatiramer acetate)를 포함한 다. 인터페론-베타는 CD4+ 및 CD8+ T-세포 반응성을 감소시키는 면역 조절제이다. 인터페론-베타는 세 가지 상 품명(Avonex®, Betaseron® 및 Rebif®)으로 표시되며, 이들은 용량 제형, 투여 경로 및 사용 빈도가 상이하다. 글라티라머 아세테이트는 수초(myelin)와 유사한 면역 조절제로서 주 조직적합 복합체에 결합하고 T 세포와 항원의 결합을 감소시킨다. 최근에, 더 많은 경우 약물이 이용 가능해졌으며, 예를 들어, 테리플루노미드(teriflunomide), 모노메틸 푸마레 이트(monomethyl fumerate), 핑골리모드(fingolimod), 시포니모드(siponimod), 클라드리빈(cladribine), 디메 틸 푸머레이트(dimethyl fumerate), 디록시멜 푸마레이트(diroximel fumarate), 라퀴니모드(laquinimod) 및 오 자니모드(ozanimod)가 있다. 테리플루노미드는 미토콘드리아 효소 디하이드로오로테이트 탈수소효소를 억제한다. 디메틸 푸머레이트, 모노메틸 푸머레이트 및 디록시멜 푸마레이트는 림프구감소증을 유도하는 것으로 현재 연구 중인 기전을 통해 작용한다. 핑골리모드 및 시포니모드는 스핑고신 1-인산(S1P)을 조절하는데, 이때, 시포니모드 및 오자니모드는 S1P1 및 S1P5에 대해 선택적이며, 핑골리모드는 비선택적 S1P 조절제이다. 클라드리 빈은 CD4+ 및 CD8+ 림프구를 고갈시킨다. 라퀴니모드는 T 세포가 중추 신경계로 이주하는 것을 방해하고 IL-17 수준을 감소시킨다. 또 다른 약물이 정맥 주사로 투여되는데, 예를 들어, 오크렐리주맙(ocrelizumab), 오파투마맙(ofatumamab), 유 블리툭시맙(ublituximab), 리툭시맙(rituximab), 나탈리주맙(natalizumab), 알렘투주맙(alemtuzumab) 및 미톡 산트론(mitoxantrone)이 있다. 오크렐리주맙, 오파투무맙, 유블리툭시맙 및 리툭시맙은 보체 의존적 세포독성 효과를 통해 CD20+ B 세포를 표적으로 한다. 나탈리주맙은 CD52를 발현하는 림프구를 표적으로 하는 단클론성 항체이다. 알렘투주맙은 T 및 B 세포의 CD52에 결합하여 T 및 B 세포를 파괴하도록 준비시키는 단클론성 항체이 다. 미톡산트론은 면역 세포 증식을 억제하고, 항원 제시를 손상시키며, T 세포 억제 기능을 향상시키고, B 세 포를 억제하는 II형 국소이성화효소 억제제이다. 또 다른 치료 접근법은 자가 조혈 줄기 세포 요법이다. 이 접근법은 환자의 골수 줄기 세포의 일부를 제거(화학 요법 제제에 대한 반응으로 혈액으로 방출)하고, 수일 동안 화학 요법 치료를 시행하고(대상체의 면역 세포의 대부분 또는 전체를 고갈시키기 위함), 저장된 줄기 세포를 투여하는 것(회복을 촉진시키기 위함)을 포함한다. 약물들은 또한 다발성 경화증의 어떤 하위 유형(들)에 대해 치료하도록 승인되었는지에 기초하여 구별될 수 있 다. 대부분의 승인된 다발성 경화증 약물은 RRMS 치료용으로 승인되었다. SPMS 치료에 승인된 약물에는 미톡산 트론, 클라드리빈 및 시포니모드가 있다. 2020년06월 현재 미국과 유럽에서 PPMS 치료용으로 승인된 유일한 약 물은 오크렐리주맙이다.(질환 자체보다는) 다발성 경화증의 증상을 치료하기 위해 훨씬 더 많은 치료법이 이용가능하다. 예를 들어, 달 팜프리딘은 보행을 개선하는 데 사용될 수 있고, 톨테로딘은 요실금을 치료하는 데 사용될 수 있으며, 바클로펜 은 경련을 치료하는 데 사용될 수 있다. 또한, 솔루메드롤(정맥 주사), 프레드니손(경구) 및/또는 메틸프레니솔 론(경구)은 다발성 경화증 재발을 치료하는 데 자주 사용된다(가령, 재발로부터의 회복 속도를 높이거나 및/또 는 재발로부터 완전한 회복의 가능성을 높이기 위함). 각각의 치료제는 1선 치료제, 2선 치료제 또는 3선 치료제로서 사용될 수 있다. 일반적으로, 2선 치료제는 하나 이상의 1선 치료제가 실패했거나, 대상체에 대한 효과가 중단되었거나, 대상체에게 견딜 수 없는 이상 반응을 유발한다고 결정된 후 시행되는 것이다. 마찬가지로, 3선 치료제는 하나 이상의 2선 치료제가 실패했거나, 대상 체에 대한 효과가 중단되었거나, 대상체에게 견딜 수 없는 이상 반응을 유발한다고 결정된 후 시행되는 것이다. 의사마다 어떤 치료제가 1선 치료제로 특징지어지는지에 대해 다른 결정을 내릴 수 있다. 이러한 결정은 이상 반응 프로필을 기반으로 할 수 있는데, 다른 치료 옵션이 실패한 경우 더 높은 이상 반응 위험 및/또는 더 심각 한 이상 반응이 더 수용 가능할 수 있기 때문이다. 다발성 경화증 재단(MS Foundation)에 따르면 일반적으로 1 선 치료제로서 사용되는 치료제에는 테리플루노마이드, 인터페론 베타, 글라티라머 아세테이트, 오크렐리주맙, 페그인터페롱 베타 및 디메틸푸메레이트가 포함된다. 일반적으로 2선 또는 3선 치료제로 사용되는 치료제에는 핑골리모드, 알렘투주맙, 클라드리빈, 시포니모드, 미톡산트론 및 나탈리주맙이 있다. III. 지능형 기능으로 구성된 클라우드-기반 애플리케이션을 호스팅을 위한 네트워크 환경 도 1은 클라우드-기반 애플리케이션의 실시예가 호스팅되는 네트워크 환경을 도시한다. 네트워크 환경 은 클라우드 서버 및 데이터 레지스트리를 포함하는 클라우드 네트워크를 포함할 수 있다. 클라우드 서버는 클라우드-기반 애플리케이션의 기반이 되는 소스 코드를 실행할 수 있다. 데이터 레지스 트리는 하나 이상의 사용자 장치, 가령, 컴퓨터, 랩톱 및 모바일 장치로부터 수집되거나 식별된 데이터 레코드를 저장할 수 있다. 데이터 레지스트리에 저장된 데이터 레코드는 고정된 부분(예를 들어, 데이터 필드)의 골격 구조에 따라 구조화될 수 있다. 컴퓨터, 랩톱, 및 모바일 장치는 각각 다양한 사용자에 의해 작동될 수 있다. 예를 들어, 컴퓨터는 의사에 의해 작동될 수 있고, 랩톱은 개체의 관리자에 의해 작동될 수 있 으며, 모바일 장치는 대상체에 의해 작동될 수 있다. 모바일 장치는 게이트웨이 및 네트워크 를 사용하여 클라우드 네트워크에 연결할 수 있다. 일부 예에서, 컴퓨터, 랩톱, 및 모바일 디바이스 각각은 동일한 개체(가령, 동일한 병원)와 연관된다. 또 다른 예에서, 컴퓨터, 랩톱, 및 모바일 디바이스는 상이한 개체(예를 들어, 상이한 병원들)와 연관된다. 컴퓨터, 랩톱 및 모바일 장치의 사용자 장치는 설명을 위한 예시이므로, 본 발명이 이에 한정되지는 않는다. 네트워크 환경은 임의의 장치 유형의 임의의 수 또는 구성의 사용자 장치를 포함할 수 있다. 일부 실시예에서, 클라우드 서버는 컴퓨터, 랩톱 또는 모바일 장치 중 임의의 것과 상호작 용함으로써 데이터 레지스트리에 저장되기 위한 데이터(가령, 대상체 레코드)를 획득할 수 있다. 예를 들 어, 데이터 레지스트리로 수집되도록 로컬하게 저장된(예를 들어, 컴퓨터의 로컬 네트워크에 저장된) 대상체 레코드 또는 또 다른 데이터 레코드를 선택하기 위해 인터페이스를 사용함으로써 컴퓨터는 클라우 드 서버와 상호대화한다. 또 다른 예를 들어, 컴퓨터는 인터페이스와 상호작용하여 클라우드 서버 에 대상체 레코드 또는 그 밖의 다른 데이터 레코드를 저장하는 데이터베이스의 주소(가령, 네트워크 위치)를 제공할 수 있다. 그런 다음 클라우드 서버는 데이터베이스로부터 데이터 레코드를 불러오고 데이 터 레코드를 데이터 레지스트리에 수집한다. 일부 실시예에서, 컴퓨터, 랩톱, 및 모바일 장치는 상이한 개체(예를 들어, 의료 센터)와 연관 된다. 클라우드 서버가 컴퓨터, 랩톱, 및 모바일 장치로부터 획득하는 데이터 레코드는 상 이한 데이터 레지스트리에 저장될 수 있다. 컴퓨터, 랩톱, 및 모바일 장치 각각으로부터의 데이 터 레코드가 클라우드 네트워크 내에 저장될 수 있지만, 데이터 레코드는 혼합되지 않을 수 있다. 예를 들 어, 컴퓨터는 데이터-프라이버시 규칙에 의해 부과된 제약조건으로 인해 랩톱으로부터 획득된 데이터 레코드를 액세스할 수 없다. 그러나, 클라우드 서버는 데이터 레코드가 다른 개체에 의해 쿼리될 때 데이 터 레코드의 일부분을 자동으로 난독화, 추상화, 또는 마스킹하도록 구성될 수 있다. 따라서 개체로부터 수집된 데이터 레코드는 데이터-프라이버시 규칙을 준수하기 위해 난독화, 모호화 또는 마스킹된 형태로 다른 개체에게 노출될 수 있다. 실례로, 의사나 다른 의료 전문가가 잠재적으로 다발성 경화증과 관련된 대상체의 증상을 입력 할 수 있다. 증상은 대상체와 연관된 대상체 레코드의 일부로 클라우드 네트워크 내에 저장될 수 있다.데이터 레코드가 컴퓨터, 랩톱, 및 모바일 장치로부터 수집되면, 데이터 레코드는 본 명세서에 기술된 지능형 분석 기능을 제공하기 위해 머신-러닝 또는 인공-지능 모델을 훈련시키기 위한 훈련 데이터로서 사용될 수 있다. 개체와 연관된 사용자 장치가 데이터 레지스트리에 쿼리하고 쿼리 결과가 다른 개체로부 터 기원한 데이터 레코드를 포함할 때 이들 데이터 레코드가 데이터-프라이버시 규칙을 준수하는 난독화된 형태 로 사용자 장치로 제공 또는 노출될 수 있다고 가정하면, 데이터 레코드가 또한 임의의 개체에 의해 쿼리되도록 이용 가능해 질 수 있다. 클라우드 서버는 데이터 레지스트리에 저장된 데이터 레코드를 처리하기 위해 지능형 기능을 실행하 도록 구성될 수 있다. 예를 들어, 지능형 기능을 실행하는 것은 데이터 레지스트리에 저장된 데이터 레코 드의 적어도 일부분을 훈련된 머신 러닝 또는 인공 지능 모델에 입력하여 추가 분석을 위한 출력을 생성하는 것 을 포함할 수 있다. 일부 실시예에서, 출력은 데이터 레코드 내의 패턴을 추출하거나 데이터 레코드의 데이터 필드와 연관된 값 또는 결과를 예측하는 데 사용될 수 있다. 클라우드 서버에 의해 실행되는 지능형 기능 의 다양한 실시예가 이하에서 기재된다. 일부 실시예에서, 클라우드 서버는 (예를 들어, 의사에 의해 작동되는) 사용자 장치가 상담 방송(consult broadcast)을 목적지 장치의 세트로 전송하기 위해 클라우드-기반 애플리케이션을 액세스할 수 있게 하도록 구 성된다. 상담 방송은 주제 기록과 관련된 주제의 치료에 관한 지원 또는 지원 요청일 수 있다. 목적지 장치는 다른 개체(예를 들어, 다른 의료 센터의 의사)와 연관된 또 다른 사용자에 의해 작동되는 사용자 장치일 수 있 다. 목적지 장치가 상담 방송과 연관된 지원 요청을 수락하면 클라우드-기반 애플리케이션은 대상체 레코드의"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "특정 데이터 필드를 생략하거나 추상화한 대상체 레코드의 요약된 표현을 생성할 수 있다. 요약된 표현은 데이 터-프라이버시 규칙을 준수할 수 있으므로, 대상체 레코드와 연관된 대상체를 고유하게 식별하기 위해 대상체"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "레코드의 요약된 표현이 사용될 수 없다. 클라우드-기반 애플리케이션은 대상체 레코드의 요약된 표현을 지원"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "요청을 수락한 목적지 장치로 전송할 수 있다. 목적지 장치를 작동하는 사용자는 요약된 표현을 평가하고 대상 체를 치료하기 위한 옵션을 논의하기 위해 통신 채널을 사용하여 사용자 장치와 통신할 수 있다. 예를 들어, 의 사는 다발성 경화증의 가능한, 개연성 또는 확인된 진단을 갖고 대상체를 치료할 수 있다. 의사는 다발성 경화 증 대상체를 치료하는 방법에 대해 추가로 진행하거나 상담할 수 있다. 의사는 방송 상담이 다른 병원에서 일하 는 의사에게 전송되도록 할 수 있다. 대상체 레코드의 다양한 대상체 속성이 난독화되어 다른 의사에게 전송될 수 있다. 그런 다음 두 의사는 통신 세션, 가령, 챗룸 중에 난독화된 다발성 경화증 레코드에 관해 통신할 수 있다. 일부 실시예에서, 클라우드 서버는 치료-계획 형성 인터페이스를 사용자 장치에 제공하도록 구성된다. 치 료-계획 형성 인터페이스를 통해 사용자 장치는 병태에 대한 치료 계획을 정의할 수 있다. 예를 들어, 치료 계 획은 병태가 있는 대상체를 치료하기 위한 작업흐름일 수 있다. 작업흐름은 대상체의 모집단을 병태를 갖는 것으로 정의하기 위한 하나 이상의 기준을 포함할 수 있다. 작업흐름은 또한 병태에 대한 특정 유형의 치료제를 포함할 수 있다. 클라우드 서버는 사용자 장치의 세트의 각각의 사용자 장치로부터 특정 병태에 대한 치료 -계획 정의를 수신하고 저장한다. 클라우드-기반 애플리케이션은 사용자 장치의 세트에 주어진 병태에 대한 치 료 계획을 배포할 수 있다. 사용자 장치의 세트의 둘 이상의 사용자 장치가 상이한 개체와 연관될 수 있다. 둘 이상의 사용자 장치 각각에는 임의의 부분 또는 전체 치료 계획을 고객 규칙 세트에 통합하는 옵션이 제공될 수 있다. 클라우드 서버는 사용자 장치가 공유된 치료 계획을 전체적으로 통합하는지 또는 치료 계획의 일부 를 통합하는지 모니터링할 수 있다. 사용자 장치와 공유된 치료 계획 간의 상호대화가 사용되어 치료 계획 또는 치료 계획을 기반으로 생성된 규칙을 업데이트할지 여부를 결정할 수 있다. 일부 실시예에서, 클라우드 서버는 사용자 장치를 작동하는 사용자가 클라우드-기반 애플리케이션을 액세 스하여 병태가 있는 대상체에 대한 제안된 치료를 결정할 수 있게 한다. 사용자 장치는 클라우드-기반 애플리케 이션과 연관된 인터페이스를 로드한다. 인터페이스는 사용자 장치를 작동하는 사용자가 사용자에 의해 치료되는 대상체과 연관된 대상체 레코드를 선택할 수 있게 한다. 클라우드-기반 애플리케이션은 사용자가 치료하는 대상 체와 유사한 이전에 치료를 받은 대상체를 식별하기 위해 다른 대상체 레코드를 평가할 수 있다. 예를 들어, 대 상체들 간의 유사성은 대상체 레코드의 어레이 표현을 사용하여 결정될 수 있다. 어레이 표현은 대상체 레코드 의 데이터 필드의 값에 대한 임의의 숫자 및/또는 범주 표현일 수 있다. 예를 들어, 대상체 레코드의 어레이 표 현은 유클리드 공간과 같은 도메인 공간에서의 대상체 레코드의 벡터 표현일 수 있다. 경우에 따라, 어레이의 복수 값이 단일 필드에 대응한다. 예를 들어, 필드 값은 원-핫 인코딩을 통해 생성된 복수의 바이너리 값으로 표현될 수 있다. 클라우드-기반 애플리케이션은 대상체 레코드의 그룹의 각각의 대상체 레코드에 대한 어레이 표현을 생성할 수 있다. 두 대상체 레코드 간의 유사성은 두 대상체 레코드의 어레이 표현들 사이의 거리로 나타날 수 있다. 또한, 클라우드-기반 애플리케이션은 인터페이스를 사용하여 사용자 장치에 의해 선택된 대상체 레코드에 가장 가까운 이웃인 대상체를 식별하도록 구성될 수 있다. 클라우드-기반 애플리케이션은 가장 가까운 이웃인 대상체에 대해 이전에 수행된 치료를 식별할 수 있다. 클라우드-기반 애플리케이션은 사용자 장치를 작 동하는 사용자에 의한 평가를 위해 가장 가까운 이웃에 대해 이전에 수행된 처리를 인터페이스에서 사용할 수 있다. 일부 실시예에서, 클라우드 서버는 이전에 치료된 대상체의 데이터베이스를 검색하는 쿼리를 생성하도록 구성된다. 클라우드 서버는 쿼리를 실행하고 쿼리의 제약조건을 만족하는 대상체 레코드를 검색할 수 있다. 그러나 쿼리 결과를 표시할 때, 클라우드-기반 애플리케이션은 쿼리를 생성한 사용자가 치료했거나 치료 중인 대상체에 대해서만 대상체 레코드 전체를 표시할 수 있다. 클라우드-기반 애플리케이션은 쿼리를 생성하는 사용자가 치료하지 않는 대상체에 대한 대상체 레코드의 일부분을 마스킹하거나 그 밖의 다른 방식으로 난독화 한다. 쿼리 결과에 포함된 대상체 레코드의 일부분의 마스킹 또는 난독화를 통해 사용자는 데이터-프라이버시 규칙을 준수할 수 있다. 일부 실시예에서, 쿼리 결과(쿼리 결과가 난독화되었는지 여부에 관계없이)는 대상체 레코드 내의 패턴 또는 공통 속성에 대해 자동으로 평가될 수 있다. 일부 실시예에서, 클라우드 서버는 챗봇을 클라우드-기반 애플리케이션에 내장한다. 챗봇은 사용자 장치와 자동으로 통신하도록 구성된다. 챗봇은 사용자 장치와 챗봇 간에 메시지가 교환되는 통신 세션에서 사용자 장치 와 통신할 수 있다. 챗봇은 사용자 장치로부터 수신된 질문에 대한 답을 선택하도록 구성될 수 있다. 챗봇은 클 라우드-기반 애플리케이션에 의해 액세스될 수 있는 지식 베이스에서 답을 선택할 수 있다. 사용자 장치가 챗봇 에 질문을 전송하고 해당 챗봇에 지식 베이스에 저장된 기존 답이 없는 경우, 지식 베이스에 저장된 기존 답변 이 있는 질문의 다른 표현이 제공된다. 챗봇과 통신하는 사용자는 챗봇이 제공한 답변이 정확하거나 도움이 되 는지 여부를 묻는 메시지를 받을 수 있다. III.A. 클라우드-기반 애플리케이션을 통해 사용자 장치가 다른 사용자 장치에 대한 상담 요청을 브로드캐스트"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "하고 데이터-프라이버시 규칙을 준수하기 위해 대상체 레코드를 자동으로 요약할 수 있음 도 2는 대상체 치료에 대한 지원을 요청하는 상담 방송과 연관하여 압축된 대상체 레코드를 사용자 장치에 배포 하기 위해 클라우드-기반 애플리케이션에 의해 수행되는 프로세스를 예시하는 흐름도이다. 프로세스 는 클라우드 서버에 의해 수행되어 데이터-프라이버시 규칙을 준수하면서 상이한 개체(예를 들어, 병원)와 연관된 사용자 장치가 대상체에 대한 치료에 관해 협력하거나 상담하게 할 수 있다. 프로세스는 클라우드 서버가 사용자 장치로부터 속성 세트를 수신하는 블록에서 시작한다. 속성 세트의 각각의 속성은 대상체(가령, 환자)의 모든 특성을 나타낼 수 있다. 속성 세트는 클라우드 서버에 의해 제공되는 인터페이스를 사용하여 사용자에 의해 식별될 수 있다. 예를 들어, 속성 세트는 대상체의 인구 통계학적 정보 및 대상체가 경험한 최근 증상을 식별한다. 인구통계학적 정보의 비제한적 예로는 나이, 성별, 민족성, 거주하는 주 또는 도시, 소득 범위, 교육 수준 또는 기타 적절한 정보가 포함된다. 최근 증상의 비제한 적인 예로는 현재 또는 최근에(가령, 마지막 방문 시, 섭취 시, 24시간 이내, 일주일 이내) 겪은 특정 증상(가 령, 호흡 곤란, 임계 온도 이상의 발열, 임계 혈압 이상의 혈압 등)을 포함한다. 블록에서, 클라우드 서버는 대상체에 대한 레코드를 생성한다. 레코드는 하나 이상의 데이터 필드를 포함하는 데이터 요소일 수 있다. 레코드는 대상체와 연관된 속성 세트의 각각의 속성을 나타낸다. 레코드는 중 앙 데이터 저장소, 가령, 데이터 레지스트리 또는 임의의 다른 클라우드-기반 데이터베이스에 저장될 수 있다. 블록에서, 클라우드 서버는 인터페이스를 사용하여 사용자에 의해 제출된 요청을 수신한다. 요 청은 상담 방송을 개시하는 것일 수 있다. 예를 들어, 개체와 연관된 사용자는 대상체를 치료하는 의료 센터의 의사이다. 사용자는 대상체 치료에 대한 지원 요청을 방송하기 위해 클라우드-기반 애플리케이션을 액세스하기 위해 사용자 장치를 작동할 수 있다. 방송은 상이한 개체와 연관된 다른 사용자 장치의 세트로 전송될 수 있다. 블록에서, 클라우드 서버는 대상체과 연관된 속성의 세트에 포함된 하나 이상의 최근 증상을 사용하 여 중앙 데이터 저장소에 쿼리한다. 쿼리 결과에는 다른 레코드의 세트가 포함된다. 다른 레코드의 세트의 각각 의 레코드는 다른 대상체와 연관된다. 블록에서, 클라우드 서버는 목적지 주소의 세트(예를 들어, 다 른 개체와 연관된 다른 사용자 장치)를 식별한다. 목적지 주소의 세트의 각각의 목적지 주소는 블록에서 식별된 다른 레코드의 세트의 하나 이상의 다른 레코드와 연관된 또 다른 대상체에 대한 의료 제공자와 연관된"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "다. 블록에서, 클라우드 서버는 대상체에 대한 레코드의 요약 표현(condensed representation)을 생"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "성한다. 레코드의 요약 표현은 레코드의 적어도 일부를 생략하거나, 모호하게 하거나, 난독화한다. 레코드의 요"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "약 표현은 레코드와 연관된 대상체를 고유하게 식별하는 데 사용될 수 없기 때문에 데이터-프라이버시 규칙을위반하지 않고 외부 시스템 간에 레코드의 요약 표현을 교환할 수 있다. 클라우드 서버는 레코드의 요약 표현을 생성하기 위해 임의의 마스킹 또는 난독화 기술을 실행할 수 있다. 블록에서, 클라우드 서버는 목적지 주소의 세트의 각각의 목적지 주소에 대한 연결 입력 구성요소를"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "갖는 레코드의 요약 표현을 이용한다. 연결 입력 구성요소는 각각의 목적지 주소에 제시되는 선택 가능한 요소 일 수 있다. 연결 입력 구성요소의 비제한적인 예는 버튼, 링크, 입력 요소 및 그 밖의 다른 적절한 선택 가능 한 요소를 포함한다. 블록에서, 클라우드 서버는 목적지 주소와 연관된 목적지 장치로부터 통신을 수"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "신한다. 통신은 목적지 장치를 작동하는 사용자가 레코드의 요약된 표현과 연관된 연결 입력 구성요소를 선택했 다는 지시자를 포함한다. 블록에서, 클라우드 서버는 연결 입력 구성요소가 선택되었던 목적지 장치 와 사용자 장치 사이의 통신 채널의 설정을 촉진시킨다. 통신 채널은 사용자 장치(가령, 대상체를 치료하는 의 사)를 작동하는 사용자가 메시지 또는 그 밖의 다른 데이터(가령, 비디오 피드)를 연결 입력 구성요소가 선택된 목적지 주소와 연관된 목적지 장치(예를 들어, 대상체의 치료를 지원하기로 동의한 다른 병원의 의사)와 교환할 수 있도록 한다. 일부 실시예에서, 클라우드 서버는 사용자 장치의 위치 및 연결 입력 구성요소가 선택되었던 목적지 장치"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "의 위치를 자동으로 결정하도록 구성된다. 클라우드 서버는 또한 위치를 비교하여 레코드의 요약 표현을 생성할지 여부를 결정할 수 있다. 예를 들어, 블록에서, 클라우드 서버가 목적지 주소의 세트의 각각 의 목적지 주소가 상담 방송을 개시한 사용자 장치와 함께 배치되지 않는다고 결정하기 때문에, 클라우드 서버"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "는 레코드의 요약 표현을 생성할 수 있다. 이 경우에, 클라우드 서버는 데이터-프라이버시 규칙을 준"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "수하기 위해 레코드의 요약 표현을 생성할 것을 자동으로 결정할 수 있다. 또 다른 예로서, 목적지 주소의 세트 가 상담 방송을 개시한 사용자 장치와 동일한 개체와 연관되는 경우, 클라우드 서버는 데이터-프라이버시 규칙을 준수하면서, 목적지 주소와 연관된 목적지 장치로 레코드를 완전히(예를 들어, 레코드의 일부를 난독화 하지 않고) 전송할 수 있다."}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "일부 실시예에서, 클라우드 서버는 복수의 다른 압축된 레코드 표현을 생성한다. 복수의 다른 요약 레코드"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "표현 각각이 다른 대상체와 연관된다. 클라우드 서버는 사용자 장치에 복수의 다른 요약된 레코드 표현을"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "전송하고, 사용자 디바이스로부터, 복수의 다른 요약된 레코드 표현의 서브세트의 선택을 식별하는 통신을 수신"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "한다. 목적지 주소의 세트 의 각각의 목적지 주소는 요약된 레코드 표현 중 하나씩으로 표현된다. 예를 들어,"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "요약된 레코드 표현을 생성하는 것은 요약된 레코드 표현과 연관된 다른 대상체의 관할 구역을 결정하고, 관할 구역 내에서 대상체 레코드의 교환을 관리하는 데이터-프라이버시 규칙을 결정하며, 데이터-프라이버시 규칙을"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "준수하기 위해 요약된 레코드 표현을 생성하는 것을 포함한다. 복수의 다른 요약된 레코드 표현의 첫 번째 다른"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "요약된 레코드 표현은 특정 유형의 데이터를 포함할 수 있다. 복수의 다른 요약된 레코드 표현의 두 번째 다른"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "요약된 레코드 표현은 특정 유형의 데이터를 생략하거나 추상화할 수 있다. 예를 들어, 특정 유형의 데이터는 연락처 정보, 식별 정보, 가령, 이름, 사회 보장 번호, 및 다른 대상체를 고유하게 식별하는 데 사용될 수 있는 그 밖의 다른 적절한 정보일 수 있다. 일부 실시예에서, 하나 이상의 최근 증상을 사용하여 중앙 데이터 저장소에 쿼리하는 것은 복수의 다른 레코드 의 각각의 다른 기록에 대한 점수를 결정하는 것을 포함한다. 점수는 다른 레코드의 적어도 일부분과 대상체에 대한 레코드의 적어도 일부분 사이의 유사성을 특징지을 수 있다. 쿼리하는 것은 점수가 임계값을 초과하는 연 관된 복수의 다른 레코드의 서브세트가 되도록 다른 레코드의 세트를 정의하는 단계를 더 포함할 수 있다. 중앙 데이터 저장소의 쿼리는 다른 레코드의 세트를 식별하기 위해 인구 통계학적 정보의 적어도 일부를 사용하는 것 을 포함할 수 있다. 예를 들어, 다른 레코드 중 하나는 인구 통계학적 정보 항목, 가령, 나이, 성별, 민족성 등 을 포함하는 데이터 필드를 포함할 수 있다. 일부 실시예에서, 사용자 장치 및 그 밖의 다른 장치(예를 들어, 목적지 주소와 연관된 목적지 장치)는 상이한 의료 기관과 연관된다. III.B. 통합 사용자 통합을 기반으로 공유 가능한 치료-계획 정의 업데이트 도 3은 치료-계획 정의(가령, 의사 결정 트리 또는 치료 작업흐름)의 사용자 통합을 모니터링하고 모니터링의 결과에 기초하여 치료-계획 형성을 자동으로 업데이트하기 위한 프로세스를 예시하는 흐름도이다. 프로세 스는 클라우드 서버에 의해 수행되어 사용자 디바이스가 병태를 가진 대상체의 모집단을 치료하기 위 한 치료 계획을 정의할 수 있게 할 수 있다. 사용자 장치는 내부 또는 외부 네트워크에 연결된 사용자 장치에 치료-계획 정의를 배포할 수 있다. 치료-계획 정의를 수신하는 사용자 장치는 치료-계획 정의를 커스텀 규칙 베 이스에 통합할지 여부를 결정할 수 있다. 커스텀 규칙 베이스로의 통합이 모니터링되고 치료-계획 정의를 자동 으로 수정하기 위해 사용될 수 있다.블록에서, 클라우드 서버는 사용자 장치가 인터페이스 데이터를 로드할 때 치료-계획 정의 인터페이 스가 디스플레이되게 하는 인터페이스 데이터를 저장한다. 치료-계획 정의 인터페이스는 사용자 장치가 치료-계 획 정의 인터페이스로 이동하기 위해 클라우드 서버를 액세스할 때 사용자 장치의 세트의 각각의 사용자 장치에 제공된다. 일부 실시예에서, 치료-계획 정의 인터페이스에 의해 사용자가 병태(예를 들어, 림프종)를 갖 는 대상체의 모집단을 치료하기 위한 치료 계획을 정의할 수 있게 한다. 블록에서, 클라우드 서버는 통신 세트를 수신한다. 통신 세트의 각각의 통신은 사용자 장치의 세트의 사용자 장치로부터 수신되고 사용자 장치와 치료-계획 정의 인터페이스 간의 상호작용에 응답하여 생성되었다. 일부 실시예에서, 통신은, 예를 들어, 대상체 레코드의 모집단을 정의하기 위한 하나 이상의 기준을 포함한다. 각각의 기준은 변수 유형으로 나타낼 수 있다. 기준은 대상체 레코드의 풀을 필터링하기 위한 필터 조건일 수 있다. 예를 들어, 림프종이 발생할 수 있는 대상체와 연관된 대상체 레코드의 모집단을 정의하기 위한 기준에는 \"역형성 림프종 키나아제(ALK)의 이상\" 및 \"60세 이상\"이라는 필터 조건이 포함될 수 있다. 통신은 상태에 대한 특정 유형의 치료를 포함할 수도 있다. 특정 유형의 치료는 대상체 레코드의 모집단으로 대표되는 대상체와 연 관된 병태를 치료하기 위해 제안된 조치(가령, 수술 받기) 또는 비조치(가령, 염분 섭취 줄이기)와 관련될 수 있다. 블록에서, 클라우드 서버는 중앙 데이터 저장소, 가령, 데이터 레지스트리 또는 클라우드 네트 워크 내의 임의의 다른 중앙 서버에 규칙의 세트를 저장한다. 규칙 세트의 각각의 규칙은 하나 이상의 기 준 및 사용자 장치로부터의 통신에 포함된 특정 치료 유형을 포함한다. 예를 들면, 규칙은 대상체의 림프종을 치료하기 위한 치료 작업흐름을 나타낸다. 규칙은 다음 기준(가령, \"IF\" 문 다음에 오는 조건) 및 다음 작업(가 령, 사용자가 정의하거나 선택한 특정 치료 유형, \"THEN\" 문 다음에 따라옴)을 포함한다. \"IF '림프절의 생검이 림프종 세포가 있음을 나타냄' AND '혈액 검사에서 림프종 세포가 있음을 나타냄' THEN '화학요법으로 치료' AND '능동 감시'\". 또한 규칙 세트의 각각의 규칙은 통신이 수신된 사용자 장치에 대응하는 식별자와 연관되어 저장된다. 블록에서, 클라우드 서버는 치료-계획 정의 인터페이스를 통해 개체들에 걸쳐 이용가능한 규칙 세트 의 서브세트를 식별한다. 규칙의 서브세트는 병태와 연관되고 평가를 위해 다른 의료 센터와 같은 외부 시스템 에 배포되는 규칙 세트의 서브세트를 포함할 수 있다. 예를 들어, 규칙의 특성 또는 규칙과 연관된 식별자를 평 가하여 규칙의 서브세트에 포함할 규칙을 선택할 수 있다. 규칙의 특성은 저장된 규칙에 저장되거나 추가된 코 드 또는 플래그를 포함할 수 있다. 코드 또는 플래그는 규칙이 일반적으로 외부 시스템에 의해 사용 가능함(가 령, 개체에 의해 이용됨)을 나타낸다. 블록에서, 블록에서 식별된 규칙의 서브세트의 각각의 규칙에 대해, 클라우드 서버는 규칙과의 상호대화를 모니터링한다. 상호대화는 규칙을 커스텀 규칙 베이스에 통합하는 외부 개체(가령, 규칙과 연관된 치료-계획을 정의한 사용자와 연관된 개체 외부의 개체)를 포함할 수 있다. 예를 들어, 외부 개체(가령, 상이한 병원)와 연관된 사용자 장치는 외부 개체에 의해 이용되는 규칙을 평가한다. 평가는 규칙이 외부 개체에 의해 정의된 규칙 세트에 통합하기에 적합한지 여부를 결정하는 것을 포함한다. 규칙은 외부 개체와 연관된 사용자 장치가 규칙을 사용하여 정의된 치료 작업흐름이 규칙에 대응하는 병태를 치료하는 데 적합하다고 지시할 때 적 합할 수 있다. 위의 예시를 계속해서 설명하면 림프종 치료 규칙을 외부 의료 센터에서 사용할 수 있다. 외부 의료 센터와 연관된 사용자는 림프종 치료에 대한 규칙이 외부 의료 센터에서 정의한 규칙 세트에 통합되기에 적합하다고 결정한다. 따라서, 규칙이 외부 의료 센터에서 정의한 커스텀 규칙 베이스로 통합된 후, 외부 의료 센터와 연관된 다른 사용자가 사용자 규칙 베이스로부터 통합 규칙을 선택함으로써 통합된 규칙을 실행할 수 있 을 것이다. 추가로, 클라우드 서버는 치료-계획 정의 인터페이스가 외부 개체와 연관된 사용자 장치로부터 커스텀 규칙 베이스로의 규칙의 통합에 대응하는 입력을 수신할 때 생성되거나 생성된 신호를 검출함으로써 사 용된 규칙의 통합을 모니터링한다. 다른 예로서, 외부 개체와 연관된 사용자 장치는 치료-계획 정의를 사용하여 상호대화-특정적 수정된 버전의 규 칙을 커스텀 규칙 베이스에 통합한다. 상호 대화-특정적 수정 버전의 규칙은 커스텀 규칙 베이스에 통합되기 위 해 선택된 규칙의 일부이다. 통합을 위해 규칙의 일부를 선택하는 것은 커스텀 규칙 베이스에 통합하기 위해 규 칙에 포함된 모든 기준보다 적게 선택하는 것을 포함한다. 위의 예시를 계속 들면, 외부 개체와 연관된 사용자 장치는 \"IF '림프절 생검이 림프종 세포가 있음을 지시함'\"의 기준을 커스텀 규칙 베이스에 통합되도록 선택하 지만, 사용자 장치는 \"혈액 검사에서 림프종 세포가 있음이 나타남\"의 기준을 커스텀 규칙 베이스에 통합되도록 선택하지 않는다. 따라서, 커스텀 규칙 베이스에 통합된 규칙의 상호 대화-특정적 수정 버전의 규칙은 \"IF '림 프절 생검에서 림프종 세포가 있음을 지시함' THEN '화학요법으로 치료' AND '능동 감시'\"이다. \"혈액 검사에서림프종 세포가 있음이 나타남\"의 기준이 규칙으로부터 제거되어 커스텀 규칙 베이스로 통합되는 상호대화-특정 적 수정 버전의 규칙을 생성할 수 있다. 블록에서, 클라우드 서버는 상호대화-특정적 수정 버전의 규칙이 외부 개체에 의해 정의된 커스텀 규 칙 베이스로 통합되었음을 검출할 수 있다. 일단 검출되면, 클라우드 서버는 클라우드 네트워크의 중 앙 데이터 저장소에 저장된 규칙을 업데이트할 수 있다. 규칙은 모니터링된 상호대화(들)에 기초하여 업데이트 될 수 있다. 이 예에서 \"~에 기초하여\"라는 용어는 모니터링된 상호대화(들)의 \"평가 후\" 또는 \"평가 결과를 사 용하는 것\"에 대응한다. 예를 들어, 클라우드 서버는 외부 개체와 연관된 사용자 장치가 규칙의 상호대화- 특정적 수정 버전의 규칙을 통합했음을 검출한다. 상호대화-특정적 수정 버전의 규칙을 검출하는 것에 응답하여, 클라우드 서버는 중앙 데이터 저장소에 저장된 규칙을 기존 규칙에서 상호대화-특정적 수정 버 전의 규칙으로 업데이트할 수 있다. 일부 실시예에서, 클라우드 서버는 외부 개체에 걸쳐 이용될 업데이트된 버전을 생성함으로써 규칙을 업데 이트한다. 또 다른 원본 버전은 업데이트되지 않은 상태로 남아 있을 수 있으며 치료의 기준 및 특정 유형을 식 별하는 하나 이상의 통신이 수신된 사용자 장치와 관련된 사용자에게 제공된다. 예를 들어, 클라우드 서버(13 5)는 중앙 데이터 저장소에 저장된 규칙을 업데이트하지만, 클라우드 서버는 중앙 데이터 저장소에 저장된 규칙 세트의 다른 규칙을 업데이트하지 않는다. 일부 실시예에서, 클라우드 서버는 업데이트 조건이 충족되었을 때 규칙을 업데이트할 수 있다. 업데이트 조건은 임계값일 수 있다. 예를 들어, 임계값은 수정 버전의 규칙을 커스텀 규칙 베이스에 통합한 외부 개체의 수 또는 퍼센티지일 수 있다. 또 다른 예로, 훈련된 머신-러닝 모델의 출력을 이용하여 업데이트 조건이 결정될 수 있다. 설명을 위해, 클라우드 서버는 외부 개체로부터 수신된 검출된 신호를, 규칙을 사용할지 여부 및 사용할 때 및/또는 업데이트된 버전의 규칙을 사용할지 여부 및 사용할 때를 자동으로 결정하는 다중 무장 도적 모델(multi-armed bandit model)에 입력할 수 있다. 검출된 신호는 외부 개체가 규칙을 커스텀 규칙 베이스에 통합했는지 여부 또는 외부 개체가 상호대화-특정적 수정 버전의 규칙을 통합할지 여부를 지시한다. 일부 실시예에서, 클라우드 서버는 동일한 변수 유형에 대응하는 기준을 포함하고 동일하거나 유사한 유형 의 치료를 식별하는 규칙의 세트의 복수의 규칙을 식별한다. 변수 유형은 기준의 조건으로 사용되는 값 또는 변 수일 수 있다. 규칙의 기준의 변수 유형은 또한 대상체의 집단을 서브-그룹으로 제한하는 조건의 임의의 값일 수 있다. 예를 들어, 임산부의 모집단을 정의하는 규칙의 변수 유형은 \"IF '대상체가 임신 상태임'\"이다. 클라"}
{"patent_id": "10-2022-7043580", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "우드 서버는 새로운 규칙이 일반적으로 개체들에 걸쳐 사용 가능한 경우, 다중 규칙의 요약 표현인 새로운 규칙을 결정한다. 일부 실시예에서, 클라우드 서버는 대상체의 속성의 세트를 수신하도록 구성된 또 다른 인터페이스를 제공 한다. 예를 들어, 사용자 장치를 작동하여 다른 인터페이스에 액세스하고 다른 인터페이스를 사용하여 속성의 집합을 포함하는 대상체 레코드를 선택한다. 대상체 레코드의 선택은 클라우드 서버가 대상체의 속성의 세 트를 수신하게 할 수 있다. 클라우드 서버는 대상체의 속성의 세트에 기초하여 기준이 충족되는 특정 규칙 을 식별(예를 들어, 결정)한다. 예를 들어, 중앙 데이터 저장소에 저장된 규칙의 기준에 대해 대상체 레코드의 속성 집합을 평가한다. 설명을 위해, 속성의 세트가 \"임신\" 값을 포함하는 데이터 필드를 포함하고, 규칙이 \"IF '대상체가 임신 상태임\"이라는 단일 기준을 포함하는 경우, 클라우드 서버는 이 규칙을 식별한다. 클라우 드 서버는 특정 규칙 및 특정 규칙과 연관된 각각의 특정 유형의 치료를 제시하도록 다른 인터페이스를 업 데이트한다. 일부 실시예에서, 규칙의 기준은 특정 인구통계학적 변수 및/또는 특정 증상-유형 변수와 관련된 변수 유형이다. 인구통계학적 변수의 비제한적인 예로는 대상체의 인구통계학적 정보, 가령, 나이, 성별, 민족성, 인 종, 소득 수준, 교육 수준, 위치 및 기타 적절한 인구통계학적 정보 항목을 특징짓는 정보 항목이 포함된다. 증 상 유형 변수의 비제한적인 예는 대상체가 특정 증상(가령, 호흡 곤란, 실신, 임계 온도를 넘는 발열, 임계 혈 압을 넘는 혈압 등)을 현재 또는 최근에(가령, 마지막 방문 시, 섭취 시, 24시간 이내, 일주일 이내) 경험했는 지 여부를 지시한다. 일부 실시예에서, 클라우드 서버는 대상체 레코드의 레지스트리의 데이터, 가령, 데이터 레지스트리 에 저장된 대상체 레코드를 모니터링한다. 클라우드 서버는 (블록에서 식별된) 규칙의 서브세트의 각 각의 규칙에 대해 대상체 레코드의 레지스트리의 데이터를 모니터링한다. 클라우드 서버는 규칙의 기준이 만족되고 특정 치료제가 대상체에 대해 처방된 대상체의 세트를 식별한다. 클라우드 서버는 대상체의 세트 의 각각에 대해, 평가 또는 검사로부터 또는 이를 사용하여 지시되는 대상체의 보고된 상태를 식별한다. 예를들어, 보고된 상태는 대상체의 상태, 가령, 대상체의 퇴원 여부, 대상체의 생존 여부, 대상체의 혈압 측정치, 대상체가 수면 동안 깨어난 횟수, 및 그 밖의 다른 적절한 상태를 특성화하는 모든 정보이다. 클라우드 서버 는 보고된 상태에 기초하여 특정 치료제에 대한 대상체의 세트의 추정된 반응성 메트릭을 결정한다. 예를 들어, 규칙의 특정 치료가 약물을 처방하는 것인 경우, 추정된 반응성 메트릭은 약물이 대상체가 경험한 증상 또는 병태를 해결한 정보를 나타낸다. 비제한적인 예로서, 대상체 세트의 추정된 반응성 메트릭은 평균, 가중 평균, 또는 대상체 세트의 각각의 대상체에 할당된 점수의 임의의 합계일 수 있다. 점수는 치료에 대한 대상체 의 반응성을 나타내거나 측정할 수 있다. 클라우드 서버는 규칙 세트의 서브세트 및 대상체 세트의 추정된 반응성 메트릭이 치료-계획 정의 인터페이스에서 디스플레이되거나 그 밖의 다른 방식으로 표시되게 할 수 있다. III.C. 유사한 대상체에게 처방된 치료제를 사용하여 연관 효능이 있는 권장되는 치료제 제공 도 4는 대상에 대한 치료제를 추천하기 위한 프로세스를 예시하는 흐름도이다. 프로세스는 클라우드 서버에 의해 수행되어 의료 개체와 연관된 사용자 장치에 대상체에 대한 권장 치료제 및 각각의 권장 치료 의 효능을 디스플레이할 수 있다. 권장되는 치료제는 기존에 유사한 대상체에게 처방된 치료제의 효능을 평가한 결과를 통해 식별될 수 있다. 블록에서, 클라우드 서버는 대상체의 양태를 특징짓는 대상체 레코드에 대응하는 입력을 수신한다. 입력은 개체와 연관된 사용자 장치로부터 수신된다. 또한, 사용자 장치가 대상체 레코드의 레지스트리를 관리하 도록 구성된 플랫폼의 인스턴스와 연관된 인터페이스를 사용하여 대상체 레코드를 선택하거나 그 밖의 다른 방 식으로 식별하는 것에 응답하여 입력이 수신된다. 사용자 장치는 클라우드 네트워크 내에 연결된 웹 서버 (도시되지 않음)에 저장된 인터페이스 데이터를 로딩함으로써 인터페이스를 액세스할 수 있다. 웹 서버는 클라 우드 서버 상에 포함되거나 실행될 수 있다. 블록에서, 클라우드 서버는 블록에서 수신된 대상체 레코드로부터 대상체 속성의 세트를 추출한 다. 대상체 속성은 대상체의 양태를 특징짓는다. 대상체 속성의 비제한적인 예는 전자 의료 레코드에서 발견된 임의의 정보, 임의의 인구 통계학적 정보, 나이, 성별, 민족성, 최근 또는 과거 증상, 병태, 병태의 중증도, 및 대상체를 특징 짓는 그 밖의 다른 임의의 적절한 정보를 포함한다. 블록에서, 클라우드 서버는 대상체 속성의 세트를 사용하여 대상체 레코드의 어레이 표현을 생성한다. 예를 들어, 어레이 표현은 대상체 레코드에 포함된 값의 벡터 표현이다. 벡터 표현은 도메인 공간에 서, 가령, 유클리드 공간에서의 벡터일 수 있다. 그러나 어레이 표현은 대상체 레코드의 데이터 필드의 값에 대 한 임의의 숫자 표현일 수 있다. 일부 실시예에서, 클라우드 서버는 특징 분해 기법, 가령, 특이값 분해 (SVD)를 수행하여 대상체 레코드의 어레이 표현의 대상체 속성의 세트를 나타내는 값을 생성할 수 있다. 블록에서, 클라우드 서버는 다수의 다른 대상체를 특징 짓는 다른 어레이 표현의 세트를 액세스한다. 다른 어레이 표현의 세트에 포함된 어레이 표현은 다른 대상체(가령, 여러 다른 대상체 중 하나)를 특징 짓는 대상체 레코드의 벡터 표현일 수 있다. 블록에서, 클라우드 서버는 대상체를 나타내는 어레이 표현과 다른 대상체 각각의 어레이 표현 사이 의 유사성을 나타내는 유사도 점수를 결정한다. 예를 들어, 유사도 점수는 대상체를 나타내는 어레이 표현과 다 른 대상체를 나타내는 어레이 표현 사이의 거리(도메인 공간에서의 거리)의 함수를 사용하여 계산된다. 설명을 위해 그리고 비제한적 예를 들면, 유사도 점수가 \"0\" 내지 \"1\"의 범위를 사용하여 계산될 수 있으며, 이때 \"0\" 은 정의된 임계값을 초과하는 거리를 나타내고 \"1\"은 어레이 표현들 사이에 거리가 없음을 나타낸다. 블록에서, 클라우드 서버는 다수의 다른 대상체의 제1 서브세트를 식별한다. 대상체와 연관된 유사도 점수가 지정된 절대적 또는 상대적 임계값을 초과할 때 대상체는 제1 서브세트에 포함될 수 있다. 마찬가지로, 블록에서, 클라우드 서버는 다수의 다른 대상체의 제2 서브세트를 식별한다. 그러나, 이 대상체의 유사도 점수가 지정 범위 내에 있는 경우 대상체는 제2 서브세트에 포함될 수 있다. 블록에서, 클라우드 서버는 다수의 다른 대상체의 제1 서브세트 및 제2 서브세트에서 각각의 대상체 에 대한 레코드 데이터를 검색한다. 레코드 데이터는 대상체를 특징짓는 레코드에 포함된 속성을 포함한다. 예 를 들어, 레코드 데이터는 대상체가 받은 치료제와 치료제에 대한 대상체의 반응을 식별한다. 치료제에 대한 반 응성은 텍스트(가령, \"대상체가 치료제에 긍정적으로 반응함\") 또는 대상체가 치료제에 대해 긍정적 또는 부정 적으로 반응한 정도를 지시하는 점수(가령, \"0\" 내지 \"1\"의 점수이며, 이때 \"0\"은 부정적인 반응을 지시하고 \"1\"은 긍정적인 반응을 지시함)로 나타내어질 수 있다.블록에서, 클라우드 서버는 사용자 장치 상의 인터페이스에서 표시되도록 출력을 생성한다. 출력은 예를 들어 제1 및 제2 서브세트의 다른 대상체가 받은 치료제, 제1 및 제2 서브세트의 대상체의 치료 반응성, 및 제2 서브세트의 대상체의 대상체 속성과 대상체의 대상체 속성 간 차이를 지시할 수 있다. 일부 실시예에서, 클라우드 서버는 상기 대상체 및 제1 또는 제2 서브세트로부터의 대상체 중 하나가 동일 한 의료 개체에 의해 치료 받고 있거나 치료를 받았었음을 결정한다. 클라우드 서버는 상기 대상체 및 제1 또는 제2 서브세트의 다른 대상체가 상이한 의료 개체에 의해 치료 받고 있거나 치료를 받았었음을 결정한다. 클라우드 서버는 인터페이스를 통해 대상체의 레코드의 상이하게 난독화된 버전을 이용할 수 있다. 기술적 인 이점으로서, 클라우드-기반 애플리케이션은 상이한 관할권의 데이터-프라이버시 규칙에 의해 데이터 공유에 부과되는 다양한 제약조건을 기반으로 개체에게 상이하게 난독화된 레코드 버전을 자동으로 제공할 수 있다. 일 부 실시예에서, 클라우드 서버는 최근접 이웃 학습 기술을 사용하여 제1 서브세트 및 제2 서브세트를 식별 한다. III.D. 외부 개체로부터의 쿼리 결과의 자동 난독화 도 5는 데이터-프라이버시 규칙을 준수하기 위해 쿼리 결과를 난독화하기 위한 프로세스를 예시하는 흐름 도이다. 프로세스는 외부 개체와의 대상체 레코드의 데이터 공유가 데이터-프라이버시 규칙을 준수함을 보 장하는 실행 규칙으로서 클라우드 서버에 의해 수행될 수 있다. 클라우드-기반 애플리케이션에 의해 사용 자 디바이스가 데이터 레지스트리에서 쿼리 제약조건을 만족하는 대상체 레코드를 쿼리할 수 있다. 그러나 쿼리 결과는 외부 개체로부터 기원한 데이터 레코드를 포함할 수 있다. 따라서, 프로세스에 의해 클라우드 서버는 데이터-프라이버시 규칙을 준수하면서 외부 개체로부터 치료제에 대한 추가 정보를 사용자 장치에 제공할 수 있다. 블록에서, 클라우드 서버는 제1 개체와 연관된 사용자 장치로부터 쿼리를 수신한다. 예를 들어, 제1 개체는 대상체 레코드의 제1 세트와 연관된 의료 센터이다. 쿼리는 의학적 병태 또는 데이터 레지스트리의 쿼리 검색을 제한하는 임의의 다른 정보와 연관된 증상의 세트를 포함할 수 있다. 블록에서, 클라우드 서버는 사용자 장치로부터 수신된 쿼리를 사용하여 데이터베이스에 쿼리한다. 블 록에서, 클라우드 서버는 증상의 세트에 대응하고 의학적 병태와 연관된 쿼리 결과의 데이터 세트를 생성한다. 예를 들어, 사용자 장치는 림프종 진단을 받은 대상체의 대상체 레코드에 대한 쿼리를 전송한다. 쿼 리 결과는 (제1 개체로부터 기원하거나 거기서 생성된) 대상체 레코드의 제1 세트로부터의 적어도 하나의 대상 체 레코드 및 제2 개체(가령, 제1 개체와 상이한 의료 센터)와 연관된 대상체 레코드의 제2 세트로부터의 적어 도 하나의 대상체 레코드를 포함한다. 대상체 레코드의 제1 세트로부터의 대상체 레코드와 대상체 레코드의 제2 세트로부터의 대상체 레코드 각각은 대상체 속성의 세트를 포함할 수 있다. 대상체 속성은 대상체의 임의의 양 태를 특징 지을 수 있다. 블록에서, 클라우드 서버는 대상체 레코드의 제1 세트에 포함된 대상체 레코드에 대한 대상체 속성의 세트를 전부 사용자 장치로 제공하는데(가령, 사용자 장치가 이용하게 하거나 그 밖의 다른 방식으로 이용 가능 하게 함), 이는 이들 레코드가 제1 개체로부터 기원한 것이기 때문이다. 대상체 레코드를 전부 제공하는 것은 대상체 레코드에 포함된 속성의 세트를 인터페이스를 이용해 평가 또는 상호대화를 위해 사용자 장치에 의해 이 용 가능하게 만드는 것을 포함한다. 블록에서, 클라우드 서버는, 추가로 또는 대안으로, 대상체 레코 드의 제2 세트에 포함된 각각의 대상체 레코드에 대한 대상체 속성의 세트의 불완전한 서브세트를 사용자 디바 이스에 제공한다. 대상체 속성의 세트의 불완전한 서브세트를 제공하는 것은, 대상체 속성의 불완전한 서브세트 가 대상체를 고유하게 식별하는 데 사용될 수 없기 때문에 대상체에게 익명성을 제공한다. 예를 들어, 불완전한 서브세트를 제공하는 것은 10개의 대상체 속성과 연관된 대상체를 익명화하기 위해 10개의 대상체 속성 중 4개 의 사용 가능한 것을 포함할 수 있다. 일부 실시예에서, 블록에서, 클라우드 서버는 제2 대상체에 포 함된 각각의 대상체 레코드에 대한 대상체 속성의 난독화된 세트를 이용한다. 속성의 세트를 난독화하는 것은 제공된 정보의 세분성을 줄이는 것을 포함한다. 예를 들어, 대상체의 주소의 대상체 속성을 사용하는 대신, 난 독화된 속성은 대상체가 거주하는 곳의 우편 번호 또는 주일 수 있다. 불완전한 대상체 또는 난독화된 대상체가 이용 가능한지에 무관하게, 클라우드 서브는 대상체 레코드와 연관된 대상체를 익명화한다. III.E. 자체-학습 지식 베이스와 챗봇의 통합 도 6은 봇 스크립트, 가령, 챗봇을 이용해 사용자와 통신하기 위한 프로세스를 예시하는 흐름도이다. 프로 세스는 새로운 질문에 대한 응답을 제공하기 위해 지식 베이스 내 기존 질문으로 사용자에 의해 제공된 새로운 질문을 자동으로 연결하기 위해 클라우드 서버에 의해 수행될 수 있다. 챗봇은 병태와 연관된 질문에 답을 제공하도록 구성될 수 있다. 블록에서, 클라우드 서버는 답의 세트를 포함하는 지식 베이스를 정의한다. 지식 베이스는 메모리에 저장된 데이터 구조일 수 있다. 데이터 구조는 정의된 질문에 대한 답의 세트를 나타내는 텍스트를 저장한다. 각각의 답은 통신 세션 동안 사용자 장치로부터 수신된 질문에 대한 응답으로 챗봇에 의해 선택될 수 있다. 지 식 베이스는 (가령, 데이터 소스에서 텍스트를 검색하고 자연어 처리 기술을 사용하여 텍스트를 구문 분석함으 로써) 자동으로 정의되거나 (가령, 연구원 또는 의사에 의해) 사용자 정의될 수 있다. 블록에서, 클라우드 서버는 특정 사용자 장치로부터 통신을 수신한다. 통신은 특정 챗봇과의 통신 세 션을 개시하라는 요청에 대응한다. 예를 들어, 의사 또는 대상체는 채팅 세션에서 챗봇과 통신하기 위해 사용자 장치를 작동시킬 수 있다. 클라우드 서버(또는 클라우드 서버 내에 저장된 모듈)는 사용자 장치와 챗 봇 간의 통신 세션의 수립을 관리하거나 촉진시킬 수 있다. 블록에서, 클라우드 서버는 통신 세션 동 안 특정 사용자 장치로부터 특정 질문을 수신한다. 질문은 자연어 처리 기술을 사용하여 처리되는 텍스트 문자 열일 수 있다. 블록에서, 클라우드 서버는 특정 질문으로부터 추출된 적어도 일부 단어를 사용하여 지식 베이스에 쿼리한다. 자연어 처리 기술을 사용하여 특정 질문을 나타내는 텍스트 문자열로부터 단어가 추출될 수 있다. 블 록에서, 클라우드 서버는 지식 베이스가 특정 질문의 표현을 포함하지 않는다고 결정한다. 이 경우, 수신된 질문이 챗봇에 새롭게 제기될 수 있다. 블록에서, 클라우드 서버는 지식 베이스로부터 또 다 른 질문 표현을 식별한다. 클라우드 서버는 사용자 장치로부터 수신된 질문을 지식 베이스에 저장된 다른 질문 표현과 비교함으로써 다른 질문 표현을 식별할 수 있다. 예를 들어, 자연어 처리 기술을 사용한 질문 표현 의 분석에 기초하여 유사도가 결정되는 경우, 클라우드 서버는 다른 질문 표현을 식별한다. 블록에서, 클라우드 서버는 지식 베이스에서 다른 질문 표현과 연관된 답 세트 중 한 답을 검색한다. 블록에서, 지식 베이스가 수신된 질문의 표현을 포함하지 않더라도, 블록에서 검색된 답이 수신된 질 문에 대한 답으로서 특정 사용자 장치로 전송된다. 블록에서, 클라우드 서버는 특정 사용자 장치로부 터 지시자를 수신한다. 예를 들어, 지시자는 챗봇에 의해 제공된 답변이 특정 질문에 대한 응답이었음을 지시하 면서 사용자 장치에 대한 응답으로 수신될 수 있다. 블록에서, 클라우드 서버는 특정 질문의 표현 또는 특정 질문의 상이한 표현을 포함하도록 지식 베이 스를 업데이트한다. 예를 들어, 질문의 표현을 저장하는 것은 질문에 포함된 키워드를 데이터 구조에 저장하는 것을 포함한다. 클라우드 서버는 또한 특정 질문의 동일하거나 상이한 표현을 특정 사용자 장치에 전송된 더 많은 답과 연관시킬 수 있다. 일부 실시예에서, 클라우드 서버는 특정 사용자 장치와 연관된 대상체 레코드를 액세스한다. 클라우드 서 버는 특정 질문에 대한 복수의 답을 결정한다. 그런 다음 클라우드 서버는 답의 세트로부터 하나의 답을 선택한다. 그러나 답의 선택은 특정 사용자 장치와 연관된 대상체 레코드에 포함된 하나 이상의 값에 적어 도 부분적으로 기초한다. 예를 들어, 대상체 레코드에 포함된 값은 대상체가 최근에 경험한 증상을 나타낼 수 있다. 챗봇은 대상체가 최근에 경험한 증상에 따라 답변을 선택할 수 있다. III.F. 다발성 경화증 치료제에 대한 반응 예측 및 다발성 경화증 진행 모니터링을 위한 모듈 도 7a 및 7b는 하위 집단을 특성화하고 대상체-특정 예측을 생성하기 위해 동적 및 분산 소스 데이터를 나타내 는 스냅샷 데이터 저장소를 구축 및 사용하기 위한 예시적인 프로세스(700a 및 700b)를 도시하는 흐름도를 도시 한다. 프로세스(700a)(도 7a에 도시됨)는 블록(705a-705e)에서 시작되며, 다발성 경화증이 가능하거나, 가능성 이 있거나 또는 확인된 대상체에 관한 정보를 식별하는 입력의 수신이 이뤄진다. 다양한 블록에서 수신된 입력 은 상이한 컴퓨팅 시스템으로부터 상이한 사용자와 관련하여 상이한 시간에 수신될 수 있다. 입력은 클라우드- 기반 애플리케이션 시스템에 의해 생성 및/또는 관리되는 인터페이스(가령, 웹-기반 또는 앱-기반 인터페이스) 를 통해 수신될 수 있다. 블록(705a)에서, 대상체가 경험한 하나 이상의 증상 및/또는 대상체의 임상 평가를 식별하는 입력이 수신된다. 증상은 본원에서 확인된 하나 이상의 다발성 경화증 증상, 하나 이상의 신경계, 및/또는 하나 이상의 기능계와 연관된 하나 이상의 증상을 포함할 수 있다. 임상 평가는 (예를 들어) 대상체의 이동성, 대상체의 장애(가령, EDSS와 같은 정의된 장애 척도에 따른 것), 주어진 작업을 수행하는 데 필요한 시간 식별(가령, 특정 거리를 걷 거나, 페그 테스트(peg test)를 수행하는 데 필요한 시간 등), 작업 수행(가령, 기억 작업, 인지 작업 등)의 정확성 식별 등을 포함할 수 있다. 블록(705a)에서 수신된 입력은 (예를 들어) 의료 제공자, 의사, 신경과 의사, 전담 간호사, 간호사, 진료실, 병원 및/또는 대상체로부터 입력될 수 있다. 블록(705b)에서, 대상체와 연관된 하나 이상의 검사 결과를 식별하는 입력이 수신된다. 검사 결과는 다발성 경 화증을 진단 및/또는 평가하기 위해 사용되는 하나 이상의 검사, 가령, 섹션 II에서 식별된 검사(가령, MRI, CSF 분석, 시각적 유발 전위 검사 및/또는 혈액 검사)의 결과를 포함할 수 있다. 블록(705b)에서 수신된 입력은 (예를 들어) 검사실 기술자, 방사선 전문의, 검사실 및/또는 영상 센터로부터 제공될 수 있다. 블록(705c)에서, 대상체에 대한 가능한, 가능성 있는 또는 확인된 진단을 식별하는 입력이 수신된다. 진단은 신 경 질환, 다발성 경화증 또는 다발성 경화증의 하위 유형(가령, 섹션 II에서 식별된 것)을 포함할 수 있다. 블 록(705c)에서 수신된 입력은 (예를 들어) 신경과 전문의, 의사, 간호사, 전담 간호사(nurse practitioner), 의 사 진료실 또는 병원으로부터의 입력일 수 있다. 선택적 블록(705d)에서, 대상체에 대한 치료제를 식별하는 입력이 수신된다. 치료제는 대상체에 대해 처방되었 거나 처방되고 있는 것이거나 대상체에 대해 고려 중인 것일 수 있다. 치료제는 본 명세서(예를 들어, 섹션 I I)에 기재된 것과 같은 다발성 경화증 치료제를 포함할 수 있다. 선택적 블록(705e)에서, 대상체의 자체-평가를 식별하는 입력이 수신된다. 대상체의 자체-평가는 웰빙, 증상 표 현, 마음의 상태, 활동 수준, 사회적 참여, 치료 목표 등에 대응할 수 있다. 어떤 경우에는, 블록(705e)에서 수 신된 입력의 적어도 일부가 삶의 질에 대한 설문, 가령, 다발성 경화증의 삶의 질-54 설문지에 대한 응답이다. 주어진 박스에서 수신된 입력은 여러 번 수신될 수 있음이 이해될 것이다. 예를 들어, 상자(705a)에서의 증상 식별은 여러 번 보고될 수 있다(예를 들어, 증상의 현재 상태를 반영함). 입력은 클라우드-기반 애플리케이션을 사용하여, 블록에서 특정 대상체에 대한 레코드를 생성 및/또는 업 데이트하는 데 사용된다. 어떤 경우에는, 입력을 입력하기 위해, 사용자가 먼저 기존 레코드를 찾거나 새 레코 드를 만들어야 할 수도 있다. 어떤 경우에는, 입력이 자동으로 수락되고, 클라우드 시스템이 대상체-식별 정보 가 레코드와 충분히 일치하는지 여부를 결정한다(일치하지 않은 경우 새 레코드를 생성할 수 있음). 각각의 입 력에 의해 전달된 데이터는 타임스탬프 및 소스와 연관될 수 있다. 어떤 경우에는, (가령, 보다 구조화된 및/또 는 표준 형식으로 데이터를 저장하는 것을 용이하게 하기 위해) 데이터가 처리된다. 예를 들어, 특정 숫자가 범 위로 변환될 수 있거나, MRI 이미지가 이미지 처리를 통해 처리되어 통계를 생성할 수 있는 등이다. 선택적 블록에서, 레코드 스냅샷이 생성된다. 레코드 스냅샷은 정의된 시간에 또는 정의된 시간 간격을 두 고 또는 특정 유형의 입력에 응답하여 생성될 수 있다. 예를 들어, 새로운 진단, 치료, 증상 및/또는 MRI 결과 를 검출하면 새로운 스냅샷이 생성될 수 있다. 스냅샷은 필드의 세트의 각각의 필드에 대한 값을 포함할 수 있 다. 필드의 세트는 대응하는 대상체(가령, 인구통계학적 정보, 의료 이력 및/또는 행동 패턴을 통해), 진단, 진 단 이력, 현재 치료, 치료 이력(가령, 어떤 치료를 받았는지, 어느 기간 동안 및/또는 어느 시간 동안), 현재 증상, 증상 이력 및/또는 최근 자체-평가를 특징 지을 수 있다. 이들 모든 필드의 값은 잠재적으로 모두 동시에 제공되지 않을 수 있다. 따라서, 클라우드-기반 애플리케이션은 스냅샷-트리거 입력에 제공되지 않은 필드에 대 한 가장 최근 값을 식별할 수 있다. 경우에 따라, 가장 최근 값이 충분히 오래된 경우, 스냅샷에서 생략되거나 플래그가 지정될 수 있다. 블록에서, 데이터 저장소에서, 특정 치료제에 대응하는 과거 데이터를 포함하는 다른 레코드가 쿼리된다. 특정 치료제는 대상체가 받고 있는 것일 수도 있고 대상체를 위해 고려 중인 것일 수도 있다. 경우에 따라, 쿼 리는 특정 치료제가 적어도 1년 전에 개시되었음을 필요로 하는 것과 같은 시간적 제약을 포함한다(이후 데이터 를 사용할 수 있을 가능성이 높도록). 경우에 따라, 쿼리는 대상체의 하나 이상의 속성(가령, 나이, 지리, 질환 유형, 초기 다발성 경화증 진단으로부터의 기간, 장애 등)을 더 포함한다. 이러한 경우에, 쿼리는 대응하는 대 상체가 특정 치료가 시작된 때와 관련된 특정 시점에(또는 시간 동안) 해당 속성을 가졌음을 지시하는 레코드를 식별하도록 수행될 수 있다. 예를 들어, 속성은 특정 치료가 개시되었을 때 또는 그 직전에 대상체와 연관된 속 성일 수 있다. 또 다른 예로서, 특정 시간은 주어진 대상체(블록(705a-705e)에서 입력이 제공된 대상체)가 특정 치료를 받은 시간의 길이일 수 있다. 따라서 쿼리는 시간적 종속성 제한을 촉진시키기 위해 스냅샷을 이용해 수 행될 수 있다. 특히, 쿼리는 제1 시간 제약으로 수행될 수 있지만(예를 들어, 특정 속성을 특정 치료가 시작된 시간과 연관시 키는 레코드 및/또는 스냅샷을 검색하기 위해), 쿼리에 의해 반환된 데이터는 상이한 시간 기간(가령, 치료 개 시 후 약 1년, 특정 치료제 사용의 처음 2년, 특정 치료제의 시작과 특정 치료제의 종료 사이의 시간)과 연관될수 있다. 따라서, 예를 들어, 쿼리 제약 조건은 치료를 시작할 때 대상체가 5개 미만의 병변을 가져야 함을 나 타낼 수 있는 반면 쿼리의 결과는 치료제가 사용되는 동안 병변 수가 어떻게 변했는지를 나타낼 수 있다. 블록에서, 쿼리에 응답하여 제공된 레코드는 둘 이상의 서브-그룹으로 분할된다. 각각의 서브-그룹은 치료 제에 대한 상이한 유형의 반응에 대응할 수 있다. 예를 들어, 서브-그룹은 대상체가 치료를 받은 기간(가령, 더 긴 기간이 더 높은 효능을 암시함), MRI 진행과 관련하여, 장애 진행과 관련하여, 증상 발생과 관련하여, MS 서 브-유형에 걸친 진행(가령, 재발-완화에서 이차 진행성으로 진행) 및/또는 이들의 조합이 상이할 수 있다. 이 서브-그룹 분할은 치료 기간에 해당하는 시간 창(가령, 치료 시작부터 정의된 기간 내 또는 다른 치료가 사용될 때까지 치료 시작 사이) 내에서 레코드로부터 수집된 데이터 포인트에 기반하여 결정될 수 있다. 블록에서, 분류기는 대상체의 특성에 기초하여 서브-그룹 중 하나에 대상체를 할당하는 데 사용된다. 분류 기는 (예를 들어) 클러스터링 분류기, 신경망(가령, 퍼셉트론(perceptron), 의사 결정 트리, 랜덤 포레스트, 로 지스틱 회귀, 선형 회귀, 최근접 이웃, 나이브 베이즈), 구성요소-분석 분류기 등을 포함할 수 있다. 분류기는 각각의 서브-그룹과 연관된 하나 이상의 특징을 식별하고 대상체의 프로필이 주어진 클래스와 얼마나 유사한지 (가령, 하나 이상의 다른 서브-그룹에 대비하여)를 평가하는 유사도 메트릭을 생성하기를 학습할 수 있다. 분류 는 대상체가 치료제에 반응할지 여부 및/또는 정도에 대한 예측을 지시할 수 있다. 블록에서, 블록에서 생성된 분류에 기초하여 치료 예측 또는 추천에 대응하는 출력이 생성된다. 예를 들어, 출력은 대상체가 치료제에 반응할 것인지 여부에 대한 이진 예측, 대상체가 치료제에 반응할 확률, 일정 기간 동안의 치료제에 대한 대상체의 예측된 진행, 일정 기간 동안의 치료제에 대한 대상체에 대한 MRI 통계의 예측된 변화, 다른 질병 서브-유형으로 진행될 확률 등을 식별할 수 있다. 출력은 (예를 들어) 의료 제공자, 신 경과 의사, 의사 또는 대상체와 연관된 장치에 표시 및/또는 전송될 수 있다. 일부 예에서, 프로세스(700a)는 대상체에 대해 가장 유리한 예측 결과와 연관된 치료 옵션이 식별될 수 있도록 복수의 치료 옵션 각각에 대해 반복된다. 일부 경우에, 블록(740-755)의 일부 또는 전부가 자동으로 수행된다. 예를 들어, 블록에서의 쿼리는 대상 체에 대한 특정 유형의 입력(예를 들어, MRI 또는 장애 진행의 식별, 대상체에 대해 사용되거나 고려되는 새로 운 치료제의 식별, 또는 대상체에 대한 MS 서브-유형의 새로운 진단의 식별)을 수신하는 것에 응답하여, 일상적 인 시간 간격으로 수행될 수 있다. 쿼리는 대상체의 레코드에 반영된 대상체에 대해 사용되거나 고려되는 특정 치료제를 식별하는 제약조건을 포함하도록 구성될 수 있다. 쿼리는 제약조건을 충족하는 레코드에 대해 특정 지 정 필드 값(가령, MRI 결과, 재발 검출, 장애 평가, 이상 반응, 후속 치료 변경, 대상체 속성, 진단 및/또는 사 용된 이전 약물에 대응)을 요청할 수 있다. 요청된 특정 지정 필드 값은 특정 치료의 개시와 관련된 지정 기간 (예를 들어, 치료의 첫 해, 치료의 처음 2년 또는 치료 기간)과 연관될 수 있다. 또 다른 예로서, 자동화된 기술 또는 지정 기준이 블록에서 레코드를 분할하는 데 사용될 수 있다. 자동 화된 기술은 (예를 들어) MRI-변화 데이터, 장애-변화 데이터, 또는 치료 기간 사용 데이터를 포함할 수 있다. 지정 기준이 (예를 들어) 치료 기간 동안 검출된 새로운 병변의 임계 개수, 치료 기간 동안 검출된 장애 점수의 변경 및/또는 치료 기간의 검출된 재발의 수에 기초하여 레코드를 분리할 수 있다. 자동 처리의 한 가지 이점은 블록에서 생성된 출력을 수신하는 사용자로부터 레코드 데이터를 보호할 수 있다는 것이다. 즉, 사용자 또는 사용자 장치는 블록에서 쿼리에 의해 검색된 레코드로부터의 특정 값을 액세스할 권한이 없을 수 있다. 이는 빅 데이터를 계속 활용하면서 데이터 프라이버시를 촉진시킬 수 있다. 일부 예에서, 블록(720-735)의 일부 또는 전부는 (예를 들어, 블록(705a-705e) 중 어느 하나에서 수신된 입력을 제공한 사용자와 동일하거나 상이한 사용자로부터의) 입력에 응답하여 수행된다. 예를 들어, 사용자 입력이 제 약조건 충족을 검출할 때 쿼리를 통해 레코드 값이 검색될 필드를 선택할 수 있거나(블록에서) 및/또는 블 록에서 사용자 입력이 쿼리-결과 레코드를 서브-그룹으로 분리하기 위한 기준을 식별할 수 있다. 사용자가 블록(720-725)을 보다 능동적으로 제어하는 경우, 데이터 프라이버시를 보호하기 위해 데이터 표시 및/또는 시 각화가 추상화, 난독화 및/또는 일반화될 수 있다. 예를 들어, 특정 필드 값을 표시하는 대신 (가령, 쿼리에 의 해 검색된 레코드를 나타내는) 다양한 필드의 값의 분포 및/또는 통계가 표시될 수 있다. 분포 및/또는 통계는 식별 또는 개인 정보를 다시 표시하지 않도록 다변량 분포 및/또는 통계를 표시하는 대신 개별 필드에 대해 표 시될 수도 있다. 도 7b에 도시된 프로세스(700b)는 치료 예측 또는 권장을 알리기 위해 대상체 레코드를 사용하기 위한 또 다른 기술을 예시한다. 도 7b에 도식된 블록(705a-705e, 710 및 715)이 도 7a에 도식된 유사하게 번호가 매겨진 블록에 대응할 수 있다. 블록에서, 데이터 저장소에서, 대상체 레코드에 대응하는 과거 데이터를 포함하는 대 응하는 레코드가 쿼리된다. 예를 들어, 쿼리는 블록(705a-705e)에서 입력이 수신된 대상체와 연관된 하나 이상 의 증상, 검사 결과, 진단(가령, 다발성 경화증 하위유형), 치료제 및/또는 자체 평가를 식별할 수 있다. 일부 예에서, 쿼리는 블록(705a-705e)에서 입력을 통해 수신된 하나 이상의 값 또는 이의 처리된 버전을 포함한다. 예를 들어, 블록(705a)에서의 입력이 주어진 대상체가 27세이며, 아이오와주, 디모인의 특정 주소에 살고 있고, 8개의 T2-스캔 MRI 병변을 갖는 것으로 식별할 수 있는 반면, 쿼리 제약조건은 관심 스냅샷이 21 내지 30세의 미국에 살고 있으며, 6-10개의 T2 병변을 갖는 대상체와 연관될 것을 특정할 수 있다. 일부 예에서, 다른 대상체 스냅샷의 세트의 각각에 대해 블록(705a-705e)에서 입력이 수신된 주어진 대상체와 연관된 스냅샷 또는 레코드의 적어도 일부분을 사용하고 다른 대상체 스냅샷의 적어도 일부분에 기초하여 유사 도 점수가 생성된다. 상이한 필드가 점수를 생성하기 위해 상이한 가중치와 연관될 수 있다. 블록은 점수 가 지정 임계값 이상(예를 들어, 상위 백분위수 내 또는 특정 값 이상)이었던 다른 대상체 스냅샷을 식별하는 것을 포함할 수 있다. 도 7a의 블록에 대해 앞서 기재된 바와 같이, 도 7b의 블록에서 수행된 쿼리는 제1 시간 제약으로 수 행될 수 있지만(예를 들어, 특정 속성을 특정 치료가 시작된 시간과 연관시키는 레코드 및/또는 스냅샷을 검색 하기 위해), 쿼리에 의해 반환된 데이터는 상이한 시간 기간(가령, 치료 개시 후 약 1년, 특정 치료제 사용의 처음 2년, 특정 치료제의 시작과 특정 치료제의 종료 사이의 시간)과 연관될 수 있다. 따라서, 어떤 경우에는, (가령, 개별 스냅샷이 모든 제약 조건을 충족하도록) 쿼리의 제약조건이 개별 스냅샷에 적용될 수 있지만, 검색 된 레코드 정보는 (제약 조건이 충족되는 동일한 대상체와 연관된) 레코드의 다른 스냅샷 및/또는 다른 부분에 대응할 수 있다. 블록에서, 쿼리-결과 레코드는 치료제에 기초하여 서브-그룹으로 분할된다. 예를 들어, 각각의 쿼리 결과 는 주어진 치료제가 시작, 사용 중 및/또는 종료된 시점에 대응하는 데이터 포인트를 식별하는 대응하는 레코드 의 일부에 대응할 수 있다. 따라서 잠재적으로, 주어진 대상체에 대해, 각각 상이한 치료에 대응하는 다수의 쿼 리 결과가 식별된다. 블록에서의 하위 분할은 고유한 MS 치료를 식별하고 그에 따라 쿼리 결과를 분할하는 것을 포함할 수 있다. 어떤 경우에는, (가령, 다수의 치료제가 동일하거나 유사한 작용 기전과 연관될 때) 다수 의 치료제가 개별 그룹과 연관된다. 예를 들어, 인터페론-베타와 글라티라머 아세테이트는 함께 그룹화될 수 있 다. 또 다른 예로서, 디메틸 푸머레이트, 모노메틸 푸마레이트 및 디록시멜 푸마레이트가 함께 그룹화될 수 있 다. 또 다른 예로서, 오크렐리주맙, 오파투무맙, 유블리툭시맙 및 리툭시맙이 함께 그룹화될 수 있다. 블록에서, 각각의 서브-그룹에 대해 하나 이상의 반응 통계가 생성된다. 반응 통계는 (예를 들어) 치료를 받은 기간과 관련된 임상, MRI, 증상, 치료제 결정, 건강 지수, 이상 반응 및/또는 재발 데이터에 기초해 생성 될 수 있다. 반응 통계는 절대값(가령, 절대 병변 부하 및/또는 절대 장애 점수) 및/또는 치료 기간 동안 값의 변화(가령, 치료 시작 이후 병변 부하의 변화 및/또는 치료 시작 이후 장애 점수의 변화)를 반영할 수 있다. 반 응 통계(들)는 (예를 들어) T2 병변의 수, 강화 병변의 수, 강화 병변의 누적 수, 병변 부하, 위축 메트릭, 재 발 횟수, 장애 점수, 건강 지수, 대상체가 치료에 남아 있는 시간, 및/또는 본 명세서에 개시된 하나 이상의 다 른 MS 관련 변수에 기초할 수 있다. 경우에 따라 반응 통계는 다수의 메트릭에 기초한다. 예를 들어, 반응 통계 는 대상체가 일정 기간 동안 새로운 임의의 병변, 재발 또는 장애 진행을 경험했는지 여부를 나타내는 이진 값 을 포함할 수 있다. 반응 통계(들)는 (예를 들어) 단변량 분포, 다변량 분포, 평균, 중앙값, 최빈값, 왜곡, 범 위, 최댓값, 최솟값 및/또는 표준 편차를 포함할 수 있다. 반응 통계(들)는 특정 유형의 반응(예를 들어, 악화 되지 않는 것에 상응하는)이 관찰된 대상체의 백분율을 포함할 수 있다. 블록에서, 블록에서 생성/업데이트된 레코드와 연관된 대상체가 하나 이상의 치료제 각각에 반응 및/ 또는 권장 치료를 식별하는 방법에 대한 하나 이상의 예측에 대응하는 출력이 생성된다. 대상체가 치료제에 어 떻게 반응할지에 대한 예측이 대응하는 서브-그룹에 대해 생성된 반응 통계를 포함할 수 있다. 예를 들어, 예측 은 주어진 기간 동안 주어진 약물을 복용하는 경우 병변 부하 및 장애가 적어도 2년 동안 안정적으로 유지될 확 률을 44%로 식별할 수 있다. 권장 치료는 다른 치료제와 연관된 통계에 비해 하나 이상의 가장 유리한 반응 통 계와 연관될 수 있다. 출력은 사용자 장치로 전송 및/또는 (예를 들어, 의료 제공자, 의사, 신경과 의사 또는 대상체에게) 로컬하게 표시될 수 있다. 출력은 블록에서 생성된 반응 통계 중 하나, 그 이상 또는 모두를 포함할 수 있으며, 이는 대응하는 치료제와 연관하여 식별될 수 있다. 도 7a에 도시된 바와 같이, 쿼리 및 후속 처리의 일부 또는 전부가 자동으로 또는 사용자 입력에 응답하여 수행 될 수 있다. 예를 들어, 지정 규칙은 어떤 대상체 속성이 쿼리에 사용될 것인지(예를 들어, 어떻게 일반화되어야 하는지)를 식별하거나, 사용자 입력이 유사한 정보를 식별할 수 있다. 또 다른 예로서, 지정된 프로토콜은 블록에서 어떤 유형의 통계가 생성될 것인지를 지시할 수 있다. 또 다른 예로서, 인터페이스는 하나 이상 의 유형의 반응 변수(가령, 새로운 병변 수, 새로운 재발 수, 장애 진행, 이상 반응 수) 각각에 대해, 서브-그 룹 각각에 대한 분포를 (가령, 중첩된 선 또는 별도의 그래프로서) 표시할 수 있다. 그런 다음 사용자는 관심 반응 변수를 선택하고 각각의 치료 유형에 대해 생성될 하나 이상의 통계를 정의할 수 있다. 따라서, 도 7a 및 7b에 도식된 프로세스(700a 및 700b) 각각이 빅-데이터 처리를 이용해 치료제를 식별하는 것 을 촉진시킬 수 있다. 유사한 접근법이 (예를 들어, 주어진 치료제의 사용과 연관되거나 특정 치료와 무관하게) 예측된 예후를 생성하기 위해 사용될 수 있음을 이해할 것이다. 일부 예에서, 데이터 저장소는 보다 일반적인 치료제 예측 및/또는 지시자를 생성하는 데 사용될 수 있다(가령, 개별 대상체에 반드시 연결될 필요는 없음). 도 8은 하이-레벨 치료-반응 예측 및/또는 지시자를 생성하기 위해 스냅샷 데이터 저장소를 사용하기 위한 예시적인 프로세스를 예시하는 흐름도를 도시한다. 프로세스 는 대상체가 특정 치료를 받았다는 지시자를 포함하는 레코드가 데이터 저장소에서 쿼리되는 블록에서 시 작한다. 쿼리는 특정 치료제가 적어도 특정 날짜(가령, 1년 이상 전, 2년 이상 전, 5년 이상 전)에 시작되었음 을 특정할 수 있다. 어떤 경우에, 쿼리는 특정 치료제를 시작할 때 대상체가 가지고 있었던 다발성 경화증의 하 위 유형과 같은 하나 이상의 다른 제약 조건을 추가로 특정한다. 블록에서 쿼리된 데이터 저장소는 본 명 세서에 개시된 하나 이상의 입력 유형 및/또는 변수에 기초하여 생성된 것을 포함할 수 있다. 경우에 따라, 데 이터 저장소는 추정된 시간-동기화된 데이터 포인트를 반영하기 위해 각각의 개별 대상체와 연관된 스냅샷 세트 를 포함한다. 블록에서, 각각의 쿼리-응답성 레코드에 대해 관심 지속시간이 식별된다. 관심 지속시간은 특정 치료의 시 작에서 시작되고 하나 이상의 반응 메트릭이 평가될 시간 주기에 대응할 수 있다. 어떤 경우에는, 관심 지속시 간이 쿼리-응답성 레코드에서 동일하다(가령, 1년, 2년, 5년). 어떤 경우에, 관심 지속시간은 특정 치료가 사용 된 기간으로 정의된다. 어떤 경우에는, 관심 지속시간은 특정 치료제의 사용 기간과 특정 시간 중 더 짧은 것이다. 블록에서, 쿼리-결과 레코드는 치료제-반응 서브-그룹으로 분할된다. 레코드는 (도 7a에 도시된 바와 같이) 프로세스(700a)에서 블록과 관련하여 기재된 하나 이상의 기술에 따라 및/또는 하나 이상의 변수에 기초하여 분할될 수 있다. 어떤 경우에는, 레코드가 두 개의 서브-그룹(진행 및 진행 없음, 새로운 병변 및 새 로운 병변 없음, 새로운 증상 및 새로운 증상 없음, 중등도-중증 이상 반응 및 이상 반응이 없거나 경미함, 적 어도 임계 시간 동안의 치료제의 사용 및 임계 시간 미만 동안의 치료제의 사용)으로 분할된다. 경우에 따라, 서브-그룹 할당이 둘 이상의 변수에 따라 달라진다. 어떤 경우에는, 셋 이상의 서브-그룹이 존재한다. 레코드 분할에 사용되는 변수 값은 블록에서 식별된 관심 지속시간과 연관된 레코드 항목으로부터 추출되 었을 수 있다. 예를 들어, 관심 지속시간이 1년인 것으로 식별되는 경우: 각각의 쿼리-결과 레코드에 대해, 레 코드에서 치료 반응을 나타내고 치료 시작부터 약 1년인 타임스탬프와 연관된 엔트리(가령, MRI 데이터, 임상 평가, 약물 상태)가 검색될 수 있다. 또 다른 예로서, 관심 지속시간이 치료 지속시간으로 식별되는 경우, 치료 개시 이후의 타임스탬프와 연관되고 약물의 변경을 지시하는 스냅샷을 통해 연장된 모든 스냅샷이 식별될 수 있 다. 따라서 대상체가 2013년04월에 치료를 시작하고 2016년05월에 치료를 종료한 경우 2017년10월에 대상체의 병변 수 또는 장애는 (관심 지속시간에 따라 결정) 레코드의 세분화와 관련이 없을 수 있다. 블록에서, 각각의 서브-그룹에 대해 하나 이상의 통합 속성 통계가 생성된다. 통합 통계는 대상체가 특정 치료를 받기 시작한 시점에서 서브-그룹의 대상체의 속성을 특성화할 수 있다. 통합 속성 통계(들)는 (예를 들 어) 대상체의 나이, 성별, 위도, 거주 주, 거주 국가, MS의 하위 유형, 약물 이력, 병변 수, 병변 부하, 장애 점수, 이동성 지시자, 보행 보조기 사용, 동반 이환 상태, 증상에 의해 영향을 받는 기능계 및/또는 초기 MS 진 단 이후에 걸린 시간에 대응할 수 있으며, 다시, 치료가 개시된 시점에서 다시 고려된다. 통합 속성 통계는 평 균, 중앙값, 최빈값, 범위, 최솟값, 최댓값, 이상값, 분포, 왜곡 등을 포함할 수 있다. 블록에서, 치료제 지시자 및/또는 예측에 대응하는 출력이 생성된다. 예를 들어, 출력은 특정 치료제가 효 과적이었던 서브-그룹과 연관된 속성 특성을 (가령, 하나 이상의 속성 통계를 통해) 식별할 수 있고 특정 치료 제가 효과적이지 않은 다른 서브-그룹과 연관된 속성 특성을 식별할 수 있다. 어떤 경우에는, 평가된 속성의 세 트의 서브세트만의 특성이 출력에 표현된다. 예를 들어, 블록에서, 속성들의 세트 각각에 대해, 속성들이 서브-그룹에 걸쳐 구별될 수 있는 정도를 지시하기 위해 p-값(또는 다른 유의성 지시자)이 생성될 수 있다. 블 록에서 생성된 출력은 임계값 미만인 p-값과 연관된(또는 유의미한 서브-그룹 구별을 지시하는 유의성 지시자와 연관된) 각각의 속성에 대한 서브-그룹-특정적 통계를 포함할 수 있다. 일부 경우, 서브-그룹 할당을 가 장 잘 예측하는 속성을 식별하기 위해 다변량 분석이 수행되고, 출력이 하나 또는 그 이상, 또는 모든 서브-그 룹의 속성의 값을 특징 짓는다. 일부 예에서, 블록은 새로운 치료제 지시자를 생성하는 것을 포함한다. 예를 들어, 속성 통계는 50세 미만 이고 3.5 미만의 EDSS 점수를 갖는 RRMS MS 환자에 의해 사용될 때 특정 치료제가 특히 매우 적합함을 나타낼 수 있다(가령, 사용 기간에 기초하여 결정됨). 또 다른 예로서, 속성 통계는 6.0보다 큰 EDSS 점수를 갖는 RRMS 환자에 의해 사용될 때 특정 치료제가 특히 빠른 진행과 상관관계가 있음을 나타낼 수 있다. 그런 다음, 하나 이상의 다른 치료(또는 치료 없음)를 받았을 때와 비교하여 특정 치료를 받고 있을 때 이러한 대상체 모집단 중 하나 사이에 유의미한 차이가 있는지 여부를 평가하기 위해 후속 분석이 수행될 수 있다. 그렇다면, 주어진 대 상체의 속성이 모집단 중 하나에 해당하는지 여부를 결정함으로써 주어진 대상체에 대한 특정 치료제를 권장하 거나 사용할지 여부를 결정하기 위해 치료 전략이 사용될 수 있다. 일부 경우에, 대상체 속성이 치료 반응과 어떻게 상관되는지를 평가하기 위해 쿼리-결과 레코드를 서브-그룹으 로 나누는 대신, 치료 반응이 이진수가 아닌 숫자로 식별될 수 있다. 예를 들어, 치료 반응은 대상체가 치료를 받은 주 수, 치료를 받는 중 2년 동안 발견된 새로운 병변의 수, 치료의 첫 해 동안의 수치적 웰빙 지수의 변화 등을 포함할 수 있다. 그런 다음 모델은 대상체의 속성에 기초하여 치료 반응을 예측하도록 훈련될 수 있다. 예 를 들어, 회귀 모델 또는 피드포워드 신경망이 사용될 수 있다. 훈련된 모델은 이후에 다른 대상체의 속성을 나 타내는 입력 데이터 세트를 처리하여 대상체가 치료에 어떻게 반응할지 예측할 수 있다. 학습된 파라미터는 또 한 어떤 대상체 속성이 높은 가중치와 연관되는지를 결정하기 위해 평가될 수 있다(가령, 출력 예측을 생성하는 데 상대적으로 영향력이 있음을 상대적으로 나타냄). IV. 예시 도 9a-9f는 다발성 경화증 레코드 데이터 저장소를 구축하기 위하여 입력을 수신하도록 구성된 예시적인 인터페 이스를 도시한다. 도 9a는 가능한, 가능성이 있는 또는 확인된 다발성 경화증을 갖는 특정 대상체에 대응하는 정보를 식별하는 다수의 편집 가능한 섹션을 포함하는 인터페이스를 도시한다. \"사람\" 섹션은 대상체의 다 수의 식별자(식별자 번호 및 이름), 현재 거주지, 출생지, 연락처 정보(전화번호, 이메일 주소), 보험 정보 및 현재 상태(생존 또는 사망 표시)를 포함한다. 사람 섹션은 대상체가, 한 명 이상의 의료 제공자가 대상체 에 대한 정보를 인터페이스를 제공하는 컴퓨팅 시스템에 업로드하고 업로드된 정보가 특정 방식으로 사용됨을 허용하는 사전 동의에 서명한 날짜를 추가로 식별한다. 서명된 사전 동의서 자체가 인터페이스의 또 다른 페이 지를 통해 업로드되어 동의서가 검토될 수 있다. 사람 섹션은 시간에 따라 자동으로 업데이트될 수 있는 대상체의 나이를 추가로 식별한다. \"인구통계학적, 병력\" 섹션은 대상체가 다른 질병의 세트 중 어느 하나를 가지고 있는지 여부, 대상체가 다발성 경화증 또는 다른 자가면역 질환의 가족력을 갖는지 여부, 흡연 이력, 알코올 소비량 특성화, 고용 및 결혼 상태, 교육 수준 및 민족성의 지시자를 포함한다. \"병태 발생\" 섹션은 대상체가 진단된 MS의 하위 유형, 대상체의 다발성 경화증이 나타난 것으로 추정된 날 짜 및 장애 점수를 식별할 수 있다. 증상 특성화는 병태 발생 섹션과의 상호대화를 통해 더 식별될 수 있 다. 측정 섹션은 임상, 실험실 또는 영상 평가의 결과를 포함할 수 있다. 치료 섹션은 대상체에 의해 받은 각각의 MS 치료, 대증 치료 및 비약물 치료 및 각각의 치료에 해당하는 날짜를 식별할 수 있다. 치료 섹션은 치료제에 대한 반응으로 대상체가 경험한 하나 이상의 이상 반응을 더 식별할 수 있다. 치료 섹션과의 상호대화에 의해, 사용자가 하나 또는 복수의 MS 치료(가령, 알렘티주맙, 아자티오프리나, 코팍손, 다클리주맙, 디메틸 푸마레이트, 메토트렉세이트, 미톡산트론, 나탈리주맙, 인터프론, 오크렐리주맙, 핑골리모드, 리툭시맙, 테리플루노미드, 그 밖의 다른 치료제 또는 치료제 없음)를 선택할 수 있고, 임의의 이 상 반응 정보를 나타낼 수 있다(가령, 병원체: 박테리아/곰팡이/바이러스/기생충/불명, 이상 반응의 발병/해결 날짜, 이상 반응이 입원을 필요로 하는지 여부, CTCAE 독성 등급(1-5 및/또는 결과), 및/또는 하나 이상의 증상 치료제(가령, 프레드니손, 코르티손, 덱사메타손, 하이드로오르티손, 메틸프레드니솔론, 프레드니손)를 식별). 인터페이스는 각각의 MS 및/또는 증상 치료에 대해, 용량, 단위, 기간, 경로(피하, 근육내, 정맥내, 경구, 기타), 시작/종료 날짜 및/또는 치료 종료 이유를 수신하도록 더 구성될 수 있다. 사용자는 대상체가 사용 중인하나 이상의 비약리학적 치료(가령, 물리 치료, 요가, 예방 접종, 기타)를 추가로 식별할 수 있다. 도 9b는 MRI 평가로부터 결과를 수신하도록 구성된 예시적인 인터페이스를 도시한다. 이 인터페이스를 통해 입 력된 데이터는 도 9a에 도식된 인터페이스의 측정 섹션을 통해 액세스 가능하게 될 것이다. 도시된 바와 같이, 도 9b의 인터페이스는 검사 날짜, 어느 중추 신경계 영역이 이미지화되었는지, T1 영상이 수집되었는지 여부, T1 영상이 정상, 전형적인 MS, 또는 비정상 및 비정형적인 MS이었는지 여부에 대한 (\"T1 유형\" 필드를 통 한) 지시자, T1 영상에서 검출 가능한 병변의 수, 가돌리늄 투여 여부, 가돌리늄 투여 후 수집된 T1 이미지가 정상, 전형적인 MS 또는 비정상 및 비정형적인 MS인지 여부, 및 조영증강 병변의 수를 식별하는 입력을 수락하 도록 구성된다. 인터페이스는 T2 영상이 수집되었는지 여부를 나타내는 입력, T2 영상이 정상, 전형적인 MS, 또 는 비정상 및 비정형적 MS인지 여부 및 T2 영상에서 검출 가능한 병변의 수를 나타내는 입력을 수락하도록 더 구성된다. 인터페이스는 또한 MS의 특징인 여러 유형의 병변(천막하, 피질 인접, 뇌실주위 및 인접) 각각을 나 타내는 입력을 수락하고 검출된 다수의 블랙홀을 수락하도록 구성된다. 측정 섹션에 대응하는 데이터를 수신할 수 있는 또 다른 인터페이스(미도시)는 혈액학 데이터를 수신하도 록 구성될 수 있다. 혈액학 데이터는 적혈구 수, 헤모글로빈 수, 혈소판 수, 백혈구 수, 림프구 수, T 세포 수, CD4 T 세포 수, CD8 T 세포 수, CD19 B 세포 수, NK 세포 수, 호중구 수, 단핵구 수, 호산구 수 및/또는 호염기 구 수에 대응하는 메트릭을 포함할 수 있다. 측정 섹션에 대응하는 데이터를 수신할 수 있는 하나 이상의 다른 인터페이스(도시되지 않음)는 혈액 화학 데이터, 갑상선 기능 데이터, 혈청학적 데이터 및/또는 자가 항체 검사 데이터를 수신하도록 구성될 수 있다. 혈액 화학 데이터는 총 단백질 수, 알부민 수, SGOT/AST 수, SGPT/ALT 수, 감마-GT 수, 빌루빈 수, 알칼리성 인 산 수, 칼슘 수, 요소 수, 요산 수, 크레아틴 수, 아밀라제 수, 리파제 수 및/또는 비타민 D 수치를 특징화할 수 있다. 갑상선 기능 데이터는 T3, T4, TSH, 항-마이크로솜 항체 및/또는 항-트리오글로불린 항체의 수준을 특 징화할 수 있다. 혈청학적 데이터는 항-JC 바이러스의 존재, 대상체의 소변 내 JC 바이러스 DNA의 존재, HBV 항 원의 존재, 항-HCV의 존재, 항-HIV의 존재, 항-수두의 존재, 퀀티페론 골드 검사(quantiferon gold test)의 결 과, 망투 검사의 결과, 중화 항-IFN의 존재, 신경화 항-나탈리주맙의 존재 및/또는 임신 검사의 결과를 나타낼 수 있다. 자가-항체 데이터가 NMO-IgG, 항-MOG, ANA, 항-미토콘드리아, 항-벽세포, ASMA, 항-Ro, La, Sm, RNP, Sci-70, Jo1, 항-DNA, ANCA, 항-LKM, 항-카디오리핀, LAC 및/또는 항-트랜스글루타미나제의 존재 또는 부재를 나타낼 수 있다. 도 9c는 MRI 평가로부터 결과를 수신하도록 구성된 예시적인 인터페이스를 도시한다. 이 인터페이스를 통해 입 력된 데이터는 도 9a에 도식된 인터페이스의 측정 섹션을 통해 액세스 가능하게 될 것이다. 도시된 바와 같이, 9c의 인터페이스는 대상체로부터 뇌척수액이 수집된 날짜, CSF가 정상 샘플, MS의 전형적인 샘플, MS의 비전형적 비정상 샘플 또는 외상에 대응하는 샘플에 대응하는 것으로 결정되었는지 여부, 올리고클론성 밴드가 CSF에서 검출되었는지 여부, 검출된 올리고클론성 밴드의 양, JC 바이러스 DNA가 CSF에서 검출되었는지 여부, 및 IgG 지수를 식별하는 입력을 수락하도록 구성된다. 도 9d는 유발 전위로부터의 결과를 수신하도록 구성된 예시적인 인터페이스를 도시한다. 유발 전위는 체성 감각 자극에 반응하여 생성된 감각 유발 전위(SSEP), 청각 자극에 반응하여 생성된 유발 전위(BAEP), 시각 자극에 반 응하여 생성된 유발 전위(VEP) 또는 운동 유발 전위에 반응하여 생성된 유발 전위(MEP)를 포함할 수 있다. 전위 는 신체의 오른쪽 또는 왼쪽에 대응하는 피질 영역에서 감지될 수 있다. 도 9d는 여러 유형의 유발 전위 각각이 정상인지, 비정상인지 또는 알 수 없음인지를 식별하도록 구성된다. 도 9a-9d에서 검출된 인터페이스 각각은 의료 제공자에 의해 액세스될 수 있다. 또 다른 인터페이스가 MS로 진 단된 대상체에 의해서 사용 가능하다. 도 9e는 대상체의 레코드에서 사용할 수 있는 데이터의 유형에 대한 선택 세부 사항을 포함하는 대상체-대면 인터페이스를 보여준다. 도 9f는 대상체가 또한 액세스되는 예시적인 설문조 사 질문을 보여준다. 대상체에게 다른 시간에 다양한 질문이 제시될 수 있으며 새로운 질문이 있음을 나타내는 알림이 제시될 수 있다. 질문은 대상체에 대한 건강 지수를 결정하는 데 사용될 수 있는 건강 지향 질문에 대응 할 수 있다. 이 예는 예시적인 인터페이스 구성 및 고려되는 데이터를 제공하지만, 다른 인터페이스 구성 및 데이터 변수가 고려된다. 예를 들어, 인터페이스는 본 명세서에 개시된 임의의 유형의 질환 특징화, 본 명세서에 개시된 임의 의 유형의 증상 특징화, 임의의 유형의 치료제 특징화, 본 명세서에 개시된 임의의 유형의 대상체 속성, 본 명 세서에 개시된 임의의 유형의 임상 평가, 본 명세서에 개시된 임의의 유형의 의학적-검사 또는 영상 결과 등을 수신하도록 구성될 수 있다.따라서, 9a-9f는 사용자가 대상체의 속성, 진단, 치료 및 그 밖의 다른 정보를 특징짓는 정보를 제공할 수 있는 인터페이스를 예시한다. 이 정보는 일반적으로 또는 특정 상황에서 특정 치료의 효능을 평가하기 위한 빅데이터 분석을 지원하는 데 사용될 수 있다. 이 정보는 쿼리를 생성하고/하거나 치료 반응성에 관한 레코드와 연관된 개별 대상체에 대한 예측을 생성하기 위해 다른 레코드를 사용하는 처리를 정의하는 데 추가로 또는 대안적으로 사용될 수 있다. V. 추가 고려 사항 본 개시내용의 일부 실시예는 하나 이상의 데이터 프로세서를 포함하는 시스템을 포함한다. 일부 실시예에서, 시스템은 하나 이상의 데이터 프로세서 상에서 실행될 때 하나 이상의 데이터 프로세서로 하여금 여기서 개시된 하나 이상의 방법 중 일부 또는 전부 및/또는 하나 이상의 프로세스 중 일부 또는 전부를 수행하게 하는 명령을 포함하는 비일시적 컴퓨터 판독형 저장 매체를 포함한다. 본 개시내용의 일부 실시예는 하나 이상의 데이터 프 로세서 상에서 실행될 때 하나 이상의 데이터 프로세서로 하여금 여기서 개시된 하나 이상의 방법 중 일부 또는 전부 및/또는 여기서 개시된 하나 이상의 프로세스의 일부 또는 전부를 수행하게 하는 명령을 포함하는 비일시 적 기계 판독형 저장 매체로 유형으로 구현되는 컴퓨터-프로그램 프로덕트를 포함한다. 채용된 용어 및 표현은 한정이 아닌 설명 측면에서 사용되며, 이러한 용어 및 표현의 사용에 도시되고 기재된 특징부 또는 이의 일부분의 임의의 균등물을 배제하는 어떠한 의도도 없고, 청구된 발명의 범위 내에서 다양한 수정이 가능함이 자명하다. 따라서, 청구된 바와 같은 본 발명이 실시예 및 선택적인 특징에 의해 구체적으로 개시되었지만, 여기에 개시된 개념의 수정 및 변형이 통상의 기술자에 의해 사용될 수 있으며 그러한 수정 및 변형이 첨부된 청구범위에 의해 정의된 본 발명의 범위 내에 있다고 간주됨을 이해해야 한다. 본 설명은 단지 바람직한 예시적인 실시 형태를 제공하며, 본 개시내용의 범위, 적용 가능성 또는 구성을 제한 하도록 의도되지 않는다. 오히려, 바람직한 예시적인 실시예의 본 설명은 다양한 실시예를 구현하기 위한 가능 한 설명을 통상의 기술자에게 제공할 것이다. 첨부된 특허청구범위에 기재된 정신 및 범위를 벗어나지 않고 요 소의 기능 및 배열에 다양한 변경이 이루어질 수 있음을 이해해야 한다. 실시예의 완전한 이해를 제공하기 위해 다음 설명에서 특정 세부사항이 제공된다. 그러나, 이러한 특정 세부사 항 없이 실시예가 실시될 수 있음이 이해될 것이다. 예를 들어, 회로, 시스템, 네트워크, 프로세스 및 그 밖의 다른 구성요소는 실시예를 불필요한 세부 사항으로 모호하게 하지 않기 위해 블록도 형태의 구성요소로 표시될 수 있다. 또 다른 예에서, 잘 알려진 회로, 프로세스, 알고리즘, 구조 및 기술은 실시예를 모호하게 하는 것을 피하기 위해 불필요한 세부 사항 없이 표시될 수 있다. VI. 추가 예시 제1 예시는 방법을 포함하며, 상기 방법은, 클라우드-기반 애플리케이션 서버에서, 다발성 경화증의 치료를 식 별하는 쿼리를 수신하는 단계 및 치료의 식별자를 이용해 데이터 저장소에 쿼리하는 단계를 포함하며, 상기 데 이터 저장소는 의료 제공 개체의 분산 세트로부터 수신된 입력에 적어도 부분적으로 기초하여 채워진다. 제1 예 시의 방법은 상기 쿼리에 응답하여, 대상체 식별자의 세트를 수신하는 단계를 더 포함하며, 상기 대상체 식별자 의 세트 내 각각의 대상체 식별자는 대상체 식별자에 대응하는 대상체가 치료를 받았다고 지시한다. 제1 예시의 방법은, 대상체 식별자의 세트의 각각의 대상체 식별자에 대해, 데이터 저장소의 데이터에 기초하여, 대상체 식 별자에 대응하는 대상체가 치료를 개시한 때를 결정하는 단계, 및 대상체 식별자와 연관된 하나 이상의 레코드 로부터, 치료의 결과를 지시하는 하나 이상의 메트릭, 및 하나 이상의 대상체 속성을 추출하는 단계를 더 포함 하고, 하나 이상의 메트릭의 추출은 치료가 개시된 때에 적어도 부분적으로 기초하였고, 하나 이상의 대상체 속 성 각각은 레코드-대응 대상체의 특성 또는 의학적 검사의 결과를 반영한다. 제1 예시의 방법은 추출된 메트릭 및 추출된 대상체 속성에 기초하여 치료에 대한 다른 대상체의 예측 반응을 생성하는 단계, 및 예측 반응에 대 응하는 결과를 출력하는 단계를 더 포함한다. 제2 예시가 제1 예시의 방법을 포함하고, 대상체 식별자의 세트의 각각의 대상체 식별자에 대해, 데이터 저장소 는 대상체-연관된 스냅샷의 세트를 포함하고(대상체-연관된 스냅샷의 세트 각각이 특정 시점에 대응하고 대상체 는 대상체 식별자에 대응함), 대상체-연관된 스냅샷의 세트의 서브세트의 각각의 스냅샷이 치료와 연관되며, 하 나 이상의 메트릭이 대상체-연관된 스냅샷의 세트의 서브세트로부터 추출된다. 제3 예시가 제2 예시의 방법을 포함하며, 상기 대상체-연관 스냅샷의 세트 중 적어도 일부에 대해, 데이터 저장 소가 상이한 시점 후 시점과 연관된 대상체에 대한 또 다른 메트릭 값을 포함하지 않았다고 결정되고 스냅샷에 대응하는 특정 시점을 초과하지 않으면, 하나 이상의 메트릭 중 적어도 하나가 상기 특정 시점 전 상이한 시점으로부터의 메트릭 값이도록 정의된다. 제4 예시가 제1 예시 내지 제3 예시 중 어느 하나의 방법을 포함하고, 치료의 결과를 지시하는 하나 이상의 메 트릭은 MRI 결과에 기초한 하나 이상의 절대 또는 상대 통계치를 포함한다. 제5 예시가 제1 예시 내지 제4 예시 중 어느 하나의 방법을 포함하고, 치료의 결과를 지시하는 하나 이상의 메 트릭은 재발 보고에 기초한 하나 이상의 절대 또는 상대 통계치를 포함한다. 제6 예시는 제1 예시 내지 제5 예시 중 어느 하나의 방법을 포함하고, 치료의 결과를 지시하는 하나 이상의 메 트릭은 진행 평가에 기초한 하나 이상의 절대 또는 상대 통계치를 포함한다. 제7 예시가 제1 예시 내지 제6 예시 중 어느 하나의 방법을 포함하고, 치료의 결과를 지시하는 하나 이상의 메 트릭은 장애 평가에 기초한 하나 이상의 절대 또는 상대 통계치를 포함한다. 제8 예시가 제1 예시 내지 제7 예시 중 어느 하나의 방법을 포함하고, 추출된 메트릭 및 추출된 대상체 속성을 이용해 머신-러닝 모델을 훈련하는 단계를 더 포함하며, 예측 반응은 훈련된 머신-러닝 모델을 이용해 생성된다. 제9 예시가 제1 예시 내지 제8 예시 중 어느 하나의 방법을 포함하고, 대상체 식별자의 세트를 메트릭을 이용해 둘 이상의 그룹으로 분리하는 단계, 및 다른 대상체와 연관된 다른 대상체 메트릭에 기초하여 상기 둘 이상의 그룹 중 한 그룹으로 상기 다른 대상체를 할당하는 단계를 더 포함하며, 예측 반응은 그룹 할당에 기초하여 생 성된다. 제10 예시가 제1 예시 내지 제9 예시 중 어느 하나의 방법을 포함하고, 하나 이상의 대상체 속성 각각은 대상체 가 치료를 시작한 시점과 연관된 대상체의 속성을 포함한다. 제11 예시가 제1 예시 내지 제10 예시 중 어느 하나의 방법을 포함하고, 수신된 쿼리는 다른 대상체의 하나 이 상의 특정 속성을 더 포함하고, 상기 쿼리는 하나 이상의 특정 속성에 기초하여 수행된다. 제12 예시가 제1 예시 내지 제11 예시 중 어느 하나의 방법을 포함하며, 하나 이상의 특정 속성은 다른 대상체 가 이전에 받은 다른 치료의 식별을 포함한다. 제13 예시가 제1 예시 내지 제12 예시 중 어느 하나의 방법을 포함하며, 결과에 기초하여, 치료가 다른 대상체 에 대한 다발성 경화증을 효과적으로 치료할 것임을 예측하는 단계, 및 다른 대상체를 상기 치료로 치료하는 단 계를 더 포함한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7a 도면7b 도면8 도면9a 도면9b 도면9c 도면9d 도면9e 도면9f"}
{"patent_id": "10-2022-7043580", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시내용은 첨부된 도면과 함께 설명된다: 도 1은 본 개시내용의 일부 양태에 따른 클라우드-기반 애플리케이션이 호스팅되는 네트워크 환경을 예시한다. 도 2는 본 개시의 일부 양태에 따른, 대상체 치료에 대한 지원을 요청하는 상담 방송(consult broadcast)과 연"}
{"patent_id": "10-2022-7043580", "section": "도면", "subsection": "도면설명", "item": 2, "content": "관하여 요약 대상체 레코드를 사용자 장치로 배포하기 위해 클라우드-기반 애플리케이션에 의해 수행되는 프로 세스의 예를 예시하는 흐름도이다. 도 3은 본 개시내용의 일부 양태에 따라, 치료-계획 정의(가령, 의사 결정 트리 또는 치료 작업흐름)의 사용자 통합을 모니터링하고 모니터링의 결과에 기초하여 치료-계획 형성을 자동으로 업데이트하기 위한 프로세스의 예 를 나타내는 흐름도이다. 도 4는 본 개시내용의 일부 양태에 따른, 대상체에 대한 치료를 추천하기 위한 프로세스의 예를 예시하는 흐름 도이다. 도 5는 본 개시내용의 일부 양태에 따른, 데이터-프라이버시 규칙을 준수하기 위해 쿼리 결과를 난독화하기 위 한 프로세스의 예를 예시하는 흐름도이다.도 6은 본 개시내용의 일부 양태에 따른, 봇 스크립트, 가령, 챗봇을 이용해 사용자와 통신하기 위한 프로세스 의 예를 예시하는 흐름도이다. 도 7a 및 7b는 하위 집단을 특성화하고 대상체-특정 예측을 생성하기 위해 동적 및 분산 소스 데이터를 나타내 는 스냅샷 데이터 저장소를 구축 및 사용하기 위한 예시적인 프로세스를 도시하는 흐름도를 도시한다. 도 8은 하이-레벨 치료-반응 예측 및/또는 지시자를 생성하기 위해 스냅샷 데이터 저장소를 사용하기 위한 예시 적인 프로세스를 예시하는 흐름도를 도시한다. 도 9a-9f는 다발성 경화증 데이터 저장소를 구축하기 위한 입력을 수신하기 위한 예시적인 인터페이스를 도시한 다. 첨부된 도면에서, 유사한 구성요소 및/또는 특징은 동일한 참조 라벨을 가질 수 있다. 또한, 동일한 유형의 다 양한 구성요소는 참조 라벨 뒤의 대시와 유사한 구성 요소를 구별하는 두 번째 라벨로 구분할 수 있다. 명세서 에서 첫 번째 참조 라벨만 사용되는 경우 두 번째 참조 라벨과 관계없이 동일한 첫 번째 참조 라벨을 가진 유사 한 구성요소 중 하나에 설명이 적용된다."}
