{"patent_id": "10-2022-0045668", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0054258", "출원번호": "10-2022-0045668", "발명의 명칭": "교통 신호등의 인식 방법과 인식 장치, 전자 기기, 노변 장치, 클라우드 제어 플랫폼, 차량", "출원인": "아폴로 인텔리전트 커넥티비티", "발명자": "리우 보"}}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "교통 신호등의 인식 방법에 있어서,인식될 이미지를 인식하여, 상기 교통 신호등의 제1 위치 정보를 획득하는 것;상기 제1 위치 정보가 상기 교통 신호등 중의 일부의 위치를 지시하는 것에 응답하여, 상기 제1 위치 정보와 상기 교통 신호등의 위치를 지시하는 적어도 하나의 제2 위치 정보 사이의 상대 위치 관계에 기반하여, 상기 적어도 하나의 제2 위치 정보에서 목표 위치 정보를 결정하는 것; 및상기 인식될 이미지 중, 상기 목표 위치 정보에 대응되는 제1 이미지 구역에 대하여, 상기 제1 이미지 구역을인식하여, 상기 교통 신호등의 색깔을 획득하는 것을 포함하는 교통 신호등의 인식 방법."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 교통 신호등에 대한 복수의 초기 이미지를 획득하는 것;상기 복수의 초기 이미지를 처리하여, 상기 교통 신호등에 대한 적어도 하나의 평균 위치 정보를 획득하는 것;및상기 적어도 하나의 평균 위치 정보를 상기 적어도 하나의 제2 위치 정보로 하는 것을 더 포함하는 교통 신호등의 인식 방법."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 복수의 초기 이미지를 처리하여, 상기 교통 신호등에 대한 적어도 하나의 평균 위치 정보를 획득하는것은,상기 복수의 초기 이미지에 대해 이미지 인식을 진행하여, 상기 교통 신호등에 대한, 상기 교통 신호등의 위치를 지시하는 복수의 초기 위치 정보를 획득하는 것;상기 복수의 초기 위치 정보 사이의 상대 위치 관계에 기반하여, 상기 복수의 초기 위치 정보를 구분하여 적어도 하나의 그룹을 획득하는 것; 및상기 적어도 하나의 그룹 중의 각 그룹에 대하여, 상기 그룹 중의 초기 위치 정보에 기반하여 상기 평균 위치정보를 획득하는 것을 포함하는 교통 신호등의 인식 방법."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "에 있어서,상기 평균 검출 틀의 위치 정보에 기반하여, 상기 평균 위치 정보를 결정하는 것은,상기 복수의 그룹에 일일이 대응되는 복수의 평균 검출 틀의 위치 정보에 대하여, 상기 복수의 평균 검출 틀의위치 정보를 상기 기준 검출 틀의 위치 정보와 각각 매칭시켜 매칭결과를 획득하는 것; 및상기 매칭 결과에 기반하여, 상기 복수의 평균 검출 틀에 대해 삭제 동작을 진행하고, 나머지 평균 검출 틀의위치 정보를 상기 평균 위치 정보로 하는 것을 포함하는 교통 신호등의 인식 방법."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1 내지 청구항 5 중 어느 한 항에 있어서,상기 제1 위치 정보가 상기 교통 신호등의 위치를 지시하는 것에 응답하여, 상기 제1 위치 정보와 상기 적어도하나의 제2 위치 정보 사이의 상대 위치 관계를 결정하는 것;상기 적어도 하나의 제2 위치 정보 중의 임의의 하나에 대하여, 임의의 하나의 제2 위치 정보가 나타내는 위치와 상기 제1 위치 정보가 나타내는 위치 사이의 거리가 미리 설정된 거리보다 작은 것에 응답하여, 상기 인식될이미지에서 상기 제1 위치 정보에 대응되는 제2 이미지 구역을 결정하는 것; 및상기 제2 이미지 구역을 인식하여, 상기 교통 신호등의 색깔을 획득하는 것을 더 포함하는 교통 신호등의 인식방법."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,임의의 하나의 제2 위치 정보가 나타내는 위치와 상기 제1 위치 정보가 나타내는 위치 사이의 거리가 미리 설정된 거리보다 크거나 같은 것에 응답하여, 새로 추가된 이미지를 인식하여 새로 추가된 위치 정보를 획득하는것;상기 제1 위치 정보와 상기 새로 추가된 위치 정보에 기반하여 새로 추가된 평균 위치 정보를 획득하는 것; 및새로 추가된 평균 위치 정보를 상기 적어도 하나의 제2 위치 정보에 추가하는 것을 더 포함하는 교통 신호등의인식 방법."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1 내지 청구항 5 중 어느 한 항에 있어서,상기 제1 이미지 구역을 인식하여, 상기 교통 신호등의 색깔을 획득하는 것은,상기 제1 이미지 구역 중의 일부 픽셀의 픽셀 값에 기반하여 상기 교통 신호등의 색깔을 결정하는 것; 및상기 제1 이미지 구역 중의 픽셀의 분포에 기반하여 상기 교통 신호등의 색깔을 결정하는 것; 중의 적어도 하나를 포함하는 교통 신호등의 인식 방법."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "에 있어서,상기 교통 신호등에 대한 복수의 초기 이미지를 획득하기 위한 획득 모듈;상기 복수의 초기 이미지를 처리하여, 상기 교통 신호등에 대한 적어도 하나의 평균 위치 정보를 획득하기 위한처리 모듈; 및상기 적어도 하나의 평균 위치 정보를 상기 적어도 하나의 제2 위치 정보로 하기 위한 제2 결정 모듈을 더 포함하는 교통 신호등의 인식 장치."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 처리 모듈은,상기 복수의 초기 이미지에 대해 이미지 인식을 진행하여, 상기 교통 신호등에 대한, 상기 교통 신호등의 위치를 지시하는 복수의 초기 위치 정보를 획득하기 위한 인식 서브 모듈;상기 복수의 초기 위치 정보 사이의 상대 위치 관계에 기반하여, 상기 복수의 초기 위치 정보를 구분하여 적어도 하나의 그룹을 획득하는 기 위한 구분 서브 모듈; 및상기 적어도 하나의 그룹 중의 각 그룹에 대하여, 상기 그룹 중의 초기 위치 정보에 기반하여 상기 평균 위치정보를 획득하기 위한 제1 결정 서브 모듈을 포함하는 교통 신호등의 인식 장치."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 초기 위치 정보는 검출 틀의 위치 정보를 포함하며; 상기 제1 결정 서브 모듈은,상기 그룹 중의 각 검출 틀의 중심점의 위치 정보에 기반하여 참조 중심점의 위치 정보를 계산하여 획득하기 위한 계산 유닛;참조 중심점의 위치 정보와 기준 이미지에 기반하여 결정된 상기 교통 신호등에 대한 검출 틀인 기준 검출 틀의위치 정보에 기반하여, 평균 검출 틀의 위치 정보를 결정하기 위한 제1 결정 유닛; 및상기 평균 검출 틀의 위치 정보에 기반하여, 상기 평균 위치 정보를 결정하기 위한 제2 결정 유닛을 포함하는교통 신호등의 인식 장치."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 제2 결정 유닛은,상기 복수의 그룹에 일일이 대응되는 복수의 평균 검출 틀의 위치 정보에 대하여, 상기 복수의 평균 검출 틀의위치 정보를 상기 기준 검출 틀의 위치 정보와 각각 매칭시켜 매칭결과를 획득하기 위한 매칭 서브 유닛; 및상기 매칭 결과에 기반하여, 상기 복수의 평균 검출 틀에 대해 삭제 동작을 진행하고, 나머지 평균 검출 틀의위치 정보를 상기 평균 위치 정보로 하기 위한 삭제 서브 유닛을 포함하는 교통 신호등의 인식 장치."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 9 내지 청구항 13 중 어느 한 항에 있어서,상기 제1 위치 정보가 상기 교통 신호등의 위치를 지시하는 것에 응답하여, 상기 제1 위치 정보와 상기 적어도하나의 제2 위치 정보 사이의 상대 위치 관계를 결정하기 위한 제3 결정 모듈;상기 적어도 하나의 제2 위치 정보 중의 임의의 하나에 대하여, 임의의 하나의 제2 위치 정보가 나타내는 위치와 상기 제1 위치 정보가 나타내는 위치 사이의 거리가 미리 설정된 거리보다 작은 것에 응답하여, 상기 인식될공개특허 10-2022-0054258-5-이미지에서 상기 제1 위치 정보에 대응되는 제2 이미지 구역을 결정하기 위한 제4 결정 모듈; 및상기 제2 이미지 구역을 인식하여, 상기 교통 신호등의 색깔을 획득하기 위한 제3 인식 모듈을 더 포함하는 교통 신호등의 인식 장치."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,임의의 하나의 제2 위치 정보가 나타내는 위치와 상기 제1 위치 정보가 나타내는 위치 사이의 거리가 미리 설정된 거리보다 크거나 같은 것에 응답하여, 새로 추가된 이미지를 인식하여 새로 추가된 위치 정보를 획득하기 위한 제4 인식 모듈;상기 제1 위치 정보와 상기 새로 추가된 위치 정보에 기반하여 새로 추가된 평균 위치 정보를 획득하기 위한 제5 결정 모듈; 및새로 추가된 평균 위치 정보를 상기 적어도 하나의 제2 위치 정보에 추가하기 위한 추가 모듈을 더 포함하는 교통 신호등의 인식 장치."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 9 내지 청구항 13 중 어느 한 항에 있어서,상기 제2 인식 모듈은,상기 제1 이미지 구역 중의 일부 픽셀의 픽셀 값에 기반하여 상기 교통 신호등의 색깔을 결정하기 위한 제2 결정 서브 모듈; 및상기 제1 이미지 구역 중의 픽셀의 분포에 기반하여 상기 교통 신호등의 색깔을 결정하기 위한 제3 결정 서브모듈; 중의 적어도 하나를 포함하는 교통 신호등의 인식 장치."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결된 메모리를 포함하며, 여기서,상기 메모리에는 적어도 하나의 프로세서에 의해 실행 가능한 명령어가 저장되어 있고, 상기 명령어는 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서로 하여금 청구항 1 내지 청구항 5 중 어느 한 항의 상기 교통 신호등의 인식 방법을 실행할 수 있게 하는 전자 기기."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "컴퓨터로 하여금 청구항 1 내지 청구항 5 중 어느 한 항의 교통 신호등의 인식 방법을 실행하게 하기 위한 컴퓨터 명령어가 저장되어 있는 비휘발성 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "프로세서에 의해 실행될 시에 청구항 1 내지 청구항 5 중 어느 한 항의 교통 신호등의 인식 방법을 구현하는 컴퓨터 프로그램."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 17에 따른 전자 기기를 포함하는 노변 장치."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 17에 따른 전자 기기를 포함하는 클라우드 제어 플랫폼."}
{"patent_id": "10-2022-0045668", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 20에 따른 노변 장치와 자율주행 차량을 포함하고, 여기서,공개특허 10-2022-0054258-6-상기 노변 장치는 상기 교통 신호등의 색깔을 상기 자율주행 차량에 전송하기 위한 것;상기 자율주행 차량은 상기 교통 신호등의 색깔에 따라 자율주행을 진행하기 위한 것인 차량 인프라 협력 시스템."}
{"patent_id": "10-2022-0045668", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 교통 신호등의 인식 방법과 인식 장치, 전자 기기, 노변 장치, 클라우드 제어 플랫폼, 차량 인프라 협 력 시스템, 저장 매체 및 프로그램을 개시하며, 지능형 교통분야, 특히 자율주행, 이미지 처리 등의 분야에 관한 것이다. 교통 신호등의 방법은, 인식될 이미지를 인식하여, 교통 신호등의 제1 위치 정보를 획득하는 것; 제1 위 치 정보가 교통 신호등 중의 일부의 위치를 지시하는 것에 응답하여, 제1 위치 정보와 교통 신호등의 위치를 지 시하는 적어도 하나의 제2 위치 정보 사이의 상대 위치 관계에 기반하여 적어도 하나의 제2 위치 정보에서 목표 위치 정보를 결정하는 것; 인식될 이미지 중의 목표 위치 정보에 대응되는 제1 이미지 구역에 대하여, 제1 이미 지 구역을 인식하여, 교통 신호등의 색깔을 획득하는 것을 포함한다."}
{"patent_id": "10-2022-0045668", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 스마트 교통 분야, 특히 자율주행, 이미지 처리 등 분야에 관한 것으로, 보다 구체적으로는, 교통 신 호등의 인식 방법과 인식 장치, 전자 기기, 노변 장치, 클라우드 제어 플랫폼 및 차량 인프라 협력 시스템에 관 한 것이다."}
{"patent_id": "10-2022-0045668", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "교통 분야에서, 통상적으로 차량이 교통 신호등의 색깔에 따라 주행하거나 정지할 수 있도록 하기 위하여, 신호 등의 색깔을 인식할 필요가 있다. 특히 자율주행 및 지능형 교통 분야에서, 자율주행 차량이 인식된 색깔에 기 반하여 관련 동작을 수행할 수 있도록 하기 위하여, 통상적으로 교통 신호등의 색깔을 자동으로 인식할 필요가 있다. 하지만, 관련 기술은 교통 신호등의 색깔을 인식할 시에 환경적 간섭과 인식 알고리즘 자체의 정확도 문 제로 인해 인식 효과가 나빠서, 차량의 주행 과정에 안전상의 우려가 존재하게 된다. 본 개시는 교통 신호등의 인식 방법, 인식 장치, 전자 기기, 저장 매체, 프로그램 제품, 노변 장치, 클라우드 제어 플랫폼 및 차량 인프라 협력 시스템을 제공한다. 본 개시의 일 측면에 따르면, 교통 신호등의 인식 방법을 제공하며, 상기 교통 신호등의 인식 방법은, 인식될 이미지를 인식하여, 상기 교통 신호등의 제1 위치 정보를 획득하는 것; 상기 제1 위치 정보가 상기 교통 신호등 중의 일부의 위치를 지시하는 것에 응답하여, 상기 제1 위치 정보와 교통 신호등의 위치를 지시하는 적어도 하 나의 제2 위치 정보 사이의 상대 위치 관계에 기반하여, 상기 적어도 하나의 제2 위치 정보에서 목표 위치 정보 를 결정하는 것; 및, 상기 인식될 이미지 중, 상기 목표 위치 정보에 대응되는 제1 이미지 구역에 대하여, 상기 제1 이미지 구역을 인식하여, 상기 교통 신호등의 색깔을 획득하는 것을 포함한다. 본 개시의 다른 측면에 따르면, 제1 인식 모듈, 제1 결정 모듈 및 제2 인식 모듈을 포함하는 교통 신호등의 인 식 장치를 제공한다. 제1 인식 모듈은 인식될 이미지를 인식하여 상기 교통 신호등의 제1 위치 정보를 획득하기 위한 것이다. 제1 결정 모듈은 상기 제1 위치 정보가 상기 교통 신호등 중의 일부의 위치를 지시하는 것에 응답 하여, 상기 제1 위치 정보와 상기 교통 신호등의 위치를 지시하는 적어도 하나의 제2 위치 정보 사이의 상대 위 치 관계에 기반하여, 상기 적어도 하나의 제2 위치 정보에서 목표 위치 정보를 결정하기 위한 것이다. 제2 인식 모듈은 상기 인식될 이미지 중, 상기 목표 위치 정보에 대응되는 제1 이미지 구역에 대하여, 상기 제1 이미지 구역을 인식하여, 상기 교통 신호등의 색깔을 획득하기 위한 것이다. 본 개시의 다른 측면에 따르면, 적어도 하나의 프로세서 및 상기 적어도 하나의 프로세서와 통신 연결된 메모리 를 포함하는 전자 기기를 제공한다. 여기서, 상기 메모리에는 적어도 하나의 프로세서에 의해 실행 가능한 명령 어가 저장되어 있고, 상기 명령어는 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세 서로 하여금 상술한 교통 신호등의 인식 방법을 실행할 수 있게 한다. 본 개시의 다른 측면에 따르면, 컴퓨터로 하여금 상술한 교통 신호등의 인식 방법을 실행하게 하기 위한 컴퓨터 명령어가 저장되어 있는 비휘발성 컴퓨터 판독 가능 저장 매체를 제공한다. 본 개시의 다른 측면에 따르면, 프로세서에 의해 실행될 시에 상술한 교통 신호등의 인식 방법을 구현하는 컴퓨 터 프로그램을 포함하는 컴퓨터 프로그램 제품을 제공한다. 본 개시의 다른 측면에 따르면, 상술한 전자 기기를 포함하는 노변 장치를 제공한다. 본 개시의 다른 측면에 따르면, 상술한 전자 기기를 포함하는 클라우드 제어 플랫폼을 제공한다. 본 개시의 다른 측면에 따르면, 상술한 교통 신호등의 색깔을 상기 자율주행 차량에 전송하기 위한 노변 장치; 및 상기 교통 신호등의 색깔에 따라 자율주행을 진행하기 위한 자율주행 차량을 포함하는 차량 인프라 협력 시스템을 제공한다. 이 부분에서 설명한 내용은 본 개시의 실시예의 핵심 또는 중요한 특징들을 표시하기 위한 것이 아니며, 본 개 시의 범위를 한정하는 데 사용하지 않는다는 것을 이해해야 한다. 본 개시의 기타 특징은 아래의 명세서를 통해 쉽게 이해할 수 있게 될 것이다."}
{"patent_id": "10-2022-0045668", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 예시적인 실시예를 상세히 설명하기로 한다. 이해를 돕기 위하여 그 중에는 본 출원의 실시예의 다양한 세부사항이 포함되어 있으며, 이들을 단지 예시적인 것으로 간주해야 한다."}
{"patent_id": "10-2022-0045668", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "따라서, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 출원의 범위 및 사상을 벗어나는 것이 없 이 여기서 설명된 실시예에 대해 다양한 변경 및 수정을 진행할 수 있음을 인식해야 한다. 마찬가지로, 명확하 고 간결하게 하기 위하여, 아래 설명 중에는 공지 기능 또는 구성에 대한 설명은 생략하도록 한다. 여기에서 사용하는 용어는 단지 구체적인 실시예를 설명하기 위한 것으로, 본 개시를 제한하려는 것이 아니다. 여기서 사용하는 \"포괄\", \"포함\"등의 용어는 상기 특징, 스텝, 동작 및/또는 부품의 존재를 나타내지만, 하나 또는 복수의 다른 특징, 스텝, 동작 또는 부품의 존재 또는 추가를 제외하지 않는다. 여기에서 사용하는 모든 용어(기술 및 과학 용어를 포함)는 달리 정의되지 않는 한, 당업자가 일반적으로 이해 하는 의미를 갖는다. 여기서 사용하는 용어는 본 명세서의 문맥과 일치하는 의미를 갖는 것으로 해석되어야 하 며, 이상화되거나 지나치게 융통성 없는 방식으로 해석되어서는 안된다는 점에 유의해야 한다. \"A, B 및 C 등 중의 적어도 하나\"와 유사한 표현을 사용하는 경우, 일반적으로 말하면 당업자가 일반적으로 이 표현을 이해하는 의미(예를 들면, \"A, B 및 C 중의 적어도 하나를 구비한 시스템\"에는 단독으로 A를 구비, 단독 으로 B를 구비, 단독으로 C를 구비, A와 B를 구비, A와 C를 구비, B와 C를 구비 및/또는 A, B, C를 구비한 시스 템 등을 포함하지만 이에 제한되지는 않는다)로 해석해야 한다. 본 개시의 실시예는 교통 신호등의 인식 방법을 제공한다. 교통 신호등의 인식 방법은, 인식될 이미지를 인식하 여, 교통 신호등의 제1 위치 정보를 획득하는 것을 포함한다. 그리고, 제1 위치 정보가 교통 신호등 중의 일부 의 위치를 지시하는 것에 응답하여, 제1 위치 정보와 교통 신호등의 위치를 지시하는 적어도 하나의 제2 위치 정보 사이의 상대 위치 관계에 기반하여, 적어도 하나의 제2 위치 정보에서 목표 위치 정보를 결정하는 것을 포 함한다. 이어서, 인식될 이미지 중, 목표 위치 정보에 대응되는 제1 이미지 구역에 대하여, 제1 이미지 구역을 인식하여, 교통 신호등의 색깔을 획득한다. 도 1은 본 개시의 일 실시예에 따른 교통 신호등의 인식 방법과 장치의 적용 장면을 개략적으로 나타낸다. 도 1 은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 본 개시의 기술적 내용을 이해할 수 있도록 본 개 시의 실시예가 적용될 수 있는 적용 장면의 예시일 뿐, 본 개시의 실시예가 기타 장비, 시스템, 환경 또는 장면 에 사용할 수 없다는 것을 의미하지 않는다는 점을 유의해야 한다. 도 1에 도시된 바와 같이, 본 실시예에 따른 적용 장면은 이미지 수집 장치, 서버 및 차량(10 3)을 포함할 수 있다. 이미지 수집 장치는 카메라를 포함할 수 있다. 이미지 수집 장치는 예를 들면 교차로의 감시등 기둥 이나 가로등 기둥과 같은 특정 위치에 고정될 수 있으며, 이미지 수집 장치는 교통 신호등의 이미지를 수 집하기 위한 것이다. 교통 신호등의 이미지가 수집된 후, 이미지를 서버로 전송하여 처리할 수 있다. 자율 주행 차량이 주행 과정중에 대형 차량에 가려져 전방 신호등을 인식하지 못할 수 있다. 노변 비디오 카메라, 노 변 카메라와 같은 노변 장치는 더욱 좋은 시야를 구비함으로써, 신호등의 색깔을 인식하고 자율주행 차량에 전 송하여 자율주행 차량이 안전하게 교차로를 통과할 수 있도록 협조하여 차량 인프라 협력을 구현한다. 서버는 다양한 서비스를 제공하는 서버일 수 있다. 서버는 이미지를 수신한 후, 이미지를 인식하여 교통 신호등의 색깔을 획득할 수 있다. 교통 신호등의 색깔은 예를 들면 적색, 황색, 녹색 등을 포함할 수 있다. 서버는 교통 신호등의 색깔이 인식된 후, 인식 결과를 차량으로 전송할 수 있다. 차량은 자율주 행 차량일 수 있다. 차량은 인식 결과를 수신한 후, 인식 결과에 따라 주행 또는 정지할 수 있다. 예를 들 면, 인식 결과가 교통 신호등이 녹색임을 지시할 경우, 차량은 계속 주행할 수 있다. 인식 결과가 교통 신 호등이 적색 또는 황색임을 지시할 경우, 차량은 정지하여 대기할 수 있다. 본 개시의 실시예에 의해 제공되는 교통 신호등의 인식 방법은 서버에 의해 실행될 수 있음에 유의해야 한 다. 이에 대응하여, 본 개시의 실시예에 의해 제공되는 교통 신호등의 인식 장치는 서버에 설치될 수 있다. 다른 예시에서, 이미지 수집 장치가 이미지 처리 기능을 갖추고 있을 경우, 본 개시의 실시예의 교통 신호 등의 인식 방법은 이미지 수집 장치에 의해 실행되어, 교통 신호등의 색깔을 인식하여 획득하고, 인식 결 과를 차량으로 전송할 수도 있다. 다른 예시에서, 차량이 이미지 처리 기능을 갖추고 있을 경우, 본 개시의 실시예의 교통 신호등의 인식 방 법은 차량에 의해 실행되어, 교통 신호등의 색깔을 인식하여 획득할 수도 있다. 예를 들면, 차량이 이미지 수집 장치로부터의 이미지를 수신한 후, 이미지를 처리하여 교통 신호등의 색깔을 획득할 수 있다. 예시적으로, 서버는 프로세서 및 프로세서와 통신 연결된 메모리가 구비된 전자 기기를 포함할 수 있다. 메모리에는 프로세서에 의해 실행 가능한 명령어가 저장되어 있고, 명령어는 프로세서에 의해 실행될 시에 본 개시의 실시예의 교통 신호등의 인식 방법을 구현할 수 있다. 예시적으로, 본 개시의 실시예는 또한 노변 장치와 클라우드 제어 플랫폼을 제공한다. 노변 장치는 전자 기기를 포함할 수 있으며, 클라우드 제어 플랫폼도 전자 기기를 포함할 수 있다. 선택적으로, 노변 장치는 전자 기기를 포함하는 외에 통신 부품 등도 포함할 수 있다. 전자 기기는 통신 부품과 일체로 집성될 수도 있고 분리하여 설치될 수도 있다. 전자 기기는 감지 장치(예를 들면 노변 촬영기)의 데이터, 예를 들면 이미지와 동영상 등을 획득하여, 영상 처리와 데이터 계산을 진행할 수 있다. 선택적으로, 전자 기기 자체도 데이터 감지 획득 기능과 통신 기능을 갖출 수 있으며, 예를 들면 AI 촬영기이며, 전자 기기 는 직접 획득한 감지 데이터에 기반하여 영상 처리와 데이터 계산을 진행할 수 있다. 선택적으로, 클라우드 제어 플랫폼은 클라우드에서 처리를 실행하고, 클라우드 제어 플랫폼에 포함된 전자 기기 는 감지 장치(예를 들면 노변 촬영기)의 데이터, 예를 들면 이미지와 동영상 등을 획득하여, 영상 처리와 데이 터 계산을 진행할 수 있다. 클라우드 제어 플랫폼은 차량 인프라 협력 관리 플랫폼, 에지 컴퓨팅 플랫폼, 클라 우드 컴퓨팅 플랫폼, 중앙 시스템, 클라우드 서버 등으로 부를 수도 있다. 예시적으로, 본 개시의 실시예는 예를 들면 노변 장치와 자율주행 차량이 포함된 차량 인프라 협력 시스템도 제 공하였으며, 자율주행 차량은 상술한 차량일 수 있다. 노변 장치는 교통 신호등의 색깔을 자율주행 차량에 전송하기 위한 것이며, 자율주행 차량은 교통 신호등의 색깔에 따라 자율주행을 진행하기 위한 것이다. 본 개시의 실시예에서는 교통 신호등의 인식 방법을 제공하였으며, 아래, 도 1의 적용 장면과 결합하고, 도 2 내지 도 4를 참조하여 본 개시의 예시적 실시 형태에 따른 교통 신호등의 인식 방법을 설명한다. 도 2는 본 개시의 일 실시예에 따른 교통 신호등의 인식 방법의 흐름도를 개략적으로 나타낸다. 도 2에 도시된 바와 같이, 본 개시의 실시예에 따른 교통 신호등의 인식 방법은 예를 들면, 동작 S210 내 지 동작 S230을 포함할 수 있다. 동작 S210에서, 인식될 이미지를 인식하여, 교통 신호등의 제1 위치 정보를 획득한다. 동작 S220에서, 제1 위치 정보가 교통 신호등 중의 일부의 위치를 지시하는 것에 응답하여, 제1 위치 정보와 적 어도 하나의 제2 위치 정보 사이의 상대 위치 관계에 기반하여, 적어도 하나의 제2 위치 정보에서 목표 위치 정 보를 결정한다. 동작 S230에서, 인식될 이미지 중의 목표 위치 정보에 대응되는 제1 이미지 구역에 대하여, 제1 이미지 구역을 인식하여, 교통 신호등의 색깔을 획득한다. 예시적으로, 제2 위치 정보는 예를 들면 교통 신호등의 위치를 지시한다. 예시적으로, 교통 신호등은 예를 들면 램프 그룹이며, 램프 그룹에는 여러 개의 램프가 포함되어 있다. 목표 감 지 모델을 통하여 인식될 이미지를 인식하여, 인식될 이미지 중의 교통 신호등의 제1 위치 정보를 획득한다. 제1 위치 정보는 통상적으로 교통 신호등 중의 일부의 위치를 지시하거나 교통 신호등 전체의 위치를 지시할 수 도 있다. 교통 신호등 중의 일부는 예를 들면 여러 개의 램프의 일부 램프일 수 있으며, 교통 신호등 전체는 예 를 들면 모든 램프를 포함할 수 있다. 교통 신호등이 3개 램프를 포함하는 것을 예로 들면, 3개 램프는 각각 적 색 램프, 황색 램프, 녹색 램프이다. 교통 신호등 중의 일부는 예를 들면 하나 또는 두개의 램프이다. 교통 신 호등 전체는 예를 들면 3개의 램프를 포함한다. 적어도 하나의 제2 위치 정보는 예를 들면 기타 이미지를 인식하여 획득한 것이다. 기타 이미지는 교통 신호등 에 대한 이미지이다. 제2 위치 정보는 교통 신호등 전체의 위치를 지시한다. 제1 위치 정보가 교통 신호등 중의 일부의 램프의 위치를 지시할 경우, 제1 위치 정보와 각 제2 위치 정보의 상대 위치 관계에 기반하여, 적어도 하나의 제2 위치 정보에서 제1 위치 정보와 거리가 가까운 목표 위치 정보를 결정할 수 있다. 목표 위치 정보는, 예를 들면 교통 신호등 전체의 위치를 지시한다. 이어서, 인식될 이미지에서 목표 위치 정보에 대응되는 제1 이미지 구역을 결정한다. 제1 이미지 구역은, 예를 들면 교통 신호등에 대한 구역이다. 그리고, 해당 제1 이미지 구역을 인식하여, 교통 신호등의 색깔을 획득한다. 본 개시의 실시예에서, 인식된 제1 위치 정보가 교통 신호등의 일부의 위치만을 지시할 시에, 인식될 이미지에 서 제1 위치 정보와 대응되는 이미지 구역을 결정하고, 이미지 구역에 대하여 색깔 인식을 진행하면, 인식 효과 가 좋지 않게 된다. 따라서, 본 개시의 실시예는 제 1 위치 정보와 매칭되는 목표 위치 정보를 결정하고, 인식 될 이미지에서 목표 위치 정보에 대응되는 제1 이미지 구역을 결정하는 것을 통하여, 제1 이미지 구역에 대하여 색깔 인식을 진행하여 교통 신호등의 색깔을 획득한다. 목표 위치 정보가 교통 신호등 전체의 위치를 지시하기 때문에, 전체의 위치에 기반하여 색깔 인식을 진행하면 색깔 인식 효과를 향상시켰다. 도 3은 본 개시의 일 실시예에 따른 교통 신호등의 인식 방법을 개략적으로 나타낸다. 도 3에 도시된 바와 같이, 한가지 상황에서, 특정 교차로의 적어도 하나의 교통 신호등은, 적어도 하나의 교통 신호등이 두개인 것을 예로 들 수 있다. 고정 위치의 이미지 수집 장치를 이용하여 적어도 하나의 교통 신호등 에 대하여 이미지 수집을 진행하여 복수의 이미지를 획득한다. 하나의 이미지를 예로 들면, 이미지를 인식하여, 이미지에서의 적어도 하나의 교통 신호등 전체의 적어도 하나의 제2 위치 정보를 획득한다. 적어도 하나의 제2 위치 정보는, 예를 들면 제2 위치 정보와 제2 위치 정보를 포함한다. 적어도 하나의 제2 위치 정보는 예를 들면 적어도 하나의 교통 신호등 전체와 일일이 대응된다. 각 제2 위치 정보는 예를 들면 교 통 신호등의 전체 램프 프레임의 정보를 포함한다. 또 다른 상황에서, 해당 교차로의 적어도 하나의 교통 신호등에 대하여, 동일한 이미지 수집 장치를 이용하여 적어도 하나의 교통 신호등에 대하여 이미지 수집을 진행하여, 인식될 이미지를 획득할 수 있다. 인식될 이미지에 이미지 품질이 비교적 나쁜 가능성이 존재하기 때문에, 인식될 이미지를 인식할 경우, 획득 한 제1 위치 정보는 예를 들면 교통 신호등의 일부만에 대한 것일 수 있다. 예를 들면, 야간에 이미지 수 집을 진행할 경우, 일반적으로 특정 램프의 점등에 인하여 강렬한 빛무리를 형성하기 때문에, 교통 신호등의 전 체 램프 프레임을 인식할 수 없게 된다. 예를 들면, 인식될 이미지에 빛무리가 있음을 인식했을 경우, 제1 위치 정보에 빛무리가 있는 위치를 포함하여 인식 결과가 교통 신호등의 전체 램프 프레임의 정보를 포함 할 수 없도록 하게 한다. 제1 위치 정보를 기반으로 인식될 이미지 중의 이미지 구역을 결정하고, 이미지 구역을 인식하여 교통 신 호등의 색깔을 획득하면, 인식 결과가 빛무리 강도의 영향을 받기 때문에, 인식 효과가 떨어지게 된다. 따라서, 제1 위치 정보를 각각의 제2 위치 정보와 매칭시키는 것을 통하여, 제1 위치 정보에 가까운 제2 위치 정보를 목표 위치 정보로 한다. 그리고, 인식될 이미지로부터 목표 위치 정보와 매칭되는 제1 이미지 구역을 결정한다. 그리고, 제1 이미지 구역에 대하여 이미지 인식을 진행하여, 인식될 이 미지 중의 교통 신호등의 색깔을 획득한다. 예시적으로, 제1 이미지 구역을 인식하여 교통 신호등의 색깔을 획득하는 것은 다음과 같은 몇가지 방식을 포함한다. 첫 번째 방식은, 제1 이미지 구역 중의 일부 픽셀의 픽셀 값에 기반하여 교통 신호등의 색깔을 결정할 수 있다. 일부 픽셀은 제1 이미지 구역 중의 하부 구역의 픽셀을 포함하고, 이 하부 구역은 빛무리가 위치한 구역을 포함하며, 빛무리는 이곳에 점등된 램프가 있음을 의미한다. 빛무리가 위치한 구역의 픽셀 값에 기반하 여 색깔을 결정할 수 있다. 다른 한가지 방식은, 제1 이미지 구역 중의 픽셀의 분포에 기반하여 교통 신호등의 색깔을 결정하는 것이다. 예를 들면, 제1 이미지 구역 중의 픽셀의 분포 상황은 빛무리에 대응되는 픽셀이 제1 이미지 구역 의 하부 구역에 분포되어 있는 것을 포함한다. 교통 신호등에 대하여, 교통 신호등은 위로부터 아래로의 램프는 순차적으로 적색 램프, 황색 램프 및 녹색 램프로 나타난다. 제1 이미지 구역의 하부 구역이 빛무 리이라면, 일반적으로 교통 신호등의 하부 구역에 점등된 램프가 존재함을 나타내며, 제1 이미지 구역 중 의 픽셀의 분포에 기반하여 교통 신호등은 현재 녹색 램프가 점등되어 있음을 알 수 있다. 다른 한가지 방식은, 제1 이미지 구역 중의 일부 픽셀의 픽셀 값과 제1 이미지 구역 중의 픽셀의 분 포를 동시에 결합하여 교통 신호등의 색깔을 결정하여 인식 정확도를 향상시킬 수 있다. 본 개시의 실시예에서, 인식된 제1 위치 정보가 교통 신호등의 일부의 위치만을 지시할 경우, 제1 위치 정보와 매칭되는 목표 위치 정보를 결정하는 것을 통하여, 인식될 이미지에서 목표 위치 정보와 대응되는 제1 이미지 구역을 결정하고, 제1 이미지 구역에 대하여 색깔 인식을 진행하여 인식 결과를 획득한다. 본 개시의 실시예는 색깔 인식을 진행할 시에 제1 이미지 구역에서의 빛무리의 상대 위치 관계를 고려했기 때문에, 색깔 인식의 효 과를 향상시켰다. 아래에서, 도 4를 결합하여 적어도 하나의 제2 정보 위치를 어떻게 결정하는지를 설명한다. 도 4는 본 개시의 다른 실시예에 따른 교통 신호등의 인식 방법의 개략도를 개략적으로 나타낸다. 도 4에 도시된 바와 같이, 신호등에 대한 복수의 초기 이미지(410, 420, 430)를 획득하고, 복수의 초기 이미지 를 각각 처리한다. 예를 들면, 각각의 초기 이미지에 대해 이미지 인식을 진행하여, 교통 신호등에 대한 복수의 초기 위치 정보(411, 412, 421, 422, 431, 432)를 획득한다. 각각의 초기 위치 정보는 교통 신호등의 위치를 지 시하며, 즉, 초기 위치 정보는 교통 신호등의 전체 램프 프레임에 대한 것이다. 복수의 초기 위치 정보의 수량 이 미리 설정된 수량보다 적을 경우, 초기 이미지를 계속 획득하여 인식할 수 있으며, 획득한 초기 위치 정보의 수량이 미리 설정된 수량보다 많거나 같을 경우, 다음의 그룹 분류 동작을 실행한다. 복수의 초기 위치 정보(411, 412, 421, 422, 431, 432)사이의 상대 위치 관계에 기반하여, 복수의 초기 위치 정 보(411, 412, 421, 422, 431, 432)를 구분하여 적어도 하나의 그룹을 획득한다. 예를 들면, 복수의 초기 위치 정보 중 유사한 초기 위치 정보를 동일한 그룹으로 구분하여 두 개의 그룹을 획득 한다. 제1 그룹은 예를 들면 초기 위치 정보(411, 421, 431)를 포함하고, 제2 그룹은 예를 들면 초기 위치 정보(412, 422, 432)를 포함한다. 적어도 하나의 그룹 중의 각 그룹에 대하여, 그룹 중의 초기 위치 정보에 기반하여 평균 위치 정보를 획득한다. 그리고, 적어도 하나의 평균 위치 정보를 적어도 하나의 제2 위치 정보로 한다. 예를 들면, 각각의 초기 위치 정보는 검출 틀의 위치 정보를 포함하며, 각 검출 틀의 중심점을 데이터 구조 중 의 데이터 그래프의 정점으로 하고, 중심점과 중심점 사이의 거리를 데이터 그래프의 변으로 하고, 변의 값이 한계치보다 작으면 해당 변으로 연결된 두 정점이 연결된 것으로 간주하고 해당 두 정점에 대응되는 초기 위치 정보를 하나의 그룹으로 구분한다. 각 그룹에 대하여, 해당 그룹 중의 각 검출 틀의 중심점의 위치 정보에 기반하여 참조 중심점의 위치 정보를 계 산하여 획득한다. 예를 들면, 해당 그룹 중의 모든 검출 틀의 중심점의 위치를 평균하여 평균치를 획득하고, 해 당 평균치를 참조 중심점의 위치로 한다. 또는, 해당 그룹 중의 모든 검출 틀의 중심점에서 중앙값의 중심점을 선택하여 참조 중심점으로 하고, 중앙값의 중심점 위치 정보가 바로 참조 중심점의 위치 정보이다.그리고, 참조 중심점의 위치 정보와 기준 검출 틀의 위치 정보에 기반하여, 평균 검출 틀의 위치 정보를 결정한 다. 기준 검출 틀은 기준 이미지에 기반하여 미리 결정된 교통 신호등에 대한 검출 틀이다. 제1 기준 검출 틀과 제2 기준 검출 틀을 포함하는 기준 검출 틀을 예로 한다. 제1 그룹에 대하여 결정된 평균 검출 틀의 중심점의 위치 정보는 제1 그룹에 대응되는 참조 중심점의 위치 정보이고, 평균 검출 틀의 길이와 폭은 제1 기준 검출 틀의 길이와 폭이다. 제2 그룹에 대하여 결정된 평균 검출 틀 의 중심점의 위치 정보는 제2 그룹에 대응되는 참조 중심점의 위치 정보이고, 평균 검출 틀의 길이와 폭은 제2 기준 검출 틀의 길이와 폭이다. 제1 기준 검출 틀의 길이와 폭 및 제2 기준 검출 틀의 길이와 폭은 예 를 들면 동일할 수 있고 상이할 수도 있다. 이어서, 평균 검출 틀의 위치 정보에 기반하여, 평균 위치 정보를 결정할 수 있다. 예를 들면, 복수의 그룹에 일일이 대응되는 복수의 평균 검출 틀(461, 462)의 위치 정보에 대하여, 복수의 평균 검출 틀(461, 462)의 위치 정보를 기준 검출 틀의 위치 정보와 각각 매칭시켜 매칭결과를 획득한다. 예시적으로, 복수의 평균 검출 틀(461, 462) 중의 임의의 하나에 대하여, 해당 평균 검출 틀의 위치 정보가 임 의의 하나의 기준 검출 틀의 위치 정보와 매칭되며, 예를 들면 해당 평균 검출 틀의 중심과 기준 검출 틀의 중 심 사이의 거리가 작으면 매칭된다는 것을 의미한다. 이럴 경우, 복수의 평균 검출 틀(461, 462)의 위치 정보를 평균 위치 정보로 사용할 수 있고, 평균 위치 정보를 제2 위치 정보로 할 수 있다. 예시적으로, 복수의 평균 검출 틀(461, 462) 중의 임의의 하나에 대하여, 평균 검출 틀의 위치 정보가 모든 기 준 검출 틀의 위치 정보와 매칭되지 않으며, 예를 들면 평균 검출 틀의 중심과 모든 기준 검출 틀의 중심 사이 의 거리가 크면 매칭되지 않는다는 것을 의미한다. 매칭되지 않는 것은 초기 이미지를 인식할 시에 오인식의 상 황이 존재하기 때문일 수 있다. 이럴 경우, 복수의 평균 검출 틀에 대하여 삭제 동작을 진행할 수 있다. 예를 들면, 매칭되지 않는 평균 검출 틀을 삭제하고 나머지 평균 검출 틀의 위치 정보를 평균 위치 정보로 하며, 평 균 위치 정보를 제2 위치 정보로 한다. 제1 위치 정보 및 제2 위치 정보는 검출 틀의 위치 정보일 수도 있다. 본 개시의 실시예에서, 복수의 초기 이미지를 인식하여 평균 검출 틀을 획득하고, 평균 검출 틀에 기반하여 제2 위치 정보를 획득하여, 제2 위치 정보에 기반한 교통 신호등의 색깔 인식의 실행을 용이하게 하며, 인식 효과를 향상시켰다. 본 개시의 다른 실시예에서, 인식될 이미지를 인식하여 제1 위치 정보를 획득한 후, 제1 위치 정보가 교통 신호 등의 전체 위치를 지시하면, 제1 위치 정보가 전체 램프 틀에 대한 것임을 결정할 수 있고, 이 경우에는 제1 위 치 정보와 적어도 하나의 제2 위치 정보 사이의 상대 위치 관계를 결정할 수 있다. 예를 들면, 적어도 하나의 제2 위치 정보 중의 임의의 하나에 대하여, 임의의 하나의 제2 위치 정보가 나타내는 위치와 제1 위치 정보가 나타내는 위치 사이의 거리가 미리 설정된 거리보다 작으면, 제1 위치 정보와 해당 제2 위치 정보가 매칭된다는 것을 나타내며, 인식될 이미지에서 제1 위치 정보에 대응되는 제2 이미지 구역을 직접 결정할 수 있다. 그리고, 제2 이미지 구역에 대하여 직접 인식을 진행하여, 교통 신호등의 색깔을 획득한다. 제 2 이미지 구역을 인식하는 과정은 상술한 제1 이미지 구역을 인식하는 과정과 유사하기 때문에 여기서는 다시 설명하지 않는다. 모든 제2 위치 정보가 나타내는 위치와 제1 위치 정보가 나타내는 위치 사이의 거리가 미리 설정된 거리보다 크 거나 같으면, 제1 위치 정보가 모든 제2 위치 정보와 매칭되지 않는다는 것을 나타내고, 제1 위치 정보가 지시 하는 전체 램프 프레임은 나중에 새로 추가된 램프 프레임일 수 있음을 나타낸다. 이럴 경우에는 색깔 인식을 진행하지 않는다. 계속하여 복수의 새로 추가된 이미지를 획득하고, 복수의 새로 추가된 이미지를 인식하여 제1 위치 정보와 대응되는 복수의 새로 추가된 위치 정보를 획득하고, 제1 위치 정보와 새로 추가된 위치 정보에 대 하여 처리를 진행하여 새로 추가된 평균 위치 정보를 획득한다. 제1 위치 정보와 새로 추가된 위치 정보에 대하 여 처리를 진행하는 과정은 상술한 각 그룹 중의 복수의 초기 위치 정보의 처리 과정과 유사하기 때문에 여기서 는 다시 설명하지 않는다. 그리고, 새로 추가된 평균 위치 정보를 적어도 하나의 제2 위치 정보에 추가함으로써, 추후에 업데이트된 제2 위치 정보에 기반하여 색깔 인식을 진행하는 것을 용이하게 한다. 본 개시의 실시예에서, 제2 위치 정보를 실시간으로 업데이트할 수 있기 때문에, 업데이트된 제2 위치 정보에 기반하여 색깔 인식을 진행하는 것을 용이하게 하며, 인식의 정확도를 향상시킨다. 도 5는 본 개시의 일 실시예에 따른 교통 신호등의 인식 장치의 블록도를 개략적으로 나타낸다. 도 5에 도시 된 바와 같이, 본 개시의 실시예의 교통 신호등의 인식 장치는 예를 들면 제1 인식 모듈 , 제1 결정 모듈 및 제2 인식 모듈을 포함한다. 제1 인식 모듈은 인식될 이미지를 인식하여 교통 신호등의 제1 위치 정보를 획득하기 위한 것일 수 있다. 본 개시의 실시예에 따르면, 제1 인식 모듈은 예를 들면 상술한 도 2를 참조하여 설명한 동작 S210을 실행 할 수 있으며, 여기서는 다시 설명하지 않는다. 제1 결정 모듈은 제1 위치 정보가 교통 신호등 중의 일부의 위치를 지시하는 것에 응답하여, 제1 위치 정 보와 교통 신호등의 위치를 지시하는 적어도 하나의 제2 위치 정보 사이의 상대 위치 관계에 기반하여, 적어도 하나의 제2 위치 정보에서 목표 위치 정보를 결정하기 위한 것일 수 있다. 본 개시의 실시예에 따르면, 제1 결 정 모듈은 예를 들면 상술한 도 2를 참조하여 설명한 동작 S220을 실행할 수 있으며, 여기서는 다시 설명 하지 않는다. 제2 인식 모듈은 인식될 이미지 중의 목표 위치 정보에 대응되는 제1 이미지 구역에 대하여, 제1 이미지 구역을 인식하여, 교통 신호등의 색깔을 획득하기 위한 것일 수 있다. 본 개시의 실시예에 따르면, 제2 인식 모 듈은 예를 들면 상술한 도 2를 참조하여 설명한 동작 S230을 실행할 수 있으며, 여기서는 다시 설명하지 않는다. 본 개시의 실시예에 따르면, 장치는 획득 모듈, 처리 모듈 및 제2 결정 모듈을 더 포함할 수 있다. 획득 모듈은 교통 신호등에 대한 복수의 초기 이미지를 획득하기 위한 것이다. 처리 모듈은 복수의 초기 이미지를 처 리하여, 교통 신호등에 대한 적어도 하나의 평균 위치 정보를 획득하기 위한 것이다. 제2 결정 모듈은 적어도 하나의 평균 위치 정보를 적어도 하나의 제2 위치 정보로 하기 위한 것이다. 본 개시의 실시예에 따르면, 처리 모듈은 인식 서브 모듈, 구분 서브 모듈 및 제1 결정 서브 모듈을 포함한다. 인식 서브 모듈은 복수의 초기 이미지에 대하여 이미지 인식을 진행하여, 교통 신호등에 대한, 교통 신호등의 위치를 지시하는 복수의 초기 위치 정보를 획득하기 위한 것이다. 구분 서브 모듈은 복수의 초기 위치 정보 사 이의 상대 위치 관계에 기반하여 복수의 초기 위치 정보를 구분하여 적어도 하나의 그룹을 획득하기 위한 것이다. 제1 결정 서브 모듈은 적어도 하나의 그룹 중의 각 그룹에 대하여 그룹 중의 초기 위치 정보에 기반하여 평 균 위치 정보를 획득하기 위한 것이다. 본 개시의 실시예에 따르면, 초기 위치 정보는 검출 틀의 위치 정보를 포함하고, 제1 결정 서브 모듈은 계산 유 닛, 제1 결정 유닛 및 제2 결정 유닛을 포함한다. 계산 유닛은 그룹 중의 각 검출 틀의 중심점의 위치 정보에 기반하여 참조 중심점의 위치 정보를 계산하여 획득하기 위한 것이다. 제1 결정 유닛은 참조 중심점의 위치 정 보와 기준 이미지에 기반하여 결정된 교통 신호등에 대한 검출 틀인 기준 검출 틀의 위치 정보에 기반하여, 평 균 검출 틀의 위치 정보를 결정하기 위한 것이다. 제2 결정 유닛은 평균 검출 틀의 위치 정보에 기반하여 평균 위치 정보를 결정하기 위한 것이다. 본 개시의 실시예에 따르면, 제2 결정 유닛은 매칭 서브 유닛 및 삭제 서브 유닛을 포함한다. 매칭 서브 유닛은 복수의 그룹에 일일이 대응되는 복수의 평균 검출 틀의 위치 정보에 대하여, 복수의 평균 검출 틀의 위치 정보 를 기준 검출 틀의 위치 정보와 각각 매칭시켜 매칭결과를 획득하기 위한 것이다. 삭제 서브 유닛은 매칭 결과 에 기반하여 복수의 평균 검출 틀에 대하여 삭제 동작을 진행하고, 나머지 평균 검출 틀의 위치 정보를 평균 위 치 정보로 하기 위한 것이다. 본 개시의 실시예에 따르면, 장치는 제3 결정 모듈, 제4 결정 모듈 및 제3 인식 모듈을 더 포함할 수 있다. 제3 결정 모듈은 제1 위치 정보가 교통 신호등의 위치를 지시하는 것에 응답하여, 제1 위치 정보와 적어 도 하나의 제2 위치 정보 사이의 상대 위치 관계를 결정하기 위한 것이다. 제4 결정 모듈은 적어도 하나의 제2 위치 정보 중의 임의의 하나에 대하여, 임의의 하나의 제2 위치 정보가 나타내는 위치와 제1 위치 정보가 나타 내는 위치 사이의 거리가 미리 설정된 거리보다 작은 것에 응답하여, 인식될 이미지에서 제1 위치 정보와 대응 되는 제2 이미지 구역을 결정하기 위한 것이다. 제3 인식 모듈은 제2 이미지 구역을 인식하여 교통 신호등의 색 깔을 획득하기 위한 것이다. 본 개시의 실시예에 따르면, 장치는 제4 인식 모듈, 제5 결정 모듈 및 추가 모듈을 더 포함할 수 있다. 제 4 인식 모듈은 임의의 하나의 제2 위치 정보가 나타내는 위치와 제1 위치 정보가 나타내는 위치 사이의 거리가 미리 설정된 거리보다 크거나 같은 것에 응답하여, 새로 추가된 이미지를 인식하여 새로 추가된 위치 정보를 획 득하기 위한 것이다. 제5 결정 모듈은 제1 위치 정보와 새로 추가된 위치 정보에 기반하여 새로 추가된 평균 위 치 정보를 획득하기 위한 것이다. 추가 모듈은 새로 추가된 평균 위치 정보를 적어도 하나의 제2 위치 정보에 추가하기 위한 것이다.본 개시의 실시예에 따르면, 제2 인식 모듈은 제2 결정 서브 모듈과 제3 결정 서브 모듈 중의 적어도 하나 를 포함한다. 제2 결정 서브 모듈은 제1 이미지 구역 중의 일부 픽셀의 픽셀 값에 기반하여 교통 신호등의 색깔 을 결정하기 위한 것이다. 제3 결정 서브 모듈은 제1 이미지 구역 중의 픽셀의 분포에 기반하여 교통 신호등의 색깔을 결정하기 위한 것이다. 본 개시의 기술 방안에서 언급된 사용자 개인 정보의 취득, 저장과 응용 등은 모두 관련 법률과 법규의 규정에 부합되고 공서 양속을 위반하지 않는다. 본 개시의 실시예에 따르면, 본 개시는 또한 전자 기기와 판독 가능 저장 매체와 컴퓨터 프로그램 제품을 제공 한다. 도 6은 본 개시의 실시예를 구현하기 위해 교통 신호등의 인식을 수행하기 위한 전자 기기의 블록도이다. 도 6는 본 개시의 실시예를 실시하는 데에 사용될 수 있는 예시적인 전자 기기의 개략적인 블록도이다. 전 자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크스테이션, 개인 휴대 정보 단말기, 서버, 블레이드 서버, 메인 프레임 컴퓨터 및 기타 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 말한다. 전자 기기는 개인 휴대 정보 단말기, 셀룰러 전화, 스마트 폰, 웨어러블 디바이스 및 기타 유사한 컴퓨팅 장치와 같은 다양한 형 태의 모바일 장치를 말할 수도 있다. 본 명세서에서 나타낸 부품, 이들의 연결 및 관계, 및 이들의 기능은 단지 예시일 뿐이며, 본 명세서에서의 설명 및/또는 요구하는 본 출원의 구현을 한정하려 하는 것이 아니다. 도 6에 도시된 바와 같이, 기기는 읽기 전용 기억 장치(ROM)에 저장된 컴퓨터 프로그램 또는 저장 유 닛에서 랜덤 액세스 메모리(RAM)로 로드된 컴퓨터 프로그램에 따라 다양한 적절한 동작 및 처리를 실 행할 수 있는 컴퓨팅 유닛을 포함한다. RAM에는 기기의 동작에 필요한 다양한 프로그램 및 데이 터가 저장될 수 있다. 컴퓨팅 유닛, ROM 및 RAM은 버스를 통해 서로 연결된다. 입력/출력 (I/O)인터페이스도 버스에 연결된다. 기기 중의 복수의 부품은 I/O인터페이스와 연결되며, 예를 들면 키보드, 마우스 등과 같은 입력 유닛 ; 예를 들면 다양한 유형의 디스플레이, 스피커 등과 같은 출력 유닛; 예를 들면 자기 디스크, 시디 롬 등과 같은 저장 유닛 및 예를 들면 랜 카드, 모뎀, 무선 통신 송수신기 등과 같은 통신 유닛을 포 함한다. 통신 유닛은 기기가 인터넷과 같은 컴퓨터 네트워크 및/또는 다양한 통신 네트워크와 기타 장치를 통하여 정보/데이터를 교환할 수 있도록 허용한다. 컴퓨팅 유닛은 처리 및 컴퓨팅 능력을 갖는 다양한 범용 및/또는 전용 처리 유닛일 수 있다. 컴퓨팅 유닛 의 일부 예는 중앙 처리 유닛(CPU), 그래픽 처리 유닛(GPU), 다양한 전용 인공 지능(AI) 컴퓨팅 칩, 머신 러닝 모델 알고리즘을 실행하는 다양한 컴퓨팅 유닛, 디지털 신호 처리 장치(DSP) 및 임의의 적절한 프로세서, 컨트롤러, 마이크로 컨트롤러 등을 포함하지만 이에 한정되지 않는다. 컴퓨팅 유닛은 예를 들면 교통 신호 등의 인식 방법과 같은 상술한 다양한 방법과 처리를 실행한다. 예를 들면, 일부 실시예에서는 교통 신호등의 인식 방법은 컴퓨터 소프트웨어 프로그램으로 구현될 수 있으며, 이는 예를 들면 유형적으로 저장 유닛과 같은 기계 판독 가능 매체에 포함된다. 일부 실시예에서, 컴퓨터 프로그램의 일부 또는 전부는 ROM 및/또 는 통신 유닛을 통해 기기에 로드 및/또는 설치될 수 있다. 컴퓨터 프로그램이 RAM에 로딩되고 컴퓨팅 유닛에 의해 실행될 경우, 상술한 교통 신호등의 처리 방법 중의 하나 또는 복수의 동작을 실행할 수 있다. 선택적으로, 다른 실시 예에서, 컴퓨팅 유닛은 기타 임의의 적절한 방식(예를 들면, 펌웨어에 의 해)으로 교통 신호등의 인식 방법을 실행하도록 배치될 수 있다. 본 명세서의 상술한 시스템 및 기술의 다양한 구현 방식은 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프로그램 가능 게이트 어레이(FPGA), 전용 집적 회로(ASIC), 특정 용도 표준 제품(ASSP), 시스템 온칩(SOC), 복 합 프로그램 가능 논리 장치(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양한 실시방식은 아래와 같은 것을 포함할 수 있다. 하나 또는 복수의 컴퓨터 프로그램에서 실 시될 수 있으며, 해당 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행 및/또는 해석될 수 있으며, 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서일 수 있으며, 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터 및 명령어를 수신하고, 데이터 및 명령어를 해당 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치에 전송할 수 있다. 본 개시의 방법을 실행하기 위한 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의의 조합으로 작성될 수 있다. 이러한 프로그램 코드는 범용 컴퓨터, 전용 컴퓨터 또는 기타 프로그램 가능 데이터 처리 장치의 프로세서 또는 컨트롤러에 제공하여, 프로그램 코드가 프로세서 또는 컨트롤러에 의해 실행될 때 흐름도 및/또는 블 록도에서 규정한 기능/동작이 실시되도록 할 수 있다. 프로그램 코드는 완전히 기계에서 실행되거나, 부분적으 로 기계에서 실행되거나, 독립적인 소프트웨어 패키지로서 부분적으로 기계에서 실행되면서 부분적으로 원격 기 계에서 실행되거나, 완전히 원격 기계 또는 서버에서 실행될 수 있다. 본 개시 내용의 맥락에서, 기계 판독 가능 매체는 명령어 실행 시스템, 장치 또는 설비에 의해 사용되거나, 명 령어 실행 시스템, 장치 또는 설비와 결합하여 사용되도록 제공하는 프로그램을 포함하거나 저장할 수 있는 매 체일 수 있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 저장 매체일 수 있다. 기 계 판독 가능 매체는 전자, 자기, 광학, 전자기, 적외선 또는 반도체 시스템, 장치 또는 기기, 또는 이들의 임 의의 적절한 조합을 포함할 수 있지만 이에 한정되지 않는다. 기계 판독 가능 저장 매체의 보다 구체적인 예에 는 하나 또는 복수의 전선에 기반한 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 임의기억장치 (RAM), 읽기 전용 기억 장치 (ROM), 소거 가능 프로그램 가능 읽기 전용 기억 장치 (EPROM 또는 플래시 메모리), 광섬유, 휴 대용 컴팩트 디스크 읽기 전용 기억 장치 (CD-ROM), 광학 저장 장치, 자기 저장 장치 또는 이들의 임의의 적절 한 조합을 포함할 수 있다. 사용자와의 인터랙션을 제공하기 위하여, 여기에 설명된 시스템 및 기술을 컴퓨터에서 실시할 수 있다. 이 컴퓨 터는 사용자에게 정보를 표시하는 디스플레이 장치(예: CRT(음극선관) 또는 LCD(액정 디스플레이) 모니터) 및 사용자가 컴퓨터에 입력을 제공할 수 있는 키보드 및 위치 결정 장치(예를 들면, 마우스 또는 트랙볼)를 구비한 다. 다른 유형의 장치도 사용자와의 인터랙션을 제공하기 위해 사용될 수 있다. 예를 들면, 사용자에게 제공되 는 피드백은 모든 형태의 감지 피드백(예를 들면, 시각 피드백, 청각 피드백 또는 촉각 피드백) 일 수 있고, 모 든 형태(소리 입력, 음성 입력 또는 촉각 입력을 포함)를 이용하여 사용자로부터의 입력을 접수할 수 있다. 여기에 설명된 시스템 및 기술을 백그라운드 부품을 포함하는 컴퓨팅 시스템(예를 들면, 데이터 서버로 함) 또 는 미들웨어 부품을 포함하는 컴퓨팅 시스템(예를 들면, 애플리케이션 서버) 또는 프론트 엔드 부품을 포함하는 컴퓨팅 시스템(예를 들면, 그래픽 유저 인터페이스 또는 웹 브라우저를 가지고 있는 사용자 컴퓨터이며, 사용자 가 상기 그래픽 유저 인터페이스 또는 웹 브라우저를 통하여 여기에 설명된 시스템 및 기술의 실시 형태과 인터 랙션할 수 있다) 또는 이러한 백그라운드 부품, 미들웨어 부품, 또는 프런트 엔드 부품의 모든 조합을 포함하는 컴퓨팅 시스템에서 실시할 수 있다. 임의의 형식 또는 매체의 디지털 데이터 통신(예를 들면, 통신 네트워크)을 통해 시스템의 부품을 서로 연결할 수 있다. 통신 네트워크의 예로는 근거리 통신망(LAN), 광역 통신망(WAN) 및 인터넷을 포함한다. 통신 네트워크의 예로는 근거리 통신망(LAN), 광역 통신망(WAN) 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트와 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있으 며, 일반적으로 통신 네트워크를 통해 인터랙션한다. 클라이언트와 서버간의 관계는 해당 컴퓨터에서 실행되고 서로 클라이언트-서버 관계를 갖는 컴퓨터 프로그램에 의해 생성된다. 서버는 클라우드 서버일수 있고, 분산 시 스템의 서버일 수도 있고, 또는 블록체인과 결합된 서버일 수도 있다. 위에 나타낸 다양한 형태의 흐름을 사용하여 동작을 다시 순서 배열, 추가 또는 삭제할 수 있음을 이해해야 한 다. 예를 들면, 본 출원에 기재된 각 동작은 본 개시에서 개시하는 기술 방안이 기대하는 결과를 구현할 수 있 는 한, 병행하여 실행하거나 순차적으로 실행하거나 다른 순서로 실행할 수도 있으며, 본 명세서에서는 여기에 대해서 제한을 하지 않는다. 상술한 구체적인 실시방식은 본 출원의 청구범위에 대한 제한을 구성하지 않는다. 해당 발명이 속하는 기술 분 야에서 통상의 지식을 가진 자라면 설계 요구 및 기타 요소에 따라 다양한 수정, 조합, 서브 조합 및 대체를 진 행할 수 있음을 이해해야 한다. 본 출원의 정신과 원칙내에서 이루어진 모든 수정, 동등한 교체 및 개선 등은 본 출원의 청구범위내에 포함되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2022-0045668", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 방안을 보다 잘 이해 하는 데 사용되며, 본 출원에 대한 한정이 되지 않는다. 그중에, 도 1은 본 개시의 일 실시예에 따른 교통 신호등의 인식 방법과 장치의 적용 장면을 개략적으로 나타내며, 도 2는 본 개시의 일 실시예에 따른 교통 신호등의 인식 방법의 흐름도를 개략적으로 나타내며, 도 3은 본 개시의 일 실시예에 따른 교통 신호등의 인식 방법을 개략적으로 나타내며, 도 4는 본 개시의 다른 실시예에 따른 교통 신호등의 인식 방법을 개략적으로 나타내며, 도 5는 본 개시의 일 실시예에 따른 교통 신호등의 인식 장치의 블록도를 개략적으로 나타내며, 도 6은 본 개시의 실시예를 구현하기 위해 사용되는 교통 신호등의 인식을 수행하기 위한 전자 기기의 블록도이 다."}
