{"patent_id": "10-2022-7029130", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0131315", "출원번호": "10-2022-7029130", "발명의 명칭": "무선 통신 시스템에서의 사이드링크 TX 자원 풀 선택 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "정경인"}}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서의 사용자 장치(user equipment; UE)의 방법에 있어서,자원 풀(pool)의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 송신(TX) 자원 풀에 대한 설정정보를 수신하는 단계;RRC (radio resource control) 서브 레이어(sub-layer)에서, HARQ (hybrid automatic repeat request) 피드백채널에 기초하여 상기 자원 풀의 제1 및 제2 세트를 식별하는 단계;MAC (medium access control) 서브 레이어에서 SL (sidelink) 데이터를 송신할 논리 채널 - 상기 논리 채널은논리 채널 우선 순위화(logical channel prioritization; LCP) 기능을 사용하여 다수의 논리 채널 중에서 가장높은 우선 순위를 포함함 - 을 선택하는 단계;상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었는지를 판단하는 단계;상기 MAC 서브 레이어에서, 상기 논리 채널이 상기 HARQ 피드백 채널이 설정되었다는 판단에 기초하여 상기 자원 풀의 제1 세트로부터 TX 자원 풀을 선택하는 단계; 및상기 TX 자원 풀에 기초하여 상기 SL 데이터를 전송하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 자원 풀의 제1 세트는 상기 HARQ 피드백 채널을 위한 자원을 포함하고, 상기 자원 풀의 제2 세트는 상기HARQ 피드백 채널을 위한 자원을 포함하지 않는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,SL 논리 채널 설정 정보를 포함하는 SL 베어러 설정 정보를 수신하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 TX 자원 풀은 시스템 정보 블록(system information block; SIB)에 의해 설정되거나;상기 TX 자원 풀은 UE 전용 RRC 메시지를 포함하는 상위 계층 신호에 의해 설정되거나; 또는상기 TX 자원 풀은 사전 설정된 정보로부터 설정되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "무선 통신 시스템에서의 사용자 장치(user equipment; UE)에 있어서,송수신부; 및상기 송수신부에 동작 가능하게 연결된 프로세서를 포함하며, 상기 프로세서는,상기 송수신부를 통해, 자원 풀(pool)의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 송신(TX) 자원 풀에 대한 설정 정보를 수신하고,RRC (radio resource control) 서브 레이어(sub-layer)에서, HARQ (hybrid automatic repeat request) 피드백채널에 기초하여 상기 자원 풀의 제1 및 제2 세트를 식별하고,MAC (medium access control) 서브 레이어에서 SL (sidelink) 데이터를 송신할 논리 채널 - 상기 논리 채널은공개특허 10-2022-0131315-3-논리 채널 우선 순위화(logical channel prioritization; LCP) 기능을 사용하여 다수의 논리 채널 중에서 가장높은 우선 순위를 포함함 - 을 선택하고,상기 MAC 서브 레이어에서, 상기 논리 채널에 상 HARQ 피드백 채널이 설정되었는지를 판단하고,상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었다는 판단에 기초하여 상기 자원 풀의 제1 세트로부터 TX 자원 풀을 선택하며,상기 송수신부를 통해, 상기 TX 자원 풀에 기초하여 상기 SL 데이터를 전송하도록 구성되는, UE."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 자원 풀의 제1 세트는 상기 HARQ 피드백 채널을 위한 자원을 포함하고, 상기 자원 풀의 제2 세트는 상기HARQ 피드백 채널을 위한 자원을 포함하지 않는 것을 특징으로 하는 UE."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서,상기 프로세서는 상기 송수신부를 통해, SL 논리 채널 설정 정보를 포함하는 SL 베어러 설정 정보를 수신하도록더 구성되는 것을 특징으로 하는 UE."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5 항에 있어서,상기 TX 자원 풀은 시스템 정보 블록(system information block; SIB)에 의해 설정되거나;상기 TX 자원 풀은 UE 전용 RRC 메시지를 포함하는 상위 계층 신호에 의해 설정되거나; 또는 상기 TX 자원 풀은 사전 설정된 정보로부터 설정되는 것을 특징으로 하는 UE."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "무선 통신 시스템에서의 기지국의 방법에 있어서,자원 풀(pool)의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 송신(TX) 자원 풀에 대한 설정정보를 전송하는 단계; 및상기 자원 풀의 제1 세트로부터 결정된 TX 자원 풀에 기초하여 SL (sidelink) 데이터를 수신하는 단계를 포함하며,상기 SL 데이터는 다수의 논리 채널로부터 논리 채널 우선 순위화(logical channel prioritization; LCP) 기능에 의해 결정된 가장 높은 우선 순위를 포함하는 논리 채널로 수신되고, 상기 논리 채널에 상기 자원 풀의 제1세트와 연관된 HARQ (hybrid automatic repeat request) 피드백 채널이 설정되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 자원 풀의 제1 세트는 상기 HARQ 피드백 채널을 위한 자원을 포함하고, 상기 자원 풀의 제2 세트는 상기HARQ 피드백 채널을 위한 자원을 포함하지 않는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,SL 논리 채널 설정 정보를 포함하는 SL 베어러 설정 정보를 송신하는 단계를 더 포함하는 방법."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "무선 통신 시스템에서의 기지국에 있어서,공개특허 10-2022-0131315-4-송수신부; 및상기 송수신부에 동작 가능하게 연결된 프로세서를 포함하며, 상기 프로세서는,상기 송수신부를 통해, 자원 풀(pool)의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 송신(TX) 자원 풀에 대한 설정 정보를 전송하고,상기 송수신부를 통해, 상기 자원 풀의 제1 세트로부터 결정된 TX 자원 풀에 기초하여 SL (sidelink) 데이터를수신하도록 구성되며,상기 SL 데이터는 다수의 논리 채널로부터 논리 채널 우선 순위화(logical channel prioritization; LCP) 기능에 의해 결정된 가장 높은 우선 순위를 포함하는 논리 채널로 수신되고, 상기 논리 채널에 상기 자원 풀의 제1세트와 연관된 HARQ (hybrid automatic repeat request) 피드백 채널이 설정되는 것을 특징으로 하는 기지국."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 자원 풀의 제1 세트는 상기 HARQ 피드백 채널을 위한 자원을 포함하고, 상기 자원 풀의 제2 세트는 상기HARQ 피드백 채널을 위한 자원을 포함하지 않는 것을 특징으로 하는 기지국."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서,상기 프로세서는 상기 송수신부를 통해, SL 논리 채널 설정 정보를 포함하는 SL 베어러 설정 정보를 송신하도록더 구성되는 것을 특징으로 하는 기지국."}
{"patent_id": "10-2022-7029130", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 12 항에 있어서,상기 TX 자원 풀은 시스템 정보 블록(system information block; SIB)에 의해 설정되거나;상기 TX 자원 풀은 UE 전용 RRC 메시지를 포함하는 상위 계층 신호에 의해 설정되거나; 또는상기 TX 자원 풀은 사전 설정된 정보로부터 설정되는 것을 특징으로 하는 기지국."}
{"patent_id": "10-2022-7029130", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 4G 시스템 이후 보다 높은 데이터 전송률을 지원하기 위한 5G 통신 시스템을 IoT 기술과 융합하는 통 신 기법 및 그 시스템에 관한 것이다. 본 개시는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스 (예 를 들어, 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 헬스 케어, 디지털 교육, 소매업, (뒷면에 계속)"}
{"patent_id": "10-2022-7029130", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 무선 통신 시스템에 관한 것으로서, 보다 구체적으로, 본 개시는 V2X(vehicle-to- everything) 통신에서 사이드링크(sidelink; SL) 송신(TX) 자원 풀(resource pool) 선택에 관한 것이다."}
{"patent_id": "10-2022-7029130", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시 스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 4G 네트워크 이후 (Beyond 4G Network) 통신 시스템 또는 LTE 시스템 이후 (Post LTE) 이후의 시스템이라 불리어지고 있다. 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파(mmWave) 대역 (예를 들어, 60기가(60GHz) 대역과 같은)에서의 구현이 고려되고 있다. 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대 배열 다 중 입출력(massive MIMO), 전차원 다중입출력(Full Dimensional MIMO: FD-MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 및 대규모 안테나 (large scale antenna) 기술들이 논의되 고 있다. 또한 시스템의 네트워크 개선을 위해, 5G 통신 시스템에서는 진화된 소형 셀, 개선된 소형 셀 (advanced small cell), 클라우드 무선 액세스 네트워크 (cloud radio access network: cloud RAN), 초고밀도 네트워크 (ultra-dense network), 기기 간 통신 (Device to Device communication: D2D), 무선 백홀 (wireless backhaul), 이동 네트워크 (moving network), 협력 통신 (cooperative communication), CoMP (Coordinated Multi-Points), 및 수신 간섭제거 (interference cancellation) 등의 기술 개발이 이루어지고 있다. 이밖에도, 5G 시스템에서는 진보된 코딩 변조(Advanced Coding Modulation: ACM) 방식인 FQAM (Hybrid FSK and QAM Modulation) 및 SWSC (Sliding Window Superposition Coding)과, 진보된 접속 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non orthogonal multiple access), 및SCMA(sparse code multiple access) 등이 개발되 고 있다. 한편, 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 IoT(Internet of Things, 사물인터넷) 망으로 진화하고 있다. 클라우드 서버 등과 의 연결을 통한 빅데이터(Big data) 처리 기술 등이 IoT 기술에 결합된 IoE (Internet of Everything) 기술도 대두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소 들이 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 연구되고 있다. IoT 환경에서는 연결된 사물들에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능 형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(information technology)기술과 다양 한 산업 간의 융합 및 복합을 통하여 스마트홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마 트 그리드, 헬스 케어, 스마트 가전, 첨단의료서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도들이 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 5G 통 신 기술인 빔 포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처 리 기술로써 클라우드 무선 액세스 네트워크(cloud RAN)가 적용되는 것도 5G 기술과 IoT 기술 융합의 일 예라고 할 수 있을 것이다. 5세대(5G) 또는 NR(new radio) 이동 통신은 최근에 산학연의 다양한 후보 기술에 대한 전 세계적인 기술 활동이 활발해짐에 따라 더욱 탄력을 받고 있다. 5G/NR 이동 통신을 위한 후보 인에이블러(candidate enabler)는 기존 셀룰러 주파수 대역에서 고주파수까지 빔포밍 이득을 제공하고 증가된 용량을 지원하기 위한 대규모 안테나 기 술, 다양한 요구 사항을 가진 다양한 서비스/애플리케이션을 유연하게 수용하는 새로운 파형(예를 들어, 새로운 무선 액세스 기술(radio access technology; RAT)), 대규모 연결을 지원하는 새로운 다중 액세스 방식 등을 포 함한다. 또한, 세대에 걸친 무선 통신의 발전을 고려하여, 음성 통화, 멀티미디어 서비스 및 데이터 서비스와 같이 인간 을 대상으로 하는 서비스를 위한 기술이 주로 개발되어 왔다. 5G(5세대) 통신 시스템의 상용화에 따라, 연결된 장치의 수는 기하급수적으로 증가할 것으로 예상된다. 점차적으로, 이는 통신 네트워크에 연결될 것이다. 연결 된 사물(connected things)의 예는 차량, 로봇, 드론, 가전 제품, 디스플레이, 다양한 인프라에 연결된 스마트 센서, 건설 기계, 및 공장 장치를 포함할 수 있다. 모바일 장치는 증강 현실 글래스(augmented reality glass), 가상 현실 헤드셋(virtual reality headset), 홀로그램 장치와 같은 폼 팩터(form-factor)로 진화할 것으로 예 상된다. 6G(6세대) 시대에서 수천억 개의 장치와 사물을 연결함으로써 다양한 서비스를 제공하기 위해, 개선된 6G 통신 시스템을 개발하려는 노력이 지속되고 있다. 이러한 이유로, 6G 통신 시스템은 5G 이후(beyond-5G) 시 스템이라고 한다. 2030년경 상용화가 예상되는 6G 통신 시스템은 테라(1,000기가) 레벨 bps의 피크 데이터 송신률과 100μsec 미 만의 무선 대기 시간을 가질 것이며, 따라서 5G 통신 시스템보다 50배 빠르고 1/10 무선 대기 시간을 가질 것이다. 이러한 높은 데이터 송신률과 초저 대기 시간을 달성하기 위해, 테라헤르츠 대역(예를 들어, 95GHz 내지 3THz 대역)에서 6G 통신 시스템을 구현하는 것이 고려되었다. 5G에 도입된 mmWave 대역보다 테라헤르츠 대역의 경로 손실과 대기 흡수가 더 심해, 신호 송신 거리(즉, 커버리지)를 확보할 수 있는 기술이 더욱 중요해질 것으로 예 상된다. 커버리지를 확보하기 위한 주요 기술로서, 무선 주파수(radio frequency; RF) 소자, 안테나, 직교 주파 수 분할 다중화(orthogonal frequency division multiplexing; OFDM), 빔포밍 및 대규모 다중 입력 다중 출력 (MIMO)보다 우수한 커버리지를 가진 신규 파형, FD-MIMO(full dimensional MIMO), 어레이 안테나, 및 대규모 안테나와 같은 다중 안테나 송신 기술을 개발하는 것이 필요하다. 또한, 메타물질 기반 렌즈(metamaterial- based lens) 및 안테나, 궤도 각 운동량(orbital angular momentum; OAM), 재설정 가능한 지능형 표면 (reconfigurable intelligent surface; RIS)과 같은 테라헤르츠 대역 신호의 커버리지를 개선하기 위한 새로운 기술에 대한 논의가 진행 중이다. 더욱이, 스펙트럼 효율성과 전체 네트워크 성능을 향상시키기 위해, 6G 통신 시스템을 위해 다음과 같은 기술: 업링크 송신과 다운링크 송신이 동시에 동일한 주파수 자원을 사용할 수 있도록 하기 위한 전이중(full-duplex) 기술; 위성, HAPS(high-altitude platform station) 등을 통합적으로 활용하기 위한 네트워크 기술; 이동 기지 국 등을 지원하고 네트워크 운영 최적화 및 자동화 등을 가능하게 하기 위한 개선된 네트워크 구조; 스펙트럼 사용의 예측에 기반한 충돌 회피(collison avoidance)를 통한 동적 스펙트럼 공유 기술; 6G를 개발하고 종단 간 AI 지원 기능(end-to-end AI support function)을 내재화(internalizing)하기 위한 설계 단계로부터 AI를 활용 함으로써 전반적인 네트워크 운영의 개선을 위한 무선 통신에서의 인공 지능(artificial intelligence; AI)의 사용; 및 네트워크를 통해 도달 가능한 초고성능 통신 및 컴퓨팅 자원(예를 들어, 모바일 에지 컴퓨팅(mobile edge computing; MEC), 클라우드 등)을 통해 UE 컴퓨팅 능력의 한계를 극복하기 위한 차세대 분산 컴퓨팅 기술 이 개발되었다. 또한, 6G 통신 시스템에서 사용될 새로운 프로토콜의 설계, 하드웨어 기반의 보안 환경의 구현 및 데이터의 안전한 사용을 위한 메커니즘의 개발, 프라이버시(privacy)를 유지하기 위한 기술의 개발을 통해, 장치 간 연결을 강화하고, 네트워크를 최적화하고, 네트워크 엔티티의 소프트웨어화를 촉진하며, 무선 통신의 개방성(openness)을 증가시키려는 시도가 계속되고 있다. 사람 대 기계(person to machine; P2M) 및 기계 대 기계(machine to machine; M2M)를 포함하는 초연결(hyper- connectivity)에서의 6G 통신 시스템의 연구 및 개발은 차세대 초연결 경험(next hyper-connected experienc e)을 할 것으로 예상된다. 특히, 6G 통신 시스템을 통해 진정한 몰입형 확장 현실(extended reality; XR), 고화 질 모바일 홀로그램, 디지털 복제와 같은 서비스가 제공될 수 있을 것으로 예상된다. 또한, 6G 통신 시스템을 통해 보안 및 신뢰성 향상을 위한 원격 수술, 산업 자동화, 비상 대응과 같은 서비스가 제공됨으로써, 이러한 기술이 산업, 의료, 자동차, 가전과 같은 다양한 분야에 적용될 수 있도록 한다."}
{"patent_id": "10-2022-7029130", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "다수의 TX 자원 풀(pool)들이 설정(configured)/사전 설정(preconfigured)되는 경우, LTE V2X 통신에서 RRC는 TX 자원 풀을 선택하고, 선택된 TX 자원 풀 정보를 MAC에 제공하므로, MAC은 지시된 TX 자원 풀 내에서 실제 자 원을 선택한다. 그러나, 이러한 TX 자원 풀 선택 메커니즘은 새롭게 설계된 NR V2X 통신에서 좋지 않은 것으로 보인다."}
{"patent_id": "10-2022-7029130", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에서, 무선 통신 시스템에서의 사용자 장치(user equipment; UE)는 자원 풀(pool)의 제1 세트 또는 자 원 풀의 제2 세트 중 적어도 하나를 포함하는 TX 자원 풀에 대한 설정 정보를 수신하도록 설정된 송수신부를 포 함한다. 상기 UR은 상기 송수신부에 동작 가능하게 연결된 프로세서를 더 포함하고, 상기 프로세서는 RRC(radio resource control) 서브 레이어(sub-layer)에서, HARQ (hybrid automatic repeat request) 피드백 채널에 기초 하여 상기 자원 풀의 제1 및 제2 세트를 식별하고; MAC (medium access control) 서브 레이어에서, SL 데이터 를 송신할 논리 채널 - 상기 논리 채널은 논리 채널 우선 순위화(logical channel prioritization; LCP) 기능 을 사용하여 다수의 논리 채널 중에서 가장 높은 우선 순위를 포함함 - 을 선택하고; 상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었는지를 판단하며; 상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었다는 판단에 기초하여 상기 자원 풀의 제1 세트로부터 TX 자원 풀을 선택하도록 구성되며, 상기 송수신부는 상기 TX 자원 풀에 기초하여 상기 SL 데이터를 전송하도록 더 구성된다. 다른 실시예에서, 무선 통신 시스템에서의 기지국(base station; BS)은 자원 풀의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 TX 자원 풀에 대한 설정 정보를 전송하고; 상기 자원 풀의 제1 세트로부터 결 정된 TX 자원 풀에 기초하여 SL 데이터를 수신하도록 구성된 송수신부를 포함하며, 여기서, 상기 SL 데이터는 다수의 논리 채널로부터 LCP 기능에 의해 결정된 가장 높은 우선 순위를 포함하는 논리 채널로 수신되고, 상기 논리 채널에는 상기 자원 풀의 제1 세트와 연관된 HARQ 피드백 채널이 설정된다. 또 다른 실시예에서, 무선 통신 시스템에서의 UE의 방법은 자원 풀의 제1 세트 또는 자원 풀의 제2 세트 중 적 어도 하나를 포함하는 TX 자원 풀에 대한 설정 정보를 수신하는 단계; RRC 서브 레이어에서, HARQ 피드백 채널 에 기초하여 자원 풀의 제1 및 제2 세트를 식별하는 단계; MAC 서브 레이어에서, SL 데이터를 송신할 논리 채널 - 상기 논리 채널은 LCP 기능을 사용하여 다수의 논리 채널 중에서 가장 높은 우선 순위를 포함함 - 을 선택하 는 단계; 상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었는지를 판단하는단계; 상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었다는 판단에 기초하여 상 기 자원 풀의 제1 세트로부터 TX 자원 풀을 선택하는 단계; 및 상기 TX 자원 풀에 기초하여 상기 SL 데이터를 전송하는 단계를 포함한다. 일 실시예에서, 무선 통신 시스템에서의 사용자 장치(user equipment; UE)의 방법이 제공된다. 상기 방법은 자 원 풀의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 송신(TX) 자원 풀에 대한 설정 정보를 수신하는 단계; RRC (radio resource control) 서브 레이어에서, HARQ (hybrid automatic repeat request) 피 드백 채널에 기초하여 상기 자원 풀의 제1 및 제2 세트를 식별하는 단계; MAC (medium access control) 서브 레 이어에서, SL (sidelink) 데이터를 송신할 논리 채널 - 상기 논리 채널은 논리 채널 우선 순위화(logical channel prioritization; LCP) 기능을 사용하여 다수의 논리 채널 중에서 가장 높은 우선 순위를 포함함 - 을 선택하는 단계; 상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었는지를 판단하 는 단계; 상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었다는 판단에 기초하여 상기 자원 풀의 제1 세트로부터 TX 자원 풀을 선택하는 단계; 및 상기 TX 자원 풀에 기초하여 상기 SL 데이터를 전송하는 단계를 포함한다. 일 실시예에서, 무선 통신 시스템에서의 사용자 장치(user equipment; UE)가 제공된다. 상기 UE는 송수신부; 및 상기 송수신부에 동작 가능하게 연결된 프로세서를 포함하며, 상기 프로세서는, 상기 송수신부를 통해, 자원 풀 의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 송신(TX) 자원 풀에 대한 설정 정보를 수신하 고, RRC (radio resource control) 서브 레이어에서, HARQ(hybrid automatic repeat request) 피드백 채널에 기초하여 상기 자원 풀의 제1 및 제2 세트를 식별하고, MAC (medium access control) 서브 레이어에서, SL (sidelink) 데이터를 송신할 논리 채널 - 상기 논리 채널은 논리 채널 우선 순위화(logical channel prioritization; LCP) 기능을 사용하여 다수의 논리 채널 중에서 가장 높은 우선 순위를 포함함 - 을 선택하고, 상기 MAC 서브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었는지를 판단하고, 상기 MAC 서 브 레이어에서, 상기 논리 채널에 상기 HARQ 피드백 채널이 설정되었다는 판단에 기초하여 상기 자원 풀의 제1 세트로부터 TX 자원 풀을 선택하며, 송수신부를 통해 상기 TX 자원 풀에 기초하여 상기 SL 데이터를 전송하도록 구성된다. 일 실시예에서, 무선 통신 시스템에서의 기지국의 방법이 제공된다. 상기 방법은 자원 풀의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 송신(TX) 자원 풀에 대한 설정 정보를 전송하는 단계; 및 상기 자원 풀의 제1 세트로부터 결정된 TX 자원 풀에 기초하여 SL (sidelink) 데이터를 수신하는 단계를 포함하며, 여기서, 상기 SL 데이터는 다수의 논리 채널로부터 논리 채널 우선 순위화(logical channel prioritization; LCP) 기능에 의해 결정된 가장 높은 우선 순위를 포함하는 논리 채널로 수신되고, 상기 논리 채널에는 상기 자 원 풀의 제1 세트와 연관된 HARQ (hybrid automatic repeat request) 피드백 채널이 설정된다. 일 실시예에서, 무선 통신 시스템에서의 기지국이 제공된다. 상기 기지국은 송수신부; 및 상기 송수신부에 동작 가능하게 연결된 프로세서를 포함하며, 상기 프로세서는, 상기 송수신부를 통해, 자원 풀의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 송신(TX) 자원 풀에 대한 설정 정보를 전송하며, 상기 송수신부를 통 해, 상기 자원 풀의 제1 세트로부터 결정된 TX 자원 풀에 기초하여 SL (sidelink) 데이터를 수신하도록 구성되 며, 여기서, 상기 SL 데이터는 다수의 논리 채널로부터 논리 채널 우선 순위화(logical channel prioritization; LCP) 기능에 의해 결정된 가장 높은 우선 순위를 포함하는 논리 채널로 수신되고, 상기 논리 채널에는 상기 자원 풀의 제1 세트와 연관된 HARQ (hybrid automatic repeat request) 피드백 채널이 설정된다. 다른 기술적 특징은 다음의 도면, 설명 및 청구항으로부터 통상의 기술자에게 용이하게 명백할 수 있다."}
{"patent_id": "10-2022-7029130", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에 관한 것으로서, 보다 상세하게, 본 개시는 V2X 통신에서의 SL TX 자원 풀 선택에 관한 것이다."}
{"patent_id": "10-2022-7029130", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래의 상세한 설명을 착수하기 전에, 본 특허 문서 전체에 걸쳐 사용된 특정 단어 및 문구를 정의하는 것이 유 리할 수 있다. \"결합(couple)\"이라는 용어 및 이의 파생어는 둘 이상의 요소가 서로 물리적으로 접촉하든 접촉 하지 않든 둘 이상의 요소 간의 어떤 직접 또는 간접 통신을 지칭한다. \"송신한다\", \"수신한다\" 및 \"통신한다\" 이라는 용어뿐만 아니라 이의 파생어는 직접 및 간접 통신 둘 다를 포함한다. \"포함한다(include)\" 및 \"구성한 다(comprise)\"이라는 용어뿐만 아니라 이의 파생어는 제한 없이 포함(inclusion)을 의미한다. \"또는\"이라는 용 어는 포괄적이며, 및/또는(and/or)을 의미한다. \"~와 관련된(associated with)\"이라는 용어뿐만 아니라 이의 파 생어는, \"~를 포함하고(include)\", \"~내에 포함되고(included within)\", \"~와 상호 연결하고(interconnect with)\", \"~을 함유하고(contain)\", \"~내에 함유되고(be contained within)\", \"~에 또는, ~와 연결하고(connect to or with)\", \"~에 또는, ~와 결합하고(couple to or with)\", \"~와 통신 가능하고(be communicable with)\", \"~와 협력하고(cooperate with)\", \"~를 인터리브하고(interleave)\", \"~와 병치하고(juxtapose)\", \"~에 가까이 있고(be proximate to)\", \"~에 또는, ~와 묶이고(be bound to or with)\", \"가지고(have)\", \"소유하고 있고 (have a property of)\", \"~에 또는, ~와 관계를 가지고(have a relationship to or with)\" 등인 것을 의미한다. \"제어부\"라는 용어는 적어도 하나의 동작을 제어하는 임의의 디바이스, 시스템 또는 이의 일부를 의 미한다. 상기 제어부는 하드웨어 또는 하드웨어 및 소프트웨어의 조합 및/또는 펌웨어로 구현될 수 있다. 임의 의 특정 제어부와 관련된 기능은 로컬로든 원격으로든 중앙 집중화되거나 분산될 수 있다. \"적어도 하나(at least one of)\"라는 문구는, 항목의 리스트와 함께 사용될 때, 나열된 항목 중 하나 이상의 상이한 조합이 사용 될 수 있고, 리스트 내에는 하나의 항목만이 필요할 수 있다는 것을 의미한다. 예를 들어, \"A, B 및 C 중 적어 도 하나\"는 다음의 조합: A, B, C, A 및 B, A 및 C, B 및 C, 및 A 및 B 및 C 중 어느 하나를 포함한다. 더욱이, 아래에서 설명되는 다양한 기능은 하나 이상의 컴퓨터 프로그램에 의해 구현되거나 지원될 수 있으며, 각각의 컴퓨터 프로그램은 컴퓨터 판독 가능 프로그램 코드(computer readable program code)로부터 형성되고, 컴퓨터 판독 가능 매체(computer readable medium)에서 구현된다. \"애플리케이션\" 및 \"프로그램\"이라는 용어는 적절한 컴퓨터 판독 가능 프로그램 코드에서 구현을 위해 적응된 하나 이상의 컴퓨터 프로그램, 소프트웨어 구 성 요소(software components), 명령어 세트(sets of instructions), 절차, 기능, 객체(object), 클래스, 인스 턴스(instance), 관련된 데이터 또는 이의 일부를 지칭한다. 문구 \"컴퓨터 판독 가능 프로그램 코드\"는 소스 코 드(source code), 객체 코드(object code) 및 실행 가능 코드(executable code)를 포함하는 임의의 타입의 컴 퓨터 코드를 포함한다. 문구 \"컴퓨터 판독 가능 매체\"는 판독 전용 메모리(read only memory; ROM), 랜덤 액세 스 메모리(random access memory; RAM), 하드 디스크 드라이브, 콤팩트 디스크(compact disc; CD), 디지털 비 디오 디스크(digital video disc; DVD), 또는 임의의 다른 타입의 메모리와 같이 컴퓨터에 의해 액세스될 수 있 는 임의의 타입의 매체를 포함한다. \"비일시적(non-transitory)\" 컴퓨터 판독 가능 매체는 일시적 전기적 또는 다른 신호를 송신하는 유선, 무선, 광학 또는 다른 통신 링크를 배제한다. 비일시적 컴퓨터 판독 가능 매체는 데이터가 영구적으로 저장될 수 있는 매체, 및 재기록 가능 광 디스크 또는 소거 가능 메모리 디바이스와 같이 데이터가 저장되고 나중에 중복 기록(overwriting)될 수 있는 매체를 포함한다. 다른 특정 단어 및 문구에 대한 정의는 본 특허 문서 전체에 걸쳐 제공된다. 통상의 기술자는 대부분의 경우는 아니지만 이러한 정의가 이러한 정의된 단어 및 문구의 이전 및 이후의 사용에 적용된다는 것을 이해해야 한다. 아래에서 논의되는 도 1 내지 도 8, 및 본 특허 문서에서 본 개시의 원리를 설명하기 위해 사용된 다양한 실시 예는 예시만을 위한 것이고, 어떤 식으로든 본 개시의 범위를 제한하는 것으로 해석되지 않아야 한다. 통상의 기술자는 본 개시의 원리가 적절히 배치된 임의의 시스템 또는 디바이스에서 구현될 수 있다는 것을 이해할 수 있다. 다음의 문서 및 표준 설명은 본 명세서에 충분히 설명된 바와 같이 본 개시에 참조로 통합된다: 3GPP TS 38.213 v15.7.0, \"NR; Physical Layer Procedures for Control\"; 3GPP TS 38.215 v.15.5.0: \"Physical layer measurements\"; and 3GPP TS 38.214 v15.7.0, \"NR; Physical Layer Procedures for Data\"; 3GPP TS 38.331 v.15.7.0, \"Radio Resource Control (RRC) protocol specification\"; and 3GPP TR 38.885 v.16.0.0: \"Study on NR Vehicle-to-Everything (V2X).\" 아래의 도 1 내지 도 3은 무선 통신 시스템에서 OFDM(orthogonal frequency division multiplexing) 또는 OFDMA(orthogonal frequency division multiple access) 통신 기술을 사용하여 구현되는 다양한 실시예를 설명 한다. 도 1 내지 도 3의 설명은 상이한 실시예가 구현될 수 있는 방식에 대한 물리적 또는 구조적 제한을 의미 하지 않는다. 본 개시의 상이한 실시예는 적절하게 배치된 임의의 통신 시스템에서 구현될 수 있다. 도 1은 본 개시에 따른 예시적인 무선 네트워크를 도시한다. 도 1에 도시된 무선 네트워크의 실시예는 예시만을 위한 것이다. 무선 네트워크의 다른 실시예는 본 개시의 범위를 벗어나지 않고 사용될 수 있다. 도 1에 도시된 바와 같이, 무선 네트워크는 gNB(예를 들어, 기지국(BS)), gNB 및 gNB를 포함한 다. gNB는 gNB 및 gNB와 통신한다. gNB는 또한 인터넷, 독점적 IP(Internet Protocol) 네 트워크 또는 다른 데이터 네트워크와 같은 적어도 하나의 네트워크와 통신한다. gNB는 gNB의 커버리지 영역 내의 제1 복수의 사용자 장치(UE)에 대한 네트워크에 무선 광 대역 액세스(wireless broadband access)를 제공한다. 제1 복수의 UE는 소기업(small business; SB)에 위치될 수 있는 UE; 기업(enterprise; E)에 위치될 수 있는 UE; WiFi 핫 스폿(hotspot; HS)에 위치될 수 있 는 UE; 제1 거주지(residence; R)에 위치될 수 있는 UE; 제2 거주지(R)에 위치될 수 있는 UE; 및 셀 폰(cell phone), 무선 랩톱(wireless laptop), 무선 PDA 등과 같은 모바일 디바이스(mobile device)(M) 일 수 있는 UE를 포함한다. gNB는 gNB의 커버리지 영역 내의 제2 복수의 UE에 대한 네트 워크에 무선 광대역 액세스를 제공한다. 제2 복수의 UE는 UE 및 UE를 포함한다. 일부 실시예에 서, gNB(101-103) 중 하나 이상은 서로 통신하고, 5G/NR, LTE, LTE-A, WiMAX, WiFi 또는 다른 무선 통신 기술 을 사용하여 UE(111-116)와 통신할 수 있다. 네트워크 타입에 따라, \"기지국\" 또는 \"BS\"라는 용어는 송신 포인트(transmit point, TP), 송수신 포인트 (transmit-receive point, TRP), 강화된 기지국(enhanced base station, eNodeB 또는 eNB), 5G 기지국(gNB), 매크로셀(macrocell), 펨토셀(femtocell), WiFi 액세스 포인트(access point, AP) 또는 다른 무선 가능한 디바 이스(wirelessly enabled device)와 같이 네트워크에 무선 액세스를 제공하도록 설정된 임의의 구성 요소(또는 구성 요소의 집합)를 지칭할 수 있다. 기지국은 하나 이상의 무선 통신 프로토콜(wireless communication protocol), 예를 들어, 5G/NR 3GPP(3rd generation partnership project) NR, LTE(long term evolution), LTE-A(LTE-advanced), 고속 패킷 액세스(high speed packet access, HSPA), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세스를 제공할 수 있다. 편의상, \"BS\" 및 \"TRP\"라는 용어는 본 특허 문서에서 원격 단말(remote terminal)에 무선 액세스를 제공하는 네트워크 인프라 구성 요소(network infrastructure component)를 나타내 는데 사용된다. 또한, 네트워크 타입에 따라, \"사용자 장치\" 또는 \"UE\"라는 용어는 \"이동국(mobile station)\", \"가입자국(subscriber station)\", \"원격 단말\", \"무선 단말\", \"수신 포인트(receive point)\"또는 \"사용자 디바 이스\"와 같은 임의의 구성 요소를 지칭할 수 있다. 편의상, \"사용자 장치\" 및 \"UE\"라는 용어는 본 특허 문서에 서 UE가(이동 전화 또는 스마트 폰과 같은) 모바일 디바이스이든 일반적으로(데스크톱 컴퓨터(desktop computer) 또는 자동 판매기(vending machine)와 같은) 고정 디바이스(stationary device)로 간주되든 BS에 무 선으로 액세스하는 원격 무선 장치를 지칭하는데 사용된다. 점선은 예시 및 설명만을 위해 거의 원형으로 도시되는 커버리지 영역(120 및 125)의 대략적인 범위를 보여준다. 커버리지 영역(120 및 125)과 같은 gNB와 관련된 커버리지 영역은 gNB의 설정 및 자연적 및 인공적 방해물(man-made obstruction)과 관련된 무선 환경의 변화에 따라 불규칙한 형상을 포함하는 다른 형상을 가질 수 있다는 것이 명확히 이해되어야 한다. 아래에서 더욱 상세하게 설명되는 바와 같이, UE(111-116) 중 하나 이상은 사이드링크 Tx 자원 풀 선택을 위한 회로, 프로그래밍, 또는 이의 조합을 포함한다. 특정 실시예에서, gNB(101-103) 중 하나 이상은 사이드링크 자 원 풀을 가능하게 하는 회로, 프로그래밍, 또는 이의 조합을 포함한다. 도 1은 무선 네트워크의 일례를 도시하지만, 도 1에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 무 선 네트워크는 임의의 수의 gNB 및 임의의 수의 UE를 임의의 적절한 배치에 포함시킬 수 있다. 또한, gNB는 임의의 수의 UE와 직접 통신할 수 있고, 네트워크에 대한 무선 광대역 액세스를 이러한 UE에제공할 수 있다. 유사하게, 각각의 gNB(102-103)는 네트워크와 직접 통신할 수 있고, 네트워크에 대한 직 접 무선 광대역 액세스를 UE에 제공할 수 있다. 또한, gNB(101, 102 및/또는 103)는 외부 전화 네트워크 또는 다른 타입의 데이터 네트워크와 같은 다른 또는 부가적인 외부 네트워크에 대한 액세스를 제공할 수 있다. 도 2는 본 개시의 실시예에 따른 예시적인 gNB를 도시한다. 도 2에 도시된 gNB의 실시예는 예시만을 위한 것이며, 도 1의 gNB(101 및 103)는 동일하거나 유사한 설정을 가질 수 있다. 그러나, gNB는 다양한 설정을 가지며, 도 2는 본 개시의 범위를 gNB의 임의의 특정 구현으로 제한하지 않는다. 도 2에 도시된 바와 같이, gNB는 다수의 안테나(205a-205n), 다수의 RF 송수신부(210a-210n), TX 처리 회 로 및 수신(receive, RX) 처리 회로를 포함한다. gNB는 또한 제어부/프로세서, 메모리 및 백홀 또는 네트워크 인터페이스를 포함한다. RF 송수신부(210a-210n)는 안테나(205a-205n)로부터, 네트워크에서 UE에 의해 송신된 신호와 같은 들어오 는(incoming) RF 신호를 수신한다. RF 송수신부(210a-210n)는 IF 또는 기저 대역 신호를 생성하도록 들어오는 RF 신호를 하향 변환시킨다. IF 또는 기저 대역 신호(baseband signal)는 기저 대역 또는 IF 신호를 필터링, 디 코딩 및/또는 디지털화함으로써 처리된 기저 대역 신호를 생성하는 RX 처리 회로로 송신된다. RX 처리 회 로는 처리된 기저 대역 신호를 추가의 처리를 위한 제어부/프로세서로 송신한다. TX 처리 회로는 제어부/프로세서로부터(음성 데이터(voice data), 웹 데이터, 이메일 또는 대화형 비 디오 게임 데이터(interactive video game data)와 같은) 아날로그 또는 디지털 데이터를 수신한다. TX 처리 회 로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는(outgoing) 기저 대역 데이터를 인코딩, 다중 화 및/또는 디지털화한다. RF 송수신부(210a-210n)는 TX 처리 회로로부터 나가는 처리된 기저 대역 또는 IF 신호를 수신하고, 기저 대역 또는 IF 신호를 안테나(205a-205n)를 통해 송신되는 RF 신호로 상향 변환한다. 제어부/프로세서는 gNB의 전체 동작을 제어하는 하나 이상의 프로세서 또는 다른 처리 디바이스를 포 함할 수 있다. 예를 들어, 제어부/프로세서는 잘 알려진 원리에 따라 RF 송수신부(210a-210n), RX 처리 회 로 및 TX 처리 회로에 의해 순방향 채널 신호(forward channel signal)의 수신 및 역방향 채널 신호 (reverse channel signal)의 송신을 제어할 수 있다. 제어부/프로세서는 더욱 진보된 무선 통신 기능과 같 은 부가적인 기능을 또한 지원할 수 있다. 예를 들어, 제어부/프로세서는 다수의 안테나(205a-205n)로부터의 나가는 신호가 원하는 방향으로 나가는 신호를 효과적으로 조종(steering)하도록 상이하게 가중되는 빔포밍 또는 방향성 라우팅 동작(directional routing operation)을 지원할 수 있다. 다양한 다른 기능 중 임의의 기능은 제어부/프로세서에 의해 gNB에서 지원될 수 있다. 제어부/프로세서는 또한 OS와 같은 메모리에 상주하는 프로그램 및 다른 프로세스를 실행할 수 있다. 제어부/프로세서는 실행 프로세스에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동시킬 수 있다. 제어부/프로세서는 또한 백홀 또는 네트워크 인터페이스에 결합된다. 백홀 또는 네트워크 인터페이스 는 gNB가 백홀 연결(backhaul connection) 또는 네트워크를 통해 다른 디바이스 또는 시스템과 통신 할 수 있게 한다. 인터페이스는 임의의 적절한 유선 또는 무선 연결을 통한 통신을 지원할 수 있다. 예를 들어, gNB가(5G, LTE 또는 LTE-A를 지원하는 것과 같은) 셀룰러 통신 시스템(cellular communication system)의 부분으로서 구현될 때, 인터페이스는 gNB가 유선 또는 무선 백홀 연결을 통해 다른 gNB와 통신할 수 있게 한다. gNB가 액세스 포인트로서 구현될 때, 인터페이스는 gNB가 유선 또는 무선 로컬 영역 네트워크(local area network) 또는 유선 또는 무선 연결을 통해(인터넷과 같은) 더 큰 네트워크로 통신할 수 있게 한다. 인터페이스는 이더넷(Ethernet) 또는 RF 송수신부와 같은 유선 또는 무선 연결을 통 한 통신을 지원하는 임의의 적절한 구조를 포함한다. 메모리는 제어부/프로세서에 결합된다. 메모리의 부분은 RAM을 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리(Flash memory) 또는 다른 ROM을 포함할 수 있다. 도 2는 gNB의 일례를 도시하지만, 도 2에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, gNB는 도 2에 도시된 임의의 수의 각각의 구성 요소를 포함할 수 있다. 특정 예로서, 액세스 포인트는 다수의 인터페 이스를 포함할 수 있고, 제어부/프로세서는 상이한 네트워크 어드레스(network address) 사이에서 데 이터를 라우팅하는 라우팅 기능(routing function)을 지원할 수 있다. 다른 특정 예로서, TX 처리 회로의 단일 인스턴스(instance) 및 RX 처리 회로의 단일 인스턴스를 포함하는 것으로 도시되어 있지만, gNB는(RF 송수신부 당 하나와 같은) 각각의 다수의 인스턴스를 포함할 수 있다. 또한, 도 2의 다양한 구성 요소 는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가될 수 있다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 3에 도시된 UE의 실시예는 예시만을 위 한 것이며, 도 1의 UE(111-115)는 동일하거나 유사한 설정을 가질 수 있다. 그러나, UE는 다양한 설정을 가지며, 도 3은 본 개시의 범위를 UE의 임의의 특정 구현으로 제한하지 않는다. 도 3에 도시된 바와 같이, UE는 안테나, 무선 주파수(radio frequency; RF) 송수신부, TX 처리 회로, 마이크로폰 및 수신(RX) 처리 회로를 포함한다. UE는 또한 스피커, 프로세서 , 입출력(input/output, I/O) 인터페이스(interface; IF), 터치스크린(touchscreen), 디스플레 이 및 메모리를 포함한다. 메모리는 운영 체제(operating system, OS) 및 하나 이상의 애 플리케이션을 포함한다. RF 송수신부는, 안테나로부터, 네트워크의 gNB에 의해 송신된 들어오는 RF 신호를 수신한다. RF 송수신부는 중간 주파수(intermediate frequency; IF) 또는 기저 대역 신호를 생성하기 위해 들어오는 RF 신호를 하향 변환한다. IF 또는 기저 대역 신호는 기저 대역 또는 IF 신호를 필터링, 디코딩 및/또는 디지털화 함으로써 처리된 기저 대역 신호를 생성하는 RX 처리 회로로 송신된다. RX 처리 회로는 처리된 기저 대역 신호를 (음성 데이터에 대해서와 같은) 스피커 또는 (웹 브라우징 데이터(web browsing data)에 대해 서와 같은) 추가의 처리를 위한 프로세서로 송신한다. TX 처리 회로는 마이크로폰으로부터 아날로그 또는 디지털 음성 데이터를 수신하거나 프로세서 로부터 (웹 데이터, 이메일 또는 대화형 비디오 게임 데이터와 같은) 다른 나가는 기저 대역 데이터를 수신한다. TX 처리 회로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는 기저 대역 데이터를 인 코딩, 다중화 및/또는 디지털화한다. RF 송수신부는 TX 처리 회로로부터 나가는 처리된 기저 대역 또 는 IF 신호를 수신하고, 기저 대역 또는 IF 신호를 안테나를 통해 송신되는 RF 신호로 상향 변환한다. 프로세서는 하나 이상의 프로세서 또는 다른 처리 디바이스를 포함할 수 있고, UE의 전체 동작을 제 어하기 위해 메모리에 저장된 OS를 실행할 수 있다. 예를 들어, 프로세서는 잘 알려진 원리에 따라 RF 송수신부, RX 처리 회로 및 TX 처리 회로에 의해 순방향 채널 신호의 수신 및 역방향 채널 신호의 송신을 제어할 수 있다. 일부 실시예에서, 프로세서는 적어도 하나의 마이크로 프로세서 또는 마이크로 제어부를 포함한다. 프로세서는 또한 빔 관리를 위한 프로세스와 같이 메모리에 상주하는 다른 프로세스 및 프로그램을 실행할 수 있다. 프로세서는 실행 프로세스(executing process)에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동시킬 수 있다. 일부 실시예에서, 프로세서는 OS에 기초하거나 gNB 또는 오퍼레 이터로부터 수신된 신호에 응답하여 애플리케이션을 실행하도록 설정된다. 프로세서는 또한 랩톱 컴 퓨터 및 핸드헬드 컴퓨터(handheld computer)와 같은 다른 디바이스에 연결하는 능력을 UE에 제공하는 I/O 인터페이스에 결합된다. I/O 인터페이스는 이러한 액세서리(accessory)와 프로세서 사이의 통신 경로(communication path)이다. 프로세서는 또한 터치스크린 및 디스플레이에 결합된다. UE의 오퍼레이터는 터치스크린 을 이용하여 데이터를 UE에 입력할 수 있다. 디스플레이는 액정 디스플레이(liquid crystal display), 발광 다이오드 디스플레이(light emitting diode display), 또는 웹 사이트(web site)로부터와 같이 텍스트 및/또는 적어도 제한된 그래픽을 렌더링(rendering)할 수 있는 다른 디스플레이일 수 있다. 메모리는 프로세서에 결합된다. 메모리의 일부는 랜덤 액세스 메모리(random access memory; RAM)를 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리 또는 다른 판독 전용 메모리(read-only memory; ROM)를 포함할 수 있다. 도 3은 UE의 일례를 도시하지만, 도 3에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 3의 다양한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가될 수 있다. 특정 예로서, 프로세서는 하나 이상의 중앙 처리 유닛(central processing unit; CPU) 및 하나 이상의 그래픽 처리 유닛(graphics processing unit; GPU)과 같은 다수의 프로세서로 분할될 수 있다. 또한, 도 3은 이동 전화 또는 스마트 폰으로서 설정된 UE를 도시하지만, UE는 다른 타입의 이동 또는 고정 디바이스 로서 동작하도록 설정될 수 있다. 4G 통신 시스템의 상용화 이후 증가한 무선 데이터 트래픽에 대한 수요를 충족하고, 다양한 수직적 애플리케이 션(vertical application)을 가능하게 하기 위해, 5G/NR 통신 시스템이 개발되어 현재 배치되고 있다. 5G/NR 통신 시스템은 더 높은 데이터 송신률을 달성하기 위해 더 높은 주파수(mmWave) 대역, 예를 들어, 28GHz 또는 60GHz 대역에서 구현되거나 강력한 커버리지 및 이동성 지원을 가능하게 하기 위해 6GHz와 같은 더 낮은 주파수 대역에서 구현되는 것으로 간주된다. 무선파의 전파 손실을 감소시키고 송신 거리를 증가시키기 위해, 5G/NR 통 신 시스템에서는 빔포밍, 거대한 MIMO(multiple-input multiple-output), FD-MIMO(full dimensional MIMO), 어 레이 안테나, 아날로그 빔포밍 및 대규모 안테나 기술이 논의되고 있다. 또한, 5G/NR 통신 시스템에서는 진보된 소형 셀, 클라우드 무선 액세스 네트워크(RAN), 초고밀도 네트워크, 기 기 간(D2D) 통신, 무선 백홀, 이동 네트워크, 협력 통신, CoMP(coordinated multi-point), 수신 단 간섭 제거 등을 기반으로 하여 시스템 네트워크 개선을 위한 개발이 이루어지고 있다. 5G 시스템 및 이와 연관된 주파수 대역에 대한 논의는 본 개시의 특정 실시예가 5G 시스템에서 구현될 수 있음 에 따라 참조를 위한 것이다. 그러나, 본 개시는 5G 시스템 또는 이와 연관된 주파수 대역에 한정되지 않으며, 본 개시의 실시예는 임의의 주파수 대역과 관련하여 활용될 수 있다. 예를 들어, 본 개시의 양태는 또한 테라헤 르츠(THz) 대역을 사용할 수 있는 5G 통신 시스템, 6G 또는 그 이후 릴리스(release)의 배치에 적용될 수 있다. 통신 시스템은 기지국 또는 하나 이상의 송신 지점으로부터 UE로의 송신을 나타내는 다운링크(DL) 및 UE로부터 기지국 또는 하나 이상의 수신 지점으로의 송신을 나타내는 업링크(UL)를 포함한다. 셀 상에서 DL 시그널링 또는 UL 시그널링을 위한 시간 유닛은 슬롯이라고 하며, 하나 이상의 심볼을 포함할 수 있다. 심볼은 또한 부가적인 시간 유닛의 역할을 할 수 있다. 주파수(또는 대역폭(BW)) 유닛은 자원 블록(RB)이 라고 한다. 하나의 RB는 다수의 부반송파(SC)를 포함한다. 예를 들어, 슬롯은 0.5 밀리초 또는 1 밀리초의 지속 시간을 가질 수 있고, 14개의 심볼을 포함할 수 있으며, RB는 15KHz 또는 30KHz 등의 SC 간 간격을 갖는 12개의 SC를 포함할 수 있다. DL 신호는 정보 콘텐츠를 전달하는 데이터 신호, DL 제어 정보(DL control information; DCI)를 전달하는 제어 신호 및 파일럿 신호(pilot signal)라고도 알려진 기준 신호(reference signal; RS)를 포함한다. gNB는 각각의 물리적 DL 공유 채널(physical DL shared channel; PDSCH) 또는 물리적 DL 제어 채널(physical DL control channel; PDCCH)을 통해 데이터 정보 또는 DCI를 송신한다. PDSCH 또는 PDCCH는 하나의 슬롯 심볼을 포함하는 다양한 슬롯 심볼의 수를 통해 송신될 수 있다. 간결성을 위해, UE가 PDSCH 수신을 스케줄링하는 DCI 포맷은 DL DCI 포맷이라 하고, UE로부터 물리적 업링크 공유 채널(PUSCH) 송신을 스케줄링하는 DCI 포맷은 UL DCI 포맷이 라 한다. gNB는 채널 상태 정보 RS(channel state information RS; CSI-RS) 및 복조 RS(demodulation RS; DMRS)를 포함 하는 여러 타입의 RS 중 하나 이상을 송신한다. CSI-RS는 주로 UE가 측정을 수행하고 CSI를 gNB에 제공하기 위 한 것이다. 채널 측정을 위해, 비제로 전력 CSI-RS(non-zero power CSI-RS; NZP CSI-RS) 자원이 사용된다. 간 섭 측정 보고(interference measurement report; IMR)의 경우, 제로 전력 CSI-RS(zero power CSI-RS; ZP CSI- RS) 설정과 연관된 CSI 간섭 측정(CSI interference measurement; CSI-IM) 자원이 사용된다. CSI 프로세스는 NZP CSI-RS 및 CSI-IM 자원으로 설정된다. UE는 gNB로부터 DL 제어 시그널링 또는 RRC 시그널링과 같은 상위 계층 시그널링을 통해 CSI-RS 송신 파라미터 를 결정할 수 있다. CSI-RS의 송신 인스턴스(transmission instance)는 DL 제어 시그널링에 의해 지시될 수 있 거나 상위 계층 시그널링에 의해 설정될 수 있다. DMRS는 각각의 PDCCH 또는 PDSCH의 BW에서만 송신되며, UE는 DMRS를 사용하여 데이터 또는 제어 정보를 복조할 수 있다. 도 4 및 도 5는 본 개시에 따른 예시적인 무선 송수신 경로를 도시한다. 다음의 설명에서, 송신 경로는 gNB(예컨대, gNB)에서 구현되는 것으로서 설명될 수 있지만, 수신 경로는 UE(예컨대, UE)에서 구현되는 것으로서 설명될 수 있다. 그러나, 수신 경로는 gNB에서 구현될 수 있고, 송신 경로는 UE에 서 구현될 수 있다는 것이 이해될 수 있다. 일부 실시예에서, 수신 경로는 본 개시의 실시예에서 설명된 바와 같이 사이드링크 Tx 자원 풀 선택을 지원하도록 설정된다. 도 4에 도시된 바와 같이, 송신 경로는 채널 코딩 및 변조 블록(channel coding and modulation block), 직렬 대 병렬(serial-to-parallel; S-to-P) 블록, 크기 N 역 고속 푸리에 변환(inverse fast Fourier transform; IFFT) 블록, 병렬 대 직렬(parallel-to-serial; P-to-S) 블록, 사이클릭 프리픽스 부가 블록(add cyclic prefix block) 및 상향 변환기(up-converter; UC)를 포함한다. 도 5 에 도시된 바와 같이, 수신 경로는 하향 변환기(down-converter; DC), 사이클릭 프리픽스 제거 블록(remove cyclic prefix block), 직렬 대 병렬(S-to-P) 블록, 크기 N 고속 푸리에 변환(FFT) 블록 , 병렬 대 직렬(P-to-S) 블록, 및 채널 디코딩 및 복조 블록(channel decoding and demodulation block)을 포함한다. 도 4에 도시된 바와 같이, 채널 코딩 및 변조 블록은 정보 비트(information bit)의 세트를 수신하고, 코 딩(예컨대, LDPC(low-density parity check) 코딩)을 적용하며, 일련의 주파수 도메인 변조 심볼(frequency- domain modulation symbol)을 생성하기 위해 입력 비트(예컨대, QPSK(quadrature phase shift keying) 또는 QAM(quadrature amplitude modulation))를 변조시킨다. 직렬 대 병렬 블록은 N이 gNB 및 UE에서 사용되는 IFFT/FFT 크기인 N개의 병렬 심볼 스트림 (parallel symbol stream)을 생성하기 위해 직렬 변조된 심볼(serial modulated symbol)을 병렬 데이터 (parallel data)로 변환한다(예컨대, 역다중화한다(de-multiplex)). 크기 N IFFT 블록은 시간-도메인 출 력 신호(time-domain output signal)를 생성하기 위해 N개의 병렬 심볼 스트림 상에서 IFFT 연산을 수행한다. 병렬 대 직렬 블록은 직렬 시간-도메인 신호(serial time-domain signal)를 생성하기 위해 크기 N IFFT 블록으로부터의 병렬 시간-도메인 출력 심볼(parallel time-domain output symbol)을 변환한다(예컨대, 다중화한다). 사이클릭 프리픽스 부가(add cyclic prefix) 블록은 사이클릭 프리픽스(cyclic prefix)를 시간-도메인 신호에 삽입한다. 상향 변환기는 무선 채널을 통한 송신을 위해 '이클릭 프리픽스 부가 블록 의 출력을 RF 주파수로 변조시킨다(예를 들어, 상향 변환시킨다). 신호는 또한 RF 주파수로 변환하기 전에 기저 대역에서 필터링될 수 있다. gNB로부터 송신된 RF 신호는 무선 채널을 통과한 후에 UE에 도달하고, gNB에서의 동작과의 역 동작(reverse operation)은 UE에서 수행된다. 도 5에 도시된 바와 같이, 하향 변환기는 수신된 신호를 기저 대역 주파수로 하향 변환시키고, 사이클릭 프리픽스 제거(remove cyclic prefix)' 블록은 직렬 시간-도메인 기저 대역 신호를 생성하기 위해 사이클 릭 프리픽스를 제거한다. 직렬 대 병렬 블록은 시간-도메인 기저 대역 신호를 병렬 시간-도메인 신호로 변 환한다. 크기 N FFT 블록은 N개의 병렬 주파수 도메인 신호를 생성하기 위해 FFT 알고리즘을 수행한다. 병 렬 대 직렬 블록은 병렬 주파수 도메인 신호를 일련의 변조된 데이터 심볼로 변환한다. 채널 디코딩 및 복 조 블록은 원래의 입력 데이터 스트림을 복원하기 위해 변조된 심볼을 복조하고 디코딩한다. gNB(101-103)의 각각은 도 4에 도시되어 있는 바와 같이 다운링크에서 UE(111-116)로 송신하는 것과 유사한 송 신 경로를 구현할 수 있고, 도 5에 도시되어 있는 바와 같이, 업링크에서 UE(111-116)로부터 수신하는 것 과 유사한 수신 경로를 구현할 수 있다. 마찬가지로, UE(111-116)의 각각은 업링크에서 gNB(101-103)로 송 신하기 위한 송신 경로를 구현할 수 있고, 다운링크에서 gNB(101-103)로부터 수신하기 위한 수신 경로 를 구현할 수 있다. 도 4 및 도 5에서의 각각의 구성 요소는 하드웨어만을 사용하거나 하드웨어와 소프트웨어/펌웨어의 조합을 사용 하여 구현될 수 있다. 특정 예로서, 도 4 및 도 5에서의 구성 요소 중 적어도 일부는 소프트웨어로 구현될 수 있지만, 다른 구성 요소는 설정 가능한 하드웨어 또는 소프트웨어 및 설정 가능한 하드웨어의 혼합에 의해 구현 될 수 있다. 예를 들어, FFT 블록 및 IFFT 블록은 설정 가능한 소프트웨어 알고리즘으로서 구현될 수 있으며, 여기서 크기 N의 값은 구현에 따라 수정될 수 있다. 또한, FFT 및 IFFT를 사용하는 것으로서 설명되었지만, 이는 예시일 뿐이며, 본 개시의 범위를 제한하는 것으로 해석될 수 없다. 이산 푸리에 변환(discrete Fourier transform, DFT) 및 역이산 푸리에 변환(inverse discrete Fourier transform, IDFT) 함수와 같은 다른 타입의 변환이 사용될 수 있다. DFT 및 IDFT 함수에 대 해 N 변수의 값은 임의의 정수(예컨대, 1, 4, 3, 4 등)일 수 있지만, FFT 및 IFFT 함수에 대해서는 N 변수의 값 은 2의 거듭 제곱인 임의의 정수(즉, 1, 2, 4, 8, 16 등)일 수 있다는 것이 이해될 수 있다. 도 4 및 도 5는 무선 송수신 경로의 예를 도시하지만, 도 4 및 도 5에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 4 및 도 5에서의 다양한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필 요에 따라 부가적인 구성 요소가 부가될 수 있다. 또한, 도 4 및 도 5는 무선 네트워크에서 사용될 수 있는 타 입의 송수신 경로의 예를 도시하기 위한 것이다. 무선 네트워크에서 무선 통신을 지원하기 위해 다른 적절한 아 키텍처가 사용될 수 있다. 3GPP 무선 통신 표준에서, NR은 5G 무선 통신으로서 논의되고 있다. NR 특징 중 하나는 V2X이다. 도 6은 차량 대 차량 통신의 예시적인 시나리오를 설명한다. 두 대 이상의 차량은 차량 간의 직접 링크/인터페이스를 통해데이터/제어를 송수신할 수 있다. 차량 간 또는 차량과 다른 사물 간의 직접 링크/인터페이스는 3GPP에서 SL이 라고 한다. 도 6은 차량이 SL 자원, SL 무선 베어러 설정 등을 획득하기 위해 여전히 gNB와 통신할 수 있는 시 나리오를 설명하지만, gNB와의 상호 작용 없이도 차량이 여전히 SL을 통해 서로 통신할 수 있다는 것을 주목한 다. 이 경우, SL 자원 및 SL 무선 베어러 설정 등은 (예를 들어, V2X 서버 또는 임의의 다른 코어 네트워크 엔 티티를 통해) 사전 설정(preconfigured)된다. 도 6은 본 개시의 실시예에 따른 사이드링크를 통한 예시적인 V2X 통신을 도시한다. 도 6에 도시된 사이드 링크를 통한 V2X 통신의 일 실시예는 예시만을 위한 것이다. UE로부터 gNB로의 링크인 업링크(uplink; UL)와 비교한 차이점 중 하나는 송신을 위한 자원 할당이다. UL에서, 송신을 위한 자원은 gNB에 의한 L1 제어 채널에 의해 지시되므로 UE는 지시된 자원을 통해 데이터/제어만을 송 신한다. SL에서, UE 자체는 설정된 다수의 자원 풀 중에서 SL TX 자원 풀을 선택한 다음, UE의 채널 센싱 결과 및 데이터/제어 송신에 필요한 자원의 수를 기반으로 선택된 SL TX 자원 풀 내에서 송신을 위한 실제 SL 자원을 선택한다. 자원 풀은 SL 송수신에 사용될 수 있는 시간-주파수 자원의 세트이다. UE 관점에서, 자원 풀은 UE의 대역폭 내 에서 SL 대역폭 부분(BWP) 내에 위치되고 단일 뉴머롤로지(numerology)를 갖는다. 자원 풀에서의 시간 도메인 자원은 인접하지 않을 수 있다. 다수의 자원 풀은 캐리어(carrier) 내의 UE에 (사전)설정될 수 있다. TX 자원 풀은 UE의 SL 송신을 위한 자원이고, RX 자원 풀은 UE의 SL 수신을 위한 자원이다. 다수의 TX 자원 풀은 (gNB의 커버리지에서 V2X 통신에 관심이 있는 UE에 대한) gNB에 의해 설정되거나 (gNB의 커버리지에서 V2X 통신에 관심 이 있는 UE에 대해) 사전에 코어 네트워크 제어/데이터 기능 엔티티에 의해 사전 설정될 수 있다. 다수의 TX 자 원 풀이 설정/사전 설정되는 경우, UE는 먼저 다수의 TX 자원 풀 중에서 하나의 TX 자원 풀을 선택할 필요가 있 다. 다수의 TX 자원 풀은 시스템 정보 블록(system information block; SIB)을 통해 설정될 수 있으며, 이는 gNB에 의해 셀에서 브로드캐스트되거나 사전 설정된다. SL 통신의 경우, 무선 인터페이스 계층 2/계층 3(layer 2/layer 3; L2/L3) 프로토콜은 MAC, 무선 링크 제어 (radio link control; RLC), 패킷 데이터 변환 프로토콜(packet data convergence protocol; PDCP), RRC 및 서 비스 데이터 적응 프로토콜(service data adaptation protocol; SDAP)을 포함한다. MAC 프로토콜 계층은 계층 2 패킷 필터링(예를 들어, 적어도 브로드캐스트에 대해, 전체 식별자가 L1 제어 정보에서 사용되지 않는 것으로 결론이 난 경우), SL 캐리어/자원 (재)선택, HARQ 피드백이 없는 SL HARQ 송신 및 SL 프로세스, SL 특정 논리 채널 우선 순위화, SL 스케줄링 요청, SL 버퍼 상태 보고 및 UL/SL TX 우선 순위화를 수행한다. RRC 프로토콜 계층은 네트워크(예를 들어, gNB 또는 코어 네트워크 제어/데이터 기능)로부터 자원 풀 설정, SL 무선 베어러 설정 등의 수신 및 UE 간의 UE 능력 및 SL 무선 베어러 설정의 교환을 수행한다. 다수의 TX 자원 풀이 설정/사전 설정되는 경우, LTE V2X 통신에서 RRC는 TX 자원 풀을 선택하고, 선택된 TX 자 원 풀 정보를 MAC에 제공하므로, MAC은 지시된 TX 자원 풀 내에서 실제 자원을 선택한다. 그러나, 이러한 TX 자 원 풀 선택 메커니즘은 새롭게 설계된 NR V2X 통신에서 좋지 않은 것으로 보인다. 일 실시예에서, MAC은 다중화 및 어셈블리 기능에서 LCP의 결과에 기초하여 TX 자원 풀 선택을 동적으로 수행하 기 위해 제공된다. RRC가 설정/사전 설정된 다수의 TX 자원 풀을 수신하는 경우, RRC는 이를 HARQ 확인 응답 (HARQ acknowledgement; HARQ-ACK) 또는 HARQ 부정 확인 응답(HARQ negative acknowledgement; HARQ-NACK) 정 보와 같은 HARQ 피드백을 위한 자원을 포함하는 TX 자원 풀과 HARQ 피드백 정보를 위한 자원을 포함하지 않는 TX 자원 풀로 분류하며, RRC는 분류된 TX 자원 풀 정보를 MAC에 제공한다. MAC이 RRC로부터 이러한 정보를 수신하면, MAC은 어떤 SL 논리 채널이 가장 높은 우선 순위로 송신 버퍼에서 송 신될 패킷(데이터/제어)을 갖는지를 판단하며, 이는 후보 SL 논리 채널이 나중에 선택될 자원에서 먼저 제공된 다는 것을 의미한다. 결과적으로, 가장 높은 우선 순위로 송신될 패킷을 갖는 SL 논리 채널에 HARQ 피드백이 설 정/사전 설정되었으면, MAC은 HARQ 피드백 정보를 위한 자원을 포함하는 TX 자원 풀로부터 하나를 선택한다. 그 렇지 않고 가장 높은 우선 순위로 송신될 패킷을 갖는 SL 논리 채널에 HARQ 피드백이 설정/사전 설정되지 않았 으면, MAC은 HARQ 피드백 정보를 위한 자원을 포함하지 않는 TX 자원 풀로부터 하나를 선택한다. 송신 버퍼에서 송신될 패킷과 동일한 우선 순위를 가진 다수의 SL 논리 채널이 있는 경우, MAC은 다수의 후보 SL 논리 채널로부터 하나를 무작위로 결정할 수 있다. MAC은 가장 높은 우선 순위를 가진 버퍼에서 송신될 패킷 을 가진 SL 논리 채널이 변경될 때마다 이러한 TX 자원 풀 선택을 수행할 필요가 있으므로, 이러한 TX 자원 풀 선택은 자원이 이용 가능할 때 MAC 프로토콜 데이터 유닛(protocol data unit; PDU)에서 먼저 제공될 후보 논리채널로서 동적 방식으로 수행된다. 다른 실시예에서, RRC가 설정/사전 설정된 TX 자원 풀을 HARQ 피드백 정보를 위한 자원을 포함하는 TX 자원 풀 과 HARQ 피드백 정보를 위한 자원을 포함하지 않는 TX 자원 풀로 분류하면, RRC는 HARQ 피드백 정보를 위한 자 원을 포함하는 TX 자원 풀로부터 하나를 선택하고 HARQ 피드백 정보를 위한 자원을 포함하지 않는 TX 자원 풀로 부터 하나를 선택하기 위해 제공된다. 그런 다음, RRC는 선택된 TX 자원 풀(HARQ 피드백 채널 자원이 있는 풀 및/또는 HARQ 피드백 채널 자원이 없는 풀) 정보만을 MAC에 정보를 제공하고, MAC은 먼저 제공될 후보 논리 채널의 결정에 기초하여 둘 중 하나를 선택 한다(결정 기준은 실시예의 제1 예와 동일함). 실시예의 두 예에서, RRC가 HARQ 피드백 정보를 위한 자원을 포 함하는 TX 자원 풀 또는 HARQ 피드백 정보를 위한 자원을 포함하지 않는 TX 자원 풀 중 하나만을 MAC에 제공하 는 경우, MAC은 자원이 이용 가능할 때 먼저 제공될 후보 논리 채널을 볼 필요가 없고, 대신에 MAC은 단순히 RRC로부터 지시된 TX 자원 풀 중 하나를 선택한다. 일 예에서, RRC는 설정/사전 설정된 TX 자원 풀로부터 하나 를 선택하고, 선택된 TX 자원 풀이 HARQ 피드백 채널 자원을 포함하는지 여부를 MAC에 나타내는 인디케이션 (indication)을 선택된 TX 자원 풀에 제공하며, MAC은 지시된 TX 자원 풀 내에서 자원을 선택한다. 도 7은 상술 한 예 및 실시예에 대한 UE 동작을 예시한다. 도 7은 본 개시의 실시예에 따른 TX 자원 풀 선택을 위한 UE의 방법의 흐름도를 도시한다. 도 7에 도시된 방법의 실시예는 단지 예시를 위한 것이다. 도 7에 도시된 하나 이상의 구성 요소는 언급된 기능을 수행하 도록 설정된 전문 회로(specialized circuitry)로 구현될 수 있거나, 하나 이상의 구성 요소는 언급된 기능을 수행하기 위한 명령어를 실행하는 하나 이상의 프로세서에 의해 구현될 수 있다. 도 7에 도시된 바와 같이, RRC는 단계 701에서 SIB, 사전 설정(pre-configuration) 또는 UE 전용 RRC 메시지 중 하나에 의해 TX 자원 풀(pool)들 및 SL 무선 베어러 설정(SL 논리 채널 설정들을 포함함)을 수신한다. 일 예 에서, UE 전용 RRC 메시지는 RRC 연결 재설정(reconfiguration) 메시지이다. 그 후, 단계 711에서 RRC는 설정/ 사전 설정된 TX 자원 풀을 HARQ 피드백 채널 자원을 포함하는 TX 자원 풀과 HARQ 피드백 채널 자원을 포함하지 않는 TX 자원 풀로 분류하고 TX 자원을 MAC에 지시한다. 송신 버퍼에서 송신될 SL 데이터/제어가 있는 경우, MAC은 단계 721 및 731에서 가장 높은 우선 순위로 송신될 데이터/제어 데이터를 가진 논리 채널을 선택하며, 이는 자원이 이용 가능할 때 다수의 논리 채널 중에서 먼저 제공될 후보 논리 채널이다. 송신 버퍼에서 송신될 SL 데이터/제어 데이터가 없는 경우, MAC이 단계 721에서 체 크를 계속하거나 또는 RRC가 TX 자원 풀들 및/또는 SL 무선 베어러 설정들이 예를 들어 SIB 업데이트 또는 서빙 셀 변경 등으로부터의 새로운 SIB 획득으로 인해 변경될 때, 단계 701부터의 절차를 수행할 수 있다(예를 들어, 단계 721 및 725). 단계 731에서 먼저 제공될 후보 논리 채널이 선택되면, MAC은 단계 741에서 단계 731에서 선택된 논리 채널에 HARQ 피드백이 설정/사전 설정되었는지를 체크한다. 단계 741에서는, 단계 701에서 제공된 상응하는 SL 무선 베 어러 설정 및/또는 상응하는 논리 채널 설정에 기초하여 체킹될 수 있다. 선택된 논리 채널에 HARQ 피드백이 설 정/사전 설정되었으면, MAC은 단계 711에서 RRC에 의해 제공된 HARQ 피드백 채널 자원을 포함하는 TX 자원 풀들 로부터 하나의 TX 자원 풀을 선택한다 (예: 단계 751). HARQ 피드백 채널 자원을 포함하는 다수의 TX 자원 풀들이 RRC에 의해 제공되는 경우, MAC은 TX 자원 풀들로부 터 하나를 무작위로 선택한다. 선택된 논리 채널에 HARQ 피드백이 설정/사전 설정되지 않은 경우, MAC은 단계 711에서 RRC에 의해 제공되는 HARQ 피드백 채널 자원을 포함하지 않는 TX 자원 풀들로부터 하나의 TX 자원 풀을 선택한다. HARQ 피드백 채널 자원을 포함하지 않는 다수의 TX 자원 풀들이 RRC에 의해 제공되는 경우, MAC은 다 수의 TX 자원 풀들로부터 하나를 무작위로 선택한다 (예; 단계 761). 도 8은 본 개시의 실시예에 따라 V2X 통신에서 사이드링크 측정을 위한 방법의 흐름도를 도시한다. 도 8에 도시된 방법의 실시예는 단지 예시를 위한 것이다. 도 8에 도시된 하나 이상의 구성 요소는 언급된 기능을 수행하도록 설정된 전문 회로에서 구현될 수 있거나, 하나 이상의 구성 요소는 언급된 기능을 수행하기 위한 명 령어를 실행하는 하나 이상의 프로세서에 의해 구현될 수 있다. 방법은 UE(예를 들어, 도 1에 도시된 바와 같은 111)에 의해 수행될 수 있다. 도 8에 도시된 바와 같이, 방법은 단계 802에서 시작한다. 단계 802에서, UE는 자원 풀의 제1 세트 또는 자원 풀의 제2 세트 중 적어도 하나를 포함하는 TX 자원 풀에 대한 설정 정보를 수신한다. 일 실시예에서, 자원 풀의 제1 세트는 HARQ 피드백 채널을 위한 자원을 포함하고, 자원 풀의 제2 세트는 HARQ 피드백 채널을 위한 자원을 포함하지 않는다. 단계 804에서, UE는 RRC 서브 레이어에서, HARQ 피드백 채널에 기초하여 자원 풀의 제1 및 제2 세트를 식별한다. 단계 806에서, UE는 MAC 서브 레이어에서, SL 데이터를 송신할 논리 채널을 선택하고, 논리 채널은 LCP 기능을 사용하여 다수의 논리 채널 중에서 가장 높은 우선 순위를 포함한다. 단계 808에서, UE는 MAC 서브 레이어에서, 논리 채널에 HARQ 피드백 채널이 설정되었는지를 판단한다. 단계 810에서, UE는 MAC 서브 레이어에서, 논리 채널에 HARQ 피드백 채널이 설정되었다는 판단에 기초하여 자원 풀의 제1 세트로부터 TX 자원 풀을 선택한다. 일 실시예에서, TX 자원 풀은 시스템 정보 블록(system information block; SIB)에 의해 설정되고; TX 자원 풀 은 UE 전용 RRC 메시지를 포함하는 상위 계층 신호에 의해 설정되거나; TX 자원 풀은 사전 설정된 정보로부터 설정된다. 단계 812에서, UE는 TX 자원 풀에 기초하여 SL 데이터를 송신한다. 일 실시예에서, UE는 SL 논리 채널 설정 정보를 포함하는 SL 베어러 설정 정보를 수신한다. 일 실시예에서, UE는 MAC 서브 레이어에서, SL 데이터의 송신 순서를 결정하기 위한 우선 순위를 할당하는 LCP 기능에 기초하여 논리 채널을 선택한다. 일 실시예에서, UE는 MAC 서브 레이어에서, 논리 채널에 HARQ 피드백 채널이 설정되지 않았다는 판단에 기초하 여 자원 풀의 제2 세트로부터 TX 자원 풀을 선택한다. 일 실시예에서, UE는 UE의 RRC 서브 레이어를 활성화하고, RRC 서브 레이어에서, TX 자원 풀을 자원 풀의 제1 세트 및 자원 풀의 제2 세트로 분류하며, UE의 RRC 서브 레이어로부터 MAC 서브 레이어로, 자원 풀의 제1 세트 가 HARQ 피드백 채널을 위한 자원을 포함하고, 자원 풀의 제2 세트가 HARQ 피드백 채널을 위한 자원을 포함하지 않는다는 것을 지시한다. 일 실시예에서, UE는 UE의 MAC 서브 레이어를 활성화하고; MAC 서브 레이어에서, SL 데이터를 송신할 논리 채널 을 선택하고; MAC 서브 레이어에서, 논리 채널에 HARQ 피드백이 설정되었는지를 판단하며; MAC 서브 레이어에서 자원 풀의 제1 세트로부터 TX 자원 풀을 선택한다. 상술한 흐름도는 본 개시의 원리에 따라 구현될 수 있는 예시적인 방법을 도시하며, 본 명세서에서의 흐름도에 도시된 방법에 대해 다양한 변경이 이루어질 수 있다. 예를 들어, 일련의 단계로서 도시되었지만, 각각의 도면 의 다양한 단계는 중첩하거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 본 개시가 예시적인 실시예로 설명되었지만, 다양한 변경 및 수정이 통상의 기술자에게 제시될 수 있다. 본 개 시는 첨부된 청구항의 범주 내에 속하는 이러한 변경 및 수정을 포함하는 것으로 의도된다. 본 출원에서의 설명 은 임의의 특정 요소, 단계 또는 기능이 청구 범위에 포함되어야 하는 필수 요소임을 암시하는 것으로 해석되지 않아야 한다. 특허된 주제(patented subject matter)의 범위는 청구항에 의해 정의된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2022-7029130", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시 및 그 이점에 대한 더욱 완전한 이해를 위해, 동일한 도면 부호가 동일한 부분을 나타내는 첨부된 도면 과 관련하여 취해진 다음의 설명에 대한 참조가 이제 이루어진다. 도 1은 본 개시의 실시예에 따른 예시적인 무선 네트워크를 도시한다.도 2는 본 개시의 실시예에 따른 예시적인 gNB를 도시한다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 4 및 5는 본 개시에 따른 예시적인 무선 송수신 경로를 도시한다. 도 6은 본 개시의 실시예에 따른 사이드링크를 통한 예시적인 V2X 통신을 도시한다. 도 7은 본 개시의 실시예에 따른 TX 자원 풀 선택을 위한 UE의 방법의 흐름도를 도시한다. 도 8은 본 개시의 실시예에 따른 사이드링크 TX 자원 풀 선택을 위한 방법의 흐름도를 도시한다."}
