{"patent_id": "10-2022-0069213", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0064529", "출원번호": "10-2022-0069213", "발명의 명칭": "구독 정보 생성 방법 및 이를 위한 장치", "출원인": "최준혁", "발명자": "최준혁"}}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "구독 정보를 생성하는 방법에 있어서, 장치에 의해 수행되는 상기 방법은:외부 시스템으로부터 수신한 소스 데이터로부터 하나 이상의 아이템 각각에 대한 시계열 데이터인 하나 이상의기본 데이터를 생성하는 단계;상기 하나 이상의 기본 데이터로부터 하나 이상의 파라미터를 적용하여 상기 하나 이상의 아이템을 생성하되,상기 하나 이상의 아이템 각각은 복수의 항목과 상기 복수의 항목 각각에 대응되는 값을 가지는 구조인 단계; 하나 이상의 자식 아이템 및/또는 소정의 값을 소정의 연산자를 이용해 조합하여 부모 아이템을 생성하는 과정을 한 번 이상 수행함으로써 최종 아이템을 생성하는 단계; 및상기 최종 아이템을 기반으로 구독 정보를 생성하는 단계를 포함하고, 상기 자식 아이템으로서 조합으로 인하여 생성된 하나 이상의 부모 아이템과 상기 하나 이상의 아이템이 이용가능한, 방법."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 소정의 시간 간격으로 상기 소스 데이터를 상기 외부 시스템에게 요청함으로써, 상기 소스 데이터가 상기 외부시스템으로부터 수신되는, 방법."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 소스 데이터의 요청의 시간 간격과 상기 기본 데이터의 생성의 시간 간격이 상이한, 방법."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 아이템이 생성될 때마다 상기 소스 데이터를 상기 외부 시스템에게 요청함으로써, 상기 소스 데이터가 상기 외부 시스템으로부터 수신되는, 방법."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 하나 이상의 파라미터는 지정 파라미터와 공통 파라미터를 포함하고, 상기 지정 파라미터는 특정 아이템에만 적용되는 파라미터이며, 상기 공통 파라미터는 아이템과 무관하게 공통으로 적용되는 파라미터인, 방법."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 공통 파라미터는 조건 파라미터와 하나 이상의 범위 지정 파라미터를 포함하고, 상기 조건 파라미터에 따라 상기 하나 이상의 범위 지정 파라미터가 결정되는, 방법."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 조합의 대상이 되는 하나 이상의 자식 아이템의 투자 자산 별 값의 형식에 따라, 상기 조합을 위해 이용공개특허 10-2023-0064529-3-가능한 연산자가 결정되는, 방법."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 구독 정보가 투자 전략에 해당할 때, 상기 항목은 투자 자산에 해당하고,상기 최종 아이템을 구성하는 제1 자식 아이템과 제2 자식 아이템 모두 각 투자 자산 별 값의 형식이 참/거짓일때, 상기 제1 자식 아이템은 상기 투자 전략의 매수 조건으로 설정되고 및 제2 자식 아이템은 상기 투자 전략의매도 조건으로 설정되는, 방법."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "구독 정보를 생성하는 장치에 있어서, 상기 장치는:유/무선 신호를 송수신하기 위한 하나 이상의 송수신부(transceiver); 및상기 하나 이상의 송수신부를 제어하는 하나 이상의 제어부를 포함하고, 상기 하나 이상의 제어부는:외부 시스템으로부터 수신한 소스 데이터로부터 하나 이상의 아이템 각각에 대한 시계열 데이터인 하나 이상의기본 데이터를 생성하고, 상기 하나 이상의 기본 데이터로부터 하나 이상의 파라미터를 적용하여 상기 하나 이상의 아이템을 생성하되,상기 하나 이상의 아이템 각각은 복수의 항목과 상기 복수의 항목 각각에 대응되는 값을 가지는 구조이고, 하나 이상의 자식 아이템 및/또는 소정의 값을 소정의 연산자를 이용해 조합하여 부모 아이템을 생성하는 과정을 한 번 이상 수행함으로써 최종 아이템을 생성하고, 상기 최종 아이템을 기반으로 구독 정보를 생성하도록 설정되고,상기 자식 아이템으로서 조합으로 인하여 생성된 하나 이상의 부모 아이템과 상기 하나 이상의 아이템이 이용가능한, 장치."}
{"patent_id": "10-2022-0069213", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하나 이상의 명령을 저장하는 하나 이상의 비-일시적(non-transitory) 컴퓨터 판독가능 매체에 있어서,하나 이상의 제어부에 의해서 실행되는 상기 하나 이상의 명령은, 구독 정보를 생성하는 장치가: 외부 시스템으로부터 수신한 소스 데이터로부터 하나 이상의 아이템 각각에 대한 시계열 데이터인 하나 이상의기본 데이터를 생성하고, 상기 하나 이상의 기본 데이터로부터 하나 이상의 파라미터를 적용하여 상기 하나 이상의 아이템을 생성하되,상기 하나 이상의 아이템 각각은 복수의 항목과 상기 복수의 항목 각각에 대응되는 값을 가지는 구조이고, 하나 이상의 자식 아이템 및/또는 소정의 값을 소정의 연산자를 이용해 조합하여 부모 아이템을 생성하는 과정을 한 번 이상 수행함으로써 최종 아이템을 생성하고, 상기 최종 아이템을 기반으로 구독 정보를 생성하도록 제어하고, 상기 자식 아이템으로서 조합으로 인하여 생성된 하나 이상의 부모 아이템과 상기 하나 이상의 아이템이 이용가능한, 컴퓨터 판독가능 매체."}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "구독 정보 생성 방법 및 이를 위한 장치가 개시된다. 본 개시의 일 실시예에 따른 구독 정보를 생성하는 방법은, 외부 시스템으로부터 수신한 소스 데이터로부터 하나 이상의 아이템 각각에 대한 시계열 데이터인 하나 이상의 기본 데이터를 생성하는 단계; 상기 하나 이상의 기본 데이터로부터 하나 이상의 파라미터를 적용함으로써 상기 하나 이상의 아이템을 생성하되, 상기 하나 이상의 아이템 각각은 복수의 항목과 상기 복수의 항목 각각에 대응 되는 값을 가지는 단계; 하나 이상의 자식 아이템 및/또는 소정의 값을 소정의 연산자를 이용해 조합하여 부모 아이템을 생성하는 과정을 한 번 이상 수행함으로써 최종 아이템을 생성하는 단계; 및 상기 최종 아이템을 기반 으로 구독 정보를 생성하는 단계를 포함하고, 상기 자식 아이템으로서 조합으로 인하여 생성된 하나 이상의 부모 아이템과 상기 하나 이상의 아이템이 이용 가능할 수 있다."}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 구독 정보 생성 방법에 관한 것으로서, 보다 상세하게 구독 서비스 제공을 위하여 구독 정보를 생성 하는 방법 및 이를 위한 장치에 관한 것이다."}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "구독 서비스는 사용자가 일정한 금액을 내고 정기적으로 제품이나 서비스를 받는 것을 통칭한다. 특히, 콘텐츠(content)를 제공하는 구독 서비스는 음원, 동영상, 전자책, 스트리밍 게임 등의 전통적인 콘텐츠 뿐만 아니라 특정 주제와 관련된 뉴스, 금융 정보, 비즈니스 트렌드, 의료 및 헬스케어 관련 정보 등의 새로운 콘텐츠 장르로 확장되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1967696호, 2019년 04월 04일 등록 (명칭: 구독서비스 제공 방법 및 장치)"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "소비자의 니즈(needs)를 만족시키기 위해 콘텐츠(content) 구독 서비스 사업자는 양질의 콘텐츠를 제공해야 하 나, 서비스 사업자가 계속하여 소비자가 원하는 양질의 콘텐츠를 생산하기에는 어려움이 있다. 이에 따라, 본 개시에서는 다양한 사용자가 직접 정보를 생산하는 주체로서 자신의 관심사에 따른 구독 정보를 손쉽게 다른 사 용자들과 공유하기 위한 방법을 제안한다. 본 개시의 기술적 과제는 구독 서비스 제공을 위하여 구독 정보를 생성하는 방법 및 장치를 제공하는 것이다. 또한, 본 개시의 추가적인 기술적 과제는 다양한 정보를 계층적으로 조합함으로써 구독 정보를 생성하는 방법 및 장치를 제공하는 것이다. 본 개시에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 양상에 따른 구독 정보를 생성하는 방법에 있어서, 장치에 의해 수행되는 상기 방법은: 외부 시스 템으로부터 수신한 소스 데이터로부터 하나 이상의 아이템 각각에 대한 시계열 데이터인 하나 이상의 기본 데이 터를 생성하는 단계; 상기 하나 이상의 기본 데이터로부터 하나 이상의 파라미터를 적용함으로써 상기 하나 이 상의 아이템을 생성하되, 상기 하나 이상의 아이템 각각은 복수의 항목과 상기 복수의 항목 각각에 대응되는 값 을 가지는 구조인 단계; 하나 이상의 자식 아이템 및/또는 소정의 값을 소정의 연산자를 이용해 조합하여 부모 아이템을 생성하는 과정을 한 번 이상 수행함으로써 최종 아이템을 생성하는 단계; 및 상기 최종 아이템을 기반 으로 구독 정보를 생성하는 단계를 포함하고, 상기 자식 아이템으로서 조합으로 인하여 생성된 하나 이상의 부 모 아이템과 상기 하나 이상의 아이템이 이용 가능할 수 있다. 본 개시의 다른 일 양상에 따른 구독 정보를 생성하는 장치에 있어서, 상기 장치는: 유/무선 신호를 송수신하기 위한 하나 이상의 송수신부(transceiver); 및 상기 하나 이상의 송수신부를 제어하는 하나 이상의 제어부를 포 함하고, 상기 하나 이상의 제어부는: 외부 시스템으로부터 수신한 소스 데이터로부터 하나 이상의 아이템 각각 에 대한 시계열 데이터인 하나 이상의 기본 데이터를 생성하고, 상기 하나 이상의 기본 데이터로부터 하나 이상 의 파라미터를 적용함으로써 상기 하나 이상의 아이템을 생성하되, 상기 하나 이상의 아이템 각각은 복수의 항 목과 상기 복수의 항목 각각에 대응되는 값을 가지는 구조이고, 하나 이상의 자식 아이템 및/또는 소정의 값을 소정의 연산자를 이용해 조합하여 부모 아이템을 생성하는 과정을 한 번 이상 수행함으로써 최종 아이템을 생성 하고, 상기 최종 아이템을 기반으로 구독 정보를 생성하도록 설정되고, 상기 자식 아이템으로서 조합으로 인하 여 생성된 하나 이상의 부모 아이템과 상기 하나 이상의 아이템이 이용 가능할 수 있다. 본 개시의 다른 일 양상에 따른 하나 이상의 명령을 저장하는 하나 이상의 비-일시적(non-transitory) 컴퓨터 판독가능 매체에 있어서, 하나 이상의 제어부에 의해서 실행되는 상기 하나 이상의 명령은, 구독 정보를 생성하 는 장치가: 외부 시스템으로부터 수신한 소스 데이터로부터 하나 이상의 아이템 각각에 대한 시계열 데이터인하나 이상의 기본 데이터를 생성하고, 상기 하나 이상의 기본 데이터로부터 하나 이상의 파라미터를 적용함으로 써 상기 하나 이상의 아이템을 생성하되, 상기 하나 이상의 아이템 각각은 복수의 항목과 상기 복수의 항목 각 각에 대응되는 값을 가지는 구조이고, 하나 이상의 자식 아이템 및/또는 소정의 값을 소정의 연산자를 이용해 조합하여 부모 아이템을 생성하는 과정을 한 번 이상 수행함으로써 최종 아이템을 생성하고, 상기 최종 아이템 을 기반으로 구독 정보를 생성하도록 제어하고, 상기 자식 아이템으로서 조합으로 인하여 생성된 하나 이상의 부모 아이템과 상기 하나 이상의 아이템이 이용 가능할 수 있다."}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예에 따르면, 구독 서비스 제공을 위해 다양한 정보를 트리(tree) 구조로 계층적으로 조합함으로 써 유연하게 구독 정보를 생성할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 개시의 예시적인 실시형태를 설명하고자 하는 것이며, 본 개시가 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 이하의 상세한 설명은 본 개시의 완전한 이해를 제공하기 위해서 구체적 세부사항을 포함한다. 그러나, 당업자는 본 개시가 이러한 구체적 세부사항 없이도 실시될 수 있 음을 안다. 몇몇 경우, 본 개시의 개념이 모호해지는 것을 피하기 위하여 공지의 구조 및 장치는 생략되거나, 각 구조 및 장치의 핵심기능을 중심으로 한 블록도 형식으로 도시될 수 있다. 본 개시에 있어서, 어떤 구성요소가 다른 구성요소와 \"연결\", \"결합\" 또는 \"접속\"되어 있다고 할 때, 이는 직접 적인 연결관계 뿐만 아니라, 그 사이에 또 다른 구성요소가 존재하는 간접적인 연결관계도 포함할 수 있다. 또 한 본 개시에서 용어 \"포함한다\" 또는 \"가진다\"는 언급된 특징, 단계, 동작, 요소 및/또는 구성요소의 존재를 특정하지만, 하나 이상의 다른 특징, 단계, 동작, 요소, 구성요소 및/또는 이들의 그룹의 존재 또는 추가를 배 제하지 않는다. 본 개시에 있어서, \"제 1\", \"제 2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용되고 구성요소들을 제한하기 위해서 사용되지 않으며, 특별히 언급되지 않는 한 구성요소들 간의 순서 또는 중요도 등을 한정하지 않는다. 따라서, 본 개시의 범위 내에서 일 실시예에서의 제 1 구성요소는 다른 실시예에서 제 2 구성요소라고 칭할 수도 있고, 마찬가지로 일 실시예에서의 제 2 구성요소를 다른 실시예에서 제 1 구 성요소라고 칭할 수도 있다. 본 개시에서 사용된 용어는 특정 실시예에 대한 설명을 위한 것이며 청구범위를 제한하려는 것이 아니다. 실시 예의 설명 및 첨부된 청구범위에서 사용되는 바와 같이, 단수 형태는 문맥상 명백하게 다르게 나타내지 않는 한 복수 형태도 포함하도록 의도한 것이다. 본 개시에 사용된 용어 \"및/또는\"은 관련된 열거 항목 중의 하나를 지 칭할 수도 있고, 또는 그 중의 둘 이상의 임의의 및 모든 가능한 조합을 지칭하고 포함하는 것을 의미한다. 또 한, 본 개시에서 단어들 사이의 \"/\"는 달리 설명되지 않는 한 \"및/또는\"과 동일한 의미를 가진다. 본 개시에서 제안하는 방법 및 장치는 구독 서비스를 위한 다양한 주제와 관련된 구독 정보를 생성하기 위해 적 용될 수 있다. 특히, 구독 정보가 투자 전략에 해당하는 경우(즉, 투자 전략을 구독 서비스로 제공하는 경우), 해당 투자 전략은 국내외 주식(stock), 선물(futures)/옵션(options), 금, 은 등의 원자재, 디지털 자산 등의 거래가 가능한 시장(market)에서 적용될 수 있다. 여기서, 국내외 주식, 선물, 옵션, 원자재, 암호화폐 등의 예 시는 설명의 편의를 위한 것이며, 온라인 상에서 매수/매도가 가능한 어떠한 자산/종목/상품 등의 거래에도 본 개시의 제안이 적용될 수 있으며, 이를 본 개시에서는 위와 같은 투자 자산(investment asset)으로 통칭한다. 그리고, 투자 자산이 거래되는 시장을 자산 시장(asset market)으로 지칭한다. 이하, 본 발명의 설명에 있어서, 구독 정보의 일례로서 투자 전략을 주로 설명하지만 이는 하나의 예시에 해당 하며 본 발명의 제안 방법이 이에 제한되지 않는다. 도 1은 본 발명의 일 실시예에 따른 구독 정보 생성 장치가 적용될 수 있는 시스템을 예시하는 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 구독 정보 생성 장치는 구독 정보를 생성하고, 구독을 신청 한 하나 이상의 사용자 장치들에게 일정한 시간 간격으로 구독 정보를 주기적으로 전송할 수 있다. 구독 정보 생성 장치는 하나 이상의 송수신부(들), 하나 이상의 메모리(들), 하나 이상의 제어부(들)(13 0)을 포함하여 구성될 수 있다. 제어부는 하나 이상의 데이터 수집부(들), 아이템 생성부(들)을 포함하여 구성될 수 있다. 구독 정보 생성 장치를 구성하는 하나 이상의 송수신부(들), 하나 이상의 메모리(들), 하나 이 상의 제어부(들)은 본 발명에 따른 기능을 수행하기 위하여 상호 기능적으로 연결될 수 있다. 제어부(들)은 데이터 수집부(들)과 아이템 생성부(들)를 포함하여 구성될 수 있다. 데이터 수집부(들)은 외부 시스템으로부터 수집/획득/수신한 소스 데이터(source data)를 기반으로 기본 데이터(base data)를 생성할 수 있다. 데이터 수집부(들)은 미리 정해진 시간 간격(즉, 스케줄된 시 간 간격)으로 외부 시스템에 소스 데이터를 요청하고, 외부 시스템으로부터 요청한 소스 데이터를 수 신할 수 있다. 그리고, 수신한 소스 데이터를 기반으로 기본 데이터를 생성하고, 생성한 기본 데이터를 메모리 (들)에 저장할 수 있다. 또는, 데이터 수집부(들)은 아이템 생성부(들)로부터 기본 데이터의 생성을 요청받으면, 실시간으로 외부 시스템에게 소스 데이터를 요청하고, 외부 시스템으로부터 요청한 소스 데이터를 수신할 수 있 다. 그리고, 수신한 소스 데이터를 기반으로 기본 데이터를 생성하고, 생성한 기본 데이터를 아이템 생성부 (들)에게 제공할 수 있다. 데이터 수집부(들)이 소스 데이터(source data)를 기반으로 기본 데이터(base data)를 생성하는 보다 구체 적인 과정에 대해서는 후술한다. 아이템 생성부(들)은 사용자 장치로부터 선택된 아이템에 대한 정보를 수신하면, 메모리(들)로 부터 해당 아이템에 연관되는 기본 데이터를 획득하거나 또는 데이터 수집부(들)에게 해당 아이템에 연관 되는 기본 데이터를 요청하여 데이터 수집부(들)로부터 기본 데이터를 수신할 수 있다. 그리고, 아이템 생 성부(들)은 사용자 장치로부터 선택된 하나 이상의 지정/공통 파라미터에 대한 정보를 수신하면, 획 득/수신한 기본 데이터에 기반하여 해당 하나 이상의 지정/공통 파라미터를 이용하여 아이템을 생성할 수 있다. 또한, 아이템 생성부(들)은 사용자 장치로부터 선택된 아이템에 대한 정보, 특정 상수 또는 날짜에 대한 정보, 연산자의 선택 정보를 수신하면, 이를 기반으로 아이템을 연산함으로써 새로운 아이템을 생성할 수 있다. 또한, 아이템 생성부(들)은 사용자 장치로부터 선택된 두 개 이상의 아이템에 대한 정보, 연산 자의 선택 정보를 수신하면, 이를 기반으로 두 개 이상의 아이템을 연산(조합)함으로써 새로운 아이템을 생성할 수 있다. 아이템 생성부(들)이 기본 데이터를 기반으로 아이템을 생성하는 보다 구체적인 과정에 대해서는 후술한다. 제어부(들)은 메모리들 및/또는 송수신부(들)을 제어하며, 본 개시에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 구현하도록 구성될 수 있다. 예를 들어, 제어부(들)은 메모리들 내의 정보를 처리하여 정보/신호를 생성한 뒤, 송수신부(들)을 통해 정보/신호를 사용자 장치에게 전 송할 수 있다. 또한, 제어부(들)은 송수신부(들)을 통해 제2 정보/신호를 수신한 뒤, 제2 정보/신호 로부터 획득한 정보/데이터를 메모리(들)에 저장할 수 있다. 제어부(들)은 중앙 처리 장치(CPU: Central Processing Unit), 프로세서(processor) 등의 하드웨어, 펌웨 어, 소프트웨어, 또는 이들의 조합에 의해 구현될 수 있다. 본 개시에 개시된 설명, 기능, 절차, 제안, 방법 및 /또는 동작 순서도들은 펌웨어 또는 소프트웨어를 사용하여 구현될 수 있고, 펌웨어 또는 소프트웨어는 모듈, 절차, 기능 등을 포함하도록 구현될 수 있다. 본 개시에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순 서도들은 수행하도록 설정된 펌웨어 또는 소프트웨어는 제어부(들)에 포함되거나, 메모리(들)에 저장 되어 제어부(들)에 의해 구동될 수 있다. 본 개시에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들은 코드, 명령어 및/또는 명령어의 집합 형태로 펌웨어 또는 소프트웨어를 사용하여 구현될 수 있다. 메모리(들)은 외부 시스템으로부터 수신한 소스 데이터로부터 변환한(가공한) 기본 데이터, 기본 데이터로 부터 생성한 아이템, 각종 파라미터, 연산자 등에 대한 정보를 저장할 수 있다. 메모리(들)은 제어부(들)와 연결될 수 있고, 제어부(들)의 동작과 관련한 다양한 형태의 데이터, 정보, 신호, 메시지, 정보, 프로그램, 코드, 지시 및/또는 명령을 저장할 수 있다. 예를 들어, 메모리 (들)은 제어부(들)에 의해 제어되는 프로세스들 중 일부 또는 전부를 수행하거나, 본 개시에 개시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도들을 수행하기 위한 명령들을 포함하는 소프트웨어 코드를 저장할 수 있다. 메모리(들)은 ROM, RAM, EPROM, 플래시 메모리, 하드 드라이브, 레지스터, 캐쉬 메모리, 컴퓨터 판독 저장 매체 및/또는 이들의 조합으로 구성될 수 있다. 메모리(들)은 제어부(들)의 내부 및/또는 외부에 위 치할 수 있다. 또한, 메모리(들)은 유선 또는 무선 연결과 같은 다양한 기술을 통해 제어부(들)과 연 결될 수 있다. 또한, 메모리(들)은 구독 정보 생성 장치, 특히 제어부(들)와 연결된 상태로 별 도의 장치로 구현될 수도 있다. 송수신부(들)은 하나 이상의 다른 장치에게 본 개시의 방법들 및/또는 동작 순서도 등에서 언급되는 사용 자 데이터, 정보, 신호 등을 전송할 수 있다. 송수신부(들)은 하나 이상의 다른 장치로부터 본 개시에 개 시된 설명, 기능, 절차, 제안, 방법 및/또는 동작 순서도 등에서 언급되는 사용자 데이터, 정보, 신호 등을 수 신할 수 있다. 예를 들어, 송수신부(들)은 제어부(들)과 연결될 수 있고, 신호를 송수신할 수 있다. 예를 들어, 제어부(들)은 송수신부(들)이 하나 이상의 다른 장치에게 사용자 데이터, 정보, 신호 등 을 전송하도록 제어할 수 있다. 또한, 제어부(들)은 송수신부(들)이 하나 이상의 다른 장치로부터 사 용자 데이터, 정보, 신호 등을 수신하도록 제어할 수 있다. 사용자 장치는 구독 정보 생성 장치에 의해 아이템을 생성하기 위한 유저 인터페이스(UI: user interface)(이하, 이를 아이디어 보드(idea board)라 지칭함)를 제공한다. 사용자 장치는 아이디어 보드 상에서 사용자로부터 아이템 생성에 필요한 각종 정보를 선택/입력 받고(예를 들어, 아이템 선택, 파라미터 선 택, 특정 상수/날짜 값 등 입력), 생성된 아이템을 표시할 수 있다. 외부 시스템은 구독 정보 생성 장치가 아이템을 생성하기 위하여 이용 가능한 각종 소스/원천 (source) 데이터(또는 로우 데이터(raw data) 등)(이하, 소스 데이터라고 지칭함)를 제공하는 시스템을 통칭한 다. 예를 들어, 소스 데이터는 구독 정보를 생성하기 위해 이용 가느앟ㄴ 다양한 주제와 관련된 데이터를 의미 한다. 예를 들어, 자산 시장에서 사용되는 각종 지표, 비즈니스 영역에서 사용되는 각종 데이터, 각종 포털 (portal) 사이트, 소셜 네트워크 서비스(SNS: social network service) 등에서 제공하는 데이터를 포함할 수 있으며, 이에 한정되지 않고 구독 정보를 생성하기 위해 이용 가능한 모든 데이터가 이에 해당될 수 있다. 이하, 본 발명의 설명에 있어서, 기본 데이터는 외부 시스템으로부터 획득한 소스 데이터를 가공한 데이터 이며, 특정 아이템에 대한 시계열 데이터를 의미할 수 있다. 여기서, 시계열 데이터의 시간 간격은 시간, 일, 주, 월, 분기, 년 등일 수 있다. 하나의 기본 데이터는 하나 이상의 아이템과 연관될 수 있다. 또한, 이하 본 발명의 설명에 있어서, 아이템(item)은 하나 이상의 항목(예를 들어, 투자 자산) 별로 하나의 값 을 가지는 구조를 가진다. 설명의 편의를 위해 본 개시에서 이를 아이템(item)이라 지칭하지만, 이에 본 개시가 한정되는 것은 아니며 리스트(list), 테이블(table) 등 다양한 명칭으로 지칭될 수도 있다. 즉, 시계열 데이터 인 기본 데이터에서 공통 파라미터 및/또는 지정 파라미터를 이용하여 기본 데이터의 범위/조건 등을 특정함으 로써 아이템이 생성될 수 있다. 여기서, 공통 파라미터는 아이템의 종류와 무관하게 전체의 아이템에 공통적으로 적용 가능하거나 또는 하나 이 상의 아이템에 공통적으로 적용 가능한 파라미터를 의미한다. 그리고, 지정 파라미터는 특정 아이템에만 적용 가능한 파라미터를 의미한다. 또한, 이하 본 발명의 설명에 있어서, 특히 구독 정보가 투자 전략에 해당하는 경우, 아이디어(idea)는 하나 이 상의 아이템의 연산(또는 계산, 조합)을 통해 생성된 아이템의 각 항목(즉, 투자 자산)의 값이 참(true)/거짓 (false)인 아이템으로서, 매수 또는 매도의 역할(또는 조건)으로 설정된 아이템을 지칭한다. 따라서, 아이디어 에 의해 실제 하나 이상의 종목의 매수 결정 또는 매도 결정이 도출될 수 있다. 또한, 2개 이상의 아이디어가 연산(또는 조합)됨으로써 매수 결정과 매도 결정이 도출될 수 있으며, 이를 투자 전략(investment strategy)(또는 매매 전략(trading strategy))으로 지칭할 수 있다. 즉, 투자 전략을 구성하 는 특정 아이템(즉, 아이디어)은 투자 전략의 매수 조건으로 이용되고, 다른 아이템(즉, 아이디어)은 투자 전략 의 매도 조건으로 이용될 수 있다. 아이템 개요 아이템(item)은 구독 정보를 생성하기 위한 기본 단위(즉, 아이디어를 구성하는 기본 단위)를 의미한다. 둘 이상의 아이템(item) 간에 연산자를 이용하여 연산(또는 조합)됨으로써 새로운 아이템이 생성될 수 있다. 또 는, 하나 이상의 아이템과 소정의 상수/날짜 등과 연산자를 이용하여 연산(또는 조합)됨으로써 새로운 아이템이 생성될 수도 있다. 이와 같은 과정으로 생성된 아이템은 또 다른 아이템 또는 소정의 상수/날짜 등과 조합(또는 연계)하여 또 다른 새로운 아이템이 생성될 수 있으며, 이러한 과정은 반복적으로 수행될 수 있다. 즉, 위와 같 은 과정을 통해 아이템은 후술하는 제약사항을 만족하면서 계속하여 새로운 아이템이 생성될 수 있다. 아이템은 데이터 분석 시 또는 아이템 간 조합(또는 연산)할 때 도메인(domain)(또는 특성(feature), 차원 (dimension))(예를 들어, 한국 주식시장, 미국 주식시장, 선물/옵션 시장, 디지털 자산 시장 등)에서 주어지는 항목(예를 들어, 주식시장에서의 종목) 별로 개별적인 값이 사용된다. 다만, 아이템이 아이디어를 구성하는 경우(즉, 하나 이상의 아이템이 조합되어 아이디어가 생성된 경우), 데이 터를 추출하는 방법, 아이디어 내에서 사용되는 역할, 데이터를 반환하는 방법 등만이 저장되고, 실제 해당 아 이디어의 실행 등으로 인하여 해당 아이템이 사용되는 시점에서 실제 데이터가 추출되고, 계산하여 반환된다. 아이템의 반환 데이터 구조 하나의 아이템은 항목 별(예를 들어, 주식시장에서의 종목) 별로 하나의 값을 가지는(즉, 사용자 장치의 요청에 의해 항목 별로 하나의 값을 반환하는) 구조를 가지고 있다. 표 1은 본 개시의 일 실시예에 따른 아이템을 예시한다. 표 1에서는 항목이 '종목코드'이며, 항목 별 값이 '종가'인 아이템을 예시하지만, 이는 설명의 편의를 위한 것 이며 본 개시의 기술적 특징을 한정하는 것이 아니다. 표 1 종목코드 종가 000070 74500 000080 21800 000100 246500 000120 157000 000150 95300 000210 120000 000240 17450 000270 41550 000640 99800000660 63500 모든 아이템은 연산, 파라미터 등을 기반으로 연산 등을 거쳐 최종적으로 표 1과 같은 형식/구조를 가질 수 있 다. 따라서, 모든 아이템의 최종 형식/구조가 동일하게 생성됨으로써, 하나 이상의 아이템들 간에 반복적으로 조합(또는 연산)될 수 있다. 아이템은 항목 별로 상이한 값을 가질 수도 있으며, 항목과 무관하게 모두 동일한 값을 가질 수 있다. 먼저, 아이템은 항목 별로 독립된(또는 상이한) 값을 가질 수 있으며, 이러한 아이템을 항목 종속적인 아이템 (dependent item)이라고 지칭할 수 있다. 또한, 이러한 아이템은 다중(multi) 반환 값을 가진다고 지칭할 수 있 다. 예를 들어, 앞서 표 1을 참조하면, 표 1의 예시된 '종가' 아이템은 각각의 항목(즉, 주식 종목) 별로 상이 한 값(즉, 종가)를 가지는 주식 도메인의 아이템으로서, 항목 종속적인 아이템을 예시한다. 반면, 아이템은 항목과 무관하게 모두 일정한 값을 가질 수 있으며, 이러한 아이템을 항목 독립적인 아이템 (independent item)이라고 지칭할 수 있다. 예를 들어, 주식 도메인에서 '코스피200 변동성 지수' 아이템은 항 목(즉, 주식 종목)과는 무관하게 모두 동일한 값(즉, 코스피200 변동성 지수 값)을 가진다. 표 2는 본 개시의 일 실시예에 따른 아이템을 예시한다. 표 2에서는 항목이 '종목코드'이며, 항목 별 값이 '코스피200 변동성 지수'인 아이템을 예시하지만, 이는 설명 의 편의를 위한 것이며 본 개시의 기술적 특징을 한정하는 것이 아니다. 표 2 종목코드 코스피200 변동성 지수 000070 14.89 000080 14.89 000100 14.89 000120 14.89 000150 14.89 000210 14.89 000240 14.89 000270 14.89 000640 14.89 000660 14.89 표 2를 참조하면, 항목 독립적인 아이템은 항목 종속적인 아이템과 동일한 형식을 가지지만, 모든 항목(즉, 종 목)이 동일한 값을 가진다. 이 경우, 메모리(들)의 저장 용량의 손실을 줄이기 위해 내부적으로는 아래와 같이 저장 또는 반환될 수 있다. 표 3은 본 개시의 일 실시예에 따른 항목 독립적인 아이템의 저장 또는 반환 형식을 예시한다. 표 3 종목코드 코스피200 변동성 지수 000000 14.89 표 3을 참조하면, 모든 종목코드에 대한 단일의 종목코드(예를 들어, 000000)에 대한 반환 값을 단일의 반환 값 이라고 지칭할 수 있다. 다만, 표 3과 같이 단일의 종목 코드에 대한 반환 값으로 아이템이 저장 또는 반환되더 라도, 다른 소정의 상수/날짜 등의 값 또는 다른 아이템과의 연산(또는 조합)하는 경우, 표 3의 단일의 반환 값 을 다중의 반환 값으로 변환 후 계산(연산)될 수 있다. 즉, 표 3의 형식에서 표 2의 형식으로 변환 후 계산될 수 있다. 위와 같이 단일의 반환 값을 가지는 특정의 아이템(들)을 제외하고 대부분의 아이템은 거의 동일한 크기(즉, 항 목 수 × 값의 바이트(byte))를 가지므로(또는 동일한 크기의 값을 반환하기 때문에), 하나의 아이템 크기를 기 반으로 플랫폼의 제약 기준을 정할 수 있다. 소스 데이터 추출 방식 구독 정보 생성 장치는 외부 시스템(즉, 소스(source))로부터 소스 데이터를 추출(또는 수집)한다. 그리고, 구독 정보 생성 장치는 항목 별로 독립된 값 혹은 항목과 무관한 단일의 값에 대한 시계열 데이터 로 관리(또는 저장)할 수 있으며, 이러한 시계열 데이터를 기본 데이터(base data)로 지칭할 수 있다. 예를 들 어, 앞서 표 1과 같이 종목코드 당 종가를 가지는 아이템의 경우, 각 종목코드 별 종가가 특정 일자 별로 관리 (또는 저장)될 수 있다. 또한, 앞서 표 3과 같이 종목코드와 무관하게 동일한 코스피200 변동성 지수를 가지는 아이템의 경우에도, 특정 일자 별로 코스피200 변동성 지수의 값이 관리(또는 저장)될 수 있다. 이와 같이 관리(또는 저장)되는 기본 데이터를 이용하여 후술하는 아이템 계산 방식에 따라 각 항목 별로 독립 된 단일의 데이터가 산출되거나 또는 항목과 무관하게 단일의 데이터가 산출되고, 최종적으로 앞서 표 1과 같은 데이터(즉, 아이템)가 반환(즉, 생성)된다. 도 2는 본 개시의 일 실시예에 따른 소스 데이터를 수집하는 과정을 예시하는 도면이다. 구독 정보 생성 장치가 외부 시스템으로부터 소스 데이터를 수집(또는 추출, 획득)하는 방식은 1) 스 케줄된 주기로 소스 데이터를 수집하는 방식과 2) 실시간으로 소스 데이터를 수집하는 방식으로 구분될 수 있다. 도 2(a)는 스케줄된 주기로 소스 데이터를 수집하는 방식을 예시한다. 스케줄된 주기로 소스 데이터를 수집하는 방식은, 구독 정보 생성 장치가 주기적으로(즉, 미리 스케줄된 시간 간격) 외부 시스템으로부터 소스 데이터를 추출(또는 수집)하여 내부에서 관리하는 방식을 의미한다. 즉, 구독 정보 생성 장치는 수집한 소스 데이터를 기본 데이터로 변환하여 내부에 저장하고, 이후 아이템 계산 시(즉, 아이템 생성 시) 기 저장된 기본 데이터를 이용할 수 있다. 예를 들어, 구독 정보 생성 장치 는 스케줄된 API(application programming interface)(예를 들어, 배치(batch) API))를 호출하여 소스 데이터 를 추출(또는 수집)할 수 있다. 도 2(a)를 참조하면, ① 데이터 수집부(들)는 외부 시스템에게 주기적으로 소스 데이터를 요청한다. 예를 들어, 데이터 수집부(들)는 스케줄된 API를 호출함으로써 주기적으로 소스 데이터를 요청할 수 있다. ② 데이터 수집부(들)는 외부 시스템으로부터 요청된 소스 데이터를 수신한다. ③ 데이터 수집부 (들)는 수신한 소스 데이터를 필요한 형식(즉, 기본 데이터)로 변환하고, 메모리(들)에 저장한다. ④ 아이템 생성부(들)는 메모리(들)에게 기본 데이터를 요청한다. 예를 들어, 아이템 생성부(들)는 계산하기 위한(즉, 생성하기 위한) 아이템을 호출함으로써 해당 아이템과 연관된 기본 데이터를 요청할 수 있다. ⑤ 아이템 생성부(들)는 메모리(들)로부터 기본 데이터를 수신한다. 이처럼, 스케줄된 주기로 소스 데이터를 추출(또는 수집)하는 방식은 미리 소스 데이터를 변환하여 DB에 저장하 고, 아이템이 계산(즉, 생성)될 때 기본 데이터를 활용하는 방식이다. 상대적으로 API의 속도가 느리거나 데이 터 수집부(들)이 기본 데이터를 생성하는데 오랜 시간이 소요되거나, 소스 데이터와 기본 데이터의 양식이 많이 다른 경우의 아이템에 대한 데이터 추출 시 적합할 수 있다. 예를 들어, 홈 트레이딩 시스템(HTS: home trading system) 관련 데이터인, 시가, 고가, 저가, 종가, 거래량 등 의 데이터들은 한번의 API 호출을 통해 다양한 아이템의 관련 데이터를 추출할 수 있으므로, 외부 시스템 으로부터 일정 주기의 시간 간격으로 요청하여 수신하고, 기본 데이터 변환하여 여러 아이템에서 사용할 수 있 도록 미리 저장함으로써, 시간을 절약할 수 있다. 또 다른 일례로, '뉴스 키워드 중요도' 아이템의 경우, 외부 시스템으로부터 뉴스 본문 데이터(즉, 소스 데이터)를 요청하여 수신하고, 텍스트 마이닝(text mining) 기법 등을 통해 키워드 별로 중요도를 산출함으로써 생성될 수 있다. 이 경우, 뉴스 본문을 읽어와 텍스트 마이닝(text mining) 기법 들을 통해 키워드별 중요도를 판별함으로써 정량적 데이터를 저장하는 과정에서 과다한 시간이 소요될 수 있으므로, 주기적으로 외부 시스템 으로부터 뉴스 본문 데이터(즉, 소스 데이터)를 수신하는 방식이 이용될 수 있다. 도 2(b)는 실시간으로 소스 데이터를 추출(또는 수집)하는 방식을 예시한다. 실시간으로 소스 데이터를 추출(또는 수집)하는 방식은 구독 정보 생성 장치가 아이템 계산 시(즉, 아이템 생성 시) 실시간으로 외부 시스템으로부터 소스 데이터를 추출(또는 수집)하는 방식을 의미한다. 이 경우, 구독 정보 생성 장치는 추출(또는 수집)한 소스 데이터를 기본 데이터로 변환하고 이를 아이템 계산(즉, 아이템 생성)에 이용할 수 있다. 예를 들어, 구독 정보 생성 장치는 실시간으로 API(application programming interface)를 호출하여 소스 데이터를 추출(또는 수집)할 수 있다.도 2(b)를 참조하면, ① 아이템 생성부(들)는 데이터 수집부(들)에게 기본 데이터를 요청한다. 예를 들어, 아이템 생성부(들)는 계산하기 위한(즉, 생성하기 위한) 아이템을 호출함으로써 해당 아이템과 연관 된 기본 데이터를 요청할 수 있다. ② 데이터 수집부(들)는 기본 데이터 요청 시, 외부 시스템에게 소스 데이터를 요청한다. 예를 들어, 데이터 수집부(들)는 API를 호출함으로써 소스 데이터를 요청할 수 있다. ③ 데이터 수집부(들)는 외부 시스템으로부터 요청된 소스 데이터를 수신하고, 이를 기본 데이터로 변환한다. ④ 아이템 생성부(들)는 데이터 수집부(들)로부터 기본 데이터를 수신한다. 이처럼, 실시간으로 소스 데이터를 추출(또는 수집)하는 방식은 구독 정보를 구성하는(예를 들어, 아이디어 (Idea) 내 구성된) 아이템이 실제로 작동하는 시점에 데이터를 추출하는 방식에 해당한다. 외부 API 반응 속도 가 빠르고 소스 데이터의 크기가 크지 않으며, 소스 데이터로부터 기본 데이터로 변환하는 속도가 빠른 경우의 아이템에 대한 데이터 추출 시 적합할 수 있다. 예를 들어, API 호출 속도가 빠르며 그리고/또는 외부 시스템에서 일정 방식으로 데이터를 분석한 결과를 소스 데이터로서 제공하는 경우, 전체 데이터에서 필요한 정보만이 수신되기 때문에 실시간으로 소스 데이터를 추출(또는 수집)하는 방식이 이용될 수 있다. 위와 같이, 소스 데이터를 추출(또는 수집)하는 방식으로 2가지 방식이 이용될 수 있으며, 각 아이템 별로 해당 아이템의 속성 등을 기반으로 어느 하나의 소스 데이터를 추출(또는 수집)하는 방식이 이용될 수 있다. 아이템의 생성 방식 (아이템 조합) 이하, 소스 데이터로부터 아이템을 생성하는 방법에 대하여 기술한다. 1) 단일 아이템 생성 외부 시스템으로부터 추출(또는 수집)한 소스 데이터부터 가공한 하나의 아이템에 대한 기본 데이터는 항 목 별 그리고 조건 별 데이터가 시계열로 존재한다. 이러한 기본 데이터에 하나 이상의 지정 파라미터 및/또는 하나 이상의 공통 파라미터를 적용함으로써 각 항목 별로 최종적인 값이 결정됨으로써 아이템이 생성된다. 이하, 설명의 편의를 위해 뉴스(즉, 소스 데이터)로부터 항목 독립적인 아이템(즉, 단일 반환 아이템) 중 하나 인 '뉴스키워드중요도' 아이템과 항목 종속적인 아이템(즉, 다중 반환 아이템) 중 하나인 '종목별뉴스중요도' 아이템이 계산(즉, 생성)되는 과정을 예를 들어 설명하지만, 본 개시의 기술적 특징이 이에 한정되는 것은 아니 다. 여기서 '뉴스키워드중요도' 아이템은 사용자 장치로부터 키워드(즉, 조건)를 지정 파라미터로서 수신하고 (여기서, 키워드는 사용자 장치가 아이디어 보드 상에서 사용자에 의해 입력 받을 수 있다), 해당 키워드 가 뉴스 상에서 등장하는 중요도 등을 소정의 알고리즘에 기반하여 숫자로 계산함으로써 생성된다. 즉, 특정 키 워드(즉, 조건)가 뉴스 상에서 빈번하게 등장하는 정도를 나타내는 아이템에 해당하며, 이는 모든 항목에 대해 서 동일한 값을 가지는 단일 반환 아이템에 해당한다. '종목별뉴스중요도' 아이템은 지정 파라미터 없이 각 종 목(즉, 항목)에 대응되는 기업에 관련된(또는 태깅된(tagging)) 각 키워드의 중요도를 소정의 알고리즘에 기반 하여 산출하고 이를 합산함으로써 생성된다. 즉, 뉴스 전체에서 각 기업 별로 언급(mention)되는 정도를 나타내 는 아이템에 해당하며, 이는 각 종목 별로 독립적인 값을 가지는 다중 반환 아이템에 해당한다. 위의 예시된 2개의 아이템은 모두 스케줄된 주기로 소스 데이터를 추출(또는 수집)하는 방식에 기반하여 생성될 수 있다. 앞서 도 2(a)를 다시 참조하면, ① 데이터 수집부(들)는 일정 주기에 따라 뉴스 본문을 크롤링(crawling) 하여 정량화하는 작업을 실행함으로써, 데이터 수집부(들)는 외부 시스템에게 주기적으로 소스 데이 터를 요청한다. ② 뉴스 본문이 추출되며, 데이터 수집부(들)는 외부 시스템으로부터 뉴스 본문을 소 스 데이터로서 수신한다. ③ 데이터 수집부(들)는 수신한 뉴스 본문에서 1차적으로 전체 뉴스에서 키워드 (즉, 조건) 별로 소정의 알고리즘에 기반하여 중요도를 산출하며, 산출한 중요도를 시계열 데이터로 구축함으로 써 기본 데이터 1(즉, '뉴스키워드중요도' 아이템에 대한 기본 데이터)가 생성된다. 표 4는 '뉴스키워드중요도' 아이템에 대한 기본 데이터를 예시한다. 표 4 키워드 중요도 (2020/12/13) 대통령 후보 3.93징계위 2.28 스마트폰 a 1.78 정부 1.74 대통령 1.70 총장 1.50 병상 1.37 스마트폰 b 1.23 미 1.09 국민 1.00 정당 0.93 검찰 0.93 A사 부회장 0.91 B사 스마트폰 0.83 개정안 0.82 법무부 0.80 장관 0.80 또한, ③ 데이터 수집부(들)는 종목 별로 해당 종목과 관련된 키워드를 연관시켜(예를 들어, 종목 별로 태 그(tag)를 이용하여 키워드와 종목을 연관시킬 수 있다) DB에 저장한다. 표 5는 종목 별로 해당 종목과 관련된 키워드가 연관된 결과를 예시한다. 표 5 종목명 종목코드 키워드 중요도 (2020/12/13) A사 005930 스마트폰 a 1.78 B사 066570 스마트폰 b 1.23 A사 005930 A사 부회장 0.91 B사 066570 B사 스마트폰 0.83 표 5과 같은 각 종목 별 해당 종복과 관련된 키워드 정보는 주기적으로 처리되어 일정 주기(예를 들어, 일별)로 저장된다. 이처럼 각 종목 별 그리고 조건(즉, 키워드) 별 시계열 데이터인 기본 데이터 2(즉, '종목별뉴스중요 도' 아이템에 대한 기본 데이터)가 생성된다. 표 6은 '종목별뉴스중요도' 아이템에 대한 기본 데이터를 예시한다. 표 6에서는 2020.12.09 부터 2020.12.13까지의 각 키워드에 대한 중요도 값 만을 예시하고 있지만, 이는 설명의 편의를 위한 것이며, 매일 각 키워드에 대한 중요도 값이 누적되어 저장될 수 있다. 표 6 종목명 종목 코드키워드 중요도 (2020/12/1 3)중요도 (2020/12/1 2)중요도 (2020/12/1 1)중요도 (2020/12/1 0)중요도 (2020/12/0 9) B사 066570 스마트폰 b 1.23 0.26 0.27 0.60 0.46 B사 066570 B사 스마트폰 0.83 0.56 0.46 0.24 0.16 A사 005930 스마트폰 a 1.78 1.54 1.31 2.54 0.98 A사 005930 A사 부회장 0.91 0.86 0.92 0.36 0.78 그리고, ④ 아이템 생성부(들)는 사용자 장치로부터 수신한 하나 이상의 지정 파라미터 및/또는 하나 이상의 공통 파라미터를 기본 데이터에 적용함으로써 아이템을 도출(즉, 생성)한다. 이하, 지정 파라미터와 공 통 파라미터에 대하여 기술한다. 지정 파라미터는 아이템 별로 설정되는 파라미터를 의미하며, 지정 파라미터의 존재 여부와 개수, 데이터 형식 등은 아이템 별로 상이하게 설정될 수 있다. 공통 파라미터는 기본 데이터(특히, 시계열 데이터)에 공통적으로 적용되는 파라미터를 의미하며, 사용자 장치 로부터 하나 이상의 파라미터들이 수신될 수 있다. 표 7은 공통 파라미터를 예시한다. 표 7에서는 공통 파라미터의 일례를 예시하는 것일 뿐이며, 본 개시의 기술적 특징을 한정하는 것이 아니다. 표 7 공통 파라미터 1 공통 파라미터 2 공통 파라미터 3 특정시점 일자 기간평균 시점 종점 모멘텀 시점 종점 기간 변화량 시점 종점 기간 내 최대 시점 종점 기간 내 최소 시점 종점 표 7을 참조하면, 사용자 장치로부터 공통 파라미터 1이 선택됨에 따라, 공통 파라미터 2만이 추가적으로 선택되거나 공통 파라미터 2와 3이 추가적으로 선택될 수 있다. 즉, 선택된 공통 파라미터 1은 조건에 해당할 수 있으며, 공통 파라미터 1의 조건 하에 추가적인 공통 파라미터가 선택될 수 있다. 도 3은 본 개시의 일 실시예에 따른 공통 파라미터의 선택을 위한 사용자 인터페이스를 예시한다. 도 3(a)는 '주가'에 대한 아이템에 대하여 공통 파라미터 1(즉, 조건)로서 '특정시점'이 선택된 경우를 예시한 다. 사용자 장치는 사용자로부터 공통 파라미터 1(즉, 조건)로서 '특정시점'이 선택되면, 아이디어 보드 상에 서 사용자가 '일자'를 직접 입력할 수 있도록 입력 창 또는 '일자'를 선택할 수 있도록 달력창(a-1) 또는 게이 지창(a-2)을 표시할 수 있다. 게이지창(a-1)은 당일을 기준으로 소정의 범위 내의 기간(이를 사용자가 미리 설 정할 수도 있음)이 표시되고, 사용자는 해당 기간 내에서 게이지를 이동함으로써 당일로부터 몇일 전의 일자를 선택할 수 있다. 사용자 장치는 사용자로부터 입력 또는 선택된 '특정시점'(즉, 공통 파라미터 1)과 '일자'(즉, 공통 파라미터 2)를 구독 정보 생성 장치에게 전송할 수 있다. 도 3(b)는 '주가'에 대한 아이템에 대하여 공통 파라미터 1(즉, 조건)로서 '기간 내 최대'가 선택된 경우를 예 시한다. 사용자 장치는 사용자로부터 공통 파라미터 1(즉, 조건)로서 '기간 내 최대'가 선택되면, 아이디어 보드 상에서 사용자가 '시점'과 '종점'을 각각 직접 입력할 수 있도록 입력 창을 표시하거나 또는 각각 일자를 선택 할 수 있도록 달력창(b-1) 또는 게이지창(b-2)을 표시할 수 있다. 사용자 장치는 사용자로부터 입력 또는 선택된 '기간 내 최대'(즉, 공통 파라미터 1)과 '시점'(즉, 공통 파라미터 2)과 '종점'(즉, 공통 파라미터 3)을 구독 정보 생성 장치에게 전송할 수 있다. 예를 들어, '뉴스키워드중요도' 아이템의 경우, 구독 정보 생성 장치는 사용자로부터 입력된 키워드, 즉 지정 파라미터를 사용자 장치를 통해 수신할 수 있다. 또한, 구독 정보 생성 장치는 사용자로부터 선 택 또는 입력된 공통 파라미터(들)을 사용자 장치를 통해 수신할 수 있다. 표 8은 '뉴스키워드중요도' 아이템에 적용되는 지정 파라미터와 공통 파라미터를 예시한다. 표 8에서는 지정 파라미터와 공통 파라미터의 일례를 예시하는 것일 뿐이며, 본 개시의 기술적 특징을 한정하는 것이 아니다. 표 8 지정 파라미터 공통 파라미터 1 공통 파라미터 2 공통 파라미터 3 스마트폰 b 기간평균 4일전 (2020.12.09)금일(2020.12.13) 아이템 생성부(들)는 기본 데이터로부터 표 8과 같이 사용자 장치를 통해 입력된 지정 파라미터 및 공통 파라미터(들)을 적용하여, 최종적으로 아래 표 9와 같은 아이템을 생성한다(즉, 반환한다). 표 9는 '뉴스키워드중요도' 아이템의 최종 결과를 예시한다. 표 9 종목 코드 뉴스키워드중요도 (2021.12.13) 000000 0.564 즉, 표 6과 같은 기본 데이터에서, 앞서 표 8과 같은 지정/공통 파라미터가 입력되면, '스마트폰 b' 키워드에 대해서 2020.12.09부터 2020.12.13까지의 중요도 값에 대한 평균 값이 계산되고(즉, 0.564 = (1.23 + 0.26 + 0.27 + 0.60 + 0.46) / 5), 표 9과 같이 최종적으로 '뉴스키워드중요도' 아이템이 생성될 수 있다. 여기서, '뉴 스키워드중요도' 아이템은 종목과 무관하게 사용자에 의해 입력된 키워드가 뉴스에서 어느 정도로 노출 또는 등 장되는지 중요도 점수를 반환하는 아이템이므로, 전체 종목에 대해서 동일한 값이 반환된다. 즉, 표 9와 같이 모든 종목을 지시할 수 있는 종목 코드 예를 들어, 000000이 반환될 수 있다. 도 4는 본 개시의 일 실시예에 따른 지정 파라미터 및 공통 파라미터의 선택을 위한 사용자 인터페이스를 예시 한다. 사용자가 아이디어 보드 상에서 특정 아이템을 클릭하면, 사용자 장치는 해당 아이템의 지정 파라미터 및/ 또는 공통 파라미터의 선택 창(즉, 지정 파라미터 및/또는 공통 파라미터의 변경을 위해)을 표시할 수 있다. 사 용자로부터 지정 파라미터 및/또는 공통 파라미터가 선택되면, 사용자 장치는 선택된 지정 파라미터 및/또 는 공통 파라미터에 대한 정보를 구독 정보 생성 장치에게 전송할 수 있다. 도 4에서는 '뉴스키워드노출도'에 대한 아이템에 대하여 지정파라미터인 키워드로 '코로나'가 입력되고, 공통 파라미터 1(즉, 조건)로서 '기간평균'이 선택되는 경우를 예시한다. 사용자 장치는 사용자로부터 다양한 공통 파라미터 1(즉, 조건)에 대한 메뉴(즉, 도 4에서 '기간 내 최 대', '기간 변화량', '기간 평균', '모멘텀', '특정시점')에서 공통 파라미터 1(즉, 조건)로서 '기간평균'이 선 택되면, 아이디어 보드 상에서 사용자가 '시점'과 '종점'을 각각 직접 입력할 수 있도록 입력 창을 표시하거나 또는 각각 일자를 선택할 수 있도록 달력창을 표시할 수 있다. 사용자 장치는 사용자로부터 입력된 '코로 나'(즉, 지정 파라미터)와 입력 또는 선택된 '기간 평균'(즉, 공통 파라미터 1)과 '시점'(즉, 공통 파라미터 2)과 '종점'(즉, 공통 파라미터 3)을 구독 정보 생성 장치에게 전송할 수 있다. 또 다른 예로, '종목별뉴스중요도' 아이템의 경우, 지정 파라미터가 적용되지 않으므로, 구독 정보 생성 장치 는 사용자로부터 선택 또는 입력된 공통 파라미터(들)만을 사용자 장치를 통해 수신할 수 있다. 표 10은 '종목별뉴스중요도' 아이템에 적용되는 공통 파라미터를 예시한다. 표 10에서는 공통 파라미터의 일례를 예시하는 것일 뿐이며, 본 개시의 기술적 특징을 한정하는 것이 아니다. 표 10 공통 파라미터 1 공통 파라미터 2 공통 파라미터 3 최대값 4일전 (2020.12.09) 금일(2020.12.13) 아이템 생성부(들)는 기본 데이터로부터 표 10과 같이 사용자 장치를 통해 입력된 공통 파라미터 (들)을 적용하여, 최종적으로 아래 표 11와 같은 아이템을 생성한다(즉, 반환한다). 표 11은 '종목별뉴스중요도' 아이템의 최종 결과를 예시한다. 표 11 종목 코드 뉴스키워드중요도 (2021.12.13) 066570 2.06 005930 2.9즉, 표 6과 같은 기본 데이터에서, 앞서 표 10과 공통 파라미터가 입력되면, 각 종목 별로 2020.12.09부터 2020.12.13까지의 중요도 값 중에서 최대값이 계산되고, 표 11과 같이 최종적으로 '종목별뉴스중요도' 아이템이 생성될 수 있다. 여기서, '종목별뉴스중요도' 아이템은 종목 별로 상이한 결과 값이 반환된다. 2) 아이템 간 계산(조합) 사용자에 의해 선택된 두 개 이상의 아이템과 사용자에 의해 선택된 연산자를 사용자 장치를 통해 수신하 면, 구독 정보 생성 장치는 연산자에 기반하여 두 개 이상의 아이템을 계산(조합)할 수 있다. 여기서, 아이템들 간의 계산(조합)은 각 항목(예를 들어, 종목) 별로 독립적으로 수행된다. 예를 들어, 항목이 3000개라면, 각 항목 별 값에 대해 3000번의 연산이 수행된다. 따라서, 각 항목 별로 연산의 간섭이 발생되지 않는다. 상술한 바와 같이, 항목 독립적인 아이템(즉, 단일 반환 아이템)은 저장을 위해서는 앞서 표 9와 같이 모든 항 목을 지시하는 코드(예를 들어, 종목코드 000000)와 항목에 무관하게 공통된 값이 저장되지만, 복수의 아이템 간의 연산(조합)을 위해서는, 각 항목 별로 해당 공통된 값이 부여된 상태로 변환될 수 있다. 도 5는 본 개시의 일 실시예에 따른 복수의 아이템 간의 연산(조합) 구조를 예시하는 도면이다. 도 5를 참조하면, 2개 이상의 복수의 아이템들 간에 연산자를 이용하여 연산(조합)함으로써 새로운 아이템이 생 성될 수 있다. 예를 들어, 아이템 1과 아이템 2를 연산자 a를 이용하여 연산(조합)함으로써 아이템 7이 생성될 수 있다. 여기서, 2개의 아이템들 간의 연산(조합)으로 한정되지 않으며, 3개 이상의 아이템들 간의 연산(조합)도 가능하 다. 예를 들어, 아이템 3, 아이템 4, 아이템 5를 연산자 b를 이용하여 연산(조합)함으로써 아이템 8이 생성될 수 있다. 또한, 아이템들만의 연산(조합)으로 한정되지 않으며, 아이템과 특정 값 간의 연산(조합)도 가능하다. 예를 들 어, 아이템 6과 특정 값을 연산자 c를 이용하여 연산(조합)함으로써 아이템 9가 생성될 수 있다. 또한, 이처럼 연산(조합)하여 생성된 아이템도 연산(조합)하여 생성된 또 다른 아이템과의 연산자를 이용하여 연산(조합)함으로써 새로운 아이템이 생성될 수 있다. 예를 들어, 아이템 8과 아이템 9를 연산자 c를 이용하여 연산(조합)함으로써 아이템 11이 생성될 수 있다. 또한, 아이템 11과 아이템 10을 연산자 d를 이용하여 연산(조 합)함으로써 아이템 12가 생성될 수 있다. 또한, 연산(조합)하여 생성된 아이템들 간의 연산(조합)만으로 한정되지 않으며, 연산(조합)하여 생성된 아이템 은 연산(조합) 과정으로 생성되지 않은 아이템과의 연산자를 이용하여 연산(조합)함으로써 새로운 아이템이 생 성될 수 있다. 예를 들어, 아이템 12와 아이템 7을 연산자 e를 이용하여 연산(조합)함으로써 아이템 13이 생성 될 수 있다. 여기서, 연산(조합)에 이용되는 아이템을 '자식 아이템(child item)'이라고 지칭할 수 있으며, 연산(조합)의 결 과로 생성되는 아이템을 '부모 아이템(parent item)'이라고 지칭할 수 있다. 예를 들어, 아이템 1과 아이템 2는 자식 아이템이고, 아이템 8은 부모 아이템에 해당한다. 다만, 자식 아이템과 부모 아이템은 하나의 연산(조합) 과정에서 상대적으로 결정된다. 즉, 특정 연산(조합) 과 정에서 부모 아이템이라도 다른 연산(조합) 과정에서는 자식 아이템으로 지칭될 수 있다. 예를 들어, 아이템 8 은 아이템 1과 아이템 2와의 관계에서는 부모 아이템이지만, 아이템 9과 연산(조합)하여 아이템 11이 생성되므 로, 이 과정에서는 자식 아이템에 해당한다. 예를 들어, 아이템 A는 아래 표 12와 같이 구성되고, 아이템 B는 아래 표 13과 같이 구성된다고 가정한다. 그리 고, 아이템 A와 아이템 B는 연산자 '+'를 이용하여 연산(조합)됨으로써, 아래 표 14와 같이 아이템 H가 생성될 수 있다. 표 12는 아이템 A를 예시한다. 표 12 종목코드 종가 000070 74500 000080 21800000100 246500 000120 157000 000150 95300 000210 120000 000240 17450 000270 41550 000640 99800 000660 63500 표 13은 아이템 B를 예시한다. 표 13 종목코드 종가 000070 73400 000080 21500 000100 248000 000120 154500 000150 95300 000210 118000 000240 16850 000270 42850 000640 97100 000660 64900 표 14는 아이템 H를 예시한다. 표 14 종목코드 종가 000070 147900 000080 43300 000100 494500 000120 311500 000150 190600 000210 238000 000240 34300 000270 84400 000640 196900 000660 128400 상술한 바와 같이, 아이템들 간의 계산(조합)은 각 항목(예를 들어, 종목) 별로 독립적으로 수행되므로, 아이템 A(표 12)와 아이템 B(표 13)의 연산 시 각 종목코드 별로 독립적으로 '+' 연산이 수행됨으로써 아이템 H(표 1 4)이 생성된다. 아이템 간 계산(연산, 조합) 시 연산자가 이용되며, 사용자 장치로부터 수신될 수 있다. 표 15는 본 개시의 일 실시예에 따른 연산자와 각 연산자 별로 계산(연산)이 가능한 아이템의 조합을 예시한다. 표 15에서는 본 개시에서 제안하는 아이템을 생성하기 위해 이용 가능한 연산자들을 예시하지만, 이는 설명의 편의를 위한 것이며 본 개시의 기술적 특징을 한정하는 것이 아니다. 표 15 연산자 명칭 심볼 자식 아이템 관계 (연산 설명) 출력 타입 AI AI AI([[1]숫자], [[2]숫자], ...) 숫자And AND [[1]참/거짓] AND [[2]참/거짓] AND ... 참/거짓 Avg AVG AVG([[1]숫자], [[2]숫자], ...) 숫자 Correlation 상관 상관([[1]숫자, [[2]숫자], ...] 숫자 Divide ÷ [[1]숫자] ÷ [[2]숫자] 숫자 Equal = [[1]날짜] = [[2]날짜] = ... 참/거짓 Equal = [[1]문자] = [[2]문자] = ... 참/거짓 Equal = [[1]참/거짓] = [[2]참/거짓] = ... 참/거짓 Equal = [[1]숫자] = [[2]숫자] = ... 참/거짓 Greater Than > [[1]날짜] > [[2]날짜] > ... 참/거짓 Greater Than > [[1]숫자] > [[2]숫자] > ... 참/거짓 Greater Than > [[1]문자] > [[2]문자] > ... 참/거짓 Greater Than Or Equal≥ [[1]날짜] ≥ [[2]날짜] ≥ ... 참/거짓 Greater Than Or Equal≥ [[1]문자] ≥ [[2]문자] ≥ ... 참/거짓 Greater Than Or Equal≥ [[1]숫자] ≥ [[2]숫자] ≥ ... 참/거짓 Less Than < [[1]숫자] < [[2]숫자] < ... 참/거짓 Less Than < [[1]날짜] < [[2]날짜] < ... 참/거짓 Less Than < [[1]문자] < [[2]문자] < ... 참/거짓 Less Than Or Equal≤ [[1]문자] ≤ [[2]문자] ≤ ... 참/거짓 Less Than Or Equal≤ [[1]날짜] ≤ [[2]날짜] ≤ ... 참/거짓 Less Than Or Equal≤ [[1]숫자] ≤ [[2]숫자] ≤ ... 참/거짓 Max MAX MAX([[1]문자], [[2]문자], ...) 문자 Max MAX MAX([[1]날짜], [[2]날짜], ...) 날짜 Max MAX MAX([[1]숫자], [[2]숫자], ...) 숫자 Min MIN MAX([[1]숫자], [[2]숫자], ...) 숫자 Min MIN MAX([[1]날짜], [[2]날짜], ...) 날짜 Min MIN MAX([[1]문자], [[2]문자], ...) 문자 Minus - [[1]숫자] - [[2]숫자] 숫자 Minus - [[1]숫자] - [[2]숫자] 날짜 Minus - [[1]날짜] - [[2]날짜] 숫자 Multiply × [[1]숫자] × [[2]숫자] × ... 숫자 Not NOT NOT [[1]참/거짓] 참/거짓 Not Equal ≠ [[1]문자] ≠ [[2]문자] 참/거짓 Not Equal ≠ [[1]날짜] ≠ [[2]날짜] 참/거짓 Not Equal ≠ [[1]숫자] ≠ [[2]숫자] 참/거짓 Not Equal ≠ [[1]참/거짓] ≠ [[2]참/거짓] 참/거짓 Or OR [[1]참/거짓] OR [[2]참/거짓] OR ... 참/거짓 Plus + [[1]숫자] + [[2]숫자] + ... 숫자 Plus + [[1]문자] + [[2]숫자] 문자 Plus + [[1]문자] + [[2]문자] + ... 문자 Plus + [[1]숫자] + [[2]날짜] 날짜 Plus + [[1]날짜] + [[2]숫자] 날짜 Plus + [[1]숫자] + [[2]문자] 문자 Ranking 랭킹([[1]참/거짓(순서)], [[2]참/거짓(대상), [[3]날짜(중요도)])숫자 Ranking 랭킹([[1]참/거짓(순서)], [[2]참/거짓(대상), [[3]숫자(중요도)])숫자 Ranking 랭킹 ([[1]참/거짓(순서)], [[2]참/거짓(대상)], [[3]문자( 중요도)])숫자 Scenario 전략전략(매수:[[1]참/거짓(매수)], 매도:[[2]참/거짓(매도)]) Top PercentageTOP%TOP%[[1]숫자(%)], ([[2]참/거짓(순서)], [[3]참/거짓(대상)], [[3]문자(중요도)]) 참/거짓 Top PercentageTOP%TOP%[[1]숫자(%)], ([[2]참/거짓(순서)], [[3]참/거짓(대상)], [[3]날짜(중요도)])참/거짓 Top PercentageTOP%TOP%[[1]숫자(%)], ([[2]참/거짓(순서)], [[3]참/거짓(대상)], [[3]숫자(중요도)])참/거짓 Top Rank TOPTOP[[1]숫자(RANK)], ([[2]참/거짓(순서)], [[3]참/거짓( 대상)], [[3]날짜(중요도)])참/거짓 Top Rank TOPTOP[[1]숫자(RANK)], ([[2]참/거짓(순서)], [[3]참/거짓( 대상)], [[3]숫자(중요도)])참/거짓Top Rank TOPTOP[[1]숫자(RANK)], ([[2]참/거짓(순서)], [[3]참/거짓( 대상)], [[3]문자(중요도)])참/거짓 표 15에서 연산자 이름은 각 연산자의 명칭을 예시하고, 심볼은 연산자를 나타내는 기호를 예시한다. 'AI'는 구 독 정보 생성 장치에 의해 구현되는 인공지능(artificial intelligence) 기반으로 항목 별로 AI 연산 결과 를 출력하는 연산자를 나타낸다. 'And'는 논리 연산자 AND를 의미하며, 항목 별로 모든 아이템의 해당 항목이 참일 때 참을 출력하는 연산자를 나타낸다. 'Or'는 논리 연산자 OR를 의미하며, 항목 별로 어느 하나의 아이템 의 해당 항목이 참일 때 참을 출력하는 연산자를 나타낸다. 'Correlation'는 항목 별로 상관 결과를 산출하는 연산자를 나타낸다. 'Plus', 'Minus', 'Multiply', 'Divide', 'Avg'는 각각 항목 별로 더하기, 빼기, 곱하기, 나누기, 평균 연산을 출력하는 연산자를 나타낸다. 'Greater Than', 'Greater Than Or Equal', 'Less Than', 'Less Than Or Equal'은 각각 항목 별로 초과인지, 이상인지, 미만인지, 이하인지 여부를 출력하는 연산자를 나 타낸다. 'Max', 'Min'은 각각 항목 별로 최대 값, 최소 값을 출력하는 연산자를 나타낸다. 'Equal', 'Not Equal'은 각각 항목 별로 모든 아이템의 해당 항목의 값이 동일한지 여부, 서로 다른지 여부를 출력하는 연산자 를 나타낸다. 'Not'은 항목 별로 해당 항목의 값을 반대로 출력하는 연산자를 나타낸다. 'Ranking'은 대상을 중 요도를 기준으로 일정 순서(즉, 오름차순 또는 내림차순)로 순위를 출력하는 연산자를 나타낸다. 'Top Percentage'는 대상을 중요도를 기준으로 일정 순서(즉, 오름차순 또는 내림차순)로 순위를 부여한 후, 상위로 부터 소정의 숫자(%)의 범위 내 속하는지 아닌지 출력하는 연산자를 나타낸다. 'Top Rank'는 대상을 중요도를 기준으로 일정 순서(즉, 오름차순 또는 내림차순)로 순위를 부여한 후, 상위로부터 소정의 숫자(RANK)의 순위 내 속하는지 아닌지 출력하는 연산자를 나타낸다. 표 15에서 '자식 아이템 관계'는 각 연산자를 이용한 연산 과정을 예시한다. 여기서, [[n]xxx]는 하나의 아이템 을 예시하고, [n]는 각 아이템을 구분하기 위한 인덱스를 예시하고, xxx는 해당 아이템이 가지는 값의 타입(숫 자, 문자, 날짜, 참/거짓 등)을 예시한다. 또한, '자식 아이템 관계'에서 '...'는 해당 연산의 대상으로 추가로 또 다른 하나 이상의 아이템이 이용될 수 있다는 것을 의미한다. 그리고, 표 15에서 '출력 타입'은 연산의 결과로 생성되는 아이템의 값의 타입을 예시한다. 표 15에서 숫자는 실수, 정수, 자연수 등일 수 있다. 예를 들어, PLUS('+') 연산에서 [[1]문자] + [[2]숫자]의 연산은, 항목 별로 문자 타입의 값을 가지는 제1 아이템과 항목 별로 숫자 타입의 값을 가지는 제2 아이템을 '+' 연산으로 연산/계 산한다는 것을 의미한다. 그리고, 이러한 연산으로 생성된 결과 아이템은 항목 별로 문자 타입의 값을 가질 수 있다. 또한, 아이템 간 연산에서 특정 입력 값이 이용될 수도 있다. 예를 들어, 'Top Percentage', 'Top Rank'에서 특 정 범위/순위에 속하는 연산하기 위해 기준의 숫자(% 또는 RANK)가 필요하며, 이는 사용자 장치로부터 수 신할 수 있다. 앞서 표 15에 예시한 바와 같이, 각 연산자 별로 연산(조합) 대상이 되는 자식 아이템은 특정 값의 형식을 가지 는 아이템으로 제한될 수 있다. 예를 들어, 'Avg' 연산자가 연산에 적용될 수 있는 자식 아이템은 값의 형식은 숫자이므로, 문자, 날짜, 참/거짓 값의 형식을 가지는 자식 아이템에 대해서는 'Avg' 연산자를 이용할 수 없다. 따라서, 표 15에서 예시되는 조합(연산)의 규칙에 기반하여, 아이디어 보드 상에서 사용자에 의해 특정 자식 아 이템이 선택되었을 때 이용 가능한 연산자가 사용자 장치의 아이디어 보드 상에서 표시될 수 있다. 즉, 구 독 정보 생성 장치는 사용자 장치로부터 자식 아이템들의 선택을 수신하면, 해당 자식 아이템들의 연 산에 이용 가능한 연산자 후보를 사용자 장치에게 전송할 수 있다. 도 6는 본 개시의 일 실시예에 따른 연산자 선택을 위한 사용자 인터페이스를 예시한다. 사용자가 아이디어 보드 상에서 특정 아이템을 클릭하면, 사용자 장치는 해당 아이템과 연산(조합)이 가능 한 숫자 또는 날짜 등을 입력/선택할 수 있는 창을 표시할 수 있다. 사용자로부터 숫자 또는 날짜 등이 입력/선 택되면, 사용자 장치는 아이템 정보와 입력/선택된 숫자 또는 날짜 등에 대한 정보를 구독 정보 생성 장치 에게 전송할 수 있다. 구독 정보 생성 장치는 아이템과 입력/선택된 숫자 또는 날짜 등에 대한 정보 를 기반으로, 이용 가능한 연산자에 대한 정보를 사용자 장치에게 전송할 수 있다. 사용자 장치는 아 이디어 보드 상에서 이용 가능한 연산자에 대한 선택 메뉴를 표시할 수 있다. 또한, 사용자가 아이디어 보드 상에서 제1 아이템이 드래그(drag)되어 제2 아이템과 겹쳐지면(중첩되면), 사용 자 장치는 제1 아이템과 제2 아이템의 정보를 구독 정보 생성 장치에게 전송할 수 있다. 구독 정보생성 장치는 제1 아이템과 제2 아이템의 정보를 기반으로, 이용 가능한 연산자에 대한 정보를 사용자 장치 에게 전송할 수 있다. 사용자 장치는 아이디어 보드 상에서 이용 가능한 연산자에 대한 선택 메뉴를 표시할 수 있다. 도 6에서는 사용자 장치에 의해 '1일 전 주가' 아이템과 '1일 전 시가' 아이템이 선택되었다고 가정한다. 이 경 우, 사용자 장치는 구독 정보 생성 장치로부터 수신한 이용 가능한 연산자들의 후보에 대한 선택 메 뉴창을 표시할 수 있다. 그리고, 구독 정보 생성 장치가 사용자 장치로부터 연산자의 선택 정보를 수 신하면, 선택된 연산자를 이용하여 '1일 전 주가' 아이템과 '1일 전 시가' 아이템을 연산하여 새로운 아이템을 생성할 수 있다. 또한, 특정 연산자를 활용해 두 개 이상의 아이템을 조합하였을 때, 각 아이템의 역할(또는 조건)이 아이템 앞 에 표시(필요 시)될 수 있다. 도 7은 본 개시의 일 실시예에 따른 아이템 조합 시 아이템의 역할이 표시되는 사용자 인터페이스를 예시하는 도면이다. 도 7을 참조하면, 'AI 선정 종목' 아이템과 '저 PBR(price book value ratio) 주' 아이템이 선택된 경우를 예 시한다. 'AI 선정 종목' 아이템과 '저 PBR 종목' 아이템은 모두 각 항목에 대한 값이 참/거짓인 형태를 가질 수 있다. 이 경우, 앞서 표 15와 같이 두 아이템을 '시나리오' 연산자로 조합이 가능하다. 만약, 사용자 장치(20 0)에 의해, 두 아이템의 조합 연산자로서 선택된 '시나리오'가 수신된 경우, 구독 정보 생성 장치에 의해 각 아이템 별로 역할(또는 조건)이 부여될 수 있다. 도 7의 경우, 'AI 선정 종목'은 매수 역할(또는 조건)이 부 여되고, '저 PBR 종목'은 매도 역할(또는 조건)이 부여될 수 있다. 즉, 복수의 아이템이 '시나리오' 연산자에 의해 조합됨으로써, 매수 역할과 매도 역할이 부여된다면, 이는 아이 디어(즉, 투자 전략)으로 설정된다는 것을 의미할 수 있다. 이 경우, 'AI 선정 종목' 아이템에서 참을 만족하는 종목에 대한 매수 신호가 구독 정보 생성 장치에 의해 매수 신호가 주식 거래 시스템으로 전송될 수 있으 며, '저 PBR 종목' 아이템에서 참을 만족하는 종목에 대한 매도 신호가 구독 정보 생성 장치에 의해 매수 신호가 주식 거래 시스템으로 전송될 수 있다. 도 8은 본 개시의 일 실시예에 따른 아이템 생성 과정에서의 사용자 인터페이스를 예시하는 도면이다. 도 8(a)를 참조하면, 제1 아이템은 각 종목 당 주가를 나타내는 기본 데이터에 공통 파라미터인 특정시점 과 일자(2일전)를 적용함으로써 생성될 수 있다. 즉, 제1 아이템은 각 종목 별 2일전 주가를 나타내는 아 이템에 해당한다. 또한, 제2 아이템은 각 종목 당 주가를 나타내는 기본 데이터에 공통 파라미터인 특정시 점과 일자(1일전)를 적용함으로써 생성될 수 있다. 즉, 제2 아이템은 각 종목 별 1일전 주가를 나타내는 아이템에 해당한다. 그리고, 제1 아이템과 제2 아이템은 'Divide' 연산자를 이용하여 조합됨으로써 제3 아이템이 생 성될 수 있다. 그리고, 제3 아이템은 소정의 상수인 100과 'Multiply' 연산자를 이용하여 조합됨으로써 제 4 아이템이 생성될 수 있다. 즉, 제3 아이템은 각 종목 별 2일전 주가 대비 1일전 주가의 비율, 즉 수익률을 나타내고, 제4 아이템은 이를 백분율로 나타내는 아이템에 해당한다. 제5 아이템은 제4 아이템과 소정의 상수인 100를 'Greater Than' 연산자를 이용하여 조합됨으로써 생 성될 수 있다. 즉, 제5 아이템은 각 종목 별 2일전 주가 대비 1일전 주가의 비율에 대한 백분율이 100보 다 큰지 여부를 나타내는 아이템에 해당한다. 아이템의 생성 시 기본 데이터의 정보 및/또는 지정/공통 파라미터의 정보 및/또는 연산자 정보를 기반으로 해"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "당 아이템의 요약 문구(이를 아이템의 명칭으로 지칭할 수 있음)가 생성되고, 요약 문구만으로 해당 아이템을 표시함으로써 보다 간단하게 아이템이 표시될 수 있다. 이를 아이템 폴딩(item folding)으로 지칭할 수 있다."}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "또한, 아이템의 요약 문구는 해당 아이템이 또 다른 아이템과 조합하여 상위 아이템이 생성될 때, 상위 아이템"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "의 요약 문구를 생성하는데 반복하여(recursive) 이용될 수 있다. 도 8(b)를 참조하면, 제1 아이템은 기본 아이템의 명칭인 주가와 공통 파라미터인 일자 정보를 이용하여"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "'2일 전 주가'라는 아이템의 요약 문구가 생성되어 표시될 수 있다. 마찬가지로, 제2 아이템은 기본 아이"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "템의 명칭인 주가와 공통 파라미터인 일자 정보를 이용하여 '1일 전 주가'라는 아이템의 요약 문구가 생성되어 표시될 수 있다."}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 7, "content": "도 8(c1)를 참조하면, 제4 아이템은 '((2일 전 주가) ÷ (1일 전 주가))×100'라는 아이템의 요약 문구가 생성되어 표시될 수 있다. 그리고, 도 8(d1)를 참조하면, 제5 아이템은 '(((2일 전 주가) ÷ (1일 전"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "주가))×100)>100'라는 아이템의 요약 문구가 생성되어 표시될 수 있다. 또한, 아이템을 표시하는 문구는 사용자 맞춤형으로 설정될 수 있다. 즉, 아이템의 내부 로직을 숨기거나 사용"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "자가 인식하기 편한 문구로 표시할 수 있도록 아이템의 요약 문구는 사용자 장치에 의해 입력된 요약 문구"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "로 변환될 수 있다. 예를 들어, 도 8(c2)와 같이, 제4 아이템은 '수익률'이라는 요약 문구로 설정될 수 있"}
{"patent_id": "10-2022-0069213", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "다. 또한, 도 8(d2)와 같이, 제5 아이템은 '수익률이 증가한 종목'이라는 요약 문구로 설정될 수 있다. 앞서 설명한 바와 같이, 구독 정보 생성 장치의 데이터 수집부(들)에 의해 다양한 양식의 데이터를 스케줄된 시간 간격 또는 실시간으로 수집하여 기본 데이터라는 일정한 요건의 시계열 데이터가 생성된다. 그리 고, 구독 정보 생성 장치의 아이템 생성부(들)에 의해 시계열 데이터 상의 특정 시점, 평균, 변화량, 최대, 최소의 데이터를 기간 별로 소정의 조건 하에서 추출함으로써 아이템이 생성된다. 이처럼, 사용자의 다양 한 상황과 요구에 따라 시스템 내에서 유연하게 아이템이 설계될 수 있다. 위와 같은 방식으로 생성된 아이템 중에서 출력(반환) 값이 참(true)/거짓(false)인, 즉 소정의 조건을 만족하 는 항목을 선정하는 아이템을 아이디어(idea)라고 지칭할 수 있다. 즉, 앞서 표 15에서 출력 타입으로 참/거짓 을 출력하는 연산자를 기반으로 생성된 아이템은 아이디어로 이용 가능한 아이템에 해당한다. 예를 들어, 주식 시장의 도메인에서는 매수 아이디어와 매도 아이디어를 활용하여 투자 전략이 구성될 수 있다. 즉, 본 개시에서 제안하는 아이템을 기반으로 아이디어를 생성하는 구성을 이용하면 단순 트리(Tree) 구조만을 이용하여 다양한 구독 정보(예를 들어, 투자전략)이 생성될 수 있다. 도 9는 본 개시의 일 실시예에 따른 구독 정보 생성 방법을 예시하는 도면이다. 도 9의 예시는 설명의 편의를 위한 것이며, 본 개시의 범위를 제한하는 것은 아니다. 도 9에서 예시된 일부 단 계(들)은 상황 및/또는 설정에 따라 생략될 수 있다. 또한, 도 9에서 예시된 단계(들)은 도 1에서 예시된 장치 로 구현될 수 있다. 도 9를 참조하면, 구독 정보 생성 장치는 외부 시스템으로부터 수신한 소스 데이터로부터 아이템에 대한 시계열 데이터인 기본 데이터를 생성한다(S901). 즉, 구독 정보 생성 장치는 외부 시스템으로부 터 수신한 소스 데이터로부터 하나 이상의 아이템 각각에 대한 하나 이상의 기본 데이터를 생성할 수 있다. 여기서, 구독 정보 생성 장치는 소정의 시간 간격(예를 들어, 분, 시간, 일, 주, 월, 분기, 년 단위)으로 소스 데이터를 외부 시스템에게 요청함으로써, 소스 데이터를 외부 시스템으로부터 수신할 수 있다. 또한, 구독 정보 생성 장치가 소스 데이터를 요청하는 시간 간격(즉, 소스 데이터를 수시하는 시간 간격) 과 구독 정보 생성 장치가 기본 데이터를 생성하는 시간 간격이 상이할 수 있다. 예를 들어, 구독 정보 생 성 장치는 매일 외부 시스템에게 요청함으로써 소스 데이터를 수신할 수 있다. 다만, 구독 정보 생성 장치 는 주 단위 또는 년 단위의 시계열 데이터인 기본 데이터를 생성할 수 있다. 또한, 구독 정보 생성 장치는 아이템이 생성될 때마다 소스 데이터를 외부 시스템에게 요청함으로써, 소스 데이터를 외부 시스템으로부터 수신할 수 있다. 구독 정보 생성 장치는 기본 데이터로부터 하나 이상의 파라미터를 적용하여 아이템을 생성한다(S902). 구독 정보 생성 장치는 하나 이상의 기본 데이터로부터 (각 기본 데이터에 독립적으로) 하나 이상의 파라 미터를 적용하여 하나 이상의 아이템을 생성할 수 있다. 상술한 바와 같이, 하나 이상의 아이템 각각은 복수의 항목들(예를 들어, 주식 종목)과 해당 항목들 각각에 대응되는 값(예를 들어, 항목 별로 독립된 값 또는 항목과 무관하게 하나의 값)을 가지는 구조일 수 있다. 여기서, 하나 이상의 파라미터는 기본 데이터로부터 아이템 내 각 항목 별로 값을 도출하기 위해 이용될 수 있 다. 하나 이상의 파라미터는 지정 파라미터와 공통 파라미터를 포함할 수 있다. 상술한 바와 같이, 지정 파라미 터는 특정 아이템에만 적용되는 파라미터이며, 아이템에 따라 지정 파라미터의 존재 여부, 개수, 데이터 형식 등이 상이하게 결정될 수 있다. 그리고, 공통 파라미터는 아이템과 무관하게 공통으로 적용되는 파라미터에 해 당할 수 있다. 공통 파라미터는 조건 파라미터와 하나 이상의 범위 지정 파라미터를 포함할 수 있으며, 여기서 조건 파라미터에 따라 하나 이상의 범위 지정 파라미터가 결정될 수 있다. 예를 들어, 앞서 도 4의 예시와 같이, 뉴스 키워드와 관련된 기본 데이터로부터 지정 파라미터를 통해 노출도를 산출하기 위한 대상을 특정 키워드로 한정하고, 공통 파라미터를 통해 해당 특정 키워드(즉, 지정 파라미터)의노출도를 산출하기 위한 시간적 범위를 특정하여 노출도를 산출할 수 있다. 구독 정보 생성 장치는 하나 이상의 자식 아이템 및/또는 소정의 값(들)을 소정의 연산자를 이용해 조합하 여 부모 아이템을 생성하는 과정을 한 번 이상 수행함으로써 최종 아이템을 생성한다(S903). 즉, 앞서 도 5의 예시와 같이 아이템 간의(또는 아이템과 소정의 숫자 또는 날짜 등의 값 간의) 조합은 두 번 이상 계층적으로(즉, 반복하여(recursive)) 수행될 수 있다. 또한, S903 단계의 조합의 대상이 되는 하나 이상의 자식 아이템으로서 다른 조합으로 인하여 생성된 하나 이상 의 부모 아이템 그리고 기본 데이터로부터 생성된 하나 이상의 아이템들이 이용될 수 있다. 즉, 특정 조합으로 생성된 아이템을 다른 아이템과의 조합하여 새로운 아이템이 생성될 수 있다. 또한, 앞서 도 6의 예시와 같이, 조합의 대상이 되는 하나 이상의 자식 아이템의 각 항목 별 값의 형식에 따라, 조합을 위해 이용 가능한 연산자가 결정될 수 있다. 구독 정보 생성 장치는 S903 단계의 조합(들)로 생성된 최종 아이템을 기반으로 구독 정보를 생성한다 (S904). 이후, 구독 정보 생성 장치는 구독을 신청한 하나 이상의 사용자 장치에게 일정한 시간 간격으로 구독 정 보를 주기적으로 전송할 수 있다. 예를 들어, S903 단계에서 조합으로 생성된 최종 아이템을 구성하는 제1 자식 아이템과 제2 자식 아이템 모두 각 투자 자산 별 값의 형식이 참/거짓인 경우, 제1 자식 아이템(즉, 제1 아이디어)은 투자 전략의 매수 조건으 로 설정(이용)되고 및 제2 자식 아이템(즉, 제2 아이디어)은 투자 전략의 매도 조건으로 설정(이용)됨으로써, S903 단계의 조합으로 생성된 최종 아이템이 투자 전략으로 결정될 수 있다. 이후, 어느 하나 이상의 종목이 투자 전략의 매수 조건에 만족하면, 구독 정보 생성 장치는 자산 시장에서 투자 자산의 거래가 가능한 시스템(예를 들어, 증권사의 거래 시스템 등)에 매수 조건을 만족하는 종목에 대한 매수 신호를 전송할 수 있다. 여기서, 매수할 종목 외에 매수 수량/금액 등은 사용자의 선택에 따라 구독 정보 생성 장치 내에 미리 설정될 수 있다. 마찬가지로, 어느 하나 이상의 종목이 투자 전략의 매도 조건에 만 족하면, 구독 정보 생성 장치는 자산 시장에서 투자 자산의 거래가 가능한 시스템에 매도 조건을 만족하는 종목에 대한 매도 신호를 전송할 수 있다. 여기서, 매도할 종목 외에 매도 수량/금액 등은 사용자의 선택에 따 라 구독 정보 생성 장치 내에 미리 설정될 수 있다. 이상에서 설명된 실시예들은 본 개시의 구성요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성요소 또는 특징은 다른 구성요 소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 개시 의 실시예를 구성하는 것도 가능하다. 본 개시의 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 본 개시는 본 개시의 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 당업자에 게 자명하다. 따라서, 상술한 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 개시의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 개시의 등가적 범위 내에서의 모든 변경은 본 개시의 범위에 포함된다. 본 개시의 범위는 다양한 실시예의 방법에 따른 동작이 장치 또는 컴퓨터 상에서 실행되도록 하는 소프트웨어 또는 머신-실행가능한 명령들(예를 들어, 운영체제, 애플리케이션, 펌웨어(firmware), 프로그램 등), 및 이러한 소프트웨어 또는 명령 등이 저장되어 장치 또는 컴퓨터 상에서 실행 가능한 비-일시적 컴퓨터-판독가능 매체 (non-transitory computer-readable medium)를 포함한다. 본 개시에서 설명하는 특징을 수행하는 프로세싱 시 스템을 프로그래밍하기 위해 사용될 수 있는 명령은 저장 매체 또는 컴퓨터 판독가능 저장 매체 상에/내에 저장 될 수 있고, 이러한 저장 매체를 포함하는 컴퓨터 프로그램 제품을 이용하여 본 개시에서 설명하는 특징이 구현 될 수 있다. 저장 매체는 DRAM, SRAM, DDR RAM 또는 다른 랜덤 액세스 솔리드 스테이트 메모리 디바이스와 같은 고속 랜덤 액세스 메모리를 포함할 수 있지만, 이에 제한되지 않으며, 하나 이상의 자기 디스크 저장 디바이스, 광 디스크 저장 장치, 플래시 메모리 디바이스 또는 다른 비-휘발성 솔리드 스테이트 저장 디바이스와 같은 비- 휘발성 메모리를 포함할 수 있다. 메모리는 선택적으로 프로세서(들)로부터 원격에 위치한 하나 이상의 저장 디바이스를 포함한다. 메모리 또는 대안적으로 메모리 내의 비-휘발성 메모리 디바이스(들)는 비-일시적 컴퓨터 판독가능 저장 매체를 포함한다. 본 개시에서 설명하는 특징은, 머신 판독가능 매체 중 임의의 하나에 저장되어 프로세싱 시스템의 하드웨어를 제어할 수 있고, 프로세싱 시스템이 본 개시의 실시예에 따른 결과를 활용하는 다른 메커니즘과 상호작용하도록 하는 소프트웨어 및/또는 펌웨어에 통합될 수 있다. 이러한 소프트웨어 또는 펌웨어는 애플리케이션 코드, 디바이스 드라이버, 운영 체제 및 실행 환경/컨테이너를 포함할 수 있지만 이에 제한되지 않는다. 산업상 이용가능성 본 발명에 따른 구독 정보 생성하는 방법은 다양한 구독 서비스 제공 시스템에 적용하는 것이 가능하다."}
{"patent_id": "10-2022-0069213", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 개시에 대한 실시예를 제공 하고, 상세한 설명과 함께 본 개시의 기술적 특징을 설명한다. 도 1은 본 발명의 일 실시예에 따른 구독 정보 생성 장치가 적용될 수 있는 시스템을 예시하는 도면이다. 도 2는 본 개시의 일 실시예에 따른 소스 데이터를 수집하는 과정을 예시하는 도면이다. 도 3은 본 개시의 일 실시예에 따른 공통 파라미터의 선택을 위한 사용자 인터페이스를 예시한다. 도 4는 본 개시의 일 실시예에 따른 지정 파라미터 및 공통 파라미터의 선택을 위한 사용자 인터페이스를 예시 한다. 도 5는 본 개시의 일 실시예에 따른 복수의 아이템 간의 연산(조합) 구조를 예시하는 도면이다. 도 6는 본 개시의 일 실시예에 따른 연산자 선택을 위한 사용자 인터페이스를 예시한다. 도 7은 본 개시의 일 실시예에 따른 아이템 조합 시 아이템의 역할이 표시되는 사용자 인터페이스를 예시하는 도면이다. 도 8은 본 개시의 일 실시예에 따른 아이템 생성 과정에서의 사용자 인터페이스를 예시하는 도면이다. 도 9는 본 개시의 일 실시예에 따른 구독 정보 생성 방법을 예시하는 도면이다."}
