{"patent_id": "10-2023-0040354", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0145641", "출원번호": "10-2023-0040354", "발명의 명칭": "캐릭터별 라이선스제공장치 및 그 장치의 구동방법", "출원인": "박세원", "발명자": "박세원"}}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "애니메이션 콘텐츠를 제작하는 저작자의 저작자 단말장치 및 상기 애니메이션 콘텐츠에 대한 사용권을 라이선스하는 사용자의 사용자 단말장치와 각각 통신하는 통신 인터페이스부; 및상기 저작자 단말장치와의 계약에 의해 상기 애니메이션 콘텐츠의 캐릭터별 상품화 권한을 블록체인 기반의 디지털 토큰(token) 형태로 상기 사용자 단말장치에 판매하며, 상기 캐릭터별 라이선스 권한을 가진 상기 사용자단말장치로 상기 애니메이션 콘텐츠와 관련한 의사결정 커뮤니티에 참여하도록 권한을 부여하는 제어부;를포함하는 캐릭터별 라이선스제공장치."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 캐릭터별 상품화 권한을 판매할 때 캐릭터의 디자인 수정이 가능한 2차 창작 권한을 포함하여 판매하는, 캐릭터별 라이선스제공장치."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어부는, 상기 캐릭터별 상품화 권한의 타인에 대한 양도를 허용하며, 상기 양도시 상기 저작자 단말장치와 재판매에 대한 수수료를 정산하는, 캐릭터별 라이선스제공장치."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는, 상기 애니메이션 콘텐츠별로 상기 의사결정 커뮤니티를 자동 생성하여 참여 권한을 부여하는,캐릭터별 라이선스제공장치."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는, 웹상의 사회관계망(SNS) 서비스에서 상기 의사결정 커뮤니티를 위한 그룹을 자동 생성하는, 캐릭터별 라이선스제공장치."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "통신 인터페이스부가, 애니메이션 콘텐츠를 제작하는 저작자의 저작자 단말장치 및 상기 애니메이션 콘텐츠에대한 사용권을 라이선스하는 사용자의 사용자 단말장치와 각각 통신하는 단계; 및제어부가, 상기 저작자 단말장치와의 계약에 의해 상기 애니메이션 콘텐츠의 캐릭터별 상품화 권한을 블록체인기반의 디지털 토큰(token) 형태로 상기 사용자 단말장치에 판매하며, 상기 캐릭터별 라이선스 권한을 가진 상기 사용자 단말장치로 상기 애니메이션 콘텐츠와 관련한 의사결정 커뮤니티에 참여하도록 권한을 부여하는단계;를포함하는 캐릭터별 라이선스제공장치의 구동방법."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 판매하는 단계는,공개특허 10-2024-0145641-3-상기 캐릭터별 상품화 권한을 판매할 때 캐릭터의 디자인 수정이 가능한 2차 창작 권한을 포함하여 판매하는,캐릭터별 라이선스제공장치의 구동방법."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 제어부가, 상기 캐릭터별 상품화 권한의 타인에 대한 양도를 허용하며, 상기 양도시 상기 저작자 단말장치와 재판매에 대한 수수료를 정산하는 단계;를 더 포함하는, 캐릭터별 라이선스제공장치의 구동방법."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 권한을 부여하는 단계는,상기 애니메이션 콘텐츠별로 상기 의사결정 커뮤니티를 자동 생성하여 참여 권한을 부여하는, 캐릭터별 라이선스제공장치의 구동방법."}
{"patent_id": "10-2023-0040354", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 권한을 부여하는 단계는,웹상의 사회관계망(SNS) 서비스에서 상기 의사결정 커뮤니티를 위한 그룹을 자동 생성하는 단계를 포함하는, 캐릭터별 라이선스제공장치의 구동방법."}
{"patent_id": "10-2023-0040354", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 캐릭터별 라이선스제공장치 및 그 장치의 구동방법에 관한 것으로서, 본 발명의 실시예에 따른 캐릭터 별 라이선스제공장치는, 애니메이션 콘텐츠를 제작하는 저작자의 저작자 단말장치 및 애니메이션 콘텐츠에 대한 사용권을 라이선스하는 사용자의 사용자 단말장치와 각각 통신하는 통신 인터페이스부, 및 저작자 단말장치와의 계약에 의해 애니메이션 콘텐츠의 캐릭터별 상품화 권한을 블록체인 기반의 디지털 토큰 형태로 사용자 단말장치 에 판매하며, 캐릭터별 라이선스 권한을 가진 사용자 단말장치로 애니메이션 콘텐츠와 관련한 의사결정 커뮤니티 에 참여하도록 권한을 부여하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2023-0040354", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 캐릭터별 라이선스제공장치 및 그 장치의 구동방법에 관한 것으로서, 더 상세하게는 가령 지식재산 (IP) 라이선스 권한을 애니메이션 콘텐츠 속의 캐릭터별로 나누고 이를 해당 캐릭터 콘텐츠로 생성한 NFT(Non- Fungible Token)나 증권형 토큰(STO)과 같은 형태로 판매하는 사업 모델에 관련되는 캐릭터별 라이선스제공장치 및 그 장치의 구동방법에 관한 것이다."}
{"patent_id": "10-2023-0040354", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "캐릭터는 창작됨과 동시에 저작권이 발생하지만, 캐릭터의 가치를 상승시키기 위해서는 캐릭터를 이용하여 다양 한 콘텐츠를 생성하여 배포하는 과정이 필요하고, 저작권자가 단독으로 콘텐츠를 생성할 수 있는 정도에는 한계 가 있기 때문에, 캐릭터의 가치 상승을 위해서는 다양한 콘텐츠 제작자가 관여하는 것이 필요하다. 따라서, 다 양한 콘텐츠 제작자가 캐릭터 가치 상승에 관여할 수 있도록 할 수 있는 기술의 개발이 필요한 실정이다. 최근에는 원저작자의 콘텐츠 보호를 위하여 블록체인이나 NFT 기술이 많이 개발 중에 있으며, 여기서 NFT란 대 체 불가 토큰을 의미한다. 대체 가능 토큰(Fungible Token)이 각기 동일한 가치와 기능을 가지는 것에 반해, 대 체 불가 토큰은 각기 고유성을 지니게 된다. NFT는 암호화된 거래내역을 블록체인에 영구적으로 남김으로써 고 유성을 보장받는다. 아무나 복제할 수 있는 '디지털 파일'에 대해서도 '고유 소유권 내지 사용권'을 발행하는 데에 사용될 수 있는 기술이라는 점이 주목을 받고 있다. 그런데 종래의 블록체인을 접목한 NFT 기술은 원저작자의 소유권을 보호하려는 측면에서는 유용하기는 하지만, 수익 창출을 위한 사용권의 측면에서는 아직 미흡한 부분이 많이 있으며, 따라서 이의 사용권 측면에서 캐릭터 등의 지식재산(IP)을 활성화하기 위한 기술 개발의 필요성이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-2465842호(2022.11.07) (특허문헌 0002) 한국등록특허공보 제10-2343025호(2021.12.21) (특허문헌 0003) 한국등록특허공보 제10-2467706호(2022.11.11) (특허문헌 0004) 한국공개특허공보 제10-2023-0033552호(2023.03.08)"}
{"patent_id": "10-2023-0040354", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 가령 지식재산(IP) 라이선스 권한을 애니메이션 콘텐츠 속의 캐릭터별로 나누고 이를 해당 캐릭터 콘텐츠로 생성한 NFT나 증권형 토큰(STO)과 같은 형태로 판매하는 사업 모델에 관련되는 캐릭터별 라이 선스제공장치 및 그 장치의 구동방법을 제공함에 그 목적이 있다."}
{"patent_id": "10-2023-0040354", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 캐릭터별 라이선스제공장치는, 애니메이션 콘텐츠를 제작하는 저작자의 저작자 단말장 치 및 상기 애니메이션 콘텐츠에 대한 사용권을 라이선스하는 사용자의 사용자 단말장치와 각각 통신하는 통신 인터페이스부, 및 상기 저작자 단말장치와의 계약에 의해 상기 애니메이션 콘텐츠의 캐릭터별 상품화 권한을 블 록체인 기반의 디지털 토큰(token) 형태로 상기 사용자 단말장치에 판매하며, 상기 캐릭터별 라이선스 권한을 가진 상기 사용자 단말장치로 상기 애니메이션 콘텐츠와 관련한 의사결정 커뮤니티에 참여하도록 권한을 부여하 는 제어부를 포함한다. 상기 제어부는, 상기 캐릭터별 상품화 권한을 판매할 때 캐릭터의 디자인 수정이 가능한 2차 창작 권한을 포함 하여 판매할 수 있다. 상기 제어부는, 상기 캐릭터별 상품화 권한의 타인에 대한 양도를 허용하며, 상기 양도시 상기 저작자 단말장치 와 재판매에 대한 수수료를 정산할 수 있다. 상기 제어부는, 상기 애니메이션 콘텐츠별로 상기 의사결정 커뮤니티를 자동 생성하여 참여 권한을 부여할 수 있다. 상기 제어부는, 웹상의 사회관계망(SNS) 서비스에서 상기 의사결정 커뮤니티를 위한 그룹을 자동 생성할 수 있 다. 또한 본 발명의 실시예에 따른 캐릭터별 라이선스제공장치의 구동방법은 통신 인터페이스부가, 애니메이션 콘텐 츠를 제작하는 저작자의 저작자 단말장치 및 상기 애니메이션 콘텐츠에 대한 사용권을 라이선스하는 사용자의 사용자 단말장치와 각각 통신하는 단계, 및 제어부가 상기 저작자 단말장치와의 계약에 의해 상기 애니메이션 콘텐츠의 캐릭터별 상품화 권한을 블록체인 기반의 디지털 토큰 형태로 상기 사용자 단말장치에 판매하며, 상기 캐릭터별 라이선스 권한을 가진 상기 사용자 단말장치로 상기 애니메이션 콘텐츠와 관련한 의사결정 커뮤니티에 참여하도록 권한을 부여하는 단계를 포함한다. 상기 판매하는 단계는, 상기 캐릭터별 상품화 권한을 판매할 때 캐릭터의 디자인 수정이 가능한 2차 창작 권한 을 포함하여 판매할 수 있다. 상기 구동방법은, 상기 제어부가 상기 캐릭터별 상품화 권한의 타인에 대한 양도를 허용하며, 상기 양도시 상기 저작자 단말장치와 재판매에 대한 수수료를 정산하는 단계를 더 포함할 수 있다. 상기 권한을 부여하는 단계는, 상기 애니메이션 콘텐츠별로 상기 의사결정 커뮤니티를 자동 생성하여 참여 권한 을 부여할 수 있다. 상기 권한을 부여하는 단계는, 웹상의 사회관계망(SNS) 서비스에서 상기 의사결정 커뮤니티를 위한 그룹을 자동 생성할 수 있다."}
{"patent_id": "10-2023-0040354", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 가령 애니메이션 콘텐츠 속의 캐릭터별로 나누고 이를 해당 캐릭터 콘텐츠로 생성한 NFT나 STO로 담아 판매함으로써 저작권자와 저작권에 대한 사용권을 갖는 구매자 모두 만족하는 수익 창출을 기대할 수 있을 것이다. 또한 본 발명의 실시예에 따르면 애니메이션 콘텐츠를 단위로 캐릭터 사용권의 구매자들 사이에 커뮤니티를 자 동 형성함으로써 IP와 관련한 주요한 의사결정을 진행할 수 있을 것이다."}
{"patent_id": "10-2023-0040354", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 캐릭터별 라이선스제공 시스템을 나타내는 도면이며, 도 2는 도 1의 시스템에 서 이루어지는 동작을 도식화하여 나타내는 도면이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 캐릭터별 라이선스(제공) 시스템은 사용자 단말장치(혹 은 구매자 단말장치), 저작자 단말장치, 통신망 및 캐릭터별 라이선스(제공)장치의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 저작자 단말장치와 같은 일부 구성요소가 생략되어 캐릭터별 라이선스제공시스템이 구성되거나, 캐릭터별 라이선스제공장치를 구성하는 구성요소의 일부 또는 전부 가 통신망을 구성하는 네트워크장치(예: 무선교환장치 등)에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 사용자 단말장치는 애니메이션 콘텐츠에 포함되는 캐릭터들에 대한 사용권을 얻어 상품을 제작하여 판매하 거나 또는 캐릭터의 디자인을 수정하여 사용하거나, 나아가 구매한 사용권을 타인에게 재판매하여 수익을 창출 하려는 캐릭터 사용권의 구매자 즉 사용자들이 소지하는 단말장치를 포함할 수 있다. 물론, 사용자 단말장치 의 유형은 다양할 수 있다. 사용자 단말장치는 데스크탑컴퓨터, 랩탑컴퓨터 등 PC 기반의 단말장치뿐 아니라 태블릿PC, 스마트폰, 사용자들이 손목 등에 착용하는 웨어러블장치 등 모바일 기반의 단말장치를 포함할 수 있다. 물론 사용자 단말장치는 애니메이션 콘텐츠의 캐릭터들에 대한 사용권을 구매할 때 저작자 단말장치 와 사용권 계약 후에 캐릭터별 라이선스제공장치로부터 소유증명을 위한 NFT나 증권형 토큰(STO)을 발급받 을 수 있으며, 또 NFT나 증권형 토큰(STO)(이하, NFT로 설명함) 기반으로 캐릭터별 라이선스제공장치에 접 속하여 서비스를 이용할 수 있다. 여기서 NFT는 블록체인 기술을 이용해서 디지털 자산의 소유주를 증명하는 가 상의 토큰이다. 그림, 영상 등의 디지털 파일을 가리키는 주소를 토큰 안에 담음으로써 그 고유한 원본성 및 소 유권을 나타내는 용도로 사용된다. 또한 STO는 증권성 있는 권리를 토큰의 형태로 발행하는 것을 의미한다. 즉 사용자 단말장치는 가령 캐릭터별 라이선스제공장치와 또는 그 중개하에 저작자 단말장치의 저 작자와 사용권 계약이 완료되면 자신의 사용권 계약과 관련한 캐릭터 콘텐츠의 소유를 증명할 수 있는 디지털 토큰을 발급받는다고 볼 수 있다. 따라서, 사용자 단말장치는 캐릭터별 라이선스제공장치에서 발급한 토큰을 통해 캐릭터별 라이선스제공장치에 접속하여 캐릭터 콘텐츠를 활용하는 것이 얼마든지 가능할 수 있다. 물론 그러한 사용과 관련해서는 거래내역이 자세하게 기록될 수 있을 것이다. 또한 본 발명의 실시예에 따른 사용자 단말장치는 애니메이션 콘텐츠의 캐릭터들에 대한 사용권을 구매할 때 구매한 사용권을 이용해 캐릭터 콘텐츠를 이용할 수 있는 토큰을 발급받음과 동시에 해당 애니메이션과 관련 하여 형성되는 커뮤니티에 참여할 수 있는 권한을 부여받아 애니메이션 IP 즉 콘텐츠와 관련한 주요한 의사결정 을 진행하는 것도 얼마든지 가능할 수 있다. 예를 들어, NFT 소유자들은 사용자 단말장치를 통해 커뮤니티 에서 의사결정을 진행하여 애니메이션 콘텐츠의 저작권자에 대한 소통을 강화하는 등 다양한 형태로 의사결정이 이루어질 수 있을 것이다. 예를 들어, 저작권자가 기업인 경우에는 로열티 등의 급등이 이루어질 수도 있으므로, 커뮤니티에서의 의사결정은 가격 협상 등의 협상력에 영향을 줄 수 있을 것이다. 또한 커뮤니티에서 는 애니메이션 콘텐츠 내의 캐릭터들에게 가치 창출을 위하여 서로 소통하여 의사를 결정할 수도 있을 것이다.좀더 구체적으로 사용자 단말장치는 애니메이션과 관련한 커뮤니티에 참여할 수 있는 권한을 부여받을 때 메신저 기반의 채팅 채널인 카*오*과 같은 사회관계망(SNS) 등의 단체방에 자동 가입이 이루어지거나 포털 서비 스의 카페와 같은 서비스에 자동 가입되는 것도 얼마든지 가능할 수 있다. 물론 커뮤니티 서비스는 이외에도 다 양한 유형의 채널이 가능하므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 예를 들어, 캐릭터별 라이선스제공장치는 특정 애니메이션 콘텐츠의 캐릭터들에 대한 라이선스(또는 계약, 허가(증))를 판매할 때 최초 구매자의 계약이 완료될 때 최초로 해당 애니메이션 콘텐츠와 관련한 커뮤니티 채 널을 개설할 수 있다. 그리고, 이후에 추가 계약자들이 있을 때 해당 개설한 커뮤니티 채널에 자동 가입시키거 나 소통이 가능한 권한을 부여해 줄 수 있게 되는 것이다. 캐릭터별 사용권을 갖는 사용자 단말장치의 사 용자들은 이와 같은 방식으로 커뮤니티에 참여하는 것이 가능할 수 있다. 저작자 단말장치는 애니메이션 콘텐츠를 제작하는 저작자가 소지하는 단말장치나 제작사의 관계자가 소지 하는 단말장치를 포함한다. 물론, 저작자 단말장치는 사용자 단말장치의 계약 요청 및 캐릭터별 라이 선스제공장치의 중개에 따라 저작권 계약을 수행할 수 있는 단말장치이면 어떠한 장치이어도 무관하다. 가 령 기업의 경우에는 기업에서 운영하는 서버 등을 포함할 수도 있다. 따라서 저작자 단말장치는 사용자 단 말장치의 유형과 크게 다르지 않다. 다시 말해, PC 기반의 단말장치뿐 아니라, 모바일 기반의 단말장치도 얼마든지 가능할 수 있다. 물론 사용자 단말장치도 마찬가지지만 저작자 단말장치는 스마트 TV이어도 무관하다. 저작자 단말장치는 자신의 저작물과 관련한 저작권 계약을 수행할 뿐 아니라, 물론 캐릭터별 라이선스제공 장치에서 저작자의 저작물을 구매하여 판매하는 경우에는 저작자 단말장치의 저작자가 개입할 여지는 없지만, 해당 계약과 관련한 로열티 지급과 관련한 정보들을 캐릭터별 라이선스제공장치로부터 제공받을 수 있다. 물론, 본 발명의 실시예에 따른 서비스는 온라인 플랫폼의 형태로 제공될 수 있으며, 따라서 저작자 단말장치는 서비스 이용을 위한 어플리케이션(이하, 앱)을 앱스토어나 캐릭터별 라이선스제공장치로 부터 다운로드받아 설치할 수 있다. 따라서 저작권 계약이 있는 경우에는 앱을 통해 관련 사실을 통지받아 계약 내용을 확인하고 계약을 진행할 수 있게 되는 것이다. 가령 저작자 단말장치는 자신들이 제작한 애니메이 션의 캐릭터별 라이선스 체결과 관련한 내용을 화면상에서 한눈에 확인해 볼 수 있으며, 또 캐릭터별 수익도 언 제든지 확인해 볼 수 있게 된다. 이의 확인과 관련하여 저작자 단말장치로 제공되는 서비스 화면 즉 사용 자 인터페이스(UI) 화면은 다양하게 구성될 수 있으므로, 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 또한 저작자 단말장치는 라이선스 계약을 진행한 사용자 단말장치의 사용자가 타인과 재판매 계약을 진행한 경우 해당 계약 사실을 캐릭터별 라이선스제공장치로부터 제공받을 수 있으며, 이에 따라 재판매와 관련한 수수료를 지급받는 것도 얼마든지 가능할 수 있다. 예를 들어, 저작자 단말장치는 캐릭터별 라이선 스제공장치의 서비스에 접속한 후 마이페이지(Mypage)에서 라이선스 계약과 관련한 내용을 확인할 수 있으 며, 또 특정 캐릭터를 계약한 항목의 하단에는 사용자의 재판매와 관련한 항목이 생성되어 화면상에 표시되는 것도 얼마든지 가능할 수 있다. 라이선스 계약과 관련한 내용을 확인한 후 특정 캐릭터를 계약한 항목의 선택시 에는 사용자의 다양한 세부정보들이 보여질 수도 있을 것이다. 예를 들어 재판매의 경우에는 수수료의 지급내역 이 보여질 수도 있을 것이다. 물론 이러한 화면은 캐릭터별 라이선스제공장치에서 자동 생성하여 제공하는 것이며, 저작자 단말장치는 캐릭터별 라이선스제공장치의 통지에 따라 화면상에서 그 내용을 확인하 는 등의 동작이 이루어질 수 있을 것이다. 통신망은 다양한 형태로 구성될 수 있다. 통신망은 유무선 통신망을 모두 포함할 수 있다. 가령 통신 망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망 (PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망 은 이에 한정되는 것이 아니며, 향후 구현될 차세대 이동 통신 시스템의 접속망으로서 가령 클라우드 컴퓨 팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가령, 통신망이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데이터를 처리하거나, BTS(Base Transceiver Station), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수도 있다. 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피코(pico) 기지국과 같은 소형 기지국을 포함할 수 있다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분 류상 사용자 단말장치나 저작자 단말장치 등을 최대 몇 대까지 접속할 수 있느냐에 따라 구분될 수있다. 물론 통신망은 사용자 단말장치나 저작자 단말장치 등과 지그비 및 와이파이(Wi-Fi) 등의 근거리 통신을 수행하기 위한 근거리 통신 모듈을 포함할 수 있다. 액세스포인트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근거리 통신은 와이파이 이외에 블루투 스, 지그비, 적외선(IrDA), UHF(Ultra High Frequency) 및 VHF(Very High Frequency)와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스포인트는 데이터 패 킷의 위치를 추출하고, 추출된 위치에 대한 최상의 통신 경로를 지정하며, 지정된 통신 경로를 따라 데이터 패 킷을 다음 장치, 예컨대 캐릭터별 라이선스제공장치로 전달할 수 있다. 액세스포인트는 일반적인 네트워크 환경에서 여러 회선을 공유할 수 있으며, 예컨대 라우터(router), 리피터(repeater) 및 중계기 등이 포함될 수 있다. 캐릭터별 라이선스제공장치는 캐릭터 및 콘텐츠와 그 사업권한을 \"디지털 자산화\"하여 NFT나 STO와 같은 형태로 판매하고 거래되도록 하며 연결된 스마트 컨트랙트 즉 스마트 계약에 의해 소유증명되고 계약의 내용을 담을 수 있도록 동작할 수 있다. 이를 위하여 캐릭터별 라이선스제공장치는 NFT 기반의 애니메이션 캐릭터 별 라이선스 비지니스 모델 즉 프로그램을 구축하고 이를 근거로 사용자 단말장치와 저작자 단말장치(10 5)로 라이선스 서비스를 제공할 수 있다. 애니메이션 IP 기반의 라이선스 비지니스 즉 서비스를 사업 품목별로 기간과 조건을 정한 계약으로 거래시키는 것도 물론 가능하겠지만, 본 발명의 실시예에서는 IP 즉 애니메이션 콘텐츠의 라이선스 권한을 사업품목별보다는 애니메이션 IP 속의 캐릭터별로 나누고 이를 해당 캐릭터 콘텐츠로 생성한 NFT로 담아 판매하는 방식의 서비스를 제공할 수 있다. 이를 통해 가치창출을 증가시킬 수도 있다. 위의 전체 동작은 도 2에서도 잘 보여주고 있다. 다시 말해 본 발명의 실시예에 따른 캐릭터별 라이선스제공장치는 NFT 기술을 활용한 캐릭터별 상품화 권 한 판매 동작을 수행할 수 있다. 좀더 구체적으로 캐릭터별 라이선스제공장치는 해당 캐릭터 NFT를 구매한 사람들 즉 도 1의 사용자 단말장치의 사용자들에게 해당 캐릭터의 디지털 콘텐츠에 대한 액세스를 제공하 며, 독점적이고 포괄적인 권한을 제공하는 것이다. 물론 그 권한은 다양하게 제공될 수 있지만 NFT의 기술적인 특징을 활용하여 캐릭터별로 일체의 상품화 권한과 로열티 납부에 관한 사항을 지정하는 것으로 해당 NFT를 소 유한 사람들은 캐릭터의 이용권한을 다음과 같은 라이선스에 준하는 수준으로 가질 수 있다. 해당 이용권한에는 해당 캐릭터를 활용한 각종 상품화 권한일체, 해당 캐릭터를 활용한 각종 콘텐츠 제작 권한일체, 해당 캐릭터의 디자인 수정 등을 통한 2차 창작 권한 등이 포함될 수 있다. 또한 NFT 구매를 통해 부여받은 사업화 권한의 기 간은 NFT의 보유시까지 영구적으로 가질 수도 있다. 나아가 NFT 보유자는 NFT의 재판매를 통해 일체의 권한 등 을 타인에게 양도할 수도 있다. 단, 재판매시에는 라이선서 즉 저작권자에게 판매 대금의 일부를 수수료로 지급 하도록 동작할 수 있다. 구체적인 시나리오를 보면, 캐릭터별 라이선스제공장치는 도 1의 사용자 단말장치로부터 서비스 요청 이 있을 때 서비스 화면을 제공하며 서비스 화면을 통해 도 1의 저작자 단말장치의 요청에 따른 애니메이 션 콘텐츠의 캐릭터들에 대한 판매를 수행할 수 있다. 이에 따라 사용자 단말장치는 특정 애니메이션 콘텐 츠의 캐릭터에 대한 사용권 구매를 수행할 수 있으며, 이를 통해 저작자 단말장치의 저작자와 계약을 진행 할 수 있다. 물론 계약은 캐릭터별 라이선스제공장치에서 인공지능 챗봇을 이용하는 등 다양한 형태로 진 행시킬 수 있다. 그리고, 캐릭터별 라이선스제공장치는 계약이 완료되면 이에 관련된 데이터를 도 1의 DB(120a)에 체계적으로 분류하여 저장 및 관리할 수 있다. 물론 계약 과정에서 사용자 단말장치의 사용자 는 앞서의 이용권한을 선택하여 계약을 진행할 수 있으며, 또한 모두 포괄하는 형태로 계약을 진행할 수도 있다. 나아가 계약기간을 설정하는 것도 얼마든지 가능하다. 이러한 데이터는 DB(120a)에 저장되어 관리되며 또 한 사용자 단말장치나 저작자 단말장치에서 계약 내용을 보고자 할 때, 가령 온라인 서비스에 로그인 후 마이페이지 항목 등에서 확인하도록 할 수 있다. 물론 캐릭터별 라이선스제공장치는 사용자와 저작자간 계약이 완료되면 사용자 단말장치로 특정 애니 메이션의 캐릭터에 더 정확하게는 해당 캐릭터의 콘텐츠에 접속할 수 있는 토큰을 발급할 수 있으며, 또 애니메 이션과 관련한 캐릭터의 사용권 구매자 또는 NFT 소유자들이 모여있는 커뮤니티에 참여할 수 있는 권한을 부여 할 수 있다. 캐릭터별 라이선스제공장치는 사용권 구매가 있는 사용자의 사용자 단말장치로 캐릭터별 콘텐츠에 접속할 수 있는 토큰을 발급함으로써 NFT 기반으로 서비스를 이용하도록 할 수 있다. 가령 토큰 거래 를 통해 캐릭터 콘텐츠의 사용이 있을 때 그 내역을 기록할 수 있으며, 만약 타인에게 사용권의 재판매가 있는 경우 캐릭터 콘텐츠에 접속할 수 있는 주소를 토큰 가령 복사 토큰이나 새로운 토큰에 함께 발행함으로써 또는 기존의 토큰에서 파생되는 주소를 가진 새로운 토큰을 발행함으로써 재판매가 있는지 확인하는 것도 얼마든지 가능할 수 있다. 물론 본 발명의 실시예에 따른 캐릭터별 라이선스제공장치는 라이선스가 체결된 캐릭터콘텐츠의 재판매가 있을 때 최초 구매자에게 기발행된 토큰을 양수자에게 넘겨줌으로써 소유증명을 변경하는 것 이 바람직하다. 이에 따라 캐릭터별 라이선스제공장치는 소유증명과 관련한 데이터를 수정하고 또 토큰을 넘겨받은 양수자에게 캐릭터 콘텐츠나 계약 내용에의 접속 권한을 허용할 수 있다. 캐릭터별 라이선스제공장치는 NFT 기반으로 동작하면서 물론 블록체인 형태의 동작을 수행하는 것도 얼마 든지 가능하지만, 그러한 기술에 특별히 한정하지는 않을 것이다. 대표적으로 사용자 단말장치에서 계약에 따른 캐릭터 콘텐츠를 이용하고자 할 때 저작자 단말장치의 승인을 받아 사용을 하는 것이 그 예라고 볼 수 있다. 물론 블록체인 기술은 분산 시스템이며 이러한 분산 시스템은 블록체인을 구성하는 복수의 노드 (node)(예: 저작자 단말장치와 캐릭터별 라이선스제공장치 등)에서 합의가 있을 때 트랜잭션 즉 거래가 이루어 지도록 하는 것이고, 또 이를 통해 거래장부를 수정하는 개념이지만, 본 발명의 실시예에서는 저작권자와의 계 약을 진행한 이상 계약 범위 내에서는 캐릭터별 라이선스제공장치에 접속하여 자유롭게 캐릭터 콘텐츠를 이용하도록 하는 것도 얼마든지 가능할 수 있을 것이다. 물론 본 발명의 실시예에 따른 캐릭터별 라이선스제공 장치는 캐릭터별 콘텐츠의 디지털 토큰을 구매한 구매자들의 소유권과 관련한 데이터 즉 계약내용을 분산 저장하고 이를 블록체인 기반으로 관리하는 것이 바람직할 수 있다. 상기한 내용 이외에도 도 1의 사용자 단말장치, 저작자 단말장치 및 캐릭터별 라이선스제공장치(12 0)는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 이후에도 좀더 다루어질 수 있으므로, 그 내용들로 대신하고자 한다. 도 3은 도 1의 캐릭터별 라이선스제공장치의 세부구조를 예시한 블록다이어그램이다. 도 3에 도시된 바와 같이, 본 발명의 실시예에 따른 도 1의 캐릭터별 라이선스제공장치는 통신 인터페이스 부, 제어부, 캐릭터별 라이선스부 및 저장부의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 캐릭터별 라이선스 제공장치가 구성되거나, 캐릭터별 라이선스부와 같은 일부 구성요소가 제어부와 같은 다른 구성 요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 통신 인터페이스부는 도 1의 통신망을 경유하여 사용자 단말장치 및 저작자 단말장치와 각 각 통신한다. 통신을 수행하는 과정에서 통신 인터페이스부는 변/복조, 먹싱/디먹싱, 인코딩/디코딩, 해상 도를 변환하는 스케일링 등의 동작을 수행할 수 있으며, 이는 당업자에게 자명하므로 더 이상의 설명은 생략한 다. 통신 인터페이스부는 가령 저작자 단말장치와의 통신에 의해 저작권을 가진 애니메이션 콘텐츠와 관 련한 캐릭터별 상품화 권한의 판매 정보를 수신할 수 있다. 물론 이를 위하여 저작자 단말장치는 캐릭터별 콘텐츠를 생성하여 제공하는 것도 얼마든지 가능할 수 있다. 통상적으로 생성한 캐릭터별 콘텐츠는 저작자 단말 장치에 저장되거나 또는 저작자가 운영하는 서버 등에 저장될 수 있지만, 도 1의 캐릭터별 라이선스제공장 치에 연결되는 DB(120a)에 저장되어 관리될 수도 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특 별히 한정하지는 않을 것이다. 통신 인터페이스부는 저작자 단말장치의 상품화 권한 판매 요청에 따 라 캐릭터별로 상품화 권한을 판매할 수 있으며, 이의 과정에서 계약을 진행하고, 또 계약에 따른 로열티를 사 용자 단말장치의 사용자로부터 지급받는 등 다양한 형태의 동작을 더 수행할 수 있다. 통신 인터페이스부 는 제어부의 제어하에 이러한 동작에 관여할 수 있다. 나아가 통신 인터페이스부는 사용자 단말장치의 사용자들에게 저작자 단말장치에서 요청한 애니 메이션 콘텐츠의 캐릭터별 라이선스 즉 사용권 판매 및 계약을 진행할 수 있다. 예를 들어, 계약 진행시에는 저 작자 단말장치와 인공지능 챗봇 등을 통해 계약을 진행할 수 있으며, 통신 인터페이스부는 이러한 메 신저 기반의 챗봇 서비스를 제공할 수도 있을 것이다. 뿐만 아니라 통신 인터페이스부는 사용자 단말장치 와의 계약이 완료되면 계약한 캐릭터별 콘텐츠에 접속할 수 있는 토큰을 발행하며 해당 토큰을 통해 사용 자 자신이 계약한 캐릭터별 콘텐츠가 저장된 DB(120a)에 접속할 수 있도록 허용할 수 있다. 다시 말해, NFT 기 반으로 서비스를 이용할 수 있는 것이다. 물론 이의 과정에서 블록체인 기술이 접목되는 경우에는 저작자 단말 장치의 승인을 받아 사용하는 것도 얼마든지 가능하지만, 본 발명의 실시예에서는 블록체인 기술의 접목에 특별히 한정하지는 않을 것이다. 통신 인터페이스부는 이러한 동작에도 관여할 수 있다. 제어부는 도 3의 통신 인터페이스부, 캐릭터별 라이선스부 및 저장부의 전반적인 제어 동 작을 담당한다. 대표적으로 제어부는 도 1의 저작자 단말장치를 사용하는 저작자의 요청에 따라 가령애니메이션 콘텐츠의 캐릭터별 콘텐츠에 대한 상품화 권한 판매를 위한 동작을 수행할 수 있다. 가령 저작자 단 말장치에서 캐릭터별 상품화 권한 판매를 요청할 때 해당 캐릭터가 속하는 애니메이션 콘텐츠에 대한 정보 를 등록하도록 할 수 있으며, 이의 과정에서 진정한 저작권자 여부를 판단할 수 있으며, 이에 따라 생성되는 데 이터를 체계적으로 분류하여 도 1의 DB(120a)에 저장 및 관리되도록 할 수 있다. 물론 제어부는 이러한 동 작을 위하여 캐릭터별 라이선스부에 연계하여 동작할 수 있을 것이다. 다시 말해, 제어부는 캐릭터별 라이선스부에서 저작권자의 애니메이션 콘텐츠의 캐릭터별 콘텐츠에 대한 상품화 권한과 관련한 데이터를 지정 포맷으로 생성하여 DB(120a)에 저장을 요청하면 제어부는 해당 요청에 따라 통신 인터페이스부 의 통신을 제어하여 DB(120a)에 저장시킬 수 있다. 또한, 제어부는 사용자 단말장치에서 계약했던 캐릭터 콘텐츠에 대한 사용을 위하여 토큰을 제공하는 경우 암호화된 해당 토큰의 복호화 데이터를 저장부에 임시 저장할 수 있으며, 복호화 데이터 내의 주소 정보를 근거로 도 1의 DB(120a)에 접속하여 캐릭터 콘텐츠를 추출하여 도 1의 사용자 단말장치로 전송할 수 있다. 물론 제어부는 이러한 사용 내역을 DB(120a)에 체계적으로 저장 및 관리할 수 있으며, 가령 이의 과정에서 저작자 단말장치의 승인을 받아야 하는 경우에는 통신 인터페이스부의 통신을 제어해 저작 자 단말장치와 통신하여 승인을 받을 수 있다. 제어부는 이러한 동작에 관여할 수 있다. 캐릭터별 라이선스부는 가령 NFT 기술을 활용한 캐릭터별 상품화 권한 판매를 위한 동작을 수행할 수 있다. 이를 위하여 캐릭터별 라이선스부는 애니메이션 콘텐츠를 근거로 그 속에 포함되는 캐릭터들에 대한 캐릭터 콘텐츠(또는 이미지)를 저작자 단말장치로부터 제공받거나 또는 직접 캐릭터 이미지를 생성하여 애 니메이션 콘텐츠를 기준으로 다수의 캐릭터에 대한 상품화 권한 판매를 위한 데이터를 생성할 수 있다. 그리고 이러한 데이터는 도 1의 저작자 단말장치의 식별 정보에 매칭시켜 도 1의 DB(120a)에 체계적으로 분류하여 저장시킬 수 있다. 이러한 데이터 저장 동작은 제어부에 요청하여 이루어질 수 있다. 예를 들어, DB(120a)에 저장되는 캐릭터별 상품화 권한 판매와 관련한 데이터는 애니메이션 콘텐츠의 저작자 정 보 가령 저작자 단말장치의 식별정보에 매칭되어 복수의 애니메이션 콘텐츠의 식별정보가 각각 설정될 수 있으며, 또 각각의 애니메이션 콘텐츠에는 그 콘텐츠 내에 포함되는 각각의 캐릭터에 대한 식별정보가 매칭되어 설정될 수 있다. 그리고, 각 캐릭터의 식별정보에는 해당 캐릭터에 대한 사용권자 즉 사용권을 구매한 구매자의 정보가 매칭되어 설정될 수 있다. 또한 사용권자 즉 사용권의 구매자가 타인에게 재판매가 있는 경우에는 해당 캐릭터와 관련한 재판매 정보가 매칭되어 설정될 수 있다. 캐릭터별 라이선스부는 이와 같은 체계를 갖는 데이터를 생성하여 데이터 저장 및 관리를 요청할 수 있는 것이다. 물론 데이터의 수정이나 삭제 등이 있는 경 우에도 캐릭터별 라이선스부는 제어부에 요청하여 해당 데이터를 갱신하도록 할 수 있다. 캐릭터별 라이선스부는 캐릭터 NFT를 구매한 사람들에게 해당 캐릭터의 디지털 콘텐츠에 대한 액세스를 제 공하며 독점적이고 포괄적인 권한을 제공할 수 있다. 예를 들어 캐릭터별 라이선스부는 도 1의 사용자 단 말장치에서 기발급된 토큰을 제공하는 경우 가령 토큰 내 포함되는 주소 정보를 근거로 도 1의 DB(120a)에 접속하여 캐릭터의 디지털 콘텐츠를 스트리밍으로 제공할 수 있다. 또는 지정 포맷으로 저장된 파일을 전송할 수도 있다. 여기서 권한은 계약에 따라 다양한 내용을 포함할 수 있지만, 캐릭터를 활용한 각종 상품화 권한 일 체, 해당 캐릭터를 활용한 각종 콘텐츠 제작 권한 일체, 해당 캐릭터의 디자인 수정 등을 통한 2차 창작 권한 등을 포함할 수 있으며, 물론 권한은 계약 내용에 따라 얼마든지 달라질 수 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 캐릭터별 라이선스부는 캐릭터 및 콘텐츠와 그 사업 권한을 \"디지털 자산화\"하여 NFT나 STO와 같은 형태로 판매하고 거래되도록 하며 연결된 스마트 컨트랙트에 의 해 소유증명되고 계약의 내용을 담을 수 있도록 동작하는 것이 바람직하다. 나아가 캐릭터별 라이선스부는 NFT 소유자의 커뮤니티 참여를 위한 서비스를 제공할 수 있다. NFT 소유자 는 애니메이션 IP의 DAO(Decentralized Autonomous Organization)에 참여할 수 있는 권한을 가지게 되며 캐릭 터별 라이선스부는 커뮤니티 참여를 위한 권한을 부여할 수 있다. 여기서, DAO는 탈중앙화 자율조직을 의 미하며, 하나의 목표를 위해 커뮤니티를 구성하는 수단으로 프로젝트를 운영하는 조직 형태로 블록체인 이전의 기존 조직과는 달리 중앙화된 관리의 주체없이 투명하게 정해진 규칙에 따라 구성원 모두가 자율적으로 공동의 의사 결정에 참여해 하나의 목표를 달성하는 조직의 의미를 갖는다. 물론 해당 커뮤니티는 애니메이션 콘텐츠별 로 권한이 부여될 수 있다. 따라서 NFT 소유자들은 해당 커뮤니티를 통해 특정 애니메이션 콘텐츠의 캐릭터별 사용권과 관련한 다양한 의견을 주고받으면서 IP와 관련된 주요한 의사결정을 진행할 수도 있게 되는 것이다. 의사결정에는 캐릭터별 IP의 가치창출을 위한 내용이 포함될 수도 있을 것이다. 캐릭터별 라이선스부는 애 니메이션 콘텐츠별로 메신저 기반의 채팅 채널을 이용해 그룹방을 개설하거나 온라인 카페 등을 자동 개설할 수 있으며, 이에 따라 개설된 그룹방이나 카페 등에 자동 접속할 수 있도록 하는 방식으로 커뮤니티의 참여 권한을부여할 수 있을 것이다. 저장부는 도 3의 제어부의 제어하에 처리되는 다양한 유형의 데이터를 임시 저장할 수 있다. 저장부 는 예를 들어 도 1의 사용자 단말장치에서 토큰을 제공할 때 해당 토큰의 복호화 데이터를 임시 저장 하여 복호화 데이터 중 주소 정보를 제어부에 제공하는 등의 동작을 수행할 수 있으며, 또 도 1의 DB(120a)로부터 데이터를 제어부의 제어하에 가져와 임시 저장한 후 캐릭터별 라인선스부에 제공할 수 있다. 물론 이러한 동작도 제어부의 제어하에 이루어진다고 볼 수 있다. 이에 따라 캐릭터별 라인선스 부는 해당 데이터를 지정 포맷의 서비스 화면에 삽입하여 사용자 단말장치나 저작자 단말장치로 제공할 수도 있을 것이다. 상기한 내용 이외에도 도 3의 통신 인터페이스부, 제어부, 캐릭터별 라이선스부 및 저장부(33 0)는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고 자 한다. 본 발명의 실시예에 따른 통신 인터페이스부, 제어부, 캐릭터별 라이선스부 및 저장부는 서로 물리적으로 분리된 하드웨어 모듈로 구성되지만, 각 모듈은 내부에 상기의 동작을 수행하기 위한 소프트웨 어를 저장하고 이를 실행할 수 있을 것이다. 다만, 해당 소프트웨어는 소프트웨어 모듈의 집합이고, 각 모듈은 하드웨어로 형성되는 것이 얼마든지 가능하므로 소프트웨어니 하드웨어니 하는 구성에 특별히 한정하지 않을 것 이다. 예를 들어 저장부는 하드웨어인 스토리지(storage) 또는 메모리(memory)일 수 있다. 하지만, 소프트 웨어적으로 정보를 저장(repository)하는 것도 얼마든지 가능하므로 위의 내용에 특별히 한정하지는 않을 것이다. 한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트 정보의 연산 동작을, 그리고 명령어해석부는 인터프리터나 컴 파일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지 스트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 캐릭터별 라이선스제공장치 의 동작 초기에 캐릭터별 라이선스부에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로 딩한 후 이를 실행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 딥러닝 모델 같은 경우 램 (RAM)이 아닌 GPU 메모리에 올라가 GPU를 이용하여 수행 속도를 가속화하여 실행될 수도 있다. 도 4는 도 1의 캐릭터별 라인선스제공장치의 구동과정을 나타내는 흐름도이다. 설명의 편의상 도 4를 도 1과 함께 참조하면, 본 발명의 실시예에 따른 캐릭터별 라인선스제공장치는 애니 메이션 콘텐츠를 제작하는 저작자의 저작자 단말장치 및 애니메이션 콘텐츠에 대한 사용권을 라이선스하는 사용자의 사용자 단말장치와 각각 통신한다(S400). 또한 캐릭터별 라이선스제공장치는 저작자 단말장치와의 계약(여기서, 계약은 서명 등과 같이 문서를 통한 정식 과정을 의미할 수 있음)에 의해 애니메이션 콘텐츠의 캐릭터별 상품화 권한을 블록체인 기반의 디지 털 토큰 형태로 사용자 단말장치에 판매하며, 캐릭터별 라이선스 권한을 가진 사용자의 사용자 단말장치 로 애니메이션 콘텐츠와 관련한 의사결정 커뮤니티에 참여하도록 권한을 부여할 수 있다(S410). 물론 캐릭터별 라이선스제공장치는 캐릭터별 상품화 권한을 사용자 단말장치로 판매하면서 캐릭터별 콘텐츠에 접속할 수 있는 토큰을 발행할 수 있다. 토큰에는 계약이 이루어진 각각의 캐릭터별 콘텐츠나 계약 내 용에 접속할 수 있는 주소 정보를 포함할 수 있으므로 이를 통해 NFT 기술을 구현할 수 있다. 본 발명의 실시예 에서는 단순히 토큰만을 이용할 수 있고, 블록체인 기술을 결합하지 않을 수도 있다. 다양한 형태로 서비스가 이루어질 수 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 예를 들어, 블록체인 기술을 결합하는 경우 캐릭터별 콘텐츠는 저작자의 컴퓨터와 저작자가 운영하는 서버 등의 저작자 단 말장치에 저장되고, 또 캐릭터별 라이선스제공장치의 DB(120a)에도 저장되어 관리될 수 있다. 따라서 사용자 단말장치에서 캐릭터 콘텐츠의 사용을 요청할 때 캐릭터별 라이선스제공장치와 저작자 단말장 치의 승인이 있을 때 사용을 허가함으로써 캐릭터 콘텐츠의 해킹 및 오남용을 방지할 수도 있을 것이다. 그러나, 이러한 오남용보다는 캐릭터별 콘텐츠의 사용내역을 체계적으로 관리하기 위하여 NFT 기술을 구현할 수 도 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 대표적으로 캐릭터별 콘텐츠의 구매자가 타인에게 해당 사용권을 재판매하는 경우가 이에 해당될 수 있다. 이의 경우 계약에 의해 저작권자의 동의가 있다 하더라도 해당 재판매 사실을 저작권자가 알 수 있어야 하고 또 그재판매에 따른 정당한 수수료를 지급받기 위해서는 저작권자가 이러한 일련의 과정을 알 수 있어야 할 필요가 있다. 이러한 점에서 재판매에 따라 발행되는 토큰에는 이의 관련 정보가 자동 생성되므로 이를 통해 캐릭터별 라이선스제공장치는 저작권자에게 해당 사실을 통지하여 수수료 등을 정당하게 정산해 줄 수 있게 될 것이다. 물론 재판매시에는 캐릭터 콘텐츠의 구매자에게 기발행된 토큰의 양도가 이루어져 이를 통해 소유증명이 이 루어질 수도 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 물론 상기한 내용 이외에도 도 1의 캐릭터별 라이선스제공장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모 든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각각 하 나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램 으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일시적 저 장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발 명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다."}
{"patent_id": "10-2023-0040354", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 첨부된 도면을 참조하여 본 발명의 실시예들을 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자는 본 발명의 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정 적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0040354", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 캐릭터별 라이선스제공 시스템을 나타내는 도면, 도 2는 도 1의 시스템에서 이루어지는 동작을 도식화하여 나타내는 도면, 도 3은 도 1의 캐릭터별 라이선스제공장치의 세부구조를 예시한 블록다이어그램, 그리고 도 4는 도 1의 캐릭터별 라인선스제공장치의 구동과정을 나타내는 흐름도이다."}
