{"patent_id": "10-2018-0144164", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0063324", "출원번호": "10-2018-0144164", "발명의 명칭": "고문서 기반 과거 기상 추정 시스템 및 방법", "출원인": "(주)에스이랩", "발명자": "오승준"}}
{"patent_id": "10-2018-0144164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고문서 관련 이미지의 문자를 인식하여 제 1 신경망을 통해 학습하고, 상기 제 1 신경망을 통해 상기 이미지에포함된 하나 이상의 문자 각각을 대상으로 상기 이미지에서 인식한 문자의 상기 이미지상 배치 위치와 문자 패턴을 포함하는 문자 정보를 생성하여 순차 전송하는 문자 인식부;제 2 신경망을 통해 복수의 기상 관련 단어별로 기상 관련 단어를 구성하는 하나 이상의 문자별 문자 패턴 및배열 순서를 학습하고, 상기 제 2 신경망을 통해 상기 문자 인식부로부터 수신되는 상기 복수의 문자 정보 중상기 기상 관련 단어에 대응되는 하나 이상의 문자 정보 각각을 기상 문자 정보로 추출하는 기상 단어 추출부;제 3 신경망을 통해 복수의 기상 유관 단어별로 기상 유관 단어를 구성하는 하나 이상의 문자별 문자 패턴 및상기 기상 유관 단어를 구성하는 문자별 문자 패턴의 상기 기상 문자 정보별 배치 위치를 기준으로 하는 상기이미지상 배치 패턴을 학습하고, 상기 문자 인식부에서 제공되는 상기 복수의 문자 정보와 상기 기상 단어 추출부에서 제공되는 상기 기상 문자 정보를 기초로 상기 제 3 신경망을 통해 상기 복수의 문자 정보 중 상기 배치패턴을 만족하면서 상기 기상 유관 단어에 대응되는 하나 이상의 문자 정보 존재시 상기 하나 이상의 문자 정보각각을 유관 문자 정보로 추출하는 유관 단어 추출부; 및제 4 신경망을 통해 복수의 문자 패턴과 각각 대응되는 복수의 문자와 기상과 관련된 문자별 배치 패턴에 따른의미를 학습하고, 상기 기상 단어 추출부 및 상기 유관 단어 추출부 중 적어도 하나에서 상기 기상 문자 정보및 유관 문자 정보 중 어느 하나에 해당되는 하나 이상의 분석 대상 문자 정보 수신시 상기 제 4 신경망을 통해상기 하나 이상의 분석 대상 문자 정보와 각각 대응되는 하나 이상의 문자를 식별한 후 상기 이미지에 대응되어식별된 상기 하나 이상의 문자의 배치 패턴을 기초로 분석된 의미를 상기 이미지에 대한 기상정보로 출력하는분석부를 포함하는 고문서 기반 과거 기상 추정 시스템."}
{"patent_id": "10-2018-0144164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,제 5 신경망을 통해 상기 기상 단어 추출부 및 유관 단어 추출부와 연동하여 상기 기상 문자 정보 및 유관 문자정보 중 어느 하나로 구성되는 하나 이상의 문자 정보 각각에 포함된 배치 위치를 기초로 기상 연관 배치 패턴을 학습하고, 상기 이미지에 대응되어 상기 기상 단어 추출부 및 유관 단어 추출부 중 적어도 하나로부터 수신되며 상기 기상 문자 정보와 유관 문자 정보 중 어느 하나에 대응되는 하나 이상의 문자 정보 각각에 포함된 배치 위치에 따른 배치 패턴을 기초로 상기 제 5 신경망을 통해 상기 이미지의 기상 연관 여부를 판단하는 패턴분류부를 더 포함하는 것을 특징으로 하는 고문서 기반 과거 기상 추정 시스템."}
{"patent_id": "10-2018-0144164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 분석부는 상기 패턴 분류부와 연동하여 상기 이미지의 기상 연관 여부를 판단하고, 상기 기상 연관 여부에따라 무관한 경우 상기 이미지를 상기 기상 정보 제공 대상에서 제외시키는 것을 특징으로 하는 고문서 기반 과거 기상 추정 시스템."}
{"patent_id": "10-2018-0144164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,공개특허 10-2020-0063324-3-상기 문자 인식부는 상기 이미지에서 인식한 문자별 문자 정보를 상기 분석부로 전송하고,상기 분석부는 상기 제 4 신경망을 통해 상기 하나 이상의 문자 정보와 각각 매칭되는 문자를 식별하고, 미리설정된 알고리즘에 따라 일시와 연관된 문자를 식별한 후 상기 이미지에 대응되는 일시 정보를 생성하여 상기기상 정보에 포함시키는 것을 특징으로 하는 고문서 기반 과거 기상 추정 시스템."}
{"patent_id": "10-2018-0144164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 문자 인식부는 상기 이미지에 대응되는 상기 복수의 문자별 상기 배치 위치에 따라 문자별 순서를 결정하고, 상기 순서에 따라 상기 하나 이상의 문자별 문자 정보를 상기 기상 단어 추출부에 순차 제공하는 것을 특징으로 하는 고문서 기반 과거 기상 추정 시스템."}
{"patent_id": "10-2018-0144164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 유관 단어 추출부는 복수의 서로 다른 이미지 각각에서 추출되는 서로 다른 유관 문자 정보별 출현 빈도를산출하고, 미리 설정된 기준치 이상의 출현 빈도를 가진 유관 문자 정보를 상기 기상 단어 추출부에 상기 기상관련 단어로 입력하여 상기 유관 문자 정보를 상기 기상 관련 단어로 학습시키는 것을 특징으로 하는 고문서 기반 과거 기상 추정 시스템."}
{"patent_id": "10-2018-0144164", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "고문서 관련 이미지를 통해 기상 정보를 제공하는 서비스 제공 장치의 고문서 기반 과거 기상 추정 방법에 있어서,고문서 관련 이미지의 문자를 인식하여 제 1 신경망을 통해 학습하고, 상기 제 1 신경망을 통해 상기 이미지에포함된 하나 이상의 문자 각각을 대상으로 상기 이미지에서 인식한 문자의 상기 이미지상 배치 위치와 문자 패턴을 포함하는 문자 정보를 생성하여 순차 전송하는 단계;제 2 신경망을 통해 복수의 기상 관련 단어별로 기상 관련 단어를 구성하는 하나 이상의 문자별 문자 패턴 및배열 순서를 학습하고, 상기 제 2 신경망을 통해 상기 복수의 문자 정보 중 상기 기상 관련 단어에 대응되는 하나 이상의 문자 정보 각각을 기상 문자 정보로 추출하는 단계;제 3 신경망을 통해 복수의 기상 유관 단어별로 기상 유관 단어를 구성하는 하나 이상의 문자별 문자 패턴 및상기 기상 유관 단어를 구성하는 문자별 문자 패턴의 상기 기상 문자 정보별 배치 위치를 기준으로 하는 상기이미지상 배치 패턴을 학습하고, 상기 복수의 문자 정보와 상기 기상 문자 정보를 기초로 상기 제 3 신경망을통해 상기 복수의 문자 정보 중 상기 배치 패턴을 만족하면서 상기 기상 유관 단어에 대응되는 하나 이상의 문자 정보 존재시 상기 하나 이상의 문자 정보 각각을 유관 문자 정보로 추출하는 단계; 및제 4 신경망을 통해 복수의 문자 패턴과 각각 대응되는 복수의 문자와 기상과 관련된 문자별 배치 패턴에 따른의미를 학습하고, 상기 이미지에 대응되어 상기 제 4 신경망을 통해 상기 기상 문자 정보 및 유관 문자 정보 중어느 하나에 해당되는 하나 이상의 분석 대상 문자 정보와 각각 대응되는 하나 이상의 문자를 식별한 후 상기이미지에 대응되어 식별된 하나 이상의 문자의 배치 패턴을 기초로 분석된 의미를 상기 이미지에 대한 기상정보로 출력하는 단계를 포함하는 고문서 기반 과거 기상 추정 방법."}
{"patent_id": "10-2018-0144164", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 고문서 기반 과거 기상 추정 시스템 및 방법에 관한 것으로서, 더욱 상세히는 고문서 관련 이미지에 기재된 문자를 신경망을 통해 분석하여 해당 고문서에서 기상과 관련된 문자를 추출한 후 이를 기반으로 과거 기 상에 대한 정보를 제공하는 고문서 기반 과거 기상 추정 시스템 및 방법에 관한 것이다. 본 발명은 고문서 관련 (뒷면에 계속)"}
{"patent_id": "10-2018-0144164", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 고문서 기반 과거 기상 추정 시스템 및 방법에 관한 것으로서, 더욱 상세히는 고문서 관련 이미지에 기재된 문자를 신경망을 통해 분석하여 해당 고문서에서 기상과 관련된 문자를 추출한 후 이를 기반으로 과거 기상에 대한 정보를 제공하는 고문서 기반 과거 기상 추정 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0144164", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 고문서는 역사학에서 설명하는 사실을 증명하기 위한 용도로서 활용되어 왔으나, 최근 고문서에 대 한 연구가 활발해지면서 언어, 법제, 사회경제 등과 같은 다양한 분야로 활용 범위가 확대되고 있다. 이러한 고문서의 분석은 역사학적 사실을 기반으로 현대에서 발생하는 다양한 현상 및 문제를 해결할 수 있는데 도움이 될 수 있으며, 교육자료로서의 가치 역시 상당한 이점이 있다. 그러나, 고문서에 접근할 수 있는 분야가 고문서의 해석에 익숙한 인문학 분야로 한정되어 있어 기존의 고문서 활용 사례는 대부분 인문학에 치중되어 있으므로, 이로 인해 고문서를 이용한 과거의 기상 분석을 통해 기상 변 화에 따른 다양한 과학적 사실을 도출할 수 있을 뿐만 아니라 교육 자료로서 활용 가능한 이점을 충분히 이끌어 낼 수 있음에도 불구하고 이에 대한 연구가 활발하지 않은 실정이다. 따라서, 고문서의 분석을 통해 과거의 기상 사례를 분석하고 이를 통해 기상 변화와 관련된 과학적 사실을 도출 하는 동시에 교육 자료로서의 활용이 가능하도록 고문서의 기상 관련 해석에 용이하게 접근 가능하도록 지원하 기 위한 시스템 개발이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2015-0085313호"}
{"patent_id": "10-2018-0144164", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 고문서의 문자를 신경망을 통해 분석하여 기상 관련 문자와 기상 유관 문자를 식별하고, 상기 기상 관련 문자와 기상 유관 문자의 배치에 따른 해석을 통해 과거 기상 정보를 획득하여 제공하는데 그 목적이 있다."}
{"patent_id": "10-2018-0144164", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 고문서 기반 과거 기상 추정 시스템은 고문서 관련 이미지의 문자를 인식하여 제 1 신 경망을 통해 학습하고, 상기 제 1 신경망을 통해 상기 이미지에 포함된 하나 이상의 문자 각각을 대상으로 상기 이미지에서 인식한 문자의 상기 이미지상 배치 위치와 문자 패턴을 포함하는 문자 정보를 생성하여 순차 전송하 는 문자 인식부와, 제 2 신경망을 통해 복수의 기상 관련 단어별로 기상 관련 단어를 구성하는 하나 이상의 문 자별 문자 패턴 및 배열 순서를 학습하고, 상기 제 2 신경망을 통해 상기 문자 인식부로부터 수신되는 상기 복 수의 문자 정보 중 상기 기상 관련 단어에 대응되는 하나 이상의 문자 정보 각각을 기상 문자 정보로 추출하는 기상 단어 추출부와, 제 3 신경망을 통해 복수의 기상 유관 단어별로 기상 유관 단어를 구성하는 하나 이상의 문자별 문자 패턴 및 상기 기상 유관 단어를 구성하는 문자별 문자 패턴의 상기 기상 문자 정보별 배치 위치를 기준으로 하는 상기 이미지상 배치 패턴을 학습하고, 상기 문자 인식부에서 제공되는 상기 복수의 문자 정보와 상기 기상 단어 추출부에서 제공되는 상기 기상 문자 정보를 기초로 상기 제 3 신경망을 통해 상기 복수의 문자 정보 중 상기 배치 패턴을 만족하면서 상기 기상 유관 단어에 대응되는 하나 이상의 문자 정보 존재시 상기 하 나 이상의 문자 정보 각각을 유관 문자 정보로 추출하는 유관 단어 추출부 및 제 4 신경망을 통해 복수의 문자 패턴과 각각 대응되는 복수의 문자와 기상과 관련된 문자별 배치 패턴에 따른 의미를 학습하고, 상기 기상 단어 추출부 및 상기 유관 단어 추출부 중 적어도 하나에서 상기 기상 문자 정보 및 유관 문자 정보 중 어느 하나에 해당되는 하나 이상의 분석 대상 문자 정보 수신시 상기 제 4 신경망을 통해 상기 하나 이상의 분석 대상 문자 정보와 각각 대응되는 하나 이상의 문자를 식별한 후 상기 이미지에 대응되어 식별된 상기 하나 이상의 문자의 배치 패턴을 기초로 분석된 의미를 상기 이미지에 대한 기상정보로 출력하는 분석부를 포함할 수 있다. 본 발명과 관련된 일 예로서, 제 5 신경망을 통해 상기 기상 단어 추출부 및 유관 단어 추출부와 연동하여 상기 기상 문자 정보 및 유관 문자 정보 중 어느 하나로 구성되는 하나 이상의 문자 정보 각각에 포함된 배치 위치를 기초로 기상 연관 배치 패턴을 학습하고, 상기 이미지에 대응되어 상기 기상 단어 추출부 및 유관 단어 추출부 중 적어도 하나로부터 수신되며 상기 기상 문자 정보와 유관 문자 정보 중 어느 하나에 대응되는 하나 이상의 문자 정보 각각에 포함된 배치 위치에 따른 배치 패턴을 기초로 상기 제 5 신경망을 통해 상기 이미지의 기상 연관 여부를 판단하는 패턴 분류부를 더 포함하는 것을 특징으로 할 수 있다. 본 발명과 관련된 일 예로서, 상기 분석부는 상기 패턴 분류부와 연동하여 상기 이미지의 기상 연관 여부를 판 단하고, 상기 기상 연관 여부에 따라 무관한 경우 상기 이미지를 상기 기상 정보 제공 대상에서 제외시키는 것 을 특징으로 할 수 있다. 본 발명과 관련된 일 예로서, 상기 문자 인식부는 상기 이미지에서 인식한 문자별 문자 정보를 상기 분석부로 전송하고, 상기 분석부는 상기 제 4 신경망을 통해 상기 하나 이상의 문자 정보와 각각 매칭되는 문자를 식별하 고, 미리 설정된 알고리즘에 따라 일시와 연관된 문자를 식별한 후 상기 이미지에 대응되는 일시 정보를 생성하 여 상기 기상 정보에 포함시키는 것을 특징으로 할 수 있다. 본 발명과 관련된 일 예로서, 상기 문자 인식부는 상기 이미지에 대응되는 상기 복수의 문자별 상기 배치 위치 에 따라 문자별 순서를 결정하고, 상기 순서에 따라 상기 하나 이상의 문자별 문자 정보를 상기 기상 단어 추출 부에 순차 제공하는 것을 특징으로 할 수 있다. 본 발명과 관련된 일 예로서, 상기 유관 단어 추출부는 복수의 서로 다른 이미지 각각에서 추출되는 서로 다른 유관 문자 정보별 출현 빈도를 산출하고, 미리 설정된 기준치 이상의 출현 빈도를 가진 유관 문자 정보를 상기 기상 단어 추출부에 상기 기상 관련 단어로 입력하여 상기 유관 문자 정보를 상기 기상 관련 단어로 학습시키는 것을 특징으로 할 수 있다. 본 발명의 실시예에 따른 고문서 관련 이미지를 통해 기상 정보를 제공하는 서비스 제공 장치의 고문서 기반 과 거 기상 추정 방법은, 고문서 관련 이미지의 문자를 인식하여 제 1 신경망을 통해 학습하고, 상기 제 1 신경망 을 통해 상기 이미지에 포함된 하나 이상의 문자 각각을 대상으로 상기 이미지에서 인식한 문자의 상기 이미지 상 배치 위치와 문자 패턴을 포함하는 문자 정보를 생성하여 순차 전송하는 단계와, 제 2 신경망을 통해 복수의 기상 관련 단어별로 기상 관련 단어를 구성하는 하나 이상의 문자별 문자 패턴 및 배열 순서를 학습하고, 상기 제 2 신경망을 통해 상기 복수의 문자 정보 중 상기 기상 관련 단어에 대응되는 하나 이상의 문자 정보 각각을 기상 문자 정보로 추출하는 단계와, 제 3 신경망을 통해 복수의 기상 유관 단어별로 기상 유관 단어를 구성하는 하나 이상의 문자별 문자 패턴 및 상기 기상 유관 단어를 구성하는 문자별 문자 패턴의 상기 기상 문자 정보별 배치 위치를 기준으로 하는 상기 이미지상 배치 패턴을 학습하고, 상기 복수의 문자 정보와 상기 기상 문자 정 보를 기초로 상기 제 3 신경망을 통해 상기 복수의 문자 정보 중 상기 배치 패턴을 만족하면서 상기 기상 유관 단어에 대응되는 하나 이상의 문자 정보 존재시 상기 하나 이상의 문자 정보 각각을 유관 문자 정보로 추출하는 단계 및 제 4 신경망을 통해 복수의 문자 패턴과 각각 대응되는 복수의 문자와 기상과 관련된 문자별 배치 패턴 에 따른 의미를 학습하고, 상기 이미지에 대응되어 상기 제 4 신경망을 통해 상기 기상 문자 정보 및 유관 문자 정보 중 어느 하나에 해당되는 하나 이상의 분석 대상 문자 정보와 각각 대응되는 하나 이상의 문자를 식별한 후 상기 이미지에 대응되어 식별된 하나 이상의 문자의 배치 패턴을 기초로 분석된 의미를 상기 이미지에 대한 기상정보로 출력하는 단계를 포함할 수 있다."}
{"patent_id": "10-2018-0144164", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 고문서 관련 하나 이상의 이미지를 인공지능 기반 복수의 신경망을 통해 분석하여 상기 이미지에 포 함된 고문서 관련 문자를 인식하고 이미지에 포함된 복수의 문자 중에서 기상과 관련된 문자를 추출하며, 상기 기상과 관련되어 추출된 하나 이상의 문자를 기반으로 고문서에 기재된 시대의 기상을 추정할 수 있도록 기상 정보를 제공함으로써, 과거 시대부터 현재까지 이어져온 기상 및 기후 변화를 토대로 미래 기상을 예측하도록 하는 과학적 자료로서의 가치와 더불어 과거 기상 정보를 토대로 역사적 사실과의 연관성을 규명할 수 있도록 지원하는 교육 자료로서의 가치가 있는 기상 정보를 제공하는 효과가 있다. 또한, 본 발명은 고문서에서 기재된 시대별 기상 관련 정보를 제공하기 위해 고문서 관련 이미지에 표시된 문자 를 신경망을 통해 지속적으로 학습하는 동시에 기상 상태를 의미하는 기상 관련 단어와 해당 기상 관련 단어와 의 조합에 따라 기상을 의미하는 기상 유관 단어 및 기상 상태를 나타내는 기상 관련 단어와 기상 유관 단어의 배치 패턴을 학습하여 고문서 관련 이미지에서 기상 관련 정보를 정확하게 추출하고 이에 따라 시대별 기상 상 황에 대한 정보를 신뢰성 있게 제공할 수 있는 효과가 있다."}
{"patent_id": "10-2018-0144164", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참고하여 본 발명의 상세 실시예를 설명한다. 도 1은 본 발명의 실시예에 따른 고문서 기반 과거 기상 추정 시스템의 구성도로서, 도시된 바와 같이, 상기 고 문서 기반 과거 기상 추정 시스템은 문자 인식부와, 기상 단어 추출부와, 유관 단어 추출부와, 분석부 및 패턴 분류부를 포함하여 구성될 수 있다. 이때, 상기 고문서 기반 과거 기상 추정 시스템은 단일 서비스 제공 장치로 구성될 수 있으며, 상기 서비 스 제공 장치에 상기 문자 인식부, 상기 기상 단어 추출부, 상기 유관 단어 추출부, 상기 분석부 및 상기 패턴 분류부가 포함되어 구성될 수 있다. 또한, 상기 서비스 제공 장치는 서버로 구성될 수 있으며, 이때 상기 분석부는 상기 서비스 제공 장 치의 전반적인 제어 기능을 수행하며 상기 서비스 제공 장치의 각 구성부를 제어하는 제어부로서 구 성될 수 있다. 이때, 상기 제어부는 RAM, ROM, CPU, GPU, 버스를 포함할 수 있으며, RAM, ROM, CPU, GPU 등은 버스를 통해 서로 연결될 수 있다. 또한, 상기 문자 인식부, 상기 기상 단어 추출부, 상기 유관 단어 추출부, 상기 분석부 및 상기 패턴 분류부가 각각 개별 서버로 구성될 수 있으며, 상기 문자 인식부, 상기 기상 단어 추출부 , 상기 유관 단어 추출부, 상기 분석부 및 상기 패턴 분류부 상호 간 통신망을 통해 연결 되어 상기 고문서 기반 과거 기상 추정 시스템을 구성할 수도 있다. 이때, 상기 통신망은 널리 알려진 다양한 유무선 통신 방식이 적용될 수 있다. 이하에서는 서비스 제공 장치를 기준으로 설명하나, 이에 한정되지 않고 상술한 바와 같이 상기 문자 인식 부, 상기 기상 단어 추출부, 상기 유관 단어 추출부, 상기 분석부 및 상기 패턴 분류부 가 각각 통신망을 통해 상호 통신하는 개별 서버로 구성되어 상기 서비스 제공 장치가 구현하는 다양 한 실시예를 구현할 수 있음은 물론이다. 상술한 구성을 토대로, 본 발명은 고문서 관련 하나 이상의 이미지를 서비스 제공 장치에서 수신하여 상기 서비스 제공 장치에 구성된 인공지능 기반 복수의 신경망을 통해 상기 이미지에 포함된 고문서 관련 문자 를 인식하고 이미지에 포함된 복수의 문자 중에서 기상과 관련된 문자를 추출하며, 상기 기상과 관련되어 추출 된 하나 이상의 문자를 기반으로 고문서에 기재된 시대의 기상을 추정할 수 있도록 기상 정보를 제공함으로써, 과거 시대부터 현재까지 이어져온 기후변화를 토대로 미래 기상을 예측하도록 하는 과학적 자료로서의 가치와 더불어 과거 기상 정보를 토대로 역사적 사실과의 연관성을 규명할 수 있도록 지원하는 교육 자료로서의 가치를 가진 기상 정보를 제공할 수 있는데 이를 이하 도면을 통해 상세히 설명한다. 설명에 앞서, 본 발명에서 설명하는 기상은 날씨, 온도, 습도 등과 같은 대기 상태 뿐만 아니라 지진, 홍수 등 과 같은 자연 현상을 포함할 수 있다. 우선, 도 2는 상술한 구성에 따른 문자 인식부의 동작 예시도로서, 도시된 바와 같이 문자 인식부는 인공지능 기반의 제 1 신경망을 포함하여 구성될 수 있다.이때, 상기 제 1 신경망은 CNN(Convolutional Neural Network) 기반의 입력층(Input Layer), 하나 이상의 은닉 층(Hidden Layers) 및 출력층(Output Layer)으로 구성된 딥러닝(Deep Learning) 알고리즘으로 구성될 수 있다. 또한, 상기 문자 인식부는 외부로부터 고문서 관련 하나 이상의 이미지를 수신하고, 상기 제 1 신경망을 통해 상기 하나 이상의 이미지 각각에서 문자를 인식하여 상기 제 1 신경망에 학습시킬 수 있으며, 이를 통해 상기 문자 인식부는 상기 제 1 신경망을 통해 고문서 관련 이미지의 문자를 인식하여 학습할 수 있다. 이때, 상기 문자 인식부는 상기 이미지에 나타난 문자별로 문자 패턴을 학습할 수 있다. 또한, 본 발명에서 설명하는 문자 패턴은 상기 문자 인식부에 구성되는 상기 제 1 신경망의 입력층에 구성 된 영상 분석 알고리즘을 통해 생성되는 문자의 특징 정보(일례로, 특징 벡터, 특징점 분포 등)를 의미할 수 있 다. 또한, 상기 문자 인식부는 상기 고문서를 구성하는 하나 이상의 이미지 중 기상 정보의 생성 대상인 분석 대상 이미지를 수신할 수 있다. 이때, 상기 문자 인식부는 외부 단말로부터 상기 분석 대상 이미지를 수신하거나 상기 서비스 제공 장치 에 포함되며 하나 이상의 고문서 관련 복수의 이미지가 저장된 고문서 DB로부터 상기 분석 대상 이미 지를 수신할 수도 있다. 또한, 상기 문자 인식부는 상기 제 1 신경망을 통해 상기 분석 대상 이미지에 포함된 문자를 인식하고, 상 기 문자별 문자 패턴이 학습된 상기 제 1 신경망을 기초로 상기 분석 대상 이미지에 포함된 문자별로 문자의 문 자 패턴과 문자의 이미지상 배치 위치를 포함하는 문자 정보를 생성할 수 있다. 또한, 상기 문자 인식부는 상기 분석 대상 이미지에 포함된 복수의 문자별로 문자 정보를 생성하고, 이에 따른 복수의 문자 정보를 상기 기상 단어 추출부에 제공할 수 있다. 이때, 상기 문자 인식부는 분석 대상 이미지에 포함된 복수의 문자와 각각 대응되는 복수의 문자 정보 각 각에 포함된 이미지상 배치 위치를 기초로 상기 복수의 문자 각각의 순서를 결정하고, 해당 순서에 따라 상기 복수의 문자 정보를 순차적으로 상기 기상 단어 추출부에 제공(전송)할 수 있다. 여기서, 상기 문자 인식부는 미리 설정된 상기 고문서의 쓰기 방향 및 문자 시작 위치에 대응되어 상기 복 수의 문자 각각의 순서를 결정할 수 있다. 도 3은 상술한 구성에 따른 기상 단어 추출부의 동작 예시도로서, 도시된 바와 같이, 상기 기상 단어 추출 부는 상기 문자 인식부로부터 분석 대상 이미지와 관련된 복수의 문자 정보를 순차 수신할 수 있다. 또한, 상기 기상 단어 추출부는 인공지능 기반의 제 2 신경망을 포함하여 구성될 수 있으며, 상기 문자 인 식부로부터 고문서 관련 복수의 서로 다른 이미지 각각에 대해 수신되는 복수의 문자 정보를 상기 제 2 신 경망에 적용하여, 기상 상태를 나타내는(의미하는) 기상 관련 단어(또는 기상 의미 단어)를 구분하기 위해 복수 의 서로 다른 기상 관련 단어별로 기상 관련 단어를 구성하는 하나 이상의 문자별 문자 패턴 및 배열 순서를 상 기 제 2 신경망에 학습시킬 수 있다. 이를 통해, 상기 기상 단어 추출부는 상기 제 2 신경망을 통해 복수 의 기상 관련 단어별로 기상 관련 단어를 구성하는 하나 이상의 문자별 문자 패턴 및 배열 순서를 학습할 수 있 다. 일례로, 상기 기상 단어 추출부는 雷(천둥), 雨(비), 旱(가뭄) 등과 같이 기상 상태를 나타내는 1자의 문 자로 구성된 단어 이외에, 得雨(비가 내림), 天久不雨(오래 비가 내리지 않음) 등과 같이 복수의 문자로 구성되 어 고문서에 기재된 당시의 기상 상태를 나타내기 위한 용어로 사용되는 단어 등을 기상 관련 단어로 상기 제 2 신경망에 학습시키고, 상기 기상 관련 단어를 구성하는 복수의 문자 각각에 대한 문자 패턴과 기상 관련 단어를 구성하는 하나 이상의 문자의 배열순서에 따른 문자 패턴의 배열 순서를 상기 제 2 신경망에 학습시킬 수 있다. 이때, 제 2 신경망은 상기 제 1 신경망과 마찬가지로 상기 CNN 기반의 입력층, 하나 이상의 은닉층 및 출력층으 로 구성될 수 있으며, 상기 기상 단어 추출부는 상기 기상 관련 단어의 구분을 위한 학습 과정에서 상기 제 2 신경망을 구성하는 입력층, 하나 이상의 은닉층 및 출력층 사이의 연결 강도에 대한 가중치(weight) 및 상 기 입력층, 은닉층 및 출력층에 구성된 유닛의 바이어스(bias)를 가변시킬 수 있다. 이에 따라, 상기 기상 단어 추출부는 상기 기상 관련 단어별로 기상 관련 단어를 구성하는 하나 이상의 문 자별 문자 패턴 및 상기 문자 패턴별 배열 순서가 학습된 상기 제 2 신경망을 통해 상기 문자 인식부로부 터 상기 분석 대상 이미지에 대응되어 수신되는 복수의 문자 정보 중 기상 관련 단어에 대응되는 하나 이상의문자 정보 각각을 기상 문자 정보로서 추출할 수 있다. 또한, 상기 기상 단어 추출부는 상기 복수의 문자 정보 중 상기 제 2 신경망을 통해 추출된 문자 정보인 하나 이상의 기상 문자 정보를 상기 유관 단어 추출부로 제공(전송)할 수 있다. 한편, 도 4는 상술한 구성에 따른 유관 단어 추출부의 동작 예시도로서, 도시된 바와 같이, 상기 유관 단 어 추출부는 인공지능 기반 제 3 신경망을 포함하여 구성될 수 있다. 또한, 상기 유관 단어 추출부는 상기 문자 인식부로부터 고문서 관련 복수의 서로 다른 이미지 각각 에 대해 복수의 문자 정보를 수신할 수 있으며, 고문서 관련 복수의 이미지 각각에 대해 상기 문자 인식부(11 0)로부터 수신되는 복수의 문자 정보와 상기 기상 단어 추출부로부터 수신되는 하나 이상의 기상 문자 정 보를 상기 제 3 신경망에 적용할 수 있다. 이에 따라, 상기 유관 단어 추출부는 상기 제 3 신경망을 통해 복수의 이미지 중 특정 이미지에 대응되어 상기 문자 인식부로부터 수신된 복수의 문자 정보 중 상기 기상 문자 정보를 제외한 나머지 문자 정보를 대상으로 기상 관련 단어와의 고문서 상 배치 상태(또는 배치 패턴 또는 연결 관계)에 따라 기상 상태를 나타내 는(의미하는) 기상 유관 단어를 구분하기 위해 특정 기상 유관 단어를 구성하는 하나 이상의 문자별 문자 패턴 을 상기 제 3 신경망에 학습시킬 수 있으며, 상기 특정 이미지에 대응되어 상기 기상 단어 추출부로부터 수신된 상기 기상 문자 정보별 배치 위치를 기준으로 하는 특정 기상 유관 단어를 구성하는 문자별 문자 패턴의 상기 이미지상 배치 패턴을 상기 제 3 신경망에 학습시킬 수 있다. 이를 통해, 상기 유관 단어 추출부는 고문서 관련 복수의 이미지별로 상기 문자 인식부로부터 수신되 는 복수의 문자 정보와 상기 기상 단어 추출부로부터 수신되는 하나 이상의 기상 문자 정보를 상술한 바와 같이 상기 제 3 신경망에 적용하여 복수의 서로 다른 기상 유관 단어별로 상기 기상 유관 단어를 구성하는 하나 이상의 문자별 문자 패턴 및 상기 기상 문자 정보별 배치 위치에 따른 상기 기상 유관 단어를 구성하는 문자별 문자 패턴의 상기 이미지상 배치 패턴을 상기 제 3 신경망에 학습시킬 수 있다. 즉, 상기 유관 단어 추출부는 추출부는 상기 제 3 신경망을 통해 복수의 기상 유관 단어별로 기상 유관 단 어를 구성하는 하나 이상의 문자별 문자 패턴 및 상기 기상 유관 단어를 구성하는 문자별 문자 패턴의 상기 기 상 문자 정보별 배치 위치를 기준으로 하는 상기 이미지상 배치 패턴을 학습할 수 있다. 일례로, 상기 유관 단어 추출부는 \"水\", \"熱\" 등과 같이 기상 관련 단어와의 배치에 따라 기상(기상 상 태)을 나타내는 단어로서 쓰일 수 있으면서도 다른 의미로 해석될 수 있는 1자의 문자로 구성된 중의적 단어 이 외에, 고문서 상에서 문자 배치가 \"雷雨..(중략)..大至願\"(천둥과 비가 크게 내리다)과 같은 경우에 있어서 \"大 至願\" 등과 같이 기상(기상 상태)을 나타내는 단어(일례로, 상기 \"雷雨\")와 결합시에 기상(기상 상태)을 나타내 는 의미로 사용되나 다른 단어와 결합시 다른 의미를 가질 수 있는 복수의 문자로 구성된 중의적 단어를 상기 기상 유관 단어로 상기 제 3 신경망에 학습시키고, 상기 기상 유관 단어의 기상과의 연관 여부를 상기 제 3 신 경망에서 판단할 수 있도록 고문서에서 상기 기상 유관 단어를 기상 상태를 표현하기 위한 의미로 사용할 때 상 기 기상 유관 단어가 포함된 이미지에서 기상 관련 단어의 이미지상 배치 위치를 기준으로 상기 기상 유관 단어 의 상기 기상 관련 단어에 대한 상대적 위치인 배치 패턴을 지속적으로 학습시켜 상기 제 3 신경망이 상기 기상 유관 단어를 구분할 수 있도록 학습시킬 수 있다. 이때, 제 3 신경망은 상기 제 1 및 제 2 신경망과 마찬가지로 CNN 기반의 입력층, 하나 이상의 은닉층 및 출력 층으로 구성될 수 있으며, 상기 유관 단어 추출부는 상기 기상 유관 단어의 구분을 위한 학습 과정에서 상 기 제 3 신경망은 입력층, 하나 이상의 은닉층 및 출력층 사이의 연결 강도에 대한 가중치(weight) 및 상기 입 력층, 은닉층 및 출력층에 구성된 유닛의 바이어스(bias)를 가변시킬 수 있다. 상술한 구성에 따라, 상기 유관 단어 추출부는 상기 제 3 신경망을 통해 상기 분석 대상 이미지에 대응되 어 상기 문자 인식부로부터 수신되는 상기 복수의 문자 정보와 상기 분석 대상 이미지에 대응되어 상기 기 상 단어 추출부에서 제공되는 기상 문자 정보를 기초로 상기 문자 인식부로부터 수신된 상기 복수의 문자 정보 중 상기 배치 패턴을 만족하는 상기 기상 유관 단어에 대응되는 하나 이상의 문자 정보 각각을 유관 문자 정보로서 추출할 수 있다. 또한, 상기 유관 단어 추출부는 상기 분석 대상 이미지에 대응되어 추출된 유관 문자 정보를 상기 분석부 에 제공할 수 있다. 한편, 도 5는 상술한 구성에 따른 분석부의 동작 예시도로서, 도시된 바와 같이, 상기 분석부는 인공 지능 기반 제 4 신경망을 포함하여 구성될 수 있다. 이때, 제 4 신경망은 상기 제 1 내지 제 3 신경망과 마찬가지로 CNN 기반의 입력층, 하나 이상의 은닉층 및 출 력층으로 구성될 수 있다. 또한, 상기 분석부는 상기 문자 인식부로부터 복수의 문자 정보를 수신할 수 있으며, 기상 관련 단어 별 의미정보 및 기상 유관 단어별 의미정보가 저장된 기상 단어 DB를 포함하여 구성될 수 있다. 이때, 상기 의미 정보는 기상과 관련된 특정 단어(기상 관련 단어 및 기상 유관 단어 포함)의 의미 관련 정보 이외에 상기 기상과 관련된 특정 단어를 구성하는 하나 이상의 문자별 문자 패턴 및 배열 순서가 포함될 수 있 다. 이에 따라, 상기 분석부는 상기 문자 인식부로부터 수신되는 복수의 문자 정보와 상기 기상 단어 DB에 저장된 기상과 관련되는 단어별 의미정보를 기초로 상기 제 4 신경망을 통해 상기 복수의 문자 정보 에 따른 복수의 문자 패턴과 각각 대응되는 복수의 문자 및 기상과 관련된 문자별 배치 패턴에 따른 의미를 상 기 제 4 신경망에 학습시킬 수 있으며, 이를 통해 상기 분석부는 상기 제 4 신경망을 통해 복수의 문자 패 턴과 각각 대응되는 복수의 문자 및 기상과 관련된 문자별 배치 패턴에 따른 의미를 학습할 수 있다. 상술한 구성에 따라, 상기 분석부는 상기 분석 대상 이미지에 대응되어 상기 기상 단어 추출부 및 상 기 유관 단어 추출부 중 적어도 하나에서 각각이 상기 기상 문자 정보 및 유관 문자 정보 중 어느 하나에 해당되는 하나 이상의 분석 대상 문자 정보 수신시 상기 하나 이상의 분석 대상 문자 정보와 각각 대응되는 하 나 이상의 문자를 상기 제 4 신경망을 통해 식별할 수 있다. 또한, 상기 분석부는 상기 제 4 신경망을 통해 상기 분석 대상 이미지에 대응되어 식별된 상기 하나 이상 의 문자의 배치 패턴을 기초로 의미 분석을 수행하고, 상기 제 4 신경망을 통해 분석된 의미를 상기 분석 대상 이미지에 대한 기상정보로 출력할 수 있다. 일례로, 상기 분석부는 상기 분석 대상 이미지에 대응되어 상기 기상 단어 추출부에 의해 추출된 복 수의 기상 문자 정보를 상기 제 4 신경망에 적용하여 \"雷雨\"를 식별하고, 상기 분석 대상 이미지에 대응되어 상 기 유관 단어 추출부로부터 수신되는 복수의 유관 문자 정보를 상기 제 4 신경망에 적용하여 \"大至願\"을 식별할 수 있다. 또한, 상기 분석부는 상기 복수의 기상 문자 정보 및 상기 복수의 유관 문자 정보 각각에 포함된 배치 위 치를 상기 제 4 신경망에 적용하여 상기 \"雷雨\"와 \"大至願\"의 배치 위치에 따른 \"雷雨..(중략)..大至願\"과 같은 문자 배치 패턴(또는 문자별 배치 패턴)을 식별하고, 해당 문자 배치 패턴을 상기 제 4 신경망을 통해 \"천둥과 비가 크게 내리다.\"로 의미 해석(분석)을 수행하고, 상기 의미 해석에 따른 \"천둥과 비가 크게 내리다.\"에 대한 의미 정보를 포함하는 기상 정보를 상기 분석 대상 이미지에 대응되어 생성할 수 있다. 이를 통해, 상기 분석부는 상기 분석 대상 이미지와 관련하여 기상 정보를 출력할 수 있다. 한편, 상술한 구성에서, 상기 문자 인식부는 상기 분석 대상 이미지에서 인식한 문자별 문자 정보를 상기 분석부에 전송할 수 있다. 또한, 상기 분석부는 상기 제 4 신경망을 통해 상기 하나 이상의 문자 정보와 각각 대응되어 문자를 식별 하고, 미리 설정된 알고리즘에 따라 일시(日時)(또는 날짜)와 연관된 문자를 식별하여 상기 분석 대상 이미지에 대응되는 일시 정보를 생성할 수 있다. 또한, 상기 분석부는 상기 분석 대상 이미지에 대응되어 생성한 일시 정보를 상기 기상 정보에 포함시켜 출력할 수 있으며, 이를 통해 분석 대상 이미지에 대응되는 고문서의 특정 페이지에서 기상 및 일시와 관련되어 기재된 부분을 인식하여 이에 대한 기상 정보와 일시 정보를 제공할 수 있다. 또한, 상기 문서 인식부는 상기 분석 대상 이미지에 대한 이미지 식별 정보를 상기 분석부에 제공할 수 있 으며, 상기 분석부는 상기 기상 정보에 상기 분석 대상 이미지의 이미지 식별 정보를 포함시켜 제공함으로 써, 해당 기상 정보에 대응되는 고문서의 페이지를 식별할 수 있도록 제공할 수 있다. 한편, 상술한 구성에서, 상기 서비스 제공 장치는 고문서와 관련되어 하나 이상의 이미지를 수신하여 이미 지별로 기상 정보를 제공하는 과정에서 기상 관련 내용이 기재되지 않은 고문서의 페이지에 대응되는 이미지를 구분하여 분석 대상(또는 기상 정보 제공 대상)에서 제외시킴으로써, 고문서를 구성하는 하나 이상의 페이지 중 기상과 관련된 페이지에 대해서만 기상 정보가 제공되도록 할 수 있는데, 이를 도 6을 참고하여 상세히 설명한다. 상술한 구성 및 도 6에 도시된 바와 같이, 상기 서비스 제공 장치는 패턴 분류부를 더 포함하여 구성 될 수 있으며, 상기 패턴 분류부는 인공지능 기반 제 5 신경망을 포함하여 구성될 수 있다. 또한, 상기 패턴 분류부는 상기 기상 단어 추출부 및 유관 단어 추출부와 연동할 수 있으며, 복 수의 서로 다른 고문서 관련 이미지에 대응되어 상기 제 5 신경망을 통해 상기 기상 단어 추출부 및 유관 단어 추출부와 연동하여 각각이 상기 기상 문자 정보 및 유관 문자 정보 중 어느 하나로 구성되는 하나 이 상의 문자 정보 각각에 포함된 배치 위치를 기초로 기상 연관 배치 패턴을 상기 제 5 신경망에 학습시킬 수 있 다. 이때, 제 5 신경망은 상기 제 1 내지 제 4 신경망과 마찬가지로 CNN 기반의 입력층, 하나 이상의 은닉층 및 출 력층으로 구성될 수 있다. 또한, 상기 패턴 분류부는 상기 분석 대상 이미지에 대응되어 상기 기상 단어 추출부 및 유관 단어 추출부 중 적어도 하나로부터 수신되며 상기 기상 문자 정보와 유관 문자 정보 중 어느 하나에 대응되는 하나 이상의 문자 정보 각각에 포함된 배치 위치에 따른 배치 패턴을 기초로 상기 제 5 신경망을 통해 상기 이 미지의 기상 연관 여부를 판단할 수 있다. 또한, 상기 분석부는 상기 패턴 분류부와 연동하여 상기 분석 대상 이미지의 기상 연관 여부를 판단 하고, 상기 기상 연관 여부에 따라 무관한 경우 상기 분석 대상 이미지를 분석 대상에서 제외시킬 수 있다. 이에 따라, 상기 분석부는 기상과 연관성이 없는 상기 분석 대상 이미지에 대해 기상 정보를 제공하지 않 고, 기상과 연관성이 없는 분석 대상 이미지에 대해 분석 제외에 대한 결과 정보를 출력할 수 있다. 일례로, 상기 패턴 분류부는 상기 배치 패턴이 학습된 제 5 신경망을 기초로 상기 유관 문자 정보만이 분 석 대상 이미지에 포함되어 기상 문자 정보와의 관련성이 결여된 경우 해당 유관 문자 정보의 의미가 기상 상태 를 의미하지 않는 것으로 판단할 수 있으며, 이에 따라 상기 분석부는 상기 패턴 분류부와 연동하여 상기 분석 대상 이미지에 대한 분석을 수행하지 않을 수 있으며, 분석 대상에서 제외된 분석 대상 이미지에 대 해 상기 결과 정보를 출력할 수 있다. 또는, 상기 패턴 분류부는 상기 제 5 신경망을 통해 상기 하나 이상의 기상 문자 정보에 따른 기상 관련 단어와 상기 하나 이상의 유관 단어 문자 정보에 따른 기상 유관 단어의 기상 상태를 나타내는 배치 패턴을 상 기 제 5 신경망에 학습시키고, 상기 분석 대상 이미지에 대응되어 상기 분석 대상 이미지에서 식별되는 상기 기 상 관련 단어와 상기 기상 유관 단어의 배치 패턴이 상기 제 5 신경망에 학습된 배치 패턴과 미리 설정된 기준 치 이상 차이가 발생시 상기 분석 대상 이미지에 나타는 상기 기상 관련 단어와 상기 기상 유관 단어는 기상 상 태를 의미하지 않는 것으로 판단할 수 있으며, 이에 따라 상기 분석부는 해당 분석 대상 이미지를 분석 대 상에서 제외시키고 상술한 바와 같이 결과 정보를 출력할 수 있다. 한편, 상술한 구성에서, 상기 유관 단어 추출부는 복수의 서로 다른 이미지 각각에서 추출되는 서로 다른 유관 문자 정보별 출현 빈도를 산출하고, 미리 설정된 기준치 이상의 출현 빈도를 가진 유관 문자 정보를 상기 기상 단어 추출부에 기상 관련 단어로 입력하여 상기 유관 문자 정보를 기상 단어로 학습시킬 수 있다. 즉, 상기 유관 단어 추출부는 특정 기상 유관 단어로서 추출되는 하나 이상의 유관 문자 정보의 출현 빈도 가 미리 설정된 기준치 이상으로 높은 경우 고문서의 작성 당시에 상기 특정 기상 유관 단어가 기상 관련 단어 로서 사용된 것으로 판단할 수 있으며, 이에 따라 상기 출현 빈도가 미리 설정된 기준치 이상인 하나 이상의 유 관 문자 정보가 고문서 관련 복수의 이미지 각각에서 추출시마다 상기 기상 단어 추출부와 연동하여 기상 단어 추출부의 제 2 신경망에 지속적으로 학습시켜 상기 기상 단어 추출부에서 상기 출현 빈도가 미 리 설정된 기준치 이상인 하나 이상의 유관 문자 정보가 기상 문자 정보로서 추출되도록 할 수 있다. 이를 통해, 상기 유관 단어 추출부는 상기 고문서 관련 이미지에서 기상 관련 단어의 추출 정확도를 높일 수 있다. 도 7 내지 도 8은 본 발명의 실시예에 따른 고문서 기반 과거 기상 추정 시스템을 구성하는 상기 서비스 제공 장치의 분석 대상 이미지의 분석에 따른 기상 정보 제공에 대한 예시를 나타낸 도면이다. 우선, 도 7에 도시된 바와 같이, 상기 서비스 제공 장치는 제 1 내지 제 5 신경망을 통한 상술한 분석을 통해 제 1 분석 대상 이미지에 대해 춘우(春雨)를 식별하고, 영조 26년에 봄비(春雨)가 내린 것으로 기상 정보를 제공할 수 있다. 또한, 도 8에 도시된 바와 같이, 상기 서비스 제공 장치는 제 1 내지 제 5 신경망을 통한 상술한 분석을 통해 제 2 분석 대상 이미지에 대해 숙종 4년에 대설(大雪)이 온 것으로 기상 정보를 제공할 수 있다. 이때, 상술한 구성에서, 상기 분석부는 상기 문자 인식부, 기상 단어 추출부, 유관 단어 추출부 및 패턴 분류부와 연동하여 하나의 분석 대상 이미지에 복수의 서로 다른 일시 정보가 포함된 경우 복수의 서로 다른 일시 정보와 각각 대응되어 기상 정보 존재시 복수의 기상 정보를 일시 정보별로 상기 분석 대상 이미지에 대응되어 제공할 수 있다. 즉, 상기 분석부는 하나의 분석 대상 이미지에 대응되어 복수의 기상 정보를 제공할 수도 있다. 상술한 바와 같이, 본 발명은 고문서에서 기재된 시대별 기상 관련 정보를 제공하기 위해 고문서 관련 이미지에 표시된 문자를 신경망을 통해 지속적으로 학습하는 동시에 기상 상태를 의미하는 기상 관련 단어와 해당 기상 관련 단어와의 조합에 따라 기상을 의미하는 기상 유관 단어 및 기상 상태를 나타내는 기상 관련 단어와 기상 유관 단어의 배치 패턴을 학습하여 고문서 관련 이미지에서 기상 관련 정보를 정확하게 추출하고 이에 따라 시 대별 기상 상황에 대한 정보를 신뢰성 있게 제공할 수 있을 뿐만 아니라 고대의 기상 상황에 대한 연구자료 및 교육자료를 제공할 수 있다. 도 9는 본 발명의 실시예에 따른 고문서 관련 이미지를 통해 기상 정보를 제공하는 서비스 제공 장치의 고 문서 기반 과거 기상 추정 방법에 대한 순서도이다. 도시된 바와 같이, 상기 서비스 제공 장치는 고문서 관련 이미지의 문자를 인식하여 제 1 신경망을 통해 학습하고, 상기 제 1 신경망을 통해 상기 이미지에 포함된 하나 이상의 문자 각각을 대상으로 상기 이미지에서 인식한 문자의 상기 이미지상 배치 위치와 문자 패턴을 포함하는 문자 정보를 생성하여 순차 전송할 수 있다 (S1). 또한, 상기 서비스 제공 장치는 제 2 신경망을 통해 복수의 기상 관련 단어별로 기상 관련 단어를 구성하 는 하나 이상의 문자별 문자 패턴 및 배열 순서를 학습하고, 상기 제 2 신경망을 통해 상기 복수의 문자 정보 중 상기 기상 관련 단어에 대응되는 하나 이상의 문자 정보 각각을 기상 문자 정보로 추출할 수 있다(S2). 또한, 상기 서비스 제공 장치는 제 3 신경망을 통해 복수의 기상 유관 단어별로 기상 유관 단어를 구성하 는 하나 이상의 문자별 문자 패턴 및 상기 기상 유관 단어를 구성하는 문자별 문자 패턴의 상기 기상 문자 정보 별 배치 위치를 기준으로 하는 상기 이미지상 배치 패턴을 학습하고, 상기 복수의 문자 정보와 상기 기상 문자 정보를 기초로 상기 제 3 신경망을 통해 상기 복수의 문자 정보 중 상기 배치 패턴을 만족하면서 상기 기상 유 관 단어에 대응되는 하나 이상의 문자 정보 존재시 상기 하나 이상의 문자 정보 각각을 유관 문자 정보로 추출 할 수 있다(S3). 다음, 상기 서비스 제공 장치는 제 4 신경망을 통해 복수의 문자 패턴과 각각 대응되는 복수의 문자와 기 상과 관련된 문자별 배치 패턴에 따른 의미를 학습하고, 상기 이미지에 대응되어 상기 제 4 신경망을 통해 상기 기상 문자 정보 및 유관 문자 정보 중 어느 하나에 해당되는 하나 이상의 분석 대상 문자 정보와 각각 대응되는 하나 이상의 문자를 식별하고 상기 이미지에 대응되어 식별된 하나 이상의 문자의 배치 패턴을 상기 제 4 신경 망에 적용하여 상기 제 4 신경망을 통해 분석된 의미를 상기 이미지에 대한 기상정보로 출력할 수 있다(S4). 본 명세서에 기술된 다양한 장치 및 구성부는 하드웨어 회로(예를 들어, CMOS 기반 로직 회로), 펌웨어, 소프트 웨어 또는 이들의 조합에 의해 구현될 수 있다. 예를 들어, 다양한 전기적 구조의 형태로 트랜지스터, 로직게이 트 및 전자회로를 활용하여 구현될 수 있다. 전술된 내용은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어 나지 않는 범위에서 수정 및 변형이 가능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상 을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다.부호의 설명 100: 서비스 제공 장치 110: 문자 인식부 120: 기상 단어 추출부 130: 유관 단어 추출부 140: 분석부 150: 패턴 분류부"}
{"patent_id": "10-2018-0144164", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 고문서 기반 과거 기상 추정 시스템의 구성도. 도 2는 본 발명의 실시예에 따른 문자 인식부의 동작 예시도. 도 3은 본 발명의 실시예에 따른 기상 단어 추출부의 동작 예시도. 도 4는 본 발명의 실시예에 따른 유관 단어 추출부의 동작 예시도. 도 5는 본 발명의 실시예에 따른 분석부의 동작 예시도. 도 6은 본 발명의 실시예에 따른 패턴 분류부의 동작 예시도. 도 7 및 8은 본 발명의 실시예에 따른 고문서 기반 과거 기상 추정 시스템의 기상 정보 제공에 대한 예시도. 도 9는 본 발명의 실시예에 따른 고문서 기반 과거 기상 추정 방법의 순서도."}
