{"patent_id": "10-2022-0042517", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0143505", "출원번호": "10-2022-0042517", "발명의 명칭": "딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치", "출원인": "호서대학교 산학협력단", "발명자": "김진아"}}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "활동 인식 장치, 반려인의 스마트 기기, 서버로 구성되고, 상기 서버는 상기 활동 인식 장치와 상기 반려인의스마트 기기를 통해 반려동물의 활동 데이터를 수집하고, 수집한 데이터를 전처리하여, 딥러닝을 기반으로 반려동물의 활동을 인식하여 반려동물의 활동을 모니터링하는 것을 특징으로 하는 딥러닝 기반 반려동물 모니터링시스템 및 활동 인식 장치."}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 활동 인식 장치는 반려동물을 목에 착용할 수 있는 웨어러블형태로 제작되고, 3축 가속도센서와 3축 자이로 센서가 설치되는 것을 특징으로 하는 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치."}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,반려동물의 활동 데이터 수집은 상기 활동 인식 장치에 내장된 저전력 블루투스 모듈을 통해 상기 스마트폰의소정 애플리케이션과 연결하여 가속도 데이터, 자이로 데이터, 걸음 수 데이터, 활동 인식 장치의 MAC 주소를수집하는 것을 특징으로 하는 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치."}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 데이터의 수집 주기는 1초당 1회로 설정하는 것을 특징으로 하는 딥러닝 기반 반려동물모니터링 시스템 및 활동 인식 장치."}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 수집된 데이터를 바탕으로 데이터 전처리 단계에서는 결측치 처리, 정규화, 시퀀스 데이터 생성 순의 과정이 진행되는 것을 특징으로 하는 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치."}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 결측치 처리는 대체하거나 제거하는 방식으로 이루어지고, 대체할 경우 시계열 데이터의 특성에 맞게 대체값을 선택하고, 2초 이상의 결측치가 발생한 경우 필터링을 통해 데이터를 제거하고, 결측치는 평균값으로 설정하는 것을 특징으로 하는 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치."}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 딥러닝은, 합성곱 연산을 1차원으로 진행하는 Conv1D 레이어를 이용하여 전체 시퀀스 데이터에 대한 특징맵을 만들고, 특징 맵을 다시 LSTM 레이어를 이용하여 시계열적인 요소를 바탕으로 특징을 추출하는 것을 특징으로 하는 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치."}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,발생가능한 노이즈를 제거하기 위해 Z-점수(Z-score) 정규화 방법을 사용하고, Z-점수 정규화는 평균(Mean)과표준편차(Stddev)를 이용해 이상치를 제거하는 데 특화된 방법으로 식 (1)과 같이 Z-점수를 도출하며, 이때, 도공개특허 10-2023-0143505-3-출된 Z-점수는 평균값인 0을 기준으로 -2 미만일 경우 -2, 2 이상일 경우 2로 이상치 값들을 조정하는 것을 특징으로 하는 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치. (1)"}
{"patent_id": "10-2022-0042517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,가속도에 대해서 Lambda 레이어를 통해 x, y, z축에 대한 특징을 식 (2)를 통해 추출하고, 추출된 전체 특징들은 Dense 레이어를 통해 각 활동별 수치들을 출력하고 이를 Add 레이어를 통해 전부 더하여 Softmax를 통해 활동별 확률을 도출하는 것을 특징으로 하는 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치. (2)."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치는 활동 인식 장치, 반려인의 스마트 기기, 서버로 구성되고, 상기 서버는 상기 활동 인식 장치와 상기 반려인의 스마트 기기를 통해 반려동물의 활동 데이터를 수집하고, 수집한 데이터를 전처리하여, 딥러닝을 기반으로 반려동물의 활동을 인식하여 반려동물의 활 동을 모니터링한다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 딥러닝 기반의 반려동물 모니터링 시스템과 이를 위한 활동 인식 장치에 관한 것이다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지난해 기준 인구주택총조사 결과에 따르면, 반려동물 양육 가구 수가 전체 가구 중 15%를 차지할 정도로 반려 동물 양육 가구 수가 증가하였다. 이에 반려동물을 인간화하는 펫 휴머니제이션(Pet Humanization) 현상이 확산 됨에 따라 반려동물의 건강관리에 관한 관심도 증가하였다. 이를 위해 반려동물의 음성, 활동, 의료 등의 다양한 데이터를 이용하여 감정을 인식하거나 질병 검사 및 판독 서비스 등 IoT와 빅데이터, 인공지능 기술들을 결합한 다양한 제품 및 서비스가 제공되고 있다. 가장 많이 이용하는 대표적인 제품 및 서비스로는 자동 급식/급수기, CCTV, 건강/운동량 추적기 등 있다. CCTV 나 건강/운동량 추적기와 같이 반려동물 모니터링을 위한 제품 및 서비스들이 주를 이루는데 반려동물의 일상적 인 건강 관리나 반려인이 집에 없는 경우 반려동물의 행동 관찰 등을 위해 사용된다. 그러나 대부분의 반려동물 모니터링 제품 및 서비스들은 반려인과 반려동물의 생활에 대한 고려가 필요하다. 집 내부에 설치가 필요한 경우, 반려인과 반려동물이 생활하기에 불편함이 없어야 함과 동시에 반려동물의 활동 반 경을 고려해야 한다. 마찬가지로 반려동물 웨어러블 장치를 이용한 경우, 반려동물이 움직이기에 무겁거나 불편하지 않아야 한다. 이 처럼 반려동물 모니터링 제품 및 서비스를 위해서는 다양한 요소들이 고려되어야 하며, 특히 반려동물과 반려인 의 생활에 편리함과 간편함은 필수적이다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 목적은, 반려동물의 활동에 방해받지 않는 웨어러블 형태의 활동 인식 장치를 통해 반려동물 의 활동 데이터(가속도, 자이로)를 수집하여, 수집된 데이터를 가지고 딥러닝 기반의 모델을 통해 5가지(앉기, 서기, 눕기, 걷기, 뛰기)로 활동을 인식하여 활동량을 구체화한 다음, 최종적으로, 측정된 활동 패턴에 대한 분 석 결과를 반려인에게 제공함으로써 반려동물의 활동을 모니터링을 할 수 있도록 해주는, 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치를 제공하는 것이다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 목적을 달성하기 위하여, 본 발명에 따른 딥러닝 기반 반려동물 모니터링 시스템 및 활동 인식 장치 는, 활동 인식 장치, 반려인의 스마트 기기, 서버로 구성되고, 상기 서버는 상기 활동 인식 장치와 상기 반려인 의 스마트 기기를 통해 반려동물의 활동 데이터를 수집하고, 수집한 데이터를 전처리하여, 딥러닝을 기반으로 반려동물의 활동을 인식하여 반려동물의 활동을 모니터링하는 것을 특징으로 한다. 본 발명에 따른 장치에서, 활동 인식 장치는 반려동물을 목에 착용할 수 있는 웨어러블형태로 제작되고, 3축 가 속도센서와 3축 자이로 센서가 설치되는 것을 특징으로 한다. 본 발명에 따른 장치에서, 반려동물의 활동 데이터를 수집은 상기 활동 인식 장치에 내장된 저전력 블루투스 모 듈을 통해 상기 스마트폰의 소정 애플리케이션과 연결하여 가속도 데이터, 자이로 데이터, 걸음 수 데이터, 활 동 인식 장치의 MAC 주소를 수집하는 것을 특징으로 한다. 본 발명에 따른 장치에서, 데이터의 수집 주기는 1초당 1회로 설정하는 것을 특징으로 한다. 본 발명에 따른 장치에서, 수집된 데이터를 바탕으로 데이터 전처리 단계에서는 결측치 처리, 정규화, 시퀀스 데이터 생성 순의 과정이 진행되는 것을 특징으로 한다. 본 발명에 따른 장치에서, 결측치 처리는 대체하거나 제거하는 방식으로 이루어지고, 대체할 경우 시계열 데이 터의 특성에 맞게 대체 값을 선택하고, 2초 이상의 결측치가 발생한 경우 필터링을 통해 데이터를 제거하고, 결 측치는 평균값으로 설정하는 것을 특징으로 한다. 본 발명에 따른 장치에서, 딥러닝은, 합성곱 연산을 1차원으로 진행하는 Conv1D 레이어를 이용하여 전체 시퀀스 데이터에 대한 특징 맵을 만들고, 특징 맵을 다시 LSTM 레이어를 이용하여 시계열적인 요소를 바탕으로 특징을 추출하는 것을 특징으로 한다. 본 발명에 따른 장치에서, 발생 가능한 노이즈를 제거하기 위 해 Z-점수(Z-score) 정규화 방법을 사용하고, Z- 점수 정규화는 평균(Mean)과 표준편차(Stddev)를 이용해 이상치를 제거하는 데 특화된 방법으로 식 과 같이 Z-점수를 도출하며, 이때, 도출된 Z-점수는 평균값인 0을 기준으로 -2 미만일 경우 -2, 2 이상일 경우 2로 이상 치 값들을 조정하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "본 발명에 따른 장치에서, 가속도에 대해서 Lambda 레이어를 통해 x, y, z축에 대한 특징을 식 를 통해 추출 하고, 추출된 전체 특징들은 Dense 레이어를 통해 각 활동별 수치들을 출력하고 이를 Add 레이어를 통해 전부 더하여 Softmax를 통해 활동별 확률을 도출하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안된 시스템의 실험 결과로, 활동 인식 장치만을 활용해 반려동물의 구체화된 활동 인식 및 활동 량 측정이 가능함을 확인하였다. 폭넓은 데이터 축적이 된다면 현재 인식 가능한 활동보다 세분화된 활동 인식 이 가능하며, 세분화된 활동 인식을 기반으로 반려동물의 이상행동 탐지 및 헬스 케어 서비스의 확장을 기대할 수 있다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 첨부된 도면을 참고하여 본 발명에 따른 바람직한 실시예를 보다 상세하게 설명하기로 한다. 본 발명의 설명에 앞서, 이하의 특정한 구조 내지 기능적 설명들은 단지 본 발명의 개념에 따른 실시예를 설명 하기 위한 목적으로 예시된 것으로, 본 발명의 개념에 따른 실시예들은 다양한 형태로 실시될 수 있으며, 본 명 세서에 설명된 실시예들에 한정되는 것으로 해석되어서는 아니된다. 또한, 본 발명의 개념에 따른 실시예는 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있으므로, 특정 실시예들을 도면에 예시하고 본 명세서에 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 개념에 따른 실시 예들을 특정한 개시 형태에 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경물, 균 등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 반려동물 모니터링 시스템에 관한 연구는 집 내부에 반려동물의 활동을 파악하기 위한 별도의 장치를 설치하는 경우와 반려동물에게 웨어러블 형태의 장치를 착용하는 경우로 구분된다. 집 내부에 장치를 설치하는 경우에는 일반적으로 반려동물 용품, 센서, 카메라 등의 장치를 이용한다. 이로부터 반려동물의 용품을 사용하는 패턴이나 자세, 활동들을 추정하고, 추정된 결과를 반려인의 스마트 기기를 통해 제공하는 모니터링 형태가 된다. 자동 급식기, 급수기, 배변 패드에 센서를 부착하여 반려동물이 밥 혹은 물을 마시거나 배변할 때의 활동을 기록하고, 반려인의 스마트 기기에 활동 내용을 도식화하여 제공하는 방법이 기존 에 제안되었고, 카메라를 사용해 인공지능 기반의 영상 처리 방법으로 반려동물의 자세나 활동들을 예측하여 이 를 반려인에게 알려주는 방법도 제안되었다. 하지만, 별도의 용품에 센서를 부착하는 경우 반려동물이 반드시 용품을 사용해야 활동 패턴 추론이 가능하며, 용품을 사용하지 않는 활동의 모니터링은 불가능하다. 또한, 카메라를 사용하는 경우에는 반려동물의 모든 활동 반경을 촬영하기 어려워 반려동물이 사각지대로 이동하면 활동 및 자세 추정이 불가능하다. 이를 개선하기 위해 여러 개의 센서나 카메라를 설치해야 하며, 이 경우 의도하지 않은 사생활 노출의 위험이 있는 등의 한계점이 있다. 반려동물에게 웨어러블 장치를 착용할 경우, 반려동물의 활동 반경을 비교적 크게 구애받지 않기 때문에 이러한 한계점들을 개선할 수 있다. 이때, 반려동물의 원활한 활동을 위해 반려동물의 종이나 크기에 따라 적당한 크기 와 무게를 갖는 장치가 필요하다. 그러나 반려동물의 활동에 방해가 되거나 데이터 노이즈가 발생할 수 있기 때 문에 적절한 부착 위치 선정이 중요하다. 이 문제점들을 최소화하기 위해 목에 착용하는 방식이 가장 적절하다. 그러나 웨어러블 장치의 위치나 방향, 조임 정도 등에 따라 착용 과정에서 수집되는 데이터가 일관되지 않아 모 니터링의 성능이 저하될 수 있다. 이를 위해 적절한 데이터 전처리 방법과 딥러닝 기반의 분석 방법이 요구된다. 대표적인 딥러닝 기법은 합성곱 신경망(CNN:Convolutional Neural Network, 이하 CNN)과 순환 신경망 (RNN:Recurrent Neural Network, 이하 RNN)등이 있으며, 분류나 예측 문제에 많이 사용된다. CNN은 이미지나 텍스트 처리 등의 분야에 적용되고 있으며 합성곱 연산을 통해 데이터의 특징들을 추출하고, RNN은 문장이나 시 계열 등의 순차적인 데이터를 위해 설계된 방법으로 기존 RNN의 문제인 기울기 소실 문제를 개선하여 장단기 메 모리(LSTM:Long-Short Term Memory, 이하 LSTM)가 사용되고 있다. 최근에는 더 나아가 여러 딥러닝 기법들을 하이브리드하여 사용하는 방식이 많이 채택되고 있다. 특히, 인간의 행동 인식 분야에서 CNN과 LSTM을 하이브리 드한 방식이 많이 사용되고 있으며, 단일 모델의 사용보다 나은 성능을 나타내고 있다 반려동물 활동 인식 장치에 관한 연구는 GPS, 가속도, 자이로 등의 다양한 센서들을 활용하고 있다. GPS를 활용 하여 반려인의 스마트 기기를 통해 실시간으로 반려동물의 위치를 모니터링하면서 반려인이 지정한 안전 구역을 벗어났을 때 반려인에게 알리는 시스템이 제안되었고, 반려동물 활동 인식 장치에서 가장 많이 활 용되는 센서 는 가속도나 자이로 센서로, 반려동물의 건강/ 운동량을 추적하기 위해 활용되고 있다. 가속도나 자이로 센서를 사용하여 반려동물의 활동 및 수면 패턴을 파악해 모니터링하는 방법들이 제안되었다. 이에, 본 발명에 따른 시스템은 활동 인식 장치, 반려인의 스마트 기기, 서버로 구성된다. 활동 인식 장치는 반 려동물이 활동에 영향을 적게 주는 위치인 목에 착용하며, 가속도와 자이로 센서를 통해 활동 데이터를 수집한다. 반려인의 스마트 기기는 활동 인식 장치와 서버의 데이터 전달로 반려동물 활동 모니터링 도구로 활용된다. 서버는 반려동물의 활동 데이터 수집 단계, 데이터 전처리 단계, 딥러닝 기반 활동 인식 단계, 활동 모니터링 단계를 포함한다. 본 발명에 따른 웨어러블 형태의 활동 인식 장치를 이용한 딥러닝 기반 반려동물 모니터링 시스템의 구조는 도 1에 도시한 바와 같이 활동 인식 장치(Activity recognition device), 반려인의 스마트 기기(Smart device), 서버(Server)로 구분된다. 활동 인식 장치는 반려동물의 활동에 영향을 적게 주는 위치인 목에 착용하며, 가속 도와 자이로 센서를 통해 활동 데이터를 수집한다. 반려인의 스마트 기기는 활동 인식 장치와 서버의 데이터 전 달과 반려동물 활동 모니터링 도구로 활용된다. 마지막으로, 서버는 반려동물의 활동 데이터를 수집 및 전처리 하며, 딥러닝 기 반의 활동 인식 모델을 통해 반려동물의 활동을 5가지(앉다, 서다, 눕다, 걷다, 뛰다)로 구분 한다. 이를 바탕으로 활동량을 측정하며, 활동 패턴에 따른 분석 결과를 반려인의 스마트 기기를 통해 제공함으 로써 모니터링을 한다. 본 발명에 따른 활동 인식 장치는 도 2에 도시한 바와 같이 구성되었으며, Arduino nano 33 IoT 보드를 기반으 로 제작되었다. USB C타입 충전 모듈인 TP4056과 980mah 리튬폴리머 배터리를 납땜하여 충전식 디바이스로 구성 하였며, 내부 장치의 보호를 위해 3D 프린터로 별도의 케이스를 제작하였으며, 다양한 강아지 종에 적용할 수 있도록 목줄 형태로 구성하였다. 장치의 크기는 5.5cm X 3.5cm 이며, 무 게는 23g으로 소형 반려동물 기준으로 목에 착용했을 때 무리 되지 않도록 하였다. 보드에 내장되어 있는 관성측정 센서 모듈인 LSM6DS3 은 3축 가속도, 3축 자이로를 내장하고 있다. 이를 통해 가속도와 자이로 센서 데이터를 수집하였으며, Sparkfun 에서 제공하는 라이브러리를 이용해 가속도와 자이로 센서를 이용한 걸음 수 데이터를 수집하였다. 데이터 수집은 도 3에 도시된 바와 같이 진행하였다. 보드에 내장된 저전력 블루투스 (BLE : Bluetooth Low Energy) 모듈인 NINA-W102를 통해 스마트폰 애플리케이션과 연결하여 가속도 데이터, 자이로 데이터, 걸음 수 데이터, 활동 인식 장치의 MAC 주소를 수집하였다. 데이터 수집 주기는 디바이스의 배터리 지속시간과 데이터의 오차를 방지하기 위해 1초당 1회로 설정하였다. 위 과정을 통해 수집한 데이터는 수집 시간과 함께 서버에 전송한다. 서버는 서버 사이드 스크립트 언어인 PHP(Hypertext Preprocessor)를 거쳐 반려인의 스마트 기기에서 받은 데이 터를 SQL 명령어로 변환하여 데이터베이스에 저장한다. 데이터베이스의 경우 MariaDB를 사용하였으며 데이터 테 이블의 구조의 예는 표 1과 같다. 표 1 Time Acc_xAcc_yAcc_zGyro_xGyro_yGyro_zStep CountMac 2021-12-09 14:08:27-0.10.09-0.34-1.120.45-137.7618107C:9E:BD:3B:82:52 2021-12-09 14:08:28-0.55-1.07-0.4374.5152.492.0118137C:9E:BD:3B:82:52 2021-12-09 14:08:29-1.57-1.67-1.12-5.07-155.88-21.5518157C:9E:BD:3B:82:52 2021-12-09 14:08:30-0.88-0.98-1.5-74.22-17.46-33.9418177C:9E:BD:3B:82:52 2021-12-09 14:08:31-2.15-2.73-0.5123.623.05117.9818207C:9E:BD:3B:82:52 앞서 수집된 데이터를 바탕으로 데이터 전처리 모듈에서는 결측치 처리, 정규화, 시퀀스 데이터 생성 순의 과정 이 진행된다. 먼저, 결측치 처리는 대체하거나 제거하는 방식이 보편적이다. 대체할 경우 시계열 데이터의 특성에 맞게 적절 한 대체 값을 선택해야 하며, 제거하는 경우는 학습 모델에 활용하기에 데이터의 수가 충분하지 않을 수 있어 이를 고려해야 한다. 2초 이상의 결측치가 발생한 경우 필터링을 통해 데이터를 제거하였으며, 결측치는 평균값으로 설정하였다. 다음으로 장치에서 발생할 수 있는 노이즈를 제거하기 위해 Z-점수(Z-score) 정규화 방법을 사용한다. Z-점수 정규화는 평균(Mean)과 표준편차(Stddev)를 이용해 이상치를 제거하는 데 특화된 방법으로 식 과 같이 Z-점 수를 도출한다. 이때, 도출된 Z-점수는 평균값인 0을 기준으로 -2 미만일 경우 -2, 2 이상일 경우 2로 이상치 값들을 조정하였다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "마지막으로 활동 인식을 위한 학습 데이터를 구성하기 위해 슬라이딩 윈도우 기법을 적용하여 4초 길이의 시퀀 스 데이터를 생성하였다. 전처리 모듈 과정을 거친 시퀀스 데이터들은 딥러닝 기반 활동 인식을 진행하기 위한 모델 입력값으로 사용된다. 반려동물의 활동은 일반적으로 사람보다 불규칙하고 변칙적인 패턴을 나타낸다. 본 발명에서는 반려 동물 활동 데이터의 특징과 패턴 인식을 위해 CNN과 LSTM의 하이브리드 모델인 CNN-LSTM 방법을 사용하였다. 제안된 딥러닝 기반 활동 인식 모델의 구조는 도 4에 도시된 바와 같다. 합성곱 연산을 1차원으로 진행하는 Conv1D 레이어를 이용하여 전체 시퀀스 데이터에 대한 특징 맵을 만들고, 특징 맵을 다시 LSTM 레이어를 이용하 여 시계열적인 요소를 바탕으로 특징을 추출한다. 이때, 가속도에 대해서 Lambda 레이어를 통해 x, y, z축에 대 한 특징을 식 를 통해 추출한다. 추출된 전체 특징들은 Dense 레이어를 통해 각 활동별 수치들을 출력하고 이를 Add 레이어를 통해 전부 더하여 Softmax를 통해 활동별 확률을 도출한다."}
{"patent_id": "10-2022-0042517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "딥러닝 기반 활동 학습 후, 인식된 활동과 측정된 걸음 수를 바탕으로 활동 모니터링을 진행한다. 활동 모니터 링은 딥러닝 학습 기반의 활동 인식 모듈을 이용하여 크게 정적인 활동과 동적인 활동으로 구분한다. 정적인 활 동은 앉다, 서다, 눕다를 기반으로 하며, 동적인 활동은 걷기, 뛰기, 그리고 걸음 수를 기반으로 한다. 이후 인식된 활동 들을 측정 기준 하루 전날과 1주일 전의 일간, 주간 통계 데이터를 활용하여 일정 임계 수치 보다 떨어지거나, 올라갔을 때 반려인 스마트 기기를 통해 푸쉬 서비스를 제공한다. 통계 데이터는 도 5에 도시 된 바와 같이 반려인 스마트 기기에 제공되는 UI를 통해 일간, 주간별로 각 활동에 대한 개수나 증감 추세를 그 래프 형태로 확인할 수 있다. 본 발명에서 제안한 시스템 구성을 위하여 서버는 Nginx를 이용한 웹 서버를 구축하였다. 데이터 수집을 위해 PHP 7.3 과 Maria DB 10을 사용하였다. 또한, 활동 인식을 위한 모델을 구성하고 학습 및 예측을 위해 Python 3.9 환경에서 Tensorflow 2.4.1 과 keras 2.5.0 버전을 사용하였다. 데이터 셋(Data set) 반려동물 활동 인식장치를 통해 수집된 데이터는 반려인 스마트 기기를 통해 서버의 데이터베이스에 저장된다. 이후 데이터 전처리 과정을 거친 후, 딥러닝 기반 활동 인식 모델의 입력값으로 사용된다. 수집된 전체 데이터 의 결과는 표 2와 같다. 학습을 위해 전체 데이터 중 80%는 학습 데이터(Training data)로, 20%는 테스트 데이 터(Test data)로 구성하였다. 학습 데이터 중 20%는 학습 과정에서의 검증 데이터로 활용되었다. 표 2 Activity Number of dataRatio of dataNumber of training dataNumber of test data앉다 (Sitting)245 31.1% 630 158 서다 (Standing)106 13.4% 눕다 (Lying)182 23.1% 걷다 (Walking)215 27.3% 뛰다 (Running)40 5.1% Total 788 100% 80% 20% 결과 앞서 수집된 데이터를 바탕으로 제안된 딥러닝 기반 활동 인식 모델에 대한 성능평가를 진행하였다. 학습 수 (Epoch)는 100이며, Adam 최적화 함수를 이용해 학습률 0.001로 학습을 진행하였다. 모델의 활동별 인식 결과는 도 6에 도시된 바와 같이 정확도를 히트 맵 형태의 혼동행렬(Confusion matrix)로 나타내었다. 또한, 표 3과 같이 활동 인식 모델에서 각 활동에 따른 정밀도(Precision), 재현도(Recall), f1-점 수(F1-Score)와 정확도를 함께 도출하였다. 전체 정확도는 약 87%로, 대부분의 활동에서 인식 잘 되고 있음을 확인하였다. 그러나 반려동물의 목에 활동 인 식 장치를 착용하기 때문에 머리의 움직임에 민감하다. 따라서, 머리를 움직이면서 발생하는 활동인 앉기, 서기, 눕기, 걷기에 대해서는 약간의 오차가 발생함을 확인하였다. 향후 반려동물의 머리 움직임에 따라 데이터 수집이 더 진행된다면 정확도가 향상될 수 있을 것이다. 표 3 Activity Precision Recall F1-Score 앉다 (Sitting)0.95 0.86 0.90 서다 (Standing)0.74 0.81 0.77 눕다 (Lying)0.88 0.95 0.91 걷다 (Walking)0.80 0.93 0.86 뛰다 (Running)1.00 0.12 0.22 Accuracy 87% 마지막으로, 활동 인식 모델을 기반으로 활동 모니터링을 진행하게 된다. 서버에서 학습을 마친 모델을 기반으 로 반려인 스마트 기기로부터 서비스를 제공한다. 활동 인식 장치의 고유 주소인 MAC 주소를 기준으로 필터링하 여 각 장치의 활동 모니터링 서비스를 제공한다. 활동 모니터링 서비스는 반려인 스마트 기기를 통해 인식된 5 가지 활동의 활동량에 대해 일일 및 주간 브리핑 차트 등 도 7에 도시된 바와 같이 모니터링을 제공한다. 또한, 매일 인식되는 활동량에 대해 활동량이 부족하거나, 특정 활동이 설정해놓은 임계 수치보다 떨어지거나 높아지 면 반려인 스마트 기기를 통해 푸쉬 서비스를 제공하게 된다. 이상에서 설명한 것과 같이, 반려동물의 활동 모니터링을 통해 인식된 결과에 따라 활동별 활동량 측정 과정을 통해 반려인 스마트 기기에 일일 및 주간 브리핑 차트 등 반려동물의 활동 변화에 대한 모니터링을 제공하며, 본 발명에 따른 시스템의 실험 결과로, 활동 인식 장치만을 활용해 반려동물의 구체화된 활동 인식 및 활동량 측정이 가능함을 확인하였다. 폭넓은 데이터 축적이 된다면 현재 인식 가능한 활동보다 세분화된 활동 인식이가능하며, 세분화된 활동 인식을 기반으로 반려동물의 이상행동 탐지 및 헬스 케어 서비스의 확장을 기대할 수 있다. 상술한 실시예에 설명된 특징, 효과 등은 본 발명의 적어도 하나의 실시예에 포함되며, 반드시 하나의 실시예에 만 한정되는 것은 아니다. 나아가, 각 실시예에서 예시된 특징, 효과 등은 실시예들이 속하는 분야의 통상의 지 식을 가지는 자에 의하여 다른 실시예들에 대해서도 조합 또는 변형되어 실시 가능하다. 따라서 이러한 조합과 변형에 관계된 내용들은 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다. 또한, 이상에서 실시예들을 중심으로 설명하였으나 이는 단지 예시일 뿐 본 발명을 한정하는 것이 아니며, 본 발명이 속하는 분야의 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성을 벗어나지 않는 범위에서 이상에 예시되 지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 예를 들어, 실시예들에 구체적으로 나타난 각 구성 요소는 변형하여 실시할 수 있는 것이다. 그리고 이러한 변형과 응용에 관계된 차이점들은 첨부한 청구 범 위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0042517", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 딥러닝 기반 반려동물 모니터링 시스템의 전체 구성도. 도 2는 활동 인식 장치를 도시한 도면. 도 3은 반려동물 데이터 수집 과정을 도시한 도면. 도 4는 딥러닝 기반 행동 인식 모델 구조를 도시한 도면. 도 5는 활동 모니터링 서비스 UI를 도시한 도면.도 6은 활동별 인식 결과를 도시한 도면. 도 7은 사용자 스마트 기기에 표시되는 활동 모니터링의 예를 도시한 도면."}
