{"patent_id": "10-2021-7025848", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0115000", "출원번호": "10-2021-7025848", "발명의 명칭": "멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보 전송 방법 및 장치, 및 단말기", "출원인": "텐센트 테크놀로지", "발명자": "쑹, 하오"}}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "단말기에 의해 수행되는 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법으로서,상기 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스(UI)를 디스플레이하는 단계;상기 UI 상에서 방향 조작을 수신하는 단계 ― 상기 방향 조작은 프롬프트 정보 전송 기능을 활성화하고 상기UI 내의 타깃 디스플레이 요소를 가리키는 조작이며, 상기 타깃 디스플레이 요소는 상기 UI 내의 복수의 디스플레이 요소 중 하나임 ―;상기 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하는 단계; 및마스터 가상 캐릭터의 팀원 가상 캐릭터들 또는 전투의 모든 가상 캐릭터들의 클라이언트들에게 상기 타깃 프롬프트 정보를 전송하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 UI는 상호작용 패널 영역을 포함하고, 상기 상호작용 패널 영역은 신호 컨트롤을 포함하며; 상기 방향 조작은 상기 신호 컨트롤로부터 상기 UI 내의 타깃 디스플레이 요소를 가리키는 조작인, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 신호 컨트롤은 버튼 컨트롤을 포함하고, 상기 UI 상에서 방향 조작을 수신하는 단계는:상기 UI 상의 버튼 컨트롤에 가해진 제1 터치 조작을 수신하는 단계;하나 이상의 후보 디스플레이 요소를 상기 UI 상에 디스플레이하는 단계; 및상기 UI 상의 후보 디스플레이 요소들 중의 상기 타깃 디스플레이 요소에 가해진 제2 터치 조작을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 하나 이상의 후보 디스플레이 요소를 상기 UI 상에 디스플레이하는 단계는:상기 UI 상에 상기 하나 이상의 후보 디스플레이 요소를 하이라이트 방식으로 디스플레이하는 단계를 포함하고,상기 하이라이트 방식은, 다음과 같은 디스플레이 방식들: 타깃 컬러 디스플레이 방식, 오버레이 마스킹 디스플레이 방식, 하이라이트 디스플레이 방식, 및 윤곽선 디스플레이 방식 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 신호 컨트롤은 버튼 컨트롤을 포함하고, 상기 UI 상에서 방향 조작을 수신하는 단계는:상기 UI 상에서 슬라이드 조작을 수신하는 단계를 포함하고, 상기 슬라이드 조작의 슬라이드 시작점은 상기 버튼 컨트롤이고, 상기 슬라이드 조작의 슬라이드 끝점은 상기 타깃 디스플레이 요소인, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 방법은:상기 버튼 컨트롤 상에서 상기 슬라이드 조작이 수신되면 상기 슬라이드 시작점으로부터 상기 슬라이드 끝점까지 가리키는 보조선 또는 이동 경로를 상기 UI 상에 디스플레이하는 단계를 더 포함하는, 방법.공개특허 10-2021-0115000-3-청구항 7 제2항에 있어서, 상기 신호 컨트롤은 맵 확장 컨트롤을 포함하고, 상기 UI 상에서 방향 조작을 수신하는단계는:상기 UI 상의 상기 맵 확장 컨트롤에 가해진 제3 터치 조작을 수신하는 단계;상기 제3 터치 조작에 따라 가상 환경의 맵 보기 컨트롤을 상기 UI 상에 디스플레이하는 단계; 및상기 맵 보기 컨트롤 상의 상기 타깃 디스플레이 요소에 가해진 제4 터치 조작을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 UI는 가상 환경 이미지 및 상호작용 패널 영역을 포함하고, 상기 가상 환경 이미지는 상기 마스터 가상 캐릭터에 대응하는 관점에서 관찰된 가상 환경의 이미지이고, 상기 가상 환경은 적어도 2명의가상 캐릭터가 전투하도록 구성된 전투 환경이며;상기 디스플레이 요소들은 다음과 같은 요소들:상기 가상 환경에서 전투 기능 요소들을 형성하는 3차원 모델들 또는 2차원 요소들;상기 상호작용 패널 영역의 정보 디스플레이 요소들; 및상기 상호작용 패널 영역의 제어 기능 요소들중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 디스플레이 요소들은 다음과 같은 요소들:상기 가상 환경에서 장식에 이용되는 3차원 모델들 또는 2차원 요소들;상기 가상 환경에서 실제 세계와 연관된 요소들;상기 가상 환경에서 사용자 계정들과 연관된 요소들; 및상기 가상 환경에서 상기 사용자 계정들이 속하는 팀들과 연관된 요소들중 적어도 하나를 더 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 디스플레이 요소들은 다음과 같은 요소들:다른 사용자 계정들에 의해 전송된 프롬프트 정보중 적어도 하나를 더 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제10항 중 어느 한 항에 있어서, 상기 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하는 단계는,상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계를 포함하고,상기 거동 트리는 상기 디스플레이 요소들, 상기 전투 정보, 및 상기 프롬프트 정보 사이의 대응관계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 스킬 클래스 디스플레이 요소들을 포함하고, 상기 전투 정보는공개특허 10-2021-0115000-4-스킬 가용성 상태를 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계는,상기 타깃 디스플레이 요소가 상기 스킬 클래스 디스플레이 요소이고 상기 타깃 디스플레이 요소에 대응하는 스킬 가용성 상태가 이용불가능할 때, 스킬이 이용불가능함을 나타내는데 이용되는 제1 타깃 프롬프트 정보를 결정하는 단계; 및상기 타깃 디스플레이 요소가 상기 스킬 클래스 디스플레이 요소이고 상기 타깃 디스플레이 요소에 대응하는 스킬 가용성 상태가 이용가능할 때, 스킬이 이용가능함을 나타내는데 이용되는 제2 타깃 프롬프트 정보를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 스킬 클래스 디스플레이 요소들을 포함하고, 상기 전투 정보는스킬 쿨다운(CD) 시간을 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계는,상기 타깃 디스플레이 요소가 상기 스킬 클래스 디스플레이 요소이고 상기 타깃 디스플레이 요소에 대응하는 스킬 CD 시간이 유효한 경우, 스킬 CD 시간을 나타내는데 이용되는 제3 타깃 프롬프트 정보를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 자원 클래스 디스플레이 요소들을 포함하고, 상기 전투 정보는상기 자원 클래스 디스플레이 요소의 시야 정보를 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계는,상기 타깃 디스플레이 요소가 상기 자원 클래스 디스플레이 요소이고 상기 타깃 디스플레이 요소에 대응하는 시야 정보가 적의 시야를 갖는 경우, 적이 자원을 획득하고 있다는 것을 나타내는데 이용되는 제4 타깃 프롬프트정보를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 자원 클래스 디스플레이 요소들을 포함하고, 상기 전투 정보는상기 자원 클래스 디스플레이 요소의 리프레시 정보를 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계는,상기 타깃 디스플레이 요소가 상기 자원 클래스 디스플레이 요소 및 상기 리프레시 정보인 경우, 상기 자원 클래스 디스플레이 요소의 남은 리프레시 시간을 나타내는데 이용되는 제5 타깃 프롬프트 정보를 결정하는 단계를포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 가상 캐릭터 클래스 디스플레이 요소들을 포함하고, 상기 전투정보는 상기 가상 캐릭터 클래스 디스플레이 요소의 상태를 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계는,상기 타깃 디스플레이 요소가 상기 가상 캐릭터 클래스 디스플레이 요소이고 상기 타깃 디스플레이 요소의 상태가 제1 지정된 상태인 경우, 상기 가상 캐릭터 클래스 디스플레이 요소가 상기 제1 지정된 상태에 있다는 것을공개특허 10-2021-0115000-5-나타내는데 이용되는 제6 타깃 프롬프트 정보를 결정하는 단계를 포함하고,상기 상태는, 혈액량 상태, 마법 상태, 철수 상태, 이동 상태, 공격 상태, 공격받은 상태, 장비 상태, 레벨 상태, 및 외부 착용 상태 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 건설 클래스 디스플레이 요소들을 포함하고, 상기 전투 정보는상기 건설 클래스 디스플레이 요소의 상태를 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계는,상기 타깃 디스플레이 요소가 상기 건설 클래스 디스플레이 요소이고 상기 타깃 디스플레이 요소의 상태가 제2지정된 상태인 경우, 상기 건설 클래스 디스플레이 요소가 상기 제2 지정된 상태에 있다는 것을 나타내는데 이용되는 제7 타깃 프롬프트 정보를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 네트워크 정보 디스플레이 요소를 포함하고, 상기 전투 정보는네트워크 속도 정보를 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계는,상기 타깃 디스플레이 요소가 상기 네트워크 정보 디스플레이 요소이고 상기 네트워크 속도 정보의 네트워크 속도가 제1 임계값 미만인 경우, 네트워크 속도 상태를 나타내는데 이용되는 제8 타깃 프롬프트 정보를 결정하는단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 하드웨어 성능 디스플레이 요소를 포함하고, 상기 전투 정보는하드웨어 작동 성능 파라미터를 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 예상된 타깃 프롬프트 정보에 대한 거동 트리를 질의하는 단계는,상기 타깃 디스플레이 요소가 상기 하드웨어 성능 디스플레이 요소이고 상기 하드웨어 작동 성능 파라미터가 제2 임계값 미만인 경우, 네트워크 속도 상태를 나타내는데 이용되는 제9 타깃 프롬프트 정보를 결정하는 단계를포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서, 상기 타깃 디스플레이 요소는 프롬프트 정보 디스플레이 요소를 포함하고, 상기 전투 정보는상기 프롬프트 정보 디스플레이 요소에 메시지 내용을 포함하며;상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 예상된 타깃 프롬프트 정보에 대한 거동 트리를 질의하는 단계는,상기 타깃 디스플레이 요소가 상기 프롬프트 정보 디스플레이 요소인 경우, 상기 메시지 내용에 자동으로 응답하는데 이용되는 제10 타깃 프롬프트 정보를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제1항 내지 제20항 중 어느 한 항에 있어서, 상기 UI는 이동 컨트롤을 더 포함하고, 상기 이동 컨트롤은 상기가상 환경에서 이동하기 위해 상기 마스터 가상 캐릭터를 제어하도록 구성된 컨트롤이며,상기 이동 컨트롤과 상기 신호 컨트롤은 상기 UI 상에서 서로 멀리 떨어진 2개의 주변 영역(marginal region)에위치하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "공개특허 10-2021-0115000-6-단말기에 의해 수행되는 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법으로서,상기 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스(UI)를 디스플레이하는 단계;상기 UI 상에서 방향 조작을 수신하는 단계 ― 상기 방향 조작은 프롬프트 정보 전송 기능을 활성화하고 상기UI 내의 타깃 디스플레이 요소를 가리키는 조작이며, 상기 타깃 디스플레이 요소는 상기 UI 내의 복수의 디스플레이 요소 중 하나임 ―;상기 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하는 단계; 및상기 UI 상에 타깃 프롬프트 정보를 디스플레이하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 UI는 상호작용 패널 영역을 포함하고, 상기 상호작용 패널 영역은 신호 컨트롤을 포함하며; 상기 방향 조작은 상기 신호 컨트롤로부터 상기 UI 내의 타깃 디스플레이 요소를 가리키는 조작인, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서, 상기 신호 컨트롤은 버튼 컨트롤을 포함하고, 상기 UI 상에서 방향 조작을 수신하는 단계는:상기 UI 상의 버튼 컨트롤에 가해진 제1 터치 조작을 수신하는 단계;하나 이상의 후보 디스플레이 요소를 상기 UI 상에 디스플레이하는 단계; 및상기 UI 상의 후보 디스플레이 요소들 중의 상기 타깃 디스플레이 요소에 가해진 제2 터치 조작을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서, 상기 하나 이상의 후보 디스플레이 요소를 상기 UI 상에 디스플레이하는 단계는:상기 UI 상에 상기 하나 이상의 후보 디스플레이 요소를 하이라이트 방식으로 디스플레이하는 단계를 포함하고,상기 하이라이트 방식은 다음과 같은 디스플레이 방식들: 타깃 컬러 디스플레이 방식, 오버레이 마스킹 디스플레이 방식, 하이라이트 디스플레이 방식, 및 윤곽선 디스플레이 방식 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제23항에 있어서, 상기 신호 컨트롤은 버튼 컨트롤을 포함하고, 상기 UI 상에서 방향 조작을 수신하는 단계는:상기 UI 상에서 슬라이드 조작을 수신하는 단계를 포함하고, 상기 슬라이드 조작의 슬라이드 시작점은 상기 버튼 컨트롤이고, 상기 슬라이드 조작의 슬라이드 끝점은 상기 타깃 디스플레이 요소인, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 상기 방법은:상기 버튼 컨트롤 상에서 상기 슬라이드 조작이 수신되는 경우 상기 슬라이드 시작점으로부터 상기 슬라이드 끝점까지 가리키는 보조선 또는 이동 경로를 상기 UI 상에 디스플레이하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제23항에 있어서, 상기 신호 컨트롤은 맵 확장 컨트롤을 포함하고, 상기 UI 상에서 방향 조작을 수신하는 단계는:상기 UI 상의 상기 맵 확장 컨트롤에 가해진 제3 터치 조작을 수신하는 단계;상기 제3 터치 조작에 따라 가상 환경의 맵 보기 컨트롤을 상기 UI 상에 디스플레이하는 단계; 및공개특허 10-2021-0115000-7-상기 맵 보기 컨트롤 상의 상기 타깃 디스플레이 요소에 가해진 제4 터치 조작을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제22항에 있어서, 상기 UI는 가상 환경 이미지 및 상호작용 패널 영역을 포함하고, 상기 가상 환경 이미지는 마스터 가상 캐릭터에 대응하는 관점에서 관찰된 가상 환경의 이미지이고, 상기 가상 환경은 적어도 2명의 가상캐릭터가 전투하도록 구성된 전투 환경이며;상기 디스플레이 요소들은 다음과 같은 요소들:상기 가상 환경에서 전투 기능 요소들을 형성하는 3차원 모델들 또는 2차원 요소들;상기 상호작용 패널 영역의 정보 디스플레이 요소들; 및상기 상호작용 패널 영역의 제어 기능 요소들중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제29항에 있어서, 상기 디스플레이 요소들은 다음과 같은 요소들:상기 가상 환경에서 장식에 이용되는 3차원 모델들 또는 2차원 요소들;상기 가상 환경에서 실제 세계와 연관된 요소들;상기 가상 환경에서 사용자 계정들과 연관된 요소들; 및상기 가상 환경에서 상기 사용자 계정들이 속하는 팀들과 연관된 요소들중 적어도 하나를 더 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제29항에 있어서, 상기 디스플레이 요소들은 다음과 같은 요소들:다른 사용자 계정들에 의해 전송된 프롬프트 정보중 적어도 하나를 더 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제22항 내지 제31항 중 어느 한 항에 있어서, 상기 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트정보를 예측하는 단계는,상기 타깃 디스플레이 요소 및 상기 전투 정보에 따라 상기 타깃 프롬프트 정보에 대한 거동 트리를 질의하는단계를 포함하고,상기 거동 트리는 상기 디스플레이 요소들, 상기 전투 정보, 및 상기 프롬프트 정보 사이의 대응관계를 포함하는, 방법."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 장치로서,상기 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스(UI)를 디스플레이하도록 구성된 디스플레이모듈;상기 UI 상에서 방향 조작을 수신하도록 구성된 상호작용 모듈 ― 상기 방향 조작은 프롬프트 정보 전송 기능을활성화하고 상기 UI 내의 타깃 디스플레이 요소를 가리키는 조작이며, 상기 타깃 디스플레이 요소는 상기 UI 내의 복수의 디스플레이 요소 중 하나임 ―;상기 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하도록 구성된 예측 모듈; 및공개특허 10-2021-0115000-8-마스터 가상 캐릭터의 팀원 가상 캐릭터들 또는 전투의 모든 가상 캐릭터들의 클라이언트들에게 상기 타깃 프롬프트 정보를 전송하도록 구성된 전송 모듈을 포함하는, 장치."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 장치로서,상기 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스(UI)를 디스플레이하도록 구성된 디스플레이모듈;상기 UI 상에서 방향 조작을 수신하도록 구성된 상호작용 모듈 ― 상기 방향 조작은 프롬프트 정보 전송 기능을활성화하고 상기 UI 내의 타깃 디스플레이 요소를 가리키는 조작이며, 상기 타깃 디스플레이 요소는 상기 UI 내의 복수의 디스플레이 요소 중 하나임 ―; 및상기 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하도록 구성된 예측 모듈을 포함하고,상기 디스플레이 모듈은 상기 UI 상에 상기 타깃 프롬프트 정보를 디스플레이하도록 구성되는, 장치."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "프로세서와 메모리를 포함하는 단말기로서, 상기 메모리는 적어도 하나의 명령어, 적어도 하나의 프로그램, 및코드 세트 또는 명령어 세트를 저장하고, 상기 적어도 하나의 명령어, 상기 적어도 하나의 프로그램, 및 상기코드 세트 또는 상기 명령어 세트는 상기 프로세서에 의해 로드되고 실행되어, 제1항 내지 제21항 중 어느 한항에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 또는 제22항 내지 제32항 중 어느 한 항에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법을 구현하는, 단말기."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "적어도 하나의 명령어, 적어도 하나의 프로그램, 및 코드 세트 또는 명령어 세트를 저장하는 컴퓨터 판독가능한저장 매체로서,상기 적어도 하나의 명령어, 상기 적어도 하나의 프로그램, 및 상기 코드 세트 또는 상기 명령어 세트는 프로세서에 의해 로드되고 실행되어, 제1항 내지 제21항 중 어느 한 항에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 또는 제22항 내지 제32항 중 어느 한 항에 따른 멀티플레이어 온라인전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법을 구현하는, 컴퓨터 판독가능한 저장 매체."}
{"patent_id": "10-2021-7025848", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "명령어들을 포함하는 컴퓨터 프로그램 제품으로서,상기 명령어들은 컴퓨터에서 실행될 때, 상기 컴퓨터로 하여금 제1항 내지 제21항 중 어느 한 항에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법을 수행하게 하거나 제22항 내지 제32항중 어느 한 항에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법을 수행하게 하는, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2021-7025848", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보 전송 방법 및 장치, 및 단말기가 개시된다. 이 방법은: 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스를 디스플레이하는 단계; 사용자 인터페이스 상에 서 방향 조작을 수신하는 단계 ― 방향 조작은 프롬프트 정보 전송 기능을 활성화하기 위한 조작이고, 사용 (뒷면에 계속)"}
{"patent_id": "10-2021-7025848", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원 본 출원은, 참조에 의해 그 전체 내용이 본 명세서에 포함되는, 2019년 7월 19일 중국 지적 재산부(National Intellectual Property Administration, PRC)에 제출된 발명의 명칭이 \"METHOD, APPARATUS, AND TERMINAL FOR TRANSMITTING PROMPT INFORMATION IN MULTIPLAYER ONLINE BATTLE PROGRAM\"인 중국 특허 출원 제 201910655572.6호의 우선권을 주장한다.기술 분야 본 출원은, 컴퓨터 기술 분야, 특히 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 위한 기술에 관한 것이다."}
{"patent_id": "10-2021-7025848", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "멀티플레이어 온라인 전투 아레나(multiplayer online battle arena)(MOBA)는 인기있는 게임 장르이다. 이 장 르의 게임에서, 사용자들은 2개의 팀으로 나뉘고, 2개의 팀은 흩어져있는 게임 맵에서 서로 경쟁한다. 각각의 사용자는, 실시간 전략(RTS) 스타일의 인터페이스를 이용하여 선택한 캐릭터를 제어하고, 사용자는 사용자가 선 택한 캐릭터만 제어하면 된다. 종래 기술에서, MOBA 게임은 상이한 사용자들 사이의 통신에 이용되는 신호 시스템을 포함한다. 신호 시스템은, 공격 버튼, 퇴각 버튼 및 집결 버튼을 포함한다. 사용자 A가 전투 라운드에서 공격 버튼을 클릭/탭 하면, 사용자 A와 동일한 팀에 속한 다른 사용자들은 신호 시스템으로부터의 \"공격 시작\"을 나타내는 텍스트 프 롬프트와 음성 프롬프트를 수신할 수 있다. 사용자 B가 전투 라운드에서 퇴각 버튼을 클릭/탭하면, 사용자 B와 동일한 팀에 속한 다른 사용자들은 신호 시스템으로부터 \"퇴각 시작\"을 나타내는 텍스트 프롬프트와 음성 프롬 프트를 수신할 수 있다. 사용자 C가 전투 라운드에서 집결 버튼을 클릭/탭하면, 사용자 C와 동일한 팀에 속한 다른 사용자들은 신호 시스템으로부터 \"집결 요청\"을 나타내는 텍스트 프롬프트와 음성 프롬프트를 수신할 수 있다. 신호 시스템은 비교적 간단하고 제한적이며, 수개 유형의 프롬프트 정보만 전송할 수 있어서, 사용자들의 통신 요구조건들을 충족할 수 없다. 본 출원은, 종래의 비교적 단순하고 제한된 신호 시스템의 문제점을 해결할 수 있는, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하는 방법, 장치 및 단말기를 제공한다. 기술적 솔루션들은 다음과 같다. 본 출원의 한 양태에 따르면, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법이 제공되고, 이것은 단말기에 의해 수행되며, 다음과 같은 단계들을 포함한다: 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스(UI)를 디스플레이하는 단계; UI 상에서 방향 조작을 수신하는 단계 ― 방향 조작은 프롬프트 정보 전송 기능을 활성화하고 UI 내의 타깃 디 스플레이 요소를 가리키는 조작이며, 타깃 디스플레이 요소는 UI 내의 복수의 디스플레이 요소 중 하나임 ―; 및 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하는 단계; 및 마스터 가상 캐릭터의 팀원 가상 캐릭터들 또는 전투의 모든 가상 캐릭터의 클라이언트들에게 타깃 프롬프트 정 보를 전송하는 단계. 본 출원의 또 다른 양태에 따르면, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위 한 방법이 제공되고, 이것은 단말기에 의해 수행되며, 다음과 같은 단계들을 포함한다: 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스(UI)를 디스플레이하는 단계; UI 상에서 방향 조작을 수신하는 단계 ― 방향 조작은 프롬프트 정보 전송 기능을 활성화하고 UI 내의 타깃 디 스플레이 요소를 가리키는 조작이며, 타깃 디스플레이 요소는 UI 내의 복수의 디스플레이 요소 중 하나임 ―; 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하는 단계; 및 UI 상에 타깃 프롬프트 정보를 디스플레이하는 단계. 본 출원의 또 다른 양태에 따르면, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 장 치가 제공되고, 이 장치는 다음과 같은 모듈들을 포함한다: 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스(UI)를 디스플레이하도록 구성된 디스플레이 모듈; UI 상에서 방향 조작을 수신하도록 구성된 상호작용 모듈 ― 방향 조작은 프롬프트 정보 전송 기능을 활성화하 고 UI 내의 타깃 디스플레이 요소를 가리키는 조작이며, 타깃 디스플레이 요소는 UI 내의 복수의 디스플레이 요 소 중 하나임 ―; 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하도록 구성된 예측 모듈, 및 마스터 가상 캐릭터의 팀원 가상 캐릭터들 또는 전투의 모든 가상 캐릭터의 클라이언트들에게 타깃 프롬프트 정 보를 전송하도록 구성된 전송 모듈. 본 출원의 또 다른 양태에 따르면, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위 한 장치가 제공되고, 이 장치는: 멀티플레이어 온라인 전투 프로그램의 사용자 인터페이스(UI)를 디스플레이하도록 구성된 디스플레이 모듈; UI 상에서 방향 조작을 수신하도록 구성된 상호작용 모듈 ― 방향 조작은 프롬프트 정보 전송 기능을 활성화하 고 UI 내의 타깃 디스플레이 요소를 가리키는 조작이며, 타깃 디스플레이 요소는 UI 내의 복수의 디스플레이 요 소 중 하나임 ―; 및 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하도록 구성된 예측 모듈 을 포함하고, 상기 디스플레이 모듈은 UI 상에 타깃 프롬프트 정보를 디스플레이하도록 구성된다. 본 출원의 또 다른 양태에 따르면, 프로세서 및 메모리를 포함하는 단말기가 제공되고, 메모리는 적어도 하나의 명령어, 적어도 하나의 프로그램, 및 코드 세트 또는 명령어 세트를 저장하고, 적어도 하나의 명령어, 적어도 하나의 프로그램, 코드 세트 또는 명령어 세트는 프로세서에 의해 로드 및 실행되어, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 및/또는 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법을 구현한다. 본 출원의 또 다른 양태에 따르면, 적어도 하나의 명령어, 적어도 하나의 프로그램, 및 코드 세트 또는 명령어 세트를 저장한 컴퓨터 판독가능한 저장 매체가 제공되고, 적어도 하나의 명령어, 적어도 하나의 프로그램, 및 코드 세트 또는 명령어 세트는 프로세서에 의해 로드되고 실행되어, 멀티플레이어 온라인 전투 프로그램에서 프 롬프트 정보를 전송하기 위한 방법, 및/또는 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레 이하기 위한 방법을 구현한다. 본 출원의 또 다른 양태에 따르면, 명령어들을 포함하는 컴퓨터 프로그램 제품이 제공되고, 명령어들은, 컴퓨터 에서 실행될 때 컴퓨터로 하여금 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 및/또는 및/또는 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법을 수행하 게 한다. 본 출원의 실시예들에서 제공되는 기술적 솔루션들은 적어도 다음과 같은 유익한 효과를 달성한다. 방향 조작이 수신되면, 전송될 것으로 예상되는 타깃 프롬프트 정보가 타깃 디스플레이 요소 및 전투 정보에 따 라 예측되고, 타깃 프롬프트 정보는 마스터 가상 캐릭터의 팀원 가상 캐릭터들 또는 전투 내의 모든 가상 캐릭 터의 클라이언트들에게 전송된다. 따라서, 사용자는 최소한의 인간-머신 상호작용 비용으로 사용자의 기대를 충족하는 프롬프트 정보를 전송할 수 있다. 멀티플레이어 온라인 전투 프로그램은, 사용자에 의해 표현된 생각 과 전투 정보에 기초하여 현재의 전투 시나리오에서 사용자가 전송하기를 원하는 신호를 지능적으로 결정하고 선택하여 사용자와 다른 사용자들 사이의 정보 전달에서 인간-머신 상호작용 효율성을 향상시킨다."}
{"patent_id": "10-2021-7025848", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원의 목적들, 기술적 솔루션들 및 이점들을 더욱 명확하게 하기 위해, 이하에서는 첨부된 도면들을 참조하 여 본 출원의 구현을 상세히 설명한다.먼저, 본 출원에 관련된 몇 가지 용어를 소개하고 설명한다. 가상 환경: 이것은 애플리케이션이 단말기에서 실행될 때 디스플레이되는(또는 제공되는) 가상 환경이다. 가상 환경은 실제 세계의 시뮬레이션된 환경이거나, 반-시뮬레이션된 반-가상 환경이거나, 완전히 가상의 환경일 수 있다. 가상 환경은, 2차원 가상 환경, 2.5차원 가상 환경, 및 3차원 가상 환경 중 어느 하나일 수 있다. 일부 실시예에서, 가상 환경은 또한, 적어도 2개의 가상 캐릭터 사이의 가상 환경 전투에 이용되며, 가상 환경에는 적어도 2개의 가상 캐릭터에 이용가능한 가상 자원들이 있다. 일부 실시예에서, 가상 환경은 맵을 포함할 수 있고, 맵은 2개의 대칭 영역을 포함할 수 있다. 2개의 반대 캠프의 가상 캐릭터들이 각각 대응하는 영역을 점 유하며, 목표는, 각각의 캠프가 상대방 영역 깊숙한 곳에 있는 타깃 건물을 파괴하는 것이다. 가상 캐릭터(여기서는, 영웅이라고도 함): 가상 환경에서 이동가능한 객체를 말한다. 이동가능한 객체는, 가상 의 인간, 가상의 동물, 애니메이션된 인간 캐릭터 중 적어도 하나일 수 있다. 일부 실시예에서, 가상 세계가 3 차원 가상 세계일 때, 가상 캐릭터는 3차원 모델일 수 있다. 각각의 가상 캐릭터는, 3차원 가상 세계에서 그 자신의 고유한 형상과 크기를 가지며, 3차원 가상 세계에서 일부 공간을 점유한다. 일부 실시예에서, 가상 캐 릭터는 3차원 인간 골격 기술에 기초하여 구성된 3차원 캐릭터이다. 가상 캐릭터는 상이한 외모를 얻기 위해 상이한 스킨을 착용한다. 일부 구현에서, 가상 캐릭터는 또한 2.5차원 모델 또는 2차원 모델을 이용하여 구현 될 수 있으며, 이것은 본 출원의 실시예들에서 제한되지 않는다. 본 출원의 일부 실시예에서, 가상 캐릭터들은 가상 환경에서 사용자들에 의해 제어될 수 있는 가상 캐릭터들이고, (크립들, 몬스터들, 및 비플레이어 캐릭터 들(NPC들) 등의) 사용자들에 의해 제어될 수 없는 가상 캐릭터들은 지원 가상 캐릭터들이라고 한다. MOBA: 가상 환경에서 제공되는 맵에서 적어도 2개의 서로 대적하는 캠프의 상이한 가상 팀들이 각각의 맵 영역 을 점유하고, 특정한 승리 조건을 달성하기 위해 서로 경쟁하는 아레나 게임이다. 승리 조건은, 상대 캠프의 요새 점령 또는 요새 파괴, 상대 캠프의 가상 캐릭터 죽이기, 명시된 시나리오 및 시간에서 살아 남기, 특정한 자원 장악, 명시된 시간 내의 상대보다 많은 득점 중 적어도 하나를 포함하지만, 이것으로 제한되는 것은 아니 다. 전투 아레나 게임은 라운드로 진행될 수 있다. 전투 아레나 게임의 상이한 라운드들에서 동일한 맵 또는 상이한 맵들이 이용될 수 있다. 각각의 가상 팀은, 하나 이상의 가상 캐릭터, 예를 들어, 1 가상 캐릭터, 3 가 상 캐릭터, 또는 5 가상 캐릭터를 포함한다. MOBA 게임: 가상 세계에 여러 개의 요새가 제공되고, 상이한 캠프의 사용자들이 가상 세계에서 전투를 하거나, 상대 캠프의 요새를 점령하거나 요새를 파괴하기 위해 가상 캐릭터들을 제어하는 게임이다. 예를 들어, MOBA 게임에서 사용자들은 2개의 반대 캠프로 나누어질 수 있다. 사용자들에 의해 제어되는 가상 캐릭터들은 가상 세계에 흩어져 서로 경쟁하며, 승리 조건은 모든 적 요새를 파괴하거나 점령하는 것이다. MOBA 게임은 라운드 로 진행된다. MOBA 게임의 라운드 지속시간은 게임이 시작되는 시점부터 승리 조건이 충족되는 시점까지이다. 전형적인 MOBA 게임에서, 상이한 사용자들 사이의 전투 라운드에서 통신 시스템은 다음 3개 부분을 포함한다. 1. 내장 음성 시스템. 복수의 사용자간에 음성 통신 채널이 형성되며, 사용자들은 말하기 전에 마이크로폰을 온시킬 필요가 있다. 2. 내장 채팅 시스템. 복수의 사용자간에 텍스트 기반의 채팅 채널이 형성되며, 사용자들은 통신을 위해 단말기에서 타이핑할 필요가 있다. 3. (공격 버튼, 퇴각 버튼, 집결 버튼, 미니맵 표시 기능을 포함한) 내장 신호 시스템. 공격 버튼, 퇴각 버튼, 집결 버튼, 미니 맵이 UI에 디스플레이되며, 사용자는 버튼들 또는 미니맵을 클릭/탭하 여 빠르게 통신을 개시한다. 많은 MOBA 게임은 모바일 전화 게임들(줄여서 모바일 게임들)이다. 모바일 전화에서 MOBA 게임을 플레이하는 사용자는, 침실이나 객차에서 등의, 말하기에 적합하지 않은 장소에 있을 수 있으므로, 사용자는 음성 통신 채 널을 이용하여 효과적으로 통신할 수 없다. 또한, 통신을 위한 음성 통신 채널의 이용은, 또한 네트워크 지연 으로 이어질 수 있다. 모바일 전화들의 경우, 인터페이스에서 이미 MOBA 게임이 실행 중일 때 터치스크린 상에 서 타이핑하는 것은 높은 인간-머신 상호작용 비용을 요구하며 전투 라운드에서 전투 행동을 방해한다. 내장 신호 시스템은 몇 가지 유형의 프롬프트 정보만을 전송할 수 있다. 즉, 내장된 신호 시스템은 적어도 2개의 차 원에서 문제를 갖는다:1. 전송될 수 있는 신호들이 너무 단순하고 제한적이다; 및 2. 인간-머신 상호작용의 비용이 높다. 본 출원의 실시예들은 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 시스템(줄여서, 신호 시스템)을 제공한다. 이 시스템에 기초하여, 사용자는 음성 튜닝이나 타이핑 기능없이 최소한의 인간-머 신 상호작용 조작 비용으로 생각을 표현할 수 있다. 본 출원의 실시예들은, 사용자 플레이어에 의해 표현된 생 각과 현재 전투의 실시간 구현 상태에 따라 현재 시나리오 하에서 플레이어가 전송 또는 전달하기를 원하는 신 호들을 지능적으로 결정하고 선택할 수 있다. 도 1은 본 출원의 한 예시적인 실시예에 따른 컴퓨터 시스템의 구조적 블록도이다. 컴퓨터 시스템은, 제1 단말기, 서버 클러스터, 및 제2 단말기를 포함한다. 가상 환경을 지원하는 클라이언트는, 제1 단말기에 설치되어 실행되며, 클라이언트는 멀티플레 이어 온라인 전투 프로그램일 수 있다. 제1 단말기가 클라이언트를 실행하면, 클라이언트의 UI가 제 1 단말기의 스크린에 디스플레이된다. 클라이언트는, 군사 시뮬레이션 프로그램, MOBA 게임, 전투 로얄 슈팅 게임, 및 시뮬레이션 게임(SLG) 중 어느 하나일 수 있다. 이 실시예에서, 클라이언트가 MOBA 게임인 예가 설명을 위해 이용된다. 제1 단말기는 제1 사용자에 의해 이용되는 단말기이다. 제1 사 용자는 제1 단말기를 이용해 가상 환경에 위치한 제1 가상 캐릭터를 제어하여 활동을 수행하며, 제1 가상 캐릭터는 제1 사용자의 마스터 가상 캐릭터라고 지칭될 수 있다. 제1 가상 캐릭터의 활동은, 신체 자세 조정, 포복, 걷기, 달리기, 승마, 점프, 운전, 집기, 사격, 공격 및 던지기 중 적어도 하나를 포함하지만 이것으로 제한되는 것은 아니다. 예를 들어, 제1 가상 캐릭터는 제1 가상 인간, 예를 들어 시뮬레이션된 인간 캐릭터 또는 애니메이션된 인간 캐릭터이다. 가상 환경을 지원하는 클라이언트는, 제2 단말기에 설치되어 실행되며, 클라이언트는 멀티플레 이어 온라인 전투 프로그램일 수 있다. 제2 단말기가 클라이언트를 실행하면, 제2 단말기의 스 크린 상에 클라이언트의 UI가 디스플레이된다. 클라이언트는, 군사 시뮬레이션 프로그램, MOBA 게임, 전투 로얄 슈팅 게임, 및 시뮬레이션 게임(SLG) 중 어느 하나일 수 있다. 이 실시예에서, 클라이언트 가 MOBA 게임인 예가 설명을 위해 이용된다. 제2 단말기는 제2 사용자에 의해 이용되는 단말기 이다. 제2 사용자는 제2 단말기를 이용해 가상 환경에 위치한 제2 가상 캐릭터를 제어하여 활동을 수행하며, 제2 가상 캐릭터는 제2 사용자의 마스터 가상 캐릭터라고 지칭될 수 있다. 예를 들어, 제2 가 상 캐릭터는 제2 가상 인간, 예를 들어 시뮬레이션된 인간 캐릭터 또는 애니메이션된 인간 캐릭터이다. 일부 실시예에서, 제1 가상 인간 및 제2 가상 인간은 동일한 가상 환경에 위치한다. 일부 실시예에서, 제1 가 상 인간 및 제2 가상 인간은, 동일한 캠프, 동일한 팀, 또는 동일한 조직에 속할 수 있고, 친구이거나, 일시적 인 통신 허가를 가질 수 있다. 일부 실시예에서, 제1 가상 인간 및 제2 가상 인간은 대안으로서 상이한 캠프들, 상이한 팀들 또는 상이한 조직들에 속할 수 있거나, 서로에 대한 적일 수 있다. 일부 실시예에서, 제1 단말기에 설치된 클라이언트는 제2 단말기에 설치된 클라이언트와 동일하거나, 2개의 단말기에 설치된 클라이언트들은 상이한 운영 체제 플랫폼(안드로이드 시스템 또는 iOS 시스템) 상의 동 일한 유형의 클라이언트들이다. 제1 단말기는 일반적으로 복수의 단말기 중 하나를 지칭할 수 있고, 제2 단말기는 일반적으로 복수의 단말기 중 또 다른 단말기를 지칭할 수 있다. 본 실시예에서, 제1 단말기 및 제2 단말기는 설명을 위한 예로서 이용된 것일 뿐이다. 제1 단말기와 제2 단말기는 동일하거나 상이한 디바이스 유형일 수 있으며, 디바이스 유형은, 스마트폰, 태블릿 컴퓨터, 전자 책 리더, 동 영상 전문가 그룹 오디오 레이어 Ⅲ(MP3) 플레이어, 동영상 전문가 그룹 오디오 레이어 Ⅳ(MP4) 플레이어, 랩탑, 및 데스크탑 컴퓨터 중 적어도 하나를 포함한다. 도 1은 2개의 단말기만을 도시한다. 그러나, 상이한 실시예들에서 복수의 다른 단말기가 서버 클러스터 에 액세스할 수 있다. 일부 실시예에서, 하나 이상의 단말기는 개발자에 대응하는 단말기이다. 클 라이언트를 위한 개발 및 편집 플랫폼이 단말기에 설치된다. 개발자는 단말기에서 클라이언트를 편 집 및 업데이트하고, 업데이트된 클라이언트 설치 팩키지를 유선 또는 무선 네트워크를 통해 서버 클러스터 에 전송할 수 있다. 제1 단말기 및 제2 단말기는 서버 클러스터로부터 클라이언트 설치 팩키지를 다운로드하여 클라이언트를 업데이트할 수 있다. 제1 단말기, 제2 단말기, 및 다른 단말기는, 무선 네트워크 또는 유선 네트워크를 통해 서버 클 러스터에 접속된다.서버 클러스터는, 하나의 서버, 복수의 서버, 클라우드 컴퓨팅 플랫폼, 및 가상화 센터 중 적어도 하나를 포함한다. 서버 클러스터는 가상 환경을 지원하는 클라이언트에 백그라운드 서비스를 제공하도록 구성된 다. 일부 실시예에서, 서버 클러스터는 1차 컴퓨팅 작업을 담당하고, 단말기는 2차 컴퓨팅 작업을 담당한 다; 또는, 서버 클러스터는 2차 컴퓨팅 작업을 담당하고, 단말기는 1차 컴퓨팅 작업을 담당한다; 또는 서 버 클러스터와 단말기(제1 단말기 및 제2 단말기)는 서로 분산형 컴퓨팅 아키텍처를 이용하여 협력적 컴퓨팅을 수행한다. 도시된 예에서, 서버 클러스터는 서버 및 서버를 포함한다. 서버는, 프로세서, 사용 자 계정 데이터베이스, 전투 서비스 모듈, 및 사용자 지향형 입력/출력(I/O) 인터페이스를 포함 한다. 프로세서는, 서버에 저장된 명령어들을 로드하고 사용자 계정 데이터베이스 및 전투 서 비스 모듈의 데이터를 처리하도록 구성된다. 사용자 계정 데이터베이스는, 제1 단말기, 제2 단 말기 및 기타의 단말기들에 의해 이용되는 사용자 계정의 데이터, 예를 들어 사용자 계정들의 아바타 들, 사용자 계정들의 닉네임들, 사용자 계정들의 전투 효과 지수들, 및 사용자 계정들의 서비스 구역들을 저장 하도록 구성된다. 전투 서비스 모듈은, 사용자들이 전투할 수 있는 복수의 전투 룸, 예를 들어, 1V1 전투 룸, 3V3 전투 룸, 5V5 전투 룸 등을 제공하도록 구성된다. 사용자 지향 I/O 인터페이스는, 데이터 교환을 위해 무선 네트워크 또는 유선 네트워크를 통해 제1 단말기 및/또는 제2 단말기 사이에 통신을 확립 하도록 구성된다. 일부 실시예에서, 스마트 신호 모듈은 서버에 배치되고, 스마트 신호 모듈은 이하의 실시예에서 제공되는 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법을 구 현하도록 구성된다. 도 2는 본 출원의 예시적인 실시예에 따른 MOBA 게임 가상 환경에서 제공되는 맵의 개략도이다. 맵은 사각형 형상이다. 맵은, 좌측 하단 삼각형 영역과 우측 상단 삼각형 영역으로 대각선으로 분할된다. 좌측 하단 삼각형 영역의 좌측 하단 코너로부터 우측 상단 삼각형 영역의 우측 상단 코너까지, 3개의 통로 가 있다: 상단 통로, 중간 통로 및 하단 통로. 전형적인 전투 라운드에서, 전투를 위해 2개의 캠 프로 나뉘어지는 10명의 가상 캐릭터가 필요하다. 제1 캠프의 5명의 가상 캐릭터는 좌측 하단 삼각형 영역 을 점유하고, 제2 캠프의 5명의 가상 캐릭터는 우측 상단의 삼각형 영역을 점유한다. 제1 캠프의 승 리 조건은, 제2 캠프의 모든 요새를 파괴하거나 점령하는 것이고, 제2 캠프의 승리 조건은 제1 캠프의 모든 요 새를 파괴하거나 점령하는 것이다. 예를 들어, 제1 캠프의 요새는 9개의 포탑과 제1 기지를 포함한다. 9개의 포탑 중, 상단 통로 , 중간 통로, 및 하단 통로에 각각 3개의 포탑이 있다. 제1 기지는, 좌측 하단 삼각형 영역 의 좌측 하단 코너에 위치한다. 예를 들어, 제2 캠프의 요새는 9개의 포탑과 제2 기지를 포함한다. 9개의 포탑 중, 상단 통로 , 중간 통로, 및 하단 통로에 각각 3개의 포탑이 있다. 제2 기지는 우측 상단 삼각형 영역 의 우측 상단 코너에 위치한다. 도 2에서 점선으로 표시된 위치는 강변 영역이라고 할 수 있다. 강변 영역은 제1 캠프와 제2 캠프의 공통 영역 이며, 좌측 하단 삼각형 영역과 우측 상단 삼각형 영역 사이의 경계 영역이기도 하다. MOBA 게임은, 가상 캐릭터의 전투 능력을 향상시키기 위해 가상 캐릭터에게 맵에서 자원들을 획득할 것을 요구한다. 자원들은, 크립들, 몬스터들, 크고 작은 용들을 포함한다. 1. 크립들은, 상단 통로, 중간 통로 및 하단 통로에서 주기적으로 나타난다. 크립이 처치되면, 근처의 가상 캐릭터가 경험치와 금화를 획득한다. 2. 맵은, 분할선으로서의 중간 통로(좌측 하단 코너로부터 우측 상단 코너까지의 대각선)와 강변 영역(좌측 상 단 코너로부터 우측 하단 코너까지의 대각선)에 의해 4개의 삼각형 영역 A, B, C, D로 나눌 수 있다. 4개의 삼 각형 영역 A, B, C, D에서 몬스터는 주기적으로 리프레시되며, 몬스터가 처치되면, 근처의 가상 캐릭터는 경험 치, 금화, BUFF 효과를 획득한다. 3. 큰 용과 작은 용은 강변 영역의 2개의 대칭 위치에서 주기적으로 리프레시된다. 큰 용과 작은 용이 처치되면, 처치자 캠프의 각각의 가상 캐릭터는, 경험치, 금화 및 BUFF 효과를 획득한다. 큰 용 은, \"지배자\", \"Caesar\" 또는 기타의 명칭으로 지칭될 수 있고, 작은 용은 \"폭군\", \"마법 용\" 또는 기타의 명칭으로 지칭될 수 있다.예를 들어, 강변의 상단 통로와 하단 통로 각각에는, 게임의 30초만에 나타나는 금화 몬스터가 있다. 금화 몬 스터가 처치되면, 근처의 가상 캐릭터가 금화를 획득하고, 금화 몬스터는 70초 후에 리프레시된다. 영역 A에는, 적색 BUFF, 2마리의 일반 몬스터(돼지와 새), 및 폭군(작은 용)이 있다. 게임 30초만에 적색 BUFF 와 몬스터들이 나타나고, 일반 몬스터들은 처치시 70초 후에 리프레시되며, 적색 BUFF는 처치시 90초 후에 리프 레시된다. 폭군은 게임 2분만에 나타나며, 처치시 3분 후에 리프레시된다. 처치자의 모든 팀원은 폭군이 처치된 후 금화 와 경험치를 획득한다. 폭군은 9분 55초에 어두워지고, 어둠의 폭군은 10분에 나타난다. 폭군의 복수 (revenge) BUFF는 어둠의 폭군을 처치하는 가상 캐릭터에 의해 획득된다. 영역 B에는 청색 BUFF와 2마리의 일반 몬스터(늑대와 새)가 있다. 청색 BUFF도 30 초에 나타나며 처치시 90초 후에 리프레시된다. 영역 C는 영역 B와 동일하며, 2마리의 일반 몬스터(늑대와 새)가 있다. 마찬가지로, 청색 BUFF도 30초에 나타 나고 90초 후에 리프레시된다. 영역 D는 영역 A와 유사하며, 적색 BUFF와 2마리의 일반 몬스터(돼지와 새)가 있다. 적색 BUFF는 출력 증가 및 감속에도 이용된다. 지배자(큰 용)도 있다. 지배자는 게임 8분에 나타나고 처치시 5분후에 리프레시된다. 통 로 상의 지배자 BUFF, 속박 BUFF, 및 지배적 파이오니어(수동으로 소환되는 하늘 용)는 지배자가 처치된 후에 획득될 수 있다. 한 예에서, BUFF는 다음과 같이 상세히 설명된다: 적색 BUFF는 70초 동안 지속되며, 공격과 함께 지속적인 화상과 감속을 전달한다. 청색 BUFF는 70초 동안 지속되며 쿨다운(CD) 시간을 단축하고 초당 추가 마나를 회복할 수 있다. 어둠의 폭군 BUFF와 속박 BUFF는 어둠의 폭군이 처치된 후에 획득된다. 어둠의 폭군 BUFF는 전체 팀의 물리 공격을 증가시키고(현재 공격의 80 + 5%), 90초 동안 전체 팀의 마법 공격 을 증가시킨다(현재 마법 공격의 120 + 5%). 속박 BUFF는 지배자의 출력을 50% 감소시키고 가상 캐릭터가 죽어도 속박 BUFF는 사라지지 않고 90초간 지속된 다. 지배자 BUFF와 속박 BUFF는 지배자를 처치함으로써 획득될 수 있다. 지배자는 전체 팀의 생명 회복과 마나 회복을 초당 1.5%만큼 향상시키고 90초간 지속될 수 있다. 지배자 BUFF 는 가상 캐릭터가 죽으면 사라진다. 속박 BUFF는 어둠의 폭군의 출력을 50%만큼 감소시키며, 속박 BUFF는 가상 캐릭터가 죽어도 사라지지 않고 90초 간 지속된다. 지배자가 처치된 후 다음과 같은 혜택이 획득될 수 있다. 1. 모든 팀원은 100개의 금화를 획득하고, 마스터 가상 캐릭터가 지배자와의 전투에 참여했는지 여부에 관계없 이, 부활 CD 중의 마스터 가상 캐릭터를 포함한, 마스터 가상 캐릭터가 효과를 획득한다. 2. 지배자가 처치되는 순간부터, 처치자 파티의 크립의 다음 3개의 웨이브(3개의 통로)가 지배적 파이오니어 (날으는 용)로 대체된다. 지배적 파이오니어들은 매우 강하고 3개 통로에서 동시에 공격하여, 상대 팀에 큰 크 립 라인 압박을 가한다. 상대 팀은 3개 통로에서 방어할 필요가 있다. 지배적 파이오니어들에 대한 경보가 맵 에 도시되고, 경보 동안에, 다가오는 지배적 파이오니어들의 웨이브 수(대개는 3개 웨이브)에 대한 힌트가 있을 것이다. 10명의 가상 캐릭터의 전투 능력은 2개의 부분: 레벨과 장비를 포함한다. 레벨은 누적된 경험치를 이용하여 획 득하고, 장비는 누적된 금화를 이용하여 구매된다. 10개의 가상 캐릭터는, 서버에서 온라인으로 10개의 사용자 계정을 매칭하여 획득될 수 있다. 예를 들어, 서버는, 경쟁을 위해 온라인으로 2, 6 또는 10명의 사용자 계정 들이 동일한 가상 세계에 있는 인터페이스를 매칭한다. 2, 6 또는 10명의 가상 캐릭터가 2개의 반대 캠프에 있 다. 두 캠프에는 동일한 수의 대응하는 가상 캐릭터가 있다. 예를 들어, 각각의 캠프에는 5명의 가상 캐릭터 가 있다. 5명의 가상 캐릭터의 유형은, 각각, 전사 캐릭터, 암살자 캐릭터, 마법사 캐릭터, 지원(또는 고기 방패) 캐릭터, 및 궁수 캐릭터일 수 있다. 전투는 라운드로 진행될 수 있다. 전투의 상이한 라운드들에서, 동일한 맵이나 상이한 맵들이 이용될 수 있다. 각각의 캠프에는, 한명 이상의 가상 캐릭터, 예를 들어, 1명의 가상 캐릭터, 3명의 가상 캐릭터, 또는 5명의 가 상 캐릭터가 포함된다. 도 3은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 이 방법은 도 1의 임의의 단말기에 의해 수행될 수 있고, 이 방법은 다음과 같 은 단계를 포함한다. 단계 301. 멀티플레이어 온라인 전투 프로그램의 UI를 디스플레이한다. 멀티플레이어 온라인 전투 프로그램은, 적어도 2명의 사용자가 가상 환경에서 전투하기 위해 가상 캐릭터들을 제어하는 것을 허용하는 프로그램이다. 가상 환경은 적어도 2명의 가상 캐릭터가 전투할 수 있도록 구성된 전 투 환경이다. 멀티플레이어 온라인 전투 프로그램은, 군사 시뮬레이션 프로그램, MOBA 게임, 전투 로얄 슈팅 게임, SLG 중 임의의 하나일 수 있다. 이 실시예에서, 클라이언트가 MOBA 게임인 예가 설명을 위해 이용된다. 한 예에서, 도 4에 도시된 바와 같이, 멀티플레이어 온라인 전투 프로그램의 UI는 가상 환경 이미지 및 상호작용 패널 영역을 포함한다. 가상 환경 이미지는, 마스터 가상 캐릭터에 대응하는 관점에서 관찰된 가상 환경의 이미지이다. 마스 터 가상 캐릭터는, 가상 환경에서 단말기를 이용하여 사용자에 의해 제어되는 가상 캐릭터이다. 마스터 가상 캐릭터에 대응하는 시점(perspective)은, 마스터 가상 캐릭터의 1 인칭 시점, 45° 조감도(bird’s-eye view), 3 인칭 시점, 어깨너머(over-shoulder) 시점 중 어느 하나일 수 있다. 이 실시예의 설명을 위해, 한 예는 45° 조감도를 이용한다. 마스터 가상 캐릭터가 움직이거나 회전할 때, 가상 환경 이미지는 그에 따라 변한다. 마스터 가상 캐릭터 는 가상 환경 이미지에서 나타나거나 가상 환경 이미지에서 나타나지 않을 수 있다. 상호작용 패널 영역은 가상 환경 이미지에 중첩된 UI 요소이다. 상호작용 패널 영역은 2개의 유형 으로 나뉜다: 정보를 디스플레이하는데 이용되는 정보 디스플레이 요소들과 인간-머신 상호작용에 이용되는 제 어 기능 요소들. 상호작용 패널 영역은 HUD 영역이라고도 한다. 예를 들어, 도 5에 도시된 바와 같이, HUD 영역은 다음을 포함한다: 미니 맵 영역, 친구 정보 영역, 점수판, 디바이스 정보 영역 및 마스터 가상 캐릭터 점수 영역 , 메뉴 영역, 미니 맵 영역 확장 버튼, 신호 컨트롤, 채팅 컨트롤, 마스터 가상 캐릭터의 스킬 버튼, 마스터 가상 캐릭터의 공격 스킬 버튼, 소환사 능력, 회복 스킬, 철수 스킬, 이동 컨트롤, 금화 영역, 권장 장비. 친구 정보 영역, 점수판, 디바이스 정보 영역 및 마스터 가상 캐릭터 점수 영역은 정보 디스플레이 요소들이고, 다른 요소들은 제어 기능 요소들이다. 상호작용 패널 영역은, 사망 패널, 포탑-공격 버튼, 및 크립 공격 버튼 등의 다른 요소들을 포함할 수 있으며, 이것은 실시예들에서 제한되지 않는다. 사용자가 전투 라운드를 시작한 후, 멀티플레이어 온라인 전투 프로그램의 UI가 디스플레이된다. 단계 302. UI에서 방향 조작을 수신하고, 방향 조작은 프롬프트 정보 전송 기능을 활성화하고 UI 내의 타깃 디 스플레이 요소를 가리키는 조작이다. 사용자가 프롬프트 정보를 전송할 필요가 있을 때, 사용자는 UI에 방향 조작을 적용한다. 방향 조작은 사용자 조작이거나, 2개 이상의 사용자 조작에 의해 형성된 조작 조합일 수도 있다. 방향 조작은 프롬프트 정보 전송 기능을 활성화하고 UI 내의 타깃 디스플레이 요소를 가리키기 위한 조작이다. 타깃 디스플레이 요소는 UI 내의 복수의 디스플레이 요소 중 하나이다. 한 예에서, 방향 조작은, 더블 탭, 트 리플 탭, 또는 타깃 디스플레이 요소를 오래 누르는 조작일 수 있다. 또 다른 예에서, 상호작용 패널 영역은 신호 컨트롤을 포함한다. 방향 조작은 신호 컨트롤로부터 UI 내의 타깃 디스플레이 요소를 가리키는 조작이다. 신호 컨트롤은 프롬프트 정보 전송 기능을 활성화하기 위한 컨트롤이다. UI 내의 복수의 디스플레이 요소는, 다음과 같은 요소들 중 적어도 하나를 포함하지만, 이것으로 제한되는 것은 아니다.1. 가상 환경에서 전투 기능 요소들(비장식 요소들 및 비시각적 프리젠테이션 요소들)을 형성하는 3차원 모델 들. 예를 들어, 전투 기능 요소들은 가상 환경에서 전투 과정에 영향을 미치는 요소들이다. 3차원 모델들은, 가상 캐릭터, 포탑, 기지, 몬스터, 수풀, 탐지 눈, 큰 용, 작은 용 등을 포함하지만, 이것으로 제한되는 것은 아니다. 2. 상호작용 패널 영역의 정보 디스플레이 요소들. 예를 들어, 정보 디스플레이 요소들은, 친구 정보 영역, 점수판, 디바이스 정보 영역, 및 마스터 가상 캐릭터 점수 영역, 및 도 5에 도시되지 않은 사망 패널을 포함한다. 3. 상호작용 패널 영역의 제어 기능 요소들. 예를 들어, 제어 기능 요소들은, 미니 맵 영역, 미니 맵 확장 버튼, 버튼 컨트롤, 채팅 컨트롤 , 마스터 가상 캐릭터의 스킬 버튼, 마스터 가상 캐릭터의 공격 스킬 버튼, 소환사 능력 영역, 이동 컨트롤, 금화 영역, 및 권장 장비를 포함한다. 예를 들어, 제어 기능 요소들은 고속 신호 버튼을 더 포함한다. 고속 신호 버튼은, 공격 버튼, 퇴각 버튼, 및 집결 버튼(도 5에 도시되지 않음)을 포함하지만, 이것으로 제한되는 것은 아니다. 단계 303. 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측한다. 타깃 디스플레이 요소는 방향 조작에 의해 선택된 디스플레이 요소이다. 전투 정보는 전투 라운드 동안의 전투 상황 정보이다. 전투 정보는, 다음과 같은 것들을 포함하지만, 이것으로 제한되는 것은 아니다: 이 전투 라운 드의 시작후 지속시간, 가상 캐릭터의 레벨, 스킬 업그레이드 정보, 스킬 쿨다운 정보, 소환사 능력 유형, 가상 캐릭터의 체력(HP), 포탑의 HP, 가상 캐릭터와 수풀 사이의 위치 관계, 크립 라인 상황, 몬스터 리프레시 상황, 네트워크 정보, 팀원 위치, 적 위치, 처치 정보, 사망 정보, 날짜 정보, 축제 정보, 위치 정보, 매치 정보, 캠 프의 캠프 명칭. 예를 들어, 프롬프트 정보는, 팀원들, 적들, 또는 모든 가상 캐릭터에 대한 정보 프롬프트를 수행하기 위한 정 보이다. 프롬프트 정보의 형태는, 텍스트, 음성, 아이콘, 애니메이션, 및 진동 피드백 중 적어도 하나를 포함 하지만, 이것으로 제한되는 것은 아니다. 한 예에서, 프롬프트 정보는, 2개 유형의 정보: 사실 정보와 의도 정 보를 포함한다. 사실 정보는 현재 전투에서 존재하는 사실을 나타내는 정보이며, 예를 들어, 몬스터가 리프레 시되고, 포탑이 공격을 받고 있고, 적이 보인다 등이다. 의도 정보는 사용자의 전략 의도를 나타내는 정보로서, 예를 들어, 상단 통로에서 크립 라인을 밀어내고, 수풀에서 매복을 조심하고, 경제가 너무 열악하고, 우리가 성장할 필요가 있다 등에 주의를 기울여야 한다는 정보이다. 단계 304. 마스터 가상 캐릭터의 팀원 가상 캐릭터들 또는 전투의 모든 가상 캐릭터의 클라이언트들에게 타깃 프롬프트 정보를 전송한다. 한 예에서, 타깃 프롬프트 정보는 마스터 가상 캐릭터의 팀원 가상 캐릭터(일부 실시예에서는 마스터 가상 캐릭 터 자체가 포함됨)의 클라이언트들에 전송된다. 또 다른 예에서, 타깃 프롬프트 정보는 전투에서 모든 가상 캐 릭터의 클라이언트들에게 전송된다. 또 다른 예에서, 타깃 프롬프트 정보는 또한, 이 전투를 보는 코치 클라이 언트, 심판 클라이언트 또는 청중 클라이언트에게 전송될 수 있다. 이 예에서, 클라이언트는 프레임 동기화 신호를 서버에 전송하고, 프레임 동기화 신호는 타깃 프롬프트 정보를 운반한다. 서버는, 마스터 가상 캐릭터의 팀원 가상 캐릭터(마스터 가상 캐릭터 자체가 일부 실시예에 포함 됨)에 대응하는 다른 클라이언트들에게 프레임 동기화 신호를 전송한다. 대안으로서, 서버는 전투에서 모든 가 상 캐릭터의 다른 클라이언트들에게 프레임 동기화 신호를 전송한다. 다른 클라이언트는 프레임 동기화 신호에 따라 타깃 프롬프트 정보를 디스플레이하거나 재생한다. 결론적으로, 본 실시예에서 제공하기 위한 방법에 따르면, 방향 조작이 수신되면, 전송될 것으로 예상되는 타깃 프롬프트 정보가 타깃 디스플레이 요소 및 전투 정보에 따라 예측되고, 타깃 프롬프트 정보는 마스터 가상 캐릭 터의 팀원 가상 캐릭터들 또는 전투 내의 모든 가상 캐릭터의 클라이언트들에게 전송된다. 따라서, 사용자는 최소한의 인간-머신 상호작용 비용으로 사용자의 기대를 충족하는 프롬프트 정보를 전송할 수 있다. 멀티플레 이어 온라인 전투 프로그램은, 사용자에 의해 표현된 생각과 전투 정보에 기초하여 현재의 전투 시나리오에서 사용자가 전송하기를 원하는 신호를 지능적으로 결정하고 선택하여 사용자와 다른 사용자들 사이의 정보 전달에서 인간-머신 상호작용 효율성을 향상시킨다. 방향 조작의 트리거링은 다음과 같은 방식들 중 적어도 하나로 구현될 수 있다. 1. 오래 누르기에 의해 트리거된다. 방향 조작은, \"신호 컨트롤을 오래 누르고 + 타깃 디스플레이 요소를 탭하는\" 방식으로 트리거된다. 2. 드래그에 의해 트리거된다. 방향 조작은 \"슬라이드 조작\" 방식으로 트리거된다. 3. 미니맵 상의 포인트 터치에 의해 트리거된다. 방향 조작은 미니맵에서 탭 조작을 이용하여 트리거된다. 4. 콤보(combo)에 의해 트리거된다. 방향 조작은 타깃 디스플레이 요소를 \"더블 탭하기\" 또는 \"트리플 탭하기\"에 의해 트리거된다. 제1 방식의 경우: 오래 누름 트리거 방식으로서, 이하의 실시예를 참조한다. 도 6은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 이 방법은 도 1의 임의의 단말기에 의해 수행될 수 있다. 상호작용 패널 영역 이 신호 컨트롤(줄여서 신호 버튼)로서 버튼 컨트롤을 포함하는 예가 설명을 위해 이용되고, 전술된 단계 302는 다음과 같은 단계들로 구현될 수 있다. 단계 302-1. UI의 버튼 컨트롤에 가해진 제1 터치 조작을 수신한다. 제1 터치 조작은 탭 조작 또는 오래 누름 조작이고, 제1 터치 조작이 오래 누름 조작인 예가 본 실시예에서 설 명을 위해 이용된다. 사용자가 프롬프트 정보를 전송하고자 할 때, 사용자는 신호 버튼을 오래 누른다. 단계 302-2. UI에 하나 이상의 후보 디스플레이 요소를 디스플레이한다. 후보 디스플레이 요소들은, UI에 디스플레이되는 복수의 디스플레이 요소 중 제1 터치 조작에 기초하여 후속 방 향 조작의 추가 트리거링을 지원하는 디스플레이 요소들, 즉, UI에서 프롬프트 정보 전송을 지속적으로 트리거 할 수 있는 디스플레이 요소들이다. 한 예에서, UI에 디스플레이된 하나 이상의 후보 디스플레이 요소의 디스플레이 방식들은 변경되지 않고 유지된 다. 또 다른 예에서, 하나 이상의 후보 디스플레이 요소는 하이라이트 방식으로 UI에 디스플레이되고, 하이라 이트 방식은 다음과 같은 디스플레이 방식들 중 적어도 하나를 포함한다: 타깃 컬러 디스플레이 방식, 오버레이 마스킹 디스플레이 방식, 하이라이트 디스플레이 방식, 및 윤곽선 디스플레이 방식. 예를 들어, HUD 영역에서 프롬프트 정보 전송을 트리거할 수 있는 디스플레이 요소들이 하이라이트되고, UI에서 의 디스플레이를 위해 윤곽이 그려진다. 단계 302-3. UI의 후보 디스플레이 요소들 중의 타깃 디스플레이 요소에 가해진 제2 터치 조작을 수신한다. 제2 터치 조작은, 탭 조작, 더블 탭 조작, 콤보 조작, 또는 오래 누름 조작이고, 본 실시예에서의 설명을 위해 제2 터치 조작이 탭 조작인 예가 이용된다. 예를 들어, 도 7을 참조하면, 프롬프트 정보가 전송될 필요가 있을 때, 사용자는 먼저, 신호 버튼을 오래 누른 다음, HUD 영역에서 프롬프트 정보 전송을 트리거할 수 있는 각각의 디스플레이 요소가 굵게 디스플레이된 다. 사용자는 사망 패널을 타깃 디스플레이 요소로 선택할 수 있다, 즉, 사용자는 사망 패널을 탭할 수 있다. 사망 패널을 타깃 디스플레이 요소로서 결정한 후, 멀티플레이어 온라인 전투 프로그램은 \"사용 자 자신에 의한 마스터 가상 캐릭터 제어가 부활까지 2초 남았습니다\"라는 전투 정보를 획득하여 타깃 프롬프트 정보 \"마스터 가상 캐릭터: 나는 부활까지 2초 남았습니다\"를 생성하고, 이 타깃 프롬프트 정보를 채팅 메시지 의 형태로 팀원에게 전송한다. 결론적으로, 본 실시예에서 제공되는 방법에 따르면, 방향 조작은 2개의 터치 조작을 이용하여 트리거된다. 포 인트 터치 조작 및 스킬 버튼 등의 원래의 상호작용 설계 방식은 동일하므로, 사용자의 학습 비용은 감소될 수있다. 인지 임계값이 낮고 조작이 간단하며, 초급 및 보통급의 사용자가 배우고 이용하기 쉽다. 제2 방식의 경우: 드래그 트리거 방식으로서, 이하의 실시예를 참조한다. 도 8은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 이 방법은 도 1의 임의의 단말기에 의해 수행될 수 있다. HUD 영역이 신호 컨 트롤(줄여서 신호 버튼)로서 버튼 컨트롤을 포함하는 예가 설명을 위해 이용되고, 전술된 단계 302는 다음과 같 은 단계들로 구현될 수 있다. 단계 302-A. UI 상에서의 슬라이드 조작을 수신하며, 슬라이드 조작의 슬라이드 시작점은 버튼 컨트롤이고, 슬 라이드 조작의 슬라이드 끝점은 타깃 디스플레이 요소이다. 사용자가 프롬프트 정보를 전송하고자 할 때, 사용자는 신호 버튼으로부터 슬라이딩(또는 드래그)하고 타깃 디 스플레이 요소로의 슬라이딩 후 터치를 놓는다. 단계 302-B. 버튼 컨트롤 상에서 슬라이드 조작이 수신되면 슬라이드 시작점으로부터 슬라이드 끝점까지 가리 키는 보조선(또는 이동 경로)을 UI에 디스플레이한다. 사용자의 슬라이드 조작에 관한 피드백을 디스플레이하기 위해, 임의적인 단계로서, 멀티플레이어 온라인 전투 프로그램은, 버튼 컨트롤 상에서 슬라이드 조작이 수신될 때 슬라이드 시작점으로부터 슬라이드 끝점까지 가리 키는 보조선(또는 이동 경로)을 UI에 디스플레이한다. 예를 들어, 보조선은 버튼 컨트롤로부터 슬라이드 끝점을 가리키는 광선이다. 이동 경로는 터치된 객체의 슬라 이딩 트랙을 따라 형성되는 광선 또는 곡선이다. 예를 들어, 슬라이드 조작이 수신된 후, 버튼 컨트롤 주변의 미리설정된 범위는 추가적인 디스플레이를 보여준 다: 공격 버튼, 퇴각 버튼, 및 집결 버튼. 슬라이드 조작의 슬라이드 끝점이 공격 버튼이면, \"공격 시작\" 프롬 프트 정보가 신속하게 전송된다. 슬라이드 조작의 슬라이드 끝점이 퇴각 버튼이면, \"퇴각 시작\" 프롬프트 정보 가 신속하게 전송된다. 슬라이드 조작의 슬라이드 끝점이 집결 버튼이면, \"집결 요청\" 프롬프트 정보가 신속하 게 전송된다. 예를 들어, 도 9를 참조하면, 프롬프트 정보가 전송될 필요가 있을 때, 사용자는 먼저, 신호 버튼을 오래 누른 다음, HUD 영역에서 프롬프트 정보 전송을 트리거할 수 있는 각각의 디스플레이 요소가 굵게 디스플레이된 다. 사용자는 마스터 가상 캐릭터의 스킬 버튼을 타깃 디스플레이 요소로서 선택할 수 있다, 즉, 사용자는 신호 버튼으로부터 마스터 가상 캐릭터의 스킬 버튼으로의 슬라이드 조작을 트리거할 수 있다. 신호 버튼에 의해 슬라이드 조작이 수신된 후, 신호 버튼으로부터 마스터 가상 캐릭터의 스킬 버튼까지 의 보조선이 UI에 디스플레이될 수 있다. 마스터 가상 캐릭터의 스킬 버튼을 타깃 디스플레이 요소로서 결 정한 후, 멀티플레이어 온라인 전투 프로그램은, 전투 정보 \"사용자에 의해 직접 제어되는 마스터 가상 캐릭터 의 스킬 2가 리프레시까지 2초 남았습니다\"를 획득하여, 타깃 프롬프트 정보 \"마스터 가상 캐릭터: 내 스킬 2는 2초 후 리프레시될 수 있습니다\"를 생성하여, 타깃 프롬프트 정보를 채팅 메시지 형태로 팀원에게 전송한다. 결론적으로, 본 실시예에서 제공되는 방법에 따르면, 방향 조작은 슬라이드 조작을 이용하여 트리거된다. 치열 한 전투에서, 드래그형 슬라이드 조작은 숙련도가 높고 손 속도가 빠른 경우 조작에 요구되는 시간을 단축할 수 있으므로, 고급 사용자들의 통신 효율이 향상된다. 또한, 사용자가 터치를 놓으면, 버튼 컨트롤, 보조선, 및 드래그형 슬라이드 조작과 관련하여 추가로 디스플레이된 3개의 신속 신호 버튼이 모두 복원될 수 있고, 시야를 차단하지 않을 수 있으며, 포인트 터치 조작보다 빨리 치열한 전투 작전에 돌아갈 수 있다. 제3 방식의 경우: 미니맵에 기초한 포인트 터치 트리거링 방식으로서, 이하의 실시예를 참조한다. 도 10은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 이 방법은 도 1의 임의의 단말기에 의해 수행될 수 있다. HUD 영역이, (미니맵 버튼이라고도 하는) 맵 확장 컨트롤을 신호 컨트롤로서 포함하는 예가 설명을 위해 이용되며, 전술된 단계 302 는 다음과 같은 단계들로 구현될 수 있다. 단계 302-a. UI 상의 맵 확장 컨트롤에 가해진 제3 터치 조작을 수신한다. 제3 터치 조작은, 탭 조작, 더블 탭 조작, 콤보 조작, 또는 오래 누름 조작일 수 있고, 본 실시예에서의 설명을 위해 제3 터치 조작이 탭 조작인 예가 이용된다.사용자가 프롬프트 정보를 전송하고자 할 때, 사용자는 맵 확장 컨트롤을 탭한다. 단계 302-b. 제3 터치 조작에 따라 가상 환경의 맵 보기 컨트롤을 UI 상에 디스플레이한다. 맵 보기 컨트롤은 타깃 영역 크기를 갖는 컨트롤을 이용하여 신의 관점에서 가상 환경의 맵을 보기 위한 컨트롤 이다. 타깃 영역 크기는 미니맵의 영역 크기보다 크다. 맵 보기 컨트롤은 중간 맵 컨트롤이라고도 한다. 일부 실시예에서, 트리거될 수 있는 디스플레이 요소들은 맵 보기 컨트롤 상에 하이라이트 방식으로 디스플레이 된다. 예를 들어, 맵 보기 컨트롤은, 다음과 같은 디스플레이 요소들 중 적어도 하나를 디스플레이한다: 상단 통로, 중간 통로, 하단 통로, 포탑, 몬스터 포인트, 큰 용 포인트, 및 작은 용 포인트. 큰 용 포인트와 작은 용 포인트는, 팀 이득을 제공할 수 있는 몬스터 포인트로서 간주될 수 있다. 단계 302c. 맵 보기 컨트롤 상의 타깃 디스플레이 요소에 가해진 제4 터치 조작을 수신한다. 제4 터치 조작은, 탭 조작, 더블 탭 조작, 콤보 조작, 또는 오래 누름 조작일 수 있고, 본 실시예에서의 설명을 위해 제4 터치 조작이 탭 조작인 예가 이용된다. 예를 들어, 도 11을 참조하면, 프롬프트 정보가 전송될 필요가 있을 때, 사용자가 먼저 미니맵 버튼을 탭하 고, 멀티플레이어 온라인 전투 프로그램은 UI 상에서 오버레이 방식으로 맵 보기 컨트롤(중간 맵 컨트롤)을 디스플레이하며, 맵 보기 컨트롤은, 상단 통로, 중간 통로, 하단 통로, 포탑, 몬스터 포인트, 큰 용 포인트, 및 작은 용 포인트를 디스플레이한다. 사용자는, 맵 보기 컨트롤 상의 타깃 디스플레이 요소로서 큰 용 포인트를 선택하기 위해 탭할 수 있다. 큰 용 포인트를 타깃 디스플레이 요소로서 결정한 후, 멀티플레 이어 온라인 전투 프로그램은, 전투 정보 \"큰 용이 2초간 리프레시되었습니다\"를 획득하여 타깃 프롬프트 정보 \"마스터 가상 캐릭터: 큰 용을 몰래 죽이는 적을 조심하라\"를 생성하고, 이 타깃 프롬프트 정보를 채팅 메시지 형태로 팀원들에게 전송한다. 결론적으로, 본 실시예에서 제공되는 방법에 따르면, 맵 보기 컨트롤에 기초하여 방향 조작이 트리거된다. 가 상 환경 이미지의 시야 범위 밖에 있는 디스플레이 요소들이 선택될 수 있으므로, 타깃 디스플레이 요소는 시야 범위 내에서 선택될 수 있을뿐만 아니라, 맵 상의 모든 디스플레이 요소, 특히 (상단 통로, 중간 통로, 하단 통 로 등의) 비교적 큰 또는 매크로 디스플레이 요소들이 신속하게 선택될 수 있음으로써, 전술된 프롬프트 정보를 전송하기 위한 방법의 적용성과 기능성을 향상시킬 수 있다. 제1 방식 내지 제3 방식 중 어느 하나의 경우, 도 5를 참조하면, 사용자가 가상 캐릭터를 제어할 때, 사용자는 대개 좌측 엄지를 이용하여 가상 캐릭터를 이동하도록 제어하고, 우측 엄지를 이용하여 스킬을 해제하도록 가상 캐릭터를 제어한다. 대부분의 사용자는 좌측 엄지로 이동 컨트롤(좌측 휠이라고도 함)을 계속 누르고, 우측 엄 지로 간헐적인 터치 조작을 이용하여 버튼 컨트롤을 누른다. 따라서, 사용자의 좌측 엄지의 연속적인 조작을 방해하지 않기 위해, 이동 컨트롤과 신호 버튼은 UI 상에서 서로 멀리 떨어진 2개의 주변 영역에 위치 한다. 예를 들어, 이동 컨트롤은 UI의 좌측 주변 영역에 위치하고, 신호 버튼은 UI의 우측 주변 영역 에 위치한다. 유사하게, 이동 컨트롤 및 맵 확장 컨트롤도 역시, UI 상에서 서로 멀리 떨어진 2개의 주변 영역에 위 치한다. 예를 들어, 이동 컨트롤은 UI의 좌측 주변 영역에 위치하고, 맵 확장 컨트롤은 UI의 우측 주 변 영역에 위치한다. 제4 방식의 경우: 콤보 트리거링 방식으로서, 이하의 실시예를 참조한다. 도 12는 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 이 방법은 도 1의 임의의 단말기에 의해 수행될 수 있다. HUD 영역이, (미니맵 버튼이라고도 하는) 맵 확장 컨트롤을 신호 컨트롤로서 포함하는 예가 설명을 위해 이용되며, 전술된 단계 302 는 다음과 같은 단계들로 구현될 수 있다. 단계 302-C. UI 상의 타깃 디스플레이 요소에 가해진 연속 터치 조작을 수신하고, 연속 터치 조작은 적어도 2 개의 연속 탭 조작을 포함한다. 연속 터치 조작은, 더블 탭 조작, 트리플 탭 조작, 또는 더 많은 탭 조작일 수 있으며, 본 실시예에서의 설명을 위해 연속 터치 조작이 더블 탭 조작인 예가 이용된다. 사용자가 프롬프트 정보를 전송하고자 할 때, 사용자는 UI 상에서 타깃 디스플레이 요소를 더블 탭한다. 예를 들어, 도 13을 참조하면, 프롬프트 정보가 전송될 필요가 있을 때, 사용자는 점수판을 더블 탭한다. 점수판을 타깃 디스플레이 요소로서 결정한 후, 멀티플레이어 온라인 전투 프로그램은, 전투 정보 \"처치 점 수 비율은 3: 4\"라는 전투 정보를 획득하여, 타깃 프롬프트 정보 \"마스터 가상 캐릭터: 처치 점수 격차는 크지 않고, 성장할 수 있도록 인내심을 갖고, 자만하지 마라\"를 생성하고, 이 타깃 프롬프트 정보를 채팅 메시지 형 태로 팀원들에게 전송한다. 본 출원의 이 실시예는 방향 조작의 트리거링 방식을 제한하지 않으며, 전술된 트리거링 방식들도 자유롭게 새 로운 실시예로 결합될 수 있다. 예를 들어, 드래그 트리거링 방식은 미니맵 트리거링 방식과 결합되며, 도 14 에 도시된 바와 같이, 사용자가 프롬프트 정보를 전송할 필요가 있을 때, 사용자는 먼저, 신호 버튼으로부 터 맵 확장 컨트롤로 슬라이딩하며, 여기서, 맵 보기 컨트롤은, 맵 확장 컨트롤이 트리거된 후에 디스 플레이되고, 그 다음, 맵 보기 컨트롤에서 큰 용 위치로 슬라이딩(중단없이 연속적으로 슬라이딩)한다. 멀티플 레이어 온라인 경쟁 프로그램은 큰 용이 타깃 디스플레이 요소라고 결정하고, 현재 전투 상황 정보를 참조하여, 타깃 프롬프트 정보 \"큰 용을 몰래 죽이는 적 조심\"을 전송한다. 전술된 실시예들에 기초한 임의적 실시예에서, \"타깃 프롬프트 정보\"의 예측 프로세스는 거동 트리를 이용하여 구현된다. 거동 트리는, 디스플레이 요소들, 전투 정보, 및 프롬프트 정보 사이의 대응관계를 포함한다. 예를 들어, 거동 트리는, 트리 구조를 이용하여, 디스플레이 요소들, 전투 정보, 및 프롬프트 정보 사이의 대응관계 를 저장한다. 멀티플레이어 온라인 전투 프로그램은, 타깃 디스플레이 요소 및 전투 정보에 따라, 전송될 것으 로 예상되는 타깃 프롬프트 정보에 대한 거동 트리를 질의한다. 상이한 타깃 디스플레이 요소들은 이하에서 각 각 설명된다. 예를 들어, 하나 이상의 거동 트리가 있다. 타깃 디스플레이 요소 및 전투 정보에 따라, 전송될 것으로 예상되 는 타깃 프롬프트 정보에 대한 거동 트리의 질의는, 다음을 포함한 그러나 이것으로 제한되지 않는 형태로 구현 될 수 있다. 1. 타깃 디스플레이 요소, 스킬 클래스 디스플레이 요소들을 포함하고, 전투 정보는 스킬 가용성 상태를 포함 한다. 스킬 클래스 디스플레이 요소들은 스킬들을 수행하기 위한 컨트롤들이다. 일부 실시예에서, 상호작용 패널 영 역에 배치된 하나 이상의 스킬 클래스 디스플레이 요소, 예를 들어, 영웅 스킬들, 소환사 능력, 및 일시적으로 획득되고 유효한 지속시간을 갖는 스킬이 있을 수 있다. 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하는 스킬 가용성 상태 가 이용불가능할 때, 스킬이 이용불가능함(디스에이블 또는 쿨다운)을 나타내는데 이용되는 제1 타깃 프롬프트 정보가 결정된다. 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하는 스킬 가용성 상태 가 이용가능할 때, 스킬이 이용가능함을 나타내는데 이용되는 제2 타깃 프롬프트 정보가 결정된다. 2. 타깃 디스플레이 요소는 스킬 클래스 디스플레이 요소들을 포함하고, 전투 정보는 스킬 CD 시간을 포함한다. 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하는 스킬 CD 시간이 유 효한 경우, 스킬 CD 시간을 나타내는데 이용되는 제3 타깃 프롬프트 정보가 결정된다. 3. 타깃 디스플레이 요소는 자원 클래스 디스플레이 요소들을 포함하고, 전투 정보는 자원 클래스 디스플레이 요소의 시야 정보를 포함한다. 자원 클래스 디스플레이 요소들은, 금화 자원, 혈액량 자원, 마법 자원, 및 BUFF 자원을 제공하도록 구성된 디 스플레이 요소들이다. 일부 실시예에서, 가상 세계에 배치된 하나 이상의 자원 클래스 디스플레이 요소, 예를 들어, 몬스터 포인트들, 큰 용 포인트, 작은 용 포인트, 및 뼈대 용 상점이 있을 수 있다. 타깃 디스플레이 요소가 자원 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하는 시야 정보가 적의 시야를 갖는 경우, 적이 자원을 획득하고 있다는 것을 나타내는데 이용되는 제4 타깃 프롬프트 정보가 결정된다. 4. 타깃 디스플레이 요소는 자원 클래스 디스플레이 요소들을 포함하고, 전투 정보는 자원 클래스 디스플레이 요소의 리프레시 정보를 포함한다.자원 클래스 디스플레이 요소들은 1회성일 수도 있고 복수회 리프레시될 수도 있다. 예를 들어, 몬스터 포인트 내의 몬스터 그룹이 처치된 후, 일정 지속시간 동안 대기한 후 새로운 몬스터 그룹이 자동으로 리프레시된다. 타깃 디스플레이 요소가 자원 클래스 디스플레이 요소이고 리프레시 정보가 유효한 경우, 자원 클래스 디스플레 이 요소의 남은 리프레시 시간을 나타내는데 이용되는 제5 타깃 프롬프트 정보가 결정된다. 5. 타깃 디스플레이 요소는 가상 캐릭터 클래스 디스플레이 요소들을 포함하고, 전투 정보는 가상 캐릭터 클래 스 디스플레이 요소의 상태를 포함한다. 가상 캐릭터 클래스 디스플레이 요소들은, 사용자 자신측(사용자 자신의 캠프)의 가상 캐릭터들 및 적측(상대 캠프 또는 적 캠프)의 가상 캐릭터들을 포함한, 사용자들에 의해 제어되는 가상 캐릭터들이다. 일부 실시예에 서, 가상 세계에 배치된 하나 또는 가상 캐릭터 클래스 디스플레이 요소가 있을 수 있다. 타깃 디스플레이 요소가 가상 캐릭터 클래스 디스플레이 요소이고 타깃 디스플레이 요소의 상태가 제1 지정된 상태일 때, 가상 캐릭터 클래스 디스플레이 요소가 제1 지정된 상태에 있다는 것을 나타내는데 이용되는 제6 타 깃 프롬프트 정보가 결정된다. 이 상태는, 혈액량 상태, 마법 상태, 철수 상태, 이동 상태, 공격 상태, 공격받은 상태, 장비 상태, 레벨 상태, 및 외부 착용 상태 중 적어도 하나를 포함한다. 6. 타깃 디스플레이 요소는 건설 클래스 디스플레이 요소들을 포함하고, 전투 정보는 건설 클래스 디스플레이 요소의 상태를 포함한다. 건설 클래스 디스플레이 요소들은 맵에 고정된 건설 3차원 모델이다. 일부 실시예에서, 가상 세계에 배치된 하 나 이상의 건설 클래스 디스플레이 요소, 예를 들어, 포탑, 기지 방어, 또는 영웅의 스킬들에 의해 소환되는 건 조물이 있을 수 있다. 타깃 디스플레이 요소가 건설 클래스 디스플레이 요소이고 타깃 디스플레이 요소의 상태가 제2 지정된 상태인 경우, 건설 클래스 디스플레이 요소가 제2 지정된 상태에 있다는 것을 나타내는데 이용되는 제7 타깃 프롬프트 정보가 결정된다. 7. 타깃 디스플레이 요소는 네트워크 정보 디스플레이 요소를 포함하고, 전투 정보는 네트워크 속도 정보를 포 함한다. 네트워크 정보 디스플레이 요소는, 단말기의 현재 네트워크 속도 정보를 나타내는데 이용되는 디스플레이 요소 이고, 대개 상호작용 패널 영역에 배치된다. 타깃 디스플레이 요소가 네트워크 정보 디스플레이 요소이고 네트워크 속도 정보의 네트워크 속도가 제1 임계값 미만인 경우, 네트워크 속도 상태를 나타내는데 이용되는 제8 타깃 프롬프트 정보가 결정된다. 8. 타깃 디스플레이 요소는 하드웨어 성능 디스플레이 요소를 포함하고, 전투 정보는 하드웨어 작동 성능 파라 미터를 포함한다. 하드웨어 성능 디스플레이 요소는, 단말기의 현재 하드웨어 성능(CPU 또는 프레임 레이트)을 나타내는데 이용되 는 디스플레이 요소이고, 대개 상호작용 패널 영역에 배치된다. 타깃 디스플레이 요소가 하드웨어 성능 디스플레이 요소이고 하드웨어 작동 성능 파라미터가 제2 임계값 미만인 경우, 네트워크 속도 상태를 나타내는데 이용되는 제9 타깃 프롬프트 정보가 결정된다. 9. 타깃 디스플레이 요소는 프롬프트 정보 디스플레이 요소를 포함하고, 전투 정보는 메시지 내용을 프롬프트 정보 디스플레이 요소에 포함한다. 프롬프트 정보 디스플레이 요소는, 타인(또는 사용자 자신일 수 있음)이 전송한 프롬프트 정보를 디스플레이하 는데 이용되는 디스플레이 요소, 예를 들어, 대화 박스이다. 타깃 디스플레이 요소가 프롬프트 정보 디스플레이 요소인 경우, 메시지 내용에 자동으로 응답하는데 이용되는 제10 타깃 프롬프트 정보가 제공된다. 타깃 디스플레이 요소: 마스터 가상 캐릭터의 스킬 A. 마스터 가상 캐릭터는 복수의 스킬을 가지고 있다, 예를 들어 3개의 스킬 또는 4개의 스킬을 가지고 있으며, 스 킬 A는 복수의 스킬 중 하나이다. 타깃 디스플레이 요소가 마스터 가상 캐릭터의 스킬 A인 경우, 도 15를 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 401. 스킬 A가 업그레이드되었는지를 결정한다(적어도 하나의 레벨에 대해). 업그레이드란, 마스터 가상 캐릭터의 경험치가 임계값에 도달한 후 스킬 A(또는 더 높은 레벨의 스킬 A)가 획득 되는 것을 의미한다. 단계 402는 스킬 A가 업그레이드되었을 때 수행된다. 단계 403은 스킬 A가 업그레이드되지 않았을 때 수행된다. 단계 402. 스킬 A가 디스에이블되었는지를 결정한다. 단계 404는 스킬 A가 디스에이블된 경우 수행된다. 단계 405는 스킬 A가 디스에이블되지 않은 경우 수행된다. 단계 403. 타깃 프롬프트 정보를 \"스킬 A가 업그레이드되지 않음\"으로 결정한다. 단계 404. 타깃 프롬프트 정보를 \"스킬 A가 디스에이블됨\"으로 결정한다. 단계 405. 스킬 A가 쿨다운되었는지를 결정한다. 단계 406은 스킬 A가 쿨다운 상태일 때 수행된다. 단계 407은 스킬 A가 가용 상태에 있을 때 수행된다. 단계 406. 타깃 프롬프트 정보를 \"스킬 A는 X초의 CD를 가짐\"으로 결정한다. 예를 들어, X는 변수이고, 스킬 A의 쿨다운 타이머의 카운트 수에 따라 멀티플레이어 온라인 전투 프로그램에 의해 결정된다. 단계 407. 타깃 프롬프트 정보를 \"스킬 A가 준비되었다\"로 결정한다. 예를 들어, 도 16에 도시된 바와 같이, 사용자는 UI 상에서 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이 드 시작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 스킬 A의 스킬 버튼이다. 멀티플레이어 온라인 전투 프로그램은 현재 전투 정보를 참조하여 타깃 프롬프트 정보 \"스킬 A는 X초의 CD를 가짐\"으로 결정한다. 타깃 디스플레이 요소: 소환사 능력 B. 마스터 가상 캐릭터는 게임이 시작되기 전에 소환사 능력 B, 예를 들어, 섬광 능력을 소지하기로 선택할 수 있 다. 소환사 능력 B는 복수의 소환사 능력 중 하나이다. 예를 들어, 소환사 능력은: 치유, 질주, 강타, 폐쇄, 분노, 도발, 현혹, 정화, 불구 및 섬광을 포함한다. 타깃 디스플레이 요소가 소환사 능력 B인 경우, 도 17을 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 501. 소환사 능력 B가 쿨다운인지를 결정한다. 단계 502는 스킬 A가 쿨다운 상태일 때 수행된다. 단계 503은 스킬 A가 가용 상태에 있을 때 수행된다. 단계 502. 타깃 프롬프트 정보를 \"소환사 능력 B는 X초의 CD를 가짐\"으로 결정한다. 단계 503. 타깃 프롬프트 정보를 \"소환사 능력 B가 준비됨\"으로 결정한다. 예를 들어, 도 18에 도시된 바와 같이, 소환사 능력 B가 \"섬광\"인 예가 이용된다. 사용자는 UI에 슬라이드 조 작을 적용하고, 슬라이드 조작의 슬라이드 시작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 소환사 능력 \"섬광\"의 능력 버튼이다. 멀티플레이어 온라인 전투 프로그램은, 현재 전투 정보를 참조하여 타깃 프 롬프트 정보를 \"섬광이 준비되었다\"로 결정한다. 섬광은 짧은 거리를 순간이동하는 조작 방식이다. 타깃 디스플레이 요소: 회복 주문. 회복 주문은, 마스터 가상 캐릭터의 HP, 마법 포인트, 또는 HP + 마법 포인트를 회복하도록 구성된 주문이다. 타깃 디스플레이 요소가 회복 주문인 경우, 도 19를 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 601. 회복 주문이 쿨다운되었는지를 결정한다. 단계 602는 스킬 A가 쿨다운 상태일 때 수행된다. 단계 605는 스킬 A가 가용 상태에 있을 때 수행된다. 단계 602. 개인 혈액량이 X%보다 낮은지를 결정한다. 단계 603은 혈액량이 X%보다 낮을 때 수행된다. 단계 604는 혈액량이 X%보다 낮지 않을 때 수행된다. 단계 603. 타깃 프롬프트 정보를 \"치료가 필요하다\"로 결정한다. 단계 604. 타깃 프롬프트 정보를 \"회복 주문은 X초의 CD를 가짐\"으로 결정한다. 단계 605. 타깃 프롬프트 정보를 \"제 시간에 상태를 회복하십시오\"로 결정한다. 예를 들어, 도 20에 도시된 바와 같이, 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 \"회복\" 주문의 주문 버튼이다. 멀티플레이어 온 라인 전투 프로그램은, 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"치료가 필요하다\"로 결정한다. 타깃 디스플레이 요소: 철수(기지) 주문. 철수 주문은 미리결정된 지속시간 동안의 기도 후에 사용자 캠프의 기지로 다시 순간이동하도록 구성된 주문이 다. 타깃 디스플레이 요소가 철수 주문인 경우, 도 21을 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 701. 가상 캐릭터가 철수 중인지를 결정한다. 단계 702는 가상 캐릭터가 \"철수\" 상태에 있을 때 수행된다. 단계 703은 가상 캐릭터가 \"철수\" 상태가 있지 않 을 때 수행된다. 단계 702. 타깃 프롬프트 정보를 \"철수중\"으로 결정한다. 단계 703. 개인 혈액량이 X%보다 낮은지를 결정한다. 단계 704는 혈액량이 X%보다 낮을 때 수행된다. 단계 705는 혈액량이 X%보다 낮지 않을 때 수행된다. 단계 704. 타깃 프롬프트 정보를 \"회복하려면 원천샘으로 돌아갈 필요가 있다\"로 결정한다. 단계 705. 에너지 바가 Y%보다 낮은지를 결정한다. 단계 704는 에너지 바가 Y%보다 낮을 때 수행된다. 단계 706은 에너지 바가 Y%보다 낮지 않을 때 수행된다. 단계 706. 타깃 프롬프트 정보를 \"나쁜 상태로 자만하지 말고, 회복을 위해 원천샘으로 돌아가십시오\"로 결정 한다. 예를 들어, 도 22에 도시된 바와 같이, 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 \"철수\" 주문의 주문 버튼이다. 멀티플레이어 온 라인 전투 프로그램은, 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"철수중\"으로 결정한다. 타깃 디스플레이 요소: 디바이스 정보 영역의 네트워크 속도 식별자. 네트워크 속도 식별자는 단말기가 현재 접속되어 있는 모바일 네트워크 또는 Wi-Fi(wireless fidelity) 네트워 크의 신호 품질을 나타내도록 구성된다. 도 23을 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 801. 네트워크 속도가 X ms보다 느린지를 결정한다. 단계 802는 네트워크 속도가 X ms보다 느릴 때 수행된다. 단계 803은 네트워크 속도가 X ms보다 느리지 않을 때 수행된다. 단계 802. 타깃 프롬프트 정보를 \"네트워크 속도가 매우 안정적이며, 안심하십시오\"로 결정한다. 단계 803. 타깃 프롬프트 정보를 \"죄송합니다, 네트워크가 불안정할 수 있습니다\"로 결정한다. 예를 들어, 도 24에 도시된 바와 같이, 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 \"네트워크 속도 식별자\"를 포함한 디바이스 정보 영역 이다. 멀티플레이어 온라인 전투 프로그램은, 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"죄송합니 다, 네트워크가 불안정할 수 있습니다\"라고 결정한다. 타깃 디스플레이 요소: 점수판. 점수판은 2개의 서로 대적하는 캠프의 가상 캐릭터의 처치 점수 비율량을 기록하도록 구성된 정보 디스플레이 컨트롤이다. 도 25를 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다.단계 901. 이 라운드가 시작 후 1분 미만인지를 결정한다. 단계 902는 이 라운드가 시작 후 1분 미만일 때 수행된다. 단계 903은 이 라운드가 시작 후 1분 이상일 때 수 행된다. 단계 902. 타깃 프롬프트 정보를 \"당신이 나를 속이는 사람이 아님을 확인했다\"로 결정한다. 단계 903. 이 라운드가 시작 후 18분 초과인지를 결정한다. 단계 904는 이 라운드가 시작 후 18분 초과일 때 수행된다. 단계 915는 이 라운드가 시작 후 18분 이하일 때 수행된다. 단계 904. 처치 점수 비율이 앞서 있는지를 결정한다. 단계 905는 처치 점수 비율이 앞서 있을 때 수행된다. 단계 910은 처치 점수 비율이 앞서 있지 않을 때 수행된 다. 단계 905. 전체 경제 차이가 x 내에 있는지를 결정한다. 단계 906은 전체 경제 차이가 x 이내일 때 수행된다. 단계 907은 전체 경제 차이가 x를 초과할 때 수행된다. 단계 906. 타깃 프롬프트 정보를 \"경제 차이가 크지 않다, 자만하지 마십시오\"로 결정한다. 단계 907. 전체 경제가 앞서 있는지를 결정한다. 단계 908은 전체 경제가 앞서 있을 때 수행된다. 단계 909는 전체 경제가 뒤처질 때 수행된다. 단계 908. 타깃 프롬프트 정보를 \"우리는 크게 유리하다, 계속 유지하십시오\"로 결정한다. 단계 909. 타깃 프롬프트 정보를 \"우리 경제가 뒤처져 있고, 성장을 위해 인내하십시오\"로 결정한다. 단계 910. 전체 경제 차이가 x 내에 있는지를 결정한다. 예를 들어, 임계값 x는 시간에 따라 달라진다. 예를 들어, 이 라운드의 시작후 지속시간은 y이고, 임계값 x는 다음과 같다: 이 라운드의 시작후 지속시간의 인터벌: 0초 내지 180초, x = 851; 이 라운드의 시작후 지속시간의 인터벌: 180초 내지 360초, x = 3(y-180) +851; 이 라운드의 시작후 지속시간의 인터벌: 180초 내지 360초, x = 1.28(y-180) +1391; 이 라운드의 시작후 지속시간의 인터벌: 180초 내지 360초, x = 7.86(y-180) +1623; 이 라운드의 시작후 지속시간의 인터벌: 180초 내지 360초, x = 3.09(y-180) +3038; 및 이 라운드의 시작후 지속시간의 인터벌: 900초 내지 1080초, x = 2.77(y-180) +3595. 단계 911은 전체 경제 차이가 x 이내일 때 수행된다. 단계 912는 전체 경제 차이가 x를 초과할 때 수행된다. 단계 911. 타깃 프롬프트 정보를 \"잠시만, 경제 차이가 크지 않다\"로 결정한다. 단계 912. 전체 경제가 앞서 있는지를 결정한다. 단계 913은 전체 경제가 앞서 있을 때 수행된다. 단계 914는 전체 경제가 뒤처질 때 수행된다. 단계 913. 타깃 프롬프트 정보를 \"우리 경제는 앞서 있다, 꾸준히 그리고 확실하게 전진하십시오\"로 결정한다. 단계 914. 타깃 프롬프트 정보를 \"협력에 주의하십시오, 우리는 이길 수 있습니다\"로 결정한다. 단계 915. 타깃 프롬프트 정보를 \"연대 전투에서 당신과 함께, 승리와 패배는 훌륭하다\"로 결정한다. 예를 들어, 도 26에 도시된 바와 같이, 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 점수판이다. 멀티플레이어 온라인 전투 프로그램 은 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"우리 경제가 앞서 있다, 꾸준히 그리고 확실하게 전진하 십시오\"라고 결정한다. 타깃 디스플레이 요소: 맵 보기 컨트롤의 상단 통로/중간 통로/하단 통로. 도 27을 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 1001. 이 라운드가 시작후 X분 미만인지를 결정한다. 단계 1002는 라운드가 시작후 X분 미만일 때 수행된다. 단계 1013은 라운드가 시작후 X분 이상일 때 수행된다. 단계 1002. 마스터 가상 캐릭터가 상단 통로/중간 통로/하단 통로 영역을 선택하고 마스터 가상 캐릭터가 그 영역 내에 있는지를 결정한다. 단계 1003은 마스터 가상 캐릭터가 상단 통로/중간 통로/하단 통로 영역을 선택하고 마스터 가상 캐릭터가 그 영역 내에 있을 때 수행된다; 그렇지 않으면 단계 1010이 수행된다. 단계 1003. 통로에 제1 포탑(첫번째 포탑)이 존재하는지를 결정한다. 단계 1004는 제1 포탑이 존재할 때 수행된다. 단계 1007은 제1 포탑이 존재하지 않을 때 수행된다. 단계 1004. 통로 범위 내에 적 가상 캐릭터의 어떠한 시야도 없는지를 결정한다. 단계 1005는 적 가상 캐릭터의 어떠한 시야도 없을 때 수행된다. 단계 1006은 X개의 적 가상 캐릭터의 시야들 이 있을 때 수행된다. 단계 1005. 타깃 프롬프트 정보를 \"상단 통로/중간 통로/하단 통로에는 적이 없다, 주의하십시오\"로 결정한다. 단계 1006. 타깃 프롬프트 정보를 \"상단 통로/중간 통로/하단 통로에 X명의 적이 있다\"로 결정한다. 단계 1007. 적 크립이 강변을 가로 지르는지(우리 영역에 진입하는지)를 결정한다. 단계 1008은 적 크립이 강변을 가로 지를 때 수행된다. 단계 1009는 적 크립이 강변을 가로 지르지 않을 때 수 행된다. 단계 1008. 타깃 프롬프트 정보를 \"상단 통로/중간 통로/하단 통로에서 크립 라인을 밀어내도록 주의하십시 오\"로 결정한다. 단계 1009. 타깃 프롬프트 정보를 \"상단 통로/중간 통로/하단 통로에 주의하십시오\"로 결정한다. 단계 1010. 이동 거리가 0.2초로 단축되는지를 결정한다. 사용자에 의해 제어되는 마스터 가상 캐릭터의 이동 거리가 0.2초로 단축되는지를 결정한다. 단계 1011은 이동 거리가 단축될 때 수행된다. 단계 1012는 이동 거리가 단축되지 않을 때 수행된다. 단계 1011. 타깃 프롬프트 정보를 \"가는 중이며, 대략 x초 후에 도착할 수 있습니다\"로 결정한다. 단계 1012. 타깃 프롬프트 정보를 \"주의\"로 결정한다. 단계 1013. 마스터 가상 캐릭터가 상단 통로/중간 통로/하단 통로 영역을 선택하고 마스터 가상 캐릭터가 그 영역 내에 있는지를 결정한다. 단계 1014는 마스터 가상 캐릭터가 상단 통로/중간 통로/하단 통로 영역을 선택하고 마스터 가상 캐릭터가 그 영역 내에 있을 때 수행된다; 그렇지 않으면 단계 1015가 수행된다. 단계 1014. 타깃 프롬프트 정보를 \"상단 통로/중간 통로/하단 통로에서 크립 라인을 밀어내게 해주십시오\"로 결정한다. 단계 1015. 적 크립이 강변을 가로 지르는지(우리 영역에 진입하는지)를 결정한다. 단계 1016은 적 크립이 강변을 가로 지를 때 수행된다. 단계 1017은 적 크립이 강변을 가로 지르지 않을 때 수 행된다. 단계 1016. 타깃 프롬프트 정보를 \"상단 통로/중간 통로/하단 통로에서 크립 라인을 밀어내도록 주의하라\"로 결정한다. 단계 1017. 이동 거리가 0.2초로 단축되는지를 결정한다. 사용자에 의해 제어되는 마스터 가상 캐릭터의 이동 거리가 0.2초로 단축되는지를 결정한다. 단계 1018은 이동 거리가 단축될 때 수행된다. 단계 1019는 이동 거리가 단축되지 않을 때 수행된다. 단계 1018. 타깃 프롬프트 정보를 \"가는 중이며, 대략 x초 후에 도착할 수 있다\"로 결정한다. 단계 1019. 타깃 프롬프트 정보를 \"주의\"로 결정한다. 예를 들어, 도 28에 도시된 바와 같이, 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 맵 보기 컨트롤 상의 중간 통로 영역이다. 멀티플레 이어 온라인 전투 프로그램은, 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"중간 통로에 주의하라\"로 결 정한다. 타깃 디스플레이 요소: 맵 보기 컨트롤 상의 큰 용(또는 작은 용). 큰 용(또는 작은 용)은, 큰 용(또는 작은 용)이 처치된 후 처치자 캠프의 모든 가상 캐릭터에게 BUFF 이득을 주 는 몬스터이다. 도 29를 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 1101. 큰 용(또는 작은 용)이 살아남는지를 결정한다. 단계 1102는 큰 용(또는 작은 용)이 살아남을 때 수행된다. 단계 1111은 큰 용(또는 작은 용)이 살아남지 못할 때 수행된다. 단계 1102. 큰 용(또는 작은 용)의 범위 내에 시야가 있는지를 결정한다. 단계 1103은 시야가 있을 때 수행된다; 그렇지 않으면 단계 1110이 수행된다. 단계 1103. 시야 내에 적 가상 캐릭터가 있는지를 결정한다. 단계 1104는 시야 내에 적 가상 캐릭터가 있을 때 수행된다. 단계 1109는 시야 내에 어떠한 적 가상 캐릭터도 없을 때 수행된다. 단계 1104. 큰 용(또는 작은 용)이 가득 찬 HP를 가지고 있는지를 결정한다. 단계 1105는 큰 용(또는 작은 용)이 가득 찬 HP를 가고 있을 때 수행된다. 단계 1106은 큰 용(또는 작은 용)이 가득 찬 HP를 가지고 있지 않을 때 수행된다. 단계 1105. 타깃 프롬프트 정보를 \"주의, 큰 용(또는 작은 용) 근처에 적 영웅이 있다\"로 결정한다. 단계 1106. 큰 용(또는 작은 용)의 혈액량이 X%보다 낮은지를 결정한다. 단계 1107은 혈액량이 X%보다 낮을 때 수행된다. 단계 1108은 혈액량이 X%보다 낮지 않을 때 수행된다. 단계 1107. 타깃 프롬프트 정보를 \"주의! 큰 용(또는 작은 용)의 혈액량은 비교적 낮다\"로 결정한다. 단계 1108. 타깃 프롬프트 정보를 \"주의! 큰 용(또는 작은 용)의 혈액량이 공격을 받고 있다\"로 결정한다. 단계 1109. 타깃 프롬프트 정보를 \"큰 용(또는 작은 용) 공격\"으로 결정한다. 단계 1110. 타깃 프롬프트 정보를 \"큰 용(또는 작은 용)이 태어날 때까지 x초 남았다\"로 결정한다. 예를 들어, 도 30에 도시된 바와 같이, 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 맵 보기 컨트롤 상의 작은 용 영역이다. 멀티플레이 어 온라인 전투 프로그램은, 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"작은 용이 공격을 받고 있다\"로 결정한다. 타깃 디스플레이 요소: 맵 보기 컨트롤에서의 적색(청색) BUFF. 적색(청색) BUFF는 정글의 타깃 몬스터가 처치된 후 획득하는 이득 효과이다. 도 31을 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 1201. 적색(청색) BUFF가 존속하는지를 결정한다. 단계 1202는 적색(청색) BUFF가 존속할 때 수행된다. 단계 1210은 적색(청색) BUFF가 존속하지 않을 때 수행된 다. 단계 1202. 적색(청색) BUFF가 우리 영역의 적색(청색) BUFF인지를 결정한다. 단계 1203은 적색(청색) BUFF가 우리 영역의 적색(청색) BUFF일 때 수행된다. 단계 1207은 적색(청색) BUFF가 적 영역의 적색(청색) BUFF일 때 수행된다. 단계 1203. 적색(청색) BUFF의 시야가 있는지를 결정한다. 단계 1204는 적색(청색) BUFF의 시야가 있을 때 수행된다. 단계 1206은 적색(청색) BUFF의 시야가 없을 때 수 행된다. 단계 1204. 시야 내에 적 가상 캐릭터가 있는지를 결정한다. 단계 1205는 시야 내에 적 가상 캐릭터가 있을 때 수행된다. 단계 1206은 시야 내에 어떠한 적 가상 캐릭터도 없을 때 수행된다. 단계 1205. 타깃 프롬프트 정보를 \"적색(청색) BUFF를 몰래 죽이는 적을 조심하라\"로 결정한다. 단계 1206. 타깃 프롬프트 정보를 \"적이 적색(청색) BUFF를 공격하고 있다\"로 결정한다. 단계 1207. 시야 내에 적 가상 캐릭터가 있는지를 결정한다. 단계 1208은 시야 내에 적 가상 캐릭터가 있을 때 수행된다. 단계 1209는 시야 내에 어떠한 적 가상 캐릭터도 없을 때 수행된다. 단계 1208. 타깃 프롬프트 정보를 \"적 영역의 적색(청색) BUFF를 공격\"으로 결정한다. 단계 1209. 타깃 프롬프트 정보를 \"적 영역의 적색(청색) BUFF에 주의\"로 결정한다. 단계 1210. 적색(청색) BUFF가 우리 영역에서의 적색(청색) BUFF인지를 결정한다. 단계 1211은 적색(청색) BUFF가 우리 영역의 적색(청색) BUFF일 때 수행된다. 단계 1212는 적색(청색) BUFF가 적 영역의 적색(청색) BUFF일 때 수행된다. 단계 1211. 타깃 프롬프트 정보를 \"우리 영역의 적색(청색) BUFF가 태어나기까지 X초 남았습니다\"로 결정한다. 단계 1212. 적 영역에서의 적색(청색) BUFF의 사망 동안 시야가 있는지를 결정한다. 단계 1213은 사망 동안에 시야가 있을 때 수행된다. 단계 1214는 사망 동안에 시야가 없을 때 수행된다. 단계 1213. 타깃 프롬프트 정보를 \"적 영역의 적색(청색) BUFF가 태어나기까지 X초 남았습니다\"로 결정한다. 단계 1214. 타깃 프롬프트 정보를 \"적 영역의 적색(청색) BUFF에 주의\"로 결정한다. 예를 들어, 도 32에 도시된 바와 같이, 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 맵 보기 컨트롤 상의 우리 영역의 적색 BUFF 몬스터의 위치이다. 멀티플레이어 온라인 전투 프로그램은, 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"적색 BUFF를 몰래 죽이는 적을 주의하라\"로 결정한다. 타깃 디스플레이 요소: 가상 캐릭터(영웅이라고도 함). 도 33을 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 1301. 가상 캐릭터가 사용자 자신(마스터 가상 캐릭터)인지를 결정한다. 단계 1302는 가상 캐릭터가 마스터 가상 캐릭터일 때 수행된다. 단계 1305는 가상 캐릭터가 마스터 가상 캐릭 터가 아닐 때 수행된다. 단계 1302. 가상 캐릭터의 혈액량이 X%보다 낮은지를 결정한다. 단계 1303은 혈액량이 X%보다 낮을 때 수행된다. 단계 1304는 혈액량이 X%보다 낮지 않을 때 수행된다. 단계 1303. 타깃 프롬프트 정보를 \"상태가 좋지 않다\"로 결정한다. 단계 1304. 타깃 프롬프트 정보를 \"도움이 필요하다\"로 결정한다. 단계 1305. 가상 캐릭터가 우리 캠프의 가상 캐릭터인지를 결정한다. 단계 1306은 가상 캐릭터가 우리 캠프의 가상 캐릭터일 때 수행된다. 단계 1315는 가상 캐릭터가 우리 캠프의 가상 캐릭터가 아닐 때 수행된다. 단계 1306. 가상 캐릭터가 강타 능력을 가지고 있고 3보다 많은 몬스터를 처치했는지, 및 전투의 이 라운드가 시작후 x분 미만인지를 결정한다. 만일 그렇다면 단계 1307이 수행되고; 그렇지 않으면, 단계 1310이 수행된다. 단계 1307. 가상 캐릭터의 혈액량이 X%보다 낮은지를 결정한다. 단계 1308은 혈액량이 X%보다 낮을 때 수행된다. 단계 1309는 혈액량이 X%보다 낮지 않을 때 수행된다. 단계 1308. 타깃 프롬프트 정보를 \"우리 캠프의 xxx가 상태가 좋지 않다\"로 결정한다. 단계 1309. 타깃 프롬프트 정보를 \"암살자의 도움이 필요하다\"로 결정한다. 단계 1310. 가상 캐릭터의 혈액량이 X%보다 낮은지를 결정한다. 단계 1311은 혈액량이 X%보다 낮을 때 수행된다. 단계 1314는 혈액량이 X%보다 낮지 않을 때 수행된다. 단계 1311. 가상 캐릭터가 비전투 상태인지를 결정한다. 단계 1312는 가상 캐릭터가 비전투 상태에 있을 때 수행된다. 단계 1313은 가상 캐릭터가 비전투 상태가 아닐 때 수행된다. 단계 1312. 타깃 프롬프트 정보를 \"우리 캠프의 xxx가 상태가 좋지 않다\"로 결정한다. 단계 1313. 타깃 프롬프트 정보를 \"우리 캠프의 xxx를 보호하라\"로 결정한다. 단계 1314. 타깃 프롬프트 정보를 \"우리 캠프의 xxx에 주의하라\"로 결정한다. 단계 1315. 가상 캐릭터의 혈액량이 X%보다 낮은지를 결정한다. 단계 1303은 혈액량이 X%보다 낮을 때 수행된다. 단계 1317은 혈액량이 X%보다 낮지 않을 때 수행된다. 단계 1303. 타깃 프롬프트 정보를 \"적군 캠프의 xxx의 혈액량이 x% 미만이다\"로 결정한다. 단계 1304. 타깃 프롬프트 정보를 \"적군 캠프의 xxx를 공격\"으로 결정한다. 예를 들어, 도 34에 도시된 바와 같이 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 적 가상 캐릭터 \"Li Bai\"이다. 멀티플레이어 온라인 전투 프로그램은, 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"적 Li Bai의 혈액량이 10% 미만이다\"로 결 정한다. 타깃 디스플레이 요소: 맵 보기 컨트롤에서의 요새(또는 기지 또는 포탑). 도 35를 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 1401. 요새가 기지인지를 결정한다. 단계 1402는 요새가 기지일 때 수행된다. 단계 1407은 요새가 기지가 아닐 때 수행된다. 단계 1402. 요새가 우리 캠프의 기지인지를 결정한다. 단계 1403은 요새가 우리 캠프의 기지일 때 수행된다. 단계 1404는 요새가 우리 캠프의 기지가 아닐 때 수행된 다. 단계 1403. 타깃 프롬프트 정보를 \"적의 기지 공격\"으로 결정한다. 단계 1404. 기지가 공격을 받고 있는지를 결정한다. 단계 1405는 기지가 공격을 받고 있을 때 수행된다. 단계 1406은 기지가 공격을 받고 있지 않을 때 수행된다. 단계 1405. 타깃 프롬프트 정보를 \"우리 캠프의 기지가 공격을 받고 있다\"로 결정한다. 단계 1406. 타깃 프롬프트 정보를 \"기지 방어를 위해 되돌아 가라\"로 결정한다. 단계 1407. 요새가 우리 캠프의 포탑인지를 결정한다. 단계 1408은 요새가 우리 캠프의 포탑일 때 수행된다. 단계 1413은 요새가 우리 캠프의 포탑이 아닐 때 수행된 다.단계 1408. 기지가 공격을 받고 있는지를 결정한다. 단계 1409는 기지가 공격을 받고 있을 때 수행된다. 단계 1410은 기지가 공격을 받고 있지 않을 때 수행된다. 단계 1409. 타깃 프롬프트 정보를 \"우리 캠프의 포탑이 공격받고 있다\"로 결정한다. 단계 1410. 가상 캐릭터의 혈액량이 X%보다 낮은지를 결정한다. 단계 1411은 혈액량이 X%보다 낮을 때 수행된다. 단계 1412는 혈액량이 X%보다 낮지 않을 때 수행된다. 단계 1411. 타깃 프롬프트 정보를 \"우리 캠프의 포탑을 보호하라\"로 결정한다. 단계 1412. 타깃 프롬프트 정보를 \"우리 캠프의 포탑에 주의하라\"로 결정한다. 단계 1413. 타깃 프롬프트 정보를 \"적군 캠프의 포탑 공격\"으로 결정한다. 예를 들어, 도 36에 도시된 바와 같이 사용자는 UI에 슬라이드 조작을 적용하고, 슬라이드 조작의 슬라이드 시 작점은 신호 버튼이고, 슬라이드 조작의 슬라이드 끝점은 우리 캠프의 기지이다. 멀티플레이어 온라인 전투 프 로그램은, 현재 전투 정보를 참조하여 타깃 프롬프트 정보를 \"기지 방어를 위해 되돌아 가라\"로 결정한다. 타깃 디스플레이 요소: 수풀. 도 37을 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 1501. 선택된 수풀이 가상 캐릭터가 위치해 있는 수풀인지를 결정한다. 단계 1502는 수풀이 가상 캐릭터가 위치해 있는 수풀일 때 수행된다. 단계 1503은 수풀이 가상 캐릭터가 위치 해 있는 수풀이 아닐 때 수행된다. 단계 1502. 타깃 프롬프트 정보를 \"와서 수풀에서 기다리라\"로 결정한다. 단계 1503. 타깃 프롬프트 정보를 \"수풀의 적을 조심하라\"로 결정한다. 타깃 디스플레이 요소: 뼈대 용. 뼈대 용은 리틀 용이라고도하며, 일부 MOBA 맵에서 강변에 있는 큰 용의 반대편에 위치한 몬스터이다. 도 38을 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 1601. 뼈대 용이 살아남는지를 결정한다. 단계 1602는 뼈대 용이 살아남으면 수행된다. 단계 1607은 뼈대 용이 살아남지 못하면 수행된다. 단계 1602. 뼈대 용의 시야가 있는지를 결정한다. 단계 1603은 뼈대 용의 시야가 있을 때 수행된다. 단계 1606은 뼈대 용의 시야가 없을 때 수행된다. 단계 1603. 시야 내에 적 가상 캐릭터가 있는지를 결정한다. 단계 1604는 시야 내에 적 가상 캐릭터가 있을 때 수행된다. 단계 1605는 시야 내에 어떠한 적 가상 캐릭터도 없을 때 수행된다. 단계 1604. 타깃 프롬프트 정보를 \"뼈대 용을 몰래 죽이는 적을 조심하라\"로 결정한다. 단계 1605. 타깃 프롬프트 정보를 \"뼈대 용을 공격\"으로 결정한다. 단계 1606. 타깃 프롬프트 정보를 \"뼈대 용에 주의하라\"로 결정한다. 단계 1607. 타깃 프롬프트 정보를 \"뼈대 용이 태어날 때까지 x초 남았다\"로 결정한다. 타깃 디스플레이 요소: 맵 보기 컨트롤에서의 또 다른 영역. 도 39를 참조하면, 전술된 단계 303은 다음과 같은 단계들로 구현될 수 있다. 단계 1701. 이동 거리가 0.2초로 단축되는지를 결정한다. 단계 1702는 이동 거리가 단축될 때 수행된다. 단계 1703은 이동 거리가 단축되지 않을 때 수행된다. 단계 1702. 타깃 프롬프트 정보를 \"가는 중이며, 대략 x초 후에 도착할 수 있다\"로 결정한다. 단계 1703. 타깃 프롬프트 정보를 \"주의\"로 결정한다. 상이한 실시예들에서, 전술된 디스플레이 요소들은 더 확장될 수 있으며, 전술된 제한된 디스플레이 요소들로 제한되는 것은 아니다. 디스플레이 요소들은, 다음과 같은 유형들을 포함하지만, 이것으로 제한되는 것은 아니 다. 한 예에서, 디스플레이 요소들은 가상 환경에서 장식을 위해 이용되는 3차원 모델들 또는 2차원 요소들을 더 포 함한다. 도 40에 도시된 바와 같이, 가상 환경에서 장식에 이용되는 랜턴 요소가 있고 사용자의 방향 조작이 랜턴 요소 를 가리키면, 타깃 프롬프트 정보 \"행복한 봄 축제, 내 소원이 이루어져라!\"가 전송된다. 한 예에서, 디스플레이 요소들은 가상 환경에서 실제 세계와 연관된 요소들을 더 포함한다. 도 41에 도시된 바와 같이, 가상 환경에서 사용자 플레이어의 아바타 \"X God\"가 가상 환경 내의 또 다른 가상 캐릭터 위에 존재할 때, 사용자의 방향 조작은 그 아바타를 가리키고, 우연히 X God의 생일일 경우, 타깃 프롬 프트 정보 \"해피 버스데이 투 X God!\". 한 예에서, 디스플레이 요소들은 가상 환경에서 사용자 계정들과 연관된 요소들을 더 포함한다. 도 42에 도시된 바와 같이, 가상 환경에서 게임 앵커의 닉네임 \"First Li Bai in the national service: Meng Meng\"이 가상 환경 내의 또 다른 가상 캐릭터 위에 존재하고 사용자의 방향 조작이 그 닉네임을 가리키면, 타깃 프롬프트 정보 \"First Li Bai in the national service: Meng Meng, I am your fans, cool!\"이 전송된다. 한 예에서, 디스플레이 요소들은 사용자 계정들이 가상 환경에 속하는 팀들과 연관된 요소들을 더 포함한다. 도 43에 도시된 바와 같이, 가상 환경의 지면에 San Gao 팀의 깃발이 있고 사용자의 방향 조작이 San Gao 팀의 깃발을 가리키면, 타깃 프롬프트 정보 \"San Gao 팀은 강력하다 San Gao 팀을 응원해요~\"가 전송된다. 한 예에서, 디스플레이 요소들은 다른 사용자 계정들에 의해 전송된 프롬프트 정보를 더 포함한다. 도 44에 나타난 바와 같이, 또 다른 사용자 계정에 의해 전송된 프롬프트 정보 \"First Li Bai in the national service: Meng Meng, I am your fans, cool!\"가 가상 환경의 지상에 존재하고 사용자의 방향 조작이 그 프롬프 트 정보를 가리킬 때, 타깃 프롬프트 정보 \"Thanks a lot, I love you!\"가 전송된다. 전술된 실시예들에서 HUD 영역 내의 디스플레이 요소들의 배치 위치들은 가변적이다. 도 45에 도시된 예에서, 점수판, 디바이스 정보 영역 및 마스터 가상 캐릭터 점수 영역은 좌측에 위치한 미니맵 컨트롤의 상위 영역에 배치된다. 상이한 실시예들에서, 더 많거나 더 적은 디스플레이 요소들이 HUD 영역에 존재할 수"}
{"patent_id": "10-2021-7025848", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "있고, 이것은 전술된 실시예들에 기초하여 관련 기술분야의 통상의 기술자에 의해 용이하게 고려될 수 있으며, 상세사항은 여기서 반복되지 않는다. 한 예에서, 프롬프트 정보 전송 기능은 사용자에 의해 수동으로 인에이블될 수 있다. 즉, 사용자는 프롬프트 정보 전송 기능을 인에이블할지를 수동으로 제어한다. 또 다른 예에서, 프롬프트 정보 수신 기능도 역시 사용 자에 의해 수동으로 인에이블될 수 있다. 도 46에 도시된 바와 같이, \"설정\" 인터페이스의 \"기본 설정\" 패널에 서, \"팀원 신호 제한하기\"의 설정 옵션이 제공된다. \"팀원 신호 제한하기\" 설정 옵션이 인에이블되면, 현재 클 라이언트는 다른 팀원들의 클라이언트들에 의해 전송된 프롬프트 정보를 더 이상 디스플레이하지 않는다. 한 예에서, 방향 조작의 트리거링 방식은 사용자에 의해 수동으로 인에이블될 수 있다. 도 47에 도시된 바와 같이, \"설정\" 인터페이스의 \"조작 설정\" 패널에서, \"맵 신호 전송 방식\"의 설정 옵션이 제공된다. 사용자가 \" 포인트 터치 전송\" 방식을 체크하면, 도 6에 도시된 트리거링 방식이 채택된다. 사용자가 \"슬라이딩 전송\" 방 식을 체크하면, 도 8에 도시된 트리거링 방식이 채택된다. 전술된 프롬프트 정보는 친근한 사용자 또는 모든 사용자에게 전송될 수 있을뿐만 아니라, 로컬 클라이언트에도 디스플레이될 수 있다. 따라서, 본 출원은 이하의 실시예를 더 제공한다. 도 48은 본 출원의 한 예시적인 실시예에 따른 프롬프트 정보를 디스플레이하기 위한 방법의 플로차트이다. 이 방법은 도 1의 임의의 단말기에 의해 수행될 수 있고, 이 방법은 다음과 같은 단계를 포함한다. 단계 401. 멀티플레이어 온라인 전투 프로그램의 UI를 디스플레이한다. 멀티플레이어 온라인 전투 프로그램은, 적어도 2명의 사용자가 가상 환경에서 전투하기 위해 가상 캐릭터를 제 어하는 것을 제공하는 프로그램이다. 가상 환경은 적어도 2명의 가상 캐릭터가 전투할 수 있도록 구성된 전투 환경이다. 멀티플레이어 온라인 전투 프로그램은, 군사 시뮬레이션 프로그램, MOBA 게임, 전투 로얄 슈팅 게임, SLG 중 임의의 하나일 수 있다. 이 실시예에서, 멀티플레이어 온라인 전투 프로그램은 MOBA 게임인 예가 설명을 위해 이용된다. 한 예에서, 도 4에 도시된 바와 같이, 멀티플레이어 온라인 전투 프로그램의 UI는 가상 환경 이미지 및 상호작용 패널 영역을 포함한다. 가상 환경 이미지는, 마스터 가상 캐릭터에 대응하는 관점에서 관찰된 가상 환경의 이미지이다. 마스 터 가상 캐릭터는, 가상 환경에서 단말기를 이용하여 사용자에 의해 제어되는 가상 캐릭터이다. 마스터 가상 캐릭터에 대응하는 시점(perspective)은, 마스터 가상 캐릭터의 1 인칭 시점, 45° 조감도(bird’s-eye view), 3 인칭 시점, 어깨너머(over-shoulder) 시점 중 어느 하나일 수 있다. 이 실시예의 설명을 위해, 한 예는 45° 조감도를 이용한다. 마스터 가상 캐릭터가 움직이거나 회전할 때, 가상 환경 이미지는 어느 때라도 변한다. 마스터 가상 캐릭 터는 가상 환경 이미지에서 나타나거나 가상 환경 이미지에서 나타나지 않을 수 있다. 상호작용 패널 영역은 가상 환경 이미지에 중첩된 UI 요소이다. 상호작용 패널 영역은 2개의 유형 으로 나뉜다: 정보를 디스플레이하는데 이용되는 정보 디스플레이 요소들과 인간-머신 상호작용에 이용되는 제 어 기능 요소들. 상호작용 패널 영역은 HUD 영역이라고도 한다. 예를 들어, 도 5에 도시된 바와 같이, HUD 영역은 다음을 포함한다: 미니 맵 영역, 친구 정보 영역, 점수판, 디바이스 정보 영역 및 마스터 가상 캐릭터 점수 영역 , 메뉴 영역, 미니 맵 영역 확장 버튼, 버튼 컨트롤, 채팅 컨트롤, 마스터 가상 캐릭터의 스킬 버튼, 마스터 가상 캐릭터의 공격 스킬 버튼, 소환사 능력, 회복 스킬, 철수 스킬, 이동 컨트롤, 금화 영역, 권장 장비. 친구 정보 영역, 점수판, 디바이스 정보 영역 및 마스터 가상 캐릭터 점수 영역은 정보 디스플레이 요소들이고, 다른 요소들은 제어 기능 요소들이다. 상호작용 패널 영역은, 사망 패널, 포탑-공격 버튼, 및 크립 공격 버튼 등의 다른 요소들을 포함할 수 있으며, 이것은 실시예에서 제한되지 않는다. 사용자가 전투 라운드를 시작한 후, 멀티플레이어 온라인 전투 프로그램의 UI가 디스플레이된다. 단계 402. UI에서 방향 조작을 수신한다, 방향 조작은 프롬프트 정보 전송 기능을 활성화하고 UI 내의 타깃 디 스플레이 요소를 가리키는 조작이다. 사용자가 프롬프트 정보를 전송할 필요가 있을 때, 사용자는 UI에 방향 조작을 적용한다. 방향 조작은 사용자 조작이거나, 2개 이상의 사용자 조작에 의해 형성된 조작 조합일 수도 있다. 방향 조작은 프롬프트 정보 전송 기능을 활성화하고 UI 내의 타깃 디스플레이 요소를 가리키기 위한 조작이다. 타깃 디스플레이 요소는 UI 내의 복수의 디스플레이 요소 중 하나이다. 한 예에서, 방향 조작은, 더블 탭, 트 리플 탭, 또는 타깃 디스플레이 요소를 오래 누르는 조작이다. 또 다른 예에서, 상호작용 패널 영역은 신호 컨 트롤을 포함한다. 방향 조작은 신호 컨트롤로부터 UI 내의 타깃 디스플레이 요소를 가리키는 조작이다. 신호 컨트롤은 프롬프트 정보 전송 기능을 활성화하기 위한 제어이다. UI 내의 복수의 디스플레이 요소는, 다음과 같은 요소들 중 적어도 하나를 포함하지만, 이것으로 제한되는 것은 아니다. 1. 가상 환경에서 전투 기능 요소들(비장식 요소들 및 비시각적 프리젠테이션 요소들)을 형성하는 3차원 모델 들. 예를 들어, 전투 기능 요소들은 가상 환경에서 전투 과정에 영향을 미치는 요소들이다. 3차원 모델은, 가상 캐 릭터, 포탑, 기지, 몬스터, 수풀, 탐지 눈, 큰 용, 작은 용 등을 포함하지만, 이것으로 제한되는 것은 아니다. 2. 상호작용 패널 영역의 정보 디스플레이 요소들. 예를 들어, 정보 디스플레이 요소들은, 친구 정보 영역, 점수판, 디바이스 정보 영역, 및 마스터 가상 캐릭터 점수 영역, 및 도 5에 도시되지 않은 사망 패널을 포함한다. 3. 상호작용 패널 영역의 제어 기능 요소들. 예를 들어, 제어 기능 요소들은, 미니 맵 영역, 미니 맵 확장 버튼, 버튼 컨트롤, 채팅 컨트롤 , 마스터 가상 캐릭터의 스킬 버튼, 마스터 가상 캐릭터의 공격 스킬 버튼, 소환사 능력, 이동 컨트롤, 금화 영역, 및 권장 장비를 포함한다. 예를 들어, 제어 기능 요소들은 고속 신호 버튼을 더 포함한다. 고속 신호 버튼은, 공격 버튼, 퇴각 버튼, 및 집결 버튼(도 5에 도시되지 않음)을 포함하지만, 이것으로 제한되는 것은 아니다. 단계 403. 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측한다. 타깃 디스플레이 요소는 방향 조작에 의해 선택된 디스플레이 요소이다. 전투 정보는 전투 라운드 동안의 전투 상황 정보이다. 전투 정보는, 다음과 같은 것들을 포함하지만, 이것으로 제한되는 것은 아니다: 이 전투 라운 드의 시작후 지속시간, 가상 캐릭터의 레벨, 스킬 업그레이드 정보, 스킬 쿨다운 정보, 소환사 능력 유형, 가상 캐릭터의 체력(HP), 포탑의 HP, 가상 캐릭터와 수풀 사이의 위치 관계, 크립 라인 상황, 몬스터 리프레시 상황, 네트워크 정보, 팀원 위치, 적 위치, 처치 정보, 사망 정보, 날짜 정보, 축제 정보, 위치 정보, 매치 정보, 캠 프의 캠프 명칭. 예를 들어, 프롬프트 정보는, 팀원, 적, 또는 모든 가상 캐릭터에 대한 정보 프롬프트를 수행하기 위한 정보이 다. 프롬프트 정보의 형태는, 텍스트, 음성, 아이콘, 애니메이션, 및 진동 피드백 중 적어도 하나를 포함하지 만, 이것으로 제한되는 것은 아니다. 한 예에서, 프롬프트 정보는, 2개 유형의 정보: 사실 정보와 의도 정보를 포함한다. 사실 정보는 현재 전투에서 존재하는 사실을 나타내는 정보이다, 예를 들어, 몬스터가 리프레시되고, 포탑이 공격을 받고 있고, 적이 보인다 등. 의도 정보는 사용자의 전략 의도를 나타내는 정보로 서, 예를 들어, 상단 통로에서 크립 라인을 밀어내고, 수풀에서 매복을 조심하고, 경제가 너무 열악하고, 우리 가 성장할 필요가 있다 등에 주의를 기울여야 한다는 정보이다. 단계 404. UI 상에 타깃 프롬프트 정보를 디스플레이한다. 클라이언트는 그 자신의 UI에 타깃 프롬프트 정보를 디스플레이한다. 예를 들어, 클라이언트는, UI의 좌측 영 역, 중앙 영역, 또는 우측 영역에 타깃 프롬프트 정보를 디스플레이한다. 일부 실시예에서, 타깃 프롬프트 정보의 디스플레이 지속시간이 디스플레이 임계값에 도달하면, 타깃 프롬프트 정보의 디스플레이가 취소된다. 예를 들어, 타깃 프롬프트 정보의 디스플레이는 블랭킹 방식으로 취소된다. 이 실시예는 독립적으로 구현되거나, 전술된 실시예들과 조합하여 구현될 수도 있고, 이것은 본 출원에서 제한 되지 않는다. 일부 실시예에서, 전술된 클라이언트(멀티플레이어 온라인 전투 프로그램)는, 대안으로서, 슈팅 게임, 레이싱 게임, 전투 로얄 게임, 또는 군사 시뮬레이션 프로그램 등의 프로그램일 수 있다. 클라이언트는, Windows 운영 체제, Apple 운영 체제, Android 운영 체제, iOS 운영 체제 및 LINUX 운영 체제 중 적어도 하나의 운영 체제를 지원할 수 있고, 상이한 운영 체제들 상의 클라이언트들은 서로 접속되어 통신할 수 있다. 일부 실시예에서, 전술된 클라이언트는 터치스크린을 갖는 모바일 단말기에 적합화된 프로그램이다. 일부 실시예에서, 전술된 클라이언트는 3차원 엔진에 기초하여 개발된 애플리케이션 프로그램이다. 예를 들어, 3차원 엔진은 Unity 엔진이다. 도 49는 본 출원의 한 예시적인 실시예에 따른 단말기의 개략적인 구조도이다. 도 49에 도시된 바와 같이, 단말기는, 프로세서, 터치스크린, 및 메모리를 포함한다. 프로세서는, 싱글 코어 프로세서, 멀티 코어 프로세서, 임베디드 칩, 명령어 실행 능력을 갖는 프로세서 중 적어도 하나일 수 있다. 터치스크린은 압력 감지 터치스크린을 포함한다. 압력 감지 터치스크린은 터치스크린 상의 누르는 힘 을 측정할 수 있다. 메모리는 프로세서에 의해 실행가능한 프로그램을 저장한다. 개략적으로, 메모리는, 멀티플레이어 온라인 전투 프로그램 A, 애플리케이션 프로그램 B, 애플리케이션 프로그램 C, 터치 및 압력 감지 모듈, 및 운영 체제의 커널 계층을 저장한다. 멀티플레이어 온라인 전투 프로그램 A는, 3차원 가상 엔진에 기초 하여 개발된 애플리케이션 프로그램이다. 일부 실시예에서, 멀티플레이어 온라인 전투 프로그램 A는, 3차원 가 상 엔진에 의해 개발된, 게임 프로그램, 가상 현실(VR) 프로그램, 3차원 맵 프로그램, 및 3차원 데모 프로 그램 중 적어도 하나를 포함하지만 이것으로 제한되는 것은 아니다. 한 예에서, 단말기의 운영 체제가 Android 운영 체제인 경우, 멀티플레이어 온라인 전투 프로그램 A는 자바 프로그래밍 언어와 C# 언어를 이용하여 개발된다. 또 다른 예에서, 단말기의 운영 체제가 iOS 운영 체제인 경우, 멀티플레이어 온라인 전투 프로그램 A는, Object-C 프로그래밍 언어와 C# 언어를 이용하여 개발된다. 3차원 가상 엔진은 복수의 운영 체제 플랫폼을 지원하는 3차원 대화형 엔진이다. 개략적으로, 3차원 가상 엔진은, 게임 개발 분야, VR 분야, 및 3차원 맵 분야 등의 복수의 분야에서 프로그램 개발에 적용될 수 있다. 3차원 가상 엔진의 특정한 유형은 본 출원의 이 실시예에서 제한되지 않는다. 3차원 가상 엔진이 Unity 엔진인 예가 이하의 실시예에서 설명을 위해 이용된다. 터치(및 압력) 감지 모듈은, 터치스크린 구동 프로그램에 의해 보고된 터치 이벤트(및 압력 터치 및 제어 이벤트)를 수신하도록 구성된 모듈이다. 터치 이벤트는 터치 이벤트의 유형 및 좌표 값들을 포함된다. 터치 이벤트의 유형은, 터치 시작 이벤트, 터치 이동 이벤트, 및 터치 드롭 이벤트를 포함하지만, 이것으로 제 한되는 것은 아니다. 압력 터치 및 제어 이벤트는, 압력 터치 및 제어 이벤트의 압력 값과 좌표 값들을 포함한 다. 좌표 값들은, 디스플레이 스크린 상의 터치 및 압력 터치의 제어 위치 및 제어 조작을 나타내도록 구성된 다. 일부 실시예에서, x 축은 디스플레이 스크린의 수평 방향으로 설정되고 y 축은 디스플레이 스크린의 수직 방향으로 설정되므로, 2차원 좌표계가 획득된다. 개략적으로, 커널 계층은 터치스크린 구동 프로그램 및 또 다른 구동 프로그램을 포함한다. 터 치스크린 구동 프로그램은, 압력 터치 및 제어 이벤트를 검출하도록 구성된 모듈이다. 압력 터치 및 제어 이벤트를 검출하면, 터치스크린 구동 프로그램은 압력 터치 및 제어 이벤트를 압력 감지 모듈에 전달 한다. 또 다른 구동 프로그램은, 프로세서에 관련된 구동 프로그램, 메모리에 관련된 구동 프로그램, 네 트워크 컴포넌트에 관련된 구동 프로그램, 사운드 컴포넌트에 관련된 구동 프로그램 등일 수 있다."}
{"patent_id": "10-2021-7025848", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 기술분야의 통상의 기술자라면, 전술된 내용이 단말기 구조의 개요일뿐이라는 것을 알 수 있을 것이다. 상 이한 실시예들에서, 단말기는 더 많거나 더 적은 컴포넌트들을 가질 수 있다. 예를 들어, 단말기는, 중력 가속 도 센서, 자이로스코프 센서, 전원 등을 더 포함할 수 있다. 도 50에 도시된 바와 같이, 코드 구현에서 전술된 프롬프트 정보 전송 기능은 4개의 단계로 나뉠 수 있다. 단계 41. 프리젠테이션 계층에서 사용자의 조작을 수신한다. 프리젠테이션 계층은 UI가 위치해 있는 계층이다. 터치스크린을 갖는 모바일 단말기를 예로서 이용하여, 클라 이언트는 프리젠테이션 계층에서 사용자의 터치 조작을 수신한다. 클라이언트는 타깃 디스플레이 요소를 선택하고 터치 조작에 따라 대응하는 전송자 엔티티를 호출한다. 전술된 메모리는 전술된 프롬프트 정보 전송 기능을 구현하는데 이용되는 베이스 클래스들을 저장한다. 전체 프리젠테이션 계층의 상호작용 절차 제어는 일반적으로 사용자가 UI 상에서 방향 조작(드래그, 릴리스, 탭)을 수행하고, 프롬프트 정보 전송 기능을 활성화하고, 프롬프트 정보를 전송할 때 그 사용자의 거동을 설명 할 수 있다. 사용자의 조작 거동에 따라 상이한 상호작용 제어 엔티티들이 추상화될 수 있다. 도 51에 도시된 바와 같이, CUICommunicateUnitTrigger: 이것은, 사용자의 오래 누르기 조작, 드래그 조작, 릴리스 조작 등의 방향 조작의 수신을 담당하고, 프롬프트 정보 전송 기능의 트리거 역할을 하며, 메시지를 마스터 제어기에 전송하는 역할을 한다. CommunicateController: 이것은 마스터 제어기로서 역할하며, CUICommunicateUnitTrigger로부터 전송된 메시지 를 수신하고 대응하는 절차를 실행하는 것을 담당한다; CommunicateSystemView: 이것은, 프롬프트 정보 전송 기능에서 어떤 기본적인 UI의 디스플레이를 제어하는 것, 예를 들어, 보조선(또는 이동 경로)의 업데이트를 담당한다; 및 CUICommunicateUnitSender: 이것은, 프롬프트 정보를 전송하는 엔티티를 식별하는 것을 담당하고, CUICommunicateUnitSender의 거동은 CommunicateController에 의해 구동된다. 단계 42. 전송자 엔티티를 호출한다. 도 52에 도시된 바와 같이, 메모리는 신호를 전송하도록 트리거링하는데 이용되는 단위 베이스 클래스 CBaseSenderUnit을 저장하며, 단위 베이스 클래스 CBaseSenderUnit에 의해 정의된 여러 기능(OnActive,OnDeactive, OnEnter, OnExit, 및 OnSend)은 모두 가상 기능이며, 기능들의 파생 클래스들은 프롬프트 신호의 특정한 전송 거동을 구현하는데 이용된다. 한 예시적인 전투 라운드에서, 프롬프트 정보를 트리거링할 수 있는 디스플레이 요소들은 2개의 유형으로 분류될 수 있다: 3차원 가상 환경의 3차원 전장 요소들과 HUD 영역의 2차 원 UI 요소들. 코드 구현에서, 2개의 유형의 객체들(3차원 전장 요소들 및 2차원 UI 요소들)이 추상화될 수 있 다. 사용자가 조작할 때, 상이한 유형들의 엔티티들은 각각 대응하는 논리적 거동을 수행한다. 예시적인 참조를 위해, 방향 조작이 3차원 전장 요소를 타깃 디스플레이 요소로서 결정하면, 3차원 전장 캐릭터 의 전송자 엔티티 유닛 CSceneSenderUnit을 호출하는 논리적 거동이 트리거링된다. 방향 조작이 2차원 UI 요소 를 타깃 디스플레이 요소로서 결정하면, 2차원 UI 요소의 전송자 엔티티 유닛 CUISenderUnit을 호출하는 논리적 거동이 트리거링된다. 기타의 논리적 거동들은, 2개의 논리적 거동, 예를 들어 CUISenderUnit으로부터 상속된 미니맵 신호 전송자 엔티티 유닛 CUIMinimapSenderUnit으로부터 파생될 수 있다. 방향 조작이 미니맵(또는 중 간 맵) 요소를 타깃 디스플레이 요소로서 결정하면, 미니맵 신호 전송자 엔티티 유닛 CUIMinimapSenderUnit을 호출하는 논리적 거동이 트리거링된다. 단계 43. 논리적 결정을 수행하기 위해 거동 트리 호출한다. 플레이어가 타깃 디스플레이 요소에 관해 방향 조작(슬라이딩/릴리스/탭핑)을 수행할 때, 특정한 전송된 타깃 프롬프트 정보를 결정하기 위해서 실시간 전투 상황 정보를 참조하여 로직 결정이 수행될 필요가 있다. 논리적 결정은 \"if-else\"의 많은 양의 논리적 분기를 수반하고, 전술된 실시예들에서 언급된 거동 트리들을 참조할 수 있다. 거동 트리의 코드 구현은, 오픈 소스 컴포넌트의 거동 트리 거동을 참조할 수 있다. 단계 44. 프롬프트 정보를 브로드캐스트한다. 이 예에서, 클라이언트는 프레임 동기화 신호를 서버에 전송하고, 프레임 동기화 신호는 타깃 프롬프트 정보를 운반한다. 서버는, 마스터 가상 캐릭터의 팀원 가상 캐릭터(마스터 가상 캐릭터 자체가 일부 실시예에 포함 됨)에 대응하는 다른 클라이언트들에 프레임 동기화 신호를 전송한다. 대안으로서, 서버는 전투에서 모든 가상 캐릭터의 다른 클라이언트들에게 프레임 동기화 신호를 전송한다. 다른 클라이언트는 프레임 동기화 신호에 따 라 타깃 프롬프트 정보를 디스플레이하거나 재생한다. 본 출원의 기술적 개선은, 성장성이 크고, 유연성 및 확장성을 가진 종래의 모바일 단말기를 돌파하는 모바일 게임 전투 통신 시스템의 혁신적인 설계 방향을 가져온다. 치열한 전투 상황을 수반하는 모든 모바일 단말기 게임은, 이 시스템의 효과에 대한 호소력이 상이하다. 추가로, \"간단한 상호작용 + 지능적 결정\" 방식은, 사용 자가 매우 간단한 인간-머신 상호작용 방식으로 매우 지능적인 팀원 통신 효과를 구현할 수 있게 한다. 본 출원의 장치 실시예들이 아래에서 설명되며, 여기서 장치 실시예들은 전술된 방법 실시예들에 대응한다. 장 치 실시예들에서 상세하게 설명되지 않은 부분에 대해서는, 전술된 방법 실시예들을 참조한다. 도 53은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 장치의 블록도이다. 장치는, 소프트웨어, 하드웨어 또는 이들의 조합을 이용하여 전체 단말기로서 또 는 단말기의 일부로서 구현될 수 있다. 이 장치는 하기의 모듈들을 포함한다: 멀티플레이어 온라인 전투 프로그램의 UI를 디스플레이하도록 구성된 디스플레이 모듈; UI 상에서 방향 조작을 수신하도록 구성된 상호작용 모듈 ― 방향 조작은 프롬프트 정보 전송 기능을 활 성화하고 UI 내의 타깃 디스플레이 요소를 가리키는 조작이며, 타깃 디스플레이 요소는 UI 내의 복수의 디스플 레이 요소 중 하나임 ―; 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하도록 구성된 예측 모듈; 및 마스터 가상 캐릭터의 팀원 가상 캐릭터들 또는 전투의 모든 가상 캐릭터의 클라이언트들에게 타깃 프롬프트 정 보를 전송하도록 구성된 전송 모듈. 한 임의적 실시예에서, UI는 상호작용 패널 영역을 포함하고, 상호작용 패널 영역은 신호 컨트롤을 포함하고; 방향 조작은 신호 컨트롤로부터 UI 내의 타깃 디스플레이 요소를 가리키는 조작이다. 한 임의적 실시예에서, 신호 컨트롤은 버튼 컨트롤을 포함한다; 방향 조작은 제1 터치 조작 및 제2 터치 조작을 포함한다; 상호작용 모듈은 UI 상의 버튼 컨트롤에 가해진 제1 터치 조작을 수신하도록 구성된다; 디스플레이 모듈은 UI 상에 하나 이상의 후보 디스플레이 요소를 디스플레이하도록 구성된다; 및 상호작용 모듈은 UI 상의 타깃 디스플레이 요소에 가해진 제2 터치 조작을 수신하도록 구성된다. 한 임의적 실시예에서, 디스플레이 모듈은 하이라이트 방식으로 UI 상에 하나 이상의 후보 디스플레이 요 소를 디스플레이하도록 구성되고, 하이라이트 방식은, 다음과 같은 디스플레이 방식들: 타깃 컬러 디스플레이 방식, 오버레이 마스킹 디스플레이 방식, 하이라이트 디스플레이 방식, 및 윤곽선 디스플레이 방식 중 적어도 하나를 포함한다. 한 임의적 실시예에서, 신호 컨트롤은 버튼 컨트롤을 포함한다; 방향 조작은 슬라이드 조작을 포함한다; 및 상호작용 모듈은 UI 상의 슬라이드 조작을 수신하도록 구성되고, 슬라이드 조작의 슬라이드 시작점은 버 튼 컨트롤이고 슬라이드 조작의 슬라이드 끝점은 타깃 디스플레이 요소이다. 한 임의적 실시예에서, 디스플레이 모듈은 또한, 버튼 컨트롤에서 슬라이드 조작이 수신될 때 UI 상의 슬 라이드 시작점으로부터 슬라이드 끝점을 가리키는 보조선 또는 이동 경로를 디스플레이하도록 구성된다. 한 임의적 실시예에서, 신호 컨트롤은 맵 확장 컨트롤을 포함한다; 방향 조작은 제3 터치 조작 및 제4 터치 조 작을 포함한다; 상호작용 모듈은 UI 상의 맵 확장 컨트롤에 가해진 제3 터치 조작을 수신하도록 구성된다; 디스플레이 모듈은 제3 터치 조작에 따라 가상 환경의 맵 보기 컨트롤을 UI에 디스플레이하도록 구성된다; 및 상호작용 모듈은 맵 보기 컨트롤 상의 타깃 디스플레이 요소에 가해진 제4 터치 조작을 수신하도록 구성 된다. 한 임의적 실시예에서, UI는 가상 환경 이미지 및 상호작용 패널 영역을 포함하고, 가상 환경 이미지는 마스터 가상 캐릭터에 대응하는 관점에서 관찰된 가상 환경의 이미지이고, 가상 환경은 적어도 2명의 가상 캐릭터가 전 투하도록 구성된 전투 환경이다. 디스플레이 요소들은 다음과 같은 요소들 중 적어도 하나를 포함한다: 가상 환경에서 전투 기능 요소들을 형성하는 3차원 모델들 또는 2차원 요소들; 상호작용 패널 영역의 정보 디스플레이 요소들; 및 상호작용 패널 영역의 제어 기능 요소들. 한 임의적 실시예에서, 디스플레이 요소들은 다음과 같은 요소들 중 적어도 하나를 더 포함한다: 가상 환경에서 장식에 이용되는 3차원 모델들 또는 2차원 요소들; 가상 환경에서 실제 세계와 연관된 요소들; 가상 환경에서 사용자 계정들과 연관된 요소들; 및 가상 환경에서 사용자 계정들이 속하는 팀들과 연관된 요소들. 한 임의적 실시예에서, 디스플레이 요소들은 다음과 같은 요소들 중 적어도 하나를 더 포함한다: 다른 사용자 계정들에 의해 전송된 프롬프트 정보. 한 임의적 실시예에서, 예측 모듈은, 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보에 대한 거동 트리를 질의하도록 구성된다. 거동 트리는, 디스플레이 요소들, 전투 정보, 및 프롬프트 정보 사이의 대응관계를 포함한다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 스킬 클래스 디스플레이 요소들을 포함한다; 전투 정보는 스킬 가용성 상태를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하 는 스킬 가용성 상태가 이용불가능할 경우, 스킬이 이용불가능함을 나타내는데 이용되는 제1 타깃 프롬프트 정 보를 결정하고; 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하는 스킬 가용성 상태 가 이용가능할 때, 스킬이 이용가능함을 나타내는데 이용되는 제2 타깃 프롬프트 정보가 결정하도록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 스킬 클래스 디스플레이 요소들을 포함한다; 전투 정보는 스킬 CD 시간 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하 는 스킬 CD 시간이 유효한 경우, 스킬 CD 시간을 나타내는 이용되는 제3 타깃 프롬프트 정보를 결정하도록 구성 된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 자원 클래스 디스플레이 요소들을 포함한다; 전투 정보는 자원 클래스 디스플레이 요소의 시야 정보를 포함한다; 예측 모듈은, 타깃 디스플레이 요소가 자원 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하 는 시야 정보가 적의 시야를 갖는 경우, 적이 자원을 획득하고 있다는 것을 나타내는데 이용되는 제4 타깃 프롬 프트 정보를 결정하도록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 자원 클래스 디스플레이 요소들을 포함한다; 전투 정보는 자원 클래스 디스플레이 요소의 리프레시 정보를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 자원 클래스 디스플레이 요소이고 리프레시 정보가 유효한 경우, 자원 클래스 디스플레이 요소의 남은 리프레시 시간을 나타내는데 이용되는 제5 타깃 프롬프트 정보를 결정하도 록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소가 가상 캐릭터 클래스 디스플레이 요소들을 포함한다; 전투 정보 는 가상 캐릭터 클래스 디스플레이 요소의 상태를 포함한다; 예측 모듈은, 타깃 디스플레이 요소가 가상 캐릭터 클래스 디스플레이 요소이고 타깃 디스플레이 요소의 상태가 제1 지정된 상태일 때, 가상 캐릭터 클래스 디스플레이 요소가 제1 지정된 상태에 있다는 것을 나타내는 데 이용되는 제6 타깃 프롬프트 정보를 결정하도록 구성된다. 이 상태는, 혈액량 상태, 마법 상태, 철수 상태, 이동 상태, 공격 상태, 공격받은 상태, 장비 상태, 레벨 상태, 및 외부 착용 상태 중 적어도 하나를 포함한다. 한 임의적 실시예에서, 타깃 디스플레이 요소가 건설 클래스 디스플레이 요소들을 포함한다; 전투 정보는 건설 클래스 디스플레이 요소의 상태를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 건설 클래스 디스플레이 요소이고 타깃 디스플레이 요소의 상태가 제2 지정된 상태일 때, 건설 클래스 디스플레이 요소가 제2 지정된 상태에 있다는 것을 나타내는데 이용되는 제 7 타깃 프롬프트 정보를 결정하도록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 네트워크 정보 디스플레이 요소를 포함한다; 전투 정보는 네트 워크 속도 정보를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 네트워크 정보 디스플레이 요소이고 네트워크 속도 정보의 네트워 크 속도가 제1 임계값 미만인 경우, 네트워크 속도 상태를 나타내는데 이용되는 제8 타깃 프롬프트 정보가 결정 하도록 구성된다. 임의적 실시예에서, 타깃 디스플레이 요소는 하드웨어 성능 디스플레이 요소를 포함한다; 전투 정보는 하드웨어 작동 성능 파라미터를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 하드웨어 성능 디스플레이 요소이고 하드웨어 작동 성능 파라미터 가 제2 임계값 미만인 경우, 네트워크 속도 상태를 나타내는데 이용되는 제9 타깃 프롬프트 정보를 결정하도록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 프롬프트 정보 디스플레이 요소를 포함한다; 전투 정보는 프롬 프트 정보 디스플레이 요소에 메시지 내용을 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 프롬프트 정보 디스플레이 요소일 때, 메시지 내용에 자동으로 응 답하는데 이용되는 제10 타깃 프롬프트 정보를 결정하도록 구성된다. 한 임의적 실시예에서, UI는 이동 컨트롤을 더 포함하고, 이동 컨트롤은 가상 환경에서 이동하도록 마스터 가상 캐릭터를 제어하도록 구성된 컨트롤이며, 이동 컨트롤과 신호 컨트롤은 UI 상에서 서로 멀리 떨어진 2개의 주변 영역에 위치해 있다. 도 54는 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플 레이하기 위한 장치의 블록도이다. 장치는, 소프트웨어, 하드웨어 또는 이들의 조합을 이용하여 전체 단말기로 서 또는 단말기의 일부로서 구현될 수 있다. 장치는 도 53에 도시된 장치와 결합되어 동일한 장치가 될 수 있 다. 이 장치는 하기의 모듈들을 포함한다: 멀티플레이어 온라인 전투 프로그램의 UI를 디스플레이하도록 구성된 디스플레이 모듈 ― UI는 가상 환경 이미지 및 상호작용 패널 영역을 포함함 ―; UI 상에서 방향 조작을 수신하도록 구성된 상호작용 모듈 ― 방향 조작은 프롬프트 정보 전송 기능을 활 성화하고 UI 내의 타깃 디스플레이 요소를 가리키는 조작이며, 타깃 디스플레이 요소는 UI 내의 복수의 디스플 레이 요소 중 하나임 ―; 및 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보를 예측하도록 구성된 예측 모듈; 디스플레이 모듈은 UI 상에 타깃 프롬프트 정보를 디스플레이하도록 구성된다. 한 임의적 실시예에서, UI는 상호작용 패널 영역을 포함하고, 상호작용 패널 영역은 신호 컨트롤을 포함하고; 방향 조작은 신호 컨트롤로부터 UI 내의 타깃 디스플레이 요소를 가리키는 조작이다. 한 임의적 실시예에서, 신호 컨트롤은 버튼 컨트롤을 포함한다; 방향 조작은 제1 터치 조작 및 제2 터치 조작을 포함한다; 상호작용 모듈은 UI 상의 버튼 컨트롤에 가해진 제1 터치 조작을 수신하도록 구성된다; 디스플레이 모듈은 UI 상에 하나 이상의 후보 디스플레이 요소를 디스플레이하도록 구성된다; 및 상호작용 모듈은 UI 상의 후보 디스플레이 요소들 중의 타깃 디스플레이 요소에 가해진 제2 터치 조작을 수신하도록 구성된다. 한 임의적 실시예에서, 디스플레이 모듈은 하이라이트 방식으로 UI 상에 하나 이상의 후보 디스플레이 요 소를 디스플레이하도록 구성되고, 하이라이트 방식은, 다음과 같은 디스플레이 방식들: 타깃 컬러 디스플레이 방식, 오버레이 마스킹 디스플레이 방식, 하이라이트 디스플레이 방식, 및 윤곽선 디스플레이 방식 중 적어도 하나를 포함한다. 한 임의적 실시예에서, 신호 컨트롤은 버튼 컨트롤을 포함한다; 방향 조작은 슬라이드 조작을 포함한다; 및 상호작용 모듈은 UI 상의 슬라이드 조작을 수신하도록 구성되고, 슬라이드 조작의 슬라이드 시작점은 버 튼 컨트롤이고 슬라이드 조작의 슬라이드 끝점은 타깃 디스플레이 요소이다. 한 임의적 실시예에서, 디스플레이 모듈은 또한, 버튼 컨트롤에서 슬라이드 조작이 수신될 때 UI 상의 슬 라이드 시작점으로부터 슬라이드 끝점을 가리키는 보조선 또는 이동 경로를 디스플레이하도록 구성된다. 한 임의적 실시예에서, 신호 컨트롤은 맵 확장 컨트롤을 포함한다; 방향 조작은 제3 터치 조작 및 제4 터치 조 작을 포함한다; 상호작용 모듈은 UI 상의 맵 확장 컨트롤에 가해진 제3 터치 조작을 수신하도록 구성된다; 디스플레이 모듈은 제3 터치 조작에 따라 가상 환경의 맵 보기 컨트롤을 UI에 디스플레이하도록 구성된다; 및 상호작용 모듈은 맵 보기 컨트롤 상의 타깃 디스플레이 요소에 가해진 제4 터치 조작을 수신하도록 구성 된다. 한 임의적 실시예에서, UI는 가상 환경 이미지 및 상호작용 패널 영역을 포함하고, 가상 환경 이미지는 마스터 가상 캐릭터에 대응하는 관점에서 관찰된 가상 환경의 이미지이고, 가상 환경은 적어도 2명의 가상 캐릭터가 전 투하도록 구성된 전투 환경이다. 디스플레이 요소들은 다음과 같은 요소들 중 적어도 하나를 포함한다: 가상 환경에서 전투 기능 요소들을 형성하는 3차원 모델들 또는 2차원 요소들; 상호작용 패널 영역의 정보 디스플레이 요소들; 및 상호작용 패널 영역의 제어 기능 요소들. 한 임의적 실시예에서, 디스플레이 요소들은 다음과 같은 요소들 중 적어도 하나를 더 포함한다: 가상 환경에서 장식에 이용되는 3차원 모델들 또는 2차원 요소들; 가상 환경에서 실제 세계와 연관된 요소들; 가상 환경에서 사용자 계정들과 연관된 요소들; 및 가상 환경에서 사용자 계정들이 속하는 팀들과 연관된 요소들. 한 임의적 실시예에서, 디스플레이 요소들은 다음과 같은 요소들 중 적어도 하나를 더 포함한다: 다른 사용자 계정들에 의해 전송된 프롬프트 정보. 한 임의적 실시예에서, 예측 모듈은, 타깃 디스플레이 요소 및 전투 정보에 따라 타깃 프롬프트 정보에 대한 거동 트리를 질의하도록 구성된다. 거동 트리는, 디스플레이 요소들, 전투 정보, 및 프롬프트 정보 사이의 대응관계를 포함한다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 스킬 클래스 디스플레이 요소들을 포함한다; 전투 정보는 스킬 가용성 상태를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하 는 스킬 가용성 상태가 이용불가능할 경우, 스킬이 이용불가능함을 나타내는데 이용되는 제1 타깃 프롬프트 정 보를 결정하고; 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하는 스킬 가용성 상태 가 이용가능할 때, 스킬이 이용가능함을 나타내는데 이용되는 제2 타깃 프롬프트 정보가 결정하도록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 스킬 클래스 디스플레이 요소들을 포함한다; 전투 정보는 스킬 CD 시간 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 스킬 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하 는 스킬 CD 시간이 유효한 경우, 스킬 CD 시간을 나타내는 이용되는 제3 타깃 프롬프트 정보를 결정하도록 구성 된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 자원 클래스 디스플레이 요소들을 포함한다; 전투 정보는 자원 클래스 디스플레이 요소의 시야 정보를 포함한다; 예측 모듈은, 타깃 디스플레이 요소가 자원 클래스 디스플레이 요소이고 타깃 디스플레이 요소에 대응하 는 시야 정보가 적의 시야를 갖는 경우, 적이 자원을 획득하고 있다는 것을 나타내는데 이용되는 제4 타깃 프롬 프트 정보를 결정하도록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 자원 클래스 디스플레이 요소들을 포함한다; 전투 정보는 자원 클래스 디스플레이 요소의 리프레시 정보를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 자원 클래스 디스플레이 요소이고 리프레시 정보가 유효한 경우, 자원 클래스 디스플레이 요소의 남은 리프레시 시간을 나타내는데 이용되는 제5 타깃 프롬프트 정보를 결정하도 록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소가 가상 캐릭터 클래스 디스플레이 요소들을 포함한다; 전투 정보 는 가상 캐릭터 클래스 디스플레이 요소의 상태를 포함한다; 예측 모듈은, 타깃 디스플레이 요소가 가상 캐릭터 클래스 디스플레이 요소이고 타깃 디스플레이 요소의 상태가 제1 지정된 상태일 때, 가상 캐릭터 클래스 디스플레이 요소가 제1 지정된 상태에 있다는 것을 나타내는 데 이용되는 제6 타깃 프롬프트 정보를 결정하도록 구성된다. 이 상태는, 혈액량 상태, 마법 상태, 철수 상태, 이동 상태, 공격 상태, 공격받은 상태, 장비 상태, 레벨 상태, 및 외부 착용 상태 중 적어도 하나를 포함한다. 한 임의적 실시예에서, 타깃 디스플레이 요소가 건설 클래스 디스플레이 요소들을 포함한다; 전투 정보는 건설 클래스 디스플레이 요소의 상태를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 건설 클래스 디스플레이 요소이고 타깃 디스플레이 요소의 상태가 제2 지정된 상태일 때, 건설 클래스 디스플레이 요소가 제2 지정된 상태에 있다는 것을 나타내는데 이용되는 제 7 타깃 프롬프트 정보를 결정하도록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 네트워크 정보 디스플레이 요소를 포함한다; 전투 정보는 네트 워크 속도 정보를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 네트워크 정보 디스플레이 요소이고 네트워크 속도 정보의 네트워 크 속도가 제1 임계값 미만인 경우, 네트워크 속도 상태를 나타내는데 이용되는 제8 타깃 프롬프트 정보가 결정 하도록 구성된다. 임의적 실시예에서, 타깃 디스플레이 요소는 하드웨어 성능 디스플레이 요소를 포함한다; 전투 정보는 하드웨어 작동 성능 파라미터를 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 하드웨어 성능 디스플레이 요소이고 하드웨어 작동 성능 파라미터 가 제2 임계값 미만인 경우, 네트워크 속도 상태를 나타내는데 이용되는 제9 타깃 프롬프트 정보를 결정하도록 구성된다. 한 임의적 실시예에서, 타깃 디스플레이 요소는 프롬프트 정보 디스플레이 요소를 포함한다; 전투 정보는 프롬 프트 정보 디스플레이 요소에 메시지 내용을 포함한다; 및 예측 모듈은, 타깃 디스플레이 요소가 프롬프트 정보 디스플레이 요소일 때, 메시지 내용에 자동으로 응 답하는데 이용되는 제10 타깃 프롬프트 정보를 결정하도록 구성된다. 한 임의적 실시예에서, UI는 이동 컨트롤을 더 포함하고, 이동 컨트롤은 가상 환경에서 이동하도록 마스터 가상 캐릭터를 제어하도록 구성된 컨트롤이며, 이동 컨트롤과 신호 컨트롤은 UI 상에서 서로 멀리 떨어진 2개의 주변 영역에 위치해 있다. 본 출원은 또한, 프로세서 및 메모리를 포함하는 단말기를 제공하고, 메모리는 적어도 하나의 명령어를 저장하 며, 적어도 하나의 명령어는, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 및 /또는, 전술된 방법 실시예들에서 제공된 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이 하기 위한 방법을 구현하기 위해 프로세서에 의해 실행된다. 단말기는 아래의 도 55에서 제공된 단말기일 수 있다. 도 55는 본 출원의 한 예시적인 실시예에 따른 단말기의 구조적 블록도를 도시한다. 단말기는, 스 마트폰, 태블릿 컴퓨터, MP3 플레이어, MP4 플레이어, 노트북 컴퓨터, 또는 데스크탑 컴퓨터일 수 있다. 단말 기는, 사용자 장비, 휴대형 단말기, 랩탑 단말기, 또는 데스크탑 단말기 등의 다른 명칭으로도 지칭될 수 있다. 일반적으로, 단말기는 프로세서 및 메모리를 포함한다. 프로세서는, 하나 이상의 처리 코어, 예를 들어, 4-코어 프로세서 또는 8-코어 프로세서를 포함할 수 있 다. 프로세서는, DSP(digital signal processor), FPGA(field-programmable gate array), PLA(programmable logic array) 중 적어도 하나의 하드웨어 형태로 구현될 수 있다. 프로세서는 또한, 메인 프로세서 및 코프로세서를 포함할 수 있다. 메인 프로세서는 어웨이크 상태에서 데이터를 처리하도록 구 성된 프로세서이고, 중앙 처리 유닛(CPU)이라고도 한다. 코프로세서는, 스탠바이 상태에서 데이터를 처리하도 록 구성된 저전력 소비 프로세서이다. 일부 실시예에서, 프로세서는 그래픽 처리 유닛(GPU)과 통합될 수 있다. GPU는, 디스플레이 스크린에 디스플레이될 것을 필요로 하는 콘텐츠를 렌더링하고 그리도록 구성된다. 일부 실시예에서, 프로세서는 인공 지능(AI) 프로세서를 더 포함할 수 있다. AI 프로세서는 머신 학습에 관련된 컴퓨팅 동작들을 처리하도록 구성된다. 메모리는 하나 이상의 컴퓨터 판독가능한 저장 매체를 포함할 수 있다. 컴퓨터 판독가능한 저장 매체는 비일시적인(non-transient)일 수 있다. 메모리는, 고속 랜덤 액세스 메모리 및 비휘발성 메모리, 예를들어, 하나 이상의 디스크 저장 디바이스 또는 플래시 저장 디바이스를 더 포함할 수 있다. 일부 실시예에서, 메모리의 비일시적인 컴퓨터 판독가능한 저장 매체는 적어도 하나의 명령어를 저장하도록 구성되고, 적어 도 하나의 명령어는, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 및/또는, 본 출원의 방법 실시예들에서 제공되는 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하 기 위한 방법을 구현하기 위해 프로세서에 의해 실행되도록 구성된다. 일부 실시예에서, 단말기는 일부 실시예에서는 주변기기 인터페이스 및 적어도 하나의 주변기기를 포함할 수 있다. 프로세서, 메모리 및 주변기기 인터페이스는 버스 또는 신호 케이블을 이 용함으로써 접속될 수 있다. 각각의 주변기기는, 버스, 신호 케이블, 또는 회로 기판을 이용함으로써 주변기기 인터페이스에 접속될 수 있다. 구체적으로, 주변기기 디바이스는, 무선 주파수(RF) 회로, 터치 디 스플레이 스크린, 카메라, 오디오 회로, 위치결정 컴포넌트, 및 전원 중 적어도 하나를 포함한다. 주변기기 인터페이스는 입력/출력(I/O)과 관련된 적어도 하나의 주변기기를 프로세서 및 메모리 에 접속하도록 구성될 수 있다. 일부 실시예에서, 프로세서, 메모리, 및 주변기기 디바이스 인터페이스는 동일한 칩 또는 회로 기판 상에 통합된다. 일부 다른 실시예에서, 프로세서, 메모리 및 주변기기 디바이스 인터페이스 중 임의의 하나 또는 2개는 단일 칩 또는 회로 기판 상에 구현 될 수 있다. 이것은 이 실시예에서 제한되지 않는다. RF 회로는, 전자기 신호라고도 하는 RF 신호를 수신 및 전송하도록 구성된다. RF 회로는 전자기 신호를 통해 통신 네트워크 및 기타의 통신 디바이스와 통신한다. RF 회로는 전기 신호를 전송을 위해 전자기 신호로 변환하거나, 수신된 전자기 신호를 전기 신호로 변환한다. 일부 실시예에서, RF 회로는, 안테나 시스템, RF 트랜시버, 하나 이상의 증폭기, 튜너, 발진기, 디지털 신호 프로세서, 코덱 칩셋, 가입자 식 별 모듈 카드 등을 포함한다. RF 회로는 적어도 하나의 무선 통신 프로토콜을 이용함으로써 또 다른 단 말기와 통신할 수 있다. 무선 통신 프로토콜은, 월드 와이드 웹, 대도시 영역 네트워크, 인트라넷, 이동 통신 네트워크 세대들(2G, 3G, 4G 및 5G), 무선 근거리 통신망, 및/또는 Wi-Fi 네트워크를 포함하지만, 이것으로 제 한되는 것은 아니다. 일부 실시예에서, RF는 NFC와 관련된 회로를 더 포함할 수 있고, 이것은 본 출원에 서 제한되지 않는다. 디스플레이 스크린은 사용자 인터페이스(UI)를 디스플레이하도록 구성된다. UI는, 그래프, 텍스트, 아이 콘, 비디오, 및 이들의 임의의 조합을 포함할 수 있다. 디스플레이 스크린이 터치 디스플레이 스크린일 때, 디스플레이 스크린은 또한, 디스플레이 스크린의 표면 상에서 또는 표면 위에서 터치 신호를 취득할 수 있다. 터치 신호는 처리를 위한 제어 신호로서 프로세서에 입력될 수 있다. 이 경우, 디스플 레이 스크린은 또한, 소프트 버튼 및/또는 소프트 키보드라고도 하는 가상 버튼 및/또는 가상 키보드를 제공하도록 구성될 수 있다. 일부 실시예에서, 단말기의 전면 패널 상에는 하나의 디스플레이 스크린 이 배치될 수 있다. 일부 다른 실시예에서, 단말기의 상이한 표면들 상에, 접을 수 있는 설계로 또는 각각, 적어도 2개의 디스플레이 스크린이 배치될 수 있다. 여전히 다른 실시예에서, 디스플레이 스 크린은 단말기의 만곡형 표면 또는 접힌 표면 상에 플렉서블 디스플레이 스크린이 배치될 수 있다. 심지어, 디스플레이 스크린은, 비-직사각형의 불규칙한 패턴으로, 즉, 특별한 형상의 스크린으로 설정될 수 있다. 디스플레이 스크린은, LCD(liquid crystal display) 또는 OLED(organic light-emitting diode) 등의 재료를 이용하여 준비될 수 있다. 카메라 컴포넌트는 이미지들 또는 비디오들을 취득하도록 구성된다. 일부 실시예에서, 카메라 컴포넌트 는 전방 카메라 및 후방 카메라를 포함한다. 일반적으로, 전방 카메라는 단말기의 전면 패널에 배치되고 후방 카메라는 단말기 배면에 배치된다. 일부 실시예에서, 적어도 2개의 후방 카메라가 있고, 이들은 각각, 메 인 카메라와 피사계 심도 카메라의 융합을 통한 배경 흐림, 메인 카메라와 광각 카메라의 융합을 통한 파노라마 촬영 및 가상 현실(VR) 촬영, 또는 기타의 융합 촬영 기능을 달성하기 위해, 메인 카메라, 피사계 심도 카메라, 광각 카메라, 및 텔레포트 카메라 중 임의의 것이다. 일부 실시예에서, 카메라 컴포넌트는 플래시를 더 포함할 수 있다. 플래시는, 단색 온도 플래시이거나, 이중 컬러 온도 플래시일 수 있다. 이중 컬러 온도 플래 시란, 따뜻한 광의 플래시와 차가운 광의 플래시의 조합을 말하며, 상이한 컬러 온도들 하에서 광 보상을 위해 이용할 수 있다. 오디오 회로는 마이크로폰 및 스피커를 포함할 수 있다. 마이크로폰은, 사용자 및 환경의 음파를 취득하 고, 음파를 전기 신호로 변환하여 처리를 위해 프로세서에 입력하거나, 음성 통신을 구현하기 위해 무선주파수 회로에 입력하도록 구성된다. 스테레오 사운드 취득 또는 노이즈 감소를 위해, 단말기의 상이한 부분들에는 복수의 마이크로폰이 각각 배치될 수 있다. 마이크로폰은 또한, 어레이 마이크로폰 또는 전 방향 취득형 마이크로폰(omni-directional acquisition type microphone)일 수 있다. 스피커는, 프로세서 또는 RF 회로로부터의 전기 신호를 음파로 변환하도록 구성된다. 스피커는 종래의 필름 스피커이 거나, 압전 세라믹 스피커일 수 있다. 스피커가 압전 세라믹 스피커인 경우, 스피커는 전기 신호를 사람이 들 을 수 있는 음파로 변환할 수 있을뿐만 아니라, 거리 측정 및 기타의 목적을 위해 전기 신호를 사람이 들을 수 없는 음파로 변환할 수 있다. 일부 실시예에서, 오디오 회로는 또한, 이어폰 잭을 포함할 수 있다. 위치결정 컴포넌트는, 네비게이션 또는 위치-기반의 서비스(LBS; location-based service)를 구현하기 위 해 단말기의 현재의 지리적 위치를 결정하도록 구성된다. 위치결정 컴포넌트는, 미국의 GPS(global positioning system), 중국의 BeiDou 시스템, 및 러시아의 GALILEO 시스템에 기초한 위치결정 컴포 넌트일 수 있다. 전원은, 단말기 내의 컴포넌트들에 전력을 공급하도록 구성된다. 전원은, 교류 전원, 직류 전원, 1회용 배터리, 또는 재충전가능한 배터리일 수 있다. 전원이 재충전가능한 배터리를 포함할 때, 재충전가능한 배터리는 유선 재충전가능한 배터리 또는 무선 재충전가능한 배터리일 수 있다. 유선 재충전가능 한 배터리는 유선 회로를 통해 충전되는 배터리이고, 무선 재충전가능한 배터리는 무선 코일을 통해 충전되는 배터리이다. 재충전가능한 배터리는 또한, 급속 충전 기술을 지원하도록 구성될 수 있다. 일부 실시예에서, 단말기는 하나 이상의 센서를 더 포함할 수 있다. 하나 이상의 센서는, 가속도 센서, 자이로스코프 센서, 압력 센서, 지문 센서, 광학 센서, 및 근접 센서를 포함하지만, 이것으로 제한되는 것은 아니다. 가속도 센서는 단말기에 의해 설정된 좌표계의 3개의 좌표축에 관한 가속도의 크기를 검출할 수 있 다. 예를 들어, 가속도 센서는 3개의 좌표축 상의 중력 가속도의 성분들을 검출하도록 구성될 수 있다. 프로세서는, 가속도 센서에 의해 취득된 중력 가속도 신호에 따라, 터치 디스플레이 스크린 을 제어하여 UI를 프레임 뷰 또는 초상화 뷰로 디스플레이할 수 있다. 가속도 센서는 또한, 게임 또는 사용자의 움직임 데이터를 취득하도록 구성될 수 있다. 자이로스코프 센서는 단말기의 몸통 방향 및 회전 각도를 검출할 수 있다. 자이로스코프 센서 는 가속도 센서와 협력하여 단말기 상의 사용자에 의한 3D 동작을 취득할 수 있다. 프로세 서는, 자이로스코프 센서에 의해 취득된 데이터에 따라 다음과 같은 기능들을 구현할 수 있다: 움 직임 감지(예를 들어, 사용자의 틸트 조작에 따라 UI가 변경됨), 촬영 동안의 이미지 안정화, 게임 제어, 및 관 성 내비게이션. 압력 센서는 단말기의 측면 프레임 및/또는 터치 디스플레이 스크린의 하위 층에 배치될 수 있다. 압력 센서가 단말기의 측면 프레임에 배치되면, 단말기에 관한 사용자의 홀딩 신호가 검출될 수 있다. 프로세서는 압력 센서에 의해 취득된 홀딩 신호에 따라 왼손 및 오른손 인식 또 는 빠른 조작을 수행한다. 압력 센서가 터치 디스플레이 스크린의 하위 층에 배치되면, 프로세서 는, 터치 디스플레이 스크린 상의 사용자의 압력 동작에 따라, UI 상의 조작가능한 컨트롤을 제어 한다. 조작가능한 컨트롤은, 버튼 컨트롤, 스크롤바 컨트롤, 아이콘 컨트롤, 및 메뉴 컨트롤 중 적어도 하나를 포함한다. 지문 센서는, 사용자의 지문을 취득하도록 구성되고, 프로세서는 지문 센서에 의해 취득된 지문에 따라 사용자의 신원을 식별하거나, 지문 센서는 취득된 지문에 따라 사용자의 신원을 식별한다. 사용자의 신원이 신뢰받는 신원이라고 식별되면, 프로세서는 사용자가 관련된 민감한 조작들을 수행하는 것을 인가한다. 민감한 조작들은: 스크린 잠금해제, 암호화된 정보 보기, 소프트웨어 다운로딩, 결제, 설정 변 경 등을 포함한다. 지문 센서는, 단말기의 전면, 배면 또는 측면 상에 배치될 수 있다. 단말기 상에 물리적 버튼 또는 벤더 로고가 배치된 경우, 지문은 물리적 버튼 또는 벤더 로고와 통합될 수 있다. 광학 센서는 주변 광 강도를 취득하도록 구성된다. 한 실시예에서, 프로세서는 광학 센서에 의해 취득된 주변 광 강도에 따라 터치 디스플레이 스크린의 디스플레이 밝기를 제어할 수 있다. 구체적 으로, 주변 광 강도가 비교적 높으면, 터치 디스플레이 스크린의 디스플레이 밝기가 증가된다. 주변 광 강도가 비교적 낮으면, 터치 디스플레이 스크린의 디스플레이 밝기는 감소된다. 또 다른 실시예에서, 프로세서는 또한, 광학 센서에 의해 취득된 주변 광 강도에 따라 카메라 컴포넌트의 카메라 파 라미터를 동적으로 조정할 수 있다. 거리 센서라고도 하는 근접 센서는, 대개 단말기의 전면 패널 상에 배치된다. 근접 센서는 사용자와 단말기의 전면 사이의 거리를 취득하도록 구성된다. 한 실시예에서, 근접 센서가 사용자 와 단말기의 전면 사이의 거리가 점점 작아지는 것을 검출하면, 터치 디스플레이 스크린은, 스크린 온 상태로부터 스크린 오프 상태로 전환하도록 프로세서에 의해 제어된다. 근접 센서가 사용자와 단말기의 전면 사이의 거리가 점점 증가하는 것을 검출하면, 터치 디스플레이 스크린은 스크린 오 프 상태로부터 스크린 온 상태로 전환하도록 프로세서에 의해 제어된다."}
{"patent_id": "10-2021-7025848", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "본 기술분야의 통상의 기술자라면, 도 55에 도시된 구조가 단말기에 대한 제한을 구성하지 않으며, 단말 기는 도면에 도시된 것들보다 많거나 적은 컴포넌트를 포함하거나, 일부 컴포넌트들이 결합되거나, 상이한 컴포 넌트 배열이 이용될 수 있다는 것을 이해할 수 있을 것이다. 메모리는 하나 이상의 프로그램을 더 포함한다. 하나 이상의 프로그램은 메모리에 저장된다. 하나 이상의 프 로그램은, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 및/또는 본 출원의 실 시예들에서 제공되는 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법을 수 행하기 위한 프로그램을 포함한다. 본 출원은 적어도 하나의 명령어를 저장한 컴퓨터 판독가능한 저장 매체를 제공하고, 적어도 하나의 명령어는, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 및/또는, 전술된 방법 실시예들 에서 제공된 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법을 구현하기 위 해 프로세서에 의해 실행된다. 본 출원은 또한, 컴퓨터 프로그램 제품을 제공하고, 컴퓨터 프로그램 제품은, 컴퓨터에서 실행될 때, 컴퓨터로 하여금, 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법, 및/또는 전술된 방법 실 시예들에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법을 수행하게 한다. 본 출원의 전술된 실시예들의 순서 번호들은 단지 설명의 목적을 위한 것일 뿐이며, 실시예들의 선호도를 암시 하는 것은 아니다."}
{"patent_id": "10-2021-7025848", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "본 기술분야의 통상의 기술자라면, 전술된 실시예들의 단계들의 전부 또는 일부는 하드웨어에 의해 구현되거나, 관련 하드웨어에게 지시하는 프로그램에 의해 구현될 수 있다는 것을 이해할 수 있을 것이다. 이 프로그램은 컴퓨터 판독가능한 저장 매체에 저장될 수 있다. 저장 매체는, 판독 전용 메모리, 자기 디스크, 광학 디스크 등일 수 있다. 전술된 설명은 단지 본 출원의 임의적인 실시예들일뿐이며, 본 출원을 제한하려는 의도는 아니다. 본 출원의 사상 및 원리 내에서 이루어진 임의의 수정, 균등한 대체, 또는 개선사항은, 본 출원의 보호 범위 내에 든다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22 도면23 도면24 도면25 도면26 도면27 도면28 도면29 도면30 도면31 도면32 도면33 도면34 도면35 도면36 도면37 도면38 도면39 도면40 도면41 도면42 도면43 도면44 도면45 도면46 도면47 도면48 도면49 도면50 도면51 도면52 도면53 도면54 도면55"}
{"patent_id": "10-2021-7025848", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 출원의 실시예의 기술적 솔루션들을 더욱 명확하게 설명하기 위해, 이하에서는 실시예들을 설명하는데 요구 되는 첨부된 도면들을 간략하게 소개한다. 명백히, 이하의 설명에서의 첨부된 도면들은 본 출원의 일부 실시예"}
{"patent_id": "10-2021-7025848", "section": "도면", "subsection": "도면설명", "item": 2, "content": "만을 도시할 뿐이며, 본 기술분야의 통상의 기술자라면 창조적 노력없이 이들 첨부된 도면들로부터 다른 도면들 을 여전히 유도해 낼 수 있을 것이다. 도 1은 본 출원의 한 예시적인 실시예에 따른 컴퓨터 시스템의 구조적 블록도이다. 도 2는 본 출원의 또 다른 예시적인 실시예에 따른 MOBA 게임의 맵의 개략도이다. 도 3은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법의 플로차트이다. 도 4는 도 3의 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법의 개략적인 구현의 개략적인 인터페이스도이다. 도 5는 본 출원의 한 예시적인 실시예에 따른 헤드 업 디스플레이(HUD) 영역의 개략적인 인터페이스도이다. 도 6은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 도 7은 도 6의 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법의 개략적인 구현의 개략적인 인터페이스도이다. 도 8은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 도 9는 도 8의 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법의 개략적인 구현의 개략적인 인터페이스도이다. 도 10은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 도 11은 도 10의 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법의 개략적인 구현의 개략적인 인터페이스도이다. 도 12는 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 플로차트이다. 도 13은 도 12의 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방법의 개략적인 구현의 개략적인 인터페이스도이다. 도 14는 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 방법의 개략적인 구현의 개략적인 인터페이스도이다. 도 15는 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 16은 도 15에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 17은 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 18은 도 17에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 19는 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 20은 도 18에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 21은 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 22는 도 21에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 23은 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 24는 도 23에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 25는 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 26은 도 25에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 27은 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 28은 도 27에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 29는 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 30은 도 29에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 31은 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다.도 32는 도 31에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 33은 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 34는 도 33에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 35는 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 36은 도 35에 도시된 예시적인 실시예에 따른 거동 트리를 구현하는 개략적인 인터페이스도이다. 도 37은 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 38은 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 39는 본 출원의 또 다른 예시적인 실시예에 따른 거동 트리의 플로차트이다. 도 40은 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법의 개략적인 구현의 개략적인 인터페이스도이다. 도 41은 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법의 개략적인 구현의 개략적인 인터페이스도이다. 도 42는 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법의 개략적인 구현의 개략적인 인터페이스도이다. 도 43은 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법의 개략적인 구현의 개략적인 인터페이스도이다. 도 44는 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법의 개략적인 구현의 개략적인 인터페이스도이다. 도 45는 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법을 이용함으로써 방향 조작을 설정하는 개략적인 인터페이스도이다. 도 46은 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법을 이용함으로써 방향 조작을 설정하는 개략적인 인터페이스도이다. 도 47은 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법을 이용함으로써 방향 조작을 설정하는 개략적인 인터페이스도이다. 도 48은 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플레이하기 위한 방법의 방법 플로차트이다. 도 49는 본 출원의 한 예시적인 실시예에 따른 단말기의 블록도이다. 도 50은 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하기 위한 방 법의 방법 플로차트이다. 도 51은 한 예시적인 실시예에 따른 코드 클래스들의 관계도이다. 도 52는 또 다른 예시적인 실시예에 따른 코드 클래스들의 관계도이다. 도 53은 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 전송하 기 위한 장치의 블록도이다. 도 54는 본 출원의 한 예시적인 실시예에 따른 멀티플레이어 온라인 전투 프로그램에서 프롬프트 정보를 디스플 레이하기 위한 장치의 블록도이다. 도 55는 본 출원의 한 예시적인 실시예에 따른 단말기의 블록도이다."}
