{"patent_id": "10-2023-0101480", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0020063", "출원번호": "10-2023-0101480", "발명의 명칭": "트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치", "출원인": "이지영", "발명자": "이지영"}}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "트렌델렌버그 자세 수술용 헤드 쿠션;상기 헤드 쿠션 일측에 위치하며, 사용자의 생체신호를 측정하는 생체신호 측정부;상기 측정부의 생체신호 데이터에서 뇌파 정보, 산소포화도 정보, 또는 맥박 정보를 출력하는 생체신호 처리부;상기 생체신호 처리부의 출력정보를 외부로 전달하기 위해 유선 또는 무선 전송하는 통신부;를 포함하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 트렌델렌버그 자세 수술용 헤드 쿠션은, 환자 머리의 이마뼈 또는 마루뼈 영역을 지지하는 중앙부;상기 환자 머리를 보호하기 위해 상기 중앙부의 좌우측으로 연장되어 형성된 지지부;를 포함하고상기 중앙부와 상기 지지부는 탄성소재로 이루어진 것을 특징으로 하는 트렌델렌버그 자세 수술용 헤드 쿠션을이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서상기 지지부는, 상기 중앙부의 좌측으로 연장된 좌측 지지부와상기 중앙부의 우측으로 연장되어 형성된 우측 지지부를 포함하고,상기 좌측 지지부와 상기 우측 지지부는 한 쌍으로 이루어진 것을 특징으로 하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서상기 트렌델렌버그 자세 수술용 헤드 쿠션은, 상기 중앙부 또는 상기 지지부의 내부공간으로 공기가 주입되도록 하는 주입부를 더 포함하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서상기 주입부는,공개특허 10-2025-0020063-3-상기 환자 머리의 동적 움직임과 하중을 고려하여 공기 또는 내부 코어와 오부 쉘의 조합으로 이루어진 비드가주입되는 것을 특징으로 하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 지지부의 일측에 위치하여 어깨 받침과 결합하는 결합부;수술대와 고정할 수 있는 수술대 고정부를 더 포함하는 것을 특징으로 하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 생체신호 측정부는,한 개 이상의 금속 전극이 사용자의 이마에서 생체신호를 측정하는 것을 특징으로 하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 생체신호 처리부는,상기 생체신호를 수신하여 그에 따른 신호 대역에 따라 필터링하는 필터링부;상기 필터링부로부터 출력된 출력신호를 증폭하는 증폭부;상기 증폭부로부터 출력된 아날로그 신호를 디지털 신호로 변환시키는 A/D 변환부; 상기 A/D 변환부로부터 출력된 디지털 신호를 분석하는 분석부; 및상기 분석된 디지털 신호에 대해 보정하는 보정부를 포함하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8에 있어서,상기 보정부의 보정된 디지털 신호인 뇌파 정보, 산소포화도 정보, 또는 맥박 정보를 출력하는 출력부를 포함하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치."}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치에 관한 것이다. 본 발명에 따른 트 렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치는 트렌델렌버그 자세 수술용 헤드 쿠션, 상기 헤드 쿠션 일측에 위치하며, 사용자의 생체신호를 측정하는 생체신호 측정부, 상기 측정부의 생체신호 데이터에 서 뇌파 정보, 산소포화도 정보, 또는 맥박 정보를 출력하는 생체신호 처리부, 상기 생체신호 처리부의 출력정보 를 외부로 전달하기 위해 유선 또는 무선 전송하는 통신부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치에 관한 것이다. 보다 구체적으로, 트렌델렌버그 자세 수술 시 생체신호를 측정하여 상완신경총 마비를 방지할 수 있는 안전 장치인 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치에 관한 것이다."}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "트렌델렌버그 자세(Trendelenburg position)는 쇼크 자세로 반듯하게 누워서 침대 발치를 45도 정도 올려 엉덩 이가 다리보다 낮게 하는 자세이며, 쇼크 시 신체 하부 혈액을 심장으로 모을 수 있으므로, 복부진찰 또는 출열 시 쇼크 예방 상황 등에 사용되고 있다. 주로 출혈이 많아 쇼크(shock) 상태로 빠질 경우 많이 이용되며 하복부 수술이나 골반 수술, 비뇨기과 전립샘절 제술, 산부인과 수술 등에 적용되고 있다. 도 1은 수술 시 트렌델렌버그 자세를 설명하기 위한 도면이다. 트렌델렌버그 자세로 수술하는 환자는 아래로 떨 어지지 않도록 어깨 받침을 통해 환자의 몸을 고정시켜 수술을 진행하게 된다. 일반적으로, 환자들은 한시 간 이상 장시간 상기 자세를 유지해야 한다. 트렌델렌버그 자세로 수술하는 환자는 어깨 받침을 이용하여 고정하기에 장시간 상기 자세를 유지할 경우 머리는 하방으로 이동하고, 환자의 전체 무게가 어깨받침에 집중되어 하방으로 내려간 머리에 의해 상완신경총 이 과도하게 손상될 수 있다. 이때, 상완신경총은 팔로 가는 대부분의 신경들이 비롯되는 겨드랑 부위의 신경얼기이다. 도 2에 도시된 바와 같이, 상완신경총은 흉부, 어깨, 팔 위쪽, 앞팔 및 손에 신경을 연결하고 있다. 트렌델렌버그 자세로 수술 시, 어깨받침에 의해 상완신경총 부분이 집중 압박되어 수술 후 팔의 마비 및 감 각저하로 나타나는 상완신경총 마비가 발생할 수 있다. 상기 자세를 장시간 지속할 경우 양측 어깨 받침에 만 환자의 무게가 실리게 됨으로써, 어깨부위의 상완신경총이 압박되는 문제들이 발생하고 있다. 이와 같은 문 제들을 줄이기 위한 상완신경총 마비를 방지할 수 있는 안전 장치가 요구된다."}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 본 발명은 트렌델렌버그 자세로 수술 시, 생 체신호 데이터를 이용하여 보다 안정적으로 수술할 수 있는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체 신호 검출 장치를 제공하는 것을 목적으로 한다. 본 발명은 머리가 아래로 향해 누워 있는 환자의 머리의 과도한 하방 이동을 방지하고, 머리와 어깨부위에 골고 루 환자의 무게가 분산되도록 하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치를 제공하 는 것을 목적으로 한다. 본 발명은 튜브재질로 머리와 어깨의 형태에 따라 공기 주입량을 조정하여 환자마다 최적의 고정 장치형태를 유 지할 수 있으며, 기존수술대의 어깨 받침에 끼워서 사용하여 기존 수술침대를 활용할 수 있는 트렌델렌버그 자 세 수술용 헤드 쿠션을 제공하는 것을 목적으로 한다. 본 발명은 열소독도 가능한 적절한 탄성력을 가진 소재로 구성될 수 있는 트렌델렌버그 자세 수술용 헤드 쿠션 을 제공하는 것을 목적으로 한다. 본 발명의 목적은 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부 터 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이와 같은 목적을 달성하기 위한 본 발명은 트렌델렌버그 자세 수술용 헤드 쿠션, 상기 헤드 쿠션 일측에 위치 하며, 사용자의 생체신호를 측정하는 생체신호 측정부, 상기 측정부의 생체신호 데이터에서 뇌파 정보, 산소포 화도 정보, 또는 맥박 정보를 출력하는 생체신호 처리부, 상기 처리부의 출력정보를 외부로 전달하기 위해 유선 또는 무선 전송하는 통신부를 포함하는 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치를 제 공한다. 또한, 상기 트렌델렌버그 자세 수술용 헤드 쿠션은, 환자 머리의 이마뼈 또는 마루뼈 영역을 지지하는 중앙부, 상기 환자 머리를 보호하기 위해 상기 중앙부의 좌우측으로 연장되어 형성된 지지부;를 포함하고, 상기 중앙부 와 상기 지지부는 탄성소재로 이루어진 것을 특징으로 한다. 상기 지지부는, 상기 중앙부의 좌측으로 연장된 좌측 지지부와 상기 중앙부의 우측으로 연장되어 형성된 우측 지지부를 포함하고, 상기 좌측 지지부와 상기 우측 지지부는 한 쌍으로 이루어진 것을 특징으로 한다.상기 트렌델렌버그 자세 수술용 헤드 쿠션은, 상기 중앙부 또는 상기 지지부의 내부공간으로 공기가 주입되도록 하는 주입부를 더 포함한다. 상기 주입부는, 상기 환자 머리의 동적 움직임과 하중을 고려하여 공기 또는 내부 코어와 오부 쉘의 조합으로 이루어진 비드가 주입되는 것을 특징으로 한다. 또한, 본 발명은 상기 지지부의 일측에 위치하여 어깨 받침과 결합하는 결합부, 수술대와 고정할 수 있는 수술 대 고정부를 더 포함한다. 상기 측정부는, 한 개 이상의 금속 전극이 사용자의 이마에서 생체신호를 측정하는 것을 특징으로 한다. 상기 생체신호 처리부는, 상기 생체신호를 수신하여 그에 따른 신호 대역에 따라 필터링하는 필터링부, 상기 필 터링부로부터 출력된 출력신호를 증폭하는 증폭부, 상기 증폭부로부터 출력된 아날로그 신호를 디지털 신호로 변환시키는 A/D 변환부, 상기 A/D 변환부로부터 출력된 디지털 신호를 분석하는 분석부, 상기 분석된 디지털 신 호에 대해 보정하는 보정부 및 상기 보정된 디지털 신호를 뇌파 정보, 산소포화도 정보, 또는 맥박 정보를 출력 하는 출력부를 포함한다."}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 본 발명의 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치는 수술 시, 별도의 측정장치 없이 사용자의 생체신호 데이터를 측정할 수 있는 효과가 있다. 본 발명은 환자의 머리와 어깨 형태에 맞춰 환자를 받쳐 줌에 따라 가장 하부로 내려가는 머리에 과도한 압력 발생을 방지할 수 있다. 본 발명은 머리와 어깨의 형태가 편안하게 유지된 상태로 환자의 무게가 골고루 분산되어 어깨받침 압박에 따른 상완신경총 마비를 방지할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적 및 효과, 그리고 그것들을 달성하기 위한 기술적 구성들은 첨부되는 도면과 함께 상세하게 후술 되어 있는 실시 예들을 참조하면 명확해질 것이다. 본 발명을 설명함에 있어서 공지 기능 또는 구성에 대한 구 체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다. 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가 진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐 이다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 이와 같은 본 발명은 비록 한정된 실시 예와 도면에 의해 설명되나, 본 발명은 이것에 의해 한정되지 않으며,"}
{"patent_id": "10-2023-0101480", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 본 발명의 기술 사상과 아래에 기재될 청구범위의 균등 범위 내에서 다양한 수정 및 변형이 가능함은 물론이다. 이하에서는 도면에 도시한 실시 예에 기초하면서 본 발명에 대하여 더욱 상세하게 설명하기로 한다. 그러나, 본 원이 이러한 실시 예와 도면에 제한되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명의 구성에 대하여 상세히 설명한다. 도 3은 본 발명의 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치를 설명하기 위한 도 면이다. 도 3에 도시된 바와 같이, 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치는 트렌델렌 버그 자세 수술용 헤드 쿠션, 상기 헤드 쿠션 일측에 위치하며, 사용자의 생체신호를 측정하는 생체신호 측정부, 상기 측정부의 생체신호 데이터에서 뇌파 정보, 산소포화도 정보, 또는 맥박 정보를 출력하는 생 체신호 처리부, 상기 생체신호 처리부의 출력정보를 외부로 전달하기 위해 유선 또는 무선 전송하는 통신부를 포함한다. 먼저, 트렌델렌버그 자세 수술용 헤드 쿠션는 트렌델렌버그 자세로 수술하기에 적합한 헤드 쿠션일 수 있 다. 구체적인 트렌델렌버그 자세 수술용 헤드 쿠션에 대한 내용은 후술하도록 한다. 생체신호 측정부는 한 개 이상의 금속 전극이 사용자의 이마에서 생체신호를 측정하는 것을 특징으로 한다. 본 발명의 일실시예에 따른 생체신호 측정부는 뇌전도 신호, 심전도 신호, 안정도 신호, 근전도 신호를 측 정할 수 있으며, 측정하고자 하는 신호는 이에 한정되는 것은 아니다. 상기 생체신호 처리부는, 상기 생체신호를 수신하여 그에 따른 신호 대역에 따라 필터링하는 필터링부 , 상기 필터링부로부터 출력된 출력신호를 증폭하는 증폭부, 상기 증폭부로부터 출력된 아 날로그 신호를 디지털 신호로 변환시키는 A/D 변환부, 상기 A/D 변환부로부터 출력된 디지털 신호를 분석하는 분석부, 상기 분석된 디지털 신호에 대해 보정하는 보정부 및 상기 보정된 디지털 신호를 뇌파 정보, 산소포화도 정보, 또는 맥박 정보를 출력하는 출력부를 포함하여 구성된다. 도 4를 참고하면, 필터링부는 상기 생체신호 측정부에서 측정된 신호를 수신하여 각 신호 대역에 따 라 필터링을 수행하는 역할이다. 본 발명의 일실시예에 따른 필터링부는 상기 생체신호 중 고대역 주파수 를 필터링하는 고대역 통과필터, 상기 고대역 통과필터로부터 출력되는 생체신호 중 60Hz 대의 잡음 신호를 필 터링하는 노치필터 및 상기 노치필터에서 출력되는 생체신호 중 100Hz 이하의 저대역 신호를 필터링하는 저대역 통과필터로 구성될 수 있다. 본 발명의 일실시예에 따른 증폭부는 상기 필터링부로부터 출력된 출력신호를 증폭하는 기능을 수행 한다. 본 발명의 일실시예에 따른 A/D 변환부는 상기 증폭부로부터 출력된 아날로그 신호를 디지털 신호로 변환시킨다. 본 발명의 일실시예에 따른 분석부는 A/D 변환부에서 변환된 디지털 신호에 대해 신호 패턴을 분석하 는 역할이다. 이때, 분석부는 인공지능 모델링 알고리즘을 적용할 수 있다. 본 발명의 일실시예에 따른 보정부는 보다 정확한 신호를 제공하기 이해 분석부의 신호를 보정하게 된다. 본 발명의 일실시예에 따라 출력부는 보정된 디지털 신호인 뇌파 정보, 산소포화도 정보, 또는 맥박 정보 를 출력하여 디스플레이하는 기능이다. 예를 들어 데스크탑/랩탑 혹은 스마트 폰에 탑재될 수 있으며, 디지털화 된 신호를 전송받아 디스플레이할 수 있는 장치라면 어디든 사용 가능하다. 통신부는 통신망을 통한 서버와의 연결을 통해 원격건강관리 및 뇌-컴퓨터 접속기술을 이용한 원격 제어할 수 있다. 도 5a를 참고하면, 트렌델렌버그 자세 수술용 헤드 쿠션는 환자 머리의 이마뼈 또는 마루뼈 영역을 지지하 는 중앙부, 환자 머리를 보호하기 위해 상기 중앙부의 좌우측으로 연장되어 형성된 지지부(112a, 112b)를 포함하는 것을 특징으로 한다. 중앙부는 트렌델렌버그 자세 수술시 환자의 하중을 받는 부분으로 일정 높이를 가지며 머리의 이마뼈나 마루뼈를 지지할 수 있다. 지지부(112a, 112b)는 상기 중앙부의 좌측으로 연장된 좌측 지지부(112a)와, 상기 중앙부의 우측으로 연장되어 형성된 우측 지지부(112b)를 포함하고 있으며, 상기 좌측 지지부(112a)와 상기 우측 지지부(112b)는 한 쌍으로 형성될 수 있다. 중앙부와 지지부((112a, 112b)는 탄성소재로 이루어진 것을 특징으로 한다. 또한, 중앙부와 지지부 (112a, 112b)는 ㄷ’자 형상으로 형성되어 있으며, 일체형 또는 조립형으로 이루어질 수 있다. 결합부(113a, 113b)는 지지부(112a, 112b)의 일면에 위치하며, 종래의 트렌델렌버그 자세 수술시 어깨받침 과 결합할 수 있다 도 5b에 도시된 바와 같이, 주입부는 중앙부 또는 지지부((112a, 112b)의 내부공간이 형성되도록 공 기 또는 비드를 주입시킬 수 있는 역할이다. 예를들어, 주입부는 환자 머리의 동적 움직임과 하중을 고려 하여 공기 또는 내부 코어와 외부 쉘의 조합으로 이루어진 비드가 주입될 수 있다. 본 발명은 수술대와 고정할 수 있는 수술대 고정부(미도시)를 더 포함할 수 있다. 도 6 및 도 7은 본 발명의 일 실시예에 따른 트렌델렌버그 자세 수술용 헤드 쿠션을 이 수술대에 장착된 상태를 나타낸 도면이다. 좌측 결합부(113a)는 좌측 어깨 받침(10a)와 결합할 수 있으며, 우측 결합부(113b)는 우측 어깨 받침(10b)와 결 합할 수 있다. 이상과 같이 본 발명의 도시된 실시 예를 참고하여 설명하고 있으나, 이는 예시적인 것들에 불과하며, 본 발명 이 속하는 기술 분야의 통상의 지식을 가진 자라면 본 발명의 요지 및 범위에 벗어나지 않으면서도 다양한 변형, 변경 및 균등한 타 실시 예들이 가능하다는 것을 명백하게 알 수 있을 것이다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 청구범위의 기술적인 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2023-0101480", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 트렌델렌버그 자세를 설명하기 위한 도면 도 2는 상완신경총을 설명하기 위한 도면 도 3 및 도 4는 본 발명의 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치를 설명하기 위한 도면 도 5 및 도 6은 본 발명의 일 실시예에 따른 트렌델렌버그 자세 수술용 헤드 쿠션을 이용한 생체신호 검출 장치 를 수술대에 장착된 상태를 나타낸 도면"}
