{"patent_id": "10-2020-7017436", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0110739", "출원번호": "10-2020-7017436", "발명의 명칭": "진보된 무선 통신 시스템에서의 자원 기반의 CSI 획득 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "라흐만 엠디 사이푸르"}}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서의 사용자 장치(UE)에 있어서,(N) TRP 그룹의 적어도 하나의 송수신 포인트(TRP)로부터 채널 상태 정보(CSI) 설정 정보를 수신하도록 구성된송수신기; 및상기 송수신기에 동작 가능하게 연결된 프로세서를 포함하며, 상기 프로세서는,상기 CSI 설정 정보에 기초하여 CSI 보고를 결정하고;상기 설정 정보에 기초하여, 결정된 CSI 보고를 송신할 (N) TRP 그룹 중 하나 이상의 TRP를 식별하도록 구성되며,상기 송수신기는 상기 결정된 CSI 보고를 업링크 채널을 통해 상기 하나 이상의 TRP로 송신하도록 더 구성되며,상기 결정된 CSI 보고는 상기 (N) TRP 그룹 중 (M) TRP를 선택하기 위한 TRP 지시자 및 선택된 (M) TRP의 각각에 대한 CSI를 포함하며,N은 1보다 크고,M은 1 이상이고, N 이하인, 무선 통신 시스템에서의 사용자 장치(UE)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 결정된 CSI 보고는 CSI 보고를 위해 선택된 다수(M)의 TRP를 더 포함하는, 무선 통신 시스템에서의 사용자장치(UE)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 CSI 설정 정보는 CSI 보고를 위해 선택된 다수(M)의 TRP를 포함하는, 무선 통신 시스템에서의 사용자 장치(UE)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 결정된 CSI 보고는 N1 TRP에 대한 CSI를 포함하는 CSI1 및 N2 TRP에 대한 CSI를 포함하는 CSI2로분할되고;상기 결정된 CSI 보고는 UCI1 및 UCI2인 두 부분을 포함하는 업링크 제어 정보(UCI)를 통해 송신되고;N1은 M의 값에 관계없이 1 이상의 고정된 수이고;N2는 0 이상이고, M-N1과 같고;상기 UCI1은 상기 CCI1 및 상기 UCI2에 대한 정보 비트의 수를 나타내기 위한 UCI 지시자를 포함하고, 정보 비트의 수의 측면에서의 UCI1 송신의 페이로드는 고정되며;상기 UCI2는 상기 CSI2를 포함하고, 정보 비트 수의 측면에서의 UCI2 송신의 페이로드는 가변적인, 무선 통신시스템에서의 사용자 장치(UE)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2020-0110739-3-제 4 항에 있어서,상기 UCI2의 정보 비트의 수를 나타내기 위한 상기 UCI 지시자는 길이 N의 비트맵 b1 내지 bN을 포함하고;상기 비트맵은 M개의 1 및 N-M개의 0을 포함하고;제i TRP에 대한 CSI는 bi가 0으로 설정될 때 상기 결정된 CSI 보고에 포함되지 않으며;제i TRP에 대한 CSI는 bi가 1로 설정될 때 상기 결정된 CSI 보고에 포함되는, 무선 통신 시스템에서의 사용자장치(UE)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 프로세서는,N개의 CSI-RS(CSI-reference signal) 자원 세트를 측정하고, (N) TRP 그룹의 각각에 대해 하나의 세트를 측정하며,상기 CSI 설정 정보에 기초하여 상기 CSI 보고가 N개의 CSI-RS 자원 세트의 M을 나타내는 CSI-RS 자원 지시자(CRI) 및 M개의 CSI-RS 자원의 각각에 대한 CSI를 포함하는 것으로 결정하도록 더 구성되며,상기 송수신기는 M개의 CSI-RS 자원의 각각에 대한 CRI 및 CSI를 포함하는 상기 결정된 CSI 보고를 상기 하나이상의 선택된 TRP로 송신하도록 더 구성되는, 무선 통신 시스템에서의 사용자 장치(UE)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 CRI는 N개의 구성 요소인 CRI1, CRI2,… 및 CRIN을 포함하고, 상기 구성 요소 중 M은 0보다 크고, 나머지N-M은 0이고;제i CSI-RS 자원 세트에 대한 CSI는 CRIi가 0으로 설정될 때 상기 결정된 CSI 보고에 포함되지 않으며;상기 제i CSI-RS 자원 세트에 대한 CSI는 CRIi가 0보다 클 때 상기 결정된 CSI 보고에 포함되며, 상기 CSI는 채널 품질 지시자(CQI), 랭크 지시자(RI), 프리코딩 매트릭스 지시자(PMI) 또는 계층 지시자(LI) 중 적어도 하나를 포함하는, 무선 통신 시스템에서의 사용자 장치(UE)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "무선 통신 시스템에서의 송수신 포인트(TRP)에 있어서,송수신기를 포함하는데, 상기 송수신기는,상기 TRP는 (N) TRP 그룹 중 적어도 하나의 TRP인 채널 상태 정보(CSI) 설정 정보를 사용자 장치(UE)에 송신하고;상기 UE로부터 업링크 채널을 통해 CSI 보고를 수신하도록 구성되며,상기 CSI 보고는 상기 CSI 설정 정보에 기초하여 결정되고,상기 결정된 CSI 보고는 (N) TRP 그룹의 (M) TRP를 선택하기 위한 TRP 지시자 및 상기 선택된 (M) TRP의 각각에대한 CSI를 포함하고,N은 1보다 크며,M은 1 이상이고, N 이하인, 무선 통신 시스템에서의 송수신 포인트(TRP)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 결정된 CSI 보고는 CSI 보고를 위해 선택된 다수(M)의 TRP를 더 포함하는, 무선 통신 시스템에서의 송수신공개특허 10-2020-0110739-4-포인트(TRP)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 CSI 설정 정보는 CSI 보고를 위해 선택된 다수(M)의 TRP를 포함하는, 무선 통신 시스템에서의 송수신 포인트(TRP)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,상기 결정된 CSI 보고는 N1 TRP에 대한 CSI를 포함하는 CSI1 및 N2 TRP에 대한 CSI를 포함하는 CSI2로분할되고;상기 결정된 CSI 보고는 UCI1 및 UCI2인 두 부분을 포함하는 업링크 제어 정보(UCI)를 통해 송신되고;N1은 M의 값에 관계없이 1 이상의 고정된 수이고;N2는 0 이상이고, M-N1과 같고;상기 UCI1은 상기 CCI1 및 상기 UCI2에 대한 정보 비트의 수를 나타내기 위한 UCI 지시자를 포함하고, 정보 비트의 수의 측면에서의 UCI1 송신의 페이로드는 고정되며;상기 UCI2는 상기 CSI2를 포함하고, 정보 비트 수의 측면에서의 UCI2 송신의 페이로드는 가변적인, 무선 통신시스템에서의 송수신 포인트(TRP)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 UCI2의 정보 비트의 수를 나타내기 위한 상기 UCI 지시자는 길이 N의 비트맵 b1 내지 bN을 포함하고;상기 비트맵은 M개의 1 및 N-M개의 0을 포함하고;제i TRP에 대한 CSI는 bi가 0으로 설정될 때 상기 결정된 CSI 보고에 포함되지 않으며;제i TRP에 대한 CSI는 bi가 1로 설정될 때 상기 결정된 CSI 보고에 포함되는, 무선 통신 시스템에서의 송수신포인트(TRP)."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 통신 시스템에서의 사용자 장치(UE)의 방법에 있어서,(N) TRP 그룹 중 적어도 하나의 송수신 포인트(TRP)로부터 채널 상태 정보(CSI) 설정 정보를 수신하는 단계;상기 CSI 설정 정보에 기초하여 CSI 보고를 결정하는 단계;상기 설정 정보에 기초하여 결정된 CSI 보고를 송신하기 위해 상기 (N) TRP 그룹 중 하나 이상의 TRP를 식별하는 단계; 및상기 결정된 CSI 보고를 업링크 채널을 통해 상기 하나 이상의 TRP에 송신하는 단계를 포함하는데,상기 결정된 CSI 보고는 (N) TRP 그룹 중 (M) TRP를 선택하기 위한 TRP 지시자, 및 상기 선택된 (M) TRP의 각각에 대한 CSI를 포함하며, N은 1보다 크고, M은 1 이상이고, N 이하인, 무선 통신 시스템에서의 사용자 장치(UE)의 방법."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 결정된 CSI 보고는 CSI 보고를 위해 선택된 다수(M)의 TRP를 더 포함하거나;상기 CSI 설정 정보는 CSI 보고를 위해 선택된 다수(M)의 TRP를 포함하는, 무선 통신 시스템에서의 사용자 장치공개특허 10-2020-0110739-5-(UE)의 방법."}
{"patent_id": "10-2020-7017436", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "무선 통신 시스템에서의 송수신 포인트(TRP)의 방법에 있어서,상기 TRP는 (N) TRP 그룹 중 적어도 하나의 TRP인 채널 상태 정보(CSI) 설정 정보를 사용자 장치(UE)에 송신하는 단계; 및상기 UE로부터 업링크 채널을 통해 CSI 보고를 수신하는 단계를 포함하며,상기 CSI 보고는 상기 CSI 설정 정보에 기초하여 결정되고,상기 결정된 CSI 보고는 (N) TRP 그룹의 (M) TRP를 선택하기 위한 TRP 지시자 및 상기 선택된 (M) TRP의 각각에대한 CSI를 포함하고,N은 1보다 크며,M은 1 이상이고, N 이하인, 무선 통신 시스템에서의 송수신 포인트(TRP)의 방법."}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 IOT(Internet of Things) 기술을 이용하여 4세대(4G) 시스템보다 높은 데이터 속도를 지원하는 5세대 (5G) 통신 시스템을 융합하는 통신 방법 및 시스템에 관한 것이다. 본 개시는 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카, 커넥티드 카, 헬스 케어, 디지털 교육, 스마트 소매, 보안 및 안전 서비스와 같은 5G 통신 기 술 및 IoT 관련 기술에 기반한 지능형 서비스에 적용될 수 있다. 무선 통신 시스템에서의 사용자 장치(UE)의 방 법이 제공된다. 방법은 (N) TRP 그룹 중 적어도 하나의 송수신 포인트(TRP)로부터 채널 상태 정보(CSI) 설정 정 보를 수신하는 단계, CSI 설정 정보에 기초하여 CSI 보고를 결정하는 단계, 설정 정보에 기초하여 결정된 CSI 보 고를 송신하기 위해 (N) TRP 그룹 중 하나 이상의 TRP를 식별하는 단계, 및 결정된 CSI 보고를 업링크 채널을 통 해 하나 이상의 TRP에 송신하는 단계를 포함한다."}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 채널 상태 획득(channel state acquisition)에 관한 것으로서, 특히 진보된 무선 통신 시 스템에서의 자원 기반의 CSI 획득에 관한 것이다."}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 또는 pre-5G 통신 시스템은 또한 \"4G 네트워크 이후(Beyond 4G Network)\" 통신 시스템 또는 \"LTE 시스템 이후(Post LTE System)\" 통신 시 스템이라 불리어지고 있다. 높은 데이터 송신률(data rate)을 달성하기 위해, 5G 통신 시스템은 초고주파 (mmWave) 대역(예를 들어, 60GHz 대역)에서 구현되는 것으로 간주된다. 무선파(radio wave)의 전파 손실을 감소 시키고 송신 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대한 MIMO(Multiple- Input Multiple-Output), FD-MIMO(Full Dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍 (analog beam forming), 및 대규모 안테나(large scale antenna) 기술들이 논의되고 있다. 또한, 시스템의 네 트워크 개선을 위해, 5G 통신 시스템에서는 진보된 소형 셀(advanced small cell), 클라우드 무선 액세스 네트 워크(cloud Radio Access Network; cloud RAN), 초고밀도 네트워크(ultra-dense network), 기기 간 통신 (Device-to-Device(D2D) communication), 무선 백홀(wireless backhaul), 이동 네트워크(moving network), 협 력 통신(cooperative communication), CoMP(Coordinated Multi-Point), 수신 단 간섭 제거(reception-end interference cancellation) 등의 기술 개발이 이루어지고 있다. 5G 통신 시스템에서는 진보된 코딩 변조 (Advanced Coding Modulation, ACM) 방식인 FQAM(Hybrid FSK and QAM Modulation) 및 SWSC(Sliding Window Superposition Coding)과, 진보된 액세스 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non-orthogonal multiple access) 및 SCMA(sparse code multiple access) 등이 개발되고 있다. 한편, 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 IoT(Internet of Things, 사물인터넷) 망으로 진화하고 있다. 클라우드 서버 등과의 연결을 통한 빅데이터(Big Data) 처리 기술 등이 IoT 기술에 결합된 IoE(Internet of Everything) 기술도 대두 되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소들이 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), 사 물 통신(Machine-to-Machine, M2M), MTC(Machine Type Communication) 등의 기술이 연구되고 있다. IoT 환경에 서는 연결된 사물들에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(Information Technology) 기술과 다양한 산업 간의 융합 및 복합을 통하여 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 또는 커넥티드 카, 스마트 그리드, 헬스 케어, 스마트 가전, 첨단 의료 서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도들이 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), MTC(Machine Type Communication), 사물 통신(Machine-to-Machine, M2M) 등의 기술은 5G 통신 기술이 빔포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처리 기술로서 클라우드 무선 액세스 네트워크(cloud RAN)가 적용되는 것도 5G 기술과 IoT 기술 융합의 일례라 고 할 수 있을 것이다. 효율적 및 효과적인 무선 통신을 위해서는 사용자 장치(user equipment, UE)와 eNB(eNode B) 사이의 진보된 무 선 통신 시스템에서 채널을 이해하고 올바르게(correctly) 추정하는 것이 중요하다."}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "채널 상태를 올바르게 추정하기 위해, UE는 채널 측정에 관한 정보, 예를 들어 CSI를 eNB에 보고(예를 들어, 피 드백)할 수 있다. 채널에 관한 이러한 정보로, eNB는 UE와의 무선 데이터 통신을 효율적이고 효과적으로 수행하 기 위해 적절한 통신 파라미터를 선택할 수 있다."}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시예는 진보된 무선 통신 시스템에서의 광대역 CSI 보고 방법 및 장치를 제공한다. 일 실시예에서, 무선 통신 시스템에서의 UE가 제공된다. UE는 (N) TRP 그룹의 적어도 하나의 송수신 포인트 (transmission and reception point, TRP)로부터 채널 상태 정보(channel status information, CSI) 설정 정보 를 수신하도록 구성된 송수신기를 포함한다. UE는 송수신기에 동작 가능하게 연결된 프로세서를 더 포함하고, 프로세서는 CSI 설정 정보에 기초하여 CSI 보고를 결정하고, 설정 정보에 기초하여, 결정된 CSI 보고를 송신할 (N) TRP 그룹 중 하나 이상의 TRP를 식별하도록 구성된다. 송수신기는 결정된 CSI 보고를 업링크 채널을 통해 하나 이상의 TRP로 송신하도록 더 구성된다. 결정된 CSI 보고는 (N) TRP 그룹 중 (M) TRP를 선택하기 위한 TRP 지시자(indicator) 및 선택된 (M) TRP의 각각에 대한 CSI를 포함한다. N은 1보다 크다. M은 1보다 크거나 같고, N보다 작거나 같다. 다른 실시예에서는, 무선 통신 시스템에서의 TRP가 제공된다. TRP는 CSI 설정 정보를 UE에 송신하고, UE로부터 업링크 채널을 통해 CSI 보고를 수신하도록 구성된 송수신기를 포함하며, 여기서 TRP는 (N) TRP 그룹 중 적어도 하나의 TRP이다. CSI 보고는 CSI 설정 정보에 기초하여 결정된다. 결정된 CSI 보고는 (N) TRP 그룹의 (M) TRP를 선택하기 위한 TRP 지시자 및 선택된 (M) TRP의 각각에 대한 CSI를 포함한다. N은 1보다 크다. M은 1보다 크거 나 같고, N보다 작거나 같다. 또 다른 실시예에서, 무선 통신 시스템에서의 UE의 방법이 제공된다. 방법은 (N) TRP 그룹 중 적어도 하나의 TRP로부터 CSI 설정 정보를 수신하는 단계, CSI 설정 정보에 기초하여 CSI 보고를 결정하는 단계, 설정 정보에 기초하여 결정된 CSI 보고를 송신하기 위해 (N) TRP 그룹 중 하나 이상의 TRP를 식별하는 단계, 및 결정된 CSI 보고를 업링크 채널을 통해 하나 이상의 TRP에 송신하는 단계를 포함한다. 결정된 CSI 보고는 (N) TRP 그룹 중 (M) TRP를 선택하기 위한 TRP 지시자, 및 선택된 (M) TRP의 각각에 대한 CSI를 포함하며, 여기서 N은 1보다 크 고, 여기서 M은 1보다 크거나 같고, N보다 작거나 같다. 다른 기술적 특징은 다음의 도면, 설명 및 청구항으로부터 통상의 기술자에게 용이하게 명백할 수 있다. 아래의 상세한 설명을 착수하기 전에, 본 특허 문서 전체에 걸쳐 사용된 특정 단어 및 문구를 정의하는 것이 유 리할 수 있다. \"결합(couple)\"이라는 용어 및 이의 파생어는 둘 이상의 요소가 서로 물리적으로 접촉하든 접촉 하지 않든 둘 이상의 요소 간의 어떤 직접 또는 간접 통신을 지칭한다. \"송신한다\", \"수신한다\" 및 \"통신한다\" 이라는 용어뿐만 아니라 이의 파생어는 직접 및 간접 통신 둘 다를 포함한다. \"포함한다(include)\" 및 \"구성한 다(comprise)\"이라는 용어뿐만 아니라 이의 파생어는 제한 없이 포함(inclusion)을 의미한다. \"또는\"이라는 용 어는 포괄적이며, 및/또는(and/or)을 의미한다. \"~와 관련된(associated with)\"이라는 용어뿐만 아니라 이의 파 생어는, \"~를 포함하고(include)\", \"~내에 포함되고(included within)\", \"~와 상호 연결하고(interconnect with)\", \"~을 함유하고(contain)\", \"~내에 함유되고(be contained within)\", \"~에 또는, ~와 연결하고(connect to or with)\", \"~에 또는, ~와 결합하고(couple to or with)\", \"~와 통신 가능하고(be communicable with)\", \"~와 협력하고(cooperate with)\", \"~를 인터리브하고(interleave)\", \"~와 병치하고(juxtapose)\", \"~에 가까이 있고(be proximate to)\", \"~에 또는, ~와 묶이고(be bound to or with)\", \"가지고(have)\", \"소유하고 있고 (have a property of)\", \"~에 또는, ~와 관계를 가지고(have a relationship to or with)\" 등인 것을의미한다. \"제어부\"라는 용어는 적어도 하나의 동작을 제어하는 임의의 디바이스, 시스템 또는 이의 일부를 의 미한다. 상기 제어부는 하드웨어 또는 하드웨어 및 소프트웨어의 조합 및/또는 펌웨어로 구현될 수 있다. 임의 의 특정 제어부와 관련된 기능은 로컬로든 원격으로든 중앙 집중화되거나 분산될 수 있다. \"적어도 하나(at least one of)\"라는 문구는, 항목의 리스트와 함께 사용될 때, 나열된 항목 중 하나 이상의 상이한 조합이 사용 될 수 있고, 리스트 내에는 하나의 항목만이 필요할 수 있다는 것을 의미한다. 예를 들어, \"A, B 및 C 중 적어 도 하나\"는 다음의 조합: A, B, C, A 및 B, A 및 C, B 및 C, 및 A 및 B 및 C 중 어느 하나를 포함한다. 더욱이, 아래에서 설명되는 다양한 기능은 하나 이상의 컴퓨터 프로그램에 의해 구현되거나 지원될 수 있으며, 각각의 컴퓨터 프로그램은 컴퓨터 판독 가능 프로그램 코드(computer readable program code)로부터 형성되고, 컴퓨터 판독 가능 매체(computer readable medium)에서 구현된다. \"애플리케이션\" 및 \"프로그램\"이라는 용어는 적절한 컴퓨터 판독 가능 프로그램 코드에서 구현을 위해 적응된 하나 이상의 컴퓨터 프로그램, 소프트웨어 구 성 요소(software components), 명령어 세트(sets of instructions), 절차, 기능, 객체(object), 클래스, 인스 턴스(instance), 관련된 데이터 또는 이의 일부를 지칭한다. 문구 \"컴퓨터 판독 가능 프로그램 코드\"는 소스 코 드(source code), 객체 코드(object code) 및 실행 가능 코드(executable code)를 포함하는 임의의 Type의 컴 퓨터 코드를 포함한다. 문구 \"컴퓨터 판독 가능 매체\"는 판독 전용 메모리(read only memory; ROM), 랜덤 액세 스 메모리(random access memory; RAM), 하드 디스크 드라이브, 콤팩트 디스크(compact disc; CD), 디지털 비 디오 디스크(digital video disc; DVD), 또는 임의의 다른 Type의 메모리와 같이 컴퓨터에 의해 액세스될 수 있 는 임의의 Type의 매체를 포함한다. \"비일시적(non-transitory)\" 컴퓨터 판독 가능 매체는 일시적 전기적 또는 다른 신호를 송신하는 유선, 무선, 광학 또는 다른 통신 링크를 배제한다. 비일시적 컴퓨터 판독 가능 매체는 데이터가 영구적으로 저장될 수 있는 매체, 및 재기록 가능 광 디스크 또는 소거 가능 메모리 디바이스와 같이 데이터가 저장되고 나중에 중복 기록(overwriting)될 수 있는 매체를 포함한다. 다른 특정 단어 및 문구에 대한 정의는 본 특허 문서 전체에 걸쳐 제공된다. 통상의 기술자는 대부분의 경우는 아니지만 이러한 정의가 이러한 정의된 단어 및 문구의 이전 및 이후의 사용에 적용된다는 것을 이해해야 한다."}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시는 채널 상태 정보(CSI) 설정 정보를 식별하고, CSI 설정 정보에 기초하여 CSI 보고를 효율적으로 결정 하는 것을 제공한다."}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서 논의되는 도 1 내지 도 13, 및 본 특허 문서에서 본 개시의 원리를 설명하기 위해 사용된 다양한 실시 예는 예시만을 위한 것이고, 어떤 식으로든 본 개시의 범위를 제한하는 것으로 해석되지 않아야 한다. 통상의 기술자는 본 개시의 원리가 적절히 배치된 임의의 시스템 또는 디바이스에서 구현될 수 있다는 것을 이해할 수 있다. 다음의 문서 및 표준 설명은 본 명세서에 충분히 설명된 바와 같이 본 개시에 참조로 통합된다: 3GPP TS 36.211 v14.4.0, \"E-UTRA, Physical channels and modulation;\" 3GPP TS 36.212 v14.4.0, \"E-UTRA, Multiplexing and Channel coding;\" 3GPP TS 36.213 v14.4.0, \"E-UTRA, Physical Layer Procedures;\" 3GPP TS 36.321 v14.4.0, \"E-UTRA, Medium Access Control (MAC) protocol specification;\" 3GPP TS 36.331 v14.4.0, \"E-UTRA, Radio Resource Control (RRC) protocol specification;\" 3GPP TR 22.891 v1.2.0; 3GPP TS 38.212 v15.4.0, \"E- UTRA, NR, Multiplexing and Channel coding;\" and 3GPP TS 38.214 v15.4.0, \"E-UTRA, NR, Physical layer procedures for data.\" 본 개시의 양태, 특징 및 장점은 본 개시를 수행하기 위해 고려되는 최상의 모드를 포함하는 다수의 특정 실시 예 및 구현을 간단히 예시함으로써 다음의 상세한 설명으로부터 쉽게 명백해진다. 본 개시는 또한 다른 및 상이 한 실시예가 가능하고, 모두 본 개시의 사상 및 범위를 벗어나지 않고 여러 상세 사항이 다양한 명백한 측면에 서 수정될 수 있다. 따라서, 도면 및 설명은 사실상 예시적인 것으로 간주되며 제한적인 것으로 간주되지 않아 야 한다. 본 개시는 첨부된 도면 중의 도면에서 제한이 아닌 예로서 예시되어 있다. 이하에서, 간결성을 위해, FDD 및 TDD는 모두 DL 및 UL 시그널링 둘 다를 위한 이중 방법(duplex method)으로서 간주된다. 이하의 예시적인 설명 및 실시예는 직교 주파수 분할 다중화(orthogonal frequency division multiplexing, OFDM) 또는 직교 주파수 분할 다수의 액세스(orthogonal frequency division multiple access, OFDMA)를 가정 하지만, 본 개시는 다른 OFDM 기반의 송신 파형 또는 F-OFDM(filtered OFDM)과 같은 다수의 액세스 방식으로 확 장될 수 있다. 본 개시는 서로 결합하거나 조합하여 사용될 수 있거나, 독립형 방식으로서 동작할 수 있는 여러 구성 요소를 포함한다. 4G 통신 시스템의 상용화 이후 증가된 무선 데이터 트래픽에 대한 요구를 충족시키기 위해, 개선된 5G 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 행해졌다. 따라서, 5G 또는 pre-5G 통신 시스템은 또한 \"4G 네트워 크 이후(beyond 4G network)\"통신 시스템 또는 \"LTE 시스템 이후(post LTE system)\"시스템이라 불리어지고 있 다. 5G 통신 시스템은 더욱 고주파(mmWave) 대역, 즉 60 GHz 대역에서 구현되어 더 높은 데이터 속도를 달성하는 것으로 고려된다. 무선파의 전파 손실을 감소시키고, 송신 커버리지를 증가시키기 위해, 빔포밍, 대량 MIMO(multiple-input multiple-output), FD-MIMO(full dimensional MIMO), 어레이 안테나, 아날로그 빔포밍, 대규모 안테나 기술 등은 5G 통신 시스템에서 논의된다. 또한, 5G 통신 시스템에서, 진보된 소형 셀, 클라우드 RAN(radio access network), 초 고밀도 네트워크(ultra- dense network), D2D(device-to-device) 통신, 무선 백홀, 이동 네트워크, 협력 통신, CoMP(coordinated multi-point) 송수신, 간섭 완화 및 취소 등을 기반으로 시스템 네트워크 개선을 위한 개발이 진행되고 있다. 5G 시스템에서, AMC(adaptive modulation and coding) 기술로서 하이브리드 FQAM(frequency shift keying and quadrature amplitude modulation) 및 SWSC(sliding window superposition coding), 및 진보된 액세스 기술로 서 FBMC(filter bank multi carrier), NOMA(non-orthogonal multiple access) 및 SCMA(sparse code multiple access)가 개발되었다. 아래의 도 1 내지 도 4b는 무선 통신 시스템에서 OFDM(orthogonal frequency division multiplexing) 또는 OFDMA(orthogonal frequency division multiple access) 통신 기술을 사용하여 구현되는 다양한 실시예를 설명 한다. 도 1 내지 도 3의 설명은 상이한 실시예가 구현될 수 있는 방식에 대한 물리적 또는 구조적 제한을 의미하지 않는다. 본 개시의 상이한 실시예는 적절하게 배치된 임의의 통신 시스템에서 구현될 수 있다. 도 1은 본 개시에 따른 예시적인 무선 네트워크를 도시한다. 도 1에 도시된 무선 네트워크의 실시예는 예시만을 위한 것이다. 무선 네트워크의 다른 실시예는 본 개시의 범위를 벗어나지 않고 사용될 수 있다. 도 1에 도시된 바와 같이, 무선 네트워크는 eNB, eNB 및 eNB를 포함한다. eNB는 eNB 및 eNB와 통신한다. eNB는 또한 인터넷, 독점적 IP(Internet Protocol) 네트워크 또는 다른 데이터 네트워크와 같은 적어도 하나의 네트워크와 통신한다. eNB는 eNB의 커버리지 영역 내의 제1 복수의 UE에 대한 네트워크에 무선 광대역 액세스 (wireless broadband access)를 제공한다. 제1 복수의 UE는 소기업(small business; SB)에 위치될 수 있는 UE; 기업(enterprise; E)에 위치될 수 있는 UE; WiFi 핫 스폿(hotspot; HS)에 위치될 수 있는 UE; 제1 거주지(residence; R)에 위치될 수 있는 UE; 제2 거주지(R)에 위치될 수 있는 UE; 및 셀 폰(cell phone), 무선 랩톱(wireless laptop), 무선 PDA 등과 같은 모바일 디바이스(mobile device)(M)일 수 있는 UE를 포함한다. eNB는 eNB의 커버리지 영역 내의 제2 복수의 UE에 대한 네트워크 에 무선 광대역 액세스를 제공한다. 제2 복수의 UE는 UE 및 UE를 포함한다. 일부 실시예에서, eNB(101-103) 중 하나 이상은 서로 통신하고, 5G, LTE, LTE-A, WiMAX, WiFi 또는 다른 무선 통신 기술을 사용 하여 UE(111-116)와 통신할 수 있다. 네트워크 Type에 따라, \"기지국\" 또는 \"BS\"라는 용어는 송신 포인트(transmit point, TP), 송수신 포인트 (transmit-receive point, TRP), 강화된 기지국(enhanced base station, eNodeB 또는 eNB), 5G 기지국(gNB), 매크로셀(macrocell), 펨토셀(femtocell), WiFi 액세스 포인트(access point, AP) 또는 다른 무선 가능한 디바 이스(wirelessly enabled device)와 같이 네트워크에 무선 액세스를 제공하도록 구성된 임의의 구성 요소(또는 구성 요소의 모음)를 지칭할 수 있다. 기지국은 하나 이상의 무선 통신 프로토콜(wireless communication protocol), 예를 들어, 5G 3GPP NR(new radio interface/access), LTE(long term evolution), LTE-A(LTE- advanced), 고속 패킷 액세스(high speed packet access, HSPA), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세 스를 제공할 수 있다. 편의상, \"BS\" 및 \"TRP\"라는 용어는 본 특허 문서에서 원격 단말기(remote terminal)에 무 선 액세스를 제공하는 네트워크 인프라 구성 요소(network infrastructure component)를 나타내는데 사용된다. 또한, 네트워크 Type에 따라, \"사용자 장치\" 또는 \"UE\"라는 용어는 \"이동국(mobile station)\", \"가입자국 (subscriber station)\", \"원격 단말기\", \"무선 단말기\", \"수신 포인트(receive point)\"또는 \"사용자 디바이 스\"와 같은 임의의 구성 요소를 지칭할 수 있다. 편의상, \"사용자 장치\" 및 \"UE\"라는 용어는 본 특허 문서에서 UE가(이동 전화 또는 스마트 폰과 같은) 모바일 디바이스이든 일반적으로(데스크톱 컴퓨터(desktop computer) 또는 자동 판매기(vending machine)와 같은) 고정 디바이스(stationary device)로 간주되든 BS에 무선으로 액 세스하는 원격 무선 장치를 지칭하는데 사용된다. 점선은 예시 및 설명만을 위해 거의 원형으로 도시되는 커버리지 영역(120 및 125)의 대략적인 범위를 보여준다. 커버리지 영역(120 및 125)과 같은 eNB와 관련된 커버리지 영역은 eNB의 설정 및 자연적 및 인공적 방해물(man-made obstruction)과 관련된 무선 환경의 변화에 따라 불규칙한 형상을 포함하는 다른 형상을 가질 수 있다는 것이 명확히 이해되어야 한다. 아래에서 더욱 상세하게 설명되는 바와 같이, 하나 이상의 UE(111-116)는 진보된 무선 통신 시스템에서 효율적 인 자원 기반의 CSI 획득을 위한 회로, 프로그래밍 또는 이들의 조합을 포함한다. 특정 실시예에서, eNB(101- 103) 중 하나 이상은 진보된 무선 통신 시스템에서의 자원 기반의 CSI 획득을 위한 회로, 프로그래밍 또는 이들 의 조합을 포함한다. 도 1은 무선 네트워크의 일례를 도시하지만, 도 1에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 무 선 네트워크는 임의의 수의 eNB 및 임의의 수의 UE를 임의의 적절한 배치에 포함시킬 수 있다. 또한, eNB는 임의의 수의 UE와 직접 통신할 수 있고, 네트워크에 대한 무선 광대역 액세스를 이러한 UE에 제공할 수 있다. 유사하게, 각각의 eNB(102-103)는 네트워크와 직접 통신할 수 있고, 네트워크에 대한 직 접 무선 광대역 액세스를 UE에 제공할 수 있다. 또한, eNB(101, 102 및/또는 103)는 외부 전화 네트워크 또는 다른 Type의 데이터 네트워크와 같은 다른 또는 부가적인 외부 네트워크에 대한 액세스를 제공할 수 있다. 도 2는 본 개시의 실시예에 따른 예시적인 eNB를 도시한다. 도 2에 도시된 eNB의 실시예는 예시만을 위한 것이며, 도 1의 eNB(101 및 103)는 동일하거나 유사한 구성을 가질 수 있다. 그러나, eNB는 다양한 구성을 가지며, 도 2는 본 개시의 범위를 eNB의 임의의 특정 구현으로 제한하지 않는다.도 2에 도시된 바와 같이, eNB는 다수의 안테나(205a-205n), 다수의 RF 송수신기(210a-210n), 송신 (transmit, TX) 처리 회로 및 수신(receive, RX) 처리 회로를 포함한다. eNB는 또한 제어부/프 로세서, 메모리 및 백홀 또는 네트워크 인터페이스를 포함한다. RF 송수신기(210a-210n)는 안테나(205a-205n)로부터, 네트워크에서 UE에 의해 송신된 신호와 같은 들어오 는(incoming) RF 신호를 수신한다. RF 송수신기(210a-210n)는 IF 또는 기저 대역 신호를 생성하도록 들어오는 RF 신호를 하향 변환시킨다. IF 또는 기저 대역 신호(baseband signal)는 기저 대역 또는 IF 신호를 필터링, 디 코딩 및/또는 디지털화함으로써 처리된 기저 대역 신호를 생성하는 RX 처리 회로로 송신된다. RX 처리 회 로는 처리된 기저 대역 신호를 추가의 처리를 위한 제어부/프로세서로 송신한다. TX 처리 회로는 제어부/프로세서로부터(음성 데이터(voice data), 웹 데이터, 이메일 또는 대화형 비 디오 게임 데이터(interactive video game data)와 같은) 아날로그 또는 디지털 데이터를 수신한다. TX 처리 회 로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는(outgoing) 기저 대역 데이터를 인코딩, 다중 화 및/또는 디지털화한다. RF 송수신기(210a-210n)는 TX 처리 회로로부터 나가는 처리된 기저 대역 또는 IF 신호를 수신하고, 기저 대역 또는 IF 신호를 안테나(205a-205n)를 통해 송신되는 RF 신호로 상향 변환한다. 제어부/프로세서는 eNB의 전체 동작을 제어하는 하나 이상의 프로세서 또는 다른 처리 디바이스를 포 함할 수 있다. 예를 들어, 제어부/프로세서는 잘 알려진 원리에 따라 RF 송수신기(210a-210n), RX 처리 회 로 및 TX 처리 회로에 의해 순방향 채널 신호(forward channel signal)의 수신 및 역방향 채널 신호 (reverse channel signal)의 송신을 제어할 수 있다. 제어부/프로세서는 더욱 진보된 무선 통신 기능과 같 은 부가적인 기능을 또한 지원할 수 있다. 예를 들어, 제어부/프로세서는 다수의 안테나(205a-205n)로부터의 나가는 신호가 원하는 방향으로 나가는 신호를 효과적으로 조종(steering)하도록 상이하게 가중되는 빔포밍 또는 방향성 라우팅 동작(directional routing operation)을 지원할 수 있다. 다양한 다른 기능 중 임의의 기능은 제어부/프로세서에 의해 eNB에서 지원될 수 있다. 제어부/프로세서는 또한 OS와 같은 메모리에 상주하는 프로그램 및 다른 프로세스를 실행할 수 있다. 제어부/프로세서는 실행 프로세스에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동시킬 수 있다. 제어부/프로세서는 또한 백홀 또는 네트워크 인터페이스에 결합된다. 백홀 또는 네트워크 인터페이스 는 eNB가 백홀 연결(backhaul connection) 또는 네트워크를 통해 다른 디바이스 또는 시스템과 통신 할 수 있게 한다. 인터페이스는 임의의 적절한 유선 또는 무선 연결을 통한 통신을 지원할 수 있다. 예를 들어, eNB가(5G, LTE 또는 LTE-A를 지원하는 것과 같은) 셀룰러 통신 시스템(cellular communication system)의 부분으로서 구현될 때, 인터페이스는 eNB가 유선 또는 무선 백홀 연결을 통해 다른 eNB와 통신할 수 있게 한다. eNB가 액세스 포인트로서 구현될 때, 인터페이스는 eNB가 유선 또는 무선 로컬 영역 네트워크(local area network) 또는 유선 또는 무선 연결을 통해(인터넷과 같은) 더 큰 네트워크로 통신할 수 있게 한다. 인터페이스는 이더넷(Ethernet) 또는 RF 송수신기와 같은 유선 또는 무선 연결을 통 한 통신을 지원하는 임의의 적절한 구조를 포함한다. 메모리는 제어부/프로세서에 결합된다. 메모리의 부분은 RAM을 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리(Flash memory) 또는 다른 ROM을 포함할 수 있다. 도 2는 eNB의 일례를 도시하지만, 도 2에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, eNB는 도 2에 도시된 임의의 수의 각각의 구성 요소를 포함할 수 있다. 특정 예로서, 액세스 포인트는 다수의 인터페 이스를 포함할 수 있고, 제어부/프로세서는 상이한 네트워크 어드레스(network address) 사이에서 데 이터를 라우팅하는 라우팅 기능(routing function)을 지원할 수 있다. 다른 특정 예로서, TX 처리 회로의 단일 인스턴스(instance) 및 RX 처리 회로의 단일 인스턴스를 포함하는 것으로 도시되어 있지만, eNB(10 2)는(RF 송수신기 당 하나와 같은) 각각의 다수의 인스턴스를 포함할 수 있다. 또한, 도 2의 다양한 구성 요소 는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가될 수 있다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 3에 도시된 UE의 실시예는 예시만을 위 한 것이며, 도 1의 UE(111-115)는 동일하거나 유사한 구성을 가질 수 있다. 그러나, UE는 다양한 구성을 가지며, 도 3은 본 개시의 범위를 UE의 임의의 특정 구현으로 제한하지 않는다.도 3에 도시된 바와 같이, UE는 안테나, 무선 주파수(radio frequency; RF) 송수신기, TX 처리 회로, 마이크로폰 및 수신(RX) 처리 회로를 포함한다. UE는 또한 스피커, 프로세서 , 입출력(input/output, I/O) 인터페이스(interface; IF), 터치스크린(touchscreen), 디스플레 이 및 메모리를 포함한다. 메모리는 운영 체제(operating system, OS) 및 하나 이상의 애 플리케이션을 포함한다. RF 송수신기는, 안테나로부터, 네트워크의 eNB에 의해 송신된 들어오는 RF 신호를 수신한다. RF 송수신기는 중간 주파수(intermediate frequency; IF) 또는 기저 대역 신호를 생성하기 위해 들어오는 RF 신호를 하향 변환한다. IF 또는 기저 대역 신호는 기저 대역 또는 IF 신호를 필터링, 디코딩 및/또는 디지털화 함으로써 처리된 기저 대역 신호를 생성하는 RX 처리 회로로 송신된다. RX 처리 회로는 처리된 기저 대역 신호를(음성 데이터에 대해서와 같은) 스피커 또는(웹 브라우징 데이터(web browsing data)에 대해서 와 같은) 추가의 처리를 위한 프로세서로 송신한다. TX 처리 회로는 마이크로폰으로부터 아날로그 또는 디지털 음성 데이터를 수신하거나 프로세서 로부터(웹 데이터, 이메일 또는 대화형 비디오 게임 데이터와 같은) 다른 나가는 기저 대역 데이터를 수신한다. TX 처리 회로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는 기저 대역 데이터를 인코딩, 다중 화 및/또는 디지털화한다. RF 송수신기는 TX 처리 회로로부터 나가는 처리된 기저 대역 또는 IF 신호 를 수신하고, 기저 대역 또는 IF 신호를 안테나를 통해 송신되는 RF 신호로 상향 변환한다. 프로세서는 하나 이상의 프로세서 또는 다른 처리 디바이스를 포함할 수 있고, UE의 전체 동작을 제 어하기 위해 메모리에 저장된 OS를 실행할 수 있다. 예를 들어, 프로세서는 잘 알려진 원리에 따라 RF 송수신기, RX 처리 회로 및 TX 처리 회로에 의해 순방향 채널 신호의 수신 및 역방향 채널 신호의 송신을 제어할 수 있다. 일부 실시예에서, 프로세서는 적어도 하나의 마이크로 프로세서 또는 마이크로 제어부를 포함한다. 프로세서는 또한 업링크 채널 상에서 CSI 보고를 위한 프로세스와 같이 메모리에 상주하는 다른 프로 세스 및 프로그램을 실행할 수 있다. 프로세서는 실행 프로세스(executing process)에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동시킬 수 있다. 일부 실시예에서, 프로세서는 OS에 기초하거나 eNB 또는 오퍼레이터로부터 수신된 신호에 응답하여 애플리케이션을 실행하도록 구성된다. 프로세서 는 또한 랩톱 컴퓨터 및 핸드헬드 컴퓨터(handheld computer)와 같은 다른 디바이스에 연결하는 능력을 UE(11 6)에 제공하는 I/O 인터페이스에 결합된다. I/O 인터페이스는 이러한 액세서리(accessory)와 프로세 서 사이의 통신 경로(communication path)이다. 프로세서는 또한 터치스크린 및 디스플레이에 결합된다. UE의 오퍼레이터는 터치스크린 을 이용하여 데이터를 UE에 입력할 수 있다. 디스플레이는 액정 디스플레이(liquid crystal display), 발광 다이오드 디스플레이(light emitting diode display), 또는 웹 사이트(web site)로부터와 같이 텍스트 및/또는 적어도 제한된 그래픽을 렌더링(rendering)할 수 있는 다른 디스플레이일 수 있다. 메모리는 프로세서에 결합된다. 메모리의 일부는 랜덤 액세스 메모리(random access memory; RAM)를 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리 또는 다른 판독 전용 메모리(read-only memory; ROM)를 포함할 수 있다. 도 3은 UE의 일례를 도시하지만, 도 3에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 3의 다양한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가될 수 있다. 특정 예로서, 프로세서는 하나 이상의 중앙 처리 유닛(central processing unit; CPU) 및 하나 이상의 그래픽 처리 유닛(graphics processing unit; GPU)과 같은 다수의 프로세서로 분할될 수 있다. 또한, 도 3은 이동 전화 또는 스마트 폰으로서 설정된 UE를 도시하지만, UE는 다른 Type의 이동 또는 고정 디바이스 로서 동작하도록 설정될 수 있다. 도 4a는 송신 경로 회로(transmit path circuitry)의 하이 레벨 다이어그램이다. 예를 들어, 송신 경로 회로는 OFDMA(orthogonal frequency division multiple access) 통신을 위해 사용될 수 있다. 도 4b는 수신 경로 회로 (receive path circuitry)의 하이 레벨 다이어그램이다. 예를 들어, 수신 경로 회로는 OFDMA 통신을 위해 사용될 수 있다. 도 4a 및 도 4b에서, 다운링크 통신을 위해, 송신 경로 회로는 기지국(eNB) 또는 중계국 (relay station)에서 구현될 수 있고, 수신 경로 회로는 사용자 장치(예를 들어, 도 1의 사용자 장치)에서 구현될 수 있다. 다른 예에서, 업링크 통신을 위해, 수신 경로 회로는 기지국(예를 들어, 도 1의eNB) 또는 중계국에서 구현될 수 있고, 송신 경로 회로는 사용자 장치(예를 들어, 도 1의 사용자 장치 )에서 구현될 수 있다. 송신 경로 회로는 채널 코딩 및 변조 블록(channel coding and modulation block), 직렬 대 병렬(serial- to-parallel; S-to-P) 블록, 크기 N 역 고속 푸리에 변환(Inverse Fast Fourier Transform; IFFT) 블록 , 병렬 대 직렬(parallel-to-serial; P-to-S) 블록, 사이클릭 프리픽스 부가 블록(add cyclic prefix block) 및 상향 변환기(up-converter; UC)를 포함한다. 수신 경로 회로는 하향 변환기 (down-converter; DC), 사이클릭 프리픽스 제거 블록(remove cyclic prefix block), 직렬 대 병렬 (S-to-P) 블록, 크기 N 고속 푸리에 변환(Fast Fourier Transform; FFT) 블록, 병렬 대 직렬(P-to- S) 블록, 및 채널 디코딩 및 복조 블록(channel decoding and demodulation block)을 포함한다. 도 4a 및 4b에서의 구성 요소 중 적어도 일부는 소프트웨어로 구현될 수 있지만, 다른 구성 요소는 설정 가능한 하드웨어 또는 소프트웨어 및 설정 가능한 하드웨어의 혼합에 의해 구현될 수 있다. 특히, 본 개시 문서에서 설명된 FFT 블록 및 IFFT 블록은 설정 가능한 소프트웨어 알고리즘으로서 구현될 수 있으며, 여기서 크기 N의 값은 구현에 따라 수정될 수 있다는 것이 주목된다. 또한, 본 개시는 고속 푸리에 변환 및 역 고속 푸리에 변환을 구현하는 실시예에 관한 것이지만, 이는 예시만을 위한 것이고, 본 개시의 범위를 제한하는 것으로 해석되지 않아야 한다. 본 개시의 대안적인 실시예에서, 고속 푸리에 변환 함수 및 역 고속 푸리에 변환 함수는 각각 이산 푸리에 변환(discrete Fourier transform; DFT) 함수 및 역 이산 푸리에 변환(inverse discrete Fourier transform; IDFT) 함수로 쉽게 대체될 수 있다는 것이 이해될 수 있다. DFT 및 IDFT 함수에 대해, N 변수의 값은 임의의 정수(즉, 1, 4, 3, 4 등)일 수 있지만, FFT 및 IFFT 함수에 대해서는, N 변수의 값은 2의 거듭 제곱인 임의의 정수(즉, 1, 2, 4, 8, 16 등)일 수 있다는 것 이 이해될 수 있다. 송신 경로 회로에서, 채널 코딩 및 변조 블록은 한 세트의 정보 비트(information bit)를 수신하고, 코딩(예를 들어, LDPC 코딩)을 적용하며, 일련의 주파수 도메인 변조 심볼(frequency-domain modulation symbol)을 생성하기 위해 입력 비트(input bit)를 변조시킨다(예를 들어, QPSK(quadrature phase shift keying) 또는 QAM(quadrature amplitude modulation)). 직렬 대 병렬 블록(serial-to-parallel block)은 N이 BS 및 UE에서 사용되는 IFFT/FFT 크기인 N개의 병렬 심볼 스트림(parallel symbol stream)을 생 성하기 위해 직렬 변조된 심볼(serial modulated symbol)을 병렬 데이터(parallel data)로 변환한다(즉, 역다 중화한다(de-multiplex)). 그 다음, 크기 N IFFT 블록은 시간-도메인 출력 신호(time-domain output signal)를 생성하기 위해 N개의 병렬 심볼 스트림 상에서 IFFT 연산을 수행한다. 병렬 대 직렬 블록은 직 렬 시간-도메인 신호(serial time-domain signal)를 생성하기 위해 크기 N IFFT 블록으로부터의 병렬 시 간-도메인 출력 심볼(parallel time-domain output symbol)을 변환한다(즉, 다중화한다). 그 다음, 사이클릭 프리픽스 부가 블록은 사이클릭 프리픽스(cyclic prefix)를 시간-도메인 신호에 삽입한다. 최종적으로, 상 향 변환기는 무선 채널을 통한 송신을 위해 사이클릭 프리픽스 부가 블록의 출력을 RF 주파수로 변조 시킨다(예를 들어, 상향 변환시킨다). 신호는 또한 RF 주파수로 변환하기 전에 기저 대역에서 필터링될 수 있다. 송신된 RF 신호는 무선 채널을 통과한 후에 UE에 도달하고, eNB에서의 동작과의 역 동작(reverse operation)이 수행된다. 하향 변환기는 수신된 신호를 기저 대역 주파수로 하향 변환시키고, 사이클릭 프 리픽스 제거 블록은 직렬 시간-도메인 기저 대역 신호를 생성하기 위해 사이클릭 프리픽스를 제거한다. 직 렬 대 병렬 블록은 시간-도메인 기저 대역 신호를 병렬 시간-도메인 신호로 변환한다. 그 다음, 크기 N FFT 블록은 N개의 병렬 주파수 도메인 신호를 생성하기 위해 FFT 알고리즘을 수행한다. 병렬 대 직렬 블록 은 병렬 주파수 도메인 신호를 일련의 변조된 데이터 심볼로 변환한다. 채널 디코딩 및 복조 블록은 원래의 입력 데이터 스트림을 복원하기 위해 변조된 심볼을 복조하여 디코딩한다. eNB(101-103)의 각각은 다운링크에서 사용자 장치(111-116)로 송신하는 것과 유사한 송신 경로를 구현할 수 있 고, 업링크에서 사용자 장치(111-116)로부터 수신하는 것과 유사한 수신 경로를 구현할 수 있다. 마찬가지로, 사용자 장치(111-116)의 각각은 업링크에서 eNB(101-103)로 송신하기 위한 아키텍처(architecture)에 상응하는 송신 경로를 구현할 수 있고, 다운링크에서 eNB(101-103)로부터 수신하기 위한 아키텍처에 상응하는 수신 경로 를 구현할 수 있다. 5G 통신 시스템의 사용 케이스는 식별되고 설명되었다. 이러한 사용 케이스는 대략 3가지 그룹으로 분류될 수 있다. 일례에서, 강화된 모바일 광대역(enhanced mobile broadband, eMBB)은 덜 엄격한(stringent) 대기 시간및 신뢰성 요구 사항으로 높은 비트/초 요구 사항과 관련이 있는 것으로 결정된다. 다른 예에서, URLL(ultra reliable and low latency)은 덜 엄격한 비트/초 요구 사항으로 결정된다. 또 다른 예에서, mMTC(massive machine type communication)는 디바이스의 수가 km2 당 10 만 내지 1 백만만큼이나 많을 수 있다고 결정되지만, 신뢰성/처리량/대기 시간 요구 사항은 덜 엄격할 수 있다. 이러한 시나리오는 또한 배터리 소모가 가능한 한 최소화되어야 한다는 점에서 파워 효율 요구 사항을 포함할 수 있다. 통신 시스템은 기지국(BS) 또는 NodeB와 같은 송신 포인트로부터 사용자 장치(UE)로 신호를 반송하는 다운링크 (DL) 및 UE로부터 NodeB와 같은 수신 포인트로 신호를 반송하는 업링크(UL)를 포함한다. 또한 일반적으로 단말 기 또는 이동국으로서 지칭되는 UE는 고정식 또는 이동식일 수 있고, 셀룰러 폰, 개인용 컴퓨터 디바이스 또는 자동화된 디바이스일 수 있다. 일반적으로 고정국인 eNodeB는 또한 액세스 포인트 또는 다른 동등한 용어로서 지칭될 수 있다. LTE 시스템의 경우, NodeB는 종종 eNodeB로서 지칭된다. LTE 시스템과 같은 통신 시스템에서, DL 신호는 정보 콘텐츠를 반송하는 데이터 신호, DL 제어 정보(DL control information, DCI)를 반송하는 제어 신호, 및 파일럿 신호로서도 알려진 기준 신호(reference signal, RS)를 포함할 수 있다. eNodeB는 물리적 DL 공유 채널(physical DL shared channel, PDSCH)을 통해 데이터 정보를 송 신한다. eNodeB는 물리적 DL 제어 채널(physical DL control channel, PDCCH) 또는 EPDCCH(Enhanced PDCCH)를 통해 DCI를 송신한다. eNodeB는 PHICH(physical hybrid ARQ indicator channel)에서 UE로부터의 데이터 전송 블록(transport block, TB) 송신에 응답하여 확인 응답 정보(acknowledgement information)를 송신한다. eNodeB는 UE-공통 RS(common RS, CRS), 채널 상태 정보 RS(CSI-RS) 또는 복조 RS(demodulation RS, DMRS)를 포함하는 다수의 RS Type 중 하 나 이상을 송신한다. CRS는 DL 시스템 대역폭(BW)을 통해 송신되고, 데이터 또는 제어 정보를 복조하거나 측정 을 수행하기 위해 채널 추정치를 획득하기 위해 UE에 의해 사용될 수 있다. CRS 오버헤드를 줄이기 위해, eNodeB는 CRS보다 시간 및/또는 주파수 도메인에서 더 작은 밀도를 갖는 CSI-RS를 송신할 수 있다. DMRS는 각각 의 PDSCH 또는 EPDCCH의 BW에서만 송신될 수 있고, UE는 PDRSCH 또는 EPDCCH에서 각각 데이터 또는 제어 정보를 복조하기 위해 DMRS를 사용할 수 있다. DL 채널에 대한 송신 시간 간격은 서브프레임으로서 지칭되고, 예를 들 어 1 밀리초의 지속 기간을 가질 수 있다. DL 신호는 또한 시스템 제어 정보를 반송하는 논리 채널의 송신을 포함한다. BCCH는 DL 신호가 MIB(master information block)를 전달할 때에는 브로드캐스트 채널(broadcast channel, BCH)로서 지칭되는 전송 채널에 매핑되거나 DL 신호가 SIB(System Information Block)를 전달할 때에는 DL 공유 채널(DL shared channel, DL- SCH)에 매핑된다. 대부분의 시스템 정보는 DL-SCH를 사용하여 송신되는 상이한 SIB에 포함된다. 서브프레임에서 의 DL-SCH 상의 시스템 정보의 존재는 특별한 시스템 정보 RNTI(SI-RNTI)로 스크램블링된 CRC(cyclic redundancy check)를 갖는 코드워드를 반송하는 상응하는 PDCCH의 송신에 의해 나타내어질 수 있다. 대안으로, SIB 송신에 대한 스케줄링 정보는 이전의 SIB에 제공될 수 있고, 제1 SIB(SIB-1)에 대한 스케줄링 정보는 MIB에 의해 제공될 수 있다. DL 자원 할당은 서브프레임의 유닛 및 물리적 자원 블록(physical resource block, PRB)의 그룹으로 수행된다. 송신 BW는 자원 블록(RB)으로서 지칭되는 주파수 자원 유닛을 포함한다. 각각의 RB는 부반송파, 또는 12개 의 RE와 같은 자원 요소(RE)를 포함한다. 하나의 서브프레임에 걸친 하나의 RB의 유닛은 PRB로서 지칭된다. UE 는 PDSCH 송신 BW에 대한 총 RE에 대한 RB를 할당 받을 수 있다. UL 신호는 데이터 정보를 전달하는 데이터 신호, UL 제어 정보(UCI)를 전달하는 제어 신호 및 UL RS를 포함할 수 있다. UL RS는 DMRS 및 SRS(Sounding RS)를 포함한다. UE는 각각의 PUSCH 또는 PUCCH의 BW에서만 DMRS를 송 신한다. eNodeB는 DMRS를 사용하여 데이터 신호 또는 UCI 신호를 복조할 수 있다. UE는 eNodeB에 UL CSI를 제공 하도록 SRS를 송신한다. UE는 각각의 물리적 UL 공유 채널(PUSCH) 또는 물리적 UL 제어 채널(PUCCH)을 통해 데 이터 정보 또는 UCI를 송신한다. UE가 동일한 UL 서브프레임에서 데이터 정보 및 UCI를 송신할 필요가 있을 경 우, UE는 둘 다를 PUSCH로 다중화할 수 있다. UCI는 PDSCH에서 데이터 TB에 대한 올바른(correct)(ACK) 또는 올바르지 않은(incorrect)(NACK) 검출 또는 PDCCH 검출(DTX)의 부재를 나타내는 HARQ-ACK(Hybrid Automatic Repeat request acknowledgement) 정보, UE가 UE의 버퍼 내에 데이터를 갖는지를 나타내는 스케줄링 요청 (scheduling request, SR), 랭크 지시자(rank indicator, RI), 및 eNodeB가 UE로의 PDSCH 송신을 위해 링크 적 응을 수행할 수 있게 하는 채널 상태 정보(CSI)를 포함한다. HARQ-ACK 정보는 또한 반영속적으로 스케줄링된PDSCH의 해제를 나타내는 PDCCH/EPDCCH의 검출에 응답하여 UE에 의해 송신된다. UL 서브프레임은 2개의 슬롯을 포함한다. 각각의 슬롯은 데이터 정보, UCI, DMRS 또는 SRS를 송신하기 위한 심볼을 포함한다. UL 시스템 BW의 주파수 자원 유닛은 RB이다. UE는 송신 BW에 대한 총 RE에 대한 RB를 할당받는다. PUCCH의 경우, . 마지막 서브프레임 심볼은 하나 이상의 UE로부터 SRS 송신을 다 중화하는데 사용될 수 있다. 데이터/UCI/DMRS 송신에 이용 가능한 서브프레임 심볼의 수는 이며, 여기서 마지막 서브프레임 심볼이 SRS를 송신하는데 사용된다면, 이고, 그렇지 않으면, 이다. 도 5는 본 개시의 실시예에 따른 서브프레임에서의 PDSCH에 대한 송신기 블록도를 도시한다. 도 5에 도시 된 송신기 블록도의 실시예는 예시만을 위한 것이다. 도 5는 본 개시의 범위를 송신기 블록도의 임의 의 특정 구현으로 제한하지 않는다. 도 5에 도시된 바와 같이, 정보 비트는 터보 인코더와 같은 인코더에 의해 인코딩되고, 예를 들어 QPSK(quadrature phase shift keying) 변조를 사용하여 변조기에 의해 변조된다. 직렬 대 병렬(S/P) 변환 기는 할당된 PDSCH 송신 BW에 대해 송신 BW 선택 유닛에 의해 선택된 RE에 매핑되도록 매퍼에 후속하여 제공되는 M개의 변조 심볼을 생성하고, 유닛은 IFFT(Inverse fast Fourier transform)를 적용하 고, 그리고 나서, 출력은 시간-도메인 신호를 생성하기 위해 병렬 대 직렬(P/S) 변환기에 의해 직렬화되며, 필터링은 필터에 의해 적용되며, 신호는 송신된다. 데이터 스크램블링(data scrambling), 사이클릭 프리픽스 삽입(cyclic prefix insertion), 시간 윈도잉(time windowing), 인터리빙 (interleaving) 등과 같은 부가적인 기능은 본 기술 분야에 잘 알려져 있으며, 간결성을 위해 도시되지 않았다. 도 6은 본 개시의 실시예에 따른 서브프레임에서의 PDSCH에 대한 수신기 블록도를 도시한다. 도 6에 도시 된 다이어그램의 실시예는 예시만을 위한 것이다. 도 6은 본 개시의 범위를 다이어그램의 임의의 특 정 구현으로 제한하지 않는다. 도 6에 도시된 바와 같이, 수신된 신호는 필터에 의해 필터링되고, 할당된 수신 BW에 대한 RE는 BW 선택기에 의해 선택되며, 유닛은 고속 푸리에 변환(FFT)을 적용하고, 출력은 병렬 대 직렬 변환기 에 의해 직렬화된다. 후속하여, 복조기는 DMRS 또는 CRS(도시되지 않음)로부터 획득된 채널 추정치를 적용함으로써 데이터 심볼을 일관성 있게 복조하고, 터보 디코더와 같은 디코더는 정보 데이터 비트 의 추정치를 제공하기 위해 복조된 데이터를 디코딩한다. 시간 윈도잉, 사이클릭 프리픽스 제거, 디스크램블링 (de-scrambling), 채널 추정 및 디인터리빙(de-interleaving)과 같은 부가적인 기능은 간결성을 위해 도시되지 않았다. 도 7은 본 개시의 실시예에 따른 서브프레임에서의 PUSCH에 대한 송신기 블록도를 도시한다. 도 7에 도시 된 블록도의 실시예는 예시만을 위한 것이다. 도 7은 본 개시의 범위를 블록도의 임의의 특정 구현으 로 제한하지 않는다. 도 7에 도시된 바와 같이, 정보 데이터 비트는 터보 인코더와 같은 인코더에 의해 인코딩되고, 변조 기에 의해 변조된다. 이산 푸리에 변환(discrete Fourier transform, DFT) 유닛은 변조된 데이터 비 트 상에 DFT를 적용하고, 할당된 PUSCH 송신 BW에 상응하는 RE는 송신 BW 선택 유닛에 의해 선택되고, 유닛은 IFFT를 적용하고, 사이클릭 프리픽스 삽입(cyclic prefix insertion)(도시되지 않음) 후에, 필터링은 필터에 의해 적용되고, 신호는 송신된다. 도 8은 본 개시의 실시예에 따른 서브프레임에서의 PUSCH에 대한 수신기 블록도를 도시한다. 도 8에 도시 된 블록도의 실시예는 예시만을 위한 것이다. 도 8은 본 개시의 범위를 블록도의 임의의 특정 구현으 로 제한하지 않는다. 도 8에 도시된 바와 같이, 수신된 신호는 필터에 의해 필터링된다. 그 후, 사이클릭 프리픽스가 제거 된 후(도시되지 않음), 유닛은 FFT를 적용하고, 할당된 PUSCH 수신 BW에 상응하는 RE는 수신 BW 선택 기에 의해 선택되고, 유닛은 IDFT(inverse DFT)를 적용하며, 복조기는 DMRS(도시되지 않음)로 부터 획득된 채널 추정치(channel estimate)를 적용함으로써 데이터 심볼을 일관성 있게(coherently) 복조한다. 터보 디코더와 같은 디코더는 정보 데이터 비트의 추정치를 제공하기 위해 복조된 데이터를 디코딩한다. 차세대 셀룰러 시스템에서는 다양한 유스 케이스(use case)가 LTE 시스템의 능력 이상인 것으로 그려진다 (envisioned). 5G 또는 5세대 셀룰러 시스템으로, 6GHz 이하 및 6GHz 이상에서 동작할 수 있는 시스템(예를 들 어, mmWave 체제(regime))이 요구 사항 중 하나가 된다. 3GPP TR 22.891에서, 74개의 5G 유스 케이스가 확인되 고 설명되었고; 이러한 유스 케이스는 크게 3가지 상이한 그룹으로 분류될 수 있다. 제1 그룹은 'eMBB(enhanced mobile broadband)'로 불리고, 대기 시간과 신뢰성 요구 사항이 덜 엄격한 높은 데이터 속도 서비스를 목표로 한다. 제2 그룹은 데이터 속도 요구 사항이 덜 엄격하지만 대기 시간에 대한 내성(tolerant)이 적은 애플리케이 션을 목표로 하는 \"URLL(ultra-reliable and low latency)\"이라고 한다. 제3 그룹은 신뢰성, 데이터 속도 및 대기 시간 요구 사항이 덜 엄격한 km2 당 1백만과 같은 다수의 저전력 디바이스 연결을 목표로 하는 \"mMTC(massive MTC)\"라고 한다. 5G 네트워크가 상이한 서비스 품질(quality of service, QoS)을 가진 이러한 다양한 서비스를 지원하기 위해, 네트워크 슬라이싱이라고 불리는 하나의 방법이 LTE 명세서에서 확인되었다. PHY 자원을 효율적으로 활용하고 DL-SCH에서(상이한 자원 할당 방식, 수비학(numerology) 및 스케줄링 전략을 가진) 다양한 슬라이스를 다중화하 기 위해서는, 유연하고 독립적인(self-contained) 프레임 또는 서브프레임 설계가 활용된다. 도 9는 본 개시의 실시예에 따른 2개의 슬라이스의 예시적인 다중화를 도시한다. 도 9에 도시된 2개의 슬 라이스의 다중화의 실시예는 예시만을 위한 것이다. 도 9는 본 개시의 범위를 2개의 슬라이스의 다중 화의 임의의 특정 구현으로 제한하지 않는다. 공통 서브프레임 또는 프레임 내에서 2개의 슬라이스를 다중화하는 2가지 예시적인 인스턴스(instance)가 도 9 에 도시된다. 이러한 예시적인 실시예에서, 슬라이스는 하나의 송신 인스턴스가 제어(CTRL) 구성 요소(예를 들 어, 920a, 960a, 960b, 920b 또는 960c) 및 데이터 구성 요소(예를 들어, 930a, 970a, 970b, 930b 또는 970c) 를 포함하는 하나 또는 두 개의 송신 인스턴스로 구성될 수 있다. 실시예에서, 2개의 슬라이스는 주파수 도메인에서 다중화되는 반면에, 실시예에서는 2개의 슬라이스가 시간-도메인에서 다중화된다. 이러한 2개 의 슬라이스는 상이한 수비학 세트로 송신될 수 있다. 3GPP 명세서는 최대 32개의 CSI-RS 안테나 포트를 지원하여 eNB가 많은 수의 안테나 요소(예컨대, 64 또는 12 8)를 장착할 수 있도록 한다. 이 경우에, 복수의 안테나 요소는 하나의 CSI-RS 포트 상에 매핑된다. 5G와 같은 차세대 셀룰러 시스템의 경우, CSI-RS 포트의 최대 수는 동일하게 유지되거나 증가할 수 있다. 도 10은 본 개시의 실시예에 따른 예시적인 안테나 블록을 도시한다. 도 10에 도시된 안테나 블록 의 실시예는 예시만을 위한 것이다. 도 10은 본 개시의 범위를 안테나 블록의 임의의 특정 구현으로 제한 하지 않는다. mmWave 대역의 경우, 안테나 요소의 수가 주어진 폼 계수(form factor)에 대해 더 클 수 있지만, 디지털 프리코 딩된 포트의 수에 상응할 수 있는 CSI-RS 포트의 수는 도 10에 도시된 바와 같이 (mmWave 주파수에서 많은 수의 ADC/DAC를 설치할 가능성(feasibility)과 같은) 하드웨어 제약 조건(hardware constraints)으로 인해 제한되는 경향이 있다. 이 경우에, 하나의 CSI-RS 포트는 아날로그 위상 시프터의 뱅크(bank)에 의해 제어될 수 있는 다 수의 안테나 요소로 매핑된다. 그 후, 하나의 CSI-RS 포트는 아날로그 빔포밍을 통해 좁은 아날로그 빔을 생성 하는 하나의 서브어레이(sub-array)에 상응할 수 있다. 이러한 아날로그 빔은 심볼 또는 서브프레임에 걸쳐 위 상 시프터 뱅크를 변화시킴으로써 더 넓은 범위의 각도에 걸쳐 스위핑(sweeping)하도록 설정될 수 있다. (RF 체 인의 수와 동일한) 서브어레이의 수는 CSI-RS 포트의 수 NCSI-PORT와 동일하다. 디지털 빔포밍 유닛은 NCSI-PORT 아날 로그 빔에 걸쳐 선형 조합을 수행하여 프리코딩 이득을 더 증가시킨다. 아날로그 빔은 광대역(따라서 주파수 선 택적이 아님)이지만, 디지털 프리코딩은 주파수 부대역(sub-band) 또는 자원 블록에 걸쳐 변화될 수 있다. 도 11은 본 개시의 실시예에 따른 예시적인 네트워크 구성을 도시한다. 도 11에 도시된 네트워크 구성 의 실시예는 예시만을 위한 것이다. 도 11은 본 개시의 범위를 구성의 임의의 특정 구현으로 제한 하지 않는다. 5G 네트워크가 QoS(quality of service)이 상이한 이러한 다양한 서비스를 지원하기 위해, 3GPP 명세서에서 네 트워크 슬라이싱(network slicing)이라고 하는 하나의 방식이 식별되었다. 도 11에 도시된 바와 같이, 오퍼레이터의 네트워크는 eNB(1130a 및 1130b)와 같은 네트워크 디바이스, 소 형 셀 기지국(펨토/피코 eNB 또는 Wi-Fi 액세스 포인트)(1135a 및 1135b)과 연관되는 다수의 무선 액세스 네트워크(radio access network, RAN)를 포함한다. 네트워크는 각각 슬라이스로서 나타내어지는 다양 한 서비스를 지원할 수 있다. 이 예에서, URLL 슬라이스(1140a)는 자동차(1145b), 트럭(1145c), 스마트 워치(1145a) 및 스마트 글래스 (1145d)와 같은 URLL 서비스를 요구하는 UE를 서빙한다. 2개의 mMTC 슬라이스(1150a 및 550b)는 전력계(555b) 및 온도 제어 박스(1155b)와 같은 mMTC 서비스를 요구하는 UE를 서빙한다. 하나의 eMBB 슬라이스(1160a)는 셀 폰(1165a), 랩탑(1165b) 및 태블릿(1165c)과 같은 eMBB 서비스를 요구하는 UE를 서빙한다. 2개의 슬라이스가 설 정된 장치가 또한 구상될 수 있다. 3GPP 명세서로부터, MIMO는 높은 시스템 처리량 요구 사항을 달성하기 위해 필수 특징으로서 식별되었으며, MIMO는 NR에서 계속 동일하게 유지될 수 있다. MIMO 송신 방식의 주요 구성 요소 중 하나는 eNB(또는 TRP)에서 CSI 획득을 정확하게 하는 것이다. MU-MIMO의 경우, 특히 높은 MU 성능을 보장하기 위해 정확한 CSI의 가용성이 필요하다. TDD 시스템의 경우, CSI는 채널 상호성(channel reciprocity)에 의존하는 SRS 송신을 사용하여 획득 될 수 있다. 한편, FDD 시스템의 경우, 이는 eNB로부터의 CSI-RS 송신 및 UE로부터의 CSI 획득 및 피드백을 사용하여 획득될 수 있다. FDD 시스템에서, CSI 피드백 프레임워크는 eNB로부터 SU 송신을 가정하는 코드북으로부터 도출된 CQI/PMI/RI의 형태로 \"암시적(implicit)\"이다. 5G 또는 NR 시스템의 경우, LTE로부터의 상술한 CSI 보고 패러다임은 또한 지원되며 Type I CSI 보고로서 지칭 된다. Type I 외에, Type II CSI 보고로서 지칭되는 고해상도 CSI 보고가 또한 고차(high-order) MU-MIMO와 같 은 사용 케이스(use case)를 위해 보다 정확한 CSI 정보를 gNB에 제공하도록 지원된다. 일반적으로 Type I 또는 Type II CSI는 PMI 코드북을 사용하여 보고되며, 여기서 PMI는 제1 PMI i1 및 제2 PMI i2인 두 가지 구성 요소 를 갖는다. 부대역 CSI 보고가 설정되면, UE는 빔/프리코더의 그룹을 나타내는 단일 광대역 제1 PMI i1, 및 보 고된 제1 PMI i1에 의해 나타내어진 프리코더의 그룹에 속하는 프리코더를 나타내는 각각의 부대역에 대한 하나 의 제2 PMI i2를 보고한다. 부대역 CSI 보고는 일반적으로 프리코딩이 주파수 선택적인 것으로 알려져 있기 때 문에(즉, 하나의 부대역에서 다른 부대역으로 변하기 때문에) MU-MIMO 송신과 같은 사용 케이스를 위해 설정된 다. 시스템 성능은 PMI 코드북에 따라 다르다. 예를 들어, Type I CSI 보고에 대한 PMI 코드북은 Type II CSI 보고에 대한 PMI 코드북보다 성능이 좋지 않지만, 성능은 CSI 보고 페이로드(피드백 비트의 수)를 결정하는 PMI 코드북의 크기에 비례한다. 실제로, Type I CSI 보고 페이로드는 Type II CSI 보고 페이로드보다 훨씬 작다. 따 라서, 시스템 성능 이득은 PMI 코드북 및 따라서 CSI 보고 페이로드에 정비례한다. gNB 또는 네트워크가 DL 채널의 서브스페이스(예를 들어, PMI 코드북의 서브세트)에 대한 대략적인 선험적 정보 (priori information)를 갖는 경우에 PMI 코드북에 대한 상술한 의존성은 대체되거나 약화될 수 있다. 예를 들 어, gNB는 몇몇 후보 빔포밍 벡터를 사용하여 각각 1개의 포트를 갖는 다수의 CSI-RS 자원을 빔포밍할 수 있고, UE는 부대역 CSI를 보고하기 위해 (예를 들어 CRI를 통해) 각각의 부대역에서 이들 자원 중 하나를 보고(선택) 할 수 있다. 이러한 접근법으로, gNB는 임의의 후보 빔포밍 벡터를 선택할 유연성을 가지며, 즉 부대역 CSI를 보고하기 위해 PMI 코드북에 의존할 필요가 없다. 이러한 접근법은 UL MIMO에도 적용 가능하다는 것을 또한 주 목하며, 여기서 UE는 몇몇 후보 빔포밍 벡터를 사용하여 각각 1개의 포트를 갖는 다수의 SRS 자원을 빔포밍하고, gNB는 UL에 대한 부대역 CSI를 보고하기 위해 (예를 들어 SRI를 통해) 각각의 부대역에서 이들 자 원 중 하나를 보고할 수 있다(나타낼 수 있다). 본 개시는 이러한 CSI 보고 방법의 상세 사항을 제안한다. 본 개시에서, CSI-RS 자원은 달리 언급되지 않는 한 NZP(non-zero power) CSI-RS 자원을 지칭한다. 상위 계층 파라미터 ReportFreqConfiguration은 CSI 보고의 주파수 입도(frequency granularity)를 나타낸다. CSI 보고 설정 구성은 CSI 보고 대역을 대역폭 부분의 부대역 서브세트로서 정의하며, 여기서 ReportFreqConfiguration은 상위 계층 파라미터 CQI-FormatIndicator에 의해 구성된 바와 같이 단일 CQI 또는 다수의 CQI 보고를 나타낸다. 단일 CQI 보고가 설정될 때, 전체 CSI 보고 대역에 대한 각각의 코드워드에 대해 단일 CQI가 보고된다. 다수의 CQI 보고가 설정될 때, 각각의 코드워드에 대해 하나의 CQI가 CSI 보고 대역의 각각의 부대역에 대해 보고된다. 일 실시예 1에서, \"CRI/CQI\"에 설정된 상위 계층 파라미터 ReportQuantity가 UE에 설정될 때, UE는 다음 대안들 중 적어도 하나에 따라 단일 또는 다수의 \"CRI/CQI\"를 보고할 수 있다. Alt 1-1의 일 실시예에서, 상위 계층 파라미터 CQI-FormatIndicator가 단일 CQI 보고를 나타내면, 단일 CRI 및 단일 CQI는 전체 CSI 보고 대역에 대한 각각의 코드워드에 대해 보고된다. Alt 1-2의 일 실시예에서, 상위 계층 파라미터 CQI-FormatIndicator가 다수의 CQI 보고를 나타내면, 각각의 코 드워드에 대한 하나의 CQI는 CSI 보고 대역의 각각의 부대역에 대해 보고된다. 또한 전체 CSI 보고 대역에 대한 각각의 코드워드에 대해 단일 CRI가 보고된다. Alt 1-3의 일 실시예에서, 상위 계층 파라미터 CQI-FormatIndicator가 다수의 CQI 보고를 나타내면, 각각의 코 드워드에 대한 하나의 CQI가 CSI 보고 대역의 각각의 부대역에 대해 보고된다. 또한, 각각의 코드워드에 대한 하나의 CRI는 CSI 보고 대역의 각각의 부대역에 대해 보고된다. Alt 1-4의 일 실시예에서, 상위 계층 파라미터 CQI-FormatIndicator가 단일 CQI 보고를 나타내고, 상위 계층 파 라미터 CRI-FormatIndicator가 단일 CRI 보고를 나타내는 경우, 단일 CRI 및 단일 CQI는 전체 CSI 보고 대역에 대한 각각의 코드워드에 대해 보고된다. Alt 1-5의 일 실시예에서, 상위 계층 파라미터 CQI-FormatIndicator가 단일 CQI 보고를 나타내고, 상위 계층 파 라미터 CRI-FormatIndicator가 다수의 CRI 보고를 나타내는 경우, 전체 CSI 보고 대역에 대한 각각의 코드워드 에 대해 단일 CQI가 보고되고, 각각의 코드워드에 대한 하나의 CRI가 CSI 보고 대역의 각각의 부대역에 대해 보 고된다. Alt 1-6의 일 실시예에서, 상위 계층 파라미터 CQI-FormatIndicator가 다수의 CQI 보고를 나타내고, 상위 계층 파라미터 CRI-FormatIndicator가 단일 CRI 보고를 나타내는 경우, 각각의 코드워드에 대한 하나의 CQI가 CSI 보 고 대역의 각각의 부대역에 대해 보고되고, 전체 CSI 보고 대역에 대한 각각의 코드워드에 대해 단일 CRI가 보 고된다. Alt 1-7의 일 실시예에서, 상위 계층 파라미터 CQI-FormatIndicator가 다수의 CQI 보고를 나타내고, 상위 계층 파라미터 CRI-FormatIndicator가 다수의 CRI 보고를 나타내는 경우, 각각의 코드워드에 대한 하나의 CQI가 CSI 보고 대역의 각각의 부대역에 대해 보고되고, 각각의 코드워드에 대한 하나의 CRI가 CSI 보고 대역의 각각의 부 대역에 대해 보고된다. 이들 대안들(예를 들어, 상술한 Alt 1-1 내지 Alt 1-7의 실시예들) 중 적어도 하나는 상위 계층 시그널링(RRC) 을 통해 설정된다는 것을 주목한다. 예를 들어, 시그널링은 파라미터 CQI-FormatIndicator 또는 파라미터 쌍 (CQI-FormatIndicator, CRI-FormatIndicator)을 통해 이루어질 수 있다. 변형에서, 상술한 Alt 1-1 내지 Alt 1-7에서 다수의 CRI를 보고하기 위한 주파수 입도는 다음의 대안들 중 적어 도 하나에 따른다: Alt 1-8: 주파수 입도는 부대역 크기와 동일하고; Alt 1-9: 주파수 입도는 부대역 크기보다 작으며, 예를 들어, RB와 동일하고; Alt 1-10: 주파수 입도는 부대역 크기보다 크며, 예를 들어, 부대역 크기의 배수이며; Alt 1-11: 주파수 입도는 전체 CSI 보고 대역의 고정 비율(fixed fraction)(1/r)이며, 예를 들어, ½ 또는 ¼ 또는 1/8이다. 이들 대안 중 하나는 고정되거나(예를 들어, Alt 1-8), (예를 들어, 상위 계층 RRC 시그널링을 통해) 설정되거나 UE에 의해 보고된다. 다른 변형에서, 상술한 Alt 1-1 내지 Alt 1-7의 실시예에서 다수의 CQI를 보고하기 위한 주파수 입도는 다음의 대안들 중 적어도 하나에 따른다: Alt 1-12: 주파수 입도는 부대역 크기와 동일하고; Alt 1-13: 주파수 입도는 CRI를 보고하는 것과 동일하다. 이들 대안 중 하나는 고정되거나(예를 들어, 상술한 Alt 1-12의 실시예), (예를 들어, 상위 계층 RRC 시그널링을 통해) 설정되거나 UE에 의해 보고된다. 다른 변형에서, 파라미터 CRI-FormatIndicator는 상술한 대안에서 파라미터 PMI-FormatIndicator로 대체된다. 일 실시예 1A에서, 보고된 CRI(또는 CRI들)는 적은 수의 CSI-RS 포트(예를 들어, 1 또는 2)와 연관된 CSI-RS 자 원을 나타낸다(또는 CRI-RS 자원을 나타낸다). UE에는 상위 계층 시그널링을 통해 NCSI-RS ≥ 1 CSI-RS 자원이 설 정된다. NCSI-RS=1일 때, CRI는 보고될 필요가 없다는 것을 주목한다. 하나의 방법에서, ReportQuantity가 \"CRI/CQI\"로 설정될 때에는 NCSI-RS> 1이다. 다른 방법에서는 ReportQuantity가 \"CRI/CQI\"로 설정될 때 NCSI-RS ≥ 1이다. 본 명세서에서는 두 가지 방법 중 하나가 지원될 수 있다. 일 실시예 1B에서, 보고된 CQI(또는 CQI들)는 보고된 CRI에 의해 나타내어진 CSI-RS 자원과 연관된 포트의 수와 동일한 랭크 값에 상응한다(또는 각각이 상응하는 보고된 CRI에 의해 나타내어진 CSI-RS 자원과 연관된 포트의 수와 동일한 랭크 값에 상응한다).일 실시예 1C에서, 각각의 NCSI-RS CSI-RS 자원과 연관된 포트의 수는 다음의 대안들 중 적어도 하나에 따른다. Alt 1C-1의 일 실시예에서, 포트의 수는 모든 NCSI-RS 자원에 대해 동일하다. 따라서, 보고된 CQI(또는 CQI들)는 SB에 걸쳐 변하지 않는 고정된 랭크에 상응하며, 즉 CQI 보고에 대한 랭크 가정은 WB이다. Alt 1C-2의 일 실시 예에서, 포트의 수는 자원마다 상이할 수 있다. 따라서, 다수의 CQI 및 다수의 CRI가 보고되면, CQI 보고에 대 한 랭크 가정은 SB에서 다른 것으로 변경될 수 있다. 예를 들어, 하나의 SB의 CQI는 랭크 1(상응하는 보고된 CRI가 1 포트 자원을 나타내는 경우)에 상응할 수 있고, CQI 및 다른 SB는 랭크 2(상응하는 보고된 CRI가 2 포 트 자원을 나타내는 경우)에 상응할 수 있다. 다수의 CRI/CQI 보고의 사용 케이스 중 하나는 데이터의 프리코딩 또는 빔포밍이 무선 주파수(RF) 또는 아 날로그 도메인과 디지털 또는 기저 대역 도메인 중 적어도 하나의 도메인에 있는 케이스이다. NCSI-RS CSI-RS 자원은 NCSI-RS 빔포밍 벡터를 사용하여 빔포밍이 적용될 수 있다. 이들 빔포밍 벡터는 UE에 의해 송신되는 SRS를 측정함으로써 (UL-DL 상호성에 의존함으로써) gNB에 의해 획득될 수 있다. 이러한 시스템의 예로는 (밀리미터 파와 같은) 고주파 시스템이 있다. 다른 사용 케이스는 UE가 다음의 두 CSI 보고를 보고하도록 구성되는 하이브리드 CSI이다. 제1 CSI 보고는 서브 스페이스 또는 후보 빔포밍 벡터의 세트에 관한 정보를 나타내는 장기 및 WB CSI를 포함한다. 서브스페이스 보 고의 예는 DFT 빔의 세트를 나타내는 i1 전용 보고(only reporting)이다. 제2 CSI는 본 개시에 제공된 바와 같 은 CRI/CQI를 포함한다(실시예 1 또는 2 또는 이후의 실시예들). 이러한 제2 CSI 보고를 위한 CSI-RS 자원은 제 1 CSI 보고에서 보고된 서브스페이스 또는 후보 빔포밍 벡터의 세트를 사용하여 빔포밍이 적용되거나 프리코딩 된다. 다른 사용 케이스는 PMI에 대한 코드북 검색을 수행할 필요가 없기 때문에 CRI/CQI만이 보고될 필요가 있는 경 우 CSI 계산 시간을 상당히 줄일 수 있는 URLL 애플리케이션이다. 따라서, CSI는 CSI 보고를 위한 PMI를 획득하 기 위해 UE가 코드북 검색을 수행할 필요가 있는 케이스(예를 들어, eMBB 애플리케이션)보다 훨씬 빠르게 CSI를 계산되고 보고될 수 있다. (프리코딩이 적용되지 않거나 빔포밍이 적용되지 않은(non-precoded or non-beamformed) CSI-RS 및 PMI 코드북 을 사용하는) CRI/PMI/CQI 보고에 비해 (빔포밍이 적용된(beamformed) CSI-RS를 사용하는) 다수의 CRI/CQI 보 고의 몇몇 장점/이점은 다음과 같다. 일 실시예에서, 제1 장점은 다수의 CRI/CQI 보고가 CRI/PMI/CQI 보고에 비해 성능 이득을 보일 것으로 예상되는 성능 이득 측면에서 있다. 이것은 빔포밍이 적용된 CSI-RS가 프리코딩이 적용되지 않은 CSI-RS와 비교할 때 UE 에서 더 많은 SINR을 달성할 수 있기 때문이다. 제2 장점은 임의의 빔포밍 또는 프리코딩 벡터가 CSI-RS 자원을 빔포밍하는데 사용될 수 있다는 것이다. 특히, 이들 자원을 빔포밍하기 위해 PMI 코드북과 같은 코드북에 의존할 필요가 없다. 제3 장점은 CRI/PMI/CQI 보고와 비교할 때 다수의 CRI/CQI가 피드백 오버헤드(비트)를 줄일 수 있다는 것이다. 제4 장점은 신뢰성이 (예를 들어, 낮은 BLER 측면에서) 향상될 수 있고, PDSCH 데이터 송신이 URLL 애플리케이 션에 요구되는 (간섭, 차단 등에 대해) 보다 강력할 수 있다는 것이다. 일 실시예 2에서, \"CRI/CQI\" 또는 \"CRI/CQI/RI\"에 설정된 상위 계층 파라미터 ReportQuantity가 UE에 설정될 때, UE는 실시예 1에서의 대안들(예를 들어, 상술한 Alt 1-1 내지 Alt 1-7의 실시예) 중 적어도 하나에 따라 단 일 또는 다수의 \"CRI/CQI\"를 보고할 수 있다. 또한, UE는 다음의 대안들 중 적어도 하나에 따라 RI를 보고할 수 있다. Alt 2-1의 일 실시예에서, RI는 별개의 CSI 구성 요소로서 명시적으로 보고된다. 이러한 대안에서, \"CRI/CQI/RI\"에 설정된 ReportQuantity가 UE에 설정될 수 있다. 몇 가지 예는 다음과 같다. 하나의 예 2-1에서, 각각의 CSI-RS 자원이 하나의 포트만을 가지고 있다고 가정하면(즉, 단일 송신 계층에 상응 한다고 가정하면), RI=1이 보고되는 경우, 하나의 CRI가 보고되고, RI=2가 보고되는 경우, 두 개의 CRI가 보고 된다. 보고된 CQI는 보고된 RI 값 및 집성된(aggregated) 보고된 CRI에 상응한다. 하나의 예 2-2에서, 각각의 CSI-RS 자원이 2개의 포트만을 가지고 있다고 가정하면(즉, 2개의 송신 계층에 상응 하고, RI의 짝수 값(even value)만이 보고될 수 있다고 가정하면), RI=2가 보고되는 경우, 하나의 CRI가 보고되고, RI=4가 보고되는 경우, 두 개의 CRI가 보고된다. 보고된 CQI는 보고된 RI 값 및 집성된 보고된 CRI에 상응 한다. 하나의 예 2-3에서, 각각의 CSI-RS 자원이 1개 또는 2개의 포트만을 가지고 있다고 가정하면(즉, 2개의 송신 계 층 중 하나에 상응한다고 가정하면), RI=1이 보고되는 경우, (1 포트 자원과 연관된) 하나의 CRI가 보고되고, RI=2가 보고되는 경우, (2 포트 자원과 연관된) 하나의 CRI가 보고되거나 (각각 1 포트 자원과 연관된) 2개의 CRI가 보고된다. 보고된 CQI는 보고된 RI 값 및 집성된 보고된 CRI에 상응한다. 일 실시예 Alt 2-2에서, RI는 CRI 또는 CQI와 함께 암시적으로(공동으로) 보고된다. 이러한 대안에서, ReportQuantity는 \"CRI/CQI\"에 설정될 수 있다. 일 실시예 Alt 2-3에서, RI는 보고되지 않는다. 이러한 대안에서, ReportQuantity는 \"CRI/CQI\"로서 설정될 수 있다. 상술한 Alt 2-1, 2-2 및 2-3의 실시예들 중 하나는 본 명세서에서(예를 들어, 시스템 파라미터로서) 고정되거나, 이들 중 하나는 상위 계층(RRC) 시그널링을 통해 설정된다. 이 실시예에서, RI는 WB 방식 또는 매 SB 방식으로 보고될 수 있다. 실시예 1의 나머지 상세 사항은 이 실시예에도 적용 가능하다. UE는 (예를 들어, 다수의 gNB/TRP로부터의 일관성 없는(non-coherent) 조인트 송신을 위해) 다수의 Ng gNB/TRP 의 각각에 대한 CSI를 보고하도록 구성될 때와, \"cri-RI-CQI\"에 설정된 상위 계층 파라미터 reportQuantity를 갖는 CSI-ReportConfig가 UE에 더 설정되며, 설정이 모든 TRP에 대해 공동이거나 각각의 TRP에 대해 독립적인 경우, UE는 다음의 대안들 중 적어도 하나에 따라 각각의 gNB/TRP에 대한 CRI/RI/CQI를 보고할 수 있다. 실시예 Alt 2A-1의 일례에서, UE에는 CSI-ReportConfig에 포함된 상위 계층 파라미터 non-PMI- PortIndication이 설정되며, 여기서 r 포트는 랭크 r에대한 계층 순서로 나타내어지고, CSI 자원 설정에서의 각 각의 CSI-RS 자원은 상위 계층 파라미터 resourcesForChannelMeasurement에 의해 제공되는 채널 측정을 위해 링크된 CSI 자원 설정에서의 연관된 NZP-CSI-RS-ResourceId의 순서에 기초하여 CSI-ReportConfig에 링크된다. 상위 계층 파라미터 non-PMI-PortIndication은 포트 인덱스의 시퀀스 를 포함하며, 여기서 은 랭크 v 및 R ∈ {1,2,...,min(8,P)}과 연관된 CSI-RS 포트 인덱스이며, 여기서 P ∈ {1,2,4,8}은 CSI-RS 자원의 포트의 수이다. 실시예 Alt 2A-1의 일례에서, 랭크에 대한 CQI를 계산할 때, UE는 선택된 CSI-RS 자원에 대한 해당 랭크에 대해 나타내어진 포트를 사용할 수 있다. 나타내어진 포트에 대한 프리코더는 아이덴티티 매트릭스인 것으로 가정될 수 있다. 상이한 상위 계층 파라미터의 설정은 모든 TRP에 공동이거나 각각의 TRP에 대해 독립적이다. 일 실시예 Alt 2A-2에서, UE는 TRP 당 CRI/RI/CQI를 보고하도록 구성되며, 여기서 하나의 CRI는 보고되고, RI 보고는 다음의 하위 대안 중 적어도 하나에 따른다. 일 실시예 Alt 2A-2-1에서, 랭크는 고정된 값, 예를 들어 1 또는 상위 계층 시그널링을 통해 설정된 값이며, 따 라서 RI는 보고되지 않으며, 다시 말하면, CRI/CQI는 본 개시의 실시예 중 하나에 따라 보고된다. 일 실시예 Alt 2A-2-2에서, 랭크는 다수의 값들로부터 하나의 값을 취할 수 있고, 따라서 RI가 보고된다. 본 개 시의 실시예 중 하나에 따라 RI가 CRI 또는/및 CQI로 암시적으로 보고하는 경우에는 CRI/CQI가 보고되거나, 본 개시의 실시예 중 하나에 따라 CRI/RI/CQI가 보고된다. 보고된 CRI에 의해 나타내어진 CSI-RS 자원의 포트의 수가 하나 이상인 경우, CQI 계산을 위한 프리코더는 고정 되거나 상위 계층으로 설정되거나 UE에 의해 보고될 수 있으며, 여기서 프리코더는 1/ 와 같은 일부 스케 일링으로 포트 선택에 상응할 수 있다. 일 실시예 Alt 2A-3에서, UE는 TRP 당 CRI/RI/CQI를 보고하도록 구성되며, 여기서 하나의 CRI는 보고되고, RI 보고는 다음의 하위 대안 중 적어도 하나에 따른다. 일 실시예 Alt 2A-3-1에서, 랭크는 고정된 값, 예를 들어 1 또는 상위 계층 시그널링을 통해 설정된 값이며, 따 라서 RI는 보고되지 않으며, 다시 말하면, CRI/CQI는 본 개시의 실시예 중 하나에 따라 보고된다.일 실시예 Alt 2A-3-2에서, 랭크는 다수의 값들로부터 하나의 값을 취할 수 있고, 따라서 RI가 보고된다. 본 개 시의 실시예 중 하나에 따라 RI가 CRI 또는/및 CQI로 암시적으로 보고하는 경우에는 CRI/CQI가 보고되거나, 본 개시의 실시예 중 하나에 따라 CRI/RI/CQI가 보고된다. 보고된 CRI에 의해 나타내어진 CSI-RS 자원의 포트의 수가 하나 이상인 경우, CQI 계산을 위한 프리코더는 고정 되거나 상위 계층으로 설정되거나 UE에 의해 보고될 수 있으며, 여기서 프리코더는 1/ 와 같은 일부 스케 일링으로 포트 선택에 상응할 수 있다. RI 보고(Alt 2A-1/2A-2/2A-3)는 또한 다음의 대안들 중 적어도 하나에 따를 수 있다. 일 실시예 Alt 2B-1에서, 랭크는 각각의 TRP에 대해, 예를 들어 1에 고정되므로, RI는 어떤 TRP에 의해서도 보고되지 않는다. 일 실시예 Alt 2B-2에서, RI는 각각의 TRP에 의해 보고될 수 있고, 보고된 랭크>0일 수 있다. 일 실시예 Alt 2B-3에서, RI 는 각각의 TRP에 의해 보고될 수 있고, 보고된 랭크는 CSI 보고를 나타내지 않거나 각각의 TRP가 CSI 보고를 위 해 선택되지 않는다는 0일 수 있다. 하나의 예 2B-1에서, 1차 TRP(예를 들어, TRP #1)는 랭크>0을 갖고, 2차 TRP는 랭크>=0을 갖는다. 하나의 예 2B-2에서는 모든 TRP가 랭크>=0을 갖는다. Alt 2B-3의 일례에서, TRP의 수가 2일 때, 1차 TRP에 대해 보고된 랭크(예를 들어, TRP #1) = 2차 TRP에 대해 보고된 랭크(예를 들어, TRP #2)이다. (RI1, RI2)를 (TRP #1, TRP #2)에 대해 보고된 RI 값 쌍이라고 하고, RI 를 TRP에 걸친 랭크 값의 전체 랭크 또는 합이라고 한다. 그런 다음, TRP에 걸친 랭크 분포는 다음과 같다: RI=1, (RI1, RI2)=(1,0); RI=2, (RI1, RI2)=(1,1) 또는 (2,0); RI=3, (RI1, RI2)=(2,1) 또는 (3,0); RI=4, (RI1, RI2)=(2,2), (3,1) 또는 (4,0)이다. Alt 2B-3의 다른 예에서, TRP의 수가 2일 때, TRP에 걸친 랭크 분포는 다음과 같다: RI=1, (RI1, RI2)=(1,0), (0,1); RI=2, (RI1, RI2)=(1,1), (2,0) 또는 (2,0); RI=3, (RI1, RI2)=(2,1), (3,0), (0,3) 또는 (1,2); RI=4, (RI1, RI2)=(2,2), (3,1), (4,0), (0,4) 또는 (1,3)이다. UE는 공동 RI 또는 두 개의 별개의 RI(RI1, RI2)를 CRI 또는 (CRI1, CRI2)로 암시적으로 보고하거나 별개의 CSI 구성 요소 RI 또는 (RI1, RI2)로서 명시적으로 보고한다. 실시예 1 및 2의 변형인 일 실시예 3에서, 각각의 CSI-RS 자원에는 고정된 수(N)의 포트가 설정된다. 예를 들어, N=1 또는 2이다. 따라서, 보고된 CQI는 N의 배수인 랭크 값(RI)에 상응하며, 즉, 랭크 값은 {N, 2N, 3N, ...}에 속한다. 랭크 값(RI)은 보고되거나 보고되지 않을 수 있다. RI가 보고되면, 실시예 2의 예들 중 하나에 따라 RI가 보고된다. 두 가지 예는 다음과 같다. 하나의 예 3-1에서, N=1이고, 가능한 계층의 수(또는 랭크 값)는 {1, 2, ...}에 속한다. 하나의 예 3-2에서, N=2이고, 가능한 계층의 수(또는 랭크 값)는 {2, 4, ...}에 속한다. 일 실시예 4에서, UE가 다수의 CRI/CQI를 보고하도록 구성될 때, UE는 보고된 CRI가 2개의 구성 요소, 즉 CSI- RS 자원의 그룹 또는 서브세트를 나타내는 단일 CRI가 전체 CSI 보고 대역에 대해 보고되는 WB CSI 구성 요소; 및 CSI 보고 대역에서 각각의 부대역에 대해 하나의 CRI가 보고되며, 여기서 보고된 CRI는 WB CRI 구성 요소에 의해 나타내어진 CRI-RS 자원의 그룹 또는 서브세트 내의 CRI-RS 자원을 나타내는 SB CRI 구성 요소를 포함하는 이중 스테이지(dual-stage) 구조를 갖는 것을 제외하고 본 개시의 실시예 1-3에 설명된 바와 같이 다수의 CRI를 보고한다. 이것은 WB PMI(i1) 및 다수의 SB PMI(i2)를 보고하는 이중 스테이지 W1W2 PMI 코드북과 유사하다. 일 실시예에서, 이중 스테이지 CRI는 각각의 CSI-RS 자원의 포트의 수가 고정된 값, 예를 들어 2 또는 4보다 클 때에만 보고된다. 다른 방법에서, 하나의 CRI(단일 스테이지) 또는 이중 스테이지 CRI를 보고할지는 (예를 들어, 상위 계층 RRC 시그널링을 통해) UE에 설정된다. 하나의 예 4-1에서, UE에는 Ks>1개의 CRI-RS 자원 세트가 설정되고, UE는 Ks개의 CSI-RS 자원 세트 중 하나의 CSI-RS 자원 세트(S)를 나타내기(선택하기) 위해 WB CRI를 보고하고, 또한 보고된 CSI-RS 자원 세트(S) 내의 NCSI-RS CSI-RS 자원 중 하나의 CSI-RS 자원을 나타내기(선택하기) 위해 각각의 SB에 대한 하나의 CRI를 보고한다. 하나의 예 4-2에서, UE에는 T 그룹으로 그룹화(예를 들어, 고정 그룹화 또는 순차적 그룹화)되는 Ks=1개의 CRI- RS 자원 세트가 설정된다. UE는 설정된 자원 세트 내의 T CSI-RS 자원 그룹 중 하나의 CSI-RS 자원 그룹(t)을 나타내기(선택하기) WB CRI를 보고하고, 또한 보고된 CSI-RS 자원 그룹(t) 내의 NCSI-RS CSI-RS 자원 중 하나의CSI-RS 자원을 나타내기(선택하기) 위해 각각의 SB에 대한 하나의 CRI를 보고한다. 하나의 예 4-3에서, WB CRI는 P ≤ Q인 (Q)개의 총 gNB/TRP 중 gNB/TRP의 서브세트(P)를 나타내고, SB CRI는 서브세트(P)의 gNB/TRP와 연관된 CSI-RS 자원을 나타낸다. 일 실시예 5에서, gNB는 각각 1개의 포트와 연관된 다수(NCSI-RS>1)의 NZP(non-zero power) CSI-RS 자원을 송신하 며, 여기서, 이들 자원은 프리코딩/빔포밍이 적용될 수 있다. UE는 NCSI-RS개의 CSI-RS 자원을 측정하고 다수의 WB CRI를 보고하도록 설정된다. 이러한 설정은 예를 들어 상위 계층 RRC 시그널링을 통해 이루어진다. 보고된 WB CRI의 수는 보고된 RI에 상응한다. 다수의 CRI는 다음의 대안 중 하나에 따라 보고된다. 일 실시예 Alt 5-1에서, 다수의 CRI는 공동으로 보고된다. 다음의 하위 대안 중 적어도 하나가 사용된다. 일 실시예 Alt 5-1-1에서, RI는 다수의 CRI와 공동으로(암시적으로), 즉 RI 값의 어떠한 명시적 보고없이 보고 된다. 다수의 CRI와 RI를 공동으로 보고하는 비트의 수는 이며, 여기 서 Lmax는 PDSCH에 대해 지원된 최대 계층의 수이다. Lmax의 몇몇 값에 대한 공동 CRI 및 RI 인디케이션 (indication)의 몇몇 예가 표 1 내지 표 4에 제시되어 있다. 일 실시예 Alt 5-1-2에서, RI는 다수의 CRI와 별개로 보고된다. 별개의 CRI 및 RI 인디케이션의 예는 표 5에 제 시되어 있다. NCSI-RS=RI일 때, CRI를 나타낼 필요가 없다. 다른 예에서, 공동 RI 및 CRI(예를 들어, 상술한 실시예 Alt 5-1-1)는 시그널링과 같은 비트맵이며, 여기서 길 이 NCSI-RS 비트맵은 CRI 및 RI를 공동으로 나타내는데 사용된다. 보고된 RI는 비트맵의 \"1\"의 수에 상응하고, CRI는 이들 \"1\"의 위치에 상응한다. 예가 표 6에 제시되어 있다. 일 실시예 Alt 5-2에서, 다수의 CRI는 별개로 보고된다. 다음의 하위 대안 중 적어도 하나가 사용된다. 일 실시 예 Alt 5-2-1에서, RI는 다수의 CRI와 공동으로(암시적으로), 즉 RI 값의 어떠한 명시적 보고 없이 보고된다. 일 실시예 Alt 5-2-2에서, RI는 다수의 CRI와 별개로 보고된다. 표 1. 공동 CRI/RI 인디케이션, Lmax=1 표 2. 공동 CRI/RI 인디케이션, Lmax=2"}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "표 3. 공동 CRI/RI 인디케이션, Lmax=3 표 4. 공동 CRI/RI 인디케이션, Lmax=4"}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 5. 공동 CRI 및 별개의 RI 인디케이션, Lmax=4 표 6. 공동 CRI 및 RI 인디케이션을 위한 비트맵, NCSI-RS=4"}
{"patent_id": "10-2020-7017436", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "일 실시예 5A에서, gNB는 각각 2개의 포트와 연관된 다수(NCSI-RS>1)의 NZP(non-zero power) CSI-RS 자원을 송신 하며, 여기서, 이들 자원은 프리코딩/빔포밍이 적용될 수 있다. UE는 NCSI-RS개의 CSI-RS 자원을 측정하고 다수의 WB CRI를 보고하도록 설정된다. 이러한 설정은 예를 들어 상위 계층 RRC 시그널링을 통해 이루어진다. 보고된 WB CRI의 수는 보고된 RI에 상응하며, 이는 각각의 CSI-RS에는 2개의 포트가 있으므로 2개의 계층을 나타내기 때문에 짝수 값, 즉 {2, 4, …}을 취한다. 다수의 CRI는 상술한 실시예 5에서 대안 중 하나(또는 이들의 간단한 확장)에 따라 보고된다. 대안의 확장은 통상의 기술자에게는 간단하다. 일 실시예 5B에서, gNB는 각각 1개 또는 2개의 포트와 연관된 다수(NCSI-RS>1)의 NZP(non-zero power) CSI-RS 자 원을 송신하며, 여기서, 이들 자원은 프리코딩/빔포밍이 적용될 수 있다. UE는 NCSI-RS개의 CSI-RS 자원을 측정하 고 다수의 WB CRI를 보고하도록 설정된다. 이러한 설정은 예를 들어 상위 계층 RRC 시그널링을 통해 이루어진다. 보고된 RI 값은 보고된 CRI 내의 포트 수의 총계, 즉, RI=∑c∈SNports(c)에 상응한하며, 여기서 S는 보고된 CRI 세트이고, Nports(c)는 세트 S 내의 CRIc와 연관된 포트의 수이다. 다수의 CRI는 상술한 실시예 5에서 대안 중 하나(또는 이들의 간단한 확장)에 따라 보고된다. 대안의 확장은 통상의 기술자에게는 간단하다. 일 실시예 5C에서, 보고될 수 있는 최대 CRI의 수는 CRI/L1-RSRP 또는 SSBRI/L1-RSRP를 보고하도록 설정되는 N=1, 2, 3 또는 4에 상응하며, 여기서 N은 상위 계층으로 설정된다. 일 실시예 5D에서, 본 개시에서(예를 들어, 실시예 5에서) 상술한 바와 같이 다수의 WB CRI를 보고하는 대신에, UE는 다음의 것 중 적어도 하나를 나타내는 단일 WB CRI를 보고하도록 설정된다. 일 실시예 Alt 5D-1에서, 그룹화가 고정/미리 결정되거나 상위 계층으로 설정되는 CSI-RS 자원의 그룹이 설정된 다. 일 실시예 Alt 5D-2에서, 그룹화가 고정/미리 결정되거나 상위 계층으로 설정되는 CRI의 그룹이 설정된다. 일 실시예 Alt 5D-3에서, 다수의 CSI-RS 자원 세트가 UE에 설정되는 다수의 CSI-RS 자원 세트 중 하나의 CSI-RS 자원 세트가 설정된다. 일 실시예 5E에서, UE에는 \"CodeBook\" 또는 \"NonCodeBook\" 값의 상위 계층 파라미터 CSIRS-SetUse가 설정된다. CSIRS-SetUse=\"NonCodeBook\"가 UE에 설정될 때, UE는 본 개시의 일부 실시예(예를 들어, 상술한 실시예 5)에서 설명된 바와 같이 다수의 WB CRI를 보고한다. CSIRS-SetUse =“CodeBook”가 UE에 설정될 때, UE는 본 개시의 일부 실시예(예를 들어, 실시예 1)에서 설명된 바와 같이 SB CRI를 보고한다. 대안으로, CSIRS- SetUse=\"CodeBook\"이 UE에 설정될 때, UE는 \"CRI/RI/CQI\" 또는 \"LI/CRI/PMI/CQI/RI\" 또는 \"CRI/PMI/CQI/RI\" 또 는 \"CRI/i1/CQI/RI\" 또는 \"CRI/i1/RI” 중 적어도 하나를 보고한다.일 실시예 5F에서, UE는 다수의 gNB/TRP 중에서 각각의 gNB/TRP에 대한 단일 WB CRI를 보고하도록 설정되며, 여 기서 UE는 다수의 gNB/TRP에 대한 CRI(예를 들어, CRI/CQI)를 포함하는 CSI를 보고하도록 설정된다. 일 실시예 6에서, UE는 Ng>1 TRP(또는 안테나 패널)에 대한 Ng>1개의 CSI-RS 자원 세트: TRP #1에 대한 NCSI- RS,1≥1개의 CSI-RS 자원을 포함하는 세트 S_1; TRP #2에 대한 N≥CSI-RS,2개의 CSI-RS 자원을 포함하는 세트 S_2; … TRP #Ng로부터의 NCSI-RS,Ng≥1개의 CSI-RS 자원을 포함하는 세트 SNg를 측정하도록 설정된다. 이러한 설정은 상 위 계층 RRC 시그널링 또는 더욱 동적 MAC CE 기반 또는 DCI 기반의 시그널링을 통해 이루어진다. 대안으로, Ng>1 세트는 단일 CSI-RS 자원 세트를 포함한다. 즉, 각각의 Ng 세트는 단일 CSI-RS 자원 세트의 서 브세트와 동등하다. CQI 계산/보고를 위한 간섭 측정을 위한 자원은 다음의 대안 중 적어도 하나를 따른다. 일 실시예 Alt 6-1에서, UE에는 간섭 측정을 위한 임의의 부가적인 자원이 설정되지 않으며, UE는 Ng>1개의 CSI-RS 자원 세트를 사용하여 채널 및 간섭 모두를 측정한다. 일 실시예 Alt 6-2에서, UE에는 간섭 측정을 위한 부가적인 자원이 설정된다. 다음의 예 중 적어도 하나가 사용 된다. 하나의 예 6-1에서, UE에는 채널 측정을 위한 Ng>1개의 CSI-RS 자원 세트 및 간섭 측정을 위한 CSI-IM 자원이 설정되며, 여기서 CSI-IM 자원은 N_g TRP의 전부 또는 서브세트에 대해 설정된다. 하나의 예 6-2에서, UE에는 채널 측정을 위한 N_g>1개의 NZP CSI-RS 자원 세트 및 간섭 측정을 위한 ZP(zero power) CSI-RS 자원이 설정되며, 여기서 ZP CSI-RS 자원은 Ng TRP의 전부 또는 서브세트에 대해 설정된다. 하나의 예 6-3에서, UE에는 채널 측정을 위한 Ng>1개의 NZP CSI-RS 자원 세트 및 간섭 측정을 위한 부가적인 NZP CSI-RS 자원 세트가 설정되며, 여기서 부가적인 NZP CSI-RS 자원 세트는 N_g TRP의 전부 또는 서브세트에 대해 설정된다. 그 후, UE는 (본 개시에서 앞서 제공된 바와 같이) 다수의 CRI/CQI를 Ng>1개의 TRP 중 적어도 하나에 보고하도 록 설정된다. 일례로서, UE는 (본 개시에서 앞서 제공된 바와 같이) Ng>1개의 TRP의 각각에 대해 다수의 CRI/CQI를 보고하도록 설정된다. 이러한 설정은 상위 계층 RRC 시그널링 또는 더욱 동적 MAC CE 기반 또는 DCI 기반의 시그널링을 통해 이루어진다. 다음의 대안들 중 적어도 하나는 Ng CSI 보고를 보고하는데 사용된다. 일 실시예 Alt 6A-1에서, Ng CSI 보고의 각각은 상응하는 CSI-RS 자원 세트를 사용하여 도출된다(즉, CSI-RS 자 원 세트는 CSI 보고에 일대일로 매핑된다). 일 실시예 Alt 6A-2에서, Ng CSI 보고 중 적어도 하나는 다수의 CSI-RS 자원 세트를 사용하여 도출된다. 예를 들어, Ng=2이면, TRP #1에 대한 CSI 보고는 CSI-RS 자원의 두 세트(S1 및 S2)를 사용하여 도출될 수 있고; 마찬 가지로, TRP #2에 대한 CSI 보고는 또한 두 CSI-RS 자원 세트를 사용하여 도출될 수 있다. CSI 보고를 도출하기 위한 다수의 CSI-RS 자원 세트의 이러한 링킹(linking)은 예를 들어 상위 계층 RRC 시그널링 또는 더욱 동적 MAC CE 기반 또는 DCI 기반의 시그널링을 통해 설정될 수 있다. UE가 (예를 들어, 다수의 gNB/TRP로부터의 일관성 없는 공동 송신을 위해) 다수의 (Ng) gNB/TRP의 각각에 대한 CSI를 보고하도록 설정될 때, 여기서 설정은 모든 TRP에 대해 공동이거나 각각의 TRP에 대해 독립적이며, UE는 모든 TRP에 대한 CSI 보고를 포함하는 단일 공동 CSI 보고를 예를 들어 1차 TRP(또는 TRP #1)에 보고할 수 있다. 또는, UE는 각각의 TRP에 대한 독립적인 CSI 보고를 예를 들어 각각의 TRP에 보고할 수 있다. CSI 보고의 일례에서, 설정은 \"CRI/CQI\"에 설정된 상위 계층 파라미터 ReportQuantity를 포함하고, UE는 본 개 시에서 제공된 대안들 중 적어도 하나(예를 들어, 상술한 실시예 Alt 1-1 내지 Alt 1-7 중 하나)에 따라 단일 또는 다수의 \"CRI/CQI\"를 보고할 수 있다. 일례에서, 모든 TRP에 대한 CRI/CQI를 포함하는 단일 공동 CSI 보고 는 예를 들어 1차 TRP(또는 TRP #1)에 보고된다. 다른 예에서, 각각의 TRP에 대한 독립적 CRI/CQI 보고는 예를 들어 각각의 TRP에 보고된다.CSI 보고의 다른 예에서, 설정은 \"CRI/L1-RSRP\"에 설정된 상위 계층 파라미터 ReportQuantity를 포함하고, UE 는 모든 TRP에 대한 CRI/L1-RSRP를 포함하는 단일 공동 CSI 보고 또는 각각의 TRP에 대한 독립적 CRI/CQI 보고 를 보고할 수 있다. 다수(Ng)의 gNB/TRP에 대한 CSI를 반송하는 UCI는 부분 1 및 부분 2인 두 부분으로 나눌 수 있으며(분할될 수 있으며), 여기서 UCI 부분 1은 다수의 gNB/TRP에 대한 CSI 보고의 서브세트(즉, CSI 부분 1)를 반송하고, UCI 부분 2는 다수의 gNB/TRP에 대한 나머지 CSI 보고(즉, CSI 부분 2)를 반송한다. CSI 부분 1은 고정된 페이로드 (비트의 수)를 가지며, 상응하는 UCI 부분 1은 항상 보고된다. CSI 부분 2는 가변 페이로드(비트의 수)를 가질 수 있고, 상응하는 UCI 부분 2는 보고되거나 보고되지 않을 수 있다. 예를 들어, CSI 부분 2가 0의 페이로드(즉, 보고되지 않음)를 가질 경우 UCI 부분 2는 보고되지 않는다. CSI 부분 2 또는 UCI 부분 2의 크기에 대한 정보는 UCI 또는 CSI 부분 1에 포함된다. 일례에서, 정보는 CSI가 보고되는 UCI 부분 2에 보고되는 (총 Ng 중) TRP의 수(N)를 포함한다. 다른 예에서, 정보는 CSI가 UCI 부분 2에 보고되는 (나머지 Ng-N1 중) TRP의 수(N2)를 포함하며, 여기서 N1 및 N2는 각각 CSI가 UCI 부분 1 및 부분 2에 포함되는 TRP의 수이다. 다른 예에서, 정보는 UCI 부분 2와 연관된 TRP에 대한 CSI가 보고되는지 여부를 나타내 는 비트맵을 포함한다. 비트맵의 길이는 N2일 수 있다. CSI 부분 2 또는 UCI 부분 2의 크기에 대한 정보는 CSI 부분 1에서 별개의 CSI 구성 요소로 명시적일 수 있거나 CSI 부분 1의 CSI 구성 요소 중 하나, 예를 들어 RI(보 고된 경우) 또는 CRI로 암시적일 수 있다. UCI 부분 1 및 UCI 부분 2는 다음의 대안 중 적어도 하나에 따라 보고된다. 일 실시예 Alt 6B-1에서, UCI 부분 1 및 UCI 부분 2는 1차 TRP(예를 들어, TRP #1)에만 보고되고, 다른 TRP에 는 보고되지 않는다. 일 실시예 Alt 6B-2에서, UCI 부분 1 및 UCI 부분 2는 1차 TRP(예를 들어, TRP #1)에만 보고되고, UCI 부분 2 는 나머지 TRP 중 하나에 보고된다. 일 실시예 Alt 6B-3에서, UCI 부분 1은 1차 TRP(예를 들어, TRP #1)에만 보고되고, UCI 부분 2는 나머지 TRP 중 하나에 보고된다. 일례에서, UCI 부분 1은 1차 TRP(즉, TRP #1)에 대한 CSI를 반송하며, 또한 CSI가 UCI 부분 2를 사용하여 보고 되는 나머지 TRP(예를 들어, TRP #i, 여기서 i>1)의 수(N2 ≥ 0)에 대한 정보를 포함한다. UCI 부분 2는 나머지 TRP(예를 들어, TRP #i, 여기서 i>1)의 N2의 CSI를 반송한다. UCI 부분 2 페이로드는 (N2가 변하기 때문에) 변 하며. 특히 N2=0인 경우 UCI 부분 2는 보고되지 않는다는 것을 주목한다. Ng>2 및 Ng-1>N2(즉, 나머지 TRP의 수>CSI가 UCI 부분 2를 통해 보고되는 TRP의 수)인 경우, CSI가 보고되는 TRP의 인덱스를 나타내기 위한 인디케 이션이 필요하다. 다른 예에서, UCI 부분 1은 1차 TRP(즉, TRP #1)에 대한 CSI를 반송하며, 또한 UCI 부분 2를 사용하여 CSI가 보고되는 TRP의 인덱스에 대한 정보(예를 들어, 비트맵)를 포함한다. UCI 부분 2는 나머지 TRP(예를 들어, TRP #i, 여기서 i>1)의 N2의 CSI를 반송한다. UCI 부분 2 페이로드는 (N2가 변하기 때문에) 변하며. 특히 N2=0인 경 우 UCI 부분 2는 보고되지 않는다는 것을 주목한다. 변수 N2를 지원하는 이유는 다음과 같다. 이유 중 하나의 예에서, 첫 번째 이유는 일부 TRP에 대한 DL 채널이 (다른 TRP와 비교할 때) 너무 약하여 이러한 약한 TRP로부터의 데이터 송신의 이점이 없는 경우이다. 이는 (예 를 들어, 밀리미터 파 또는 FR2 통신에서) 차단(blockage) 또는 강한 간섭으로 인해 발생할 수 있다. 이유의 다 른 예에서는 UE가 모든 설정된 (Ng) TRP로부터 동시 PDSCH 수신을 지원할 수 없는 경우이다. 변형에서, 다수의 (Ng) gNB/TRP에 대한 CSI를 반송하는 UCI는 Ng 부분으로 나눌 수 있으며(분할될 수 있으며), 여기서 UCI 부분 i는 제i gNB/TRP의 CSI에 상응하는 CSI 부분 i를 반송한다. CSI 부분 1은 고정된 페이로드(비 트의 수)를 가지며, 상응하는 UCI 부분 1은 항상 보고된다. CSI 부분 i(i>1)는 또한 고정된 페이로드(비트의 수)를 가질 수 있지만, CSI 부분 i는 보고되거나 보고되지 않을 수 있다. 따라서, 상응하는 UCI 부분 i는 CSI 부분 i가 보고될 경우에 고정된 페이로드를 갖고, CSI 부분 i가 보고되지 않을 경우에 CSI 부분 i는 보고되지 않는다. CSI 부분 i 또는 UCI 부분 i의 크기에 대한 정보는 UCI 또는 CSI 부분 1에 포함된다. 일례에서, 정보는 CSI가 UCI 부분 i(i>1)에 보고되는 (총 Ng 중) TRP의 수(N)를 포함한다. 다른 예에서, 정보는 CSI가 UCI 부분 i(i>1) 에 보고되는 (나머지 Ng-N1 중) TRP의 수(N2)를 포함하며, 여기서 N1 및 N2는 각각 CSI가 UCI 부분 1 및 UCI 부 분 i(i>1)에 포함되는 TRP의 수이다. 다른 예에서, 정보는 UCI 부분 i(i>1)와 연관된 TRP에 대한 CSI가 보고되 는지 여부를 나타내는 비트맵을 포함한다. 비트맵의 길이는 N2일 수 있다. UCI 부분 1 및 UCI 부분 i(i>1)는 다음의 대안 중 적어도 하나에 따라 보고된다. 하나의 예 Alt 6C-1에서, UCI 부분 1 및 UCI 부분 I(I>1)는 1차 TRP(예를 들어, TRP #1)에만 보고되고, 다른 TRP에는 보고되지 않는다. 다른 예 Alt 6C-2에서, UCI 부분 1 및 UCI 부분 i(i>1)는 1차 TRP(예를 들어, TRP #1)에만 보고되고, UCI 부분 i(i>1)는 각각의 TRP i에 보고된다. 또 다른 예 Alt 6C-3에서, UCI 부분 1은 1차 TRP(예를 들어, TRP #1)에만 보고되고, UCI 부분 i(i>1)는 나머지 TRP i 중 하나에 보고된다. 일 실시예 6A에서, UE는 상술한 실시예 6에서 설명된 바와 같이 Ng>1개의 CSI-RS 자원 세트 또는 Ng>1개의 TRP (또는 안테나 패널)를 측정하도록 설정되고, UE에는 CSI 보고를 위해 \"CRI/X\"에 설정된 상위 계층 파라미터 ReportQuantity가 더 설정되며, 그 후 UE는 다음과 같이 각각의 자원 세트(또는 TRP)에 대한 CSI 보고로서 \"CRI/X\"를 보고할 수 있다. 각각의 TRP에 대한 CSI 보고는 {CRI, X}를 포함하며, 여기서 CRI는 0 값을 취할 수 있다(즉, 자원 선택 0을 나타내는 CRI=0이며, 즉 해당 TRP에 대해 CSI가 보고되지 않음). CRI=0일 때, X는 보고 되지 않으며, 즉 CRI만이 보고된다. 또한, UE는 모든 N_g TRP에 대해 CRI=0을 보고할 수 없다. 다시 말하면, UE 는 적어도 하나의 TRP에 대해 CRI>0 인 {CRI, X}를 보고할 수 있다. 또한, CRI는 TRP마다 독립적 또는 TRP에 걸 쳐 공동으로 보고될 수 있다. 수량 X는 CQI 또는 RI/CQI 또는 RI/CQI/PMI 또는 RI/CQI/PMI/LI 중 하나이다. X=CQI일 때, 전체 RI(TRP에 걸친 계층의 총 수)는 보고되지 않으며, CRI를 통해 나타내어진 자원의 수 또는 CRI 를 통해 나타내어진 자원과 연관된 포트의 수의 합과 동일하다. 다중 TRP에 대한 이러한 PMI가 아닌(non-PMI) 피드백에 대한 중요한 사용 케이스는 각각 적은 수의 포트(예를 들어, 1)를 가진 많은 수의 TRP가 있는 경우이 며, 이는 FR2 및 URLLC 시나리오와 관련이 있고, 잠재적으로 채널 상호성을 가질 수 있다. 하나의 예에서, X=CQI일 때, CRI는 WB 방식으로 보고되고, CQI는 WB 또는 SB 마다(예를 들어, 상위 계층 설정에 기초하여) 보고된다. 이러한 실시예의 변형에서, UE에는 또한 Ng=1개의 TRP(또는 안테나 패널)에 대한 Ng=1개의 CSI-RS 자원 세트가 설정될 수 있다. 이러한 실시예의 다른 변형에서, CRI가 0의 값을 취할 수 있든(즉, 제로 자원 선택을 나타내는 CRI=0, 즉 CRP는 해당 TRP에 대해 보고되지 않음) CRI>0이든 (예를 들어 상위 계층 RRC 또는 동적 DCI 기반의 시그널링을 통해) UE에 설정된다. 이러한 실시예의 다른 변형에서, CRI가 0의 값을 취할 수 있든(즉, CRI=0는 제로 자원 선택을 나타내며, 즉 CSI는 해당 TRP에 대해 보고되지 않음) CRI>0이든 N_g의 값에 의존한다. 예를 들어, Ng>0이면 CRI는 0의 값을 취할 수 있고, Ng=1이면 CRI>0이다. 일 실시예 6B에서, UE는 상술한 실시예 6에서 설명된 바와 같이 Ng>1개의 CSI-RS 자원 세트 또는 Ng>1개의 TRP (또는 안테나 패널)를 측정하도록 설정되고, UE에는 CSI 보고를 위해 \"RI/X\"에 설정된 상위 계층 파라미터 ReportQuantity가 더 설정되며, 그 후 UE는 다음과 같이 각각의 자원 세트(또는 TRP)에 대한 CSI 보고로서 \"RI/X\"를 보고할 수 있다. 각각의 TRP에 대한 CSI 보고는 {RI, X}를 포함하며, 여기서 RI는 0 값을 취할 수 있 다(즉, RI=0은 해당 TRP에 대해 CSI가 보고되지 않는다는 것을 나타냄). RI=0일 때, X는 보고되지 않으며, 즉 RI만이 보고된다. 또한, UE는 모든 N_g TRP에 대해 RI=0을 보고할 수 없다. 다시 말하면, UE는 적어도 하나의 TRP에 대해 RI>0 인 {RI, X}를 보고할 수 있다. 또한, RI는 TRP마다 독립적 또는 TRP에 걸쳐 공동으로 보고될 수 있다. 수량 X는 CQI 또는 CRI/CQI 또는 CRI/CQI/PMI 또는 CRI/CQI/PMI/LI 중 하나이다. 전체 RI(TRP에 걸친 계층의 총 수)는 모든 TRP에 대한 모든 RI의 합과 동일하다. 하나의 예에서, X=CQI일 때, RI는 WB 방식으로 보고되고, CQI는 WB 또는 SB 마다(예를 들어, 상위 계층 설정에 기초하여) 보고된다. 이러한 실시예의 변형에서, UE에는 또한 Ng=1개의 TRP(또는 안테나 패널)에 대한 Ng=1개의 CSI-RS 자원 세트가 설정될 수 있다. 이러한 실시예의 다른 변형에서, RI가 0의 값을 취할 수 있든(즉, RI=0은 해당 TRP에 대해 CSI 가 보고되지 않는다는 것을 나타냄) CRI>0이든 (예를 들어 상위 계층 RRC 또는 동적 DCI 기반의 시그널링을 통 해) UE에 설정된다. 이러한 실시예의 다른 변형에서, RI가 0의 값을 취할 수 있든(즉, RI=0은 해당 TRP에 대해 CSI가 보고되지 않는다는 것을 나타냄) RI>0이든 N_g의 값에 의존한다. 예를 들어, Ng>0이면 RI는 0의 값을 취할 수 있고, Ng=1이면 RI>0이다. 일 실시예 6C에서, UE는 상술한 실시예 6에서 설명된 바와 같이 Ng>1개의 CSI-RS 자원 세트 또는 Ng>1개의 TRP (또는 안테나 패널)를 측정하도록 설정되고, UE에는 CSI 보고를 위해 \"CRI/RI/X\"에 설정된 상위 계층 파라미터 ReportQuantity가 더 설정되며, 그 후 UE는 다음과 같이 각각의 자원 세트(또는 TRP)에 대한 CSI 보고로서 \"CRI/RI/X\"를 보고할 수 있다. 각각의 TRP에 대한 CSI 보고는 {CRI, RI, X}를 포함하며, 여기서 CRI 및 RI는 모두 제로 자원 선택을 나타내는 0 값을 동시에 취할 수 있지만(즉, CRI=RI=0은 제로 자원 선택을 나타내며, 즉 해당 TRP에 대해 CSI가 보고되지 않는다는 것을 나타냄), 이들 중 하나만은 0일 수 없으며, 즉, (CRI, RI)=(0,1) 또는 (1,0)은 보고될 수 없다. 다시 말하면, (CRI, RI)는 a>0 및 b>0인 (0, 0) 또는 (a, b) 중 하나 이다. CRI=RI=0일 때, X는 보고되지 않는다. 즉, (CRI, RI)=(0,0)만이 보고된다. 또한, UE는 모든 Ng TRP에 대 해 CRI=RI=0을 보고할 수 없다. 다시 말하면, UE는 적어도 하나의 TRP에 대해 RI>0 및 CRI>0인 {CRI, RI, X}를 보고할 수 있다. 각각의 TRP에 대해, (CRI, RI)는 보고를 위해 공동으로 인코딩될 수 있다. 또는, CRI와 RI는 별개로 인코딩된다. 또한, (CRI, RI)는 TRP마다 독립적 또는 TRP에 걸쳐 공동으로 보고될 수 있다. 수량 X는 CQI 또는 CQI/PMI 또는 CQI/PMI/LI 중 하나이다. X=CQI일 때, 전체 RI(TRP에 걸친 계층의 총 수)는 모든 TRP에 대한 모든 RI의 합과 동일하다. 하나의 예에서, X=CQI일 때, CRI는 WB 방식으로 보고되고, CQI는 WB 또는 SB 마다(예를 들어, 상위 계층 설정에 기초하여) 보고된다. 이러한 실시예의 변형에서, UE에는 또한 Ng=1개의 TRP(또는 안테나 패널)에 대한 Ng=1개의 CSI-RS 자원 세트가 설정될 수 있다. 이러한 실시예의 다른 변형에서, CRI 및 RI가 0의 값을 취할 수 있든(즉, CRI=RI=0은 제로 자 원 선택을 나타내며, 즉 CSI는 해당 TRP에 대해 보고되지 않음) CRI, RI>0이든 (예를 들어 상위 계층 RRC 또는 동적 DCI 기반의 시그널링을 통해) UE에 설정된다. 이러한 실시예의 다른 변형에서, CRI 및 RI가 0의 값을 취할 수 있든(즉, CRI=RI=0은 제로 자원 선택을 나타내며, 즉 CSI는 해당 TRP에 대해 보고되지 않음) CRI, RI>0이든 Ng의 값에 의존한다. 예를 들어, Ng>0이면 CRI 및 RI는 0의 값을 취할 수 있고, Ng=1이면 CRI, RI>0이다. 일 실시예 7에서, UE는 각각 고정된 포트의 수(예를 들어 1 포트)를 갖는 다수의 CSI-RS 자원(하나의 CSI-RS 자 원 세트 또는 다수의 CSI-RS 자원 세트 중 하나)을 측정하도록 설정되며, 여기서 이들 자원은 프리코딩/빔포밍 이 적용될 수 있다. UE는 다음의 대안들 중 적어도 하나에 따라 (단독으로 또는 CQI, 즉 CRI/CQI와 함께) 다수 의 CRI를 보고하도록 설정된다(1 포트 CSI-RS 자원은 예시만을 위해 이들 대안에서 가정된다). 일 실시예 Alt 7-1에서, 다수의 N>1개의 CRI(CRI_1, CRI_2,…, CRI_N)는 다수가 공간 도메인에서만 고려되고 (즉, N개의 CRI는 N개의 계층에 상응함), 주파수 도메인에서는 고려되지 않도록 보고된다(즉, 보고된 CRI 또는 계층은 광대역임). 다시 말하면, 보고된 N개의 CRI는 WB이고, 보고된 N개의 CRI는 N개의 계층을 나타낸다. 하나의 예 7-1-1에서, N>1개의 CRI는 N>1개의 계층(각각의 계층에 대해 1개의 CRI)을 나타내며, 여기서 계층은 단일 안테나 패널을 사용하여 형성된다(즉, 모든 안테나 포트는 단일 안테나 패널에 속함). 하나의 예 7-1-2에서: N>1개의 CRI는 N>1개의 계층(각각의 계층에 대해 1개의 CRI)을 나타내며, 여기서 N개의 계층은 N개의 안테나 패널(또는 N개의 TRP)을 사용하여 형성된다. 하나의 대안에서, N개의 계층은 N개의 안테나 패널(또는 N개의 TRP)에 일대일로 매핑된다. 다른 대안에서, N개의 계층 중 적어도 하나는 다수의 안테나 패널 (또는 TRP)에 매핑된다. 보고된 CRI의 수는 보고된 RI에 상응한다. RI는 CRI와 함께 보고되거나 보고되지 않을 수 있다. 다수의 CRI는 상술한 실시예 5에서 다음의 대안 중 하나에 따라 보고된다. 하나의 예 Alt 7-2에서, 다수의 M>1개의 CRI(CRI1, CRI2,…, CRIM)는 다수가 공간 도메인에서는 고려되지 않고 (즉, 계층의 수는 보고된 모든 CRI에서 동일함), 주파수 도메인에서만 고려되도록 보고된다(즉, M개의 CRI는 시 스템 대역폭 또는 CSI 보고 대역폭의 M 부분에 상응함). 다시 말하면, 시스템 대역폭 또는 CSI 보고 대역폭의 M 개의 부분의 각각에 대해 1개의 CRI가 보고된다. 하나의 예 7-2-1에서, M개의 CRI는 M개의 대역폭 부분에 일대 일 상응한다(예를 들어, 2개의 CRI는 CRI 대 대역 폭 부분 매핑이 일대일인 2개의 대역폭 부분에 대해 보고됨). 하나의 예 7-2-2에서, M개의 CRI는 M개의 SB에 일 대일 상응한다(예를 들어, CRI는 SB PMI 보고를 대신한다). 하나의 예 Alt 7-3에서, 다수의 NM>1개의 CRI(CRI1,1,CRI1,2,...,CRI1,N,CRI2,1,CRI2,2,...,CRI2,N,...,CRIM,1,CRIM,2,...,CRIM,N)은 다수가 공간 도메인과 주파수 도메인 모두에서 고려되도록 보고된다. 다시 말하면, N개의 CRI는 시스템 대역폭 또는 CSI 보고 대역폭의 M개의 부분의 각각에 대해 보고되며, 여기서 N개의 CRI는 N개의 계층에 상응한다. 변형에서, UE가 (예를 들어, 다수의 gNB/TRP로부터의 일관성 없는 공동 송신을 위해) 다수(Ng)의 gNB/TRP에 대 한 CSI를 보고하도록 설정되고, UE가 공간 도메인에서 다수의 CRI를 보고하도록 더 설정될 때, 실시예 7(Alt 7- 1, Alt 7-3)은 다음의 대안 중 적어도 하나에 따라 확장될 수 있다. 하나의 예 Alt 7A-1에서, 다수의 CRI는 공간 도메인에서 보고되며, 여기서 CRI는 단일 TRP에 상응한다. 하나의 예 Alt 7A-2에서, 다수의 CRI는 공간 도메인에서 보고되고, 여기서 1개의 CRI는 다수의 TRP의 각각에 대해 보고 된다. 하나의 예 Alt 7A-3에서, 다수의 CRI는 공간 도메인에서 보고되며, 여기서 다수의 CRI는 다수의 TRP의 각 각에 대해 보고될 수 있다. 일 실시예 8에서, UE에는 상위 계층 파라미터 SRS-SetUse=\"NonCodeBook\"가 설정되고, 그 후 UE에는 UL MIMO 송 신을 위해 (UL 관련 DCI 시그널링을 통해) 다수의 SRI가 나타내어진다. 다수의 SRI는 CSI-RS 및 CRI가 각각 SRS 및 SRI로 대체되는 것을 제외하고는 본 개시의 일부 실시예(예를 들어, 상술한 실시예 1-7)에 따라 결정되고 나 타내어진다. 예를 들어, UE는 다음의 대안들 중 적어도 하나에 따라 다수의 SRI를 보고한다. 일 실시예 Alt 8-1에서, 상위 계층 파라미터 SRI-FormatIndicator가 단일 WB SRI 보고를 나타내는 경우, 단일 SRI는 전체 CSI 보고 대역에 대해 보고된다(즉, 보고된 SRI는 WB이다). 일 실시예 Alt 8-2에서, 상위 계층 파라미터 SRI-FormatIndicator가 다수의 WB SRI 보고를 나타내는 경우, 다 수의 SRI는 전체 CSI 보고 대역에 대해 보고된다(즉, 보고된 SRI는 WB이다). 일 실시예 Alt 8-3에서, 상위 계층 파라미터 SRI-FormatIndicator가 다수의 SB CRI 보고를 나타내는 경우, 적 어도 하나의 SRI는 CSI 보고 대역의 각각의 부대역에 대해 보고된다(즉, 보고된 SRI는 SB이다). 일례에서, 각각 의 SB에 대해 정확히 하나의 SRI가 보고된다. 다른 예에서, 다수의 SRI는 하나의 SB에서 보고될 수 있다. 또한, 각각의 SB에서의 SRI의 수는 동일할 수 있고(따라서 사실상 WB임), UL 송신을 위한 WB 랭크(TRI) 값을 결정할 수 있다. 대안으로, 각각의 SB에서의 SRI의 수는 하나의 SB에서 다른 SB로 변경될 수 있고(따라서 사실상 SB 임), UL 송신을 위한 SB 랭크(TRI) 값을 결정할 수 있다. 이들 대안들 중 적어도 하나(예를 들어, 상술한 실시예 Alt 8-1 내지 Alt 8-3)는 상위 계층 시그널링(RRC)을 통 해 설정된다는 것을 주목한다. 예를 들어, 시그널링은 파라미터 SRI-FormatIndicator를 통해 이루어질 수 있다. 변형에서, 다수의 SRI를 보고하기 위한 주파수 입도는 다음의 대안 중 적어도 하나에 따른다. 하나의 예 Alt 8- 4에서, 주파수 입도는 부대역 크기와 동일하다. 하나의 예 Alt 8-5에서, 주파수 입도는 부대역 크기보다 작으며, 예를 들어 RB와 동일하다. 하나의 예 Alt 8-6에서, 주파수 입도는 부대역 크기, 예를 들어, 부대역 크 기의 배수보다 크다. 하나의 예 Alt 8-7에서, 주파수 입도는 전체 CSI 보고 대역의 고정된 분수 (fraction)(1/r), 예를 들어 ½ 또는 ¼ 또는 1/8이다. 이들 대안 중 하나는 고정되어 있거나(예를 들어, 상술 한 실시예 Alt 8-4) 또는 (예를 들어, 상위 계층 RRC 시그널링을 통해) 설정되어 있다. 일 실시예 8A에서, 보고된 SRI(또는 SRI들)는 적은 수의 SRS 포트(예를 들어, 1 또는 2)와 연관된 SRS 자원을 나타낸다(또는 SRS 자원을 나타냄). UE에는 상위 계층 시그널링을 통해 NSRS≥1개의 SRS 자원이 설정된다. NSRS=1 일 때, SRI은 보고될 필요가 없다는 것을 주목한다. 하나의 방법에서, 다수의 SRI가 UE에 나타내어질 때에는 NSRS>1이다. 다른 방법에서, 다수의 SRI가 UE에 나타내어질 때에는 NCSI-RS≥1이다. 본 명세서에서는 두 가지 방법 중 하나가 지원될 수 있다. 일 실시예 8B에서, 보고된 SRI(또는 SRI들)는 보고된 SRI에 의해 나타내어진 SRS 자원과 연관된 포트의 수의 합 과 동일한 랭크 값(TRI)을 결정한다. TRI는 다수의 SRI의 인디케이션을 통해 암시적으로 나타내어지므로 TRI 인 디케이션이 필요하지 않다는 것을 주목한다. 일 실시예 8C에서, 각각의 N_SRS SRS 자원과 연관된 포트의 수는 다음의 대안 중 적어도 하나에 따른다. 일 실 시예의 Alt 8C-1에서, 포트의 수는 모든 NSRS 자원에 대해 동일하다. 따라서, 보고된 SRI(또는 SRI들)는 SB에 걸 쳐 변하지 않는 고정된 랭크(TRI)에 상응하며, 즉, 랭크 값은 WB이다. 일 실시예 Alt 8C-2에서, 포트의 수는 자 원마다 상이할 수 있다. 따라서, 다수의 SRI가 보고되면, 랭크(TRI) 가정은 SB에서 다른 것으로 변경될 수 있다. 예를 들어, 하나의 SB의 TRI는 랭크 1에 상응할 수 있고(상응하는 보고된 SRI가 1 포트 자원을 나타내는경우), 다른 SB의 TRI는 랭크 2에 상응할 수 있다(상응하는 보고된 SRI가 2 포트 자원을 나타내는 경우). 다수의 SRI 보고의 하나의 사용 케이스는 UL 데이터의 프리코딩 또는 빔포밍이 무선 주파수(RF) 또는 아날 로그 도메인 및 디지털 또는 기저 대역 도메인이라는 2개의 도메인 중 적어도 하나에 있는 경우이다. NSRS SRS 자원은 NSRS 빔포밍 벡터를 사용하여 빔포밍이 적용될 수 있다. 이들 빔포밍 벡터는 (UL-DL 상호성에 따라) gNB에 의해 송신되는 DL RS(예를 들어, CSI-RS)를 측정함으로써 UE에 의해 획득될 수 있다. 이러한 시스템의 예 로는 고주파(예컨대, 밀리미터 파) 시스템이 있다. 다른 사용 케이스는 gNB가 (예를 들어, DCI에서) 다음의 두 가지 UL 관련 CSI 보고를 나타내는 하이브리드 CSI 이다. 일례에서, 제1 UL 관련 CSI 보고는 서브스페이스 또는 후보 빔포밍 벡터의 세트에 관한 정보를 나타내는 장기 및 WB UL CSI를 포함한다. 서브스페이스 보고의 예는 DFT 빔의 세트를 나타내는 i1 전용 보고이다. 일례에 서, 제2 CSI는 본 실시예(실시예 8)에 제공된 바와 같은 SRI를 포함한다. 이러한 제2 UL 관련 CSI 보고를 위한 SRS 자원은 제1 CSI 보고에서 보고된 서브스페이스 또는 후보 빔포밍 벡터의 세트를 사용하여 빔포밍이 적용되 거나 프리코딩된다. (프리코딩이 적용되지 않거나 빔포밍이 적용되지 않은 SRS 및 TPMI UL 코드북을 사용하는) 다수의 TPMI 보고에 비해 (빔포밍이 적용된 SRS를 사용하는) 다수의 SRI 보고의 몇몇 장점/이점은 다음과 같다. 일례에서, 제1 장점 은 다수의 SRI 보고가 다수의 TPMI 보고에 비해 성능 이득을 보일 것으로 예상되는 성능 이득 측면에서 있다. 이것은 빔포밍이 적용된 SRS가 프리코딩이 적용되지 않은 SRS와 비교할 때 gNB에서 더 많은 SINR을 달성할 수 있기 때문이다. 일례에서, 제2 장점은 임의의 빔포밍 또는 프리코딩 벡터가 SRS 자원을 빔포밍하는데 사용될 수 있다는 것이다. 특히, 이들 자원을 빔포밍하기 위해 TPMI UL 코드북과 같은 코드북에 의존할 필요가 없다. 일례 에서, 제3 장점은 다수의 SRI가 DCI에서 다수의 TPMI를 나타내는 오버헤드와 비교할 때 DCI 오버헤드(비트)를 감소시킬 수 있다는 것이다. 일 실시예 9에서, 실시예 2의 RI 보고 대안은 (예를 들어 DCI에서 SRI 및 TRI에 대한 공동 필드를 통해) 암시적 으로 또는 (예를 들어, DCI에서의 별개의 필드를 통해) 명시적으로 (예를 들어, DCI 시그널링을 통해) TRI 인디 케이션을 보고하도록 확장된다(적용 가능하다). 상술한 실시예 8 및 9의 변형인 일 실시예 10에서, 각각의 SRS 자원은 고정된 수(N)의 포트와 설정/연관된다. 예를 들어, N=1 또는 2이다. 따라서, 보고된 SRI는 N의 배수인 랭크 값(TRI)에 상응하며, 즉, 랭크 값은 {N, 2N, 3N,…}에 속한다. 랭크 값(TRI)은 보고되거나 보고되지 않을 수 있다. TRI가 보고되면, 상술한 실시예 9의 예들 중 하나에 따라 TRI가 보고된다. 2개의 예는 다음과 같다. 하나의 예 10-1에서, N=1이고, 가능한 계층의 수(또는 랭크 값, TRI)는 {1, 2,…}에 속한다. 하나의 예 10-2에서, N=2이고, 가능한 계층의 수(또는 랭크 값, TRI)는 {2, 4,…}에 속한다. 일 실시예 11에서, (예를 들어 DCI를 통해) 다수의 SRI가 UE에 나타내어질 때, 나타내어진 SRI가 2개의 구성 요 소를 포함하는 이중 스테이지 구조를 갖는 것을 제외하고 본 개시의 상술한 실시예 8 내지 10에서 설명된 바와 같이 다수의 CRI가 UE에 나타내어진다. WB SRI 구성 요소의 일례에서, SRS 자원의 그룹 또는 서브세트를 나타내 는 단일 SRI는 전체 CSI 보고 대역에 대해 보고된다. SB SRI 구성 요소의 일례에서, 하나의 SRI는 CSI 보고 대 역의 각각의 부대역에 대해 보고되며, 여기서 보고된 SRI는 WB SRI 구성 요소에 의해 나타내어진 SRS 자원의 그 룹 또는 서브세트의 SRS 자원을 나타낸다. 이는 WB PMI(i1) 및 다수의 SB PMI(i2)를 보고하는 이중 스테이지 W1W2 PMI 코드북과 유사하다. 일 실시예에서, 이중 스테이지 SRI는 각각의 SRS 자원의 포트의 수가 고정된 값, 예를 들어 2 또는 4보다 클 때 에만 나타내어진다. 다른 방법에서, 하나의 SRI(단일 스테이지) 또는 이중 스테이지 SRI를 나타내는지는 (예를 들어, 상위 계층 RRC 시그널링을 통해) UE에 나타내어진다. 하나의 예 11-1에서, UE에는 Ks>1개의 SRS 자원 세트가 설정되고, UE에는 KS개의 SRS 자원 세트 중 하나의 SRS 자원 세트를 나타내기 위해(선택하기 위해) WB CRI가 나타내어지고, 또한 각각의 SB가 보고된 SRS 자원 세트에 서 NSRS,s개의 SRS 자원 중 하나의 SRS 자원을 나타내기 위해(선택하기 위해) 하나의 SRI가 나타내어진다. 하나의 예 11-2에서, UE에는 T 그룹으로 그룹화되는(예를 들어, 고정된 그룹화 또는 순차적 그룹화) Ks=1개의 SRS 자원 세트가 설정된다. UE에는 설정된 자원 세트 내의 T SRS 자원 그룹 중 하나의 SRS 자원 그룹(t)을 나타 내기 위해(선택하기 위해) WB SRI가 나타내어지고, 또한 각각의 SB가 보고된 SRS 자원 그룹(t)에서 NSRS,t개의SRS 자원 중 하나의 SRS 자원을 나타내기 위해(선택하기 위해) 하나의 SRI가 나타내어진다. 일 실시예 12에서, UE는 DL CSI 획득/보고를 위해 NRS>1개의 DL 자원을 포함하는 DL 자원 세트를 측정하도록 (예를 들어 RRC를 통해) 설정된다. UE는 설정된 DL 자원 세트에서의 하나 또는 다수의 DL 자원을 나타내는 단일 또는 다수의 DL 자원 지시자(DL resource indicator, DRI 또는 DRI들)를 보고하도록 (예를 들어 RRC를 통해) 더 설정된다. DL RS의 예는 CSI-RS이며, 이 경우에 DRI는 CRI에 상응한다. 일 실시예 12A에서, UE는 각각이 DL CSI 획득/보고를 위해 NRS>1개의 DL 자원을 포함하는 다수의 DL 자원 세트 를 측정하도록 (예를 들어 RRC를 통해) 설정된다. UE는 설정된 DL 자원 세트에서의 하나 또는 다수의 DL 자원을 나타내는 단일 또는 다수의 DL 자원 지시자(DRI 또는 DRI들)를 보고하도록 (예를 들어 RRC를 통해) 더 설정된다. DL RS의 예는 CSI-RS이며, 이 경우에 DRI는 CRI에 상응한다. 일 실시예 13에서, UE는 UL CSI 획득을 위해 NRS>1개의 UL 자원을 포함하는 UL 자원 세트를 송신하도록 (예를 들어 RRC를 통해) 설정된다. 그 후, UE에는 설정된 UL 자원 세트에서의 하나 또는 다수의 UL 자원을 나타내는 단일 또는 다수의 UL 자원 지시자(URI 또는 URI들)가 (예를 들어 DCI를 통해) 나타내어진다. UL RS의 예는 SRS 이며, 이 경우에 URI는 URI에 상응한다. 일 실시예 13A에서, UE는 각각이 UL CSI 획득을 위해 NRS>1개의 UL 자원을 포함하는 다수의 UL 자원 세트를 송 신하도록 (예를 들어 RRC를 통해) 설정된다. 그 후, UE에는 설정된 UL 자원 세트에서의 하나 또는 다수의 UL 자 원을 나타내는 단일 또는 다수의 UL 자원 지시자(URI 또는 URI들)가 (예를 들어 DCI를 통해) 나타내어진다. UL RS의 예는 SRS이며, 이 경우에 URI는 URI에 상응한다. 도 12는 사용자 장치(UE)에 의해 수행될 수 있는 바와 같이 본 개시의 실시예에 따른 CSI 획득 방법의 흐 름도를 도시한다. 도 12에 도시된 방법의 실시예는 단지 예시를 위한 것이다. 도 12는 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 12에 도시된 바와 같이, 방법은 단계에서 시작한다. 단계에서, UE(예를 들어, 도 1에 도 시된 바와 같은 111-116)는 (N) TRP 그룹의 적어도 하나의 송수신 포인트(TRP)로부터 채널 상태 정보(CSI) 설정 정보를 수신한다. 단계에서, UE는 CSI 설정 정보에 기초하여 CSI 보고를 결정한다. 이러한 단계에서, 결정된 CSI 보고는 (N) TRP 그룹의 (M) TRP를 선택하기 위한 TRP 지시자를 포함한다. 일 실시예에서, CSI 보고는 선택된 (M) TRP의 각각에 대한 CSI를 더 포함한다. 이러한 실시예에서, N은 1보다 크고, 여기서 M은 1 이상이고, N 이하이다. 일 실시예에서, CSI 보고는 CSI 보고를 위해 선택된 다수(M)의 TRP를 더 포함한다. 일 실시예에서, CSI 설정 정 보는 CSI 보고를 위해 선택된 다수(M)의 TRP를 포함한다. 일 실시예에서, CSI 보고는 N1 TRP에 대한 CSI를 포함하는 CSI1 및 N2 TRP에 대한 CSI를 포함하는 CSI2로 분할 된다. 일 실시예에서, CSI 보고는 UCI1 및 UCI2의 두 부분을 포함하는 업링크 제어 정보(UCI)를 통해 송신된다. 이러 한 실시예에서, N1은 M의 값에 관계없이 1 이상의 고정된 수이고, N2는 0 이상이고, M-N1과 동일하다. 일 실시예에서, UCI1은 UCI2에 대한 다수의 정보 비트를 나타내기 위한 CSI1 및 UCI 지시자를 포함하고, 정보 비트의 수의 측면에서의 UCI1 송신의 페이로드는 고정되고, UCI2, 및 정보 비트의 수의 측면에서의 UCI2 송신의 페이로드는 가변적이다. 일 실시예에서, UCI2의 정보 비트의 수를 나타내기 위한 UCI 지시자는 길이 N의 비트맵 b1b2… bN을 포함한다. 이러한 실시예에서, 비트맵은 M개의 1(one) 및 N-M개의 0(zero)을 포함한다. 이러한 실시예에서, 제i TRP에 대 한 CSI는 bi가 0으로 설정될 때 결정된 CSI 보고에 포함되지 않고, 제i TRP에 대한 CSI는 bi가 1로 설정될 때 결정된 CSI 보고에 포함된다. 일 실시예에서, UE는 N개의 CSI-RS(CSI-reference signal) 자원 세트를 측정하고, (N) TRP 그룹 각각에 대해 하나의 세트를 측정한다. 일 실시예에서, UE는 CSI 설정 정보에 기초하여 CSI 보고가 N개의 CSI-RS 자원 세트의 M을 나타내는 CSI-RS 자 원 지시자(CRI) 및 M개의 CSI-RS 자원의 각각에 대한 CSI를 포함하는 것으로 결정한다.일 실시예에서, CRI는 N개의 구성 요소인 CRI1, CRI2,… 및 CRIN을 포함하고, 이들 중 M은 0보다 크고, 나머지 N-M은 0이다. 이러한 실시예에서, 제i CSI-RS 자원 세트에 대한 CSI는 CRIi가 0으로 설정될 때 결정된 CSI 보고 에 포함되지 않으며; 제i CSI-RS 자원 세트에 대한 CSI는 CRIi가 0보다 클 때 결정된 CSI 보고에 포함되며, CSI 는 채널 품질 지시자(CQI), 랭크 지시자(RI), 프리코딩 매트릭스 지시자(PMI) 또는 계층 지시자(LI) 중 적어도 하나를 포함한다. 단계에서, UE는 설정 정보에 기초하여, 결정된 CSI 보고를 송신하기 위해 (N) TRP 그룹의 하나 이상의 TRP를 식별한다. 단계에서, UE는 결정된 CSI 보고를 업링크 채널을 통해 하나 이상의 TRP로 송신한다. 일 실시예에서, 단계에서 UE는 각각의 M개의 CSI-RS 자원에 대한 CRI 및 CSI를 포함하는 결정된 CSI 보고 를 하나 이상의 선택된 TRP로 더 송신한다. 도 13은 TRP(transmission/reception point)에 의해 수행될 수 있는 바와 같이 본 개시의 실시예들에 따른 CSI 획득을 위한 다른 방법의 흐름도를 도시한다. 도 13에 도시된 방법의 실시예는 단지 예시를 위한 것이다. 도 13은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 13에 도시된 바와 같이, 방법은 단계에서 시작한다. 단계에서, TRP(예를 들어,도 1에 도 시된 바와 같은 101-103)는 사용자 장치(UE), 채널 상태 정보(CSI) 설정 정보를 송신하며, 여기서 TRP는 (N) TRP 그룹의 적어도 하나의 TRP이다. 단계에서, CSI 설정 정보는 CSI 보고를 위해 다수(M)의 선택된 TRP를 포함한다. 단계에서, TRP는 UE로부터 업링크 채널을 통해 CSI 보고를 수신한다. 단계에서, CSI 보고는 CSI 설 정 정보에 기초하여 결정된다. 일 실시예에서, CSI 보고는 (N) TRP 그룹의 (M) TRP를 선택하기 위한 TRP 지시자 및 선택된 (M) TRP의 각각에 대한 CSI를 포함한다. 이러한 실시예에서, N은 1보다 크고, M은 1 이상이고, N 이 하이다. 일 실시예에서, CSI 보고는 CSI 보고를 위해 다수(M)의 선택된 TRP를 더 포함한다. 일 실시예에서, CSI 보고는 N1 TRP에 대한 CSI를 포함하는 CSI1 및 N2 TRP에 대한 CSI를 포함하는 CSI2로 분할 된다. 일 실시예에서, CSI 보고는 UCI1 및 UCI2의 두 부분을 포함하는 업링크 제어 정보(UCI)를 통해 송신된다. 이러 한 실시예에서, N1은 M의 값에 관계없이 1 이상의 고정된 수이고, N2는 0 이상이고, 1은 M-N1과 동일하다. 이러 한 실시예에서, UCI1은 UCI2에 대한 다수의 정보 비트를 나타내기 위한 CSI1 및 UCI 지시자를 포함하고, 정보 비트의 수의 측면에서의 UCI1 송신의 페이로드는 고정된다. 이러한 실시예에서, UCI2는 CSI2를 포함하고, 정보 비트의 수의 측면에서의 UCI2 송신의 페이로드는 가변적이다. 일 실시예에서, UCI2의 정보 비트의 수를 나타내기 위한 UCI 지시자는 길이 N의 비트맵 b1b2… bN을 포함한다. 이러한 실시예에서, 비트맵은 M개의 1 및 N-M개의 0을 포함한다. 일 실시예에서, 제i TRP에 대한 CSI는 bi가 0으로 설정될 때 결정된 CSI 보고에 포함되지 않는다. 일 실시예에서, 제i TRP에 대한 CSI는 bi가 1로 설정될 때 결정된 CSI 보고에 포함된다. 단계에서, TRP는 UE로부터 CSI-RS 자원 지시자(CRI) 및 M개의 CSI-RS 자원의 각각에 대한 CSI를 포함하 는 결정된 CSI 보고를 더 수신한다. 일 실시예에서, CSI 보고는 N개의 CSI-RS 자원 세트 중 M개를 나타내는 CRI, 및 M개의 CSI-RS 자원의 각각에 대 한 CSI를 포함한다. 이러한 실시예에서, N개의 CRI 자원 세트에는 UE에 의해 (N) TRP 그룹의 각각에 대해 하나 의 세트가 측정된다. 일 실시예에서, CRI는 N개의 구성 요소인 CRI1, CRI2,… 및 CRIN을 포함하고, 이들 중 M은 0보다 크고, 나머지 N-M은 0이다. 이러한 실시예에서, 제i CSI-RS 자원 세트에 대한 CSI는 CRIi가 0으로 설정될 때 결정된 CSI 보고 에 포함되지 않고, 제i CSI-RS 자원 세트에 대한 CSI는 CRIi가 0보다 클 때 결정된 CSI 보고에 포함된다. 이러한 실시예에서, CSI는 채널 품질 지시자(CQI), 랭크 지시자(RI), 프리코딩 매트릭스 지시자(PMI) 또는 계층 지 시자(LI) 중 적어도 하나를 포함한다. 본 개시가 예시적인 실시예로 설명되었지만, 다양한 변경 및 수정이 통상의 기술자에게 제시될 수 있다. 본 개 시는 첨부된 청구항의 범주 내에 속하는 이러한 변경 및 수정을 포함하는 것으로 의도된다. 본 출원에서의 설명은 임의의 특정 요소, 단계 또는 기능이 청구 범위에 포함되어야 하는 필수 요소임을 암시하 는 것으로 해석되지 않아야 한다. 특허된 주제(patented subject matter)의 범위는 청구항에 의해서만 정의된다. 더욱이, 어떠한 청구항도 정확한 단어 \"위한 수단(means for)\" 다음에 분사(participle)가 따르지 않 으면 35 U.S.C.§ 112(f)를 행사하도록 의도되지 않는다."}
{"patent_id": "10-2020-7017436", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시 및 그 이점에 대한 더욱 완전한 이해를 위해, 동일한 도면 부호가 동일한 부분을 나타내는 첨부된 도면 과 연관하여 취해진 다음의 설명에 대한 참조가 이제 이루어진다. 도 1은 본 개시의 실시예에 따른 예시적인 무선 네트워크를 도시한다. 도 2는 본 개시의 실시예에 따른 예시적인 eNB를 도시한다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 4a는 본 개시의 실시예에 따른 직교 주파수 분할 다수의 액세스 송신 경로의 하이 레벨 다이어그램을 도시한 다. 도 4b는 본 개시의 실시예에 따른 직교 주파수 분할 다수의 액세스 수신 경로의 하이 레벨 다이어그램을 도시한 다. 도 5는 본 개시의 실시예에 따른 서브프레임에서의 PDSCH에 대한 송신기 블록도를 도시한다. 도 6은 본 개시의 실시예에 따른 서브프레임에서의 PDSCH에 대한 수신기 블록도를 도시한다. 도 7은 본 개시의 실시예에 따른 서브프레임에서의 PUSCH에 대한 송신기 블록도를 도시한다. 도 8은 본 개시의 실시예에 따른 서브프레임에서의 PUSCH에 대한 수신기 블록도를 도시한다. 도 9는 본 개시의 실시예에 따른 2개의 슬라이스의 예시적인 다중화(multiplexing)를 도시한다. 도 10은 본 개시의 실시예에 따른 예시적인 안테나 블록을 도시한다. 도 11은 본 개시의 실시예에 따른 예시적인 네트워크 구성을 도시한다.도 12는 본 개시의 실시예에 따른 CSI 획득 방법의 흐름도를 도시한다. 도 13은 본 개시의 실시예에 따른 CSI 획득을 위한 다른 방법의 흐름도를 도시한다."}
