{"patent_id": "10-2020-0107208", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0026322", "출원번호": "10-2020-0107208", "발명의 명칭": "증강 현실을 위한 타겟 장치 인식 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "최준수"}}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 디스플레이 모듈;카메라 모듈;통신 모듈; 및상기 카메라 모듈, 상기 디스플레이 모듈 및 상기 통신 모듈과 작동적으로 연결된 프로세서를 포함하고, 상기프로세서는,상기 카메라 모듈을 통해 획득된 이미지를 상기 통신 모듈을 통해 외부 장치로 전송하고,상기 통신 모듈을 통해 상기 외부 장치로부터 적어도 하나의 객체를 포함하는 AR(augmented reality) 이미지를수신하여 상기 디스플레이 모듈을 통해 표시하고,상기 적어도 하나의 객체 중에서 타겟 객체를 인식하고,상기 통신 모듈을 통해 데이터 통신 링크(data communication link) 상에서 검색된 주변 장치들 중 하나를 상기인식된 타겟 객체에 대응하는 타겟 장치로 매핑하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는,상기 AR 이미지 상에서 상기 타겟 객체에 대해 거리 및 방향을 추정하고,상기 데이터 통신 링크 상의 상기 타겟 장치로부터의 신호가, 상기 추정된 거리 및 방향으로부터 수신되는지 식별하고,상기 타겟 장치로부터의 신호가 상기 추정된 거리 및 방향으로부터 수신되는 경우, 상기 타겟 객체와 상기 타겟장치를 매핑하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 프로세서는,지정된 제1 추정 알고리즘을 적용하여 상기 타겟 장치에 대한 도래각(AoA, angle of arrival) 추정을 위한 제1동작을 수행하고,제1 동작의 수행에 따른 추정 결과에 기반하여 지정된 제2 추정 알고리즘을 적용하여 상기 도래각 추정을 위한제2 동작을 수행하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 프로세서는,상기 타겟 장치로부터 송신된 신호에 기반하여 CIR(channel impulse response) 탭 선택을 수행하도록 설정된 전자 장치.공개특허 10-2022-0026322-3-청구항 5 제4항에 있어서, 상기 프로세서는,상기 신호에 대하여 일정한 인터벌로 샘플링된 복수의 탭들 중에서, 도래각 추정에 사용할 관심 탭을 선택하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 관심 탭은, 상기 AR 이미지 상에서 추정된 거리를 기반으로, 해당 거리를 전자기파의 속도로 나눈 값에 대응하는 탭을 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 프로세서는,상기 관심 탭에 제1 추정 알고리즘을 적용하여 복수의 출력을 생성하고,상기 복수의 출력에 제2 추정 알고리즘을 적용하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제1 추정 알고리즘은, 빔포밍(beamforming)에 의하여 특정 방향의 신호를 추정하기 위한 알고리즘을 포함하고, 상기 제2 추정 알고리즘은, 지정된 신호와 잡음을 분리하기 위한 알고리즘을 포함하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "전자 장치에 있어서,카메라 모듈;디스플레이 모듈; 통신 모듈; 및상기 카메라 모듈, 상기 디스플레이 모듈 및 상기 통신 모듈과 작동적으로 연결된 프로세서를 포함하고, 상기프로세서는,상기 카메라 모듈을 통해 획득된 이미지를 상기 통신 모듈을 통해 외부 전자 장치로 전송하고,상기 외부 전자 장치로부터 상기 전송한 이미지에 기반한 AR(augmented reality) 이미지를 수신하고,상기 수신된 AR 이미지를 상기 디스플레이 모듈을 통해 표시하고,상기 디스플레이 모듈을 통해 표시된 상기 AR 이미지 상에서 타겟 객체에 대해 추정된 거리 및 방향에 기반하여탭 선택을 수행하고, 상기 통신 모듈의 복수의 안테나들에 기반하여 분할된 안테나 서브셋(antenna subset) 단위로 상기 추정된 거리및 방향을 이용하여 제1 추정 알고리즘을 적용하고,상기 안테나 서브셋에 대해 상기 제1 추정 알고리즘을 적용하여 획득된 출력(output)에 대해 제2 추정 알고리즘을 적용하여 도래각(AoA, angle of arrival)을 추정하도록 설정된 전자 장치.공개특허 10-2022-0026322-4-청구항 10 제9항에 있어서, 상기 제1 추정 알고리즘은, 빔포밍(beamforming)에 의하여 특정 방향의 신호를 추정하기 위한 알고리즘을 포함하고, 상기 제2 추정 알고리즘은, 지정된 신호와 잡음을 분리하기 위한 알고리즘을 포함하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 프로세서는,상기 카메라 모듈을 통해 획득되어 상기 디스플레이 모듈을 통해 표시된 상기 이미지 상에서 상기 타겟 객체를인식하고, 인식된 타겟 객체와의 거리 및 방향을 추정하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 프로세서는,일정한 인터벌(interval)로 샘플링(sampling)된 복수의 탭들 중, 상기 이미지 상에서 추정된 거리 및 방향에 대응하는 탭을 상기 도래각 추정에 사용될 관심 탭으로 선택하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 프로세서는,상기 선택된 관심 탭을 상기 제1 추정 알고리즘 적용을 위한 입력(input)으로 제공하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서, 상기 프로세서는, 상기 복수의 안테나들에 기반하여 지정된 개수의 안테나를 포함하는 상기 안테나 서브셋을 생성하도록 설정된전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 프로세서는,상기 안테나 서브셋이 최대 수를 가지도록, 상기 안테나 서브셋 각각에서 적어도 하나의 안테나를 중첩하여 상기 안테나 서브셋을 생성하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 프로세서는,상기 안테나 서브셋에 상기 제1 추정 알고리즘을 적용하여, 상기 안테나 서브셋의 수에 대응하는 복수의 출력을생성하도록 설정된 전자 장치.공개특허 10-2022-0026322-5-청구항 17 제16항에 있어서, 상기 프로세서는,상기 복수의 출력에 대하여 상기 제2 추정 알고리즘을 적용하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 프로세서는,상기 복수의 출력에 대하여 신호 서브스페이스(signal subspace)를 이루는 고유 벡터(eigenvector)들과 잡음에의한 서브스페이스를 이루는 고유 벡터들을 분리하고,상기 신호 서브스페이스에 기반하여 상기 도래각 추정을 완료하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치의 동작 방법에 있어서,상기 전자 장치의 카메라 모듈을 통해 이미지를 획득하는 동작;상기 획득된 이미지의 적어도 일부를 통신 모듈을 통해 외부 전자 장치로 전송하는 동작;상기 외부 전자 장치로부터 상기 전송한 이미지에 기반한 적어도 하나의 객체를 포함하는 AR(augmentedreality) 이미지를 수신하는 동작;상기 전자 장치의 디스플레이 모듈을 통해 AR 이미지를 표시하는 동작;상기 적어도 하나의 객체 중에서 타겟 객체를 인식하는 동작;상기 통신 모듈을 통해 데이터 통신 링크(data communication link) 상에서 검색된 주변 장치들 중 하나를 상기인식된 타겟 객체에 대응하는 타겟 장치로 매핑하는 동작을 포함하는 방법."}
{"patent_id": "10-2020-0107208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 매핑하는 동작은,상기 AR 이미지 상에서 상기 타겟 객체에 대해 거리 및 방향을 추정하는 동작,상기 데이터 통신 링크 상의 상기 타겟 장치로부터의 신호가, 상기 추정된 거리 및 방향으로부터 수신되는지 식별하는 동작,상기 타겟 장치로부터의 신호가 상기 추정된 거리 및 방향으로부터 수신되는 경우, 상기 타겟 객체와 상기 타겟장치를 매핑하는 동작을 포함하는 방법."}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 실시예들에 따른 전자 장치는, 디스플레이 모듈, 카메라 모듈, 통신 모듈, 및 프로세서를 포함 하고, 상기 프로세서는, 상기 카메라 모듈을 통해 획득된 이미지를 상기 통신 모듈을 통해 외부 장치로 전송하고, 상기 통신 모듈을 통해 상기 외부 장치로부터 적어도 하나의 객체를 포함하는 AR 이미지를 수신하여 상기 디스플레이 모듈을 통해 표시하고, 상기 적어도 하나의 객체 중에서 타겟 객체를 인식하고, 상기 통신 모듈 을 통해 데이터 통신 링크(data communication link) 상에서 검색된 주변 장치들 중 하나를 상기 인식된 타겟 객 체에 대응하는 타겟 장치로 매핑할 수 있다. 다양한 실시예들이 가능하다."}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 증강 현실(AR, augmented reality)에서 전자 장치가 주변의 외부 장치 중 타겟 장 치(target device)의 인식 정확성을 높일 수 있는 방법 및 장치에 관하여 개시한다."}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 가상 현실(VR, virtual reality), 증강 현실(AR, augmented reality) 및/또는 혼합 현실(MR, mixed reality)과 같은 확장 현실(XR, expended reality) 기술에 대한 연구 및 개발이 진행되고 있다. 최근에는 VR, AR 및/또는 MR 기술을 다양한 분야(예: 엔터테인먼트(entertainment), 인포테인먼트(infotainment), 스마트 홈 (smart home) 및/또는 스마트 팩토리(smart factory) 분야)에서 다양하게 활용하고 있으며, 이를 위한 전자 장치의 하드웨어적인 부분 및/또는 소프트웨어적인 부분이 지속적으로 연구 및 개발되고 있다. 예를 들면, 웨어러 블 유리 장치(예: AR 글래스(glasses) 또는 스마트 글래스(smart glasses)), 헤드 마운트 장치(예: HMD, head mounted display) 또는 스마트 폰은 단독 또는 적어도 둘 이상의 장치들 간에 서로 연동하여, AR 서비스에 관련 된 어플리케이션을 통해 현실 세계 위에 다양한 디지털 컨텐츠(digital contents)(예: 가상 이미지)를 겹쳐서 (또는 오버레이(overlay)하여) 디스플레이를 통해 하나의 영상으로 제공할 수 있다. 일 실시예에 따라, AR 서비스를 위해서는 AR 장치가 디스플레이의 화면 상에서 인식된 장치가, 장치들 간에 통 신 모듈을 통해 작동적으로 연결되는 데이터 통신 링크(data communication link) 상에서 인식된 여러 외부 장 치(또는 주변 장치)들 중 어떤 타겟 장치(target device)에 해당하는지를 인식할 수 있어야 한다. 예를 들면, AR 장치는 데이터 통신 링크 상에서 외부 장치에 대하여 높은 정확도로 거리 정보 및 방향 정보를 특정할 수 있 어야 한다."}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "하지만, 일반적인 실내 환경(indoor environment)에서는 AR 장치와 타겟 장치 간의 데이터 통신 링크가 물리적 으로 멀티 패스(multi-path)를 통해 형성될 수 있으며, 이로 인해, 실내 환경에서 타겟 장치의 거리 및 방향 특 정에 정확도가 낮아질 수 있다. 예를 들면, 실내 환경에서는 멀티 패스의 영향을 받는 데이터 통신 링크 상에서 도래각(AoA, angle of arrival) 추정의 정확도가 낮을 수 있다. 일반적으로, 도래각 추정에 있어서, 전자 장치 의 안테나(antenna) 수에 비례하여 정밀도를 향상시킬 수 있다. 예를 들면, 멀티 패스의 수 대비 안테나의 수가 많은 경우, 대략적으로 신뢰도 있는 도래가 추정이 가능할 수 있다. 일반적으로, 실내 환경에서는 데이터 통신 링크가 매우 많은 수의 멀티 패스를 통해 형성될 수 있으며, 따라서 도래각 추정에 있어서 매우 많은 수의 안테 나를 필요로 할 수 있다. 하지만, 전력 소모, 디자인, 크기, 및/또는 무게와 같은 다양한 제약을 받는 전자 장 치의 경우 많은 수의 안테나를 구현하는데 어려움이 있을 수 있다. 다양한 실시예들에서는, AR(augmented reality)에서 타겟 장치 인식을 위하여, 데이터 통신 링크(data communication link) 상에서 타겟 장치의 거리 및 방향을 높은 정밀도로 추정할 수 있는 방법 및 장치에 관하여 개시한다. 다양한 실시예들에서는, 전자 장치의 디스플레이의 AR 화면 상에서 인식된 타겟 객체(예: 실질적 타겟 장치)와 의 거리 정보 및 방향 정보를, 데이터 통신 링크 상에서 타겟 장치와의 거리 정보 및 방향 정보를 추정하는데 이용하여, 도래각 추정의 정확도를 높일 수 있는 방법 및 장치에 관하여 개시한다."}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 전자 장치는, 디스플레이 모듈, 카메라 모듈, 통신 모듈, 및 상기 카메라 모듈, 상 기 디스플레이 모듈 및 상기 통신 모듈과 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 카메 라 모듈을 통해 획득된 이미지를 상기 통신 모듈을 통해 외부 장치로 전송하고, 상기 통신 모듈을 통해 상기 외 부 장치로부터 적어도 하나의 객체를 포함하는 AR(augmented reality) 이미지를 수신하여 상기 디스플레이 모듈 을 통해 표시하고, 상기 적어도 하나의 객체 중에서 타겟 객체를 인식하고, 상기 통신 모듈을 통해 데이터 통신 링크(data communication link) 상에서 검색된 주변 장치들 중 하나를 상기 인식된 타겟 객체에 대응하는 타겟 장치를 매핑할 수 있다. 본 개시의 일 실시예에 따른 전자 장치는, 카메라 모듈, 디스플레이 모듈, 통신 모듈, 및 상기 카메라 모듈, 상 기 디스플레이 모듈 및 상기 통신 모듈과 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는, 상기 카메 라 모듈을 통해 획득된 이미지를 상기 통신 모듈을 통해 외부 전자 장치로 전송하고, 상기 외부 전자 장치로부 터 상기 전송한 이미지에 기반한 AR(augmented reality) 이미지를 수신하고, 상기 수신된 AR 이미지를 상기 디 스플레이 모듈을 통해 표시하고, 상기 디스플레이 모듈을 통해 표시된 상기 AR 이미지 상에서 타겟 객체에 대해 추정된 거리 및 방향에 기반하여 탭 선택을 수행하고, 상기 통신 모듈의 복수의 안테나들에 기반하여 분할된 안 테나 서브셋(antenna subset) 단위로 상기 추정된 거리 및 방향을 이용하여 제1 추정 알고리즘을 적용하고, 상 기 안테나 서브셋에 대해 상기 제1 추정 알고리즘을 적용하여 획득된 출력(output)에 대해 제2 추정 알고리즘을 적용하여 도래각(AoA, angle of arrival)을 추정할 수 있다. 본 개시의 일 실시예에 따른 전자 장치의 동작 방법은, 전자 장치의 카메라 모듈을 통해 이미지를 획득하는 동 작, 상기 획득된 이미지의 적어도 일부를 통신 모듈을 통해 외부 전자 장치로 전송하는 동작, 상기 외부 전자장치로부터 상기 전송한 이미지에 기반한 적어도 하나의 객체를 포함하는 AR(augmented reality) 이미지를 수신 하는 동작, 상기 전자 장치의 디스플레이 모듈을 통해 AR 이미지를 표시하는 동작, 상기 적어도 하나의 객체 중 에서 타겟 객체를 인식하는 동작, 상기 통신 모듈을 통해 데이터 통신 링크(data communication link) 상에서 검색된 주변 장치들 중 하나를 상기 인식된 타겟 객체에 대응하는 타겟 장치로 매핑하는 동작을 포함할 수 있다. 상기와 같은 과제를 해결하기 위하여 본 개시의 다양한 실시예들에서는, 상기 방법을 프로세서에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 판독 가능한 기록 매체를 포함할 수 있다. 본 개시의 적용 가능성의 추가적인 범위는 이하의 상세한 설명으로부터 명백해질 것이다. 그러나 본 개시의 사 상 및 범위 내에서 다양한 변경 및 수정은 당업자에게 명확하게 이해될 수 있으므로, 상세한 설명 및 본 개시의 바람직한 실시예와 같은 특정 실시예는 단지 예시로 주어진 것으로 이해되어야 한다."}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예들에 따른 전자 장치 및 그의 동작 방법에 따르면, 전자 장치가 AR(augmented reality) 서비스 제 공 시에, 타겟 장치의 거리 및 방향을 높은 정밀도로 추정할 수 있다. 다양한 실시예들에 따르면, 전자 장치의 디스플레이의 AR 화면 상에서 인식된 타겟 객체(예: 실질적 타겟 장 치)와의 거리 정보 및 방향 정보를 이용하여, 데이터 통신 링크(data communication link) 상에서 타겟 장치와 의 거리 정보 및 방향 정보를 정확하게 추정할 수 있다. 다양한 실시예들에 따르면, 전자 장치와 타겟 장치 간의 데이터 통신 링크가 물리적으로 멀티 패스(multi- path)로 형성되는 실내 환경(indoor environment)에서 타겟 장치와의 거리 및 방향을 정확하게 특정하여, 도래 각 추정의 정확성을 향상할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 안테나 수에 제약되지 않으면서(예: 안테나의 수가 적은 경우에도), 신 뢰도 높은 도래각 추정이 가능할 수 있다."}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 다양한 실시예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입 력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모 듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 (CPU, central processing unit) 또는 어플리케이션 프로세서(AP, application processor)) 또는 이와는 독립 적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치(GPU, graphic processing unit), 신 경망 처리 장치(NPU, neural processing unit), 이미지 시그널 프로세서(ISP, image signal processor), 센서 허브 프로세서(sensor hub processor), 또는 커뮤니케이션 프로세서(CP, communication processor))를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로 세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프 로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(inactive)(예: 슬립(sleep)) 상태에 있는 동 안 메인 프로세서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동 안 메인 프로세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈 , 센서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리 즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습 (semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정 되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망 (DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제(OS, operating system), 미들 웨어(middleware) 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD(secure digital) 카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈,또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN(wide area network))와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또 는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈 에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB, enhanced mobile broadband), 단말 전력 최소화와 다수 단말의 접속(mMTC, massive machine type communications), 또는 고신뢰도와 저지연(URLLC, ultra-reliable and low-latency communications)을 지원할 수 있다. 무선 통신 모 듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무 선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거 대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO, full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테 나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원 할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC, mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱(heuristic)하게 실행되거 나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2는 다양한 실시예들에 따른 AR 서비스를 지원하는 AR 시스템의 예를 도시하는 도면이다. 일 실시예에 따르면, 도 2는 전자 장치, 외부 장치 및/또는 주변 장치(예: 제1 주변 장치, 제2 주변 장치, 제3 주변 장치 및/또는 제4 주변 장치)가 AR(augmented reality) 서비스 지원 을 위해 서로 통신을 수행하는 예를 나타낼 수 있다. 일 실시예에 따라, 도 2에서는 도시하지 않았으나, AR 시 스템은, 서버(또는 클라우드(cloud))(미도시)(예: 도 1의 서버)를 더 포함할 수 있다. 도 2에 예시한 바와 같이, 일 실시예에 따른 전자 장치는, 예를 들어, AR 글래스(glasses), 스마트 글래스 (smart glasses), 디스플레이 장치, 및/또는 스마트 폰(smart phone)을 포함할 수 있다. 일 실시예에 따른 주변 장치는, 예를 들어, AR 상에서 전자 장치에 의해 인식 가능한 전자 장치 주변의 다양한 장치를 나타낼 수 있다. 예를 들면, 주변 장치는 제1 주변 장치(예: TV), 제2 주변 장 치(예: 스마트 폰), 제3 주변 장치(예: 냉장고), 및/또는 제4 주변 장치(예: AI 스피커)와 같이, 전자 장치 주변에 존재하는 다양한 장치를 나타낼 수 있다. 일 실시예에 따른 외부 장치는, 예를 들어, 주변 장치에 포함될 수 있고, 전자 장치와 AR 서비 스와 관련된 데이터를 송수신하는 기능을 구비하는 다양한 형태의 장치를 포함할 수 있다. 예를 들면, 외부 장 치는 스마트 폰, 태블릿(tablet) PC(personal computer) 및/또는 노트북(notebook)을 포함할 수 있다. 일 실시예에 따라, 외부 장치는, 예를 들면, AR 서비스를 위해 관련 데이터(예: AR 이미지)를 직접 생성하거 나(예: 저장 또는 처리된 데이터에 기반하여 생성) 또는 서버(미도시)로부터 획득하여, 전자 장치에 제공 하기 위한 컴퓨팅 호스트(computing host)의 동작을 수행할 수 있다. 일 실시예에 따라, 전자 장치, 주변 장치 및/또는 외부 장치는, 예를 들면, 도 1을 참조한 설명 부분에서 설명한 바에 대응하는 구성 요소의 전부 또는 적어도 일부를 포함할 수 있다. 일 실시예에 따라, 전자 장치는 AR 서비스를 위해 관련 데이터(예: AR 이미지)를 직접 생성하거나(예: 저 장 또는 처리된 데이터에 기반하여 생성) 또는 외부(예: 외부 장치 또는 서버(예: 클라우드))로부터 획득 하여, 디스플레이(미도시)를 통해 표시할 수 있다. 예를 들면, 전자 장치는 사용자의 신체(예: 얼굴)에 착 용 가능하며, 현실 세계 위에 다양한 디지털 컨텐츠(digital contents)(예: AR 이미지)를 겹쳐서 디스플레이를 통해 하나의 영상(예: AR 화면)으로 표시할 수 있다. 어떤 실시예에 따르면, 전자 장치는, 테더드 AR 시스 템(tethered AR system)에서는, 외부 장치로부터 관련 데이터(예: AR 이미지)를 수신하고, 수신된 데이터 를 디스플레이를 통해 현실 세계 데이터와 함께 표시할 수 있다. 일 실시예에 따르면, 전자 장치는 외부 장치와 통신 연결 시, 전자 장치의 카메라(예: 도 1의 카메라 모듈)를 통해 촬영된 영상 정보를 외부 장치로 주기적으로 전송하거나, 및/또는 전자 장치 의 상태 변화(예: 위치 또는 방향의 변화)가 발생되는 경우 외부 장치로 전송할 수 있다. 일 실시예 에 따르면, 전자 장치는 외부 장치와 연결 시에 외부 장치로 장치 정보, 센서 정보, 기능 정보 및/또는 위치 정보와 같은 적어도 하나의 정보를 제공(예: 전송)할 수 있다. 일 실시예에 따르면, 외부 장치 또는 서버(예: 도 1의 서버)는 전자 장치가 전송한 영상 정보, 장치 정보, 센서 정보, 기능 정 보 및/또는 위치 정보에 기반하여 영상 정보와 관련된 데이터(예: AR 이미지)를 생성하여 전자 장치로 전 송할 수 있다. 일 실시예에 따라, 전자 장치는 주변 장치에 대한 부가적인 정보를 조회하여 디스플레이를 통해 표시 하거나, AR 화면 상의 가상의 객체와 상호작용을 수행할 수 있다. 예를 들면, 전자 장치는 사용자에 착용 될 수 있고, AR 상에서 주변 장치에 관련된 장치 정보를 확인하고, 특정 장치(예: 타겟 장치)를 AR 상에서 선택하여 특정 명령(예: 제어 명령)에 따른 제어를 수행할 수 있다. 일 실시예에 따르면, 전자 장치는 AR 상에서 주변 장치를 인식하여 관련 정보를 확인하고, 사용자 의도에 따른 대응하는 명령을 주변 장치(20 0)로 전달하여, AR 서비스를 제공할 수 있다. 일 실시예에 따르면, 전자 장치는 주변 장치 및/또는 외부 장치와 Wi-Fi 및/또는 Wi-Gig와 같은 WLAN 통신을 이용하여 데이터를 송수신할 수 있다. 일 실시예에 따라, 도 2와 같은 환경에서, 전자 장치는, AR 서비스를 위해, 디스플레이를 통해 제공된 AR 화면 상에서 인식된 타겟 객체(예: 현실 세계의 타겟 장치(target device))가, 장치들 간에 통신 모듈을 통해 작동적으로 연결되는 데이터 통신 링크(data communication link) 상에서 인식된(또는 검색된) 여러 주변 장치 중 어떤 타겟 장치에 해당하는지를 인식할 수 있어야 한다. 예를 들면, 전자 장치는 데이터 통신 링 크 상에서 주변 장치에 대하여 높은 정확도로 거리 정보 및 방향 정보를 특정할 수 있어야 한다. 예를 들 면, 전자 장치와 타겟 장치 간의 데이터 통신 링크가 물리적으로 멀티-패스(multi-path)를 통해 형성되는 실내 환경(indoor environment)에서 타겟 장치에 대한 거리 및 방향을 높은 정확도로 특정하는 것은 어려울 수 있다. 다양한 실시예들에서는, 전자 장치가 AR 상에서 타겟 장치를 인식하여, 타겟 장치에 관련된 정보를 확인하 고, 타겟 장치로 대응하는 명령을 전달하는 AR 서비스를 위하여, 데이터 통신 링크 상에서 타겟 장치의 거리 정 보 및 방향 정보의 인식률 및 그 정확성을 향상시킬 수 있도록 한다. 일 실시예에 따르면, 전자 장치는 AR 화면 상에서 인식된 타겟 객체(예: 현실 세계의 실질적 타겟 장치에 대응하는 객체)와의 거리 정보 및 방향 정 보를, 데이터 통신 링크 상에서 타겟 장치와의 거리 정보 및 방향 정보를 추정하는데 이용하여, 도래각(AoA, angle of arrival) 추정의 정확도를 높일 수 있다. 일 실시예에 따르면, 전자 장치는 전자 장치에 구 비되는 안테나 수에 제약되지 않으면서(예: 안테나의 수가 적은 경우에도), 신뢰도 높은 도래각 추정을 제공할 수 있다. 다양한 실시예들에 따르면, 전자 장치(10!)는 전자 장치의 카메라 모듈을 통해 획득된 이미지를 전자 장치의 통신 모듈을 통해 외부 장치에 전송하고, 통신 모듈을 통해 외부 장치로부터 적어 도 하나의 객체를 포함하는 AR 이미지를 수신할 수 있다. 일 실시예에 따르면, 전자 장치는 디스플레이 모 듈을 통해 외부 장치로부터 수신된 AR 이미지를 표시할 수 있다. 일 실시예에 따르면, 전자 장치 는 수신된 AR 이미지 상의 적어도 하나의 객체 중에서 타겟 객체를 인식하고, 인식된 타겟 객체에 대해 거 리 및 방향을 추정할 수 있다. 일 실시예에 따르면, 전자 장치는 통신 모듈을 통해 데이터 통신 링크 상에서 검색된 주변 장치 중 하나를 인식된 타겟 객체에 대응하는 타겟 장치로 매핑할 수 있다. 일 실시예 에 따르면, 전자 장치는 디스플레이 모듈을 통해 표시된 AR 이미지 상에서 타겟 객체에 대해 추정된 거리 및 방향에 기반하여, 탭 선택(tab selection)(예: 채널 임펄스 응답(CIR, channel impulse response) 탭 선택)하는 동작, 도래각 추정에 관련된 제1 추정 알고리즘을 이용한 타겟 장치에 대한 제1 도래각 추정 동작(예: 제1 동작), 및 제1 도래각 추정 동작의 수행에 따른 추정 결과에 대해 도래각 추정에 관련된 제2 추정 알고리즘을 이용한 제2 도래각 추정 동작(예: 제2 동작)을 수행하여, 하이브리드(hybrid) 방식의 도래각 추정을 제공할 수 있다. 이하에서, 다양한 실시예들에 따른 전자 장치에서 도래각을 추정하는 것과 관련하여 설명된다. 도 3은 다양한 실시예들에 따른 전자 장치의 구성을 개략적으로 도시하는 도면이다. 일 실시예에 따라, 도 3은 다양한 실시예들에 따른 전자 장치에서 AR 서비스를 지원하는 것과 관련된 구성 의 예를 나타낼 수 있다. 일 실시예에 따라, 도 3에 예시된 전자 장치는 도 1을 참조한 설명 부분에서 설 명한 바와 같은 전자 장치의 구성 요소의 전부 또는 적어도 일부를 포함할 수 있다. 일 실시예에 따라, 도 3에서는 전자 장치가 AR 장치(예: AR 글래스 또는 스마트 글래스)인 예를 나타낼 수 있다. 도 3을 참조하면, 전자 장치는 프로세서, 디스플레이 모듈, 센서 모듈, 글래스, 배터 리189), 카메라 모듈, 통신 모듈, 메모리, 및 오디오 모듈을 포함할 수 있다. 일 실시예에 따라, 전자 장치에 포함되는 구성 요소들은, 예를 들면, 하드웨어 모듈(예: 회로(circuitr y))로 이해될 수 있다. 일 실시예에 따르면, 전자 장치에 포함되는 구성 요소들은, 도 3에 도시된 구성 요 소들(예: 디스플레이 모듈, 센서 모듈, 글래스, 배터리, 카메라 모듈, 및/또는 통신 모듈)에 제한되지 않을 수 있다. 예를 들면, 도 3에 도시된 전자 장치의 구성 요소들은, 생략되거나, 다른 구성 요소들로 대체되거나, 또는 추가적인 구성 요소들이 추가될 수 있다. 예를 들면, 글래스는, 전 자 장치가 AR 글래스 및/또는 스마트 글래스인 경우 포함될 수 있고, 전자 장치가 스마트 폰인 경우 포함되지 않을 수 있다. 일 실시예에 따르면, 글래스는 집광 렌즈(condensing lens) 및/또는 투명 도파관(transparent waveguid e)을 포함할 수 있다. 예를 들어, 투명 도파관은 글래스의 일부에 적어도 부분적으로 위치할 수 있다. 일실시예에 따르면, 디스플레이 모듈에서 방출된 광은 글래스의 일단으로 입광될 수 있고, 입광된 광이 글래스 내에 형성된 도파관 및/또는 도파로(예: waveguide)를 통해 사용자에게 전달될 수 있다. 도파관은 글래스 또는 폴리머로 제작될 수 있으며, 내부 또는 외부의 일 표면에 형성된 나노 패턴, 예를 들어, 다각형 또 는 곡면 형상의 격자 구조(grating structure)를 포함할 수 있다. 일 실시예에 따르면, 입광된 광은 도파관 내 부에서 전파 또는 반사되어 사용자에게 전달될 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 복수의 패널(또는 표시 영역)을 포함할 수 있고, 복수의 패널은 글래스에 위치할 수 있다. 일 실시예에 따르면, 디스플레이 모듈의 적어도 일부는 투명 소자로 구성 될 수 있고, 사용자가 디스플레이 모듈을 투과하여, 디스플레이 모듈의 후면의 실제 공간을 인지할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 사용자에게 실제 공간의 적어도 일부에 가상 객체가 덧 붙여진 것으로 보여지도록 투명 소자의 적어도 일부 영역에 가상 객체를 표시할 수 있다. 일 실시예에 따르면, 디스플레이 모듈이 투명 uLED인 경우 글래스 내에 도파관 구성이 생략될 수 있다. 일 실시예에 따르면, 센서 모듈은 근접 센서, 조도 센서, 및/또는 자이로 센서를 포함할 수 있다. 일 실시 예에 따르면, 근접 센서는 전자 장치에 인접하는 객체를 감지할 수 있다. 일 실시예에 따르면, 조도 센서 는 전자 장치 주변의 밝기 정도를 측정할 수 있다. 일 실시예에 따르면, 프로세서는 조도 센서를 사 용하여 전자 장치 주변의 밝기 정도를 확인하고, 상기 밝기 정도를 기반으로 디스플레이 모듈의 밝기 관련 설정 정보를 변경할 수 있다. 예를 들어, 주변의 밝기가 기 설정된 밝기보다 더 밝으면, 프로세서는 사용자의 시인성이 높아지도록 디스플레이 모듈의 밝기 정도를 보다 높게 설정할 수 있다. 일 실시예에 따 르면, 자이로 센서는 전자 장치의 자세 및 위치를 감지할 수 있다. 예를 들어, 자이로 센서는 전자 장치 가 사용자의 머리에 올바르게 착용되었는지 여부를 감지할 수 있다. 다른 예를 들어, 자이로 센서는 전자 장치 또는 전자 장치를 착용한 사용자의 움직임을 감지할 수 있다. 일 실시예에 따르면, 통신 모듈은 안테나 모듈을 포함할 수 있다. 예를 들면, 통신 모듈은 지정 된 주파수 대역에서의 성능 확보를 위한 다양한 기술들(예: 빔포밍(beamforming), 다중 입출력(MIMO), 및/또는 어레이 안테나(array antenna))을 지원할 수 있다. 일 실시예에 따르면, 안테나 모듈은 신호 또는 전력을 외부(예: 주변 장치 및/또는 외부 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르 면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 일 실시예에 따라, 신호 또는 전력은 안테나 모듈을 통하여 통신 모듈과 외부의 주변 장치 및/또는 외부 장치 간에 송신 되거나 수신될 수 있다. 일 실시예에 따라, 메모리는 도 1을 참조한 설명 부분에서 설명한 바와 같은 메모리에 대응할 수 있 다. 일 실시예에 따르면, 메모리는, 전자 장치가 AR 서비스를 제공할 때, 전자 장치에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램), 및 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 일 실시예에 따르면, 오디오 모듈은 프로세서의 제어에 기반하여, 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시예에 따라, 프로세서는 도 1을 참조한 설명 부분에서 설명한 바와 같은 프로세서에 대응할 수 있다. 일 실시예에 따르면, 프로세서는, 예를 들면, 어플리케이션(예: AR 어플리케이션)을 실행하여, 전자 장치와 데이터 통신 링크로 연결된 주변 장치를 AR 상에서 제어할 수 있고, AR 서비스에 관련된 다양 한 데이터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 통신 모듈을 통해 수신된 데이터를 메모리에 저장하고, 메모리에 저장된 데이 터를 처리하고, 결과 데이터를 메모리에 저장 및/또는 주변 장치(예: 타겟 장치)로 전송할 수 있다. 일 실시예에 따르면, 프로세서는 통해 제공된 현실 세계 상에 다양한 디지털 컨텐츠(예: AR 이미지)를 겹 쳐서 하나의 영상(예: AR 화면)을 표시하도록 디스플레이 모듈을 제어할 수 있다. 일 실시예에 따르면, 프 로세서는 AR 화면 상에서 타겟 객체(예: 현실 세계의 타겟 장치(예: 주변 장치)에 대응)와 전자 장치 간의 제1 정보(예: 거리 및 방향)를 추정할 수 있다. 일 실시예에 따르면, 전자 장치는 다양한 센서(예: 센서 모듈, 카메라 모듈)를 포함할 수 있고, 프로세서는 적어도 하나의 센서를 이용한 센싱 정 보에 기반하여, 타겟 객체와의 거리 및 방향을 측정할 수 있다. 일 실시예에 따르면, 전자 장치는 적외선 센서, ToF(time-of-flight) 센서(또는 ToF 카메라), AR 카메라, 및/또는 차세대 AR 카메라(예: 라이다 센서 (lidar sensor))와 같은 적어도 하나의 센서를 포함할 수 있고, 프로세서는 대응하는 센서를 이용하여 피 사체(예: 타겟 장치)를 향해 지정된 신호(예: 적외선, 광원, 레이저)를 출력하고, 출력된 신호가 피사체에 반사되어 돌아오는 시간을 측정하여 AR 화면을 통해 제공된 이미지(예: 타겟 객체)와의 거리 및 방향을 추정할 수 있다. 일 실시예에 따르면, 프로세서는 AR 화면 상에서 타겟 객체와 추정된 제1 정보(예: 거리 및 방향)를 이용 하여 채널 임펄스 응답(CIR, channel impulse response) 탭 선택(tab selection)을 수행할 수 있다. 일 실시예 에 따르면, 무선 통신은 시변 채널(time varying channel)을 가지며, 프로세서는 시간에 따라 변화하는 CIR에서 적어도 하나의 탭을 선택하는 동작을 수행할 수 있다. 예를 들면, 프로세서는 도래각 추정을 위한 제1 동작으로 멀티 패스에 의한 영향을 줄이기 위하여(또는 최소화 또는 완화를 위해), 추정된 제1 정보에 기반 하여 CIR 탭 선택을 수행할 수 있다. 예를 들면, 프로세서는 많은 멀티 패스에서 서로 다른 지연으로 서로 달라지는 응답에서, 제1 정보를 기반으로 도래각 추정에 사용할 탭(예: 관심 탭(tab of interest))을 선택할 수 있다. 일 실시예에 따라, 도래각 추정의 제1 동작으로 CIR 탭 선택 동작과 관련하여 후술하는 도면을 참조하여 설명된다. 일 실시예에 따르면, 프로세서는 제1 정보(예: 거리 및 방향)에 기반하여, 안테나 모듈의 복수의 안 테나들을 지정된 개수로 그룹화 할 수 있다. 일 실시예에 따르면, 프로세서는 안테나 모듈의 복수의 안테나들(예: 어레이 안테나)을 복수의 안테나 서브셋(antenna subset)으로 분할(또는 구분)할 수 있다. 예를 들어, 하나의 안테나는 복수의 서브셋에 포함될 수 있다. 예를 들어, 복수의 안테나 서브셋들에 포함되는 안테 나들 중 일부는 중첩될 수 있다. 일 실시예에 따르면, 프로세서는 안테나 서브셋에 대하여, AR 화면을 통해 제공된 이미지(예: 타겟 객체) 를 통해 추정된 제1 정보의 적어도 일부(예: 거리 정보 및/또는 방향 정보)에 기반하여 도래각 추정을 위한 제2 동작을 수행할 수 있다. 예를 들면, 프로세서는 이미지 상에서 추정된 방향 정보를 이용하여, 도래각 추정 을 위한 도래각 추정 알고리즘들 중 지정된 제1 추정 알고리즘에 기반하여 제1 도래각 추정을 수행할 수 있다. 일 실시예에 따라, 전자 장치에서 이용할 수 있는 도래각 추정 알고리즘은, 예를 들면, 파라미터 (parameter) 기반 스펙트럼 추정 기술(parametric spectrum estimation)인 classic 방식(method), MVDR(minimum variance distortionless response) 방식, MUSIC(multiple signal classification) 방식, 및/또 는 minimum Norm 방식과 같은 다양한 추정 알고리즘을 포함할 수 있다. 일 실시예에서는, 도래각 추정을 위한 제2 동작에서 제1 도래각 추정 알고리즘으로, MVDR 방식을 이용하는 것을 예로 할 수 있다. 예를 들면, 프로세 서는 안테나 서브셋에 대하여, 제1 정보의 적어도 일부를 이용하여 MVDR 방식을 적용하여 도래각 추정의 제2 동작을 수행할 수 있다. 일 실시예에 따른 MVDR 방식은, 예를 들면, 빔포밍(beamforming) 기반의 도래각 추정 방식의 예를 나타낼 수 있 다. 일 실시예에 따라, MVDR 방식은, 예를 들면, 특정 방향에서 수신되는 신호를 증폭할 수 있는 웨이트 벡터 (weight vector)를 적용하여 신호 크기를 측정하여, 특정 방향 신호의 유무를 추정하는 방법으로 도래각 추정을 수행하는 방식을 나타낼 수 있다. 일 실시예에 따르면, 프로세서는 빔포밍 기반의 MVDR 방식에서 웨이트 벡터를 설정할 때, 안테나 모듈의 각 안테나 간 상관 행렬(correlation matrix)을 기반으로 하여, 다른 방 향에서 수신되는 신호 성분을 억제할 수 있다. 예를 들면, 프로세서는 다른 방향에서 수신되는 신호 성분 을 잡음(noise)으로 처리(또는 생성)할 수 있다. 일 실시예에 따라, 프로세서는 제1 도래각 추정 알고리즘 에 기반하여 안테나 서브셋에 대한 제2 동작을 수행하는 결과로, 각 안테나 서브셋에 대응하는 추정 결과(예: output)를 획득(또는 생성)할 수 있다. 일 실시예에 따르면, 일반적인 MVDR 방식은 빔포밍 기반의 도래각 추정 방식의 대표적인 방법일 수 있다. 예를 들어, 각도 “θ” 방향에서 입사되는 패스 성분에 대하여, MVDR에 의한 웨이트 벡터(w)는 아래 <수학식 1>과 같이 나타낼 수 있으며, 가능한 모든 방향(θ)에 대하여 웨이트 벡터를 적용하여 신호 성분들의 크기를 측정하 여, 멀티 패스 환경에서 도래각 추정을 수행할 수 있다. 수학식 1"}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "<수학식 1>에 나타낸 예시는, 일반적인 MVDR에 대한 일반적인 수식을 나타낼 수 있다. <수학식 1>의 예시에서, RH는 안테나 성분 간 상관 행렬을 나타내며, H는 켤레 전치(conjugate transpose) 연산을 나타내며, θ는 입사 각을 나타내며, a(θ)는 입사각(θ)에 따른 위상(phase) 차이를 나타낼 수 있다. 일 실시예에 따르면, 본 개시에 따른 하이브리드(hybrid) 도래각 추정에서는 상기한 바와 같은 일반적인 MVDR 방식을 응용(또는 수정)하여 이용할 수 있다. 예를 들어, 본 개시에 따른 하이브리드 도래각 추정에서 이용되는 수정된(modified) MVDR 방식은, 일반적인 MVDR 방식을 기반으로 하지만, 관심 방향(예: 관심 각도(angle of interest))을 벗어나는 멀티 패스 성분(또는 요소(components))을 잡음으로 처리하여, 후술되는 후속 도래각 추 정 동작에 유리하도록 할 수 있다. 예를 들면, 일반적인 MVDR 방식에서는 전체 안테나에 대하여 웨이크 벡터를 적용하여 컴바이닝(combining)을 수행함에 따라, 출력이 하나일 수 있으며, 결과적으로 출력 디멘션(output dimension)(예: 웨이트 벡터들의 합)이 \"1\"이 될 수 있다. 따라서, 후속 도래각 추정 동작에서 신호 서브스페이 스(signal subspace)보다 더 큰 디멘션을 필요로 한다는 점에서, 일반적인 MVDR 방식의 경우 후속 도래각 추정 동작에 적용할 수 없다. 따라서, 본 개시에 따른 하이브리드 도래각 추정에서는, 후술하는 도 9에서와 같이, 중 첩 안테나 서브셋(overlapping antenna subset) 단위로 MVDR을 적용할 수 있다. 예를 들어, 본 개시에 따른 하 이브리드 도래각 추정에서 이용되는 수정된(modified) MVDR 방식은 아래 <수학식 2>와 같이 정의될 수 있다. 수학식 2"}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "<수학식 2>에 나타낸 예시는, 예를 들면, 본 개시에 따라 안테나 모듈의 복수의 안테나들(예: 어레이 안테 나)을 복수의 안테나 서브셋으로 구분하여, 안테나 서브셋 단위로 MVDR을 적용하는 예를 나타낼 수 있다. 예를 들면, <수학식 2>에 나타낸 예시의 경우, 본 개시에 따라 복수의 안테나들을 지정된 방향을 기반으로 적어도 하 나의 안테나를 중첩하여 안테나 서브셋으로 나누어 MVDR을 적용하는 경우, m 번째 안테나 서브셋에 대응하는 수 식을 나타낼 수 있다. <수학식 2>의 예시에서, M은 각 안테나 서브셋에서 안테나들의 수를 나타내며, a는 신호 의 도래 방향 추정을 위한 지향 벡터(steering vector)를 나타내며, 아래 첨자 \"m:n\"(예: m은 시작(start) 지 점, n은 종료(end) 지점)은 전체 벡터 성분 중, m 번째 안테나 서브셋(예: 시작 지점)부터 n(예: n = m+M-1) 번 째 안테나 서브셋(예: 종료 지점)까지 슬라이싱(slicing)하는 것을 의미할 수 있다. 예를 들어, <수학식 2>와 같이, 웨이트 벡터는 슬라이딩 윈도우(sliding window) 적용과 유사한 방식으로 결정된 중첩 안테나 서브셋에 대해 구분되어 결정될 수 있다. <수학식 2>를 참조하면, m 번째 안테나 서브셋의 경우, M x K 채널 행렬 (channel matrix)은 Hm:m+M-1에 의해 주어지며, 여기서, 아래 첨자(예: m:m+M-1)는 인덱스 범위가 m에서 m+M-1인 행(rows)으로 슬라이싱(H)하는 것을 나타낼 수 있다. 그런 다음, 각도(θ)에 대한 m 번째 안테나 서브셋에 대한 MVDR 웨이트 벡터를 구하면 <수학식 2>와 같이 주어질 수 있다. 일 실시예에 따라, 모든 안테나 서브셋(예: m = 1, 2, ..., N-M-+1)을 적용하면, 각 안테나 서브셋은 단일 가중 치 합(single weighted sum)을 생성할 수 있고, 결과 디멘션(dimension)은 안테나 서브셋들의 수(예: N-M+1)에 의해 결정될 수 있다. 일 실시예에 따라, 이미지로부터 검색된 관심 각도가 θI로 정의되는 것을 가정하여, 웨이 트 벡터( )을 적용하면 관심 각도(예: θI)를 벗어나게 입사되는 멀티 패스 성분을 억제할 수 있다. 어떤 실시예에 따르면, 일정한 각도로 입사되는 성분은 유한 디멘션(finite dimension)의 도래각 추정 하에서, 인접 각도(neighboring angles)에 잔여 성분(residual components)을 가질 수 있다. 이러한 경우, 단순히 웨이 트 벡터( )을 적용하게 되면 관심 각도(예: θI)에서 먼 각도에서 입사하는 멀티 패스 성분에 의해 생 성된 잔여 성분에 대해 도래각 추정이 취약해질 수 있다. 이에, 본 개시의 따른 도래각 추정에서는 아래 <수학식 3> 및 후술하는 도 10의 예시와 같이, 관심 각도뿐만 아 니라, 상하 마진 각도(upper and lower margin angles)에 대한 MVDR 웨이트 벡터의 합을 적용할 수 있다. 예를 들어, 아래 <수학식 3>은 <수학식 2>와 같은 동작을 desired angle(예: 관심 방향), boundary angle 1(예: 상 한 경계), boundary angle 2(예: 하한 경계)에 대하여 각각 수행하여 지향 벡터(steering vector)를 합하는 예 를 나타낼 수 있다.수학식 3"}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "<수학식 3>의 예시에서, θU는 상한 경계(예: upper boundary angle)에 대응하는 마진을 나타내고, θL은 하한 경계(예: lower boundary angle)에 대응하는 마진을 나타낼 수 있다. 예를 들어, θU 및 θL은 각각 마진(예: θmargin)에 대해 일정한 마진(예: θI ± θmargin)으로 제공될 수 있다. 예를 들어, 관심 각도에서 입사하는 성분 의 가중치 합(weighed sum)과 그 상하 마진 각도에 의해 제공되는 출력을 생성할 수 있다. 예를 들면, 관심 각 도, 상한 경계에 대응하는 상한 방향 및 하한 경계에 대응하는 하한 방향의 적어도 세가지 방향에 대하여 웨이 트 벡터를 설정하고, 세가지 방향에 대응하는 웨이트 벡터의 합을, 각 안테나 서브셋에서 적용할 최종 웨이트 벡터로 결정할 수 있다. 일 실시예에 따라, 도래각 추정의 제2 동작으로 MVDR 방식을 이용하는 동작과 관련하여 후술하는 도면(예: 도 9 및 도 10)을 참조하여 설명된다. 일 실시예에 따르면, 프로세서는 제2 동작으로 추정된 추정 결과에 기반하여 도래각 추정을 위한 제3 동작 을 수행할 수 있다. 예를 들면, 프로세서는 안테나 서브셋에 대응하는 추정 결과에 대하여 도래각 추정을 위한 도래각 추정 알고리즘들 중 지정된 제2 추정 알고리즘에 기반하여 제2 도래각 추정을 수행할 수 있다. 일 실시예에서는, 도래각 추정을 위한 제3 동작에서 제2 도래각 추정 알고리즘으로, MUSIC 방식을 이용하는 것을 예로 할 수 있다. 예를 들면, 프로세서는 안테나 서브셋에 대응하는 각 출력에 MUSIC 방식을 적용하여 도 래각 추정의 제3 동작을 수행할 수 있다. 일 실시예에 따른 MUSIC 방식은, 예를 들면, 신호 성분에 의한 서브셋(subset)과 잡음에 의한 서브스페이스 (subspace)를 분리하는 방법으로 도래각 추정을 수행하는 방식을 나타낼 수 있다. 예를 들면, MUSIC 방식으로, 상관 행렬에 대하여 고유값 분해(eigenvalue decomposition)를 수행함으로써, 서브스페이스 분리를 수행할 수 있으며, 분리된 서브스페이스들은 서로에 대하여 수직한 성질을 가질 수 있다. 예를 들면, 프로세서는 안 테나 서브셋에 대응하는 각 출력에 MUSIC 방식을 적용하여, 각 출력에서 신호와 잡음을 분리할 수 있다. 일 실 시예에 따라, 도래각 추정의 제3 동작으로 MUSIC 방식을 이용하는 동작과 관련하여 후술하는 도면을 참조하여 설명된다. 일 실시예에 따르면, 프로세서는 제3 동작의 제2 도래각 추정 결과에 기반하여, 데이터 통신 링 크 상의 타겟 장치와의 거리 및 방향을 특정할 수 있다. 예를 들면, 프로세서는 제1 동작, 제2 동작 및 제 3 동작을 수행하는 결과로, 데이터 통신 링크 상의 타겟 장치에 대한 도래각을 추정할 수 있다. 본 개시의 다양한 실시예들에 따른 전자 장치는, 디스플레이 모듈, 카메라 모듈, 통신 모듈 , 및 상기 카메라 모듈, 상기 디스플레이 모듈 및 상기 통신 모듈과 작동적으로 연결된 프 로세서를 포함하고, 상기 프로세서는, 상기 카메라 모듈을 통해 획득된 이미지를 상기 통신 모 듈을 통해 외부 장치로 전송하고, 상기 통신 모듈을 통해 상기 외부 장치로부터 적어도 하나의 객체 를 포함하는 AR(augmented reality) 이미지를 수신하여 상기 디스플레이 모듈을 통해 표시하고, 상기 적어 도 하나의 객체 중에서 타겟 객체를 인식하고, 상기 통신 모듈을 통해 데이터 통신 링크(data communication link) 상에서 검색된 주변 장치들(예: 도 2의 주변 장치) 중 하나를 상기 인식된 타겟 객체 에 대응하는 타겟 장치로 매핑하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 AR 이미지 상에서 상기 타겟 객체에 대해 거 리 및 방향을 추정하고, 상기 데이터 통신 링크 상의 상기 타겟 장치로부터의 신호가, 상기 추정된 거리 및 방 향으로부터 수신되는지 식별하고, 상기 타겟 장치로부터의 신호가 상기 추정된 거리 및 방향으로부터 수신되는 경우, 상기 타겟 객체와 상기 타겟 장치를 매핑하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 지정된 제1 추정 알고리즘을 적용하여 상기 타겟 장치에 대한 도래각(AoA, angle of arrival) 추정을 위한 제1 동작을 수행하고, 제1 동작의 수행에 따른 추정 결과에 기반하여 지정된 제2 추정 알고리즘을 적용하여 상기 도래각 추정을 위한 제2 동작을 수행하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 타겟 장치로부터 송신된 신호에 기반하여 CIR(channel impulse response) 탭 선택을 수행하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 신호에 대하여 일정한 인터벌로 샘플링된 복 수의 탭들 중에서, 도래각 추정에 사용할 관심 탭을 선택하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 관심 탭은, 상기 AR 이미지 상에서 추정된 거리를 기반으로, 해당 거리를 전자기파의 속도로 나눈 값에 대응하는 탭을 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 관심 탭에 제1 추정 알고리즘을 적용하여 복 수의 출력을 생성하고, 상기 복수의 출력에 제2 추정 알고리즘을 적용하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 제1 추정 알고리즘은, 빔포밍(beamforming)에 의하여 특정 방향의 신호를 추정하기 위한 알고리즘을 포함하고, 상기 제2 추정 알고리즘은, 지정된 신호와 잡음을 분리하기 위한 알고리즘을 포함할 수 있다. 본 개시의 다양한 실시예들에 따른 전자 장치는, 카메라 모듈, 디스플레이 모듈, 통신 모듈 , 및 상기 카메라 모듈, 상기 디스플레이 모듈 및 상기 통신 모듈과 작동적으로 연결된 프 로세서를 포함하고, 상기 프로세서는, 상기 카메라 모듈을 통해 획득된 이미지를 상기 통신 모 듈을 통해 외부 전자 장치로 전송하고, 상기 외부 전자 장치로부터 상기 전송한 이미지에 기반한 AR(augmented reality) 이미지를 수신하고, 상기 수신된 AR 이미지를 상기 디스플레이 모듈을 통해 표시하 고, 상기 디스플레이 모듈을 통해 표시된 상기 AR 이미지 상에서 타겟 객체에 대해 추정된 거리 및 방향에 기반하여 탭 선택을 수행하고, 상기 통신 모듈의 복수의 안테나들에 기반하여 분할된 안테나 서브셋 (antenna subset) 단위로 상기 추정된 거리 및 방향을 이용하여 제1 추정 알고리즘을 적용하고, 상기 안테나 서 브셋에 대해 상기 제1 추정 알고리즘을 적용하여 획득된 출력(output)에 대해 제2 추정 알고리즘을 적용하여 도 래각(AoA, angle of arrival)을 추정하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 제1 추정 알고리즘은, 빔포밍(beamforming)에 의하여 특정 방향의 신호를 추정하기 위한 알고리즘을 포함하고, 상기 제2 추정 알고리즘은, 지정된 신호와 잡음을 분리하기 위한 알고리즘을 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 카메라 모듈을 통해 획득되어 상기 디 스플레이 모듈을 통해 표시된 상기 이미지 상에서 상기 타겟 객체를 인식하고, 인식된 타겟 객체와의 거리 및 방향을 추정하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 일정한 인터벌(interval)로 샘플링(sampling)된 복수의 탭들 중, 상기 이미지 상에서 추정된 거리 및 방향에 대응하는 탭을 상기 도래각 추정에 사용될 관심 탭 으로 선택하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 선택된 관심 탭을 상기 제1 추정 알고리즘 적용을 위한 입력(input)으로 제공하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 복수의 안테나들에 기반하여 지정된 개수의 안테나를 포함하는 상기 안테나 서브셋을 생성하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 안테나 서브셋이 최대 수를 가지도록, 상기 안테나 서브셋 각각에서 적어도 하나의 안테나를 중첩하여 상기 안테나 서브셋을 생성하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 안테나 서브셋에 상기 제1 추정 알고리즘을 적용하여, 상기 안테나 서브셋의 수에 대응하는 복수의 출력을 생성하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 복수의 출력에 대하여 상기 제2 추정 알고리 즘을 적용하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 프로세서는, 상기 복수의 출력에 대하여 신호 서브스페이스 (signal subspace)를 이루는 고유 벡터(eigenvector)들과 잡음에 의한 서브스페이스를 이루는 고유 벡터들을 분 리하고, 상기 신호 서브스페이스에 기반하여 상기 도래각 추정을 완료하도록 설정될 수 있다. 이하에서는 다양한 실시예들의 전자 장치의 동작 방법에 대해서 상세하게 설명한다. 다양한 실시예들에 따 라, 이하에서 설명하는 전자 장치에서 수행하는 동작들은, 전자 장치의 적어도 하나의 프로세싱 회로(processing circuitry)를 포함하는 프로세서에 의해 실행될 수 있다. 일 실시예에 따라, 전자 장치(10 1)에서 수행하는 동작들은, 메모리에 저장되고, 실행 시에, 프로세서가 동작하도록 하는 인스트럭션 들(instructions)에 의해 실행될 수 있다. 도 4는 다양한 실시예들에 따른 전자 장치의 동작을 도시하는 흐름도이다. 도 4를 참조하면, 동작 401에서, 전자 장치의 프로세서는 도래각 추정을 위한 제1 동작으로 멀티 패 스에 의한 영향을 줄이기 위해 CIR 탭 선택 동작을 수행할 수 있다. 일 실시예에 따르면, 프로세서는 카메 라 모듈을 통해 획득되어 디스플레이 모듈을 통해 표시된 이미지 상에서 특정 객체(예: 타겟 장치)에 대해 추정된 거리 및 방향을 이용하여 CIR 탭 선택을 수행할 수 있다. 일 실시예에 따라, CIR은 송신 단(예: 타 겟 장치)에서 송신한 임펄스(impulse)가 수신 단(예: 전자 장치)의 타임 도메인(time domain)에서 어떤 지 연(delay) 성분을 가지고 수신이 되는지에 따라 결정될 수 있다. 예를 들면, CIR은 각 멀티 패스가 해당 패스의 전파 시간에 따른 지연에 따라 분리되어 나타날 수 있다. 이에 대하여, 후술하는 도 5 내지 도 8을 참조하여 설 명된다. 동작 403에서, 프로세서는 이미지 상에서 특정 객체에 대해 추정된 거리 및 방향에 적어도 일부 기반하여 도래각 추정을 위한 제2 동작으로 제1 추정 알고리즘(예: MVDR)을 이용하여 제1 도래각 추정을 수행할 수 있다. 일 실시예에 따르면, 프로세서는 안테나 모듈의 각 안테나(예: 어레이 안테나)를 지정된 개수만큼 포 함하는 안테나 서브셋으로 분할(또는 구분)하고, 각 안테나 서브셋에 대하여 이미지 상에서 추정된 방향을 이용 하여 MVDR을 적용할 수 있다. 일 실시예에 따라, 프로세서는 안테나 서브셋에 대하여 MVDR을 적용하여 복 수의 출력(output) 결과를 획득할 수 있다. 동작 405에서, 프로세서는 도래각 추정을 위한 제3 동작으로 안테나 서브셋에 대응하는 출력 결과에 제2 추정 알고리즘(예: MUSIC)를 이용하여 제2 도래각 추정을 수행할 수 있다. 일 실시예에 따르면, 프로세서 는 안테나 서브셋에 대하여 MVDR을 적용하여 획득된 복수의 출력 결과에 대하여 MUSIC을 적용할 수 있다. 도 5, 도 6, 도 7, 및 도 8은 다양한 실시예들에 따른 전자 장치에서 적용되는 CIR 탭 선택에 대한 동작 예를 설명하기 위해 도시하는 도면들이다. 일 실시예에 따라, 도 5는 전자 장치에서 CIR을 설명하기 위한 도면이다. 일 실시예에 따라, 도 6은 전자 장치에서 타겟 장치를 인식하는 예를 설명하기 위한 도면이다. 일 실시예에 따르면, 전자 장치는 타겟 장치 간에 데이터 통신 링크가 멀티 패스에 의해 형성될수록 도래각 추정의 정밀도가 떨어질 수 있다. 따라서, 도래각 추정의 정밀도를 높이는데 있어서 멀티 패스에 의한 영향을 가능한 줄이는 것이 기본이 될 수 있다. 도 5에 도시한 바와 같이, 도 5는 전자 장치가 타겟 장치(예: 주변 장치 중 적어도 일부)에 의 해 송신된(transmitted) 신호(예: τ0에 송신된 신호)를 수신하는 경우, 데이터 디코딩(data decoding)을 위한 채널 추정(channel estimation) 동작에서 CIR을 추정하는 예를 나타낼 수 있다. 일 실시예에 따라, CIR은, 예를 들면, 송신 단(예: 타겟 장치)에서 송신한 임펄스가 수신 단(예: 전자 장치)의 타임 도메인(time domain)에서 어떤 지연(delay)(예: Delay τ1, Delay τ2, 또는 Delay τ3)을 가지고 수신이 되는지에 따라 결 정될 수 있다. 예를 들면, 도 5에 도시한 바와 같이, 실내 환경에서, 타겟 장치에서 송신된 신호는 타겟 장치에서 전자 장치로 직접 전달되는 제1 패스, 주변의 반사체(503, 505)(예: 벽, 기둥, 또는 다른 주변 장치)에 반사되어 전달되는 제2 패스 및 제3 패스와 같이 멀티 패스로 형성될 수 있고, 멀 티 패스의 각 패스는 해당 패스의 전파 시간에 따른 지연(예: Delay τ1, Delay τ2, 또는 Delay τ3)에 따라 분 리되어 나타날 수 있다. 일 실시예에 따라, 이상적인 임펄스 형태의 CIR은 이론적으로, 전자 장치와 타겟 장치 간에 무한한 대역폭(bandwidth)을 사용하여 송신된 신호로부터 획득될 수 있다. 다른 실시예에 따라, 전자 장치와 타겟 장치 간에 유한한 대역폭을 사용하는 경우, CIR에서 각 패스가 좌우로 퍼지게 되며, 그에 따라 멀티 패스 가 완전하게 분리(또는 구분)되지 않을 수 있다. 예를 들면, 아래 <표 1>은 다양한 통신 시스템에 따른 대역폭 과 그에 따라 CIR에서 구분 가능한 멀티 패스 사이의 최소 전파 거리의 차이를 나타낼 수 있다. 표 1 Bandwidth 20 MHz (WLAN)80 MHz (WLAN)500 MHz (UWB)2.14 GHz (WiGig) Resolution 7.5 m 1.9 m 37.5 cm 6.94 cm <표 1>에 나타낸 바와 같이, 대역폭이 클수록(예: 20 MHz -> 2.14 GHz) 전파 거리 차이가 작은 멀티 패스를 구 분할 수 있다. 예를 들면, WLAN의 경우 약 80 MHz 대역폭 사용 시, 약 1.9 m 정도로 전파 거리 차이가 나는 멀 티 패스를 구분할 수 있고, UWB의 경우 약 500 MHz 대역폭 사용 시, 약 37.5 cm 정도로 전파 거리 차이가 나는 멀티 패스를 구분할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 도 5에 예시한 바와 같은 멀티 패스에 의한 영향을 줄이기 위해 CIR 탭 선택 동작(예: 도래각 추정을 위한 제1 동작)을 선행할 수 있다. 예를 들면, 전자 장치는 이미지 상에서 인식된 타겟 객체(예: 타겟 장치)와 데이터 통신 링크 상에서 검색된 주변 장치들 중 타겟 객 체에 대응하는 타겟 장치를 매핑(mapping)할 수 있다. 일 실시예에 따르면, 전자 장치는 타겟 객체와 타겟 장치의 매핑을 위하여, 이미지 상에서 타겟 객체에 대해 인식된 거리 정보 및 방향 정보를 이용하여, 데이터 통신 링크 상의 특정 장치(예: 타겟 장치)로부터의 신호가 이미지 상에서 인식된 거리 및 방향으로 부터 수신되고 있는지 여부에 기반하여 타겟 장치를 결정(또는 타겟 장치 선택)할 수 있다. 일 실시 예에 따르면, 전자 장치는 결정된 타겟 장치로부터의 신호에 기반하여 도래각 추정을 수행할 수 있다. 어떤 실시예에 따르면, 도 6에 예시한 바와 같이, 전자 장치는 AR 상에서 제공된 주변 장치들 에 대응하는 객체들 중, 사용자가 지시하는(예: AR 상에서 사용자 손 또는 시선 추적(eye tracking))에 의 해 선택되는) 객체를 타겟 객체로 결정하고, 결정된 타겟 객체에 대한 거리 정보 및 방향 정보를 인식할 수 있 다. 일 실시예에 따르면, 도 6에 예시한 바와 같이, 전자 장치는 도래각 추정의 첫 번째 동작(예: 제1 동작)에 서는 이미지 상에서 타겟 객체에 기반하여 인식된 거리 정보(예: distance) 및 방향 정보(예: angle(62 0))를 이용하여, 데이터 통신 링크 상에서의 타겟 장치를 결정하고, 결정된 타겟 장치로부터 송신된 신호에 기반하여 CIR 탭 선택을 수행함으로써, 1차적으로 멀티 패스에 의한 영향을 최소화 할 수 있다. 예를 들 어, 전자 장치는 이미지 상에서 인식된 거리 정보(예: distance) 및 방향 정보(예: angle)에 기반하여, 데이터 통신 링크 상에서 특정 기기로부터 수신된 신호가 이미지 상에서 인식된 거리 정보 및 방향 정보와 지정된 범위 내에 있다고 판단함에 기반하여 타겟 장치를 결정할 수 있다. 일 실시예에 따라, 도 7은 전자 장치에서 CIR 탭 선택을 수행하는 동작 예를 설명하기 위한 도면이다. 일 실시예에 따르면, 통신 시스템은 샘플링(sampling) 기반으로 동작하기 때문에, 도 5를 참조하여 설명한 CIR 이 일정한 탭 인터벌(tab interval)로 샘플링된 형태로 주어질 수 있다. 일 실시예에 따르면, 탭 인터벌 은 OFDM(orthogonal frequency division multiplexing) 샘플링 타임(sampling time) 또는 심볼 타임 (symbol time)을 나타낼 수 있다. 예를 들어, 도 7을 참조하면, 탭 1(Tab 1)은 첫 번째 샘플링된 값(또는 샘플링 데이터), 탭 2(Tab 2)는 두 번째 샘플링된 값, 탭 i(Tab i)는 i 번째 샘플링된 값, 및 탭 N(Tab N)은 N 번째 샘플링된 값으로 주어질 수 있다. 일 실시예에 따르면, 전자 장치는, 상기와 같이 일정한 인터벌로 샘플링된 복수의 탭들(701 내지 707) 중 에서, 도래각 추정에 사용할 관심 탭(tab of interest)(예: 탭 i(Tab i))을 선택할 수 있다. 일 실 시예에 따르면, 전자 장치는 관심 탭 선택에 있어서, 아래 <수학식 4>에 기반하여 선택할 수 있다. 수학식 4"}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "예를 들면, <수학식 4>에 나타낸 바와 같이, 전자 장치는 이미지 상에서 인식된 거리를 기반으로, 해당 거 리를 전자기파의 속도로 나눈 값에 해당하는 탭을 관심 탭으로 선택할 수 있다. 일 실시예에 따르면, 전자 장치는 상기와 같이 선택된 관심 탭을 이용하여 다음 동작(예: 제2 동작)에서 도래각 추정을 수행함으로써 멀티 패스의 영향을 완화할 수 있다. 예를 들면, 선택된 관심 탭은 도래각 추정의 입력으로 제공될 수 있다. 일 실시예에 따라, 도 8은 다른 유형의 통신 시스템에서 CIR 탭 선택 동작의 예를 설명하기 위한 도면이다. 예 를 들면, 도 8은 CIR 탭 선택이 여러 통신 시스템에서 수행되는 예를 나타낼 수 있다. 도 8에 도시한 바와 같이, 채널 추정(channel estimation)은, 예를 들면, 주파수 도메인(frequency domain)에서 채널 추정 또는 시간 도메인(time domain)에서 채널 추정이 수행되는 경우로 구분될 수 있다. 일 실시예에 따르면, 전자 장치는 802.11ax의 멀티 캐리어(multi carrier)(예: OFDM) 기반의 통신 시스템 에서는 주파수 도메인에서 채널 추정이 수행될 수 있다. 예를 들면, 전자 장치는 주파수 도메인에서 수행된 채널 추정 결과에 대하여 IFFT(inverse fast fourier transform)를 적용하여 시간 도메인 으로 전환할 수 있다. 일 실시예에 따라, 전자 장치는 시간 도메인으로 전환한 후, 추정된 거리 (estimated distance)에 따라 CIR 탭 선택을 수행할 수 있다. 일 실시예에 따르면, 전자 장치는 802.11ay의 싱글 캐리어(single carrier)(예: SC-FDMA(single carrier frequency division multiple access)) 기반 통신 시스템에서는 시간 도메인에서 채널 추정이 바로 수행 될 수 있다. 예를 들면, 전자 장치는 별도의 도메인 전환 없이, 추정된 거리에 따라 CIR 탭 선택을 수행할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 전술한 바에 대응하는 CIR 탭 선택을 수행한 후, 선택된 탭(예: 관심 탭)에 대하여 도래각 추정에 관련된 제2 동작을 수행할 수 있다. 예를 들면, 전자 장치는 CIR 탭 선택 동작에 기반하여, 1차적으로 멀티 패스에 의한 영향을 일정 부분 완 화할 수 있다. 하지만, 수십 또는 수백 MHz 정도의 대역폭(bandwidth)을 사용하는 일반적인 통신 시스템에서는, 기본적으로 CIR에서 패스의 분해능(resolution 또는 resolving power)이 높지 않을 수 있다. 따라서, CIR 탭 선택 이후에도 멀티 패스에 의한 영향이 남아 있을 수 있다. 다양한 실시예들에 따른 전자 장치는, CIR 탭 선택 이후에, 제1 추정 알고리즘(예: MVDR) 기반의 제2 동작과 제2 추정 알고리즘(예: MUSIC) 기반의 제3 동작 을 순차적으로 수행하여, 도래각 추정을 위한 추정 알고리즘들이 가지는 장점을 이용하여 도래각 추정의 정밀도 를 높일 수 있다. 일 실시예에 따르면, 도래각 추정에 사용하는 MUSIC 방식은 추정의 정밀도가 높을 수 있으나, 멀티 패스의 수가 안테나의 수보다 작은 경우에 정밀도가 높을 수 있다. 다른 실시예에 따르면, 도래각 추적에 사용하는 MVDR 방 식은 정밀도는 높지 않을 수 있으나, 특정 방향 외의 성분들이 잡음과 같이 처리되도록 빔(beam)을 형성(예: 빔 포밍)할 수 있다. 따라서, 이미지 상에서 추출한 관심 방향(예: 타겟 객체에 대응하는 방향)에 대하여 MVDR 방 식을 적용하면 해당 방향 외의 성분은 잡음과 같이 처리가 되어 신호 서브스페이스(signal subspace)의 유효 디 멘션(dimension)을 줄이는 효과를 가져올 수 있다. 따라서, MVDR 방식을 적용한 빔포밍을 통해 유효 디멘션을 줄이고, 이후 MUSIC 방식을 적용하는 경우 관심 방향에 대하여 정밀도 높은 도래각 추정을 수행할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 CIR 탭 선택 동작(예: 도래각 추정 제1 동작)으로 이미지 상에서 추정된 관심 탭(예: 관심 방향 또는 관심 각도)에 대하여, 관심 탭 외의 성분(예: 관심 방향 외의 다른 방향의 성분)을 잡음과 같이 처리하여 유효 디멘션을 줄이기 위한 제1 추정 알고리즘(예: MVDR)을 적용(예: 도래각 추 정 제2 동작)하고, 이후 추정 정밀도가 상대적으로 높은 제2 추정 알고리즘(예: MUSIC)을 적용하여, 관심 방향 에 대하여 높은 정밀도로 도래각 추정을 수행할 수 있다. 도 9는 다양한 실시예들에 따른 전자 장치에서 안테나 서브셋을 구성하는 예를 설명하기 위해 도시하는 도면이 다. 도 10은 다양한 실시예들에 따른 관심 방향을 기준으로 관심 영역을 설정하는 예를 설명하기 위해 도시하는 도면이다. 일 실시예에 따라, 도 9는 도래각 추정 제2 동작에서 제1 추정 알고리즘 적용을 위해 안테나 모듈의 복수 의 안테나들을 안테나 서브셋으로 분할하는 예를 나타낼 수 있다. 일 실시예에 따라, 이하에서는 본 개시의 이 해를 돕기 위해 제1 추정 알고리즘으로 MVDR 방식을 이용하고, 제2 추정 알고리즘으로 MUSIC 방식을 이용하는 것을 예로 설명하지만, 다양한 실시예들이 이에 제한되는 것은 아니다. MVDR 방식은 전자 장치의 전체 안 테나에 대하여 적용할 웨이트 벡터(weight vector)를 계산하고 있지만, 전체 안테나에 대하여 웨이트 벡터를 적 용하여 컴바이닝(combining)을 수행하게 되면, 출력(output)이 하나일 수 있고, 결과적으로 출력 디멘션(output dimension)이 ‘1’이 되어 이후에 MUSIC 방식을 적용할 수 없다. 따라서, 다양한 실시예들에서는 전체 안테나에 대하여 MVDR을 적용하는 대신에, 도 9에 예시한 바와 같이 전체 안테나를 여러 안테나 서브셋으로 나누고, 안테나 서브셋 단위로 MVDR 방식을 적용할 수 있다. 예를 들어, 전자 장치는 복수의 안테나들을 지정된 방 향을 기반으로 안테나 서브셋을 나눌 수 있다. 하나의 안테나 서브셋에 포함된 안테나들은 전자 장치에 배 치된 위치가 근접한 안테나일 수 있다. 도 9를 참조하면, 전자 장치는 복수의 안테나들(예: M 개의 안테나, M은 안테나들의 수)을 포함할 수 있고, 복수의 안테나들을 지정된 개수(예: N 개, N은 MVDR 적용을 위한 안테나 서브셋의 수)의 안테나를 포함하 는 복수의 안테나 서브셋(예: 제1 안테나 서브셋, 제2 안테나 서브셋, 제3 안테나 서브셋, 제N 안테나 서브셋)으로 분할할 수 있다. 일 실시예에 따라, 각각의 안테나 서브셋(910, 920, 930, 940)은 지정된 개수의 안테나(예: 도 9의 경우 3개의 안테나)를 포함하고, 안테나 서브셋(910, 920, 930, 940) 각각은, 적어도 하나의 안테나가 서로 인접한 안테나 서브셋에 포함될 수 있다. 예를 들어, 제3 안테나는 제1 안테 나 서브셋, 제2 안테나 서브셋 및 제3 안테나 서브셋에 포함될 수 있다. 예를 들어, 안테나 서 브셋(910, 920, 930, 940)에 포함되는 안테나들은 일부 중첩될 수 있다. 예를 들면, 안테나 서브셋에 MVDR을 적용한 후에 디멘션(또는 출력 디멘션(output dimension))은 안테나 서브셋 의 수에 비례(예: 안테나 서브셋의 수와 동일)할 수 있으므로, 디멘션의 수를 증가하려면 안테나 서브셋의 수가 많아져야 한다. 다양한 실시예들에서는, 복수의 안테나들을 지정된 개수(예: N 개, N은 MVDR 적용을 위한 안테 나 서브셋에 포함된 안테나 수)의 안테나 서브셋(910, 920, 930, ..., 940)으로 분할할 수 있다. 예를 들면, 전 자 장치는 슬라이딩 윈도우(sliding window) 형태로 하나의 안테나가 여러 안테나 서브셋에 속하도록 그룹 을 지정하여, 디멘션을 증가할 수 있다. 일 실시예에 따라, 전자 장치의 전체 안테나 수가 M 개이고, 각 안테나 서브셋(910, 920, 930, ..., 94 0)에 N 개(예: 3개)의 안테나들이 속한다고 가정할 수 있다. 예를 들어, 도 9에 예시한 바와 같이, 제1 안테나 서브셋, 제2 안테나 서브셋, 및 제3 안테나 서브셋을 예로 살펴볼 수 있다. 제1 안테나 서브셋 은 제1 안테나, 제2 안테나 및 제3 안테나를 포함하고, 제2 안테나 서브셋은 제2 안 테나, 제3 안테나 및 제4 안테나를 포함하고, 제3 안테나 서브셋은 제3 안테나, 제4 안테나 및 제5 안테나를 포함할 수 있다. 이러한 예시의 경우, 전자 장치는 슬라이딩 윈도우 형 태로 적어도 하나의 안테나가 서로 중첩되는 안테나 서브셋(910, 920, 930, ..., 940)을 생성할 수 있고, 안테 나 서브셋(910, 920, 930, ..., 940) 단위로 MVDR을 순차적으로 적용(sequentially applying)하고, 안테나 서 브셋(910, 920, 930, ..., 940)에 각각 대응하는 출력(output)(예: output 1, output 2, output 3, ..., output M-N+1)을 생성할 수 있다. 예를 들면, 도 9의 예시와 같이, 전제 안테나 수 가 M 개이고, 각 안테나 서브셋(910, 920, 930, ..., 940)에 N 개의 안테나들이 포함되는 안테나 서브셋(910, 920, 930, ..., 940)을 생성하는 경우, 안테나 서브셋(910, 920, 930, ..., 940) 단위로 MVDR을 적용할 시, 출 력 디멘션은 M-N+1과 같이 나타낼 수 있다. 일 실시예에 따르면, MVDR 방식은 특정 방향(θ)에 대하여 웨이트 벡터를 설정하게 되는데, 다양한 실시예들에 서는, 안테나 서브셋 단위에서 웨이트 벡터가 설정될 수 있다. 일 실시예에 따르면, 전자 장치는 도 10에 예시한 바와 같이, 관심 방향(또는 관심 각도)을 기준으 로 정밀도 높은 도래각 추정을 수행하기 위한 관심 영역을 설정할 수 있다. 예를 들면, 관심 방향은 이미 지 상에서 타겟 객체로부터 추정된(또는 인식된) 타겟 장치의 방향을 나타낼 수 있고, 관심 영역은 해당 관심 방향을 기준으로 일정한 마진(margin)이 설정된 상한 경계(예: upper boundary angle) 및 하한 경 계(예: lower boundary angle)를 나타낼 수 있다. 예를 들면, 전자 장치는 관심 방향, 상한 경계에 대응하는 상한 방향 및 하한 경계에 대응하는 하한 방향의 세가지 방향에 대하여 웨이트 벡터를 설 정하고, 세가지 방향에 대응하는 웨이트 벡터의 합을, 각 안테나 서브셋(910, 920, 930, ..., 940)에서 적용할 최종 웨이트 벡터로 결정할 수 있다. 도 10에 예시한 관심 방향 영역은 전자 장치의 지정된 기준점(예: 카 메라 FOV의 중심점)을 기준으로 결정될 수 있다. 예를 들어, 전자 장치의 지정된 기준점이 지시하는 방향 을 기준으로 센서 모듈을 통해 파악한 사용자의 시선이 향하는 방향 또는 센서 모듈 또는 카메라 모 듈을 통해 파악한 사용자의 신체가 지시하는 방향이 관심 방향 영역으로 설정될 수 있다. 다양한 실시예들에 따르면, 전자 장치는 안테나 서브셋(910, 920, 930, ..., 940)에 대하여 MVDR을 적용하 여 획득된 출력에 대하여 도래각 추정에 관련된 제3 동작을 수행할 수 있다. 일 실시예에 따르면, 전자 장 치는 안테나 서브셋(910, 920, 930, ..., 940) 단위로 MVDR을 적용한 후 획득된 M-N+1 개의 출력들 에 대하여 MUSIC을 적용할 수 있다. 예를 들면, 전자 장치는 M-N+1 개의 출력들에 대하여 상관 행렬(correlation matrix)을 계산하고, 상관 행렬에 대하여 고유값 분해(eigenvalue decomposition)를 수행하여 신 호 서브스페이스(signal subspace)를 이루는 고유 벡터(eigenvector)들과 잡음에 의한 서브스페이스를 이루는 고유 벡터들을 분리할 수 있다. 도 10에서 설명한 바와 같이, 관심 영역 내의 가능한 입사각(θ)이 잡음에 의한 서브스페이스를 이루는 고유 벡 터들과 수직한 정도를 측정하여, 입사각(θ) 방향에서 입사되는 성분의 유무를 추정할 수 있다. 일 실시예에 따 라, 수직한 정도는 아래 <수학식 5>와 같이 나타낼 수 있다. 수학식 5"}
{"patent_id": "10-2020-0107208", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "<수학식 5>에서, QN은 잡음에 의한 서브스페이스를 이루는 고유 벡터들로 이루어진 행렬을 나타내며, H는 켤레 전치(conjugate transpose) 연산을 나타내며, θ는 입사각을 나타내며, a(θ)는 입사각(θ)에 따른 위상(phase) 차이를 나타낼 수 있다. 일 실시예에 따르면, 전자 장치는 입사각(θ)이 행렬 QN에 대하여 수직한 정도를 <수학식 5>의 예시와 같 이 측정하여, 가장 큰 값을 가지는 각도(θ)(또는 방향)가 관심 영역의 경계(예: 하한 경계 및 상한 경계) 내부 에서, 관심 방향에 가까운 곳에 위치하는지 여부를 확인함으로써, 최종적으로 도래각 추정을 완료할 수 있다. 예를 들면, 전자 장치는 주변 장치(예: 후보(candidate) 장치) 중에서 관심 방향과 가장 가까 운 방향에서 가장 큰 값을 가지는 방향이 설정되는 장치를 이미지 상에서 인식된 타겟 장치로 판단할 수 있다. 어떤 실시예에 따르면, 전자 장치는 상기에서 가장 큰 값을 가지는 각도(θ)가 관심 영역의 상한 경계 및/ 또는 하한 경계에 위치하는 경우에는 해당 각도(θ)가 관심 영역 밖에 위치하는 것으로 처리할 수 있다. 예를 들면, 각도(θ)가 관심 영역의 상한 경계 및/또는 하한 경계에 위치하는 경우는, 관심 영역 밖에 있는 방향에서 입사되는 멀티 패스에 의한 영향일 수 있으며, 전자 장치에서는 해당 방향이 관심 영역 밖에 있는 것으로 판단하도록 함으로써, 오류 검출 비율(false detection rate)을 낮추도록 할 수 있다. 도 11a 및 도 11b는 다양한 실시예들에 따른 전자 장치에서 도래각 추정의 결과 예를 설명하기 위해 도시하는 도면들이다. 일 실시예 따라, 도 11a는 관심 방향(예: 타겟 위치)이 약 90도 방향에 있는 경우, 멀티 패스 성분(multi path components)의 예를 나타낼 수 있다. 예를 들면, 도 11a는 전자 장치의 안테나 수와 멀티 패스의 수가, 예 를 들면, 각각 10개인 상황(또는 환경)에서, 멀티 패스 성분의 각도에 따른 분포 및 크기의 예를 나타낼 수 있 다. 일 실시예에 따라, 도 11b는 MVDR에 의한 도래각 추정 결과, MUSIC에 의한 도래각 추정 결과 및 본 개시의 하이브리드(hybrid) 도래각 추정 결과의 예를 나타낼 수 있다. 예를 들면, 도 11b는 도 11b와 같은 상황에서, MVDR, MUSIC, 및 본 개시의 하이브리드 도래각 추정을 수행한 결과의 예를 나타낼 수 있다. 도 11a을 참조하면, 엘리먼트 1101은 프라이머리 성분(primary component)(예: 관심 방향의 패스 성분)을 나타 낼 수 있고, 엘리먼트 1103은 멀티 패스 성분(multi path components)(예: 관심 방향 외의 패스 성분)을 나타낼 수 있다. 도 11b를 참조하면, MVDR에 의한 도래각 추정 결과와 MUSIC에 의한 도래각 추정 결과로 예시한 바 와 같이, 각 각도에 따른 크기가 도 11a의 멀티 패스 성분의 분포를 대략적으로 유사하게 따라가는 경향을 확인 할 수 있다. 하지만, MVDR에 의한 도래각 추정 결과와 MUSIC에 의한 도래각 추정 결과의 경우, 프 라이머리 성분의 관심 방향(예: 90도 방향)에 위치한 메인(main) LOS(line-of-sight) 패스(예를 들어, 타겟을 향하는 최단 거리 방향)가 정상적으로 검출되지 않는 것을 확인할 수 있다. 예를 들면, 도 11a 및 도 11b에서는 메인 LOS 패스가 90도 방향에 위치하는 상황이고, 해당 방향의 타겟 장치를 이미지 상에서 인식하여 90도 방향을 관심 방향으로 설정한 것을 가정할 수 있다. 이러한 상황에서, 본 개시의 하이브리드 방식의 경우, 관심 방향(예: 90도 방향)에 대하여 MVDR 및 MUSIC을 각각 적용하였을 때, 관심 방향에 대응 하여 감도가 높은 도래각 추정이 이루어지는 것을 확인할 수 있다. 예를 들면, 기존 MUSIC 또는 MVDR이 멀티 패스 성분에 의하여 메인 LOS 패스를 검출하지 못하는 상황에서, 본 개시에서 제안된 도래각추정은 메인 LOS 패스를 보다 정확히 검출할 수 있다. 도 12a 및 도 12b는 특정 환경에서 관심 영역을 기반으로 도래각 추정을 수행한 결과 예를 설명하기 위해 도시 하는 도면들이다. 일 실시예에 따르면, 도 12a 및 도 12b는 도 11a에서 설명한 바와 같은 상황에서, 관심 방향(예: 약 90도 방 향)을 기준으로 상한 경계 및 하한 경계를 지정된 각도(예: 약 ±10도))로 설정하고, 도래각 추정을 일정 횟수 반복 수행한 결과 예를 나타낼 수 있다. 도 12a를 참조하면, 도 12a는 피크 각도 분포(peak angle distribution)의 예를 나타낸 것으로, 예를 들면, 본 개시의 도래각 추정에 의해 관심 영역 내에서 잡음에 의한 서브스페이스를 이루는 고유 벡터들과 가장 수직한 것으로 판단된 방향의 분포 예를 나타낼 수 있다. 도 12a에 도시한 바와 같이, 관심 방향(예: 90도 방향) 근처 에서 높은 빈도를 가지는 형태의 분포가 형성되는 것을 확인할 수 있다. 도 12b를 참조하면, 도 12b는 평균제곱오차(mean square error)에 대한 예를 나타낼 수 있다. 도 12b에 도시한 바와 같이, MUSIC 및 MVDR이 멀티 패스 성분에 의해 도래각 추정에 있어서 많은 에러(error)가 발 생하는 것을 확인할 수 있다. 이에 비하여, 본 개시의 실시예에 따른 하이브리드 방식의 경우 정밀도가 MUSIC 및 MVDR에 비해 상대적으로 매우 높게 나타나는 것을 확인할 수 있다. 도 13은 일 실시예에 따라 관심 방향과 입사각 사이의 불일치 시의 결과를 도시하는 도면이다. 도 13을 참조하면, 도 13은 관심 방향과 실제 입사각 사이의 불일치 하는 경우에서의 피크 각도 분포의 예를 나 타낼 수 있다. 예를 들면, 도 13에서는 이미지로부터 설정한 관심 방향이 약 150도인 상황에서 실제 메인 LOS 패스가, 예를 들면, 약 90도 방향에 위치하는 경우에 대해서, ±10도 마진(예: 상한 경계 및 하한 경계)으로 주 어지는 관심 영역 내에서 가장 수직한 것으로 판단한 방향의 분포 예를 나타낼 수 있다. 도 13에 도시한 바와 같이, 관심 영역 밖에 실제 메인 LOS 패스의 방향이 있기 때문에, 관심 영역의 경계(예: 상한 경계 또는 하한 경계)에서 주로 분포를 이루어야 오 탐지(false detection)를 줄일 수 있다. 도 14는 다양한 실시예들에 따른 전자 장치의 동작을 도시하는 흐름도이다. 일 실시예에 따라, 도 14는 다양한 실시예들에 따른 전자 장치에서 본 개시의 실시예에 따른 하이브리드 도래각 추정을 수행하는 동작의 예를 나타낼 수 있다. 도 14를 참조하면, 동작 1401에서, 전자 장치의 프로세서는 이미지로부터 인식된 장치(예: 타겟 장치)의 방향 정보 및 거리 정보를 추정할 수 있다. 일 실시예에 따르면, 프로세서는 디스플레이 모듈 을 통해 표시된 이미지 상에서 인식 또는 지정된 타겟 객체(예: 타겟 장치에 대응하는 이미지)에 대해 거 리 및 방향을 추정할 수 있다. 일 실시예에 따르면, 프로세서는 전자 장치의 카메라 모듈을 통 해 획득된 이미지를 전자 장치의 통신 모듈을 통해 외부 장치(예: 도 2의 외부 장치)에 전송하 고, 통신 모듈을 통해 외부 장치로부터 적어도 하나의 객체를 포함하는 AR 이미지를 수신할 수 있다. 일 실시예에 따르면, 프로세서는 디스플레이 모듈을 통해 외부 장치로부터 수신된 AR 이미지를 표시할 수 있다. 일 실시예에 따르면, 프로세서는 수신된 AR 이미지 상의 적어도 하나의 객체 중에서 타겟 객체를 인식하고, 인식된 타겟 객체에 대해 거리 및 방향을 추정할 수 있다. 일 실시예에 따르면, 프로세서는 전 자 장치의 적어도 하나의 센서(예: 센서 모듈, 카메라 모듈)를 이용한 센싱 정보에 기반하여, 타겟 객체와의 거리 및 방향을 측정할 수 있다. 예를 들면, 프로세서는 적외선 센서, ToF 센서(또는 ToF 카메라), AR 카메라, 및/또는 차세대 AR 카메라(예: 라이다(lidar) 센서)와 같은 적어도 하나의 센서를 이용하 여 피사체(예: 타겟 장치)를 향해 지정된 신호(예: 적외선, 광원, 레이저)를 출력하고, 출력된 신호가 피사체에 반사되어 돌아오는 시간을 측정하여 AR 화면을 통해 제공된 이미지(예: 타겟 객체)와의 거리 및 방향을 추정할 수 있다. 동작 1403에서, 프로세서는 CIR 탭 선택을 수행할 수 있다. 일 실시예에 따르면, 프로세서는 도래각 추정을 위한 제1 동작으로 멀티 패스에 의한 영향을 줄이기 위해 CIR 탭 선택 동작을 수행할 수 있다. 일 실시 예에 따르면, 프로세서는 이미지 상에서 특정 객체(예: 타겟 장치)에 대해 추정된 거리 및 방향을 이용하 여 CIR 탭 선택을 수행할 수 있다. 예를 들면, 프로세서는 일정한 인터벌로 샘플링된 복수의 탭들(예: 도 7의 탭(701 내지 707)) 중에서, 도래각 추정에 사용할 관심 탭(예: 도 7의 탭)을 선택할 수 있다. 일 실시 예에 따르면, 프로세서는 이미지 상에서 인식된 거리를 기반으로, 해당 거리를 전자기파의 속도로 나눈 값 에 해당하는 탭을 관심 탭으로 선택할 수 있다. 일 실시예에 따라, 프로세서는 선택된 관심 탭을 도래각추정의 입력(input)으로 결정할 수 있다. 동작 1405에서, 프로세서는 전자 장치의 복수의 안테나들(예: 어레이 안테나)이 지정된 개수로 그룹 화된 안테나 서브셋을 식별할 수 있다. 일 실시예에 따르면, 프로세서는 전자 장치의 전체 안테나를 복수의 안테나 서브셋으로 나누고, 안테나 서브셋 단위로 MVDR을 적용할 수 있다. 일 실시예에 따르면, 프로세 서는 복수의 안테나들을 지정된 개수(예: MVDR 적용을 위한 안테나 서브셋의 수)의 안테나 서브셋(예: 도 9의 안테나 서브셋)으로 분할할 수 있다. 일 실시예에 따라, 프로세서는 안테나 서브셋 마다 지 정된 개수의 안테나를 포함하고, 안테나 서브셋의 적어도 하나의 안테나가 서로 인접한 안테나 서브셋에 포함되도록 분할할 수 있다. 일 실시예에 따르면, 프로세서는 MVDR 적용 후의 출력 결과(예: 출력 디멘 션)의 수를 최대 증가할 수 있도록 안테나 서브셋의 수가 최대를 가지도록 구성할 수 있다. 예를 들면, 프로세 서는 복수의 안테나들을 지정된 개수의 안테나를 포함하는 복수개의 안테나 서브셋으로 분할할 수 있 다. 예를 들면, 프로세서는 슬라이딩 윈도우(sliding window) 형태로 하나의 안테나가 여러 안테나 서브셋 에 속하도록 그룹을 지정하여, 디멘션을 증가할 수 있다. 동작 1407에서, 프로세서는 안테나 서브셋에 기반하여 지정된 제1 추정 알고리즘(예: MVDR)을 적용할 수 있다. 일 실시예에 따르면, 프로세서는 안테나 서브셋에 대하여 이미지 상에서 추정된 방향을 이 용하여 MVDR을 적용할 수 있다. 예를 들면, 프로세서는 이미지로부터 인식한 방향 정보를 이용하여 관심 방향을 설정하고, 설정된 관심 방향에 대하여 그룹화된 안테나 서브셋들에 대하여 MVDR을 적용할 수 있다. 일 실시예에 따르면, 프로세서는 슬라이딩 윈도우 형태로 서로 겹치는 안테나 서브셋 단위로 MVDR을 순 차적으로 적용(sequentially applying)할 수 있다. 동작 1409에서, 프로세서는 제1 추정 알고리즘에 적용에 따른 안테나 서브셋의 출력(예: 도 9의 출력 )을 획득할 수 있다. 일 실시예에 따르면, 프로세서는 안테나 서브셋에 대하여 MVDR을 적용하여 복수의 출력(output) 결과를 획득할 수 있다. 예를 들면, 프로세서는 안테나 서브셋에 각각 대응하는 출력(또는 출력 디멘션)을 생성할 수 있다. 예를 들면, 도 9의 예시와 같이, 전제 안테나 수가 M 개이고, 각 안테나 서브셋에 N 개의 안테나들이 포함되는 안테나 서브셋을 생성하는 경우, 프로세서는 안테나 서브셋 단위로 MVDR을 적용하여, M-N+1 개의 출력을 획득할 수 있다. 동작 1411에서, 프로세서는 출력에 대하여 지정된 제2 추정 알고리즘(예: MUSIC)을 적용할 수 있다. 일 실 시예에 따르면, 프로세서는 안테나 서브셋 단위로 MVDR을 적용한 출력에 대하여 MUSIC을 적용하 여 도래각 추정을 완료할 수 있다. 일 실시예에 따르면, 프로세서는 안테나 서브셋 단위로 MVDR을 적 용하여 획득된 M-N+1 개의 출력에 대하여 MUSIC을 적용할 수 있다. 예를 들면, 프로세서는 출력(95 0)에 대하여 상관 행렬(correlation matrix)을 계산하고, 상관 행렬에 대하여 고유값 분해(eigenvalue decomposition)를 수행하여 신호 서브스페이스(signal subspace)를 이루는 고유 벡터(eigenvector)들과 잡음에 의한 서브스페이스를 이루는 고유 벡터들을 분리하고, 신호 서브스페이스에 기반하여 도래각 추정을 완료할 수 있다. 도 15는 다양한 실시예들에 따른 도래각 추정 방법을 테더드 AR 시스템에서 동작하는 예를 설명하기 위해 도시 하는 도면이다. 일 실시예에 따르면, 테더드 AR 시스템의 경우, 전자 장치는 AR 동작 시에, 외부 장치로부터 관련 데 이터(예: AR 이미지)를 수신할 수 있고, 수신된 데이터를 디스플레이 모듈을 통해 현실 세계 데이터와 함 께 제공할 수 있다. 일 실시예에 따르면, 글래스 타입(glasses type)의 전자 장치는 사용자의 신체(예: 머리)에 착용한 상태에 서 AR을 위한 동작을 수행하기 때문에, 전자 장치의 무게가 사용자(예: 소비자) 사용성 측면에서 매우 중 요한 요소가 될 수 있다. 따라서, 전자 장치의 가벼운 무게를 위해서, 일반적으로 전자 장치는 AR 서 비스를 제공하기 위해 전자 장치의 상태 정보 및 또는 전자 장치 주변의 환경 정보를 획득하기 위해 필요한 구성 요소(예: 카메라 모듈, 디스플레이 모듈, 또는 센서 모듈)를 포함하도록 구성될 수 있고, 전자 장 치가 독립적으로 동작하지 않고 다른 프로세싱(processing) 장치(예: 외부 장치)와 연결되어 AR을 제 공하는 테더드 AR 시스템 형태로 구현될 수 있다. 예를 들면, 도 15에 예시한 바와 같이, 전자 장치는 외부 장치(예: 프로세싱 장치)에 이미지(예: 카 메라 모듈을 통해 획득된 이미지) 및 센서 정보(예: 센서 모듈를 통해 획득된 정보)와 같은 뷰 정보 (view information)를 외부 장치에 전달할 수 있다. 예를 들면, 전자 장치는 외부 장치와 연결 시에 외부 장치로 이미지, 장치 정보, 센서 정보, 기능 정보 및/또는 위치 정보와 같은 적어도 하 나의 정보를 제공(예: 전송)할 수 있다. 일 실시예에 따르면, 외부 장치는 전자 장치로부터 획득된 이미지를 렌더링(rendering)할 수 있고, 렌더링된 이미지(rendered image)를 전자 장치에 전달할 수 있다. 일 실시예에 따르면, 전자 장치와 외부 장치는 근거리 네트워크를 통해 통신 연결될 수 있 다. 예를 들어, 근거리 네트워크는 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 데이터 통신 링크 상에서 주변 장치로부터 프로빙 신호(probing signal)을 수신하여, 본 개시의 실시예에 따른 도래각 추정을 수행할 수 있다. 어떤 실시예에 따르면, 테더드 AR 시스템에서, 전자 장치는 경량화를 위해 저성능 및 최소한의 구성 요소를 포함하도록 구현될 수 있다. 따라서, 전자 장치는 복잡도 높은 도래각 추정 연산을 수행하기 어려울 수 있다. 또한, 도래각 추정 연산 전부를 외부 장치에서 수행하도록 하는 경우에는, 전자 장치가 주변 장치로부터 수신한 프로빙 신호를 통해 수행한 로우 채널(raw channel) 정보를 외부 장치에 모두 전달해야 한다. 하지만, 모든 로우 채널 정보를 전달하는 경우, 많은 데이터량으로 인해, 전자 장치의 소모 전류 증가 및 양자화 에러 (quantization error)에 의한 추정 정밀도 저하와 같은 문제가 발생할 수 있다. 다양한 실시예들에서는, 본 개 시의 실시예에 따른 도래각 추정에서 연산 복잡도가 높지 않은 부분과 연산 복잡도가 높은 부분을 구분하여, 전 자 장치와 외부 장치에서 도래각 추정에 관련된 동작을 분산 수행하도록 할 수 있다. 예를 들면, 테 더드 AR 시스템과 같은 환경에서는, 본 개시의 실시예에 따른 전자 장치의 도래각 추정을 위한 일부 동작 을 외부 장치와 분산 처리하도록 할 수 있다. 이의 예가 도 16에 도시된다. 도 16은 다양한 실시예들에 따른 테더드 AR 시스템에서 도래각 추정을 수행하는 동작 예를 도시하는 도면이다. 일 실시예에 따르면, 테더드 AR 시스템에서, 본 개시의 실시예에 따른 도래각 추정을 수행하기 위해서는, 전자 장치와 외부 장치 사이에서 데이터 교환과 프로토콜(protocol)의 정의가 필요할 수 있으며, 도 16은 이의 예를 나타낼 수 있다. 도 16을 참조하면, 동작 1601에서, 전자 장치는 외부 장치와 연결 시에, 전자 장치의 카메라 모 듈을 통해 획득되는 이미지를 외부 장치로 전송할 수 있다. 일 실시예에 따르면, 전자 장치는 센서 모듈을 통해 획득한 전자 장치의 상태 정보를 외부 장치로 전송할 수 있다. 예를 들어, 상 태 정보는 전자 장치의 움직임 정보 또는 시선 추적 카메라를 통해 획득한 사용자의 시선 위치 정보를 포 함할 수 있다. 동작 1603에서, 외부 장치는 전자 장치로부터 수신된 이미지에 기반하여 추정된 거리 정보 및 방향 정보를 전자 장치로 전송할 수 있다. 예를 들면, 외부 장치는 전자 장치로부터 이미지를 수신하 고, 수신된 이미지에 대하여, 이미지 프로세싱(image processing)을 통해, 수신된 이미지 상에서 타겟 장치를 인식할 수 있다. 다른 예를 들어, 외부 장치는 전자 장치로부터 수신된 이미지와 전자 장치의 상태 정보에 기반하여 타켓 장치를 인식할 수 있다. 일 실시예에 따르면, 외부 장치는 이미지 상에서 타겟 장치를 인식하는 경우, 타겟 장치와의 관심 정보(예: 거리 정보 및 방향 정보)를 추정하여 전자 장치에 전 송할 수 있다. 동작 1605에서, 전자 장치는 외부 장치로부터 수신된 관심 정보에 기반하여 CIR 탭 선택 및 제1 추정 알고리즘(예: MVDR)을 적용할 수 있다. 일 실시예에 따르면, 전자 장치는 도래각 추정 동작 중, 연산 복잡 도가 상대적으로 낮은 제1 추정 알고리즘에 기반한 도래각 추정 동작을 처리하도록 할 수 있다. 예를 들면, MVDR과 같은 추정 알고리즘은 단순 덧셈 및/또는 곱셈으로 이루어질 수 있으며, 연산 복잡도가 낮은 부분에 대 하여, 전자 장치에서 연산을 수행하도록 할 수 있다. 동작 1607에서, 전자 장치는 제1 추정 알고리즘 적용 후의 출력을 외부 장치로 전송할 수 있다. 동작 1609에서, 외부 장치는 전자 장치로부터 수신된 출력에 대하여 제2 추정 알고리즘(예: MUSIC)을 적용하고 타겟 장치 매핑을 수행할 수 있다. 일 실시예에 따르면, 외부 장치는 도래각 추정 동작 중, 연산 복잡도가 상대적으로 높은 제2 추정 알고리즘에 기반한 도래각 추정 동작을 처리하도록 할 수 있다. 예를 들면, MUSIC와 같은 추정 알고리즘은 복잡도가 높은 연산들로 이루어질 수 있으며, 연산 복잡도가 높은 부분에 대하여, 상대적으로 고성능의 외부 장치에서 연산을 수행하도록 할 수 있다. 예를 들면, 외부 장치는 전자 장치로부터 수신된 출력에 대하여 MUSIC을 적용하여 도래각 추정을 완료할 수 있다. 동작 1611에서, 외부 장치는 렌더링된 이미지(rendered image)를 전자 장치로 전송할 수 있다. 일 실 시예에 따르면, 외부 장치는 도래각 추정의 결과로, 전자 장치로부터 수신된 이미지 상에서 인식된 타겟 객체에 대응하는 타겟 장치가 매핑된 이미지를 전자 장치로 제공할 수 있다. 도 17은 다양한 실시예들에 따른 도래각 추정을 이용할 수 있는 전자 장치의 다른 예를 설명하기 위해 도시하는 도면이다. 일 실시예에 따라, 도 17은 다양한 실시예들에 따른 AR 서비스를 지원하는 전자 장치의 다른 예를 나타낼 수 있다. 일 실시예에 따르면, 도 17에 예시한 바와 같이, 본 개시의 실시예에 따른 도래각 추정 동작은, 예를 들면, 카 메라 모듈(예: 도 3의 카메라 모듈), 디스플레이 모듈(예: 도 3의 디스플레이 모듈) 및 통신 모듈(예: 도 3의 통신 모듈)을 포함하는 다양한 폼 팩터(form factor)의 전자 장치에서 수행할 수 있 다. 예를 들면, 도 17은 다양한 실시예들에 따른 디스플레이 형태에 따른 전자 장치의 다양한 폼 팩터의 예를 나타낼 수 있다. 일 실시예에 따르면, 전자 장치는 바형(bar type) 또는 평판형(plate type), 폴더블(foldable)(1720, 1730 또는 1740), 롤러블(rollable), 및/또는 슬라이더블(slidable)과 같 은 다양한 폼 팩터를 포함할 수 있다. 예를 들면, 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 글래스형 외관을 가지고 있지만, 본 발명이 이에 한정되지 않는다. 예를 들어, 일 실시예에 따른 전자 장치 는 바형 또는 평판형 전자 장치, 폴더블 전자 장치(1720, 1730 또는 1740), 롤러블 전자 장치 또는 슬라이더블 전자 장치의 일부일 수 있다. 일 실시예에 따라, 폴더블 전자 장치(1720, 1730 또는 1740)는 디스플레이 모듈의 서로 다른 두 영역을 실 질적으로 마주보게 또는 서로 반대 방향을 향하는(opposite to) 방향으로 접힘이 가능한 전자 장치를 의미할 수 있다. 예를 들어, 폴더블 전자 장치(1720, 1730 또는 1740)에서 디스플레이 모듈은 접힘 상태(folded state)에서 서로 다른 두 영역이 마주보는 상태 또는 반대 방향으로 향하는 상태가 될 수 있고, 디스플레이 모 듈은 펼침 상태(unfolded state)에서 서로 다른 두 영역이 실질적으로 평판 형태를 이루는 상태가 될 수 있다. 일 실시예에 따르면, 폴더블 전자 장치(1720, 1730 또는 1740)는 디스플레이 모듈의 서로 다른 두 영역에 대응하는 하우징(미도시)의 적어도 일부에 카메라 모듈 및 안테나 모듈을 포함할 수 있고, 카 메라 모듈 및 안테나 모듈은 디스플레이 모듈의 상태에 따라 외부로 향하는 방향이 달라질 수 있다. 일 실시예에 따르면, 폴더블 전자 장치(1720, 1730 또는 1740)는 하나의 폴딩 축에 기반하여 2개의 디스플레이 면(예: 제1 디스플레이 면 및 제2 디스플레이 면)을 포함하는 폼 팩터(예: 1720 또는 1730) 및/또는 적어도 2개 의 폴딩 축에 기반하여 적어도 3개의 디스플레이 면(예: 제1 디스플레이 면, 제2 디스플레이 면 및 제3 디스플 레이 면)을 포함하는 폼 팩터(예: 1740)를 포함할 수 있다. 다양한 실시예들이 이에 한정되는 것은 아니며, 이 는 예시적인 것으로, 전자 장치가 가질 수 있는 폴딩 축들의 수는 제한하지 않는다. 일 실시예에 따르면, 폴더블 전자 장치(1720, 1730 또는 1740)는 구현 형태에 따라 디스플레이 모듈이 다양한 방식(예: 인-폴딩, 아웃-폴딩, 또는 인/아웃 폴딩)으로 폴딩 또는 언폴딩 될 수 있다. 일 실시예에 따르면, 폴더블 전자 장치(1720, 1730 또는 1740)는 세로 폴더블, 가로 폴더블, G 폴더블, 또는 Z 폴더블과 같이 다양한 폴더블 방식 을 포함할 수 있다. 일 실시예에 따라, 롤러블 전자 장치 또는 슬라이더블 전자 장치는, 디스플레이 모듈의 굽힘 변형이 가능해, 적어도 일부분이 말아지거나(wound or rolled), 하우징(미도시)의 내부로 수납될 수 있는 전자 장치를 의미할 수 있다. 사용자의 필요에 따라, 롤러블 전자 장치 또는 슬라이더블 전자 장치는 디 스플레이 모듈을 펼침으로써 또는 디스플레이 모듈의 더 넓은 면적을 외부로 노출시킴으로써 화면 표 시 영역을 확장하여 사용할 수 있다. 일 실시예에 따르면, 롤러블 전자 장치 또는 슬라이더블 전자 장치 는 롤-업(roll-up) 방식의 디스플레이(예: 롤러블 디스플레이(rollable display)))를 포함하는 폼 팩터 를 포함할 수 있다. 일 실시예에 따라, 롤러블 전자 장치 또는 슬라이더블 전자 장치는, 사용자가 디스플레이 모듈을 펼치는 정도에 따라, 디스플레이가 외부로 노출되는 면적이 달라질 수 있다. 일 실시예 에 따르면, 롤러블 전자 장치 또는 슬라이더블 전자 장치는 디스플레이 모듈의 서로 다른 두 영역에 대응하는 하우징(미도시)의 적어도 일부에 카메라 모듈 및 안테나 모듈을 포함할 수 있고, 카 메라 모듈 및 안테나 모듈은 디스플레이 모듈의 상태에 따라 외부로 향하는 방향이 달라질 수 있다. 일 실시예에 따르면, 도 17에 예시한 바와 같이, 전자 장치는 다양한 형태로 구현될 수 있고, 전자 장치 의 구현 형태에 따라 디스플레이 모듈, 카메라 모듈 및/또는 통신 모듈(예: 도 3의 안테나모듈)이 다양한 방식으로 배치될 수 있다. 예를 들면, 폴더블 전자 장치(1720, 1730 또는 1740), 롤러블 전자 장치 또는 슬라이더블 전자 장치인 경우, 디스플레이 모듈이 접힘 상태 또는 펼침 상태 에 따라 카메라 모듈 및 안테나 모듈의 위치가 다를 수 있다. 일 실시예에 따르면, 전자 장치의 폼 팩터에 따른 동작 상태(예: 디스플레이 모듈의 펼침 또는 접힘 상태)에 따라 본 개시의 실시예에 따른 도래각 추정 동작에 적용하기 위해 사용하는 안테나 수 또는 안테나 서 브셋 수가 다를 수 있다. 예를 들어, 전자 장치에 안테나가 12개(예: 디스플레이 모듈의 서로 다른 두 영역 중 제1 영역에 N개 및 제2 영역에 M개) 존재하는 경우를 가정할 수 있다. 일 예로, 전자 장치가 펼침 상태에서는 두 영역에 위치된 12개의 안테나를 모두 이용하여 도래각 추정을 수행할 수 있다. 다른 예로, 전자 장치가 접힘 상태에서는 카메라 모듈이 향하는 방향(예: 사용자가 바라보는 전면 방향)에 위치 (또는 카메라 모듈이 배치된 영역(예: 제1 영역 또는 제2 영역)에 위치)하는 안테나(예: 제1 영역의 N개 안테나 또는 제2 영역의 M개 안테나)만을 이용하여 도래각 추정을 수행할 수 있다. 다른 예를 들어, 전자 장치 는 동작 상태(예: 디스플레이 모듈의 펼침 또는 접힘 상태)에 기반하여 도래각 추정 동작에 적용하기 위해 사용하는 안테나 서브셋을 다르게 설정할 수 있다. 일 예로, 전자 장치가 펼침 상태에서는 N개의 안 테나 서브셋을 사용하고, 전자 장치가 접힘 상태에서는 M개의 안테나 서브셋을 사용하여 도래각 추정을 수 행할 수 있다. 다양한 실시예들에 따르면, 본 개시의 실시예에 따른 도래각 추정 동작은, 전자 장치에서 독립적으로 (independently) 수행하거나, 컴퓨팅 호스트로 동작 가능한 다른 전자 장치(예: 외부 장치)와 작동적으로 연결하여 수행할 수 있다. 예를 들면, 본 개시의 실시예에 따른 하이브리드 방식의 도래각 추정에 있어서, 복잡 도가 낮은(또는 연산량이 적은) 연산에 대하여 전자 장치에서 처리하고, 복잡도가 높은(또는 연산량이 많 은) 연산에 대하여 상대적으로 고성능의 외부 장치에서 처리하는 것과 같이, 분산 처리하도록 동작할 수 있다. 본 개시의 다양한 실시예들에 따른 전자 장치에서 수행하는 동작 방법은, 상기 전자 장치의 카메라 모듈을 통해 이미지를 획득하는 동작, 상기 획득된 이미지의 적어도 일부를 통신 모듈을 통해 외부 전자 장치로 전송하는 동작, 상기 외부 전자 장치로부터 상기 전송한 이미지에 기반한 적어도 하나의 객체를 포 함하는 AR(augmented reality) 이미지를 수신하는 동작, 상기 전자 장치의 디스플레이 모듈을 통해 AR 이미지를 표시하는 동작, 상기 적어도 하나의 객체 중에서 타겟 객체를 인식하는 동작, 상기 통신 모듈(19 0)을 통해 데이터 통신 링크(data communication link) 상에서 검색된 주변 장치들 중 하나를 상기 인식된 타겟 객체에 대응하는 타겟 장치로 매핑하는 동작을 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 매핑하는 동작은, 상기 AR 이미지 상에서 상기 타겟 객체에 대해 거 리 및 방향을 추정하는 동작, 상기 데이터 통신 링크 상의 상기 타겟 장치로부터의 신호가, 상기 추정된 거리 및 방향으로부터 수신되는지 식별하는 동작, 상기 타겟 장치로부터의 신호가 상기 추정된 거리 및 방향으로부터 수신되는 경우, 상기 타겟 객체와 상기 타겟 장치를 매핑하는 동작을 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 상기 매핑하는 동작은, 상기 타겟 장치로부터 송신된 신호에 기반하여 도 래각 추정에 사용할 관심 탭을 선택하는 동작, 상기 관심 탭에 제1 추정 알고리즘을 적용하여 복수의 출력을 생 성하는 동작, 상기 복수의 출력에 제2 추정 알고리즘을 적용하는 동작을 포함할 수 있다. 본 명세서와 도면에 개시된 본 개시의 다양한 실시예들은 본 개시의 기술 내용을 쉽게 설명하고 본 개시의 이해 를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 개시의 범위를 한정하고자 하는 것은 아니다. 따라서 본 개시 의 범위는 여기에 개시된 실시예들 이외에도 본 개시의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형 된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0107208", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다. 도 1은 다양한 실시예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 다양한 실시예들에 따른 AR 서비스를 지원하는 AR 시스템의 예를 도시하는 도면이다. 도 3은 다양한 실시예들에 따른 전자 장치의 구성을 개략적으로 도시하는 도면이다. 도 4는 다양한 실시예들에 따른 전자 장치의 동작을 도시하는 흐름도이다. 도 5, 도 6, 도 7, 및 도 8은 다양한 실시예들에 따른 전자 장치에서 적용되는 CIR 탭 선택에 대한 동작 예를 설명하기 위해 도시하는 도면들이다. 도 9는 다양한 실시예들에 따른 전자 장치에서 안테나 서브셋을 구성하는 예를 설명하기 위해 도시하는 도면이 다. 도 10은 다양한 실시예들에 따른 관심 방향을 기준으로 관심 영역을 설정하는 예를 설명하기 위해 도시하는 도 면이다. 도 11a 및 도 11b는 다양한 실시예들에 따른 전자 장치에서 도래각 추정의 결과 예를 설명하기 위해 도시하는 도면들이다. 도 12a 및 도 12b는 특정 환경에서 관심 영역을 기반으로 도래각 추정을 수행한 결과 예를 설명하기 위해 도시 하는 도면들이다. 도 13은 일 실시예에 따라 관심 방향과 입사각 사이의 불일치 시의 결과를 도시하는 도면이다. 도 14는 다양한 실시예들에 따른 전자 장치의 동작을 도시하는 흐름도이다. 도 15는 다양한 실시예들에 따른 도래각 추정 방법을 테더드 AR 시스템에서 동작하는 예를 설명하기 위해 도시 하는 도면이다.도 16은 다양한 실시예들에 따른 테더드 AR 시스템에서 도래각 추정을 수행하는 동작 예를 도시하는 도면이다. 도 17은 다양한 실시예들에 따른 도래각 추정을 이용할 수 있는 전자 장치의 다른 예를 설명하기 위해 도시하는 도면이다."}
