{"patent_id": "10-2024-0011246", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0015707", "출원번호": "10-2024-0011246", "발명의 명칭": "소스 디스펜서모듈 및 이를 포함하는 햄버거 자동생산 시스템", "출원인": "(주)에니아이", "발명자": "장주철"}}
{"patent_id": "10-2024-0011246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "분사할 소스를 보관하는 소스 보관부;상기 소스 보관부의 소스를 운송하는 소스 운송부;상기 소스 운송부에 의하여 운송된 소스를 다양한 형태로 분사하는 노즐부;상기 노즐부에서 분사되는 소스의 상태, 상기 소스 보관부의 보관 상태, 상기 소스 운송부의 운송 상태를 모니터링 하는 센서; 및상기 센서의 신호에 따른 모니터링에 따라 상기 소스 운송부를 제어하는 제어부를 포함하는 소스 디스펜서모듈."}
{"patent_id": "10-2024-0011246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 소스 보관부는 냉장을 구현하는 냉장부와 온장을 구현하는 온장부 중 적어도 하나를 포함하는, 소스 디스펜서모듈."}
{"patent_id": "10-2024-0011246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 소스 운송부는 상기 소스 보관부에서 상기 노즐부까지 연결하여 비접촉으로 소스를 이동시키는 관체, 및내장된 상기 관체를 통하여 소스에 동력을 공급하는 연동펌프를 포함하는, 소스 디스펜서모듈."}
{"patent_id": "10-2024-0011246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 노즐부는복수의 토출구들을 구비하는 하우징,상기 하우징에 결합되어 서로의 사이에 채널을 설정하는 플레이트, 및상기 채널에 연결되도록 상기 플레이트에 형성되어 상기 소스 운송부에 연결되는 주입구 커넥터를 포함하는, 소스 디스펜서모듈."}
{"patent_id": "10-2024-0011246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 하우징은상기 플레이트와 결합된 상태에서 상기 주입구 커넥터와 복수의 상기 토출구들 각각에 이르도록 상기 채널을 복수로 형성하는, 소스 디스펜서모듈."}
{"patent_id": "10-2024-0011246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 공개특허 10-2024-0015707-3-상기 센서는상기 노즐부의 분사 지점에 있는 물체를 감지하고 소스 분사와 관련된 데이터를 실시간으로 모니터링 하도록 레이저 센서, 근접 센서, 초음파 센서, 카메라, 모터 인코더 센서, 및 무게센서 중 적어도 하나로 형성되는, 소스디스펜서모듈."}
{"patent_id": "10-2024-0011246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서, 상기 소스 보관부는 파우치로 형성되고, 상기 파우치의 개구에 결합되는 암커넥터, 및 상기 소스 운송부의 관체에 결합되는 수커넥터를 포함하며,상기 암커넥터와 상기 수커넥터는 서로 결합되는, 소스 디스펜서모듈."}
{"patent_id": "10-2024-0011246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서, 상기 소스 보관부는 통으로 형성되고, 상기 통의 바닥면과 동일한 면적으로 형성되어 상기 통의 내부에서 소스의 레벨에 따라 하강하는 덮개를 포함하는, 소스 디스펜서모듈."}
{"patent_id": "10-2024-0011246", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 목적은 햄버거 자동생산 시스템에 사용되는 소스 디스펜서모듈을 제공하는 것이다. 본 발명의 소스 디 스펜서모듈은 분사할 소스를 보관하는 소스 보관부, 상기 소스 보관부의 소스를 운송하는 소스 운송부, 상기 소 스 운송부에 의하여 운송된 소스를 다양한 형태로 분사하는 노즐부, 상기 노즐부에서 분사되는 소스의 상태를 모 니터링 하는 센서, 및 상기 센서의 신호에 따른 모니터링에 따라 상기 소스 운송부를 제어하는 제어부를 포함한 다."}
{"patent_id": "10-2024-0011246", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 소스 디스펜서모듈 및 이를 포함하는 햄버거 자동생산 시스템에 관한 것으로서, 보다 상세하게는 햄 버거 생산에 사용되는 소스를 공급하는 소스 디스펜서모듈 및 이를 포함하는 햄버거 자동생산 시스템에 관한 것 이다."}
{"patent_id": "10-2024-0011246", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인건비의 상승, 고령화, 저출산으로 인한 노동 인력의 감소, 단순 반복적인 노동의 기피는 많은 산업 분야에서 무인 자동화를 견인하고 있다. 외식 산업에서도 무인 자동화 장치 및 시스템을 통하여 이러한 문제점들을 해결 하고자 하려는 노력이 진행되고 있다. 햄버거 시장은 외식 산업 중에서 단일 메뉴 대비 매장 개수가 최대이다. 일본 특허 제3557591호는 다종류의 햄버거를 제조할 수 있고, 비교적 작은 주방에 도입할 수 있으며, 생산성을 향상시킬 수 있는 햄버거 조리 장치를 개시하고 있다."}
{"patent_id": "10-2024-0011246", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 사람이 직접 행하던 햄버거 생산을 자동화하는 햄버거 자동생산 시스템을 제공하는 것이다. 본 발명의 목적은 햄버거 자동생산 시스템에 사용되는 소스 디스펜서모듈을 제공하는 것이다."}
{"patent_id": "10-2024-0011246", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 소스 디스펜서모듈은, 분사할 소스를 보관하는 소스 보관부, 상기 소스 보관부의 소스를 운송하는 소스 운송부, 상기 소스 운송부에 의하여 운송된 소스를 다양한 형태로 분사하는 노즐부, 상기 노즐부에서 분사되는 소스의 상태, 상기 소스 보관부의 보관 상태, 상기 소스 운송부의 운송 상태를 모니터링 하는 센서, 및 상기 센서의 신호에 따른 모니터링에 따라 상기 소스 운송부를 제어하는 제어부를 포함한다. 상기 소스 보관부는 냉장을 구현하는 냉장부와 온장을 구현하는 온장부 중 적어도 하나를 포함할 수 있다. 상기 소스 운송부는 상기 소스 보관부에서 상기 노즐부까지 연결하여 비접촉으로 소스를 이동시키는 관체, 및 내장된 상기 관체를 통하여 소스에 동력을 공급하는 연동펌프를 포함할 수 있다. 상기 노즐부는 복수의 토출구들을 구비하는 하우징, 상기 하우징에 결합되어 서로의 사이에 채널을 설정하는 플 레이트, 및 상기 채널에 연결되도록 상기 플레이트에 형성되어 상기 소스 운송부에 연결되는 주입구 커넥터를 포함할 수 있다. 상기 하우징은 상기 플레이트와 결합된 상태에서 상기 주입구 커넥터와 복수의 상기 토출구들 각각에 이르도록 상기 채널을 복수로 형성할 수 있다. 상기 센서는 상기 노즐부의 분사 지점에 있는 물체를 감지하고 소스 분사와 관련된 데이터를 실시간으로 모니터 링 하도록 레이저 센서, 근접 센서, 초음파 센서, 카메라, 모터 인코더 센서, 및 무게센서 중 적어도 하나로 형 성될 수 있다. 상기 소스 보관부는 파우치로 형성되고, 상기 파우치의 개구에 결합되는 암커넥터, 및 상기 소스 운송부의 관체 에 결합되는 수커넥터를 포함하며, 상기 암커넥터와 상기 수커넥터는 서로 결합될 수 있다. 상기 소스 보관부는 통으로 형성되고, 상기 통의 바닥면과 동일한 면적으로 형성되어 상기 통의 내부에서 소스 의 레벨에 따라 하강하는 덮개를 포함할 수 있다. 본 발명의 일 실시예에 따른 햄버거 자동생산 시스템은, 상기 시스템의 동작 확인과 상기 시스템의 제어, 생산 주문 및 스케쥴 관리 중 적어도 하나를 수행하는 인터페이스부, 상기 시스템을 구성하는 복수의 모듈들을 확인 및 관리하는 자동생산 관리모듈, 상기 자동생산 관리모듈에 데이터를 보내는 복수의 조리모듈들, 패키지를 공급 하고 상기 조리모듈들에서 상기 패키지 위에 조립되어 완성된 햄버거를 받아서 포장하는 패키징모듈, 및 상기 자동생산 관리모듈에 의하여 제어되어 상기 조리모듈들 및 상기 패키징모듈 사이에서 상기 패키지 및 상기 패키 지와 함께 제조 중인 햄버거를 이동시키면서 재료들을 햄버거로 조립되게 하는 어셈블러모듈을 포함할 수 있다. 상기 자동생산 관리모듈은 각 스케쥴링 알고리즘이 정하는 제조공정에 따라 상기 모듈들의 동작순서를 제어하는 스케쥴러부, 상기 모듈들 각각에서의 출력 신호를 처리 및 관리하여 상기 스케쥴러부에 전달하는 데이터 관리부, 및 상기 인터페이스부, 상기 조리모듈들, 상기 패키징모듈, 및 상기 어셈블러모듈을 연결하는 통신부를 포함할 수 있다. 상기 조리모듈들은 냉장, 냉동 또는 상온에서 사용할 재료들을 보관하는 캐시, 상기 모듈들 각각의 기능을 담당 하는 로컬프로세서, 및 상기 캐시의 재료양이나 상기 로컬프로세서의 작동을 모니터링하게 하는 센서를 포함할 수 있다. 상기 조리모듈들은 배출부에 위치한 패키지에 조립되고 있는 햄버거 위에 속재료를 공급하는 속재료 디스펜서모 듈을 더 포함하며, 상기 속재료 디스펜서모듈은 속재료를 내장하는 박스, 상기 박스 내부에 구비되어 회전하여 출구로 속재료를 공급하는 프로펠러, 상기 프로펠러를 회전시키는 모터, 상기 자동생산 관리모듈과 통신하여 상 기 모터를 제어하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2024-0011246", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이, 본 발명의 일 실시예에 따른 햄버거 자동생산 시스템은, 사람이 직접 행하던 햄버거 제조를 사람의 개입 없이 자동으로 생산할 수 있게 한다. 일 실시예는 재료의 충전 이외의 전 공정을 완전 자동화하여 햄버거 를 생산할 수 있다. 일 실시예는 각 재료들을 모듈화하여 헴버거를 단계별로 제조하므로 다양한 레시피의 햄버거를 제조할 수 있고, 레시피 커스터마이징을 구현할 수 있으며, 이를 제어 및 모니터링 할 수 있다. 일 실시예는 각 모듈들 중 일부 모듈들을 부분 자동화하므로 필요에 따라 모듈들을 적절히 선택 조합하여 사용할 수 있다. 일 실시예는 인건비 대비 높은 제품 가격 경쟁력을 구현하며, 단위 시간당 생산 개수를 향상시키며, 주문 후 대 기 시간을 최소화할 수 있고, 24시간 지속적인 영업을 가능하게 한다. 일 실시예는 실시간으로 생산 오류를 모 니터링 할 수 있고, 사람이 생산하는 주방에 비해 위생적으로 청결한 생산환경을 만들 수 있다. 또한 본 발명의 일 실시예에 따른 소스 디스펜서모듈은, 상기한 햄버거 자동생산 시스템에 적용되어 연동펌프의 동력을 받은 관체로 소스를 비접촉 공급하므로 위생적으로 소스를 제조 중인 햄버거에 공급 및 분사할 수 있다. 일 실시예의 소스 디스펜서모듈은 노즐부로 다중 분사를 구현하여 소스를 제조 중인 햄버거에 균일하게 분사할 수 있으며, 분사 과정에서 오차를 자동으로 보정하므로 정량 분사를 구현할 수 있다. 일 실시예의 소스 디스펜서모듈은 냉장부 또는 온장부를 구비하여 공급 분사되기까지 소요되는 시간 동안 소스 의 보관 온도를 충족시킬 수 있다."}
{"patent_id": "10-2024-0011246", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으 며 여기에서 설명하는 실시예에 한정되지 않는다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없 는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 참조부호를 붙였 다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 명세서 전체에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 따라서, 어떤 부분이 어떤 구성요소를 \"포함\" 한다고 할 때, 이는 특별히 반대되는 기재 가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 도 1은 본 발명의 일 실시예에 따른 햄버거 자동생산 시스템을 블록으로 도시한 구성도이다. 도 1을 참조하면, 일 실시예의 햄버거 자동생산 시스템은 인터페이스부, 자동생산 관리모듈, 복수의 조리모듈들, 패 키징모듈 및 어셈블러모듈을 포함한다. 인터페이스부는 시스템의 동작 확인과 상기 시스템의 제어, 생산 주문 및 스케쥴 관리 중 적어도 하나를 수 행한다. 자동생산 관리모듈은 시스템을 구성하는 복수의 모듈들을 확인 및 관리한다. 조리모듈들은 자 동생산 관리모듈에 데이터를 보낸다. 패키징모듈은 패키지를 공급하고 조리모듈들에서 패키지 위에 조립되어 완성된 햄버거를 받아서 포장한 다. 어셈블러모듈은 자동생산 관리모듈에 의하여 제어되어 조리모듈들 및 패키징모듈 사이에서 패 키지 및 제조 중인 햄버거를 이동시킨다. 예를 들면, 복수의 조리모듈들은 번그릴모듈, 소스 디스펜서모듈, 패티그릴모듈, 치즈모듈 , 속재료 디스펜서모듈 및 슬라이싱모듈을 포함한다. 도 2는 도 1에 적용되는 로컬 모듈의 기본 구성을 블록으로 도시한 구성도이다. 도 2를 참조하면, 복수의 조리 모듈들은 냉장, 냉동 또는 상온에서 임시로 쓸 양만큼 재료들을 보관하는 캐시(Cache), 개별 모듈들의 기능을 담당하는 로컬프로세서(Local Processor), 및 캐시의 양이나 로컬프로세서의 정상 작동을 모니터링 하는 센서를 포함한다. 또한, 패키징모듈 및 어셈블러모듈은 정상 작동을 모니터링 하는 센서(43, 53)를 포함한다. 센서(43, 53)는 조리모듈들, 패키징모듈 및 어셈블러모듈에 부착되어, 캐시의 양이나 로컬프로세서 의 정상 작동을 모니터링할 뿐 아니라 전체 시스템에도 부착되어 실시간으로 모듈별, 모듈간 동작 모니터링, 오 류 상황 모니터링을 수행할 수 있게 한다. 센서(43, 53)로 수집된 센서 데이터는 실시간으로 자동생산 관리모듈로 보내어져 피드백을 통해 시정 동작 을 수행하거나, 축적되어 빅데이터 기반의 인공지능 학습에 쓰일 수 있다. 이 때, 신호는 비디오, 디지털 이미 지, 적외선 신호, 무게 및 온도 중 적어도 하나의 신호를 포함하며, 센서(43, 53)는 카메라 센서, 오디오 센서, 초음파 센서, 적외선 센서, 중력센서, 무게센서 및 온도센서 중 적어도 하나로 형성된다. 복수의 조리모듈들은 동작시 재료 흐름도를 보면 캐시(Cache)에 저장되어 있던 재료들을 캐시-투-로컬 프로세서 이동(Cache to Local processor movement)을 통해 로컬프로세서로 이동하여 로컬프로세서에 서 조리 동작이 수행되고, 로컬프로세서-투-어셈블러모듈 이동(Local processor to Assembler module movement)을 통해 어셈블러모듈로 이동하여 조립하고, 다음 모듈로 이동하게 된다. 도 1의 햄버거 자동생산 시스템은 모든 모듈들을 사용하여 완전 자동생산 시스템으로서 동작하는 구성을 예시하 고 있다. 도시하지 않았으나, 햄버거 자동생산 시스템은 사용자의 필요에 따라 1개 이상의 모듈을 선택적으로 조합하여 부분 자동생산 시스템으로서 동작할 수 있다. 편의상, 햄버거 자동생산 시스템을 완전 자동생산 시스템으로 설명한다. 먼저, 인터페이스부, 자동생산 관 리모듈, 복수의 조리모듈들, 패키징모듈 및 어셈블러모듈에 대하여 구체적으로 설명한다. 인터페이스부는 사용자가 시스템의 동작을 확인하고 제어할 수 있는 인터페이스로써 생산 주문, 시스템 시 작과 정지, 스케쥴 관리, 및 시스템 에러 요소를 확인하는 동작을 수행한다. 일례로써, 인터페이스부는 자동생산 관리모듈에 접속한 후 통신할 수 있는 기능을 포함하는 디지털 기 기로써, 스마트폰, 테블릿, 스마트 워치, 스마트 밴드, 스마트 글래스, 데스크탑 컴퓨터, 모니터, 노트북 컴퓨 터, 워크스테이션, PDA, 웹 패드, 이동전화기, 및 HMI(Human Machine Interface) 중 적어도 하나를 포함한다. 즉 사용자가 디지털 출력을 확인할 수 있고 입력할 수 있는 기기는 인터페이스부로 채택될 수 있다. 도 3는 도 1에 적용되는 자동생산 관리모듈을 블록으로 도시한 구성도이다. 도 1 및 도 3을 참조하면, 자동생산 관리모듈은 스케쥴러부, 데이터 관리부 및 통신부를 포함한다. 자동생산 관리모듈은 각 모듈들과 통신할 수 있는 기능을 포함하는 디지털 기기로써, 스마트폰, 테블릿, 스 마트 워치, 스마트 밴드, 스마트 글래스, 데스크탑 컴퓨터, 모니터, 노트북 컴퓨터, 워크스테이션, PDA, PLC 중 적어도 하나를 포함한다. 즉 이와 같이 메모리 수단을 구비하고 마이크로 프로세서를 탑재하여 연산능력을 갖춘 디지털 기기는 자동생산 관리모듈로 채택될 수 있다. 스케쥴러부는 본 시스템에 연결된 모듈들을 확인하고, 스케쥴링 알고리즘이 정하는 제조공정에 따라 모듈들 의 동작순서를 제어한다. 스케쥴러부는 본 시스템에 연결된 각 모듈들의 개수와 상태를 1차로 확인할 수 있 다. 이때의 상태는 모듈의 사용 가능 여부, 에러 여부, 청소 여부, 및 버전을 포함한다. 스케쥴러부는 1차로 파악된 모듈들의 상태와 갯수를 바탕으로, 인터페이스부에서 입력된 햄버거 주문 종류와 개수를 생산하기 위한 모듈 동작순서 스케쥴을 정하고 통신부를 통해 각 모듈들을 제어한다. 이때의 모듈 동작순서 스케쥴은 정해진 스케쥴링 알고리즘을 따른다. 스케쥴러부는 각 모듈의 재료가 조리된 후 다음 모듈의 조리 완료를 대기하는 시간이 최소화될 수 있도록, 다음 모듈 조리 완료 시간으로부터 역으로 계산된 이전 모듈 조리 시작 시간을 추정하는 역스케쥴링 알고리즘을 통해 조리의 신선도를 최대로 유지할 수 있게 한다. 스케쥴링 알고리즘은 내장 스케쥴링 알고리즘과 사용자가 직접 정하는 스케쥴링 알고리즘을 포함한다. 내장 스 케쥴링 알고리즘의 일례로 시간당 햄버거 생산량을 최대한으로 하는 알고리즘이 있을 수 있다. 이때 내장 스케 쥴링 알고리즘은 통신부를 통해 중앙서버로부터 업데이트 될 수 있다. 데이터 관리부는 각 모듈들에서 센서들(43, 53)의 출력을 신호 처리 및 관리하고 이를 스케쥴러부에 전 달하는 역할을 수행한다. 센서들(43, 53)의 출력은 에러 여부, 비디오, 디지털 이미지, 적외선 신호, 무게, 온 도 등 햄버거 제조공정에 관여된 모든 신호를 포함한다. 데이터 관리부는 통신부를 통해 모아진 데이터 를 중앙서버로 송수신할 수 있다. 데이터 관리부는 인터페이스부의 입력에 관한 데이터에 기초하여 재료 관리 및 모듈 제어 모델을 학습 시키는 기능을 수행할 수 있다. 일 실시예에 따른 추정 모델은 합성곱 신경망(Convolutional Neural Network; CNN), 순환 신경망(Recurrent Neural Network; RNN)과 같은 인공 신경망을 이용하여 구현될 수 있다. 그리고 여기서 설명하는 내용은 본 발명의 일 실시예에 불과할 뿐이며, 추정 모델을 구현하고 학습시키는 데에 이용될 수 있는 기술은 목적을 달성할 수 있는 범위 내에서 다양하게 변경될 수 있다. 통신부는 인터페이스부, 자동생산 관리모듈, 복수의 조리모듈들, 패키징모듈, 어셈블러모 듈 및 중앙서버(미도시)를 연결하는 통신망으로 구성된다. 이때 중앙서버는 본 시스템과 별도의 위치에 설 치된 중앙시스템으로써 공지의 인터넷 또는 월드 와이드 웹(WWW; World Wide Web)을 통하여 연결될 수 있다. 통신부는 유선 통신이나 무선 통신과 같은 통신 양태를 가리지 않고 구성될 수 있으며, CAN(Controller Area Network), Ethercat, TCP/IP Modbus, Serial Modbus, 근거리 통신망(LAN; Local Area Network), 도시권 통신망(MAN; Metropolitan Area Network), 및 광역 통신망(WAN; Wide Area Network) 중 한 통신망으로 구성될 수 있다. 일례로써 통신망은 공지의 인터넷 또는 월드 와이드 웹(WWW; World Wide Web)일 수 있다. 또한 통신망은 공지의 유무선 데이터 통신망, 공지의 전화망 또는 공지의 유무선 텔레비전 통신망의 일부를 포함할 수도 있다. 다시 도 1 및 도 2를 참조하여 복수의 조리모듈들에 대하여 설명한다. 복수의 조리모듈들은 각 조리에 상응하는 캐시와 로컬프로세서를 구비한다. 먼저, 번그릴모듈은 빵을 다루도록 구성되며, 또한 번그릴모듈이 다루는 재료는 빵으로 한정하지 않고, 버거 번의 역할을 대체할 수 있는 형태가 잡힌 밥이나 햄버거의 내부 재료를 쌓고 상하로 감싸기 위한 재료를 포함한다. 번의 종류 및 특성에 따라 캐시에서 냉동, 냉장, 상온 상태로 보관되며, 조리 시 조리 시간 및 온도가 로컬 프로세서에서 조절될 수 있다. 번그릴모듈에서 캐시는 번의 겉면 마름 현상을 방지하기 위해 외부 의 공기를 차단하는 형태도 구성될 수 있다. 번그릴모듈은 센서들, 예를 들면, 압력센서 또는 위치센서를 포함할 수 있으며, 번의 종류 및 상태(예 를 들면, 번의 두께 및 번 온도)에 따라 어셈블러모듈의 제어부에서 적절한 조리 압력, 시간, 위치 등 을 피드백 하여 적절한 번 조리 정도를 조절 및 상태 모니터링 할 수 있다. 번그릴모듈의 센서들은 번의 온도, 단단함, 색의 조리 정도를 파악할 수 있는 상태 측정 센서를 더 포 함할 수 있으며, 이를 통해, 번의 조리 온도 및 시간을 조절할 수 있다. 어셈블러모듈의 제어부는 MCU(Micro Controller Unit), FPGA, DSP, 스마트폰, 태블릿, 스마트 워치, 스마트 밴드, 스마트 글래스, 데스크탑 컴퓨터, 모니터, 노트북 컴퓨터, 워크스테이션, PDA, 및 PLC 중 어느 하 나를 포함한다. 즉 이와 같이 연산능력을 갖춘 디지털 기기는 어셈블러모듈의 제어부로 채택될 수 있다. 어셈블러모듈은 패키징 종이 또는 박스에 재료가 순차적으로 공급될 수 있도록 조리모듈들과 패키징모 듈의 배출부로 이동시키도록 구성된다. 어셈블러모듈의 제어부는 식재료가 담긴 패키징 종이 또는 박스가 대기하거나 이동하고, 이를 제어하고 자동생산 관리모듈과 통신하도록 구성된다. 제어부는 자동생산 관리모듈의 입력 신호를 바탕으로 어셈블러모듈을 제어하고, 어셈블러모듈 의 상태를 자동생산 관리모듈에 통신하는 역할을 한다. 이때 어셈블러모듈의 상태는 동작 가능 여부, 현재 동작 여부, 에러 여부, 및 동작 속도를 포함할 수 있다. 패티그릴모듈은 소고기, 돼지고기, 닭고기, 또는 비건의 구이기 위에서 굽는 형태와, 새우, 닭고기, 감자 해쉬브라운의 튀김기에서 튀겨지는 형태를 포함한다. 구이기를 예로 설명하면, 구이기 모듈은 패티를 조리하기 위한 가열장치를 포함하며, 열원으로서 인덕션, 열선, 전자기파 장치 및 적외선 장치 중 하나 이상을 포함할 수 있다. 구이기 모듈은 패티의 종류에 따라 조리 중 소금, 후추, 허브의 시즈닝 작업을 위한 시즈닝 모듈(미도시)을 더 포함할 수 있고, 튀김기 모듈의 제어부(미도시)는 시즈닝 시간 및 종류, 및 용량을 조절할 수 있다. 튀김기를 예로 설명하면, 튀김기 모듈은 패티를 기름에 넣고 꺼내는 동작을 수행하되, 튀김 조리가 끝난 후 기 름 내 파편을 걸러줄 수 있으며, 기름 산도 측정 결과에 따라 기름 교체 동작을 수행할 수 있다. 구이기 모듈 및 튀김기 모듈에 적용되는 제어부는 MCU(Micro Controller Unit), FPGA, DSP, 스마트폰, 태블릿, 스마트 워치, 스마트 밴드, 스마트 글래스, 데스크탑 컴퓨터, 모니터, 노트북 컴퓨터, 워크스테이션, PDA, 및 PLC 증 적어도 하나를 포함한다. 이와 같이 연산능력을 갖춘 디지털 기기는 제어부로 채택될 수 있다. 패티그릴모듈의 캐시는 패티의 특성에 따라 냉동, 냉장, 미 상온 상태로 유지될 수 있으며, 신선도 유지를 위해 외부 공기의 유입 및 흐름을 차단하는 패키징을 포함할 수 있다. 치즈모듈은 어셈블러모듈에 의해 치즈모듈의 배출부에 위치한 패키지 종이 또는 박스 위에 조립되 고 있는 햄버거 위에 치즈를 공급한다. 이때 치즈의 종류는 슬라이스, 슈레드 및 액상 치즈 중 적어도 하나를 포함한다. 치즈모듈은 냉장, 냉동, 상온을 유지할 수 있는 임시로 치즈를 저장하는 캐시(Cache)에 저장되어 있는 치즈 를 바로 어셈블러모듈로 공급하거나, 온풍기, 오븐과 같은 로컬프로세서(Local Processor)를 통해 적정 온 도로 가열하여 어셈블러모듈로 공급할 수 있다. 속재료 디스펜서모듈은 배출부에 위치한 패키지 종이 또는 박스 위에 조립되고 있는 햄버거 위에 다양한 속 재료를 메뉴에 따라 정량을 정해진 속도로 공급한다. 이 때, 속재료는 양파, 양상추, 및 피클을 포함한다. 속재료 디스펜서모듈은 냉장, 냉동 또는 상온을 유지할 수 있는 임시로 재료를 저장하는 캐시에 저장되어 있는 속재료를 바로 어셈블러모듈로 공급하거나, 액체 차단기와 같은 로컬프로세서(Local Processor)를 통 해 속재료에서 흘러나오는 액체는 막고 재료만을 어셈블러모듈로 공급할 수 있다. 도 4는 도 1에 적용되는 속재료 디스펜서모듈을 도시한 사시도이고, 도 5는 도 4의 종단면도이다. 도 1, 도 4 및 도 5를 참조하면, 속재료 디스펜서모듈은 디지털 입력을 통해 양상추 및 양파와 같은 재료를 사출하는 장치로써 재료가 들어가는 박스, 박스 내부의 프로펠러를 회전시키는 기어와 모터, 및 제어부를 포함한다. 제어부는 자동생산 관리모듈과 통신하여 모터를 제어한다. 즉 속재 료 디스펜서모듈에서 들어가는 박스는 캐시에 해당하고, 프로펠러, 및 모터는 로 컬프로세서에 해당한다. 박스는 재료를 채울 수 있는 통으로써 내부에 회전할 수 있는 프로펠러가 내장되어 있다. 박스 와 모터는 분리 가능하다. 박스와 모터를 결합시켰을 때, 기어가 맞물리고, 모터가 기어를 통하여 프로펠러를 구동시킬 수 있다. 이를 이용하여 박스 내의 재료를 토출구로 토출하여 속재료 디스펜서모듈의 배출부에 위치한 패키지 종이 또는 박스 위에 조립되고 있는 햄버거 위에 속재료를 공급한다 일례로써, 프로펠러는 휠 수 있는 부드러운 재질, 즉 실리콘 또는 그와 비슷한 물성의 재료, 단단한 재질, 즉 금속, 플라스틱 또는 그와 비슷한 물성의 재료로 이루어질 수 있다. 모터는 디지털 입력을 통해 회전 운동을 발생시키는 장치로써 기어드 모터, 스태퍼 모터, 서보 모터, 브러 쉬 모터, 및 브러쉬리스 모터 중 하나로 채택될 수 있다. 제어부는 자동생산 관리모듈로부터 받은 입력신호를 바탕으로 모터를 제어하여 시계방향 또는 반 시계 방향으로 회전시키고, 속재료 디스펜서모듈의 상태를 자동생산 관리모듈과 통신한다. 이때의 속재 료 디스펜서모듈의 상태는 동작 가능 여부, 현재 동작 여부, 및 에러 여부를 포함한다. 제어부는 MCU(Micro Controller Unit), FPGA, DSP, 스마트폰, 테블릿, 스마트 워치, 스마트 밴드, 스마트 글래스, 데스크탑 컴퓨터, 모니터, 노트북 컴퓨터, 워크스테이션, PDA 및 PLC 중 적어도 하나를 포함한다. 즉 이와 같이 연산능력을 갖춘 디지털 기기는 제어부로 채택될 수 있다. 도 6은 도 1의 적용되는 본 발명의 일 실시예에 따른 소스 디스펜서모듈을 블록으로 도시한 구성도이고, 도 7은 도 6의 소스 디스펜서모듈을 도시한 사시도이다. 도 6 내지 도 7을 참조하면, 소스 디스펜서모듈은 디지털 입력을 통해 소스나 드레싱 재료를 분사하는 장치 로써 분사할 소스를 보관해두는 소스 보관부, 소스 보관부의 소스를 운송하는 소스 운송부, 소스 운송부에 의하여 운송된 소스를 다양한 형태로 분사하는 노즐부, 노즐부에 구비되어 분사되 는 소스의 상태(예, 자동 분사 위치, 분사된 소스의 무게)를 모니터링 하게 하는 센서 및 자동생산 관리모 듈과 통신하여 소스 운송부를 제어하는 제어부를 포함한다. 또한 센서는 소스 보관부의 소스 보관 상태, 및 소스 운송부의 소스 운송 상태를 모니터링 할 수 있도록 소스 보관부 및 소스 운송부에도 각각 구비된다. 제어부는 이들 센서를 통하여 소스 분사와 관련된 데이터를 모니터링 하여 자동생산 관리모듈과 통신하여 소스 운송부를 더 정확하 게 제어할 수 있다. 즉 소스 디스펜서모듈에서 소스 보관부는 캐시에 해당하고, 소스 운송부 및 노즐부는 로컬프로세서에 해당한다. 소스 디스펜서모듈이 다루는 재료는 햄버거 소스, 샐러드 드레싱, 아이스크 림 시럽, 과일잼, 및 각종 식용 액체를 포함할 수 있다. 소스 보관부는 다양한 형태로 소스를 보관하는 장치이며, 통(도 9 참조)이나 파우치(도 11 참조)로 형성될 수 있다. 즉 소스가 보관된 형태는 전용 소스 파우치, 전용 철제 소스통, 시중에 유통되는 소스 파우치 및 플라 스틱 소스통을 포함할 수 있다. 소스 보관부는 소스의 보관 특성에 따라 밀폐, 단열 및 냉장 또는 온장을 구현하는 냉장부와 온장부 를 포함할 수 있다. 이 때 냉장부는 열전 소자, 냉매를 사용하는 컴프레서 및 스털링(sterling) 중 하나로 형성될 수 있으며, 온장부는 열전 소자, 열선, 및 적외선 중 적어도 하나로 형성될 수 있다. 도 8은 도 6 및 도 7에 적용되는 연동펌프를 도시한 구성도이고, 도 9는 도 8에 도시된 연동펌프의 입구에 연결 되는 소스통을 도시한 사시도이다. 도 6 내지 도 9를 참조하면, 소스 운송부는 소스 보관부에서 노즐 부까지 연결하고, 소스에 동력을 공급하여 소스를 이동시키도록 구성된다. 일례로써, 소스 운송부는 비접촉으로 소스를 이동시키는 관체 및 관체를 내장하는 연동펌프 를 포함한다. 제어부는 자동생산 관리모듈과 통신하고 연동펌프를 제어한다. 연동펌프 내의 관체는 입구로 소스 보관부에 연결되고, 출구로 노즐부에 연결된다. 소스 운송부에서 연동펌프에 내장되는 관체는 소스가 공기, 모터(M), 펌프와 같은 외부 요소에 접촉되지 않고 소스 보관부에서 노즐부까지 이송 가능하게 한다. 소스 운송부의 관체는 식품 안전 등급을 통과한 실리콘 튜브, 타이곤 튜브, 의료용 튜브, SUS 파이프, 및 플라스틱 파이프 중 하나로 구성될 수 있다. 소스 운송부에서 연동펌프는 관체 내의 소스와 직접적인 접촉 없이 운송력을 제공하며, 다이어 프램 펌프와 같은 비접촉 펌프로 대체될 수 있다. 연동펌프는 전동 모터, 전동 선형 액추에이터 또는 전동 동력 장치로 구동될 수 있다. 연동펌프 즉 전동 동력 장치는 소스 디스펜서모듈의 제어부의 입력 신호에 따라 구동되어 소스 보관부의 소스를 원하는 양만큼 노즐부로 이송시킬 수 있게 한다. 도 9를 참조하면, 소스 보관부는 통으로 형성되고, 통의 바닥면과 동일한 면적의 덮개 를 포함한다. 덮개는 통 내에서 소스가 출구를 통하여 연동펌프로 공급됨에 따라 소스 의 레벨이 낮아질 때 소스와 상면과 같이 낮아지면서 소스 중앙에 에어포켓이 형성되는 것을 방지하여 소스의 전량을 공급할 수 있게 한다. 도 10은 도 8에 도시된 연동펌프의 출구에 연결되는 노즐부를 분해하여 도시한 사시도이다. 도 8 내지 도 10을 참조하면, 노즐부는 용도에 따라 다양한 형태로 소스를 분사하도록 구성된다. 예를 들면, 노즐부는 단일 지점 분사, 다중 지점 분사, 스프레이식 분사, 및 스크링클러식 분사 중 적어도 한 형태로 소스를 분사할 수 있다. 일례로써 노즐부는 복수의 토출구를 형성하는 하우징, 하우징에 체결부재로 결합 되는 플레이트, 및 플레이트에 형성되어 연동펌프의 출구에 연결되는 주입구 커넥터 를 포함한다. 하우징은 플레이트와 결합된 상태에서 주입구 커넥터와 복수의 토출구들 각각에 이르 는 채널을 서로의 사이에 형성한다. 채널의 일측은 하우징에 형성되는 홈으로 설정되고, 다 른 일측은 플레이트의 내면으로 설정된다. 따라서 주입구 커넥터로 주입된 소스는 각 채널들을 통하여 각 토출구들까지 점진적으로 진 행 및 분사될 수 있다. 즉 소스가 노즐부의 내부에서 장 기간 방치되는 것이 방지될 수 있다. 복수의 토출구들은 소스 디스펜서모듈의 배출부에 위치한 패키지 종이 또는 박스 위에 조립되고 있는 햄버거 위에 소스를 넓게 분사할 수 있다. 또한, 노즐부는 체결부재에 의하여 소스 디스펜서모듈 의 브래킷에 장착될 수 있다. 노즐부의 센서는 자동 분사 지점에 있는 물체를 감지하고 소스 디스펜서모듈과 관련된 데이터를 실시간으로 모니터링 할 수 있게 한다. 소스 보관부의 센서는 소스 보관 상태를 모니터링 할 수 있게 하고, 소스 운송부의 센서는 소스 운송 상태를 모니터링 할 수 있게 한다. 예를 들면, 센서는 레이저 센서, 근접 센서, 초음파 센서, 카메라, 모터 인코더 센서, 및 무게센서 중 하나로 형성될 수 있다. 소스 디스펜서모듈에서 제어부는 자동생산 관리모듈의 입력 신호를 바탕으로 연동펌프를 제 어하고, 센서의 데이터와 모듈의 상태를 자동생산 관리모듈에 통신하는 역할을 한다. 이때 소스 디스 펜서모듈의 상태는 남은 소스의 양, 자동 분사 위치의 물체 감지, 동작 가능 여부, 현재 동작 여부, 및 에 러 여부 중 적어도 하나를 포함할 수 있다. 도 11은 도 8에 도시된 소스 운송부의 관체에 연결되는 커넥터와 파우치의 커넥터를 연결하는 전 상태(a)와 연 결한 상태(b)를 도시한 구성도이다. 도 9 및 도 11을 참조하면, 소스 보관부는 파우치로 형성되고, 파우치의 개구에 뚜껑을 제거하고 결합되는 암커넥터, 및 소스 운송부의 관체에 결합되 는 수커넥터를 포함한다. 소스 보관부는 파우치 교체 시, 암커넥터와 수커넥터를 결합하여 파우치를 관체 에 연결함으로써 공기의 유입을 방지할 수 있다. 도 9에 도시된 바와 같이, 소스 보관부가 통으로 형성되고, 출구가 파이프 타입인 경우, 통 에 소스를 직접 투입하여 사용 가능하며, 파이프 타입의 출구에 연동펌프의 관체를 직 접 연결하여 사용할 수 있다. 도 12는 도 6에 도시된 소스 디스펜서모듈로 소스를 정량 분사 제어하는 구성을 블록으로 도시한 구성도이다. 도 12를 참조하면, 소스 디스펜서모듈은 주변의 환경에 무관하게 소스의 정량 분사를 가능하게 한다. 예를 들면, 연동펌프를 스태퍼 모터로 구동하는 경우, 스태퍼 모터의 회전수를 기반으로 분사량을 조절할 수 있다. 동일한 조건에서 연동펌프는 1회 회전시 동일한 양의 분사량을 보장하며, 회전수를 정확하게 조 절 가능한 스테퍼 모터를 통해 시스템의 상황에 따라 분사량을 조절할 수 있다. 일례로써, MCU(Micro Controller Unit)로 구성되는 제어부는 스태퍼 모터로 연동펌프를 제어한다. 이때 무게센서로 구성되는 센서 측정된 무게를 제어부에 인가하게 한다. 제어부는 센서의 신호에 따라 소스의 분사 전과 후의 무게를 측정하여 목표 분사량과 실제 분사량 사 이의 오차를 인지하고 연동펌프의 회전수를 제어하여 다음 분사량을 조절할 수 있다. 센서에 의한 무게 피드백은 연동펌프의 동일한 회전수로 1회 분사시 소스의 종류나 주변 온도 등에 의해 분사량이 달라지는 경우에도 제어부가 회전수를 보정하여 정량 분사를 가능하게 한다. 한편, 제어부는 노즐부로 소스 분사 직후 연동펌프를 역회전시키므로 소스를 다시 역으로 이동 시켜 노즐부 밖의 잔여하는 소스를 최소화하고, 잔여 소스가 줄어들고 바닥에 흐르는 소스의 양을 최소화 할 수 있다. 다시 도 1 및 도 2를 참조하면, 슬라이싱모듈은 어셈블러모듈에 의해 배출부에 위치한 패키지 종이 또 는 박스 위에 조립되고 있는 햄버거 위에 다양한 속재료를 슬라이싱 하여 공급한다. 이때, 속재료는 양파, 토마 토, 피클, 치즈 중 적어도 하나를 포함한다. 슬라이싱모듈은 냉장, 냉동, 또는 상온을 유지할 수 있는 캐시에 임시로 저장되어 있는 속재료를 직선 날, 회전날, 줄날 중 하나 이상으로 이루어진 로컬프로세서를 통해 적정 두께로 자를 수 있고, 잘려진 속재 료들은 어셈블러모듈로 공급된다. 패키징모듈은 패키지 종이 또는 박스를 낱개로 분리하여 어셈블러모듈에 정확하게 위치시키는 동작을 수행한다. 패키징모듈은 어셈블러모듈에 의해 패키지 종이 또는 박스 위에 조립되어 완성된 햄버거를 접기 또는 덮기 등의 포장 마감 동작을 수행한 후 어셈블러모듈에 의해 포장된 햄버거를 출력하거나 직접출력한다. 어셈블러모듈은 제조 중인 햄버거를 이동시키면서 조립하게 하는 운송 수단이며, 자동생산 관리모듈은 어셈블러모듈을 이동시켜 복수의 조리모듈들 및 패키징모듈 배출부로 메뉴별 순서에 따라 순차적으 로 위치시킨다. 어셈블러모듈의 동작영역은 자동생산 시스템의 전체 영역을 포함하며, 최대 생산속도와 최 소지연시간을 만족시키기 위한 속도를 가진다. 일반적인 햄버거의 조립 순서에 따라 어셈블러모듈은 햄버거가 조립되기 위한 패키지 종이 또는 박스를 공 급받기 위해 패키징모듈의 배출부로 이동하여 위치하고, 조리모듈들 중 메뉴별 순서에 따른 모듈로 이 송하고, 조리모듈들 간에 서로 이동한다. 이때, 어셈블러모듈은 X축 Y축 및 Z축에 대한 1축 로봇, 2축 로봇, 3축 로봇과 스카라(SCARA) 로봇과 같은 4축 로봇, 협동 로봇 팔과 같은 6축 로봇, 및 이러한 다축 로봇들에 회전운동을 추가 조합하여 나올 수 있는 N 축 로봇과 엔드 이펙터들(End effector) 중 하나로 형성될 수 있다. 이상을 통해 본 발명의 바람직한 실시예들에 대하여 설명하였지만, 본 발명은 이들에 한정되는 것이 아니고 청 구범위와 발명의 설명 및 첨부한 도면의 범위 안에서 여러 가지로 변형하여 실시하는 것이 가능하고 이 또한 본 발명의 범위에 속하는 것은 당연하다."}
{"patent_id": "10-2024-0011246", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 햄버거 자동생산 시스템을 블록으로 도시한 구성도이다. 도 2는 도 1에 적용되는 로컬 모듈의 기본 구성을 블록으로 도시한 구성도이다. 도 3는 도 1에 적용되는 자동생산 관리모듈을 블록으로 도시한 구성도이다. 도 4는 도 1에 적용되는 속재료 디스펜서모듈을 도시한 사시도이다. 도 5는 도 4의 종단면도이다. 도 6은 도 1의 적용되는 본 발명의 일 실시예에 따른 소스 디스펜서모듈을 블록으로 도시한 구성도이다. 도 7은 도 6의 소스 디스펜서모듈을 도시한 사시도이다. 도 8은 도 6 및 도 7에 적용되는 연동펌프를 도시한 구성도이다. 도 9는 도 8에 도시된 연동펌프의 입구에 연결되는 소스통을 도시한 사시도이다. 도 10은 도 8에 도시된 연동펌프의 출구에 연결되는 노즐부를 분해하여 도시한 사시도이다. 도 11은 도 8에 도시된 소스 운송부의 관체에 연결되는 커넥터와 파우치의 커넥터를 연결하는 전 상태(a)와 연 결한 상태(b)를 도시한 구성도이다. 도 12는 도 6에 도시된 소스 디스펜서모듈로 소스를 정량 분사 제어하는 구성을 블록으로 도시한 구성도이다."}
