{"patent_id": "10-2022-7014737", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0092516", "출원번호": "10-2022-7014737", "발명의 명칭": "무선 네트워크에서의 MDAS 서버 지원된 핸드오버 최적화 방법", "출원인": "삼성전자주식회사", "발명자": "가우탐 디판슈"}}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 네트워크(1000)에서의 관리 데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버 방법에 있어서,MDAS 서버(100)가 상기 무선 네트워크(1000)의 복수의 타겟 gNB로부터 데이터를 수집하는 단계;상기 MDAS 서버(100)가 수집된 데이터에 기초하여 상기 복수의 타겟 gNB 중 각각의 타겟 gNB(300)에 대한 분석보고를 생성하는 단계로서, 상기 분석 보고는 상기 타겟 gNB의 각각에 대한 현재 자원 소비 상태, 상기 타겟gNB의 각각에 대한 미래의 자원 소비 상태, 상기 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적인지에 대한 인디케이션, 및 핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 적어도하나의 교정 동작 중 적어도 하나를 포함하는, 상기 생성하는 단계;상기 MDAS 서버(100)가 소스 gNB(200)로부터 핸드오버를 위한 상기 적어도 하나의 타겟 gNB(300)의 상기 분석보고에 대한 요청을 수신하는 단계; 및상기 MDAS 서버(100)가 상기 분석 보고를 상기 소스 gNB(200)로 송신하는 단계를 포함하는, 관리 데이터 분석서비스(MDAS) 서버(100) 지원된 핸드오버 방법."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 수집된 데이터는 가상 머신에 할당된 컴퓨팅된 자원의 총량, 특정 지점에서 집성된 컴퓨팅된 자원 소비의총량, 상기 가상 머신에 할당된 스토리지의 총량, 특정 시점에서 집성된 스토리지 소비의 총량, 및 다양한 무선자원 및 상기 다양한 무선 자원의 전체 소비 비율을 포함하는, 관리 데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버 방법."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 분석 보고는 상기 타겟 gNB의 각각의 할당된 가상 자원 및 무선 자원, 상기 타겟 gNB의 각각의 소비된 가상 자원 및 무선 자원, 상기 타겟 gNB의 각각에 대한 가까운 미래의 예상된 가상 자원 및 무선 자원 사용량, 상기 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(300)가 타임 스탬프가 있는 현재 시간 및 미래 시간 중 적어도하나에 대한 핸드오버에 최적인지에 대한 인디케이션, 및 핸드오버를 위해 상기 타겟 gNB의 각각을 최적화하기위한 적어도 하나의 교정 동작을 포함하는, 관리 데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버 방법."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 소스 gNB(200)가 상기 MDAS 서버(100)로부터 상기 적어도 하나의 타겟 gNB(300)의 분석 보고를 수신하는단계; 및상기 소스 gNB(200)가 핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 상기 적어도 하나의 교정 동작을 수행하는 단계를 포함하는, 관리 데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버 방법."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "복수의 gNB를 포함하는 무선 네트워크(1000)에서의 관리 데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버방법에 있어서,소스 gNB(200)가 사용자 장치(UE)가 상기 무선 네트워크(1000)의 복수의 타겟 gNB로부터 적어도 하나의 타겟gNB(300)을 향해 이동한다는 것을 상기 복수의 gNB로부터 검출하는 단계;공개특허 10-2022-0092516-3-상기 소스 gNB(200)가 상기 소스 gNB(200)로부터 핸드오버를 위한 상기 적어도 하나의 타겟 gNB(300)의 분석 보고에 대한 요청을 MDAS 서버로 송신하는 단계로서, 상기 분석 보고는 상기 타겟 gNB의 각각에 대한 현재 자원소비 상태, 상기 타겟 gNB의 각각에 대한 미래의 자원 소비 상태, 상기 복수의 타겟 gNB 중 적어도 하나의 타겟gNB(300)가 핸드오버에 최적인지에 대한 인디케이션, 및 핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 적어도 하나의 교정 동작 중 적어도 하나를 포함하는, 상기 송신하는 단계;상기 소스 gNB(200)가 상기 MDAS 서버100)로부터 상기 적어도 하나의 타겟 gNB(300)의 분석 보고를 수신하는 단계; 및상기 소스 gNB(200)가 핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 적어도 하나의 교정 동작을 수행하는 단계를 포함하는, 관리 데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버 방법."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 상기 적어도 하나의 교정 동작을 수행하는 단계는,상기 소스 gNB(200)가 상기 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적인지를 결정하는 단계; 및상기 복수의 타겟 gNB로부터의 상기 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적임을 결정하는 것에 응답하여 상기 소스 gNB(200)가 상기 소스 gNB(200)로부터 상기 적어도 하나의 타겟 gNB(300)로의 핸드오버를 수행하는 단계, 및상기 복수의 타겟 gNB로부터의 상기 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적이 아님을 결정하는 것에응답하여 상기 소스 gNB(200)가 상기 적어도 하나의 타겟 gNB(300)와 연관된 가상 자원 및 무선 자원을 증가시키기 위해 스케일 아웃 요청을 NFMS 서버(500)로 송신하는 단계 중 하나를 수행하는 단계를 포함하는, 관리 데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버 방법."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 스케일 아웃 요청을 상기 NFMS 서버(500)로 송신하는 단계는,상기 NFMS 서버(500)가 부가적인 가상 자원 및 무선 자원을 상기 적어도 하나의 타겟 gNB(300)에 할당하는단계;상기 NFMS 서버(500)가 상기 적어도 하나의 타겟 gNB(300)의 성공적인 스케일 아웃을 상기 소스 gNB(200)에 알리는 단계; 및상기 소스 gNB(200)가 사용자 장치(UE)가 상기 무선 네트워크(1000)에서 상기 타겟 gNB(300)로부터 멀리 이동하는지를 결정하는 단계를 더 포함하는, 관리 데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버 방법."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 소스 gNB(200)가 상기 UE(400)가 상기 무선 네트워크(1000)에서 상기 타겟 gNB(300)로부터 멀리 이동하는지를 결정하는 단계는,상기 소스 gNB(200)가,상기 UE(400)가 상기 무선 네트워크(1000)에서 상기 타겟 gNB(300)로부터 멀리 이동하지 않다고 결정하는 것에응답하여 상기 소스 gNB(200)가 상기 소스 gNB(200)로부터 상기 적어도 하나의 타겟 gNB(300)로의 핸드오버를수행하는 단계, 및상기 UE(400)가 상기 무선 네트워크(1000)에서 상기 타겟 gNB(300)로부터 멀리 이동하고 있다고 결정하는 것에응답하여 상기 소스 gNB(200)가 상기 적어도 하나의 타겟 gNB(300)와 연관된 가상 자원 및 무선 자원을 감소시공개특허 10-2022-0092516-4-키기 위해 스케일 인 요청을 상기 NFMS 서버(500)로 송신하는 단계 중 하나를 수행하는 단계를 포함하는, 관리데이터 분석 서비스(MDAS) 서버(100) 지원된 핸드오버 방법."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "무선 네트워크(1000)에서 최적의 핸드오버를 위한 관리 데이터 분석 서비스(MDAS) 서버(100)에 있어서,메모리(110);상기 메모리(110)와 결합된 프로세서(120); 및상기 프로세서(120)와 결합된 분석 보고 제어부(140)를 포함하며, 상기 분석 보고 제어부(140)는,상기 무선 네트워크(1000)의 복수의 타겟 gNB로부터 데이터를 수집하고;수집된 데이터에 기초하여 상기 복수의 타겟 gNB 중 각각의 타겟 gNB(300)에 대한 분석 보고 - 상기 분석 보고는 상기 타겟 gNB의 각각에 대한 현재 자원 소비 상태, 상기 타겟 gNB의 각각에 대한 미래의 자원 소비 상태,상기 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적인지에 대한 인디케이션, 및 핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 적어도 하나의 교정 동작 중 적어도 하나를 포함함 -를 생성하고;상기 소스 gNB(200)로부터 핸드오버를 위한 상기 적어도 하나의 타겟 gNB(300)의 분석 보고에 대한 요청을 수신하며;상기 분석 보고를 상기 소스 gNB(200)로 송신하도록 설정되는, 관리 데이터 분석 서비스(MDAS) 서버(100)."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 수집된 데이터는 가상 머신에 할당된 컴퓨팅된 자원의 총량, 특정 지점에서 집성된 컴퓨팅된 자원 소비의총량, 상기 가상 머신에 할당된 스토리지의 총량, 특정 시점에서 집성된 스토리지 소비의 총량, 및 다양한 무선자원 및 상기 다양한 무선 자원의 전체 소비 비율을 포함하는, 관리 데이터 분석 서비스(MDAS) 서버(100)."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 분석 보고는 상기 타겟 gNB의 각각의 할당된 가상 자원 및 무선 자원, 상기 타겟 gNB의 각각의 소비된 가상 자원 및 무선 자원, 상기 타겟 gNB의 각각에 대한 가까운 미래의 예상된 가상 자원 및 무선 자원 사용량, 상기 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(300)가 타임 스탬프가 있는 현재 시간 및 미래 시간 중 적어도하나에 대한 핸드오버에 최적인지에 대한 인디케이션, 및 핸드오버를 위해 상기 타겟 gNB의 각각을 최적화하기위한 적어도 하나의 교정 동작을 포함하는, 관리 데이터 분석 서비스(MDAS) 서버(100)."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9 항에 있어서,상기 MDAS 서버(100)는 상기 적어도 하나의 타겟 gNB(300)의 현재 및 미래 가상 자원 소비에 기초하여 상기 자원 소비를 설명하는 분석 보고를 상기 소스 gNB(200)에 제공하는, 관리 데이터 분석 서비스(MDAS) 서버(100)."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 네트워크(1000)에서의 최적의 핸드오버를 위한 소스 gNB(200)에 있어서,메모리(210);상기 메모리(210)와 결합된 프로세서(220); 및상기 프로세서(220)와 결합된 교정 동작 제어부(240)를 포함하며, 상기 교정 동작 제어부(240)는,사용자 장치(UE)가 상기 무선 네트워크(1000)의 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(300)을 향해 이동하는 것을 검출하고;공개특허 10-2022-0092516-5-상기 소스 gNB(200)로부터 핸드오버를 위한 상기 적어도 하나의 타겟 gNB(300)의 분석 보고 - 상기 분석 보고는상기 타겟 gNB의 각각에 대한 현재 자원 소비 상태, 상기 타겟 gNB의 각각에 대한 미래의 자원 소비 상태, 상기복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적인지에 대한 인디케이션, 및 핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 적어도 하나의 교정 동작 중 적어도 하나를 포함함 - 에 대한 요청을 MDAS 서버(100)로 송신하고;상기 MDAS 서버100)로부터 상기 적어도 하나의 타겟 gNB(300)의 분석 보고를 수신하며;핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 적어도 하나의 교정 동작을 수행하도록 설정되는, 최적의 핸드오버를 위한 소스 gNB(200)."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,핸드오버를 위해 적어도 하나의 타겟 gNB(300)를 최적화하기 위한 상기 적어도 하나의 교정 동작을 수행하는 것은,상기 소스 gNB(200)가 상기 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적인지를 결정하는 것; 및상기 복수의 타겟 gNB로부터의 상기 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적임을 결정하는 것에 응답하여 상기 소스 gNB(200)가 상기 소스 gNB(200)로부터 상기 적어도 하나의 타겟 gNB(300)로의 핸드오버를 수행하는 것, 및상기 복수의 타겟 gNB로부터의 상기 적어도 하나의 타겟 gNB(300)가 핸드오버에 최적이 아님을 결정하는 것에응답하여 상기 소스 gNB(200)가 상기 적어도 하나의 타겟 gNB(300)와 연관된 가상 자원 및 무선 자원을 증가시키기 위해 스케일 아웃 요청을 NFMS 서버(500)로 송신하는 것 중 하나를 수행하는 것을 포함하는, 최적의 핸드오버를 위한 소스 gNB(200)."}
{"patent_id": "10-2022-7014737", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 스케일 아웃 요청을 상기 NFMS 서버(500)로 송신하는 것은,상기 NFMS 서버(500)가 부가적인 가상 자원 및 무선 자원을 상기 적어도 하나의 타겟 gNB(300)에 할당하는 것;상기 NFMS 서버(500)가 상기 적어도 하나의 타겟 gNB(300)의 성공적인 스케일 아웃을 상기 소스 gNB(200)에 알리는 것; 및상기 소스 gNB(200)가 사용자 장치(UE)가 상기 무선 네트워크(1000)에서 상기 타겟 gNB(300)로부터 멀리 이동하는지를 결정하는 것을 더 포함하는, 최적의 핸드오버를 위한 소스 gNB(200)."}
{"patent_id": "10-2022-7014737", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 IOT(Internet of Things) 기술을 이용하여 4세대(4G) 시스템보다 높은 데이터 송신률을 지원하는 5세 대(5G) 통신 시스템을 융합하는 통신 방법 및 시스템에 관한 것이다. 본 개시는 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카, 커넥티드 카, 헬스 케어, 디지털 교육, 스마트 소매, 보안 및 안전 서비스와 같은 5G 통신 기 (뒷면에 계속)"}
{"patent_id": "10-2022-7014737", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무선 네트워크에 관한 것으로서, 보다 상세하게는 무선 네트워크에서 관리 데이터 분석 서비스 (Management data analytic service; MDAS) 서버 지원된 핸드오버 최적화 방법에 관한 것이다. 본 출원은 2019 년 10월 31일에 출원된 인도 출원 제201941044137로에 기초하고 그 우선권을 주장하며, 이의 개시는 본 명세서 에서 참조로 포함된다."}
{"patent_id": "10-2022-7014737", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 또는 pre-5G 통신 시스템은 또한 \"4G 네트워크 이후(Beyond 4G Network)\" 통신 시스템 또는 \"LTE 시스템 이후(Post LTE System)\" 통신 시 스템이라 불리어지고 있다. 높은 데이터 송신률(data rate)을 달성하기 위해, 5G 통신 시스템은 초고주파 (mmWave) 대역(예를 들어, 60GHz 대역)에서 구현되는 것으로 간주된다. 무선파(radio wave)의 전파 손실을 감소시키고 송신 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대한 MIMO(Multiple- Input Multiple-Output), FD-MIMO(Full Dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍 (analog beam forming), 및 대규모 안테나(large scale antenna) 기술이 논의되고 있다. 또한, 시스템의 네트 워크 개선을 위해, 5G 통신 시스템에서는 첨단 소형 셀(advanced small cell), 클라우드 무선 액세스 네트워크 (cloud Radio Access Network; cloud RAN), 초고밀도 네트워크(ultra-dense network), 기기 간 통신(Device- to-Device(D2D) communication), 무선 백홀(wireless backhaul), 이동 네트워크(moving network), 협력 통신 (cooperative communication), CoMP(Coordinated Multi-Point), 수신 단 간섭 제거(reception-end interference cancellation) 등의 기술 개발이 이루어지고 있다. 5G 통신 시스템에서는 첨단 코딩 변조 (Advanced Coding Modulation, ACM) 방식인 FQAM(Hybrid FSK and QAM Modulation) 및 SWSC(Sliding Window Superposition Coding)과, 첨단 액세스 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non-orthogonal multiple access) 및 SCMA(sparse code multiple access) 등이 개발되고 있다. 인간이 정보를 생성하고 소비하는 인간 중심 연결 네트워크인 인터넷은 이제 사물과 같은 분산된 엔티티가 인간 의 개입 없이 정보를 교환하고 처리하는 사물 인터넷(Internet of Things; IoT)으로 진화하고 있다. 클라우드 서버와의 연결을 통한 IoT 기술 및 빅 데이터(Big Data) 처리 기술을 조합한 IoE(Internet of Everything) 기 술이 대두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소가 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), M2M(Machine-to-Machine), MTC(Machine 타입 Communication) 등의 기술이 연구되고 있다. IoT 환경 에서는 연결된 사물에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(Information Technology) 기술과 다양한 산업 간의 융합 및 복합을 통하여 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 또는 커넥티드 카, 스마트 그리드, 헬스 케어, 스마트 가전, 첨단 의료 서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도가 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), MTC(Machine 타입 Communication), M2M(Machine-to-Machine) 등의 기술은 5G 통신 기술이 빔포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처리 기술로서 클라우드 RAN(cloud Radio Access Network)이 적용되는 것도 5G 기술과 IoT 기술 간의 융합(convergence)의 일 례라고 할 수 있을 것이다. 현재 무선 액세스 네트워크(Radio Access Network; RAN)에서, 핸드오버 사양은 gNodeB(gNB)(예를 들어, 타겟 gNB)가 소스 gNB로부터 사용자 장치(user equipment; UE)에 대한 핸드오버 요청을 수락하거나 거부하는 프로세 스를 채택한다. 핸드오버 요청은 사용 가능한 가상 자원 및 무선 네트워크의 타겟 gNB와 연관된 무선 자원의 부 적절함으로 인해 거부될 수 있다. UE는 핸드오버 요청이 무선 네트워크의 적어도 하나의 gNB에 의해 성공적으로 수락될 때까지 무선 네트워크의 상이한 gNB에 연결하기를 시도할 것이다. 이러한 히트 앤 트라이얼(hit-and- trial) 메커니즘은 UE 자원과 무선 네트워크 자원의 낭비를 초래한다. 기존 핸드오버 메커니즘은 관리 데이터 분석 서비스(MDAS) 서버를 사용하여 최적화되고 핸드오버 실패 가능성을 최소화할 수 있다. 따라서, 상술한 단점 또는 다른 결점을 해결하거나 적어도 유용한 대안을 제공하는 것이 바람직하다."}
{"patent_id": "10-2022-7014737", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서의 실시예의 주요 목적은 무선 네트워크에서 관리 데이터 분석 서비스(MDAS) 서버 지원된 핸드오버 최 적화 방법을 제공하는 것이다. 실시예의 다른 목적은 무선 네트워크에서의 복수의 타겟 gNB로부터 데이터를 주기적으로 수집하고, 수집된 데이 터에 기초하여 복수의 타겟 gNB의 각각의 타겟 gNB에 대한 분석 보고를 생성하는 것이며, 여기서 분석 보고는 타겟 gNB의 각각에 대한 현재 자원 소비 상태 및 타겟 gNB의 각각에 대한 미래의 자원 소비 상태 중 적어도 하 나를 포함한다. 실시예의 다른 목적은 복수의 타겟 gNB로부터 소스 gNB로부터의 핸드오버를 위한 적어도 하나의 타겟 gNB의 분 석 보고에 대한 요청을 수신하는 것이며, 분석 보고에 기초하여 소스 gNB는 타겟 gNB가 UE 자원을 절약하기 위 해 핸드오버 절차를 시작하기 전에 현재(현재 최적 타겟) 또는 미래의 어떤 시점(미래 최적 타겟)에서 핸드오버 에 최적인지를 결정한다.실시예의 다른 목적은 타겟 gNB가 핸드오버에 최적이 아닐 때 권장되는 동작을 제공하는 것이며, 분석 보고는 핸드오버를 위해 타겟 gNB를 최적화하기 위해 권장되는 동작을 제공한다(즉, 소스 gNB는 (예를 들어, 타겟 gNB 를 스케일 아웃(scale-out)하도록 NFV(Network functions virtualization) MANO(Management and Orchestration)에 요청함으로써) 타겟 gNB를 최적화하기 위해 (MDAS 서버에 의해 나타내어지는) 조치(measure s)를 취할 것이다."}
{"patent_id": "10-2022-7014737", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "따라서, 본 명세서의 실시예는 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화 방법을 제공한다. 이 방법 은 MDAS 서버(즉, 관리 데이터 분석 서비스 생성자(producer))가 무선 네트워크의 복수의 타겟 gNB로부터 데이 터를 주기적으로 수집하는 단계를 포함한다. 또한, 방법은 MDAS 서버가 수집된 데이터에 기초하여 복수의 타겟 gNB 중 각각의 타겟 gNB에 대한 분석 보고를 생성하는 단계를 포함하며, 분석 보고는 타겟 gNB의 각각에 대한 현재 자원 소비 상태, 타겟 gNB의 각각에 대한 미래의 자원 소비 상태, 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB가 현재(현재 최적 타겟) 또는 미래의 어떤 시점(미래 최적 타겟)에서 핸드오버에 최적인지에 대한 인디케이 션(indication) 및 핸드오버를 위해 적어도 하나의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작 (corrective action) 중 적어도 하나를 포함한다. 또한, 방법은 MDAS 서버가 복수의 타겟 gNB로부터 소스 gNB로 부터의 핸드오버를 위한 적어도 하나의 타겟 gNB의 분석 보고에 대한 요청을 수신하는 단계를 포함한다. 방법은 MDAS 서버가 분석 보고를 소스 gNB로 송신하는 단계를 포함한다. 일 실시예에서, 수집된 데이터는 가상 머신에 할당된 컴퓨팅된 자원의 총량, 특정 지점에서 집성된(aggregated) 컴퓨팅된 자원 소비의 총량, 가상 머신에 할당된 스토리지(storage)의 총량, 특정 시점에서 집성된 스토리지 소 비의 총량, 및 다양한 무선 자원 및 다양한 무선 자원의 전체 소비 비율을 포함한다. 일 실시예에서, 분석 보고는 타겟 gNB의 각각의 할당된 가상 자원 및 무선 자원, 타겟 gNB의 각각의 소비된 가 상 자원 및 무선 자원, 타겟 gNB의 각각에 대한 가까운 미래의 예상된 가상 자원 및 무선 자원 사용량, 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB가 현재 및 미래(타임 스탬프(time stamp)를 포함함) 중 적어도 하나에서 핸드오버에 최적인지에 대한 인디케이션 및 핸드오버를 위해 각각의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작을 포함한다. 또한, 방법은 소스 gNB가 MDAS 서버로부터 적어도 하나의 타겟 gNB의 분석 보고를 수신하는 단계를 포함한다. 또한, 방법은 소스 gNB가 핸드오버를 위해 적어도 하나의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작 을 수행하는 단계를 포함한다. 또한, 방법은 소스 gNB가 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB가 현재 또 는 미래의 어떤 시점에서 핸드오버에 최적인지를 결정하는 단계를 포함한다. 또한, 방법은 복수의 타겟 gNB로부 터의 적어도 하나의 타겟 gNB가 현재 또는 미래의 어떤 시점에서 핸드오버에 최적임을 결정하는 것에 응답하여 소스 gNB가 소스 gNB로부터 적어도 하나의 타겟 gNB로의 핸드오버를 수행하는 단계를 포함한다. 또한, 방법은 복수의 타겟 gNB로부터의 적어도 하나의 타겟 gNB가 핸드오버에 최적이 아님을 결정하는 것에 응답하여 소스 gNB가 적어도 하나의 타겟 gNB와 연관된 가상 자원 및 무선 자원을 증가시키기 위해 스케일 아웃 요청을 NFMS 서버(즉, 네트워크 기능 관리 서비스 생성자)로 송신하는 단계를 포함한다. 일 실시예에서, 스케일 아웃 요청을 NFMS 서버로 송신하는 단계는 NFMS 서버가 부가적인 가상 자원 및 무선 자 원을 적어도 하나의 타겟 gNB에 할당하는 단계를 더 포함한다. 또한, 스케일 아웃 요청은 NFMS 서버가 적어도 하나의 타겟 gNB의 성공적인 스케일 아웃을 소스 gNB에 알리는 것을 포함한다. 또한, 스케일 아웃 요청은 소스 gNB가 사용자 장치(UE)가 무선 네트워크에서 타겟 gNB로부터 멀리 이동하는지를 결정하는 것을 포함한다. 일 실시예에서, 소스 gNB가 UE가 무선 네트워크에서 타겟 gNB로부터 멀리 이동하는지를 결정하는 것은 UE가 무 선 네트워크에서 타겟 gNB로부터 멀리 이동하지 않다고 결정하는 것에 응답하여 소스 gNB가 소스 gNB로부터 적 어도 하나의 타겟 gNB로의 핸드오버를 수행하는 것, 및 UE가 무선 네트워크에서 타겟 gNB로부터 멀리 이동하고 있다고 결정하는 것에 응답하여 소스 gNB가 적어도 하나의 타겟 gNB와 연관된 가상 자원 및 무선 자원을 감소시 키기 위해 스케일 인(scale-in) 요청을 NFMS 서버로 송신하는 것을 포함한다. 일 실시예에서, 스케일 아웃 요청을 NFMS 서버로 송신하는 단계는 NFMS 서버가 부가적인 가상 자원 및 무선 자 원을 적어도 하나의 타겟 gNB에 할당 해제하는 단계를 더 포함한다. 또한, 스케일 인 요청은 NFMS 서버가 적어 도 하나의 타겟 gNB의 성공적인 스케일 인을 소스 gNB에 알리는 것을 포함한다. 무선 자원은 증가하는 것과 동 일한 비율로 감소한다. 일 실시예에서, MDAS 서버는 적어도 하나의 타겟 gNB의 현재 및 미래 가상 자원 소비에 기초하여 자원 소비를 설명하는 분석 보고를 소스 gNB(예를 들어, 인가된 소비자)에 제공한다. 일 실시예에서, MDAS 서버는 적어도 하나의 타겟 gNB의 현재 및 미래의 무선 자원 소비에 기초하여 자원 소비를 설명하는 분석 보고를 인가된 소비자에 제공한다. 일 실시예에서, MDAS 서버는 인공 지능(Artificial Intelligence; AI) 모델 및 머신 러닝(Machine Learning; ML) 모델 중 적어도 하나를 사용하여 분석 보고를 생성한다. 따라서, 본 명세서의 실시예는 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화 방법을 제공하며, 무선 네 트워크는 복수의 gNB를 포함한다. 방법은 소스 gNB가 UE가 무선 네트워크의 복수의 타겟 gNB로부터의 적어도 하 나의 타겟 gNB로부터 이동한다는 것을 복수의 gNB로부터 검출하는 단계를 포함한다. 또한, 방법은 소스 gNB가 소스 gNB로부터 핸드오버를 위한 적어도 하나의 타겟 gNB의 분석 보고에 대한 요청을 MDAS 서버로 송신하는 단 계를 포함하며, 분석 보고는 타겟 gNB의 각각에 대한 현재 자원 소비 상태, 및 타겟 gNB의 각각에 대한 미래의 자원 소비 상태 중 적어도 하나를 포함한다. 또한, 방법은 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB가 현재 또는 미래의 어떤 시점에서 핸드오버에 최적인지에 대한 인디케이션 및 핸드오버를 위해 적어도 하나의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작을 포함한다. 또한, 방법은 소스 gNB가 MDAS 서버로부터 적어도 하나의 타겟 gNB의 분석 보고를 수신하는 단계를 포함한다. 또한, 방법은 소스 gNB가 핸드오버를 위해 적어도 하나의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작을 수행하는 단계를 포함한다. 따라서, 본 명세서의 실시예는 무선 네트워크에서 최적의 핸드오버를 제공하는 MDAS 서버를 제공한다. MDAS 서 버는 프로세서 및 메모리와 결합된 분석 보고 생성기를 포함한다. 분석 보고 생성기는 무선 네트워크의 복수의 타겟 gNB로부터 데이터를 주기적으로 수집하도록 설정된다. 또한, 분석 보고 생성기는 수집된 데이터에 기초하 여 복수의 타겟 gNB 중 각각의 타겟 gNB에 대한 분석 보고를 생성하도록 설정된다. 또한, 분석 보고 생성기는 복수의 타겟 gNB로부터 소스 gNB로부터 핸드오버를 위한 적어도 하나의 타겟 gNB의 분석 보고에 대한 요청을 수 신하도록 설정된다. 또한, 분석 보고 생성기는 분석 보고를 소스 gNB로 송신하도록 설정된다. 따라서, 본 명세서의 실시예는 무선 네트워크에서 최적의 핸드오버를 제공하는 소스 gNB를 제공한다. 소스 gNB 는 프로세서 및 메모리와 결합된 교정 동작 제어부(controller)를 포함한다. 교정 동작 제어부는 사용자 장치 (UE)가 무선 네트워크의 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB로부터 이동하는 것을 검출하도록 설정된다. 또한, 교정 동작 제어부는 소스 gNB로부터 핸드오버를 위해 적어도 하나의 타겟 gNB의 분석 보고에 대한 요청을 MDAS 서버로 송신하도록 설정된다. 또한, 교정 동작 제어부는 MDAS 서버로부터 적어도 하나의 타겟 gNB의 분석 보고를 수신하도록 설정된다. 또한, 교정 동작 제어부는 핸드오버를 위해 적어도 하나의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작을 수행하도록 설정된다. 본 명세서의 실시예의 이들 및 다른 양태는 다음의 설명 및 첨부된 도면과 함께 고려될 때 더 잘 인식되고 이해 될 것이다. 그러나, 다음의 설명은 바람직한 실시예 및 이의 다수의 특정 상세 사항을 나타내면서 제한이 아니 라 예시로서 제공되는 것으로 이해되어야 한다. 본 명세서의 실시예의 범위 내에서 그 사상을 벗어나지 않고 많 은 변경 및 수정이 이루어질 수 있으며, 본 명세서의 실시예는 이러한 모든 수정을 포함한다."}
{"patent_id": "10-2022-7014737", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서의 실시예의 주요 목적은 무선 네트워크에서 관리 데이터 분석 서비스(MDAS) 서버 지원된 핸드오버 최 적화 방법을 제공하는 것이다."}
{"patent_id": "10-2022-7014737", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서의 실시예 및 이의 다양한 특징 및 유리한 상세 사항은 첨부된 도면에 예시되고 다음의 설명에서 상세 히 설명되는 비제한적인 실시예를 참조하여 보다 완전하게 설명된다. 공지된 구성 요소 및 처리 기술에 대한 설 명은 본 명세서의 실시예를 불필요하게 모호하게 하지 않도록 하기 위해 생략된다. 또한, 일부 실시예가 새로운 실시예를 형성하기 위해 하나 이상의 다른 실시예와 조합될 수 있기 때문에 본 명세서에 설명된 다양한 실시예 는 반드시 상호 배타적일 필요는 없다. 본 명세서에 사용된 바와 같은 \"또는(or)\"이라는 용어는 달리 나타내어 지지 않는 한 비배타적임을 지칭한다. 본 명세서에 사용된 예는 단지 본 명세서의 실시예가 실시될 수 있는 방 식의 이해를 용이하게 하고 통상의 기술자가 본 명세서의 실시예를 실시할 수 있도록 하기 위한 것이다. 따라서, 예는 본 명세서의 실시예의 범위를 제한하는 것으로서 해석되지 않아야 한다. 본 분야에서 통상적인 바와 같이, 실시예는 설명된 기능을 수행하는 블록에 대하여 설명되고 예시될 수 있다. 본 명세서에서 관리자, 유닛, 모듈, 하드웨어 구성 요소 등으로서 지칭될 수 있는 이러한 블록은 논리 게이트, 집적 회로, 마이크로프로세서, 마이크로제어부, 메모리 회로, 수동 전자 부품, 능동 전자 부품, 광학 부품, 유 선 회로 등과 같은 아날로그 및/또는 디지털 회로에 의해 물리적으로 구현되고, 선택적으로 펌웨어에 의해 구동 될 수 있다. 회로는 예를 들어 하나 이상의 반도체 칩 또는 인쇄 회로 기판 등과 같은 기판 지지대에서 구현될 수 있다. 블록을 구성하는 회로는 전용 하드웨어 또는 프로세서(예를 들어, 하나의 이상의 프로그래밍된 마이크 로프로세서 및 연관된 회로), 또는 블록의 일부 기능을 수행하는 전용 하드웨어와 블록의 다른 기능을 수행하는 프로세서의 조합에 의해 구현될 수 있다. 실시예의 각각의 블록은 본 개시의 범위를 벗어나지 않으면서 물리적 으로 둘 이상의 상호 작용 및 이산 블록으로 분리될 수 있다. 유사하게, 실시예의 블록은 본 개시의 범위를 벗 어나지 않고 물리적으로 더 복잡한 블록으로 조합될 수 있다. 따라서, 본 명세서의 실시예는 무선 네트워크에서 관리 데이터 분석 서비스(MDAS) 서버 지원된 핸드오버 최적화 방법을 제공한다. 방법은 핸드오버 거부를 피하도록 핸드오버를 위해 특정 gNB를 제공/선택하기 위해 MDAS 서버 를 사용하는 것이 바람직하다. MDAS 서버는 주기적으로 복수의 gNB로부터 여러 자원 특정(예를 들어, 가상 자원, RAN 자원) 데이터를 수집하고, 데이터를 분석한 다음, 타겟 gNB에 대한 현재 자원 상태를 제공하는 gNB에 포괄적인 분석 보고를 생성할 수 있다. 분석 보고는 또한 타겟 gNB가 현재(현재 최적 타겟) 또는 미래의 어떤 시점(미래 최적 타겟)에서 핸드오버에 최적인지를 나타내었다. 타겟 gNB가 핸드오버에 최적이 아닌 경우, 분석 보고는 핸드오버를 위해 타겟 gNB를 최적화하기 위한 권장된 동작을 제공한다. MDAS 소비자 역할을 하는 소스 gNB는 핸드오버를 실행하기 전에 분석 보고를 요청할 수 있다. 타겟 gNB가 핸드오버에 최적이 아닌 경우, MDAS 소비자는 핸드오버 절차를 계속하기 전에 분석 보고에 제안된 바와 같이 교정 조치를 취하고 수행하도록 선택할 수 있다. 또한, 분석 보고는 미래 시점에서 타겟 gNB에 대한 미래/예상된 자원 소비 정보도 포함한다. MDAS 소 비자는 보고가 타겟 gNB에서 가까운 미래의 자원 부족을 제안하는 경우 핸드오버를 진행하지 않거나 핸드오버를 위해 타겟 gNB를 최적화하기 위한 교정 동작을 취하도록 선택할 수 있다. 이제 도면을 참조하면, 특히 도 1 내지 도 4를 참조하면, 유사한 참조 부호는 도면 전체에 걸쳐 일관되게 상응 하는 특징을 나타내며, 바람직한 실시예가 도시되어 있다. 도 1은 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화의 전체 아키텍처이다. 무선 네트워크는 MDAS 서버, 소스 gNB 및 복수의 타겟 gNB(적어 도 하나의 타겟 gNB), UE 및 NFMS 서버)를 포함한다.S1에서, MDAS 서버는 무선 네트워크의 복수의 gNB(즉, 타겟 gNB(예를 들어, 제1 타겟 gNB(300a) 및 제2 타겟 gNB(300b))로부터 주기적으로 데이터를 수집한다. 데이터에 대한 상세 사항은 표 1에 제 공된다. 표 1 데이터(Data) 설명(Description) 할당된 컴퓨팅 (Compute allocate)이것은 gNB VNF가 호스팅되는 가상 머신에 할당된 vCPU(Openstack Nova)의 수를 설명한다(This describes the number of vCPUs (Openstack Nova) allocated to the virtual machine on which the gNB VNF is hosted). 소비된 컴퓨팅 (Compute consumed)이것은 특정 시점에서 집성된 컴퓨팅된 자원(vCPU) 소비의 총 수를 설명한다(This describes the number of total aggregated compute resource (vCPU) consumption at a particular point of time). 할당된 스토리지 (Storage allocate)이것은 gNB VNF가 호스팅되는 가상 머신에 할당된 vStorage(Openstack Cinder)의 수를 설명한다(This describes the number of vStorage (Openstack Cinder) allocated to the virtual machine on which the gNB VNF is hosted). 소비된 스토리지 (Storage consumed)이것은 특정 시점에서 집성된 스토리지 소비의 총 수를 설명한다(This describes the number of total aggregated storage consumption at a particular point of time). 소비된 무선 자원 (Resource consumed)이것은 다양한 무선 자원과 이의 전체 소비 비율을 설명한다(This describes various radio resource and their overall consumption percentage). S2에서, MDAS 서버는 수집된 데이터를 기반으로 하여 복수의 타겟 gNB(300a, 300b)의 각각의 타겟 gNB에 대한 분석 보고를 생성한다. 그런 다음, 데이터는 다양한 AI 메커니즘을 사용하여 분석되어 제1 타 겟 gNB(300a)가 자원을 빼앗겼는지 여부를 확인한다. 제1 타겟 gNB(300a)가 자원을 빼앗긴 경우, 보고는 권장된 동작을 제공하며, 예를 들어 가상 자원이 부족한 경우, 스케일 아웃/업(scale-out/up)이 제안될 것이다. MDAS 서버는 소스 gNB(인가된 소비자)가 각각의 gNB(300a, 300b)에 대한 자원 소비를 설명하는 분석 보고 를 획득할 수 있도록 하는 능력을 가지고 있다. 또한, MDAS 서버는 각각의 타겟 gNB(300a, 300b)의 현재 및 미래의 가상 자원 소비를 기반으로 인가된 소비자에 자원 소비를 설명하는 분석 보고를 제공할 수 있다. 또 한, MDAS 서버는 각각의 타겟 gNB(300a, 300b)의 현재 및 미래의 RAN 자원 소비를 기반으로 인가된 소비자 에 자원 소비를 설명하는 분석 보고를 제공할 수 있다. 또한, 자원 소비를 설명하는 분석 보고는 현재 및 미래 의 자원 소비를 설명하는 다음의 정보를 포함해야 한다. 할당된 가상 자원 및 무선 자원. 소비된 가상 자원 및 무선 자원. 가까운 미래에 예상되는 가상 자원 및 무선 자원 사용량. 타겟 gNB가 현재(현재 최적 타겟) 또는 미래의 어떤 시점(미래 최적 타겟)에서 핸드오버에 최적인지에 대한 인 디케이션. 핸드오버를 위해 gNB를 최적화하기 위한 권장된 동작. S3에서, 소스 gNB는 UE가 무선 네트워크의 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB (즉, 제1 타겟 gNB(300a))를 향해 이동하는 것을 검출한다. S4에서, MDAS 서버는 복수의 타겟 gNB로부터 소스 gNB로부터의 핸드오버를 위한 적어도 하나의 타겟 gNB(즉, 제1 gNB(300a))의 분석 보고에 대한 요청을 수신한다. S5에서, MDAS 서버는 분석 보고를 소스 gNB로 송신한다. S6에서, 소스 gNB(MDAS 소비자)는 핸드오버를 계속하기 전에 자원을 조정(예를 들어, 스케일 아웃/업)한다. 도 2a는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 최적의 핸드오버를 제공하는 MDAS 서버의 블록도를 도시한다. 일 실시예에서, MDAS 서버는 메모리, 프로세서, 커뮤니케 이터(communicator), 및 분석 보고 제어부를 포함한다. 메모리는 또한 프로세서에 의해 실행될 명령어를 저장한다. 메모리는 비휘발성 저장 요소를 포 함할 수 있다. 이러한 비휘발성 저장 요소의 예는 자기 하드 디스크, 광 디스크, 플로피 디스크, 플래시 메모리, 또는 전기적으로 프로그램 가능한 메모리(electrically programmable memory; EPROM) 또는 전기적으로 소거 및 프로그램 가능한 메모리(electrically erasable and programmable memory; EEPROM)의 형태를 포함할수 있다. 또한, 메모리는 일부 예에서 비일시적(non-transitory) 저장 매체로 간주될 수 있다. \"비일시 적\"이라는 용어는 저장 매체가 반송파 또는 전파된 신호로 구현되지 않음을 나타낼 수 있다. 그러나 \"비일시 적\"이라는 용어는 메모리가 움직일 수 없는 것으로 해석되지 않아야 한다. 특정 예에서, 비일시적 저장 매 체는 시간이 지남에 따라 (예를 들어, 랜덤 액세스 메모리(Random Access Memory; RAM) 또는 캐시(cache)에서) 변경될 수 있는 데이터를 저장할 수 있다. 일 실시예에서, 메모리는 내부 저장 유닛일 수 있거나 MDAS 서 버의 외부 저장 유닛, 클라우드 스토리지, 또는 임의의 다른 타입의 외부 스토리지일 수 있다. 프로세서는 메모리, 커뮤니케이터 및 분석 보고 제어부와 통신한다. 프로세서는 메모 리에 저장된 명령어를 실행하고 다양한 프로세스를 수행하도록 설정된다. 커뮤니케이터는 하나 이상 의 네트워크를 통해 내부 하드웨어 구성 요소 사이에서 외부 장치와 내부적으로 통신하기 위해 설정된다. 일 실시예에서, 분석 보고 제어부는 데이터 수집부(collector)(140a) 및 AI 엔진(140b)을 포함한다. 데이 터 수집부(140a)는 무선 네트워크의 복수의 gNB(예를 들어, 타겟 gNB)로부터 주기적으로 데이터를 수집한다. 또한, 분석 보고 제어부는 수집된 데이터에 기초하여 복수의 타겟 gNB의 각각의 타겟 gNB 에 대한 분석 보고를 생성하고, 분석 보고는 타겟 gNB의 각각에 대한 현재 자원 소비 상태, 타겟 gNB의 각 각에 대한 미래의 자원 소비 상태, 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB(예를 들어, 제1 타겟 노드 (300a), 제2 타겟 노드(300b) 등)가 현재(현재 최적 타겟) 또는 미래의 어떤 시점(미래 최적 타겟)에서 핸드오 버에 최적인지에 대한 인디케이션 및 핸드오버를 위해 적어도 하나의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작 중 적어도 하나를 포함한다. 또한, 분석 보고 제어부는 소스 gNB로부터 핸드오버를 위한 적어도 하나의 타겟 gNB의 분석 보고에 대한 요청을 수신한다. 또한, 분석 보고 제어부는 분석 보고를 소스 gNB로 송신한다. 일 실시예에서, 수집된 데이터는 가상 머신에 할당된 컴퓨팅된 자원의 총량, 특정 지점에서 집성된 컴퓨팅된 자 원 소비의 총량, 가상 머신에 할당된 스토리지의 총량, 특정 시점에서 집성된 스토리지 소비의 총량, 및 다양한 무선 자원 및 다양한 무선 자원의 전체 소비 비율을 포함한다. 일 실시예에서, 타겟 gNB의 각각에 대한 현재 자원 소비 상태 및 타겟 gNB의 각각에 대한 미래의 자원 소비 상 태는 타겟 gNB의 각각의 할당된 가상 자원 및 무선 자원, 타겟 gNB의 각각의 소비된 가상 자원 및 무선 자원, 타겟 gNB의 각각에 대한 가까운 미래의 예상된 가상 자원 및 무선 자원 사용량, 복수의 타겟 gNB 중 적어도 하 나의 타겟 gNB가 현재(현재 최적 타겟) 또는 미래의 어떤 시점(미래 최적 타겟)에서 핸드오버에 최적인지 에 대한 인디케이션, 및 핸드오버를 위해 타겟 gNB의 각각을 최적화하기 위한 적어도 하나의 교정 동작을 포함 한다. 일 실시예에서, 분석 보고 제어부는 적어도 하나의 타겟 gNB의 현재 및 미래 가상 자원 소비에 기초 하여 자원 소비를 설명하는 분석 보고를 인가된 소비자에 제공한다. 일 실시예에서, 분석 보고 제어부는 적어도 하나의 타겟 gNB의 현재 및 미래의 무선 자원 소비에 기 초하여 자원 소비를 설명하는 분석 보고를 인가된 소비자에 제공한다. 일 실시예에서, 분석 보고 제어부는 인공 지능(AI) 모델 및 머신 러닝(ML) 모델 중 적어도 하나를 사용하 여 분석 보고를 생성한다. AI 엔진(140b)은 미래 핸드오버 최적성을 도출하기 위해 수집된 데이터와 AI/ML(예를 들어, 시계열 기반) 알고리즘을 활용한다. 복수의 모듈/구성 요소 중 적어도 하나는 AI 모델을 통해 구현될 수 있다. AI와 연관된 기능은 메모리 및 프로세서를 통해 수행될 수 있다. 프로세서는 하나 또는 복수의 프로세서를 포함할 수 있다. 이때, 하나 또는 복수의 프로세서는 중앙 처리 유닛(central processing unit; CPU), 애플리케이션 프로세서(application processor; AP) 등과 같은 범용 프 로세서, 그래픽 처리 유닛(graphics processing unit; GPU), 비주얼 처리 유닛(visual processing unit; VPU) 등과 같은 그래픽 전용 처리 유닛, 및/또는 뉴럴 처리 유닛(neural processing unit; NPU)과 같은 AI 전용 프 로세서일 수 있다. 하나 또는 복수의 프로세서는 비휘발성 메모리 및 휘발성 메모리에 저장된 미리 정의된 동작 규칙 또는 인공 지 능(AI) 모델에 따라 입력 데이터의 처리를 제어한다. 훈련(training) 또는 학습(learning)을 통해 미리 정의된 동작 규칙 또는 인공 지능 모델이 제공된다. 여기서, 학습을 통해 제공된다는 것은 학습 프로세스를 복수의 학습 데이터에 적용함으로써 미리 정의된 동작 규칙 또는 원하는 특성의 AI 모델이 만들어지는 것을 의미한다. 학습은 일 실시예에 따른 AI가 수행되는 장치 자체에서 수행될 수 있고/있거나, 별개의 서버/시스템을 통해 구현될 수 있다. AI 모델은 복수의 신경망 계층으로 구성될 수 있다. 각각의 계층은 복수의 가중치 값(weight value)을 가지며, 이전 계층의 계산을 통한 계층 연산과 복수의 가중치의 연산을 수행한다. 신경망의 예는 CNN(convolutional neural network), DNN(deep neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), GAN(generative adversarial network) 및 심층 Q-네트워크(deep Q-network)를 포함하지만, 이에 제한되지 않는다. 학습 프로세스는 타겟 장치가 결정 또는 예측을 하게 하거나 허용하거나 제어하도록 복수의 학습 데이터를 이용 하여 미리 정해진 타겟 장치(예를 들어, 로봇)를 훈련하는 방법이다. 학습 프로세스의 예는 지도 학습 (supervised learning), 비지도 학습, 반 지도 학습 또는 강화 학습(reinforcement learning)을 포함하지만, 이에 제한되지 않는다. 도 2a는 MDAS 서버의 다양한 하드웨어 구성 요소를 도시하지만, 다른 실시예가 이에 제한되지 않는다는 것 이 이해되어야 한다. 다른 실시예에서, MDAS 서버는 더 적거나 더 많은 수의 구성 요소를 포함할 수 있다. 또한, 구성 요소의 라벨 또는 명칭은 예시를 위해서만 사용되며, 본 발명의 범위를 제한하지 않는다. 하나 이상 의 구성 요소는 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화를 위해 동일하거나 실질적으 로 유사한 기능을 수행하기 위해 함께 조합될 수 있다. 도 2b는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 최적의 핸드오버를 제공하는 소 스 gNB의 블록도를 도시한다. 일 실시예에서, 소스 gNB는 메모리, 프로세서, 커뮤니케이터 , 및 교정 동작 제어부를 포함한다. 메모리는 또한 프로세서에 의해 실행될 명령어를 저장한다. 메모리는 비휘발성 저장 요소를 포 함할 수 있다. 이러한 비휘발성 저장 요소의 예는 자기 하드 디스크, 광 디스크, 플로피 디스크, 플래시 메모리, 또는 전기적으로 프로그램 가능한 메모리(EPROM) 또는 전기적으로 소거 및 프로그램 가능한 메모리 (EEPROM)의 형태를 포함할 수 있다. 또한, 메모리는 일부 예에서 비일시적 저장 매체로 간주될 수 있다. \"비일시적\"이라는 용어는 저장 매체가 반송파 또는 전파된 신호로 구현되지 않음을 나타낼 수 있다. 그러나, \"비일시적\"이라는 용어는 메모리가 움직일 수 없는 것으로 해석되지 않아야 한다. 특정 예에서, 비일시적 저장 매체는 시간이 지남에 따라 (예를 들어, 랜덤 액세스 메모리(RAM) 또는 캐시에서) 변경될 수 있는 데이터 를 저장할 수 있다. 일 실시예에서, 메모리는 내부 저장 유닛일 수 있거나 소스 gNB의 외부 저장 유 닛, 클라우드 스토리지, 또는 임의의 다른 타입의 외부 스토리지일 수 있다. 프로세서는 메모리, 커뮤니케이터 및 교정 동작 제어부와 통신한다. 프로세서는 메모 리에 저장된 명령어를 실행하고 다양한 프로세스를 수행하도록 설정된다. 커뮤니케이터는 하나 이상 의 네트워크를 통해 내부 하드웨어 구성 요소 사이에서 외부 장치와 내부적으로 통신하기 위해 설정된다. 일 실시예에서, 교정 동작 제어부는 UE가 무선 네트워크에서 복수의 타겟 gNB로부터 적어도 하 나의 타겟 gNB를 향해 이동하는 것을 검출한다. 또한, 교정 동작 제어부는 소스 gNB로부터 핸드 오버를 위한 적어도 하나의 타겟 gNB의 분석 보고에 대한 요청을 MDAS 서버로 송신하며, 여기서 분석 보고는 타겟 gNB의 각각에 대한 현재 자원 소비 상태, 타겟 gNB의 각각에 대한 미래의 자원 소비 상태, 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB가 현재(현재 최적 타겟) 또는 미래의 어떤 시점(미래 최적 타겟)에서 핸드오버에 최적인지에 대한 인디케이션, 및 핸드오버를 위해 적어도 하나의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작 중 적어도 하나를 포함한다. 또한, 교정 동작 제어부는 핸드오버를 위해 적어도 하나의 타겟 gNB를 최적화하기 위한 적어도 하나의 교정 동작을 수행한다. 일 실시예에서, 교정 동작 제어부는 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB가 핸드오버에 최적 인지를 결정한다. 또한, 교정 동작 제어부는 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB가 핸드오버 에 최적임을 결정하는 것에 응답하여 소스 gNB에서 적어도 하나의 타겟 gNB로의 핸드오버를 수행한다. 또한, 교정 동작 제어부는 복수의 타겟 gNB 중 적어도 하나의 타겟 gNB가 핸드오버에 최적 이 아님을 결정하는 것에 응답하여 적어도 하나의 타겟 gNB와 연관된 가상 자원 및 무선 자원을 증가시키 기 위해 스케일 아웃 요청을 NFMS 서버로 송신한다. 또한, 교정 동작 제어부는 UE가 무선 네트워크에서 타겟 gNB로부터 멀리 이동하고 있는지 를 결정한다. 또한, 교정 동작 제어부는 UE가 무선 네트워크에서 타겟 gNB로부터 멀리 이동하지 않다고 결정하는 것에 응답하여 소스 gNB로부터 적어도 하나의 타겟 gNB로의 핸드오버를 수행 한다. 또한, 교정 동작 제어부는 UE가 무선 네트워크에서 타겟 gNB로부터 멀리 이동하고 있다고 결정하는 것에 응답하여 적어도 하나의 타겟 gNB와 연관된 가상 자원 및 무선 자원을 감소시키기 위해 스케일 인 요청을 NFMS 서버로 송신한다. 도 2b는 소스 gNB의 다양한 하드웨어 구성 요소를 도시하지만, 다른 실시예가 이에 제한되지 않는다는 것 이 이해되어야 한다. 다른 실시예에서, 소스 gNB는 더 적거나 더 많은 수의 구성 요소를 포함할 수 있다. 또한, 구성 요소의 라벨 또는 명칭은 예시를 위해서만 사용되며, 본 발명의 범위를 제한하지 않는다. 하나 이상 의 구성 요소는 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화를 위해 동일하거나 실질적으 로 유사한 기능을 수행하기 위해 함께 조합될 수 있다. 도 3a, 3b 및 3c는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원 된 핸드오버 최적화를 위한 다양한 동작을 도시한다. S302에서, 방법은 MDAS 서버가 무선 네트워크의 복수의 타겟 gNB로부터 데이터를 주기적으로 수집하 는 단계를 포함한다. S304에서, 방법은 MDAS 서버가 수집된 데이터에 기초하여 복수의 타겟 gNB 중 각각의 타겟 gNB에 대한 분석 보고를 생성하는 단계를 포함한다. S306에서, 방법은 UE가 핸드오버를 위한 복 수의 타겟 gNB로부터 소스 gNB로부터의 인접한 타겟 셀(적어도 하나의 타겟 gNB)의 가용성을 나타내 는 단계를 포함한다. S308에서, 방법은 MDAS 서버가 소스 gNB로부터 핸드오버를 위한 적어도 하나의 타겟 gNB의 분석 보고에 대한 요청을 수신하는 단계를 포함한다. S310에서, 방법은 MDAS 서버가 분석 보고를 소스 gNB로 송신하는 단계를 포함한다. 3212에서, 방법은 소스 gNB가 복수의 타겟 gNB 중 적 어도 하나의 타겟 gNB가 현재 또는 어떤 미래의 시점에서 핸드오버에 최적인지를 결정하는 단계를 포함한 다. S314에서, 방법은 복수의 타겟 gNB로부터의 적어도 하나의 타겟 gNB가 핸드오버에 최적임을 결정하는 것에 응답하여 소스 gNB가 소스 gNB로부터 적어도 하나의 타겟 gNB로의 핸드오버를 수행하는 단계를 포함한다. S316에서, 방법은 복수의 타겟 gNB로부터의 적어도 하나의 타겟 gNB가 핸드오버에 최적이 아님 을 결정하는 것에 응답하여 소스 gNB가 적어도 하나의 타겟 gNB와 연관된 가상 자원 및 무선 자원을 증가시키기 위해 스케일 아웃 요청을 NFMS 서버로 송신하는 단계를 포함한다. S318에서, 방법은 NFMS 서버 가 부가적인 가상 자원 및 무선 자원을 적어도 하나의 타겟 gNB에 할당하는 단계를 포함한다. S320에 서, 방법은 NFMS 서버가 적어도 하나의 타겟 gNB의 성공적인 스케일 아웃을 소스 gNB에 알리는 단계 를 포함한다. S322에서, 방법은 소스 gNB가 UE가 무선 네트워크에서 타겟 gNB로부터 멀 리 이동하는지를 결정하는 단계를 포함한다. S324에서, 방법은 UE가 무선 네트워크에서 타겟 gNB로부터 멀리 이동하지 않다고 결정하는 것 에 응답하여 소스 gNB가 소스 gNB로부터 적어도 하나의 타겟 gNB로의 핸드오버를 수행하는 단계 를 포함한다. S326에서, 방법은 UE가 무선 네트워크에서 타겟 gNB로부터 멀리 이동하고 있다고 결정하는 것에 응답하여 소스 gNB가 적어도 하나의 타겟 gNB와 연관된 가상 자원 및 무선 자원을 감 소시키기 위해 스케일 인 요청을 NFMS 서버로 송신하는 단계를 포함한다. S328에서, 방법은 NFMS 서버 가 부가적인 무선 자원을 적어도 하나의 타겟 gNB에 할당 해제하는 단계를 포함한다. S330에서, 방법 은 NFMS 서버가 적어도 하나의 타겟 gNB의 성공적인 스케일 인을 소스 gNB에 알리는 단계를 포 함한다. 도 4a 및 도 4b는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원 된 핸드오버 최적화를 도시한다. 401에서, MDAS 서버는 다양한 gNB 자원 관련된 데이터를 주기적으로 수집한다. 그런 다음, 데이터는 분석 보고를 생성하도록 분석된다. 402에서, UE는 RAN 데이터를 소스 gNB로 송신하고 핸드오버를 위해 인 접한 타겟 셀(예를 들어, 타겟 gNB)의 가용성을 소스 gNB에 나타낸다. 403에서, 소스 gNB는 핸 드오버가 UE에 필요하다고 결정하고, 소스 gNB는 타겟 gNB를 식별한다. 404에서, 소스 gNB는 타겟 gNB에 대한 자원 분석 보고에 대한 요청을 MDAS 서버(즉, MDAS 생산자)로 송신한다. 405에서, MDAS 서버는 관련된 보고를 식별하고 준비한다. 406에서, MDAS 서버는 할당된 가 상 자원 및 무선 자원, 소비된 가상 자원 및 무선 자원, 가까운 미래에 예상되는 가상 및 RAN 자원 사용량, 현 재 최적의 타겟(즉, YES/NO), 미래의 최적의 타겟(즉, YES/NO)/미래의 타임스탬프 및 교정 동작(예를 들어, 스 케일 아웃 gNB, 무선 자원(RRC 연결된 사용자, PDCP)의 증가)을 포함하는 타겟 gNB 자원 분석 보고를 제공한다. 407에서, 타겟 gNB가 핸드오버에 최적일 때에는, 평소와 같이 핸드오버 절차를 진행한다. 408에서, 타겟 gNB가 핸드오버에 최적이 아닐 때에는, 타겟 gNB를 스케일 아웃한다. NFMS 소비자 역할을 하는 소스 gNB는 부가적인 가상 자원을 타겟 gNB에 할당하는 타겟 gNB를 스케일 아웃하기 위해 ModifyNf 요청(섹션 7.11, 3GPP TS 28.531)을 NFMS 생성자(NFMS 서버, NFMS 서버는 NFMF(500a) 및 NFV MANO(500b)를 포함함)로 송신한다. 또한, NFMS 생성자는 소스 gNB에 대한 타겟 gNB의 성공적 스케일 아웃을 확인하고, 타겟 gNB의 가상 자원 및 무선 자원을 증가시킨다. 409에서, 소스 gNB는 평소와 같 이 핸드오버 절차의 진행을 수행한다. 410에서, 소스 gNB가 (UE가 소스 gNB 또는 다른 것으로부터 멀리 이동하기 때문에) 핸드오버하 지 않기로 결정하면, NFMS 소비자는 소스 gNB를 스케일 인하기 위해 ModifyNf 요청(섹션 7.11, 3GPP TS 28.531)을 NFMS 생성자로 송신한다. 또한, NFMS 생성자는 부가적인 가상 자원을 소스 gNB에 할당 해제한다. 또한, NFMS 생성자는 소스 gNB에 대한 타겟 gNB의 성공적 스케일 인을 확인한다. 411에서, 무선 자원은 증가에 비례하여 감소된다. 특정 실시예에 대한 상술한 설명은 본 명세서의 실시예의 일반적인 특성을 완전히 드러냄으로써, 다른 것이 현 재의 지식을 적용함으로써 일반적인 개념에서 벗어나지 않고 특정 실시예와 같이 다양한 적용에 쉽게 수정 및/ 또는 적응할 수 있도록 할 것이다. 따라서, 이러한 적응 및 수정은 개시된 실시예의 등가물의 의미 및 범위 내 에서 이해되어야 하고 의도된다. 본 명세서에 사용된 어구 또는 용어는 제한이 아니라 설명을 위한 것으로 이해 되어야 한다. 따라서, 본 명세서의 실시예가 바람직한 실시예의 관점에서 설명되었지만, 통상의 기술자는 본 명 세서의 실시예가 본 명세서에 설명된 바와 같은 실시예의 사상 및 범위 내에서 수정되어 실시될 수 있음을 인식 할 것이다.도면 도면1 도면2a 도면2b 도면3a 도면3b 도면3c 도면4a 도면4b"}
{"patent_id": "10-2022-7014737", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이 방법 및 시스템은 첨부된 도면에 도시되어 있으며, 전체 도면에 걸쳐 유사한 참조 문자는 다양한 도면에서 상응하는 부분을 나타낸다. 본 명세서의 실시예는 도면을 참조하여 다음의 설명으로부터 더 잘 이해될 것이다. 도 1은 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화의 전체 아키텍처이다. 도 2a는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 최적의 핸드오버를 제공하는 MDAS 서 버의 블록도를 도시한다. 도 2b는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 최적의 핸드오버를 제공하는 소스 gNB 의 블록도를 도시한다.도 3a는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화를 위한 다양한 동작을 예시하는 흐름도이다. 도 3b는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화를 위한 다양한 동작을 예시하는 흐름도이다. 도 3c는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화를 위한 다양한 동작을 예시하는 흐름도이다. 도 4a는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화를 예시하는 순차적 다이어그램이다. 도 4b는 본 명세서에 개시된 바와 같은 실시예에 따라 무선 네트워크에서 MDAS 서버 지원된 핸드오버 최적화를 예시하는 순차적 다이어그램이다."}
