{"patent_id": "10-2022-0146860", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0065746", "출원번호": "10-2022-0146860", "발명의 명칭": "2차원 나노시트 분산액 제조방법 및 2차원 나노시트 분산액을 사용한 전자 시냅스 소자 제조", "출원인": "한양대학교 산학협력단", "발명자": "김태환"}}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "층상구조를 가지는 3차원 물질을 제공하는 단계;물과 물이 아닌 극성용매의 혼합용매 내에 친수성 고분자가 용해된 친수성 고분자 용액을 준비하는 단계;상기 친수성 고분자 용액 내에 상기 3차원 물질을 넣고 전단력을 가하면서 분산시켜, 상기 3차원 물질을 2차원나노시트들로 박리하여 2차원 나노시트들이 분산된 2차원 나노시트 분산액을 얻는 단계를 포함하는, 2차원 나노시트 분산액 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 3차원 물질은 M1.33X 단위층들 또는 Mn+1Xn 단위층들이 적층된 층상구조를 갖는 물질로서, M은 전이금속이고,X는 X는 탄소와 질소 중 적어도 하나인, 2차원 나노시트 분산액 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 극성용매는 C1 내지 C3의 알코올, 아세톤 (Aceton), 및 아세트 산 (Acetic acid)으로 이루어진 군에서 선택된 적어도 하나의 용매인, 2차원 나노시트 분산액 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 친수성 고분자는 폴리 비닐 (polyvinyl), 폴리 아크릴 (polyacryl), 폴리 아민 (polyamine), 폴리 우레탄(polyuretane), 폴리아마이드(Polyamide), 및 다당류로 이루어진 군에서 선택되는 적어도 하나의 고분자인, 2차원 나노시트 분산액 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 3차원 물질은 Ti3C2 단위층들이 적층된 층상구조를 갖는 입자들이고,상기 극성용매는 에탄올이고,상기 친수성 고분자는 폴리비닐알코올인, 2차원 나노시트 분산액 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 전극을 제공하는 단계;상기 제1 전극 상에 물과 물이 아닌 극성용매의 혼합용매 내에 용해된 친수성 고분자 매트릭스 내에 2차원 나노시트들이 분산된 2차원 나노시트 분산액을 제공하여 저항변화층을 형성하는 단계;상기 저항변화층 상에 제2 전극을 형성하는 단계를 포함하는 전자 시냅스 소자 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제2 전극을 형성하기 전에, 상기 저항변화층을 건조하여 상기 혼합용매를 휘발시키는 단계를 더 포함하는전자 시냅스 소자 제조방법.공개특허 10-2024-0065746-3-청구항 8 제6항에 있어서,상기 2차원 나노시트는, M1.33X 단위층 또는 Mn+1Xn 단위층이 1 내지 수십개 적층된 것이고, M은 전이금속이고, X는 X는 탄소와 질소 중 적어도 하나인, 전자 시냅스 소자 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 친수성 고분자는 폴리 비닐 (polyvinyl), 폴리 아크릴 (polyacryl), 폴리 아민 (polyamine), 폴리 우레탄(polyuretane), 폴리아마이드(Polyamide), 및 다당류로 이루어진 군에서 선택되는 적어도 하나의 고분자인, 전자 시냅스 소자 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 극성용매는 C1 내지 C3의 알코올, 아세톤 (Aceton), 및 아세트 산 (Acetic acid)으로 이루어진 군에서 선택된 적어도 하나의 용매인, 전자 시냅스 소자 제조방법."}
{"patent_id": "10-2022-0146860", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서,상기 2차원 나노시트는 Ti3C2 단위층을 포함하고,상기 극성용매는 에탄올이고,상기 친수성 고분자는 폴리비닐알코올인, 전자 시냅스 소자 제조방법."}
{"patent_id": "10-2022-0146860", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "2차원 나노시트 분산액 제조방법 및 2차원 나노시트 분산액을 사용한 전자 시냅스 소자 제조방법을 제공한다. 층 상구조를 가지는 3차원 물질을 제공한다. 물과 물이 아닌 극성용매의 혼합용매 내에 친수성 고분자가 용해된 친 수성 고분자 용액을 준비한다. 상기 친수성 고분자 용액 내에 상기 3차원 물질을 넣고 전단력을 가하면서 분산시 켜, 상기 3차원 물질을 2차원 나노시트들로 박리하여 2차원 나노시트들이 분산된 2차원 나노시트 분산액을 얻는 다."}
{"patent_id": "10-2022-0146860", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 2차원 나노시트 분산액 제조방법 및 2차원 나노시트 분산액을 사용한 전자 시냅스 소자 제조방법에 관한 것이다."}
{"patent_id": "10-2022-0146860", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 사회의 전 분야에 걸쳐 인공지능 기술 도입이 시도되고 있다. 이러한 인공지능 기술 적용의 핵심 부품으로 생체 시냅스를 모방하는 전자 시냅스의 개발이 활발히 진행되고 있는 실정이다. 한편, 신체와 전자기기의 직접 적인 커뮤니케이션에 대한 요구가 증가하면서 스마트폰, 테블릿과 같은 휴대용 디바이스에서 시계, 팔찌, 이어 폰과 같은 웨어러블 디바이스의 필요성이 대두되고 있으며, 이러한 전자소자에 뉴로모픽 컴퓨팅을 접목하기 위 한 플렉서블/웨어러블 전자 시냅스에 대한 요구가 증대되고 있다. 우수한 전기적 특성을 나타내는 무기물을 기반으로 제작되는 전자 시냅스는 유연 상태에서의 내구성을 확보하기 어렵다는 단점이 있으며, 우수한 유연 특성을 지닌 유기 기반 전자 시냅스의 경우 시냅스 특성이 좋지 못한 단 점이 있다. 최근 두 물질의 장점을 극대화할 수 있는 나노복합체를 기반으로 하는 전자 시냅스에 대한 관심이 증대되고 있는 실정이다. 2차원 물질은 화학적 및 물리적 특성이 매우 우수하여 최근 전자 시냅스 소자 분야에 적용이 시도되고 있다. 그 러나, 2차원 물질을 bottom-up 방식으로 제조하는 방식은 고품질의 2차원 물질을 획득할 수 있으나, 고진공 및 고온 공정이 필요하며 대량 생산에 어려움이 있다."}
{"patent_id": "10-2022-0146860", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 간단한 방법으로 2차원 물질 분산액을 얻고 이를 사용하여 전자 시냅스 소자 제조방법을 제공함에 있다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과 제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0146860", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 이루기 위하여 본 발명의 일 측면은 2차원 나노시트 분산액 제조방법을 제공한다. 먼저, 층상구조 를 가지는 3차원 물질을 제공한다. 물과 물이 아닌 극성용매의 혼합용매 내에 친수성 고분자가 용해된 친수성 고분자 용액을 준비한다. 상기 친수성 고분자 용액 내에 상기 3차원 물질을 넣고 전단력을 가하면서 분산시켜, 상기 3차원 물질을 2차원 나노시트들로 박리하여 2차원 나노시트들이 분산된 2차원 나노시트 분산액을 얻는다. 상기 3차원 물질은 M1.33X 단위층들 또는 Mn+1Xn 단위층들이 적층된 층상구조를 갖는 물질일 수 있고, M은 전이금 속이고, X는 X는 탄소와 질소 중 적어도 하나일 수 있다. 상기 극성용매는 C1 내지 C3의 알코올, 아세톤 (Aceton), 및 아세트 산 (Acetic acid)으로 이루어진 군에서 선 택된 적어도 하나의 용매일 수 있다. 상기 친수성 고분자는 폴리 비닐 (polyvinyl), 폴리 아크릴 (polyacryl), 폴리 아민 (polyamine), 폴리 우레탄 (polyuretane), 폴리아마이드(Polyamide), 및 다당류로 이루어진 군에서 선택되는 적어도 하나의 고분자일 수 있다. 일 예에서, 상기 3차원 물질은 Ti3C2 단위층들이 적층된 층상구조를 갖는 입자들이고, 상기 극성용매는 에탄올이 고, 상기 친수성 고분자는 폴리비닐알코올일 수 있다. 상기 과제를 이루기 위하여 본 발명의 일 측면은 전자 시냅스 소자 제조방법을 제공한다. 먼저, 제1 전극을 제 공한다. 상기 제1 전극 상에 물과 물이 아닌 극성용매의 혼합용매 내에 용해된 친수성 고분자 매트릭스 내에 2 차원 나노시트들이 분산된 2차원 나노시트 분산액을 제공하여 저항변화층을 형성한다. 상기 저항변화층 상에 제 2 전극을 형성한다. 상기 제2 전극을 형성하기 전에, 상기 저항변화층을 건조하여 상기 혼합용매를 휘발시키는 단계를 더 포함할 수 있다. 상기 2차원 나노시트는, M1.33X 단위층 또는 Mn+1Xn 단위층이 1 내지 수십개 적층된 것이고, M은 전이금속이고, X 는 X는 탄소와 질소 중 적어도 하나일 수 있다. 일 예에서, 상기 2차원 나노시트는 Ti3C2 단위층을 포함하고, 상기 극성용매는 에탄올이고, 상기 친수성 고분자 는 폴리비닐알코올일 수 있다."}
{"patent_id": "10-2022-0146860", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "계면활성제를 사용하지 않는 간단한 방법으로 2차원 물질 분산액을 얻고 이를 사용하여 전자 시냅스 소자를 제 조할 수 있다."}
{"patent_id": "10-2022-0146860", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명을 보다 구체적으로 설명하기 위하여 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 보다 상세하게 설명한다. 그러나, 본 발명은 여기서 설명되어지는 실시예에 한정되지 않고 다른 형태로 구체화 될 수도 있다. 도면들에 있어서, 층이 다른 층 또는 기판 \"상\"에 있다고 언급되어지는 경우에 그것은 다른 층 또는 기판 상에 직접 형성될 수 있거나 또는 그들 사이에 제 3의 층이 개재될 수도 있다. 2차원 나노시트 분산액 제조 먼저, 층상구조를 가지는 3차원 물질을 제공할 수 있다. 상기 층상 구조를 가지는 3차원 물질은 구체적으로, 단 위층들이 반데르발스 힘과 같은 약한 층간 결합으로 이루어진 벌크 (bulk) 재료일 수 있으며, 그라파이트 (graphite), 육방정계 질화붕소 (hexagonal boron nitride), 전이금속 칼코겐화합물 (transition metal chalcogenide), 전이금속 탄화물 (transition metal carbide), 전이금속 질화물 (transition metal nitride) 중 적어도 하나의 물질일 수 있다. 상기 3차원 물질은 전이금속 탄화물 (transition metal carbide), 전이금속 질화물 (transition metal nitride), 또는 전이금속 탄질화물로서, MAX 상을 갖는 물질 즉, M1.33X 단위층들 또는 Mn+1Xn 단위층들 사이에 A 층 구체적으로 A 원자층이 끼어있는 구조를 갖는 물질로부터 A층을 식각한 후 얻어진 결과물일 수 있다. A는 Al 일 수 있다. 이 때, 식각은 불소를 함유하는 산 일 예로서, HF, LiF, NaF, KF, NH4F, 또는 NH4NF2을 사용하여 수 행할 수 있다. 일 예로서, 식각은 LiF/HCl 혼합용액을 사용하여 수행할 수 있다. 다시 말해서, 상기 3차원 물질은 M1.33X 단위층들 또는 Mn+1Xn 단위층들이 적층된 층상구조를 갖는 물질일 수 있다. 여기서, M은 전이금속이고, X는 탄소와 질소 중 적어도 하나일 수 있다. M1.33X은 일 예로서, Nb1.33C, Mo1.33C, 또는 W1.33C일 수 있다. Mn+1Xn (n=1)은 일 예로서, Ti2C, V2C, Nb2C, Mo2C, Ti2N, V2N, Mo2N, (Ti0.5Nb0.5)2C, (Ti0.5V0.5)2C, 또는 (Mo2/3Y1/3)2C 일 수 있다. Mn+1Xn (n=2)은 일 예로서, Ti3C2, Ti3CN, Zr3C2, Hf3C2, (Ti0.5V0.5)3C2, (Cr0.5V0.5)3C2, (Cr2/3Ti1/3)3C2, (Mo2/3Sc1/3)3C2, Mo2TiC2, 또는 Cr2TiC2 일 수 있다. Mn+1Xn (n=3)은 일 예로서, Ti4N3, V4C3, Nb4C3, Ta4C3, (Nb0.8Ti0.2)4C3, (Nb0.8Zr0.2)4C3, (Mo0.5Ti0.5)4C3, 또는 Mo2Ti2C3일 수 있다. 일 구체예에서, 상기 3차원 물질은 Ti3C2 단위층들이 적층된 층상구조를 갖는 입자들일 수 있다. 이 입자는 수십 ㎛ 수준의 크기를 가질 수 있다. 물과 물이 아닌 극성용매의 혼합용매 내에 친수성 고분자가 용해된 친수성 고분자 용액을 준비하고, 상기 친수 성 고분자 용액 내에 상기 3차원 물질을 넣고 전단력을 가하면서 분산시켜, 상기 3차원 물질을 2차원 나노시트 들로 박리하여 2차원 나노시트들이 분산된 2차원 나노시트 분산액을 얻을 수 있다. 상기 2차원 나노시트들은 상 기 3차원 물질 내의 단위층들 구체적으로, M1.33X 단위층 또는 Mn+1Xn 단위층이 1 내지 수십개 적층된 것일 수 있 다. 상기 물은 표면에너지가 매우 큰 물질로 상기 분산과정에서 비교적 큰 전단력을 상기 3차원 물질에 인가하여, 상기 3차원 물질을 2차원 나노시트들로 효율적으로 박리할 수 있다. 이에 더하여, 상기 극성용매는 상기 물에 대해 상용성이 있으면서도 물과의 표면에너지의 차이가 큰 유기용매로 일 예로서, 알코올 구체적으로, 메탄올(Methanol), 에탄올 (Ethanol), 아이소프로필알코올 (Isopropyl alcohol); 아세톤 (Aceton); 및 아세트 산 (Acetic acid)으로 이루어진 군에서 선택된 적어도 하나의 극성 유기 용매일 수 있다. 이러한 유기용매는 상기 혼합용매의 표면장력을 낮추어 3차원 물질들 내의 단위층들 사이로 용매의 침투를 용이하게 하여 상기 3차원 물질을 2차원 나노시트들로 박리하는데 도움을 줄 수 있다. 또한, 표면 에너지의 차이가 큰 두 용매가 혼합된 혼합용매를 사용하는 경우, 혼합된 각 용매에 의해 입체 반발(steric repulsion)이 발생하여, 상기 분산과정에서 더 큰 전단력을 3차원 물질에 인가하여 상기 3차원 물질을 2차원 나 노시트들로 더욱 효율적으로 박리할 수 있다. 상기 물과 상기 물이 아닌 극성용매는 8:2 내지 2:8의 부피비, 7:3 내지 3:7의 부피비, 6:4 내지 4:6의 부피비, 5.5:4.5 내지 4.5:5.5의 부피비, 일 예로서 5:5의 부피비로 혼합될 수 있다. 상기 친수성 고분자는 상기 혼합용매 내에 용해될 수 있는 것으로, 폴리 비닐 알코올 (polyvinyl alcohol), 폴 리 아크릴 (polyacryl), 폴리 아민 (polyamine), 폴리 우레탄 (polyuretane), 폴리아마이드(Polyamide), 및 다 당류로 이루어진 군에서 선택되는 적어도 하나의 고분자일 수 있다. 상기 2차원 나노시트 분산액 내에서 상기 2 차원 나노시트들 사이에는 상기 친수성 고분자가 배치되어, 상기 2차원 나노시트 분산액의 분산안정성을 향상시 킬 수 있다. 상기 친수성 고분자는 상기 2차원 나노시트들 혹은 상기 3차원 물질 대비 약 5 내지 15배의 중량으 로, 구체적으로는 약 8 내지 12배의 중량으로 함유될 수 있다. 상기 분산과정에서 전단력에 의해 상기 3차원 물질은 2차원 나노시트들로 박리됨과 동시에 일부 파쇄될 수 있다. 상기 분산은 초음파 처리를 사용하여 수행할 수 있으나 이에 한정되는 것은 아니다. 전자 시냅스 소자 도 1은 본 발명의 일 실시예에 따른 전자 시냅스 소자를 개략적으로 나타낸 단면도이다. 도 1을 참조하면, 기판을 제공할 수 있다. 상기 기판은 실리콘 기판, 유리 기판 또는 고분자 기판일 수 있다. 상기 실리콘 기판은 P-도핑된 실리콘 (P+ doped-Si)기판 일 수 있다. 상기 고분자 기판은 폴리이미드 (Polyimide) 기판, Polydimethylsiloxane (PDMS) 기판, PET(polyethylene terephthalate) 기판, PES(polyethersulfone) 기판. 또는 라이스 페이퍼(Rice paper) 기판일 수 있다. 그러나, 이에 한정되는 것은 아니다. 상기 기판 상에 버퍼층(미도시) 예를 들어, 실리콘 산화막 또는 실리콘 질화막이 형성될 수도 있 다. 상기 기판 상에 제1 전극을 형성할 수 있다. 상기 제1 전극은 금속막, 금속 질화물 도전막, 금속 산화물 도전막, 또는 이들의 조합일 수 있다. 금속 산화물 도전막은 IO (indium oxide), TO(Tin Oxide), ITO(indium tin oxide), FTO(Fluorine-doped Tin Oxide), AZO(Aluminum-doped Zinc Oxide), 또는 이들 중 둘 이상의 조합일 수 있다. 한편, 상기 금속막은 W막, Pt막, Ru막, Ir막, Al막, Mo막, Ag막, Cu막, Pd막, Au막, Mg막, Zn막, Fe막 또는 이들 중 둘 이상의 조합일 수 있고, 상기 금속 질화물 도전막은 TiN막일 수 있다. 이러 한 제1 전극은 스퍼터링(sputtering), 원자층 증착법(atomic layer deposition; ALD), 증발법(thermal evaporation), 펄스 레이저(pulsed laser depostion; PLD), 전자빔 증발법(electron beam evaporation), 물리 적 기상 증착법(physical vapor deposition; PVD) 및 화학적 기상 증착법(chemical vapor deposition; CVD)로 이루어진 군에서 선택된 방법을 이용하여 형성될 수 있다. 상기 제1 전극 상에 저항변화층을 형성할 수 있다. 상기 저항변화층은 앞서 설명한 2차원 나노시트 분산액을 사용하여 형성할 수 있다. 상기 2차원 나노시트 분산액은 물과 물이 아닌 극성용매의 혼합용매 내에 용해된 친수성 고분자 매트릭스 내에 2차원 나노시트들이 분산된 것일 수 있다. 상기 저항변화층은 상기 2차원 나노시트 분산액을 상기 제1 전극 상에 도포하여 형성할 수 있다. 상기 도포는 용액 공정, 일 예로서 스핀 코팅 (Spin coating), 스프레이 코팅 (Spray coating), 바 코팅 (Bar coating), 침지법 (Dip-coating), 커튼 코팅 (Curtain coating), 슬롯 코팅 (Slot coating), 롤 코팅 (Roll coating) 또는 그라비어 코팅 (Cravure coating)을 사용하여 수행할 수 있으나, 이에 한정되는 것은 아니다. 이 후, 도포된 2차원 나노시트 분산액을 건조할 수 있다. 이 경우, 상기 2차원 나노시트 분산액 내의 혼합용매 는 휘발될 수 있다. 그 결과, 저항변화층은 친수성 고분자 매트릭스 내에 2차원 나노시트들이 분산된 형태 를 가질 수 있다. 상기 용매, 상기 친수성 고분자, 및 2차원 나노시트들에 대한 설명은 위에 설명된 부분을 참 고하기로 한다. 이러한 저항변화층은 100nm 내지 1um의 두께를 가질 수 있다. 일 예로서, 저항변화층은 200nm 내지 500nm의 두께를 가질 수 있다. 그러나, 이에 한정되는 것은 아니다.이 후, 상기 저항변화층 상에 제2 전극을 형성할 수 있다. 상기 제2 전극은 금속막, 금속 질화물 도전막, 금속 산화물 도전막, 또는 이들의 조합일 수 있다. 금속 산화물 도전막은 IO (indium oxide), TO(Tin Oxide), ITO(indium tin oxide), FTO(Fluorine-doped Tin Oxide), AZO(Aluminum-doped Zinc Oxide), 또는 이 들 중 둘 이상의 조합일 수 있다. 한편, 상기 금속막은 W막, Pt막, Ru막, Ir막, Al막, Mo막, Ag막, Cu막, Pd 막, Au막, Mg막, Zn막, Fe막, 또는 이들 중 둘 이상의 조합일 수 있고, 상기 금속 질화물 도전막은 TiN막일 수 있다. 이러한 제2 전극은 스퍼터링(sputtering), 원자층 증착법(atomic layer deposition; ALD), 증발법 (thermal evaporation), 펄스 레이저(pulsed laser depostion; PLD), 전자빔 증발법(electron beam evaporation), 물리적 기상 증착법(physical vapor deposition; PVD) 및 화학적 기상 증착법(chemical vapor deposition; CVD)로 이루어진 군에서 선택된 방법을 이용하여 형성될 수 있다. 상기 제1 전극 및 제2 전극은 십자 (+) 형태로 교차된 형태인 크로스바 어레이 (Cross-bar array)되어 배치되도록 형성할 수 있다. 이러한 시냅스 소자는 셋 과정에서, 상기 저항변화층 내의 친수성 고분자 매트릭스 내에 분산된 2차원 나노 시트들에 전하가 트랩핑되고 충분한 전하가 트랩핑되는 특정 전압에서 저저항 상태로 전이될 될 수 있다. 저저 항 상태에서 제1 및 제2 전극들 사이에 인가된 전계로 인해 전자는 전하가 트랩핑된 2차원 나노시트들 사이를 호핑(hopping)할 수 있다. 반대로, 리셋과정에서는 2차원 나노시트들에 트랩핑된 전하가 빠져나오면서 고저항 상태로 전이될 수 있다. 또한, 상기 소자는 동일 외부 자극이 반복되는 경우 아날로그 저항변화에 의한 potentiation과 depression 특성 을 나타내는 등 시냅스적인 특성을 나타낼 수 있다. 이하, 본 발명의 이해를 돕기 위하여 바람직한 실험예(example)를 제시한다. 다만, 하기의 실험예는 본 발명의 이해를 돕기 위한 것일 뿐, 본 발명이 하기의 실험예에 의해 한정되는 것은 아니다. MXene 분산액 제조예 1 폴리비닐알코올(poly vinylalcohol, PVA) 0.5 g을 10 mL의 물에 넣고, 70 ℃에서 용액화하여 PVA 용액을 얻었 다. 상기 폴리비닐알코올 용액에 3차원 MXene 물질 (Ti3C2) 0.05 g을 혼합하고, 혼합용액을 8시간 동안 초음파 처리하였다. MXene 분산액 제조예 2 7.5:2.5의 부피비를 갖는 물과 에탄올의 혼합 용매 10 mL 내에 PVA 0.5 g을 넣고, 70 ℃에서 용액화하여 PVA 용 액을 얻었다. 상기 폴리비닐알코올 용액에 3차원 MXene 물질 (Ti3C2) 0.05 g을 혼합하고, 혼합용액을 8시간 동안 초음파 처리하였다. MXene 분산액 제조예 3 5:5의 부피비를 갖는 물과 에탄올의 혼합 용매 10 mL 내에 PVA 0.5 g을 넣고, 70 ℃에서 용액화하여 PVA 용액을 얻었다. 상기 폴리비닐알코올 용액에 3차원 MXene 물질 (Ti3C2) 0.05 g을 혼합하고, 혼합용액을 8시간 동안 초음 파 처리하였다. MXene 분산액 제조예 4 5:5의 부피비를 갖는 물과 에탄올의 혼합 용매 10 mL 내에 3차원 MXene 물질 (Ti3C2) 0.05 g을 혼합하고, 혼합 용액을 8시간 동안 초음파 처리하였다.도 2는 폴리비닐알코올 용액에 투입하기 전에 촬영된 3차원 MXene 입자의 주사전자현미경(SEM) 이미지이다. 도 2를 참조하면, 박리전 3차원 MXene 입자는 수십 ㎛ 수준의 크기를 갖는 벌크 (bulk) 입자임을 확인할 수 있 다. 도 3은 폴리비닐알코올 용액에 3차원 MXene 물질 (Ti3C2)을 투입한 후 초음파 처리 전(a), MXene 분산액 제조예 1(b), MXene 분산액 제조예 2(c), 및 MXene 분산액 제조예 3(d)을 따라 초음파 처리된 결과물들을 촬영한 광학 현미경 사진들을 보여준다. 도 3을 참조하면, 폴리비닐알코올 용액에 3차원 MXene 물질 (Ti3C2)을 투입한 후 초음파 처리 전(a)에는 수십 ㎛ 수준의 크기를 갖는 3차원 MXene 입자가 MXene 분산액 제조예 1(b), MXene 분산액 제조예 2(c), 및 MXene 분산 액 제조예 3(d)을 따라 초음파 처리된 후 작아져 MXene 나노입자로 변환된 것을 알 수 있다. 상기 MXene 나노입 자는 3차원 MXene 입자가 초음파 과정에서 박리되어 얻어진 MXene 2D 시트로 추정되었다. 이로부터, 계면활성제 없이 3차원 MXene 입자를 박리하여 MXene 2D 시트를 얻을 수 있다. 이에 더하여, 물만 사용한 경우 대비 7.5:2.5의 부피비를 갖는 물과 에탄올의 혼합 용매를 사용한 경우 MXene 2D 시트의 크기가 더 작고, 5:5의 부피비를 갖는 물과 에탄올의 혼합 용매를 사용한 경우 MXene 2D 시트의 크기 가 더욱 더 작은 것을 확인할 수 있다. 이로부터 혼합 용매가 사용된 경우에 MXene 박리가 더 잘 진행된 것을 확인할 수 있으며, 5:5의 용매 혼합비에서 박리가 가장 잘 이루어진 것을 확인할 수 있다. 이러한 결과는 에탄 올이 물과 상용성이 있으면서도 물과 표면에너지 차이가 커서, 초음파 처리시 입체 반발에 의해 MXene에 가해지 는 힘을 더 크게 할 수 있었음으로 이해할 수 있다. 도 4는 MXene 분산액 제조예 3(각 사진 우측) 및 MXene 분산액 제조예 4(각 사진 좌측)에서 초음파 처리전(a), 초음파 처리 후 5 분(b), 10 분(c), 30 분(d), 1 시간(e), 2 시간(f), 4 시간(g), 및 22 시간(h) 경과 후 촬영 한 사진들을 보여준다. 도 4를 참조하면, PVA를 포함하지 않는 MXene 분산액 제조예 4에 따른 MXene 분산액은 박리 후 약 22시간 경과 후에 MXene 나노시트들이 재응집되는 반면, PVA를 포함하는 MXene 분산액 제조예 3에 따른 MXene 분산액은 박리 후 약 22시간 경과 되더라도 MXene 나노시트들이 재응집되지 않아 분산액의 장기분산안정성이 우수한 것을 알 수 있다. 이는 PVA가 MXene 나노시트들 사이에 위치하여 응집을 억제하기 때문으로 이해되었다. 전자 시냅스 제조예 ITO가 코팅된 유리기판을 아세톤, 메탄올, 증류수 순으로 각 30분씩 초음파 처리하여 세정하였다. 세정된 ITO 기판 위에 MXene 분산액 제조예 3에서 얻어진 MXene 분산액을 떨어뜨리고 스핀-코팅 (spin-coating)을 통해 MXene-PVA 복합 박막층을 형성하였다. 이 때, 스핀-코팅은 2000 rpm으로 40초 동안 진행되었다. 100 ℃에서 약 1시간 어닐링하여 용매를 건조시킨 후, 열 증착 (Thermal evaporation) 을 사용하여 알루미늄 (Al) 으로 이루어 진 상부 전극을 약 200 nm 두께로 형성하였다. 도 5는 전자 시냅스 제조예에 따른 전자 시냅스의 단면을 촬영한 투과전자현미경 이미지이다. 도 5를 참조하면, 박리 전 수십 ㎛의 크기였던 3차원 MXene 입자가 수층 수준의 MXene 나노시트들로 잘 박리되 었음을 확인할 수 있다. 도 6은 전자 시냅스 제조예에 따른 전자 시냅스의 전류-전압 그래프이다. 도 6을 참조하면, 양의 전압에 의해 고저항 상태에서 저저항 상태로 변조되었으며, 변조된 저저항 상태는 음의 전압 스윕에 의해 다시 고저항 상태로 변조될 수 있다. 이로부터 전자 시냅스 제조예에 따른 전자 시냅스는 저 항변화 메모리 특성을 나타냄을 알 수 있다.도 7은 전자 시냅스 제조예에 따른 전자 시냅스에 전압 펄스를 반복할 때, 저저항 상태에서 상하부 전극들 사이 의 전도도를 나타낸 그래프이다. 양의 전압 펄스는 펄스 폭이 100 us인 1.4 V 의 전압 펄스이고, 음의 전압 펄 스는 펄스 폭이 100 us인 -0.9 V 의 전압 펄스이고, 읽기 전압은 0.1 V였다. 도 7을 참조하면, 양의 전압 펄스를 반복하는 경우 펄스 수가 증가할수록 전도도가 점차로 증가하다가 (potentiation), 음의 전압 펄스를 반복하는 경우 펄스 수가 증가할수록 전도도가 점차로 감소하는(depression) 특성 즉, 동일 외부 자극이 반복되는 경우 아날로그 저항변화에 의한 potentiation과 depression 특성을 나타내 는 등 시냅스적인 특성을 나타내는 것을 알 수 있다. 도 8은 전자 시냅스 제조예에 따른 전자 시냅스의 소자 특성을 기반으로 한 시뮬레이션 결과를 나타낸다. 도 8을 참조하면, 에폭(epoch) 30번 후, 인식률이 약 86%의 높은 정확도를 나타내었다. 이상, 본 발명을 바람직한 실시예를 들어 상세하게 설명하였으나, 본 발명은 상기 실시예에 한정되지 않고, 본 발명의 기술적 사상 및 범위 내에서 당 분야에서 통상의 지식을 가진 자에 의하여 여러가지 변형 및 변경이 가 능하다."}
{"patent_id": "10-2022-0146860", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 전자 시냅스 소자를 개략적으로 나타낸 단면도이다. 도 2는 폴리비닐알코올 용액에 투입하기 전에 촬영된 3차원 MXene 입자의 주사전자현미경(SEM) 이미지이다. 도 3은 폴리비닐알코올 용액에 3차원 MXene 물질 (Ti3C2)을 투입한 후 초음파 처리 전(a), MXene 분산액 제조예 1(b), MXene 분산액 제조예 2(c), 및 MXene 분산액 제조예 3(d)을 따라 초음파 처리된 결과물들을 촬영한 광학 현미경 사진들을 보여준다. 도 4는 MXene 분산액 제조예 3(각 사진 우측) 및 MXene 분산액 제조예 4(각 사진 좌측)에서 초음파 처리전(a), 초음파 처리 후 5 분(b), 10 분(c), 30 분(d), 1 시간(e), 2 시간(f), 4 시간(g), 및 22 시간(h) 경과 후 촬영 한 사진들을 보여준다.도 5는 전자 시냅스 제조예에 따른 전자 시냅스의 단면을 촬영한 투과전자현미경 이미지이다. 도 6은 전자 시냅스 제조예에 따른 전자 시냅스의 전류-전압 그래프이다. 도 7은 전자 시냅스 제조예에 따른 전자 시냅스에 전압 펄스를 반복할 때, 저저항 상태에서 상하부 전극들 사이 의 전도도를 나타낸 그래프이다."}
