{"patent_id": "10-2020-0183500", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0002051", "출원번호": "10-2020-0183500", "발명의 명칭": "텍스트 내의 이벤트 추출 방법, 장치, 전자 기기, 및 저장 매체", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "판, 루"}}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "텍스트 내의 이벤트 추출 방법에 있어서입력 텍스트를 획득하는 단계; 상기 입력 텍스트의 트리거 단어 추출 결과를 획득하도록, 상기 입력 텍스트를 트리거 단어 추출 모델에 입력하는 단계; 상기 입력 텍스트의 논항 추출 결과를 획득하도록, 상기 입력 텍스트 및 상기 트리거 단어 추출 결과를 논항 추출 모델에 입력하는 단계; 및상기 입력 텍스트의 이벤트 추출 결과를 상기 트리거 단어 추출 결과 및 상기 논항 추출 결과에 따라 결정하는단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 입력 텍스트의 이벤트 추출 결과를 상기 트리거 단어 추출 결과 및 상기 논항 추출 결과에 따라 결정하는단계는,상기 입력 텍스트 내의 트리거 단어를 상기 트리거 단어 추출 결과에 따라 결정하는 단계;상기 트리거 단어에 따라 상기 트리거 단어를 속한 이벤트 유형을 결정하는 단계;상기 논항 추출 결과에 따라 상기 입력 텍스트 내의 논항을 결정하는 단계;상기 이벤트 유형에 따라, 상기 논항이 상기 이벤트 유형에 속한 논항 역할을 결정하는 단계; 및상기 입력 텍스트의 이벤트 추출 결과를 상기 트리거 단어, 상기 이벤트 유형, 상기 논항 및 상기 논항 역할에따라 결정하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 입력 텍스트의 트리거 단어 추출 결과를 획득하도록, 상기 입력 텍스트를 제 1 사전 트레이닝 언어 모델및 제 1 시퀀스 레이블링 네트워크를 포함하는 트리거 단어 추출 모델에 입력하는 단계는,상기 입력 텍스트의 문자 시퀀스를 획득하도록 상기 입력 텍스트에 대한 단어 분할을 수행하는 단계;상기 문자 시퀀스의 제 1 의미 특징 벡터 시퀀스를 획득하도록, 상기 문자 시퀀스를 제 1 사전 트레이닝 언어모델에 입력하는 단계;상기 문자 시퀀스의 트리거 단어 레이블링 시퀀스를 획득하도록, 상기 제 1 의미 특징 벡터 시퀀스를 상기 제 1시퀀스 레이블링 네트워크에 입력하는 단계; 및상기 입력 텍스트의 트리거 단어 추출 결과를 상기 트리거 단어 레이블링 시퀀스에 따라 결정하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 문자 시퀀스의 트리거 단어 레이블링 시퀀스를 획득하도록, 상기 제 1 의미 특징 벡터 시퀀스를 제 1 조건부 무작위장 층을 포함하는 상기 제 1 시퀀스 레이블링 네트워크에 입력하는 단계는,공개특허 10-2022-0002051-3-상기 제 1 의미 특징 벡터 시퀀스에 따라, 각 트리거 단어의 레이블링 라벨 상에서의 상기 문자 시퀀스 내의 각문자의 확률값을 결정하는 단계;상기 제 1 조건부 무작위장 층에 대응하는 제 1 라벨 전환 확률 매트릭스를 획득하는 단계;상기 제 1 라벨 전환 확률 매트릭스 및 각각의 트리거 단어 레이블링 라벨 상에서의 각각의 문자의 확률 값에따라 상기 문자 시퀀스의 복수의 후보 트리거 단어 추출 결과의 확률 값을 결정하는 단계; 및상기 복수의 후보 트리거 단어 시퀀스로부터 최대 확률 값을 갖는 후보 트리거 단어 레이블링 시퀀스를 상기 문자 시퀀스의 트리거 단어 레이블링 시퀀스로서 획득하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 입력 텍스트의 논항 추출 결과를 획득하도록, 상기 입력 텍스트 및 상기 트리거 단어 추출 결과를 제 2 사전 트레이닝 언어 모델 및 제 2 시퀀스 레이블링 네트워크를 포함하는 논항 추출 모델에 입력하는 단계는,상기 입력 텍스트의 문자 시퀀스를 획득하도록, 상기 입력 텍스트에 대한 단어 분할을 수행하는 단계;상기 트리거 단어 추출 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 단계;상기 문자 시퀀스에 대응하는 텍스트 특징 벡터 시퀀스를 상기 문자 시퀀스에 따라 결정하는 단계;상기 텍스트 특징 벡터 시퀀스 및 상기 트리거 단어 특징 벡터 시퀀스를 합산하여 융합 특징 벡터 시퀀스를 획득하는 단계;상기 융합 특징 벡터 시퀀스를 제 2 사전 트레이닝 언어 모델에 입력하여 상기 문자 시퀀스의 제 2 의미 특징벡터 시퀀스를 획득하는 단계; 상기 제 2 의미 특징 벡터 시퀀스를 제 2 시퀀스 레이블링 네트워크에 입력하여 상기 문자 시퀀스의 논항 레이블링 시퀀스를 획득하는 단계; 및상기 논항 레이블링 시퀀스에 따라 상기 입력 텍스트의 논항을 결정하는 단계를 포함하는 것을 특징으로 하는텍스트 내의 이벤트 추출 방법."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 제 2 의미 특징 벡터 시퀀스를 제 2 조건부 무작위장 층을 포함하는 제 2 시퀀스 레이블링 네트워크에 입력하여 상기 문자 시퀀스의 논항 레이블링 시퀀스를 획득하는 단계는,상기 제 2 의미 특징 벡터 시퀀스에 따라, 각 논항의 레이블링 라벨 상에서의 상기 문자 시퀀스 내의 각 문자의확률값을 결정하는 단계;상기 제 2 조건부 무작위장 층에 대응하는 제 2 라벨 전환 확률 매트릭스를 획득하는 단계;상기 제 2 라벨 전환 확률 매트릭스 및 각각의 논항 레이블링 라벨 상에서의 각각의 문자의 확률 값에 따라 상기 문자 시퀀스의 복수의 후보 논항 레이블링 시퀀스의 확률 값을 결정하는 단계; 및상기 복수의 후보 논항 시퀀스로부터 최대 확률 값을 갖는 후보 논항 레이블링 시퀀스를 상기 문자 시퀀스의 논항 레이블링 시퀀스로서 획득하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 입력 텍스트 내의 각각의 문자의 트리거 단어 인식 결과를 포함하는 상기 트리거 단어 추출 결과에 따라상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 단계는,각각의 문자의 트리거 단어 인식 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 단공개특허 10-2022-0002051-4-계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "텍스트 내의 이벤트 추출 장치에 있어서,입력 텍스트를 획득하는 획득 모듈; 상기 입력 텍스트를 트리거 단어 추출 모듈에 입력하여 상기 입력 텍스트의 트리거 단어 추출 결과를 획득하는트리거 단어 추출 모듈; 상기 입력 텍스트 및 상기 트리거 단어 추출 결과를 논항 추출 모듈에 입력하여 상기 입력 텍스트의 논항 추출결과를 획득하는 논항 추출 모듈; 및상기 트리거 단어 추출 결과 및 상기 논항 추출 결과에 따라 상기 입력 텍스트의 이벤트 추출 결과를 결정하는결정 모듈을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 결정 모듈은,상기 트리거 단어 추출 결과에 따라 상기 입력 텍스트 내의 트리거 단어를 결정하도록 구성되는 제 1 결정 서브모듈; 상기 트리거 단어에 따라 상기 트리거 워드가 속하는 이벤트 유형을 결정하도록 구성되는 제 2 결정 서브 모듈; 상기 논항 추출 결과에 따라 상기 입력 텍스트의 논항을 결정하도록 구성되는 제 3 결정 서브 모듈;상기 이벤트 유형에 따라, 상기 논항이 이벤트 타입에 속하는 논항 역할을 결정하도록 구성되는 제 4 결정 서브모듈;상기 트리거 단어, 상기 이벤트 유형, 상기 논항, 및 상기 논항 역할에 따라 상기 입력 텍스트의 이벤트 추출결과를 결정하도록 구성되는 제 5 결정 서브 모듈을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,제 1 사전 트레이닝 언어 모델 및 제 1 시퀀스 레이블링 네트워크를 포함하는 트리거 단어 추출 모듈은,상기 입력 텍스트의 문자 시퀀스를 획득하도록, 상기 입력 텍스트에 대한 단어 분할 수행하도록 구성되는 제 1단어 분할 서브 모듈;상기 문자 시퀀스의 제 1 의미 특징 벡터 시퀀스를 획득하도록, 제 1 사전 트레이닝 언어 모델에 상기 문자 시퀀스를 입력하도록 구성되는 제 1 의미 특징 표현 서브 모듈;상기 문자 시퀀스의 트리거 단어의 시퀀스를 획득하도록, 상기 제 1 시퀀스 레이블링 네트워크에 상기 제 1 의미 특징 벡터 시퀀스를 입력하도록 구성되는 제 1 레이블링 서브 모듈; 및상기 트리거 단어 레이블링 시퀀스에 따라 상기 입력 텍스트의 트리거 단어 추출 결과를 결정하도록 구성되는제 6 결정 서브 모듈을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 제 1 시퀀스 레이블링 네트워크는 제 1 조건부 무작위장 층을 포함하고, 상기 제 1 레이블링 서브 모듈은,상기 제 1 의미 특징 벡터 시퀀스에 따라 각각의 트리거 단어의 레이블링 라벨 상에서의 상기 문자 시퀀스 내의각 문자의 확률 값을 결정하도록 구성되는 제 1 결정 유닛;상기 제 1 조건부 무작위장 층에 대응하는 제 1 라벨 전환 확률 매트릭스를 획득하도록 구성되는 제 1 획득 유공개특허 10-2022-0002051-5-닛;상기 제 1 라벨 전환 확률 매트릭스 및 각각의 트리거 단어의 레이블링 라벨 상에서의 각 문자의 확률 값에 따라 상기 문자 시퀀스의 복수의 후보 트리거 단어 추출 결과의 확률 값을 결정하도록 구성되는 제 2 결정 유닛;상기 복수의 후보 트리거 단어 시퀀스로부터 최대 확률 값을 갖는 후보 트리거 단어 레이블링 시퀀스를 상기 문자 시퀀스의 트리거 단어 레이블링 시퀀스로서 획득하도록 구성되는 제 2 획득 유닛을 포함하는 것을 특징으로하는 텍스트 내의 이벤트 추출 장치."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,제 2 사전 트레이닝 언어 모델 및 제 2 시퀀스 레이블링 네트워크를 포함하는 상기 논항 추출 모델은, 상기 입력 텍스트의 문자 시퀀스를 획득하도록, 상기 입력 텍스트에 대한 단어 분할 수행하도록 구성되는 제 2단어 분할 서브 모듈;상기 트리거 단어 추출 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하도록 구성되는제 7 결정 서브 모듈;상기 문자 시퀀스에 따라 상기 문자 시퀀스에 대응하는 텍스트 특징 벡터들 시퀀스를 결정하도록 구성되는 제 8결정 서브 모듈;상기 텍스트 특징 벡터 시퀀스 및 상기 트리거 단어 특징 벡터 시퀀스를 합산하여 융합 특징 벡터 시퀀스를 획득하도록 구성되는 융합 서브 모듈;상기 문자 시퀀스의 제 2 의미 특징 벡터 시퀀스를 획득하도록, 상기 제 2 사전 트레이닝 언어 모델에 상기 융합 특징 벡터 시퀀스를 입력하도록 구성되는 제 2 의미 특징 표현 서브 모듈;상기 문자 시퀀스의 논항 레이블링 시퀀스를 획득하도록, 상기 제 2 시퀀스 레이블링 네트워크에 상기 제 2 의미 특징 벡터 시퀀스를 입력하도록 구성되는 제 2 레이블링 서브 모듈;상기 논항 레이블링 시퀀스에 따라 상기 입력 텍스트의 논항을 결정하도록 구성되는 제 9 결정 서브 모듈을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제 2 시퀀스 레이블링 네트워크는 제 2 조건부 무작위장 층을 포함하고, 상기 제 2 레이블링 서브 모듈은,상기 제 2 의미 특징 벡터 시퀀스에 따라 각각의 논항 레이블링 라벨 상에서의 상기 문자 시퀀스 내의 각각의문자의 확률 값을 결정하도록 구성되는 제 3 결정 유닛;상기 제 2 조건부 무작위장 층에 대응하는 제 2 라벨 전환 확률 매트릭스를 획득하도록 구성되는 제 3 획득 유닛;상기 제 2 라벨 전환 확률 매트릭스 및 각각의 논항 레이블링 라벨 상에서의 각각의 문자의 확률 값에 따라 상기 문자 시퀀스의 복수의 후보 논항 레이블 시퀀스의 확률 값을 결정하도록 구성되는 제 4 결정 유닛;상기 복수의 후보 논항 시퀀스로부터 최대 확률 값을 갖는 후보 논항 레이블링 시퀀스를 상기 문자 시퀀스의 논항 레이블링 시퀀스로서 획득하도록 구성되는 제 4 획득 유닛을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,트리거 단어 추출 결과는 상기 입력 텍스트 내의 각각의 문자의 트리거 단어 인식 결과를 포함하고, 상기 제 7결정 서브 모듈은,상기 각각의 문자의 트리거 단어 인식 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하공개특허 10-2022-0002051-6-는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 기기에 있어서적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 가능하게 연결되는 메모리를 포함하고,상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어 있으며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행되어 상기 적어도 하나의 프로세서가 제1항 내지 제7항 중 어느 한 항에 따른텍스트 내의 이벤트 추출 방법을 수행하도록 하는 것을 특징으로 하는 전자 기기."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체에 있어서,상기 컴퓨터 명령은 상기 컴퓨터로 하여금 제1항 내지 제7항 중 어느 한 항에 따른 텍스트 내의 이벤트 추출 방법을 수행하도록 하는 것을 특징으로 하는 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2020-0183500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "컴퓨터 판독 가능 저장 매체에 저장되어 있는 컴퓨터 프로그램에 있어서,상기 컴퓨터 프로그램중의 명령이 실행될 경우, 제1항 내지 제7항 중 어느 한 항의 텍스트 내의 이벤트 추출 방법이 실행되는, 것을 특징으로 하는 컴퓨터 판독 가능 저장 매체에 저장되어 있는 컴퓨터 프로그램."}
{"patent_id": "10-2020-0183500", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 텍스트 내의 이벤트 추출 방법, 장치, 전자 기기, 및 저장 매체를 개시하며, 지식 그래프, 딥 러닝 및 자연어 처리"}
{"patent_id": "10-2020-0183500", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것이다. 구체적으로, 입력 텍스트에 대한 이벤트 추출을 수행할 때, 트리거 단어 추출 모델을 통해 입력 텍스트에 대한 트리거 단어 추출을 수행하여 이 입력 텍스트의 트리거 단어 추출 결과를 획득하고, 입력 텍스트 및 트리거 단어 추출 결과를 논항 추출 모델에 입력하여 입력 텍스트의 논항 추출 결과를 획득하고, 트리거 단어 추출 결과 및 논항 추출 결과를 결합하여 입력 텍스트의 이벤트 추출 결과를 결정한다. 따라서, 트리거 단어 추출 모델 및 논항 추출 모델을 결합하여 입력 텍스트에 대한 이벤트 추출을 구현하고, 입 력 텍스트 내의 이벤트 추출의 정확도를 향상시키고, 이벤트 추출의 구축 비용을 줄일 수 있고, 어느 인공 특징 구축도 필요하지 않다. 대 표 도 - 도1"}
{"patent_id": "10-2020-0183500", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2022-0002051 CPC특허분류 G06F 40/237 (2020.01) G06F 40/30 (2020.01) G06N 3/08 (2013.01)명 세 서 청구범위 청구항 1 텍스트 내의 이벤트 추출 방법에 있어서 입력 텍스트를 획득하는 단계; 상기 입력 텍스트의 트리거 단어 추출 결과를 획득하도록, 상기 입력 텍스트를 트리거 단어 추출 모델에 입력하 는 단계; 상기 입력 텍스트의 논항 추출 결과를 획득하도록, 상기 입력 텍스트 및 상기 트리거 단어 추출 결과를 논항 추 출 모델에 입력하는 단계; 및 상기 입력 텍스트의 이벤트 추출 결과를 상기 트리거 단어 추출 결과 및 상기 논항 추출 결과에 따라 결정하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법. 청구항 2 제1항에 있어서, 상기 입력 텍스트의 이벤트 추출 결과를 상기 트리거 단어 추출 결과 및 상기 논항 추출 결과에 따라 결정하는 단계는, 상기 입력 텍스트 내의 트리거 단어를 상기 트리거 단어 추출 결과에 따라 결정하는 단계; 상기 트리거 단어에 따라 상기 트리거 단어를 속한 이벤트 유형을 결정하는 단계; 상기 논항 추출 결과에 따라 상기 입력 텍스트 내의 논항을 결정하는 단계; 상기 이벤트 유형에 따라, 상기 논항이 상기 이벤트 유형에 속한 논항 역할을 결정하는 단계; 및 상기 입력 텍스트의 이벤트 추출 결과를 상기 트리거 단어, 상기 이벤트 유형, 상기 논항 및 상기 논항 역할에 따라 결정하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법. 청구항 3 제1항에 있어서, 상기 입력 텍스트의 트리거 단어 추출 결과를 획득하도록, 상기 입력 텍스트를 제 1 사전 트레이닝 언어 모델 및 제 1 시퀀스 레이블링 네트워크를 포함하는 트리거 단어 추출 모델에 입력하는 단계는, 상기 입력 텍스트의 문자 시퀀스를 획득하도록 상기 입력 텍스트에 대한 단어 분할을 수행하는 단계; 상기 문자 시퀀스의 제 1 의미 특징 벡터 시퀀스를 획득하도록, 상기 문자 시퀀스를 제 1 사전 트레이닝 언어 모델에 입력하는 단계; 상기 문자 시퀀스의 트리거 단어 레이블링 시퀀스를 획득하도록, 상기 제 1 의미 특징 벡터 시퀀스를 상기 제 1 시퀀스 레이블링 네트워크에 입력하는 단계; 및 상기 입력 텍스트의 트리거 단어 추출 결과를 상기 트리거 단어 레이블링 시퀀스에 따라 결정하는 단계를 포함 하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법. 청구항 4 제3항에 있어서, 상기 문자 시퀀스의 트리거 단어 레이블링 시퀀스를 획득하도록, 상기 제 1 의미 특징 벡터 시퀀스를 제 1 조건 부 무작위장 층을 포함하는 상기 제 1 시퀀스 레이블링 네트워크에 입력하는 단계는,상기 제 1 의미 특징 벡터 시퀀스에 따라, 각 트리거 단어의 레이블링 라벨 상에서의 상기 문자 시퀀스 내의 각 문자의 확률값을 결정하는 단계; 상기 제 1 조건부 무작위장 층에 대응하는 제 1 라벨 전환 확률 매트릭스를 획득하는 단계; 상기 제 1 라벨 전환 확률 매트릭스 및 각각의 트리거 단어 레이블링 라벨 상에서의 각각의 문자의 확률 값에 따라 상기 문자 시퀀스의 복수의 후보 트리거 단어 추출 결과의 확률 값을 결정하는 단계; 및 상기 복수의 후보 트리거 단어 시퀀스로부터 최대 확률 값을 갖는 후보 트리거 단어 레이블링 시퀀스를 상기 문 자 시퀀스의 트리거 단어 레이블링 시퀀스로서 획득하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤 트 추출 방법. 청구항 5 제1항에 있어서, 상기 입력 텍스트의 논항 추출 결과를 획득하도록, 상기 입력 텍스트 및 상기 트리거 단어 추출 결과를 제 2 사 전 트레이닝 언어 모델 및 제 2 시퀀스 레이블링 네트워크를 포함하는 논항 추출 모델에 입력하는 단계는, 상기 입력 텍스트의 문자 시퀀스를 획득하도록, 상기 입력 텍스트에 대한 단어 분할을 수행하는 단계; 상기 트리거 단어 추출 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 단계; 상기 문자 시퀀스에 대응하는 텍스트 특징 벡터 시퀀스를 상기 문자 시퀀스에 따라 결정하는 단계; 상기 텍스트 특징 벡터 시퀀스 및 상기 트리거 단어 특징 벡터 시퀀스를 합산하여 융합 특징 벡터 시퀀스를 획 득하는 단계; 상기 융합 특징 벡터 시퀀스를 제 2 사전 트레이닝 언어 모델에 입력하여 상기 문자 시퀀스의 제 2 의미 특징 벡터 시퀀스를 획득하는 단계; 상기 제 2 의미 특징 벡터 시퀀스를 제 2 시퀀스 레이블링 네트워크에 입력하여 상기 문자 시퀀스의 논항 레이 블링 시퀀스를 획득하는 단계; 및 상기 논항 레이블링 시퀀스에 따라 상기 입력 텍스트의 논항을 결정하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법. 청구항 6 제5항에 있어서, 상기 제 2 의미 특징 벡터 시퀀스를 제 2 조건부 무작위장 층을 포함하는 제 2 시퀀스 레이블링 네트워크에 입 력하여 상기 문자 시퀀스의 논항 레이블링 시퀀스를 획득하는 단계는, 상기 제 2 의미 특징 벡터 시퀀스에 따라, 각 논항의 레이블링 라벨 상에서의 상기 문자 시퀀스 내의 각 문자의 확률값을 결정하는 단계; 상기 제 2 조건부 무작위장 층에 대응하는 제 2 라벨 전환 확률 매트릭스를 획득하는 단계; 상기 제 2 라벨 전환 확률 매트릭스 및 각각의 논항 레이블링 라벨 상에서의 각각의 문자의 확률 값에 따라 상 기 문자 시퀀스의 복수의 후보 논항 레이블링 시퀀스의 확률 값을 결정하는 단계; 및 상기 복수의 후보 논항 시퀀스로부터 최대 확률 값을 갖는 후보 논항 레이블링 시퀀스를 상기 문자 시퀀스의 논 항 레이블링 시퀀스로서 획득하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법. 청구항 7 제5항에 있어서, 상기 입력 텍스트 내의 각각의 문자의 트리거 단어 인식 결과를 포함하는 상기 트리거 단어 추출 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 단계는, 각각의 문자의 트리거 단어 인식 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 단계를 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 방법. 청구항 8 텍스트 내의 이벤트 추출 장치에 있어서, 입력 텍스트를 획득하는 획득 모듈; 상기 입력 텍스트를 트리거 단어 추출 모듈에 입력하여 상기 입력 텍스트의 트리거 단어 추출 결과를 획득하는 트리거 단어 추출 모듈; 상기 입력 텍스트 및 상기 트리거 단어 추출 결과를 논항 추출 모듈에 입력하여 상기 입력 텍스트의 논항 추출 결과를 획득하는 논항 추출 모듈; 및 상기 트리거 단어 추출 결과 및 상기 논항 추출 결과에 따라 상기 입력 텍스트의 이벤트 추출 결과를 결정하는 결정 모듈을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치. 청구항 9 제8항에 있어서, 상기 결정 모듈은, 상기 트리거 단어 추출 결과에 따라 상기 입력 텍스트 내의 트리거 단어를 결정하도록 구성되는 제 1 결정 서브 모듈; 상기 트리거 단어에 따라 상기 트리거 워드가 속하는 이벤트 유형을 결정하도록 구성되는 제 2 결정 서브 모듈; 상기 논항 추출 결과에 따라 상기 입력 텍스트의 논항을 결정하도록 구성되는 제 3 결정 서브 모듈; 상기 이벤트 유형에 따라, 상기 논항이 이벤트 타입에 속하는 논항 역할을 결정하도록 구성되는 제 4 결정 서브 모듈; 상기 트리거 단어, 상기 이벤트 유형, 상기 논항, 및 상기 논항 역할에 따라 상기 입력 텍스트의 이벤트 추출 결과를 결정하도록 구성되는 제 5 결정 서브 모듈을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장 치. 청구항 10 제8항에 있어서, 제 1 사전 트레이닝 언어 모델 및 제 1 시퀀스 레이블링 네트워크를 포함하는 트리거 단어 추출 모듈은, 상기 입력 텍스트의 문자 시퀀스를 획득하도록, 상기 입력 텍스트에 대한 단어 분할 수행하도록 구성되는 제 1 단어 분할 서브 모듈; 상기 문자 시퀀스의 제 1 의미 특징 벡터 시퀀스를 획득하도록, 제 1 사전 트레이닝 언어 모델에 상기 문자 시 퀀스를 입력하도록 구성되는 제 1 의미 특징 표현 서브 모듈; 상기 문자 시퀀스의 트리거 단어의 시퀀스를 획득하도록, 상기 제 1 시퀀스 레이블링 네트워크에 상기 제 1 의 미 특징 벡터 시퀀스를 입력하도록 구성되는 제 1 레이블링 서브 모듈; 및 상기 트리거 단어 레이블링 시퀀스에 따라 상기 입력 텍스트의 트리거 단어 추출 결과를 결정하도록 구성되는 제 6 결정 서브 모듈을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치. 청구항 11 제10항에 있어서, 상기 제 1 시퀀스 레이블링 네트워크는 제 1 조건부 무작위장 층을 포함하고, 상기 제 1 레이블링 서브 모듈은, 상기 제 1 의미 특징 벡터 시퀀스에 따라 각각의 트리거 단어의 레이블링 라벨 상에서의 상기 문자 시퀀스 내의 각 문자의 확률 값을 결정하도록 구성되는 제 1 결정 유닛; 상기 제 1 조건부 무작위장 층에 대응하는 제 1 라벨 전환 확률 매트릭스를 획득하도록 구성되는 제 1 획득 유닛; 상기 제 1 라벨 전환 확률 매트릭스 및 각각의 트리거 단어의 레이블링 라벨 상에서의 각 문자의 확률 값에 따 라 상기 문자 시퀀스의 복수의 후보 트리거 단어 추출 결과의 확률 값을 결정하도록 구성되는 제 2 결정 유닛; 상기 복수의 후보 트리거 단어 시퀀스로부터 최대 확률 값을 갖는 후보 트리거 단어 레이블링 시퀀스를 상기 문 자 시퀀스의 트리거 단어 레이블링 시퀀스로서 획득하도록 구성되는 제 2 획득 유닛을 포함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치. 청구항 12 제8항에 있어서, 제 2 사전 트레이닝 언어 모델 및 제 2 시퀀스 레이블링 네트워크를 포함하는 상기 논항 추출 모델은, 상기 입력 텍스트의 문자 시퀀스를 획득하도록, 상기 입력 텍스트에 대한 단어 분할 수행하도록 구성되는 제 2 단어 분할 서브 모듈; 상기 트리거 단어 추출 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하도록 구성되는 제 7 결정 서브 모듈; 상기 문자 시퀀스에 따라 상기 문자 시퀀스에 대응하는 텍스트 특징 벡터들 시퀀스를 결정하도록 구성되는 제 8 결정 서브 모듈; 상기 텍스트 특징 벡터 시퀀스 및 상기 트리거 단어 특징 벡터 시퀀스를 합산하여 융합 특징 벡터 시퀀스를 획 득하도록 구성되는 융합 서브 모듈; 상기 문자 시퀀스의 제 2 의미 특징 벡터 시퀀스를 획득하도록, 상기 제 2 사전 트레이닝 언어 모델에 상기 융 합 특징 벡터 시퀀스를 입력하도록 구성되는 제 2 의미 특징 표현 서브 모듈; 상기 문자 시퀀스의 논항 레이블링 시퀀스를 획득하도록, 상기 제 2 시퀀스 레이블링 네트워크에 상기 제 2 의 미 특징 벡터 시퀀스를 입력하도록 구성되는 제 2 레이블링 서브 모듈; 상기 논항 레이블링 시퀀스에 따라 상기 입력 텍스트의 논항을 결정하도록 구성되는 제 9 결정 서브 모듈을 포 함하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치. 청구항 13 제12항에 있어서, 상기 제 2 시퀀스 레이블링 네트워크는 제 2 조건부 무작위장 층을 포함하고, 상기 제 2 레이블링 서브 모듈은, 상기 제 2 의미 특징 벡터 시퀀스에 따라 각각의 논항 레이블링 라벨 상에서의 상기 문자 시퀀스 내의 각각의 문자의 확률 값을 결정하도록 구성되는 제 3 결정 유닛; 상기 제 2 조건부 무작위장 층에 대응하는 제 2 라벨 전환 확률 매트릭스를 획득하도록 구성되는 제 3 획득 유 닛; 상기 제 2 라벨 전환 확률 매트릭스 및 각각의 논항 레이블링 라벨 상에서의 각각의 문자의 확률 값에 따라 상 기 문자 시퀀스의 복수의 후보 논항 레이블 시퀀스의 확률 값을 결정하도록 구성되는 제 4 결정 유닛; 상기 복수의 후보 논항 시퀀스로부터 최대 확률 값을 갖는 후보 논항 레이블링 시퀀스를 상기 문자 시퀀스의 논 항 레이블링 시퀀스로서 획득하도록 구성되는 제 4 획득 유닛을 포함하는 것을 특징으로 하는 텍스트 내의 이벤 트 추출 장치. 청구항 14 제12항에 있어서, 트리거 단어 추출 결과는 상기 입력 텍스트 내의 각각의 문자의 트리거 단어 인식 결과를 포함하고, 상기 제 7 결정 서브 모듈은, 상기 각각의 문자의 트리거 단어 인식 결과에 따라 상기 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 것을 특징으로 하는 텍스트 내의 이벤트 추출 장치. 청구항 15 전자 기기에 있어서 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 가능하게 연결되는 메모리를 포함하고, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어 있으며, 상기 명령이 상기 적 어도 하나의 프로세서에 의해 실행되어 상기 적어도 하나의 프로세서가 제1항 내지 제7항 중 어느 한 항에 따른 텍스트 내의 이벤트 추출 방법을 수행하도록 하는 것을 특징으로 하는 전자 기기. 청구항 16 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체에 있어서, 상기 컴퓨터 명령은 상기 컴퓨터로 하여금 제1항 내지 제7항 중 어느 한 항에 따른 텍스트 내의 이벤트 추출 방 법을 수행하도록 하는 것을 특징으로 하는 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체. 청구항 17 컴퓨터 판독 가능 저장 매체에 저장되어 있는 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램중의 명령이 실행될 경우, 제1항 내지 제7항 중 어느 한 항의 텍스트 내의 이벤트 추출 방 법이 실행되는, 것을 특징으로 하는 컴퓨터 판독 가능 저장 매체에 저장되어 있는 컴퓨터 프로그램. 발명의 설명 기 술 분 야 본 발명은 인공 지능 기술 분야에 관한 것으로, 구체적으로 지식 그래프, 딥 러닝 및 자연어 처리 기술 분야에 관한 것으로, 특히 텍스트 내의 이벤트 추출 방법, 장치, 전자 기기, 및 저장 매체에 관한 것이다."}
{"patent_id": "10-2020-0183500", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷의 보급 및 발달과 함께, 네트워크내의 정보 스케일은 폭발적으로 성장하고 있으며, 대량의 자연어 문서 로부터 필요한 정보를 정확하게 찾는 것은 점점 더 긴급하게 된다. 정보 추출 기술(Information Extraction, IE) 은 느슨하고 비구조적인 일반 텍스트로부터 특정 유형의 엔티티, 관계, 이벤트 등의 사실 정보를 추출하고, 구조화된 데이터를 출력한다. 여기서, 이벤트 추출(Event Extraction)은 정보 추출 연구에서 가장 어려운 작업 들 중 하나로, 이벤트의 유형, 이벤트의 참가자, 발생 시간 및 위치 등과 같은 이벤트의 기본 정보가 어떻게 비 구조적인 자연어 텍스트로부터 추출되고 구조화된 형태로 구현되는지를 주로 연구한다. 따라서, 텍스트로부터 이벤트 추출을 정확하고 신속하게 수행하는 것은 해결하려는 기술적 문제이다."}
{"patent_id": "10-2020-0183500", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 텍스트 내의 이벤트 추출 방법, 장치, 전자 기기, 및 저장 매체를 개시한다."}
{"patent_id": "10-2020-0183500", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 텍스트 내의 이벤트 추출 방법을 개시하고, 입력 텍스트를 획득하는 단계; 상기 입력 텍스트의 트리거 단어 추출 결과를 획득하도록, 상기 입력 텍스트를 트리거 단어 추출 모델에 입력하는 단 계; 상기 입력 텍스트의 논항(argument) 추출 결과를 획득하도록, 상기 입력 텍스트 및 상기 트리거 단어 추출 결과를 논항 추출 모델에 입력하는 단계; 상기 입력 텍스트의 이벤트 추출 결과를 상기 트리거 단어 추출 결과 및 상기 논항 추출 결과에 따라 결정하는 단계를 포함한다. 본 발명의 다른 측면에 따르면, 텍스트 내의 이벤트 추출 장치를 개시하고, 입력 텍스트를 획득하는 획득 모듈; 상기 입력 텍스트를 트리거 단어 추출 모듈에 입력하여 상기 입력 텍스트의 트리거 단어 추출 결과를 획득하는 트리거 단어 추출 모듈; 상기 입력 텍스트 및 상기 트리거 단어 추출 결과를 논항 추출 모듈에 입력하여 상기 입력 텍스트의 논항 추출 결과를 획득하는 논항 추출 모듈; 상기 트리거 단어 추출 결과 및 상기 논항 추출 결 과에 따라 상기 입력 텍스트의 이벤트 추출 결과를 결정하는 결정 모듈을 포함한다. 본 발명의 다른 측면에 따르면, 전자 기기를 개시하며, 적어도 하나의 프로세서; 및 적어도 하나의 프로세서에 통신 가능하게 연결되는 메모리를 포함하고, 상기 메모리는 상기 적어도 하나의 프로세서에 의해 실행될 수 있 는 명령을 저장하며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행되어 상기 적어도 하나의 프로세서 가 본 발명에 따른 텍스트 내의 이벤트 추출 방법을 수행하게 한다. 본 발명의 다른 측면에 따르면, 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체를 개시하며, 상기 컴퓨터 명령은 상기 컴퓨터로 하여금 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 방법을 수행하게 한다. 본 발명의 다른 측면에 따르면, 컴퓨터 판독 가능 매체에 저장되어 있는 컴퓨터 프로그램을 더 제공하는바, 상 기 컴퓨터 프로그램중의 명령이 실행될 경우, 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 방법이 실행된 다. 상기 발명의 일 실시예는 다음의 이점 또는 이익을 갖는다. 입력 텍스트에 대한 이벤트 추출을 수행할 때, 트리 거 단어 추출 모델을 통해 입력 텍스트에 대한 트리거 단어 추출을 수행하여 이 입력 텍스트의 트리거 단어 추 출 결과를 획득하고, 입력 텍스트 및 트리거 단어 추출 결과를 논항 추출 모델에 입력하여 입력 텍스트의 논항 추출 결과를 획득하고, 트리거 단어 추출 결과 및 논항 추출 결과를 결합하여 입력 텍스트의 이벤트 추출 결과 를 결정한다. 따라서, 트리거 단어 추출 모델 및 논항 추출 모델을 결합하여 입력 텍스트에 대한 이벤트 추출을 구현하고, 입력 텍스트 내의 이벤트 추출의 정확도를 향상시키고, 이벤트 추출의 구축 비용을 줄일 수 있고, 어 느 인공 특징 구축도 필요하지 않다. 여기서 설명된 내용은 본 발명의 실시예의 핵심적인 또는 중요한 특징을 나타내도록 의도되지 않으며, 본 발명 의 범위를 제한하도록 의도되지 않는다는 것이 이해되어야 한다. 본 발명의 다른 특징은 다음의 설명으로부터 용이하게 명백해질 것이다."}
{"patent_id": "10-2020-0183500", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 예시적인 실시예를 설명하고, 이해를 돕기 위해 본 발명의 실시예의 각종 세부사항을 포함하지만 단지 예시적인 것으로 간주하여야 한다. 따라서, 당업자는 본 발명의 범위 및 사상 으로부터 벗어나지 않고 본 명세서에 기술된 실시예들에 대한 다양한 변경 및 수정이 이루어질 수 있다는 것을 이해할 것이다. 또한, 잘 알려진 기능 및 구조에 대한 설명은 명확성과 간결성을 위해 다음의 설명에서 생략된 다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 방법, 장치, 전자 기기, 및 저장 매체를 설명한다. 도 1은 본 발명의 제 1 실시예에 따른 텍스트 내의 이벤트 추출 방법의 흐름도이다. 도 1에 도시된 바와 같이, 해당 텍스트 내의 이벤트 추출 방법은 다음과 같은 단계를 포함할 수 있다. 입력 텍스트를 획득하는 단계를 포함한다. 여기서, 본 실시예의 텍스트 내의 이벤트 추출 방법의 실행 주체는 텍스트 내의 이벤트 추출 장치이며, 이 텍스 트 내의 이벤트 추출 장치는 소프트웨어 및/또는 하드웨어로 구현될 수 있으며, 이 실시예에 따른 텍스트 내의 이벤트 추출 장치는 전자 기기에서 구성될 수 있다는 것이 이해되어야 하고, 본 실시예에 따른 전자 기기는 단 말 기기 및 서버를 포함할 수 있으며, 전자 기기는 이 실시예에 한정되지 않는다. 여기서, 본 실시예에 따른 입력 텍스트의 언어는 중국어 또는 영어일 수 있거나, 또는 다른 언어 유형일 수도 있고, 입력 텍스트의 언어 유형은 본 실시예에서 특별히 제한되지 않는다. 본 실시예는 입력 텍스트 중국어의 입력 텍스트를 예로 들어 설명된다. 여기서, 본 실시예에 따른 입력 텍스트는 이벤트 추출이 수행될 텍스트를 지칭하고, 이 입력 텍스트는 텍스트의 임의 영역의 텍스트일 수 있고, 예를 들어, 입력 텍스트는 “묵묵 회사가 항저우에서 과학 연구 센터를 설립했 다”라는 텍스트일 수 있거나, 또는 입력 텍스트는 “대형 캐니스 회사가 오늘날에 파산선고를 했다”라는 텍스 트일 수 있다. 이 실시예는 입력 텍스트를 구체적으로 제한하지 않는다. 입력 텍스트의 트리거 단어 추출 결과를 획득하도록, 입력 텍스트를 트리거 단어 추출 모델에 입력하는 단계 를 포함한다. 본 실시예에서, 트리거 단어 추출 모델에 입력 텍스트를 입력한 후, 트리거 단어 추출 모델은 이 입력 텍스트 내의 글자를 통해 맥락 특징(contextual feature) 및 의미 분석을 수행하고, 이 입력 텍스트의 분석 결과에 따 라 이 입력 텍스트로부터 트리거 단어 추출 결과를 추출한다. 여기서, 본 실시예에 따른 트리거 단어 추출 모델은 트레이닝 데이터에 기초하여 미리 획득된다는 것이 이해되 어야 한다. 하나의 가능한 구현방식으로서, 상기 트리거 단어 추출 모델을 트레이닝하는 과정은 트레이닝 데이 터를 획득하는 것이고, 트레이닝 데이터는 샘플 텍스트 및 샘플 텍스트의 트리거 단어 레이블링 결과를 포함하 고, 초기 트리거 단어 추출 모델은 트리거 단어 추출 모델을 획득하도록, 샘플 텍스트 및 샘플 텍스트의 트리거 단어 레이블링 결과에 따라 트레이닝된다. 여기서, 본 실시예에 따른 트리거 단어 추출 모델은 입력층, 네트워크 계층, 레이블링 층 및 출력층을 포함할 수 있다. 본 실시예에 따른 네트워크 계층 내의 네트워크는 심층 신경망일 수 있으며, 본 실시예에 따른 레이블 링 층은 조건부 무작위장(Conditional Random Field, CRF) 네트워크를 포함할 수 있다. 입력 텍스트의 논항(argument) 추출 결과를 획득하도록, 입력 텍스트 및 트리거 단어 추출 결과를 논항 추출 모 델에 입력하는 단계를 포함한다. 여기서, 본 실시예에 따른 논항 추출 모델은 미리 트레이닝된 것으로, 논항 추출 모델을 트레이닝하기 위한 하 나의 가능한 구현방식은 트레이닝 데이터를 획득하는 것이 이해되어야 하고, 트레이닝 데이터는 샘플 텍스트, 샘플 텍스트의 트리거 단어 레이블링 결과 및 샘플 텍스트의 논항 레이블링 결과를 포함하며, 샘플 텍스트, 샘 플 텍스트의 트리거 단어 레이블링 결과를 초기 논항 추출 모델의 입력으로서 사용되고, 샘플 텍스트의 논항 레 이블링 결과는 초기 논항 추출 모델의 출력으로서 사용되고, 초기 논항 추출 모델은 논항 추출 모델을 획득하도 록 트레이닝된다. 본 실시예에서, 논항 추출 모델은 입력 텍스트 및 트리거 단어 추출 결과를 획득한 후에, 논항 추출 모델 내부 의 하나의 가능한 처리 방식은 입력 텍스트에 대한 단어 분할을 수행할 수 있는 것으로, 이 입력 텍스트의 문자 시퀀스가 획득될 수 있고, 이 문자 시퀀스의 텍스트 특징 벡터 시퀀스가 결정될 수 있고, 이 문자 시퀀스의 트 리거 단어 특징 벡터 시퀀스가 트리거 단어 추출 결과에 따라 결정되고, 논항 추출 모델의 네트워크 계층은 특 징 벡터 시퀀스를 융합함에 따라 이 문자 시퀀스의 의미 표현 벡터 시퀀스를 결정하고, 그후, 논항 추출 모델의 레이블링 네트워크는 의미 표현 벡터 시퀀스에 따라 이 문자 시퀀스의 레이블링 결과를 결정하며, 문자 시퀀스 의 레이블링 결과에 따라 이 입력 텍스트의 트리거 단어 추출 결과를 결정한다. 입력 텍스트의 이벤트 추출 결과를 트리거 단어 추출 결과 및 논항 추출 결과에 따라 결정하는 단계를 포함하는 단계를 포함한다. 텍스트로부터 이벤트 추출이 수행될 때, 이벤트 추출이 인공 구조 특징(예를 들어, 인공 구조 규칙 및 템플릿) 에 기초하여 수행되는 관련 기술의 방식과 비교하여, 본 실시예는 트리거 단어 추출 모델 및 논항 추출 모델을 통해 입력 텍스트에 대한 이벤트 추출이 수행되어 이벤트 추출의 성능이 효과적으로 개선될 뿐만 아니라, 이벤 트 추출의 구축 비용을 줄일 수 있고, 어느 인공 특징 구축도 필요하지 않다. 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 방법은, 입력 텍스트에 대한 이벤트 추출을 수행할 때, 트리 거 단어 추출 모델을 통해 입력 텍스트에 대한 트리거 단어 추출을 수행하여 이 입력 텍스트의 트리거 단어 추 출 결과를 획득하고, 입력 텍스트 및 트리거 단어 추출 결과를 논항 추출 모델에 입력하여 입력 텍스트의 논항 추출 결과를 획득하고, 트리거 단어 추출 결과 및 논항 추출 결과를 결합하여 입력 텍스트의 이벤트 추출 결과 를 결정한다. 따라서, 트리거 단어 추출 모델 및 논항 추출 모델을 결합하여 입력 텍스트에 대한 이벤트 추출을 구현하고, 입력 텍스트 내의 이벤트 추출의 정확도를 향상시키고, 이벤트 추출의 구축 비용을 줄일 수 있고, 어 느 인공 특징 구축도 필요하지 않다. 본 실시예에 따른 이벤트 추출 방법은 응용 시나리오들이 많고, 예를 들어, 이벤트 추출 결과를 획득된 후에, 이벤트가 구조화된 형태로 제시되고 표현될 수 있고, 이벤트들은 검색 및 피드 스트림 이벤트 컨텍스트에서 이 벤트가 표현되고, 사용자가 이벤트를 편리하게 이해할 수 있다는 것이 이해될 것이다. 또 다른 예로서, 본 실시 예에 따른 이벤트 추출은 금융 영역 시나리오에 적용될 수 있고, 회사의 이벤트를 추출함으로써 효과적으로 리 스크 통제를 수행할 수 있으며, 본 실시예의 응용 시나리오는 전술한 2 개의 응용 시나리오에 한정되지 않으며, 이 실시예에서 이벤트 추출의 응용 시나리오를 한정하지 않는다. 본 발명의 일 실시예에서, 입력 텍스트 내의 이벤트 추출 결과를 정확하게 결정하기 위해, 도 2 에 도시된 바와 같이, 본 실시예에 따른 입력 텍스트의 이벤트 추출 결과를 트리거 단어 추출 결과 및 논항 추출 결과에 따라 결정하는 단계는 다음과 같은 단계를 포함한다. 입력 텍스트 내의 트리거 단어를 트리거 단어 추출 결과에 따라 결정하는 단계를 포함한다. 이 실시예에 따른 트리거 단어 추출 결과는 각 문자에 대한 트리거 단어 인식 결과를 포함할 수 있다. 이에 대 응하여, 입력 텍스트 내의 트리거 단어를 각 문자의 트리거 단어 인식 결과에 따라 결정될 수 있다. 예를 들어, 입력 텍스트는 “장삼삼이 양의의에게 청혼한다”이며, 장삼삼 및 양의의가 모두 공인이라고 가정하 면, 트리거 단어 추출 결과에 따라 입력 텍스트 내의 트리거 단어인 “청”은 트리거 단어의 시작인 것으로 식 별되고, “혼”은 트리거 단어의 중간 단어로 식별된다. 트리거 단어 추출 결과에 따라 “청혼”은 입력 텍스트 내의 트리거 단어로 결정될 수 있다. 트리거 단어에 따라 트리거 단어를 속한 이벤트 유형 결정하는 단계를 포함한다. 구체적으로, 트리거 단어를 속한 이벤트 유형은 미리 저장된 각각의 샘플 트리거 단어 및 이벤트 유형 사이의 대응관계에 따라 결정될 수 있다. 본 실시예에 따른 입력 텍스트 내의 트리거 단어는 하나 또는 여러 개를 포함할 수 있다는 것이 이해될 것이다. 일부 실시예에서, 본 실시예에 따른 복수의 트리거 단어는 동일한 이벤트 유형에 대응할 수 있거나, 또는 각각 의 트리거 단어는 각각의 이벤트 유형에 대응할 수 있고, 이 실시예에서 이를 한정하지 않고, 예를 들어, 입력 텍스트에 존재하는 2 개의 트리거 단어를 “자동차 사고” 및 “추돌사고”이면, 이 2 개의 트리거 단어에 대응 하는 이벤트 유형은 트리거 단어 및 이벤트 유형 사이의 대응하는 관계에 따라 모두“교통사고”인 것으로 결정된다. 예를 들어, 입력 텍스트는 2 개의 트리거 단어를 포함하고, 트리거 단어 1 은 “폭로”이고, 트리거 단어 2는 “이혼”이면, 트리거 단어 1에 대응하는 이벤트 유형은 폭로 이벤트로 결정되고, 트리거 단어 2에 대응하 는 이벤트 유형은 이혼 이벤트로 결정된다. 또 다른 예로서, 입력 텍스트는 “장삼삼이 양의의에게 청혼한다”이며, 장삼삼 및 양의의가 모두 공인이라고 가정하면, 트리거 단어 추출 결과에 따라 “청혼”은 이 입력 텍스트 내의 트리거 단어로 결정되고, “청혼”이 란 트리거 단어에 따라 이 “청혼”이란 트리거 단어를 속하는 이벤트의 유형은 “청혼 이벤트”로 결정된다. 논항 추출 결과에 따라 입력 텍스트 내의 논항을 결정하는 단계를 포함한다. 예를 들어, 입력 텍스트는 “장삼삼이 양의의에게 청혼한다”이며, 장삼삼 및 양의의가 모두 공인이라고 가정 하면, 논항 추출 결과는 각 문자에 대한 논항 인식 결과를 포함할 수 있고, 논항 인식 결과, 이 문자는 논항이 거나 아니면 이 문자는 논항이 아니며, 논항 추출 결과에 따라 입력 텍스트 내의 논항이 “장삼삼” 및 “양의 의”인 것으로 결정될 수 있다. 이벤트 유형에 따라, 논항이 이벤트 유형에 속한 논항 역할을 결정하는 단계를 포함한다. 상기 예로서, 이 입력 텍스트의 이벤트 유형은“청혼 이벤트”이고, “청혼 이벤트”에서는, “장삼삼”이란 논 항이 속한 논항 역할은 청혼자이고, “양의의”란 논항이 속한 논항 역할은 청혼 상대자인 것으로 결정된다. 입력 텍스트의 이벤트 추출 결과를 트리거 단어, 이벤트 유형, 논항 및 논항 역할에 따라 결정하는 단계를 포함한다. 본 실시예에서, 트리거 단어, 이벤트 유형, 논항 및 논항 역할을 획득한 후, 리거 단어, 이벤트 유형, 논항 및 논항 역할에 따라 완전한 이벤트 구조를 획득하여 입력 텍스트의 이벤트 추출 결과를 정확하게 결정할 수 있고, 이 입력 텍스트의 이벤트 추출 결과를 정확하게 출력할 수 있다. 본 발명의 일 실시예에서, 입력 텍스트로부터 트리거 단어를 정확하게 추출하기 위해, 본 실시예에 따른 트리거 단어 추출 모델은 도 3 에 도시된 바와 같이, 제 1 사전 트레이닝 언어 모델 및 제 1 시퀀스 레이블링 네트워 크를 포함할 수 있고, 본 실시예의 단계는 단음과 같은 단계를 포함할 수 있다. 입력 텍스트의 문자 시퀀스를 획득하도록 입력 텍스트에 대한 단어 분할을 수행하는 단계를 포함한다. 문자 시퀀스의 제 1 의미 특징 벡터 시퀀스를 획득하도록, 문자 시퀀스를 제 1 사전 트레이닝 언어 모델에 입력 하는 단계를 포함한다. 구체적으로, 문자 시퀀스의 제 1 의미 특징 벡터 시퀀스를 획득하도록, 문자 시퀀스의 텍스트 특징 벡터 시퀀스 가 제 1 사전 트레이닝 언어 모델에 입력될 수 있다. 여기서, 본 실시예에 따른 텍스트 특징 벡터는 문자 시퀀스의 문자 특징 벡터, 위치 특징 벡터, 및 맥락 특징 벡터를 포함할 수 있다. 구체적으로, 문자 시퀀스의 융합 특징 벡터 시퀀스를 획득하도록, 문자 시퀀스의 문자 특징 벡터 시퀀스, 위치 특징 벡터 시퀀스, 및 맥락 특징 벡터 시퀀스를 합산할 수 있으며, 문자 시퀀스의 제 1 의미 특징 벡터 시퀀스 를 획득하도록, 융합 특징 벡터 시퀀스를 제 1 사전 트레이닝 언어 모델에 입력한다. 여기서, 본 실시예에 따른 제 1 사전 트레이닝 언어 모델 및 후술 실시예에 따른 제 2 사전 트레이닝 언어 모델 은 모두 변압기에 기초한 양방향 인코딩 표현 모델(BERT, Bidirectional Encoder Representations from Transformers), 지식 증강 의미 표현 모델(ERNIE, Enhanced Representation from kNowledge IntEgration) 등이 며, 본 실시예에서 이를 한정하지 않다. 문자 시퀀스의 트리거 단어 레이블링 시퀀스를 획득하도록, 제 1 의미 특징 벡터 시퀀스를 제 1 시퀀스 레이블 링 네트워크에 입력하는 단계를 포함한다. 입력 텍스트의 트리거 단어 추출 결과를 트리거 단어 레이블링 시퀀스에 따라 결정하는 단계를 포함한다. 본 실시예에 따른 레이블링 모드는 임의의 유형의 레이블링 모드일 수 있으며, 예를 들어, 레이블링 모드는 BIO 모드이다. BIO 모드에서 텍스트 내의 각가의 문자에 대한 레이블링을 수행한다. B-type은 현재의 문자가 트리거 단어의 첫 번째 문자이고, 트리거 단어에 의해 트리거되는 이벤트 유형이 type인 것을 나타내며; I-type은 현재 의 문자가 트리거 단어 중에 위치하고, 트리거 단어에 의해 트리거되는 이벤트 유형이 type인 것을 나타내며; O 은 현재의 문자가 어느의 트리거 단어에도 없다는 것을 나타낸다. 예를 들어, “장삼삼이 양의의에게 청혼한다”란 입력 텍스트는, 이에 대응하는 트리거 단어 레이블링 시퀀스는 장/0, 삼/0, 삼/0, 양/0, 의/0, 의/0 에/0, 게/0 청/B, 혼/I, 한/0, 다/0이고, 이 트리거 단어 레이블링 시퀀스에 따라 입력 텍스트 내의 “청혼”은 입력 텍스트 내의 트리거 단어인 것으로 결정될 수 있다. 본 실시예에서, 문자 시퀀스를 제 1 사전 트레이닝 언어 모델에 입력하여 문자 시퀀스의 의미 표현 벡터 시퀀스 를 획득하고, 시퀀스 레이블링 네트워크를 결합하여 의미 표현 벡터 시퀀스에 대한 레이블링을 정확하게 수행하 여, 문자 시퀀스의 트리거 단어 레이블링 시퀀스를 획득하고, 트리거 단어 레이블링 시퀀스를 결합하여 입력 텍 스트의 트리거 단어 추출 결과를 정확하게 결정한다. 본 발명의 일 실시예에서, 추출된 트리거 단어의 정확도를 더 향상시키기 위해, 본 실시예에 따른 제 1 시퀀스 레이블링 네트워크는 제 1 조건부 무작위장 층을 포함할 수 있고, 도 4에 도시된 바와 같이, 상기 단계는 다음과 같은 단계를 포함할 수 있다. 제 1 의미 특징 벡터 시퀀스에 따라, 각 트리거 단어의 레이블링 라벨 상에서의 문자 시퀀스 내의 각 문자의 확 률값을 결정하는 단계를 포함한다. 제 1 조건부 무작위장 층에 대응하는 제 1 라벨 전환 확률 매트릭스를 획득하는 단계를 포함한다. 여기서, 제 1 라벨 전환 확률 매트릭스는 트리거 단어 레이블링 라벨이 다른 트리거 단어 레이블링 라벨로 전환 될 확률을 포함한다. 제 1 라벨 전환 확률 매트릭스 및 각각의 트리거 단어 레이블링 라벨 상에서의 각각의 문자의 확률 값에 따라 문자 시퀀스의 복수의 후보 트리거 단어 추출 결과의 확률 값을 결정하는 단계를 포함한다. 복수의 후보 트리거 단어 시퀀스로부터 최대 확률 값을 갖는 후보 트리거 단어 레이블링 시퀀스를 문자 시퀀스 의 트리거 단어 레이블링 시퀀스로서 획득하는 단계를 포함한다. 본 발명의 일 실시예에서, 입력 텍스트로부터 논항을 추출하는 정확도를 향상시키기 위해, 본 실시예에 따른 논 항 추출 모델은 제 2 사전 트레이닝 언어 모델 및 제 2 시퀀스 레이블링 네트워크를 포함할 수 있고, 구체적으 로, 제 2 사전 트레이닝 언어 모델에 의해 출력된 의미 표현 벡터 시퀀스를 결합하고, 라벨의 레이블링 결과에 따라 입력 텍스트의 논항을 정확하게 결정하기 위해 제 2 시퀀스 레이블링 네트워크를 통해 의미 표현 벡터 시 퀀스에 대한 라벨 라벨링을 수행한다. 이하, 도 5를 참조하여 전술한 단계의 하나의 가능한 구현방식을 설 명한다. 도 5에 도시된 바와 같이, 상기 단계는 다음과 같은 단계를 포함할 수 있다. 입력 텍스트의 문자 시퀀스를 획득하도록, 입력 텍스트에 대한 단어 분할을 수행하는 단계를 포함한다. 트리거 단어 추출 결과에 따라 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 단계를 포함한다. 본 실시예에 따른 트리거 단어 추출 결과는 입력 텍스트 내의 각 문자의 트리거 단어 인식 결과를 포함하고, 트 리거 단어 추출 결과에 따라, 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 하나의 가능한 구현 방 식은 각 문자의 트리거 단어 인식 결과에 따라 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하는 것일 수 있다. 따라서, 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스가 정확하게 얻어진다. 구체적으로, 문자 시퀀스 내의 각각의 문자에 대해, 각각의 문자에 대응하는 트리거 문자 특징 벡터는 각각의 문자의 트리거 단어 인식 결과에 따라 결정될 수 있고, 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스는 각각의 문자에 대응하는 트리거 단어 특징 벡터에 따라 형성된다. 문자 시퀀스에 대응하는 텍스트 특징 벡터 시퀀스를 문자 시퀀스에 따라 결정하는 단계를 포함한다. 텍스트 특징 벡터 시퀀스 및 트리거 단어 특징 벡터 시퀀스를 합산하여 융합 특징 벡터 시퀀스를 획득하는 단계 를 포함한다. 여기서, 본 실시예에 따른 텍스트 특징 벡터는 문자 시퀀스의 문자 특징 벡터, 위치 특징 벡터, 및 맥락 특징 벡터를 포함할 수 있다. 구체적으로, 문자 시퀀스의 융합 특징 벡터 시퀀스를 획득하도록, 문자 시퀀스의 문자 특징 벡터 시퀀스, 위치 특징 벡터 시퀀스, 맥락 특징 벡터 시퀀스, 및 트리거 단어 특징 벡터 시퀀스를 합산할 수 있다. 융합 특징 벡터 시퀀스를 제 2 사전 트레이닝 언어 모델에 입력하여 문자 시퀀스의 제 2 의미 특징 벡터 시퀀스 를 획득하는 단계를 포함한다. 예를 들어, 문자 시퀀스의 융합 특징 벡터 시퀀스를 제 2 ERNIE 모델에 입력하여 이 문자 시퀀스의 제 2 의미 특징 벡터 시퀀스를 획득한다. 제 2 의미 특징 벡터 시퀀스를 제 2 시퀀스 레이블링 네트워크에 입력하여 문자 시퀀스의 논항 레이블링 시퀀스 를 획득하는 단계를 포함한다. 논항 레이블링 시퀀스에 따라 입력 텍스트의 논항을 결정하는 단계를 포함한다. 예를 들어, “장삼삼이 양의의에게 청혼한다”란 입력 텍스트는, 트리거 단어를 “청혼”인 경우, 이에 대응하 는 논항 레이블링 시퀀스는 장/B, 삼/I, 삼/ I, 양/B, 의/I, 의/I 에/0, 게/0 청/0, 혼/0, 한/0, 다/0이고, 여 기서, B는 현재의 문자가 논항의 첫 번째 문자이며, I는 현재의 문자가 논항 중에 위치하며; O은 현재의 문자가 어느의 논항에도 없다는 것을 나타내고, 이 논항 레이블링 시퀀스에 따라 입력 텍스트 내의 “장삼삼”및 “양 의의”는 입력 텍스트 내의 논항인 것으로 결정될 수 있다. 본 실시예에서, 문자 시퀀스의 의미 표현 벡터 시퀀스를 획득하도록, 문자 시퀀스 및 트리거 단어 추출 결과를 제 2 사전 트레이닝 언어 모델에 입력되고, 제 2 시퀀스 레이블링 네트워크를 결합하여 의미 표현 벡터 시퀀스 에 대한 논항을 정확하게 레이블링하여 문자 시퀀스의 논항 레이블링 시퀀스를 획득하며, 논항 레이블링 결과를 결합하여 입력 텍스트에 대한 논항을 정확하게 결정한다. 본 발명의 일 실시예에서, 추출된 논항의 정확도를 더 향상시키기 위해, 본 실시예에 따른 제 2 시퀀스 레이블 링 네트워크는 제 2 조건부 무작위장 층을 포함할 수 있고, 도 6에 도시된 바와 같이, 본 실시예의 상기 단계 는 다음과 같은 단계를 포함할 수 있다. 제 2 의미 특징 벡터 시퀀스에 따라, 각 논항의 레이블링 라벨 상에서의 문자 시퀀스 내의 각 문자의 확률 값을 결정하는 단계를 포함한다. 제 2 조건부 무작위장 층에 대응하는 제 2 라벨 전환 확률 매트릭스를 획득하는 단계를 포함한다. 여기서, 제 2 라벨 전환 확률 매트릭스는 하나의 논항 레이블링 라벨이 다른 논항 레이블링 라벨로 전환될 확률 을 포함한다. 예를 들어, 논항 레이블링 라벨이 BIO 모드인 경우, 제 2 논항 전환 확률 매트릭스는 B 레이블링 라벨, I 레이블링 라벨 및 O 레이블링 라벨의 3자 사이의 전환 확률을 포함한다. 제 2 라벨 전환 확률 매트릭스 및 각각의 논항 레이블링 라벨 상에서의 각각의 문자의 확률 값에 따라 문자 시 퀀스의 복수의 후보 논항 레이블링 시퀀스의 확률 값을 결정하는 단계를 포함한다. 복수의 후보 논항 시퀀스로부터 최대 확률 값을 갖는 후보 논항 레이블링 시퀀스를 문자 시퀀스의 논항 레이블 링 시퀀스로서 획득하는 단계를 포함한다. 당업자가 본 발명을 뚜렷하게 이해하도록 하기 위해, 도 7을 참조하여 본 실시예에 따른 텍스트 내의 이벤트 추 출 방법은 아래에서 설명된다. 여기서, 도 7에 따른 제 1 사전 트레이닝 언어 모델 및 제 2 사전 트레이닝 언어 모델이 모두 ERNIE인 것을 예 로 설명되고, 입력 텍스트는 “이영호 양승림에게 청혼한다”인 것을 예로 설명된다. 입력 텍스트를 시퀀스 레이블링에 기초한 트리거 단어 추출 모델에 입력하는데 있어서, 이에 대응하여, 시퀀스 레이블링에 기초한 트리거 단어 추출 모델의 예시적인 구현 과정은 다음과 같다. 첫째, 트리거 단어 추출 모델의 입력층은 입력 텍스트의 어휘 특징 벡터(Token Embeding), 맥락 여부 특징 벡터 (Segment Embedding) 및 위치 특징 벡터(Position Embedding)를 구축하며, 어휘 특징 벡터, 맥락 여부 특징 벡 터 및 위치 특징 벡터를 합산하여 융합 특징 벡터를 획득한다. 둘째, 융합 특징 벡터를 제 1 ERNIE 모델에 입력하여 사전 트레이닝 출력층 벡터를 획득하도록 계산한다. 셋째, 제 1 ERNIE 모델을 제 1 CRF 네트워크에 입력하여 트리거 단어 레이블링 시퀀스를 획득한다. 여기서, 도 7에 A로 표시된 부분은 “이영호 양승림에게 청혼한다”란 입력 텍스트에 대응하는 트리거 단어 레 이블링 결과이다. 마지막으로, 트리거 단어 레이블링 시퀀스에 따라, 입력 텍스트 내의 트리거 단어를 “청혼”인 것으로 결정될 수 있다. 시퀀스 레이블링에 기초한 논항 추출 모델은 다음과 같다. 첫째, 문장 입력 모델의 구축 특징은 어휘 특징(Token Embeding), 맥락 여부 특징(Segment Embedding), 위치 특징(Position Embedding) 및 트리거 단어 특징을 포함하고, 시퀀스 레이블링에 기초한 트리거 단어 추출 모델 에서 예측되고 획득된 트리거 단어를 특징으로 가입되고, 가입방식은 해당 위치의 어휘가 트리거 단어로 식별되 면 1로 설정되고, 그렇지 않다면, 0으로 설정되고, 그 다음 벡터embedding 형태로 전환된다. 둘째, 상기 4 가지 유형의 특징 벡터에 한 합산을 수행하여 융합 특징 벡터를 획득하고, 융합 특징 벡터를 제 2 ERNIE 모델에 입력하고, 사전 트레이닝 출력층 벡터를 획득하도록 계산한다. 셋째, 제 2 ERNIE 모델을 제 2 CRF 네트워크에 입력하여 논항 레이블링 결과를 획득한다. 마지막으로, 논항 레이블링 결과에 따라 입력 텍스트 내의 논항을 결정한다. 여기서, 도 7에 도시된 바와 같이, 본 실시예에 따른 트리거 단어 추출 모델 및 논항 추출 모델에 사용된 레이 블링 모드는 모두 BIO 포맷의 레이블링 모드이다. 본 실시예에서, 도 7에 B로 표시된 부분은 “이영호 양승림에게 청혼한다”란 입력 텍스트에 대응하는 논항 레 이블링 결과이고, 논항 레이블링 결과에 따라 “이영호 양승림에게 청혼한다”란 입력 텍스트의 논항는 “이영 호”및 “양승림”인 것으로 결정된다. 시퀀스 레이블링에 기초한 트리거 단어 추출 모델 및 시퀀스 레이블링에 기초한 논항 추출 모델의 결과는 이벤 트 구조 스키마(schema)에 따라 상관되고, 입력 텍스트의 이벤트 추출 결과를 생성된다. 구체적으로, 트리거 워드에 기초하여, 트리거 워드가 속하는 이벤트 유형이 “청혼 이벤트”인 것으로 결정되고. 이에 대응하여, 청혼 이벤트에서 “이영호”란 논항이 속한 논항 역할은 청혼자이고, 이에 대응하여, “양승림”이란 논항이 속한 논항 역할은 “피청혼자”“청혼 상대자”인 것으로 결정된다. 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 방법은, 입력 텍스트 내의 트리거 단어 추출 결과를 획득하 도록, 레이블링 시퀀스의 트리거 단어 추출 모델을 통해 입력 텍스트의 트리거 단어를 추출하고, 이 입력 텍스 트 내의 논항 추출 결과를 획득하도록, 입력 텍스트 및 트리거 단어 추출 결과를 레이블링 시퀀스에 기초한 논 항 추출 모델에 입력하며, 이에 대응하여, 이벤트 구조에 따라 논항 추출 결과 및 트리거 단어 추출 결과에 기 초하여 결과가 상관되어 이 입력 텍스트의 이벤트 추출 결과를 생성된다. 따라서, 이벤트 추출은 딥 러닝의 이 벤트 추출 모드에 기초하여 완전히 달성되고, 입력 텍스트 내의 이벤트 추출의 정확도를 향상시키고, 이벤트 추 출의 구축 비용을 줄일 수 있고, 어느 인공 특징 구축도 필요하지 않다. 상기 실시예를 구현하기 위해 본 발명의 실시예는 텍스트 내의 이벤트 추출 장치를 더 개시한다. 도 8은 본 발명의 제 8 실시예에 따른 텍스트 내의 이벤트 추출 장치의 구조도이다. 도 8에 도시된 바와 같이, 이 텍스트 내의 이벤트 추출 장치는 획득 모듈, 트리거 단어 추출 모듈 , 논항 추출 모듈 및 결정 모듈을 포함한다. 여기서, 획득 모듈은 입력 텍스트를 획득한다. 트리거 단어 추출 모듈은 입력 텍스트를 트리거 단어 추출 모듈에 입력하여 입력 텍스트의 트리거 단어 추 출 결과를 획득한다. 논항 추출 모듈은 입력 텍스트 및 트리거 단어 추출 결과를 논항 추출 모듈에 입력하여 입력 텍스트의 논 항 추출 결과를 획득한다. 결정 모듈은 트리거 단어 추출 결과 및 논항 추출 결과에 따라 입력 텍스트의 이벤트 추출 결과를 결정한 다. 텍스트 내의 이벤트 추출 방법의 일 실시예에 대한 전술한 설명은 또한 본 실시예에 따른 텍스트 내의 이벤트 추출 장치에 적용이 가능하며, 여기서 설명을 생략한다. 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 장치는, 입력 텍스트에 대한 이벤트 추출을 수행할 때, 트리 거 단어 추출 모델을 통해 입력 텍스트에 대한 트리거 단어 추출을 수행하여 이 입력 텍스트의 트리거 단어 추 출 결과를 획득하고, 입력 텍스트 및 트리거 단어 추출 결과를 논항 추출 모델에 입력하여 입력 텍스트의 논항 추출 결과를 획득하고, 트리거 단어 추출 결과 및 논항 추출 결과를 결합하여 입력 텍스트의 이벤트 추출 결과를 결정한다. 따라서, 트리거 단어 추출 모델 및 논항 추출 모델을 결합하여 입력 텍스트에 대한 이벤트 추출을 구현하고, 입력 텍스트 내의 이벤트 추출의 정확도를 향상시키고, 이벤트 추출의 구축 비용을 줄일 수 있고, 어 느 인공 특징 구축도 필요하지 않다. 본 발명의 일 실시예에서, 도 8에 도시된 장치 실시예에 기초하여, 도 9에 도시된 바와 같이, 이 결정 모듈 은, 트리거 단어 추출 결과에 따라 입력 텍스트 내의 트리거 단어를 결정하도록 구성되는 제 1 결정 서브 모듈(14 1)을 포함한다. 트리거 단어에 따라 트리거 워드가 속하는 이벤트 유형을 결정하도록 구성되는 제 2 결정 서브 모듈을 포 함한다. 논항 추출 결과에 따라 입력 텍스트의 논항을 결정하도록 구성되는 제 3 결정 서브 모듈을 포함한다. 이벤트 유형에 따라, 논항이 이벤트 타입에 속하는 논항 역할을 결정하도록 구성되는 제 4 결정 서브 모듈(14 4)을 포함한다. 트리거 단어, 이벤트 유형, 논항, 및 논항 역할에 따라 입력 텍스트의 이벤트 추출 결과를 결정하도록 구성되는 제 5 결정 서브 모듈을 포함한다. 본 발명의 일 실시예에서, 트리거 단어 추출 모델은 제 1 사전 트레이닝 언어 모델 및 제 1 시퀀스 레이블링 네 트워크를 포함하고, 트리거 단어 추출 모듈은, 입력 텍스트의 문자 시퀀스를 획득하도록, 입력 텍스트에 대한 단어 분할 수행하도록 구성되는 제 1 단어 분할 서브 모듈을 포함한다. 문자 시퀀스의 제 1 의미 특징 벡터 시퀀스를 획득하도록, 제 1 사전 트레이닝 언어 모델에 문자 시퀀스를 입력 하도록 구성되는 제 1 의미 특징 표현 서브 모듈을 포함한다. 문자 시퀀스의 트리거 단어의 시퀀스를 획득하도록, 제 1 시퀀스 레이블링 네트워크에 제 1 의미 특징 벡터 시 퀀스를 입력하도록 구성되는 제 1 레이블링 서브 모듈을 포함한다. 트리거 단어 레이블링 시퀀스에 따라 입력 텍스트의 트리거 단어 추출 결과를 결정하도록 구성되는 제 6 결정 서브 모듈을 포함한다. 본 발명의 일 실시예에서, 제 1 시퀀스 레이블링 네트워크는 제 1 조건부 무작위장 층을 포함하고, 제 1 레이블 링 서브 모듈은, 제 1 의미 특징 벡터 시퀀스에 따라 각각의 트리거 단어의 레이블링 라벨 상에서의 문자 시퀀스 내의 각 문자의 확률 값을 결정하도록 구성되는 제 1 결정 유닛을 포함한다. 제 1 조건부 무작위장 층에 대응하는 제 1 라벨 전환 확률 매트릭스를 획득하도록 구성되는 제 1 획득 유닛 을 포함한다. 제 1 라벨 전환 확률 매트릭스 및 각각의 트리거 단어의 레이블링 라벨 상에서의 각 문자의 확률 값에 따라 문 자 시퀀스의 복수의 후보 트리거 단어 추출 결과의 확률 값을 결정하도록 구성되는 제 2 결정 유닛을 포 함한다. 복수의 후보 트리거 단어 시퀀스로부터 최대 확률 값을 갖는 후보 트리거 단어 레이블링 시퀀스를 문자 시퀀스 의 트리거 단어 레이블링 시퀀스로서 획득하도록 구성되는 제 2 획득 유닛을 포함한다. 본 발명의 일 실시예에서, 논항 추출 모듈은 제 2 사전 트레이닝 언어 모델 및 제 2 시퀀스 레이블링 네트워크 를 포함하고, 논항 추출 모듈은 입력 텍스트의 문자 시퀀스를 획득하도록, 입력 텍스트에 대한 단어 분할 수행하도록 구성되는 제 2 단어 분할 서브 모듈을 포함한다. 트리거 단어 추출 결과에 따라 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 결정하도록 구성되는 제 7 결정 서브 모듈을 포함한다. 문자 시퀀스에 따라 문자 시퀀스에 대응하는 텍스트 특징 벡터들 시퀀스를 결정하도록 구성되는 제 8 결정 서브 모듈을 포함한다. 텍스트 특징 벡터 시퀀스 및 트리거 단어 특징 벡터 시퀀스를 합산하여 융합 특징 벡터 시퀀스를 획득하도록 구 성되는 융합 서브 모듈을 포함한다. 문자 시퀀스의 제 2 의미 특징 벡터 시퀀스를 획득하도록, 제 2 사전 트레이닝 언어 모델에 융합 특징 벡터 시 퀀스를 입력하도록 구성되는 제 2 의미 특징 표현 서브 모듈을 포함한다. 문자 시퀀스의 논항 레이블링 시퀀스를 획득하도록, 제 2 시퀀스 레이블링 네트워크에 제 2 의미 특징 벡터 시 퀀스를 입력하도록 구성되는 제 2 레이블링 서브 모듈을 포함한다. 논항 레이블링 시퀀스에 따라 입력 텍스트의 논항을 결정하도록 구성되는 제 9 결정 서브 모듈을 포함한다. 본 발명의 일 실시예에서, 트리거 단어 추출 결과는 입력 텍스트 내의 각각의 문자의 트리거 단어 인식 결과를 포함하고, 제 7 결정 서브 모듈 은 각각의 문자의 트리거 단어 인식 결과에 따라 문자 시퀀스의 트리거 단 어 특징 벡터 시퀀스를 결정하도록 구체적으로 구성된다. 구체적으로, 문자 시퀀스 내의 각각의 문자에 대해, 제 7 결정 서브 모듈은 각각의 문자의 트리거 단어 인 식 결과에 따라 각각의 문자에 대응하는 트리거 단어 특징 벡터를 결정할 수 있고, 각각의 문자에 대응하는 트 리거 단어 특징 벡터에 따라 문자 시퀀스의 트리거 단어 특징 벡터 시퀀스를 형성할 수 있다. 본 발명의 일 실시예에서, 제 2 시퀀스 레이블링 네트워크는 제 2 조건부 무작위장 층을 포함하고, 제 2 레이블 링 서브 모듈은, 제 2 의미 특징 벡터 시퀀스에 따라 각각의 논항 레이블링 라벨 상에서의 문자 시퀀스 내의 각각의 문자의 확률 값을 결정하도록 구성되는 제 3 결정 유닛을 포함한다. 제 2 조건부 무작위장 층에 대응하는 제 2 라벨 전환 확률 매트릭스를 획득하도록 구성되는 제 3 획득 유닛 을 포함한다. 제 2 라벨 전환 확률 매트릭스 및 각각의 논항 레이블링 라벨 상에서의 각각의 문자의 확률 값에 따라 문자 시 퀀스의 복수의 후보 논항 레이블 시퀀스의 확률 값을 결정하도록 구성되는 제 4 결정 유닛을 포함한다. 복수의 후보 논항 시퀀스로부터 최대 확률 값을 갖는 후보 논항 레이블링 시퀀스를 문자 시퀀스의 논항 레이블 링 시퀀스로서 획득하도록 구성되는 제 4 획득 유닛을 포함한다. 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 장치는, 입력 텍스트에 대한 이벤트 추출을 수행할 때, 트리 거 단어 추출 모델을 통해 입력 텍스트에 대한 트리거 단어 추출을 수행하여 이 입력 텍스트의 트리거 단어 추 출 결과를 획득하고, 입력 텍스트 및 트리거 단어 추출 결과를 논항 추출 모델에 입력하여 입력 텍스트의 논항 추출 결과를 획득하고, 트리거 단어 추출 결과 및 논항 추출 결과를 결합하여 입력 텍스트의 이벤트 추출 결과 를 결정한다. 따라서, 트리거 단어 추출 모델 및 논항 추출 모델을 결합하여 입력 텍스트에 대한 이벤트 추출을 구현하고, 입력 텍스트 내의 이벤트 추출의 정확도를 향상시키고, 이벤트 추출의 구축 비용을 줄일 수 있고, 어 느 인공 특징 구축도 필요하지 않다. 본 발명의 실시예에 따르면, 본 발명은 전자 기기 및 저장 매체 더 개시한다. 본 발명의 실시예에 따르면, 컴퓨 터 판독 가능 매체에 저장되어 있는 컴퓨터 프로그램을 더 제공한다. 당해 컴퓨터 프로그램중의 명령이 실행될 경우, 상기 텍스트 내의 이벤트 추출 방법이 실행된다. 도 10은 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 방법을 구현하기 위한 전자 기기의 블록도이다. 전 자 기기는 랩탑 컴퓨터, 데스크탑 컴퓨터, 워크스테이션, 개인용 정보 단말기, 서버, 블레이드 서버, 메인프레 임 컴퓨터, 및 다른 적절한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 나타내는 것이다. 전자 기기는 또한 개인 디지털 프로세싱, 셀룰러 전화기, 스마트 폰, 웨어러블 장치, 및 다른 유사한 컴퓨팅 장치와 같은 다양한 형태의 모바일 장치를 나타낼 수도 있다. 본 명세서에 나타낸 부품, 그들의 연결 및 관계, 및 그들의 기능은 단 지 예시적인 것이며, 본 명세서에 설명 및/또는 청구된 본 발명의 구현을 제한하도록 의도되지 않는다. 도 10에 도시된 바와 같이, 전자 기기는 하나 또는 하나 이상의 프로세서, 메모리, 및 고속 인터페 이스 및 저속 인터페이스를 포함하는 각 부품을 연결하기 위한 인터페이스를 포함한다. 각 부품은 상이한 버스 를 이용하여 상호 연결되고, 공통 마더보드 상에 장착되거나 또는 원하는 대로 다른 방식으로 장착될 수도있다. 프로세서는 전자 기기 내에서 실행되는 명령을 프로세싱할 수 있고, 외부 입력/출력 장치(예를 들어, 인 터페이스에 결합된 디스플레이 장치) 상에 GUI의 그래픽 정보를 디스플레이하기 위해 메모리 또는 메모리 상에 저장된 명령을 포함한다. 다른 실시예에서, 원한다면 복수의 프로세서 및/또는 복수의 버스은 복수의 메모리 및 복수의 메모리와 함께 사용될 수 있다. 또한, 다수의 전자 기기은 필요한 동작의 일부를 제공하는 다양한 기기 (예를 들어, 서버 어레이, 블레이드 서버의 세트, 또는 멀티 프로세서 시스템)와 연결될 수 있다. 도 10에서는 하나의 프로세서를 예로 든다. 메모리는 본 발명에 따른 비일시적 컴퓨터 판독 가능 저장 매체이다. 메모리는 적어도 하나의 프로세서에 의해 실행될 수 있는 명령을 저장하여 적어도 하나의 프로세서가 본 발명에 따른 텍스트 내의 이벤트 추출 방법 을 수행하게 한다. 본 발명의 비일시적 컴퓨터 판독 가능 저장 매체는 컴퓨터에서 본 발명에 따른 텍스트 내의 이벤트 추출 방법을 실행하게 하기 위한 컴퓨터 명령을 저장한다. 메모리는 비일시적 컴퓨터 판독 가능 저장 매체로서, 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 방법에 대응하는 프로그램 명령/모듈(예를 들어, 도 8에 도시된 획득 모듈, 트리거 단어 추출 모듈, 논항 추출 모듈, 및 결정 모듈)과 같은 비일시적 소프트웨어 프로그램, 비일시적 컴퓨터 실행가능 프 로그램 및 모듈을 저장하는데 사용될 수 있다. 프로세서는 메모리에 저장된 비일시적 소프트웨어 프로그램, 명령 및 모듈을 실행함으로써 서버의 다양한 기능 애플리케이션 및 데이터 처리를 실행하며, 즉 전술 한 방법의 실시예에 따른 텍스트 내의 이벤트 추출 방법을 구현한다. 상기 메모리는 프로그램 저장영역 및 데이터 저장영역을 포함할 수 있으며, 프로그램 저장영역은 운영 체 제, 적어도 하나의 기능에 필요한 애플리케이션 프로그램을 저장할 수 있고, 데이터 저장영역은 텍스트 내의 이 벤트에 따라 추출된 전자 기기의 사용에 의해 생성된 데이터 등을 저장할 수 있다. 또한, 메모리는 고속 랜덤 액세스 메모리를 포함할 수 있고, 또한 적어도 하나의 자기 디스크 저장 장치, 플래시 메모리 장치, 또는 다른 비일시적 고체 메모리 장치와 같은 비일시적 메모리를 포함할 수도 있고, 일부 실시예에서, 메모리 는 선택적으로 프로세서에 비해 원격으로 설치된 저장장치를 포함할 수 있고, 이 원격 저장장치는 네트워 크를 통해 텍스트 내의 이벤트 추출을 위한 전자 기기에 연결될 수 있다. 이러한 네트워크의 예는 인터넷, 기업 인트라넷, 로컬 영역 네트워크, 이동 통신 네트워크, 및 이들의 조합을 포함하지만, 이에 제한되지 않는다. 텍스트 내의 이벤트 추출 방법의 전자 기기는 입력장치 및 출력장치를 더 포함할 수 있다. 프로세 서, 메모리, 입력장치, 및 출력장치는 버스 또는 다른 수단에 의해 접속될 수 있으며, 도 10에서 버스를 통한 연결이 예시되어 있다. 입력장치는 입력된 숫자 또는 문자 정보를 수신할 수 있을 뿐만 아니라, 텍스트 내의 이벤트 추출을 실행 하는 전자 기기의 사용자 설정 및 기능제어에 관련된 키 신호 입력을 생성할 수 있으며, 예를 들어, 터치 스크 린, 키패드, 마우스, 트랙패드, 터치패드, 포인팅 스틱, 하나 또는 하나 이상의 마우스 버튼, 트랙볼, 조이스틱 등과 같다. 출력장치는 디스플레이 장치, 보조 조명 장치(예를 들어, LED), 및 햅틱 피드백 장치(예를 들 어, 진동 모터)등을 포함할 수 있다. 이 디스플레이 장치는 액정표시장치(LCD), 발광 다이오드(LED) 디스플레이, 및 플라즈마 디스플레이를 포함할 수 있지만, 이에 한정되지 않는다. 일부 실시방식에서, 디스플레 이 장치는 터치 스크린일 수 있다. 본 명세서에 기술된 시스템 및 기술의 다양한 실시방식은 디지털 전자 회로 시스템, 집적 회로 시스템, 주문형 집적 회로 (ASIC), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합으로 구현될 수 있다. 이들 다양 한 실시예는 하나 또는 하나 이상의 컴퓨터 프로그램에서 구현하는 것을 포함할 수 있으며, 이 하나 또는 하나 이상의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능한 시스템 상에서 실행 및/또는 해석될 수 있고, 이 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서일 수 있으 며, 저장 시스템, 적어도 하나의 입력장치, 및 적어도 하나의 출력장치로부터 데이터 및 명령을 수신하고, 데이 터 및 명령을 이 저장 시스템, 적어도 하나의 입력장치, 및 적어도 하나의 출력장치에 송신할 수 있다. 이들 컴퓨팅 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션, 또는 코드로 또한 지칭됨)은 프로그램 가능 프로세서의 기계 명령을 포함하며, 하이 레벨 절차 및/또는 객체 지향 프로그래밍 언어, 및/또는 어셈블리 /기계 언어로 구현될 수 있다. 본 명세서에서 사용되는 바와 같이, “기계 판독 가능 매체”및 “컴퓨터 판독 가능 매체”라는 용어는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서에 제공하기 위한 임의의 컴퓨터 프로그램 제품, 디바이스, 및/또는 장치(예를 들어, 자기 디스크, 광 디스크, 메모리, 프로그래머블 논리 소자 (PLD)) 를 지칭하며, 기계 판독 가능 신호인 기계 명령을 수신하기 위한 기계 판독 가능 매체를 포함한다. “기 계 판독 가능 신호”라는 용어는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서에 제공하는데 사용되는임의의 신호를 지칭한다. 사용자와의 상호작용을 제공하기 위해, 본 명세서에 설명된 시스템 및 기술은 컴퓨터 상에서 구현될 수 있으며, 이 컴퓨터는 사용자에게 정보를 디스플레이하기 위한 디스플레이 장치(예를 들어, 음극선관(CRT) 또는 액정표시 장치(LCD) 모니터), 및 키보드 및 포인팅 장치(예를 들어, 마우스 또는 트랙볼)을 갖고, 사용자가 이 키보드 및 이 포인팅 장치를 통해 컴퓨터에 입력을 제공할 수 있다. 다른 종류의 장치가 사용자와의 상호작용을 제공하기 위해 사용될 수 있으며, 예를 들어, 사용자에게 제공되는 피드백은 임의의 형태의 감각 피드백(예를 들어, 시각 적 피드백, 청각적 피드백, 또는 촉각적 피드백) 일 수 있고, 사용자로부터의 입력은 임의의 형태(음향 입력, 음성 입력, 또는 촉각 입력을 포함하는)로 수신될 수 있다. 본 명세서에 설명된 시스템 및 기술은 백그라운드 컴포넌트를 포함하는 컴퓨팅 시스템(예를 들어, 데이터 서 버), 또는 미들웨어 컴포넌트를 포함하는 컴퓨팅 시스템 (예를 들어, 애플리케이션 서버), 또는 프론트-엔드 컴 포넌트를 포함하는 컴퓨팅 시스템(예를 들어, 그래픽 사용자 인터페이스 또는 웹 브라우저를 갖는 사용자 컴퓨 터이고, 사용자는 이 그래픽 사용자 인터페이스 또는 웹 브라우저를 통해 본 명세서에 기술된 시스템 및 기술의 실시예와 상호작용할 수 있다), 또는 이 백그라운드 컴포넌트, 미들웨어 컴포넌트 또는 프론트-엔드 컴포넌트를 포함하는 임의 조합의 컴퓨팅 시스템에서 구현될 수 있다. 시스템의 컴포넌트는 디지털 데이터 통신(예를 들어, 통신 네트워크)의 임의의 형태 또는 매체에 의해 상호접속될 수 있다. 통신 네트워크의 예는 근거리 통신망 (LAN), 광대역통신망(WAN) 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 떨어져 있으며, 통상적으로 통신 네트워크를 통해 상호 작용한다. 클라이언트와 서버 사이의 관계는 대응하는 컴퓨터 상에서 실 행되고 서로 클라이언트-서버 관계를 갖는 컴퓨터 프로그램에 의해 생성된다. 본 발명의 실시예에 따른 기술방안은, 입력 텍스트에 대한 이벤트 추출을 수행할 때, 트리거 단어 추출 모델을 통해 입력 텍스트에 대한 트리거 단어 추출을 수행하여 이 입력 텍스트의 트리거 단어 추출 결과를 획득하고, 입력 텍스트 및 트리거 단어 추출 결과를 논항 추출 모델에 입력하여 입력 텍스트의 논항 추출 결과를 획득하고, 트리거 단어 추출 결과 및 논항 추출 결과를 결합하여 입력 텍스트의 이벤트 추출 결과를 결정한다. 따라서, 트리거 단어 추출 모델 및 논항 추출 모델을 결합하여 입력 텍스트에 대한 이벤트 추출을 구현하고, 입 력 텍스트 내의 이벤트 추출의 정확도를 향상시키고, 이벤트 추출의 구축 비용을 줄일 수 있고, 어느 인공 특징 구축도 필요하지 않다. 전술한 다양한 형태의 흐름, 재배열, 부가 또는 삭제 단계가 사용될 수 있다는 것을 이해해야 한다. 예를 들어, 본 발명에 기재된 각 단계는 본 발명에 개시된 기술방안의 원하는 결과를 구현할 수 있는 한, 병렬로 또는 순서 로 또는 상이한 순서로 수행될 수 있으며, 이는 본 명세서에 제한되지 않는다. 상기 상세한 실시방식은 본 발명의 청구항을 제한하는 것으로 의도되지 않는다. 다양한 수정, 조합, 서브 조합, 및 대체가 설계 요건 및 다른 요인을 고려하여 이루어질 수 있다는 것이 당업자에게 명백할 것이다. 본 발명의 사상 및 원리 내에서 이루어진 임의의 수정, 등가물, 및 개선은 본 발명의 청구항 내에 포함되는 것으로 의도된 다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2020-0183500", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부된 도면은 본 발명의 해결방법을 보다 잘 이해하기 위해 사용되며, 본 발명을 제한하려 하지 않는다. 여기 서, 도 1은 본 발명의 제 1 실시예에 따른 텍스트 내의 이벤트 추출 방법의 흐름도이다. 도 2는 본 발명의 제 2 실시예에 따른 텍스트 내의 이벤트 추출 방법의 흐름도이다. 도 3은 본 발명의 제 3 실시예에 따른 텍스트 내의 이벤트 추출 방법의 흐름도이다. 도 4는 본 발명의 제 4 실시예에 따른 텍스트 내의 이벤트 추출 방법의 흐름도이다. 도 5는 본 발명의 제 5 실시예에 따른 텍스트 내의 이벤트 추출 방법의 흐름도이다. 도 6은 본 발명의 제 6 실시예에 따른 텍스트 내의 이벤트 추출 방법의 흐름도이다. 도 7은 본 발명의 제 7 실시예에 따른 텍스트 내의 이벤트 추출 방법의 흐름도이다. 도 8은 본 발명의 제 8 실시예에 따른 텍스트 내의 이벤트 추출 장치의 구조도이다. 도 9는 본 발명의 제 9 실시예에 따른 텍스트 내의 이벤트 추출 장치의 구조도이다.도 10은 본 발명의 실시예에 따른 텍스트 내의 이벤트 추출 방법을 구현하기 위한 전자 기기의 블록도이다."}
