{"patent_id": "10-2020-0029466", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0114163", "출원번호": "10-2020-0029466", "발명의 명칭": "비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법 및 이를 위한 장치", "출원인": "한국전자통신연구원", "발명자": "이승익"}}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비디오 영상 입력으로부터 선택된 개수의 프레임을 묶어 세그먼트들을 생성하는 단계;상기 세그먼트들을 입력으로 한 신경망의 중간 계층의 특징을 기반으로 신경망을 학습하는 단계; 및 상기 세그먼트들을 학습된 신경망에 입력하여 상기 세그먼트 단위로 이상을 검출하는 단계를 포함하는, 비디오영상 프레임의 세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 신경망을 학습하는 단계는적어도 하나 이상의 이상 프레임을 포함하는 이상 비디오 영상으로 학습하는 단계를 포함하는, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 이상 비디오 영상으로 학습하는 단계는상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성하는 단계;상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하는 단계; 및상기 두 개의 클러스터 중 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이상 클러스터로 선택하는단계를 포함하는, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 이상 비디오 영상으로 학습하는 단계는상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상으로 레이블링하는 단계;상기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 레이블링하는 단계; 및상기 레이블들을 상기 신경망의 예측결과 정답셋으로 설정하는 단계를 더 포함하는, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 이상 비디오 영상으로 학습하는 단계는상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 신경망의 예측결과 정답셋과 비교하여 손실함수1를계산하는 단계;상기 정상 클러스터와 상기 이상 클러스터를 비교하여 손실함수2를 계산하는 단계; 및상기 손실함수1과 손실함수2를 종합하여 전체손실함수를 계산하는 단계를 더 포함하는, 비디오 영상 프레임의세그먼팅을 이용한 이상 탐지 방법.공개특허 10-2021-0114163-3-청구항 6 제5 항에 있어서,상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리에 반비례하는 것인, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 신경망을 학습하는 단계는이상 프레임을 하나도 포함하지 않는 정상 비디오 영상으로 학습하는 단계를 포함하는, 비디오 영상 프레임의세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 상기 정상 비디오 영상으로 학습하는 단계는상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성하는 단계;상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하는 단계; 및상기 두 개의 클러스터 중 다른 하나를 정상2 클러스터로 선택하는 단계를 포함하는, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 정상 비디오 영상으로 학습하는 단계는상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타내는 정답셋과 비교하여 손실함수1을 계산하는 단계;상기 정상1 클러스터와 상기 정상2 클러스터를 비교하여 손실함수2를 계산하는 단계; 및상기 손실함수1과 손실함수2를 종합하여 전체손실함수를 계산하는 단계를 더 포함하는, 비디오 영상 프레임의세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례하는 것인, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "비디오 영상 입력으로부터 선택된 개수의 프레임을 묶어 세그먼트들을 생성하는 세그먼트 생성부;상기 세그먼트들을 입력으로 한 신경망의 중간 계층의 특징을 기반으로 신경망을 학습하는 신경망 학습부; 및 상기 세그먼트들을 학습된 신경망에 입력하여 상기 세그먼트 단위로 이상을 검출하는 이상 검출부를 포함하는,비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서, 상기 신경망 학습부는공개특허 10-2021-0114163-4-적어도 하나 이상의 이상 프레임을 포함하는 이상 비디오 영상으로 학습하는 이상 비디오 학습부를 포함하는,비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서, 상기 이상 비디오 학습부는상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성하는 이상클러스터생성부를 포함하고,상기 이상클러스터 생성부는상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하고,상기 두 개의 클러스터 중 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이상 클러스터로 선택하는것인, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 이상 비디오 학습부는상기 세그먼트들에 대한 레이블을 생성하는 레이블링 생성부를 더 포함하고, 상기 레이블링 생성부는상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상으로 생성하고,상기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 생성하며,상기 레이블들을 상기 신경망의 예측결과 정답셋으로 설정하는 것인, 비디오 영상 프레임의 세그먼팅을 이용한이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서,상기 이상 비디오 학습부는상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 신경망의 예측결과 정답셋과 비교하여 손실함수1를계산하는 이상손실함수1 계산부;상기 정상 클러스터와 상기 이상 클러스터를 비교하여 손실함수2를 계산하는 이상손실함수2 계산부; 및상기 손실함수1과 손실함수2를 종합하여 전체손실함수를 계산하는 이상전체손실함수 계산부를 더 포함하는, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15 항에 있어서,상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리에 반비례하는 것인, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11 항에 있어서,상기 신경망 학습부는이상 프레임을 하나도 포함하지 않는 정상 비디오 영상으로 학습하는 정상 비디오 학습부를 포함하는, 비디오공개특허 10-2021-0114163-5-영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서, 상기 정상 비디오 학습부는상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성하는 정상클러스터생성부를 포함하고,상기 정상클러스터 생성부는상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하고,상기 두 개의 클러스터 중 다른 하나를 정상2 클러스터로 선택하는 것인, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18 항에 있어서,상기 정상 비디오 학습부는상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타내는 정답셋과 비교하여 손실함수1을 계산하는 정상손실함수1 계산부;상기 정상1 클러스터와 상기 정상2 클러스터를 비교하여 손실함수2를 계산하는 정상손실함수2 계산부; 및상기 손실함수1과 손실함수2를 종합하여 전체손실함수를 계산하는 정상전체손실함수 계산부를 더 포함하는, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서,상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례하는 것인, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "기재된 실시예는 인공지능 기술을 이용하여 모니터링하는 비디오 영상으로부터 이상 상황을 탐지하는 기술에 관 한 것으로, 비디오 영상 입력으로부터 선택된 개수의 프레임을 묶어 세그먼트들을 생성하는 단계; 상기 세그먼트 들을 입력으로 한 신경망의 중간 계층의 특징을 기반으로 신경망을 학습하는 단계; 및 상기 세그먼트들을 학습된 신경망에 입력하여 상기 세그먼트 단위로 이상을 검출하는 단계를 포함하는, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법에 관한 것이다."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 기술을 이용하여 모니터링하는 비디오 영상으로부터 이상 상황을 탐지하는 기술에 관한 것 이다."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "비디오 영상 기반 이상 상황 탐지 시스템은 CCTV와 같은 고정형 카메라나 이동 로봇과 같이 이동형 카메라를 탑 재한 시스템에서 비디오 영상을 기반으로 이상 상황을 탐지하는 것이다. 그리고 최근에는 이상 상황을 탐지하기 위하여 인공지능 기술을 활용하고 있는데, 정상 상황과 비정상 상황을 구분하기 위하여 입력 데이터에 정상과 비정상을 레이블링하고, 레이블링된 입력 데이터를 인공지능에 입력하여 학습을 하여 정상과 비정상을 구분할 수 있도록 하고 있다. 즉, 기존의 인공지능 기술을 이용한 비디오 기반 이상 탐지 시스템은 주로 입력 비디오 영상의 각 프레임별로 레이블(주어진 프레임이 정상 혹은 이상인지를 나타내는 플래그)이 주어지고, 이 레이블을 인공지능 학습의 학 습 신호로 사용하는 지도학습기반이 주된 방법이었다. 그러나 이와 같은 지도 학습 기반의 방법은 사전에 무엇이 이상인지를 정의해야 하고, 이에 따라 사전에 정의되 지 않은 이상은 탐지할 수 없다는 문제점이 있다. 그리고 현실적으로 이 보다 더 큰 문제점은 비디오의 모든 프 레임에 대하여 이상 여부를 사람이 직접 보면서 레이블링 작업을 해야한다는 점인데, 이와 같은 레이블링 작업 은 엄청나게 많은 수고와 비용을 요구하기 때문이다.한국공개특허 제 10-2019-0100085호는 인공지능을 이용하여, 위험 상황을 감지할 수 있는 로봇 및 그의 동작 방 법을 개시하고 있다. 상기 선행 특허는 음성 인식 모델 및 영상 인식 모델을 이용하여 위험상황을 감지하는 기 술에 관한 것으로, 영상 인식 모델이 출력된 대상 특징 벡터와 라벨링(또는 레이블링)된 현재 상황의 차이에 상 응하는 비용함수를 최소화하도록 학습한다. 따라서 상기 선행특허도 역시 앞서 기존 기술의 문제점으로 지적한 바와 같이 현재 상황을 프레임단위로 라벨링을 해야 한다는 문제점이 있다. 따라서 위 종래 기술이 가지는 문제점을 해결하고, 이상 탐지 시스템의 인공지능 학습에 필요한 레이블링 작업 의 수고와 비용을 줄이는 기술의 필요성이 대두된다."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법및 이를 위한 장치를 제공함으로써 비디오 수준에서의 레이블링 정보, 즉 비디오가 이상 상황을 포함하는지 여부를 나타내는 정보만을 가지고 프레 임 수준에서의 이상을 탐지할 수 있는 이상 탐지 시스템을 제공함에 있다. 또한 이상 비디오 영상 또는 정상 비디오 영상을 이용하여 이상 탐지에 사용될 인공지능 신경망을 학습하는 방 법을 제공함에 있다."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법은, 비디오 영상 입력으로부터 선택된 개수의 프레임을 묶어 세그먼트들을 생성하는 단계; 상기 세그먼트들을 입력으로 한 신경망의 중간 계층의 특징 을 기반으로 신경망을 학습하는 단계; 및 상기 세그먼트들을 학습된 신경망에 입력하여 상기 세그먼트 단위로 이상을 검출하는 단계를 포함한다. 상기 신경망을 학습하는 단계는 적어도 하나 이상의 이상 프레임을 포함하는 이상 비디오 영상으로 학습하는 단 계를 포함할 수 있다. 상기 이상 비디오 영상으로 학습하는 단계는 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성하는 단계; 상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하는 단계; 및 상기 두 개의 클러스터 중 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이상 클러스터로 선택하는 단계를 포함할 수 있다. 상기 이상 비디오 영상으로 학습하는 단계는 상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상 으로 레이블링하는 단계; 상기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 레이블링하는 단계; 및 상기 레이블들을 상기 신경망의 예측결과 정답셋으로 설정하는 단계를 더 포함할 수 있다. 상기 이상 비디오 영상으로 학습하는 단계는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 신경망 의 예측결과 정답셋과 비교하여 손실함수1를 계산하는 단계; 상기 정상 클러스터와 상기 이상 클러스터를 비교 하여 손실함수2를 계산하는 단계; 및 상기 손실함수1과 손실함수2를 종합하여 전체손실함수를 계산하는 단계를 더 포함할 수 있다. 상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리에 반비례하는 것일 수 있다. 상기 신경망을 학습하는 단계는 이상 프레임을 하나도 포함하지 않는 정상 비디오 영상으로 학습하는 단계를 포 함할 수 있다. 상기 정상 비디오 영상으로 학습하는 단계는 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성하는 단계; 상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하는 단계; 및 상 기 두 개의 클러스터 중 다른 하나를 정상2 클러스터로 선택하는 단계를 포함할 수 있다. 상기 정상 비디오 영상으로 학습하는 단계는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타 내는 정답셋과 비교하여 손실함수1을 계산하는 단계; 상기 정상1 클러스터와 상기 정상2 클러스터를 비교하여 손실함수2를 계산하는 단계; 및 상기 손실함수1과 손실함수2를 종합하여 전체손실함수를 계산하는 단계를 더 포 함할 수 있다. 상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례하는 것일 수 있다. 실시예에 따른 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치는, 비디오 영상 입력으로부터 선택된 개수의 프레임을 묶어 세그먼트들을 생성하는 세그먼트 생성부; 상기 세그먼트들을 입력으로 한 신경망의 중간 계층의 특징을 기반으로 신경망을 학습하는 신경망 학습부; 및 상기 세그먼트들을 학습된 신경망에 입력하여 상 기 세그먼트 단위로 이상을 검출하는 이상 검출부를 포함한다. 상기 신경망 학습부는 적어도 하나 이상의 이상 프레임을 포함하는 이상 비디오 영상으로 학습하는 이상 비디오 학습부를 포함할 수 있다. 상기 이상 비디오 학습부는 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스 터를 생성하는 이상클러스터 생성부를 포함하고, 상기 이상클러스터 생성부는 상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하고, 상기 두 개의 클러스터 중 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이상 클러스터로 선택하는 것일 수 있다. 상기 이상 비디오 학습부는 상기 세그먼트들에 대한 레이블을 생성하는 레이블링 생성부를 더 포함하고, 상기 레이블링 생성부는 상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상으로 생성하고, 상기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 생성하며, 상기 레이블들을 상기 신경망의 예측결 과 정답셋으로 설정하는 것일 수 있다. 상기 이상 비디오 학습부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 신경망의 예측결과 정답 셋과 비교하여 손실함수1를 계산하는 이상손실함수1 계산부; 상기 정상 클러스터와 상기 이상 클러스터를 비교 하여 손실함수2를 계산하는 이상손실함수2 계산부; 및 상기 손실함수1과 손실함수2를 종합하여 전체손실함수를 계산하는 이상전체손실함수 계산부를 더 포함할 수 있다. 상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리에 반비례하는 것일 수 있다. 상기 신경망 학습부는 이상 프레임을 하나도 포함하지 않는 정상 비디오 영상으로 학습하는 정상 비디오 학습부 를 포함할 수 있다. 상기 정상 비디오 학습부는 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스 터를 생성하는 정상클러스터 생성부를 포함하고, 상기 정상클러스터 생성부는 상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하고, 상기 두 개의 클러스터 중 다른 하나를 정상2 클러스터로 선택하는 것일 수 있다. 상기 정상 비디오 학습부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타내는 정답셋과 비 교하여 손실함수1을 계산하는 정상손실함수1 계산부; 상기 정상1 클러스터와 상기 정상2 클러스터를 비교하여 손실함수2를 계산하는 정상손실함수2 계산부; 및 상기 손실함수1과 손실함수2를 종합하여 전체손실함수를 계산 하는 정상전체손실함수 계산부를 더 포함할 수 있다. 상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례하는 것일 수 있다."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법및 이를 위한 장치를 제공함으로써 비디오 수준에서의 레이블링 정보, 즉 비디오가 이상 상황을 포함하는지 여부를 나타내는 정보만을 가지고 프레 임 수준에서의 이상을 탐지할 수 있는 이상 탐지 시스템을 제공할 수 있다. 또한 이상 비디오 영상 또는 정상 비디오 영상을 이용하여 이상 탐지에 사용될 인공지능 신경망을 학습하는 방 법을 제공할 수 있다."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는"}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 비록 \"제1\" 또는 \"제2\" 등이 다양한 구성요소를 서술하기 위해서 사용되나, 이러한 구성요소는 상기와 같은 용 어에 의해 제한되지 않는다. 상기와 같은 용어는 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사 용될 수 있다. 따라서, 이하에서 언급되는 제1 구성요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있다. 본 명세서에서 사용된 용어는 실시예를 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세 서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 또는 \"포함하는(comprising)\"은 언급된 구성요소 또는 단계가 하나 이상의 다른 구성요소 또는 단 계의 존재 또는 추가를 배제하지 않는다는 의미를 내포한다."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어는 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 해석될 수 있다. 또한, 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하에서는, 도 1 내지 도10을 참조하여 실시예에 따른 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장 치 및 이를 위한 장치가 상세히 설명된다. 도 1은 실시예에 따른 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치의 일 예를 나타낸 블록도이다. 도 1을 참조하면, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치는 세그먼트 생성부, 신경 망 학습부, 이상 검출부를 포함한다. 그리고 상기 장치는 비디오 입력 영상을 입력으로 받아 세 그먼트 단위 이상 검출 결과를 출력으로 내보낸다. 세그먼트 생성부는 비디오 입력 영상을 입력으로 받아 선택된 개수의 프레임을 묶어 세그먼트들로 생 성한다. 상기 선택된 개수(한 세그먼트를 구성하는 프레임의 개수)가 1이 되면 상기 이상 탐지 장치는 프레임 수준에서 이상 및 정상을 판단할 수 있는 시스템이 되고, 1보다 크게 되면 세그먼트 수준에서 이상 및 정상을 판단할 수 있는 시스템이 될 수 있다. 신경망 학습부는 세그먼트 생성부에서 생성된 세그먼트들을 입력으로 받아 신경망의 중간 계층의 특 징을 기반으로 신경망을 학습한다. 상기 신경망 학습부는 적어도 하나 이상의 이상 프레임을 포함하는 이상 비디오 영상으로 학습하는 동작을 수행할 수 있다. 우선 상기 신경망 학습부는 상기 이상 비디오 영상으로 학습하는 동작을 수행하기 위하여 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 그룹, 즉 두 개의 클러스터를 생성할 수 있다. 상기 이상 탐지 장치가 상기 신경망을 학습하기 위해서는 각 세그먼트별로 이상 또는 정상의 판별 결과에 상응 하는 이상 또는 정상의 레이블링이 있어야 한다. 그러나 본 발명에서는 오로지 비디오 수준에서의 레이블링, 즉 입력 비디오 영상이 이상 상황을 포함하고 있는지 여부만을 알고 있기 때문에 각 세그먼트 별로 어떤 세그먼트 가 이상 상황을 포함하고 어떤 세그먼트가 정상 세그먼트인지 알지 못한다. 이를 극복하기 위해서 신경망의 중 간 계층의 특징을 사용하여, 본 발명에서는 세그먼트들을 클러스터링하는 방법을 제안한다. 여기서 클러스터링 이란 세그먼트의 특징을 기반으로 비슷한 특징을 가진 세그먼트들끼리 한 그룹으로 묶는 것을 말한다. 따라서 상기 신경망 학습부는 상기 세그먼트들을 두 개의 그룹, 즉 두 개의 클러스터로 나누고, 상기 클러스터 별 로 레이블링을 하여 정답셋으로 사용하는 것이다. 상기 신경망 학습부는 상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하고, 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이상 클러 스터로 선택할 수 있다. 즉, 두 개의 클러스터 중에서 신경망이 예측한 각 세그먼트에서 정상으로 예측한 세그 먼트가 더 많이 분포하는 클러스터를 정상 클러스터로 선택하고, 나머지 클러스터를 이상 클러스터로 선택하는 것이다. 그리고 상기 신경망 학습부는 상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상으로 레이 블링하고, 상기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 레이블링할 수 있다. 이와 같 이 생성된 레이블들을 상기 신경망의 예측결과 정답셋으로 설정할 수 있다. 상기와 같은 방법으로, 상기 이상 탐지 장치는 세그먼트 단위의 상기 신경망의 예측결과 정답셋을 생성하고, 상 기 정답셋을 가지고 신경망 학습을 진행할 수 있는 것이다. 상기 신경망 학습부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 신경망의 예측결과 정답 셋과 비교하여 손실함수1을 계산할 수 있다. 또한 상기 정상 클러스터와 상기 이상 클러스터를 비교하여 손실함 수2를 계산할 수 있다. 그리고 상기 손실함수1과 상기 손실함수2를 종합하여 전체 손실함수를 계산할 수 있다. 그리고 상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리에 반비례하는 것일 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 하기 수학식 1과 같이 정의될 수 있다. [수학식 1]"}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 는 손실함수1, 은 하나의 비디오 입력 영상에 있는 세그먼트의 개수, 는 i번째 세그먼트에 대한 신경망의 출력, 는 i번째 세그먼트가 속한 클러스터(또는 정답셋)를 의미한다. 상기 손실함수2는 두 개의 클러스터의 비교를 통해 구할 수 있다. 상기 두 개의 클러스터는 하나는 정상, 나머 지는 이상을 나타내고 있으므로, 두 클러스터 간의 거리가 되도록 멀리 떨어져 있는 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 하기 수학식 2와 같이 계산할 수 있다. [수학식 2]"}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, 는 손실함수2, 은 첫 번째 클러스터의 중심, 는 두번째 클러스터의 중심을 의미한다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학 습하는 경우의 전체 손실 함수는 하기 수학식 3과 같이 정의될 수 있다.[수학식 3]"}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서 은 전체손실함수, 는 0과 1사이의 실수값, 는 손실함수1, 는 손실함수2이다. 상기의 수학식들로 보여준 손실함수들은 단지 하나의 예일 뿐이고, 사용자의선택과 응용에 따라서 다르게 구현 될 수도 있다. 예를 들어 는 교차 엔트로피 손실일 수도 있고, 는 클러스터에 속한 모든 원소들의 거리 에 대한 평균일 수도 있다. 또한, 상기 신경망 학습부는 이상 프레임을 하나도 포함하지 않는 정상 비디오 영상으로 학습하는 동작을 수행할 수 있다. 우선 상기 신경망 학습부는 정상 비디오 영상으로 학습하는 동작을 수행하기 위하여 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성할 수 있다. 앞서 설명한 바와 같이 상기 신경망을 학습하기 위해서는 각 세그먼트별로 이상 또는 정상의 판별 결과에 상응 하는 이상 또는 정상의 레이블링이 있어야 한다. 따라서 상기 신경망 학습부는 상기 신경망의 중간 계층의 특징을 기반으로 상기 세그먼트들을 두 개의 그룹, 즉 두 개의 클러스터로 나누고, 상기 클러스터 별로 레이블 링을 하여 정답셋으로 사용하는 것이다. 그리고 상기 신경망 학습부는 상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하고, 다른 하나를 정상2 클러스터로 선택할 수 있다. 즉, 모든 세그먼트가 정상임을 알고 있으므로 두 개의 클러스터 모두 정상 클러스터가 되는 것이고, 세그먼트 단위의 신경망의 예측결과 정답셋도 모두 정상으로 하면 된다. 따라서 상기 세그먼트 단위의 신경망의 예측에 대한 정답셋을 가지고 신경망 학습을 진행할 수 있다. 상기 신경망 학습부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타내는 정답셋과 비 교하여 손실함수1을 계산할 수 있다. 또한 상기 정상1 클러스터와 상기 정상2 클러스터를 비교하여 손실함수2를 계산할 수 있다. 그리고 상기 손실함수1과 상기 손실함수2를 종합하여 전체 손실함수를 계산할 수 있다. 그리고 상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례하는 것일 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학식 1과 같이 정의될 수 있다. 상기 손실함수2는 역시 두 개의 클러스터의 비교를 통해 구할 수 있다. 그리고 상기 두 개의 클러스터 모두가 정상을 나타내고 있으므로, 두 클러스터 간의 거리가 되도록 가까운 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 하기 수학식 4와 같이 계산할 수 있다. [수학식 4]"}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서, 는 손실함수2, 은 첫 번째 클러스터의 중심, 는 두번째 클러스터의 중심을 의미한다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학 습하는 경우의 전체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 상기 신경망 학습부는 이상 비디오 영상과 정상 비디오 영상을 다수 구축하고, 이상 비디오 영상으로 학습 하는 동작과 정상 비디오 영상으로 학습하는 동작을 결과가 수렴할 때까지 반복할 수 있다. 각각의 비디오 영상 을 학습할 때마다 클러스터링이 수행되고, 같은 비디오 영상이라고 하더라도 학습이 진행됨에 따라서 클러스터 링의 결과가 변화할 수 있다. 이상 비디오 영상으로 학습하는 경우, 클러스터링 결과에서 어느 클러스터가 정상 또는 이상인지는 사전에 정의되지는 않고, 신경망의 출력 결과에 따라 정상으로 판별된 세그먼트가 더 많이 존 재하는 클러스터가 정상 클러스터로 선택되는 것이다. 이상 검출부는 세그먼트 생성부에서 생성된 세그먼트들을 신경망학습부에서 학습된 신경망에 입력하 고, 각 세그먼트에 대하여 이상 혹은 정상을 판별하여 세그먼트 단위 이상 검출 결과를 출력하게 된다. 도 2는 도 1에 도시된 신경망 학습부의 일 예를 나타낸 블록도이다. 도 2를 참조하면, 신경망 학습부는 신경망을 포함하고, 이상 비디오 학습부 또는 정상 비디오 학습부를 포함할 수 있다. 상기 신경망은 세그먼트 생성부에서 생성된 세그먼트를 입력으로 받아 이상 혹은 정상을 판별하기 위한 인 공지능 신경망이다. 상기 신경망은 상기 이상 비디오 학습부 또는 정상 비디오 학습부를 통해 학습될 수 있다. 상기 이상 비디오 학습부 또는 정상 비디오 학습부는 상기 신경망의 중간 계층의 특 징을 기반으로 학습할 수 있다. 즉, 상기 신경망은 이상 비디오 학습부 또는 정상 비디오 학습부와의 상호 작용 을 통해서 학습을 수행하게 되는 것이다. 신경망 학습부는 적어도 하나 이상의 이상 프레임을 포함하는 이상 비디오 영상으로 학습하는 동작을 수행 하는 이상 비디오 학습부를 포함할 수 있다. 상기 이상 비디오 학습부는 이상 비디오 영상으로 학습하는 동작을 수행하기 위하여 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성할 수 있다. 상기 이상 비디오 학습부가 상기 신경망을 학습하기 위해서는 각 세그먼트별로 이상 또는 정상의 판별 결 과에 상응하는 이상 또는 정상의 레이블링이 있어야 한다. 그러나 본 발명에서는 오로지 비디오 수준에서의 레 이블링, 즉 입력 비디오 영상이 이상 상황을 포함하고 있는지 여부만을 알고 있기 때문에 각 세그먼트 별로 어 떤 세그먼트가 이상 상황을 포함하고 어떤 세그먼트가 정상 세그먼트인지 알지 못한다. 이를 극복하기 위해서 신경망의 중간 계층의 특징을 사용하여, 본 발명에서는 세그먼트들을 클러스터링하는 방법을 제안한다. 여기서 클러스터링이란 세그먼트의 특징을 기반으로 비슷한 특징을 가진 세그먼트들끼리 한 그룹으로 묶는 것을 말한다. 따라서 상기 이상 비디오 학습부는 상기 세그먼트들을 두 개의 그룹, 즉 두 개의 클러스터로 나누 고, 상기 클러스터 별로 레이블링을 하여 정답셋으로 사용하는 것이다. 상기 이상 비디오 학습부는 상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수 가 더 많은 클러스터를 정상 클러스터로 선택하고, 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이 상 클러스터로 선택할 수 있다. 즉, 두 개의 클러스터 중에서 신경망이 예측한 각 세그먼트에서 정상으로 예측 한 세그먼트가 더 많이 분포하는 클러스터를 정상 클러스터로 선택하고, 나머지 클러스터를 이상 클러스터로 선 택하는 것이다. 그리고 상기 이상 비디오 학습부는 상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상으로 레이블링하고, 상기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 레이블링할 수 있다. 이 와 같이 생성된 레이블들을 상기 신경망의 예측결과 정답셋으로 설정할 수 있다. 상기와 같은 방법으로, 상기 이상 비디오 학습부는 세그먼트 단위의 상기 신경망의 예측결과 정답셋을 생 성하고, 상기 정답셋을 가지고 신경망 학습을 진행할 수 있는 것이다. 상기 이상 비디오 학습부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 신경망의 예측결과 정답셋과 비교하여 손실함수1을 계산할 수 있다. 또한 상기 정상 클러스터와 상기 이상 클러스터를 비교하여 손 실함수2를 계산할 수 있다. 그리고 상기 손실함수1과 상기 손실함수2를 종합하여 전체 손실함수를 계산할 수 있 다. 그리고 상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리에 반비례하 는 것일 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학식 1과 같이 정의될 수 있다. 상기 손실함수2는 두 개의 클러스터의 비교를 통해 구할 수 있다. 상기 두 개의 클러스터는 하나는 정상, 나머지는 이상을 나타내고 있으므로, 두 클러스터 간의 거리가 되 도록 멀리 떨어져 있는 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 상기 수학식 2 와 같이 계산할 수 있다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학습하는 경우의 전체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 상기의 수학식들로 보여준 손실함수들은 단지 하나의 예일 뿐이고, 사용자의 선택과 응용에 따라서 다르게 구현 될 수도 있다. 예를 들어 는 교차 엔트로피 손실일 수도 있고, 는 클러스터에 속한 모든 원소들의 거리 에 대한 평균일 수도 있다. 또한, 상기 신경망 학습부는 이상 프레임을 하나도 포함하지 않는 정상 비디오 영상으로 학습하는 동작을 수행하는 정상 비디오 학습부를 포함할 수 있다. 우선 상기 정상 비디오 학습부가 정상 비디오 영상으로 학습하는 동작을 수행하기 위하여 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성할 수 있다. 앞서 설명한 바와 같이 상기 신경망을 학습하기 위해서는 각 세그먼트별로 이상 또는 정상의 판별 결과에 상응 하는 이상 또는 정상의 레이블링이 있어야 한다. 따라서 상기 정상 비디오 학습부는 상기 신경망의 중간 계층의 특징을 기반으로 상기 세그먼트들을 두 개의 그룹, 즉 두 개의 클러스터로 나누고, 상기 클러스터 별로 레이블링을 하여 정답셋으로 사용하는 것이다. 상기 정상 비디오 학습부는 상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하고, 다른 하나를 정 상2 클러스터로 선택할 수 있다. 즉, 모든 세그먼트가 정상임을 알고 있으므로 두 개의 클러스터 모두 정상 클 러스터가 되는 것이고, 세그먼트 단위의 신경망의 예측결과 정답셋도 모두 정상으로 하면 된다. 따라서 상기 세 그먼트 단위의 신경망의 예측에 대한 정답셋을 가지고 신경망 학습을 진행할 수 있다. 그리고 상기 정상 비디오 학습부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타내는 정답셋과 비교하여 손실함수1을 계산할 수 있다. 또한 상기 정상1 클러스터와 상기 정상2 클러스터를 비교하여 손실함수2를 계산할 수 있다. 그리고 상기 손실함수1과 상기 손실함수2를 종합하여 전체 손실함수를 계산할 수 있다. 그리고 상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례 하는 것일 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학식 1과 같이 정의될 수 있다. 상기 손실함수2는 역시 두 개의 클러스터의 비교를 통해 구 할 수 있다. 그리고 상기 두 개의 클러스터 모두가 정상을 나타내고 있으므로, 두 클러스터 간의 거리가 되도록 가까운 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 상기 수학식 4와 같이 계산할 수 있다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학습하는 경우의 전체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 상기 신경망 학습부는 이상 비디오 영상과 정상 비디오 영상을 다수 구축하고, 이상 비디오 영상으로 학습 하는 동작과 정상 비디오 영상으로 학습하는 동작을 결과가 수렴할 때까지 반복할 수 있다. 이 때 각각의 비디 오 영상을 학습할 때마다 클러스터링이 수행되고, 같은 비디오 영상이라고 하더라도 학습이 진행됨에 따라서 클 러스터링의 결과가 변화할 수 있다. 이상 비디오 영상으로 학습하는 경우, 클러스터링 결과에서 어느 클러스터 가 정상 또는 이상인지는 사전에 정의되지는 않고, 신경망의 출력 결과에 따라 정상으로 판별된 세그먼트가 더 많이 존재하는 클러스터가 정상 클러스터로 선택되는 것이다. 도 3은 도 2에 도시된 이상 비디오 학습부의 일 예를 나타낸 도면이다. 도 3을 참조하면, 이상 비디오 학습부는 이상클러스터 생성부, 레이블 생성부, 이상손실함수1 계산부, 이상손실함수2 계산부, 이상전체손실함수 계산부를 포함할 수 있다. 이상클러스터 생성부는 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스 터를 생성할 수 있다. 상기 이상 비디오 학습부가 상기 신경망을 학습하기 위해서는 각 세그먼트별로 이상 또는 정상의 판별 결 과에 상응하는 이상 또는 정상의 레이블링이 있어야 한다. 그러나 본 발명에서는 오로지 비디오 수준에서의 레 이블링, 즉 입력 비디오 영상이 이상 상황을 포함하고 있는지 여부만을 알고 있기 때문에 각 세그먼트 별로 어 떤 세그먼트가 이상 상황을 포함하고 어떤 세그먼트가 정상 세그먼트인지 알지 못한다. 이를 극복하기 위해서 신경망의 중간 계층의 특징을 사용하여, 본 발명에서는 세그먼트들을 클러스터링하는 방법을 제안한다. 여기서 클러스터링이란 세그먼트의 특징을 기반으로 비슷한 특징을 가진 세그먼트들끼리 한 그룹으로 묶는 것을 말한다. 따라서 상기 이상 비디오 학습부는 상기 세그먼트들을 두 개의 그룹, 즉 두 개의 클러스터로 나누 고, 상기 클러스터 별로 레이블링을 하여 정답셋으로 사용하는 것이다. 상기 이상클러스터 생성부는 상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하고, 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이상 클러스터로 선택할 수 있다. 즉, 두 개의 클러스터 중에서 신경망이 예측한 각 세그먼트에서 정상으로 예측한 세그먼트가 더 많이 분포하는 클러스터를 정상 클러스터로 선택하고, 나머지 클러스터를 이상 클러스터로 선택하는 것이다. 레이블 생성부는 상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상으로 레이블링하고, 상 기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 레이블링할 수 있다. 이와 같이 생성된 레 이블들을 상기 신경망의 예측결과 정답셋으로 설정할 수 있다. 상기와 같은 방법으로, 상기 이상 비디오 학습부는 세그먼트 단위의 상기 신경망의 예측결과 정답셋을 생 성하고, 상기 정답셋을 가지고 신경망 학습을 진행할 수 있는 것이다. 이상손실함수1 계산부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 레이블 생성부에 서 생성한 상기 신경망의 예측결과 정답셋과 비교하여 손실함수1를 계산할 수 있다. 또한 이상손실함수2 계산부 는 상기 이상클러스터 생성부에서 생성한 상기 정상 클러스터와 상기 이상 클러스터를 비교하여 손실 함수2를 계산할 수 있다. 그리고 이상전체손실함수 계산부는 상기 이상손실함수1 계산부에서 계산한 상기 손실함수1과 상기 이상손실함수2 계산부에서 계산한 상기 손실함수2를 종합하여 전체 손실함수를 계 산할 수 있다. 그리고 상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리 에 반비례하는 것일 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학식 1과 같이 정의될 수 있다. 상기 손실함수2는 두 개의 클러스터의 비교를 통해 구할 수 있다. 상기 두 개의 클러스터는 하나는 정상, 나머지는 이상을 나타내고 있으므로, 두 클러스터 간의 거리가 되 도록 멀리 떨어져 있는 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 상기 수학식 2 와 같이 계산할 수 있다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학습하는 경우의 전체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 상기의 수학식들로 보여준 손실함수들은 단지 하나의 예일 뿐이고, 사용자의 선택과 응용에 따라서 다르게 구현 될 수도 있다. 예를 들어 는 교차 엔트로피 손실일 수도 있고, 는 클러스터에 속한 모든 원소들의 거리 에 대한 평균일 수도 있다. 이상 비디오 학습부는 이상 비디오 영상을 다수 구축하고, 이상 비디오 영상으로 학습하는 동작을 결과가 수렴할 때까지 반복할 수 있다. 이 때 각각의 이상 비디오 영상을 학습할 때마다 클러스터링이 수행되고, 같은 비디오 영상이라고 하더라도 학습이 진행됨에 따라서 클러스터링의 결과가 변화할 수 있다. 이때, 클러스터링 결과에서 어느 클러스터가 정상 또는 이상인지는 사전에 정의되지는 않고, 신경망의 출력 결과에 따라 정상으로 판별된 세그먼트가 더 많이 존재하는 클러스터가 정상 클러스터로 선택되는 것이다. 도 4는 도 2에 도시된 정상 비디오 학습부의 일 예를 나타낸 도면이다. 도 4를 참조하면, 정상 비디오 학습부는 정상클러스터 생성부, 정상손실함수1 계산부, 정상손실 함수2 계산부, 정상전체손실함수 계산부를 포함할 수 있다. 정상클러스터 생성부는 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스 터를 생성할 수 있다. 상기 신경망을 학습하기 위해서는 각 세그먼트별로 이상 또는 정상의 판별 결과에 상응하는 이상 또는 정상의 레이블링이 있어야 한다. 따라서 상기 정상 비디오 학습부는 상기 신경망의 중간 계층의 특징을 기반으로 상기 세그먼트들을 두 개의 그룹, 즉 두 개의 클러스터로 나누고, 상기 클러스터 별로 레이블링을 하여 정답셋 으로 사용하는 것이다. 상기 정상클러스터 생성부는 상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하고, 다른 하나를 정상2 클러스터로 선택할 수 있다. 즉, 모든 세그먼트가 정상임을 알고 있으므로 두 개의 클러스터 모두 정상 클러스터가 되는 것이고, 세그먼트 단위의 신경망의 예측결과 정답셋도 모두 정상으로 하면 된다. 따라서 상기 세그먼트 단위의 신경망의 예측에 대한 정답셋을 가지고 신경망 학습을 진행할 수 있다. 정상손실함수1 계산부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타내는 정답셋과 비교하여 손실함수1을 계산할 수 있다. 또한 정상손실함수2 계산부는 상기 정상1 클러스터와 상기 정상2클러스터를 비교하여 손실함수2를 계산할 수 있다. 그리고 정상전체손실함수 계산부는 상기 정상손실함수1 계산부에서 계산한 상기 손실함수1과 상기 정상손실함수2 계산부에서 계산한 상기 손실함수2를 종합 하여 전체 손실함수를 계산할 수 있다. 그리고 상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클 러스터의 중심 사이의 거리에 비례하는 것일 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학식 1과 같이 정의될 수 있다. 상기 손실함수2는 역시 두 개의 클러스터의 비교를 통해 구 할 수 있다. 그리고 상기 두 개의 클러스터 모두가 정상을 나타내고 있으므로, 두 클러스터 간의 거리가 되도록 가까운 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 상기 수학식 4와 같이 계산할 수 있다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학습하는 경우의 전체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 정상 비디오 학습부는 정상 비디오 영상을 다수 구축하고, 정상 비디오 영상으로 학습하는 동작을 결과가 수렴할 때까지 반복할 수 있다. 이 때 각각의 비디오 영상을 학습할 때마다 클러스터링이 수행되고, 같은 비디 오 영상이라고 하더라도 학습이 진행됨에 따라서 클러스터링의 결과가 변화할 수 있다. 도 5는 도 2에 도시된 이상 비디오 학습부의 활용예를 나타낸 도면이다. 도 5를 참조하면, 이상 프레임을 포함하는 이상 비디오 영상이 세그먼트 생성부에 입력된다. 상기 이상 비 디오 영상에서 각 사각형은 비디오 영상의 프레임을 나타내고 각 사각형 중 진한 색으로 표시된 것은 이상 프레임을 나타낸다. 이후 세그먼트 생성부에서 이상 비디오 영상의 각 프레임을 선택된 개수만큼묶어 세그먼트들을 생성한다. 그리고 상기 세그먼트들이 신경망의 입력으로 들어가게 되고, 이상클러스터 생성부는 신경망의 중간 계층 의 특징을 기반으로 두 개의 클러스터를 생성한다. 그리고 상기 두 개의 클러스터 중 상기 신경망이 정상 으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하고, 나머지 클러스터를 이 상 클러스터로 선택할 수 있다. 그리고 레이블 생성부는 상기 정상 클러스터에 속해 있는 세그먼트들의 레이블을 정상으로 레이블링하고, 상기 이상 클러스터에 속해 있는 세그먼트들의 레이블을 이상으로 레이블링할 수 있다. 이와 같이 생성된 레이블들을 상기 신경망의 예측결과 정답셋으로 설정할 수 있다. 이렇게 하여 이상 비디오 학습부는 세그먼트 단위의 상기 신경망의 예측결과 정답셋을 생성하고, 상기 정답셋을 가지고 신경망 학습을 진행할 수 있는 것이다. 이상손실함수1 계산부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 레이블 생성부에서 생 성한 상기 신경망의 예측결과 정답셋과 비교하여 손실함수1을 계산할 수 있다. 또한 이상손실함수2 계산부는 상기 이상클러스터 생성부에서 생성한 상기 정상 클러스터와 상기 이상 클러스터를 비교하 여 손실함수2를 계산할 수 있다. 이 때, 상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스 터의 중심 사이의 거리에 반비례하는 것일 수 있다. 이후 이상전체손실함수 계산부는 상기 손실함수1과 상기 손 실함수2를 종합하여 전체 손실함수를 계산할 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학식 1과 같이 정의될 수 있다. 상기 손실함수2는 두 개의 클러스터의 비교를 통해 구할 수 있다. 상기 두 개의 클러스터는 하나는 정상, 나머지는 이상을 나타내고 있으므로, 두 클러스터 간의 거리가 되 도록 멀리 떨어져 있는 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 상기 수학식 2 와 같이 계산할 수 있다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학습하는 경우의 전체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 상기의 수학식들로 보여준 손실함수들은 단지 하나의 예일 뿐이고, 사용자의 선택과 응용에 따라서 다르게 구현 될 수도 있다. 예를 들어 는 교차 엔트로피 손실일 수도 있고, 는 클러스터에 속한 모든 원소들의 거리 에 대한 평균일 수도 있다. 도 6은 도 2에 도시된 정상 비디오 학습부의 활용예를 나타낸 도면이다. 도 6을 참조하면, 이상 프레임을 하나도 포함하지 않는 정상 비디오 영상이 세그먼트 생성부에 입력된다. 상기 정상 비디오 영상에서 각 사각형은 비디오 영상의 프레임이고, 모두 정상 프레임을 나타낸다. 이후 세그먼트 생성부에서 이상 비디오 영상의 각 프레임들을 선택된 개수만큼 묶어 세그먼트들을 생성한 다. 그리고 상기 세그먼트들이 신경망의 입력으로 들어가게 되고, 정상클러스터생성부는 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성한다. 그리고 상기 두 개의 클러스터 중 하나를 정상1 클러스터 로 선택하고, 다른 하나를 정상2 클러스터로 선택할 수 있다. 즉, 모든 세그먼트가 정상임을 알고 있 으므로 두 개의 클러스터 모두 정상 클러스터가 되는 것이고, 세그먼트 단위의 신경망의 예측결과 정답셋 도 모두 정상으로 하면 된다. 따라서 상기 세그먼트 단위의 신경망의 예측에 대한 정답셋을 가지고 신경망 학습 을 진행할 수 있다. 정상손실함수1 계산부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타내는 정답셋 과 비교하여 손실함수1을 계산할 수 있다. 또한 정상손실함수2 계산부는 상기 정상1 클러스터와 상기 정상2 클러스터를 비교하여 손실함수2를 계산할 수 있다. 이 때, 상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례하는 것일 수 있다. 이후 정상전체손실함수 계산부는 상기 손실함수1과 상기 손실함수2를 종합하여 전체 손실함수를 계산할 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학식 1과 같이 정의될 수 있다. 상기 손실함수2는 역시 두 개의 클러스터의 비교를 통해 구 할 수 있다. 그리고 상기 두 개의 클러스터 모두가 정상을 나타내고 있으므로, 두 클러스터 간의 거리가 되도록 가까운 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 상기 수학식 4와 같이 계산할 수 있다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학습하는 경우의 전체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 도 7은 실시예에 따른 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법의 일 예를 나타낸 동작 흐름도 이다. 도 7을 참조하면, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치의 세그먼트 생성부에 비디오 영상이 입력된다(S710). 세그먼트 생성부는 입력된 비디오 영상으로부터 선택된 개수의 프레임을 묶어 세그먼트들을 생성한다(S720). 상 기 이상 탐지 장치는 상기 선택된 개수(한 세그먼트를 구성하는 프레임의 개수)가 1이 되면 프레임 수준에서 이 상 및 정상을 판단할 수 있는 시스템이 되고, 1보다 크게 되면 세그먼트 수준에서 이상 및 정상을 판단할 수 있 는 시스템이 될 수 있다. 신경망 학습부는 상기 세그먼트들을 입력으로 한 신경망의 중간 계층의 특징을 기반으로 신경망을 학습한다 (S730). 만약 상기 신경망의 학습이 완료되면, 신경망 학습 단계(S730)를 생략할 수 있다. 우선 신경망 학습부는 적어도 하나 이상의 이상 프레임을 포함하는 이상 비디오 영상으로 학습하는 동작을 수행 할 수 있다. 신경망 학습부가 이상 비디오 영상으로 학습하는 동작을 수행하기 위하여 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성할 수 있다. 상기 신경망 학습부는 상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하고, 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이상 클러스터 로 선택할 수 있다. 즉, 두 개의 클러스터 중에서 신경망이 예측한 각 세그먼트에서 정상으로 예측한 세그먼트 가 더 많이 분포하는 클러스터를 정상 클러스터로 선택하고, 나머지 클러스터를 이상 클러스터로 선택하는 것이다. 상기 신경망 학습부는 상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상으로 레이블링하고, 상 기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 레이블링할 수 있다. 이와 같이 생성된 레이블들을 상기 신경망의 예측결과 정답셋으로 설정할 수 있다. 상기 신경망 학습부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 신경망의 예측결과 정답셋과 비교하여 손실함수1를 계산할 수 있다. 또한 상기 정상 클러스터와 상기 이상 클러스터를 비교하여 손실함수2를 계산할 수 있다. 그리고 상기 손실함수1과 상기 손실함수2를 종합하여 전체 손실함수를 계산할 수 있다. 그리고 상기 손실함수2는 상기 정상 클러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리에 반비례하는 것일 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 최종 값(출력 또는 예측 값)과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학식 1과 같이 정의될 수 있다. 상기 손실함수2는 두 개의 클러스터의 비교를 통해 구할 수 있다. 상기 두 개의 클러스터는 하나는 정상, 나머지는 이상을 나타내고 있으므로, 두 클러스터 간의 거리가 되 도록 멀리 떨어져 있는 것이 바람직하다. 따라서 두 클러스터 간의 거리를 이용하여 손실함수2를 상기 수학식 2 와 같이 계산할 수 있다. 이상과 같이 손실함수에 세그먼트와 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학습하는 경우의 전체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 또한, 신경망 학습부는 이상 프레임을 하나도 포함하지 않는 정상 비디오 영상으로 학습하는 동작을 수행할 수 있다. 우선 상기 신경망 학습부가 정상 비디오 영상으로 학습하는 동작을 수행하기 위하여 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으로 두 개의 클러스터를 생성할 수 있다. 상기 신경망 학습부는 상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하고, 다른 하나를 정상2 클러스 터로 선택할 수 있다. 즉, 모든 세그먼트가 정상임을 알고 있으므로 두 개의 클러스터 모두 정상 클러스터가 되 는 것이고, 세그먼트 단위의 신경망의 예측결과 정답셋도 모두 정상으로 하면 된다. 따라서 상기 세그먼트 단위 의 신경망의 예측에 대한 정답셋을 가지고 신경망 학습을 진행할 수 있다. 그리고 상기 신경망 학습부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나타내는 정답셋과 비교하여 상기 수학식 1과 같이 손실함수1을 계산할 수 있다. 또한 상기 정상1 클러스터와 상기 정상2 클러스터 를 비교하여 상기 손실함수2를 계산할 수 있다. 그리고 상기 손실함수1과 상기 손실함수2를 종합하여 전체 손실 함수를 계산할 수 있다. 그리고 상기 손실함수2는 상기 정상1 클러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례하는 것일 수 있다. 상기 손실함수1은 각 세그먼트의 신경망의 예측값과 정답셋을 비교하여 얻을 수 있는데, 그 수학식은 상기 수학 식 1과 같이 정의될 수 있다. 상기 손실함수2는 두 개의 클러스터의 비교를 통해 구할 수 있다. 그리고 상기 두 개의 클러스터 모두가 정상을 나타내고 있으므로, 두 클러스터 간의 거리가 되도록 가까운 것이 바람직하다. 따 라서 두 클러스터 간의 거리를 사용하여 손실함수2를 상기 수학식 4와 같이 계산할 수 있다. 이상과 같이 손실 함수에 세그먼트 및 클러스터의 두 가지 요소를 고려할 수 있으므로, 이상 비디오를 가지고 학습하는 경우의 전 체 손실 함수는 상기 수학식 3과 같이 정의될 수 있다. 이상 검출부는 세그먼트 생성부에서 생성한 세그먼트들을 신경망 학습부에서학습된 신경망에 입력하여 상기 세 그먼트 단위로 이상을 검출하고(S740), 세그먼트 단위의 이상 검출결과가 생성된다(S750). 도 8은 실시예에 따른 도 7에 도시된 신경망 학습(S730)의 일 예를 나타낸 동작 흐름도이다. 도 8을 참조하여, 이상 비디오 영상을 입력으로 받은 경우, 신경망 학습부가 신경망을 학습하는 방법을 설명한 다. 우선 세그먼트 생성부에서 생성된 세그먼트를 신경망에 입력한다(S810). 이상 비디오 학습부의 이상클러스터 생성부는 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으 로 두 개의 클러스터를 생성한다(S820). 이때, 상기 두 개의 클러스터 중 상기 신경망이 정상으로 예측한 정상 세그먼트의 수가 더 많은 클러스터를 정상 클러스터로 선택하고, 상기 정상 클러스터로 선택되지 않은 나머지 클러스터를 이상 클러스터로 선택할 수 있다. 즉, 두 개의 클러스터 중에서 신경망이 예측한 각 세그먼트에서 정상으로 예측한 세그먼트가 더 많이 분포하는 클러스터를 정상 클러스터로 선택하고, 나머지지 클러스터를 이 상 클러스터로 선택하는 것이다. 이상 비디오 학습부의 레이블 생성부는 상기 정상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 정상으로 레이블링하고, 상기 이상 클러스터에 속해 있는 모든 세그먼트들의 레이블을 이상으로 레이블링한다(S830). 이 와 같이 생성된 레이블들을 상기 신경망의 예측결과 정답셋으로 설정할 수 있다. 이상 비디오 학습부의 이상손실함수1 계산부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 상기 신경 망의 예측결과 정답셋과 비교하여 상기 수학식1과 같이 손실함수1를 계산한다(S840). 또한 이상 비디오 학습부 의 이상손실함수2 계산부는 상기 정상 클러스터와 상기 이상 클러스터를 비교하여 상기 수학식2와 같이 손실함 수2를 계산한다(S850). 그리고 이상 비디오 학습부의 이상전체손실함수 계산부는 상기 손실함수1과 상기 손실함 수2를 종합하여 상기 수학식3과 같이 전체 손실함수를 계산한다(S860). 그리고 상기 손실함수2는 상기 정상 클 러스터의 중심과 상기 이상 클러스터의 중심 사이의 거리에 반비례하는 것일 수 있다. 도 9는 실시예에 따른 도 7에 도시된 신경망 학습(S730)의 다른 일 예를 나타낸 동작 흐름도이다. 도 9를 참조하여, 정상 비디오 영상을 입력으로 받은 경우, 신경망 학습부가 신경망을 학습하는 방법을 설명한 다. 우선 세그먼트 생성부에서 생성된 세그먼트를 신경망에 입력한다(S910). 정상 비디오 학습부의 정상클러스터 생성부는 상기 세그먼트에 대한 상기 신경망의 중간 계층의 특징을 기반으 로 두 개의 클러스터를 생성한다(S920). 이때, 상기 두 개의 클러스터 중 하나를 정상1 클러스터로 선택하고, 다른 하나를 정상2 클러스터로 선택할 수 있다. 즉, 모든 세그먼트가 정상임을 알고 있으므로 두 개의 클러스터 모두 정상 클러스터가 되는 것이고, 세그먼트 단위의 신경망의 예측에 대한 정답셋도 모두 정상으로 하면 된다. 따라서 상기 세그먼트 단위의 신경망의 예측에 대한 정답셋을 가지고 신경망 학습을 진행할 수 있다. 정상 비디오 학습부의 정상손실함수1 계산부는 상기 세그먼트들을 입력으로 한 신경망의 최종 값들을 정상을 나 타내는 정답셋과 비교하여 상기 수학식 1과 같이 손실함수1을 계산한다(S930). 또한 정상 비디오 학습부의 정상 손실함수2 계산부는 상기 정상1 클러스터와 상기 정상2 클러스터를 비교하여 상기 수학식4와 같이 상기 손실함 수2를 계산한다(S940). 그리고 정상 비디오 학습부의 정상전체손실함수 계산부는 상기 손실함수1과 상기 손실함 수2를 종합하여 상기 수학식3과 같이 전체 손실함수를 계산한다(S950). 그리고 상기 손실함수2는 상기 정상1 클 러스터의 중심과 상기 정상2 클러스터의 중심 사이의 거리에 비례하는 것일 수 있다. 도 10은 실시예에 따른 컴퓨터 시스템 구성을 나타낸 도면이다. 실시예에 따른 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치는 컴퓨터로 읽을 수 있는 기록매체와 같은 컴퓨터 시스템에서 구현될 수 있다. 컴퓨터 시스템은 버스를 통하여 서로 통신하는 하나 이상의 프로세서, 메모리, 사용자 인터페이스 입력 장치, 사용자 인터페이스 출력 장치 및 스토리지를 포함할 수 있다. 또한, 컴퓨터 시스템은 네트워크에 연결되는 네트워크 인터페이스를 더 포함할 수 있다. 프로세서 는 중앙 처리 장치 또는 메모리나 스토리지에 저장된 프로그램 또는 프로세싱 인스트럭션들 을 실행하는 반도체 장치일 수 있다. 메모리 및 스토리지는 휘발성 매체, 비휘발성 매체, 분리형 매체, 비분리형 매체, 통신 매체, 또는 정보 전달 매체 중에서 적어도 하나 이상을 포함하는 저장 매체일 수 있 다. 예를 들어, 메모리는 ROM이나 RAM을 포함할 수 있다. 이상에서 설명된 실시예에 따르면, 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법및 이를 위한 장치 를 제공함으로써 비디오 수준에서의 레이블링 정보, 즉 비디오가 이상 상황을 포함하는지 여부를 나타내는 정보 만을 가지고 프레임 수준에서의 이상을 탐지할 수 있는 이상 탐지 시스템을 제공할 수 있다. 또한 이상 비디오 영상 또는 정상 비디오 영상을 이용하여 이상 탐지에 사용될 인공지능 신경망을 학습하는 방 법을 제공할 수 있다."}
{"patent_id": "10-2020-0029466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "이상에서 첨부된 도면을 참조하여 본 발명의 실시예들을 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시 될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다.부호의 설명 100: 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치 110: 비디오 입력 영상 120: 세그먼트 생성부 130: 신경망 학습부 140: 이상 검출부 150: 세그먼트 단위 이상 검출 결과"}
{"patent_id": "10-2020-0029466", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 장치의 일 예를 나타낸 블록도이다. 도 2는 도 1에 도시된 신경망 학습부의 일 예를 나타낸 블록도이다. 도 3은 도 2에 도시된 이상 비디오 학습부의 일 예를 나타낸 도면이다. 도 4는 도 2에 도시된 정상 비디오 학습부의 일 예를 나타낸 도면이다. 도 5는 도 2에 도시된 이상 비디오 학습부의 활용예를 나타낸 도면이다. 도 6은 도 2에 도시된 정상 비디오 학습부의 활용예를 나타낸 도면이다. 도 7은 실시예에 따른 비디오 영상 프레임의 세그먼팅을 이용한 이상 탐지 방법의 일 예를 나타낸 동작 흐름도 이다. 도 8은 실시예에 따른 도 7에 도시된 신경망 학습(S730)의 일 예를 나타낸 동작 흐름도이다. 도 9는 실시예에 따른 도 7에 도시된 신경망 학습(S730)의 다른 일 예를 나타낸 동작 흐름도이다. 도 10은 실시예에 따른 컴퓨터 시스템 구성을 나타낸 도면이다."}
