{"patent_id": "10-2024-0166504", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0169572", "출원번호": "10-2024-0166504", "발명의 명칭": "이미지 획득 장치 및 그의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "정재호"}}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이미지 획득 장치가 이미지를 제공하는 방법에 있어서, 상기 이미지 획득 장치의 카메라를 통해, 복수의 객체를 포함하는 제1 이미지를 획득하는 단계;상기 제1 이미지에서 영역을 선택하는 입력을 수신하는 단계;제1 학습 모델을 이용하여, 상기 복수의 객체 중에서 상기 선택된 영역에 포함된 객체를 검출하는 단계;제2 학습 모델을 이용하여, 상기 검출된 객체에 의해 가려진 영역에 대응하는 데이터를 다른 데이터로 대체하기위한 이미지 데이터를 포함하는 제2 이미지를 생성하는 단계; 및상기 이미지 획득 장치의 디스플레이를 이용하여, 상기 제2 이미지를 표시하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 검출된 객체는 사람인, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 제1 학습 모델은, 주어진 이미지에서 제거할 적어도 하나의 객체를 식별하도록 훈련되는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 제1 학습 모델은, 상기 제1 이미지에서 주 대상체 및 부 대상체를 검출하는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 제2 학습 모델은, 상기 검출된 객체에 의해 가려진 영역에 대응하는 데이터를 복원하도록 훈련되는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 제2 이미지를 생성하는 단계는, 상기 검출된 객체와 연관된 데이터를 제거하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 검출된 객체와 연관된 데이터는 제3 학습 모델을 이용하여 제거되고, 상기 제3 학습 모델은 부 대상체가 위치하는 영역과 연관된 데이터를 제거하도록 훈련되는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 제2 이미지를 생성하는 단계는, 상기 제1 이미지에 포함된 상기 검출된 객체에 대응하는 영역의 데이터를 상기 검출된 객체에 의해 가려진 배경영역에 대응하는 데이터로 대체하는 단계를 포함하는, 방법. 공개특허 10-2024-0169572-3-청구항 9 제1항에 있어서, 상기 방법은, 상기 객체를 검출하는 것에 기반하여, 상기 검출된 객체를 나타내는 인디케이터를 표시하는 단계를 더포함하는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 인디케이터를 표시하는 단계는, 상기 검출된 객체를 기 설정된 색상 및 기 설정된 패턴 중 적어도 하나로 중첩하여 표시하는 단계를 포함하는,방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 제2 이미지를 생성하는 단계는, 상기 검출된 객체에 의해 가려진 다른 객체의 일부를 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 제2 학습 모델은 생성형 AI 모델을 포함하는, 방법."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "이미지 획득 장치에 있어서, 디스플레이;카메라;적어도 하나의 프로세서; 및인스트럭션들을 저장하는 메모리를 포함하고,상기 적어도 하나의 프로세서가 상기 메모리에 저장된 인스트럭션들을 실행함으로써, 상기 이미지 획득 장치는, 복수의 객체를 포함하는 제1 이미지를 획득하도록 상기 카메라를 제어하고, 상기 제1 이미지에서 영역을 선택하는 입력을 수신하고,제1 학습 모델을 이용하여, 상기 복수의 객체 중에서 상기 선택된 영역에 포함된 객체를 검출하고,제2 학습 모델을 이용하여, 상기 검출된 객체에 의해 가려진 영역에 대응하는 데이터를 다른 데이터로 대체하기위한 이미지 데이터를 포함하는 제2 이미지를 생성하고,상기 제2 이미지를 표시하도록 상기 디스플레이를 제어하는, 이미지 획득 장치."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 검출된 객체는 사람인, 이미지 획득 장치."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서, 상기 제1 학습 모델은, 주어진 이미지에서 제거할 적어도 하나의 객체를 식별하도록 훈련되고,상기 제1 학습 모델은, 상기 제1 이미지에서 주 대상체 및 부 대상체를 검출하는, 이미지 획득 장치."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2024-0169572-4-제13항에 있어서, 상기 제2 학습 모델은, 상기 검출된 객체에 의해 가려진 영역에 대응하는 데이터를 복원하도록 훈련되는, 이미지 획득 장치."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서, 상기 이미지 획득 장치는,제3 학습 모델을 이용하여 상기 검출된 객체와 연관된 데이터를 제거하고, 상기 제3 학습 모델은 부 대상체가 위치하는 영역과 연관된 데이터를 제거하도록 훈련되는, 이미지 획득 장치."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서, 상기 이미지 획득 장치는, 상기 객체를 검출하는 것에 기반하여, 상기 검출된 객체를 나타내는 인디케이터를 표시하도록 상기 디스플레이를 제어하는, 이미지 획득 장치."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 이미지 획득 장치는, 상기 검출된 객체를 기 설정된 색상 및 기 설정된 패턴 중 적어도 하나로 중첩하여 표시하는, 이미지 획득장치."}
{"patent_id": "10-2024-0166504", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제13항에 있어서, 상기 이미지 획득 장치는, 상기 검출된 객체에 의해 가려진 다른 객체의 일부를 생성하는, 이미지 획득 장치."}
{"patent_id": "10-2024-0166504", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 딥러닝 등의 기계 학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 인공지능 (AI) 시스템 및 그 응용에 관련된 것이다. 구체적으로, 제1 이미지를 획득하는 카메라, 상기 제1 이미지를 제1 인공지능 신경망에 입력함으로써 상기 제1 이미지 내에 포함된 복수의 대상체들 중에서 주 대상체 및 부 대상체 를 검출하고, 상기 제1 이미지 내에서 상기 부 대상체를 제거하며, 제2 인공지능 신경망을 이용하여 상기 제거된 부 대상체에 의해 가려진 상기 주 대상체의 적어도 일부를 복원하여 제2 이미지를 생성하는 적어도 하나의 프로 세서 및 상기 제1 이미지 및 제2 이미지 중 적어도 하나를 디스플레이하는 디스플레이부를 포함하는, 이미지 획 득 장치를 개시한다."}
{"patent_id": "10-2024-0166504", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 이미지를 획득하는 장치 및 그의 제어 방법에 관한 것이다."}
{"patent_id": "10-2024-0166504", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능(Artificial Intelligence, AI) 시스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템이며, 기존 규칙 기반 스마트 시스템과 달리 기계가 스스로 학습하고 판단하며 똑똑해지는 시스템이다. 인공지능 시스템은 사용 할수록 인식률이 향상되고 사용자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 규칙 기반 스마트 시스템은 점차 딥러닝 기반 인공지능 시스템으로 대체되고 있다. 인공지능 기술은 기계학습(딥러닝) 및 기계학습을 활용한 요소 기술들로 구성된다. 기계학습은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘 기술이며, 요소기술은 딥러닝 등의 기계학 습 알고리즘을 활용하는 기술로서, 언어적 이해, 시각적 이해, 추론/예측, 지식 표현, 동작 제어 등의 기술 분 야로 구성된다. 인공지능 기술이 응용되는 다양한 분야는 다음과 같다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리 하는 기술로서, 자연어 처리, 기계 번역, 대화시스템, 질의 응답, 음성 인식/합성 등을 포함한다. 시각적 이해 는 사물을 인간의 시각처럼 인식하여 처리하는 기술로서, 객체 인식, 객체 추적, 영상 검색, 사람 인식, 장면 이해, 공간 이해, 영상 개선 등을 포함한다. 추론 예측은 정보를 판단하여 논리적으로 추론하고 예측하는 기술 로서, 지식/확률 기반 추론, 최적화 예측, 선호 기반 계획, 추천 등을 포함한다. 지식 표현은 인간의 경험정보 를 지식데이터로 자동화 처리하는 기술로서, 지식 구축(데이터 생성/분류), 지식 관리(데이터 활용) 등을 포함 한다. 동작 제어는 차량의 자율 주행, 로봇의 움직임을 제어하는 기술로서, 움직임 제어(항법, 충돌, 주행), 조작 제어(행동 제어) 등을 포함한다. 또한, 인공지능 기술은 사진이나 동영상과 같은 이미지를 획득하는데도 이용될 수 있다."}
{"patent_id": "10-2024-0166504", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일부 실시예는, 이미지 내의 주 대상체와 부 대상체를 구별하는 이미지 획득 장치를 제공할 수 있다. 다른 실시예는, 이미지 내의 부 대상체를 사용자가 용이하게 인지할 수 있도록 디스플레이하는 이미지 획득 장 치를 제공할 수 있다. 또 다른 실시예는, 이미지 내의 부 대상체를 제거하여 디스플레이하는 이미지 획득 장치를 제공할 수 있다. 또 다른 실시예는, 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 복원된 이미지를 획득하는 이미지 획 득 장치를 제공할 수 있다. 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 이하의 실시예 들로부터 또 다른 기술적 과제들이 유추될 수 있다."}
{"patent_id": "10-2024-0166504", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 개시의 제1 측면은 인공지능 신경망을 이용하여 이 미지를 획득하는 방법에 있어서, 카메라를 이용하여 제1 이미지를 획득하는 단계, 상기 제1 이미지를 제1 인공 지능 신경망에 입력함으로써, 상기 제1 이미지 내에 포함된 복수의 대상체들 중에서 주 대상체 및 부 대상체를 검출하는 단계, 상기 제1 이미지 내에서 상기 부 대상체를 제거하는 단계 및 제2 인공지능 신경망을 이용하여 상기 제거된 부 대상체에 의해 가려진 상기 주 대상체의 적어도 일부를 복원하여 제2 이미지를 생성하는 단계를 포함하는, 방법을 제공할 수 있다. 또한, 본 개시의 제2 측면은, 제1 이미지를 획득하는 카메라, 상기 제1 이미지를 제1 인공지능 신경망에 입력함 으로써 상기 제1 이미지 내에 포함된 복수의 대상체들 중에서 주 대상체 및 부 대상체를 검출하고, 상기 제1 이 미지 내에서 상기 부 대상체를 제거하며, 제2 인공지능 신경망을 이용하여 상기 제거된 부 대상체에 의해 가려 진 상기 주 대상체의 적어도 일부를 복원하여 제2 이미지를 생성하는 적어도 하나의 프로세서 및 상기 제1 이미 지 및 제2 이미지 중 적어도 하나를 디스플레이하는 디스플레이부를 포함하는, 이미지 획득 장치를 제공할 수 있다. 또한, 본 개시의 제3 측면은, 인공지능 신경망을 이용하여 이미지를 획득하는 방법이 기록된 컴퓨터로 읽을 수 있는 저장 매체를 포함하는 컴퓨터 프로그램 제품에 있어서, 상기 저장 매체는, 카메라를 이용하여 제1 이미지 를 획득하는 단계, 상기 제1 이미지를 제1 인공지능 신경망에 입력함으로써, 상기 제1 이미지 내에 포함된 복수 의 대상체들 중에서 주 대상체 및 부 대상체를 검출하는 단계, 상기 제1 이미지 내에서 상기 부 대상체를 제거 하는 단계 및 제2 인공지능 신경망을 이용하여 상기 제거된 부 대상체에 의해 가려진 상기 주 대상체의 적어도 일부를 복원하여 제2 이미지를 생성하는 단계를 수행하는 명령어들을 포함하는, 컴퓨터 프로그램 제품을 제공할 수 있다."}
{"patent_id": "10-2024-0166504", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시의 일부 실시예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블 록들의 일부 또는 전부는, 특정 기능들을 실행하는 다양한 개수의 하드웨어 및/또는 소프트웨어 구성들로 구현 될 수 있다. 예를 들어, 본 개시의 기능 블록들은 하나 이상의 마이크로프로세서들에 의해 구현되거나, 소정의 기능을 위한 회로 구성들에 의해 구현될 수 있다. 또한, 예를 들어, 본 개시의 기능 블록들은 다양한 프로그래 밍 또는 스크립팅 언어로 구현될 수 있다. 기능 블록들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 개시는 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기술 을 채용할 수 있다. “매커니즘”, “요소”, “수단” 및 “구성”등과 같은 용어는 넓게 사용될 수 있으며, 기계적이고 물리적인 구성들로서 한정되는 것은 아니다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서는 대체 가능하거나 추가된 다양한 기능적인 연결, 물 리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 나타내어질 수 있다. 또한, 본 명세서에서 사용되는 “제 1” 또는 “제 2” 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들 을 설명하는데 사용할 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들 은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로만 사용된다. 또한, 본 명세서에서 사용되는 용어 중 주 대상체는 이미지 획득 장치를 이용하는 사용자가 이미지에 포 함하고자 하는 대상체를 의미하고, 부 대상체는 사용자가 이미지에 포함하지 않고자 하는 대상체를 의미한다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 일부 실시예에 따른, 이미지 획득 장치가 이미지를 획득하는 예시를 나타내는 도면이다. 도 1을 참조하면, 이미지 획득 장치는 이미지 획득 장치에 포함된 카메라를 이용하여 이미지를 획 득할 수 있다. 이미지 획득 장치가 획득하는 이미지에는 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c)가 포함될 수 있다. 이미지 획득 장치는 획득된 이미지로부터 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c) 를 검출할 수 있다. 이미지 획득 장치는 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c)를 검출한 결과에 기초하여 부 대상체(2a, 2b, 2c)를 이미지로부터 제거하고, 부 대상체(2a, 2b, 2c)에 의해서 가려진 주 대상체 (1b)의 적어도 일부를 복원함으로써 이미지를 획득할 수 있다. 이미지 획득 장치에서 획득되는 이미지는 이미지 획득 장치에 저장될 최종 이미지 및 최종 이미지 를 획득하기 위해서 이미지 획득 장치에 디스플레이되는 프리뷰 이미지를 포함할 수 있다. 이미지 획득 장치는 학습 모델을 이용하여 획득된 이미지 내에 포함된 주 대상체(1a, 1b) 및 부 대 상체(2a, 2b, 2c) 중 적어도 하나를 검출할 수 있다. 또한, 이미지 획득 장치는 학습 모델을 이용 하여 부 대상체(2a, 2b, 2c)에 의해서 가려진 주 대상체(1b)의 적어도 일부를 복원할 수 있다. 학습 모델은 복수개의 학습 모델을 포함할 수 있다. 즉, 다양한 용도들의 각각에 대응하는 학습 모델들 은 학습 모델로 통칭될 수 있다. 예를 들면, 학습 모델은 이미지내에 포함된 복수의 대상체들 중에 서 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c)를 검출하는 제1 학습 모델 및 부 대상체(2a, 2b, 2c)에 의해 서 가려진 주 대상체(1b)의 적어도 일부를 복원하는 제2 학습 모델을 포함할 수 있다. 이하에서는, 개시된 실 시예들을 구현하기 위한 다양한 학습 모델들을 통칭하여 학습 모델로 지칭하여 설명한다. 학습 모델은, 인식 모델의 적용 분야, 학습의 목적 또는 장치의 컴퓨터 성능 등을 고려하여 구축될 수 있 다. 학습 모델은, 예를 들어, 인공지능 신경망(Neural Network)을 기반으로 하는 모델일 수 있다. 예컨대, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 및 GAN(Generative Adversarial Networks)과 같은 모델이 학습 모델로 이용될 수 있으나, 이에 한정 되지 않는다. 본 개시의 일 실시예에 따르면, 학습 모델은 이미지 내에 포함된 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c) 중 적어도 하나를 검출하기 위해 학습 데이터를 기 설정된 기준에 의한 학습할 수 있다. 예를 들어, 학습 모델은 학습 데이터를 지도 학습(supervised learning), 비지도 학습(unsupervised learning) 및 강화 학습(reinforcement learning)함으로써, 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c) 중 적어도 하나를 검출할 수 있다. 또한, 학습 모델은 학습 데이터를 심층신경망(Deep Neural Network) 기술에 따라서 학 습함으로써, 이미지 내에 포함된 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c) 중 적어도 하나를 검출할 수 있 다. 본 개시의 일 실시예에 따르면, 학습 모델은 부 대상체(2a, 2b, 2c)에 의해서 가려진 주 대상체(1b)의 적 어도 일부를 복원하기 위해 학습 데이터를 기 설정된 기준에 의한 학습할 수 있다. 예를 들어, 학습 모델 은 학습 데이터를 지도 학습(supervised learning), 비지도 학습(unsupervised learning) 및 강화 학습 (reinforcement learning)함으로써, 부 대상체(2a, 2b, 2c)에 의해서 가려진 주 대상체(1b)의 적어도 일부를복원할 수 있다. 또한, 학습 모델은 학습 데이터를 심층신경망(Deep Neural Network) 기술에 따라서 학 습함으로써, 부 대상체(2a, 2b, 2c)에 의해서 가려진 주 대상체(1b)의 적어도 일부를 복원할 수 있다. 본 개시의 일 실시예에 따르면, 사용자는 프리뷰 이미지 또는 최종 이미지 중 적어도 하나를 주 대상체만이 포 함된 이미지로 획득할 수 있다. 도 2는 일부 실시예에 따른, 이미지 획득 장치가 이미지를 획득하는 방법에 관한 순서도이고, 도 3 내지 도 5는 일부 실시예에 따른, 부 대상체를 나타내는 표식을 디스플레이하는 예시를 나타내는 도면이다. 도 2를 참조하면, 이미지 획득 장치는 카메라를 이용하여 제1 이미지를 획득(S210)하고, 제1 이미지 내에 서 주 대상체 및 부 대상체 중 적어도 하나를 검출(S230)하며, 검출된 부 대상체를 나타내는 표식을 디스플레이 (S250)할 수 있다. 단계 S210을 참조하면, 이미지 획득 장치는 카메라를 이용하여 제1 이미지를 획득할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 이미지 획득 장치에 포함된 카메라를 이용하여 제1 이미 지를 획득할 수 있다. 또는, 이미지 획득 장치는 유선 및 무선 중 적어도 하나의 방식으로 연결된 외부 카메라로부터 이미지를 획득할 수 있다. 카메라를 이용하여 획득되는 제1 이미지는 이미지 획득 장치에 저장될 최종 이미지를 획득하기 위한 프리뷰 이미지를 포함할 수 있다. 프리뷰 이미지는 이미지 획득 장치 의 디스플레이부에 디스플레이되거나, 이미지 획득 장치와 유선 및 무선 중 적어도 하나의 방식으 로 연결된 외부 디스플레이 장치에 디스플레이될 수 있다. 단계 S230을 참조하면, 이미지 획득 장치는 제1 이미지 내에서 주 대상체 및 부 대상체를 검출할 수 있다. 주 대상체는 이미지 획득 장치를 이용하는 사용자가 최종 이미지에 포함하고자 하는 대상체를 포 함할 수 있다. 또한, 부 대상체는 사용자가 최종 이미지에 포함하지 않고자 하는 대상체를 포함할 수 있다. 도 3 내지 도 5를 참조하면, 이미지 획득 장치는 제1 이미지 내에서 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c)를 검출할 수 있다. 일 실시예에 따르면, 주 대상체(1a)는 사람을 포함할 수 있다. 예를 들면, 주 대상체(1a)는 이미지 획득 장치 의 사용자를 포함할 수 있다. 또는, 주 대상체(1a)는 이미지 획득 장치의 사용자와 관련된 사람을 포함할 수 있다. 구체적으로, 주 대상체(1a)는 사용자의 가족, 연인 및 친지를 포함할 수 있다. 일 실시예에 따르면, 주 대상체(1b)는 건물, 조형물 및 자연 경관을 포함할 수 있다. 예를 들면, 주 대상체 (1b)는 이미지 획득 장치가 위치된 지역의 랜드마크(landmark)를 포함할 수 있다. 또 다른 예를 들면, 주 대상체(1b)는 이미지 획득 장치의 인근에 위치된 조형물을 포함할 수 있다. 또 다른 예를 들면, 주 대상체(1b)는 하늘, 잔디밭, 호수 및 바다와 같은 자연 경관을 포함할 수 있다. 일 실시예에 따르면, 부 대상체(2a, 2b, 2c)는 사람을 포함할 수 있다. 예를 들면, 부 대상체(2a, 2b, 2c)는 사용자 인근에 위치한 사람을 포함할 수 있다. 구체적으로, 부 대상체(2a, 2b, 2c)는 사용자 인근을 지나는 행 인, 주 대상체(1b)를 배경으로 사진 촬영중인 사람, 사용자 인근에서 장사하는 사람을 포함할 수 있다. 일반적 으로, 부 대상체(2a, 2b, 2c)에 포함된 사람은 사용자와 무관한 사람일 수 있지만, 이에 한정되는 것은 아니다. 일 실시예에 따르면, 부 대상체는 특정 사물을 포함할 수 있다. 예를 들면, 부 대상체는 제1 이미지 내에서 주 대상체(1b)를 가리는 적어도 하나의 사물을 포함할 수 있다. 구체적으로, 부 대상체는 주 대상체(1b)를 가리는 나무, 휴지통, 가판대, 담벼락 및 철조망과 같은 사물을 포함할 수 있으나, 이에 한정되는 것은 아니다. 일 실시예에 따르면, 제1 이미지 내에서 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c)는 제1 이미지가 인공지능 신경망에 입력됨으로써 검출될 수 있다. 예를 들면, 이미지 획득 장치는 제1 이미지를 인공지능 신경망 에 입력하고, 인공지능 신경망은 학습데이터를 학습한 결과에 기초하여 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c)중 적어도 하나를 검출할 수 있다. 일 실시예에 따르면, 인공지능 신경망은 이미지 획득 장치에 저장된 적어도 하나의 이미지를 학습 데이터 로 이용하여 학습할 수 있다. 예를 들면, 인공지능 신경망은 이미지 획득 장치에 저장된 사용자의 얼굴 이 포함된 이미지, 사용자와 관련된 사람의 얼굴이 포함된 이미지를 학습 데이터로 이용할 수 있다. 이미지 획득 장치의 사용자는 사용자 및 사용자와 관련된 사람들의 얼굴이 포함된 사진을 촬영하는 경우 가 많으므로, 사용자의 얼굴이 포함된 이미지 및 사용자와 관련된 사람(사용자의 가족, 연인 및 친지)의 얼굴이 포함된 이미지는 이미지 획득 장치에 다수 저장될 수 있다. 따라서, 인공지능 신경망은 이미지 획득 장치 에 저장된 적어도 하나의 이미지를 학습 데이터로 학습하는 경우, 사용자 및 사용자와 관련된 사람들 중 적어도 하나를 주 대상체(1a)로 검출할 수 있다. 이미지 획득 장치는 사용자가 위치된 특정 지역에 관련된 이미지를 다수 저장할 수 있다. 사용자가 특정 지역을 여행하고자 하는 경우, 특정 지역에 관한 자료를 인터넷을 통해서 검색하고, 특정 지역에 관한 이미지를 이미지 획득 장치에 저장하는 경우가 많다. 특히, 사용자는 특정 지역의 주요 건물, 조형물 및 자연 경 관에 관련된 이미지를 이미지 획득 장치에 저장하는 경우가 많다. 따라서, 인공지능 신경망은 이미지 획 득 장치에 저장된 적어도 하나의 이미지를 학습 데이터로 학습하는 경우, 사용자가 위치된 특정 지역의 주요 건물, 조형물 및 자연 경관 중 적어도 하나를 주 대상체(1b)로 검출할 수 있다. 일 실시예에 따르면, 인공지능 신경망은 인터넷에 개시된 적어도 하나의 이미지를 학습 데이터로 이용하여 학습 할 수 있다. 예를 들면, 인공지능 신경망은 인터넷에 개시된 특정 지역에 관련된 이미지를 학습 데이터로 이용 할 수 있다. 사용자가 특정 지역을 여행하고자 하는 경우, 특정 지역에 관한 이미지를 인터넷을 통해서 검색할 수 있다. 인공지능 신경망은 사용자가 검색한 특정 지역에 관한 이미지를 학습 데이터로 학습함으로써, 사용자 가 위치된 특정 지역의 주요 건물, 조형물 및 자연 경관 중 적어도 하나를 주 대상체(1b)로 검출할 수 있다. 또한, 인공지능 신경망은 인터넷에 개시된 일반적인 사물에 관련된 이미지를 학습 데이터로 이용할 수 있다. 인공지능 신경망은 일반적인 사물(예를 들면, 나무, 휴지통, 가로등, 신호등, 좌판, 사람, 동물)을 이미지 내에 서 인식하기 위해서 인터넷에 개시된 다수의 이미지를 학습 데이터로 이용할 수 있다. 인공지능 신경망은 인터 넷에 개시된 일반적인 사물에 관련된 이미지를 학습 데이터로 학습함으로써, 제1 이미지에 포함된 적어도 하나 의 부 대상체(2a, 2b, 2c)를 검출할 수 있다. 단계 S250을 참조하면, 이미지 획득 장치는 검출된 부 대상체가 부 대상체임을 나타내는 표식을 디스플레 이 할 수 있다. 예를 들면, 이미지 획득 장치는 이미지 획득 장치에 포함된 디스플레이부 또는 이 미지 획득 장치에 유선 및 무선 중 적어도 하나의 방식으로 연결된 디스플레이 장치에 제1 이미지와 함께 부 대상체를 나타내는 표식을 디스플레이 할 수 있다. 도 3 내지 도 5를 참조하면, 이미지 획득 장치는 부 대상체를 나타내는 표식을 다양한 방식으로 표시할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 도 3과 같이 부 대상체(2a, 2b, 2c)의 인근에 표식(3a, 3b, 3 c)를 함께 디스플레이 할 수 있다. 구체적으로, 부 대상체(2a, 2b, 2c)의 인근에 별 모양과 같은 표식(3a, 3b, 3c)을 디스플레이 할 수 있다. 표식은 다양한 모양으로 디스플레이 될 수 있음은 당해 분야의 통상의 기술자에 게 자명하다. 일 실시예에 따르면, 이미지 획득 장치는 도 4와 같이 부 대상체(2a, 2b, 2c)를 점선으로 표시함으로써, 부 대상체를 나타내는 표식을 디스플레이 할 수 있다. 예를 들면, 이미지 획득 장치는 부 대상체(2a, 2b, 2c)의 외형만을 점선으로 디스플레이할 수 있다. 또 다른 예를 들면, 이미지 획득 장치는 부 대상체 (2a, 2b, 2c)의 내부에 부 대상체(2a, 2b, 2c)에 의해서 가려진 주 대상체(1b)의 적어도 일부가 디스플레이 되 도록, 부 대상체(2a, 2b, 2c)를 반투명 점선으로 디스플레이할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 도 5와 같이, 부 대상체(2a, 2b, 2c)의 적어도 일부에 기 설정 된 색 및 무늬 중 적어도 하나를 오버레이하여 디스플레이함으로써, 부 대상체를 나타내는 표식을 디스플레이 할 수 있다. 도 6은 일부 실시예에 따른, 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 방법에 관한 순서도이고, 도 7 내지 도 11은 일부 실시예에 따른, 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 예시를 나타 내는 도면이다. 도 6을 참조하면, 이미지 획득 장치는 카메라를 이용하여 제1 이미지를 획득(S610)하고, 제1 이미지 내에 서 주 대상체 및 부 대상체 중 적어도 하나를 검출(S630)하며, 검출된 부 대상체를 제1 이미지에서 제거(S650) 하고, 제거된 부 대상체가 위치되었던 영역을 복원하여 제2 이미지(S670)를 생성하며, 생성된 제2 이미지를 저 장(S690)할 수 있다.단계 S610은 단계 S210과 유사하므로, 중복되는 내용은 생략한다. 단계 S630은 단계 S230과 유사하므로, 중복되는 내용은 생략한다. 단계 S650을 참조하면, 이미지 획득 장치는 검출된 부 대상체를 제1 이미지에서 제거할 수 있다. 일 실시예에 따르면, 도 7에 도시된 것과 같이, 이미지 획득 장치는 검출된 부 대상체(2a, 2b, 2c)가 위 치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거할 수 있다. 구체적으로, 이미 지 획득 장치는 제1 이미지로부터 부 대상체(2a, 2b, 2c)에 관련된 데이터 만을 제거할 수도 있다. 또는, 이미지 획득 장치는 도 8의 영역(5a, 5b, 5c)과 같이, 부 대상체(2a, 2b, 2c)가 포함된 영역(4a, 4b, 4c)에 관련된 데이터를 제1 이미지로부터 제거할 수 있다. 이미지 획득 장치는 부 대상체에 관련된 데이터가 제거된 이미지를 디스플레이 하거나, 디스플레이 하지 않을 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 인공지능 신경망을 이용하여 부 대상체(2a, 2b, 2c)가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거할 수 있다. 인공지능 신경망은 일부 가 제거된 이미지 및 제거된 일부가 복원된 이미지를 학습데이터로 학습함으로써, 효율적으로 복원이 가능하도 록 부 대상체와 관련된 영역을 검출하고, 검출된 영역을 제거할 수 있다. 단계 S670을 참조하면, 이미지 획득 장치는 데이터가 제거된 제1 이미지의 적어도 일부 영역을 복원할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 부 대상체(2a, 2b, 2c)에 의해서 가려진 주 대상체(1b)의 적어 도 일부가 포함되도록 데이터가 제거된 영역(5a, 5b, 5c)을 복원할 수 있다. 도 9를 참조하면, 이미지 획득 장 치는 주 대상체(1b)의 적어도 일부가 포함되도록 데이터가 제거된 영역(5a, 5b, 5c)을 복원(6a, 6b, 6c) 할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 인공지능 신경망을 이용하여 주 대상체(1b)의 적어도 일부가 포 함되도록 데이터가 제거된 영역을 복원할 수 있다. 예를 들면, 인공지능 신경망은 주 대상체(1b)에 관련된 적 어도 하나의 이미지를 학습 데이터로 학습함으로써, 주 대상체(1b)의 적어도 일부가 포함되도록 영역을 복원할 수 있다. 구체적으로, 인공지능 신경망은 이미지 획득 장치에 저장된 주 대상체(1b)에 관련된 적어도 하 나의 이미지를 학습 데이터로 학습할 수 있다. 또한, 인공지능 신경망은 인터넷에 개시된 주 대상체(1b)에 관 련된 적어도 하나의 이미지를 학습 데이터로 학습할 수 있다. 또한, 인공지능 신경망은 일반적인 사물에 관련 된 이미지를 학습 데이터로 학습할 수 있다. 인공지능 신경망은 GAN(Generative adversarial network)과 같은 모델을 이용하여 주 대상체(1b)의 적어도 일부가 포함되도록 데이터가 제거된 영역을 복원한 제2 이미지를 생성 할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 복원되는 영역의 선명도가 복원되는 영역의 주변의 선명도에 대 응되도록 데이터가 제거된 영역을 복원할 수 있다. 이미지 획득 장치는 주 대상체(1a)에 초점이 맞고 (focus on), 주 대상체(1b)는 초점이 맞지 않는(focus out) 제1 이미지를 획득할 수 있다. 이 경우 초점이 맞 은 주 대상체(1a)는 선명하고, 초점이 맞지 않은 주 대상체(1b)는 블러(blur)된 것처럼 선명하지 않을 수 있다. 이미지 획득 장치는 복원되는 영역의 선명도가 제1 이미지 내에 포함된 주 대상체(1b)의 선명도에 대응되 도록 데이터가 제거된 영역을 복원할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는, 복원되는 영역의 선명도가 복원되는 영역의 주변의 선명도에 대응되 도록 데이터가 제거된 영역을 복원하기 위해서 제1 이미지 내에 포함된 주 대상체(1b)의 선명도에 대응되도록 복원되는 영역에 포함된 주 대상체(1b)의 선명도를 결정할 수 있다. 이미지 획득 장치는 복원되는 영역 에 포함된 주 대상체(1b)의 선명도가 제1 이미지 내에 포함된 주 대상체(1b)의 선명도에 대응되도록 이미지 프 로세싱을 추가로 수행할 수 있다. 도 10을 참조하면, 복원된 영역(6d, 6e, 6f)에 포함된 주 대상체(1b)는 복원된 영역의 주변보다 선명하게 복원 될 수 있다. 도 11을 참조하면, 이미지 획득 장치는 선명하게 복원된 주 대상체의 선명도가 복원된 영역 의 주변의 선명도에 대응되도록 이미지 프로세싱을 수행할 수 있다. 예를 들면, 복원된 영역(6d, 6e, 6f)에 포 함된 주 대상체(1b)의 선명도를 낮추는 이미지 프로세싱을 수행할 수 있다. 이미지 프로세싱이 완료된 영역(6g, 6h, 6i) 내에 포함된 주 대상체(1b)의 선명도는 복원된 영역의 주변의 선명도에 대응될 수 있다. 위에서는 복원되는 영역에 포함된 주 대상체(1b)를 선명하게 복원한 후, 선명도를 낮추는 이미지 프로세싱을 추 가로 하는 것으로 설명하였지만, 이에 제한되는 것은 아니다. 선명도를 낮추는 이미지 프로세싱 없이, 복원되는 영역 내의 주 대상체(1b)의 선명도가 복원되는 영역의 주변의 선명도에 대응되도록 영역 내의 주 대상체(1 b)가 복원될 수 있다. 도 12는 일부 실시예에 따른, 사용자 입력에 대응하여 부 대상체를 검출하는 방법에 관한 순서도이고, 도 13 및 도 14는 일부 실시예에 따른, 사용자 입력에 대응하여 부 대상체를 검출하는 예시를 나타내는 도면이다. 도 12를 참조하면, 이미지 획득 장치는 제1 이미지에 포함된 대상체를 선택하는 입력을 수신(S1210)하고, 선택된 대상체를 부 대상체로 검출(S1230)하며, 검출된 대상체를 부 대상체로 나타내는 표식을 디스플레이 (S1250)할 수 있다. 단계 S1210을 참조하면, 이미지 획득 장치는 사용자 입력부를 통해서 사용자로부터 제1 이미지에 포함된 대상체를 선택하는 입력을 수신할 수 있다. 도 13을 참조하면, 사용자는 이미지 획득 장치의 터치 스크린에 디스플레이된 제1 이미지에 포함된 대상체(2c)를 선택할 수 있다. 예를 들면, 사용자는 터치 스크린을 이용하여 대상체(2c)가 위치된 소정 영역을 선택할 수 있다. 단계 S1230을 참조하면, 이미지 획득 장치는 선택된 대상체(2c)를 부 대상체로 검출할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 인공지능 신경망을 이용하여 선택된 대상체(2c)를 부 대상체로 검출할 수 있다. 인공지능 신경망은 사물의 외형에 관한 이미지를 학습데이터로 학습함으로써, 이미지에 포함 된 사물(예를 들면, 나무, 휴지통, 가로등, 신호등, 좌판, 사람, 동물)의 외형을 검출할 수 있다. 이미지 획득 장치는 인공지능 신경망을 이용하여 사용자의 입력이 수신된 영역이 포함되거나, 인근에 위치된 객체를 검출할 수 있다. 도 13을 참조하면, 이미지 획득 장치는 사용자의 입력이 수신된 영역 인근에 위치된 대상체(2c)를 검 출할 수 있다. 이미지 획득 장치는 인공지능 신경망을 이용하여 사용자의 입력이 수신된 영역 인근 에 위치된 사람(2c)의 외형을 검출할 수 있다. 이미지 획득 장치는 검출된 사람(2c)의 외형에 기초하여 사람(2c)을 부 대상체로 검출할 수 있다. 단계 S1250을 참조하면, 이미지 획득 장치는 선택된 대상체(2c)가 부 대상체임을 나타내는 표식을 디스플 레이 할 수 있다. 도 14를 참조하면, 이미지 획득 장치는 선택된 대상체(2c)가 부 대상체임을 나타내는 별 모양의 표식을 대상체(2c)의 인근에 표시할 수 있다. 다만 이에 한정되지 않는다. 도 4와 같이, 대상체(2c)를 점선으로 표시 함으로써, 대상체(2c)가 부 대상체임을 나타낼 수 있다. 또한, 도 5와 같이, 대상체(2c)의 적어도 일부에 기 설정된 색 및 무늬 중 적어도 일부를 오버레이하여 표시할 수 있다. 이미지 획득 장치는 인공지능 신경 망을 이용하여 검출된 대상체(2c)의 외형에 기초하여, 대상체(2c)가 부 대상체임을 나타내는 표식을 디스플레이 할 수 있다. 도 15는 일부 실시예에 따른, 사용자 입력에 대응하여 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 방법에 관한 순서도이고, 도 16 내지 도 18은 일부 실시예에 따른, 사용자 입력에 대응하여 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 예시를 나타내는 도면이다. 도 15를 참조하면, 이미지 획득 장치는 제1 이미지 내의 대상체를 선택하는 입력을 수신(S1510)하고, 선 택된 대상체를 부 대상체로 검출(S1530)하며, 선택된 대상체를 제1 이미지로부터 제거(S1550)하고, 제거된 대상 체가 위치되었던 영역을 복원하여 제2 이미지를 생성(S1570) 할 수 있다. 단계 S1510을 참조하면, 이미지 획득 장치는 사용자 입력부를 통해서 사용자로부터 제1 이미지에 포함된 대상체를 선택하는 입력을 수신할 수 있다. 도 16을 참조하면, 사용자는 이미지 획득 장치의 터치 스크린에 디스플레이된 제1 이미지에 포함된 대상체(2c)를 선택할 수 있다. 예를 들면, 사용자는 터치 스크린을 이용하여 대상체(2c)가 위치된 소정 영역을 선택할 수 있다. 단계 S1530을 참조하면, 이미지 획득 장치는 선택된 대상체(2c)를 부 대상체로 검출할 수 있다. 단계 S1530은 단계S1230과 유사하므로, 중복되는 내용은 생략한다. 단계 S1550을 참조하면, 이미지 획득 장치는 선택된 대상체(2c)를 제1 이미지로부터 제거할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 대상체(2c)가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거할 수 있다. 예를 들면, 이미지 획득 장치는 제1 이미지로부터 부 대상체 (2c)에 관련된 데이터 만을 제거할 수도 있다. 또는, 이미지 획득 장치는 도 17의 영역(7a)과 같이, 부 대상체(2c)가 포함된 영역(7a)에 관련된 데이터를 제1 이미지로부터 제거할 수 있다. 단계 S1550은 단계 S650 과 유사하므로, 중복되는 내용은 생략한다. 단계 S1570을 참조하면, 이미지 획득 장치는 데이터가 제거된 제1 이미지의 적어도 일부를 복원할 수 있 다. 일 실시예에 따르면, 이미지 획득 장치는 부 대상체(2c)에 의해서 가려진 주 대상체(1b)의 적어도 일부가 포함되도록 데이터가 제거된 영역(7a)을 복원할 수 있다. 도 18을 참조하면, 이미지 획득 장치는 데이터 가 제거된 영역(7a)을 주 대상체(1b)의 적어도 일부가 포함되도록 복원(7b)할 수 있다. 단계 S1570은 단계 S670과 유사하므로, 중복되는 내용은 생략한다. 도 19는 일부 실시예에 따른, 이미지 내에서 부 대상체의 움직임을 추적하는 방법에 관한 순서도이고, 도 20 내 지 도 23은 일부 실시예에 따른, 이미지 내에서 부 대상체의 움직임을 추적하는 예시를 나타내는 도면이다. 도 19를 참조하면, 이미지 획득 장치는 카메라를 이용하여 제1 이미지를 획득(S1910)하고, 제1 이미지 내 에서 주 대상체 및 부 대상체 중 적어도 하나를 검출(S1930)하며, 검출된 부 대상체의 움직임을 추적(S1950)하 고, 부 대상체의 움직임에 기초하여 검출된 부 대상체를 나타내는 표식을 디스플레이(S1970)할 수 있다. 단계 S1910은 단계 S210과 유사하므로, 중복되는 내용은 생략한다. 단계 S1930은 단계 S230과 유사하므로, 중복되는 내용은 생략한다. 단계 S1950을 참조하면, 이미지 획득 장치 검출된 부 대상체의 움직임을 추적할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 제1 이미지를 인공지능 신경망에 입력함으로써, 부 대상체(2a, 2b)의 움직임을 추적할 수 있다. 도 20을 참조하면, 인공지능 신경망은 제1 이미지로부터 부 대상체(2a, 2b)의 외형을 검출하고, 검출된 부 대상체(2a, 2b)의 외형에 기초하여 부 대상체(2a, 2b)의 움직임을 추적할 수 있다. 예를 들면, 인공지능 신경망은 부 대상체(2a)의 외형을 좌측에서 우측으로 걸어가는 사람의 형태로 인식함으로 써, 부 대상체(2a)의 움직임을 좌측에서 우측으로 추적할 수 있다. 또 다른 예를 들면, 인공지능 신경망은 부 대상체(2b)의 외형을 좌측 하단에서 우측 상단으로 걸어가는 사람의 형태로 인식함으로써 부 대상체(2b)의 움직 임을 좌측 하단에서 우측 상단으로 추적할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 카메라에 포함된 센서를 이용하여 부 대상체(2a, 2b)의 움직임 을 추적할 수 있다. 카메라에 포함된 센서는 대상체의 위상차를 검출할 수 있는 센서를 포함할 수 있다. 위상 차 검출 센서는 부 대상체(2a, 2b)의 움직임에 따라 발생되는 위상의 변화를 검출할 수 있다. 이미지 획득 장 치는 검출된 부 대상체(2a, 2b)의 위상의 변화에 기초하여, 부 대상체(2a, 2b)의 움직임을 추적할 수 있 다. 일 실시예에 따르면, 이미지 획득 장치는 카메라를 이용하여 복수의 이미지를 획득하고, 획득된 복수의 이미지에 기초하여 검출된 부 대상체의 움직임을 추적할 수 있다. 이미지 획득 장치는 획득된 복수의 이 미지를 인공지능 신경망에 입력함으로써, 부 대상체(2a, 2b)의 움직임을 추적할 수 있다. 예를 들면, 이미지 획득 장치는 제1 이미지로부터 부 대상체(2a, 2b)의 모션 벡터를 검출함으로써, 부 대상체(2a, 2b)의 움 직임을 추적할 수 있다. 이미지 획득 장치는 카메라를 이용하여 제1 이미지 전후의 복수의 이미지를 획득 하고, 제1 이미지 및 제1 이미지 전후에 획득된 복수의 이미지를 인공지능 신경망에 입력함으로써 부 대상체 (2a, 2b)의 모션 벡터를 검출할 수 있다. 예를 들면, 인공지능 신경망은 제1 이미지에 포함된 부 대상체(2a, 2b)와 제1 이미지의 전후에 획득된 복수의 이미지에 포함된 부 대상체(2a, 2b)를 비교함으로써 부 대상체(2a, 2b)의 모션 벡터를 검출할 수 있다. 또 다른 예를 들면, 인공지능 신경망은 제1 이미지 및 제1 이미지의 전후 에 획득된 복수의 이미지 각각을 복수의 블록으로 분할하여 비교함으로써 부 대상체(2a, 2b)의 모션 벡터를 검 출할 수 있다.단계 S1970을 참조하면, 이미지 획득 장치는 부 대상체의 움직임에 기초하여 검출된 부 대상체를 나타내 는 표식을 디스플레이 할 수 있다. 도 20 및 도 21을 참조하면, 이미지 획득 장치는 부 대상체(2a, 2b)의 움직임에 대응하도록 부 대상체 (2a, 2b)를 나타내는 표식(3a, 3b)를 디스플레이할 수 있다. 이미지 획득 장치는 부 대상체(2a)가 우측 으로 이동함에 따라, 부 대상체(2a)의 인근에 위치된 표식(3a)도 우측으로 이동된 부 대상체(2a)의 인근에 위치 되도록 표식(3a)을 디스플레이 할 수 있다. 이미지 획득 장치는 부 대상체(2b)가 우측 상단으로 이동함 에 따라, 부 대상체(2a)의 인근에 위치된 표식(3b)도 우측 상단으로 이동된 부 대상체(2b)의 인근에 위치되도록 표식(3b)을 디스플레이 할 수 있다. 도 22 및 도 23을 참조하면, 이미지 획득 장치는 부 대상체(2a, 2b)의 외형을 점선으로 디스플레이 할 수 있다. 또한, 이미지 획득 장치는 부 대상체(2a, 2b)의 움직임에 대응하도록, 부 대상체(2a, 2b)의 외형 을 점선으로 디스플레이 할 수 있다. 이미지 획득 장치는 부 대상체(2a, 2b)의 적어도 일부에 기 설정된 색 및 무늬 중 적어도 하나를 오버레 이하여 디스플레이 하는 경우, 부 대상체(2a, 2b)의 움직임에 대응하도록, 기 설정된 색 및 무늬 중 적어도 하 나를 움직이는 부 대상체(2a, 2b)의 적어도 일부에 오버레이하여 디스플레이 할 수 있다. 도 24는 일부 실시예에 따른, 카메라와 주 대상체 및 부 대상체 중 적어도 하나와의 상대적인 위치에 기초하여 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 예시를 나타내는 방법에 관한 순서도이고, 도 25 및 도 26은 일부 실시예에 따른, 카메라가 이동할 때 주 대상체 및 부 대상체를 검출하는 예시를 나타내는 도면이 다. 도 24를 참조하면, 이미지 획득 장치는 카메라를 이용하여 제1 이미지를 획득(S2410)하고, 제1 이미지 내에서 주 대상체 및 부 대상체를 검출(S2430)하며, 카메라와 주 대상체 및 부 대상체 중 적어도 하나와의 상대적인 위 치 정보를 획득(S2450)하고, 획득된 상대적인 위치 정보에 기초하여 제2 이미지를 생성할 수 있다. 단계 S2410은 단계 S210과 유사하므로, 중복되는 내용은 생략한다. 단계 S2430은 단계 S230과 유사하므로, 중복되는 내용은 생략한다. 단계 S2450을 참조하면, 이미지 획득 장치는 카메라와 주 대상체 및 부 대상체 중 적어도 하나와의 상대 적인 위치 정보를 획득할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 카메라의 위치 정보를 획득할 수 있다. 예를 들면, 이미지 획 득 장치는 GPS모듈과 같은 위치 센서를 이용하여 카메라의 위치 정보를 획득할 수 있다. 또 다른 예를 들면, 이미지 획득 장치는 Wifi, Bluetooth, Zigbee 및 beacon과 같은 근거리 무선통신 기술을 이용하여 카메라의 위치 정보를 획득할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 인공지능 신경망을 이용하여 제1 이미지로부터 카메라의 위치 정보를 획득할 수 있다. 예를 들면, 인공지능 신경망은 제1 이미지에 포함된 대상체(1b)를 인식하고, 인식된 대상체(1b)가 위치된 지역 의 위치 정보를 획득할 수 있다. 구체적으로, 대상체(1b)가 특정 지역의 주요 건물인 경우, 인공지능 신경망은 대상체(1b)가 위치된 지역의 위치 정보를 획득할 수 있다. 대상체(1b)가 포함된 제1 이미지를 촬영하는 카메라 는 대상체(1b)가 위치된 지역과 유사한 지역에 위치될 것이므로, 인공지능 신경망은 카메라의 위치 정보를 획득 할 수 있다. 또 다른 예를 들면, 인공지능 신경망은 제1 이미지에 포함된 대상체(1b)가 위치된 지역의 위치 정보와 제1 이미 지의 촬영 정보(예를 들면, 초점거리) 및 제1 이미지 내에서의 대상체(1b)의 크기를 이용하여 대상체(1b)의 위 치 정보를 획득 할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 주 대상체의 위치 정보를 획득 할 수 있다. 예를 들면, 이미지 획득 장치는 GPS모듈과 같은 위치 센서를 이용하여 카메라의 위치 정보를 획득하고, 제1 이미지의 촬영 정보(예를 들면, 초점거리) 및 제1 이미지 내에서의 주 대상체의 크기를 이용하여 주 대상체의 위치 정보를 획 득 할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 인공지능 신경망을 이용하여 제1 이미지로부터 주 대상체의 위 치 정보를 획득할 수 있다. 예를 들면, 인공지능 신경망은 제1 이미지에 포함된 대상체(1b)를 인식하고, 인식 된 대상체(1b)가 위치된 지역의 위치 정보를 획득할 수 있다. 구체적으로, 대상체(1b)가 특정 지역의 주요 건 물인 경우, 인공지능 신경망은 대상체(1b)가 위치된 지역의 위치 정보를 획득할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 부 대상체(2a, 2b, 2c)의 위치 정보를 획득 할 수 있다. 예를 들면, 이미지 획득 장치는 GPS모듈과 같은 위치 센서를 이용하여 카메라의 위치 정보를 획득하고, 제1 이 미지의 촬영 정보(예를 들면, 초점거리) 및 제1 이미지 내에서의 부 대상체(2a, 2b, 2c)의 크기를 이용하여 주 대상체의 위치 정보를 획득 할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 카메라와 주 대상체 사이의 상대적인 위치 정보를 획득 할 수 있다. 예를 들면, 이미지 획득 장치는 획득된 카메라의 위치 정보 및 주 대상체의 위치 정보에 기초하여 카메라와 주 대상체 사이의 상대적인 위치 정보를 획득할 수 있다. 또 다른 예를 들면, 이미지 획득 장치 는 인공지능 신경망을 이용하여, 제1 이미지의 촬영 정보(예를 들면, 초점거리) 및 제1 이미지 내에서의 주 대상체의 크기를 이용하여 카메라와 주 대상체 사이의 상대적인 위치 정보를 획득할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 카메라와 부 대상체 사이의 상대적인 위치 정보를 획득 할 수 있다. 이미지 획득 장치는 획득된 카메라의 위치 정보 및 부 대상체의 위치 정보에 기초하여 카메라와 부 대상체 사이의 상대적인 위치 정보를 획득할 수 있다. 또 다른 예를 들면, 이미지 획득 장치는 인공 지능 신경망을 이용하여 제1 이미지의 촬영 정보(예를 들면, 초점거리) 및 제1 이미지 내에서의 부 대상체의 크 기를 이용하여 카메라와 부 대상체 사이의 상대적인 위치 정보를 획득할 수 있다. 단계 S2470을 참조하면, 이미지 획득 장치는, 카메라와 주 대상체 및 부 대상체 중 적어도 하나와의 상대 적인 위치 정보에 기초하여 제2 이미지를 생성할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 인공지능 신경망을 이용하여 부 대상체(2a, 2b, 2c)가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거할 수 있다. 예를 들면, 인공지능 신경망은 카메라와 부 대상체(2a, 2b, 2c) 사이의 상대적인 위치 정보에 기초하여, 부 대 상체(2a, 2b, 2c)의 움직임을 추적할 수 있다. 예를 들면, 인공지능 신경망은 카메라에 포함된 위상차 검출 센 서를 이용하여 카메라와 부 대상체(2a, 2b, 2c)의 상대적인 위치 정보의 변화를 검출할 수 있다. 또 다른 예를 들면, 인공지능 신경망은 복수의 이미지를 비교함으로써, 카메라와 부 대상체(2a, 2b, 2c)의 상대적인 위치 정 보의 변화를 검출할 수 있다. 또 다른 예를 들면, 인공지능 신경망은 카메라를 이용하여 획득된 복수의 이미지 로부터 모션 벡터를 검출함으로써 카메라와 부 대상체(2a, 2b, 2c)의 상대적인 위치 정보의 변화를 검출할 수 있다. 인공지능 신경망은 카메라와 부 대상체(2a, 2b, 2c)의 상대적인 위치 정보의 변화에 기초하여, 부 대상 체(2a, 2b, 2c)의 움직임의 방향 및 속도를 예측할 수 있다. 인공지능 신경망은 예측된 부 대상체(2a, 2b, 2 c)의 움직임의 방향 및 속도에 기초하여 부 대상체(2a, 2b, 2c)의 움직임을 추적할 수 있다. 인공지능 신경망 을 이용하여 부 대상체의 움직임을 추적하는 것은 단계 S1950과 유사하므로, 중복되는 내용은 생략한다. 도 25 및 도 26을 참조하면, 카메라는 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c)로부터 멀어짐으로써, 카메 라와 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c) 사이의 상대적인 위치 정보가 변화될 수 있다. 사용자가 사 진을 촬영할 때, 구도의 변화를 위해서 카메라의 위치를 변경할 수 있다. 예를 들면, 사용자는 특정 지역의 건 물(1b)을 넓게 촬영하기 위해서, 건물(1b)로부터 한발 물러서서 사진을 촬영할 수 있다. 따라서, 카메라는 주 대상체(1b) 및 부 대상체(2a, 2b, 2c) 각각과 상대적인 위치 정보가 변화될 수 있다. 이미지 획득 장치는 변화된 위치 정보에 기초하여 부 대상체(2a, 2b, 2c)의 움직임을 추적할 수 있다. 이미지 획득 장치는 부 대상체(2a, 2b)의 움직임에 대응하여 부 대상체(2a, 2b)를 나타내는 표식을 디스 플레이할 수 있다. 도 25 및 도 26을 참조하면, 이미지 획득 장치는 부 대상체(2a, 2b)의 우측 상단방향 움직임을 추적하고, 부 대상체(2a, 2b)의 움직임에 대응하여, 부 대상체(2a, 2b)의 외형을 점선으로 표시함으로 써 부 대상체(2a, 2b)를 나타내는 표식을 디스플레이할 수 있다. 인공지능 신경망은 부 대상체(2a, 2b, 2c)의 움직임에 기초하여 부 대상체(2a, 2b, 2c)가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 효율적으로 제거할 수 있다. 이미지 획득 장치가 부 대상체(2a, 2b, 2c)가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는 것은 단계 S650과 유사하므로, 중복되는 내용은 생략한다.일 실시예에 따르면, 이미지 획득 장치는 부 대상체(2a, 2b, 2c)의 움직임을 추적하여 부 대상체(2a, 2b, 2c)가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제거할 수 있다. 이미지 획득 장치가 부 대상체(2a, 2b, 2c)의 움직임을 추적하는 것은 단계 S1950과 유사하고, 이미지 획득 장치가 부 대상체 (2a, 2b, 2c)가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는 것은 단 계 S650과 유사하므로, 중복되는 내용은 생략한다. 일 실시예에 따르면, 이미지 획득 장치는 인공지능 신경망을 이용하여, 카메라와 주 대상체(1b)의 상대적 인 위치 정보에 기초하여, 부 대상체(2a, 2b, 2c)에 의해서 가려진 주 대상체(1b)의 적어도 일부가 포함되도록 데이터가 제거된 영역을 복원할 수 있다. 예를 들면, 인공지능 신경망은 특정 지역에 위치된 건물인 주 대상체 (1b)의 위치 정보를 획득할 수 있다. 단계 S2450과 같이 인공지능 신경망은 카메라와 주 대상체(1b)의 상대적 인 위치 정보를 획득할 수 있다. 인공지능 신경망은 주 대상체(1b)의 위치 정보 및 카메라와 주 대상체(1b)의 상대적인 위치 정보에 기초하여, 제1 이미지와 유사하게 주 대상체(1b)를 촬영한 이미지를 검색할 수 있다. 인 공지능 신경망은 검색된 적어도 하나의 이미지를 학습데이터로 학습함으로써, 제1 이미지 내에 데이터가 제거된 영역을 복원할 수 있다. 인공지능 신경망은 제1 이미지 내에 데이터가 제거된 영역을 복원함으로써 제2 이미지 를 생성할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 제1 이미지 내에 데이터가 제거된 영역을 복원함으로써 제2 이 미지를 디스플레이부에 디스플레이 할 수 있다. 또한, 이미지 획득 장치는 제2 이미지를 메모리에 저장 할 수 있다. 이 경우, 이미지 획득 장치는 제1 이미지 내에 데이터가 제거된 영역을 복원한 제2 이미지 가 생성될 때 메모리에 저장하거나, 사용자의 입력에 대응하여 메모리에 저장할 수 있다. 도 27은 일부 실시예에 따른, 서버를 이용하여 부 대상체를 나타내는 표식을 디스플레이하는 방법을 나타내는 도면이고, 도 28 및 도 29는 일부 실시예에 따른, 서버를 이용하여 부 대상체를 나타내는 표식을 디스플레이하 는 예시를 나타내는 도면이다. 도 27을 참조하면, 이미지 획득 장치는 사용자로부터 카메라를 구동하는 입력을 수신(S2710)하고, 서버 에 접속(S2720)하며, 카메라를 이용하여 제1 이미지를 획득(S2730)하고, 제1 이미지를 서버로 전송 할 수 있다. 서버는 수신된 제1 이미지 내에서 주 대상체 및 부 대상체를 검출(S2750)하고, 이미지 획득 장치로 주 대상체 및 부 대상체를 검출한 결과에 관한 정보를 전송(S2760)할 수 있다. 이미지 획득 장치 는 서버로부터 수신된 정보에 기초하여 부 대상체를 나타내는 표식을 디스플레이(S2770) 할 수 있 다. 단계 S2710을 참조하면, 이미지 획득 장치는 사용자로부터 카메라를 구동하는 입력을 수신할 수 있다. 도 28을 참조하면, 이미지 획득 장치는 사용자로부터 카메라를 구동하는 특정 버튼에 대한 입력을 수신할 수 있다. 또는 이미지 획득 장치는 사용자로부터 카메라에 관한 어플리케이션을 구동하기 위한 입력을 수신할 수 있다. 단계 S2720을 참조하면, 이미지 획득 장치는 서버에 접속할 수 있다. 일 실시예에 따르면, 이미지 획득 장치는 사용자로부터 카메라를 구동하는 입력을 수신할 때 자동으로 서 버에 접속할 수 있다. 서버는 제1 이미지로부터 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c) 중 적어도 하나를 검출하는 인공지능 신경망을 탑재한 것일 수 있다. 또한, 서버는 부 대상체(2a, 2b, 2c) 가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하고, 제거된 영역을 부 대 상체(2a, 2b, 2c)에 의해서 가려진 주 대상체(1b)의 적어도 일부가 포함되도록 복원하는 인공지능 신경망을 탑 재한 것일 수 있다. 단계 S2730을 참조하면, 이미지 획득 장치는 카메라를 이용하여 제1 이미지를 획득할 수 있다. 단계 S2730은 단계 S210과 유사하므로, 중복되는 내용은 생략한다. 단계 S2740을 참조하면, 이미지 획득 장치는 획득된 제1 이미지를 서버로 전송할 수 있다. 단계 S2750을 참조하면, 서버는 인공지능 신경망을 이용하여 수신된 제1 이미지 내에서 주 대상체 및 부 대상체를 검출할 수 있다. 도 28 및 도 29를 참조하면 서버는 제1 이미지 내에서 주 대상체(1a, 1b) 및 부 대상체(2a, 2b, 2c)를 검출할 수 있다. 인공지능 신경망은 이미지 획득 장치의 사용자에게 특화된 것 일 수 있다. 예를 들면, 인공지능 신경망은 사용자에 관련된 데이터(예를 들면, 사용자의 이미지 획득 장치에 저장된 적어도 하나의 이미지)를 학습 데이터로 학습한 것일 수 있다. 인공지능 신경망이 제1 이미지 내에서 주 대상체 및 부 대상체를 검출하는 것은 단계 S230과 유사하므로, 중복되는 내용은 생략한다. 단계 S2760을 참조하면, 서버는 인공지능 신경망을 이용하여 제1 이미지 내에서 주 대상체 및 부 대상체 를 검출한 결과를 이미지 획득 장치로 전송할 수 있다. 예를 들면, 서버는 주 대상체 및 부 대상 체를 나타내는 표식이 포함된 제1 이미지를 이미지 획득 장치로 전송할 수 있다. 또는, 서버는 제 1 이미지에 포함된 대상체를 나타내는 정보 및 대상체 각각이 주 대상체 인지 부 대상체 인지를 나타내는 정보 를 이미지 획득 장치로 전송할 수 있다. 단계 S2770를 참조하면, 이미지 획득 장치는 부 대상체(2a, 2b, 2c)를 나타내는 표식(3a, 3b, 3c)을 디 스플레이 할 수 있다. 단계 S2770은 단계 S250과 유사하므로, 중복되는 내용은 생략한다. 이미지 획득 장치는 사용자로부터 카메라를 구동하는 입력을 수신에 대응하여 서버에 접속할 때, 서버로부터 인공지능 신경망에 관한 데이터를 수신할 수 있다. 예를 들면, 이미지 획득 장치는 서 버로부터 인공지능 신경망을 구현하는 소프트웨어 모듈을 수신할 수 있다. 또 다른 예를 들면, 이미지 획득 장치는 서버로부터 인공지능 신경망을 업데이트하는 데이터를 수신할 수 있다. 이미지 획득 장치는 수신된 인공지능 신경망에 관한 데이터에 기초하여 제1 이미지에 포함된 주 대상체 및 부 대상체 를 검출할 수 있다. 도 30 및 도 31은 일부 실시예에 따른 이미지 획득 장치의 블록도이다. 도 30에 도시된 바와 같이, 일부 실시예에 따른 이미지 획득 장치는, 사용자 입력부, 디스플레이부 , 프로세서, 및 통신부를 포함할 수 있다. 그러나, 도 30에 도시된 구성 요소 모두가 이미지 획득 장치의 필수 구성 요소인 것은 아니다. 도 30에 도시된 구성 요소보다 많은 구성 요소에 의해 이미 지 획득 장치가 구현될 수도 있고, 도 30에 도시된 구성 요소보다 적은 구성 요소에 의해 이미지 획득 장 치가 구현될 수도 있다. 예를 들어, 도 31에 도시된 바와 같이, 일부 실시예에 따른 이미지 획득 장치는, 사용자 입력부, 프로세서, 및 통신부 이외에 센싱부, A/V 입력부, 및 메모리를 더 포함할 수도 있다. 사용자 입력부는, 사용자가 이미지 획득 장치를 제어하기 위한 데이터를 입력하는 수단을 의미한다. 예를 들어, 사용자 입력부에는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에 조 효과 방식 등), 조그 휠, 조그 스위치 등이 있을 수 있으나 이에 한정되는 것은 아니다. 또한, 사용자 입력 부는 디스플레이부에 터치 레이어를 결합하여 사용자의 터치 입력을 수신하는 터치 스크린을 포함 할 수 있다. 사용자 입력부는, 디스플레이부에 디스플레이된 적어도 하나의 대상체를 선택하는 사용자의 입력을 수신할 수 있다. 출력부는, 오디오 신호 또는 비디오 신호 또는 진동 신호를 출력할 수 있으며, 출력부는 디스플레 이부, 음향 출력부, 및 진동 모터를 포함할 수 있다. 디스플레이부는 이미지 획득 장치에서 처리되는 정보를 디스플레이 할 수 있다. 예를 들면, 디스 플레이부는 제1 이미지, 부 대상체를 나타내는 표식을 디스플레이 할 수 있다. 또한, 디스플레이부 는 주 대상체의 적어도 일부가 포함되도록 데이터가 제거된 영역을 복원한 제2 이미지를 디스플레이 할 수 있다. 음향 출력부는 통신부로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력한다. 또한, 음향 출력부는 이미지 획득 장치에서 수행되는 기능(예를 들어, 호신호 수신음, 메시지 수신음, 알 림음)과 관련된 음향 신호를 출력한다. 프로세서는, 통상적으로 이미지 획득 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서 는, 메모리에 저장된 프로그램들을 실행함으로써, 사용자 입력부, 출력부, 센싱부 , 통신부, A/V 입력부 등을 전반적으로 제어할 수 있다. 또한, 프로세서는 메모리에 저장된 프로그램들을 실행함으로써, 도 1 내지 도 29에 기재된 이미지 획득 장치의 기능을 수행 할 수 있다. 구체적으로, 프로세서는 사용자로부터 디스플레이된 대상체 중 적어도 하나를 선택하는 입력을 수신하도 록 사용자 입력부를 제어할 수 있다. 프로세서는 사용자의 음성 입력을 수신하도록 마이크로폰 을 제어할 수 있다. 프로세서는 사용자 입력에 기초하여 이미지 획득 장치의 동작을 수행하 는 애플리케이션을 실행할 수 있으며, 실행된 애플리케이션을 통하여 사용자 입력을 수신하도록 제어할 수 있다. 예를 들면, 프로세서는, 보이스 어시스턴트 애플리케이션 (Voice Assistant Application)을 실행 하고, 실행된 애플리케이션을 제어함으로써 마이크로폰을 통하여 사용자의 음성 입력을 수신하도록 제어 할 수 있다. 프로세서는 제1 이미지, 부 대상체를 나타내는 표식 및 제2 이미지가 디스플레이 되도록 이미지 획득 장 치의 출력부 및 메모리를 제어할 수 있다. 프로세서는 적어도 하나의 마이크로칩으로 구성될 수 있다. 프로세서는 제1 이미지 내에서 주 대상체 및 부 대상체를 검출할 수 있다. 프로세서는 인공지능 신경망을 이용하여 주 대상체 및 부 대상체 중 적어도 하나를 검출할 수 있다. 프로세서는 제1 이미지 내에서 부 대상체를 제거하고, 제1 이미지 내의 부 대상체가 제거된 영역을 복원 하여 제2 이미지를 생성할 수 있다. 프로세서는 인공지능 신경망을 이용하여 제1 이미지 내에서 부 대상 체를 제거하고, 부 대상체가 제거된 영역을 복원할 수 있다. 이 경우 인공 지능 신경망은 제거되는 부 대상체에 의해 가려진 주 대상체의 적어도 일부를 복원할 수 있다. 프로세서는 카메라와 주 대상체 사이의 상대적인 위치 정보를 획득하고, 상대적인 위치 정보에 기초하여 주 대상체의 적어도 일부를 복원할 수 있다. 프로세서는 복원되는 주 대상체의 적어도 일부의 선명도가 제1 이미지 내의 주 대상체의 선명도에 대응되 도록, 주 대상체의 적어도 일부를 복원하는 이미지 프로세싱을 수행할 수 있다. 예를 들면, 프로세서는 제1 이미지 내의 주 대상체의 선명도에 대응되도록 복원되는 주 대상체의 적어도 일부의 선명도를 결정하고, 복 원되는 주 대상체의 적어도 일부의 선명도가 결정된 선명도에 대응되도록 이미지 프로세싱을 수행할 수 있다. 프로세서는 사용자의 입력에 기초하여, 제1 이미지 내에서 선택된 부 대상체를 검출할 수 있다. 예를 들 면, 프로세서는 인공지능 신경망을 이용하여 제1 이미지 내의 복수의 대상체 각각의 외형을 검출하고, 사 용자의 입력이 수신된 영역의 인근에 위치된 대상체를 부 대상체로 검출할 수 있다. 프로세서는 제1 이미지 내에서의 부 대상체의 움직임을 추적할 수 있다. 예를 들면, 프로세서는 카 메라와 부 대상체 사이의 상대적인 위치 정보를 획득하고, 위치 정보의 변화를 검출함으로써 부 대상체의 움직 임을 추적할 수 있다. 센싱부는, 이미지 획득 장치의 상태 또는 이미지 획득 장치 주변의 상태를 감지하고, 감지된 정보를 프로세서로 전달할 수 있다. 센싱부는, 지자기 센서(Magnetic sensor), 가속도 센서(Acceleration sensor), 온/습도 센 서, 적외선 센서, 자이로스코프 센서, 위치 센서(예컨대, GPS), 기압 센서, 근 접 센서, 및 RGB 센서(illuminance sensor) 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 각 센서들의 기능은 그 명칭으로부터 당업자가 직관적으로 추론할 수 있으므로, 구체적인 설명은 생략하기로 한다. 통신부는, 이미지 획득 장치가 다른 장치(미도시) 및 서버와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 다른 장치(미도시)는 이미지 획득 장치와 같은 컴퓨팅 장치이거나, 센싱 장 치일 수 있으나, 이에 제한되지 않는다. 예를 들어, 통신부는, 근거리 통신부, 이동 통신부, 방송 수신부를 포함할 수 있다. 근거리 통신부(short-range wireless communication unit)는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무선 통신부(Near Field Communication unit), WLAN(와이파이) 통신부, 지그비 (Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 이동 통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한 다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다 양한 형태의 데이터를 포함할 수 있다. 방송 수신부는, 방송 채널을 통하여 외부로부터 방송 신호 및/또는 방송 관련된 정보를 수신한다. 방송 채널은 위성 채널, 지상파 채널을 포함할 수 있다. 구현 예에 따라서 이미지 획득 장치가 방송 수신부 를 포함하지 않을 수도 있다. 일 실시예에 따르면, 통신부는, 제1 이미지를 서버로 전송할 수 있다. 일 실시예에 따르면, 통신부는 서버로부터 주 대상체 및 부 대상체를 검출한 결과에 관한 정보를 수신할 수 있다. 일 실시예에 따르면, 통신부는 서버로부터 인공지능 신경망을 구현하는 소프트웨어 모듈을 수신할 수 있다. 일 실시예에 따르면, 통신부는 서버로부터 인공지능 신경망을 업데이트하는 데이터를 수신할 수 있 다. A/V(Audio/Video) 입력부는 오디오 신호 또는 비디오 신호 입력을 위한 것으로, 이에는 카메라와 마이크로폰 등이 포함될 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서를 통해 정지영상 또는 동영상 등의 화상 프레임을 얻을 수 있다. 이미지 센서를 통해 캡쳐된 이미지는 프로세서 또는 별도의 이미지 처리부(미도시)를 통해 처리될 수 있다. 마이크로폰은, 외부의 음향 신호를 입력 받아 전기적인 음성 데이터로 처리한다. 예를 들어, 마이크로폰 은 외부 디바이스 또는 사용자로부터 음향 신호를 수신할 수 있다. 마이크로폰은 사용자의 음성 입 력을 수신할 수 있다. 마이크로폰은 외부의 음향 신호를 입력 받는 과정에서 발생 되는 잡음(noise)을 제 거하기 위한 다양한 잡음 제거 알고리즘을 이용할 수 있다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 이미지 획득 장치로 입력되거나 이미지 획득 장치로부터 출력되는 데이터를 저장할 수도 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 메모리에 저장된 프로그램들은 그 기능에 따라 복수 개의 모듈들로 분류할 수 있는데, 예를 들어, UI 모 듈, 터치 스크린 모듈, 알림 모듈 등으로 분류될 수 있다. UI 모듈은, 애플리케이션 별로 이미지 획득 장치와 연동되는 특화된 UI, GUI 등을 제공할 수 있다. 터치 스크린 모듈은 사용자의 터치 스크린 상의 터치 제스처를 감지하고, 터치 제스처에 관한 정보를 프 로세서로 전달할 수 있다. 일부 실시예에 따른 터치 스크린 모듈은 터치 코드를 인식하고 분석할 수 있다. 터치 스크린 모듈은 컨트롤러를 포함하는 별도의 하드웨어로 구성될 수도 있다. 알림 모듈은 이미지 획득 장치의 이벤트 발생을 알리기 위한 신호를 발생할 수 있다. 이미지 획득 장치에서 발생되는 이벤트의 예로는 호 신호 수신, 메시지 수신, 키 신호 입력, 일정 알림 등이 있다. 알 림 모듈은 디스플레이부를 통해 비디오 신호 형태로 알림 신호를 출력할 수도 있고, 음향 출력부 를 통해 오디오 신호 형태로 알림 신호를 출력할 수도 있고, 진동 모터를 통해 진동 신호 형태로 알림 신호를 출력할 수도 있다. 도 32는 일부 실시예에 따른 서버의 블록도이다. 도 32를 참조하면, 일부 실시예에 따른 서버는 통신부, DB 및 프로세서를 포함할 수 있다. 통신부는 이미지 획득 장치와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 통신부는 이미지 획득 장치로부터 이미지를 수신하거나 전송할 수 있다. DB는 학습 모델 및 학습 모델에 적용되는 학습 데이터를 저장할 수 있다. 프로세서는 통상적으로 서버의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 서버 의 DB에 저장된 프로그램들을 실행함으로써, DB 및 통신부 등을 전반적으로 제어할 수 있다. 프로세서는 DB에 저장된 프로그램들을 실행함으로써, 도 1 내지 도 29에서의 이미지 획득 장 치의 동작의 일부를 수행할 수 있다. 프로세서는 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하는 기능, 부 대상체가 위 치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는 기능, 제거된 영역을 부 대 상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하는 기능 중 적어도 하나를 수행할 수 있다. 프로세서는 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하는데 필요한 데이터, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는데 필요한 데이 터, 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하는데 필요한 데이 터 중 적어도 하나를 관리할 수 잇다. 도 33은 일부 실시예에 따른 프로세서의 블록도이다. 도 33을 참조하면, 일부 실시예에 따른 프로세서는 데이터 학습부 및 데이터 인식부를 포함 할 수 있다. 데이터 학습부는 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하기 위한 기준을 학습할 수 있다. 데이터 학습부는 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하기 위하여 어떤 데이터를 이용할 지에 관한 기준을 학습할 수 있다. 데이터 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적용함으로써, 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하기 위한 기준 을 학습할 수 있다. 데이터 학습부는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부 터 제거하기 위한 기준을 학습할 수 있다. 데이터 학습부는 부 대상체가 위치된 제1 이미지의 적어도 일 부 영역에 관련된 데이터를 제1 이미지로부터 제거하기 위하여 어떤 데이터를 이용할 지에 관한 기준을 학습할 수 있다. 데이터 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델 에 적용함으로써, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제 거하기 위한 기준을 학습할 수 있다. 데이터 학습부는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되 도록 복원하기 위한 기준을 학습할 수 있다. 데이터 학습부는 데이터가 제거된 영역을 부 대상체에 의해 서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하기 위하여 어떤 데이터를 이용할 지에 관한 기준을 학 습할 수 있다. 데이터 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적용함으로써, 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도 록 복원하기 위한 기준을 학습할 수 있다. 데이터 인식부는 데이터에 기초하여 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출할 수 있다. 데 이터 인식부는 학습된 데이터 인식 모델을 이용하여, 소정의 데이터로부터 제1 이미지에 포함된 주 대상 체 및 부 대상체를 검출할 수 있다. 데이터 인식부는 학습에 의한 기 설정된 기준에 따라 소정의 데이터 를 획득하고, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델을 이용함으로써, 제1 이미지에 포함된 주 대 상체 및 부 대상체를 검출할 수 있다. 또한, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델에 의해 출력 된 결과 값은, 데이터 인식 모델을 갱신하는데 이용될 수 있다. 데이터 인식부는 데이터에 기초하여 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터 를 제1 이미지로부터 제거할 수 있다. 데이터 인식부는 학습된 데이터 인식 모델을 이용하여, 부 대상체 가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거할 수 있다. 데이터 인식 부는 학습에 의한 기 설정된 기준에 따라 소정의 데이터를 획득하고, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델을 이용함으로써, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거할 수 있다. 또한, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델에 의해 출력된 결과값은, 데이터 인식 모델을 갱신하는데 이용될 수 있다. 데이터 인식부는 데이터에 기초하여 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적 어도 일부가 포함되도록 복원할 수 있다. 데이터 인식부는 학습된 데이터 인식 모델을 이용하여, 데이터 가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원할 수 있다. 데이터 인식부는 학습에 의한 기 설정된 기준에 따라 소정의 데이터를 획득하고, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델을 이용함으로써, 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어 도 일부가 포함되도록 복원할 수 있다. 또한, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델에 의해 출 력된 결과 값은, 데이터 인식 모델을 갱신하는데 이용될 수 있다. 데이터 학습부 및 데이터 인식부 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 디바이스에 탑재될 수 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로 세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각 종 디바이스에 탑재될 수도 있다. 이 경우, 데이터 학습부 및 데이터 인식부는 하나의 디바이스에 탑재될 수도 있으며, 또는 별개의 디바이스들에 각각 탑재될 수도 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 하나는 이미 지 획득 장치에 포함되고, 나머지 하나는 서버에 포함될 수 있다. 또한, 데이터 학습부 및 데이터 인식부는 유선 또는 무선으로 통하여, 데이터 학습부가 구축한 모델 정보를 데이터 인식부 로 제공할 수도 있고, 데이터 인식부로 입력된 데이터가 추가 학습 데이터로서 데이터 학습부 로 제공될 수도 있다. 한편, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이 터 학습부 및 데이터 인식부 중 적어도 하나가 소프트웨어 모듈(또는, 인스터럭션(instruction) 포 함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소 프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플 리케이션에 의해 제공될 수 있다. 도 34는 일부 실시예에 따른 데이터 학습부의 블록도이다. 도 34를 참조하면, 일부 실시예에 따른 데이터 학습부는 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5)를 포함할 수 있다. 데이터 획득부(1310-1)는 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하는데 필요한 데이터를 획득할 수 있다. 데이터 획득부(1310-1)는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는데 필요한 데이터를 획득할 수 있다. 데이터 획득부(1310-1)는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하는데 필요한 데이터를 획득할 수 있다. 데이터 획득부(1310-1)는, 이미지 획득 장치에 저장된 적어도 하나의 이미지를 획득할 수 있다. 예를 들 면, 데이터 획득부(1310-1)는 이미지 획득 장치에 저장된 사용자의 얼굴이 포함된 이미지 및 사용자와 관 련된 사람(예를 들면, 사용자의 가족, 연인 및 친지)의 얼굴이 포함된 이미지를 획득할 수 있다. 또 다른 예를 들면, 데이터 획득부(1310-1)는 이미지 획득 장치에 저장된 사용자가 위치된 특정 지역에 관련된 이미지 (예를 들면, 특정 지역의 주요 건물, 조형물 및 자연 경관)를 획득할 수 있다. 또 다른 예를 들면, 데이터 획 득부(1310-1)는 인터넷에 개시된 적어도 하나의 이미지(예를 들면, 특정 지역의 주요 건물, 조형물 및 자연 경 관)를 획득할 수 있다. 또 다른 예를 들면, 데이터 획득부(1310-1)는 일반적인 사물(예를 들면, 나무, 휴지통, 가로등, 신호등, 좌판, 사람, 동물)에 관련된 인터넷에 개시된 적어도 하나의 이미지를 획득할 수 있다. 전처리부(1310-2)는 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하는데 필요한 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1310-2)는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거 하는데 필요한 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1310-2)는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하는데 필요한 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1310-2)는 후술할 모델 학습부(1310-4)가 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하기 위한 학습을 위하여 획득된 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 학습 데이터 선택부(1310-3)는 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 선택된 데이터 는 모델 학습부(1310-4)에 제공될 수 있다. 학습 데이터 선택부(1310-3)는 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출을 하기 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 학습 데이터 선택부 (1310-3)는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거를 하 기 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 학습 데이터 선택부(1310-3)는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원을 하기 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 또한, 학습 데이터 선택부(1310-3)는 후술할 모델 학습부(1310-4)에 의한 학습에 의해 기 설정된 기준에 따라 데이터를 선택할 수도 있다. 모델 학습부(1310-4)는 학습 데이터에 기초하여 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 어 떻게 검출할 지에 관한 기준을 학습할 수 있다. 모델 학습부(1310-4)는 학습 데이터에 기초하여 부 대상체가 위 치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 어떻게 제거할 지에 관한 기준을 학 습할 수 있다. 모델 학습부(1310-4)는 학습 데이터에 기초하여 데이터가 제거된 영역을 부 대상체에 의해서 가 려진 주 대상체의 적어도 일부가 포함되도록 어떻게 복원할 지에 관한 기준을 학습할 수 있다. 또한, 모델 학습부(1310-4)는 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하기 위하여 어 떤 학습 데이터를 이용해야 하는 지에 대한 기준을 학습할 수도 있다. 또한, 모델 학습부(1310-4)는 부 대상체 가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하기 위하여 어떤 학습 데 이터를 이용해야 하는 지에 대한 기준을 학습할 수도 있다. 또한, 모델 학습부(1310-4)는 데이터가 제거된 영 역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하기 위하여 어떤 학습 데이터를 이용해야 하는 지에 대한 기준을 학습할 수도 있다. 또한, 모델 학습부(1310-4)는 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하는데 이용되는 학습 모델을 학습 데이터를 이용하여 학습시킬 수 있다. 모델 학습부(1310-4)는 부 대상체가 위치된 제1 이미지 의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는데 이용되는 학습 모델을 학습 데이터를 이 용하여 학습시킬 수 있다. 모델 학습부(1310-4)는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상 체의 적어도 일부가 포함되도록 복원하는데 이용되는 학습 모델을 학습 데이터를 이용하여 학습시킬 수 있다. 이 경우, 학습 모델은 미리 구축된 것일 수 있다. 예를 들어, 학습 모델은 기본 학습 데이터(예를 들어, 샘플 데이터 등)을 입력 받아 미리 구축된 것일 수 있다. 학습 모델은, 인식 모델의 적용 분야, 학습의 목적 또는 장치의 컴퓨터 성능 등을 고려하여 구축될 수 있다. 학습 모델은, 예를 들어, 신경망(Neural Network)을 기반으로 하는 모델일 수 있다. 예컨대, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network)과 같은 모 델이 학습 모델로 이용될 수 있으나, 이에 한정되지 않는다. 다양한 실시예에 따르면, 모델 학습부(1310-4)는 미리 구축된 학습 모델이 복수 개가 존재하는 경우, 입력된 학 습 데이터와 기본 학습 데이터의 관련성이 큰 학습 모델을 학습할 학습 모델로 결정할 수 있다. 이 경우, 기본 학습 데이터는 데이터의 타입 별로 기 분류되어 있을 수 있으며, 학습 모델은 데이터의 타입 별로 미리 구축되 어 있을 수 있다. 예를 들어, 기본 학습 데이터는 학습 데이터가 생성된 지역, 학습 데이터가 생성된 시간, 학 습 데이터의 크기, 학습 데이터의 장르, 학습 데이터의 생성자, 학습 데이터 내의 오브젝트의 종류 등과 같은 다양한 기준으로 기 분류되어 있을 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient descent)을 포함하는 학습 알고리즘 등을 이용하여 학습 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 학습 데이터를 입력 값으로 하는 지도 학습(supervised learning) 을 통하여, 학습 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 별다른 지도없이 주 대상체 및 부 대상체 중 적어도 하나를 검출하고, 검출 결과에 대응하는 응답 동작의 제공을 위해 필요한 데이터의 종 류를 스스로 학습함으로써, 주 대상체 및 부 대상체 중 적어도 하나를 검출하기 위한 기준을 발견하는 비지도 학습(unsupervised learning)을 통하여, 학습 모델을 학습시킬 수 있다. 또한, 모델 학습부(1310-4)는, 예를 들어, 학습에 따른 주 대상체 및 부 대상체 중 적어도 하나를 검출한 결과가 올바른 지에 대한 피드백을 이용하 는 강화 학습(reinforcement learning)을 통하여, 학습 모델을 학습시킬 수 있다. 또한, 학습 모델이 학습되면, 모델 학습부(1310-4)는 학습된 학습 모델을 저장할 수 있다. 이 경우, 모델 학습 부(1310-4)는 학습 모델을 데이터 인식부를 포함하는 디바이스의 메모리에 저장할 수 있다. 또는, 모델 학습부(1310-4)는 학습 모델을 디바이스와 유선 또는 무선 네트워크로 연결되는 서버의 메모리에 저장할 수도 있다. 이 경우, 학습 모델이 저장되는 메모리는, 예를 들면, 디바이스의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 함께 저장할 수도 있다. 또한, 메모리는 소프트웨어 및/또는 프로그램을 저장할 수도 있다. 프로 그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API) 및/또는 어플리케이션 프로그램 (또는 \"어플리케이션\") 등을 포함할 수 있다. 모델 평가부(1310-5)는 학습 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 인식 결과가 소정 기 준을 만족하지 못하는 경우, 모델 학습부(1310-4)로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터 는 학습 모델을 평가하기 위한 기 설정된 데이터일 수 있다. 예를 들어, 모델 평가부(1310-5)는 평가 데이터에 대한 학습된 학습 모델의 인식 결과 중에서, 인식 결과가 정 확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정된 임계치를 초과하는 경우 소정 기준을 만족하지 못한 것으로 평가할 수 있다. 예컨대, 소정 기준이 비율 2%로 정의되는 경우, 학습된 학습 모델이 총 1000개의 평가 데이터 중의 20개를 초과하는 평가 데이터에 대하여 잘못된 인식 결과를 출력하는 경우, 모델 평가부(1310-5)는 학습된 학습 모델이 적합하지 않은 것으로 평가할 수 있다. 한편, 학습된 학습 모델이 복수 개가 존재하는 경우, 모델 평가부(1310-5)는 각각의 학습된 학습 모델에 대하여 소정 기준을 만족하는지를 평가하고, 소정 기준을 만족하는 학습 모델을 최종 학습 모델로서 결정할 수 있다. 이 경우, 소정 기준을 만족하는 학습 모델이 복수 개인 경우, 모델 평가부(1310-5)는 평가 점수가 높은 순으로 미리 설정된 어느 하나 또는 소정 개수의 학습 모델을 최종 학습 모델로서 결정할 수 있다. 한편, 데이터 학습부 내의 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 디바이 스에 탑재될 수 있다. 예를 들어, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모 델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각종 디바이스에 탑재될 수도 있다. 또한, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5)는 하나의 디바이스에 탑재될 수도 있으며, 또는 별개의 디바이스들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 일부는 디바이스에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 또한, 데이터 획득부(1310-1), 전처리부(1310-2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(1310-1), 전처리부(1310- 2), 학습 데이터 선택부(1310-3), 모델 학습부(1310-4) 및 모델 평가부(1310-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인스터럭션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 프로세서는 다양한 학습 모델을 이용할 수 있으며, 학습 모델을 통해 다양한 방법으로 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 생성하기 위한 기준을 효율적으로 학습할 수 있다. 도 35는 일부 실시예에 따른 데이터 인식부의 블록도이다. 도 35를 참조하면, 일부 실시예에 따른 데이터 인식부는 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5)를 포함할 수 있다. 데이터 획득부(1320-1)는 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하는데 필요한 데이터를 획득할 수 있다. 데이터 획득부(1320-1)는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는데 필요한 데이터를 획득할 수 있다. 데이터 획득부(1320-1)는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하는데 필요한 데이터를 획득할 수 있다. 전처리부(1310-2)는 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하는데 필요한 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1310-2)는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거 하는데 필요한 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1310-2)는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상 체의 적어도 일부가 포함되도록 복원하는데 필요한 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(1320-2)는 후술할 인식 결과 제공부(1320-4)가 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하기 위해 획득된 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 전처리부(1320-2)는 후술할 인식 결과 제공부(1320-4)가 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거 하는데 필요한 데이터가 이용될 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 인식 데이터 선택부(1320-3)는 전처리된 데이터 중에서 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하 나를 검출하는데 필요한 데이터를 선택할 수 있다. 인식 데이터 선택부(1320-3)는 전처리된 데이터 중에서 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는데 필요한 데이 터를 선택할 수 있다. 인식 데이터 선택부(1320-3)는 전처리된 데이터 중에서 데이터가 제거된 영역을 부 대상 체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하는데 필요한 데이터를 선택할 수 있다. 선택 된 데이터는 인식 결과 제공부(1320-4)에게 제공될 수 있다. 인식 데이터 선택부(1320-3)는 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하기 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 일부 또는 전부를 선택할 수 있다. 인식 데이터 선택부(1320-3)는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하기 위한 기 설 정된 기준에 따라, 전처리된 데이터 중에서 일부 또는 전부를 선택할 수 있다. 인식 데이터 선택부(1320-3)는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하기 위한 기 설정된 기준에 따라, 전처리된 데이터 중에서 일부 또는 전부를 선택할 수 있다. 또한, 인식 데이터 선택부(1320-3)는 후술할 모델 학습부(1310-4)에 의한 학습에 의해 기 설정된 기준에 따라 데이터를 선택할 수도 있다. 인식 결과 제공부(1320-4)는 선택된 데이터를 데이터 인식 모델에 적용하여 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출할 수 있다. 인식 결과 제공부(1320-4)는 선택된 데이터를 데이터 인식 모델에 적 용하여 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거할 수 있 다. 인식 결과 제공부(1320-4)는 선택된 데이터를 데이터 인식 모델에 적용하여 데이터가 제거된 영역을 부 대 상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원할 수 있다. 인식 결과 제공부(1320-4)는 데이터의 인식 목적에 따른 인식 결과를 제공할 수 있다. 인식 결과 제공부(1320- 4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 입력 값으로 이용함으로써, 선택된 데이터를 데이터 인식 모델에 적용할 수 있다. 또한, 인식 결과는 데이터 인식 모델에 의해 결정될 수 있다. 예를 들면, 제1 이 미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출한 결과, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거한 결과 및 데이터가 제거된 영역을 부 대상체에 의해서 가 려진 주 대상체의 적어도 일부가 포함되도록 복원한 결과는 텍스트, 이미지 또는 명령 (예를 들면, 어플리케이 션 실행 명령어, 모듈 기능 실행 명령어 등)등으로 제공될 수 있다. 모델 갱신부(1320-5)는 인식 결과 제공부(1320-4)에 의해 제공되는 인식 결과에 대한 평가에 기초하여, 데이터 인식 모델이 갱신되도록할 수 있다. 예를 들어, 모델 갱신부(1320-5)는 인식 결과 제공부(1320-4)에 의해 제공 되는 인식 결과를 모델 학습부(1310-4)에게 제공함으로써, 모델 학습부(1310-4)가 데이터 인식 모델을 갱신하도 록 할 수 있다. 한편, 데이터 인식부 내의 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 디바이스에 탑재될 수 있다. 예를 들어, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320- 3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 전술한 각종 디바이스에 탑재 될 수도 있다. 또한, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5)는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부 (1320-4) 및 모델 갱신부(1320-5) 중 일부는 전자 장치에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 또한, 데이터 획득부(1320-1), 전처리부(1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(1320-1), 전처리부 (1320-2), 인식 데이터 선택부(1320-3), 인식 결과 제공부(1320-4) 및 모델 갱신부(1320-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인스터력션(instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 또한, 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 적어도 하나의 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 또한, 이미지 획득 장치는 학습된 결과가 적용된 학습 모델을 이용하여 사용자의 의도에 부합하는 이미지 를 사용자에게 제공할 수 있게 된다. 도 36은 일부 실시예에 따른 이미지 획득 장치 및 서버가 서로 연동함으로써 데이터를 학습하고 인 식하는 예시를 나타내는 도면이다. 도 36을 참조하면, 서버는 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하기 위한 기준, 부 대상 체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하기 위한 기준 및 데이 터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하기 위한 기준을 학습하고, 이미지 획득 장치는 서버에 의한 학습 결과에 기초하여 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하고, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로 부터 제거하며, 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복 원할 수 있다. 이 경우, 서버의 모델 학습부는 도 33에 도시된 데이터 학습부의 기능을 수행할 수 있다. 서버의 모델 학습부는 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하기 위한 기준을 학습 할 수 있다. 모델 학습부는 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하기 위하여 어떤 데이터 를 이용할 지에 관한 기준을 학습할 수 있다. 모델 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적용함으로써, 제1 이미지에 포함된 주 대상체 및 부 대상체를 검출하기 위한 기준을 학습할 수 있다. 모델 학습부는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하기 위한 기준을 학습할 수 있다. 데이터 학습부는 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하기 위하여 어떤 데이터를 이용할 지에 관한 기준을 학습할 수 있다. 모델 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적 용함으로써, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하기위한 기준을 학습할 수 있다. 모델 학습부는 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도 록 복원하기 위한 기준을 학습할 수 있다. 모델 학습부는 데이터가 제거된 영역을 부 대상체에 의해서 가 려진 주 대상체의 적어도 일부가 포함되도록 복원하기 위하여 어떤 데이터를 이용할 지에 관한 기준을 학습할 수 있다. 모델 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적용함으로써, 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원 하기 위한 기준을 학습할 수 있다. 모델 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 학습 모델에 적용함으로써, 제 1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하는 기준, 부 대상체가 위치된 제1 이미지의 적 어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하는 기준 및 데이터가 제거된 영역을 부 대상체에 의 해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하는 기준 중 적어도 하나를 학습할 수 있다. 또한, 이미지 획득 장치의 인식 결과 제공부(1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이 터를 서버에 의해 데이터 인식 모델에 적용하여 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하 나를 검출하고, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거 하며, 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원 할 수 있다. 예를 들어, 인식 결과 제공부(1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 서버(200 0)에게 전송하고, 서버가 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 인식 모델에 적용하여 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하고, 부 대상체가 위치된 제1 이미지의 적어도 일 부 영역에 관련된 데이터를 제1 이미지로부터 제거하며, 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원 할 것을 요청할 수 있다. 또한, 인식 결과 제공부(1320-4)는 서버에 의해 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하 나를 검출하고, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거 하며, 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원하는 방 법에 관한 정보를 서버로부터 수신할 수 있다. 또는, 이미지 획득 장치의 인식 결과 제공부(1320-4)는 서버에 의해 생성된 인식 모델을 서버 로부터 수신하고, 수신된 인식 모델을 이용하여 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하 나를 검출할 수 있다. 또한, 인식 결과 제공부(1320-4)는 수신된 인식 모델을 이용하여 부 대상체가 위치된 제 1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하며, 데이터가 제거된 영역을 부 대상 체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원할 수 있다. 이 경우, 이미지 획득 장치(100 0)의 인식 결과 제공부(1320-4)는 인식 데이터 선택부(1320-3)에 의해 선택된 데이터를 서버로부터 수신 된 인식 모델에 적용하여 제1 이미지로부터 주 대상체 및 부 대상체 중 적어도 하나를 검출하고, 부 대상체가 위치된 제1 이미지의 적어도 일부 영역에 관련된 데이터를 제1 이미지로부터 제거하며, 데이터가 제거된 영역을 부 대상체에 의해서 가려진 주 대상체의 적어도 일부가 포함되도록 복원 할 수 있다. 또한, 이미지 획득 장치 및 서버는 학습 모델의 학습 및 데이터 인식을 위한 작업을 효과적으로 분 배하여 수행할 수 있으며, 이를 통하여, 사용자의 의도에 부합하는 서비스를 제공하기 위하여 데이터 처리를 효 율적으로 수행하고, 사용자의 프라이버시를 효과적으로 보호할 수 있다. 일부 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기 록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매 체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매 체는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데 이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발 성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 본 명세서에서, “부”는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로 세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다."}
{"patent_id": "10-2024-0166504", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2024-0166504", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일부 실시예에 따른, 이미지 획득 장치가 이미지를 획득하는 예시를 나타내는 도면이다. 도 2는 일부 실시예에 따른, 이미지 획득 장치가 이미지를 획득하는 방법에 관한 순서도이다. 도 3 내지 도 5는 일부 실시예에 따른, 부 대상체를 나타내는 표식을 디스플레이하는 예시를 나타내는 도면이다. 도 6은 일부 실시예에 따른, 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 방법에 관한 순서도이다.도 7 내지 도 11은 일부 실시예에 따른, 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 예시를 나타 내는 도면이다. 도 12는 일부 실시예에 따른, 사용자 입력에 대응하여 부 대상체를 검출하는 방법에 관한 순서도이다. 도 13 및 도 14는 일부 실시예에 따른, 사용자 입력에 대응하여 부 대상체를 검출하는 예시를 나타내는 도면이 다. 도 15는 일부 실시예에 따른, 사용자 입력에 대응하여 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 방법에 관한 순서도이다. 도 16 내지 도 18은 일부 실시예에 따른, 사용자 입력에 대응하여 부 대상체에 가려진 주 대상체의 적어도 일부 를 복원하는 예시를 나타내는 도면이다. 도 19는 일부 실시예에 따른, 이미지 내에서 부 대상체의 움직임을 추적하는 방법에 관한 순서도이다. 도 20 내지 도 23은 일부 실시예에 따른, 이미지 내에서 부 대상체의 움직임을 추적하는 예시를 나타내는 도면 이다. 도 24는 일부 실시예에 따른, 카메라와 주 대상체 및 부 대상체 중 적어도 하나와의 상대적인 위치에 기초하여, 부 대상체에 가려진 주 대상체의 적어도 일부를 복원하는 예시를 나타내는 방법에 관한 순서도이다. 도 25 및 도 26은 일부 실시예에 따른, 카메라가 이동할 때 주 대상체 및 부 대상체를 검출하는 예시를 나타내 는 도면이다. 도 27은 일부 실시예에 따른, 서버를 이용하여 부 대상체를 나타내는 표식을 디스플레이하는 방법을 나타내는 도면이다. 도 28 및 도 29는 일부 실시예에 따른, 서버를 이용하여 부 대상체를 나타내는 표식을 디스플레이하는 예시를 나타내는 도면이다. 도 30 및 도 31은 일부 실시예에 따른 이미지 획득 장치의 블록도이다. 도 32는 일부 실시예에 따른 서버의 블록도이다. 도 33은 일부 실시예에 따른 프로세서의 블록도이다. 도 34는 일부 실시예에 따른 데이터 학습부의 블록도이다. 도 35는 일부 실시예에 따른 데이터 인식부의 블록도이다. 도 36은 일부 실시예에 따른 이미지 획득 장치 및 서버가 서로 연동함으로써 데이터를 학습하고 인 식하는 예시를 나타내는 도면이다."}
