{"patent_id": "10-2009-0037315", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2009-0113796", "출원번호": "10-2009-0037315", "출원인": "한양대학교 산학협력단", "발명자": "서일홍"}}
{"patent_id": "10-2009-0037315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "로봇의 대안 행동 결정 방법에 있어서,(a) 물체들의 명칭들, 공간들의 명칭들, 시공간적 관계들을 나타내는 명칭들, 행동을 표현하는 행동 명칭들 사이에 연관 관계를 규정하고, 상기 연관 관계 각각에 개별적인 가중치가 부여되는 자료 구조를 구축하는 단계;(b) 수행할 명령으로부터 목표 대상 및 목표 행동을 결정하는 단계;(c) 상기 목표 대상과 연관 관계에 있는 항목들 중 입력 이미지에서 확인된 항목을 주변 항목으로 결정하는 단계;(d) 상기 주변 항목과 연관 관계를 갖는 항목들 중 상기 가중치가 가장 큰 연관 관계에 있는 항목을 상기 주변항목과 다른 범주의 명칭들 중에서 선택하여 승자 노드로 결정하는 단계; 및(e) 상기 승자 노드와 연관 관계에 있는 행동 명칭들 중 상기 가중치가 가장 큰 연관 관계에 있는 행동 명칭을대안 행동으로 결정하는 단계를 포함하는 것을 특징으로 하는 로봇의 대안 행동 결정 방법."}
{"patent_id": "10-2009-0037315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,(f) 상기 대안 행동을 수행하고 제2 이미지를 촬영하는 단계; 및(g) 상기 제2 이미지를 상기 입력 이미지로 하여 상기 (c) 내지 (e) 단계를 수행하는 단계를 더 포함하고,상기 명령 완수 전 또는 상기 대안 행동의 수행 횟수가 기준치에 도달하기 전까지 상기 (f), (g) 단계를 반복하는 것을 특징으로 하는 로봇의 대안 행동 결정 방법."}
{"patent_id": "10-2009-0037315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 명령의 수행 여부에 따라, 상기 대안 행동을 결정하는 과정에서 선택된 연관 관계의 가중치를 가감하는 단계를 더 포함하는 것을 특징으로 하는 로봇의 대안 행동 결정 방법."}
{"patent_id": "10-2009-0037315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 또는 제2항에 있어서,상기 연관 관계의 가중치가 소정의 속성 제거 값보다 작은 경우, 상기 연관 관계를 소멸시키는 단계를 더 포함하는 것을 특징으로 하는 로봇의 대안 행동 결정 방법."}
{"patent_id": "10-2009-0037315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 또는 제2항에 있어서,상기 자료 구조는 다음과 같이 정의되는 것을 특징으로 하는 로봇의 대안 행동 결정 방법:wASN Description tuple := {predicate(subject,object),weight}"}
{"patent_id": "10-2009-0037315", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 또는 제2항에 있어서,상기 목표 대상과 연관 관계에 있는 항목들은 상기 물체들의 명칭들을 물체 클래스, 상기 공간들의 명칭들에대해 공간 클래스, 시공간적 관계들을 지칭하는 명칭들에 대해 상황 클래스로 분류되어 선택되는 것을 특징으로 하는 로봇의 대안 행동 결정 방법.명 세 서- 2 -공개특허 10-2009-0113796발명의 상세한 설명 기 술 분 야본 발명은 지능형 서비스 로봇의 대안 행동(alternative action) 추천을 위한 것으로서, 지능적 행동을 요구하 <1>는 모든 로봇 분야 즉, 엔터테인먼트 로봇, 에듀테인먼트 로봇, 전문 서비스 로봇, 개인 서비스 로봇 등의 자율적인 행동이 가능한 서비스 로봇이 임무를 수행함에 있어 대안 행동을 결정하는 방법에 관한 것이다.본 발명은 자율적인 행동으로 임무 수행을 위하여 상황정보를 획득하고 스스로 상황을 판단하여 행동을 선택할 <2>수 있는 지능형 로봇에 적용 가능하며, 물리적인 형태를 가진 하드웨어형 로봇이나 실행 코드로 존재하는 소프트웨어 로봇에도 모두 적용 가능하다. 배 경 기 술지능형 로봇은 주어진 목표 달성을 위해, 환경을 인지하고, 인지된 결과에 근거하여 자신이 담당하고 있는 임무 <3>를 적절히 조절하고 수행하는 방식으로 행동을 전개한다. 인지된 결과를 분석하고 이에 따라 대안 행동을 결정하기 위해서는 상황에 맞는 복합적인 추론 과정이 필요하다.종래의 지능형 로봇은 임무 수행시 발생하는 문제점에 대하여 미리 프로그램된 행동을 취하여 해결하도록 하고 <4>있기 때문에, 로봇이 운행되는 다양한 환경에 을 대한 적응성에 어느 정도의 한계가 있었다. 특히, 로봇이 주어진 명령을 수행하던 중 돌발 상황에 부딪힐 때에는, 천재가 마치 바보로 돌변하는 듯한 행동을 하게 된다.이러한 인공 지능형 모델은 과거 퍼지 이론 내지 뉴럴 네트워크로 모델링되어 깊이 있게 연구된 바 있으나, 생 <5>각하는 웹을 지향하는 \"시맨틱 웹(semantic web)\"에 대한 기술 연구의 발전과 함께 웹 2.0으로 꽃을 피우고 있는 듯하다.시맨틱 웹에 대한 기술 연구는 크게 웹의 표준을 담당하고 있는 W3C를 중심으로 한 RDF(Resource Description <6>Framework) 기반의 온톨로지(Ontology) 기술과 ISO를 중심으로 한 Topic Maps 기술로 나눌 수 있다.RDF 기반의 온톨로지 기술은 크게 RDF, RDF-S(RDF Schema)와 DAMA+OIL, OWL 들이 온톨로지 언어들을 꼽을 수 <7>있다. 가장 기초가 되는 것은 RDF로, 이는 특정 자원에 대한 메타 데이터를 기술하는 XML 기반의 프레임워크이다. RDF는 자원, 속성, 속성 값을 하나의 단위로 취급하는 이른바 \"Triple\" 개념이 그 핵심이다. 자원 속성 표현의 세분화로 인해 자원에 대한 좀 더 정교한 기술이 가능해지고, 자원들 간의 관계 설정이 속성(Predicate)을통해 무한으로 가능하게 되었다. 이러한 시맨틱 웹에 대한 기술 연구는 웹 기반의 네트워크 분야에만 유용한 것은 아니다. 온톨로지 언어들은 복 <8>잡한 추론이 가능하도록 개발되어 왔기 때문에, 복잡한 추론 과정을 요하는 지능형 로봇에도 이러한 온톨로지기술들은 매우 유용할 수 있다. 그렇지만, 지능형 로봇은 웹과 다른 운영 환경을 가지고 있다는 점에서, 진화된온톨로지 언어들이 지능형 로봇에 최적이라고 단정할 수는 없다.지능형 로봇은 지속적인 이미지를 촬영하고, 그 이미지를 분석하며, 행동을 수행하고, 재차 이미지를 촬영하는 <9>과정을 반복하기 때문에, 복잡한 추론에 기한 결과를 도출하는 것보다는 신속한 대안 행동을 결정할 수 있도록하는 것이 더 효율적일 수 있다. 발명의 내용 해결 하고자하는 과제본 발명은 복잡한 추론 과정을 배제하고, 미리 결정된 자료들 사이의 연관 관계에 가중치를 부가함으로써 신속 <10>한 대안 행동을 선택할 수 있도록 하여, 로봇의 운영 환경에 맞는 단순 명료한 추론이 진행되도록 하기 위한 것이다. 과제 해결수단상기 목적은 본 발명의 일 양상에 따른 로봇의 대안 행동 결정 방법에 있어서, (a) 물체들의 명칭들, 공간들의 <11>명칭들, 시공간적 관계들을 나타내는 명칭들, 행동을 표현하는 행동 명칭들 사이에 연관 관계를 규정하고, 상기연관 관계 각각에 개별적인 가중치가 부여되는 자료 구조를 구축하는 단계; (b) 수행할 명령으로부터 목표 대상및 목표 행동을 결정하는 단계; (c) 상기 목표 대상과 연관 관계에 있는 항목들 중 입력 이미지에서 확인된 항- 3 -공개특허 10-2009-0113796목을 주변 항목으로 결정하는 단계; (d) 상기 주변 항목과 연관 관계를 갖는 항목들 중 상기 가중치가 가장 큰연관 관계에 있는 항목을 상기 주변 항목과 다른 범주의 명칭들 중에서 선택하여 승자 노드로 결정하는 단계;및 (e) 상기 승자 노드와 연관 관계에 있는 행동 명칭들 중 상기 가중치가 가장 큰 연관 관계에 있는 행동 명칭을 대안 행동으로 결정하는 단계를 포함하는 것을 특징으로 하는 로봇의 대안 행동 결정 방법에 의해 달성될 수있다.상기 방법은 (f) 상기 대안 행동을 수행하고 제2 이미지를 촬영하는 단계; 및 (g) 상기 제2 이미지를 상기 입력 <12>이미지로 하여 상기 (c) 내지 (e) 단계를 수행하는 단계를 더 포함하고, 상기 명령 완수 전 또는 상기 대안 행동의 수행 횟수가 기준치에 도달하기 전까지 상기 (f), (g) 단계를 반복하는 것으로 할 수 있다.또한, 본 발명은 상기 명령의 수행 여부에 따라, 상기 대안 행동을 결정하는 과정에서 선택된 연관 관계의 가중 <13>치를 가감하는 단계를 더 포함하여 가중치를 변동하는 것이 가능하다. 나아가, 상기 연관 관계의 가중치가 소정의 속성 제거 값보다 작은 경우, 상기 연관 관계를 소멸시키도록 하여 개연성이 적은 연관 관계 혹은 인스턴스를 소멸시키는 것이 바람직하다.본 발명의 자료 구조는 다음과 같이 정의될 수 있으나, 이에 한정되는 것은 아니다. <14>wASN Description tuple := {predicate(subject,object),weight} <15>그리고, 상기 목표 대상과 연관 관계에 있는 항목들은 상기 물체들의 명칭들을 물체 클래스, 상기 공간들의 명 <16>칭들에 대해 공간 클래스, 시공간적 관계들을 지칭하는 명칭들에 대해 상황 클래스로 분류되어 선택되도록 할수 있다. 효 과본 발명에 의해 자율 로봇의 목표 달성을 위한 대안적인 행동을 추천할 수 있어, 자율 로봇이 돌발적인 상황들 <17>에 대해서도 합리적인 기준을 가지고 다음 행동을 스스로 선택하고 수행할 수 있도록 할 수 있다. 또한, 로봇은 복잡한 추론을 대신하여, 가중치를 기반으로 행동이 결합된 자료 구조를 통해 다음 수순의 행동을 <18>신속하게 결정할 수 있다. 발명의 실시를 위한 구체적인 내용도1은 본 발명의 실시예에 따른 가중치 기반 행동 결합 귀납적 부호 및 의미 망(wASN: weighted Action-coupled <19>Semantic Network)(이하, \"wASN\"이라 한다)의 개략적인 연결 구성도이다.도1을 참조하면, 본 발명의 실시예에 따른 데이터 구조는 하층부터 특징(Feature), 물체(Object), 공간(Space), <20>상황(Context)에 이르는 4개의 계층 구조로 구성되고, 로봇의 자료 각각은 복수 개의 행동(Action)과 결합이 되고, 각 자료 구조는 가중치 값을 가진다. 데이터 구조에 대한 이해를 돕기 위하여, 물체 중 컵을 중심으로 계층간 연결 관계를 간략히 설명하도록 한다. <21>\"특징\" 클래스는 모든 물건들의 다양한 다수의 특징(미도시)이 포함되어 있지만, 그 중에서 컵에 관계된 색 특 <22>징으로서 회색, 짙은 회색, 흰색 등의 색 특징이 컵과 연관되어 있다. 특징 클래스는 공간에 관련한 \"라인\", \"코너\" 등과 같은 특징들을 포함할 수 있는데, 이러한 특징 클래스는 본 발명에 있어 필수적인 것은 아니다. 특징 클래스는 입력된 이미지를 통해 인지된 결과를 상징적으로 쉽게 설명하기 위한 것이다. 예컨대, 인지된 결과색상이 회색일 확률이 0.7이고, 흰색이 0.5라는 것은 결과를 매우 단순화한 것이며, 실제로는 시각 집중, 물체인식 등의 과정을 거쳐 특정 물건 혹은 특정 공간이 결정되어, 후술하는 물체 또는 공간 클래스와 연계된다고할 수 있다.\"공간\" 클래스에는 목표 물건인 \"컵\"과 연관된 공간 자료가 선택된다. 도1에서, 컵이 놓여 있는 공간으로 노드 <23>3이 연결되어 있는데, 노드 3에는 컵 이외에도 주전자와 책상이 있다. 또한, 노드 3은 노드 1 및 2와 함께 부엌을 구성하고 있다는 것을 알 수 있다. \"상황\" 클래스는 인접한 물체와 앞(front), 뒤(back), 좌(left), 우(right), 옆(beside), 위(on, above) 등의 <24>공간적 관계로 표현되는 공간적 상황과 시간에 따라 “가까워진다(being near)”, “멀어진다(being far)” 등의 시간적 관계로 표현하는 시간적 상황을 포함한다. 각각의 데이터 자료는 행동과 연결되어 있는데, 예컨대 컵의 경우 “인식,” “집기”, “다가가기” 등과 결합 <25>- 4 -공개특허 10-2009-0113796되어 있다.주목할 점은 각 계층의 데이터 자료들은 연결 관계에 있어 특정 가중치 값을 갖는다는 것이다. 이 가중치 값은 <26>연결된 자료들 사이의 상관관계의 개연성, 빈도, 정확도, 신뢰도 또는 확률 등의 의미를 포괄적으로 나타내는것으로서, 학습에 의해 지속적으로 변경될 수 있다. 이에 대해서는 이하에서 상세히 설명하도록 한다.도1에 도시된 데이터 자료들 간의 관계는 다양한 기술(description)이 가능한 것을 이해할 수 있을 것이다. 이 <27>와 같은 관계성은 종래 RDF 트리플 또는 RDF 기반의 온톨로지 등으로 표현될 수 있다는 사실은 당업자가 충분히이해할 수 있을 것이다. RDF에서 자원을 기술하는 트리플을 다시 한번 살펴보면, 자원을 나타내는 주어(subject), 속성을 나타내는 술어(Predicate), 속성의 값을 나타내는 목적어(Object)로 나눌 수 있다. 본 발명의 일 실시예에 따른 자료구조는 여기에 가중치가 더해지는 형식으로서, wASN Description tuple := <28>{predicate(subject,object),weight}로 주어진다. 도1에 도시된 몇몇 자료 구조들에 대한 wASN Descriptiontuple의 예를 들어보면 다음과 같다:{hasObject(node3,kettle),0.5} ; 노드3이 주전자를 갖는다는 것을 의미하며 가중치는 0.5임. <29>{beside(cup,kettle),0.6}; 컵이 주전자 옆에 위치한다는 것을 뜻하며, 가중치는 0.6임. <30>이와 같이, 속성에 대해서는 무한한 표현이 가능하지만, 유사한 표현이 다른 관점에서 표현될 수도 있다. 예를 <31>들어, 컵과 주전자의 관계는 다음과 같은 wASN Description tuple로 표현될 수도 있다:{hasrelation(kettle,beside),0.4}; 주전자가 \"옆\"이라는 관계에 있다는 것을 의미하며, 가중치는 0.4. <32>{hasrelation(cup,beside),0.4}; 컵이 \"옆\"이라는 관계에 있다는 것을 의미하며 가중치는 0.4. <33>그러나, 상기 자료구조는 본 발명의 일 실시예에 불과한 것임을 주목해야 한다. 이러한 자료구조는 시맨틱 웹에 <34>활용되고 있는 온톨로지 언어, Topic maps 등에 가중치를 부가하는 형식으로 대체될 수 있다는 것을 당업자는용이하게 이해할 수 있을 것이다.도2는 wASN을 참조 모델로 대안 행동 추천을 위한 절차 기억(BoP)를 나타내는 도면이다. BoP에서 요청하는 자료 <35>구조와 가중치는 wASN으로부터 입력된다.목표가 주어지면, 목표의 대상은 상황, 물체, 공간 (Context, Object, Space: COS) 자료 구조의 노드가 되고, <36>대상 행동은 행동 자료 구조의 노드가 된다. 그리고, 목표의 대상과 연관되어 있는 상황, 물체, 공간의 클래스내에 포함된 자료들이 또한 각각의 노드를 구성하게 되며, 대상 행동과 연관되어 있는 세부 행동들이 각각의 노드를 구성하게 된다. 여기에서, 대상 행동과 세부 행동들 또한 전술한 wASN Description tuple 형식으로 상호연관된 자료들이다.대상 행동을 위해 추천된 대안 행동들이 수행됨에 따라 그 결과들이 인식되는데, 그 인식 결과는 특정적으로 또 <37>는 확률적으로 주어지게 된다. 예를 들어, 현재 입력된 이미지가 주전자인지 혹은 컵인지가 정해지는데, 그 결과는 또한 확률적(혹은 가중치)으로 주어질 수 있다. 물체 인식의 상세한 방법은 본 발명의 직접적인 내용은 아니므로 이에 대해 자세한 언급은 하지 않고, 필요한 <38>범위 내에서 간략하게 언급하도록 한다. 물체 인식은 색상, 휘도(intensity), 무늬(orientation), 모양 등의 유사도를 기초로 수행되는 것이 <39>일반적이다. 따라서, 물체 인식의 결과는 특정 물건에 대한 확정적인 결과로 나타나기도 하고, 특정 공간에 대한 결과로 나타나기도 한다. 그러므로, 인식의 결과로 목표의 대상과 관련된 물건이 인식되면, 물체 클래스에서해당 물건이 바로 결정되는 것이며, 또는 목표의 대상과 관련한 공간이 인식되면 공간 클래스에서 해당 공간이바로 결정되는 것이다. 이러한 일련의 인식 과정을 도2에서는 \"인지(Perception)\" 클래스로서 간략하게 상징적으로 표현하였다.인식 결과로 물체 클래스에서 결정된 물건과 연결된 다른 클래스들(상황, 공간) 내의 자료들 중 가장 큰 가중치 <40>를 갖는 것이 승자 노드로 결정되고, 그 승자 노드와 연관된 행동들 중 가장 큰 가중치를 갖는 것이 승자 노드가 되어 해당 행동이 대안 행동으로서 수행된다. 또는, 인지 결과가 인지 클래스 혹은 특징 클래스의 자료에 대한 확률 또는 가중치로 주어지는 경우, 각각의 자료에 대한 가중치와 물체 클래스내 각각의 물체와 연결된 자료들 사이의 가중치를 곱한 결과가 가장 큰 노드를 승자 노드로 결정하고, 이에 기초하여 대안 행동을 결정할 수있다.- 5 -공개특허 10-2009-0113796다음, 수행된 대안 행동의 결과는 새로운 인식 과정을 통해 인식 결과를 초래하여 지금까지 설명한 순환적인 과 <41>정을 반복하도록 한다. 이러한 순환적인 과정을 통하여 자율 로봇은 주어진 목표에 따라 제시되는 대안 행동을취합함으로써 임무를 수행하게 되는 것이다.도3은 본 발명의 실시예에 따라 대안 행동을 수행하고, 그 결과를 가중치에 반영하는 과정을 나타내는 전반적인 <42>알고리즘을 간략하게 나타낸다.알고리즘은 초기화 상태, 성장 상태, 갱신 상태의 3개의 상태를 거친다. <43>초기화 상태에서는 BoP를 초기화시켜 모든 노드와 속성을 제거한다. 이후 목표(goal)가 주어지면 그 대상은 COS <44>자료 구조의 노드가 되고, 대상 행동은 행동 자료 구조의 노드가 된다. 두 노드와 직접 연결된 모든 노드들과그 가중치를 wASN으로부터 가져온다.성장 상태는 목표를 달성하거나, 시행 햇수가 주어진 횟수를 초과할 때까지 수행이 된다. 성장 상태는 다시 특 <45>징 자료 구조와의 연결(Grounding) 단계와 COS 자료 구조에서의 활성화(Activation) 단계의 두 단계로 나뉜다.연결 단계에서는 인식된 값이 특징의 노드로 표현이 되고, COS(Context·Object·Space) 자료 구조 중 가장 유사한 자료 구조의 속성 노드와 비교하여 COS 노드와 연결한다. 그 유사도는 가중치로 표현되는데, 전술한 바와같이 연결 단계는 인식된 값이 특징의 노드로 표현되는 과정이 생략되고, 직접적으로 COS 노드와 연결될 수도있다는 점에 주의한다. 활성 단계에서는 목표의 대상 노드와 입력된 특징 노드를 활성화시킨다. 가중치 곱 또는 가중치 크기에 따라 <46>노드의 값이 결정되고, 노드 중 가장 값이 높은 하나를 선택하여 COS 자료 구조의 승자 노드가 된다. 이와 연결된 행동 노드들의 가중치에 따라 행동 자료 구조 중에서 하나를 승자 노드로 결정한다. 행동 자료 구조의 승자노드가 대안 행동으로 선택된다. 전술한 바와 같아. 가중치를 기초로 승자 노드를 결정하는 방법은 자료 노드들사이의 가중치의 크기, 가중치들의 곱 등 다양한 방법으로 취사 선택될 수 있는 것이므로, 본 발명은 가중치를기초로 한 승자 노드 결정 방법에 특별한 한정되지는 않는다.갱신 상태에서는 목표가 달성된 경우와 실패한 경우로 나뉘게 된다. 목표가 달성된 경우는 목표가 달성될 때까 <47>지의 모든 승자 노드에 할인된 성공 보상 값을 wASN의 가중치에 더한다, 실패의 경우 모든 승자 노드에 할인된실패 보상 값을 wASN의 가중치에서 차감한다.변동된 가중치는 새로운 연관 관계를 생성하기도 하고, 연관 관계 내지는 속성 자체의 자료 구조를 삭제하는 결 <48>과로 나타난다. 예컨대, 인접한 두 항목들 또는 속성들간의 가중치의 합이 소정의 속성 생성 값 이상인 경우 두노드 간에 새로운 속성 또는 연관 관계를 생성하고, 가중치들의 평균값을 새로운 연관 관계에 대한 가중치로 한다. 한편, 소정의 속성 제거 값보다 낮아진 가중치의 속성은 wASN에서 제거하여, 속성, 연관 관계, 또는 자료구조가 진화되도록 한다.도4 내지 도7은 본 발명의 일 실시예에 따라 명령을 달성하는 과정을 나타낸다. <49>먼저, 도4를 참조하면, \"컵을 찾으라\"는 명령이 입력될 때, 데이터 구조 중 해당 명령에 대응하는 항목들이 각 <50>계층에 노드로서 자리한다. 즉, 초기에는 각 계층이 비워져 있는 상태에서, 물체 계층에는 \"컵\"이 위치하고, 다른 계층에는 \"컵\"과 연관되어 연결관계를 갖는 항목들이 위치한다. 예를 들어, 특징 계층에는 \"회색\", \"흰색\", \"짙은 회색\"이 위치하고, 물체 계층에는 \"주전자\"가 위치하고, 공간 <51>계층에는 \"노드3\" 또는 \"부엌\"이 위치된다. 상황 계층에도 컵과 관련되어 \"근처\", \"위\" 등이 wASN로부터 로딩된다. 컵을 중심으로 한 모든 연결 관계들은 가중치를 가진다. 다음, 도4에 도시된 바와 같이, 현재 촬상된 영상 데이터로부터 물체를 인식하고, 색상을 추출한다. 도5와 <52>같이, 갈색이 추출되었다면, 갈색일 때 가장 개연성이 높은 물체로서, 가중치를 기초로 주전자를 선택할 수 있다. 이제 로봇은 잘못된 물체를 인식한 것이므로, 다음 행동을 대안으로 제시해야 한다. <53>이때, 주전자와 연관된 항목 중에서 가장 높은 가중치를 갖는 항목으로 상황 클래스에서 \"근처\"를 찾게 되고, <54>도6에 도시된 바와 같이, \"근처\"와 연관된 행동들의 가중치를 기초로 \"주변을 보라\"는 행동을 찾게 되고, \"주변을 보라\"라는 행동과 연관된 행동들 중 \"접근\"이라는 행동을 가중치를 기반으로 대안 행동으로 선정 수행하게된다.로봇이 \"접근\"이라는 행동을 수행하면 새로운 시점을 얻게 되고, \"컵\"을 찾을 확률이 높은 자리로 신속하게 이 <55>- 6 -공개특허 10-2009-0113796동할 수 있게 되는 것이다.도7은 로봇이 접근 동작에 따라 새로운 시점으로 이동한 후 색상을 추출하여 짙은 회색을 찾게 되는 과정을 보 <56>여준다. 결국, 컵은 복잡한 추론 과정을 거치지 않고, 주어진 가중치에 따라 대안 행동들을 신속하게 결정 수행하게 되고, 그 과정을 반복하면서 로봇은 컵을 찾는 임무를 완수하게 되는 것이다.모든 임무가 완성되었으면 혹은 실패하였으면, 승자 노드들에 대한 연결 관계에 대한 가중치를 가감하게 된다. <57>그러한 가감 방식은 여러 가지 기준을 가지고 적용하는 것이 가능할 것인데, 예컨대 최종적으로 컵이 발견되었을 때, 최근에 승자 노드가 되었던 것에 대해서는 가중치를 큰 폭으로 증가시키고, 상대적으로 이전에 승자 노드가 되었던 것에 대해서는 가중치를 적은 폭으로 증가시키도록 하여 목적 달성에 더 유효하게 작용하였던 자료구조에 더 큰 폭의 가중치를 부여하는 것이 바람직할 것이다.비록 지금까지 본 발명의 몇몇 실시예들이 도시되고 설명되었지만, 본 발명이 속하는 기술분야의 통상의 지식을 <58>가진 당업자라면 본 발명의 원칙이나 정신에서 벗어나지 않으면서 본 실시예를 변형할 수 있음을 알 수 있을 것이다. 발명의 범위는 첨부된 청구항과 그 균등물에 의해 정해질 것이다.도면의 간단한 설명도면 1은 가중치 기반 행동 결합 귀납적 부호 및 의미 망(wASN)의 실시 예이다. <59>도면 2는 wASN을 참조로 대안 행동 추천을 위한 절차 기억(BoP)을 도시한다. <60>도3은 본 발명의 실시예에 따라 대안 행동을 수행하고, 그 결과를 가중치에 반영하는 과정을 나타내는 전반적인 <61>알고리즘을 간략하게 나타낸다.도4 내지 도7은 본 발명의 일 실시예에 따라 명령을 달성하는 과정을 나타낸다. <62> <63>- 7 -공개특허 10-2009-0113796도면 도면1- 8 -공개특허 10-2009-0113796 도면2 도면3- 9 -공개특허 10-2009-0113796 도면4- 10 -공개특허 10-2009-0113796 도면5- 11 -공개특허 10-2009-0113796 도면6- 12 -공개특허 10-2009-0113796 도면7- 13 -공개특허 10-2009-0113796"}
{"patent_id": "10-2009-0037315", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 로봇의 대안 행동 결정 방법에 관한 것으로서, (a) 물체들의 명칭들, 공간들의 명칭들, 시공간적 관계 들을 나타내는 명칭들, 행동을 표현하는 행동 명칭들 사이에 연관 관계를 규정하고, 상기 연관 관계 각각에 개별 적인 가중치가 부여되는 자료 구조를 구축하는 단계; (b) 수행할 명령으로부터 목표 대상 및 목표 행동을 결정하 는 단계; (c) 상기 목표 대상과 연관 관계에 있는 항목들 중 입력 이미지에서 확인된 항목을 주변 항목으로 결정 하는 단계; (d) 상기 주변 항목과 연관 관계를 갖는 항목들 중 상기 가중치가 가장 큰 연관 관계에 있는 항목을 상기 주변 항목과 다른 범주의 명칭들 중에서 선택하여 승자 노드로 결정하는 단계; 및 (e) 상기 승자 노드와 연 관 관계에 있는 행동 명칭들 중 상기 가중치가 가장 큰 연관 관계에 있는 행동 명칭을 대안 행동으로 결정하는 단계를 포함하는 것을 특징으로 하는 로봇의 대안 행동 결정 방법에 관한 것이다. 본 발명에 의해 자율 로봇의 목표 달성을 위한 대안적인 행동을 추천할 수 있어, 자율 로봇이 돌발적인 상황들에 대해서도 합리적인 기준을 가지고 다음 행동을 스스로 선택하고 수행할 수 있도록 할 수 있다. 또한, 로봇은 복 잡한 추론을 대신하여, 가중치를 기반으로 행동이 결합된 자료 구조를 통해 다음 수순의 행동을 신속하게 결정할 수 있다."}
{"patent_id": "10-2009-0037315", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지능형 서비스 로봇의 대안 행동(alternative action) 추천을 위한 것으로서, 지능적 행동을 요구하 <1> 는 모든 로봇 분야 즉, 엔터테인먼트 로봇, 에듀테인먼트 로봇, 전문 서비스 로봇, 개인 서비스 로봇 등의 자율 적인 행동이 가능한 서비스 로봇이 임무를 수행함에 있어 대안 행동을 결정하는 방법에 관한 것이다. 본 발명은 자율적인 행동으로 임무 수행을 위하여 상황정보를 획득하고 스스로 상황을 판단하여 행동을 선택할 <2> 수 있는 지능형 로봇에 적용 가능하며, 물리적인 형태를 가진 하드웨어형 로봇이나 실행 코드로 존재하는 소프 트웨어 로봇에도 모두 적용 가능하다."}
{"patent_id": "10-2009-0037315", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지능형 로봇은 주어진 목표 달성을 위해, 환경을 인지하고, 인지된 결과에 근거하여 자신이 담당하고 있는 임무 <3> 를 적절히 조절하고 수행하는 방식으로 행동을 전개한다. 인지된 결과를 분석하고 이에 따라 대안 행동을 결정 하기 위해서는 상황에 맞는 복합적인 추론 과정이 필요하다. 종래의 지능형 로봇은 임무 수행시 발생하는 문제점에 대하여 미리 프로그램된 행동을 취하여 해결하도록 하고 <4> 있기 때문에, 로봇이 운행되는 다양한 환경에 을 대한 적응성에 어느 정도의 한계가 있었다. 특히, 로봇이 주어 진 명령을 수행하던 중 돌발 상황에 부딪힐 때에는, 천재가 마치 바보로 돌변하는 듯한 행동을 하게 된다. 이러한 인공 지능형 모델은 과거 퍼지 이론 내지 뉴럴 네트워크로 모델링되어 깊이 있게 연구된 바 있으나, 생 <5> 각하는 웹을 지향하는 \"시맨틱 웹(semantic web)\"에 대한 기술 연구의 발전과 함께 웹 2.0으로 꽃을 피우고 있 는 듯하다. 시맨틱 웹에 대한 기술 연구는 크게 웹의 표준을 담당하고 있는 W3C를 중심으로 한 RDF(Resource Description <6> Framework) 기반의 온톨로지(Ontology) 기술과 ISO를 중심으로 한 Topic Maps 기술로 나눌 수 있다. RDF 기반의 온톨로지 기술은 크게 RDF, RDF-S(RDF Schema)와 DAMA+OIL, OWL 들이 온톨로지 언어들을 꼽을 수 <7> 있다. 가장 기초가 되는 것은 RDF로, 이는 특정 자원에 대한 메타 데이터를 기술하는 XML 기반의 프레임워크이 다. RDF는 자원, 속성, 속성 값을 하나의 단위로 취급하는 이른바 \"Triple\" 개념이 그 핵심이다. 자원 속성 표 현의 세분화로 인해 자원에 대한 좀 더 정교한 기술이 가능해지고, 자원들 간의 관계 설정이 속성(Predicate)을 통해 무한으로 가능하게 되었다. 이러한 시맨틱 웹에 대한 기술 연구는 웹 기반의 네트워크 분야에만 유용한 것은 아니다. 온톨로지 언어들은 복 <8> 잡한 추론이 가능하도록 개발되어 왔기 때문에, 복잡한 추론 과정을 요하는 지능형 로봇에도 이러한 온톨로지 기술들은 매우 유용할 수 있다. 그렇지만, 지능형 로봇은 웹과 다른 운영 환경을 가지고 있다는 점에서, 진화된 온톨로지 언어들이 지능형 로봇에 최적이라고 단정할 수는 없다. 지능형 로봇은 지속적인 이미지를 촬영하고, 그 이미지를 분석하며, 행동을 수행하고, 재차 이미지를 촬영하는 <9> 과정을 반복하기 때문에, 복잡한 추론에 기한 결과를 도출하는 것보다는 신속한 대안 행동을 결정할 수 있도록 하는 것이 더 효율적일 수 있다."}
{"patent_id": "10-2009-0037315", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용 해결 하고자하는 과제 본 발명은 복잡한 추론 과정을 배제하고, 미리 결정된 자료들 사이의 연관 관계에 가중치를 부가함으로써 신속 <10> 한 대안 행동을 선택할 수 있도록 하여, 로봇의 운영 환경에 맞는 단순 명료한 추론이 진행되도록 하기 위한 것 이다. 과제 해결수단 상기 목적은 본 발명의 일 양상에 따른 로봇의 대안 행동 결정 방법에 있어서, (a) 물체들의 명칭들, 공간들의 <11> 명칭들, 시공간적 관계들을 나타내는 명칭들, 행동을 표현하는 행동 명칭들 사이에 연관 관계를 규정하고, 상기 연관 관계 각각에 개별적인 가중치가 부여되는 자료 구조를 구축하는 단계; (b) 수행할 명령으로부터 목표 대상 및 목표 행동을 결정하는 단계; (c) 상기 목표 대상과 연관 관계에 있는 항목들 중 입력 이미지에서 확인된 항 - 3 -공개특허 10-2009-0113796목을 주변 항목으로 결정하는 단계; (d) 상기 주변 항목과 연관 관계를 갖는 항목들 중 상기 가중치가 가장 큰 연관 관계에 있는 항목을 상기 주변 항목과 다른 범주의 명칭들 중에서 선택하여 승자 노드로 결정하는 단계; 및 (e) 상기 승자 노드와 연관 관계에 있는 행동 명칭들 중 상기 가중치가 가장 큰 연관 관계에 있는 행동 명칭 을 대안 행동으로 결정하는 단계를 포함하는 것을 특징으로 하는 로봇의 대안 행동 결정 방법에 의해 달성될 수 있다. 상기 방법은 (f) 상기 대안 행동을 수행하고 제2 이미지를 촬영하는 단계; 및 (g) 상기 제2 이미지를 상기 입력 <12> 이미지로 하여 상기 (c) 내지 (e) 단계를 수행하는 단계를 더 포함하고, 상기 명령 완수 전 또는 상기 대안 행 동의 수행 횟수가 기준치에 도달하기 전까지 상기 (f), (g) 단계를 반복하는 것으로 할 수 있다. 또한, 본 발명은 상기 명령의 수행 여부에 따라, 상기 대안 행동을 결정하는 과정에서 선택된 연관 관계의 가중 <13> 치를 가감하는 단계를 더 포함하여 가중치를 변동하는 것이 가능하다. 나아가, 상기 연관 관계의 가중치가 소정 의 속성 제거 값보다 작은 경우, 상기 연관 관계를 소멸시키도록 하여 개연성이 적은 연관 관계 혹은 인스턴스 를 소멸시키는 것이 바람직하다. 본 발명의 자료 구조는 다음과 같이 정의될 수 있으나, 이에 한정되는 것은 아니다. <14> wASN Description tuple := {predicate(subject,object),weight} <15> 그리고, 상기 목표 대상과 연관 관계에 있는 항목들은 상기 물체들의 명칭들을 물체 클래스, 상기 공간들의 명 <16> 칭들에 대해 공간 클래스, 시공간적 관계들을 지칭하는 명칭들에 대해 상황 클래스로 분류되어 선택되도록 할 수 있다. 효 과 본 발명에 의해 자율 로봇의 목표 달성을 위한 대안적인 행동을 추천할 수 있어, 자율 로봇이 돌발적인 상황들 <17> 에 대해서도 합리적인 기준을 가지고 다음 행동을 스스로 선택하고 수행할 수 있도록 할 수 있다. 또한, 로봇은 복잡한 추론을 대신하여, 가중치를 기반으로 행동이 결합된 자료 구조를 통해 다음 수순의 행동을 <18> 신속하게 결정할 수 있다. 발명의 실시를 위한 구체적인 내용 도1은 본 발명의 실시예에 따른 가중치 기반 행동 결합 귀납적 부호 및 의미 망(wASN: weighted Action-coupled <19> Semantic Network)(이하, \"wASN\"이라 한다)의 개략적인 연결 구성도이다. 도1을 참조하면, 본 발명의 실시예에 따른 데이터 구조는 하층부터 특징(Feature), 물체(Object), 공간(Space), <20> 상황(Context)에 이르는 4개의 계층 구조로 구성되고, 로봇의 자료 각각은 복수 개의 행동(Action)과 결합이 되 고, 각 자료 구조는 가중치 값을 가진다. 데이터 구조에 대한 이해를 돕기 위하여, 물체 중 컵을 중심으로 계층간 연결 관계를 간략히 설명하도록 한다. <21> \"특징\" 클래스는 모든 물건들의 다양한 다수의 특징(미도시)이 포함되어 있지만, 그 중에서 컵에 관계된 색 특 <22> 징으로서 회색, 짙은 회색, 흰색 등의 색 특징이 컵과 연관되어 있다. 특징 클래스는 공간에 관련한 \"라인\", \" 코너\" 등과 같은 특징들을 포함할 수 있는데, 이러한 특징 클래스는 본 발명에 있어 필수적인 것은 아니다. 특 징 클래스는 입력된 이미지를 통해 인지된 결과를 상징적으로 쉽게 설명하기 위한 것이다. 예컨대, 인지된 결과 색상이 회색일 확률이 0.7이고, 흰색이 0.5라는 것은 결과를 매우 단순화한 것이며, 실제로는 시각 집중, 물체 인식 등의 과정을 거쳐 특정 물건 혹은 특정 공간이 결정되어, 후술하는 물체 또는 공간 클래스와 연계된다고 할 수 있다. \"공간\" 클래스에는 목표 물건인 \"컵\"과 연관된 공간 자료가 선택된다. 도1에서, 컵이 놓여 있는 공간으로 노드 <23> 3이 연결되어 있는데, 노드 3에는 컵 이외에도 주전자와 책상이 있다. 또한, 노드 3은 노드 1 및 2와 함께 부엌 을 구성하고 있다는 것을 알 수 있다. \"상황\" 클래스는 인접한 물체와 앞(front), 뒤(back), 좌(left), 우(right), 옆(beside), 위(on, above) 등의 <24> 공간적 관계로 표현되는 공간적 상황과 시간에 따라 “가까워진다(being near)”, “멀어진다(being far)” 등 의 시간적 관계로 표현하는 시간적 상황을 포함한다. 각각의 데이터 자료는 행동과 연결되어 있는데, 예컨대 컵의 경우 “인식,” “집기”, “다가가기” 등과 결합 <25> - 4 -공개특허 10-2009-0113796되어 있다. 주목할 점은 각 계층의 데이터 자료들은 연결 관계에 있어 특정 가중치 값을 갖는다는 것이다. 이 가중치 값은 <26> 연결된 자료들 사이의 상관관계의 개연성, 빈도, 정확도, 신뢰도 또는 확률 등의 의미를 포괄적으로 나타내는 것으로서, 학습에 의해 지속적으로 변경될 수 있다. 이에 대해서는 이하에서 상세히 설명하도록 한다. 도1에 도시된 데이터 자료들 간의 관계는 다양한 기술(description)이 가능한 것을 이해할 수 있을 것이다. 이 <27> 와 같은 관계성은 종래 RDF 트리플 또는 RDF 기반의 온톨로지 등으로 표현될 수 있다는 사실은 당업자가 충분히 이해할 수 있을 것이다. RDF에서 자원을 기술하는 트리플을 다시 한번 살펴보면, 자원을 나타내는 주어 (subject), 속성을 나타내는 술어(Predicate), 속성의 값을 나타내는 목적어(Object)로 나눌 수 있다. 본 발명의 일 실시예에 따른 자료구조는 여기에 가중치가 더해지는 형식으로서, wASN Description tuple := <28> {predicate(subject,object),weight}로 주어진다. 도1에 도시된 몇몇 자료 구조들에 대한 wASN Description tuple의 예를 들어보면 다음과 같다: {hasObject(node3,kettle),0.5} ; 노드3이 주전자를 갖는다는 것을 의미하며 가중치는 0.5임. <29> {beside(cup,kettle),0.6}; 컵이 주전자 옆에 위치한다는 것을 뜻하며, 가중치는 0.6임. <30> 이와 같이, 속성에 대해서는 무한한 표현이 가능하지만, 유사한 표현이 다른 관점에서 표현될 수도 있다. 예를 <31> 들어, 컵과 주전자의 관계는 다음과 같은 wASN Description tuple로 표현될 수도 있다: {hasrelation(kettle,beside),0.4}; 주전자가 \"옆\"이라는 관계에 있다는 것을 의미하며, 가중치는 0.4. <32> {hasrelation(cup,beside),0.4}; 컵이 \"옆\"이라는 관계에 있다는 것을 의미하며 가중치는 0.4. <33> 그러나, 상기 자료구조는 본 발명의 일 실시예에 불과한 것임을 주목해야 한다. 이러한 자료구조는 시맨틱 웹에 <34> 활용되고 있는 온톨로지 언어, Topic maps 등에 가중치를 부가하는 형식으로 대체될 수 있다는 것을 당업자는 용이하게 이해할 수 있을 것이다. 도2는 wASN을 참조 모델로 대안 행동 추천을 위한 절차 기억(BoP)를 나타내는 도면이다. BoP에서 요청하는 자료 <35> 구조와 가중치는 wASN으로부터 입력된다. 목표가 주어지면, 목표의 대상은 상황, 물체, 공간 (Context, Object, Space: COS) 자료 구조의 노드가 되고, <36> 대상 행동은 행동 자료 구조의 노드가 된다. 그리고, 목표의 대상과 연관되어 있는 상황, 물체, 공간의 클래스 내에 포함된 자료들이 또한 각각의 노드를 구성하게 되며, 대상 행동과 연관되어 있는 세부 행동들이 각각의 노 드를 구성하게 된다. 여기에서, 대상 행동과 세부 행동들 또한 전술한 wASN Description tuple 형식으로 상호 연관된 자료들이다. 대상 행동을 위해 추천된 대안 행동들이 수행됨에 따라 그 결과들이 인식되는데, 그 인식 결과는 특정적으로 또 <37> 는 확률적으로 주어지게 된다. 예를 들어, 현재 입력된 이미지가 주전자인지 혹은 컵인지가 정해지는데, 그 결 과는 또한 확률적(혹은 가중치)으로 주어질 수 있다. 물체 인식의 상세한 방법은 본 발명의 직접적인 내용은 아니므로 이에 대해 자세한 언급은 하지 않고, 필요한 <38> 범위 내에서 간략하게 언급하도록 한다. 물체 인식은 색상, 휘도(intensity), 무늬(orientation), 모양 등의 유사도를 기초로 수행되는 것이 <39> 일반적이다. 따라서, 물체 인식의 결과는 특정 물건에 대한 확정적인 결과로 나타나기도 하고, 특정 공간에 대 한 결과로 나타나기도 한다. 그러므로, 인식의 결과로 목표의 대상과 관련된 물건이 인식되면, 물체 클래스에서 해당 물건이 바로 결정되는 것이며, 또는 목표의 대상과 관련한 공간이 인식되면 공간 클래스에서 해당 공간이 바로 결정되는 것이다. 이러한 일련의 인식 과정을 도2에서는 \"인지(Perception)\" 클래스로서 간략하게 상징적 으로 표현하였다. 인식 결과로 물체 클래스에서 결정된 물건과 연결된 다른 클래스들(상황, 공간) 내의 자료들 중 가장 큰 가중치 <40> 를 갖는 것이 승자 노드로 결정되고, 그 승자 노드와 연관된 행동들 중 가장 큰 가중치를 갖는 것이 승자 노드 가 되어 해당 행동이 대안 행동으로서 수행된다. 또는, 인지 결과가 인지 클래스 혹은 특징 클래스의 자료에 대 한 확률 또는 가중치로 주어지는 경우, 각각의 자료에 대한 가중치와 물체 클래스내 각각의 물체와 연결된 자료 들 사이의 가중치를 곱한 결과가 가장 큰 노드를 승자 노드로 결정하고, 이에 기초하여 대안 행동을 결정할 수 있다. - 5 -공개특허 10-2009-0113796다음, 수행된 대안 행동의 결과는 새로운 인식 과정을 통해 인식 결과를 초래하여 지금까지 설명한 순환적인 과 <41> 정을 반복하도록 한다. 이러한 순환적인 과정을 통하여 자율 로봇은 주어진 목표에 따라 제시되는 대안 행동을 취합함으로써 임무를 수행하게 되는 것이다. 도3은 본 발명의 실시예에 따라 대안 행동을 수행하고, 그 결과를 가중치에 반영하는 과정을 나타내는 전반적인 <42> 알고리즘을 간략하게 나타낸다. 알고리즘은 초기화 상태, 성장 상태, 갱신 상태의 3개의 상태를 거친다. <43> 초기화 상태에서는 BoP를 초기화시켜 모든 노드와 속성을 제거한다. 이후 목표(goal)가 주어지면 그 대상은 COS <44> 자료 구조의 노드가 되고, 대상 행동은 행동 자료 구조의 노드가 된다. 두 노드와 직접 연결된 모든 노드들과 그 가중치를 wASN으로부터 가져온다. 성장 상태는 목표를 달성하거나, 시행 햇수가 주어진 횟수를 초과할 때까지 수행이 된다. 성장 상태는 다시 특 <45> 징 자료 구조와의 연결(Grounding) 단계와 COS 자료 구조에서의 활성화(Activation) 단계의 두 단계로 나뉜다. 연결 단계에서는 인식된 값이 특징의 노드로 표현이 되고, COS(Context·Object·Space) 자료 구조 중 가장 유 사한 자료 구조의 속성 노드와 비교하여 COS 노드와 연결한다. 그 유사도는 가중치로 표현되는데, 전술한 바와 같이 연결 단계는 인식된 값이 특징의 노드로 표현되는 과정이 생략되고, 직접적으로 COS 노드와 연결될 수도 있다는 점에 주의한다. 활성 단계에서는 목표의 대상 노드와 입력된 특징 노드를 활성화시킨다. 가중치 곱 또는 가중치 크기에 따라 <46> 노드의 값이 결정되고, 노드 중 가장 값이 높은 하나를 선택하여 COS 자료 구조의 승자 노드가 된다. 이와 연결 된 행동 노드들의 가중치에 따라 행동 자료 구조 중에서 하나를 승자 노드로 결정한다. 행동 자료 구조의 승자 노드가 대안 행동으로 선택된다. 전술한 바와 같아. 가중치를 기초로 승자 노드를 결정하는 방법은 자료 노드들 사이의 가중치의 크기, 가중치들의 곱 등 다양한 방법으로 취사 선택될 수 있는 것이므로, 본 발명은 가중치를 기초로 한 승자 노드 결정 방법에 특별한 한정되지는 않는다. 갱신 상태에서는 목표가 달성된 경우와 실패한 경우로 나뉘게 된다. 목표가 달성된 경우는 목표가 달성될 때까 <47> 지의 모든 승자 노드에 할인된 성공 보상 값을 wASN의 가중치에 더한다, 실패의 경우 모든 승자 노드에 할인된 실패 보상 값을 wASN의 가중치에서 차감한다. 변동된 가중치는 새로운 연관 관계를 생성하기도 하고, 연관 관계 내지는 속성 자체의 자료 구조를 삭제하는 결 <48> 과로 나타난다. 예컨대, 인접한 두 항목들 또는 속성들간의 가중치의 합이 소정의 속성 생성 값 이상인 경우 두 노드 간에 새로운 속성 또는 연관 관계를 생성하고, 가중치들의 평균값을 새로운 연관 관계에 대한 가중치로 한 다. 한편, 소정의 속성 제거 값보다 낮아진 가중치의 속성은 wASN에서 제거하여, 속성, 연관 관계, 또는 자료 구조가 진화되도록 한다. 도4 내지 도7은 본 발명의 일 실시예에 따라 명령을 달성하는 과정을 나타낸다. <49> 먼저, 도4를 참조하면, \"컵을 찾으라\"는 명령이 입력될 때, 데이터 구조 중 해당 명령에 대응하는 항목들이 각 <50> 계층에 노드로서 자리한다. 즉, 초기에는 각 계층이 비워져 있는 상태에서, 물체 계층에는 \"컵\"이 위치하고, 다 른 계층에는 \"컵\"과 연관되어 연결관계를 갖는 항목들이 위치한다. 예를 들어, 특징 계층에는 \"회색\", \"흰색\", \"짙은 회색\"이 위치하고, 물체 계층에는 \"주전자\"가 위치하고, 공간 <51> 계층에는 \"노드3\" 또는 \"부엌\"이 위치된다. 상황 계층에도 컵과 관련되어 \"근처\", \"위\" 등이 wASN로부터 로딩된 다. 컵을 중심으로 한 모든 연결 관계들은 가중치를 가진다. 다음, 도4에 도시된 바와 같이, 현재 촬상된 영상 데이터로부터 물체를 인식하고, 색상을 추출한다. 도5와 <52> 같이, 갈색이 추출되었다면, 갈색일 때 가장 개연성이 높은 물체로서, 가중치를 기초로 주전자를 선택할 수 있 다. 이제 로봇은 잘못된 물체를 인식한 것이므로, 다음 행동을 대안으로 제시해야 한다. <53> 이때, 주전자와 연관된 항목 중에서 가장 높은 가중치를 갖는 항목으로 상황 클래스에서 \"근처\"를 찾게 되고, <54> 도6에 도시된 바와 같이, \"근처\"와 연관된 행동들의 가중치를 기초로 \"주변을 보라\"는 행동을 찾게 되고, \"주변 을 보라\"라는 행동과 연관된 행동들 중 \"접근\"이라는 행동을 가중치를 기반으로 대안 행동으로 선정 수행하게 된다. 로봇이 \"접근\"이라는 행동을 수행하면 새로운 시점을 얻게 되고, \"컵\"을 찾을 확률이 높은 자리로 신속하게 이 <55> - 6 -공개특허 10-2009-0113796동할 수 있게 되는 것이다. 도7은 로봇이 접근 동작에 따라 새로운 시점으로 이동한 후 색상을 추출하여 짙은 회색을 찾게 되는 과정을 보 <56> 여준다. 결국, 컵은 복잡한 추론 과정을 거치지 않고, 주어진 가중치에 따라 대안 행동들을 신속하게 결정 수행 하게 되고, 그 과정을 반복하면서 로봇은 컵을 찾는 임무를 완수하게 되는 것이다. 모든 임무가 완성되었으면 혹은 실패하였으면, 승자 노드들에 대한 연결 관계에 대한 가중치를 가감하게 된다. <57> 그러한 가감 방식은 여러 가지 기준을 가지고 적용하는 것이 가능할 것인데, 예컨대 최종적으로 컵이 발견되었 을 때, 최근에 승자 노드가 되었던 것에 대해서는 가중치를 큰 폭으로 증가시키고, 상대적으로 이전에 승자 노 드가 되었던 것에 대해서는 가중치를 적은 폭으로 증가시키도록 하여 목적 달성에 더 유효하게 작용하였던 자료 구조에 더 큰 폭의 가중치를 부여하는 것이 바람직할 것이다."}
{"patent_id": "10-2009-0037315", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "비록 지금까지 본 발명의 몇몇 실시예들이 도시되고 설명되었지만, 본 발명이 속하는 기술분야의 통상의 지식을 <58> 가진 당업자라면 본 발명의 원칙이나 정신에서 벗어나지 않으면서 본 실시예를 변형할 수 있음을 알 수 있을 것 이다. 발명의 범위는 첨부된 청구항과 그 균등물에 의해 정해질 것이다."}
