{"patent_id": "10-2022-0079656", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0100813", "출원번호": "10-2022-0079656", "발명의 명칭": "자율주행 차량 정합 방법, 장치, 전자 기기 및 차량", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "시에, 칭칭"}}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율주행 차량 정합 방법에 있어서,복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성하는 단계;복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성하는 단계;각 상기 제1 검출 포즈 및 각 상기 제2 검출 포즈에 따라 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선을 정렬하는 단계; 및정렬된 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선에 따라 상기 차량용 카메라 및 상기 차량용 위치 결정 기기를 정합하는 단계; 를 포함하는,것을 특징으로 하는 자율주행 차량 정합 방법."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,각 상기 제1 검출 포즈 및 각 상기 제2 검출 포즈에 따라 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선을 정렬하는 단계는,상기 제1 궤적 곡선 중 각 제1 궤적 포인트에 대응되는 제1 검출 포즈에 따라 상기 제2 궤적 곡선 중 각 제2 궤적 포인트에 대응되는 제2 검출 포즈를 조회하여, 매칭되는 제1 검출 포즈 및 제2 검출 포즈를 획득하는 단계;및상기 매칭되는 제1 검출 포즈 및 제2 검출 포즈에 따라 상기 제1 궤적 곡선 중의 제1 궤적 포인트와 상기 제2궤적 곡선 중의 제2 궤적 포인트 사이의 정렬 관계를 결정하는 단계; 를 포함하는,것을 특징으로 하는 자율주행 차량 정합 방법."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,정렬된 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선에 따라 상기 차량용 카메라 및 상기 차량용 위치 결정 기기를 정합하는 단계는,세계 좌표계에서 상기 제1 궤적 곡선 중 적어도 하나의 상기 제1 궤적 포인트의 위치와 상기 세계 좌표계에서상기 제2 궤적 곡선 중 대응되는 제2 궤적 포인트의 위치 사이의 차이에 따라, 상기 차량용 위치 결정 기기에대한 상기 차량용 카메라의 외부 파라미터를 결정하는 단계; 및상기 외부 파라미터를 사용하여 상기 차량용 카메라 및 상기 차량용 위치 결정 기기를 정합하는 단계; 를 포함하는,것을 특징으로 하는 자율주행 차량 정합 방법."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,복수의 상기 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성하는 단계 이전에,지도로부터 표시선의 표기 위치를 획득하는 단계;상기 표기 위치에 따라 곡선 피팅을 수행하여 세계 좌표계에서 상기 표시선의 피팅 곡선을 획득하는 단계;공개특허 10-2022-0100813-3-상기 세계 좌표계에서 복수의 제1 시각에서 상기 차량용 카메라의 추정 포즈에 따라 상기 피팅 곡선을 상기 차량용 카메라의 이미지 좌표계에 투영하여, 복수의 상기 제1 시각에 대응되는 제1 평면 곡선을 획득하는 단계;및상기 복수의 제1 시각에 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되는 제2 평면 곡선사이의 차이에 따라, 대응되는 제1 시각의 추정 포즈를 수정하여 각 상기 제1 시각의 상기 제1 검출 포즈를 획득하는 단계; 를 더 포함하는,것을 특징으로 하는 자율주행 차량 정합 방법."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,복수의 제1 시각에 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되는 제2 평면 곡선사이의 차이에 따라, 대응되는 제1 시각의 추정 포즈를 수정하여 각 상기 제1 시각의 상기 제1 검출 포즈를 획득하는 단계는,임의의 상기 제1 시각에 대해, 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되는 제2 평면 곡선 사이의 차이를 결정하는 단계; 및각 상기 제1 시각의 상기 차이에 따라, 대응되는 제1 시각의 추정 포즈를 조정하여 상기 차이를 최소화하는 제1검출 포즈를 획득하는 단계; 를 포함하는,것을 특징으로 하는 자율주행 차량 정합 방법."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,각 상기 제1 시각의 상기 차이에 따라, 대응되는 제1 시각의 추정 포즈를 조정하여 상기 차이를 최소화하는 제1검출 포즈를 획득하는 단계는,비선형 최적화 알고리즘을 사용하여 각 상기 제1 시각의 상기 차이에 따라, 대응되는 제1 시각의 추정 포즈를조정하여 상기 차이를 최소화하는 제1 검출 포즈를 획득하는 단계; 또는 임의의 상기 제1 시각의 추정 포즈에 따라 설정 범위 내에서 포즈를 조정하여, 조정된 포즈 중 상기 차이를 최소화하는 포즈를 제1 시각에 대응하는 제1 검출 포즈로 사용하는 단계; 를 포함하는,것을 특징으로 하는 자율주행 차량 정합 방법."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "자율주행 차량 정합 장치에 있어서,복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성하는 제1 생성 모듈; 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성하는 제2 생성 모듈; 각 상기 제1 검출 포즈 및 각 상기 제2 검출 포즈에 따라 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선을 정렬하는 정렬 모듈; 및정렬된 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선에 따라 상기 차량용 카메라 및 상기 차량용 위치 결정 기기를 정합하는 정합 모듈; 을 포함하는,것을 특징으로 하는 자율주행 차량 정합 장치."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 정렬 모듈은,상기 제1 궤적 곡선 중 각 제1 궤적 포인트에 대응되는 제1 검출 포즈에 따라 상기 제2 궤적 곡선 중 각 제2 궤공개특허 10-2022-0100813-4-적 포인트에 대응되는 제2 검출 포즈를 조회하여, 매칭되는 제1 검출 포즈 및 제2 검출 포즈를 획득하고;상기 매칭되는 제1 검출 포즈 및 제2 검출 포즈에 따라 상기 제1 궤적 곡선 중의 제1 궤적 포인트와 상기 제2궤적 곡선 중의 제2 궤적 포인트 사이의 정렬 관계를 결정하는,것을 특징으로 하는 자율주행 차량 정합 장치."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 정합 모듈은,세계 좌표계에서 상기 제1 궤적 곡선 중 적어도 하나의 상기 제1 궤적 포인트의 위치와 상기 세계 좌표계에서상기 제2 궤적 곡선 중 대응되는 제2 궤적 포인트의 위치 사이의 차이에 따라, 상기 차량용 위치 결정 기기에대한 상기 차량용 카메라의 외부 파라미터를 결정하고;상기 외부 파라미터를 사용하여 상기 차량용 카메라 및 상기 차량용 위치 결정 기기를 정합하는,것을 특징으로 하는 자율주행 차량 정합 장치."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항 내지 제9항 중 어느 한 항에 있어서,지도로부터 표시선의 표기 위치를 획득하는 획득 모듈;상기 표기 위치에 따라 곡선 피팅을 수행하여 세계 좌표계에서 상기 표시선의 피팅 곡선을 획득하는 피팅 모듈;상기 세계 좌표계에서 복수의 제1 시각에서 상기 차량용 카메라의 추정 포즈에 따라 상기 피팅 곡선을 상기 차량용 카메라의 이미지 좌표계에 투영하여, 복수의 상기 제1 시각에 대응되는 제1 평면 곡선을 획득하는 투영 모듈; 및상기 복수의 제1 시각에 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되는 제2 평면 곡선사이의 차이에 따라, 대응되는 제1 시각의 추정 포즈를 수정하여 각 상기 제1 시각의 상기 제1 검출 포즈를 획득하는 수정 모듈; 을 더 포함하는,것을 특징으로 하는 자율주행 차량 정합 장치."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 수정 모듈은,임의의 상기 제1 시각에 대해, 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되는 제2 평면 곡선 사이의 차이를 결정하는 결정 유닛; 및각 상기 제1 시각의 상기 차이에 따라, 대응되는 제1 시각의 추정 포즈를 조정하여 상기 차이를 최소화하는 제1검출 포즈를 획득하는 조정 유닛; 을 포함하는,것을 특징으로 하는 자율주행 차량 정합 장치."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 조정 유닛은,비선형 최적화 알고리즘을 사용하여 각 상기 제1 시각의 상기 차이에 따라, 대응되는 제1 시각의 추정 포즈를조정하여 상기 차이를 최소화하는 제1 검출 포즈를 획득하거나; 또는 임의의 상기 제1 시각의 추정 포즈에 따라 설정 범위 내에서 포즈를 조정하여, 조정된 포즈 중 상기 차이를 최소화하는 포즈를 제1 시각에 대응하는 제1 검출 포즈로 사용하는,공개특허 10-2022-0100813-5-것을 특징으로 하는 자율주행 차량 정합 장치."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "전자 기기에 있어서,적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결되는 메모리; 를 포함하고,상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되고, 상기 명령이 상기 적어도하나의 프로세서에 의해 실행될 경우, 상기 적어도 하나의 프로세서가 제1항 내지 제6항 중 어느 한 항에 따른자율주행 차량 정합 방법을 수행하는,것을 특징으로 하는 전자 기기."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨터 프로그램이 저장된 비일시적 컴퓨터 판독 가능 저장 매체에 있어서,상기 컴퓨터 프로그램 중의 명령이 실행될 경우, 제1항 내지 제6항 중 어느 한 항에 따른 자율주행 차량 정합방법이 구현되는,것을 특징으로 하는 컴퓨터 프로그램이 저장된 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "컴퓨터 판독 가능 저장 매체에 저장된 컴퓨터 프로그램에 있어서,상기 컴퓨터 프로그램 중의 명령이 실행될 경우, 제1항 내지 제6항 중 어느 한 항에 따른 자율주행 차량 정합방법이 구현되는,것을 특징으로 하는 컴퓨터 판독 가능 저장 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0079656", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "자율주행 차량에 있어서,제13항에 따른 전자 기기를 포함하는,것을 특징으로 하는 자율주행 차량."}
{"patent_id": "10-2022-0079656", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 자율주행, 지능형 교통 등 분야에 관한 자율주행 차량 정합 방법, 장치, 전자 기기 및 차량을 개시한 다. 구체적인 구현 방식은, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성하 고, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성하며, 각 제1 검 출 포즈 및 각 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬하여, 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합하는 것이다. 이로써, 포즈에 따라 차량용 카 메라의 제1 궤적 곡선 및 차량용 위치 결정 기기의 제2 궤적 곡선을 정렬하고, 정렬 결과에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합하여, 시간에 따른 정렬로 인한 정합 효과(즉 보정 효과)가 떨어지는 상황을 방 지하여 보정 결과의 정확성을 향상시킬 수 있다."}
{"patent_id": "10-2022-0079656", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 자율주행, 지능형 교통 등 AI(Artificial Intelligence, 인공 지능) 분야에 관한 것으로, 특히 자율 주행 차량 정합 방법, 장치, 전자 기기 및 차량에 관한 것이다."}
{"patent_id": "10-2022-0079656", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율주행 차량 주행 과정에서, 차체의 감지 및 위치 결정을 완료하기 위해서는 다양한 센서의 협동 작업이 필요 한 바, 여기서 다양한 센서의 협동 작업 전제는 각 센서 사이의 좌표 변환 관계를 이해해야 하는 것이며, 각 센 서 사이의 좌표 변환 관계는 사전 보정을 통해 획득할 수 있다. 예를 들면, 현재 다양한 무인 차량 플랫폼에서, 카메라와 위치 결정 기기(예를 들면, 관성 측정 장치(Inertial Measurement Unit, IMU))를 통해 보다 정밀한 위치 결정 및 감지를 완료할 수 있으므로, 카메라와 위치 결정 기기에 대한 보정 방법은 매우 중요하다."}
{"patent_id": "10-2022-0079656", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원은 자율주행 차량 정합 방법, 장치, 전자 기기 및 차량을 제공한다."}
{"patent_id": "10-2022-0079656", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일 양태에 따르면, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성하는 단계; 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성하는 단계; 각 상기 제1 검출 포즈 및 각 상기 제2 검출 포즈에 따라 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선을 정렬하 는 단계; 및 정렬된 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선에 따라 상기 차량용 카메라 및 상기 차량용 위치 결정 기기 를 정합하는 단계; 를 포함하는 자율주행 차량 정합 방법을 제공한다. 본 출원의 다른 양태에 따르면, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성하는 제1 생성 모듈; 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성하는 제2 생성 모듈; 각 상기 제1 검출 포즈 및 각 상기 제2 검출 포즈에 따라 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선을 정렬하 는 정렬 모듈; 및 정렬된 상기 제1 궤적 곡선 및 상기 제2 궤적 곡선에 따라 상기 차량용 카메라 및 상기 차량용 위치 결정 기기 를 정합하는 정합 모듈; 을 포함하는 자율주행 차량 정합 장치를 제공한다. 본 출원의 또 다른 양태에 따르면, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리; 를 포함하는 전자 기기를 제공하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행될 경우, 상기 적어도 하나의 프로세서가 본 출원의 상기 일 양태에서 제공된 자율 주행 차량 정합 방법을 수행한다. 본 출원의 또 다른 양태에 따르면, 컴퓨터 프로그램이 저장된 비일시적 컴퓨터 판독 가능 저장 매체를 제공하되, 상기 컴퓨터 프로그램 중의 명령이 실행될 경우, 상기 일 양태에서 제공된 자율주행 차량 정합 방법 이 구현된다. 본 출원의 또 다른 양태에 따르면, 컴퓨터 판독 가능 저장 매체에 저장된 컴퓨터 프로그램을 제공하되, 상기 컴 퓨터 프로그램 중의 명령이 실행될 경우, 본 출원의 상기 일 양태에서 제공된 자율주행 차량 정합 방법이 구현 된다. 본 출원의 또 다른 양태에 따르면, 본 출원의 상기 또 다른 양태에서 제공된 전자 기기를 포함하는 자율주행 차 량을 제공한다. 본 부분에서 설명된 내용은 본 출원의 실시예의 핵심 또는 중요한 특징을 식별하기 위한 것이 아니며, 본 출원 의 범위를 한정하려는 것도 아님을 이해해야 할 것이다. 본 출원의 다른 특징은 아래 명세서에 의해 쉽게 이해 될 것이다."}
{"patent_id": "10-2022-0079656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래 도면을 결합하여 본 출원의 예시적 실시예를 설명하되, 여기에는 이해를 돕기 위한 본 출원의 실시예의 다"}
{"patent_id": "10-2022-0079656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "양한 세부 사항들이 포함되지만, 이들은 단지 예시적인 것으로 간주되어야 한다. 따라서, 본 기술분야의 통상의 기술자는 본 출원의 범위 및 정신을 벗어나지 않으면서 여기서 설명된 실시예에 대해 다양한 변형 및 수정을 진 행할 수 있음을 이해해야 할 것이다. 마찬가지로, 명확 및 간략을 위해, 아래의 설명에서 공지 기능 및 구조에 대한 설명을 생략한다. 관련 기술에서, 카메라와 위치 결정 기기의 보정 과정은, 시각적 위치 결정 기술을 사용하여 카메라의 이동 궤 적을 생성하고, 카메라의 이동 궤적을 위치 결정 기기의 시간적으로 가장 가까운 이웃 궤적 포인트와 정렬함으 로써 카메라와 위치 결정 기기의 보정을 구현하는 것이다. 그러나, 시각적 위치 결정 기술은 그 특징 추출의 견고성, 시야 문제로 인한 위치 결정 차원의 퇴화 및 흐릿한 척도 등 문제로 인해, 획득된 이동 궤적이 종종 정확하지 않아, 보정 효과를 떨어뜨린다. 또한, 카메라와 위치 결정 기기의 데이터는 동기적으로 트리거 및 획득되지 않는 경우가 많으며, 시간적으로 가장 가까운 이웃 위치 결정 기기의 궤적 포인트와 카메라 궤적 포인트를 정렬하는 방식만 사용하고, 시간 차이로 인한 궤적 변화를 고 려하지 않으므로, 이러한 궤적을 사용하여 위치 결정 기기의 궤적과 정렬하는 것으로는 양호한 보정 파라미터를 획득하기 어렵다. 따라서 상기 존재하는 문제에 대해, 본 출원은 자율주행 차량 정합 방법, 장치, 전자 기기 및 차량을 제공한다. 아래에 도면을 참조하여 본 출원의 실시예의 자율주행 차량 정합 방법, 장치, 전자 기기 및 차량을 설명한다. 도 1은 본 출원의 실시예1에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 본 출원의 실시예는 상기 자율주행 차량 정합 방법이 자율주행 차량 정합 장치에 구성되는 것을 예시적으로 설 명하며, 상기 정합 장치는 임의의 전자 기기에 적용될 수 있어 상기 전자 기기가 정합 기능을 수행할 수 있도록 한다. 여기서, 전자 기기는 개인용 컴퓨터(Personal Computer, PC로 약칭함), 모바일 단말기, 서버와 같은 컴퓨팅 기 능을 가진 임의의 기기일 수 있고, 모바일 단말기는 차량용 기기, 휴대폰, 태블릿 컴퓨터, 개인 휴대 정보 단말 기, 웨어러블 기기와 같은 다양한 운영 체제, 터치 스크린 및/또는 디스플레이 스크린을 갖는 하드웨어 기기일 수 있다. 도 1에 도시된 바와 같이, 상기 자율주행 차량 정합 방법은 하기와 같은 단계를 포함할 수 있다. 단계 101에서, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성한다. 본 출원의 실시예에서, 제1 검출 포즈는 세계 좌표계에서 차량용 카메라의 포즈를 의미한다. 여기서, 포즈는 좌 표 위치 및/또는 자세를 포함할 수 있다. 본 출원의 실시예에서, 각 제1 시각의 제1 검출 포즈는 대응 시각에 차량용 카메라에 의해 수집된 이미지에 따 라 결정될 수 있다. 후속 실시예에서 이에 대해 상세하게 설명할 것이며 여기서 더이상 반복 서술하지 않는다. 본 출원의 실시예에서, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 대해 곡선 피팅을 수행하여 상기 차량용 카메라에 대응되는 제1 궤적 곡선을 획득할 수 있다. 단계 102에서, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성한다. 본 출원의 실시예에서, 차량용 위치 결정 기기는 위치 결정, 위치 측정, 자세 측정을 구현할 수 있는 센서를 의 미하는바, 예를 들어 차량용 위치 결정 기기는 IMU일 수 있다. 본 출원의 실시예에서, 제2 검출 포즈는 차량용 위치 결정 기기에 의해 검출된 포즈를 의미한다. 본 출원의 실시예에서, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 대해 곡선 피팅을 수행 하여 상기 차량용 위치 결정 기기에 대응되는 제2 궤적 곡선을 획득할 수 있다.단계 103에서, 각 제1 검출 포즈 및 각 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬한다. 본 출원의 실시예에서, 차량용 카메라에 대응되는 제1 검출 포즈, 및 차량용 위치 결정 기기에 대응되는 제2 검 출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬할 수 있다. 예를 들어, 각각의 제1 검출 포즈에 대해, 상기 제1 검출 포즈와 매칭되는 제2 검출 포즈를 결정할 수 있는바, 예를 들어 상기 매칭되는 제2 검출 포즈는 제1 검출 포즈와 가장 유사한 포즈일 수 있으며, 제1 검출 포즈 및 제1 검출 포즈와 매칭되는 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬한다. 단계 104에서, 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합 한다. 본 출원의 실시예에서, 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기 기를 정합할 수 있다. 이로써, 포즈에 따라 차량용 카메라의 제1 궤적 곡선 및 차량용 위치 결정 기기의 제2 궤 적 곡선을 정렬하고, 정렬 결과에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합하여, 시간에 따른 정렬 로 인한 정합 효과(즉 보정 효과)가 떨어지는 상황을 방지하여 보정 결과의 정확성을 향상시킬 수 있다. 본 출원의 실시예의 자율주행 차량 정합 방법은 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제 1 궤적 곡선을 생성하고, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성하며, 각 제1 검출 포즈 및 각 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬하고, 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합한다. 이로써, 포즈에 따라 차량용 카메라의 제1 궤적 곡선 및 차량용 위치 결정 기기의 제2 궤적 곡선을 정렬하고, 정렬 결과에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합하여, 시간에 따른 정렬로 인한 정합 효과(즉 보정 효과)가 떨 어지는 상황을 방지하여 보정 결과의 정확성을 향상시킬 수 있다. 상기 실시예에서 제1 궤적 곡선 및 제2 궤적 곡선에 대한 정렬 방법을 명확하게 설명하기 위해, 본 출원은 다른 자율주행 차량 정합 방법을 제공한다. 도 2는 본 출원의 실시예2에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 도 2에 도시된 바와 같이, 상기 자율주행 차량 정합 방법은 하기와 같은 단계를 포함할 수 있다. 단계 201에서, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성한다. 단계 202에서, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성한다. 단계 201 내지 단계 202의 수행 과정은 본 출원의 임의의 실시예의 수행 과정을 참조할 수 있으며, 여기서 더이 상 반복 서술하지 않는다. 단계 203에서, 제1 궤적 곡선 중 각 제1 궤적 포인트에 대응되는 제1 검출 포즈에 따라 제2 궤적 곡선 중 각 제 2 궤적 포인트에 대응되는 제2 검출 포즈를 조회하여, 매칭되는 제1 검출 포즈 및 제2 검출 포즈를 획득한다. 본 출원의 실시예에서, 제1 궤적 곡선 중의 각각의 제1 궤적 포인트에 대해, 상기 제1 궤적 포인트에 대응되는 제1 검출 포즈를 제2 궤적 곡선 중 각 제2 궤적 포인트에 대응되는 제2 검출 포즈와 매칭하여 상기 제1 궤적 포 인트에 대응되는 제1 검출 포즈와 매칭도가 가장 높은 제2 검출 포즈를 결정할 수 있고, 상기 제1 검출 포즈, 및 상기 제1 검출 포즈와 매칭도가 가장 높은 제2 검출 포즈를 매칭되는 제1 검출 포즈 및 제2 검출 포즈로 사 용한다. 단계 204에서, 매칭되는 제1 검출 포즈 및 제2 검출 포즈에 따라 제1 궤적 곡선 중의 제1 궤적 포인트와 제2 궤 적 곡선 중의 제2 궤적 포인트 사이의 정렬 관계를 결정한다. 본 출원의 실시예에서, 매칭되는 제1 검출 포즈 및 제2 검출 포즈에 따라 제1 궤적 곡선 중의 제1 궤적 포인트 와 제2 궤적 곡선 중의 제2 궤적 포인트 사이의 정렬 관계를 결정할 수 있다. 즉, 매칭되는 제1 검출 포즈 및 제2 검출 포즈를 각각 대응되는 제1 궤적 포인트 및 제2 궤적 포인트와 정렬하여 제1 궤적 곡선 중의 제1 궤적 포인트와 제2 궤적 곡선 중의 제2 궤적 포인트 사이의 정렬 관계를 획득할 수 있다. 단계 205에서, 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합 한다. 단계 205의 수행 과정은 본 출원의 임의의 실시예의 수행 과정을 참조할 수 있으며, 여기서 더이상 반복 서술하 지 않는다.본 출원의 실시예의 자율주행 차량 정합 방법은 제1 궤적 곡선 중 각 제1 궤적 포인트에 대응되는 제1 검출 포 즈에 따라 제2 궤적 곡선 중 각 제2 궤적 포인트에 대응되는 제2 검출 포즈를 조회하여, 매칭되는 제1 검출 포 즈 및 제2 검출 포즈를 획득하고; 매칭되는 제1 검출 포즈 및 제2 검출 포즈에 따라 제1 궤적 곡선 중의 제1 궤 적 포인트와 제2 궤적 곡선 중의 제2 궤적 포인트 사이의 정렬 관계를 결정한다. 이로써, 포즈에 따라 제1 궤적 곡선 중의 제1 궤적 포인트 및 제2 궤적 곡선 중 제2 궤적 포인트에 대한 정렬을 구현할 수 있으므로, 후속에 정렬 결과에 따라 차량용 카메라 및 차량용 위치 결정 기기를 보정할 수 있어, 시간에 따른 정렬로 인한 보정 효과가 떨어지는 상황을 방지하여 보정 결과의 정확성을 향상시킬 수 있다. 상기 실시예에서 차량용 카메라 및 차량용 위치 결정 기기에 대한 정합 방법을 명확하게 설명하기 위해, 본 출 원은 다른 자율주행 차량 정합 방법을 제공한다. 도 3은 본 출원의 실시예3에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 도 3에 도시된 바와 같이, 상기 자율주행 차량 정합 방법은 하기와 같은 단계를 포함할 수 있다. 단계 301에서, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성한다. 단계 302에서, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성한다. 단계 303에서, 제1 궤적 곡선 중 각 제1 궤적 포인트에 대응되는 제1 검출 포즈에 따라 제2 궤적 곡선 중 각 제 2 궤적 포인트에 대응되는 제2 검출 포즈를 조회하여, 매칭되는 제1 검출 포즈 및 제2 검출 포즈를 획득한다. 단계 304에서, 매칭되는 제1 검출 포즈 및 제2 검출 포즈에 따라 제1 궤적 곡선 중의 제1 궤적 포인트와 제2 궤 적 곡선 중의 제2 궤적 포인트 사이의 정렬 관계를 결정한다. 단계 301 내지 단계 304의 수행 과정은 본 출원의 임의의 실시예의 수행 과정을 참조할 수 있으며, 여기서 더이 상 반복 서술하지 않는다. 단계 305에서, 세계 좌표계에서 제1 궤적 곡선 중 적어도 하나의 제1 궤적 포인트의 위치와 세계 좌표계에서 제 2 궤적 곡선 중 대응되는 제2 궤적 포인트의 위치 사이의 차이에 따라, 차량용 위치 결정 기기에 대한 차량용 카메라의 외부 파라미터를 결정한다. 본 출원의 실시예에서, 정렬 관계에 따라 제1 궤적 곡선 중 각 제1 궤적 포인트에 대응되는 제2 궤적 곡선 중 제2 궤적 포인트를 결정할 수 있고, 세계 좌표계에서 적어도 하나의 제1 궤적 포인트의 3차원 위치와, 세계 좌 표계에서 제1 궤적 포인트에 대응되는 제2 궤적 포인트의 3차원 위치 사이의 차이에 따라 차량용 위치 결정 기 기에 대한 차량용 카메라의 외부 파라미터를 결정한다. 일 예로서, 세계 좌표계에서 각 제1 궤적 포인트의 위치와, 세계 좌표계에서 각 제1 궤적 포인트에 대응되는 제 2 궤적 포인트의 위치를 하기 공식에 대입하여 복수의 방정식을 획득할 수 있다. 외부 파라미터*세계 좌표계에서 각 제1 궤적 포인트의 위치*외부 파라미터의 역행렬=세계 좌표계에서 제2 궤적 포인트의 위치; 공식 다시 말해서, 본 출원에서 초기 외부 파라미터를 설정할 수 있으며, 각 제1 궤적 포인트에 대해 상기 세계 좌표 계에서 각 제1 궤적 포인트의 위치와, 세계 좌표계에서 제1 궤적 포인트에 대응되는 제2 궤적 포인트의 위치를 공식에 대입하여 하나의 방정식을 획득할 수 있고, 이로써 복수의 방정식의 좌변과 우변을 각각 미분하여 외 부 파라미터에 관한 비선형 최적화 문제를 획득할 수 있으며, 상기 비선형 최적화 문제를 해결하여 수정된 외부 파라미터를 획득할 수 있다. 단계 306에서, 외부 파라미터를 사용하여 차량용 카메라 및 차량용 위치 결정 기기를 정합한다. 본 출원의 실시예에서, 차량용 위치 결정 기기에 대한 차량용 카메라의 외부 파라미터를 결정한 후, 상기 외부 파라미터를 사용하여 차량용 카메라 및 차량용 위치 결정 기기를 정합할 수 있다. 본 출원의 실시예의 자율주행 차량 정합 방법은 세계 좌표계에서 제1 궤적 곡선 중 적어도 하나의 제1 궤적 포 인트의 위치와 세계 좌표계에서 제2 궤적 곡선 중 대응되는 제2 궤적 포인트의 위치 사이의 차이에 따라, 차량 용 위치 결정 기기에 대한 차량용 카메라의 외부 파라미터를 결정하고; 외부 파라미터를 사용하여 차량용 카메 라 및 차량용 위치 결정 기기를 정합한다. 이로써, 세계 좌표계에서 정렬된 제1 궤적 포인트의 위치와 대응되는 제2 궤적 포인트의 위치 사이의 차이에 따라 차량용 위치 결정 기기에 대한 차량용 카메라의 외부 파라미터를 결정하여, 외부 파라미터 결정 결과의 정확성을 향상시킬 수 있으며, 따라서 정확도가 비교적 높은 외부 파라미터를 사용하여 차량용 카메라와 차량용 위치 결정 기기를 정합하여 보정 결과의 정확성을 더 향상시킬 수 있다. 본 출원의 실시예의 가능한 일 구현 방식에서, 차량용 카메라에 대응되는 제1 검출 포즈 결정 결과의 정확성을 향상시키기 위해, 본 출원에서는 지도 중의 지물을 사용하여 각 제1 시각에서 차량용 카메라의 제1 검출 포즈를 구할 수 있다. 아래 실시예4를 결합하여 상기 과정에 대해 상세하게 설명한다. 도 4는 본 출원의 실시예4에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 도 4에 도시된 바와 같이, 상기 자율주행 차량 정합 방법은 하기와 같은 단계를 포함할 수 있다. 단계 401에서, 지도로부터 표시선의 표기 위치를 획득한다. 본 출원의 실시예에서, 표시선은 차선과 같은 교통 표시선일 수 있다. 본 출원의 실시예에서, 차량이 도로에서 주행하는 과정에서 고정밀도의 지도로부터 차량 주변에 위치한 표시선 의 표기 위치를 획득할 수 있다. 단계 402에서, 표기 위치에 따라 곡선 피팅을 수행하여 세계 좌표계에서 표시선의 피팅 곡선을 획득한다. 본 출원의 실시예에서, 표시선의 표기 위치에 대해 곡선 피팅을 수행하여 세계 좌표에서 표시선의 피팅 곡선을 획득할 수 있다. 예를 들어, 표기 위치에 따라 표시선에 대해 2차 곡선의 피팅을 수행하여 3차원 공간에서 표시 선의 피팅 곡선 또는 곡선 방정식을 획득할 수 있다. 단계 403에서, 세계 좌표계에서 복수의 제1 시각에서 차량용 카메라의 추정 포즈에 따라 피팅 곡선을 차량용 카 메라의 이미지 좌표계에 투영하여, 복수의 제1 시각에 대응되는 제1 평면 곡선을 획득한다. 본 출원의 실시예에서, 각 제1 시각에서 차량용 카메라의 추정 포즈는 대응 시각에 차량용 카메라에 의해 수집 된 이미지에 따라 결정되며, 즉 추정 포즈는 시각적 위치 결정 방식에 따라 결정된 대략적인 포즈이다. 본 출원의 실시예에서, 세계 좌표계와 이미지 좌표계 사이의 관계, 및 복수의 제1 시각에서 차량용 카메라의 추 정 포즈에 따라, 세계 좌표계 중의 표시선의 피팅 곡선을 차량용 카메라의 이미지 좌표계에 투영하여 복수의 제 1 시각에 대응되는 제1 평면 곡선을 획득할 수 있다. 여기서, 제1 평면 곡선은 2차원의 곡선 방정식이다. 단계 404에서, 복수의 제1 시각에 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되는 제2 평면 곡선사이의 차이에 따라, 대응되는 제1 시각의 추정 포즈를 수정하여 각 제1 시각의 제1 검출 포즈를 획득 한다. 본 출원의 실시예에서, 차량 중의 차선 감지 유닛은 또한 차선 감지 모듈로 지칭될 수 있으며, 상기 차선 감지 유닛은 차선에 대응되는 곡선 방정식을 검출하고 차선에 대응되는 제2 평면 곡선을 출력하기 위한 것이다. 여기 서, 제2 평면 곡선도 2차원의 곡선 방정식이다. 본 출원의 실시예에서, 각각의 제1 시각에 대해, 상기 제1 시각에 대응되는 제1 평면 곡선과 차선 감지 유닛이 대응 시각에 출력한 제2 평면 곡선 사이의 차이에 따라, 상기 제1 시각의 추정 포즈를 수정할 수 있고, 수정된 추정 포즈를 상기 제1 시각의 제1 검출 포즈로 사용한다. 단계 405에서, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성한다. 단계 406에서, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성한다. 단계 407에서, 각 제1 검출 포즈 및 각 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬한다. 단계 408에서, 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합 한다. 단계 405 내지 단계 408의 수행 과정은 상기 임의의 실시예의 수행 과정을 참조할 수 있으며, 여기서 더이상 반 복 서술하지 않는다. 본 출원의 실시예의 자율주행 차량 정합 방법은 고정밀 지도 중의 표시선에 기반하여 차량용 카메라의 포즈를 결정하는데, 기존의 이미지 핵심 포인트를 사용하는 방식(시각적 위치 결정 방식)으로 차량용 카메라의 포즈를 결정하는 것에 비해, 견고성이 높고 궤적이 보다 더 정확하므로 보다 정밀한 보정 파라미터를 획득할 수 있다. 상기 실시예에서 각 제1 시각의 추정 포즈에 대한 수정 방법을 명확하게 설명하기 위해, 본 출원은 자율주행 차 량 정합 방법을 더 제공한다.도 5는 본 출원의 실시예5에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 도 5에 도시된 바와 같이, 상기 자율주행 차량 정합 방법은 하기와 같은 단계를 포함할 수 있다. 단계 501에서, 지도로부터 표시선의 표기 위치를 획득한다. 단계 502에서, 표기 위치에 따라 곡선 피팅을 수행하여 세계 좌표계에서 표시선의 피팅 곡선을 획득한다. 단계 503에서, 세계 좌표계에서 복수의 제1 시각에서 차량용 카메라의 추정 포즈에 따라 피팅 곡선을 차량용 카 메라의 이미지 좌표계에 투영하여, 복수의 제1 시각에 대응되는 제1 평면 곡선을 획득한다. 단계 501 내지 단계 503의 수행 과정은 상기 임의의 실시예의 수행 과정을 참조할 수 있으며, 여기서 더이상 반 복 서술하지 않는다. 단계 504에서, 임의의 제1 시각에 대해, 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되 는 제2 평면 곡선 사이의 차이를 결정한다. 본 출원의 실시예에서, 임의의 제1 시각에 대해, 제1 시각에 대응되는 제1 평면 곡선과 차선 감지 유닛이 상기 제1 시각에 출력한 제2 평면 곡선 사이의 차이를 결정할 수 있다. 단계 505에서, 각 제1 시각의 차이에 따라, 대응되는 제1 시각의 추정 포즈를 조정하여 차이를 최소화하는 제1 검출 포즈를 획득한다. 본 출원의 실시예에서, 임의의 제1 시각에 대해, 상기 제1 시각에 대응되는 차이에 따라 상기 제1 시각의 추정 포즈를 조정하여 상기 차이를 최소화할 수 있음으로써 차이가 최소화된 조정 후의 추정 포즈를 상기 제1 시각의 제1 검출 포즈로 사용할 수 있다. 본 출원의 실시예의 가능한 일 구형 방식에서, 임의의 제1 시각에 대해, 비선형 최적화 알고리즘을 사용하여 상 기 제1 시각의 차이에 따라 상기 제1 시각의 추정 포즈를 조정하여 상기 차이를 최소화할 수 있음으로써 차이가 최소화된 조정 후의 추정 포즈를 상기 제1 시각의 제1 검출 포즈로 사용할 수 있다. 일 예로서, 임의의 제1 시각에 대해, 상기 제1 시각에 대응되는 제1 평면 곡선과 차선 감지 유닛이 대응 시각에 출력한 제2 평면 곡선 이 두 세트의 2차원의 곡선 방정식의 파라미터에 대해 잔차를 구축하여, 세계 좌표계에서 차량용 카메라의 포즈의 비선형 최적화 문제를 획득할 수 있으며, 상기 비선형 최적화 문제를 해결하여 세계 좌 표계에서 차량용 카메라의 정확한 포즈를 획득할 수 있고 상기 정확한 포즈를 상기 제1 시각의 제1 검출 포즈로 사용한다. 본 출원의 실시예의 다른 가능한 구형 방식에서, 임의의 제1 시각에 대해, 또한 상기 제1 시각의 추정 위치에 따라 설정 범위 내에서 포즈를 조정하여, 조정된 포즈 중 차이가 최소화된 포즈를 상기 제1 시각의 제1 검출 포 즈로 사용할 수 있다. 여기서, 설정 범위는 비교적 작은 값의 범위이다. 이로써, 비선형 최적화의 방식을 사용하여 세계 좌표계에서 차량용 카메라의 제1 검출 포즈를 획득할 수 있을 뿐만 아니라, 차량용 카메라의 추정 포즈 근처에 창을 추가하고 샘플링하는 방식을 통해 세계 좌표계에서 차량 용 카메라의 제1 검출 포즈를 획득할 수도 있어, 상기 방법의 유연성 및 적용성을 향상시킬 수 있다. 단계 506에서, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성한다. 단계 507에서, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성한다. 단계 508에서, 각 제1 검출 포즈 및 각 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬한다. 단계 509에서, 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합 한다. 단계 506 내지 단계 509의 수행 과정은 상기 임의의 실시예의 수행 과정을 참조할 수 있으며, 여기서 더이상 반 복 서술하지 않는다. 일 예로서, 표시선이 차선인 것으로 예시적으로 설명하면, 지도 중의 차선은 도 6에 도시된 바와 같을 수 있다. 차량용 카메라와 차량용 위치 결정 기기 사이의 보정 과정은 하기와 같은 단계를 포함할 수 있다. 1. 차량이 도로를 주행하는 과정에서 차량 주변의 지물 표시 정보를 조회하고, 차량 주변 차선의 표시 위치를 추출하며, 차선의 표시 위치에 따라 차선에 대해 2차 곡선의 피팅을 수행하여 3차원 공간에서 차선의 곡선 방정 식을 획득할 수 있다(본 출원에서는 피팅 곡선으로 표기함). 2. 미리 보정된 차량용 카메라 내부 파라미터를 사용하여 실시간으로 차량측에서 검출된 차선의 방정식을 조회 하고(본 출원에서는 제2 평면 곡선으로 표기함), 차량용 카메라 내부 파라미터 및 세계 좌표계에서 차량용 카메 라의 추정 포즈를 이용하여 고정밀도 지도 중 3차원의 차선의 곡선 방정식을 획득하여 이미지 좌표계 중 2차원 의 곡선 방정식에 투영한다(본 출원에서는 제1 평면 곡선으로 표기함). 3. 고정밀도 지도 중 차선 방정식의 투영 결과(즉 제1 평면 곡선) 및 실시간으로 차량측에서 검출된 차선의 방 정식(즉 제2 평면 곡선)에 대해 잔차를 구축하여 세계 좌표계에서 차량용 카메라의 포즈에 관한 비선형 최적화 문제를 획득한다. 4. 상기 비선형 최적화 문제를 해결하여 세계 좌표계에서 차량용 카메라의 정확한 포즈를 획득한다(본 출원에서 는 제1 검출 포즈로 표기함). 5. 차량용 위치 결정 기기에 의해 검출된 제2 검출 포즈에 대해 이산된 제2 검출 포즈에 대해 피팅을 수행하여 차량용 위치 결정 기기에 대응되는 시간 연속 궤적 방정식을 획득할 수 있다(본 출원에서는 제2 궤적 곡선으로 표기함). 6. 제4 단계에서 해결한 각각의 제1 검출 포즈에 대해 제5 단계 중 제2 궤적 방식에서 상기 제1 검출 포즈와 정 렬되는 제2 검출 포즈를 조회하여 공식 에 따라 일련의 방정식을 획득할 수 있다. 7. 제6 단계에서 일련의 방정식의 좌변과 우변을 각각 미분하여 외부 파라미터에 관한 비선형 최적화 문제를 획 득할 수 있으며, 상기 비선형 최적화 문제를 해결하여 차량용 위치 결정 기기에 대한 차량용 카메라의 수정된 외부 파라미터 정보를 획득할 수 있다. 이로써, 고정밀도 지도 중 표시된 정보를 충분히 이용하여 차량용 카메라의 포즈를 보다 정확하게 획득할 수 있 고, 동시에 포즈에 따라 차량용 카메라의 궤적 및 차량용 위치 결정 기기의 궤적을 정렬함으로써, 시간에 따른 정렬로 인한 보정 효과가 떨어지는 상황을 방지할 수 있다. 본 출원의 실시예의 자율주행 차량 정합 방법은 각 제1 시각에 대응되는 제1 평면 곡선과 차선 감지 유닛이 대 응 시각에 출력한 제2 평면 곡선 사이의 차이에 따라 대응되는 제1 시각의 추정 포즈를 조정하여 차이를 최소화 하는 제1 검출 포즈를 획득할 수 있다. 이로써, 제1 평면 곡선과 제2 평면 곡선 사이의 차이에 따라 차량용 카 메라의 추정 포즈를 조정하여 정확도가 비교적 높은 제1 검출 포즈를 획득할 수 있음으로써 정확도가 비교적 높 은 제1 검출 포즈에 따라 보정 과정을 수행하여 보정 결과의 정확성을 향상시킬 수 있다. 상기 도 1 내지 도 5 실시예에서 제공된 자율주행 차량 정합 방법에 대응하여 본 출원은 자율주행 차량 정합 장 치를 더 제공하며, 본 출원의 실시예에서 제공된 자율주행 차량 정합 장치는 상기 도 1 내지 도 5 실시예에서 제공된 자율주행 차량 정합 방법에 대응하므로 자율주행 차량 정합 방법의 실시형태에서도 본 출원의 실시예에 서 제공된 자율주행 차량 정합 장치가 적용되며, 본 출원의 실시예는 더이상 상세하게 설명하지 않는다. 도 7은 본 출원의 실시예6에서 제공된 자율주행 차량 정합 장치의 구조 모식도이다. 도 7에 도시된 바와 같이, 상기 자율주행 차량 정합 장치는 제1 생성 모듈, 제2 생성 모듈, 정 렬 모듈 및 정합 모듈을 포함할 수 있다. 여기서, 제1 생성 모듈은 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생 성한다. 제2 생성 모듈은 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생 성한다. 정렬 모듈은 각 제1 검출 포즈 및 각 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬한다. 정합 모듈은 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합한다. 본 출원의 실시예의 가능한 일 구현 방식에서, 정렬 모듈은 구체적으로, 제1 궤적 곡선 중 각 제1 궤적 포 인트에 대응되는 제1 검출 포즈에 따라 제2 궤적 곡선 중 각 제2 궤적 포인트에 대응되는 제2 검출 포즈를 조회 하여, 매칭되는 제1 검출 포즈 및 제2 검출 포즈를 획득하고; 매칭되는 제1 검출 포즈 및 제2 검출 포즈에 따라제1 궤적 곡선 중의 제1 궤적 포인트와 제2 궤적 곡선 중의 제2 궤적 포인트 사이의 정렬 관계를 결정한다. 본 출원의 실시예의 가능한 일 구현 방식에서, 정합 모듈은 구체적으로, 세계 좌표계에서 제1 궤적 곡선 중 적어도 하나의 제1 궤적 포인트의 위치와 세계 좌표계에서 제2 궤적 곡선 중 대응되는 제2 궤적 포인트의 위 치 사이의 차이에 따라, 차량용 위치 결정 기기에 대한 차량용 카메라의 외부 파라미터를 결정하고; 외부 파라 미터를 사용하여 차량용 카메라 및 차량용 위치 결정 기기를 정합한다. 본 출원의 실시예의 가능한 일 구현 방식에서, 상기 정합 장치는, 지도로부터 표시선의 표기 위치를 획득하는 획득 모듈; 표기 위치에 따라 곡선 피팅을 수행하여 세계 좌표계에서 표시선의 피팅 곡선을 획득하는 피팅 모듈; 세계 좌표계에서 복수의 제1 시각에서 차량용 카메라의 추정 포즈에 따라 피팅 곡선을 차량용 카메라의 이미지 좌표계에 투영하여, 복수의 제1 시각에 대응되는 제1 평면 곡선을 획득하는 투영 모듈; 및 복수의 제1 시각에 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되는 제2 평면 곡선사이 의 차이에 따라, 대응되는 제1 시각의 추정 포즈를 수정하여 각 제1 시각의 제1 검출 포즈를 획득하는 수정 모 듈; 을 더 포함할 수 있다. 본 출원의 실시예의 가능한 일 구현 방식에서, 수정 모듈은, 임의의 제1 시각에 대해, 대응되는 제1 평면 곡선과 대응 시각에 차선 감지 유닛에 의해 출력되는 제2 평면 곡 선 사이의 차이를 결정하는 결정 유닛; 및 각 제1 시각의 차이에 따라, 대응되는 제1 시각의 추정 포즈를 조정하여 차이를 최소화하는 제1 검출 포즈를 획 득하는 조정 유닛; 을 포함할 수 있다. 본 출원의 실시예의 가능한 일 구현 방식에서, 조정 유닛은 구체적으로, 비선형 최적화 알고리즘을 사용하여 각 제1 시각의 차이에 따라, 대응되는 제1 시각의 추정 포즈를 조정하여 차이를 최소화하는 제1 검출 포즈를 획득 하거나; 또는, 임의의 제1 시각의 추정 포즈에 따라 설정 범위 내에서 포즈를 조정하여, 조정된 포즈 중 차이를 최소화하는 포즈를 제1 시각에 대응하는 제1 검출 포즈로 사용한다. 본 출원의 실시예의 자율주행 차량 정합 장치는, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제1 궤적 곡선을 생성하고, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선 을 생성하며, 각 제1 검출 포즈 및 각 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬하고, 정렬 된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합한다. 이로써, 포즈 에 따라 차량용 카메라의 제1 궤적 곡선 및 차량용 위치 결정 기기의 제2 궤적 곡선을 정렬하고, 정렬 결과에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합하여, 시간에 따른 정렬로 인한 정합 효과(즉 보정 효과) 가 떨어지는 상황을 방지하여 보정 결과의 정확성을 향상시킬 수 있다. 상기 실시예를 구현하기 위해, 본 출원은 전자 기기를 더 제공하고, 당해 전자 기기는 적어도 하나의 프로세서; 적어도 하나의 프로세서와 통신 연결되는 메모리; 를 포함할 수 있고, 여기서 메모리에는 적어도 하나의 프로세 서에 의해 실행 가능한 명령이 저장되고, 명령이 적어도 하나의 프로세서에 의해 실행될 경우, 적어도 하나의 프로세서가 본 출원의 상기 임의의 실시예에서 제공된 자율주행 차량 정합 방법을 수행할 수 있다. 상기 실시예를 구현하기 위해, 본 출원은 컴퓨터 프로그램이 저장된 비일시적 컴퓨터 판독 가능 저장 매체를 더 제공하고, 여기서 컴퓨터 프로그램 중의 명령이 실행될 경우, 본 출원의 상기 임의의 실시예에서 제공된 자율주 행 차량 정합 방법이 수행된다. 상기 실시예를 구현하기 위해, 본 출원은 컴퓨터 판독 가능 저장 매체에 저장된 컴퓨터 프로그램을 제공하되, 컴퓨터 프로그램 중의 명령이 프로세서에 의해 실행될 경우, 본 출원의 상기 임의의 실시예에서 제공된 자율주 행 차량 정합 방법이 구현된다. 상기 실시예를 구현하기 위해, 본 출원은 본 출원의 상기 실시예에서 제공된 전자 기기를 포함하는 자율주행 차 량을 더 제공한다. 본 출원의 실시예에 따르면, 본 출원은 전자 기기, 판독 가능 저장 매체 및 컴퓨터 프로그램을 더 제공한다. 도 8은 본 출원의 실시예를 구현하기 위한 예시적 전자 기기의 예시적 블록도를 도시한다. 전자 기기는 랩톱 컴 퓨터, 데스크톱 컴퓨터, 워크 스테이션, 개인용 정보 단말기, 서버, 블레이드 서버, 메인프레임 컴퓨터, 및 다른 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 나타내기 위한 것이다. 전자 기기는 개인용 디지털 처 리, 셀룰러 폰, 스마트 폰, 웨어러블 기기, 및 다른 유사한 컴퓨팅 장치와 같은 다양한 형태의 모바일 장치를 나타낼 수도 있다. 본문에 표시된 부재, 이들의 연결 및 관계, 및 이들의 기능은 단지 예시적인 것으로서, 본문 에서 설명되거나 및/또는 요구되는 본 출원의 구현을 한정하려는 의도가 아니다. 도 8에 도시된 바와 같이, 기기는 판독 전용 메모리(Read-Only Memory, ROM)에 저장된 컴퓨터 프로 그램 또는 저장 유닛으로부터 랜덤 액세스 메모리(Random Access Memory, RAM)로 로딩된 컴퓨터 프 로그램에 따라, 다양하고 적절한 동작 및 처리를 수행할 수 있는 컴퓨팅 유닛을 포함한다. RAM에는 또한 기기의 동작에 필요한 다양한 프로그램 및 데이터가 저장된다. 컴퓨팅 유닛, ROM 및 RAM은 버스를 통해 서로 연결된다. 입력/출력(Input/Output, I/O) 인터페이스도 버스에 연결된다. 키보드, 마우스와 같은 입력 유닛; 다양한 유형의 디스플레이 장치, 스피커와 같은 출력 유닛; 자기 디스크, 광 디스크와 같은 저장 유닛; 및 네트워크 카드, 모뎀, 무선 통신 트랜시버와 같은 통신 유닛 을 포함하는 기기 중 복수의 부재는 I/O 인터페이스에 연결된다. 통신 유닛은 인터넷과 같 은 컴퓨터 네트워크 및/또는 다양한 통신 네트워크를 통해 다른 기기와 정보/데이터를 교환하도록 허용한다. 컴퓨팅 유닛은 처리 및 컴퓨팅 기능을 갖는 다양한 일반 및/또는 전용 처리 컴포넌트일 수 있다. 컴퓨팅 유닛의 일부 예시는 중앙 처리 유닛(Central Processing Unit, CPU), 그래픽 처리 유닛(Graphic Processing Units, GPU), 다양한 전용 인공 지능(Artificial Intelligence, AI) 컴퓨팅 칩, 기계 학습 모델 알 고리즘을 실행하는 다양한 컴퓨팅 유닛, 디지털 신호 프로세서(Digital Signal Processor, DSP), 및 임의의 적 절한 프로세서, 컨트롤러, 마이크로 컨트롤러 등을 포함하지만 이에 한정되지 않는다. 컴퓨팅 유닛은 상기 자율주행 차량 정합 방법과 같이 상기에서 설명된 각 방법 및 처리를 수행한다. 예를 들어, 일부 실시예에서, 상기 자율주행 차량 정합 방법은 저장 유닛과 같은 기계 판독 가능 매체에 유형적으로 포함되는 컴퓨터 소 프트웨어 프로그램으로 구현될 수 있다. 일부 실시예에서, 컴퓨터 프로그램의 일부 또는 전부는 ROM 및/또 는 통신 유닛을 통해 기기에 로드되거나 및/또는 설치될 수 있다. 컴퓨터 프로그램이 RAM에 로 드되어 컴퓨팅 유닛에 의해 실행될 경우, 상술한 자율주행 차량 정합 방법의 하나 이상의 단계를 수행할 수 있다. 대안적으로, 다른 실시예에서, 컴퓨팅 유닛은 다른 임의의 적절한 방식(예를 들어, 펌웨어에 의 함)을 통해 상기 자율주행 차량 정합 방법을 수행하도록 구성될 수 있다. 본문에서 이상 설명된 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프로그램 가능 게이트 어레이(Field Programmable Gate Array, FPGA), 주문형 집적 회로(Application-Specific Integrated Circuit, ASIC), 특정 용도 표준 제품(Application Specific Standard Product, ASSP), 시스템 온 칩(System On Chip, SOC), 복합 프로그램 가능 논리 소자(Complex Programmable Logic Device, CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양한 실시형태는 하나 이상 의 컴퓨터 프로그램에서의 구현을 포함할 수 있고, 상기 하나 이상의 컴퓨터 프로그램은 적어도 하나의 프로그 램 가능 프로세서를 포함하는 프로그램 가능 시스템에서 실행되거나 및/또는 해석될 수 있으며, 상기 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 데이터 및 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치, 및 상기 적어도 하나의 출력 장치에 전송할 수 있다. 본 출원의 방법을 실시하기 위한 프로그램 코드는 하나 이상의 프로그래밍 언어의 임의의 조합으로 작성될 수 있다. 이러한 프로그램 코드는 일반 컴퓨터, 전용 컴퓨터 또는 다른 프로그램 가능 데이터 처리 장치의 프로세 서 또는 컨트롤러에 제공되어, 프로그램 코드가 프로세서 또는 컨트롤러에 의해 실행될 경우 흐름도 및/또는 블 록도에 규정된 기능/동작이 구현될 수 있도록 한다. 프로그램 코드는 완전히 기계에서 실행되거나, 부분적으로 기계에서 실행되거나, 독립형 소프트웨어 패키지로서 부분적으로 기계에서 실행되거나 부분적으로 원격 기계에 서 실행되거나, 또는 완전히 원격 기계 또는 서버에서 실행될 수 있다. 본 출원의 컨텍스트에서, 기계 판독 가능 매체는 명령 실행 시스템, 장치 또는 기기에 의해 사용되거나 또는 명 령 실행 시스템, 장치 또는 기기와 결합하여 사용하기 위한 프로그램을 포함하거나 저장할 수 있는 유형 매체일 수 있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 저장 매체일 수 있다. 기계 판 독 가능 매체는 전자, 자기, 광학, 전자기, 적외선 또는 반도체 시스템, 장치 또는 기기, 또는 상기 내용의 임 의의 적절한 조합을 포함할 수 있지만 이에 한정되지 않는다. 기계 판독 가능 저장 매체의 보다 구체적인 예시 는 하나 이상의 와이어에 기반한 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, RAM, ROM, 소거 가능 프로그램 가능 판독 전용 메모리(Electrically Programmable Read-Only-Memory, EPROM) 또는 플래시 메모리, 광섬유, 휴대용 컴팩트 디스크 판독 전용 메모리(Compact Disc Read-Only Memory, CD-ROM), 광학 저장 기기, 자기 저장 기기 또는 상술한 내용의 임의의 적절한 조합을 포함한다. 사용자와의 인터랙션을 제공하기 위해, 컴퓨터에서 여기에 설명된 시스템 및 기술을 구현할 수 있고, 상기 컴퓨 터는 사용자에게 정보를 디스플레이하기 위한 디스플레이 장치(예를 들어, 음극선관(Cathode-Ray Tube, CRT) 또 는 액정 표시 장치(Liquid Crystal Display, LCD) 모니터); 및 키보드 및 포인팅 장치(예를 들어, 마우스 또는 트랙 볼)를 구비하며, 사용자는 상기 키보드 및 상기 포인팅 장치를 통해 컴퓨터에 입력을 제공한다. 다른 타입 의 장치는 또한 사용자와의 인터랙션을 제공할 수 있는데, 예를 들어, 사용자에게 제공된 피드백은 임의의 형태 의 센서 피드백(예를 들어, 시각적 피드백, 청각적 피드백 또는 촉각적 피드백)일 수 있고; 임의의 형태(소리 입력, 음성 입력, 또는 촉각 입력)로 사용자로부터의 입력을 수신할 수 있다. 여기서 설명된 시스템 및 기술은 백엔드 부재를 포함하는 컴퓨팅 시스템(예를 들어, 데이터 서버로 사용됨), 또 는 미들웨어 부재를 포함하는 컴퓨팅 시스템(예를 들어, 애플리케이션 서버), 또는 프론트 엔드 부재를 포함하 는 컴퓨팅 시스템(예를 들어, 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 구비하는 사용자 컴퓨터인 바, 사용자는 상기 그래픽 사용자 인터페이스 또는 상기 네트워크 브라우저를 통해 여기서 설명된 시스템 및 기 술의 실시형태와 인터랙션할 수 있음), 또는 이러한 백엔드 부재, 미들웨어 부재, 또는 프론트 엔드 부재의 임 의의 조합을 포함하는 컴퓨팅 시스템에서 구현될 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트워크)을 통해 시스템의 부재를 서로 연결시킬 수 있다. 통신 네트워크의 예는, 근거리 통신망 (Local Area Network, LAN), 광역망(Wide Area Network, WAN), 인터넷 및 블록체인 네트워크를 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 멀리 떨어져 있 고, 일반적으로 통신 네트워크를 통해 서로 인터랙션한다. 대응되는 컴퓨터에서 실행되고 또한 서로 클라이언트 -서버 관계를 가지는 컴퓨터 프로그램을 통해 클라이언트 및 서버의 관계를 생성한다. 서버는 클라우드 컴퓨팅 서버 또는 클라우드 호스트로도 지칭되는 클라우드 서버일 수 있으며, 기존의 물리적 호스트와 VPS(Virtual Private Server, 가상 전용 서버) 서비스에서 존재하는 관리가 어렵고, 비즈니스 확장성이 약한 결함을 해결하 기 위한 클라우드 컴퓨팅 서비스 시스템 중 하나의 호스트 제품이다. 서버는 분산 시스템 서버, 또는 블록체인 과 결합된 서버일 수 있다. 여기서, 설명해야 할 것은, 인공 지능은 컴퓨터로 인간의 특정 사유 과정과 지능적 행동(예를 들어, 학습, 추론, 사고, 계획 등)을 시뮬레이션하도록 연구하는 학문으로, 하드웨어 수준의 기술과 소프트웨어 수준의 기술 을 모두 갖는다. 인공 지능 하드웨어 기술에는 일반적으로 센서, 전용 인공 지능 칩, 클라우드 컴퓨팅, 분산 저 장, 빅데이터 처리와 같은 기술이 포함되고; 인공 지능 소프트웨어 기술에는 주로 컴퓨터 비전 기술, 음성 인식 기술, 자연어 처리 기술 및 기계 학습/딥러닝, 빅데이터 처리 기술, 지식 그래프 기술과 같은 기타 주요 방향이 포함된다. 본 출원의 실시예의 기술적 해결수단에 따르면, 복수의 제1 시각에서 차량용 카메라의 제1 검출 포즈에 따라 제 1 궤적 곡선을 생성하고, 복수의 제2 시각에서 차량용 위치 결정 기기의 제2 검출 포즈에 따라 제2 궤적 곡선을 생성하며, 각 제1 검출 포즈 및 각 제2 검출 포즈에 따라 제1 궤적 곡선 및 제2 궤적 곡선을 정렬하고, 정렬된 제1 궤적 곡선 및 제2 궤적 곡선에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합한다. 이로써, 포즈에 따라 차량용 카메라의 제1 궤적 곡선 및 차량용 위치 결정 기기의 제2 궤적 곡선을 정렬하고, 정렬 결과에 따라 차량용 카메라 및 차량용 위치 결정 기기를 정합하여, 시간에 따른 정렬로 인한 정합 효과(즉 보정 효과)가 떨 어지는 상황을 방지하여 보정 결과의 정확성을 향상시킬 수 있다. 위에서 설명된 다양한 형태의 프로세스를 사용하여 단계를 재배열, 추가 또는 삭제할 수 있음을 이해해야 한다. 예를 들어, 본 출원에 기재된 각 단계는 병렬로, 순차적으로, 또는 상이한 순서로 수행될 수 있으며, 본 출원에 개시된 기술적 해결수단이 이루고자 하는 결과를 구현할 수 있는 한, 본문은 여기서 한정되지 않는다."}
{"patent_id": "10-2022-0079656", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 구체적인 실시형태는 본 출원의 보호 범위를 한정하지 않는다. 본 기술분야의 통상의 기술자는, 설계 요구 및 다른 요소에 따라 다양한 수정, 조합, 서브 조합 및 대체를 진행할 수 있음을 이해해야 한다. 본 출원의 정 신 및 원칙 내에서 이루어진 임의의 수정, 등가 교체 및 개선 등은 모두 본 출원의 보호 범위 내에 포함되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2022-0079656", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 해결수단을 더 잘 이해하기 위한 것으로, 본 출원을 한정하는 것으로 구성되지 않는다. 여기서, 도 1은 본 출원의 실시예1에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 도 2는 본 출원의 실시예2에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 도 3은 본 출원의 실시예3에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 도 4는 본 출원의 실시예4에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다. 도 5는 본 출원의 실시예5에서 제공된 자율주행 차량 정합 방법의 흐름 모식도이다.도 6은 본 출원의 실시예에서 지도 중의 차선 모식도이다. 도 7은 본 출원의 실시예6에서 제공된 자율주행 차량 정합 장치의 구조 모식도이다. 도 8은 본 출원의 실시예를 구현하기 위한 예시적 전자 기기의 예시적 블록도이다."}
