{"patent_id": "10-2018-0120727", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0044206", "출원번호": "10-2018-0120727", "발명의 명칭": "전자 장치 및 이의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "황상영"}}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치의 제어 방법에 있어서,상기 전자 장치에 포함된 기능 모듈에 대응되는 기능을 수행하기 위해 상기 기능 모듈에 입력 값을 입력하여 출력 값을 획득하는 단계;상기 입력 값 및 상기 출력 값을 바탕으로 상기 기능 모듈에 적용될 안전 매커니즘을 결정하는 단계; 및상기 결정된 안전 매커니즘을 바탕으로 상기 기능 모듈의 오류 동작을 검출하는 단계;를 포함하는 방법."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 결정하는 단계는,상기 입력 값 및 상기 출력 값이 상기 기능 모듈의 안전 무결성 레벨에 따라 기적용된 안전 매커니즘에 기초한정상 범위 내이고, 상기 입력 값 및 상기 출력 값이 기설정된 조건을 만족하면, 상기 기적용된 안전 매커니즘에이외의 추가 안전 매커니즘을 결정하는 방법."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 기설정된 조건은,상기 센싱 값의 입력 횟수와 상기 출력 값의 출력 횟수가 다른 경우, 상기 입력 값에 대한 상기 출력 값이 상기정상 범위의 경계에 가까워지는 경향성(tendency)을 가지는 경우 및 상기 입력 값에 대한 상기 출력 값의 변화량이 기설정된 값을 초과하는 경우 중 적어도 하나인 방법."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 결정된 추가 안전 매커니즘을 상기 입력 값 및 출력 값에 대한 안전 매커니즘으로 학습하는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 결정하는 단계는,상기 입력 값 및 상기 출력 값이 상기 기능 모듈의 안전 무결성 레벨에 따라 기적용된 안전 매커니즘에 기초한정상 범위 내이고, 상기 입력 값 및 상기 출력 값이 기설정된 조건을 만족하지 않으면, 상기 기능 모듈에 기적용된 안전 매커니즘의 적용을 중단하는 방법."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 입력 값은,센서에 의해 획득된 값, 외부 장치로부터 수신된 값, 이전 기능 모듈의 출력 값 중 적어도 하나인 방법."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2020-0044206-3-제1항에 있어서,상기 기능 모듈의 오류 동작이 검출되면, 상기 전자 장치를 안전 상태(safe state)로 변경하는 단계;를 더 포함하는 방법."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 기능 모듈은,인지 모듈, 판단 모듈 및 제어 모듈 중 하나인 방법."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "전자 장치에 있어서,적어도 하나의 명령을 포함하는 메모리; 및상기 메모리에 저장된 상기 적어도 하나의 명령을 실행하여 상기 전자 장치를 제어하는 프로세서;를 포함하고,상기 프로세서는,상기 전자 장치에 포함된 기능 모듈에 대응되는 기능을 수행하기 위해 상기 기능 모듈에 입력 값을 입력하여 출력 값을 획득하고,상기 입력 값 및 상기 출력 값을 바탕으로 상기 기능 모듈에 적용될 안전 매커니즘을 결정하고,상기 결정된 안전 매커니즘을 바탕으로 상기 기능 모듈의 오류 동작을 검출하는 전자 장치."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는,상기 입력 값 및 상기 출력 값이 상기 기능 모듈의 안전 무결성 레벨에 따라 기적용된 안전 매커니즘에 기초한정상 범위 내이고, 상기 입력 값 및 상기 출력 값이 기설정된 조건을 만족하면, 상기 기적용된 안전 매커니즘에이외의 추가 안전 매커니즘을 결정하는 전자 장치."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 기설정된 조건은,상기 센싱 값의 입력 횟수와 상기 출력 값의 출력 횟수가 다른 경우, 상기 입력 값에 대한 상기 출력 값이 상기정상 범위의 경계에 가까워지는 경향성(tendency)을 가지는 경우 및 상기 입력 값에 대한 상기 출력 값의 변화량이 기설정된 값을 초과하는 경우 중 적어도 하나인 전자 장치."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 프로세서는,상기 결정된 추가 안전 매커니즘을 상기 입력 값 및 출력 값에 대한 안전 매커니즘으로 학습하는 전자 장치."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 프로세서는,상기 입력 값 및 상기 출력 값이 상기 기능 모듈의 안전 무결성 레벨에 따라 기적용된 안전 매커니즘에 기초한정상 범위 내이고, 상기 입력 값 및 상기 출력 값이 기설정된 조건을 만족하지 않으면, 상기 기능 모듈에 기적공개특허 10-2020-0044206-4-용된 안전 매커니즘의 적용을 중단하는 전자 장치."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 입력 값은,센서에 의해 획득된 값, 외부 장치로부터 수신된 값, 이전 기능 모듈의 출력 값 중 적어도 하나인 전자 장치."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서,상기 프로세서는, 상기 기능 모듈의 오류 동작이 검출되면, 상기 전자 장치를 안전 상태(safe state)로 변경하는 전자 장치."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항에 있어서,상기 기능 모듈은,인지 모듈, 판단 모듈 및 제어 모듈 중 하나인 전자 장치."}
{"patent_id": "10-2018-0120727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "전자 장치의 제어 방법을 실행하기 위한 프로그램을 포함하는 컴퓨터 판독가능 기록 매체에 있어서,전자 장치의 제어 방법은,상기 전자 장치에 포함된 기능 모듈에 대응되는 기능을 수행하기 위해 상기 기능 모듈에 입력 값을 입력하여 출력 값을 획득하는 단계;상기 입력 값 및 상기 출력 값을 바탕으로 상기 기능 모듈에 적용될 안전 매커니즘을 결정하는 단계; 및상기 결정된 안전 매커니즘을 바탕으로 상기 기능 모듈의 오류 동작을 검출하는 단계;를 포함하는 컴퓨터 판독가능 기록 매체."}
{"patent_id": "10-2018-0120727", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 기계 학습 알고리즘을 활용하는 인공지능(AI) 시스템 및 그 응용에 관련된 것이다. 특히, 본 개시에 따른 전자 장치의 제어 방법은, 전자 장치에 포함된 기능 모듈에 대응되는 기능을 수행하기 위해 기능 모듈에 입 력 값을 입력하여 출력 값을 획득하는 단계, 입력 값 및 출력 값을 바탕으로 기능 모듈에 적용될 안전 매커니즘 을 결정하는 단계 및 결정된 안전 매커니즘을 바탕으로 기능 모듈의 오류 동작을 검출하는 단계를 포함한다."}
{"patent_id": "10-2018-0120727", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 이의 제어 방법에 대한 것으로, 보다 상세하게는, 추가 안전 매커니즘을 이용하여 전자 장치의 오류를 검출하기 위한 전자 장치 및 이의 제어 방법에 관한 것이다."}
{"patent_id": "10-2018-0120727", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "안전 무결성 레벨(Safety Integrity Level, SIL)은 안전을 위해 자동차, 현장에 설치된 설비, 로봇 등 전자 장 치의 안전 등급을 나타내는 것이다. 구체적으로, 안전 무결성 레벨은 전자 장치가 의도한 대로 동작하는지 기능 안전성 보장하는 통계적 기준을 의미할 수 있다. 특히, 자동차 분야에서는 차량 안전 무결성 레벨(Automotive Safety Integrity Level, ASIL)으로 명시되고 있다. 각 분야에서는 다양한 표준에 따라 전자 장치의 안전 무결성 레벨을 평가하고 있다. 이러한 안전 무결성 레벨은 전자 장치의 안전 기능 별로 위험원 분석 및 리스크 평가를 기반으로 결정되어 있다. 구체적으로, 안전 무결성 레벨은 전자 장치의 안전 기능이 오동작하였을 때, 피해가 미약하고, 고장 발생 확률 이 낮은 안전 기능은 낮은 등급으로 책정하고, 안전 기능의 구현이 어렵거나 오동작시 인명 피해가 예상되는 안 전 기능은 높은 등급으로 책정하고 있다. 현재 안전 기능의 등급에 따라 안전 기능의 오동작 여부를 판단(Error Detection)하고 어떻게 오동작을 처리 (Error Handling)해야 할지 안전 메커니즘(Safety Mechanism)의 방식(methods)이 규격에 명시되어 있다. 이에 따라 기능의 등급에서 제시하고 있는 최소한의 안전 메커니즘은 적용되어야 한다. 최소한의 안전 메커니즘 은 안전 기능의 등급에 따라, 안전 기능의 오동작 여부를 판단하기 위해 각 기능의 등급별 안전 매커니즘 (Safety Mechanism)이 추천하고 있으며, 일반적으로 추천된 안전 매커니즘만을 이용하여 안전 기능의 안전 무결 성 여부를 판단하고 있다. 한편, 기술 발전에 따라 자동화 영역이 넓어지면서, 외부 환경 인식 및 이에 기초한 기능 제어가 전자 장치의 시스템에 의해 구현되고 있다. 구체적으로, 전자 장치에 구비된 센서 또는 외부 센서를 통해 주변 환경을 인식하고, 인식된 결과 값에 기초하 여 주변 상황이나 전자 장치 자체의 상태를 판단하고, 판단 결과에 기초하여 동작을 수행하고 있다. 예를 들어, 현재 전자 장치의 각 기능(예를 들어, 인지, 판단, 제어 등) 모듈은 기능 수행시 안전 등급에 따라 적용된 안전 매커니즘을 통해 각 기능 모듈의 안전 기능이 제대로 작동하고 있는지 체크하고 있다. 한편, 전자 장치 시스템은 설정된 프로그램 대로만 동작하던 과거에서 기술 발전에 따라 인간 수준의 지능을 구 현하는 인공지능 시스템으로 발전하고 있다. 여기서, 인공지능 시스템은 기계가 스스로 학습하고 판단하며, 사 용할수록 인식률이 향상되는 시스템이다. 인공지능 기술은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘을 이용하는 기계학습(딥러닝) 기술 및 기계학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 요소 기술들로 구성된다. 요소기술들은, 예로, 인간의 언어/문자를 인식하는 언어적 이해 기술, 사물을 인간의 시각처럼 인식하는 시각적 이해 기술, 정보를 판단하여 논리적으로 추론하고 예측하는 추론/예측 기술, 인간의 경험 정보를 지식데이터로 처리하는 지식 표현 기술 및 차량의 자율 주행, 로봇의 움직임을 제어하는 동작 제어 기술 중 적어도 하나를 포 함할 수 있다. 본 발명은 전자 장치 시스템이 스스로 데이터를 학습하고 처리하게 되면서, 안전 기능의 등급에 따라 기적용된 안전 매커니즘만으로는 전자 장치의 오류 또는 문제를 검출하지 못하거나 검출이 늦어지는 상황에서 인공지능을 활용하여 오류 또는 문제를 검출하거나 검출을 더 빠르게 하려는 방법을 제시하려고 한다."}
{"patent_id": "10-2018-0120727", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제점을 해결하기 위해 안출된 것으로, 기능 모듈의 안전 무결성 등급에 따른 안전 매커니즘 이외의 추가 안전 매커니즘을 적용하는 전자 장치, 및 이의 제어 방법에 관한 것이다."}
{"patent_id": "10-2018-0120727", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 전자 장치의 전자 장치의 제어 방법은, 상기 전자 장치에 포함된 기능 모듈에 대 응되는 기능을 수행하기 위해 상기 기능 모듈에 입력 값을 입력하여 출력 값을 획득하는 단계, 상기 입력 값 및 상기 출력 값을 바탕으로 상기 기능 모듈에 적용될 안전 매커니즘을 결정하는 단계 및 상기 결정된 안전 매커니 즘을 바탕으로 상기 기능 모듈의 오류 동작을 검출하는 단계를 포함한다. 이 경우, 상기 결정하는 단계는, 상기 입력 값 및 상기 출력 값이 상기 기능 모듈의 안전 무결성 레벨에 따라 기적용된 안전 매커니즘에 기초한 정상 범위 내이고, 상기 입력 값 및 상기 출력 값이 기설정된 조건을 만족하 면, 상기 기적용된 안전 매커니즘에 이외의 추가 안전 매커니즘을 결정할 수 있다. 이 경우, 상기 기설정된 조건은, 상기 센싱 값의 입력 횟수와 상기 출력 값의 출력 횟수가 다른 경우, 상기 입 력 값에 대한 상기 출력 값이 상기 정상 범위의 경계에 가까워지는 경향성(tendency)을 가지는 경우 및 상기 입 력 값에 대한 상기 출력 값의 변화량이 기설정된 값을 초과하는 경우 중 적어도 하나일 수 있다. 한편, 상기 결정된 추가 안전 매커니즘을 상기 입력 값 및 출력 값에 대한 안전 매커니즘으로 학습하는 단계를 더 포함할 수 있다. 한편, 상기 결정하는 단계는, 상기 입력 값 및 상기 출력 값이 상기 기능 모듈의 안전 무결성 레벨에 따라 기적 용된 안전 매커니즘에 기초한 정상 범위 내이고, 상기 입력 값 및 상기 출력 값이 기설정된 조건을 만족하지 않 으면, 상기 기능 모듈에 기적용된 안전 매커니즘의 적용을 중단할 수 있다.한편, 상기 입력 값은, 센서에 의해 획득된 값, 외부 장치로부터 수신된 값, 이전 기능 모듈의 출력 값 중 적어 도 하나일 수 있다. 한편, 상기 기능 모듈의 오류 동작이 검출되면, 상기 전자 장치를 안전 상태(safety state)로 변경하는 단계를 더 포함할 수 있다. 한편, 상기 기능 모듈은, 인지 모듈, 판단 모듈 및 제어 모듈 중 하나일 수 있다. 상기 기능 모듈은 자동차에 적용되는 소프트웨어들을 구성하는 소프트웨어 컴포넌트일 수 있다. 상기 기능 모듈은 자동차에 적용되는 적어 도 하나 이상의 시스템을 구성하는 요소로서 하드웨어 및 소프트웨어일 수 있다. 상기 기능 모듈은 자동차의 적 어도 하나 이상의 기능을 구성하기 위한 하드웨어 장치들의 결합들에 대해 적어도 하나 이상의 하드웨어들에 대 응하여 각 하드웨어들로부터 수신되거나 측정되는 센서 값을 모니터링 하거나 관리하는 모듈일 수 있다. 한편, 본 개시의 일 실시 예에 따른 전자 장치는, 적어도 하나의 명령을 포함하는 메모리 및 상기 메모리에 저 장된 상기 적어도 하나의 명령을 실행하여 상기 전자 장치를 제어하는 프로세서를 포함하고, 상기 프로세서는, 상기 전자 장치에 포함된 기능 모듈에 대응되는 기능을 수행하기 위해 상기 기능 모듈에 입력 값을 입력하여 출 력 값을 획득하고, 상기 입력 값 및 상기 출력 값을 바탕으로 상기 기능 모듈에 적용될 안전 매커니즘을 결정 하고, 상기 결정된 안전 매커니즘을 바탕으로 상기 기능 모듈의 오류 동작을 검출한다. 이 경우, 상기 프로세서는, 상기 입력 값 및 상기 출력 값이 상기 기능 모듈의 안전 무결성 레벨에 따라 기적용 된 안전 매커니즘에 기초한 정상 범위 내이고, 상기 입력 값 및 상기 출력 값이 기설정된 조건을 만족하면, 상 기 기적용된 안전 매커니즘에 이외의 추가 안전 매커니즘을 결정할 수 있다. 이 경우, 상기 기설정된 조건은, 상기 센싱 값의 입력 횟수와 상기 출력 값의 출력 횟수가 다른 경우, 상기 입 력 값에 대한 상기 출력 값이 상기 정상 범위의 경계에 가까워지는 경향성(tendency)을 가지는 경우 및 상기 입 력 값에 대한 상기 출력 값의 변화량이 기설정된 값을 초과하는 경우 중 적어도 하나일 수 있다. 한편, 상기 프로세서는, 상기 결정된 추가 안전 매커니즘을 상기 입력 값 및 출력 값에 대한 안전 매커니즘으로 학습할 수 있다. 한편, 상기 프로세서는, 상기 입력 값 및 상기 출력 값이 상기 기능 모듈의 안전 무결성 레벨에 따라 기적용된 안전 매커니즘에 기초한 정상 범위 내이고, 상기 입력 값 및 상기 출력 값이 기설정된 조건을 만족하지 않으면, 상기 기능 모듈에 기적용된 안전 매커니즘의 적용을 중단할 수 있다. 한편, 상기 입력 값은, 센서에 의해 획득된 값, 외부 장치로부터 수신된 값, 이전 기능 모듈의 출력 값 중 적어 도 하나일 수 있다. 한편, 상기 프로세서는, 상기 기능 모듈의 오류 동작이 검출되면, 상기 전자 장치를 안전 상태(safe state)로 변경할 수 있다. 한편, 상기 기능 모듈은, 인지 모듈, 판단 모듈 및 제어 모듈 중 하나일 수 있다. 상기 기능 모듈은 자동차에 적용되는 소프트웨어들을 구성하는 소프트웨어 컴포넌트일 수 있다. 상기 기능 모듈은 자동차에 적용되는 적어 도 하나 이상의 시스템을 구성하는 요소로서 하드웨어 및 소프트웨어일 수 있다. 상기 기능 모듈은 자동차의 적 어도 하나 이상의 기능을 구성하기 위한 하드웨어 장치들의 결합들에 대해 적어도 하나 이상의 하드웨어들에 대 응하여 각 하드웨어들로부터 수신되거나 측정되는 센서 값을 모니터링 하거나 관리하는 모듈일 수 있다. 한편, 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 실행하기 위한 프로그램을 포함하는 컴퓨터 판독 가능 기록 매체에 있어서, 전자 장치의 제어 방법은, 상기 전자 장치에 포함된 기능 모듈에 대응되는 기능을 수 행하기 위해 상기 기능 모듈에 입력 값을 입력하여 출력 값을 획득하는 단계, 상기 입력 값 및 상기 출력 값을 바탕으로 상기 기능 모듈에 적용될 안전 매커니즘을 결정하는 단계 및 상기 결정된 안전 매커니즘을 바탕으로 상기 기능 모듈의 오류 동작을 검출하는 단계를 포함한다."}
{"patent_id": "10-2018-0120727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시의 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도 면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하 려는 것이 아니며, 발명된 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이 해되어야 한다. 실시 예들을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되 어서는 안 된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨 어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '모듈' 혹은 복수의 '부'는 특정한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일체화되어 적어 도 하나의 프로세서로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 이하에서는 도면을 참조하여 본 발명에 대해 더욱 상세히 설명하기로 한다. 도 1은 본 개시의 일 실시 예에 따른 전자 장치의 오류 감지 상황을 설명하기 위한 도면이다. 구체적으로, 도 1 은 전자 장치가 자동차인 경우로, 자동차의 첨단 운전자 지원 시스템(Advanced Driver AssistanceSystems, ADAS)에 적용되는 본 개시의 일 실시 예를 설명하기 위한 도면이다. 이때, 자동차는 사용자가 운전하 는 일반 자동차일 수도 있고, 자율 주행 자동차일 수도 있다. 여기서, ADAS는, 운전 중 발생할 수 있는 수많은 상황 가운데 일부를 차량 스스로 인지하고 상황을 판단, 기계 장치를 제어하는 기술이다. ADAS는 충돌 위험시 운전자가 제동장치를 밟지 않아도 스스로 속도를 줄이거나 멈추 는 ‘자동 긴급제동 시스템(AEB: Autonomous Emergency Braking)’, 차선 이탈 시 주행 방향을 조절해 차선을 유지하는 ‘주행 조향보조 시스템(LKAS: Lane Keep Assist System)’, 사전에 정해 놓은 속도로 달리면서도 앞 차와 간격을 알아서 유지하는 ‘어드밴스드 스마트 크루즈 컨트롤(ASCC: Advanced Smart Cruise Control)’, 사각지대 충돌 위험을 감지해 안전한 차로 변경을 돕는 ‘후측방 충돌 회피 지원 시스템(ABSD: Active Blind Spot Detection)’, 차량 주변 상황을 시각적으로 보여주는 ‘어라운드 뷰 모니터링 시스템(AVM: Around View Monitor)’ 등을 포함한다. 차량과 관련된 다양한 안전 기능에 대한 안전 무결성 레벨에 대해서는 이하 도 5를 참조하여 설명하기로 한다. 이하에서는 도 1을 참조하여 본 개시의 일 실시 예에 따른 전자 장치의 ASCC 시스템의 오류 검출 동작을 설명한다. 여기서, 전자 장치는 다양한 기능 모듈을 포함할 수 있고, 여러 기능 모듈의 조합으로 시스템이 구현될 수 있다. 여기서, 기능 모듈은 자동차에 적용되는 소프트웨어들을 구성하는 소프트웨어 컴포넌트일 수 있다. 상기 기능 모듈은 자동차에 적용되는 적어도 하나 이상의 시스템을 구성하는 요소로서 하드웨어 및 소프 트웨어일 수 있다. 상기 기능 모듈은 자동차의 적어도 하나 이상의 기능을 구성하기 위한 하드웨어 장치들의 결 합들에 대해 적어도 하나 이상의 하드웨어들에 대응하여 각 하드웨어들로부터 수신되거나 측정되는 센서 값을 모니터링 하거나 관리하는 모듈일 수 있다. 한편, 본 명세서에서는 설명의 편의를 위하여 각 기능 모듈이 별개의 구성인 것으로 도시 및 설명하나, 실제 구 현시에는 프로세서와 같은 하나의 칩에서 구현될 수도 있다. 일 실시 예로, 인지 모듈은 카메라 또는 레이더 등의 센서에 의해 물체의 이미지 및 전자 장치와 물 체의 거리 값을 입력받을 수 있다. 이때, 판단 모듈은 입력된 값에 기초하여 속도 제어 값을 계산하고, 제 어 모듈은 계산된 속도 제어 값에 기초하여 전자 장치를 가속 또는 감속하는 제어를 수행할 수 있다. 이러 한 인지 모듈, 판단 모듈, 제어 모듈 등의 각 기능 모듈에는 ASIL B에 해당하는 안전 매커니즘이 적용 및 실행 될 수 있다. 여기서, 안전 매커니즘은 오류 또는 잠재적인 오류를 방지하기 위한 목적이 포함되는 것으로, 운전 자에게 고장에 대한 정보를 주거나 안전 상태(Safe state)로 전이시키기 위한 것으로, 종류, 대상, 방법 등이 이미 설정되어 있다. 구체적으로, 전자 장치는 물체를 포함하는 이미지를 입력받고, 이미지에 포함된 물체가 자동차 임을 인식한 결과 및 결과의 정확도를 출력할 수 있다. 이때, 전자 장치는 입력 값 및 출력 값을 안전 매 커니즘에 적용하여 안전 기능에 오류가 없는지 판단할 수 있다. 예를 들어, ASIL B에 적용되는 안전 매커니즘은 Range check of Input/Output data일 수 있다. 구체적으로, ASIL B에 적용되는 안전 매커니즘에서 물체 인식 결과의 정확도의 범위가 50% 이상이면 정상 범위인 것으로 판 단한다고 가정한 경우, 출력된 정확도가 55%라면 정상인 것으로 판단될 수 있다. 그러나, 본 개시에 따른 전자 장치는, 출력된 정확도가 85%에서 55%로 떨어지는 경우, 출력 값이 정상 범 위 이내이지만, 인지 과정에 문제가 있는 것으로 보고, 추가 안전 매커니즘을 적용할 수 있다. 예를 들어, 전자 장치는 추가 안전 매커니즘인 Diverse software design에 입력 값 및 출력 값을 적용하여 이미지의 물체 가 자동차인지 여부를 판단할 수 있다. 이때, 추가 적용되는 매커니즘은 사용자, 제조사 등에서 지정한 것 이거나, 이전 유사한 상황에서 적용된 것으로 학습된 것일 수 있다. 이와 같이, 다양한 알고리즘을 적용하여 물체를 인지하게 됨으로써, 기존 안전 무결성 레벨에 따른 안전 매커니즘으로는 검출할 수 없었던 오류를 검출할 수 있게 된다. 상술한 바와 같은 기능 모듈의 오류 검출 동작은 이하 도 7 내지 10을 참조하여 보다 자세히 설명하기로 한다. 한편, 도 1에서는 전자 장치가 자동차인 것으로 한정하여 설명하였으나, 실시 예에 따라 로봇, 공장 설비 등으로 구현될 수 있다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 간략한 구성을 설명하기 위한 블럭도이다. 도 2를 참조하면, 전자 장치는 메모리 및 프로세서를 포함한다. 메모리는 전자 장치의 동작에 필요한 각종 프로그램 및 데이터를 저장할 수 있다. 구체적으로, 메모 리에는 적어도 하나의 명령어가 저장될 수 있다. 프로세서는 메모리에 저장된 명령어를 실행함 으로써 상술한 동작을 수행할 수 있다. 메모리는 비휘발성 메모리, 휘발성 메모리, 플래시메모리(flash- memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 등으로 구현될 수 있다. 프로세서는 전자 장치의 동작을 전반적으로 제어한다. 구체적으로, 프로세서는 메모리에 저장된 적어도 하나의 명령을 실행하여 전자 장치를 제어할 수 있다. 일 실시 예에 따라 프로세서는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세 서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리 장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러 (controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서 (communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있 다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration) 로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 구체적으로, 프로세서는 전자 장치에 포함된 기능 모듈에 대응되는 기능을 수행하기 위해 기능 모듈 에 입력 값을 입력하여 출력 값을 획득할 수 있다. 여기서, 기능 모듈은 인지 모듈, 판단 모듈, 제어 모듈 등을 포함할 수 있다. 구체적으로, 인지 모듈은 센서, 마이크 등으로부터 입력된 입력 값에 기초한 출력 값을 획득할 수 있다. 인지 모듈에서 획득된 출력 값은 전자 장치의 주변 환경을 감지한 값일 수 있다. 예를 들어, 인지 모듈에서는 센서에 의해 입력된 이미지를 입력 값으로 하여 이미지에 포함된 물체를 인식한 결과를 출력 값으로 출력할 수 있다. 한편, 상술한 바와 같이, 입력 값은 센서(미도시)에 의해 획득된 값일 수 있으나, 이에 한정되지 않고, 외부 장치로부터 수신된 값 또는 기능 모듈이 순차적으로 동작할 경우, 이전 기능 모듈에서 출력된 값 중 적어 도 하나일 수 있다. 예를 들어, 전자 장치가 공장 설비인 경우, 외부 센서에서 센싱된 값을 수신하여 입력 값으로 사용할 수 있다. 또한, 기능 모듈인 인지 모듈, 판단 모듈, 제어 모듈이 순차적으로 동작하는 경우, 인 지 모듈에서 출력된 값이 판단 모듈의 입력 값으로 사용될 수 있다. 그리고, 프로세서는 입력 값 및 출력 값을 바탕으로 기능 모듈에 적용될 안전 매커니즘을 결정할 수 있다. 구체적으로, 기능 모듈 각각은 안전 무결성 레벨에 따라 적용될 안전 매커니즘이 정해져 있으나, 입력 값에 대 한 출력 값이 기설정된 조건을 만족하는 경우, 안전 매커니즘이 추가 적용되거나, 기적용된 안전 매커니즘의 적 용이 중단될 수 있다. 추가 안전 매커니즘이 적용되는 실시 예는 이하 도 7을 참조하며, 기적용된 안전 매커니 즘의 적용이 중단되는 실시 예는 이하 도 12를 참조하기로 한다. 구체적으로, 프로세서는 입력 값 및 출력 값을 기초로 인지 모듈의 안전 무결성 레벨에 따른 안전 매커니 즘을 적용하여 인지 모듈의 오류 동작을 검출할 수 있다. 예를 들어, ASCC 시스템에서의 인지 모듈의 안전 무결 성 레벨이 ASIL B인 경우, 안전 매커니즘은 입출력 데이터의 범위를 체크(Range check Input/Output data)하는 것일 수 있다. 이때, 입력 값에 대한 출력 값의 범위가 안전 매커니즘에서 설정한 정상 범위 내이더라도, 기설 정된 조건을 만족하면, 프로세서는 추가 안전 매커니즘의 적용을 결정할 수 있다. 예를 들어, 입력 값의 입력 횟수와 출력 값의 출력 횟수가 다르거나, 입력 값에 대한 출력 값이 정상 범위의 경 계에 가까워지는 경향성(tendency)을 가지거나, 입력 값에 대한 출력 값의 변화량이 기설정된 값을 초과하는 등 의 조건을 만족하면, 프로세서는 기 적용된 안전 매커니즘 이외의 안전 매커니즘을 추가 적용하는 것으로 결정할 수 있다. 일 실시 예로, 프로세서는 입출력 데이터의 범위를 체크하는 안전 매커니즘 이외에, 이미 지에 포함된 물체를 인식하는 다른 알고리즘(Diverse software desing)을 사용하는 안전 매커니즘을 적용할 수 있다. 안전 매커니즘을 추가 적용하여 기능 모듈의 오류가 검출되면, 프로세서는 전자 장치를 안전 상태 (safe state)로 변경할 수 있다. 구체적으로, 안전 상태는 기능 모듈이 오동작하더라도 피해가 없는 상태를 의 미하는 것으로, 기능 모듈의 오류에 대한 알림을 제공, 전자 장치에 제공되는 전원을 중단, 또는 전자 장 치의 제한된 기능만 사용 가능한 상태 등일 수 있다. 이에 따라, 기존 안전 매커니즘에서는 오인식되었던 물체를 제대로 인식할 수 있게 된다. 즉, 본 개시에 따르면, 기존 안전 매커니즘에서는 검출할 수 없었던 오류를, 추가 안전 매커니즘을 적용함에 따라 검출할 수 있게 되므로 보다 빠른 대처가 가능하게 된다.그리고, 판단 모듈은 인지 모듈에서 출력된 출력 값에 기초하여 오류 발생 여부, 위험 발생 확률 및 위험을 벗 어나기 위해 필요한 제어 값을 산출할 수 있다. 예를 들어, 인지 모듈에서 출력 값으로 전방 물체가 차량이라는 인식 결과와 인식 결과에 대한 정확도를 출력하면, 판단 모듈은 이를 입력 값으로 하여 전방 차량과의 충돌에 대한 위험도를 계산하고, 위험을 회피하기 위한 가속 값 또는 감속 값을 판단할 수 있다. 구체적으로, 프로세서는 입력 값 및 출력 값을 기초로 판단 모듈의 안전 무결성 레벨에 따른 안전 매커니 즘을 적용하여 판단 모듈의 오류 동작을 검출할 수 있다. 예를 들어, ASCC 시스템에서의 판단 모듈의 안전 무결 성 레벨이 ASIL B인 경우, 안전 매커니즘은 입출력 데이터의 범위를 체크(Range check Input/Output data)하는 것일 수 있다. 이때, 입력 값에 대한 출력 값의 범위가 안전 매커니즘에서 설정한 정상 범위 내이더라도, 출력 횟수 및 입력 횟수가 다르거나, 출력 값의 경향성, 출력 값의 변화량 급변 등이 발견되면, 프로세서는 이 전 출력 값과 비교하여 오류 동작을 검출하는 안전 매커니즘인 개연성 체크(Plausiblility check)를 추가적으로 수행할 수 있다. 한편, 일 실시 예로, 제어 모듈은 판단 모듈에서 출력된 가속 값 또는 감속 값을, 가속 또는 감속을 담당하는 모듈이 필요로 하는 값을 변환하여 해당 모듈로 전달할 수 있다. 이때, 프로세서는 입력 값 및 출력 값을 기초로 제어 모듈의 안전 무결성 레벨에 따른 안전 매커니즘을 적용하여 제어 모듈의 오류 동작을 검출할 수 있 다. 구체적으로, 프로세서는 전달된 가속 값 또는 감속 값에 대비하여 속도의 증감폭 등을 감지할 수 있다. 이때, 증감폭이 정상 범위 내이나, 문제가 있을 것으로 예상되는 경향성을 가지는 경우, 프로세서는 이전 출력 값과 비교하여 오류 동작을 검출하는 안전 매커니즘인 개연성 체크(Plausibility check)를 추가적으 로 수행할 수 있다. 이때, 추가 적용되는 안전 매커니즘은 메모리에 기저장된 복수의 안전 매커니즘 중 적어도 하나이거나, 외 부 서버에서 수신된 것일 수 있다. 이러한 안전 매커니즘의 일 실시 예는 이하 도 6을 참조하여 설명하기로 한 다. 한편, 기능 모듈에 추가 안전 매커니즘이 적용된 결과에 따르더라도, 해당 기능 모듈의 입력 값 및 출력 값이 정상 범위 내이고, 오류가 의심되는 조건이 없으면, 프로세서는 추가 안전 매커니즘의 적용을 중단하고, 기적용된 안전 매커니즘만을 적용할 수 있다. 한편, 전자 장치의 안전 기능 중 실시간성을 요구하고, 오류가 발생하지 않는 기능의 경우, 오류 동작의 검출이 불필요할 수 있다. 구체적으로, 기능 모듈에 입력된 입력 값과, 기능 모듈이 입력 값에 기초하여 출력한 출력 값을 기능 모듈의 안전 무결성 레벨에 따라 기적용된 안전 매커니즘에 적용하였을 때, 정상 범위 내이고, 상술한 오류가 있을 것으로 의심되는 조건을 만족하지 않는 상태가 유지된다면, 프로세서는 기적용된 안전 매커니즘의 적용을 중단할 수 있다. 이로 인해, 불필요하게 소모되는 처리 시간, 리소스 등을 감소할 수 있다. 상술한 바와 같은 안전 매커니즘의 적용을 중단하는 실시 예는 이하 도 12를 참조하여 보다 자세히 설명하기로 한다. 한편, 상술한 바와 같은 기능 모듈에 대해 적용될 안전 매커니즘을 결정하는 단계는 메모리에 저장된 인공 지능 모델에 의해 수행될 수도 있다. 본 개시에서 사용되는 인공지능 모델은 심층 신경망(Deep Neural Network, DNN), 합성곱 신경망(Convolutional Neural Network, CNN), 순환 신경망(Recurrent Neural Network, RNN), 제 한 볼츠만 머신 (Restricted Boltzmann Machine, RBM), 심층 신뢰 신경망 (Deep Belief Network, DBN), 심층 Q-네트워크(Deep Q-Networks, DQN) 등 다양한 네트워크가 사용될 수 있다. 구체적으로, 인공지능 모델은 다양한 상황에서의 기능 모듈에 적용된 안전 매커니즘을 학습할 수 있다. 예를 들어, 기능 모듈의 입력 값과 출력 값에 기설정된 안전 매커니즘을 적용한 결과가 정상 범위 내임에도 오 류를 의심할 만한 기설정된 조건을 만족하여 기설정된 안전 매커니즘 이외의 추가 안전 매커니즘을 적용한 경우, 인공지능 모델은 추가 안전 매커니즘을 해당 기능 모듈의 입력 값 및 출력 값에 대한 안전 매커니즘으로 학습할 수 있다. 여기서, 안전 매커니즘을 학습한다는 의미는, 안전 무결성 레벨에 따라 기적용된 안전 매커니즘 이외에 추가적 인 안전 매커니즘을 여러가지 적용해보고, 기능 모듈의 입력 값 및 출력 값에 기초하여 해당 기능 모듈의 오류 동작을 감지할 수 있는 안전 매커니즘을, 해당 기능 모듈의 입력 값 및 출력 값에 대해 적용될 수 있는 안전 매 커니즘으로 업데이트하는 것을 의미할 수 있다. 구체적으로, 인공지능 모델은 추가적인 안전 매커니즘을 각각 적용하여 해당 기능 모듈의 오류 동작을 감지하는 지 여부 및 감지하는데 소요되는 시간 등을 획득할 수 있다. 그리고, 인공지능 모델은 획득된 감지 여부 또는 소요 시간 등을 바탕으로 수행된 각 추가 안전 매커니즘에 대하여 스코어링 결과 우선 순위가 가장 높은 안전 매커니즘을 추가 적용될 안전 매커니즘으로 결정할 수 있다. 또한, 안전 매커니즘을 학습한다는 것은 추가적인 안전 매커니즘을 결정하는 것 뿐만 아니라, 기적용된 안전 매 커니즘 또는 추가 안전 매커니즘에 적용될 최적의 파라미터를 업데이트하는 것을 포함할 수 있다. 또 다른 실시 예로, 기능 모듈의 입력 값과 출력 값에 기설정된 안전 매커니즘을 적용한 결과가 정상 범위 내임 에도 사용자가 오류를 의심하여 수동 제어를 수행한 경우, 인공지능 모델은 입력 값 및 출력 값에 따른 수동 제 어 동작을 학습할 수 있다. 이때, 인공지능 모델은 입력 값, 출력 값 및 이에 따른 수동 제어 동작에 기초하여 추가 안전 매커니즘을 학습할 수 있다. 보다 구체적인 학습 과정은 이하 도 10 및 11을 참조하여 설명하기로 한 다. 한편, 학습이 완료된 인공지능 모델은 기능 모듈에 입력된 입력 값과, 이에 따른 출력 값에 기초하여 적용될 안 전 매커니즘을 설계할 수 있다. 즉, 기능 모듈의 안전 무결성 레벨에 따라 기설정된 안전 매커니즘에 구속되지 않고, 입력 값 및 출력 값에 기초하여 의심되는 기능 모듈의 오류를 검출할 수 있는 최적의 안전 매커니즘을 설 계할 수 있다. 이에 따라, 본 개시에 따르면 기존 안전 매커니즘에서는 검출할 수 없었던 오류를, 추가 안전 매커니즘을 적용 함에 따라 검출할 수 있게 되므로 보다 빠른 대처가 가능하게 된다. 도 3은 도 2에 개시된 전자 장치의 구체적인 구성을 설명하기 위한 블럭도이다. 도 3을 참조하면, 전자 장치는 메모리, 프로세서, 센서, 통신부, 디스플레이, 스피커 및 전원 장치을 포함할 수 있다. 여기서, 메모리 및 프로세서는 도 2에 도시된 구 성과 동일한 바, 중복된 기재는 생략한다. 프로세서는 RAM, ROM, CPU, GPU(Graphic Processing Unit), 버스를 포함할 수 있다. RAM, ROM, CPU, GPU(Graphic Processing Unit) 등은 버스를 통해 서로 연결될 수 있다. CPU는 메모리에 액세스하여, 메모리에 저장된 O/S를 이용하여 부팅을 수행한다. 그리고 메모리 에 저장된 각종 프로그램, 컨텐츠, 데이터 등을 이용하여 다양한 동작을 수행한다. ROM에는 시스템 부팅을 위한 명령어 세트 등이 저장된다. 턴-온 명령이 입력되어 전원이 공급되면, CPU는 ROM에 저장된 명령어에 따라 메모리에 저장된 O/S를 RAM에 복사하고, O/S를 실행시 켜 시스템을 부팅시킨다. 부팅이 완료되면, CPU는 메모리에 저장된 각종 프로그램을 RAM에 복사 하고, RAM에 복사된 프로그램을 실행시켜 각종 동작을 수행한다. GPU는 전자 장치의 부팅이 완료되면, 디스플레이에 UI를 디스플레이한다. 구체적으로는, GPU는 연산부(미도시) 및 렌더링부(미도시)를 이용하여 아이콘, 이미지, 텍스트 등과 같은 다양한 객체를 포함하는 화면을 생성할 수 있다. 연산부는 화면의 레이아웃에 따라 각 객체들이 표시될 좌표값, 형태, 크기, 컬러 등과 같은 속성값을 연산한다. 렌더링부는 연산부에서 연산한 속성값에 기초하여 객체를 포함하는 다양한 레이아웃의 화면을 생성한다. 렌더링부에서 생성된 화면(또는 사용자 인터페이스 창)은 디스플레이로 제공 되어, 메인 표시 영역 및 서브 표시 영역에 각각 표시된다. 센서는 전자 장치의 환경 정보를 감지하도록 구성된 복수의 센서를 포함할 수 있다. 예를 들어, 센서 는 카메라, GPS, 근접센서, 가속도 센서, 지자기 센서, 적외선 센서 등을 포함할 수 있다. 카메라는 전자 장치의 외부의 환경 또는 내부를 영상으로 기록하도록 구성되는 적어도 하나의 스틸 카메라 또는 적어도 하나의 비디오 카메라가 될 수 있다. GPS는 전자 장치의 지리적 위치를 추정하도록 구성되는 센서일 수 있다. 즉, GPS는 지구에 대한 전자 장치의 위치를 추정하도록 구성되는 송수신기를 포함할 수 있다. 근접 센서는 전자 장치 주변의 기설정된 거리 이내에 존재하는 물체를 감지하기 위한 센서일 수 있다. 구체적으로, 근접 센서는 초음파 센서, 광센서 등이 포함될 수 있으며, 카메라 또는 적외선 센 서가 근접 센서의 기능을 수행할 수도 있다.이외의 각 센서들의 기능은 그 명칭으로부터 통상의 기술자가 직관적으로 추론할 수 있으므로, 구체적인 설명은 생략하기로 한다. 이외에도 도시되지는 않았지만, 필요에 따라 IMU(Inertial Measurement Unit), 레이더 (RADAR), 온/습도 센서, 기압 센서, RGB 센서 등을 더 포함할 수 있다. 통신부는 다양한 유형의 통신 방식에 따라 다양한 유형의 외부 기기와 통신을 수행하는 구성이다. 전자 장 치는 외부 장치로부터 유선 또는 무선 방식을 통해 통신을 수행할 수 있다. 이때 외부 장치는 전자 장치 와는 별개의 장치인 센서 장치, 서버 등일 수 있다. 전자 장치가 무선 통신이 가능한 경우, 통신부는 와이파이칩, 블루투스 칩, 무선 통신 칩, NFC 칩을 포함할 수 있다. 구체적으로, 와이파이 칩, 블루투스 칩은 각각 WiFi 방식, 블루투스 방식으로 통신을 수행한다. 와이파이 칩이나 블루투스 칩을 이용하는 경우에는 SSID 및 세션 키 등과 같은 각종 연결 정보를 먼 저 송수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 무선 통신 칩은 IEEE, 지그비, 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evoloution) 등과 같은 다양 한 통신 규격에 따라 통신을 수행하는 칩을 의미한다. NFC 칩은 135kHz, 13.56MHz, 433MHz, 860~960MHz, 2.45GHz 등과 같은 다양한 RF-ID 주파수 대역들 중에서 13.56MHz 대역을 사용하는 NFC(Near Field Communication) 방식으로 동작하는 칩을 의미한다. 한편, 전자 장치가 유선 통신이 가능한 경우, 통신부는 케이블을 연결할 수 있는 다양한 포트를 포함 할 수 있다. 예를 들어, 통신부는 유선 Ethernet, USB 포트, 컴포넌트 포트, PC 포트 등을 포함할 수 있다. 통신부는 외부 장치로부터 입력 값을 수신할 수 있다. 여기서 입력 값은 외부 센서에 의해 센싱된 값, 외 부 장치에서 출력한 출력 값일 수 있다. 한편, 통신부는 외부 서버로부터 오류 동작 검출에 사용될 정보를 수신할 수 있다. 예를 들어, 통신부 는 외부 서버로부터 오류 동작 검출에 사용될 안전 매커니즘에 대한 정보를 수신할 수 있다. 구체적으로, 프로세서는 결정된 안전 매커니즘에 대한 정보를 외부 서버로부터 수신하여 해당 기능 모듈의 오류 동작을 검출할 수 있다. 한편, 프로세서는 입력 값, 출력 값 및 결정된 안전 매커니즘에 대한 인덱스 정보 등을 외부 서버에 전송하고, 외부 서버가 기능 모듈의 오류 동작을 검출하도록 할 수 있다. 그리고, 통신부는 기능 모듈의 오류 동작 검출 결과 값을 수신할 수 있다. 프로세서는 기능 모듈의 오류 동작이 검출 결과에 따라 대응되는 동작을 수행할 수 있다. 구체적으로, 프 로세서는 기능 모듈의 오류 동작이 검출되면, 검출된 오류 동작에 대한 피드백을 사용자에게 제공할 수 있 다. 이때, 프로세서는 전자 장치에 구비된 디스플레이를 통해 오류 동작이 검출된 기능명, 오류 종류, 해결 방안 등을 사용자에게 제공할 수 있다. 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel) 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이 내에는 a- si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 또한, 디스플레이은 플렉서블 디스플레이로 구현될 수도 있으며, 터치 입력이 가능한 터치 스크린일 수도 있다. 예를 들어, 전자 장치가 자동차인 경우, 계기판, 전방 표시 장치(head-up dislplay) 또는 네비게이션, 온 도 제어, 오디오 제어 등을 위한 유저 인터페이스를 제공하는데 디스플레이가 제공될 수 있다. 그리고, 전 자 장치를 구성하는 복수의 기능 모듈 중 적어도 하나에 오류가 검출되면, 검출된 오류에 대한 정보를 디 스플레이에 표시할 수 있다. 한편, 프로세서는 전자 장치에 구비된 스피커를 통해 오류 동작이 검출된 기능명, 오류 종류, 해결 방안 등을 사용자에게 제공할 수 있다. 한편, 프로세서는 기능 모듈에 오류 동작이 검출되면 전자 장치를 안전 상태로 변경할 수 있다. 여기 서, 안전 상태는 기능 모듈이 오동작하더라도 사용자 또는 주변 환경에 피해가 없는 상태를 의미할 수 있다. 예를 들어, 엔진 고장과 같이 오동작하는 경우 심각한 피해를 야기할 수 있는 오류가 검출되면, 프로세서 는 전원 장치를 제어하여 전자 장치에 공급되는 전원을 차단할 수 있다. 한편, 예를 들어, 검출된 오류가 전방 카메라 고장과 같이 오동작하는 경우에도 큰 피해가 발생하지 않는다면, 프로세서는 전방 카메라와 관련된 기능을 제외한 제한된 기능만 사용 가능하도록 전자 장치를 제어할수 있다. 이때, 프로세서는 상술한 바와 같이 오류 동작에 대한 정보를 디스플레이 및 스피커 중 적어도 하나를 통해 사용자에게 제공할 수 있다. 그 밖에, 도 3에 도시하지는 않았으나, 전자 장치가 자동차라면, 전자 장치는 자동차의 일반적인 구 성인 브레이크, 조향부, 변속기, 휠, 라이트, 방향 지시등, 와이퍼 등을 더 포함할 수 있다. 도 4는 다양한 표준에 따른 안전 무결성 레벨을 설명하기 위한 도면이다. 도 4를 참조하면, 안전 무결성 레벨은 고장 확률을 기준으로 제시하고 있으며, 표준 별로 다른 기준으로 레벨을 분류하고 있다. 도 4에서는 다양한 표준 중 DO-254, DO-178B, IEC 61508 및 ISO 26262를 일 실시 예로 설명하 였다. 구체적으로, DO-254는 항공전자기기 인증 기준이고, DO-178B는 항공 소프트웨어 인증 기준이다. DO-254 및 DO- 178B는 레벨 A에서 레벨 E로 갈수록 고장난 경우 위험 수준이 낮다. 그리고, 레벨 E에서 레벨 A로 갈수록 만족 요건의 수가 증가한다. 구체적으로, DO-254 및 DO-178B의 레벨 A의 경우 추락의 위험을 갖는 고장 수준으로, 고장 확률이 10-9 미만을 만족해야 한다. 한편, DO-254 및 DO-178B의 레벨 E의 경우, 안전, 비행 조정, 조종사 과부하에 영향을 미치지 않는 고장 수준으로 만족해야하는 고장 확률이 비교적 높다. IEC 61508은 산업에 적용되는 규칙의 국제표준으로, '전기/전자/프로그램 가능한 전자 안전 관리 시스템의 기능 안전'이 명칭이다. IEC 61508은 모든 종류의 산업에 적용 가능한 기본적인 기능 안전 표준이 될 의도로 작성되 었다. 구체적으로, IEC 61508의 안전 무결성 레벨은 \"주어진 조건하에 있는 안전 관련 시스템이 주어진 시간 내에 요 구되는 안전 기능을 만족스럽게 수행할 수 있는 확률\"이라고 정의되며 SIL 4가 가장 높은 등급이고 SIL 1이 가 장 낮은 등급이다. ISO 26262는 자동차 기능 안전성 국제 표준으로, 자동차에 탑재되는 전기, 전자 시스템의 오류로 인한 사고방지 를 위해 ISO에서 제정한 자동차 기능 안전 국제 규격이다. ISO 26262는 기능 안전 표준 IEC 61508을 자동차 전기/전자 시스템에 적응시킨 것이다. ISO 26262는 모든 자동 차용 전기/전자 안전 관련 시스템의 제품 수명 전 주기에 걸쳐 적용 가능한 자동차용 장비의 기능 안전을 정의 하며, ASIL D가 가장 높은 등급이고 ASIL A가 가장 낮은 등급이다. 이하 도 5 및 도 6에서는 설명의 편의를 위해 ISO 26262를 기준으로 설명하기로 한다. 도 5는 자동차의 안전 기능 별 안전 무결성 레벨의 일 실시 예를 설명하기 위한 도면이다. 도 5에서는 자동차의 다양한 안전 기능, 안전 기능 별 고장 상황과 안전 무결성 레벨에 대해서 도시하고 있다. 여기서, 안전 무결성 레벨은 ISO 26262 표준에 기초한 것이다. 도 4에 기재된 바와 같이, ASIL A 등급이 가장 낮은 등급이고, ASIL D 등급이 갖아 높은 등급이며, 등급이 낮을 수록 위험 수준이 낮고, 등급이 높을수록 위험 수준이 높다. 예를 들어, 도 5의 표를 참조하면, 자동차의 후미등(rear light)은 전조등을 켜면 자동차의 후미에 들어오는 불 빛으로, 자동차의 뒤쪽 양측에 배치된다. 후미등은 양측이 모두 고장나는 경우, 기능이 오류 동작하는 것으로 검출된다. 이러한 후미등은 오류 동작하는 것만으로는 사용자의 안전을 위협하는 수준이 아니므로, 안전 무결성 레벨은 가장 낮은 등급인 ASIL A이다. 반면, 에어백 시스템(Airbag system)은 의도치 않은 전개(Unintended Deployment)가 수행된 경우 고장 상황인 것으로 판단된다. 에어백이 주행 중 의도치 않게 전개되는 경우 운전자의 안전이 직접적으로 위협을 받는 바, 에어백 시스템은 가장 높은 등급은 ASIL D이다. 한편, 도 5에 도시된 전자 장치의 기능 및 고장 상황은 일 실시 예에 불과하며, 전자 장치의 기능 및 고장 상황 은 도 5에 도시된 것에 한정되지 않는다. 이와 같이, 전자 장치의 각 기능은 기능 별로 안전 무결성 레벨이 다르며, 안전 무결성 레벨에 따라 고장 상황 여부를 판단하는 안전 매커니즘이 다르게 적용될 수 있다. 안전 무결성 레벨에 적용되는 안전 매커니즘은 이하 도 6을 참조하여 자세히 설명하기로 한다.도 6은 안전 무결성 레벨 별로 적용되는 안전 매커니즘의 일 실시 예를 설명하기 위한 도면이다. 도 6을 참조하면, 1a 내지 1f의 다양한 안전 매커니즘이 도시되어 있다. 여기서, 안전 매커니즘은 1a에서 1f로 갈수록 오류 동작 검출에 많은 리소스 또는 시간 등이 소요되는 정교한 과정일 수 있다. 도 6의 표에서, '++'는 해당 안전 매커니즘이 강하게 권고(highly recommended)되는 것임을 의미하고, '+'는 권 고사항(recommended)이며, '0'는 권고되지는 않음(not recommended)을 의미한다. 예를 들어, 기능 모듈이 ASIL A 인 경우, 입출력 데이터의 범위를 체크하는 안전 매커니즘인 1a는 강하게 권고 되는 것이며, 개연성을 체크하는 안전 매커니즘인 1b 및 데이터의 에러를 감지하는 안전 매커니즘인 1c는 권고 사항이다. 안전 무결성 레벨이 ASIL A에서 ASIL D로 갈수록 강하게 권고되는 안전 매커니즘이 증가함을 알 수 있다. 앞 차와의 간격을 일정하게 유지하는 ADAS ASCC 시스템은 ASIL B 등급으로, 기존에는 강하게 권고되는 1a만을 적용하여 오류 동작을 검출하였으나, 본 개시에 따르면, 1a에서는 정상 범위로 오류가 아닌 것으로 판단되었으 나, 입력 값 및 출력 값의 경향성 등을 더 고려하여, ASIL B에서는 권고되지 않는 안전 매커니즘인 1f가 추가적 으로 적용될 수 있다. 안전 매커니즘 1f가 추가 적용되는 동작은 일 실시 예일 뿐, 해당 안전 무결성 레벨에서 적용되지 않는, 예를 들어, 단순 권고 사항 또는 권고되지는 않는 안전 매커니즘들 중 일부의 안전 매커니즘들 중 선택된 적어도 하나의 안전 매커니즘이 추가 적용될 수 있다. 이에 따라, 본 개시에 따르면, 기존에는 검출할 수 없었던 기능 모듈의 오류 동작을 검출할 수 있게 되며, 위험 상황에서 보다 빠른 대처가 가능하게 된다. 도 7은 본 개시의 일 실시 예에 따라 안전 매커니즘을 추가 적용하는 실시 예를 설명하기 위한 도면이다. 전자 장치는 복수의 기능 모듈을 포함할 수 있으며, 이하에서는 설명의 편의를 위해 인지 모듈, 판단 모듈 및 제어 모듈이 순차적으로 동작하는 실시 예를 한정하였으나, 기능 모듈의 종류 및 동작은 이에 한정되지 않는다. 도 7을 참조하면, 인지 모듈, 판단 모듈 및 제어 모듈이 순차적으로 동작할 수 있다. 이때, 인 지 모듈은 센싱 값 등을 입력 값으로 하여 출력 값 x 를 출력할 수 있다. 판단 모듈은 인지 모듈 로부터 출력된 x 를 입력 값으로 하여 출력 값 y를 출력할 수 있다. 그리고, 제어 모듈은 판단 모듈 로부터 출력된 y를 입력 값으로 하여 전자 장치를 제어하기 위한 제어 값을 출력할 수 있다. 이때, 인지 모듈, 판단 모듈 및 제어 모듈 각각에는 각 모듈의 안전 무결성 레벨에 따른 안전 매커니즘(711, 721, 731)이 적용되며, 각 모듈의 오류 동작 여부를 체크할 수 있다. 한편, 예를 들어, 판단 모듈의 입력 값인 x 및 출력 값인 y에 판단 모듈의 안전 무결성 레벨에 따른 안전 매커니즘을 적용한 결과, 정상 범위 내이지만 오동작이 의심되는 경우, 전자 장치는 판단 모듈 에 추가적인 안전 매커니즘을 적용할 수 있다. 이때, 추가적인 안전 매커니즘을 적용한 결과 발견되 지 않았던 판단 모듈의 오동작이 발견될 수 있으며, 추가적인 안전 매커니즘이 적용됨에 따라 판단 모듈의 출력 값이 y에서 y'로 변경될 수 있다. 한편, 전자 장치는 오동작이 발견됨에 따라 전자 장치를 안 전 상태로 변경할 수 있다. 상술한 본 개시에 따른 전자 장치의 동작은 아래와 같은 예시적인 시나리오로 구현될 수 있다. 실시 예 1 : ADAS ASCC 전자 장치가 자동차인 경우 ADAS ASCC에서 인지 모듈, 판단 모듈 및 제어 모듈의 안전 무결성 레벨은 ASIL B 등 급이며, 이때, 강하게 권고되는 안전 매커니즘은 1a(Range check of Input/Ouput Data)일 수 있다. 일 실시 예 로, 인지 모듈의 인식의 정확도가 50% 이상이면, 물체 인식이 정상 동작인 것으로 판단할 수 있다. 이때, 전자 장치는 인지 모듈의 인식의 정확도가 50% 미만이면, 바로 인지 모듈의 동작에 오류가 있는 것으로 판단하고, 전 자 장치를 안전 상태로 변경할 수 있다. 우선 전자 장치의 인지 모듈은 전자 장치의 전방을 촬상한 이미지 및 레이더(radar)를 이용한 전방 물체와의 거 리 값을 입력받을 수 있다. 일 실시 예로, 인지 모듈은 초당 30 프레임의 이미지를 입력받을 수 있다. 그리고, 인지 모듈은 입력받은 이미지에 포함된 물체를 인식할 수 있다. 만약, 인지 모듈이 이미지에 포함된 물체가 자 동차인 것으로 인식한다면, 인지 모듈은 이러한 인식 결과 및 이에 대한 정확도를 출력할 수 있다. 만약, 출력된 정확도가 85%에서 55%로 떨어진 경우, 안전 매커니즘인 1a에 따르면, 50% 이상으로 정상 동작인 것으로 판단된다, 그러나, 입력 값 및 이에 대한 출력 값이 기설정된 조건을 만족하면, 전자 장치는 추가적인 안전 매커니즘을 적용하여 인지 모듈의 동작이 오동작이 아닌지 판단할 수 있다. 예를 들어, 입력 값의 개수 및 출력 값의 개수가 다르거나, 유사한 입력 값에 대한 출력 값이 차이가 기설정된 값 이상이거나, 출력 값이 정상 범위의 경계와 가까워지는 경향성을 보이면, 전자 장치는 추가적인 안전 매커니즘을 적용할 수 있다. 이때, 추 가적인 안전 매커니즘은 기존 인지 모듈의 안전 무결성 레벨에서는 적용되지 않는 것일 수 있다. 예를 들어, 전자 장치는 복수의 안전 매커니즘 중 1f(Diverse software design)을 추가 적용하여 입력된 이미지 에 포함된 물체를 다른 알고리즘으로 인식할 수 있다. 이때, 안전 매커니즘 1f를 적용함에 따라 인식된 물체가 자동차가 아닌 경우, 전자 장치는 인지 모듈에 오류가 있음을 판단할 수 있으며, 다른 알고리즘을 적용함에 따 라 인식 정확도를 높여 에러를 보정할 수 있다. 한편, 전자 장치는 입력 값과 출력 값의 범위를 체크하는 안전 매커니즘인 1a만으로는 오류를 감지하기 어려운 경우, 추가적인 안전 매커니즘을 적용할 수 있다. 예를 들어, 레이더에 의해 감지된 전방 물체와의 거리가 100m에서 갑자기 500m로 감지되는 경우, 안전 매커니즘 1a 만으로는 오류 동작 판단이 불가능한 바, 전자 장치는 복수의 안전 매커니즘 중 1b(Plausibility check)를 추가 적용하여 인지 모듈의 오류 동작을 검출할 수 있다. 일 실시 예로, 인공지능 모델을 이용하는 경우, 감지 된 전방 물체와의 거리가 100m에서 갑자기 500m로 감지되면, 전자 장치는 감지된 전방 물체와의 거리의 정확도 가 기설정된 값 이하인 것으로 판단할 수 있다. 이에 따라, 전자 장치는 추가 안전 매커니즘을 적용하여 인지 모듈의 오류 동작을 검출할 수 있다. 실시 예 2 : 로봇의 팔(arm) 제어 전자 장치가 로봇인 경우, 로봇 팔은 주변 사람과의 거리 및 사람의 속도를 모니터링하고, 로봇의 액츄에이터의 힘을 제어하는 것이 필요하다. 이때, 로봇의 인지 모듈, 판단 모듈 및 제어 모듈의 안전 무결성 레벨은 통상적 으로 SIL 2 등급이며, 이때, 강하게 권고되는 안전 매커니즘은 1a(Range check of Input/Ouput Data)일 수 있 다. 우선 전자 장치의 인지 모듈은 전자 장치에 구비된 센서로부터 주변 물체의 존재 여부 및 거리 값을 입력받을 수 있다. 일 실시 예로, 인지 모듈은 센서로부터 초당 30회로 감지된 센싱 값을 입력받을 수 있다. 그리고, 인 지 모듈은 주변 물체가 사람으로 인식되는지에 대한 인식률을 출력하고, 사람의 속도를 고려한 거리 값을 출력 할 수 있다. 이때, 입력 값 및 출력 값의 개수가 다르거나, 출력 값의 범위가 기설정된 값 이상인 경우, 전자 장치는 인지 모듈의 오동작을 의심하고, 추가적인 안전 매커니즘을 적용할 수 있다. 예를 들어, 전자 장치는 인지 모듈에 안 전 매커니즘 1e(control flow monitoring)를 추가 적용할 수 있다. 여기서, 안전 매커니즘 1e는 인지 모듈이 수 행 해야 할 필수적인 기능들(check points)이 제 시간에 수행되는지, 해당 기능들이 기설정된 순서로 실행되는 지 판단할 수 있다. 한편, 전자 장치의 판단 모듈은 인지 모듈로부터 사람에 대한 인식률과 사람과의 거리 값을 입력받고, 이에 기 초하여 사람과의 충돌 위험도 및 로봇 팔의 힘의 최대 수치를 출력할 수 있다. 이때, 출력된 위험도 및 최대 수 치 값의 범위가 기설정된 값 이상인 경우, 전자 장치는 판단 모듈의 오동작을 의심하고, 추가적인 안전 매커니 즘을 적용할 수 있다. 예를 들어, 전자 장치는 판단 모듈에 안전 매커니즘 1e(control flow monitoring)를 추가 적용할 수 있다. 한편, 전자 장치의 제어 모듈은 판단 모듈에서 출력된 로봇 팔의 힘의 최대 수치 값을 입력받아 로봇 팔의 움직 임을 담당하는 모듈로 입력 받은 수치를 변환하여 전달할 수 있다. 이때, 전달된 값에 대비하여 로봇 팔에서 출 력되는 힘의 증감폭이 기설정된 값 이상인 경우, 전자 장치는 제어 모듈의 오동작을 의심하고, 추가적인 안전 매커니즘을 적용할 수 있다. 예를 들어, 전자 장치는 제어 모듈에 안전 매커니즘 1b(Plausibility check)를 추 가 적용할 수 있다. 여기서, 안전 매커니즘 1b는 입력 값에 대한 출력 값을 단순 범위만을 체크하는 것이 아니 고, 기준 모델(Reference model)로부터 비교할 수 있다. 즉, 안전 매커니즘 1b는 독립된 비교대상 값과 실제 값 을 비교하여 이상을 감지하는 방식으로, 본 예시에서는, 로봇 팔의 힘의 증감폭에 대한 일반적인 비교 대상 모 델이 저장되어 있으면, 전자 장치는 실제 제어 모듈에 입력된 명령 값과 저장된 비교 대상 모델에서 제시되는 값의 차이를 판단하여, 제어 모듈의 이상을 감지할 수 있다.한편, 이상에서는 입력 값과 출력 값이 기설정된 조건을 만족하는 경우에 전자 장치에 구비된 프로세서에 의해 복수의 안전 매커니즘 중 적어도 하나의 안전 매커니즘이 추가 적용되는 것으로 기재하였다. 그러나, 이하 도 8 및 도 9와 같이 학습된 인공지능 모델(AI Engine)을 이용하여 각 모듈에 적용될 안전 매커니즘이 결정될 수 있 다. 도 8은 본 개시의 일 실시 예에 따라 인공지능 모델(AI Engine)을 이용하여 안전 매커니즘을 추가 적용하는 실 시 예를 설명하기 위한 도면이다. 도 8을 참조하면, 인지 모듈, 판단 모듈 및 제어 모듈의 동작 및 인지 모듈, 판단 모듈 및 제어 모듈 각각에 적용되는 안전 매커니즘(811, 821, 831)은 안전 무결성 레벨에 따른 것으로 도 7에 도시된 것과 동일할 수 있다. 다만, 인지 모듈, 판단 모듈 및 제어 모듈 각각은 학습된 인공지능 모델에 의해 제어될 수 있다. 구체적으로, 학습된 인공지능 모델은 각 기능 모듈의 입력 값 및 출력 값에 기초하여, 안전 무결성 레벨에 따른 안전 매커니즘(811, 821, 831) 이외에 적용될 추가적인 안전 매커니즘를 결정할 수 있다. 이때, 학습된 인공지능 모델은 이미 학습이 완료된 것으로 전자 장치의 제조시 삽입될 수 있으며, 이후 전 자 장치의 사용 과정 및 사용자의 수동 조작 등에 의해 계속 학습될 수 있다. 한편, 도 8에서는 기능 모듈의 안전 무결성 레벨에 따라 기적용된 안전 매커니즘 이외의 추가적인 안전 매커니 즘을 적용하는 것으로 도시 및 설명하였으나, 도 9에 도시된 바와 같이 기능 모듈에 적용될 안전 매커니즘이 안 전 무결성 레벨과 무관하게 결정될 수도 있다. 도 9는 본 개시의 일 실시 예에 따라 기능 모듈의 안전 매커니즘을 적용하는 실시 예를 설명하기 위한 도면이다. 구체적으로 도 9를 참조하면, 인공지능 모델은 전자 장치의 인지 모듈, 판단 모듈 및 제어 모듈 각각에 적용될 안전 매커니즘(911, 921, 922)을 결정할 수 있다. 이때, 인공지능 모델은 각 기능 모 듈(910, 920, 930)의 입력 값 및 출력 값에 기초하여 각 기능 모듈(910, 920, 930)에 적용될 안전 매커니즘 (911, 921, 922)을 결정할 수 있다. 여기서, 안전 매커니즘(911, 921, 922) 각각은 적어도 하나의 안전 매커니 즘을 포함할 수 있다. 이때, 인공지능 모델 각 기능 모듈(910, 920, 930)의 안전 무결성 레벨과 무관하게 적용될 안전 매커니즘 (911, 921, 922)을 결정할 수 있다. 이에 따라, 안전 매커니즘(911, 921, 922) 각각은 각 기능 모듈(910, 920, 930)의 안전 무결성 레벨에 따라 강하게 권고되는 안전 매커니즘을 포함하지 않을 수 있다. 이때, 학습된 인공지능 모델은 각 기능 모듈의 입력 값 및 출력 값을 입력 값으로 하여 이미 학습이 완료 된 것으로 전자 장치의 제조시 삽입될 수 있으며, 이후 전자 장치의 사용 과정 및 사용자의 수동 조작 등에 의 해 계속 학습될 수 있다. 이와 같이, 학습된 인공지능 모델을 이용하여 각 기능 모듈에 적용될 안전 매커니즘을 결정함으로써, 고장 상황 을 보다 빠르고 정확하게 감지할 수 있게 된다. 도 10은 본 개시의 일 실시 예에 따른, 인공지능 모델을 학습하고 이용하기 위한 전자 장치의 구성을 나타내는 블록도이다. 도 10을 참조하면, 프로세서는 학습부 및 결정부 중 적어도 하나를 포함할 수 있다. 도 10의 프로세서는 도 2의 프로세서, 도 8의 인공지능 모델, 도 9의 인공지능 모델에 대응될 수 있다. 학습부는 안전 매커니즘을 결정하기 위한 모델을 생성 또는 학습시킬 수 있다. 학습부는 수집된 학 습 데이터를 이용하여 기능 모듈에 적용될 안전 매커니즘을 결정하기 위한 인공 지능 모델을 생성할 수 있다. 학습부는 수집된 학습 데이터를 이용하여 기능 모듈에 적용될 안전 매커니즘을 결정을 위한 기준을 갖는 학습된 모델을 생성할 수 있다. 이러한 학습부는 인공 지능 모델의 트레이닝 셋(training set)에 대응될 수 있다. 일 예로, 학습부는 기능 모듈의 입/출력 값과 입/출력값에 대응되는 안전 매커니즘을 입력 데이터로 사용 하여 복수의 안전 매커니즘 중 기능 모듈에 적용될 적어도 하나의 안전 매커니즘을 예측하기 위한 모델을 생성, 학습 또는 갱신시킬 수 있다. 여기서, 입력 데이터로 사용되는 입/출력 값에 대응되는 안전 매커니즘이란, 해당기능 모듈의 입력 값 및 출력 값에 따라 기능 모듈의 오류를 검출하기 위해 적용되어야 하는 기결정된 안전 매 커니즘을 의미할 수 있다. 추가적으로, 학습부는 기능 모듈의 입력 값, 출력 값, 사용자의 수동 조작에 따른 제어 값 및 입/출력 값, 제어 값에 대응되는 안전 매커니즘을 입력 데이터로 사용하여 기능 모듈에 적용될 적어도 하나의 안전 매커 니즘을 예측하기 위한 모델을 생성, 학습 또는 갱신시킬 수 있다. 결정부는 소정의 데이터를 학습된 모델의 입력 데이터로 사용하여, 다양한 정보를 획득할 수 있다. 일 예 로, 결정부는 이후 기능 모듈의 입력 값 및 출력 값이 입력되면, 기능 모듈의 오류와 관련된 정보를 획득 (또는, 인식, 추정, 추론)할 수 있다. 학습부의 적어도 일부 및 결정부의 적어도 일부는, 소프트웨어 모듈로 구현되거나 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 학습부 및 결정부 중 적어 도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제 작되어 전술한 각종 전자 장치에 탑재될 수도 있다. 이때, 인공 지능을 위한 전용 하드웨어 칩은 확률 연산에 특화된 전용 프로세서로서, 기존의 범용 프로세서보다 병렬처리 성능이 높아 기계 학습과 같은 인공 지능 분야 의 연산 작업을 빠르게 처리할 수 있다. 학습부 및 결정부가 소프트웨어 모듈(또는, 인스트럭션 (instruction) 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능 한 비일시적 판독 가능 기록매체(non-transitory computer readable media)에 저장될 수 있다. 이 경우, 소프 트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 애플리케이션에 의해 제공될 수 있다. 또는, 소프트웨어 모듈 중 일부는 OS(Operating System)에 의해 제공되고, 나머지 일부는 소정의 애플리케이션에 의해 제공될 수 있다. 이 경우, 학습부 및 결정부는 서버와 같은 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 학습부 및 결정부 중 하나는 자동차, 로봇과 같 은 전자 장치에 포함되고, 나머지 하나는 외부의 서버에 포함될 수 있다. 또한, 학습부 및 결정부 는 유선 또는 무선으로 통하여, 학습부가 구축한 모델 정보를 결정부로 제공할 수도 있고, 학습부 로 입력된 데이터가 추가 학습 데이터로서 학습부로 제공될 수도 있다. 도 11은 도 10의 학습부 및 결정부의 구체적인 구성을 나타내는 블록도이다. 도 11의 (a)를 참조하면, 일부 실시 예에 따른 학습부는 학습 데이터 획득부(1010-1) 및 모델 학습부 (1010-4)를 포함할 수 있다. 또한, 학습부는 학습 데이터 전처리부(1010-2), 학습 데이터 선택부(1010-3) 및 모델 평가부(1010-5) 중 적어도 하나를 선택적으로 더 포함할 수 있다. 학습 데이터 획득부(1010-1)는 모델에 필요한 학습 데이터를 획득할 수 있다. 본 개시의 실시 예로, 학습 데이 터 획득부(1010-1)는 기능 모듈의 입력 값, 출력 값 및 입/출력 값에 대응되는 안전 매커니즘 등을 학습 데이터 로서 획득할 수 있다. 구체적으로, 학습 데이터 획득부(1010-1)는 기능 모듈의 입력 값 및 출력 값에 추가적으 로 사용자의 수동 조작에 따른 제어 값 및 입/출력 값, 제어 값에 대응되는 안전 매커니즘 등을 학습 데이터로 획득할 수 있다. 모델 학습부(1010-4)는 학습 데이터를 이용하여 획득된 안전 매커니즘에 의한 오류 검출 여부와 실제 상황에 대 한 정보의 차이를 어떻게 보정할지에 관해 학습시킬 수 있다. 예로, 모델 학습부(1010-4)는 학습 데이터 중 적 어도 일부를 판단 기준으로 이용하는 지도 학습(supervised learning)을 통하여, 인공 지능 모델을 학습시킬 수 있다. 또는, 모델 학습부(1010-4)는, 예를 들어, 별다른 지도 없이 학습 데이터를 이용하여 스스로 학습함으로 써, 상황의 판단을 위한 판단 기준을 발견하는 비지도 학습(unsupervised learning)을 통하여, 인공 지능 모델 을 학습시킬 수 있다. 또한, 모델 학습부(1010-4)는, 예를 들어, 학습에 따른 상황 판단의 결과가 올바른 지에 대한 피드백을 이용하는 강화 학습(reinforcement learning)을 통하여, 인공 지능 모델을 학습시킬 수 있다. 또 한, 모델 학습부(1010-4)는, 예를 들어, 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient descent)을 포함하는 학습 알고리즘 등을 이용하여 인공 지능 모델을 학습시킬 수 있다 인공 지능 모델이 학습되면, 모델 학습부(1010-4)는 학습된 인공 지능 모델을 저장할 수 있다. 이 경우, 모델 학습부(1010-4)는 학습된 인공 지능 모델을 서버(예를 들어, 인공 지능 서버)에 저장할 수 있다. 또는, 모델 학 습부(1010-4)는 학습된 인공 지능 모델을 서버와 유선 또는 무선 네트워크로 연결되는 전자 장치의 메모리에 저 장할 수도 있다.학습 데이터 전처리부(1010-2)는 기능 모듈의 오류를 검출하기 위해 복수의 안전 매커니즘 중 기능 모듈에 적용 될 안전 매커니즘의 결정을 위한 학습에 획득된 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 학습 데이터 전처리부(1010-2)는 모델 학습부(1010-4)가 기능 모듈의 오류를 검출하는데 적용될 안전 매 커니즘을 결정하기 위한 학습을 위하여 획득된 데이터를 이용할 수 있도록, 획득된 데이터를 기설정된 포맷으로 가공할 수 있다. 학습 데이터 선택부(1010-3)는 학습 데이터 획득부(1010-1)에서 획득된 데이터 또는 학습 데이터 전처리부 (1010-2)에서 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 선택된 학습 데이터는 모델 학 습부(1010-4)에 제공될 수 있다. 학습 데이터 선택부(1010-3)는 기 설정된 선별 기준에 따라, 획득되거나 전처 리된 데이터 중에서 학습에 필요한 학습 데이터를 선택할 수 있다. 또한, 학습 데이터 선택부(1010-3)는 모델 학습부(1010-4)에 의한 학습에 의해 기 설정된 선별 기준에 따라 학습 데이터를 선택할 수도 있다. 학습부는 인공 지능 모델의 인식 결과를 향상시키기 위하여, 모델 평가부(1010-5)를 더 포함할 수도 있다. 모델 평가부(1010-5)는 인공 지능 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 인식 결과가 소 정 기준을 만족하지 못하는 경우, 모델 학습부(1010-4)로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 인공 지능 모델을 평가하기 위한 기 정의된 데이터일 수 있다. 예를 들어, 모델 평가부(1010-5)는 평가 데이터에 대한 학습된 인공 지능 모델의 인식 결과 중에서, 인식 결과 가 정확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정된 임계치를 초과하는 경우 소정 기준을 만족하지 못한 것으로 평가할 수 있다. 한편, 학습된 인공 지능 모델이 복수 개가 존재하는 경우, 모델 평가부(1010-5)는 각각의 학습된 인공 지능 모 델에 대하여 소정 기준을 만족하는지를 평가하고, 소정 기준을 만족하는 모델을 최종 인공 지능 모델로서 결정 할 수 있다. 이 경우, 소정 기준을 만족하는 모델이 복수 개인 경우, 모델 평가부(1010-5)는 평가 점수가 높은 순으로 미리 설정된 어느 하나 또는 소정 개수의 모델을 최종 인공 지능 모델로서 결정할 수 있다. 도 11의 (b)를 참조하면, 일부 실시 예에 따른 결정부는 입력 데이터 획득부(1020-1) 및 결정부(1020- 4)를 포함할 수 있다. 또한, 결정부는 입력 데이터 전처리부(1020-2), 입력 데이터 선택부(1020-3) 및 모델 갱신부(1020-5) 중 적어도 하나를 선택적으로 더 포함할 수 있다. 입력 데이터 획득부(1020-1)는 기능 모듈의 입/출력 값 및 입/출력 값에 대응되는 안전 매커니즘을 입력 데이터 로 획득할 수 있다. 또는, 입력 데이터 획득부(1020-1)는 기능 모듈의 입력 값 및 출력 값에 대한 사용자의 수 동 조작에 따른 제어 값 및 입/출력 값, 제어 값에 대응되는 안전 매커니즘을 입력 데이터로 획득할 수 있다. 결정부(1020-4)는 입력 데이터 획득부(1020-1)에서 획득된 입력 데이터를 입력 값으로 학습된 인공 지능 모델에 적용하여 입력 데이터를 처리한 결과를 획득할 수 있다. 결정부(1020-4)는 후술할 입력 데이터 전처리부(1020- 2) 또는 입력 데이터 선택부(1020-3)에 의해 선택된 데이터를 입력 값으로 인공 지능 모델에 적용하여 입력 데 이터를 처리한 결과를 획득할 수 있다. 일 실시 예로, 결정부(1020-4)는 입력 데이터 획득부(1020-1)에서 획득한 기능 모듈의 입력 값, 출력 값 또는 사용자의 수동 조작에 따른 제어 값 등을 학습된 모델에 적용하여 기능 모듈의 오류를 검출하기 위해 적용될 적 어도 하나의 안전 매커니즘의 결정 결과를 획득(또는, 추정)할 수 있다. 결정부는 인공 지능 모델의 인식 결과를 향상시키거나, 인식 결과의 제공을 위한 자원 또는 시간을 절약 하기 위하여, 입력 데이터 전처리부(1020-2) 및 입력 데이터 선택부(1020-3)를 더 포함할 수도 있다. 입력 데이터 전처리부(1020-2)는 제1 및 제2 모델에 입력되기 위해 획득된 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 입력 데이터 전처리부(1020-2)는 결정부(1020-4)가 기능 모듈의 최적의 오류 검출 결과를 획득하기 위해 획득된 데이터를 이용할 수 있도록, 획득된 데이터를 기 정의된 포맷으로 가공할 수 있다. 입력 데이터 선택부(1020-3)는 입력 데이터 획득부(1020-1)에서 획득된 데이터 또는 입력 데이터 전처리부 (1020-2)에서 전처리된 데이터 중에서 상황 판단에 필요한 데이터를 선택할 수 있다. 선택된 데이터는 결정부 (1020-4)에게 제공될 수 있다. 입력 데이터 선택부(1020-3)는 상황 판단을 위한 기 설정된 선별 기준에 따라, 획득되거나 전처리된 데이터 중에서 일부 또는 전부를 선택할 수 있다. 또한, 입력 데이터 선택부(1020-3)는 모델 학습부(1010-4)에 의한 학습에 의해 기 설정된 선별 기준에 따라 데이터를 선택할 수도 있다. 모델 갱신부(1020-5)는 결정부(1020-4)에 의해 제공되는 인식 결과에 대한 평가에 기초하여, 인공 지능 모델이 갱신되도록 제어할 수 있다. 예를 들어, 모델 갱신부(1020-5)는 결정부(1020-4)에 의해 제공되는 영상 처리 결 과를 모델 학습부(1010-4)에게 제공함으로써, 모델 학습부(1010-4)가 인공 지능 모델을 추가 학습 또는 갱신하 도록 요청할 수 있다. 도 12는 기적용된 안전 매커니즘의 적용을 중단하는 실시 예를 설명하기 위한 도면이다. 도 12를 참조하면, 인지 모듈, 판단 모듈 및 제어 모듈의 동작 및 인지 모듈, 판단 모 듈 및 제어 모듈 각각에 적용되는 안전 매커니즘(1211, 1221, 1231)은 안전 무결성 레벨에 따른 것으로 도 7에 도시된 것과 동일할 수 있다. 한편, 전자 장치는 기능 모듈의 성능이 매우 높거나, 실시간성이 요구되는 경우 기능 모듈의 오류 동작을 검출 하는 단계를 생략할 수 있다. 여기서, 기능 모듈의 성능이 높다는 것은, 기능 모듈의 오류 동작 가능성이 낮다 는 것을 의미할 수 있다. 구체적으로, 전자 장치는 기능 모듈의 고장 확률이 매우 낮고, 오동작의 경우에도 피 해가 없는 경우에는 기능 모듈에 안전 매커니즘 적용을 중단하고, 출력 값을 바로 다음 기능 모듈로 전달할 수 있다. 여기서, 기능 모듈의 고장 확률이 매우 낮다는 것은 기설정된 시간 또는 횟수동안 기능 모듈에 안전 매커 니즘을 적용한 결과 정상 범위 내이고, 오동작으로 의심할만한 경향성 또한 보이지 않는 것을 의미할 수 있다. 도 12에는 인공지능 모델이 도시되지는 않았지만, 기능 모듈 별로 안전 매커니즘의 적용을 중단하는 동작은 인 공지능 모델에 의해 각각 기능 모듈 별로 수행될 수 있다. 기능 모듈에 안전 매커니즘의 적용이 중단된 경우에도, 기설정된 시간 또는 기능 모듈의 기설정된 동작 횟수가 초과하면, 전자 장치는 안전 매커니즘을 다시 적용할 수 있다. 이와 같이, 안전성이 보장된 기능 모듈에 대해서는 안전 매커니즘을 적용하지 않음으로써, 기능 수행에 소요되 는 시간 및 리소스를 감축할 수 있게 된다. 도 13 및 도 14는 추가 안전 매커니즘이 필요한 실시 예를 설명하기 위한 도면이다. 구체적으로, 도 13 및 14는 기능 모듈에 안전 매커니즘을 적용하였을 때, 정상 동작인 것으로 판단되더라도, 오동작이 의심되는 경우의 실 시 예를 도시한 것이다. 예를 들어, 도 13 및 도 14는 기능 모듈에 안전 매커니즘 1a를 적용한 경우를 예시로서 도시한 것이다. 예를 들어, 기능 모듈의 오동작이 의심되는 경우는 입력 값 및 출력 값의 개수가 다르거나, 도 13에 도시된 바 와 같이 입력 값에 대한 출력 값이 정상 범위의 경계와 가까워지는 경향성을 보이거나, 도 14에 도시된 바와 같 이 입력 값에 대한 출력 값의 변화량이 기설정된 값을 초과하는 경우를 포함할 수 있다. 도 13을 참조하면, 안전 매커니즘 1a를 적용하였을 때, 입력 값에 대한 출력 값의 정상 범위가 a 와 b 사이인 경우, 출력 값의 범위는 a 와 b 사이에 존재하므로 기존에는 기능 모듈이 정상 동작하는 것으로 판단되었을 수 있다. 그러나, 본 개시의 일 실시 예에 따르면, 출력 값이 정상 범위 내이더라도, 유사한 입력 값에 대한 출력 값이 정상 범위의 경계와 점점 가까워지는 경향성을 보이는 경우, 전자 장치는 기능 모듈의 오동작을 의심할 수 있다. 예를 들어, 자동차의 ADAS의 ASCC 시스템에서 인지 모듈이 이미지에 포함된 물체를 자동차로 인식한 경우, 인식의 정확도가 정상 범위 내이지만 경계 값에 점점 가까워지는 경우 전자 장치는 인지 모듈의 오동작을 의심할 수 있으며, 추가 안전 매커니즘을 적용할 수 있다. 도 14를 참조하면, 유사한 입력 값에 대한 출력 값의 변화량이 기설정된 값 이상인 경우, 전자 장치는 기능 모 듈의 오동작을 의심할 수 있다. 구체적으로, 인식의 정확도가 정상 범위 내에서 요동치는지 여부는 시간에 따른 정확도의 변화량(Δy/Δt)에 기초하여 식별될 수 있다. 예를 들어 도 14에 도시된 바와 같이, 정확도의 변화량 의 기준 값의 크기가 c인 경우, 정확도의 변화량이 c 초과이거나 -c 미만이면, 전자 장치는 인지 모듈의 오동작 을 의심할 수 있다. 또 다른 실시 예로, 특정 시간 범위 내에서 정확도의 변화량의 평균이 c 초과 또는 -c 미만 이면, 전자 장치는 인지 모듈의 오동작을 의심할 수 있다. 일 실시 예로, 자동차의 ADAS의 ASCC 시스템에서 인지 모듈이 이미지에 포함된 물체를 자동차로 인식한 경우, 인식의 정확도가 정상 범위 내임에도 변화량이 기설정된 값보다 큰 경우, 전자 장치는 인지 모듈의 오동작을 의 심할 수 있으며, 추가 안전 매커니즘을 적용할 수 있다.도 15은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 15를 참조하면, 우선 전자 장치는 전자 장치에 포함된 기능 모듈에 대응되는 기능을 수행하기 위해 기능 모 듈에 입력 값을 입력하여 출력 값을 획득할 수 있다(S1510). 이때, 기능 모듈에 입력되는 입력 값은 센서에 의 해 획득된 센싱 값, 외부 장치로부터 수신된 정보 및 이전 기능 모듈에서 출력된 출력 값 중 적어도 하나일 수 있다. 그 다음, 전자 장치는 입력 값 및 출력 값을 바탕으로 기능 모듈에 적용될 안전 매커니즘을 결정할 수 있다 (S1520). 구체적으로, 전자 장치는 기능 모듈의 안전 무결성 레벨에 기초하여 기적용된 안전 매커니즘에 추가적 으로 적용될 안전 매커니즘을 결정하거나, 안전 무결성 레벨과 무관하게 적용될 안전 매커니즘을 결정할 수 있 다. 이와 같은 입력 값 및 출력 값을 이용하여 기능 모듈이 적용될 안전 매커니즘을 결정하는 동작은 프로세서 에 의해 기설정된 조건에 기초하여 수행되거나, 학습된 인공지능 모델에 의해 수행될 수 있다. 그 다음, 전자 장치는 결정된 안전 매커니즘을 바탕으로 기능 모듈의 오류 동작을 검출할 수 있다(S1530). 이때, 본 개시에 따르면, 기존 기능 모듈의 안전 무결성 레벨에 따라 적용된 안전 매커니즘에서는 검출되지 않 았던 오류 동작이 추가적으로 안전 매커니즘을 적용함에 따라 검출될 수 있다. 도 16는 도 15의 제어 방법을 보다 구체적으로 기재한 흐름도이다. 도 16을 참조하면, 우선 잔자 장치는 오동작의 경우 안전에 위협을 줄 수 있는 safety critical 기능인 기능 F 를 동작할 수 있다(S1610). 여기서 기능 F를 동작한다는 것은 기능 F에 대응되는 기능 모듈이 동작하거나, 칩에 의해 기능 F가 수행되는 것을 의미할 수 있다. 여기서, 기능 F는 ASIL B 등급일 수 있으며, 이에 따라 ASIL B에 요구되는 안전 매커니즘(safety mechanism) 1a가 동작될 수 있다. 그리고, 전자 장치는 기능 모듈의 입력 값 및 출력 값의 패턴 분석 및 리스크를 예측할 수 있다(S1620). 구체적 으로, 전자 장치는 입력 값에 대한 출력 값의 경향성 및 해당 기능 모듈이 오동작하는 경우 발생할 리스크를 예 측할 수 있다. 이러한 동작은 기설정된 조건에 기초하여 프로세서에 의해 수행되거나, 학습된 인공지능 모델에 의해 수행될 수 있다. 그 다음, 입력에 대한 출력 값의 패턴을 분석하였을 때, 리스크가 높다고 판단되면, 전자 장치는 ASIL B 이상에 서 권고되는 안전 매커니즘 1b, 1f를 추가적으로 적용할 수 있다(S1630). 이때, 전자 장치에 인공지능 모델이 포함되어 있다면, 인공지능 모델은 기능 모듈의 입력 값 및 출력 값에 대해 적용되는 안전 매커니즘을 학습할 수 있다. 추가적인 안전 매커니즘 적용에 따라 오류가 감지되면, 전자 장치는 전자 장치를 안전 상태(Safe state)로 변경 (transition)할 수 있다(S1640). 구체적으로, 전자 장치는 해당 기능 모듈을 안전 상태로 변경할 수 있다. 여기 서, 안전 상태는 전자 장치의 동작이 멈추도록 전원의 공급을 중단하거나, 오류가 검출된 기능을 제한하는 상태 일 수 있다. 이때, 전자 장치는 검출된 오류에 대한 정보를 디스플레이 또는 스피커를 통해 사용자에게 알릴 수 있다. 알림을 받은 사용자는 기기를 수동으로 조작하거나 해당 기능에 대한 안전 조치를 취할 수 있다. 한편, 추가적인 안전 매커니즘을 적용한 경우 기설정된 특정 시간동안 문제 패턴이 발견되지 않으면, S1610 단 계로 회귀하여, 추가적인 안전 매커니즘 적용을 중단하고, 안전 무결성 레벨에서 요구되는 안전 매커니즘만을 적용할 수 있다. 한편, 입력 값 및 출력 값의 패턴을 분석한 결과 기설정된 특정 시간 동안 문제 패턴이 발견되지 않으면, 전자 장치는 ASIL B에서 최소한 요구되는 안전 매커니즘 1a를 선택적으로 제외할 수 있다(S1650). 만약, 안전 매커니 즘 1a의 적용이 중단된 경우, 전자 장치는 기설정된 시간 이후 또는 기능 F가 기설정된 횟수 이상 동작한 경우 다시 입력 값 및 출력 값의 패턴을 분석하여 리스크를 예측할 수 있다. 이상에 기재한 다양한 실시 예에 따라, 기존 안전 매커니즘에서는 검출할 수 없었던 오류를, 추가 안전 매커니 즘을 적용함에 따라 검출할 수 있게 되므로 보다 빠른 대처가 가능하게 된다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합된 것 을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드 웨어적인 구현에 의하면, 본 개시에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processors), 제어기 (controllers), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서(microprocessors), 기타 기능 수행을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되 는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 상기 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 방법은 비일시적 판독 가능 매체(non-transitory readable medium) 에 저장될 수 있다. 이러한 비일시적 판독 가능 매체는 다양한 장치에 탑재되어 사용될 수 있다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 방법을 수행하기 위한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시"}
{"patent_id": "10-2018-0120727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야 에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2018-0120727", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 전자 장치의 오류 감지 상황을 설명하기 위한 도면, 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 간략한 구성을 설명하기 위한 블럭도, 도 3은 도 2에 개시된 전자 장치의 구체적인 구성을 설명하기 위한 블럭도,도 4는 다양한 표준에 따른 안전 무결성 레벨을 설명하기 위한 도면, 도 5는 자동차의 안전 기능 별 안전 무결성 레벨의 일 실시 예를 설명하기 위한 도면, 도 6은 안전 무결성 레벨 별로 적용되는 안전 매커니즘의 일 실시 예를 설명하기 위한 도면, 도 7 및 도 8은 본 개시의 일 실시 예에 따라 안전 매커니즘을 추가 적용하는 실시 예를 설명하기 위한 도면, 도 9는 본 개시의 일 실시 예에 따라 기능 모듈의 안전 매커니즘을 적용하는 실시 예를 설명하기 위한 도면, 도 10은 본 개시의 일 실시 예에 따른, 인공지능 모델을 학습하고 이용하기 위한 전자 장치의 구성을 나타내는 블록도, 도 11은 도 10의 학습부 및 획득부의 구체적인 구성을 나타내는 블록도, 도 12는 기적용된 안전 매커니즘의 적용을 중단하는 실시 예를 설명하기 위한 도면, 도 13 및 도 14는 추가 안전 매커니즘이 필요한 실시 예를 설명하기 위한 도면, 도 15은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도, 그리고, 도 16는 도 15의 제어 방법을 보다 구체적으로 기재한 흐름도이다."}
