{"patent_id": "10-2021-0137767", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0132624", "출원번호": "10-2021-0137767", "발명의 명칭": "도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법과 도로측 기기", "출원인": "아폴로 인텔리전트 커넥티비티", "발명자": "위엔, 리삔"}}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 카메라와 제2 카메라를 포함하고, 상기 제1 카메라와 상기 제2 카메라 사이에는 공동 가시 영역이 구비되는도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법에 있어서,제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하고 상기 제1 매칭포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭스를생성하는 단계; 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하고 상기 제1 회전 매트릭스와 상기 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 생성하는 단계; 상기 제3 회전 매트릭스에 근거하여 상기 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 단계를 포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하는 상기 단계는,상기 제1 카메라가 수집한 영상에 근거하여 제1 왜곡 제거 영상을 생성하고, 상기 제2 카메라가 수집한 영상에근거하여 제2 왜곡 제거 영상을 생성하되, 여기서, 상기 제1 왜곡 제거 영상과 상기 제2 왜곡 제거 영상은 상기공동 가시 영역에 위치한 영상 영역을 각각 구비하는 단계; 상기 제1 왜곡 제거 영상에서 상기 공동 가시 영역에 위치한 영상 영역의 제1 영상 특징을 추출하고 상기 제2왜곡 제거 영상에서 상기 공동 가시 영역에 위치한 영상 영역의 제2 영상 특징을 추출하는 단계; 상기 제1 영상 특징과 상기 제2 영상 특징에 기반하여 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상사이의 제1 매칭 포인트 쌍을 결정하는 단계를 포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제1 영상 특징과 상기 제2 영상 특징에 기반하여 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상사이의 제1 매칭 포인트 쌍을 결정하는 단계는,상기 제1 영상 특징과 상기 제2 영상 특징에 기반하여 상기 제1 왜곡 제거 영상과 상기 제2 왜곡 제거 영상에대해 특징 매칭을 진행하여 상기 제1 매칭 포인트 쌍을 획득하는 단계를 포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 제1 카메라가 수집한 영상에 근거하여 제1 왜곡 제거 영상을 생성하고, 상기 제2 카메라가 수집한 영상에근거하여 제2 왜곡 제거 영상을 생성하는 단계는,상기 제1 카메라가 수집한 영상을 구면에 투영하여 구면 영상을 획득하고; 상기 구면 영상에 대해 왜곡 제거 처리를 진행하여 상기 제1 왜곡 제거 영상을 획득하는 단계; 왜곡 제거 함수로 상기 제2 카메라가 수집한 영상을 조절하여 상기 제2 왜곡 제거 영상을 획득하는 단계를 포함공개특허 10-2021-0132624-3-하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 매칭 포인트 쌍에 근거하여, 제1 회전 매트릭스를 생성하는 단계는,상기 제1 매칭 포인트 쌍에 근거하여, 제2 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제4회전 매트릭스를 생성하는 단계; 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭스를 획득하고 상기 제4 회전 매트릭스와 상기 제5 회전 매트릭스에 근거하여 상기 제1 회전 매트릭스를 생성하는 단계를 포함하는 도로측카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,제5 회전 매트릭스를 획득하는 상기 단계는,기설정 부앙각과 편주각에 따라 상기 제1 카메라가 수집한 영상이 위치한 제1 카메라 좌표계를 변환하여 상기제5 회전 매트릭스를 획득하는 단계를 포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,제2 회전 매트릭스를 획득하는 상기 단계는,마크 포인트의 3차원 좌표 정보를 획득하고 상기 제2 카메라가 수집한 영상에 근거하여 상기 제2 카메라가 수집한 영상에서의 상기 마크 포인트의 2차원 좌표 정보를 결정하는 단계; 상기 마크 포인트의 3차원 좌표 정보 및 상기 제2 카메라가 수집한 영상에서의 상기 마크 포인트의 2차원 좌표정보에 대해 솔루션 처리를 진행하여 상기 제2 회전 매트릭스를 획득하는 단계를 포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제3 회전 매트릭스에 근거하여 상기 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 단계는,상기 제3 회전 매트릭스에 따라 상기 제1 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 제1 카메라가 수집한 영상을 생성하는 3차원 감지 정보를 생성하는 단계를 포함하는 도로측 카메라의 외부파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 제2 회전 매트릭스에 근거하여 상기 제2 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 단계를 더 포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진행하기 위한 것인 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법.공개특허 10-2021-0132624-4-청구항 11 제1항에 있어서,상기 제2 회전 매트릭스는 상기 제2 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이고, 제3 회전매트릭스는 상기 제1 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것인 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 제1 카메라는 어안 카메라이고 상기 제2 카메라는 레어 뷰 건 타입 카메라이거나; 또는 상기 제1 카메라는 어안 카메라이고 상기 제2 카메라는 프론트 뷰 건 타입 카메라인 도로측 카메라의 외부파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 도로측 카메라는 제3 카메라를 더 포함하고 상기 제1 카메라와 상기 제3 카메라 사이에는 공동 가시 영역이 구비되며;상기 제3 회전 매트릭스에 근거하여 상기 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 단계다음에, 제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상 사이의 제2 매칭 포인트 쌍을 획득하고 상기 제2 매칭포인트 쌍에 근거하여, 제3 카메라의 제1 카메라 좌표계에서의 회전 매트릭스를 나타내는 제6 회전 매트릭스를생성하는 단계; 상기 제3 회전 매트릭스와 상기 제6 회전 매트릭스에 근거하여, 제3 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제7 회전 매트릭스를 생성하는 단계; 상기 제7 회전 매트릭스에 근거하여 상기 제3 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 단계를 더포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상 사이의 제2 매칭 포인트 쌍을 획득하는 상기 단계는,상기 제1 카메라가 수집한 영상에 근거하여 제1 왜곡 제거 영상을 생성하고 상기 제3 카메라가 수집한 영상에근거하여 제3 왜곡 제거 영상을 생성하되, 여기서, 상기 제1 왜곡 제거 영상과 상기 제3 왜곡 제거 영상은 상기공동 가시 영역에 위치한 영상 영역을 각각 구비하는 단계; 상기 제1 왜곡 제거 영상에서 상기 공동 가시 영역에 위치한 영상 영역의 제1 영상 특징을 추출하고 상기 제3왜곡 제거 영상에서 상기 공동 가시 영역에 위치한 영상 영역의 제3 영상 특징을 추출하는 단계; 상기 제1 영상 특징과 상기 제3 영상 특징에 기반하여 제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상사이의 제2 매칭 포인트 쌍을 결정하는 단계를 포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제1 영상 특징과 상기 제3 영상 특징에 기반하여 제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상사이의 제2 매칭 포인트 쌍을 결정하는 단계는,상기 제1 영상 특징과 상기 제3 영상 특징에 기반하여 상기 제1 왜곡 제거 영상과 상기 제3 왜곡 제거 영상에공개특허 10-2021-0132624-5-대해 특징 매칭을 진행함으로써 상기 제2 매칭 포인트 쌍을 획득하는 단계를 포함하고,상기 제3 카메라가 수집한 영상에 근거하여 제3 왜곡 제거 영상을 생성하는 단계는,왜곡 제거 함수로 상기 제3 카메라가 수집한 영상을 조절하여 상기 제3 왜곡 제거 영상을 획득하는 단계를 포함하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 제2 매칭 포인트 쌍에 근거하여, 제6 회전 매트릭스를 생성하는 단계는,상기 제2 매칭 포인트 쌍에 근거하여, 제3 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제8회전 매트릭스를 생성하는 단계; 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭스를 획득하고 상기 제5 회전 매트릭스와 상기 제8 회전 매트릭스에 근거하여 상기 제6 회전 매트릭스를 생성하는 단계를 포함하고,제1 카메라가 어안 카메라이고 제2 카메라가 레어 뷰 건 타입 카메라이면 제3 카메라는 프론트 뷰 건 타입 카메라이며, 제1 카메라가 어안 카메라이고 제2 카메라가 프론트 뷰 건 타입 카메라이면 상기 제3 카메라는 레어 뷰건 타입 카메라인 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 제3 카메라가 수집한 영상의 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진행하기 위한것이고; 상기 제7 회전 매트릭스는 상기 제3 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것인 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서,제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제3 매칭 포인트 쌍을 획득하고 상기 제3 매칭포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭스를생성하는 단계; 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제9 회전 매트릭스를 획득하고 상기 제1 회전 매트릭스와 상기 제9 회전 매트릭스에 근거하여, 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제10회전 매트릭스를 생성하는 단계; 상기 제9 회전 매트릭스에 근거하여 제1 카메라의 3차원 감지 정보를 생성하고 상기 제10 회전 매트릭스에 근거하여 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 단계를 더 포함하고,제9 회전 매트릭스를 획득하는 상기 단계는,마크 포인트의 3차원 좌표 정보를 획득하고 상기 제1 카메라가 수집한 영상에 근거하여 상기 제1 카메라가 수집한 영상에서의 상기 마크 포인트의 2차원 좌표 정보를 결정하는 단계; 상기 마크 포인트의 3차원 좌표 정보 및 상기 제1 카메라가 수집한 영상에서의 상기 마크 포인트의 2차원 좌표정보에 대해 솔루션 처리를 진행하여 상기 제9 회전 매트릭스를 획득하는 단계를 포함하고,상기 제9 회전 매트릭스는 상기 제1 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이고 상기 제10회전 매트릭스는 상기 제2 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것인 도로측 카메라의 외부파라미터에 기반한 3차원 감지 정보 획득 방법."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "적어도 하나의 프로세서; 및 공개특허 10-2021-0132624-6-상기 적어도 하나의 프로세서와 통신 연결하는 메모리를 포함하되, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되고, 상기 명령은 상기 적어도하나의 프로세서에 의해 실행되어 상기 적어도 하나의 프로세서로 하여금 제1항 내지 제18항 중 어느 한 항에따른 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법을 수행할 수 있도록 하는 전자기기."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능 저장 매체에 있어서, 상기 컴퓨터 명령은 컴퓨터로 하여금 제1항 내지 제18항 중 어느 한 항에 따른 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법을 수행하도록 하는 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2021-0137767", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "컴퓨터 판독 가능 저장매체에 저장된 컴퓨터 프로그램에 있어서,상기 컴퓨터 프로그램 중의 명령이 프로세서에 의해 실행될 경우, 제1항 내지 제18항 중 어느 한 항에 따른 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법을 구현하는 컴퓨터 프로그램."}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법과 도로측 기기를 개시하는데 이 는 컴퓨터 기술에서의 자율 주행, 지능형 교통 및 컴퓨터 비전에 관한 것이다. 구체적인 구현 방안은, 제1 카메 라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 (뒷면에 계속)"}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 컴퓨터 기술에서의 자율 주행, 지능형 교통 및 컴퓨터 비전에 관한 것으로, 특히 도로측 카메라의 외 부 파라미터에 기반한 3차원 감지 정보 획득 방법과 도로측 기기에 관한 것이다."}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "도로측 감지 시스템은 차량을 위해 3차원 감지 정보를 제공해야 하는데, 길목에 도로측 카메라를 설치하여 도로 측 카메라를 통해 영상을 획득하고 도로측 카메라에 의해 획득된 영상에 근거하여 3차원 감지 정보를 획득할 수 있다. 도로측 카메라가 획득한 영상에 근거하여 3차원 감지 정보를 획득할 경우, 도로측 카메라의 세계 좌표계 에서의 회전 매트릭스를 획득해야 한다. 종래 기술에서는, 고정밀 지도 또는 인위적인 실시간 동적(real-time kinematic, 약칭은 RTK) 기기 도팅 방식을 통해 도로측 카메라의 세계 좌표계에서의 회전 매트릭스를 미리 획득하여 3 차원 감지 정보를 생성할 수 있다. 그러나 종래 기술에서는, 고정밀 지도의 제작 원가가 비교적 높고 차선이 없을 경우 고정밀도 지도를 사용할 수 없어 도로측 카메라의 세계 좌표계에서의 회전 매트릭스를 결정하는 원가가 높아지게 하며; 인위적인 RTK 기기 에 의한 도팅 방식은 효율이 낮고 신변이 위태로운 문제가 존재하며, 도로측 카메라의 세계 좌표계에서의 회전 매트릭스를 제때에 효과적으로 획득할 수 없다. 이상의 방식은 3차원 감지 정보를 효과적이고 신속하게 얻을 수 없다."}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원은 효과적이고 신속하게 3차원 감지 정보를 획득하는 도로측 카메라의 외부 파라미터에 기반한 3차원 감 지 정보 획득 방법과 도로측 기기를 제공한다."}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 제1 양태에 따르면, 제1 카메라와 제2 카메라를 포함하고 상기 제1 카메라와 상기 제2 카메라 사이에 공동 가시 영역이 구비되는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법을 제공하는 바, 상기 방법은, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하고 상기 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭스를 생성하는 단계; 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하고, 상기 제1 회전 매트 릭스와 상기 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회 전 매트릭스를 생성하는 단계; 상기 제3 회전 매트릭스에 근거하여 상기 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 단계를 포함 한다. 본 출원의 제2 양태에 따르면, 제1 카메라와 제2 카메라를 포함하고 상기 제1 카메라와 상기 제2 카메라 사이에 공동 가시 영역이 구비되는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 장치를 제공하는 바, 상기 장치는, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하는 제1 획득 유닛; 상기 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회 전 매트릭스를 생성하는 제1 생성 유닛; 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하는 제2 획득 유닛; 상기 제1 회전 매트릭스와 상기 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스 를 나타내는 제3 회전 매트릭스를 생성하는 제2 생성 유닛; 상기 제3 회전 매트릭스에 근거하여 상기 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 제3 생성 유 닛을 포함한다. 본 출원의 제3 양태에 따르면, 전자기기를 제공하는 바, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로 세서와 통신 연결되는 메모리를 포함하되, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되고, 상기 명령은 상기 적어도 하나의 프로세서에 의해 실행되어 상기 적어도 하나의 프로세서로 하여금 상기 방법을 수행할 수 있도록 한다. 본 출원의 제4 양태에 따르면, 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능 저장 매체를 제공하는 바, 여 기서, 상기 컴퓨터 명령은 컴퓨터로 하여금 상기 방법을 수행하도록 한다. 본 출원의 제5 양태에 따르면, 컴퓨터 프로그램이 포함되는 컴퓨터 프로그램 제품을 제공하는 바, 상기 컴퓨터 프로그램은 판독 가능 저장 매체에 저장되고, 전자기기의 적어도 하나의 프로세서는 상기 판독 가능 저장 매체 로부터 상기 컴퓨터 프로그램을 판독할 수 있으며, 상기 적어도 하나의 프로세서는 상기 컴퓨터 프로그램을 실 행하여 전자기기로 하여금 제1 양태에 따른 방법을 수행하도록 한다. 본 출원의 제6 양태에 따르면, 제3 양태에서 제공하는 전자기기를 포함하는 도로측 기기를 제공한다. 본 출원의 제7 양태에 따르면, 제3 양태에서 제공하는 전자기기를 포함하는 클라우드 제어 플랫폼을 제공한다. 본 출원의 제8 양태에 따르면, 컴퓨터 판독 가능 저장매체에 저장된 컴퓨터 프로그램을 제공하며, 상기 컴퓨터 프로그램 중의 명령이 프로세서에 의해 실행될 때, 상술한 제1 양태에 따른 방법을 실행하도록 한다."}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 방안에 따르면, 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성할 경우, 고정밀 지도 또는 인위 적인 RTK 기기 도팅 방식을 사용할 필요가 없어 원가를 절감하고 효율을 향상시켜 사람들의 안전을 확보하며; 더 나아가, 제1 카메라가 수집한 영상에서의 3차원 감지 정보를 효과적으로 획득할 수 있다. 또한, 제1 카메라 는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라인 경우, 레어 뷰 건 타입 카메라의 세계 좌표계에서 의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있으며; 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라인 경우, 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있다. 본 명세서에서 설명한 내용은 본 출원의 실시예의 관건적이거나 중요한 특징을 표기하기 위한 것이 아니고 본 출원의 범위를 한정하기 위한 것도 아님을 이해해야 한다. 본 출원의 기타 특징은 아래의 명세서를 통해 더 용 이하게 이해할 수 있을 것이다."}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 도면과 결부하여 본 출원의 예시적인 실시예를 설명하되, 여기서 본 출원의 실시예를 포함하는 여러 가지"}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "세부절차는 이해를 돕기 위한 것으로 이들은 응당 예시적인 것으로 간주해야 한다. 따라서 본 기술분야에서 통 상의 지식을 가진 자들은 여기서 설명한 실시예에 대하여 여러 가지 변화와 수정을 진행할 수 있고 이는 본 출 원의 범위와 정신을 벗어나지 않는다는 것을 알 수 있다. 마찬가지로 명확함과 간결함을 위하여 아래의 설명에 서는 공지 기능과 구조에 대한 설명을 생략하였다. 도로측 감지 시스템에서는 차량에 3차원 감지 정보를 제공하여 길목의 장대에 어안 카메라, 레어 뷰 건 타입 카 메라 및 프론트 뷰 건 타입 카메라를 포함하는 도로측 카메라를 설치할 수 있고; 일반적으로, 각 길목의 장대에 동시에 어안 카메라, 레어 뷰 건 타입 카메라 및 프론트 뷰 건 타입 카메라를 설치한다. 도로측 카메라를 통해 영상을 획득하고, 각 도로측 카메라가 획득한 영상에 근거하여 각 도로측 카메라가 수집한 영상의 3차원 감지 정보를 획득한다. 도로측 카메라가 획득한 영상에서 3차원 감지 정보를 획득할 경우, 도로측 카메라의 세계 좌표계에서의 회전 매 트릭스를 획득한 다음 도로측 카메라의 세계 좌표계에서의 회전 매트릭스에 따라 도로측 카메라가 수집한 영상 의 3차원 감지 정보를 획득해야 한다. 예를 들어 설명하면, 도 1은 어안 카메라가 촬영한 영상인데 어안 카메라 가 수집한 영상은 왜곡된 것이므로 어안 카메라의 세계 좌표계에서의 회전 매트릭스를 획득하여 어안 카메라가 수집한 영상의 3차원 감지 정보를 획득해야 한다. 선행기술에서는, 미리 고정밀 지도 또는 RTK 기기 도팅 방식을 통해 각 도로측 카메라의 세계 좌표계에서의 회 전 매트릭스를 획득하고, 나아가 각 도로측 카메라가 수집한 영상의 3차원 감지 정보를 생성할 수 있다. 하나의 예시에서, 미리 고정밀 지도 또는 RTK 기기 도팅 방식을 통해 마킹 포인트의 GPS(Global Positioning System) 3차원 좌표를 획득하고; 다음, 각 도로측 카메라가 영상을 수집하여 영상에서의 마킹 포인트의 2차원 좌표를 결 정하며; 각 도로측 카메라에 대해, 마킹 포인트의 3차원 좌표, 마킹 포인트의 2차원 좌표에 근거하여 PNP(pespective-n-point, 약칭 PNP) 솔루션 처리를 진행함으로써 각 도로측 카메라의 세계 좌표계에서의 회전 매트릭스를 획득한다. 그러나 상기 방식에서, 고정밀 지도의 제작 원가가 비교적 높고 차선이 없을 경우 고정밀도 지도를 사용할 수 없어 도로측 카메라의 세계 좌표계에서의 회전 매트릭스를 결정하는 원가가 높아지게 하며; 인위적인 RTK 기기 에 의한 도팅 방식은 효율이 낮고 신변이 위태로운 문제가 존재하며 도로측 카메라의 세계 좌표계에서의 회전 매트릭스를 제때에 효과적으로 획득할 수 없다.본 출원은 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법과 도로측 기기를 제공하는데, 이는 컴퓨터 기술에서의 자율 주행, 지능형 교통 및 컴퓨터 비전에 응용되어 정확하고 신속하게 도로측 카메라 의 세계 좌표계에서의 회전 매트릭스를 획득하며, 나아가 효과적이고 신속하게 3차원 감지 정보를 획득하도록 한다. 도 2는 본 출원의 제1 실시예에 따른 도면이고, 도 2에 도시된 바와 같이, 본 실시예에서 제공하는 도로측 카메 라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법은 아래와 같은 단계를 포함한다. 단계, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하고 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭 스를 생성한다. 예시적으로, 본 실시예에서의 도로측 카메라는 제1 카메라와 제2 카메라를 포함하고, 여기서, 제1 카메라와 제2 카메라 사이에는 공동 가시 영역이 구비된다. 하나의 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레 어 뷰 건 타입 카메라이거나; 또는 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이다. 본 실시예의 실행주체는 전자기기 일 수 있는데, 여기서 전자기기는 단말기 또는 서버 또는 기타 본 실시예의 방법을 수행할 수 있는 장치 또는 기기 일 수 있다. 또는 본 출원에서의 각 실시예의 실행주체는 여러 가지 도 로측 기기 일 수 있는데, 여기서 도로측 기기는 예를 들어 컴퓨팅 기능을 구비한 도로측 감지 기기, 도로측 감 지 기기와 연결되는 도로측 컴퓨팅 기기 일 수 있다. 본 출원에서의 각 실시예의 실행주체는 도로측 컴퓨팅 기 기와 연결되는 서버 기기 또는 도로측 감지 기기와 직접적으로 연결되는 서버 기기 등 일 수도 있으며; 여기서 본 출원의 서버 기기는 예를 들어 클라우드 제어 플랫폼, 차량-도로 협업 관리 플랫폼, 중앙 서브 시스템, 에지 컴퓨팅 플랫폼, 클라우드 컴퓨팅 플랫폼 등 일 수도 있다. 여기서, 지능형 교통의 차량-도로 협업 시스템 구조 에서, 도로측 기기는 도로측 감지 기기와 도로측 컴퓨팅 기기를 포함하고, 도로측 감지 기기(예를 들어 도로측 카메라)는 도로측 컴퓨팅 기기(예를 들어 도로측 컴퓨팅 유닛RSCU)에 연결되고, 도로측 컴퓨팅 기기는 서버기기 에 연결되며, 서버기기는 여러 가지 방식을 통해 자율 주행 또는 보조 운전 차량과 통신할 수 있으며; 다른 시 스템 구조에서, 도로측 감지 기기 자체가 컴퓨팅 기능을 포함하면 도로측 감지 기기는 상기 서버기기에 직접 연 결된다. 이상의 연결은 유선 또는 무선일 수 있으며; 본 출원에서 서버 기기는 예를 들어 클라우드 제어 플랫폼, 차량-도로 협업 관리 플랫폼, 중앙 서브 시스템, 에지 컴퓨팅 플랫폼, 클라우드 컴퓨팅 플랫폼 등이다. 우선, 아래의 개념을 소개하는 바, \"레어 뷰 건 타입 카메라 좌표계\"는 레어 뷰 건 타입 카메라가 수집한 영상 이 사용한 좌표계를 가리킨다. \"프론트 뷰 건 타입 카메라 좌표계\"는 프론트 뷰 건 타입 카메라가 수집한 영상 이 사용한 좌표계를 가리킨다. \"어안 카메라 좌표계\"는 어안 카메라가 수집한 영상이 사용한 좌표계를 가리킨다. 제1 카메라와 제2 카메라는 공동 가시 영역을 구비하고, 나아가 공동 가시 영역에 대해, 제1 카메라가 수집한 영상의 상기 공동 가시 영역과 제2 카메라가 수집한 영상의 상기 공동 가시 영역 사이의 제1 매칭 포인트 쌍을 생성할 수 있으며; 제1 매칭 포인트 쌍은 N쌍의 영상 포인트를 포함하고, 각 쌍의 영상 포인트는 제1 카메라와 대응되는 왜곡 제거 영상의 하나의 영상 포인트, 제2 카메라와 대응되는 왜곡 제거 영상의 하나의 영상 포인트 를 포함하는데, N은 1보다 크거나 같은 자연수이다. 여기서, 제1 매칭 포인트 쌍에서의 각 영상 포인트는 모두 2차원 영상 포인트이다. 다음, 에피폴라 기하 알고리즘을 이용하여 제1 매칭 포인트 쌍을 처리하여 제1 회전 매트릭스를 획득하는데, 여 기서, 제1 회전 매트릭스는 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타낸다. 단계, 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하고, 제1 회 전 매트릭스와 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 생성한다. 예시적으로, 고정밀 지도 또는 RTK 기기 도팅 방식을 통해 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나 타내는 제2 회전 매트릭스를 획득할 수 있다. 다음, 제1 회전 매트릭스와 제2 회전 매트릭스에 대해 매트릭스 곱셈 처리를 진행하여 제1 카메라의 세계 좌표 계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 얻는다. 단계, 제3 회전 매트릭스에 근거하여 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성한다. 예시적으로, 제1 카메라가 수집한 영상에 포함된 것은 2차원 감지 정보이고, 제3 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내므로 제3 회전 매트릭스에 따라 제1 카메라가 수집한 영상에서의 2차 원 감지 정보를 세계 좌표계로 전환시켜 제1 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 여기서, 2차원 감지 정보란 2차원 영상에서의 물체의 픽셀 좌표를 가리킨다. 하나의 예시에서, 2차원 감지 정보 는 영상에서의 물체의 2차원 감지 정보 일 수 있고, 여기서 물체는 자동차, 비동력 차량, 보행자 및 차선 등을 포함하나 이에 한정되지 않는다. 하나의 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이며; 나아가, 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌 표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있다. 이로써 \"레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스\", \"어안 카메라의 세계 좌표계에서의 회전 매트릭스\"를 획득하고, 고정밀 지도 또 는 인위적인 RTK 기기 도팅 방식을 사용할 필요가 없이 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제 3 회전 매트릭스)를 획득할 수 있어 원가를 절감하고 효율을 향상시키며 효과적이고 신속하게 어안 카메라의 세 계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있으며, 나아가 효과적이고 신속하게 어안 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 제1 카메라가 어안 카메라이고 제2 카메라가 레어 뷰 건 타입 카메라인 경우, 어안 카메라와 레어 뷰 건 타입 카메라는 공동 가시 영역을 구비하고, 나아가 공동 가시 영역에 대해 어안 카메라가 수집한 영상의 상기 공동 가시 영역과 레어 뷰 건 타입 카메라가 수집한 영상의 상기 공동 가시 영역 사이의 제1 매칭 포인트 쌍을 생성 할 수 있으며; 제1 매칭 포인트 쌍은 N 쌍의 영상 포인트를 포함하고, 각 쌍의 영상 포인트는 어안 카메라와 대 응되는 왜곡 제거 영상의 하나의 영상 포인트, 레어 뷰 건 타입 카메라와 대응되는 왜곡 제거 영상의 하나의 영 상 포인트를 포함한다. 다음, 에피폴라 기하 알고리즘을 이용하여 제1 매칭 포인트 쌍을 처리하여 어안 카메라의 레어 뷰 건 타입 카메 라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭스를 얻을 수 있다. 여기서, \"레어 뷰 건 타입 카메 라 좌표계\"란 레어 뷰 건 타입 카메라가 수집한 영상이 사용하는 좌표계를 가리킨다. 고정밀 지도 또는 RTK 기기 도팅 방식을 통해 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스를 나 타내는 제2 회전 매트릭스를 얻을 수 있다. 다음, 제1 회전 매트릭스와 제2 회전 매트릭스에 대해 매트릭스 곱셈 처리를 진행하여 어안 카메라의 세계 좌표 계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 획득한다. 제3 회전 매트릭스에 따라 어안 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 어안 카메라가 수집한 영상의 3차원 감지 정보를 얻는다. 다른 한 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이며; 나아가, 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있다. 이로써 \"프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스\", \"어안 카메라의 세계 좌표계에서의 회전 매트릭스\"를 획득하고, 고정밀 지 도 또는 인위적인 RTK 기기 도팅 방식을 사용할 필요가 없이 어안 카메라의 세계 좌표계에서의 회전 매트릭스 (즉, 제3 회전 매트릭스)를 획득할 수 있어 원가를 절감하고 효율을 향상시키며 효과적이고 신속하게 어안 카메 라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있으며, 나아가 효과적이고 신속하 게 어안 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 제1 카메라가 어안 카메라이고 제2 카메라가 프론트 뷰 건 타입 카메라인 경우, 어안 카메라와 프론트 뷰 건 타 입 카메라는 공동 가시 영역을 구비하고, 나아가 공동 가시 영역에 대해 어안 카메라가 수집한 영상의 상기 공 동 가시 영역과 프론트 뷰 건 타입 카메라가 수집한 영상의 상기 공동 가시 영역 사이의 제1 매칭 포인트 쌍을 생성할 수 있으며; 제1 매칭 포인트 쌍은 N 쌍의 영상 포인트를 포함하고, 각 쌍의 영상 포인트는 어안 카메라 와 대응되는 왜곡 제거 영상의 하나의 영상 포인트, 프론트 뷰 건 타입 카메라와 대응되는 왜곡 제거 영상의 하 나의 영상 포인트를 포함한다. 다음, 에피폴라 기하 알고리즘을 이용하여 제1 매칭 포인트 쌍을 처리하여 어안 카메라의 프론트 뷰 건 타입 카 메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭스를 얻을 수 있다. 여기서, \"프론트 뷰 건 타입 카메라 좌표계\"란 프론트 뷰 건 타입 카메라가 수집한 영상이 사용하는 좌표계를 가리킨다. 고정밀 지도 또는 RTK 기기 도팅 방식을 통해 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 얻을 수 있다. 다음, 제1 회전 매트릭스와 제2 회전 매트릭스에 대해 매트릭스 곱셈 처리를 진행하여 어안 카메라의 세계 좌표 계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 획득한다. 제3 회전 매트릭스에 따라 어안 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 어안 카메라가 수집한 영상의 3차원 감지 정보를 얻는다. 본 실시예에서는, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍에 따라 제 1 회전 매트릭스를 생성하고; 제1 회전 매트릭스와 제2 회전 매트릭스에 근거하여, 제3 회전 매트릭스를 생성하 는데; 제1 회전 매트릭스는 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내고, 제2 회전 매트릭 스는 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내고, 나아가 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 획득함으로써; 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 획 득한 다음 제3 회전 매트릭스에 근거하여, 제1 카메라가 수집한 영상에서의 2차원 감지 정보를 3차원 감지 정보 로 전환시킬 수 있다. 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성할 경우, 고정밀 지도 또는 인위적인 RTK 기기의 방식을 사용할 필요가 없어 원가를 절감하고 효율을 향상시켜 사람들의 안전을 확보하며; 더 나아가, 제1 카메라가 수집한 영상에서의 3차원 감지 정보를 효과적으로 획득할 수 있다. 또한, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라인 경우, 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회 전 매트릭스)를 획득할 수 있으며; 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라인 경 우, 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카 메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있다. 도 3은 본 출원의 제2 실시예에 따른 도면이고, 도 3에 도시된 바와 같이, 본 실시예에서 제공하는 도로측 카메 라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법은 아래와 같은 단계를 포함한다. 단계, 제1 카메라가 수집한 영상에 근거하여 제1 왜곡 제거 영상을 생성하고 제2 카메라가 수집한 영상에 근거하여, 제2 왜곡 제거 영상을 생성하되, 여기서, 제1 왜곡 제거 영상과 제2 왜곡 제거 영상은 공동 가시 영 역에 위치한 영상 영역을 각각 구비한다. 하나의 예시에서, 단계는, 제1 카메라가 수집한 영상을 구면에 투영시켜 구면 영상을 획득하는 단계; 구면 영상에 대해 왜곡 제거 처리를 진행하여 제1 왜곡 제거 영상을 획득하는 단계; 왜곡 제거 함수로 제2 카메라가 수집한 영상을 조절하여 제2 왜곡 제거 영상을 획득하는 단계를 포함한다. 예시적으로, 본 실시예에서의 도로측 카메라는 제1 카메라와 제2 카메라를 포함하고, 여기서 제1 카메라와 제2 카메라 사이에는 공동 가시 영역이 구비된다. 하나의 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레 어 뷰 건 타입 카메라이거나; 또는 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이다. 본 실시예의 실행주체는 전자기기일 수 있는데, 여기서 전자기기는 단말기 또는 서버 또는 기타 본 실시예의 방 법을 수행할 수 있는 장치 또는 기기 일 수 있다. 우선, 제1 카메라가 수집한 영상 및 제2 카메라가 수집한 영상을 획득하고; 제1 카메라가 수집한 영상에 근거하 여 제1 왜곡 제거 영상을 생성하며, 제2 카메라가 수집한 영상에 근거하여, 제2 왜곡 제거 영상을 생성한다. 하 나의 예시에서, 제1 카메라와 제2 카메라가 공동 가시 영역을 구비하므로 제1 카메라가 수집한 영상과 제2 카메 라가 수집한 영상은 공동 가시 영역(즉, 동일한 영역에 대하여 모두 해당 영역의 영상을 촬영)을 구비하게 되고, 이로써 제1 왜곡 제거 영상과 제2 왜곡 제거 영상은 공동 가시 영역에 위치한 영상 영역을 각각 구비한다. 하나의 예시에서, 제1 카메라는 어안 카메라이다. 제1 카메라가 수집한 영상을 구면에 투영시켜 구면 영상을 획 득하는 바; 도 4는 본 출원의 실시예에서 제공하는 제1 왜곡 제거 영상의 도면이고, 도 4에 도시된 바와 같이, 구면 영상에 대해 왜곡 제거 처리를 진행하여 제1 왜곡 제거 영상을 획득한다. 이러한 과정에서는 현재의 왜곡 제거 영상의 생성 방식을 참조할 수 있다. 여기서, 제1 왜곡 제거 영상은 등가적인 건 타입 카메라에서의 영상 이다. \"등가적인 건 타입 카메라\"란 상이한 도로측 카메라(어안 카메라, 레어 뷰 건 타입 카메라, 프론트 뷰 건 타입 카메라)가 수집한 영상이 하나의 건 타입 카메라(즉 건 타입의 카메라)에 매핑 될 경우, 상기 건 타입 카 메라를 등가적인 건 타입 카메라라고 할 수 있다. 제2 카메라는 레어 뷰 건 타입 카메라, 또는 프론트 뷰 건 타입 카메라이다. 제2 카메라가 수집한 영상도 일정 한 왜곡의 문제를 가지는데; 제2 카메라가 수집한 영상을 조절하여 제2 카메라의 제2 왜곡 제거 영상을 획득할수 있다. 하나의 예시에서, opencv의 왜곡 제거 함수를 이용하여 제2 카메라가 수집한 영상을 조절하여 제2 왜 곡 제거 영상을 획득할 수 있다. 예를 들어 설명하면, opencv의 왜곡 제거 함수를 이용하여 레어 뷰 건 타입 카메라가 수집한 영상에 대해 왜곡 제거 처리를 진행하여 레어 뷰 건 타입 카메라의 제2 왜곡 제거 영상을 얻을 수 있다. 이상의 방식을 통해 제1 카메라가 수집한 영상을 조절하여 제1 왜곡 제거 영상을 획득할 수 있고; 제2 카메라가 수집한 영상을 조절하여 제2 왜곡 영상을 획득함으로써 제1 매칭 포인트 쌍을 획득할 수 있다. 단계, 제1 왜곡 제거 영상에서 공동 가시 영역에 위치한 영상 영역의 제1 영상 특징을 추출하고 제2 왜곡 제거 영상에서 공동 가시 영역에 위치한 영상 영역의 제2 영상 특징을 추출한다. 예시적으로, 제1 왜곡 제거 영상과 제2 왜곡 제거 영상이 동일한 공동 가시 영역에서의 영상 영역을 구비하므로 공동 가시 영역에 대하여 제1 왜곡 제거 영상의 제1 영상 특징을 추출하고 제2 왜곡 제거 영상의 제2 영상 특징 을 추출한다. 여기서, 제1 영상 특징은 예를 들어 각도 스케일 불변 특성 변환(scale-invariant feature transform, 약칭 SIFT) 특징, ORB(oriented fast and rotated brief, 약칭 ORB) 특징이고; 제2 영상 특징은 예 를 들어 각도 SIFT특징, ORB 특징이다. 단계, 제1 영상 특징과 제2 영상 특징에 기반하여 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 결정한다. 하나의 예시에서, 단계는, 제1 영상 특징과 제2 영상 특징에 기반하여 제1 왜곡 제거 영상과 제2 왜곡 제 거 영상에 대해 특징 매칭을 진행하여 제1 매칭 포인트 쌍을 획득하는 단계를 포함한다. 예시적으로, 제1 영상 특징과 제2 영상 특징에 기반하여 제1 왜곡 제거 영상의 공동 가시 영역에서의 영상, 제2 왜곡 제거 영상의 공동 가시 영역에서의 영상에 대해 특징 매칭 처리를 진행하여 제1 매칭 포인트 쌍을 획득한 다. 제1 매칭 포인트 쌍은 N쌍의 영상 포인트를 포함하고 각 쌍의 영상 포인트는 제1 카메라와 대응되는 제1 왜 곡 제거 영상의 하나의 영상 포인트, 제2 카메라와 대응되는 제2 왜곡 제거 영상의 하나의 영상 포인트를 포함 하며, N은 1보다 크거나 같은 자연수이다. 여기서, 제1 매칭 포인트 쌍에서의 각 영상 포인트는 모두 2차원 영 상 포인트이다. 제1 카메라와 제2 카메라가 공동 가시 영역을 구비하고 제1 왜곡 제거 영상에 상기 공동 가시 영역에서의 영상 이 구비되며 제2 왜곡 제거 영상에 상기 공동 가시 영역에서의 영상이 구비되므로 공동 가시 영역에 대하여, 제 1 왜곡 제거 영상의 공동 가시 영역에서의 영상, 제2 왜곡 제거 영상의 공동 가시 영역에서의 영상에 대해 특징 매칭 처리를 진행하며, 이로써 얻은 제1 매칭 포인트 쌍에서의 각 쌍의 영상 포인트는 공동 가시 영역에 대한 것으로서 사후 회전 매트릭스의 분석을 진행하는데 용이하다. 단계, 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭스를 생성한다. 하나의 예시에서, 단계는 아래와 같은 단계를 포함한다. 제1 단계, 제1 매칭 포인트 쌍에 근거하여, 제2 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제4 회전 매트릭스를 생성한다. 제2 단계, 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭스를 획득한다. 제3 단계, 제4 회전 매트릭스와 제5 회전 매트릭스에 근거하여, 제1 회전 매트릭스를 생성한다. 하나의 예시에서, 상기 제2 단계는 구체적으로, 기설정 부앙각과 편주각에 따라 제1 카메라가 수집한 영상이 위 치한 제1 카메라 좌표계를 변환시켜 제5 회전 매트릭스를 획득하는 단계를 포함한다. 예시적으로, 에피폴라 기하 알고리즘을 이용하여 제1 매칭 포인트 쌍을 처리함으로써 제2 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제4 회전 매트릭스(R_tmp)를 획득한다. 이때, 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭스(R)를 더 획득한다. 하나의 예시에서, 제1 카메라가 수집한 영상에 대해 부앙각과 편주각의 왜곡 제거 처리를 진행, 즉, 부앙각, 편 주각에 따라 제1 카메라가 수집한 영상이 위치한 제1 카메라 좌표계를 회전 변환시켜 제5 회전 매트릭스를 획득 할 수 있다. 예를 들어 설명하면, 제1 카메라는 어안 카메라이고 어안 카메라가 수집한 영상은 원형 영상이며; 어안 카메라가 수집한 원형 영상에 대해 부앙각(예를 들어 58도)과 편주각(예를 들어 90도)의 왜곡 제거를 진행할 수 있는데, 이때, 제5 회전 매트릭스(R)(즉, 부앙각, 편주각에 따라 어안 카메라 좌표계를 회전시켜 제5 회 전 매트릭스(R)를 획득)를 획득할 수 있으며, 이때, 제5 회전 매트릭스는 어안 카메라의 등가 카메라 좌표계에 서의 회전 매트릭스이다. 여기서, \"어안 카메라 좌표계\"란, 어안 카메라가 수집한 영상이 사용한 좌표계이다. \"등가 카메라 좌표계\"란, 등가적인 건 타입 카메라가 수집한 영상이 사용한 좌표계이다. 상기 과정에서, 기설 정된 부앙각과 기설정된 편주각에 따라 제1 카메라가 수집한 영상이 위치한 제1 카메라 좌표계를 변환시켜 제5 회전 매트릭스를 정확하게 획득할 수 있다. 다음, 제4 회전 매트릭스(R_tmp)와 제5 회전 매트릭스(R)에 대해 매트릭스 곱셈 처리를 진행하여 제1 회전 매트 릭스 A=R* R_tmp-1를 생성한다. 상기 과정에서, 제4 회전 매트릭스는 제2 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내고 제5 회 전 매트릭스는 제1 카메라가 등가 카메라 좌표계에서의 회전 매트릭스를 나타내며, 나아가 이 두 개의 매트릭스 에 따라 제1 회전 매트릭스(제1 회전 매트릭스는 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타 냄)를 얻을 수 있다. 단계, 마크 포인트의 3차원 좌표 정보를 획득하고 제2 카메라가 수집한 영상에 근거하여 제2 카메라가 수 집한 영상에서의 마크 포인트의 2차원 좌표 정보를 결정하고; 마크 포인트의 3차원 좌표 정보 및 제2 카메라가 수집한 영상에서의 마크 포인트의 2차원 좌표 정보에 대해 솔루션 처리를 진행하여 제2 회전 매트릭스를 획득한 다. 제2 회전 매트릭스는 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타낸다. 예시적으로, 제2 회전 매트릭스를 획득할 경우(제2 회전 매트릭스는 제2 카메라의 세계 좌표계에서의 회전 매트 릭스를 나타냄), 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식을 통해 마크 포인트의 3차원 좌표 정보를 얻을 수 있고; 그 다음, 제2 카메라가 수집한 영상을 통해 상기 영상에서의 마킹 포인트의 2차원 좌표 정보를 결정할 수 있으며; 마킹 포인트의 3차원 좌표 정보, 마킹 포인트의 2차원 좌표 정보에 근거하여 pnp솔루션 처리를 진행 함으로써 제2 회전 매트릭스를 획득할 수 있는데, 여기서, 제2 회전 매트릭스는 제2 카메라의 세계 좌표계에서 의 회전 매트릭스를 나타낸다. 이때, 비록 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식에 따라 제2 회전 매트릭스(제2 회전 매트릭스는 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)를 얻을 수 있으나, 제2 회전 매트릭스(제2 회전 매트릭스 는 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)에 따라 제3 회전 매트릭스(제3 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)를 얻음에 있어서, 제1 카메라에 대하여, 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식을 사용하여 제3 회전 매트릭스(제3 회전 매트릭스는 제1 카메라의 세계 좌표 계에서의 회전 매트릭스를 나타냄)를 얻을 필요가 없으므로 일정한 정도에서 원가와 시간을 절약할 수 있다. 단계, 제1 회전 매트릭스와 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭 스를 나타내는 제3 회전 매트릭스를 생성한다. 예시적으로, 제1 회전 매트릭스(A)와 제2 회전 매트릭스(B)에 대해 매트릭스 곱셈 처리를 진행하여, 제1 카메라 의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스 R_fisheye=A*B를 획득할 수 있다. 단계, 제3 회전 매트릭스에 따라 제1 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환 시켜 제1 카메라가 수집한 영상을 생성하는 3차원 감지 정보를 생성한다. 예시적으로, 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성할 경우, 제3 회전 매트릭스가 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내고, 제1 카메라가 수집한 영상에서의 감지 정보가 2차원 감지 정보이 므로 제3 회전 매트릭스에 따라 제1 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 제 1 카메라가 수집한 영상의 3차원 감지 정보를 생성할 수 있다. 나아가 신속하고 정확하게 제1 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 단계, 제2 회전 매트릭스에 근거하여 제2 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성한다. 하나의 예시에서, 제1 카메라가 수집한 영상의 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진 행하기 위한 것이다. 제2 카메라가 수집한 영상의 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진행하기 위한 것이다. 하나의 예시에서, 제2 회전 매트릭스는 제2 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이고, 제3 회전 매트릭스는 제1 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이다. 예시적으로, 상기 과정에서 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 더 획득하고, 제2 카메라가 수집한 영상에서의 감지 정보가 2차원 감지 정보이므로 제2 회전 매트릭스에 근거하여 제2 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성할 수 있다. 나아가 신속하고 정확하게 제2 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 본 실시예는 정확하고 신속하게 제1 카메라가 수집한 영상의 3차원 감지 정보, 제2 카메라가 수집한 영상의 3차 원 감지 정보를 생성할 수 있다. 여기서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라 이거나; 또는 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이다. 획득한 각 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진행하기 위한 것이다. 하나의 예시에서, 자율 주행 차량은 자율 주행을 진행하는 과정에서 3차원 감지 정보에 따라 자율 주행 과정에서의 3차 원 감지 포지셔닝을 진행해야 하는 바; 본 실시예를 통해 어안 카메라의 3차원 감지 정보, 레어 뷰 건 타입 카 메라의 3차원 감지 정보 및 프론트 뷰 건 타입 카메라의 3차원 감지 정보를 획득할 수 있으며, 나아가 자율 주 행 차량은 이러한 3차원 감지 정보를 획득한 다음 자율 주행 차량은 이러한 3차원 감지 정보에 따라 3차원 감지 포지셔닝을 완성하여 자율 주행 차량의 자동 주행에 편리하도록 할 수 있다. 3차원 감지 포지셔닝을 진행할 경우, 자율 주행 차량은 동시에 도로측 카메라가 세계 좌표계에서의 회전 매트릭 스와 평행이동 매트릭스에 따라 3차원 감지 포지셔닝을 완성할 수 있다. 하나의 예시에서, RTK 기기로 각 도로 측 카메라(프론트 뷰 건 타입 카메라, 레어 뷰 건 타입 카메라 및 어안 카메라)를 도팅하여 각 도로측 카메라의 세계 좌표계에서의 평행이동 파라미터 매트릭스를 획득하는데, 여기서, 평행이동 파라미터 매트릭스가 나타내는 것은 도로측 카메라의 세계 좌표계에서의 위치(즉, 평행이동)이고; 그 다음, 본 실시예의 상기 과정을 통해 각 도로측 카메라의 세계 좌표계에서의 회전 매트릭스(제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 포함한다. 여기서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이거나; 또는 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이다)를 획득하고, 나아가 각 도로측 카메라가 세계 좌표계 에서의 회전 매트릭스에 따라 각 도로측 카메라가 수집한 영상의 3차원 감지 정보를 획득하며; 그 다음 자율 주 행 차량은 각 도로측 카메라의 세계 좌표계에서의 평행이동 파라미터 매트릭스, 각 도로측 카메라가 수집한 영 상의 3차원 감지 정보에 근거하여 3차원 감지 포지셔닝을 진행할 수 있다. 이 외에, 본 실시예는 제2 회전 매트릭스(제2 회전 매트릭스는 제2 카메라의 세계 좌표계에서의 회전 매트릭스 를 나타냄), 제3 회전 매트릭스(제3 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타 냄)를 더 획득하는데; 제2 회전 매트릭스를 이용하여 제2 카메라의 파라미터에 대해 캘리브레이션을 진행하고 제3 회전 매트릭스를 이용하여 제1 카메라의 파라미터에 대해 캘리브레이션을 진행할 수 있다. 이로써 도로측 카메라의 파라미터(즉, 외부 파라미터)를 보정한다. 하나의 예시에서, 외력 요소인 바람 진동 등으로 인해 도로측 카메라에 약간의 회전이 발생하여 도로측 카메라 의 외부 파라미터를 다시 캘리브레이션 해야 하는데; 우선, “영상 안정화 알고리즘” 또는 \"영상 매칭 검출 알 고리즘”을 통해 위치 이동이 발생한 도로측 카메라, 위치 이동이 발생하지 않은 도로측 카메라를 검출할 수 있 고; 나아가 위치 이동이 발생하지 않은 도로측 카메라의 외부 파라미터에 따라 위치 이동이 발생한 도로측 카메 라의 외부 파라미터를 획득하며; 그 다음, 위치 이동이 발생한 도로측 카메라의 세계 좌표계에서의 회전 매트릭 스에 따라 위치 이동이 발생한 도로측 카메라의 외부 파라미터를 캘리브레이션 할 수 있다. 예를 들어, 제1 카 메라가 어안 카메라이고, 어안 카메라에 위치 이동이 발생하였다고 결정하면 제3 회전 매트릭스(제3 회전 매트 릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)에 근거하여 어안 카메라의 외부 파라미터를 캘리브레이션 할 수 있다. 본 실시예의 이상의 과정에 의하면, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이며; 나아가, 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있다. 이로써 레어 뷰 건 타입 카메라가 수집한 영상의 3차원 감지 정보, 어안 카메라가 수집한 영상의 3차원 감지 정보를 획득한다. 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이며; 나아가, 프론트 뷰 건 타입 카메라 의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있다. 이로써 프론트 뷰 건 타입 카메라가 수집한 영상의 3차 원 감지 정보, 어안 카메라가 수집한 영상의 3차원 감지 정보를 획득한다. 알 수 있다 시피, 본 실시예의 과정을 통해 어안 카메라가 수집한 영상의 3차원 감지 정보, 레어 뷰 건 타입 카 메라가 수집한 영상의 3차원 감지 정보, 프론트 뷰 건 타입 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 나아가 자율 주행의 3차원 감지 포지셔닝 또는 도로측 카메라에 대해 외부 파라미터의 캘리브레이션을 진 행하는데 응용될 수 있다. 본 실시예에서는, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍에 따라 제 4 회전 매트릭스를 생성(제4 회전 매트릭스는 제2 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타 냄)하고; 제4 회전 매트릭스와 제5 회전 매트릭스(제5 회전 매트릭스는 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타냄)에 근거하여 제1 회전 매트릭스를 생성(제1 회전 매트릭스는 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타냄)하며; 그 다음, 제1 회전 매트릭스는 제1 카메라의 제2 카메라 좌표계에 서의 회전 매트릭스를 나타내고, 제2 회전 매트릭스는 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내 므로, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 획득함으로써; 제1 카메 라의 세계 좌표계에서의 회전 매트릭스를 획득하고, 그 다음 제3 회전 매트릭스에 근거하여 제1 카메라가 수집 한 영상에서의 2차원 감지 정보를 생성하여 3차원 감지 정보로 전환시키고; 또한 제2 회전 매트릭스에 근거하여 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성할 수 있다. 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이거나; 또는 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이 다. 나아가 각 도로측 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식을 사용하여 3차원 감지 정보를 얻을 필요가 없으므로 원가를 절감하고 효율을 향상시켜 사 람들의 안전을 확보한다. 어안 카메라가 수집한 영상의 3차원 감지 정보, 레어 뷰 건 타입 카메라가 수집한 영 상의 3차원 감지 정보, 프론트 뷰 건 타입 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 나아가, 자율 주행의 3차원 감지 포지셔닝 또는 도로측 카메라에 대해 외부 파라미터의 캘리브레이션을 진행하는데 응용 될 수 있다. 도 5는 본 출원의 제3 실시예에 따른 도면이고, 도 5에 도시된 바와 같이, 본 실시예에서 제공하는 도로측 카메 라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법은 아래와 같은 단계를 포함한다. 단계, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하고 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭 스를 생성한다. 단계, 제2 카메라가 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하고, 제1 회 전 매트릭스와 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 생성한다. 단계, 제3 회전 매트릭스에 근거하여 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성한다. 예시적으로, 본 실시예에서의 도로측 카메라는 제1 카메라, 제2 카메라 및 제3 카메라를 포함하되, 여기서, 제1 카메라와 제2 카메라 사이에는 공동 가시 영역이 구비되고, 제1 카메라와 제3 카메라 사이에는 공동 가시 영역 이 구비된다. 하나의 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이며 제3 카메라는 프론트 뷰 건 타입 카메라이거나; 또는 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타 입 카메라이며 제3 카메라는 레어 뷰 건 타입 카메라이다. 본 실시예의 실행주체는 전자기기 일 수 있고, 여기서, 전자기기는 단말기 또는 서버 또는 기타 본 실시예의 방 법을 수행할 수 있는 장치 또는 기기 일 수 있다. 단계-단계를 수행함에 있어서, 제2 회전 매트릭스(제2 회전 매트릭스는 제2 카메라의 세계 좌표계에 서의 회전 매트릭스를 나타냄)에 따라 제3 회전 매트릭스(제3 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)를 얻을 수 있는데; 이 과정은 상기 임의의 실시예를 참조할 수 있으므로 여기서 더 이 상 설명하지 않는다. 단계, 제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상 사이의 제2 매칭 포인트 쌍을 획득하고 제2 매칭 포인트 쌍에 근거하여, 제3 카메라의 제1 카메라 좌표계에서의 회전 매트릭스를 나타내는 제6 회전 매트릭 스를 생성한다.예시적으로, 단계 다음에, 제1 카메라와 제3 카메라가 공동 가시 영역을 구비하므로 공동 가시 영역에 대 하여, 제1 카메라가 수집한 영상에서의 상기 공동 가시 영역과 제3 카메라가 수집한 영상에서의 상기 공동 가시 영역 사이의 제2 매칭 포인트 쌍을 생성할 수 있는데; 제2 매칭 포인트 쌍은 N쌍의 영상 포인트를 포함하고 각 영상 포인트는 제1 카메라와 대응되는 왜곡 제거 영상에서의 하나의 영상 포인트, 제3 카메라와 대응되는 왜곡 제거 영상에서의 하나의 영상 포인트를 포함하며, N은 1보다 크거나 같은 자연수이다. 여기서, 제2 매칭 포인트 쌍에서의 각 영상 포인트는 모두 2차원 영상 포인트이다. 다음, 에피폴라 기하 알고리즘으로 제2 매칭 포인트 쌍을 처리하여, 제3 카메라의 제1 카메라 좌표계에서의 회 전 매트릭스를 나타내는 제6 회전 매트릭스를 얻을 수 있다. 단계, 제3 회전 매트릭스와 제6 회전 매트릭스에 근거하여, 제3 카메라의 세계 좌표계에서의 회전 매트릭 스를 나타내는 제7 회전 매트릭스를 생성한다. 예시적으로, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 이미 생성하였으 므로 제3 회전 매트릭스와 제6 회전 매트릭스에 대해 매트릭스 곱셈 처리를 진행하여, 제3 카메라의 세계 좌표 계에서의 회전 매트릭스를 나타내는 제7 회전 매트릭스를 얻을 수 있다. 단계, 제7 회전 매트릭스에 근거하여 제3 카메라가 수집한 영상의 3차원 감지 정보를 생성한다. 예시적으로, 제3 카메라가 수집한 영상에 2차원 감지 정보가 포함되고 제7 회전 매트릭스가 제3 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내므로 제7 회전 매트릭스에 근거하여 제3 카메라가 수집한 영상에서의 2차 원 감지 정보를 생성하여 세계 좌표계로 전환시킴으로써 제3 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 여기서, 2차원 감지 정보란 2차원 영상에서의 물체의 픽셀 좌표를 가리킨다. 하나의 예시에서, 2차원 감지 정보 는 영상에서의 물체의 2차원 감지 정보 일 수 있고, 여기서 물체는 자동차, 비동력 차량, 보행자 및 차선 등을 포함하나 이에 한정되지 않는다. 하나의 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이며 제3 카메라는 프론 트 뷰 건 타입 카메라이고; 나아가, 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있 으며, 그 다음 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)에 근거하여 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제7 회전 매트릭스)를 획득할 수 있다. 다른 한 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이며 제3 카메라는 레 어 뷰 건 타입 카메라이고; 나아가, 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회 전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있으며, 그 다음 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)에 근거하여 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제7 회전 매트릭스)를 획득할 수 있다. 본 실시예에서는, 제3 회전 매트릭스(제3 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나 타냄)를 획득한 후, 제3 회전 매트릭스와 제6 회전 매트릭스(제6 회전 매트릭스는 제3 카메라의 제1 카메라 좌 표계에서의 회전 매트릭스를 나타냄)에 근거하여 제3 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제 7 회전 매트릭스를 획득할 수 있다. 이로써 제2 회전 매트릭스(제2 회전 매트릭스는 제2 카메라의 세계 좌표계 에서의 회전 매트릭스를 나타냄)에 따라 순차적으로 제3 회전 매트릭스(제3 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄), 제7 회전 매트릭스(제7 회전 매트릭스는 제3 카메라의 세계 좌표계에서 의 회전 매트릭스를 나타냄)를 획득할 수 있다. 이로써 도로측 카메라의 세계 좌표계에서의 회전 매트릭스에 따 라 기타 두 개의 도로측 카메라의 세계 좌표계에서의 회전 매트릭스를 획득한다. 다음, 각 도로측 카메라가 수 집한 영상의 3차원 감지 정보를 획득한다. 각 도로측 카메라에 대해 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식을 사용하여 도로측 카메라가 세계 좌표계에서의 회전 매트릭스를 획득할 필요가 없으므로 효과적이고 신속 하게 각 도로측 카메라의 세계 좌표계에서의 회전 매트릭스를 획득하여 각 도로측 카메라가 수집한 영상의 3차 원 감지 정보를 획득하는데 용이하도록 한다. 도 6은 본 출원의 제4 실시예에 따른 도면이고, 도 6에 도시된 바와 같이, 본 실시예에서 제공하는 도로측 카메 라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법은 아래와 같은 단계를 포함한다. 단계, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하고 제1 매칭 포인트 쌍에 근거하여, 제1 카메라가 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭 스를 생성한다. 단계, 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하고, 제1 회 전 매트릭스와 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제3 회전 매트릭스를 생성한다. 단계, 제3 회전 매트릭스에 근거하여 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성한다. 하나의 예시에서, 제1 카메라가 어안 카메라이고 제2 카메라가 레어 뷰 건 타입 카메라이면 제3 카메라는 프론 트 뷰 건 타입 카메라이며, 제1 카메라가 어안 카메라이고 제2 카메라가 프론트 뷰 건 타입 카메라이면 제3 카 메라는 레어 뷰 건 타입 카메라이다. 예시적으로, 본 실시예에서 도로측 카메라는 제1 카메라, 제2 카메라 및 제3 카메라를 포함하되, 여기서, 제1 카메라와 제2 카메라 사이에는 공동 가시 영역이 구비되고, 제1 카메라와 제3 카메라 사이에는 공동 가시 영역 (제1 카메라와 제2 카메라 사이의 공동 가시 영역, 제1 카메라와 제3 카메라 사이의 공동 가시 영역은 상이하다)이 구비된다. 하나의 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라 이며 제3 카메라는 프론트 뷰 건 타입 카메라이거나; 또는 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이며 제3 카메라는 레어 뷰 건 타입 카메라이다. 본 실시예의 실행주체는 전자기기 일 수 있고, 여기서, 전자기기는 단말기 또는 서버 또는 기타 본 실시예의 방 법을 수행할 수 있는 장치 또는 기기 일 수 있다. 단계-단계를 수행함에 있어서, 제2 회전 매트릭스(제2 회전 매트릭스는 제2 카메라의 세계 좌표계에 서의 회전 매트릭스를 나타냄)에 따라 제3 회전 매트릭스(제3 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)를 획득할 수 있는데; 이 과정은 상기 임의의 실시예를 참조할 수 있으므로 여기서 더 이상 설명하지 않는다. 단계, 제1 카메라가 수집한 영상에 근거하여 제1 왜곡 제거 영상을 생성하고 제3 카메라가 수집한 영상에 근거하여 제3 왜곡 제거 영상을 생성하되, 여기서, 제1 왜곡 제거 영상과 제3 왜곡 제거 영상은 공동 가시 영역 에 위치한 영상 영역을 각각 구비한다. 하나의 예시에서, 단계에서의 \"제3 카메라가 수집한 영상에 근거하여 제3 왜곡 제거 영상을 생성\"하는 것 은, 왜곡 제거 함수로 제3 카메라가 수집한 영상을 조절하여 제3 왜곡 제거 영상을 획득하는 것을 포함한다. 예시적으로, 제1 카메라와 제3 카메라 사이에는 공동 가시 영역이 구비된다. 상기 실시예에서 이미 제1 왜곡 제 거 영상을 획득하였으므로 제3 카메라가 수집한 영상에 근거하여 제3 왜곡 제거 영상을 생성해야 한다. 하나의 예시에서, 제1 카메라와 제3 카메라가 공동 가시 영역을 구비하므로 제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상은 공동 가시 영역(즉, 동일한 영역에 대하여 모두 상기 영역의 영상을 촬영)을 구비하고, 이로써 제1 왜곡 제거 영상과 제3 왜곡 제거 영상은 공동 가시 영역에 위치한 영상 영역을 각각 구비한다. 제3 카메라가 수집한 영상도 일정한 왜곡 문제가 존재하는 바; 제3 카메라가 수집한 영상을 조절하여 제3 카메 라의 제3 왜곡 제거 영상을 얻을 수 있다. 하나의 예시에서, opencv에서의 왜곡 제거 함수를 이용하여 제3 카메 라가 수집한 영상을 조절함으로써 제3 왜곡 제거 영상을 획득할 수 있다. 예를 들어 설명하면, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이며 제3 카메라는 프 론트 뷰 건 타입 카메라이고; opencv의 왜곡 제거 함수를 사용하여 프론트 뷰 건 타입 카메라가 수집한 영상에 대해 왜곡 제거 처리를 진행함으로써 레어 뷰 건 타입 카메라의 제3 왜곡 제거 영상을 얻을 수 있다. 이상의 방식을 통해 제3 카메라가 수집한 영상을 조절하여 제3 왜곡 제거 영상을 획득함으로써 제2 매칭 포인트 쌍을 획득하기 편리하도록 할 수 있다. 단계, 제1 왜곡 제거 영상에서 공동 가시 영역에 위치한 영상 영역의 제1 영상 특징을 추출하고 제3 왜곡 제거 영상에서 공동 가시 영역에 위치한 영상 영역의 제3 영상 특징을 추출한다. 예시적으로, 제1 왜곡 제거 영상과 제3 왜곡 제거 영상이 동일한 공동 가시 영역에서의 영상 영역을 구비하므로, 공동 가시 영역에 대하여, 제1 왜곡 제거 영상의 제1 영상 특징을 추출하고 제3 왜곡 제거 영상의 제3 영상 특징을 추출한다. 여기서, 제1 영상 특징은 예를 들어 SIFT특징, ORB특징이고; 제3 영상 특징은 예를 들어 각도SIFT특징, ORB특징이다.단계, 제1 영상 특징과 제3 영상 특징에 기반하여 제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상 사이의 제2 매칭 포인트 쌍을 결정한다. 하나의 예시에서, 단계는, 제1 영상 특징과 제3 영상 특징에 기반하여 제1 왜곡 제거 영상과 제3 왜곡 제 거 영상에 대해 특징 매칭을 진행함으로써 제2 매칭 포인트 쌍을 획득하는 단계를 포함한다. 예시적으로, 제1 영상 특징과 제3 영상 특징에 기반하여 제1 왜곡 제거 영상에서의 공동 가시 영역의 영상, 제3 왜곡 제거 영상에서의 공동 가시 영역의 영상에 대해 특징 매칭 처리를 진행함으로써 제2 매칭 포인트 쌍을 획 득한다. 제2 매칭 포인트 쌍은 N쌍의 영상 포인트를 포함하고 각 쌍의 영상 포인트는 제1 카메라와 대응되는 제 1 왜곡 제거 영상에서의 하나의 영상 포인트, 제3 카메라와 대응되는 제3 왜곡 제거 영상에서의 하나의 영상 포 인트를 포함하며, N은 1보다 크거나 같은 자연수이다. 여기서, 제2 매칭 포인트 쌍에서의 각 영상 포인트는 모 두 2차원 영상 포인트이다. 제1 카메라와 제3 카메라가 공동 가시 영역을 구비하고 제1 왜곡 제거 영상에 상기 공동 가시 영역에서의 영상 이 구비되며 제3 왜곡 제거 영상에 상기 공동 가시 영역에서의 영상이 구비되므로 공동 가시 영역에 대하여, 제 1 왜곡 제거 영상에서의 공동 가시 영역의 영상, 제3 왜곡 제거 영상에서의 공동 가시 영역의 영상에 대해 특징 매칭 처리를 진행함으로써 획득한 제2 매칭 포인트 쌍에서의 각 쌍의 영상 포인트는 공동 가시 영역에 대한 것으로서 사후 회전 매트릭스의 분석을 진행하는데 용이하다. 단계, 제2 매칭 포인트 쌍에 근거하여, 제3 카메라의 제1 카메라 좌표계에서의 회전 매트릭스를 나타내는 제6 회전 매트릭스를 생성한다. 하나의 예시에서, 단계는 구체적으로, 제2 매칭 포인트 쌍에 근거하여, 제3 카메라의 등가 카메라 좌표계 에서의 회전 매트릭스를 나타내는 제8 회전 매트릭스를 생성하는 단계; 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭스를 획득하고, 제5 회전 매트릭스와 제8 회전 매트릭스에 근거하여 제6 회전 매트릭스를 생성하는 단계를 포함한다. 예시적으로, 에피폴라 기하 알고리즘으로 제2 매칭 포인트 쌍을 처리하여 제3 카메라의 등가 카메라 좌표계에서 의 회전 매트릭스를 나타내는 제8 회전 매트릭스(M)를 얻는다. 상기 실시예의 단계를 이용하여, 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭스(R)를 획득한다. 다음, 제5 회전 매트릭스(R)와 제8 회전 매트릭스(M)를 이용하여 제6 회전 매트 릭스 P=R*M-1을 생성한다. 상기 과정에서, 제8 회전 매트릭스는 제3 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내고 제5 회 전 매트릭스는 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내며, 나아가 이 두 개의 매트릭스 에 따라 제6 회전 매트릭스(제6 회전 매트릭스는 제3 카메라의 제1 카메라 좌표계에서의 회전 매트릭스를 나타 냄)를 얻을 수 있다. 단계, 제3 회전 매트릭스와 제6 회전 매트릭스에 근거하여, 제3 카메라의 세계 좌표계에서의 회전 매트릭 스를 나타내는 제7 회전 매트릭스를 생성한다. 예시적으로, 단계에서 이미 제3 회전 매트릭스를 획득하였으므로 제3 회전 매트릭스(K)와 제6 회전 매트릭 스(P)에 대해 매트릭스 곱셈 처리를 진행하여, 제3 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제7 회전 매트릭스 Q=K*P를 획득할 수 있다. 단계, 제7 회전 매트릭스에 근거하여 제3 카메라가 수집한 영상의 3차원 감지 정보를 생성한다. 하나의 예시에서, 제3 카메라가 수집한 영상의 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진 행하기 위한 것이다. 제7 회전 매트릭스는 제3 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이다. 예시적으로, 제3 카메라가 수집한 영상의 3차원 감지 정보를 생성할 경우, 제7 회전 매트릭스가 제3 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내고 제3 카메라가 수집한 영상에서의 감지 정보가 2차원 감지 정보이 므로, 제7 회전 매트릭스에 따라 제3 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 제3 카메라가 수집한 영상의 3차원 감지 정보를 생성할 수 있다. 나아가 신속하고 정확하게 제3 카메라가 수집 한 영상의 3차원 감지 정보를 얻을 수 있다.하나의 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이며 제3 카메라는 프론 트 뷰 건 타입 카메라이고; 나아가 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있 으며, 그 다음 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)에 근거하여 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제7 회전 매트릭스)를 얻을 수 있다. 다른 한 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이며 제3 카메라는 레 어 뷰 건 타입 카메라이고; 나아가 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있 으며, 그 다음 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)에 근거하여 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제7 회전 매트릭스)를 얻을 수 있다. 획득한 각 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진행하는데 사용된다. 하나의 예시에서, 자율 주행 차량은 자율 주행을 진행하는 과정에서 3차원 감지 정보에 따라 자율 주행 과정에서의 3차원 감지 포 지셔닝을 진행해야 하는데; 본 실시예를 통해 어안 카메라의 3차원 감지 정보, 레어 뷰 건 타입 카메라의 3차원 감지 정보 및 프론트 뷰 건 타입 카메라의 3차원 감지 정보를 얻을 수 있고, 나아가 자율 주행 차량은 이러한 3 차원 감지 정보를 획득할 수 있으며, 그 다음 자율 주행 차량은 이러한 3차원 감지 정보에 따라 3차원 감지 포 지셔닝을 완성하여 자율 주행 차량의 자율 주행에 용이하다. 이 외에, 본 실시예는 제7 회전 매트릭스(제7 회전 매트릭스는 제3 카메라의 세계 좌표계에서의 회전 매트릭스 를 나타냄)를 더 획득하는데; 제7 회전 매트릭스를 이용하여 제3 카메라의 파라미터에 대해 캘리브레이션을 진 행함으로써 도로측 카메라의 파라미터(즉, 외부 파라미터)를 보정할 수 있다. 하나의 예시에서, 외력 요소인 바람 진동 등으로 인해 도로측 카메라에 약간의 회전이 발생하여 도로측 카메라 의 외부 파라미터를 다시 캘리브레이션 해야 하는데; 우선, “영상 안정화 알고리즘” 또는 \"영상 매칭 검출 알 고리즘”을 통해 위치 이동이 발생한 도로측 카메라, 위치 이동이 발생하지 않은 도로측 카메라를 검출할 수 있 고; 나아가 위치 이동이 발생하지 않은 도로측 카메라의 외부 파라미터에 따라 위치 이동이 발생한 도로측 카메 라의 외부 파라미터를 획득하며; 그 다음, 위치 이동이 발생한 도로측 카메라가 세계 좌표계에서의 회전 매트릭 스에 따라 위치 이동이 발생한 도로측 카메라의 외부 파라미터를 캘리브레이션 할 수 있다. 예를 들어, 제3 카 메라가 프론트 뷰 건 타입 카메라 좌표계이고, 프론트 뷰 건 타입 카메라 좌표계에 위치 이동이 발생하였다고 결정하면 제7 회전 매트릭스(제7 회전 매트릭스는 제3 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)에 근거하여 프론트 뷰 건 타입 카메라 좌표계의 외부 파라미터를 캘리브레이션 할 수 있다. 본 실시예에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이며 제3 카메라는 프론트 뷰 건 타입 카메라이면; 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있으며, 그 다 음 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)에 근거하여 프론트 뷰 건 타입 카 메라의 세계 좌표계에서의 회전 매트릭스(즉, 제7 회전 매트릭스)를 얻을 수 있다. 제1 카메라는 어안 카메라이 고 제2 카메라는 프론트 뷰 건 타입 카메라이며 제3 카메라는 레어 뷰 건 타입 카메라이면; 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제2 회전 매트릭스)에 근거하여 어안 카메라의 세계 좌표계에서 의 회전 매트릭스(즉, 제3 회전 매트릭스)를 획득할 수 있으며, 그 다음 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제3 회전 매트릭스)에 근거하여 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제7 회전 매트릭스)를 얻을 수 있다. 이로써 각 도로측 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있 다. 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식을 이용하여 3차원 감지 정보를 얻을 필요가 없어 원가를 절 감하고 효율을 향상시켜 사람들의 안전을 확보한다. 어안 카메라가 수집한 영상의 3차원 감지 정보, 레어 뷰 건 타입 카메라가 수집한 영상의 3차원 감지 정보, 프론트 뷰 건 타입 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 나아가 자율 주행의 3차원 감지 포지셔닝 또는 도로측 카메라의 외부 파라미터에 대해 진행하는 캘리브레이션에 응용할 수 있다. 도 7은 본 출원의 제5 실시예에 따른 도면이고, 도 7에 도시된 바와 같이, 본 실시예에서 제공하는 도로측 카메 라의 외부 파라미터에 기반한 3차원 감지 정보 획득 방법은 아래와 같은 단계를 포함한다. 단계, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제3 매칭 포인트 쌍을 획득하고 제3 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매트릭스를 생성한다. 예시적으로, 본 실시예의 실행주체는 전자기기 일 수 있고, 여기서, 전자기기는 단말기 또는 서버 또는 기타 본 실시예의 방법을 수행할 수 있는 장치 또는 기기 일 수 있다. 본 실시예에서 제공하는 단계-단계는 제1 실시예 또는 제2 실시예의 기초상에 수행될 수도 있고 단독 으로 수행될 수도 있다. 단계-단계에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라 또는 프론트 뷰 건 타입 카메라이다. 제1 카메라와 제2 카메라가 공동 가시 영역을 구비하므로 공동 가시 영역에 대하여 제1 카메라가 수집한 영상에 서의 상기 공동 가시 영역과 제2 카메라가 수집한 영상에서의 상기 공동 가시 영역 사이의 제3 매칭 포인트 쌍 을 생성할 수 있으며; 제3 매칭 포인트 쌍은 N쌍의 영상 포인트를 포함하고 각 쌍의 영상 포인트는 제1 카메라 와 대응되는 왜곡 제거 영상에서의 하나의 영상 포인트, 제2 카메라와 대응되는 왜곡 제거 영상에서의 하나의 영상 포인트를 포함하며 N은 1보다 크거나 같은 자연수이다. 여기서, 제3 매칭 포인트 쌍에서의 각 영상 포인트 는 모두 2차원 영상 포인트이다. 다음, 에피폴라 기하 알고리즘을 사용하여 제3 매칭 포인트 쌍을 처리함으로써 제1 카메라의 제2 카메라 좌표계 에서의 회전 매트릭스를 나타내는 제1 회전 매트릭스를 얻는다. 하나의 예시에서, 제1 카메라가 수집한 영상에 근거하여 제1 왜곡 제거 영상을 생성하고 제2 카메라가 수집한 영상에 근거하여, 제2 왜곡 제거 영상을 생성하되, 여기서, 제1 왜곡 제거 영상과 제2 왜곡 제거 영상은 공동 가시 영역에 위치한 영상 영역을 각각 구비할 수 있다. 다음, 제1 왜곡 제거 영상에서 공동 가시 영역에 위치한 영상 영역의 제1 영상 특징을 추출하고 제2 왜곡 제거 영상에서 공동 가시 영역에 위치한 영상 영역의 제2 영상 특징을 추출한다. 제1 영상 특징과 제2 영상 특징에 기반하여 제1 왜곡 제거 영상의 공동 가시 영역에서의 영상, 제2 왜곡 제거 영상의 공동 가시 영역에서의 영상에 대해 특징 매칭 처리를 진행하여 제3 매칭 포인트 쌍 을 얻는다. 본 실시예에서, 제3 매칭 포인트 쌍은 상기 제1 매칭 포인트 쌍과 동일할 수 있다. 다음, 제3 매칭 포인트 쌍에 근거하여, 제2 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제4 회전 매트릭스를 생성한다. 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭 스를 획득한다. 제4 회전 매트릭스와 제5 회전 매트릭스에 근거하여, 제1 회전 매트릭스를 생성한다. 이 과정은 상기 실시예에서의 단계를 참조할 수 있는 바, 더 이상 설명하지 않는다. 단계, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제9 회전 매트릭스를 획득한다. 하나의 예시에서, 단계는, 마크 포인트의 3차원 좌표 정보를 획득하고 제1 카메라가 수집한 영상에 근거하 여 제1 카메라가 수집한 영상에서의 마크 포인트의 2차원 좌표 정보를 결정하는 단계; 마크 포인트의 3차원 좌 표 정보 및 제1 카메라가 수집한 영상에서의 마크 포인트의 2차원 좌표 정보에 대해 솔루션 처리를 진행하여 제 9 회전 매트릭스를 획득하는 단계를 포함한다. 예시적으로, 고정밀 지도 또는 RTK 기기 도팅 방식을 통해 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나 타내는 제9 회전 매트릭스를 획득할 수 있다. 하나의 예시에서, 제9 회전 매트릭스를 획득할 경우(제9 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄), 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식을 통해 마크 포인트의 3차원 좌표 정보를 얻을 수 있고; 그 다음, 제1 카메라가 수집한 영상을 통해 상기 영상에서의 마킹 포인트의 2차원 좌표 정보를 결정할 수 있으며; 마킹 포인트의 3차원 좌표 정보, 제1 카메라가 수집한 영상에서의 마크 포인트의 2차원 좌표 정보에 근거하여 pnp솔루션 처리를 진행함으로써 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제 9 회전 매트릭스를 획득할 수 있다. 이때, 비록 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식에 따라 제9 회전 매트릭스(제9 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)를 얻으나, 제9 회전 매트릭스(제9 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)에 따라 제10 회전 매트릭스(제10 회전 매트릭스는 제2 카 메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)를 얻으므로 제2 카메라에 있어서, 고정밀 지도 또는 인위적 인 RTK 기기 도팅 방식으로 제10 회전 매트릭스(제10 회전 매트릭스는 제2 카메라의 세계 좌표계에서의 회전 매 트릭스를 나타냄)를 얻을 필요가 없어 원가와 시간을 어느 정도 절약하게 된다.단계, 제1 회전 매트릭스와 제9 회전 매트릭스에 근거하여, 제2 카메라의 세계 좌표계에서의 회전 매트릭 스를 나타내는 제10 회전 매트릭스를 생성한다. 예시적으로, 제1 회전 매트릭스와 제9 회전 매트릭스에 대해 매트릭스 곱셈 처리를 진행하여 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제10 회전 매트릭스를 얻는다. 단계, 제9 회전 매트릭스에 근거하여 제1 카메라의 3차원 감지 정보를 생성하고 제10 회전 매트릭스에 근 거하여 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성한다. 하나의 예시에서, 제9 회전 매트릭스는 제1 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이고 제 10 회전 매트릭스는 제2 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이다. 예시적으로, 제9 회전 매트릭스가 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내고, 제1 카메라가 수 집한 영상에서의 감지 정보는 2차원 감지 정보이므로 제9 회전 매트릭스에 따라 제1 카메라가 수집한 영상에서 의 2차원 감지 정보를 세계 좌표계로 전환시켜 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성할 수 있다. 나아가 신속하고 정확하게 제1 카메라가 수집한 영상의 3차원 감지 정보를 얻는다. 또한, 제10 회전 매트릭스가 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내고 제2 카메라가 수집한 영상에서의 감지 정보가 2차원 감지 정보이므로 제10 회전 매트릭스에 따라 제2 카메라가 수집한 영상에서의 2 차원 감지 정보를 세계 좌표계로 전환시켜 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성할 수 있다. 나 아가 신속하고 정확하게 제2 카메라가 수집한 영상의 3차원 감지 정보를 얻는다. 각 3차원 감지 정보는 자율 주 행 차량에 사용되어 3차원 감지 포지셔닝을 진행할 수 있다. 또한, 본 실시예는 제9 회전 매트릭스(제9 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)와 제10 회전 매트릭스(제10 회전 매트릭스는 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타 냄)를 더 얻을 수 있는 바, 제9 회전 매트릭스를 이용하여 제1 카메라의 파라미터에 대해 캘리브레이션을 진행 할 수 있고, 제10 회전 매트릭스를 이용하여 제2 카메라의 파라미터에 대해 캘리브레이션을 진행할 수 있다. 이 로써 도로측 카메라의 파라미터(즉, 외부 파라미터)를 보정한다. 본 실시예의 이상의 과정을 통해, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이면; 어 안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제9 회전 매트릭스)에 근거하여 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제10 회전 매트릭스)를 얻을 수 있다. 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이면; 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제9 회전 매트릭 스)에 근거하여 프론트 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제10 회전 매트릭스)를 얻을 수 있다. 본 실시예에서는, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제3 매칭 포인트 쌍에 따라 제 1 회전 매트릭스를 생성(제1 회전 매트릭스는 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타냄) 하고; 제1 회전 매트릭스와 제9 회전 매트릭스(제9 회전 매트릭스는 제1 카메라의 세계 좌표계에서의 회전 매트 릭스를 나타냄)에 따라 제10 회전 매트릭스를 생성(제10 회전 매트릭스는 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타냄)한다. 이로써 제9 회전 매트릭스에 근거하여 제1 카메라의 3차원 감지 정보를 생성하고 제10 회전 매트릭스에 근거하여 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성한다. 제1 카메라는 어안 카메라 이고 제2 카메라는 레어 뷰 건 타입 카메라이면; 어안 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제9 회전 매트릭스)에 근거하여 레어 뷰 건 타입 카메라의 세계 좌표계에서의 회전 매트릭스(즉, 제10 회전 매트릭스)를 얻을 수 있다. 제1 카메라는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이며; 나아가 어안 카메라 의 세계 좌표계에서의 회전 매트릭스(즉, 제9 회전 매트릭스)에 근거하여 프론트 뷰 건 타입 카메라의 세계 좌 표계에서의 회전 매트릭스(즉, 제10 회전 매트릭스)를 얻을 수 있다. 나아가 각 도로측 카메라가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 고정밀 지도 또는 인위적인 RTK 기기 도팅 방식을 사용하여 3차원 감지 정보 를 얻을 필요가 없으므로 원가를 절감하고 효율을 향상시켜 사람들의 안전을 확보한다. 어안 카메라가 수집한 영상의 3차원 감지 정보, 레어 뷰 건 타입 카메라가 수집한 영상의 3차원 감지 정보, 프론트 뷰 건 타입 카메라 가 수집한 영상의 3차원 감지 정보를 얻을 수 있다. 나아가 자율 주행의 3차원 감지 포지셔닝 또는 도로측 카메 라의 외부 파라미터에 대한 캘리브레이션에 응용될 수 있다. 도 8은 본 출원의 제6 실시예에 따른 도면이고, 도 8에 도시된 바와 같이, 본 실시예는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 장치를 제공하는 바, 도로측 카메라는 제1 카메라와 제2 카메라 를 포함하고, 제1 카메라와 제2 카메라 사이에는 공동 가시 영역이 구비되며, 상기 장치는,제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하는 제1 획득 유닛 ; 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매 트릭스를 생성하는 제1 생성 유닛; 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하는 제2 획득 유닛; 제1 회전 매트릭스와 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내 는 제3 회전 매트릭스를 생성하는 제2 생성 유닛; 제3 회전 매트릭스에 근거하여 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 제3 생성 유닛을 포함한다. 본 실시예의 장치는 상기 방법에서의 기술적 해결수단을 수행할 수 있는 바, 이의 구체적인 구현과정과 기술적 원리는 동일하므로 여기서 더 이상 설명하지 않는다. 도 9는 본 출원의 제7 실시예에 따른 도면이고, 도 9에 도시된 바와 같이, 본 실시예는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 장치를 제공하는 바, 도로측 카메라는 제1 카메라와 제2 카메라 를 포함하고, 제1 카메라와 제2 카메라 사이에는 공동 가시 영역이 구비되며, 상기 장치는, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하는 제1 획득 유닛 ; 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매 트릭스를 생성하는 제1 생성 유닛; 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하는 제2 획득 유닛; 제1 회전 매트릭스와 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내 는 제3 회전 매트릭스를 생성하는 제2 생성 유닛; 제3 회전 매트릭스에 근거하여 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 제3 생성 유닛을 포함한다. 하나의 예시에서, 제1 획득 유닛은, 제1 카메라가 수집한 영상에 근거하여 제1 왜곡 제거 영상을 생성하고 제2 카메라가 수집한 영상에 근거하여, 제2 왜곡 제거 영상을 생성하되, 여기서, 제1 왜곡 제거 영상과 제2 왜곡 제거 영상은 공동 가시 영역에 위치한 영상 영역을 각각 구비하는 제1 생성 모듈; 제1 왜곡 제거 영상에서 공동 가시 영역에 위치한 영상 영역의 제1 영상 특징을 추출하고 제2 왜곡 제거 영상에 서 공동 가시 영역에 위치한 영상 영역의 제2 영상 특징을 추출하는 제1 추출 모듈; 제1 영상 특징과 제2 영상 특징에 기반하여 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 결정하는 제1 결정 모듈을 포함한다. 하나의 예시에서, 제1 결정 모듈은 구체적으로, 제1 영상 특징과 제2 영상 특징에 기반하여 제1 왜곡 제 거 영상과 제2 왜곡 제거 영상에 대해 특징 매칭을 진행하여 제1 매칭 포인트 쌍을 획득한다. 하나의 예시에서, 제1 생성 모듈은, 제1 카메라가 수집한 영상을 구면에 투영시켜 구면 영상을 획득하고; 구면 영상에 대해 왜곡 제거 처리를 진행 하여 제1 왜곡 제거 영상을 획득하는 투영 서브 모듈; 왜곡 제거 함수로 제2 카메라가 수집한 영상을 조절하여 제2 왜곡 제거 영상을 획득하는 조절 서브 모듈(9011 2)을 포함한다. 하나의 예시에서, 제1 생성 유닛은, 제1 매칭 포인트 쌍에 근거하여, 제2 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제4 회전 매트릭스를 생성하는 제2 생성 모듈;제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭스를 획득하는 제1 획득 모 듈; 제4 회전 매트릭스와 제5 회전 매트릭스에 근거하여, 제1 회전 매트릭스를 생성하는 제2 생성 모듈을 포 함한다. 하나의 예시에서, 제1 획득 모듈은 구체적으로, 기설정 부앙각과 편주각에 따라 제1 카메라가 수집한 영 상이 위치한 제1 카메라 좌표계를 변환시켜 제5 회전 매트릭스를 획득한다. 하나의 예시에서, 제2 획득 유닛은, 마크 포인트의 3차원 좌표 정보를 획득하고 제2 카메라가 수집한 영상에 근거하여 제2 카메라가 수집한 영상에 서의 마크 포인트의 2차원 좌표 정보를 결정하는 제2 결정 모듈; 마크 포인트의 3차원 좌표 정보 및 제2 카메라가 수집한 영상에서의 마크 포인트의 2차원 좌표 정보에 대해 솔 루션 처리를 진행하여 제2 회전 매트릭스를 획득하는 제1 솔루션 모듈을 포함한다. 하나의 예시에서, 제3 생성 유닛은 구체적으로, 제3 회전 매트릭스에 따라 제1 카메라가 수집한 영상에서 의 2차원 감지 정보를 세계 좌표계로 전환시켜 제1 카메라가 수집한 영상을 생성하는 3차원 감지 정보를 생성한 다. 하나의 예시에서, 본 실시예에서 제공하는 장치는, 제2 회전 매트릭스에 근거하여 제2 카메라가 수집한 영상에서의 2차원 감지 정보를 세계 좌표계로 전환시켜 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 제4 생성 유닛을 더 포함한다. 하나의 예시에서, 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진행하는데 사용된다. 하나의 예시에서, 제2 회전 매트릭스는 제2 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이고 제 3 회전 매트릭스는 제1 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이다. 하나의 예시에서, 제1 카메라는 어안 카메라이고 제2 카메라는 레어 뷰 건 타입 카메라이거나; 또는 제1 카메라 는 어안 카메라이고 제2 카메라는 프론트 뷰 건 타입 카메라이다. 본 실시예의 장치는 상기 방법에서의 기술적 해결수단을 수행할 수 있는 바, 이의 구체적인 구현과정과 기술적 원리는 동일하므로 여기서 더 이상 설명하지 않는다. 도 10은 본 출원의 제8 실시예에 따른 도면이고, 도 10에 도시된 바와 같이, 본 실시예는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 장치를 제공하는 바, 도로측 카메라는 제1 카메라와 제2 카메라 를 포함하고, 제1 카메라와 제2 카메라 사이에는 공동 가시 영역이 구비되며, 상기 장치는, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제1 매칭 포인트 쌍을 획득하는 제1 획득 유닛 ; 제1 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매 트릭스를 생성하는 제1 생성 유닛; 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제2 회전 매트릭스를 획득하는 제2 획득 유닛 ; 제1 회전 매트릭스와 제2 회전 매트릭스에 근거하여, 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내 는 제3 회전 매트릭스를 생성하는 제2 생성 유닛; 제3 회전 매트릭스에 근거하여 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 제3 생성 유닛을 포함한다. 하나의 예시에서, 도로측 카메라는 제3 카메라를 더 포함하고 제1 카메라와 제3 카메라 사이에는 공동 가시 영 역이 구비되며; 본 실시예에서 제공하는 장치는, 제3 생성 유닛은 제3 회전 매트릭스에 근거하여 제1 카메라가 수집한 영상의 3차원 감지 정보를 생성한 다음에, 제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상 사이의 제2 매칭 포인트 쌍을 획득하는 제3 획득 유닛 ;제2 매칭 포인트 쌍에 근거하여, 제3 카메라의 제1 카메라 좌표계에서의 회전 매트릭스를 나타내는 제6 회전 매 트릭스를 생성하는 제4 생성 유닛; 제3 회전 매트릭스와 제6 회전 매트릭스에 근거하여, 제3 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내 는 제7 회전 매트릭스를 생성하는 제5 생성 유닛; 제7 회전 매트릭스에 근거하여 제3 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 제6 생성 유닛을 더 포함한다. 하나의 예시에서, 제3 획득 유닛은, 제1 카메라가 수집한 영상에 근거하여 제1 왜곡 제거 영상을 생성하고 제3 카메라가 수집한 영상에 근거하여 제 3 왜곡 제거 영상을 생성하되, 여기서, 제1 왜곡 제거 영상과 제3 왜곡 제거 영상은 공동 가시 영역에 위치한 영상 영역을 각각 구비하는 제3 생성 모듈; 제1 왜곡 제거 영상에서 공동 가시 영역에 위치한 영상 영역의 제1 영상 특징을 추출하고 제3 왜곡 제거 영상에 서 공동 가시 영역에 위치한 영상 영역의 제3 영상 특징을 추출하는 제2 추출 모듈; 제1 영상 특징과 제3 영상 특징에 기반하여 제1 카메라가 수집한 영상과 제3 카메라가 수집한 영상 사이의 제2 매칭 포인트 쌍을 결정하는 제3 결정 모듈을 포함한다. 하나의 예시에서, 제3 결정 모듈은 구체적으로, 제1 영상 특징과 제3 영상 특징에 기반하여 제1 왜곡 제거 영상 과 제3 왜곡 제거 영상에 대해 특징 매칭을 진행함으로써 제2 매칭 포인트 쌍을 획득한다. 하나의 예시에서, 제3 생성 모듈은 제3 카메라가 수집한 영상에 근거하여 제3 왜곡 제거 영상을 생성할 경우, 구체적으로, 왜곡 제거 함수로 제3 카메라가 수집한 영상을 조절하여 제3 왜곡 제거 영상을 획득한다. 하나의 예시에서, 제5 생성 유닛은, 제2 매칭 포인트 쌍에 근거하여, 제3 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제8 회전 매트릭스를 생성하는 제4 생성 모듈; 제1 카메라의 등가 카메라 좌표계에서의 회전 매트릭스를 나타내는 제5 회전 매트릭스를 획득하는 제2 획득 모 듈; 제5 회전 매트릭스와 제8 회전 매트릭스에 근거하여 제6 회전 매트릭스를 생성하는 제5 생성 모듈을 포함한다. 하나의 예시에서, 제1 카메라가 어안 카메라이고 제2 카메라가 레어 뷰 건 타입 카메라이면 제3 카메라는 프론 트 뷰 건 타입 카메라이며, 제1 카메라가 어안 카메라이고 제2 카메라가 프론트 뷰 건 타입 카메라이면 제3 카 메라는 레어 뷰 건 타입 카메라이다. 하나의 예시에서, 제3 카메라가 수집한 영상의 3차원 감지 정보는 자율 주행 차량의 3차원 감지 포지셔닝을 진 행하기 위한 것이고; 제7 회전 매트릭스는 제3 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이다. 본 실시예의 장치는 상기 방법에서의 기술적 해결수단을 수행할 수 있는 바, 이의 구체적인 구현과정과 기술적 원리는 동일하므로 여기서 더 이상 설명하지 않는다. 도 11은 본 출원의 제9 실시예에 따른 도면이고, 도 11에 도시된 바와 같이, 본 실시예는 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보 획득 장치를 제공하는 바, 도로측 카메라는 제1 카메라와 제2 카메라 를 포함하고, 제1 카메라와 제2 카메라 사이에는 공동 가시 영역이 구비되며, 상기 장치는 아래와 같은 구성을 포함한다. 우선, 본 실시예에서 제공하는 장치는 도 8 또는 도 9에서의 각 유닛과 모듈을 포함할 수도 있고 도 8 또 는 도 9의 각 유닛과 모듈을 포함하지 않을 수도 있다(도 8 또는 도 9의 각 유닛과 모듈은 도 11에 도시되지 않 음). 상기 장치는, 제1 카메라가 수집한 영상과 제2 카메라가 수집한 영상 사이의 제3 매칭 포인트 쌍을 획득하는 제4 획득 유닛 ;제3 매칭 포인트 쌍에 근거하여, 제1 카메라의 제2 카메라 좌표계에서의 회전 매트릭스를 나타내는 제1 회전 매 트릭스를 생성하는 제7 생성 유닛; 제1 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내는 제9 회전 매트릭스를 획득하는 제5 획득 유닛 ; 제1 회전 매트릭스와 제9 회전 매트릭스에 근거하여, 제2 카메라의 세계 좌표계에서의 회전 매트릭스를 나타내 는 제10 회전 매트릭스를 생성하는 제8 생성 유닛 제9 회전 매트릭스에 근거하여 제1 카메라의 3차원 감지 정보를 생성하고 제10 회전 매트릭스에 근거하여 제2 카메라가 수집한 영상의 3차원 감지 정보를 생성하는 제9 생성 유닛을 포함한다. 하나의 예시에서, 제5 획득 유닛은, 마크 포인트의 3차원 좌표 정보를 획득하고 제1 카메라가 수집한 영상에 근거하여 제1 카메라가 수집한 영상에 서의 마크 포인트의 2차원 좌표 정보를 결정하는 제4 결정 모듈; 마크 포인트의 3차원 좌표 정보 및 제1 카메라가 수집한 영상에서의 마크 포인트의 2차원 좌표 정보에 대해 솔 루션 처리를 진행하여 제9 회전 매트릭스를 획득하는 제2 솔루션 모듈을 포함한다. 하나의 예시에서, 제9 회전 매트릭스는 제1 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이고 제 10 회전 매트릭스는 제2 카메라의 파라미터에 대해 캘리브레이션을 진행하기 위한 것이다. 본 실시예의 장치는 상기 방법에서의 기술적 해결수단을 수행할 수 있는 바, 이의 구체적인 구현과정과 기술적 원리는 동일하므로 여기서 더 이상 설명하지 않는다. 본 출원의 실시예에 따르면, 본 출원은 전자기기와 판독 가능 저장매체를 더 제공한다. 본 출원의 실시예에 따르면, 본 출원은 또한 컴퓨터 판독 가능 저장매체에 저장된 컴퓨터 프로그램을 제공하며, 상기 컴퓨터 프로그램 중의 명령이 프로세서에 의해 실행될 때, 상기 임의의 한 실시예에서 제공하는 방법을 구 현한다. 본 출원의 실시예에 따르면, 본 출원은 컴퓨터 프로그램을 포함하는 컴퓨터 프로그램 제품을 더 제공하는데, 컴 퓨터 프로그램은 판독 가능 저장 매체에 저장되고, 전자기기의 적어도 하나의 프로세서는 판독 가능 저장 매체 로부터 컴퓨터 프로그램을 판독할 수 있으며, 적어도 하나의 프로세서는 컴퓨터 프로그램을 실행하여 전자기기 로 하여금 상기 임의의 한 실시예에서 제공하는 방안을 수행하도록 한다. 도 12는 본 출원의 실시예에서 예시한 전자기기를 실시할 수 있는 예시적인 블록도를 도시한다. 전자기기 는 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크 벤치, 개인용 정보 단말기, 서버, 블레이드 서버, 메인 프레임 컴퓨터 및 다른 적합한 컴퓨터 등의 다양한 형태의 디지털 컴퓨터를 가리킨다. 전자기기는 또한 개인용 정보 단말기, 셀룰러 폰, 스마트 폰, 웨어러블 장치 및 다른 유사한 컴퓨팅 장치와 같은 다양한 형태의 모바일 장치를 나타낼 수 있다. 본 명세서에 도시된 구성 요소, 그들의 연결 및 관계 및 그 기능은 단지 예시에 불과하며, 본 명세서 에 기술되거나 및/또는 요구된 본 개시의 구현을 한정하고자 하는 것이 아니다. 도 12에 도시된 바와 같이, 전자기기는 컴퓨팅 유닛을 포함할 수 있는데 이는 읽기 전용 메모리 (ROM)에 저장된 컴퓨터 프로그램 또는 저장 유닛으로부터 랜덤 액세스 메모리(RAM)에 로딩된 컴퓨터 프로그램에 근거하여 여러 가지 적당한 동작과 처리를 수행할 수 있다. RAM에는 기기의 동 작에 필요한 여러 가지 프로그램과 데이터가 더 저장될 수 있다. 컴퓨팅 유닛, ROM 및 RAM은 버스를 통해 서로 연결된다. 입력/출력(I/O) 인터페이스도 버스에 연결된다. 기기에서의 키보드, 마우스 등과 같은 입력 유닛; 여러 가지 유형의 디스플레이, 스피커 등과 같 은 출력 유닛; 자기 디스크, 시디 롬 등과 같은 저장 유닛; 및 네트워크 카드, 모뎀, 무선 통신 트 랜시버와 같은 통신 유닛을 포함하는 다수의 부품은 I/O인터페이스에 연결된다. 통신 유닛은 기기로 하여금 인터넷과 같은 컴퓨터 네트워크 및/또는 여러 가지 전신 네트워크를 통해 기타 기기와 정 보/데이터를 교환하도록 허용한다. 컴퓨팅 유닛은 처리 및 컴퓨팅 능력을 가지는 여러 가지 범용 및/또는 전용 처리 모듈 일 수 있다. 컴퓨 팅 유닛의 일부 예시는 중앙 처리 유닛(CPU), 그래픽스 처리 유닛(GPU), 여러 가지 전용 인공 지능(AI) 컴퓨팅 칩, 여러 가지 기계 학습 모델 알고리즘을 운행하는 컴퓨팅 유닛, 디지털 신호 프로세서(DSP) 및 임의의적당한 프로세서, 제어기, 마이크로 제어기 등을 포함하나 이에 한정되지 않는다. 컴퓨팅 유닛은 상기에 서 설명한 각 방법과 처리, 예를 들어 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보의 획득을 수행 한다. 예를 들어, 일부 실시예에서, 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보의 획득은 컴퓨터 소프트웨어 프로그램으로 구현될 수 있고, 이는 저장 유닛과 같은 기계 판독 가능 매체에 유형적으로 포 함될 수 있다. 일부 실시예에서, 컴퓨터 프로그램의 일부 또는 전부는 ROM 및/또는 통신 유닛을 거 쳐 기기에 로딩되거나 및/또는 장착될 수 있다. 컴퓨터 프로그램이 RAM에 로딩되어 컴퓨팅 유닛 에 의해 실행될 경우, 상기 내용에서 설명한 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보의 획득에서의 하나 또는 다수의 단계를 수행할 수 있다. 대안적으로, 기타 실시예에서, 컴퓨팅 유닛은 기타 임의의 적당한 방식(예를 들어, 펌웨어)에 의해 도로측 카메라의 외부 파라미터에 기반한 3차원 감지 정보의 획 득을 수행하도록 배치될 수 있다. 본 명세서에서 설명한 시스템과 기술적인 내용의 여러 가지 실시형태는 디지털 전자회로 시스템, 집적 회로 시 스템, 필드 프로그램 가능 게이트 어레이(FPGA), 전용 집적 회로(ASIC), 특정 용도 표준 제품(ASSP), 시스템 온 칩 시스템(SOC), 복합 프로그래머블 논리 소자(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조 합에서 구현될 수 있다. 이러한 여러 가지 실시형태는, 하나 또는 다수의 컴퓨터 프로그램에서 실시되되, 상기 하나 또는 다수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서의 프로그램 가능 시스템에서 실행 및/또는 해석될 수 있고, 상기 프로그램 가능 프로세서는 전용 또는 범용 프로그램 가능 프로세서로서, 저장 시 스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터와 명령을 수신할 수 있고 데이터와 명령을 상기 저장 시스템, 상기 적어도 하나의 입력 장치 및 상기 적어도 하나의 출력 장치에 전송하는 방식을 포함할 수 있다. 본 개시의 방법을 실시하기 위한 프로그램 코드는 하나 또는 다수의 프로그래밍 언어의 임의의 조합을 이용하여 프로그래밍 할 수 있다. 이러한 프로그램 코드는 범용 컴퓨터, 전용 컴퓨터 또는 기타 프로그래밍 가능 데이터 처리 장치의 프로세서 또는 제어기에 제공되어 프로그램 코드가 프로세서 또는 제어기에 의해 실행될 때 흐름도 및/또는 블록도에서 규정한 기능/동작이 실시되도록 할 수 있다. 프로그램 코드는 완전히 기계에서 실행될 수도 있고 일부가 기계에서 실행될 수도 있으며, 독립적인 소프트웨어 패키지로서 일부가 기계에서 실행되는 동시에 일부가 원격 기계에서 실행되거나 또는 전부가 원격 기계 또는 서버에서 실행될 수 있다. 본 개시의 상하문에서, 기계 판독 가능 매체는 유형적인 매체일 수 있는 바, 이는 명령 실행 시스템, 장치 또는 기기에 제공되어 사용하거나 또는 명령 실행 시스템, 장치 또는 기기와 결합하여 사용하는 프로그램을 포함하거 나 저장할 수 있다, 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 저장 매체 일 수 있 다. 기계 판독 가능 매체는 전자, 자기, 광학, 전자기, 적외선 또는 반도체 시스템, 장치 또는 기기, 또는 상기 내용의 임의의 적합한 조합일 수 있다. 기계 판독 가능 저장 매체의 더 구체적인 예는 하나 또는 다수의 라인의 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 랜덤 액세스 메모리(RAM), 읽기 전용 메모리(ROM), 소거 및 프 로그램 가능 읽기 전용 메모리 (EPROM 또는 플래시 메모리), 광섬유, 휴대용 콤팩트 디스크 읽기 전용 메모리 (CD-ROM), 광학 저장 기기, 자기 저장 기기 또는 상기 내용의 임의의 적합한 조합을 포함한다. 사용자와의 인터랙션을 제공하기 위해, 여기에 설명된 시스템 및 기술을 컴퓨터에서 구현할 수 있는데, 상기 컴 퓨터는 사용자에게 정보를 표시하기 위한 디스플레이 장치(예를 들어, CRT(음극선관) 또는 LCD(액정 디스플레이) 모니터)와 키보드 및 포인팅 장치(예를 들어, 마우스 또는 트랙 볼)를 구비하고, 사용자는 상기 키 보드 및 상기 포인팅 장치를 통해 정보를 입력하여 컴퓨터에 제공할 수 있다. 다른 종류의 장치를 사용하여 사 용자와의 인터랙션을 제공할 수도 있는 바, 예를 들어, 사용자에게 제공되는 피드백은 임의의 형태의 감각 피드 백(예를 들어, 시각적 피드백, 청각 피드백 또는 촉각 피드백) 일 수 있고, 임의의 형태(소리 입력, 음성 입력 또는 촉각 입력 포함)로 사용자에 의해 발송된 정보를 수신할 수 있다. 여기에서 설명된 시스템 및 기술은 백 엔드 구성 요소(예를 들어, 데이터 서버)를 포함하는 컴퓨팅 시스템 또는 미들웨어 구성 요소(예를 들어, 애플리케이션 서버)를 포함하는 컴퓨팅 시스템 또는 프론트 엔드 구성 요소(예 를 들어, 예를 들어, 그래픽 사용자 인터페이스 또는 웹 브라우저를 구비한 사용자 컴퓨터일 수 있으며, 사용자 는 그래픽 사용자 인터페이스 또는 웹 브라우저를 통해 여기에 설명된 시스템 및 기술의 실시형태와 인터랙션 할 수 있음)를 포함하는 컴퓨팅 시스템 또는 이러한 백 엔드 구성 요소, 미들웨어 구성 요소 또는 프론트 엔드 구성 요소의 임의의 조합을 포함하는 컴퓨팅 시스템에 의해 구현될 수 있다. 시스템의 구성 요소는 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트워크)에 의해 상호 연결될 수 있다. 통신 네트워크의 예 로는 근거리 통신망(LAN), 광역 통신망(WAN) 및 인터넷이 포함될 수 있다.컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있 으며, 일반적으로 통신 네트워크를 통해 인터랙션 한다. 클라이언트와 서버 간의 관계는 해당 컴퓨터에서 실행 되고 서로 클라이언트-서버 관계가 있는 컴퓨터 프로그램에 의해 발생된다. 본 실시예는 상기 실시예에서 제공하는 전자기기를 포함하는 도로측 기기를 더 제공한다. 도로측 기기는 예를 들어 컴퓨팅 기능을 가지는 도로측 감지 기기, 도로측 감지 기기와 연결되는 도로측 컴퓨팅 기기이다. 지능형 교통 차량-도로 협업 시스템 구조에서, 도로측 기기는 도로측 감지 기기와 도로측 컴퓨팅 기기를 포함하 고, 도로측 감지 기기(예를 들어 도로측 카메라)는 도로측 컴퓨팅 기기(예를 들어 도로측 컴퓨팅 유닛(RSCU))에 연결되며, 도로측 컴퓨팅 기기는 서버 기기에 연결되고, 서버 기기는 여러 가지 방식을 통해 자율 주행 또는 보 조 운전 차량과 통신할 수 있으며; 다른 한가지 시스템 구조에서, 도로측 감지 기기 자체가 컴퓨팅 기능을 포함 하면 도로측 감지 기기는 상기 서버 기기에 직접 연결된다. 이상의 연결은 유선 또는 무선 일 수 있고; 본 출원 에서 서버 기기는 예를 들어 클라우드 제어 플랫폼, 차량-도로 협업 관리 플랫폼, 중앙 서브 시스템, 에지 컴퓨 팅 플랫폼, 클라우드 컴퓨팅 플랫폼 등이다. 본 실시예는 상기 실시예에서 제공하는 전자기기를 포함하는 클라우드 제어 플랫폼을 더 제공한다. 이해해야 할 것은, 이상에서 설명한 여러 가지 형태의 프로세스를 사용하고 단계를 다시 정렬, 증가 또는 삭제 할 수 있다. 예를 들면 본 출원에서 기재한 각 단계는 동시에 수행할 수도 있고 순차적으로 수행할 수도 있으며 상이한 순서로 수행할 수도 있는 바, 본 출원에서 개시한 기술적 해결수단에서 기대하는 결과를 실현할 수만 있 다면 본문에서는 이에 대해 한정하지 않는다."}
{"patent_id": "10-2021-0137767", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 구체적인 실시형태는 본 출원의 보호범위를 한정하지 않는다. 본 기술분야에서 통상의 지식을 가진 자들은 설계 요구와 기타 요소에 근거하여 여러 가지 수정, 조합, 하위 조합과 대체를 진행할 수 있다는 것을 이해할 수 있다. 본 출원의 정신과 원칙 내에서 진행한 그 어떤 수정, 균등한 대체와 개선은 모두 본 출원의 보호범위 내에 포함된다."}
{"patent_id": "10-2021-0137767", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 해결수단을 더 잘 이해하기 위한 것으로 본 출원에 대해 한정하는 것이 아니다. 여기서, 도 1은 어안 카메라가 촬영한 영상이다. 도 2는 본 출원의 제1 실시예에 따른 도면이다. 도 3은 본 출원의 제2 실시예에 따른 도면이다. 도 4는 본 출원의 실시예에서 제공하는 제1 왜곡 제거 영상의 도면이다. 도 5는 본 출원의 제3 실시예에 따른 도면이다. 도 6은 본 출원의 제4 실시예에 따른 도면이다. 도 7은 본 출원의 제5 실시예에 따른 도면이다. 도 8은 본 출원의 제6 실시예에 따른 도면이다. 도 9는 본 출원의 제7 실시예에 따른 도면이다. 도 10은 본 출원의 제8 실시예에 따른 도면이다. 도 11은 본 출원의 제9 실시예에 따른 도면이다. 도 12는 본 출원의 실시예의 예시적인 전자기기를 구현하기 위한 예시적인 블록도이다."}
