{"patent_id": "10-2011-0087535", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2013-0024226", "출원번호": "10-2011-0087535", "발명의 명칭": "다단식 제트배수 노즐을 구비한 절수형 변기의 세척수 분사장치", "출원인": "계림요업주식회사", "발명자": "유상정"}}
{"patent_id": "10-2011-0087535", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "급수관(10)으로부터 급수되는 세척수를 제트배수관(30)으로 공급받아 보울(50) 내부에 워터제트 형태로 분사하는 구조로 된 변기의 세척수 분사장치에 있어서,유입단이 상기 제트배수관(30)의 유출단에 연결되는 제트배수분배기(40); 및상기 제트배수분배관(31-1~n)의 유출단에 연결되는 적어도 두 개의 제트배수노즐(32-1~n);을 포함하여구성되고,상기 적어도 두 개의 제트배수분배관(31-1~n)의 관로 길이는 서로 다른 것을 특징으로 하는 세척수 분사장치."}
{"patent_id": "10-2011-0087535", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서 상기 세척수 분사장치는,유입단이 상기 제트배수분배기(40)의 유출단에 연결되는 적어도 두 개의 제트배수분배관(31-1~n); 를 더 포함하여 구성되고,상기 적어도 두 개의 제트배수노즐(32-1~n)의 설치위치는 서로 다른 것을 특징으로 하는 세척수 분사장치."}
{"patent_id": "10-2011-0087535", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 적어도 두 개의 제트배수분배관(31-1~n)의 평균 관로단면적 또는 상기 적어도 두 개의 제트배수노즐(32-1~n)의 노즐구경은 서로 다른 것을 특징으로 하는 세척수 분사장치."}
{"patent_id": "10-2011-0087535", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제트배수노즐(32-1~n)은 세 개 이상 설치되며, 서로 다른 위치에 설치되는 것을 특징으로 하는 특징으로하는 세척수 분사장치."}
{"patent_id": "10-2011-0087535", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 세 개 이상의 제트배수노즐(32-1~n)에서 각각의 제트분사각도는 오물배출관(51)의 관로형상에 맞게 사이펀유동체의 운동방향을 바꿀 수 있도록 설정되는 것을 특징으로 하는 세척수 분사장치."}
{"patent_id": "10-2011-0087535", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 기재된 세척수 분사장치가 탑재된 것을 특징으로 하는 변기."}
{"patent_id": "10-2011-0087535", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 제트배수분배기(40)와 상기 적어도 두 개의 제트배수분배관(31-1~n) 및 상기 적어도 두개의 제트배수노즐(32-1~n) 중 어느 하나 이상을 제어할 수 있는 작동스위치(60)를 외부에 배치한 것을 특징으로 하는 변기.명 세 서기 술 분 야본 발명은 고압 수도관에 직접 연결되어 짧은 시간 동안 소량의 세척수에 의해 작동하는 직수공급식 절수형 변 [0001]기에 관한 것으로써, 서로 다른 분사각도와 서로 다른 분사시점을 가지며 정해진 시점에 필요한 양 만큼의 세척수를 투입할 수 있는 다단식 제트분사노즐에 의해 최소량의 물로 효과적인 사이펀 현상을 일으킬 수 있도록 한공개특허 10-2013-0024226-2-세척수 최적 공급 기술에 관한 것이다.배 경 기 술자연배수식 변기는 수량이 풍부하지만 낮은 수두(Water head: 물이 갖는 에너지를 길이 또는 높이로 나타낸 [0002]것)를 갖는 탱크 저장수를 이용하여 오물이 트랩을 넘어갈 만한 충분한 양의 저속 세척수를 보울(Bowl: 변기 내부용기) 내부 전체에 공급하는 구조로 된 것으로써, 소음이 적고 물이 튀지 않는 쾌적한 세척감은 물론 자연스러운 사이펀(syphon/siphon) 현상에 의한 오물 배출감도 뛰어나다. 따라서 고압 수도수를 제트분사 시키는 강제배수식 변기보다 뛰어난 감성품질을 갖고 있으나 그만큼 요구되는 세척수량도 많다.자연배수식 변기와 대비되는 강제배수식 변기는 림(Rim)배수와 제트(Jet)배수를 따로 나누어 보울 내부에 필요 [0003]한 최소한의 세척수량만을 림배수구 쪽으로 보내고 나머지는 제트배수구 쪽에 할당하여 세척수의 운동에너지를오물배출관의 사이펀 유발에 최대한 활용하는 메커니즘을 갖고 있다. 이 방식은 수도배관의 고압에너지(위치에너지)를 운동에너지로 바꾸는 과정에서 물 소모량을 줄일 수 있기 때문에 현재로써는 세척수 절약을 위한 최선의 방법으로 인식되고 있으며, 구체적으로 림배수량 또는 제트배수량 대비 오물배출 성능을 증가시키기 위한 다양한 방법이 많은 이들에 의해 시도되고 있다.(문헌1)은 보울(bowl) 내부 세척수 배수구의 위치를 보울 수면 아래에 배치하여 보울 세척수의 유동에너지를 증 [0004]가시킨 것으로써 3개의 배수로 구조를 개념적으로 보여주고 있다. 여기에서 비록 최상단 배수로는 단지 중간단배수로가 막혔을 시에 작동되는 예비 배수로에 지나지 않으나, 핵심이 되는 중간단 배수로의 위치가 수면 아래여서 적어도 하나의 추가된 배수로가 보울 세척과 동시에 아래쪽 제트배수로가 담당하는 사이펀 현상유발에 도움을 주는 기술적 토대를 제공하고 있다.(문헌2)는 복수의 제트배수구를 오물도기 내부에 설치하고, 그 중 상부의 제트배수구에 벤츄리관 타입의 기포혼 [0005]합장치를 추가하여 일종의 원시적인 2단 제트배수를 추구한 것이다. 이 문헌에 따르면 비록 단순한 분기관 형태로 2갈래 제트배수로를 구성한다 하여도 사이펀 유동의 뒤쪽에 위치하는 상부의 기포혼합 제트배수는 전체 유량을 줄이는 효과가 있다고 주장하고 있다.(문헌3)은 제트배수구의 분사각도와 오물배출관의 구조를 의도적으로 설계하여, 제트배수에 의한 사이펀 유동체 [0006]가 오물배출관에 부딪혀 되돌아오는 현상을 최대한 방지하고 아울러 제트배수 유동체의 입사 각도도 개선한 것이다. 이에 따라 제트배수량을 최대한 아끼고자 할 때 만약에 발생할지도 모르는 사이펀 실패가 다소 줄어드는효과가 있다.한편 전기적 구동 메커니즘을 이용한 세척수 밸브 자동제어기술의 발달을 살펴보면, 다이어프램 개폐작용을 이 [0007]용한 전자제어식 필밸브(Fill valve), 높은 수압에서도 작동 가능한 솔레노이드 밸브, 그리고 빠른 작동속도와함께 고압수 취급에도 유효한 수밀능력을 발휘하는 전자제어식 삼방밸브 등 높은 수압의 세척수를 콘트롤할 수있는 세척수 제어기술은 현재 당 업계에서 강제배수 변기의 대표적인 배수제어 수단으로 그 활용폭을 급속도로넓혀가고 있다. 본 발명자의 선출원 발명이기도 한 (문헌4)와 (문헌5)는 강제배수식 변기에 직결구조로 연결되는 고압수를 효과적으로 제어할 수 있는 훌륭한 해결수단을 제시해 주고 있다.선행기술문헌특허문헌(특허문헌 0001) (문헌1) 일본공개특허 특개2001-279767 보울 내부 세척수 배수구의 위치를 보울 수면 아래에 [0008]배치하여 보울 세척수의 유동에너지를 증가시킨 3배수관식 변기. (특허문헌 0002) (문헌2) 일본공개특허 특개2004-270163 복수의 제트 토출구 중 어느 하나의 토출구에 기포혼합장치를 부가한 사이펀 제트식 변기. (특허문헌 0003) (문헌3) 일본공개특허 특개2011-058208 제트세척수가 도달하는 배수트랩의 관로 내면이 평탄한상승면으로 형성된 강제배수식 변기. (특허문헌 0004) (문헌4) 한국특허출원 10-2011-0004828 복수 필밸브의 개폐시점 조절을 이용한 절수형 변기의세척수 분배장치 및 분배방법.(본 발명자의 선출원 발명) (특허문헌 0005) (문헌5) 한국특허출원 10-2011-0004829 삼방밸브의 급수경로 전환에 의한 변기의 세척수 분배장치.(본 발명자의 선출원 발명) 공개특허 10-2013-0024226-3-발명의 내용해결하려는 과제절수형 변기의 일반적인 세척수 공급방식은 세척수를 보울 내부를 세척하는 림배수와, 사이펀 현상을 유도하여 [0009]오물을 배출관 너머로 밀어내는 제트배수로 나누어 분사하는 것이다. 이 과정에서 사이펀을 유도하는 데에 핵심이 되는 제트배수량은 줄이기 어려웠으므로 사이펀 발생 전후로 낭비되는 림배수량을 최대한 줄이는 방법이 종래 세척수 절약기술의 중심이 되어 왔다.그러나 더 이상 줄이기 어렵다는 제트배수량 또한, 반드시 필요한 양만큼 적절히 공급되어 왔던 것은 아니었으 [0010]며 실제로는 낭비되는 양이 많았다. 왜냐하면 고압수도관에 바로 연결되는 직수식 변기에서 세척수 절약을 목적으로 분사노즐의 구경(caliber/diameter)을 지나치게 좁힌 제트배수는 매우 빠른 고속수류인 탓에, 하나의 덩어리 유동체와 같이 이상적인 형태로 일어나야 할 사이펀을 유발하지 못하고 오물을 파고들어 관통하거나 또는 가늘고 빠른 유수체인 반 사이펀(half siphon; 관 내부를 완전히 채우지 못해 완벽한 진공압을 유발하지 못하는형태의 사이펀) 형태로 긴 시간에 걸쳐 오물배출관을 넘어가는 경우가 많았다.반대로 제트배수 분사노즐의 구경을 키우면, 지나치게 빠른 유수의 속도는 적절하게 떨어뜨릴 수 있으나 그 대 [0011]신 큰 구경의 노즐로 낭비되는 배수량이 증가한다.(어찌되었건 최소한의 사이펀 유발시간 동안 막대한 세척수를소모하는 제트배수는 지속되어야 하기 때문이다.) 따라서 단순히 노즐구경을 늘리거나 줄이는 것 만으로는 고압수도관에 저장된 물이 갖는 수두에너지를 효율적으로 이용하기 어려웠다.게다가 구불구불한 모양의 오물배출관은 고속 직선으로 분사되는 제트배수의 유동방향에 큰 저항으로 작용한다. [0012]이 또한 고압 수도관의 잠재 에너지를 효율적으로 이용하지 못하는 주된 요인이 된다.본 발명이 해결하려는 과제는 상술한 바와 같이 고압의 물이 갖는 수두에너지를 제트배수 형태로 유도할 때 어 [0013]느 한계치 이하로는 물을 절약할 수 없었던 종래 제트분사식 변기의 기술적 한계를 극복하는 것이며, 그에 따라짧은 시간의 분사에도 불구하고 전체 세척수 소모량의 대부분을 차지하는 제트배수 소모량을 의미 있을 정도로대폭 감소시키는, 다시 말해서 제트배수의 최적 분사유도에 관한 실질적이고 효과적인 기술수단을 제공하는 것이다.과제의 해결 수단상술한 과제를 해결하는 본 발명은 다음과 같은 주요 기술수단을 이용하여 유기적으로 구성된다. [0014]본 발명은 우선, 림배수용 노즐과는 별도로 제트배수용 노즐과 분배관을 적어도 두 개 이상 설치하여 오물을 순 [0015]차적으로 밀어내는 다단식 제트분사 구조를 채택하되 각 제트분사구 별로 위치와 분사각도, 그리고 노즐 구경을달리하고, 또한 필요에 따라 각 제트분사구에 연결된 제트배수분배관의 관로길이와 관로저항을 다르게 설정하여하나의 제트배수관에서 서로 다른 수두(에너지)를 갖는 여러 개의 제트배수가 구현되도록 하였다.보통의 변기는 하나의 관로로 제트배수관이 구성되며 본 발명에서도 제트배수를 분배하기 전의 제트배수관은 하 [0016]나이다. 이것은 상용화 가능한 변기에서 모든 제트배수는 기본적으로 동일한 수두(Hw = Height of water head)공급원에서 출발한다는 가정, 다시 말해 일반적인 건물에 설치된 보통의 변기는 하나의 (수도)공급관에서 한 종류의 고압수를 공급 받는다는 가정에서 얻어지는 결과이다. 본 발명 역시 하나의 공급관, 즉 동일한 수두에너지를 가진 세척수 공급원에서 최초 제트배수 공급이 시작되는 것을 전제로 하고 있다. 이에 따르면 특별한 의도적변화를 주지 않고서는 하나의 제트배수관에서 여러 방향으로 분사되건, 여러 개의 제트배수관에서 각각 하나의방향으로 분사되건 그에 따른 수두(에너지) 변화는 없다고 볼 수 있다. 따라서 본 발명에서는 분배되는 제트배수의 성질을 의도적으로 변화시키기 위해 다음의 세가지 변화를 제어변수로 삼아 각 제트배수 출구에서의 수두에너지를 제어하는 것을 주요 해결수단으로 하고 있다.세가지 변화란 먼저 제트배수관과 각 제트배수노즐 사이를 연결하는 제트배수분배관의 분배구조와 분배저항 변 [0017]화에 의한 1차 개별 수두에너지 변화, 다음으로 각 제트배수노즐의 토출각도와 토출위치에 따른 2차 개별 수두에너지 변화, 마지막으로 각 제트배수노즐의 단위시간당 토출량에 따른 최종 유속(벡터량)과 최종 유량(스칼라량)의 변화이다.위와 같은 제어변수 해결수단 중 최초 관로 설계에서부터 반영될 수 있는 것들 즉 구조적으로 고정된 확정적 구 [0018]공개특허 10-2013-0024226-4-성요소들이 있고, 또한 변기의 운전 중 지속적으로 개입되어야 할 것들 즉 밸브 개폐와 관련하여 인공적으로 제어 가능한 유동적 구성요소가 있다.본 발명에서는 앞서 설명한 고정된 구성요소 외에도 후자의 요소, 즉 유동적인 구성요소의 제어를 위하여 필요 [0019]에 따라 전기적으로 제어 가능한 제트배수분배기를 도입할 수 있다.물론 상기 제트배수분배기는 제어 방식이 아닌 유체역학적 설계를 통해 유동적 구성요소가 아닌 고정적 구성요 [0020]소로써 설계될 수도 있다. 고정적 설계요소로서의 제트배수분배기는 분배부의 부피와 형상, 분배관 연결부의 위치가 중요하며 유동적 설계요소로서의 제트배수분배기는 상기 배경기술에서 언급한 바와 같이 본 발명자의 선출원 발명인 문헌 4, 5로부터 적절히 응용 설계된 자동제어 밸브모듈이 탑재될 수 있다.한편, 제어 가능한 유동적 제트배수분배기를 탑재하는 조건에서 본 발명에서는 상술한 제어변수 해결수단을 구 [0021]체적으로 세척수 절약과 사이펀 효율향상에 활용하기 위한 고도화된 배수제어 방법을 제시한다. 이는 상기 제트배수분배기 및 필요에 따라 자동 제어되는 노즐 구경 조절장치와 노즐 위치 및 각도 조절장치를 제어하는 방법으로써, 실시간으로 변하는 운동량과 함께 의도하는 분사방향으로 토출되는 각각의 노즐 제트배수량을 유기적으로 결합하여 하나의 지능적인 사이펀 유동체를 구현할 수 있는 기술수단을 제시한다.발명의 효과본 발명에 따르면 오물배출관 내에서 관로저항이 최소화되고 그에 따라 유동에너지가 최대한 높은 수준으로 유 [0022]지되는 지능적인 사이펀 유동체가 구현된다. 따라서 동등한 세척수량으로 더 뛰어난 사이펀을 발생시키거나 또는 동등한 사이펀 성능에서 더 우수한 세척수 절수 능력을 발휘할 수 있다.또한 단위 배수량이 줄어들어 물 튐 현상이 감소하며, 변기 막힘 현상이 줄어드는 뛰어난 효과가 있다. [0023]추가로 본 발명은 제트배수의 오물관통현상이 감소하므로 보다 고속의 제트수류를 이용할 수 있다. 따라서 전체 [0024]제트배수 시간이 짧아지고 그만큼 남게 되는 시간을 초기-후기 림배수에 매우 여유 있게 할당할 수 있으며, 오물양이 많을 경우 지능적인 제트배수 패턴변화를 통해 수류에너지에 의존하지 않고 수압차에 의한 사이펀을 유발시킬 수도 있다.이러한 배수형태는 사용자로 하여금 마치 림배수 시간이 대부분인 것처럼 느껴지게 하며, 자연배수식 변기와 유 [0025]사한 배수패턴을 갖는 것처럼 느껴지게 하므로 고유의 물 절약 기능에 더해 우수한 세척감도 제공하여 주는 탁월한 효과가 있다.도면의 간단한 설명도 1은 본 발명 일 실시예 변기의 전체 측면도. [0026]도 2는 본 발명 일 실시예 세척수 분사장치의 측면도.도 3은 도 2의 세척수 분사장치 에서 각 노즐의 수두 차이를 나타낸 그림.도 4는 본 발명 추가 실시예 변기의 전체 측면도.도 5는 본 발명 추가 실시예 세척수 분사장치의 측면도.도 6은 도 5의 세척수 분사장치가 보울과 오물배출관에 장착된 그림.도 7은 도 5에서 제트배수 분배모듈을 따로 도시한 그림.도 8은 도 5의 세척수 분사장치에서 각 노즐의 수두 차이를 나타낸 그림.도 9는 본 발명 추가 실시예 제트배수분배기의 평면도.도 10은 도 8의 제트배수분배기의 작동패턴을 설명한 그림.도 11은 본 발명 추가 실시예에 따른 제트배수 분배단계 A-a를 설명한 그림.도 12는 본 발명 추가 실시예에 따른 제트배수 분배단계 A-b를 설명한 그림.도 13은 본 발명 추가 실시예에 따른 제트배수 분배단계 A-c를 설명한 그림.발명을 실시하기 위한 구체적인 내용공개특허 10-2013-0024226-5-상술한 본 발명의 과제 해결수단을 기술적으로 뒷받침하기 위하여 도면에 포함된 본 발명의 실시예들을 참조하 [0027]여 상세히 설명한다.다만 아래의 특정 실시예에서 특정 전문용어를 포함한 구성요소들과 이들의 결합구조가 본 발명에 포괄적으로 [0028]내재된 기술적 사상을 제한하는 것은 아니다.도 1 ~ 도 3에 도시한 본 발명의 일 실시예는 본 발명이 취할 수 있는 가장 간단한 형태를 나타낸 것이다. 기본 [0029]적으로 급수관(10)으로부터 급수되는 세척수를 제트배수관(30)으로 공급받아 보울(50) 내부에 워터제트 형태로분사하는 세척구조를 갖는 변기에서 고정식의 제트배수분배기(40)와 2개의 서로 다른 길이로 된 제트배수분배관(31-1 ~ 31-2)으로 구성된다. 본 실시예에서는 별도의 노즐이 없고 제트배수분배관의 출구가 노즐 역할을 하도록 단순화한 경우인데, 이때는 변기내부와 제트배수분배관을 연결하는 과정에서 고형제(시멘트 종류)로 성형하는 과정에서 분배관 고정구멍의 크기를 조절한다.도 1에서 급수관(11)에서부터 제트배수관(30)까지의 구성, 그리고 림배수 관련구성(20,21)은 통상의 선행기술을 [0030]따른다. 도면상에서는 림배수가 고리형 림을 따라 흘러내리는 방식으로 되어 있으나 필요에 따라 토네이도 방식의 회전수류 형태로도 설계 가능함은 물론이다.급수분배기(12)의 구성은 고속의 직동식 솔레노이드 밸브로 되어 있으나 이 또한 필요에 따라 생략하거나 다른 [0031]형태의 분배기로 대체될 수 있다.도 2는 도 1에서 본 발명의 핵심에 좀더 가까운 부분만을 이해하기 쉽게 따로 도시한 것이다. [0032]도면에서 제트배수분배기(40)의 유입단은 제트배수관(30)의 유출단에 연결되고 제트배수분배기(40)의 유출단(2 [0033]개)은 2갈래로 나뉜 제트배수분배관(31-1 ~ 31-2)에 연결된다.상기 제트배수분배관(31-1~2)들은 관로 길이와 평균 관로단면적이 다르게 설치되어 배출되는 제트배수의 운동에 [0034]너지를 의도적으로 조절한다. 이 과정에서 노즐각도/분배관로저항조절구(34)가 추가 설치될 수 있으며 본 실시예에서는 비닐튜브인 분배관로의 고정위치와 고정각도, 찝는 두께 등을 한꺼번에 조절할 수 있도록 부채꼴형 프레임에 2개의 조절나사를 갖춘 구조가 사용되었다.도 3의 제트배수분배기(40)와 분배기가 만들어내는 수두(Hw: Height of water)차이를 살펴보자. 아래쪽 제트배 [0035]수분배관(31-2)의 유출지점은 위쪽 제트배수분배관(31-1)의 유출지점보다 높은 수두, 즉 Hw-2+Hw-supplied를 갖는다. 따라서 가장 물살이 강할 것이다. 이는 가늘게 설정된 제브태부분배관(31-2)과 맞물려 가장 가느다랗고빠른 워터제트를 만들어낸다. 이것은 오물을 포함한 사이펀 유동체에 최대한 속도를 붙이기 위해 의도된것이다. 한편 보울에 가까운 분배관(31-1)은 상대적으로 느리고 굵은 워터제트를 만들어낸다.다음으로 분배된 제트배수의 유출시점을 살펴보자. 도시된 제트배수분배기는 돌출부(protrude)가 형성되어 [0036]있다. 이 돌출부는 제트배수경로의 유로길이를 길게 하는 역할을 한다. 즉 돌출부가 분배기의 위에 형성되어 있으면 위쪽 분배관(31-1)의 관로길이가 길어지고, 돌출부가 분배기의 아래쪽에 형성되어 있으면 아래쪽 분배관(31-2)의 관로길이가 길어진다. 또한 길어진 관로길이와 더불어 유동저항도 증가한다. 증가된 유동저항은 실질적인 수두(에너지)를 떨어뜨리는 역할을 한다.즉 도 3의 제트배수분배기(40)는 별도의 개폐기능이 없는 단순한 관로이음부재이면서도 연결된 제트배수분배관 [0037](31-1~n)의 관로길이를 변화시키는 역할을 하고 있으며, 변화된 관로길이는 최종 분사되는 제트배수의 분사시점과 운동량에 영향을 준다.도 4 ~ 도 13에서 제시하는 본 발명의 추가 실시예는 3개의 분배관과 노즐이 설치된 것이다. 물론 필요에 따라 [0038]노즐수와 분배관수는 1,2,3..n개로 확장될 수 있을 것이다.도 4는 본 실시예 변기의 전체 구조를 나타낸다. 제트배수 분배구조를 제외한 나머지 구조는 도 1과 같다. [0039]도 5는 도 4에서 본 발명의 핵심에 좀더 가까운 부분만을 이해하기 쉽게 따로 도시한 것이다. [0040]도면에서 제트배수분배기(40)의 유입단은 제트배수관(30)의 유출단에 연결되고 유출단(여기서는 3개)은 3갈래로 [0041]나뉜 제트배수분배관(31-1 ~ 31-3)에 연결된다.또한 상기 제트배수분배관(31-1 ~ 31-3)의 유출단에는 각각 제트배수노즐(32- 1 ~ 32-3)이 대응되어 [0042]연결된다.상기 제트배수분배관(31-1~n)들은 관로 길이와 평균 관로단면적이 다르게 설치되어 노즐을 통해 배출되는 제트 [0043]공개특허 10-2013-0024226-6-배수의 운동에너지를 의도적으로 조절한다. 역시 이 과정에서 노즐각도/분배관로저항조절구(34)가 추가 설치될수 있으며 본 추가 실시예에서도 비닐튜브인 분배관로의 고정위치와 고정각도, 찝는 두께 등을 한꺼번에 조절할수 있도록 부채꼴형 프레임에 2개의 조절나사를 갖춘 구조가 사용되었다. 참고로 마지막 제트배수노즐(32-3)의경우 조절구와 멀리 떨어져 있어 노즐각도의 조절이 어려우나 조절구의 나사를 풀어 분배관을 앞뒤로 강제 이동시키면 노즐의 각도는 어느 정도 조절이 가능하다. 이는 보울이나 오물배출관 내에 노즐이 결합될 때 고무패킹(도 6의 빨간색 부분)으로 고정 및 수밀이 이루어지므로 적당량의 분배관 압박으로 노즐이 움직일 수 있다는 근거에 의한다. 나머지 제트배수노즐들은 부채꼴형 프레임을 따라 분배관의 각도를 움직이면 노즐도 따라 움직일수 있도록 구성되어 있다. 이 모든 설정은 본 발명이 적용되는 변기의 크기와 구조, 그리고 본 발명 변기가 설치되는 곳의 수도환경에 따라 설치과정 또는 사용과정에서 미소 조절될 수 있다.도 6은 추가 실시예에서 나타날 수 있는 각 노즐의 워터제트 벡터량을 화살표의 길이와 굵기 그리고 방향으로 [0044]나타낸 것이다. 그림에서 직관적으로 떠오르는 워터제트의 벡터량은 노즐의 각도와 일치함은 물론 분배관의 굵기와 노즐의 위치와도 연관이 높음을 잘 알 수 있다. 가장 굵은 분배관 말단의 노즐은 유속이 느리고 유량이 크다. 따라서 짧고 굵은 파란 화살표로 표시되었다.화살표의 길이, 즉 유속은 노즐의 위치와 관련된다. 노즐이 낮게 위치할수록 수두차이는 크다. 다시 말해 더 고 [0045]압수가 분출된다. 화살표의 굵기, 즉 유량은 분배관의 굵기와 연관이 있다. 굵은 관에서 더 많은 물이 나온다.물론 상기 유속과 유량은 서로 반비례하는 함수관계를 갖고 있다. 그러나 본 발명에서는 공급수의 유량이 무한대이고, 공급수의 압력이 분배관의 길이에 비해 매우 크다는 가정을 할 수 있다. 따라서 대략 상기한 바와 같이노즐의 각도와 분배관의 굵기에만 관련된 것으로 근사화 시킬 수 있다. 이는 아래에 후술할 제트배수 분배방법의 기술적 토대가 된다.도 7, 도 8은 각 제트분사 모듈의 분사각, 수두차이, 관로저항을 종합적으로 나타낸 것이다. 각 노즐(32-1~3)의 [0046]뿌리 부분에는 간단히 나사식으로 돌려 조절할 수 있는 노즐구경 조절구(33)가 달려있다. 이는 제트분사의 퍼짐각도를 조절할 수 있거나 또는 분배관로 저항을 마지막으로 조절할 수 있는 장치이다.도 8의 수두(Hw: Height of water)차이를 살펴보자. 가장 아래쪽 노즐(32-2)이 가장 높은 수두, 즉 Hw-2+Hw- [0047]supplied를 갖는다. 따라서 가장 물살이 강할 것이다. 이는 가장 가늘게 설정된 분배관(31-2)와 맞물려 가장 가느다랗고 빠른 워터제트를 만들어낸다. 이것은 오물을 포함한 사이펀 유동체에 최대한 속도를 붙이기 위해 의도된 것이다. 한편 보울에 가장 가까운 위치인 노즐(32-1)과 분배관(31-1)은 가장 느리고 굵은 워터제트를 만들어낸다. 이것은 오물을 포함한 사이펀 유동체가 오물 관통현상 없이 서서히 힘을 받으면서 느리지만 확실하게 추진되기 위한 것이며, 오물 배출 이후 많은 유량으로 신속하게 보울 내에 물을 다시 채우기 위함이다. 그리고 가장 오물배출관 쪽에 가까운 위치인 노즐(32-3)과 분배관(31-3)은 그 중간형태의 워터제트를 만들어낸다. 이것은앞서와 달리 두 가지 역할을 한다. 하나는 사이펀 유동체의 마무리 유동단계에서 압력+속도를 부가하는 역할이고, 다른 하나는 진공압에 의한 강력한 사이펀을 발생시키기 위해서 오물배출관 후반부 관로에 미리 물을 채우는 역할이다. 전자는 후술하는 A-a 제트배수 분배단계의 마지막 단계에 해당하며, 후자는 후술하는 A-c 제트배수 분배단계의 처음 단계에 해당한다.위와 같이 본 발명에서 정의하는 적어도 두 개의 제트배수노즐(32-1~n)의 설치위치나 노즐구경은 서로 다르고, [0048]적어도 두 개의 제트배수분배관(31-1~n)의 평균 관로단면적 역시 서로 달라서 복잡한 사이펀 패턴을 만들어 낼수 있다. 물론 그 의도하는 패턴은 사이펀 유동체의 운동방향을 오물배출관 형상에 최적으로 들어맞게 하는 것에 있으며 이것은 앞서 도 7과 이후 설명할 도 11~ 도 13에서 보는 바와 같이 제트배수노즐(32-1~n) 각각의 제트분사각도가 오물배출관(51)의 관로형상에 맞게 사이펀 유동체의 운동방향을 바꿀 수 있도록 설정되는 것을 의미한다.도 9, 도 10에 도시된 제트배수분배기(40)를 설명한다. 본 추가 실시예에서 도입한 제트배수분배기의 형식은 [0049]4way 밸브이다. 밸브 몸체가 회전하면 제1 유입단으로부터 유입되는 제트배수를 제2,3,4 유출단으로 분배할 수있는 구조이며 그 제어는 사전에 제어패턴이 프로그래밍 된 마이컴(70)을 사용자가 작동스위치(60)로 구동하는것으로 이루어진다.본 실시예의 도면상에는 도시하지 않았지만 노즐구경이나 분배관 관로 저항 등은 추가적인 서보기구를 적용하면 [0050]역시 상기 마이컴(70)에 의해 제어될 수 있다. 이러한 추가적인 서보기구 장착에는 기술적 어려움이 있다기 보다는 단지 경제성 측면에서 고려되어야 할 것이다. 노즐구경이나 분배관 관로저항은 수동식으로 조절하고 대신사용자의 조작패턴을 좀더 지능적으로 받아들여 분석하는 것으로 본 발명은 뛰어난 비용대비 효과를 가질 수 있다. 예컨대 사용자가 변기 외부에 배치된 작동스위치(60) 두번 누른다든지, 길게 꾹 누르고 있다든지, 초초한공개특허 10-2013-0024226-7-동작으로 반복적으로 누른다든지 하는 다양한 작동패턴을 보일 수 있다. 이것은 별도의 감지장치 없이도 획득할수 있는 판단자료로써, 현재 보울 내의 오물이 간단히 처리될 수 있거나 아니면 오물의 양이 많거나 또는 오물배출에 문제가 생겼는지의 여부를 파악하는데 있어서 충분하면서도 좋은 데이터이다. 따라서 전반적인 시스템의제어를 담당하는 마이컴(70)은 위와 같은 사용자의 작동스위치(60) 조작패턴을 감지하여 현재 변기에 요구되는사이펀 발생 유형이 어떤 것에 해당하는지를 결정하고 아래에 기술하는 (A-a, b, c를 포함한) 다양한 A단계를전개할 수 있다.도 11 ~ 도 13은 본 발명의 다양한 사이펀 생성방법을 구체화하고 있다. [0051]기본적으로 본 발명의 제트배수 분배방법은 제트배수관(30)으로부터 유입되는 세척수를 서로 다른 관로 길이를 [0052]가진 적어도 두 개의 제트배수분배관(31-1~n)에 분배 유출하는 A단계와 제트배수분배관(31-1~n)으로부터 토출되는 세척수를 적어도 두 개의 제트배수노즐(32-1~n)을 통해 서로 다른 위치에서 분사시키는 B단계로 구성된다.이때 B단계는 다분히 A단계에 종속되며, 노즐의 개폐나 노즐위치를 실시간으로 조절하는 서보 기구를 추가 탑재하여야 가능하다. 그 이외의 B단계는 단지 초기에 고정된 각도와 고정된 위치(높이)를 갖는 노즐출구에서 분배된 제트배수가 자연스럽게 토출되는 것만을 의미하고 있다. 물론 B단계는 변기의 설치과정이나 변기의 수리 및재조정 과정에서 매우 중요하게 인식될 수 있다.A단계를 좀더 자세히 나누어 설명해 본다. A단계는 전체적으로 전기적으로 제어되는 제트배수분배기(40)에 의해 [0053]상기 각각의 제트배수분배관(31-1~n)에 개별적으로 세척수가 유입될 수 있도록 다단식으로 실행되는 특징을 갖고 있으며 도 11은 A-a단계, 도 12는 A-b단계, 도 13은 A-c단계를 설명하고 있다.도 11은 가장 전형적인 물 절약형 제트배수 분배단계(A-a)를 설명하고 있다. [0054]제트배수분배기(40)가 오물배출경로의 앞쪽에 위치하는 제트배수분배관(31-1) 부터 오물배출경로의 뒤쪽에 위치 [0055]하는 제트배수분배관(31-n)에 이르기까지 순차적으로 세척수를 분배하는 것인데, 고압수의 압력에 의한 초기 유속을 최대한 활용하는 것이다. 이는 마치 3단 로켓을 연상시키는 가속과정에 의해 사이펀 유동체는 약하지만 매우 빠르게 생성되어 신속하게 오물배출관을 넘어간다. 이것은 대부분의 소변이나 적은 양의 대변에 알맞다.도 12는 필요에 따라 고품질의 사이펀 유동을 생성할 수 있는 제트배수 분배단계(A-b)를 설명하고 있다. [0056]제트배수분배기(40)가 오물배출경로의 뒤쪽에 위치하는 제트배수분배관(31-n) 부터 오물배출경로의 앞쪽에 위치 [0057]하는 제트배수분배관(31-1)에 이르기까지 역순차적으로 세척수를 분배하는 것이 특징인데, 이 방법에 의하면 마치 풍부한 수량의 자연배수식 변기와 유사하거나 어떤 면에서는 더 뛰어난 사이펀 유동이 발생된다. 다소의 물낭비는 있다 하여도, 31-n, 32-n의 마지막 제트배수모듈로 오물배출관 뒤쪽에서부터 물을 채우는 방식이다. 이렇게 되면 오물이 가속되지 않아도 사이펀 압력이 발생 가능하게끔 사이펀 유동체가 형성된다. 이는 오물배출관의 언덕 정점을 넘어서서 미리 물을 채우는 것에 의해 이루어지는 것이다. 따라서 제트배수의 고속수류 에너지에 덜 의존하면서 강한 부압(진공압)에 의해 사이펀을 발생시킬 수 있다. 이는 곧 제트배수분배기의 다단식 작동패턴을 지능화함으로써 각 노즐에 할당되는 기본 제트배수량을 더 약하게 설정할 수 있다는 뜻이며, 결과적으로 대부분 사용되는 모드인 A-a 단계의 물 소모량을 더 적게 할 수 있다는 의미이다.마지막으로 도 13은 위기 탈출용의 제트배수 분배단계(A-c)를 설명하고 있다. [0058]이 단계는 예상치 못한 대량의 오물로 변기막힘이 일어났다거나 급수관 고장으로 수압이 현저히 낮아졌을 때 사 [0059]용되는 것으로써, 제트배수분배기(40)가 오물배출경로의 앞쪽에 위치하는 제트배수분배관(31-1) 과 오물배출경로의 뒤쪽에 위치하는 제트배수분배관(31-n)에 먼저 세척수를 분배하고 이후에 오물배출경로의 중간에 위치하는제트배수분배관, 즉 31-2 ~ 31-(n-1)에 세척수를 교차적으로 분배하는 것이 특징이다. 이 패턴은 보울 내에 대량의 물이 급속히 차오르기 때문에 넘침 가능성이 있는 다소 위험한 방법이나, 오물배출관 거의 전체를 물로 가득 채울 수 있고 또 보울로부터 누르는 물의 양도 가장 많아지므로 가장 강력한 진공압을 만들 수 있게 된다.따라서 물 절약을 의식하지 않는 아주 강력한 사이펀 유동을 발생시킬 수 있다.이상 설명한 바와 같이 A-b, A-c단계는 A-a단계와 달리 자연배수식에 유사한 사이펀 유동을 구현한다. 따라서 [0060]자주 이뤄지는 A-a단계를 물절약 위주로 설정하는 것이 가능해지는 것이다. 구체적으로 설명하면, 매우 작은 구경의 노즐과 매우 가느다란 분배관을 사용할 수 있고, 각 노즐과 분배관 초기 설정을 유속이 중점적으로 강조되는 워터제트, 즉 고압수도관의 잠재 수두에너지를 최대한 이용하는 방향으로 설정할 수 있는 것이다.참고로 상기 설명한 제트배수 분배방법은 변기에 사용되는 세척수 분사장치의 기본적 작동방법임과 동시에 변기 [0061]전체로 놓고 볼 때 변기 세척수 공급방법의 중간 단계로 포함하여 해석될 수 있다. 물론 상기 적어도 두 개의공개특허 10-2013-0024226-8-제트배수분배관(31-1~n) 및 상기 적어도 두 개의 제트배수노즐(32-1~n) 중 어느 하나 이상을 제어하는 단계(앞서 기술한 B단계) 역시 변기 전체로 놓고 볼 때 변기 세척수 공급방법의 중간단계로 포함하여 해석된다. 즉 본발명에서 따로 언급하지 않은 림 배수 단계는, 림 배수단계 그 자체가 사이펀 유동에 미치는 영향이 적기 때문에 이를 생략한 것이지 림 배수 단계와의 유기적인 결합이 어렵다는 뜻이 아니다. 본 실시예의 도면에서는 림배수관(20)과 전자식 급수분배기(12)를 분명히 도시하고 있으며, 또한 선행기술에서 구체적인 방법을 제시하고있으므로 본 발명은 림배수 또는 보울 내면 세척배수를 포함한 전체 변기의 세척수 공급구조와 공급방법을 모두포함하는 것으로 해석되어야 한다. 이상 본 발명이 구체화된 실시예를 도면과 함께 상세히 설명하였으나, 본 발명의 기술적 사상은 상기 실시예에 [0062]만 국한되지 않는다.다시 말해 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자라면, 본 발명의 명세서 및 도면이 내포하고 [0063]있는 기술적 사상을 활용하여 필요에 따라 본 발명의 명세서 및 도면에 미처 포함되지 않은 단순 변경 및 간단확장 사례를 구현할 수도 있으나, 이 또한 이하의 청구범위로 표현되는 본 발명 기술적 사상의 범위에 자명하게포함된다.부호의 설명10: 급수관 [0064]11: 급수구12: 급수분배기20: 림배수관21: 림배수구30: 제트배수관31-1 ~ 31-n: 제트배수분배관32-1 ~ 32-n: 제트배수노즐33: 노즐구경 조절구34: 노즐각도/분배관로저항 조절구40: 제트배수분배기41: 제트배수분배 수동제어기50: 보울(bowl: 변기 내부용기)51: 오물배출관60: 작동스위치70: 마이컴(Micom: 제트배수분배기 제어부)공개특허 10-2013-0024226-9-도면도면1도면2공개특허 10-2013-0024226-10-도면3도면4공개특허 10-2013-0024226-11-도면5도면6공개특허 10-2013-0024226-12-도면7도면8공개특허 10-2013-0024226-13-도면9도면10공개특허 10-2013-0024226-14-도면11공개특허 10-2013-0024226-15-도면12공개특허 10-2013-0024226-16-도면13공개특허 10-2013-0024226-17-"}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "급수관으로부터 급수되는 세척수를 제트배수관으로 공급받아 보울 내부에 워터제트 형태로 분사하는 구조로 된 변기의 세척수 분사장치에서, 유입단이 상기 제트배수관의 유출단에 연결되는 제트배수분배기 ; 유입단이 상기 제트배수분배기의 유출단에 연결되는 적어도 두 개의 제트배수분배관(31-1~n); 및 상기 제트배수분배관(31-1~n)의 유출단에 연결되는 적어도 두 개의 제트배수노즐(32-1~n);을 포함하여 구성되고, 상기 적어도 두 개의 제트배수분배관(31-1~n)의 관로 길이는 서로 다른 것을 특징으로 하는 세척수 분사장치가 개시된 다. 본 발명은 다단식 제트배수 노즐을 구비한 절수형 변기의 세척수 분사장치에 관한 것으로써 고압 수도관에 직접 연결되어 짧은 시간 동안 소량의 세척수에 의해 작동하는 직수 공급식 절수형 변기에서 서로 다른 분사각도 와 서로 다른 분사시점이 유기적으로 구성된 다단식 제트분사노즐을 이용하여 필요 최소량의 세척수를 원하는 시 점에 투입하는 구조에 의하여 유효한 사이펀(siphon) 현상을 일으킬 수 있도록 한 세척수 공급 최적화 장치에 대 해 기술하고 있다. 본 발명에 따르면 오물배출관 내에서 관로저항이 최소화되고 그에 따라 유동에너지가 최대한 높은 수준으로 유지 되는 지능적인 사이펀 유동체가 구현된다. 따라서 동등한 세척수량으로 더 뛰어난 사이펀을 발생시키거나 동등한 사이펀 성능에서 더 우수한 세척수 절수 능력을 발휘할 수 있다. 아울러 물 튐 현상이 감소하며, 림배수 시간이 상대적으로 길어져 자연배수식과 유사한 세척감을 느낄 수 있다."}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 고압 수도관에 직접 연결되어 짧은 시간 동안 소량의 세척수에 의해 작동하는 직수공급식 절수형 변 기에 관한 것으로써, 서로 다른 분사각도와 서로 다른 분사시점을 가지며 정해진 시점에 필요한 양 만큼의 세척 수를 투입할 수 있는 다단식 제트분사노즐에 의해 최소량의 물로 효과적인 사이펀 현상을 일으킬 수 있도록 한세척수 최적 공급 기술에 관한 것이다."}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자연배수식 변기는 수량이 풍부하지만 낮은 수두(Water head: 물이 갖는 에너지를 길이 또는 높이로 나타낸 것)를 갖는 탱크 저장수를 이용하여 오물이 트랩을 넘어갈 만한 충분한 양의 저속 세척수를 보울(Bowl: 변기 내 부용기) 내부 전체에 공급하는 구조로 된 것으로써, 소음이 적고 물이 튀지 않는 쾌적한 세척감은 물론 자연스 러운 사이펀(syphon/siphon) 현상에 의한 오물 배출감도 뛰어나다. 따라서 고압 수도수를 제트분사 시키는 강제 배수식 변기보다 뛰어난 감성품질을 갖고 있으나 그만큼 요구되는 세척수량도 많다. 자연배수식 변기와 대비되는 강제배수식 변기는 림(Rim)배수와 제트(Jet)배수를 따로 나누어 보울 내부에 필요 한 최소한의 세척수량만을 림배수구 쪽으로 보내고 나머지는 제트배수구 쪽에 할당하여 세척수의 운동에너지를 오물배출관의 사이펀 유발에 최대한 활용하는 메커니즘을 갖고 있다. 이 방식은 수도배관의 고압에너지(위치에 너지)를 운동에너지로 바꾸는 과정에서 물 소모량을 줄일 수 있기 때문에 현재로써는 세척수 절약을 위한 최선 의 방법으로 인식되고 있으며, 구체적으로 림배수량 또는 제트배수량 대비 오물배출 성능을 증가시키기 위한 다 양한 방법이 많은 이들에 의해 시도되고 있다. (문헌1)은 보울(bowl) 내부 세척수 배수구의 위치를 보울 수면 아래에 배치하여 보울 세척수의 유동에너지를 증 가시킨 것으로써 3개의 배수로 구조를 개념적으로 보여주고 있다. 여기에서 비록 최상단 배수로는 단지 중간단 배수로가 막혔을 시에 작동되는 예비 배수로에 지나지 않으나, 핵심이 되는 중간단 배수로의 위치가 수면 아래 여서 적어도 하나의 추가된 배수로가 보울 세척과 동시에 아래쪽 제트배수로가 담당하는 사이펀 현상유발에 도 움을 주는 기술적 토대를 제공하고 있다. (문헌2)는 복수의 제트배수구를 오물도기 내부에 설치하고, 그 중 상부의 제트배수구에 벤츄리관 타입의 기포혼 합장치를 추가하여 일종의 원시적인 2단 제트배수를 추구한 것이다. 이 문헌에 따르면 비록 단순한 분기관 형태 로 2갈래 제트배수로를 구성한다 하여도 사이펀 유동의 뒤쪽에 위치하는 상부의 기포혼합 제트배수는 전체 유량 을 줄이는 효과가 있다고 주장하고 있다. (문헌3)은 제트배수구의 분사각도와 오물배출관의 구조를 의도적으로 설계하여, 제트배수에 의한 사이펀 유동체 가 오물배출관에 부딪혀 되돌아오는 현상을 최대한 방지하고 아울러 제트배수 유동체의 입사 각도도 개선한 것 이다. 이에 따라 제트배수량을 최대한 아끼고자 할 때 만약에 발생할지도 모르는 사이펀 실패가 다소 줄어드는 효과가 있다. 한편 전기적 구동 메커니즘을 이용한 세척수 밸브 자동제어기술의 발달을 살펴보면, 다이어프램 개폐작용을 이 용한 전자제어식 필밸브(Fill valve), 높은 수압에서도 작동 가능한 솔레노이드 밸브, 그리고 빠른 작동속도와 함께 고압수 취급에도 유효한 수밀능력을 발휘하는 전자제어식 삼방밸브 등 높은 수압의 세척수를 콘트롤할 수 있는 세척수 제어기술은 현재 당 업계에서 강제배수 변기의 대표적인 배수제어 수단으로 그 활용폭을 급속도로 넓혀가고 있다. 본 발명자의 선출원 발명이기도 한 (문헌4)와 (문헌5)는 강제배수식 변기에 직결구조로 연결되 는 고압수를 효과적으로 제어할 수 있는 훌륭한 해결수단을 제시해 주고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) (문헌1) 일본공개특허 특개2001-279767 보울 내부 세척수 배수구의 위치를 보울 수면 아래에 배치하여 보울 세척수의 유동에너지를 증가시킨 3배수관식 변기. (특허문헌 0002) (문헌2) 일본공개특허 특개2004-270163 복수의 제트 토출구 중 어느 하나의 토출구에 기포혼합 장치를 부가한 사이펀 제트식 변기. (특허문헌 0003) (문헌3) 일본공개특허 특개2011-058208 제트세척수가 도달하는 배수트랩의 관로 내면이 평탄한 상승면으로 형성된 강제배수식 변기. (특허문헌 0004) (문헌4) 한국특허출원 10-2011-0004828 복수 필밸브의 개폐시점 조절을 이용한 절수형 변기의 세척수 분배장치 및 분배방법.(본 발명자의 선출원 발명) (특허문헌 0005) (문헌5) 한국특허출원 10-2011-0004829 삼방밸브의 급수경로 전환에 의한 변기의 세척수 분배"}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "장치.(본 발명자의 선출원 발명) 발명의 내용"}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "절수형 변기의 일반적인 세척수 공급방식은 세척수를 보울 내부를 세척하는 림배수와, 사이펀 현상을 유도하여 오물을 배출관 너머로 밀어내는 제트배수로 나누어 분사하는 것이다. 이 과정에서 사이펀을 유도하는 데에 핵심 이 되는 제트배수량은 줄이기 어려웠으므로 사이펀 발생 전후로 낭비되는 림배수량을 최대한 줄이는 방법이 종 래 세척수 절약기술의 중심이 되어 왔다. 그러나 더 이상 줄이기 어렵다는 제트배수량 또한, 반드시 필요한 양만큼 적절히 공급되어 왔던 것은 아니었으 며 실제로는 낭비되는 양이 많았다. 왜냐하면 고압수도관에 바로 연결되는 직수식 변기에서 세척수 절약을 목적 으로 분사노즐의 구경(caliber/diameter)을 지나치게 좁힌 제트배수는 매우 빠른 고속수류인 탓에, 하나의 덩어 리 유동체와 같이 이상적인 형태로 일어나야 할 사이펀을 유발하지 못하고 오물을 파고들어 관통하거나 또는 가 늘고 빠른 유수체인 반 사이펀(half siphon; 관 내부를 완전히 채우지 못해 완벽한 진공압을 유발하지 못하는 형태의 사이펀) 형태로 긴 시간에 걸쳐 오물배출관을 넘어가는 경우가 많았다. 반대로 제트배수 분사노즐의 구경을 키우면, 지나치게 빠른 유수의 속도는 적절하게 떨어뜨릴 수 있으나 그 대 신 큰 구경의 노즐로 낭비되는 배수량이 증가한다.(어찌되었건 최소한의 사이펀 유발시간 동안 막대한 세척수를 소모하는 제트배수는 지속되어야 하기 때문이다.) 따라서 단순히 노즐구경을 늘리거나 줄이는 것 만으로는 고압 수도관에 저장된 물이 갖는 수두에너지를 효율적으로 이용하기 어려웠다. 게다가 구불구불한 모양의 오물배출관은 고속 직선으로 분사되는 제트배수의 유동방향에 큰 저항으로 작용한다. 이 또한 고압 수도관의 잠재 에너지를 효율적으로 이용하지 못하는 주된 요인이 된다."}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "본 발명이 해결하려는 과제는 상술한 바와 같이 고압의 물이 갖는 수두에너지를 제트배수 형태로 유도할 때 어 느 한계치 이하로는 물을 절약할 수 없었던 종래 제트분사식 변기의 기술적 한계를 극복하는 것이며, 그에 따라 짧은 시간의 분사에도 불구하고 전체 세척수 소모량의 대부분을 차지하는 제트배수 소모량을 의미 있을 정도로 대폭 감소시키는, 다시 말해서 제트배수의 최적 분사유도에 관한 실질적이고 효과적인 기술수단을 제공하는 것 이다."}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하는 본 발명은 다음과 같은 주요 기술수단을 이용하여 유기적으로 구성된다. 본 발명은 우선, 림배수용 노즐과는 별도로 제트배수용 노즐과 분배관을 적어도 두 개 이상 설치하여 오물을 순 차적으로 밀어내는 다단식 제트분사 구조를 채택하되 각 제트분사구 별로 위치와 분사각도, 그리고 노즐 구경을 달리하고, 또한 필요에 따라 각 제트분사구에 연결된 제트배수분배관의 관로길이와 관로저항을 다르게 설정하여 하나의 제트배수관에서 서로 다른 수두(에너지)를 갖는 여러 개의 제트배수가 구현되도록 하였다. 보통의 변기는 하나의 관로로 제트배수관이 구성되며 본 발명에서도 제트배수를 분배하기 전의 제트배수관은 하 나이다. 이것은 상용화 가능한 변기에서 모든 제트배수는 기본적으로 동일한 수두(Hw = Height of water head) 공급원에서 출발한다는 가정, 다시 말해 일반적인 건물에 설치된 보통의 변기는 하나의 (수도)공급관에서 한 종 류의 고압수를 공급 받는다는 가정에서 얻어지는 결과이다. 본 발명 역시 하나의 공급관, 즉 동일한 수두에너지 를 가진 세척수 공급원에서 최초 제트배수 공급이 시작되는 것을 전제로 하고 있다. 이에 따르면 특별한 의도적 변화를 주지 않고서는 하나의 제트배수관에서 여러 방향으로 분사되건, 여러 개의 제트배수관에서 각각 하나의 방향으로 분사되건 그에 따른 수두(에너지) 변화는 없다고 볼 수 있다. 따라서 본 발명에서는 분배되는 제트배 수의 성질을 의도적으로 변화시키기 위해 다음의 세가지 변화를 제어변수로 삼아 각 제트배수 출구에서의 수두 에너지를 제어하는 것을 주요 해결수단으로 하고 있다. 세가지 변화란 먼저 제트배수관과 각 제트배수노즐 사이를 연결하는 제트배수분배관의 분배구조와 분배저항 변 화에 의한 1차 개별 수두에너지 변화, 다음으로 각 제트배수노즐의 토출각도와 토출위치에 따른 2차 개별 수두 에너지 변화, 마지막으로 각 제트배수노즐의 단위시간당 토출량에 따른 최종 유속(벡터량)과 최종 유량(스칼라 량)의 변화이다. 위와 같은 제어변수 해결수단 중 최초 관로 설계에서부터 반영될 수 있는 것들 즉 구조적으로 고정된 확정적 구 성요소들이 있고, 또한 변기의 운전 중 지속적으로 개입되어야 할 것들 즉 밸브 개폐와 관련하여 인공적으로 제 어 가능한 유동적 구성요소가 있다. 본 발명에서는 앞서 설명한 고정된 구성요소 외에도 후자의 요소, 즉 유동적인 구성요소의 제어를 위하여 필요 에 따라 전기적으로 제어 가능한 제트배수분배기를 도입할 수 있다. 물론 상기 제트배수분배기는 제어 방식이 아닌 유체역학적 설계를 통해 유동적 구성요소가 아닌 고정적 구성요 소로써 설계될 수도 있다. 고정적 설계요소로서의 제트배수분배기는 분배부의 부피와 형상, 분배관 연결부의 위"}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "치가 중요하며 유동적 설계요소로서의 제트배수분배기는 상기 배경기술에서 언급한 바와 같이 본 발명자의 선출 원 발명인 문헌 4, 5로부터 적절히 응용 설계된 자동제어 밸브모듈이 탑재될 수 있다. 한편, 제어 가능한 유동적 제트배수분배기를 탑재하는 조건에서 본 발명에서는 상술한 제어변수 해결수단을 구 체적으로 세척수 절약과 사이펀 효율향상에 활용하기 위한 고도화된 배수제어 방법을 제시한다. 이는 상기 제트 배수분배기 및 필요에 따라 자동 제어되는 노즐 구경 조절장치와 노즐 위치 및 각도 조절장치를 제어하는 방법 으로써, 실시간으로 변하는 운동량과 함께 의도하는 분사방향으로 토출되는 각각의 노즐 제트배수량을 유기적으 로 결합하여 하나의 지능적인 사이펀 유동체를 구현할 수 있는 기술수단을 제시한다."}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 오물배출관 내에서 관로저항이 최소화되고 그에 따라 유동에너지가 최대한 높은 수준으로 유 지되는 지능적인 사이펀 유동체가 구현된다. 따라서 동등한 세척수량으로 더 뛰어난 사이펀을 발생시키거나 또 는 동등한 사이펀 성능에서 더 우수한 세척수 절수 능력을 발휘할 수 있다. 또한 단위 배수량이 줄어들어 물 튐 현상이 감소하며, 변기 막힘 현상이 줄어드는 뛰어난 효과가 있다. 추가로 본 발명은 제트배수의 오물관통현상이 감소하므로 보다 고속의 제트수류를 이용할 수 있다. 따라서 전체 제트배수 시간이 짧아지고 그만큼 남게 되는 시간을 초기-후기 림배수에 매우 여유 있게 할당할 수 있으며, 오 물양이 많을 경우 지능적인 제트배수 패턴변화를 통해 수류에너지에 의존하지 않고 수압차에 의한 사이펀을 유 발시킬 수도 있다. 이러한 배수형태는 사용자로 하여금 마치 림배수 시간이 대부분인 것처럼 느껴지게 하며, 자연배수식 변기와 유 사한 배수패턴을 갖는 것처럼 느껴지게 하므로 고유의 물 절약 기능에 더해 우수한 세척감도 제공하여 주는 탁 월한 효과가 있다."}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상술한 본 발명의 과제 해결수단을 기술적으로 뒷받침하기 위하여 도면에 포함된 본 발명의 실시예들을 참조하 여 상세히 설명한다. 다만 아래의 특정 실시예에서 특정 전문용어를 포함한 구성요소들과 이들의 결합구조가 본 발명에 포괄적으로 내재된 기술적 사상을 제한하는 것은 아니다. 도 1 ~ 도 3에 도시한 본 발명의 일 실시예는 본 발명이 취할 수 있는 가장 간단한 형태를 나타낸 것이다. 기본 적으로 급수관으로부터 급수되는 세척수를 제트배수관으로 공급받아 보울 내부에 워터제트 형태로 분사하는 세척구조를 갖는 변기에서 고정식의 제트배수분배기와 2개의 서로 다른 길이로 된 제트배수분배관 (31-1 ~ 31-2)으로 구성된다. 본 실시예에서는 별도의 노즐이 없고 제트배수분배관의 출구가 노즐 역할을 하도 록 단순화한 경우인데, 이때는 변기내부와 제트배수분배관을 연결하는 과정에서 고형제(시멘트 종류)로 성형하 는 과정에서 분배관 고정구멍의 크기를 조절한다. 도 1에서 급수관에서부터 제트배수관까지의 구성, 그리고 림배수 관련구성(20,21)은 통상의 선행기술을 따른다. 도면상에서는 림배수가 고리형 림을 따라 흘러내리는 방식으로 되어 있으나 필요에 따라 토네이도 방식 의 회전수류 형태로도 설계 가능함은 물론이다. 급수분배기의 구성은 고속의 직동식 솔레노이드 밸브로 되어 있으나 이 또한 필요에 따라 생략하거나 다른 형태의 분배기로 대체될 수 있다. 도 2는 도 1에서 본 발명의 핵심에 좀더 가까운 부분만을 이해하기 쉽게 따로 도시한 것이다. 도면에서 제트배수분배기의 유입단은 제트배수관의 유출단에 연결되고 제트배수분배기의 유출단(2 개)은 2갈래로 나뉜 제트배수분배관(31-1 ~ 31-2)에 연결된다. 상기 제트배수분배관(31-1~2)들은 관로 길이와 평균 관로단면적이 다르게 설치되어 배출되는 제트배수의 운동에 너지를 의도적으로 조절한다. 이 과정에서 노즐각도/분배관로저항조절구가 추가 설치될 수 있으며 본 실시 예에서는 비닐튜브인 분배관로의 고정위치와 고정각도, 찝는 두께 등을 한꺼번에 조절할 수 있도록 부채꼴형 프 레임에 2개의 조절나사를 갖춘 구조가 사용되었다. 도 3의 제트배수분배기와 분배기가 만들어내는 수두(Hw: Height of water)차이를 살펴보자. 아래쪽 제트배 수분배관(31-2)의 유출지점은 위쪽 제트배수분배관(31-1)의 유출지점보다 높은 수두, 즉 Hw-2+Hw-supplied를 갖 는다. 따라서 가장 물살이 강할 것이다. 이는 가늘게 설정된 제브태부분배관(31-2)과 맞물려 가장 가느다랗고 빠른 워터제트를 만들어낸다. 이것은 오물을 포함한 사이펀 유동체에 최대한 속도를 붙이기 위해 의도된 것이다. 한편 보울에 가까운 분배관(31-1)은 상대적으로 느리고 굵은 워터제트를 만들어낸다. 다음으로 분배된 제트배수의 유출시점을 살펴보자. 도시된 제트배수분배기는 돌출부(protrude)가 형성되어 있다. 이 돌출부는 제트배수경로의 유로길이를 길게 하는 역할을 한다. 즉 돌출부가 분배기의 위에 형성되어 있 으면 위쪽 분배관(31-1)의 관로길이가 길어지고, 돌출부가 분배기의 아래쪽에 형성되어 있으면 아래쪽 분배관 (31-2)의 관로길이가 길어진다. 또한 길어진 관로길이와 더불어 유동저항도 증가한다. 증가된 유동저항은 실질 적인 수두(에너지)를 떨어뜨리는 역할을 한다. 즉 도 3의 제트배수분배기는 별도의 개폐기능이 없는 단순한 관로이음부재이면서도 연결된 제트배수분배관 (31-1~n)의 관로길이를 변화시키는 역할을 하고 있으며, 변화된 관로길이는 최종 분사되는 제트배수의 분사시점 과 운동량에 영향을 준다. 도 4 ~ 도 13에서 제시하는 본 발명의 추가 실시예는 3개의 분배관과 노즐이 설치된 것이다. 물론 필요에 따라 노즐수와 분배관수는 1,2,3..n개로 확장될 수 있을 것이다. 도 4는 본 실시예 변기의 전체 구조를 나타낸다. 제트배수 분배구조를 제외한 나머지 구조는 도 1과 같다. 도 5는 도 4에서 본 발명의 핵심에 좀더 가까운 부분만을 이해하기 쉽게 따로 도시한 것이다. 도면에서 제트배수분배기의 유입단은 제트배수관의 유출단에 연결되고 유출단(여기서는 3개)은 3갈래로 나뉜 제트배수분배관(31-1 ~ 31-3)에 연결된다. 또한 상기 제트배수분배관(31-1 ~ 31-3)의 유출단에는 각각 제트배수노즐(32- 1 ~ 32-3)이 대응되어 연결된다. 상기 제트배수분배관(31-1~n)들은 관로 길이와 평균 관로단면적이 다르게 설치되어 노즐을 통해 배출되는 제트 배수의 운동에너지를 의도적으로 조절한다. 역시 이 과정에서 노즐각도/분배관로저항조절구가 추가 설치될 수 있으며 본 추가 실시예에서도 비닐튜브인 분배관로의 고정위치와 고정각도, 찝는 두께 등을 한꺼번에 조절할 수 있도록 부채꼴형 프레임에 2개의 조절나사를 갖춘 구조가 사용되었다. 참고로 마지막 제트배수노즐(32-3)의 경우 조절구와 멀리 떨어져 있어 노즐각도의 조절이 어려우나 조절구의 나사를 풀어 분배관을 앞뒤로 강제 이동 시키면 노즐의 각도는 어느 정도 조절이 가능하다. 이는 보울이나 오물배출관 내에 노즐이 결합될 때 고무패킹 (도 6의 빨간색 부분)으로 고정 및 수밀이 이루어지므로 적당량의 분배관 압박으로 노즐이 움직일 수 있다는 근 거에 의한다. 나머지 제트배수노즐들은 부채꼴형 프레임을 따라 분배관의 각도를 움직이면 노즐도 따라 움직일 수 있도록 구성되어 있다. 이 모든 설정은 본 발명이 적용되는 변기의 크기와 구조, 그리고 본 발명 변기가 설 치되는 곳의 수도환경에 따라 설치과정 또는 사용과정에서 미소 조절될 수 있다. 도 6은 추가 실시예에서 나타날 수 있는 각 노즐의 워터제트 벡터량을 화살표의 길이와 굵기 그리고 방향으로 나타낸 것이다. 그림에서 직관적으로 떠오르는 워터제트의 벡터량은 노즐의 각도와 일치함은 물론 분배관의 굵 기와 노즐의 위치와도 연관이 높음을 잘 알 수 있다. 가장 굵은 분배관 말단의 노즐은 유속이 느리고 유량이 크 다. 따라서 짧고 굵은 파란 화살표로 표시되었다. 화살표의 길이, 즉 유속은 노즐의 위치와 관련된다. 노즐이 낮게 위치할수록 수두차이는 크다. 다시 말해 더 고 압수가 분출된다. 화살표의 굵기, 즉 유량은 분배관의 굵기와 연관이 있다. 굵은 관에서 더 많은 물이 나온다. 물론 상기 유속과 유량은 서로 반비례하는 함수관계를 갖고 있다. 그러나 본 발명에서는 공급수의 유량이 무한 대이고, 공급수의 압력이 분배관의 길이에 비해 매우 크다는 가정을 할 수 있다. 따라서 대략 상기한 바와 같이 노즐의 각도와 분배관의 굵기에만 관련된 것으로 근사화 시킬 수 있다. 이는 아래에 후술할 제트배수 분배방법 의 기술적 토대가 된다. 도 7, 도 8은 각 제트분사 모듈의 분사각, 수두차이, 관로저항을 종합적으로 나타낸 것이다. 각 노즐(32-1~3)의 뿌리 부분에는 간단히 나사식으로 돌려 조절할 수 있는 노즐구경 조절구가 달려있다. 이는 제트분사의 퍼짐 각도를 조절할 수 있거나 또는 분배관로 저항을 마지막으로 조절할 수 있는 장치이다. 도 8의 수두(Hw: Height of water)차이를 살펴보자. 가장 아래쪽 노즐(32-2)이 가장 높은 수두, 즉 Hw-2+Hw- supplied를 갖는다. 따라서 가장 물살이 강할 것이다. 이는 가장 가늘게 설정된 분배관(31-2)와 맞물려 가장 가 느다랗고 빠른 워터제트를 만들어낸다. 이것은 오물을 포함한 사이펀 유동체에 최대한 속도를 붙이기 위해 의도 된 것이다. 한편 보울에 가장 가까운 위치인 노즐(32-1)과 분배관(31-1)은 가장 느리고 굵은 워터제트를 만들어 낸다. 이것은 오물을 포함한 사이펀 유동체가 오물 관통현상 없이 서서히 힘을 받으면서 느리지만 확실하게 추 진되기 위한 것이며, 오물 배출 이후 많은 유량으로 신속하게 보울 내에 물을 다시 채우기 위함이다. 그리고 가 장 오물배출관 쪽에 가까운 위치인 노즐(32-3)과 분배관(31-3)은 그 중간형태의 워터제트를 만들어낸다. 이것은 앞서와 달리 두 가지 역할을 한다. 하나는 사이펀 유동체의 마무리 유동단계에서 압력+속도를 부가하는 역할이 고, 다른 하나는 진공압에 의한 강력한 사이펀을 발생시키기 위해서 오물배출관 후반부 관로에 미리 물을 채우 는 역할이다. 전자는 후술하는 A-a 제트배수 분배단계의 마지막 단계에 해당하며, 후자는 후술하는 A-c 제트배 수 분배단계의 처음 단계에 해당한다. 위와 같이 본 발명에서 정의하는 적어도 두 개의 제트배수노즐(32-1~n)의 설치위치나 노즐구경은 서로 다르고, 적어도 두 개의 제트배수분배관(31-1~n)의 평균 관로단면적 역시 서로 달라서 복잡한 사이펀 패턴을 만들어 낼 수 있다. 물론 그 의도하는 패턴은 사이펀 유동체의 운동방향을 오물배출관 형상에 최적으로 들어맞게 하는 것 에 있으며 이것은 앞서 도 7과 이후 설명할 도 11~ 도 13에서 보는 바와 같이 제트배수노즐(32-1~n) 각각의 제 트분사각도가 오물배출관의 관로형상에 맞게 사이펀 유동체의 운동방향을 바꿀 수 있도록 설정되는 것을 의 미한다. 도 9, 도 10에 도시된 제트배수분배기를 설명한다. 본 추가 실시예에서 도입한 제트배수분배기의 형식은 4way 밸브이다. 밸브 몸체가 회전하면 제1 유입단으로부터 유입되는 제트배수를 제2,3,4 유출단으로 분배할 수 있는 구조이며 그 제어는 사전에 제어패턴이 프로그래밍 된 마이컴을 사용자가 작동스위치로 구동하는 것으로 이루어진다. 본 실시예의 도면상에는 도시하지 않았지만 노즐구경이나 분배관 관로 저항 등은 추가적인 서보기구를 적용하면 역시 상기 마이컴에 의해 제어될 수 있다. 이러한 추가적인 서보기구 장착에는 기술적 어려움이 있다기 보 다는 단지 경제성 측면에서 고려되어야 할 것이다. 노즐구경이나 분배관 관로저항은 수동식으로 조절하고 대신 사용자의 조작패턴을 좀더 지능적으로 받아들여 분석하는 것으로 본 발명은 뛰어난 비용대비 효과를 가질 수 있 다. 예컨대 사용자가 변기 외부에 배치된 작동스위치 두번 누른다든지, 길게 꾹 누르고 있다든지, 초초한동작으로 반복적으로 누른다든지 하는 다양한 작동패턴을 보일 수 있다. 이것은 별도의 감지장치 없이도 획득할 수 있는 판단자료로써, 현재 보울 내의 오물이 간단히 처리될 수 있거나 아니면 오물의 양이 많거나 또는 오물 배출에 문제가 생겼는지의 여부를 파악하는데 있어서 충분하면서도 좋은 데이터이다. 따라서 전반적인 시스템의 제어를 담당하는 마이컴은 위와 같은 사용자의 작동스위치 조작패턴을 감지하여 현재 변기에 요구되는 사이펀 발생 유형이 어떤 것에 해당하는지를 결정하고 아래에 기술하는 (A-a, b, c를 포함한) 다양한 A단계를 전개할 수 있다. 도 11 ~ 도 13은 본 발명의 다양한 사이펀 생성방법을 구체화하고 있다. 기본적으로 본 발명의 제트배수 분배방법은 제트배수관으로부터 유입되는 세척수를 서로 다른 관로 길이를 가진 적어도 두 개의 제트배수분배관(31-1~n)에 분배 유출하는 A단계와 제트배수분배관(31-1~n)으로부터 토출 되는 세척수를 적어도 두 개의 제트배수노즐(32-1~n)을 통해 서로 다른 위치에서 분사시키는 B단계로 구성된다. 이때 B단계는 다분히 A단계에 종속되며, 노즐의 개폐나 노즐위치를 실시간으로 조절하는 서보 기구를 추가 탑재 하여야 가능하다. 그 이외의 B단계는 단지 초기에 고정된 각도와 고정된 위치(높이)를 갖는 노즐출구에서 분배 된 제트배수가 자연스럽게 토출되는 것만을 의미하고 있다. 물론 B단계는 변기의 설치과정이나 변기의 수리 및 재조정 과정에서 매우 중요하게 인식될 수 있다. A단계를 좀더 자세히 나누어 설명해 본다. A단계는 전체적으로 전기적으로 제어되는 제트배수분배기에 의해 상기 각각의 제트배수분배관(31-1~n)에 개별적으로 세척수가 유입될 수 있도록 다단식으로 실행되는 특징을 갖 고 있으며 도 11은 A-a단계, 도 12는 A-b단계, 도 13은 A-c단계를 설명하고 있다. 도 11은 가장 전형적인 물 절약형 제트배수 분배단계(A-a)를 설명하고 있다. 제트배수분배기가 오물배출경로의 앞쪽에 위치하는 제트배수분배관(31-1) 부터 오물배출경로의 뒤쪽에 위치 하는 제트배수분배관(31-n)에 이르기까지 순차적으로 세척수를 분배하는 것인데, 고압수의 압력에 의한 초기 유 속을 최대한 활용하는 것이다. 이는 마치 3단 로켓을 연상시키는 가속과정에 의해 사이펀 유동체는 약하지만 매 우 빠르게 생성되어 신속하게 오물배출관을 넘어간다. 이것은 대부분의 소변이나 적은 양의 대변에 알맞다. 도 12는 필요에 따라 고품질의 사이펀 유동을 생성할 수 있는 제트배수 분배단계(A-b)를 설명하고 있다. 제트배수분배기가 오물배출경로의 뒤쪽에 위치하는 제트배수분배관(31-n) 부터 오물배출경로의 앞쪽에 위치 하는 제트배수분배관(31-1)에 이르기까지 역순차적으로 세척수를 분배하는 것이 특징인데, 이 방법에 의하면 마 치 풍부한 수량의 자연배수식 변기와 유사하거나 어떤 면에서는 더 뛰어난 사이펀 유동이 발생된다. 다소의 물 낭비는 있다 하여도, 31-n, 32-n의 마지막 제트배수모듈로 오물배출관 뒤쪽에서부터 물을 채우는 방식이다. 이 렇게 되면 오물이 가속되지 않아도 사이펀 압력이 발생 가능하게끔 사이펀 유동체가 형성된다. 이는 오물배출관 의 언덕 정점을 넘어서서 미리 물을 채우는 것에 의해 이루어지는 것이다. 따라서 제트배수의 고속수류 에너지 에 덜 의존하면서 강한 부압(진공압)에 의해 사이펀을 발생시킬 수 있다. 이는 곧 제트배수분배기의 다단식 작 동패턴을 지능화함으로써 각 노즐에 할당되는 기본 제트배수량을 더 약하게 설정할 수 있다는 뜻이며, 결과적으 로 대부분 사용되는 모드인 A-a 단계의 물 소모량을 더 적게 할 수 있다는 의미이다. 마지막으로 도 13은 위기 탈출용의 제트배수 분배단계(A-c)를 설명하고 있다. 이 단계는 예상치 못한 대량의 오물로 변기막힘이 일어났다거나 급수관 고장으로 수압이 현저히 낮아졌을 때 사 용되는 것으로써, 제트배수분배기가 오물배출경로의 앞쪽에 위치하는 제트배수분배관(31-1) 과 오물배출경 로의 뒤쪽에 위치하는 제트배수분배관(31-n)에 먼저 세척수를 분배하고 이후에 오물배출경로의 중간에 위치하는 제트배수분배관, 즉 31-2 ~ 31-(n-1)에 세척수를 교차적으로 분배하는 것이 특징이다. 이 패턴은 보울 내에 대 량의 물이 급속히 차오르기 때문에 넘침 가능성이 있는 다소 위험한 방법이나, 오물배출관 거의 전체를 물로 가 득 채울 수 있고 또 보울로부터 누르는 물의 양도 가장 많아지므로 가장 강력한 진공압을 만들 수 있게 된다. 따라서 물 절약을 의식하지 않는 아주 강력한 사이펀 유동을 발생시킬 수 있다. 이상 설명한 바와 같이 A-b, A-c단계는 A-a단계와 달리 자연배수식에 유사한 사이펀 유동을 구현한다. 따라서 자주 이뤄지는 A-a단계를 물절약 위주로 설정하는 것이 가능해지는 것이다. 구체적으로 설명하면, 매우 작은 구 경의 노즐과 매우 가느다란 분배관을 사용할 수 있고, 각 노즐과 분배관 초기 설정을 유속이 중점적으로 강조되 는 워터제트, 즉 고압수도관의 잠재 수두에너지를 최대한 이용하는 방향으로 설정할 수 있는 것이다. 참고로 상기 설명한 제트배수 분배방법은 변기에 사용되는 세척수 분사장치의 기본적 작동방법임과 동시에 변기 전체로 놓고 볼 때 변기 세척수 공급방법의 중간 단계로 포함하여 해석될 수 있다. 물론 상기 적어도 두 개의제트배수분배관(31-1~n) 및 상기 적어도 두 개의 제트배수노즐(32-1~n) 중 어느 하나 이상을 제어하는 단계(앞 서 기술한 B단계) 역시 변기 전체로 놓고 볼 때 변기 세척수 공급방법의 중간단계로 포함하여 해석된다. 즉 본 발명에서 따로 언급하지 않은 림 배수 단계는, 림 배수단계 그 자체가 사이펀 유동에 미치는 영향이 적기 때문 에 이를 생략한 것이지 림 배수 단계와의 유기적인 결합이 어렵다는 뜻이 아니다. 본 실시예의 도면에서는 림 배수관과 전자식 급수분배기를 분명히 도시하고 있으며, 또한 선행기술에서 구체적인 방법을 제시하고 있으므로 본 발명은 림배수 또는 보울 내면 세척배수를 포함한 전체 변기의 세척수 공급구조와 공급방법을 모두 포함하는 것으로 해석되어야 한다. 이상 본 발명이 구체화된 실시예를 도면과 함께 상세히 설명하였으나, 본 발명의 기술적 사상은 상기 실시예에 만 국한되지 않는다."}
{"patent_id": "10-2011-0087535", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다시 말해 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자라면, 본 발명의 명세서 및 도면이 내포하고 있는 기술적 사상을 활용하여 필요에 따라 본 발명의 명세서 및 도면에 미처 포함되지 않은 단순 변경 및 간단 확장 사례를 구현할 수도 있으나, 이 또한 이하의 청구범위로 표현되는 본 발명 기술적 사상의 범위에 자명하게 포함된다."}
{"patent_id": "10-2011-0087535", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명 일 실시예 변기의 전체 측면도. 도 2는 본 발명 일 실시예 세척수 분사장치의 측면도. 도 3은 도 2의 세척수 분사장치 에서 각 노즐의 수두 차이를 나타낸 그림. 도 4는 본 발명 추가 실시예 변기의 전체 측면도. 도 5는 본 발명 추가 실시예 세척수 분사장치의 측면도. 도 6은 도 5의 세척수 분사장치가 보울과 오물배출관에 장착된 그림. 도 7은 도 5에서 제트배수 분배모듈을 따로 도시한 그림. 도 8은 도 5의 세척수 분사장치에서 각 노즐의 수두 차이를 나타낸 그림. 도 9는 본 발명 추가 실시예 제트배수분배기의 평면도. 도 10은 도 8의 제트배수분배기의 작동패턴을 설명한 그림. 도 11은 본 발명 추가 실시예에 따른 제트배수 분배단계 A-a를 설명한 그림. 도 12는 본 발명 추가 실시예에 따른 제트배수 분배단계 A-b를 설명한 그림. 도 13은 본 발명 추가 실시예에 따른 제트배수 분배단계 A-c를 설명한 그림."}
