{"patent_id": "10-2022-0080147", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0003087", "출원번호": "10-2022-0080147", "발명의 명칭": "질화붕소 시트가 탑재된 자율주행 방역로봇", "출원인": "이예진", "발명자": "이예진"}}
{"patent_id": "10-2022-0080147", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "회전축(300)을 포함하는 몸체부(200) ;상기 몸체부 내부 우측 하단에 설치되는 주행용센서(1000); 및상기 몸체부 내부 하단에 설치되는 시트조절모듈 (500); 및상기 몸체부 내부 좌측 하단에 설치되는 배터리팩(1200); 및상기 회전축(100)에 롤러식으로 말려 있는 질화붕소 방열시트(400); 로 구성되는 방역로봇"}
{"patent_id": "10-2022-0080147", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "회전축(300)에 말려있는 질화붕소 시트(400)를 수납하는 방법"}
{"patent_id": "10-2022-0080147", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "질화 붕소시트(400)를 이용해 살균하는 방법"}
{"patent_id": "10-2022-0080147", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상부에 자외선 램프(900)를 결합한 로봇"}
{"patent_id": "10-2022-0080147", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이는 방역에 사용되는 자율주행 로봇으로, 상세하게는 방열성이 있는 시트를 사용하여 로봇의 수명과 효율을 높 이고 롤러식 수납을 통해 휴대용이성을 높이기 위함이다. 기존의 자외선램프 방식의 살균이 아닌, 질화붕소시트를 활용한 로봇은 연성이 있어 수납이 가능하고, 수요자의 니즈에 따라 크기를 조절할 수 있다. 또한 전계에서 자외선을 방출하는 물성을 활용해 추가 적인 살균물질 부착없이 살균할 수 있다. 마지막으로 전기전도성이 있어 시트자체에도 인공지능을 연결할 수 있어 효과적인 주행이 가능하다. 자유로운 주행이 가능한 바퀴는 사용자 지시에 따라 360도 움직일 수 있고, 인공지능 모듈 탑재한 몸 체부와, 롤러식으로 수납된 방열시트를 통해 자외선 살균효과를 볼 수 있다."}
{"patent_id": "10-2022-0080147", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이는 방역에 사용되는 자율주행 로봇으로, 상세하게는 방열성이 있는 시트를 사용하여 로봇의 수명과 효율을 높 이고 롤러식 수납을 통해 휴대용이성을 높이기 위함이다."}
{"patent_id": "10-2022-0080147", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "발명의 배경이 되는 기술로는 장애물을 감지하여 주행하는 인공지능 기술이 있다. 인공지능 센서를 이용해 방해 물을 인식하고 주행하는 것이다. 또한 최근 무분별하게 확산되는 감염병 유행으로 생겨나게 된 살균기능을 가진 방역로봇기술을 토대로 고안되었다. 종래의 방역로봇은 자외선 램프나 소독물질을 직접 탑재하여 로봇의 효용성 을 저하시켰고, 단순한 주합발명에 해당하여 광범위한 공간에 효율적인 방역을 할 수 없던 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2400206 2016년10월10일 (특허문헌 0002) KR 10-2021-0127287 2021년10월22일 (특허문헌 0003) KR 10-2016-0125711 2016년 11월01일"}
{"patent_id": "10-2022-0080147", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "BN(질화붕소)와 결합하면 연성 가지기 때문에 기계의 크기를 유연하게 조절할 수 있고, 높은 방열성과 자외선 방출기능을 가지는 바 방역로봇의 효율성을 증대화하고 로봇의 수명을 연장시킬 수 있다. 또한 로봇이라는 특수 성을 활용해 시간이나 장소에 구애받지 않고 방역을 실시할 수 있는 장점이 있다. 방역로봇에 사용될 메인 소재 로서 질화붕소는 기계적, 열적 물성을 가지는 동시에 고온에서도 물성이 유지되기 때문에 단순히 웨어러블 디바 이스 에 적용함을 넘어 인공지능기능을 탑재한 로봇에 사용되어 인파가 몰렸던 장소에 방역을 위해 투입될 수 있고, 일정 부분에는 자외선 살균의 효과도 기대할 수 있다. 즉, 해당 발명은 육방정 질화붕소(BN)를 이용하여 열전도성, 내열성, 연성을 가지는 신소재를 이용한 것을 특유 한 해결수단으로 한다."}
{"patent_id": "10-2022-0080147", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 360도 주행이 가능한 바퀴와, 내부에 회전축을 포함하는 몸체부로 구성된다. 몸체부 내부 에는 회전축 을 중심으로 롤러식으로 수납이 가능한 방열시트, 인공지능 모듈로 이루어진다. 인공지 능 모듈에는 주행용센서, 배터리팩 , 시트조절용 모듈 으로 구성되며 이는 사용자의 지시에 따라 주행 혹은 시트의 길이를 조절할 수 있다. 방열시트는 구체적으로 육방정 질화붕소로 구성되며 이는 cvd방식이나 기계적 증착으로 최적의 조건을 찾아 연성과 전기전도성을 동시에 갖게 함이 핵심이다."}
{"patent_id": "10-2022-0080147", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "질화붕소를 시트로 이용하면, 방열성이 높아 기계의 수명을 연장시킬 수 있고, 전기전도성이 있어 자율주행에 용이하며, 연성을 가지기 때문에 롤러식으로 수납할 수 있는 장점이 있다 .스스로 운행이 가능하도록 장애물회 피와 사물인식 등의 자율주행 기능을 탑재한다. 또한 살균 방식이 램프가 아닌 시트이다 보니 회전이나 운행시 360도의 다각적인 살균이 불가할 수 있는 바, 상부에 자외선 램프를 결합하여 효과적인 살균을 돕는다."}
{"patent_id": "10-2022-0080147", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 바람직한 실시예를 첨부한 도면을 참조하여 당해 분야의 통상의 지식을 가진 자가 용이하게 실 시할 수 있도록 설명한다 본 발명의 기술수단은 3가지로 나뉜다. 롤러식 수납이 가능한 연성을 발휘할 것, 전기 전도성이 있어 자율주행 시 방해물 확보와 주행에 정확성을 높일 것, 마지막으로 전계를 가하면 자외선을 방출하는 성질을 이용해 별도 의 자외선램프 부착이 필요하지 않을 것이다. 해당 물성을 발휘시키기 위해서는, 질화붕소 시트를 제작하기 위해 최적의 조건을 찾아야 한다. 산업상 이용가능성 (구조) 질화 붕소의 화학적 구조는 B와 N이 1:1로 화합하여 흑연과 같은 결정구조를 가진다. (목적) 현재는 IT/IoT 분야에서 고휘도 LED, 5G 휴대전화 관련 모듈 및 전기자동차 등의 전기절연 방열소재, flexible센서나 에너지 하베스팅 압전 소재로 쓰이고 있다. 육방정 BN 나노시트를 제조하는 방법으로는 기계적 박리, 화학기상증착(Chemical Vapor Deposition : CVD), 층간 화합물 방법 등이 있으며, 일반적으로 CVD 방법 과 기계적 박리 방법이 육방정 질화붕소 나노시트 제조에 사용되고 있다. (효과) BN은 뛰어난 내열성, 전기 절연성 외에 정밀 가공이 가능하기 때문에 가열상태에서 사용하는 전자기기의 절연재로 사용이 불가결한 존재이다. 또 전기 절연성과 고열 전도성인 특징이 있기 때문에 트랜지스터, IC의 기판, 밀봉 히터의 절연재로 사용된다. 질화 붕소는 전자기기로 활용되는 신소재로서, 구성이나 효과를 충분히 예측할 수 있는 바 발명의 성립성을 갖 추고 있는 것으로 보인다. 다만, 활용되는 분야마다 필요로 하는 성질이 다르기 때문에, 시트의 두께나 가격, 방열성과 전도성 중 강조되는 것을 달리하여 제작할 수 있고, 본 발명에서는 방열성과 연성, 전기전도성을 발휘 하는 최적의 조건을 찾는 것을 발명의 목적으로 한다."}
{"patent_id": "10-2022-0080147", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면1은 발명의 실시예에 따른 방역로봇의 작동 전 사시도이다. 도면2는 발명의 실시예에 따른 방역로봇의 작동 후 사시도이다. 도면3은 발명의 실시예에 따른 방역로봇의 위측 평면도이다. 도면4는 발명의 실시예에 따른 몸체부 내부도이다. 도면5는 발명의 실시예에 따른 자외선램프를 결합한 사시도 이다."}
