{"patent_id": "10-2021-7019206", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0087098", "출원번호": "10-2021-7019206", "발명의 명칭": "음성 인터랙션에 기반하는 정보 검증 방법, 장치, 기기, 컴퓨터 저장 매체 및 컴퓨터 프로그", "출원인": "바이두 온라인 네트웍 테크놀러지", "발명자": "황 지저우"}}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,상기 사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트를 획득하는 단계는,음향 모델과 언어 모델을 이용하여, 사용자가 음성 문의에 대해 피드백한 음성 응답에 대해 음성 인식을 진행하여, 상기 음성 응답 텍스트를 얻는 단계를 포함하며, 상기 음향 모델과 언어 모델은 훈련 관정에서 상기 검증 대상이 속하는 대상 유형의 사전적 데이터를 도입하는,음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 발음 표시 정보는 중국어 병음을 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 시맨틱 이해 모델은, 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예측 레이어를 더 포함하며,상기 임베딩 레이어는, 상기 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하기 위한 것이고,상기 타이밍 시퀀스 모델링 레이어는, 상기 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 상기 각문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이며,상기 매핑 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여매핑하고 사용자 의사 정보를 얻기 위한 것이고,상기 예측 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하여, 검증 대상 정보를 예측하기 위한 것인, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 검증 대상 정보가 획득된다면, 상기 검증 대상 정보를 상기 검증 대상이 속하는 분야 지식 베이스 중의 대상 정보에 링크하는 단계를 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 검증 대상 정보를 상기 검증 대상이 속하는 분야 지식 베이스 중의 대상 정보에 링크하는 단계는,음성 유사도, 텍스트 유사도, 속성 유사도 중 적어도 하나를 기반으로, 상기 검증 대상 정보를 상기 분야 지식베이스에 분류하여, 상기 검증 대상이 상기 분야 지식 베이스 중에 링크되는 대상 정보를 결정하는 단계; 및링크되는 대상 정보가 결정되면, 결정된 대상 정보를 이용하여 상기 검증 대상 정보를 업데이트하는 단계를 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법.공개특허 10-2021-0087098-3-청구항 6"}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 음향 모델은,상담원이 사용자에게 정보 검증을 진행하는 음성 및 대응되는 라벨 텍스트를 이용하여, 훈련 데이터를획득하고,기존의 음향 모델의 학습율을 낮게 조절하고, 상기 훈련 데이터를 이용하여, 기존의 음향 모델에 대해 모델 파라미터의 최적화를 진행하는 기법을 적용하여, 사전 훈련되어 획득된 것인, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 다수 차례의 대화 메커니즘을 기반으로, 상기 검증 대상 정보의 정확성을 사용자에게 확인하는 단계를 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,다수 차례의 대화 메커니즘을 기반으로, 상기 검증 대상 정보의 정확성을 사용자에게 확인하는 단계는,상기 검증 대상 정보에 포함된 문자 부호 정보에 대한 음성 문의를 상기 사용자에게 발송하는 단계; 및상기 사용자가 피드백한 음성 응답 텍스트의 사용자 의사 정보에 따라, 상기 검증 대상 정보의 정확성을 확인하는 단계를 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 사용자 의사 정보 및/또는 상기 검증 대상 정보를 이미 명확해진 결과와 비교를 진행하여, 만약 일치하다면, 상기 사용자가 거짓말 탐지를 통과한 것으로 확인하고, 그렇지 않으면 상기 사용자가 거짓말 탐지를 통과하지 못한 것으로 확인하는 단계; 및거짓말 탐지를 통과하지 못한 사용자가 피드백한 음성 응답 텍스트는 채택하지 않는 단계를 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서,상기 사용자가 음성 문의에 대해 피드백한 음성 응답에 대한 감정 인식, 사용자 속성 인식 및 현재 시간과 공간의 정보에 대한 인식 중 적어도 하나를 진행하는 단계; 및공개특허 10-2021-0087098-4-인식 결과에 따라, 대응되는 화술을 적용하여 상기 사용자와 후속 음성 인터랙션을 진행하는 단계를 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,음성 합성 모델을 이용하여 상기 음성 문의를 생성하는 단계를 더 포함하며,상기 음성 합성 모델은 상담원이 사용자에게 정보 검증을 진행하는 음성 및 검증 대상이 속하는 대상 유형에 대한 속성 정보 라벨 및/또는 시간 정보를 포함하는 대응되는 라벨 텍스트를 이용하여, 사전 훈련을 통해 얻은 것인, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 1 내지 12 중 어느 한 항에 있어서, 상기 검증 대상 정보는 지리적 위치점 정보를 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "시맨틱 이해 모델 훈련 방법으로서,사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트 및 상기 음성 응답 텍스트의 사용자 의사 정보 및/또는검증 대상 정보에 대한 라벨을 포함하는 훈련 데이터를 획득하는 단계; 및훈련 데이터에서 시맨틱 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 시맨틱 이해 모델의 입력으로 하고, 검증 대상 정보 및/또는 라벨링된 확인, 부인, 대답 또는 질문을 포함하는 사용자 의사 정보를 상기 시맨틱 이해 모델의 목표 출력으로 하여, 상기 시맨틱 이해 모델을 훈련하는 단계를 포함하는,시맨틱 이해 모델 훈련 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서,상기 훈련 데이터를 획득하는 단계는,동일한 음성 문의에 대해, 고빈도의 음성 응답 텍스트를 획득하여 수작업 라벨링을 진행한 후, 시드 샘플을 얻는 단계;시드 샘플을 이용하여 히스토리 데이터베이스 중의 대상 정보 일반화를 거친 음성 응답 텍스트에 대해 유사도클러스터링을 진행하는 단계; 및 클러스터링 결과에 따라, 각 사용자 의사 정보에 대응되는 음성 응답 텍스트를 획득하여 훈련 데이터로 하는 단계를 포함하는, 시맨틱 이해 모델 훈련 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 14에 있어서,상기 시맨틱 이해 모델은, 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예측 레이어를 더 포함하며,상기 임베딩 레이어는, 상기 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하기 위한 것이고,상기 타이밍 시퀀스 모델링 레이어는, 상기 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 상기 각문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이며,상기 매핑 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여공개특허 10-2021-0087098-5-매핑하고, 사용자 의사 정보를 얻기 위한 것이고,상기 예측 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하여 검증 대상 정보를 예측하기 위한 것인, 시맨틱 이해 모델 훈련 방법."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "음성 인터랙션에 기반하는 정보 검증 장치로서,사용자에게 정보 검증을 진행하기 위한 음성 문의에 대해 사용자가 피드백한 음성 응답 텍스트를 획득하며, 상기 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 사전에 훈련하여 얻은 시맨틱 이해 모델에 입력하여, 상기 시맨택 이해 모델에서 출력하는 검증 대상 정보 및/또는 확인, 부인, 대답 또는질문을 포함하는 사용자 의사 정보를 획득하는 시맨틱 이해 모듈을 포함하는, 음성 인터랙션에 기반하는 정보검증 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 시맨틱 이해 모델은 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예측레이어를 더 포함하며,상기 임베딩 레이어는, 상기 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하기 위한 것이고,상기 타이밍 시퀀스 모델링 레이어는, 상기 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 상기 각문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이며,상기 매핑 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여매핑하고 사용자 의사 정보를 얻기 위한 것이고,상기 예측 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하여 검증 대상 정보를 예측하기 위한 것인, 음성 인터랙션에 기반하는 정보 검증 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 17에 있어서,상기 시맨틱 이해 모듈에 의해 상기 검증 대상 정보가 획득된다면, 상기 검증 대상 정보를 상기 검증 대상이 속하는 분야 지식 베이스 중의 대상 정보에 링크하기 위한 링크 모듈을 더 포함하는, 음성 인터랙션에 기반하는정보 검증 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 17에 있어서,훈련 관정에서 상기 검증 대상이 속하는 대상 유형의 사전적 데이터를 도입하는 음향 모델과 언어 모델을 이용하여, 사용자가 음성 문의에 대해 피드백한 음성 응답에 대해 음성 인식을 진행하여, 상기 음성 응답 텍스트를얻기 위한 음성 인식 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "청구항 20에 있어서,상담원이 사용자에게 정보 검증을 진행하는 음성 및 대응되는 라벨 텍스트를 이용하여, 훈련 데이터를획득하고, 기존의 음향 모델의 학습율을 낮게 조절하고, 상기 훈련 데이터를 이용하여, 기존 음향 모델에 대해모델 파라미터의 최적화를 진행하기 위한 음향 모델 훈련 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보검증 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "청구항 17에 있어서,공개특허 10-2021-0087098-6-사수 차례의 대화 메커니즘을 기반으로, 상기 검증 대상 정보의 정확성을 사용자에게 확인하기 위한 대화 관리모듈을 더 포함하며,구체적으로, 대화 관리 모듈은, 상기 검증 대상 정보에 포함된 문자 부호 정보에 대한 음성 문의를 상기 사용자에게 발송하고; 상기 사용자가 피드백한 음성 응답 텍스트의 사용자 의사 정보에 따라, 상기 검증 대상 정보의정확성을 확인하는, 음성 인터랙션에 기반하는 정보 검증 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "청구항 17에 있어서,상기 사용자 의사 정보 및/또는 상기 검증 대상 정보를 이미 명확해진 결과와 비교를 진행하며, 만약 일치하다면, 상기 사용자가 거짓말 탐지를 통과한 것으로 확인하고; 그렇지 않으면 상기 사용자가 거짓말 탐지를 통과하지 못한 것으로 확인하며, 거짓말 탐지를 통과하지 못한 사용자가 피드백한 음성 응답 텍스트는 채택하지 않는대화 관리 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "청구항 17에 있어서,상기 사용자가 음성 문의에 대해 피드백한 음성 응답에 대한 감정 인식, 사용자 속성 인식 및 현재 시간과 공간의 정보에 대한 인식 중 적어도 하나를 진행하며, 인식 결과에 따라, 대응되는 화술을 적용하여 상기 사용자와후속 음성 인터랙션을 진행하기 위한 대화 관리 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보 검증장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "청구항 17에 있어서,음성 합성 모델을 이용하여 상기 음성 문의를 생성하기 위한 음성 합성 모듈을 더 포함하며, 상기 음성 합성 모델은 상담원이 사용자에게 정보 검증을 진행하는 음성 및 검증 대상이 속하는 대상 유형에 대한 속성 정보 라벨및/또는 시간 정보를 포함하는 대응되는 라벨 텍스트를 이용하여, 사전 훈련을 통해 얻은 것인, 음성 인터랙션에 기반하는 정보 검증 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "에 있어서,상기 시맨틱 이해 모델은 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예측레이어를 더 포함하며;상기 임베딩 레이어는, 상기 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하기 위한 것이고,상기 타이밍 시퀀스 모델링 레이어는, 상기 임베딩 레이어에 대응되는 부호화 결과를 이용하여, 상기 각 문자부호 간의 시맨틱 의존 관계를 학습하기 위한 것이며,상기 매핑 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여매핑하고 사용자 의사 정보를 얻기 위한 것이고,상기 예측 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하여 검증 대상 정보를 예측하기 위한 것인, 시맨틱 이해 모델 훈련 장치."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "청구항 26에 있어서,상기 데이터 획득 모듈은, 구체적으로,동일한 음성 문의에 대해, 고빈도의 음성 응답 텍스트를 획득하여 수작업 라벨링을 진행한 후, 시드 샘플을 얻으며,시드 샘플을 이용하여 히스토리 데이터베이스 중의 대상 정보 일반화를 거친 음성 응답 텍스트에 대해 유사도클러스터링을 진행하고,클러스터링 결과에 따라, 각 사용자 의사 정보에 대응되는 음성 응답 텍스트를 획득하여 훈련 데이터로 하기 위한 것인, 시맨틱 이해 모델 훈련 장치.공개특허 10-2021-0087098-7-청구항 28"}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "전자 기기로서,적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하되, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령어가 저장되고, 상기 명령어는 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서로 하여금 청구항 1 내지 16중 어느 한 항의 방법을 수행할 수 있게 하는 것을 특징으로 하는 전자 기기."}
{"patent_id": "10-2021-7019206", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "컴퓨터 명령어가 저장된 비휘발성 컴퓨터 판독가능 저장 매체로서,컴퓨터로 하여금 청구항 1 내지 16 중 어느 한 항의 방법을 수행하게 하기 위한 컴퓨터 명령어가 저장된 것을특징으로 하는, 비휘발성 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 음성 인터랙션에 기반하는 정보 검증 방법, 장치, 기기 및 컴퓨터 저장 매체를 개시하며, 인공지능"}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것이다. 그 구체적인 실시형태는, 사용자에게 정보 검증을 진행하기 위한 음성 문의에 대해 사용 자가 피드백한 음성 응답 텍스트를 획득하고, 상기 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되 는 발음 표시 정보를 사전에 훈련하여 얻은 시맨틱 이해 모델에 입력하여, 상기 시맨틱 이해 모델에서 출력하는 검증 대상 정보 및/또는 확인, 부인, 대답 또는 질문을 포함하는 사용자 의사 정보를 획득한다. 대 표 도 - 도1"}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2021-0087098 CPC특허분류 G06F 16/3343 (2019.01) G06F 16/3344 (2019.01) G06F 40/35 (2020.01) G10L 15/1822 (2013.01) G10L 2015/225 (2013.01)명 세 서 청구범위 청구항 1 음성 인터랙션에 기반하는 정보 검증 방법으로서, 사용자에게 정보 검증을 진행하기 위한 음성 문의에 대해 사용자가 피드백한 음성 응답 텍스트를 획득하는 단계; 및 상기 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 사전에 훈련하여 얻은 시 맨틱 이해 모델에 입력하여, 상기 시맨틱 이해 모델에서 출력하는 검증 대상 정보 및/또는 확인, 부인, 대답 또 는 질문을 포함하는 사용자 의사 정보를 획득하는 단계 를 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 2 청구항 1에 있어서, 상기 발음 표시 정보는 중국어 병음을 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 3 청구항 1에 있어서, 상기 시맨틱 이해 모델은, 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예 측 레이어를 더 포함하며, 상기 임베딩 레이어는, 상기 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하 기 위한 것이고, 상기 타이밍 시퀀스 모델링 레이어는, 상기 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 상기 각 문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이며, 상기 매핑 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여 매핑하고 사용자 의사 정보를 얻기 위한 것이고, 상기 예측 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하 여, 검증 대상 정보를 예측하기 위한 것인, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 4 청구항 1에 있어서, 상기 검증 대상 정보가 획득된다면, 상기 검증 대상 정보를 상기 검증 대상이 속하는 분야 지식 베이스 중의 대 상 정보에 링크하는 단계를 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 5 청구항 4에 있어서, 상기 검증 대상 정보를 상기 검증 대상이 속하는 분야 지식 베이스 중의 대상 정보에 링크하는 단계는, 음성 유사도, 텍스트 유사도, 속성 유사도 중 적어도 하나를 기반으로, 상기 검증 대상 정보를 상기 분야 지식 베이스에 분류하여, 상기 검증 대상이 상기 분야 지식 베이스 중에 링크되는 대상 정보를 결정하는 단계; 및 링크되는 대상 정보가 결정되면, 결정된 대상 정보를 이용하여 상기 검증 대상 정보를 업데이트하는 단계 를 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법.청구항 6 청구항 1에 있어서, 상기 사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트를 획득하는 단계는, 음향 모델과 언어 모델을 이용하여, 사용자가 음성 문의에 대해 피드백한 음성 응답에 대해 음성 인식을 진행하 여, 상기 음성 응답 텍스트를 얻는 단계를 포함하며, 상기 음향 모델과 언어 모델은 훈련 관정에서 상기 검증 대상이 속하는 대상 유형의 사전적 데이터를 도입하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 7 청구항 6에 있어서, 상기 음향 모델은, 상담원이 사용자에게 정보 검증을 진행하는 음성 및 대응되는 라벨 텍스트를 이용하여, 훈련 데이터를 획득하고, 기존의 음향 모델의 학습율을 낮게 조절하고, 상기 훈련 데이터를 이용하여, 기존의 음향 모델에 대해 모델 파 라미터의 최적화를 진행하는 기법을 적용하여, 사전 훈련되어 획득된 것인, 음성 인터랙션에 기반하는 정보 검 증 방법. 청구항 8 청구항 1에 있어서, 다수 차례의 대화 메커니즘을 기반으로, 상기 검증 대상 정보의 정확성을 사용자에게 확인하는 단계를 더 포함 하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 9 청구항 8에 있어서, 다수 차례의 대화 메커니즘을 기반으로, 상기 검증 대상 정보의 정확성을 사용자에게 확인하는 단계는, 상기 검증 대상 정보에 포함된 문자 부호 정보에 대한 음성 문의를 상기 사용자에게 발송하는 단계; 및 상기 사용자가 피드백한 음성 응답 텍스트의 사용자 의사 정보에 따라, 상기 검증 대상 정보의 정확성을 확인하 는 단계 를 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 10 청구항 1에 있어서, 상기 사용자 의사 정보 및/또는 상기 검증 대상 정보를 이미 명확해진 결과와 비교를 진행하여, 만약 일치하다 면, 상기 사용자가 거짓말 탐지를 통과한 것으로 확인하고, 그렇지 않으면 상기 사용자가 거짓말 탐지를 통과하 지 못한 것으로 확인하는 단계; 및 거짓말 탐지를 통과하지 못한 사용자가 피드백한 음성 응답 텍스트는 채택하지 않는 단계 를 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 11 청구항 1에 있어서, 상기 사용자가 음성 문의에 대해 피드백한 음성 응답에 대한 감정 인식, 사용자 속성 인식 및 현재 시간과 공간 의 정보에 대한 인식 중 적어도 하나를 진행하는 단계; 및인식 결과에 따라, 대응되는 화술을 적용하여 상기 사용자와 후속 음성 인터랙션을 진행하는 단계 를 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 12 청구항 1에 있어서, 음성 합성 모델을 이용하여 상기 음성 문의를 생성하는 단계를 더 포함하며, 상기 음성 합성 모델은 상담원이 사용자에게 정보 검증을 진행하는 음성 및 검증 대상이 속하는 대상 유형에 대 한 속성 정보 라벨 및/또는 시간 정보를 포함하는 대응되는 라벨 텍스트를 이용하여, 사전 훈련을 통해 얻은 것 인, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 13 청구항 1 내지 12 중 어느 한 항에 있어서, 상기 검증 대상 정보는 지리적 위치점 정보를 포함하는, 음성 인터랙션에 기반하는 정보 검증 방법. 청구항 14 시맨틱 이해 모델 훈련 방법으로서, 사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트 및 상기 음성 응답 텍스트의 사용자 의사 정보 및/또는 검증 대상 정보에 대한 라벨을 포함하는 훈련 데이터를 획득하는 단계; 및 훈련 데이터에서 시맨틱 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 시맨틱 이 해 모델의 입력으로 하고, 검증 대상 정보 및/또는 라벨링된 확인, 부인, 대답 또는 질문을 포함하는 사용자 의 사 정보를 상기 시맨틱 이해 모델의 목표 출력으로 하여, 상기 시맨틱 이해 모델을 훈련하는 단계를 포함하는, 시맨틱 이해 모델 훈련 방법. 청구항 15 청구항 14에 있어서, 상기 훈련 데이터를 획득하는 단계는, 동일한 음성 문의에 대해, 고빈도의 음성 응답 텍스트를 획득하여 수작업 라벨링을 진행한 후, 시드 샘플을 얻 는 단계; 시드 샘플을 이용하여 히스토리 데이터베이스 중의 대상 정보 일반화를 거친 음성 응답 텍스트에 대해 유사도 클러스터링을 진행하는 단계; 및 클러스터링 결과에 따라, 각 사용자 의사 정보에 대응되는 음성 응답 텍스트를 획득하여 훈련 데이터로 하는 단 계 를 포함하는, 시맨틱 이해 모델 훈련 방법. 청구항 16 청구항 14에 있어서, 상기 시맨틱 이해 모델은, 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예 측 레이어를 더 포함하며, 상기 임베딩 레이어는, 상기 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하 기 위한 것이고, 상기 타이밍 시퀀스 모델링 레이어는, 상기 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 상기 각 문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이며, 상기 매핑 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여매핑하고, 사용자 의사 정보를 얻기 위한 것이고, 상기 예측 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하 여 검증 대상 정보를 예측하기 위한 것인, 시맨틱 이해 모델 훈련 방법. 청구항 17 음성 인터랙션에 기반하는 정보 검증 장치로서, 사용자에게 정보 검증을 진행하기 위한 음성 문의에 대해 사용자가 피드백한 음성 응답 텍스트를 획득하며, 상 기 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 사전에 훈련하여 얻은 시맨 틱 이해 모델에 입력하여, 상기 시맨택 이해 모델에서 출력하는 검증 대상 정보 및/또는 확인, 부인, 대답 또는 질문을 포함하는 사용자 의사 정보를 획득하는 시맨틱 이해 모듈을 포함하는, 음성 인터랙션에 기반하는 정보 검증 장치. 청구항 18 청구항 17에 있어서, 상기 시맨틱 이해 모델은 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예측 레이어를 더 포함하며, 상기 임베딩 레이어는, 상기 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하 기 위한 것이고, 상기 타이밍 시퀀스 모델링 레이어는, 상기 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 상기 각 문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이며, 상기 매핑 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여 매핑하고 사용자 의사 정보를 얻기 위한 것이고, 상기 예측 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하 여 검증 대상 정보를 예측하기 위한 것인, 음성 인터랙션에 기반하는 정보 검증 장치. 청구항 19 청구항 17에 있어서, 상기 시맨틱 이해 모듈에 의해 상기 검증 대상 정보가 획득된다면, 상기 검증 대상 정보를 상기 검증 대상이 속 하는 분야 지식 베이스 중의 대상 정보에 링크하기 위한 링크 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 장치. 청구항 20 청구항 17에 있어서, 훈련 관정에서 상기 검증 대상이 속하는 대상 유형의 사전적 데이터를 도입하는 음향 모델과 언어 모델을 이용 하여, 사용자가 음성 문의에 대해 피드백한 음성 응답에 대해 음성 인식을 진행하여, 상기 음성 응답 텍스트를 얻기 위한 음성 인식 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 장치. 청구항 21 청구항 20에 있어서, 상담원이 사용자에게 정보 검증을 진행하는 음성 및 대응되는 라벨 텍스트를 이용하여, 훈련 데이터를 획득하고, 기존의 음향 모델의 학습율을 낮게 조절하고, 상기 훈련 데이터를 이용하여, 기존 음향 모델에 대해 모델 파라미터의 최적화를 진행하기 위한 음향 모델 훈련 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 장치. 청구항 22 청구항 17에 있어서,사수 차례의 대화 메커니즘을 기반으로, 상기 검증 대상 정보의 정확성을 사용자에게 확인하기 위한 대화 관리 모듈을 더 포함하며, 구체적으로, 대화 관리 모듈은, 상기 검증 대상 정보에 포함된 문자 부호 정보에 대한 음성 문의를 상기 사용자 에게 발송하고; 상기 사용자가 피드백한 음성 응답 텍스트의 사용자 의사 정보에 따라, 상기 검증 대상 정보의 정확성을 확인하는, 음성 인터랙션에 기반하는 정보 검증 장치. 청구항 23 청구항 17에 있어서, 상기 사용자 의사 정보 및/또는 상기 검증 대상 정보를 이미 명확해진 결과와 비교를 진행하며, 만약 일치하다 면, 상기 사용자가 거짓말 탐지를 통과한 것으로 확인하고; 그렇지 않으면 상기 사용자가 거짓말 탐지를 통과하 지 못한 것으로 확인하며, 거짓말 탐지를 통과하지 못한 사용자가 피드백한 음성 응답 텍스트는 채택하지 않는 대화 관리 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 장치. 청구항 24 청구항 17에 있어서, 상기 사용자가 음성 문의에 대해 피드백한 음성 응답에 대한 감정 인식, 사용자 속성 인식 및 현재 시간과 공간 의 정보에 대한 인식 중 적어도 하나를 진행하며, 인식 결과에 따라, 대응되는 화술을 적용하여 상기 사용자와 후속 음성 인터랙션을 진행하기 위한 대화 관리 모듈을 더 포함하는, 음성 인터랙션에 기반하는 정보 검증 장치. 청구항 25 청구항 17에 있어서, 음성 합성 모델을 이용하여 상기 음성 문의를 생성하기 위한 음성 합성 모듈을 더 포함하며, 상기 음성 합성 모 델은 상담원이 사용자에게 정보 검증을 진행하는 음성 및 검증 대상이 속하는 대상 유형에 대한 속성 정보 라벨 및/또는 시간 정보를 포함하는 대응되는 라벨 텍스트를 이용하여, 사전 훈련을 통해 얻은 것인, 음성 인터랙션 에 기반하는 정보 검증 장치. 청구항 26 시맨틱 이해 모델 훈련 장치로서, 사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트와 상기 음성 응답 텍스트의 사용자 의사 정보 및/또는 검증 대상 정보에 대한 라벨을 포함하는 훈련 데이터를 획득하기 위한 데이터 획득 모듈; 및 훈련 데이터에서 시맨틱 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 시맨틱 이 해 모델의 입력으로 하고, 검증 대상 정보 및/또는 라벨링된 확인, 부인, 대답 또는 질문을 포함하는 사용자 의 사 정보를 상기 시맨틱 이해 모델의 목표 출력으로 하여, 시맨틱 이해 모델을 훈련하기 위한 모델 훈련 모듈을 포함하는, 시맨틱 이해 모델 훈련 장치. 청구항 27 청구항 26에 있어서, 상기 데이터 획득 모듈은, 구체적으로, 동일한 음성 문의에 대해, 고빈도의 음성 응답 텍스트를 획득하여 수작업 라벨링을 진행한 후, 시드 샘플을 얻 으며, 시드 샘플을 이용하여 히스토리 데이터베이스 중의 대상 정보 일반화를 거친 음성 응답 텍스트에 대해 유사도 클러스터링을 진행하고, 클러스터링 결과에 따라, 각 사용자 의사 정보에 대응되는 음성 응답 텍스트를 획득하여 훈련 데이터로 하기 위 한 것인, 시맨틱 이해 모델 훈련 장치.청구항 28 청구항 26에 있어서, 상기 시맨틱 이해 모델은 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예측 레이어를 더 포함하며; 상기 임베딩 레이어는, 상기 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하 기 위한 것이고, 상기 타이밍 시퀀스 모델링 레이어는, 상기 임베딩 레이어에 대응되는 부호화 결과를 이용하여, 상기 각 문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이며, 상기 매핑 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여 매핑하고 사용자 의사 정보를 얻기 위한 것이고, 상기 예측 레이어는, 상기 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하 여 검증 대상 정보를 예측하기 위한 것인, 시맨틱 이해 모델 훈련 장치. 청구항 29 전자 기기로서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리 를 포함하되, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령어가 저장되고, 상기 명령 어는 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서로 하여금 청구항 1 내지 16 중 어느 한 항의 방법을 수행할 수 있게 하는 것을 특징으로 하는 전자 기기. 청구항 30 컴퓨터 명령어가 저장된 비휘발성 컴퓨터 판독가능 저장 매체로서, 컴퓨터로 하여금 청구항 1 내지 16 중 어느 한 항의 방법을 수행하게 하기 위한 컴퓨터 명령어가 저장된 것을 특징으로 하는, 비휘발성 컴퓨터 판독가능 저장 매체. 발명의 설명 기 술 분 야 [관련 출원에 대한 상호 참조] 본 출원은 출원일이 2020년 05월 22일이고, 출원번호가 2020104400691이며, 발명의 명칭이 \"음성 인터랙션에 기 반하는 정보 검증 방법, 장치, 기기 및 컴퓨터 저장 매체\"인 중국 특허 출원의 우선권을 주장한다."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 3, "content": "[기술분야]"}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 4, "content": "본 출원은 컴퓨터 기술분야에 관한 것으로, 특히 인공지능 기술분야에 관한 것이다."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지도 유형의 애플리케이션에서, 지리적 위치점은 지도상의 POI(Point Of Interest: 관심 지점), AOI(Area Of Interest: 관심 영역) 또는 더 큰 범위의 ROI(Region Of Interest: 관심 지역)일 수 있으며, 특히 학교, 은행, 음식점, 병원, 슈퍼마켓 등과 같은 사람들의 생활과 밀접히 연관되는 지점 일 수 있다. 한개의 지리적 위치는 일반적으로 이름, 좌표, 주소, 유형 및 전화번호 등 정보를 포함한다. 지리적 위치 정보는 일반적으로 현장 수 집, 인터넷 데이터 획득 및 사용자 보고 등 기법을 통하여 획득된다. 도시 건설의 급속한 발전과 기업 단위의 계획 변경으로 인해, 지리적 위치점 정보도 빈번하게 변화된다. 지리적 위치점 검색과 지도 네비게이션 등 애플리케이션은 모두 지리적 위치점 정보를 데이터 기반으로 하므로, 각 유형의 지도 애플리케이션의 정확성 및 사용가능성에 있어서 지리적 위치점 데이터의 정확성이 매우 중요하다. 지리적 위치점 데이터의 정확성을 향상시키기 위해, 지도유형의 애플리케이션은 기존의 지리적 위치점 정보 에 대해 검증을 진행해야 한다. 전술한 내용을 고려하여, 본 출원은 음성 인터랙션에 기반하는 정보 검증 방법, 장치, 기기 및 컴퓨터 저장 매 체를 제공한다. 첫번째 측면에서, 본 출원은, 사용자에게 정보 검증을 진행하기 위한 음성 문의에 대해 사용자가 피드백한 음성 응답 텍스트를 획득하는 단계; 및 상기 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 사전에 훈련하여 얻은 시 맨틱 이해 모델에 입력하여, 상기 시맨틱 이해 모델에서 출력하는 검증 대상 정보 및/또는 확인, 부인, 대답 또 는 질문을 포함하는 사용자 의사 정보를 획득하는 단계를 포함하는 음성 인터랙션에 기반하는 정보 검증 방법을 제공한다. 두번째 측면에서, 본 출원은, 사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트 및 상기 음성 응답 텍스트 의 사용자 의사 정보 및/또는 검증 대상 정보에 대한 라벨을 포함하는 훈련 데이터를 획득하는 단계; 및 훈련 데이터 중의 시맨틱 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 시맨틱 이 해 모델의 입력으로 하고, 검증 대상 정보 및/또는 라벨링된 확인, 부인, 대답 또는 질문을 포함하는 사용자 의 사 정보를 상기 시맨틱 이해 모델의 목표 출력으로 하여, 상기 시맨틱 이해 모델을 훈련하는 단계를 포함하는 시맨틱 이해 모델 훈련 방법을 제공한다. 세번째 측면에서, 본 출원은, 사용자에게 정보 검증을 진행하기 위한 음성 문의에 대해 사용자가 피드백한 음성 응답 텍스트를 획득하며, 상기 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 사전에 훈련하여 얻은 시맨틱 이해 모델에 입력하여, 상기 시맨택 이해 모델에서 출력하는 검증 대상 정보 및/ 또는 확인, 부인, 대답 또는 질문을 포함하는 사용자 의사 정보를 획득하는 시맨틱 이해 모듈을 포함하는 음성 인터랙션에 기반하는 정보 검증 장치를 제공한다. 네번째 측면에서, 본 출원은 사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트와 상기 음성 응답 텍스트의 사용자 의사 정보 및/또는 검증 대상 정보에 대한 라벨을 포함하는 훈련 데이터를 획득하기 위한 데이터 획득 모듈; 및 훈련 데이터 중의 시맨틱 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 시맨틱 이 해 모델의 입력으로 하고, 검증 대상 정보 및/또는 라벨링된 확인, 부인, 대답 또는 질문을 포함하는 사용자 의 사 정보를 상기 시맨틱 이해 모델의 목표 출력으로 하여, 시맨틱 이해 모델을 훈련하기 위한 모델 훈련 모듈을 포함하는 시맨틱 이해 모델 훈련 장치를 제공한다. 다섯번째 측면에서, 본 출원은, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리를 포함하되, 상기 메모리에는 상기 적어도 하나의 상프로세서에 의해 실행 가능한 명령어가 저장되고, 상기 명령어는 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서로 하여금 상기 어느 한 항의 방법을 수 행할 수 있게 하는 전자 기기를 제공한다. 여섯번째 측면에서, 본 출원은, 컴퓨터로 하여금 상기 어느 한 항의 방법을 수행하게 하기 위한 컴퓨터 명령어 가 저장된 비휘발성 컴퓨터 판독가능 저장 매체를 제공한다. 상기 기술방안으로부터 알 수 있는 바와 같이, 본 출원에 의해 제공되는 방법과 장치를 통해, 사용자가 음성 문 의에 대해 피드백한 음성 응답 텍스트에 대해 시맨틱 이해를 진행하여, 사용자 의사 정보 및/또는 검증 대상 정 보를 획득함으로써, 자동 정보 검증을 실현할 수 있다. 아래 구체적인 실시예와 결합하여 상기 선택적인 형태에 의해 구비되는 기타 효과에 대해 설명한다."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 도면을 결합하여 본 출원의 예시적인 실시예에 대해 설명하기로 한다. 이해를 돕기 위해, 상기 설명 에는 본 출원 실시예의 다양한 디테일을 포함하며, 이를 오직 예시적인 것으로 간주하여야 한다. 따라서, 당업 자는 본 출원의 범위 및 사상을 벗어나는 것이 없이, 여기에서 설명되는 실시예에 대해 다양한 변경 및 수정을 진행할 수 있음을 인식하여야 한다. 마찬가지로, 명확하고 간명한 설명을 위해, 아래의 설명에서 공지의 기능 및 구조에 대한 설명은 생략한다. 현재 지리적 위치점 정보에 대한 검증에는, 일반적으로 현장 수집 및 상담원이 전화하여 검증하는 방법이 채택 된다. 현장 수집 검증은 지도 정보 수집자가 지리적 위치점 현장에 도착하여, 탐사 측량, 촬영, 문의 등 방법을 통해 지리적 위치점 정보에 대해 검증을 진행한다. 현장 수집 검증 방법은 초기 비정보화 시대의 지리 정보 건 설에 보편적으로 사용되었지만, 대량의 인력과 물력을 소모해야 함으로, 효율이 낮을 뿐만 아니라 작업자에 대 한 전문능력 요구도 존재하여, 대량 데이터의 작업에 적합하지 않으며, 현재는 기본적으로 버려졌다. 상담원이 전화하여 검증하는 것은, 상담원이 지리적 위치점에 있는 전화번호로 전화를 걸어 인공적으로 대화를 진행하여 문의하는 방법을 통해 정보를 검증하는 것을 말한다. 검증자는 현장에 가지 않고도 전화를 통해 정보 피드백을 획득할 수 있다. 상담원은 사용자와의 직접적인 커뮤니케이션을 통해, 더 편리하게 정확한 정보를 획 득한다. 동시에, 해당 방법은 조작에 대한 요구 조건이 낮아, 상담원의 전문 능력이 특별히 요구되지 않는다. 예를 들면, 상담원은 기존 정보를 기반으로 해당 지리적 위치점의 명칭, 주소, 영업시간 등 속성정보를 문의하 고, 상대방의 피드백을 통해 해당 지리적 위치점의 각 정보의 정확 여부를 표기함으로써, 업데이트를 진행할 수 있다. 그러나, 상담원이 전화하여 검증하는 방법은, 인력이 대량으로 참여해야 함으로, 인건비가 높고 효율이 낮으며, 하루에 인당 100건 내지 200건만 검증할 수 있다. 또한, 사람이 쉽게 피곤해지고, 감정적으로 되기 때문에 장기 간 안정적인 작업을 보장하기 어렵다. 이를 고려하여, 본 출원은 음성 인터랙션에 기반하는 정보 검증 방법을 제공한다. 도 1에서 도시된 바와 같이, 상기 방법은 주요하게 아래와 같은 단계를 포함한다: 단계에서, 사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트를 획득하며, 상기 음성 문의는 사용자에 게 정보를 검증하기 위한 것이다. 단계에서, 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 사전에 훈련하 여 얻은 시맨틱 이해 모델에 입력하여, 시맨틱 이해 모델에서 출력하는 사용자 의사 정보 및/또는 검증 대상 정 보를 획득한다. 여기서, 사용자 의사 정보는 확인, 부인, 대답 또는 질문을 포함할 수 있다. 확인은 음성 문의로 검증하는 정보 에 대한 사용자의 확인을 나타내고, 부인은 음성 문의로 검증하는 정보에 대한 사용자의 부인을 나타내며, 대답 은 음성 문의로 검증하는 정보에 대한 사용자의 대답을 나타내고, 질문은 음성 문의로 검증하는 정보에 대한 사 용자의 질문을 나타낸다. 일반적으로, 부인과 대답 의사인 경우에, 상기 음성 응답 텍스트에는 사용자가 제공하 는 검증 대상 정보도 포함된다. 물론, 음성 응답 텍스트에는 사용자 의사가 포함되지 않고, 검증 대상 정보만포함될 수도 있다. 검증 대상 정보가 획득된 경우, 해당 검증 대상 정보를 저장하거나 또는 해당 검증 대상 정보를 이용하여 이미 저장된 정보에 대해 업데이트를 진행할 수 있다. 사용자 의사 정보가 획득된 경우, 사용자 의사 정보에 따라 검 증 대상 정보를 추측하여 저장하거나 또는 추측된 검증 대상 정보를 이용하여 이미 저장된 정보에 대해 업데이 트를 진행할 수 있다. 예를 들면, 음성 문의가 \"행복(幸福) 슈퍼마켓이 맞는가요\"이고, 사용자가 피드백한 음성 응답 텍스트가 \"네, 여기가 행복 슈퍼마켓입니다\"이면, 검증된 지리적 위치점의 명칭이 \"행복 슈퍼마켓\"임이 확인된다. 또 예를 들면, 음성 문의가 \"행복 슈퍼마켓이 맞는가요\"이고, 사용자가 피드백한 음성 응답 텍스트가 \"네\"이면, 검증된 지리적 위치점의 명칭을 \"행복 슈퍼마켓\"으로 추측한다. 또 예를 들면, 음성 문의가 \"행복 슈퍼마켓이 맞는가요\"이고, 사용자가 피드백한 음성 응답 텍스트가 \"아니요, 여기는 신부(新富) 슈퍼마켓입니다\"이면, 검증된 지리적 위치점의 명칭이 \"신부 슈퍼마켓\"임이 확인된다. 혹은 더 추가적으로, 지리적 위치점 링크 메커니즘 및/또는 추가적인 대화 등을 통해, 검증된 지리적 위치점의 명칭 이 \"행복 슈퍼마켓\"이 맞는지 그 여부를 확인한다. 지리적 위치점 링크 메커니즘에 관련하여 후속 실시예에서 설명될 것이다. 또 예를 들면, 음성 문의가 \"행복 슈퍼마켓이 맞는가요\"이고, 사용자가 피드백한 음성 응답 텍스트가 \"아니요\" 이면, 추가적으로 \"그럼 어디신지요\"라고 음성 문의를 진행하여 검증된 지리적 위치점의 명칭을 확인할 필요가 있다. 사용자가 추가로 \"여기는 신부 슈퍼마켓입니다\"라고 피드백하면, 사용자 의사가 \"대답\"이고, 검증된 지리 적 위치점의 명칭이 \"신부 슈퍼마켓\"인 것으로 인식된다. 또한, 유의해야 할 것은, 본 출원에 언급된 검증 대상은 임의 분야의 검증 대상일 수 있으며, 예를 들면, 지도 유형의 애플리케이션에서의 지리적 위치점, 전자상거래 분야의 거래 정보, 상품 정보 등 일 수 있다. 후속 실시 예에서 지도 유형의 애플리케이션의 지리적 위치점만을 예로 설명하며, 여기서, 대응되는 검증 대상 정보는 지 리적 위치점의 명칭, 유형, 주소, 영업시간, 연락처, 경영자 등 속성 정보를 포함하되, 이에 한정되지는 않는다. 본 출원에 의해 제공되는 방법에 대한 이해를 돕기 위해, 우선 본 출원에서 기반으로 하는 음성 인터랙션의 정 보 검증의 아키텍처에 대해 설명한다. 도 2에서 도시된 바와 같이, 본 출원의 음성 인터랙션 구조에서, 사용자 가 본 출원의 실시예에서 제공하는 음성 인터랙션의 정보 검증 장치(스마트 검증 장치로 약칭함)와 통신 연결을 세운 후, 스마트 검증 장치에 의해 통신 연결을 통해 사용자와 음성 인터랙션을 진행함으로써, 정보 검증을 진 행하는 것을 실현할 수 있다. 예를 들면, 전화를 통해 사용자에게 정보 검증을 진행할 수 있고, 네트워크 음성 통화를 통해 사용자에게 정보 검증을 진행할 수 있으며, 네트워크 음성 메세지를 통해 사용자에게 정보 검증을 진행할 수 있다. 스마트 검증 장치는 우선 화술 라이브러리를 이용하여 자연 언어를 생성하고, 생성된 자연 언어 텍스트는 음성 합성을 거쳐 음성을 생성하며, 네트워크를 통해 사용자에게 방송한다. 이 음성은 일반적으로 음성 문의이다. 사 용자는 해당 음성 문의를 들은 후, 해당 음성 문의에 대해 음성 응답을 피드백하여 네트워크를 통해 스마트 검 증 장치에 제공할 수 있다. 스마트 검증 장치는 음성 인식을 진행한 후, 음성 응답 텍스트를 획득한다. 그리고 이 음성 응답 텍스트에 대해 시맨틱 이해를 진행하여 구조적 정보를 추출한다. 본 출원의 실시예에서, 상기 구 조적 정보는 검증 대상 정보일 수 있다. 추가적으로, 시맨틱 이해의 결과를 기반으로 대화 관리를 추가로 진행 할 수 있다. 대화 관리에서, 업무 로직을 호출하고, 추출된 구조적 정보를 이용하여 지리적 위치점 데이터베이 스를 업데이트한다. 다른 일 측면으로, 정보 검증이 완성될 때까지 순환적으로 자연 언어를 계속하여 생성할 수 있다. 아래, 상기 스마트 검증 장치가 실행하는 각 부분의 처리에 대해 상세하게 설명한다. 음성 인식 처리 소리는 본질적으로 파, 즉 음파이다. 이러한 파는 신호로 처리될 수 있으므로, 음성 인식 처리는 실질적으로 시 간에 따라 재생되는 신호 시퀸스를 처리한 후, 텍스트 시퀸스를 출력하는 것이다. 간략하게 말하면, 음성 클립 입력을 텍스트 출력으로 변환하는 과정이 바로 음성 인식이다. 음성 인식 처리 과정에서는 주로 음향 모델과 언 어 모델에 의존한다. 음향 모델 이전에, 먼저 음성(본 실시예에서 주로 사용자에 의해 피드백되는 음성 응답임)에 대해 전처리와 특 징 추출을 진행한다. 현실에서, 하이파이이고 무노이즈인 음성은 아주 얻기 어렵다. 우리가 실제로 획득하는 음 성 데이터는 모두 다소 노이즈가 존재하므로, 본격적으로 음향 모델에 진입하기 전에, 우리는 노이즈 제거와 채 널 보강 등 전처리 기술을 통해, 신호를 시간 영역(time domain)에서 주파수 영역으로 변환한 후, 음향 모델을 위해 유효한 특성 벡터를 추출할 필요가 있다. 그 다음, 음향 모델에서 전처리 부분에서 획득한 특성 벡터를 음 향 모델 스코어로 변환하는 동시에, 언어 모델은 한개의 언어 모델 스코어를 얻는다. 마지막으로 복호 검색 단 계에서 음향 모델 스코어와 언어 모델 스코어를 통합하여, 스코어가 가장 높은 워드 시퀸스를 최종 인식 결과로 한다. 이것이 바로 음성 인식의 일반적인 원리이다. 음성 신호는 다양성을 가지고 있으며, 서로 다른 발성자(목소리), 태도(스타일, 환경), 콘텍스트 내용 등은 동 일한 단어의 음성 신호의 표현을 천차만별하게 할 수 있다. 한 사람이 동일한 말을 한다고 하더라도, 두번의 음 성 신호가 동일하다고는 보장하지 못한다. 어떻게 하면 모델을 이용하여 음성 신호의 진정한 의미를 표현하고 정확한 텍스트로 변환할 수 있는지는 매우 큰 도전이다. 조사하고 연구한 결과, 지리적 위치점 검증 시나리오에 관련된 화술과 사용자의 피드백 내용이 상대적으로 집중되는 것을 발견하였다. 음성 인식 결과 오류율은 비교적 높지만, 문제점이 비교적 집중적이며, 기본적으로 모두 지리 위치점 명칭에 대한 인식의 오류이다. 본 출원 실시예에서, 음향 모델과 언어 모델을 이용하여, 사용자가 음성 문의에 대해 피드백한 음성 응답에 대 해 음성 인식을 진행하여, 음성 응답 텍스트를 얻는다. 여기서, 음향 모델과 언어 모델은 훈련 과정에서 지리적 위치점의 사전 데이터가 도입된다. 우선 음향 모델을 설명하면, 음향 모델은 발성에 대한 모델링으로 이해할 수 있다. 음향 모델은 음성 입력을 음 향 표현의 출력으로 변환할 수 있다. 더욱 정확하게 말하면, 음성이 어떤 음향 부호에 속하는 확률을 제공하는 것이다. 영어에서 이런 음향 부호는 음절(syllable) 또는 더 작은 입상도의 음소(phoneme)일 수 있고, 중국어에 서 이런 음향 부호는 성모/운모 또는 입상도가 영어와 동일하게 작은 음소일 수 있다. 본 출원에서 fine-tuning(미세 조정) 기법을 기반으로 음향 모델에 대해 지향성 최적화를 진행한다. 도 3에서 도시된 바와 같이, 구체적으로，아래와 같은 단계를 포함할 수 있다. 단계에서, 상담원이 사용자에게 정보 검증을 진행하는 음성 및 대응되는 라벨 텍스트를 이용하여, 훈련 데 이터를 획득한다. 본 실시예에서, 상담원이 사용자에게 정보 검증을 진행하는 음성을 이용하여 음성 인식을 진행하며, 이와 동시 에 그 중의 지리적 위치점의 명칭에 대해 위치확인하여, 정확한 텍스트로 정정하여 수작업으로 라벨링함으로써, \"음성-텍스트\"쌍을 형성한 후, 텍스트에 대응되는 음소 정보를 라벨링하고 이를 훈련 데이터로 한다. 단계에서, 훈련 데이터를 이용하여, 기존의 음향 모델에 대해 모델 파라미터의 최적화를 진행한다. 훈련 집합이 이라고 가정한다면, 훈련 샘플이 N개 있고, 는 번째 음성 샘 플이며, 는 대응되는 음소임을 의미한다. 한개의 음성 샘플의 입력은 한개의 시퀸스이고, 출력된 음소 정보도 한개의 시퀸스이다. 본 출원은 음향 모델에 적용되는 구조에 대해 제한하지 않는다. 예를 들면, 도 4에 도시된 바와 같이, bi- LSTM(Bi-directional Long Short-Term Memory，양방향 장단기 메모리)+CTC(Connectionist temporal classification，타이밍 시퀸스 분류)와 같은 모델 구조를 적용할 수 있다. 훈련 목표는 CTC에서 출력된 음소 시퀸스가 훈련 샘플 중 대응되는 음소 라벨에 부합되는 것이다. 훈련 목표를 이용하여 손실 함수를 구축하고, 손실 함수의 결과에 따라 모델 파라미터를 최적화할 수 있다. 현재 이미 아주 좋은 음향 모델이 있기 때문에, 특정 분야에 대해서만 개선 여지가 있다. 따라서, 지리적 위치점의 경우, 중점 적으로, 훈련 데이터에서 지리적 위치점이 포함된 음성과 이에 대한 라벨을 대상으로 한다. 따라서, 해당 부분 의 훈련 데이터를 이용하여 미세 조정(fine-tunning)만 진행할 수 있다. 즉, 기존의 음향 모델의 모델 파라미터 를 기반으로, 해당 부분의 훈련 데이터를 이용하여 모델 파라미터의 최적화를 진행한다. 기존의 음향 모델의 가 중치는 이미 평활화되었기 때문에 이들을 왜곡시킬 필요가 없으며, 훈련 과정에서 기존의 음향 모델의 학습율을 낮게 조절한다. 언어 모델의 경우, 그 역할은 동음 및 근사음의 문제를 제거하는 것으로 이해할 수 있다. 음향 모델에서 음소 시퀸스를 제공한 후, 후보 텍스트 시퀸스에서 확률이 가장 큰 문자열 시퀸스를 찾아낸다. 본 출원에서, 언어 모 델에서 훈련 과정에서 사용되는 훈련 샘플은 지리적 위치점 사전을 이용하여 데이터를 보강하고, 순환 신경망(Recurrent Neural Network, RNN)과 같은 모델 등을 이용하여 음성 모델의 훈련을 진행할 수 있다. 여기에서 더 이상 설명을 진행하지 않는다. 상기 기법을 이용한 처리를 통해, 음성 인식 효과가 크게 향상된다. 특히, 약간 저빈도의 지리적 위치점의 명칭 에 대한 인식 정확률이 크게 향상된다. 시맨틱의 이해 시맨틱 이해의 목표는 텍스트 정보를 기계에 의해 처리될 수 있는 시맨틱 표현으로 변환하는 것이며, 일반적으 로 구조적 정보로 구현된다. 동일한 의미에는 여러가지 서로 다른 표현 방법이 있으므로, 기계의 경우, 한 문장 중 단어마다의 정확한 뜻을 이해하는 것이 중요하지 않고, 해당 문장가 표현하는 의미를 이해하는 것이 중요하 다. 예를 들면, \"우리집은 행복 슈퍼마켓입니다\", \"우리집 가게의 이름은 행복 슈퍼마켓입니다\", \"우리집의 가 게명은 행복 슈퍼마켓입니다\"등은 모두 한가지 의미를 표현하며, 즉 사용자의 가게 이름은 \"행복 슈퍼마켓\"이므 로, 그 중의 구조적 정보\"행복 슈퍼마켓\"을 인식해내야 한다. 본 출원의 실시예에서, 사용자의 음성 응답 텍스트의 경우, 주로 그 중에서 사용자 의사 정보 및/또는 검증 대 상 정보를 인식한다. 여기에서 두가지 정보에 대한 인식을 예로 든다. 해당 부분의 실현은 바로 도 1에서 설명 된 내용이다. 즉 상기 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 사전에 훈련하여 얻은 시맨틱 이해 모델에 입력하고, 시맨틱 이해 모델에서 출력하는 사용자 의사 정보 및/또는 검증 대상 정보를 획득한다. 본 출원의 실시예에 의해 제공되는 시맨틱 이해 모델은 임베딩 레이어, 타이밍 시퀀스 모델링 레이어, 매핑 레 이어 및 예측 레이어를 포함할 수 있다. 도 5는 본 출원의 실시예에 의해 제공되는 시맨틱 이해 모델의 원리도 이다. 여기서, 임베딩 레이어는 도면에서 워드 임베딩스(Word Embeddings)로 표시되며, 이는 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대한 부호화를 진행하기 위한 것이다. 본 출원에서, 한자의 경우, 사용되는 발음 표시 정보는 병음일 수 있고, 다른 형식의 발음 표시 정보를 사용할 수도 있다. 도 5에서는 병음을 일례로 하였으며, 동음 단어로 인해 음성 인식이 정확하지 않는 문제를 효과적으로 해소할 수 있도록, 각 문자 부호의 병음에 대해 부호화를 진행함으로써, 시맨틱 이해 시, 음성 인식 결과가 정확하지 않아 도 사용자 의사 정보 및 검증 대상 정보를 정확하게 인식할 수 있다. 타이밍 시퀀스 모델링 레이어는, 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 각 문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이다. 도 5에서는 Bi-LSTM을 예로 한다. 매핑 레이어는, 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터(Hidden Vector)의 맥스 풀링(Max Pooling) 결과를 이용하여 매핑하고 사용자 의사 정보를 얻기 위한 것이다. 도 5에서 매핑 레이어는 소프트맥스 (Softmax)를 예로 한다. 예측 레이어는, 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하여, 검증 대 상 정보를 예측하기 위한 것이다. 도 5에서는 예측 레이어의 실현은 Softmax + CRF(조건부 랜덤 필드) 레이어를 예로 한다. 여기서, 매핑 레이어와 예측 레이어는 각각 사용자 의사 인식 태스크와 검증 대상 정보 예측 태스크이며, 그 중 한가지만 실현한다면, 매핑 레이어와 예측 레이어 중 하나만 사용하면 된다. 사용자가 입력하는 문장 이 설정된다면, 여기에서 는 문장 중 제i번째 문자 부호를 의미하고, T는 문장의 길이를 의미한다. 단어마다에 사용되는 단어 벡터는 로 표시된다. 입력 시퀸스가 이고, 예측 레이어의 출력 시퀸스는 로 표시된다고 가정한다. Bi-LSTM 레이어는 순방향 및 역방향의 출력에 대해 접합 기법을 적용한다. 따라서, 가 입력되면, 대응되는 은 닉 레이어의 출력 의 표현식은 다음과 같다: 예측 레이어의 출력 와 매핑 레이어의 출력 는 각각 다음 수학식과 같다."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "그 중, 는 은닉 벡터에 대한 맥스 풀링의 결과이며, 즉 다음 수학식과 같다."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": ", , 및 는 모델 파라미터이다. 도 5에서 볼 수 있는 것과 같이, 음성 인식 결과 \" (부대요( , 중국 어 발음: )，우리는 영락(永樂) 슈퍼마켓 입니다)\"의 경우, 각 문자 부호와 각 문자 부호의 오 디오에 대해 임베딩(Embedding)을 진행한 후, Bi-LSTM을 거쳐 은닉 벡터를 출력하며, 매핑 레이어는 은닉 벡터 의 맥스 풀링 결과를 이용하여 매핑하고 사용자 의사 정보가 부정(도면에서 \"deny\"(부정)로 표시됨)임을 얻는다. 예측 레이어는 각 타이밍 시퀀스의 은닉 벡터를 이용하여 예측을 진행하여, POI(관심지점) 명칭이 \"영 락 슈퍼마켓\"임을 얻는다. 도면에서, CRF(조건부 랜덤 필드)에서 출력하는 각 문자 부호의 태그에서, B_POI는 POI의 시작 문자 부호를 의미하고, I_POI는 POI의 중간 문자 부호를 의미하며, E_POI는 POI의 끝 문자 부호를 의미한다. 혁신적으로 각 문자 부호의 병음의 입력을 도입함으로써, 음성 인식 결과에 오류가 발생하더라도, 즉 \" (아니오( , 중국어 발음: )\"를 \" (부대요( , 중국어 발음: ))\"로 오류적으로 인식하더라도, 해당 시맨틱 이해 모델을 기반으로 사용자 의사가 부정임을 정 확하게 인식할 수 있음을 알 수 있다. 도 6은 본 출원의 실시예에 의해 제공되는 시맨틱 이해 모델의 훈련 방법의 흐름도이다. 도 6에서 도시된 바와 같이, 상기 방법은 아래와 같은 단계를 포함할 수 있다: 단계에서, 훈련 데이터를 획득하며, 훈련 데이터는 사용자가 음성 문의에 대해 피드백한 음성 응답 텍스트 와 음성 응답 텍스트의 사용자 의사 정보 및/또는 검증 대상 정보에 대한 라벨을 포함한다. 데이터에 대한 수작업 라벨링은 그 비용이 크고 효율이 낮으므로, 여기서, 기계를 통해 수작업에 보조를 제공함 으로써 데이터를 라벨링하는 것을 고려한다. 이런 경우에, 사용자가 표현하는 문장 포맷이 모두 유사하고, 오히 려 더 큰 원인은 노이즈로 인해, 음성 인식 등 문제로 인해 다양한 오류적인 인식 결과를 가져온다. 이런 특색 의 데이터 분포에 대해, 본 출원의 실시예에서 준지도의 방법을 제공하며, 구체적인 방법은 다음과 같다: 우선, 동일한 음성 문의에 대해, 고빈도의 음성 응답 텍스트를 획득하여 수작업 라벨링을 진행한 후, 시드 샘플 을 얻는다. 즉, 동일한 문제마다, 예를 들어 \"그곳은 *** 인가요?\"인 경우, 우리는 우선 고빈도의 사용자 응답 텍스트에 대 해 라벨링을 진행하며, 해당 라벨링에는 예를 들어 POI 명칭과 같은 지리적 위치점 정보에 대한 라벨링을 포함 한다. 다음으로, 시드 샘플을 이용하여 히스토리 데이터베이스의 대상 정보중 일반화를 거친 음성 응답 텍스트에 대해 유사도 클러스터링을 진행한다. 예를 들면, 라벨링 결과에 따라 POI 명칭을 일반화 및 클러스터링을 진행한다: 일반화 결과 \"맞습니다, 우리집이 바로 [POI-NAME]입니다\"에 대응되는 라벨은 confirm(POI_NAME)이다. 일반화 결과 \"네, [POI-NAME]이 맞습니다\"에 대응되는 라벨은 confirm(POI_NAME)이다. 일반화 결과 \"네, 맞습니다\"에 대응되는 라벨은 confirm()이다. 일반화 결과 \"우리집은 이름을 [POI-NAME]으로 변경하였습니다\"에 대응되는 라벨은 deny(POI_NAME)이다. 클러스터링 과정에서, 유사도의 계산은 단어 벡터, 발음 유사도 등 특성을 도입할 수 있다. 마지막으로, 클러스터링 결과에 따라 각 사용자 의사 정보에 대응되는 음성 응답 텍스트를 획득하여 훈련 데이 터로 한다. 단계에서, 훈련 데이터에서 시맨틱 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정 보를 시맨틱 이해 모델의 입력으로 하고, 라벨링된 사용자 의사 정보 및/또는 검증 대상 정보를 상기 시맨틱 이 해 모델의 목표 출력으로 하여, 시맨틱 이해 모델을 훈련한다. 시맨틱 이해 모델의 구조는 여전히 도 5에서 도시된 바와 같다. 상기 시맨틱 이해 모델은 사용자 의사 인식 및 검증 대상 정보 인식 이 두개의 태스크를 포함하므로, 상기 두개의 태스크는 별도로 훈련될 수 있고, 연합하여 훈련될 수도 있다. 두개의 태스크 사이에는 비교적 큰 연관성이 존재하므로, 연합 훈련의 효과가 더 좋으며, 연 합 훈련 기법이 바람직하다. 사용자 의사 인식의 손실 함수는 크로스 엔트로피 형식을 적용할 수 있고, 다음과 같이 표현할 수 있다."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 는 대응되는 실제 사용자 의사를 의미한다. 검증 대상 정보 인식은 CRF의 손실 함수를 그대로 다중활용할 수 있다. CRF 손실 함수는 실제 경로의 스코어 및 모든 경로의 총 스코어 이 두 부분으로 구성된다. 실제 경로의 스코어는 모든 경로에서 스코어가 가장 높아야 한다."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "경로의 스코어 계산식은 다음과 같다: 상기 계산식에서 문자 부호의 윗첨자는 대응되는 입력 시퀸스 중의 제 번째 문자 부호를 의미하고, 문자 부호의 아래첨자는 상기 제 번째 문자 부호의 제 번째 타이밍 시퀀스를 의미한다. 는 전이 행렬이며, 태그가 에서 로 전이한 전이 스코어 값을 의미한다. 시퀸스마다의 스코어는 상기의 계산식과 같이 계산할 수 있고, 정확한 태그 시퀸스의 스코어를 가장 크게 만들 기만 하면 된다. 따라서, 손실 함수가 다음과 같이 정의된다."}
{"patent_id": "10-2021-7019206", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서, , y'는 모든 가능한 시퀸스이다. 다음으로, 상기 두개의 손실 함수를 이용하여 연합 손실 함수를 계산하고, 연합 손실 함수는 상기 와 에 대해 가중처리한 후 얻을 수 있다. 상기 처리를 거친 후, 시맨틱 이해의 정확성이 향상된다. 하지만 검증 대상 정보의 경우, 여전히 정확하지 않을 수 있다. 예를 들면, POI 명칭 \"永 超市(영락(永樂) 슈퍼마켓)\"은 정확할 확률이 크다. 하지만, 어떠한 시간 과 공간의 시나리오에서는 \"勇 超市(용락(勇樂) 슈퍼마켓)\", \"湧 超市(용락(湧樂) 슈퍼마켓)\" 등일 수 있다. 이런 경우를 해결하기 위해, 검증 대상 정보를 검증 대상이 속하는 분야의 지식 베이스 중의 대상 정보에 추가적으로 링크할 수 있다. 예를 들면, POI 명칭을 POI 지식 베이스 중의 POI 명칭에 링크할 수 있다. 구체적으로, 분야 지식 베이스를 사전에 구축할 수 있고, 상기 지식 베이스는 명칭, 유형, 주소, 좌표, 연락처 등을 포함하는 지리적 위치점 정보를 포함할 수 있다. 다음으로, 획득한 지리적 위치점 정보에 대해, 음성 유사 도, 텍스트 유사도, 속성 유사도 중의 적어도 한가지에 기반하여, 검증 대상 정보를 분야 지식 베이스에 분류함 으로써, 검증 대상이 분야 지식 베이스 중의 대상 정보에 링크되도록 한다. 만약 링크된 대상 정보가 결정된다 면, 결정된 대상 정보를 이용하여 검증 대상 정보를 업데이트한다. 여기서, 상기 분류 진행 시, 실제로 사전에 구축된 분류기를 이용하여, 상기 시맨틱 이해를 통해 결정된 검증 대상 정보에 대해 분류를 진행한다. 상기 분 류기에 의해 분류된 유형은 분야 지식 베이스 중의 각 기존 지리적 위치점이다. 즉 분류기는, 시맨틱 이해를 통 해 얻은 검증 대상 정보가 분야 지식 베이스 중의 각 기존 지리적 위치점에 속하는 확률을 계산하여, 상기 확률 에 따라 해당 검증 대상이 분야 지식 베이스 중의 기존 지리적 위치점에 링크되었는지를 확인하며, 만약 링크되 어 있다면, 구체적으로 어느 기존 지리적 위치점에 링크되었는지를 확인한다. 예를 들어, 도 7에서 도시된 바와 같이, 시맨틱 이해를 통해 얻은 \"永 超市(영락 슈퍼마켓)\"은, 사용자로부터 획득한 \"永 超市(영락(永樂) 슈퍼마켓)\"의 음성, 텍스트, 주소, 좌표 등 정보를 분야 지식 베이스 중의 각 기 존 지리적 위치점으로 분류한다. 만약 이를 \"勇 超市(용락(勇樂) 슈퍼마켓)\"으로 분류할 확률이 가장 높고, 사 전에 설정된 문턱값을 초과하는 것을 최종적으로 발견할 경우, 시맨틱 이해를 통해 얻은 \"永 超市(영락(永樂) 슈퍼마켓)\"을 \"勇 超市(용락(勇樂) 슈퍼마켓)\"으로 수정한다. 여기서, 분류 시 GBDT(Gradient Boosting Decision Tree, 그래디언트 부스팅 결정 트리) 알고리즘을 적용할 수 있다. 상기 링크 처리를 통해, 시맨틱 이해로 얻은 검증 대상 정보가 더욱 정확하도록 할 수 있다. 대화 관리 대화 관리는 시맨틱 이해 결과 및 대화 콘텍스트에 따라, 다음번의 응답을 결정하는 것을 말한다. 중점은 대화 상태를 유지하여 사용자와의 인터랙션을 결정함으로써, 최종적으로 정확한 검증 결과의 획득을 기대하는 것이다. 상기 시맨틱 이해의 과정을 거쳐, 정확한 결과를 인식할 수 있는 확률이 크다. 하지만, POI가 증가한다면, 절대 적인 정확성은 보장할 수 없다. 또한, 일부 시맨틱 이해가 적응하지 않는 경우도 있는 것으로 인해, 획득된 지 리적 위치점 정보가 정확하지 않다. 이를 바탕으로, 다수 차례의 대화에 기반하는 메커니즘을 도입하여, 사용자 에게 검증 대상의 정확성을 확인할 수 있다. 구체적으로, 시맨틱 이해를 통해 얻은 지리적 위치점의 명칭의 경우, 해당 지리적 위치점의 명칭에 포함된 문자 부호 정보에 대한 음성 문의를 사용자에게 발송하고, 사용자가 피드백한 음성 응답 텍스트를 근거로, 음성 인식 및 시맨틱 이해 등을 거쳐 사용자 의사 정보를 획득하며, 사용자 의사 정보에 따라, 상기 지리적 위치점의 명칭 의 정확성을 확인한다. 예를 들면, 상기 시맨틱 이해를 통해 지리적 위치점의 명칭 \"용락(勇樂) 슈퍼마켓\"을 얻으면, 이어서 사용자에 게 \"용감(勇敢)의 용(勇), 환락(歡樂)의 락(樂) 인가요\"라고 문의할 수 있다. 만약 사용자가 \"네\"라고 대답한다 면, 즉 사용자 의사는 긍정이면, 시맨틱 이해를 통해 얻은 지리적 위치점의 명칭의 정확성이 확인된다. 만약 사 용자가 \"아니오\"라고 대답한다면, 즉 사용자 의사는 부정이면, 시맨틱 이해를 통해 얻은 지리적 위치점의 명칭 이 틀린 것으로 확인한다. 사용자에게 추가로 문의하여 정확한 지리적 위치점의 명칭을 획득할 수 있다. 그 외에는, 사용자의 음성 응답에 대해 정확하게 인식할 수 있더라도, 많은 사용자는 불신뢰, 희롱 등 여러가지 원인으로 스마트 검증 장치를 고의적으로 속일 가능성이 있다. 이런 문제에 대하여, 본 출원에서는 거짓말 탐지 메커니즘을 도입한다. 여기서, 거짓말 탐지 메커니즘은 능동적 거짓말 탐지 메커니즘과 수동적 거짓말 탐지 메 커니즘을 포함할 수 있다. 여기서, 능동적 거짓말 탐지 메커니즘은 다음과 같은 내용을 포함한다: 결과를 이미 명확히 알고 있는 내용을 사용자에게 음성 문의하고, 사용자가 피드백한 음성 응답을 획득하며, 음성 인식과 시맨틱 이해를 진행한 후, 사용자 의사 정보 및 검증 대상 정보를 이미 명확해진 결과와 비교를 진행하며, 만약 일치하다면, 사용자가 거 짓말 탐지를 통과한 것으로 확인하고, 그렇지 않으면 사용자가 거짓말 탐지를 통과하지 못한 것으로 확인한다. 거짓말 탐지를 통과하지 못한 사용자가 피드백한 음성 응답 텍스트는 채택하지 않는다.다시 말하면, 결과를 모르는 내용을 사용자에게 음성 문의할 뿐만 아니라, 결과를 이미 명확히 알고 있는 내용 도 사용자에게 음성 문의한다. 결과를 이미 명확히 알고 있는 내용에 대한 사용자의 음성 응답을 통해 사용자의 거짓말 여부를 확인한다. 수동적 거짓말 탐지 메커니즘은 다음과 같은 내용을 포함한다: 사용자의 음성 응답의 감정, 서로 다른 문제에 대한 대답 지연, 동일 유형의 지리적 위치점의 빅 데이터 통계 결과를 기반으로, 사용자의 거짓말 여부를 인식 한다. 상기 거짓말 탐지 메커니즘을 통해, 사용자가 피드백한 내용의 정확성을 추가적으로 보장함으로써, 데이터 검증 의 정확성을 보장할 수 있다. 더 나아가, 본 출원은 사용자가 음성 문의에 대해 피드백한 음성 응답에 대한 감정 인식, 사용자 속성 인식 및 현재 시간과 공간의 정보에 대한 인식 등 중 적어도 하나를 진행하며, 인식 결과에 따라, 대응되는 화술을 적용 하여 사용자와 후속 음성 인터랙션을 진행할 수도 있다. 예를 들면, 저녁시간에는 사용자에게 \"좋은 저녁입니다\"라고 인사할 수 있고, 아침에는 사용자에게 \"좋은 아침입니다\"라고 인사할 수 있다. 여성인 경우, 사용자에게 \"미녀님, 안녕하세요\"라고 인사할 수 있다. 사용자가 이미 귀찮아할 경우, 좀 적게 문의할 수 있고, 사용자가 비교적 기쁜 기분일 경우, 좀 많이 문의할 수 있다. 이러한 방식을 통해, 서로 다른 상황에서 서로 다 른 사용자에 대해 서로 다른 화술을 적용하여, 보다 유연하고 인간적이며, 사용자가 전화를 끊는 비율을 감소하 고, 정보 검증의 리콜률을 향상할 수 있다. 음성 합성 사용자는 로봇이 아니고, 감정이 있으며, 자연스러운 음성 방송은 사용자의 협조 정도에 매우 결정적인 역할을 한다. 만약 음성 합성이 매우 나쁘면, 사용자는 전화를 바로 끊을 수 있어, 정보 검증의 정상적인 진행에 영향 을 끼친다. 음성 합성을 더욱 자연스럽게 하기 위해, 음성 합성 모델은 상담원이 사용자에게 정보 검증을 진행 하는 음성 및 대응되는 라벨 텍스트를 이용하여 사전에 훈련하고 얻을 수 있다. 라벨 텍스트는 검증 대상이 속 하는 대상 유형의 속성 정보 라벨 및/또는 시간 정보를 포함한다. 지리적 위치점 정보에 대한 검증의 경우, 시간 정보와 지리적 위치점 정보를 제외하고, 기타 화술은 기본적으로 모두 한정된 집합이다. 하지만, 기존의 음성 합성 서비스는 시간 정보와 지리적 위치점 정보에 대한 방송이 비 교적 딱딱하고, 표현이 자연스럽지 못하다. 따라서, 본 출원은 시간 정보와 지리적 위치점 정보에 대해 맞춤적 최적화를 진행한다. 상담원이 사용자에게 정보 검증을 진행하는 음성이 이미 히스토리에 대량으로 누적되었기 때문에, 소리가 아름 답고 발음이 똑똑한 상담원의 음성 데이터를 고품질 음성 데이터로 선택하여, 음성 인식과 시맨틱 이해를 통해, 고품질 음성 데이터를 텍스트로 변환하며, 이와 동시에 지리적 위치점 속성 정보와 시간 정보를 라벨링한다. 이 로써, 텍스트-음성 쌍이 생성되며, 훈련 데이터로 된다. 예를 들면: \"[행복(幸福) 슈퍼마켓]이 맞는가요\", 여기서 []로 표기된 내용에 대해 POI 명칭 라벨을 붙인다. \"그곳은 [2020년4월2일]에 개업했나요?\", 여기서 []로 표기된 내용에 대해 시간 라벨을 붙인다. 이러한 훈련 데이터를 통해 훈련된 음성 합성 모델은, 지리적 위치점 정보와 시간 정보의 음성 표현이 모두 사 람의 표현방식에 더 근접하여, 자연스럽고 유창하며, 아름답고 똑똑하여, 사용자의 만족도 및 협조 정도를 향상 시킨다. 이상은 본 출원에 의해 제공되는 방법에 대한 상세한 설명이다. 아래는 실시예를 결합하여 본 출원에 의해 제공 되는 장치에 대해 상세하게 설명한다. 도 8은 본 출원의 실시예에 의해 제공되는 음성 인터랙션에 기반하는 정보 검증 장치의 구성도이다. 도 8에서 도시된 바와 같이, 상기 장치는 시맨틱 이해 모듈을 포함할 수 있으며, 링크 모듈, 음성 인식 모듈 , 음향 모델 훈련 모듈, 대화 관리 모듈, 음성 합성 모듈을 더 포함할 수 있다. 여기서, 각 구 성 모듈의 주요 기능은 다음과 같다. 시맨틱 이해 모듈은, 사용자가 사용자에게 정보 검증을 진행하기 위한 음성 문의에 대해 피드백한 음성 응 답 텍스트를 획득하기 위한 것이며, 음성 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 사전에 훈련하여 얻은 시맨틱 이해 모델에 입력하여, 시맨택 이해 모델에서 출력하는 사용자 의사 정보 및/또는 검증 대상 정보를 획득한다. 여기서 사용자 의사 정보는 확인, 부인, 대답 또는 질문을 포함한다.여기서, 시맨틱 이해 모델은 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또는 예측 레이어를 더 포함한다. 임베딩 레이어는, 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하기 위한 것 이다. 타이밍 시퀀스 모델링 레이어는, 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 각 문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이다. 매핑 레이어는, 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여 매핑하고 사용자 의사 정보를 얻기 위한 것이다. 예측 레이어는, 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하여, 검증 대 상 정보를 예측하기 위한 것이다. 링크 모듈은, 시맨틱 이해 모듈에 의해 검증 대상 정보가 획득된다면, 검증 대상 정보를 검증 대상 정보가 속하는 분야 지식 베이스 중의 대상 정보에 링크하기 위한 것이다. 시맨틱 이해 모듈과 링크 모듈의 기능 및 실행하는 구체적인 동작은, 방법 실시예에서 시맨틱 이해에 관한 기재를 참조할 수 있고, 여기에서 반복하여 설명하지 않는다. 음성 인식 모듈은, 음향 모델과 언어 모델을 이용하여, 사용자가 음성 문의에 대해 피드백한 음성 응답에 대해 음성 인식을 진행하여, 음성 응답 텍스트를 얻기 위한 것이다. 여기서, 음향 모델과 언어 모델은 훈련 관 정에서 검증 대상이 속하는 대상 유형의 사전적인 데이터를 도입한다. 음향 모델 훈련 모듈은, 상담원이 사용자에게 정보 검증을 진행하는 음성 및 대응되는 라벨 텍스트를 이용 하여, 훈련 데이터를 획득하고, 훈련 데이터를 이용하여, 기존 음향 모델에 대해 모델 파라미터의 최적화를 진 행하기 위한 것이며, 여기서 기존의 음향 모델의 학습율을 낮게 조절한다. 음성 인식 모듈과 음향 모델 훈련 모듈의 기능 및 실행하는 구체적인 동작은, 방법 실시예에서 음성 인 식에 관한 기재를 참조할 수 있고, 여기에서 반복하여 설명하지 않는다. 대화 관리 모듈은, 다수 차례의 대화 메커니즘에 기반하여, 검증 대상 정보의 정확성을 사용자에게 확인하 기 위한 것이며, 구체적으로 다음과 같은 내용을 포함한다. 검증 대상 정보에 포함된 문자 부호 정보에 대한 음 성 문의를 사용자에게 발송하고, 사용자가 피드백한 음성 응답 텍스트의 사용자 의사 정보에 따라, 검증 대상 정보의 정확성을 확인한다. 대화 관리 모듈은, 사용자 의사 정보 및/또는 검증 대상 정보를 이미 명확해진 결과와 비교를 진행하며, 만 약 일치하다면, 사용자가 거짓말 탐지를 통과한 것으로 확인하고, 그렇지 않으면 사용자가 거짓말 탐지를 통과 하지 못한 것으로 확인한다. 거짓말 탐지를 통과하지 못한 사용자가 피드백한 음성 응답 텍스트는 채택하지 않 는다. 대화 관리 모듈은, 사용자가 음성 문의에 대해 피드백한 음성 응답에 대한 감정 인식, 사용자 속성 인식 및 현재 시간과 공간의 정보에 대한 인식 중 적어도 하나를 진행하며, 인식 결과에 따라, 대응되는 화술을 적용하 여 사용자와 후속 음성 인터랙션을 진행하기 위한 것이다. 대화 관리 모듈의 기능 및 실행하는 구체적인 동작은, 방법 실시예에서 대화 관리에 관한 기재를 참조할 수 있고, 여기에서 반복하여 설명하지 않는다. 음성 합성 모듈은, 음성 합성 모델을 이용하여 음성 문의를 생성하기 위한 것이다. 여기서, 음성 합성 모델 은 상담원이 사용자에게 정보 검증을 진행하는 음성 및 대응되는 라벨 텍스트를 이용하여 사전에 훈련하고 얻은 것이며, 라벨 텍스트는 검증 대상이 속하는 대상 유형에 대한 속성 정보 라벨 및/또는 시간 정보를 포함한다. 음성 합성 모듈의 기능 및 실행하는 구체적인 동작은, 방법 실시예에서 음성 합성에 관한 기재를 참조할 수 있고, 여기에서 반복하여 설명하지 않는다. 도 9는 본 출원의 실시예에 의해 제공되는 시맨틱 이해 모델 훈련 장치의 구성도이다. 도 9에서 도시된 바와 같 이, 상기 장치는 데이터 획득 모듈과 모델 훈련 모듈을 포함한다. 여기서, 각 구성 모듈의 주요 기능은 다음과 같다.데이터 획득 모듈은, 훈련 데이터를 획득하기 위한 것이다. 훈련 데이터는 사용자가 음성 문의에 대해 피드 백한 음성 응답 텍스트와 음성 응답 텍스트의 사용자 의사 정보 및/또는 검증 대상 정보에 대한 라벨을 포함한 다. 모델 훈련 모듈은, 훈련 데이터 중의 시맨틱 응답 텍스트의 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보를 시맨틱 이해 모델의 입력으로 하고, 라벨링된 사용자 의사 정보 및/또는 검증 대상 정보를 시맨틱 이해 모델의 목표 출력으로 하여, 시맨틱 이해 모델을 훈련하기 위한 것이다. 여기서, 사용자 의사 정보는 확인, 부인, 대답 또는 질문을 포함한다. 여기서, 발음 표시 정보는 중국어 병음을 포함하고, 기타 발음 표시 정보를 적용할 수도 있다. 구체적으로, 데이터 획득 모듈은, 동일한 음성 문의에 대해, 고빈도의 음성 응답 텍스트를 획득하여 수작업 라벨링을 진행한 후, 시드 샘플을 얻으며, 시드 샘플을 이용하여 히스토리 데이터베이스 중 대상 정보 일반화를 거친 음성 응답 텍스트에 대해 유사도 클러스터링을 진행하고, 클러스터링 결과에 따라 각 사용자 의사 정보에 대응되는 음성 응답 텍스트를 획득하여 훈련 데이터로 할 수 있다. 구체적으로, 시맨틱 이해 모델은 임베딩 레이어와 타이밍 시퀀스 모델링 레이어를 포함하고, 매핑 레이어 및/또 는 예측 레이어를 더 포함한다. 임베딩 레이어는, 각 문자 부호 및 각 문자 부호에 대응되는 발음 표시 정보에 대해 부호화를 진행하기 위한 것 이다. 타이밍 시퀀스 모델링 레이어는, 임베딩 레이어에 의한 대응되는 부호화 결과를 이용하여, 각 문자 부호 간의 시맨틱 의존 관계를 학습하기 위한 것이다. 매핑 레이어는, 타이밍 시퀀스 모델링 레이어에서 출력하는 은닉 벡터의 맥스 풀링 결과를 이용하여 매핑하고 사용자 의사 정보를 얻기 위한 것이다. 예측 레이어는, 타이밍 시퀀스 모델링 레이어에서 출력하는 각 타이밍 시퀀스의 은닉 벡터를 이용하여 검증 대 상 정보를 예측하기 위한 것이다. 본 출원의 실시예에 따라, 본 출원은 전자 기기와 판독 가능 저장 매체를 더 제공한다. 도 10에서 도시된 바와 같이, 본 출원 실시예 방법에 따른 전자 기기의 블록도이다. 전자 기기는 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크 스테이션, 개인 휴대 정보 단말기, 서버, 블레이드 서버, 메인 프레임 컴퓨터 및 기타 적합한 컴퓨터 등 다양한 형태의 디지털 컴퓨터를 의미한다. 전자 기기는 개인 디지털 프로세서, 셀룰러 전화, 스마트폰, 웨어러블 디바이스 및 기타 유형의 컴퓨팅 장치 등 다양한 형태의 이동 장치를 의미할 수도 있다. 본 문장에 개시된 부재, 이들의 연결과 관계 및 이들의 기능은 오직 예시일 뿐이고, 본 문장에서 설명 및/또는 요 구된 본 출원의 실현을 제한하는 것은 아니다. 도 10에서 도시된 바와 같이, 상기 전자 기기는 적어도 하나의 프로세서, 메모리 및 각 부재를 연 결하기 위한 인터페이스를 포함한다. 상기 인터페이스는 고속 인터페이스 및 저속 인터페이스를 포함한다. 각 부재는 서로 다른 버스를 이용하여 상호 연결되며, 또한 공동 메인보드에 장착되거나, 또는 수요에 따라 다른 방식으로 장착될 수 있다. 프로세서는 전자 기기 내에서 실행되는 명령어에 대해 처리할 수 있으며, 상기 명령 어는 외부 입력/출력 장치(예를 들면, 인터페이스에 커플링된 디스플레이 장치)에 그래픽 유저 인터페이스 (Graphical User Interface, GUI)의 그래픽 정보가 디스플레이되도록, 메모리내 또는 메모리상에 저장된 명령어 를 포함한다. 다른 일 실시형태에서, 만약 수요된다면, 다수의 프로세서 및/또는 다수의 버스를 다수의 메모리 와 함께 사용할 수 있다. 마찬가지로, 다수의 전자 기기를 연결할 수 있으며, 각 기기에서는 일부 필요한 동작 을 제공한다(예를 들면, 서버 어레이, 블레이드 서버 그룹 또는 멀티 프로세서 시스템으로 함). 도 10에서는 프 로세서가 하나인 것을 일례로 한다. 메모리는 본 출원에 의해 제공되는 비휘발성 컴퓨터 판독가능 저장 매체이다. 여기서, 상기 메모리에는 한개 이상 프로세서에 의해 실행 가능한 명령어가 저장되어, 상기 한개 이상 프로세서로 하여금 본 출원에 의해 제공되는 방법을 수행하게 한다. 본 출원의 비휘발성 컴퓨터 판독가능 저장 매체는 컴퓨터 명령어를 저장하고, 상기 컴퓨터 명령어는 컴퓨터로 하여금 본 출원에 의해 제공되는 방법을 수행하게 하기 위한 것이다. 메모리는 비휘발성 컴퓨터 판독가능 저장 매체로서, 비휘발성 소프트웨어 프로그램, 비휘발성 컴퓨터 실 행 가능 프로그램 및 모듈을 저장하는데 사용될 수 있으며, 예를 들면, 본 출원 실시예의 방법에 대응되는 프로 그램 명령어/모듈을 저장할 수 있다. 프로세서는 메모리에 저장된 비휘발성 소프트웨어 프로그램,명령어 및 모듈에 대한 실행을 통해, 서버의 다양한 기능 애플리케이션 및 데이터 처리를 실행한다. 즉, 상기 프로세서는 상기 방법 실시예의 방법을 실현한다. 메모리는 프로그램 저장 영역과 데이터 저장 영역을 포함할 수 있다. 여기서, 프로그램 저장 영역에는 오 에스(OS) 및 적어도 하나의 기능에 수요되는 애플리케이션이 저장될 수 있으며, 데이터 저장 영역에는 해당 전 자 기기의 사용에 의해 생성된 데이터 등이 저장될 수 있다. 또한, 메모리는 고속 랜덤 액세스 메모리 (RAM)를 포함할 수 있고, 비휘발성 메모리를 더 포함할 수 있으며, 예를 들면, 적어도 하나의 자기 디스크 저장 장치, 플래시 메모리 장치 또는 기타 비휘발성 솔리드 스테이트 저장 장치를 포함할 수 있다. 일부 실시예에서, 메모리는 프로세서에 상대적으로 원격 설치되는 메모리를 선택적으로 포함할 수 있다. 이러한 원격 메모리는 네트워크를 통해 해당 전자 기기에 연결될 수 있다. 상기 네트워크의 실시예는 인터넷, 인트라넷, 근 거리 통신망, 이동 통신망 및 그 조합을 포함하지만 이에 제한되는 것은 아니다. 상기 전자 기기는 입력 장치 및 출력 장치를 더 포함할 수 있다. 프로세서, 메모리, 입력 장치 및 출력 장치는 버스 또는 기타 방식을 통해 연결될 수 있다. 도 10에서는 버스를 통한 연결을 예로 든다. 입력 장치는 입력되는 숫자 및 문자 부호 정보를 수신하고, 해당 전자 기기의 사용자 설정 및 기능 제어 와 관련된 키 신호 입력을 생성할 수 있으며, 터치 스크린, 키패드, 마우스, 트랙 패드, 터치 패드, 포인팅 스 틱, 하나 이상의 마우스 버튼, 트랙 볼, 조이스틱 등 입력 장치를 예로 들 수 있다. 출력 장치는 디스플 레이 장치, 보조 조명 장치(예를 들면, LED) 및 촉각 피드백 장치(예를 들면, 진동모터) 등을 포함할 수 있다. 상기 디스플레이 장치는 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이 및 플라즈마 디스플레이를 포함 할 수 있지만, 이에 제한되는 것은 아니다. 일부 실시형태에서, 디스플레이 장치는 터치 스크린일 수 있다. 여기에서 설명한 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, ASIC(전용 집적 회로), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 실현될 수 있다. 상기 다양한 실시 형태에는 다음과 같은 내용을 포함할 수 있다: 하나 이상의 컴퓨터 프로그램에서 실시되고, 상기 하나 이상의 컴퓨터 프로그램은 프로그래밍 가능한 적어도 하나의 프로세서를 포함하는 프로그래밍 가능한 시스템에서 실행 및/또는 해석될 수 있다. 상기 프로그래밍 가능한 프로세서는 전용 또는 범용 프로그래밍 가능한 프로세서일 수 있으며, 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터 및 명령어를 수신하 며, 또한 상기 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치에 데이터 및 명령어를 전송 할 수 있다. 이러한 컴퓨터 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션 또는 코드라고도 함)은 프로그래밍 가 능 프로세서의 기계 명령어를 포함하며, 또한 고급 프로세스 및/또는 객체 지향 프로그래밍 언어, 및/또는 어셈 블리/기계 언어를 이용하여, 상기 컴퓨터 프로그램을 실시한다. 예를 들면, 본 문장에서 사용된 용어 \"기계 판 독가능 매체\" 및 \"컴퓨터 판독가능 매체\"는 기계 명령어 및/또는 데이터를 프로그래밍 가능 프로세서에 제공하 기 위한 임의의 컴퓨터 프로그램 제품, 기기 및/또는 장치(예를 들면, 자기 디스크, 광학 디스크, 메모리, 프로 그램 가능 논리 디바이스(programmable logic device: PLD))를 말하며, 기계 판독가능 신호인 기계 명령어를 수 신하는 기계 판독가능 매체를 포함한다. 용어 \"기계 판독가능 신호\"는 기계 명령어 및/또는 데이터를 프로그래 밍 가능한 프로세서에 제공하기 위한 임의의 신호를 말한다. 사용자와의 인터랙션을 제공하기 위해, 여기에서 설명하는 시스템과 기술을 컴퓨터에서 실행할 수 있다. 상기 컴퓨터는 사용자에게 정보를 디스플레이하기 위한 디스플레이 장치(예를 들면, CRT(cathode ray tube, 음극선관 또는 LCD(액정 디스플레이) 모니터) 및 키보드, 포인팅 장치(예를 들면, 마우스 또는 트랙 볼)를 포함한다. 사 용자는 상기 키보드 및 포인팅 장치를 통해 입력을 컴퓨터에 제공한다. 기타 종류의 장치는 사용자와의 인터랙 션을 제공하기 위해 사용될 수도 있다. 예를 들면, 사용자에게 제공하는 피드백은 임의의 형태의 센싱 피드백 (예를 들면, 시각 피드백, 청각 피드백 또는 촉각 피드백)일 수 있으며, 또한 사용자로부터의 입력은 임의의 형 태(소리 입력, 음성 입력 또는 촉각 입력을 포함)로 수신될 수 있다. 여기에서 설명하는 시스템 및 기술을 백그라운드 부재를 포함하는 계산 시스템(예를 들면, 데이터 서버), 또는 미들웨어 부재를 포함하는 계산 시스템(예를 들면, 애플리케이션 서버), 또는 프론트 부재를 포함하는 계산 시 스템(예를 들면, 그래픽 유저 인터페이스 또는 웹 브라우저를 구비하는 사용자 컴퓨터, 사용자는 상기 그래픽 유저 인터페이스 또는 웹 브라우저를 통해 여기에서 설명하는 시스템 및 기술의 실시형태와 인터랙션을 진행할 수 있음), 또는 상기 백그라운드 부재, 미들웨어 부재 또는 프론트 부재를 포함하는 임의의 조합을 포함하는 계 산 시스템에서 실행할 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들면, 통신 네트워크)을 통해 시스템의 부재를 서로 연결할 수 있다. 통신 네트워크의 예시는 근거리 통신망(LAN), 광대역 통신망(WAN) 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함한다. 클라이언트 및 서버는 일반적으로 서로 멀리 떨어져 있으며, 통신망을 통해 인터랙션을 진행한다. 해당 컴퓨터에서 실행되고, 또한 서로 클라이언트-서버 관계를 갖는 컴퓨 터 프로그램을 통해 클라이언트 및 서버의 관계를 생성한다. 상기의 다양한 형태의 프로세스를 이용하여, 단계를 다시 순서 배열, 추가 또는 삭제할 수 있음을 이해해야 한 다. 예를 들면, 본 출원에 기재된 각 단계는 병행하여 실행할 수 있고, 순서대로 실행할 수도 있으며, 서로 다 른 순서로 실행할 수도 있는데, 본 출원에 의해 개시되는 기술방안이 기대하는 결과를 실현할 수만 있다면, 이 에 대해 제한하지 않는다. 상기 구체적인 실시형태는 본 출원 보호 범위에 대해 제한하지 않는다. 당업자는 설계 요구와 기타 요인에 따라 다양한 수정, 조합, 서브 조합 및 대체를 진행할 수 있음을 이해해야 한다. 본 출원의 사상 및 원칙 내에서 진 행되는 수정, 균등한 교체 및 개선 등은 모두 본 출원의 보호 범위에 포함되어야 한다."}
{"patent_id": "10-2021-7019206", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 기술방안을 더욱 잘 이해하기 위한 것이고, 본 출원이 도면에 의해 한정되는 것은 아니다. 여기서, 도 1은 본 출원의 실시예에 의해 제공되는 주요 흐름도; 도 2는 본 출원의 실시예에 의해 제공되는 음성 인터랙션에 기반하는 정보 검증 아키텍처의 예시도; 도 3은 본 출원의 실시예에 의해 제공되는 음향 모델을 훈련 방법의 흐름도; 도 4는 본 출원의 실시예에 의해 제공되는 음향 모델의 구성 예시도; 도 5는 본 출원의 실시예에 의해 제공되는 시맨틱 이해 모델의 원리도; 도 6은 본 출원의 실시예에 의해 제공되는 시맨틱 이해 모델의 훈련 방법의 흐름도; 도 7은 본 출원의 실시예에 의해 제공되는 지리적 위치점 링크의 원리 예시도; 도 8은 본 출원의 실시예에 의해 제공되는 음성 인터랙션에 기반하는 정보 검증 장치의 구성도; 도 9는 본 출원의 실시예에 의해 제공되는 시맨틱 이해 모델의 훈련 장치의 구성도; 및 도 10은 본 출원 실시예를 실현하기 위한 전자 기기의 블록도."}
