{"patent_id": "10-2022-0142526", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0009319", "출원번호": "10-2022-0142526", "발명의 명칭": "어플리케이션 내 액티비티 및 아웃도어 액티비티를 포함하는 액티비티 번들을 지원하는 서버", "출원인": "주식회사 룩시드랩스", "발명자": "조안나"}}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터로 읽을 수 있는 적어도 하나의 인스트럭션을 포함하는 정신 건강 어플리케이션을 저장한 저장 매체에 있어서, 상기 적어도 하나의 인스트럭션은, 적어도 하나의 프로세서에 의하여 실행 시에, 상기 적어도 하나의 프로세서를 포함하는 전자 장치로 하여금:제 1 사용자 장치에 기반한 제 1 사용자의 접속을 확인하고,상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하고,상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여, 적어도 하나의 인 어플리케이션 액티비티 및 적어도 하나의 아웃도어 액티비티를 포함하는 액티비티 번들을 확인하고, 여기에서 상기 적어도 하나의 인 어플리케이션 액티비티는 내향적인 활동에 기반한 상기 제 1 사용자의 정신 건강 상태의 향상을 유도하기 위한 것이고,상기 적어도 하나의 아웃도어 액티비티는 물리적인 활동에 기반한 상기 제 1 사용자의 상기 정신 건강 상태의향상을 유도하기 위한 것이고,상기 확인된 액티비티 번들과 연관된 정보를 상기 제 1 사용자 장치로 제공하도록 야기하도록 설정된 저장매체."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 정신 건상 상태를 확인하도록 설정된 저장 매체."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 정신 건상 상태에 대응하는 적어도 하나의 액티비티를 포함하는 상기 액티비티 번들을 확인하도록 설정된 저장 매체."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 적어도 하나의 액티비티 수행 이력을 확인하도록 설정된 저장 매체."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작의 적어도 일부로, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 이상인 적어도 하나의 액티비티를 포함하는상기 액티비티 번들을 확인하도록 설정된 전자 장치."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서,공개특허 10-2024-0009319-3-상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작의 적어도 일부로, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 이상인 적어도 하나의 제 1 액티비티와 임계유사도 이상의 유사도를 가지는 적어도 하나의 제 2 액티비티를 포함하는 상기 액티비티 번들을 확인하도록 설정된 전자 장치."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 4 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작의 적어도 일부로, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 미만인 적어도 하나의 액티비티를 포함하는상기 액티비티 번들을 확인하도록 설정된 전자 장치."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 적어도 하나의 액티비티에 대한 선호도를 확인하도록 설정된 저장 매체."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 생활 패턴을 확인하도록 설정되고,상기 액티비티 번들은, 상기 제 1 사용자의 상기 생활 패턴에 대응하는 적어도 하나의 액티비티를 포함하는 저장 매체."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 성향을 확인하도록 설정되고,상기 액티비티 번들은, 상기 제 1 사용자의 상기 성향에 대응하는 적어도 하나의 액티비티를 포함하는 저장 매체."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "서버의 동작 방법에 있어서,제 1 사용자 장치에 기반한 제 1 사용자의 접속을 확인하는 동작;상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작;상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여, 적어도 하나의 인 어플리케이션 액티비티 및 적어도 하나의 아웃도어 액티비티를 포함하는 액티비티 번들을 확인하는 동작, 여기에서 상기 적어도 하나의 인 어플리케이션 액티비티는 내향적인 활동에 기반한 상기 제 1 사용자의 정신 건강 상태의 향상을 유도하기 위한 것이고, 상기 적어도 하나의 아웃도어 액티비티는 물리적인 활동에 기반한 상기 제 1 사용자의 상기 정신 건강 상태의 향상을 유도하기 위한 것이고; 및상기 확인된 액티비티 번들과 연관된 정보를 상기 제 1 사용자 장치로 제공하는 동작을 포함하는 서버의 동작 방법.공개특허 10-2024-0009319-4-청구항 12 제 11 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 정신 건상 상태를 확인하는 서버의 동작 방법."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작은, 상기 제 1사용자의 정신 건상 상태에 대응하는 적어도 하나의 액티비티를 포함하는 상기 액티비티 번들을 확인하는 서버의 동작 방법."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 11 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 적어도 하나의 액티비티 수행 이력을 확인하는 서버의 동작 방법."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작은, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 이상인 적어도 하나의액티비티를 포함하는 상기 액티비티 번들을 확인하는 서버의 동작 방법."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작은, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 이상인 적어도 하나의제 1 액티비티와 임계 유사도 이상의 유사도를 가지는 적어도 하나의 제 2 액티비티를 포함하는 상기 액티비티번들을 확인하는 서버의 동작 방법."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 14 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작은, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 미만인 적어도 하나의액티비티를 포함하는 상기 액티비티 번들을 확인하는 서버의 동작 방법."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 11 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 적어도 하나의 액티비티에 대한 선호도를 확인하는 서버의 동작 방법."}
{"patent_id": "10-2022-0142526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 11 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 생활 패턴을 확인하고,상기 액티비티 번들은, 상기 제 1 사용자의 상기 생활 패턴에 대응하는 적어도 하나의 액티비티를 포함하는 서버의 동작 방법.공개특허 10-2024-0009319-5-청구항 20 제 11 항에 있어서,상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 성향을 확인하고,상기 액티비티 번들은, 상기 제 1 사용자의 상기 성향에 대응하는 적어도 하나의 액티비티를 포함하는 서버의동작 방법."}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따라서, 저장 매체는, 컴퓨터로 읽을 수 있는 적어도 하나의 인스트럭션을 포함하는 정신 건강 어플리케이션을 저장할 수 있다. 상기 적어도 하나의 인스트럭션은, 적어도 하나의 프로세서에 의하여 실행 시 에, 상기 적어도 하나의 프로세서를 포함하는 전자 장치로 하여금, 제 1 사용자 장치에 기반한 제 1 사용자의 접 (뒷면에 계속)"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 어플리케이션 내 액티비티 및 아웃도어 액티비티를 포함하는 액티비티 번들을 지원하는 서버 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자의 정신 건강의 웰빙을 유지하기 위한 다양한 서비스들이 제공되고 있다. 사용자의 정신 건강의 웰빙을 위하여 다양한 종류의 정적인 액티비티(예를 들어, 명상 액티비티, 호흡 훈련 액티비티)를 제공할 수 있는 어플 리케이션이 활발하게 도입되고 있다. 예를 들어, 명상 액티비티를 제공하는 어플리케이션은, 사용자에게 명상 을 위한 가이드 음성, 명상 상태를 유지하기 위한 음악, 및/또는 명상 상태를 유지하기 위한 화면을 제공할 수 있다. 예를 들어, 호흡 훈련 액티비티는, 날숨을 위한 음성 가이드, 들숨을 위한 음성 가이드, 날숨/들숨 구간 을 시각적으로 나타내는 화면을 제공할 수 있다. 한편, 아웃도어의 수행을 위한 어플리케이션이 활발하게 도입되고 있다. 예를 들어, GPS 기반으로 특정 지점으 로의 이동을 위한 미션을 제공하는 어플리케이션이 개시된다. 예를 들어, 어플리케이션은, 사용자가 소지한 전 자 장치의 GPS 정보를 기반으로, 사용자가 미션에 의하여 특정된 지점에 도달하였는지 여부를 확인할 수 있다. 어플리케이션은, 특정 지점으로의 이동 이외에도 사용자의 신체 건강의 향상 또는 유지를 위한 다양한 종류의 아웃도어 액티비티를 지원할 수 있다. 본 개시의 배경이 되는 기술은 본 개시에 대한 이해를 보다 용이하게 하기 위해 작성되었다. 본 개시의 배경이 되는 기술에 기재된 사항들이 선행기술로 존재한다고 인정하는 것으로 이해되어서는 안 된다."}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "정신 건강의 증진을 위하여서는, 명상 또는 호흡 훈련과 같은 정적인 액티비티 뿐만 아니라, 산책 또는 러닝과 같은 아웃도어 액티비티의 조합 수행이 요구된다. 하지만, 정적인 액티비티의 수행 및 아웃도어 액티비티의 수 행을 통합 관리하는 서비스에 대하여서는 개시된 바가 없다. 특히, 기존의 아웃도어 액티비티의 수행은, 정신 건강의 증진을 위한 목적이 아닌, 신체 건강의 증진을 위하여만 이용된 바, 정적인 액티비티 및 아웃도어 액티 비티 수행의 통합 관리 시스템이 개시된 바가 없다. 아울러, 정신 건강의 증진을 목적으로 정적인 액티비티 및 아웃도어 액티비티를 함께 제공하거나, 및/또는 양 종류들의 액티비티의 보상을 관리하는 서비스 또한 개시된 바가 없다. 본 개시의 다양한 실시예들은, 인 어플리케이션 액티비티 및 아웃도어 액티비티를 모두 지원하는 서버 및 그 동 작 방법에 관한 것이다. 인 어플리케이션 액티비티는 사용자의 정신 건강 상태를 증진시키기 위한 목적의 액티 비티이며, 예를 들어 어플리케이션으로부터의 요청 및 서버의 응답에 기반하여 동작될 수 있다. 아웃도어 액티 비티는, 예를 들어 사용자의 물리적인 신체 활동에 기반하여 수행될 수 있는 액티비티일 수 있다. 본 개시의 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재 로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따라서, 저장 매체는, 컴퓨터로 읽을 수 있는 적어도 하나의 인스트럭션을 포함하는 정신 건강 어 플리케이션을 저장할 수 있다. 상기 적어도 하나의 인스트럭션은, 적어도 하나의 프로세서에 의하여 실행시에, 상기 적어도 하나의 프로세서를 포함하는 전자 장치로 하여금, 제 1 사용자 장치에 기반한 제 1 사용자의 접속을 확인하고, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하고, 상기 제 1 사용자와 연관된 적어 도 하나의 정보에 기반하여, 적어도 하나의 인 어플리케이션 액티비티 및 적어도 하나의 아웃도어 액티비티를 포함하는 액티비티 번들을 확인하고, 상기 확인된 액티비티 번들과 연관된 정보를 상기 제 1 사용자 장치로 제 공하도록 야기하도록 설정될 수 있다. 여기에서 상기 적어도 하나의 인 어플리케이션 액티비티는 내향적인 활동 에 기반한 상기 제 1 사용자의 정신 건강 상태의 향상을 유도하기 위한 것이고, 상기 적어도 하나의 아웃도어 액티비티는 물리적인 활동에 기반한 상기 제 1 사용자의 상기 정신 건강 상태의 향상을 유도하기 위한 것일 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 정신 건상 상태를 확인 하도록 설정될 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 정신 건상 상태에 대응하는 적어도 하나의 액티비티를 포함하는 상기 액티비티 번들을 확인하도록 설 정될 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 적어도 하나의 액티비 티 수행 이력을 확인하도록 설정될 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작의 적어도 일부로, 상기 적어 도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 이상인 적어도 하나의 액티비티를 포함하는 상기 액티비티 번들을 확인하도록 설정될 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작의 적어도 일부로, 상기 적어 도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 이상인 적어도 하나의 제 1 액티비티와 임계 유사도 이상의 유사도를 가지는 적어도 하나의 제 2 액티비티를 포함하는 상기 액티비티 번들을 확인하도록 설정될 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하는 동작의 적어도 일부로, 상기 적어 도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 미만인 적어도 하나의 액티비티를 포함하는 상기 액티비티 번들을 확인하도록 설정될 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 적어도 하나의 액티비 티에 대한 선호도를 확인하도록 설정될 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 생활 패턴을 확인하도 록 설정될 수 있다. 상기 액티비티 번들은, 상기 제 1 사용자의 상기 생활 패턴에 대응하는 적어도 하나의 액 티비티를 포함할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치로 하여금, 상기 제 1 사용 자와 연관된 적어도 하나의 정보를 확인하는 동작의 적어도 일부로, 상기 제 1 사용자의 성향을 확인하도록 설 정될 수 있다. 상기 액티비티 번들은, 상기 제 1 사용자의 상기 성향에 대응하는 적어도 하나의 액티비티를 포 함할 수 있다. 일 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 사용자 장치에 기반한 제 1 사용자의 접속을 확인하고, 상 기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작, 상기 제 1 사용자와 연관된 적어도 하나의 정보 에 기반하여, 적어도 하나의 인 어플리케이션 액티비티 및 적어도 하나의 아웃도어 액티비티를 포함하는 액티비 티 번들을 확인하는 동작, 및 상기 확인된 액티비티 번들과 연관된 정보를 상기 제 1 사용자 장치로 제공하는 동작을 포함할 수 있다. 여기에서 상기 적어도 하나의 인 어플리케이션 액티비티는 내향적인 활동에 기반한 상기 제 1 사용자의 정신 건강 상태의 향상을 유도하기 위한 것이고, 상기 적어도 하나의 아웃도어 액티비티는 물 리적인 활동에 기반한 상기 제 1 사용자의 상기 정신 건강 상태의 향상을 유도하기 위한 것일 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 정신 건상 상태를 확인할 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하 는 동작은, 상기 제 1 사용자의 정신 건상 상태에 대응하는 적어도 하나의 액티비티를 포함하는 상기 액티비티 번들을 확인할 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 적어도 하나의 액티비티 수행 이력을 확인할 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하 는 동작은, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 이상인 적어도 하나의 액티비티를 포함하는 상기 액티비티 번들을 확인할 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하 는 동작은, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 이상인 적어도 하나의 제 1 액티비티와 임계 유사도 이상의 유사도를 가지는 적어도 하나의 제 2 액티비티를 포 함하는 상기 액티비티 번들을 확인할 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 상기 액티비티 번들을 확인하 는 동작은, 상기 적어도 하나의 액티비티 수행 이력에 기반하여, 상기 제 1 사용자가 수행한 횟수가 임계 횟수 미만인 적어도 하나의 액티비티를 포함하는 상기 액티비티 번들을 확인할 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 적어도 하나의 액티비티에 대한 선호도를 확인할 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 생활 패턴을 확인할 수 있다. 상기 액티비티 번들은, 상기 제 1 사용자의 상기 생활 패턴에 대응하는 적어도 하나의 액티비티를 포함할 수 있다. 일 실시예에 따라서, 상기 제 1 사용자와 연관된 적어도 하나의 정보를 확인하는 동작은, 상기 제 1 사용자의 성향을 확인할 수 있다. 상기 액티비티 번들은, 상기 제 1 사용자의 상기 성향에 대응하는 적어도 하나의 액티 비티를 포함할 수 있다."}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따라서, 인 어플리케이션 액티비티 및 아웃도어 액티비티를 통합 관리하는 서버 및 그 동작 방법이 제공될 수 있다. 인 어플리케이션 액티비티 및 아웃도어 액티비티의 조합 수행에 기반하여, 사 용자의 정신 건강이 향상될 수 있다. 인 어플리케이션 액티비티 및 아웃도어 액티비티(또는, 추가적으로 소셜 인터랙티브 액티비티 등의 다양한 다른 타입의 액티비티도 추가될 수도 있음을 당업자는 이해할 것이다)의 적절 한 조합 수행에 따라, 스트레스가 완화될 수 있거나, 및/또는 사용자의 스트레스 대처 능력이 향상됨에 기반하 여, 통해 정신 질환(mental illness) 발병이 조기에 예방될 수 있다. 예를 들어, 장 시간의 인 어플리케이션 액티비티의 수행에 따른 정신 건강의 증진 정도는 한계를 가질 수 있으며, 장 시간의 아웃도어 액티비티의 수행 에 따른 정신 건강의 증진 정도 또한 한계를 가질 수 있다. 이에 따라, 인 어플리케이션 액티비티 및 아웃도어 액티비티가 상호보완적으로 번갈아가면서 수행되어야, 사용자의 정신 건강 상태가 더욱 효과적으로 증진될 수 있다. 뿐만 아니라, 예를 들어, 정신 건강과 연관된 보상 기반 시스템 및 신체 활동과 연관된 보상 기반 시스템이 독 립적으로 구현된 경우와 비교하여, 양 시스템들을 연계하거나, 및/또는 양 시스템의 데이터들을 변환 및/또는 통합 관리하는 중계 서버가 요구되지 않을 수도 있다"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 예시 들을 참조하면 명확해질 것이다. 그러나, 본 개시는 이하에서 개시되는 예시들에 한정되는 것이 아니라 서로"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 다양한 형태로 구현될 것이다. 본 예시들은 본 개시가 완전하도록 하며, 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시는 청구항의 범 주에 의해 정의될 뿐이다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 및 B 중 적어도 하나,\" \"A 또는 B 중 적어도 하나\" 또는 \"A 및/또는 B\" 등의 표현은 함께 나 열된 요소들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 및 B 중 적어도 하나,\" \"A 또는 B 중 적어 도 하나\" 또는 \"A 및/또는 B\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~ 를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도 록 구성된(또는 설정된)프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU, GPU, NPU, FGPA, ASIC 및/또는 application processor)를 의미 할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 예시를 설명하기 위해 사용된 것으로, 다른 예시의 범위를 한정하려 는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일 반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경 우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 예시들을 배제하도록 해석될 수 없다. 본 개시의 여러 예시들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하며, 당업자가 충분히 이해할 수 있듯이 기술적으로 다양한 연동 및 구동이 가능하며, 각 예시들이 서로에 대하여 독립적으로 실시 가능할 수도 있고 연관 관계로 함께 실시 가능할 수도 있다. 이하, 첨부한 도면을 참조하여 본 개시의 일 예시를 상세히 설명하도록 한다. 도 1은 일 실시예에 따른 액티비티 제공 시스템의 개략도를 도시한다. 도 1을 참조하면, 액티비티 제공 시스템은, 어플리케이션 내 액티비티 및 아웃-도어 액티비티를 지원하는 시스템으로, 서버 및 복수의 사용자 장치(110-1,110-2,110-3,110-4, … 100-N)(N은 2이상의 자연수)를 포 함할 수 있다. 일 실시예에 따라서, 서버는, 예를 들어 하나의 물리적(또는, 논리적)인 장치(또는, 엔티티)로 구현될 수 있거나, 또는 둘 이상의 물리적(또는, 논리적)으로 구분될 수 있는 장치(또는, 엔티티)로 구현될 수도 있다. 여기에서, 장치(또는, 엔티티)는, 물리적으로 구분될 수 있는 장치이거나, 또는 논리적으로 구분될 수 있는 장 치(예를 들어, 가상 머신(virtual machine) 또는 컨테이너(container))를 의미할 수도 있으며, 그 종류에는 제 한이 없음을 당업자는 이해할 것이다. 서버는, 특정한 하드웨어를 의미할 수 있으나, 클라우드 서버로 구 현될 수도 있음을 당업자는 이해할 것이다. 일 실시예에 따라서, 서버는, 적어도 하나의 사용자를 위한(또는, 사용자가 이용하는 적어도 하나의 사용 자 장치(user device)(또는, 클라이언트라 명명할 수도 있음)를 위한) 호스팅을 수행할 수 있다. 서버는, 예를 들어 적어도 하나의 사용자에게(또는, 적어도 하나의 사용자가 이용하는 적어도 하나의 사용자 장치(110- 1,110-2,110-3,110-4, … 110-N)에게) 가상 공간 컨텐트를 제공할 수 있다. 가상 공간 컨텐트는, 예를 들어 가 상 공간을 표현하기 위한 데이터 및/또는 가상 공간 내의 다양한 액티비티들(예를 들어, 미니 게임)을 수행하기 위한 데이터를 포함할 수 있으며, 제한이 없다. 가상 공간 컨텐트는, 예를 들어 증강 현실 컨텐트, 및/또는 혼 합 현실 컨텐트로 치환될 수도 있음을 당업자는 이해할 것이다. 이에 따라, 가상현실 컨텐트 및/또는 증강현실 컨텐트가 사용자 장치(110-1,110-2,110-3,110-4, …110-N)에 제공될 수도 있으며, 서버는 가상현실 서비 스 제공 서버 및/또는 증강현실 서비스 제공 서버로 명명될 수도 있다. 일 실시예에 따라서, 가상 공간에는, 사용자에 대응하는 아바타가 포함될 수도 있다. 뿐만 아니라, 가상 공간 에는 다른 사용자에 대응하는 아바타 및/또는 NPC에 대응하는 아바타가 포함될 수도 있다. 즉, 가상 공간은, 복수 사용자가 접속 가능한 기능을 제공할 수 있다. 예를 들어, 제 1 사용자는 사용자 장치 #1(110-1)를 통하 여 서버에 접속할 수 있으며, 제 2 사용자는 사용자 장치 #2(110-2)를 통하여 서버에 접속할 수 있다. 복수 사용자가 가상 공간에 접속함에 따라, 사용자는 가상 공간 내에서 다른 사용자와 (예를 들어, 아바 타 기반이지만 제한이 없음) 소셜 인터랙션을 수행할 수 있다. 더욱 상세하게 후술할 것으로, 사용자의 다른 사용자와의 인터랙션 중 적어도 일부가, 인 어플리케이션 액티비티일 수도 있으며, 이에 따른 보상이 제공될 수 도 있다. 현존하는 다양한 종류의 정신 질환 및/또는 정신 질환의 원인(예를 들어, 우울증, 조울증, 외로움, 불안장애, 공황장애, 조현증, 치매, 망상장애 등이지만 제한이 없음)은, 사용자가 사회적으로 고립된 경우(예를 들어, 다른 인간과의 인터랙션이 없거나, 또는 제한된 경우)에 심화될 수 있다. 사용자가, 가상 공간에서 (예 를 들어, 아바타 기반이지만 제한이 없음) 다른 사용자와의 건전한 사회적 인터랙션을 수행함에 따라서 편안함 과 안정감을 느낄 수 있어, 정신 질환 유발 가능성이 감소되거나 및/또는 예방될 수 있다. 아울러, 더욱 상세하게 후술할 것으로, 보상 기반의 액티비티 수행에 따라, 가상 공간 내에서의 좋은 정신 건강 상태를 위한 습관 이 형성될 수 있다. 뿐만 아니라, 가상 공간 내에서의 다른 사용자와의 인터랙션 및/또는 보상에 따라, 서로에 게 좋은 정신 건강 상태를 위한 동기를 제공할 수도 있다. 아울러, 가상 공간 내에서의 다른 사용자와의 경쟁 (예를 들어, 보상에 대한 경쟁, 자신의 공간의 꾸미기에 대한 경쟁, 어플리케이션 내의 미니 게임 내의 경쟁, 사용자 정신 건강 지표(예를 들어, 레벨, 또는 점수)에 대한 경쟁 등, 제한이 없음)에 기반하여, 좋은 정신 건 강 상태를 위한 습관화가 가속될 수도 있다. 이와 같이, 정신 건강 상태의 향상을 위한 어플리케이션이, 복수 사용자들의 동시 접속이 가능한 가상 공간 기반(또는, 증강 현실 공간 기반, 및/또는 메타버스 공간 기반)으로 동작함에 따라서, 일반적인 어플리케이션에 비하여 정신 건강 상태가 더욱 향상될 수 있다. 일 실시예에 따라서, 서버는, 예를 들어, 적어도 하나의 액티비티(또는, 스테이지, 또는 미션(mission) 등 으로 명명 가능함)와 연관된 적어도 하나의 컨텐트를 사용자 장치에 제공할 수 있다. 예를 들어, 적어도 하나 의 액티비티는, 사용자 장치로부터 수신되는 사용자 입력에 기반하여 출력할 컨텐트를 제공하도록 설정될 수 있 다. 하나의 예로, 사용자 장치로부터 가상 공간에 배치되는 특정 캐릭터를 지정(예를 들어, 터치)하는 입력이 수신되면, 서버는 특정 캐릭터와 관련된 정보를 구성하기 위한 데이터를, 컨텐트로서 사용자 장치로 제공 할 수 있다. 하나의 예로, 사용자 장치로부터 가상 공간에 배치되는 특정 캐릭터의 주변 지점을 지정(예를 들 어, 터치)하는 입력이 수신되면, 서버는 특정 캐릭터가 주변 지점으로 이동하는 애니메이션 효과를 구성하 기 위한 데이터를 사용자 장치로 제공할 수 있다. 상술한 예시와 같이 캐릭터와 관련된 사용자 조작 이외에도, 가상 공간 관련된 다양한 오브젝트의 조작을 통한 컨텐트 제공이 가능함을 당업자는 이해할 것이다. 컨텐트는, 예를 들어 사용자 장치에서 출력 가능한 적어도 하나의 이미지를 구성하기 위한 정보, 음성을 구성하기 위한 정 보, 촉각적인 피드백(예를 들어, 진동)을 구성하기 위한 정보, 및/또는 후각적인 피드백을 구성하기 위한 정보 를 포함할 수 있으며, 그 정보의 종류에는 제한이 없음을 당업자는 이해할 것이다. 적어도 하나의 이미지를 구 성하기 위한 정보는, 적어도 하나의 2차원 이미지를 구성하기 위한 정보, 적어도 하나의 3차원 이미지를 구성하 기 위한 정보, 또는 가상현실 서비스를 구성하기 위한 정보 등으로 다양한 방식으로 구현될 수도 있으며, 그 구 현 방식에는 제한이 없다. 일 실시예에 따라서, 가상 컨텐트 데이터베이스에는, 가상 공간을 표현하기 위한 데이터들이 저장될 수 있 다. 가상 컨텐트 데이터베이스에는, 각 사용자별 게임 관련 정보가 저장될 수 있다. 예를 들어, 게임 관 련 정보는, 사용자에 대응하는 캐릭터의 가상 공간 내에서의 위치, 캐릭터가 진행 중인 어플리케이션 액티비티, 및/또는 스코어와 같은 게임과 관련된 다양한 종류의 정보일 수 있으며, 사용자에 대응되어 저장되는 정보라면 제한이 없음을 당업자는 이해할 것이다. 아울러, 사용자와 연관된 아이템 및/또는 사용자와 연관된 재화 (currency)가 사용자 데이터베이스에 저장되는 것과 같이 도시되어 있지만, 이는 선택적인 것으로, 사용자 와 연관된 아이템 및/또는 사용자와 연관된 재화가 가상 컨텐트 데이터베이스에 저장될 수도 있음을 당업 자는 이해할 것이다. 일 실시예에 따라서, 상술한 바와 같이, 가상 공간 내의 오브젝트(예를 들어, 가상 공간 내의 캐릭터, 및/또는 배경 오브젝트이지만 제한이 없음)에 대한 조작에 대응하여, 이에 대응하는 가상 공간을 위한 컨텐트를 제공하 는 액티비티를, 예를 들어 인-어플리케이션 액티비티라 명명할 수 있다. 예를 들어, 가상 공간 내의 오브젝트에 대한 직접 또는 간접적인 조작에 따라, 해당 오브젝트와 관련된 기능이 실행되거나, 및/또는 해당 오브젝트에 연관된 컨텐트가 제공되는 액티비티를 인-어플리케이션 액티비티라 명명할 수 있다. 예를 들어, 가상 공간 내 의 오브젝트에 대한 조작에 기반하여 지속적인 가상 공간을 위한 컨텐트가 제공되는 액티비티를 인-어플리케이 션 액티비티라 명명할 수 있다. 예를 들어, 가상 공간 내의 오브젝트에 대한 조작을 위하여 설정된 사용자 장 치 내의 적어도 하나의 하드웨어(예를 들어, 터치스크린)를 통한 사용자 입력에 기반하여, 이에 대응하는 가상 공간을 위한 컨텐트를 제공하는 액티비티를 인-어플리케이션 액티비티라 명명할 수 있다. 예를 들어, 클라이언 트에 의한 정신 건강 어플리케이션에 기반한 요청 및, 서버에 의한 요청에 대응하는 응답에 기반하여 수행 되는 액티비티를 인 어플리케이션 액티비티라 명명할 수 있다. 인 어플리케이션 액티비티로 분류되기 위한 다양 한 기준에 대하여서는 후술하도록 한다. 일 실시예에 따라서, 가상 컨텐트 데이터베이스에는, 아웃도어 액티비티가 저장될 수 있다. 아웃도어 액 티비티는, 예를 들어 사용자 장치의 사용자의 물리적인 움직임에 기반하여, 액티비티의 완료(completion) 여부 가 결정될 수 있는 액티비티가 아웃도어 액티비티일 수 있다. 예를 들어, 가상 공간 내의 오브젝트에 대한 조 작과는 상이한 사용자 신체 활동에 대한 센싱 데이터(예를 들어, 페도미터(pedometer) 측정 데이터이지만 제한 이 없음), 및/또는 사용자 신체 활동에 기반하여 변경되는 데이터(예를 들어, 사용자 장치의 위치 정보이지만 제한이 없음)와 연관된 입력에 기반하여, 액티비티의 완료 여부를 결정할 수 있는 액티비티를, 예를 들어 아웃도어 액티비티라 명명할 수 있다. 예를 들어, 사용자 신체 활동에 대한 센싱 데이터, 및/또는 사용자 신체 활 동에 기반하여 변경되는 데이터와 연관된 입력에 기반하여, 액티비티의 완료 여부가 제공되되, 사용자 입력에 기반한 즉각적인(예를 들어, 실시간의) 가상 공간을 위한 컨텐트가 제공되지 않는 액티비티를 아웃도어 액티비 티라 명명할 수 있다. 이 경우, 아웃도어 액티비티가 수행되는 동안, 가상 공간을 위한 컨텐트가 제공되지 않 거나, 또는 아웃도어 액티비티에 대응하여 지정된 가상 공간을 위한 컨텐트(예를 들어, 사용자 입력으로부터 독 립적인 컨텐트)가 제공될 수도 있다. 하지만, 이는 예시적인 것으로, 아웃도어 액티비티는, 사용자 입력에 기 반하여 즉각적인(예를 들어, 실시간)의 가상 공간을 위한 컨텐트를 제공할 수도 있다. 예를 들어, 사용자 신체 활동에 대한 센싱 데이터, 및/또는 사용자 신체 활동에 기반하여 변경되는 데이터를 측정하기 위한 사용자 장치 내의 적어도 하나의 하드웨어(예를 들어, 페도미터 및/또는 GPS 모듈)을 통한 사용자 입력에 기반하여, 이에 대 응하는 가상 공간을 위한 컨텐트를 제공하는 액티비티를 아웃도어 액티비티라 명명할 수 있다. 또는, 아웃도어 액티비티는, 사용자 입력을 요구하지 않을 수도 있다. 예를 들어, “명상”의 아웃도어 액티비티는, “명상” 의 아웃도어 액티비티에 대하여 설정된 가상 공간을 위한 컨텐트(예를 들어, 명상 음악)를 제공하도록 설정되며, 별도의 사용자 입력을 요구하지 않을 수도 있다. 예를 들어, 클라이언트에 의한 정신 건강 어플리케 이션에 기반한 요청 및, 서버에 의한 요청에 대응하는 응답에 기반하여 수행되지 않는 액티비티를 아웃도 어 액티비티라 명명할 수 있다. 예를 들어, API에 기반하여 정신 건강 어플리케이션 이외의 다른 어플리케이션 (예를 들어, 신체 건강 어플리케이션)으로부터의 데이터에 기반하여 수행되는 액티비티를 아웃도어 액티비티라 명명할 수 있다. 아웃도어 액티비티로 분류되기 위한 다양한 기준에 대하여서는 후술하도록 한다. 일 실시예에 따라서, 가상 컨텐트 데이터베이스에는, 예를 들어 가상 공간을 구성하는 맵(map)에 대한 데 이터가 저장될 수 있다. 맵은, 예를 들어 캐릭터가 이동가능한 공간을 설명(descript)하기 위한 데이터로서, 예를 들어 가상 공간 내의 복수 개의 지점들을 식별하기 위한 좌표 정보, 가상 공간 내에 배치되는 오브젝트(예 를 들어, 배경 오브젝트이지만 제한이 없음), 및/또는 오브젝트와 연관된 정보를 포함할 수 있으나 제한이 없다. 맵에 대한 데이터는 편집될 수도 있으며, 예를 들어 오브젝트가 삭제되거나, 및/또는 추가될 수도 있다. 예를 들어, 맵은, 특정한 사용자의 소유가 아닌 가상 공간을 위한 맵을 포함할 수 있다. 예를 들어, 맵은, 특 정한 사용자에게 할당된 가상 공간을 위한 맵을 포함할 수도 있다. 이 경우, 사용자는, 오브젝트를 추가하기 위한 조작(예를 들어, 아이템 구매 및 아이템 배치)을 수행할 수도 있으며, 서버는 이에 대응하여 오브젝 트를 맵 데이터에 추가할 수도 있다. 맵에 의하여 구성되는 가상 공간에는 적어도 하나의 캐릭터가 방문할 수 있으며, 이 경우 해당 캐릭터에 대응하는 사용자 장치에는 해당 캐릭터 및/또는 해당 캐릭터가 위치하는 가상 공간을 구성하기 위한 가상 공간을 위한 컨텐트가 제공될 수도 있다. 일 실시예에 따라서, 가상 컨텐트 데이터베이스에는, 예를 들어 인-어플리케이션 액티비티에 대한 데이터 가 저장될 수 있다. 인-앱 어플리케이션 액티비티는, 상술한 바와 같이 예를 들어 가상 공간 내의 오브젝트에 대한 조작에 대응하여, 이에 대응하는 가상 공간을 위한 컨텐트를 제공하는 액티비티일 수 있으나 제한이 없다. 인-어플리케이션 액티비티의 다양한 종류에 대하여서는 후술하도록 한다. 일 실시예에 따라서, 가상 컨텐트 데이터베이스에는, 예를 들어 아웃도어 액티비티에 대한 데이터가 저장 될 수 있다. 아웃도어 액티비티는, 상술한 바와 같이 예를 들어 사용자 신체 활동에 대한 센싱 데이터(예를 들 어, 페도미터(pedometer) 측정 데이터이지만 제한이 없음), 및/또는 사용자 신체 활동에 기반하여 변경되는 데 이터(예를 들어, 사용자 장치의 위치 정보이지만 제한이 없음)와 연관된 입력에 기반하여, 액티비티의 완료 여 부를 결정할 수 있는 액티비티일 수 있으나 제한이 없다. 아웃도어 액티비티의 다양한 종류에 대하여서는 후술 하도록 한다. 일 실시예에 따라서, 가상 컨텐트 데이터베이스에는, 아이템 구매 관련 데이터가 저장될 수 있다. 예를 들어, 가상 공간 내에서 이용(또는, 배치) 가능한 아이템들에 대한 이미지, 정보, 및/또는 기능에 대한 데이터 가, 가상 컨텐트 데이터베이스에 저장될 수 있다. 아이템에 대한 정보는, 해당 아이템 구매를 위하여 요 구되는 가상 공간에서 정의된 적어도 하나의 재화의 종류 및/또는 수량을 포함할 수 있다. 한편, 구매된 아이 템이 특정 가상 공간의 맵에 배치되는 경우, 해당 정보는 맵 관련 데이터로서, 및/또는 아이템 구매 관련 데이 터로서 저장될 수도 있다. 일 실시예에 따라서, 가상 컨텐트 데이터베이스에는, 재화 관리(currency management) 관련 데이터가 저장 될 수 있다. 재화 관리 데이터에는, 적어도 하나의 재화(예를 들어, 코인(coin), 및/또는 하트(heart))의 사용 자 할당 정책을 포함할 수 있다. 재화의 종류는, 예를 들어 실제 세계(real world)의 재화(예를 들어, US 달러 또는 KR 원화)로 구매 가능한지 여부에 따라 구분될 수 있다. 예를 들어, 코인은 실제 세계의 재화로 구매 가 능하도록 설정될 수 있으며, 하트는 실제 세계의 재화로 구매 불가능하도록 설정될 수 있으나 이는 예시적인 것으로 제한이 없다. 재화의 종류는, 예를 들어 특정 아이템을 구매할 수 있는지 여부에 따라 구분될 수도 있다. 예를 들어, 하트를 이용하여 제 1 종류의 아이템 및 제 2 종류의 아이템을 구매하도록 설정될 수 있으며, 코인 을 이용하여 제 1 종류의 아이템을 구매 가능하나 제 2 종류의 아이템을 구매할 수 없도록 설정될 수도 있으며, 제한은 없다. 예를 들어, 재화의 할당 정책으로서, 특정 액티비티의 선택에 대응하여 할당되는 적어도 하나의 재화의 종류 및/또는 수량이 설정될 수 있다. 하나의 예에서, 인-어플리케이션 액티비티에 대응하는 재화의 종 류는, 아웃도어 액티비티에 대응하는 재화의 종류와 상이할 수 있다. 하나의 예에서, 인-어플리케이션 액티비 티에 대응하는 재화의 집합은, 아웃도어 액티비티에 대응하는 재화의 집합과 상이할 수 있다. 하나의 예에서, 액티비티 별 재화 할당의 가중치(weight)에 대한 정보도 재화의 할당 정책으로서 설정될 수도 있다. 예를 들어, 특정 액티비티가 반복 수행되는 경우, 반복 횟수에 대응하는 가중치가 재화의 할당 정책으로서 설정될 수 도 있다. 하나의 예에서, 적어도 하나의 제 1 액티비티에 대하여서는, 반복 횟수가 증가할수록 더 높은 가중치 가 할당되는 할당 정책이 설정될 수 있다. 하나의 예에서, 적어도 하나의 제 2 액티비티에 대하여서는, 임계 횟수까지는 반복 횟수가 증가할수록 더 높은 가중치가 할당되고, 임계 횟수를 초과하는 경우에는 상대적으로 낮 은 가중치가 할당되는 할당 정책이 설정될 수 있다. 하나의 예에서, 적어도 하나의 제 3 액티비티에 대하여서 는, 임계 횟수까지는 반복 횟수가 증가할수록 더 높은 가중치가 할당되고, 임계 횟수를 초과하는 경우에는 역 가중치(예를 들어, 음수)가 할당되는 할당 정책이 설정될 수 있다. 하나의 예에서, 적어도 하나의 제 4 액티비 티에 대하여서는, 임계 횟수까지는 반복 횟수가 증가하여도 가중치가 할당되지 않다가, 임계 횟수를 초과하는 경우에는 역 가중치(예를 들어, 음수)가 할당되는 할당 정책이 설정될 수 있다. 한편, 액티비티 별 설정되는 가중치의 설정 방식에는 제한이 없다. 일 실시예에 따라서, 서버는, 사용자 정보를 관리할 수 있다. 예를 들어, 서버는, 사용자 관련 데이 터(예를 들어, 사용자 계정(user account) 관련 데이터, 사용자 관계(user relationship) 관련 데이터, 사용자 아이템(user's item) 관련 데이터, 사용자 성향(또는, 성격) 및/또는 사용자 재화(user's currency) 관련 데이 터)에 대한 관리 동작(예를 들어, 생성, 저장, 갱신, 및/또는 삭제)를 수행할 수 있으며, 그 관리 대상 및/또는 관리 동작의 종류에는 제한이 없음을 당업자는 이해할 것이다. 서버는, 사용자 관련 데이터를 사용자 데이 터베이스에 저장할 수 있다. 서버는, 사용자 데이터베이스에 저장된 사용자 관련 데이터 중 적 어도 일부에 대한 관리 동작(예를 들어, 갱신 및/또는 삭제)을 수행할 수 있다. 서버는, 신규 관리자에 대한 사용자 관련 정보를 생성하여 사용자 데이터베이스에 저장할 수 있다. 예를 들어, 사용자가 제 1 종 류의 재화를 제 1 수량만큼 이용하여 제 1 아이템을 구매하는 액티비티가 확인됨에 기반하여, 사용자 관리 서버 는 사용자 재화에 대한 데이터에 대하여 제 1 종류의 재화를 제 1 수량만큼 차감하는 관리 동작을 수행하고, 사 용자 아이템 관련 데이터에 대하여 제 1 아이템을 추가할 수 있다. 일 실시예에 따라서, 정신 건강 정보 데이터베이스에는, 사용자 별 정신 건강 관련 정보가 저장될 수 있다. 예를 들어, 정신 건강 관련 정보로, 정신 건강 상태(예를 들어, 정신 건강 레벨과 같이 수치화될 수 있 으나, 그 표현 형식에는 제한이 없음), 액티비티 수행 로그(예를 들어, 사용자가 수행한 액티비티의 종류, 수행 일시, 수행 횟수, 및/또는 수행 시간이지만, 제한이 없음), 및/또는 특정 액티비티에 대한 습관화(반복 수행)와 연관된 정보가 포함될 수 있으나, 제한이 없다. 일 실시예에 따라서, 센싱 데이터 데이터베이스에는, 사용자 별 생체 신호의 센싱 데이터가 저장될 수 있 다. 예를 들어, 사용자 장치에 포함된 센서, 및/또는 사용자 장치와 근거리 통신을 통하여 연결된 센서에 의하 여 사용자의 생체 신호가 센싱될 수 있다. 생체 신호의 센싱 데이터는, 사용자 장치로부터 서버로 제공될 수 있다. 서버는, 사용자 별로, 사용자의 생체 신호를 센싱 데이터 데이터베이스에 저장할 수 있다. 또는, 다른 구현에 따라서, 서버는, 센싱 데이터를, 사용자와 동일 연령대별, 또는 사용자의 성별 별로 그 룹핑하여 저장할 수도 있다. 예를 들어, 사용자가 10대 남성인 경우, 서버는, 사용자 식별 정보와 센싱 데이터를 매핑하여 저장하지 않고, 10대 그룹에 센싱 데이터를 매핑하여 저장하거나, 및/또는 남성의 그룹에 센 싱 데이터를 매핑하여 저장할 수도 있다. 구현에 따라서, 데이터베이스들(121,122,123,124) 중 적어도 둘 이상은 하나의 물리적인(또는, 논리적인) 엔티 티로 구현될 수도 있으며, 모두 상이한 물리적인(또는, 논리적인) 엔티티로 구현될 수도 있음을 당업자는 이해 할 것이다. 도 2는 일 실시예에 따른 액티비티 제공 시스템의 블록도를 도시한다. 일 실시예에 따라서, 서버는, 프로세서, 저장 장치, 및/또는 통신 인터페이스를 포함할 수 있다. 한편, 서버의 동작들 중 적어도 일부는 클라우드 서버에 의하여 구현될 수도 있다. 서버는,분산형 서버로 구현될 수도 있으며, 서버의 구현 형태에는 제한이 없다. 프로세서, 저장 장치, 및/ 또는 통신 인터페이스는, 서로 버스(또는, 다른 통신 인터페이스)를 통하여 데이터를 송/수신할 수 있다. 일 실시예에 따라서, 사용자 장치는, 프로세서, 저장 장치, 센서, 통신 인터페이 스, 입력 장치, 디스플레이, 및/또는 출력 장치를 포함할 수 있다. 프로세서, 저장 장치, 센서, 통신 인터페이스, 입력 장치, 디스플레이, 및/또는 출력 장치는, 서로 버스(또는, 다른 통신 인터페이스)를 통하여 데이터를 송/수신할 수 있다. 예를 들어, 사용자 장치 는, 스마트 폰, 및/또는 태블릿 PC와 같은 모바일 장치일 수 있다. 예를 들어, 사용자 장치는, HMD 장치, 안경형 웨어러블 장치, 렌즈형 웨어러블 장치, 등과 같은 웨어러블 장치일 수 있다. 예를 들어, 사용자 장치는, 일반적인 범용(generic) 컴퓨터일 수도 있으며, 사용자 장치는, 서버로부터의 데이터의 수신, 수신된 데이터에 기반한 표현, 사용자 입력의 획득, 사용자의 생체 신호와 연관된 센싱 데이터 획득 및/ 또는 획득된 정보의 서버로 송신을 수행할 수 있는 장치라면, 그 종류에는 제한이 없음을 당업자는 이해할 것이다. 일 실시예에 따라서, 프로세서 및/또는 프로세서는, 저장 장치 및/또는 저장 장치에 저장 된 어플리케이션의 인스트럭션을 실행할 수 있다. 본 개시의 서버의 동작은, 프로세서에 의하여 수 행되거나, 프로세서의 제어에 기반하여 다른 하드웨어에 의하여 수행될 수 있으며, 저장 장치에는, 프로세서에 의하여 실행 시에, 서버로 하여금 특정 동작들을 수행하도록 야기하는 인스트럭션이 저장 될 수 있다. 예를 들어, 서버에는, 정신 건강 어플리케이션이 저장될 수 있으며, 정신 건강 어플리케이션 에 포함된 적어도 하나의 인스트럭션의 수행에 따라, 본 개시 전반에서의 서버에 의한 동작이 수행될 수 있다. 저장 장치에는, 도 1에서 설명된 가상 컨텐트 데이터베이스, 사용자 데이터베이스, 정신 건강 정보 데이터베이스, 및/또는 센싱 데이터 데이터베이스에 저장된 정보 중 적어도 일부가 저장될 수 있다. 구현에 따라, 가상 컨텐트 데이터베이스, 사용자 데이터베이스, 정신 건강 정보 데이터베 이스, 및/또는 센싱 데이터 데이터베이스에 저장된 정보 중 적어도 일부가, 서버가 아닌, 외부 저장 장치에 저장될 수도 있으며, 서버는, 외부 저장 장치에 접속함에 기반하여, 해당 정보를 로드할 수도 있음을 당업자는 이해할 것이다. 본 개시의 사용자 장치의 동작은, 프로세서에 의하여 수행되거나, 프로세서의 제어에 기반하여 다른 하드웨어에 의하여 수행될 수 있으며, 저장 장치에는, 프로세서 에 의하여 실행 시에, 사용자 장치로 하여금 특정 동작들을 수행하도록 야기하는 인스트럭션이 저장 될 수 있다. 예를 들어, 사용자 장치에는, 정신 건강 어플리케이션이 저장될 수 있으며, 정신 건강 어플 리케이션에 포함된 적어도 하나의 인스트럭션의 수행에 따라, 본 개시 전반에서의 사용자 장치에 의한 동 작이 수행될 수 있다. 한편, 하나의 예시에서, 사용자 장치에 저장된 정신 건강 어플리케이션은, 클라이 언트 향 어플리케이션으로, 서버에 저장된 서버형 정신 건강 어플리케이션과 적어도 일부 상이할 수도 있 지만, 제한은 없다. 프로세서 및/또는 프로세서는, CPU(central processing unit), GPU(graphic processing unit), NPU(neural processing unit), DSP(digital signal processor), ASIC(application- specific integrated circuit), 및/또는 FPGA(field programmable gate array)를 포함할 수 있으나, 프로그램 (또는, 인스트럭션 또는 명령어)을 실행할 수 있는 수단이라면 제한이 없다. 저장 장치 및/또는 저장 장 치는, 휘발성 메모리 및/또는 비휘발성 메모리를 포함할 수 있으며, 예를 들어 RAM, ROM, 하드 디스크, 및 /또는 플래시 메모리를 포함할 수 있으나, 이는 예시적인 것으로 제한이 없다. 일 실시예에 따라서, 서버는, 통신 인터페이스를 통하여 사용자 장치와 데이터를 송/수신할 수 있다. 사용자 장치는, 통신 인터페이스를 통하여, 서버와 데이터를 송/수신할 수 있다. 통신 인터페이스 및/또는 통신 인터페이스는, 유선 및/또는 무선의 통신 네트워크를 통하여 통신 채 널의 수립, 및 수립된 통신 채널을 통한 데이터 송/수신을 지원할 수 있는 장치라면 제한이 없다. 한편, 통신 인터페이스는, 추가적으로 주변의 외부 센서 장치와의 데이터 송/수신을 위한 근거리 통신을 지원할 수도 있다. 근거리 통신은, 예를 들어, 블루투스 클래식, 블루투스 저에너지(BLE), 와이파이 다이렉트, 및/또 는 NFC를 포함할 수 있으나, 그 종류에는 제한이 없다. 외부 센서 장치는, 근거리 통신을 위한 통신 모듈 및/또는 적어도 하나의 센서를 포함할 수 있다. 외부 센서 장치는, 예를 들어, 손목시계형 웨어러블 장치, 팔찌형 웨어러블 장치, 반지형 웨어러블 장치, 목걸이형 웨어러블 장치와 같은, 예를 들어 사용자의 손목, 손, 또는 목 부위에 착용가능한 형태를 가질 수 있으나, 그 형태 및 착용 부위에는 제한이 없다. 외부 센서 장치는, 예를 들어 사용자의 머리에 착용 가능한 뇌파 센싱용 웨어러블 장치, 또는 모자형 웨어러블 장치일 수도 있다. 한편, 구현에 따라 사용자 장치가, 상술한 외부 센서 장치의 다양한 웨어러블 장 치의 타입으로 구현될 수도 있음을 당업자는 이해할 것이다. 뇌파 센싱용 웨어러블 장치는, 예를 들어 단순히 뇌파 센싱을 위한 EEG 센서뿐만 아니라, EMG 센서, EOG 센서, EDA 센서, ECG 센서, PPG 센서와 같은 다른 종류의 생체 신호를 측정할 수 있는 다양한 센서들을 포함할 수 있다. 다양한 센서들에 기반하여 측정된 생체 신호 에 기반하여, 생체 데이터(예를 들어, HR, HRV 등이지만 제한이 없음)이 확인될 수 있으며, 측정되는 생체 신호 의 종류, 생체 신호를 측정하기 위한 센서의 종류, 및/또는 측정된 생체 신호에 기반하여 획득되는 생체 데이터 의 종류에는 제한이 없다. 일 실시예에 따라서, 사용자 장치의 센서, 및/또는 외부 센서 장치는, 카메라, 생체 센서, 뇌파 센서, 3축 가속도 센서, 자이로 센서, 근접 센서, 그립 센서, 광 센서, IR(infrared) 센서, 온도 센서 및/또는 습도 센서를 포함할 수 있다. 외부 센서 장치는, 예를 들어 사용자의 생체 신호를 측정하여, 근거리 통신 에 기반하여 사용자 장치로 제공하거나, 또는 생체 신호를 처리한 데이터를 근거리 통신에 기반하여 사용 자 장치로 제공할 수도 있다. 전자 장치는, 센서에 의하여 측정된 사용자 생체 신호의 센싱 데 이터, 및/또는 외부 센서 장치로부터 수신된 사용자 생체 신호의 센싱 데이터를, 통신 인터페이스를 통하여, 서버로 제공할 수 있다. 더욱 상세하게 후술할 것으로, 서버는, 센싱 데이터에 기반하여, 사용자의 정신 건강 상태를 확인할 수 있다. 한편, 도 2에서는, 사용자 장치가 하나의 외부 센서 장치 와 연결되어 데이터를 송수신하는 것과 같이 도시되어 있지만, 이는 예시적인 것으로 사용자 장치는, 복수 개의 외부 센서 장치(예를 들어, 손목시계형 웨어러블 장치 및 뇌파 센싱용 웨어러블 장치)과 데이터 를 송수신할 수도 있음을 당업자는 이해할 것이다. 일 실시예에 따라서, 입력 장치는, 사용자의 입력을 확인할 수 있는 장치일 수 있다. 하나의 예에서, 입 력 장치는 디스플레이와 일체형으로 구현되어, 터치스크린 디스플레이를 구성할 수도 있다. 입력 장 치는, 터치 패드, 마우스, 버튼 등 사용자의 입력을 확인할 수 있는 장치라면 제한이 없다. 디스플레이 는, 프로세서의 제어에 따라 시각적인 컨텐트(예를 들어, 이미지)를 표현(예를 들어, 표시)할 수 있 다. 예를 들어, 디스플레이를 통하여, 가상 공간에 대응하는 이미지가 표시될 수도 있다. 출력 장치 는, 예를 들어 청각적인 컨텐트(예를 들어, 음성, 및/또는 음악)을 표현(예를 들어, 출력)하기 위한 스피 커, 촉각적인 컨텐트(예를 들어, 진도)을 표현(예를 들어, 출력)하기 위한 모터(또는, 액추에이터)를 포함할 수 있으나, 제한이 없다. 도 3a는 일 실시예에 따른 서버의 동작 방법을 설명하기 위한 흐름도를 도시한다. 일 실시예에 따라서, 서버는, 301 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 예를 들어, 제 1 사 용자는, 사용자 장치를 이용하여 서버에 제 1 사용자의 계정과 연관된 접속 절차를 수행할 수 있다. 제 1 사용자는, 사용자 장치에 제 1 사용자의 계정과 연관된 정보(예를 들어, 제 1 사용자 식별자 및/또는 제 1 사용자 PIN)를 입력할 수 있다. 사용자 장치는, 입력받은 제 1 사용자의 계정과 연관된 정보를 서버 로 송신할 수 있다. 서버는, 제 1 사용자의 계정과 연관된 정보를 수신할 수 있다. 서버는, 제 1 사용자의 계정과 연관된 정보에 기반하여, 접속 절차(또는, 로그인 절차로도 명명됨)를 수행할 수 있다. 예를 들어, 서버는, 수신된 제 1 사용자의 계정과 연관된 정보와, 기 저장된 제 1 사용자의 계정과 연관된 정보가 일치하는지 여부에 기반하여, 제 1 사용자의 접속 허가 여부를 결정할 수 있다. 한편, 상술한 제 1 사 용자의 계정과 연관된 정보에 기반한 접속 절차는 단순히 예시적인 것으로, 접속 절차에 대한 제한이 없음을 당 업자는 이해할 것이다. 예를 들어, 서버는, 제 1 사용자의 접속에 기반하여, 제 1 사용자에 대응하는 가상 공간을 표현하기 위한 데이터를 사용자 장치로 송신할 수 있다. 사용자 장치는, 가상 공간을 표현하 기 위한 데이터를 수신하고, 이를 이용하여 가상 공간을 표현하기 위한 적어도 하나의 동작을 수행할 수 있다. 가상 공간을 표현하기 위한 적어도 하나의 동작은, 예를 들어 시각적 컨텐트의 제공을 위한 동작(이미지의 표시), 청각적 컨텐트의 제공을 위한 동작(사운드의 출력), 촉각적 컨텐트의 제공을 위한 동작(예를 들어, 진동 의 출력), 후각적 컨텐트의 제공을 위한 동작(예를 들어, 지정된 냄새 생성을 위한 동작), 및/또는 미각적 컨텐 트의 제공을 위한 동작(예를 들어, 지정된 맛의 생성을 위한 동작)을 포함할 수 있으며, 제한이 없음을 당업자 는 이해할 것이다. 일 실시예에 따라서, 서버는, 303 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 하나의 선택 및/또는 수행을 확인할 수 있다. 예를 들어, 사용자는, 적어도 하나의 액티비 티 중 어느 하나를 선택하도록 사용자 장치를 조작할 수 있다. 예를 들어, 사용자 장치는, 인 어플 리케이션 액티비티 중 하나인 “게임하기”를 선택할 수 있는 UI를 제공할 수 있다. 해당 UI를 통하여, “게임 하기”의 액티비티가 선택됨에 기반하여, 사용자 장치는, 액티비티를 식별할 수 있는 정보를 서버로 송신할 수 있다. 서버는, 수신된 정보에 기반하여 “게임하기”의 액티비티가 선택됨을 확인할 수 있다. 예를 들어, 사용자 장치는, 가상 공간 내에서의 사용자의 활동에 기반하여, 특정 액티비티가 선택됨을 확 인할 수 있다. 예를 들어, 사용자 장치는, 서버로부터의 데이터에 기반하여, 제 1 사용자에 대하여개인적으로 할당된 가상 공간(이하, 마이룸(myroom)으로 명명될 수 있음)을 제공할 수 있다. 사용자 장치(11 0)는, 제 1 사용자로부터, 제 1 사용자의 마이룸을 꾸미기 위한 적어도 하나의 동작(예를 들어, 아이템의 배치, 및/또는 아이템의 교체이지만 제한이 없음)과 연관된 입력을 확인할 수 있다. 사용자 장치는, 해당 입력 을 서버로 송신할 수 있다. 서버는, 해당 입력에 기반하여 제 1 사용자의 마이룸 꾸미기가 선택 및/ 또는 수행됨을 확인할 수 있다. 서버는, 인 어플리케이션 액티비티에 포함되는 “마이룸 꾸미기”가 선택 및/또는 수행됨을 확인할 수 있다. 서버는, 해당 입력에 기반하여, 제 1 사용자의 마이룸을 변경 및/또 는 생성할 수 있다. 서버는, 변경 및/또는 생성된 제 1 사용자의 마이룸을 표현하기 위한 데이터를 사용 자 장치로 송신할 수 있다. 사용자 장치는, 수신된 데이터에 기반하여, 변경 및/또는 생성된 제 1 사용자의 마이룸을 표현하기 위한 적어도 하나의 동작을 수행할 수 있다. 또는, 하나의 예에서, 서버는, 제 1 사용자와 연관된 제 2 사용자(예를 들어, 제 1 사용자의 친구로 등록된 사용자)로부터의 요청에 기반하여, 선택 가능한 적어도 하나의 액티비티 중 하나를 선택 가능한(또는, 제 2 사용자가 선택한 액티비티를 함께 수행 할 지 여부를 문의하기 위한) 가상 공간을 표현하기 위한 데이터를 생성하여 사용자 장치로 송신할 수 있 다. 한편, 도 3a의 실시예 및 본 개시의 다른 실시예들에서의 “가상 공간에서 선택 가능한 적어도 하나의 액 티비티”는, 아바타 및/또는 오브젝트가 배치되는 가상 공간에서 선택 및/또는 수행될 수 있는 액티비티를 의미 할 수 있고, 및/또는 해당 가상 공간에서 벗어난 다른 화면(예를 들어, 설정 화면, 게임 준비 화면, 등 제한이 없음)에서의 선택 및/또는 수행될 수 있는 액티비티를 의미할 수 있음을 당업자는 이해할 것이다. 일 실시예에 따라서, 서버는, 305 동작에서, 선택된 액티비티의 타입을 확인할 수 있다. 예를 들어, 서버 는, 선택 가능한 적어도 하나의 액티비티의 타입을 인 어플리케이션 액티비티 및 아웃도어 액티비티로 구 분하여 관리할 수 있다. [표 1]은, 인 어플리케이션 액티비티 및 아웃도어 액티비티에 포함된 액티비티로, 이 는 예시적인 것으로 제한이 없음을 당업자는 이해할 것이다. 표 1"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "하나의 예에서, 인 어플리케이션 액티비티는, 가상 공간 내에 포함된 다른 사용자 아바타 및/또는 NPC 아바타와 의 인터랙션을 포함할 수도 있다. [표 2]는, 예를 들어 인 어플리케이션 액티비티 각각에 대한 설명, 챌린지(예를 들어, 완료 시 보상이 주어지는 미션을 의미할 수 있음)에 대한 설명, 난이도 및/또는 수행 시간, 보상(예를 들어, 코인 및/또는 하트)에 대한 예시이다. 표 2"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "[표 3]은, 예를 들어 인 어플리케이션 액티비티 각각에 대한 설명, 챌린지(예를 들어, 완료 시 보상이 주어지는 미션을 의미할 수 있음)에 대한 설명, 난이도 및/또는 수행 시간, 보상(예를 들어, 코인 및/또는 하트)에 대한 예시이다. 표 3"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "서버는, 선택 및/또는 수행된 액티비티의 타입을 인 어플리케이션 액티비티 또는 아웃도어 액티비티 중 하 나로서 확인할 수 있다. 액티비티의 타입이 인 어플리케이션 액티비티로 확인되는 경우, 일 실시예에 따라서, 서버는, 307 동작에 서, 제 1 타입의 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치(예를 들어, 사용자 장치) 로 제공할 수 있다. 보상 세트의 제공을 나타내기 위한 데이터는, 예를 들어 사용자의 액티비티의 선택 및/또 는 수행에 기반한 제 1 타입의 보상 세트가 제공됨을 나타내기 위한 데이터일 수 있다. 서버는, 309 동작 에서, 제 1 사용자에 대응하여 제 1 타입의 보상 세트를 반영할 수 있다. 예를 들어, 서버는, 제 1 사용 자와 연관된 재화에 대하여 제 1 타입의 보상 세트를 추가적으로 반영할 수 있다. 액티비티의 타입이 아웃도어 액티비티로 확인되는 경우, 서버는, 311 동작에서, 제 2 타입의 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치(예를 들어, 사용자 장치)로 제공할 수 있다. 보상 세트 의 제공을 나타내기 위한 데이터는, 예를 들어 사용자의 액티비티의 선택 및/또는 수행에 기반한 제 2 타입의 보상 세트가 제공됨을 나타내기 위한 데이터일 수 있다. 서버는, 313 동작에서, 제 1 사용자에 대응하여 제 2 타입의 보상 세트를 반영할 수 있다. 예를 들어, 서버는, 제 1 사용자와 연관된 재화에 대하여 제 2 타입의 보상 세트를 추가적으로 반영할 수 있다. 한편, 서버는, 아웃도어 액티비티의 완료의 유효성을 검 증하기 위한 적어도 하나의 검증 알고리즘을 저장 및/또는 실행할 수 있다. 예를 들어, 일부 사용자가 특정 위 치에 도달하기 위한 아웃도어 액티비티의 완료를 기만하기 위하여, 사용자 장치의 GPS를 위조할 수도 있으 며, 서버는 아웃도어 액티비티의 완료의 유효성을 검증하기 위한 알고리즘의 실행에 기반하여, 해당 액티 비티의 완료 여부의 유효성을 확인할 수도 있다.하나의 예에서, 제 1 타입의 보상 세트는 제 1 수량의 제 1 재화를 포함할 수 있으며, 제 2 타입의 보상 세트는 제 2 수량의 제 1 재화를 포함할 수 있다. 즉, 제 1 타입의 보상 세트 및 제 2 타입의 보상 세트는, 동일한 종 류의 재화를 포함하되, 1개 종류의 재화의 수량이 상이할 수 있다. 하나의 예에서, 제 1 타입의 보상 세트는 제 1 수량의 제 1 재화를 포함할 수 있으며, 제 2 타입의 보상 세트는 제 2 수량의 제 2 재화를 포함할 수 있다. 즉, 제 1 타입의 보상 세트 및 제 2 타입의 보상 세트는, 상이한 종 류의 재화를 포함하되, 1개 종류의 재화의 수량이 상이할 수 있지만, 경우에 따라 그 수량이 동일할 수도 있다. 하나의 예에서, 제 1 타입의 보상 세트는 제 1 수량의 제 1 재화 및 제 2 수량의 제 2 재화를 포함할 수 있으며, 제 2 타입의 보상 세트는 제 3 수량의 제 1 재화 및 제 4 수량의 제 2 재화를 포함할 수 있다. 제 1 수량 및 제 3 수량은 동일하거나 또는 상이할 수 있다. 제 3 수량 및 제 4 수량은 동일하거나 또는 상이할 수 있다. 예를 들어, 제 1 재화는 코인(coin)으로 명명될 수 있으며, 제 1 그룹에 포함된 아이템의 구매에 이용될 수 있다. 예를 들어, 제 2 재화는 하트(heart)로 명명될 수 있으며, 제 2 그룹에 포함된 아이템의 구매에 이용 될 수 있다. 여기에서, 제 2 그룹은, 예를 들어 제 1 그룹과 상이하게 설정되거나, 제 1 그룹의 일부 아이템을 포함하게 설정되거나, 제 1 그룹의 일부 아이템과 제 1 그룹에 포함되지 않는 아이템을 포함하도록 설정되거나, 제 1 그룹 전체 아이템과 제 1 그룹에 포함되지 않는 아이템을 포함하도록 설정되는 등 다양하게 설정될 수 있 으며, 그룹들의 설정 방식에는 제한이 없다. 하나의 예에서, 재화의 종류에 따라, 재화가 이용될 수 있는 아 이템, 액티비티, 및/또는 이벤트의 종류가 상이하게 설정될 수 있다. 예를 들어, 제 2 재화로 제 1 아이템의 구매, 제 1 액티비티의 수행, 및/또는 제 1 이벤트의 참여가 가능하도록 설정되나, 제 1 재화로 제 1 아이템의 구매, 제 1 액티비티의 수행, 및/또는 제 1 이벤트의 참여는 불가능하도록 설정될 수 있다. 예를 들어, 제 2 재화로 제 1 이벤트에는 참여하도록 설정될 수 있으나, 제 1 재화로는 제 1 이벤트에 참여가 불가능하도록 설정 될 수도 있다. 하나의 예에서, 인 어플리케이션 액티비티에 대하여 설정된 제 1 보상 세트는, 모든 인 어플리 케이션 액티비티에 대하여 동일하게 설정될 수 있거나, 또는 인 어플리케이션 액티비티 내에서도 액티비티의 종 류에 따라서 보상 세트가 상이하게 설정될 수도 있다. 하나의 예에서, 인 어플리케이션 액티비티 및/또는 아웃도어 액티비티에 대하여 설정된 보상 세트는 지정된 것 일 수 있다. 하나의 예에서, 인 어플리케이션 액티비티 및/또는 아웃도어 액티비티에 대하여 설정된 보상 세트 는 변경 가능하도록 설정될 수도 있다. 예를 들어, 사용자의 현재 건강 상태(예를 들어, 건강 레벨로 수치화되 어 표현될 수도 있으나 제한은 없음), 및/또는 기존 액티비티의 수행 이력에 기반하여, 보상 세트가 설정될 수 도 있다. 예를 들어, 사용자의 현재 건강 상태가 집중도가 요구됨을 나타내는 경우, 집중력 향상과 연관된 액 티비티에 대하여 상대적으로 큰 수량의 보상 세트가 설정될 수 있다. 예를 들어, 사용자의 현재 건강 상태가 아웃도어 액티비티가 요구됨을 나타내는 경우, 아웃도어 액티비티에 대하여 상대적으로 큰 수량의 보상 세트가 설정될 수도 있다. 예를 들어, 사용자의 기존 수행 이력이 아웃도어 액티비티가 부족하다고 판단되는 경우(예 를 들어, 지정된 기간 동안의 아웃도어 액티비티의 횟수가 상대적으로 작은 수치이거나, 및/또는 전체 액티비티 수행에 대한 아웃도어 액티비티의 수행 비율이 상대적으로 작은 경우), 아웃도어 액티비티에 대하여 상대적으로 큰 수량의 보상 세트가 설정될 수도 있다. 한편, 일 실시예에서, 인 어플리케이션 액티비티에 대응하는 제 1 보상 세트 및 아웃도어 액티비티에 대응하는 제 2 보상 세트는 동일하게 설정될 수도 있다. 도 3b는 일 실시예에 따른 인 어플리케이션 액티비티 및 아웃도어 액티비티에 대한 보상 세트의 예시를 도시한 다. 도 3b에 도시된 바와 같이, 인 어플리케이션 액티비티에 대하여서는, 하트 1개 및 코인 100개의 보상 세트가 설정될 수 있다. 아웃도어 액티비티에 대하여서는, 하트 2개 및 코인 200개의 보상 세트가 설정될 수 있다. 예를 들어, 하트로는 특수 아이템(special item) 및 일반적인 아이템을 모두 구매(purchase)하도록 설정될 수 있으며, 코인으로는, 일반적인 아이템의 구매만이 허용되고, 특수 아이템에 대한 구매는 허용하지 않도록 설정될 수도 있다. 도 3b의 실시예에서는, 아웃도어 액티비티에 대하여, 인 어플리케이션 액티비티에 비하여 상대적으로 큰 수량의 보상에 할당됨을 확인할 수 있지만, 이는 단 순히 예시적인 것이다. 구현에 따라, 아웃도어 액티비티보다 인 어플리케이션 액티비티에 대하여 더 큰 수량의 보상이 할당될 수도 있음을 당업자는 이해할 것이다. 예를 들어, 사용자의 현재 상태가 집중력을 요구하는 것 이 확인되거나, 및/또는 사용자가 상대적으로 장시간 아웃도어 액티비티를 수행한 이력이 확임됨에 기반하여, 아웃도어 액티비티보다 인 어플리케이션 액티비티의 보상이 크게 설정될 수도 있으며, 액티비티 별 보상 설정 방식에는 제한이 없음을 당업자는 이해할 것이다. 도 3c는 일 실시예에 따른 인 어플리케이션 액티비티 및 아웃도어 액티비티에 대한 보상 세트의 예시를 도시한 다. 도 3c에 도시된 바와 같이, 인 어플리케이션 액티비티에 대하여서는, 코인 100개의 보상 세트가 설정될 수 있다. 아웃도어 액티비티에 대하여서는, 하트 2개 및 코인 200개의 보상 세트가 설정될 수 있다. 도 3c의 실시예에서는, 인 어플리케이션 액티비티에 대하여 1개 종류(예를 들어, 코인)의 보상이 설정되고, 아웃도어 액티비티에 대하여 2개 종류의 보상이 설정될 수 있지만, 이는 단순히 예시적인 것이다. 구현에 따라, 아웃도어 액티비티보다 인 어플리케이션 액티비티에 대하여 더 많은 종류의 보상이 할당될 수도 있음을 당업자는 이해할 것이다. 도 3d는 일 실시예에 따른 인 어플리케이션 액티비티 및 아웃도어 액티비티에 대한 보상 세트의 예시를 도시한 다. 도 3d에 도시된 바와 같이, 인 어플리케이션 액티비티에 대하여서는, 코인 100개의 보상 세트가 설정될 수 있다. 아웃도어 액티비티에 대하여서는, 하트 2개의 보상 세트가 설정될 수 있다. 도 3d의 실시예에서는, 인 어플리케이션 액티비티 및 아웃도어 액티비티에 대하여, 각각 상이한 타입의 재화가 설정됨을 확인할 수 있지만, 이는 단순히 예시적인 것이다. 도 4a는 일 실시예에 따른 인 어플리케이션 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 일 실시예에 따라서, 서버 및 사용자 장치는, 400 동작에서, 제 1 사용자 계정에 기반한 접속 절차를 수행할 수 있다. 예를 들어, 사용자 장치는, 제 1 사용자의 계정과 연관된 정보(예를 들어, 제 1 사용자 식별자 및/또는 제 1 사용자 PIN)을 서버로 송신할 수 있다. 서버는, 제 1 사용자의 계정과 연관된 정보를 수신할 수 있다. 서버는, 제 1 사용자의 계정과 연관된 정보에 기반하여, 접속 절차(또는, 로그인 절차로도 명명됨)를 수행할 수 있다. 예를 들어, 서버는, 수신된 제 1 사용자의 계정과 연관된 정보와, 기 저장된 제 1 사용자의 계정과 연관된 정보가 일치하는지 여부에 기반하여, 제 1 사용자의 접속 허가 여부를 결정할 수 있다. 한편, 상술한 제 1 사용자의 계정과 연관된 정보에 기반한 접속 절차는 단순히 예시적인 것으 로, 접속 절차에 대한 제한이 없음을 당업자는 이해할 것이다. 일 실시예에 따라서, 사용자 장치는, 401 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 인 어플리케이션 액티비티의 선택 및/또는 수행을 확인할 수 있다. 사용자 장치 는, 403 동작에서, 인 어플리케이션 액티비티의 선택 및/또는 수행을 나타내는 정보를 서버로 제공할 수 있다. 서버는, 인 어플리케이션 액티비티의 선택 및/또는 수행을 나타내는 정보에 기반하여, 사용자에 의하여 인 어플리케이션 액티비티가 선택되거나, 및/또는 수행됨을 확인할 수 있다. 하나의 예에서, 사용자 장 치는, 서버로부터의 데이터에 적어도 기반하여, 적어도 하나의 액티비티 중 어느 하나를 선택할 수 있는 UI를 제공할 수 있다. 사용자 장치는, UI를 통하는 적어도 하나의 액티비티 중 어느 하나를 선택하 는 사용자 명령을 확인할 수 있다. 사용자 장치는, 사용자 명령에 기반하여 인 어플리케이션 액티비티의 선택을 확인할 수 있다. 하나의 예에서, 사용자 장치는, 선택 가능한 적어도 하나의 미니 게임(예를 들어, 스포츠 게임, 퍼즐 게임, 보드 게임) 중 “스포츠 게임”이 선택됨을 확인할 수 있다. 사용자 장치(11 0)는, “스포츠 게임”이 선택됨을 나타내는 정보를 서버로 제공할 수 있다. 일 실시예에 따라서, 서버는, 405 동작에서, 사용자 장치로, 인 어플리케이션 액티비티에 대응하는 데이터를 제공할 수 있다. 사용자 장치는, 407 동작에서, 인 어플리케이션 액티비티에 대응하는 가상 컨 텐트를 제공할 수 있다. 만약, “스포츠 게임”의 인 어플리케이션 액티비티가 선택됨이 확인되는 경우, 서버 는, 사용자 장치로 인 어플리케이션 액티비티에 대응하는 데이터로서, “스포츠 게임”의 진행을 위 한 데이터를 송신할 수 있다. 사용자 장치는, 수신한 “스포츠 게임”의 진행을 위한 데이터에 기반하여, 사용자 단독으로, 또는 다른 사용자와 함께 수행 가능한 스포츠 게임을, 가상 컨텐트로서 제공할 수 있다. 사 용자 장치는, 409 동작에서, 가상 컨텐트와 연관된 사용자 입력을 확인할 수 있다. 예를 들어, 사용자 장 치가 “스포츠 게임”을 가상 컨텐트로서 제공하는 동안, 사용자는 스포츠 게임의 수행을 위한 적어도 하 나의 사용자 입력을 조작으로서 입력할 수 있다. 사용자 장치는, 411 동작에서, 사용자 입력에 대응하는 요청(request)을 서버로 송신할 수 있다. 해당 요청은 어플리케이션에서(또는, 어플리케이션에 포함된 게 임에서) 정의된 요청일 수 있다. 서버는, 413 동작에서, 요청에 대응하는 응답(response)을 사용자 장치 로 제공할 수 있다. 사용자 장치는, 415 동작에서, 응답에 대응하는 가상 컨텐트를 제공할 수 있다. 예를 들어, “스포츠 게임”의 인 어플리케이션 액티비티가 실행 중인 경우에는, 사용자 장치는, 사용자의 입력에 대응하는 컨텐트를 서버로부터 수신하여 제공할 수 있다. 서버는, 417 동작에서, 액티비티의완료 여부를 확인할 수 있다. 예를 들어, 서버는, 액티비티의 완료 여부에 기반하여 보상 세트를 제공할 수 있다. 한편, 이는 예시적인 것으로, 서버는 액티비티의 시작 여부에 기반하여 보상 세트를 제공할 수 도 있으며, 보상 시점 및/또는 보상 조건에는 제한이 없다. 예를 들어, 액티비티의 선택, 시작, 진행, 및/또는 완료 중 적어도 하나의 시점에서 보상 세트가 제공될 수 있다. 한편, 하나의 예에서, 적어도 하나의 액티비티가 포함된 리스트에 대한 사용자의 선택 기반이 아닌, 가상 공간 내에서의 지정된 명령에 기반하여서도 인 어플리케이션 액티비티가 선택 및/또는 수행될 수도 있다. 하나의 예 에서, 사용자 장치는, 서버로부터의 데이터에 적어도 기반하여, 가상 공간을 표현하기 위한 적어도 하나의 동작을 수행할 수 있다. 가상 공간 내에는, 사용자의 아바타(또는, 캐릭터) 및/또는 적어도 하나의 다 른 오브젝트(예를 들어, 가상 공간을 구성하는 오브젝트 및/또는 다른 사용자의 아바타(또는, 캐릭터)가 포함될 수 있다. 사용자 장치는, 특정 명령(예를 들어, 아바타의 동작 수행, 아바타의 이동, 아바타의 다른 오브 젝트와의 인터랙션, 아바타의 다른 사용자의 아바타와의 인터랙션 및/또는 가상 공간 내의 오브젝트에 대한 지 정 및/또한 조작)을 위한 사용자 입력을 획득할 수 있다. 사용자 장치는, 사용자 입력을 그대로 서버 로 송신하거나, 및/또는 사용자 입력에 매핑되는 특정 명령을 확인하여 확인된 특정 명령을 서버로 송신할 수 있다. 서버는, 수신된 사용자 입력에 기반하여 이에 대응하는 명령을 확인하거나, 및/또는 수 신된 명령을 확인할 수 있다. 서버는, 확인된 명령이 인 어플리케이션 액티비티에 대응함을 확인할 수 있 다. 예를 들어, 확인된 명령이, 가상 공간 내에 정의된 사용자 공간으로의 오브젝트(또는, 아이템) 배치인 것으로 확인되는 경우, 서버는, 확인된 명령에 기반하여 “가상 공간 내에 정의된 사용자 공간(마이룸)을 꾸 미기”의 인 어플리케이션 액티비티가 선택 및/또는 수행됨을 확인할 수 있다. 예를 들어, 확인된 명령이, 다 른 사용자로의 텍스트 및/또는 음성 전송의 요청인 경우, 서버는, 확인된 명령에 기반하여 “다른 사용자 와 대화하기”의 인 어플리케이션 액티비티가 선택 및/또는 수행됨을 확인할 수 있다. 한편, 상술한 인 어플리 케이션 액티비티의 선택 및/또는 수행을 확인하는 것은 단순히 예시적인 것으로, 제한이 없음을 당업자는 이해 할 것이다. 이 경우, 서버는, 인 어플리케이션 액티비티의 표현을 위한 데이터를 사용자 장치로 제 공할 수 있다. 예를 들어, “가상 공간 내에 정의된 사용자 공간(마이룸)을 꾸미기”의 인 어플리케이션 액티 비티의 선택이 확인된 경우, 서버는, 사용자 공간에 특정 아이템을 배치한 결과를 표현하기 위한 데이터를 사용자 장치로 송신할 수 있다. 사용자 장치는, 서버로부터 수신된 데이터에 기반하여, 특정 아이템이 사용자 공간에 배치된 가상 컨텐트를 제공할 수 있다. 예를 들어, “다른 사용자와 대화하기”의 인 어플리케이션 액티비티의 선택이 확인된 경우, 서버는, 다른 사용자로의 텍스트 및/또는 음성을 제공한 결 과를 표현하기 위한 데이터를 사용자 장치로 송신할 수 있다. 사용자 장치는, 서버로부터 수신 된 데이터에 기반하여, 다른 사용자에게 텍스트 및/또는 음성이 제공됨을 나타내는 가상 컨텐트를 제공할 수 있 다. 한편, 상술한 인 어플리케이션 액티비티에 대응하는 데이터는 단순히 예시적인 것으로, 제한이 없음을 당 업자는 이해할 것이다. 상술한 바와 같이, 리스트에 대한 사용자의 선택 기반이 아닌, 가상 공간 내에서의 지 정된 명령에 기반하여서도 인 어플리케이션 액티비티가 선택 및/또는 수행될 수도 있으며, 이 경우에는 도 4a에 서의 일부 동작(예를 들어, 401 동작, 403 동작, 405 동작, 및/또는 407 동작이지만 제한이 없음)이 생략될 수 도 있음을 당업자는 이해할 수 있을 것이다. 한편, 상술한 리스트로부터의 어느 하나에 대한 선택에 기반한 인 어플리케이션 액티비티의 선택 및/또는 수행 확인과, 본 실시예에서와 같은 가상 공간 내에서의 사용자 명령에 기반한 인 어플리케이션 액티비티의 선택 및/또는 수행 확인은, 도 4a와 연관된 실시예뿐만 아니라 본 개시의 전반에서 서로 교환적으로 이용될 수 있음을 당업자는 이해할 것이다. 도 4b는 일 실시예에 따른 아웃도어 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도 이다. 일 실시예에 따라서, 서버 및 사용자 장치는, 430 동작에서, 제 1 사용자 계정에 기반한 접속 절차를 수행할 수 있다. 접속 절차와 관련하여서는, 도 4a를 참조하여 설명하였으므로, 여기에서는 설명이 반복되지 않는다. 일 실시예에 따라서, 사용자 장치는, 431 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 아웃 도어 액티비티의 선택 및/또는 수행을 확인할 수 있다. 하나의 예시에서, 사 용자 장치는, 서버로부터 수신한 데이터에 기반하여, 적어도 하나의 아웃도어 액티비티 중 하나를 선 택할 수 있는 UI를 제공할 수 있다. 사용자 장치는, UI를 통하는 적어도 하나의 액티비티 중 어느 하나를 선택하는 사용자 명령을 확인할 수 있다. 사용자 장치는, 사용자 명령에 기반하여 아웃도어 액티비티의 선택을 확인할 수 있다. 하나의 예에서, 사용자 장치는, 선택 가능한 적어도 하나의 아웃도어 액티비티 중 “실제 환경에서의 지정된 장소 방문하기”가 선택됨을 확인할 수 있다. 사용자 장치는, “실제 환경에서의 지정된 장소 방문하기”가 선택됨을 나타내는 정보를 서버로 제공할 수 있다. 사용자 장치는, 433 동작에서, 아웃도어 액티비티의 선택 및/또는 수행을 나타내는 정보를 서버로 제공할 수 있다. 일 실시예에 따라서, 서버는, 435 동작에서, 사용자 장치로, 아웃도어 액티비티에 대응하는 데이터를 제공할 수 있다. 사용자 장치는, 437 동작에서, 아웃도어 액티비티에 대응하는 가상 컨텐트를 제공할 수 있다. 만약, “실제 환경에서의 지정된 장소 방문하기”의 아웃도어 액티비티가 선택됨이 확인되는 경우, 서버 는, 사용자 장치로 아웃도어 액티비티에 대응하는 데이터로서, “실제 환경에서의 지정된 장소 방문 하기”의 진행을 위한 데이터를 송신할 수 있다. 사용자 장치는, 수신한 “실제 환경에서의 지정된 장소 방문하기”의 진행을 위한 데이터에 기반하여, 예를 들어, 실제 장소까지 인도를 위한 네비게이션 화면을 가상 컨텐트로서 제공할 수 있다. 한편, 상술한 서버로부터의 데이터 제공에 기반한 가상 컨텐트의 제공은 예 시적인 것으로, 경우에 따라 생략 가능할 수도 있음을 당업자는 이해할 것이다. 예를 들어, 인도를 위한 네비 게이션 화면은 표시되지 않을 수도 있거나, 또는 서버로부터의 데이터 없이 사용자 장치가 단독으로 구성할 수도 있음을 당업자는 이해할 것이다. 이 경우, 서버는, 아웃도어 액티비티가 선택 및/또는 수행 됨을 확인하고, 사용자 장치로 별다른 데이터를 제공하지 않도록 설정될 수도 있다. 일 실시예에 따라서, 사용자 장치는, 439 동작에서, 센싱 데이터를 확인할 수 있다. 사용자 장치는, 사용자 장치에 포함된 센서 및/또는 근거리 통신에 기반하여 연결된 외부 센서 장치로부터의 적 어도 하나의 센싱 데이터를 확인할 수 있다. 센싱 데이터는, 예를 들어 움직임 정보를 확인하기 위한 센싱 데 이터, 위치를 확인하기 위한 센싱 데이터, 및/또는 사용자의 생체 관련 정보를 확인하기 위한 센싱 데이터를 포 함할 수 있지만, 제한이 없음을 당업자는 이해할 것이다. 예를 들어, 사용자 장치는, 441 동작에서, 아웃 도어 액티비티에 대응하는 센싱 데이터를 서버로 송신하거나, 및/또는 센싱 데이터에 기반하여 확인되는 아웃도어 액티비티에 대응하는 정보를, 센싱 데이터에 대응하는 데이터로서 서버로 송신할 수 있다. 예를 들어, 아웃도어 액티비티가 “실제 환경에서의 지정된 장소 방문하기”인 경우, 사용자 장치는, 예를 들어 GPS 센싱 데이터를 서버로 송신할 수 있다. 예를 들어 아웃도어 액티비티가 “운동하기”인 경우, 사용자 장치는, 센싱 데이터에 기반하여 확인되는 사용자의 걸음 수, 사용자의 움직임 정도와 같은 정보를 서버 로 송신할 수 있다. 하나의 예에서, 사용자 장치는, 주기적으로 센싱 데이터 및/또는 정보를 서버 로 송신할 수 있다. 하나의 예에서, 사용자 장치는, 아웃도어 액티비티와 연관된 조건이 만족됨에 기반하여, 센싱 데이터 및/또는 정보를 서버로 송신할 수도 있다. 하나의 예에서, 사용자 장치는, GPS 정보와 함께 촬영된 전경 이미지를 더 서버로 송신할 수도 있다. 이 경우, 서버는, GSP 정보가 지정된 장소의 GPS 정보에 대응하는지 여부 및/또는 촬영된 전경 이미지가 지정된 장소의 이미지와 대응하는지 여부에 기반하여, 아웃도어 액티비티의 완료 여부를 확인할 수도 있다. 사용자 장치는, 443 동작에서, 센 싱 데이터에 기반한 컨텐트를 제공할 수 있다. 센싱 데이터에 기반한 컨텐트는, 예를 들어 아웃도어 액티비티 의 완료 여부를 판정하기 위한 정보를 포함할 수 있으나 제한은 없다. 예를 들어, 아웃도어 액티비티의 완료 여부를 판정하기 위한 정보가 “걸음 걷기”인 경우, 443 동작에서의 컨텐트는 현재까지의 걸음 수를 포함할 수 도 있으나 제한은 없다. 445 동작에서, 서버는, 액티비티의 완료 여부를 확인할 수 있다. 경우에 따라, 센싱 데이터의 제공 동작은 수행되지 않을 수도 있음을 당업자는 이해할 수 있을 것이다. 서버는, 수신된 센싱 데이터에 대응하는 데이터에 기반하여, 액티비티의 완료 여부를 판단할 수도 있으나, 제한은 없다. 한편, 상술한 바에서는, 적어도 하나의 아웃도어 액티비티 중 어느 하나를 선택할 수 있는 UI를 통한 사용자 입 력에 기반한 아웃도어 액티비티의 선택에 대하여 설명되었지만, 이는 단순히 예시적인 것이다. 예를 들어, 사 용자 장치 및/또는 서버는, 도 4a에서도 설명된 바와 같이, 가상 공간이 제공되는 동안의 사용자 입 력에 기반하여 아웃도어 액티비티의 선택을 확인할 수도 있다. 예를 들어, 가상 공간에 포함된 오브젝트, 자신 의 아바타 및/또는 다른 사용자의 아바타에 대한 인터랙션이 아웃도어 액티비티에 연관될 수도 있다. 사용자 장 치 및/또는 서버는, 오브젝트, 자신의 아바타 및/또는 다른 사용자와의 인터랙션에 기반하여 아웃도 어 액티비티의 선택 및/또는 수행 여부를 확인할 수도 있다. 또는, 사용자 장치 및/또는 서버는, 사 용자 장치에 설치되거나, 및/또는 제 1 사용자 계정에 연관되는 다른 어플리케이션으로부터의 정보에 기반 하여, 아웃도어 액티비티의 선택 및/또는 수행을 확인할 수 있다. 예를 들어, 상술한 정신 건강의 증진을 위한 어플리케이션 이외에도, 모바일 건강 어플리케이션이 사용자 장치에 설치될 수도 있다. 모바일 건강 어플 리케이션은, 사용자 건강과 연관된 정보를 획득 및/또는 관리할 수 있다. 예를 들어, 사용자 건강과 연관된 정 보는, 사용자의 수면과 연관된 정보, 사용자의 영양 섭취와 연관된 정보, 사용자의 신체와 연관된 정보(예를 들 어, 체중, 체지방, 체질량, 및/또는 체온을 포함하지만 제한이 없음), 및/또는 심장 활동과 연관된 정보(심박수, 및/또는 심박 변이를 포함하지만 제한이 없음)을 획득 및/또는 관리할 수 있다. 어플리케이션은,모바일 건강 어플리케이션으로부터, 사용자 건강과 연관된 정보를 획득할 수 있다. 사용자 장치 및/또는 서버는, 획득된 사용자 건강과 연관된 정보에 기반하여, 아웃도어 액티비티의 선택 및/또는 수행 여부를 판단할 수 있다. 예를 들어, 건강과 연관된 정보로서, 심박 변이(HRV)가 증가하고, 휴식기 심박수가 감소하고, 걷기 심박수가 감소함이 확인됨에 기반하여, 사용자 장치 및/또는 서버는, 심장 운동과 연관된 아웃 도어 액티비티가 선택 및/또는 수행됨을 확인할 수도 있다. 도 4a 및 4b를 참조하여 설명한 바와 같이, 인 어플리케이션 액티비티의 경우에는, 도 4a의 411 동작에서의 서 버로의 요청 및 413 동작에서의 서버로부터의 응답에 기반하여 액티비티가 수행될 수 있다. 한편, 아웃도어 액티비티의 경우에는, 도 4b에서 설명된 바와 같이, 서버로부터의 응답에 기반한 액티비티의 수 행 여부(또는, 완료 여부와 교환적으로 이용될 수 있음)가 결정되는 것이 아니라, 사용자 장치에 포함된 센서 및/또는 사용자 장치와 근거리 통신에 기반하여 연결된 외부 센서 장치에 의하여 획득되는 센싱 데이터에 적어도 기반하여 액티비티의 수행 여부(또는, 완료 여부)가 판단될 수 있지만, 이는 예시적인 구 분 기준일 수 있다. 도 5a는 다른 실시예에 따른 인 어플리케이션 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위 한 흐름도이다. 일 실시예에 따라서, 서버 및 사용자 장치는, 500 동작에서, 제 1 사용자 계정에 기반한 접속 절차를 수행할 수 있다. 사용자 장치는, 501 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어 도 하나의 액티비티 중 인 어플리케이션 액티비티의 선택 및/또는 수행을 확인할 수 있다. 사용자 장치는, 503 동작에서, 인 어플리케이션 액티비티의 선택 및/또는 수행을 나타내는 정보를 서버로 제 공할 수 있다. 서버는, 505 동작에서, 사용자 장치로, 인 어플리케이션 액티비티에 대응하는 데이터 를 제공할 수 있다. 사용자 장치는, 507 동작에서, 인 어플리케이션 액티비티에 대응하는 가상 컨텐트를 제공할 수 있다. 500 동작 내지 507 동작에 대하여서는, 상세하게 전술하였으므로, 여기에서 설명이 반복되지 는 않는다. 일 실시예에 따라서, 사용자 장치는, 509 동작에서, 입력 장치를 통한 사용자 입력을 확인할 수 있다. 입 력 장치는, 예를 들어 사용자의 물리적인 신체 움직임의 측정과는 무관하게 설정된 입력 장치로, 예를 들어 터 치스크린 디스플레이, 터치 패드, 스타일러스 펜을 검출하기 위한 디지타이저 및/또는 버튼을 포함할 수 있으나 제한은 없다. 사용자 장치는, 예를 들어 인 어플리케이션 액티비티와 연관된 컨텐트가 출력되는 동안에, 입력 장치를 통한 사용자 입력을 확인할 수 있으나 제한은 없다. 예를 들어, 인 어플리케이션 액티비티가 “스 포츠 게임”인 경우에는, “스포츠 게임”의 컨텐트가 제공되는 동안에, 조작을 위한 사용자 입력이 확인될 수 있다. 사용자 장치는, 511 동작에서, 사용자 입력에 대응하는 데이터를 서버로 제공할 수 있다. 서 버는, 513 동작에서, 사용자 입력에 기반하여 확인되는 컨텐트 제공을 위한 데이터를 사용자 장치로 제공할 수 있다. 예를 들어, “스포츠 게임”의 조작을 위한 사용자 명령이 서버로 제공되면, 서버 는 해당 조작을 반영한 컨텐트를 사용자 장치로 송신할 수 있으나, 제한은 없다. 사용자 장치는, 515 동작에서, 서버로부터 수신된 데이터에 기반하여 가상 컨텐트를 제공할 수 있다. 서버는, 517 동작에서, 인 어플리케이션 액티비티의 완료 여부를 판단할 수 있다. 도 5b는 다른 실시예에 따른 아웃도어 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름 도이다. 일 실시예에 따라서, 서버 및 사용자 장치는, 530 동작에서, 제 1 사용자 계정에 기반한 접속 절차를 수행할 수 있다. 사용자 장치는, 531 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어 도 하나의 액티비티 중 아웃 도어 액티비티의 선택 및/또는 수행을 확인할 수 있다. 사용자 장치는, 533 동작에서, 아웃도어 액티비티의 선택 및/또는 수행을 나타내는 정보를 서버로 제공할 수 있다. 일 실시예 에 따라서, 서버는, 535 동작에서, 사용자 장치로, 아웃도어 액티비티에 대응하는 데이터를 제공할 수 있다. 사용자 장치는, 537 동작에서, 아웃도어 액티비티에 대응하는 가상 컨텐트를 제공할 수 있다. 530 동작 내지 537 동작에 대하여서는, 상세하게 전술하였으므로, 여기에서 설명이 반복되지는 않는다. 일 실시예에 따라서, 사용자 장치는, 539 동작에서, 센서에 기반한 센싱 데이터를 확인할 수 있다. 예를 들어, 사용자 장치는, 사용자 장치에 포함된 센서 및/또는 근거리 통신에 기반하여 연결된 외부 센서 장치로부터의 적어도 하나의 센싱 데이터를 확인할 수 있다. 센서 및/또는 근거리 통신에 기반 하여 연결된 외부 센서 장치는, 예를 들어 인 어플리케이션 액티비티의 조작과는 독립적인 장치일 수 있다. 541 동작에서, 사용자 장치는, 서버로 센싱 데이터를 제공할 수 있다. 사용자 장치는,543 동작에서, 센싱 데이터에 기반한 컨텐트를 제공할 수 있다. 서버는, 545 동작에서, 액티비티의 완료 여부를 확인할 수 있다. 도 5a 및 5b를 참조하여 설명한 바와 같이, 인 어플리케이션 액티비티의 경우에는, 입력 장치에 기반하여 획득 된 사용자 입력에 기반하여 액티비티가 수행될 수 있다. 한편, 아웃도어 액티비티의 경우에는, 도 5b에서 설명 된 바와 같이, 사용자 장치에 포함된 센서 및/또는 사용자 장치와 근거리 통신에 기반하여 연결 된 외부 센서 장치에 의하여 획득되는 센싱 데이터에 기반하여 액티비티가 수행될 수 있다. 상술한 바와 같이, 하나의 예에서, 인 어플리케이션 액티비티 및 아웃도어 액티비티는, 수행에 요구되는 데이터를 수집(또는, 획득)하는 하드웨어에 의하여 구분될 수도 있지만 이는 예시적인 구분 기준일 수 있다. 한편, 인 어플리케이션 액티비티의 수행을 위한 데이터 수집(또는, 획득을 위한) 적어도 하나의 하드웨어 중 적어도 일부 는, 아웃도어 액티비티의 수행을 위한 데이터 수집(또는, 획득을 위한) 적어도 하나의 하드웨어 중 적어도 일부 와 동일할 수도 있음을 당업자는 이해할 것이다. 한편, 다른 실시예에서, 사용자 장치는, 정신 건강 어플리케이션과 상이한 어플리케이션(예를 들어, 신체 건강 어플리케이션)으로부터 데이터를 API 기반으로 수집할 수도 있다. 사용자 장치에서는, 본 개시의 다 양한 실시예들의 동작과 연관된 정신 건강 어플리케이션 및, 사용자의 신체 활동, 신체 상태, 생활 습관 등을 수집, 분석, 관리하는 신체 건강 어플리케이션이 모두 인스톨 및/또는 실행될 수 있다. 정신 건강 어플리케이 션은, 신체 건강 어플리케이션에 의한 데이터를 수신할 수 있다. 예를 들어, 정신 건강 어플리케이션은, API 기반으로, 신체 건강 어플리케이션에 의한 데이터를 수신할 수 있으나, 수신의 방식에는 제한이 없음을 당업자 는 이해할 것이다. 정신 건강 어플리케이션은, 신체 건강 어플리케이션으로부터의 데이터에 기반하여, 아웃도 어 액티비티의 선택 및/또는 실행을 수행할 수 있다. 예를 들어, 아웃도어 액티비티가 “체중 조절”인 경우, 정신 건강 어플리케이션은 신체 건강 어플리케이션으로부터 체중 및/또는 체지방 기록을 수신할 수 있다. 정신 건강 어플리케이션은, 체중 및/또는 체지방 기록이 지정된 조건을 만족하는지 여부에 기반하여, “체중 조절” 의 아웃 도어 액티비티의 수행 여부를 판단할 수 있다. 예를 들어, 아웃도어 액티비티가 “수면”인 경우, 정 신 건강 어플리케이션은 신체 건강 어플리케이션으로부터 수면 기록을 수신할 수 있다. 정신 건강 어플리케이 션은, 수면 기록이 지정된 조건을 만족하는지 여부에 기반하여, “수면”의 아웃 도어 액티비티의 수행 여부를 판단할 수 있다. 한편, 상술한 신체 건강 어플리케이션은 하나의 예시로, 정신 건강 어플리케이션에게 데이터를 제공하는 어플리 케이션의 종류에는 제한이 없음을 당업자는 이해할 것이다. 도 6a는 또 다른 실시예에 따른 인 어플리케이션 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 일 실시예에 따라서, 서버 및 사용자 장치는, 600 동작에서, 제 1 사용자 계정에 기반한 접속 절차를 수행할 수 있다. 사용자 장치는, 601 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어 도 하나의 액티비티 중 인 어플리케이션 액티비티의 선택 및/또는 수행을 확인할 수 있다. 사용자 장치는, 603 동작에서, 인 어플리케이션 액티비티의 선택 및/또는 수행을 나타내는 정보를 서버로 제 공할 수 있다. 서버는, 605 동작에서, 사용자 장치로, 인 어플리케이션 액티비티에 대응하는 데이터 를 제공할 수 있다. 사용자 장치는, 607 동작에서, 인 어플리케이션 액티비티에 대응하는 가상 컨텐트를 제공할 수 있다. 600 동작 내지 607 동작에 대하여서는, 상세하게 전술하였으므로, 여기에서 설명이 반복되지 는 않는다. 일 실시예에 따라서, 사용자 장치는, 609 동작에서, 가상 공간 내의 오브젝트와 연관된 사용자 입력을 확 인할 수 있다. 사용자 입력은, 예를 들어 인 어플리케이션 액티비티와 연관된 가상 공간이 제공되는 동안에, 해당 가상 공간 내의 오브젝트(예를 들어, 공간 내의 오브젝트, 및/또는 아바타)와 연관된 사용자 입력(예를 들 어, 지정 및/또는 조작)을 확인할 수 있다. 예를 들어, 인 어플리케이션 액티비티가 “마이룸 꾸미기”인 경우 에는, 마이룸에 대응하는 가상 공간이 제공되는 동안에, 사용자 장치 및/또는 서버는, 마이룸에 적어 도 하나의 오브젝트(또는, 아이템)을 배치시키기 위한 사용자 입력을, 가상 공간 내의 오브젝트와 연관된 사용 자 입력으로서 확인할 수 있다. 사용자 장치는, 611 동작에서, 사용자 입력에 대응하는 데이터를 서버 로 제공할 수 있다. 서버는, 613 동작에서, 컨텐트를 제공하기 위한 데이터를 사용자 장치에 제공할 수 있다. 예를 들어, 서버는, 사용자 입력에 대응하여 갱신 및/또는 생성된 가상 공간을 표현하기 위한 데이터를, 컨텐트를 제공하기 위한 데이터로서 사용자 장치로 제공할 수 있다. 예를 들어, 서버 는, 사용자 입력과 연관되는 적어도 하나의 오브젝트(또는, 아이템)이 마이룸에 배치된 가상 공간을 표현하기 위한 데이터를, 컨텐트를 제공하기 위한 데이터로서 사용자 장치에 제공할 수 있다. 사용자 장치 는, 615 동작에서, 서버로부터 수신된 데이터에 기반하여, 가상 컨텐트를 제공할 수 있다. 서버 는, 617 동작에서, 액티비티의 완료 여부를 확인할 수 있다. 도 6b는 또 다른 실시예에 따른 아웃도어 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 일 실시예에 따라서, 서버 및 사용자 장치는, 630 동작에서, 제 1 사용자 계정에 기반한 접속 절차를 수행할 수 있다. 사용자 장치는, 631 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어 도 하나의 액티비티 중 아웃 도어 액티비티의 선택 및/또는 수행을 확인할 수 있다. 사용자 장치는, 633 동작에서, 아웃도어 액티비티의 선택 및/또는 수행을 나타내는 정보를 서버로 제공할 수 있다. 일 실시예 에 따라서, 서버는, 635 동작에서, 사용자 장치로, 아웃도어 액티비티에 대응하는 데이터를 제공할 수 있다. 사용자 장치는, 637 동작에서, 아웃도어 액티비티에 대응하는 가상 컨텐트를 제공할 수 있다. 630 동작 내지 637 동작에 대하여서는, 상세하게 전술하였으므로, 여기에서 설명이 반복되지는 않는다. 일 실시예에 따라서, 사용자 장치는, 639 동작에서, 가상 공간 내의 오브젝트로부터 독립적인 센싱 데이터 를 확인할 수 있다. 예를 들어, 사용자 장치는, 사용자 장치에 포함된 센서 및/또는 근거리 통 신에 기반하여 연결된 외부 센서 장치로부터의 적어도 하나의 센싱 데이터를 확인할 수 있다. 센싱 데이 터 및/또는 센싱 데이터에 기반하여 확인되는 정보는, 예를 들어 가상 공간 내의 오브젝트의 조작으로부터 독립 적일 수 있다. 641 동작에서, 사용자 장치는, 서버로 센싱 데이터를 제공할 수 있다. 사용자 장치 는, 643 동작에서, 센싱 데이터에 기반한 컨텐트를 제공할 수 있다. 서버는, 645 동작에서, 액티비 티의 완료 여부를 확인할 수 있다. 도 6a 및 6b를 참조하여 설명한 바와 같이, 인 어플리케이션 액티비티의 경우에는, 가상 공간 내의 오브젝트와 연관된 사용자 입력에 기반하여 액티비티가 수행될 수 있다. 한편, 아웃도어 액티비티의 경우에는, 도 6b에서 설명된 바와 같이, 사용자 장치에 포함된 센서 및/또는 사용자 장치와 근거리 통신에 기반하여 연결된 외부 센서 장치에 의하여 획득되는, 가상 공간 내의 오브젝트의 지정 및/또는 조작으로부터 독립적 인 센싱 데이터에 기반하여 액티비티가 수행될 수 있다. 상술한 바와 같이, 하나의 예에서, 인 어플리케이션 액티비티 및 아웃도어 액티비티는, 수행에 요구되는 데이터가, 가상 공간 내의 오브젝트와 연관된 것인지, 또는 독립적인 것인지 여부에 의하여 구분될 수도 있지만, 이는 예시적인 구분 기준일 수 있다. 도 7a는 일 실시예에 따른 건강 상태 지표를 나타내기 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 일 실시예에 따라서, 서버는, 701 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 703 동 작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 하나의 완료를 확인할 수 있다. 예를 들어, 서버는, 사용자 장치로부터의 제공되는 데이터에 기반하여, 액티비티가 완료되 는지 여부를 확인할 수 있으나, 제한은 없다. 하나의 예에서, 서버는, 해당 액티비티가 수행(또는, 진 행)되는 시간이 임계 시간 이상인지 여부에 기반하여, 해당 액티비티의 완료 여부를 확인할 수 있다. 하나의 예에서, 서버는, 해당 액티비티가 제공하는 컨텐트의 제공 여부(예를 들어, 컨텐트 전체의 제공 여부, 또 는 컨텐트 전체 중 임계 비율(또는, 임계 시간) 이상의 컨텐트의 제공 여부 등이지만 제한이 없음)에 기반하여, 해당 액티비티의 완료 여부를 확인할 수 있다. 하나의 예에서, 서버는, 해당 액티비티에서 요구하는 사용 자 입력이 수신되었는지 여부에 기반하여, 해당 액티비티의 완료 여부를 확인할 수 있다. 하나의 예에서, 서버 는, 측정된 신호(예를 들어, 움직임과 연관된 정보 및/또는 사용자의 생체 신호이지만 제한이 없음)가 해 당 액티비티에서 요구하는 적어도 하나의 조건을 만족하는지 여부에 기반하여, 해당 액티비티의 완료 여부를 확 인할 수 있다. 한편, 상술한 액티비티의 완료 여부를 판단하기 위한 기준들은 예시적인 것이며, 제한이 없음을 당업자는 이해할 것이다. 서버는, 705 동작에서, 완료가 확인된 액티비티의 타입을 확인할 수 있다. 일 실시예에 따라서, 완료가 확인된 액티비티 타입이 인 어플리케이션 액티비티인 경우, 서버는, 707 동작 에서, 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치(예를 들어, 사용자 장치)로 제공할 수 있다. 서버는, 709 동작에서, 제 1 사용자에 대응하여 보상 세트를 반영할 수 있다. 보상 세트의 제 공을 나타내기 위한 데이터의 사용자 장치로의 제공 및/또는 제 1 사용자에 대응하여 보상 세트를 반여하는 것 은 상술하였으므로, 여기에서의 상세한 설명은 반복되지 않는다. 서버는, 711 동작에서, 인 어플리케이션 액티비티의 수행에 기반하여, 제 1 사용자의 정신 건강 상태를 나타내는 지표를 향상시킬 수 있다. 예를 들어, 지표는, 제 1 사용자의 정신 건강 상태를 나타내기 위한 숫자, 및/또는 텍스트로 표현될 수 있으나, 그 표현 형식에는 제한이 없다. 하나의 예에서, 사용자의 정신 건강 상태는, 제 1 레벨, 제 2 레벨, …, 제 N 레벨과 같은 형식으로 표현될 수 있다. 이 경우, 사용자의 정신 건강 상태는, 액티비티의 수행 여부 및/또는 측정되는 사용자의 생체 신호에 기 반하여, 유지되거나, 증가하거나, 및/또는 감소할 수 있다. 예를 들어, 사용자의 정신 건강 상태의 레벨 사이 의 변경을 위한 조건들이 설정될 수 있다. 하나의 예에서, 제 2 레벨에서 제 3 레벨로 변경되기 위한 조건(상기의 숫자는 예시적인 것임)은, 측정된 사용 자 생체 신호가 지정된 레벨 증가 조건을 만족(예를 들어, 사용자 생체 신호가 지정된 범위에 포함됨, 사용자 생체 신호가 지정된 범위에 포함된 횟수가 지정된 횟수(예를 들어, 1 이상의 자연수라면 제한이 없음)가 됨, 및 /또는 사용자 생체 신호가 지정된 범위에 포함된 기간이 지정된 기간이 됨이지만, 제한이 없음)하는 것일 수 있 다. 하나의 예에서, 제 2 레벨에서 제 3 레벨로 변경되기 위한 조건은, 액티비티의 선택 및/또는 수행이 지정 된 레벨 증가 조건을 만족(예를 들어, 액티비티의 선택 및/또는 수행의 횟수가 지정된 횟수(예를 들어, 1 이상 의 자연수라면 제한이 없음)가 됨, 및/또는 액티비티의 선택 및/또는 수행 기간이 지정된 기간이 됨이지만, 제 한이 없음)하는 것일 수 있다. 이 경우, 판단 대상의 액티비티의 종류에는 제한이 없으나, 하나의 예시에서 레 벨이 증가되기 위하여서는, 인 어플리케이션 액티비티 및 아웃도어 액티비티, 양자의 수행이 요구될 수도 있다. 한편, 일 실시예에서, 사용자의 생체 신호 및 액티비티의 수행이 레벨 증가에 모두 요구될 수도 있음을 당업자 는 이해할 것이다. 하나의 예에서, 제 2 레벨에서 제 1 레벨로 변경되기 위한 조건(상기의 숫자는 예시적인 것임)은, 측정된 사용 자 생체 신호가 지정된 레벨 감소 조건을 만족(예를 들어, 사용자 생체 신호가 지정된 범위를 벗어남, 사용자 생체 신호가 지정된 범위로부터 벗어난 횟수가 지정된 횟수(예를 들어, 1 이상의 자연수라면 제한이 없음)가 됨, 기설정된 타임 윈도우에서 및/또는 사용자 생체 신호가 지정된 범위로부터 벗어난 기간이 지정된 기간이 됨 이지만, 제한이 없음)하는 것일 수 있다. 하나의 예에서, 제 2 레벨에서 제 1 레벨로 변경되기 위한 조건은, 액티비티의 선택 및/또는 수행이 지정된 레벨 감소 조건을 만족(예를 들어, 기설정된 타임 윈도우 동안 액티비 티의 선택 및/또는 수행의 횟수가 지정된 횟수 미만으로 확인됨, 및/또는 기설정된 타임 윈도우 동안 액티비티 의 선택 및/또는 수행 기간이 지정된 기간이 미만으로 확인됨이지만, 제한이 없음)하는 것일 수 있다. 이 경우, 판단 대상의 액티비티의 종류에는 제한이 없으나, 하나의 예시에서 레벨이 증가되기 위하여서는, 인 어플 리케이션 액티비티 및 아웃도어 액티비티, 양자의 수행이 요구될 수도 있다. 한편, 일 실시예에서, 사용자의 생체 신호 및 액티비티의 수행이 레벨 감소에 모두 요구될 수도 있음을 당업자는 이해할 것이다. 하나의 예에서, 사용자의 정신 건강 상태는, 레벨의 증감 방식이 아닌, 즉각적인 점수의 형식으로 표현될 수도 있다. 예를 들어, 사용자의 생체 신호에 기반한 분석 결과로, 정신 건강 상태를 나타낼 수 있는 점수가 확인될 수도 있다. 예를 들어, 액티비티의 선택 및/또는 수행 결과로, 정신 건강 상태를 나타낼 수 있는 점수가 확인 될 수도 있다. 예를 들어, 점수는, 누적-기반으로 관리되거나, 및/또는 즉각적인 이벤트(예를 들어, 사용자 생체 신호의 확인 및/또는 액티비티의 선택 및/또는 수행)에 따라 결정될 수도 있다. 일 실시예에 따라서, 완료가 확인된 액티비티 타입이 아웃도어 액티비티인 경우, 서버는, 713 동작에서, 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치(예를 들어, 사용자 장치)로 제공할 수 있다. 서버는, 715 동작에서, 제 1 사용자에 대응하여 보상 세트를 반영할 수 있다. 서버는, 717 동작에서, 아웃도어 액티비티의 수행에 기반하여, 제 1 사용자의 정신 건강 상태를 나타내는 지표를 향상시킬 수 있다. 상술한 바와 같이, 아웃도어 액티비티 또한, 정신 건강 증진을 위한 액티비티이므로, 아웃도어 액티비 티의 수행에 기반하여, 정신 건강 상태를 나타내는 지표가 향상되도록 설정될 수 있다. 구현에 따라서, 인 어 플리케이션 액티비티에 대응하는 정신 건강 상태를 나타내는 지표의 향상 정도와, 아웃도어 액티비티에 대응하 는 정신 건강 상태를 나타내는 지표의 향상 정도는 상이하게 설정될 수 있거나, 또는 동일하게 설정될 수도 있 다. 또는, 인 어플리케이션 액티비티에 대응하는 건강 상태를 나타내는 지표의 향상 정도 및/또는 아웃도어 액 티비티에 대응하는 건강 상태를 나타내는 지표의 향상 정도는, 변경될 수도 있다. 또는, 인 어플리케이션 액티 비티에 대응하는 건강 상태를 나타내는 지표의 향상 정도 및/또는 아웃도어 액티비티에 대응하는 건강 상태를 나타내는 지표의 향상 정도는, 실제 측정되는 사용자의 생체 신호에 기반하여 결정될 수도 있다. 하나의 예에서, 서버 및/또는 사용자 장치는, 심박수(heart rate)에 기반하여 정신 건강 상태를 확인 할 수 있다. 예를 들어, 온도 및/또는 습도가 급격하게 증가하는 경우, 심장은 더 많은 혈액을 공급하여야 하 므로 심박수가 증가할 수는 있으나, 일반적으로 분당 5 내지 10회 이상 증가하지는 않을 수 있다. 예를 들어, 사용자가 휴식을 취하고 있거나, 또는 사용자가 서 있는 경우, 심박수는 유지될 수 있다. 예를 들어, 사용자가비만인 경우에는, 휴식을 취하더라도 심박수가 증가할 수도 있다. 예를 들어, 사용자가 스트레스를 받거나, 또 는 불안한 감정을 가지거나, 매우 행복하거나, 또는 매우 슬플 경우, 심박수가 증가할 수 있다. 예를 들어, 사 용자가 베타 차단제를 복용하는 경우에는 심박수가 감소할 수 있다. 예를 들어, 사용자가 갑상선 호르몬제를 복용하는 경우, 심박수가 증가할 수 있다. 상술한 바와 같이, 사용자의 감정에 따라서 심박수가 변경될 수 있 으며, 이에 따라 사용자의 감정이 양호한 것으로 판단되는 심박수의 최적 값 및/또는 최적 범위가 설정될 수 있 다. 예를 들어, 사용자 별로 기본적인 상태에서의 심박수가 상이할 수도 있으므로, 심박수의 최적 값 및/또는 최적 범위는 사용자 별로 설정될 수도 있다. 사용자 별 최적 값 및/또는 최적 범위 설정은, 예를 들어 사용자 개인에 해당하는 최적 값 및/또는 최적 범위의 설정 및/또는 사용자 정보(연령, 성별, 신체 조건 등 제한이 없 음)에 기반한 그룹 별 최적 값 및/또는 최적 범위의 설정을 포함할 수 있으며, 제한이 없다. 예를 들어, 하나 의 사용자에 대하여서도, 현재의 사용자의 상태(예를 들어, 휴식 상태, 서 있는 상태, 앉아 있는 상태, 과체중 상태 등, 제한이 없음) 별로 심박수가 상이할 수도 있으므로, 심박수의 최적 값 및/또는 최적 범위는 사용자의 상태 별로 설정될 수도 있다. 예를 들어, 하나의 사용자에 대하여서도, 현재의 주변 환경(예를 들어, 온도, 습 도 등, 제한이 없음) 별로 심박수가 상이할 수도 있으므로, 심박수의 최적 값 및/또는 최적 범위는 현재의 주변 환경 별로 설정될 수도 있다. 서버 및/또는 사용자 장치는, 제 1 사용자의 심박수가, 다양한 실시예 에 따른 심박수의 최적 값 및/또는 최적 범위와 연관된 조건을 만족하는지 여부에 기반하여, 제 1 사용자의 정 신 건강 상태를 확인할 수 있다. 다양한 설정 조건을 판정하기 위한 정보(예를 들어, 현재의 주변 환경(온도, 또는 습도 등)에 대한 정보)가, 사용자 장치로부터 서버로 제공될 수도 있음을 당업자는 이해할 것이다. 예를 들어, 제 1 사용자의 심박수가 최적 범위에 포함된 기간이 지정된 기간이 됨에 기반하여, 서버 는, 정신 건강 레벨의 증가 조건이 만족한 것으로 판단하여, 제 1 사용자의 정신 건강 레벨을 증가시킬 수도 있 다. 하나의 예에서, 서버 및/또는 사용자 장치는, HRV(heart rate variability)에 기반하여 정신 건강 상태를 확인할 수 있다. HRV는, 교감과 부교감 신경계의 영향을 받을 수 있다. 예를 들어, 사용자가 스트레스 를 받고 있는 상황에서(예: 급성 스트레스를 받는 상황일 수 있으나, 제한이 없음), HRV가 감소할 수 있다. 예 를 들어, 일반적인 상태에서 HRV가 상대적으로 높은 값을 유지하고 있으면, 교감 신경계 및 부교감 신경계가 균 형이 잘 형성된 상태임을 의미할 수 있다. 예를 들어, 일반적인 상태에서 HRV가 상대적으로 낮은 값을 유지하 고 있으면, 이는 사용자가 피곤하거나, 수분이 부족하거나, 스트레스를 받고 있거나, 몸 상태가 양호하지 못할 가능성이 있다. 예를 들어, 사용자가 운동(예를 들어, 런닝이지만, 제한이 없음)을 수행하는 동안에는, 사용자 의 하체가 상대적으로 많은 리소스를 소모하기 때문에, HRV가 상대적으로 낮은 값을 유지하는 것이 건강이 나쁜 상태를 의미하는 것은 아닐 수도 있다. 상술한 바와 같이, 사용자의 감정(예를 들어, 스트레스를 받는 상태)에 따라서 HRV가 변경될 수 있으며, 이에 따라 사용자의 감정이 양호한 것으로 판단되는 HRV의 최적 값 및/또는 최 적 범위가 설정될 수 있다. 예를 들어, 사용자 별로 기본적인 상태에서의 HRV가 상이할 수도 있으므로, HRV의 최적 값 및/또는 최적 범위는 사용자 별로 설정될 수도 있다. 사용자 별 최적 값 및/또는 최적 범위 설정은, 예를 들어 사용자 개인에 해당하는 최적 값 및/또는 최적 범위의 설정 및/또는 사용자 정보(연령, 성별, 신체 조건 등 제한이 없음)에 기반한 그룹 별 최적 값 및/또는 최적 범위의 설정을 포함할 수 있으며, 제한이 없다. 예를 들어, 하나의 사용자에 대하여서도, 현재의 사용자의 상태(예를 들어, 휴식 상태, 서 있는 상태, 앉아 있 는 상태, 과체중 상태, 운동 상태 등, 제한이 없음) 별로 HRV가 상이할 수도 있으므로, HRV의 최적 값 및/또는 최적 범위는 사용자의 상태 별로 설정될 수도 있다. 예를 들어, 하나의 사용자에 대하여서도, 현재의 주변 환 경(예를 들어, 온도, 습도 등, 제한이 없음) 별로 HRV가 상이할 수도 있으므로, HRV의 최적 값 및/또는 최적 범 위는 현재의 주변 환경 별로 설정될 수도 있다. 서버 및/또는 사용자 장치는, 제 1 사용자의 심박수 가, 다양한 실시예에 따른 HRV의 최적 값 및/또는 최적 범위와 연관된 조건을 만족하는지 여부에 기반하여, 제 1 사용자의 정신 건강 상태를 확인할 수 있다. 다양한 설정 조건을 판정하기 위한 정보(예를 들어, 현재의 주 변 환경(온도, 또는 습도 등)에 대한 정보)가, 사용자 장치로부터 서버로 제공될 수도 있음을 당업자 는 이해할 것이다. 예를 들어, 제 1 사용자의 HRV가 최적 범위에 포함된 기간이 지정된 기간이 됨에 기반하여, 서버는, 정신 건강 레벨의 증가 조건이 만족한 것으로 판단하여, 제 1 사용자의 정신 건강 레벨을 증가시 킬 수도 있다. 한편, 상술한 HRV뿐만 아니라, LF/HF의 비율등도 상술한 파라미터들(예: 심박수 및/또는 HRV)과 같이 이용될 수도 있음을 당업자는 이해할 것이다. 예를 들어, 사용자가 스트레스를 받는 동안에는, LF/HF의 비율이 증가할 수 있다. 예를 들어, 공황 장애 환자들이 정상인에 비하여 상대적으로 HF 파워가 낮으며, LF 파 워가 높음이 확인된 바 있다. 예를 들어, 불안 척도가 높은 사람들이 LF/HF 비율이 상대적으로 높을 수도 있다. 한편, 상술한 HRV뿐만 아니라, 호흡 속도(respiratory rate)의 비율등도 상술한 파라미터들과 같이 이용 될 수도 있음을 당업자는 이해할 것이다. 예를 들어, 호흡 속도의 증가 및/또는 한숨 횟수의 증가는 스트레스와연관이 있을 수 있다. 예를 들어, 건강한 경우에는, 들숨이 상대적으로 짧아지고, 날숨이 상대적으로 길어질 수 있다. 예를 들어, 평온한 상태에서의 심혈관 시스템 내의 공명 주파수는 0.1 Hz(예를 들어, 분당 6회의 호 흡속도)일 수 있다. 일 실실시예에서, 서버 및/또는 사용자 장치는, 제 1 사용자의 뇌파에 기반하여, 사용자의 정신 건강 상태를 확인할 수도 있다. 예를 들어, 제 1 사용자는, 뇌파를 측정하기 위한 외부 센서 장치를 착용할 수 있다. 외부 센서 장치는, 예를 들어, 비침습적인 센싱 수단인 전극을 포함할 수 있으나, 이는 예시적인 것으로 침습적인 센싱 수단을 포함할 수도 있음을 당업자는 이해할 것이다. 서버 및/또는 사용자 장치 는, 센싱 수단에 기반하여 확인된 제 1 사용자의 뇌파에 기반하여 사용자의 정신 건강 상태를 확인할 수 있다. 예를 들어, 서버 및/또는 사용자 장치는, EEG 신호에 기반하여 뇌파를 확인할 수 있으나, 뇌 파를 확인하기 위한 신호에는 제한이 없음을 당업자는 이해할 것이다. 한편, 사용자의 상태를 확인하기 위한 센싱 정보에는 제한이 없다. 상술한 바와 같이, 서버 및/또는 사용자 장치는, 사용자의 심박수, HRV, HF/LF 비율, 호흡 속도, 및/ 또는 뇌파 등의 다양한 사용자 생체 신호에 기반하여, 사용자 정신 건강 상태를 확인할 수 있으며, 사용자 생체 신호의 종류에 제한이 없음을 당업자는 이해할 것이다. 도 7b는 일 실시예에 따른 건강 상태 지표를 나타내기 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 일 실시예에 따라서, 서버는, 701 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 703 동 작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 하나의 완료를 확인할 수 있다. 서버는, 705 동작에서, 완료가 확인된 액티비티의 타입을 확인할 수 있다. 일 실시예에 따라서, 완료가 확인된 액티비티 타입이 인 어플리케이션 액티비티인 경우, 서버는, 707 동작에서, 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치(예를 들어, 사용자 장치)로 제공할 수 있다. 서 버는, 709 동작에서, 제 1 사용자에 대응하여 보상 세트를 반영할 수 있다. 서버는, 721 동작에서, 획득되는 생체 신호에 기반하여 제 1 사용자 건강 상태를 나타내는 지표를 제공할 수 있다. 예를 들어, 서버 는, 사용자 장치에 포함된 센서 및/또는 근거리 통신에 기반하여 연결된 외부 센서 장치에 의하여 센싱된 적어도 하나의 생체 신호를 획득할 수 있다. 서버는, 생체 신호의 분석 결과에 기반하여 제 1 사용자 건강 상태를 나타내는 지표를 제공할 수 있다. 도 7b의 실시예에서는, 서버는, 인 어플리케 이션 액티비티의 완료 여부는 사용자에 대응하는 보상을 결정하기 위하여 이용할 수 있으며, 사용자의 정신 건 강 상태를 나타내는 지표는 인 어플리케이션 액티비티의 완료 여부로부터 독립적으로 관리할 수도 있다. 아웃 도어 액티비티에 대하여서도, 서버는, 완료가 확인된 액티비티 타입이 아웃도어 액티비티인 경우, 서버 는, 713 동작에서, 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치(예를 들어, 사용자 장치 )로 제공할 수 있다. 서버는, 715 동작에서, 제 1 사용자에 대응하여 보상 세트를 반영할 수 있다. 이 경우에도, 서버는, 아웃도어 액티비티의 완료 여부는 사용자에 대응하는 보상을 결정하기 위하여 이용 할 수 있으며, 사용자의 정신 건강 상태를 나타내는 지표는 아웃도어 액티비티의 완료 여부로부터 독립적으로 관리할 수도 있다. 도 8a는 일 실시예에 따른 건강 상태를 모니터링 하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한 다. 일 실시예에 따라서, 서버는, 801 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 803 동 작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 하나의 선택 및/또는 수행을 확인할 수 있다. 서버는, 805 동작에서, 제 1 사용자 장치(예를 들어, 사용자 장치)로부터 생체 신호의 센싱 데이터를 획득할 수 있다. 한편, 805 동작에서의 생체 신호 센싱 데이터의 획득 시점은, 도 8a에서는 액티비티 수행의 확인 이후와 같이 도시되어 있지만, 이는 하나의 예시일뿐이며, 생체 신호 센싱 데이 터의 획득 시점(또는, 사용자 장치로부터의 생체 신호 센싱 데이터의 서버로의 제공 시점일 수도 있 음)에는 제한이 없음을 당업자는 이해할 것이다. 예를 들어, 생체 신호 센싱 데이터는, 사용자 장치에 의 하여 주기적, 및/또는 이벤트 검출에 기반하여 수행될 수 있으며, 수행 결과 획득된 생체 신호 센싱 데이터가 서버로 송신될 수 있거나, 및/또는 액티비티의 선택, 및/또는 수행 완료에 기반하여 획득 및/또는 송신될 수도 있다. 예를 들어, 사용자 장치는, 포함하고 있는 센서 및/또는 근거리 통신으로 연결된 외부 센서 장치로부터, 사용자의 생체 신호의 센싱 데이터를 획득할 수 있다. 사용자 장치는, 사용자의 생체 신호의 센싱 데이터를, 통신 인터페이스를 통하여 서버로 송신할 수 있다.일 실시예에 따라서, 서버는, 807 동작에서, 액티비티의 선택 및/또는 수행과, 및/또는 생체 신호 센싱 데 이터에 기반하여, 사용자의 정신 건강 상태를 확인할 수 있다. 하나의 예에서, 서버는, 액티비티의 선택 및/또는 수행만에 기반하여 사용자의 정신 건강 상태를 확인할 수 있다. 하나의 예에서, 서버는, 사용자 의 생체 신호만에 기반하여 사용자의 정신 건강 상태를 확인할 수 있다. 하나의 예에서, 서버는, 액티비 티의 선택 및/또는 수행과, 사용자의 생체 신호 양자에 기반하여 사용자의 정신 건강 상태를 확인할 수 있다. 하나의 예에서, 정신 건강 상태가 레벨의 형식으로 표현되는 경우, 서버는, 액티비티의 선택 및/또는 수행 과, 및/또는 생체 신호 센싱 데이터에 기반하여, 사용자 정신 건강의 레벨의 증가, 감소, 또는 유지 여부를 결 정할 수 있다. 예를 들어, 액티비티의 선택 및/또는 수행과, 및/또는 생체 신호 센싱 데이터가, 레벨 증가 조 건을 만족시키는 경우에는, 서버는, 사용자의 정신 건강 레벨을 한 단계 증가시킬 수 있다. 예를 들어, 액티비티의 선택 및/또는 수행과, 및/또는 생체 신호 센싱 데이터가, 레벨 감소 조건을 만족시키는 경우에는, 서버는, 사용자의 정신 건강 레벨을 한 단계 감소시킬 수 있다. 예를 들어, 액티비티의 선택 및/또는 수 행과, 및/또는 생체 신호 센싱 데이터가, 레벨의 증가 조건 및 레벨의 감소 조건 양자를 모두 만족시키지 않는 경우, 서버는, 사용자의 정신 건강 레벨을 유지할 수 있다. 만약, 정신 건강 상태가 레벨의 형식이 아닌 점수의 형식으로 표현되는 경우에는, 서버는, 사용자의 정신 건강 레벨을 나타내는 점수를 확인할 수 있다. 상술한 바와 같이, 정신 건강 레벨은, 누적 기반으로 결정되거나, 또는 즉각적으로 결정될 수도 있으며, 결정 방식에 제한이 없음을 당업자는 이해할 것이다. 일 실시예에 따라서, 서버는, 809 동작에서, 정신 건강 상태를 제 1 사용자의 계정과 연관하여 저장하고, 정신 건강 상태를 사용자 장치로 제공할 수 있다. 이에 따라, 사용자 장치는, 서버로부터 수신 된 정보에 기반하여, 현재 제 1 사용자의 정신 건강 레벨을 표현(예를 들어, 표시)할 수 있다. 한편, 정신 건 강 상태가 사용자 장치로 제공되는 것은 단순히 예시적인 것으로, 서버는, 정신 건강 상태를 포함하 는 가상 공간을 표현하기 위한 데이터를 사용자 장치로 제공할 수도 있음을 당업자는 이해할 것이다. 이 경우, 사용자 장치는, 수신된 데이터에 기반하여 가상 공간을 표현할 수도 있으며, 표현된 가상 공간 내에 정신 건강 상태가 포함될 수 있다. 도 8b는 일 실시예에 따른 건강 상태를 모니터링 하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한 다. 일 실시예에 따라서, 서버는, 881 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 883 동 작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 하나의 선택 및/또는 수행을 확인할 수 있다. 서버는, 885 동작에서, 제 1 사용자 장치(예를 들어, 사용자 장치)로부터 생체 신호의 센싱 데이터를 획득할 수 있다. 예를 들어, 사용자 장치는, 포함하고 있는 센서 및/또 는 근거리 통신으로 연결된 외부 센서 장치로부터, 사용자의 생체 신호의 센싱 데이터를 획득할 수 있다. 사용자 장치는, 사용자의 생체 신호의 센싱 데이터를, 통신 인터페이스를 통하여 서버로 송신할 수 있다. 일 실시예에 따라서, 서버는, 887 동작에서, 액티비티의 선택 및/또는 수행과, 및/또는 생체 신호 센싱 데 이터에 기반하여, 사용자의 정신 건강 상태를 확인할 수 있다. 889 동작에서, 서버는, 건강 상태가 지정 된 조건을 만족하는지 여부를 확인할 수 있다. 하나의 예에서, 서버는, 지정된 타임 윈도우 동안의 정신 건강 레벨이 증가되었는지 여부를, 건강 상태가 지정된 조건을 만족하는지 여부로서 확인할 수 있다. 예를 들 어, 일주일 동안 정신 건강 레벨이 증가하지 않은 경우, 서버는 건강 상태가 지정된 조건을 만족하는지 못 한 것으로 확인할 수도 있다. 건강 상태가 지정된 조건을 만족하는지 못한 것으로 확인됨에 기반하여(889-아니 오), 서버는, 891 동작에서, 추가 액티비티의 수행을 추천하기 위한 데이터를 사용자 장치로 제공할 수 있다. 추가 액티비티는, 예를 들어 지정된 조건의 만족을 위하여 선택될 수도 있다. 예를 들어, 레벨의 증 가를 위하여, 아웃도어 액티비티의 추가 수행이 요구되는 경우에는, 서버는, 아웃도어 액티비티의 수행을 추천하기 위한 데이터를, 추가 액티비티의 수행을 추천하기 위한 데이터로서, 사용자 장치로 제공할 수 있 다. 도 9a는 일 실시예에 따른 액티비티 번들을 제공하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한 다. 도 9a의 실시예는, 도 9b를 참조하여 설명하도록 한다. 도 9b는 일 실시예에 따른 액티비티의 번들을 설 명하기 위한 도면이다. 일 실시예에 따라서, 서버는, 901 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 903 동 작에서, 제 1 사용자와 연관된 적어도 하나의 정보를 확인할 수 있다. 서버는, 905 동작에서, 제 1 사용자와 연관된 적어도 하나의 정보에 기반하여 제 1 액티비티 번들을 추천하기 위한 데이터를 사용자 장치에 제공할 수 있다. 사용자 장치는, 서버로부터 수신되는 데이터에 기반하여, 제 1 액티비티 번들을 추 천하기 위한 UI를 제공할 수 있다. 만약, UI를 통하여 제 1 액티비티 번들을 선택하는 사용자 입력이 확인되면, 사용자 장치는, 제 1 액티비티 번들의 선택을 나타내는 정보를 서버로 송신할 수 있다. 서버는, 제 1 액티비티 번들의 선택을 나타내는 정보를 수신할 수 있으며, 이에 기반하여 제 1 액티비티 번들에 포함된 적어도 하나의 액티비티를 수행(예를 들어, 서버 측에서의 액티비티 수행을 위한 동작을 수 행, 및/또는 사용자 장치로의 액티비티 수행을 알림(또는, 요청))할 수 있다. 예를 들어, 서버는, 제 1 사용자와 연관된 적어도 하나의 정보로서, 사용자의 정신 건강 상태를 확인할 수 있다. 예를 들어, 서버는, 사용자의 정신 건강 상태가 제 1 상태임에 기반하여, 제 1 번들을 추천할 수 있다. 예를 들어, 서버는, 사용자의 정신 건강 상태가 제 1 상태와는 상이한 제 2 상태임에 기반하여, 제 2 번들을 추천할 수 있다. 예를 들어, 제 1 번들의 원소는, 제 2 번들의 원소와 적어도 일부 상이할 수 있다. 예를 들어, 제 1 번들의 원소 및 제 2 번들의 원소가 동일하다 하더라도, 번들 내의 원소 순서가 상이할 수도 있다. 예를 들어, 도 9b에는, 액티비티의 제 1 번들이, 제 1 인 어플리케이션 액티비티/제 2 인 어플리케이션 액티비티/제 1 아웃도어 액티비티로 구성될 수 있다. 액티비티의 제 2 번들이, 제 3 인 어플리케이션 액티비티, 제 2 인 어플리케이션 액티비티, 및 제 2 아웃도어 액티비티로 구성될 수 있다. 액티비티의 번들의 구성은, 룰에 기반하여 결정될 수도 있으나, 또는 사용자의 정신 건강 상태를 입력받아 적어도 하나의 액티비티 (또는, 액티비티 번들)를 출력하는 인공지능 모델에 기반하여 결정될 수도 있다. 룰 기반 및/또는 인공지능 기 반으로 결정을 수행하는 것은 본 실시예뿐만 아니라, 본 개시의 다른 실시예에도 적용될 수 있음을 당업자는 이 해할 것이다. 상술한 바에 따라서, 사용자의 정신 건강 상태가 상이한 경우, 상이한 액티비티의 번들이 제공될 수도 있다. 예를 들어, 사용자의 정신 건강 상태의 레벨이 낮은 경우에는, 레벨의 증가를 위한 번들이 결정될 수 있다. 예를 들어, 사용자의 정신 건강 상태가 “우울함”으로 확인되는 경우(또는, 우울한 감정이 상대적으 로 높은 경우)에는, 우울한 감정의 해소에 최적화된 번들이 추천될 수도 있다. 한편, 액티비티의 번들을 구성 하는 원소의 개수는 복수 개일 수 있으나, 구현에 따라 1개일 수도 있음을 당업자는 이해할 것이다. 예를 들어, 서버는, 제 1 사용자와 연관된 적어도 하나의 정보로서, 사용자의 액티비티 수행 이력을 확인 할 수 있다. 예를 들어, 서버는, 사용자가 특정 액티비티의 수행 횟수가 상대적으로 다수인 경우에, 해당 액티비티를 추천 번들 내에 포함시킬 수 있다. 예를 들어, 서버는, 사용자가 상대적으로 다수 수행하였던 특정 액티비티와 유사한 액티비티를 추천 번들에 포함시킬 수도 있다. 예를 들어, 서버는, 사용자가 상대 적으로 다수 수행하였던 특정 액티비티를 추천 번들로부터 제외시킬 수도 있다. 예를 들어, 서버는, 제 1 사용자와 연관된 적어도 하나의 정보로서, 사용자의 번들 수행 이력을 확인할 수 있다. 예를 들어, 서버는, 후보 번들을 생성할 수 있으며, 후보 번들들 중 적어도 하나를 선택할 수 있는 UI를 표현하기 위한 데이터를 사용자 장치로 제공할 수 있다. 사용자 장치는, 수신한 데이터를 이용 하여, 후보 번들들 중 적어도 하나를 선택할 수 있는 UI를 표현할 수 있다. UI를 통하여 적어도 하나의 번들이 선택 및/또는 수행되면, 사용자 장치는, 이를 서버로 보고할 수 있다. 서버는 번들에 대한 선 택 및/또는 수행의 이력에 기반하여, 번들들에 대한 사용자 선호를 확인 및/또는 관리할 수도 있다. 서버(10 1)는, 추후 번들들에 대한 사용자 선호에 기반하여, 추천 번들을 선택할 수도 있다. 사용자가 특정 액티비티의 수행 횟수가 상대적으로 다수인 경우에, 해당 액티비티를 추천 번들 내에 포함시킬 수 있다. 예를 들어, 서버는, 사용자가 상대적으로 다수 수행하였던 특정 액티비티와 유사한 액티비티를 추천 번들에 포함시킬 수도 있다. 예를 들어, 서버는, 사용자가 상대적으로 다수 수행하였던 특정 액티비 티를 추천 번들로부터 제외시킬 수도 있다. 예를 들어, 서버는, 제 1 사용자와 연관된 적어도 하나의 정보로서, 사용자의 데일리 패턴을 확인할 수 있 다. 예를 들어, 서버는, 사용자의 데일리 패턴에 대응되도록 번들을 구성할 수도 있다. 예를 들어, 제 1 사용자와 관련하여, 평일 오전 9시부터 10시까지 걷는 패턴이 확인되는 경우, 서버는, 오전 9시부터 10시 사이에는, “걸음”이 요구되는 액티비티(예를 들어, 아웃도어 액티비티일 수 있지만 제한이 없다)를 번들 내에 포함시킬 수 있다. 예를 들어, 서버는, 제 1 사용자와 연관된 적어도 하나의 정보로서, 사용자의 성향(또는 성격)을 확인할 수 있다. 예를 들어, 서버는, 사용자의 성향(또는 성격)에 대한 정보를 분석 및/또는 관리하거나, 또는 다른 시스템(예를 들어, 소셜 네트워크 시스템)으로부터 수신하여 저장 및/또는 관리할 수 있으며, 제한이 없다. 예를 들어, 서버는, 서버 내에 (또는, 서버에서 접근 가능한 외부의 저장소에) 미리 저장된 사용자의 성향(또는 성격)을 확인할 수 있다. 예를 들어, 서버는, 사용자의 성향(또는 성격)을 확인 하기 위한 적어도 하나의 동작을 수행함으로써, 사용자의 성향(또는 성격)을 확인할 수 있다. 예를 들어, 사용 자의 성향(또는 성격)은, 해당 사용자에 대한 설문 조사의 응답 결과에 기반하여 확인될 수 있다. 예를 들어, 사용자의 성향(또는 성격)은, 사용자에 대응하는 소셜 네트워크 내에서 정의되는 관계 정보(예를 들어, 친구 수, following 수, follower 수 등이지만 제한이 없다)에 기반하여 확인될 수 있다. 예를 들어, 사용자의 성향 (또는 성격)은, 사용자에 대응하는 소셜 네트워크 내에서 정의되는 활동 정보(예를 들어, 사진 업로드 횟수, 쓰 레드 생성 횟수, 댓글 생성 횟수, 타인 계정의 페이지 접속 횟수 등이지만 제한이 없음)에 기반하여 확인될 수 있다. 한편, 상술한 사용자의 성향(또는 성격)의 확인 방식에는 제한이 없음을 당업자는 이해할 것이다. 사용 자의 성향(또는 성격)은, 예를 들어 Big 5 성격 유형 중 어느 하나로 결정될 수 있으나, 성향(또는 성격)을 나 타내기 위한 형식에는 제한이 없다. 서버는, 제 1 사용자의 성향(또는 성격)에 기반하여 번들 내 액티비 티를 구성할 수 있다. 예를 들어, “approach for tailoring persuasive mental health applications(Felwah Alqahtani, Sandra Meier & Rita Orji)” 및/또는 “and Persuasive Technology: An Exploratory Study on Health-Promoting Mobile Applications(Sajanee Halko & Julie A. Kientz)”에서는, Big 5 성격 유형에 따라 health-promoting apps에서 더 효과가 있는 persuasive technologies가 다름이 확인되었다. 이에 따라, 사용 자 성향에 따라 번들 내에 포함되는 액티비티 및/또는 그 배열 순서가 결정될 수도 있다. 예를 들어, 제 1 성 향은 경쟁 기반의 액티비티에 의하여 상대적으로 많이 동기를 얻을 수 있으며, 제 2 성향은 경쟁 기반에 따른 액티비티에 의하여 상대적으로 적게 동기를 얻을 수도 있다. 서버는, 사용자의 성향이 제 1 성향으로 확 인되는 경우에, 경쟁 기반의 액티비티를 제 1 사용자를 위한 번들에 포함시킬 수 있다. 서버는, 사용자의 성향이 제 2 성향으로 확인되는 경우에, 경쟁 기반의 액티비티를 제 1 사용자를 위한 번들로부터 배제하고, 실 질적으로 동일한(또는, 유사한) 효과를 가지는 다른 액티비티를 번들에 포함시킬 수 있다. 일 실시예에 따라서, 서버는, 사용자의 성향(또는 성격) 및 액티비티 사이의 연관 정보를 미리 저장할 수 있으며, 저장된 연관 정보에 기반하여 제 1 사용자의 성향(또는 성격)에 대응하는 액티비티를 번들 내에 포함시 킬 수 있다. 한편, 사용자의 성향에는, 사용자의 생활 습관의 성향, 및/또는 사용자의 운동 성향이 포함될 수 도 있으며, 그 종류에 제한이 없다. 도 10a는 일 실시예에 따른 가중치를 반영하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 10a의 실시예는 도 10b를 참조하여 설명하도록 한다. 도 10b는 일 실시예에 따른 가중치에 기반한 보상 설정 방식을 설명하기 위한 도면을 도시한다. 일 실시예에 따라서, 서버는, 1001 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 1003 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 하나의 선택 및/또는 수행을 확인할 수 있다. 서버는, 1005 동작에서, 보상에 대하여 적용할 가중치를 확인할 수 있다. 예를 들어, 보상에 대하여 적용할 가중치가 제 1 가중치로 확인되는 경우, 서버는, 1007 동작에서, 제 1 가중치 에 기반하여 확인되는 제 1 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치로 제공할 수 있다. 서버는, 1009 동작에서, 제 1 사용자에 대응하여 제 1 보상 세트를 제공할 수 있다. 한편, 보상에 대하여 적용할 가중치가 제 2 가중치로 확인되는 경우, 서버는, 1011 동작에서, 제 2 가중치에 기반하여 확인되는 제 2 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치로 제공할 수 있다. 서버는, 1013 동 작에서, 제 1 사용자에 대응하여 제 2 보상 세트를 제공할 수 있다. 예를 들어, 도 10b를 참조하면, 제 1 인 어플리케이션 액티비티에 대한 기본 보상 세트는 1개의 하트 및 100개의 코인일 수 있으며, 제 1 아웃도어 액티 비티에 대한 기본 보상 세트는 2개의 하트 및 200개의 코인일 수 있다. 서버는, 기본 보상 세트에 가중치 (r)을 곱하여 보상 세트를 확인할 수 있다. 예를 들어, 가중치가 적용된 제 1 인 어플리케이션 액티비티에 대 한 보상 세트는 1*r개의 하트 및 100*r개의 코인일 수 있으며, 가중치가 적용된 제 1 아웃도어 액티비티에 대한 보상 세트는 2*r개의 하트 및 200*r개의 코인일 수 있다. 예를 들어, 서버는, 해당 액티비티의 수행 이력에 기반하여 가중치를 확인할 수 있다. 예를 들어, 액티비 티가 처음 수행되는 경우에는, 상대적으로 높은 가중치가 부여될 수 있다. 예를 들어, 액티비티가 마지막으로 수행된 시점 및 현재 수행 시점 사이의 차이가 상대적으로 클 경우에는, 상대적으로 높은 가중치가 부여될 수 있다. 상술한 가중치 부여에 따라, 예를 들어 다양한 액티비티의 수행이 유도될 수 있으나, 이는 단순히 예시 적인 것이다. 예를 들어, 서버는, 정신 건강 상태의 향상에 좋은 액티비티를 습관화하기 위하여, 특정 액 티비티에 대하여서는 기존 반복 횟수에 기반하여 가중치를 증가시킬 수도 있다. 만약, 인 어플리케이션 액티비 티 중 “일기 쓰기”는 습관화가 요구되는 액티비티일 수 있다. 이 경우, 서버는, “일기 쓰기”의 액티 비티 수행이 daily 반복됨에 기반하여, 상대적으로 높은 가중치를 부여할 수 있다. 예를 들어, “일기 쓰기”가 하루 수행된 경우에는 r=1, 이틀 연속 수행된 경우에는 r=2, 사흘 연속 수행된 경우에는 r=3과 같이, 서버 는, 기존 수행 이력에 기반하여 가중치를 설정할 수 있다. 서버는, 상술한 액티비티의 습관화를 위 하여, 습관화 레벨을 정의할 수도 있다. 예를 들어, 특정 액티비티의 반복 횟수(또는, 수행 횟수)에 기반하여, 특정 사용자의 특정 액티비티에 대한 습관화 레벨을 설정할 수 있다. 예를 들어, 상대적으로 높은 습관화 레벨 에 대하여, 상대적으로 높은 가중치가 부여될 수도 있다. 습관화 레벨은, 예를 들어 숫자와 같이 표현될 수도 있으며, 이를 표현하기 위한 오브젝트(예를 들어, 뱃지 형태)가 가상 공간 내에서 표현될 수도 있다. 한편, 일시적인(또는, 일정 기간 동안) 수행은 정신 건강 상태 향상에 도움을 주지만, 습관화가 되면 정신 건강 상태를 오히려 악화시키는 액티비티가 존재할 수도 있다. 예를 들어, 다른 사용자와 함께 수행하는 게임은, 소 셜 인터랙션의 측면에서 일시적인(또는, 일정 기간 동안)의 수행은, 정신 건강 상태 향상에 도움을 줄 수 있다. 하지만, 게임이 습관화가 되면, 오히려 정신 건강 상태를 악화시킬 가능성이 있다. 이에 따라, 서버는, 특정 액티비티에 대하여서는 습관화를 방지하도록 하는 가중치를 부여할 수도 있다. 예를 들어, 서버는, 특정 액티비티에 대하여 임계 반복 횟수까지는(또는, 임계 수행 기간 이전까지는), 일반적인 가중치를 부여할 수 있다. 하지만, 임계 반복 횟수를 초과하면(또는, 임계 수행 기간을 초과하면), 서버는 해당 액티비티 에 대하여 가중치를 부여하지 않거나, 또는 음수의 가중치를 부여할 수도 있다. 한편, 액티비티의 수행 이력에 기반한 가중치의 부여 방식에는 제한이 없다. 예를 들어, 서버는, 사용자의 정신 건강 상태에 기반하여 가중치를 확인할 수 있다. 예를 들어, 서버 는, 사용자의 정신 건강 상태가 상대적으로 높은 경우(예를 들어, 사용자가 높은 정신 건강 레벨을 가지는 경우), 특정 액티비티 수행에 대하여 상대적으로 높은 가중치를 적용할 수 있다. 예를 들어, 서버는, 사 용자의 정신 건강 상태가 양호함을 유지하는 기간에 기반하여, 가중치를 설정할 수도 있다. 사용자의 정신 건 강 상태가 양호함이 유지되는 기간이 상대적으로 길수록, 서버는 상대적으로 높은 가중치를 적용할 수도 있다. 예를 들어, 서버는, 사용자의 성향(또는, 성격)에 따라서 가중치를 확인할 수도 있다. 예를 들어, 서버 는, 서버 내에 (또는, 서버에서 접근 가능한 외부의 저장소에) 미리 저장된 사용자의 성향을 확 인할 수 있다. 예를 들어, 서버는, 사용자의 성향을 확인하기 위한 적어도 하나의 동작을 수행함으로써, 사용자의 성향을 확인할 수 있다. 예를 들어, 사용자의 성향은, 해당 사용자에 대한 설문 조사의 응답 결과에 기반하여 확인될 수 있다. 예를 들어, 사용자의 성향은, 사용자에 대응하는 소셜 네트워크 내에서 정의되는 관 계 정보(예를 들어, 친구 수, following 수, follower 수 등이지만 제한이 없다)에 기반하여 확인될 수 있다. 예를 들어, 사용자의 성향은, 사용자에 대응하는 소셜 네트워크 내에서 정의되는 활동 정보(예를 들어, 사진 업 로드 횟수, 쓰레드 생성 횟수, 댓글 생성 횟수, 타인 계정의 페이지 접속 횟수 등이지만 제한이 없음)에 기반하 여 확인될 수 있다. 한편, 상술한 사용자의 성향의 확인 방식에는 제한이 없음을 당업자는 이해할 것이다. 사 용자의 성향은, 예를 들어 Big 5 성격 유형 중 어느 하나로 결정될 수 있으나, 성향을 나타내기 위한 형식에는 제한이 없다. 예를 들어, 동일한 종류의 가중치라 하더라도, 사용자의 성향에 따라서 동기부여 정도가 상이할 수도 있다. 상술한 바와 같이, 재화의 종류별로 가상 공간 내에서(또는, 실 생활에서)의 용도가 상이할 수 있 다. 서버는, 사용자의 성향 및 재화의 종류 사이의 상관 관계에 대한 정보에 기반하여, 사용자의 성향에 기반한 재화의 종류 별 가중치를 결정할 수도 있다. 예를 들어, 서버는, 액티비티의 종류에 따라서 가중치를 확인할 수도 있다. 예를 들어, 서버는, 모 든 액티비티에 대한 기본 보상 세트를 동일하게 설정하고, 액티비티 별로 가중치를 상이하게 설정할 수도 있다. 예를 들어, 서버는, 인 어플리케이션 액티비티에 대한 가중치 및 아웃도어 액티비티에 대한 가중치를 상이 하게 설정할 수 있다. 예를 들어, 서버는, 제 1 인 어플리케이션 액티비티에 대한 가중치를, 제 2 인 어 플리케이션 액티비티에 대한 가중치와 상이하게 설정할 수도 있다. 예를 들어, 서버는, 제 1 아웃도어 액 티비티에 대한 가중치를, 제 2 아웃도어 액티비티에 대한 가중치와 상이하게 설정할 수도 있다. 또는, 사용자 의 성향에 따라 동기화(motivated) 효과가 상대적으로 큰 액티비티가 상이할 수 있다. 예를 들어, 제 1 성향은 경쟁 기반의 액티비티에 의하여 상대적으로 많이 동기를 얻을 수 있으며, 제 2 성향은 경쟁 기반에 따른 액티비 티에 의하여 상대적으로 적게 동기를 얻을 수도 있다. 서버는, 사용자의 성향이 제 1 성향으로 확인되는 경우에 경쟁 기반 액티비티에 대하여 상대적으로 높은 가중치를 부여하고, 사용자의 성향이 제 2 성향으로 확인 되는 경우에 경쟁 기반 액티비티에 대하여 상대적으로 낮은 가중치를 부여함으로써, 사용자의 정신 건강 어플리 케이션의 지속적인 이용을 유도할 수 있다. 또는, 서버는, 사용자의 성향이 제 1 성향으로 확인되는 경우 에 경쟁 기반 액티비티에 대하여 상대적으로 낮은 가중치를 부여하고, 사용자의 성향이 제 2 성향으로 확인되는 경우에 경쟁 기반 액티비티에 대하여 상대적으로 높은 가중치를 부여함으로써, 사용자로 하여금 비선호하는 액티비티를 수행하게끔 유도할 수도 있다. 한편, 도 10b의 실시예에서, 가중치(r)는, 기본 보상 세트에 대한 곱셈 연산에 기반하여 적용되는 것과 같이 설 명되었지만, 이는 예시적인 것으로, 가중치(r)는 기본 보상 세트에 덧셈 연산에 기반하여 적용될 수도 있으며, 그 적용 방식에는 제한이 없음을 당업자는 이해할 것이다. 한편, 도시되지는 않았지만, 특정 사용자가 특정 액티비티를 최초 수행한 경우(또는, 기설정된 시간이 경과한 이후에 수행한 경우), 추가적인 가중치를 적용한 보상이 제공될 수도 있다. 한편, 도시되지는 않았지만, 지정 된 시간 단위로(예를 들어, 매일), 액티비티를 연속하여 수행되는 경우에, 추가적인 가중치를 적용한 보상이 제 공될 수도 있다. 한편, 도시되지는 않았지만, 특정 액티비티에 대한 수행 습관이 형성되는 것으로 판단되는 경 우, 추가적인 가중치를 적용한 보상이 제공될 수도 있다. 수행 습관이 형성되는 것을 판정하기 위한 조건은, 예를 들어 지정된 기간 내에 지정된 횟수 이상의 액티비티 수행 및/또는 지정된 기간 동안의 지정된 횟수 이상 의 액티비티 연속 수행을 포함할 수 있으나, 그 종류에 제한이 없다. 도시되지는 않았지만, 특정 사용자에 대 하여 습관화 레벨이 부여되어 관리될 수도 있다. 습관화 정도에 따라, 습관화 레벨이 사용자에게 부여될 수도 있으며, 가중치는 습관화 레벨에 기반하여 적용될 수도 있다. 예를 들어, 상대적으로 높은 습관화 레벨에 대하 여 상대적으로 높은 보상이 부여될 수도 있다. 습관화 레벨에 기반하여, 재화에 대하여 별도로 추가적인 아이 템(예를 들어, 뱃지)가 사용자에게 부여될 수도 있다. 뱃지는 사용자에게 제공된 이후 소유가 유지될 수 있으 나, 활성화 여부는 지정된 기간이 경과될 때에 갱신될 수도 있다. 습관화 레벨의 예시는 하기와 같을 수 있다. * 습관화 Level Lv.1: 습관화 기준을 1주일 지속 Lv.2: 습관화 기준을 2주일 연속으로 지속 Lv.3: 습관화 기준을 4주일 연속으로 지속 예를 들어, A의 액티비티에 대하여, 1주일 지속, 2주 휴식, 2주일 지속된 경우에는, 하기와 같은 습관화 레벨 및 뱃지의 활성화 여부가 결정될 수도 있다. 1주차: Lv.1 BADGE 2주차: Lv.1 BADGE는 효력 유지 3주차: Lv.1 BADGE는 있으나 효력 x 4주차: Lv.1 BADGE 효력 부활 5주차: Lv.1 BADGE & Lv.2 BADGE 한편, 도시되지는 않았지만, 정신 건강의 지표가 양호한 상태로 유지되면, 상대적으로 높은 가중치가 적용된 보 상 및/또는 추가 아이템(예를 들어, 뱃지)이 제공될 수도 있다. 구현에 따라, 습관화 레벨의 뱃지 및 정신 건 강의 지표에 기반한 뱃지는 상이한 형태 및/또는 속성을 가질수도 있으나 제한은 없다. 한편, 도시되지는 않았지만, 습관화 레벨, 정신 건강의 지표, 및/또는 적어도 하나의 종류의 뱃지 각각의 개수 에 기반하여, 정신 건강 클래스가 결정될 수도 있다. 아울러, 정신 건강 클래스에 기반하여 결정된 가중치에 기반한 보상이 제공될 수도 있다. 클래스는, 예를 들어 “SS/S/A/B/C”로 표현되거나, “”로 표현될 수도 있 으나, 그 표현 방식에는 제한이 없다. 클래스는, 예를 들어 지정된 기간이 경과된 이후에 갱신될 수도 있으며, 클래스의 변경 이력은 저장될 수도 있다. [표 4]는 일실시예에 따른 클래스 별 뱃지의 개수, 가중치 및 추가 혜택의 예시이다. 표 4"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 7, "content": "도 11은 일 실시예에 따른 액티비티의 제한 조건을 고려한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한 다. 일 실시예에 따라서, 서버는, 1101 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 1103 동작에서, 제 1 사용자에 대응하는 가상 공간에서 선택 가능한 적어도 하나의 액티비티 중 하나의 선택 및/또는 수행을 확인할 수 있다. 서버는, 1105 동작에서, 해당 액티비티와 관련되어 반복 수행에 대한 제한 조건 이 존재하는지 여부를 확인할 수 있다. 여기에서, 반복 수행에 대한 조건이 존재하는지 여부를 확인하는 것은, 해당 액티비티에 대한 가중치(또는, 가중치가 반영된 보상 세트)를 확인하는 것일 수도 있다. 만약, 반복 수행에 대한 제한 조건이 존재하지 않으면, 서버는, 1107 동작에서, 수행 이력에 따른 가중 치에 기반하여 제 1 보상 세트를 확인하고, 확인된 제 1 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용 자 장치(예: 사용자 장치)로 제공할 수 있다. 서버는, 1109 동작에서, 제 1 사용자에 대응하여 제 1 보상 세트를 반영할 수 있다. 서버는, 반복 수행에 대한 제한 조건 없이, 해당 액티비티에 대한 보상 세 트를 결정할 수 있다. 예를 들어, 해당 액티비티는, 습관화가 요구되는 액티비티로 설정될 수 있다. 이 경우, 서버는, 해당 액티비티의 반복 수행 여부에 기반하여 액티비티에 대한 가중치를 설정할 수 있다. 여기에 서, 반복 수행은, 지정된 기간 이내의 연속 수행을 의미할 수 있으며, 지정된 기간의 종류는 다양하게 설정될 수 있다. 지정된 기간이 하루인 경우에는, 해당 액티비티의 하루 이내의 반복 수행에 따른 가중치 조정에 따른 추가적인 보상을 부여하는 정책을, 데일리 미션이라 명명할 수도 있으며, 지정된 기간의 종류(또는, 길이)에는 제한이 없다. 만약, 반복 수행에 대한 제한 조건이 존재하면, 서버는, 1111 동작에서, 수행 이력에 기반하여 가중치 부 여 여부를 확인할 수 있다. 예를 들어, 반복 수행을 제한하기 위하여, 특정 액티비티에 대하여서는 지정된 조 건이 만족됨(예를 들어, 반복 수행과 연관된 파라미터가 지정된 임계 파라미터를 초과함)에 기반하여, 가중치를 부여하지 않을 수도 있다. 1113 동작에서, 수행 이력에 따른 가중치에 기반하여 제 2 보상 세트를 확인하고, 확인된 제 2 보상 세트의 제공을 나타내기 위한 데이터를 제 1 사용자 장치(예: 사용자 장치)로 제공할 수 있다. 서버는, 1115 동작에서, 제 1 사용자에 대응하여 제 2 보상 세트를 반영할 수 있다. 한편, 다른 구현에서는, 서버는, 특정 액티비티에 대한 반복 수행을 방지하고자, 예를 들어 지정된 조건이 만족됨(예 를 들어, 반복 수행과 연관된 파라미터가 지정된 임계 파라미터를 초과함)에 기반하여, 음수의 가중치가 부여될 수도 있다. 임계 반복 횟수를 초과한 이후의 누적 반복 횟수가 증가됨에 따라, 가중치에 대한 페널티의 정도가 증가될 수도 있다. 한편, 상술한 반복 수행에 대한 제한 조건이 존재하는지 여부에 기반한 차별화된 가중치를 설정하는 것은 단순 히 예시적인 것으로, 구현에 따라 액티비티 별로 반복 횟수에 기반한 가중치 부여 방식(또는, 보상 셋트 부여 방식)이 설정될 수도 있음을 당업자는 이해할 것이다. 아울러, 서버는, 액티비티 이용 시간을 반복 횟수 를 대체하여(또는, 반복 횟수와 함께 추가적으로), 사용 제한을 위한 가중치(또는, 보상 셋트)를 설정할 수도 있다. 예를 들어, 습관화가 요구되는 액티비티의 경우에는, 이용 시간이 누적됨에 따라서 상대적으로 높은 가 중치가 부여될 수 있다. 예를 들어, 습관화가 요구되지 않는 액티비티의 경우에는, 이용 시간의 누적 값이 임 계 누적값을 초과하면, 상대적으로 낮은 가중치가 부여되거나, 가중치가 부여되지 않거나, 또는 음수의 가중치 가 부여될 수도 있다. 한편, 상술한 반복 횟수에 대한 페널티 부여는, 일정 기간이 지나면 리셋될 수도 있다. 예를 들어, 특정 액티 비티에 대한 반복 횟수가 임계 반복 횟수를 초과한 경우, 서버는, 페널티 부여 해제 타이머를 개시할 수도있다. 페널티 부여 해제 타이머가 만료되기 이전에, 특정 액티비티가 수행되면, 페널티 부여 해제 타이머는 다 시 시작할 수 있다. 페널티 부여 해제 타이머가 동작하는 동안에는, 페널티 부여 정책의 활성화가 유지될 수 있다. 페널티 부여 해제 타이머가 동작하는 동안 액티비티가 수행되지 않음에 따라서, 페널티 부여 해제 타이 머가 만료될 수 있다. 이 경우, 서버는, 반복 횟수(또는, 누적 시간)을 초기화할 수도 있으며, 이에 따라 페널티 부여 정책이 비활성화될 수도 있다. 페널티 부여 해제 타이머의 진행과 연관된 정보는, 사용자 장치 로 제공될 수도 있다. 사용자 장치는, 페널티 부여 해제 타이머와 연관된 정보를 표현할 수도 있으 며, 사용자는 관련 정보를 보고 특정 액티비티에 대한 수행을 자제할 수도 있다. 상술한 바에 따라서, 특정 액티비티가 임계 횟수(또는, 임계 시간) 이상 수행되는 경우, 상대적으로 낮은 보상 이 부여되거나, 또는 보상이 감소될 수 있음에 따라, 특정 액티비티의 사용이 자제될 수 있다. 한편, 서버 는, 단순히 보상에 대한 제한 정책뿐만 아니라, 사용자의 정신 건강 상태에 대한 페널티를 부여하도록 설 정될 수도 있다. 예를 들어, 사용자의 건강 상태가 레벨로 표현되는 경우, 페널티로서 레벨이 감소될 수도 있 다. 예를 들어, 사용자의 건강 상태가 양호하게 유지되거나, 및/또는 특정 액티비티의 완수에 기반하여 사용자 에게 부여된 아이템(예를 들어, 뱃지, 상장, 또는 트로피)가 회수되도록 구현될 수도 있으며, 그 구현 방식에는 제한이 없다. 상술한 바와 같이, 가중치에 대한 다양한 설정 옵션들이 제공됨에 따라서, 정신 건강 상태를 보다 효과적으로 향상시킬 수 있도록 하는 액티비티 및/또는 액티비티의 이용을 유도하기 위한 시스템 설계가 가능할 수 있다. 특히, 습관화가 요구되는 액티비티 및/또는 습관화가 요구되지 않는 액티비티에 대한 차별화된 보상 부여가 가 능할 수 있어, 사용자의 정신 건강 상태가 보다 효과적으로 향상될 수 있다. 한편, [표 5]는, 다양한 실시예에 따른 보상 정책의 예시이다. 표 5"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 8, "content": "도 12는 일 실시예에 따른 사용자 성향을 고려한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한다. 일 실시예에 따라서, 서버는, 1201 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 1203 동작에서, 제 1 사용자의 성향을 확인할 수 있다. 예를 들어, 서버는, 서버 내에 (또는, 서버 에서 접근 가능한 외부의 저장소에) 미리 저장된 사용자의 성향(또는 성격)을 확인할 수 있다. 예를 들어, 서 버는, 사용자의 성향(또는 성격)을 확인하기 위한 적어도 하나의 동작을 수행함으로써, 사용자의 성향(또 는 성격)을 확인할 수 있다. 예를 들어, 사용자의 성향(또는 성격)은, 해당 사용자에 대한 설문 조사의 응답 결과에 기반하여 확인될 수 있다. 예를 들어, 사용자의 성향(또는 성격)은, 사용자에 대응하는 소셜 네트워크 내에서 정의되는 관계 정보(예를 들어, 친구 수, following 수, follower 수 등이지만 제한이 없다)에 기반하여 확인될 수 있다. 예를 들어, 사용자의 성향(또는 성격)은, 사용자에 대응하는 소셜 네트워크 내에서 정의되는 활동 정보(예를 들어, 사진 업로드 횟수, 쓰레드 생성 횟수, 댓글 생성 횟수, 타인 계정의 페이지 접속 횟수 등 이지만 제한이 없음)에 기반하여 확인될 수 있다. 한편, 상술한 사용자의 성향(또는 성격)의 확인 방식에는 제 한이 없음을 당업자는 이해할 것이다. 사용자의 성향(또는 성격)은, 예를 들어 Big 5 성격 유형 중 어느 하나 로 결정될 수 있으나, 성향(또는 성격)을 나타내기 위한 형식에는 제한이 없다.일 실시예에 따라서, 서버는, 1205 동작에서, 제 1 사용자와 관련한 액티비티 수행 및/또는 생체 신호를 확인할 수 있다. 서버는, 1207 동작에서, 제 1 사용자와 관련한 정신 건강 관련 정보를 확인할 수 있다. 예를 들어, 서버는, 상술한 바와 같이, 제 1 사용자의 생체 신호에 기반하여 사용자의 정신 건강 상태에 대한 정보를, 정신 건강 관련 정보로서 확인할 수 있다. 예를 들어, 서버는, 제 1 사용자의 액티비티 수 행 이력에 기반하여, 사용자의 정신 건강 상태에 대한 정보를, 정신 건강 관련 정보로서 확인할 수 있다. 예 를 들어, 서버는, 제 1 사용자가 수집(또는, 구매)한 아이템, 및/또는 재화와 연관된 정보를, 제 1 사용자 와 관련한 정신 건강 관련 정보로서 확인할 수 있다. 한편, 제 1 사용자의 가상 공간 내의 인터랙션 및/또는 인터랙션 결과와 연관된 정보라면, 제한없이 제 1 사용자와 관련한 정신 건강 관련 정보로서 이용될 수 있음을 당업자는 이해할 것이다. 일 실시예에 따라서, 서버는, 1209 동작에서, 제 1 사용자의 성향에 따른 정신 건강 관련 정보와 연관된 화면을 구성할 수 있다. 하나의 예에서, 서버는, 하나의 어플리케이션 스테이트(application state)에 대 응하여, 사용자의 성향 별로 복수 개의 화면을 구성할 수 있다. 이를, 사용자 맞춤형 화면이라 명명할 수도 있 다. 하나의 예에서, 서버는, 제 1 사용자의 성향이 외향적인 성격이라고 확인된 경우에는, 정신 건강 관 련 정보를 다른 사용자(예를 들어, 소셜 네트워크에 친구로 등록된 사용자이지만 제한이 없음)와 공유하기의 기 능을 포함시킨 화면을 구성하여, 사용자 장치로 제공할 수 있다. 사용자 장치는, 수신된 화면을 표 현할 수 있다. 표현된 화면에는, 다른 사용자와 정신 건강 관련 정보를 공유할 수 있는 오브젝트(또는, 키, 또 는 버튼)이 포함될 수 있다. 해당 오브젝트의 지정 및/또는 공유 대상 사용자가 지정되면, 사용자 장치는, 제 1 사용자의 정신 건강 관련 정보를, 공유 대상 사용자에게 공유를 허가하는 메시지를 서버 로 송신할 수 있다. 서버는, 해당 메시지의 수신에 기반하여, 제 1 사용자의 정신 건강 관련 정보를 공유 대상 사용자에게 제공할 수 있다. 하나의 예에서, 서버는, 제 1 사용자의 성향이 내향적인 성격이라 고 확인된 경우에는, 정신 건강 관련 정보를 다른 사용자와 공유하기의 기능을 포함하지 않는 화면을 구성하여, 사용자 장치로 제공할 수 있다. 예를 들어, 사용자 성향과 소셜 네트워크(또는, 소셜 미디어) 서비스의 이용과의 상관 관계에 대한 다수의 연구들이 진행되었다. 예를 들어, “Big Five personality traits, Big Two metatraits and social media: A meta-analysis (Dong Liu, W.Keith Campbell)”, “network use and personality(YairAmichai-Hamburger, aGideonVinitzkyb)”, “acii Ryan, Sophia Xenos), 및/또는 “ relationships among the Big Five Personality factors, self-esteem, narcissism, and sensation-seeking to Chinese University students' uses of social networking sites (SNSs)(Jin-Liang Wang, Linda A.Jackson, Da-Jun Zhang, Zhi-Qiang Su)”에서는, Big 5의 성격 유형과 소셜 네트워크 서비스의 이용과의 상 관 관계가 존재함이 확인되었다. 예를 들어, “interacts on the Web?: The intersection of users' personality and social media use(Teresa Correa, Amber Willard Hinsley, Homero Gilde Zuniga)”에서는, Big 5 성격 유형에 따라 Social media내 소통 활동 정도가 다름이 확인되었다. 상술한 바와 같이, 하나의 예에 서는, 사용자의 성향에 따라서 소셜 네트워크의 서비스를 선호할 수도 있거나, 또는 비선호할 수도 있다. 서버 는, 제 1 사용자의 성향에 따라서, 제 1 사용자에게 소셜 네트워크와의 연동 기능을 제공하거나, 또는 소 셜 네트워크와의 연동 기능을 제공하지 않을 수도 있다. 상술한 사용자의 정신 건강 관련 정보의 다른 사용자 와의 공유 여부는, 소셜 네트워크와의 연동 여부의 하나의 예시이며, 그 종류에는 제한이 없음을 당업자는 이해 할 것이다. 도 13은 일 실시예에 따른 사용자 성향을 고려한 가상 공간을 제공하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한다. 일 실시예에 따라서, 서버는, 1301 동작에서, 제 1 사용자의 접속을 확인할 수 있다. 서버는, 1303 동작에서, 제 1 사용자의 성향을 확인할 수 있다. 제 1 사용자의 성향의 확인 방식에 대하여서는 상술하였으므 로, 여기에서의 설명은 반복되지 않는다. 제 1 사용자의 성향이 제 1 성향으로 확인되면, 서버는, 1305 동작에서 제 1 성향에 대응하는 제 1 가상 공간을 표현하기 위한 데이터를 생성하여, 제 1 사용자 장치(예를 들 어, 사용자 장치)로 제공할 수 있다. 만약, 제 1 사용자의 성향이 제 2 성향으로 확인되면, 서버는, 1307 동작에서 제 2 성향에 대응하는 제 2 가상 공간을 표현하기 위한 데이터를 생성하여 제 1 사용자 장치(예 를 들어, 사용자 장치)로 제공할 수 있다. 제 1 성향에 대응하는 제 1 가상 공간 및 제 2 성향에 대응하 는 제 2 가상 공간은 적어도 일부 상이할 수 있다. 일 실시예에서, 제 1 성향에 대응하는 제 1 가상 공간에 포함되는 적어도 하나의 제 1 오브젝트 중 적어도 일부 는, 제 2 성향에 대응하는 제 2 가상 공간에 포함되는 적어도 하나의 제 2 오브젝트 중 적어도 일부와 상이할 수 있다. 예를 들어, 사용자의 성향에 따라, 가상 공간 내에 대한 오브젝트의 종류, 오브젝트의 배치 위치, 및/또는 전체 오브젝트의 개수에 대한 선호도가 상이할 수 있으며, 서버는 사용자의 성향에 기반하여 가상 공간 내에 대한 오브젝트의 종류, 오브젝트의 배치 위치, 및/또는 전체 오브젝트의 개수를 결정할 수도 있다. 하나의 예에서, 가상 공간에 배치되는 오브젝트는, 예를 들어 특정 액티비티의 선택 및/또는 수행과 연관된 오 브젝트일 수 있다. 상술한 바와 같이, 사용자의 성향에 따라 동기화(motivated) 효과가 상대적으로 큰 액티비 티가 상이할 수 있다. 예를 들어, 제 1 성향은 경쟁 기반의 액티비티에 의하여 상대적으로 많이 동기를 얻을 수 있으며, 제 2 성향은 경쟁 기반에 따른 액티비티에 의하여 상대적으로 적게 동기를 얻을 수도 있다. 서버 는, 사용자의 성향이 제 1 성향으로 확인되는 경우에, 경쟁 기반의 액티비티를 선택 및/또는 수행하는 오 브젝트를 포함하는 제 1 가상 공간을 표현하기 위한 데이터를 생성할 수 있다. 서버는, 사용자의 성향이 제 2 성향으로 확인되는 경우에, 경쟁 기반의 액티비티가 아닌 다른 액티비티를 선택 및/또는 수행하는 오브젝 트를 포함하는 제 2 가상 공간을 표현하기 위한 데이터를 생성할 수 있다. 상술한 바에 따라서, 사용자에 대하 여 개인화된 가상 공간의 제공이 가능할 수 있어, 사용자의 정신 건강 상태의 향상에 더욱 동기부여가 큰 가상 공간이 제공될 수 있다. 일 실시예에서, 제 1 성향에 대응하는 제 1 가상 공간에 포함되는 적어도 하나의 제 1 아바타(또는, 캐릭터) 중 적어도 일부는, 제 2 성향에 대응하는 제 2 가상 공간에 포함되는 적어도 하나의 제 2 아바타(또는, 캐릭터) 중 적어도 일부와 상이할 수 있다. 예를 들어, 사용자의 성향에 따라, 가상 공간 내의 다른 사용자의 아바타가 상 대적으로 다수 포함되는 것을 선호할 수도 있거나, 또는 비선호할 수도 있다. 서버는, 사용자의 성향에 따라서, 가상 공간에 포함되는 아바타를 결정할 수 있다. 만약, 사용자의 성향이 다수의 사용자가 배치되는 것 을 선호함에도 불구하고, 사용자와 관계되는(예를 들어, 소셜 네트워크 상에서 친구의 관계를 가지는) 사용자가 상대적으로 적거나, 및/또는 해당 공간에 접속하는 사용자가 상대적으로 적은 경우에는, 서버는, NPC에 대 응하는 아바타를 가상 공간에 포함시킬 수도 있다. NPC는, 예를 들어 챗봇과 같은 대화 기능을 지원할 수 있으 며, 이에 따라 사용자가 해당 아바타가 NPC인 것을 인식하기 어려울 수도 있다. 도 14는 일 실시예에 따른 사용자 성향을 고려한 어플 패키지를 제공하기 위한 서버의 동작 방법을 설명하기 위 한 흐름도를 도시한다. 일 실시예에 따라서, 어플리케이션 다운로드를 위한 서버(예를 들어, 서버일 수 있지만, 어플리케이션 마 켓 서버일 수도 있음)는, 1401 동작에서, 제 1 사용자로부터(또는, 제 1 사용자의 계정에 기반하여 접속한 사용 자 장치로부터), 정신 건강 어플리케이션의 다운로드 요청을 수신할 수 있다. 1403 동작에서, 서버는, 제 1 사용자의 성향을 확인할 수 있다. 예를 들어, 서버는, 정신 건강 어플리케이션의 다운로드 요청에 기반하여, 정신 건강 어플리케이션의 사업자 운영 서버, 및/또는 소셜 네트워크 서비스 제공 서버에, 제 1 사용자의 성향 을 쿼리한 후, 쿼리에 대한 응답으로서 제 1 사용자의 성향에 대한 정보를 수신할 수 있다. 또는, 서버는, 제 1 사용자의 어플리케이션 다운로드 이력에 기반하여, 제 1 사용자의 성향을 확인할 수도 있으며, 제 1 사용자의 성향의 확인 방식에는 제한이 없음을 당업자는 이해할 것이다. 제 1 사용자의 성향이 제 1 성향인 경우, 서버 는, 1405 동작에서, 제 1 성향에 대응하는 제 1 인스톨 설정을 포함하는 어플레이케이션 패키지를 제 1 사용자 장치(예를 들어, 사용자 장치)로 제공할 수 있다. 제 1 사용자의 성향이 제 2 성향인 경우, 서버는, 1407 동작에서, 제 2 성향에 대응하는 제 2 인스톨 설정을 포함하는 어플레이케이션 패키지를 제 1 사용자 장치(예를 들어, 사용자 장치)로 제공할 수 있다. 하나의 예로, 사용자의 성향별로, 정신 건강 어플리케이션에서으 로부터의 액티비티의 수행과 같은 다양한 노티피케이션(notification)의 제공을 선호할 수도 있거나, 또는 선호 하지 않을 수도 있다. 만약, 제 1 성향이 노티피케이션 제공을 선호하는 경우에는, 서버는, 정신 건강 어플리 케이션에 의한 노티피케이션 제공이 허용되도록 자동 설정하거나, 또는 노티피케이션 제공에 대한 허용 여부를 문의하도록, 제 1 인스톨 설정을 결정할 수 있다. 이에 따라, 사용자 장치가, 정신 건강 어플리케이션을 다운로드 받은 후 인스톨하는 경우, 노티피케이션 제공이 자동으로 허용되거나, 또는 노티피케이션 제공의 허용 여부를 문의하는 팝업 윈도우를 표시할 수 있다. 만약, 제 2성향이 노티피케이션 제공을 선호하지 않는 경우에 는, 서버는, 정신 건강 어플리케이션에 의한 노티피케이션 제공이 허용되지 않도록 자동 설정하거나, 또는 노티 피케이션 제공에 대한 허용 여부를 문의하지 않도록, 제 1 인스톨 설정을 결정할 수 있다. 이에 따라, 사용자 장치가, 정신 건강 어플리케이션을 다운로드 받은 후 인스톨하는 경우, 노티피케이션 제공이 자동으로 허 용되지 않거나, 또는 노티피케이션 제공의 허용 여부를 문의하는 팝업 윈도우의 표시가 삼가될(refrain from) 수 있다. 한편, 인스톨 환경에서 자동적으로 설정되는 파라미터는, 정신 건강 어플리케이션 이용의 동기부여를 향상시킬 수 있는 파라미터라면 제한이 없음을 당업자는 이해할 것이다. 다양한 실시예에 따른 사용자 장치는, 아래의 다양한 예시들에 따른 화면들을 표현(또는, 제공, 또는 표시)할 수 있다. 상술한 바와 같이, 사용자 장치는, 서버로부터 수신되는 데이터를 이용하여 화면을 표시하거나, 서버로부터 수신되는 데이터 및 사용자 장치에서 획득한(또는, 저장된) 데이터를 이 용하여 화면을 표시하거나, 또는 서버로부터의 데이터 없이 사용자 장치에서 획득한(또는, 저장된) 데이터만을 이용하여 화면을 표시할 수도 있으며, 화면을 구성하는데 이용되는 데이터의 종류, 및/또는 소스에 는 제한이 없음을 당업자는 이해할 것이다. 이에 따라, 이하에서의 사용자 장치가 화면을 제공하는 실시 예들은, 상술한 다양한 소스들로부터의 데이터에 기반하여 화면을 제공할 수 있음을 당업자는 이해할 것이다. 한편, 후술되는 다양한 제3자 시점에서 가상 공간의 표현은, 단순히 예시적인 것이며, 후술되는 가상 공간 표현 은, VR 컨텐트, 및/또는 AR 컨텐트를 고려하여 사용자 시점에서 표현으로 구현될 수도 있음을 당업자는 이해할 것이다. 도 15a 내지 15c는 다양한 실시예에 따라 사용자에게 제공되는 인 어플리케이션 액티비티 수행 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 가상 공간을 제공할 수 있다. 가상 공간에는, 아바타 들(10011,10012)이 포함될 수 있다. 예를 들어, 제 1 아바타는, 가상 공간에서 정의되는 NPC에 대응하 는 아바타일 수 있다. NPC는, 예를 들어 특정한 사용자의 조작에 의하여 동작하지 않는 엔티티를 의미할 수 있 으며, 특정 동작을 수행하도록 야기하는 프로그램에 의하여 동작하거나, 및/또는 가상 공간의 관리자에 의하여 동작할 수도 있으나, 제한은 없다. NPC인 제 1 아바타는, 가상 공간 내의 일정한 지점에 배치되 거나, 프로그램에 따라서 확인되는 경로에 따라 이동하거나, 및/또는 특정 사용자에 대응하는 아바타로 접근하 도록 이동할 수도 있다. 한편, 제 1 아바타가 NPC인 것은 단순히 예시적인 것이며, 제 1 아바타(1001 1)는, 다른 사용자에 의하여 조작되는 아바타일 수도 있다. 제 2 아바타는, 사용자 장치의 사용자 의 조작에 따라 동작할 수 있다. 제 2 아바타는, 예를 들어 사용자 아바타라 명명될 수도 있다. 본 예 시에서는, 사용자의 조작에 따라 제 2 아바타가 이동함에 따라서, 제 1 아바타가 존재하는 가상 공간으로 이동함에 따라, 제 1 아바타 및 제 2 아바타가 모두 존재하는 가상 공간(1001 0)이 표현될 수 있다. 또는, NPC인 제 1 아바타가 제 2 아바타로 이동함에 따라서, 제 1 아바타 및 제 2 아바타가 모두 존재하는 가상 공간이 표현될 수도 있다. 한편, 제 1 아바타 근처에 위치되는 인디케이션이 함께 제공될 수도 있다. 인디케이션은, 지정 시(또는, 인디케이션과 연관되는 오브젝트(본 경우에서는, 제 1 아바타와의 인터랙션 시), 기능(예를 들어, 인 어플리케이션 액티비티, 아웃도어 액티비티, 가상 공간 내에서의 아바타의 활동, 및/또는 다른 기능의 호출을 포함하지만 제한이 없음)을 제공하도록 야기할 수 있다. 예를 들어, 인디케이션의 지정 및/또는 인디케이션과 연관되는 오브젝트(본 경우에서는, 제 1 아바타와의 인터랙션이 확인됨에 기반하여, 도 15b와 같은 화면이 제공될 수 있다. 인디케이션의 지정 및/또는 인디케이션과 연 관되는 오브젝트(본 경우에서는, 제 1 아바타와의 인터랙션에 따라 제공되는, 가상 공간에는, 제 1 아바타 및 제 2 아바타가 포함될 수 있다. 한편, 가상 공간을 덮는 텍스트 창(1002 5)이 제공될 수 있다. 텍스트 창은, 예를 들어 인 어플리케이션 액티비티의 실행을 추천하는 문구(예: “명상은 우리의 몸과 마음을 이완시키고 긴장과 스트레스를 완화시킬 수 있도록 도와줍니다. 지금 바로 명상을 시작하시겠습니까?”)와, 인 어플리케이션 액티비티를 실행시키기 위한 확인 버튼을 포함할 수 있다. 만약, 확인 버튼이 지정됨이 확인되면, 사용자 장치는, 인 어플리케이션 액티비티를 표현하기 위한 컨텐트를 제공할 수 있다. 예를 들어, 사용자 장치는, 도 15c와 같은 화면을 제공할 수 있다. 사용자 장 치에 의하여 제공되는 가상 공간에는 제 1 아바타가 포함되되, 제 1 아바타는, 인 어플리케이션 액티비티의 수행을 위한 동작을 수행할 수 있다. 예를 들어, 인 어플리케이션 액티비티가 명상인 경우에는, 제 1 아바타는, 명상과 연관된 포즈를 취하도록 설정될 수 있으며, 해당 포즈 이외에도, 명상 수행 과정을 유도하기 위한 음성 및/또는 텍스트가 컨텐트로서 제공될 수도 있다. 이에 따라, 제 2 아바타 의 사용자는, 제공되는 컨텐트의 적어도 일부에 기반하여, 인 어플리케이션 액티비티를 수행할 수 있다. 한편, 인 어플리케이션 액티비티가 완료됨이 확인됨에 기반하여, 액티비티의 완료를 나타내기 위한 텍스트 창 이 가상 공간을 덮도록 표시될 수도 있다. 상술한 도면에서는, 텍스트 창이 가상 공간 을 덮도록 표시되는 것과 같이 도시되어 있지만, 이는 인 어플리케이션 액티비티가 완료된 이후에 표시 되는 것으로, 인 어플리케이션 액티비티가 완료되기 이전에는, 가상 공간만이 표시될 수도 있음을 당업 자는 이해할 수 있을 것이다. 텍스트 창에는, 액티비티가 완료됨을 나타내는 텍스트 및/또는 액티비티 완료에 기반하여 지급되는 보상(예를 들어, 본 예시에서는 20개의 하트)을 표현하기 위한 정보를 포함할 수 있 으나, 제한은 없다. 한편, 상술한 NPC에 의한 추천에 기반한 인 어플리케이션 액티비티의 지정 및/또는 실행은, 단순히 예시적인 것이다. 상술한 바와 같이, 다른 사용자에 의하여 조작되는 아바타가, 가상 공간 내 에서 사용자에 대응하는 아바타에게 인 어플리케이션 액티비티의 실행을 추천하는 기능 또한 제공될 수 있다.또는, 사용자에 의하여 조작되는 아바타가, 가상 공간 내에서 다른 사용자에 대응하는 아바타에게 인 어플리케 이션 액티비티의 실행을 추천하는 기능 또한 제공될 수도 있다. 또는, 복수 아바타들의 개입 없이, 사용자 단 독으로 가상 공간 내에 존재하는 오브젝트와의 인터랙션이 확인됨에 기반하여, 인 어플리케이션 액티비티의 지 정 및/또는 실행이 수행될 수도 있다. 한편, 가상 공간 내에서의 아바타 및/또는 다른 종류의 오브젝트와의 인터랙션에 기반하여, 인 어플리케이션 액 티비티가 지정되거나, 및/또는 실행되는 것은 단순히 예시적인 것이다. 인 어플리케이션 액티비티 이외에도, 아웃도어 액티비티 또한 가상 공간 내에서의 아바타 및/또는 다른 종류의 오브젝트와의 인터랙션에 기반하여 지 정되거나, 및/또는 실행될 수도 있다. 도 16a 및 16b는 다양한 실시예에 따라 사용자에게 제공되는 인 어플리케이션 액티비티 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 가상 공간을 제공할 수 있다. 가상 공간에는, 아바타 가 포함될 수 있다. 예를 들어, 아바타는, 사용자 장치의 사용자의 조작에 따라 동작할 수 있으며, 사용자 아바타라 명명될 수도 있다. 본 예시에서는, 사용자의 조작에 따라 아바타가 이동함에 따라서, 조작 가능한 오브젝트가 존재하는 가상 공간으로 이동함에 따라, 아바타 및 조작 가능한 오브젝트가 모두 존재하는 가상 공간이 표현될 수 있다. 한편, 조작 가능한 오브젝트 근처에 위치되는 인디케이션이 함께 제공될 수도 있다. 인디케이션은, 지정 시(또는, 인디케이션과 연관되는 오브젝트(본 경우에서는, 조작 가능한 오브젝트와의 인터랙션 시), 기능 (예를 들어, 인 어플리케이션 액티비티, 아웃도어 액티비티, 가상 공간 내에서의 아바타의 활동, 및/또는 다른 기능의 호출을 포함하지만 제한이 없음)을 제공하도록 야기할 수 있다. 예를 들어, 인디케이션의 지정 및/또는 인디케이션과 연관되는 오브젝트(본 경우에서는, 조작 가능한 오브젝트와의 인터랙션이 확인됨에 기반하여, 16b와 같은 화면이 제공될 수 있다. 인디케이션의 지정 및/또는 인디케이션과 연관되는 오브젝트(본 경우에서는, 조작 가능한 오브젝 트)와의 인터랙션에 따라 제공되는, 가상 공간에는, 사용자 아바타인 아바타 및 조작 가 능한 오브젝트가 포함될 수 있다. 아바타 및 조작 가능한 오브젝트의 형상은, 인 어플리 케이션 액티비티의 수행과 연관되도록 표현될 수 있으나, 제한은 없다. 예를 들어, 인 어플리케이션 액티비티가 낚시인 경우에는, 아바타는, 낚시 액티비티와 연관된 포즈를 취 하도록 설정될 수 있으며, 오브젝트 또한, 낚시 중임을 나타내는 형상을 가지도록 표현될 수 있다. 이 에 따라, 아바타의 사용자는, 제공되는 컨텐트의 적어도 일부에 기반하여, 인 어플리케이션 액티비티를 수행할 수 있다. 한편, 인 어플리케이션 액티비티가 완료됨이 확인됨에 기반하여, 액티비티의 완료를 나타내기 위한 텍스트 창이 가상 공간을 덮도록 표시될 수도 있다. 상술한 도면에서는, 텍스트 창(1012 5)이 가상 공간을 덮도록 표시되는 것과 같이 도시되어 있지만, 이는 인 어플리케이션 액티비티가 완료 된 이후에 표시되는 것으로, 인 어플리케이션 액티비티가 완료되기 이전에는, 가상 공간만이 표시될 수 도 있음을 당업자는 이해할 수 있을 것이다. 텍스트 창에는, 액티비티가 완료됨을 나타내는 텍스트 및/ 또는 액티비티 완료에 기반하여 지급되는 보상(예를 들어, 본 예시에서는 20개의 하트)을 표현하기 위한 정보를 포함할 수 있으나, 제한은 없다. 상술한 바와 같이, 가상 공간 내에서의 조작 가능한 오브젝트와의 인터랙션에 기반하여, 인 어플리케이션 액티비티가 지정되거나, 및/또는 실행되는 것은 단순히 예시적인 것이다. 인 어플 리케이션 액티비티 이외에도, 아웃도어 액티비티 또한 가상 공간 내에서의 아바타 및/또는 다른 종류의 오브젝 트와의 인터랙션에 기반하여 지정되거나, 및/또는 실행될 수도 있다. 도 17a 및 17b는 다양한 실시예에 따라 사용자에게 제공되는 액티비티 선택 및 수행 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 액티비티 선택을 위한 화면을 제공할 수 있다. 액티비티 선 택을 위한 화면은, 설명의 편의 상 worlds 화면이라 명명될 수도 있다. 액티비티 선택을 위한 화면 에는, 선택 가능한 복수 개의 인 어플리케이션 액티비티들 중 적어도 하나 및/또는 선택 가능한 복수 개 의 아웃도어 액티비티들 중 적어도 하나가 포함될 수 있다. 액티비티들은, 예를 들어 카테고리(10211, 10212, 10213) 별로 구분될 수도 있다. 예를 들어, 안정 훈련(relaxation practices)의 카테고리로, 사용자의 심신의 안정을 도모하기 위한 적어도 하나의 액티비티(예를 들어, 그룹 명상(group meditation), 단 시간 요가 (10 Minutes Yoga), 스트레스 관리(managing stress), 업무 충실 훈련(mindfulness at work), 및/또는 그룹 요 가(group yoga)를 포함할 수 있으나 제한이 없음)가 분류될 수 있다. 예를 들어, 게임(game)의 카테고리 로, 스트레스 해소, 및/또는 집중력 향상을 위한 게임 액티비티(예를 들어, 미니 게임(minigame party), 직쏘 퍼즐(jigsaw puzzle), 야구게임(homerun challenge), 줄다리기(tug of war), 및/또는 트래픽 제어기(traffic controller)를 포함할 수 있으나, 제한이 없음)가 분류될 수 있다. 도시되지는 않았지만, 예를 들어 창의적 표현(creative expression)의 카테고리에는, 사용자의 창의력 향상을 도모하기 위한 액티비티(예 를 들어, 그림 그리기 등)가 분류될 수도 있다. 사용자 장치는, 제공되는 다양한 액티비티들 중 어느 하 나에 대한 선택을 확인할 수 있다. 예를 들어, 사용자 장치가, 그룹 명상이 선택되는 것을 확인함에 기반 하여, 17b와 같은 화면을 제공할 수 있다. 사용자 장치에 의하여 제공되는 가상 공간에는 그룹 요가에 참석하는 복수의 아바타들(10221, 10222, 10223)가 포함될 수 있다. 복수의 아바타들(10221, 10222, 10223) 중 하나는 사용자 아바타일 수 있으 며, 이외의 아바타는 다른 사용자의 사용자 아바타 및/또는 NPC 아바타일 수 있다. 상기의 화면 이외에 도, 사용자들의 명상 훈련을 도울 수 있는 음성 및/또는 텍스트가 컨텐트로서 제공될 수도 있다. 한편, 인 어 플리케이션 액티비티가 완료됨이 확인됨에 기반하여, 액티비티의 완료를 나타내기 위한 텍스트 창이 가 상 공간을 덮도록 표시될 수도 있다. 상술한 도면에서는, 텍스트 창이 가상 공간을 덮도 록 표시되는 것과 같이 도시되어 있지만, 이는 인 어플리케이션 액티비티가 완료된 이후에 표시되는 것으로, 인 어플리케이션 액티비티가 완료되기 이전에는, 가상 공간만이 표시될 수도 있음을 당업자는 이해할 수 있 을 것이다. 텍스트 창에는, 액티비티가 완료됨을 나타내는 텍스트 및/또는 액티비티 완료에 기반하여 지급되는 보상(예를 들어, 본 예시에서는 20개의 하트)을 표현하기 위한 정보를 포함할 수 있으나, 제한은 없다. 일 실시예에 따라서, 사용자 장치 및/또는 서버는, 가상 공간 내의 현재 사용자 아바타의 위치에 기 반하여, 아웃도어 액티비티를 추천 및/또는 실행할 수 있다. 예를 들어, 사용자 장치 및/또는 서버 는, 스포츠 상품 판매 상점이 포함된 가상 공간을 제공할 수 있다. 예를 들어, 서버는, 제3자 사업자와의 계약에 기반하여, 가상 공간 내에 제3자를 위한 오브젝트(예를 들어, 상품, 상점 형태일 수 있으나 제한이 없음)를 배치시킬 수 있다. 해당 오브젝트의 선택이 확인되면, 사용자 장치 및/또는 서버는, 해당 오브젝트와 관련된 정보, 구매 가능한 홈페이지로의 연결, 및/또는 쿠폰 제공과 같은 상업적 수단을 위한 기능 을 제공할 수 있으나, 제한은 없다. 일 실시예에 따른 사용자 장치 및/또는 서버는, 해당 오브젝트 에 대한 선택, 해당 오브젝트에 대한 접근, 및/또는 해당 오브젝트와 연관된 기능의 수행 등을 트리거로 하여, 관련 아웃도어 액티비티를 수행 및/또는 추천할 수 있다. 예를 들어, 스포츠 관련 품목에 대한 선택 및/또는 구매가 확인된 경우, 사용자 장치 및/또는 서버는, 관련 아웃도어 액티비티로서, 물리적인 장소 방문 (예를 들어, 관련 상점 방문)을 실행 및/또는 추천할 수 있다. 이 경우, 사용자 장치 및/또는 서버 는, 가상 공간에서, 해당 아웃도어 액티비티로 진입할 수 있는 오브젝트를 표현할 수도 있다. 예를 들어, 가상 공간 내에서 문(door) 형상의 오브젝트가 제공될 수 있으며, 사용자 인터랙션으로 문이 지정된 경우, 아바타가 문을 열고 출입함으로써, 다른 가상 공간, 특정 인-어플리케이션 액티비티에 대응하는 화면, 또는 특정 아웃도 어 액티비티에 대응하는 화면이 제공될 수도 있으나, 이는 예시적인 것으로 제한은 없다. 한편, 상술한 상점은, 단순히 예시적인 것으로, 사용자 장치 및/또는 서버는, 사용자 장치에 대 응하는 이벤트 정보에 기반하여, 아웃도어 액티비티를 추천 및/또는 수행할 수도 있다. 예를 들어, 서버 는, 사용자 장치의 위치(예를 들어, GPS 및/또는 WPS에 기반하여 확인될 수 있으나 제한은 없음)에 대응하 는 이벤트(예를 들어, 러닝 이벤트)를 확인할 수 있다. 또는, 서버는, 가상 공간 내의 아바타의 위치에 대 응하는 이벤트를 확인할 수도 있다. 하나의 예를 들어, 가상 공간은 실제 세계에 매핑되도록 제작될 수도 있으 며, 이에 따라 실제 세계에서의 이벤트가 해당 가상 공간에 대응하여서도 설정될 수도 있다. 예를 들어, “ NewYork”에서 러닝 이벤트가 진행되는 경우, 서버는, “NewYork”의 가상 공간에 대하여서도 러닝 이벤트 를 설정할 수도 있다. 아바타가 “NewYork”의 가상 공간에 방문하는 경우, 서버는, 실제 세계에서의 “ NewYork”에 대응하는 이벤트를 확인하여, 해당 이벤트에 대응하는 아웃도어 액티비티를 추천 또는 실행하도록 설정도리 수도 있다. 사용자 장치 및/또는 서버는, 해당 이벤트에 대응하는 아웃도어 액티비티(예를 들어, 러닝의 아웃도어 액티비티, 또는 러닝 이벤트에 대응하는 홈페이지로의 접속)를 추천 및/또는 실행할 수 있다. 사용자 장치 및/또는 서버는, 러닝 이벤트에 대응하는 완료 조건의 만족에 기반하여, 아웃도 어 액티비티의 만족 여부를 결정할 수도 있다. 도 18a 내지 18c는 다양한 실시예에 따라 사용자에게 제공되는 아웃도어 액티비티 수행 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 아웃도어 액티비티와 연관된 화면을 제공할 수 있다. 예를 들어, 본 예시에서, 아웃도어 액티비티가 “특정 장소 방문”인 것을 상정하도록 한다. 이 경우, 아웃도어 액 티비티와 연관된 화면는, 사용자의 현재 위치와 연관된 맵을 포함할 수 있다. 아웃도어 액티비티와 연 관된 화면은, 사용자(또는, 사용자 장치)의 현재 위치를 나타내는 인디케이터를 포함할 수있다. 인디케이터 및/또는 맵은, 사용자 장치의 위치 정보(예를 들어, GPS 정보이지만 제한이 없 음)에 기반하여 변경될 수도 있다. 아웃도어 액티비티와 연관된 화면은, 방문 목표 지점을 나타내는 인 디케이터(10312,10313)를 포함할 수 있다. 사용자는, 맵 상의 인디케이터들(10311,10312,10313)을 인식함으로 써, 목표 지점까지 이동할 수 있다. 목표 지점은, 예를 들어 사용자 아바타가 위치하는 가상 공간의 종류에 기 반하여 설정될 수도 있다. 예를 들어, 사용자 아바타가 위치하는 가상 공간의 종류가 숲인 경우에는, 목표 지 점이 숲으로 설정될 수도 있다. 예를 들어, 사용자 아바타가 위치하는 가상 공간의 종류가 해변이면, 목표 지 점이 수변 공간으로 설정될 수도 있으나, 이는 예시적인 것으로 목표 지점의 설정 기준에는 제한이 없다. 도 18b를 참조하면, 사용자의 움직임에 따라 사용자 장치의 위치가 변경될 수 있다. 사용자 장치의 위치 변경에 기반하여, 사용자 장치의 현재 위치를 나타내는 인디케이터의 맵 상의 위치가 변경된 화면이 제공될 수 있다. 화면에 포함된 맵은, 화면에 포함된 맵과 상이할 수 있으며, 이 는 사용자 장치의 위치 변경에 의하여 야기될 수 있다. 화면을 참조하면, 인디케이터가, 목표 지점을 나타내는 인디케이터와 지정된 거리 이내인 것으로 확인(또는, 목표 지점의 영역 내에 포함 된 것으로 확인)될 수 있다. 이는, 사용자가 목표 지점에 도달한 것으로서 확인될 수 있으며, 사용자 장치 는, 목표 지점에 도달한 지 여부를 판정하기 위한 타이머를 제공할 수 있다. 타이머에는, 상태 바(status bar) 및 시간의 흐름에 따라 상태 바 상을 움직이는(또는, 상태 바를 채우는) 인디케이터가 포 함될 수 있으나, 그 구현 방식에는 제한이 없다. 타이머가 만료되는 경우, 사용자 장치 및/또는 서버는, 아웃도어 액티비티가 완료된 것으로 확인할 수도 있다. 도 18c를 참조하면, 상술한 바와 같이, 타이머가 만료되는 경우, 타이머에 포함된 상태 바의 실 질적인 전체를 인디케이터가 채우는 것과 같이, 화면이 표현될 수 있다. 인디케이터(10331, 10332)는, 실질적으로 동일한 위치를 유지할 수 있다. 사용자 장치 및/또는 서버는, 타이머의 만료에 기반하여, 아웃도어 액티비티의 완료를 확인할 수 있다. 한편, 이는 예시적인 것으로, 타이머의 개입 없이, 사용자 장치의 현재 위치가 지정된 위치 범위 내에 포함됨에 기반하여, 아웃도어 액티비티가 완료 된 것으로 확인될 수도 있음을 당업자는 이해할 것이다. 한편, 아웃도어 액티비티가 완료됨이 확인됨에 기반하 여, 액티비티의 완료를 나타내기 위한 텍스트 창이 가상 공간을 덮도록 표시될 수도 있다. 상술 한 도면에서는, 텍스트 창이 가상 공간을 덮도록 표시되는 것과 같이 도시되어 있지만, 이는 아 웃도어 액티비티가 완료된 이후에 표시되는 것으로, 아웃도어 액티비티가 완료되기 이전에는, 가상 공간(1033 0)만이 표시될 수도 있음을 당업자는 이해할 수 있을 것이다. 텍스트 창에는, 액티비티가 완료됨을 나 타내는 텍스트 및/또는 액티비티 완료에 기반하여 지급되는 보상(예를 들어, 본 예시에서는 20개의 하트)을 표 현하기 위한 정보를 포함할 수 있으나, 제한은 없다. 일 실시예에 따라서, 사용자 장치 및/또는 서버는, 가상 공간 내에서 정의되는 아웃도어 액티비티를 제공할 수도 있다. 예를 들어, 사용자 장치 및/또는 서버는, 실제 세계가 아닌 가상 공간 세계 내에 서의 특정 장소의 방문을, 아웃도어 액티비티로서 제공할 수도 있다. 예를 들어, 아웃도어 액티비티가 수행 중 에는, 아바타의 움직임이 터치스크린의 입력, 및/또는 입력 장치의 조작이 아닌, 물리적인 움직임을 측정하기 위한 페도미터, 가속도 센서, 자이로 센서 등의 센싱 데이터에 의하여 제어될 수 있다. 이에 따라, 사용자의 실제 세계의 움직임에 따라서, 가상 공간 내의 아바타가 움직일 수 있다. 가상 공간 내에서 지정된 특정 장소 까지의 이동을 위하여, 사용자는 실제 세계에서의 이동을 수행하여야 할 수 있다. 사용자 장치 및/또는 서버는, 실제 세계에서의 사용자의 이동과 연관된 센싱 데이터에 기반하여, 가상 공간에서의 사용자 아바 타의 움직임을 야기할 수 있다. 사용자 장치 및/또는 서버는, 사용자 아바타가 가상 공간 내에서의 특정한 지점에 도달한 것으로 확인되면, 해당 아웃도어 액티비티가 완료된 것으로 확인될 수도 있다. 상술한 바와 같이, 사용자 장치 및/또는 서버는, 아웃도어 액티비티를 위한 적어도 일부의 컨텐트를 가상 공 간 내에서 표현할 수도 있다. 도 19a 및 19b는 다양한 실시예에 따라 사용자에게 제공되는 사용자 성향 별 화면의 예시이다. 상술한 바와 같이, 사용자 장치는, 사용자 성향 별로 상이한 UI를 제공할 수 있다. 예를 들어, 사용자 장치는, 사용자의 성향이 제 1 성향임에 기반하여, 상기의 도면과 같은 화면을 제공할 수 있다. 예를 들어, 화면은, 아바타들(10511,10512)이 포함된 가상 공간에 관한 화면일 수 있다. 가 상 공간 상에는, 채팅 아이콘이 오버랩되어 표시될 수 있다. 채팅 아이콘는, 텍스트 채 팅 리스트 및 입력 UI(예를 들어, SIP이지만 제한이 없음)의 활성화/비활성화의 토글링(toggling)을 위 한 아이콘일 수 있다. 텍스트 채팅 리스트에는, 사용자 계정 및 다른 사용자들 계정 사이의 송수신된메시지의 텍스트들의 적어도 일부가 포함될 수 있다. 마이크 아이콘은, 보이스 채팅을 위하여 마이크 (또는, 음성 입력 기능)의 온/오프 토글링을 위한 아이콘일 수 있다. 스피커 아이콘은, 보이스 채팅을 위하여 스피커(또는, 음성 출력 기능)의 온/오프의 토글링을 위한 아이콘일 수 있다. 예를 들어, 상기 도면에 서는, 채팅 아이콘, 마이크 아이콘, 및 스피커 아이콘이 모두 활성화된 상태일 수 있다. 예를 들어, 제 1 성향은, 외향적인 성향일 수 있다. 사용자의 성향이 외향적인 성향인 경우에는, 기본 상태가, 채팅 아이콘, 마이크 아이콘, 및 스피커 아이콘이 모두 활성화된 상태일 수 있다. 한편, 메뉴 호출 아이콘이 지정 시, 메뉴가 표시될 수 있다. 감정 표현 아이콘이 지정 시, 다양한 후 보 감정들이 제공될 수 있다. 후보 감정들 중 어느 하나가 선택됨에 기반하여, 사용자 장치는, 사용자 아 바타가 해당 감정에 대응하는 동작을 수행하는 표현을 제공할 수 있다. 제스처 표현 아이콘이 지정 시, 다양한 후보 제스처들이 제공될 수 있다. 후보 제스처들 중 어느 하나가 선택됨에 기반하여, 사용자 장치(11 0)는, 사용자 아바타가 해당 제스처에 대응하는 동작을 수행하는 표현을 제공할 수 있다. 제스처의 종류에는, 인사, 박수, 손하트, 명상 등의 단독 제스처, 및/또는 하이파이브, 악수, 포옹 등의 협력 제스처가 있지만, 제 한은 없다. 예를 들어, 사용자 장치는, 사용자의 성향이 제 2 성향(예를 들어, 내향적성향)임에 기반하여, 도 19b와 같은 화면을 제공할 수 있다. 한편, 일부의 아이콘들(10617, 10618, 10619)은 아이콘들(10517, 10518, 10519)과 동일할 수 있으며, 가상 공 간에 포함된 아바타들(10611, 10612)은 가상 공간에 포함된 아바타들(10511, 10512)과 동일할 수 있으므로, 여기에서의 설명은 반복되지 않는다. 채팅 아이콘는, 비활성화된 상태일 수 있다. 이에 따라, 텍스트 채팅 리스트이 표시되지 않음을 확인할 수 있다. 마이크 아이콘 및 스피커 아이콘 은, 비활성화된 상태일 수 있다. 예를 들어, 제 2 성향은, 내향적인 성향일 수 있다. 사용자의 성향이 내향적인 성향인 경우에는, 기본 상태가, 채팅 아이콘, 마이크 아이콘, 및 스피커 아이콘(1061 5)이 모두 비활성화된 상태일 수 있다. 상술한 바와 같이, 사용자 장치는, 사용자의 성향별로 상이한 UI 를 제공할 수 있다. 도 20은 다양한 실시예에 따라 사용자에게 제공되는 액티비티 성취 관련 화면의 예시이다. 일 실시예에 따른 사용자 장치는, 하기의 도면과 같은 사용자 레벨 확인용 화면을 제공할 수 있다. 일 실시예에 따른 사용자 레벨 확인용 화면은, 예를 들어 액티비티 별 습관화 레벨과 연관된 화면일 수 있다. 예를 들어, 사용자 장치 및/또는 서버는, 인 어플리케이션 액티비티들 각각에 대한 습 관화 레벨을 관리할 수 있다. 예를 들어, 화면과 같은 예시에서, 사용자 장치 및/또는 서버 는, 인 어플리케이션 액티비티들 중 하나인 인 어플리케이션 운동에 대하여서는 레벨 2의 습관화 레벨을 설정하고, 취미 생활에 대하여서는 레벨 1의 습관화 레벨을 설정할 수 있다. 습관화 레벨은, 예를 들어 해당 액티비티를 지속적으로 수행하는 경우에 증가하도록 설정될 수 있다. 예를 들어, 특정 액티비티를 1 단위 시간 (예를 들어, 하루) 동안 특정 횟수 이상 수행한 조건에 기반하여, 습관화 레벨은 증가되도록 설정될 수 있다. 이에 따라, 단위 시간의 연속 수행 횟수가 증가됨에 따라 습관화 레벨이 증가될 수 있다. 한편, 연속적인 수행 이 중단되는 경우에, 습관화 레벨이 정지하거나, 또는 감소하도록 설정될 수도 있으나 제한은 없다. 예를 들어, 사용자 장치 및/또는 서버는, 아웃도어 액티비티들 각각에 대한 습관화 레벨을 관 리할 수 있다. 예를 들어, 화면과 같은 예시에서, 사용자 장치 및/또는 서버는, 아웃도어 액 티비티들 중 하나인 오프라인 운동에 대하여서는 레벨 3의 습관화 레벨을 설정하고, 장소 방문하기 대하 여서는 레벨 0의 습관화 레벨을 설정할 수 있다. 예를 들어, 사용자 장치 및/또는 서버는, 인 어플리케이션 액티비티들에 대한 레벨(예를 들어, 습관화 레벨) 및 아웃도어 액티비티들에 대한 레벨(예를 들어, 습관화 레벨)에 기반하여, 사용자 에 대한 종합 건강 레벨을 관리할 수 있다. 예를 들어, 본 실시예에서는, 사용자 장치 및/또는 서 버가, 인 어플리케이션 액티비티들에 대한 레벨(예를 들어, 습관화 레벨) 및 아웃도어 액티비티들 에 대한 레벨(예를 들어, 습관화 레벨)의 합계에 기반하여, 사용자에 대한 종합 건강 레벨을 결 정할 수 있으나, 이는 단순히 예시적인 것으로 그 결정 방식(예를 들어, 계산 방식)에는 제한이 없음을 당업자 는 이해할 것이다. 도 21a 및 21b는 다양한 실시예에 따라 사용자에게 제공되는 가상 공간 화면의 예시이다. 일 실시예에 따른 사용자 장치는, 도 21a와 같은 가상 공간을 표현하는 화면을 제공할 수 있다. 한편, 오브젝트들(10814, 10815, 10816, 10817, 10818, 10819)은 오브젝트들(10514, 10515, 10516, 10517, 10518, 10519)과 동일할 수 있으며, 여기에서의 설명은 반복되지 않는다. 사용자 장치는, 아바타들 (10811, 10812, 10813)을 포함하는 제 1 가상 공간(예를 들어, 사무실 환경)을 제공할 수 있다. 제 1 가상 공간에는, 아바타들 이외에도 오브젝트가 포함될 수도 있으며, 오브젝트는, 인터랙 션이 가능한 오브젝트 및/또는 인터랙션이 불가능한 오브젝트르 포함할 수도 있다. 제 1 가상 공간은, 예를 들어 디폴트 가상 공간일 수 있으며, 예를 들어 어플리케이션 제작자에 의하여 디자인 및/또는 구성이 결 정될 수도 있다. 일 실시예에 따라서, 도 21b에서와 같이, 사용자 장치는, 사용자에 대응하는 제 2 가상 공간(예를 들어, 마이룸 환경)을 제공할 수 있다. 한편, 오브젝트들(10914, 10915, 10916, 10917, 10918, 10919)은 오브 젝트들(10514, 10515, 10516, 10517, 10518, 10519)과 동일할 수 있으며, 여기에서의 설명은 반복되지 않는다. 제 2 가상 공간에 대한 편집 권한이 사용자에게 제공될 수 있으며, 이에 따라 사용자의 조작에 기반하여 제 2 가상 공간에 포함된 오브젝트들(10921, 10922) 중 적어도 일부가 편집될 수 있다. 예를 들어, 어 플리케이션은, 어플리케이션에서 정의된 재화를 이용하여 아이템을 구매할 수 있는 기능, 및/또는 구매된 아이 템을 이용한 마이룸 꾸미기 기능을 제공할 수도 있다. 한편, 어플리케이션은, 사용자 아바타와 상이한 다른 사용자에 대응하는 아바타들(10912, 10913)이, 마이룸인 제 2 가상 공간을 방문하는 기능을 제공할 수 있다. 예를 들어, 어플리케이션은, 친구를 마이룸에 초대할 수 있는 기능을 제공할 수 있다. 상술한 바와 같이, 마이룸의 제 2 가상 공간에 친구를 초대하는 기능의 수행이, 인-어플리케이션 액티비티의 수행일 수도 있다. 도 22는 다양한 실시예에 따라 사용자에게 제공되는 액티비티 번들 수행 관련 화면의 예시이다. 일 실시예에 따른 사용자 장치는, 하기의 도면과 같은 액티비티 번들과 연관된 화면을 제공할 수 있다. 사용자 장치는, 예를 들어 일일 도전(daily challenges)으로서, 아웃도어 액티비티(예를 들어, 5km 걷기) 및 인-어플리케이션 액티비티(예를 들어, 명상 및 다이어리 작성하기)로 구성된 번들을 포함하는 화면을 제공할 수 있다. 번들 내의 각 액티비티들에 대응하는 오브젝트들(11011, 11012, 11013)은, 프로그레스 바 및 현재 진행 상태를 나타내기 위한 인디케이터를 포함할 수 있으나, 그 표현 형식에는 제한이 없다. 한편, 도시 되지는 않았지만, 화면은, 사용자의 현재 상태와 연관된 정보 및/또는 번들 내의 액티비티의 추천 이유 와 연관된 정보를 포함할 수도 있다. 예를 들어, 화면은, 현재 사용자의 상태가 집중도가 낮은 상태이 며, 스트레스도 낮은 상태라는 정보(텍스트, 수치, 및/또는 그래프로 표현될 수 있으며, 그 표현 형식에는 제한 이 없음)를 포함할 수도 있다. 예를 들어, 화면은, 현재 사용자의 상태가 집중도가 낮은 상태이며, 스 트레스도 낮은 상태이기 때문에, 첫 번째 액티비티로서 아웃도어 액티비티(예를 들어, 5km 걷기)를 추천한다는 취지의 정보를 포함할 수도 있다. 상기 화면의 번들 내의 액티비티는, 하나의 예시에서는 순서와 무관 하게 수행될 수 있도록 설정될 수 있거나, 또는 다른 예시에서는 순서에 따라서만 수행될 수 있도록 설정될 수 도 있다. 상술한 사용자의 상태는, 예를 들어 집중도(attention span)을 포함할 수 있다. 집중도는, 예를 들어 EEG에 기 반하여 확인되는 알파파, 베타파, 감마파, 및/또는 쎄타파에 의하여 확인될 수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태는, 예를 들어 인지 로드(cognitive load)를 포함할 수 있다. 인지 로드는, 예를 들어 EEG에 기반하여 확인되는 알파파, 베타파, 감마파, 및/또는 쎄타파에 의하여 확인될 수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태는, 예를 들어 수면 상태(sleep state)를 포함할 수 있다. 수면 상태는, 예를 들 어 EEG에 기반하여 확인되는 알파파, 베타파, 감마파, 및/또는 쎄타파에 의하여 확인될 수 있으나, 확인 방식에 는 제한이 없다. 사용자의 상태는, 예를 들어 개인적인 선호도(individual preference)를 포함할 수 있다. 개 인적인 선호도는, 예를 들어 EEG에 기반하여 확인되는 P300 파에 의하여 확인될 수 있으나, 확인 방식에는 제한 이 없다. 사용자의 상태는, 예를 들어 충동성(impulsivity)(또는, 인지 제어(cognitive control))를 포함할 수 있다. 충동성은, 예를 들어 EEG에 기반하여 확인되는 N100 태스크(N100 task)에 의하여 확인될 수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태는, 예를 들어 감정 상태(예를 들어, 긍정/부정이지만 제한이 없으 며, Ekman 분류 감정으로 표현될 수도 있음)를 포함할 수 있다. 감정 상태는, 예를 들어 EEG에 기반하여 확인 되는 arousal/valence 값에 의하여 확인될 수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태는, 예를 들 어 노화도를 포함할 수 있다. 노화도는, 예를 들어 PPG에 기반하여 확인되는 HR에 의하여 확인될 수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태는, 예를 들어 스트레스 및/또는 안정도(stress and/or relaxatio n)를 포함할 수 있다. 스트레스 및/또는 안정도는, 예를 들어 PPG에 기반하여 확인되는 HRV에 의하여 확인될수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태는, 예를 들어 근심도(anxiety)를 포함할 수 있다. 근 심도는, 예를 들어 PPG에 기반하여 확인되는 호흡률(breathing rate)의하여 확인될 수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태는, 예를 들어 건강 상태(healthy stats)를 포함할 수 있다. 건강 상태는, 예를 들어 PPG에 기반하여 확인되는 호흡률에 의하여 확인될 수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태 는, 예를 들어 기억력(memory)를 포함할 수 있다. 기억력은, 예를 들어 사용자 행위에 기반하여 확인되는 hit rate 및/또는 false alarm rate에 기반하여 확인될 수 있으나, 확인 방식에는 제한이 없다. 사용자의 상태는, 예를 들어 민첩도(agility)를 포함할 수 있다. 민첩도는, 예를 들어 사용자 행위에 기반하여 확인되는 응답 시 간(response time)에 기반한여 확인될 수 있으나, 확인 방식에는 제한이 없다. 한편, 번들 내의 액티비티에 대응하는 오브젝트들은, 액티비티의 종류 별로 차별화되도록 제공될 수도 있다. 예를 들어, 인-어플리케이션 액티비티의 속성(예를 들어, 컬러이지만 제한이 없음), 및 아웃도어 액티비티의 속 성(예를 들어, 컬러이지만 제한이 없음)이 상이하게 설정될 수도 있다. 도 23은 다양한 실시예에 따라 사용자에게 제공되는 액티비티 선택 관련 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 도 23과 같은 번들을 포함하는 화면을 제공할 수도 있다. 일 실시예에 따른 화면은, 복수 개의 번들들(Bundle #1, Bundle #2)을 각각 표현하기 위한 오브젝트들 (11111,11112)을 포함할 수 있다. 예를 들어, 복수 개의 번들들(Bundle #1, Bundle #2)은, 사용자의 상태에 기반하여 설정될 수 있다. 복수 개의 번들들(Bundle #1, Bundle #2) 각각을 구성하는 액티비티들의 종류 및/또 는 순서는, 예를 들어 사용자의 상태에 기반하여 설정될 수 있다. 또는, 예를 들어, 복수 개의 번들들(Bundle #1, Bundle #2)은, 디폴트된 것일 수도 있다. 예를 들어, 번들(Bundle #1)은 스트레스 완화용 번들일 수 있으 며, 번들(Bundle #2)은 집중력 향상용 번들일 수 있으나, 이는 예시적인 것으로 제한은 없다. 도 24는 다양한 실시예에 따라 사용자에게 제공되는 액티비티 번들 관련 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 도 24와 같은 번들을 추천하기 위한 화면을 제공할 수도 있다. 일 실시예에 따라서, 사용자 장치가 제공하는 화면에는, 예를 들어 NPC 아바타 및 사용자 아바타가 포함될 수 있다. 사용자 장치 및/또는 서버는, 사용자 상태를 확인할 수 있으며, 사용자의 스트레스 정도가 상대적으로 높음을 확인할 수 있다. 사용자 장치 및/또는 서버는, 스트레 스 정도가 상대적으로 높음을 나타내는 사용자 상태에 기반하여, 명상 및 장소 방문으로 구성되는 번들을 확인 할 수 있다. 사용자 장치 및/또는 서버는, NPC 아바타가, 사용자의 상태 및/또는 번들을 표 현하기 위한 정보를 제공하도록 표현된 화면을 구성할 수 있다. 한편, NPC 아바타에 의 한 추천은 단순히 예시적인 것일 수도 있다. 사용자 장치는, 정보의 제공없이, NPC 아바타(1122 1)가 곧바로 번들에 포함되는 명상을 사용자와 함께 진행하는 컨텐트를 제공할 수도 있다. 예를 들어, 사용자 장치 및/또는 서버는, 스트레스 정도가 상대적으로 높은 사용자 아바타에게, NPC 아바타를 근접시켜, 사용자 상태에 대응하는 동작(예를 들어, 고 스트레스 정도인 경우에는 명상)을 문의하거나, 또는 곧바로 수행 하도록 하는 컨텐트를 제공할 수도 있다. 도 25는 다양한 실시예에 따라 사용자에게 제공되는 액티비티 관련 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 도 25와 같은 화면을 제공할 수 있다. 일 실시예에 따라서 사용자 장치가 제공하는 화면은, 해당 화면이 개인화된 추천을 나타내 는 텍스트를 포함할 수 있다. 화면에는, 금일 정보를 호출하기 위한 버튼 및/또는 지난 7일간의 정보를 호출하기 위한 버튼이 포함될 수 있다. 양 버튼들(11312,11313) 중 어느 하나가 선택됨 에 기반하여, 해당 기간 동안의 액티비티 수행 이력 및/또는 추천 정보를 포함하는 화면이 제공될 수도 있다. 예를 들어, 액티비티 수행 이력은, 하루 평균 액티비티를 100분(100min) 수행하였다는 정보를 포함할 수 있다. 예를 들어, 액티비티 수행 이력은, 수행된 액티비티들 각각의 백분율을 나타내기 위한 그래프를 포함할 수 있다. 해당 그래프에는, 수행된 액티비티들(예를 들어, 사회적인 활동(social), 낚시 활동 (fishing), 저작(journaling), 런닝 및 운동(running & fitness), 호흡 및 명상 활동(breathing & meditation))의 각 백분율(수행 시간에 기반하여 설정될 수 있으나 제한이 없음)을 나타내기 위한 면적을 가지 도록 표현될 수 있다. 화면은, 사용자의 성향(personality)에 기반한 추천 기능을 포함할 수 있 다. 사용자의 성향은, 예를 들어 Big 5 성향인 개방성(openness), 성실성(conscientiousness) , 외향성(extraversion), 우호성(agreeableness), 감정적 안정성(emotional stability)(또는, 신경성(neuroticism)으로도 명명 가능함)로 분류되어 표현될 수 있으며, 각 성향별 스코어 (11317,11410,11413,11416,11419)가 함께 표현될 수도 있다. 일 실시예에 따른 사용자 장치 및/또는 서버는, 사용자의 성향에 기반하여, 다양한 추천 UI를 제공할 수 있다. 하나의 예에서, 사용자 장치 및/또는 서버는, 사용자의 성향에 기반하여, 클럽을 추천하기 위한 아이 콘을 제공할 수 있다. 예를 들어, 개방성에 대응하는 스코어에 기반하여, 달리기 클럽(runners club)의 가입 및/또는 방문을 위한 아이콘이 함께 제공될 수 있다. 예를 들어, 서버는, 사용자들 이 가입 가능한 클럽을 생성하는 기능을 제공할 수 있다. 서버는, 각 클럽 별로 적어도 하나의 성향을 매 칭하여 관리할 수도 있다. 예를 들어, 서버는, “달리기 클럽”에 대하여서는, “개방성”의 성향을 매칭 시켜 관리할 수 있다. 서버는, 특정 사용자의 성향에 대응되는 클럽을 추천하기 위한 아이콘을 제 공할 수 있다. 예를 들어, 특정 사용자의 개방성에 대응하는 스코어가 임계 스코어를 초과한 경우에, 서버 는, 해당 사용자 성향에 따른 추천 항목으로서, 해당 성향에 대응하는 클럽을 추천하기 위한 아이콘 을 제공할 수 있다. 아이콘이 지정되면, 해당 클럽을 위한 페이지가 제공될 수도 있다. 하나의 예에서, 사용자 장치 및/또는 서버는, 사용자의 성향에 기반하여, 액티비티를 추천하기 위한 아이콘을 제공할 수 있다. 예를 들어, 성실성에 대응하는 스코어에 기반하여, 저작 활동 (journaling) 및 일기 쓰기(life logging)의 액티비티를 추천 및/또는 실행할 수 있는 아이콘이 제공될 수 있다. 서버는, 액티비티 별로 적어도 하나의 성향을 매칭하여 관리할 수도 있다. 예를 들어, 서버는, “저작 활동” 및 “일기 쓰기”에 대하여서는, “성실성”의 성향을 매칭시켜 관리할 수 있다. 서버는, 특정 사용자의 성향에 대응되는 액티비티를 추천하기 위한 아이콘을 제공할 수 있다. 예 를 들어, 특정 사용자의 성실성에 대응하는 스코어가 임계 스코어를 초과한 경우에, 서버는, 해당 사용자 성향에 따른 추천 항목으로서, 해당 성향에 대응하는 액티비티를 추천하기 위한 아이콘을 제공할 수 있 다. 아이콘이 지정되면, 해당 액티비티를 수행하기 위한 화면이 제공될 수 있다. 예를 들어, 서버 는, “낚시(fishing)”및 “수집(collection)”에 대하여서는, “감정적 안정성”의 성향을 매칭시켜 관리 할 수 있다. 서버는, 특정 사용자의 성향에 대응되는 액티비티를 추천하기 위한 아이콘을 제공할 수 있다. 예를 들어, 특정 사용자의 감정적 안정성에 대응하는 스코어가 임계 스코어를 초과한 경우에, 서버는, 해당 사용자 성향에 따른 추천 항목으로서, 해당 성향에 대응하는 액티비티를 추천하기 위한 아이 콘을 제공할 수 있다. 아이콘이 지정되면, 해당 액티비티를 수행하기 위한 화면이 제공될 수 있 다. 하나의 예에서, 사용자 장치 및/또는 서버는, 사용자의 성향에 기반하여, 기능의 활성화/비활성화를 위한 아이콘을 제공할 수 있다. 예를 들어, 외향성에 대응하는 스코어에 기반하여, 만남 기능 (meetup)을 비활성화하기 위한 아이콘이 제공될 수 있다. 서버는, 가상 공간에서 이용되는 기능 별로 적어도 하나의 성향을 매칭하여 관리할 수도 있다. 예를 들어, 서버는, “만남 기능”에 대하여서는, “외향성”의 성향을 매칭시켜 관리할 수 있다. 서버는, 특정 사용자의 성향에 대응되는 기 능의 활성화/비활성화를 위한 아이콘을 제공할 수 있다. 예를 들어, 특정 사용자의 외향성에 대응하는 스코어가 임계 스코어 이하인 경우에, 서버는, 해당 사용자 성향에 따른 추천 항목으로서, 해당 성향에 대 응하는 기능을 비활성화하기 위한 아이콘을 제공할 수 있다. 아이콘이 지정되면, 해당 기능이 비활성화될 수 있다. 예를 들어, 서버는, “공유(sharing) 기능”에 대하여서는, “우호성”의 성향을 매 칭시켜 관리할 수 있다. 서버는, 특정 사용자의 성향에 대응되는 기능의 활성화/비활성화를 위한 아이콘 을 제공할 수 있다. 예를 들어, 특정 사용자의 우호성에 대응하는 스코어가 임계 스코어 이하인 경우에, 서버는, 해당 사용자 성향에 따른 추천 항목으로서, 해당 성향에 대응하는 기능을 비활성화하기 위한 아이콘을 제공할 수 있다. 아이콘이 지정되면, 해당 기능이 비활성화될 수 있다. 한편, 이는 예시적인 것으로, 서버는, 해당 사용자에 대하여서는 해당 기능이 최초부터 비활성화한 상태인 가상 공간을 위한 컨텐트를 제공할 수도 있다. 한편, 상술한 바와 같이, 사용자의 성향과 부합하는 액티비티 및/또는 기능을 추천하는 실시예는 단순히 예시적 인 것이다. 일 실시예에 따른 사용자 장치 및/또는 서버는, 역으로 사용자의 성향과 부합하지 않는 액티비티 및/또는 기능을 추천하도록 설정될 수도 있다. 예를 들어, 외향성의 스코어가 상대적 으로 낮은 것에 기반하여, 사용자 장치 및/또는 서버는, 사용자의 외향성 증진을 위하여, 외향성에 대응하는 액티비티 및/또는 기능 활성화를 추천하도록 설정될 수도 있다. 사용자 장치 및/또는 서버(10 1)는, 예를 들어 사용자의 설정에 기반하여, 추천하는 정보의 종류를 결정할 수도 있다. 예를 들어, 사용자의설정이, 자신의 성향과 부합하는 액티비티 및/또는 기능을 추천하는 것인 경우에는, 사용자 장치 및/또는 서버는 사용자의 성향에 부합하는 UI(예를 들어, 화면)를 제공할 수 있다. 예를 들어, 사용자의 설정이 자신의 성향 중 부족한 성향을 증진시키는 것이면, 사용자 장치 및/또는 서버는, 역으로 사용 자의 성향에 부합하지 않는 UI를 제공할 수 있다. 한편, 사용자의 성향은, 설문에 대한 사용자에 의한 응답에 기반하여 확인될 수 있다. 사용자의 성향은, 해당 사용자의 가상 공간 내에서의 활동, 액티비티 수행 결과, 및/또는 생체 신호의 분석 결과에 기반하여 확인될 수 도 있다. 예를 들어, 서버는, 가상 공간 내에서의 특정 활동의 수행 횟수, 특정 액티비티의 수행 횟수에 기반하여, 사용자 성향을 확인할 수도 있다. 특정 활동 및/또는 특정 액티비티의 수행 횟수가 상대적으로 많은 경우, 해당 활동 및/또는 액티비티에 대응하는 성향의 스코어가 상대적으로 높게 설정될 수 있다. 특정 활동 및/또는 특정 액티비티의 수행 횟수가 상대적으로 적은 경우, 해당 활동 및/또는 액티비티에 대응하는 성향의 스코어가 상대적으로 적게 설정될 수 있다. 일 실시예에 따라서, 서버는, 생체 신호를 이용하여 사용자의 성향을 확인할 수 있다. 예를 들어, 상술한 바와 같이, 특정 사용자에 대한 생체 신호(예를 들어, HRV이지만 제한이 없음)에 기반하여 특정 사용자의 스트 레스 정도가 확인될 수 있다. 예를 들어, 서버는, 사용자의 스트레스 정도에 기반하여, 성향(예를 들어, 감정적 안정성)을 확인할 수 있다. 또는, 서버는, 가상 공간 내에서의 특정 활동 및 생체 신호의 분석 결 과를 함께 이용하여 사용자의 성향을 확인할 수도 있다. 하기의 예시들은, Big 5의 성향 중 적어도 일부에 대 한 가상 공간 내에서의 특정 활동 및 생체 신호의 분석 결과에 기반한, 해당 성향에 대한 스코어를 확인하기 위 한 방법을 설명한다. 표 6 표 7"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "표 8"}
{"patent_id": "10-2022-0142526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "한편, 상술한 관계들은, 단순히 예시적인 것이며, 가상 공간 내의 활동, 이용되는 생체 신호의 종류, 성향에는 제한이 없다. 서버 및/또는 사용자 장치는, 상술한 바와 같은 관계를 제공하기 위한 알고리즘을 저 장할 수 있으며, 해당 알고리즘에 가상 공간 내의 활동 및 생체 신호 및/또는 분석 결과를 입력하여, 예를 들어 Big 5 성향을 확인할 수 있다. 상술한 표에서의 성향에 대한 스코어는, 상대적으로 낮은 수치 또는 상대적으로 높은 수치의 절대값으로 구현될 수 있거나, 또는 기존 스코어를 조정하기 위한 조정 정도로 구현될 수도 있으며, 그 표현 형식에는 제한이 없다. 상기의 사용자 별 성향을 판단하는데, 스트레스, 부정도, 비선호도, 근심도와 같은, 직접적으로 선호도를 판단하는데 명확한 인자들이 이용될 수 있어, 높은 신뢰도를 가지는 사용자 별 성향이 확인될 수 있다. 상술한 바에 따라서, 사용자들이 성향별로 어떠한 액티비티를 수행하였는지에 대한 정보가 확인될 수 있으며, 성향 및 수행된 액티비티 사이의 상관 관계가 확인될 수 있다. 상관 관계는, 추후 가상 공간에서 수행될 수 있 는 액티비티들의 업데이트, 추가, 및/또는 삭제 여부를 결정하는데 이용될 수도 있다. 또는, 사용자 성향 별로, 맞춤형 광고 컨텐트가 제공될 수도 있다. 도 26은 다양한 실시예에 따라 사용자에게 제공되는 사용자 성향과 관련된 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 도 26과 같은 화면을 제공할 수 있다. 일 실시예에 따른 사용자 장치가 제공하는 화면에는, 사용자에 대응하는 아바타의 형상이 포함될 수 있다. 화면에는, 전체 액티비티의 수행 량 중 사용자가 수행하였던 인-어플리케이션 액티비 티의 수행 량이 차지하는 비율을 나타내는 오브젝트와, 전체 액티비티의 수행 량 중 사용자가 수행하였 던 아웃도어 액티비티의 수행 량이 차지하는 비율을 나타내는 오브젝트이 포함될 수 있다. 양 오브젝트 들(11512,11513)은, 시각적으로 상이하게 표현될 수도 있다. 이에 따라, 사용자는 화면을 봄으로써, 자 신이 인-어플리케이션 액티비티 및 아웃도어 액티비티를 어떠한 비율로 수행하였는지를 확인할 수 있다. 화면 에는, 전체 사용자들 중 정신 건강의 지표의 순위(예를 들어, 퍼센테이지의 형식으로 구현되지만, 그 형식에는 제한이 없음)가 포함될 수도 있다. 이에 따라, 사용자는, 화면을 봄으로써, 자신의 정신 건강의 상태를 확인할 수도 있다. 도 27은 다양한 실시예에 따라 사용자 장치에서 제공되는 생체 지수와 관련된 화면의 예시이다. 일 실시예에 따라서, 사용자 장치는, 아래의 도면과 같은 화면을 제공할 수 있다. 일 실시예에 따라서, 사용자 장치는, 사용자의 정신 건강 상태와 연관된 정보(예를 들어 Biometric index로 명명될 수 있음)를 포함하는 화면을 제공할 수 있다. 기간 지정 오브젝트는, 표 시되는 raw data의 기간을 조정할 수 있다. 본 실시예에서는, 기간 지정 오브젝트 중 “month”에 대응 하는 서브 오브젝트가 지정됨에 기반하여, 사용자 장치가, 1개월 간의 raw data를 표시할 수 있다. 만약, 다른 기간을 위한 서브 오브젝트가 지정되는 경우, 사용자 장치는 해당 기간에 대응하는 raw data를 제공할 수도 있음을 당업자는 이해할 것이다. 사용자 장치는, raw data를 지정할 수 있는 오브젝트 를 표시할 수 있다. 본 실시예에서는, 종류 지정 오브젝트 중 “Heart Rate Variability”의 서브 오브젝트가 지정됨에 기반하여, 사용자 장치가, 1개월 간의 HRV의 raw data를 표시할 수 있다. 일 실시예에 따라서, 사용자 장치는, raw data를 처리한 결과에 기반하여 적어도 하나의 정신 건강을 나타 낼 수 있는 지표(예를 들어, attention, stress)의 종류를 식별하기 위한 텍스트를 제공할 수도 있다. 사용자 장치는, attention을 식별하기 위한 cognitive load의 시간에 따른 그래프를 제공할 수 있 다. 사용자 장치는, stress를 식별하기 위한 stress의 시간에 따른 그래프를 제공할 수 있다. 사 용자 장치는, 추가적으로, 사용자와 유사한 속성(예를 들어, 연령, 성별 등이지만 제한이 없음)을 가지는 그룹(similar group)에 대한 그래프들(11618,11619)을 제공할 수도 있다. 이에 따라, 사용자는, 자신의 현재 상태를, 그룹과 비교하여 인식할 수도 있다. 한편, 상술한 예시에서는, cognitive load, stress가 표현되는 것 이 도시되었지만, 이는 예시적인 것으로, 사용자 상태는, 상술한 바와 같이 attention span, cognitive load, sleep stage, Individual Preference (Reaction Time), Impulsivity (Cognitive Control), Positive / Negative Mood, Aging, Stress, Relaxation, Anxiety, Healthy stats, Memory, 및/또는 Agility를 포함할 수 있으며, 그 종류에는 제한이 없음을 당업자는 이해할 것이다."}
{"patent_id": "10-2022-0142526", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 액티비티 제공 시스템의 개략도를 도시한다. 도 2는 일 실시예에 따른 액티비티 제공 시스템의 블록도를 도시한다. 도 3a는 일 실시예에 따른 서버의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 3b는 일 실시예에 따른 인 어플리케이션 액티비티 및 아웃도어 액티비티에 대한 보상 세트의 예시를 도시한 다. 도 3c는 일 실시예에 따른 인 어플리케이션 액티비티 및 아웃도어 액티비티에 대한 보상 세트의 예시를 도시한 다. 도 3d는 일 실시예에 따른 인 어플리케이션 액티비티 및 아웃도어 액티비티에 대한 보상 세트의 예시를 도시한 다. 도 4a는 일 실시예에 따른 인 어플리케이션 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 4b는 일 실시예에 따른 아웃도어 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도 이다. 도 5a는 다른 실시예에 따른 인 어플리케이션 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위 한 흐름도이다. 도 5b는 다른 실시예에 따른 아웃도어 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름 도이다. 도 6a는 또 다른 실시예에 따른 인 어플리케이션 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 6b는 또 다른 실시예에 따른 아웃도어 액티비티를 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 7a는 일 실시예에 따른 건강 상태 지표를 나타내기 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 7b는 일 실시예에 따른 건강 상태 지표를 나타내기 위한 서버 및 사용자 장치의 동작 방법을 설명하기 위한 흐름도이다. 도 8a는 일 실시예에 따른 건강 상태를 모니터링 하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한 다. 도 8b는 일 실시예에 따른 건강 상태를 모니터링 하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한 다. 도 9a는 일 실시예에 따른 액티비티 번들을 제공하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한 다. 도 9b는 일 실시예에 따른 액티비티의 번들을 설명하기 위한 도면이다. 도 10a는 일 실시예에 따른 가중치를 반영하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 10b는 일 실시예에 따른 가중치에 기반한 보상 설정 방식을 설명하기 위한 도면을 도시한다. 도 11은 일 실시예에 따른 액티비티의 제한 조건을 고려한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한 다. 도 12는 일 실시예에 따른 사용자 성향을 고려한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 13은 일 실시예에 따른 사용자 성향을 고려한 가상 공간을 제공하기 위한 서버의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 14는 일 실시예에 따른 사용자 성향을 고려한 어플 패키지를 제공하기 위한 서버의 동작 방법을 설명하기 위 한 흐름도를 도시한다. 도 15a 내지 15c는 다양한 실시예에 따라 사용자에게 제공되는 인 어플리케이션 액티비티 수행 화면의예시이다. 도 16a 및 16b는 다양한 실시예에 따라 사용자에게 제공되는 인 어플리케이션 액티비티 화면의 예시이다. 도 17a 및 17b는 다양한 실시예에 따라 사용자에게 제공되는 액티비티 선택 및 수행 화면의 예시이다. 도 18a 내지 18c는 다양한 실시예에 따라 사용자에게 제공되는 아웃도어 액티비티 수행 화면의 예시이다. 도 19a 및 19b는 다양한 실시예에 따라 사용자에게 제공되는 사용자 성향 별 화면의 예시이다. 도 20은 다양한 실시예에 따라 사용자에게 제공되는 액티비티 성취 관련 화면의 예시이다. 도 21a 및 21b는 다양한 실시예에 따라 사용자에게 제공되는 가상 공간 화면의 예시이다. 도 22는 다양한 실시예에 따라 사용자에게 제공되는 액티비티 번들 수행 관련 화면의 예시이다. 도 23은 다양한 실시예에 따라 사용자에게 제공되는 액티비티 선택 관련 화면의 예시이다. 도 24는 다양한 실시예에 따라 사용자에게 제공되는 액티비티 번들 관련 화면의 예시이다. 도 25는 다양한 실시예에 따라 사용자에게 제공되는 액티비티 관련 화면의 예시이다. 도 26은 다양한 실시예에 따라 사용자에게 제공되는 사용자 성향과 관련된 화면의 예시이다. 도 27은 다양한 실시예에 따라 사용자에게 제공되는 생체 지수와 관련된 화면의 예시이다."}
