{"patent_id": "10-2023-0027266", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0133392", "출원번호": "10-2023-0027266", "발명의 명칭": "도메인에 독립적인 카테고리 임베딩 학습 장치 및 방법", "출원인": "울산과학기술원", "발명자": "윤성환"}}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "상기 훈련데이터를 입력받아 카테고리(category) 특성을 추출하는 카테고리 특성추출부;상기 훈련데이터를 입력받아 도메인(domain) 특성을 추출하는 도메인 특성추출부;상기 카테고리 특성추출부의 결과를 토대로 상기 훈련데이터의 카테고리를 분류하는 카테고리 분류기;상기 도메인 특성추출부의 결과를 토대로 상기 훈련데이터의 도메인을 분류하는 도메인 분류기;상기 카테고리 특성추출부와 상기 도메인 특성추출부의 결과의 직교성 정도에 대한 손실함수(cosine similarityloss)를 계산하여 출력하는 직교성 손실계산부; 및 상기 카테고리 특성추출부와 상기 도메인 특성추출부의 결과의 식별력 정도에 대한 손실함수(discriminationloss)를 계산하여 출력하는 식별력 손실계산부;를 포함하는 도메인에 독립적인 카테고리 임베딩 학습 장치."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 훈련데이터는 다수의 카테고리와 다수의 도메인을 포함하도록 다음 식으로 정의되는 것을 특징으로 하는도메인에 독립적인 카테고리 임베딩 학습 장치. 여기서, : 번째 훈련 도메인(domain)."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 카테고리 분류기는 카테고리를 분류하는 상기 카테고리 손실함수를 다음 식과 같이 출력하는 것을 특징으로 하는 도메인에 독립적인 카테고리 임베딩 학습 장치. ,여기서, : cross entropy, : category elementary embedding, : input, : category model parameter, : category classifier,공개특허 10-2024-0133392-3- : category target label."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 도메인 분류기는 도메인을 분류하는 상기 도메인 손실함수를 다음 식과 같이 출력하는 것을 특징으로 하는도메인에 독립적인 카테고리 임베딩 학습 장치. ,여기서, : cross entropy, : domain elementary embedding, : input, : domain model parameter, : domain classifier, : domain target label."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 직교성 손실계산부는 다음과 같은 식으로 상기 직교성 손실함수를 출력하는 것을 특징으로 하는 도메인에독립적인 카테고리 임베딩 학습 장치. ,여기서, : 두 벡터의 직교성(cosine similarity) 함수."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 식별력 손실계산부는 상기 식별력 정도에 대한 손실함수로 상기 카테고리 식별력 손실함수와 상기 도메인식별력 손실함수를 구분하여 출력하는 것을 특징으로 하는 도메인에 독립적인 카테고리 임베딩 학습 장치."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 카테고리 식별력 손실함수는 다음과 같은 식으로 정의되는 것을 특징으로 하는 도메인에 독립적인 카테고리 임베딩 학습 장치. ,공개특허 10-2024-0133392-4-여기서, : discriminator."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,상기 도메인 식별력 손실함수는 다음과 같은 식으로 정의되는 것을 특징으로 하는 도메인에 독립적인 카테고리임베딩 학습 장치. 여기서, : discriminator."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "카테고리 특성추출부에서 상기 훈련데이터를 입력받아 카테고리(category) 특성을 추출하는 카테고리 특성추출단계;도메인 특성추출부에서 상기 훈련데이터를 입력받아 도메인(domain) 특성을 추출하는 도메인 특성추출단계;카테고리 분류기에서 상기 카테고리 특성추출부의 결과를 토대로 상기 훈련데이터의 카테고리를 분류하는 카테고리 분류단계;도메인 분류기에서 상기 도메인 특성추출부의 결과를 토대로 상기 훈련데이터의 도메인을 분류하는 도메인 분류단계;직교성 손실계산부에서 상기 카테고리 특성추출부와 상기 도메인 특성추출부의 결과의 직교성 정도에 대한 손실함수(cosine similarity loss)를 계산하여 출력하는 직교성 손실계산단계; 및 식별력 손실계산부에서 상기 카테고리 특성추출부와 상기 도메인 특성추출부의 결과의 식별력 정도에 대한 손실함수(discrimination loss)를 계산하여 출력하는 식별력 손실계산단계;를 포함하는 도메인에 독립적인 카테고리임베딩 학습 방법."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 훈련데이터는 다수의 카테고리와 다수의 도메인을 포함하도록 다음 식으로 정의되는 것을 특징으로 하는도메인에 독립적인 카테고리 임베딩 학습 방법. 여기서, : 번째 훈련 도메인(domain)."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10항에 있어서,상기 카테고리 분류단계에서 상기 카테고리 분류기는 카테고리를 분류하는 상기 카테고리 손실함수를 다음 식과같이 출력하는 것을 특징으로 하는 도메인에 독립적인 카테고리 임베딩 학습 방법.공개특허 10-2024-0133392-5- ,여기서, : cross entropy, : category elementary embedding, : input, : category model parameter, : category classifier, : category target label."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 도메인 분류단계에서 상기 도메인 분류기는 도메인을 분류하는 상기 도메인 손실함수를 다음 식과 같이 출력하는 것을 특징으로 하는 도메인에 독립적인 카테고리 임베딩 학습 방법. ,여기서, : cross entropy, : domain elementary embedding, : input, : domain model parameter, : domain classifier, : domain target label."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서,상기 직교성 손실계산단계에서 상기 직교성 손실계산부는 다음과 같은 식으로 상기 직교성 손실함수를 출력하는것을 특징으로 하는 도메인에 독립적인 카테고리 임베딩 학습 방법. ,여기서,공개특허 10-2024-0133392-6- : 두 벡터의 직교성(cosine similarity) 함수."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 식별력 손실계산단계에서 상기 식별력 손실계산부는 상기 식별력 정도에 대한 손실함수로 상기 카테고리식별력 손실함수와 상기 도메인 식별력 손실함수를 구분하여 출력하는 것을 특징으로 하는 도메인에 독립적인카테고리 임베딩 학습 방법."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서,상기 카테고리 식별력 손실함수는 다음과 같은 식으로 정의되는 것을 특징으로 하는 도메인에 독립적인 카테고리 임베딩 학습 방법. ,여기서, : discriminator."}
{"patent_id": "10-2023-0027266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14항에 있어서,상기 도메인 식별력 손실함수는 다음과 같은 식으로 정의되는 것을 특징으로 하는 도메인에 독립적인 카테고리임베딩 학습 방법. 여기서, : discriminator"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 도메인에 영향을 받지 않고 카테고리 분류를 하도록 인공지능 학습을 수행하고, 카테고리와 도메인을 동시에 학습하여 학습하지 않은 도메인에 대해도 분류 성능을 향상시킬 수 있는 도메인에 독립적인 카테고리 임 베딩 학습 장치 및 방법에 관한 것이다. (뒷면에 계속)"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 도메인에 독립적인 카테고리 임베딩 학습 장치 및 방법에 관한 것으로, 상세하게는, 도메인에 영향을 받지 않고 카테고리 분류를 하도록 인공지능 학습을 수행하는 것이다. 또한, 본 발명은 학습하지 않은 도메인에 대해도 분류 성능을 향상 할 수 있는 도메인에 독립적인 카테고리 임베딩 학습 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "머신 러닝 및 인공 지능 모델은 영상 클래스 분류에 효과적으로 활용되고 있다. 그러나 새로운 데이터 배포에 대한 일반화 기능을 얻기 위해 심층 모델을 향상시키는 것은 여전히 어려운 과제로 남아 있다. 특히 컴퓨터 비전의 경우, 도메인 이동으로 알려진 학습과 테스트 세트 사이의 이미지 도메인의 분포 이동은 심 층 시각적 모델의 성능을 크게 저하시킨다. 여기서, 도메인 일반화(Domain Generalization; DG)는 도메인 이동을 극복하기 위한 알고리즘 방법 개발에 관한 것으로, 예를 들어 이미지 분류 모델이 사진, 스케치, 만화 등과 같은 소스 도메인의 데이터에 대해 훈련된 다 음, 훈련 단계에 표시되지 않은 대상 도메인에서 모델을 테스트하는 것 등을 말하며, 이러한 상이한 도메인을 학습하는 연구가 지속되어 왔다. 그 일례로, 대한민국 공개특허공보 제10-2020-0183859호에서는 복수의 도메인들의 데이터 셋들을 정규화하고, 정규화된 데이터 셋들 사이에서 공유되는 공유 정보를 추출하고, 추출된 공유 정보를 기반으로 학습을 수행하여 학습 모델을 구현하고, 목표 도메인에 대해 학습 모델을 이식하도록 하는 과적합 없는 단일 신경망 기반 다중 도메인 적응 학습을 위한 컴퓨터 시스템 및 그 방법을 제안하였다. 그러나 이 경우에도 학습하지 않은 도메인을 테스트할 경우에는 분류 성능이 저하되는 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2020-0183859호(2020.12.24)"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 도메인에 영향을 받지 않고 카테고리 분류를 하도록 인공지능 학습을 수행하는 도메인에 독 립적인 카테고리 임베딩 학습 장치 및 방법을 제공하는 것이다. 본 발명은 카테고리와 도메인을 동시에 학습하여 학습하지 않은 도메인에 대해서도 분류 성능을 향상시킬 수 있 는 도메인에 독립적인 카테고리 임베딩 학습 장치 및 방법을 제공하는데 또 다른 목적이 있다."}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 도메인에 독립적인 카테고리 임베딩 학습 장치는 훈련데이터를 입력받아 카테고리(category) 특 성을 추출하는 카테고리 특성추출부, 훈련데이터를 입력받아 도메인(domain) 특성을 추출하는 도메인 특성추출 부, 카테고리 특성추출부의 결과를 토대로 훈련데이터의 카테고리를 분류하는 카테고리 분류기, 도메인 특성추 출부의 결과를 토대로 훈련데이터의 도메인을 분류하는 도메인 분류기, 카테고리 특성추출부와 도메인 특성추출 부의 결과의 직교성 정도에 대한 손실함수(cosine similarity loss)를 계산하여 출력하는 직교성 손실계산부, 및 카테고리 특성추출부와 도메인 특성추출부의 결과의 식별력 정도에 대한 손실함수(discrimination loss)를 계산하여 출력하는 식별력 손실계산부를 포함할 수 있다. 여기서, 훈련데이터는 다수의 카테고리와 다수의 도메인을 포함하도록 다음 식으로 정의될 수 있다."}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "여기서, : 번째 훈련 도메인(domain). 또한, 카테고리 분류기는 카테고리를 분류하는 카테고리 손실함수를 다음 식과 같이 출력할 수 있다. , 여기서, : cross entropy, : category elementary embedding, : input, : category model parameter, : category classifier, : category target label. 여기서, 도메인 분류기는 도메인을 분류하는 도메인 손실함수를 다음 식과 같이 출력할 수 있다. , 여기서, : cross entropy, : domain elementary embedding, : input, : domain model parameter, : domain classifier, : domain target label. 또한, 직교성 손실계산부는 다음과 같은 식으로 직교성 손실함수를 출력할 수 있다. , 여기서, : 두 벡터의 직교성(cosine similarity) 함수. 여기서, 식별력 손실계산부는 식별력 정도에 대한 손실함수로 카테고리 식별력 손실함수와 도메인 식별력 손실 함수를 구분하여 출력할 수 있다. 또한, 카테고리 식별력 손실함수는 다음과 같은 식으로 정의될 수 있다. , 여기서, : discriminator. 한편, 도메인 식별력 손실함수는 다음과 같은 식으로 정의될 수 있다. 여기서, : discriminator. 본 발명의 다른 실시예에 따른 도메인에 독립적인 카테고리 임베딩 학습 방법은 카테고리 특성추출부에서 훈련 데이터를 입력받아 카테고리(category) 특성을 추출하는 카테고리 특성추출단계, 도메인 특성추출부에서 훈련데 이터를 입력받아 도메인(domain) 특성을 추출하는 도메인 특성추출단계, 카테고리 분류기에서 카테고리 특성추 출부의 결과를 토대로 훈련데이터의 카테고리를 분류하는 카테고리 분류단계, 도메인 분류기에서 도메인 특성추 출부의 결과를 토대로 훈련데이터의 도메인을 분류하는 도메인 분류단계, 직교성 손실계산부에서 카테고리 특성 추출부와 도메인 특성추출부의 결과의 직교성 정도에 대한 손실함수(cosine similarity loss)를 계산하여 출력 하는 직교성 손실계산단계, 및 식별력 손실계산부에서 카테고리 특성추출부와 도메인 특성추출부의 결과의 식별 력 정도에 대한 손실함수(discrimination loss)를 계산하여 출력하는 식별력 손실계산단계를 포함할 수 있다. 여기서, 훈련데이터는 다수의 카테고리와 다수의 도메인을 포함하도록 다음 식으로 정의될 수 있다."}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "여기서, : 번째 훈련 도메인(domain). 또한, 카테고리 분류단계에서 카테고리 분류기는 카테고리를 분류하는 카테고리 손실함수를 다음 식과 같이 출 력할 수 있다. , 여기서, : cross entropy, : category elementary embedding, : input, : category model parameter, : category classifier, : category target label. 여기서, 도메인 분류단계에서 도메인 분류기는 도메인을 분류하는 도메인 손실함수를 다음 식과 같이 출력할 수 있다. , 여기서, : cross entropy, : domain elementary embedding, : input, : domain model parameter, : domain classifier, : domain target label. 또한, 직교성 손실계산단계에서 직교성 손실계산부는 다음과 같은 식으로 직교성 손실함수를 출력할 수 있다. , 여기서, : 두 벡터의 직교성(cosine similarity) 함수. 여기서, 식별력 손실계산단계에서 식별력 손실계산부는 식별력 정도에 대한 손실함수로 카테고리 식별력 손실함 수와 도메인 식별력 손실함수를 구분하여 출력할 수 있다. 또한, 카테고리 식별력 손실함수는 다음과 같은 식으로 정의될 수 있다. , 여기서, : discriminator. 여기서, 도메인 식별력 손실함수는 다음과 같은 식으로 정의될 수 있다."}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "여기서, : discriminator."}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의한 도메인에 독립적인 카테고리 임베딩 학습 장치 및 방법은 도메인에 영향을 받지 않고 카테고리 분류를 하도록 인공지능 학습을 수행하는 장점이 있다. 또한, 본 발명에 의한 도메인에 독립적인 카테고리 임베딩 학습 장치 및 방법은 카테고리와 도메인을 동시에 학 습하여 학습하지 않은 도메인에 대해서도 분류 성능을 향상시킬 수 있는 장점이 있다."}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시를 위한 구체적인 실시예를 첨부된 도면들을 참조하여 설명한다. 본 발명을 설명함에 있어서 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요 소들은 용어들에 의해 한정되지 않을 수 있다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적 으로만 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 연결되어 있다거나 접속되어 있다고 언급되는 경우는, 그 다른 구성요소에 직 접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해 될 수 있다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 명세서에서, 포함하다 또는 구비하다 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것으로서, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해될 수 있다. 또한, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 도메인에 독립적인 카테고리 임베딩 학습 장치 및 방법에 대해 상세히 설명한다. 도 1은 본 발명의 일 실시예에 따른 도메인에 독립적인 카테고리 임베딩 학습 장치를 나타낸 구성도이며, 도 2 는 도 1을 상세히 설명하기 위한 세부 그래프이다. 이하, 도 1 내지 도 2를 참조하여 본 발명의 일 실시예에 따른 도메인에 독립적인 카테고리 임베딩 학습 장치를 설명한다. 먼저, 도 1을 참조하면, 도메인에 독립적인 카테고리 임베딩 학습 장치는 훈련데이터(D100)를 입력받아 카테고 리(category) 특성을 추출하는 카테고리 특성추출부, 훈련데이터(D100)를 입력받아 도메인(domain) 특성을 추출하는 도메인 특성추출부, 카테고리 특성추출부의 결과를 토대로 훈련데이터(D100)의 카테고리를 분류하는 카테고리 분류기, 도메인 특성추출부의 결과를 토대로 훈련데이터(D100)의 도메인을 분류하 는 도메인 분류기, 카테고리 특성추출부와 도메인 특성추출부의 결과의 직교성 정도에 대한 손 실함수(similarity loss)를 계산하여 출력하는 직교성 손실계산부, 및 카테고리 특성추출부와 도메인 특성추출부의 결과의 식별력 정도에 대한 손실함수(discrimination loss)를 계산하여 출력하는 식별력 손 실계산부로 이루어진다. 여기서, 카테고리는 말, 강아지, 고양이 등과 같은 개체의 종류를 뜻한다. 또한, 도메인은 만화, 사진, 스케치 등과 같은 개체가 표현되는 분야를 의미한다. 일반적으로 인공지능 모델이 카테고리 학습만 할 경우 도메인에 따라 학습 성능이 다르게 나오는 단점이 있다. 본 발명에 의한 도메인에 독립적인 카테고리 임베딩 학습 장치는 이러한 문제점을 해결하기 위해 도메인에 무관 하게 카테고리를 분류할 수 있으며, 이에 대해 상세히 설명한다. 여기서, 다수의 카테고리와 다수의 도메인이 포함된 훈련데이터(D100)는 다음 식으로 정의되어 도메인에 독립적 인 카테고리 임베딩 학습 장치를 훈련하는 데이터로 사용된다. 수학식 1"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, : 번째 훈련 도메인(domain). 훈련데이터(D100)는 특성추출부로 입력되게 되며, 카테고리와 도메인을 분류하는 카테고리 특성추출부 및 도메인 특성추출부로 동시에 입력된다. 한편, 카테고리 특성추출부의 출력은 카테고리 분류기로 입력되어 카테고리를 분류하고 분류 결과에 대한 손실함수로 카테고리 손실함수(D210)를 다음 식과 같이 출력한다. 수학식 2"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, : cross entropy, : category elementary embedding, : input, : category model parameter, : category classifier, : category target label. 또한, 도메인 특성추출부의 출력은 도메인 분류기로 입력되어 도메인을 분류하고 분류 결과에 대한 손실함수로 도메인 손실함수(D220)를 다음 식과 같이 출력한다. 수학식 3"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, : cross entropy, : domain elementary embedding, : input, : domain model parameter, : domain classifier, : domain target label. 한편, 직교성 손실계산부는 카테고리과 도메인이 직각으로 분류되도록 코사인 유사도를 손실함수를 사용하 며 다음과 같은 식으로 직교성 손실함수(D310)를 출력한다. 수학식 4"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, : 두 벡터의 직교성(cosine similarity) 함수. 식별력 손실계산부는 식별력 정도에 대한 손실함수로 카테고리 식별력 손실함수(D321)와 도메인 식별력 손 실함수(D322)를 구분하여 출력하는데, 이를 통해 카테고리와 도메인의 구분을 더욱 명확히 할 수 있다. 여기서, 카테고리 식별력 손실함수(D321)는 다음과 같은 식으로 정의된다. 수학식 5"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서, : discriminator. 또한, 도메인 식별력 손실함수(D322)는 다음과 같은 식으로 정의된다. 수학식 6"}
{"patent_id": "10-2023-0027266", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서, : discriminator. 이와 같은 본 발명에 의한 도메인에 독립적인 카테고리 임베딩 학습 장치는 카테고리와 도메인을 구분하여 분류 하고 또한, 카테고리와 도메인 자체의 구분을 더욱 명확히 함으로써, 도메인에 무관하게 카테고리를 분류할 수 있는 장점이 있다. 도 2는 도 1의 직교성 손실계산부 및 식별력 손실계산부의 기능을 간략히 나타낸 그래프로서, 도 2(a)는 직교성 손실계산부의 기능, 도 2(b)는 식별력 손실계산부의 기능, 도 2(c)는 직교성 손실계산 부와 식별력 손실계산부의 복합 기능을 나타낸 그래프이다. 도 2에서 볼 수 있는 바와 같이, 도 2(a)는 직교성 손실계산부에서 카테고리 분류영역(D110)과 도메인 분 류영역(D120)을 직각으로 배치되도록 구분하는 것을 나타내며, 도 2(b)는 식별력 손실계산부에서 카테고리 분류영역(D110)과 도메인 분류영역(D120)간 구분을 더욱 명확히 하는 것을 나타낸다. 또한, 직교성 손실계산부와 식별력 손실계산부에서의 분류를 조합할 경우, 도 2(c)와 같이 카테고리 분류영역(D110)과 도메인 분류영역(D120)은 더욱 분류가 명확히 되어, 카테고리 분류영역(D110) 내의 분류에서 는 도메인 분류영역(D120)의 간섭이 없음을 알 수 있다. 따라서, 본 발명에 의한 도메인에 독립적인 카테고리 임베딩 학습 장치는 카테고리와 도메인을 구분하여 분류하 고, 또한 카테고리와 도메인 자체의 구분을 더욱 명확히 함으로써, 도메인에 무관하게 카테고리를 분류할 수 있 다. 도 3은 본 발명의 일 실시예에 따른 도메인에 독립적인 카테고리 임베딩 학습 방법을 나타낸 순서도이다. 도 3에서 알 수 있는 바와 같이, 도메인에 독립적인 카테고리 임베딩 학습 방법은 카테고리 특성추출부에 서 훈련데이터(D100)를 입력받아 카테고리(category) 특성을 추출하는 카테고리 특성추출단계(S110), 도메인 특 성추출부에서 훈련데이터(D100)를 입력받아 도메인(domain) 특성을 추출하는 도메인 특성추출단계(S120), 카테고리 분류기에서 카테고리 특성추출부의 결과를 토대로 훈련데이터(D100)의 카테고리를 분류하는 카테고리 분류단계(S210), 도메인 분류기에서 도메인 특성추출부의 결과를 토대로 훈련데이터(D100) 의 도메인을 분류하는 도메인 분류단계(S220), 직교성 손실계산부에서 카테고리 특성추출부와 도메인 특성추출부의 결과의 직교성 정도에 대한 손실함수(cosine similarity loss)를 계산하여 출력하는 직교성 손실계산단계(S310), 및 식별력 손실계산부에서 카테고리 특성추출부와 도메인 특성추출부의 결 과의 식별력 정도에 대한 손실함수(discrimination loss)를 계산하여 출력하는 식별력 손실계산단계(S320)로 이 루어진다. 여기서, 카테고리는 말, 강아지, 고양이와 같은 개체의 종류를 뜻하며, 도메인은 만화, 사진, 스케치 등과 같은 개체가 나타내어지는 분야를 뜻한다. 일반적으로 인공지능 모델이 카테고리 학습만 할 경우 도메인에 따라 학습 성능이 다르게 나오는 단점이 있으며, 본 발명에 의한 도메인에 독립적인 카테고리 임베딩 학습 방법은 이러한 문제점을 해결하기 위해 도메 인에 무관하게 카테고리를 분류할 수 있는 장점이 있다. 여기서, 다수의 카테고리와 다수의 도메인이 포함된 훈련데이터(D100)는 상기의 수학식 1로 정의되어 도메인에 독립적인 카테고리 임베딩 학습 장치를 훈련하는 데이터로 사용되며, 카테고리와 도메인을 분류하는 카테고리 특성추출부 및 도메인 특성추출부로 동시에 입력된다. 한편, 카테고리 특성추출단계(S110)에서 카테고리 특성추출부의 출력은 카테고리 분류기로 입력되어 카테고리를 분류하고 분류 결과에 대한 손실함수로 카테고리 손실함수(D210)를 상기의 수학식 2와 같이 출력한 다. 또한, 도메인 특성추출단계(S120)에서 도메인 특성추출부의 출력은 도메인 분류기로 입력되어 도메인 을 분류하고 분류 결과에 대한 손실함수로 도메인 손실함수(D220)를 상기의 수학식 3과 같이 출력한다. 한편, 직교성 손실계산단계(S310)에서 직교성 손실계산부는 카테고리과 도메인이 직각으로 분류되도록 코 사인 유사도를 손실함수를 사용하며 상기의 수학식 4와 같이 직교성 손실함수(D310)를 출력한다. 식별력 손실계산단계(S320)에서 식별력 손실계산부는 식별력 정도에 대한 손실함수로 카테고리 식별력 손 실함수(D321)와 도메인 식별력 손실함수(D322)를 구분하여 출력하는데, 이를 통해 카테고리와 도메인의 구분을 더욱 명확히 할 수 있다. 여기서, 카테고리 식별력 손실함수(D321)는 상기의 수학식 5로 정의되며, 도메인 식별력 손실함수(D322)는 상기 의 수학식 6으로 정의된다. 따라서, 본 발명에 의한 도메인에 독립적인 카테고리 임베딩 학습 방법은 카테고리와 도메인을 구분하여 분류하 고, 또한 카테고리와 도메인 자체의 구분을 더욱 명확히 함으로써, 도메인에 무관하게 카테고리를 분류할 수 있 다. 이상과 같이 본 발명에 따른 도메인에 독립적인 카테고리 임베딩 학습 장치 및 방법은 도메인에 영향을 받지 않 고 카테고리 분류를 하도록 인공지능 학습을 수행하는 장점이 있으며, 또한 카테고리와 도메인을 동시에 학습하 여 학습하지 않은 도메인에 대해서도 분류 성능을 향상시킬 수 있는 장점이 있다. 본 발명의 기술 분야에서 통상의 지식을 가진 자는 여기에 개시된 실시예들과 관련하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 프로세서들, 수단들, 회로들 및 알고리즘 단계들이 전자 하드웨어, (편의를 위해, 여기에 서 소프트웨어로 지칭되는) 다양한 형태들의 프로그램 또는 설계 코드 또는 이들 모두의 결합에 의해 구현될 수 있다는 것을 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 호환성을 명확하게 설명하기 위해, 다양한 예시적인 컴포넌트들, 블록들, 모듈들, 회로들 및 단계들이 이들의 기능과 관련하여 위에서 일반적으로 설명되 었다. 이러한 기능이 하드웨어 또는 소프트웨어로서 구현되는지 여부는 특정한 애플리케이션 및 전체 시스템에 대하여 부과되는 설계 제약들에 따라 좌우된다. 본 발명의 기술 분야에서 통상의 지식을 가진 자는 각각의 특정 한 애플리케이션에 대하여 다양한 방식들로 설명된 기능을 구현할 수 있으나, 이러한 구현 결정들은 본 발명의 범위를 벗어나는 것으로 해석되어서는 안 될 것이다. 여기서 제시된 다양한 실시예들은 방법, 장치, 또는 표준 프로그래밍 및/또는 엔지니어링 기술을 사용한 제조 물품(article)으로 구현될 수 있다. 용어 제조 물품은 임의의 컴퓨터-판독가능 저장장치로부터 액세스 가능한 컴퓨터 프로그램, 캐리어, 또는 매체(media)를 포함한다. 예를 들어, 컴퓨터-판독가능 저장매체는 자기 저장 장 치(예를 들면, 하드 디스크, 플로피 디스크, 자기 스트립, 등), 광학 디스크(예를 들면, CD, DVD, 등), 스마트 카드, 및 플래쉬 메모리 장치(예를 들면, EEPROM, 카드, 스틱, 키 드라이브, 등)를 포함하지만, 이들로 제한되 는 것은 아니다. 또한, 여기서 제시되는 다양한 저장 매체는 정보를 저장하기 위한 하나 이상의 장치 및/또는 다른 기계-판독가능한 매체를 포함한다. 제시된 프로세스들에 있는 단계들의 특정한 순서 또는 계층 구조는 예시적인 접근들의 일례임을 이해하도록 한 다. 설계 우선순위들에 기반하여, 본 발명의 범위 내에서 프로세스들에 있는 단계들의 특정한 순서 또는 계층 구조가 재배열될 수 있다는 것을 이해하도록 한다. 첨부된 방법 청구항들은 샘플 순서로 다양한 단계들의 엘리 먼트들을 제공하지만 제시된 특정한 순서 또는 계층 구조에 한정되는 것을 의미하지는 않는다. 제시된 실시예들에 대한 설명은 임의의 본 발명의 기술 분야에서 통상의 지식을 가진 자가 본 발명을 이용하거 나 또는 실시할 수 있도록 제공된다. 이러한 실시예들에 대한 다양한 변형들은 본 발명의 기술 분야에서 통상의지식을 가진 자에게 명백할 것이며, 여기에 정의된 일반적인 원리들은 본 발명의 범위를 벗어남이 없이 다른 실 시예들에 적용될 수 있다. 그리하여, 본 발명은 여기에 제시된 실시예들로 한정되는 것이 아니라, 여기에 제시 된 원리들 및 신규한 특징들과 일관되는 최광의의 범위에서 해석되어야 할 것이다."}
{"patent_id": "10-2023-0027266", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 도메인에 독립적인 카테고리 임베딩 학습 장치를 나타낸 구성도이다. 도 2는 도 1의 직교성 손실계산부 및 식별력 손실계산부의 기능을 간략히 나타낸 그래프로서, 도 2(a)는 직교성 손실계산부의 기능, 도 2(b)는 식별력 손실계산부의 기능, 도 2(c)는 직교성 손실계산부와 식별력 손실계산부의 복합 기능을 나타낸 그래프이다. 도 3은 본 발명의 일 실시예에 따른 도메인에 독립적인 카테고리 임베딩 학습 방법을 나타낸 순서도이다."}
