{"patent_id": "10-2022-7006604", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0042410", "출원번호": "10-2022-7006604", "발명의 명칭": "로봇청소기 및 그 제어방법", "출원인": "포시텍 파워 툴스", "발명자": "탄, 이윤"}}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "바디; 상기 바디에 설치되고, 상기 로봇청소기가 지면을 이동하면서 청소 작업을 수행하도록 하는 이동 장치;상기 바디에 설치되고, 상기 로봇청소기의 전방 지면의 특징을 검출하기 위한 검출 장치;상기 바디에 설치되고, 상기 로봇청소기의 위치 정보를 획득하기 위한 위치 추적 장치;상기 검출 장치와 상기 위치 추적 장치에 전기적으로 연결되고, 상기 로봇청소기의 작업 영역의 지도를 저장하거나 획득하며, 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기의 상기 지도에서의 위치를 결정할 수 있는 제어 장치;를 포함하고,상기 제어 장치는 상기 검출 장치의 검출 결과에 따라 상기 지면 특징을 인식하고, 상기 로봇청소기의 상기 지도에서의 위치에 따라 상기 로봇청소기가 해당 동작을 수행하도록 제어되는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어 장치가 상기 검출 장치의 검출 결과에 따라 상기 지면 특징을 인식하는 것은 상기 지면 특징이 카펫인지 여부를 인식하는 것을 포함하고,상기 제어 장치가 해당 동작을 수행하도록 상기 로봇청소기를 제어하는 것은 상기 로봇청소기가 상기 카펫이 존재하는 영역에 들어가지 않도록 하거나, 상기 카펫이 존재하는 영역을 통과하도록 제어하는 것을 포함하는 것을특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 검출 장치는 초음파 센서, 광학 센서, 밀리파 레이더 센서, 기계적 스위치 중의 적어도 하나를 포함하는것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 검출 장치는 거리 측정 센서를 포함하고, 상기 로봇청소기와 상기 지면의 거리를 검출함으로써 상기 지면의 높이를 나타내는 높이 파라미터를 획득하며, 상기 제어 장치는 상기 높이 파라미터가 제1 기설정 값보다 큰것에 따라 상기 지면 특징이 카펫인 것으로 인식하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 지도는 행진 영역 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역을 포함하고, 상기 제어 장치는 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기와 상기 출입구영역 사이의 거리가 제1 기설정 거리 범위 외인 것으로 판단한 경우, 상기 로봇청소기가 상기 카펫이 존재하는영역에 들어가지 않도록 제어하는 것을 특징으로 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 지도는 행진 영역 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역을 포함하고, 상기 제어 장치공개특허 10-2022-0042410-3-는 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기와 상기 출입구영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단한 경우, 상기 로봇청소기가 상기 카펫이 존재하는영역을 통과하도록 제어하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 로봇청소기는 영역 초월 이동 모드를 포함하고, 영역 초월 이동 모드에서 상기 제어 장치는 상기 로봇청소기가 하나의 행진 영역으로부터 상기 출입구 영역을 거쳐 다른 행진 영역에 들어가도록 제어하며,상기 제어 장치는 상기 영역 초월 이동 모드에서 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치정보에 따라 상기 로봇청소기와 상기 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역을 통과하여 하나의 행진 영역으로부터 다른 행진 영역으로들어가도록 제어하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 로봇청소기는 영역 내 이동 모드를 포함하고, 영역 내 이동 모드에서 상기 제어 장치는 상기 로봇청소기가하나의 행진 영역 내에서 이동하면서 청소 작업을 수행하도록 제어하며,상기 제어 장치는 상기 영역 내 이동 모드에서 상기 지면 특징을 카펫으로 인식한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역에 들어가지 않도록 제어하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항, 제5항 또는 제8항에 있어서,상기 제어 장치가 상기 카펫이 존재하는 영역에 들어가지 않도록 상기 로봇청소기를 제어하는 것은 상기 로봇청소기가 상기 카펫을 떠나거나 상기 카펫의 가장자리를 따라 이동하도록 제어하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 로봇청소기는 상기 바디의 하면에 설치되는 바닥 닦기 모듈, 및 상기 바닥 닦기 모듈을 승강시키는 바닥닦기 모듈 승강 장치를 더 포함하며, 상기 제어 장치는 상기 지면 특징을 카펫으로 인식한 경우 상기 바닥 닦기모듈이 상승하도록 상기 바닥 닦기 모듈 승강 장치를 제어하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 위치 추적 장치는 레이저 SLAM 위치 추적 장치 또는 비젼 SLAM 위치 추적 장치인 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 지도는 상기 위치 추적 장치에 의해 획득되거나, 사용자 단말기로부터 수신되는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 검출 장치는 상기 바디의 바닥부에 설치되고, 상기 바디의 앞부분에 설치되는 것을 특징으로 하는 로봇청소기.공개특허 10-2022-0042410-4-청구항 14 지면을 이동하면서 청소 작업을 수행하고, 위치 정보를 획득하기 위한 위치 추적 장치 및 전방 지면의 특징을검출하기 위한 검출 장치를 포함하며, 작업 영역의 지도가 저정되어 있거나 이 지도를 획득할 수 있는 로봇청소기의 제어방법에 있어서,상기 로봇청소기의 위치 정보를 획득하고, 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기의 상기 지도에서의 위치를 결정하는 단계;상기 로봇청소기의 검출 장치의 검출 결과에 따라 상기 로봇청소기의 전방 지면의 특징을 인식하고, 상기 로봇청소기의 상기 지도에서의 위치에 따라 상기 로봇청소기가 해당 동작을 수행하도록 제어하는 단계;를 포함하는것을 특징으로 하는 로봇청소기의 제어방법."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 지면 특징을 카펫으로 인식한 경우, 상기 로봇청소기의 상기 지도에서의 위치에 따라 상기 로봇청소기가상기 카펫이 존재하는 영역에 들어가지 않거나 상기 카펫이 존재하는 영역을 통과하도록 제어하는 것을 특징으로 하는 로봇청소기의 제어방법."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 지도는 행진 영역 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역을 포함하고, 상기 제어방법은상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기와 상기 출입구 영역사이의 거리가 제1 기설정 거리 범위 외인 것으로 판단한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역에 들어가지 않도록 제어하는 단계를 포함하는 것을 특징으로 하는 로봇청소기의 제어방법."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14항에 있어서,상기 지도는 행진 영역 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역을 포함하고, 상기 제어방법은상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기와 상기 출입구 영역사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역을 통과하도록 제어하는 단계를 포함하는 것을 특징으로 하는 로봇청소기의 제어방법."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 로봇청소기는 영역 초월 이동 모드를 포함하고, 영역 초월 이동 모드에서 상기 로봇청소기가 하나의 행진영역으로부터 상기 출입구 영역을 거쳐 다른 행진 영역으로 들어가도록 제어하며,상기 제어방법은 상기 영역 초월 이동 모드에서 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치정보에 따라 상기 로봇청소기와 상기 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역을 통과하여 하나의 행진 영역으로부터 다른 행진 영역에 들어가도록 제어하는 단계를 포함하는 것을 특징으로 하는 로봇청소기의 제어방법."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제14항에 있어서,상기 로봇청소기는 영역 내 이동 모드를 포함하고, 영역 내 이동 모드에서 상기 로봇청소기가 하나의 행진 영역내에서 이동하면서 청소 작업을 수행하도록 제어하며,상기 제어방법은 상기 영역 내 이동 모드에서 상기 지면 특징을 카펫으로 인식한 경우, 상기 로봇청소기가 상기카펫이 존재하는 영역에 들어가지 않도록 제어하는 것을 특징으로 하는 로봇청소기의 제어방법.공개특허 10-2022-0042410-5-청구항 20 제15항, 제16항 또는 제19항에 있어서,상기 로봇청소기가 상기 카펫이 존재하는 영역에 들어가지 않도록 제어하는 것은 상기 로봇청소기가 상기 카펫을 떠나거나 상기 카펫의 가장자리를 따라 이동하도록 제어하는 것을 포함하는 것을 특징으로 하는 로봇청소기의 제어방법."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제14항에 있어서,상기 로봇청소기는 상기 바디의 하면에 설치되는 바닥 닦기 모듈, 및 상기 바닥 닦기 모듈을 승강시키는 바닥닦기 모듈 승강 장치를 더 포함하고, 상기 제어방법은 상기 지면 특징을 카펫으로 인식한 경우 상기 바닥 닦기모듈을 상승시키는 것을 특징으로 하는 로봇청소기의 제어방법."}
{"patent_id": "10-2022-7006604", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제14항에 있어서,상기 지도는 상기 위치 추적 장치에 의해 획득되거나, 사용자 단말기로부터 수신되는 것을 특징으로 하는 로봇청소기의 제어방법."}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 로봇청소기 및 그 제어방법을 공개한다. 상기 로봇청소기는 바디; 바디에 설치되고, 로봇청소기가 지 면을 이동하면서 청소 작업을 수행하도록 하는 이동 장치; 로봇청소기의 전방 지면 특징을 검출하기 위한 검출 장치; 로봇청소기의 위치 정보를 획득하기 위한 위치 추적 장치; 검출 장치와 위치 추적 장치에 전기적으로 연결 되고, 로봇청소기의 작업 영역의 지도를 저장하거나 획득하며, 로봇청소기의 위치 정보에 따라 로봇청소기의 지 도에서의 위치를 결정할 수 있는 제어 장치;를 포함하고, 제어 장치는 검출 장치에 의한 검출 결과에 따라 지면 특징을 인식하고 로봇청소기의 지도에서의 위치에 따라 로봇청소기가 해당 동작을 수행하도록 제어한다. 본 발명 에 따른 로봇청소기 및 그 제어방법은 지면 특징을 인식하고 지도 정보에 따라 해당 동작을 수행할 수 있어, 지 능화 정도가 높고 사용 신뢰성이 높으며, 사용자의 종합 체험도가 우수하다."}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 로봇 기술분야에 관한 것이고, 특히 로봇청소기 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 컴퓨터 기술과 인공 스마트 과학이 신속하게 발전됨에 따라, 스마트 로봇 기술이 점차 현대 로봇 연구 분 야의 이슈로 되었다. 스마트 로봇 중에서 가장 실용화적인 형식이 바로 로봇청소기이다. 로봇청소기는 자동 청소기, 로봇 흡진기 등이라고도 하는데, 일정한 인공 스마트 기능에 의해 실내에서 자동적 으로 지면 청소 작업을 수행할 수 있다. 작업 시, 로봇청소기는 일반적으로 쓸기 및 진공 방식을 통해 지면의 오물을 자신의 쓰레기 수용함에 흡입함으로써 지면을 청소한다. 상기 로봇청소기의 바디는 자동화 기술을 사용 한 이동 가능 장치로서 집진함의 진공 흡진 장치가 배치되어 있고, 바디에 따라 제어 경로를 설정한다. 사용 시, 실내에서 왕복 주행하는데, 예를 들면 가장자리 청소, 집중 청소, 랜덤 청소, 직선 청소 등이 있다. 기존의 로봇청소기는 주로 쓸기 및 흡입을 통해 쓰레기를 제거하는데, 지면에 물기, 기름때 등 액체 얼룩 또는 지면에 부착된 청소하기 어려운 얼룩이 존재할 때 효과적인 청소를 구현할 수 없다. 상기 제거하기 어려운 얼룩을 깨끗이 청소하기 위해, 바닥 청소기 또는 바닥 닦기 기능을 구비한 투인원 청소기 가 출시되었다. 하나의 구체적인 시나리오에서, 상기 로봇청소기는 바닥 닦기 모드에서 청소할 물체(예컨대 바닥, 타일)를 적신 후 청소를 수행한다. 상기 지면에 물로 적셔 청소하기에 부적절한 전방 물체(예컨대 카펫 등)가 존재하는 경우, 사용자는 상기 로봇청소기가 전방 물체를 자동적으로 인식하고 전방 물체에 진입하지 않기를 원한다. 현재, 바닥 닦기 모드에서 전방 물체를 인식하기 위해서는 자기 스트립을 설치하여 가상 금지 구역을 설정함으 로써 로봇청소기가 상기 가상 금지 구역에 들어가는 것을 방지하는 방식을 사용한다. 그러나, 상기 자석을 설치 하는 방식은 사용하기 전에 자석을 장착해야 하고, 사용 과정에서 자석이 이동되어 설정한 가상 금지 구역이 변 위되거나 심지어 실효될 수 있어 사용 체험도와 신뢰성이 떨어지는 단점이 있다. 또한, 실제 사용 시, 대부분 로봇청소기는 실내 상황에 따라 전방 지면의 특징을 인식하고, 실내 상황에 따라 대응하게 판단하고 해당 동작을 유연하게 수행하여 서로 다른 환경 요구를 만족할 수 없으므로, 지능화 정도가 낮고, 사용자 체험도가 떨어진다."}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "기존 기술의 적어도 하나의 단점을 극복하기 위해, 본 발명은 전방 지면 특징을 인식하고, 지도 정보에 따라 해 당 동작을 수행할 수 있어 지능화 정도가 높고, 사용 신뢰성이 높으며, 사용자의 종합 체험도가 우수한 로봇청 소기 및 그 제어방법을 제공한다."}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해, 본 발명은 바디; 상기 바디에 설치되고, 상기 로봇청소기가 지면을 이동하면서 청 소 작업을 수행하도록 하는 이동 장치; 상기 바디에 설치되고, 상기 로봇청소기의 전방 지면 특징을 검출하기 위한 검출 장치; 상기 바디에 설치되고, 상기 로봇청소기의 위치 정보를 획득하기 위한 위치 추적 장치; 상기 검출 장치와 상기 위치 추적 장치에 전기적으로 연결되고, 상기 로봇청소기의 작업 영역의 지도를 저장하거나 획득하며, 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기의 상기 지도에서의 위치를 결정할 수 있는 제 어 장치;를 포함하고, 상기 제어 장치는 상기 검출 장치에 의한 검출 결과에 따라 상기 지면 특징을 인식하고, 상기 로봇청소기의 상기 지도에서의 위치에 따라 상기 로봇청소기가 해당 동작을 수행하도록 하는 로봇청소기를 제공한다. 일 실시형태에서, 상기 제어 장치는 상기 검출 장치에 의한 검출 결과에 따라 상기 지면 특징을 인식하는 것은 상기 지면 특징이 카펫인지 여부를 인식하는 것을 포함하고, 상기 제어 장치가 해당 동작을 수행하도록 상기 로 봇청소기를 제어하는 것은 상기 로봇청소기가 상기 카펫이 존재하는 영역에 들어가지 않도록 하거나, 상기 카펫 이 존재하는 영역을 통과하도록 제어하는 것을 포함한다. 일 실시형태에서, 상기 검출 장치는 초음파 센서, 광학 센서, 밀리파 레이더 센서, 기계적 스위치 중의 적어도 하나를 포함한다. 일 실시형태에서, 상기 검출 장치는 거리 측정 센서를 포함하고, 상기 로봇청소기와 상기 지면의 거리를 검출함 으로써 상기 지면의 높이를 나타내는 높이 파라미터를 획득하며, 상기 높이 파라미터가 제1 기설정 값보다 크면 상기 제어 장치는 상기 지면 특징을 카펫으로 인식한다. 일 실시형태에서, 상기 지도는 행진 영역 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역을 포함하고, 상기 제어 장치는 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로 봇청소기와 상기 출입구 영역 사이의 거리가 제1 기설정 거리 범위 외인 것으로 판단한 경우, 상기 로봇청소기 가 상기 카펫이 존재하는 영역에 들어가지 않도록 제어한다. 일 실시형태에서, 상기 지도는 행진 영역 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역을 포함하고, 상기 제어 장치는 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로 봇청소기와 상기 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단한 경우, 상기 로봇청소기 가 상기 카펫이 존재하는 영역을 통과하도록 제어한다. 일 실시형태에서, 상기 로봇청소기는 영역 초월 이동 모드를 포함하고, 영역 초월 이동 모드에서 상기 제어 장 치는 상기 로봇청소기가 하나의 행진 영역으로부터 상기 출입구 영역을 거쳐 다른 행진 영역에 들어가도록 제어 하며, 상기 제어 장치는 상기 영역 초월 이동 모드에서 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기와 상기 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단 한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역을 통과하여 하나의 행진 영역으로부터 다른 행진 영역 으로 들어가도록 제어한다. 일 실시형태에서, 상기 로봇청소기는 영역 내 이동 모드를 포함하고, 영역 내 이동 모드에서 상기 제어 장치는 상기 로봇청소기가 하나의 행진 영역을 이동하면서 청소 작업을 수행하도록 제어하며, 상기 제어 장치는 상기 영역 내 이동 모드에서 상기 지면 특징을 카펫으로 인식한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역 에 들어가지 않도록 제어한다. 일 실시형태에서, 상기 제어 장치가 상기 카펫이 존재하는 영역에 들어가지 않도록 상기 로봇청소기를 제어하는 것은 상기 로봇청소기가 상기 카펫을 떠나거나 상기 카펫의 가장자리를 따라 이동하도록 제어한다. 일 실시형태에서, 상기 로봇청소기는 상기 바디의 하면에 설치되는 바닥 닦기 모듈, 및 상기 바닥 닦기 모듈을 승강시키는 바닥 닦기 모듈 승강 장치를 더 포함하며, 상기 제어 장치는 상기 지면 특징을 카펫으로 인식한 경 우 상기 바닥 닦기 모듈이 상승하도록 상기 바닥 닦기 모듈 승강 장치를 제어한다.일 실시형태에서, 상기 위치 추적 장치는 레이저 SLAM 위치 추적 장치 또는 비젼 SLAM 위치 추적 장치이다. 일 실시형태에서, 상기 지도는 상기 위치 추적 장치에 의해 획득되거나, 사용자 단말기로부터 수신된다. 일 실시형태에서, 상기 검출 장치는 상기 바디의 바닥부에 설치되고, 상기 바디의 앞부분에 설치된다. 일 실시형태에서, 상기 검출 장치는 상기 로봇청소기와 상기 지면의 거리를 검출함으로써 상기 지면의 높이를 나타내는 높이 파라미터를 획득하며, 상기 제어 장치는 상기 높이 파라미터와 기설정 값의 대비 결과에 따라 상 기 지면 특징을 인식한다. 일 실시형태에서, 상기 기설정 값은 제1 기설정 값을 포함하고, 상기 높이 파라미터가 제1 기설정 값보다 크면 상기 제어 장치는 상기 지면 특징을 카펫으로 인식한다. 일 실시형태에서, 상기 기설정 값은 제2 기설정 값을 포함하고, 상기 높이 파라미터가 제2 기설정 값보다 작으 면, 상기 제어 장치는 상기 지면 특징을 벼랑으로 인식하고, 상기 로봇청소기가 상기 벼랑이 존재하는 영역에 들어가지 않도록 제어한다. 일 실시형태에서, 상기 높이 파라미터는 상기 지면 특징의 높이(ΔH)이고, 상기 검출 장치는 검출 방향을 가지 고 있으며, 상기 검출 방향과 수직 방향 사이의 협각은 θ이고, 상기 지면 특징의 높이는 ΔH=ΔL×COSθ이며, 여기서 ΔL은 상기 검출 방향에서 측정한 거리 참고치(L)와 검출 방향에서 실제 측정한 거리(L1)의 차이값이다. 일 실시형태에서, 상기 검출 장치는 작업하기 전에 상기 높이 파라미터를 확정한다. 일 실시형태에서, 상기 검출 장치는 거리 측정 센서를 포함하고, 상기 거리 측정 센서는 TOF 센서 또는 삼각 거 리 측정 센서이다. 일 실시형태에서, 상기 지도는 행진 영역, 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역, 및 비출입구 영역의 경계를 포함하고, 상기 제어 장치는 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기와 상기 경계 사이의 거리가 제3 기설정 거리 내인 것으로 판단한 경우, 상기 검출 장치를 차폐하고 상기 로봇청소기가 계속 작업하도록 제어한다. 일 실시형태에서, 상기 검출 장치는 검출 방향을 가지고 있고, 상기 검출 방향과 수직 방향 사이의 협각은 0도 내지 90도 범위이다. 일 실시형태에서, 상기 바디는 전진 방향을 향해 전면을 구비한 하우징을 포함하고, 상기 검출 장치는 상기 전 면에 설치된다. 본 발명은 지면을 이동하면서 청소 작업을 수행하고, 위치 정보를 획득하기 위한 위치 추적 장치 및 전방 지면 특징을 검출하기 위한 검출 장치를 포함하며, 작업 영역의 지도가 저장되어 있거나 이 지도를 획득할 수 있는 로봇청소기의 제어방법에 있어서, 상기 로봇청소기의 위치 정보를 획득하고, 상기 로봇청소기의 위치 정보에 따 라 상기 로봇청소기의 상기 지도에서의 위치를 결정하는 단계; 상기 로봇청소기의 검출 장치의 검출 결과에 따 라 상기 로봇청소기의 전방 지면 특징을 인식하고, 상기 로봇청소기의 상기 지도에서의 위치에 따라 상기 로봇 청소기가 해당 동작을 수행하도록 제어하는 단계;를 포함한다. 일 실시형태에서, 상기 지면 특징을 카펫으로 인식한 경우, 상기 로봇청소기의 상기 지도에서의 위치에 따라 상 기 로봇청소기가 상기 카펫이 존재하는 영역에 들어가지 않거나 상기 카펫이 존재하는 영역을 통과하도록 제어 한다. 일 실시형태에서, 상기 지도는 행진 영역 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역을 포함하고, 상기 제어방법은 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로 봇청소기와 상기 출입구 영역 사이의 거리가 제1 기설정 거리 범위 외인 것으로 판단한 경우, 상기 로봇청소기 가 상기 카펫이 존재하는 영역에 들어가지 않도록 제어하는 것을 포함한다. 일 실시형태에서, 상기 지도는 행진 영역 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역을 포함하고, 상기 제어방법은 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따라 상기 로 봇청소기와 상기 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단한 경우, 상기 로봇청소기 가 상기 카펫이 존재하는 영역을 통과하도록 제어하는 것을 포함한다. 일 실시형태에서, 상기 로봇청소기는 영역 초월 이동 모드를 포함하고, 영역 초월 이동 모드에서 상기 로봇청소 기가 하나의 행진 영역으로부터 상기 출입구 영역을 거쳐 다른 행진 영역으로 들어가도록 제어하며, 상기 제어방법은 상기 영역 초월 이동 모드에서 상기 지면 특징을 카펫으로 인식하고 상기 로봇청소기의 위치 정보에 따 라 상기 로봇청소기와 상기 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역을 통과하여 하나의 행진 영역으로부터 다른 행진 영역에 들어가도록 제어하는 것을 포함한다. 일 실시형태에서, 상기 로봇청소기는 영역 내 이동 모드를 포함하고, 영역 내 이동 모드에서 상기 로봇청소기가 하나의 행진 영역을 이동하면서 청소 작업을 수행하도록 제어하며, 상기 제어방법은 상기 영역 내 이동 모드에 서 상기 지면 특징을 카펫으로 인식한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역에 들어가지 않도록 제어하는 것을 포함한다. 일 실시형태에서, 상기 로봇청소기가 상기 카펫이 존재하는 영역에 들어가지 않도록 제어하는 것은 상기 로봇청 소기가 상기 카펫을 떠나거나 상기 카펫의 가장자리를 따라 이동하도록 제어하는 것을 포함한다. 일 실시형태에서, 상기 로봇청소기는 상기 바디의 하면에 설치되는 바닥 닦기 모듈, 및 상기 바닥 닦기 모듈을 승강시키는 바닥 닦기 모듈 승강 장치를 더 포함하고, 상기 제어방법은 상기 지면 특징을 카펫으로 인식한 경우 상기 바닥 닦기 모듈을 상승시키는 것을 포함한다. 일 실시형태에서, 상기 지도는 상기 위치 추적 장치에 의해 획득되거나, 사용자 단말기로부터 수신된다."}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시형태에 따른 로봇청소기 및 제어방법은 상기 검출 장치에 의한 검출 결과에 따라 상기 로봇청소 기의 전방 지면 특징을 인식할 수 있다. 상기 로봇청소기는 행진 과정에서 위치 추적 장치에 의해 획득한 위치 정보와 로봇청소기의 작업 영역의 지도를 이용하여 위치를 실시간으로 지도에 표시하고, 상기 지도에 표시한 위 치에 따라 해당 동작을 수행함으로써 서로 다른 기능을 구현할 수 있어, 지능화 정도가 높고, 사용 신뢰성이 높 으며, 사용자의 종합 체험도를 크게 향상시킬 수 있다. 구체적으로, 로봇청소기의 지도에서의 상이한 위치에 대해 다음과 같이 서로 다른 제어 동작을 수행한다. 1. 로봇청소기가 비출입구 영역(문) 근처에 위치할 때 전진 방향에서 상기 검출 장치에 의한 검출 결과에 따라 전방 지면 특징을 카펫으로 인식(예를 들어 기설정된 값(예컨대 5mm)을 초과한 돌기가 검출)하면, 상기 로봇청 소기는 전방 영역에 들어가지 않아 카펫을 더럽히는 것을 방지할 수 있다. 2. 로봇청소기가 출입구 영역(문) 근처에 위치할 때 전진 방향에서 상기 검출 장치에 의한 검출 결과에 따라 전 방 지면 특징을 카펫으로 인식(예를 들어 기설정된 값(예컨대 5mm)을 초과한 돌기가 검출)하면, 바닥 닦기 모듈 이 상승하고 상기 로봇청소기가 전방 영역에 들어감으로써, 로봇청소기가 서로 다른 행진 영역으로 이동하여 전 역 지도 범위 내의 모든 영역을 청소할 수 있어, 하나의 행진 영역에 제한되지 않고 카펫을 더럽히지 않을 수 있다. 본 발명에 따른 로봇청소기는 주로 상기 지면 특징의 물리적 크기에 따라 전방 지면 특징을 인식하기 때문에, 기존 기술의 다른 인식 방식에 비해 사용 시 카펫을 비롯한 지면 특징을 정확하게 인식할 수 있을 뿐만 아니라 가상 금지 구역을 설정할 필요가 없다. 나아가, 상기 검출 장치의 장착 각도를 제어함으로써 일정한 거리를 앞당겨 사전에 전방 지면 특징을 인식할 수 있어, 상기 로봇청소기가 전방 영역(예컨대, 문이 아닌 곳의 카펫, 벼랑 등)에 들어가는 것을 더욱 효과적으로 방지할 수 있다."}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면과 구체적인 실시형태에 의해 본 발명의 기술 방안을 상세하게 설명하기로 하는데, 이러한 실시 형태는 본 발명을 설명하기 위한 것일 뿐 본 발명의 범위를 제한하기 위한 것이 아님을 이해해야 할 것이다. 본"}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자라면 본 발명을 읽은 후 실시한 각종 등가적 수정은 모두 본 발명의 청구의 범위에 속한다. 하나의 소자가 다른 소자에 설치되어 있는 것으로 기재한 경우, 다른 소자에 직접 설치되어 있는 것을 의미할 수 있고, 중간 소자가 존재하는 것을 의미할 수도 있다. 하나의 소자가 다른 소자에 연결되어 있는 것으로 기재 한 경우, 다른 소자에 직접 연결되어 있는 것을 의미할 수 있고, 중간 소자가 동시에 존재하는 것을 의미할 수 도 있다. 본 발명에서 사용한 용어 “수직”, “평행”, “상”, “하”, “좌”, “우” 및 유사한 표현은 단 지 설명을 위한 것일 뿐, 유일한 실시형태를 나타내지 않는다."}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "다르게 정의하지 않는 한, 본 발명에서 사용한 모든 기술 및 과학 용어는 본 발명의 기술분야에서 통상의 지식 을 가진 자가 통상 이해하고 있는 의미와 동일하다. 본 발명의 실시형태에서 사용한 용어는 구체적인 실시형태 의 목적을 설명하기 위한 것에 불과하고, 본 발명을 제한하기 위한 것이 아니다. 본 발명에서 사용한 용어 “및 /또는”는 하나 또는 복수개의 열거한 항목의 임의의 조합 및 모든 조합을 포함하는 것을 의미한다. 도 1 내지 도 4를 참조하면, 본 발명의 일 실시형태에서는 바디, 이동 장치, 위치 추적 장치, 검출 장 치, 제어 장치(미도시) 등을 포함할 수 있는 로봇청소기를 제공한다. 이동 장치는 바디 아래에 설치되는 주행 휠, 주행 휠과 전동적으로 연결되는 전동 수단 등을 포함한다. 로봇청소기는 바디 내에 설치되는 배터리를 더 포함할 수 있다. 사용 시, 상기 배터리에서 제공한 전기 에너지가 상기 전동 수단에 의해 기계 에너지로 전환되어 주행 휠로 전달됨으로써, 상기 로봇청소기가 지면을 이동하면서 청소 작업을 수행 하게 된다. 본 실시형태에서, 검출 장치는 로봇청소기의 전방 지면 특징을 검출하기 위한 것이다. 구체적으로, 검출 장치는 전방 지면이 카펫인지 여부를 인식할 수 있다. 구체적으로, 검출 장치는 초음파 센서, 광학 센서(예 컨대 적외선 센서), 밀리파 레이더 센서, 기계적 스위치 중의 하나 또는 여러 개의 조합일 수 있다. 본 실시형 태에서, 검출 장치는 초음파 센서(3a) 및 기계적 스위치(3b, 3c)를 포함한다. 구체적으로, 바디는 전진 방향을 따른 앞부분과 뒷부분을 포함하고, 초음파 센서 및 기계적 스위치는 로봇청소기의 전진 방향에 있는 카 펫을 제때에 효과적으로 검출하기 위해 모두 바디의 앞부분에 설치되고 바디의 바닥부에 설치된다. 초음파 센서 가 카펫을 검출할 때에는 송신한 신호가 거칠기가 상이한 지면에서 반사된 후의 반사계수 또는 신호를 수신하는 강도가 다른 원리를 통해 카펫을 인식한다. 이는 본 분야에서 일반적으로 적용하는 원리와 유사하므로 여기서 더 이상 설명하지 않는다. 기계적 스위치는 구조 부재와 스위치 디바이스의 협동을 통해 카펫을 검출할 수 있다. 예를 들면, 움직일 수 있는 구조 부재가 카펫에 부딪히면 외력에 의해 움직여 스위치 디바이스(마이크로 스위치, 광전 스위치, 홀, 리드 스위치 등 포함)를 촉발하는 것이다. 물론, 다른 실시형태에서 검출 장치는 로 봇청소기가 서로 다른 방향으로 움직일 때 전방 지면 특징을 검출할 수 있도록 바디의 뒷부분 또는 측부 등 다른 위치에 장착될 수도 있다. 본 실시형태에서, 위치 추적 장치는 바디에 설치되어 상기 로봇청소기의 위치 정보를 획득할 수 있다. 구 체적으로, 상기 위치 추적 장치는 레이저 SLAM 위치 추적 장치 또는 비젼 SLAM 위치 추적 장치일 수 있다. 상기 위치 추적 장치의 구체적인 형식은 그 작업 원리에 따라 다를 수 있는데, 본 발명에서 이를 한정하지 않는다. 본 실시형태에서, 상기 제어 장치는 상기 로봇청소기의 작업 영역의 지도(전역 지도라고 약칭)를 저장하거나 획득할 수 있다. 구체적으로, 위치 추적 장치를 구비한 로봇청소기는 기존의 레이저 SLAM 맵핑 기술 또는 비젼 SLAM 맵핑 기술을 통해 전역 지도를 획득할 수도 있고, 이러한 기술들을 결합하여 획득할 수도 있다. 물론, 전 역 지도를 획득하는 방식은 이에 제한되지 않고, 예를 들면 사용자 단말기에 있는 앱에서 발송한 데이터를 수신하는 것일 수도 있으며, 본 발명에서 이를 한정하지 않는다. 일 실시형태에서, 전역 지도는 로봇청소기가 정식적으로 작업하기 전에 위치 추적 장치에 의해 검출한 신호 에 따라 미리 구축하고, 제어 장치의 저장 유닛에 저장할 수 있다. 물론, 상기 전역 지도는 로봇청소기의 행 진 과정에서 위치 추적 장치에 의해 검출한 신호에 따라 동기적으로 구축할 수도 있으며, 본 발명에서 이를 한 정하지 않는다. 도 8 및 도 9에 나타낸 바와 같이, 상기 로봇청소기가 구체적으로 실내용 로봇청소기인 경우, 상기 전역 지도 는 사용자의 실내 평면도일 수 있다. 상기 전역 지도는 거실, 침실, 화장실, 주방 등과 같은 행진 영역 , 및 상기 행진 영역에 들어가거나 떠나기 위한 출입구 영역(42, 일반적으로 문이 위치하는 영역)을 포 함한다. 또한, 상기 전역 지도에는 비출입구 영역인 경계가 더 설정될 수 있다. 상기 비출입구 영역인 경계는 적용 환경에 따라 다를 수 있다. 예를 들면, 실내용 로봇청소기에 있어서 상기 비출입구 영역인 경 계는 벽일 수 있다. 상기 행진 영역은 로봇청소기가 청소할 수 있는 영역일 수 있다. 실내용 로봇청소 기에 있어서, 상기 행진 영역은 사용자의 실내 구조도에서 벽체를 제외한 영역일 수 있다. 구체적으로, 상기 행진 영역은 적어도 2개이고, 제1 행진 영역과 제2 행진 영역을 포함할 수 있다. 상기 제1 행진 영역과 상기 제2 행진 영역 사이에는 상기 출입구 영역이 설치되어 있다. 즉, 상기 출입구 영역은 주로 2개의 행진 영역의 경계 위치이다. 상기 출입구 영역은 상기 전역 지도에 따라 판단할 수 있고, 사용자 앱을 통해 지정할 수도 있다. 실내용 로봇청소기에 있어서, 상기 출입구 영역(4 2)은 주로 문의 영역을 의미한다. 로봇청소기는 청소 장치를 더 포함하고, 본 실시형태에서 청소 장치는 닦기 및/또는 세정 장치를 포함한다. 예 를 들면, 상기 로봇청소기가 바닥 청소기 또는 투인원 로봇청소기인 경우, 상기 로봇청소기에는 바닥 닦기 모듈 이 더 설치될 수 있다. 상기 바닥 닦기 모듈은 승강 장치에 의해 상기 바디에 고정될 수 있다. 바닥 닦기 모듈은 도구 없이 바디에 장착되거나 바디로부터 탈착 가능하게 설계될 수 있다. 바닥 닦기 기능을 수 행하고자 할 때에는, 상기 승강 장치에 의해 상기 바닥 닦기 모듈을 하강시킴으로써, 지면과 상호 접촉되도 록 할 수 있다. 구체적으로, 상기 바닥 닦기 모듈에서 바닥 닦기 기능을 수행하는 청소 부재는 걸레일 수 있 고, 물론 상기 바닥 닦기 모듈은 스펀지 또는 다른 형식일 수도 있으며, 본 발명은 이를 한정하지 않는다. 제어 장치는 상기 검출 장치 및 위치 추적 장치와 전기적으로 연결되고, 검출 장치, 위치 추적 장치 등 신호 획득 소자에 의해 획득한 신호를 획득한 후 획득한 신호 및 저장한 컴퓨터 수행 가능 지령에 따라 해당 제어 지령을 출력할 수 있다. 상기 제어 장치는 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기의 상기 지도에서의 위치를 결정할 수 있다. 구체적으로, 상기 제어 장치가 로봇청소기의 위치를 지도에 표시할 때, 상기 로봇청소기가 위치 추적 장 치에 의해 획득한 현재 위치 정보를 전역 지도에서 다각도로 대비함으로써 현재 로봇청소기의 지도에서의 위 치를 정확하게 결정할 수 있다. 본 실시형태에서, 상기 제어 장치는 검출 장치에 의한 검출 결과에 따라 로봇청소기의 전방 지면 특징을 인식하고, 로봇청소기의 지도에서의 위치에 따라 로봇청소기가 해당 동작을 수행하도록 제어한다. 구체적으로, 제어 장치가 검출 장치에 의한 검출 결과에 따라 로봇청소기의 전방 지면 특징을 인식하는 것은 지면 특 징이 카펫인지 여부를 인식하는 것을 포함한다. 이와 대응하게, 제어 장치가 해당 동작을 수행하도록 로봇 청소기를 제어하는 것은 로봇청소기가 카펫이 존재하는 영역에 들어가지 않거나, 카펫이 존재하는 영역을 통과 하도록 제어하는 것을 포함한다. 예를 들면, 제어 장치는 지면 특징을 카펫으로 인식한 경우, 로봇청소기의 위치 정보에 따라 로봇청소기와 출입 구 영역 사이의 거리가 제1 기설정 거리 범위 외인 것으로 판단하면, 로봇청소기가 카펫을 더럽히는 것을 방지 하기 위해 로봇청소기가 카펫이 위치하는 영역에 들어가지 않도록 제어한다. 제어 장치는 지면 특징을 카펫으로 인식한 경우, 로봇청소기의 위치 정보에 따라 로봇청소기와 출입구 영역 사 이의 거리가 제2 기설정 거리 범위 내인 것으로 판단하면, 카펫을 인식한 후 카펫이 위치하는 영역에 들어가지 않고 하나의 행진 영역에 제한되어 다른 행진 영역으로 이동하고 전역 지도 내의 모든 영역에 대한 청소 작업을 수행하지 않는 것을 방지하기 위해, 로봇청소기가 카펫이 위치하는 영역을 통과하도록 제어한다. 본 실시형태에서, 제1 기설정 거리는 50cm 내지 100cm 범위일 수 있다. 구체적으로, 상기 제1 기설정 거리의 범 위는 실제 적용 시나리오에 따라 결정될 수 있다. 예를 들면, 사용자는 일반적으로 현관에 카펫을 설치하고, 상 기 카펫의 위치는 문 근처에서 일정한 편차 범위를 가지고 있다. 이때, 문 이외 그리고 제1 기설정 거리 범위내를 카펫이 존재 가능한 영역으로 설정할 수 있다. 상기 영역 내에서 카펫이 인식되면, 로봇청소기는 상기 영 역을 통과하고 새로운 행진 영역에 들어갈 수 있다. 상기 제2 기설정 거리의 범위는 실제 적용 시나리오에 따라 결정될 수 있다. 예를 들면, 사용자는 일반적으로 현관에 카펫을 설치하고, 상기 카펫의 위치는 문 근처에서 일정한 편차 범위를 가지고 있다. 이때, 문 이외 그 리고 제2 기설정 거리 범위 내를 카펫이 존재 가능한 영역으로 설정할 수 있다. 상기 영역 내에서 카펫이 인식 되면, 로봇청소기는 상기 영역을 통과하고 새로운 행진 영역에 들어갈 수 있다. 전체적으로, 상기 제2 기설정 거리는 제1 기설정 거리와 동일할 수 있고, 50cm 내지 100cm 범위일 수 있다. 또 한, 상기 제2 기설정 거리는 제1 기설정 거리와 다를 수도 있는데, 예를 들면 문의 실제 크기에 따라 설정할 수 있고, 본 발명에서 이를 한정하지 않는다. 본 실시형태에서, 제1 기설정 거리 범위 외와 제2 기설정 거리 범위 내에는 중첩 부분이 존재한다. 본 실시형태에서, 제어 장치가 카펫이 존재하는 영역에 들어가지 않도록 로봇청소기를 제어하는 것은 로봇청소 기가 카펫을 떠나도록 하거나 카펫의 가장자리를 따라 이동하도록 제어하는 것을 포함한다. 도 5 내지 도 7은 로봇청소기가 카펫에 부딪힐 때의 몇 가지 이동 방식을 나타낸다. 도 5에 나타낸 바와 같이, 로봇청소기는 카펫 에 부딪히면 카펫의 가장자리를 따라 이동하면서 카펫의 가장자리 영역을 청소하고, 카펫의 가장자리를 따라 청 소를 수행한 후 카펫의 중지점 위치로 돌아가 계속해서 이전의 경로(예컨대, “弓”자형 경로)를 따라 이동한다. 도 6에 나타낸 바와 같이, 로봇청소기는 카펫에 부딪히면 카펫이 오염되지 않도록 카펫을 떠나는데, 구체적으로 “弓”자형 경로를 따라 백 턴한다. 도 7에 나타낸 바와 같이, 로봇청소기는 카펫에 부딪히면 카펫 을 통과하고 다음 행진 영역을 청소함으로써, 전역 지도 내의 모든 영역에 대해 청소 작업을 수행한다. 본 실시형태에서, 로봇청소기는 영역 내 이동 모드와 영역 초월 이동 모드를 포함한다. 영역 내 이동 모드에서, 제어 장치는 로봇청소기가 하나의 행진 영역 내에서 이동하면서 청소 작업을 수행하도록 제어한다. 영역 내 이 동 모드에서, 제어 장치는 지면 특징을 카펫으로 인식한 경우 로봇청소기가 카펫이 존재하는 영역에 들어가지 않도록 제어한다. 영역 내 이동 모드에서 카펫이 검출되면, 로봇청소기는 출입구 영역과의 거리를 불문하고 카 펫을 피하면서 청소 작업을 수행한다. 구체적으로, 로봇청소기는 카펫의 가장자리를 따라 이동하거나 백 턴 등 을 할 수 있다. 이에 따라, 로봇청소기는 하나의 행진 영역 내에서 지속적으로 청소 작업하게 되어 상기 행진 영역에 대한 청소 작업을 완성할 수 있다. 영역 초월 이동 모드에서, 제어 장치는 로봇청소기가 하나의 행진 영역으로부터 출입구 영역을 거쳐 다른 행진 영역에 들어가도록 제어한다. 영역 초월 이동 모드에서, 지면 특징을 카펫으로 인식하고 로봇청소기의 위치 정 보에 따라 로봇청소기와 출입구 영역 사이의 거리가 제2 기설정 거리의 범위 내인 것으로 판단한 경우, 제어 장 치는 로봇청소기가 카펫이 존재하는 영역을 통과하여 하나의 행진 영역으로부터 다른 행진 영역에 들어가도록 제어한다. 로봇청소기는 하나의 행진 영역에 대한 청소 작업을 마친 후 영역 초월 이동 모드로 돌입한다. 로봇 청소기는 자체의 위치 정보를 이용하여 지도에 따라 출입구 영역으로 이동하고 출입구 영역을 거쳐 다른 작업해 야 할 행진 영역에 들어가 작업을 수행한다. 로봇청소기는 카펫이 검출되고 로봇청소기와 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 경우, 카펫이 존재하는 영역을 통과하여 다른 행진 영역에 들어간다. 로봇청 소기는 카펫이 검출되고 로봇청소기와 출입구 영역 사이의 거리가 제1 기설정 거리 범위 외인 경우, 카펫이 존 재하는 영역에 들어가지 않는데, 구체적으로 카펫이 오염되지 않도록 카펫을 피한다. 이에 따라, 로봇청소기는 전역 지도 내의 모든 영역을 청소할 수 있을 뿐만 아니라 깨끗하고 효율적으로 청소할 수 있다. 나아가, 도 10을 참조하면, 상기 검출 장치에 의해 카펫이 검출되면 상기 제어 장치는 상기 바닥 닦기 모듈 을 상승시키도록 승강 장치를 제어하여 카펫과 접촉되는 것을 방지할 수도 있다. 특히, 로봇청소기가 카펫이 존 재하는 영역을 통과하여 다음 행진 영역에 들어가고자 할 때에는 바닥 닦기 모듈을 카펫보다 높은 위치로 상 승시켜 상기 카펫을 통과하도록 승강 장치를 제어함으로써, 바닥 닦기 모듈의 걸레가 카펫을 더럽히는 것을 방지할 수 있다. 본 실시형태에 따른 로봇청소기는 상기 검출 장치에 의한 검출 결과에 따라 전방 지면 특징을 검출할 수 있 다. 상기 로봇청소기는 행진 과정에서 위치 추적 장치에 의해 획득한 위치 정보와 로봇청소기의 작업 영역의 지 도를 통해 위치를 실시간으로 지도에 표시하고, 상기 지도에 표시한 위치에 따라 해당 동작을 수행함으로써 상 이한 기능을 구현할 수 있으므로, 지능화 정도가 높고, 사용 신뢰성이 높으며, 사용자의 종합 체험도를 크게 향 상시킬 수 있다. 구체적으로, 로봇청소기의 지도에서의 상이한 위치에 대해 다음과 같이 서로 다른 제어 동작을 수행한다. 1. 로봇청소기가 비출입구 영역(문) 근처에서 전진 방향을 따라 상기 검출 장치에 의해 카펫을 검출하면 전방 영역에 들어가지 않고, 이에 따라 카펫이 오염되는 것을 방지할 수 있다. 2. 로봇청소기가 출입구 영역(문) 근처에서 전진 방향을 따라 상기 검출 장치에 의해 카펫을 검출하면, 바닥 닦기 모듈이 상승하고 상기 로봇청소기가 전방 영역에 들어감으로써, 로봇청소기가 서로 다른 행진 영역으로 이동하여 전역 지도 내의 모든 영역에 대해 청소 작업을 수행하게 되고, 하나의 행진 영역에 제한되지 않으며, 카펫을 더럽히지 않는다. 도 11에 나타낸 바와 같이, 본 발명은 또한 로봇청소기의 제어방법을 제공한다. 구체적으로, 로봇청소기의 제어 방법은 다음과 같은 단계를 포함할 수 있다. 상기 로봇청소기의 위치 정보를 획득하고, 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기의 상기 지도에 서의 위치를 결정한다(단계 S10). 상기 로봇청소기의 검출 장치에 의한 검출 결과에 따라 상기 로봇청소기의 전방 지면 특징을 인식하고, 상 기 로봇청소기의 상기 지도에서의 위치에 따라 상기 로봇청소기가 해당 동작을 수행하도록 제어한다(단계 S12). 상기 로봇청소기의 제어방법은 전방 지면 특징에 따라 서로 다른 시나리오에 적용할 수 있다. 본 실시형태 에서는 주로 카펫을 인식하는 것을 예로 하여 설명하였으나, 다른 전방 지면 특징은 본 발명이 제공한 인식 방법에 의해 적응성 조정을 할 수 있다. 본 실시형태에서, 로봇청소기의 제어방법의 구체적인 단계는 상술한 바와 같으므로, 여기서 더 이상 설명하지 않는다. 도 12는 본 실시형태에 따른 로봇청소기의 제어방법의 흐름도이고, 도 12에서는 제1 기설정 거리와 제2 기설정 거리가 동일한 것을 예로 한다. 본 발명에서는 또한 카펫을 검출하기 위한 검출 장치 및 해당 방법을 제공한다. 도 13 내지 도 15를 참조하면, 일 실시형태에서 검출 장치는 거리 측정 센서를 포함하고, 상기 거리 측정 센 서는 TOF 센서 또는 삼각 거리 측정 센서일 수 있다. 여기서, TOF(Time of Flight) 센서는 주로 비행 시간 기술 을 통해 거리를 측정한다. 비행 시간 기술(Time of Flight)의 기본 원리는 하나의 발광 소자를 장착하고, 발광 소자가 발사한 빛이 물체 표면에 도달한 후 반사하여 되돌아오는 것이다. 하나의 특별한 CMOS 센서를 통해 상기 발광 소자로부터 발사하고 물체 표면에서 반사되어 되돌아오는 광자를 포착하기만 하면 광자의 비행 시간을 획 득할 수 있다. 광자 비행 시간에 따라 광자의 비행 거리를 예측함으로써, 물체의 높이(깊이) 정보를 획득할 수 있다. 여기서, 상기 바디는 전진 방향에서 전면을 가진 하우징을 포함할 수 있다. 상기 검출 장치는 상기 전면에 설치될 수 있다. 본 실시형태에서, 상기 검출 장치는 상기 바디에 설치되고, 상기 로봇 청소기의 전방 지면 특징을 검출한다. 상기 전방 지면 특징은 로봇청소기가 현재 위치하는 지면에 대한 돌기 특징, 또는 함몰 특징을 포함할 수 있다. 전방 지면 특징이 돌기 특징인 경우, 상기 검출 장치는 주로 행진할 전방 영역의 높이를 검출하는데, 상기 높이는 전방에 물체가 없을 때의 지면 높이, 및 전방에 물체 가 있을 때의 물체 높이를 포함한다. 상기 검출 장치는 1개일 수 있다. 상기 검출 장치가 1개인 경우, 상 기 검출 장치는 상기 전면의 중간부에 설치될 수 있다. 상기 검출 장치는 2개 또는 3개일 수도 있다. 적어도 2개의 검출 장치는 상기 전면의 측변에 분포되고 동일한 높이에 설치된다. 예를 들어, 검출 장치 가 2개인 경우 상기 2개의 검출 장치는 전면의 측변에 분포되고 동일한 높이에 설치된다. 검출 장치 가 3개인 경우, 상기 3개의 검출 장치 중의 2개는 전면의 측변에 분포되고, 1개는 상기 전면의 중간부에 위치하며, 3개의 검출 장치는 동일한 높이에 설치된다. 전면의 측변에 적어도 2개의 검출 장치 가 설치됨으로써, 로봇청소기가 서로 다른 각도로 전방 지면 특징에 들어가기 전에 전방 지면 특징 을 가장 빠르게 인식하는 효과를 달성할 수 있다. 본 실시형태에서, 상기 검출 장치는 검출 방향을 가지고 있다. 상기 검출 방향과 수직 방향 사이의 협각 (θ)은 0도 내지 90도 범위이고, 이에 따라 상기 로봇청소기가 전방 지면 특징에 들어가기 전에 전방 지면 특징을 미리 인식하고 해당 조작을 수행할 수 있게 된다. 상기 검출 장치의 장착 각도(검출 방향과 중력 방향 사이의 협각)는 0도 ~ 360도 범위 내의 임의의 각도일 수 있다. 상기 검출 장치가 전방 지면 특징을 검출할 수 있도록 확보하기 위해, 상기 검출 장치의 검 출 방향과 수직 방향 사이의 협각(θ)은 0도 내지 90도 사이여야 한다. 바람직하게, 상기 검출 장치의 장착 각도는 0도 내지 90도로, 검출 방향과 수직 방향 사이의 협각(θ)과 일치하다. 상기 검출 장치의 장착 각도 가 90도 내지 360도 범위인 경우, 반사 구조를 증가하고 광로 반사 원리를 통해 상기 검출 장치의 검출 방향과 수직 방향 사이의 협각(θ)이 0도 내지 90도 범위에 있도록 할 수 있다. 또한, 전진 방향에서 상기 바닥 닦기 모듈은 상기 전면 뒷쪽에 위치한다. 전진 방향에서 양자의 거리는 h1이다. 상기 검출 장치를 수직하게 장착하여도, 전방 지면 특징이 검출되면 제어 장치는 상기 바닥 닦 기 모듈이 상승 동작 또는 제동 동작을 수행하도록 즉시에 제어하여 상기 바닥 닦기 모듈이 전방 지면 특 징과 접촉되지 않도록 할 수 있다. 상기 제어 장치는 현재 위치하는 행진 영역에 대해 참조 높이를 확정하여 검출 장치의 높이 파라미터를 획득할 수 있다. 구체적으로, 상기 제어 장치에는 컴퓨터 실행 가능한 지령이 저장되어 있다. 획득한 신호와 저장된 컴퓨터 실행 가능한 지령에 따라 상기 검출 장치에 의해 카펫이 검출되면, 전방에 특정한 지면 특징이 존재하는 것을 의미한다. 나아가, 상기 전방 지면 특징에 대한 인식 정확도를 향상시키기 위해, 전진 방향에서 상기 검출 장치에 의해 기설정된 값을 초과한 돌기가 검출되고 상기 돌기의 길이가 기설정된 길이를 초과한 것을 검출하면, 전방 에 전방 지면 특징이 존재한 것을 의미한다. 여기서, 전진 방향에서 상기 검출 장치에 의해 상기 돌기의 길이를 검출할 때에는 기설정된 값을 초과한 돌기가 검출된 시간과 상기 로봇청소기 자체의 행진 속도에 따라 상기 돌기의 길이를 결정한 후 상기 결정된 돌기의 길이와 기설정된 길이를 대비함으로써, 검출된 돌기의 길이 가 기설정된 길이를 초과하는지 여부를 판단한다. 물론, 상기 검출 장치는 전진 방향에서 돌기의 길이를 직 접 측정하는 기능을 구비하여 검출한 돌기의 길이와 기설정된 길이를 대비함으로써 검출한 돌기의 길이가 기설 정된 길이를 초과하는지 여부를 판단할 수도 있다. 물론, 전진 방향에서 돌기의 길이를 검출하는 방식은 상술한 예에 제한되지 않고, 본 발명에서 이를 한정하지 않는다. 일 실시형태에서, 상기 검출 장치는 상기 로봇청소기와 상기 지면 사이의 거리를 검출함으로써 상기 지면의 높이를 나타내는 높이 파라미터를 획득하고, 상기 제어 장치는 상기 높이 파라미터와 기설정된 값의 대비 결과 에 따라 상기 지면 특징을 인식한다. 본 실시형태에서, 상기 높이 파라미터는 높이 또는 검출 방향의 거리값을 포함할 수 있다. 높이 파라미터가 높 이 값인 경우, 구체적으로 전방 지면 특징의 최고점과 참조 지면의 높이 차이값(ΔH)일 수 있다. 높이 파라 미터가 검출 방향의 거리값인 경우, 구체적으로 검출 방향의 거리 참고치(L)와 실제 측정한 거리값(L1)의 차이 값(ΔL)일 수 있다. 여기서, ΔH=ΔL×COSθ이며, ΔH와 기설정된 값을 대비하는 방식을 채택하면 상기 기설정된 값은 구체적으로 기설정된 높이이고, 상기 ΔH가 상기 기설정된 높이값을 초과하면 전방 지면 특징이 인식된 것을 의미한다. 또한, ΔL과 기설정된 값을 대비하는 방식을 채택하면 상기 기설정 값은 기설정된 거리값이고, 상기 ΔL이 상기 기설정된 거리 값을 초과하면 전방 지면 특징이 인식된 것을 의미한다. 상기 기설정된 값이 기설정된 거리 값인 경우, 상기 검출 장치는 수직 방향과 일정한 협각을 이루면서 바디에 경사지게 설치된다. 하기 실시형태에서는 주로 높이값을 예로 하여 설명한다. 검출 방향의 거리값은 상기 높이값을 참조하여 유추할 수 있으므로 본 발명에서 더 이상 설명하지 않는다. 구체적으로, 상기 기설정된 값은 제1 기설정 값을 포함하고, 상기 검출 장치에 의해 상기 지면 특징의 높이 값이 제1 기설정 값보다 큰 것을 검출하면 상기 제어 장치는 전방 지면 특징을 카펫으로 인식한다. 일반적 으로, 사용자의 실내 지면은 평탄도가 양호한 바닥, 타일 등이다. 로봇청소기가 전방 지면 특징이 존재하는 행진 영역에 위치할 때, 상기 제1 기설정 값은 전방 지면 특징의 높이(또는 높이 방향에서의 사이즈)에 따라 결정될 수 있다. 예를 들면, 상기 전방 지면 특징이 카펫인 경우, 일반적인 카펫 두께는 5mm 이상이고, 상기 제1 기설정 값은 5mm로 설정할 수도 있다. 또한, 카펫은 일반적으로 일정한 크기를 가지고 있고, 상기 크기는 카펫의 형상과 위치에 따라 결정될 수 있으 며, 본 발명에서 이를 한정하지 않는다. 그러나, 카펫의 크기는 상기 로봇청소기의 행진 방향에서 적어도 기설 정된 길이를 가지고 있다. 따라서, 제어 장치에 상기 기설정 길이가 저장되어 있을 수 있고, 상기 기설정 길이 는 예컨대 2cm일 수 있다. 본 실시형태에 따른 로봇청소기가 바닥 닦기 모드에서 상기 검출 장치에 의해 전진 방향을 따라 비출입구 영 역(문) 근처에서 제1 기설정 값을 초과한 돌기가 검출되면 전방 지면 특징(44, 예컨대 카펫)이 인식된 것을 의 미한다. 나아가, 상기 전방 지면 특징에 대한 인식 정확도를 향상시키기 위해, 전진 방향에서 상기 검출 장치에 의해 제1 기설정 값을 초과한 돌기가 검출되고 상기 돌기의 길이가 기설정된 길이를 초과하면, 전방에 전방 지면 특징이 존재하는 것을 의미한다. 본 발명에 따른 로봇청소기는 주로 전방 지면 특징의 물리적 크기에 따라 전방 지면 특징을 인식함으로 써, 기존 기술의 다른 인식 방식에 비해 인식 신뢰성이 더 높고 가상 금지 구역을 설정할 필요가 없어 사용자의 사용 체험도를 크게 향상시킬 수 있다. 또한, 본 발명에 따른 로봇청소기는 다른 위치에서 전방 지면 특징이 인식되면 이에 대응하게 상이한 동작 을 수행할 수도 있다. 현재 행진할 영역이 함몰 영역인 경우, 본 발명에 따른 로봇청소기는 추락 방지 기능을 구비한다. 상기 기설정된 값은 제2 기설정 값을 포함하고, 상기 검출 장치에 의해 상기 지면 특징의 높이 파라미터 가 상기 제2 기설정 값보다 작은 것을 검출하면, 상기 제어 장치는 상기 지면 특징을 벼랑으로 인식하고 상 기 로봇청소기가 상기 벼랑이 존재하는 영역으로 들어가지 않도록 제어한다. 본 실시형태에서, 상기 제2 기설정 값은 주로 현재 행진할 영역의 함몰 정도를 평가하기 위한 것이다. 구체적으 로, 상기 제2 기설정 값은 0보다 작은 마이너스 수치일 수 있다. 상기 제2 기설정 값은 구체적으로 상기 로봇청 소기 자체의 성능(예컨대, 장애물 통과 능력)에 따라 결정될 수 있는데, 예컨대 -15cm일 수 있고, 물론 다른 수 치일 수도 있으며, 본 발명에서 이를 한정하지 않는다. 상기 높이 파라미터가 상기 제2 기설정 값보다 작으면, 상기 로봇청소기가 추락한 후 정상적으로 작업할 수 없는 위험이 있는 것을 의미한다. 또한, 전역 지도를 참조하면, 전역 지도는 비출입구 영역의 경계를 더 포함하고, 현재 위치와 상기 경계 사이의 거리가 제3 기설정 거리 내인 것으로 판단하면 상기 검출 장치를 차폐하고 상기 로봇청소기 가 계속 작업하도록 제어한다. 본 실시형태에서, 상기 경계는 벽체일 수 있고, 이하에서는 주로 벽체를 예로 하여 설명한다. 상기 제3 기 설정 거리는 5cm일 수 있으나 이에 제한되지 않고, 본 발명에서 이를 한정하지 않는다. 상기 로봇청소기가 벽체 로부터 제3 기설정 거리 이내의 거리 떨어진 위치로 이동한 경우, 상기 로봇청소기가 벽체를 전방 지면 특징 으로 인식하여 더 이상 접하지 않는 것을 방지하기 위해 상기 검출 장치를 차폐한다. 상기 검출 장치 가 차폐되면, 상기 로봇청소기는 계속 앞으로 행진하여 벽체 모서리를 청소한다. 본 실시형태에서, 상기 검출 장치는 작업하기 전에 일반적으로 높이 파라미터를 확정해야 한다. 본 실시형태에서, 로봇청소기가 행진하도록 제어하기 전에 현재 위치하는 행진 영역에 대해 참조 높이를 확 정하여 검출 장치의 높이 파라미터를 획득할 수 있다. 구체적으로, 상기 검출 장치의 높이 파라미터를 획 득하는 것은 주로 동일한 행진 영역 내의 전방 지면 특징의 높이를 계산하는 데 대비 참조를 제공하기 위한 것이고, 구체적으로 상기 전방 지면 특징의 높이를 측정하는 데 초기 계산 기준을 제공하기 위한 것이다. 상기 높이 파라미터는 상기 검출 방향의 거리 참고치(L)를 포함할 수 있고, 물론 상기 높이 파라미터는 수직 방 향의 높이 참고치(H)일 수도 있다. 구체적으로, 상기 높이 파라미터를 확정할 때, 높이 파라미터가 거리 참고치 (L)인 것을 예로 하여 로봇청소기가 참조면에 평행하게 정지된 경우의 N조의 데이터를 획득하고 상기 N조의 데 이터의 평균치를 거리 참고치(L)로 설정할 수 있다. 상기 확정을 수행하는 시점은 서로 다른 적용 시나리오에 따라 다를 수 있다. 예를 들면, 검출의 정확도를 향상 시키기 위해, 로봇청소기가 기지국으로 복귀할 때마다 기지국에서 자동적으로 확정하거나, 기지국을 떠날 때마 다 기지국 근처에서 먼저 확정한 다음 작업하거나, 로봇청소기가 작동된 후 먼저 자동적으로 확정하거나, 로봇 청소기가 지도 내의 서로 다른 영역에 들어간 후 먼저 확정한 다음 작업하거나, 바닥 닦기 모듈을 교체한 후, 또는 바닥 닦기 모듈을 상승시킨 후, 또는 로봇청소기가 장애물에서 벗어난 후에 확정할 수도 있다. 본 실시형태에서, 제어 장치에 의해 전방 지면 특징이 카펫인지 여부를 판단하는 경우, 거리 참고치(L)와 실제 측정한 거리값(L1)을 상쇄하여 ΔL을 얻는다. ΔL>0인 경우, 상대 참조지가 돌기인 것을 의미하고, 돌기의 수직거리는 ΔH=ΔL×COSθ이다. ΔL<0인 경우, 상대 참조지가 함몰인 것을 의미하고, 함몰의 거리는 ΔH=ΔL×COSθ이다. 돌기가 기설정된 값(예컨대, 5mm)보다 크면, 전방 지면 특징(44, 카펫)이 인식된 것을 의미한다. 상기 기설정 값을 5mm로 결정하는 것은 주로 대부분 카펫의 실제 높이가 모두 5mm보다 크고, 가정의 지면 기복 이 5mm보다 작은 것을 고려한 것이고, 동시에 기존 센서의 가성비를 고려하여 적절히 선택한 것이다. 함몰이 장 애물 통과 높이보다 작으면, 로봇청소기가 진입하지 않는다. 본 발명에 따른 로봇청소기는 주로 전방 지면 특징의 물리적 크기에 따라 전방 지면 특징을 인식하므로, 기존 기술의 다른 인식 방식에 비해 사용 시 카펫을 비롯한 전방 지면 특징을 정확하게 인식할 수 있을 뿐만 아니라, 가상 금지 구역을 설정할 필요가 없다. 로봇청소기와 상기 경계 사이의 거리가 일정 거리 내인 경우, 상기 검출 장치를 차폐하여 상기 로봇청소 기가 계속 청소하도록 제어함으로써, 로봇청소기가 경계 모서리를 사각지대 없이 깨끗하게 청소할 수 있도 록 한다. 로봇청소기는 전방 지면 특징을 벼랑으로 인식한 경우, 상기 벼랑이 존재하는 영역에 들어가지 않아 추락을 방지할 수 있다. 나아가, 상기 검출 장치의 장착 각도를 제어함으로써, 일정한 거리를 앞당겨 전방 지면 특징을 사전에 인식할 수 있어, 상기 로봇청소기가 전방 영역(문이 아닌 곳의 카펫, 벼랑 등)에 들어가는 것을 더욱 효과적으 로 방지할 수 있다. 물론, 본 실시형태에 따른 로봇청소기는 카펫과 같은 전방 지면 특징을 인식할 수 있을 뿐만 아니라 실제 요구에 따라 제1 기설정 값과 기설정된 길이의 값을 조정하여 다른 크기의 전방 지면 특징을 인식할 수 있 으며, 본 발명에서 일일이 설명하지 않는다. 본 실시형태에서, 로봇청소기가 행진하도록 제어하기 전에 현재 위치하는 행진 영역에 대해 참조 높이를 확 정하여 검출 장치의 높이 파라미터를 획득할 수 있다. 구체적으로, 상기 검출 장치의 높이 파라미터를 획 득하는 것은 주로 동일한 행진 영역 내의 전방 지면 특징의 높이를 계산하는 데 대비 참조를 제공하기 위한 것이고, 구체적으로 상기 전방 지면 특징의 높이를 측정하는 데 초기 계산 기준을 제공하기 위한 것이다. 본 발명에서, 상기 검출 장치는 상기 로봇청소기와 상기 전방 지면 특징 사이의 거리를 검출함으로써 전 방 지면 특징의 높이를 나타내는 높이 파라미터를 획득하고, 상기 제어 장치는 상기 높이 파라미터와 기설 정된 값의 대비 결과에 따라 전방 지면 특징을 인식한다. 이후, 제어 장치는 상기 지도에 표시한 상기 로봇 청소기의 위치에 따라 상기 로봇청소기가 해당 동작을 수행하도록 제어한다. 본 실시형태에서, 상기 로봇청소기와 상기 출입구 영역 사이의 거리가 제1 기설정 거리보다 큰 경우, 전진 방향에서 상기 검출 장치에 의해 제1 기설정 값을 초과한 돌기가 검출되면 전방 지면 특징이 카펫인 것 을 의미한다. 나아가, 상기 전방 지면 특징의 인식 정확도를 향상시키기 위해, 상기 돌기의 지속 거리에 따라 판단할 수 있다. 구체적으로, 제1 기설정 값을 초과한 돌기가 검출되고 돌기의 길이가 제1 기설정 길이를 초과하면 전방 지면 특징이 인식된 것을 의미한다. 본 실시형태에 따른 로봇청소기가 바닥 닦기 모드에서 상기 검출 장치에 의해 전진 방향을 따라 비출입구 영 역(문) 근처에서 제1 기설정 값(예컨대 5mm)을 초과한 돌기가 검출되고, 상기 돌기의 지속 거리가 기설정된 길 이(예컨대 2cm)를 초과하면, 전방 지면 특징(44, 예컨대 카펫)이 인식된 것을 의미한다. 본 발명에 따른 로봇청 소기는 주로 전방 지면 특징의 물리적 크기에 따라 전방 지면 특징을 인식함으로써, 기존 기술의 다른 인식 방식에 비해 사용 시 전방 지면 특징(44, 예컨대 카펫)을 인식할 수 있고, 인식 신뢰성이 더 높으며, 가상 금지 구역을 설정한 필요가 없고, 사용자의 사용 체험도를 크게 향상시킬 수 있다. 상기 제어 장치가 상기 로봇청소기의 위치 정보에 따라 상기 로봇청소기와 상기 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단한 경우, 상기 로봇청소기가 상기 카펫이 존재하는 영역을 통과하도록 제어 한다. 이하, 문을 예로 하여 상기 출입구 영역을 설명한다. 즉, 로봇청소기가 문 근처에서 카펫을 검출하면 상기 로봇청소기가 상기 카펫이 존재하는 영역을 통과하도록 제어한다. 구체적으로, 상기 검출 장치에 의해 상기 지면 특징의 높이가 제1 기설정 값보다 크고, 상기 제어 장치 가 상기 지면 특징을 카펫으로 인식한 경우, 상기 제어 장치는 상기 로봇청소기의 위치 정보에 따라 상기로봇청소기와 상기 출입구 영역 사이의 거리가 제2 기설정 거리 범위 내인 것으로 판단하면 상기 로봇청소기가 상기 카펫이 존재하는 영역을 통과하도록 제어한다. 2개의 행진 영역의 경계의 위치가 대응하는 지면 높이는 다를 수 있다. 이때, 검출 장치가 잘못 판단하 는 것을 방지하는 동시에 상기 로봇청소기가 서로 다른 행진 영역에 원활하게 출입하여 전체 작업 영역을 청소할 수 있도록 하기 위해, 상기 출입구 영역으로부터 제2 기설정 거리 범위 내에서 전방 지면 특징 이 검출되어도 로봇청소기가 상기 전방 지면 특징이 존재하는 영역을 통과하도록 제어한다. 여기서, 상기 제1 기설정 값은 상기 전방 지면 특징의 높이에 따라 현재 상기 검출 장치의 높이 파라미 터를 통해 종합적으로 결정될 수 있다. 여기서, 상기 검출 장치가 위치하는 현재 영역의 지면을 영점으로 하 여 계산할 때 상기 제1 기설정 값은 전방 지면 특징의 높이보다 작거나 동일하다. 일반적으로, 로봇청소기 는 장애물 통과 높이를 가지고 있고, 상기 검출 장치가 위치하는 현재 영역의 지면을 영점으로 하여 계산할 때 상기 제1 기설정된 높이는 로봇청소기의 최대 장애물 통과 높이보다 작다. 나아가, 상기 로봇청소기의 제어방법은 전진 방향에서 기설정된 값을 초과한 돌기가 검출되면 바닥 닦기 모듈 을 상승시키는 것을 더 포함할 수 있다. 상기 바닥 닦기 모듈은 구체적으로 걸레 또는 스펀지 등일 수 있 고, 물론 다른 형식일 수도 있으며, 본 발명에서 이를 한정하지 않는다. 이하, 주로 걸레를 예로 하여 설명한다. 상기 걸레의 상승 높이는 적어도 기설정된 값과 일치해야 제어 장치의 지령에 따라 해당 동작을 수행 하는 데 더욱 유리할 수 있다. 예를 들면, 상기 전방 지면 특징을 통과하고자 할 때, 상기 바닥 닦기 모듈 을 상승시킨 후 상기 전방 지면 특징을 통과할 수 있다. 상기 전방 지면 특징을 피해야 할 때, 상기 걸레를 상승시킴으로써 로봇청소기의 이동 경로를 재구성하는 데 유리할 수도 있다. 또한, 상기 로봇청소기의 제동이 실효되거나 경로 재구성에 오류 발생시, 걸레와 카펫이 직접 접촉되는 것을 방지할 수도 있다. 일 실시형태에서, 상기 검출 장치는 검출 방향을 가지고 있고, 상기 검출 장치의 높이 파라미터는 상기 검출 방향의 거리 참고치(L)를 포함하며, 상기 검출 방향과 수직 방향의 협각은 θ이다. 상기 지면 특징의 높이(ΔH)의 계산 공식은 ΔH=ΔL×COSθ이다. 여기서, ΔL은 거리 참고치(L)와 검출 방향에서 실제 측정한 거리(L1)의 차이값이다. 예를 들면, 거리 참고치(L)=50mm인 경우, 실제 측정한 거리값(L1)=38mm이고, θ=38°이며, 기설정 값이 6mm이고, ΔH=ΔL×COSθ=12×COS38°=9.5mm이다. ΔH가 기설정된 값보다 크므로, 전방 지면 특징(44, 카펫)이 인식된 것으로 판단한다. 일 실시형태에서, 상기 검출 방향과 수직 방향의 협각(θ)은 0도 내지 90도 범위이다. 본 실시형태에서, 전방 지면 정보를 사전에 예측하기 위해, 상기 검출 장치는 TOF 검출 장치와 같은 수직이 아닌 다른 각도로 장 착 가능한 검출 장치를 사용할 수 있다. 상기 검출 장치 전체를 아래로 치우치게 장착하는 경우, 검측하 는 거리는 일정한 거리(N)를 앞당길 수 있어, 제동 거리를 확보할 수 있을 뿐만 아니라 벽체를 효과적으로 인식 할 수도 있다. 예를 들면, N=5cm인 경우 벽으로부터 5cm 내인 거리에서 검출 장치를 차폐하여 벽체를 카펫으 로 잘못 인식하는 것을 방지할 수 있다. 일 실시형태에서, 로봇청소기는 장애물 통과 기능을 더 포함한다. 이에 대응하게, 상기 로봇청소기의 제어방법 은 전진 방향에서 상기 검출 장치에 의해 현재 행진할 영역에 최대 장애물 통과 높이를 초과한 돌기 또는 함 몰이 존재하는 것이 검출되면 상기 로봇청소기가 전방의 행진할 영역에 들어가지 않도록 제어하는 것을 더 포함 할 수 있다. 여기서, 상기 최대 장애물 통과 높이는 15mm일 수 있다. 물론, 로봇청소기의 유형 및 크기가 다른 경우, 실제 요구에 따라 상기 최대 장애물 통과 높이를 조정할 수 있고, 본 발명에서 이를 한정하지 않는다. 현재 행진할 영역이 함몰 영역인 경우, 본 발명에 따른 로봇청소기는 추락 방지 기능을 구비한다. 하나의 구체적인 실시형태에서, 상기 기설정 값은 제2 기설정 값을 포함한다. 상기 검출 장치에 의해 상기 지면 특징의 높이가 상기 제2 기설정 값보다 작은 것을 검출하면, 상기 제어 장치는 상기 지면 특징을 벼랑 으로 인식하고 상기 로봇청소기가 상기 벼랑이 존재하는 영역에 들어가지 않도록 제어한다. 여기서, 제2 기설정 값은 상기 로봇청소기의 실시형태에서 설명한 내용을 참조할 수 있으므로, 본 발명에서 더 이상 설명하지 않는 다. 전역 지도를 참조하면, 상기 전역 지도는 비출입구 영역의 경계를 더 포함하고, 상기 방법은 현재 위 치와 상기 경계 사이의 거리가 제3 기설정 거리 내인 것으로 판단하면 상기 검출 장치를 차폐하는 것을더 포함한다. 본 실시형태에서, 상기 경계는 벽체일 수 있고, 이하에서는 주로 벽체를 예로 하여 설명한다. 상기 제3 기 설정 거리는 5cm일 수 있으나 이에 제한되지 않고, 본 발명에서 이를 한정하지 않는다. 상기 로봇청소기가 벽체 와 제3 기설정 거리 떨어진 위치로 이동한 경우, 상기 로봇청소기가 벽체를 전방 지면 특징으로 인식하여 더 이상 접근하지 않는 것을 방지하기 위해 상기 검출 장치를 차폐한다. 상기 검출 장치가 차폐되면, 상 기 로봇청소기는 계속 앞으로 행진하여 벽체 모서리를 청소한다. 하나의 주요한 적용 시나리오에서, 쓰리인원(닦기, 쓸기, 흡진) 로봇청소기는 자동 충전 기능을 구비하고, 그 충전 기지국은 일반적으로 문과 떨어진 위치에 설치된다. 따라서, 작업 시 상기 로봇청소기의 초기 위치는 일반 적으로 문에 근접한 곳에 있지 않는다. 상기 로봇청소기가 작동한 후 전진 방향에서 상기 검출 장치에 의해 기설정된 값(예컨대, 5mm)을 초과한 돌기를 검출하고 상기 돌기의 지속 거리가 기설정된 길이(예컨대, 2cm)를 초과하면, 전방 지면 특징(44, 예컨대 카펫)이 인식된 것을 의미한다. 본 발명에 따른 로봇청소기는 주로 전방 지면 특징의 물리적 크기에 따라 전방 지면 특징을 인식함으로써, 기존 기술의 다른 인식 방식에 비해 사용 시 카펫을 인식할 수 있고, 인식 신뢰도가 높으며, 가상 금지 구역을 설정할 필요가 없고, 사용자의 사용 체험도를 크게 향상시킬 수 있다. 본 발명에서, “제1”, “제2” 등 용어는 목적을 설명하고 유사한 대상을 구분하기 위한 것일 뿐 선후 순서의 의미를 가지고 있지 않으며, 상대적 중요성을 암시하거나 명시하는 것으로 이해해서는 안된다. 또한, 본 발명에 서 특별히 정의하지 않는 한 “복수개”는 2개 또는 2개 이상을 의미한다. 상기 각 실시형태는 모두 점진 방식으로 설명한 것이고, 각 실시형태의 유사한 부분은 서로 참조할 수 있으며, 각 실시형태에서 중점적으로 설명한 것은 모두 다른 실시형태와 다른 것이다. 상술한 바와 같이 본 발명의 일부 실시형태를 설명하였으나, 상기 내용은 본 발명의 실시형태를 쉽게 이해하기"}
{"patent_id": "10-2022-7006604", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "위한 것에 불과하고 본 발명을 한정하기 위한 것이 아니다. 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 발명이 개시한 정신 및 범위 내에서 실시형태를 수정하거나 변형할 수 있으나, 본 발명의 특허보호범위 는 여전히 첨부된 청구의 범위에 의해 정해져야 한다."}
{"patent_id": "10-2022-7006604", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하, 도면과 실시형태에 의해 본 발명을 더욱 상세하게 설명한다. 도 1 및 도 2는 본 발명의 일 실시형태에 따른 로봇청소기의 구조 모식도이다. 도 3 및 도 4는 본 발명의 일 실시형태에 따른 로봇청소기의 작업 시나리오의 모식도이다. 도 5 ~ 도 7은 본 발명의 실시형태에 따른 로봇청소기가 카펫을 인식한 후의 주행 방식의 모식도이다. 도 8 및 도 9는 본 발명의 일 실시형태에 따른 전역 지도의 모식도이다. 도 10은 본 발명의 일 실시형태에 따른 바닥 닦기 모듈이 상승하는 모식도이다.도 11은 본 발명의 일 실시형태에 따른 로봇청소기의 제어방법의 흐름도이다. 도 12는 본 발명의 일 실시형태에 따른 로봇청소기의 제어방법의 흐름도이다. 도 13은 본 발명의 다른 실시형태에 따른 로봇청소기의 구조 모식도이다. 도 14는 도 13의 실시형태에 따른 로봇청소기가 카펫을 인식하는 모식도이다. 도 15는 도 13의 실시형태에 따른 로봇청소기의 전진 방향 측의 검출 장치의 분포 모식도이다."}
