{"patent_id": "10-2022-7033015", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0158720", "출원번호": "10-2022-7033015", "발명의 명칭": "다중 빔 다운링크 및 업링크 무선 시스템을 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "파라그 에마드 나데르"}}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 장치(user equipment; UE)에 있어서,송수신부로서,하나 이상의 송신 설정 인디케이션(transmission configuration indication; TCI) 상태 및 상응하는 TCI 상태식별자(identifier; ID)에 대한 설정 정보, 및하나 이상의 TCI 상태 ID를 수신하도록 설정된, 상기 송수신부; 및상기 송수신부에 동작 가능하게 연결된 프로세서를 포함하며, 상기 프로세서는 상기 하나 이상의 TCI 상태 ID에기초하여,각각 다운링크 채널의 하나 이상의 계층의 수신을 위한 하나 이상의 제1 공간 도메인 필터, 및각각 업링크 채널의 하나 이상의 계층의 송신을 위한 하나 이상의 제2 공간 도메인 필터 중 적어도 하나를 결정하도록 설정되며,상기 송수신부는 상기 하나 이상의 제1 공간 도메인 필터를 각각 사용하여 상기 다운링크 채널의 하나 이상의계층을 수신하고,상기 하나 이상의 제2 공간 도메인 필터를 각각 사용하여 상기 업링크 채널의 하나 이상의 계층을 송신하도록더 설정되는, UE."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 하나 이상의 제1 공간 도메인 필터 및 상기 하나 이상의 제 2 공간 도메인 필터는 계층, 계층의 그룹, 코드워드, 및 기준 신호 안테나 포트 중 적어도 하나의 수신기 공간 도메인 필터 및 송신기 공간 도메인 필터에각각 적용되고,상기 하나 이상의 TCI 상태 ID의 TCI 상태 ID는 다운링크 또는 업링크 채널의 하나 이상의 계층 중 제1 계층에대한 동적 시그널링을 통해 지시되고, 상기 하나 이상의 TCI 상태 ID의 TCI 상태 ID는 상기 다운링크 또는 업링크 채널의 하나 이상의 계층 중 제2 계층에 대해 상기 UE에 의해 결정되는, UE."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,제어 채널의 하나 이상의 TCI 상태는,데이터를 상기 UE로 전달하거나 상기 UE로부터 데이터를 전달하는 상기 다운링크 또는 업링크 채널의 상기 하나이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 지시되고,데이터를 상기 UE로 전달하거나 상기 UE로부터 데이터를 전달하는 상기 다운링크 또는 업링크 채널의 상기 하나이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해 결정되며,검색 공간에는 하나 이상의 제어 자원 세트(control resource set; CORESET)가 설정되고, 상기 하나 이상의CORESET 중 하나의 CORESET에는 데이터를 전달하는 상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는TCI 상태에 기초하여 하나 이상의 TCI 상태가 설정되는, UE."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,공개특허 10-2022-0158720-3-상기 업링크 채널의 상기 하나 이상의 계층의 TCI 상태는,상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 지시되고,상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해 결정되는, UE."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,제2 구성 요소 반송파 상의 채널의 하나 이상의 계층의 TCI 상태는,제1 구성 요소 반송파 상의 채널의 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 지시되고,제1 구성 요소 반송파 상의 채널의 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해결정되는, UE."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "기지국(base station; BS)에 있어서,하나 이상의 송신 설정 인디케이션(transmission configuration indication; TCI) 상태 및 상응하는 TCI 상태식별자(identifier; ID)에 대한 설정 정보를 송신하도록 설정된 송수신부; 및상기 송수신부에 동작 가능하게 연결된 프로세서를 포함하며, 상기 프로세서는,각각 다운링크 채널의 하나 이상의 계층에 대한 하나 이상의 제1 TCI 상태, 및각각 업링크 채널의 하나 이상의 계층에 대한 하나 이상의 제2 TCI 상태 중 적어도 하나를 결정하며;상기 하나 이상의 제1 TCI 상태 및 상기 하나 이상의 제2 TCI 상태 중 적어도 하나에 상응하는 다수의 TCI 상태ID를 생성하도록 설정되며,상기 송수신부는,상기 다수의 TCI 상태 ID를 송신하고;상기 하나 이상의 제1 TCI 상태에 각각 상응하는 하나 이상의 제1 공간 도메인 필터를 각각 사용하여 상기 다운링크 채널의 하나 이상의 계층을 송신하고,상기 하나 이상의 제2 TCI 상태에 각각 상응하는 하나 이상의 제2 공간 도메인 필터를 각각 사용하여 상기 업링크 채널의 하나 이상의 계층을 수신하도록 더 설정되는, BS."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 하나 이상의 제1 공간 도메인 필터 및 상기 하나 이상의 제 2 공간 도메인 필터는 계층, 계층의 그룹, 코드워드, 및 기준 신호 안테나 포트 중 적어도 하나의 송신기 공간 도메인 필터 및 수신기 공간 도메인 필터에각각 적용되고,상기 하나 이상의 TCI 상태 ID의 TCI 상태 ID는 다운링크 또는 업링크 채널의 하나 이상의 계층 중 제1 계층에대한 동적 시그널링을 통해 지시되고, 상기 하나 이상의 TCI 상태 ID의 TCI 상태 ID는 상기 다운링크 또는 업링크 채널의 하나 이상의 계층 중 제2 계층에 대해 사용자 장치(user equipment; UE)에 의해 결정되는, BS."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,제어 채널의 하나 이상의 TCI 상태는,데이터를 상기 UE로 전달하거나 상기 UE로부터 데이터를 전달하는 상기 다운링크 또는 업링크 채널의 상기 하나이상의 계층에 상응하는 TCI 상태에 기초하여 상기 사용자 장치(user equipment; UE)에 지시되고,데이터를 상기 UE로 전달하거나 상기 UE로부터 데이터를 전달하는 상기 다운링크 또는 업링크 채널의 상기 하나공개특허 10-2022-0158720-4-이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해 결정되며,검색 공간에는 하나 이상의 제어 자원 세트(control resource set; CORESET)가 설정되고, 상기 하나 이상의CORESET 중 하나의 CORESET에는 데이터를 전달하는 상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는TCI 상태에 기초하여 하나 이상의 TCI 상태가 설정되는, BS."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서,상기 업링크 채널의 상기 하나 이상의 계층의 TCI 상태는,상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 사용자 장치(userequipment; UE)에 지시되고,상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해 결정되는, BS."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6 항에 있어서,제2 구성 요소 반송파 상의 채널의 하나 이상의 계층의 TCI 상태는,제1 구성 요소 반송파 상의 채널의 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 사용자 장치(userequipment; UE)에 지시되고,제1 구성 요소 반송파 상의 채널의 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해결정되는, BS."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "사용자 장치(user equipment; UE)의 방법에 있어서,하나 이상의 송신 설정 인디케이션(transmission configuration indication; TCI) 상태 및 상응하는 TCI 상태식별자(identifier; ID)에 대한 설정 정보를 수신하는 단계;하나 이상의 TCI 상태 ID를 수신하는 단계;상기 하나 이상의 TCI 상태 ID에 기초하여 각각 다운링크 채널의 하나 이상의 계층의 수신을 위한 하나 이상의제1 공간 도메인 필터, 및각각 업링크 채널의 하나 이상의 계층의 송신을 위한 하나 이상의 제2 공간 도메인 필터 중 적어도 하나를 결정하는 단계; 및상기 하나 이상의 제1 공간 도메인 필터를 각각 사용하여 상기 다운링크 채널의 하나 이상의 계층을 수신하는단계, 및상기 하나 이상의 제2 공간 도메인 필터를 각각 사용하여 상기 업링크 채널의 하나 이상의 계층을 송신하는 단계 중 적어도 하나를 결정하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 하나 이상의 제1 공간 도메인 필터 및 상기 하나 이상의 제 2 공간 도메인 필터는 계층, 계층의 그룹, 코드워드, 및 기준 신호 안테나 포트 중 적어도 하나의 수신기 공간 도메인 필터 및 송신기 공간 도메인 필터에각각 적용되고,상기 하나 이상의 TCI 상태 ID의 TCI 상태 ID는 다운링크 또는 업링크 채널의 하나 이상의 계층 중 제1 계층에대한 동적 시그널링을 통해 지시되고, 상기 하나 이상의 TCI 상태 ID의 TCI 상태 ID는 상기 다운링크 또는 업링크 채널의 하나 이상의 계층 중 제2 계층에 대해 상기 UE에 의해 결정되는, 방법."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2022-0158720-5-제 11 항에 있어서,제어 채널의 하나 이상의 TCI 상태는,데이터를 상기 UE로 전달하거나 상기 UE로부터 데이터를 전달하는 상기 다운링크 또는 업링크 채널의 상기 하나이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 지시되고,데이터를 상기 UE로 전달하거나 상기 UE로부터 데이터를 전달하는 상기 다운링크 또는 업링크 채널의 상기 하나이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해 결정되며,검색 공간에는 하나 이상의 제어 자원 세트(control resource set; CORESET)가 설정되고, 상기 하나 이상의CORESET 중 하나의 CORESET에는 데이터를 전달하는 상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는TCI 상태에 기초하여 하나 이상의 TCI 상태가 설정되는, 방법."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 11 항에 있어서,상기 업링크 채널의 상기 하나 이상의 계층의 TCI 상태는,상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 지시되고,상기 다운링크 채널의 상기 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해 결정되는, 방법."}
{"patent_id": "10-2022-7033015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 11 항에 있어서,제2 구성 요소 반송파 상의 채널의 하나 이상의 계층의 TCI 상태는,제1 구성 요소 반송파 상의 채널의 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 지시되고,제1 구성 요소 반송파 상의 채널의 하나 이상의 계층에 상응하는 TCI 상태에 기초하여 상기 UE에 의해결정되는, 방법."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 4G 시스템 이후 보다 높은 데이터 전송률을 지원하기 위한 5G 통신 시스템을 IoT 기술과 융합하는 통 신 기법 및 그 시스템에 관한 것이다. 본 개시는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스 (예 를 들어, 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 헬스 케어, 디지털 교육, 소매업, (뒷면에 계속)"}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 무선 통신 시스템에 관한 것으로서, 보다 상세하게는 본 개시는 다중 빔 다운링크 및 업 링크 무선 시스템에 관한 것이다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시 스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 4G 네트워크 이후 (Beyond 4G Network) 통신 시스템 또는 LTE 시스템 이후 (Post LTE) 이후의 시스템이라 불리어지고 있다. 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파(mmWave) 대역 (예를 들어, 60기가(60GHz) 대역과 같은)에서의 구현이 고려되고 있다. 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대 배열 다 중 입출력(massive MIMO), 전차원 다중입출력(Full Dimensional MIMO: FD-MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 및 대규모 안테나 (large scale antenna) 기술들이 논의되 고 있다. 또한 시스템의 네트워크 개선을 위해, 5G 통신 시스템에서는 진화된 소형 셀, 개선된 소형 셀 (advanced small cell), 클라우드 무선 액세스 네트워크 (cloud radio access network: cloud RAN), 초고밀도 네트워크 (ultra-dense network), 기기 간 통신 (Device to Device communication: D2D), 무선 백홀 (wireless backhaul), 이동 네트워크 (moving network), 협력 통신 (cooperative communication), CoMP (Coordinated Multi-Points), 및 수신 간섭제거 (interference cancellation) 등의 기술 개발이 이루어지고 있다. 이 밖에도, 5G 시스템에서는 진보된 코딩 변조(Advanced Coding Modulation: ACM) 방식인 FQAM (Hybrid FSK and QAM Modulation) 및 SWSC (Sliding Window Superposition Coding)과, 진보된 접속 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non orthogonal multiple access), 및SCMA(sparse code multiple access) 등이 개발되고 있다. 한편, 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 IoT(Internet of Things, 사물인터넷) 망으로 진화하고 있다. 클라우드 서버 등과 의 연결을 통한 빅데이터(Big data) 처리 기술 등이 IoT 기술에 결합된 IoE (Internet of Everything) 기술도 대두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소 들이 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 연구되고 있다. IoT 환경에서는 연결된 사물들에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능 형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(information technology)기술과 다양 한 산업 간의 융합 및 복합을 통하여 스마트홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마 트 그리드, 헬스 케어, 스마트 가전, 첨단의료서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도들이 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 5G 통 신 기술인 빔 포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처 리 기술로써 클라우드 무선 액세스 네트워크(cloud RAN)가 적용되는 것도 5G 기술과 IoT 기술 융합의 일 예라고 할 수 있을 것이다. 5세대(5G) 또는 NR(new radio) 이동 통신은 최근에 산학연의 다양한 후보 기술에 대한 전 세계적인 기술 활동이 활발해짐에 따라 더욱 탄력을 받고 있다. 5G/NR 이동 통신을 위한 후보 인에이블러(candidate enabler)는 기존 셀룰러 주파수 대역에서 고주파수까지 빔포밍 이득을 제공하고 증가된 용량을 지원하기 위한 대규모 안테나 기 술, 다양한 요구 사항을 가진 다양한 서비스/애플리케이션을 유연하게 수용하는 새로운 파형(예를 들어, 새로운 무선 액세스 기술(radio access technology; RAT)), 대규모 연결을 지원하는 새로운 다중 액세스 방식 등을 포 함한다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에 관한 것으로서, 보다 상세하게는 본 개시는 다중 빔 다운링크 및 업링크 무선 시 스템에 관한 것이다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에서, 사용자 장치(user equipment; UE)가 제공된다. UE는 하나 이상의 송신 설정 인디케이션 (transmission configuration indication; TCI) 상태 및 상응하는 TCI 상태 식별자(identifier; ID)에 대한 설 정 정보(configuration information), 및 하나 이상의 TCI 상태 ID를 수신하도록 설정된 송수신부를 포함한다. UE는 또한 송수신부에 동작 가능하게 연결된 프로세서를 포함한다. 프로세서는 하나 이상의 TCI 상태 ID에 기초 하여 각각 다운링크 채널의 하나 이상의 계층의 수신을 위한 하나 이상의 제1 공간 도메인 필터, 및 각각 업링 크 채널의 하나 이상의 계층의 송신을 위한 하나 이상의 제2 공간 도메인 필터 중 적어도 하나를 결정하도록 설 정된다. 송수신부는 하나 이상의 제1 공간 도메인 필터를 각각 사용하여 다운링크 채널의 하나 이상의 계층을 수신하고, 하나 이상의 제2 공간 도메인 필터를 각각 사용하여 업링크 채널의 하나 이상의 계층을 송신하도록 더 설정된다. 다른 실시예에서, 기지국(base station; BS)이 제공된다. BS는 하나 이상의 TCI 상태 및 상응하는 TCI 상태 ID 에 대한 설정 정보를 송신하도록 설정된 송수신부를 포함한다. BS는 또한 송수신부에 동작 가능하게 연결된 프 로세서를 포함한다. 프로세서는 각각 다운링크 채널의 하나 이상의 계층에 대한 하나 이상의 제1 TCI 상태, 및 각각 업링크 채널의 하나 이상의 계층에 대한 하나 이상의 제2 TCI 상태 중 적어도 하나를 결정하도록 설정된다. 프로세서는 하나 이상의 제1 TCI 상태 및 하나 이상의 제2 TCI 상태 중 적어도 하나에 상응하는 다수 의 TCI 상태 ID를 생성하도록 설정된다. 송수신부는 다수의 TCI 상태 ID를 송신하고; 하나 이상의 제1 TCI 상태 에 각각 상응하는 하나 이상의 제1 공간 도메인 필터를 각각 사용하여 다운링크 채널의 하나 이상의 계층을 송 신하고, 하나 이상의 제2 TCI 상태에 각각 상응하는 하나 이상의 제2 공간 도메인 필터를 각각 사용하여 업링크 채널의 하나 이상의 계층을 수신하도록 더 설정된다. 또 다른 실시예에서, UE의 방법이 제공된다. 방법은 하나 이상의 TCI 상태 및 상응하는 TCI 상태 ID에 대한 설 정 정보를 수신하는 단계 및 하나 이상의 TCI 상태 ID를 수신하는 단계를 포함한다. 방법은 또한 하나 이상의 TCI 상태 ID에 기초하여 각각 다운링크 채널의 하나 이상의 계층의 수신을 위한 하나 이상의 제1 공간 도메인 필터, 및 각각 업링크 채널의 하나 이상의 계층의 송신을 위한 하나 이상의 제2 공간 도메인 필터 중 적어도 하 나를 결정하는 단계를 포함한다. 방법은 하나 이상의 제1 공간 도메인 필터를 각각 사용하여 다운링크 채널의 하나 이상의 계층을 수신하는 단계, 및 하나 이상의 제2 공간 도메인 필터를 각각 사용하여 업링크 채널의 하나 이상의 계층을 송신하는 단계 중 적어도 하나를 더 포함한다. 다른 기술적 특징은 다음의 도면, 설명 및 청구항으로부터 통상의 기술자에게 용이하게 명백할 수 있다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예의 주요 목적은 다중 빔 다운링크 및 업링크 무선 시스템을 위한 방법 및 장치를 제공하는 것 이다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래의 상세한 설명을 착수하기 전에, 본 특허 문서 전체에 걸쳐 사용된 특정 단어 및 문구를 정의하는 것이 유 리할 수 있다. \"결합(couple)\"이라는 용어 및 이의 파생어는 둘 이상의 요소가 서로 물리적으로 접촉하든 접촉 하지 않든 둘 이상의 요소 간의 어떤 직접 또는 간접 통신을 지칭한다. \"송신한다\", \"수신한다\" 및 \"통신한다\" 이라는 용어뿐만 아니라 이의 파생어는 직접 및 간접 통신 둘 다를 포함한다. \"포함한다(include)\" 및 \"구성한 다(comprise)\"이라는 용어뿐만 아니라 이의 파생어는 제한 없이 포함(inclusion)을 의미한다. \"또는\"이라는 용 어는 포괄적이며, 및/또는(and/or)을 의미한다. \"~와 관련된(associated with)\"이라는 용어뿐만 아니라 이의 파 생어는, \"~를 포함하고(include)\", \"~내에 포함되고(included within)\", \"~와 상호 연결하고(interconnect with)\", \"~을 함유하고(contain)\", \"~내에 함유되고(be contained within)\", \"~에 또는, ~와 연결하고(connectto or with)\", \"~에 또는, ~와 결합하고(couple to or with)\", \"~와 통신 가능하고(be communicable with)\", \"~와 협력하고(cooperate with)\", \"~를 인터리브하고(interleave)\", \"~와 병치하고(juxtapose)\", \"~에 가까이 있고(be proximate to)\", \"~에 또는, ~와 묶이고(be bound to or with)\", \"가지고(have)\", \"소유하고 있고 (have a property of)\", \"~에 또는, ~와 관계를 가지고(have a relationship to or with)\" 등인 것을 의미한다. \"제어부\"라는 용어는 적어도 하나의 동작을 제어하는 임의의 장치, 시스템 또는 이의 일부를 의미한 다. 상기 제어부는 하드웨어 또는 하드웨어 및 소프트웨어의 조합 및/또는 펌웨어로 구현될 수 있다. 임의의 특 정 제어부와 관련된 기능은 로컬로든 원격으로든 중앙 집중화되거나 분산될 수 있다. \"적어도 하나(at least one of)\"라는 문구는, 항목의 리스트와 함께 사용될 때, 나열된 항목 중 하나 이상의 상이한 조합이 사용될 수 있고, 리스트 내에는 하나의 항목만이 필요할 수 있다는 것을 의미한다. 예를 들어, \"A, B 및 C 중 적어도 하나\"는 다음의 조합: A, B, C, A 및 B, A 및 C, B 및 C, 및 A 및 B 및 C 중 어느 하나를 포함한다. 더욱이, 아래에서 설명되는 다양한 기능은 하나 이상의 컴퓨터 프로그램에 의해 구현되거나 지원될 수 있으며, 각각의 컴퓨터 프로그램은 컴퓨터 판독 가능 프로그램 코드(computer readable program code)로부터 형성되고, 컴퓨터 판독 가능 매체(computer readable medium)에서 구현된다. \"애플리케이션\" 및 \"프로그램\"이라는 용어는 적절한 컴퓨터 판독 가능 프로그램 코드에서 구현을 위해 적응된 하나 이상의 컴퓨터 프로그램, 소프트웨어 구 성 요소(software components), 명령어 세트(sets of instructions), 절차, 기능, 객체(object), 클래스, 인스 턴스(instance), 관련된 데이터 또는 이의 일부를 지칭한다. 문구 \"컴퓨터 판독 가능 프로그램 코드\"는 소스 코 드(source code), 객체 코드(object code) 및 실행 가능 코드(executable code)를 포함하는 임의의 타입의 컴 퓨터 코드를 포함한다. 문구 \"컴퓨터 판독 가능 매체\"는 판독 전용 메모리(read only memory; ROM), 랜덤 액세 스 메모리(random access memory; RAM), 하드 디스크 드라이브, 콤팩트 디스크(compact disc; CD), 디지털 비 디오 디스크(digital video disc; DVD), 또는 임의의 다른 타입의 메모리와 같이 컴퓨터에 의해 액세스될 수 있 는 임의의 타입의 매체를 포함한다. \"비일시적(non-transitory)\" 컴퓨터 판독 가능 매체는 일시적 전기적 또는 다른 신호를 송신하는 유선, 무선, 광학 또는 다른 통신 링크를 배제한다. 비일시적 컴퓨터 판독 가능 매체는 데이터가 영구적으로 저장될 수 있는 매체, 및 재기록 가능 광 디스크 또는 소거 가능 메모리 장치와 같이 데이 터가 저장되고 나중에 중복 기록(overwriting)될 수 있는 매체를 포함한다. 다른 특정 단어 및 문구에 대한 정의는 본 특허 문서 전체에 걸쳐 제공된다. 통상의 기술자는 대부분의 경우는 아니지만 이러한 정의가 이러한 정의된 단어 및 문구의 이전 및 이후의 사용에 적용된다는 것을 이해해야 한다. 아래에서 논의되는 도 1 내지 도 18, 및 본 특허 문서에서 본 개시의 원리를 설명하기 위해 사용된 다양한 실시 예는 예시만을 위한 것이고, 어떤 식으로든 본 개시의 범위를 제한하는 것으로 해석되지 않아야 한다. 통상의 기술자는 본 개시의 원리가 적절히 배치된 임의의 시스템 또는 장치에서 구현될 수 있다는 것을 이해할 수 있다. 다음의 문서 및 표준 설명은 본 명세서에 충분히 설명된 바와 같이 본 개시에 참조로 통합된다: 3GPP TS 38.211 v16.4.0, \"NR; Physical channels and modulation\"; 3GPP TS 38.212 v16.4.0, \"NR; Multiplexing and Channel coding\"; 3GPP TS 38.213 v16.4.0, \"NR; Physical Layer Procedures for Control\"; 3GPP TS 38.214 v16.4.0, \"NR; Physical Layer Procedures for Data\"; 3GPP TS 38.321 v16.3.0, \"NR; Medium Access Control (MAC) protocol specification\"; and 3GPP TS 38.331 v16.3.1, \"NR; Radio Resource Control (RRC) Protocol Specification.\" 아래의 도 1 내지 도 3은 무선 통신 시스템에서 OFDM(orthogonal frequency division multiplexing) 또는 OFDMA(orthogonal frequency division multiple access) 통신 기술을 사용하여 구현되는 다양한 실시예를 설명 한다. 도 1 내지 도 3의 설명은 상이한 실시예가 구현될 수 있는 방식에 대한 물리적 또는 구조적 제한을 의미 하지 않는다. 본 개시의 상이한 실시예는 적절하게 배치된 임의의 통신 시스템에서 구현될 수 있다. 도 1은 본 개시에 따른 예시적인 무선 네트워크를 도시한다. 도 1에 도시된 무선 네트워크의 실시예는 예시만을 위한 것이다. 무선 네트워크의 다른 실시예는 본 개시의 범위를 벗어나지 않고 사용될 수 있다. 도 1에 도시된 바와 같이, 무선 네트워크는 gNB(예를 들어, 기지국(base station; BS)), gNB 및 gNB를 포함한다. gNB는 gNB 및 gNB와 통신한다. gNB는 또한 인터넷, 독점적 IP(Internet Protocol) 네트워크 또는 다른 데이터 네트워크와 같은 적어도 하나의 네트워크와 통신한다. gNB는 gNB의 커버리지 영역 내의 제1 복수의 사용자 장치(user equipment; UE)에 대한 네트워 크에 무선 광대역 액세스(wireless broadband access)를 제공한다. 제1 복수의 UE는 소기업(smallbusiness; SB)에 위치될 수 있는 UE; 기업(enterprise; E)에 위치될 수 있는 UE; WiFi 핫 스폿 (hotspot; HS)에 위치될 수 있는 UE; 제1 거주지(residence; R)에 위치될 수 있는 UE; 제2 거주지 (R)에 위치될 수 있는 UE; 및 셀 폰(cell phone), 무선 랩톱(wireless laptop), 무선 PDA 등과 같은 모바 일 장치(mobile device)(M)일 수 있는 UE를 포함한다. gNB는 gNB의 커버리지 영역 내의 제2 복수의 UE에 대한 네트워크에 무선 광대역 액세스를 제공한다. 제2 복수의 UE는 UE 및 UE를 포함한다. 일부 실시예에서, gNB(101-103) 중 하나 이상은 서로 통신하고, 5G/NR, LTE(long term evolution), LTE-A(long term evolution-advanced), WiMAX, WiFi 또는 다른 무선 통신 기술을 사용하여 UE(111-116)와 통신 할 수 있다. 네트워크 타입에 따라, \"기지국\" 또는 \"BS\"라는 용어는 송신 포인트(transmit point, TP), 송수신 포인트 (transmit-receive point, TRP), 강화된 기지국(enhanced base station, eNodeB 또는 eNB), 5G 기지국(gNB), 매크로셀(macrocell), 펨토셀(femtocell), WiFi 액세스 포인트(access point, AP) 또는 다른 무선 가능한 장치 (wirelessly enabled device)와 같이 네트워크에 무선 액세스를 제공하도록 설정된 임의의 구성 요소(또는 구성 요소의 집합)를 지칭할 수 있다. 기지국은 하나 이상의 무선 통신 프로토콜(wireless communication protocol), 예를 들어, 5G/NR 3GPP NR, LTE(long term evolution), LTE-A(LTE-advanced), 고속 패킷 액세스 (high speed packet access, HSPA), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세스를 제공할 수 있다. 편의상, \"BS\" 및 \"TRP\"라는 용어는 본 특허 문서에서 원격 단말(remote terminal)에 무선 액세스를 제공하는 네 트워크 인프라 구성 요소(network infrastructure component)를 나타내는데 사용된다. 또한, 네트워크 타입에 따라, \"사용자 장치\" 또는 \"UE\"라는 용어는 \"이동국(mobile station)\", \"가입자국(subscriber station)\", \"원 격 단말\", \"무선 단말\", \"수신 포인트(receive point)\"또는 \"사용자 장치\"와 같은 임의의 구성 요소를 지칭할 수 있다. 편의상, \"사용자 장치\" 및 \"UE\"라는 용어는 본 특허 문서에서 UE가(이동 전화 또는 스마트 폰과 같은) 모바일 장치이든 일반적으로(데스크톱 컴퓨터(desktop computer) 또는 자동 판매기(vending machine)와 같은) 고정 장치(stationary device)로 간주되든 BS에 무선으로 액세스하는 원격 무선 장치를 지칭하는데 사용된다. 점선은 예시 및 설명만을 위해 거의 원형으로 도시되는 커버리지 영역(120 및 125)의 대략적인 범위를 보여준다. 커버리지 영역(120 및 125)과 같은 gNB와 관련된 커버리지 영역은 gNB의 설정 및 자연적 및 인공적 방해물(man-made obstruction)과 관련된 무선 환경의 변화에 따라 불규칙한 형상을 포함하는 다른 형상을 가질 수 있다는 것이 명확히 이해되어야 한다. 아래에서 더욱 상세하게 설명되는 바와 같이, UE(111-116) 중 하나 이상은 다중 빔 다운링크 및 업링크 무선 시 스템을 활용하기 위한 회로, 프로그래밍, 또는 이의 조합을 포함한다. 특정 실시예에서, gNB(101-103) 중 하나 이상은 다중 빔 다운링크 및 업링크 무선 시스템을 활용하기 위한 회로, 프로그래밍 또는 이의 조합을 포함한다. 도 1은 무선 네트워크의 일례를 도시하지만, 도 1에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 무 선 네트워크는 임의의 수의 gNB 및 임의의 수의 UE를 임의의 적절한 배치에 포함시킬 수 있다. 또한, gNB는 임의의 수의 UE와 직접 통신할 수 있고, 네트워크에 대한 무선 광대역 액세스를 이러한 UE에 제공할 수 있다. 유사하게, 각각의 gNB(102-103)는 네트워크와 직접 통신할 수 있고, 네트워크에 대한 직 접 무선 광대역 액세스를 UE에 제공할 수 있다. 또한, gNB(101, 102 및/또는 103)는 외부 전화 네트워크 또는 다른 타입의 데이터 네트워크와 같은 다른 또는 부가적인 외부 네트워크에 대한 액세스를 제공할 수 있다. 도 2는 본 개시의 실시예에 따른 예시적인 gNB를 도시한다. 도 2에 도시된 gNB의 실시예는 예시만을 위한 것이며, 도 1의 gNB(101 및 103)는 동일하거나 유사한 설정을 가질 수 있다. 그러나, gNB는 다양한 설정을 가지며, 도 2는 본 개시의 범위를 gNB의 임의의 특정 구현으로 제한하지 않는다. 도 2에 도시된 바와 같이, gNB는 다수의 안테나(205a-205n), 다수의 RF 송수신기(210a-210n), 송신 (transmit; TX) 처리 회로 및 수신(receive, RX) 처리 회로를 포함한다. gNB는 또한 제어부/프 로세서, 메모리 및 백홀 또는 네트워크 인터페이스를 포함한다. RF 송수신기(210a-210n)는 안테나(205a-205n)로부터, 네트워크에서 UE에 의해 송신된 신호와 같은 들어오 는(incoming) RF 신호를 수신한다. RF 송수신기(210a-210n)는 IF 또는 기저 대역 신호를 생성하도록 들어오는 RF 신호를 하향 변환시킨다. IF 또는 기저 대역 신호(baseband signal)는 기저 대역 또는 IF 신호를 필터링, 디 코딩 및/또는 디지털화함으로써 처리된 기저 대역 신호를 생성하는 RX 처리 회로로 송신된다. RX 처리 회 로는 처리된 기저 대역 신호를 추가의 처리를 위한 제어부/프로세서로 송신한다.TX 처리 회로는 제어부/프로세서로부터(음성 데이터(voice data), 웹 데이터, 이메일 또는 대화형 비 디오 게임 데이터(interactive video game data)와 같은) 아날로그 또는 디지털 데이터를 수신한다. TX 처리 회 로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는(outgoing) 기저 대역 데이터를 인코딩, 다중 화 및/또는 디지털화한다. RF 송수신기(210a-210n)는 TX 처리 회로로부터 나가는 처리된 기저 대역 또는 IF 신호를 수신하고, 기저 대역 또는 IF 신호를 안테나(205a-205n)를 통해 송신되는 RF 신호로 상향 변환한다. 제어부/프로세서는 gNB의 전체 동작을 제어하는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있다. 예를 들어, 제어부/프로세서는 잘 알려진 원리에 따라 RF 송수신기(210a-210n), RX 처리 회로 및 TX 처리 회로에 의해 순방향 채널 신호(forward channel signal)의 수신 및 역방향 채널 신호 (reverse channel signal)의 송신을 제어할 수 있다. 제어부/프로세서는 더욱 진보된 무선 통신 기능과 같 은 부가적인 기능을 또한 지원할 수 있다. 예를 들어, 제어부/프로세서는 다수의 안테나(205a-205n)로부터의 나가는 신호가 원하는 방향으로 나가는 신호를 효과적으로 조종(steering)하도록 상이하게 가중되는 빔포밍 또는 방향성 라우팅 동작(directional routing operation)을 지원할 수 있다. 다양한 다른 기능 중 임의의 기능은 제어부/프로세서에 의해 gNB에서 지원될 수 있다. 제어부/프로세서는 또한 OS와 같은 메모리에 상주하는 프로그램 및 다른 프로세스를 실행할 수 있다. 제어부/프로세서는 실행 프로세스에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동시킬 수 있다. 제어부/프로세서는 또한 백홀 또는 네트워크 인터페이스에 결합된다. 백홀 또는 네트워크 인터페이스 는 gNB가 백홀 연결(backhaul connection) 또는 네트워크를 통해 다른 장치 또는 시스템과 통신할 수 있게 한다. 인터페이스는 임의의 적절한 유선 또는 무선 연결을 통한 통신을 지원할 수 있다. 예를 들 어, gNB가(5G, LTE 또는 LTE-A를 지원하는 것과 같은) 셀룰러 통신 시스템(cellular communication system)의 부분으로서 구현될 때, 인터페이스는 gNB가 유선 또는 무선 백홀 연결을 통해 다른 gNB와 통신할 수 있게 한다. gNB가 액세스 포인트로서 구현될 때, 인터페이스는 gNB가 유선 또는 무선 로컬 영역 네트워크(local area network) 또는 유선 또는 무선 연결을 통해(인터넷과 같은) 더 큰 네트워크로 통신할 수 있게 한다. 인터페이스는 이더넷(Ethernet) 또는 RF 송수신기와 같은 유선 또는 무선 연결을 통 한 통신을 지원하는 임의의 적절한 구조를 포함한다. 메모리는 제어부/프로세서에 결합된다. 메모리의 부분은 RAM을 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리(Flash memory) 또는 다른 ROM을 포함할 수 있다. 도 2는 gNB의 일례를 도시하지만, 도 2에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, gNB는 도 2에 도시된 임의의 수의 각각의 구성 요소를 포함할 수 있다. 특정 예로서, 액세스 포인트는 다수의 인터페 이스를 포함할 수 있고, 제어부/프로세서는 상이한 네트워크 어드레스(network address) 사이에서 데 이터를 라우팅하는 라우팅 기능(routing function)을 지원할 수 있다. 다른 특정 예로서, TX 처리 회로의 단일 인스턴스(instance) 및 RX 처리 회로의 단일 인스턴스를 포함하는 것으로 도시되어 있지만, gNB(10 2)는(RF 송수신기 당 하나와 같은) 각각의 다수의 인스턴스를 포함할 수 있다. 또한, 도 2의 다양한 구성 요소 는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가될 수 있다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 3에 도시된 UE의 실시예는 예시만을 위 한 것이며, 도 1의 UE(111-115)는 동일하거나 유사한 설정을 가질 수 있다. 그러나, UE는 다양한 설정을 가지며, 도 3은 본 개시의 범위를 UE의 임의의 특정 구현으로 제한하지 않는다. 도 3에 도시된 바와 같이, UE는 안테나, 무선 주파수(radio frequency; RF) 송수신기, TX 처리 회로, 마이크로폰 및 수신(RX) 처리 회로를 포함한다. UE는 또한 스피커, 프로세서 , 입출력(input/output, I/O) 인터페이스(interface; IF), 터치스크린(touchscreen), 디스플레 이 및 메모리를 포함한다. 메모리는 운영 체제(operating system, OS) 및 하나 이상의 애 플리케이션을 포함한다. RF 송수신기는, 안테나로부터, 네트워크의 gNB에 의해 송신된 들어오는 RF 신호를 수신한다. RF 송수신기는 중간 주파수(intermediate frequency; IF) 또는 기저 대역 신호를 생성하기 위해 들어오는 RF 신호를 하향 변환한다. IF 또는 기저 대역 신호는 기저 대역 또는 IF 신호를 필터링, 디코딩 및/또는 디지털화 함으로써 처리된 기저 대역 신호를 생성하는 RX 처리 회로로 송신된다. RX 처리 회로는 처리된 기저대역 신호를 (음성 데이터에 대해서와 같은) 스피커 또는 (웹 브라우징 데이터(web browsing data)에 대해 서와 같은) 추가의 처리를 위한 프로세서로 송신한다. TX 처리 회로는 마이크로폰으로부터 아날로그 또는 디지털 음성 데이터를 수신하거나 프로세서 로부터 (웹 데이터, 이메일 또는 대화형 비디오 게임 데이터와 같은) 다른 나가는 기저 대역 데이터를 수신한다. TX 처리 회로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는 기저 대역 데이터를 인 코딩, 다중화 및/또는 디지털화한다. RF 송수신기는 TX 처리 회로로부터 나가는 처리된 기저 대역 또 는 IF 신호를 수신하고, 기저 대역 또는 IF 신호를 안테나를 통해 송신되는 RF 신호로 상향 변환한다. 프로세서는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있고, UE의 전체 동작을 제어하 기 위해 메모리에 저장된 OS를 실행할 수 있다. 예를 들어, 프로세서는 잘 알려진 원리에 따라 RF 송수신기, RX 처리 회로 및 TX 처리 회로에 의해 순방향 채널 신호의 수신 및 역방향 채널 신호의 송신을 제어할 수 있다. 일부 실시예에서, 프로세서는 적어도 하나의 마이크로 프로세서 또는 마이 크로 제어부를 포함한다. 프로세서는 또한 빔 관리를 위한 프로세스와 같이 메모리에 상주하는 다른 프로세스 및 프로그램을 실행할 수 있다. 프로세서는 실행 프로세스(executing process)에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동시킬 수 있다. 일부 실시예에서, 프로세서는 OS에 기초하거나 gNB 또는 오퍼레 이터로부터 수신된 신호에 응답하여 애플리케이션을 실행하도록 설정된다. 프로세서는 또한 랩톱 컴 퓨터 및 핸드헬드 컴퓨터(handheld computer)와 같은 다른 장치에 연결하는 능력을 UE에 제공하는 I/O 인 터페이스에 결합된다. I/O 인터페이스는 이러한 액세서리(accessory)와 프로세서 사이의 통신 경로(communication path)이다. 프로세서는 또한 터치스크린 및 디스플레이에 결합된다. UE의 오퍼레이터는 터치스크린 을 이용하여 데이터를 UE에 입력할 수 있다. 디스플레이는 액정 디스플레이(liquid crystal display), 발광 다이오드 디스플레이(light emitting diode display), 또는 웹 사이트(web site)로부터와 같이 텍스트 및/또는 적어도 제한된 그래픽을 렌더링(rendering)할 수 있는 다른 디스플레이일 수 있다. 메모리는 프로세서에 결합된다. 메모리의 일부는 랜덤 액세스 메모리(random access memory; RAM)를 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리 또는 다른 판독 전용 메모리(read-only memory; ROM)를 포함할 수 있다. 도 3은 UE의 일례를 도시하지만, 도 3에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 3의 다양한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가될 수 있다. 특정 예로서, 프로세서는 하나 이상의 중앙 처리 유닛(central processing unit; CPU) 및 하나 이상의 그래픽 처리 유닛(graphics processing unit; GPU)과 같은 다수의 프로세서로 분할될 수 있다. 또한, 도 3은 이동 전화 또는 스마트 폰으로서 설정된 UE를 도시하지만, UE는 다른 타입의 이동 또는 고정 장치로서 동작하도록 설정될 수 있다. 4G 통신 시스템의 상용화 이후 증가한 무선 데이터 트래픽에 대한 수요를 충족하고, 다양한 수직적 애플리케이 션(vertical application)을 가능하게 하기 위해, 5G/NR 통신 시스템이 개발되어 현재 배치되고 있다. 5G/NR 통신 시스템은 더 높은 데이터 송신률을 달성하기 위해 더 높은 주파수(mmWave) 대역, 예를 들어, 28GHz 또는 60GHz 대역에서 구현되거나 강력한 커버리지 및 이동성 지원을 가능하게 하기 위해 6GHz와 같은 더 낮은 주파수 대역에서 구현되는 것으로 간주된다. 무선파의 전파 손실을 감소시키고 송신 거리를 증가시키기 위해, 5G/NR 통 신 시스템에서는 빔포밍, 거대한 MIMO(multiple-input multiple-output), FD-MIMO(full dimensional MIMO), 어 레이 안테나, 아날로그 빔포밍 및 대규모 안테나 기술이 논의되고 있다. 또한, 5G/NR 통신 시스템에서는 진보된 소형 셀, 클라우드 무선 액세스 네트워크(RAN), 초고밀도 네트워크, 기 기 간(D2D) 통신, 무선 백홀, 이동 네트워크, 협력 통신, CoMP(coordinated multi-point), 수신 단 간섭 제거 등을 기반으로 하여 시스템 네트워크 개선을 위한 개발이 이루어지고 있다. 5G 시스템 및 이와 연관된 주파수 대역에 대한 논의는 본 개시의 특정 실시예가 5G 시스템에서 구현될 수 있음 에 따라 참조를 위한 것이다. 그러나, 본 개시는 5G 시스템 또는 이와 연관된 주파수 대역에 한정되지 않으며, 본 개시의 실시예는 임의의 주파수 대역과 관련하여 활용될 수 있다. 예를 들어, 본 개시의 양태는 또한 테라헤 르츠(THz) 대역을 사용할 수 있는 5G 통신 시스템, 6G 또는 그 이후 릴리스(release)의 배치에 적용될 수 있다. 통신 시스템은 기지국 또는 하나 이상의 송신 지점으로부터 UE로의 송신을 나타내는 다운링크(DL) 및 UE로부터 기지국 또는 하나 이상의 수신 지점으로의 송신을 나타내는 업링크(UL)를 포함한다. 셀 상에서 DL 시그널링 또는 UL 시그널링을 위한 시간 유닛은 슬롯이라고 하며, 하나 이상의 심볼을 포함할 수 있다. 심볼은 또한 부가적인 시간 유닛의 역할을 할 수 있다. 주파수(또는 대역폭(BW)) 유닛은 자원 블록(RB)이 라고 한다. 하나의 RB는 다수의 부반송파(SC)를 포함한다. 예를 들어, 슬롯은 0.5 밀리초 또는 1 밀리초의 지속 시간을 가질 수 있고, 14개의 심볼을 포함할 수 있으며, RB는 15KHz 또는 30KHz 등의 SC 간 간격을 갖는 12개의 SC를 포함할 수 있다. DL 신호는 정보 콘텐츠를 전달하는 데이터 신호, DL 제어 정보(DL control information; DCI)를 전달하는 제어 신호 및 파일럿 신호(pilot signal)라고도 알려진 기준 신호(reference signal; RS)를 포함한다. gNB는 각각의 물리적 DL 공유 채널(physical DL shared channel; PDSCH) 또는 물리적 DL 제어 채널(physical DL control channel; PDCCH)을 통해 데이터 정보 또는 DCI를 송신한다. PDSCH 또는 PDCCH는 하나의 슬롯 심볼을 포함하는 다양한 슬롯 심볼의 수를 통해 송신될 수 있다. 간결성을 위해, UE가 PDSCH 수신을 스케줄링하는 DCI 포맷은 DL DCI 포맷이라 하고, UE로부터 물리적 업링크 공유 채널(PUSCH) 송신을 스케줄링하는 DCI 포맷은 UL DCI 포맷이 라 한다. gNB는 채널 상태 정보 RS(channel state information RS; CSI-RS) 및 복조 RS(demodulation RS; DMRS)를 포함 하는 여러 타입의 RS 중 하나 이상을 송신한다. CSI-RS는 주로 UE가 측정을 수행하고 CSI를 gNB에 제공하기 위 한 것이다. 채널 측정을 위해, 비제로 전력 CSI-RS(non-zero power CSI-RS; NZP CSI-RS) 자원이 사용된다. 간 섭 측정 보고(interference measurement report; IMR)의 경우, 제로 전력 CSI-RS(zero power CSI-RS; ZP CSI- RS) 설정과 연관된 CSI 간섭 측정(CSI interference measurement; CSI-IM) 자원이 사용된다. CSI 프로세스는 NZP CSI-RS 및 CSI-IM 자원으로 설정된다. UE는 gNB로부터 DL 제어 시그널링 또는 무선 자원 제어(RRC) 시그널링과 같은 상위 계층 시그널링을 통해 CSI- RS 송신 파라미터를 결정할 수 있다. CSI-RS의 송신 인스턴스(transmission instance)는 DL 제어 시그널링에 의해 지시될 수 있거나 상위 계층 시그널링에 의해 설정될 수 있다. DM-RS는 각각의 PDCCH 또는 PDSCH의 BW에서 만 송신되며, UE는 DMRS를 사용하여 데이터 또는 제어 정보를 복조할 수 있다. 도 4 및 도 5는 본 개시에 따른 예시적인 무선 송수신 경로를 도시한다. 다음의 설명에서, 송신 경로는 gNB(예컨대, gNB)에서 구현되는 것으로서 설명될 수 있지만, 수신 경로는 UE(예컨대, UE)에서 구현되는 것으로서 설명될 수 있다. 그러나, 수신 경로는 gNB에서 구현될 수 있고, 송신 경로는 UE에 서 구현될 수 있다는 것이 이해될 수 있다. 일부 실시예에서, 수신 경로는 본 개시의 실시예에서 설명된 바와 같이 다중 빔 시스템에서 빔 인디케이션 채널을 지원하도록 설정된다. 도 4에 도시된 바와 같이, 송신 경로는 채널 코딩 및 변조 블록(channel coding and modulation block), 직렬 대 병렬(serial-to-parallel; S-to-P) 블록, 크기 N 역 고속 푸리에 변환(inverse fast Fourier transform; IFFT) 블록, 병렬 대 직렬(parallel-to-serial; P-to-S) 블록, 사이클릭 프리픽스 부가 블록(add cyclic prefix block) 및 상향 변환기(up-converter; UC)를 포함한다. 도 5 에 도시된 바와 같이, 수신 경로는 하향 변환기(down-converter; DC), 사이클릭 프리픽스 제거 블록 (remove cyclic prefix block), 직렬 대 병렬(S-to-P) 블록, 크기 N 고속 푸리에 변환(FFT) 블록 , 병렬 대 직렬(P-to-S) 블록, 및 채널 디코딩 및 복조 블록(channel decoding and demodulation block)을 포함한다. 도 4에 도시된 바와 같이, 채널 코딩 및 변조 블록은 정보 비트(information bit)의 세트를 수신하고, 코 딩(예컨대, LDPC(low-density parity check) 코딩)을 적용하며, 일련의 주파수 도메인 변조 심볼(frequency- domain modulation symbol)을 생성하기 위해 입력 비트(예컨대, QPSK(quadrature phase shift keying) 또는 QAM(quadrature amplitude modulation))를 변조시킨다. 직렬 대 병렬 블록은 N이 gNB 및 UE에서 사용되는 IFFT/FFT 크기인 N개의 병렬 심볼 스트림 (parallel symbol stream)을 생성하기 위해 직렬 변조된 심볼(serial modulated symbol)을 병렬 데이터 (parallel data)로 변환한다(예컨대, 역다중화한다(de-multiplex)). 크기 N IFFT 블록은 시간-도메인 출 력 신호(time-domain output signal)를 생성하기 위해 N개의 병렬 심볼 스트림 상에서 IFFT 연산을 수행한다. 병렬 대 직렬 블록은 직렬 시간-도메인 신호(serial time-domain signal)를 생성하기 위해 크기 N IFFT 블록으로부터의 병렬 시간-도메인 출력 심볼(parallel time-domain output symbol)을 변환한다(예컨대, 다중화한다). 사이클릭 프리픽스 부가(add cyclic prefix) 블록은 사이클릭 프리픽스(cyclic prefix)를시간-도메인 신호에 삽입한다. 상향 변환기는 무선 채널을 통한 송신을 위해 '이클릭 프리픽스 부가 블록 의 출력을 RF 주파수로 변조시킨다(예를 들어, 상향 변환시킨다). 신호는 또한 RF 주파수로 변환하기 전에 기저 대역에서 필터링될 수 있다. gNB로부터 송신된 RF 신호는 무선 채널을 통과한 후에 UE에 도달하고, gNB에서의 동작과의 역 동작(reverse operation)은 UE에서 수행된다. 도 5에 도시된 바와 같이, 하향 변환기는 수신된 신호를 기저 대역 주파수로 하향 변환시키고, 사이클릭 프리픽스 제거(remove cyclic prefix)' 블록은 직렬 시간-도메인 기저 대역 신호를 생성하기 위해 사이클 릭 프리픽스를 제거한다. 직렬 대 병렬 블록은 시간-도메인 기저 대역 신호를 병렬 시간-도메인 신호로 변 환한다. 크기 N FFT 블록은 N개의 병렬 주파수 도메인 신호를 생성하기 위해 FFT 알고리즘을 수행한다. 병 렬 대 직렬 블록은 병렬 주파수 도메인 신호를 일련의 변조된 데이터 심볼로 변환한다. 채널 디코딩 및 복 조 블록은 원래의 입력 데이터 스트림을 복원하기 위해 변조된 심볼을 복조하고 디코딩한다. gNB(101-103)의 각각은 도 4에 도시되어 있는 바와 같이 다운링크에서 UE(111-116)로 송신하는 것과 유사한 송 신 경로를 구현할 수 있고, 도 5에 도시되어 있는 바와 같이, 업링크에서 UE(111-116)로부터 수신하는 것 과 유사한 수신 경로를 구현할 수 있다. 마찬가지로, UE(111-116)의 각각은 업링크에서 gNB(101-103)로 송 신하기 위한 송신 경로를 구현할 수 있고, 다운링크에서 gNB(101-103)로부터 수신하기 위한 수신 경로 를 구현할 수 있다. 도 4 및 도 5에서의 각각의 구성 요소는 하드웨어만을 사용하거나 하드웨어와 소프트웨어/펌웨어의 조합을 사용 하여 구현될 수 있다. 특정 예로서, 도 4 및 도 5에서의 구성 요소 중 적어도 일부는 소프트웨어로 구현될 수 있지만, 다른 구성 요소는 설정 가능한 하드웨어 또는 소프트웨어 및 설정 가능한 하드웨어의 혼합에 의해 구현 될 수 있다. 예를 들어, FFT 블록 및 IFFT 블록은 설정 가능한 소프트웨어 알고리즘으로서 구현될 수 있으며, 여기서 크기 N의 값은 구현에 따라 수정될 수 있다. 또한, FFT 및 IFFT를 사용하는 것으로서 설명되었지만, 이는 예시일 뿐이며, 본 개시의 범위를 제한하는 것으로 해석될 수 없다. 이산 푸리에 변환(discrete Fourier transform, DFT) 및 역이산 푸리에 변환(inverse discrete Fourier transform, IDFT) 함수와 같은 다른 타입의 변환이 사용될 수 있다. DFT 및 IDFT 함수에 대 해 N 변수의 값은 임의의 정수(예컨대, 1, 4, 3, 4 등)일 수 있지만, FFT 및 IFFT 함수에 대해서는 N 변수의 값 은 2의 거듭 제곱인 임의의 정수(즉, 1, 2, 4, 8, 16 등)일 수 있다는 것이 이해될 수 있다. 도 4 및 도 5는 무선 송수신 경로의 예를 도시하지만, 도 4 및 도 5에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 4 및 도 5에서의 다양한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필 요에 따라 부가적인 구성 요소가 부가될 수 있다. 또한, 도 4 및 도 5는 무선 네트워크에서 사용될 수 있는 타 입의 송수신 경로의 예를 도시하기 위한 것이다. 무선 네트워크에서 무선 통신을 지원하기 위해 다른 적절한 아 키텍처가 사용될 수 있다. 도 6a는 본 개시의 실시예에 따른 무선 시스템에서의 빔의 예를 도시한다. 도 6a에 도시된 빔의 실시예는 단지 예시를 위한 것이다. 도 6a에 도시된 바와 같이, 무선 시스템에서, 장치에 대한 빔은 빔 방향 및 빔 폭을 특징으로 할 수 있다. 예를 들어, 송신기를 가진 장치는 빔 폭 내에서 빔 방향으로 RF 에너지를 송신한다. 수신기를 가진 장치는 빔 폭 내에서 빔 방향으로 장치를 향해 오는 RF 에너지를 수신한다. 도 6a에 도시된 바와 같이, 지점 A에 있는 장치는 지점 A가 빔 방향으로 이동하고 장치로부터 오는 빔의 빔 폭 내에 있기 때문에 장치로부터 수신하고 장치로 송신할 수 있다. 지점 B에 있는 장치는 지점 B가 장치 로부터의 빔의 빔 폭 및 방향 밖에 있기 때문에 장치로부터 수신하고 장치로 송신할 수 없다. 도 6a가 예시를 위해 빔을 2차원(2D)으로 도시하지만, 통상의 기술자에게는 빔이 3차원(3D)일 수 있다는 것이 명백해야 하며, 여기서 빔 방향 및 빔 폭은 공간에서 정의된다. 도 6b는 본 개시의 실시예에 따른 예시적인 다중 빔 동작을 도시한다. 도 6b에 도시된 다중 빔 동작 의 실시예는 단지 예시를 위한 것이다. 무선 시스템에서, 장치는 다중 빔을 송신 및/또는 수신할 수 있다. 이것은 \"다중 빔 동작\"으로서 알려져 있으며, 도 6b에 도시되어 있다. 도 6b는 예시를 위해 2D이지만, 빔은 3D일 수 있다는 것이 통상의 기술자에게 명백할 수 있으며, 여기서 빔은 공간의 임의의 방향으로 송신되거나 임의의 방향으로부터 수신될 수 있다.Rel.14 LTE 및 Rel.15 NR은 eNB가 많은 수의 안테나 요소(예를 들어, 64 또는 128)를 장착할 수 있도록 하는 최대 32개의 CSI-RS 안테나 포트를 지원한다. 이 경우, 복수의 안테나 요소는 하나의 CSI-RS 포트에 매핑된다. mmWave 대역의 경우, 안테나 요소의 수가 주어진 폼 팩터(form factor)에 대해 더 많을 수 있지만, 디지털식으 로 프리코딩된 포트의 수에 상응할 수 있는 CSI-RS 포트의 수는 도 7에 도시된 바와 같이 하드웨어 제약(예를 들어, mmWave 주파수에서 다수의 ADC/DAC를 설치할 가능성)으로 인해 제한되는 경향이 있다. 도 7은 본 개시의 실시예에 따른 예시적인 안테나 구조를 도시한다. 도 7에 도시된 안테나 구조의 실 시예는 단지 예시를 위한 것이다. 예를 들어, 안테나 구조는 예를 들어 도 1의 UE 또는 gNB와 같은 무선 통신 장치에 존재할 수 있다. 이 경우, 하나의 CSI-RS 포트는 아날로그 위상 시프터의 뱅크(bank)에 의해 제어될 수 있는 다수의 안테나 요소에 매핑된다. 그런 다음, 하나의 CSI-RS 포트는 아날로그 빔포밍을 통해 좁은 아날로그 빔을 생성하는 하나의 서브어레이(sub-array)에 상응할 수 있다. 이러한 아날로그 빔은 심볼 또는 서브프레임에 걸쳐 위상 시 프터 뱅크를 변경함으로써 더 넓은 범위의 각도에 걸쳐 스위프(sweep)하도록 설정될 수 있다. 서브어레이 의 수(RF 체인의 수와 동일함)는 CSI-RS 포트의 수 NCSI-PORT와 동일하다. 디지털 빔포밍 유닛은 NCSI-PORT 아 날로그 빔에 걸쳐 선형 결합(linear combination)을 수행하여 프리코딩 이득을 더욱 증가시킨다. 아날로그 빔은 광대역(따라서 주파수 선택적이 아님)이지만, 디지털 프리코딩은 주파수 부대역 또는 자원 블록에 걸쳐 변화될 수 있다. 수신기 동작은 유사하게 생각될 수 있다. 설명된 시스템은 송수신을 위한 다수의 아날로그 빔을 활용하므로(여기서 예를 들어, 트레이닝 기간(training duration) 후 수시로 수행될 많은 수의 아날로그 빔 중에서 하나 또는 적은 수의 아날로그 빔이 선택됨), \"다중 빔 동작\"이라는 용어는 전체 시스템 양태를 참조하는 데 사용된다. 이것은 예시를 위해 할당된 DL 또는 UL 송신 (TX) 빔(\"빔 인디케이션(beam indication)\"이라고도 함)을 지시하는 것, 빔 보고를 계산하고 수행하기 위한 (각 각 \"빔 측정\" 및 \"빔 보고\"라고도 함) 적어도 하나의 기준 신호를 측정하는 것, 및 상응하는 수신(RX) 빔의 선 택을 통해 DL 또는 UL 송신을 수신하는 것을 포함한다. 설명된 시스템은 또한 >52.6GHz와 같은 더 높은 주파수 대역에 적용할 수 있다. 이 경우, 시스템은 아날로그 빔 만을 사용할 수 있다. 60GHz 주파수 부근에서 O2 흡수 손실(absorption loss)(~10dB 부가적인 손실 @ 100m 거 리)로 인해, 더 많은 수의 더 선명한 아날로그 빔(따라서 어레이에서의 더 많은 수의 라디에이터)이 부가적인 경로 손실을 보상하기 위해 필요할 수 있다. Rel-15 NR에서, 다중 빔 동작은 주로 단일 TRP와 단일 안테나 패널용으로 설계되었다. 따라서, 사양은 TX 빔이 기준 RS와 연관되는 하나의 TX 빔에 대한 빔 인디케이션을 지원한다. DL 빔 인디케이션 및 측정을 위해, 기준 RS는 NZP(non-zero power) CSI-RS 및/또는 SS/PBCH 블록(synchronization signal/primary broadcast channel block) 또는 간략화를 위한 SSB일 수 있으며, 이는 1차 동기화 신호, 2차 동기 신호 및 PBCH를 포함한다. DL 빔 인디케이션은 DCI 포맷의 송신 설정 지시자(transmission configuration indicator; TCI) 필드를 통해 수행되며, 여기서 인디케이션은 하나의(및 하나만의) 할당된 기준 RS에 대한 인덱스를 포함한다. 가설 세트 또 는 소위 TCI 상태는 상위 계층(예를 들어, RRC) 시그널링을 통해 설정되고, 적용 가능한 경우, 이러한 TCI 상태 의 서브세트는 TCI 필드 코드 포인트에 대한 MAC 제어 요소(control element; CE)를 통해 선택/활성화된다. UL 빔 인디케이션 및 측정을 위해, 기준 RS는 NZP CSI-RS, SSB 및/또는 SRS일 수 있다. UL 빔 인디케이션은 DCI 포맷의 SRS 자원 지시자(SRS resource indicator; SRI) 필드를 통해 수행되며, 여기서 인디케이션은 하나의(및 하나만의) 기준 RS에 링크된다. 링크는 SpatialRelationInfo 상위 계층(예를 들어, RRC) 파라미터를 사용하여 상위 계층 시그널링을 통해 설정된다. 본질적으로, 하나의 TX 빔만이 UE에 지시된다. 더욱이, 빔 인디케이션을 위해 목적에 맞게 설계된(purpose-designed) DL 채널은 수신을 위한 TCI 상태 및/또는 DL 및 UL 빔 인디케이션, 및/또는 다가오는(upcoming) DL 채널 및/또는 UL 채널 송신에 대한 SRI을 결합하는 송 수신을 위한 TCI 상태 및/또는 조인트(joint) TCI 상태를 UE에 지시하기 위해 NW/gNB에 의해 사용될 수 있다. 더욱이, 빔 인디케이션 채널의 빔은 데이터 또는 제어 채널에 대한 빔 커버리지보다 더 넓은 빔 커버리지를 제 공하도록 설계될 수 있고, 빔 인디케이션 채널의 인접한 빔이 동적 다중 경로 환경에서 보다 강력한 커버리지를 제공하기 위해 부분적으로 중첩되도록 부가적으로 설계될 수 있다. 더욱이, 분산되고 빠르게 변화하는 다중 경로 환경에서, 빔 인디케이션 채널의 TCI 상태는 다수의 빔을 포함할 수 있다. gNB는 송신할 수 있고, UE는 하나 이상의 이러한 빔 상에서 TCI 인디케이션 채널을 수신할 수 있다.더욱이, 빔 인디케이션 채널이 UE의 그룹에 의해 수신되도록 의도될 때, 빔 인디케이션 채널의 TCI 상태는 UE의 그룹을 커버하는 빔으로 구성된다. 본 개시는 다수의 빔을 갖는 다중 경로 환경에서의 동작과 관련된 부가적인 설계 양태를 고려하며, 여기서 다운 링크(PDSCH) 및 업링크(PUSCH) 방향의 5G NR 데이터 채널은 다수의 계층을 포함할 수 있으며, 여기서 계층은 설 정될 수 있고 상이한 TX 빔에 할당될 수 있다. 본 개시는 또한 예를 들어 빔 상응(beam correspondence)의 경우 또는 UL 및 DL 데이터 채널(예를 들어, PDSCH /PUSCH)의 다수의 계층이 상이할 수 있을 때 조인트 UL/DL 5G NR 데이터 채널(예를 들어, PDSCH/PUSCH) 빔 시그널링과 관련된 양태를 고려한다. 본 개시는, 예를 들어, 데이터 채널이 설정되고 다수의 Tx 빔이 할당되는 경우 조인트 5G NR 데이터/제어 채널(예를 들어, PDSCH/PDCCH 또는 PUSCH/PUCCH) 빔 시그널링과 관련된 양태를 더 고려한다. 본 개시는 예를 들어 다수의 계층 및/또는 Tx 빔이 구 성 요소 반송파(component carrier)/셀의 상이한 각각의 구성 요소 반송파/셀 또는 BWP에 대해 상이할 때 다수 의 구성 요소 반송파 및/또는 대역폭 부분(BWP)에 걸친 조인트 빔 시그널링과 관련된 양태를 부가적으로 고려한 다. 다음에는, FDD(frequency division duplexing)와 TDD(time division duplexing)는 모두 DL 및 UL 시그널링을 위한 이중 방식(duplex method)으로서 고려된다. 다음의 예시적인 설명 및 실시예는 OFDM(orthogonal frequency division multiplexing) 또는 OFDMA(orthogonal frequency division multiple access)을 가정하지 만, 본 개시는 다른 OFDM 기반 송신 파형 또는 필터링된 OFDM(F-OFDM)과 같은 다중 액세스 방식으로 확장될 수 있다. 본 개시는 함께 또는 서로 조합하여 사용될 수 있거나 독립형 방식으로서 동작할 수 있는 여러 구성 요소를 고 려한다. 본 개시에서, \"활성화(activation)\"라는 용어는 UE가 네트워크(또는 gNB)로부터 시작 시점을 지시하는 신호를 수신하고 디코딩하는 동작을 설명한다. 시작점은 현재 또는 미래의 슬롯/서브프레임 또는 심볼일 수 있으며, 정 확한 위치는 암시적으로 또는 명시적으로 지시되거나, 그렇지 않으면 시스템 동작에서 명시되거나 상위 계층에 의해 설정된다. 신호를 성공적으로 디코딩하면, UE는 신호에 의해 제공되는 인디케이션에 따라 응답한다. \"비활 성화(deactivation)\"라는 용어는 UE가 네트워크(또는 gNB)로부터 정지 시점을 지시하는 신호를 수신하고 디코딩 하는 동작을 설명한다. 정지점은 현재 또는 미래의 슬롯/서브프레임 또는 심볼일 수 있으며, 정확한 위치는 암 시적으로 또는 명시적으로 지시되거나, 그렇지 않으면 시스템 동작에서 명시되거나 상위 계층에 의해 설정된다. 신호를 성공적으로 디코딩하면, UE는 신호에 의해 제공되는 인디케이션에 따라 응답한다. TCI, TCI 상태, SpatialRelationInfo, 타겟 RS, 기준 RS 및 다른 용어와 같은 용어는 예시를 위해 사용되므로 규범적이지 않다. 동일한 기능을 나타내는 다른 용어가 또한 사용될 수 있다. \"기준 RS\"는 방향, 프리코딩/빔포밍, 다수의 포트 등과 같은 DL 빔 또는 UL TX 빔의 특성의 세트에 상응한다. 예를 들어, DL의 경우, UE가 예를 들어 TCI 상태에 의해 지시되는 DCI 포맷의 필드를 통해 기준 RS 인덱스/ID를 수신함에 따라, UE는 기준 RS의 알려진 특성을 연관된 DL 수신에 적용한다. 기준 RS는 UE에 의해 수신되고 측정 될 수 있고(예를 들어, 기준 RS는 NZP CSI-RS 및/또는 SSB와 같은 다운링크 신호임), UE는 빔 보고를 계산하기 위한 측정의 결과를 사용할 수 있다(Rel-15 NR에서, 빔 보고는 적어도 하나의 CRI가 수반되는 적어도 하나의 L1-RSRP를 포함함). 수신된 빔 보고를 사용하여, NW/gNB는 특정 DL TX 빔을 UE에 할당할 수 있다. 기준 RS는 또 한 UE에 의해 송신될 수 있다(예를 들어, 기준 RS는 SRS와 같은 업링크 신호임). NW/gNB가 UE로부터 기준 RS를 수신함에 따라, NW/gNB는 특정 DL TX 빔을 UE에 할당하는데 사용되는 정보를 측정하고 계산할 수 있다. 이러한 옵션은 적어도 DL-UL 빔 쌍 상응(beam pair correspondence)이 있을 때 적용 가능하다. 다른 예에서, UL 송신을 위해, UE는 PUSCH 송신과 같은 UL 송신을 스케줄링하는 DCI 포맷의 기준 RS 인덱스/ID 를 수신할 수 있고, 그런 다음 UE는 기준 RS의 알려진 특성을 UL 송신에 적용한다. 기준 RS는 UE에 의해 수신되 고 측정될 수 있고(예를 들어, 기준 RS는 NZP CSI-RS 및/또는 SSB와 같은 다운링크 신호임), UE는 빔 보고를 계 산하기 위한 측정의 결과를 사용할 수 있다. NW/gNB는 빔 보고를 사용하여 특정 UL TX 빔을 UE에 할당할 수 있 다. 이러한 옵션은 적어도 DL-UL 빔 쌍 상응이 유지될 때 적용 가능하다. 기준 RS는 또한 UE에 의해 송신될 수 있다(예를 들어, 기준 RS는 SRS 또는 DMRS와 같은 업링크 신호임). NW/gNB가 수신된 기준 RS를 사용하여 NW/gNB 가 특정 DL TX 빔을 UE에 할당하기 위해 사용할 수 있는 정보를 측정하고 계산할 수 있다. 기준 RS는 예를 들어 비주기적(AP) RS의 경우 DCI를 통해 NW/gNB에 의해 트리거링될 수 있거나 주기적 RS의 경 우 주기성 및 오프셋과 같은 특정 시간 도메인 동작을 설정할 수 있거나 반지속적 RS의 경우 이러한 설정과 활성화/비활성화의 조합일 수 있다. 다중 빔 동작이 특히 관련된 mmWave 대역(또는 주파수 범위 2(FR2)) 또는 더 높은 주파수 대역(예를 들어, >52.6GHz 또는 FR4)의 경우, 송수신 프로세스는 수신기가 주어진 TX 빔에 대한 RX 빔을 선택하는 것을 포함한다. DL 다중 빔 동작의 경우, UE는 DL TX 빔(기준 RS에 상응함)마다 DL RX 빔을 선택한다. 따라서, CSI- RS 및/또는 SSB와 같은 DL RS가 기준 RS로서 사용될 때, NW/gNB는 UE가 DL RX 빔을 선택할 수 있도록 DL RS를 UE로 송신한다. 이에 응답하여, UE는 DL RS를 측정하고, 이 프로세스에서 DL RX 빔을 선택하고, DL RS의 품질과 연관된 빔 메트 릭(beam metric)을 보고한다. 이 경우, UE는 설정된 (DL) 기준 RS마다 TX-RX 빔 쌍을 결정한다. 따라서, 이 지 식이 NW/gNB에 이용 가능하지 않을지라도, UE는, NW/gNB로부터 DL TX 빔 인디케이션과 연관된 DL RS를 수신하면, UE가 모든 TX-RX 빔 쌍 상에서 획득한 정보로부터 DL RX 빔을 선택할 수 있다. 반대로, SRS 및/또는 DMRS와 같은 UL RS가 기준 RS로서 사용될 때, 적어도 DL-UL 빔 상응 또는 상호성(reciprocity)이 유지될 때, NW/gNB는 UL RS를 송신하도록 UE를 트리거링하거나 설정하며(DL의 경우와 상호성에 의해, 이것은 DL RX 빔에 상 응함). gNB는, UL RS를 수신하고 측정하면, DL TX 빔을 선택할 수 있다. 결과적으로, TX-RX 빔 쌍이 도출된다. NW/gNB는 기준 RS마다 또는 \"빔 스위핑\"에 의해 설정된 모든 UL RS에 대해 이러한 동작을 수행하고, UE가 송신 하도록 설정된 모든 UL RS와 연관된 모든 TX-RX 빔 쌍을 결정할 수 있다. 다음의 두 실시예(A-1 및 A-2)는 DL-TCI 상태 기반 DL 빔 인디케이션을 활용하는 DL 다중 빔 동작의 예이다. 제 1 예시적 실시예(A-1)에서, 비주기적 CSI-RS는 NW/gNB에 의해 송신되고, UE에 의해 수신/측정된다. 이 실시예는 UL-DL 빔 상응 여부에 관계없이 사용될 수 있다. 제2 예시적 실시예(A-2)에서, 비주기적 SRS는 NW에 의해 트리거링되고, UE에 의해 송신됨으로써, NW(또는 gNB) 가 DL RX 빔을 할당할 목적으로 UL 채널 품질을 측정할 수 있도록 한다. 이 실시예는 적어도 UL-DL 빔 상응이 있는 경우에 사용될 수 있다. 두 가지 예에서 비주기적 RS가 고려되지만, 주기적 또는 반지속적 RS가 또한 사용 될 수 있다. 도 8은 본 개시의 실시예에 따른 예시적인 DL 다중 빔 동작을 도시한다. 도 8에 도시된 UL 다중 빔 동작 의 실시예는 단지 예시를 위한 것이다. 도 8에 예시된 일 예(실시예 A-1)에서, DL 다중 빔 동작은 gNB/NW가 비주기적 CSI-RS(aperiodic CSI-RS; AP-CSI-RS) 트리거 또는 인디케이션을 UE로 시그널링하는 것으로 시작한다(단계). 이러한 트리거 또는 인 디케이션은 DCI에 포함될 수 있고, 동일한(제로 시간 오프셋) 또는 이후 슬롯/서브프레임(>0 시간 오프셋)에서 AP-CSI-RS의 송신을 지시할 수 있다. 예를 들어, DCI는 DL 수신 또는 UL 송신의 스케줄링과 관련될 수 있고, CSI-RS 트리거는 CSI 보고 트리거와 함께 또는 별개로 코딩될 수 있다. gNB/NW에 의해 송신된 AP-CSI-RS를 수신 하면(단계), UE는 AP-CSI-RS를 측정하고, 특정 TX 빔 가설(beam hypothesis)의 품질을 지시하는 \"빔 메트 릭(beam matic)\"을 계산하고 보고한다(단계). 이러한 빔 보고의 예는 CSI-RS 자원 지시자(CSI-RS resource indicator; CRI) 또는 SSB 자원 지시자(SSB resource indicator; SSB-RI)이며, 이는 연관된 L1- RSRP(layer 1-received signal received power)/L1-RSRQ(L1-received signal received quality)/L1-SINR(L1- signla to interference ratio)/채널 품질 지시자(channel quality indicator; CQI)와 결합된다. UE로부터 빔 보고를 수신하면, gNB/NW는 빔 보고를 사용하여 UE에 대한 DL RX 빔을 선택하고, UE에 의한 PDSCH 수신을 스케줄링하는 DCI 포맷과 같은 DCI 포맷의 TCI 상태 필드(TCI-state field)를 사용하여 DL RX 빔 선택을 지시할 수 있다(단계). 이 경우, TCI 상태 필드의 값은 (gNB/NW에 의한) 선택된 DL TX 빔을 나타내는 AP- CSI-RS와 같은 기준 RS를 지시한다. 또한, TCI 상태는 AP-CSI-RS와 같은 기준 RS에 링크되는 CSI-RS와 같은 \" 타겟\" RS를 지시할 수도 있다. TCI 상태를 제공하는 DCI 포맷을 성공적으로 디코딩하면, UE는 DL RX 빔을 선택 하고, 기준 CSI-RS와 연관된 DL RX 빔을 사용하여 PDSCH 수신과 같은 DL 수신을 수행한다(단계). 대안적으로, gNB/NW는 빔 보고를 사용하여 UE에 대한 DL RX 빔을 선택하고, 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널에서 TCI 상태 필드의 값을 사용하여 선택된 DL RX 빔을 UE에 지시할 수 있다(단계). 빔 인 디케이션을 위해 목적에 맞게 설계된 DL 채널은 UE 특정적이거나 UE의 그룹에 대한 것일 수 있다. 예를 들어, UE 특정 DL 채널은 UE가 USS(UE-specific search space)에 따라 수신하는 PDCCH일 수 있지만, UE 그룹 공통 DL 채널은 UE가 공통 검색 공간(common search space; CSS)에 따라 수신하는 PDCCH일 수 있다. 이 경우, TCI 상태 는 (gNB/NW에 의해) 선택된 DL TX 빔을 나타내는 AP-CSI-RS와 같은 기준 RS를 지시한다. 부가적으로, TCI 상태 는 또한 AP-CSI-RS와 같은 기준 RS에 링크되는 CSI-RS와 같은 \"타겟\" RS를 지시할 수 있다. TCI 상태로 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널을 성공적으로 디코딩하면, UE는 DL RX 빔을 선택하고, 기준 CSI- RS와 연관된 DL RX 빔을 사용하여 PDSCH 수신과 같은 DL 수신을 수행한다(단계). 이 실시예(A-1)에 대해, 상술한 바와 같이, UE는 예를 들어 DCI 포맷의 TCI 상태 필드를 통해 제공되는 AP-CSI- RS와 같은 기준 RS의 인덱스를 사용하여 DL RX 빔을 선택한다. 이 경우, CSI-RS 자원 또는 일반적으로 CSI-RS, SSB 또는 둘의 조합을 포함하고 기준 RS 자원으로서 UE에 설정되는 DL RS 자원은 CRI/L1-RSRP 또는 L1-SINR과 같은 \"빔 메트릭\" 보고에 링크(연관)될 수 있다. 도 9는 본 개시의 실시예에 따른 다른 예시적인 DL 다중 빔 동작을 도시한다. 도 9에 도시된 UL 다중 빔 동작의 실시예는 단지 예시를 위한 것이다. 도 9에 예시된 다른 예(실시예 A-2)에서, DL 다중 빔 동작은 gNB/NW가 비주기적 SRS(aperiodic SRS; AP- SRS) 트리거 또는 요청을 UE로 시그널링하는 것으로 시작한다(단계). 이러한 트리거는 예를 들어 PDSCH 수 신 또는 PUSCH 송신을 스케줄링하는 DCI 포맷과 같은 DCI 포맷에 포함될 수 있다. AP-SRS 트리거로 DCI 포맷을 수신하고 디코딩하면(단계), UE는 NW(또는 gNB)가 UL 전파 채널을 측정하고 (적어도 빔 상응이 있을 때) DL을 위한 UE에 대한 DL RX 빔을 선택할 수 있도록 SRS(AP-SRS)를 gNB/NW로 송신한다(단계). 그 다음, gNB/NW는 PDSCH 수신을 스케줄링하는 DCI 포맷과 같은 DCI 포맷의 TCI 상태 필드의 값을 통해 DL RX 빔 선택을 지시할 수 있다(단계). 이 경우, TCI 상태는 선택된 DL RX 빔을 나타내는 AP-SRS와 같은 기준 RS를 지시한다. 또한, TCI 상태는 AP-SRS와 같은 기준 RS에 링크되는 CSI-RS와 같은 \"타겟\" RS를 지시할 수도 있다. TCI 상태를 제공하는 DCI 포맷을 성공적으로 디코딩하면, UE는 TCI 상태에 의해 지시된 DL RX 빔을 사용 하여 PDSCH 수신과 같은 DL 수신을 수행한다(단계). 대안적으로, gNB/NW는 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널의 TCI 상태 필드를 사용하여 DL RX 빔 선택을 UE에 지시할 수 있다(단계). 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널은 UE 특정적이거나 UE의 그룹에 대한 것일 수 있다. 예를 들어, UE 특정 DL 채널은 UE가 USS에 따라 수신하는 PDCCH일 수 있지만, UE 그룹 공통 DL 채널은 UE가 CSS에 따라 수신하는 PDCCH일 수 있다. 이 경우, TCI 상태는 선택된 DL RX 빔을 나타내는 AP-SRS와 같은 기준 RS를 지시한다. 부가적으로, TCI 상태는 또한 AP-SRS와 같은 기준 RS에 링크되는 CSI-RS와 같은 \"타겟\" RS를 지시할 수 있다. TCI 상태로 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널을 성공적으로 디코딩하면, UE는 TCI 상태에 의해 지시된 DL RX 빔을 사용하여 PDSCH 수신과 같은 DL 수신을 수행 한다(단계). 이 실시예(A-2)에 대해, 상술한 바와 같이, UE는 TCI 상태 필드를 통해 시그널링된 기준 RS(AP-SRS) 인덱스와 연관된 UL TX 빔에 기초하여 DL RX 빔을 선택한다. 유사하게, UL 다중 빔 동작의 경우, gNB는 기준 RS에 상응하는 UL TX 빔마다 UL RX 빔을 선택한다. 따라서, SRS 및/또는 DMRS와 같은 UL RS가 기준 RS로서 사용될 때, NW/gNB는 UL TX 빔의 선택과 연관된 UL RS를 송신하도록 UE를 트리거링하거나 설정한다. gNB는, UL RS를 수신하고 측정하면, UL RX 빔을 선택한다. 결과적으로, TX-RX 빔 쌍이 도출된다. NW/gNB는 기준 RS마다 또는 \"빔 스위핑\"에 의해 설정된 모든 기준 RS에 대해 이러한 동작을 수행하고, UE에 설정된 모든 기준 RS와 연관된 모든 TX-RX 빔 쌍을 결정할 수 있다. 반대로, CSI-RS 및/또는 SSB와 같은 DL RS가 기준 RS로서 사용될 때(적어도 DL-UL 빔 상응 또는 상호성이 있을 때, NW/gNB는 RS를 UE로 송신한다(DL의 경우와 상호성에 의해, 이러한 RS는 또한 UL RX 빔에 상응함). 이에 응 답하여, UE는 기준 RS를 측정하고(이 프로세스에서 UL TX 빔을 선택함), 기준 RS의 품질과 연관된 빔 메트릭을 보고한다. 이 경우, UE는 설정된 (DL) 기준 RS마다 TX-RX 빔 쌍을 결정한다. 따라서, 이러한 정보가 NW/gNB에 이용 가능하지 않을지라도, NW/gNB로부터 기준 RS(따라서 UL RX 빔) 인디케이션을 수신하면, UE는 모든 TX-RX 빔 쌍 상의 정보로부터 UL TX 빔을 선택할 수 있다. 다음의 두 실시예(B-1 및 B-2)는 네트워크(NW)가 UE로부터 송신을 수신한 후 TCI 기반 UL 빔 인디케이션을 활용 하는 UL 다중 빔 동작의 예이다. 제1 실시예(B-1)에서, NW는 비주기적 CSI-RS를 송신하고, UE는 CSI-RS를 수신 하고 측정한다. 이 실시예는, 예를 들어, 적어도 UL과 DL BPL(beam-pair-link) 사이에 상호성이 있을 때 사용될 수 있다. 이 조건은 \"UL-DL 빔 상응\"이라고 한다. 제2 실시예(B-2)에서, NW는 UE로부터 비주기적인 SRS 송신을 트리거링하고, UE는 NW(또는 gNB)가 UL TX 빔을 할당할 목적으로 UL 채널 품질을 측정할 수 있도록 SRS를 송신 한다. 이 실시예는 UL-DL 빔 상응이 있는지 여부에 관계없이 사용될 수 있다. 이러한 두 가지 예에서 비주기적 RS가 고려되지만, 주기적 또는 반지속적 RS가 또한 사용될 수 있다. 도 10은 본 개시의 실시예에 따른 예시적인 UL 다중 빔 동작을 도시한다. 도 10에 도시된 UL 다중 빔 동 작의 실시예는 단지 예시를 위한 것이다. 도 10에 예시된 일 예(실시예 B-1)에서, UL 다중 빔 동작은 gNB/NW가 비주기적 CSI-RS(AP-CSI-RS) 트리 거 또는 인디케이션을 UE로 시그널링하는 것으로 시작한다(단계). 이러한 트리거 또는 인디케이션은 UE에 대한 PDSCH 수신 또는 UE로부터의 PUSCH 송신을 스케줄링하는 DCI 포맷과 같은 DCI 포맷에 포함될 수 있고, 비 주기적 CSI 요청/트리거와 별개로 또는 공동으로 시그널링될 수 있으며, 동일한 슬롯(제로 시간 오프셋) 또는 이후 슬롯/서브프레임(>0 시간 오프셋)에서 AP-CSI-RS의 송신을 지시할 수 있다. gNB/NW에 의해 송신된 AP-CSI- RS를 수신하면(단계), UE는 AP-CSI-RS를 측정하고, 차례로 (특정 TX 빔 가설(beam hypothesis)의 품질을 지시하는) \"빔 메트릭(beam metric)\"을 계산하고 보고한다(단계). 이러한 빔 보고의 예는 연관된 L1- RSRP/L1-RSRQ/L1-SINR/CQI와 함께 CRI 또는 SSB-RI이다. UE로부터 빔 보고를 수신하면, gNB/NW는 빔 보고를 사용하여 UE에 대한 UL TX 빔을 선택하고, UE로부터의 PUSCH 송신을 스케줄링하는 DCI 포맷과 같은 DCI 포맷의 TCI 상태 필드를 사용하여 UL TX 빔 선택을 지시할 수 있다 (단계). TCI 상태는 (gNB/NW에 의한) 선택된 UL RX 빔을 나타내는 AP-CSI-RS와 같은 기준 RS를 지시한다. 또한, TCI 상태는 AP-CSI-RS와 같은 기준 RS에 링크되는 SRS와 같은 \"타겟\" RS를 지시할 수도 있다. TCI 상태를 지시하는 DCI 포맷을 성공적으로 디코딩하면, UE는 UL TX 빔을 선택하고, 기준 CSI-RS와 연관된 UL TX 빔을 사용하여 PUSCH 송신과 같은 UL 송신을 수행한다(단계). 대안적으로, gNB/NW는 빔 보고를 사용하여 UE에 대한 UL TX 빔을 선택하고, 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널에서 TCI 상태 필드의 값을 사용하여 UL TX 빔 선택을 UE에 지시할 수 있다(단계). 빔 인 디케이션을 위해 목적에 맞게 설계된 DL 채널은 UE 특정적이거나 UE의 그룹에 대한 것일 수 있다. 예를 들어, UE 특정 DL 채널은 UE가 USS에 따라 수신하는 PDCCH일 수 있지만, UE 그룹 공통 DL 채널은 UE가 CSS에 따라 수 신하는 PDCCH일 수 있다. 이 경우, TCI 상태는 (gNB/NW에 의해) 선택된 UL RX 빔을 나타내는 AP-CSI-RS와 같은 기준 RS를 지사한다. 부가적으로, TCI 상태는 또한 AP-CSI-RS와 같은 기준 RS에 링크되는 SRS와 같은 \"타겟\" RS 를 지시할 수 있다. TCI 상태에 의해 빔 인디케이션을 제공하는 목적에 맞게 설계된 DL 채널을 성공적으로 디코 딩하면, UE는 UL TX 빔을 선택하고, 기준 CSI-RS와 연관된 UL TX 빔을 사용하여 PUSCH 송신과 같은 UL 송신을 수행한다(단계). 이 실시예(B-1)에 대해, 상술한 바와 같이, UE는 TCI 상태 필드의 값을 통해 시그널링된 기준 RS 인덱스와 연관 되는 도출된 DL RX 빔에 기초하여 UL TX 빔을 선택한다. 이 경우, CSI-RS 자원 또는 일반적으로 CSI-RS, SSB 또 는 둘의 조합을 포함하고 기준 RS 자원으로서 UE에 설정되는 DL RS 자원은 CRI/L1-RSRP 또는 L1-SINR과 같은 \" 빔 메트릭\" 보고에 링크(연관)될 수 있다. 도 11은 본 개시의 실시예에 따른 다른 예시적인 UL 다중 빔 동작을 도시한다. 도 11에 도시된 UL 다중 빔 동작의 실시예는 단지 예시를 위한 것이다. 도 11에 예시된 다른 예(실시예 B-2)에서, UL 다중 빔 동작은 gNB/NW가 비주기적 SRS(AP-SRS) 트리거 또 는 요청을 UE로 시그널링하는 것으로 시작한다(단계). 이러한 트리거는 PDSCH 수신 또는 PUSCH 송신을 스 케줄링하는 DCI 포맷과 같은 DCI 포맷에 포함될 수 있다. AP-SRS 트리거로 DCI 포맷을 수신하고 디코딩하면(단 계), UE는 NW(또는 gNB)가 UL 전파 채널을 측정하고 UE에 대한 UL TX 빔을 선택할 수 있도록 AP-SRS를 gNB/NW로 송신한다(단계). 그 다음, gNB/NW는 DCI 포맷의 TCI 상태 필드의 값을 사용하여 UL TX 빔 선택을 지시할 수 있다(단계). 이 경우, UL TCI는 선택된 UL TX 빔을 나타내는 AP-SRS와 같은 기준 RS를 지시한다. 또한, TCI 상태는 AP- SRS와 같은 기준 RS에 링크되는 SRS와 같은 \"타겟\" RS를 지시할 수도 있다. TCI 상태에 대한 값을 제공하는 DCI 포맷을 성공적으로 디코딩하면, UE는 예를 들어 TCI 상태에 의해 지시된 UL TX 빔을 사용하여 PUSCH 또는 PUCCH 를 송신한다(단계). 대안적으로, gNB/NW는 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널의 TCI 상태 필드의 값을 사용하여 UL TX 빔 선택을 UE에 지시할 수 있다(단계). 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널은 UE 특정 적이거나 UE의 그룹에 대한 것일 수 있다. 예를 들어, UE 특정 DL 채널은 UE가 USS에 따라 수신하는 PDCCH일 수 있지만, UE 그룹 공통 DL 채널은 UE가 CSS에 따라 수신하는 PDCCH일 수 있다. 이 경우, UL TCI는 선택된 UL TX 빔을 나타내는 AP-SRS와 같은 기준 RS를 지시한다. 부가적으로, TCI 상태는 또한 AP-SRS와 같은 기준 RS에 링크 되는 SRS와 같은 \"타겟\" RS를 지시할 수 있다. TCI 상태 필드의 값을 통해 빔 인디케이션을 위해 목적에 맞게 설계된 DL 채널을 성공적으로 디코딩하면, UE는 TCI 상태의 값에 의해 지시된 UL TX 빔을 사용하여 PUSCH 또는PUCCH와 같이 송신한다(단계). 이 실시예(B-2)에 대해, 상술한 바와 같이, UE는 TCI 상태 필드의 값을 통해 시그널링된 기준 RS(이 경우 SRS) 인덱스로부터 UL TX 빔을 선택한다. 도 12는 본 개시의 실시예에 따른 2개의 RF 경로를 갖는 예시적인 다중 경로 환경을 도시한다. 도 12에 도시된 2개의 RF 경로를 갖는 다중 경로 환경의 실시예는 단지 예시를 위한 것이다. 무선 통신 시스템에서, 특정 시나리오에서, 네트워크와 UE 사이에 둘 이상의 RF 경로가 존재할 수 있다. 이러한 시나리오는 RF 채널의 분산 특성으로 인해 또는 다중 TRP 및/또는 다중 패널 송신을 사용하는 시스템에서 발생 할 수 있다. 이러한 시나리오에서, 네트워크는 다중 경로 환경을 이용하여 다중 계층 상에서 PDSCH와 같은 채널 을 송신함으로써 네트워크와 UE 사이의 용량을 향상시킬 수 있으며, 여기서 하나 이상의 계층은 다중 경로로 송 신된다. 도 12는 gNB와 UE 사이에 2개의 RF 경로(1201 및 1202)를 갖는 다중 경로 환경의 예시이다. 도 12에 도시된 바와 같이, gNB는 2개의 계층 상에서 5G NR을 위한 PDSCH와 같은 다운링크 데이터 채널을 송신 하고 UE는 이를 수신하며, 여기서 각각의 계층은 TX 빔 상에서 송신되고 RX 빔 상에서 수신된다. 제어 채널(즉, 5G NR을 위한 PDCCH)은 데이터 채널(즉, PDSCH)과 연관된다. 제어 채널은 단일 TX 빔 상에서 gNB에 의해 송신되 고, 단일 RX 빔 상에서 UE에 의해 수신될 수 있다. 제어 채널의 TX 빔은 데이터 채널에 대한 TX 빔 중 하나일 수 있고, RRC 시그널링과 같은 상위 계층 시그널링을 사용하여 네트워크에 의해 설정될 수 있고/있거나 계층 1 제어 시그널링 및/또는 MAC CE를 사용하여 네트워크에 의해 업데이트될 수 있다. 일 실시예에서, 다운링크 데이터 채널에 대한 다중 빔 채널에서의 빔 인디케이션이 제공된다. 이러한 실시예에 서, 다운링크 데이터 채널은 PDSCH 채널일 수 있다. 일 예 1.1에서, 다운링크 데이터 채널의 모든 계층에는 동일한 TX 빔이 할당될 수 있다. 다운링크 데이터 채널 에 대한 하나의 TCI 상태가 있다. 다른 예 1.2에서, 데이터 채널의 각각의 계층에는 계층 특정 TX 빔이 할당될 수 있다. 하나의 옵션에서, 다운링 크 데이터 채널의 각각의 계층에 대한 하나의 TCI 상태는 하나의 TX 빔과 연관된다. 다른 예 1.2a에서, 데이터 채널의 DMRS의 각각의 안테나 포트에는 포트 특정 TX 빔이 할당될 수 있다. 하나의 옵션에서, 다운링크 데이터 채널의 DMRS의 각각의 안테나 포트에 대한 하나의 TCI 상태는 하나의 TX 빔과 연관 된다. 다른 예 1.3에서, 데이터 채널의 \"N\" 계층의 서브세트에는 TX 빔이 할당될 수 있다. 다운링크 데이터 채널의 각 각의 \"N\" 계층에 대해 하나의 TCI 상태가 있다. \"N\"은 RRC 설정과 같은 상위 계층에 의해 제공될 수 있다. 대안 적으로, 또는 부가적으로, \"N\"은 MAC CE 및/또는 L1 제어 시그널링에 의해 업데이트되고 지시될 수 있거나, \" N\"은 시스템 동작에서 명시될 수 있다. TX 빔 상의 N 계층 인덱스는 명시될 수 있으며, 예를 들어 인덱스는 연 속적일 수 있거나, \"N\" 계층의 서브세트와 함께 또는 별개로 RRC 또는/및 MAC CE 또는/및 DCI 시그널링에 의해 지시될 수 있다. 예를 들어, N의 값은 2인 것으로 명시될 수 있고, TX 빔은 2개의 안테나 포트를 갖는 하나의 CSI-RS 자원에 상응한다. 다른 예 1.3a에서, 데이터 채널의 DMRS의 \"N\" 안테나 포트의 서브세트에는 TX 빔이 할당될 수 있다. 다운링크 데이터 채널의 DMRS의 각각의 \"N\" 안테나 포트에 대해 하나의 TCI 상태가 있다. \"N\"은 RRC 설정과 같은 상위 계 층에 의해 제공될 수 있다. 대안적으로, 또는 부가적으로, \"N\"은 MAC CE 및/또는 L1 제어 시그널링에 의해 업데 이트되고 지시될 수 있거나, \"N\"은 시스템 동작에서 명시될 수 있다. TX 빔 상의 N 안테나 포트 인덱스는 명시 될 수 있으며, 예를 들어 인덱스는 연속적일 수 있거나, \"N\" 안테나 포트의 서브세트와 함께 또는 별개로 RRC 또는/및 MAC CE 또는/및 DCI 시그널링에 의해 지시될 수 있다. 예를 들어, N의 값은 2인 것으로 명시될 수 있고, TX 빔은 2개의 안테나 포트를 갖는 하나의 CSI-RS 자원에 상응한다. 다른 예 1.4에서, DL 데이터 채널은 2와 같은 다수의 코드워드를 통해 송신되고, 각각의 코드워드에는 TX 빔이 할당된다. 제1 코드워드의 계층은 제1 TX 빔 상에 있지만, 제2 코드워드의 계층은 제2 TX 빔 상에 있다. 제1 코 드워드에 대한 제1 TCI 상태 및 제2 코드워드에 대한 제2 TCI 상태가 있다. 다른 예 1.5에서, 1.1 내지 1.4의 예 중 하나에 따른 동작은 RRC 설정에 의해 지시될 수 있다. 대안적으로, 또 는 부가적으로, 1.1 내지 1.4의 예 중 하나에 따른 동작은 RRC 설정(RRC 설정 값)을 기반으로 하거나 명시된 설 정(시스템에 명시된 값)을 기반으로 하는 MAC CE 및/또는 L1 제어 시그널링에 의해 업데이트될 수 있다.일 예에서, DL 데이터 채널의 계층은 DMRS 포트 또는/및 PDSCH 포트와 연관될 수 있다. 상술한 실시예의 경우, TX 빔은 CSI-RS 자원, SRS 자원, SSB 자원, 또는 DMRS 자원과 같은 기준 또는 소스 RS 자원에 상응할 수 있다. 상응은 QCL(quasi-colocation) 관계를 의미한다. 기준 RS 자원은 자원 인덱스를 포함하 거나 자원 인덱스로부터 도출될 수 있다. 다운링크 데이터 채널에 대한 TCI 상태는 MAC CE를 통해 또는 L1 제어 시그널링, 또는 이 둘의 조합에 의해 업 데이트될 수 있으며, 빔 인디케이션 시그널링으로서 지칭될 수 있다. 다른 예 1.6에서, UE는 DL 송신의 다수의 계층을 수신하도록 설정될 수 있다. 일 예에서, 계층의 수는 최대 2 또는 4일 수 있다. 예시를 위해, 다음의 예에서, 계층의 수는 최대 2인 것으로 가정된다. 일 예에서, 계층은 PDSCH 포트에 상응한다. 일 예 1.6.1에서, UE는 동일한 빔(단일 TCI 상태를 통해 지시됨)을 사용하여 하나 또는 두 개의 PDSCH 포트(계 층) 상에서 수신할 수 있다. gNB는 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 하 나의 빔 상의 다수의 PDSCH 포트(즉, 계층)를 UE에 설정/업데이트할 수 있다. 다른 예 1.6.2에서, UE는 제1 빔을 사용하여 하나의 포트(계층) 상에서 수신할 수 있다. UE는 제2 빔을 사용하 여 제2 계층을 수신할 수 있다. 제1 빔은 TCI 상태 인디케이션을 통해 지시되고, 제2 빔은 UE에 의해 결정된다. UE가 2개의 계층 상에서 수신하도록 설정되고, UE가 빔마다 하나의 계층 상에서 수신하도록 설정되는 경우, UE 는 별개의 빔 상에서 각각의 계층을 수신할 수 있다. UE에는 PDSCH 채널(DL 데이터 채널)의 제1 계층의 수신을 위한 빔 인디케이션 메시지에서 제1 빔에 대한 제1 TCI 상태가 시그널링될 수 있다. UE는 다음의 인스턴스 (instance)에 따라 PDSCH 채널의 제2 계층의 수신을 위한 제2 빔을 결정할 수 있다. 일 인스턴스에서, UE는 다수의 CSI-RS(또는 SSB)에 상응하는 CRI(또는 SSBRI) 및 L1-RSPR/L1-SINR을 포함하는 빔 보고를 보고한다. PDSCH의 제1 계층과 연관된 지시된 TCI 상태가 m번째로 높은 L1-RSRP/L1-SINR을 갖는 CRI (또는 SSBRI)에 상응하는 경우, UE는 (제2 RX 빔과 연관된) 제2 TCI 상태가 (m+1)번째로 높은 L1-RSRP/L1-SINR 을 갖는 CRI에 상응한다고 가정한다. 일 예에서, m=1이다. 다른 인스턴스에서, PDSCH의 제1 계층과 연관된 지시된 TCI 상태가 m번째로 높은 L1-RSRP/L1-SINR을 갖는 CRI에 상응하고, 인 경우, UE는 (제2 RX 빔과 연관된) 제2 TCI 상태가 가장 높은 L1-RSRP/L1-SINR(즉, ) 을 갖는 CRI에 상응한다고 가정한다. 또 다른 인스턴스에서, 제2 TCI 상태는 RRC 시그널링 및/또는 MAC-CE 시그널링을 통해 제2 계층의 제2 빔에 대 해 설정/업데이트되며, 여기서 제2 TCI 상태에 대한 업데이트 레이트(update rate)는 제1 TCI 상태에 대한 업데 이트 레이트보다 느릴 수 있다. 또 다른 인스턴스에서, UE는 블라인드 디코딩(blind decoding)을 수행하여 제2 빔이 제2 계층을 수신하기 위한 제2 TCI 상태를 결정한다. 제2 계층에 대한 후보 TCI 상태의 세트는 시스템 동작에서 고정/명시되거나 (RRC 또 는/및 MAC CE 또는/및 DCI를 통해) 설정될 수 있다. 또 다른 인스턴스에서, gNB는 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 제1 빔 에 대한 제1 TCI 상태와 제2 빔에 대한 제2 TCI 상태 사이의 연관을 UE에 설정/업데이트한다. 제1 TCI 상태가 PDSCH의 제1 계층의 수신을 위해 시그널링될 때, 연관된 제2 TCI 상태는 PDSCH의 제2 계층의 수신을 위해 사용 된다. 또 다른 인스턴스에서, UE는 CSI(빔) 보고를 통해 제1 빔에 대한 제1 TCI 상태와 제2 빔에 대한 제2 TCI 상태 사이의 연관을 gNB에 추천한다. 제1 TCI 상태가 PDSCH의 제1 계층의 수신을 위해 시그널링될 때, 연관된 제2 TCI 상태는 PDSCH의 제2 계층의 수신을 위해 사용된다. 또 다른 인스턴스에서, 둘 이상의 인스턴스가 시스템 동작에서 명시될 수 있으며, gNB는 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 PDSCH의 계층의 수신을 위해 사용할 인스턴스를 UE에 설정/ 업데이트한다. 일 실시예에서, 다운링크 제어 채널에 대한 다중 빔 채널에서의 빔 인디케이션이 제공된다. 이러한 실시예에서, 다운링크 데이터 채널은 PDCCH 채널일 수 있다. 일 예 2.1 및 다음의 예 1.1에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널의 TCI 상태를 따를 수 있다. 다른 예 2.2 및 다음의 예 1.2, 예 2.2.1에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널의 제1 계층과 같은 고정/명시된 계층의 TCI 상태를 따른다. 일 예 2.2.1a에서, 다운링크 제어 채널의 TCI 상태는 고정/명시된 규칙에 기초하여 결정된다. 일 예에서 규칙은 TCI 상태 ID를 기반으로 한다. 예를 들어, TCI 상태는 가장 낮은 TCI 상태 ID를 가진 상태이다. 다른 예 2.2.2에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널의 계층의 TCI 상태를 따르며, 여기 서 다운링크 데이터 채널의 계층의 인덱스는 RRC 시그널링 및/또는 MAC CE 시그널링, 및/또는 L1 제어 시그널링 을 통해 설정된다. 일 예에서, 다운링크 제어 채널에 사용되는 TCI 상태를 갖는 다운링크 데이터 채널의 계층의 인덱스는 빔 인디케이션 메시지 또는 다운링크 데이터 채널의 수신을 스케줄링하는 DCI 포맷으로 제공된다. 예 는 도 13에 예시되어 있다. 도 13은 본 개시의 실시예에 따른 예시적인 TCI 상태 설정을 도시한다. 도 13에 도시된 TCI 상태 설정 의 실시예는 단지 예시를 위한 것이다. 다른 예 2.2.2a에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널의 계층의 TCI 상태를 따르며, 여 기서 다운링크 데이터 채널의 계층의 인덱스는 UE로부터의 보고에 기초하여, 예컨대 적어도 하나의 빔 보고에 기초하여 결정된다. 다른 예 2.2.3에서, 다운링크 제어 채널이 할당되고 따라서 예를 들어 반복 이득 또는 공간 다이버시티(spatial diversity)를 위한 다운링크 데이터 채널의 모든 TX 빔(TCI 상태) 상에서 송신된다. 다른 예 2.2.4에서, 다운링크 제어 채널이 할당되고 따라서 공간 다이버시티를 위한 다운링크 데이터 채널의 TX 빔(TCI 상태)의 서브세트 상에서 송신된다. TX 빔(TCI 상태)의 서브세트는 예를 들어 UE 그룹 공통 PDCCH에 의 한 RRC 시그널링, 및/또는 MAC CE 시그널링, 및/또는 L1 제어 시그널링을 통해 설정될 수 있다. 일 예에서, TX 빔(TCI 상태)의 서브세트는 빔 인디케이션 메시지 또는 다운링크 데이터 채널의 수신을 스케줄링하는 DCI 포맷 으로 제공된다. 일 예에서, TX 빔(TCI 상태)의 서브세트는 예를 들어 2로 고정/명시된다. 다른 예 2.2a 및 다음의 예 1.2a, 예 2.2a.1에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널의 DMRS의 제1 안테나 포트와 같은 고정/명시된 안테나 포트의 TCI 상태를 따른다. 다른 예 2.3 및 다음의 예 1.3에서, 일 예 2.3.1에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널 의 \"N\" 계층의 제1 그룹/서브세트의 TCI 상태를 따른다. 다른 예 2.3.2에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널의 \"N\" 계층의 그룹/서브세트의 TCI 상태를 따르며, 여기서 다운링크 데이터 채널의 \"N\" 계층의 그룹의 인덱스는 RRC 시그널링 및/또는 MAC CE 및/ 또는 L1 제어 시그널링을 통해 설정된다. 일 예에서, 다운링크 제어 채널에 사용되는 TCI 상태를 갖는 다운링크 데이터 채널의 \"N\" 계층의 그룹의 인덱스는 빔 인디케이션 메시지 또는 다운링크 데이터 채널의 수신을 스케줄 링하는 DCI 포맷으로 제공된다. 예는 도 14에 예시되어 있다. 일 예에서, \"N\" 또는/및 그룹 \"N\" 계층의 인덱스 는 시스템 동작에서 고정/명시된다. 도 14는 본 개시의 실시예에 따른 다른 예시적인 TCI 상태 설정을 도시한다. 도 14에 도시된 TCI 상태 설 정의 실시예는 단지 예시를 위한 것이다. 다른 예 2.3.3에서, 다운링크 제어 채널이 할당되고 따라서 공간 다이버시티를 위한 다운링크 데이터 채널의 모 든 TX 빔(TCI 상태) 상에서 송신된다. 다른 예 2.3.4에서, 다운링크 제어 채널이 할당되고 따라서 공간 다이버시티를 위한 다운링크 데이터 채널의 TX 빔(TCI 상태)의 서브세트 상에서 송신된다. TX 빔(TCI 상태)의 서브세트는 RRC 시그널링, 및/또는 MAC CE 시그 널링, 및/또는 L1 제어 시그널링을 통해 설정될 수 있다. 일 예에서, TX 빔(TCI 상태)의 서브세트는 빔 인디케 이션 메시지 또는 다운링크 데이터 채널의 수신을 스케줄링하는 DCI 포맷으로 제공된다. 다른 예 2.3a 및 다음의 예 1.3a에서, 일 예 2.3a.1에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채 널의 DMRS의 \"N\" 안테나 포트의 제1 그룹/서브세트의 TCI 상태를 따른다. 다른 예 2.4 및 다음의 예 1.4에서, 일 예 2.4.1에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널 의 제1 코드워드의 TCI 상태를 따른다.다른 예 2.4.2에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널의 코드워드의 TCI 상태를 따르며, 여기서 다운링크 데이터 채널의 코드워드의 인덱스는 RRC 시그널링, 및/또는 MAC CE 시그널링, 및/또는 L1 제어 시그널링을 통해 설정된다. 일 예에서, 다운링크 제어 채널에 사용되는 TCI 상태를 갖는 다운링크 데이터 채널 의 코드워드의 인덱스는 다운링크 데이터 채널 수신을 스케줄링하는 빔 인디케이션 메시지 또는 DCI 포맷으로 제공된다. 예는 도 15에 예시되어 있다. 도 15는 본 개시의 실시예에 따른 또 다른 예시적인 TCI 상태 설정을 도시한다. 도 15에 도시된 TCI 상태 설정의 실시예는 단지 예시를 위한 것이다. 다른 예 2.4.3에서, 다운링크 제어 채널이 할당되고 따라서 공간 다이버시티를 위한 다운링크 데이터 채널의 모 든 TX 빔(TCI 상태) 상에서 송신된다. 다른 예 2.4.4에서, 다운링크 제어 채널이 할당되고 따라서 공간 다이버시티를 위한 다운링크 데이터 채널의 TX 빔(TCI 상태)의 서브세트 상에서 송신된다. TX 빔(TCI 상태)의 서브세트는 RRC 시그널링, 및/또는 MAC CE 시그 널링, 및/또는 L1 제어 시그널링을 통해 설정될 수 있다. 일 예에서, TX 빔(TCI 상태)의 서브세트는 빔 인디케 이션 메시지 또는 다운링크 데이터 채널의 수신을 스케줄링하는 DCI 포맷으로 제공된다. 다른 예 2.5 및 다음의 예 1.5에서, 2.1 내지 2.4의 예 중 하나를 따르는 동작은 RRC 시그널링에 의해 설정될 수 있다. 대안적으로, 또는 부가적으로, 2.1 내지 2.4의 예 중 하나를 따르는 동작은 MAC CE 및/또는 L1 제어 시그널링에 의해 업데이트될 수 있다. 다른 예 2.6에서, 다운링크 제어 채널의 TX 빔(TCI 상태)은 본 개시에서 언급된 실시예에서 결정된 바와 같은 업링크 제어 채널의 TX 빔(TCI 상태 또는 공간적 관계)을 따른다. 다른 예 2.7에서, CORESET에는 DL 제어 채널의 수신에 대한 상응하는 QCL 가정을 지시된 다수의 TCI 상태가 설 정될 수 있다. 다른 예 2.8에서, 검색 공간 IE에는 하나 이상의 CORESET가 설정/매핑될 수 있으며, 여기서 CORESET은 하나 이 상의 TCI 상태를 가질 수 있다. 여기서, 하나 이상의 TCI 상태는 다운링크 데이터 채널의 계층/계층 그룹/코드 워드/안테나 포트의 TCI 상태에 기초하여 결정된다. 다른 예 2.9에서, UE는 DL 데이터 채널에 대해 설정되고 지시되는 TCI 상태의 세트로부터 DL 제어 채널의 수신 을 위한 TCI 상태를 지시하거나 시그널링하지 않는다. 대신에, UE는 DL 데이터 채널에 대해 설정되고 지시되는 TCI 상태에 기초하여 상이한 TCI 상태 가정을 사용하여 DL 제어 채널의 수신 및 DL 제어 채널에 의해 제공되는 DCI 포맷의 디코딩과 같은 다수의 수신기 처리 기능을 수행할 수 있다. 일 예 2.9.1에서, CORESET에는 다운링크 데이터 채널에 대해 설정되고 지시되는 TCI 상태의 세트로부터 다수의 TCI 상태가 설정될 수 있다. 다른 예 2.9.2에서, 검색 공간 IE에는 다수의 CORESET가 설정될 수 있으며, 여기서 CORESET은 다수의 TCI 상태 를 가질 수 있다. 다수의 TCI 상태는 DL 데이터 채널에 대해 설정되고 지시되는 TCI 상태를 기반으로 결정된다. 다른 예 2.9.3에서, UE에는 다수의 검색 공간 세트가 설정되고, 검색 공간 세트는 다수의 TCI 상태를 가질 수 있는 CORESET과 연관/매핑된다. 다수의 TCI 상태는 DL 데이터 채널이 설정되고 지시되는 TCI 상태의 세트로부터 결정된다. 상술한 실시예에 대해, TX 빔은 CSI-RS 자원, SRS 자원, SSB 자원, 또는 DMRS 자원과 같은 기준 또는 소스 RS 자원에 상응할 수 있으며, 여기서 상응은 QCL 관계를 의미한다. 기준 RS 자원은 자원 인덱스를 포함하거나 자원 인덱스로부터 도출될 수 있다. 상술한 예시적인 실시예에서, 다운링크 제어 채널의 TCI 상태는 다운링크 데이터 채널에 대한 연관된 TCI 상태와 함께 업데이트된다. 즉, 예 1.1 내지 예 1.6.2에서 TCI 상태 시그널링은 다운링 크 데이터 및 제어 채널 모두에 상응하고, 다운링크 제어 채널의 업데이트된 TCI 상태는 다운링크 데이터 채널 에 대한 것과 관련된다. 다른 예 2.10 및 다음의 예 1.6에서, UE는 DL 송신의 다수의 계층을 수신하도록 설정될 수 있다. 일 예에서, 계 층의 수는 최대 2 또는 4일 수 있다. 예시를 위해, 다음의 예에서, 계층의 수는 최대 2인 것으로 가정된다. 일 예에서, 계층은 PDSCH DMRS 안테나 포트에 상응한다. PDCCH는 단일 계층 상에서 수신될 수 있다. UE가 2개의 계층 상에서 PDSCH를 수신하도록 설정되고, UE가 빔마다 하나의 계층 상에서 수신하도록 설정되며, UE가 PDSCH에 대해 하나의 빔을 지시하는 경우, UE는 다음의 인스턴스에 따라 PDCCH의 수신을 위한 빔을 결정할수 있다. 일 인스턴스에서, PDSCH에 대해 지시된 TCI 상태는 PDCCH의 수신을 위해 사용되는 빔을 결정한다. 다른 인스턴스에서, 가장 높은 L1-RSRP/L1-SINR과 연관된 PDSCH에 대해 결정된 TCI 상태는 PDCCH의 수신을 위해 사용되는 빔을 결정한다. 또 다른 인스턴스에서, gNB는 RRC 시그널링 및/또는 MAC-CE 시그널링을 통해 PDCCH 수신을 위해 TCI 상태를 따 르는 PDSCH 계층 인덱스를 UE에 설정/업데이트한다. 또 다른 인스턴스에서, UE는 PDSCH 수신을 위해 사용되는 2개의 TCI 상태 중 PDCCH의 수신을 위한 TCI 상태를 결정하기 위해 블라인드 디코딩을 수행한다. 또 다른 인스턴스에서, UE는 PDSCH의 2개의 TCI 상태에 따라 공간 다이버시티를 위해 2개의 빔 상에서 PDCCH를 수신한다. 또 다른 인스턴스에서, 둘 이상의 인스턴스가 시스템 동작에서 명시될 수 있고, gNB는 PDCCH의 수신을 위해 사 용할 인스턴스를 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 UE에 설정/업데이트 한다. 일 실시예에서, 업링크 데이터 채널에 대한 다중 빔 채널에서의 빔 인디케이션이 제공된다. 이러한 실시예에서, 업링크 데이터 채널은 PUSCH 채널일 수 있다. 일 예 3.1에서, 업링크 데이터 채널의 모든 계층에는 동일한 TX 빔이 할당된다. 업링크 데이터 채널에 대한 하 나의 TCI 상태 또는 공간적 관계가 있다. 다른 예 3.2에서, 업링크 데이터 채널의 각각의 계층은 계층 특정 TX 빔을 갖는다. 업링크 데이터 채널의 각각 의 계층에 대해 하나의 TCI 상태 또는 공간적 관계가 있다. 다른 예 3.2a에서, 업링크 데이터 채널의 DMRS의 각각의 안테나 포트는 안테나 포트 특정 TX 빔을 갖는다. 업링 크 데이터 채널의 DMRS의 각각의 안테나 포트에 대해 하나의 TCI 상태 또는 공간적 관계가 있다. 다른 예 3.3에서, 업링크 데이터 채널의 \"N\" 계층의 각각의 서브세트는 TX 빔 상에 있다. 업링크 데이터 채널의 \"N\" 계층의 각각의 서브세트에 대해 하나의 TCI 상태 또는 공간적 관계가 있다. \"N\" 계층의 서브세트는 RRC 시 그널링에 의해 설정될 수 있다. 대안적으로, 또는 부가적으로, \"N\" 계층의 서브세트는 MAC CE 및/또는 L1 제어 시그널링에 의해 업데이트될 수 있거나 시스템 동작에서 고정/명시될 수 있다. TX 빔 상의 N 계층 인덱스는 연 속적인 계층 인덱스와 같이 고정/명시될 수 있거나, (RRC 또는/및 MAC CE 또는/및 DCI/L1 제어 시그널링에 의해) \"N\" 계층의 서브세트와 함께 또는 별개로 설정될 수 있다. 다른 예 3.3a에서, 업링크 데이터 채널의 DMRS의 \"N\" 안테나 포트의 각각의 서브세트는 TX 빔 상에 있다. 업링 크 데이터 채널의 DMRS의 \"N\" 안테나 포트의 각각의 서브세트에 대해 하나의 TCI 상태 또는 공간적 관계가 있다. \"N\" 안테나 포트의 서브세트는 RRC 시그널링에 의해 설정될 수 있다. 대안적으로, 또는 부가적으로, \"N\" 안테나 포트의 서브세트는 MAC CE 및/또는 L1 제어 시그널링에 의해 업데이트될 수 있거나 시스템 동작에서 고 정/명시될 수 있다. TX 빔 상의 N 안테나 포트 인덱스는 연속적인 안테나 인덱스와 같이 고정/명시될 수 있거나, (RRC 또는/및 MAC CE 또는/및 DCI/L1 제어 시그널링에 의해) \"N\" 안테나 포트의 서브세트와 함께 또는 별개로 설정될 수 있다. 다른 예 3.4에서, UL 데이터 채널은 다수의(예를 들어, 2) 코드워드를 통해 송신되고, 각각의 코드워드는 TX 빔 상에 있다. 제1 코드워드의 계층은 제1 TX 빔 상에 있지만, 제2 코드워드의 계층은 제2 TX 빔 상에 있다. 제1 코드워드에 대한 제1 TCI 상태 또는 공간적 관계 및 제2 코드워드에 대한 제2 TCI 상태 또는 공간적 관계가 있 다. 다른 예 3.5에서, 3.1 내지 3.4의 예 중 하나를 따르는 동작은 RRC 설정에 의해 설정될 수 있고, 대안적으로, 또는 부가적으로, 3.1 내지 3.4의 예 중 하나를 따르는 동작은 MAC CE 및/또는 L1 제어 시그널링에 의해 동적으 로 업데이트될 수 있다. 일 예에서, UL 데이터 채널의 계층은 DMRS 포트 또는/및 PUSCH 포트와 연관될 수 있다. 다른 예 3.6에서, UE는 빔 상의 다운링크 채널의 수신을 위한 다운링크 RX 공간 필터에 기초하여 빔 상의 업링 크 채널의 송신을 위한 업링크 TX 공간 필터를 결정할 수 있다. 예 1.1 내지 예 1.6.2의 예에 뒤따라, 업링크 데이터 채널은 하나 이상의 Tx 빔 상에서 송신될 수 있다.일 예 3.6.1에서, UE는 단일 TX 빔 상에서 업링크 채널을 송신한다. 하나의 옵션에서, UL TX 빔의 TCI 상태 또 는 공간적 관계의 인덱스는 다운링크 데이터 채널의 제1 계층/계층의 그룹/코드워드/안테나 포트의 TCI 상태와 같은 다운링크 데이터 채널의 TCI 상태에 대한 고정/명시된 매핑을 기반으로 한다. 대안적으로, TX 빔의 TCI 상 태 또는 공간적 관계의 인덱스는 다운링크 데이터 채널의 계층/계층의 그룹/코드워드/안테나 포트 중 하나의 TCI 상태의 인덱스인 것으로 설정된다. 이러한 설정은 RRC 및/또는 MAC CE 및/또는 L1 제어 시그널링을 통해 이 루어질 수 있다. 다른 예 3.6.2에서, UE는 다운링크 채널의 모든 빔 상에서 업링크 채널을 송신한다. 하나의 옵션에서, 업링크 TX 빔의 TCI 상태 또는 공간적 관계는 UL 계층/계층의 그룹/코드워드/안테나 포트와 다운링크 계층/계층의 그룹 /코드워드/안테나 포트 사이의 고정 매핑에 기반한다. 예를 들어, 업링크 채널이 2개의 계층 상에서 송신되고, 다운링크 채널이 4개의 계층 상에서 송신되며, 2개의 빔이 설정되면, 다운링크 계층 0 및 1과 업링크 계층 0은 제1 빔에 할당되고, 다운링크 계층 2 및 3과 업링크 계층 1은 제2 빔에 할당된다. 이것은 표 1에 예로서 예시된 다. [표 1] 모든 TCI 상태를 다운링크 채널의 계층과 업링크 채널의 계층에 매핑한다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "대안적으로, 업링크 TX 빔의 TCI 상태 또는 공간적 관계는 UL 계층/계층의 그룹/코드워드/안테나 포트와 다운링 크 계층/계층의 그룹/코드워드/안테나 포트를 매핑하는 설정에 기반한다. 이러한 설정은 RRC 및/또는 MAC CE 및 /또는 L1 제어 시그널링을 통해 이루어질 수 있다. 다른 예 3.6.3에서, UE는 다운링크 채널의 빔의 서브세트 상에서 업링크 채널을 송신한다. 하나의 옵션에서, 업 링크 TX 빔의 TCI 상태 또는 공간적 관계는 UL 계층/계층의 그룹/코드워드/안테나 포트와 다운링크 계층/계층의 그룹/코드워드/안테나 포트의 서브세트 사이의 고정/명시된 매핑에 기반한다. 예를 들어, 업링크 채널이 2개의 계층 상에서 송신되고, 다운링크 채널이 4개의 계층 상에서 송신되며, 2개의 빔이 설정되면, 다운링크 계층 0 및 업링크 계층 0은 제1 빔에 할당되고, 다운링크 계층 1 및 업링크 계층 1은 제2 빔에 할당된다. 나머지 2개의 다운링크 계층은 각각 제3 및 제4 빔에 할당된다. 이것은 표 2에 예로서 예시된다. [표 2] 모든 TCI 상태를 다운링크 채널의 계층에 매핑하고, TCI 상태의 서브세트를 업링크 채널의 계층에 매핑한다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "대안적으로, 업링크 TX 빔의 TCI 상태 또는 공간적 관계는 UL 계층/계층의 그룹/코드워드/안테나 포트와 다운링 크 계층/계층의 그룹/코드워드/안테나 포트의 서브세트를 매핑하는 설정에 기반한다. 이러한 설정은 RRC 및/또 는 MAC CE 및/또는 L1 제어 시그널링을 통해 이루어질 수 있다. 다른 예 3.6.4에서, UE는 다운링크 채널의 빔의 수퍼세트(superset) 상에서 업링크 채널을 송신한다. 하나의 옵 션에서, 업링크 TX 빔의 TCI 상태 또는 공간적 관계는 UL 계층/계층의 그룹/코드워드/안테나 포트의 서브세트와 다운링크 계층/계층의 그룹/코드워드/안테나 포트 사이의 고정/명시된 매핑에 기반한다. 서브세트에 없는 부가 적인 UL 계층/계층의 그룹/코드워드/안테나 포트에는 TCI 상태 또는 공간적 관계가 설정된다. 예를 들어, 업링 크 채널이 4개의 계층 상에서 송신되고, 다운링크 채널이 4개의 계층 상에서 송신되며, 2개의 빔이 다운링크 채 널에 대해 설정되어, 다운링크 계층 0 및 1과 업링크 계층 0은 제1 빔에 할당되고, 다운링크 계층 2 및 3과 업 링크 계층 1은 제2 빔에 할당된다. 나머지 2개의 업링크 계층은 각각 제3 및 제4 빔에 설정되고 할당된다. 이것 은 표 3에 예로서 예시된다. [표 3] TCI 상태의 서브세트를 다운링크 채널의 계층에 매핑하고, 모든 TCI 상태를 업링크 채널의 계층에 매핑한다. 대안적으로, 업링크 TX 빔의 TCI 상태 또는 공간적 관계는 UL 계층/계층의 그룹/코드워드/안테나 포트의 서브세 트와 다운링크 계층/계층의 그룹/코드워드/안테나 포트를 매핑하는 설정에 기반한다. 서브세트에 없는 부가적인 UL 계층/계층의 그룹/코드워드/안테나 포트에는 RRC, 및/또는 MAC CE 시그널링, 및/또는 L1 제어 시그널링을 통 해 TCI 상태 또는 공간적 관계가 설정된다. 상술한 실시예의 경우, TX 빔은 CSI-RS 자원, SRS 자원, SSB 자원, 또는 DMRS 자원과 같은 기준 또는 소스 RS 자원에 상응할 수 있다. 상응은 QCL 관계를 의미한다. 기준 RS 자원은 자원 인덱스를 포함하거나 자원 인덱스로 부터 도출될 수 있다. 다른 예 3.7에서, UE는 DL 송신의 다수의 계층을 송신하도록 설정될 수 있다. 일 예에서, 계층의 수는 최대 2 또는 4일 수 있다. 예시를 위해, 다음의 예에서, 계층의 수는 최대 2인 것으로 가정된다. 일 예에서, 계층은 PUSCH 포트에 상응한다. 일 예 3.7.1에서, UE는 동일한 빔(단일 TCI 상태/공간적 관계를 통해 지시됨)을 사용하여 하나 또는 두 개의 PUSCH 포트(계층) 상에서 송신할 수 있다. gNB는 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그 널링을 통해 하나의 빔 상의 다수의 PUSCH 포트(즉, 계층)를 UE에 설정/업데이트할 수 있다. 다른 예 3.7.2에서, UE는 제1 빔을 사용하여 하나의 포트(계층) 상에서 송신할 수 있다. UE는 제2 빔 상에서 제 2 계층을 송신할 수 있다. 제1 빔은 TCI 상태 인디케이션을 통해 지시되고, 제2 빔은 UE에 의해 결정된다. UE가 2개의 계층 상에서 송신하도록 설정되고, UE가 빔마다 하나의 계층 상에서 송신하도록 설정되는 경우, UE 는 별개의 빔 상에서 각각의 계층을 송신할 수 있다. UE에는 PUSCH 채널(UL 데이터 채널)의 제1 계층의 송신을 위한 빔 인디케이션 메시지에서 제1 빔에 대한 제1 TCI 상태/공간적 관계가 시그널링될 수 있다. UE는 다음의 인스턴스에 따라 PUSCH 채널의 제2 계층의 송신을 위한 제2 빔을 결정할 수 있다. 일 인스턴스에서, UE는 다수의 CSI-RS(또는 SSB)에 상응하는 CRI(또는 SSBRI) 및 L1-RSPR/L1-SINR을 포함하는 빔 보고를 보고한다. PUSCH의 제1 계층과 연관된 지시된 TCI 상태/공간적 관계가 m번째로 높은 L1-RSRP/L1-SINR 을 갖는 CRI(또는 SSBRI)에 상응하는 경우, UE는 (제2 TX 빔과 연관된) 제2 TCI 상태/공간적 관계가 (m+1)번째 로 높은 L1-RSRP/L1-SINR을 갖는 CRI에 상응한다고 가정한다. 일 예에서, m=1이다. 다른 인스턴스에서, PUSCH의 제1 계층과 연관된 지시된 TCI 상태/공간적 관계가 m번째로 높은 L1-RSRP/L1- SINR을 갖는 CRI에 상응하고, 인 경우, UE는 (제2 TX 빔과 연관된) 제2 TCI 상태/공간적 관계가 가장 높 은 L1-RSRP/L1-SINR(즉, )을 갖는 CRI에 상응한다고 가정한다. 또 다른 인스턴스에서, 제2 TCI 상태/공간적 관계는 RRC 시그널링 및/또는 MAC-CE 시그널링을 통해 제2 계층의 제2 빔에 대해 설정/업데이트되며, 여기서 제2 TCI 상태/공간적 관계에 대한 업데이트 레이트는 제1 TCI 상태/ 공간적 관계에 대한 업데이트 레이트보다 느릴 수 있다. 또 다른 인스턴스에서, 제2 빔이 제2 계층을 송신하기 위한 제2 TCI 상태/공간적 관계가 선택된다. gNB는 블라 인드 디코딩을 통해 PUSCH의 제2 계층에 대한 제2 TCI 상태/공간적 관계를 결정한다. 제2 계층에 대한 후보 TCI 상태의 세트는 시스템 동작에서 고정/명시되거나 (RRC 또는/및 MAC CE 또는/및 DCI/L1 제어 시그널링을 통해) 설정될 수 있다. 또 다른 인스턴스에서, gNB는 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 제1 빔 에 대한 제1 TCI 상태/공간적 관계와 제2 빔에 대한 제2 TCI 상태/공간적 관계 사이의 연관을 UE에 설정/업데이 트한다. 제1 TCI 상태/공간적 관계가 PUSCH의 제1 계층의 송신을 위해 시그널링될 때, 연관된 제2 TCI 상태/공 간적 관계는 PUSCH의 제2 계층의 송신을 위해 사용된다. 또 다른 인스턴스에서, gNB는 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 제1 빔 에 대한 제1 TCI 상태/공간적 관계와 제2 빔에 대한 제2 TCI 상태/공간적 관계 사이의 연관을 UE에 설정/업데이 트한다. 제1 TCI 상태/공간적 관계가 PUSCH의 제1 계층의 송신을 위해 시그널링될 때, 연관된 제2 TCI 상태/공 간적 관계는 PUSCH의 제2 계층의 송신을 위해 사용된다. 또 다른 인스턴스에서, 둘 이상의 인스턴스가 시스템 동작에서 명시될 수 있으며, gNB는 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 PUSCH의 계층의 송신을 위해 사용할 인스턴스를 UE에 설정/ 업데이트한다. PDSCH 수신 및 PUSCH 송신에 공통 방식이 사용될 수 있거나 별개의 방식이 사용될 수도 있다.일 실시예에서, 업링크 제어 채널에 대한 다중 빔 채널에서의 빔 인디케이션이 제공된다. 이러한 실시예에서, 업링크 데이터 채널은 PUCCH 채널일 수 있다. 일 예 4.1 및 다음의 예 3.1에서, 업링크 제어 채널의 TCI 상태 또는 공간적 관계는 업링크 데이터 채널의 TCI 상태 또는 공간적 관계를 따를 수 있다. 다른 예 4.2 및 다음의 예 3.2, 일 예 4.2.1에서, 업링크 제어 채널의 TCI 상태 또는 공간적 관계는 업링크 데 이터 채널의 제1 계층과 같은 고정/명시된 계층의 TCI 상태 또는 공간적 관계를 따른다. 일 예 4.2.1a에서, 업링크 제어 채널의 TCI 상태는 고정/명시된 규칙에 기초하여 결정된다. 일 예에서, 규칙은 가장 낮은 TCI 상태 ID와 같은 TCI 상태 ID 또는 공간적 관계를 기반으로 한다. 다른 예 4.2.2에서, 업링크 제어 채널의 TCI 상태 또는 공간적 관계는 업링크 데이터 채널의 계층의 TCI 상태 또는 공간적 관계를 따르며, 여기서 업링크 데이터 채널의 계층의 인덱스는 RRC, 및/또는 MAC CE, 및/또는 L1 제어 시그널링을 통해 설정된다. 일 예에서, 업링크 제어 채널에 사용되는 TCI 상태 또는 공간적 관계를 갖는 업링크 데이터 채널의 계층의 인덱스는 빔 인디케이션 메시지 또는 업링크 데이터 채널의 송신을 스케줄링하는 DCI 포맷으로 제공된다. 예는 도 13에 예시되어 있다. 도 16은 본 개시의 실시예에 따른 또 다른 예시적인 TCI 상태 설정을 도시한다. 도 16에 도시된 TCI 상태 설정의 실시예는 단지 예시를 위한 것이다. 다른 예 4.2.2a에서, 업링크 제어 채널의 TCI 상태는 업링크 데이터 채널의 계층의 TCI 상태 또는 공간적 관계 를 따르며, 여기서 업링크 데이터 채널의 계층의 인덱스는 적어도 하나의 빔 보고와 같은 UE 보고에 기초하여 결정된다. 다른 예 4.2.3에서, 업링크 제어 채널이 할당되고 따라서 예를 들어 반복 이득 또는 공간 다이버시티를 위한 업 링크 데이터 채널의 모든 TX 빔(TCI 상태 또는 공간적 관계) 상에서 송신된다. 다른 예 4.2.4에서, 업링크 제어 채널이 할당되고 따라서 예를 들어 반복 이득 또는 공간 다이버시티를 위한 업 링크 데이터 채널의 TX 빔(TCI 상태 또는 공간적 관계)의 서브세트 상에서 송신된다. TX 빔(TCI 상태 또는 공간 적 관계)의 서브세트는 RRC, 및/또는 MAC CE, 및/또는 L1 제어 시그널링을 통해 설정될 수 있다. 일 예에서, TX 빔(TCI 상태 또는 공간적 관계)의 서브세트는 빔 인디케이션 메시지 또는 업링크 데이터 채널 송신을 스케줄링 하는 DCI 포맷으로 제공된다. 일 예에서, TX 빔(TCI 상태 또는 공간적 관계)의 서브세트는 예를 들어 2로 고정/ 명시된다. 다른 예 4.2a 및 다음의 예 3.2a, 일 예 4.2a.1에서, 업링크 제어 채널의 TCI 상태 또는 공간적 관계는 업링크 데이터 채널의 DMRS의 제1 안테나 포트와 같은 고정/명시된 안테나 포트의 TCI 상태 또는 공간적 관계를 따른다. 다른 예 4.3 및 다음의 예 3.3에서, 다음의 하위 예가 더 고려될 수 있다. 일 예 4.3.1에서, 업링크 제어 채널 의 TCI 상태 또는 공간적 관계는 업링크 데이터 채널의 \"N\" 계층의 제1 그룹의 TCI 상태 또는 공간적 관계를 따 른다. 다른 예 4.3.2에서, 업링크 제어 채널의 TCI 상태 또는 공간적 관계는 업링크 데이터 채널의 \"N\" 계층의 그룹의 TCI 상태 또는 공간적 관계를 따르며, 여기서 업링크 데이터 채널의 \"N\" 계층의 그룹의 인덱스는 RRC, 및/또는 MAC CE, 및/또는 L1 제어 시그널링을 통해 설정된다. 일 예에서, 업링크 제어 채널에 사용되는 TCI 상태 또는 공간적 관계를 갖는 업링크 데이터 채널의 \"N\" 계층의 그룹의 인덱스는 빔 인디케이션 메시지 또는 업링크 데이 터 채널의 송신을 스케줄링하는 DCI 포맷으로 제공된다. 예는 도 17에 예시되어 있다. 일 예에서, \"N\" 또는/및 그룹 \"N\" 계층의 인덱스는 시스템 동작에서 고정/명시된다. 도 17은 본 개시의 실시예에 따른 또 다른 예시적인 TCI 상태 설정을 도시한다. 도 17에 도시된 TCI 상태 설정의 실시예는 단지 예시를 위한 것이다. 다른 예 4.3.3에서, 다운링크 제어 채널이 할당되고 따라서 공간 다이버시티를 위한 업링크 데이터 채널의 모든 TX 빔(TCI 상태 또는 공간적 관계) 상에서 송신된다. 다른 예 4.3.4에서, 업링크 제어 채널이 할당되고 따라서 공간 다이버시티를 위한 업링크 데이터 채널의 TX 빔 (TCI 상태 또는 공간적 관계)의 서브세트 상에서 송신되며, 여기서 TX 빔(TCI 상태 또는 공간적 관계)의 서브세 트는 RRC, 및/또는 MAC CE, 및/또는 L1 제어 시그널링을 통해 설정될 수 있다. 일 예에서, TX 빔(TCI 상태 또는공간적 관계)의 서브세트는 빔 인디케이션 메시지 또는 업링크 데이터 채널의 송신을 스케줄링하는 DCI 포맷으 로 제공된다. 다른 예 4.3a 및 다음의 예 3.3a에서, 다음의 하위 예가 더 고려될 수 있다. 일 예 4.3a.1에서, 업링크 제어 채 널의 TCI 상태 또는 공간적 관계는 업링크 데이터 채널의 DMRS의 \"N\" 안테나 포트의 제1 그룹의 TCI 상태 또는 공간적 관계를 따른다. 다른 예 4.4 및 다음의 예 3.4에서, 일 예 4.4.1에서, 업링크 제어 채널의 TCI 상태 또는 공간적 관계는 업링크 데이터 채널의 제1 코드워드의 TCI 상태 또는 공간적 관계를 따른다. 다른 예 4.4.2에서, 업링크 제어 채널의 TCI 상태 또는 공간적 관계는 업링크 데이터 채널의 코드워드의 TCI 상 태 또는 공간적 관계를 따르며, 여기서 업링크 데이터 채널의 코드워드의 인덱스는 RRC, 및/또는 MAC CE, 및/또 는 L1 제어 시그널링에 의해 설정된다. 일 예에서, TCI 상태 또는 공간적 관계가 업링크 제어 채널에 사용되는 업링크 데이터 채널의 코드워드의 인덱스는 업링크 데이터 채널 송신을 스케줄링하는 빔 인디케이션 메시지 또 는 DCI 포맷으로 제공된다. 예는 도 18에 예시되어 있다. 도 18은 본 개시의 실시예에 따른 또 다른 예시적인 TCI 상태 설정을 도시한다. 도 18에 도시된 TCI 상태 설정의 실시예는 단지 예시를 위한 것이다. 다른 예 4.4.3에서, 업링크 제어 채널은 공간 다이버시티를 위한 업링크 데이터 채널의 모든 TX 빔(TCI 상태 또 는 공간적 관계) 상에서 송신된다. 다른 예 4.4.4에서, 업링크 제어 채널은 공간 다이버시티를 위한 업링크 데이터 채널의 TX 빔(TCI 상태 또는 공 간적 관계)의 서브세트 상에서 송신되며, 여기서 TX 빔(TCI 상태 또는 공간적 관계)의 서브세트는 RRC, 및/또는 MAC CE, 및/또는 L1 제어 시그널링을 통해 설정될 수 있다. 일 예에서, TX 빔(TCI 상태 또는 공간적 관계)의 서 브세트는 빔 인디케이션 메시지 또는 업링크 데이터 채널 송신을 스케줄링하는 DCI 포맷으로 제공된다. 다른 예 4.5 및 다음의 예 3.5에서, 4.1 내지 4.4의 예 중 하나를 따르는 동작은 RRC 시그널링에 의해 설정될 수 있다. 대안적으로, 또는 부가적으로, 4.1 내지 4.4의 예 중 하나를 따르는 동작은 MAC CE 및/또는 L1 제어 시그널링에 의해 업데이트될 수 있다. 다른 예 4.6 및 다음의 예 4.1 내지 4.5 및 예 1.1 내지 예 1.6.2의 예에서, 업링크 제어 채널의 TX 빔(TCI 상 태 또는 공간적 관계)은 다운링크 데이터 채널의 TX 빔(TCI 상태)에 기초하여 결정된다. 다른 예 4.7에서, 업링크 제어 채널의 TX 빔(TCI 상태 또는 공간적 관계)은 예 2.1 내지 2.10에서 결정된 바와 같은 다운링크 제어 채널의 TX 빔(TCI 상태)을 따른다. 다른 예 4.8에서, UE에는 UL 또는 DL 데이터 채널에 대해 설정되고 지시되는 TCI 상태 또는 공간적 관계의 세트 로부터 UL 제어 채널에 대한 TCI 상태 또는 공간적 관계가 지시되거나 시그널링되지 않는다. UE는 UL 또는 DL 데이터 채널에 대해 설정되고 지시되는 TCI 상태 또는 공간적 관계의 세트로부터 송신을 위한 선호하는 TCI 상 태 또는 공간적 관계를 결정한다. gNB는 UL 또는 DL 데이터 채널에 대해 설정되고 지시되는 TCI 상태 또는 공간 적 관계에 기반한 상이한 TCI 상태 또는 공간적 관계 가정을 사용하여 DL 제어 채널의 다수의 수신 및 디코딩과 같은 다수의 수신기 처리 기능을 수행할 수 있다. 다른 예 4.9에서, DCI 포맷에 의해 트리거링되는 업링크 제어 채널 송신의 경우, 업링크 제어 채널의 TX 빔(TCI 상태 또는 공간적 관계)은 DCI 포맷의 필드에 의해 지시된다. 다른 예 4.10에서, 업링크 제어 채널 송신을 위한 자원의 세트의 각각의 자원의 설정은 TCI 상태 또는 공간적 관계를 포함한다. DCI 포맷에 의해 트리거링되는 업링크 제어 채널 송신의 경우, 업링크 제어 채널의 TX 빔(TCI 상태 또는 공간적 관계)은 업링크 제어 채널 송신에 사용되는 자원의 인디케이션을 통해 지시된다. 여기서, 업 링크 제어 채널 자원의 TCI 상태 또는 공간적 관계는 다운링크 또는 업링크 데이터 채널의 계층/계층의 그룹/코 드워드/안테나 포트의 TCI 상태에 의해 결정된다. 상술한 실시예에 대해, TX 빔은 CSI-RS 자원, SRS 자원, SSB 자원, 또는 DMRS 자원과 같은 기준 또는 소스 RS 자원에 상응할 수 있다. 상응은 QCL 관계를 의미한다. 본 명세서에서 기준 RS 자원은 자원 인덱스를 포함하거나 자원 인덱스로부터 도출될 수 있다. 다른 예 4.11 및 다음의 예 1.6에서, UE는 UL/DL 송신의 다수의 계층 상에서 송수신하도록 설정될 수 있다. 일 예에서, 계층의 수는 최대 2 또는 4일 수 있다. 예시를 위해, 다음의 예에서, 계층의 수는 최대 2인 것으로 가정된다. 일 예에서, 계층은 PDSCH 포트에 상응한다. PUCCH는 단일 계층 상에서 송신될 수 있다. UE가 2개의 계층 상에서 PDSCH를 수신하도록 설정되고, UE가 빔마다 하나의 계층 상에서 송수신하도록 설정되며, UE가 PDSCH에 대해 하나의 빔을 지시하는 경우, UE는 다음의 인스턴스에 따라 PUCCH의 송신을 위한 빔을 결정할 수 있다. 일 인스턴스에서, PDSCH에 대해 지시된 TCI 상태는 PUCCH의 송신을 위해 사용되는 빔을 결정한다. 다른 인스턴스에서, 가장 높은 L1-RSRP/L1-SINR과 연관된 PDSCH에 대해 결정된 TCI 상태는 PDCCH의 송신을 위해 사용되는 빔을 결정한다. 또 다른 인스턴스에서, gNB는 RRC 시그널링 및/또는 MAC-CE 시그널링을 통해 PUCCH 송신을 위해 TCI 상태를 따 르는 PDSCH 계층 인덱스를 UE에 설정/업데이트한다. 또 다른 인스턴스에서, UE는 PDSCH 수신을 위해 사용되는 2개의 TCI 상태 중 PUCCH의 송신을 위한 TCI 상태를 선택한다. gNB는 블라인드 디코딩을 통해 PUCCH TCI 상태를 결정한다. 또 다른 인스턴스에서, UE는 PDCCH의 수신에 사용되는 TCI 상태에 기초하여 PUCCH의 송신을 위한 TCI 상태를 결 정한다. 또 다른 인스턴스에서, UE는 PDSCH의 2개의 TCI 상태에 따라 공간 다이버시티를 위해 2개의 빔 상에서 PDCCH를 송신한다. 또 다른 인스턴스에서, 둘 이상의 인스턴스가 시스템 동작에서 명시될 수 있고, gNB는 PUCCH의 송신을 위해 사 용할 인스턴스를 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 UE에 설정/업데이트 한다. 다른 예 4.12 및 다음의 예 3.7에서, UE는 UL 송신의 다수의 계층 상에서 송신하도록 설정될 수 있다. 일 예에 서, 계층의 수는 최대 2 또는 4일 수 있다. 예시를 위해, 다음의 예에서, 계층의 수는 최대 2인 것으로 가정된 다. 일 예에서, 계층은 PUSCH 포트에 상응한다. PUCCH는 단일 계층 상에서 송신될 수 있다. UE가 2개의 계층 상에서 PUSCH를 송신하도록 설정되고, UE가 빔마다 하나의 계층 상에서 송신하도록 설정되며, UE가 PUSCH에 대해 하나의 빔을 지시된 경우, UE는 다음의 인스턴스에 따라 PUCCH의 송신을 위한 빔을 결정할 수 있다. 일 인스턴스에서, PUSCH에 대해 지시된 TCI 상태/공간적 관계는 PUCCH의 송신을 위해 사용되는 빔을 결정한다. 다른 인스턴스에서, 가장 높은 RSRP/SINR과 연관된 PUSCH에 대해 결정된 TCI 상태/공간적 관계는 PUCCH의 송신 을 위해 사용되는 빔을 결정한다. 또 다른 인스턴스에서, gNB는 RRC 시그널링 및/또는 MAC-CE 시그널링을 통해 PUCCH 송신을 위해 TCI 상태/공간 적 관계를 따르는 PUSCH 계층 인덱스를 UE에 설정/업데이트한다. 또 다른 인스턴스에서, UE는 PUSCH 송신을 위해 사용되는 2개의 TCI 상태/공간적 관계 중 PUCCH의 송신을 위한 TCI 상태/공간적 관계를 선택한다. gNB는 블라인드 디코딩을 통해 PUCCH TCI 상태/공간적 관계를 결정한다. 또 다른 인스턴스에서, UE는 PUSCH의 2개의 TCI 상태/공간적 관계에 따라 공간 다이버시티를 위해 2개의 빔 상 에서 PUCCH를 송신한다. 또 다른 인스턴스에서, 예 4.12의 둘 이상의 인스턴스가 시스템 동작에서 명시될 수 있고, gNB는 PUCCH의 송신 을 위해 사용할 인스턴스를 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 UE에 설정 /업데이트한다. 또 다른 인스턴스에서, 예 4.11 및 예 4.12의 둘 이상의 인스턴스가 시스템 동작에서 명시될 수 있고, gNB는 PUCCH의 송신을 위해 사용할 인스턴스를 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통 해 UE에 설정/업데이트한다. 일 실시예에서, 다수의 구성 요소 반송파를 갖는 다중 빔 채널에서의 빔 인디케이션이 제공된다. 공통/조인트 빔 인디케이션은 다수의 구성 요소 반송파에서 TX 빔을 시그널링하고 지시하는 데 사용될 수 있다. 구성 요소 반송파는 데이터 채널에 대해 상이한 수의 계층 및/또는 상이한 수의 TX 빔을 가질 수 있다. 다음의 예는 DL 및/또는 UL 데이터 채널 및/또는 제어 채널에 적용될 수 있다. 다음의 예는 2개의 구성 요소 반송파/셀의 경우를 예시하지만; 2개의 구성 요소 반송파/셀은 다수의 구성 요소 반송파/셀로 확장될 수 있다. 다음의 예 에서, 반송파 A는 제1 구성 요소 반송파/셀이고, 반송파 B는 제2 구성 요소 반송파/셀이다. 일 예 5.1에서, gNB 또는 UE는 반송파 A의 다수의 TX 빔 상에서 제1 채널을 송신하고, 반송파 B 상의 단일 TX 빔 상에서 제2 채널을 송신한다. 하나의 옵션에서, 반송파 B 상의 제2 채널의 TX 빔의 TCI 상태 또는 공간적 관 계의 인덱스는 예를 들어, 반송파 A 상의 제1 채널의 제1 계층/계층의 그룹/코드워드/안테나 포트의 TCI 상태와 같이 반송파 A 상의 제1 채널의 TCI 상태 또는 공간적 관계에 대한 고정/명시된 매핑에 기반한다. 대안적으로, TCI 상태의 인덱스는 반송파 A 상의 제1 채널의 계층/계층의 그룹/코드워드/안테나 포트의 TCI 상태의 규칙에 기초할 수 있다. 예를 들어 규칙은 가장 작은 TCI 상태 인덱스일 수 있다. 대안적으로, 반송파 B 상의 제2 채널 의 TX 빔의 TCI 상태 또는 공간적 관계의 인덱스는 반송파 A 상의 제1 채널의 계층/계층의 그룹/코드워드/안테 나 포트의 TCI 상태 또는 공간적 관계 중 하나인 것으로 설정되며, 여기서 설정은 RRC, 및/또는 MAC CE, 및/또 는 L1 제어 시그널링을 통해 이루어질 수 있다. 다른 예 5.2에서, gNB 또는 UE는 반송파 A 상의 다수의 TX 빔 상에서 제1 채널을 송신하고, 반송파 A의 모든 빔 상의 반송파 B 상에서 제2 채널을 송신한다. 하나의 옵션에서, 제2 채널 반송파 B의 TX 빔의 TCI 상태 또는 공 간적 관계는 반송파 B 상의 채널의 계층/계층의 그룹/코드워드/안테나 포트와 반송파 A의 계층/계층의 그룹/코 드워드/안테나 포트 사이의 고정/명시된 매핑에 기반한다. 예를 들어, 반송파 B 상의 채널이 2개의 계층 상에서 송신되고 반송파 A 상의 채널이 4개의 계층 상에서 송신되고 나서, 2개의 빔이 반송파 A 상에서 설정되는 경우, 계층 0과 1은 제1 빔에 할당되고, 계층 2와 3은 제2 빔에 할당되지만, 반송파 B 상에 있는 동안, 계층 0은 제1 빔에 할당되고, 계층 1은 제2 빔에 할당된다. 이것은 표 4에 예로서 예시되어 있다. [표 4] TCI 상태의 수가 임의의 반송파 상의 계층의 수보다 크지 않을 때 반송파 당 상이한 계층으로 송신하기 위해 반 송파당 채널에 TCI 상태가 할당된다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "대안적으로, 반송파 B TX 빔의 TCI 상태 또는 공간적 관계는 반송파 B의 계층/계층의 그룹/코드워드/안테나 포 트와 반송파 A의 계층/계층의 그룹/코드워드/안테나 포트를 매핑하는 설정에 기반하며, 여기서 설정은 RRC 및/ 또는 MAC CE 및/또는 L1 제어 시그널링을 통해 이루어질 수 있다. 다른 예 5.3에서, gNB 또는 UE는 반송파 A 상의 다수의 TX 빔 상에서 제1 채널을 송신하고, 반송파 A의 빔의 서 브세트 상의 반송파 B 상에서 제2 채널을 송신한다. 하나의 옵션에서, 반송파 B 상의 TX 빔의 TCI 상태 또는 공 간적 관계는 반송파 B의 계층/계층의 그룹/코드워드/안테나 포트와 반송파 A의 계층/계층의 그룹/코드워드/안테 나 포트의 서브세트 사이의 고정된 매핑에 기반한다. 예를 들어, 반송파 B 상의 채널이 2개의 계층 상에서 송신 되고 반송파 A 상의 채널이 4개의 계층 상에서 송신되는 경우, 설정된 4개의 빔을 사용하여, 반송파 A 계층 0과 반송파 B 계층 0은 제1 빔에 할당되고, 반송파 A 계층 1과 반송파 B 계층 1은 제2 빔에 할당된다. 나머지 2개의 반송파 A 계층은 각각 제3 및 제4 빔에 할당된다. 이것은 표 5에 예로서 예시된다. [표 5] TCI 상태의 수가 임의의 반송파 상의 계층의 수보다 클 때 반송파 당 상이한 계층으로 송신하기 위해 반송파당 채널에 TCI 상태가 할당된다. 대안적으로, 반송파 B 상의 TX 빔의 TCI 상태 또는 공간적 관계는 반송파 B의 계층/계층의 그룹/코드워드/안테 나 포트와 반송파 A의 계층/계층의 그룹/코드워드/안테나 포트의 서브세트를 매핑하는 설정에 기반하며, 여기서 설정은 RRC 및/또는 MAC CE 및/또는 L1 제어 시그널링을 통해 이루어질 수 있다. 다른 예 5.4에서, gNB 또는 UE는 반송파 A 상의 하나 또는 다수의 TX 빔 상에서 제1 채널을 송신하고, 반송파 A 의 빔의 수퍼세트 상의 반송파 B 상에서 제2 채널을 송신한다. 하나의 옵션에서, 반송파 B 상의 TX 빔의 TCI 상 태 또는 공간적 관계는 반송파 B의 계층/계층의 그룹/코드워드/안테나 포트의 서브세트와 반송파 A의 계층/계층 의 그룹/코드워드/안테나 포트 사이의 고정된 매핑에 기반한다. 서브세트에 없는 반송파 B의 부가적인 계층/계 층의 그룹/코드워드/안테나 포트에는 TCI 상태 또는 공간적 관계가 설정된다. 예를 들어, 반송파 A 상의 제1 채 널이 4개의 계층 상에서 송신되고, 반송파 B 상의 제2 채널이 4개의 계층 상에서 송신되고 나서, 2개의 빔이 반 송파 A 상에 설정되는 경우, 반송파 A 계층 0 및 1과 반송파 B 계층 0은 제1 빔에 할당되고, 반송파 A 계층 2 및 3과 반송파 B 계층 1은 제2 빔에 할당된다. 나머지 2개의 반송파 B 계층은 각각 제3 및 제4 빔에 설정되고 할당된다. 이것은 표 6에 예로서 예시된다. [표 6] 반송파당 TCI 상태당 계층의 수가 상이한 송신을 위해 반송파당 채널에 TCI 상태가 할당된다."}
{"patent_id": "10-2022-7033015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "대안적으로, 반송파 B 상의 TX 빔의 TCI 상태 또는 공간적 관계는 반송파 B의 계층/계층의 그룹/코드워드/안테 나 포트의 서브세트와 반송파 A의 계층/계층의 그룹/코드워드/안테나 포트를 매핑하는 설정에 기반한다. 서브세 트에 없는 부가적인 반송파 B 계층/계층의 그룹/코드워드/안테나 포트에는 설정이 RRC, 및/또는 MAC CE 시그널 링, 및/또는 L1 제어 시그널링을 통해 이루어지는 TCI 상태 또는 공간적 관계가 설정된다. 다른 예 5.5에서, gNB 또는 UE는 반송파 A 상의 하나 또는 다수의 TX 빔 상에서 제1 채널을 송신하고, 반송파 B 상의 하나 또는 다수의 TX 빔 상에서 제2 채널을 송신하며, 여기서 TX 빔의 제1 서브세트 \"A\"는 반송파 A에 대 해서만 설정된다. TX 빔의 제2 서브세트 \"B\"는 반송파 B에 대해서만 설정된다. TX 빔의 제3 서브세트 \"C\"는 반 송파 A 및 B에 대해 공동으로 설정된다. 서브세트 \"A\", \"B\" 및 \"C\" 중 임의의 것의 요소의 수는 0, 1 또는 2 이 상일 수 있다. 상술한 실시예의 경우, TX 빔은 CSI-RS 자원, SRS 자원, SSB 자원, 또는 DMRS 자원과 같은 기준 또는 소스 RS 자원에 상응할 수 있다. 상응은 QCL 관계를 의미한다. 본 명세서에서 기준 RS 자원은 자원 인덱스를 포함하거나 자원 인덱스로부터 도출될 수 있다. 다른 예 5.6에서, UE는 제1 반송파의 다수의 계층 상에서 송수신하도록 설정될 수 있고, 제2 반송파의 하나의 계층 상에서 송수신하도록 설정될 수 있다. 일 예에서, 계층의 수는 최대 2 또는 4일 수 있다. 예시를 위해, 다 음의 예에서, 계층의 수는 최대 2인 것으로 가정된다. 일 예에서, 계층은 PDSCH 포트 또는 PUSCH 포트에 상응한 다. UE가 제1 반송파 상의 2개의 계층 상에서 송수신하도록 설정되고, UE가 빔마다 하나의 계층 상에서 송수신하도 록 설정되며, UE가 제1 반송파에 대해 송수신을 위해 하나의 빔을 지시하는 경우, UE는 다음의 인스턴스에 따라 제2 반송파에 대해 송수신을 위한 빔을 결정할 수 있다. 일 인스턴스에서, 제1 반송파 상에서 송수신을 위해 지시된 TCI 상태/공간적 관계는 제2 반송파 상에서 송수신 을 위해 사용되는 빔을 결정한다. 다른 인스턴스에서, 가장 높은 L1-RSRP/L1-SINR과 연관된 제1 반송파 상에서 송수신을 위해 결정된 TCI 상태/공 간적 관계는 제2 반송파 상에서 송수신을 위해 사용되는 빔을 결정한다. 또 다른 인스턴스에서, gNB는 RRC 시그널링 및/또는 MAC-CE 시그널링을 통해 제2 반송파를 위해 TCI 상태/공간 적 관계를 따르는 제1 반송파 계층 인덱스를 UE에 설정/업데이트한다. 또 다른 인스턴스에서, UE는 제1 반송파 상에서 송수신을 위해 사용되는 2개의 TCI 상태/공간적 관계 중 제2 반 송파 상에서 수신을 위한 TCI 상태를 결정하기 위해 블라인드 디코딩을 수행한다. 또 다른 인스턴스에서, UE는 제1 반송파 상에서 송수신을 위해 사용되는 2개의 TCI 상태/공간적 관계 중 제2 반 송파 상에서 송신을 위한 TCI 상태/공간적 관계를 선택한다. gNB는 블라인드 디코딩을 통해 제2 반송파의 TCI 상태/공간적 관계를 결정한다. 또 다른 인스턴스에서, UE는 제1 반송파 상에서 송수신을 위한 2개의 TCI 상태/공간적 관계에 따라 공간 다이버 시티를 위해 2개의 빔 상의 제2 반송파 상에서 송수신한다. 또 다른 인스턴스에서, 둘 이상의 인스턴스가 시스템 동작에서 명시될 수 있고, gNB는 제2 반송파 상에서 송수 신을 위해 사용할 인스턴스를 RRC 시그널링 및/또는 MAC CE 시그널링 및/또는 L1 제어 시그널링을 통해 UE에 설 정/업데이트한다. 예시를 위해, 이러한 알고리즘의 단계는 순차적으로 설명되지만, 이러한 단계 중 일부는 서로 병렬로 수행될 수 있다. 상술한 동작 다이어그램은 본 개시의 원리에 따라 구현될 수 있는 예시적인 방법을 도시하고, 본 명세서 에서의 흐름도에 도시된 방법에 대해 다양한 변경이 이루어질 수 있다. 예를 들어, 일련의 단계로서 도시되었지 만, 각각의 도면의 다양한 단계는 중첩하거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 본 개시가 예시적인 실시예로 설명되었지만, 다양한 변경 및 수정이 통상의 기술자에게 제시될 수 있다. 본 개 시는 첨부된 청구항의 범주 내에 속하는 이러한 변경 및 수정을 포함하는 것으로 의도된다. 본 출원에서의 설명 은 임의의 특정 요소, 단계 또는 기능이 청구 범위에 포함되어야 하는 필수 요소임을 암시하는 것으로 해석되지 않아야 한다. 특허된 주제(patented subject matter)의 범위는 청구항에 의해 정의된다.도면 도면1 도면2 도면3 도면4 도면5 도면6a 도면6b 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18"}
{"patent_id": "10-2022-7033015", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시예에 따른 예시적인 무선 네트워크를 도시한다. 도 2는 본 개시의 실시예에 따른 예시적인 gNB를 도시한다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 4는 본 개시에 따른 예시적인 무선 송신 경로를 도시한다. 도 5는 본 개시에 따른 예시적인 무선 수신 경로를 도시한다. 도 6a는 본 개시의 실시예에 따른 무선 시스템에서의 빔의 예를 도시한다. 도 6b는 본 개시의 실시예에 따른 예시적인 다중 빔 동작을 도시한다. 도 7은 본 개시의 실시예에 따른 예시적인 안테나 구조를 도시한다. 도 8은 본 개시의 실시예에 따른 예시적인 DL 다중 빔 동작을 도시한다. 도 9는 본 개시의 실시예에 따른 다른 예시적인 DL 다중 빔 동작을 도시한다. 도 10은 본 개시의 실시예에 따른 예시적인 UL 다중 빔 동작을 도시한다. 도 11은 본 개시의 실시예에 따른 다른 예시적인 UL 다중 빔 동작을 도시한다. 도 12는 본 개시의 실시예에 따른 2개의 RF 경로를 갖는 예시적인 다중 경로 환경을 도시한다. 도 13은 본 개시의 실시예에 따른 예시적인 TCI 상태 설정을 도시한다. 도 14는 본 개시의 실시예에 따른 다른 예시적인 TCI 상태 설정을 도시한다. 도 15는 본 개시의 실시예에 따른 또 다른 예시적인 TCI 상태 설정을 도시한다. 도 16은 본 개시의 실시예에 따른 또 다른 예시적인 TCI 상태 설정을 도시한다. 도 17은 본 개시의 실시예에 따른 또 다른 예시적인 TCI 상태 설정을 도시한다. 도 18은 본 개시의 실시예에 따른 또 다른 예시적인 TCI 상태 설정을 도시한다."}
