{"patent_id": "10-2022-0171489", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0086193", "출원번호": "10-2022-0171489", "발명의 명칭": "펄프 패키징 제품 합부판별과 그 방법", "출원인": "다솜네트웍스 주식회사", "발명자": "권경업"}}
{"patent_id": "10-2022-0171489", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비전 카메라를 사용하여 펄프 패키징 제품을 음영등의 노이즈를 최소화하도록 촬영하여 고각사면의 불량요인도확인이 가능하도록 하는 최적화된 이미지를 획득하는 단계; 취득한 각각의 이미지에 포함된 불량 이미지를 특정하는 단계; 이미지를 DATA Augmentation을 하여 학습을 위한데이터를 확장하는 단계; faster R-CNN 모델과 YOLOv4 모델에 이미지를 학습 시키는 단계; 학습된 모델을 통해실제로 제품을 검사하는 단계;를 포함하는 펄프 패키징의 불량을 판별하는 방법"}
{"patent_id": "10-2022-0171489", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "faster R-CNN 모델 객체탐지 영상 인공지능 알고리즘을 통하여 고각사면의 형상 특징을 갖는 펄프 패키징 제품의 양품과 불량 판별하고 생산성을 향상시킬 수있는 방법"}
{"patent_id": "10-2022-0171489", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 펄프 패키징 제품 합부판별과 그 방법에 관한 것으로 faster R-CNN 모델의 객체탐지 기술을 활용하여 제조되어진 제품의 합부를 판정하는 방법에 대한 것이다."}
{"patent_id": "10-2022-0171489", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "머신비전(Machine Vision)이라 불리우는 비전검사시스템은 제조업 분야의 제품 검사 장치로 제조분야의 품질과 생산성, 효율을 높이고 규제를 준수하기 위해 사용되는 검사 공정이다. 제조 과정에서의 물리적 형상 및 결함, 표면 마무리, 색상 등의 상태를 사람이 육안으로 검사하는 대신 고성능 카메라, 이미지 프로세서, 소프트웨어 등의 구성요소로 이루어진 시스템으로 검사하는 것이다. 머신비전은 환경과 관계없이, 작업자의 피로도없이, 마 이크로미터 단위까지 정밀하게, 빠른 속도로 검사를 수행할 수 있다. 따라서 전 세계 산업자동화의 발전과 떼려 야 뗄 수 없는 밀접한 관계에 있으며, 반도체·PCB(Printed Circuit Board) 관련·소형 전자부품·휴대전화·디 스플레이·자동차·철강·식음료 산업 등 산업 전반으로 적용 분야가 확대되고 있다. 이중 이미지 프로세서와 검사 소프트웨어 분야의 최근 국·내외 수요자 동향을 살펴보면 검사 대상이 소형화되고 내부 패턴이 복잡해지 면서 고도의 영상처리 기술을 필요로 하고, 생산성 향상을 위한 고속검사처리 기술이 지속적으로 요구되고 있다. 그런데, 기술적인 측면에서 알고리즘의 정확도 문제로 인해 완전 자동화는 힘들고 마지막 단계에서 검출된 결함 들을 작업자가 한번 더 확인하는 문제가 있다. 머신 비전에 의한 검사 자동화는 인쇄, 화폐, 목재 식품, 기계, 옷감 등 산업 전방에 걸쳐 확산되어 있으나, 펄 프 패키징 제품의 경우 그 형상 특성과 불량유형에 기인하여 불량검사에 적용되지 못하고 있다. 최근 컴퓨터 기술의 빠른 발전과 인공지능 기술의 혁신적인 성취에 따라 다양한 분야에서 딥러닝 기술 및 그를 기반으로 하는 머신비전 기능의 활용이 점점 더 증가하고 있다. 일반적으로, 딥러닝 기반의 머신비전 기능 구현 은, 비전센서를 이용하여 취득된 이미지들을 이용하여, 기존의 딥러닝 알고리즘을 통한 학습진에 의해 머신비전 모델 데이터셋을 구축 및 또는 갱신하는 모델 구축 및 또는 갱신 기능과, 그 구축 및 또는 갱신된 모델을 활용 하여, 실제로 대상 검사 목적물을 인식하고 그에 대응하는 동작을 수행하는 대상 검출 기능의 양 측면에 의해 이루어진다."}
{"patent_id": "10-2022-0171489", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 감안하고 여기에 더하여 기존의 머신비전으로 극복할 수 없었던 펄프 패키징 제품의 형상 특성 중 고각사면이 존재에 따른 노이즈 발생구역을 극복할 수있도록 도출된 것으로서, 본 발명의 목적은 비전센서를 사용하여 취득한 영상이미지를 사용하여 효과적이고 정확한 물체를 검사하는 알고리즘 및 이를 이용한 시스템을 제공하는 것이다. 기존의 머신비전은 인공지능을 학습시키기에 충분한 데이터셋 확보가 매우 중요한 요소로 충분한 학습을 통해 그 기능을 발휘할 수 있었지만 제품 공정 특성 상 양산되는 불량의 수량이 부족하여 이를 충족하지 못하는 경우 라도 이러한 문제를 극복하고 양품과 불량을 판별할 수있는 방법을 제공한다. 객체탐지 모델인 Faster R-CNN과 YOLOv4 모델을 통해 불량품을 판별하고 불량품에 포함된 불량을 유형별로 검출 하여 제시함으로 공정에서 발생하고 있는 불량의 후속처리에도 기여함. 일부 발생확률이 적은 불량등의 학습데이터 확보의 어려움을 극복하기위해 Data augmentation를 수행하여 부족 한 데이터를 확보하는 단계도 수행한다."}
{"patent_id": "10-2022-0171489", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 펄프 패키징 제품 합부판별과 방법은 비전 카메라를 통해 이미지를 획득하는 단계, 이미지에서 검출하고자 하는 불량의 유형을 정하여 불량을 지정하 는 단계, 학습을 위한 faster R-CNN 모델과 YOLOv4 모델에 불량이 포함된 이미지를 학습시키는 단계, 학습된 데 이터를 test하는 단계, 비전 카메라를 통해 수집되는 이미지를 실시간으로 판정하는 단계로 구성된다."}
{"patent_id": "10-2022-0171489", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 해결 수단을 통해, 펄프 패키징 제품의 양품, 불량 판별에 있어 비전 카메라를 적용하여 검사 목적물의 영상 이미지를 획득하고 검사를 수행할 수있도록 함으로 해서 생산성향상과 원가 절감 효과 및 육안검사를 대체하여 휴먼 에러를 방지하여 검사 정확률 향상 효과가 있다."}
{"patent_id": "10-2022-0171489", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하면서 본 발명의 실시예에 따른 다면 비전 검사 알고리즘, 로직에 관하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시 할 수 있도록 상세히 설명하기로 한다. 본 발명은 여기에서 설명하는 실시예로 한정되지 않으며, 여러 가지 상이한 형태로 구현될 수 있다. 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성 요소에 따른 검사 알고리즘을 통해 보다 세분화 하여 진행할 수 있다. 비전 카메라를 이용하여 펄프 패키징 제품의 이미지를 획득한다. 불량 이미지 획득을 위해 카메라의 초점거리와 각도, 조명의 밝기와 각도를 정해야 하며, 각 이미지는 최종적으로 검출하고자 하는 불량유형이 포함되어 있는 별개의 이미지이다. 인공지능 모델에 각각의 불량 유형을 학습시켜 실제 검사를 수행할 때, 유사한 불량을 검출 해내도록 한다. 각 이미지에 불량의 유형의 영역을 표시한 이미지를 각각 기입하여 학습용 데이터를 생성하고, 학습양을 늘려 더 정확히 학습시키 위하여 DATA Augmentation함으로 부족한 데이터의 수를 확보한다. 이후 Faster R-CNN 모델의 알고리즘에 불량유형이 포함된 이미지를 학습시키는데, Faster R-CNN 모델을 이용하 여 Feature map에 n x n 크기의 slidingwindow를 적용함으로 객체 위치 및 객체 확률을 출력한다. sliding window의 중심 기준으로 크기, 비율 달리하는 k개의 객체 후보 추천하며, RPN에서 스케일이 작은 anchor box가자동 생성되도록 수정한다. 최종 결과로 class score가 임계 값 이상인 검출 결과만을 사용하고, 단일 객체에 대해 복수 개의 검출 결과가 임계 값 이상 오버랩 되어 나오는 경우에 가장 높은 score를 가지는 결과만을 검출 결과로 사용한다. 비전 카메라가 실시간으로 획득하는 이미지에서 각 불량을 검출하여 작업자의 불량품 선별과 후속 조치를 용이 하게 한다. 이상에서 설명한 본 발명은 전술한 실시예 및 첨부된 도면에 의해 한정되지 않으며, 본 발명의 기술적 사상 내 에서의 단순 치환, 변형 및 변경은 당 분야에서의 통상의 지식을 가진 자에게 명백한 것이다."}
{"patent_id": "10-2022-0171489", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 전체적인 불량 검출 방법, 도 2는 본 발명에서 검출하고자 하는 불량의 유형, 도 3은 본 발명에 따른 DATA Augmentation 예시, 도 4는 본 발명에 따른 불량 검출 이미지, 도 5는 본 발명에 따른 비전 검사 시스템의 작동 사진이다."}
