{"patent_id": "10-2020-0148475", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0048406", "출원번호": "10-2020-0148475", "발명의 명칭": "마찰 저감 구조를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "곽명훈"}}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,내부 공간을 포함하는 하우징;상기 하우징으로부터 지정된 왕복 거리로 제1방향을 따라 슬라이딩 가능하게 결합되는 슬라이드 구조물;적어도 부분적으로 상기 슬라이드 구조물의 지지를 받도록 배치되고, 인입 상태(slide-in state)에서, 적어도부분적으로 외부로부터 보이지 않도록 상기 내부 공간에 수용되는 플렉서블 디스플레이; 및상기 하우징과 상기 슬라이드 구조물 사이에 배치되는 제1마찰 저감 구조로써,상기 하우징에서, 상기 제1방향과 평행하게 배치되고, 지정된 길이를 갖는 가이드 슬릿;상기 슬라이드 구조물에서, 상기 가이드 슬릿에 가이드되도록 배치되는 가이드 돌기;상기 가이스 슬릿에 배치되는 적어도 하나의 제1마그네트; 및상기 가이드 돌기에서, 상기 제1마그네트의 자력에 영향을 받는 위치에 배치되는 적어도 하나의 제2마그네트를포함하고,상기 적어도 하나의 제1마그네트와 상기 적어도 하나의 제2마그네트는, 상기 제1방향과 수직한 제2방향을 따라적어도 부분적으로 서로 동일한 극성이 마주보도록 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적어도 하나의 제1마그네트는 상기 가이드 돌기 및 상기 적어도 하나의 제2마그네트를 사이에 두고, 상기가이드 슬릿의 상측 내면 및 하측 내면에 각각 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 적어도 하나의 제1마그네트는 상기 가이드 슬릿의 길이와 실질적으로 동일한 길이를 갖는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 적어도 하나의 제1마그네트는 지정된 간격으로 배치되는 복수의 마그네트들을 포함하는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 적어도 하나의 제1마그네트는 상기 가이드 돌기 및 상기 적어도 하나의 제2마그네트를 둘러싸는 방식으로배치되는 전자 장치.공개특허 10-2022-0048406-3-청구항 6 제1항에 있어서,상기 가이드 슬릿과 상기 적어도 하나의 제1마그네트 사이에 배치되는 차폐 부재를 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 슬라이드 구조물에 연결됨으로써 상기 플렉서블 디스플레이의 적어도 일부를 지지하도록 배치되는 밴딩 가능 부재를 더 포함하고,상기 밴딩 가능 부재는, 상기 인입 상태에서, 상기 내부 공간으로 수용되고, 인출 상태에서, 상기 슬라이드 구조물과 실질적으로 동일한 평면을 형성하도록 상기 내부 공간으로부터 인출되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 하우징과 상기 밴딩 가능 부재 사이에 배치되는 제2마찰 저감 구조로써,상기 하우징에 배치되는 적어도 하나의 제3마그네트; 및상기 밴딩 가능 부재에 배치되는 적어도 하나의 제4마그네트를 포함하는 제2마찰 저감 구조를 포함하고,상기 적어도 하나의 제3마그네트와 상기 적어도 하나의 제4마그네트는, 상기 제2방향을 따라 적어도 부분적으로서로 동일한 극성이 마주보도록 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 하우징은, 상기 플렉서블 디스플레이를 위에서 바라볼 때, 상기 밴딩 가능 부재 및 상기 플렉서블 디스플레이와 적어도 부분적으로 중첩되는 커버부를 포함하고,상기 적어도 하나의 제3마그네트 및 상기 적어도 하나의 제4마그네트는 상기 커버부와 상기 밴딩 가능 부재 사이에 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 플렉서블 디스플레이의 적어도 일부는 상기 적어도 하나의 제3마그네트와 상기 적어도 하나의 제4마그네트사이에 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 적어도 하나의 제3마그네트와 상기 플렉서블 디스플레이 사이에 배치되는 스위퍼(sweeper)를 더 포함하는전자 장치.공개특허 10-2022-0048406-4-청구항 12 제9항에 있어서,상기 적어도 하나의 제4마그네트는 상기 밴딩 가능 부재에 형성된 상기 플렉서블 디스플레이를 지지하는 외면보다 낮은 리세스에 장착되고,상기 적어도 하나의 제4마그네트와 상기 플렉서블 디스플레이는 동일한 평면을 형성하는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 커버부와 상기 플렉서블 디스플레이 사이에 배치되는 스위퍼(sweeper)를 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서, 상기 커버부와 상기 적어도 하나의 제3마그네트 사이, 및/또는 상기 밴딩 가능 부재와 상기 적어도 적어도 하나의 제4마그네트 사이에 배치되는 차폐 부재를 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제8항에 있어서,상기 내부 공간에서, 상기 밴딩 가능 부재와 상기 하우징 사이에 배치되는 제3마찰 저감 구조로써, 상기 하우징의 내부 공간에 배치되는 적어도 하나의 제5마그네트; 및상기 플렉서블 디스플레이와 상기 밴딩 가능 부재 사이에 채비되는 적어도 하나의 제6마그네트를 포함하는 제3마찰 저감 구조를 포함하고,상기 인입 상태에서, 상기 적어도 하나의 제5마그네트와 상기 적어도 하나의 제6마그네트는, 상기 제2방향을 따라 적어도 부분적으로 서로 동일한 극성이 마주보도록 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 플렉서블 디스플레이는 디스플레이 패널을 포함하고,상기 적어도 하나의 제6마그네트는 상기 디스플레이 패널의 배면에 적어도 부분적으로 부착되는 적어도 하나의자화 메탈 시트를 포함하는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 적어도 하나의 제5마그네트와 상기 하우징 사이에 배치되는 차폐 부재를 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,공개특허 10-2022-0048406-5-상기 인입 상태에서, 상기 적어도 하나의 제2마그네트와 대면하도록 상기 가이드 슬릿에 배치되는 제7마그네트;및인출 상태에서, 상기 적어도 하나의 제2마그네트와 대면하도록 상기 가이드 슬릿에 배치되는 제8마그네트를 포함하고,상기 제7마그네트 및 상기 제8마그네트는 상기 적어도 하나의 제1마그네트와 적어도 부분적으로 서로 다른 극성이 마주보도록 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제7항에 있어서,상기 밴딩 가능 부재는 서로에 대하여 회동 가능하게 결합되는 복수의 단위 멀티바들을 포함하고,상기 적어도 하나의 제4마그네트는 상기 복수의 단위 멀티바들 각각에 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제7항에 있어서,상기 밴딩 가능 부재는 서로에 대하여 회동 가능하게 결합되는 복수의 단위 멀티바들을 포함하고,상기 적어도 하나의 제4마그네트는 상기 복수의 단위 멀티바들 중 일부 단위 멀티바들에 배치되는 전자 장치."}
{"patent_id": "10-2020-0148475", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따르면, 전자 장치는, 내부 공간을 포함하는 하우징과, 상기 하우징으로부터 지정된 왕복 거리 로 제1방향을 따라 슬라이딩 가능하게 결합되는 슬라이드 구조물과, 적어도 부분적으로 상기 슬라이드 구조물의 지지를 받도록 배치되고, 인입 상태(slide-in state)에서, 적어도 부분적으로 외부로부터 보이지 않도록 상기 내 (뒷면에 계속)"}
{"patent_id": "10-2020-0148475", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 마찰 저감 구조를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2020-0148475", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 점차 슬림화되어가고 있으며, 강성을 증가시키고, 디자인적 측면을 강화시킴과 동시에 그 기능적 요소를 차별화시키기 위하여 개선되고 있다. 전자 장치는 획일적인 장방형 형상에서 벗어나, 점차 다양한 형상 으로 변모되어 가고 있다. 전자 장치는 휴대의 편리성을 위해, 대화면 디스플레이를 이용할 수 있는 변형 가능 한 구조를 가질 수 있다. 예컨대, 변형 가능한 구조의 일환으로, 전자 장치는 슬라이딩 방식으로 동작하는 하우 징 결합 구조 및 이에 지지를 받는 플렉서블 디스플레이를 통해 디스플레이 면적이 확장되는 구조(예: 롤러블 구조)를 가질 수 있다. 이러한 전자 장치는 서로에 대하여 회동 가능하게 동작하는 하우징들간의 상호 간섭을 최소화할 수 있는 구조가 요구될 수 있다."}
{"patent_id": "10-2020-0148475", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는, 사용될 경우에, 디스플레이 면적이 확장될 수 있는 변형 가능한 슬라이더블 전자 장치(slidable electronic device)(예: 롤러블 전자 장치(rollable electronic device))를 포함할 수 있다. 슬라이더블 전자 장치는 적어도 부분적으로 끼워 맞춰지는(fitted together) 방식으로 서로에 대하여 유동 가능하게 결합될 수 있는 하우징(예: 제1하우징, 베이스 하우징 또는 베이스 브라켓) 및 슬라이드 구조물(예: 제2하우징, 슬라이드 하우징 또는 슬라이드 브라켓)을 포함할 수 있다. 예컨대, 슬라이드 구조물은 하우징으로부터 지정된 방향 및 지정된 왕복 거리로 인입되거나(slide-in), 인출됨(slide-out)으로써, 플렉서블 디스플레이의 디스플레이 면적 을 가변시킬 수 있다. 슬라이드 구조물은 플렉서블 디스플레이(flexible display 또는 expandable display)의 적어도 일부를 지지하고, 하우징으로부터 적어도 부분적으로 슬라이딩 방식으로 동작하도록 결합될 수 있으며,사용자에 의해 수동으로 인입 또는 인출되거나, 내부 구동 메카니즘을 통해 자동으로 인입 상태(slide-in state) 또는 인출 상태(slide-out state)로 천이됨으로서, 디스플레이 면적이 가변되도록 유도할 수 있다. 슬라이더블 전자 장치는 하우징으로부터 슬라이드 구조물이 지정된 거리로 왕복 운동을 수행하도록 결합되는 가 이드 구조를 가질 수 있다. 가이드 구조는 적어도 부분적으로 하우징과 슬라이드 구조물간의 면마찰(예: 마찰 저항)이 수반될 수 있으며, 이러한 면마찰은 슬라이드감 저하 및/또는 마모를 발생시키고, 심할 경우, 작동 불 능을 유발할 수 있다. 이러한 문제점을 해결하기 위하여, 가이드 구조에 마찰력 저감을 위한 물리적 구조물(예: 베어링 또는 윤활유)이 추가될 수 있으나, 이러한 물리적 구조물은 오랜 기간 사용하다보면 마찰 저감 효과가 줄어들게 되고, 다시 상술한 문제점들이 유발될 수 있다. 또한, 굴곡 가능한 플렉서블 디스플레이가 하우징의 내부 공간으로 이동될 때, 펴지려는 복원력에 의해 들뜨는 현상이 발생될 수 있다. 본 발명의 다양한 실시예들은 마찰 저감 구조를 포함하는 전자 장치를 제공할 수 있다. 다양한 실시예에 따르면, 오랜 기간 사용하더라도 작동 신뢰성이 보장될 수 있는 마찰 저감 구조를 포함하는 전 자 장치를 제공할 수 있다. 다양한 실시예에 따르면, 인입/인출 동작 중에 플렉서블 디스플레이의 들뜸 현상을 방지할 수 있는 구조를 포함 하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2020-0148475", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따르면, 전자 장치는, 내부 공간을 포함하는 하우징과, 상기 하우징으로부터 지정된 왕복 거리 로 제1방향을 따라 슬라이딩 가능하게 결합되는 슬라이드 구조물과, 적어도 부분적으로 상기 슬라이드 구조물의 지지를 받도록 배치되고, 인입 상태(slide-in state)에서, 적어도 부분적으로 외부로부터 보이지 않도록 상기 내부 공간에 수용되는 플렉서블 디스플레이 및 상기 하우징과 상기 슬라이드 구조물 사이에 배치되는 제1마찰 저감 구조로써, 상기 하우징에서, 상기 제1방향과 평행하게 배치되고, 지정된 길이를 갖는 가이드 슬릿과, 상기 슬라이드 구조물에서, 상기 가이드 슬릿에 가이드되도록 배치되는 가이드 돌기와, 상기 가이스 슬릿에 배치되는 적어도 하나의 제1마그네트 및 상기 가이드 돌기에서, 상기 제1마그네트의 자력에 영향을 받는 위치에 배치되는 적어도 하나의 제2마그네트를 포함하고, 상기 적어도 하나의 제1마그네트와 상기 적어도 하나의 제2마그네트는, 상기 제1방향과 수직한 제2방향을 따라 적어도 부분적으로 서로 동일한 극성이 마주보도록 배치될 수 있다."}
{"patent_id": "10-2020-0148475", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 예시적인 실시예들에 따른 전자 장치는 하우징과 슬라이드 구조물간의 가이드 구조에, 적어도 하나의 마그네트(magnet)가 배치되고, 마그네트의 자력(예: 척력)을 이용하여 슬라이드 동작을 보조하는 마찰 저감 구 조가 제공됨으로써, 가이드 구조에서 발생되는 마찰력의 감소를 유도하여 슬라이드감을 개선하고, 오랜 기간 사 용하더라도 작동 신뢰성을 유지하는데 도움을 받을 수 있다. 또한, 마그네트의 자력을 이용하여, 인입/인출 동 작 중에 발생되는 플렉서블 디스플레이의 들뜸 현상을 방지할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2020-0148475", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모 듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다.센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다.안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a 및 도 2b는 본 발명의 다양한 실시예에 따른 인입 상태(slide-in state) 및 인출 상태(slide-out stat e)를 나타낸 전자 장치의 전면 사시도이다. 도 3a 및 도 3b는 본 발명의 다양한 실시예에 따른 인입 상태 및 인 출 상태를 나타낸 전자 장치의 후면 사시도이다. 도 2a 내지 도 3b의 전자 장치는 도 1의 전자 장치와 적어도 일부 유사하거나, 전자 장치의 다른 실 시예들을 포함할 수 있다. 도 2a 내지 도 3b를 참고하면, 전자 장치는 하우징(housing)(예: 하우징 구조, 제1하우징 또는 베이 스 하우징), 하우징으로부터 지정된 방향(예: X 축 방향) 및 지정된 왕복 거리로 이동 가능하게 결합되는 슬라이드 구조물(예: 슬라이드 구조, 제2하우징 또는 슬라이드 하우징), 슬라이드 구조물의 일단에 결합되고, 인입 상태(slide-in state)에서 밴딩을 통해 하우징의 내부 공간에 수용되는 밴딩 가능 부재 (bendable member 또는 bendable support member)(예: 도 4의 밴딩 가능 부재)(예: 힌지 레일 또는 다관 절 힌지 모듈) 및 슬라이드 구조물과 밴딩 가능 부재(예: 도 4의 밴딩 가능 부재)의 지지를 받도록 배치되는 플렉서블 디스플레이(flexible diaplay)(예: expandable display)를 포함할 수 있다. 한 실시예 에 따르면, 플렉서블 디스플레이는 인입 상태에서, 밴딩 가능 부재(예: 도 4의 밴딩 가능 부재)의 지 지를 받으면서 하우징의 내부 공간으로 수용됨으로써 외부로부터 보이지 않게 배치될 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이는 인출 상태(slide-out state)에서, 슬라이드 구조물과 동일한 평면 을 형성하는 밴딩 가능 부재(예: 도 4의 밴딩 가능 부재)의 지지를 받으면서, 외부로부터 보일 수 있게 배 치될 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1방향(예: Z 축 방향)을 향하는 전면(210a)(예: 제1면), 제1방향 과 반대인, 제2방향(- Z 축 방향)을 향하는 후면(210b)(예: 제2면) 및 전면(210a)과 후면(210b) 사이의 공간을 둘러싸고, 적어도 부분적으로 외부로 노출되는 측면(210c)을 포함하는 하우징(예: 하우징 구조)을 포함할 수 있다. 한 실시예에 따르면, 후면(210b)은 하우징의 적어도 일부로 구성되는 후면 커버를 포함할 수 있다. 어떤 실시예에서, 하우징은 전자 장치의 내부 공간에 배치되고, 슬라이드 구조물을 가 이드하는 베이스 브라켓(예: 도 4의 베이스 브라켓), 베이스 브라켓(예: 도 4의 베이스 브라켓)의 적 어도 일부에 결합되는 적어도 하나의 측면 커버(211, 212) 및 후면 커버의 적어도 일부를 통해 구성될 수 도 있다. 한 실시예에 따르면, 후면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 소재들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 어떤 실시예에서, 후면 커버는 측면(210c)의 적어도 일부까지 연장될 수도 있다. 다양한 실시예에 따르면, 측면(210c)은 제1길이를 갖는 제1측면, 제1측면으로부터 수직한 방향으로 제1길이보다 긴 제2길이를 갖도록 연장되는 제2측면, 제2측면으로부터 제1측면과 평행하게 연장되고 제1길이를 갖는 제3측면 및 제3측면으로부터 제2측면과 평행하게 연장되고 제2길이 를 갖는 제4측면을 포함할 수 있다. 한 실시예에 따르면, 슬라이드 구조물은 플렉서블 디스플레이 를 지지하고, 제2측면으로부터 제4측면 방향(예: X 축 방향)으로 인출됨으로써(slide-out), 플렉서블 디스플레이의 디스플레이 면적을 확장시키거나, 제4측면으로부터 제2측면 방향(예: - X 축 방향)으로 인입됨으로써(slide-in), 플렉서블 디스플레이의 디스플레이 면적을 축소시킬 수 있다. 한 실시예에 따르면, 적어도 하나의 측면 커버(211, 212)는 제1측면 및 제3측면에 배치될 수 있다. 다양한 실시예에 따르면, 슬라이드 구조물은 플렉서블 디스플레이를 적어도 부분적으로 지지하고, 인 입 상태 및/또는 인출 상태에서 외부로부터 보일 수 있는 위치에 배치되는 측면 부재를 포함할 수 있다. 한 실시예에 따르면, 측면 부재는, 제1측면과 슬라이딩 가능하게 결합되는 제5측면, 제5측면 으로부터 연장되고, 인입 상태에서 제4측면과 적어도 부분적으로 대면하는 제6측면 및 제6측 면으로부터 연장되고, 제3측면과 슬라이딩 가능하게 결합되는 제7측면을 포함할 수 있다. 한 실시예에 따르면, 제5측면과 제7측면은, 인입 상태에서, 하우징의 내부 공간으로 인입됨으로 써 외부로부터 보이지 않게 배치될 수 있다. 어떤 실시예에서, 제5측면과 제7측면은, 인입 상태에 서, 하우징의 내부 공간으로 부분적으로 인입됨으로써, 적어도 일부가 외부로부터 보일 수 있게 배치될 수 도 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이는 슬라이드 구조물의 지지를 받는 제1영역(230a)(예: 평면부) 및 제1영역(230a)으로부터 연장되고, 밴딩 가능 부재(예: 도 4의 밴딩 가능 부재)의 지지를 받는 제2영역(230b)(예: 굴곡 가능부)을 포함할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 제2영역 (230b)은, 전자 장치의 인입 상태에서, 하우징의 내부 공간으로 인입되고, 외부로 노출되지 않도록 배치될 수 있으며, 전자 장치의 인출 상태에서, 밴딩 가능 부재(예: 도 4의 밴딩 가능 부재)의 지지 를 받으면서 제1영역(230a)으로부터 연장되도록 외부로 노출될 수 있다. 따라서, 전자 장치는 하우징(21 0)으로부터 슬라이드 구조물의 이동에 따라 플렉서블 디스플레이의 디스플레이 면적이 가변되는 롤러 블 타입(rollable type) 및/또는 슬라이더블 타입(slidable type) 전자 장치를 포함할 수 있다. 다양한 실시예에 따르면, 슬라이드 구조물은 하우징으로부터 적어도 부분적으로 인입되거나 인출되도 록 슬라이딩 방식으로 결합될 수 있다. 예컨대, 전자 장치는, 인입 상태에서, 제2측면으로부터 제4 측면까지의 제1폭(W1)을 갖도록 구성될 수 있다. 한 실시예에 따르면, 전자 장치는, 인출 상태에서, 하우징의 내부에 인입된 밴딩 가능 부재(예: 도 4의 밴딩 가능 부재)가, 추가적인 제2폭(W2)을 갖도 록 지정된 방향(예: X 축 방향)으로 이동됨으로써, 제1폭(W1)보다 큰 제3폭(W3)을 갖도록 작동될 수 있다. 따라 서, 플렉서블 디스플레이는, 인입 상태에서, 실질적으로 제1폭(W1)의 디스플레이 면적을 가질 수 있으며, 인출 상태에서, 실질적으로 제3폭(W3)의, 확장된 디스플레이 면적을 가질 수 있다. 한 실시예에 따르면, 플렉서 블 디스플레이는 평면 및 평면으로부터 양측 에지 방향으로 연장된 곡면을 포함하도록 배치될 수도 있다. 다양한 실시예에 따르면, 슬라이드 구조물은 사용자의 조작을 통해 동작될 수 있다. 예컨대, 전자 장치 는 플렉서블 디스플레이의 외면을 지정된 방향으로 가압하는 사용자의 조작을 통해, 인입 상태 또는인출 상태로 천이될 수 있다. 어떤 실시예에서, 전자 장치는 외부로 노출된 로커(locker)(미도시 됨)의 버 튼(미도시 됨) 조작을 통해, 슬라이드 구조물이 지정된 방향(예: X 축 방향)으로 자동으로 인출될 수도 있 다. 이러한 경우, 슬라이드 구조물은, 지정된 방향(예: -X 축 방향)으로 가압될 때, 탄성 부재(예: 토션 스프링)에 의해 인출되려는 복원력을 보유하면서 로커(미도시 됨)를 통해 인입 상태를 유지하도록 단속될 수 있 다. 어떤 실시예에서, 슬라이드 구조물은 하우징의 내부 공간에 배치되는 구동 메커니즘(예: 구동 모 터, 감속 모듈 및/또는 기어 조립체)을 통해 자동으로 동작될 수도 있다. 한 실시예에 따르면, 전자 장치 는 프로세서(예: 도 1의 프로세서)를 통해, 전자 장치의 인입/인출 상태의 천이를 위한 이벤트를 검 출하면, 구동 메카니즘을 통해 슬라이드 구조물의 동작을 제어하도록 설정될 수 있다. 어떤 실시예에서, 전자 장치의 프로세서(예: 도 1의 프로세서)는 인입 상태, 인출 상태 또는 중간 상태(intermediate state)에 따라, 플렉서블 디스플레이의 변화된 표시 면적에 대응하여, 다양한 방식으로 객체를 표시하고, 응용 프로그램을 실행하도록 플렉서블 디스플레이를 제어할 수도 있다. 다양한 실시예에 따르면, 전자 장치는, 입력 장치, 음향 출력 장치(206, 207), 센서 모듈(204, 217), 카메라 모듈(205, 216), 커넥터 포트, 키 입력 장치(미도시 됨) 또는 인디케이터(미도시 됨) 중 적 어도 하나를 포함할 수 있다. 다른 실시예로, 전자 장치는, 상술한 구성 요소들 중 적어도 하나가 생략하 거나, 다른 구성 요소들이 추가적으로 포함되도록 구성될 수도 있다. 다양한 실시예에 따르면, 입력 장치는, 마이크를 포함할 수 있다. 어떤 실시예에서는, 입력 장치는 소리의 방향을 감지할 수 있도록 배치되는 복수의 마이크들을 포함할 수도 있다. 음향 출력 장치(206, 207)는 스피커들을 포함할 수 있다. 음향 출력 장치(206, 207)는, 외부 스피커 및 통화용 리시버를 포함할 수 있다. 다른 실시예로, 음향 출력 장치(206, 207)는 별도의 스피커 홀이 배제된 채, 동작되는 스피커(예: 피 에조 스피커)를 포함할 수도 있다. 다양한 실시예에 따르면, 센서 모듈(204, 217)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태 에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(204, 217)은, 예를 들어, 전자 장치 의 전면(210a)에 배치된 제1센서 모듈(예: 근접 센서 또는 조도 센서) 및/또는 후면(210b)에 배치된 제2센 서 모듈(예: HRM(heart rate monitoring) 센서)를 포함할 수 있다. 한 실시예에 따르면, 제1센서 모듈 은 전자 장치의 전면(210a)에서, 플렉서블 디스플레이 아래에 배치될 수 있다. 한 실시예에 따 르면, 제1센서 모듈은 근접 센서, 조도 센서, TOF(time of flight) 센서, 초음파 센서, 지문 인식 센서, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서 또는 습도 센서 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 카메라 모듈(205, 216)은, 전자 장치의 전면(210a)에 배치된 제1카메라 모듈 및 후면(210b)에 배치된 제2카메라 모듈을 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제2카메라 모듈 근처에 위치되는 플래시를 포함할 수 있다. 한 실시예에 따르면, 카메라 모듈들(205, 216)은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 한 실시예 에 따르면, 제1카메라 모듈은 플렉서블 디스플레이 아래에 배치되고, 플렉서블 디스플레이의 활 성화 영역 중 일부를 통해 피사체를 촬영하도록 구성될 수도 있다. 한 실시예에 따르면, 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 다양한 실시예에 따르면, 카메라 모듈들(205, 216) 중 일부 카메라 모듈, 센서 모듈(204, 217)들 중 일부 센서 모듈 또는 인디케이터는 플렉서블 디스플레이를 통해 노출되도록 배치될 수 있다. 예컨대, 일부 카메라 모듈, 일부 센서 모듈 또는 인디케이터는 전자 장치의 내부 공간에서, 플렉서블 디스플 레이에 천공된 오프닝 또는 투과 영역을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 일부 카메라 모듈과 대면하는 영역은 컨텐츠를 표시하는 영역의 일부 로서 지정된 투과율을 갖는 투과 영역으로 형성될 수도 있다. 한 실시예에 따르면, 투과 영역은 약 5% 내지 약 20% 범위의 투과율을 갖도록 형성될 수 있다. 이러한 투과 영역은 이미지 센서로 결상되어 화상을 생성하기 위 한 광이 통과하는, 일부 카메라 모듈의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예 를 들어, 플렉서블 디스플레이의 투과 영역은 주변보다 픽셀의 밀도 및/또는 배선 밀도가 낮은 영역을 포 함할 수 있다. 예를 들어, 투과 영역은 상술한 오프닝을 대체할 수 있다. 예를 들어, 일부 카메라 모듈은 언더 디스플레이 카메라(UDC, under display camera)를 포함할 수 있다. 다른 실시예로, 일부 센서 모듈은 전자 장치의 내부 공간에서 플렉서블 디스플레이를 통해 시각적으로 노출되지 않고 그 기능을 수행하 도록 배치될 수도 있다. 다양한 실시예에 따르면, 전자 장치는 적어도 하나의 안테나(예: 도 1의 안테나 모듈)를 포함할 수도 있다. 한 실시예에 따르면, 적어도 하나의 안테나(예: 도 1의 안테나 모듈)는, 예를 들어, 외부 전자 장치 (예: 도 1의 전자 장치)와 무선으로 통신하기 위한 신호를 송수신하도록 설정될 수 있다. 한 실시예에 따 르면, 전자 장치는 내부 공간에 배치되는 또 다른 안테나(미도시 됨)를 포함할 수도 있다. 한 실시예에 따 르면, 또 다른 안테나는 충전에 필요한 전력을 무선으로 송수신할 수 있다. 한 실시예에 따르면, 적어도 하나의 안테나 및/또는 또 다른 안테나는 legacy antenna, mmWave antenna, NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 본 발명의 다양한 실시예들에 따른 전자 장치는 하우징과 슬라이드 구조물 사이의 가이드 구조 에 적용되는 마찰 저감 구조를 포함할 수 있다. 예컨대, 마찰 저감 구조는 제1측면과 제5측면 사이 및/또는 제3 측면과 제7측면 사이에 배치될 수 있다. 어떤 실시예에서, 마찰 저감 구조는 밴딩 가능 부재(예: 도 4의 밴딩 가능 부재)와 하우징 사이에 배치될 수도 있다. 어떤 실시예에서, 마찰 저감 구조는 플렉서블 디스플 레이와 후면 커버 사이에 배치될 수도 있다. 본 발명의 예시적인 실시예들에 따른 전자 장치는 마찰 저감 구조를 포함함으로써, 인입/인출 동작 중에 하우징과 슬라이드 구조물간에 발생되는 마찰 저항을 감소시킴으로써, 개선된 슬라이드감이 제공되고, 마모 현상이 감소하여 장치의 신뢰성 확보에 도움을 줄 수 있다. 또한, 인입/인출 동작 중에 발생되는 플렉서블 디스플레이의 들뜸 현상이 방지될 수 있다. 도 4는 본 발명의 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 4를 참고하면, 전자 장치는 회전 가능하게 배치되는 적어도 하나의 가이드 롤러를 포함하는 베이 스 브라켓, 베이스 브라켓에 지정된 왕복 거리로 슬라이딩 가능하게 결합되는 슬라이드 구조물, 슬라이드 구조물과 함께 이동하도록 배치되는 밴딩 가능 부재, 슬라이드 구조물과 밴딩 가능 부 재의 지지를 받도록 배치되는 플렉서블 디스플레이, 베이스 브라켓의 적어도 일부에 고정되는 커버 부재(예: 후면 커버) 및 베이스 브라켓에 적어도 부분적으로 고정되고, 전자 장치의 측면 외관 의 적어도 일부를 형성하는 적어도 하나의 측면 커버(211, 212)를 포함할 수 있다. 한 실시예에 따르면, 측면 커버(211, 212)는 서로 대향되는 위치에 배치되는 제1측면 커버 및 제2측면 커버를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 베이스 브라켓, 커버 부재 및 적어도 하나의 측면 커버(211, 212)를 통해 내부 공간을 포함하는 하우징(예: 2a의 하우징)(예: 하우징 구조)을 형성할 수 있다. 한 실시 예에 따르면, 전자 장치는 내부 공간에 배치되는 기판과 같은, 다양한 전기 구조물을 포함할 수 있다. 다양한 실시예에 따르면, 슬라이드 구조물은, 적어도 부분적으로 플레이트 형상으로 형성될 수 있으며, 제 1방향(예: z 축 방향)을 향하는 제1면, 제1방향과 반대인 제2방향(예: - z 축 방향)을 향하는 제2면 및 제1면과 제2면 사이의 공간을 적어도 부분적으로 둘러싸는 측면 부재를 포함할 수 있다. 어떤 실시예에서, 측면 부재는 슬라이드 구조물과 일체로 형성될 수 있다. 어떤 실시예에서, 측면 부재는 별개로 구성되어, 슬라이드 구조물과 구조적으로 결합될 수도 있다. 한 실시예에 따르면, 슬라이드 구조물의 제1면의 적어도 일부는 플렉서블 디스플레이를 지지하기 위한 형상 으로 형성될 수 있다. 한 실시예에 따르면, 밴딩 가능 부재(bendable member)(예: 멀티바 조립체)는 슬라 이드 구조물과 연동되도록 결합될 수 있다. 한 실시예에 따르면, 밴딩 가능 부재는 전자 장치가 인입 상태(slide-in state)일 때, 플렉서블 디스플레이의 일부와 함께 하우징(예: 도 2a의 하우징)의 내부 공간으로 인입됨으로써, 플렉서블 디스플레이가 제1디스플레이 면적을 갖도록 가이드할 수 있다. 한 실시예에 따르면, 밴딩 가능 부재는 전자 장치가 인출 상태(slide-out state)일 때, 슬라이드 구조물 과 동일한 평면을 형성하고, 플렉서블 디스플레이의 일부가 외부에서 보일 수 있도록 가이드할 수 있 다. 이러한 경우, 플렉서블 디스플레이는 제1디스플레이 면적보다 큰 제2디스플레이 면적을 가질 수 있다. 다양한 실시예에 따르면, 슬라이드 구조물은 플렉서블 디스플레이와 대면하는 제1면 및/또는 슬라이드 구조물과 베이스 브라켓 사이에서, 제2면의 구조적 변경을 통해 형성된 공간에 배치 되는 적어도 하나의 전자 부품(204, 205)을 포함할 수 있다. 한 실시예에 따르면, 적어도 하나의 전자 부품 (204, 205)은 카메라 모듈 및/또는 센서 모듈을 포함할 수 있다. 어떤 실시예에서, 적어도 하나의 전 자 부품은 안테나 모듈(미도시됨) 및/또는 키 버튼 모듈(미도시 됨)을 더 포함할 수도 있다. 한 실시예에 따르 면, 적어도 하나의 전자 부품이 카메라 모듈 및/또는 센서 모듈을 포함할 경우, 플렉서블 디스플레이 를 통해 외부 환경을 검출하도록 배치될 수 있다. 한 실시예에 따르면, 슬라이드 구조물은 플렉서블디스플레이를 지지하기 위한 평편한 면을 형성하기 위하여 적어도 하나의 전자 부품(204, 205)이 배치된 부분을 커버하기 위한 지지 커버를 포함할 수 있다. 이러한 경우, 지지 커버는 적어도 하나의 전자 부품(예: 카메라 모듈 및/또는 센서 모듈)과 플렉서블 디스플레이가 대면되도록 대응 위치에 형 성되는 적어도 하나의 관통홀(through hole)(2212a, 2212b)을 포함할 수 있다. 다양한 실시예에 따르면, 베이스 브라켓은 슬라이드 구조물과 대면하는 제3면 및 제3면 과 반대 방향을 향하고, 커버 부재와 대면하는 제4면을 포함할 수 있다. 한 실시예에 따르면, 베이 스 브라켓 및/또는 적어도 하나의 측면 커버(211, 212)는 슬라이드 구조물을 지정된 왕복 거리로 슬 라이딩 가능하게 수용하기 위한 가이드 구조(예: 도 5a의 가이드 슬릿을 포함할 수 있다. 한 실시예에 따 르면, 베이스 브라켓에 회전 가능하게 배치된 적어도 하나의 가이드 롤러는 슬라이드 구조물에 연결된 밴딩 가능 부재의 적어도 일부를 지지하는 방식으로 배치될 수 있다. 한 실시예에 따르면, 전자 장 치는 가이드 롤러의 지지를 받거나 가이드 롤러 근처에 배치되고, 밴딩 가능 부재가 들뜨 거나, 늘어지지 않도록 지지하기 위한 적어도 하나의 텐션 벨트를 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는 베이스 브라켓과 커버 부재 사이에 배치되고, 전자 장치 에 강성을 제공하거나, 부품들의 실장 공간을 제공하는 적어도 하나의 지지 브라켓(예: 리어 케이스)을 포함할 수 있다. 이러한 경우, 제1기판(예: 인쇄 회로 기판(PCB, printed circuit board))은 베이스 브라켓과 지지 브라켓 사이의 공간에 배치될 수도 있다. 다양한 실시예에 따르면, 전자 장치는 플렉서블 디스플레이와 제1기판을 전기적으로 연결하기 위한 전기적 연결 구조를 포함할 수 있다. 한 실시예에 따르면, 전기적 연결 구조는 플렉서블 디스플레이 의 배면으로 접히도록 배치된 디스플레이 패널과 기판을 전기적으로 연결하는 굴곡 가능한 슬라이드 FPCB를 포함할 수 있다. 한 실시예에 따르면, 슬라이드 FPCB는 슬라이드 구조물에 형성된 제1오 프닝 및 베이스 브라켓에 형성된 제2오프닝을 관통하는 방식으로 배치될 수 있다. 예컨대, 슬 라이드 FPCB는 슬라이드 구조물의 슬라이딩 가능한 왕복 거리(왕복 스트로크)를 수용하기 위한 형상 및 길이를 갖는 연결부를 포함할 수 있으며, 연결부의 일단은 슬라이드 구조물의 제1오프 닝에 관통된 후, 디스플레이 패널에 전기적으로 연결되고, 연결부의 타단은 베이스 브라켓 의 제2오프닝에 관통된 후, 기판에 전기적으로 연결될 수 있다. 한 실시예에 따르면, 슬라이드 FPCB와 플렉서블 디스플레이 및/또는 슬라이드 FPCB와 기판은 커넥터 결합 구조(예: 리셉 터클과 커넥터의 결합 구조)를 통해 전기적으로 연결될 수 있다. 본 발명의 예시적인 실시예에 따른 전자 장치는 슬라이드 구조물과 베이스 브라켓(예: 하우징) 간의 가이드 구조에 의해 발생하는 마찰 저항을 감소시키기 위한 마찰 저감 구조를 포함할 수 있다. 한 실 시예에 따르면, 마찰 저감 구조는 제1측면 커버에 배치되는 적어도 하나의 제1마그네트 및 제1 측면 커버에 슬라이딩 가능하게 가이드되는 슬라이드 구조물의 제5측면에 배치되는 적어도 하나의 제2마그네트를 포함할 수 있다. 한 실시예에 따르면, 적어도 하나의 제1마그네트와 적어도 하나의 제 2마그네트는, 슬라이드 구조물이 슬라이딩되는 제1방향(① 방향)과 수직한 제2방향(② 방향)을 따라 자력의 영향을 받도록 배치될 수 있다. 한 실시예에 따르면, 적어도 하나의 제1마그네트와 적어도 하나의 제2마그네트는 제2방향(② 방향)을 따라 적어도 부분적으로 서로 동일한 극성이 마주보도록 배치될 수 있 다. 따라서, 슬라이드 구조물과 제1커버 부재는, 슬라이딩 동작 시, 마그네트들(291, 292)의 척력을 이용한 배치를 통해, 면접촉이 줄어들기 때문에 마찰 저항이 감소될 수 있다. 어떤 실시예에서, 마찰 저감 구조 는 제2커버 부재와 슬라이드 구조물의 제7측면에도 배치될 수 있다. 이하, 마찰 저감 구조에 대하여 상세히 기술하기로 한다. 도 5a는 본 발명의 다양한 실시예에 따른 가이드 레일과 슬라이드 구조물의 가이드 구조를 도시한 전자 장치의 일부 사시도이다. 도 5b는 본 발명의 다양한 실시예에 따른 가이드 레일과 슬라이드 구조물의 가이드 구조 및 이에 적용되는 마찰 저감 구조를 도시한 전자 장치의 일부 단면 사시도이다. 도 5a 및 도 5b를 참고하면, 전자 장치는 제1측면 커버를 포함하는 하우징(예: 도 2a의 하우징) 및 하우징의 제1측면 커버를 따라 슬라이딩 가능하게 배치되는 슬라이드 구조물을 포함할 수 있 다. 한 실시예에 따르면, 제1측면 커버는 외측 커버(211a) 및 외측 커버(211a)에 배치되는 가이드 레일 (211b)을 포함할 수 있다. 한 실시예에 따르면, 가이드 레일(211b)은 제1방향(① 방향)을 따라 지정된 길이를갖도록 형성되는 가이드 슬릿을 포함할 수 있다. 한 실시예에 따르면, 슬라이드 구조물은 제5측면 에서 외측으로 돌출 형성되고, 가이스 슬릿을 따라 가이드되는 가이드 돌기를 포함할 수 있다. 한 실시예에 따르면, 가이드 돌기는 제5측면에 1개소 또는 그 이상의 개 수로 돌출 형성될 수 도 있다. 다양한 실시예에 따르면, 가이드 슬릿은 가이드 돌기를 제1방향(① 방향)으로 가이드하기 위한 충분한 폭 을 가질 수 있다. 따라서, 전자 장치가 인입 상태에서 인출 상태로 천이되거나, 인출 상태에서 인입 상태 로 천이될 때, 가이드 돌기는 가이드 슬릿의 내면과 면접촉되는 방식으로 동작하기 때문에, 마찰 저 항이 증가하고, 이는 사용자에게 균일하지 못한 슬라이드감을 제공할 수 있으며, 오랜 기간 사용되면 마모로 인 한 분진과 같은 이물질이 발생됨으로써 전자 장치의 작동 신뢰성이 저하될 수 있다. 따라서, 본 발명의 예 시적인 실시예들에 따른 전자 장치는 가이드 슬릿과 가이드 돌기 사이에 배치되는 마찰 저감 구조를 포함할 수 있다. 한 실시예에 따르면, 마찰 저감 구조는 가이드 슬릿에 배치되는 적어 도 하나의 제1마그네트(예: 도 6a의 제1마그네트)와 가이드 돌기에 배치되는 적어도 하나의 제2마그 네트(예: 도 6a의 제2마그네트)를 포함할 수 있다. 한 실시예에 따르면, 적어도 하나의 제1마그네트(예: 도 6a의 제1마그네트)와 적어도 하나의 제2마그네트(예: 도 6a의 제2마그네트)는 서로에 대하여 자력 의 영향을 받을 수 있도록 마주보게 배치될 수 있다. 예컨대, 적어도 하나의 제1마그네트(예: 도 6a의 제1마그 네트)와 적어도 하나의 제2마그네트(예: 도 6a의 제2마그네트)는 제1방향(① 방향)과 수직한 제2방향 (② 방향)을 따라 서로에 대하여 척력을 갖도록 배치됨으로써, 전자 장치의 작동 중에 가이드 돌기와 가이드 슬릿이 접촉되는 마찰 저항이 감소될 수 있다. 도 6a는 본 발명의 다양한 실시예에 따른 도 5b의 라인 6a-6a를 따라 바라본 전자 장치의 일부 단면도이다. 도 6a를 참고하면, 전자 장치는 베이스 브라켓, 베이스 브라켓에 결합되는 제1측면 커버를 포함하는 하우징과, 하우징으로부터 슬라이딩 가능하게 배치되는 슬라이드 구조물을 포함할 수 있다. 한 실시예에 따르면, 제1측면 커버는 외측 커버(211a) 및 외측 커버(211a)에 결합되는 가이드 레일 (211b)을 포함할 수 있다. 한 실시예에 따르면, 슬라이드 구조물은 제5측면에 돌출 형성된 가이드 돌기가 가이드 레일(211b)에 형성된 가이드 슬릿을 따라 가이드됨으로써, 하우징으로부터 인입 및/또는 인출될 수 있다. 한 실시예에 따르면, 가이드 돌기는 슬라이드 구조물과 일체로 형성될 수 있다. 어떤 실시예에서, 가이드 돌기는 별개로 형성되어 슬라이드 구조물에 구조적으로 결합될 수도 있다. 다양한 실시예에 따르면, 마찰 저감 구조는 가이드 레일(211b)의 가이드 슬릿 내면에 배치되는 적어 도 하나의 제1마그네트 및 가이드 돌기의 외면에서, 적어도 하나의 제1마그네트의 자력에 영향 을 받는 위치에 배치되는 적어도 하나의 제2마그네트를 포함하는 마찰 저감 구조를 가질 수 있다. 한 실시예에 따르면, 적어도 하나의 제1마그네트와 적어도 하나의 제2마그네트는 동일한 극성이 마주보 도록 배치됨으로써 서로에 대하여 척력이 발생될 수 있다. 예컨대, 가이드 돌기는, 가이드 슬릿에서 가이드될 때, 슬라이드 구조물이 이동되는 제1방향(① 방향)과 수직한 제2방향(② 방향)으로 면접촉될 수 있다. 따라서, 적어도 하나의 제1마그네트는, 가이드 돌기 및 적어도 하나의 제2마그네트를 사 이에 두고, 가이드 슬릿의 상측 내면(2111b) 및 하측 내면(2111c)에 각각 배치될 수 있으며, 가이드 돌기 와 가이드 슬릿의 내측면(2111a)은 지정된 간격으로 이격 배치될 수 있다. 이러한 배치 구조를 통해, 가이드 돌기는 적어도 하나의 제1마그네트와 적어도 하나의 제2마그네트 사이에 작용하는 척력을 통해, 가이드 슬릿의 내면에 접촉되지 않으면서 이동되기 때문에, 개선된 슬라이드감을 제공하고, 마모 현상을 감소시키는데 도움을 줄 수 있다. 한 실시예에 따르면, 마찰 저감 구조는 적어도 하나의 제1 마그네트와 가이스 슬릿의 내면들 사이에 배치되는 차폐 부재를 포함할 수 있다. 한 실시예에 따르면, 차폐 부재는 적어도 하나의 제1마그네트와 적어도 하나의 제2마그네트의 자력에 영향 을 받는 외부 이물질(예: 금속 분진)이 전자 장치에 들러붙는 현상을 방지하는데 도움을 줄 수 있다. 도 6b 및 도 6c는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 일부 단면도이다. 도 6b 및 도 6c의 전자 장치를 설명함에 있어서, 도 6a의 전자 장치의 구성 요소들과 실질적으로 동 일한 구성 요소들에 대해서는 동일한 부호를 부여하였으며, 그 상세한 설명은 생략될 수 있다.도 6b를 참고하면, 마찰 저감 구조는 가이드 슬릿에 배치되는 제1마그네트 및 제1마그네트 와 마주보도록 가이드 돌기에 배치되는 제2마그네트를 포함할 수 있다. 한 실시예에 따르면, 제 1마그네트는 가이드 슬릿에서, 제2마그네트 및 가이드 돌기를 둘러싸는 방식으로 배치될 수도 있다. 예컨대, 제1마그네트는 가이드 슬릿의 상측 내면(2111b), 내측면(2111a) 및 하측 내면 (2111c)을 따라 내면들을 둘러싸는 방식으로 배치될 수 있다. 이러한 경우, 차폐 부재 역시 제1마그네트 와 가이드 슬릿의 내면 사이에서, 제1마그네트와 대응하는 형상으로 배치될 수 있다. 도 6c를 참고하면, 마찰 저감 구조는 가이드 슬릿에 배치되는 제1마그네트 및 제1마그네트 와 마주보도록 슬라이드 구조물에 결합되는 제2마그네트를 포함할 수 있다. 한 실시예에 따르면, 제2마그네트는 슬라이드 구조물(2500의 제5측면으로부터 지정된 돌출량으로 돌출 배치됨으 로써, 전술한 가이드 돌기 역할을 겸용할 수도 있다. 도 7a는 본 발명의 다양한 실시예에 따른 전자 장치의 인입 상태에서, 제1마그네트의 배치 위치를 개략적으로 도시한 도면이다. 도 7b는 본 발명의 다양한 실시예에 따른 전자 장치의 인출 상태에서, 제1마그네트의 배치 위 치를 개략적으로 도시한 도면이다. 도 7a 및 도 7b를 참고하면, 전자 장치는 하우징 및 하우징으로부터 제1방향(① 방향)으로 지정 된 왕복 거리로 슬라이딩 가능하게 배치되는 슬라이드 구조물을 포함할 수 있다. 한 실시예에 따르면, 전 자 장치는, 인입 상태에서(예: 도 7a의 상태에서), 제1폭(W1)을 가질 수 있으며, 인출 상태에서(예: 도 7b 의 상태에서), 슬라이드 구조물이 제2폭(W2)만큼 확장됨으로써, 제1폭(W1)보다 큰 제3폭(W3)을 갖도록 동 작될 수 있다. 따라서, 제1측면 커버에 형성되고, 슬라이드 구조물의 가이드 돌기를 가이드하는 가이드 슬릿의 전체 길이(T1)는 적어도 슬라이드 구조물의 확장된 제2폭(W2)과 동일하거나, 더 길게 형성될 수 있다. 다양한 실시예에 따르면, 가이드 돌기는, 전자 장치가 인입 상태에서 인출 상태로 천이되거나, 인출 상태에서 인입 상태로 천이될 때, 적어도 하나의 제2마그네트가 가이드 슬릿의 내면에 배치된 적어 도 하나의 제1마그네트와 척력을 가지며, 제1방향(① 방향)과 수직한 제2방향(② 방향)으로 서로 밀어내도 록 배치됨으로써, 가이드 슬릿의 내면과 접촉되지 않으면서 가이드될 수 있다. 따라서, 슬라이딩 동작 중 에, 가이드 돌기는 가이드 슬릿과의 면접촉이 최소화되면서 마찰 저항이 감소될 수 있다. 도 8a 및 도 8b는 본 발명의 다양한 실시예에 따르면, 전자 장치에 배치된 마찰 저감 구조를 개략적으로 도시한 도면이다. 도 8a 및 도 8b의 전자 장치를 설명함에 있어서, 도 7a 및 도 7b의 전자 장치의 구성 요소들과 실질 적으로 동일한 구성 요소들에 대해서는 동일한 부호를 부여하였으며, 그 상세한 설명은 생략될 수 있다. 도 8a를 참고하면, 마찰 저감 구조는 가이드 슬릿에 배치되는 적어도 하나의 제1마그네트 및 제1마그네트와 반응하도록 마주보게 배치되고, 가이드 돌기에 배치되는 적어도 하나의 제2마그네트 를 포함할 수 있다. 한 실시예에 따르면, 적어도 하나의 제1마그네트는 지정된 간격으로 배치된 복수 의 마그네트들을 포함할 수 있다. 이러한 경우, 가이드 돌기에 배치된 적어도 하나의 제2마그네트는, 가이드 돌기의 이동 중에 지정된 간격으로 배치된 복수의 마그네트들과 순차적으로 척력을 갖도록 반응하 기 때문에 가이드 슬릿의 내면에 접촉되지 않을 수 있다. 한 실시예에 따르면, 복수의 마그네트들의 이격 거리는 가이드 돌기에 배치되는 적어도 하나의 제2마그네트와 자력에 의해 반응하는 범위내에서 결정 될 수 있다. 도 8b를 참고하면, 마찰 저감 구조는, 전자 장치의 슬라이딩 동작 상태(예: 중간 상태(intermediate state))중에 가이드 돌기와 대면하는, 가이스 슬릿의 대응 위치에 배치되는 제1마그네트, 제1 마그네트와 동일한 극성이 마주보도록 가이드 돌기에 배치되는 제2마그네트, 전자 장치의 인입 상태에서, 제2마그네트와 서로 다른 극성이 마주보도록 가이드 슬릿에 배치되는 제3마그네트 및 전자 장치의 인출 상태에서, 제2마그네트와 서로 다른 극성이 마주보도록 가이드 슬릿에 배치되는 제4마그네트를 포함할 수 있다. 다양한 실시예에 따르면, 제2마그네트와 제3마그네트간에 인력을 갖도록 배치되는 마그네트들의 배치 구조는 전자 장치의 인입 상태를 지속적으로 유지하는데 도움을 줄 수 있다. 한 실시예에 따르면, 제2마그네트 와 제4마그네트간에 인력을 갖도록 배치되는 마그네트들의 배치 구조는 전자 장치의 인출 상태를 지 속적으로 유지하는데 도움을 줄 수 있다. 한 실시예에 따르면, 제1마그네트와 제2마그네트간에 척력 을 갖도록 배치되는 마그네트들의 배치 구조는 전자 장치의 슬라이딩 동작 중에, 가이드 돌기와 가이 드 슬릿간의 마찰 저항을 줄임으로써, 원활한 슬라이딩 동작을 수행하는데 도움을 줄 수 있다. 어떤 실시 예에서, 제1마그네트는 지정된 간격으로 배치되는 복수의 마그네트들을 포함할 수도 있다. 미도시되었으나, 밴딩 가능 부재(예: 도 4의 밴딩 가능 부재)의 적어도 일부와, 제1측면 커버(예: 도 2a의 제1측면 커버) 및/또는 제2측면 커버(예: 도 2a의 제2측면 커버)사이에, 가이드 돌기 및 가이드 슬릿 을 포함하는 전술한 바와 같은 가이드 구조가 적용될 경우, 전술한 마찰 저감 구조들 중 적어도 하나의 마찰 저 감 구조가 해당 가이드 구조에 적용될 수도 있다. 도 9a 및 도 9b는 본 발명의 다양한 실시예에 따른 밴딩 가능 부재가 결합된 슬라이드 구조물 및 전자 장치의 일부 사시도이다. 도 10은 본 발명의 다양한 실시예에 따른 도 9b의 라인 10-10를 따라 바라본 전자 장치의 일 부 단면도이다. 도 9a 내지 도 10을 참고하면, 전자 장치는 하우징 및 하우징으로부터 제1방향(① 방향)으로 지 정된 왕복 거리로 이동 가능하게 배치되는 슬라이드 구조물을 포함할 수 있다. 한 실시예에 따르면, 하우 징은 베이스 브라켓, 베이스 브라켓에 결합되는 측면 커버(예: 도 2a의 제1측면 커버 )를 포함하고, 측면 커버는 전자 장치의 외관의 적어도 일부를 형성하는 외측 커버(211a) 및 외 측 커버(211a) 및 베이스 브라켓 사이에 결합되는 가이드 레일(211b)을 포함할 수 있다. 한 실시예에 따르 면, 전자 장치는 슬라이드 구조물과 연결되고, 인입 상태에서는 하우징의 내부 공간으로 수용되 고, 인출 상태에서는 슬라이드 구조물과 실질적으로 동일한 평면을 형성함으로써, 플렉서블 디스플레이 의 적어도 일부를 지지하는 밴딩 가능 부재를 포함할 수 있다. 한 실시예에 따르면, 밴딩 가능 부재 는 인입/인출 동작 시, 지정된 곡률을 갖도록 서로에 대하여 회동 가능하게 배치되는 복수의 멀티바들 을 포함할 수 있다. 한 실시예에 따르면, 외측 커버(211a)는 플렉서블 디스플레이 및/또는 밴딩 가능 부재의 가장자리를 커버하도록 연장되는 커버부를 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는 밴딩 가능 부재와 하우징의 측면 커버의 커버부 사이에 배치됨으로써, 밴딩 가능 부재와 하우징간의 마찰 저항을 감소시키고, 플렉서블 디스 플레이의 들뜸 현상을 방지하기 위한 마찰 저감 구조(290-1)를 포함할 수 있다. 한 실시예에 따르면, 마찰 저감 구조(290-1)는 커버부에서 복수의 멀티바들의 적어도 일부와 대면하도록 배치되는 제1마그네트 및 제1마그네트와 마주보도록 복수의 멀티바들 각각에 배치되는 제2마그네트를 포함할 수 있다. 어떤 실시예에서, 제2마그네트는 복수의 멀티바들 중 지정된 멀티바들 각각에 배치될 수도 있 다. 한 실시예에 따르면, 제1마그네트와 제2마그네트는 제1방향(① 방향)과 실질적으로 수직한 제2방 향(② 방향)을 따라 서로에 대하여 마주보도록 배치될 수 있다. 한 실시예에 따르면, 제1마그네트와 제2마 그네트는 동일한 극성이 서로 마주봄으로써, 척력을 갖도록 배치될 수 있다. 따라서, 밴딩 가능 부재(26 0)는 제2방향(② 방향)을 따라 제1마그네트와 제2마그네트를 통해 작용하는 척력을 통해 베이스 브라 켓 방향으로 밀림으로써, 커버부와의 마찰 저항이 감소될 수 있으며, 밴딩 가능 부재의 지지를 받는 플렉서블 디스플레이 역시 외측 방향으로 들뜨는 현상이 감소될 수 있다. 도 11a는 본 발명의 다양한 실시예에 따른 도 10의 라인 11a-11a를 따라 바라본 전자 장치의 일부 단면도이다. 도 11a를 참고하면, 전자 장치는 하우징 및 하우징으로부터 제1방향(① 방향)으로 지정된 왕복 거리로 이동 가능하게 배치되는 슬라이드 구조물을 포함할 수 있다. 한 실시예에 따르면, 측면 커버 의 커버부는, 플렉서블 디스플레이를 위에서 바라볼 때, 플렉서블 디스플레이의 가장자리 및/ 또는 밴딩 가능 부재의 적어도 일부와 중첩되도록 배치될 수 있다. 한 실시예에 따르면, 전자 장치는 커버부와 밴딩 가능 부재가 중첩되는 중첩 부분에 배치되는 마찰 저감 구조(290-1)를 포함할 수 있 다. 한 실시예에 따르면, 마찰 저감 구조(290-1)는 커버부에서 복수의 멀티바들의 적어도 일부와 대면하도록 배치되는 제1마그네트 및 제1마그네트와 마주보도록 복수의 멀티바들에 배치되는 제2 마그네트를 포함할 수 있다. 한 실시예에 따르면, 복수의 멀티바들은 제2마그네트를 수용하기 위하여, 플렉서블 디스플레이를 지지하는 외면(260a)(예: 지지면)보다 낮은 리세스를 포함할 수 있 다. 한 실시예에 따르면, 리세스에 제2마그네트가 배치될 경우, 제2마그네트는 복수의 멀티바 들의 외면(260a)과 실질적으로 동일한 평면을 형성할 수 있다. 한 실시예에 따르면, 제1마그네트 및 제2마그네트와, 플렉서블 디스플레이는 중첩되지 않도록 배치될 수 있다. 한 실시예에 따르면, 전자 장치는 커버부와 플렉서블 디스플레이 사이에 배치되는 스위퍼(sweeper)를 더 포함함으 로써, 플렉서블 디스플레이의 외면에 부착된 이물질 제거에 도움을 받을 수 있다. 한 실시예에 따르면, 스 위퍼는 직물(fabric) 또는 스폰지를 포함할 수 있다. 다양한 실시예에 따르면, 마찰 저감 구조(290-1)는 커버부와 제1마그네트 사이 및/또는 복수의 멀티 바들과 제2마그네트 사이에 배치되는 차폐 부재를 포함할 수 있다. 한 실시예에 따르면, 차폐 부재는 적어도 하나의 제1마그네트와 적어도 하나의 제2마그네트의 자력에 영향을 받는 외부 이물질(예: 금속 분진)이 전자 장치에 들러붙는 현상을 방지하는데 도움을 줄 수 있다. 도 11b 및 도 11c는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 일부 단면도이다. 도 11b 및 도 11c의 전자 장치를 설명함에 있어서, 도 11a의 전자 장치의 구성 요소들과 실질적으로 동일한 구성 요소들에 대해서는 동일한 부호를 부여하였으며, 그 상세한 설명은 생략될 수 있다. 도 11b를 참고하면, 전자 장치는 측면 커버의 커버부와 플렉서블 디스플레이 및/또는 밴 딩 가능 부재 사이에 배치되는 마찰 저감 구조(290-1)를 포함할 수 있다. 한 실시예에 따르면, 마찰 저감 구조(290-1)는 커버부에서 복수의 멀티바들의 적어도 일부와 대면하도록 배치되는 제1마그네트 및 제1마그네트와 마주보도록 복수의 멀티바들에 배치되는 제2마그네트를 포함할 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이를 위에서 바라볼 때, 제1마그네트 및 제2마그네트 는, 플렉서블 디스플레이와 적어도 부분적으로 중첩되도록 배치될 수 있다. 이러한 경우, 스위퍼 는 제1마그네트와 플렉서블 디스플레이 사이에 배치될 수 있다. 한 실시예에 따르면, 제1마그 네트 및 제2마그네트와 중첩되는 플렉서블 디스플레이의 중첩 영역은 비활성화 영역(예: BM(black matrix) 영역)을 포함할 수 있다. 도 11b를 참고하면, 전자 장치는 측면 커버의 커버부와 플렉서블 디스플레이 사이에 배치 되는 마찰 저감 구조(290-1)를 포함할 수 있다. 한 실시예에 따르면, 마찰 저감 구조(290-1)는 커버부에 서 복수의 멀티바들의 적어도 일부와 대면하도록 배치되는 제1마그네트 및 제1마그네트와 마주 보도록 플렉서블 디스플레이의 가장자리에 배치되는 제2마그네트를 포함할 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이를 위에서 바라볼 때, 제1마그네트 및 제2마그네트 는, 플렉서블 디스플레이와 중첩되도록 배치될 수 있다. 이러한 경우, 스위퍼는 커버부 와 플렉서블 디스플레이 사이에 배치될 수 있다. 한 실시예에 따르면, 제1마그네트, 제2마그네트 및 스위퍼와 중첩되는 플렉서블 디스플레이의 중첩 영역은 비활성화 영역(예: BM(black matrix) 영역)을 포함할 수 있다. 도 12a는 본 발명의 다양한 실시예에 따른 밴딩 부재가 결합된 슬라이드 구조물의 사시도이다. 도 12b 및 도 12c는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 인입 상태 및 인출 상태를 도시 한 단면도이다. 도 12a 내지 도 12c를 참고하면, 전자 장치는 하우징 및 하우징으로부터 제1방향(① 방향)으로 지정된 왕복 거리로 이동 가능하게 배치되는 슬라이드 구조물을 포함할 수 있다. 한 실시예에 따르면, 전 자 장치는 인입/인출 동작 시, 하우징의 내부 공간에서 플렉서블 디스플레이의 처짐 변형에 의 해 하우징의 내면과 접촉됨으로써 발생되는 마찰 저항을 감소시키고, 텐션을 제공하기 위한 마찰 저감 구 조(290-2)를 포함할 수 있다. 한 실시예에 따르면, 마찰 저감 구조(290-2)는 하우징의 내부 공간에 배치되 는 제1마그네트 및 플렉서블 디스플레이의 적층 레이어들 중 일부 레이어들 사이에, 또는 플렉서블디스플레이의 외면에 배치되는 제2마그네트를 포함할 수 있다. 한 실시예에 따르면, 제1마그네트는 커버 부재의 내면에서 시트 형태로 부착되는 방식으로 배치될 수 있다. 한 실시예에 따르면, 마찰 저감 구 조(290-2)는 제1마그네트와 커버 부재 사이에 배치되는 차폐 부재를 더 포함할 수 있다. 한 실 시예에 따르면, 제2마그네트는 전자 장치의 작동 중에 하우징의 내부 공간을 수용되는 밴딩 가 능 부재와 대응하는 영역에 배치될 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이는 윈도우층, 윈도우층 아래에 순차적으로 배치되 는 편광층, 디스플레이 패널, 기능성 층 및 금속 시트층을 포함할 수 있다. 한 실시예에 따르면, 윈도우층은 폴리머층(예: PI 또는 TPU) 및/또는 글래스층(예: UTG(ultra thin glass))을 포함할 수 있다. 한 실시예에 따르면, 디스플레이 패널은 복수의 픽셀들 및 배선 구조(예: 전극 패턴)를 포함할 수 있다. 한 실시예에 따르면, 편광층은 디스플레이 패널의 광원으로부터 발생되고 일정한 방향으로 진동하는 빛을 선택적으로 통과시킬 수 있다. 한 실시예에 따르면, 디스플레이 패널과 편광층은 일체 로 형성될 수도 있다. 한 실시예에 따르면, 기능성 층은 배경 시연 및 완충을 위한 완충층, 방열을 위한 그라파이트 시트, added 디스플레이, 포스터치 FPCB, 지문 센서 FPCB, 통신용 안테나 방사체, 디지타이저 또는 도전/비도전 테이프를 포함할 수 있다. 한 실시예에 따르면, 금속 시트층은 플렉서블 디스플레이에 굴곡 특성 및 강성을 제공하도록 배치될 수 있다. 한 실시예에 따르면, 제2마그네트는 디스플레이 패널 아래에 배치될 수 있다. 한 실시예에 따르면, 제2마그네트는 디스플레이 패널과 금속 시트층 사이에 배치될 수 있다. 예컨대, 제2마그네트는 디스플레이 패널 및 윈도우층을 통해 자 력이 투과될 수 있는 플렉서블 디스플레이의 다양한 레이어에 배치될 수 있다. 이러한 경우, 제2마그네트 는 박막의 자화 메탈 시트로 형성될 수 있다. 어떤 실시예에서, 자화 메탈 시트는 지정된 간격으로 이격 배치되는 복수의 자화 메탈 시트들을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치가 인입 상태 및 또는 인입 상태로부터 인출 상태로 동작될 때, 제1마 그네트와 동일한 극성이 마주보도록 배치된 제2마그네트를 통해 척력이 발생될 수 있으며, 플렉서블 디스플레이는 척력을 통해 밴딩 가능 부재 방향으로 가압받는 상태가 유지되기 때문에 플렉서블 디스 플레이의 처침 현상이 방지되고, 마찰 저항이 감소될 수 있다. 도 13a는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치를 개략적으로 도시한 도면이다. 도 13b는 본 발명의 다양한 실시예에 따른 커버 부재의 일부 사시도이다. 도 13c는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 일부 사시도이다. 도 13a 내지 도 13c를 참고하면, 전자 장치(예: 도 2a의 전자 장치)는 하우징(예: 도 2a의 하 우징) 및 하우징으로부터 제1방향(① 방향)으로 지정된 왕복 거리로 이동 가능하게 배치되는 슬라이 드 구조물(예: 도 2a의 슬라이드 구조물)을 포함할 수 있다. 한 실시예에 따르면, 하우징은 슬라이드 구조물의 적어도 일부를 가이드하도록 배치되는 제1측면 커버(예: 도 2a의 제2측면 커버) 및 제1측면 커버와 대향되는 위치에 배치되는 제2측면 커버(예: 도 2a의 제1측면 커버)를 포함할 수 있다. 한 실시예에 따르면, 슬라이드 구조물은 제1측면 커버 및 제2측면 커버를 통해 형성된 가이드 구조를 통해 제1방향(① 방향)으로 슬라이딩 동작이 수행될 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1측면 커버와 슬라이드 구조물 사이에 배치되는 마찰 저감 구조(290-3)를 포함할 수 있다. 미도시되었으나, 마찰 저감 구조(290-3)는 제2측면 커버와 슬라이드 구조물 사이에도 실질적으로 동일하게 배치될 수도 있다. 한 실시예에 따르면, 마찰 저감 구조(290-3)는 제1측면 커버의 내측면에 배치되는 제1마그네트, 제1방향(① 방향)과 수직한 제3방향(③ 방 향)을 따라 제1마그네트와 동일한 극성이 마주보도록 슬라이드 구조물의 측면에 배치되는 제2 마그네트, 전자 장치의 인입 상태에서, 제1마그네트와 서로 다른 극성이 마주보도록 슬라이드 구조물의 측면에 배치되는 제3마그네트 및 전자 장치의 인출 상태에서, 제1마그네트(39 1)와 서로 다른 극성이 마주보도록 슬라이드 구조물의 측면에 배치되는 제4마그네트를 포함할 수 있다. 다양한 실시예에 따르면, 제1마그네트와 제3마그네트간에 인력을 갖도록 배치되는 마그네트들(391, 393)의 배치 구조는 전자 장치의 인입 상태를 지속적으로 유지하는데 도움을 줄 수 있다. 한 실시예에 따 르면, 제1마그네트와 제4마그네트간에 인력을 갖도록 배치되는 마그네트들(391, 394)의 배치 구조는 전자 장치의 인출 상태를 지속적으로 유지하는데 도움을 줄 수 있다. 한 실시예에 따르면, 제1마그네트와 제2마그네트간에 척력을 갖도록 배치되는 마그네트들(391, 392)의 배치 구조는 전자 장치의 슬라이딩 동작 동안에, 제1측면 커버의 내측면과 슬라이드 구조물의 측면간의 마찰 저항 을 줄임으로써, 원활한 슬라이딩 동작을 수행하는데 도움을 줄 수 있다. 어떤 실시예에서, 제1마그네트는 지정된 간격으로 배치되는 복수의 마그네트들을 포함할 수도 있다. 어떤 실시예에서, 제1마그네트와, 제2, 3, 4마그네트들(392, 392, 393)의 배치 구조는 서로 바뀌도록 배치될 수도 있다. 예컨대, 제1마그네트가 슬라이드 구조물의 측면에 배치되고, 제2, 3, 4마그네트들(392, 392, 393)이 제1측면 커버의 내측면에 배치될 수도 있다. 도 14a 내지 도 14c는 본 발명의 다양한 실시예에 따른 전자 장치의 동작에 따른 마찰 저감 구조의 배치 위치를 도시한 도면이다. 도 14a를 참고하면, 전자 장치가 인입 상태(slide-in state)일 때, 제1마그네트는 제3마그네트(39 3)와 마주보도록 위치될 수 있다. 이러한 경우, 제1마그네트와 제3마그네트는 다른 극성이 서로 마주 보도록 배치되기 때문에 두 마그네트(391, 393)에 의한 인력을 통해, 슬라이드 구조물은 인입된 상태를 지 속적으로 유지하는데 도움을 받을 수 있다. 도 14b를 참고하면, 전자 장치가 인입 상태에서 인출 상태로 천이되기 위한 중간 상태(intermediate state)일 때, 제1마그네트는 제2마그네트와 마주보도록 위치될 수 있다. 이러한 경우, 제1마그네트 와 제2마그네트는 동일한 극성이 서로 마주보도록 배치되기 때문에 두 마그네트(391, 392)에 의한 척 력을 통해, 슬라이드 구조물의 측면과 제1측면 커버의 내측면간의 마찰 저항이 감소됨으 로써, 원활한 슬라이드 동작을 수행하는데 도움을 줄 수 있다. 도 14c를 참고하면, 전자 장치가 인출 상태(slide-out state)일 때, 제1마그네트는 제4마그네트 와 마주보도록 위치될 수 있다. 이러한 경우, 제1마그네트와 제4마그네트는 다른 극성이 서로 마주보도록 배치되기 때문에 두 마그네트(391, 394)에 의한 인력을 통해, 슬라이드 구조물은 인출된 상태 를 지속적으로 유지하는데 도움을 받을 수 있다. 도 15는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 일부 단면도이다. 도 15를 참고하면, 마찰 저감 구조(290-3)는, 도 14a의 마찰 저감 구조(290-3)에서, 제3마그네트 및 제4마 그네트와 대체되는 스크류를 포함할 수 있다. 한 실시예에 따르면, 스크류는 제1마그네트의 자 력에 영향을 받는 금속 소재로 형성될 수 있다. 한 실시예에 따르면, 스크류은 전자 장치에서 하나의 구조 물을 다른 구조물과 결합하기 위하여 배치될 수 있다. 따라서, 슬라이드 구조물은, 인입 상태 및 인출 상 태에서, 제1마그네트의 자력의 영향을 받는 스크류를 통해 인입된 상태 및 인출된 상태가 지속적으로 유지될 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 도 2a의 전자 장치)는, 내부 공간을 포함하는 하우징(예: 도 2a의 하우징)과, 상기 하우징으로부터 지정된 왕복 거리로 제1방향(예: 도 2b의 ① 방향)을 따라 슬라이딩 가능 하게 결합되는 슬라이드 구조물(예: 도 2a의 슬라이드 구조물)과, 적어도 부분적으로 상기 슬라이드 구조 물의 지지를 받도록 배치되고, 인입 상태(slide-in state)에서, 적어도 부분적으로 외부로부터 보이지 않도록 상기 내부 공간에 수용되는 플렉서블 디스플레이(예: 도 2a의 플렉서블 디스플레이) 및 상기 하우징과 상 기 슬라이드 구조물 사이에 배치되는 제1마찰 저감 구조(예: 도 6a의 마찰 저감 구조)로써, 상기 하우징에 서, 상기 제1방향과 평행하게 배치되고, 지정된 길이를 갖는 가이드 슬릿(예: 도 6a의 가이드 슬릿)과, 상기 슬라이드 구조물에서, 상기 가이드 슬릿에 가이드되도록 배치되는 가이드 돌기(예: 도 6a의 가이드 돌기 )와, 상기 가이스 슬릿에 배치되는 적어도 하나의 제1마그네트(예: 도 6a의 제1마그네트) 및 상기 가 이드 돌기에서, 상기 제1마그네트의 자력에 영향을 받는 위치에 배치되는 적어도 하나의 제2마그네트(예: 도 6a 의 제2마그네트)를 포함하고, 상기 적어도 하나의 제1마그네트와 상기 적어도 하나의 제2마그네트는, 상기 제1방향과 수직한 제2방향(예: 도 6a의 ② 방향)을 따라 적어도 부분적으로 서로 동일한 극성이 마주보도록 배 치될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1마그네트는 상기 가이드 돌기 및 상기 적어도 하나의 제2마그 네트를 사이에 두고, 상기 가이드 슬릿의 상측 내면 및 하측 내면에 각각 배치될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1마그네트는 상기 가이드 슬릿의 길이와 실질적으로 동일한 길 이를 가질 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1마그네트는 지정된 간격으로 배치되는 복수의 마그네트들을 포 함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제1마그네트는 상기 가이드 돌기 및 상기 적어도 하나의 제2마그 네트를 둘러싸는 방식으로 배치될 수 있다. 다양한 실시예에 따르면, 상기 가이드 슬릿과 상기 적어도 하나의 제1마그네트 사이에 배치되는 차폐 부재를 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 슬라이드 구조물에 연결됨으로써 상기 플렉서블 디스플레이의 적어도 일부를 지 지하도록 배치되는 밴딩 가능 부재를 더 포함하고, 상기 밴딩 가능 부재는, 상기 인입 상태에서, 상기 내부 공 간으로 수용되고, 인출 상태에서, 상기 슬라이드 구조물과 실질적으로 동일한 평면을 형성하도록 상기 내부 공 간으로부터 인출될 수 있다. 다양한 실시예에 따르면, 상기 하우징과 상기 밴딩 가능 부재 사이에 배치되는 제2마찰 저감 구조로써, 상기 하 우징에 배치되는 적어도 하나의 제3마그네트 및 상기 밴딩 가능 부재에 배치되는 적어도 하나의 제4마그네트를 포함하는 제2마찰 저감 구조를 포함하고, 상기 적어도 하나의 제3마그네트와 상기 적어도 하나의 제4마그네트는, 상기 제2방향을 따라 적어도 부분적으로 서로 동일한 극성이 마주보도록 배치될 수 있다. 다양한 실시예에 따르면, 상기 하우징은, 상기 플렉서블 디스플레이를 위에서 바라볼 때, 상기 밴딩 가능 부재 및 상기 플렉서블 디스플레이와 적어도 부분적으로 중첩되는 커버부를 포함하고, 상기 적어도 하나의 제3마그네 트 및 상기 적어도 하나의 제4마그네트는 상기 커버부와 상기 밴딩 가능 부재 사이에 배치될 수 있다. 다양한 실시예에 따르면, 상기 플렉서블 디스플레이의 적어도 일부는 상기 적어도 하나의 제3마그네트와 상기 적어도 하나의 제4마그네트 사이에 배치될 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제3마그네트와 상기 플렉서블 디스플레이 사이에 배치되는 스위퍼 (sweeper)를 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제4마그네트는 상기 밴딩 가능 부재에 형성된 상기 플렉서블 디스 플레이를 지지하는 외면 보다 낮은 리세스에 장착되고, 상기 적어도 하나의 제4마그네트와 상기 플렉서블 디스 플레이는 동일한 평면을 형성할 수 있다. 다양한 실시예에 따르면, 상기 커버부와 상기 플렉서블 디스플레이 사이에 배치되는 스위퍼(sweeper)를 더 포함 할 수 있다. 다양한 실시예에 따르면, 상기 커버부와 상기 적어도 하나의 제3마그네트 사이, 및/또는 상기 밴딩 가능 부재 와 상기 적어도 적어도 하나의 제4마그네트 사이에 배치되는 차폐 부재를 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 내부 공간에서, 상기 밴딩 가능 부재와 상기 하우징 사이에 배치되는 제3마찰 저 감 구조로써, 상기 하우징의 내부 공간에 배치되는 적어도 하나의 제5마그네트 및 상기 플렉서블 디스플레이와 상기 밴딩 가능 부재 사이에 채비되는 적어도 하나의 제6마그네트를 포함하는 제3마찰 저감 구조를 포함하고, 상기 인입 상태에서, 상기 적어도 하나의 제5마그네트와 상기 적어도 하나의 제6마그네트는, 상기 제2방향을 따 라 적어도 부분적으로 서로 동일한 극성이 마주보도록 배치될 수 있다. 다양한 실시예에 따르면, 상기 플렉서블 디스플레이는 디스플레이 패널을 포함하고, 상기 적어도 하나의 제6마 그네트는 상기 디스플레이 패널의 배면에 적어도 부분적으로 부착되는 적어도 하나의 자화 메탈 시트를 포함할 수 있다. 다양한 실시예에 따르면, 상기 적어도 하나의 제5마그네트와 상기 하우징 사이에 배치되는 차폐 부재를 더 포함 할 수 있다. 다양한 실시예에 따르면, 상기 인입 상태에서, 상기 적어도 하나의 제2마그네트와 대면하도록 상기 가이드 슬릿 에 배치되는 제7마그네트 및 인출 상태에서, 상기 적어도 하나의 제2마그네트와 대면하도록 상기 가이드 슬릿에 배치되는 제8마그네트를 포함하고, 상기 제7마그네트 및 상기 제8마그네트는 상기 적어도 하나의 제1마그네트와적어도 부분적으로 서로 다른 극성이 마주보도록 배치될 수 있다. 다양한 실시예에 따르면, 상기 밴딩 가능 부재는 서로에 대하여 회동 가능하게 결합되는 복수의 단위 멀티바들 을 포함하고, 상기 적어도 하나의 제4마그네트는 상기 복수의 단위 멀티바들 각각에 배치될 수 있다. 다양한 실시예에 따르면, 상기 밴딩 가능 부재는 서로에 대하여 회동 가능하게 결합되는 복수의 단위 멀티바들 을 포함하고, 상기 적어도 하나의 제4마그네트는 상기 복수의 단위 멀티바들 중 일부 단위 멀티바들에 배치될 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 실시예에 따른 기술 내용을 쉽게 설명하고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 개시된 실시예들 이외에도 본 발명의 다 양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범 위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0148475", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은 본 발명의 다양한 실시예에 따른 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2a 및 도 2b는 본 발명의 다양한 실시예에 따른 인입 상태(slide-in state) 및 인출 상태(slide-out stat e)를 나타낸 전자 장치의 전면 사시도이다. 도 3a 및 도 3b는 본 발명의 다양한 실시예에 따른 인입 상태 및 인출 상태를 나타낸 전자 장치의 후면 사시도 이다.도 4는 본 발명의 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 5a는 본 발명의 다양한 실시예에 따른 가이드 레일과 슬라이드 구조물의 가이드 구조를 도시한 전자 장치의 일부 사시도이다. 도 5b는 본 발명의 다양한 실시예에 따른 가이드 레일과 슬라이드 구조물의 가이드 구조 및 이에 적용되는 마찰 저감 구조를 도시한 전자 장치의 일부 단면 사시도이다. 도 6a는 본 발명의 다양한 실시예에 따른 도 5b의 라인 6a-6a를 따라 바라본 전자 장치의 일부 단면도이다. 도 6b 및 도 6c는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 일부 단면도이다. 도 7a는 본 발명의 다양한 실시예에 따른 전자 장치의 인입 상태에서, 제1마그네트의 배치 위치를 개략적으로 도시한 도면이다. 도 7b는 본 발명의 다양한 실시예에 따른 전자 장치의 인출 상태에서, 제1마그네트의 배치 위치를 개략적으로 도시한 도면이다. 도 8a 및 도 8b는 본 발명의 다양한 실시예에 따르면, 전자 장치에 배치된 마찰 저감 구조를 개략적으로 도시한 도면이다. 도 9a 및 도 9b는 본 발명의 다양한 실시예에 따른 밴딩 가능 부재가 결합된 슬라이드 구조물 및 전자 장치의 일부 사시도이다. 도 10은 본 발명의 다양한 실시예에 따른 도 9b의 라인 10-10를 따라 바라본 전자 장치의 일부 단면도이다. 도 11a는 본 발명의 다양한 실시예에 따른 도 10의 라인 11a-11a를 따라 바라본 전자 장치의 일부 단면도이다. 도 11b 및 도 11c는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 일부 단면도이다. 도 12a는 본 발명의 다양한 실시예에 따른 밴딩 부재가 결합된 슬라이드 구조물의 사시도이다. 도 12b 및 도 12c는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 인입 상태 및 인 출 상태를 도시한 단면도이다. 도 13a는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치를 개략적으로 도시한 도면이다. 도 13b는 본 발명의 다양한 실시예에 따른 커버 부재의 일부 사시도이다. 도 13c는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 일부 사시도이다. 도 14a 내지 도 14c는 본 발명의 다양한 실시예에 따른 전자 장치의 동작에 따른 마찰 저감 구조의 배치 위치를 도시한 도면이다. 도 15는 본 발명의 다양한 실시예에 따른 마찰 저감 구조를 포함하는 전자 장치의 일부 단면도이다."}
