{"patent_id": "10-2021-0131109", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0047812", "출원번호": "10-2021-0131109", "발명의 명칭": "전자부품 내장기판", "출원인": "삼성전기주식회사", "발명자": "정명희"}}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 및 제2 캐비티가 각각 형성된 제1 및 제2 절연층;상기 제1 및 제2 캐비티 내에 각각 배치된 제1 및 제2 전자부품;상기 제1 및 제2 절연층 사이에 배치된 제1 접착층; 및상기 제1 접착층의 적어도 일부를 관통하는 연결부재; 를 포함하며,상기 연결부재의 일단 및 타단은 각각 상기 제1 및 제2 전자부품과 전기적으로 연결된, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 제1 및 제2 전자부품은 각각 접속패드를 포함하며,상기 연결부재의 일단 및 타단은 각각 상기 제1 및 제2 전자부품의 접속패드와 접촉 연결되는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 제1 접착층의 일면은 상기 제1 전자부품과 접하고, 상기 제1 접착층의 타면은 상기 제2 전자부품과접하는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 제1 및 제2 절연층 상에 배치되며, 상기 제1 및 제2 캐비티의 적어도 일부를 채우는 제3 및 제4 절연층;을 더 포함하는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 제3 및 제4 절연층 상에 각각 배치된 제1 및 제2 배선층; 및상기 제3 및 제4 절연층 각각의 적어도 일부를 관통하는 제1 및 제2 비아층; 을 더 포함하며,상기 제1 비아층은 상기 제1 배선층과 상기 제1 전자부품을 전기적으로 연결하고,상기 제2 비아층은 상기 제2 배선층과 상기 제2 전자부품을 전기적으로 연결하는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,공개특허 10-2023-0047812-3-상기 연결부재는 도전성 페이스트를 포함하고,상기 제1 및 제2 비아층은 도금층을 포함하는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5 항에 있어서,상기 제1 및 제2 비아층은 일면의 단면적이 타면의 단면적보다 크고,상기 연결부재는 일면의 단면적과 타면의 단면적이 실질적으로 동일한, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,단면 상에서 적층 방향 대비 상기 제1 및 제2 비아층의 측벽의 경사도는단면 상에서 적층 방향 대비 상기 연결부재의 측벽의 경사도보다 큰, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제5 항에 있어서,상기 제1 및 제2 비아층은 서로 반대 방향으로 테이퍼진(taper) 형상을 갖는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제3 항에 있어서,상기 제1 및 제2 절연층 상에 배치되며, 상기 제1 및 제2 캐비티의 적어도 일부를 채우는 제2 및 제3 접착층;을 더 포함하는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 제2 및 제3 접착층 상에 배치된 제3 및 제4 절연층;상기 제3 및 제4 절연층 상에 각각 배치된 제1 및 제2 배선층;상기 제2 접착층 및 상기 제3 절연층 각각의 적어도 일부를 관통하는 제1 비아층; 및상기 제3 접착층 및 상기 제4 절연층 각각의 적어도 일부를 관통하는 제2 비아층; 을 더 포함하고,상기 제1 비아층은 상기 제1 배선층과 상기 제1 전자부품을 전기적으로 연결하며,상기 제2 비아층은 상기 제2 배선층과 상기 제2 전자부품을 전기적으로 연결하는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 제1 및 제2 비아층은 서로 반대 방향으로 테이퍼진 형상을 갖는, 전자부품 내장기판.공개특허 10-2023-0047812-4-청구항 13 제1 및 제2 캐비티가 각각 형성된 제1 및 제2 절연층;상기 제1 및 제2 캐비티 내에 각각 배치된 제1 및 제2 전자부품;상기 제1 및 제2 절연층 사이에 배치된 제1 접착층;상기 제1 및 제2 절연층 상에 배치되며, 상기 제1 및 제2 캐비티의 적어도 일부를 채우는 절연재; 및상기 제1 접착층의 적어도 일부를 관통하는 연결부재; 를 포함하며,상기 제1 접착층의 일면은 상기 제1 전자부품과 접하고, 상기 제1 접착층의 타면은 상기 제2 전자부품과접하는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 연결부재의 일단 및 타단은 상기 제1 및 제2 전자부품과 접촉 연결된, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서,상기 절연재는 상기 제1 접착층과 동일한 재료를 포함하는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14 항에 있어서,상기 절연재 상에 배치된 배선층;상기 절연재의 적어도 일부를 관통하는 비아층; 을 더 포함하며,상기 배선층은 상기 비아층을 통해 상기 전자부품과 전기적으로 연결되는, 전자부품 내장기판."}
{"patent_id": "10-2021-0131109", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 제1 및 제2 캐비티가 각각 형성된 제1 및 제2 절연층; 상기 제1 및 제2 캐비티 내에 각각 배치된 제1 및 제2 전자부품; 상기 제1 및 제2 절연층 사이에 배치된 제1 접착층; 및 상기 제1 접착층의 적어도 일부를 관통 하는 연결부재; 를 포함하며, 상기 연결부재의 일단 및 타단은 각각 상기 제1 및 제2 전자부품과 전기적으로 연 결된, 전자부품 내장기판에 관한 것이다."}
{"patent_id": "10-2021-0131109", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자부품 내장기판에 관한 것이다."}
{"patent_id": "10-2021-0131109", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "클라우드, 인공지능, 전기 자동차 및 고속 통신 등에 쓰일 반도체 수요가 급격하게 증가하여 이를 뒷받침할 인 쇄회로기판(Printed Circuit Board)의 수요도 증가 하였다. 갈수록 인쇄회로기판을 보다 크게 만들어 고성능 반 도체 복수 개를 함께 임베딩 및 패키징 하는 기술이 요구되는데, 그에 따라 기판의 전체 크기가 증가 하고 있다. 종래의 EPS(Embedded Passive Substrate) 기술은 수동부품을 인쇄회로기판 내에 내장 하는 구조이다. 고용량화 에 따라 수동부품의 개수가 늘어나는데, 수동부품을 최대한 기판에 내장을 많이 해야만 기판 사이즈를 줄일 수 가 있어서 효율을 극대화 할 수 있다. 이에 수직 방향 복층으로 내장할 수 있는 EPS 기술을 개발하여 제안"}
{"patent_id": "10-2021-0131109", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "한다.발명의 내용"}
{"patent_id": "10-2021-0131109", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 여러 목적 중 하나는 박형화에 유리한 전자부품 내장기판을 제공하는 것이다. 본 개시의 여러 목적 중 다른 하나는 기판의 사이즈 감소에 유리한 전자부품 내장기판을 제공하는 것이다. 본 개시의 여러 목적 중 다른 하나는 복수의 수동부품 간 연결 거리를 단축시켜 신호 전달 효율을 증가시킨 전 자부품 내장기판을 제공하는 것이다. 본 개시의 여러 목적 중 다른 하나는 일괄 적층으로 인하여 공정이 간소화되며 제조 비용을 감소시킬 수 있는 전자부품 내장기판을 제공하는 것이다."}
{"patent_id": "10-2021-0131109", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일례에 따른 전자부품 내장기판은 제1 및 제2 캐비티가 각각 형성된 제1 및 제2 절연층; 상기 제1 및 제2 캐비티 내에 각각 배치된 제1 및 제2 전자부품; 상기 제1 및 제2 절연층 사이에 배치된 제1 접착층; 및 상 기 제1 접착층의 적어도 일부를 관통하는 연결부재; 를 포함하며, 상기 연결부재의 일단 및 타단은 각각 상기 제1 및 제2 전자부품과 전기적으로 연결된 것일 수 있다. 또는, 일례에 따른 전자부품 내장기판은 제1 및 제2 캐비티가 각각 형성된 제1 및 제2 절연층; 상기 제1 및 제2 캐비티 내에 각각 배치된 제1 및 제2 전자부품; 상기 제1 및 제2 절연층 사이에 배치된 제1 접착층; 상기 제1 및 제2 절연층 상에 배치되며, 상기 제1 및 제2 캐비티의 적어도 일부를 채우는 절연재; 및 상기 제1 접착층의 적어도 일부를 관통하는 연결부재; 를 포함하며, 상기 제1 접착층의 일면은 상기 제1 전자부품과 접하고, 상기 제1 접착층의 타면은 상기 제2 전자부품과 접하는 것일 수도 있다."}
{"patent_id": "10-2021-0131109", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 여러 효과 중 하나로 박형화에 유리한 전자부품 내장기판을 제공할 수 있다. 본 개시의 여러 효과 중 다른 하나로 기판의 사이즈 감소에 유리한 전자부품 내장기판을 제공할 수 있다. 본 개시의 여러 효과 중 다른 하나로 복수의 수동부품 간 연결 거리를 단축시켜 신호 전달 효율을 증가시킨 전 자부품 내장기판을 제공할 수 있다. 본 개시의 여러 효과 중 다른 하나로 일괄 적층으로 인하여 공정이 간소화되며 제조 비용을 감소시킬 수 있는 전자부품 내장기판을 제공할 수 있다."}
{"patent_id": "10-2021-0131109", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 개시에 대해 설명한다. 도면에서 요소들의 형상 및 크기 등은 보다 명확한 설 명을 위해 과장되거나 축소될 수 있다. 도 1은 전자기기 시스템의 예를 개략적으로 나타내는 블록도다. 도면을 참조하면, 전자기기는 메인보드를 수용한다. 메인보드에는 칩 관련부품, 네트 워크 관련부품, 및 기타부품 등이 물리적 및/또는 전기적으로 연결되어 있다. 이들은 후술하는 다 른 전자부품과도 결합되어 다양한 신호라인을 형성한다. 칩 관련부품으로는 휘발성 메모리(예컨대, DRAM), 비-휘발성 메모리(예컨대, ROM), 플래시 메모리 등의 메모리 칩; 센트랄 프로세서(예컨대, CPU), 그래픽 프로세서(예컨대, GPU), 디지털 신호 프로세서, 암호화 프로 세서, 마이크로 프로세서, 마이크로 컨트롤러 등의 어플리케이션 프로세서 칩; 아날로그-디지털 컨버터, ASIC(application-specific IC) 등의 로직 칩 등이 포함된다. 다만, 이에 한정되는 것은 아니고, 이러한 칩 외에도 기타 다른 형태의 칩 관련부품이 포함될 수도 있다. 또한, 이들 칩 관련부품이 서로 조합될 수도 있다. 칩 관련부품은 상술한 칩을 포함하는 패키지 형태일 수도 있다. 네트워크 관련부품으로는, Wi-Fi(IEEE 802.11 패밀리 등), WiMAX(IEEE 802.16 패밀리 등), IEEE 802.20, LTE(long term evolution), Ev-DO, HSPA+, HSDPA+, HSUPA+, EDGE, GSM, GPS, GPRS, CDMA, TDMA, DECT, Bluetooth, 3G, 4G, 5G 및 그 이후의 것으로 지정된 임의의 다른 무선 및 유선 프로토콜들이 포함되며, 이에 한 정되는 것은 아니고, 이 외에도 기타 다른 다수의 무선 또는 유선 표준들이나 프로토콜들 중의 임의의 것이 포 함될 수 있다. 또한, 네트워크 관련부품이 칩 관련부품과 조합되어 패키지 형태로 제공될 수도 있 다. 기타부품으로는, 고주파 인덕터, 페라이트 인덕터, 파워 인덕터, 페라이트 비즈, LTCC(low Temperature Co-Firing Ceramics), EMI(Electro Magnetic Interference) filter, MLCC(Multi-Layer Ceramic Condenser) 등 이 포함된다. 다만, 이에 한정되는 것은 아니고, 이 외에도 기타 다른 다양한 용도를 위하여 사용되는 칩 부품 형태의 수동소자 등이 포함될 수 있다. 또한, 기타부품이 칩 관련부품 및/또는 네트워크 관련부품 과 조합되어 패키지 형태로 제공될 수도 있다. 전자기기의 종류에 따라, 전자기기는 메인보드에 물리적 및/또는 전기적으로 연결되거나 그 렇지 않을 수도 있는 다른 전자부품을 포함할 수 있다. 다른 전자부품의 예를 들면, 카메라 모듈, 안테 나 모듈, 디스플레이, 배터리 등이 있다. 다만, 이에 한정되는 것은 아니고, 오디오 코덱, 비디오 코덱, 전력 증폭기, 나침반, 가속도계, 자이로스코프, 스피커, 대량 저장 장치(예컨대, 하드디스크 드라 이브), CD(compact disk), DVD(digital versatile disk) 등일 수도 있다. 이 외에도 전자기기의 종류에 따라 다양한 용도를 위하여 사용되는 기타 전자부품 등이 포함될 수 있음은 물론이다. 전자기기는, 스마트폰(smart phone), 개인용 정보 단말기(personal digital assistant), 디지털 비디오 카메라(digital video camera), 디지털 스틸 카메라(digital still camera), 네트워크 시스템(network system), 컴퓨터(computer), 모니터(monitor), 태블릿(tablet), 랩탑(laptop), 넷북(netbook), 텔레비전 (television), 비디오 게임(video game), 스마트 워치(smart watch), 오토모티브(Automotive) 등일 수 있다. 다만, 이에 한정되는 것은 아니며, 이들 외에도 데이터를 처리하는 임의의 다른 전자기기일 수 있음은 물론이다.도 2는 전자기기의 일례를 개략적으로 나타낸 사시도다. 도면을 참조하면, 전자기기는, 예를 들면, 스마트폰일 수 있다. 스마트폰의 내부에는 마더보드 가 수용되어 있으며, 이러한 마더보드에는 다양한 전자부품들이 물리적 및/또는 전기적으로 연결되어 있다. 또한, 카메라 모듈 및/또는 스피커 등이 내부에 수용되어 있다. 전자부품 중 일부는 상술한 칩 관련부품일 수 있으며, 예를 들면, 전자부품 내장기판 일 수 있으나, 이에 한정되는 것은 아니다. 전자부품 내장기판은 다층 인쇄회로기판 내에 전자부품이 내장된 형태일 수 있으나, 이에 한정되는 것은 아니다. 한편, 전자기기는 반드시 스마트폰에 한정되는 것은 아니며, 상술한 바와 같이 다른 전자기기일 수도 있음은 물론이다. 도 3은 전자부품 내장기판의 일례를 개략적으로 나타낸 단면도다. 도면을 참조하면, 일례에 따른 전자부품 내장기판(100A)은 제1 캐비티(C1)를 갖는 제1 절연층, 제2 캐비티 (C2)를 갖는 제2 절연층, 제1 및 제2 절연층(111, 112) 사이에 배치되며, 관통부(Ph)를 갖는 제1 접착층 (T1), 관통부(T1)에 배치된 연결부재(P), 제1 및 제2 캐비티(C1, C2)에 각각 배치된 제1 및 제2 전자부품(210, 220), 제1 캐비티(C1)의 적어도 일부를 채우며 제1 전자부품을 덮는 제3 절연층, 제2 캐비티(C2)의 적어도 일부를 채우며 제2 전자부품을 덮는 제4 절연층, 제3 및 제4 절연층(113, 114) 상에 각각 배 치된 제1 및 제2 배선층(121, 122), 제1 배선층과 제1 전자부품을 연결하는 제1 비아층 및 제2 배선층과 제2 전자부품을 연결하는 제2 비아층을 포함한다. 예를 들면, 일례에 따른 전자부품 내장기판(100A)은, 후술하는 공정에서와 같이, 연결부재(P)가 배치된 제1 접 착층(T1)의 일면과 타면에, 제1 및 제2 캐비티(C1, C2)를 갖는 제1 및 제2 절연층(111, 112)을 일괄 적층하여 제조할 수 있다. 이 때, 제1 및 제2 전자부품(210, 220)이 제1 및 제2 캐비티(C1, C2) 내에 배치되어 있을 수 있다. 이 경우, 복수의 전자부품이 기판의 두께 방향에서 바라볼 때 중첩되도록 수직 배치될 수 있어, 전자부품 (210, 220) 간의 신호 전달 거리를 최소화하는데 유리한 전자부품 내장기판(100A)을 제공할 수 있다. 한편, 일례에 따른 전자부품 내장기판(100A)은 복수의 전자부품(210, 220)을 내장할 수 있어 기판 전체의 사이 즈를 감소시킬 수 있으며, 전체 두께를 낮추어서, 기판의 상부와 하부 사이의 중심축을 전자부품에 가깝게 할 수 있으며, 또한 전자부품dl 기판 내에서 차지하는 면적 비율이 증가할 수 있는바, 워피지 개선에 유리 할 수 있다. 한편, 일례에 따른 전자부품 내장기판(100A)은 제1 접착층(T1)에 배치된 연결부재(P)를 통해 제1 및 제2 전자부 품(210, 220)이 전기적으로 연결된 구조를 갖는다. 제1 및 제2 전자부품(210, 220)은 연결부재(P)의 일단 및 타 단과 접촉하며 연결되고, 이 경우, 연결부재(P)를 통해 제1 및 제2 전자부품(210, 220)을 최단 거리로 연결할 수 있어, 신호 전송 시간 단축시킬 수 있고, 신호 불량 발생을 방지할 수 있다. 즉, 연결부재(P)의 일단은 제1 전자부품과 접촉하고, 연결부재(P)의 타단은 제2 전자부품과 접촉할 수 있다. 한편, 일례에 따른 전자부품 내장기판(100A)은, 후술하는 공정의 결과, 복수의 비아(131, 132, 133, 134) 중 제 1 및 제3 비아층(131, 133) 각각의 비아가 복수의 비아층(131, 132, 133, 134) 중 제2 및 제4 비아층(132, 134)의 비아와 반대 방향의 테이퍼(taper) 형상을 가질 수 있다. 구체적으로, 제1 비아층은 제1 전자부품 과 접촉하며 연결되고, 제2 비아층은 제2 전자부품과 접촉하며 연결될 수 있다. 즉, 제1 전자부 품의 전극(210P)의 일단은 연결부재(P)와 연결되고, 전극(210P)의 타단은 제1 비아층과 연결될 수 있 다. 마찬가지로, 제2 전자부품의 전극(220P)의 일단은 연결부재(P)와 연결되고, 전극(220P)의 타단은 제2비아층과 연결될 수 있다. 한편, 일례에 따른 전자부품 내장기판(100A)은 제1 및 제2 절연층(111, 112) 사이에 배치된 제1 접착층(T1)을 포함할 수 있다. 제1 접착층(T1)은 제1 및 제2 절연층(111, 112)과 상이한 재료를 포함할 수 있으며, 예를 들면 본딩 시트(Bonding Sheet)를 포함할 수 있다. 이를 통해, 제1 및 제2 전자부품(210, 220) 각각을 수용하는 제1 및 제2 절연층(111, 112) 간의 접합을 보다 효과적으로 도모할 수 있다. 한편, 일례에 따른 전자부품 내장기판(100A)은 제3 및 제4 절연층(113, 114) 각각의 일면 상에 배치되는 제5 및 제6 절연층(115, 116), 제5 및 제6 절연층(115, 116) 상에 배치되는 제3 및 제4 배선층(123, 124), 제5 절연층 을 관통하며 제3 배선층과 제1 배선층을 연결하는 제3 비아층, 제6 절연층을 관통하 며 제4 배선층과 제2 배선층을 연결하는 제4 비아층, 제3 배선층의 적어도 일부를 노출시 키는 복수의 제1 개구를 갖는 제1 패시베이션층, 제4 배선층의 적어도 일부를 각각 노출시키는 복수 의 제2 개구를 갖는 제2 패시베이션층을 더 포함할 수 있다. 이들을 통하여 내부 구성요소를 물리적 화학 적 손상 등으로부터 보호할 수 있다. 이하에서는, 도면을 참조하여 일례에 따른 전자부품 내장기판(100A)의 구성요소에 대하여 보다 자세히 설명한다. 복수의 절연층(111, 112, 113, 114, 115, 116)은 제1 내지 제6 절연층(111, 112, 113, 114, 115, 116)을 포함 할 수 있다. 제1 및 제2 절연층(111, 112)은, 코어층(Core layer)으로서 기능할 수 있다. 제1 및 제2 절연층(111, 112)은 구체적인 재료에 따라 전자부품 내장기판(100A)의 강성을 보다 개선시킬 수 있다. 제1 절연층은 이를 관통 하는 제1 캐비티(C1)를 가지며, 제2 절연층은 이를 관통하는 제2 캐비티(C2)를 가진다. 제1 및 제2 캐비티 (C1, C2)는 네 측부가 모두 막힌 닫힌 공간일 수 있으나, 필요에 따라서는 일부 영역에서 불연속적인 부분, 예 컨대 외부로 열린 부분이 존재할 수도 있다. 필요에 따라서는, 제1 및 제2 캐비티(C1, C2) 각각이 다수 개로 존재할 수도 있으며, 각각에 서로 동일하거나 상이한 제1 및 제2 전자부품(210, 220)이 배치될 수도 있다. 제1 및 제2 절연층(111, 112)의 두께는 나머지 다른 복수의 절연층(113, 114, 115, 116) 각각의 두께보다 두꺼울 수 있다. 제1 및 제2 절연층(111, 112)의 재료로는 절연물질이 사용될 수 있으며, 절연물질로는 에폭시 수지와 같 은 열경화성 수지나 폴리이미드와 같은 열가소성 수지를 이용할 수 있다. 또한, 이들 수지에 실리카 등의 무기 필러와 유리섬유 등의 보강재가 포함된 것을 이용할 수도 있다. 예를 들면, 프리프레그(prepreg)가 이용될 수 있으나, 이에 한정되는 것은 아니다. 제1 및 제2 전자부품(210, 220)은 각각 제1 및 제2 캐비티(C1, C2) 내에 배치될 수 있다. 제1 및 제2 전자부품 (210, 220)은 소자 수백 내지 수백만 개 이상이 하나의 칩 안에 집적화된 집적회로(IC: Integrated Circuit) 다이일 수 있다. 예를 들면, 제1 및 제2 전자부품(210, 220)은 센트랄 프로세서(예컨대, CPU), 그래픽 프로세 서(예컨대, GPU), 필드 프로그램어블 게이트 어레이(FPGA), 디지털 신호 프로세서, 암호화 프로세서, 마이크로 프로세서, 마이크로 컨트롤러 등의 프로세서칩, 구체적으로는 어플리케이션 프로세서(AP: Application Processor)일 수 있으나, 이에 한정되는 것은 아니며, 그 외에도 기타 휘발성 메모리(예컨대, DRAM), 비-휘발성 메모리(예컨대, ROM), 플래시 메모리 등의 메모리나, 아날로그-디지털 컨버터, 또는 ASIC(application-specific IC) 등의 로직 등일 수도 있다. 필요에 따라서는, 제1 및 제2 전자부품(210, 220)은 칩 형태의 수동부품, 예를 들면, 칩 형태의 인덕터나 칩 형태의 커패시터 등일 수도 있다. 제1 및 제2 전자부품(210, 220)은 각각 접속패 드(210P, 220P)를 구비할 수 있다. 제1 및 제2 전자부품(210, 220)의 접속패드(210P, 220P)는 구리(Cu), 알루 미늄(Al) 등의 금속물질을 포함할 수 있으며, 후술할 연결부재(P) 및 제1 및 제2 비아층(131, 132)과 연결될 수 있다. 제1 및 제2 전자부품(210, 220)은 별도의 접착필름 없이 제1 및 제2 캐비티(C1, C2) 내에 배치될 수 있으며, 후술할 제3 및 제4 절연층(113, 114)에 의해 덮일 수 있다. 한편, 본 발명에서 제1 및 제2 전자부품(210, 220)은, 기판의 적층 방향 또는 두께 방향에서 바라볼 때 서로 중 첩되는 위치에 배치될 수 있다. 본 발명의 경우 제1 및 제2 절연층(111, 112)의 제1 및 제2 캐비티(C1, C2)가 서로 적층 방향에서 중첩되는 위치에 형성되므로, 내부에 배치되는 제1 및 제2 전자부품(210, 220) 역시 적층 방향에서 적어도 일부가 서로 중첩될 수 있다. 적층 방향 또는 두께 방향에서 제1 및 제2 전자부품(210, 220)의 적어도 일부가 서로 중첩되도록 배치됨으로써, 제1 및 제2 전자부품(210, 220) 간의 거리를 짧게 유지할 수 있 고, 그에 따라 신호 전송 거리가 단축되어 신호 불량을 방지하고 신호 전송 속도를 증가시킬 수 있다. 도 3에 도시된 바와 같이, 제1 및 제2 전자부품(210, 220)은 두께 방향에서 중첩되도록 배치되는 복층 구조를 가질 수 있다. 이를 통해 전자부품 내장기판(100A)의 수동부품 개수 대비 사이즈를 효과적으로 감소시킬 수 있 다. 또한, 제1 및 제2 전자부품(210, 220) 간 최단 거리로 전기적인 연결이 가능하므로, 신호 전달 거리를 감소 시킬 수 있다. 즉, 연결부재(P)의 일단은 제1 전자부품과 접촉하고, 연결부재(P)의 타단은 제2 전자부품 과 접촉할 수 있다. 한편, 도 3에 도시된 바와 같이, 제1 및 제2 전자부품(210, 220)은 제1 접착층(T1)의 일면과 타면 상에 배치될 수 있다. 즉, 제1 접착층(T1)은 제1 전자부품과 접할 수 있고, 제1 접착층(T1)의 타면은 제2 전자부품 과 접할 수 있다. 예를 들면, 제1 전자부품의 접속패드(210P) 중 연결부재(P)의 일단과 접하는 영역 을 제외한 나머지 영역의 일부는 제1 접착층(T1)의 일면과 접할 수 있고, 제2 전자부품의 접속패드(220P) 중 연결부재(P)의 타단과 접하는 영역을 제외한 나머지 영역의 일부는 제1 접착층(T1)의 타면과 접할 수 있다. 제1 접착층(T1)은, 제1 및 제2 절연층(111, 112) 의 사잉에 배치되어, 제1 및 제2 절연층(111, 112) 간의 밀착 력을 증가시킨다. 제1 접착층(T1)은, 통상의 접착제로 쓰이는 물질이라면 제한 없이 포함할 수 있다. 예를 들면, 제1 접착층(T1)은 본딩 시트(Bonding Sheet), 에폭시계 열경화성 수지 또는 프리프레그(prepreg)와 같은 열경화성 수지를 포함할 수 있다. 즉, 제1 접착층(T1)은, 제1 및 제2 절연층(111, 112)과 상이한 이종의 절연재 로 구성될 수 있으며, 제1 및 제2 절연층(111, 112)보다 밀착력이 높은 재질을 포함할 수 있다. 한편, 제1 접착 층(T1)은 제1 및 제2 절연층(111, 112)보다 두께가 얇을 수 있다. 제1 접착층(T1)에는, 관통부(Ph)가 형성되어 있을 수 있다. 관통부(Ph)는 두께 방향에서 바라볼 때 추후 제1 및 제2 전자부품(210, 220)의 전극과 대응되는 위치에 형성될 수 있다. 한편, 관통부(Ph)에는, 페이스트(Paste) 또 는 공지의 도금법에 의하여 연결부재(P)가 배치될 수 있다. 예를 들면, 연결부재(P)는 도전성 페이스트를 포함 할 수 있고, 도금으로 인한 금속층을 포함할 수도 있다. 연결부재(P)는, 일면과 타면의 단면적이 실질적으로 동 일할 수 있으나, 이에 제한되는 것은 아니다. 연결부재(P)의 재료로는 금속물질이 사용될 수 있으며, 금속물질로는 구리(Cu), 알루미늄(Al), 은(Ag), 주석 (Sn), 금(Au), 니켈(Ni), 납(Pb), 티타늄(Ti), 또는 이들의 합금 등을 이용할 수 있다. 또한, 연결부재(P)의 재 료로는 수지 내에 도전성 필러가 포함된 도전성 페이스트가 사용될 수도 있다. 연결부재(P)의 일단은 제1 전자부품과 연결되고, 연결부재(P)의 타단은 제2 전자부품과 연결될 수 있 다. 즉, 연결부재(P)는 제1 및 제2 전자부품(210, 220)을 전기적으로 연결할 수 있으며, 구체적으로, 연결부재 (P)의 일단은 제1 전자부품의 접속패드(210P)와 접촉하며 연결되고, 연결부재(P)의 타단은 제2 전자부품 의 접속패드(220P)와 접촉하며 연결될 수 있다. 제3 절연층은 제1 절연층의 일면 상에 배치되어, 제1 캐비티(C1)의 적어도 일부를 채우고, 제1 전자 부품의 적어도 일부를 덮을 수 있다. 또한, 제4 절연층은 제2 절연층의 일면 상에 배치되어, 제 2 캐비티(C2)의 적어도 일부를 채우고, 제2 전자부품의 적어도 일부를 덮을 수 있다. 예를 들면, 제3 절연 층은 제1 전자부품의 상면과 하면과 측면 각각의 적어도 일부와 물리적으로 접할 수 있다. 또한, 제4 절연층은 제2 전자부품의 상면과 하면과 측면 각각의 적어도 일부와 물리적으로 접할 수 있다. 제5 절연층은 제3 절연층의 일면 상에 배치되고, 제6 절연층은 제4 절연층의 일면 상에 배치될 수 있다. 한편, 도 3을 참조하면, 제1 내지 제6 절연층(111, 112, 113, 114, 115, 116)만이 도시되나, 절연층 은 필요에 따라 도시된 것보다 더 많을 수도, 더 적을 수도 있다.제3 내지 제5 절연층(113, 114, 115, 116)의 재료로는 절연물질이 사용될 수 있으며, 절연물질로는 에폭시 수지 와 같은 열경화성 수지나 폴리이미드와 같은 열가소성 수지를 이용할 수 있다. 또한, 이들 수지에 실리카 등의 무기필러가 포함된 것을 이용할 수도 있다. 예를 들면, 제3 내지 제5 절연층(113, 114, 115, 116)의 재료로는 프리프레그가 이용될 수 있으나, 이에 한정되는 것은 아니며, 유리섬유 등의 보강재는 포함하지 않는 재료, 예 를 들면, ABF(Ajinomoto Build-up Film)가 이용될 수 있다. ABF는 RCC(Resin Coated Copper) 형태로 제공될 수 있으나, 이에 한정되는 것은 아니다. 필요에 따라서는, PIE(Photo Image-able Dielectric) 등의 감광성 재 료가 이용될 수도 있다. 일례로서, 제3 내지 제5 절연층(113, 114, 115, 116)은 제1 접착층(T1)과 상이한 재료를 포함할 수 있다. 복수의 배선층(121, 122, 123, 124)은, 제3 절연층의 일면 상에 배치된 제1 배선층, 제4 절연층 의 일면 상에 배치된 제2 배선층, 제5 절연층의 일면 상에 배치된 제3 배선층, 제6 절연층 의 일면 상에 배치된 제4 배선층을 포함할 수 있다. 예를 들면, 제1 배선층은 제3 절연층 의 상면 상에 배치되고, 제2 배선층은 제4 절연층의 하면 상에 배치될 수 있다. 한편, 도 3을 참조하 면, 제1 내지 제4 배선층(121, 122, 123, 124)만이 도시되나, 배선층은 필요에 따라 도시된 것보다 더 많을 수 도, 더 적을 수도 있다. 제1 및 제2 배선층(121, 122)의 재료로는 금속물질이 사용될 수 있으며, 금속물질로는 구리(Cu), 알루미늄(Al), 은(Ag), 주석(Sn), 금(Au), 니켈(Ni), 납(Pb), 티타늄(Ti), 또는 이들의 합금 등을 이용할 수 있다. 제1 및 제 2 배선층(121, 122)은 설계 디자인에 따라 다양한 기능을 수행할 수 있다. 예를 들면, 그라운드 패턴, 파워 패 턴, 신호 패턴 등을 포함할 수 있다. 이들 패턴은 각각 라인(line), 플레인(plane), 또는 패드(pad) 형태를 가 질 수 있다. 제1 및 제2 배선층(121, 122)은 각각 AP(Additive Process), SAP(Semi AP), MSAP(Modified SAP), TT(Tenting) 등의 도금 공정으로 형성될 수 있으며, 그 결과 각각 무전해 도금층인 시드층과 이러한 시드층을 기초로 형성되는 전해 도금층을 포함할 수 있다. 제3 및 제4 절연층(113, 114)이 RCC 형태로 제공되는 경우, 제 1 및 제2 배선층(121, 122)은 동박 등의 금속박을 더 포함할 수 있으며, 필요에 따라서 금속박의 표면에는 프라 이머 수지가 존재할 수도 있다. 복수의 비아층(131, 132, 133, 134)은 제3 절연층을 관통하며 제1 배선층과 제1 전자부품을 연 결하는 제1 비아층, 제4 절연층을 관통하며 제2 배선층과 제2 전자부품을 연결하는 제2 비 아층, 제5 절연층을 관통하며 제3 배선층과 제1 배선층을 연결하는 제3 비아층 및 제 6 절연층을 관통하며 제4 배선층과 제2 배선층을 연결하는 제4 비아층을 포함할 수 있다. 복수의 비아층(131, 132, 133, 134)의 재료로는 금속물질이 사용될 수 있으며, 금속물질로는 구리(Cu), 알루미 늄(Al), 은(Ag), 주석(Sn), 금(Au), 니켈(Ni), 납(Pb), 티타늄(Ti), 또는 이들의 합금 등을 이용할 수 있다. 복수의 비아층(131, 132, 133, 134)은 설계 디자인에 따라서 신호용 비아, 그라운드용 비아, 파워용 비아 등을 포함할 수 있다. 복수의 비아층(131, 132, 133, 134)의 비아는 각각 비아홀이 금속물질로 완전히 충전된 것일 수 있고, 또는 금속물질이 비아홀의 벽면을 따라 형성된 것일 수도 있다. 복수의 비아층(131, 132, 133, 134)도 도금 공정, 예를 들면, AP, SAP, MSAP, TT 등의 공정으로 형성될 수 있으며, 무전해 도금층인 시드층과 이러한 시드층을 기초로 형성되는 전해 도금층을 포함할 수 있다. 제1 내지 제4 비아층(131, 132, 133, 134) 각각의 비아는 일면의 단면적이 타면의 단면적보다 큰 테이퍼 형상을 가질 수 있다. 또한, 제1 및 제3 비아층(131, 133)은 동일한 방향으로 테이퍼진 형상을 가질 수 있고, 제2 및 제4 비아층(132, 134)은 제1 및 제3 비아층(131, 133)과는 반대 방향으로 테이퍼진 형상을 가질 수 있다. 예를 들면, 제1 및 제2 비아층(131, 132)은 서로 반대 방향으로 테이퍼진 형상을 가질 수 있고, 제3 및 제4 비아층 (133, 134) 역시 서로 반대 방향으로 테이퍼진 형상을 가질 수 있다. 한편, 도 3을 참조하면 제1 내지 제4 비아층(131, 132, 133, 134)이 도시되나, 절연층의 개수에 따라 비아층의 수는 더 많을 수도, 더 적을 수도 있다. 한편, 상술한 연결부재(P)와 복수의 비아층(131, 132, 133, 134)은 형상을 달리할 수 있다. 도 3의 단면도를 참 조하면, 단면 상에서 적층 방향 대비 복수의 비아층(131, 132, 133, 134)의 측벽의 경사도는 단면 상에서 적층방향 대비 연결부재(P)의 측벽의 경사도보다 클 수 있다. 이 경우, 복수의 비아층(131, 132, 133, 134)은 일면 의 폭이 타면의 폭보다 큰 테이퍼 형상을 가지고, 연결부재(P)는 일면의 폭과 타면의 폭이 실질적으로 동일한 형상을 가질 수 있다. 본 개시에서 실질적으로 동일하다는 의미는, 공정 상에서 발생하는 오차를 포함하는 것으 로 해석될 수 있다. 제1 및 제2 패시베이션층(141, 142)은 내부 구성요소를 외부의 물리적 화학적 손상 등으로부터 보호할 수 있다. 제1 및 제2 패시베이션층(141, 142)은 각각 복수의 제1 및 제2 개구를 가질 수 있다. 복수의 제1 개구는 각각 제3 배선층의 적어도 일부를 노출시킬 수 있다. 복수의 제2 개구는 각각 제4 배선층의 적어도 일부를 노출시킬 수 있다. 한편, 배선층이 더 많거나 더 적은 층을 가질 경우, 제1 및 제2 개구는 각각 전자부품 내장 기판(100A)의 마주보는 최외층에 배치된 배선층의 적어도 일부를 노출시킬 수 있다. 제1 및 제2 패시베이션층 (141, 142)의 재료는 절연물질이 사용될 수 있는데, 이때 절연물질로는 에폭시 수지와 같은 열경화성 수지, 폴 리이미드와 같은 열가소성 수지, 또는 이들 수지가 무기필러와 혼합된 재료, 예를 들면, ABF가 사용될 수 있으 나, 이에 한정되는 것은 아니다. 도 4 내지 도 12는 도 3의 전자부품 내장기판의 제조 일례를 개략적으로 나타낸 공정 단면도들이다. 도 4를 참조하면, 먼저 제1 접착층(T1)을 준비하고, 레이저 또는 기계적 드릴링 공정 등을 통해 제1 접착층(T 1)의 적어도 일부를 관통하는 관통부(Ph)를 형성할 수 있다. 도 5를 참조하면, 제1 접착층(T1)의 관통부(Ph) 내에 도금 또는 페이스트 공정을 통해 연결부재(P)가 배치될 수 있다. 도 6을 참조하면, 제1 캐리어 상에 제1 절연층이 배치되고, 제1 절연층에 레이저 또는 기계적 드릴링 공정을 통하여 제1 캐비티(C1)를 형성한 다음, 제1 캐비티(C1) 내에 제1 전자부품을 배치할 수 있 다. 도 7을 참조하면, 제2 캐리어 상에 제2 절연층이 배치되고, 제2 절연층에 형성된 제2 캐비티 (C2) 내에 제2 전자부품이 배치될 수 있다. 이후, 제1 절연층, 제1 접착층(T1), 제2 절연층의 순으로 배치한 다음 일괄 적층 공정을 수행할 수 있다. 결과적으로, 제1 및 제2 절연층(111, 112)을 제1 접착층 (T1)을 이용하여 접합시킬 수 있다. 도 8을 참조하면, 제1 및 제2 캐리어(710, 720)가 박리될 수 있고, 도 9를 참조하면, 제1 및 제2 캐리어(710, 720)가 박리된 자리에 제3 및 제4 절연층(113, 114)이 배치될 수 있다. 제3 절연층은 제1 캐비티(C1)의 적 어도 일부를 채우며 제1 전자부품의 적어도 일부를 덮을 수 있고, 제4 절연층은 제2 캐비티(C2)의 적 어도 일부를 채우며 제2 전자부품의 적어도 일부를 덮을 수 있다. 필요한 경우, 적층 과정에서 제3 및 제4 절연층(113, 114)의 유동성을 높이기 위하여 추가로 가열 공정을 수행 할 수 있다. 적층 후에는, 미경화 또는 반경화 상태의 재료들을 가열 등으로 경화시킬 수 있다. 도 10을 참조하면, 레이저 가공으로 적층체의 제3 및 제4 절연층(113, 114)에 제1 및 제2 비아홀(131h, 132h)을 형성할 수 있다. 이후, 도 11에 개시된 바와 같이, 제1 및 제2 비아홀(131h, 132h)을 도금 공정에 의해 도금하 여, 제1 및 제2 비아층(131, 132)이 배치될 수 있고, 도금 후 패터닝 공정을 통해 제1 및 제2 배선층(121, 12 2)이 배치될 수 있다.도 12를 참조하면, 제5 및 제6 절연층(115, 116)이 추가로 적층되고, 레이저 가공, 도금 및 패터닝 공정을 통해 제3 및 제4 배선층(123, 124)과 제3 및 제4 비아층(133, 134)이 배치될 수 있다. 이후 필요에 따라 제1 및 제2 패시베이션층(141, 142) 등을 더 형성한다. 일련의 과정을 통하여 상술한 일례에 따른 전자부품 내장기판(100 A)이 제조될 수 있으며, 그 외에 중복되는 내용은 생략한다. 도 13은 전자부품 내장기판의 다른 일례를 개략적으로 나타낸 단면도다. 도면을 참조하면, 다른 일례에 따른 전자부품 내장기판(100B)은, 상술한 일례에 따른 전자부품 내장기판(100A) 과 비교하여, 제1 및 제2 절연층(111, 112) 상에 제2 및 제3 접착층(T2, T3)이 추가적으로 배치된다. 이를 통해, 제1 및 제2 캐비티(C1, C2)의 미 충전 불량을 효과적으로 방지할 수 있다. 구체적으로, 다른 일례에 따른 전자부품 내장기판(100B)은 제1 및 제2 캐비티(C1, C2)를 갖는 제1 및 제2 절연 층(111, 112), 제1 및 제2 절연층(111, 112) 사이에 배치된 제1 접착층(T1), 제1 및 제2 캐비티(C1, C2) 내에 배치된 제1 및 제2 전자부품(210, 22), 제1 절연층 상에 배치된 제2 접착층(T2), 제2 절연층 상에 배 치된 제3 접착층(T3), 제2 접착층(T2) 상에 배치된 제3 절연층, 제3 접착층(T3) 상에 배치된 제4 절연층 , 제2 접착층(T2) 및 제3 절연층 각각의 적어도 일부를 관통하는 제1 비아층 및 제3 접착층(T3) 및 제4 절연층 각각의 적어도 일부를 관통하는 제2 비아층을 포함한다. 예를 들면, 다른 일례에 따른 전자부품 내장기판(100B)은, 후술하는 공정에서와 같이, 제1 및 제2 전자부품 (210, 220)이 배치된 다음, 제2 및 제3 접착층(T2, T3)이 제1 및 제2 절연층(111, 112) 상에 각각 배치됨으로 써 제조될 수 있다. 이를 통해, 제1 및 제2 캐비티(C1, C2) 각각의 적어도 일부에 제2 및 제3 접착층(T2, T3)이 각각 배치될 수 있다. 절연재인 제2 및 제3 접착층(T2, T3)은, 상술한 제1 접착층(T1)과 동일한 재료를 포함할 수 있고, 제1 및 제2 캐비티(C1, C2)가 완벽히 충전되지 않는 불량을 방지할 수 있고, 제1 및 제2 전자부품 (210, 220)을 효과적으로 보호할 수 있다. 제1 및 제2 전자부품(210, 220)이 배치된 다음, 절연재인 제2 및 제3 접착층(T2, T3)이 제1 및 제2 절연층(111, 112) 상에 각각 배치됨에 따라, 제1 및 제2 배선층(121, 122)을 제1 및 제2 전자부품(210, 220)과 연결하는 제1 및 제2 비아층(131, 132) 또한 접착층(T2, T3)을 관통할 수 있다. 예를 들면, 제1 비아층은 제2 접착층 (T2)의 적어도 일부를 관통하고, 제2 비아층은 제3 접착층(T3)의 적어도 일부를 관통할 수 있다. 본딩 시트를 포함할 수 있는 제2 및 제3 접착층(T2, T3)은 그 재료적 특성으로 인하여 제1 및 제2 캐비티(C1, C2)를 보다 효과적으로 충진시킬 수 있다. 제2 및 제3 접착층(T2, T3)이 본딩 시트를 포함하는 경우, ABF에 비 하여 녹는 점이 높은 본딩 시트의 특성 상, ABF층을 합지하는 경우보다 높은 온도 및 높은 압력의 환경에서 제2 및 제3 접착층(T2, T3)이 제1 및 제2 절연층(111, 112) 상에 합지될 수 있다. 따라서, 고온/고압의 환경에서 배 치되는 제2 및 제3 접착층(T2, T3)은, 제1 및 제2 캐비티(C1, C2)를 보다 완벽하게 충전시킬 수 있고, 사전에 미 충전 불량을 효과적으로 방지할 수 있다. 그 외에 다른 내용은 상술한 바와 실질적으로 동일한바, 중복되는 내용은 생략한다. 도 14 내지 도 17은 도 13의 전자부품 내장기판의 제조 일례를 개략적으로 나타낸 공정 단면도들이다. 도 14를 참조하면, 일례에 따른 전자부품 내장기판(100A)에서의 도 4 내지 도 8의 제조 공정이 동일하게 적용될 수 있다. 이후, 도 14에 개시된 바와 같이, 제2 및 제3 접착층(T2, T3)이 제1 및 제2 절연층(111, 112) 상에 각각 배치되어, 제1 및 제2 캐비티(C1, C2) 각각의 적어도 일부를 채울 수 있다. 도 15를 참조하면, 제2 접착층(T2) 상에 제3 절연층이 배치되고, 제3 접착층(T3) 상에 제4 절연층이 배치될 수 있다. 도 16을 참조하면, 레이저 또는 기계적 드릴링 공정을 이용하여, 제1 및 제2 비아홀(131h, 132h)이 형성될 수 있다. 구체적으로, 제1 비아홀(131h)은 제3 절연층 및 제2 접착층(T2) 각각의 적어도 일부를 관통하며, 제 1 전자부품의 접속패드(210P)의 적어도 일부를 노출시킬 수 있다. 또한, 제2 비아홀(132h)은 제4 절연층 및 제3 접착층(T3) 각각의 적어도 일부를 관통하며, 제2 전자부품의 접속패드(220P)의 적어도 일부를 노출시킬 수 있다. 도 17을 참조하면, 도금 및 패터닝 공정을 통해 제1 및 제2 배선층(121, 122)이 제3 및 제4 절연층(113, 114) 각각의 일면 상에 배치될 수 있다. 또한 제1 및 제2 비아층(131, 132)이 형성될 수 있다. 이후 추가적인 빌드업 공정을 통해 도 13의 다른 일례에 따른 전자부품 내장기판(100B)이 완성될 수 있다. 본 개시에서 측부, 측면 등의 표현은 편의상 도면을 기준으로 좌/우 방향 또는 그 방향에서의 면을 의미하는 것으로 사용하였고, 상측, 상부, 상면 등의 표현은 편의상 도면을 기준으로 위 방향 또는 그 방향에서의 면을 의 미하는 것으로 사용하였으며, 하측, 하부, 하면 등은 편의상 아래 방향 또는 그 방향에서의 면을 의미하는 것으 로 사용하였다. 더불어, 측부, 상측, 상부, 하측, 또는 하부에 위치한다는 것은 대상 구성요소가 기준이 되는 구성요소와 해당 방향으로 직접 접촉하는 것뿐만 아니라, 해당 방향으로 위치하되 직접 접촉하지는 않는 경우도 포함하는 개념으로 사용하였다. 다만, 이는 설명의 편의상 방향을 정의한 것으로, 특허청구범위의 권리범위가 이러한 방향에 대한 기재에 의하여 특별히 한정되는 것이 아니며, 상/하의 개념 등은 언제든지 바뀔 수 있다. 본 개시에서 연결된다는 의미는 직접 연결된 것뿐만 아니라, 접착제 층 등을 통하여 간접적으로 연결된 것을 포 함하는 개념이다. 또한, 전기적으로 연결된다는 의미는 물리적으로 연결된 경우와 연결되지 않은 경우를 모두 포함하는 개념이다. 또한, 제1, 제2 등의 표현은 한 구성요소와 다른 구성요소를 구분 짓기 위해 사용되는 것으로, 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 경우에 따라서는 권리범위를 벗어나지 않 으면서, 제1 구성요소는 제2 구성요소로 명명될 수도 있고, 유사하게 제2 구성요소는 제1 구성요소로 명명될 수 도 있다. 본 개시에서 사용된 일례 라는 표현은 서로 동일한 실시 예를 의미하지 않으며, 각각 서로 다른 고유한 특징을 강조하여 설명하기 위해서 제공된 것이다. 그러나, 상기 제시된 일례들은 다른 일례의 특징과 결합되어 구현되 는 것을 배제하지 않는다. 예를 들어, 특정한 일례에서 설명된 사항이 다른 일례에서 설명되어 있지 않더라도, 다른 일례에서 그 사항과 반대되거나 모순되는 설명이 없는 한, 다른 일례에 관련된 설명으로 이해될 수 있다. 본 개시에서 사용된 용어는 단지 일례를 설명하기 위해 사용된 것으로, 본 개시를 한정하려는 의도가 아니다. 이때, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다."}
{"patent_id": "10-2021-0131109", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 전자기기 시스템의 예를 개략적으로 나타내는 블록도다. 도 2는 전자기기의 일례를 개략적으로 나타낸 사시도다. 도 3은 전자부품 내장기판의 일례를 개략적으로 나타낸 단면도다. 도 4는 내지 도 12는 도 3의 전자부품 내장기판의 제조 일례를 개략적으로 나타낸 공정 단면도들이다. 도 13은 전자부품 내장기판의 다른 일례를 개략적으로 나타낸 단면도다. 도 14 내지 도 17은 도 13의 전자부품 내장기판의 제조 일례를 개략적으로 나타낸 공정 단면도들이다."}
