{"patent_id": "10-2019-0172810", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0080822", "출원번호": "10-2019-0172810", "발명의 명칭": "웨어러블 기기 및 무선 이동체에 적용 가능한 작업 위험성 판단 모듈 및 시스템", "출원인": "임재근", "발명자": "임재근"}}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "작업 대상 구역의 작업 위험성을 판단하는 모듈로서,상기 작업 대상 구역의 작업 환경 정보를 수집하는 작업 환경 센서부,상기 작업 대상 구역의 이미지를 촬영하는 영상촬영부,상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 제어부,작업 위험성 판단 결과를 사용자 단말에게 송신하는 통신부, 그리고상기 작업 환경 정보, 상기 작업 대상 구역의 이미지, 및 상기 작업 위험성 판단 결과를 화면을 통해 출력하는디스플레이부를 포함하는 작업 위험성 판단 모듈."}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,작업자의 신체 정보를 수집하는 작업자 센서부를 더 포함하고,상기 제어부는,상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과, 상기 인공지능을 이용하여 상기 이미지를 분석한 결과, 및 상기 작업자의 신체 정보와 미리 설정된 기준값을 비교한 결과에 기반하여 상기 작업 위험성을판단하는, 작업 위험성 판단 모듈."}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에서,상기 작업 환경 센서부는 측정 대상이 서로 다른 복수의 센서를 포함하고,상기 제어부는,상기 사용자 단말로부터 수신한 센서 선택 정보에 기반하여 상기 복수의 센서 중 상기 선택 정보에 대응하는 센서를 동작시키는, 작업 위험성 판단 모듈."}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에서,상기 작업 환경 센서부는,가스 센서, 온도 센서, 습도 센서, 미세먼지 센서 중 적어도 하나를 포함하고,상기 작업 환경 정보는,산소 농도, 탄산가스 농도, 황화수소 농도, 수소 농도, 메탄 농도, 에탄올 농도, VOC 농도, LNG/LPG 농도,온도, 습도, 및 미세먼지 농도 중 적어도 하나를 포함하는, 작업 위험성 판단 모듈."}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에서,상기 신체 정보는,공개특허 10-2021-0080822-3-상기 작업자의 체온, 맥박, 혈압 정보 중 적어도 하나를 포함하는, 작업 위험성 판단 모듈."}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에서,진동, 열, 및 태양광 에너지 중 적어도 하나의 에너지를 전기 에너지로 변환하여 배터리를 충전하는 배터리부를더 포함하는, 작업 위험성 판단 모듈."}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에서,사용자로부터 음성 메시지를 획득하고, 인공지능을 이용하여 상기 음성 메시지를 분석한 결과에 기반하여 사전인증된 사용자인지 판단하는 음성 인식부를 더 포함하고,상기 제어부는,상기 음성 인식부를 통해 상기 사용자가 사전 인증된 사용자로 판단된 경우, 상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미지를 분석한 결과에 기반하여 상기 작업 위험성을판단하는, 작업 위험성 판단 모듈."}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "작업 대상 구역의 작업 위험성을 판단하는 장치로서,센싱된 상기 작업 대상 구역의 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 작업 대상 구역의 촬영된 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 작업 위험성 판단모듈,상기 작업 위험성 판단 모듈의 양 측에 결합된 연결부, 그리고상기 연결부의 일면에 배치되며, 복수의 LED를 포함하며, 작업 위험성 정도에 따라 상기 복수의 LED를 점멸시키는 상태 표시부를 포함하고,상기 작업 위험성 판단 모듈은,상기 작업 환경 정보를 센싱하는 작업 환경 센서부, 상기 이미지를 촬영하는 영상촬영부,상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 제어부,작업 위험성 판단 결과를 사용자 단말에게 송신하는 통신부, 그리고상기 작업 환경 정보, 상기 이미지, 및 상기 작업 위험성 판단 결과를 화면을 통해 출력하는 디스플레이부를 포함하는, 작업 위험성 판단 장치."}
{"patent_id": "10-2019-0172810", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "작업 대상 구역의 작업 위험성을 판단하는 시스템으로서,작업자의 신체 정보를 수집하는 작업자 정보 수집 장치,센싱된 상기 작업 대상 구역의 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 작업 대상 구역의 촬영된 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 작업 위험성 판단모듈, 및 작업 위험성 정도에 따라 복수의 LED를 점멸시키는 상태 표시부를 포함하고, 상기 작업 대상 구역을실시간 촬영하는 무선 이동체,블록체인 네트워크를 이용하여 상기 작업자의 신체 정보를 블록체인 방식으로 저장하는 블록체인 서버, 그리고공개특허 10-2021-0080822-4-상기 무선 이동체로부터 작업 위험성 판단 결과를 수신하는 사용자 단말을 포함하고,상기 작업 위험성 판단 모듈은,상기 작업 환경 정보를 센싱하는 작업 환경 센서부, 상기 이미지를 촬영하는 영상촬영부,상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 제어부,상기 작업 위험성 판단 결과를 상기 사용자 단말에게 송신하는 통신부, 그리고상기 작업 환경 정보, 상기 이미지, 및 상기 작업 위험성 판단 결과를 화면을 통해 출력하는 디스플레이부를 포함하는, 작업 위험성 판단 시스템."}
{"patent_id": "10-2019-0172810", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "작업 대상 구역의 작업 위험성을 판단하는 모듈로서, 상기 작업 대상 구역의 작업 환경 정보를 수집하는 작업 환 경 센서부, 상기 작업 대상 구역의 이미지를 촬영하는 영상촬영부, 상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 제어 부, 작업 위험성 판단 결과를 사용자 단말에게 송신하는 통신부, 그리고 상기 작업 환경 정보, 상기 작업 대상 구역의 이미지, 및 상기 작업 위험성 판단 결과를 화면을 통해 출력하는 디스플레이부를 포함하는 작업 위험성 판단 모듈이 제공된다."}
{"patent_id": "10-2019-0172810", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 작업 위험성 판단 모듈 및 시스템에 관한 것으로, 특히 인공지능 기술 및 에너지 하베스팅 기술을 이 용한 작업 위험성 판단 모듈 및 시스템에 관한 것이다."}
{"patent_id": "10-2019-0172810", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 맨홀, 공장, 화학물질 취급 기관, 화학물질 취급 차량 등 밀폐공간 내 작업으로 인한 사고가 빈번하게 발 생하고 있다. 맨홀, 공장 등과 같은 밀폐공간에서 작업시 질식, 호흡 곤란 등의 사고 위험이 있으므로, 사전 안전 확인은 필 수이다. 종래에는 작업 구역에 대한 위험성을 사전에 측정할 수 있는 장치가 별도로 존재하지 않았다. 또한, 작업자가 별도의 측정장치를 이용하여 밀폐공간에 진입하더라도, 진입한 이후 유독가스 발생 또는 유출 등의 위험성을 판 단하거나 외부에 알리는 장치가 존재하지 않았다. 이에 따라, 밀폐공간 등의 작업 위험 구역 내 진입 전후의 위험성을 판단하고, 작업자 및 주변 관리자에게 실시 간 정보를 전달할 수 있는 기술이 요구된다."}
{"patent_id": "10-2019-0172810", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는 유해가스가 발생될 수 있는 밀폐공간 등의 작업 위험 구역 내 진입 전 후의 위험성을 판단하고, 작업자 및 주변 관리자에게 실시간 정보를 전달할 수 있는 작업 위험성 판단 모듈 및 시스템을 제공하는 것이다."}
{"patent_id": "10-2019-0172810", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한 실시예에 따르면, 작업 대상 구역의 작업 위험성을 판단하는 모듈이 제공된다. 상기 작업 위험성 판단 모듈 은 상기 작업 대상 구역의 작업 환경 정보를 수집하는 작업 환경 센서부, 상기 작업 대상 구역의 이미지를 촬영 하는 영상촬영부, 상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미 지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 제어부, 작업 위험성 판단 결과를 사용자 단말에게 송신하는 통신부, 그리고 상기 작업 환경 정보, 상기 작업 대상 구역의 이미지, 및 상기 작업 위험성 판단 결과 를 화면을 통해 출력하는 디스플레이부를 포함한다. 상기 작업 위험성 판단 모듈은 작업자의 신체 정보를 수집하는 작업자 센서부를 더 포함할 수 있고, 상기 제어 부는, 상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과, 상기 인공지능을 이용하여 상기 이미지를 분석한 결과, 및 상기 작업자의 신체 정보와 미리 설정된 기준값을 비교한 결과에 기반하여 상기 작업 위험성을 판단할 수 있다. 상기 작업 환경 센서부는 측정 대상이 서로 다른 복수의 센서를 포함하고, 상기 제어부는, 상기 사용자 단말로 부터 수신한 센서 선택 정보에 기반하여 상기 복수의 센서 중 상기 선택 정보에 대응하는 센서를 동작시킬 수 있다. 상기 작업 환경 센서부는, 가스 센서, 온도 센서, 습도 센서, 미세먼지 센서 중 적어도 하나를 포함하고, 상기 작업 환경 정보는, 산소 농도, 탄산가스 농도, 황화수소 농도, 수소 농도, 메탄 농도, 에탄올 농도, VOC 농도, LNG/LPG 농도, 온도, 습도, 및 미세먼지 농도 중 적어도 하나를 포함할 수 있다. 상기 신체 정보는, 상기 작업자의 체온, 맥박, 혈압 정보 중 적어도 하나를 포함할 수 있다. 진동, 열, 및 태양광 에너지 중 적어도 하나의 에너지를 전기 에너지로 변환하여 배터리를 충전하는 배터리부를 더 포함할 수 있다. 상기 작업 위험성 판단 모듈은 사용자로부터 음성 메시지를 획득하고, 인공지능을 이용하여 상기 음성 메시지를 분석한 결과에 기반하여 사전 인증된 사용자인지 판단하는 음성 인식부를 더 포함할 수 있고, 상기 제어부는, 상기 음성 인식부를 통해 상기 사용자가 사전 인증된 사용자로 판단된 경우, 상기 작업 환경 정보와 미리 설정 된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단할 수 있다. 한 실시예에 따르면, 작업 대상 구역의 작업 위험성을 판단하는 장치가 제공된다. 상기 작업 위험성 판단 장치 는 센싱된 상기 작업 대상 구역의 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 작업 대상 구역의 촬영된 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 작업 위험성 판 단 모듈, 상기 작업 위험성 판단 모듈의 양 측에 결합된 연결부, 그리고 상기 연결부의 일면에 배치되며, 복수 의 LED를 포함하며, 작업 위험성 정도에 따라 상기 복수의 LED를 점멸시키는 상태 표시부를 포함하고, 상기 작 업 위험성 판단 모듈은, 상기 작업 환경 정보를 센싱하는 작업 환경 센서부, 상기 이미지를 촬영하는 영상촬영 부, 상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 제어부, 작업 위험성 판단 결과를 사용자 단말에게 송신하는 통 신부, 그리고 상기 작업 환경 정보, 상기 이미지, 및 상기 작업 위험성 판단 결과를 화면을 통해 출력하는 디스 플레이부를 포함한다. 한 실시예에 따르면, 작업 대상 구역의 작업 위험성을 판단하는 시스템이 제공된다. 상기 작업 위험성 판단 시 스템은 작업자의 신체 정보를 수집하는 작업자 정보 수집 장치, 센싱된 상기 작업 대상 구역의 작업 환경 정보 와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 작업 대상 구역의 촬영된 이미지를 분석한 결과에 기반하여 상기 작업 위험성을 판단하는 작업 위험성 판단 모듈, 및 작업 위험성 정도에 따라 복수의 LED 를 점멸시키는 상태 표시부를 포함하고, 상기 작업 대상 구역을 실시간 촬영하는 무선 이동체, 블록체인 네트워 크를 이용하여 상기 작업자의 신체 정보를 블록체인 방식으로 저장하는 블록체인 서버, 그리고 상기 무선 이동 체로부터 작업 위험성 판단 결과를 수신하는 사용자 단말을 포함하고, 상기 작업 위험성 판단 모듈은, 상기 작 업 환경 정보를 센싱하는 작업 환경 센서부, 상기 이미지를 촬영하는 영상촬영부, 상기 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 상기 이미지를 분석한 결과에 기반하여 상기 작업 위험성 을 판단하는 제어부, 상기 작업 위험성 판단 결과를 상기 사용자 단말에게 송신하는 통신부, 그리고 상기 작업 환경 정보, 상기 이미지, 및 상기 작업 위험성 판단 결과를 화면을 통해 출력하는 디스플레이부를 포함한다."}
{"patent_id": "10-2019-0172810", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "밀폐공간 등의 작업 위험 구역 내 진입 전후의 위험성을 판단하고, 작업자 및 주변 관리자에게 실시간 정보를 전달할 수 있다. 작업 구역 내에서 작업하고 있는 작업자 및 작업 구역 외부에 있는 관리자에게 실시간 정보를 전달함으로써, 산 소 부족 또는 유독 가스로 인한 사고 발생을 미연에 방지할 수 있다. 에너지 하베스팅 기술을 이용한 자가 충전 및 발전을 통해 배터리 방전 없이 실시간 모니터링 및 외부 통신이 가능하다. 작업자의 신체 정보를 블록체인 방식으로 저장함으로써, 개인 정보 유출을 원천 차단할 수 있다."}
{"patent_id": "10-2019-0172810", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성 요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 도 1은 한 실시예에 따른 작업 위험성 판단 모듈의 블록도이다. 도 2는 한 실시예에 따른 작업 위험성 판단 장 치를 나타내는 도면이다. 도 3은 한 실시예에 따른 작업 위험성 판단 시스템의 블록도이다. 도 1을 참조하면, 한 실시예에 따른 작업 위험성 판단 모듈은, 작업 환경 센서부, 영상촬영부, 제 어부, 통신부, 디스플레이부, 작업자 센서부, 배터리부, 음성 인식부, 및 메모리부 를 포함한다. 작업 환경 센서부는 작업 대상 구역의 작업 환경 정보를 수집한다. 작업 대상 구역은 한 실시예로서, 맨홀, 상하수도관 등과 같은 밀폐공간일 수 있다. 작업 환경 센서부는 한 실시예로서, 측정 대상이 서로 다른 복수의 센서를 포함할 수 있다. 작업 환경 센서 부는 한 실시예로서, 가스 센서, 온도 센서, 습도 센서, 미세먼지 센서 중 적어도 하나를 포함할 수 있다. 가스 센서는 한 실시예로서, 산소 측정 센서, 탄산가스(이산화탄소) 측정 센서, 황하수소 측정 센서, 일산화탄 소 측정 센서, 메탄 측정 센서, 에탄올 측정 센서, 수소 측정 센서, 암모니아 측정 센서, 휘발성 유기화합물 (Volatile Organic Compound, VOC) 측정 센서 중 적어도 하나를 포함할 수 있다. 작업 환경 정보는 한 실시예로서, 산소 농도, 탄산가스 농도, 황화수소 농도, 수소 농도, 메탄 농도, 에탄올 농 도, VOC 농도, LNG/LPG 농도, 온도, 습도, 및 미세먼지 농도 중 적어도 하나를 포함할 수 있다. 영상촬영부는 작업 대상 구역의 이미지를 촬영한다. 영상촬영부는 한 실시예로서, 4K 이미지를 촬영하 는 카메라 및 적외선 이미지를 촬영하는 카메라를 포함할 수 있다. 제어부는 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 이미지를 분석한 결 과에 기반하여 작업 위험성을 판단한다. 작업 위험성은 한 실시예로서, 유해공기 유무일 수 있다. 한 실시예로서, 제어부는 산소 농도가 18% 미만이거나 23.5%이상인 경우, 탄산가스(이산화탄소) 농도가 1.5%이상인 경우, 황화수소 농도가 10ppm이상인 경우, 일산화탄소 농도가 30ppm 이상인 경우, 및 가연성가스(메 탄 등) 농도가 10%이상인 경우 중 적어도 하나의 경우에 해당하면, 작업 위험성이 높은 것으로 판단(유해 공기 가 존재하는 것으로 판단)할 수 있다. 한 실시예로서, 제어부는 산소 농도가 18% 미만이거나 23.5%이상인 경우, 탄산가스(이산화탄소) 농도가 1.5%이상인 경우, 황화수소 농도가 10ppm이상인 경우, 일산화탄소 농도가 30ppm 이상인 경우, 및 가연성가스(메탄 등) 농도가 10%이상인 경우에 해당하지 않으면, 작업 위험성이 없는 것으로 판단할 수 있다. 한 실시예로서, 제어부는 사전에 학습된 인공신경망을 이용한 기계학습을 통해, 작업 대상 구역의 적외선 이미지로부터 고온 또는 화재 발생 여부 등의 작업 위험성을 판단할 수 있다. 한 실시예로서, 제어부는 사전에 학습된 인공신경망을 이용한 기계학습을 통해, 작업 환경 센서부의 각 센서에서 측정된 데이터로부터 센서 이상 유무를 판단할 수 있다. 제어부는 작업 전 사용자 단말에 미 리 입력된 사용 센서 수명 정보와 작업 환경 센서부를 통해 수집된 작업 환경 정보를 비교 분석하고, 비교 분석한 결과에 기반하여 이상이 발생한 센서에게 자동 캘리브레이션(calibration) 동작을 수행하도록 제어 명령을 전송할 수 있다. 제어부는 사용자 단말로부터 수신한 센서 선택 정보에 기반하여 복수의 센서 중 선택 정보에 대응하는 센서를 동작시킬 수 있다. 한 실시예로서, 사용자는 사용자 단말의 어플리케이션을 통해 복수의 센서 중 일부 센서를 선택할 수 있고, 사용자에 의해 입력된 센서 선택 정보는 사용자 단말을 통해 통신부에게 송신될 수 있다. 예를 들어, 사용자가 사용자 단말을 통해 산소 측정 센서 및 온도 센서를 선택하면, 제어 부는 복수의 센서 중 선택 정보에 대응하는 산소 측정 센서 및 온도 센서만 동작시켜 해당 데이터만 수신하 도록 할 수 있다. 통신부는 작업 환경 정보, 작업 대상 구역의 이미지, 및 작업 위험성 판단 결과를 사용자 단말에게 송 신한다. 통신부의 오토 핸드오프 수행을 통해, 다양한 환경에서 원할한 무선 통신이 가능하다. 디스플레이부는 작업 환경 정보, 작업 대상 구역의 이미지, 및 작업 위험성 판단 결과를 화면을 통해 출력 한다. 디스플레이부는 한 실시예로서, 액정 디스플레이(liquid crystal display), 박막 트랜지스터 액정 디 스플레이(thin film transistor-liquid crystal display), 유기 발광 다이오드(organic light-emitting diode), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 중에서 적어도 하나를 포함할 수 있다. 작업자 센서부는 작업자의 신체 정보를 수집한다. 작업자 센서부는 한 실시예로서, 체온 센서, 맥박 센 서, 혈압 센서 중 적어도 하나를 포함할 수 있다. 신체 정보는 한 실시예로서, 작업자의 체온, 맥박, 혈압 정보 중 적어도 하나를 포함할 수 있다. 제어부는 작업자의 신체 정보와 미리 설정된 기준값을 비교한 결과에 기반하여 작업 위험성을 판단할 수 있 다. 한 실시예로서, 제어부는 작업자의 체온이 36도 미만 또는 37도 초과인 경우, 맥박이 분당 60회 미만 또는 100회 초과인 경우, 및 이완혈압이 80mmHg 이상 또는 수축혈압이 120 mmHg 이상인 경우 중 적어도 하나의 경우에 해당하면, 작업 위험성이 높은 것으로 판단(작업자의 건강 이상으로 판단)할 수 있다. 한 실시예로서, 제어부는 작업자의 체온이 36도 미만 또는 37도 초과인 경우, 맥박이 분당 60회 미만 또는 100회 초과인 경 우, 및 이완혈압이 80mmHg 이상 또는 수축혈압이 120 mmHg 이상인 경우에 해당하지 않으면, 작업 위험성이 없는 것으로 판단할 수 있다. 제어부는 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 작업 대상 구역의 이미지를 분석한 결과뿐만 아니라, 작업자의 신체 정보와 미리 설정된 기준값을 비교한 결과에 기반하여 작업 위험성을 판단할 수 있다. 제어부는 한 실시예로서, 산소 농도가 18% 미만이거나 23.5%이상인 경우, 탄산가스(이산화탄소) 농도가 1.5%이상인 경우, 황화수소 농도가 10ppm이상인 경우, 일산화탄소 농도가 30ppm 이상인 경우, 및 가연성가스(메 탄 등) 농도가 10%이상인 경우 중 적어도 하나의 경우에 해당하고, 작업자의 체온이 36도 미만 또는 37도 초과 인 경우, 맥박이 분당 60회 미만 또는 100회 초과인 경우, 및 이완혈압이 80mmHg 이상 또는 수축혈압이 120 mmHg 이상인 경우 중 적어도 하나의 경우에 해당하면, 작업 위험성이 매우 높은 것으로 판단할 수 있다. 배터리부는 진동, 열, 및 태양광 에너지 중 적어도 하나의 에너지를 전기 에너지로 변환하여 배터리를 충전 한다. 배터리부는 에너지 하베스팅 기술을 통해 자가 발전 및 충전이 가능하다. 에너지 하베스팅 기술이 적 용된 배터리부의 자가 발전 및 충전을 통해 배터리 방전 없이 실시간 모니터링 및 외부 통신이 가능하고, 친환경 에너지 공급이 가능하다. 음성 인식부는 사용자로부터 음성 메시지를 획득하고, 인공지능을 이용하여 음성 메시지를 분석한 결과에 기반하여 사전 인증된 사용자인지 판단한다. 음성 인식부는 사전에 학습된 인공신경망을 이용한 기계학습을 통해, 사용자의 음성 메시지로부터 사전 인 증된 사용자(작업 위험성 판단 모듈에 미리 등록된 사용자)인지 판단할 수 있다. 제어부는 음성 인식부를 통해 사용자가 사전 인증된 사용자로 판단된 경우, 작업 환경 정보와 미리 설 정된 기준값을 비교한 결과 및 인공지능을 이용하여 이미지를 분석한 결과에 기반하여 작업 위험성을 판단할 수 있다. 한 실시예로서, 작업 위험성 판단 모듈은 항시 동작하는 것이 아니라, 음성 인식부를 통해 사용 자가 사전 인증된 사용자로 판단된 경우에만 작업 위험성을 판단할 수 있다.메모리부는 미리 설정된 기준값, 작업 환경 정보, 작업 대상 구역의 이미지, 작업 위험성 판단 결과, 및 작 업 대상 구역의 가상현실 이미지를 저장할 수 있다. 사용자 단말은 작업 위험성 판단 모듈로부터 작업 환경 정보, 작업 대상 구역의 이미지, 및 작업 위험 성 판단 결과를 수신할 수 있다. 미리 저장된 작업 대상 구역의 가상현실 이미지 및 작업 위험성 판단 모듈의 작업 대상 구역의 실시간 이미 지 전송을 통해, 증강 현실 구현이 가능하다. 이를 통해, 작업자 또는 관리자는 실시간 작업 환경 상태를 확인 할 수 있다. 도 2를 참조하면, 한 실시예에 따른 작업 위험성 판단 장치는, 본체부, 연결부, 상태 표시부 , 알람부, 및 진동부를 포함한다. 본체부는 한 실시예로서, 작업 위험성 판단 모듈을 포함할 수 있다. 작업 위험성 판단 모듈은 센싱된 작업 대상 구역의 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능을 이용하여 작업 대상 구역의 촬영된 이미지를 분석한 결과에 기반하여 작업 위험성을 판단한다. 작업 위험성 판단 모듈은 작업 환경 센서부, 영상촬영부, 제어부, 통신부, 디스플레이부 , 작업자 센서부, 배터리부, 음성 인식부, 및 메모리부를 포함할 수 있다. 작업 위험성 판단 모듈은 위에서 설명한 도 1의 작업 위험성 판단 모듈과 동일하므로, 상세한 설명은 생략한다. 연결부는 작업 위험성 판단 모듈의 양 측에 결합된다. 연결부는 한 실시예로서, 실리콘 재질의 플랙 시블(flexible) 밴드일 수 있다. 상태 표시부는 연결부의 일면에 배치되며, 복수의 LED(231, 232, 233, 234)를 포함하며, 작업 위험성 정도에 따라 복수의 LED를 점멸시킨다. 상태 표시부는 한 실시예로서, 빨간색 LED 및 주황색 LED를 포함할 수 있고, 작업 위험성이 높은 것으로 판단된 경우 노란색 LED를 점멸시킬 수 있으며, 작업 위험성이 매 우 높은 것으로 판단된 경우 빨간색 LED를 점멸시킬 수 있다. 상태 표시부는 한 실시예로서, 빨간색 LED, 녹색 LED, 및 노랑색 LED를 포함할 수 있고, 작업 위험성이 없는 것으로 판단된 경우 녹색 LED를 점멸시킬 수 있고, 작업 위험성이 높은 것으로 판단된 경우 노란색 LED를 점멸시킬 수 있으며, 작업 위험성이 매우 높은 것으로 판단된 경우 빨간색 LED를 점멸시킬 수 있다. 상태 표시부는 한 실시예로서, 작업 위험성 판단 모듈을 통해 판단된 작업 위험성 정도에 따라 복수의 LED 중 제1 LED를 점멸시킬 수 있고, 배터리 잔량에 따라 복수의 LED 중 제2 LED를 점멸시킬 수 있다. 상태 표시부는 한 실시예로서, 배터리 잔량이 30% 미만일 때, 제2 LED를 점멸시킬 수 있다. 상 태 표시부는 한 실시예로서, 통신 이상 유무에 따라 복수의 LED 중 제3 LED를 점멸시킬 수 있다. 알람부는 한 실시예로서, 연결부의 타면에 배치되며, 작업 위험성이 높은 것으로 판단된 경우 경보음을 출력할 수 있다. 진동부는 한 실시예로서, 연결부의 타면에 배치되며, 작업 위험성이 높은 것으로 판단된 경우 진동을 발생시킬 수 있다. 작업 위험성 판단 장치는 한 실시예로서, 손목에 착용할 수 있는 웨어러블 기기일 수 있다. 작업 위험성 판단 장치는 한 실시예로서, 드론, 헬멧, 작업복 등에 부착될 수 있는 장치일 수 있다. 사용자 단말은 작업 위험성 판단 장치로부터 작업 환경 정보, 작업 대상 구역의 이미지, 및 작업 위 험성 판단 결과를 수신할 수 있다. 도 3을 참조하면, 한 실시예에 따른 작업 위험성 판단 시스템은, 작업자 정보 수집 장치, 무선 이동체 , 블록체인 서버, 및 사용자 단말을 포함한다. 작업자 정보 수집 장치는 작업자의 신체 정보를 수집한다. 작업자 정보 수집 장치는 한 실시예로서, 체온 센서, 맥박 센서, 혈압 센서 중 적어도 하나를 포함하는 센 서 장치일 수 있다. 작업자 정보 수집 장치는 한 실시예로서, 작업자의 손목, 발목, 가슴, 또는 허리에 부 착될 수 있다. 무선 이동체는 센싱된 작업 대상 구역의 작업 환경 정보와 미리 설정된 기준값을 비교한 결과 및 인공지능 을 이용하여 작업 대상 구역의 촬영된 이미지를 분석한 결과에 기반하여 작업 위험성을 판단하는 작업 위험성 판단 모듈, 및 작업 위험성 정도에 따라 복수의 LED를 점멸시키는 상태 표시부를 포함하고, 작업 대상 구역을 실시간 촬영한다. 무선 이동체는 한 실시예로서, 작업 위험성 판단 장치를 포함할 수 있다. 작업 위험성 판단 모듈은 작업 환경 센서부, 영상촬영부, 제어부, 통신부, 디스플레이부 , 배터리부, 음성 인식부, 및 메모리부를 포함할 수 있다. 작업 위험성 판단 모듈은 위에서 설명한 도 1의 작업 위험성 판단 모듈과 동일하므로, 상세한 설명은 생략한다. 무선 이동체는 한 실시예로서, 무선 통신망을 통해 사용자 단말과 데이터 송수신이 가능한 드론 또는 이동 로봇일 수 있다. 블록체인 서버는 블록체인 네트워크를 이용하여 작업자의 신체 정보를 블록체인 방식으로 저장한다. 작업 자의 신체 정보를 블록체인 방식으로 저장함으로써, 개인 정보 유출을 원천 차단할 수 있다. 사용자 단말은 무선 이동체로부터 작업 환경 정보, 작업 대상 구역의 이미지, 및 작업 위험성 판단 결과를 수신할 수 있다. 사용자 단말은 한 실시예로서, 이동 통신 단말기, 데스크톱 컴퓨터, 노트북 컴퓨 터, 워크스테이션, 팜톱(palmtop) 컴퓨터, 개인 휴대 정보 단말기(Personal Digital Assistant, PDA), 웹 패드 등과 같이 메모리 수단을 구비하고 마이크로 프로세서를 탑재하여 연산 능력을 갖춘 디지털 기기일 수 있다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2019-0172810", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 실시예에 따른 작업 위험성 판단 모듈의 블록도이다. 도 2는 한 실시예에 따른 작업 위험성 판단 장치를 나타내는 도면이다. 도 3은 한 실시예에 따른 작업 위험성 판단 시스템의 블록도이다."}
