{"patent_id": "10-2022-0161731", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0078962", "출원번호": "10-2022-0161731", "발명의 명칭": "핫스탬핑 공정 제어 방법", "출원인": "한국생산기술연구원", "발명자": "배기현"}}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "금속 판재를 프레스 성형하는 프레스 성형 장치에 투입될 상기 금속 판재의 기계적 물성을 제 1 와전류 신호를이용하여 비파괴 검사로 측정하는 소재 검사 단계;기계적 물성의 검사가 완료된 상기 금속 판재를 소정의 가열 온도로 가열하는 가열 단계;가열이 완료된 상기 금속 판재를 상기 프레스 성형 장치로 이송하는 이송 단계; 및상기 프레스 성형 장치에서 상기 금속 판재를 소정의 형상으로 포밍(Forming) 성형하는 성형 단계;를 포함하고,상기 소재 검사 단계 이후에,비파괴 검사로 측정된 상기 금속 판재의 상기 기계적 물성에 기초하여, 상기 가열 단계에서 상기 소정의 가열온도로 가열된 상기 금속 판재의 냉각 속도를 제어함으로써, 상기 성형 단계에서 성형된 성형품이 사전에 설정된 목표 강도 및 목표 형상 정밀도 중 적어도 어느 하나를 포함하는 목표 성형 특성에 만족할 수 있도록, 상기이송 단계의 이송 조건 및 상기 성형 단계의 성형 조건 중 적어도 어느 하나의 공정 조건을 설정하는 공정 조건설정 단계;를 더 포함하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 소재 검사 단계는,제 1 와전류 센서부에 의해 상기 금속 판재의 적어도 하나 이상의 소정의 부위에 자기장을 발생시키고, 상기 자기장에 의해 상기 소정의 부위에서 발생하는 상기 제 1 와전류 신호를 감지하는 원소재 센싱 단계; 및사전에 실험을 통해 산출된 측정 와전류 신호의 응답 특성과 상기 금속 판재의 실제 기계적 물성 간의 상관관계에 기초하여, 상기 원소재 센싱 단계에서 감지된 상기 제 1 와전류 신호의 응답 특성으로부터 상기 금속 판재의상기 기계적 물성을 산출하는 물성 산출 단계;를 포함하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,원소재 센싱 단계에서,상기 성형 단계에서 포밍 성형될 상기 금속 판재의 성형 부위에 상기 자기장을 발생시키고, 상기 성형 부위에서발생하는 제 1-1 와전류 신호를 감지하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 금속 판재는,서로 다른 이종 소재 또는 서로 다른 이종 두께를 가지는 TWB(Tailor Welded Blank) 강판이고,상기 원소재 센싱 단계에서,상기 금속 판재의 용접 부위에 상기 자기장을 발생시키고, 상기 용접 부위에서 발생하는 제 1-2 와전류 신호를감지하는, 핫스탬핑 공정 제어 방법.공개특허 10-2024-0078962-3-청구항 5 제 4 항에 있어서,상기 물성 산출 단계에서,상기 성형 부위에서 발생한 상기 제 1-1 와전류 신호의 응답 특성 및 상기 용접 부위에서 발생한 상기 제 1-2와전류 신호의 응답 특성을 상기 상관관계에 대입하여, 상기 성형 부위 및 상기 용접 부위의 상기 기계적 물성을 산출하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2 항에 있어서,상기 물성 산출 단계에서,상기 금속 판재의 항복 강도, 인장 강도, 인열 강도, 굴곡 강도, 압축 강도, 경도, 탄성율, 연신율, 경도, 마찰계수 중 적어도 어느 하나 이상을 상기 기계적 물성으로 산출하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 공정 조건 설정 단계에서,사전에 실험을 통해 산출된 상기 목표 성형 특성을 만족하기 위한, 상기 금속 판재의 냉각 속도와 상기 금속 판재의 상기 기계적 특성 간의 상관관계에 기초하여, 상기 소재 검사 단계에서 측정된 상기 금속 판재의 상기 기계적 물성으로부터 설정된 상기 공정 조건을 상기 이송 단계 및 상기 성형 단계 중 적어도 어느 하나의 단계로전송하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 공정 조건 설정 단계에서,상기 이송 단계에서 이송 장치가 가열된 상기 금속 판재를 이송시키는 이송 속도를 상기 이송 조건으로 설정하고, 상기 성형 단계에서 상기 프레스 성형 장치가 상형을 하강 시키는 하강 속도를 상기 성형 조건으로 설정하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 성형 단계 이후에,상기 프레스 성형 장치에서 상기 소정의 형상으로 포밍 성형된 성형품의 실제 성형 특성을 비파괴 검사로 측정하는 성형품 검사 단계; 및상기 성형품 검사 단계에서 비파괴 검사로 측정된 상기 성형품의 상기 실제 성형 특성에 기초하여, 상기 실제성형 특성이 상기 목표 성형 특성에 미달될 경우, 상기 가열 단계에서 상기 소정의 가열 온도로 가열된 상기 금속 판재의 냉각 속도를 보정할 수 있도록, 상기 공정 조건 설정 단계에서 설정된 상기 이송 단계의 상기 이송조건 및 상기 성형 단계의 상기 성형 조건 중 적어도 어느 하나의 공정 조건을 보정하는 공정 최적화 단계;를 더 포함하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 성형품 검사 단계는,제 2 와전류 센서부에 의해 상기 성형품의 적어도 하나 이상의 소정의 부위에 자기장을 발생시키고, 상기 자기공개특허 10-2024-0078962-4-장에 의해 상기 소정의 부위에서 발생하는 제 2 와전류 신호를 감지하는 제 1 성형품 센싱 단계; 및사전에 실험을 통해 산출된 측정 와전류 신호와 상기 성형품의 강도(Strength) 간의 상관관계에 기초하여, 상기제 1 성형품 센싱 단계에서 감지된 상기 제 2 와전류 신호의 응답 특성으로부터 상기 성형품의 실제 강도를 상기 실제 성형 특성으로 산출하는 제 1 특성 산출 단계;를 포함하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 성형품 검사 단계는,비전 카메라에 의해 상기 성형품의 전체적인 형상을 촬영하는 제 2 성형품 센싱 단계; 및상기 성형품의 촬영 이미지에서 상기 성형품의 스프링백 발생량과 관련된 부분의 적어도 한 곳 이상을 측정 포인트로 산출하고, 상기 측정 포인트의 치수를 측정하여 상기 스프링백 발생량을 상기 실제 성형 특성으로 산출하는 제 2 특성 산출 단계;를 더 포함하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 공정 최적화 단계는,상기 제 1 특성 산출 단계에서 산출된 상기 성형품의 상기 실제 강도 및 상기 제 2 특성 산출 단계에서 산출된상기 스프링백 발생량을 포함하는 실제 성형 특성과 상기 목표 성형 특성을 비교하여, 상기 목표 성형 특성과상기 실제 성형 특성의 차이의 합을 손실 함수(Loss fuction)으로 도출하는 비교 단계; 및상기 비교 단계에서 도출된 상기 손실 함수를 고려하여 상기 목표 성형 특성과 상기 실제 성형 특성의 차이를최소화하기 위한 최적화 결과를 상기 공정 조건 설정 단계에서 설정된 상기 이송 단계의 상기 이송 조건 및 상기 성형 단계의 상기 성형 조건 중 적어도 어느 하나에 반영하는 보정 단계;를 포함하는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9 항에 있어서,상기 소재 검사 단계 및 상기 공정 조건 설정 단계는,상기 성형품이 상기 목표 성형 특성에 만족할 수 있도록, 상기 금속 판재와 동일한 생산 롯트(Lot)의 최초 소재투입 시에만 상기 이송 단계 및 상기 성형 단계의 상기 공정 조건 설정을 위해 실행되고, 상기 공정 최적화 단계는,상기 성형품 검사 단계에서 측정된 상기 성형품의 상기 실제 성형 특성을 기초로 상기 공정 조건의 보정이 지속적으로 이루어져, 상기 성형품이 상기 목표 성형 특성에 계속해서 만족할 수 있도록, 상기 동일한 생산 롯트의소재의 성형 중에 반복적으로 실행되는, 핫스탬핑 공정 제어 방법."}
{"patent_id": "10-2022-0161731", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 금속 판재를 소정의 가열 온도로 가열하여 프레스 성형할 수 있는 핫스탬핑 공정 제어 방법에 관한 것으로서, 금속 판재를 프레스 성형하는 프레스 성형 장치에 투입될 상기 금속 판재의 기계적 물성을 제 1 와전류 신호를 이용하여 비파괴 검사로 측정하는 소재 검사 단계와, 기계적 물성의 검사가 완료된 상기 금속 판재를 소 (뒷면에 계속)"}
{"patent_id": "10-2022-0161731", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 핫스탬핑 공정 제어 방법에 관한 것으로서, 더 상세하게는 금속 판재를 소정의 가열 온도로 가열하여 프레스 성형할 수 있는 핫스탬핑 공정 제어 방법에 관한 것이다."}
{"patent_id": "10-2022-0161731", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 차량 업계에서는 차량 경량화와 안정성 향상에 부합되는 중량 대비 강도가 높은 초고강도 강재나 경량합금 판재가 확대 적용되고 있다. 하지만, 초고강도 강재는 낮은 성형성을 지니고 과도한 스프링백을 일으키기 때문 에, 초고강도 강재를 성형하기 위한 금형을 제조하는데 어려움이 있다. 이러한 어려움을 해결하기 위한 성형 기 술로서 핫스탬핑 공정이 사용될 수 있다. 일반적으로, 핫스탬핑 공정은, 금속 판재를 고온으로 가열하여 프레스 금형 내에서 한번에 성형한 후, 금형 내 에서 성형품을 급랭시켜 성형품을 제조하는 공정을 말한다. 이와 같은, 핫스탬핑 공정은 성형 및 열처리가 동시 에 수행되므로 생산성이 우수할 뿐만 아니라 고온에서 금속 판재를 성형하게 되므로 우수한 성형성 및 치수 정 밀도를 얻을 수 있다. 또한, 고강도 부품에서 특히 문제가 되는 스프링백이나 자연 파괴가 현저하게 감소한다는 장점이 있다. 그러나, 이러한 종래의 핫스탬핑 공정은, 초고강도 강판이나 재단 용접 강판(TWB 강판)의 모재의 기계적 물성이 나 용접부 품질의 산포에 따라 최종 성형품의 품질 산포가 발생하는 문제점이 있었다."}
{"patent_id": "10-2022-0161731", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 포함하여 여러 문제점들을 해결하기 위한 것으로서, 와전류 센서를 이용하여 투입되는 금속 판재의 기계적 물성 및 용접부의 건전성을 평가하고, 성형품의 품질 특성을 평가함으로써, 성형 불량 발생 시, 가열된 금속 판재의 이송 속도 및 서보프레스를 활용한 성형 공정 제어를 통하여 퀜칭 속도 확보 및 성형 품질을 제어할 수 있는 핫스탬핑 공정 제어 방법을 제공하는 것을 목적으로 한다. 그러나 이러한 과제 는 예시적인 것으로, 이에 의해 본 발명의 범위가 한정되는 것은 아니다."}
{"patent_id": "10-2022-0161731", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 핫스탬핑 공정 제어 방법이 제공된다. 상기 핫스탬핑 공정 제어 방법은, 금속 판재를 프레스 성형하는 프레스 성형 장치에 투입될 상기 금속 판재의 기계적 물성을 제 1 와전류 신호를 이용 하여 비파괴 검사로 측정하는 소재 검사 단계; 기계적 물성의 검사가 완료된 상기 금속 판재를 소정의 가열 온 도로 가열하는 가열 단계; 가열이 완료된 상기 금속 판재를 상기 프레스 성형 장치로 이송하는 이송 단계; 및 상기 프레스 성형 장치에서 상기 금속 판재를 소정의 형상으로 포밍(Forming) 성형하는 성형 단계;를 포함하고, 상기 소재 검사 단계 이후에, 비파괴 검사로 측정된 상기 금속 판재의 상기 기계적 물성에 기초하여, 상기 가열 단계에서 상기 소정의 가열 온도로 가열된 상기 금속 판재의 냉각 속도를 제어함으로써, 상기 성형 단계에서 성 형된 성형품이 사전에 설정된 목표 강도 및 목표 형상 정밀도 중 적어도 어느 하나를 포함하는 목표 성형 특성 에 만족할 수 있도록, 상기 이송 단계의 이송 조건 및 상기 성형 단계의 성형 조건 중 적어도 어느 하나의 공정 조건을 설정하는 공정 조건 설정 단계;를 더 포함할 수 있다. 본 발명의 일 실시예에 의하면, 상기 소재 검사 단계는, 제 1 와전류 센서부에 의해 상기 금속 판재의 적어도 하나 이상의 소정의 부위에 자기장을 발생시키고, 상기 자기장에 의해 상기 소정의 부위에서 발생하는 상기 제 1 와전류 신호를 감지하는 원소재 센싱 단계; 및 사전에 실험을 통해 산출된 측정 와전류 신호의 응답 특성과 상기 금속 판재의 실제 기계적 물성 간의 상관관계에 기초하여, 상기 원소재 센싱 단계에서 감지된 상기 제 1 와전류 신호의 응답 특성으로부터 상기 금속 판재의 상기 기계적 물성을 산출하는 물성 산출 단계;를 포함할 수 있다. 본 발명의 일 실시예에 의하면, 원소재 센싱 단계에서, 상기 성형 단계에서 포밍 성형될 상기 금속 판재의 성형 부위에 상기 자기장을 발생시키고, 상기 성형 부위에서 발생하는 제 1-1 와전류 신호를 감지할 수 있다. 본 발명의 일 실시예에 의하면, 상기 금속 판재는, 서로 다른 이종 소재 또는 서로 다른 이종 두께를 가지는 TWB(Tailor Welded Blank) 강판이고, 상기 원소재 센싱 단계에서, 상기 금속 판재의 용접 부위에 상기 자기장을 발생시키고, 상기 용접 부위에서 발생하는 제 1-2 와전류 신호를 감지할 수 있다. 본 발명의 일 실시예에 의하면, 상기 물성 산출 단계에서, 상기 성형 부위에서 발생한 상기 제 1-1 와전류 신호 의 응답 특성 및 상기 용접 부위에서 발생한 상기 제 1-2 와전류 신호의 응답 특성을 상기 상관관계에 대입하여, 상기 성형 부위 및 상기 용접 부위의 상기 기계적 물성을 산출할 수 있다. 본 발명의 일 실시예에 의하면, 상기 물성 산출 단계에서, 상기 금속 판재의 항복 강도, 인장 강도, 인열 강도, 굴곡 강도, 압축 강도, 경도, 탄성율, 연신율, 경도, 마찰 계수 중 적어도 어느 하나 이상을 상기 기계적 물성으로 산출할 수 있다. 본 발명의 일 실시예에 의하면, 상기 공정 조건 설정 단계에서, 사전에 실험을 통해 산출된 상기 목표 성형 특 성을 만족하기 위한, 상기 금속 판재의 냉각 속도와 상기 금속 판재의 상기 기계적 특성 간의 상관관계에 기초 하여, 상기 소재 검사 단계에서 측정된 상기 금속 판재의 상기 기계적 물성으로부터 설정된 상기 공정 조건을 상기 이송 단계 및 상기 성형 단계 중 적어도 어느 하나의 단계로 전송할 수 있다. 본 발명의 일 실시예에 의하면, 상기 공정 조건 설정 단계에서, 상기 이송 단계에서 이송 장치가 가열된 상기 금속 판재를 이송시키는 이송 속도를 상기 이송 조건으로 설정하고, 상기 성형 단계에서 상기 프레스 성형 장치 가 상형을 하강 시키는 하강 속도를 상기 성형 조건으로 설정할 수 있다. 본 발명의 일 실시예에 의하면, 상기 성형 단계 이후에, 상기 프레스 성형 장치에서 상기 소정의 형상으로 포밍 성형된 성형품의 실제 성형 특성을 비파괴 검사로 측정하는 성형품 검사 단계; 및 상기 성형품 검사 단계에서 비파괴 검사로 측정된 상기 성형품의 상기 실제 성형 특성에 기초하여, 상기 실제 성형 특성이 상기 목표 성형 특성에 미달될 경우, 상기 가열 단계에서 상기 소정의 가열 온도로 가열된 상기 금속 판재의 냉각 속도를 보정 할 수 있도록, 상기 공정 조건 설정 단계에서 설정된 상기 이송 단계의 상기 이송 조건 및 상기 성형 단계의 상 기 성형 조건 중 적어도 어느 하나의 공정 조건을 보정하는 공정 최적화 단계;를 더 포함할 수 있다. 본 발명의 일 실시예에 의하면, 상기 성형품 검사 단계는, 제 2 와전류 센서부에 의해 상기 성형품의 적어도 하 나 이상의 소정의 부위에 자기장을 발생시키고, 상기 자기장에 의해 상기 소정의 부위에서 발생하는 제 2 와전 류 신호를 감지하는 제 1 성형품 센싱 단계; 및 사전에 실험을 통해 산출된 측정 와전류 신호와 상기 성형품의 강도(Strength) 간의 상관관계에 기초하여, 상기 제 1 성형품 센싱 단계에서 감지된 상기 제 2 와전류 신호의 응답 특성으로부터 상기 성형품의 실제 강도를 상기 실제 성형 특성으로 산출하는 제 1 특성 산출 단계;를 포함 할 수 있다. 본 발명의 일 실시예에 의하면, 상기 성형품 검사 단계는, 비전 카메라에 의해 상기 성형품의 전체적인 형상을 촬영하는 제 2 성형품 센싱 단계; 및 상기 성형품의 촬영 이미지에서 상기 성형품의 스프링백 발생량과 관련된 부분의 적어도 한 곳 이상을 측정 포인트로 산출하고, 상기 측정 포인트의 치수를 측정하여 상기 스프링백 발생 량을 상기 실제 성형 특성으로 산출하는 제 2 특성 산출 단계;를 포함할 수 있다. 본 발명의 일 실시예에 의하면, 상기 공정 최적화 단계는, 상기 제 1 특성 산출 단계에서 산출된 상기 성형품의 상기 실제 강도 및 상기 제 2 특성 산출 단계에서 산출된 상기 스프링백 발생량을 포함하는 실제 성형 특성과 상기 목표 성형 특성을 비교하여, 상기 목표 성형 특성과 상기 실제 성형 특성의 차이의 합을 손실 함수(Loss fuction)으로 도출하는 비교 단계; 및 상기 비교 단계에서 도출된 상기 손실 함수를 고려하여 상기 목표 성형 특성과 상기 실제 성형 특성의 차이를 최소화하기 위한 최적화 결과를 상기 공정 조건 설정 단계에서 설정된 상 기 이송 단계의 상기 이송 조건 및 상기 성형 단계의 상기 성형 조건 중 적어도 어느 하나에 반영하는 보정 단 계;를 포함할 수 있다. 본 발명의 일 실시예에 의하면, 상기 소재 검사 단계 및 상기 공정 조건 설정 단계는, 상기 성형품이 상기 목표 성형 특성에 만족할 수 있도록, 상기 금속 판재와 동일한 생산 롯트(Lot)의 최초 소재 투입 시에만 상기 이송 단계 및 상기 성형 단계의 상기 공정 조건 설정을 위해 실행되고, 상기 공정 최적화 단계는, 상기 성형품 검사 단계에서 측정된 상기 성형품의 상기 실제 성형 특성을 기초로 상기 공정 조건의 보정이 지속적으로 이루어져, 상기 성형품이 상기 목표 성형 특성에 계속해서 만족할 수 있도록, 상기 동일한 생산 롯트의 소재의 성형 중에 반복적으로 실행될 수 있다."}
{"patent_id": "10-2022-0161731", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같이 이루어진 본 발명의 일 실시예에 따르면, 와전류 센서를 이용하여, 투입되는 금속 판재의 기 계적 물성 및 용접부의 건전성을 비파괴 검사로 평가하고, 비파괴 검사로 측정된 금속 판재의 기계적 물성 및 용접부의 건전성 평가에 기초하여, 가열 장치에서 가열된 금속 판재의 이송 속도 및 프레스 성형 장치에서 상형 이 하강하는 속도 등의 공정 제어를 통하여, 금속 판재의 적절한 퀜칭 속도를 확보함으로써, 최종 성형품의 성 형 품질을 목표 성형 특성에 만족할 수 있도록 제어할 수 있다. 또한, 와전류 센서를 이용하여, 성형이 완료된 성형품의 실제 성형 특성을 비파괴 검사로 평가하고, 실제 성형 특성이 목표 성형 특성에 미치지 못할 경우, 가열 장치에서 가열된 금속 판재의 이송 속도 및 프레스 성형 장치 에서 상형이 하강하는 속도 등을 보정하여, 금속 판재의 퀜칭 속도를 적절히 보정함으로써, 복수의 금속 판재의프레스 성형 중 최종 성형품의 성형 품질을 목표 성형 특성으로 일정하게 유지할 수 있도록 제어할 수 있다. 이와 같이, 금속 판재를 이루는 모재의 기계적 물성 및 용접부의 건전성이나, 최종 성형된 성형품의 실제 성형 특성을 비파괴 검사로 평가하여, 이들 산포에 따른 최적 공정 제어로 핫스탬핑 공정을 관리함으로써, 최종 성형 품의 품질 관리를 용이하게 할 수 있는 핫스탬핑 공정 제어 방법을 구현할 수 있다. 물론 이러한 효과에 의해 본 발명의 범위가 한정되는 것은 아니다."}
{"patent_id": "10-2022-0161731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 여러 실시예들을 상세히 설명하기로 한다. 본 발명의 실시예들은 당해 기술 분야에서 통상의 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위하 여 제공되는 것이며, 하기 실시예는 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 하기 실시예에 한정되는 것은 아니다. 오히려 이들 실시예들은 본 개시를 더욱 충실하고 완전하게 하고, 당업자에게 본 발명의 사상을 완전하게 전달하기 위하여 제공되는 것이다. 또한, 도면에서 각 층의 두께나 크기는 설명의 편의 및 명 확성을 위하여 과장된 것이다. 이하, 본 발명의 실시예들은 본 발명의 이상적인 실시예들을 개략적으로 도시하는 도면들을 참조하여 설명한다. 도면들에 있어서, 예를 들면, 제조 기술 및/또는 공차(tolerance)에 따라, 도시된 형상의 변형들이 예상될 수 있다. 따라서, 본 발명 사상의 실시예는 본 명세서에 도시된 영역의 특정 형상에 제한된 것으로 해석되어서는 아니 되며, 예를 들면 제조상 초래되는 형상의 변화를 포함하여야 한다. 도 1은 본 발명의 일 실시예에 따른 핫스탬핑 공정 제어 방법을 순서대로 나타내는 순서도이고, 도 2 및 도 3은 도 1의 핫스탬핑 공정 제어 방법의 각 단계를 개략적으로 나타내는 모식도이다. 먼저, 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 핫스탬핑 공정 제어 방법은, 크게, 소재 투입 단 계(S100)와, 소재 검사 단계(S200)와, 공정 조건 설정 단계(S300)와, 가열 단계(S400)와, 이송 단계(S500) 및 성형 단계(S600)를 포함할 수 있다. 도 1 및 도 2에 도시된 바와 같이, 소재 투입 단계(S100)를 통해, 금속 판재를 프레스 성형하는 프레스 성형 장치에 투입될 금속 판재를 투입하고, 소재 검사 단계(S200)를 통해, 투입된 금속 판재의 기계적 물 성을 제 1 와전류 신호를 이용하여 비파괴 검사로 측정할 수 있다. 예컨대, 소재 검사 단계(S200)에서, 먼저, 원소재 센싱 단계(S210)를 통해, 제 1 와전류 센서부에 의해 금 속 판재의 적어도 하나 이상의 소정의 부위에 자기장을 발생시키고, 상기 자기장에 의해 상기 소정의 부위에 서 발생하는 제 1 와전류 신호를 감지할 수 있다. 더욱 구체적으로, 원소재 센싱 단계(S210)에서는, 후술될 성형 단계(S600)에서 포밍 성형될 금속 판재의 성 형 부위에 상기 자기장을 발생시키고, 상기 성형 부위에서 발생하는 제 1-1 와전류 신호를 감지할 수 있다. 또한, 투입된 금속 판재가 서로 다른 이종 소재 또는 서로 다른 이종 두께를 가지는 TWB(Tailor Welded Blank) 강판일 경우, 용접 부위의 건전성도 함께 평가할 수 있도록, 원소재 센싱 단계(S210)에서는, 금속 판재 의 용접 부위(1a)에도 상기 자기장을 발생시키고, 용접 부위(1a)에서 발생하는 제 1-2 와전류 신호를 감지할 수 있다. 이러한, 원소재 센싱 단계(S210)에서 사용되는 제 1 와전류 센서부는, 금속 판재에 상기 자기장을 발생 시키고, 상기 자기장에 의해 금속 판재에서 발생하는 와전류(Eddy current) 신호를 감지할 수 있는 일종의와전류 센서일 수 있다. 더욱 구체적으로, 상기 와전류 센서는, 금속 판재에 상기 자기장을 발생시키기 위한 송신 코일 및 상기 자기 장에 의해 금속 판재에서 발생하는 와전류 신호를 감지하기 위한 수신 코일이 설치되는 프로브와, 상기 송신 코일에서 발생되는 상기 자기장의 크기를 변화시킬 수 있도록 상기 송신 코일에 교류 전원을 인가하는 전원부 및 상기 수신 코일을 통해 와전류 신호를 감지하는 센싱부를 포함하도록 구성될 수 있다. 이어서, 소재 검사 단계(S200)는, 물성 산출 단계(S220)에서, 사전에 실험을 통해 산출된 측정 와전류 신호의 응답 특성과 금속 판재의 실제 기계적 물성 간의 상관관계에 기초하여, 원소재 센싱 단계(S210)에서 감지된 상기 제 1 와전류 신호의 응답 특성으로부터 금속 판재의 상기 기계적 물성을 산출할 수 있다. 더욱 구체적으로, 물성 산출 단계(S220)에서, 금속 판재의 상기 성형 부위에서 발생한 상기 제 1-1 와전류 신호의 응답 특성 및 용접 부위(1a)에서 발생한 상기 제 1-2 와전류 신호의 응답 특성을 상기 상관관계에 대입 하여, 상기 성형 부위 및 용접 부위(1a)의 상기 기계적 물성을 산출할 수 있다. 이때, 물성 산출 단계(S220)에서, 금속 판재를 이루는 원소재 및 용접 부위의 항복 강도, 인장 강도, 인열 강도, 굴곡 강도, 압축 강도, 경도, 탄성율, 연신율, 경도, 마찰 계수 중 적어도 어느 하나 이상을 상기 기계적 물성으로 산출할 수 있다. 이러한, 물성 산출 단계(S200)에서 이용되는 상기 상관관계는, 사전에 복수회 실험을 통해 산출된 복수의 측정 와전류 신호의 응답 특성들과 복수의 금속 판재의 실제 기계적 물성들을 입력 데이터로 하여 이들의 관계를 기계적 학습 또는 딥러닝한 인공지능 모델로 이루어질 수도 있다. 이어서, 도 1 및 도 3에 도시된 바와 같이, 기계적 물성의 검사가 완료된 금속 판재를 가열 챔버를 구비한 가열 장치에서 소정의 가열 온도로 가열하는 가열 단계(S400)와, 가열이 완료된 금속 판재를 로봇팔과 같은 이송 장치로 프레스 성형 장치로 이송하는 이송 단계(S500) 및 프레스 성형 장치에서 금속 판 재를 소정의 형상으로 포밍(Forming) 성형하여 성형품을 성형하는 성형 단계(S600)가 진행될 수 있다. 이와 같이, 소재 검사 단계(S200) 이후에, 가열 단계(S400)와, 이송 단계(S500) 및 성형 단계(S600)가 이루어지 는 과정에서, 가열 단계(S400)를 통해 가열된 금속 판재의 냉각 속도를 제어함으로써 퀜칭(Quenching) 속도 를 제어할 수 있도록, 이송 단계(S500)의 이송 조건 및 성형 단계(S600)의 성형 조건 중 적어도 어느 하나의 공 정 조건을 설정하는 공정 조건 설정 단계(S300)가 이루어질 수 있다. 예컨대, 공정 조건 설정 단계(S300)는, 소재 검사 단계(S200) 이후에, 비파괴 검사로 측정된 금속 판재의 상 기 기계적 물성에 기초하여, 가열 단계(S400)에서 상기 소정의 가열 온도로 가열된 금속 판재의 냉각 속도를 제어함으로써, 성형 단계(S600)에서 성형된 성형품이 사전에 설정된 목표 강도 및 목표 형상 정밀도 중 적어 도 어느 하나를 포함하는 목표 성형 특성에 만족할 수 있도록, 이송 단계(S500)의 상기 이송 조건 및 성형 단계 (S600)의 상기 성형 조건 중 적어도 어느 하나를 상기 공정 조건으로 설정할 수 있다. 더욱 구체적으로, 공정 조건 설정 단계(S300)에서, 사전에 실험을 통해 산출된 상기 목표 성형 특성을 만족하기 위한, 금속 판재의 냉각 속도와 금속 판재의 상기 기계적 특성 간의 상관관계에 기초하여, 소재 검사 단 계(S200)에서 측정된 금속 판재의 상기 기계적 물성으로부터 설정된 상기 공정 조건을 이송 단계(S500) 및 성형 단계(S600) 중 적어도 어느 하나의 단계로 전송할 수 있다. 이때, 공정 조건 설정 단계(S300)에서 이용되는 상기 상관관계는, 상기 목표 성형 특성을 만족하기 위한, 금속 판재의 상기 기계적 특성 별 금속 판재의 냉각 속도에 관한 것으로서, 사전에 복수회 실험을 통해 산출된, 금속 판재의 상기 기계적 특성 별 금속 판재의 다양한 냉각 속도에서 나타난 최종 성형품의 성형 특성들을 입력 데이터로 하여 이들의 관계를 기계적 학습 또는 딥러닝한 인공지능 모델로 이루어질 수도 있다. 이에 따라, 공정 조건 설정 단계(S300)에서, 이송 단계(S500)에서 이송 장치가 가열된 금속 판재를 이송 시키는 이송 속도를 상기 이송 조건으로 설정하고, 성형 단계(S600)에서 프레스 성형 장치가 상형(M1)을 하 형(M2)을 향해 하강시키는 하강 속도를 상기 성형 조건으로 설정하여, 각각 이송 단계(S500) 및 성형 단계 (S600)로 전송할 수 있다. 따라서, 본 발명의 일 실시예에 따른 핫스탬핑 공정 제어 방법에 따르면, 와전류 센서를 이용하여, 투입되는 금 속 판재의 상기 기계적 물성 및 용접 부위(1a)의 건전성을 비파괴 검사로 평가하고, 비파괴 검사로 측정된 금속 판재의 상기 기계적 물성 및 용접 부위(1a)의 건전성 평가에 기초하여, 가열 장치에서 가열된 금속판재의 이송 속도 및 프레스 성형 장치에서 상형(M1)이 하강하는 속도 등의 공정 제어를 통하여, 금속 판재의 적절한 퀜칭 속도를 확보함으로써, 최종 성형품의 성형 품질을 목표 성형 특성에 만족할 수 있도 록 제어할 수 있다. 그러므로, 금속 판재를 이루는 모재의 상기 기계적 물성 및 용접 부위(1a)의 건전성을 비파괴 검사로 평가하 여, 이들 산포에 따른 최적 공정 제어로 핫스탬핑 공정을 관리함으로써, 최종 성형품의 품질 관리를 용이하 게 할 수 있는 핫스탬핑 공정 제어 방법을 구현할 수 있다. 도 4는 본 발명의 다른 실시예에 따른 핫스탬핑 공정 제어 방법을 순서대로 나타내는 순서도이고, 도 5는 도 4 의 핫스탬핑 공정 제어 방법의 성형품 검사 단계 및 공정 최적화 단계를 보다 상세하게 나타내는 순서도이며, 도 6은 도 4의 핫스탬핑 공정 제어 방법의 각 단계를 개략적으로 나타내는 모식도이다. 도 4에 도시된 바와 같이, 본 발명의 다른 실시예에 따른 핫스탬핑 공정 제어 방법은, 성형 단계(S600) 이후에, 프레스 성형 장치에서 소정의 형상으로 포밍 성형된 성형품의 실제 성형 특성을 비파괴 검사로 측정하는 성형품 검사 단계(S700) 및 성형품 검사 단계(S700)에서 비파괴 검사로 측정된 성형품의 상기 실제 성형 특 성에 기초하여, 상기 실제 성형 특성이 상기 목표 성형 특성에 미달될 경우, 가열 단계(S400)에서 상기 소정의 가열 온도로 가열된 금속 판재의 냉각 속도를 보정할 수 있도록, 공정 조건 설정 단계(S300)에서 설정된 이 송 단계(S500)의 상기 이송 조건 및 성형 단계(S600)의 상기 성형 조건 중 적어도 어느 하나의 공정 조건을 보 정하는 공정 최적화 단계(S800)를 더 포함할 수 있다. 여기서, 소재 투입 단계(S100)와, 소재 검사 단계(S200)와, 공정 조건 설정 단계(S300)와, 가열 단계(S400)와, 이송 단계(S500) 및 성형 단계(S600)는, 도 1 내지 도 3에 도시된 본 발명의 일 실시예에 따른 핫스탬핑 공정 제어 방법과 동일하게 이루어질 수 있다. 따라서, 상세한 설명은 생략한다. 예컨대, 도 4 내지 도 6에 도시된 바와 같이, 성형품 검사 단계(S700)는, 제 2 와전류 센서부에 의해 성형 품의 적어도 하나 이상의 소정의 부위에 자기장을 발생시키고, 상기 자기장에 의해 상기 소정의 부위에서 발 생하는 제 2 와전류 신호를 감지하는 제 1 성형품 센싱 단계(S710) 및 사전에 실험을 통해 산출된 측정 와전류 신호와 성형품의 강도(Strength) 간의 상관관계에 기초하여, 제 1 성형품 센싱 단계(S710)에서 감지된 상기 제 2 와전류 신호의 응답 특성으로부터 성형품의 실제 강도를 상기 실제 성형 특성으로 산출하는 제 1 특성 산출 단계(S720)를 포함할 수 있다. 또한, 성형품 검사 단계(S700)는, 비전 카메라에 의해 성형품의 전체적인 형상을 촬영하는 제 2 성형품 센싱 단계(S730) 및 성형품의 촬영 이미지에서 성형품의 스프링백 발생량과 관련된 부분의 적어도 한 곳 이상을 측정 포인트로 산출하고, 상기 측정 포인트의 치수를 측정하여 상기 스프링백 발생량을 상기 실제 성형 특성으로 산출하는 제 2 특성 산출 단계(S740)를 더 포함할 수 있다. 예컨대, 프레스 성형 장치에서 포밍 성형될 성형품이 상기 목표 성형 특성에 만족할 수 있도록, 금속 판 재와 동일한 생산 롯트(Lot)의 최초 소재 투입 시에만 소재 검사 단계(S200) 및 공정 조건 설정 단계(S300) 를 실행함으로써, 이송 단계(S500) 및 성형 단계(S600)의 상기 공정 조건을 설정할 수 있다. 이에 따라, 성형 단계(S600) 후, 성형품 검사 단계(S700)를 통해, 프레스 성형 장치에서 포밍 성형된 성형 품의 실제 성형 특성을 비파괴 검사로 측정함으로써, 성형품의 상기 실제 성형 특성이 상기 목표 성형 특 성에 만족하는지 검사할 수 있다. 이어서, 최소 투입된 소재와 동일한 생산 롯트의 소재의 성형 시, 성형품 검사 단계(S700)의 검사 결과를 통해 이송 단계(S500) 및 성형 단계(S600)를 피드백 제어할 수 있도록, 검사 결과에 따라 공정 최적화 단계(S800)가 선택적으로 실행될 수 있다. 예컨대, 성형품 검사 단계(S700)에서 비파괴 검사로 측정한 성형품의 상기 실제 성형 특성이 상기 목표 성형 특성에 만족할 경우, 그 다음 소재도 이전 공정 조건과 동일한 공정 조건으로 이송 단계(S500) 및 성형 단계 (S600)가 실행될 수 있으며, 성형품 검사 단계(S700)에서 비파괴 검사로 측정한 성형품의 상기 실제 성형 특 성이 상기 목표 성형 특성에 만족하지 못할 경우, 공정 최적화 단계(S800)를 통해, 성형품 검사 단계(S700)에서 비파괴 검사로 측정한 성형품의 상기 실제 성형 특성을 기초로 이송 단계(S500) 및 성형 단계(S600)의 상기 공정 조건을 보정하여, 그 다음 소재의 성형 공정이 이루어질 수 있다. 더욱 구체적으로, 공정 최적화 단계(S800)는, 먼저, 비교 단계(S810)를 통해, 제 1 특성 산출 단계(S720)에서 산출된 성형품의 상기 실제 강도 및 제 2 특성 산출 단계(S740)에서 산출된 상기 스프링백 발생량을 포함하는 실제 성형 특성과 상기 목표 성형 특성을 비교하여, 상기 목표 성형 특성과 상기 실제 성형 특성의 차이의 합을 손실 함수(Loss fuction)로 도출하고, 이어서, 보정 단계(S820)를 통해, 비교 단계(S810)에서 도출된 상기 손실 함수를 고려하여 상기 목표 성형 특성과 상기 실제 성형 특성의 차이를 최소화하기 위한 최적화 결과를 공 정 조건 설정 단계(S300)에서 설정된 이송 단계(S500)의 상기 이송 조건 및 성형 단계(S600)의 상기 성형 조건 중 적어도 어느 하나에 반영할 수 있다. 이러한, 공정 최적화 단계(S800)는, 성형품 검사 단계(S700)에서 측정된 성형품의 상기 실제 성형 특성을 기 초로 상기 공정 조건의 보정이 지속적으로 이루어져, 성형품이 상기 목표 성형 특성에 계속해서 만족할 수 있도록, 상기 동일한 생산 롯트의 소재의 성형 중에 반복적으로 실행될 수 있다. 따라서, 본 발명의 다른 실시예에 따른 핫스탬핑 공정 제어 방법에 따르면, 와전류 센서를 이용하여, 투입되는 금속 판재의 상기 기계적 물성 및 용접 부위(1a)의 건전성을 비파괴 검사로 평가하고, 비파괴 검사로 측정된 금속 판재의 상기 기계적 물성 및 용접 부위(1a)의 건전성 평가에 기초하여, 가열 장치에서 가열된 금속 판재의 이송 속도 및 프레스 성형 장치에서 상형(M1)이 하강하는 속도 등의 공정 제어를 통하여, 금속 판재의 적절한 퀜칭 속도를 확보함으로써, 최종 성형품의 성형 품질을 목표 성형 특성에 만족할 수 있도 록 제어할 수 있다. 또한, 또 다른 와전류 센서를 이용하여, 성형이 완료된 성형품의 상기 실제 성형 특성을 비파괴 검사로 평가 하고, 상기 실제 성형 특성이 상기 목표 성형 특성에 미치지 못할 경우, 가열 장치에서 가열된 금속 판재 의 이송 속도 및 프레스 성형 장치에서 상형(M1)이 하강하는 속도 등을 보정하여, 금속 판재의 퀜칭 속도를 적절히 보정함으로써, 복수의 금속 판재의 프레스 성형 중 최종 성형품의 성형 품질을 상기 목표 성형 특성으로 일정하게 유지할 수 있도록 제어할 수 있다. 그러므로, 금속 판재를 이루는 모재의 상기 기계적 물성 및 용접 부위(1a)의 건전성이나, 최종 성형된 성형 품의 상기 실제 성형 특성을 비파괴 검사로 평가하여, 이들 산포에 따른 최적 공정 제어로 핫스탬핑 공정을 관리함으로써, 최종 성형품의 품질 관리를 용이하게 할 수 있는 핫스탬핑 공정 제어 방법을 구현할 수 있다."}
{"patent_id": "10-2022-0161731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 당해 기술분야에서 통상 의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 다른 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2022-0161731", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 핫스탬핑 공정 제어 방법을 순서대로 나타내는 순서도이다. 도 2 및 도 3은 도 1의 핫스탬핑 공정 제어 방법의 각 단계를 개략적으로 나타내는 모식도이다. 도 4는 본 발명의 다른 실시예에 따른 핫스탬핑 공정 제어 방법을 순서대로 나타내는 순서도이다. 도 5는 도 4의 핫스탬핑 공정 제어 방법의 성형품 검사 단계 및 공정 최적화 단계를 보다 상세하게 나타내는 순 서도이다. 도 6은 도 4의 핫스탬핑 공정 제어 방법의 각 단계를 개략적으로 나타내는 모식도이다."}
