{"patent_id": "10-2024-7015078", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0112267", "출원번호": "10-2024-7015078", "발명의 명칭": "델타 증류를 사용한 비디오 프로세싱", "출원인": "퀄컴 인코포레이티드", "발명자": "하비비안 아미르호세인"}}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로세서 구현 방법으로서,적어도 제1 프레임 및 제2 프레임을 포함하는 비디오 데이터 스트림을 수신하는 단계;교사 뉴럴 네트워크(teacher neural network)를 사용하여 상기 제1 프레임으로부터 제1 특징부들을 추출하는 단계;상기 제1 프레임과 상기 제2 프레임 사이의 차이를 결정하는 단계;학생 뉴럴 네트워크(student neural network)를 사용하여 적어도, 상기 제1 프레임과 상기 제2 프레임 사이의상기 차이로부터 제2 특징부들을 추출하는 단계;상기 제1 특징부들 및 상기 제2 특징부들의 합에 기초하여 상기 제2 프레임에 대한 특징부 맵을 생성하는 단계;및상기 제2 프레임에 대한 생성된 상기 특징부 맵에 기초하여 상기 비디오 데이터 스트림의 적어도 상기 제2 프레임에 대한 추론을 생성하는 단계를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제1 프레임은 상기 비디오 데이터 스트림 내의 키 프레임을 포함하고, 상기 제2 프레임은상기 비디오 데이터 스트림 내의 비-키 프레임을 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 비디오 데이터 스트림 내의 상기 제2 프레임과 제3 프레임 사이의 차이를 결정하는 단계;상기 학생 뉴럴 네트워크를 사용하여 적어도, 상기 제2 프레임과 상기 제3 프레임 사이의 상기 차이로부터 제3특징부들을 추출하는 단계;상기 제2 특징부들 및 상기 제3 특징부들의 합에 기초하여 상기 제3 프레임에 대한 특징부 맵을 생성하는 단계;및상기 제3 프레임에 대한 생성된 상기 특징부 맵에 기초하여 상기 비디오 데이터 스트림의 상기 제3 프레임에 대한 추론을 생성하는 단계를 추가로 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 교사 뉴럴 네트워크는 선형 네트워크를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 학생 뉴럴 네트워크는 가중치들을 상기 교사 뉴럴 네트워크에서의 가중치들의 순위보다더 낮은 순위로 분해하도록 구성되는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 학생 뉴럴 네트워크는 하나 이상의 그룹 콘볼루션 계층들을 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 교사 뉴럴 네트워크는 비선형 네트워크를 포함하는, 프로세서 구현 방법.공개특허 10-2024-0112267-3-청구항 8 제1항에 있어서, 상기 학생 뉴럴 네트워크는 상기 교사 뉴럴 네트워크에 대해 감소된 수의 채널들, 감소된 공간해상도, 또는 감소된 양자화 중 하나 이상을 갖는 네트워크를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 제2 특징부들은 상기 제1 프레임과 상기 제2 프레임 사이의 상기 차이와 조합하여 상기제1 프레임으로부터 추가로 추출되는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 학생 뉴럴 네트워크는 상기 제1 프레임과 상기 제2 프레임 사이의 특징부 맵의 실제 변화와 상기 제1 프레임과 상기 제2 프레임 사이의 상기 특징부 맵의 예측된 변화 사이의 차이에 기초하여 손실 함수를 최소화하도록 훈련된 뉴럴 네트워크를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 손실 함수는 상기 학생 뉴럴 네트워크의 복잡도 측정치 및 복수의 후보 모델들에 걸친카테고리 분포에 기초하여 정의된 비용 함수에 추가로 기초하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 추론을 생성하는 단계는 상기 비디오 데이터 스트림의 상기 제2 프레임 내의 하나 이상의객체들을 식별하는 단계를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서, 상기 추론을 생성하는 단계는 상기 비디오 데이터 스트림 내의 대상의 포즈 또는 예측된 모션중 적어도 하나를 추정하는 단계를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서, 상기 추론을 생성하는 단계는 상기 비디오 데이터 스트림을 상기 비디오 데이터 스트림에서 캡처된 상이한 대상들과 연관된 복수의 세그먼트들로 시맨틱으로 세그먼트화하는 단계를 포함하는, 프로세서 구현방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서, 상기 추론을 생성하는 단계는 상기 제2 프레임을 잠재 공간 내의 복수의 코드들로부터의 코드에 맵핑하는 단계를 포함하고, 상기 방법은 상기 제2 프레임이 맵핑되는 상기 잠재 공간 내의 상기 코드에 기초하여 상기 제2 프레임을 수정하는 단계를 추가로 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "프로세서 구현 방법으로서,복수의 비디오 샘플들을 포함하는 훈련 데이터 세트를 수신하는 단계로서, 상기 복수의 비디오 샘플들의 각각의비디오 샘플은 복수의 프레임들을 포함하는, 상기 훈련 데이터 세트를 수신하는 단계;상기 훈련 데이터 세트에 기초하여 교사 뉴럴 네트워크를 훈련시키는 단계;각각의 비디오 샘플 내의 연속적인 프레임들에 대한 특징부 맵들 사이의 예측된 차이들 및 각각의 비디오 샘플내의 상기 연속적인 프레임들에 대한 특징부 맵들 사이의 실제 차이들에 기초하여 학생 뉴럴 네트워크를 훈련시키는 단계; 및상기 교사 뉴럴 네트워크 및 상기 학생 뉴럴 네트워크를 배치하는 단계를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,공개특허 10-2024-0112267-4-상기 교사 뉴럴 네트워크 및 상기 학생 뉴럴 네트워크는 동일한 태스크 특정적 목적 함수를 최소화하도록 훈련되고,상기 태스크 특정적 목적 함수는 비디오 샘플 내의 연속적인 프레임들에 대해 생성된 특징부 맵들의 실제 변화와 예측된 변화 사이의 차이와 연관된 가중 델타 분포 손실 항 및 상기 학생 뉴럴 네트워크에 대한 복잡도 측정치와 연관된 가중 비용 항에 기초하여 정의된 함수를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서, 상기 학생 뉴럴 네트워크를 훈련시키는 단계는 상기 훈련 데이터 세트 내의 비디오 샘플 내의연속적인 프레임들에 대해 생성된 출력들 사이의 실제 차이와 상기 비디오 샘플 내의 상기 연속적인 프레임들에대해 생성된 상기 출력들 사이의 예측된 차이 사이의 손실을 최소화하도록 상기 학생 뉴럴 네트워크를 훈련시키는 단계를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서, 상기 학생 뉴럴 네트워크를 훈련시키는 단계는 상기 학생 뉴럴 네트워크에 대한 복잡도 측정치 및 복수의 후보 모델들에 걸친 카테고리 분포에 기초하여 정의된 비용 함수를 최소화하도록 상기 학생 뉴럴네트워크를 훈련시키는 단계를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서, 상기 교사 뉴럴 네트워크는 선형 네트워크를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제16항에 있어서, 상기 학생 뉴럴 네트워크는 가중치들을 상기 교사 뉴럴 네트워크의 가중치들의 순위보다 더낮은 순위로 분해하도록 구성된 네트워크를 포함하는, 프로세서 구현 방법."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "프로세싱 시스템으로서,실행가능 명령들이 저장된 메모리; 및프로세서를 포함하고, 상기 프로세서는 상기 실행가능 명령들을 실행하여, 상기 프로세싱 시스템으로 하여금,적어도 제1 프레임 및 제2 프레임을 포함하는 비디오 데이터 스트림을 수신하게 하고;교사 뉴럴 네트워크를 사용하여 상기 제1 프레임으로부터 제1 특징부들을 추출하게 하고;상기 제1 프레임과 상기 제2 프레임 사이의 차이를 결정하게 하고;학생 뉴럴 네트워크를 사용하여 적어도, 상기 제1 프레임과 상기 제2 프레임 사이의 상기 차이로부터 제2 특징부들을 추출하게 하고;상기 제1 특징부들 및 상기 제2 특징부들의 합에 기초하여 상기 제2 프레임에 대한 특징부 맵을 생성하게 하고;그리고상기 제2 프레임에 대한 생성된 상기 특징부 맵에 기초하여 상기 비디오 데이터 스트림의 적어도 상기 제2 프레임에 대한 추론을 생성하게 하도록 구성되는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 프로세서는 상기 프로세싱 시스템으로 하여금,상기 비디오 데이터 스트림 내의 상기 제2 프레임과 제3 프레임 사이의 차이를 결정하게 하고;상기 학생 뉴럴 네트워크를 사용하여 적어도, 상기 제2 프레임과 상기 제3 프레임 사이의 상기 차이로부터 제3특징부들을 추출하게 하고;상기 제2 특징부들 및 상기 제3 특징부들의 합에 기초하여 상기 제3 프레임에 대한 특징부 맵을 생성하게 하고;그리고공개특허 10-2024-0112267-5-상기 제3 프레임에 대한 생성된 상기 특징부 맵에 기초하여 상기 비디오 데이터 스트림의 상기 제3 프레임에 대한 추론을 생성하게 하도록 추가로 구성되는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제22항에 있어서, 상기 교사 뉴럴 네트워크는 선형 네트워크를 포함하는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제22항에 있어서, 상기 교사 뉴럴 네트워크는 비선형 네트워크를 포함하고, 상기 학생 뉴럴 네트워크는 상기 교사 뉴럴 네트워크에 대해 감소된 수의 채널들, 감소된 공간 해상도, 또는 감소된 양자화 중 하나 이상을 갖는네트워크를 포함하는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제22항에 있어서, 상기 제2 특징부들은 상기 제1 프레임과 상기 제2 프레임 사이의 상기 차이와 조합하여 상기제1 프레임으로부터 추가로 추출되는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제22항에 있어서, 상기 학생 뉴럴 네트워크는 상기 제1 프레임과 상기 제2 프레임 사이의 특징부 맵의 실제 변화와 상기 제1 프레임과 상기 제2 프레임 사이의 상기 특징부 맵의 예측된 변화 사이의 차이에 기초하여 손실함수를 최소화하도록 훈련된 뉴럴 네트워크를 포함하는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제27항에 있어서, 상기 손실 함수는 상기 학생 뉴럴 네트워크의 복잡도 측정치 및 복수의 후보 모델들에 걸친카테고리 분포에 기초하여 정의된 비용 함수에 추가로 기초하는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "프로세싱 시스템으로서,실행가능 명령들이 저장된 메모리; 및프로세서를 포함하고, 상기 프로세서는 상기 실행가능 명령들을 실행하여, 상기 프로세싱 시스템으로 하여금,복수의 비디오 샘플들을 포함하는 훈련 데이터 세트를 수신하게 하는 것으로서, 상기 복수의 비디오 샘플들의각각의 비디오 샘플은 복수의 프레임들을 포함하는, 상기 훈련 데이터 세트를 수신하게 하고;상기 훈련 데이터 세트에 기초하여 교사 뉴럴 네트워크를 훈련시키게 하고;각각의 비디오 샘플 내의 연속적인 프레임들에 대한 특징부 맵들 사이의 예측된 차이들 및 각각의 비디오 샘플내의 상기 연속적인 프레임들에 대한 특징부 맵들 사이의 실제 차이들에 기초하여 학생 뉴럴 네트워크를 훈련시키게 하고; 그리고상기 교사 뉴럴 네트워크 및 상기 학생 뉴럴 네트워크를 배치하게 하도록 구성되는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제29항에 있어서, 상기 학생 뉴럴 네트워크를 훈련시키기 위해, 상기 프로세서는, 상기 프로세싱 시스템으로 하여금, 상기 학생 뉴럴 네트워크에 대한 복잡도 측정치 및 복수의 후보 모델들에 걸친 카테고리 분포에 기초하여정의된 비용 함수를 최소화하도록 상기 학생 뉴럴 네트워크를 훈련시키게 하도록 구성되는, 프로세싱 시스템."}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시내용의 소정 양태들은 인공 뉴럴 네트워크를 사용하여 비디오 콘텐츠를 프로세싱하기 위한 기법들 및 장 치를 제공한다. 예시적인 방법은 대체적으로, 적어도 제1 프레임 및 제2 프레임을 포함하는 비디오 데이터 스트 림을 수신하는 단계를 포함한다. 교사 뉴럴 네트워크를 사용하여 제1 프레임으로부터 제1 특징부들이 추출된다. 제1 프레임과 제2 프레임 사이의 차이가 결정된다. 학생 뉴럴 네트워크를 사용하여 적어도, 제1 프레임과 제2 프레임 사이의 차이로부터 제2 특징부들이 추출된다. 제1 특징부들 및 제2 특징부들의 합에 기초하여 제2 프레 임에 대한 특징부 맵이 생성된다. 제2 특징부에 대한 생성된 특징부 맵에 기초하여 비디오 데이터 스트림의 적 어도 제2 프레임에 대한 추론이 생성된다."}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원의 교차 참조 본 출원은 2022년 11월 10일자로 출원된 미국 특허 출원 제18/054,274호의 이익 및 그에 대한 우선권을 주장하 고, 이는 2021년 11월 15일자로 출원된 미국 가특허 출원 제63/264,072호의 이익 및 그에 대한 우선권을 주장하며, 이들 각각은 이로써 그 전체가 참고로 통합된다."}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 개시내용의 양태들은 비디오 콘텐츠를 프로세싱하는 것에 관한 것이다. 인공 뉴럴 네트워크들은 비디오 콘텐츠 또는 공간 컴포넌트 및 시간 컴포넌트를 포함하는 다른 콘텐츠에 대해 다양한 동작들을 수행하는 데 사용될 수 있다. 예를 들어, 인공 뉴럴 네트워크들은, 비디오 콘텐츠를 더 작은 크기의 표현으로 압축하여 저장 및 송신의 효율을 개선하기 위해, 그리고 비디오 콘텐츠에 대한 의도된 사용(예 컨대, 디바이스의 디스플레이의 크기에 대한 데이터의 적절한 해상도)을 매칭시키기 위해 사용될 수 있다. 이 러한 콘텐츠의 압축은 데이터의 압축해제 버전이 압축되었던 오리지널 데이터의 근사치가 되도록 손실 기법들을 사용하여, 또는 데이터의 압축해제 버전이 오리지널 데이터와 등가인(또는 적어도 시각적으로 등가인) 결과를 초래하는 무손실 기법들을 사용함으로써 수행될 수 있다. 다른 예에서, 인공 뉴럴 네트워크들은 비디오 콘텐츠 내의 객체들을 검출하는 데 사용될 수 있다. 객체 검출은, 예를 들어, 비디오 콘텐츠 내의 이동 대상을 식별하 기 위해 그리고 대상이 미래에 어떻게 이동할지를 예측하기 위해 사용되는 대상 포즈 추정; 비디오 콘텐츠 내의 관심 객체들을 식별하기 위한 객체 분류; 등등을 포함할 수 있다. 대체적으로, 비디오 콘텐츠의 시간 컴포넌트는 비디오 콘텐츠 내의 상이한 프레임들에 의해 표현될 수 있다. 인공 뉴럴 네트워크들은 인공 뉴럴 네트워크의 각각의 계층을 통해 비디오 콘텐츠 내의 프레임들을 독립적으로 프로세싱할 수 있다. 따라서, 인공 뉴럴 네트워크들을 통한 비디오 프로세싱의 비용은 비디오 콘텐츠 내의 정 보가 성장하는 레이트와는 상이한 (그리고 그보다 더 높은) 레이트로 성장할 수 있다. 즉, 비디오 콘텐츠 내의 연속적인 프레임들 사이에는, 각각의 프레임 사이에 작은 변화들이 있을 수 있는데, 이는 상이한 프레임들 사이 의 경과된 시간 동안 단지 소량의 데이터만이 변화할 수 있기 때문이다. 그러나, 뉴럴 네트워크들이 대체적으 로 각각의 프레임을 독립적으로 프로세싱하기 때문에, 인공 뉴럴 네트워크들은 대체적으로 프레임들 사이의 반 복된 데이터(예컨대, 변화하지 않는 장면의 부분들)를 프로세싱하는데, 이는 매우 비효율적이다. 소정 양태들은 인공 뉴럴 네트워크를 사용하여 비디오 콘텐츠를 프로세싱하기 위한 방법을 제공한다. 예시적인 방법은 대체적으로, 적어도 제1 프레임 및 제2 프레임을 포함하는 비디오 데이터 스트림을 수신하는 단계를 포 함한다. 교사 뉴럴 네트워크(teacher neural network)를 사용하여 제1 프레임으로부터 제1 특징부들이 추출된 다. 제1 프레임과 제2 프레임 사이의 차이가 결정된다. 학생 뉴럴 네트워크(student neural network)를 사용 하여 적어도, 제1 프레임과 제2 프레임 사이의 차이로부터 제2 특징부들이 추출된다. 제1 특징부들 및 제2 특 징부들의 합에 기초하여 제2 프레임에 대한 특징부 맵이 생성된다. 제2 특징부에 대한 생성된 특징부 맵에 기 초하여 비디오 데이터 스트림의 적어도 제2 프레임에 대한 추론이 생성된다. 소정 양태들은 비디오 콘텐츠를 프로세싱하기 위해 인공 뉴럴 네트워크를 훈련시키기 위한 방법을 제공한다. 예시적인 방법은 대체적으로, 복수의 비디오 샘플들을 포함하는 훈련 데이터 세트를 수신하는 단계를 포함한다. 각각의 비디오 샘플은 복수의 프레임들을 포함할 수 있다. 훈련 데이터 세트에 기초하여 교사 뉴럴 네트워크가 훈련되고, 각각의 비디오 샘플 내의 연속적인 프레임들에 대한 특징부 맵들 사이의 예측된 차이들 및 각각의 비 디오 샘플 내의 연속적인 프레임들에 대한 특징부 맵들 사이의 실제 차이들에 기초하여 학생 뉴럴 네트워크가 훈련된다. 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크가 배치된다. 다른 양태들은 전술한 방법들뿐만 아니라 본 명세서에 설명된 방법들을 수행하도록 구성된 프로세싱 시스템들; 프로세싱 시스템의 하나 이상의 프로세서들에 의해 실행될 때, 프로세싱 시스템으로 하여금, 전술한 방법들뿐만 아니라 본 명세서에 설명된 방법들을 수행하게 하는 명령들을 포함하는 비일시적 컴퓨터 판독가능 매체들; 상기 언급된 방법들뿐만 아니라 본 명세서에 추가로 설명된 것들을 수행하기 위한 코드를 포함하는 컴퓨터 판독가능 저장 매체 상에 구현되는 컴퓨터 프로그램 제품; 및 상기 언급된 방법들뿐만 아니라 본 명세서에 추가로 설명된 것들을 수행하기 위한 수단을 포함하는 프로세싱 시스템을 제공한다. 아래의 설명 및 관련된 도면들은 하나 이상의 양태들의 특정 예시적인 특징들을 상세히 기재한다."}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시내용의 양태들은 인공 뉴럴 네트워크들을 사용하여 비디오 콘텐츠를 효율적으로 프로세싱하기 위한 기법 들을 제공한다. 논의된 바와 같이, 인공 뉴럴 네트워크들은 비디오 콘텐츠에 대해 다양한 추론 동작들을 수행하는 데 사용될 수 있다. 이러한 추론들은, 예를 들어, 다양한 압축 스킴들, 객체 검출, 컴퓨터 비전 동작들, 다양한 이미지 프로 세싱 및 수정 동작들(예컨대, 업사이징, 잡음제거 등) 등에서 사용될 수 있다. 그러나, 인공 뉴럴 네트워크들 은 비디오 콘텐츠 내의 각각의 비디오 프레임을 독립적으로 프로세싱할 수 있다. 따라서, 이러한 인공 뉴럴 네 트워크들은 비디오 콘텐츠 내의 프레임들에 걸쳐 다양한 리던던시들을 레버리징하지 않을 수 있다. 뉴럴 네트워크를 훈련시키고 훈련된 뉴럴 네트워크를 사용하여 추론들을 수행하는 것은 계산적으로 복잡한 태스 크일 수 있고, 계산 복잡도는 뉴럴 네트워크의 정확도로 스케일링될 수 있다. 즉, 정확한 모델들은 훈련시키고 사용하기에 계산적으로 더 복잡할 수 있는 반면, 덜 정확한 모델들은 훈련시키고 사용하기에 계산적으로 덜 복 잡할 수 있다. 인공 뉴럴 네트워크들에서 정확도를 유지하면서 계산 복잡도의 개선을 허용하기 위해, 데이터의 리던던시들이 이용될 수 있다. 예를 들어, 채널 리던던시는 가중치들이 다양한 에러 항들에 기초하여 프루닝 (prune)될 수 있게 하여, (예컨대, 이미지 데이터의 컬러 채널과 같은 특정 채널에 대한) 추론에 대해 최소의 영향을 미치거나 전혀 미치지 않는 가중치들이 훈련된 뉴럴 네트워크로부터 제거되고; 양자화가 더 작은 비트 폭들을 사용하여 가중치들을 표현하는 데 사용될 수 있고; 단수 값 분해가 더 콤팩트한 표현들을 갖는 가중치 매트릭스들을 근사화하는 데 사용될 수 있도록 할 수 있다. 다른 예에서, 공간 리던던시는 공간 도메인에서 유 사성들을 이용하는 데 사용될 수 있다. 또 다른 예에서, 학생 뉴럴 네트워크가 교사 뉴럴 네트워크의 특징부 출력과 매칭하도록 훈련되는 지식 증류가 사용될 수 있다. 그러나, 이러한 기법들은 비디오 콘텐츠 또는 시간 컴포넌트를 포함하는 다른 콘텐츠에서 시간 리던던시들을 레버리징하지 않을 수 있다. 본 개시내용의 양태들은 뉴럴 네트워크를 훈련시키고 뉴럴 네트워크를 사용하여, 비디오 콘텐츠 또는 시간 컴포 넌트를 포함하는 다른 콘텐츠에 대한 추론들을 생성하기 위해 비디오 콘텐츠 또는 시간 컴포넌트를 포함하는 다 른 콘텐츠에서 시간 리던던시들을 레버리징하는 기법들을 제공한다. 이러한 시간 리던던시들은 비디오 콘텐츠 또는 시간 컴포넌트를 갖는 다른 콘텐츠의 연속적인 부분들 사이의 차이 또는 델타에 의해 표현될 수 있다. 비 디오 콘텐츠 또는 시간 컴포넌트를 갖는 다른 콘텐츠의 연속적인 부분들로부터 증류된 델타들에 기초하여 뉴럴 네트워크를 훈련시키고 이러한 훈련된 뉴럴 네트워크를 사용하여 추론들을 수행함으로써, 본 개시내용의 양태들 은, 뉴럴 네트워크를 훈련시키고 뉴럴 네트워크를 사용하여 추론들을 수행하는 데 사용되는 데이터의 양을 감소 시킬 수 있다. 이것은 뉴럴 네트워크를 훈련시키고 뉴럴 네트워크를 사용하여 추론들을 수행하는 프로세스를가속화할 수 있는데, 이는 이러한 동작들에서 사용되는 프로세싱 사이클들 및 메모리의 수를 감소시킬 수 있고, 훈련 및 추론 동작들에서 사용되는 전력의 양을 감소시킬 수 있고, 등등을 할 수 있다. 인공 뉴럴 네트워크들에서의 예시적인 델타 증류 도 1은 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크를 포함하는 예시적인 증류 아키텍처를 도시한다. 교사 -학생 뉴럴 네트워크 패러다임에서, 이하에서 더 상세히 논의되는 바와 같이, 교사 뉴럴 네트워크는 학생 뉴럴 네트워크보다 더 큰 네트워크일 수 있고, 교사 뉴럴 네트워크에 의해 학습된 데이터는 데이터 증류 기법들을 사 용하여 학생 네트워크를 훈련시키는 데 사용될 수 있다. 예시된 바와 같이, 증류 아키텍처는 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크를 포함한다. 교사 뉴럴 네트워크는 대체적으로, a개의 계층들을 포함하고, 학생 뉴럴 네트워크는 b개의 계층들을 포함한다(이는 하기에서 더 상세히 논의되는 바와 같이, a보다 더 큰 수일 수 있음). 입력이 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크 둘 모두에 제공될 수 있고, 특징부들 사이의 증류 손실이 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크에 의해 생성된다. 교사 뉴럴 네트워크는 하기의 수학식에 따라, L개의 파라미터 블록들의 조합인 포괄적인 백본 F로서 표현 될 수 있다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "각각의 파라미터 블록은 입력을 출력 z에 맵핑할 수 있다. 대체적으로, l-번째 파라미터 블록의 경우, 이러한 블록에 의해 생성된 출력은 하기의 수학식에 따라 표현될 수 있다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": ", 여기서 x는 파라미터 블록 내로의 입력을 표현하고, 은 파라미터 블록의 학습가능 파라미터들을 표현한다. 백본 F를 고려하면, 추론들을 훈련시키고 수행하는 계산 비용을 감소시키기 위한 기법은 지식 증류를 포함한다. 이러한 예에서, 백본 F에서의 각각의 은 학습가능 파라미터들 을 갖는 별개의 학생 뉴럴 네트워크 에 대 한 감시 신호로서 사용될 수 있는 타깃 특징부 맵을 제공하는 교사 뉴럴 네트워크로서 처리될 수 있다. 학생 뉴럴 네트워크는, 예컨대, 파라미터들의 감소들, 계층들의 감소들, 다운사이징 또는 다른 입력 스케일링을 통해 학생 뉴럴 네트워크에서 프로세싱되는 데이터의 양의 감소들 등을 통해, 교사 뉴럴 네트워크보다 더 낮은 계산 복잡도 및 이에 따라 더 낮은 계산 비용을 갖도록 설계될 수 있다. 학생 뉴럴 네트워크를 훈련시키는 데 사용 되는 증류 목적은, 예를 들어, 하기의 수학식에 따라 과 사이의 에러의 예상 표준(norm)을 최적화하 려고 노력할 수 있다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "비디오 콘텐츠와 같이 시간 컴포넌트를 갖는 데이터의 경우, 각각의 은 시간 t에, 입력 xt를 출력 zt에 맵핑 하는 것으로서 간주될 수 있다. 또한, 함수의 테일러 확장에 따라, 현재 출력은 이전 출력에 대한 부가적인 업 데이트로서(예컨대, zt-1에 대한 부가적인 업데이트로서) 표현될 수 있다. 따라서, 출력 zt는 수학식 로서 표현될 수 있고, 따라서, zt와 zt-1 사이의 델타(또는 차이)는 수학식 에 의해 표현될 수 있다. 또한, 많은 함수들의 경우, f'는 f보다 더 적은 파라미터들을 가질 수 있는데, 이는 시간 t와 시간 t - 1에서의 프레임들 사이의 변화들이 더 압축가능할 수 있고 특징부 공간 내의 유사한 영역에놓일 수 있음을 표시할 수 있다는 것에 유의할 수 있다. 도 2는 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크가 시간적으로 분리된 상이한 비디오 프레임들 사 이의 차이(또는 델타)를 증류하도록 훈련되는 일례를 예시한다. 예시된 바와 같이, 상기에서 논의된 함수 f에 의해 표현되는 교사 뉴럴 네트워크 및 상기에서 논의된 함수 g에 의해 표현되는 학생 뉴럴 네트워크 는 입력으로서 2개의 비디오 프레임들 xt-1 및 xt(예컨대, 타임스탬프 t를 갖는 현재 프레임 및 타임스탬프 t - 1을 갖는 이전 프레임)를 수신할 수 있다. 교사 뉴럴 네트워크는 xt-1 및 xt 둘 모두에 대한 특징부 맵을 생성할 수 있고, 로서 표현되는 입력들 xt-1과 xt 사이의 차이를 표현하는, 시간 t에서의 차등 특징부 맵을 생성할 수 있다. 학생 뉴럴 네트워크는 유사하게 입력으로서 2개의 비디오 프레임들 xt-1 및 xt를 수신할 수 있고, 비디오 프레임들 xt-1 및 xt에 대해 생성된 특징부 맵들 사이의 차이를 예측하도록 훈련될 수 있으며, 예측된 차이는 로서 표현된다. (교사 뉴럴 네트워크의 출력이 실측 자료(ground truth data)로서 처리 됨을 고려하여) 학생 뉴럴 네트워크가 를 정확하게 생성할 수 있게 하기 위해, 학생 뉴럴 네트워크 는 실제 차이 와 예측된 차이 사이의 손실 함수 을 최소화하도록 훈련될 수 있다. 프레임 xt가 프레임 xt-1 및 부가적인 델타의 합으로서 표현될 수 있기 때문에, 마찬가지로 프레임 맵 zt는 하기 의 수학식에 따라, 특징부 맵 zt-1(예컨대, 프레임 xt-1에 대한 특징부 맵) + 부가적인 델타의 합으로서 표현될 수 있다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": ", 여기서 는 입력 xt-1의 주어진 시간 변화에 대한 출력 의 변화를 특징으 로 하는 부가적인 델타를 표현한다. 보다 대체적으로, 부가적인 델타는 하기의 수학식에 따라, 현재 및 이전 입력들의 함수로서 정의될 수 있는데, 이는 학생 뉴럴 네트워크에 의해 근사화될 수 있으며, 이때 파라미 터들은 이다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": ". 도 3은 본 개시내용의 양태들에 따른, 비디오 콘텐츠 내의 프레임들 사이의 변화들에 기초하여 교사 뉴럴 네트 워크 및 학생 뉴럴 네트워크를 포함하는 뉴럴 네트워크를 사용한 훈련 및 추론의 일례를 예시한 다. 예시된 바와 같이, 함수 fl에 의해 표현된 교사 뉴럴 네트워크는 임의의 주어진 입력 비디오 프레임 x에 대한 특징부 맵 z를 생성하도록 훈련될 수 있다. 교사 뉴럴 네트워크에 의해 생성된 특징부 맵 z는 학생 뉴럴 네트워크를 훈련시키기 위한 실측 자료 데이터로서 처리될 수 있다. 교사 뉴럴 네트워크는 입 력으로서 프레임 x를 수신할 수 있는 반면, 학생 뉴럴 네트워크는 입력으로서 상이한 프레임들 사이의 차 이 를 수신할 수 있다. 주어진 시간 t + n에서, 학생 뉴럴 네트워크 내로의 입력으로서 사용되는 프레임들 사이의 차이는 로서 표현될 수 있으며, 여기서 t는 추론들이 수행되는 기본 프레임(예컨대, 비디오 데이터 스트림 내의 키 프레임)과 연관된 타임스탬프를 표현하고, n은 타임스탬프 t와 프레임 xt+n과 연관된 타임스탬프 사이의 차이를 표현한다. 학생 뉴럴 네트워크는, 학생 뉴럴 네트워크가 입력으로서 시간 데이터 내의 상이한 샘플들(예컨대, 상이한 비디오 프레임들) 사이의 잔차 값을 수신하는 하나 이상의 선형 블록들로서 표현될 수 있다. 그러한 경우, 학 생 뉴럴 네트워크는 수학식 에 의해 표현될 수 있는데, 이는 근사치 내의 1차 항일 수 있고, 0(zero)이 아닌 항일 수 있다. 파생물 은 상수이며, 여기서 는 선형이다. 다른 예에서, 학생 뉴럴 네트워크는 하나 이상의 비선형 블록들에 의해 표현될 수 있다. 그러한 경우, 학생 뉴럴 네트워크는 시간 t에서 입력으로서, 이전 입력 및 잔차 값 둘 모두를 수신할 수 있다. 대체적으로, 학생 뉴럴 네트워크의 구조는 채널 감소 전략 또는 공간 감소 전략에 기초하여 선택될 수 있 다. 채널 감소 전략에서, 학생 뉴럴 네트워크는 구조에서 교사 뉴럴 네트워크를 미러링할 수 있지만, 교사 뉴럴 네트워크보다 더 적은 채널들을 가질 수 있다. 다수의 포인트별 콘볼루션들이 제1 계 층 및 마지막 계층으로서 학생 뉴럴 네트워크 내의 블록들에 도입될 수 있는데, 이들은 각각 채널들의 수 를 축소 및 확대할 수 있다. 공간 감소 전략에서, 학생 뉴럴 네트워크는 교사 뉴럴 네트워크와 유사 할 수 있다. 그러나, 학생 뉴럴 네트워크는 입력 비디오 프레임들에 대해 더 작은 공간 해상도를 사용하 여 동작할 수 있는데, 이는 학생 뉴럴 네트워크에서 제1 계층으로서 도입된 포인트별 스트라이드형 콘볼루 션 계층(예컨대, 1 × 1 커널을 사용하고 입력 비디오 프레임의 상이한 부분들 사이에 간격이 있는 콘볼루션 계 층) 및 학생 뉴럴 네트워크에서 마지막 계층으로서 도입된 픽셀 셔플 업샘플링 계층을 통해 달성될 수 있 다. 교사 뉴럴 네트워크에 의해 구현된 백본 모델 F 내에서, 상이한 계층들이 상이한 규모들로 압축가능할 수 있다. 예를 들어, 일부 계층들은 압축가능(또는 증류가능)하지 않을 수 있는데, 이러한 계층들이 교사 뉴럴 네 트워크의 성능을 완전히 손상시킬 수 있기 때문이다. 따라서, 학생 뉴럴 네트워크 은 2개의 후보 네트 워크들 중에서 선택될 수 있으며, 여기서 은 교사 뉴럴 네트워크와 동일한 계산 비용(예컨대, 압축 없이 프레임들 사이의 델타를 증류함)으로 동작하는 학생 뉴럴 네트워크를 표현하고, 은 일부 타깃 인자에 의 해 계산적으로 더 저렴하다. 2개의 후보 네트워크들 중 더 적합한 것을 표현하는 학습가능 바이어스 가 도입될 수 있다. 이러한 학습가능 바이어스 은, 예를 들어 Gumbel-softmax 재파라미터화 (reparametrization) 추정 그래디언트들을 사용하여 그래디언트 하강에 의해 학습될 수 있다. 델타 증류 블록은 특정 응용을 위한 비디오 모델을 최적화하는 데 사용될 수 있다. 태스크 특정적 목적 함수 가 정의될 수 있으며, 여기서 은 교사 뉴럴 네트워크에 의해 구현된 백본 모델 F의 파라미터들을 표현한다. 훈련 동안, 는 비디오 클립들을 훈련시키는 것에 최적화될 수 있으며, 여기서 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크 둘 모두는 예측들에 기여한다. 교사 뉴럴 네트워크(31 0)는 초기 프레임에 대한 출력 z(예컨대, 특징부 맵)를 예측하는 것에 기여할 수 있고, 학생 뉴럴 네트워크 는 남은 프레임들에 대한 출력 z를 예측하는 것에 기여할 수 있다.델타 증류를 (예컨대, 델타 증류 블록을 통해) 최적화하기 위해, 각각의 블록 은 타깃 델타 를 학생 블록 에 제공함으로써 대응하는 학생 블록 의 학습을 감시하는 교사로서 지정될 수 있다. 그렇게 하기 위해, 델타 분포 손실 가 델타 증류 블록에서 최소화될 수 있다. 델타 분포 손실 는 zt의 진정한 변화들과 학생 블록 에 의해 모델링된 변화들 사이의 목적에 의해 정의될 수 있고, 하기의 수학식에 의해 표현될 수 있다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "가능한 경우, 학생 뉴럴 네트워크로서 낮은 계산 비용 후보 네트워크(예컨대, )의 사용을 촉진하기 위해 복잡 도 목적이 추가로 도입될 수 있다. 대체적으로, 최소 압축된 학생이 더 높은 용량 및 더 양호한 델타 증류 용 량들을 가지므로, 정규화되지 않은 바이어스 항이 최소 압축된 학생 네트워크(예컨대, )의 선택에 수렴할 수 있기 때문에, 비용 함수가 최적화될 수 있다. 비용 함수는 하기의 수학식에 의해 표현될 수 있다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "여기서 는 학생 뉴럴 네트워크에 대한 복잡도 측정치를 표현하고, 은 후보 네트워크들 에 걸친 카테고리 분포를 표현하는데, 이는 을 입력으로서 소프트맥스 계층에 제공함으로써 획득될 수 있다. 및 의 최소화(또는 적어도 감소)는 비용과 성능 사이의 최상의 절충점을 산출하는 후보 네트워크를 향해 학생 네트워크 검색을 안내할 수 있다. 궁극적으로, 학생 뉴럴 네트워크를 선택하는 데 있어서 최적화될 전체 목적 은 하기의 수학식에 의해 표현될 수 있다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": ", 여기서 및 는 , , 및 를 밸런싱하는 하이퍼파라미터들이고, 합산들은 교사 뉴럴 네트워크 내의 각각의 블록들 L에 걸쳐 어그리게이팅된다. 대체적으로, 학생 뉴럴 네트워크를 훈련시키는 과정에 걸쳐, 증류된 델타들은 교사 델타들에 수렴할 것이다. 태스크 손실의 그래디언트들이 시간 경과에 따라 교사 뉴럴 네트워크로 역전파되기 때문에, 이러한 태스크 손실 그래디언트들은 학생 뉴럴 네트워크에 의해 부가적으로 업데이트될 수 있는 제1 프레임에 대 한 표현들을 제공할 수 있다. 따라서, 태스크 손실 그래디언트들은 교사에게 업데이트하기에 더 용이한 표현들 을 제공할 것을 프롬프트할 수 있는데, 이는 네트워크 내의 시간적 일관성을 개선할 수 있다. 또한, 본 명세서 에서 설명된 기법들은 교사 뉴럴 네트워크에서 구현된 백본 F를 재현 모델로 컨버팅할 수 있는데, 이는 교 사 뉴럴 네트워크가 일 시점으로부터 다른 시점까지 출력들을 전파할 수 있기 때문이며, 이는 교사 뉴럴 네트워 크 및 학생 뉴럴 네트워크를 포함하는 파이프라인에서 시간적 일관성을 추가로 개선한다. 도 4는 본 개시내용의 양태들에 따른, 비디오 콘텐츠 내의 프레임들 사이의 변화들에 기초하여 뉴럴 네트워크를 사용하여 비디오 콘텐츠에 대한 추론을 수행하는 일례를 예시한다. 비디오 콘텐츠에 대해 추론들을 수행하기 위해, 교사 뉴럴 네트워크 및 하나 이상의 학생 뉴럴 네트워크들 은 비디오 콘텐츠 내의 프레임들을 프로세싱하는 데 사용될 수 있다. 대체적으로, 비디오 데이터의 주어 진 입력에 대해 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크(들)에 의해 생성된 출력은 하기의 수학식 에 따라 표현될 수 있다:"}
{"patent_id": "10-2024-7015078", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "교사 뉴럴 네트워크는 키 프레임과 같은 지정된 초기 프레임을 프로세싱할 수 있고, 이러한 키 프레임으로 부터, 키 프레임에 대한 차이에 관하여 후행 프레임들이 정의된다. 한편, 학생 뉴럴 네트워크(들)는 프레 임과 선행 프레임 사이의 델타에 적어도 부분적으로 기초하여 비디오 콘텐츠 내의 다른 프레임들을 프로세싱할 수 있다. 즉, 시간 t에서의 프레임 xt에 대해, 교사 뉴럴 네트워크는 특징부 맵 zt를 생성할 수 있다. 시 간 t + 1에서의 프레임 xt+1에 대해, 델타 은 프레임들 xt와 xt+1 사이의 차이로서 계산될 수 있다. 이어서, 학생 뉴럴 네트워크는 에 대한 특징부 맵 및 프레임 xt에 대한 특징부 맵 에 기초하 여 근사적인 특징부 맵을 생성할 수 있다. 프레임 xt+1에 대한 근사적인 특징부 맵 은 특징부 맵 및 의 합으로서 계산될 수 있다. 유사하게, 학생 뉴럴 네트워크는 및 의 합으로서 프레임들 xt+1과 xt+2 사이의 차이에 대한 근사적인 특징부 맵 를 생성할 수 있다. 이것은 임의의 수의 비디오 프레 임들 x에 대해 계속될 수 있다. 예를 들어, 비디오 콘텐츠에서 새로운 키 프레임에 직면할 때까지 델타 증류를 사용하여 프레임들에 대해 특징부 맵들이 생성될 수 있다. 이러한 새로운 키 프레임은 교사 뉴럴 네트워크 , 및 다음 키 프레임이 학생 뉴럴 네트워크를 사용하여 프로세싱될 수 있을 때까지의 후속 프레임들 을 사용하여 프로세싱될 수 있다. 델타 증류 및 교사 및 학생 뉴럴 네트워크들을 사용한 비디오 프로세싱을 위한 예시적인 방법들 도 5는 본 개시내용의 소정 양태들에 따른, 연속적인 비디오 프레임들로부터 증류된 델타들(또는 비디오 콘텐츠 내의 프레임들 사이의 차이들)에 기초하여 비디오 콘텐츠에 대한 추론들을 수행하기 위해 뉴럴 네트워크를 훈련 시키도록 시스템에 의해 수행될 수 있는 예시적인 동작들을 예시한다. 동작들은, 예를 들어, 기계 학습 모델을 훈련시키고 비디오 데이터로부터 추론들을 생성하는 데 사용하기 위한 다른 디바이스에 기계 학습 모델을 배치할 수 있는 컴퓨팅 디바이스(예컨대, 도 7에 예시된 프로세싱 시스템)에 의해 수행될 수 있다. 예시된 바와 같이, 동작들은 블록에서 시작하며, 여기서 훈련 데이터 세트가 수신된다. 대체적으로, 훈련 데이터 세트는 복수의 비디오 샘플들을 포함할 수 있고, 복수의 비디오 샘플들의 비디오 샘플 각각은 복수 의 프레임들을 포함할 수 있다. 각각의 비디오 샘플들에 대한 복수의 프레임들 내에서, 하나 이상의 프레임들 은 키 프레임들로서 지정될 수 있고, 제1 키 프레임 뒤와 제2 키 프레임 앞의 프레임들은 제1 키 프레임에 대한 차이들에 기초하여 정의될 수 있다. 블록에서, 훈련 데이터 세트에 기초하여 교사 뉴럴 네트워크가 훈련된다. 대체적으로, 교사 뉴럴 네트워 크를 훈련시키는 데 있어서, 교사 뉴럴 네트워크는 복수의 비디오 샘플들 각각 내의 각각의 프레임에 대한 특징 부 맵을 생성하도록 훈련될 수 있다. 교사 뉴럴 네트워크는, 예를 들어, L개의 파라미터 블록들의 백본 F로서 표현될 수 있고, 하기의 수학식에 따라 출력 z를 생성할 수 있다: , 여기서 x는 (예컨대, 비디오 샘플 내의 프레임의) 입력을 표현한다.블록에서, 학생 뉴럴 네트워크가 훈련된다. 대체적으로, 각각의 비디오 샘플 내의 연속적인 프레임들에 대한 특징부 맵들 사이의 예측된 차이들 및 각각의 비디오 샘플 내의 연속적인 프레임들에 대한 특징부 맵들 사 이의 실제 차이들에 기초하여 학생 뉴럴 네트워크가 훈련될 수 있다. 일부 양태들에서, 교사 및 학생 뉴럴 네트워크들은 동일한 태스크 특정적 목적 함수를 최소화하도록 훈련될 수 있다. 태스크 특정적 목적 함수는, 예를 들어, 교사 뉴럴 네트워크에 의해 구현된 모델의 복수의 파라미터들 각각에 기초한 목적 함수일 수 있다. 태스크 특정적 목적 함수는 가중 델타 분포 손실 항 및 가중 비용 항에 기초하여 정의될 수 있다. 예를 들어, 태스크 특정적 목적 함수는 수학식 에 의해 표현될 수 있다. 델타 분포 손실 항 는 비디오 샘플 내의 연속적인 프레임들에 대해 생성된 특징부 맵들의 실제 변화와 예측된 변화 사이의 차이와 연관될 수 있고, 비용 항 은 학생 뉴럴 네트워 크에 대한 복잡도 측정치와 연관될 수 있다. 일부 양태들에서, 학생 뉴럴 네트워크를 훈련시키는 것은 델타 증류 손실을 최소화하도록 학생 뉴럴 네트워크를 훈련시키는 것을 포함할 수 있다. 델타 증류 손실은 대체적으로, 훈련 데이터 세트 내의 비디오 샘플 내의 연 속적인 프레임들에 대해 생성된 출력들(예컨대, 교사 뉴럴 네트워크에 의해 생성됨) 사이의 실제 차이와, 비디 오 샘플 내의 연속적인 프레임들에 대해 생성된 출력들(예컨대, 학생 뉴럴 네트워크에 의해 생성됨) 사이의 예 측된 차이 사이의 차이를 표현할 수 있다. 일부 양태들에서, 학생 뉴럴 네트워크를 훈련시키는 것은 학생 뉴럴 네트워크에 대한 복잡도 측정치 및 복수의 후보 모델들에 걸친 카테고리 분포에 기초하여 정의된 비용 함수를 최소화하도록 학생 뉴럴 네트워크를 훈련시 키는 것을 포함할 수 있다. 예를 들어, 학생 뉴럴 네트워크를 훈련시키는 것은 계산 복잡도가 교사 뉴럴 네트 워크와 매칭되는 제1 뉴럴 네트워크 및 감소된 복잡도를 갖는 제2 뉴럴 네트워크에 대한 복잡도 측정치에 기초 할 수 있다. 블록에서, 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크가 배치된다. 예를 들어, 교사 뉴럴 네트워크 및 학 생 뉴럴 네트워크는 무선 네트워크 내의 사용자 장비(UE), 컴퓨터 비전 능력들에 적어도 부분적으로 기초하여 동작하는 자율 주행 능력들을 갖는 차량 등과 같은, 캡처된 비디오 데이터에 대해 추론들을 수행하는 디바이스 에 배치될 수 있다. 이러한 추론들은, 예를 들어, 압축을 위한 잠재 공간 내로의 콘텐츠의 인코딩, 비디오 콘 텐츠에서의 객체 검출, 대상 포즈 추정 및 이동 예측, 상이한 세그먼트들로의 비디오 콘텐츠의 시맨틱 세그먼트 화 등을 포함할 수 있다. 도 6은 본 개시내용의 소정 양태들에 따른, 연속적인 비디오 프레임들로부터 증류된 델타들에 기초하여 비디오 콘텐츠를 프로세싱하도록 훈련된 뉴럴 네트워크를 사용하여 비디오 콘텐츠에 대한 추론을 수행하기 위한 예시적 인 동작들을 예시한다. 동작들은, 예를 들어, 사용자 장비(UE), 자율 차량 등과 같은, 교사 뉴럴 네 트워크 및 학생 뉴럴 네트워크가 배치되는 디바이스(예컨대, 도 8에 예시된 프로세싱 시스템)에 의해 수행 될 수 있다. 예시된 바와 같이, 동작들은 블록에서 시작할 수 있으며, 여기서 비디오 데이터 스트림이 수신된다. 대체적으로, 비디오 데이터 스트림은 키 프레임 및 하나 이상의 비-키 프레임들을 포함할 수 있다. 키 프레임 은, 추론들이 수행되는 초기 기반으로서 뉴럴 네트워크에 의해 사용되는 프레임일 수 있고, 연속적인 프레임들 사이의 차이들에 기초하여 비-키 프레임들에 대한 추론들을 수행할 수 있다. 블록에서, 교사 뉴럴 네트워크를 사용하여 제1 프레임으로부터 제1 특징부들이 추출될 수 있다. 제1 프레 임은, 논의된 바와 같이, 비디오 콘텐츠 내의 다른 프레임들이 도출되는(예컨대, 제1 프레임에 적용되는 차이에 관하여 정의되는) 초기 프레임 또는 키 프레임일 수 있다. 블록에서, 제1 프레임과 제2 프레임 사이의 차이가 결정된다. 대체적으로, 제1 프레임과 제2 프레임 사이 의 차이는 제1 프레임 및 제2 프레임의 각각의 픽셀의 변화에 관한 정보를 포함하여, 제1 프레임 및 결정된 차 이의 조합이 제2 프레임을 생성하도록 할 수 있다. 블록에서, 학생 뉴럴 네트워크를 사용하여 적어도, 제1 프레임과 제2 프레임 사이의 차이로부터 제2 특징 부들이 추출된다. 대체적으로, 제2 특징부들은 제2 프레임에 대해 교사 뉴럴 네트워크에 의해 추출되었을 특징 부들과 제1 특징부들 사이의 차이의 근사치일 수 있다. 일부 양태들에서, 제2 특징부들은 제1 프레임과 제2 프레임 사이의 차이와 함께 제1 프레임으로부터 추가로 추출될 수 있다. 블록에서, 제1 특징부들 및 제2 특징부들의 합에 기초하여 제2 프레임에 대한 특징부 맵이 생성된다. 논 의된 바와 같이, 제1 특징부들은 대체적으로, 그 전체가 제1 프레임으로부터 추출된 특징부들의 세트일 수 있고, 제2 특징부들은 제1 프레임과 제2 프레임 사이의 차이로부터 추출된 특징부들의 세트일 수 있다. 제2 프 레임이 제1 프레임과 제2 프레임 사이의 차이와 제1 프레임의 합으로서 표현될 수 있기 때문에, 제2 프레임을 표현하는 특징부 맵은 마찬가지로, 제1 특징부들(제1 프레임으로부터 추출됨) 및 제2 특징부들(제1 프레임과 제 2 프레임 사이의 차이로부터 추출됨)의 합으로서 표현될 수 있다. 블록에서, 제2 프레임에 대한 생성된 특징부 맵에 기초하여 비디오 데이터 스트림의 적어도 제2 프레임에 대한 추론이 생성된다. 일부 양태들에서, 추론을 생성하는 것은 제2 프레임 내의 하나 이상의 객체들을 식별하 는 것을 포함할 수 있다. 일부 양태들에서, 추론을 생성하는 것은 비디오 데이터 스트림 내의 대상의 포즈 및/ 또는 예측된 모션을 추정하는 것을 포함할 수 있다. 포즈 추정 및 예측된 모션은 후속적으로, 예를 들어, 자율 모터 차량과 대상 사이의 충돌을 회피하기 위해 비디오 콘텐츠에 기록된 대상의 예측된 모션에 반응하도록 자율 모터 차량을 제어하는 데 사용될 수 있다. 다른 양태에서, 추론을 생성하는 것은 비디오 데이터 스트림을 복수 의 세그먼트들로 시맨틱으로 세그먼트화하는 것을 포함할 수 있다. 예를 들어, 비디오 데이터 스트림은 비디오 스트림에 캡처된 상이한 대상들과 연관된 하나 이상의 세그먼트들로 세그먼트화될 수 있다. 다른 예에서, 비디 오 데이터 스트림은 전경 콘텐츠 및 배경 콘텐츠로 세그먼트화될 수 있는데, 이는 소정 콘텐츠가 분석될 수 있 게 할 수 있고, (존재하는 경우) 콘텐츠가 전경 콘텐츠가 되는 그러한 시간까지 다른 콘텐츠가 무시될 수 있게 할 수 있다. 또 다른 예에서, 추론을 생성하는 것은 제2 프레임을 잠재 공간 내의 복수의 코드들로부터의 코드에 맵핑하는 것을 포함할 수 있다. 제2 프레임이 맵핑되는 잠재 공간 내의 코드에 기초하여 제2 프레임에 대해 하나 이상의 수정들이 수행될 수 있다. 예를 들어, 제2 프레임, 또는 제2 프레임의 일부분(예컨대, 전경 콘텐츠, 특정 객체 등과 같은 관심 부분)이 수정될 수 있다. 수정들은 해상도 변화들(제2 프레임의 수정 후에 디테일이 보존되도 록 하는 업사이징 및/또는 다운사이징), 잡음제거, 및 이미지 또는 이미지의 일부분에 대해 수행될 수 있는 다 른 수정들을 포함할 수 있다. 일부 양태들에서, 교사 뉴럴 네트워크는 상기에서 논의된 바와 같이, 복수의 선형 블록들을 포함하는 선형 네트 워크일 수 있다. 학생 뉴럴 네트워크는 가중치들을 교사 뉴럴 네트워크에서의 가중치들의 순위보다 더 낮은 순 위로 분해하도록 구성될 수 있다. 학생 뉴럴 네트워크는 복수의 그룹 콘볼루션 계층들을 포함할 수 있다. 교 사 뉴럴 네트워크가 선형 네트워크인 경우들에서, 학생 뉴럴 네트워크는 선행자 프레임과 현재 프레임 사이의 차이에 기초하여(예컨대, 에 기초하여) 제2 특징부들(예컨대, )을 생성할 수 있고, 제2 특징 부들을 생성하기 위해 선행자 프레임을 수신할 필요가 없을 수 있다. 일부 양태들에서, 교사 뉴럴 네트워크는 복수의 비선형 블록들을 포함하는 비선형 네트워크일 수 있다. 그러한 경우에, 학생 뉴럴 네트워크는 교사 뉴럴 네트워크에 대해 감소된 수의 채널들, 감소된 공간 해상도, 또는 감소 된 양자화 중 하나 이상을 갖는 네트워크일 수 있다. 논의된 바와 같이, 교사 뉴럴 네트워크가 비선형 네트워 크인 경우들에서, 학생 뉴럴 네트워크는 선행자 프레임, , 및 선행자 프레임과 현재 프레임 사이의 차이에 기초하여(예컨대, 에 기초하여) 제2 특징부들(예컨대, )을 생성할 수 있다. 일부 양태들에서, 학생 뉴럴 네트워크는 제1 프레임과 제2 프레임 사이의 특징부 맵의 실제 변화와 제1 프레임 과 제2 프레임 사이의 특징부 맵의 예측된 변화 사이의 차이에 기초하여 손실 함수를 최소화하도록 훈련된 뉴럴 네트워크일 수 있다. 손실 함수는 학생 뉴럴 네트워크의 복잡도 측정치 및 복수의 후보 모델들에 걸친 카테고 리 분포에 기초하여 정의된 비용 함수에 추가로 기초할 수 있다. 복수의 후보 모델들은, 예를 들어, 교사 뉴럴 네트워크와 동일한 계산 비용으로 동작하는(예컨대 압축 없이 프레임들 사이의 델타를 증류함) 학생 뉴럴 네트 워크 및 일부 타깃 인자에 의해 교사 뉴럴 네트워크보다 계산적으로 더 저렴한 학생 뉴럴 네트워크 를 포함할 수 있다. 일부 양태들에서, 비디오 데이터 스트림 내의 제2 프레임과 제3 프레임 사이의 차이가 결정될 수 있다. 학생 뉴럴 네트워크를 사용하여 적어도, 제2 프레임과 제3 프레임 사이의 차이로부터 제3 특징부들이 추출될 수 있다. 제2 특징부들 및 제3 특징부들의 합에 기초하여 제3 프레임에 대해 특징부 맵이 생성될 수 있고, 제3 프 레임에 대한 생성된 특징부 맵에 기초하여 제3 프레임에 대해 추론이 생성될 수 있다. 뉴럴 네트워크들에서 델타 증류를 사용한 비디오 프로세싱을 위한 예시적인 프로세싱 시스템들 도 7은, 예를 들어 도 5와 관련하여 본 명세서에서 설명된 것과 같은, 델타 증류, 교사 뉴럴 네트워크, 및 학생 뉴럴 네트워크를 사용하여 비디오 콘텐츠(또는 시간 컴포넌트를 갖는 다른 콘텐츠)에 대해 추론들을 수행하기 위해 기계 학습 모델을 훈련시키기 위한 예시적인 프로세싱 시스템을 도시한다. 프로세싱 시스템은 중앙 프로세싱 유닛(CPU)을 포함하고, 이는 일부 예들에서 다중-코어 CPU일 수 있 다. CPU에서 실행된 명령들은, 예를 들어, CPU와 연관된 프로그램 메모리로부터 로딩될 수 있거나, 또는 메모리로부터 로딩될 수 있다. 프로세싱 시스템은 또한, GPU(graphics processing unit), DSP(digital signal processor), NPU(neural processing unit), 멀티미디어 컴포넌트, 및 무선 연결성 컴포넌트와 같은 특정 기 능들에 맞춤화된 추가적인 프로세싱 컴포넌트들을 포함한다. NPU와 같은 NPU는 대체적으로, 인공 뉴럴 네트워크(artificial neural network, ANN)들, 딥 뉴럴 네트워 크(deep neural network, DNN)들, 랜덤 포레스트(random forest, RF)들 등을 프로세싱하기 위한 알고리즘들과 같은, 머신 학습 알고리즘들을 실행하기 위한 제어 및 산술 로직을 구현하도록 구성된 특화된 회로이다. NPU는 때때로, 대안적으로, 뉴럴 신호 프로세서(neural signal processor, NSP), 텐서 프로세싱 유닛(tensor processing unit, TPU)들, 뉴럴 네트워크 프로세서(neural network processor, NNP), 지능 프로세싱 유닛 (intelligence processing unit, IPU), 비전 프로세싱 유닛(vision processing unit, VPU) 또는 그래프 프로세 싱 유닛으로 지칭될 수 있다. NPU와 같은 NPU는 이미지 분류, 기계 번역, 객체 검출 및 기타 다양한 예측 모델들과 같은 일반적인 머신 학습 태스크들의 성능을 가속화하도록 구성된다. 일부 예들에서, 복수의 NPU들은 SoC(system on chip)와 같은 단일 칩에서 인스턴스화될 수 있는 한편, 다른 예들에서, NPU들은 전용 뉴럴 네트워크 가속기의 일부일 수 있다. NPU들은 훈련 또는 추론에 최적화되거나, 일부 경우들에서는 둘 모두 간의 성능의 균형을 맞추도록 구성될 수 있다. 훈련 및 추론 둘 모두를 수행할 수 있는 NPU들의 경우, 두 태스크들은 여전히 일반적으로 독립적으로 수 행될 수 있다. 훈련을 가속화하도록 설계된 NPU들은 일반적으로, 새로운 모델들의 최적화를 가속화하도록 구성되고, 이는 기존 데이터세트(종종 라벨링되거나 태깅됨)를 입력하고, 데이터세트에 대해 반복하고, 이어서 모델 성능을 개선하기 위해 가중치들 및 바이어스들과 같은 모델 파라미터들을 조정하는 것을 수반하는 고도로 계산 집약적인 동작이 다. 일반적으로, 잘못된 예측에 기초한 최적화는 모델의 계층들을 통해 다시 전파하고 예측 에러를 감소시키기 위해 그래디언트들을 결정하는 것을 수반한다. 추론을 가속화하도록 설계된 NPU들은 일반적으로 완전한 모델들에 대해 동작하도록 구성된다. 따라서, 그러한 NPU들은, 새로운 피스의 데이터를 입력하고 이미 훈련된 모델을 통해 이러한 피스를 빠르게 프로세싱하여 모델 출력(예컨대, 추론)을 생성하도록 구성될 수 있다. 하나의 구현에서, NPU는 CPU, GPU, 및/또는 DSP 중 하나 이상의 일부이다. 일부 예들에서, 무선 연결성 컴포넌트는 예를 들어, 3세대(3G) 연결, 4세대(4G) 연결(예를 들어, 4G LTE), 5세대 연결(예를 들어, 5G 또는 NR), Wi-Fi 연결, 블루투스 연결 및 다른 무선 데이터 송신 표준들을 위한 서브 컴포넌트들을 포함할 수 있다. 무선 연결성 컴포넌트는 하나 이상의 안테나들에 추가로 커플링된다. 일부 예들에서, 프로세싱 시스템의 프로세서들 중 하나 이상은 ARM 또는 RISC-V 명령 세트에 기초할 수 있 다. 프로세싱 시스템은 또한 임의의 방식의 센서와 연관된 하나 이상의 센서 프로세싱 유닛들, 임의의 방 식의 이미지 센서와 연관된 하나 이상의 이미지 신호 프로세서(ISP)들, 및/또는 위성 기반 포지셔닝 시스템 컴포넌트들(예컨대, GPS 또는 GLONASS)뿐만 아니라 관성 포지셔닝 시스템 컴포넌트들을 포함할 수 있는 내비 게이션 컴포넌트를 포함할 수 있다. 프로세싱 시스템은 또한, 스크린들, 터치 감지 표면들(터치 감지 디스플레이들을 포함함), 물리적 버튼들, 스피커들, 마이크로폰들 등과 같은 하나 이상의 입력 및/또는 출력 디바이스들을 포함할 수 있다. 메모리는 하나 이상의 정적 및/또는 동적 메모리들, 예컨대 동적 랜덤 액세스 메모리(DRAM), 플래시 기반 정적 메모리 등을 대표한다. 이러한 예에서, 메모리는 프로세싱 시스템의 전술된 컴포넌트들 중 하 나 이상에 의해 실행될 수 있는 컴퓨터 실행가능 컴포넌트들을 포함한다. 특히, 이러한 예에서, 메모리는 훈련 데이터 세트 수신 컴포넌트(724A), 교사 뉴럴 네트워크 훈련 컴포넌 트(724B), 학생 뉴럴 네트워크 훈련 컴포넌트(724C), 및 뉴럴 네트워크 배치 컴포넌트(724D)를 포함한다. 묘사 된 컴포넌트들, 및 묘사되지 않은 다른 것들은 본 명세서에 설명된 방법들의 다양한 양태들을 수행하도록 구성 될 수 있다. 대체적으로, 프로세싱 시스템 및/또는 그의 컴포넌트들은 본 명세서에 설명된 방법들을 수행하도록 구성될 수 있다. 특히, 다른 양태들에서, 프로세싱 시스템이 서버 컴퓨터 등인 경우와 같이, 프로세싱 시스템의 엘리 먼트들이 생략될 수 있다. 예를 들어, 멀티미디어 컴포넌트, 무선 연결성 컴포넌트, 센서 프로세싱 유닛들, ISP들, 및/또는 내비게이션 컴포넌트는 다른 양태들에서 생략될 수 있다. 또한, 예컨 대 모델을 훈련시키고 모델을 사용하여 추론들을 생성하기 위한 프로세싱 시스템의 엘리먼트들이 분포될 수 있다. 도 8은, 예를 들어 도 6과 관련하여 본 명세서에서 설명된 것과 같은, 델타 증류, 교사 뉴럴 네트워크, 및 학생 뉴럴 네트워크를 사용하여 비디오 콘텐츠(또는 시간 컴포넌트를 갖는 다른 콘텐츠)에 대해 추론들을 수행하기 위한 예시적인 프로세싱 시스템을 도시한다. 프로세싱 시스템은 중앙 프로세싱 유닛(CPU)을 포함하고, 이는 일부 예들에서 다중-코어 CPU일 수 있 다. 프로세싱 시스템은 또한 그래픽 프로세싱 유닛(GPU), 디지털 신호 프로세서(DSP) 및 뉴럴 프로세싱 유닛(NPU)과 같은 특정 기능에 맞춰진 추가 프로세싱 컴포넌트를 포함한다. CPU, GPU, DSP, 및 NPU는 도 7과 관련하여 상기에서 논의된 CPU, GPU, DSP, 및 NPU와 유사할 수 있다. 일부 예들에서, 무선 연결성 컴포넌트는 예를 들어, 3세대(3G) 연결성, 4세대(4G) 연결성(예컨대, 4G LTE), 5세대 연결성(예컨대, 5G 또는 NR), Wi-Fi 연결성, 블루투스 연결성 및 다른 무선 데이터 송신 표준들을 위한 서브컴포넌트들을 포함할 수 있다. 무선 연결성 컴포넌트는 하나 이상의 안테나들(도시되지 않음)에 추가로 연결될 수 있다. 일부 예들에서, 프로세싱 시스템의 프로세서들 중 하나 이상은 ARM 또는 RISC-V 명령 세트에 기초할 수 있 다. 프로세싱 시스템은 또한, 동적 랜덤 액세스 메모리, 플래시 기반 정적 메모리 등과 같은 하나 이상의 정적 및/또는 동적 메모리들을 나타내는 메모리를 포함한다. 이러한 예에서, 메모리는 프로세싱 시스템 의 전술한 프로세서들 중 하나 이상에 의해 실행될 수 있는 컴퓨터 실행가능 컴포넌트들을 포함한다. 특히, 이러한 예에서, 메모리는 비디오 데이터 스트림 수신 컴포넌트(824A), 특징부 추출 컴포넌트(824B), 차이 결정 컴포넌트(824C), 특징부 맵 생성 컴포넌트(824D), 추론 생성 컴포넌트(824E), 및 뉴럴 네트워크 컴포 넌트(824F)(예컨대, 도 3과 관련하여 전술된 뉴럴 네트워크들(310, 320) 또는 도 4와 관련하여 전술된 뉴럴 네 트워크들(410, 420))를 포함한다. 묘사된 컴포넌트들, 및 묘사되지 않은 다른 것들은 본 명세서에 설명된 방법 들의 다양한 양태들을 수행하도록 구성될 수 있다. 대체적으로, 프로세싱 시스템 및/또는 그의 컴포넌트들은 본 명세서에 설명된 방법들을 수행하도록 구성될 수 있다. 특히, 다른 양태들에서, 프로세싱 시스템이 서버 컴퓨터 등인 경우와 같이, 프로세싱 시스템의 엘리 먼트들이 생략될 수 있다. 예를 들어, 멀티미디어 컴포넌트, 무선 연결성 컴포넌트, 센서, ISP, 및/또는 내비게이션 컴포넌트는 다른 양태들에서 생략될 수 있다.예시적인 조항들 본 개시내용의 다양한 양태들의 구현 상세들이 다음의 넘버링된 조항들에 설명되어 있다. 조항 1: 방법으로서, 적어도 제1 프레임 및 제2 프레임을 포함하는 비디오 데이터 스트림을 수신하는 단계; 교 사 뉴럴 네트워크를 사용하여 상기 제1 프레임으로부터 제1 특징부들을 추출하는 단계; 상기 제1 프레임과 상기 제2 프레임 사이의 차이를 결정하는 단계; 학생 뉴럴 네트워크를 사용하여 적어도, 상기 제1 프레임과 상기 제2 프레임 사이의 상기 차이로부터 제2 특징부들을 추출하는 단계; 상기 제1 특징부들 및 상기 제2 특징부들의 합 에 기초하여 상기 제2 프레임에 대한 특징부 맵을 생성하는 단계; 및 상기 제2 프레임에 대한 상기 생성된 특징 부 맵에 기초하여 상기 비디오 데이터 스트림의 적어도 상기 제2 프레임에 대한 추론을 생성하는 단계를 포함하 는, 방법. 조항 2: 조항 1에 있어서, 상기 제1 프레임은 상기 비디오 데이터 스트림 내의 키 프레임을 포함하고, 상기 제2 프레임은 상기 비디오 데이터 스트림 내의 비-키 프레임을 포함하는, 방법. 조항 3: 조항 1 또는 조항 2에 있어서, 상기 비디오 데이터 스트림 내의 상기 제2 프레임과 제3 프레임 사이의 차이를 결정하는 단계; 상기 학생 뉴럴 네트워크를 사용하여 적어도, 상기 제2 프레임과 상기 제3 프레임 사이 의 상기 차이로부터 제3 특징부들을 추출하는 단계; 상기 제2 특징부들 및 상기 제3 특징부들의 합에 기초하여 상기 제3 프레임에 대한 특징부 맵을 생성하는 단계; 및 상기 제3 프레임에 대한 상기 생성된 특징부 맵에 기초 하여 상기 비디오 데이터 스트림의 상기 제3 프레임에 대한 추론을 생성하는 단계를 추가로 포함하는, 방법. 조항 4: 조항 1 내지 조항 3 중 어느 한 조항에 있어서, 상기 교사 뉴럴 네트워크는 선형 네트워크를 포함하는, 방법. 조항 5: 조항 1 내지 조항 4 중 어느 한 조항에 있어서, 상기 학생 뉴럴 네트워크는 가중치들을 상기 교사 뉴럴 네트워크에서의 가중치들의 순위보다 더 낮은 순위로 분해하도록 구성되는, 방법. 조항 6: 조항 1 내지 조항 5 중 어느 한 조항에 있어서, 상기 학생 뉴럴 네트워크는 하나 이상의 그룹 콘볼루션 계층들을 포함하는, 방법. 조항 7: 조항 1 내지 조항 6 중 어느 한 조항에 있어서, 상기 교사 뉴럴 네트워크는 비선형 네트워크를 포함하 는, 방법. 조항 8: 조항 1 내지 조항 7 중 어느 한 조항에 있어서, 상기 학생 뉴럴 네트워크는 상기 교사 뉴럴 네트워크에 대해 감소된 수의 채널들, 감소된 공간 해상도, 또는 감소된 양자화 중 하나 이상을 갖는 네트워크를 포함하는, 방법. 조항 9: 조항 1 내지 조항 8 중 어느 한 조항에 있어서, 상기 제2 특징부들은 상기 제1 프레임과 상기 제2 프레 임 사이의 상기 차이와 조합하여 상기 제1 프레임으로부터 추가로 추출되는, 방법. 조항 10: 조항 1 내지 조항 10 중 어느 한 조항에 있어서, 상기 학생 뉴럴 네트워크는 상기 제1 프레임과 상기 제2 프레임 사이의 특징부 맵의 실제 변화와 상기 제1 프레임과 상기 제2 프레임 사이의 상기 특징부 맵의 예측 된 변화 사이의 차이에 기초하여 손실 함수를 최소화하도록 훈련된 뉴럴 네트워크를 포함하는, 방법. 조항 11: 조항 10에 있어서, 상기 손실 함수는 상기 학생 뉴럴 네트워크의 복잡성 측정치 및 복수의 후보 모델 들에 걸친 카테고리 분포에 기초하여 정의된 비용 함수에 추가로 기초하는, 방법. 조항 12: 조항 1 내지 조항 11 중 어느 한 조항에 있어서, 상기 추론을 생성하는 단계는 상기 비디오 데이터 스 트림의 상기 제2 프레임 내의 하나 이상의 객체들을 식별하는 단계를 포함하는, 방법. 조항 13: 조항 1 내지 조항 12 중 어느 한 조항에 있어서, 상기 추론을 생성하는 단계는 상기 비디오 데이터 스 트림 내의 대상의 포즈 또는 예측된 모션 중 적어도 하나를 추정하는 단계를 포함하는, 방법. 조항 14: 조항 1 내지 조항 13 중 어느 한 조항에 있어서, 상기 추론을 생성하는 단계는 상기 비디오 데이터 스 트림을 상기 비디오 데이터 스트림에서 캡처된 상이한 대상들과 연관된 복수의 세그먼트들로 시맨틱으로 세그먼 트화하는 단계를 포함하는, 방법. 조항 15: 조항 1 내지 조항 14 중 어느 한 조항에 있어서, 상기 추론을 생성하는 단계는 상기 제2 프레임을 잠 재 공간 내의 복수의 코드들로부터의 코드에 맵핑하는 단계를 포함하고, 상기 방법은 상기 제2 프레임이 맵핑되 는 상기 잠재 공간 내의 상기 코드에 기초하여 상기 제2 프레임을 수정하는 단계를 추가로 포함하는, 방법.조항 16: 방법으로서, 복수의 비디오 샘플들을 포함하는 훈련 데이터 세트를 수신하는 단계로서, 상기 복수의 비디오 샘플들의 각각의 비디오 샘플은 복수의 프레임들을 포함하는, 상기 훈련 데이터 세트를 수신하는 단계; 상기 훈련 데이터 세트에 기초하여 교사 뉴럴 네트워크를 훈련시키는 단계; 각각의 비디오 샘플 내의 연속적인 프레임들에 대한 특징부 맵들 사이의 예측된 차이들 및 각각의 비디오 샘플 내의 상기 연속적인 프레임들에 대 한 특징부 맵들 사이의 실제 차이들에 기초하여 학생 뉴럴 네트워크를 훈련시키는 단계; 및 상기 교사 뉴럴 네 트워크 및 상기 학생 뉴럴 네트워크를 배치하는 단계를 포함하는, 방법. 조항 17: 조항 16에 있어서, 상기 교사 뉴럴 네트워크 및 상기 학생 뉴럴 네트워크는 동일한 태스크 특정적 목 적 함수를 최소화하도록 훈련되고, 상기 태스크 특정적 목적 함수는 비디오 샘플 내의 연속적인 프레임들에 대 해 생성된 특징부 맵들의 실제 변화와 예측된 변화 사이의 차이와 연관된 가중 델타 분포 손실 항 및 상기 학생 뉴럴 네트워크에 대한 복잡성 측정치와 연관된 가중 비용 항에 기초하여 정의된 함수를 포함하는, 방법. 조항 18: 조항 16 또는 조항 17에 있어서, 상기 학생 뉴럴 네트워크를 훈련시키는 단계는 상기 훈련 데이터 세 트 내의 비디오 샘플 내의 연속적인 프레임들에 대해 생성된 출력들 사이의 실제 차이와 상기 비디오 샘플 내의 상기 연속적인 프레임들에 대해 생성된 상기 출력들 사이의 예측된 차이 사이의 손실을 최소화하도록 상기 학생 뉴럴 네트워크를 훈련시키는 단계를 포함하는, 방법. 조항 19: 조항 16 내지 조항 18 중 어느 한 조항에 있어서, 상기 학생 뉴럴 네트워크를 훈련시키는 단계는 상기 학생 뉴럴 네트워크에 대한 복잡성 측정치 및 복수의 후보 모델들에 걸친 카테고리 분포에 기초하여 정의된 비 용 함수를 최소화하도록 상기 학생 뉴럴 네트워크를 훈련시키는 단계를 포함하는, 방법. 조항 20: 조항 16 내지 조항 19 중 어느 한 조항에 있어서, 상기 교사 뉴럴 네트워크는 선형 네트워크를 포함하 는, 방법. 조항 21: 조항 16 내지 조항 20 중 어느 한 조항에 있어서, 상기 학생 뉴럴 네트워크는 가중치들을 상기 교사 뉴럴 네트워크의 가중치들의 순위보다 더 낮은 순위로 분해하도록 구성된 네트워크를 포함하는, 방법. 조항 22: 조항 16 내지 조항 21 중 어느 한 조항에 있어서, 상기 교사 뉴럴 네트워크는 비선형 네트워크를 포함 하는, 방법. 조항 23: 프로세싱 시스템으로서, 컴퓨터 실행가능 명령들을 포함하는 메모리; 및 컴퓨터 실행가능 명령들을 실 행하도록 그리고 상기 프로세싱 시스템으로 하여금 조항 1 내지 조항 22 중 어느 한 조항에 따른 방법을 수행하 게 하도록 구성된 하나 이상의 프로세서들을 포함하는, 프로세싱 시스템. 조항 24: 프로세싱 시스템으로서, 조항 1 내지 조항 22 중 어느 한 조항에 따른 방법을 수행하기 위한 수단을 포함하는, 프로세싱 시스템. 조항 25: 컴퓨터 실행가능 명령들을 포함하는 비일시적 컴퓨터 판독가능 매체로서, 상기 컴퓨터 실행가능 명령 들은, 프로세싱 시스템의 하나 이상의 프로세서들에 의해 실행될 때, 상기 프로세싱 시스템으로 하여금, 조항 1 내지 조항 22 중 어느 한 조항에 따른 방법을 수행하게 하는, 비일시적 컴퓨터 판독가능 매체. 조항 26: 조항 1 내지 조항 22 중 어느 한 조항에 따른 방법을 수행하기 위한 코드를 포함하는 컴퓨터 판독가능 저장 매체 상에 구현된 컴퓨터 프로그램 제품. 추가적인 고려사항들 이전의 설명은 당업자가 본 명세서에서 설명된 다양한 기능들을 실시하는 것을 가능하게 하기 위해 제공된다. 여기에 논의된 예들은 청구항들에 기재된 범위, 적용가능성, 또는 양태들을 한정하는 것은 아니다. 이러한 양 태들에 대한 다양한 수정들이 당업자들에게 쉽게 자명할 것이며, 본 명세서에서 정의된 일반적 원리들은 다른 양태들에 적용될 수 있다. 예컨대, 본 개시내용의 범주를 벗어나지 않으면서, 논의되는 엘리먼트들의 기능 및 어레인지먼트는 변경될 수 있다. 다양한 예들은 다양한 절차들 또는 컴포넌트들을 적절히 생략, 대체, 또는 추 가할 수 있다. 예를 들어, 설명된 방법들은 설명된 것과는 상이한 순서로 수행될 수 있고, 다양한 단계들이 추 가, 생략, 또는 조합될 수 있다. 또한, 일부 예들과 관련하여 설명된 특징들은 일부 다른 예들에서 조합될 수 있다. 예컨대, 본 명세서에서 기재된 양태들 중 임의의 수의 양태들을 사용하여, 장치가 구현될 수 있거나 방 법이 실시될 수 있다. 추가적으로, 본 개시내용의 범주는, 본 명세서에 기재된 본 개시내용의 다양한 양태들에 추가하여 또는 그 이외의 다른 구조, 기능, 또는 구조 및 기능을 사용하여 실시되는 그러한 장치 또는 방법을 커버하도록 의도된다. 본 명세서에 개시된 본 개시내용의 임의의 양태가 청구항의 하나 이상의 엘리먼트들에의해 구현될 수 있다는 것이 이해되어야 한다. 본 명세서에서 사용된 바와 같이, 단어 \"예시적인\"은 \"예, 예증, 또는 예시로서 역할을 함\"을 의미한다. \"예시 적인\" 것으로서 본 명세서에서 설명된 임의의 양태는 다른 양태들에 비해 반드시 바람직하다거나 이로운 것으로 서 해석되지는 않아야 한다. 본 명세서에서 사용된 바와 같이, 항목들의 리스트 \"중 적어도 하나\"를 지칭하는 어구는 단일 멤버들을 포함한, 그 항목들의 임의의 조합을 지칭한다. 예를 들어, \"a, b 또는 c 중 적어도 하나\"는 a, b, c, a-b, a-c, b-c, 및 a-b-c뿐만 아니라, 다수의 동일한 엘리먼트의 임의의 조합(예컨대, a-a, a-a-a, a-a-b, a-a-c, a-b-b, a-c- c, b-b, b-b-b, b-b-c, c-c, 및 c-c-c 또는 a, b, 및 c의 임의의 다른 순서화)을 커버하는 것으로 의도된다. 본 명세서에서 사용된 바와 같이, 용어 \"결정하는 것\"은 매우 다양한 액션들을 포괄한다. 예를 들어, \"결정\"은 계산, 컴퓨팅, 프로세싱, 유도, 검사, 검색(예를 들어, 표, 데이터베이스 또는 다른 데이터 구조에서의 검색), 확인 등을 포함할 수 있다. 또한, \"결정하는 것\"은 수신하는 것(예를 들어, 정보 수신), 액세스하는 것(예를 들어, 메모리 내의 데이터에 액세스) 등을 포함할 수 있다. 또한, \"결정\"은 해결, 선택, 선정, 설정 등을 포함 할 수 있다. 본 명세서에서 개시된 방법들은 그 방법들을 달성하기 위한 하나 이상의 단계들 또는 액션들을 포함한다. 방법 단계들 및/또는 액션들은 청구항들의 범주를 벗어나지 않으면서 서로 상호교환될 수 있다. 다시 말해서, 단계 들 또는 액션들의 특정 순서가 특정되지 않으면, 특정 단계들 및/또는 액션들의 순서 및/또는 사용은 청구항들 의 범주를 벗어나지 않으면서 수정될 수 있다. 또한, 위에서 설명된 방법들의 다양한 동작들은 대응하는 기능 들을 수행할 수 있는 임의의 적합한 수단에 의해 수행될 수 있다. 이 수단은, 회로, ASIC(application specific integrated circuit) 또는 프로세서를 포함하는 (그러나, 이것들로 제한되지는 않음) 다양한 하드웨어 및/또는 소프트웨어 컴포넌트(들) 및/또는 모듈(들)을 포함할 수 있다. 일반적으로, 도면들에 예시된 동작들이 존재하는 경우, 이런 동작들은 유사한 넘버링을 갖는 대응하는 대응부 기능식 컴포넌트들을 가질 수 있다. 다음의 청구항들은 본 명세서에 나타낸 양태들에 제한되도록 의도되지 않으며, 청구항들의 표현과 일치하는 전 체 범위에 따라야 한다. 청구항 내에서, 단수의 엘리먼트에 대한 언급은 특별히 그렇게 언급되지 않는 한 \"하 나 및 하나만\"을 의미하는 것이 아니라 오히려 \"하나 이상\"을 의미하는 것으로 의도된다. 달리 특정하게 언급 되지 않으면, 용어 \"일부\"는 하나 이상을 지칭한다. 어떠한 청구항 엘리먼트도 그 엘리먼트가 어구 \"~하는 수 단\"을 사용하여 명백하게 기재되지 않는다면, 또는 방법 청구항의 경우, 그 엘리먼트가 어구 \"~하는 단계\"를 사 용하여 기재되지 않는다면, 35 U.S.C.§112(f)의 규정 하에서 해석되지 않아야 한다. 당업자들에게 알려져 있 는 또는 나중에 알려지게 될 본 개시내용 전체에 걸쳐 설명된 다양한 양태들의 엘리먼트들에 대한 모든 구조적 그리고 기능적 등가물들은 참조에 의해 본 명세서에 명백히 포함되고, 청구항들에 의해 포괄되는 것으로 의도된 다. 게다가, 본 명세서에 개시된 어떠한 것도, 그와 같은 개시내용이 청구항들에 명시적으로 인용되는지 여부 에 관계없이 공중에 전용되도록 의도되지 않는다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2024-7015078", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부된 도면들은 하나 이상의 양태들의 소정 특징부들을 묘사하고, 따라서, 본 개시내용의 범주를 제한하는 것으로 간주되지 않아야 한다.도 1은 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크를 포함하는 예시적인 증류 아키텍처를 예시한다. 도 2는 교사 뉴럴 네트워크 및 학생 뉴럴 네트워크를 사용하여 프레임들 사이의 변화들을 증류하는 데 사용되는 델타 증류의 일례를 예시한다. 도 3은 본 개시내용의 양태들에 따른, 비디오 콘텐츠 내의 프레임들 사이의 변화들에 기초하여 교사 및 학생 뉴 럴 네트워크를 포함하는 뉴럴 네트워크를 훈련시키는 일례를 예시한다. 도 4는 본 개시내용의 양태들에 따른, 비디오 콘텐츠 내의 프레임들 사이의 변화들에 기초하여 뉴럴 네트워크를 사용하여 비디오 콘텐츠에 대한 추론을 수행하는 일례를 예시한다. 도 5는 본 개시내용의 양태들에 따른, 연속적인 비디오 프레임들로부터 증류된 델타들에 기초하여 비디오 콘텐 츠에 대한 추론들을 수행하기 위해 뉴럴 네트워크를 훈련시키기 위한 예시적인 동작들을 예시한다. 도 6은 본 개시내용의 양태들에 따른, 연속적인 비디오 프레임들로부터 증류된 델타들에 기초하여 비디오 콘텐 츠를 프로세싱하도록 훈련된 뉴럴 네트워크를 사용하여 비디오 콘텐츠에 대한 추론을 수행하기 위한 예시적인 동작들을 예시한다. 도 7은 본 개시내용의 양태들이 구현될 수 있는 예시적인 시스템을 예시한다. 도 8은 본 개시내용의 양태들이 구현될 수 있는 다른 예시적인 시스템을 예시한다. 이해를 용이하게 하기 위하여, 도면들에 공통적인 동일한 엘리먼트들을 지정하기 위해 가능한 경우 동일한 참조 번호들이 사용되었다. 일 양태의 엘리먼트들 및 특징들은 추가 기재 없이도 다른 양태들에 유익하게 통합될 수 있음이 고려된다."}
