{"patent_id": "10-2023-0019937", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0037815", "출원번호": "10-2023-0019937", "발명의 명칭": "원부자재 공급망 예측 방법 및 그 시스템", "출원인": "한국과학기술정보연구원", "발명자": "박강희"}}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 시스템에 의하여 수행되는 방법에 있어서,대상 국가의 변수 데이터를 획득하는 단계;상기 대상 국가의 변수 데이터를 이용하여 Strong 시그널을 생성하는 단계; 상기 대상 국가의 변수 데이터와 상기 Strong 시그널을 이용하여 학습한 머신러닝 알고리즘이 Weak 시그널을 생성하는 단계;상기 Strong 시그널과 Weak 시그널이 발생한 시그널 날짜의 발행 문헌에서 키워드를 추출하여 상기 키워드에 상기 Strong 시그널과 Weak 시그널을 연계시키는 단계; 및대상 날짜의 발행 문헌에서 키워드를 추출하여 키워드와 연계된 제1 시그널과 기 연계된 품목의 위험을 출력하는 단계를 포함하는, 원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 대상 국가의 변수 데이터를 이용하여 Strong 시그널을 생성하는 단계는,상기 변수 데이터에 포함된 제1 변수의 제1 변동성을 비교지수화 하는 단계;대상 날짜의 변동성 비교지수를 제1 변동성 비교지수의 특정 기간 평균과 비교하여, 상기 대상 날짜의 변동성비교지수가 기 정의된 수치 이상이면 제1 변동성 비교지수를 시그널로 지정하는 단계; 및시그널로 지정된 변수가 전체 변수의 절반 이상이면 Strong 시그널을 생성하는 단계를 포함하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 변수 데이터에 포함된 제1 변수의 제1 변동성을 비교지수화 하는 단계는,상기 제1 변수의 당일종가와 전일종가의 차이를 계산하는 단계를 포함하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 대상 국가의 변수 데이터와 상기 Strong 시그널을 이용하여 학습한 머신러닝 알고리즘이 Weak 시그널을 생성하는 단계는,상기 Strong 시그널을 label로 정하는 단계;상기 대상 국가의 변수 데이터를 디마크 지표로 변환하는 단계;준지도학습 알고리즘을 활용하여 상기 label과 디마크 지표를 그래프로 구성하는 단계; 및상기 그래프를 이용하여 Weak 시그널을 생성하는 단계를 포함하는,원부자재 공급망 예측 방법.공개특허 10-2024-0037815-3-청구항 5 제1 항에 있어서,상기 Strong 시그널과 Weak 시그널이 발생한 날짜의 발행 문헌에서 키워드를 추출하여 상기 키워드에 상기Strong 시그널과 Weak 시그널을 연계시키는 단계는,상기 Strong 시그널이 발생한 날짜의 제1 발행 문헌을 획득하는 단계;상기 제1 발행 문헌에서 제1 키워드를 추출하는 단계;상기 Strong 시그널이 발생한 날짜에 제1 키워드가 등장한 빈도수를 제1 키워드에 부여하는 단계;상기 Weak 시그널이 발생한 날짜의 제2 발행 문헌을 획득하는 단계;상기 제2 발행 문헌에서 제2 키워드를 추출하는 단계;상기 Weak 시그널이 발생한 날짜에 제2 키워드가 등장한 빈도수를 제2 키워드에 부여하는 단계를 포함하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 상기 대상 날짜의 발행 문헌에서 키워드를 추출하여 키워드와 연계된 제1 시그널과 기 연계된 품목의 위험을 출력하는 단계는,상기 대상 날짜의 발행 문헌을 획득하는 단계;상기 대상 날짜의 발행 문헌에 포함된 제3 키워드를 추출하는 단계;상기 제3 키워드와 연계된 제1 시그널을 예측하는 단계를 포함하되, 상기 제1 시그널과 기 연계된 품목을 도출하는 단계를 포함하는, 원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 제3 키워드와 연계된 제1 시그널을 예측하는 단계는,특정 키워드와 기 연계된 시그널을 예측하는 단계를 포함하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6 항에 있어서, 상기 제1 시그널과 기 연계된 품목을 도출하는 단계는,대상 국가의 주요 업종에 대한 주식데이터를 획득하는 단계;상기 제1 시그널이 발생한 시그널 날짜에 변동성이 기 정의된 수준 이상인 상기 주식데이터를 상기 제1 시그널에 연계시키는 단계; 및상기 주식데이터와 연관된 품목을 도출하는 단계를 포함하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서, 공개특허 10-2024-0037815-4-상기 주식데이터와 연관된 품목을 도출하는 단계는,상기 대상 국가의 주요 업종과 유관한 원부자재 품목 테이블을 이용하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6 항에 있어서, 상기 제1 시그널과 기 연계된 품목의 위험을 출력하는 단계는,상기 품목을 거래하는 국가와 기업을 리스트업하여 추천하는 단계를 포함하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 품목을 거래하는 국가와 기업을 리스트업하여 추천하는 단계는,거래하는 품목의 규모가 큰 순서로 상기 품목을 거래하는 국가와 기업을 리스트업하여 추천하는 단계를 포함하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10 항에 있어서,상기 품목을 거래하는 국가와 기업을 리스트업하여 추천하는 단계는,거래하는 국가가 미국인 국가와 기업을 우선 순위로 리스트업하여 추천하는 단계를 포함하는,원부자재 공급망 예측 방법."}
{"patent_id": "10-2023-0019937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "하나 이상의 프로세서;상기 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(load)하는 메모리; 및상기 컴퓨터 프로그램을 저장하는 스토리지를 포함하되,상기 컴퓨터 프로그램은, 대상 국가의 변수 데이터를 획득하는 인스트럭션;상기 대상 국가의 변수 데이터를 이용하여 Strong 시그널을 생성하는 인스트럭션; 상기 대상 국가의 변수 데이터와 상기 Strong 시그널을 이용하여 학습한 제1 머신러닝 알고리즘이 Weak 시그널을 생성하는 인스트럭션;상기 Strong 시그널과 Weak 시그널이 발생한 시그널 날짜의 발행 문헌에서 키워드를 추출하여 제2 머신러닝 알고리즘이 상기 Strong 시그널과 Weak 시그널을 연계시키는 인스트럭션;대상 날짜의 발행 문헌에서 키워드를 추출한 제3 머신러닝 알고리즘이 키워드와 연계된 제1 시그널을 예측하는인스트럭션; 및상기 제1 시그널을 예측한 것에 응답하여, 제1 시그널과 기 연계된 품목의 위험을 출력하는 인스트럭션을 포함하는,"}
{"patent_id": "10-2023-0019937", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "원부자재 공급망 예측 방법 및 그 방법이 적용된 시스템이 제공된다. 본 개시의 일 실시예에 따른 원부자재 공급 망 예측 방법은, 대상 국가의 변수 데이터를 획득하는 단계와, 상기 대상 국가의 변수 데이터를 이용하여 Strong 시그널을 생성하는 단계와, 상기 대상 국가의 변수 데이터와 상기 Strong 시그널을 이용하여 학습한 머신러닝 알 고리즘이 Weak 시그널을 생성하는 단계와, 상기 Strong 시그널과 Weak 시그널이 발생한 시그널 날짜의 발행 문헌 에서 키워드를 추출하여 상기 키워드에 상기 Strong 시그널과 Weak 시그널을 연계시키는 단계와, 대상 날짜의 발 행 문헌에서 키워드를 추출하여 키워드와 연계된 제1 시그널과 기 연계된 품목의 위험을 출력하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0019937", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 원부자재 공급망 예측 방법 및 그 시스템에 관한 것이다. 보다 자세하게는, 국가의 원부자재의 공급 망에 영향을 미칠 수 있는 국가 간 이슈를 사전에 감지하여 원부자재의 공급망을 예측하는 방법 및 그 시스템에 관한 것이다."}
{"patent_id": "10-2023-0019937", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "2021년 기준 대한민국의 무역 수입 총액은 6,151억 달러(수출 6,444억 달러)이고, 2022년 상반기 기준으로도 전 년대비 약 20%이상 증가하는 상황으로 해마다 무역규모는 지속적으로 상승하는 상황이다. 대한민국의 무역 수입액의 국가 별 비중은 중국 1,111억 달러(18.1%), 미국 609억 달러(9.9%), EU 514억 달러 (8.4%), 일본 446억 달러(7.3%), 러시아 130억 달러(2.1%) 등으로 특정국가에서의 수입 의존도가 높은 현황이다. 특히, 특정 국가별 국내 주력산업인 6대 업종(자동차, 반도체, 석유화학제품, 철강, 2차 전지, 에너지)의 수입 비중이 높고 국제적인 지정학적 리스크가 증가하는 상황인만큼, 수입품목의 수입 불안정을 미리 파악하며, 특정 국가 의존도를 낮추고 공급처의 다양화하는 방안이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2205215호 (2021.01.14 등록) (특허문헌 0002) 한국등록특허 제10-2146546호 (2020.08.13 등록) (특허문헌 0003) 한국공개특허 제10-2022-0057784호 (2022.05.09 공개)"}
{"patent_id": "10-2023-0019937", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시가 몇몇 실시예들에서 해결하고자 하는 기술적 과제는, 인공지능 기반의 자동화된 원부자재 공급망 변화 예측 방법을 제공하는 것이다. 본 개시가 몇몇 실시예들에서 해결하고자 하는 기술적 과제는, 발행 문헌을 분석하여 자동으로 원부자재 공급망 에 발생할 변화를 예측하는 방법을 제공하는 것이다. 본 개시가 몇몇 실시예들에서 해결하고자 하는 기술적 과제는, 자동으로 원부자재 공급망에 발생할 변화를 예측 하고, 변화를 해결할 방법을 제공하는 것이다. 본 개시의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적"}
{"patent_id": "10-2023-0019937", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "과제들은 아래의 기재로부터 본 개시의 기술분야에서의 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0019937", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 해결하기 위한 일 실시예에 따른 원부자재 공급망 예측 시스템을 제공하는 방법은, 대상 국 가의 변수 데이터를 획득하는 단계와, 상기 대상 국가의 변수 데이터를 이용하여 Strong 시그널을 생성하는 단 계와, 상기 대상 국가의 변수 데이터와 상기 Strong 시그널을 이용하여 학습한 머신러닝 알고리즘이 Weak 시그 널을 생성하는 단계와, 상기 Strong 시그널과 Weak 시그널이 발생한 시그널 날짜의 발행 문헌에서 키워드를 추 출하여 상기 키워드에 상기 Strong 시그널과 Weak 시그널을 연계시키는 단계와, 대상 날짜의 발행 문헌에서 키 워드를 추출하여 키워드와 연계된 제1 시그널과 기 연계된 품목의 위험을 출력하는 단계를 포함할 수 있다. 일 실시예에서, 상기 대상 국가의 변수 데이터를 이용하여 Strong 시그널을 생성하는 단계는, 상기 변수 데이터 에 포함된 제1 변수의 제1 변동성을 비교지수화 하는 단계와, 대상 날짜의 제1 변동성 비교지수를 제1 변동성 비교지수의 일정 기간 평균과 비교하여, 상기 대상 날짜의 제1 변동성 비교지수가 일정수치 이상이면 제1 변동 성 비교지수를 시그널로 지정하는 단계와, 시그널로 지정된 변수가 전체 변수의 절반 이상이면 Strong 시그널을 생성하는 단계를 포함할 수 있다.일 실시예에서, 상기 변수 데이터에 포함된 제1 변수의 제1 변동성을 비교지수화 하는 단계는, 상기 제1 변수의 당일종가와 전일종가의 차이를 계산하는 단계를 포함할 수 있다. 일 실시예에서, 상기 대상 국가의 변수 데이터와 상기 Strong 시그널을 이용하여 학습한 머신러닝 알고리즘이 Weak 시그널을 생성하는 단계는, 상기 Strong 시그널을 label로 정하는 단계와, 상기 대상 국가의 변수 데이터 를 디마크 지표로 변환하는 단계와, 준지도학습 알고리즘을 활용하여 상기 label과 디마크 지표를 그래프로 구 성하는 단계와, 상기 그래프를 이용하여 Weak 시그널을 생성하는 단계를 포함할 수 있다. 일 실시예에서, 상기 Strong 시그널과 Weak 시그널이 발생한 날짜의 발행 문헌에서 키워드를 추출하여 상기 키 워드에 상기 Strong 시그널과 Weak 시그널을 연계시키는 단계는, 상기 Strong 시그널이 발생한 날짜의 제1 발행 문헌을 획득하는 단계와, 상기 제1 발행 문헌에서 제1 키워드를 추출하는 단계와, 상기 Strong 시그널이 발생한 날짜에 제1 키워드가 등장한 빈도수를 제1 키워드에 부여하는 단계와, 상기 Weak 시그널이 발생한 날짜의 제2 발행 문헌을 획득하는 단계와, 상기 제2 발행 문헌에서 제2 키워드를 추출하는 단계와, 상기 Weak 시그널이 발 생한 날짜에 제2 키워드가 등장한 빈도수를 제2 키워드에 부여하는 단계를 포함할 수 있다. 일 실시예에서, 상기 대상 날짜의 발행 문헌에서 키워드를 추출하여 키워드와 연계된 제1 시그널과 기 연계된 품목의 위험을 출력하는 단계는, 상기 대상 날짜의 발행 문헌을 획득하는 단계와, 상기 대상 날짜의 발행 문헌 에 포함된 제3 키워드를 추출하는 단계와, 상기 제3 키워드와 연계된 제1 시그널을 예측하는 단계와, 상기 제1 시그널과 기 연계된 품목을 도출하는 단계를 포함할 수 있다. 일 실시예에서, 상기 제3 키워드와 연계된 제1 시그널을 예측하는 단계는, 특정 키워드와 기 연계된 시그널을 예측하는 단계를 포함할 수 있다. 일 실시예에서, 상기 제1 시그널과 기 연계된 품목을 도출하는 단계는, 한국의 주요 업종에 대한 주식데이터를 획득하는 단계와, 상기 제1 시그널이 발생한 시그널 날짜에 변동성이 기 정의된 수준 이상인 상기 주식데이터를 상기 제1 시그널에 연계시키는 단계와, 상기 주식데이터와 연관된 품목을 도출하는 단계를 포함할 수 있다. 일 실시예에서, 상기 주식데이터와 연관된 품목을 도출하는 단계는, 상기 한국의 주요 업종과 유관한 원부자재 품목 테이블을 이용할 수 있다. 일 실시예에서, 상기 제1 시그널과 기 연계된 품목의 위험을 출력하는 단계는, 상기 품목을 거래하는 국가와 기 업을 리스트업하여 추천하는 단계를 포함할 수 있다. 일 실시예에서, 상기 품목을 거래하는 국가와 기업을 리스트업하여 추천하는 단계는, 거래하는 품목의 규모가 큰 순서로 상기 품목을 거래하는 국가와 기업을 리스트업하여 추천하는 단계를 포함할 수 있다. 일 실시예에서, 상기 품목을 거래하는 국가와 기업을 리스트업하여 추천하는 단계는, 거래하는 국가가 미국인 국가와 기업을 우선 순위로 리스트업하여 추천하는 단계를 포함할 수 있다. 상기 기술적 과제를 해결하기 위한 본 개시의 일 실시예에 따른 컴퓨팅 시스템은, 하나 이상의 프로세서와, 상 기 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(load)하는 메모리와, 상기 컴퓨터 프로그램을 저장하는 스토리지를 포함할 수 있다. 상기 컴퓨터 프로그램은, 상 국가의 변수 데이터를 획득하는 인스트럭션과, 상기 대상 국가의 변수 데이터를 이용하여 Strong 시그널을 생성하는 인스트럭션과, 상기 대상 국가의 변수 데이터와 상기 Strong 시그널을 이용하여 학습한 제1 머신러닝 알고리즘이 Weak 시그널을 생성하는 인스트럭션과, 상기 Strong 시그널과 Weak 시그널이 발생한 시그널 날짜의 발행 문헌에서 키워드를 추출하여 제2 머신러닝 알고리즘 이 상기 Strong 시그널과 Weak 시그널을 연계시키는 인스트럭션과, 대상 날짜의 발행 문헌에서 키워드를 추출한 제3 머신러닝 알고리즘이 키워드와 연계된 제1 시그널을 예측하는 인스트럭션과, 상기 제1 시그널을 예측한 것 에 응답하여, 제1 시그널과 기 연계된 품목의 위험을 출력하는 인스트럭션을 포함할 수 있다."}
{"patent_id": "10-2023-0019937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 개시의 다양한 실시예들을 상세히 설명한다. 본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나, 본 개시의 기술적 사상은 이하의 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 이하의 실시예들은 본 개시의 기술적 사상을 완전하도록 하고, 본 개시가 속한 기술분 야에서 통상의 지식을 가진 자에게 본 개시의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 개시의 기술 적 사상은 청구항의 범주에 의해 정의될 뿐이다. 본 개시의 다양한 실시예들을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 다른 정의가 없다면, 이하의 실시예들에서 사용되는 용어(기술 및 과학적 용어를 포함)는 본 개시가 속한 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있으나, 이는 관련 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수도 있다. 본 개시에서 사용된 용어 는 실시예들을 설명하기 위한 것이며 본 개시의 범주를 제한하고자 하는 것은 아니다. 이하의 실시예들에서 사용되는 단수의 표현은 문맥상 명백하게 단수인 것으로 특정되지 않는 한, 복수의 개념을 포함한다. 또한, 복수의 표현은 문맥상 명백하게 복수인 것으로 특정되지 않는 한, 단수의 개념을 포함한다. 또한, 이하의 실시예들에서 사용되는 제1, 제2, A, B, (a), (b) 등의 용어는 어떤 구성요소를 다른 구성요소와 구별하기 위해 사용되는 것일 뿐, 그 용어에 의해 해당 구성요소의 본질이나 차례 또는 순서 등이 한정되지는 않는다. 이하, 첨부된 도면들을 참조하여 본 개시의 다양한 실시예들에 대하여 상세하게 설명한다. 도 1을 참조하여, 본 개시의 일 실시예에 따른 원부자재 공급망 예측 시스템의 구성 및 동작을 설명한다. 본 실 시예에 따른 원부자재 공급망 예측 시스템은 획득한 변수 데이터와 발행 문헌 데이터와 품목 데 이터를 이용하여 원부자재 공급망 예측을 실시할 수 있다. 본 실시예에 따른 원부자재 공급망 예측 시스템 은 획득한 변수 데이터와 발행 문헌 데이터와 품목 데이터를 이용하여 원부자재 공급망에 위험을 예측하고 사용자 장치에 위험을 공지할 수 있다. 본 실시예에 따른 원부자재 공급망 예측 시스템 은 획득한 변수 데이터와 발행 문헌 데이터와 품목 데이터를 이용하여 원부자재 공급망에 위험을 예측하고 사용자 장치에 위험을 공지하고, 위험 회피 방안을 추천할 수 있다. 이하, 도 1 및 도 2 를 참조하여 도시된 각 구성 요소에 대해 보다 구체적으로 설명하기로 한다. 원부자재 공급망 예측 시스템은 변수 데이터를 획득할 수 있다. 상기 변수 데이터는 기 정의된 특정 일의 특정 국가의 대표 경제지표인 환율, 금리, 유가 등의 경제/금융 데이터를 포함할 수 있다. 상기 변수 데이터는 기 정의된 특정 일의 특정 국가의 대표 경제지표인 환율, 금리, 유가 등의 일별 변동성을 포함할 수 있다. 상기 변수 데이터는 기 정의된 특정 국가의 대표 경제지표인 환율, 금리, 유가 등의 일정 기간별 변동성을 포함할 수 있다. 상기 변수 데이터는 특정 일자의 국제 금리, K-vix 등의 경제/금융 데이터를 포함할 수 있다. 상기 변수 데이터는 본 명세서에 기재된 실시예 외의 경제/금융 데이터를 포함할 수 있다. 원부자재 공급망 예측 시스템은, 변수 데이터를 획득하여 시그널을 생성할 수 있다. 이는 도 2에 도시된 바와 같이, 변수 데이터 연산부에서 수행될 수 있다. 변수 데이터 연산부는, 변수 데이터를 획득하여 연산하고, 연산된 변수 데이터를 Strong 시그널 생성부와 Weak 시그널 생성부로 송신할 수 있다. Strong 시그널 생성부는 연산된 변수 데이터를 이용하여 Strong 시그널을 생성할 수 있다. Weak 시그널 생 성부는 Strong 시그널과 연산된 변수 데이터를 이용하여 Weak 시그널을 생성할 수 있다. 일 실시예에서, 변수 데이터 연산부는 변수 데이터로 특정 기간 동안 매일의 대상 국가의 환율, 대상 국가 의 금리, 대상 국가의 유가, 국제 금리, K-vix를 획득할 수 있다. 변수 데이터 연산부는 획득한 변수 데이 터를 이용하여 특정일의 변동성을 비교지수화 할 수 있다. 상기 비교지수는 당일종가와 전일종가의 차이일 수 있다. 변수 데이터 연산부는 획득한 변수 데이터를 이용하여 특정 기간 동안의 평균 비교지수를 계산할 수 있다. 변수 데이터 연산부는 상기 특정 기간 동안의 평균 비교지수와 특정일의 비교지수를 비교하여, 상기 특정 기간 동안의 평균 비교지수보다 특정일의 비교지수가 큰 경우 특정일의 해당 변수를 시그널로 지정할 수 있다. 변수 데이터 연산부는 상기 특정 기간 동안의 평균 비교지수와 특정일의 당일 종가와 당일 시가를비교한 지수를 비교하여, 상기 특정 기간 동안의 평균 비교지수보다 특정일의 당일 종가와 당일 시가가 더 큰 경우 특정일의 해당 변수를 시그널로 지정할 수 있다. 일 실시예에서, Strong 시그널 생성부는 시그널로 지정된 변수의 개수가 전체 변수의 절반이상이면 Strong 시그널을 생성할 수 있다. Weak 시그널 생성부는 Strong 시그널을 label로 놓고 일자별 변수를 기반으로 준지도학습 알고리즘을 활용하여 그래프 모형을 구성하고 Weak 시그널을 예측할 수 있다. Weak 시그널 생성부 는 Strong 시그널을 label로 놓고, 디마크 지표로 전처리하고, 데이터를 치환하여, Weak 시그널을 예측할 수 있다. 원부자재 공급망 예측 시스템은 Strong 시그널 생성부와 Weak 시그널 생성부에서 생성 및 예측 한 Strong 시그널과 Weak 시그널을 시그널 저장부에 저장할 수 있다. 원부자재 공급망 예측 시스템 특정 기간의 변수 흐름과 변수의 큰 변화를 나타내는 Strong 시그널과, 특정 기간의 변수 흐름의 변수 별 연관도를 모두 나타내는 Weak 시그널을 반영하여 원부자재 공급망을 예측함으로써, 경제 데이터의 변동 원인을 구분하여 원부자재 공급망 위험을 회피할 시 보다 효율적인 방안을 선택하는 효과를 도출할 수 있다. 또한, 위험을 알리며 우선순위가 반영된 회피 방안을 동시에 제공하여 공급망 위험을 회피할 시 보다 효율적인 방안을 선택하는 효과를 도출할 수 있다. 다음으로, 본 실시예에 따른 원부자재 공급망 예측 시스템은 획득한 발행 문헌 데이터를 이용하여 발 행 문헌에 포함된 키워드를 추출할 수 있다. 원부자재 공급망 예측 시스템은, 발행 문헌을 획득하여 키워드를 추출할 수 있다. 이는 도 2에 도시된 바 와 같이, 발행 문헌 키워드 추출부에서 수행될 수 있다. 상기 발행 문헌은 특정일에 발행된 뉴스와 신문 기사를 포함할 수 있다. 상기 발행 문헌 키워드는 발행 문헌에 포함된 핵심 키워드일 수 있다. 상기 발행 문헌 키워드는 발행 문헌의 제목에 포함된 키워드일 수 있다. 상기 발행 문헌 키워드는 발행 문헌에 반복해서 등장하 는 키워드일 수 있다. 구체적으로 발행 문헌 키워드 추출부에서 발행 문헌으로부터 키워드를 추출할 수 있 는 키워드 추출 model을 이용하여 발행 문헌에 포함된 키워드들이 추출될 수 있다. 발행 문헌 키워드 추출부 는 발행 문헌으로부터의 키워드를 사용자로부터 입력 받을 수 있다. 원부자재 공급망 예측 시스템은, 추출한 키워드와 시그널을 연계할 수 있다. 이는 도 2에 도시된 바와 같 이, 시그널 - 키워드 연계부에서 수행될 수 있다. 시그널 저장부로부터 시그널이 존재하는 일자를 수 신한 시그널 연계부는 연계 대상 시그널과 연계 대상 시그널이 발생한 일자를 시그널 - 키워드 연계부 로 송신할 수 있다. 연계 대상 시그널과 연계 대상 시그널이 발생한 일자를 수신한 시그널 - 키워드 연계 부는 발행 문헌 데이터를 이용하여 발행 문헌 키워드 추출부가 추출한 키워드 중 시그널이 존재 하는 일자에 추출된 키워드를 수신한 시그널과 연계 시킬 수 있다. 연계 대상 시그널과 연계 대상 시그널이 발 생한 일자를 수신한 시그널 - 키워드 연계부는 발행 문헌 데이터를 이용하여 발행 문헌 키워드 추출 부가 추출한 키워드 중 시그널이 존재하는 일자에 추출된 키워드에 수신한 시그널과의 연계 가중치를 부여 할 수 있다. 일 실시예에서, 시그널 저장부로부터 시그널이 존재하는 일자를 수신한 시그널 - 키워드 연계부는 시 그널이 존재하는 일자에 발행한 발행 문헌 데이터에서 추출한 문헌 키워드를 시그널 - 키워드 연계부(19 0)에 제공할 수 있다. 상기 시그널 - 키워드 연계부로 제공된 키워드는 그 키워드가 문헌에 등장한 일자에 생성된 시그널과 연계될 수 있다. 일 실시예에서, 시그널 저장부로부터 제1 시그널이 존재하는 일자를 수신한 시그널 - 키워드 연계부 는 제1 시그널이 존재하는 일자에 발행한 발행 문헌 데이터에서 추출한 문헌 키워드에 제1 시그널과의 연 계 가중치를 부여할 수 있다. 상기 시그널 - 키워드 연계부로 제공된 키워드는 그 키워드가 문헌에 등장한 일자에 생성된 시그널과 연계될 수 있다. 일 실시예에서, 시그널 저장부로부터 제1 시그널이 존재하는 일자를 수신한 시그널 - 키워드 연계부 는 제1 시그널이 존재하는 일자에 발행한 발행 문헌 데이터에서 추출한 복수개의 키워드에 제1 시그널과의 연계 가중치를 제공할 수 있다. 상기 시그널 - 키워드 연계부로 제공된 제1 시그널과의 연계 가중치가 기 정의된 기준 이상인 복수개의 키워드는 제1 시그널과 연계될 수 있다. 일 실시예에서, 시그널 저장부로부터 제1 시그널이 존재하는 일자를 수신한 시그널 - 키워드 연계부 는 제1 시그널이 존재하는 일자에 발행한 발행 문헌 데이터에서 추출한 복수개의 키워드는 벡터화 모델에 입력될 수 있다. 상기 시그널 - 키워드 연계부로 제공된 제1 시그널과의 연계 가중치가 기 정의된 기준 이상인 복수개의 키워드와 근접하게 임베딩된 키워드는 제1 시그널과 연계될 수 있다. 일 실시예에서, 시그널 저장부로부터 제1 시그널이 존재하는 일자를 수신한 시그널 - 키워드 연계부 는 제1 시그널이 존재하는 일자에 발행한 발행 문헌 데이터에서 추출한 복수개의 키워드는 키워드 클러스 터링 모델에 입력될 수 있다. 상기 시그널 - 키워드 연계부로 제공된 제1 시그널과의 연계 가중치가 기 정 의된 기준 이상인 복수개의 키워드와 하나의 클러스터로 클러스터링된 키워드는 제1 시그널과 연계될 수 있다. 다음으로, 본 실시예에 따른 원부자재 공급망 예측 시스템은 획득한 품목 데이터와 연계된 주식 또는 의존율 및 수입액을 포함하는 경제 지표 데이터를 획득할 수 있다. 특정 품목과 연계된 주식은 테이블에 기 정 의되어 존재할 수 있다. 특정 품목의 특정 국가에 대한 생산 의존율은 기 생성된 의존율 데이터로 존재할 수 있 다. 특정 품목의 특정 국가에 대한 수입액은 기 생성된 수입액 데이터로 존재할 수 있다. 품목 데이터는 특정 국가에 대하여 의존율과 수입액이 일정한 기준 이상인 품목과 관련된 데이터를 포함할 수 있다. 품목 데이터는 대상 국가에게 특정 품목을 수출하는 국가 리스트를 포함할 수 있다. 품목 데이터는 특정 품목을 수출하는 수량이 많은 순으로 국가를 리스트업한 데이터를 포함할 수 있다. 품목 데이터는 특 정 품목을 수출하는 수입액이 많은 순으로 국가를 리스트업한 데이터를 포함할 수 있다. 품목 데이터는 특 정 품목을 미국으로 수출하는 국가를 리스트업한 데이터를 포함할 수 있다. 일 실시예에서, 원부자재 공급망 예측 시스템은 획득한 품목 데이터를 이용하여 대상 국가가 해외에 수입하는 의존도가 높은 품목을 출력할 수 있다. 원부자재 공급망 예측 시스템은 획득한 품목 데이터(50 0)를 이용하여 해외에 수입하는 의존도가 높아 공급망이 위험할 수 있는 상황을 미리 예측해야 할 품목 목록을 도출할 수 있다. 원부자재 공급망 예측 시스템은 획득한 품목 데이터를 이용하여 특정 상황과 현상이 발생할 시 공급망이 위험할 수 있는 품목 목록을 도출할 수 있다. 원부자재 공급망 예측 시스템은 획득한 품목 데이터를 이용하여 특정 상황과 현상이 발생할 시 공급망이 위험할 수 있는 품목 목록 및 공급망 위 험 회피 방법을 도출할 수 있다. 원부자재 공급망 예측 시스템은, 품목 데이터를 획득하여 획득한 품목을 시그널과 연계 시킬 수 있다. 이 는 도 2에 도시된 바와 같이, 시그널 - 품목 연계부에서 수행될 수 있다. 시그널 저장부로부터 시그 널이 존재하는 일자를 수신한 시그널 연계부가 연계 대상 시그널과 연계 대상 시그널이 발생한 일자를 송 신한 시그널 - 품목 연계부는 품목 데이터를 이용하여 시그널이 존재하는 일자 중 품목 데이터에 특 이점이 있는 일자를 도출할 수 있다. 일 실시예에서, 시그널 저장부로부터 시그널이 존재하는 일자를 수신한 시그널 - 품목 연계부는 시그 널이 존재하는 일자에 변동성이 기 정의된 기준 이상인 주식데이터와 연관되는 품목을 판단하여 품목 연계부에 제공할 수 있다. 시그널 저장부로부터 시그널이 존재하는 일자를 수신한 시그널 - 품목 연계부는 시 그널이 존재하는 일자에 변동성이 기 정의된 기준 이상인 수입액 데이터와 연관되는 품목을 판단하여 품목 연계 부에 제공할 수 있다. 상기 품목 연계부로 제공된 품목은 그 품목의 변수가 기 정의된 기준 이상의 변동성을 갖 는 일자에 생성된 시그널과 연계될 수 있다. 원부자재 공급망 예측 시스템은, 품목 데이터를 획득하여 획득한 품목을 키워드와 연계 시킬 수 있다. 이 는 도 2에 도시된 바와 같이, 키워드 - 품목 연계부에서 수행될 수 있다. 시그널 - 품목 연계부는 제 1 시그널과 연계된 품목을 시그널 연계부에 송신할 수 있고, 시그널 - 키워드 연계부는 제1 시그널과 연계된 키워드를 시그널 연계부에 송신할 수 있다. 제1 시그널과 연계된 품목과 제1 시그널과 연계된 키워 드를 시그널 연계부로부터 수신한 키워드 - 품목 연계부는 제1 시그널과 연계된 품목과 제1 시그널과 연계된 키워드를 연계시킬 수 있다. 일 실시예에서, 발행 문헌에서 추출한 제1 키워드를 획득한 원부자재 공급망 예측 시스템은 제1 키워드와 연계 된 품목이 공급망 위험 상태라고 판단할 수 있다. 다음으로, 본 실시예에 따른 원부자재 공급망 예측 시스템은 획득한 원부자재 공급망 위험 및 위험 회피 방법을 사용자 장치에 제공할 수 있다. 일 실시예에서, 원부자재 공급망 예측 시스템이 원부자재 공급망 위험을 감지하여 사용자 장치에 제공할 수 있 는 위험 회피 방법은, 대상 국가에게 특정 품목을 수출하는 국가 리스트를 포함할 수 있다. 일 실시예에서, 원 부자재 공급망 예측 시스템이 원부자재 공급망 위험을 감지하여 사용자 장치에 제공할 수 있는 위험 회피 방법 은, 특정 품목을 수출하는 수량이 많은 순으로 국가를 리스트업한 데이터를 포함할 수 있다. 일 실시예에서, 원 부자재 공급망 예측 시스템이 원부자재 공급망 위험을 감지하여 사용자 장치에 제공할 수 있는 위험 회피 방법은, 특정 품목을 수출하는 수입액이 많은 순으로 국가를 리스트업한 데이터를 포함할 수 있다. 일 실시예에서, 원부자재 공급망 예측 시스템이 원부자재 공급망 위험을 감지하여 사용자 장치에 제공할 수 있는 위험 회피 방 법은, 특정 품목을 미국으로 수출하는 국가를 리스트업한 데이터를 포함할 수 있다. 원부자재 공급망 예측 시스템은 국가 간환경에서 생성되는 Strong 시그널 및 Weak 시그널과, 국가 간환경 에서 수집된 경제/금융, 뉴스, 주식, 무역품목 데이터를 기반으로 통계적인 방법과 머신러닝 알고리즘을 이용해 도출한 데이터를 앙상블 하여 활용함으로써, 경제 데이터의 변동 원인이 국가인지 금융지표인지를 구분하는 효 과를 도출할 수 있다. 경제 데이터의 변동 원인을 구분하여 원부자재 공급망 위험을 회피할 시 보다 효율적인 방안을 선택하는 효과를 도출할 수 있다. 또한, 위험을 알리며 우선순위가 반영된 회피 방안을 동시에 제공하여 공급망 위험을 회피할 시 보다 효율적인 방안을 선택하는 효과를 도출할 수 있다. 지금까지 도 1 내지 2를 참조하여 본 발명의 일 실시예에 따른 원부자재 공급망 예측 시스템에 대하여 설명하였 다. 다음으로, 도 3 내지 도 7을 참조하여 본 개시의 몇몇 실시예에 따른, 원부자재 공급망 예측 방법을 설명한 다. 도 3 내지 7은 본 실시예에 따른, 원부자재 공급망 예측 방법의 순서도이다. 단, 이는 본 개시의 목적을 달 성하기 위한 바람직한 실시예일 뿐이며, 필요에 따라 일부 단계가 추가되거나 삭제될 수 있음은 물론이다. 이하 도 3을 참조하여, 본 개시의 다른 실시예에 원부자재 공급망 예측 방법에 대해 보다 구체적으로 설명한다. 이하 몇몇 순서도에서 설명될 단계는 특별한 언급이 없는 한 원부자재 공급망 예측 시스템에 의해 수행되는 것으로 이해될 수 있다. 도 3을 참조하면, 원부자재 공급망 예측 시스템은 대상 국가의 변수 데이터를 획득(S100)할 수 있다. 상기 대상 국가의 변수 데이터는 변수 데이터에서 수신된 데이터일 수 있다. 상기 대상 국가의 변수 데이터는 대상 국가인 대상 국가의 대표 경제지표인 환율, 금리, 유가와, 대표 경제지표인 환율, 금리, 유가의 일별 변동성, 대표 경제지표인 환율, 금리, 유가의 일정 기간별 변동성을 포함할 수 있다. 상기 변수 데이터는 특정 일의 국 제 금리, K-vix 등의 경제/금융 데이터를 추가로 포함할 수 있다. 대상 국가의 변수 데이터를 획득한 원부자재 공급망 예측 시스템은 Strong 시그널을 생성(S120)할 수 있다. 상 기 대상 국가의 대표 경제지표인 환율, 금리, 유가와, 대표 경제지표인 환율, 금리, 유가의 일별 변동성과, 대 표 경제지표인 환율, 금리, 유가의 일정 기간별 변동성을 획득한 원부자재 공급망 예측 시스템은 변수 별 제1 일의 변동성을 비교지수화하고, 일정 기간의 변동성을 이용하여 평균 비교지수를 생성할 수 있다. 변수 별 제1 일의 변동성을 비교지수화하는 것은, 제1 일과 그 하루 전일의 종가 차이를 계산하는 것일 수 있다. 변수 별 제1 일의 변동성을 비교지수화하는 것은, 제1 일과 그 하루 후일의 종가 차이를 계산하는 것일 수 있다. 원부자재 공급망 예측 시스템은 변수 별 제1 일의 비교지수가 일정 기간의 평균 비교지수보다 큰 경우 제1 일의 해당 변수를 시그널로 지정할 수 있다. 원부자재 공급망 예측 시스템은 시그널로 지정된 변수가 전체 변수의 절 반 이상이면 Strong 시그널을 생성할 수 있다. 원부자재 공급망 예측 시스템은 변수 별 당일종가와 당일시가 차이가 일정 기간의 평균 비교지수보다 큰 경우 제1 일의 해당 변수를 시그널로 지정할 수 있다. 원부자재 공급망 예측 시스템은 시그널로 지정된 변수가 전체 변수의 절반 이상이면 Strong 시그널을 생성할 수 있다. 원부자재 공급망 예측 시스템은 대상 국가의 변수 데이터와 Strong 시그널을 획득한 원부자재 공급망 예측 시스 템은 Weak 시그널을 생성(S140)할 수 있다. 원부자재 공급망 예측 시스템은 Strong 시그널을 label로 놓고 일자 별 변수를 기반으로 준지도학습 알고리즘을 활용하여 그래프 모형을 구성하고 Weak 시그널을 예측할 수 있다. 원부자재 공급망 예측 시스템은 Strong 시그널을 label로 놓고, 디마크 지표로 전처리하고, 데이터를 치환하여, Weak 시그널을 예측할 수 있다. 상기 Strong 시그널과 Weak 시그널을 생성한 원부자재 공급망 예측 시스템은 대상 국가의 제1 일에 발생한 시그 널(A)을 데이터로 이용할 수 있다. 원부자재 공급망 예측 시스템 특정 기간의 변수 흐름과 변수의 큰 변화를 나 타내는 Strong 시그널과, 특정 기간의 변수 흐름의 변수 별 연관도를 모두 나타내는 Weak 시그널을 반영하여 원 부자재 공급망을 예측함으로써, 각 데이터별 분석 방법을 보다 독립적으로 설계할 수 있고, 각각의 콜라보레이 션을 높일 수 있으며, 정확도가 높은 결과를 도출할 수 있다. 다음으로, 도 4를 참조하면, 원부자재 공급망 예측 시스템은 발행 문헌을 획득(S200)할 수 있다. 상기 발행 문 헌은 특정일에 발행된 뉴스와 신문 기사를 포함할 수 있다. 발행 문헌을 획득한 원부자재 공급망 예측 시스템은발행 문헌 키워드를 추출(S210)할 수 있다. 상기 발행 문헌 키워드는 발행 문헌에 포함된 핵심 키워드일 수 있 다. 상기 발행 문헌 키워드는 발행 문헌의 제목에 포함된 키워드일 수 있다. 상기 발행 문헌 키워드는 발행 문 헌에 반복해서 등장하는 키워드일 수 있다. 구체적으로 발행 문헌 키워드 추출부에서 발행 문헌으로부터 키워드를 추출할 수 있는 키워드 추출 model을 이용하여 발행 문헌에 포함된 키워드들이 추출될 수 있다. 발행 문헌 키워드 추출부는 발행 문헌으로부터의 키워드를 사용자로부터 입력 받을 수 있다. 발행 문헌 키워드를 획득한 원부자재 공급망 예측 시스템은, 대상 국가의 제1 일에 대한 시그널(A)를 반영하여, 대상 국가의 제1 일에 대한 시그널(A)에 포함된 제1 시그널과 제1 시그널이 발생한 제1 일에 발행한 문헌에 포 함된 키워드를 연동(S300)할 수 있다. 제1 시그널과 연동된 문헌 키워드를 획득한 원부자재 공급망 예측 시스템 은, 상기 제1 시그널과 연동된 문헌 키워드(B)를 데이터로 이용할 수 있다. 일 실시예에서, 상기 제1 시그널이 발생한 제1 일에 발행한 문헌에 포함된 키워드는 즉각적으로 연동될 수 있다. 상기 제1 시그널이 발생한 제1 일에 발행한 문헌에 포함된 키워드는 제1 시그널과의 연계 가중치를 부여 받고, 연계 가중치가 기 정의된 기준을 초과하면 자동으로 연동될 수 있다. 상기 제1 시그널이 발생한 제1 일에 발행한 문헌에 포함된 키워드는 제1 시그널과의 연계 가중치를 부여 받고, 제1 시그널과 연계 가중치가 존재하 는 키워드 중 가장 연계 가중치를 많이 부여 받은 키워드가 자동으로 제1 시그널에 연동될 수 있다. 다음으로, 도 5를 참조하면, 원부자재 공급망 예측 시스템은 품목 데이터를 획득(S400) 할 수 있다. 상기 품목 데이터는 획득한 품목 데이터와 연계된 주식 또는 의존율 및 수입액을 포함하는 경제 지표 데이터를 포함 할 수 있다. 상기 품목 데이터는 특정 국가에 대하여 의존율과 수입액이 일정한 기준 이상인 품목과 관련된 데 이터를 포함할 수 있다. 상기 품목 데이터는, 주식 또는 의존율 및 수입액을 포함하는 경제 지표 데이터를 포함할 수 있다. 품목 데이터 를 획득한 원부자재 공급망 예측 시스템은 대상 국가의 제1 일에 발생한 시그널(A)을 반영하여, 대상 국가의 제 1 일에 발생한 시그널(A)에 포함된 제1 시그널 발생일에 유의미한 변동성을 보인 품목 데이터를 획득(S410)할 수 있다. 제1 시그널 발생일에 유의미한 변동성을 보인 품목에는, 주식의 당일 종가와 당일 시가를 비교한 지수가 특정 기간 동안의 평균을 비교한 지수보다 큰 품목이 포함될 수 있다. 제1 시그널 발생일에 유의미한 변동성을 보인 품목에는, 수입액이 특정 기간 동안의 평균 미만으로 감소한 품목이 포함될 수 있다. 제1 시그널 발생일에 유의 미한 변동성을 보인 품목에는, 품목의 제공 국가 또는 기업이 변경된 품목이 포함될 수 있다. 원부자재 공급망 예측 시스템은, 유의미한 변동성을 보인 품목 데이터에 해당하는 품목과 제1 시그널을 연동 (S500)시킬 수 있다. 유의미한 변동성을 보인 품목 데이터는 원부자재 품목 테이블을 반영(S420)하여 선정될 수 있다. 제1 시그널과 연동된 품목을 획득한 원부자재 공급망 예측 시스템은, 상기 제1 시그널과 연동된 품목(C) 을 데이터로 이용할 수 있다. 일 실시예에서, 상기 제1 시그널이 발생한 제1 일에 유의미한 변동성을 보인 품목은 즉각적으로 연동될 수 있다. 상기 제1 시그널이 발생한 제1 일에 유의미한 변동성을 보인 품목은 제1 시그널과의 연계 가중치를 부여 받고, 연계 가중치가 기 정의된 기준을 초과하면 자동으로 연동될 수 있다. 상기 제1 시그널이 발생한 제1 일에 유의미한 변동성을 보인 품목은 제1 시그널과의 연계 가중치를 부여 받고, 제1 시그널과 연계 가중치가 존재하 는 품목 중 가장 연계 가중치를 많이 부여 받은 품목이 자동으로 제1 시그널에 연동될 수 있다. 다음으로, 도 6을 참조하면, 원부자재 공급망 예측 시스템은, 제1 시그널과 연동된 문헌 키워드(B) 데이터와, 제1 시그널과 연동된 품목(C) 데이터를 이용하여 품목과 키워드를 연동(S600)시킬 수 있다. 원부자재 공급망 예 측 시스템은, 연동된 품목과 키워드(D)를 데이터로 이용할 수 있다. 일 실시예에서, 제1 시그널이 생성된 날에 발행된 제1 문헌에 포함된 제1 키워드와, 제1 시그널이 생성된 날에 의미한 변동성을 보인 품목이 연동될 수 있다. 연동된 품목과 키워드(D) 데이터를 이용하여, 원부자재 공급망 예측 시스템은 발행 문헌으로부터 발행일에 공급 망이 위험한 품목을 도출하고, 해당 품목의 공급망 위험을 회피하는 방안을 도출하여, 사용자에게 출력할 수 있 다. 위의 동작은, 도 7을 참조하여 설명할 수 있다. 우선 원부자재 공급망 예측 시스템은 제1 발행 문헌을 획득(S700)할 수 있다. 제1 발행 문헌은 대상일의 뉴스 또는 신문 기사일 수 있다. 다음으로 원부자재 공급망 예측 시스템은 상기 제1 발행 문헌으로부터 제1 키워드를 획득(S710)할 수 있다. 제1 키워드는 발행 문헌으로부터 키워드를 추출할 수 있는 키워드 추출 model을 이용하여 획득할 수 있다. 발행 문헌 키워드 추출부는 발행 문헌으로부터의 키워드를 사용자로부터 입력 받을 수 있다. 다음으로, 원부자재 공급망 예측 시스템은 획득한 연동된 품목과 키워드(D) 데이터를 반영하여 제1 키워드에 연동되는 품목을 판단할 수 있다(S720). 원부자재 공급망 예측 시스템은 제1 키워드에 연동된 위험 품목이 없는 것으로 판단되면, 위험 품목을 예측하는 과정을 마무리할 수 있다. 원부자재 공급망 예측 시스템은, 제1 키워드에 연동된 위험 품목이 존재하는 것으로 판단되면, 위험 품목과, 위 험 품목에 대한 위험 신호를 출력(S730)하고, 위험 품목에 대한 위험 회피 방안 추천 리스트를 출력(S740)하여 동작을 마무리할 수 있다. 위험 품목에 대한 위험 회피 방안 추천 리스트는, 특정 품목을 수출하는 수량이 많은 순으로 국가를 리스트업한 리스트일 수 있다. 위험 품목에 대한 위험 회피 방안 추천 리스트는, 특정 품목을 수출하는 수입액이 많은 순으 로 국가를 리스트업한 리스트일 수 있다. 위험 품목에 대한 위험 회피 방안 추천 리스트는, 특정 품목을 미국으 로 수출하는 국가를 리스트업한 리스트일 수 있다. 위험 품목에 대한 위험 회피 방안 추천 리스트는, 원부자재 공급망 예측 시스템이 감지한 키워드와 유관한 국가 및 기업을 배제하고 리스트업한 리스트일 수 있다. 원부자 재 공급망 예측 시스템은, 안정적이며 위험과 무관한 국가 및 기업을 우선으로 제안하여 사용자의 판단을 효과 적으로 지원할 수 있다. 도 8은 본 개시의 몇몇 실시예들에서 구성 요소로 이용될 수 있는 컴퓨팅 시스템의 하드웨어 구성도이다. 도 8 에 도시된 원부자재 공급망 예측 시스템은, 하나 이상의 프로세서, 시스템 버스, 통신 인터페 이스, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(load)하는 메모리와, 컴퓨 터 프로그램을 저장하는 스토리지를 포함할 수 있다. 프로세서는 원부자재 공급망 예측 시스템의 각 구성의 전반적인 동작을 제어한다. 프로세서는 본 개시의 다양한 실시예들에 따른 방법/동작을 실행하기 위한 적어도 하나의 애플리케이션 또는 프로그램에 대 한 연산을 수행할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 다양한 실시예들에 따른 방법/동작들을 실행하기 위하여 스토리지로부터 하나 이상의 컴퓨터 프로그램을 로드(load) 할 수 있다. 스토리지는 하나 이상의 컴퓨터 프로그램을 비임시적으로 저장할 수 있다. 컴퓨터 프로그램 은 본 개시의 다양한 실시예들에 따른 방법/동작들이 구현된 하나 이상의 인스트럭션들(instructions)을 포함할 수 있다. 컴퓨터 프로그램이 메모리에 로드 되면, 프로세서는 상기 하나 이상의 인스트럭션들을 실행 시킴으로써 본 개시의 다양한 실시예들에 따른 방법/동작들을 수행할 수 있다. 몇몇 실시예들에서, 도 8을 참조하여 설명된 원부자재 공급망 예측 시스템은 가상 머신 등 클라우드 기술 에 기반하여 서버 팜(server farm)에 포함된 하나 이상의 물리 서버(physical server)를 이용하여 구성될 수 있 다. 이 경우, 도 8에 도시된 구성 요소 중 프로세서, 메모리 및 스토리지 중 적어도 일부는 가상 하드웨어(virtual hardware)일 수 있을 것이며, 통신 인터페이스 또한 가상 스위치(virtual switch) 등 가상화된 네트워킹 요소로 구성될 수 있을 것이다. 컴퓨터 프로그램은 키워드 그룹 자동 생성 동작을 수행하기 위한 인스트럭션들(instructions)을 포함할 수 있다. 컴퓨터 프로그램이 메모리에 로드되면, 프로세서는 상기 인스트럭션들을 실행시킴 으로써 본 개시의 다양한 실시예들에 따른 방법/동작들을 수행할 수 있다. 지금까지 도 1 내지 도 8을 참조하여 본 개시의 다양한 실시예들 및 그 실시예들에 따른 효과들을 언급하였다. 본 개시의 기술적 사상에 따른 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효 과들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다. 지금까지 설명된 본 개시의 기술적 사상은 컴퓨터가 읽을 수 있는 매체 상에 컴퓨터가 읽을 수 있는 코드로 구 현될 수 있다. 상기 컴퓨터로 읽을 수 있는 기록 매체에 기록된 상기 컴퓨터 프로그램은 인터넷 등의 네트워크 를 통하여 다른 컴퓨팅 시스템에 전송되어 상기 다른 컴퓨팅 시스템에 설치될 수 있고, 이로써 상기 다른 컴퓨 팅 시스템에서 사용될 수 있다. 도면에서 동작들이 특정한 순서로 도시되어 있지만, 반드시 동작들이 도시된 특정한 순서로 또는 순차적 순서로 실행되어야만 하거나 또는 모든 도시 된 동작들이 실행되어야만 원하는 결과를 얻을 수 있는 것으로 이해되어서 는 안 된다. 특정 상황에서는, 멀티태스킹 및 병렬 처리가 유리할 수도 있다. 이상 첨부된 도면을 참조하여 본"}
{"patent_id": "10-2023-0019937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "개시의 실시예들을 설명하였지만, 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자는 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 본 개시가 다른 구체적인 형태로도 실시될 수 있다는 것을 이해할 수 있다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적인 것이 아닌 것으로 이해해야만 한 다. 본 개시의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 개시에 의해 정의되는 기술적 사상의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0019937", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 원부자재 공급망 예측 시스템의 구성도이다. 도 2는 본 개시의 다른 실시예에 따른 원부자재 공급망 예측 서버를 설명하기 위한 블록도이다. 도 3 내지 7은 본 개시의 일 실시예에 따른 원부자재 공급망 예측 방법의 순서도이다. 도 8은 본 개시의 몇몇 실시예에서 구성 요소로서 이용되는 분류체계의 동적 연계 시스템의 하드웨어 구성도이다."}
