{"patent_id": "10-2021-0059426", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0152477", "출원번호": "10-2021-0059426", "발명의 명칭": "통신 시스템에서 HARQ 프로세스를 지시하는 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "여정호"}}
{"patent_id": "10-2021-0059426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 제어 신호 처리 방법에 있어서,기지국으로부터 전송되는 제1 제어 신호를 수신하는 단계;상기 수신된 제1 제어 신호를 처리하는 단계; 및상기 처리에 기반하여 생성된 제2 제어 신호를 상기 기지국으로 전송하는 단계를 포함하는 것을 특징으로 하는제어 신호 처리 방법."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 4G 시스템 이후 보다 높은 데이터 전송률을 지원하기 위한 5G 통신 시스템을 IoT 기술과 융합하는 통 신 기법 및 그 시스템에 관한 것이다. 본 개시는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스 (예 를 들어, 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 헬스 케어, 디지털 교육, 소매업, 보안 및 안전 관련 서비스 등)에 적용될 수 있다. 본 개시는 HARQ process ID를 설정, 지시, 운영하는 방법 및 장치를 개시한다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 통신 시스템에서 HARQ (hybrid automatic repeat request) 프로세스의 수를 설정하고 ID 값을 지시 하는 방법 및 장치에 관한 것으로서, 특히 HARQ process 수가 많거나 가변적인 환경에서, 예를 들어 위성 통신 시스템에서 단말이 위성을 통해 기지국과 신호를 송수신하는 경우, 하향링크 및 상향링크의 HARQ process를 이 용하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시 스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 4G 네트워크 이후 (Beyond 4G Network) 통신 시스템 또는 LTE 시스템 이후 (Post LTE) 시스템이라 불리어지고 있다. 3GPP에서 정한 5G 통신 시스템은 New Radio (NR) 시스템이라고 불리고 있다. 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파(mmWave) 대역 (예를 들어, 60기가(60GHz) 대 역과 같은)에서의 구현이 고려되고 있다. 초고주파 대역에서의 전파의 경로손실 완화 및 전파의 전달 거리를 증 가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO), 전차원 다 중입출력(Full Dimensional MIMO: FD-MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam- forming), 및 대규모 안테나(large scale antenna) 기술들이 논의되었고, NR 시스템에 적용되었다. 또한 시스템의 네트워크 개선을 위해, 5G 통신 시스템에서는 진화된 소형 셀, 개선된 소형 셀(advanced small cell), 클라우드 무선 액세스 네트워크(cloud radio access network: cloud RAN), 초고밀도 네트워크(ultra- dense network), 기기 간 통신(Device to Device communication: D2D), 무선 백홀(wireless backhaul), 이동 네트워크(moving network), 협력 통신(cooperative communication), CoMP(Coordinated Multi-Points), 및 수신 간섭제거(interference cancellation) 등의 기술 개발이 이루어지고 있다. 이 밖에도, 5G 시스템에서는 진보된 코딩 변조(Advanced Coding Modulation: ACM) 방식인 FQAM(Hybrid FSK and QAM Modulation) 및 SWSC(Sliding Window Superposition Coding)과, 진보된 접속 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non-orthogonal multiple access), 및 SCMA(sparse code multiple access) 등이 개발되 고 있다. 한편, 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 IoT(Internet of Things, 사물인터넷) 망으로 진화하고 있다. 클라우드 서버 등과 의 연결을 통한 빅데이터(Big data) 처리 기술 등이 IoT 기술에 결합된 IoE(Internet of Everything) 기술도 대두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소 들이 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 연구되고 있다. IoT 환경에서는 연결된 사물들에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능 형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(Information Technology)기술과 다양한 산업 간의 융합 및 복합을 통하여 스마트홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마 트 그리드, 헬스 케어, 스마트 가전, 첨단의료서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도들이 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 5G 통신이 빔 포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처리 기술로써 클라우드 무선 액세스 네트워크(cloud RAN)가 적용되는 것도 5G 기술과 IoT 기술 융합의 일 예라고 할 수 있을 것이다. 한편, 2010년대 후반 및 2020년대에 들어서 위성 발사 비용이 획기적으로 감소됨에 따라, 위성을 통한 통신 서 비스를 제공하려는 회사들이 늘어났다. 이에 따라 위성 네트워크가 기존 지상 네트워크를 보완하는 차세대 네트 워크 시스템으로 부상하였다. 이는 지상 네트워크 수준의 사용자 경험을 제공하지 못할 가능성도 있지만, 지상 네트워크 구축이 어려운 지역 또는 재난 상황에서도 통신 서비스를 제공하는 것이 가능하다는 장점을 가질 뿐만 아니라, 앞서 설명하였듯이 최근 위성 발사 비용의 급격한 감소로 경제성까지 확보하였다. 또한, 일부 업체들 및 3GPP (3rd Generation Partnership Project) 표준에서는 스마트폰과 위성간 직접 통신에 대해서도 연구를 진 행하고 있다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "위성 네트워크에서 단말이 위성을 통해 기지국과 연결하고자 하는 경우, 단말과 위성간, 그리고 상기 위성과 지 상의 기지국간에는 수백 km, 수천 km 또는 그 상의 긴 거리로 인해, 전파가 도달되는데 큰 전파 지연 시간 (propagation delay)이 발생할 수 있다. 일반적으로, 상기 위성 네트워크에서의 단말과 위성간의 전파 지연 시 간 혹은 위성과 기지국간의 전파 지연 시간은 지상 네트워크에서 단말과 기지국이 직접 통신할 경우에 발생할 수 있는 전파 지연 시간에 비해 훨씬 크다. 기존의 LTE 또는 NR 시스템에서는 물리계층에서 데이터를 초기 전송하고 실패할 경우 재전송을 수행하며, 초기 전송과 재전송한 데이터의 수신값을 수신단에서 결합하여 디코딩이 가능하도록 설계되어 있다. 이를 위해 HARQ 피드백 및 재전송을 사용하며, 이는 Error Correction Code를 이용하여 parity 비트를 추가적으로 보내 에러를 정정할 수 있는 FEC 방식(forward error correction)과 송신한 데이터를 재전송하는 ARQ(automatic repeat request)를 결합한 방식이며, 이는 수신한 데이터의 에러 여부를 확인하고 에러가 발생하면 수신기는 송신기에 게 재전송을 요구할 수 있다. 이러한 HARQ 전송 방식은 한번 데이터를 송신하면, 에러여부를 가리키는 피드백 정보가 다시 송신단으로 보내지기까지 시간이 소요되므로, 그 동안 다른 데이터를 송신할 수 있다. 이 때, 이전 에 전송한 다른 데이터와의 구분을 위해서 HARQ process를 정의하며 각 HARQ process마다 인덱스번호가 부여된 다. 즉, 다른 데이터들은 다른 인덱스 번호를 갖는 HARQ process들에 매핑되어 전송될 수 있고, 송수신기들은 상기 HARQ process의 ID 값을 이용해 데이터를 구분할 수 있다. 어느 하나의 HARQ process ID를 통해 데이터를 전송하면, 수신기는 기존에 동일한 HARQ process ID로 전송된 이전의 데이터는 메모리(또는 소프트버퍼)에서 지 우거나 새로운 데이터로 덮어씌움으로써 수신할 수 있게 된다. 즉, 송수신기가 사용하는 HARQ process의 개수만큼 서로 다른 종류의 데이터들을 연속적으로 송수신할 수 있을 것이다. 종래의 NR 시스템은 하향링크와 상향링크에서 최대 16개의 HARQ process를 사용했으므로, 연속적으로 16개의 다른 데이터를 송수신하는 것이 가능하다. 하지만, NTN(non-terrestrial network)에서는 한번 전송한 데 이터의 전송 성공 및 실패 여부가 수십~수백 ms 이후에 수신기로부터 송신기에 도달하게 되므로, 16개의 HARQ process로는 계속적인 데이터 전송이 불가능할 수 있다. 이에 따라 더 많은 수의 HARQ process를 이용하여 데이 터의 송수신이 필요할 수 있으며, 이를 위해 HARQ process 수를 설정하거나 지시하고, HARQ process ID를 지시 하는 방법이 필요할 수 있다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명은 무선 통신 시스템에서 제어 신호 처리 방법에 있어서, 기지국으 로부터 전송되는 제1 제어 신호를 수신하는 단계; 상기 수신된 제1 제어 신호를 처리하는 단계; 및 상기 처리에 기반하여 생성된 제2 제어 신호를 상기 기지국으로 전송하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "제안하는 실시 예들에 따르면, 많은 수의 HARQ process가 요구되는 상황에서 효율적으로 HARQ process를 설정, 지시, 운영하는 것이 가능하게 된다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예들을 상세히 설명한다. 이 때, 첨부된 도면에서 동일 한 구성 요소는 가능한 동일한 부호로 나타내고 있음에 유의해야 한다. 또한 본 발명의 요지를 흐리게 할 수 있 는 공지 기능 및 구성에 대한 상세한 설명은 생략할 것이다. 본 명세서에서 실시 예를 설명함에 있어서 본 발명이 속하는 기술 분야에 익히 알려져 있고 본 발명과 직접적으 로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행 될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가 능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들 을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA 또는 ASIC과 같은 하드웨어 구성요소 를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성 요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저 들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공 되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 새로운 5G 통신인 NR (New Radio access technology)에서는 시간 및 주파수 자원에서 다양한 서비스들이 자유롭 게 다중화 될 수 있도록 하기 위하여 디자인되고 있으며, 이에 따라 waveform/numerology 등과 기준 신호 등이 해당 서비스의 필요에 따라 동적으로 혹은 자유롭게 할당될 수 있다. 무선 통신에서 단말에게 최적의 서비스를 제공하기 위해서는 채널의 질과 간섭량의 측정을 통한 최적화 된 데이터 송신이 중요하며, 이에 따라 정확한 채 널 상태 측정은 필수적이다. 하지만, 주파수 자원에 따라 채널 및 간섭 특성이 크게 변화하지 않는 4G 통신과는 달리 5G 채널의 경우 서비스에 따라 채널 및 간섭 특성이 크게 변화하기 때문에 이를 나누어 측정할 수 있도록 하는 FRG(Frequency Resource Group) 차원의 subset의 지원이 필요하다. 한편, NR 시스템에서는 지원되는 서비 스의 종류를 eMBB (Enhanced mobile broadband), mMTC (massive Machine Type Communications) (mMTC), URLLC (Ultra-Reliable and low-latency Communications) 등의 카테고리로 나눌 수 있다. eMBB는 고용량데이터의 고 속 전송, mMTC는 단말전력 최소화와 다수 단말의 접속, URLLC는 고신뢰도와 저지연을 목표로 하는 서비스라고 볼 수 있다. 단말에게 적용되는 서비스의 종류에 따라 서로 다른 요구사항들이 적용될 수 있다. 이와 같이 통신 시스템에서 복수의 서비스가 사용자에게 제공될 수 있으며, 이와 같은 복수의 서비스를 사용자 에게 제공하기 위해 특징에 맞게 각 서비스를 동일한 시구간 내에서 제공할 수 있는 방법 및 이를 이용한 장치 가 요구된다. 무선 통신 시스템은 초기의 음성 위주의 서비스를 제공하던 것에서 벗어나 예를 들어, 3GPP의 HSPA (high speed Packet Access), LTE (long term evolution 혹은 E-UTRA (evolved universal terrestrial radio access)), LTE-Advanced (LTE-A), 3GPP2의 HRPD (high rate packet data), UMB (ultra mobile broadband), 및 IEEE의 802.16e 등의 통신 표준과 같이 고속, 고품질의 패킷 데이터 서비스를 제공하는 광대역 무선 통신 시스템으로발전하고 있다. 또한, 5세대 무선통신 시스템으로 5G 혹은 NR (new radio)의 통신표준이 만들어지고 있다. 상기 광대역 무선 통신 시스템의 대표적인 예로, NR 시스템에서는 하향링크 (downlink; DL) 및 상향링크에서는 OFDM (orthogonal frequency division multiplexing) 방식을 채용하고 있다. 다만 보다 구체적으로는 하향링크 에서는 CP-OFDM (cyclic-prefix OFDM) 방식이 채용되었고, 상향링크에서는 CP-OFDM과 더불어 DFT-S-OFDM (discrete Fourier transform spreading OFDM) 방식 두 가지가 채용되었다. 상향링크는 단말 (user equipment: UE) 혹은 MS (mobile station))이 기지국(gNode B, 혹은 base station(BS))으로 데이터 혹은 제어신호를 전송 하는 무선링크를 뜻하고, 하향링크는 기지국이 단말로 데이터 혹은 제어신호를 전송하는 무선링크를 뜻한다. 상 기와 같은 다중 접속 방식은, 통상 각 사용자 별로 데이터 혹은 제어정보를 실어 보낼 시간-주파수 자원을 서로 겹치지 않도록, 즉 직교성 (Orthogonality)이 성립하도록, 할당 및 운용함으로써 각 사용자의 데이터 혹은 제어 정보를 구분한다. NR 시스템은 초기 전송에서 복호 실패가 발생된 경우, 물리 계층에서 해당 데이터를 재전송하는 HARQ (hybrid automatic repeat request) 방식을 채용하고 있다. HARQ 방식이란 수신기가 데이터를 정확하게 복호화(디코 딩)하지 못한 경우, 수신기가 송신기에게 디코딩 실패를 알리는 정보 (negative acknowledgement: NACK)를 전송 하여 송신기가 물리 계층에서 해당 데이터를 재전송할 수 있게 한다. 수신기는 송신기가 재전송한 데이터를 이 전에 디코딩 실패한 데이터와 결합하여 데이터 수신성능을 높이게 된다. 또한, 수신기가 데이터를 정확하게 복 호한 경우 송신기에게 디코딩 성공을 알리는 정보 (acknowledgement: ACK)를 전송하여 송신기가 새로운 데이터 를 전송할 수 있도록 할 수 있다. 도 1은 NR 시스템에서 하향링크 혹은 상향링크에서 상기 데이터 혹은 제어채널이 전송되는 무선자원영역인 시간 -주파수영역의 기본 구조를 나타낸 도면이다. 도 1에서 가로축은 시간영역을, 세로축은 주파수영역을 나타낸다. 시간영역에서의 최소 전송단위는 OFDM 심볼로 서, Nsymb 개의 OFDM 심볼이 모여 하나의 슬롯을 구성한다. 서브프레임의 길이는 1.0ms으로 정의되고, 라디오 프레임은 10 ms로 정의된다. 주파수영역에서의 최소 전송단위는 서브캐리어로서, 전체 시스템 전송 대역(transmission bandwidth)의 대역폭은 총 NBW 개의 서브캐리어로 구성된다. 1 프레임은 10ms로 정의될 수 있다. 1 서브프레임은 1ms로 정의될 수 있으며, 따라서 1 프레임은 총 10개의 서브프레임으로 구성될 수 있다. 1 슬롯은 14개의 OFDM 심볼로 정의될 수 있다(즉 1 슬롯 당 심볼 수( )=14). 1 서브프레임 은 하나 또는 복수 개의 슬롯으로 구성될 수 있으며, 1 서브프레임당 슬롯의 개수는 부반송파 간격에 대한 설정 값 μ에 따라 다를 수 있다. 도 2의 일 예에서는 부반송파 간격 설정 값으로 μ=0인 경우와 μ=1인 경우가 도시 되어 있다. μ=0일 경우, 1 서브프레임은 1개의 슬롯으로 구성될 수 있고, μ=1일 경우, 1 서브프레임은 2개의 슬롯으로 구성될 수 있다. 즉 부반송파 간격에 대한 설정 값 μ에 따라 1 서브프레임 당 슬롯 수( )가 달라질 수 있고, 이에 따라 1 프레임 당 슬롯 수( )가 달라질 수 있다. 각 부반송파 간격 설정 μ에 따 른 및 는 하기의 표 1로 정의될 수 있다. [표 1]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "RRC(radio resource control) 연결 전의 단말은 초기 접속을 위한 초기 대역폭부분(initial bandwidth part, initial BWP)을 MIB(master information block)를 통해 기지국으로부터 설정 받을 수 있다. 보다 구체적으로 설명하면, 단말은 초기 접속 단계에서 MIB를 통해 초기 접속에 필요한 시스템 정보(remaining system information; RMSI 또는 system information block 1; SIB1에 해당할 수 있음)를 수신하기 위한PDCCH(physical downlink control channel)가 전송될 수 있는 제어영역(control resource set, CORESET)과 탐 색 공간(search space)에 대한 설정 정보를 수신할 수 있다. MIB로 설정되는 제어영역과 탐색공간은 각각 식별 자(Identity, ID) 0으로 간주될 수 있다. 기지국은 단말에게 MIB를 통해 제어영역#0에 대한 주파수 할당 정보, 시간 할당 정보, 뉴머롤로지(numerology) 등의 설정 정보를 통지할 수 있다. 또한 기지국은 단말에게 MIB를 통 해 제어영역#0에 대한 모니터링 주기 및 occasion에 대한 설정정보, 즉 탐색공간#0에 대한 설정 정보를 통지할 수 있다. 단말은 MIB로부터 획득한 제어영역#0으로 설정된 주파수 영역을 초기 접속을 위한 초기 대역폭부분으 로 간주할 수 있다. 이때, 초기 대역폭부분의 식별자(ID)는 0으로 간주될 수 있다. MIB는 하기와 같은 정보를 포함하고 있을 수 있다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "대역폭부분을 설정하는 방법에 있어서, RRC 연결(connected) 전의 단말들은 초기 접속 단계에서 MIB을 통해 초 기 대역폭부분에 대한 설정 정보를 수신할 수 있다. 보다 구체적으로 설명하면, 단말은 PBCH(physical broadcast channel)의 MIB로부터 SIB를 스케쥴링하는 DCI(downlink control information)가 전송될 수 있는 하 향링크 제어채널을 위한 제어영역을 설정 받을 수 있다. 이 때 MIB로 설정된 제어영역의 대역폭이 초기 대역폭 부분으로 간주될 수 있으며, 설정된 초기 대역폭부분을 통해 단말은 SIB가 전송되는 PDSCH(physical downlink shared channel)를 수신할 수 있다. 초기 대역폭부분은 SIB을 수신하는 용도 외에도, 다른 시스템 정보(other system information, OSI), 페이징(paging), 랜덤 엑세스(random access) 용으로 활용될 수도 있다. 단말에게 하나 이상의 대역폭부분이 설정되었을 경우, 기지국은 단말에게 DCI 내의 대역폭부분 지시자 (bandwidth part indicator) 필드를 이용하여, 대역폭부분에 대한 변경을 지시할 수 있다. 시간-주파수영역에서 자원의 기본 단위는 자원 요소(112, resource element; RE)로서 OFDM 심볼 인덱스 및 서브 캐리어 인덱스로 나타낼 수 있다. 리소스 블록(108, resource block; RB 혹은 physical resource block; PRB) 은 주파수 영역에서 NRB개의 연속된 서브캐리어로 정의된다. 일반적으로 데이터의 최소 전송단위는 상기 RB 단위이다. NR 시스템에서 일반적으로 상기 Nsymb = 14, NRB=12 이고, NBW 는 시스템 전송 대역의 대역폭에 비례한다. 단말에게 스케줄링 되는 RB 개수에 비례하여 데이터 레이트가 증가될 수 있다. NR 시스템에서는 하향링크와 상향링크를 주파수로 구분하여 운영하는 FDD 시스템의 경우, 하향링크 전송 대역폭 과 상향링크 전송 대역폭이 서로 다를 수 있다. 채널 대역폭은 시스템 전송 대역폭에 대응되는 RF 대역폭을 나 타낸다. 표 2와 표 3은 각각 6 GHz 보다 낮은 주파수 대역 그리고 6 GHz 보다 높은 주파수 대역에서의 NR 시스 템에 정의된 시스템 전송 대역폭, 부반송파 너비 (subcarrier spacing)과 채널 대역폭 (channel bandwidth)의 대응관계의 일부를 나타낸다. 예를 들어, 30 kHz 부반송파 너비로 100 MHz 채널 대역폭을 갖는 NR 시스템은 전 송 대역폭이 273개의 RB로 구성된다. 하기에서 N/A는 NR 시스템에서 지원하지 않는 대역폭-부반송파 조합일 수 있다. [표 2]FR1(frequency range 1)의 구성"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "[표 3]FR2(frequency range 2)의 구성"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "NR 시스템에서 주파수 영역 (frequency range)는 FR1과 FR2로 아래 표 4와 같이 나뉘어 정의될 수 있다. [표 4]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "상기에서 FR1과 FR2의 범위는 다르게 변경되어 적용되는 것이 가능할 것이다. 일례로 FR1의 주파수 범위는 450 MHz부터 6000 MHz까지로 변경되어 적용될 수 있다. 다음으로 5G에서의 SS(synchronization signal)/PBCH 블록에 대하여 설명하도록 한다. SS/PBCH 블록이란 PSS(primary SS), SSS(secondary SS), PBCH로 구성된 물리계층 채널 블록을 의미할 수 있다. 구체적으로는 하기와 같다. - PSS: 하향링크 시간/주파수 동기의 기준이 되는 신호로 셀 ID 의 일부 정보를 제공한다. - SSS: 하향링크 시간/주파수 동기의 기준이 되고, PSS 가 제공하지 않은 나머지 셀 ID 정보를 제공한다. 추가 적으로 PBCH 의 복조를 위한 기준신호(reference signal) 역할을 할 수 있다. - PBCH: 단말의 데이터채널 및 제어채널 송수신에 필요한 필수 시스템 정보를 제공한다. 필수 시스템 정보는 제 어채널의 무선자원 매핑 정보를 나타내는 탐색공간 관련 제어정보, 시스템 정보를 전송하는 별도의 데이터 채널 에 대한 스케쥴링 제어정보 등을 포함할 수 있다. - SS/PBCH 블록: SS/PBCH 블록은 PSS, SSS, PBCH의 조합으로 이뤄진다. SS/PBCH 블록은 5ms 시간 내에서 하나 또는 복수 개가 전송될 수 있고, 전송되는 각각의 SS/PBCH 블록은 인덱스로 구별될 수 있다. 단말은 초기 접속 단계에서 PSS 및 SSS를 검출할 수 있고, PBCH를 디코딩할 수 있다. 단말은 PBCH로부터 MIB를 획득할 수 있고 이로부터 제어영역#0 (제어영역 인덱스가 0인 제어영역에 해당할 수 있음)을 설정 받을 수 있다. 단말은 선택한 SS/PBCH 블록과 제어영역#0에서 전송되는 DMRS(demodulation reference signal)이 QCL(quasi co location)되어 있다고 가정하고 제어영역#0에 대한 모니터링을 수행할 수 있다. 단말은 제어영역 #0에서 전송된 하향링크 제어정보로 시스템 정보를 수신할 수 있다. 단말은 수신한 시스템 정보로부터 초기 접 속에 필요한 RACH(random access channel) 관련 설정 정보를 획득할 수 있다. 단말은 선택한 SS/PBCH 인덱스를 고려하여 PRACH(physical RACH)를 기지국으로 전송할 수 있고, PRACH를 수신한 기지국은 단말이 선택한 SS/PBCH 블록 인덱스에 대한 정보를 획득할 수 있다. 이러한 과정을 통해 기지국은 단말이 각각의 SS/PBCH 블록들 중에 서 어떤 블록을 선택하였고 이와 연관되어 있는 제어영역#0을 모니터링한다는 사실을 알 수 있다. 다음으로 5G 시스템에서의 하향링크 제어 정보(DCI)에 대해 구체적으로 설명한다. 5G 시스템에서 상향링크 데이터(또는 물리 상향링크 데이터 채널(physical uplink shared channel, PUSCH)) 또 는 하향링크 데이터(또는 물리 하향링크 데이터 채널(physical downlink shared channel, PDSCH))에 대한 스케 줄링 정보는 DCI를 통해 기지국으로부터 단말에게 전달된다. 단말은 PUSCH 또는 PDSCH에 대하여 대비책 (fallback)용 DCI 포맷과 비대비책(non-fallback)용 DCI 포맷을 모니터링(monitoring)할 수 있다. 대비책 DCI 포맷은 기지국과 단말 사이에서 선정의된 고정된 필드로 구성될 수 있고, 비대비책용 DCI 포맷은 설정 가능한 필드를 포함할 수 있다. 이 외에도 DCI에는 여러 가지 포맷이 존재하며, 각 포맷에 따라 전력제어 용 DCI인지, SFI(slot format indicator)를 통지하기 위한 DCI인지 여부 등을 나타낼 수 있다. DCI는 채널코딩 및 변조 과정을 거쳐 물리 하향링크 제어 채널인 PDCCH을 통해 전송될 수 있다. DCI 메시지 페 이로드(payload)에는 CRC(cyclic redundancy check)가 부착되며 상기 CRC는 단말의 신원에 해당하는 RNTI(radio network temporary identifier)로 스크램블링(scrambling) 될 수 있다. DCI 메시지의 목적, 예를 들어 단말-특정(UE-specific)의 데이터 전송, 전력 제어 명령 또는 랜덤 엑세스 응답 등에 따라 서로 다른 RNTI 들이 사용될 수 있다. 즉, RNTI는 명시적으로 전송되지 않고 CRC 계산과정에 포함되어 전송된다. PDCCH 상으로 전송되는 DCI 메시지를 수신하면 단말은 할당 받은 RNTI를 사용하여 CRC를 확인하여 CRC 확인 결과가 맞으면 단 말은 해당 메시지가 단말에게 전송된 것임을 알 수 있다. 상기 PDCCH는 단말에게 설정된 제어자원집합 (control resource set: CORESET)에서 매핑되어 전송된다. 예를 들면, 시스템 정보(system information, SI)에 대한 PDSCH를 스케줄링하는 DCI는 SI-RNTI로 스크램블링될 수 있다. RAR(random access response) 메시지에 대한 PDSCH를 스케줄링하는 DCI는 RA-RNTI로 스크램블링 될 수 있다. 페이징(paging) 메시지에 대한 PDSCH를 스케줄링하는 DCI는 P-RNTI로 스크램블링 될 수 있다. SFI(slot format indicator)를 통지하는 DCI는 SFI-RNTI로 스크램블링 될 수 있다. TPC(transmit power control)를 통지하는 DCI는 TPC-RNTI로 스크램블링 될 수 있다. 단말-특정의 PDSCH 또는 PUSCH를 스케줄링하는 DCI는 C-RNTI(Cell RNTI)로 스크램블링 될 수 있다. DCI 포맷 0_0은 PUSCH를 스케줄링하는 대비책 DCI로 사용될 수 있고, 이 때 CRC는 C-RNTI로 스크램블링될 수 있 다. C-RNTI로 CRC가 스크램블링 된 DCI 포맷 0_0은 예컨대 하기의 정보들을 포함할 수 있다.[표 5]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "DCI 포맷 0_1은 PUSCH를 스케줄링하는 비대비책 DCI로 사용될 수 있고, 이 때 CRC는 C-RNTI로 스크램블링될 수 있다. C-RNTI로 CRC가 스크램블링 된 DCI 포맷 0_1은 예컨대 하기의 정보들을 포함할 수 있다.[표 6]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "DCI 포맷 1_0은 PDSCH를 스케줄링하는 대비책 DCI로 사용될 수 있고, 이 때 CRC는 C-RNTI로 스크램블링될 수 있 다. C-RNTI로 CRC가 스크램블링 된 DCI 포맷 1_0은 예컨대 하기의 정보들을 포함할 수 있다. [표 7]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "DCI 포맷 1_1은 PDSCH를 스케줄링하는 비대비책 DCI로 사용될 수 있고, 이 때 CRC는 C-RNTI로 스크램블링될 수 있다. C-RNTI로 CRC가 스크램블링 된 DCI 포맷 1_1은 예컨대 하기의 정보들을 포함할 수 있다.[표 8]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "하기에서는 5G 통신 시스템에서 데이터 채널에 대한 시간 도메인 자원할당 방법에 대해 설명하도록 한다. 기지국은 단말에게 하향링크 데이터채널(PDSCH) 및 상향링크 데이터채널(PUSCH)에 대한 시간 도메인 자원할당 정보에 대한 테이블(table)을 상위 계층 시그널링 (예를 들어 RRC 시그널링)으로 설정할 수 있다. PDSCH에 대해 서는 최대 maxNrofDL-Allocations=16 개의 엔트리(entry)로 구성된 테이블을 설정할 수 있고, PUSCH에 대해서 는 최대 maxNrofUL-Allocations=16 개의 엔트리로 구성된 테이블을 설정할 수 있다. 시간 도메인 자원할당 정보 에는 예를 들어 PDCCH-to-PDSCH 슬롯 타이밍 (PDCCH를 수신한 시점과 수신한 PDCCH가 스케쥴링하는 PDSCH가 전 송되는 시점 사이의 슬롯 단위의 시간 간격에 해당함, K0로 표기함) 또는 PDCCH-to-PUSCH 슬롯 타이밍 (PDCCH를 수신한 시점과 수신한 PDCCH가 스케쥴링하는 PUSCH가 전송되는 시점 사이의 슬롯 단위의 시간 간격에 해당함, K2로 표기함), 슬롯 내에서 PDSCH 또는 PUSCH가 스케쥴링된 시작 심볼의 위치 및 길이에 대한 정보, PDSCH 또는 PUSCH의 매핑 타입 등이 포함될 수 있다. 예를 들어 하기 표 9 및 10과 같은 정보들이 기지국으로부터 단말로 통지될 수 있다.[표 9]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "[표 10]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "기지국은 상기 시간 도메인 자원할당 정보에 대한 테이블의 엔트리 중 하나를 단말에게 L1 시그널링(예를 들어 DCI)를 통해 단말에게 통지할 수 있다 (예를 들어 DCI 내의 '시간 도메인 자원할당' 필드로 지시할 수 있음). 단말은 기지국으로부터 수신한 DCI에 기반하여 PDSCH 또는 PUSCH에 대한 시간 도메인 자원할당 정보를 획득할 수 있다. 하기에서는 5G 통신 시스템에서의 하향링크 제어채널에 대하여 도면을 참조하여 보다 구체적으로 설명하고자 한 다. 도 2는 5G 무선통신 시스템에서 하향링크 제어채널이 전송되는 제어영역에 대한 일 예를 도시한 도면이다. 도 2 는 주파수 축으로 단말의 대역폭부분(UE bandwidth part), 시간축으로 1 슬롯 내에 2개의 제어영역 (제어영역#1, 제어영역#2)이 설정되어 있는 일 예를 도시한다. 제어영역(201, 202)는 주파수 축으로 전체 단말 대역폭부분 내에서 특정 주파수 자원에 설정될 수 있다. 시간 축으로는 하나 또는 복수 개 의 OFDM 심볼로 설정될 수 있고 이를 제어영역 길이(Control Resource Set Duration, 204)으로 정의할 수 있다. 도 2의 도시된 예를 참조하면, 제어영역#1은 2 심볼의 제어영역 길이로 설정되어 있고, 제어영역 #2는 1 심볼의 제어영역 길이로 설정되어 있다. 전술한 5G에서의 제어영역은 기지국이 단말에게 상위 계층 시그널링(예컨대 시스템 정보, MIB, RRC 시그널링)을 통해 설정될 수 있다. 단말에게 제어영역을 설정한다는 것은 제어영역 식별자(Identity), 제어영역의 주파수 위치, 제어영역의 심볼 길이 등의 정보를 제공하는 것을 의미한다. 예를 들면, 상기 상위 계층 시그널링은 하기 표 11의 정보들을 포함할 수 있다. [표 11]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "표 11에서 tci-StatesPDCCH (간단히 TCI(transmission configuration indication) state로 명명함) 설정 정보 는, 대응되는 제어영역에서 전송되는 DMRS와 QCL 관계에 있는 하나 또는 복수 개의 SS/PBCH 블록 인덱스 또는 CSI-RS(channel state information reference signal) 인덱스의 정보를 포함할 수 있다. 일례로 하향링크 데이터에 대한 스케줄링 제어정보(DL grant)인 DCI format 1_1 에 포함되는 각 제어 정보는 아 래와 같을 수 있다. - Carrier indicator : DCI가 스케줄링하는 데이터가 어느 반송파(carrier) 상으로 전송되는지 지시 - 0 or 3 bits - Identifier for DCI formats : DCI 포맷을 지시하며, 구체적으로 해당 DCI가 하향링크용인지 상향링크용인지 구분하는 지시자이다. - [1] bits - Bandwidth part indicator : 대역폭 부분의 변경이 있을 경우 이를 지시 - 0, 1 or 2 bits - Frequency domain resource assignment : 주파수 도메인 자원 할당을 지시하는 자원 할당 정보로 자원 할당 타입이 0 또는 1인지에 따라 표현하는 자원이 달라진다. - Time domain resource assignment : 시간 도메인 자원 할당을 지시하는 자원 할당 정보로 상위 계층 시그널 링 또는 미리 정해진 PDSCH 시간 도메인 자원 할당 리스트의 일 설정을 지시할 수 있다 -1, 2, 3, or 4 bits - VRB-to-PRB mapping : 가상 자원 블록(VRB)와 물리 자원 블록(PRB)의 매핑 관계를 지시한다- 0 or 1 bit - PRB bundling size indicator : 같은 프리코딩이 적용된다고 가정하는물리 자원 블록 번들링 크기를 지시한다 - 0 or 1 bit - Rate matching indicator : PDSCH에 적용되는 상위 계층으로 설정된레이트 매치 그룹 중 어느 레이트 매치 그 룹이 적용되는지 지시한다 - 0, 1, or 2 bits - ZP CSI-RS trigger : 영전력 채널 상태 정보 기준 신호를 트리거한다 - 0, 1, or 2 bits - 전송 블록(transport block, TB) 관련 설정 정보 : 하나 또는 두 개의 TB에 대한 MCS(Modulation and coding scheme), NDI(New data indicator) 및 RV(Redundancy version)를 지시한다. - 변조 및 코딩 방식(Modulation and coding scheme; MCS): 데이터 전송에 사용된 변조방식과 코딩 레이트를 지시한다. 즉, QPSK인지, 16QAM인지, 64QAM인지, 256QAM인지에 대한 정보와 함께 TBS 및 채널코딩 정보를 알려 줄 수 있는 코딩 레이트 값을 지시할 수 있다. - 새로운 데이터 지시자(New data indicator): HARQ 초기전송인지 재전송인지를 지시한다. - 중복 버전(Redundancy version): HARQ 의 중복 버전(redundancy version) 을 지시한다. - HARQ process number : PDSCH에 적용되는 HARQ 프로세스 번호를 지시한다 - 4 bits - Downlink assignment index : PDSCH에 대한 HARQ-ACK 보고시 동적(dynamic) HARQ-ACK 코드북을 생성하기 위 한 인덱스이다 - 0 or 2 or 4 bits - TPC command for scheduled PUCCH : PDSCH에 대한 HARQ-ACK 보고를 위한 PUCCH 에 적용되는 전력 제어 정보 - 2 bits - PUCCH resource indicator : PDSCH에 대한 HARQ-ACK 보고를 위한 PUCCH 의 자원을 지시하는 정보 - 3 bits - PDSCH-to-HARQ_feedback timing indicator : PDSCH에 대한 HARQ-ACK 보고를 위한 PUCCH 가 어느 슬롯에서 전 송되는지에 대한 설정 정보 - 3 bits - Antenna ports : PDSCH DMRS의 안테나 포트 및 PDSCH가 전송되지 않는 DMRS CDM 그룹을 지시하는 정보 - 4, 5 or 6 bits - Transmission configuration indication : PDSCH의 빔 관련 정보를 지시하는 정보 - 0 or 3 bits - SRS request : SRS 전송을 요청하는 정보 - 2 bits - CBG transmission information : 코드 블록 그룹 기반 재전송이 설정된 경우, 어떤 코드 블록 그룹(CBG)에 해당하는 데이터가 PDSCH를 통해 전송되는지 지시하는 정보 - 0, 2, 4, 6, or 8 bits - CBG flushing out information : 이전에 단말이 수신했던 코드 블록 그룹이 HARQ 컴바이닝(combining)에 사 용될 수 있는지 지시하는 정보 - 0 or 1 bit - DMRS sequence initialization : DMRS 시퀀스 초기화 파라미터를 지시 - 1 bit 상기에서 PDSCH 또는 PUSCH를 통한 데이터 전송의 경우 시간영역 자원 할당 (time domain resource assignment)은 PDSCH/PUSCH가 전송되는 슬롯에 관한 정보 및, 해당 슬롯에서의 시작 심볼 위치 S와 PDSCH/PUSCH가 매핑되는 심볼 개수 L에 의해 전달될 수 있다. 상기에서 S는 슬롯의 시작으로부터 상대적인 위치 일 수 있고, L은 연속된 심볼 개수 일 수 있으며, S와 L은 하기 수학식 1과 같이 정의되는 시작 및 길이 지시자 값 (start and length indicator value: SLIV)로부터 결정될 수 있다. [수학식 1]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "NR 시스템에서 단말은 RRC 설정을 통해서, 하나의 행에 SLIV 값과 PDSCH/PUSCH 매핑 타입 및 PDSCH/PUSCH가 전 송되는 슬롯에 대한 정보를 설정 받을 수 있다 (예를 들어, 표의 형태로 상기 정보가 설정될 수 있다). 이후 상 기 DCI의 시간영역 자원 할당에서는 상기 설정된 표에서의 index 값을 지시함으로써 기지국이 단말에게 SLIV 값, PDSCH/PUSCH 매핑 타입, PDSCH/PUSCH가 전송되는 슬롯에 대한 정보를 전달할 수 있다. NR 시스템에서는 PDSCH 매핑 타입은 타입 A (type A)와 타입 B (type B)가 정의되었다. PDSCH 매핑 타입 A에서 는 슬롯의 두 번째 혹은 세 번째 OFDM 심볼에 DMRS 심볼 중 첫 번째 심볼이 위치해 있다. PDSCH 매핑 타입B에서 는 PUSCH 전송으로 할당 받은 시간영역 자원에서의 첫 번째 OFDM 심볼의 DMRS 심볼 중 첫 번째 심볼이 위치해 있다. 하향링크 데이터는 하향링크 데이터 전송용 물리채널인 PDSCH 상에서 전송 될 수 있다. PDSCH는 상기 제어채널 전송구간 이후부터 전송될 수 있으며, 주파수 영역에서의 구체적인 매핑 위치, 변조 방식 등의 스케줄링 정보는 상기 PDCCH를 통해 전송되는 DCI를 기반으로 결정된다. 상기 DCI를 구성하는 제어정보 중에서 MCS 를 통해서, 기지국은 단말에게 전송하고자 하는 PDSCH에 적용된 변조 방식과 전송하고자 하는 데이터의 크기(전송 블록 크기, transport block size(TBS))를 통지한다. 실시 예에서 MCS 는 5비트 혹은 그보다 더 많거나 적은 비트로 구성될 수 있다. 상기 TBS 는 기지국이 전송하고자 하는 데이 터 (transport block, TB)에 오류정정을 위한 채널코딩이 적용되기 이전의 크기에 해당한다. 본 발명에서 전송블록 (transport block; TB)라 함은, MAC (medium access control) 헤더, MAC 제어 요소, 1 개 이상의 MAC SDU (service data unit), padding 비트들을 포함할 수 있다. 또는 TB는 MAC 계층에서 물리계층 (physical layer)로 전달되는(deliver) 데이터의 단위 혹은 MAC PDU (protocol data unit)를 가리킬 수 있다. NR 시스템에서 지원하는 변조방식은 QPSK (quadrature phase shift keying), 16QAM (quadrature amplitude modulation), 64QAM, 및 256QAM으로서, 각각의 변조오더 (modulation order, Qm)는 2, 4, 6, 8에 해당한다. 즉, QPSK 변조의 경우 심볼 당 2 비트, 16QAM 변조의 경우 심볼 당 4 비트, 64QAM 변조의 경우 심볼당 6 비트를 전송할 수 있으며, 256QAM 변조의 경우 심볼당 8비트를 전송할 수 있다. 도 3과 도 4는 5G 혹은 NR 시스템에서 고려되는 서비스인 eMBB, URLLC, mMTC 데이터들이 주파수-시간자원에서 할당된 일례를 도시한 도면이다. 도 3 및 도 4를 참조하면, 각 시스템에서 정보 전송을 위해 주파수 및 시간 자원이 할당된 방식을 확인할 수 있 다. 도 3은 전체 시스템 주파수 대역에 eMBB, URLLC 및 mMTC 데이터가 할당된 일례를 도시한 도면이다. 우선 도 3에 서는 전체 시스템 주파수 대역 에서 eMBB, URLLC, mMTC용 데이터가 할당된 모습이다. eMBB 와 mMTC 가 특정 주파수 대역에서 할당되어 전송되는 도중에 URLLC 데이터 (303, 305, 307)가 발생하여 전송이 필 요한 경우, eMBB 및 mMTC 가 이미 할당된 부분을 비우거나 전송을 하지 않고, URLLC 데이터(303, 305, 307)가 전송될 수 있다. 상기 서비스 중에서 URLLC는 지연시간을 줄이는 것이 필요하기 때문에, eMBB가 할 당된 자원의 일부분에 URLLC 데이터가 할당(303, 305, 307)되어 전송될 수 있다. 물론 eMBB가 할당된 자원 에서 URLLC가 추가로 할당되어 전송되는 경우, 중복되는 주파수-시간 자원에서는 eMBB 데이터가 전송되지 않을 수 있으며, 따라서 eMBB 데이터의 전송 성능이 낮아질 수 있다. 즉, 상기의 경우에 URLLC 할당으로 인한 eMBB 데이터 전송 실패가 발생할 수 있다. 도 4는 시스템 주파수 대역을 나눠 eMBB, URLLC 및 mMTC 데이터가 할당된 일례를 도시한 도면이다. 도 4에서는 전체 시스템 주파수 대역을 나누어 각 서브밴드(402, 404, 406)에서 서비스 및 데이터를 전송하는 용도로사용할 수 있다. 상기 서브밴드 설정과 관련된 정보는 미리 결정될 수 있으며, 이 정보는 기지국이 단말에게 상 위 시그널링을 통해 전송될 수 있다. 혹은 상기 서브 밴드는 기지국 또는 네트워크 노드가 임의로 나누어 단말 에게 별도의 서브밴드 설정 정보의 전송 없이 서비스들을 제공할 수도 있다. 도 4에서는 서브밴드 402는 eMBB 데이터 전송, 서브밴드 404는 URLLC 데이터 전송, 서브밴드 406은 mMTC 데이터 전송에 사용되는 모습이 도시되 었다. 실시 예에서 제안하는 방법 및 장치를 설명하기 위해 NR 시스템에서의 물리채널 (physical channel)와 신호"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "(signal)라는 용어가 사용될 수 있다. 하지만 본 발명의 내용은 NR 시스템이 아닌 무선 통신 시스템에서 적용될 수 있는 것이다. 이하 본 발명의 실시 예를 첨부한 도면과 함께 상세히 설명한다. 또한 본 발명을 설명함에 있어서 관련된 기능 혹은 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 본 발명에서 하향링크 (downlink; DL)는 기지국이 단말에게 전송하는 신호의 무선 전송경로이고, 상향링크는 (uplink; UL)는 단말이 기국에게 전송하는 신호의 무선 전송경로를 의미한다. 이하에서 NR 시스템을 일례로서 본 발명의 실시예를 설명하지만, 유사한 기술적 배경 또는 채널형태를 갖는 여 타의 통신시스템에도 본 발명의 실시예가 적용될 수 있다. 또한, 본 발명의 실시예는 숙련된 기술적 지식을 가 진 자의 판단으로써 본 발명의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 본 발명에서는 종래의 물리채널 (physical channel)과 신호(signal)라는 용어를 데이터 혹은 제어신호와 혼용하 여 사용할 수 있다. 예를 들어, PDSCH는 데이터가 전송되는 물리채널이지만, 본 발명에서는 PDSCH를 데이터라 할 수 있다. 이하 본 발명에서 상위 시그널링은 기지국에서 물리계층의 하향링크 데이터 채널을 이용하여 단말로, 혹은 단말 에서 물리계층의 상향링크 데이터 채널을 이용하여 기지국으로 전달되는 신호 전달 방법이며, RRC signaling 혹 은 MAC 제어요소(MAC CE; MAC control element)라고 언급될 수도 있다. 도 5는 하나의 트랜스포트 블록이 여러 개의 코드 블록으로 나뉘고 CRC가 추가되는 과정의 일례를 도시한 도면 이다. 도 5를 참조하면, 상향링크 또는 하향링크에서 전송하고자 하는 하나의 전송 블록(TB, 501)의 마지막 또는 맨 앞부분에 CRC가 추가될 수 있다. CRC는 16비트 또는 25비트 또는 미리 고정된 비트 수를 가지거나 채 널 상황 등에 따라 가변적인 비트 수를 가질 수 있으며, 채널 코딩의 성공 여부를 판단할 수 있는데 사용될 수 있다. TB에 CRC가 추가된 블록은 여러 개의 코드블록(codeblock, CB)들(507, 509, 511, 513)로 나뉠 수 있다. 여기에서, 코드블록은 최대 크기가 미리 정해져서 나뉠 수 있으며, 이 경우 마지막 코드블록 은 다른 코드블록들(507, 509, 511)보다 크기가 작을 수 있다. 다만, 이는 일례일 뿐, 다른 예에 따라, 0, 랜덤 값 또는 1이 마지막 코드블록에 삽입됨으로써 마지막 코드블록과 다른 코드블록들(507, 509, 511)의 길이가 동일하게 맞춰질 수 있다. 또한 코드블록들(507, 509, 511, 513)에 각각 CRC들(517, 519, 521, 523)이 추가될 수 있다. CRC는 16비 트 또는 24비트 또는 미리 고정된 비트수를 가질 수 있으며, 채널코딩의 성공 여부를 판단할 수 있는데 사용될 수 있다. CRC를 생성하기 위해 TB와 순환 생성 다항식(cyclic generator polynomial)이 사용될 수 있으며, cyclic generator polynomial은 다양한 방법으로 정의될 수 있다. 예를 들어, 24비트 CRC를 위한 cyclic generator polynomial gCRC24A(D) = D24 + D23 + D18 + D17 + D14 + D11 + D10 + D7 + D6 + D5 + D4 + D3 + D + 1 라고 가정하고, L=24라 할 때, TB 데이터 에 대해, CRC 는 를 gCRC24A(D)로 나누어 나머지가 0 이 되는 값으로, 를 결정할 수 있다. 전술한 예에서는 일예로 CRC 길이 L을 24로 가정하 여 설명하였지만 CRC 길이 L은 12, 16, 24, 32, 40, 48, 64 등 여러 가지 길이로 결정될 수 있다. 이러한 과정으로 TB에 CRC가 추가된 후, 상기 TB+CRC는 N개의 CB(507, 509, 511, 513)로 분할될 수 있다. 분할 된 각각의 CB들(507, 509, 511, 513)에 CRC(517, 519, 521, 523)가 추가될 수 있다. CB에 추가되는 CRC는 TB에 추가된 CRC를 발생시킬 때와는 다른 길이를 가지거나 CRC 생성을 위해 다른 cyclic generator polynomial 이 사용될 수 있다. 또한 TB에 추가된 CRC와 코드블록에 추가된 CRC들(517, 519, 521, 523)은 코드블록에 적용될 채널코드의 종류에 따라 생략될 수도 있다. 예를 들어, 터보 코드가 아니라 LDPC 코드가 코드블록에 적 용될 경우, 코드블록마다 삽입될 CRC들(517, 519, 521, 523)은 생략될 수도 있다. 하지만, LDPC가 적용되는 경우에도 CRC들(517, 519, 521, 523)은 그대로 코드블록에 추가될 수 있다. 또한 폴라 코드가 사용되는 경우에도 CRC가 추가되거나 생략될 수 있다. 도 5에서 전술한 바와 같이, 전송하고자 하는 TB는 적용되는 채널 코딩의 종류에 따라 한 코드블록의 최대길이 가 정해지고, 코드블록의 최대길이에 따라 TB 및 TB에 추가되는 CRC는 코드블록으로의 분할이 수행될 수 있다. 종래 LTE 시스템에서는 분할된 CB에 CB용 CRC가 추가되고, CB의 데이터 비트 및 CRC는 채널코드로 인코딩되어, 코딩된 비트들(coded bits)이 결정되며, 각각의 코딩된 비트들에 대해 미리 약속된 바와 같이 레이트 매칭되는 비트수가 결정되었다. NR 시스템에서 TB의 크기(TBS)는 하기의 단계들을 거쳐 계산될 수 있다. 단계 1: 할당 자원 안의 한 PRB에서 PDSCH 매핑에 할당된 RE 수인 를 계산한다. 는 로 계산될 수 있다. 여기에서, 는 12이며, 는 PDSCH에 할당된 OFDM 심볼 수를 나타낼 수 있다. 는 같은 CDM 그룹의 DMRS가 차지하는, 한 PRB내의 RE 수이다. 는 상위 시그널링으로 설정되는 한 PRB내의 오버헤드가 차지하는 RE 수이며, 0, 6, 12, 18 중 하나로 설정될 수 있 다. 이 후, PDSCH에 할당된 총 RE 수 가 계산될 수 있다. 는 로 계산되며, 는 단말에게 할당된 PRB 수를 나타낸다. 단계 2: 임시 정보 비트 수 는 로 계산될 수 있다. 여기에서, R은 코드 레이트이며, Qm은 변조 오더 (modulation order)이며, 이 값의 정보는 DCI의 MCS 비트필드와 미리 약속된 표를 이용하여 전달될 수 있다. 또한, ν는 할당된 레이어의 수이다. 만약 이면, 하기의 단계 3을 통해 TBS가 계산될 수 있다. 이외에는 단계 4를 통해 TBS가 계산될 수 있다. 단계 3: 와 의 수식을 통해 가 계산될 수 있다. TBS는 하기 표 12에서 보다 작지 않은 값 중 에 가장 가까운 값으로 결정될 수 있다.[표 12]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "단계 4: 와 의 수식을 통해 가 계산 될 수 있다. TBS는 값과 하기 [pseudo-code 1]을 통해 결정될 수 있다. 아래에서 C는 한 TB가 포함하는 코 드블록의 수에 해당한다. [Pseudo-code 1 시작] [Pseudo-code 1 끝] NR 시스템에서 하나의 CB가 LDPC 인코더로 입력되면 패리티 비트들이 추가되어 출력될 수 있다. 이 때, LDCP 베 이스 그래프(LDCP base graph)에 따라 패리티 비트의 양이 달라질 수 있다. 특정 입력에 대해 LDPC 코딩에 의해 생성되는 모든 패리티 비트들을 보내도록 하는 방법을 FBRM(full buffer rate matching)이라고 할 수 있으며, 전송 가능한 패리티 비트 수에 제한을 두는 방법을 LBRM(limited buffer rate matching)이라고 할 수 있다. 데 이터 전송을 위해 자원이 할당되면, LDPC 인코더 출력이 순환 버퍼(circular buffer)로 만들어지고, 만들어진 버퍼의 비트들은 할당된 자원만큼 반복하여 전송되며, 이 때 circular buffer의 길이를 Ncb라고 할 수 있다. LDPC 코딩에 의해 생성되는 모든 패리티 비트의 수를 N이라고 하면, FBRM 방법에서는 Ncb = N이 된다. LBRM 방 법에서, Ncb 는 가 되며, 는 로 주어지며, 은 2/3으로 결정될 수 있다. 을 구하기 위해서는 전술한 TBS를 구하는 방법을 이용하되, 해당 셀에서 단말이 지원하는 최대 레이어 수 및 최대 변조 오더를 가정하며, 최대 변조 오더 Qm는 해당 셀에서 적어도 하나의 BWP에 대해 256QAM을 지원 하는 MCS 테이블을 사용하도록 설정된 경우 8, 설정되지 않았을 경우에는 6(64QAM)으로 가정되고, 코드 레이트 는 최대 코드레이트인 948/1024으로 가정되며, 는 로 가정되고 는 으로 가정되어 계산된다. 는 하기의 표 13으로 주어질 수 있다. [표 13]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "NR 시스템에서 단말이 지원하는 최대 데이터율은 하기의 수학식 2를 통해 결정될 수 있다. [수학식 2]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "상기 수학식 2에서 J는 주파수 집적(carrier aggregation)으로 묶인 캐리어의 수이며, Rmax = 948/1024이고, 는 최대 레이어 수, 는 최대 변조 오더, 는 스케일링 지수, 는 부반송파 간격을 의미할 수 있다. 는 1, 0.8, 0.75, 0.4 중 하나의 값을 단말이 보고할 수 있으며, 는 하기의 표 14로 주어질 수 있다. [표 14]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "또한, 는 평균 OFDM 심볼 길이이며, 는 로 계산될 수 있고, 는 BW(j)에서 최대 RB 수이다. 는 오버헤드 값으로, FR1 (6 GHz 이하 대역)의 하향링크에서는 0.14, 상향링크에서는 0.18로 주어질 수 있 으며, FR2 (6 GHz 초과 대역)의 하향링크에서는 0.08, 상향링크에서는 0.10로 주어질 수 있다. 식 2를 통해 30kHz 부반송파 간격에서 100 MHz 주파수 대역폭을 갖는 셀에서의 하향링크에서의 최대 데이터율은 하기의 표 15 로 계산될 수 있다. [표 15]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "반면, 단말이 실제 데이터 전송에서 측정될 수 있는 실제 데이터율은 데이터양을 데이터 전송 시간으로 나눈 값 이 될 수 있을 것이다. 이는 1 TB 전송에서는 TBS 또는 2 TB 전송에서는 TBS의 합을 TTI 길이로 나눈 값이 될 수 있다. 일 예로, 표 15를 구한 가정과 같이 30 kHz 부반송파 간격에서 100 MHz 주파수 대역폭을 갖는 셀에서 의 하향링크에서의 최대 실제 데이터율은 할당된 PDSCH 심볼 수에 따라 하기의 표 16과 같이 정해질 수 있다. [표 16]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "표 7을 통해 단말이 지원하는 최대 데이터율을 확인해 볼 수 있고, 표 8을 통해 할당된 TBS에 따르는 실제 데이 터율을 확인해볼 수 있다. 이 때, 스케줄링 정보에 따라 최대 데이터율보다 실제 데이터율이 더 큰 경우가 있을 수 있다. 무선통신시스템, 특히 New Radio (NR) 시스템에서는 단말이 지원할 수 있는 데이터율이 기지국과 단말 사이에 서로 약속될 수 있다. 이는 단말이 지원하는 최대 주파수 대역, 최대 변조오더, 최대 레이어 수 등을 이용하여 계산될 수 있다. 하지만, 계산된 데이터율은, 실제 데이터 전송에 사용되는 전송블록(transport block; TB)의 크기 (transport block size; TBS) 및 transmission time interval (TTI) 길이로부터 계산되는 값과 다를 수 있다. 이에 따라 단말은 자신이 지원하는 데이터율에 해당하는 값보다 큰 TBS를 할당 받는 경우가 생길 수 있으며, 이 를 방지하기 위해 단말이 지원하는 데이터율에 따라 스케줄링 가능한 TBS의 제약이 있을 수 있다. 도 6은 NR 시스템의 동기화 신호 (SS) 및 물리방송채널 (PBCH)이 주파수 및 시간 영역에서의 매핑된 모습을 도 시한 도면이다. 주동기화신호 (primary synchronization signal; PSS, 601)과 부동기화신호(secondary synchronization signal; SSS, 603), 그리고 PBCH가 4 OFDM 심볼에 걸쳐 매핑되며, PSS와 SSS는 12 RB들에 매핑되고, PBCH는 20 RB들에 매핑된다. 부반송파간격(subcarrier spacing; SCS)에 따라 20 RB들의 주파수 대역이 어떻게 변하는지 도 6의 표에서 나타나있다. 상기의 PSS, SSS, PBCH가 전송되는 자원 영역을 SS/PBCH block (SS/PBCH 블록)이라고 부를 수 있다. 또한, 상기 SS/PBCH 블록은 SSB 블록이라 칭할 수 있다. 도 7은 부반송파 간격에 따라 SS/PBCH 블록이 전송될 수 있는 심볼을 도시한 도면이다. 도 7을 참고하면, 부반송파 간격은 15kHz, 30kHz, 120kHz, 240kHz 등으로 설정될 수 있으며, 각 부반송파 간격 에 따라 SS/PBCH 블록 (또는 SSB 블록)이 위치할 수 있는 심볼의 위치가 결정될 수 있다. 도 7은 1ms 이내의 심 볼들에서 부반송파 간격에 따른 SSB가 전송될 수 있는 심볼의 위치를 도시한 것이며, 도 7에 표시된 영역에서 SSB가 항상 전송되어야 하는 것은 아니다. 상기 SSB 블록이 전송되는 위치는 시스템 정보 혹은 전용 시그널링 (dedicated signaling)을 통해 단말에 설정될 수 있다. 단말은 일반적으로 기지국으로부터 떨어져 있기 때문에, 단말에서 송신한 신호는 전달 지연 시간(propagation delay) 이후에 기지국에 수신된다. 전달 지연 시간은 단말로부터 기지국까지 전파가 전달되는 경로를 빛의 속도 로 나눈 값이며, 일반적으로 단말로부터 기지국까지의 거리를 빛의 속도로 나눈 값일 수 있다. 일 실시예에서, 기지국으로부터 100km 떨어진 곳에 위치한 단말의 경우, 단말에서 송신한 신호는 약 0.34 msec 이후에 기지국에 수신된다. 반대로 기지국에서 송신된 신호도 약 0.34 msec 이후에 단말에 수신된다. 상술된 바와 같이 단말과 기지국 사이의 거리에 따라 단말에서 송신한 신호가 기지국에 도착하는 시간이 달라질 수 있다. 따라서 서로 다 른 위치에 존재하는 여러 개의 단말이 동시에 신호를 전송하면 기지국에 도착하는 시간이 모두 다를 수 있다. 이러한 문제를 해결해 여러 단말로부터 송신된 신호가 기지국에 동시에 도착하게 하기 위하여, 단말 별로 위치 에 따라 상향링크 신호를 송신하는 시간을 상이하게 할 수 있다. 5G, NR 및 LTE 시스템에서 이를 타이밍 어드밴 스(timing advance)라 한다. 도 8은 개시된 일 실시예에 따른 5G 또는 NR 시스템에서 단말이 제 1 신호를 수신하고, 이에 대한 제 2 신호를 단말이 송신할 때, 타이밍 어드밴스에 따른 단말의 프로세싱 타임을 도시한 도면이다. 이하, 타이밍 어드밴스에 따른 단말의 프로세싱 타임에 대해 구체적으로 설명한다. 슬롯 n에서 기지국이 상향링크 스케줄링 승인(UL grant) 혹은 하향링크 제어신호와 데이터(DL grant 및 DL data)를 단말에게 송신하 면, 단말은 슬롯 n에서 상향링크 스케줄링 승인 혹은 하향링크 제어신호와 데이터를 수신할 수 있다. 이 때, 단말은 기지국이 신호를 전송한 시간보다 전달 지연 시간(Tp, 810)만큼 늦게 신호를 수신할 수 있다. 본 실 시예에서, 단말이 슬롯 n에서 제1 신호를 수신하였을 경우, 단말은 슬롯 n+4에서 해당 제2 신호를 전 송한다. 단말이 신호를 기지국으로 송신할 때에도, 특정 시간에 기지국에 도착하도록 하기 위해, 단말이 수신한 신호 기준의 슬롯 n+4보다 타이밍 어드밴스(TA, 812)만큼 앞당긴 타이밍에 단말은 상향링크 데이터 혹은 하향링크 데이터에 대한 HARQ ACK/NACK을 전송할 수 있다. 따라서 본 실시예에서, 단말이 상향링크 스케줄링 승 인을 받고 상향링크 데이터 전송을 하거나 혹은 하향링크 데이터를 수신하고 HARQ ACK 또는 NACK을 전달하기 위 해 준비할 수 있는 시간은 3개 슬롯에 해당하는 시간에서 TA를 제외한 시간일 수 있다. 상술된 타이밍의 결정을 위해 기지국은 해당 단말의 TA의 절대값을 계산할 수 있다. 기지국은 단말이 초기 접속 하였을 때, 랜덤 억세스(random access) 단계에서 가장 처음 단말에게 전달한 TA 값에, 그 이후 상위 시그널링 으로 전달했던 TA 값의 변화량을 더해가면서 혹은 빼가면서 TA의 절대값을 계산할 수 있다. 본 개시에서 TA의 절대값은 단말이 송신하는 n번째 TTI의 시작시간에서 단말이 수신한 n번째 TTI의 시작시간을 뺀 값이 될 수 있 다. 한편 셀룰러 무선통신 시스템 성능의 중요한 기준 중 하나는 패킷 데이터 지연시간(latency)이다. 이를 위해 LTE 시스템에서는 1ms의 전송시간구간(transmission time interval, 이하 TTI)를 가지는 서브프레임 단위로 신 호의 송수신이 이루어진다. 상술된 바와 같이 동작하는 LTE 시스템에서 1ms보다 짧은 전송시간구간을 가지는 단 말(short-TTI UE)을 지원할 수 있다. 한편 5G 또는 NR 시스템에서, 전송시간 구간은 1 ms보다 짧을 수 있다. Short-TTI 단말은 지연시간(latency)이 중요한 Voice over LTE(VoLTE) 서비스, 원격조종과 같은 서비스에 적합 하다. 또한 short-TTI 단말은 셀룰러 기반에서 미션 크리티컬(mission critical)한 사물인터넷(IoT, internet of things)을 실현할 수 있는 수단이 된다. 5G 또는 NR 시스템에서, 기지국이 하향링크 데이터를 포함하는 PDSCH 전송시, PDSCH를 스케줄링하는 DCI는 PDSCH의 HARQ-ACK 정보를 단말이 전송하는 타이밍 정보에 해당하는 값인 K1 값을 지시한다. HARQ-ACK 정보를 타 이밍 어드밴스(timing advance)를 포함하여 심볼 L1보다 먼저 전송되도록 지시되지 않은 경우에 단말이 기지국 으로 전송할 수 있다. 즉, 타이밍 어드밴스(timing advance)를 포함하여 심볼 L1보다 같거나 이후 시점에 HARQ- ACK 정보가 단말로부터 기지국으로 전송될 수 있다. HARQ-ACK 정보가 타이밍 어드밴스(timing advance)를 포함 하여 심볼 L1보다 먼저 전송되도록 지시된 경우, HARQ-ACK 정보는 단말에서 기지국으로의 HARQ-ACK 전송에서 유 효한 HARQ-ACK 정보가 아닐 수 있다. 심볼 L1은 PDSCH의 마지막 시점으로부터 이후에 순환 전치(cyclic prefix, CP)가 시작하는 첫 번째 심볼 일 수 있다. 는 아래의 수학식 3과 같이 계산될 수 있다. [수학식 3]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "상술된 수학식 3에서 N1, d1,1, d1,2, κ, μ, TC는 아래와 같이 정의될 수 있다. - HARQ-ACK 정보가 PUCCH(상향링크 제어채널)로 전송되면 d1,1=0이고, PUSCH(상향링크 공유채널, 데이터 채널) 로 전송되면 d1,1=1이다. - 단말이 복수개의 활성화된 구성 캐리어 혹은 캐리어를 설정받은 경우, 캐리어간 최대 타이밍 차이는 제2 신호 전송에서 반영될 수 있다. - PDSCH 매핑 타입 A의 경우, 즉 첫 번째 DMRS 심볼 위치가 슬롯의 3번째 혹은 4번째 심볼인 경우에, PDSCH의 마지막 심볼의 위치 인덱스 i가 7보다 작으면 d1,2=7-i로 정의된다. - PDSCH 매핑 타입 B의 경우, 즉 첫 번째 DMRS 심볼 위치가 PDSCH의 첫 심볼인 경우에, PDSCH의 길이가 4 심볼 이면 d1,2=3이고, PDSCH의 길이가 2심볼이면, d1,2=3+d이며, d는 PDSCH와 해당 PDSCH를 스케줄링하는 제어신호 를 포함한 PDCCH가 겹치는 심볼의 수이다. - N1은 μ에 따라 아래의 표 17과 같이 정의된다. μ=0, 1, 2, 3은 각각 부반송파 간격 15 kHz, 30 kHz, 60 kHz, 120 kHz를 의미한다. [표 17]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "- 상술된 표 17에서 제공하는 N1 값은 UE capability에 따라 다른 값이 사용될 수 있다. -"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "로 각각 정의된다. 또한, 5G 또는 NR 시스템에서는 기지국이 상향링크 스케줄링 승인을 포함하는 제어정보 전송시, 단말이 상향링 크 데이터 혹은 PUSCH를 전송하는 타이밍 정보에 해당하는 K2 값을 지시할 수 있다. PUSCH는 타이밍 어드밴스(timing advance)를 포함하여 심볼 L2보다 먼저 보내지도록 지시되지 않은 경우에는 단 말이 기지국으로 전송할 수 있다. 즉, 타이밍 어드밴스(timing advance)를 포함하여 심볼 L2보다 같거나 이후 시점에 PUSCH가 단말로부터 기지국으로 전송될 수 있다. PUSCH가 타이밍 어드밴스(timing advance)를 포함하여 심볼 L2보다 먼저 전송되도록 지시된 경우에는, 단말은 기지국으로부터의 상향링크 스케줄링 승인 제어정보를 무시할 수 있다. 심볼 L2은 스케줄링 승인을 포함하는 PDCCH의 마지막 시점으로부터 이후에 전송해야하는 PUSCH 심볼의 CP가 시작하는 첫 번째 심볼일 수 있다. 는 아래의 수학식 4와 같이 계산될 수 있다. [수학식 4]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "상술된 수학식 4에서 N2, d2,1, κ, μ, TC는 아래와 같이 정의될 수 있다. - PUSCH 할당된 심볼 중에서 첫 번째 심볼이 DMRS만 포함한다면 d2,1=0이고, 이외에는 d2,1=1이다. - 단말이 복수개의 활성화된 구성 캐리어 혹은 캐리어를 설정 받았다면, 캐리어간 최대 타이밍 차이는 제2 신호 전송에서 반영될 수 있다. - N2는 μ에 따라 아래의 표 18과 같이 정의된다. μ=0, 1, 2, 3은 각각 부반송파 간격 15 kHz, 30 kHz, 60 kHz, 120 kHz를 의미한다. [표 18]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "- 상술된 표 18에서 제공하는 N2 값은 UE capability에 따라 다른 값이 사용될 수 있다. -"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 28, "content": "로 각각 정의한다. 한편, 5G 또는 NR 시스템은 하나의 캐리어 내에서, 주파수 대역 부분(BWP)를 설정하여 특정 단말이 설정된 BWP 내에서 송수신하도록 지정할 수 있다. 이는 단말의 소모전력 감소를 목적으로 할 수 있다. 기지국은 복수의 BWP 를 설정할 수 있으며, 제어정보에서 활성화된 BWP를 변경할 수 있다. BWP가 변경되는데 단말이 사용할 수 있는 시간은 아래의 표 19와 같이 정의될 수 있다. [표 19]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "표 19에서 주파수 범위(Frequency Range) 1은 6 GHz 이하의 주파수 대역을 의미하고, 주파수 범위(Frequency Range) 2는 6 GHz 이상의 주파수 대역을 의미한다. 상술된 실시예에서 타입 1과 타입 2는 UE capability에 따라 결정될 수 있다. 상술된 실시예에서 시나리오 1,2,3,4는 아래의 표 20과 같이 주어진다. [표 20]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 30, "content": "도 9는 슬롯에 따라 데이터(일례로 TB)들을 스케줄링하여 전송하고, 해당 데이터에 대한 HARQ-ACK 피드백을 수 신하고, 피드백에 따라 재전송을 수행하는 일례를 도시한 도면이다. 도 9에서, TB1은 슬롯 0에서 초 기전송 되고, 이에 대한 ACK/NACK 피드백은 슬롯 4에서 전송된다. 만약 TB1의 초기전송이 실패하고, NACK이 수신되었다면, 슬롯 8에서 TB1에 대한 재전송이 수행될 수 있다. 상기에서 ACK/NACK 피드백이 전송되는 시점과, 재전송이 수행되는 시점은 미리 정해져 있을 수 있거나 또는 제어 정보 또는/및 상위 계층 시 그널링에서 지시되는 값에 따라 결정될 수 있을 것이다. 도 9에서는 슬롯 0번부터 슬롯에 따라 순차적으로 TB1부터 TB8까지 스케줄링되어 전송되는 일례를 도시하고 있 다. 이는 예를 들어, TB1부터 TB8까지에 HARQ process ID 0부터 7까지 각각 부여되어 전송되는 것일 수 있다. 만약, 기지국과 단말이 사용할 수 있는 HARQ process ID의 수가 오직 4개뿐이라면, 연속적으로 8개의 다른 TB에 대한 전송을 수행할 수 없을 수 있다. 도 10은 위성을 이용한 통신 시스템의 일례를 도시한 도면이다. 예를 들어, 단말이 위성으로 신호 를 전송하면, 위성은 기지국로 상기 신호를 전달하고, 기지국은 수신 신호를 처리하여 이에 대한 후속 동작의 요구를 포함하는 신호를 단말에게 전송하는데, 이는 다시 위성을 통해 전송될 수 있다. 상기에서 단말과 위성 사이의 거리도 멀고, 위성과 기지국 사이의 거리 또한 멀 기 때문에, 결국 단말에서 기지국로의 데이터 송수신에 소요되는 시간이 길어지게 된다. 도 11은 위성의 고도 또는 높이에 따른 통신 위성의 지구 공전 주기를 도시한 도면이다. 통신을 위한 위성들은 위성의 궤도에 따라 저궤도위성(LEO, Low Earth Orbit), 중궤도위성(MEO, Middle Earth Orbit), 정지궤도위성 (GEO, Geostationay Earth Orbit) 등으로 구분될 수 있다. 일반적으로 GEO은 대략 고도 36000km 의 위성 을 의미하며, MEO은 고도 5000 내지 15000km의 위성을 의미하며, LEO는 고도 500 내지 1000km의 위성을 의미한다. 각 고도에 따라 지구 공전 주기가 달라지는데, GEO의 경우 지구 공전 주기가 대략 24시간 정도 이며, MEO의 경우 대략 6시간, LEO의 경우 대략 90 내지 120분 정도이다. 저궤도(~2,000km) 위성은 낮은 상대적으로 낮은 고도로 전파 지연시간(propagation delay time, 이는 송신기에서 송출된 신호가 수신 기에 도달하기까지 걸리는 시간으로 이해될 수 있다) 및 손실이 정지궤도(36,000km) 위성 대비 유리하다. GEO 위성이 아닌 것을 NGSO (non-GeoStationary Orbit)이라고 할 수 있다. 도 12는 위성-단말 직접통신의 개념도를 도시한 도면이다. 로켓에 의해 고도 100 km 이상의 높은 곳에 위치한 위성은, 지상의 단말과 신호를 송수신하고, 또한 지상의 기지국(DU farms) 과 연결된 지상국 (ground station)과 신호를 송수신한다. 도 13은 위성-단말 직접통신의 활용 시나리오를 도시한 도면이다. 위성-단말 직접통신은 지상망의 커버리지 한 계를 보완하는 형태로 특화된 목적의 통신서비스의 지원이 가능하다. 일례로 사용자 단말에 위성-단말 직접통신 기능을 구현함으로써 지상망 통신 커버리지가 아닌 곳에서의 사용자의 긴급구조 또는/및 재난신호의 송수신이 가능하며, 선박 또는/및 항공과 같이 지상망 통신이 불가한 영역에서의 사용자에 대한 이동통신 서비스가 제공될 수 있으며, 국경의 제한 없이 선박, 화물차 또는/및 드론 등의 위치를 실시간으로 추적하고 제어 하는 것이 가능하며, 또한 기지국에 위성통신 기능을 지원함으로써 기지국의 백홀로 기능하도록 하여 물 리적으로 멀리 떨어진 경우 백홀 기능을 수행하도록 위성통신을 활용하는 것도 가능하다. 도 14는 고도 1200 km의 LEO 위성과 지상의 단말이 직접 통신을 수행 할 때, 상향링크에서의 예상 데이터 전송 률(throughput) 계산의 일례를 도시한 도면이다. 상향링크에서 지상 단말의 전송 전력 EIRP(effective isotropic radiated power)가 23 dBm이고, 위성까지의 무선 채널의 경로 손실 (path loss)가 169.8 dB이고, 위 성 수신 안테나 이득이 30 dBi인 경우, 달성 가능한 신호 대 잡음비(signal-to-noise ratio: SNR)는 -2.63 dB 로 추산된다. 이 경우, 경로 손실에는 우주공간에서의 경로손실, 대기권에서의 손실 등이 포함될 수 있다. 신호 대 간섭비(signal-to-interference ratio: SIR)가 2 dB라고 가정하면, 신호 대 간섭 및 잡음비(signal-to- interference and noise ratio: SINR)은 -3.92 dB로 계산되며, 이 때 30 kHz 부반송파간격과 1 PRB의 주파수 자원을 이용할 경우 112 kbps의 전송속도 달성이 가능할 수 있다. 도 15는 고도 35,786 km의 GEO 위성과 지상의 단말이 직접 통신을 수행 할 때, 상향링크에서의 예상 데이터 전 송률(throughput) 계산의 일례를 도시한 도면이다. 상향링크에서 지상 단말의 전송 전력 EIRP가 23 dBm이고, 위 성까지의 무선 채널의 경로 손실 (path loss)가 195.9 dB이고, 위성 수신 안테나 이득이 51 dBi인 경우, 달성 가능한 SNR은 -10.8 dB로 추산된다. 이 경우, 경로손실에는 우주공간에서의 경로손실, 대기권에서의 손실 등이 포함될 수 있다. SIR이 2 dB라고 가정하면, SINR은 -11 dB로 계산되며, 이 때 30 kHz 부반송파 간격과 1 PRB의 주파수 자원을 이용할 경우 21 kbps의 전송속도 달성이 가능할 수 있는데, 이것은 3번의 반복전송을 수행한 결 과일 수 있다. 도 16은 단말과 위성간의 경로손실 모델에 따른 경로손실 값, 그리고 단말과 지상망통신 기지국간의 경로손실 모델에 따른 경로손실을 도시한 도면이다. 도 16에서 d는 거리에 해당하며 fc는 신호의 주파수이다. 단말과 위성 (satellite)과의 통신이 수행되는 우주공간(free space)에서는 경로손실(FSPL, 1600)은 거리의 제곱에 반비례하 지만, 단말과 지상망통신 기지국(terrestrial gNB)과의 통신이 수행되는 공기가 존재하는 지상에서의 경로손실 (PL2, PL'Uma-NLOS, 1610, 1620)은 거리의 거의 4제곱에 반비례한다. d3D는 단말과 기지국간의 직선거리를 의미하며, hBS는 기지국의 높이이며, hUT는 단말의 높이이다. d'BP = 4 x hBS x hUT x fc / c으로 계산된다. fc는 Hz 단위의 중심주파수, c는 m/s 단위의 빛의 속도이다. 위성통신(Satellite communications, 또는 Non-Terrestrial Network)에서는 위성이 지속적으로 빠르게 움직임 으로서 발생하는 Doppler shift, 즉 송신신호의 주파수 이동(offset)이 발생한다. 도 17은 위성의 고도 및 위치, 그리고 지상의 단말 사용자의 위치에 따라 위성에서부터 전달되는 신호가 지상 사용자에게 수신되었을 때 상기 신호가 겪는 Doppler shift의 양을 계산하는 수식 및 결과를 도시한 도면이다. 지구 반지름이 R이고, h는 위성의 고도이며, v는 위성이 지구를 공전하는 속도이며, fc는 신호의 주파수이다. 상기 위성의 속도는, 위성의 고도로부터 계산될 수 있는데, 이는 지구가 위성을 잡아당기는 힘인 중력과, 위성 이 공전함에 따라 발생하는 구심력이 같아지는 속도가 되며, 이는 도 18과 같이 계산될 수 있다. 도 18은 위성의 고도에서 계산된 위성의 속도를 도시한 도면이다. 도 17에서 확인할 수 있듯이 각 α는 고도각 (elevation angle) θ에 의해 결정되므로, 고도각 θ에 따라 Doppler shift의 값이 결정되게 된다. 도 19는 위성이 지상으로 전송하는 하나의 빔 안에 있는 서로 다른 단말들이 겪는 Doppler shift를 도시한 도면 이다. 도 19에서는 고도각 θ에 따른 단말 1, 단말 2이 겪는 Doppler shift가 각각 계산되었다.중심주파수 2 GHz, 위성고도 700 km, 지상에서 하나의 빔 직경이 50 km, 단말의 속도는 0을 가정한 결과이다. 또한 본 발명에서 계산한 Doppler shift는 지구자전 속도에 따른 효과를 무시한 것이며, 이는 위성의 속도에 비 해 느리기 때문에 영향이 작다고 간주할 수 있다. 도 20은 고도각으로부터 정해지는 위성의 위치에 따라, 빔 하나 내에서 발생하는 Doppler shift의 차이를 도시 한 도면이다. 위성이 빔 바로 위에 위치할 때, 즉 elevation angle이 90도일 때가 빔(또는 셀) 내에서 Doppler shift의 차이가 가장 커지는 것을 볼 수 있다. 이것은 위성이 가운데 위에 있을 때, 빔 한쪽 끝과 다른 한쪽 끝 의 Doppler shift 값들이 각각 양수 값과 음수 값을 갖기 때문일 수 있다. 한편 위성 통신에서는 위성이 지상의 사용자로부터 거리가 멀기 때문에 지상망 통신 대비하여 큰 지연시간이 발 생한다. 도 21은 고도각에 따라 정해지는 위성의 위치에 따라 단말에서부터 위성까지 걸리는 지연시간과, 단말-위성-기 지국 사이의 왕복 지연시간을 도시한 도면이다. 2100은 단말에서부터 위성까지 걸리는 지연시간이며, 2110은 단 말-위성-기지국 사이의 왕복 지연시간을 도시한 것이다. 이 때, 위성-기지국간의 지연시간은 단말-위성의 지연 시간과 같다고 가정되었다. 도 22는 하나의 빔 내에서 사용자의 위치에 따라 달라지는 왕복 지연시간의 최대 차이 값을 도시한 도면이다. 예를 들어 빔 반경(또는 셀 반경, cell radius)이 20 km일 때, 위성의 위치에 따라 빔 내 서로 다른 위치의 단 말들이 다르게 겪는 위성까지의 왕복 지연시간의 차이가 약 0.28 ms 이하라고 볼 수 있다. 위성통신에서 단말이 기지국과 신호를 송수신한다는 것은, 상기 신호가 위성을 통해 전달되는 것일 수 있다. 즉, 하향링크에서는 기지국이 위성으로 송신한 신호를 위성이 수신한 후, 단말에게 전달하는 역할을 수행하며, 상향링크에서는 단말이 송신한 신호를 위성이 수신한 후, 기지국에게 전달하는 역할을 수행할 수 있다. 상기에 서 위성은 신호를 수신한 후 그대로 주파수 이동만 수행한 후 전달할 수 있으며, 또는 수신한 신호를 기반으로 디코딩 및 재 인코딩 등의 신호처리를 수행하여 전달하는 것도 가능할 수 있다. LTE 또는 NR의 경우 단말은 하기와 같은 절차를 통해 기지국에 접속할 수 있다. - 단계1: 단말이 기지국으로부터 동기신호(또는 SSB(synchronization signal block), 이는 방송 신호를 포함할 수 있다)를 수신한다. 상기 동기신호는 Primary synchronization signal (PSS), secondary synchronization signal (SSS), physical broadcast channel (PBCH)를 포함할 수 있다. 상기 동기신호는 기지국이 송신하는 신 호의 슬롯 경계, 프레임 번호, 하향링크, 상향링크 설정 등의 정보를 포함할 수 있다. 또한 동기 신호를 통해 단말은 부반송파 오프셋, 시스템 정보 전송을 위한 스케줄링 정보 등을 획득할 수 있다. - 단계2: 단말은 기지국으로부터 시스템 정보 (System Information Block: SIB)를 수신한다. 상기 SIB에는 초 기접속 및 랜덤 엑세스 수행을 위한 정보가 포함될 수 있다. 상기 랜덤 엑세스 수행을 위한 정보는 랜덤 엑세스 프리앰블을 전송할 자원 정보가 포함될 수 있다. - 단계3: 단계2에서 설정된 랜덤엑세스 자원에, 랜덤 엑세스 프리앰블(또는 메시지 1, msg1)을 송신한다. 상기 프리앰블은 미리 정해져 있는 수열을 이용하여 상기 단계2에서 설정된 정보에 기반하여 결정되는 신호일 수 있 다. 기지국은 상기 단말이 전송한 프리앰블을 수신한다. 기지국은 어느 단말이 프리앰블을 전송하였는지 알지 못한 채로 기지국 자신이 설정한 자원에서 설정한 프리앰블의 수신을 시도하고, 수신이 성공하면 적어도 하나의 단말이 상기 프리앰블을 전송하였다는 사실을 알 수 있다. - 단계4: 단계3에서 프리앰블이 수신되면, 기지국은 그에 대한 응답인 랜덤 엑세스 응답(random access response: RAR, 또는 메시지 2, msg2)을 전송한다. 단계3에서 랜덤 엑세스 프리앰블을 송신한 단말은, 본 단계 에서 기지국이 송신한 RAR의 수신을 시도할 수 있다. 상기 RAR은 PDSCH 상으로 전송되며, 상기 PDSCH를 스케줄 링하는 PDCCH가 함께 또는 미리 전송된다. 상기 RAR을 스케줄링하는 DCI에는 RA-RNTI 값으로 스크램블링이 된 CRC가 더해지고, DCI(및 CRC)는 채널코딩이 된 후 PDCCH에 매핑되어 전송된다. 상기 RA-RNTI는 단계3에서의 프 리앰블이 전송되는 시간 및 주파수 자원에 기반하여 결정될 수 있다. 단계 3에서 랜덤 엑세스 프리앰블을 전송한 단말이 본 단계에서 RAR을 수신하기까지의 최대 제한 시간은 단계2 에서 전송되는 SIB에서 설정되는 것이 가능하다. 이것은 일례로 최대 10 ms 또는 40 ms 등과 같이 제한되어 설 정될 수 있다. 즉, 단계 3에서 프리앰블을 전송한 단말이, 예를 들어 설정한 최대시간인 10 ms에 기반해서 결정 된 시간 이내에 RAR을 수신하지 못한다면, 다시 프리앰블을 전송할 수 있다. 상기 RAR에는 다음 단계인 단계5에 서 단말이 전송할 신호의 자원을 할당하는 스케줄링 정보가 포함될 수 있다. 도 23은 RAR의 정보 구조의 일례를 도시한 도면이다. RAR은 일례로 MAC PDU일 수 있으며, 단말이 적용하 게 될 timing advance (TA)에 대한 정보 및 다음 단계부터 사용될 temporary C-RNTI 값도 포함할 수 있다. - 단계5: 단계4에서 RAR을 수신한 단말은 RAR에 포함된 스케줄링 정보에 따라 기지국으로 메시지3(msg3)을 송신 한다. 단말은 msg3에 자신의 고유 ID값을 포함하여 전송할 수 있다. 기지국은 단계4에서 자신이 전송한 스케줄 링 정보에 따라 msg3의 수신을 시도할 수 있다. - 단계6: 기지국은 msg3를 수신하고, 단말의 ID 정보를 확인한 후, 단말의 ID 정보를 포함한 메시지4(msg4)를 생성하여 단말에게 전송한다. 단계5에서 msg3을 전송한 단말은 그 후부터 단계6에서 전송될 msg4의 수신을 시도 할 수 있다. Msg4를 수신한 단말은, 디코딩 후 msg4에 포함된 ID 값을 상기 단계5에서 자신이 송신한 ID 값과 비교하여 자신이 송신한 msg3가 기지국에서 수신되었는지 여부를 확인할 수 있다. 단계5에서 단말이 msg3를 송 신한 후, 본 단계에서 msg4를 수신하기까지의 시간에도 제약이 있을 수 있으며, 이 최대 시간도 단계2에서 SIB 로부터 설정될 수 있다. 상기 단계를 이용한 초기 접속 절차를 위성통신에 적용할 경우, 위성통신에서 소요되는 전파지연시간이 문제가 될 수 있다. 예를 들어, 단계3에서 단말이 랜덤 엑세스 프리앰블(또는 PRACH 프리앰블)을 송신하고, 단계4에서 RAR을 수신할 수 있는 기간(랜덤 엑세스 윈도우), 즉 수신할 수 있는데까지 걸리는 최대 시간이 ra- ResponseWindow를 통해 설정될 수 있는데, 종래의 LTE 또는 5G NR 시스템에서는 이러한 최대 시간이 최대 10 ms 정도까지 설정될 수 있다. 도 24는 LTE 시스템의 PRACH 프리앰블 설정 자원과 RAR 수신 시점의 관계의 일례를 도시한 도면이며, 도 25는 5G NR 시스템의 PRACH 프리앰블 설정 자원과 RAR 수신 시점의 관계의 일례를 도시한 도면이다. 도 24를 참고하 면, LTE의 경우, PRACH (랜덤 엑세스 프리앰블)을 송신한 후 3ms 이후 시점부터 랜덤 엑세스 윈도우 가 시작되며 단말은 상기 랜덤 엑세스 윈도우 내에 RAR을 수신할 경우, PRACH 프리앰블의 전송이 성공하였다고 판단할 수 있다. 도 25를 참고하면, NR의 경우, PRACH (랜덤 엑세스 프리앰블)을 송신한 후 처음 나타나는 RAR 스케줄링을 위한 제어정보 영역부터 랜덤 엑세스 윈도우가 시작된다. 단말이 상기 랜덤 엑세스 윈도우 내에 RAR을 수 신할 경우 PRACH 프리앰블의 전송이 성공하였다고 판단할 수 있다. 일례로, 5G NR 시스템에서의 상향링크 송신 타이밍을 위한 TA 는 하기와 같이 정해질 수 있다. 먼저 로 정해지며, 여기에서 Hz 와 이다. 또한, 로, 로 각각 정의될 수 있다. 도 26은 단말에 있어서의 하향링크 프레임과 상향링크 프레임 시점(timing)에 대한 일례를 도시한 도면이다. 단 말은 하향링크 프레임 시점을 기준으로 상향링크 프레임을 만큼 앞당겨서 상향링크 전송을 수행할 수 있다. 상기에서 의 값은 RAR을 통해 전달되거나 또는 MAC CE에 기반하여 결정될 수 있으며, 는 단말에게 설정되거나, 미리 정해진 값에 기반하여 결정되는 값일 수 있다. 5G NR 시스템의 RAR에서는 값을 지시해줄 수 있으며, 이 때, 는 0, 1, 2, …, 3846 중 하나의 값을 지시해 주는 것일 수 있다. 이 경우, RAR의 부반송파 간격(subcarrier spacing; SCS)가 kHz이면, 는 로 결정된다. 단말이 랜덤 엑세스 과정을 완료한 이후에는 기지국으로부터 TA의 변화값을 지시 받을 수 있으며, 이는 MAC CE 등을 통해 지시될 수 있다. MAC CE를 통해 지시되는 정보는 0, 1, 2, …, 63 중 하나의 값을 지시해줄 수 있으며, 이는 기존 TA 값에 가감되어 새로운 TA 값을 계산하는데 사용되며, 이 결 과 TA 값은 와 같이 새롭게 계산될 수 있다. 이렇게 지시된 TA 값은 일정 시간 이후부터 단말이 상향링크 전송에 적용할 수 있다. 도 27a는 위성이 지구 주위를 위성 궤도(satellite orbit)을 따라 공전함에 따라, 지구의 지상 또는 지구상에 위치한 단말에 있어서 위성의 지속적인 움직임의 일례를 도시한 도면이다. 단말이 위성을 바라보는 고도각 (elevation angle)에 따라 단말과 위성간의 거리가 달라지기 때문에, 단말과 위성, 그리고 기지국 사이의 지연시간(propagation delay)가 달라지게 된다. 도 27b는 인공위성의 구조의 일례를 도시한 도면이다. 위성은 태양광 또는 태양열 발전을 위한 solar panel 또 는 solar array, 단말과의 통신을 위한 송수신 안테나(main mission antenna), 지상국과의 통신을 위한 송수신 안테나(feeder link antenna), 위성간 통신을 위한 송수신 안테나(inter-satellite link) 및 송수신을 제어하고 신호 처리 등을 수행하기 위한 프로세서 등으로 구성되어 있을 수 있다. 상 기에서 위성에 따라 위성간 통신을 지원하지 않는 경우, 위성간 신호 송수신을 위한 안테나는 배치되지 않을 수 있다. 도 27b에서는 단말과의 통신을 위해서 1 내지 2 GHz의 L 밴드를 이용하는 것으로 도시되었지만, 고주파 대역인 K 밴드(18 내지 26.5 GHz), Ka 밴드(26.5 내지 40 GHz), Ku 밴드(12 내지 18 GHz)를 이용하는 것도 가 능할 수 있다. 본 개시의 다양한 실시 예들에서 TA는 MAC 제어 엘리먼트(Control Element: CE), 일 예로 타이밍 어드밴스 명령 MAC CE(Timing Advance Command MAC CE), 혹은 절대 타이밍 어드밴스 명령 MAC CE(Absolute Timing Advance Command MAC CE) 등을 통해 전송될 수 있다. 한편, 물리계층으로 전달되는 MAC 계층으로부터의 메시지, 예를 들어 MAC PDU는 하나 혹은 그 이상의 MAC 서브 PDU들을 포함할 수 있다. 각 MAC 서브 PDU는 다음 중 하나를 포함할 수 있다. . MAC 서브 헤더만 (패딩(padding)을 포함하는) . MAC 서브 헤더 및 MAC SDU . MAC 서브 헤더 및 MAC CE . MAC 서브 헤더 및 패딩 MAC SDU들은 가변 사이즈를 가지며, 각 MAC 서브 헤더는 MAC SDU, MAC CE, 또는 패딩에 대응될 수 있다. 한편, 물리계층으로 전달되는 MAC 계층으로부터의 메시지, 예를 들어 MAC PDU는 하향링크와 상향링크의 경우 각 각 도 28과 도 29와 같이 구성될 수 있다. 먼저, 도 28을 참조하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 하향링크에서 MAC 계층에서 물리 계층으로 전달되는 메시지의 일 예에 대해서 설명하기로 한다. 도 28은 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 하향링크에서 MAC 계층에서 물리 계층으로 전달되 는 메시지의 일 예를 개략적으로 도시한 도면이다. 도 28을 참조하면, 하향링크에서 MAC 계층에서 물리 계층으로 전달되는 메시지의 일 예는 하향링크 MAC PDU(DL MAC PDU)가 될 수 있다. 도 28에서, MAC CE 1을 포함하는 MAC 서브 PDU는 R/LCID 서브 헤더 및 고정-사이즈 MAC CE(fixed-sized MAC CE)를 포함하고, MAC CE 2를 포함하는 MAC 서브 PDU는 R/F/LCID/L 서브 헤더 및 가변- 사이즈 MAC CE(variable-sized MAC CE)를 포함한다. 또한, MAC SDU를 포함하는 MAC 서브 PDU는 R/F/LCID/L 서 브 헤더 및 MAC SUD를 포함한다. 도 28에서, LCID는 논리 채널 ID(logical channel ID) 필드를 나타내며, 상기 LCID 필드는 상응하는 MAC SDU의 인스턴스(instance) 또는 상응하는 MAC CE의 타입 또는 패딩을 지시하며, 이에 대해서는 하기 표 21 및 표 22에 서 구체적으로 설명하기로 한다. 여기서, 하기 표 21은 DL-SCH에 대한 LCID의 값들을 나타내며, 표 22는 UL-SCH 에 대한 LCID의 값들을 나타낸다. MAC 서브 헤더별로는 1개의 LCID 필드가 존재하고, 상기 LCID 필드의 사이즈 는 6비트이다. 상기 LCID 필드가 일 예로 \"34\"로 설정되어 있을 경우, eLCID 필드를 포함하는 MAC 서브 헤더에 1개의 추가적인 옥텟(octet)이 존재하며, LCID 필드를 포함하는 상기 옥텟을 따른다. 상기 LCID 필드가 일 예로 \"33\"으로 설정되어 있을 경우, eLCID 필드를 포함하는 MAC 서브 헤더에 2개의 추가적인 옥텟들이 존재하며, 이 2개의 옥텟들은 LCID 필드를 포함하는 상기 옥텟을 따른다. 또한, eLCID는 확장된 논리 채널 ID 필드를 나타내며, 상응하는 MAC SDU의 논리 채널 인스턴스 또는 상응하는 MAC CE의 타입을 지시한다. 상기 eLCID 필드의 사이즈는 8비트 또는 16비트이다. 또한, L은 길이 필드를 나타내며, 길이 필드는 상응하는 MAC SDU 또는 가변 사이즈 MAC CE의 길이를 지시한다. 상기 고정된-사이즈 MAC CE들, 패딩, 또는 UL 공통 제어 채널(common control channel: CCCH)을 포함하는 MAC SDU들에 상응하는 서브 헤더들을 제외한 MAC 서브 헤더별로 1개의 길이 필드가 존재한다. 상기 길이 필드의 사 이즈는 F 필드에 의해 지시된다.또한, F는 포맷 필드를 나타내며, 길이 필드의 사이즈를 지시한다. 고정 MAC CE들, 패딩, UL CCCH를 포함하는 MAC SDU들을 제외한 MAC 서브 헤더별로 1개의 F 필드가 존재한다. F 필드의 사이즈는 1비트이며, 일 예로 값 0 은 상기 길이 필드의 8비트를 지시하고, 다른 예로 값 1은 상기 길이 필드의 16 비트를 지시한다. 또한, R은 예약 비트로서, 일 예로 \"0\"으로 설정된다. 도 28에 도시되어 있는 바와 같이, MAC CE들, 예를 들어 MAC CE 1 및 MAC CE 2는 함께 배치되고, MAC CE(들)를 포함하는 MAC 서브 PDU(들)는 MAC SDU를 포함하는 MAC 서브 PDU 및 패딩을 포함하는 MAC 서브 PDU 이전에 배치 된다. 여기서, 상기 패딩의 사이즈는 영(zero)이 될 수 있다. 다음으로, 도 29를 참조하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 상향링크에서 MAC 계층에서 물리 계층으로 전달되는 메시지의 일 예에 대해서 설명하기로 한다. 도 29는 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 상향링크에서 MAC 계층에서 물리 계층으로 전달되 는 메시지의 일 예를 개략적으로 도시한 도면이다. 도 29을 참조하면, 상향링크에서 MAC 계층에서 물리 계층으로 전달되는 메시지의 일 예는 상향링크 MAC PDU(UL MAC PDU)가 될 수 있다. 도 29에서, MAC CE 1을 포함하는 MAC 서브 PDU는 R/LCID 서브 헤더 및 고정-사이즈 MAC CE를 포함하고, MAC CE 2를 포함하는 MAC 서브 PDU는 R/F/LCID/L 서브 헤더 및 가변-사이즈 MAC CE를 포함 한다. 또한, MAC SDU를 포함하는 MAC 서브 PDU는 R/F/LCID/L 서브 헤더 및 MAC SUD를 포함한다. 도 29에 도시되어 있는 바와 같이, MAC CE들, 예를 들어 MAC CE 1 및 MAC CE 2는 함께 배치되고, MAC CE(들)를 포함하는 MAC 서브 PDU(들)는 MAC SDU를 포함하는 MAC 서브 PDU 이후에 배치되고, 패딩을 포함하는 MAC 서브 PDU 이전에 배치된다. 여기서, 상기 패딩의 사이즈는 영(zero)이 될 수 있다. 도 28 및 도 29에서, MAC 계층의 서브헤더에 포함된 LCID, 즉 논리 채널 ID (logical channel ID) 또는 확장된 논리 채널 ID(eLCID: extended logical channel ID)는, 전송되는 MAC SDU 또는 MAC CE의 타입 등을 지시해줄 수 있다. 상기 LCID의 인덱스와 MAC SDU 또는 MAC CE의 타입 등의 매핑은 일 예로 하기 표 21과 같이 나타낼 수 있으며, 상기 eLCID의 인덱스와 MAC SDU 또는 MAC CE의 타입 등의 매핑은 일 예로 하기 표 22와 같이 나타낼 수 있다. 본 개시의 다양한 실시 예들에서, LCID는 MAC SDU의 논리채널의 인스턴스(instance)나, MAC CE의 타입이 나, 하향링크 공유 채널(downlink shared channel: DL-SCH) 및 상향링크 공유 채널(upnlink shared channel: UL-SCH)의 패딩(padding) 정보를 지시할 수 있다. MAC 서브 헤더 당 하나의 LCID가 매핑되며, LCID는 일 예로 6비트로 구현될 수 있다. [표 21]DL-SCH를 위한 LCID 값"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 31, "content": "[표 22] DL-SCH를 위한 eLCID 값"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 32, "content": "다음으로, 도 30을 참조하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 RAR의 MAC 페이로드 또는 MsgB의 MAC 페이로드 (폴백(fallback) RAR)의 포맷의 일 예에 대해서 설명하기로 한다.도 30은 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 RAR의 MAC 페이로드 또는 MsgB의 MAC 페이로드의 포맷의 일 예를 계략적으로 도시한 도면이다. 도 30을 참조하면, 일 예로 RAR의 MAC 페이로드는 MAC RAR이라 칭해질 수 있으며, MAC RAR은 다음과 같은 필드 들을 포함할 수 있다. . R 필드: 예약된 비트로서, 일 예로 \"0\"으로 설정될 수 있다. . 타이밍 어드밴스 명령 (Timing Advanced Command) 필드: 타이밍 어드밴스 명령 필드는 MAC 엔터티가 적용해야 하는 타이밍 조정의 양을 제어하기 위해 사용되는 인덱스 값 TA 를 지시한다. 상기 타이밍 어드밴스 명령 필드의 사이즈는 일 예로 12비트이다. . UL 그랜트(UL Grant) 필드: UL 그랜트 필드는 업링크에서 사용될 자원들을 지시하며, UL 그랜트 필드의 사이 즈는 일 예로 27비트이다. . 임시 C-RNTI 필드: 임시 C-RNTI 필드는 랜덤 억세스 동안 MAC 엔터티에 의해 사용되는 임시 식별자를 지시하 며, 임시 C-RNTI 필드의 사이즈는 일 예로 16비트이다. 또한, 본 개시의 다양한 실시 예들에서 용어 \"기지국(base station: BS)\"은 무선 통신 시스템의 타입을 기반으 로 송신 포인트(transmit point: TP), 송신-수신 포인트(transmit-receive point: TRP), 진화된 노드 비 (enhanced node B: eNodeB 혹은 eNB), 5G 기지국(5G base station: gNB), 매크로셀, 펨토셀, WiFi 억세스 포인 트(access point: AP), 혹은 다른 무선 이네이블 디바이스들과 같은, 무선 억세스를 제공하도록 구성되는 임의 의 컴포넌트(혹은 컴포넌트들의 집합)를 나타낼 수 있다. 기지국들은 하나 혹은 그 이상의 무선 프로토콜들, 일 예로 5G 3GPP 신규 무선 인터페이스/억세스(NR), 롱텀 에볼루션(long term evolution: LTE), 진보된 LTE(LTE advanced: LTE-A), 고속 패킷 억세스(high speed packet access: HSPA), Wi-Fi 802.11a/b/g/n/ac 등에 따른 무 선 억세스를 제공할 수 있다. 또한, 본 개시의 다양한 실시 예들에서 용어 \"단말\"은 “사용자 장비(user equipment: UE), “이동국(mobile station)”, “가입자국(subscriber station)”, “원격 단말기(remote terminal)”, “무선 단말기(wireless terminal)”, \"수신 포인트(receive point), 혹은 “사용자 디바이스(user device)”와 같은 임의의 컴포넌트 를 나타낼 수 있다. 편의상, 상기 용어 \"단말”은 상기 단말이 이동 디바이스(이동 전화기 혹은 스마트 폰과 같 은)인지 혹은 고정 디바이스(일 예로 데스크 탑 컴퓨터 혹은 자동 판매기와 같은)로 고려되어야 하는 지와 상관 없이, 본 개시의 다양한 실시 예들에서 기지국에게 억세스하는 디바이스를 나타내기 위해 사용된다. 본 개시의 다양한 실시 예들에서 위성이라 함은 지상으로부터 떨어진 높은 곳에 위치한 물체일 수 있으며, 비행기, 비행선 등을 포함하는 개념일 수 있을 것이다. 또한, 본 개시의 다양한 실시 예들에서 용어 \"TA\"는 \"TA 정보\", \"TA 값\", 혹은 \"TA 인덱스(index)\"등과 혼용되 어 사용될 수 있다. 본 개시의 다양한 실시 예들에서, 기지국이 단말에게 전송하는 데이터 또는 제어 정보를 제1 신호라고 칭하기로 하고, 상기 제1 신호와 연관된 상향링크 신호를 제2 신호라고 칭하기로 할 수 있다. 일 예로, 제1 신호는 DCI, UL grant, PDCCH, PDSCH, RAR 등을 포함할 수 있으며, 상기 제1 신호와 연관되는 제2 신호는 PUCCH, PUSCH, msg 3 등을 포함할 수 있다. 또한, 상기 제1 신호와 제2 신호 간에는 연관성(association)이 있을 수 있다. 일 예로, 제1 신호가 상향링크 데이터 스케줄링을 위한 UL grant를 포함하는 PDCCH일 경우, 상기 제1 신호에 해당하는 제2 신호는 상향링크 데 이터를 포함하는 PUSCH가 될 수 있다. 한편, 상기 제1 신호와 제2 신호가 송수신되는 시점의 차이(gap)는 단말 과 기지국 사이에 미리 정해져 있는 값일 수 있다. 이와는 달리, 상기 제1 신호와 제2 신호가 송수신되는 시점 의 차이는 기지국이 지시하여 정해지거나 상위 시그널링으로 전달된 값에 의해 정해질 수 있다. 한편, 위성 네비게이션 시스템은 GNSS라고도 불릴 수 있으며, 상기 GNSS는 일 예로, 미국의 GPS, 러시아의 GLONASS, EU의 갈릴레오, 중국의 베이더우 등을 포함할 수 있다. 상기 GNSS는 지역 위성 네비게이션 시스템 (Regional Navigation Satellite System: RNSS)을 포함할 수 있으며, RNSS는 일 예로, 인도의 IRNSS, 일본의 QZSS, 한국의 KPS 등을 포함할 수 있다. 한편, 상기 GNSS에서 송신되는 신호는 보조적인 네비게이션 정보, 위성 의 정상 가동 상태, 위성 시각, 위성 궤도력, 위성의 고도, 기준 시간, 다양한 보정 자료에 대한 정보 중 적어 도 하나를 포함할 수 있다. 먼저, 도 31을 참조하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 단말이 TA 값을 직접 계산할 경우 의 상향링크 전송 동작에 대해서 설명하기로 한다. 도 31은 본 개시의 다양한 실시 예들에 따른 통신 시스템에 서 단말이 TA 값을 직접 계산할 경우의 상향링크 전송 동작을 개략적으로 도시한 도면이다. 도 31을 참조하면, 먼저 단말은 상기 단말 자신의 위치와 위성의 위치에 기반하여 상기 위성과 단말 사이의 전 파 지연 시간을 추정(estimation)할 수 있고, 추정된 전파 지연 시간을 상기 단말 스스로 보정한 후 상향링크 전송 동작을 수행할 수 있다. 일 예로, 상기 위성은 상기 위성의 위치에 관한 정보를 방송(broadcast) 정보를 통해 전송하고, 상기 단말은 상기 위성이 전송한 상기 위성의 위치에 관한 정보를 수신하여 상기 위성의 위치와 상기 단말 자신의 위치를 비교할 수 있다. 상기 단말은 일 예로, 상기 단말 자신의 위치를 글로벌 측위 시스템 (Global Positioning System: GPS) 등을 활용하여 식별할 수 있다. 상기 단말의 위치를 식별하는 방식은 다양한 형태들로 구현될 수 있으며, 이에 대한 구체적은 설명은 생략하기로 한다. 상기 단말은 상기 위성의 위치와 단말 자신의 위치를 비교한 결과를 기반으로 상기 단말에서 위성까지 전파가 전달되는데 걸리는 전파 지연 시간을 추정하고, 상기 추정된 전파 지연 시간을 기반으로 상향링크 전송 시간을 계산할 수 있다. 예를 들어, 상기 단말이 특정 시점에 하향링크를 통해 슬롯 n에서 하향링크 신호를 수신하고, 슬롯 n+k에서 상기 수신된 하향링크 신호에 대응되는 상향링크 신호를 전송해야 한다고 가정할 경우, 상기 단말 은 상기 상향링크 신호를 상기 슬롯 n+k보다 설정 시간만큼, 일 예로 2*Td만큼 먼저 송신할 수 있다. 여기서, Td는 상기 위성의 위치 및 단말의 위치를 기반으로 계산된 상기 단말에서 위성까지의 전파 지연 시간에 상응할 수 있다. 여기서, 상기 전파 지연 시간 Td는 일 예로 상기 단말과 위성 간의 거리를 빛의 속도로 나눈 값일 수 있다. 또한, 상기 위성의 위치는 상기 단말이 상향링크 신호를 전송하는 상기 슬롯 n+k를 기준으로 계산되는 값 일 수 있으며, 이는 상기 위성의 이동에 따라 상기 슬롯 n에서의 위성의 위치와 상기 슬롯 n+k에서의 위성의 위 치가 달라질 수 있기 때문이다. 한편, 본 개시의 다양한 실시 예들에서 GPS와 같은 위성 네비게이션 시스템은, 하나 혹은 그 이상의 위성들을 포함하며, 상기 하나 혹은 그 이상의 위성들 각각은 시간 및 위치 등과 같은 정보를 포함하는 신호를 송신한다. 단말은 상기 위성 네이게이션 시스템의 하나 또는 그 이상의 위성들 각각으로부터 신호를 수신하고, 상기 하나 또는 그 이상의 위성들 각각으로부터 수신된 신호를 기반으로 상기 단말 자신의 위치 등을 식별할 수 있다. 한편, 본 개시의 다양한 실시 예들에서 NTN 위성이라 함은 단말이 기지국과 연결하기 위해 신호를 전달하는 역 할을 하는 통신 위성일 수 있다. 또한, 본 개시의 다양한 실시 예들에서 GNSS 위성은 위성 네비게이션 시스템의 신호를 전송하는 위성일 수 있다. 한편, 도 31에서 단말은 UE, 기지국은 지상국(ground station)/DU 등으로 표 현되었음에 유의하여야만 할 것이다. 다음으로 도 32를 참조하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 지상 네트워크와 위성 네트워 크에서의 전파 지연 시간의 차이의 일 예에 대해서 설명하기로 한다. 도 32는 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 지상 네트워크와 위성 네트워크에서의 전파 지연 시간의 차이의 일 예를 개략적으로 도시한 도면이다. 도 32를 참조하면, 먼저 지상 네트워크에서는 단말과 기지국간의 거리를 일 예로 최대 약 100km 정도로 고려하 고, 따라서 상기 단말과 기지국간에는 1ms 이하의 전파 지연 시간이 발생할 수 있다. 하지만, 위성 네트워크에서는 단말과 위성간의 거리가 수천 km일 수 있고, 또한 상기 위성과 기지국간의 거리 역시 수천 km일 수 있기 때문에, 상기 위상 네트워크에서의 전파 지연 시간은 상기 지상 네트워크에서의 전파 지연 시간에 비해 훨씬 클 수 있다. 한편, 위성 네트워크 통신에서는 위성의 고도 및 고도각에 따라 전파 지연 시간이 달라질 수 있는데, 도 32에는 일 예로 위성의 고도가 700 km일 경우의 고도각에 따른 단말-위성간 거리 및 전파가 왕복하는데 걸리는 지연 시 간(round trip time: RTT)이 도시되어 있다. 또한, 도 32에 도시되어 있는 위성 네트워크에서는 저궤도 위성이 가정되고, 따라서 고도각이 0° 내지 180°인 경우 무선 왕복 지연 시간(radio round trip time: radio RTT)이 40.9ms에서 9.3ms까지 발생할 수 있다는 것이 도시되었다. 여기서, 무선 왕복 지연 시간은 송신기와 수신기 사 이에서 신호가 신호가 송수신되는데 걸리는 왕복 시간 및 상대 노드에서의 처리 시간을 포함할 수 있다. 다음으로 도 33을 참조하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 지상 네트워크와 위성 네트워 크에서 TA를 적용하는 일 예에 대해서 설명하기로 한다.도 33은 본 개시의 다양한 실시 예들에 따른 통신 시스 템에서 지상 네트워크와 위성 네트워크에서 TA를 적용하는 일 예를 개략적으로 도시한 도면이다. 도 33을 참조하면, 먼저 지상 네트워크에서는 최대 전파 지연 시간이 1 또는 2 ms 이내이기 때문에, LTE 및 5G NR 시스템에서 제공하는 TA 기능을 통해 기지국 측면에서 하향링크 신호를 전송하는 슬롯 타이밍과 상향링크 신 호가 수신되는 슬롯 타이밍을 일치시킬 수 있다 (즉, 하향링크 슬롯과 상향링크 슬롯의 인덱스가 일치할 수 있 다). 즉, 하향링크 시점보다 기지국이 지시하는 TA 값만큼 단말이 먼저 상향링크 신호를 전송하면, 상기 단말이 전송한 상향링크 신호가 상기 기지국에서 수신되었을 때는 상기 기지국의 하향링크 시점과 일치하게 된다. 도 33에는 지상 네트워크에서, 기지국이 RAR을 통해 TA 값을 지시하고, 단말이 상기 TA 값을 기반으로 기지국이 스 케쥴한 슬롯 n + 4에서 PUSCH 신호를 송신하고, 상기 기지국이 슬롯 n+4에서 상기 단말이 송신한 PUSCH 신호를 수신하는 경우가 도시되어 있다. 한편, 위성 네트워크에서는 종래 LTE 및 5G NR 시스템에서 제공하는 TA를 통해 기지국 측면에서 하향링크 신호 를 전송하는 슬롯 타이밍과 상향링크 신호가 수신되는 슬롯 타이밍을 일치시키는 것이 불가능할 수 있다. 이는 상기 위성 네트워크에서 발생하는 전파 지연 시간이 수십 ms 정도로 지상 네트워크에서 발생하는 전파 지연 시 간에 비해 훨씬 크고, 따라서 이러한 전파 지연 시간은 종래 LTE 및 5G NR 시스템에서 고려하고 있는 TA의 최대 값보다 크기 때문이다. 도 33에는 위성 네트워크에서, 기지국이 단말로 TA 값을 지시하는 것이 불가능하고, 따 라서 기지국은 스케쥴한 슬롯 n + 4에서 단말로부터 PUSCH 신호를 수신하는 것이 아니라, 슬롯 K만큼 지연된 슬 롯 n+4+K에서 상기 단말이 송신한 PUSCH 신호를 수신하는 경우가 도시되어 있다. 다음으로 도 34를 참조하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 위성이 지원하는 하나의 빔 내 에 다수의 단말들이 위치할 경우의 최대 왕복 지연 시간 차이의 일 예에 대해서 설명하기로 한다. 도 34는 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 위성이 지원하는 하나의 빔 내에 다수의 단말들이 위치할 경우의 최대 왕복 지연 시간 차이의 일 예를 개략적으로 도시한 도면이다. 도 34를 참조하면, 먼저 위성은 다수 개의 빔들을 지원할 수 있고, 상기 위성이 지원하는 다수 개 의 빔들 중 하나의 빔 내에 다수의 단말들이 위치할 수 있다. 이 경우, 단말-위성-기지국간 왕복 지연 시간의 차이 중 최대 차이 값의 일 예가 도 34에 도시되어 있는 것이다. 도 34에 도시되어 있는 바와 같이 위성 네트워크에서는 빔의 크기가 작을수록, 일 예로 빔 직경이 작을 수록, 단말이 겪는 고도각에 따른 상기 왕복 지연 시간의 최대 차이 값이 감소됨을 알 수 있다. 이와는 달리, 지상 네트워크에서는 셀의 반지름에 따라 왕복 지연 시간의 최대 차이 값이 감소됨을 알 수 있다. 다음으로 도 35를 참조하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 위성의 이동에 따라 변화되는 단말-기지국 간의 무선 왕복 지연 시간의 일 예에 대해서 설명하기로 한다. 도 35는 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 위성의 이동에 따라 변화되는 단말-기지국 간의 무선 왕복 지연 시간의 일 예를 개략적으로 도시한 도면이다. 도 35를 참조하면, 위성은 궤도를 따라 이동하며, 상기 위성의 이동에 따라 단말-기지국 사이의 왕복 지연 시간 역시 변화될 수 있다. 도 35에 도시되어 있는 바와 같이, 상기 위성은 궤도를 따라 이동하기 때문에, 시간이 경 과함에 따라 단말-기지국 사이의 왕복 지연 시간이 변화될 수 있다. 즉, 지상 네트워크의 경우 일반적으로 시간 이 경과될지라도 단말-기지국 사이의 왕복 지연 시간은 일정 시간 이하로 변화되기 때문에 그 변화량이 적은 반 면에, 위성 네트워크에서는 시간이 경과됨에 따라 단말-기지국 사이의 왕복 지연 시간이 위성의 이동에 따라 매 우 크게 변하고, 따라서 단말-기지국 사이의 왕복 지연 시간의 변화량이 매우 크다는 것을 알 수 있다. 한편, 단말은 하나 또는 그 이상의 GNSS 위성들 각각으로부터 신호를 수신하고, 상기 하나 또는 그 이상의 GNSS 위성들 각각으로부터 수신한 신호를 기반으로 상기 단말 자신의 위치를 계산할 수 있고, 또한 상기 하나 혹은 그 이상의 GNSS 위성들 각각에서의 기준 시간을 식별할 수 있다. 만약 상기 단말이 다수의 GNSS 위성들로부터 수신된 신호들을 기반으로 상기 단말 자신의 위치를 다수로 계산할 수 있을 경우, 상기 단말은 상기 다수의 위 치들의 평균, 또는 다수의 위치들 중 가장 센 세기를 가지는 수신 신호에 해당하는 위치, 또는 신호 세기를 기 반하는 상기 다수의 위치들의 평균값(일 예로, 신호 세기가 센 신호에 대응되는 위치에는 가중치를 적용하는 방 법) 등을 기반으로 상기 단말 자신의 실제 위치를 계산할 수 있다. 여기서, 상기 단말이 상기 다수의 GNSS 위성 들에서 수신한 신호들을 기반으로 상기 단말 자신의 위치를 계산하는 방식은 다양한 형태들로 구현될 수 있으며, 이에 대한 구체적인 설명은 생략하기로 한다. 본 개시의 다양한 실시 예들에서, GNSS 로부터 획득되는 시간 또는, 기지국이 전달하는 기지국의 시간은 일 예 로, 협정 세계 시 (coordinated universal time: UTC) 시간을 기준으로 할 수 있을 것이고, 이는 그레고리안력(Gregorian calendar)의 1900년 1월 1일 00시 00분 00초에서부터의 시간을 기준으로 하는 것일 수 있다. 이는 GNSS 시스템의 타입에 따라 달라질 수 있으며 하기 표 23에 나타낸 바와 같은 기준 시간대가 사용될 수 있다. [표 23]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 33, "content": "상기 표 23에서 NavIC은 NAVigation with Indian Constellation을 의미하고, QZS는 Quasi Zenith Satellite, QZSS는 Quasi-Zenith Satellite System, QZST는 Quasi-Zenith System Time, SBAS는 Space Based Augmentation System, BDS는 BeiDou Navigation Satellite System를 의미하는 것일 수 있다. 또한, 상기 기지국은 위성을 통해, 상기 기지국 자신이 사용하는 위치나 시간 정보의 기준이 되는 GNSS 시스템 의 타입을 지시해줄 수 있으며, 하기 표 24에 나타낸 바와 같은 지시자를 사용할 수 있다. [표 24]"}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 34, "content": "상기에서 설명한 바와 같이, 상기 단말은 상기 단말 자신이 계산한 단말 자신의 위치와, NTN 위성으로부터 수신 한 NTN 위성의 위치를 기반으로 NTN 위성으로부터 단말까지 신호가 전달되는데 소요되는 시간을 계산할 수 있고, 이를 기반으로 TA 값을 결정할 수 있다. 상기 단말은 상기 TA 값을 결정할 경우, 상기 NTN 위성으로부터 지상의 기지국까지의 거리나, 해당 신호가 다른 NTN 위성을 거쳐서 상기 지상의 기지국으로 전달될 경우 상기 NTN 위성에서 다른 NTN 위성까지의 거리도 함께 고려할 수 있다. 이와는 달리, 상기 단말은 GNSS 위성이 송신하는 정보로부터 기준 시간(reference time) 정보를 획득할 수 있고, NTN 위성이 송신하는 시간 정보와 상기 GNSS 위성으로부터 획득한 기준 시간 정보를 비교하고, 그 비교결과를 기반으로 상기 NTN 위성으로부터 상기 단말까지 소요되는 시간(propagation delay)을 계산할 수 있다. 본 개시의 다양한 실시 예들에서 제공하는 방법 및 장치는 위성통신 시스템뿐만 아니라 지상 통신 시스템에도 적용할 수 있다. 한편 본 개시의 다양한 실시 예들에서는, 통신 시스템에서 HARQ process 수를 설정하거나 지시하고, HARQ process ID 값을 전달하고 지시하는 방법 및 장치를 제안한다. [제1 실시 예] 제1실시예에서는 HARQ process 수를 설정하는 방법 및 장치를 제공한다. 기지국은 단말에게 연속적인 스케줄링을 위해 많은 수의 HARQ process 수를 갖도록 허용할 수 있을 것이다. 이 때, HARQ process 수를 설정하거나 지시하는 방법 및 장치가 필요하며, 이는 하기와 같은 방법 중 최소 하나 또 는 하나 이상의 결합에 의해 실행될 수 있을 것이다. 하기에서는 하향링크 또는 상향링크의 특별한 언급이 없다 면, 하기의 방법들은 하향링크와 상향링크 모두에 적용되는 것일 수 있다. - 방법A1: 단말의 능력 (UE capability)에 기반하여 결정하고 설정될 수 있다. 이 방법에서는 UE capability에 의해 단말이 지원하는 최대 HARQ process 수가 고정되어 사용되는 것일 수 있다. 즉, 단말이 32개의 HARQ process를 지원하면, 항상 32개의 HARQ process가 사용될 수 있다. - 방법A2: 시스템 정보 방송 (system information block: SIB)에 의해 해당 기지국의 스케줄링에 사용될 HARQ process 수를 지시할 수 있다. - 방법A3: RRC 메세지를 통해 기지국이 단말에게 설정해줄 수 있다. 일례로, 이 설정은 서빙셀당 PDSCH 또는 PUSCH의 설정에 포함되는 파라미터로 전달될 수 있다. 예를 들어 하기와 같은 파라미터일 수 있다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 35, "content": "- 방법A4: MAC CE 메시지를 통해 기지국이 단말에게 설정해줄 수 있다. - 방법A5: DCI의 특정 비트필드 값을 통해 기지국이 단말에게 지시해줄 수 있다. - 방법A6: 16개보다 많은 수의 HARQ process 가 enable되면 해당 수의 HARQ process를 사용한다. 일례로, 32_HARQ_processs 파라미터가 enable로 설정되면 단말은 32개의 HARQ process를 사용할 수 있다. - 방법A7: NTN용 기지국에 접속하거나, 위성을 통해 기지국에 접속하는 경우에는 32개의 HARQ process를 사용한 다. 단말은 NTN용 주파수 대역에서 접속을 시도하거나, SIB에 NTN과 관련된 파라미터가 전달되거나, TA가 일정 값 이상을 적용하는 등의 경우에, NTN용 기지국에 접속하거나 위성을 통해 기지국에 접속한다고 판단할 수 있다. - 방법A8: 상향링크 HARQ process 수가 별도로 설정되지 않으면 단말은 상향링크 전송을 위해 16개의 HARQ process를 가정한다. 즉, uplink HARQ process수의 디폴트 값은 16일 수 있다. 상기에서 16개는 한 일례일 수 있으며, 디폴트값은 미리 정해진 다른 값으로 사용될 수 있으며 32보다 작을 수 있다. 이는 아래와 같이 기술될 수 있다. (For uplink, a maximum of 32 HARQ processes per cell is supported by the UE if the UE indicates ExtendedHARQProcess, and a maximum of 16 HARQ processes per cell is supported, otherwise. The number of processes the UE may assume will at most be used for the uplink is configured to the UE for each cell separately by higher layer parameter nrofHARQ-ProcessesForPUSCH, and when no configuration is provided the UE may assume a default number of 16 processes.) 상기 설정은 상향링크와 하향링크에서 각각 다른 방법들이 적용될 수 있다. 본 발명에서는 편의상 32로 HARQ process 수가 증가하는 것으로 설명하였지만, 64, 128 등 다른 값으로 결정되어 증가하는 경우에도 본 발명이 적용될 수 있을 것이다.[제2 실시 예] 제2실시예에서는 HARQ process ID를 지시하는 방법 및 장치를 제공한다. 기지국이 단말에게 복수개의 HARQ process 수를 설정한 후, 데이터 스케줄링 시에 HARQ process ID를 지시하는 것이 필요하며, 이는 하기와 같은 방법 중 최소 하나 또는 하나 이상의 결합에 의해 실행될 수 있을 것이다. 하기에서는 하향링크 또는 상향링크 의 특별한 언급이 없다면, 하기의 방법들은 하향링크와 상향링크 모두에 적용되는 것일 수 있다. 본 방법에서는 HARQ process ID 지시를 위해 DCI에서 포함되는 지시자의 비트필드의 비트수를 결정하는 방법 및 장치가 제공된 다. - 방법B1: SIB 또는 RRC 메시지 또는 MAC CE를 통해 전달된 offset 값(N_offset)과 DCI의 HARQ process number 비트필드에서 전달되는 값을 더하거나 modulo 연산의 덧셈을 통해 HARQ process ID를 계산할 수 있다. 즉, DCI 에서 전달된 값을 N_DCI라 하고, 사용하는 HARQ process의 수를 N_HARQ라 하면, HARQ process ID (N_ID)는 N_ID = mod(N_DCI + N_offset, N_HARQ)를 통해 결정될 수 있다. 상기에서 N_HARQ는 본 발명의 제1 실시 예를 통해 제공되는 방법으로 결정될 수 있을 것이다. 상기에서 mod(x, y)연산은 x를 y로 나눈 나머지를 의미하는 modulo 연산을 의미한다. - 방법B2: DCI에서 제공하는 HARQ process number 비트필트의 사이즈는 하기와 같은 상위시그널링을 통해 설정 될 수 있을 것이다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 36, "content": "상기에서 설정된 harq-ProcessNumberSizeDCI-1-2-r17 값을 N이라고 한다면, 이는 DCI에 포함된 HARQ process number 지시를 위한 비트필드가 N비트를 의미할 수 있고, 이 때 HARQ process는 0부터 (2^N)-1 까지 사용되거나, 또는 다른 일례로, SIB 또는 RRC 메시지 또는 MAC CE를 통해 전달된 offset 값(N_offset)을 기준으 로 N_offset부터 N_offset+(2^N)-1 까지 사용될 수 있다. 만약 HARQ process ID가 설정된 HARQ process 수에 도달하면 다시 HARQ process 0을 의미할 수 있다. 이러한 오프셋 값은 BWP 또는 CORESET 또는 Search space 별 로 따로 설정되는 것일 수 있다. 즉, DCI가 검출되는 제어정보영역(CORESET 또는 Search space)에 따라 사용하 는 HARQ process ID를 다르게 하당하여 스케줄링이 가능하도록 하기 위함일 수 있다. - 방법B3: 사용하기 위해 설정된 HARQ process 수를 N_HARQ ( )라 하면 상기에서 N_HARQ는 본 발명의 제1 실시 예를 통해 제공되는 방법으로 결정될 수 있을 것이다. 이 경우 DCI에는 HARQ process number 지시를 위한 비트필드가 비트를 갖을 수 있다. - 방법B4: DCI 포맷에 따라 HARQ process number 지시를 위한 비트필드의 크기가 다를 수 있다. 일례로, 32개의 HARQ process를 사용하도록 설정된 경우라 하더라도, DCI format 0_0과 1_0은 4비트의 HARQ process number 비 트필드를 갖고, DCI format 0_1과 1_1은 5비트의 HARQ process number 비트필드를 갖을 수 있다. 이 경우, DCI format 0_0과 1_0을 통해서는 HARQ process 0부터 15까지를 이용해 상향링크와 하향링크 데이터 스케줄링이 가 능할 수 있다. 또한, DCI format 0_1과 1_1을 통해서는 HARQ process 0부터 31까지를 이용해 상향링크와 하향 링크 데이터 스케줄링이 가능할 수 있다. 이 때도 별도로 기지국으로부터 설정된 N_offset값을 기준으로 DCI format 0_0과 1_0을 통해서는 HARQ process N_offset부터 mod(15+N_offset, 32)까지를 이용해 상향링크와 하향 링크 데이터 스케줄링이 가능할 수 있다. 이는 지상망 통신과 같은 캐리어에서 위성통신을 지원하는 경우 다른 HARQ process를 이용한 스케줄링을 해주기 위해서일 수 있다. [제3 실시 예] 제3실시예는 하나의 DCI를 이용해 여러 개의 PDSCH 또는 PUSCH를 스케줄링해주는 경우에 HARQ process ID를 부 여하는 방법 및 장치를 제공한다. 본 실시예에서는 PUSCH의 스케줄링 및 송수신을 기준으로 설명하겠지만, PDSCH를 전송하는 경우에도 동일하게 적용할 수 있다. 본 발명에서는 HARQ process number와 HARQ process ID 값은 혼용될 수 있다. 하나의 DCI에서 여러 개의 연속적인 PUSCH를 스케줄링해주는 경우, 해당 DCI에서 하나의 HARQ process ID를 지 시해줄 수 있다. 이 때 지시된, HARQ process ID는 스케줄링 된 첫 번째 PUSCH에 사용될 수 있다. 여기서 문제 는 두 번째 PUSCH부터 스케줄링된 PUSCH들에는 어떠한 HARQ process ID가 사용되어야하냐는 것일 수 있다. 이를 해결하기 위해 종래의 NR 시스템은 두 번째 PUSCH부터는 HARQ process ID 값을 하나씩 증가시키고 16에 도달하 면 다시 돌아가서 HARQ process ID 값으로 0을 사용하고 다시 하나씩 증가시킨 ID 값을 부여할 수 있다. 이는아래와 같이 기술 될 수 있다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 37, "content": "하지만 HARQ process 수가 늘어난 NTN과 같은 시스템에서 위와 같은 방식을 사용하거나, HARQ process 수가 설 정 가능한 경우에는 위와 같은 방식은 문제를 일으킬 수 있다. 예를 들어, HARQ process를 총 32개까지 사용하 도록 설정한 경우에는, 위와 같은 방식으로는 HARQ process ID 16부터 31까지의 값을 사용하지 못할 수 있다. 또한, DCI에서 16보다 크거나 같은 값을 HARQ process ID로 지시한 경우에는 올바르지 못하게 동작하게 된다. 또한, HARQ process 수가 설정 가능한 경우에도, 사용하지 못하는 HARQ process가 발생하거나, 사용하지 않는 HARQ process ID를 부여하는 오류가 발생할 수 있다. 위와 같은 문제를 해결하기 위해, HARQ process 수가 늘어난 NTN과 같은 시스템에서는 스케줄링하는 DCI에서 지 시된 HARQ process ID는 스케줄링 된 첫 번째 PUSCH에 사용하고, 만약 HARQ process를 32개 사용하도록 설정되 면, 두 번째 PUSCH부터는 HARQ process ID 값을 하나씩 증가시키고 32에 도달하면 다시 돌아가서 HARQ process ID 값으로 0을 사용하고 다시 하나씩 증가시킨 ID 값을 부여할 수 있다. 만약 HARQ process를 32개 사용하도록 설정하지 않으면, 두 번째 PUSCH부터는 HARQ process ID 값을 하나씩 증가시키고 16에 도달하면 다시 돌아가서 HARQ process ID 값으로 0을 사용하고 다시 하나씩 증가시킨 ID 값을 부여할 수 있다. 이는 아래와 같이 기술 될 수 있다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 38, "content": "상기에서 extendedHARQprocesses 는 32개 HARQ process를 사용하도록 설정하기 위한 설정 파라미터일 수 있다. 또 한편, HARQ process 수를 설정해서 개의 HARQ process를 사용하도록 설정한 경우, 스케줄링하는 DCI에 서 지시된 HARQ process ID는 스케줄링 된 첫 번째 PUSCH에 사용하고, 만약 HARQ process를 개 사용하도 록 설정되면, 두 번째 PUSCH부터는 HARQ process ID 값을 하나씩 증가시키고 에 도달하면 다시 돌아가서 HARQ process ID 값으로 0을 사용하고 다시 하나씩 증가시킨 ID 값을 부여할 수 있다. 이는 아래와 같이 기술 될 수 있다."}
{"patent_id": "10-2021-0059426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 39, "content": "[제4 실시 예] - 앞서 설명한 내용들과 달리, 기지국이 K_offset 값을 MAC CE로 알려주는 방식도 적용이 가능할 것이다. 본 개시의 다양한 실시 예들에서, 단말이 서빙 셀이 위성 네트워크를 통해 제공되는 서빙 셀인지, 혹은 지상 네 트워크를 통해 제공되는 서빙 셀인지를 판단하는 방법은 다양한 형태로 구현될 수 있다. 일 예로, 상기 단말은 주파수, SIB, 또는 명백한 (explicit) 지시자에 따라 상기 서빙 셀이 위성 네트워크를 통해 제공되는 서빙 셀인 지 지상 네트워크를 통해 제공되는 서빙 셀인지를 식별할 수 있다. 일 예로, 위성 네트워크 송수신을 위해 필요한 파라미터들을 제공하는 SIB가 SIB-NTN 또는 SIB-xx라고 가정할 경우, 해당 서빙 셀에서 기지국으로부터 SIB-NTN 또는 SIB-xx가 제공되면, 상기 단말은 해당 서빙 셀이 위성 네 트워크로부터 제공되는 서빙 셀로 식별할 수 있을 것이다. 이와는 달리, 상기 해당 서빙 셀에서 상기 기지국으로부터 SIB-NTN 또는 SIB-xx가 제공되지 않을 경우, 상기 단말은 해당 서빙 셀이 지상 네트워크에서 제공되는 서빙 셀로 식별할 수 있을 것이다. 또 다른 예로는, 명백한 지시자로서 단말의 서빙 셀이 NTN 네트워크 (위성 네트워크)인지, 지상 네트워크인지 지시하는 파라미터가 SIB를 통해 전송될 수 있다. 여기서, 상기 서빙 셀이 NTN 네트워크인지, 지상 네트워크인 지 지시하는 파라미터는 일 예로 설정 개수의 비트들, 일 예로 1개의 비트로 구현될 수 있다. 여기서는, 상기 NTN 네트워크인지, 지상 네트워크인지 지시하는 파라미터가 1비트로 구현된다고 가정하기로 한다. 상기 기지국 은 상기 기지국 자신이 위성 네트워크를 통해 단말로 신호를 송신하거나, 또는 상기 단말로부터 신호를 수신하 면 상기 파라미터의 값을 일 예로 1로 설정하고, 상기 기지국이 위성 네트워크를 통하지 않고 지상 네트워크를 통해서 상기 단말과 신호를 송수신하는 경우에는 상기 파라미터의 값을 일 예로 0으로 설정할 수 있다. 그러면, 상기 단말은 상기 파라미터를 수신하고, 상기 파라미터의 값이 1이면 상기 서빙 셀이 위성 네트워크를 통해 제공되는 서빙 셀이라고 식별하고, 이와는 달리 상기 파라미터의 값이 0이면 상기 서빙 셀이 지상 네트워 크를 통해 제공되는 서빙 셀이라고 식별할 수 있다. 여기서, 상기 파라미터는 MIB 또는 SIB를 통해 전송되는 파 라미터일 수 있다. 또는, 상기 단말은 MIB, PBCH, 동기 신호, 혹은 SIB 중 적어도 하나를 수신하고, 상기 수신 한 MIB, PBCH, 동기 신호, 혹은 SIB 중 적어도 하나를 기반으로 상기 파라미터 값을 식별할 수 있을 것이다. 한편, 본 개시의 다양한 실시 예들에서, 위성을 통해 (위성 네트워크를 통해) 신호를 송수신한다고 함은, 단말 이 전송한 신호가 위성에 전달되고, 상기 신호가 위성에서 기지국으로 전달되는 것을 포함할 수 있으며, 상기 기지국이 전송한 신호가 위성에 전달되고, 상기 신호가 위성에서 단말로 전달되는 것을 포함할 수 있다. 한편, 상기에서는 설명의 편의를 위하여 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 HARQ process를 설정 및 지시하는 방법 및 장치를 다양한 예제들에 기반하여 설명하였으나, 이런 다양한 예제들은 서로 관련된 동작을 포함하고 있으므로 적어도 2개 이상의 예제들이 조합될 수도 있음은 물론이다. 또한, 각 예제에 따른 방 법은 서로 배타적인 관계가 아니며, 하나 이상의 방법들이 조합되어 수행되는 것도 가능함은 물론이다. 본 개시의 실시 예들을 수행하기 위한 기지국, 위성, 그리고 단말 각각은 송신단 혹은 수신단이 될 수 있으며, 상기 기지국, 위성, 그리고 단말 각각은 수신부, 처리부 및 송신부를 포함할 수 있으며, 상기 기지국, 위성, 단 말 각각은 본 개시의 실시 예들에 따라 동작한다. 그러면 여기서 도 36를 참조하여 본 개시의 다양한 실시 예들에 따른 단말의 내부 구조에 대해서 설명하기로 한 다. 도 36는 본 개시의 다양한 실시 예에 따른 단말의 내부 구조를 개략적으로 도시하고 있는 블록도이다. 도 36에서 도시되어 있는 바와 같이, 단말은 수신부, 송신부, 처리부를 포함할 수 있 다. 상기 수신부와 송신부를 통칭하여 본 개시의 실시 예들에서는 송수신부라 칭할 수 있다. 상기 송수신부는 기지국과 신호를 송수신할 수 있다. 여기서, 상기 신호는 제어 정보와, 데이터를 포함할 수 있다. 이를 위해, 상기 송수신부는 송신되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡음 증폭하고 주파수를 하강 변환하는 RF 수신기 등을 포함할 수 있다. 또한, 상기 송수신부는 무선 채널을 통해 신호를 수신하여 상기 처리부로 출력하고, 처리부로부터 출력된 신호를 무선 채널을 통해 전 송할 수 있다. 상기 처리부는 상술한 본 개시의 실시 들예에 따라 상기 단말이 동작할 수 있도록 일련의 과정을 제어할 수 있다. 상기 처리부는 일 예로 제1 실시 예에서 설명한 바와 같은 HARQ process 수를 설정하거나 ID 값을 지시하 는 것과 관련된 동작에 관련된 전반적인 동작을 제어할 수 있다. 예를 들어, 상기 수신부는 위성 또는 지 상 기지국으로부터 신호를 수신하고, 상기 처리부는 본 개시의 다양한 실시 예들에 따라 상기 기지국으로 신호를 송신하고, 또한 상기 기지국으로부터 신호를 수신하도록 제어할 수 있다. 또한, 상기 송신부는 결 정된 시점에서 결정된 신호를 송신할 수 있다. 다음으로 도 37를 참조하여 본 개시의 다양한 실시 예들에 따른 위성의 내부 구조에 대해서 설명하기로 한다. 도 37는 본 개시의 다양한 실시 예들에 따른 위성의 내부 구조를 개략적으로 도시하는 블록도이다. 도 37에서 도시되어 있는 바와 같이, 위성은 수신부, 송신부, 처리부를 포함할 수 있 다. 도 41에는 설명의 편의를 위해 수신부, 송신부, 처리부가 상기 수신부와, 송신부, 및 처리부 와 같이 단수의 형태로 구현된 경우가 도시되어 있으나, 상기 수신부, 송신부, 처리부는 다수로 구현될 수도 있음은 물론이다. 일 예로, 단말로부터 신호를 송수신하기 위한 수신부와 송신부, 그리고 기지국으로부터신호를 송수신하기 위한 수신부와 송신부 각각 (및 다른 위성과 신호를 송수신하기 위한 수신부와 송신부)으로 구성될 수 있다. 상기 수신부와 송신부를 통칭하여 본 개시의 실시 예들에서는 송수신부라 칭할 수 있다. 상기 송수 신부는 단말 그리고 기지국과 신호를 송수신할 수 있다. 상기 신호는 제어 정보와, 데이터를 포함할 수 있다. 이를 위해, 상기 송수신부는 송신되는 신호의 주파수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡음 증폭하고 주파수를 하강 변환하는 RF 수신기 등을 포함할 수 있다. 또한, 상기 송수신부는 무선 채널을 통해 신호를 수신하여 상기 처리부로 출력하고, 상기 처리부로부터 출력된 신호를 무선 채널을 통 해 전송할 수 있다. 상기 처리부는 주파수 오프셋 또는 Doppler shift를 보정하기 위한 보정기(compensator, pre- compensator)를 포함할 수 있으며, GPS 등으로부터 위치를 추적할 있는 장치를 포함할 수 있다. 또한, 상기 처 리부는 수신 신호의 중심 주파수를 이동시킬 수 있는 frequency shift 기능을 포함할 수 있을 것이다. 상 기 처리부는 본 개시의 다양한 실시 예들에 따라 위성, 기지국, 단말이 동작할 수 있도록 일련의 과정을 제어할 수 있다. 다음으로 도 38를 참조하여 본 개시의 다양한 실시 예들에 따른 기지국의 내부 구조에 대해서 설명하기로 한다. 도 38는 본 개시의 다양한 실시 예들에 따른 기지국의 내부 구조를 개략적으로 도시하는 블록도이다. 도 38에 도시되는 바와 같이, 기지국은 수신부, 송신부, 처리부를 포함할 수 있다. 상 기 기지국은 지상 기지국이거나 또는 위성의 일부분일 수 있다. 상기 수신부와 송신부를 통 칭하여 본 개시의 실시 예들에서는 송수신부라 칭할 수 있다. 상기 송수신부는 단말과 신호를 송수신할 수 있다. 상기 신호는 제어 정보와, 데이터를 포함할 수 있다. 이를 위해, 상기 송수신부는 송신되는 신호의 주파 수를 상승 변환 및 증폭하는 RF 송신기와, 수신되는 신호를 저 잡음 증폭하고 주파수를 하강 변환하는 RF 수신 기 등을 포함할 수 있다. 또한, 상기 송수신부는 무선 채널을 통해 신호를 수신하여 상기 처리부로 출력 하고, 상기 처리부로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 다음으로 도 39을 참조하여 본 개시의 실시 예들에 따른 기지국의 구조에 대해서 설명하기로 한다. 도 39은 본 개시의 실시 예들에 따른 예제 기지국의 구조를 개략적으로 도시한 도면이다. 도 39에 도시되어 있 는 기지국의 실시 예는 오직 예시만을 위한 것이며, 따라서 도 39는 본 개시의 범위를 기지국의 임의의 특정한 구현으로 제한하지는 않는다. 도 39에 도시되어 있는 바와 같이, 기지국은 다수의 안테나들(4305a-4305n)과, 다수의 RF 송수신기들 (4310a-4310n)과, 송신(transmit: TX) 프로세싱 회로, 및 수신(receive: RX) 프로세싱 회로를 포 함한다. 상기 기지국은 또한 제어기/프로세서와, 메모리, 및 백홀(backhaul) 혹은 네트워크 인터페 이스를 포함한다. 상기 RF 송수신기들(4310a-4310n)은 상기 안테나들(4305a-4305n)로부터 네트워크에서 단말들에 의해 송신된 신 호들과 같은, 입력되는 RF 신호들 수신한다. 상기 RF 송수신기들(4310a-4310n)은 상기 입력되는 RF 신호들을 다 운 컨버트(down-convert)하여 IF 혹은 기저대역 신호들로 생성한다. 상기 IF 혹은 기저 대역 신호들은 상기 RX 프로세싱 회로로 송신되고, 상기 RX 프로세싱 회로는 상기 기저대역 혹은 IF 신호들을 필터링, 디 코딩, 및/혹은 디지털화하여 프로세싱된 기저대역 신호들을 생성한다. 상기 RX 프로세싱 회로는 추가적인 프로세싱을 위해 상기 프로세싱된 기저대역 신호들을 상기 제어기/프로세서로 송신한다. 상기 TX 프로세싱 회로는 상기 제어기/프로세서로부터 (음성 데이터, 웹 데이터, 이메일, 혹은 양 방향 비디오 게임 데이터(interactive video game data)와 같은) 아날로그 혹은 디지털 데이터를 수신한다. 상 기 TX 프로세싱 회로는 상기 출력되는 기저 대역 데이터를 인코딩, 다중화 및/혹은 디지털화하여 프로세 싱된 기저대역 혹은 IF 신호들을 생성한다. 상기 RF 송수신기들(4310a-4310n)은 상기 TX 프로세싱 회로로 부터 상기 출력되는 프로세싱된 기저대역 혹은 IF 신호들을 수신하고, 상기 기저대역 혹은 IF 신호들을 상기 안 테나들(4305a-4305n)을 통해 송신되는 RF 신호들로 업 컨버팅한다. 상기 제어기/프로세서는 상기 기지국의 전반적인 동작을 제어하는 하나 혹은 그 이상의 프로세서들 혹은 다른 프로세싱 디바이스들을 포함할 수 있다. 일 예로, 상기 제어기/프로세서는 잘 알려져 있는 원칙들에 따라 상기 RF 송수신기들(4310a-4310n), 상기 RX 프로세싱 회로 및 상기 TX 프로세싱 회로에 의한 순방향 채널 신호들의 수신 및 역방향 채널 신호들의 송신을 제어할 수 있다. 상기 제어기/프로세서는 보다 진보된 무선 통신 기능들과 같은 추가적인 기능들을 지원할 수 있다. 본 개시의 다양한 실시 예들에서, 상기 제어기/프로세서는 일 예로 제1 실시 예에서 설명한 바와 같은 TA 를 기반으로 하는 상향링크 타이밍 조정 동작에 관련된 전반적인 동작을 제어할 수 있다. 본 개시의 다양한 실 시 예들에서, 상기 제어기/프로세서는 일 예로 제2 실시 예에서 설명한 바와 같은 단말이 TA를 업데이트 하는 동작에 관련된 전반적인 동작을 제어할 수 있다. 또한, 상기 제어기/프로세서는 다수의 안테나들(4305a-4305n)로부터의 출력되는 신호들이 원하는 방향에 서 상기 출력되는 신호들을 효율적으로 스티어링하기 위해 다르게 가중되는 빔 포밍 혹은 지향성 라우팅 동작들 을 지원할 수 있다. 다양한 다른 기능들 중 어느 하나는 상기 기지국에서 상기 제어기/프로세서에 의해 지원될 수 있다. 상기 제어기/프로세서는 또한 OS와 같은, 상기 메모리에 상주하는 프로그램들 및 다른 프로세스들 을 실행할 수 있다. 상기 제어기/프로세서는 실행중인 프로세스에 의해 필요로 되는 바와 같은 데이터를 상기 메모리로 혹은 상기 메모리의 외부로 이동시킬 수 있다. 상기 제어기/프로세서는 또한 상기 백홀 혹은 네트워크 인터페이스와 연결된다. 상기 백홀 혹은 네 트워크 인터페이스는 상기 기지국이 백홀 연결을 통해 혹은 네트워크를 통해 다른 디바이스들 혹은 시스 템들과 통신하는 것을 허락한다. 상기 인터페이스는 임의의 적합한 유선 혹은 무선 연결(들)을 통해 통신 들을 지원할 수 있다. 일 예로, 상기 기지국이 (5G, LTE, 혹은 LTE-A를 지원하는 셀룰라 통신 시스템과 같은) 셀룰라 통신 시스템의 일부로 구현될 때, 상기 인터페이스는 상기 기지국이 유선 혹은 무선 백홀 연결을 통해 다른 기지국들과 통신하는 것을 허락할 수 있다. 상기 기지국이 억세스 포인트로서 구현될 때, 상기 인터 페이스는 상기 기지국이 유선 혹은 무선 근거리 통신 네트워크(local area network)를 통해 혹은 유선 혹 은 무선 연결을 통해 (상기 인터넷과 같은) 더 큰 네트워크로 통신하는 것을 허락할 수 있다. 상기 인터페이스 는 이더넷(Ethernet) 혹은 RF 송수신기와 같은 유선 혹은 무선 연결을 통해 통신들을 지원하는 적합한 구 조를 포함한다. 상기 메모리는 상기 제어기/프로세서에 연결된다. 상기 메모리의 일부는 RAM을 포함할 수 있 고, 상기 메모리의 다른 일부는 플래쉬 메모리 혹은 다른 ROM을 포함할 수 있다. 도 39가 기지국의 일 예를 도시하고 있을 지라도, 다양한 변경들이 도 39에 대해서 이루어질 수 있다. 일 예로, 상기 기지국은 도 39에 도시되어 있는 임의의 개수의 각 컴포넌트를 포함할 수 있다. 특정한 예로서, 억세스 포 인트는 다수의 인터페이스들을 포함할 수 있고, 상기 제어기/프로세서는 다른 네트워크 어드레스들 간에 데이터를 라우팅하는 라우팅 기능들을 지원할 수 있다. 또 다른 특정한 예로서, TX 프로세싱 회로의 단일 인스턴스(instance)와 RX 프로세싱 회로의 단일 인스턴스를 포함하는 것과 같이 도시되어 있는 반면 에, 상기 기지국은 각각(RF 송수신기 별로 1개와 같은)의 다수의 인스턴스들을 포함할 수 있다. 또한, 도 39에 서 다양한 컴포넌트들은 조합될 수 있거나, 혹은 추가적으로 다시 분할될 수 있거나, 혹은 생략될 수 있으며, 추가적인 컴포넌트들이 특별한 필요들에 따라 추가될 수 있다. 다음으로 도 40를 참조하여 본 개시의 실시 예들에 따른 단말의 구조에 대해서 설명하기로 한다. 도 40는 본 개시의 실시 예들에 따른 예제 단말의 구조를 개략적으로 도시하고 있는 도면이다. 도 40에 도시되어 있는 단말의 실시 예는 오직 예시만을 위한 것이며, 따라서 도 40은 본 개시의 범위를 단말의 임의의 특정한 구현으로 제한하지는 않는다. 도 40에 도시되어 있는 바와 같이, 단말은 안테나, 무선 주파수(radio frequency: RF) 송수신기 , TX 프로세싱 회로, 마이크로폰(microphone) 및 수신(receive: RX) 프로세싱 회로를 포함한다. 상기 단말은 또한 스피커, 프로세서, 입/출력(input/output: I/O) 인터페이스 (interface: IF), 터치 스크린, 디스플레이(display) 및 메모리를 포함한다. 상기 메 모리는 운영 시스템(operating system: OS) 및 하나 혹은 그 이상의 어플리케이션(application)들 을 포함한다. 상기 RF 송수신기는 상기 안테나로부터 네트워크의 기지국에 의해 송신된, 입력되는 RF 신호를 수 신한다. 상기 RF 송수신기는 상기 입력되는 RF 신호를 다운 컨버팅하여 중간 주파수(intermediate frequency: IF) 혹은 기저대역 신호로 생성한다. 상기 IF 혹은 기저 대역 신호는 상기 RX 프로세싱 회로 로 송신되고, 상기 RX 프로세싱 회로는 상기 기저대역 혹은 IF 신호를 필터링, 디코딩, 및/혹은 디지털화하여 프로세싱된 기저대역 신호를 생성한다. 상기 RX 프로세싱 회로는 추가적인 프로세싱을 위해 상기 프 로세싱된 기저대역 신호를 상기 스피커로(음성 데이터를 위해서와 같이) 혹은 상기 프로세서(웹 브 라우징 데이터(web browsing data)를 위해서와 같이)로 송신한다. 상기 TX 프로세싱 회로는 상기 마이크로폰으로부터 아날로그 혹은 디지털 음성 데이터를 수신하거 나, 혹은 상기 프로세서로부터 다른 출력 기저 대역 데이터(웹 데이터, 이메일, 혹은 양방향 비디오 게임 데이터(interactive video game data)와 같은)를 수신한다. 상기 TX 프로세싱 회로는 상기 출력 기저 대 역 데이터를 인코딩, 다중화 및/혹은 디지털화하여 프로세싱된 기저대역 혹은 IF 신호로 생성한다. 상기 RF 송 수신기는 상기 TX 프로세싱 회로로부터 상기 출력되는 프로세싱된 기저대역 혹은 IF 신호를 수신하 고, 상기 기저대역 혹은 IF 신호를 상기 안테나를 통해 송신되는 RF 신호로 업 컨버트(up-convert)한다. 상기 프로세서는 하나 혹은 그 이상의 프로세서들 혹은 다른 프로세싱 디바이스들을 포함할 수 있으며, 상기 단말의 전반적인 동작을 제어하기 위해 상기 메모리에 저장되어 있는 상기 OS을 실행할 수 있 다. 일 예로, 상기 프로세서는 공지의 원칙들에 따라 상기 RF 송수신기, 상기 RX 프로세싱 회로 및 상기 TX 프로세싱 회로에 의한 다운링크 채널 신호들의 수신 및 업링크 채널 신호들의 송신을 제어할 수 있다. 몇몇 실시 예들에서, 상기 프로세서는 적어도 하나의 마이크로 프로세서 혹은 마이크로 제어기를 포함한다. 본 개시의 다양한 실시 예들에서, 상기 프로세서는 일 예로 제1 실시 예에서 설명한 바와 같은 HARQ process 수를 설정하거나 지시하고 HARQ process ID를 지시하는 동작에 관련된 전반적인 동작을 제어할 수 있다. 상기 프로세서는 또한 상기 메모리에 내재되어 있는 다른 프로세스들 및 프로그램들을 실행할 수 있다. 상기 프로세서는 데이터를 실행중인 프로세스에 의해 요구될 경우 상기 메모리 내로 혹은 상 기 메모리로부터 이동시킬 수 있다. 몇몇 실시 예들에서, 상기 프로세서는 상기 OS 프로그램(446 1)을 기반으로 혹은 기지국들 혹은 운영자로부터 수신되는 신호들에 응답하여 상기 어플리케이션들을 실 행하도록 구성된다. 또한, 상기 프로세서는 상기 I/O 인터페이스에 연결되고, 상기 I/O 인터페이스 는 상기 단말에게 랩탑 컴퓨터들 및 핸드헬드(handheld) 컴퓨터들과 같은 다른 디바이스들에 대한 연결 능력을 제공한다. 상기 I/O 인터페이스는 이런 악세사리들과 상기 프로세서간의 통신 경로이다. 상기 프로세서는 또한 상기 터치 스크린 및 상기 디스플레이 유닛에 연결된다. 상기 단말의 운영자는 상기 터치 스크린을 사용하여 상기 단말에 데이터를 입력할 수 있다. 상기 디스플레이는 웹 사이트(web site)들로부터와 같은 텍스트 및/혹은 적어도 제한된 그래픽들을 렌더링(rendering)할 수 있는 액정 크리스탈 디스플레이, 발광 다이오드 디스플레이, 혹은 다른 디스플레이가 될 수 있다. 상기 메모리는 상기 프로세서에 연결된다. 상기 메모리의 일부는 랜덤 억세스 메모리(random access memory: RAM)를 포함할 수 있으며, 상기 메모리의 나머지 부분은 플래시 메모리 혹은 다른 리드 온니 메모리(read-only memory: ROM)를 포함할 수 있다. 도 40이 단말의 일 예를 도시하고 있다고 할지라도, 다양한 변경들이 도 40에 대해서 이루어질 수 있다. 일 예 로, 도 40에서의 다양한 컴포넌트들은 조합되거나, 더 추가 분할 되거나, 혹은 생략될 수 있으며, 다른 컴포넌 트들이 특별한 필요들에 따라서 추가될 수 있다. 또한, 특별한 예로서, 상기 프로세서는 하나 혹은 그 이 상의 중앙 프로세싱 유닛(central processing unit: CPU)들 및 하나 혹은 그 이상의 그래픽 프로세싱 유닛 (graphics processing unit: GPU)들과 같은 다수의 프로세서들로 분할될 수 있다. 또한, 도 40에서는 상기 단 말이 이동 전화기 혹은 스마트 폰과 같이 구성되어 있다고 할지라도, 단말은 다른 타입들의 이동 혹은 고정 디 바이스들로서 동작하도록 구성될 수 있다. 한편, 본 명세서와 도면에 개시된 본 개시의 실시 예들은 본 개시의 기술 내용을 쉽게 설명하고 본 개시의 이해 를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 개시의 범위를 한정하고자 하는 것은 아니다. 즉, 본 개시의 기술적 사상에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자에게 자명한 것이다. 또한, 각각의 실시예는 필요에 따라 서로 조합되어 운용될 수 있다. 예를 들어 제1 실시 예와 제2 실시 예가 결합되어 적용되는 것이 가능할 것이다. 또한, 본 개시의 실시 예들은 LTE 시스템, 5G 시스템 등에 상기 실시 예들의 기술적 사상에 바탕을 둔 다른 변형 예들로 실시 가능할 것이다. 본 개시가 예제 실시 예를 참조하여 설명되었다고 할지라도, 다양한 변경들 및 수정들이 해당 기술 분야의 당업 자에게 제안될 수 있다. 본 개시는 첨부되는 청구항들의 범위 내에 존재하는 변경들 및 수정들을 포함하는 의도를 가진다. 이 출원의 상세한 설명 중 어느 것도 어떤 특정한 엘리먼트, 과정, 혹은 기능이 청구항들 범위에 포 함되어야만 하는 필수적인 엘리먼트라고 의미하는 것으로 읽혀져서는 안될 것이다. 특허되는 주제의 범위는 청 구항들에 의해서 정의된다."}
{"patent_id": "10-2021-0059426", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 NR 시스템에서 하향링크 혹은 상향링크에서 상기 데이터 혹은 제어채널이 전송되는 무선자원영역인 시간 -주파수영역의 기본 구조를 나타낸 도면이다. 도 2는 5G 무선통신 시스템에서 하향링크 제어채널이 전송되는 제어영역을 도시한 도면이다. 도 3은 전체 시스템 주파수 대역에 eMBB, URLLC 및 mMTC 데이터가 할당된 일례를 도시한 도면이다. 도 4는 시스템 주파수 대역을 나눠 eMBB, URLLC 및 mMTC 데이터가 할당된 일례를 도시한 도면이다. 도 5는 하나의 트랜스포트 블록이 여러 개의 코드 블록으로 나뉘고 CRC가 추가되는 과정의 일례를 도시한 도면 이다. 도 6은 NR 시스템의 동기화 신호 (SS) 및 물리방송채널 (PBCH)이 주파수 및 시간 영역에서의 매핑된 모습을 도 시한 도면이다. 도 7은 부반송파 간격에 따라 SS/PBCH 블록이 전송될 수 있는 심볼을 도시한 도면이다. 도 8은 개시된 일 실시예에 따른 5G 또는 NR 시스템에서 단말이 제 1 신호를 수신하고, 이에 대한 제 2 신호를 단말이 송신할 때, 타이밍 어드밴스에 따른 단말의 프로세싱 타임을 도시한 도면이다. 도 9는 슬롯에 따라 데이터(일례로 TB)들을 스케줄링하여 전송하고, 해당 데이터에 대한 HARQ-ACK 피드백을 수 신하고, 피드백에 따라 재전송을 수행하는 일례를 도시한 도면이다. 도 10은 위성을 이용한 통신 시스템의 일례를 도시한 도면이다. 도 11은 위성의 고도 또는 높이에 따른 통신 위성의 지구 공전 주기를 도시한 도면이다. 도 12는 위성-단말 직접통신의 개념도를 도시한 도면이다. 도 13은 위성-단말 직접통신의 활용 시나리오를 도시한 도면이다. 도 14는 고도 1200 km의 LEO 위성과 지상의 단말이 직접 통신을 수행 할 때, 상향링크에서의 예상 데이터 전송 률(throughput) 계산의 일례를 도시한 도면이다. 도 15는 고도 35,786 km의 GEO 위성과 지상의 단말이 직접 통신을 수행 할 때, 상향링크에서의 예상 데이터 전 송률(throughput) 계산의 일례를 도시한 도면이다. 도 16은 단말과 위성간의 경로손실 모델에 따른 경로손실 값, 그리고 단말과 지상망통신 기지국간의 경로손실 모델에 따른 경로손실을 도시한 도면이다. 도 17은 위성의 고도 및 위치, 그리고 지상의 단말 사용자의 위치에 따라 위성에서부터 전달되는 신호가 지상 사용자에게 수신되었을 때 상기 신호가 겪는 Doppler shift의 양을 계산하는 수식 및 결과를 도시한 도면이다. 도 18은 위성의 고도에서 계산된 위성의 속도를 도시한 도면이다. 도 19는 위성이 지상으로 전송하는 하나의 빔 안에 있는 서로 다른 단말들이 겪는 Doppler shift를 도시한 도면 이다. 도 20은 고도각으로부터 정해지는 위성의 위치에 따라, 빔 하나 내에서 발생하는 Doppler shift의 차이를 도시 한 도면이다. 도 21은 고도각에 따라 정해지는 위성의 위치에 따라 단말에서부터 위성까지 걸리는 지연시간과, 단말-위성-기 지국 사이의 왕복 지연시간을 도시한 도면이다. 도 22는 하나의 빔 내에서 사용자의 위치에 따라 달라지는 왕복 지연시간의 최대 차이 값을 도시한 도면이다. 도 23은 RAR(random access response)의 정보 구조의 일례를 도시한 도면이다.도 24는 LTE 시스템의 PRACH 프리앰블 설정 자원과 RAR 수신 시점의 관계의 일례를 도시한 도면이다. 도 25는 5G NR 시스템의 PRACH 프리앰블 설정 자원과 RAR 수신 시점의 관계의 일례를 도시한 도면이다. 도 26은 단말에 있어서의 하향링크 프레임과 상향링크 프레임 시점(timing)에 대한 일례를 도시한 도면이다. 도 27a는 위성이 지구 주위를 위성 궤도(satellite orbit)을 따라 공전함에 따라, 지구의 지상 또는 지구상에 위치한 단말에 있어서 위성의 지속적인 움직임의 일례를 도시한 도면이다. 도 27b는 인공위성의 구조의 일례를 도시한 도면이다. 도 28은 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 하향링크에서 MAC 계층에서 물리 계층으로 전달되 는 메시지의 일 예를 개략적으로 도시한 도면이다. 도 29는 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 상향링크에서 MAC 계층에서 물리 계층으로 전달되 는 메시지의 일 예를 개략적으로 도시한 도면이다. 도 30은 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 RAR의 MAC 페이로드 또는 MsgB의 MAC 페이로드의 포맷의 일 예를 계략적으로 도시한 도면이다. 도 31은 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 단말이 TA 값을 직접 계산할 경우의 상향링크 전 송 동작을 개략적으로 도시한 도면이다. 도 32는 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 지상 네트워크와 위성 네트워크에서의 전파 지연 시간의 차이의 일 예를 개략적으로 도시한 도면이다. 도 33은 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 지상 네트워크와 위성 네트워크에서 TA를 적용하 는 일 예를 개략적으로 도시한 도면이다. 도 34는 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 위성이 지원하는 하나의 빔 내에 다수의 단말들이 위치할 경우의 최대 왕복 지연 시간 차이의 일 예를 개략적으로 도시한 도면이다. 도 35는 본 개시의 다양한 실시 예들에 따른 통신 시스템에서 위성의 이동에 따라 변화되는 단말-기지국 간의 무선 왕복 지연 시간의 일 예를 개략적으로 도시한 도면이다. 도 36은 본 개시의 다양한 실시 예들에 따른 단말의 내부 구조를 개략적으로 도시하고 있는 블록도이다. 도 37은 본 개시의 다양한 실시 예들에 따른 위성의 내부 구조를 개략적으로 도시하고 있는 블록도이다. 도 38는 본 개시의 다양한 실시 예들에 따른 기지국의 내부 구조를 개략적으로 도시하고 있는 블록도이다. 도 39은 본 개시의 실시 예들에 따른 예제 기지국의 구조를 개략적으로 도시한 도면이다. 도 40는 본 개시의 실시 예들에 따른 예제 단말의 구조를 개략적으로 도시하고 있는 도면이다."}
