{"patent_id": "10-2023-0129910", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0046461", "출원번호": "10-2023-0129910", "발명의 명칭": "엣지 컴퓨팅 장치에서 비지도 학습 방법으로 압축된 진동 데이터를 활용한 결함 탐지 및 결함", "출원인": "한국전자기술연구원", "발명자": "최종현"}}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모터가 사용되는 설비에 부착된 진동 센서를 이용하여 진동 데이터를 수집하는 단계;수집된 진동 데이터에서 주요 데이터를 추출하는 단계;추출된 주요 데이터를 오토인코더 모델의 인코더로 압축하는 단계;압축된 주요 데이터를 저장하는 단계;저장된 주요 데이터를 오토인코더 모델의 디코더로 복원하는 단계;복원된 주요 데이터를 기초로, 설비의 결함을 탐지하는 단계;를 포함하는 것을 특징으로 하는 설비 결함 진단방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,추출 단계는,수집된 진동 데이터를 FFT하여 주파수 영역으로 변환하는 단계;주파수 영역으로 변환된 진동 데이터에 대해 PCA(Principle Component Analysis) 기법을 통해 주성분들로 분해하는 단계;분해된 주성분들 중 일부의 주성분들만 보존하는 단계;를 포함하는 것을 특징으로 하는 설비 결함 진단 방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,보존 단계는,설명된 분산 비율(explained variance ratio)이 정해진 비율을 초과하는 주성분들만을 보존하는 것을 특징으로하는 설비 결함 진단 방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,설명된 분산 비율은,압축된 주요 데이터에 대한 오토인코더 모델에 대한 latent space에서의 군집화도를 기초로 결정되는 것을 특징으로 하는 설비 결함 진단 방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,오토인코더 모델은,공개특허 10-2025-0046461-3-정상의 진동 데이터들로 비지도 학습된 것을 특징으로 하는 설비 결함 진단 방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,탐지 단계는,추출된 주요 데이터와 복원된 주요 데이터 간의 차이가 제1 임계값을 초과하면 설비에 결함이 발생한 것으로 판단하고, 차이가 제1 임계값 이하이면 설비에 결함이 발생하지 않은 것으로 판단하는 것을 특징으로 하는 설비결함 진단 방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,차이는,MSE(Mean Square Error)인 것을 특징으로 하는 설비 결함 진단 방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,차이의 크기를 기초로, 결함 심각도를 측정하는 단계;를 더 포함하는 것을 특징으로 하는 설비 결함 진단 방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 6에 있어서,결함 발생 여부 및 결함 심각도를 시각화하는 단계;를 더 포함하는 것을 특징으로 하는 설비 결함 진단 방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "모터가 사용되는 설비에 부착되어 진동을 측정하여 진동 데이터를 생성하는 진동 센서; 및진동 센서에서 생성된 진동 데이터에서 주요 데이터를 추출하고, 추출된 주요 데이터를 오토인코더 모델의 인코더로 압축하며, 압축된 주요 데이터를 오토인코더 모델의 디코더로 복원하고, 복원된 주요 데이터를 기초로 설비의 결함을 탐지하는 진단부;를 포함하는 것을 특징으로 하는 설비 결함 탐지 시스템."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "모터가 사용되는 설비에 부착된 진동 센서를 이용하여 수집된 진동 데이터에서 주요 데이터를 추출하는 단계;추출된 주요 데이터를 오토인코더 모델의 인코더로 압축하는 단계;압축된 주요 데이터를 오토인코더 모델의 디코더로 복원하는 단계;복원된 주요 데이터를 기초로, 설비의 결함을 탐지하는 단계;를 포함하는 것을 특징으로 하는 설비 결함 탐지방법."}
{"patent_id": "10-2023-0129910", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2025-0046461-4-모터가 사용되는 설비에 부착된 진동 센서를 이용하여 수집된 진동 데이터에서 주요 데이터를 추출하고, 추출된주요 데이터를 오토인코더 모델의 인코더로 압축하며, 압축된 주요 데이터를 오토인코더 모델의 디코더로 복원하고, 복원된 주요 데이터를 기초로 설비의 결함을 탐지하는 프로세서; 및프로세서에 필요한 저장공간을 제공하는 저장부;를 포함하는 것을 특징으로 하는 설비 결함 탐지 시스템."}
{"patent_id": "10-2023-0129910", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "엣지 컴퓨팅 장치에서 비지도 학습 방법으로 압축된 진동 데이터를 활용한 결함 탐지 및 결함 심각도 측정 방법 및 시스템이 제공된다. 본 발명의 실시예에 따른 설비 결함 진단 방법은, 모터가 사용되는 설비에 부착된 진동 센서를 이용하여 수집된 진동 데이터에서 주요 데이터를 추출하고, 추출된 주요 데이터를 오토인코더 모델의 인 코더로 압축한 다음, 압축된 주요 데이터를 오토인코더 모델의 디코더로 복원하여 설비의 결함을 탐지한다. 이에 의해, 진동 데이터를 압축하여 처리함으로써 엣지 컴퓨팅 환경에서도 회전 설비에 대한 결함 진단 및 결함 심각 도 측정이 빠른 속도로 가능하고, 수집이 어려운 고장 데이터를 학습 데이터로 확보하지 않아도 인공지능 기반 회전 설비의 결함 진단이 가능해진다."}
{"patent_id": "10-2023-0129910", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 회전 설비의 예지 보전에 관한 것으로, 더욱 상세하게는 회전 설비에 진동 센서를 설치하여 취득한 진동 데이터를 엣지 컴퓨팅 장치에서 데이터 압축한 후 결함을 탐지하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0129910", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "오늘날 스마트팩토리에 대한 수요가 증가함에 따라 공장 내의 산업용 설비를 유지 보수하기 위해 다양한 센서 설치가 이루어져 왔으며, 설치된 센서로부터 수집된 데이터를 기반으로 산업용 설비에 대한 유지 보수 기술 개 발의 요구가 증대되어 왔다. 대부분의 산업용 설비는 모터를 기반으로 회전, 반복 운동을 수행한다. 반복 운동 과정에서 일부 부품은 마모, 파손이 발생하여 점차 진동, 소음이 발생하게 되고 제품의 품질 문제가 발생하고, 심할 경우에는 전체적인 설비 의 고장이 발생한다. 이러한 제품 품질 저하 문제를 해결하기 위해 설비의 각 장치에 센서를 설치하여 데이터를 수집하고 있다. 하지 만 센서에서 생성되는 대용량 데이터를 압축 없이 처리하게 된다면, 데이터 분석에 많은 시간이 걸리고, 메인 서버와 송/수신 과정에서 네트워크 대역폭 낭비가 발생한다. 이에 엣지 디바이스에서 효과적으로 처리하고, 필 요한 대역폭을 줄일 수 있는 데이터 압축 기술이 필요하다. 최근 다양한 인공지능 기반 분석 기술이 제안되고 있지만, 대부분 정상/고장 양쪽의 많은 양의 데이터가 필요한 기술이다. 설비 고장이 빈번하게 발생하지 않아 설비 고장 데이터 수집이 어렵다는 점에 문제점이 있다."}
{"patent_id": "10-2023-0129910", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로서, 본 발명의 목적은, 스마트팩토리에서 산업 용 설비 유지 보수 지원을 위한 방안으로, 엣지 컴퓨팅 환경에서 진동 데이터를 압축하고, 압축된 진동 데이터 를 활용하여 회전 설비의 결함을 진단하고 결함 심각도를 측정하는 방법을 제공함에 있다."}
{"patent_id": "10-2023-0129910", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 설비 결함 진단 방법은 모터가 사용되는 설비에 부착된 진동 센서를 이용하여 진동 데이터를 수집하는 단계; 수집된 진동 데이터에서 주요 데이터를 추출하는 단계; 추 출된 주요 데이터를 오토인코더 모델의 인코더로 압축하는 단계; 압축된 주요 데이터를 저장하는 단계; 저장된 주요 데이터를 오토인코더 모델의 디코더로 복원하는 단계; 복원된 주요 데이터를 기초로, 설비의 결함을 탐지 하는 단계;를 포함한다. 추출 단계는, 수집된 진동 데이터를 FFT하여 주파수 영역으로 변환하는 단계; 주파수 영역으로 변환된 진동 데 이터에 대해 PCA(Principle Component Analysis) 기법을 통해 주성분들로 분해하는 단계; 분해된 주성분들 중 일부의 주성분들만 보존하는 단계;를 포함할 수 있다. 보존 단계는, 설명된 분산 비율(explained variance ratio)이 정해진 비율을 초과하는 주성분들만을 보존할 수 있다. 설명된 분산 비율은, 압축된 주요 데이터에 대한 오토인코더 모델에 대한 latent space에서의 군집화도를 기초 로 결정될 수 있다. 오토인코더 모델은, 정상의 진동 데이터들로 비지도 학습된 것일 수 있다. 탐지 단계는, 추출된 주요 데이터와 복원된 주요 데이터 간의 차이가 제1 임계값을 초과하면 설비에 결함이 발 생한 것으로 판단하고, 차이가 제1 임계값 이하이면 설비에 결함이 발생하지 않은 것으로 판단하는 것일 수 있 다. 차이는, MSE(Mean Square Error)일 수 있다. 본 발명에 따른 설비 결함 진단 방법은 차이의 크기를 기초로, 결함 심각도를 측정하는 단계;를 더 포함할 수 있다. 본 발명에 따른 설비 결함 진단 방법은 결함 발생 여부 및 결함 심각도를 시각화하는 단계;를 더 포함할 수 있 다. 본 발명의 다른 측면에 따르면, 모터가 사용되는 설비에 부착되어 진동을 측정하여 진동 데이터를 생성하는 진 동 센서; 및 진동 센서에서 생성된 진동 데이터에서 주요 데이터를 추출하고, 추출된 주요 데이터를 오토인코더 모델의 인코더로 압축하며, 압축된 주요 데이터를 오토인코더 모델의 디코더로 복원하고, 복원된 주요 데이터를 기초로 설비의 결함을 탐지하는 진단부;를 포함하는 것을 특징으로 하는 설비 결함 탐지 시스템이 제공된다. 본 발명의 또다른 측면에 따르면, 모터가 사용되는 설비에 부착된 진동 센서를 이용하여 수집된 진동 데이터에 서 주요 데이터를 추출하는 단계; 추출된 주요 데이터를 오토인코더 모델의 인코더로 압축하는 단계; 압축된 주 요 데이터를 오토인코더 모델의 디코더로 복원하는 단계; 복원된 주요 데이터를 기초로, 설비의 결함을 탐지하 는 단계;를 포함하는 것을 특징으로 하는 설비 결함 탐지 방법이 제공된다. 본 발명의 또다른 측면에 따르면, 모터가 사용되는 설비에 부착된 진동 센서를 이용하여 수집된 진동 데이터에 서 주요 데이터를 추출하고, 추출된 주요 데이터를 오토인코더 모델의 인코더로 압축하며, 압축된 주요 데이터 를 오토인코더 모델의 디코더로 복원하고, 복원된 주요 데이터를 기초로 설비의 결함을 탐지하는 프로세서; 및 프로세서에 필요한 저장공간을 제공하는 저장부;를 포함하는 것을 특징으로 하는 설비 결함 탐지 시스템이 제공 된다."}
{"patent_id": "10-2023-0129910", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상 설명한 바와 같이, 본 발명의 실시예들에 따르면, PCA와 오토인코더 모델을 활용하여 진동 데이터를 압축 하여 처리함으로써, 엣지 컴퓨팅 환경에서도 회전 설비에 대한 결함 진단 및 결함 심각도 측정이 빠른 속도로 가능하도록 하였다. 또한 본 발명의 실시예들에 따르면, 정상 데이터만을 사용해 결함 여부/심각도를 판단할 수 있는 오토인코더 모 델을 학습시켜 회전 설비를 진단함으로써, 수집이 어려운 고장 데이터를 학습 데이터로 확보하지 않아도 인공지 능 기반 회전 설비의 결함 진단이 가능해진다."}
{"patent_id": "10-2023-0129910", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명을 보다 상세하게 설명한다. 본 발명의 실시예에서는 엣지 컴퓨팅 장치에서 진동 데이터를 활용한 회전 설비의 결함 진단 방법 및 시스템을 제시한다. 회전 설비에 진동 센서를 설치하여 취득한 진동 데이터를 엣지 컴퓨팅 장치에서 압축한 후 압축된 데 이터를 이용하여 회전 설비의 결함을 탐지하고 결함 심각도를 측정하는 기술이다. 본 발명의 실시예에서는 리소스가 충분하지 못한 엣지 컴퓨팅 환경에서 방대한 진동 데이터 처리가 가능하도록 신뢰성 있는 데이터 압축으로, 비지도 학습 기법인 PCA(Principle Component Analysis) 기법과 오토인코더의 인 코딩 기법을 이용한다. 또한 고장 데이터를 학습 데이터로 확보하기 어려운 제조 현장의 실상을 감안하여, 고장 데이터 없이 정상 데이 터만을 사용해 결함 여부/심각도를 판단할 수 있는 오토인코더 모델을 학습시켜 회전 설비를 진단한다. 진동 센서는 모터가 사용되는 회전 설비에서 결함이 예측되는 부품(이를 테면, 베어링 등)의 근처에 설치되어, 진동 데이터를 실시간 또는 주기적으로 수집한다. 회전 설비의 결함은 주파수 영역의 진동 데이터에서 두드러지게 나타나는데 결함에 따라 특정 주파수 성분이 강 조되는 경향이 있다. 즉 도 2에 제시된 결함이 발생한 회전 설비의 진동 데이터의 주요 주파수 성분은, 도 1에 제시된 정상 회전 설비의 진동 데이터의 주요 주파수 성분과 차이가 있다. 또한 모든 주파수 데이터를 그대로 유지하면 많은 저장 공간과 계산 비용이 필요한데, 이는 엣지 컴퓨팅 환경에 부적절하다. 이에 본 발명의 실시예에서는 PCA 기법을 사용하여 진동 데이터의 주요 변동성을 추출하고 주요 데이터를 보존 하는데 집중한다. PCA 기법는 데이터를 주성분으로 분해하여 각 주성분이 데이터의 변동성을 가장 잘 설명하도 록 하는 기법이다. 이를 통해 주요한 주파수 성분을 식별하고 더 작은 개수의 주성분만으로도 데이터의 대부분 변동성을 잘 표현할 수 있다. PCA 기법은 주파수 영역의 진동 데이터를 더 낮은 차원으로 표현함으로써 데이터의 압축을 가능하게 한다. 주성 분이 데이터의 분산을 얼마나 잘 나타내는지 설명하는 값인 설명된 분산(explained variance)을 활용하여, 설명 된 분산 비율(explained variance ratio)이 각각 90% 또는 95%인 주성분들을 활용하여 압축하는 것이 가능하다. 예를 들어, 주파수 범위가 0~10000Hz인 진동 센서로 측정하여, 1Hz마다 1개의 주파수 성분을 뽑는 경우, 10000 개의 주파수 성분이 생긴다. 이 데이터를 각각 설명된 분산 비율이 90% 또는 95%인 주성분 개수인 412개 또는 495개로 압축하면 4.12% 또는 4.95%의 압축률로 진동 데이터를 압축할 수 있다. 압축된 주성분들을 사용하여 진동 데이터를 표현하면 엣지 컴퓨팅 환경에서 저장 공간을 절약하고, 계산 비용을 줄이며, 데이터 처리 속도를 향상시킬 수 있다. 이와 같이 PCA 기법을 사용하여 일차적으로 압축된 진동 데이터에 대해, 오토인코더 모델의 인코딩을 통해 다시 한번 압축한다. 오토인코더 모델은 도 3의 좌측에 도시된 바와 같이 입력한 특징(feature)을 복원 (reconstruction)하기 위해 만들어진 딥러닝 네트워크다. 정상 데이터만을 이용하여 오토인코더 모델을 학습하 게 되면 인코더와 디코더를 거쳐 정상 데이터의 패턴을 학습하게 된다. 이때 정상 데이터가 아닌 결함 데이터가 오토인코더 모델에 입력될 경우, 결함 데이터와 동일한 결과를 복원하 지 못하게 되어 입력 데이터와 복원 데이터 사이에 차이가 발생하며, 도 3의 우측에 도시된 바와 같이 이 차이 의 크기를 MSE(Mean Square Error)로 계산하여 임계값과 비교하면 회전 설비의 정상, 결함(고장) 여부를 진단할 수 있다. 구체적으로 MSE가 임계값을 초과하면 회전 설비에 결함이 발생한 것으로, MSE가 임계값 이하이면 회전 설비가 정상인 것으로 진달할 수 있다. 오토인코더 모델의 인코더는 네트워크가 점점 줄어드는 형태로 구성되어 있으므로 학습 이후에는 진동 데이터 압축에 사용될 수 있고, 디코더는 압축된 진동 데이터를 복원하여 결함 탐지에 사용될 수 있다. 이때 결함 정도가 심해짐에 따라 정상 데이터와의 차이가 심해져 MSE가 커지게 되므로, 이를 기초로 결함 탐지 와 동시에 결함 심각도(정도)를 측정할 수 있게 된다. 도 4에는 결함 심각도 측정 결과들을 예시하였는데, MSE 가 클수록 결함 심각도가 큰 것을 나타낸다. 한편 데이터 압축률이 늘어날수록 데이터 정보는 줄어들게 된다. 즉 압축률과 데이터 정보 간의 trade-off가 생 기는데, 본 발명의 실시예에서는 이를 t-SNE 기법을 활용하여 타협점을 구한다. t-SNE는 각 데이터 포인트들이 서로 가까운 이웃들과 유사하도록 저차원에 매핑하기 때문에 같은 특징을 가진 데이터들의 군집화 정도로 오토 인코더 모델의 latent space를 시각화하여 압축 데이터 정보를 평가할 수 있다. 도 5에는 오토인코더 모델의 latent space의 개수에 따른 t-SNE 결과를 예사하였다. 주파수 범위가 0~10000 Hz 인 진동 센서로 진동을 측정 후 PCA로 설명된 분산 비율이 90% 또는 95%일 때 각각 4.12% 또는 4.95%로 압축할 수 있다. 이때 오토인코더의 latent space의 개수가 60개 일 때 같은 결함 심각도 끼리 군집화가 잘 되어 있는 모습을 통해 개수가 10개 일 때 보다 더 많은 정보를 함축하여 압축하였다고 평가할 수 있다. 하지만 압축률 측 면에서 60개로 압축하는 것보다 PCA의 설명된 분산 비율이 각각 90% 또는 95% 일 때 41개 또는 50개의 latent vector로도 고장의 심함 정도에 따라 군집화가 형성되기 때문에 데이터 정보와 압축률을 고려하여, 각각 41/50 개의 latent vector로 정할 수 있다. 이는 기존의 10000개의 데이터 포인트를 각각 0.41% 또는 0.5%의 압축률로 압축할 수 있는 것이다. 이에 따라 압축된 진동 데이터에 대한 오토인코더 모델의 latent space에서 군집화도를 측정하여, 측정된 군집 화도가 정해진 임계치 이상을 만족하는 설명된 분산 비율을 PCA 기법을 활용한 진동 데이터 압축에서의 압축률 로 설정하는 것이다. 도 6은 본 발명의 일 실시예에 따른 회전 설비의 결함 진단 방법의 설명에 제공되는 도면이다. 결함 진단을 위해, 먼저 회전 설비에 부착된 진동 센서를 이용하여 진동 데이터를 수집하고(S110), 수집된 진동 데이터를 FFT하여 주파수 영역으로 변환한다(S120). 다음 S120단계에서 주파수 영역으로 변환된 진동 데이터에 대해 PCA 기법을 활용하여 1차 압축한다(S130). 이는 PCA 기법을 활용하여 진동 데이터를 주성분들로 분해하고, 분해된 주성분들 중 정해진 개수의 주성분들만 보존 하는 과정에 따른다. 정해진 개수만 보존하기 위해 설명된 분산 비율이 정해진 비율을 초과하는 주성분들만을 보존한다. 이후 S130단계에서 1차 압축된 진동 데이터에 대해, 오토인코더 모델의 인코더를 활용하여 2차 압축한다(S140). 여기서 오토인코더 모델은 정상의 진동 데이터들에 의해서만 비지도 학습된 것이다. S140단계에서 압축된 데이 터는 엣지 컴퓨팅 장치에 정해진 분량이 모일때까지 일시 저장될 수 있다. 그리고 오토인코더 모델의 디코더를 활용하여, 압축된 주성분들을 원래 대로 복원하고(S150), 복원된 주성분들 과 원래의 주성분들, 즉 S130단계에서 출력되는 주성분들 간의 MSE를 기초로 회전 설비의 결함을 탐지하고, 결 함 탐지시에는 결함 심각도를 측정한다(S160). 결함 탐지에서는, 복원된 주성분들과 원래의 주성분들 간의 MSE가 임계치를 초과한 경우에는 결함이 발생한 것으로, 임계치 이하인 경우에는 결함이 발생하지 않은 것으로 판단한다. 결함 발생시에는 복원된 주성분들과 원래의 주성분들 간의 MSE의 크기를 기초로 결함 심각도를 계산하는데, 결 함 심각도는 MSE의 크기에 비례하도록 계산한다. MSE의 크기가 클수록 정상 데이터와 상이한 이상 데이터로 볼 수 있기 때문이다. 이후, S160단계에서의 회전 설비에 대한 결함 탐지 결과와 결함 심각도를 시각화하여, 현장 작업자에게 알려준 다(S170). 도 7은 본 발명의 다른 실시예에 따른 회전 설비 결함 진단 시스템의 구성을 도시한 도면이다. 본 발명의 실시 예에 따른 회전 설비 결함 진단 시스템은 도시된 바와 같이 진동 센서, 출력부, 진단부, 저장부 및 통신부를 포함하여 구성된다. 진동 센서는 모터가 사용되는 회전 설비에 부착되어 모터의 의해 발생되는 진동을 감지하여 진동 데이터를 생성한다. 진단부는 전술한 도 6의 S120단계 내지 S160단계를 수행하여 회전 설비의 결함을 진단한다. 출력부는 진단부에 의한 진단 결과를 시각적/청각적으로 출력하는 출력 수단이다. 저장부는 진 단부가 기능하고 동작함에 있어 필요한 저장 공간을 제공한다. 통신부는 외부 네트워크 또는 외부 기기와 연결을 위한 통신 인터페이스로, 진단 결과를 사용자/관리자 단 말로 전달할 수 있다. 지금까지 엣지 컴퓨팅 장치에서 비지도 학습 방법으로 압축된 진동 데이터를 활용한 결함 탐지 및 결함 심각도 측정 방법 및 시스템에 대해 바람직한 실시예를 들어 상세히 설명하였다. 클라우드 컴퓨터나 다른 고성능 컴퓨터에 비해 메모리 등의 컴퓨팅 자원이 작은 엣지 컴퓨팅 환경에서 최적화된 딥러닝 모델 구동을 통한 설비 예지 보전을 진행하기 위해서 데이터 압축 기술이 필수적이다. 이에 본 발명의 실시예에서는 엣지 컴퓨팅 환경에서 비지도 학습 기법인 PCA 기법과 오토인코더의 인코딩 기법으로 압축된 진동 신호를 활용하여 회전 설비의 결함 진단 및 결함 심각도를 측정할 수 있도록 구현하였다. 또한 제조 현장에서 드물게 발상하는 결함 데이터를 제외한 정상 데이터만 사용하는 비지도 학습을 통하여 결함 진단 및 심각도를 측정하여 회전 설비 예지 보전을 통한 스마트팩토리 환경을 구축할 수 있도록 구현하였다. 한편, 본 실시예에 따른 장치와 방법의 기능을 수행하게 하는 컴퓨터 프로그램을 수록한 컴퓨터로 읽을 수 있는 기록매체에도 본 발명의 기술적 사상이 적용될 수 있음은 물론이다. 또한, 본 발명의 다양한 실시예에 따른 기 술적 사상은 컴퓨터로 읽을 수 있는 기록매체에 기록된 컴퓨터로 읽을 수 있는 코드 형태로 구현될 수도 있다. 컴퓨터로 읽을 수 있는 기록매체는 컴퓨터에 의해 읽을 수 있고 데이터를 저장할 수 있는 어떤 데이터 저장 장 치이더라도 가능하다. 예를 들어, 컴퓨터로 읽을 수 있는 기록매체는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광디스크, 하드 디스크 드라이브, 등이 될 수 있음은 물론이다. 또한, 컴퓨터로 읽을 수 있는 기록매체 에 저장된 컴퓨터로 읽을 수 있는 코드 또는 프로그램은 컴퓨터간에 연결된 네트워크를 통해 전송될 수도 있다. 또한, 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시"}
{"patent_id": "10-2023-0129910", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2023-0129910", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1. 정상 가동 상태의 진동 데이터 주파수 변환 결과 예시 도 2. 불균형 결함 가동 상태의 진동 데이터 주파수 변환 결과 예시 도 3. 비지도 학습 오토인코더 모델을 활용 결함 탐지 방법 도 4. 함 심각도 측정 결과들을 예시하였다. 도 5. 오토인코더의 latent space에 대한 t-SNE 시각화 도 6. 본 발명의 일 실시예에 따른 회전 설비의 결함 진단 방법도 7. 본 발명의 다른 실시예에 따른 회전 설비의 결함 진단 시스템"}
