{"patent_id": "10-2023-7009840", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0056730", "출원번호": "10-2023-7009840", "발명의 명칭": "제어 정보 수신에 대한 확인 응답 보고", "출원인": "삼성전자주식회사", "발명자": "파파사켈라리오우 아리스티데스"}}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통신 시스템에서 사용자 단말(UE)에 의해 수행되는 방법에 있어서,PDCCH들을 수신하기 위한 우선 순위 지정을 결정하는 단계로서,제 1 탐색 공간 세트(search space set, SSS)에 대한 PDCCH 수신들이 제 2 SSS에 대한 PDCCH 수신들 또는 제 3SSS에 대한 PDCCH 수신들보다 높은 우선 순위로 지정되고,설정에 따라 상기 제 2 SSS에 대한 상기 PDCCH 수신들이 상기 제 3 SSS에 대한 상기 PDCCH 수신들보다 높은 우선 순위로 지정되거나 낮은 우선 순위로 지정되며,상기 제 1 SSS에 대한 상기 PDCCH 수신들은 공통 탐색 공간(common search space, CSS)에 따르고, 제 1 하향링크 제어 정보(downlink control information, DCI) 포맷을 포함하고,상기 제 2 SSS에 대한 상기 PDCCH 수신들은 상기 CSS에 따르고, 그룹캐스트 PDSCH(physical downlink sharedchannel) 수신을 스케줄링하는 제 2 DCI 포맷을 포함하며, 또한상기 제 3 SSS에 대한 상기 PDCCH 수신들은 USS(UE-specific search space)에 따르고, 유니캐스트 PDSCH 수신을 스케줄링하는 제 3 DCI 포맷을 포함하는, 상기 우선 순위 지정을 결정하는 단계; 및상기 우선 순위 지정에 따라 상기 PDCCH들을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 우선 순위 지정은,사전 결정된 수의 PDCCH 후보들까지의 PDCCH 후보들의 할당; 및사전 결정된 수의 CCE들까지의 비-중첩 CCE(control channel element)들의 할당에 따르고,상기 설정은 탐색 공간 세트 인덱스에 대한 것이며, 또한상기 제 2 SSS 또는 상기 제 3 SSS의 상기 우선 순위 지정은 상기 탐색 공간 세트 인덱스의 오름차순에 따르는,방법."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,수신하는 단계로서,상기 유니캐스트 PDSCH 수신과 연관된 유니캐스트 HARQ-ACK(hybrid automatic repeat requestacknowledgement) 정보에 대한 제 1 코드북 타입에 대한 제 1 정보, 및상기 그룹캐스트 PDSCH 수신과 연관된 그룹캐스트 HARQ-ACK 정보에 대한 제 2 코드북 타입에 대한 제 2 정보를,상기 수신하는 단계;생성하는 단계로서,상기 제 1 코드북 타입에 따른 상기 유니캐스트 HARQ-ACK 정보, 및상기 제 2 코드북 타입에 따른 상기 그룹캐스트 HARQ-ACK 정보를, 상기 생성하는 단계; 및상기 유니캐스트 및 그룹캐스트 HARQ-ACK 정보를 포함하는 PUCCH(physical uplink control channel)를 송신하공개특허 10-2023-0056730-3-는 단계 - 상기 그룹캐스트 HARQ-ACK 정보는 상기 유니캐스트 HARQ-ACK 정보에 첨부됨 -를 더 포함하는, 방법."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 그룹캐스트 PDSCH 수신과 연관된 HARQ-ACK(hybrid automatic repeat request acknowledgement) 정보를 제공하는 PUCCH(physical uplink control channel)를 송신하는 단계를 더 포함하며,상기 PUCCH 송신의 전력은 공칭 전력 PO_PUCCH에 의존하고,상기 공칭 전력 PO_PUCCH는 HARQ-ACK 정보 값이 NACK(negative acknowledgement)인 경우에만 상기 PUCCH 송신이발생할 때의 제 1 값을 가지며,상기 공칭 전력 PO_PUCCH는 임의의 HARQ-ACK 정보 값에 대해 상기 PUCCH 송신이 발생할 때의 제 2 값을 갖는, 방법."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 제 2 SSS에 대한 상기 PDCCH 수신들에서 상기 제 2 DCI 포맷을 디코딩하는 단계; 및상기 제 2 DCI 포맷이 올바르게 디코딩되지 않은 경우에만 제 1 PUCCH 자원에서 제 1 PUCCH(physical uplinkcontrol channel)를 송신하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 그룹캐스트 PDSCH 수신에서 전송 블록(transport block, TB)을 디코딩하는 단계; 및상기 TB가 올바르게 디코딩되지 않은 경우에만 제 2 PUCCH 자원에서 제 2 PUCCH를 송신하는 단계 - 상기 제 1PUCCH 자원은 상기 제 2 PUCCH 자원과 상이함 -를 더 포함하는, 방법."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "통신 시스템의 사용자 단말(UE)에 있어서,트랜시버; 및프로세서를 포함하며,상기 프로세서는,PDCCH(physical downlink control channel)들의 수신을 위한 우선 순위 지정을 결정하고,제 1 탐색 공간 세트(search space set, SSS)에 대한 PDCCH 수신들이 제 2 SSS에 대한 PDCCH 수신들 또는 제 3SSS에 대한 PDCCH 수신들보다 높은 우선 순위로 지정되고,설정에 따라 상기 제 2 SSS에 대한 상기 PDCCH 수신들이 상기 제 3 SSS에 대한 상기 PDCCH 수신들보다 높은 우선 순위로 지정되거나 낮은 우선 순위로 지정되며,상기 제 1 SSS에 대한 상기 PDCCH 수신들은 공통 탐색 공간(CSS)에 따르고, 제 1 하향링크 제어 정보(DCI) 포맷을 포함하고,상기 제 2 SSS에 대한 상기 PDCCH 수신들은 상기 CSS에 따르고, 그룹캐스트 PDSCH(physical downlink sharedchannel) 수신을 스케줄링하는 제 2 DCI 포맷을 포함하며, 또한공개특허 10-2023-0056730-4-상기 제 3 SSS에 대한 상기 PDCCH 수신들은 USS(UE-specific search space)에 따르고, 유니캐스트 PDSCH 수신을 스케줄링하는 제 3 DCI 포맷을 포함하며; 또한상기 트랜시버를 통해, 상기 우선 순위 지정에 따라 상기 PDCCH들을 수신하도록 구성되는, 사용자 단말(UE)."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 우선 순위 지정은,사전 결정된 수의 PDCCH 후보들까지의 PDCCH 후보들의 할당; 및사전 결정된 수의 CCE들까지의 비-중첩 CCE(control channel element)들의 할당에 따르고,상기 설정은 탐색 공간 세트 인덱스에 대한 것이며, 또한상기 제 2 SSS 또는 상기 제 3 SSS의 상기 우선 순위 지정은 상기 탐색 공간 세트 인덱스의 오름차순에 따르는,사용자 단말(UE)."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 프로세서는,상기 트랜시버를 통해,상기 유니캐스트 PDSCH 수신과 연관된 유니캐스트 HARQ-ACK(hybrid automatic repeat requestacknowledgement) 정보에 대한 제 1 코드북 타입에 대한 제 1 정보; 및상기 그룹캐스트 PDSCH 수신과 연관된 그룹캐스트 HARQ-ACK 정보에 대한 제 2 코드북 타입에 대한 제 2 정보를,수신하고,상기 제 1 코드북 타입에 따라 상기 유니캐스트 HARQ-ACK 정보를 생성하고,상기 제 2 코드북 타입에 따라 상기 그룹캐스트 HARQ-ACK 정보를 생성하고,상기 그룹캐스트 HARQ-ACK 정보를, 상기 유니캐스트 HARQ-ACK 정보에 첨부하며, 또한상기 트랜시버를 통해, 상기 유니캐스트 및 그룹캐스트 HARQ-ACK 정보를 포함하는 PUCCH(physical uplinkcontrol channel)를 송신하도록 더 구성되는, 사용자 단말(UE)."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서,상기 프로세서는,상기 트랜시버를 통해, 상기 그룹캐스트 PDSCH 수신과 연관된 HARQ-ACK(hybrid automatic repeat requestacknowledgement) 정보를 제공하는 PUCCH(physical uplink control channel)를 송신하도록 더 구성되며,상기 PUCCH 송신의 전력은 공칭 전력 PO_PUCCH에 의존하고,상기 공칭 전력 PO_PUCCH는 HARQ-ACK 정보 값이 NACK(negative acknowledgement)인 경우에만 상기 PUCCH 송신이발생할 때의 제 1 값을 가지며,상기 공칭 전력 PO_PUCCH는 임의의 HARQ-ACK 정보 값에 대해 상기 PUCCH 송신이 발생할 때의 제 2 값을 갖는, 사용자 단말(UE)."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서,상기 프로세서는,공개특허 10-2023-0056730-5-상기 제 2 SSS에 대한 상기 PDCCH 수신들에서 상기 제 2 DCI 포맷을 디코딩하며, 또한상기 제 2 DCI 포맷이 올바르게 디코딩되지 않은 경우에만 제 1 PUCCH 자원에서 제 1 PUCCH(physical uplinkcontrol channel)를 송신하도록 더 구성되는, 사용자 단말(UE)."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 프로세서는,상기 그룹캐스트 PDSCH 수신에서 전송 블록(TB)을 디코딩하고, 또한상기 트랜시버를 통해, 상기 TB가 올바르게 디코딩되지 않은 경우에만 제 2 PUCCH 자원에서 제 2 PUCCH를 송신하도록 더 구성되며, 상기 제 1 PUCCH 자원은 상기 제 2 PUCCH 자원과 상이한, 사용자 단말(UE)."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "통신 시스템의 기지국에 있어서,트랜시버; 및프로세서를 포함하며,상기 프로세서는,PDCCH(physical downlink control channel)들의 송신을 위한 우선 순위 지정을 결정하고,제 1 탐색 공간 세트(SSS)에 대한 PDCCH 송신들이 제 2 SSS에 대한 PDCCH 송신들 또는 제 3 SSS에 대한 PDCCH송신들보다 높은 우선 순위로 지정되고,설정에 따라 상기 제 2 SSS에 대한 상기 PDCCH 송신들이 상기 제 3 SSS에 대한 상기 PDCCH 송신들보다 높은 우선 순위로 지정되거나 낮은 우선 순위로 지정되며,상기 제 1 SSS에 대한 상기 PDCCH 송신들은 공통 탐색 공간(CSS)에 따르고, 제 1 하향링크 제어 정보(DCI) 포맷을 포함하고,상기 제 2 SSS에 대한 상기 PDCCH 송신들은 상기 CSS에 따르고, 그룹캐스트 PDSCH(physical downlink sharedchannel) 송신을 스케줄링하는 제 2 DCI 포맷을 포함하며, 또한상기 제 3 SSS에 대한 상기 PDCCH 송신들은 USS(UE-specific search space)에 따르고, 유니캐스트 PDSCH 송신을 스케줄링하는 제 3 DCI 포맷을 포함하며; 또한상기 트랜시버를 통해, 상기 우선 순위 지정에 따라 상기 PDCCH들을 송신하도록 구성되는, 기지국."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 우선 순위 지정은,사전 결정된 수의 PDCCH 후보들까지의 PDCCH 후보들의 할당, 및사전 결정된 수의 CCE까지의 비-중첩 CCE(control channel element)들의 할당에 따르고,상기 설정은 탐색 공간 세트 인덱스에 대한 것이며, 또한상기 제 2 SSS 또는 상기 제 3 SSS의 상기 우선 순위 지정은 상기 탐색 공간 세트 인덱스의 오름차순에 따르는,기지국."}
{"patent_id": "10-2023-7009840", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 프로세서는,공개특허 10-2023-0056730-6-상기 트랜시버를 통해,상기 유니캐스트 PDSCH 송신과 연관된 유니캐스트 HARQ-ACK 정보에 대한 제 1 코드북 타입에 대한 제 1 정보;및상기 그룹캐스트 PDSCH 송신과 연관된 그룹캐스트 HARQ-ACK 정보에 대한 제 2 코드북 타입에 대한 제 2 정보를,송신하고, 또한상기 유니캐스트 및 그룹캐스트 HARQ-ACK 정보를 포함하는 PUCCH(physical uplink control channel)를 수신하도록 더 구성되며,상기 프로세서는,상기 제 1 코드북 타입에 따라 상기 유니캐스트 HARQ-ACK 정보를 획득하고, 또한상기 제 2 코드북 타입에 따라 상기 그룹캐스트 HARQ-ACK 정보를 획득하도록 더 구성되며, 상기 그룹캐스트HARQ-ACK 정보는 상기 유니캐스트 HARQ-ACK 정보에 첨부되고,상기 프로세서는, 상기 트랜시버를 통해, 상기 그룹캐스트 PDSCH 송신과 연관된 HARQ-ACK(hybrid automaticrepeat request acknowledgement) 정보를 제공하는 PUCCH(physical uplink control channel)를 수신하도록 더구성되며,상기 PUCCH 수신의 전력은 공칭 전력 PO_PUCCH에 의존하고;상기 공칭 전력 PO_PUCCH는 HARQ-ACK 정보 값이 NACK(negative acknowledgement)인 경우에만 상기 PUCCH 수신이발생할 때의 제 1 값을 가지며; 또한상기 공칭 전력 PO_PUCCH는 임의의 HARQ-ACK 정보 값에 대해 상기 PUCCH 수신이 발생할 때의 제 2 값을 갖고,상기 프로세서는, 상기 트랜시버를 통해,제 1 PUCCH 자원에서 제 1 PUCCH(physical uplink control channel); 및제 2 PUCCH 자원에서 제 2 PUCCH를 수신하도록 더 구성되며,상기 제 1 PUCCH의 수신은 상기 제 2 DCI 포맷에 대한 잘못된 디코딩을 나타내고, 또한상기 제 2 PUCCH의 수신은 상기 그룹캐스트 PDSCH 송신에서 전송 블록에 대한 잘못된 디코딩을 나타내는, 기지국."}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 4세대(4G) 시스템보다 높은 데이터 전송률을 지원하는 5세대(5G) 통신 시스템을 IOT(Internet of Things) 기술과 컨버징하기 위한 통신 방법 및 시스템에 관한 것이다. 본 개시는 스마트 홈, 스마트 빌딩, 스마 트 시티, 스마트 카, 커넥티드 카, 헬스 케어, 디지털 교육, 스마트 소매, 보안 및 안전 서비스들과 같은 IoT 관 (뒷면에 계속)"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 무선 통신 시스템에 관한 것이며, 보다 구체적으로는 제어 정보의 수신에 대한 확인 응답 (acknowledgement) 보고에 관한 것이다."}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 구축 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시스 템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 '비욘드(Beyond) 4G 네트워크' 또는 '포스트(Post) LTE(long term evolution) 시스템'이 라 불리어지고 있다. 5G 통신 시스템은 더 높은 데이터 전송률을 달성하기 위해, 60GHz 대역과 같은 더 높은 주파수(mmWave) 대역에서 구현되는 것으로 간주된다. 무선파의 전파 손실을 줄이고 전송 거리를 늘리기 위해 빔포밍, MIMO(Massive Multiple-Input Multiple-Output), FD-MIMO(Full Dimensional MIMO), 어레이 안테나, 아날로그 빔포밍, 대규모 안테나 기술이 5G 통신 시스템에서 논의된다. 또한, 5G 통신 시스템에서는, 개선된 소형 셀(advanced small cell), 클라우드 무선 액세스 네트워크(RAN), 초고밀도 네트워크, D2D(device-to- device) 통신, 무선 백홀, 이동 네트워크, 협력 통신, CoMP(Coordinated Multi-Point), 및 수신단 간섭 제거 등을 기반으로 시스템 네트워크 개선을 위한 개발이 진행 중이다. 5G 시스템에서는, 진보된 코딩 변조(advanced coding modulation, ACM) 기술로서 하이브리드 FSK 및 QAM 변조(FQAM)와 SWSC(sliding window superposition coding), 그리고 진보된 액세스 기술로서 FBMC(filter bank multi carrier), NOMA(non- orthogonal multiple access), 및 SCMA(sparse code multiple access)가 개발되었다. 인간이 정보를 생성하고 소비하는 인간 중심의 연결 네트워크인 인터넷은 이제 사물과 같은 분산된 엔티티들이 인간의 개입없이 정보를 교환하고 처리하는 IOT(Internet of Things)로 진화하고 있다. 클라우드 서버와의 연 결을 통해 IoT 기술과 빅 데이터 처리 기술이 결합된 IoE(Internet of Everything)가 또한 등장했다. IoT 구 현을 위한 \"센싱 기술\", \"유/무선 통신 및 네트워크 인프라스트럭처\", \"서비스 인터페이스 기술\" 및 \"보안 기술\"과 같은 기술 요소들이 요구됨에 따라 센서 네트워크, M2M(Machine-to-Machine) 통신, MTC(Machine Type Communication) 등이 최근 연구되고 있다. 이러한 IoT 환경은 연결된 사물들간에 생성되는 데이터를 수집하고 분석함으로써 인간의 삶에 새로운 가치를 창출하는 지능형 인터넷 기술 서비스를 제공할 수 있다. IoT는 기존 의 정보 기술(IT)과 다양한 산업 응용들 간의 융합 및 결합을 통해 스마트 홈, 스마트 빌딩, 스마트 시티, 스마 트 카 또는 커넥티드 카, 스마트 그리드, 헬스 케어, 스마트 가전 및 첨단 의료 서비스 등의 다양한 분야에 적 용될 수 있다. 이에 따라, 5G 통신 시스템을 IoT 네트워크에 적용하기 위한 다양한 시도가 이루어지고 있다. 예를 들어, 센서 네트워크, MTC(Machine Type Communication) 및 M2M(Machine-to-Machine) 통신과 같은 기술은 빔포밍, MIMO 및 어레이 안테나로 구현될 수 있다. 전술한 빅 데이터 처리 기술로서 클라우드 RAN(Radio Access Network)의 응 용은 5G 기술과 IoT 기술 간의 컨버전스의 예로 간주될 수 있다. 5세대(5G) 또는 새로운 무선(NR) 이동 통신은 최근 전 세계적으로 산업 및 학계로부터 다양한 후보 기술에 대한 기술 활동이 활발해지면서 더욱 탄력을 받고 있다. 5G/NR 이동 통신의 후보 인에이블러들은, 빔포밍 이득을 제 공하고 증가된 용량을 지원하기 위한, 레거시 셀룰러 주파수 대역에서 고주파수까지의 대규모 안테나 기술들, 다양한 요구사항을 갖는 각종 서비스/애플리케이션을 유연하게 수용하기 위한 새로운 파형(예를 들어, 새로운 무선 액세스 기술(radio access technology; RAT)), 대규모 연결을 지원하기 위한 새로운 다중 액세스 방식 등 을 포함한다."}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "통신 시스템의 발전에 따라, 제어 정보 수신에 대한 확인 응답을 보고하는 방법 및 장치가 필요하다."}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 제어 채널 및 데이터 채널을 수신하고, 각 제어 채널 또는 데이터 채널에서의 제어 정보 또는 데이터 정보 수신에 대한 응답으로 제어 채널에서 확인 응답을 보고하는 것에 관한 것이다. 일 실시예에서, 사용자 단말(UE)이 PDCCH(physical downlink control channel)들을 수신하기 위한 방법이 제공 된다. 이 방법은 PDCCH들을 수신하기 위한 우선 순위 지정을 결정하는 단계 및 우선 순위 지정에 기초하여 PDCCH들을 수신하는 단계를 포함한다. 제 1 탐색 공간 세트(SSS)에 대한 PDCCH 수신들은 제 2 SSS에 대한 PDCCH 수신들 또는 제 3 SSS에 대한 PDCCH 수신들보다 높은 우선 순위로 지정된다. 제 2 SSS에 대한 PDCCH 수 신들은 설정에 따라 제 3 SSS에 대한 PDCCH 수신들보다 높은 우선 순위로 지정되거나 낮은 우선 순위로 지정된 다. 제 1 SSS에 대한 PDCCH 수신들은 CSS(Common Search Space)에 따르며, 제 1 DCI(Downlink Control Information) 포맷을 포함한다. 제 2 SSS에 대한 PDCCH 수신들은 CSS에 따르며, 그룹캐스트 PDSCH(physical downlink shared channel) 수신을 스케줄링하는 제 2 DCI 포맷을 포함한다. 제 3 SSS에 대한 PDCCH 수신들은 USS(UE-specific search space)에 따르며, 유니캐스트 PDSCH 수신을 스케줄링하는 제 3 DCI 포맷을 포함한다. 다른 실시예에서, UE가 제공된다. UE는 PDCCH들의 수신을 위한 우선 순위 지정을 결정하도록 구성된 프로세서 및 프로세서에 동작 가능하게 연결되고 우선 순위 지정에 기초하여 PDCCH들을 수신하도록 구성된 트랜시버를 포 함한다. 제 1 SSS에 대한 PDCCH 수신들은 제 2 SSS에 대한 PDCCH 수신들 또는 제 3 SSS에 대한 PDCCH 수신들 보다 높은 우선 순위로 지정된다. 제 2 SSS에 대한 PDCCH 수신들은 설정에 따라 제 3 SSS에 대한 PDCCH 수신들 보다 높은 우선 순위로 지정되거나 낮은 우선 순위로 지정된다. 제 1 SSS에 대한 PDCCH 수신들은 CSS에 따르며, 제 1 DCI 포맷을 포함한다. 제 2 SSS에 대한 PDCCH 수신들은 CSS에 따르며, 그룹캐스트 PDSCH 수신을 스케줄링하는 제 2 DCI 포맷을 포함한다. 제 3 SSS에 대한 PDCCH 수신들은 USS에 따르며, 유니캐스트 PDSCH 수신을 스케줄링하는 제 3 DCI 포맷을 포함한다. 또 다른 실시예에서, 기지국이 제공된다. 기지국은 PDCCH들의 송신을 위한 우선 순위 지정을 결정하도록 구성 된 프로세서 및 프로세서에 동작 가능하게 연결되고 우선 순위 지정에 기초하여 PDCCH들을 송신하도록 구성된 트랜시버를 포함한다. 제 1 SSS에 대한 PDCCH 송신들은 제 2 SSS에 대한 PDCCH 송신들 또는 제 3 SSS에 대한 PDCCH 송신들보다 높은 우선 순위로 지정된다. 제 2 SSS에 대한 PDCCH 송신들은 설정에 따라 제 3 SSS에 대한 PDCCH 송신들보다 높은 우선 순위로 지정되거나 낮은 우선 순위로 지정된다. 제 1 SSS에 대한 PDCCH 송신들은 CSS에 따르며, 제 1 DCI 포맷을 포함한다. 제 2 SSS에 대한 PDCCH 송신들은 CSS에 따르며, 그룹캐스트 PDSCH 송신을 스케줄링하는 제 2 DCI 포맷을 포함한다. 제 3 SSS에 대한 PDCCH 송신들은 USS에 따르며, 유니캐스트 PDSCH 송신을 스케줄링하는 제 3 DCI 포맷을 포함한다. 다른 기술적 특징은 하기 도면, 설명 및 청구범위로부터 당업자에게 용이하게 명백할 수 있다. 아래의 상세한 설명에 들어가기 전에, 본 특허 명세서 전체에 걸쳐 사용되는 특정 단어 및 어구들의 정의를 기 재하는 것이 도움이 될 수 있다. 용어 \"커플(couple)\" 및 그 파생어는 두 개 이상의 요소 사이의 어떤 직접 또 는 간접 통신을 나타내거나, 이들 요소가 서로 물리적으로 접촉하고 있는지의 여부를 나타낸다. 용어 \"송신\", \"수신\" 및 \"통신\" 그리고 그 파생어는 직접 통신 및 간접 통신 모두를 포함한다. 용어 \"포함한다\" 및 \"구성한 다\" 그리고 그 파생어는 제한이 아닌 포함을 의미한다. 용어 \"또는(or)\"은 포괄적 용어로써, '및/또는'을 의미 한다. 어구 \"~와 관련되다(associated with)\" 및 그 파생어는 ~을 포함한다(include), ~에 포함된다(be included within), ~와 결합하다(interconnect with), ~을 함유하다(contain), ~에 함유되어 있다(be contained within), ~에 연결한다(connect to or with), ~와 결합하다(couple to or with), ~ 전달한다(be communicable with), 와 협력하다(cooperate with), ~를 끼우다(interleave), ~을 나란히 놓다(juxtapose), ~ 에 인접하다(be proximate to), 구속하다/구속되다(be bound to or with), 소유하다(have), 속성을 가지다 (have a property of), ~와 관계를 가지다(have a relationship to or with) 등을 의미한다. 용어 \"컨트롤러 (controller)\"는 적어도 하나의 동작을 제어하는 어떤 장치, 시스템 또는 그 일부를 의미한다. 이러한 컨트롤 러는 하드웨어 또는 하드웨어와 소프트웨어의 조합 및/또는 펌웨어로 구현될 수 있다. 특정 컨트롤러와 관련된 기능은 로컬 또는 원격으로 중앙 집중식으로 처리(centralized)되거나 또는 분산식으로 처리(distributed)될 수 있다. 어구 \"적어도 하나\"는, 그것이 항목들의 나열과 함께 사용될 경우, 나열된 항목들 중 하나 이상의 상이 한 조합이 사용될 수 있음을 의미한다. 예를 들어, \"A, B, C 중 적어도 하나\"는 A, B, C, A와 B, A와 C, B와 C, A와 B와 C의 조합 중 하나를 포함한다. 또한, 아래에서 설명되는 다양한 기능들은 하나 이상의 컴퓨터 프로그램에 의해 구현되거나 지원될 수 있으며, 이들 각각은 컴퓨터 판독 가능한 프로그램 코드로 형성되고 컴퓨터 판독 가능한 매체에 구현된다. 용어 \"애플 리케이션\" 및 \"프로그램\"은 하나 이상의 컴퓨터 프로그램, 소프트웨어 컴포넌트, 명령어 세트, 프로시저, 함수, 객체, 클래스, 인스턴스, 관련 데이터, 혹은 적합한 컴퓨터 판독 가능한 프로그램 코드에서의 구현용으로 구성 된 그것의 일부를 지칭한다. 어구 \"컴퓨터 판독 가능한 프로그램 코드\"는 소스 코드, 오브젝트 코드, 및 실행 가능한 코드를 포함하는 컴퓨터 코드의 종류를 포함한다. 어구 \"컴퓨터 판독 가능한 매체\"는 ROM(read only memory), RAM(random access memory), 하드 디스크 드라이브, 컴팩트 디스크(CD), 디지털 비디오 디스크(DVD), 혹은 임의의 다른 타입의 메모리와 같은, 컴퓨터에 의해 액세스될 수 있는 임의의 타입의 매체를 포함한다. \" 비일시적인\" 컴퓨터 판독 가능한 매체는 유선, 무선, 광학, 일시적인 전기적 또는 다른 신호들을 전달시키는 통 신 링크를 제외한다. 비일시적 컴퓨터 판독 가능한 매체는 데이터가 영구적으로 저장되는 매체 그리고 재기록 이 가능한 광디스크 또는 소거 가능한 메모리 장치와 같은, 데이터가 저장되어 나중에 덮어 씌어지는 매체를 포 함한다. 다른 특정 단어 및 어구에 대한 정의가 이 특허 명세서 전반에 걸쳐 제공된다. 당업자는 대부분의 경우가 아니 더라도 다수의 경우에 있어서, 이러한 정의는 종래에 뿐만 아니라 그러한 정의된 단어 및 어구의 향후 사용에 적용될 수 있음을 이해해야 한다."}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예들에 따르면, 제어 정보 수신에 대한 확인 응답을 보고하는 방법 및 장치가 제공된다. 따라서, 통신 시스템의 효율성 향상이 달성될 수 있다."}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에 설명되는 도 1 내지 도 17, 및 이 특허 명세서에 있어서의 본 개시의 원리들을 설명하기 위해 사용되는 각종 실시예들은 단지 설명을 위한 것이며, 어떠한 방식으로도 본 개시의 범위를 제한하는 방식으로 해석되어서 는 안된다. 당업자는 본 개시의 원리가 임의의 적절하게 구성된 시스템 또는 장치에서 구현될 수 있음을 이해 할 것이다. 다음의 문서들은 본 명세서에서 완전히 설명된 것처럼 본 명세서에 참조로서 포함된다: 3GPP TS 38.211 v16.2.0, \"NR; Physical channels and modulation,\" 3GPP TS 38.212 v16.2.0, \"NR; Multiplexing and Channel coding,\" 3GPP TS 38.213 v16.2.0, \"NR; Physical Layer Procedures for Control,\" 3GPP TS 38.214 v16.2.0, \"NR; Physical Layer Procedures for Data,\" 3GPP TS 38.321 v16.1.0, \"NR; Medium Access Control (MAC) protocol specification,\" 및 3GPP TS 38.331 v16.1.0, \"NR; Radio Resource Control (RRC) protocol specification.\" 4G 통신 시스템 구축 이후 증가하는 무선 데이터 트래픽에 대한 수요를 충족하기 위해 개선된 5G 또는 pre- 5G/NR 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 또는 pre-5G 통신 시스템을 \"비욘드(Beyond) 4G 네트워크\" 또는 \"포스트(Post) LTE(long term evolution) 시스템\"이라고도 한다.5G 통신 시스템은 28GHz 또는 60GHz 대역과 같은 더 높은 주파수(mmWave) 대역에서 구현되어 더 높은 데이터 전 송률을 달성하거나 6GHz와 같은 더 낮은 주파수 대역에서 구현되어 강건한 커버리지 및 이동성 지원을 가능하게 하는 것으로 간주된다. 무선파의 전파 손실을 줄이고 전송 거리를 늘리기 위해 빔포밍, MIMO(Massive Multiple-Input Multiple-Output), FD-MIMO(Full Dimensional MIMO), 어레이 안테나, 아날로그 빔포밍, 대규모 안테나 기술이 5G 통신 시스템에서 논의된다. 또한, 5G 통신 시스템에서는, 개선된 소형 셀(advanced small cell), 클라우드 무선 액세스 네트워크(RAN), 초 고밀도 네트워크, D2D(device-to-device) 통신, 무선 백홀, 이동 네트워크, 협력 통신, CoMP(Coordinated Multi-Point), 및 수신단 간섭 제거 등을 기반으로 시스템 네트워크 개선을 위한 개발이 진행 중이다. 5G 시스템 및 이와 관련된 주파수 대역에 대한 논의는 본 개시의 특정 실시예가 5G 시스템에서 구현될 수 있기 때문에 단지 참조를 위한 것이다. 그러나, 본 개시는 5G 시스템 또는 이와 관련된 주파수 대역에만 제한되지 않으며, 본 개시의 실시예들은 임의의 주파수 대역과 관련하여 활용될 수 있다. 예를 들어, 본 개시의 양태들 은 테라헤르츠(THz) 대역을 사용할 수 있는 5G 통신 시스템, 6G 또는 심지어 그 이후의 릴리스의 전개에 적용될 수도 있다. 네트워크 타입에 따라, '기지국(BS)'이라는 용어는 네트워크에 무선 액세스를 제공하도록 구성된 컴포넌트(또는 컴포넌트 집합), 예를 들면, 송신 포인트(TP), 송-수신 포인트(TRP), 향상된 기지국(eNodeB 또는 eNB), gNB, 매 크로셀, 펨토셀, WiFi 액세스 포인트(AP), 위성, 또는 기타 무선 가능 장치를 지칭할 수 있다. 기지국은 하나 이상의 무선 통신 프로토콜, 예컨대 5G 3GPP 새로운 무선 인터페이스/액세스(NR), LTE, LTE-A(LTE-advanced), HSPA(High Speed Packet Access), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세스를 제공할 수 있다.용어 'BS', 'gNB' 및 'TRP'는 본 개시에서 원격 단말들에 대한 무선 액세스를 제공하는 네트워크 인프라스트럭처 컴 포넌트들을 지칭하는 것으로 상호 교환적으로 사용된다. 또한, 네트워크 타입에 따라, '사용자 단말(UE)'이라 는 용어는 이동국, 가입자국, 원격 단말, 무선 단말, 수신 포인트, 차량, 또는 사용자 장치와 같은 임의의 컴포 넌트를 지칭할 수 있다. 예를 들어, UE는 이동 전화, 스마트 폰, 모니터링 장치, 경보 장치, 차량 관리 장치, 애셋 추적 장치, 자동차, 데스크탑 컴퓨터, 엔터테인먼트 장치, 인포테인먼트 장치, 벤딩 머신, 전기 계량기, 수도 계량기, 가스 계량기, 보안 장치, 센서 장치, 가전 제품 등일 수 있다. UE는, UE가 이동 장치(예컨대, 휴 대 전화기 또는 스마트 폰)이든 일반적으로 고려되는 고정 장치(예컨대, 데스크탑 컴퓨터 또는 벤딩 머신)이든 간에, gNB에 무선으로 액세스하는 원격 무선 장비를 지칭하는 것일 수 있다. 또한 UE는 자동차, 트럭, 밴, 드 론, 또는 임의의 유사한 머신 또는 이러한 머신 내의 장치일 수도 있다. 아래의 도 1 내지 도 3에서는 무선 통신 시스템들에서 구현되고 또한 OFDM(orthogonal frequency division multiplexing) 또는 OFDMA(orthogonal frequency division multiple access) 통신 기술들을 사용하여 구현되는 다양한 실시예들을 설명한다. 도 1 내지 도 3의 설명은 상이한 실시예들이 구현될 수 있는 방식에 대한 물리적 또는 구조적 제한을 나타내는 것을 의미하지 않는다. 본 개시의 상이한 실시예들은 임의의 적절하게 구성된 통 신 시스템에서 구현될 수 있다. 도 1은 본 개시의 실시예들에 따른 예시적 무선 네트워크를 도시한 것이다. 도 1에 도시된 무선 네트워크 의 실시예는 단지 설명을 위한 것이다. 무선 네트워크에 대한 다른 실시예들이 본 개시의 범위를 일탈하 지 않는 범위 내에서 사용될 수 있다. 도 1에 도시된 바와 같이, 무선 네트워크는 BS(base station)(예를 들면, gNB), BS 및 BS(10 3)를 포함한다. BS는 BS 및 BS와 통신한다. BS는 또한 적어도 하나의 네트워크, 예를 들어, 인터넷, 전용 인터넷 프로토콜(IP) 네트워크, 또는 다른 데이터 네트워크와도 통신한다. BS는 BS의 커버리지 영역 내에 있는 제 1 복수의 사용자 단말(UE)들에게, 네트워크에의 무 선 광대역 액세스를 제공한다. 제 1 복수의 UE들은 중소기업(SB)에 위치할 수 있는 UE; 대기업(E)에 위치 할 수 있는 UE; 와이파이 핫 스팟(HS)에 위치할 수 있는 UE; 제 1 주거지역(R)에 위치할 수 있는 UE; 제 2 주거지역(R)에 위치할 수 있는 UE; 및 휴대 전화, 무선 랩탑, 무선 PDA 등과 같은 모바일 장치(M)일 수 있는 UE를 포함한다. BS는 BS의 커버리지 영역 내에 있는 제 2 복수의 UE 들에게, 네트워크에의 무선 광대역 액세스를 제공한다. 제 2 복수의 UE들은 UE 및 UE를 포함한 다. 일부 실시예들에서, BS들(101-103) 중 하나 이상의 BS들은 5G/NR, LTE(long term evolution), LTE-A(long term evolution-advanced), WiMAX, WiFi 또는 다른 무선 통신 기술들을 사용하여 서로 간에 및 UE들(111- 116)과 통신할 수 있다.점선은 예시 및 설명만을 위해 거의 원형으로 도시되는 커버리지 영역(120 및 125)의 대략적인 범위를 보여준다. BS들과 연관된 커버리지 영역들, 예를 들어 커버리지 영역들(120 및 125)은 BS들의 구성, 및 자연 및 인공 장애물들과 관련된 무선 환경의 변화에 따라, 불규칙한 형태들을 포함하는 다른 형태들을 가질 수 있음 을 명확하게 이해해야 한다. 아래에서 더 상세히 설명되는 바와 같이, UE들(111-116) 중 하나 이상은 제어 정보 수신에 대한 확인 응답 보고 를 위한 회로, 프로그래밍, 또는 이들의 조합을 포함한다. 특정 실시예들에서, BS들(101-103) 중 하나 이상은 제어 정보 수신에 대한 확인 응답 보고를 수신하기 위한 회로, 프로그래밍, 또는 이들의 조합을 포함한다. 도 1이 무선 네트워크의 일 예를 도시하고 있지만, 다양한 변경들이 도 1에 대하여 이루어질 수 있다. 예를 들 어, 무선 네트워크는 임의의 적절한 배열로 임의의 개수의 BS들 및 임의의 개수의 UE들을 포함할 수 있다. 또 한, BS는 임의의 개수의 UE들과 직접 통신하여, 이 UE들에게 네트워크로의 무선 광대역 액세스를 제 공할 수 있다. 유사하게, 각각의 BS(102-103)는 네트워크와 직접 통신하여, UE들에게 네트워크로의 직접 무선 광대역 액세스를 제공할 수 있다. 또한, BS들(101, 102, 및/또는 103)은 외부 전화 네트워크들 또는 다른 타입의 데이터 네트워크들과 같은 다른 또는 추가의 외부 네트워크들에의 액세스를 제공할 수 있다. 도 2는 본 개시의 실시예들에 따른 예시적인 BS를 도시한 것이다. 도 2에 도시된 BS의 실시예는 단 지 설명을 위한 것이며, 도 1의 BS들(101 및 103)은 동일하거나 유사한 구성을 가질 수 있다. 그러나, BS들은 각종의 다양한 구성들로 이루어지며, 도 2는 BS에 대한 임의의 특정 구현으로 본 개시의 범위를 제한하지 않는 다. 도 2에 도시된 바와 같이, BS는 복수의 안테나들(205a-205n), 복수의 RF(radio frequency) 트랜시버들 (210a-210n), 송신(TX) 처리 회로, 및 수신(RX) 처리 회로를 포함한다. 또한, BS는 컨트롤러/ 프로세서, 메모리, 및 백홀 또는 네트워크 인터페이스를 포함한다. RF 트랜시버들(210a-210n)은, 안테나들(205a-205n)으로부터, 네트워크 내에서 UE들에 의해 송신되는 신호 들과 같은 내향(incoming) RF 신호들을 수신한다. RF 트랜시버들(210a-210n)은 내향 RF 신호들을 하향 변환 (down-convert)하여, IF 또는 기저대역 신호들을 생성한다. IF 또는 기저대역 신호들은, 기저대역 또는 IF 신 호들을 필터링하고, 디코딩하고, 및/또는 디지털화하는 것에 의하여 처리된 기저대역 신호들을 생성하는 RX 처 리 회로로 전송된다. RX 처리 회로는 이 처리된 기저대역 신호들을, 추가의 처리를 위하여 컨트롤러 /프로세서로 송신한다. TX 처리 회로는, 컨트롤러/프로세서로부터 아날로그 또는 디지털 데이터(예컨대, 음성 데이터, 웹 데 이터, 이-메일, 또는 쌍방향 비디오 게임 데이터)를 수신한다. TX 처리 회로는, 외향(outgoing) 기저대역 데이터를 인코딩, 멀티플렉싱, 및/또는 디지털화하여, 처리된 기저대역 또는 IF 신호들을 생성한다. RF 트랜시 버들(210a-210n)은 TX 처리 회로로부터, 외향 처리된 기저대역 또는 IF 신호들을 수신하고, 그 기저대역 또는 IF 신호들을, 안테나들(205a-205n)을 통해 송신되는 RF 신호들로 상향 변환한다. 컨트롤러/프로세서는 BS의 전반적인 동작을 제어하는 하나 이상의 프로세서들 또는 다른 처리 장치들 을 포함할 수 있다. 예를 들어, 컨트롤러/프로세서는, 잘 알려진 원리들에 따라 RF 트랜시버들(210a- 210n), RX 처리 회로, 및 TX 처리 회로에 의해 순방향 채널 신호들의 수신 및 역방향 채널 신호들의 송신을 제어할 수 있다. 컨트롤러/프로세서는 더 진보된 무선 통신 기능들과 같은 추가 기능들도 지원할 수 있다. 예를 들어, 컨트롤러/프로세서는 제어 정보 수신에 대한 확인 응답 보고를 지원할 수 있다. 다 양한 다른 기능들 중 임의의 것이 컨트롤러/프로세서에 의해 BS에서 지원될 수 있다. 일부 실시예들 에서, 컨트롤러/프로세서는 적어도 하나의 마이크로프로세서 또는 마이크로컨트롤러를 포함한다. 또한, 컨트롤러/프로세서는 메모리에 상주하는 프로그램들 및 다른 프로세스들, 예를 들어 OS를 실행 할 수 있다. 컨트롤러/프로세서는 실행 프로세스에 의한 요구에 따라 데이터를 메모리 내로 또는 외 부로 이동시킬 수 있다. 특정 실시예들에서, 컨트롤러/프로세서는 제어 정보의 수신을 위한 확인 응답 보 고의 수신을 지원한다. 예를 들어, 컨트롤러/프로세서는 실행 중인 프로세스에 따라 데이터를 메모리 안팎으로 이동시킬 수 있다. 또한, 컨트롤러/프로세서는 백홀 또는 네트워크 인터페이스에 커플링된다. 백홀 또는 네트워크 인터 페이스는, BS가 백홀 연결을 통해 또는 네트워크를 통해 다른 장치들 또는 시스템들과 통신하는 것을 가능하게 한다. 네트워크 인터페이스는 임의의 적절한 유선 또는 무선 연결(들)을 통한 통신들을 지원할 수 있다. 예를 들어, BS가 셀룰러 통신 시스템(예컨대, 5G/NR, LTE, 또는 LTE-A를 지원하는 것)의 일부로서 구현되는 경우, 네트워크 인터페이스는, BS가 유선 또는 무선 백홀 연결을 통해 다른 BS들과 통신 하는 것을 가능하게 할 수 있다. BS가 액세스 포인트로서 구현되는 경우, 네트워크 인터페이스는, BS가 유선 또는 무선 로컬 영역 네트워크를 통해 또는 유선 또는 무선 연결을 통해 더 큰 네트워크(예컨대, 인터넷)로 전송하는 것을 가능하게 한다. 네트워크 인터페이스는 유선 또는 무선 연결, 예를 들어 이더넷 또는 RF 트랜시버를 통한 통신들을 지원하는 임의의 적절한 구조를 포함한다. 메모리는 컨트롤러/프로세서에 커플링된다. 메모리의 일부는 RAM을 포함할 수 있으며, 메모리 의 다른 일부는 플래시 메모리 또는 다른 ROM을 포함할 수 있다. 도 2가 BS의 일 예를 도시하고 있지만, 다양한 변경들이 도 2에 대하여 이루어질 수 있다. 예를 들어, BS는 도 2에 나타낸 각 컴포넌트에 대한 임의의 개수를 포함할 수 있다. 일 특정 예로서, 액세스 포인트 는 다수의 인터페이스들을 포함할 수 있고, 컨트롤러/프로세서는 상이한 네트워크 주소들 사이에서 데이터를 라우팅하는 라우팅 기능들을 지원할 수 있다. 다른 특정 예로서, 단일 인스턴스의 TX 처리 회로 및 단일 인스턴스의 RX 처리 회로를 포함하는 것으로 도시되어 있지만, BS는 각각에 대한 복수의 인 스턴스들을 포함할 수 있다(예컨대, RF 트랜시버당 하나). 또한, 도 2의 각종 컴포넌트들이 조합되거나, 더 세 분화되거나, 생략될 수 있으며, 특정 필요들에 따라 추가의 컴포넌트들이 부가될 수도 있다. 도 3은 본 개시의 실시예들에 따른, 예시적 UE를 도시한 것이다. 도 3에 도시된 UE의 실시예는 단지 설명을 위한 것이며, 도 1의 UE들(111-115)은 동일하거나 유사한 구성을 가질 수 있다. 그러나, UE들은 각종의 다양한 구성들로 이루어지며, 도 3은 UE에 대한 임의의 특정 구현으로 본 개시의 범위를 제한하지 않는다. 도 3에 도시된 바와 같이, UE는 안테나, RF 트랜시버, TX 처리 회로, 마이크로폰, 및 수신(RX) 처리 회로를 포함한다. 또한, UE는 스피커, 프로세서, 입/출력(I/O) 인터페 이스(IF), 입력 장치, 디스플레이, 및 메모리를 포함한다. 메모리는 운영 체제 (OS) 및 하나 이상의 애플리케이션들을 포함한다. RF 트랜시버는 네트워크의 BS에 의해 송신되는 내향 RF 신호를 안테나로부터 수신한다. RF 트 랜시버는 수신 RF 신호를 하향 변환하여 중간 주파수(IF)나 기저대역 신호를 생성한다. IF 또는 기저대역 신호는, 그 기저대역 또는 IF 신호를 필터링하고, 디코딩하고, 및/또는 디지털화하는 것에 의해 처리된 기저대 역 신호를 생성하는 RX 처리 회로로 전송된다. RX 처리 회로는 그 처리된 기저대역 신호를, 스피커 로 송신하거나(예컨대, 음성 데이터), 또는 추가 처리를 위해 프로세서로 송신한다(예컨대, 웹 브라 우징 데이터). TX 처리 회로는 마이크로폰으로부터 아날로그 또는 디지털 음성 데이터를 수신하거나 또는 프로세서 로부터 다른 외향 기저대역 데이터(예컨대, 웹 데이터, 이-메일, 또는 쌍방향 비디오 게임 데이터)를 수신 한다. TX 처리 회로는 그 외향 기저대역 데이터를 인코딩, 멀티플렉싱, 및/또는 디지털화하여, 처리된 기 저대역 또는 IF 신호를 생성한다. RF 트랜시버는 TX 처리 회로로부터 외향 처리된 기저 대역 또는 IF 신호를 수신하고, 기저 대역 또는 IF 신호를 안테나를 통해 송신되는 RF 신호로 상향 변환한다. 프로세서는 하나 이상의 프로세서들 또는 다른 처리 장치들을 포함할 수 있으며, 메모리에 저장된 OS를 실행함으로써 UE의 전반적인 동작을 제어할 수 있다. 예를 들어, 프로세서는 잘 알려진 원리들에 따라 RF 트랜시버, RX 처리 회로, 및 TX 처리 회로에 의해 순방향 채널 신호들의 수신 및 역방향 채널 신호들을 송신을 제어할 수 있다. 몇몇 실시예들에서, 프로세서는 적어도 하나의 마이크 로프로세서 또는 마이크로컨트롤러를 포함한다. 프로세서는 또한 빔 관리를 위한 프로세스와 같이 메모리에 상주하는 다른 프로세스 및 프로그램을 실행할 수 있다. 프로세서는 실행 프로세스에 의한 요구에 따라 메모리 내로 또는 외부로 데이터를 이동할 수 있다. 일부 실시예들에서, 프로세서는 OS에 기초하여 또는 BS들 또는 오퍼레이터로부터 수신된 신호들에 따라 애플리케이션들을 실행하도록 구성된다. 또한, 프로세서는, 랩탑 컴퓨터 및 휴대용 컴퓨터와 같은 다른 장치들에 연결되는 능력을 UE에게 제공하는 I/O 인터페이스에 커플링되어 있다. I/O 인터페이스는 이 주변기기들과 프로세서 간의 통신 경로이다. 또한, 프로세서는 입력 장치에 커플링된다. UE의 오퍼레이터는 입력 장치을 사용하여 UE에 데이터를 입력할 수 있다. 입력 장치는 키보드, 터치스크린, 마우스, 트랙 볼, 음성 입력 장치 이거나, 또는 사용자가 UE와 상호 작용할 수 있도록 하는 사용자 인터페이스로서 작용할 수 있는 다른 장 치일 수 있다. 예를 들어, 입력 장치는 음성 인식 처리를 포함하여, 사용자가 음성 명령을 입력할 수 있도록 할 수 있다. 다른 예에서, 입력 장치는 터치 패널, (디지털) 펜 센서, 키, 또는 초음파 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전 용량 방식, 감압 방식, 적외선 방식 또는 초음파 방식 등과 같 은 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 프로세서는 또한 디스플레이에 커플링된다. 디스플레이는 예를 들어, 웹 사이트들로부터의 텍 스트 및/또는 적어도 제한된 그래픽들을 렌더링할 수 있는 액정 표시 장치, 발광 다이오드 디스플레이, 또는 다 른 디스플레이일 수 있다. 메모리는 프로세서에 커플링된다. 메모리의 일부는 랜덤 액세스 메모리(RAM)를 포함할 수 있으 며, 메모리의 다른 일부는 플래시 메모리 또는 다른 판독 전용 메모리(ROM)를 포함할 수 있다. 도 3이 UE의 일 예를 도시하고 있지만, 다양한 변경들이 도 3에 대하여 이루어질 수 있다. 예를 들어, 도 3의 각종 컴포넌트들은 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요들에 따라 추가 컴포넌트들 이 부가될 수도 있다. 일 특정 예로서, 프로세서는 복수의 프로세서들, 예를 들어 하나 이상의 중앙 처리 유닛(CPU)들 및 하나 이상의 그래픽 처리 유닛(GPU)들로 분할될 수 있다. 또한, 도 3이 이동 전화기나 스마트 폰과 같이 구성된 UE를 도시하고 있지만, UE들은 다른 타입의 이동 또는 고정 장치들로서 동작하도록 구성 될 수도 있다. 도 4 및 도 5는 본 개시에 따른 예시적인 무선 송신 및 수신 경로를 도시한 것이다. 다음의 설명에서, 도 4의 송신 경로는 (BS와 같은) BS에서 구현되는 것으로 설명될 수 있는 반면, 도 5의 수신 경로는 (UE와 같은) UE에서 구현되는 것으로 설명될 수 있다. 그러나, 수신 경로는 BS에서 구현될 수 있고, 송신 경로는 UE에서 구현될 수 있다는 것이 이해될 것이다. 일부 실시예들에서, 수신 경로는 본 개 시의 실시예들에서 설명된 바와 같이 제어 정보 수신에 대한 확인 응답 보고를 지원하도록 구성된다. 도 4에 도시된 송신 경로는 채널 코딩 및 변조 블록, 직렬-병렬(S-to-P) 블록, 크기 N 역 고속 푸리에 변환(Inverse Fast Fourier Transform, IFFT) 블록, 병렬-직렬(P-to-S) 블록, 부가 사이클릭 프리픽스 블록(add cyclic prefix block) 및 상향 변환기(up-converter, UC)를 포함한다. 도 5에 도시된 수신 경로는 하향 변환기(down-converter, DC), 제거 사이클릭 프리픽스 블록, 직렬-병 렬(S-to-P) 블록, 크기 N 고속 푸리에 변환(Fast Fourier Transform, FFT) 블록, 병렬-직렬(P-to-S) 블록, 및 채널 디코딩 및 복조 블록을 포함한다. 도 4에 도시된 바와 같이, 채널 코딩 및 변조 블록은 정보 비트(information bit)의 세트를 수신하고, 코 딩(예컨대, LDPC(low-density parity check) 코딩)을 적용하며, 일련의 주파수 도메인 변조 심볼(frequency- domain modulation symbol)을 생성하기 위해 입력 비트(예컨대, QPSK(quadrature phase shift keying) 또는 QAM(quadrature amplitude modulation))를 변조시킨다. 직렬-병렬 블록은 N개의 병렬 심볼 스트림을 생 성하기 위해 직렬 변조된 심볼을 병렬 데이터로 변환(예컨대, 역다중화)하며, 여기서 N은 BS 및 UE에 서 사용되는 IFFT/FFT 크기이다. 크기 N IFFT 블록은 시간 도메인 출력 신호를 생성하기 위해 N개의 병렬 심볼 스트림 상에서 IFFT 연산을 수행한다. 병렬-직렬 블록은 직렬 시간 도메인 신호를 생성하기 위해 크 기 N IFFT 블록으로부터의 병렬 시간 도메인 출력 심볼을 변환한다(예컨대, 다중화). 부가 사이클릭 프리 픽스 블록은 사이클릭 프리픽스를 시간 도메인 신호에 삽입한다. 상향 변환기는 무선 채널을 통한 송신을 위해 부가 사이클릭 프리픽스 블록의 출력을 RF 주파수로 변조시킨다(예컨대, 상향 변환). 신호는 또한 RF 주파수로 변환하기 전에 기저 대역에서 필터링될 수 있다. BS로부터 송신된 RF 신호는 무선 채널을 통과한 후에 UE에 도달하고, BS에서의 동작과의 역 동 작이 UE에서 수행된다. 도 5에 도시된 바와 같이, 하향 변환기는 수신된 신호를 기저 대역 주파수로 하향 변환하고, 제거 사이클 릭 프리픽스 블록은 직렬 시간 도메인 기저 대역 신호를 생성하기 위해 사이클릭 프리픽스를 제거한다. 직렬-병렬 블록은 시간 도메인 기저 대역 신호를 병렬 시간 도메인 신호로 변환한다. 크기 N FFT 블록 은 N개의 병렬 주파수 도메인 신호를 생성하기 위해 FFT 알고리즘을 수행한다. 병렬-직렬 블록은 병 렬 주파수 도메인 신호를 일련의 변조된 데이터 심볼로 변환한다. 채널 디코딩 및 복조 블록은 원래의 입 력 데이터 스트림을 복원하기 위해 변조된 심볼을 복조하여 디코딩한다. BS(101-103)의 각각은 하향링크에서 UE(111-116)로 송신하는 것과 유사한 도 4에 도시된 송신 경로를 구현 할 수 있고, 상향링크에서 UE(111-116)로부터 수신하는 것과 유사한 도 5에 도시된 수신 경로를 구현할 수 있다. 마찬가지로, UE(111-116)의 각각은 상향링크에서 BS(101-103)로 송신하기 위한 송신 경로를 구현할수 있고, 하향링크에서 BS(101-103)로부터 수신하기 위한 수신 경로를 구현할 수 있다. 또한, UE들(111- 116) 각각은 UE들(111-116) 중 다른 하나로부터의 사이드링크에서 수신하기 위한 수신 경로를 구현할 수 있다. 도 4 및 도 5의 구성 요소의 각각은 하드웨어만을 사용하거나 하드웨어 및 소프트웨어/펌웨어의 조합을 사용하 여 구현될 수 있다. 특정 예로서, 도 4 및 5의 구성 요소 중 적어도 일부는 소프트웨어로 구현될 수 있지만, 다른 구성 요소는 설정 가능한 하드웨어 또는 소프트웨어 및 설정 가능한 하드웨어의 혼합에 의해 구현될 수 있 다. 예를 들어, FFT 블록 및 IFFT 블록은 구성 가능한 소프트웨어 알고리즘으로서 구현될 수 있으며, 여기서 크기 N의 값은 구현에 따라 수정될 수 있다. 또한, FFT 및 IFFT를 사용하는 것으로서 설명되었지만, 이는 예시일 뿐이며, 본 개시의 범위를 제한하는 것으로 해석될 수 없다. 이산 푸리에 변환(discrete Fourier transform, DFT) 및 역이산 푸리에 변환(inverse discrete Fourier transform, IDFT) 함수와 같은 다른 타입의 변환이 사용될 수 있다. DFT 및 IDFT 함수에 대 해 N 변수의 값은 임의의 정수(예컨대, 1, 2, 3, 4 등)일 수 있지만, FFT 및 IFFT 함수에 대해서는 N 변수의 값 은 2의 거듭 제곱인 임의의 정수(즉, 1, 2, 4, 8, 16 등)일 수 있다는 것이 이해될 수 있다. 도 4 및 도 5가 무선 송신 및 수신 경로의 예를 도시하고 있지만, 도 4 및 5에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 4 및 도 5에서의 다양한 구성 요소는 조합되거나, 더 세분화되거나 생략될 수 있으며, 특 정 필요에 따라 추가적인 구성 요소가 부가될 수 있다. 또한, 도 4 및 도 5는 무선 네트워크에서 사용될 수 있 는 송신 및 수신 경로의 타입의 예를 도시하기 위한 것이다. 무선 네트워크에서 무선 통신을 지원하기 위해 다 른 적절한 아키텍처가 사용될 수 있다. 셀에서의 DL(downlink) 시그널링 또는 UL(uplink) 시그널링을 위한 시간 유닛을 슬롯이라고 하며 하나 이상의 심볼을 포함할 수 있다. 대역폭(BW) 유닛을 자원 블록(RB)이라고 한다. 하나의 RB는 다수의 서브캐리어(SC)를 포함한다. 예를 들어, 슬롯은 1 밀리 초의 듀레이션을 가질 수 있고, RB는 180kHz의 대역폭을 가질 수 있고 15kHz의 SC-간 간격이 있는 12개의 SC를 포함할 수 있다. 서브캐리어 간격(SCS)은 SCS 구성 μ에 의해 2μ·15 kHz로 결정될 수 있다. 하나의 심볼에 대한 하나의 서브캐리어 유닛을 자원 요소(resource element, RE)라고 한다. 하나의 심볼에 대한 하나의 RB의 유닛을 PRB(Physical RB)라고 한다. DL 신호는 정보 내용을 전달하는 데이터 신호, DL 제어 정보(DCI)를 전달하는 제어 신호 및 파일럿 신호라고도 알려진 기준 신호(RS)를 포함한다. BS(예를 들면 BS)는 각각의 물리적 DL 공유 채널(PDSCH) 또는 물리적 DL 제어 채널(PDCCH)을 통해 데이터 정보 또는 DCI를 송신한다. PDSCH 또는 PDCCH는 하나의 슬롯 심볼을 포함 하는 다양한 슬롯 심볼의 수를 통해 송신될 수 있다. BS는 채널 상태 정보 RS(channel state information RS; CSI-RS) 및 복조 RS(DM-RS)를 포함하는 여러 타입의 RS 중 하나 이상을 송신한다. CSI-RS는 UE들(예를 들면, UE)이 측정을 수행하고 채널 상태 정보(CSI)를 BS에게 제공하기 위한 것이다. 채널 측정이나 시간 추적을 위해, 넌-제로 전력 CSI-RS(NZP CSI-RS) 자원들이 사용될 수 있다. 간섭 측정 보고(IMR)의 경우, CSI 간섭 측 정(CSI-IM) 자원들이 사용될 수 있다. CSI-IM 자원들은 또한 ZP CSI-RS(zero power CSI-RS) 설정과 연관될 수 있다. UE는 gNB로부터 DL 제어 시그널링 또는 RRC 시그널링과 같은 상위 계층 시그널링을 통해 CSI-RS 수신 파 라미터를 결정할 수 있다. DM-RS는 일반적으로 각각의 PDCCH 또는 PDSCH의 BW 내에서만 송신되며 UE는 이 DM- RS를 사용하여 데이터 또는 제어 정보를 복조할 수 있다. UL 신호에는 정보 내용을 전달하는 데이터 신호들, UL 제어 정보(UCI)를 전달하는 제어 신호들, 데이터 또는 UCI 복조와 연관된 DM-RS, gNB가 UL 채널 측정을 수행할 수 있게 하는 SRS(sounding RS) 및 UE(예를 들면, UE)가 랜덤 액세스를 수행할 수 있게 하는 RA(random access) 프리앰블이 포함된다. UE는 각각의 PUSCH(physical UL shared channel) 또는 PUCCH(physical UL control channel)를 통해 데이터 정보 또는 UCI를 송신한다. PUSCH 또는 PUCCH는 하나의 슬롯 심볼을 포함하는 다양한 슬롯 심볼의 수를 통해 송신될 수 있다. UE가 데이터 정보와 UCI를 동시에 송신할 경우, UE는 PUSCH에서 둘 다를 다중화하거나, UE 능력에 따라, 적어도 전송이 서로 다른 셀들에서 이루어지는 경우 데이터 정보를 가진 PUSCH와 UCI를 가진 PUCCH를 모두 송신할 수 있다. UCI에는 PDSCH에서 데이터 전송 블록(TB)들 또는 코드 블록 그룹(CBG)들의 올바르거나 잘못된 검출을 나타내는 HARQ(hybrid automatic repeat request) ACK(acknowledgement) 정보, UE가 버퍼에 송신할 데이터를 가지고 있 는지 여부를 나타내는 스케줄링 요청(SR), 및 gNB가 UE로의 PDSCH/TB 또는 PDCCH/DCI 포맷 송신들을 위한 적절 한 파라미터들을 선택할 수 있게 하는 CSI 보고들이 포함된다. CSI 보고는 UE가 10% BLER과 같은 사전 결정된 블록 오류율(BLER)로 데이터 TB를 검출하기 위한 최대 변조 및 코딩 방식(MCS)을 gNB에게 알리는 CQI(ChannelQuality Indicator), MIMO(Multiple Input Multiple Output) 송신 원칙에 따라 다중 송신기 안테나의 신호를 결합하는 방식을 gNB에 알리는 프리코딩 매트릭스 지시자(PMI), CSI 보고를 획득하는데 사용되는 CSI-RS 자원 지시자(CRI), 및 PDSCH에 대한 송신 랭크를 나타내는 RI(Rank Indicator)를 포함한다. 특정 실시예들에서, UL RS는 DM-RS 및 SRS를 포함한다. DM-RS는 일반적으로 각각의 PUSCH 또는 PUCCH의 BW 내에서 송신된다. gNB는 DM-RS를 사용하여 각 PUSCH 또는 PUCCH의 정보를 복조할 수 있다. SRS는 gNB에게 UL CSI를 제공하고 TDD(Time Division Duplexing) 시스템의 경우 DL 송신을 위한 PMI를 제공하기 위해 UE에 의해 송신된다. 또한, 랜덤 액 세스 절차의 일부로서 또는 다른 목적을 위해 UE는 물리적 랜덤 액세스 채널(PRACH)을 송신할 수 있다. DL 송신 및 UL 송신은 DFT-스프레드-OFDM으로 알려진 DFT 프리코딩을 사용하는 변형을 포함하는 직교 주파수 분 할 다중화(OFDM) 파형에 기반할 수 있다. 도 6은 본 개시의 실시예들에 따른 직교 주파수 분할 다중화(OFDM)를 사용하는 예시적인 송신기 구조의 블록도 를 도시한 것이다. 도 7은 본 개시의 실시예들에 따른 OFDM을 사용하는 예시적인 수신기 구조의 블록도 를 도시한 것이다. 블록도에 도시된 송신기 구조 및 블록도에 도시된 수신기 구조는 도 2의 RF 트랜시버들(210a-210n) 및 도 3의 RF 트랜시버와 유사할 수 있다. 도 6의 예시적인 블록도 및 도 7의 블록도는 단지 예시를 위한 것이며 본 개시의 범위를 벗어나지 않고 다른 실시예들이 사용될 수 있다. 블록도에 도시된 바와 같이, DCI 비트 또는 데이터 비트와 같은 정보 비트가 인코더에 의해 인 코딩되고, 레이트 매처에 의해 할당된 시간/주파수 자원들에 레이트 매칭되고, 변조기에 의해 변조된 다. 후속적으로, 변조된 인코딩 심볼 및 복조 기준 신호(DMRS) 또는 CSI-RS가 BW 선택기 유닛으로부 터의 입력으로 SC 매핑 유닛에 의해 SC들에 매핑되고, 필터에 의해 IFFT(inverse fast Fourier transform)가 수행되고, CP 삽입 유닛에 의해 사이클릭 프리픽스(CP)가 부가되며, 결과 신호가 필터 에 의해 필터링되어 무선 주파수(RF) 유닛에 의해 송신 비트로서 전송된다. 블록도에 도시된 바와 같이, 수신된 신호가 필터에 의해 필터링되고, CP 제거 유닛이 CP를 제거하고, 필터가 FFT(fast Fourier transform)를 적용하고, SC 디매핑 유닛이 BW 선택 유닛에 의해 선택된 SC들을 디매핑하고, 수신된 심볼들이 채널 추정기 및 복조기 유닛에 의해 복조되고, 레이트 디매처가 레이트 매칭을 복원하고, 디코더가 결과 비트를 디코딩하여 정보 비트를 제공한다. 특정 실시예들에서, UE는 슬롯에서 다수의 DCI 포맷을 디코딩하기 위해 각각의 잠재적인 PDCCH 수신들에 대한 다수의 후보 위치들을 모니터링한다. DCI 포맷은 UE가 올바른 DCI 포맷 검출을 확인하도록 하기 위해 CRC(Cyclic Redundancy Check) 비트들을 포함한다. DCI 포맷 타입은 CRC 비트들을 스크램블하는 무선 네트워 크 임시 식별자(RNTI)에 의해서 식별된다. PDSCH 또는 PUSCH를 단일의 UE에 스케줄링하는 DCI 포맷의 경우, RNTI는 셀 RNTI(C-RNTI)이거나, 설정된 스케 줄링 RNTI(CS-RNTI)이거나, 또는 MCS-C-RNTI일 수 있으며, UE 식별자 역할을 한다. 다음 예들에서는, 필요한 경우 C-RNTI를 참조한다. UE는 일반적으로 USS(UE-specific search space)에 따라 C-RNTI에 의해 CRC 스크램 블링된 DCI 포맷들의 검출을 위한 PDCCH를 수신/모니터링할 수 있다. 시스템 정보(SI)를 전달하는 PDSCH를 스케줄링하는 DCI 포맷의 경우, RNTI는 SI-RNTI일 수 있다. 랜덤 액세스 응답(RAR)을 제공하는 PDSCH를 스케줄링하는 DCI 포맷의 경우, RNTI는 RA-RNTI일 수 있다. 페이징 정보를 제공 하는 PDSCH를 스케줄링하는 DCI 포맷의 경우, RNTI는 P-RNTI일 수 있다. 또한 다양한 제어 정보를 제공하고 공 통 탐색 공간(CSS)에 따라 모니터링되는 DCI 포맷과 연관된 여러 다른 RNTI들이 존재한다. 도 8은 본 개시의 실시예들에 따른 하향링크 제어 정보(DCI) 포맷에 대한 예시적인 인코딩 프로세스를 도 시한 것이다. 도 9는 본 개시의 실시예들에 따른 UE와 함께 사용하기 위한 DCI 포맷에 대한 예시적인 디코딩 프로세스를 도시한 것이다. 도 8의 인코딩 프로세스 및 도 9의 디코딩 프로세스는 단지 예시를 위한 것이며 다른 실시예들이 본 개시의 범위를 벗어나지 않고 사용될 수 있다. BS는 각각의 PDCCH에서 각 DCI 포맷을 개별적으로 인코딩하여 송신한다. 적용 가능한 경우, DCI 포맷이 의도된 UE에 대한 RNTI는 UE가 DCI 포맷을 식별할 수 있도록 하기 위해 DCI 포맷 코드워드의 CRC를 마스킹한다. 예를 들어, CRC는 16 비트 또는 24 비트를 포함할 수 있고, RNTI는 16 비트 또는 24 비트를 포함할 수 있다. 그렇지 않고, DCI 포맷에 RNTI가 포함되지 않는 경우, DCI 포맷에 DCI 포맷 타입 지시자 필드가 포함될 수 있다. 도 8에 도시된 바와 같이, (코딩되지 않은) DCI 포맷 비트들의 CRC가 CRC 계산 유닛을 사용하여 결정 되며, CRC는 CRC 비트들과 RNTI 비트들 사이의 XOR(exclusive OR) 연산 유닛을 사용하여 마스킹된다. XOR 연산은 XOR(0,0) = 0, XOR(0,1) = 1, XOR(1,0) = 1, XOR(1,1) = 0으로 정의된다. 마스킹된 CRC 비트들은 CRC 추가 유닛을 사용하여 DCI 포맷 정보 비트들에 추가된다. 인코더는 (테일 바이팅 컨벌루션 코딩 또는 폴라 코딩과 같은) 채널 코딩을 수행하며, 레이트 매처에 의한 할당된 자원들에 대한 레이트 매칭이 뒤따른다. 인터리빙 및 변조 유닛들은 QPSK와 같은 인터리빙 및 변조를 적용하며, 출력 제 어 신호가 송신된다. 도 9에 도시된 바와 같이, 수신된 제어 신호는 복조기 및 디-인터리버에 의해 복조 및 디-인터리빙된 다. BS 송신기에서 적용된 레이트 매칭은 레이트 매처에 의해 복원되며, 결과 비트들이 디코더에 의 해 디코딩된다. 디코딩 이후에, CRC 추출기는 CRC 비트들을 추출하고 DCI 포맷 정보 비트를 제공한 다. DCI 포맷 정보 비트들은 RNTI(적용 가능한 경우)와의 XOR 연산에 의해 디-마스킹되며, CRC 검사 가 유닛에 의해 수행된다. CRC 검사가 성공하면(체크섬이 0), 디코딩이 올바로 된 것이고, DCI 포맷이 검 출되며, DCI 포맷 정보 비트들이 유효한 것으로 간주된다. CRC 검사가 성공하지 못하면, 디코딩이 올바르지 않 게 된 것이고, DCI 포맷이 검출되지 않으며, DCI 포맷 정보 비트들이 유효하지 않은 것으로 간주된다. 특정 실시예들에서는, PDCCH 송신이 PRB 세트 내에서 이루어질 수 있다. BS는 PDCCH 수신을 위해, 제어 자원 세트(CORESET)라고도 하는 PRB 세트들 중의 하나 이상의 세트로 UE를 설정할 수 있다. PDCCH 수신은 CORESET에 포함된 CCE(control channel element)들에서 수신될 수 있다. UE는 제 1 PDCCH 모니터링 타입에 따라 또는 제 2 PDCCH 모니터링 타입에 따라 PDCCH를 모니터링할 수 있다. 슬롯 당 PDCCH 모니터링을 위한 UE 능력에 대응하는 제 1 PDCCH 모니터링 타입에 대해, 슬롯 당 PDCCH 후보의 최대 수 및 PDCCH 후보 수신을 위한 비-중첩 CCE의 최대 수 가 정의된다. 비-중첩 CCE들은 인덱스가 다르거나 CORESET의 심볼이 다르거나 또는 CORESET가 다른 CCE들이다. 특정 실시예들에서, UE는 탐색 공간에 기초하여 PDCCH 후보를 디코딩하기 위한 CCE들을 결정한다. 일부 RNTI의 경우(예를 들면, C-RNTI), 각각의 DCI 포맷들에 대한 PDCCH 후보 세트가 대응하는 UE 특정 탐색 공간(USS) 세트 들을 정의한다. 다른 RNTI들의 경우(예를 들면, SI-RNTI), 각각의 DCI 포맷들에 대한 PDCCH 후보 세트가 대응 하는 공통 탐색 공간 세트들(CSS 세트들)을 정의한다. 탐색 공간 세트는 UE가 탐색 공간 세트에 대한 PDCCH 후 보들을 모니터링하는 CORESET과 연관된다. UE는 서빙 셀 당 C-RNTI에 의해 CRC 스크램블링되는 최대 3개 크기 의 DCI 포맷들을 포함하는 최대 4개 크기의 DCI 포맷들에 대한 PDCCH 후보들을 모니터링하는 것으로 예상한다. UE는 대응하는 활성 DL BWP(bandwidth part)에 대한 각각의 탐색 공간 세트들에서 설정된 PDCCH 후보의 수에 기 초하여, 서빙 셀 당 DCI 포맷에 대한 크기의 수를 카운트할 수 있다. CORESET 와 연관된 탐색 공간 세트 에 대해, 캐리어 지시자 필드 값 에 대응하는 서빙 셀의 활성 DL BWP를 위한 슬롯 에서 탐색 공간 세트의 PDCCH 후보 에 대응하는 어그리게이션 레벨 에 대한 CCE 인 덱스는 다음 수학식 1과 같이 주어진다. 수학식 에 기재된 바아 같이, 임의의 CSS에 대해, 이다. 마찬가지로, USS의 경우, 이고, 이고, 에 대해 이고, 에 대해 이고, 에 대해 이며, 또한 이다. 또한, 수학식 1에 기재된 바와 같이, 이고, 은 CORESET 에서 0부터 까지 번호가 매겨진 CCE의 수이다. 유사하게, 은 UE가 PDCCH가 모니터링되는 서빙 셀에 대한 캐리 어 지시자 필드로 설정된 경우 캐리어 지시자 필드 값이고; 그렇지 않은 경우, 임의의 CSS에 대하여, 인 것을 포함한다. 수학식 1에 기재된 표현 은 임을 보여주며, 여기서 은 에 대응하는 서빙 셀에 대한 탐색 공간 세트 의 어그리게이션 레벨 에 대해 UE가 모니터링하도록 구성된 PDCCH 후보의 수이다. USS의 경우, 은 탐색 공간 세트 의 CCE 어그리게이션 레벨 에 대해 설정된모든 값들에 대한 의 최대값이다. 또한, 에 사용되는 RNTI 값은 C-RNTI이다. [수학식 1]"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "특정 실시예들에서, UE(예를 들면, UE)는 프라이머리 셀로 지칭되는 하나의 에서만 시스템 정보, 랜덤 액 세스 응답 또는 페이징을 제공하는 PDSCH를 스케줄링하기 위한 CSS에 따라 PDCCH를 모니터링한다. UE는 프라이 머리 셀에서만 PUCCH를 송신한다. 특정 실시예들에서, UE는 PUCCH 송신들을 위한 PSCell(primary secondary cell)로 설정된다. UE가 PSCell로 설정된 경우, UE는 마스터/프라이머리 셀 그룹에 대해 프라이머리 셀에서 PUCCH를 송신하고, 세컨더리 셀 그룹에 대해 PSCell에서 PUCCH를 송신한다. 간결함을 위해, 본 개시의 실시예 들에 대한 설명들이 프라이머리 셀을 고려하지만, 이 실시예들은 PSCell로 직접 확장될 수 있다. 특정 실시예들에서, UE(예를 들면, UE)는 UE에 대한 후속 스케줄링 어트리뷰트들을 결정하는 정보를 제공 하는 DCI 포맷들에 대해 PDCCH를 모니터링하도록 설정된다. 예를 들어, DCI 포맷 2_0은 다수의 슬롯에 걸쳐 DL, UL 또는 예비된 심볼 측면에서, 슬롯의 구조를 제공한다. 이 예에서, UE는 주기적 또는 반지속적 CSI(P/SP-CSI) 보고에 따라 또는 SR에 따라, 주기적 또는 반지속적 SRS(P/SP-SRS)에 따라, 또는 PRACH에 따라 설정된 그랜트 (CG-PUSCH), PUCCH와 같은 상위 계층에 의해 설정된 채널 또는 신호들을 송신할지 여부를 결정하 기 위한 정보를 사용하는 것으로 예상된다. 또한, DCI 포맷 2_0은 DCI 포맷 2_0을 갖는 PDCCH의 다음 수신까지 UE가 다수의 슬롯에 걸쳐 사용할 다수의 설정된 세트의 탐색 공간 세트로부터, 일 세트의 탐색 공간 세트에 대 한 제공할 수 있다. 공유 스펙트럼에 따른 동작을 위해, DCI 포맷 2_0은 채널 점유 시간(channel occupancy time, COT) 듀레이션에 대한 정보도 포함할 수 있다. 일반적으로, DCI 포맷 2_0은 gNB에서 UE에 의한 수신 또 는 송신과 연관된 여러 컴포넌트들을 적응시키는데 사용될 수 있다. 불연속 수신(DRX) 모드 동작으로 설정된 UE(예를 들면, UE)는 또한 DCI 포맷의 검출을 위해 PDCCH를 모니 터링하도록 설정될 수 있으며, 이 DCI 포맷은 UE가 다음 DRX 사이클 동안에 drx-onDurationTimer를 시작할 것으 로 예상되는지 여부에 대한 정보를 제공하는 DCI 포맷 2_6으로 지칭된다. drx-onDurationTimer는 DRX 사이클 시작 시의 듀레이션이다. DCI 포맷 2_6은 또한 UE에 대해 설정된 SCell들의 대응 그룹들에 대한 비트맵을 포함 할 수 있으며 여기서 비트맵의 비트는 현재 활성 DL BWP가 휴면 DL BWP인 경우, 설정된 SCell들의 해당 그룹에 서 활성화된 각 SCell에 대해 활성 DL BWP가 UE에 대해 휴면 BWP인지 활성(비휴면) DL BWP인지를 나타내거나, 또는 현재 활성 DL BWP가 휴면 DL BWP가 아닌 경우, 설정된 SCell들의 해당 그룹에서 활성화된 각 SCell에 대한 UE의 현재 활성 DL BWP를 나타낸다. UE는 SCell의 휴면 BWP에서는 PDCCH를 모니터링하지 않을 수 있다. 특정 실시예들에서, UE(예를 들면, UE)는 UE들이 PUSCH 송신 또는 SRS 송신과 같은 송신들을 취소할 필요 가 있는 시간-주파수 자원들을 나타내는 DCI 포맷 2_4를 모니터링하도록 설정된다. 3GPP TS 38.213 v16.2.0, \"NR; Physical Layer Procedures for Control\"에 기재된 바와 같이, UE는 모니터링된 PDCCH 후보들의 대응하는 총 수, 또는 스케줄링된 셀 당 수가 되는 CSS 세트들 및 슬롯 당 대응 최대 수를 초과 하는 슬롯 당 비-중첩 CCE들을 설정받을 것으로 예상하지 않는다. 동일한 셀 스케줄링 또는 스케줄링 셀과 스 케줄링된 셀(들)이 동일한 SCS 설정 를 가진 DL BWP들을 갖는 교차-캐리어 스케줄링의 경우, UE는 슬롯 당 세컨더리 셀에서 모니터링할 수 있는 대응하는 수보다 더 클 것으로, PDCCH 후보의 수 및 세컨더리 셀의 슬롯 당 대응하는 비-중첩 CCE의 수를 예상하지 않는다. 교차-캐리어 스케줄링의 경우, 모니터링을 위한 PDCCH 후보 의 수 및 슬롯 당 비-중첩 CCE의 수는 스케줄링된 셀별로 개별 카운트된다. 슬롯 내의 모든 탐색 공간 세트에 대해, 카디널리티(cardinality)가 인 일 세트의 CSS 세트들을 로 표기하고 카디널리티가 인 일 세트의 USS 세트들을 로 표기한다. 내의 USS 세트들 ( )의 위치 탐색 공간 세트 인덱스의 오름차순에 따른다. CSS 세트 를 모니터링하기 위 해 카운트된 PDCCH 후보의 수를 로 표기하고( ), USS 세트 를 모니터링하기 위해카운트된 PDCCH 후보의 수를 로 표기한다( ). CSS 세트들의 경우, UE는 슬롯에서 총 개의 비-중첩 CCE를 요구하는 개의 PDCCH 후보들을 모니터링한다. UE는 표 1에 나타나 있고 3GPP TS 38.213 v16.2.0, \"NR; Physical Layer Procedures for Control\"에 기재된 다 음 의사 코드에 따라 슬롯 n에서 SCS 설정 를 가진 활성 DL BWP를 갖는 프라이머리 셀에 대한 USS 세트들에 대하여 모니터링하기 위한 PDCCH 후보들을 할당한다. 탐색 공간 세트 에 대한 비-중첩 CCE들의 세트를 로 표기하고, 의 카디널리티를 로 표기하며 여기서 탐색 공간 세트 에 대한 비-중첩 CCE들은 CSS 세트들을 모니터링하기 위해 할당된 PDCCH 후보들과 모든 탐색 공간 세트 ( )를 모니터링하기 위해 할당된 PDCCH 후보들을 고려하여 결정된다. 표 1 Set"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "Set Set while AND allocate PDCCH candidates for monitoring to USS set end while UE에 의한 수신 또는 송신과 연관된 파라미터들에 대한 정보를 UE에게 제공하는 DCI 포맷과 유사하게, UE(예를 들면, UE)는 브로드캐스트 또는 그룹캐스트 PDSCH 송신을 스케줄링하는 DCI 포맷의 검출을 위해 PDCCH를 모니터링하도록 설정될 수 있다. 이러한 DCI 포맷은 또한 UE 그룹으로부터의 각각의 UE에 대한 PUCCH 자원을 포함하지 않을 수 있거나 또는 하향링크 할당 인덱스(DAI)를 포함하지 않을 수 있는 등이다. 추가적으로, UE가 DCI 포맷의 검출에 관한 확인 응답 정보 보고를 제공해야 하기 전에 UE가 검출해야 할 다른 DCI 포맷이 없을 수 있다. UE에 의한 수신 또는 송신과 연관된 파라미터들에 대한 정보를 제공하는 DCI 포맷을 UE가 검출하지 못하는 경우, UE는 UE와 gNB가 동일한 이해를 갖도록 서빙 gNB에 알리는 것이 유리할 수 있다. 이러한 정보는 DCI 포 맷의 검출 여부에 대한 확인 응답 정보로 고려될 수 있다. UE는 DCI 포맷의 올바른 또는 잘못된 검출에 대한 응답으로 HARQ-ACK 정보(제 1 HARQ-ACK 정보 타입)를, 전송 블록의 올바른 또는 잘못된 검출에 대한 응답인 HARQ-ACK 정보(제 2 HARQ-ACK 정보 타입)와 함께 보고해야 할 수 있다. HARQ-ACK 정보 보고는 Type-1 HARQ-ACK 코드북 또는 Type-2 HARQ-ACK 코드북과 같은 여러 코드북 타 입 중 하나를 기반으로 할 수 있다. PUCCH 자원 결정과 HARQ-ACK 코드북 결정은 두 HARQ-ACK 정보 타입들에 따라 다를 수 있다. 그 이유는 UE 그룹에 대한 정보를 제공하거나 UE 그룹에 의한 PDSCH 수신을 스케줄링하는 DCI 포맷은, UE 그룹으로부터의 각 UE에 대한 PUCCH 자원을 지시하는 필드를 포함하지 않거나 또는 하향링크 할 당 인덱스(DAI)를 포함하지 않을 수 있는 등일 수 있기 때문이다. 또한, UE가 DCI 포맷을 검출하지 못하는 경 우, UE가 DCI 포맷 검출에 대한 HARQ-ACK 정보를 제공해야 하기 전에 검출해야 할 다른 DCI 포맷이 없을 수 있 다. 특정 실시예들에서, UE는 수학식 에 기재된 바와 같은 인덱스 을 가진 PUCCH 전력 제어 조정 상태를 사용 하여 셀 내의 캐리어 의 활성 UL BWP 에 대한 PUCCH 송신 전력을 결정한다. [수학식 2]"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 는 최대 송신 전력이고, 는 공칭 수신 전력이고, 는 1 이 5 kHz에 대응하는 서브-캐리어 간격(SCS) 설정이고, 은 PUCCH 송신을 위한 RB의 수이고, 은 측정된 경로 손실이고, 은 PUCCH 포맷을 포함하는 PUCCH 송신을 위한 여러 파라미터에 의존하고, 은 스펙트럼 효율에 따른 조정을 제공하며, 는 DCI 포맷들에서 UE가 수신하는 송신 전력 제어(TPC) 명령 값들에 기반한 폐루프 전력 제어 상태이다. UE는 또한 PUSCH 송신에서 HARQ-ACK 정보를 다중화할 수도 있다. 그 후에, UE는 HARQ-ACK 정보 비트의 수, PUSCH 송신의 스펙트럼 효율 및 스케일링 팩터 에 기초하여 HARQ-ACK 정보에 대한 코딩된 변조 심 볼의 수를 결정한다. 또한, UE는 서빙 gNB가 PUSCH 송신에 HARQ-ACK 정보를 다중화할 것으로 예상하지만 UE가 HARQ-ACK 정보와 연관된 DCI 포맷을 검출하지 못하는 오류 이벤트를 피하도록, 다수의 HARQ-ACK 정보 비트(예를 들면, 2 비트)를 다중화하기 위해 PUSCH 송신에서 다수의 RE를 예비할 수 있다. PDSCH 수신이 단일 UE에 의하는 경우, 이것은 유니캐스트 PDSCH 수신으로 지칭될 수 있다. PDSCH 수신이 UE 그 룹에 의하는 경우, 이것은 그룹캐스트 또는 멀티캐스트 PDSCH 수신으로 지칭될 수 있다. 특정 실시예들에서, UE는 유니캐스트 PDSCH 및 그룹캐스트 PDSCH 모두를 수신하도록 설정될 수 있다. UE가 유니캐스트 PDSCH 수신 또는 PUSCH 송신을 스케줄링하는 DCI 포맷 검출을 위한 PDCCH 모니터링과 별도로 또는 PDCCH 모니터링과 함께, 그룹캐스트 PDSCH 수신을 스케줄링하는 DCI 포맷 검출을 위한 PDCCH를 모니터링하기 위한 절차가, PDCCH 모니터 링을 위한 UE 능력의 한계를 고려하여 정의될 필요가 있다. 또한, 유니캐스트 PDSCH 수신을 위한 HARQ-ACK 정 보 보고와 별도로 또는 HARQ-ACK 정보 보고와 함께, 그룹캐스트 PDSCH 수신을 위한 HARQ-ACK 정보 보고에 대해 서도 정의될 필요가 있다. 따라서, 본 개시의 실시예들은 DCI 포맷의 올바른/잘못된 검출에 대한 응답으로 UE가 확인 응답 정보를 보고하 는 절차를 정의할 필요가 있음을 고려한다. 본 개시의 실시예들은 DCI 포맷의 올바른/잘못된 검출에 대한 응답인 HARQ-ACK 정보와 전송 블록의 올바른/잘못 된 검출에 대한 응답인 HARQ-ACK 정보를 다중화하는 절차를 정의할 다른 필요가 있음을 고려한다. 본 개시의 실시예들은 일반적으로 상이한 타입의 PDSCH 수신에 응답하여 그리고 특히 유니캐스트 PDSCH 수신 및 특히 그룹캐스트 PDSCH 수신에 응답하여 UE가 HARQ-ACK 정보를 다중화하기 위한 절차를 정의할 다른 필요가 있 음을 고려한다. 또한, 본 개시의 실시예들은 공통 제어 정보를 제공하는 DCI 포맷, 그룹캐스트 PDSCH 수신을 스케줄링하는 DCI 포맷, 및 유니캐스트 PDSCH 수신 또는 PUSCH 송신을 스케줄링하는 DCI 포맷의 검출을 위해 PDCCH를 모니터링하기 위한 UE 절차를 정의할 필요가 있음을 고려한다. 따라서, 본 개시의 실시예들은 DCI 포맷의 올바른/잘못된 검출에 대한 응답으로 UE가 확인 응답 정보를 보고하 는 절차를 정의하는 것에 관한 것이다. 본 개시는 또한 DCI 포맷의 올바른/잘못된 검출에 대한 응답인 HARQ- ACK 정보 및 전송 블록의 올바른/잘못된 검출에 대한 응답인 HARQ-ACK 정보를 다중화하는 절차를 정의하는 것에 관한 것이다. 본 개시는 또한 일반적으로 상이한 타입들의 PDSCH 수신에 응답하여 그리고 특히 유니캐스트 PDSCH 수신 및 특히 그룹캐스트 PDSCH 수신에 응답하여 UE가 HARQ-ACK 정보를 다중화하기 위한 절차를 정의하는 것에 관한 것이다. 또한, 본 개시는 공통 제어 정보를 제공하는 DCI 포맷, 그룹캐스트 PDSCH 수신을 스케줄링 하는 DCI 포맷, 및 유니캐스트 PDSCH 수신 또는 PUSCH 송신을 스케줄링하는 DCI 포맷의 검출을 위해 PDCCH를 모 니터링하는 UE 절차를 정의하는 것에 관한 것이다. 이하에서 사용되는, \"DCI 포맷 A\"라는 용어는 PDSCH 수신 스케줄링과 연관된 RNTI에 의해 스크램블링되지 않는 CRC를 갖는 DCI 포맷을 지칭하기 위해 사용된다. \"DCI 포맷 B\"는 그룹캐스트 PDSCH 수신 스케줄링과 연관된 RNTI에 의해 스크램블링되는 CRC를 갖는 DCI 포맷을 지칭하는데 사용된다. DCI 포맷 B는 유니캐스트 PDSCH 수 신 스케줄링에 사용되는 DCI 포맷과 동일한 크기를 가질 수 있으며, G-RNTI로 지칭되는 별도로 설정된 RNTI를 갖거나 또는 그룹캐스트 PDSCH 수신 스케줄링을 식별하기 위한 플래그를 포함한다는 것에 유의한다. 그룹캐스 트 PDSCH 수신을 G-PDSCH라고 하고, 유니캐스트 PDSCH 수신을 U-PDSCH라고 한다. 또한, 이하에서 사용되는, 유니캐스트 PDSCH 수신을 스케줄링하는 DCI 포맷들과 연관된 HARQ-ACK 정보에 대한 언급은, 유니캐스트 수신이지만, SPS(Semi-Persistent Scheduling) PDSCH 릴리스의 수신 또는 PDSCH 수신을 스 케줄링하지 않고 셀 그룹 내의 UE에 대한 휴면/비휴면 활성 DL BWP를 대신에 지시하는 PDSCH 수신 스케줄링과 연관된 RNTI에 의해 스케줄링되는 CRC를 갖는 DCI 포맷에 대해 사용된다. 또한, \"상위 계층\"이라는 용어는 UE가 PDSCH 수신에서 제공받는, RRC 또는 MAC(medium access control) 제어 요소(CE)와 같은 제어 정보를 나타내기 위해 사용된다. 본 개시의 실시예들은 DCI 포맷 A의 검출에 대한 HARQ-ACK 정보에 대해 설명한다. 도 10 및 도 11에서 설명되 는 바와 같은 다음의 실시예들 및 예들은 DCI 포맷 A의 검출에 대한 HARQ-ACK 정보에 대해 설명한다. 본 개시의 실시예는 DCI 포맷 A의 올바른/잘못된 검출에 대한 응답으로 UE가 확인 응답 정보를 보고하는 절차를 설명한다. 특정 시나리오에서 UE는 CSS에 따라 DCI 포맷 A를 검출하기 위해 PDCCH를 모니터링하지만, 이것이 필수 조건은 아니다. 본 개시의 실시예들은 HARQ 프로세스와 연관된 전송 블록이 없는 것으로 고려한다. 따라서, DCI 포맷 A의 검출 에 대한 확인 응답 정보는 기존의 HARQ-ACK 정보와 다르다. 공통 기준 프레임워크에 있어서, HARQ-ACK라는 용 어는 HARQ 프로세스에 대한 전송 블록의 올바르거나 잘못된 검출에 응답하고 DCI 포맷의 올바르거나 잘못된 검 출에 응답하는(후자에는 'HARQ'라는 용어가 적용되지 않는다는 이해 하에) HARQ-ACK 정보를 일반적으로 지칭하 는데 사용된다. 특정 실시예들에서, DCI 포맷 A의 올바른/잘못된 검출에 응답하여 HARQ-ACK 정보를 보고하기 위한 UE 절차는 모 든 적용 가능한 DCI 포맷에 대해 동일할 수 있거나 또는 특정 DCI 포맷에 의존할 수 있다. 예를 들어, DCI 포 맷 A가 셀 상의 슬롯 구조에 대한 정보를 제공하거나 PDCCH 모니터링을 위한 탐색 공간 세트들 간 스위칭을 위 한 DCI 포맷 2_0이거나, 또는 DCI 포맷 2_4에 의해 지시되는 시간-주파수 자원들에서의 송신 취소를 나타내는 DCI 포맷 2_4이거나, 또는 그룹캐스트 SPS PDSCH 수신을 활성화 또는 비활성화하는 DCI 포맷인 경우와 같이, DCI 포맷 A가 셀 상의 RRC 연결을 가진 모든 UE에 적용될 수 있는 경우, 모든 UE에게 공통 PUCCH 자원을 제공 하는 것이 바람직할 수 있으며, 또한 값이 NACK(negative acknowledgement)(해당 PDCCH MO에서 UE가 DCI 포맷 A를 검출하지 못함)인 경우에만 UE가 HARQ-ACK 정보를 제공하는 것이 바람직할 수 있다. 이러한 HARQ-ACK 정보 를 통해 서빙 gNB는 DCI 포맷 A를 검출할 수 없는 UE가 있는지 여부를 판정할 수 있으며, 이에 따라 서빙 gNB는 DCI 포맷 A로 PDCCH 송신에 사용되는 CCE 어그리게이션 레벨이나 전력을 조정할 수 있다. RRC 연결을 갖는 UE 그룹(예를 들어, 도 1의 임의의 UE)에 적용 가능한 DCI 포맷 A의 경우(예를 들어, DCI 포맷 A가 다음 DRX 사이클에서 PDCCH를 모니터링할지 또는 UE의 셀 그룹에 대한 활성 DL BWP가 비휴면 DL BWP인지 또 는 휴면 DL BWP인지 여부에 대한 정보를 UE 그룹의 UE에게 제공하는 DCI 포맷 2_6인 경우, 또는 DCI 포맷 A가 그룹캐스트 SPS PDSCH 수신을 활성화 또는 비활성화하는 DCI 포맷인 경우), 예를 들어 해당 UE 특정 RRC 시그널 링에 의해서, UE 그룹의 각 UE에 대해 UE 특정 PUCCH 자원을 제공함으로써 서빙 gNB에서 UE가 DCI 포맷을 검출 했는지 여부를 알 수 있도록 하는 것이 일반적으로 바람직하다. 예를 들어, UE(예를 들면, UE)가 셀 그룹에 대한 활성 DL BWP들로서 비휴면 DL BWP들을 지시받고 셀 그룹에 대한 현재 활성 DL BWP들이 휴면 DL BWP들인 경우, NACK 값을 포함하는 HARQ-ACK 정보를 통해 gNB가 UE를 식별하고 셀 그룹에 UE를 스케줄링하는 것을 피할 수 있으며, 이에 의해 해당 자원 낭비를 방지할 수 있다. HARQ-ACK 정보에 NACK 값만, 또는 ACK 값만, 또는 ACK 또는 NACK 값을 제공하는 UE 동작은 시스템 동작에서 지 정되거나 또는 상위 계층들에 의해서 서빙 gNB에 의해 설정될 수 있다. HARQ-ACK 정보를 제공하거나 제공하지 않는 UE 동작도 또한 상위 계층들에 의해서 서빙 gNB에 의해 설정될 수 있다. UE가 제공하는 HARQ-ACK 정보 값 에 대한 UE 동작과 무관하게, HARQ-ACK 정보를 포함하는 PUCCH 송신을 위한 해당 PUCCH 자원이 각 UE에 대하여 개별적으로 제공된다. DCI 포맷 A의 검출에 대한 응답으로 HARQ-ACK 정보를 포함하는 PUCCH를 송신하기 위해 UE들로부터 공통 PUCCH 자원이 사용되는 경우(예를 들어, 그 값이 NACK인 경우에만), UE에 의한 PUCCH 자원 결정은 암시적 시그널링, 또는 명시적 시그널링, 또는 암시적 및 명시적 시그널링의 조합에 기초할 수 있다. UE는 해당 탐색 공간 세트 들의 설정에 기초하거나, 또는 상위 계층 시그널링에 의해 추가로 설정/지시되거나 특정 기능에 대한(예를 들어 그룹캐스트 SPS PDSCH 수신을 활성화 또는 비활성화하는 DCI 포맷 A에 대한) 시스템 동작 사양들에 정의된 MO들 에 기초하여 해당 PDCCH 모니터링 오케이전(MO)들에서 DCI 포맷 A를 검출하지 못한 경우, DCI 포맷 A에 대한 검 출 부존재를 결정할 수 있다. 제 1 접근 방식에서는, 명시적 시그널링을 위해, 상위 계층들에서 PUCCH 자원의 설정을 제공할 수 있다. 예를 들어, PUCCH 자원이 DCI 포맷의 내용에 대한 구성의 일부일 수 있거나, DCI 포맷의 검출을 위한 PDCCH 모니터링 에 사용되는 탐색 공간 세트들의 구성의 일부일 수 있거나, 또는 PUCCH 송신들을 위한 PUCCH 구성의 일부일 수 있다. 제 2 접근 방식에서는, 암시적 시그널링을 위해, UE(예를 들면, UE)가 DCI 포맷 A를 제공하는 PDCCH 후보 들의 수신에 사용되는 CCE들 중에서 가장 낮은 인덱스를 가진 CCE에 기초하여 설정된 PUCCH 자원 세트로부터 PUCCH 자원을 결정할 수 있다. 설정된 PUCCH 자원 세트는 예를 들어 시스템 정보 블록에서와 같은 UE 공통 RRC 시그널링에 의해 제공되거나, 또는 예를 들어 C-RNTI에 의해 스크램블링되는 CRC를 갖는 DCI 포맷에 의해 스케 줄링된 PDSCH 수신에서와 같은 UE 특정 RRC 시그널링에 의해 제공될 수 있다. PUCCH 자원 세트는 최대 2 비트 를 포함하는 HARQ-ACK 정보 보고와 연관된 것일 수 있다. UE가 DCI 포맷 A에 대한 해당 HARQ-ACK 정보가 NACK 값을 갖는 경우에만 PUCCH를 송신하는 경우, 요구 사항은 UE가 예를 들어 제 1 CCE 어그리게이션 레벨을 갖는 하나의 PDCCH 후보 및 제 1 CCE 어그리게이션 레벨과 다른 제 2 CCE 어그리게이션 레벨을 갖는 제 2 PDCCH 후보 와 같은, 동일한 가장 낮은 CCE 인덱스를 갖는 PDCCH 후보만을 모니터링하는 것이다. 이러한 경우, 암시적 PUCCH 자원 결정은 명시적 PUCCH 자원 결정과 유사하며, 그 이유는 UE는 해당 CCE 어그리게이션 레벨에 대해 동 일한 가장 낮은 CCE 인덱스를 갖는 하나 이상의 PDCCH 후보 중 가장 낮은 CCE 인덱스에 기초하여 사전 결정된 PUCCH 자원을 사용하기 때문이다. 예를 들어, 개의 PUCCH 자원을 포함하는 PUCCH 자원 세트에 대해, UE는 인덱스 을 갖는 PUCCH 자원을 결정할 수 있다(여기서 ). 인 경우, 인덱스 이 수학식 3에 기재되어 있다. 대안적으로, 인 경우, 인덱스 이 수학 식 4에 기재되어 있다. [수학식 3]"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "[수학식 4]"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 3, 4 모두에서, 은 DCI 포맷 A를 갖는 PDCCH 수신의 CORESET 내 CCE 수이고, 은 CORESET 내 PDCCH 후보의 가장 낮은 CCE 인덱스이고, 은 DCI 포맷 A 내 PUCCH 자원 지시자 필드의 값이며(존재하는 경우); 그렇지 않은 경우, 이다. 도 10은 본 개시의 실시예들에 따른 UE가 DCI 포맷 A의 검출에 대한 HARQ-ACK 정보를 제공하기 위한 예시적인 방법을 도시한 것이다. 예를 들어, 방법의 단계들은 도 1의 UE들(111-116) 중의 임의의 UE(예를 들면, 도 3의 UE)에 의해 수행될 수 있으며, 상보적 프로세스가 BS(예를 들면, BS)에 의해 수행될 수 있다. 도 10의 방법은 단지 예시를 위한 것이며 본 개시의 범위를 벗어나지 않고 다른 실시예들이 사용 될 수 있다. 단계 1010에서, UE(예를 들면, UE)는 DCI 포맷 A의 검출을 위해 PDCCH를 모니터링하기 위한 탐색 공간 세 트들에 대한 설정을 수신한다. PDCCH MO에서 UE는 PDCCH 후보들을 수신하고 DCI 포맷 A의 크기 및 RNTI에 따라 이 정보를 디코딩한다(단계 1020). 단계 1030에서, UE는 PDCCH MO에서 DCI 포맷 A가 검출되었는지 여부를 판정한다. UE가 DCI 포맷 A를 검출한 것 에 응답하여, UE는, 단계 1040에서 HARQ-ACK 정보를 포함하는 PUCCH를 송신하지 않는다. 대안적으로, UE가 DCI 포맷 A를 검출하지 못한 것에 응답하여, UE는, 단계 1050에서, HARQ-ACK 정보를 포함하는 PUCCH를 송신한다. 방법에 기재된 바와 같이, PUCCH 송신을 위한 PUCCH 자원이 상위 계층들에 의해 UE에게 제공되거나 또는 설정된 PUCCH 자원 세트로부터의 다른 파라미터들에 기초하여 UE에 의해 암시적으로 결정된다. UE가 DCI 포맷 A를 검출하지 못한 경우의 HARQ-ACK 정보는 NACK 값을 갖는 것으로 해석된다. 특정 실시예들에서, DCI 포맷 A의 검출에 대한 응답으로 HARQ-ACK 정보를 포함하는 PUCCH를 송신하기 위해 UE 특정 PUCCH 자원이 UE에 의해 사용될 때(예를 들어, HARQ-ACK 정보 값이 ACK 또는 NACK일 때), UE에 의한 PUCCH 자원 결정은 암시적 시그널링, 또는 명시적 시그널링, 또는 암시적 및 명시적 시그널링의 조합에 기초할 수 있다. UE는 DCI 포맷 A의 검출을 위한 PDCCH MO들에서 DCI 포맷 A를 검출하지 못하는 경우, 해당 탐색 공간 세트들의 설정에 기초하거나 또는 DCI 포맷 A 검출에 대한 응답으로 HARQ-ACK 정보를 제공하도록 UE가 설정되는 DCI 포맷 A의 기능에 대한 별도의 설정에 기초하여, DCI 포맷 A에 대한 검출 부존재를 결정할 수 있다. 제 1 접근 방식에서는, 명시적 시그널링을 위해, 상위 계층들에서 PUCCH 자원의 설정을 제공할 수 있다. 예를 들어, PUCCH 자원은 최대 2개의 HARQ-ACK 정보 비트의 송신에 사용되는 PUCCH 자원 세트의 UE에 대한 설정의 일 부일 수 있다. PUCCH 자원은 자원을 사용하는 PUCCH 송신에서 DCI 포맷 A 검출에 응답하여 HARQ-ACK 정보를 다 중화하기 위해, PUCCH 자원 세트와 별도로 설정될 수 있거나, 또는 자원은 자원 세트 중의 사전 결정된 자원(예 를 들면, 제 1 자원)일 수 있다. UE가 DCI 포맷 A를 검출하지 못하는 경우, UE는 NACK 값을 제공하는 PUCCH를 송신하지 않을 수 있거나(그러면 서빙 gNB는 PUCCH에 대한 DTX(discontinuous transmission)를 검출할 수 있음), 또는 UE는 예를 들어 DCI 포맷 A 검출과 관련된 설정 파라미터들의 일부로서 상위 계층들에 의해 UE에게 제공될 수 있는 대응하는 설정 주기 및 오프셋에 기초하여, DCI 포맷 A를 갖는 PDCCH가 송신되었다고 가정할 수 있는 경우 그러한 PUCCH를 송신할 수 있다. UE가 DCI 포맷 A를 검출하지 못한 경우 NACK 값을 포함하는 PUCCH 를 송신하거나 또는 PUCCH를 송신하지 않는 UE 동작은, 시스템 동작에서 지정되거나 상위 계층들에 의해 서빙 gNB로부터 UE에 설정될 수 있다. 제 2 접근 방식에서는, 암시적 시그널링을 위해, UE(예를 들면, UE)가 예를 들어 UE 공통 또는 UE 특정 RRC 시그널링에 의해, 또는 DCI 포맷 A 설정의 일부로서, PUCCH 자원 세트를 제공받을 수 있다. PUCCH 자원 세 트의 수신 시에, UE는 DCI 포맷 A에서 UE에 대한 정보의 위치에 기초하여, HARQ-ACK 정보를 포함하는 PUCCH 송 신을 위한 PUCCH 자원 세트로부터 PUCCH 자원을 결정할 수 있다. 예를 들어, DCI 포맷 A가 CRC 비트들을 제외 한 비트의 크기를 갖고 수학식 에 기재된 바와 같은 필드들을 포함하는 경우, UE는 PUCCH 자원 세트로 부터 인덱스 을 가진 자원을 사용할 수 있다. 명시적 시그널링의 경우와 유사하게, UE는 DCI 포맷 A를 검출하지 못한 경우 PUCCH를 송신하지 않거나 NACK 값을 제공하는 PUCCH를 송신할 수 있으며, 동일한 절차들이 적용될 수 있다. [수학식 5]"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서, 은 DCI 포맷 A에서 어떤 필드에도 사용되지 않는 비트 수이고, 은 각 필드에 대한 비트 수이며, UE에 대한 정보가 있는 제 1 필드는 인덱스 를 가지며, 여기서 이 다. 도 11은 본 개시의 실시예들에 따른 UE가 HARQ-ACK 정보를 제공하기 위한 예시적인 방법을 도시한 것이다. 특히, 방법은 DCI 포맷 A의 검출 또는 DCI 포맷 A의 검출 실패에 대한 HARQ-ACK 정보를 제공하 는 UE를 설명한다. 예를 들어, 방법의 단계들은 도 1의 UE들(111-116) 중의 임의의 UE(예를 들면, 도 3 의 UE)에 의해 수행될 수 있으며, 상보적 프로세스가 BS(예를 들면, BS)에 의해 수행될 수 있다. 도 11의 방법은 단지 예시를 위한 것이며 본 개시의 범위를 벗어나지 않고 다른 실시예들이 사용될 수 있다. 단계 1110에서, UE(예를 들면, UE)가 DCI 포맷 A의 검출을 위해 PDCCH를 모니터링하기 위한 탐색 공간 세 트들에 대한 설정을 수신한다. PDCCH MO에서 UE는 PDCCH 후보들을 수신하고 DCI 포맷 A의 크기 및 RNTI에 따라 이 정보를 디코딩한다(단계 1120). 단계 1130에서, UE는 PDCCH MO에서 DCI 포맷 A가 검출되었는지 여부를 판정한다. UE가 DCI 포맷 A를 검출한 경 우, UE는, 단계 1140에서, ACK 값을 갖는 HARQ-ACK 정보를 포함하는 PUCCH를 송신한다. 대안적으로, UE가 DCI 포맷 A를 검출하지 못한 경우, UE는, 단계 1150에서, NACK 값을 갖는 HARQ-ACK 정보를 포함하는 PUCCH를 송신한 다. 또한, UE가 DCI 포맷 A를 검출하지 못한 경우, UE가 PUCCH를 송신하지 않는 것도 가능하다. PUCCH 송신을 위한 PUCCH 자원이 상위 계층들에 의해 UE에게 제공되거나 또는 UE에 의해서 암시적으로 결정된다. PUCCH 송신 슬롯들과 관련하여, HARQ-ACK 정보를 포함하는 PUCCH의 송신을 위한 슬롯은 DCI 포맷 A를 갖는 후보 PDCCH 수신을 위한 해당 PDCCH MO의 슬롯 이후의 개의 슬롯이 되도록 설정될 수 있거나 또는 슬롯과 같이 시스템 동작에서 지정될 수 있으며, 여기서 의 값은 PUCCH 송신을 위한 SCS 설정에 따라 달라질 수 있 다. PDCCH MO의 슬롯으로부터 개의 슬롯 이후에 이용 가능한 PUCCH 자원이 없는 경우, PUCCH 송신은 PUCCH 송신을 위한 PUCCH 자원을 포함하는 개의 슬롯 이후의 첫 번째 슬롯에서 이루어질 수 있다. 도 10 및 도 11이 방법(1000 및 1100)을 도시하고 있지만, 도 10 및 11에 대해 다양한 변경이 이루어질 수 있다. 예를 들어, 도 10의 방법과 도 11의 방법이 일련의 단계들로 도시되어 있지만, 다양한 단계 들이 중첩되거나, 병렬적으로 발생하거나, 다른 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단 계들은 생략되거나 다른 단계들로 대체될 수 있다. 예를 들어, 방법의 단계들은 다른 순서로 실행될 수 있다. 본 개시의 실시예들은 또한 DCI 포맷 A를 위한 HARQ-ACK 정보와 PDSCH 수신을 위한 HARQ-ACK 정보의 다중화에 대해 설명한다. 도 12 및 도 13에서 설명되는, 다음의 예들 및 실시예들은 DCI 포맷 A에 대한 HARQ-ACK 정보와 PDSCH 수신에 대한 HARQ-ACK 정보의 다중화에 대해 설명한다. 본 개시의 일 실시예는 제 1 HARQ-ACK 정보를 포함하는 제 1 PUCCH 송신이 다른 UCI 타입들을 포함하는 제 2 PUCCH 송신 또는 PUSCH 송신과 시간적으로 중첩되는 경우, UE가 DCI 포맷 A의 디코딩 결과에 대한 HARQ-ACK 정 보(제 1 HARQ-ACK 정보라고 함)와 다른 UCI 타입들을 다중화하는 절차를 설명한다. 다른 UCI 타입들은 스케줄 링 요청, CSI 보고 또는 PDSCH 수신에서 전송 블록들의 결과를 디코딩하기 위한 HARQ-ACK 정보(제 2 HARQ-ACK 정보라고 함)를 포함한다. 제 2 실시예는 DCI 포맷 B에도 적용 가능하다. 제 1 접근 방식에서는, UE(예를 들면, UE)가 동일한 PUCCH 또는 PUSCH 송신에서 임의의 다른 UCI 타입과 제 1 HARQ-ACK 정보를 다중화하지 않는다. 제 1 PUCCH만 송신하거나 제 2 PUCCH 또는 PUSCH만 송신하는 UE 동 작은 시스템 동작에서 지정되거나 또는 상위 계층들을 통해 서빙 gNB에 의해 설정될 수 있다. 또한 UE 동작은 UE가 HARQ-ACK 정보 값이 NACK인 경우에만 제 1 PUCCH를 송신하는지 또는 HARQ-ACK 정보 값과 상관없이 제 1 PUCCH를 송신하는지에 따라 달라질 수 있다. 예를 들어, 제 2 HARQ-ACK 정보는 제 1 HARQ-ACK 정보와 다른 수 신 신뢰도를 이용할 수 있으며, gNB는 제 1 또는 제 2 HARQ-ACK 정보 중 하나만 송신하도록 UE를 설정할 수 있 다. UE가 제 1 및 제 2 HARQ-ACK 정보에 대하여 서로 다른 수신 신뢰도를 가능하게 하기 위해 제 1 HARQ-ACK 정보와 제 2 HARQ-ACK 정보를 다중화하지 않는 경우, UE는 PUCCH 송신 전력을 제어하는 개방 루프 전력 제어 컴 포넌트의 타겟 전력 설정 또는 코딩된 변조 심볼의 수 및 PUSCH에서 HARQ-ACK 다중화에 사용되는 최대 RE 수를 결정하는데 사용되는 파라미터들 또는 에 대한 개별 설정들을 상위 계층들에 의해 제공받을 수 있다. 제 1 HARQ-ACK 정보를 다른 UCI 타입들과 다중화하기 위한 UE 동작은 UCI 타입별로 개별적으로 설정될 수 있다. 예를 들어, UE는 제 1 및 제 2 HARQ-ACK 정보를 PUCCH에 다중화하고, 제 1 HARQ-ACK 정보와 SR 또는 CSI 보고 를 PUCCH에 다중화하지 않으며, 이러한 중첩의 경우에, 제 1 PUCCH만 송신하고 제 2 PUCCH 송신은 드롭하도록 설정될 수 있다. 또한 UE 동작은 다른 UCI 정보에 대한 페이로드에 따라 설정될 수도 있다. 예를 들어, 제 2 HARQ-ACK 정보에 대한 페이로드가 임계값보다 클 경우, 제 1 HARQ-ACK 정보와의 다중화가 활성화되며; 그렇지 않은 경우에는, 활성화되지 않는다. 페이로드 임계값은 상위 계층들에 의해 설정되거나 시스템 동작에서 지정 될 수 있다(예를 들어 2로 지정). 제 2 접근 방식에서는, UE(예를 들면, UE)가 제 1 HARQ-ACK 정보를 제 2 HARQ-ACK 정보와 다중화한다. UE가 DCI 포맷 A의 검출을 위한 PDCCH MO를 갖고, UE가 제 2 HARQ-ACK 정보와 동일한 PUCCH에 대응하는 제 1 HARQ-ACK 정보를 다중화하는 경우, 예를 들어 제 1 HARQ-ACK 정보를 포함하는 제 1 PUCCH의 송신을 위한 PUCCH 자원이 슬롯에서 제 2 HARQ-ACK 정보를 포함하는 제 2 PUCCH의 송신을 위한 PUCCH 자원과 중첩되기 때문에, UE 는 DCI 포맷 A에 대한 PDCCH MO와 연관된 하나의 HARQ-ACK 정보 비트를 생성한다. 제 1 HARQ-ACK 정보가 NACK 값을 갖는 경우에만 UE가 제 1 PUCCH를 송신하고, 제 1 HARQ-ACK 정보의 값과 상관없이 제 1 HARQ-ACK 정보와 제 2 HARQ-ACK 정보를 다중화하도록 설정된 경우에는, UE가 DCI 포맷을 검출할 때에 ACK 값을 보고하고; 그렇지 않으면, UE는 NACK 값을 보고한다. Type-1 HARQ-ACK 코드북에 따라 생성되는 HARQ-ACK 정보 보고의 경우, DCI 포맷 A를 위한 PDCCH MO들, 또는 이 들 PDCCH MO들의 개별적으로 설정된 서브세트가 Type-1 HARQ-ACK 코드북 결정에 포함된다. 제 1 접근 방식에서 는, 슬롯에서의 PUCCH 송신이 DCI 포맷에 대한 개의 PDCCH MO들을 포함하는(예를 들면, ) 다수의 슬 롯들에 대응하는 수신을 위한 Type-1 HARQ-ACK 코드북을 포함하는 경우, UE는 DCI 포맷 A의 검출 결과에 대응하 는 각 PDCCH MO에 대한 HARQ-ACK 정보 비트를 생성하고 이것을 Type-1 HARQ-ACK 코드북에 첨부한다(즉, UE는 Type-1 HARQ-ACK 코드북에서 해당 PDCCH MO에 대한 오름차순에 따라 DCI 포맷 A 검출을 위한 개의 HARQ-ACK 정보 비트를 첨부한다). 제 3 접근 방식에서는, 각각의 PDCCH MO가 활성 DL BWP와 연관된 테이블의 행 인덱스 세트에 대응하는 행 인덱 스를 추가함으로써 가상 PDSCH 수신으로 취급되며, 여기서 테이블은 PDSCH 수신을 위한 슬롯 오프셋들, 시작 및 길이 지시자 , PDSCH 매핑 타입들의 각각의 세트들을 정의하며, 또한 PDCCH MO에 대한 해당 HARQ-ACK 정 보의 위치는 가상 PDSCH 수신에 대응하는 위치이다. UE가 Type-1 HARQ-ACK 코드북에 제 1 및 제 2 HARQ-ACK 정보를 다중화하도록 설정되고, UE가 후보 PDSCH 수신 을 위한 모든 오케이전들에 대해 제 1 HARQ-ACK 정보에 대해서만 HARQ-ACK 정보를 보고하는 경우, UE는 제 1 HARQ-ACK 정보만을 위한 Type-1 HARQ-ACK 코드북을 결정한다. 도 12는 본 개시의 실시예들에 따른 UE가 DCI 포맷 A의 검출에 대한 HARQ-ACK 정보를 Type-1 HARQ-ACK 코드북 에 포함시키는 예시적인 방법을 도시한 것이다. 예를 들어, 방법의 단계들은 도 1의 UE들(111- 116) 중의 임의의 UE(예를 들면, 도 3의 UE)에 의해 수행될 수 있다. 도 12의 방법은 단지 예시를 위한 것이며 본 개시의 범위를 벗어나지 않고 다른 실시예들이 사용될 수 있다. 단계 1210에서, UE(예를 들면, UE)는 DCI 포맷 A의 검출을 위해 PDCCH를 모니터링하기 위한 탐색 공간 세 트들에 대한 설정을 수신한다. (i) PUCCH 송신을 위한 슬롯 타이밍 값 세트, (ii) PDSCH 수신을 위한 파라미터들을 정의하는 테이블의 행 인덱 스 세트, (iii) DCI 포맷 A를 위한 PDCCH MO들, 및 (iv) UE가 언제 PDSCH 또는 PDCCH를 수신할 수 있는지 또는 PUCCH를 송신할 수 있는지를 정의하는 TDD UL-DL 설정과 같은 다른 설정들에 기초하여, UE는, 단계 1220에서, PUCCH에서 송신할 Type-1 HARQ-ACK 코드북을 결정하며, 여기서 PDSCH 수신을 결정하기 위한 테이블의 행 인덱스 세트는 PDCCH MO들에 대응하는 항목들을 포함한다. 단계 1230에서, UE는 PDSCH 수신을 스케줄링하는 DCI 포맷에 의해 지시되는 슬롯 타이밍 값에 따라 결정된 슬롯 에서의 PUCCH 송신에 Type-1 HARQ-ACK 코드북을 다중화한다.Type-2 HARQ-ACK 코드북에 따라 생성되는 HARQ-ACK 정보 보고에 있어서, 슬롯에서의 PUCCH 송신이 DCI 포맷 A 를 위한 개의 PDCCH MO들을 포함하는(예를 들면, ) 다수의 슬롯들에 대응하는 수신을 위한 Type-2 HARQ-ACK 코드북을 포함하는 경우, UE는 DCI 포맷의 검출 결과에 대응하는 각 PDCCH MO에 대한 HARQ-ACK 정보 비트를 생성하고 이것을 Type-1 HARQ-ACK 코드북에 첨부한다(즉, UE는 Type-2 HARQ-ACK 코드북에서 해당 PDCCH MO에 대한 오름차순에 따라 DCI 포맷 A 검출을 위한 개의 HARQ-ACK 정보 비트를 첨부한다). PDSCH 수신을 스케줄링하는 DCI 포맷과 달리, DCI 포맷 A는 카운터 및 전체 하향링크 할당 인덱스(DAI) 필드들을 포함하지 않 는 것으로 가정되며, Type-2 HARQ-ACK 생성을 위해, SPS PDSCH 수신과 유사한 방식으로 DCI 포맷 A가 취급된다. 도 13은 본 개시의 실시예들에 따른 UE가 DCI 포맷 A의 검출에 대한 HARQ-ACK 정보를 타입-2 HARQ-ACK 코드북에 포함시키는 예시적인 방법을 도시한 것이다. 예를 들어, 방법의 단계들은 도 1의 UE들(111-116) 중의 임의의 UE(예를 들면, 도 3의 UE)에 의해 수행될 수 있으며, 상보적 프로세스가 BS(예를 들면, BS)에 의해 수행될 수 있다. 도 13의 방법은 단지 예시를 위한 것이며 본 개시의 범위를 벗어나지 않고 다른 실시예들이 사용될 수 있다. 단계 1310에서, UE(예를 들면, UE)는 DCI 포맷 A의 검출을 위해 PDCCH를 모니터링하기 위한 탐색 공간 세 트들에 대한 설정을 수신한다. PUCCH 송신의 슬롯들과 관련하여 PDSCH 수신의 슬롯들 및 PDSCH 수신을 스케줄링하는 DCI 포맷들에 의해 대응하 는 제 1 HARQ-ACK 정보를 포함하는 PUCCH 송신을 위해 지시된 슬롯들에 기초하여, UE는, 단계 1320에서, DCI 포 맷 A의 검출 결과에 대한 제 1 HARQ-ACK 정보를 포함하는 PUCCH 송신을 위한 슬롯과 동일한 제 2 HARQ-ACK 정보 를 포함하는 PUCCH 송신을 위한 슬롯을 결정한다. 단계 1330에서, UE는 Type-2 HARQ-ACK 코드북에 기초하여 제 1 및 제 2 HARQ-ACK 정보를 다중화하며 여기서 제 1 HARQ-ACK 정보가 PUCCH 송신에서 제 2 HARQ-ACK 정보에 첨부된다. 도 12 및 도 13이 방법(1200 및 1300)을 도시하고 있지만, 도 12 및 도 13에 대해 다양한 변경이 이루어질 수 있다. 예를 들어, 도 12의 방법과 도 13의 방법이 일련의 단계들로 도시되어 있지만, 다양한 단계 들이 중첩되거나, 병렬적으로 발생하거나, 다른 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단 계들은 생략되거나 다른 단계들로 대체될 수 있다. 예를 들어, 방법의 단계들은 다른 순서로 실행될 수 있다. 본 개시의 실시예들은 또한 그룹캐스트 PDSCH 수신 및 유니캐스트 PDSCH 수신을 위한 HARQ-ACK 정보의 다중화에 대해 설명한다. 도 14에서 설명되는, 다음의 예들 및 실시예들은 그룹캐스트 및 유니캐스트 PDSCH 수신을 위한 HARQ-ACK 정보의 다중화에 대해 설명한다. 본 개시의 일 실시예는 UE가 그룹캐스트 PDSCH(G-PDSCH) 수신에 대한 응답으로 제 1 HARQ-ACK 정보를 제공하고 제 1 HARQ-ACK 정보를 유니캐스트 PDSCH(U-PDSCH) 수신에 대한 HARQ-ACK 정보와 같은 다른 UCI 타입들과 다중 화하는 절차를 설명한다. 특정 실시예들에서, UE는 해당 값이 NACK인 경우에만 또는 HARQ-ACK 값에 관계없이 G-PDSCH 수신에 대한 응답으 로 HARQ-ACK 정보를 제공하도록 구성된다. UE가 NACK 값을 가질 때만 HARQ-ACK 정보를 제공하도록 설정될 시에, HARQ-ACK 정보가 G-PDSCH 수신에 대한 응답일 경우, 서빙 gNB는 PUCCH 수신의 부존재가 모든 UE가 해당 G-PDSCH 수신 시에 전송 블록을 올바르게 디코딩했기 때문인지 또는 적어도 일부 UE가 G-PDSCH 수신을 스케줄링 하는 DCI 포맷 B를 검출하지 못했기 때문인지 알 수 없다. 이 문제를 피하기 위해, 본 개시의 실시예들은 UE가 G-PDSCH 수신을 스케줄링하는 DCI 포맷 B를 검출하도록 설정된 PDCCH MO에 대해, UE가 DCI 포맷 B를 검출하지 못한 경우 PUCCH를 송신하며, 이러한 PUCCH 송신은 DCI 포맷 B를 검출하지 못한 경우에(디코딩을 시도한 후 올 바르게 디코딩하지 못한 경우에) 또는, 해당 시, G-PDSCH 수신 시에 전송 블록을 올바르게 디코딩하지 못한 경 우에 NACK 값을 제공하는 것을 고려한다. 따라서, UE가 G-PDSCH에 대한 전송 블록을 올바르게 디코딩하지 못했 을 때 PUCCH를 송신하도록 설정되는 경우, UE는 각각의 PDCCH MO에 대해 PUCCH를 송신하거나, 또는 UE가 G- PDSCH 수신을 스케줄링하는 DCI 포맷 B를 검출하지 못한 경우 및 UE가 G-PDSCH 수신 시에 전송 블록을 올바르게 디코딩하지 못한 경우 모두에 있어서, G-PDSCH 수신을 스케줄링하기 위해 또는 반지속적으로 스케줄링된 G- PDSCH 수신의 활성화/비활성화를 위해, 설정된 PDCCH MO들의 서브세트에 대해 PUCCH를 송신한다. 또한, PUCCH 송신은 전송 블록의 디코딩에 대한 NACK 값을 지시하므로, 추가 정보를 제공할 수 있으며, 예를 들어 '0'의 HARQ-ACK 정보 비트 값은 G-PUSCH 수신을 스케줄링하는 DCI 포맷을 UE가 올바르게 디코딩하지 못했음을 나타낼수 있고, \"1\"의 값은 UE가 G-PDSCH 수신 시에 전송 블록을 올바르게 디코딩하지 못했음을 나타낼 수 있으며, 여 기서 예를 들어 UE는 서로 다른 해당 PUCCH 자원들에서 시퀀스 기반(변조 심볼 없이) PUCCH를 송신하는 것에 의 해 서로 다른 지시들을 제공할 수 있다. UE가 G-PDSCH 수신을 스케줄링하는 DCI 포맷 B를 검출하지 못한 경우 에도 HARQ-ACK 정보를 포함하는 PUCCH를 송신하는 경우, 해당 PDCCH MO의 슬롯에 대한, PUCCH 자원 및 PUCCH 송신 슬롯이 상위 계층들에 의해 설정된다. 도 14는 본 개시의 실시예들에 따른 UE가 NACK 값을 포함하는 HARQ-ACK 정보를 제공하기 위한 예시적인 방법 을 도시한 것이다. 방법은 UE가 PDSCH 수신을 스케줄링하는 DCI 포맷 검출의 실패 또는 DCI 포맷 에 의해 스케줄링된 PDSCH 수신 시에 전송 블록 검출의 실패에 대해 NACK 값을 포함하는 HARQ-ACK 정보를 제공 하는 것에 대해 설명한다. 예를 들어, 방법의 단계들은 도 1의 UE들(111-116) 중의 임의의 UE(예를 들면, 도 3의 UE)에 의해 수행될 수 있으며, 상보적 프로세스가 BS(예를 들면, BS)에 의해 수행될 수 있다. 도 14의 방법은 단지 예시를 위한 것이며 본 개시의 범위를 벗어나지 않고 다른 실시예들이 사용 될 수 있다. 단계 1410에서, UE(예를 들면, UE)는 DCI 포맷의 검출을 위해 PDCCH를 모니터링하기 위한 탐색 공간 세트 들에 대한 설정을 수신한다. 단계 1420에서, UE는 DCI 포맷이 검출되었는지 여부를 판정한다. UE가 DCI 포맷 을 검출하지 못한 경우, UE는, 단계 1430에서, 제 1 PUCCH 자원에서 PUCCH를 송신한다. 대안적으로, UE가 DCI 포맷을 검출하고 DCI 포맷에 의해 스케줄링된 PDSCH 수신 시에 전송 블록을 올바르게 디코딩하지 못한 경우, UE 는, 단계 1440에서, 제 2 PUCCH 자원에서 PUCCH를 송신한다. 위의 예에서는, UE가 DCI 포맷을 검출하고 DCI 포맷에 의해 스케줄링된 PDSCH 수신 시에 전송 블록을 올바르게 디코딩한 경우 PUCCH를 송신하지 않는다. PUCCH 송신을 위한 제 1 또는 제 2 PUCCH 자원은 상위 계층 시그널링 에 의해 UE에 제공되거나 또는 예를 들어 DCI 포맷을 제공하는 PDCCH 후보들에 대한 CCE의 제 1 인덱스에 기초 하여 UE에 의해 암시적으로 결정된다. 도 14가 방법을 도시하고 있지만, 도 14에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 14의 방법이 일련의 단계들로 도시되어 있지만, 다양한 단계들이 중첩되거나, 병렬적으로 발생하거나, 다른 순 서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계들은 생략되거나 다른 단계들로 대체될 수 있다. 예를 들어, 방법의 단계들은 다른 순서로 실행될 수 있다. 특정 실시예들에서, UE는 해당 값이 NACK인 경우에만 그리고 G-PDSCH 수신 시에 잘못된 전송 블록 디코딩을 나 타내기 위해서만 PUCCH를 송신하며, 서빙 gNB는 HARQ-ACK 정보가 NACK인 경우에만 PUCCH가 수신될 때 DTX-대- NACK 확률에 대한 PUCCH의 수신 전력 임계값과, HARQ-ACK 정보가 ACK 또는 NACK인 경우 PUCCH가 수신될 때 DTX-대-ACK 확률에 대한 PUCCH의 수신 전력 임계값을 개별적으로 설정해야 한다. DTX-대-ACK 확률은 일반적으 로 1%의 대응 확률을 갖는 HARQ-ACK 정보를 포함하는 PUCCH 송신을 트리거하는 DCI 포맷을 UE가 검출하지 못하 는 것에 대해 추가적으로 조건화되기 때문에 1%로 설정될 수 있다. 두 이벤트는 상관관계가 없기 때문에, UE가 DCI 포맷을 검출하지 못하고 gNB가 연관된 DTX-대-ACK 오류를 만드는 조합된 이벤트는 조합 확률이 0.01%이다. G-PDSCH 수신에 있어서, UE가 잘못된 전송 블록 디코딩에 대한 응답으로 NACK 값을 포함하는 HARQ-ACK 정보만을 나타내기 위해 PUCCH를 송신하는 경우, 나머지 UE들(존재하는 경우)이 전송 블록을 올바르게 디코딩한 것으로 가정하여 DCI 포맷 B를 검출하지 못할 확률에 해당하므로, DTX-대-ACK 오류의 조합된 이벤트는 1%이다. 재송신 을 최소화하기 위해, 전송 블록에 대한 타겟 BLER은 작을 가능성이 높으며, 그 이유는, 그렇지 않을 경우 G- PDSCH 수신을 위한 UE들 및 다수의 UE들 사이의 전송 블록에 대한 독립적인 디코딩 결과를 가정할 시에 재송신 가능성이 커지기 때문이다. 또한, 모든 UE가 DCI 포맷 B를 검출하더라도, DTX-대-NACK 확률은 0.01% 정도로 작 아야 하며, 그 이유는, 그렇지 않을 경우 서빙 gNB는 NACK 정보만 있는 PUCCH 송신의 경우에 실제로 NACK-대- ACK 오류에 해당하는 더 큰 확률로 DTX를 결정할 가능성이 높기 때문이다. 작은 DTX-대-NACK 확률(및 작은 NACK-대-DTX 확률)을 달성하기 위해서는, 적어도 소수의 UE들만이 NACK을 지시 하기 위해 PUCCH 자원에서 PUCCH를 송신할 때, PUCCH 수신 전력이 노이즈 레벨보다 상당히 커야 실제 PUCCH 수 신이 없는 것으로 잘못 해석될 가능성이 매우 낮아지게 된다. 따라서, NACK 정보만 있는 PUCCH 송신 전력은 ACK 또는 NACK 정보가 있는 PUCCH 송신 전력보다 크거나, 일반적으로 다를 수 있어야 한다. 일 접근 방식에서 는, NACK 정보에 대해서만 PUCCH 송신이 발생하는 경우 UE가 PUCCH 송신 전력에 추가할 전력 오프셋 를 서빙 gNB가 상위 계층들에 의해 UE에게 제공할 수 있거나, 또는 UE가 PUCCH를, HARQ-ACK 정보에 대해 NACK 값만 을 지시하기 위해 송신하는지 또는 NACK 또는 ACK 값을 지시하기 위해 송신하는지에 따라 값에 대한개별의 설정들을 동등하게 제공할 수 있다. 제 2 접근 방식에서는, 같은 목적을 위해, gNB가 PUCCH 공칭 전력 수신 값 세트 를 UE에게 설정할 수 있으며, G-PDSCH 수신을 스케줄링하는 DCI 포맷 B에 의해 값들 중 하나를 지시할 수 있다. TPC 명령 필드는 다수의 UE들에 의한 G-PDSCH 수신의 경우 의미가 없기 때문에, DCI 포맷 B의 TPC 명령 필드는 값들의 세트로부터 하나의 값을 지시하기 위한 것으로 용도 변경될 수 있 다. 제 3 접근 방식에서는, UE가 G-PDCCH 수신에 응답하는 제 1 PUCCH 송신 및 U-PDCCH 수신에 응답하는 제 2 PUCCH 송신 각각에 대한 개별의 폐루프 전력 제어 상태들을 유지할 수 있다. 제 1 PUCCH 송신에 대한 제 1 폐 루프 전력 제어 상태는 제 1 폐루프 전력 제어 상태에 대해 DCI 포맷 B에 의해 제공되는 추가로 축적되는 TPC 명령 값들을 제외하고, 제 2 PUCCH 송신에 대한 제 2 폐루프 전력 제어 상태와 동일할 수 있다. 또한 UE는 G-PDSCH 수신에 대한(또는 G-PDSCH 수신을 스케줄링하는 DCI 포맷의 검출에 대한) HARQ-ACK 정보를 제공하지 않도록 설정될 수도 있다. 추가 제한은 이러한 설정이, 그렇지 않으면, UE가 G-PDSCH 수신 시에 전송 블록 디코딩에 대한 응답으로 ACK 또는 NACK 값을 포함하는 HARQ-ACK 정보를 제공했을 경우에만 적용될 수 있다 (값이 NACK일 때만 UE가 HARQ-ACK 정보를 제공하는 경우에는 적용될 수 없음)는 것이다. 대안적으로, 제 1 UE 는 HARQ-ACK 정보 값이 NACK인 경우에만 PUCCH를 송신하도록 설정되고, 제 2 UE는 HARQ-ACK 정보 값과 관계없이 PUCCH를 송신하도록 설정되는지 여부에 따라 HARQ-ACK 정보 제공 여부를 제 1 UE 및 제 2 UE가 개별적으로 지시 받을 수 있다. 그 이유는 SINR(signal-to-interference and noise ratio) 값들이 낮은 UE들은 G-PDSCH 수신을 스케줄링하는 DCI 포맷 또는 G-PDSCH 수신 시에 전송 블록을 잘못 디코딩할 가능성이 더 높기 때문이다. 그러 면 서빙 gNB는 모든 제 1 UE들이 ACK 값과 함께 HARQ-ACK 정보를 제공할 경우, G-PDSCH 수신에 대한 HARQ-ACK 정보를 제공하기 위해 gNB가 선택한 임계값 미만의 SINR 값들을 제 1 UE들에만 설정할 수 있으며, 나머지 UE들 도 동일한 값을 제공할 것이 실질적으로 확실한 반면, 일부 제 1 UE들이 NACK 값과 함께 HARQ-ACK 정보를 제공 하는 경우, 서빙 gNB가 후속 G-PDSCH에서 해당 전송 블록을 재송신할 때 나머지 UE들의 HARQ-ACK 정보가 서빙 gNB에 유용하지 않게 된다. UE는 G-PDSCH 수신에 대응하는 제 1 HARQ-ACK 정보와 유니캐스트 PDSCH(U-PDSCH) 수신에 대응하는 제 2 HARQ- ACK 정보에 대해 HARQ-ACK 코드북 타입을 개별적으로 설정받을 수 있다. 또한 UE는 제 1 HARQ-ACK 정보를 포함 하는 제 1 PUCCH 송신이 제 2 HARQ-ACK 정보를 포함하는 제 2 PUCCH 송신과 슬롯에서 중첩될 때 동일한 PUCCH에 서 제 1 HARQ-ACK 정보 및 제 2 HARQ-ACK 정보를 다중화할지 여부, 또는 제 1 PUCCH와 제 2 PUCCH 중 하나만 송신할지 여부를 설정받을 수 있다. 이 설정은 상위 계층들에 의해 제공되거나 시스템 동작에서 지정될 수 있 다. PUCCH 송신은 예를 들어 G-PDSCH 수신을 위한 Type-1 HARQ-ACK 코드북 및 예를 들어 U-PDSCH 수신을 위한 Type-2 HARQ-ACK 코드북을 포함할 수 있다. 각 HARQ-ACK 코드북에 대한 수신 신뢰도가 동일한 경우 두 개의 HARQ-ACK 코드북에 대해 공동 인코딩(joint encoding)이 적용될 수 있으며, 두 개의 HARQ-ACK 코드북이 서로 다른 수신 신뢰도를 가질 수 있는 경우 개별 인코딩(separate encoding)이 적용될 수 있다. 제 1 HARQ-ACK 코드북과 제 2 HARQ-ACK 코드북 사이에 개별 인코딩이 적용되는 경우, UE(예를 들면, UE) 는 더 큰 수신 신뢰도를 사용하는 HARQ-ACK 코드북을 기반으로 PUCCH 송신 전력을 결정한다. 예를 들어, 제 1 HARQ-ACK 코드북이 더 큰 수신 신뢰도를 사용하는 경우, UE는 PUCCH에 제 1 HARQ-ACK 코드북만 다중화한 경우와 동일한 설정을 사용하여 PUCCH 송신 전력을 결정한다. 또한, UE는 수학식 6을 구하기 위해 제 1 최대 코드 레 이트 및 제 2 최대 코드 레이트 또는 코드 레이트 오프셋 을 제공받을 수 있으며, PUCCH 송신을 위한 RB의 수를 수학식 7의 조건을 만족하는 최소 RB의 수 로 결정할 수 있다. [수학식 6]"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "[수학식 7]"}
{"patent_id": "10-2023-7009840", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서, 에 대해, 는 제 1 및 제 2 HARQ-ACK 코드북에 대한 HARQ-ACK 정보 비트의 수이고, 는 각각의 와 동일한 서비스와 관련된 SR 또는 CSI와 같은 다른 UCI 비트(존재하는 경우; 그렇 지 않으면 )의 수이며, 는 제 1 UCI 코드워드와 제 2 UCI 코드워드에 대한 각각의 CRC 비 트 수이고, 는 UCI 다중화에 사용되는 RB 당 서브캐리어 수(DMRS 다중화에 사용되는 RB 당 서브캐리어 제외)이고, 은 UCI 다중화에 사용되는 PUCCH 송신의 심볼 수(DMRS 다중화에 사용되는 심볼 제외)이 며, 는 PUCCH 송신에서의 UCI 다중화를 위한 변조 차수이다. PUCCH 송신의 전력 및 RB 수에 대한 위의 결 정은, 예를 들어 제 1 UCI 타입은 매우 안정적인 서비스용이고 제 2 UCI 타입은 모바일 광대역(MBB) 서비스용인 경우와 같이 UE가 동일한 PUCCH 송신에서 서로 다른 해당 수신 신뢰도를 갖는 UCI 타입을 다중화하는 경우에 일 반적으로 적용될 수 있다. 제 1 HARQ-ACK 코드북과 제 2 HARQ-ACK 코드북 사이에 개별 인코딩이 적용되는 경우, UE는 PUSCH 송신에서 제 1 코드북에 대해 특정 수의 비트(예를 들면, 2 비트)까지 다중화하기 위한 제 1 개수의 RE와 제 2 코드북에 대해 특정 수의 비트(예를 들면, 1 비트)까지 다중화하기 위한 제 2 개수의 RE를 예비할 수 있다. G-PDSCH 수신을 위해, Type-1 HARQ-ACK 코드북은 슬롯 타이밍 값, TDRA(Time Domain Resource Allocation) 테 이블 및 G-PDSCH 수신에 대응하는 SCS 설정을 사용하여 유니캐스트 PDSCH 수신을 위한 Type-1로 설정될 수 있다. G-PDSCH 수신을 스케줄링하는 DCI 포맷 검출에 대한 HARQ-ACK 정보도 제공되어야 하는 경우, TDRA 테이 블은 G-PDSCH 수신을 스케줄링하는 DCI 포맷을 위한 PDCCH MO들에 대응하는 가상 G-PDSCH 수신을 위한 항목들을 추가적으로 포함할 수 있다. 또한, UE가 G-PDSCH 수신을 스케줄링하는 DCI 포맷을 위한 연속적인 PDCCH MO들 사이에 단일 G-PDCCH 수신만이 스케줄링된다고 가정할 수 있는 경우, TDRA 테이블은 G-PDSCH 수신을 스케줄링하 는 DCI 포맷을 위한 PDCCH MO들만 포함할 수 있다. Type 2 HARQ-ACK 코드북의 경우, G-PDSCH 수신은 UE 그룹에 의해 이루어지며, U-PDSCH 수신은 단일 UE에 의해 이루어지므로, DAI 필드 값들은 CG-PDSCH 수신을 스케줄링하는 제 1 DCI 포맷들과 유니캐스트 PDSCH 수신을 스 케줄링하는 제 2 DCI 포맷들에서 독립적으로 설정되며, 또한 대응하는 제 1 및 제 2 Type-2 HARQ-ACK 코드북들 은 독립적으로 구성된다. UE가 슬롯 내 PUCCH 송신에서 제 1 및 제 2 Type-2 HARQ-ACK 코드북을 다중화하는 경 우, UE는 제 1 HARQ-ACK 코드북을 제 2 HARQ-ACK 코드북에 첨부할 수 있다(또는 그 반대). UE는 슬롯에서 HARQ-ACK 정보를 제공하도록 지시받은 마지막 PDCCH MO에서 검출한, 제 1 또는 제 2 DCI 포맷으로부터의 DCI 포 맷에 기초하여 슬롯에서 PUCCH 송신을 위한 PUCCH 자원을 결정한다. PUSCH에서 HARQ-ACK 정보 코드북의 다중화를 위해, PUCCH에서의 다중화와 유사한 원리들이 적용될 수 있다. UE 는 PUSCH 송신에서 G-PDSCH 수신에 대한 응답으로 HARQ-ACK 정보를 다중화할지 여부를 설정받을 수 있다. UE가 그러한 다중화 및 제 1 및 제 2 HARQ-ACK 코드북의 공동 코딩을 설정받은 경우, G-PDSCH 수신에 대응하는 것과 같은 제 2 HARQ-ACK 코드북이 U-PDSCH 수신에 대응하는 것과 같은 제 1 HARQ-ACK 코드북에 첨부될 수 있다. 2 개의 HARQ-ACK 코드북의 개별 코딩을 위해, UE는 PUSCH 송신에서 다중화하기 위한 코딩 변조 심볼들의 제 1 및 제 2 개수를 결정하기 위한 개별 값들 및 을 제공받을 수 있다. 의 값이 PUSCH 송신을 스케줄링하는 DCI 포맷에 의해 지시되는 경우, 그 지시도 또한 의 값에 대한 것일 수 있거나 또는 UE는 지시된 에 대응하는 테이블 항목의 인덱스에 적용할 오프셋 를 설정 받을 수 있으며 에 매핑되는 테이블 항목의 인덱스를 얻을 수 있다. 인덱스가 테이블 항목의 최 소 또는 최대 인덱스보다 작거나 클 경우, UE는 가 각각 최소 또는 최대 인덱스를 갖는 테이블 항 목에 대응하는 것으로 결정한다. 본 개시의 실시예들은 또한 PDCCH 모니터링 및 그룹캐스트 PDSCH 수신 또는 유니캐스트 PDSCH 수신의 스케줄링 에 대해 설명한다. 도 15에서 설명되는, 다음의 예들 및 실시예들은 PDCCH 모니터링 및 그룹캐스트 PDSCH 수신 또는 유니캐스트 PDSCH 수신의 스케줄링에 대해 설명한다. 본 개시의 일 실시예는 G-PDSCH 수신을 스케줄링하는 DCI 포맷 B의 검출을 위한 PDCCH 모니터링 양태들을 설명 한다. UE가 CSS에 따른 DCI 포맷 B 검출을 위해 PDCCH를 모니터링하는 경우, UE는 U-PDSCH 수신보다 G-PDSCH 수신에 대한 PDCCH 모니터링 능력 할당을 우선시한다. 이러한 UE 동작은 예를 들어 U-PDSCH 수신이 G-PDSCH 수 신보다 더 큰 우선 순위를 가질 때 불이익할 수 있다. G-PDSCH 수신이 다수의 UE에 의해 이루어지므로, 서빙 gNB는 G-PDSCH 수신 스케줄링을 위해 슬롯에서 PDCCH를 송신할 수 있어야 하며, 또한 U-PDSCH 수신 또는 PUSCH 송신 스케줄링을 위해 슬롯에서 또 다른 PDCCH를 송신할 수 있어야 한다. 그러나, UE가 DCI 포맷 B와 연관된 탐색 공간 세트들에 대해 CSS에 따라 모니터링하는 PDCCH 후보들을 수신하기 위한 PDCCH 모니터링 능력의 할당 을 항상 우선시한다면, UE는 U-PDSCH 수신 또는 PUSCH 송신을 스케줄링하기 위해 USS에 따라 모니터링하는 PDCCH 후보들을 수신하기에 충분한 PDCCH 모니터링 능력을 갖지 못할 수 있다. 제 1 접근 방식에서, UE는 USS에 따른 DCI 포맷 B의 검출을 위해 PDCCH 후보들을 모니터링한다. 새로운 RNTI인 G-RNTI가 DCI 포맷의 CRC 비트를 스크램블링하기 위해 도입되고, USS가 에 의해 초기화되 며 여기서 에 사용되는 RNTI 값은 G-RNTI이다. 제 2 접근 방식에서, UE는 CSS에 따른 DCI 포맷 B의 검출을 위해 PDCCH 후보들을 모니터링한다. DCI 포맷 B의 CRC 비트를 스크램블링하기 위해 새로운 RNTI인 G-RNTI가 도입된다. CSS는 에 의해 초기화되거나, CSS에 따라 PDCCH를 모니터링하는 다른 DCI 포맷들의 PDCCH 후보들과 DCI 포맷 B에 대한 PDCCH 후보들의 충돌을 피하기 위해 에 의해(여기서 는 예를 들어 DCI 포맷 B에 대한 탐색 공간 세트들의 설정과 함께 상위 계층들에 의해 제공됨) 초기화될 수 있다. 그러나, DCI 포맷 B의 검출을 위해 CSS에 따라 PDCCH 후보들을 모니터링하도록 UE가 설정되는 탐색 공간 세트들은, USS에 따라 PDCCH 후보들을 모니터링하도록 UE가 설정되는 모든 탐색 공간 세트보다 높은 우선 순위로 지정되지 않는다. UE는 DCI 포맷 B의 검출을 위해 CSS에 따라 PDCCH 후보들을 모니터링하는 것과 연관된 탐색 공간 세트들보다 USS에 따라 PDCCH 후보들을 모니터링하는 것과 연관된 다수의 탐색 공간 세트들에 대한 PDCCH 후보들 및 비-중첩 CCE들의 할당에 높은 우선 순위를 지정하도록 설정될 수 있거나, 또는 하나의 탐색 공간 세트와 같은 시스템 동작에서 그 수가 지정될 수 있다. 예를 들어, 이 설정은 해당 탐색 공간 세트 인덱스를 기반으로 할 수 있다. DCI 포맷 B와 연관되지 않는 CSS 세트들에 대 한 PDCCH 후보들/비-중첩 CCE들의 제 1 우선 순위 지정 할당에 대한 변경 사항은 없다. 도 15는 UE가 본 개시의 탐색 공간 세트 실시예들에 PDCCH 후보들 및 비-중첩 CCE들을 할당하는 예시적인 방법 을 도시한 것이다. 예를 들어, 방법의 단계들은 도 1의 UE들(111-116) 중의 임의의 UE(예를 들면, 도 3의 UE)에 의해 수행될 수 있으며, 상보적 프로세스가 BS(예를 들면, BS)에 의해 수행될 수 있다. 도 15의 방법은 단지 예시를 위한 것이며 본 개시의 범위를 벗어나지 않고 다른 실시예들이 사용될 수 있 다. 단계 1510에서, UE(예를 들면, UE)는 탐색 공간 세트 당 CSS에 따라 또는 USS에 따라 PDCCH를 모니터링하 기 위해 탐색 공간 세트들에 대한 설정을 수신한다. 단계 1520에서, UE는 CSS에 따라 PDCCH를 모니터링하기 위 한 탐색 공간 세트와 연관된 DCI 포맷이 DCI 포맷 B와 같은 제 1 DCI 포맷인지 여부를 판정한다. DCI 포맷이 제 1 DCI 포맷이 아닌 경우, UE는, 단계 1530에서, UE가 USS에 따른 DCI 포맷 검출을 위해 PDCCH를 모니터링하 는 임의의 탐색 공간 세트보다 탐색 공간 세트에 대한 PDCCH 후보 및 비-중첩 CCE 할당에 높은 우선 순위를 지 정한다. 대안적으로, DCI 포맷이 제 1 DCI 포맷인 경우, UE는, 단계 1540에서, 예를 들어 단말은, 각각의 탐색 공간 인덱스에 대한 예시에 기반하여, USS에 따른 DCI 포맷 검출을 위해 PDCCH를 모니터링하는 적어도 하나의 탐색 공간 세트에 대한 PDCCH 후보들 및 비-중첩 CCE들의 할당에 탐색 공간 세트보다 높은 우선 순위를 지정한 다. 도 15가 방법을 도시하고 있지만, 도 15에 대한 다양한 변경들이 이루어질 수 있다. 예를 들어, 도 15의 방법이 일련의 단계들로 도시되어 있지만, 다양한 단계들이 중첩되거나, 병렬적으로 발생하거나, 다른 순 서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 이 단계들은 생략되거나 다른 단계들로 대체될 수도 있다. 예를 들어, 방법의 단계들은 다른 순서로 실행될 수 있다. 도 16은 본 개시의 실시예들에 따른 사용자 단말(UE)의 구조를 도시한 것이다. 도 16을 참조하면, UE는 컨트롤러, 트랜시버 및 메모리를 포함할 수 있다. 그러나, 도시된 컴포넌트들 모두가 필수적인 것은 아니다. UE는 도 16에 도시된 것보다 많거나 적은 컴포넌트들 에 의해 구현될 수도 있다. 또한, 컨트롤러, 트랜시버 및 메모리는 다른 실시예에 따라 하나의 칩으로 구현될 수도 있다. UE는 전술한 UE에 대응할 수 있다. 예를 들어, UE는 도 3의 UE에 대응할 수 있다. 이제 전술한 컴포넌트들에 대해 상세히 설명한다. 컨트롤러는 본 제안된 기능, 프로세스, 및/또는 방법을 제어하는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있다. UE의 동작은 컨트롤러에 의해 구현될 수 있다. 트랜시버는 송신 신호를 상향 변환 및 증폭하는 RF 송신기와, 수신 신호의 주파수를 하향 변환하는 RF 수 신기를 포함할 수 있다. 그러나, 다른 실시예에 따르면, 트랜시버는 구성 요소들에 도시된 것보다 많거 나 적은 구성 요소들에 의해 구현될 수도 있다. 트랜시버는 컨트롤러와 연결되어 신호를 송신 및/또는 수신할 수 있다. 신호는 제어 정보 및 데이 터를 포함할 수 있다. 또한, 트랜시버는 무선 채널을 통해 신호를 수신하여 컨트롤러로 출력할 수 있다. 트랜시버는 컨트롤러로부터 출력된 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 UE가 획득한 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 컨트롤러와 연결되어 제안된 기능, 프로세스 및/또는 방법에 대한 적어도 하나의 명령어, 프로토콜 또는 파라미터를 저장할 수 있다. 메모리는 ROM(read-only memory) 및/또는 RAM(random access memory) 및/ 또는 하드 디스크 및/또는 CD-ROM 및/또는 DVD 및/또는 기타 저장 장치를 포함할 수 있다. 도 17은 본 개시의 실시예들에 따른 기지국의 구조를 도시한 것이다. 도 17을 참조하면, 기지국은 컨트롤러, 트랜시버 및 메모리를 포함할 수 있다. 그러 나, 도시된 컴포넌트들 모두가 필수적인 것은 아니다. 기지국은 도 17에 도시된 것보다 많거나 적은 컴 포넌트들에 의해 구현될 수도 있다. 또한, 컨트롤러, 트랜시버 및 메모리는 다른 실시예에 따라 하나의 칩으로 구현될 수도 있다. 기지국은 본 개시에서 설명된 gNB에 대응할 수 있다. 예를 들어, 기지국은 도 2의 gNB에 대응할 수 있다. 이제 전술한 컴포넌트들에 대해 상세히 설명한다. 컨트롤러는 본 제안된 기능, 프로세스, 및/또는 방법을 제어하는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있다. 기지국의 동작은 컨트롤러에 의해 구현될 수 있다. 트랜시버는 송신 신호를 상향 변환 및 증폭하는 RF 송신기와, 수신 신호의 주파수를 하향 변환하는 RF 수 신기를 포함할 수 있다. 그러나, 다른 실시예에 따르면, 트랜시버는 구성 요소들에 도시된 것보다 많거 나 적은 구성 요소들에 의해 구현될 수도 있다. 트랜시버는 컨트롤러와 연결되어 신호를 송신 및/또는 수신할 수 있다. 신호는 제어 정보 및 데이 터를 포함할 수 있다. 또한, 트랜시버는 무선 채널을 통해 신호를 수신하여 컨트롤러로 출력할 수 있다. 트랜시버는 컨트롤러로부터 출력된 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 기지국에 의해 획득된 신호에 포함되는 제어 정보 또는 데이터를 저장할 수 있다. 메모 리는 컨트롤러와 연결되어 제안된 기능, 프로세스 및/또는 방법에 대한 적어도 하나의 명령어, 프 로토콜 또는 파라미터를 저장할 수 있다. 메모리는 ROM(read-only memory) 및/또는 RAM(random access memory) 및/또는 하드 디스크 및/또는 CD-ROM 및/또는 DVD 및/또는 기타 저장 장치를 포함할 수 있다. 위의 흐름도들은 본 개시의 원리들에 따라 구현될 수 있는 예시적인 방법들을 도시한 것이며 다양한 변경 및 수 정이 여기의 흐름도들에 예시된 방법들에 대하여 이루어질 수 있다. 예를 들어, 일련의 단계들로 도시되어 있 지만 각 도면의 다양한 단계들은 중첩되거나 병렬로 발생하거나 다른 순서로 발생하거나 여러 번 발생할 수 있 다. 다른 예에서, 이 단계들은 생략되거나 다른 단계들로 대체될 수도 있다. 도면들이 사용자 단말의 다양한 예들을 보여주고 있지만 도면들에 다양한 변경이 있을 수 있다. 예를 들어, 사 용자 단말은 임의의 적절한 배열로 임의의 수의 각 구성 요소를 포함할 수 있다. 일반적으로, 도면들은 본 개 시의 범위를 특정 구성(들)으로 제한하지 않는다. 더욱이, 도면들은 본 특허 문서에 개시된 다양한 사용자 단 말 기능이 사용될 수 있는 운영 환경을 예시하지만, 이러한 기능은 임의의 다른 적절한 시스템에서 사용될 수 있다.본 발명이 예시적인 실시예로 설명되었지만, 당업자라면 다양한 변경 및 수정을 제안할 수 있다. 본 발명은 첨 부된 청구항들의 범위 내에 속하는 그러한 변경 및 수정을 포함하는 것으로 의도된다. 본 출원의 어떠한 설명 도 임의의 특정 요소, 단계 또는 기능이 청구 범위에 포함되어야 하는 필수 요소임을 나타내는 것으로 해석되어 서는 안 된다. 특허된 주제의 범위는 청구범위에 의해 정의된다."}
{"patent_id": "10-2023-7009840", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시 및 그 이점에 대한 보다 완전한 이해를 위해, 이제 첨부 도면과 함께 취해지는 다음의 설명에 대한 참 조가 이루어지며, 도면에서 유사한 참조 부호는 유사한 부분을 나타낸다. 도 1은 본 개시의 실시예들에 따른 예시적 무선 네트워크를 도시한 것이다. 도 2는 본 개시의 실시예들에 따른 예시적인 기지국(BS)을 도시한 것이다. 도 3은 본 개시의 실시예들에 따른 예시적인 UE를 도시한 것이다. 도 4는 본 개시의 실시예들에 따른 예시적인 무선 송신 경로를 도시한 것이다. 도 5는 본 개시의 실시예들에 따른 예시적인 무선 수신 경로를 도시한 것이다. 도 6은 본 개시의 실시예들에 따른 직교 주파수 분할 다중화(OFDM)를 사용하는 예시적인 송신기 구조의 블록도 를 도시한 것이다. 도 7은 본 개시의 실시예들에 따른 OFDM을 사용하는 예시적인 수신기 구조의 블록도를 도시한 것이다. 도 8은 본 개시의 실시예들에 따른 하향링크 제어 정보(DCI) 포맷에 대한 예시적인 인코딩 프로세스를 도시한 것이다. 도 9는 본 개시의 실시예들에 따른 UE와 함께 사용하기 위한 DCI 포맷에 대한 예시적인 디코딩 프로세스를 도시 한 것이다. 도 10은 본 개시의 실시예들에 따른 UE가 DCI 포맷 A의 검출에 대한 HARK(hybrid automatic repeat request) ACK(acknowledgement) 정보를 제공하는 예시적인 방법을 도시한 것이다. 도 11은 본 개시의 실시예들에 따른 UE가 HARQ-ACK 정보를 제공하기 위한 예시적인 방법을 도시한 것이다. 도 12는 본 개시의 실시예들에 따른 UE가 DCI 포맷 A의 검출에 대한 HARQ-ACK 정보를 Type-1 HARQ-ACK 코드북 에 포함시키는 예시적인 방법을 도시한 것이다. 도 13은 본 개시의 실시예들에 따른 UE가 DCI 포맷 A의 검출에 대한 HARQ-ACK 정보를 Type-2 HARQ-ACK 코드북 에 포함시키는 예시적인 방법을 도시한 것이다. 도 14는 본 개시의 실시예들에 따른 UE가 NACK(negative acknowledgement) 값을 갖는 HARQ-ACK 정보를 제공하 기 위한 예시적인 방법을 도시한 것이다. 도 15는 본 개시의 실시예들에 따른 UE가 PDCCH 후보들 및 비-중첩 CCE들을 할당하는 예시적인 방법을 도시한 것이다. 도 16은 본 개시의 실시예들에 따른 사용자 단말(UE)의 구조를 도시한 것이다. 도 17은 본 개시의 실시예들에 따른 기지국의 구조를 도시한 것이다."}
