{"patent_id": "10-2023-7008300", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0069106", "출원번호": "10-2023-7008300", "발명의 명칭": "무선 통신 시스템에서의 다중 업링크 송신의 전력 제어 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "코조 카르멜라"}}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서의 사용자 장치(user equipment, UE)에 있어서,신호를 송수신하도록 설정된 송수신기; 및상기 송수신기와 결합된 제어부를 포함하며, 상기 제어부는,제1 파라미터 및 제2 파라미터에 대한 정보를 수신하고,상기 제1 파라미터에 기초하여 서빙 셀의 제1 수신 포인트에 대한 제1 공간 설정을 갖는 제1 채널에 대한 제1전력을 결정하고,상기 제2 파라미터에 기초하여 상기 서빙 셀의 제2 수신 포인트에 대한 제2 공간 설정을 갖는 제2 채널에 대한제2 전력을 결정하고,상기 제1 전력 및 상기 제1 공간 설정에 기초하여 상기 제1 채널을 상기서빙 셀의 제1 수신 포인트로 송신하며,상기 제2 전력 및 상기 제2 공간 설정에 기초하여 상기 제2 채널을 상기서빙 셀의 제2 수신 포인트로 송신하도록 설정되는, 사용자 장치."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제어부는,상기 서빙 셀의 상기 제1 수신 포인트에 대한 상기 제1 공간 설정을 갖는 송신을 위한 제1 최대 전력에 대한 정보를 수신하고,상기 서빙 셀의 상기 제2 수신 포인트에 대한 상기 제2 공간 설정을 갖는 송신을 위한 제2 최대 전력에 대한 정보를 수신하고,상기 제1 전력이 상기 제1 최대 전력보다 작거나 같도록 결정하고,상기 제2 전력이 상기 제2 최대 전력보다 작거나 같도록 결정하고,상기 서빙 셀 상에서 송신을 위한 최대 전력에 대한 정보를 수신하며,상기 제1 전력 및 상기 제2 전력의 합이 상기 최대 전력보다 작거나 같도록 결정하도록 더 설정되는, 사용자 장치."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 제어부는,상기 서빙 셀의 상기 제1 수신 포인트로의 송신을 위한 제1 폐루프 전력 제어(closed loop power control,CLPC) 조정 상태를 결정하고,상기 서빙 셀의 상기 제2 수신 포인트로의 송신을 위한 제2 CLPC 조정 상태를 결정하고,상기 제1 CLPC 조정 상태에 기초하여 상기 제1 전력을 결정하고,상기 제2 CLPC 조정 상태에 기초하여 상기 제2 전력을 결정하고,제1 및 제2 송신 전력 제어(transmission power control, TPC) 명령을 제공하는 다운링크 제어 정보(downlinkcontrol information, DCI) 포맷을 수신하며,공개특허 10-2023-0069106-3-상기 제1 TPC 명령의 값에 기초하여 상기 제1 CLPC 조정 상태를 업데이트하고, 상기 제2 TPC 명령의 값에 기초하여 상기 제2 CLPC 조정 상태를 업데이트하도록 더 설정되는, 사용자 장치."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 제어부는,다수의 시간 유닛을 갖는 일대일 매핑을 갖는 비트맵 - 비트맵 값은 마스터 셀 그룹(master cell group, MCG)및 2차 셀 그룹(secondary cell group, SCG) 상에서 송신을 위한 전력 할당의 우선 순위화를 나타냄 - 을 수신하고,상응하는 비트맵 값에 기초하여 시간 유닛 동안 상기 MCG 및 상기 SCG로의 송신을 위한 전력 할당을 우선 순위화하며,상기 시간 유닛 동안 상기 MCG 상에서 송신을 스케줄링하는 다운링크 제어 정보(DCI) 포맷 - 상기 DCI 포맷은상기 MCG 또는 상기 SCG 상에서 송신을 위한 전력 할당의 우선 순위화를 나타내는 값을 갖는 필드를 포함하고,상기 필드의 값은 상기 비트맵 값을 무시함 - 을 수신하도록 더 설정되는, 사용자 장치."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "무선 통신 시스템에서의 기지국에 있어서,신호를 송수신하도록 설정된 송수신기; 및상기 송수신기와 결합된 제어부를 포함하며, 상기 제어부는,제1 파라미터 및 제2 파라미터에 대한 정보를 송신하고,상기 제1 파라미터에 기초하여 서빙 셀의 제1 수신 포인트에 대한 제1 공간 설정을 갖는 제1 채널에 대한 제1전력을 결정하고,상기 제2 파라미터에 기초하여 상기 서빙 셀의 제2 수신 포인트에 대한 제2 공간 설정을 갖는 제2 채널에 대한제2 전력을 결정하고,상기 서빙 셀의 제1 수신 포인트에서 상기 제1 전력 및 상기 제1 공간 설정에 기초하여 상기 제1 채널을 수신하며,상기 서빙 셀의 제2 수신 포인트에서 상기 제2 전력 및 상기 제2 공간 설정에 기초하여 상기 제2 채널을 수신하도록 설정되는, 기지국."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 제어부는,상기 서빙 셀의 상기 제1 수신 포인트에 대한 상기 제1 공간 설정을 갖는 송신을 위한 제1 최대 전력에 대한 정보를 송신하고,상기 서빙 셀의 상기 제2 수신 포인트에 대한 상기 제2 공간 설정을 갖는 송신을 위한 제2 최대 전력에 대한 정보를 송신하고,상기 제1 전력이 상기 제1 최대 전력보다 작거나 같도록 결정하고,상기 제2 전력이 상기 제2 최대 전력보다 작거나 같도록 결정하고,상기 서빙 셀 상에서 송신을 위한 최대 전력에 대한 정보를 송신하며,상기 제1 전력 및 상기 제2 전력의 합이 상기 최대 전력보다 작거나 같도록 결정하도록 더 설정되는, 기지국."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0069106-4-제 5 항에 있어서,상기 제어부는,상기 서빙 셀의 상기 제1 수신 포인트로의 송신을 위한 제1 폐루프 전력 제어(closed loop power control,CLPC) 조정 상태를 결정하고,상기 서빙 셀의 상기 제2 수신 포인트로의 송신을 위한 제2 CLPC 조정 상태를 결정하고,상기 제1 CLPC 조정 상태에 기초하여 상기 제1 전력을 결정하고,상기 제2 CLPC 조정 상태에 기초하여 상기 제2 전력을 결정하고,제1 및 제2 송신 전력 제어(transmission power control, TPC) 명령을 제공하는 다운링크 제어 정보(downlinkcontrol information, DCI) 포맷을 송신하며,상기 제1 TPC 명령의 값에 기초하여 상기 제1 CLPC 조정 상태를 업데이트하고, 상기 제2 TPC 명령의 값에 기초하여 상기 제2 CLPC 조정 상태를 업데이트하도록 더 설정되는, 기지국."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5 항에 있어서,상기 제어부는,다수의 시간 유닛을 갖는 일대일 매핑을 갖는 비트맵 - 비트맵 값은 마스터 셀 그룹(master cell group, MCG)및 2차 셀 그룹(secondary cell group, SCG) 상에서 송신을 위한 전력 할당의 우선 순위화를 나타냄 - 을 송신하고,상응하는 비트맵 값에 기초하여 시간 유닛 동안 상기 MCG 및 상기 SCG로의 송신을 위한 전력 할당을 우선 순위화하며,상기 시간 유닛 동안 상기 MCG 상에서 송신을 스케줄링하는 다운링크 제어 정보(DCI) 포맷 - 상기 DCI 포맷은상기 MCG 또는 상기 SCG 상에서 송신을 위한 전력 할당의 우선 순위화를 나타내는 값을 갖는 필드를 포함하고,상기 필드의 값은 상기 비트맵 값을 무시함 - 을 송신하도록 더 설정되는, 기지국."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "무선 통신 시스템에서 사용자 장치(user equipment, UE)에 의해 수행되는 방법에 있어서,제1 파라미터 및 제2 파라미터에 대한 정보를 수신하는 단계;상기 제1 파라미터에 기초하여 서빙 셀의 제1 수신 포인트에 대한 제1 공간 설정을 갖는 제1 채널에 대한 제1전력을 결정하는 단계;상기 제2 파라미터에 기초하여 상기 서빙 셀의 제2 수신 포인트에 대한 제2 공간 설정을 갖는 제2 채널에 대한제2 전력을 결정하는 단계;상기 제1 전력 및 상기 제1 공간 설정에 기초하여 상기 제1 채널을 상기서빙 셀의 제1 수신 포인트로 송신하는단계; 및상기 제2 전력 및 상기 제2 공간 설정에 기초하여 상기 제2 채널을 상기서빙 셀의 제2 수신 포인트로 송신하는단계를 포함하는, 방법."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 서빙 셀의 상기 제1 수신 포인트에 대한 상기 제1 공간 설정을 갖는 송신을 위한 제1 최대 전력에 대한 정보를 수신하는 단계;상기 서빙 셀의 상기 제2 수신 포인트에 대한 상기 제2 공간 설정을 갖는 송신을 위한 제2 최대 전력에 대한 정보를 수신하는 단계;공개특허 10-2023-0069106-5-상기 제1 전력이 상기 제1 최대 전력보다 작거나 같도록 결정하는 단계;상기 제2 전력이 상기 제2 최대 전력보다 작거나 같도록 결정하는 단계;상기 서빙 셀 상에서 송신을 위한 최대 전력에 대한 정보를 수신하는 단계; 및상기 제1 전력 및 상기 제2 전력의 합이 상기 최대 전력보다 작거나 같도록 결정하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 서빙 셀의 상기 제1 수신 포인트로의 송신을 위한 제1 폐루프 전력 제어(closed loop power control,CLPC) 조정 상태를 결정하는 단계;상기 서빙 셀의 상기 제2 수신 포인트로의 송신을 위한 제2 CLPC 조정 상태를 결정하는 단계;상기 제1 CLPC 조정 상태에 기초하여 상기 제1 전력을 결정하는 단계;상기 제2 CLPC 조정 상태에 기초하여 상기 제2 전력을 결정하는 단계;제1 및 제2 송신 전력 제어(transmission power control, TPC) 명령을 제공하는 다운링크 제어 정보(downlinkcontrol information, DCI) 포맷을 수신하는 단계; 및상기 제1 TPC 명령의 값에 기초하여 상기 제1 CLPC 조정 상태를 업데이트하고, 상기 제2 TPC 명령의 값에 기초하여 상기 제2 CLPC 조정 상태를 업데이트하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9 항에 있어서,다수의 시간 유닛을 갖는 일대일 매핑을 갖는 비트맵 - 비트맵 값은 마스터 셀 그룹(master cell group, MCG)및 2차 셀 그룹(secondary cell group, SCG) 상에서 송신을 위한 전력 할당의 우선 순위화를 나타냄 - 을 수신하는 단계;상응하는 비트맵 값에 기초하여 시간 유닛 동안 상기 MCG 및 상기 SCG로의 송신을 위한 전력 할당을 우선 순위화하는 단계; 및상기 시간 유닛 동안 상기 MCG 상에서 송신을 스케줄링하는 다운링크 제어 정보(DCI) 포맷 - 상기 DCI 포맷은상기 MCG 또는 상기 SCG 상에서 송신을 위한 전력 할당의 우선 순위화를 나타내는 값을 갖는 필드를 포함하고,상기 필드의 값은 상기 비트맵 값을 무시함 - 을 수신하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 통신 시스템에서 기지국에 의해 수행되는 방법에 있어서,제1 파라미터 및 제2 파라미터에 대한 정보를 송신하는 단계;상기 제1 파라미터에 기초하여 서빙 셀의 제1 수신 포인트에 대한 제1 공간 설정을 갖는 제1 채널에 대한 제1전력을 결정하는 단계;상기 제2 파라미터에 기초하여 상기 서빙 셀의 제2 수신 포인트에 대한 제2 공간 설정을 갖는 제2 채널에 대한제2 전력을 결정하는 단계;상기 서빙 셀의 제1 수신 포인트에서 상기 제1 전력 및 상기 제1 공간 설정에 기초하여 상기 제1 채널을 수신하는 단계; 및상기 서빙 셀의 제2 수신 포인트에서 상기 제2 전력 및 상기 제2 공간 설정에 기초하여 상기 제2 채널을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,공개특허 10-2023-0069106-6-상기 서빙 셀의 상기 제1 수신 포인트에 대한 상기 제1 공간 설정을 갖는 송신을 위한 제1 최대 전력에 대한 정보를 송신하는 단계;상기 서빙 셀의 상기 제2 수신 포인트에 대한 상기 제2 공간 설정을 갖는 송신을 위한 제2 최대 전력에 대한 정보를 송신하는 단계;상기 제1 전력이 상기 제1 최대 전력보다 작거나 같도록 결정하는 단계;상기 제2 전력이 상기 제2 최대 전력보다 작거나 같도록 결정하는 단계;상기 서빙 셀 상에서 송신을 위한 최대 전력에 대한 정보를 송신하는 단계; 및상기 제1 전력 및 상기 제2 전력의 합이 상기 최대 전력보다 작거나 같도록 결정하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2023-7008300", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 서빙 셀의 상기 제1 수신 포인트로의 송신을 위한 제1 폐루프 전력 제어(closed loop power control,CLPC) 조정 상태를 결정하는 단계;상기 서빙 셀의 상기 제2 수신 포인트로의 송신을 위한 제2 CLPC 조정 상태를 결정하는 단계;상기 제1 CLPC 조정 상태에 기초하여 상기 제1 전력을 결정하는 단계;상기 제2 CLPC 조정 상태에 기초하여 상기 제2 전력을 결정하는 단계;제1 및 제2 송신 전력 제어(transmission power control, TPC) 명령을 제공하는 다운링크 제어 정보(downlinkcontrol information, DCI) 포맷을 송신하는 단계;상기 제1 TPC 명령의 값에 기초하여 상기 제1 CLPC 조정 상태를 업데이트하고, 상기 제2 TPC 명령의 값에 기초하여 상기 제2 CLPC 조정 상태를 업데이트하는 단계;다수의 시간 유닛을 갖는 일대일 매핑을 갖는 비트맵 - 비트맵 값은 마스터 셀 그룹(master cell group, MCG)및 2차 셀 그룹(secondary cell group, SCG) 상에서 송신을 위한 전력 할당의 우선 순위화를 나타냄 - 을 송신하는 단계;상응하는 비트맵 값에 기초하여 시간 유닛 동안 상기 MCG 및 상기 SCG로의 송신을 위한 전력 할당을 우선 순위화하는 단계; 및상기 시간 유닛 동안 상기 MCG 상에서 송신을 스케줄링하는 다운링크 제어 정보(DCI) 포맷 - 상기 DCI 포맷은상기 MCG 또는 상기 SCG 상에서 송신을 위한 전력 할당의 우선 순위화를 나타내는 값을 갖는 필드를 포함하고,상기 필드의 값은 상기 비트맵 값을 무시함 - 을 송신하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 IOT(Internet of Things) 기술을 이용하여 4세대(4G) 시스템보다 높은 데이터 송신률을 지원하는 5세 대(5G) 통신 시스템을 융합하는 통신 방법 및 시스템에 관한 것이다. 본 개시는 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카, 커넥티드 카, 헬스 케어, 디지털 교육, 스마트 소매, 보안 및 안전 서비스와 같은 5G 통신 기 술 및 IoT 관련 기술에 기반한 지능형 서비스에 적용될 수 있다. 본 개시는 다중 업링크 송신의 전력 제어 방법 및 장치를 제공한다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 무선 통신 시스템에 관한 것으로서, 보다 상세하게는, 본 개시는 다중 업링크 송신의 전 력 제어 및 업링크 송신의 우선 순위화에 관한 것이다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 또는 pre-5G 통신 시스템은 또한 \"4G 네트워크 이후(Beyond 4G Network)\" 통신 시스템 또는 \"LTE 시스템 이후(Post LTE System)\" 통신 시 스템이라 불리어지고 있다. 높은 데이터 송신률(data rate)을 달성하기 위해, 5G 통신 시스템은 초고주파 (mmWave) 대역(예를 들어, 60GHz 대역)에서 구현되는 것으로 간주된다. 무선파(radio wave)의 전파 손실을 감소 시키고 송신 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대한 MIMO(Multiple-Input Multiple-Output), FD-MIMO(Full Dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍 (analog beam forming), 및 대규모 안테나(large scale antenna) 기술이 논의되고 있다. 또한, 시스템의 네트 워크 개선을 위해, 5G 통신 시스템에서는 진보된 소형 셀(advanced small cell), 클라우드 무선 액세스 네트워 크(cloud Radio Access Network; cloud RAN), 초고밀도 네트워크(ultra-dense network), 장치 간 통신(Device- to-Device(D2D) communication), 무선 백홀(wireless backhaul), 이동 네트워크(moving network), 협력 통신 (cooperative communication), CoMP(Coordinated Multi-Point), 수신 단 간섭 제거(reception-end interference cancellation) 등의 기술 개발이 이루어지고 있다. 5G 통신 시스템에서는 진보된 코딩 변조 (Advanced Coding Modulation, ACM) 방식인 FQAM(Hybrid FSK and QAM Modulation) 및 SWSC(Sliding Window Superposition Coding)과, 진보된 액세스 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non-orthogonal multiple access) 및 SCMA(sparse code multiple access) 등이 개발되고 있다. 인간이 정보를 생성하고 소비하는 인간 중심 연결 네트워크인 인터넷은 이제 사물과 같은 분산된 엔티티가 인간 의 개입 없이 정보를 교환하고 처리하는 사물 인터넷(Internet of Things; IoT)으로 진화하고 있다. 클라우드 서버와의 연결을 통한 IoT 기술 및 빅 데이터(Big Data) 처리 기술을 조합한 IoE(Internet of Everything) 기 술이 대두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소가 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), M2M(Machine-to-Machine), MTC(Machine 타입 Communication) 등의 기술이 연구되고 있다. IoT 환경 에서는 연결된 사물에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(Information Technology) 기술과 다양한 산업 간의 융합 및 복합을 통하여 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 또는 커넥티드 카, 스마트 그리드, 헬스 케어, 스마트 가전, 진보된 의료 서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도가 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), MTC(Machine 타입 Communication), M2M(Machine-to-Machine) 등의 기술은 5G 통신 기술이 빔포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처리 기술로서 클라우드 RAN(cloud Radio Access Network)이 적용되는 것도 5G 기술과 IoT 기술 간의 융합(convergence)의 일 예라고 할 수 있을 것이다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 다중 업링크 송신의 전력 제어 및 업링크 송신의 우선 순위에 관한 것이다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에서, 사용자 장치(user equipment; UE)가 제공된다. UE는 제1 파라미터 및 제2 파라미터에 대한 정보 를 수신하도록 설정된 송수신기, 및 송수신기에 동작 가능하게 연결된 프로세서를 포함한다. 프로세서는 제1 파 라미터를 사용하여 서빙 셀의 제1 수신 포인트에 대한 제1 공간 설정(spatial setting)을 갖는 제1 채널에 대한 제1 전력, 및 제2 파라미터를 사용하여 서빙 셀의 제2 수신 포인트에 대한 제2 공간 설정을 갖는 제2 채널에 대 한 제2 전력을 결정하도록 설정된다. 송수신기는 제1 전력 및 제1 공간 설정을 사용하는 제1 채널을 서빙 셀의 제1 수신 포인트로 송신하고, 제2 전력 및 제2 공간 설정을 사용하는 제2 채널을 서빙 셀의 제2 수신 포인트로 송신하도록 더 설정된다. 다른 실시예에서, 기지국(base station; BS)이 제공된다. BS는 제1 파라미터 및 제2 파라미터에 대한 정보를 송 신하도록 설정된 송수신기, 및 송수신기에 동작 가능하게 연결된 프로세서를 포함한다. 프로세서는 제1 파라미 터를 사용하여 서빙 셀의 제1 수신 포인트에 대한 제1 공간 설정을 갖는 제1 채널에 대한 제1 전력, 및 제2 파 라미터를 사용하여 서빙 셀의 제2 수신 포인트에 대한 제2 공간 설정을 갖는 제2 채널에 대한 제2 전력을 결정 하도록 설정된다. 송수신기는 서빙 셀의 제1 수신 포인트에서 제1 전력 및 제1 공간 설정을 사용하는 제1 채널 을 수신하고, 서빙 셀의 제2 수신 포인트에서 제2 전력 및 제2 공간 설정을 사용하는 제2 채널을 수신하도록 더 설정된다. 또 다른 실시예에서, 방법이 제공된다. 방법은 제1 파라미터 및 제2 파라미터에 대한 정보를 수신하는 단계, 제 1 파라미터를 사용하여 서빙 셀의 제1 수신 포인트에 대한 제1 공간 설정을 갖는 제1 채널에 대한 제1 전력을 결정하는 단계, 및 제2 파라미터를 사용하여 서빙 셀의 제2 수신 포인트에 대한 제2 공간 설정을 갖는 제2 채널에 대한 제2 전력을 결정하는 단계를 포함한다. 방법은 제1 전력 및 제1 공간 설정을 사용하는 제1 채널을 서빙 셀의 제1 수신 포인트로 송신하는 단계; 및 제2 전력 및 제2 공간 설정을 사용하는 제2 채널을 서빙 셀의 제2 수신 포인트로 송신하는 단계를 더 포함한다. 다른 기술적 특징은 다음의 도면, 설명 및 청구항으로부터 통상의 기술자에게 용이하게 명백할 수 있다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래의 상세한 설명을 착수하기 전에, 본 특허 문서 전체에 걸쳐 사용된 특정 단어 및 문구를 정의하는 것이 유 리할 수 있다. \"결합(couple)\"이라는 용어 및 이의 파생어는 둘 이상의 요소가 서로 물리적으로 접촉하든 접촉 하지 않든 둘 이상의 요소 간의 어떤 직접 또는 간접 통신을 지칭한다. \"송신한다\", \"수신한다\" 및 \"통신한다\" 이라는 용어뿐만 아니라 이의 파생어는 직접 및 간접 통신 둘 다를 포함한다. \"포함한다(include)\" 및 \"구성한 다(comprise)\"이라는 용어뿐만 아니라 이의 파생어는 제한 없이 포함(inclusion)을 의미한다. \"또는\"이라는 용 어는 포괄적이며, 및/또는(and/or)을 의미한다. \"~와 관련된(associated with)\"이라는 용어뿐만 아니라 이의 파 생어는, \"~를 포함하고(include)\", \"~내에 포함되고(included within)\", \"~와 상호 연결하고(interconnect with)\", \"~을 함유하고(contain)\", \"~내에 함유되고(be contained within)\", \"~에 또는, ~와 연결하고(connect to or with)\", \"~에 또는, ~와 결합하고(couple to or with)\", \"~와 통신 가능하고(be communicable with)\", \"~와 협력하고(cooperate with)\", \"~를 인터리브하고(interleave)\", \"~와 병치하고(juxtapose)\", \"~에 가까이 있고(be proximate to)\", \"~에 또는, ~와 묶이고(be bound to or with)\", \"가지고(have)\", \"소유하고 있고 (have a property of)\", \"~에 또는, ~와 관계를 가지고(have a relationship to or with)\" 등인 것을 의미한다. \"제어부\"라는 용어는 적어도 하나의 동작을 제어하는 임의의 장치, 시스템 또는 이의 일부를 의미한 다. 상기 제어부는 하드웨어 또는 하드웨어 및 소프트웨어의 조합 및/또는 펌웨어로 구현될 수 있다. 임의의 특 정 제어부와 관련된 기능은 로컬로든 원격으로든 중앙 집중화되거나 분산될 수 있다. \"적어도 하나(at least one of)\"라는 문구는, 엔트리의 리스트와 함께 사용될 때, 나열된 엔트리 중 하나 이상의 상이한 조합이 사용될 수 있고, 리스트 내에는 하나의 엔트리만이 필요할 수 있다는 것을 의미한다. 예를 들어, \"A, B 및 C 중 적어도 하나\"는 다음의 조합: A, B, C, A 및 B, A 및 C, B 및 C, 및 A 및 B 및 C 중 어느 하나를 포함한다. 더욱이, 아래에서 설명되는 다양한 기능은 하나 이상의 컴퓨터 프로그램에 의해 구현되거나 지원될 수 있으며, 각각의 컴퓨터 프로그램은 컴퓨터 판독 가능 프로그램 코드(computer readable program code)로부터 형성되고, 컴퓨터 판독 가능 매체(computer readable medium)에서 구현된다. \"애플리케이션\" 및 \"프로그램\"이라는 용어는 적절한 컴퓨터 판독 가능 프로그램 코드에서 구현을 위해 적응된 하나 이상의 컴퓨터 프로그램, 소프트웨어 구 성 요소(software components), 명령어 세트(sets of instructions), 절차, 기능, 객체(object), 클래스, 인스 턴스(instance), 관련된 데이터 또는 이의 일부를 지칭한다. 문구 \"컴퓨터 판독 가능 프로그램 코드\"는 소스 코 드(source code), 객체 코드(object code) 및 실행 가능 코드(executable code)를 포함하는 임의의 타입의 컴 퓨터 코드를 포함한다. 문구 \"컴퓨터 판독 가능 매체\"는 판독 전용 메모리(read only memory; ROM), 랜덤 액세 스 메모리(random access memory; RAM), 하드 디스크 드라이브, 콤팩트 디스크(compact disc; CD), 디지털 비 디오 디스크(digital video disc; DVD), 또는 임의의 다른 타입의 메모리와 같이 컴퓨터에 의해 액세스될 수 있 는 임의의 타입의 매체를 포함한다. \"비일시적(non-transitory)\" 컴퓨터 판독 가능 매체는 일시적 전기적 또는 다른 신호를 송신하는 유선, 무선, 광학 또는 다른 통신 링크를 배제한다. 비일시적 컴퓨터 판독 가능 매체는 데이터가 영구적으로 저장될 수 있는 매체, 및 재기록 가능 광 디스크 또는 소거 가능 메모리 장치와 같이 데이 터가 저장되고 나중에 중복 기록(overwriting)될 수 있는 매체를 포함한다. 다른 특정 단어 및 문구에 대한 정의는 본 특허 문서 전체에 걸쳐 제공된다. 통상의 기술자는 대부분의 경우는 아니지만 이러한 정의가 이러한 정의된 단어 및 문구의 이전 및 이후의 사용에 적용된다는 것을 이해해야 한다. 아래에서 논의되는 도 1 내지 도 24, 및 본 특허 문서에서 본 개시의 원리를 설명하기 위해 사용된 다양한 실시 예는 예시만을 위한 것이고, 어떤 식으로든 본 개시의 범위를 제한하는 것으로 해석되지 않아야 한다. 통상의 기술자는 본 개시의 원리가 적절히 배치된 임의의 시스템 또는 장치에서 구현될 수 있다는 것을 이해할 수 있다. 다음의 문서 및 표준 설명은 본 명세서에 충분히 설명된 바와 같이 본 개시에 참조로 통합된다: (i) 3GPP TS 38.211 v16.0.0, \"NR; Physical channels and modulation;\" (ii) 3GPP TS 38.212 v16.0.0, \"NR; Multiplexing and channel coding,\" (iii) 3GPP TS 38.213 v16.6.0, \"NR; Physical layer procedures for control,\" (iv) 3GPP TS 38.214 v16.0.0, \"NR; Physical layer procedures for data,\" (v) 3GPP TS 38.321 v15.8.0, \"NR; Medium Access Control (MAC) Protocol Specification,\" and (vi )3GPP TS 38.331 v15.8.0, \"NR; Radio Resource Control (RRC) Protocol Specification.\"4세대(4G) 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5세 대(5G) 또는 pre-5G/NR 통신 시스템을 개발하여 배치하기 위한 노력이 행해져 왔다. 따라서, 5G 또는 pre-5G 통 신 시스템은 또한 \"4G 네트워크 이후(beyond 4G network)\" 또는 \"LTE 이후(post long term evolution)\" 시스템 이라 불리어지고 있다. 5G 통신 시스템은 더 높은 데이터 송신률을 달성하기 위해 더 높은 주파수(mmWave) 대역, 예를 들어, 28GHz 또 는 60GHz 대역에서 구현되거나 강력한 커버리지 및 이동성 지원을 가능하게 하기 위해 6GHz와 같은 더 낮은 주 파수 대역에서 구현되는 것으로 간주된다. 무선파의 전파 손실을 감소시키고 송신 거리를 증가시키기 위해, 5G/NR 통신 시스템에서는 빔포밍, 거대한 MIMO(multiple-input multiple-output), FD-MIMO(full dimensional MIMO), 어레이 안테나, 아날로그 빔포밍 및 대규모 안테나 기술이 논의되고 있다. 또한, 5G/NR 통신 시스템에서는 진보된 소형 셀, 클라우드 무선 액세스 네트워크(RAN), 초고밀도 네트워크, 기 기 간(D2D) 통신, 무선 백홀, 이동 네트워크, 협력 통신, CoMP(coordinated multi-point), 수신 단 간섭 제거 등을 기반으로 하여 시스템 네트워크 개선을 위한 개발이 이루어지고 있다. 5G 시스템 및 이와 연관된 주파수 대역에 대한 논의는 본 개시의 특정 실시예가 5G 시스템에서 구현될 수 있음 에 따라 참조를 위한 것이다. 그러나, 본 개시는 5G 시스템 또는 이와 연관된 주파수 대역에 한정되지 않으며, 본 개시의 실시예는 임의의 주파수 대역과 관련하여 활용될 수 있다. 예를 들어, 본 개시의 양태는 또한 테라헤 르츠(THz) 대역을 사용할 수 있는 5G 통신 시스템, 6G 또는 그 이후 릴리스(release)의 배치에 적용될 수 있다. 네트워크 타입에 따라, '기지국(BS)'이라는 용어는 송신 포인트(transmit point, TP), 송수신 포인트 (transmit-receive point, TRP), 강화된 기지국(enhanced base station, eNodeB 또는 eNB), gNB, 매크로셀 (macrocell), 펨토셀(femtocell), WiFi 액세스 포인트(access point, AP), 위성, 또는 다른 무선 가능한 장치 (wirelessly enabled device)와 같이 네트워크에 무선 액세스를 제공하도록 구성된 임의의 구성 요소(또는 구성 요소의 세트)를 지칭할 수 있다. 기지국은 하나 이상의 무선 통신 프로토콜(wireless communication protocol), 예를 들어, 5G 3GPP New Radio Interface/Access(NR), LTE, LTE-A(LTE advanced), 고속 패킷 액세 스(high speed packet access, HSPA), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세스를 제공할 수 있다. 'BS', 'gNB' 및 'TRP'라는 용어는 본 특허 문서에서 원격 단말(remote terminal)에 무선 액세스를 제공하는 네 트워크 인프라 구성 요소(network infrastructure component)를 나타내는데 사용된다. 또한, 네트워크 타입에 따라, '사용자 장치(UE)'라는 용어는 이동국(mobile station), 가입자국(subscriber station), 원격 단말, 무 선 단말, 수신 포인트(receive point), 차량 또는 사용자 장치와 같은 임의의 구성 요소를 지칭할 수 있다. 예 를 들어, UE는 휴대 전화, 스마트폰, 모니터링 장치, 경보 장치, 차량 관리 장치, 자산 추적 장치, 자동차, 데 스크톱 컴퓨터, 엔터테인먼트 장치, 인포테인먼트 장치, 자판기, 전기 계량기, 수도 계량기, 가스 계량기, 보안 장치, 센서 장치, 가전 제품(appliance) 등일 수 있다. 아래의 도 1 내지 도 3은 무선 통신 시스템에서 OFDM(orthogonal frequency division multiplexing) 또는 OFDMA(orthogonal frequency division multiple access) 통신 기술을 사용하여 구현되는 다양한 실시예를 설명 한다. 도 1 내지 도 3의 설명은 상이한 실시예가 구현될 수 있는 방식에 대한 물리적 또는 구조적 제한을 의미 하지 않는다. 본 개시의 상이한 실시예는 적절하게 배치된 임의의 통신 시스템에서 구현될 수 있다. 도 1은 본 개시의 실시예에 따른 예시적인 무선 네트워크를 도시한다. 도 1에 도시된 무선 네트워크 의 실시예는 예시만을 위한 것이다. 무선 네트워크의 다른 실시예는 본 개시의 범위를 벗어나지 않고 사용 될 수 있다. 도 1에 도시된 바와 같이, 무선 네트워크는 기지국(BS)(예를 들어, gNB), BS 및 BS를 포함한다. BS는 BS 및 BS와 통신한다. BS는 또한 인터넷, 독점적 IP(Internet Protocol) 네트워크 또는 다른 데이터 네트워크와 같은 적어도 하나의 네트워크와 통신한다. BS는 BS의 커버리지 영역 내의 제1 복수의 사용자 장치(UE)에 대한 네트워크에 무선 광대 역 액세스(wireless broadband access)를 제공한다. 제1 복수의 UE는 소기업(small business; SB)에 위치될 수 있는 UE; 기업(enterprise; E)에 위치될 수 있는 UE; WiFi 핫 스폿(hotspot; HS)에 위치될 수 있는 UE; 제1 거주지(residence; R)에 위치될 수 있는 UE; 제2 거주지(R)에 위치될 수 있는 UE; 및 셀 폰(cell phone), 무선 랩톱(wireless laptop), 무선 PDA 등과 같은 모바일 장치(mobile device)(M)일 수 있 는 UE를 포함한다. BS는 BS의 커버리지 영역 내의 제2 복수의 UE에 대한 네트워크에 무선 광대역 액세스를 제공한다. 제2 복수의 UE는 UE 및 UE를 포함한다. 일부 실시예에서, BS(101-103) 중 하나 이상은 서로 통신하고, 5G/NR, LTE(long term evolution), LTE-A(long term evolution- advanced), WiMAX, WiFi 또는 다른 무선 통신 기술을 사용하여 UE(111-116)와 통신할 수 있다. 점선은 예시 및 설명만을 위해 거의 원형으로 도시되는 커버리지 영역(120 및 125)의 대략적인 범위를 보여준다. 커버리지 영역(120 및 125)과 같은 BS와 관련된 커버리지 영역은 BS의 설정 및 자연적 및 인공적 방 해물(man-made obstruction)과 관련된 무선 환경의 변화에 따라 불규칙한 형상을 포함하는 다른 형상을 가질 수 있다는 것이 명확히 이해되어야 한다. 아래에서 더욱 상세하게 설명되는 바와 같이, UE(111-116) 중 하나 이상은 업링크 송신의 우선 순위화 및 다중 업링크 송신의 전력 제어를 위한 회로, 프로그래밍, 또는 이의 조합을 포함한다. 특정 실시예에서, BS(101-103) 중 하나 이상은 업링크 송신의 우선 순위화 및 다중 업링크 송신의 전력 제어를 위한 회로, 프로그래밍, 또는 이의 조합을 포함한다. 도 1은 무선 네트워크의 일 예를 도시하지만, 도 1에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 무선 네트워크는 임의의 수의 BS 및 임의의 수의 UE를 임의의 적절한 배치에 포함시킬 수 있다. 또한, BS는 임의의 수의 UE와 직접 통신할 수 있고, 네트워크에 대한 무선 광대역 액세스를 이러한 UE에 제 공할 수 있다. 유사하게, 각각의 BS(102-103)는 네트워크와 직접 통신할 수 있고, 네트워크에 대한 직접 무선 광대역 액세스를 UE에 제공할 수 있다. 또한, BS(101, 102 및/또는 103)는 외부 전화 네트워크 또는 다른 타입의 데이터 네트워크와 같은 다른 또는 부가적인 외부 네트워크에 대한 액세스를 제공할 수 있다. 도 2는 본 개시의 실시예에 따른 예시적인 BS를 도시한다. 도 2에 도시된 BS의 실시예는 예시만을 위 한 것이며, 도 1의 BS(101 및 103)는 동일하거나 유사한 설정을 가질 수 있다. 그러나, BS는 다양한 설정을 가 지며, 도 2는 본 개시의 범위를 BS의 임의의 특정 구현으로 제한하지 않는다. 도 2에 도시된 바와 같이, BS는 다수의 안테나(205a-205n), 다수의 RF 송수신기(210a-210n), 송신 (transmit; TX) 처리 회로 및 수신(receive, RX) 처리 회로를 포함한다. BS는 또한 제어부/프 로세서, 메모리 및 백홀 또는 네트워크 인터페이스를 포함한다. RF 송수신기(210a-210n)는 안테나(205a-205n)로부터, 무선 네트워크에서 UE에 의해 송신된 신호와 같은 들 어오는(incoming) RF 신호를 수신한다. RF 송수신기(210a-210n)는 IF 또는 기저 대역 신호를 생성하도록 들어오 는 RF 신호를 하향 변환시킨다. IF 또는 기저 대역 신호(baseband signal)는 기저 대역 또는 IF 신호를 필터링, 디코딩 및/또는 디지털화함으로써 처리된 기저 대역 신호를 생성하는 RX 처리 회로로 송신된다. RX 처리 회로는 처리된 기저 대역 신호를 추가의 처리를 위한 제어부/프로세서로 송신한다. TX 처리 회로는 제어부/프로세서로부터(음성 데이터(voice data), 웹 데이터, 이메일 또는 대화형 비 디오 게임 데이터(interactive video game data)와 같은) 아날로그 또는 디지털 데이터를 수신한다. TX 처리 회 로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는(outgoing) 기저 대역 데이터를 인코딩, 다중 화 및/또는 디지털화한다. RF 송수신기(210a-210n)는 TX 처리 회로로부터 나가는 처리된 기저 대역 또는 IF 신호를 수신하고, 기저 대역 또는 IF 신호를 안테나(205a-205n)를 통해 송신되는 RF 신호로 상향 변환한다. 제어부/프로세서는 BS의 전체 동작을 제어하는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있다. 예를 들어, 제어부/프로세서는 잘 알려진 원리에 따라 RF 송수신기(210a-210n), RX 처리 회로 및 TX 처리 회로에 의해 업링크 채널 신호의 수신 및 다운링크 채널 신호의 송신을 제어할 수 있다. 제어부/프로세서는 더욱 진보된 무선 통신 기능과 같은 부가적인 기능을 또한 지원할 수 있다. 예를 들어, 제어부/프로세서는 업링크 송신의 우선 순위화 및 다중 업링크 송신의 전력 제어를 지원할 수 있다. 다양 한 다른 기능 중 임의의 기능은 제어부/프로세서에 의해 BS에서 지원될 수 있다. 일부 실시예에서, 제어부/프로세서는 적어도 하나의 마이크로프로세서 또는 마이크로 제어부를 포함한다. 제어부/프로세서는 또한 OS와 같은 메모리에 상주하는 프로그램 및 다른 프로세스를 실행할 수 있다. 제어부/프로세서는 실행 프로세스에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동할 수 있 다. 특정 실시예에서, 제어부/프로세서는 업링크 송신의 우선 순위화 및 다중 업링크 송신의 전력 제어를 지원한다. 예를 들어, 제어부/프로세서는 실행 중인 프로세스에 따라 데이터를 메모리 내외로 이동할 수 있다. 제어부/프로세서는 또한 백홀 또는 네트워크 인터페이스에 결합된다. 백홀 또는 네트워크 인터페이스 는 BS가 백홀 연결(backhaul connection) 또는 네트워크를 통해 다른 장치 또는 시스템과 통신할 수 있게 한다. 네트워크 인터페이스는 임의의 적절한 유선 또는 무선 연결을 통한 통신을 지원할 수 있다. 예를 들어, BS가 (5G, LTE 또는 LTE-A를 지원하는 것과 같은) 셀룰러 통신 시스템(cellular communication system)의 부분으로서 구현될 때, 네트워크 인터페이스는 BS가 유선 또는 무선 백홀 연결을 통해 다 른 BS와 통신할 수 있게 한다. BS가 액세스 포인트로서 구현될 때, 네트워크 인터페이스는 BS가 유선 또는 무선 로컬 영역 네트워크(local area network) 또는 유선 또는 무선 연결을 통해(인터넷과 같은) 더 큰 네트워크로 통신할 수 있게 한다. 인터페이스는 이더넷(Ethernet) 또는 RF 송수신기와 같은 유선 또는 무선 연결을 통한 통신을 지원하는 임의의 적절한 구조를 포함한다. 메모리는 제어부/프로세서에 결합된다. 메모리의 부분은 RAM을 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리(Flash memory) 또는 다른 ROM을 포함할 수 있다. 도 2는 BS의 일 예를 도시하지만, 도 2에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, BS는 도 2에 도시된 임의의 수의 각각의 구성 요소를 포함할 수 있다. 특정 예로서, 액세스 포인트는 다수의 네트워크 인터페이스를 포함할 수 있고, 제어부/프로세서는 상이한 네트워크 어드레스 사이에서 데이터를 라우 팅하기 위한 라우팅 기능(routing function)을 지원할 수 있다. 다른 특정 예로서, TX 처리 회로의 단일 인스턴스(instance) 및 RX 처리 회로의 단일 인스턴스를 포함하는 것으로 도시되어 있지만, BS는(RF 송수신기 당 하나와 같은) 각각의 다수의 인스턴스를 포함할 수 있다. 또한, 도 2의 다양한 구성 요소는 조합되 거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가될 수 있다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 3에 도시된 UE의 실시예는 예시만을 위 한 것이며, 도 1의 UE(111-115)는 동일하거나 유사한 설정을 가질 수 있다. 그러나, UE는 다양한 설정을 가지며, 도 3은 본 개시의 범위를 UE의 임의의 특정 구현으로 제한하지 않는다. 도 3에 도시된 바와 같이, UE는 안테나, RF 송수신기, TX 처리 회로, 마이크로폰 및 수신(RX) 처리 회로를 포함한다. UE는 또한 스피커, 프로세서, 입출력(input/output, I/O) 인터페이스(interface; IF), 입력 장치, 디스플레이 및 메모리를 포함한다. 메모리 는 운영 체제(operating system, OS) 및 하나 이상의 애플리케이션을 포함한다. RF 송수신기는, 안테나로부터, 무선 네트워크의 BS에 의해 송신된 들어오는 RF 신호를 수신한다. RF 송수신기는 중간 주파수(intermediate frequency; IF) 또는 기저 대역 신호를 생성하기 위 해 들어오는 RF 신호를 하향 변환한다. IF 또는 기저 대역 신호는 기저 대역 또는 IF 신호를 필터링, 디코딩 및 /또는 디지털화함으로써 처리된 기저 대역 신호를 생성하는 RX 처리 회로로 송신된다. RX 처리 회로 는 처리된 기저 대역 신호를 (음성 데이터에 대해서와 같은) 스피커 또는 (웹 브라우징 데이터(web browsing data)에 대해서와 같은) 추가의 처리를 위한 프로세서로 송신한다. TX 처리 회로는 마이크로폰으로부터 아날로그 또는 디지털 음성 데이터를 수신하거나 프로세서 로부터 (웹 데이터, 이메일 또는 대화형 비디오 게임 데이터와 같은) 다른 나가는 기저 대역 데이터를 수신한다. TX 처리 회로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는 기저 대역 데이터를 인 코딩, 다중화 및/또는 디지털화한다. RF 송수신기는 TX 처리 회로로부터 나가는 처리된 기저 대역 또 는 IF 신호를 수신하고, 기저 대역 또는 IF 신호를 안테나를 통해 송신되는 RF 신호로 상향 변환한다. 프로세서는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있고, UE의 전체 동작을 제어하 기 위해 메모리에 저장된 OS를 실행할 수 있다. 예를 들어, 프로세서는 잘 알려진 원리에 따라 RF 송수신기, RX 처리 회로 및 TX 처리 회로에 의해 업링크 채널 신호의 수신 및 다운링크 채널 신호의 송신을 제어할 수 있다. 일부 실시예에서, 프로세서는 적어도 하나의 마이크로 프로세서 또는 마이 크로 제어부를 포함한다. 프로세서는 또한 다중 업링크 송신의 전력 제어 및 업링크 송신의 우선 순위화를 위한 프로세스와 같이 메 모리에 상주하는 다른 프로세스 및 프로그램을 실행할 수 있다. 프로세서는 실행 프로세스(executing process)에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동시킬 수 있다. 일부 실시예에서, 프로세 서는 OS에 기초하거나 BS 또는 오퍼레이터로부터 수신된 신호에 응답하여 애플리케이션을 실행 하도록 설정된다. 프로세서는 또한 랩톱 컴퓨터 및 핸드헬드 컴퓨터(handheld computer)와 같은 다른 장치 에 연결하는 능력을 UE에 제공하는 I/O 인터페이스에 결합된다. I/O 인터페이스는 이러한 액세 서리(accessory)와 프로세서 사이의 통신 경로(communication path)이다. 프로세서는 또한 입력 장치에 결합된다. UE의 오퍼레이터는 입력 장치를 사용하여 데이터 를 UE에 입력할 수 있다. 입력 장치는 키보드, 터치스크린, 마우스, 트랙 볼(track ball), 음성입력, 또는 사용자가 UE와 상호 작용할 수 있도록 하는 사용자 인터페이스로서 작용할 수 있는 다른 장치 일 수 있다. 예를 들어, 입력 장치는 음성 인식 처리를 포함할 수 있으며, 이에 의해 사용자가 음성 명령 을 입력할 수 있다. 다른 예에서, 입력 장치는 터치 패널, (디지털) 펜 센서, 키, 또는 초음파 입력 장치 를 포함할 수 있다. 터치 패널은, 예를 들면, 정전 용량 방식(capacitive scheme), 감압 방식(pressure sensitive scheme), 적외선 방식 또는 초음파 방식과 같은 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 프로세서는 또한 디스플레이에 결합된다. 디스플레이는 액정 디스플레이(liquid crystal display), 발광 다이오드 디스플레이(light emitting diode display), 또는 웹 사이트(web site)로부터와 같이 텍스트 및/또는 적어도 제한된 그래픽을 렌더링(rendering)할 수 있는 다른 디스플레이일 수 있다. 메모리는 프로세서에 결합된다. 메모리의 일부는 랜덤 액세스 메모리(random access memory; RAM)를 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리 또는 다른 판독 전용 메모리(read-only memory; ROM)를 포함할 수 있다. 도 3은 UE의 일 예를 도시하지만, 도 3에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 3의 다양 한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가 될 수 있다. 특정 예로서, 프로세서는 하나 이상의 중앙 처리 유닛(central processing unit; CPU) 및 하 나 이상의 그래픽 처리 유닛(graphics processing unit; GPU)과 같은 다수의 프로세서로 분할될 수 있다. 또한, 도 3은 이동 전화 또는 스마트 폰으로서 설정된 UE를 도시하지만, UE는 다른 타입의 이동 또는 고정 장치 로서 동작하도록 설정될 수 있다. 도 4 및 도 5는 본 개시에 따른 예시적인 무선 송수신 경로를 도시한다. 다음의 설명에서, 도 4의 송신 경로 는 BS(예컨대, BS)에서 구현되는 것으로서 설명될 수 있지만, 도 5의 수신 경로는 UE(예컨대, UE)에서 구현되는 것으로서 설명될 수 있다. 그러나, 수신 경로는 BS에서 구현될 수 있고, 송신 경로 는 UE에서 구현될 수 있다는 것이 이해될 수 있다. 일부 실시예에서, 수신 경로는 본 개시의 실시예 에서 설명된 바와 같이 업링크 송신의 우선 순위화 및 다중 업링크 송신의 전력 제어를 지원하도록 설정된다. 도 4에 도시된 바와 같이, 송신 경로는 채널 코딩 및 변조 블록(channel coding and modulation block), 직렬 대 병렬(serial-to-parallel; S-to-P) 블록, 크기 N 역 고속 푸리에 변환(inverse fast Fourier transform; IFFT) 블록, 병렬 대 직렬(parallel-to-serial; P-to-S) 블록, 사이클릭 프리픽스 부가 블록(add cyclic prefix block) 및 상향 변환기(up-converter; UC)를 포함한다. 도 5 에 도시된 바와 같이, 수신 경로는 하향 변환기(down-converter; DC), 사이클릭 프리픽스 제거 블록 (remove cyclic prefix block), 직렬 대 병렬(S-to-P) 블록, 크기 N 고속 푸리에 변환(FFT) 블록 , 병렬 대 직렬(P-to-S) 블록, 및 채널 디코딩 및 복조 블록(channel decoding and demodulation block)을 포함한다. 도 4에 도시된 바와 같이, 채널 코딩 및 변조 블록은 정보 비트(information bit)의 세트를 수신하고, 코 딩(예컨대, LDPC(low-density parity check) 코딩)을 적용하며, 일련의 주파수 도메인 변조 심볼(frequency- domain modulation symbol)을 생성하기 위해 입력 비트(예컨대, QPSK(quadrature phase shift keying) 또는 QAM(quadrature amplitude modulation))를 변조시킨다. 직렬 대 병렬 블록은 N이 BS 및 UE에서 사용되는 IFFT/FFT 크기인 N개의 병렬 심볼 스트림(parallel symbol stream)을 생성하기 위해 직렬 변조된 심볼 (serial modulated symbol)을 병렬 데이터(parallel data)로 변환한다(예컨대, 역다중화한다(de-multiplex)). 크기 N IFFT 블록은 시간-도메인 출력 신호(time-domain output signal)를 생성하기 위해 N개의 병렬 심 볼 스트림 상에서 IFFT 연산을 수행한다. 병렬 대 직렬 블록은 직렬 시간-도메인 신호(serial time-domain signal)를 생성하기 위해 크기 N IFFT 블록으로부터의 병렬 시간-도메인 출력 심볼(parallel time-domain output symbol)을 변환한다(예컨대, 다중화한다). 사이클릭 프리픽스 부가(add cyclic prefix) 블록은 사 이클릭 프리픽스(cyclic prefix)를 시간-도메인 신호에 삽입한다. 상향 변환기는 무선 채널을 통한 송신을 위해 '사이클릭 프리픽스 부가 블록의 출력을 RF 주파수로 변조시킨다(예를 들어, 상향 변환시킨다). 신호 는 또한 RF 주파수로 변환하기 전에 기저 대역에서 필터링될 수 있다. BS로부터 송신된 RF 신호는 무선 채널을 통과한 후에 UE에 도달하고, BS에서의 동작과의 역 동 작(reverse operation)은 UE에서 수행된다. 도 5에 도시된 바와 같이, 하향 변환기는 수신된 신호를 기저 대역 주파수로 하향 변환시키고, 사이클릭 프리픽스 제거(remove cyclic prefix)' 블록은 직렬 시간-도메인 기저 대역 신호를 생성하기 위해 사이클 릭 프리픽스를 제거한다. 직렬 대 병렬 블록은 시간-도메인 기저 대역 신호를 병렬 시간-도메인 신호로 변 환한다. 크기 N FFT 블록은 N개의 병렬 주파수 도메인 신호를 생성하기 위해 FFT 알고리즘을 수행한다. 병 렬 대 직렬 블록은 병렬 주파수 도메인 신호를 일련의 변조된 데이터 심볼로 변환한다. 채널 디코딩 및 복 조 블록은 원래의 입력 데이터 스트림을 복원하기 위해 변조된 심볼을 복조하고 디코딩한다. BS(101-103)의 각각은 도 4에 도시되어 있는 바와 같이 다운링크에서 UE(111-116)로 송신하는 것과 유사한 송신 경로를 구현할 수 있고, 도 5에 도시되어 있는 바와 같이, 업링크에서 UE(111-116)로부터 수신하는 것과 유사한 수신 경로를 구현할 수 있다. 마찬가지로, UE(111-116)의 각각은 업링크에서 BS(101-103)로 송신하 기 위한 송신 경로를 구현할 수 있고, 다운링크에서 BS(101-103)로부터 수신하기 위한 수신 경로를 구현할 수 있다. 도 4 및 도 5에서의 각각의 구성 요소는 하드웨어만을 사용하거나 하드웨어와 소프트웨어/펌웨어의 조합을 사용 하여 구현될 수 있다. 특정 예로서, 도 4 및 도 5에서의 구성 요소 중 적어도 일부는 소프트웨어로 구현될 수 있지만, 다른 구성 요소는 설정 가능한 하드웨어 또는 소프트웨어 및 설정 가능한 하드웨어의 혼합에 의해 구현 될 수 있다. 예를 들어, FFT 블록 및 IFFT 블록은 설정 가능한 소프트웨어 알고리즘으로서 구현될 수 있으며, 여기서 크기 N의 값은 구현에 따라 수정될 수 있다. 또한, FFT 및 IFFT를 사용하는 것으로서 설명되었지만, 이는 예시일 뿐이며, 본 개시의 범위를 제한하는 것으로 해석될 수 없다. 이산 푸리에 변환(discrete Fourier transform, DFT) 및 역이산 푸리에 변환(inverse discrete Fourier transform, IDFT) 함수와 같은 다른 타입의 변환이 사용될 수 있다. DFT 및 IDFT 함수에 대 해 N 변수의 값은 임의의 정수(예컨대, 1, 4, 3, 4 등)일 수 있지만, FFT 및 IFFT 함수에 대해서는 N 변수의 값 은 2의 거듭 제곱인 임의의 정수(즉, 1, 2, 4, 8, 16 등)일 수 있다는 것이 이해될 수 있다. 도 4 및 도 5는 무선 송수신 경로의 예를 도시하지만, 도 4 및 도 5에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 4 및 도 5에서의 다양한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필 요에 따라 부가적인 구성 요소가 부가될 수 있다. 또한, 도 4 및 도 5는 무선 네트워크에서 사용될 수 있는 타 입의 송수신 경로의 예를 도시하기 위한 것이다. 무선 네트워크에서 무선 통신을 지원하기 위해 다른 적절한 아 키텍처가 사용될 수 있다. 특정 실시예에서, UE가 (i) 다중 셀에서의 동작, (ii) 반송파 집성(carrier aggregation)에 관한 동작, 또는 (iii) 다수의 송수신 포인트(transmission/reception point; TRP)에 관한 동작을 위해 설정될 경우, UE는 다중 셀, 동일한 셀의 다중 반송파 상의 송신, 또는 동일한 셀 또는 상이한 셀의 다중 TRP로의 송신을 위한 공간 설 정을 제공받거나 결정한다. 예를 들어, 셀이 2개인 경우, 또는 동일한 셀의 반송파가 2개인 경우 또는 셀의 TRP 가 2개인 경우를 고려하면, UE는 공간 설정 0인 셀 0과 공간 설정 1인 셀 1 상에서 송신하도록 설정될 수 있다. 셀 0 및 셀 1은 동일한 셀일 수 있고, 상이한 공간 설정을 갖는 2개의 송신은 셀에 대한 상이한 수신 포인트에 상응할 수 있다. 본 개시의 실시예는 UE가 상이한 공간 설정을 사용하여 동시에 송신할 수 없고, 임의의 주어진 시간에 UE가 공 간 설정 세트로부터 하나의 공간 설정을 사용하여 송신할 수 있다는 것을 고려한다. 예를 들어, UE에는 하나의 송신 안테나 패널이 장착될 수 있거나 두 개의 패널이 장착될 수 있지만, 주어진 시간에 하나의 패널만이 활성 화되고, 그런 다음 UE는 주어진 시간에 하나의 공간 설정만으로 송신할 수 있다. gNB는 상이한 공간 설정을 갖 는 TDM 방식으로 PUSCH 송신을 스케줄링할 수 있다. UE가 반복적으로 PUSCH를 송신하도록 설정되는 경우, 공간 설정이 상이한 송신에 TDM을 사용하는 것은 자원 할 당, 지연 시간(latency) 및 성능 측면에서 비효율적일 수 있다. 스케줄링되지 않은/설정된 송신이 또한 고려되 어야 한다. 설정된 승인(configured grant; CG) PUSCH 자원이 gNB에 의해 UE에 설정되면, UE는 상위 계층에 의 해 설정된 주기와 반복 횟수로 CG-PUSCH를 송신한다. 예를 들어, 주어진 슬롯에서, 제2 공간 설정을 갖는 CG- PUSCH 송신과 충돌하는(동시에) 제1 공간 설정을 갖는 PUSCH 반복이 있을 수 있다. UE에 반송파 집성(CA) 또는 이중 연결(dual connectivity; DC) 동작이 설정되는 경우, UE는 다수의 구성 요소 반송파/셀 상에서 동시에 송신할 수 있다. 예를 들어, CA 동작의 경우, 제1 셀 상에서 제1 공간 설정을 사용하 는 PUSCH 송신과 제2 셀 상에서 제2 공간 설정을 사용하는 PUSCH 송신의 반복이 있을 수 있다. 이러한 경우, UE 가 주어진 시간에 하나의 공간 설정만을 사용하여 송신할 수 있는 경우, PUSCH 송신의 우선 순위화를 위한 규칙 이 정의될 필요가 있다. UE가 제1 공간 설정을 가진 제1 PUSCH 송신을 우선 순위화할 경우, UE는 제1 공간 설정을 가진 우선 순위화된 PUSCH 송신과 중첩하는 제1 심볼 이전에 제1 공간 설정과 상이한 공간 설정을 가진 다른 송신을 취소할 것으로 예상된다. 대안적으로, UE는 나중 송신 오케이젼까지 우선 순위가 낮은(deprioritized) 송신을 연기할 수 있다. 송신 오케이젼은 슬롯 또는 길이 l의 연속 심볼 그룹일 수 있으며, 이다. 따라서, 본 개시의 실시예는 UE가 다중 반송파/셀과 동작하거나 다중 공간 설정으로 송신과 동작하기 위해 설정 될 경우 PUSCH 송신의 우선 순위화를 위한 규칙을 정의할 필요가 있음을 고려한다. 본 개시의 실시예는 또한 UE가 PUSCH 송신의 우선 순위를 결정하는 수단을 제공할 필요가 있음을 고려한다. 본 개시의 실시예는 gNB가 UE에 의한 PUSCH 송신의 우선 순위를 UE에 나타내기 위한 시그널링 메커니즘을 제공 할 필요가 있음을 더 고려한다. 따라서, 본 개시는 다수의 셀에서의 동작을 위해 UE로부터의 송신에 대한 우선 순위를 정의하는 것에 관한 것이다. 동작은 CA와의 동작을 포함할 수 있다. 동작은 다수의 TRP(여기서 TRP는 UE(송신 포인트)에 의한 수신을 위 한 공간 설정에 의해 정의됨)과의 동작을 포함할 수 있다. 동작은 UE(수신 포인트)에 의한 송신을 위한 동작을 포함할 수 있다. 본 개시는 또한 서빙 gNB에 의한 설정 및/또는 UE에 의해 추정된 파라미터에 기초하여 UE로부 터의 PUSCH 및 PUCCH 송신을 중첩하기 위한 우선 순위를 결정하는 것에 관한 것이다. 본 개시는 상이한 셀 또는 반송파 상에서 공간 설정이 상이한 PUSCH 및 PUCCH 송신에 대한 전력 감소를 위한 우 선 순위를 결정하는 것에 관한 것이다. 본 개시는 또한 UE에 대한 송신 우선 순위를 설정하고 나타내는 것에 관 한 것이다. 본 개시는 또한 공간 설정으로 PUSCH 송신의 전력을 결정하는 것에 관한 것이다. 본 개시는 부가적 으로 공간 설정으로 PUCCH 송신의 전력을 결정하는 것에 관한 것이다. 본 개시는 또한 UE에 대해 반복하여 송신 을 위한 우선 순위를 결정하는 것에 관한 것이다. 부가적으로, 본 개시는 또한 송신이 반복될 경우 UE로부터의 PUSCH 및 PUCCH 송신을 중첩하기 위한 우선 순위를 결정하는 것에 관한 것이다. 부가적으로, 본 개시는 서빙 gNB에 의한 설정 또는 인디케이션에 기초하여 UE에 의 한 PUSCH 또는 PUCCH 송신에 대한 우선 순위를 결정하는 것에 관한 것이다. 본 개시는 또한 UE가 더 낮은 우선 순위의 송신을 취소하거나 연기하기 위한 규칙을 정의하는 것에 관한 것이다. 본 개시는 또한 서빙 gNB에 의한 설정 또는 인디케이션에 기초하여 더 낮은 우선 순위를 갖는 송신을 취소할지 또는 연기할지를 UE가 결정하는 것에 관한 것이다. UE는 상이한 공간 설정을 사용하여 동시에 송신할 수 없을 수 있고, 임의의 주어진 시간에 UE는 공간 설정 세트 로부터 하나의 공간 설정을 사용하여 송신할 수 있다는 것이 주목된다. UE에는 하나의 송신 안테나 패널이 장착 될 수 있거나 두 개의 패널이 장착될 수 있지만, 주어진 시간에 하나의 패널만이 활성화되고, 그런 다음 UE는 주어진 시간에 하나의 공간 설정만으로 송신할 수 있다. gNB는 상이한 공간 설정을 갖는 TDM 방식으로 PUSCH 송 신을 스케줄링할 수 있다. 다음의 실시예에서, PUSCH 반복 타입 A가 설정되는 UE(예를 들어, UE)는 슬롯에서 단일 반복의 송신을 지 칭하며, 여기서 반복의 모든 심볼은 슬롯 지속 시간(slot duration) 내에서 송신되고, 반복은 동일한 수의 심볼 에 걸쳐 있으며, 해당 심볼이 예약된(reserved) 심볼 또는 다운링크 송신 방향을 갖는 심볼과 같이 UE에 의한 송신에 사용할 수 없는 심볼을 포함하는 경우 슬롯에서의 반복은 스킵(skip)될 수 있다. PUSCH 반복 타입 B가 설정된 UE는 UE가 슬롯에서 하나 이상의 반복을 송신할 수 있고, 하나의 반복이 하나 이상의 슬롯에 걸쳐 있을 수 있으며, 상이한 반복이 상이한 수의 심볼에 걸쳐 있을 수 있는 경우를 포함한다. 반복 타입 B를 갖는 PUSCH 송신을 스케줄링하는 다운링크 제어 정보(downlink control information, DCI) 포맷은 초기/제1 반복을 위한 심볼의 수를 나타낼 수 있다. PUSCH 반복이 UE에 설정되지 않은 경우, UE는 제1(초기) 반복만을 송신한다. 특정 실시예에서, 우선 순위화는 PUCCH 설정에 기초한다. 예를 들어, UE로부터의 PUSCH 송신이 셀 0과 셀 1 상 에 설정되고, 상이한 공간 설정이 셀 0과 셀 1 상에서 송신을 위해 사용되며, UE는 주어진 시간에 하나의 공간 설정만을 사용하여 송신할 수 있는 경우, UE는 셀 상에서 송신을 우선 순위화하며, 여기서 UE는 PUSCH 송신이 반복으로 설정되는지 또는 PUSCH 송신이 DCI 포맷에 의해 스케줄링(DG-PUSCH)되는지 또는 상위 계층에 의해 설 정(CG-PUSCH)되는지 여부에 관계없이 PUCCH를 송신하도록 설정된다. UE가 PUSCH를 송신하는 셀 또는 반송파 중 임의의 셀 또는 반송파 상에서 PUCCH 송신을 위해 설정되지 않은 경우 또는 UE가 셀 또는 반송파 모두에서 PUCCH 송신을 설정한 경우, UE는 PUSCH 송신이 반복하여 설정되는지를 송신의 우선 순위를 위해 고려한다. 예를 들어, UE는 더 적은 반복 횟수(반복이 없음을 포함함)로 설정된 송신을 우선 순위화할 수 있다. 이러한 우선 순 위화는 다른 조건과 상관없이 적용될 수 있다. 비주기적 CSI 보고를 포함하는 PUSCH 반복은 다른 PUSCH 송신 또는 반복이 있거나 없는 PUCCH 송신을 통한 송신에 대해 우선 순위화될 수 있다. 다른 예의 경우, UE에 대하여 셀 또는 반송파 상에서 PUCCH 송신이 설정될 경우, 적어도 UE가 동일한 슬롯에서 PUCCH를 송신하려 하고(would transmit), UCI가 PUSCH 송신에서 다중화되거나 UE가 셀 또는 반송파 상에서 PUSCH 및 PUCCH를 동시에 송신하는 경우 PUSCH 송신은 셀 또는 반송파 상에서 우선 순위화될 수 있다. 또 다른 예의 경우, UE에 대하여 셀 또는 반송파 모두에서 PUCCH 송신이 설정될 경우, UE는 셀 또는 반송파 상 에서 PUSCH 송신을 우선 순위화할 수 있다. 여기서, PUCCH 송신은 (i) HARQ-ACK 정보를 포함하거나, (ii) 더 큰 수의 심볼을 갖거나, (iii) 반복으로 설정되지 않거나, (iv) 더 적은 수의 반복이 설정되거나, (v) 제1 PUCCH 반복을 포함한다. 도 6은 본 개시의 실시예에 따라 UE가 주어진 송신 발생(transmission occurrence)에서 셀 0 상의 제1 물리적 업링크 공유 채널(PUSCH) 및 셀 1 상의 제2 PUSCH를 송신하는 예시적인 방법을 도시한다. 예를 들어, 방법 의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116)에 의해 수행될 수 있다. 도 6의 방법 은 단지 예시를 위한 것이며, 다른 실시예는 본 개시의 범위로부터 벗어나지 않고 사용될 수 있다. 단계에서, (UE와 같은) UE는 셀 0 상에서 제1 공간 설정을 갖는 제1 PUSCH를 송신하고, 셀 1 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하도록 설정된다. 단계에서, UE는 셀 0 상에서 PUCCH를 송신하도록 설정된다. 송신 오케이젼에서, UE는 셀 0 상에서 제1 PUSCH를 송신하고, 셀 1 상에서 제2 PUSCH를 송신하려 할 수 있다(단계). 송신 오케이젼에서, UE는 셀 0 상에서 제1 PUSCH를 송신하고, 셀 1 상에서 제2 PUSCH의 송 신을 취소한다(단계). 도 6은 방법을 도시하지만, 도 6에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 6의 방법이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법 의 단계는 상이한 순서로 실행될 수 있다. 특정 실시예에서, 우선 순위화는 동적 또는 설정된 승인 송신에 기초한다. 예를 들어, UE가 UL 승인(UL grant) 에 의하여 스케줄링된 제1 공간 설정을 갖는 PUSCH(DG-PUSCH) 및 제1 공간 설정과 상이한 제2 공간 설정을 갖는 CG-PUSCH를 송신하려 하고, DG- PUSCH와 CG-PUSCH 송신이 시간적으로 중첩되고, UE가 공간 설정이 상이한 송신 을 동시에 할 수 없는 경우, UE는 DG-PUSCH를 송신하고, CG-PUSCH 송신을 취소한다. 특정 실시예에서, 우선 순위화는 경로 손실 추정에 기초한다. 예를 들어, UE가 셀 0 상에서 제1 공간 설정을 가 진 제1 PUSCH를 송신하려 하고, 셀 1 상에서 제2 공간 설정을 가진 제2 PUSCH를 송신하려 하고, UE가 셀 1 상에 서 제2 PUSCH 송신에 대해 추정된 PL보다 작은 셀 0 상의 제1 PUSCH 송신에 대한 경로 손실(path loss; PL)을 추정하는 경우, UE는 셀 0 상에서 제1 PUSCH를 송신하고, 제2 PUSCH를 송신하지 않는다. UE는 하나 이상의 기준 신호(예를 들어, PUSCH-PathlossReferenceRS 또는 enableDefaultBeamPlForPUSCH)의 수신을 기반으로 PL을 측정 하거나, UE는 UE가 마스터 정보 블록(master information block; MIB)를 획득하기 위해 사용하는 것과 동일한 SS/PBCH(synchronization signals/primary broadcast channel) 블록 인덱스를 갖는 SS/PBCH 블록으로부터 RS 자원을 사용하여 PL을 계산한다. 이 예에서, UE는 (i) 셀 0 상에서 제1 공간 설정을 갖는 제1 PUSCH를 송신하려 하고, (ii) 셀 1 상에서 제2 공 간 설정을 갖는 제2 PUSCH를 송신하려 하고, 여기서 제1 및 제2 PUSCH 송신은 시간적으로 중첩될 것이며, (iii) UE는 셀 0 상에서 제1 공간 설정과 동일하거나 상이할 수 있는 제3 공간 설정을 갖는 제1 PUCCH를 송신하도록 설정되고, (iv) 셀 1 상에서 제2 공간 설정과 동일하거나 상이할 수 있는 제4 공간 설정을 갖는 제2 PUCCH를 송 신하도록 설정되며, (v) 셀 0 상에서 추정된 PL이 셀 1 상에서 추정된 PL보다 작으면, UE는 셀 0 상에서 제1 PUSCH를 송신한다. UE가 송신할 PUSCH의 결정은 또한 PUCCH 송신의 내용(contents)을 고려할 수 있다. 예를 들어, 제2 PUCCH가 HARQ-ACK 정보를 포함하고, 제1 PUCCH가 HARQ-ACK 정보를 포함하지 않는 경우, UE는 셀 1 상에서 제2 PUSCH를 송신한다. 또한 UE는 송신할 PUCCH를 위한 결정에 기초하여 송신할 PUSCH를 결정할 수 있으며, 여기서 예를 들 어 UE는 셀 0 상에서 제1 PUCCH를 송신하고, 셀 1 상에서 제2 PUSCH를 송신한다. UE가 송신할 PUCCH의 결정은 셀 0과 셀 1 상에서 추정된 PL을 고려할 수 있다. UE는 PUCCH PL 추정에 사용할 기준 신호 세트(예를 들어, PUCCH-PathlossReferenceRS 또는 enableDefaultBeamPlForPUCCH)를 수신하거나, UE는 UE가 MIB를 획득하기 위해 사용하는 것과 동일한 SS/PBCH블록 인덱스를 가진 SS/PBCH 블록으로부터의 RS 자원을 사용하여 PL을 계산한다. 특정 실시예에서, UE는 (i) 셀 0 상에서 제1 공간 설정을 갖는 제1 PUSCH를 송신하려 하고, (ii) 셀 1 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하려 하고, 여기서 제1 및 제2 PUSCH 송신은 시간적으로 중첩될 것이며, (iii) UE는 셀 0 상에서 제1 공간 설정과 동일하거나 상이한 제3 공간 설정을 갖는 제1 PUCCH를 송신하도록 설 정되고, (iv) 셀 1 상에서 제2 공간 설정과 동일하거나 상이한 제4 공간 설정을 갖는 제2 PUCCH를 송신하도록 설정되며, (v) 제1 공간 설정에 상응하는 셀 0 상에서 추정된 PL이 제2 공간 설정에 상응하는 셀 1 상에서 추정 된 PL보다 작은 경우, UE는 셀 0 상에서 제1 PUSCH를 송신한다. UE가 송신할 PUSCH의 결정은 또한 UE가 셀 0 상에서 제1 공간 설정과 상이한 제3 공간 설정을 갖는 제1 PUCCH를 송신하고 셀 1 상에서 제2 공간 설정과 상이한 제4 공간 설정을 갖는 제2 PUCCH를 송신하도록 설정되고, 제3 공 간 설정에 상응하는 셀 0 상에서 추정된 PL이 제4 공간 설정에 상응하는 셀 1 상에서 추정된 PL보다 작은 경우, UE가 셀 0 상에서 제1 공간 설정을 갖는 제1 PUSCH 및 제3 공간 설정을 갖는 제1 PUCCH를 송신한다는 것을 고려 할 수 있다. UE는 상응하는 DL 공간 설정, 예를 들어 PUSCH 송신을 위한 UL 승인을 송신하는 데 사용되는 채널 로부터의 PUSCH-PathlossReferenceRS 또는 enableDefaultBeamPlForPUSCH 또는 PUCCH 송신을 스케줄링하는 데 사용되는 채널로부터의 PUCCH-PathlossReferenceRS 또는 enableDefaultBeamPlForPUCCH로 송신되는 기준 신호의 수신에 기초하여 공간 설정에 상응하는 PL을 측정할 수 있다. 특정 실시예에서, 우선 순위화는 요구되는 송신 전력에 기초한다. 본 실시예는 아래의 예에서 설명된다. 예를 들어, (UE와 같은) UE가 셀 0 상에서 제1 공간 설정을 갖는 제1 PUSCH를 송신하려 하고, 셀 1 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하려 하며, 셀 0 상에서 제1 PUSCH 송신에 필요한 송신 전력이 셀 1 상 에서 제2 PUSCH 송신에 필요한 전력보다 낮으면, UE는 셀 0 상에서 제1 PUSCH를 송신하고 제2 PUSCH 송신을 취 소한다. 다른 예의 경우, (UE와 같은) UE가 셀 0 상에서 제1 공간 설정을 갖는 제1 PUSCH를 송신하려 하고, 셀 1 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하려 하고, UE가 제1 및 제2 PUSCH 송신에 대해서와 동일하거나 상이한 공간 설정을 갖는 셀 0 및 셀 1 모두에서 PUCCH를 송신하도록 설정되며, 셀 0 상에서 필요한 PUCCH 송신 전력이 셀 1 상에서 필요한 PUCCH 송신 전력보다 낮은 경우, UE는 셀 0 상에서 제1 PUSCH 송신을 우선 순위화한 다. 특정 실시예에서, 우선 순위화는 CORESETPoolIndex 값에 기초한다. 본 실시예는 아래의 예에서 설명된다. 예를 들어, (UE와 같은) UE가 0과 동일한 CORESETPoolIndex에 의해 제공된 인덱스를 갖는 1차 셀(primary cell) 상의 제어 자원 세트(control resource set; CORESET)에서 PDCCH 수신에 의해 스케줄링되는 제1 공간 설 정을 갖는 제1 PUSCH와 셀 1 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하려 하는 경우, UE는 셀 0 상에서 제1 PUSCH를 송신하고, 제2 PUSCH를 송신하지 않는다. 특정 실시예에서, CA/DC 동작에 대한 우선 순위화가 발생한다. 본 실시예는 아래의 예에서 설명된다. 예를 들어, CA 동작이 설정된 UE에 대해, UE가 1차 셀 상에서 제1 공간 설정을 갖는 제1 PUSCH를 송신하려 하고, UE가 SCell 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하려 하는 경우, UE는 1차 셀 상에서 제1 PUSCH를 송신하고, SCell 상에서 제2 PUSCH를 송신하지 않는다. 다른 예의 경우, DC 동작에 대해, UE가 마스터 셀 그룹(master cell group, MCG)의 셀 상에서 제1 공간 설정을 가진 제1 PUSCH를 송신하려 하고, 2차 셀 그룹(secondary cell group, SCG)의 셀 상에서 제2 공간 설정을 가진 제2 PUSCH를 송신하려 하는 경우, UE는 MCG의 셀 상에서 제1 PUSCH를 송신한다. SCG의 셀 상에서의 송신보다 MCG의 셀 상에서의 송신의 우선 순위는 또한 각각의 송신의 정보 내용에 따라 달라 질 수 있다. 예를 들어, UE는 MCG 상에서의 업링크 제어 정보(UCI) 없이 PUSCH를 송신하는 것보다 SCG 상에서의 PUCCH를 송신하는 것을 우선 순위화할 수 있지만, UE는 SCG 상에서의 PUCCH를 송신하는 것보다 MCG 상에서 UCI 를 갖는 PUSCH를 송신하는 것을 우선 순위화할 수 있다. 예를 들어, UE는 MCG 상에서의 PUSCH 또는 PUCCH 송신 보다 SCG의 1차 셀과 같은 SCG 상에서의 물리적 랜덤 액세스 채널(physical random access channel, PRACH)의 송신을 우선 순위화할 수 있다. UE가 UCI 없는 제2 PUSCH 송신 및 제2 셀 상의 제2 공간 설정보다 UCI를 가진 제1 PUSCH 송신 및 제1 셀 상의 제1 공간 설정을 우선 순위화할 수 있는 CA와의 동작을 위해 유사한 우선 순위 화가 적용될 수 있다. 특정 실시예에서, 우선 순위화는 PUSCH 송신을 위한 시간 패턴에 기초한다. 본 실시예는 아래의 예 및 도 7에서 설명된다. 예를 들어, UE가 셀 0 또는 MCG 상에서 제1 공간 설정을 갖는 제1 PUSCH를 송신하고 셀 1 또는 SCG 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하도록 설정되는 경우, gNB는 상위 계층이 셀 0 또는 셀 1로의 송신을 위한 시간 패턴을 UE에 제공할 수 있다. 시간 패턴은 비트맵을 통해 정의될 수 있으며, 여기서 비트맵의 각각의 비트 는 슬롯과 같은 시간 단위에 상응한다. 시간 단위는 MCG의 1차 셀의 SCS와 같은 기준 부반송파 간격(subcarrier spacing, SCS)에 대한 슬롯에 대해 정의될 수 있거나 0.5ms 또는 1ms와 같은 절대 시간일 수 있다. 제1 시간 간 격에서, UE는 비트맵의 상응하는 비트가 '0'인 경우 셀 0으로 송신을 우선 순위화하고, 비트맵의 상응하는 비트 가 '1'인 경우 셀 1로 송신을 우선 순위화한다. 시간 패턴은 gNB에 의해 설정되거나 시간 패턴의 비트맵 크기에 따라 암시적으로 결정되는 시간 단위의 수의 주기로 주기적일 수 있다. 예를 들어, 시간 패턴은 셀 0 상의 간섭 이 적은 슬롯 동안 셀 0으로의 송신이 나타내어질 수 있고, 셀 1 상의 간섭이 적은 슬롯 동안 셀 0으로의 송신 이 나타내어질 수 있는 간섭 조정(interference coordination)에 유리할 수 있다. 예를 들어, 시간 패턴은 스케 줄링이 MCG 및 SCG 상에서 독립적이기 때문에 특정 슬롯에서 SCG 상의 송신의 신뢰성을 개선하는 데 유리할 수 있고, MCG 상에서의 송신에 대한 기본 우선 순위화를 피하고, 대신에 네트워크가 SCG 상의 송신이 우선 순위화 될 수 있는 상응하는 시간 패턴을 사용하여 이러한 우선 순위화를 제어할 수 있도록 하는 데 유리할 수 있다. 다른 예의 경우, 시간 패턴은 상이한 시간 간격에서 상이한 우선 순위화를 허용할 수 있다. 예를 들어, MCG의 마스터 노드(master node, MN)는 MCG가 일부 시간 단위에서 UE로부터의 송신을 설정하고 시간 패턴의 다른 시간 단위에서 UE로부터의 송신을 설정하지 않는 시간 패턴을 결정할 수 있다. 예를 들어, 시간 패턴은 MCG 상에서 UE 송신의 부가적인 동적 스케줄링을 허용하기 위해 상위 계층에 의해 설정되고 미리 결정된 송신 오케이젼을 갖거나 이러한 송신 오케이젼의 슈퍼세트(superset)인 UE로부터의 송신에 기반할 수 있다. 다른 송신 오케이젼 에서, MCG는 UE가 MCG와 SCG 모두에서 동시에 송신을 하는 경우 SCG로의 송신의 우선 순위화를 허용할 수 있다. 따라서, MCG는 시간 패턴을 UE에 제공할 수 있고, 부가적으로 아마도 SCG와의 협상에서 시간 패턴을 SCG에 알릴 수 있으며, 여기서 시간 패턴은 비트맵에 의해 나타내어지며, 비트맵의 비트는 MCG의 1차 셀 상의 슬롯, 또는 UE에 대한 DC 동작에 사용되는 최소 부반송파 간격(SCS) 설정에 따른 슬롯, 또는 밀리초와 같은 실제 시간 단위 와 같은 시간 단위에 상응하며, 비트 값 '0'은 시간 단위 동안 MCG 상의 송신의 우선 순위화를 나타내고, 비트 값 '1'은 시간 단위 동안 SCG 상의 송신의 우선 순위화를 나타낸다. 도 7은 본 개시의 실시예에 따라 UE가 시간 패턴에 따라 마스터 셀 그룹(MCG) 및 2차 셀 그룹(SCG) 상에서 송신 의 우선 순위를 결정하는 예시적인 방법을 도시한다. 방법의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116) 및/또는 BS와 같은 기지국에 의해 수행될 수 있다. 도 7의 방법은 예시만을 위한 것이다. 본 개시의 범위를 벗어나지 않고 다른 실시예가 사용될 수 있다. 단계에서, gNB는 비트맵을 통해 상위 계층이 우선 순위화 시간 패턴을 UE에 설정하며, 여기서 UE는 우선 순위화 규칙에 따라 PUSCH 송신과 같은 송신을 우선 순위화한다. 단계에서, UE는 비트맵의 비트에 상응하 는 시간 간격에 연관된 우선 순위를 결정하고, 해당 시간 간격에서 PUSCH 송신을 우선 순위화한다. 단계에 서, UE는 PUSCH와 같은 채널/신호를 송신하고, 결정된 우선 순위에 따라 제2 PUSCH의 전력을 드롭하거나 스케일 링한다. UE는 우선 순위가 낮은 송신의 전력을 드롭하거나 감소시킬 수 있다는 것이 주목된다. 도 7은 방법을 도시하지만, 도 7에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 7의 방법이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법 의 단계는 상이한 순서로 실행될 수 있다. 특정 실시예에서, 우선 순위의 인디케이션은 DCI에 있다. 본 실시예는 아래의 예 및 도 8에서 설명된다. 예를 들어, gNB는 설정된 시간 패턴이 PUSCH 송신의 우선 순위를 낮출 수 있는 시간 간격 동안 PUSCH 송신의 우 선 순위화를 허용하는 인디케이션을 송신할 수 있다. 예를 들어, UE가 셀 0 상에서 제1 공간 설정을 갖는 제1 PUSCH를 송신하고 셀 1 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하도록 설정된 경우, 셀 1 상에서의 송신 이 우선 순위화 규칙에 따라 우선 순위화되는 기간 동안, 서빙 gNB는 PUSCH 송신을 스케줄링하는 DCI 포맷에서 송신 우선 순위를 나타낼 수 있다. 우선 순위의 인디케이션은 우선 순위 인디케이션을 제공하는 동일한 DCI 포 맷에 의해 스케줄링된 PUSCH 송신에만 영향을 미칠 수 있거나, 후속 송신에도 영향을 미칠 수 있으며, 이는 DCI 포맷 인디케이션에 의해 변경되는 우선 순위화의 타입에 따라 달라질 수 있다. 예를 들어, 셀 0 상의 송신이 설 정된 시간 패턴을 기반으로 하는 시간 간격에서 셀 1 상의 송신에 대해 우선 순위가 낮은 경우, DCI 포맷 인디 케이션은 설정된 시간 패턴을 변경하고, 우선 순위화 인디케이션을 제공하는 DCI 포맷에 의해 스케줄링된 단일PUSCH 송신, 또는 우선 순위화 인디케이션을 제공하는 DCI 포맷에 의해 스케줄링되는 스케줄링된 PUSCH 송신 및 설정된 시간 패턴에 따라 우선 순위의 다음 변경까지 후속 PUSCH 송신, 또는 DCI 포맷에 의한 다른 인디케이션 이 수신될 때까지 모든 후속 PUSCH 송신에 대해 셀 0 상의 송신을 우선 순위화할 수 있다. 다른 예에서, UE가 셀 0 및 셀 1 상에서 측정된 PL에 기초하여 셀 0 또는 셀 1 상에서 PUSCH를 송신할지를 결정할 경우, 인디케이 션은 예를 들어 PUCCH 송신에 대한 결정에 기초하여 송신할 송신 우선 순위화를 변경할 수 있다. 또한, PUSCH 송신이 PUCCH에 대한 우선 순위화의 인디케이션에 기초하여 우선 순위화될 수 있다. 서빙 gNB는 PUCCH 송신을 스케줄링하는 DCI 포맷으로 PUCCH 송신에 대한 우선 순위를 나타낼 수 있다. 예를 들어, PUSCH 송 신이 PL이 더 작은 셀 또는 반송파에 우선 순위화되고, PUCCH가 두 셀 모두에 설정되고 PUSCH 송신과 동일한 셀 에서 송신되도록 설정되며, PUCCH 송신이 HARQ-ACK 정보를 포함하는 경우, 서빙 gNB는 UE가 PUCCH 송신을 우선 순위화하고 동일한 셀 상의 PUSCH가 우선 순위화되도록 PUCCH를 스케줄링하는 DCI 포맷에서 우선 순위를 나타낼 수 있다. gNB는 하나 이상의 DCI 포맷으로 우선 순위 인디케이션을 설정할 수 있다. UE는 슬롯에서 하나 초과의 (more than one) DCI 포맷으로 하나 초과의 우선 순위 인디케이션을 수신할 것으로 예상되지 않는다. 송신 우선 순위의 인디케이션을 위해, DCI 포맷의 1비트 필드가 사용될 수 있으며, 여기서 비트 값 '1'은 PUSCH 송신이 반복적으로 설정되는 경우 반복을 포함하는 셀 0 상에서 제1 공간 설정을 갖는 스케줄링된 PUSCH 송신의 우선 순위화를 나타낸다. 대안적으로, 비트 값 '1'은 우선 순위 인디케이션이 수신되는 시간 패턴의 동일한 우 선 순위를 갖는 시간 간격 동안 셀 0 상에서 제1 공간 설정을 갖는 PUSCH 송신의 우선 순위화를 나타낸다. 시간 패턴은 또한 나타내어진 우선 순위화가 없는 기간을 포함할 수 있으며, 이 경우, 우선 순위화는 송신을 스케줄 링하는 DCI 포맷에 의한 인디케이션에 기초할 수 있거나, 설정된 송신에 대해, 우선 순위화는 셀 인덱스, 요구 된 경로 손실, 또는 정보 내용 등에 기초할 수 있다. 또한, 필드는 UE가 우선 순위 인디케이션 필드를 DCI 포맷에 제공하는 PDCCH를 수신하는 시간으로부터 시작하는 셀 0 상에서 제1 공간 설정을 갖는 PUSCH 송신의 우선 순위화를 나타내고, DCI 포맷에 의한 인디케이션은 상위 계층에 의해 설정된 시간 패턴에 따라 결정된 송신 우선 순위를 무시(override)할 수 있다. 나타내어진 우선 순 위가 유효한 기간이 설정될 수 있다. 부가적으로, 또한, DCI 포맷에 의한 우선 순위의 인디케이션은 상위 계층에 의한 설정에 따라 특정 우선 순위화 규칙에 대해서만 송신 우선 순위를 변경할 수 있다. 예를 들어, PUCCH가 또한 동일한 공간 설정을 갖는 셀 0 상 에서의 송신을 위해 설정된다는 우선 순위화 규칙에 따라 UE가 제1 공간 설정을 갖는 셀 0 상에서의 PUSCH 송신 을 우선 순위화할 경우, UE는 DCI 포맷에 의한 우선 순위 인디케이션을 수신할 것으로 예상되지 않는다. 또한, 예를 들어 PDSCH 수신을 스케줄링하는 DCI 포맷, 또는 상위 계층에 의해 이전에 설정된 비트맵의 일부 또는 모 든 비트를 재설정할 수 있는 공통 검색 공간에 따라 PDCCH 수신에서의 DCI 포맷에 의해서와 같이 PUSCH 송신을 스케줄링하지 않는 DCI 포맷에 의해 우선 순위 인디케이션이 제공될 수 있다. 도 8은 본 개시의 실시예에 따라 UE가 gNB에 의한 인디케이션에 따라 송신의 우선 순위화를 결정하는 예시적인 방법을 도시한다. 방법의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116) 및/또는 BS와 같은 기지국에 의해 수행될 수 있다. 도 8의 방법은 예시만을 위한 것이다. 본 개시의 범위를 벗어나지 않고 다른 실시예가 사용될 수 있다. 단계에서, gNB는 비트맵을 통해 시간 패턴을 설정하고, 여기서 비트맵의 각각의 비트는 시간 패턴의 슬롯 또는 밀리초와 같은 미리 결정된 지속 시간과 같은 시간 단위에 상응하고, UE는 비트맵의 상응하는 비트에 의한 인디케이션을 기반으로 우선 순위화 규칙에 따라 시간 단위로 송신을 우선 순위화한다. 또한, 일부 시간 단위에 대해, 비트맵에 의한 인디케이션이 제공되지 않을 수 있다. 단계에서, gNB는 PUSCH 송신을 스케줄링하는 DCI 포맷에 의해 시간 단위로 PUSCH 송신의 우선 순위화를 나 타낸다. 단계에서, UE는 스케줄링된 PUSCH 송신의 우선 순위를 결정하고, 결정된 우선 순위에 따라 송신한 다. UE는 비트맵의 우선 순위화 규칙을 설정된 승인 PUSCH 송신에 적용할 수 있다. 도 8은 방법을 도시하지만, 도 8에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 8의 방법이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법 의 단계는 상이한 순서로 실행될 수 있다. 특정 실시예에서, 우선 순위화는 PUSCH 반복의 송신에 기초한다. 본 실시예는 아래의 예에서 설명된다. 예를 들어, (UE와 같은) UE가 PUSCH를 반복적으로 송신하도록 설정되고, UE가 셀 0 상에서 제1 공간 설정 을 갖는 제1 PUSCH를 송신하려 하고, 셀 1 상에서 제2 공간 설정을 갖는 제2 PUSCH를 송신하려 하는 경우, 시간 중첩의 경우에 PUSCH 송신의 반복에 대한 우선 순위화는 반복이 타입 A인지 타입 B인지, 각각의 PUSCH 송신에 대한 반복 횟수인지, 반복에 대한 제1 심볼의 위치인지, 반복당 심볼의 수인지, 또는 각각의 PUSCH 반복에 대한 부반송파 간격 설정인지를 고려할 수 있다. 다른 예의 경우, UE가 (i) 제1 반복 횟수 및 제1 공간 설정을 갖는 제1 PUSCH 및 (ii) 제2 반복 횟수 및 제2 공 간 설정을 갖는 제2 PUSCH를 송신하려 하는 경우, 제1 PUSCH 송신의 반복이 제2 PUSCH 송신의 반복과 중첩하는 송신 오케이젼 시에, UE는 다양한 파라미터를 우선 순위화할 수 있다. 예를 들어, UE는 전송 블록(TB)에 대한 초기 송신의 반복을 우선 순위화할 수 있으며, 여기서 반복은 타입 A 반복에 대한 제1 공칭 반복이거나 타입 B 반복에 대한 제1 실제 반복이다. 다른 예의 경우, UE는 더 작은 반복 횟수를 갖는 송신에 대해 반복을 우선 순 위화할 수 있다. 다른 예의 경우, UE는 더 적은(또는 더 많은) 심볼의 수를 갖는 반복을 우선 순위화할 수 있다. 또 다른 예의 경우, UE는 SCS 설정에 대해 더 작은(또는 더 큰) 값을 반복을 우선 순위화할 수 있다. UE는 또한 제1 반복인지 또는 반복 횟수에 기초하여 반복을 통한 중첩 PUSCH 송신 중에서 PUSCH 송신의 반복을 우선 순위화할 수 있다. 예를 들어, UE는 제2 PUSCH 송신의 후속 반복보다 제1 PUSCH 송신의 제1 반복을 우선 순위화할 수 있다. 제1 PUSCH 송신의 반복 i가 제2 PUSCH 송신의 반복 j와 중첩하고, j>i인 경우, UE는 제1 PUSCH 송신의 반복 i를 송신하고, 제2 PUSCH 송신의 반복 j를 송신하지 않는다. 특정 실시예에서, 우선 순위화는 PUSCH 심볼의 수에 기초한다. 본 실시예는 아래의 예와 도 9에서 설명된다. 예를 들어, (UE와 같은) UE는 중첩 PUSCH 송신의 각각에 대한 슬롯에서 심볼의 수에 기초하여 중첩 PUSCH 송신에 대한 우선 순위를 결정할 수 있다. 예를 들어, 슬롯 1에서 도 8의 예를 참조하면, 슬롯 1에서 PUSCH0이 PUSCH1보다 더 많은 심볼의 수를 갖기 때문에 UE는 PUSCH0을 우선 순위화할 수 있다. 상술한 우선 순위화 및 상술한 우선 순위화의 조합은 또한 반복을 통한 PUCCH 송신에 적용될 수 있다. 상술한 우선 순위화 및 상술한 우선 순위화의 조합은 내림차순으로 적용될 수 있다. 도 9는 본 개시의 실시예에 따라 2개 이상의 중첩 PUSCH 송신 중에서 PUSCH의 송신을 우선 순위화하기 위한 규 칙 세트가 적용될 수 있는 순서의 예시적인 방법을 도시한다. 방법의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116)에 의해 수행될 수 있다. 도 9의 방법은 예시만을 위한 것이다. 본 개시의 범위 를 벗어나지 않고 다른 실시예가 사용될 수 있다. 단계에서, 송신 우선 순위화를 위한 제1 규칙은 반복없이 설정된 송신이 반복을 통한 송신보다 우선 순위 화된다는 것일 수 있다. 예를 들어, 반복적으로 설정된 PUSCH 송신보다 반복 없이 설정된 PUSCH 송신이 우선 순 위화될 수 있다. 두 송신이 모두 반복적으로 설정되면, 다른 송신 특성이 고려된다. 예를 들어, TB의 초기 송신 을 포함하는 PUSCH 송신은 TB의 재송신을 포함하는 PUSCH 송신보다 우선 순위화되거나, 그 반대로 우선 순위화 된다(TB의 재송신은 TB의 초기 송신보다 우선 순위화됨). 즉, 단계에서, TB의 초기 송신은 반복의 재송신 보다 우선 순위화되거나, 그 반대로 우선 순위화된다. 단계에서, 타입 A 반복을 갖는 PUSCH 송신에서의 TB의 초기 송신은 타입 B 반복을 갖는 PUSCH 송신에서의 TB의 초기 송신보다 우선 순위화되거나, 일반적으로, PUSCH 송신의 중첩 반복이 TB의 초기 송신을 포함하는 경우, 슬롯당 단일 반복을 갖는 PUSCH 송신이 우선 순위 화된다. 단계에서, 두 PUSCH 송신이 모두 반복을 갖는 경우, 더 적은 반복 횟수를 갖는 송신이 우선 순위 화된다. 예를 들어, 더 적은 반복 횟수를 갖는 PUSCH 송신의 반복은 더 많은 반복 횟수를 갖는 PUSCH 송신의 반 복보다 우선 순위화된다. 도 9는 방법을 도시하지만, 도 9에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 9의 방법이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법 의 단계는 상이한 순서로 실행될 수 있다. 특정 실시예에서, 우선 순위화는 PUSCH 송신이 반복적으로 설정되는지 또는 반복 없이 설정되는지와 우선 순위 가 낮은 자원의 처리에 기초한다. 본 실시예는 아래의 예 및 도 10에서 설명된다. 예를 들어, 동일한 서비스 클래스 우선 순위를 갖는 중첩 PUCCH 또는 PUSCH 송신의 우선 순위화가 고려된다. UE 는 반복적으로 설정된 PUSCH 송신보다 반복 없이 설정된 PUSCH 송신을 우선 순위화할 수 있다. 예를 들어, UE가 반복 없이 제1 공간 설정(PUSCH 0)을 갖는 제1 PUSCH와 반복 타입 A 및 제2 공간 설정(PUSCH 1)을 갖는 제2 PUSCH를 송신하도록 설정되면, 제1 및 제2 PUSCH 송신이 시간적으로 중첩하는 경우, UE는 제1 PUSCH 송신을 우 선 순위화하고, PUSCH 0을 송신하며, PUSCH 1의 송신을 취소한다. PUSCH 1의 송신을 위한 일부 심볼에 대해서만PUSCH 0과 PUSCH 1 간의 중첩이 발생하는 경우, UE는 PUSCH 1의 전체 송신을 취소할 수 있다. 취소는 또한 PUSCH 1의 후속 반복으로 확장될 수 있다. 대안적으로, UE는 PUSHC 0의 우선 순위화된 송신과 중첩하는 PUSCH 1 심볼 또는 PUSCH 1 송신의 반복만을 취소하고, PUSCH 1에 대해 중첩 반복 또는 비중첩 반복의 심볼을 송신한다. 또한, UE는 PUSCH 1 송신의 중첩 반복을 후속 송신 오케이젼으로 연기할 수 있다. 도 10은 본 개시의 실시예에 따른 제1 PUSCH 송신 및 제2 PUSCH 송신의 예시적인 신호 다이어그램을 도시 한다. 예를 들어, 신호 다이어그램은 제1 셀 상에서 반복 없이 제1 공간 설정을 갖는 제1 PUSCH 송신 및 제2 셀 상에서 두 번 반복 및 제2 공간 설정을 갖는 제2 PUSCH 송신, 및 제1 슬롯에서 두 PUSCH 송신의 중첩의 일 예를 도시한다. 제1 슬롯에서, 반복 없이 제1 공간 설정을 갖는 제1 PUSCH 송신(PUSCH0)은 심볼 4 내지 14를 통해 이루어 지지만, 반복 및 제2 공간 설정을 갖는 제2 PUSCH 송신(PUSCH1)은 심볼 4 내지 8을 통해 이루어진다. 제1 슬롯에서, UE는 제1 PUSCH를 송신하고, 제2 PUSCH의 송신을 취소한다. 제2 및 제3 슬롯에서는 제1 및 제2 PUSCH 송신 사이에 중첩이 없으며, 제2 PUSCH의 송신은 완료되거나 부분적으로 취소될 수 있다. 도시된 바와 같 이, UE는 제2 PUSCH 송신을 완전히 취소한다. UE는 제1 PUSCH 송신과 중첩되는 슬롯 1에서만 제2 PUSCH 송신의 제1 반복을 취소하고, 슬롯 2에서 제2 PUSCH 송신의 제2 반복을 송신한다. UE는 제2 PUSCH 송신을 연기하고, 슬롯 2 및 슬롯 3에서 두 반복을 송신한다. 특정 실시예에서, UE는 송신을 연기할 수 있다. 본 실시예는 아래의 예 및 도 11에서 설명된다. 예를 들어, UE가 제1 PUSCH 송신을 우선 순위화할 경우, UE는 우선 순위를 갖는 송신과 중첩하는 제1 심볼 이전 에 우선 순위화되지 않은 PUSCH 송신을 취소하거나, UE는 우선 순위를 가진 PUSCH 송신의 완료 후 우선 순위화 되지 않은 PUSCH 송신을 연기한다. 연기된 송신의 경우, 다음의 규칙이 적용될 수 있다. 규칙은 연기된 제1 반복이 후속 반복보다 우선 순위를 가 짐을 명시할 수 있다. 규칙은 PUSCH 송신의 연기된 반복 i가 다른 PUSCH 송신의 j>i인 반복 j보다 우선 순위를 갖는다고 명시할 수 있다. 규칙은 PUSCH 송신의 연기된 반복 i가 다른 PUSCH 송신의 j>i인 연기된 반복 j보다 우선 순위를 갖는다고 명시할 수 있다. 규칙은 두 연기된 반복이 반복 i일 경우(예를 들어 둘 다 제2 반복일 경 우), 더 많은 심볼의 수를 가진 반복이 송신을 위해 우선 순위화된다고 명시할 수 있다. 대안적으로, 더 많은 송신 오케이젼 또는 슬롯의 수에 대해 연기된 반복은 송신된다. 규칙은 최대 n개의 송신 오케이젼 또는 슬롯의 수에 대한 송신을 위해 반복이 연기될 수 있다고 명시할 수 있다. n개의 송신 오케이젼 또는 슬롯의 수 후에, PUSCH 반복(있는 경우)은 드롭된다. n개의 송신 오케이젼 또는 슬롯의 수는 상위 계층에 의해 UE에 제공되거나 시스템 동작에서 명시될 수 있다. 도 11은 본 개시의 실시예에 따른 제1 PUSCH 송신 및 제2 PUSCH 송신의 예시적인 신호 다이어그램을 도시 한다. 예를 들어, 신호 다이어그램은 두 번 반복하여 제1 공간 설정을 갖는 제1 PUSCH 송신 및 두 번 반 복하여 제2 공간 설정을 갖는 제2 PUSCH 송신의 일 예를 설명하며, 여기서 제1 및 제2 PUSCH 송신은 제2 및 제3 슬롯에서 중첩한다. 제1 슬롯에서, 제2 PUSCH 송신(PUSCH1)의 제1 반복은 심볼 4 내지 14를 통해 이루어지며, 다른 PUSCH 송신 과 중첩되지 않는다. 제2 슬롯에서, PUSCH1 송신의 반복은 제1 PUSCH 송신(PUSCH0)의 제1 반복과 중첩한다. 제1 반복이 우선 순위를 가지며, UE는 PUSCH0 송신의 제1 반복을 송신하고, PUSCH1 송신의 중첩 반복 을 연기한다. 제3 슬롯에서, PUSCH1 송신의 반복은 PUSCH1 송신의 연기된 반복과 중첩되며, 두 반복은 모두 2와 같은 동일한 반복 횟수를 갖는다. 더 많은 PUSCH 심볼의 수에 기초한 우선 순위화가 적용되면, UE는 제3 슬롯 에서 PUSCH0에 대한 제2 반복을 송신한다. 대신에 연기된 송신 오케이젼의 수에 기초한 우선 순위화가 적 용되는 경우, UE는 제3 슬롯에서 PUSCH1 송신의 제2 반복을 송신한다. 특정 실시예에서, 우선 순위가 낮은 PUSCH 송신은 취소된다. 본 실시예는 아래의 예에서 설명된다. 예를 들어, (UE와 같은) UE는 더 높은 우선 순위를 갖는 송신과 중첩하는 제1 심볼 이전에 PUSCH 송신을 취소할 수 있다. 더 높은 우선 순위의 송신과 중첩하는 심볼 상에서 더 낮은 우선 순위의 송신을 취소하는 것에 부가하여, UE는 또한 더 낮은 우선 순위의 송신의 후속 심볼을 취소할 수 있다. 예를 들어, 반복을 통한 PUSCH 송신의 경우, UE가 PUSCH 송신의 제1 반복을 취소하면, UE는 또한 나머지 반복을 취소할 수 있다. 다른 예의 경 우, UE가 PUSCH 송신의 임의의 반복을 취소하면, UE는 또한 PUSCH 송신의 모든 후속 반복을 취소할 수 있다. 다 른 예의 경우, UE가 제1 공간 설정을 가진 제1 PUSCH와 제2 공간 설정을 가진 제2 PUSCH를 모두 반복 없이 송신 하도록 설정될 경우, 제1 PUSCH 송신이 우선 순위화되고, 미리 결정되거나 설정된 심볼의 수보다 많은 심볼의수를 점유한다면, UE는 제2 PUSCH의 송신을 취소할 수 있다. 또 다른 예의 경우, UE가 제1 공간 설정을 갖는 제 1 PUSCH 및 제2 공간 설정을 갖는 제2 PUSCH를 둘 다 반복 없이 송신하도록 설정될 경우, 제1 및 제2 공간 설정 의 PL 차이가 임계값보다 크거나, 제2 공간 설정을 갖는 우선 순위가 낮은 송신의 PL이 임계값 미만인 경우, UE 는 제2 PUSCH의 송신을 취소할 수 있다. 특정 실시예에서, 우선 순위가 낮은 PUSCH 송신을 취소할지 또는 연기할지에 관한 결정이 이루어진다. 본 실시 예는 아래의 예 및 도 12에서 설명된다. PUSCH 송신의 취소 또는 연기는 PUSCH 송신의 우선 순위화 규칙과 연관될 수 있다. 예를 들어, PUSCH 송신의 우 선 순위화가 경로 손실 추정에 기반하고, 중첩 PUSCH 송신이 반복적으로 설정되지 않은 경우, UE는 우선 순위가 낮은 PUSCH 송신을 취소할 수 있다. PUSCH 송신이 반복적으로 설정되고, 중첩 송신 간의 우선 순위화가 반복 횟 수에 기반하는 경우, UE는 중첩된 우선 순위가 낮은 송신을 취소하거나, 다음 송신 오케이젼 또는 시스템 동작 에서 미리 정의될 수 있거나 상위 계층에 의해 UE에 제공될 수 있는 다수의 송신 오케이젼 동안 우선 순위가 낮 은 PUSCH 송신을 연기할 수 있다. 유사한 원칙이 중첩된 PUCCH 송신에 적용될 수 있다. (BS와 같은) gNB는 우선 순위화되지 않은 PUSCH 송신을 취소할지 또는 연기할지를 상위 계층에 의해 UE에 설정할 수 있다. gNB는 또한 중첩이 발생하는 송신 오케이젼에서 취소가 오직 중첩 반복에 대해서만 이루어져야 하는지 또는 취소 후 나머지 모든 반복에 대해 이루어져야 하는지를 상위 계층에 의해 UE에 설정할 수 있다. UE 가 PUSCH 송신의 취소된 반복을 연기하는 경우, gNB는 UE가 반복을 취소하기 전에 UE가 PUSCH 송신의 반복을 연 기할 수 있는 다수의 송신 오케이젼을 UE에 설정할 수 있다. gNB는 또한 제1 반복과 같은 특정 반복 횟수 또는 마지막 반복 횟수 또는 PUSCH 송신의 모든 반복에 대해서만 PUSCH 반복을 연기하는 것을 상위 계층에 의해 UE에 설정할 수 있다. 대안적으로 또는 부가적으로, PUSCH 송신이 DCI 포맷에 의해 스케줄링되는 경우, gNB는 DCI 포 맷의 필드에 의해 우선 순위가 낮은 반복을 연기하거나 취소하기 위한 UE 동작을 나타낼 수 있다. 예를 들어, 1 비트 필드는 UE가 중첩 송신 오케이젼에서 취소하는 PUSCH 송신을 취소하거나 연기하는 UE 동작을 나타낼 수 있 다. gNB는 또한 중첩 PUCCH 송신의 PUSCH 심볼의 수에 따라 PUSCH 송신을 취소할지 또는 연기할지를 상위 계층에 의 해 UE에 설정할 수 있다. 예를 들어, UE가 제1 공간 설정을 갖는 제1 PUSCH와 제2 공간 설정을 갖는 제2 PUSCH 를 송신하도록 설정되고, 두 PUSCH 송신이 모두 반복 없이 설정될 경우, 제1 PUSCH 송신이 우선 순위화되고 미 리 결정되거나 설정된 심볼의 수보다 작은 심볼의 수를 점유하는 경우, UE는 제2 PUSCH의 송신을 연기하고, 제1 PUSCH의 마지막 심볼 이후에 제2 PUSCH의 제1 심볼을 송신할 수 있다. 제2 PUSCH의 제1 심볼은 제1 PUSCH의 마 지막 심볼의 동일한 또는 상이한 슬롯에서 송신될 수 있다. 또한, 우선 순위가 낮은 PUSCH 송신을 취소할지 또 는 연기할지에 대한 조건은 제1 PUSCH의 송신이 미리 결정되거나 설정된 슬롯의 수에서 완료될 수 있는지에 기 초할 수 있으며, 여기서 슬롯의 수는 하나 이상일 수 있다. 도 12는 본 개시의 실시예에 따라 UE가 PUSCH 송신을 연기할지 또는 취소할지를 결정하는 예시적인 방법 을 도시한다. 방법의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116)에 의해 수행될 수 있다. 도 12의 방법은 예시만을 위한 것이고, 본 개시의 범위를 벗어나지 않고 다른 실시예가 사용될 수 있다. 단계에서, UE는 우선 순위화된 PUSCH 송신이 N 이상의 심볼을 점유하는 경우 우선 순위가 낮은 송신을 취 소하는 것으로 설정된다. 단계에서, UE는 스케줄링된 중첩하는 제1 및 제2 PUSCH 송신에 대한 송신 우선 순위를 결정한다. 예를 들어, 제1 PUSCH 송신이 우선 순위화된다. 단계에서, UE는 PUSCH 심볼이 N 초과인 지를(more than N) 결정한다. 제1 우선 순위화된 송신의 심볼의 수가 (단계에서 결정된 바와 같이) N보다 큰 경우, UE는 단계에서 우선 순위가 낮은 제2 PUSCH 송신을 취소한다. 대안적으로, 제1 우선 순위화된 송신의 심볼의 수가 (단계에서 결정된 바와 같이) N보다 크지 않은 경우, UE는 단계에서 우선 순위 화된 제1 PUSCH의 마지막 심볼 이후에 우선 순위가 낮은 제2 PUSCH 송신의 제1 심볼을 송신한다. 도 12는 방법을 도시하지만, 도 12에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 12의 방법 이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발 생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법의 단계는 상이한 순서로 실행될 수 있다. 특정 실시예에서, gNB는 설정 또는 인디케이션에 의해 PUSCH 송신 우선 순위를 결정한다. 이 실시예는 아래의 예와 도 13 및 14에서 설명된다. (UE와 같은) UE는 제1 공간 설정을 갖는 제1 PUSCH 또는 제1 PUCCH 및 제2 공간 설정을 갖는 제2 PUSCH 또는 제2 PUCCH를 송신하도록 설정될 수 있고, UE는 두 공간 설정을 통한 송신을 동시에 송신할 수 있다. 두 공 간 설정을 통한 송신은 상이한 셀 상에 있을 수 있거나 동일한 셀의 상이한 수신 포인트에 상응할 수 있다. gNB는 제2 공간 설정을 갖는 제2 PUSCH의 송신보다 제1 공간 설정을 갖는 제1 PUSCH의 송신의 우선 순위화를 UE 에 설정할 수 있다. 또한, gNB는 상이한 공간 설정을 가진 상이한 채널에 대한 우선 순위화를 상위 계층에 의해 UE에 설정할 수 있다. 예를 들어, 제1 공간 설정을 갖는 PUSCH 송신은 제2 공간 설정을 갖는 중첩 PUCCH 송신보 다 우선 순위화될 수 있다. 대안적으로 또는 부가적으로, gNB는 PUSCH 또는 PUCCH 송신을 스케줄링하는 DCI 포 맷에서의 필드에 의해 UE 동작을 나타낼 수 있다. 예를 들어, 제1 PUSCH 송신을 스케줄링하는 DCI 포맷의 1비트 필드는 상기 PUSCH 송신이 제2 PUSCH 송신보다 우선 순위화된다고 나타낼 수 있다. 예를 들어, UE는 MCG의 셀 상에서 DCI 포맷을 수신할 수 있고, 인디케이션은 PUSCH 또는 PUCCH 송신이 SCG의 셀 상에서의 송신보다 우선 순위화되는지일 수 있다. 도 13은 본 개시의 실시예에 따라 UE가 PUSCH 송신에 대한 우선 순위를 결정하는 예시적인 방법을 도시한 다. 방법의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116) 및/또는 BS와 같은 기지국에 의해 수행될 수 있다. 도 13의 방법은 예시만을 위한 것이며, 본 개시의 범위를 벗어나지 않고 다른 실시 예가 사용될 수 있다. 단계에서, (gNB와 같은) gNB는 상위 계층에 의해 동시 PUSCH 또는 PUCCH 송신에 대한 우선 순위화를 UE에 설정할 수 있다. 예를 들어, PUSCH 송신은 상이한 공간 설정과 연관될 수 있으며, UE는 하나 초과의 공간 설정으로 동시에 송신할 수 없다. 단계에서, gNB는 UE로부터의 PUSCH 또는 PUCCH 송신을 스케줄링하는 DCI 포맷의 필드에 의해 PUSCH 또는 PUCCH 송신에 대한 우선 순위화를 나타낸다. 단계에서, UE는 우선 순 위를 갖는 것으로서 나타내어진 PUSCH 또는 PUCCH를 송신하고, 다른 중첩 송신을 취소한다. 다른 중첩 송신은 우선 순위화된 PUSCH 또는 PUCCH와 상이한 공간 설정을 가질 수 있다는 것이 주목된다. 도 14는 본 개시의 실시예에 따라 UE가 PUSCH 또는 PUCCH 송신에 대한 우선 순위를 결정하는 예시적인 방법 을 도시한다. 예를 들어, 방법은 UE가 셀 0 상에서 제1 PUSCH 또는 PUCCH를 송신하고, 셀 1 상에 서 제2 PUSCH 또는 PUCCH를 송신하도록 스케줄링되는 경우, UE가 PUSCH 또는 PUCCH 송신에 대한 우선 순위를 결 정하는 절차를 설명한다. 방법의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116) 및/또는 BS와 같은 기지국에 의해 수행될 수 있다. 도 14의 방법은 단지 예시를 위한 것이며, 본 개시의 범 위를 벗어나지 않고 다른 실시예가 사용될 수 있다. 단계에서, gNB는 셀 0 상에서 PUSCH 또는 PUCCH 송신을 스케줄링하고, 셀 1 상에서 PUSCH 또는 PUCCH 송 신을 스케줄링한다. 단계에서, UE는 우선 순위를 갖는 것으로서 나타내어지는 경우 셀 1 상에서 PUSCH 또 는 PUCCH를 송신하고, 셀 0 상에서 중첩 PUSCH 또는 PUCCH 송신을 취소한다. 도 13 및 14는 방법(1300 및 1400)을 도시하지만, 도 13 및 14에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 13의 방법이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법의 단계는 상이한 순서로 실행될 수 있다. 본 개시의 실시예는 또한 반송파 집성으로 동작하거나 다수의 TRP로 동작하는 것과 같이 다수의 셀 상에서 동작 하는 UE로부터의 송신에 관한 것이며, 여기서 TRP는 UE(송신 포인트)에 의한 수신 또는 UE(수신 포인트)로부터 의 송신을 위한 공간 설정에 의해 정의된다. 본 개시는 상이한 셀 또는 반송파 상에서 상이한 공간 설정을 갖는 PUSCH 및 PUCCH 송신에 대한 전력 감소를 위한 우선 순위를 결정에 관한 것이다. 본 개시는 또한 UE에 대한 송 신 우선 순위화를 설정하고 나타내는 것에 관한 것이다. 본 개시는 또한 공간 설정을 갖는 PUSCH 송신의 전력을 결정하는 것에 관한 것이다. 본 개시는 부가적으로 공간 설정을 갖는 PUCCH 송신의 전력을 결정하는 것에 관한 것이다. 본 개시는 또한 UE에 대한 반복으로 송신을 위한 우선 순위를 결정하는 것에 관한 것이다. 다음에서, 간략화를 위해, 설명은 UE로부터 2개의 상이한 서빙 셀로의 송신을 고려하지만, 동일한 서빙 셀의 2 개의 상이한 수신 포인트에 직접 적용 가능하다. 예를 들어, (UE와 같은) UE가 한 번에 셀 상에서 하나의 공간 설정으로만 송신할 경우, 스케줄링 결정은 공간 설정마다 독립적일 수 있다. UE는 다수의 공간 설정 중 하나에 따라 송수신을 위해 물리적 다운링크 제어 채널(PDCCH)에서 다운링크 제어 정보(DCI) 포맷에 의해 스케줄링될 수 있다. 이러한 동적 스케줄링을 통해 gNB 는 임의의 주어진 시간에 UE에 대한 안정적인 송신 또는 수신을 용이하게 하는 채널 조건을 제공하는 공간 설정 을 사용하여 UE를 스케줄링할 수 있고 상이한 공간 차원 간에 동적 부하 밸런싱을 수행할 수 있다.UE는 UE에 의해 계산된 경로 손실 추정치에 기초하고 송신 오케이젼에서 UE 최대 송신 전력에 따라 PUSCH, PUCCH, SRS 또는 PRACH 송신을 위한 전력을 결정할 수 있다. 다수의 TRP와 통신할 수 있는 UE는 동일하거나 상 이한 PDCCH 모니터링 오케이젼(monitoring occasion; MO)에서 다수의 TRP로부터 PDCCH를 수신할 수 있다. 예를 들어, 다수의 TRP가 비이상적 백홀에 의해 연결될 경우, UE는 다수의 공간 설정으로부터 상응하는 PDSCH 수신을 스케줄링하는 다수의 PDCCH를 수신할 수 있으며; 그렇지 않으면 무시할 수 있는 백홀 지연 시간의 경우, 단일 PDCCH는 다중 공간 설정을 사용하여 다수의 PDSCH의 UE에서의 수신을 스케줄링할 수 있다. PUSCH, PUCCH, SRS 또는 PRACH 송신 전력을 결정하기 위해, UE는 송신 오케이젼에서 UE 최대 송신 전력에 따른 다중 공간 설정을 사용하여 RS 수신에 기초하여 UE가 계산하는 경로 손실 추정치를 사용할 수 있다. 본 개시의 실시예는 상이한 셀 또는 반송파 상에서 상이한 공간 설정을 갖는 PUSCH 송신에 대한 송신 전력 감소 를 위한 우선 순위화를 설명한다. 이것은 아래 예에서 설명된다. UE가 하나 이상의 셀 상에서 동작하도록 설정될 경우, UE는 하나 이상의 셀 또는 반송파 상에서 송신을 위해 사 용할 공간 설정을 제공받거나 결정한다. 예를 들어, UE는 공간 설정 1을 가진 셀 1 상에서 송신하고 공간 설정 2를 가진 셀 2 상에서 송신하도록 설정될 수 있으며, 여기서 셀 1과 셀 2는 동일한 셀 또는 상이한 셀일 수 있 다. UE는 셀 1과 셀 2 상에서 동시에 송신할 수 있다. 예를 들어, UE는 예를 들어 임의의 주어진 시간에 셀 1 상에서 송신하는 패널 1 과 셀 2 상에서 송신하는 패널 2 의 두 패널을 가질 수 있고 두 패널로부터 동시에 송 신할 수 있다. 송신 오케이젼에서의 UE 송신은 PUSCH 또는 PUCCH 또는 PRACH 또는 SRS와 같은 상이한 채널 또는 신호의 조합일 수 있다. 예를 들어, 조합에서, UE는 셀 1 상에서 제1 PUSCH(PUSCH1)를 송신하고 셀 2 상에서 제 2 PUSCH(PUSCH2)를 송신할 수 있다. 다른 조합에서, UE는 셀 1 상에서 제1 PUCCH(PUCCH1)를 송신하고 셀 2 상 에서 제2 PUCCH(PUCCH2)를 송신할 수 있다. 다른 조합에서, UE는 셀 1 상에서 제1 PUSCH를 송신하고, 셀 2 상에 서 제2 PUSCH를 송신하며, 셀 1 상에서 PUCCH를 송신할 수 있다. 다른 조합에서, UE는 셀 1 상에서 제1 PUCCH를 송신하고, 셀 2 상에서 제2 PUCCH를 송신하며, 셀 2 상에서 SRS를 송신할 수 있다. PUSCH 또는 PUCCH 또는 PRACH 또는 SRS 송신을 위한 총 UE 송신 전력이 주어진 시간에 최대 송신 전력 PCMAX를 초과할 경우, UE는 (내림 차순으로) 우선 순위 순서에 따라 전력을 PUSCH/PUCCH/PRACH/SRS 송신에 할당함으로써, 주파수 범위에서 서빙 셀 상의 송신을 위한 총 UE 송신 전력은 송신 오케이젼의 모든 심볼에서 해당 주파수 범위에 대한 PCMAX보다 작거 나 같도록 하며, 여기서 PCMAX는 상응하는 공간 설정에 관계없이 모든 송신에 적용할 수 있다. 송신 오케이젼은 슬롯 또는 길이 l의 연속 심볼 그룹일 수 있으며, l≥1이다. PUSCH 송신과 관련하여, UE가 셀 1 상에서 PUSCH를 송신하고 셀 2 상에서 PUSCH를 송신하도록 설정되고, 상이한 공간 설정이 셀 1과 셀 2 상에서 PUSCH 송신에 사용되는 경우, UE는 UE가 PUCCH를 송신하도록 설정되는 셀 상에 서 PUSCH 송신을 위해 전력 할당을 우선 순위화한다. 대안적으로, PUCCH 송신이 두 셀 상에서 설정되거나, 셀 중 어느 것에도 설정되지 않거나, UE가 주어진 시간에 PUSCH를 송신하는 셀 상에서 PUCCH 송신의 설정과 관계없 이, UE는 더 작은 인덱스를 가진 셀 상에서 PUSCH 송신에 대한 전력 할당을 우선 순위화할 수 있거나, 모든 PUSCH 송신에 동일한 전력 할당을 적용할 수 있거나, 전력 할당의 우선 순위화는 UE 구현에 맡겨질 수 있다. UE 는 또한 PUSCH에서 UCI 다중화와 같이 PUSCH에서의 정보와 관련된 가능한 우선 순위를 정한 후 PUSCH 송신이 반 복적으로 설정되는지 여부를 고려하여 송신 전력 감소를 위한 우선 순위화를 적용할 수 있다. UE가 반복적으로 PUSCH를 송신하도록 설정되는 경우, 송신 전력 할당을 위한 우선 순위 순서는 PUSCH 반복이 타입 A인지 또는 타 입 B인지 여부, 설정된 반복 횟수, 송신 오케이젼에서의 반복 횟수, 반복의 제1 PUSCH 심볼의 위치, 반복당 PUSCH 심볼의 수, 및 슬롯당 PUSCH 심볼의 수 중 하나 이상을 고려할 수 있다. 다음의 것은 PUCCH 송신을 설명한다. UE가, 제1 PUSCH 를 위한 제1 공간 설정이 제2 PUSCH 를 위한 제2 공간 설 정과 동일하거나 상이한, 셀1 에서 제1 PUSCH 를 송신하도록 설정되고 셀2 에서 제2 PUSCH 를 송신하도록 설정 되는 경우의 PUSCH 송신의 전력 감소에 대한 상술한 우선 순위화는 셀 1 상의 제1 PUCCH 및 셀 2 상의 제2 PUCCH를 송신하도록 설정될 경우의 PUCCH 송신에도 적용될 수 있다. UE는 CSI만을 포함하는 PUCCH 송신보다 차 례로 우선 순위화되는 스케줄링 정보를 포함하는 PUCCH 송신보다 HARQ-ACK 정보를 포함하는 PUCCH 송신에 전력 할당을 우선 순위화한다. 예를 들어, UE가 하나 이상의 셀 상에서 동작하도록 설정되고, UE가 상이한 셀 상에서 상이한 공간 설정으로 동 시에 송신할 수 있는 경우, 송신 전력 감소를 위한 우선 순위화는 셀당 및/또는 TRP당 및/또는 다수의 TRP당 하 나 이상의 설정된 최대 전력에 기초하여 결정될 수 있다. 예를 들어, UE는 제1 공간 설정 및 제2 공간 설정을 갖는 셀 1 상에서 송신하고 제3 공간 설정을 갖는 셀 2 상에서 송신하도록 설정된다. UE는 동적 또는 설정된 스 케줄링된 송신에 따라 송신 오케이젼에서 상이한 공간 설정을 갖는 각각의 송신의 필요한 전력을 먼저 결정한다음, 필요하다면, 설정된 최대 출력을 초과하지 않도록 상이한 공간 설정을 갖는 각각의 송신의 전력에 스케일 링을 적용할 수 있다. 설정된 최대 전력은 TRP/공간 설정마다 또는 다수의 TRP/공간 설정마다 설정될 수 있다. 또한 UE에는 TRP/공간 설정당 최대 전력에 부가하여 적용되거나 대안적으로 다중 TRP/공간 설정당 최대 전력에 부가하여 적용되는 셀당 최대 전력이 설정될 수 있다. 상술한 예에 대해, 일 하위 예에서, 공간 설정 1 및 2에 사용된 송신 전력의 합이 셀당 설정된 최대 전력을 초 과하지 않는 경우와, 공간 설정 3에 사용된 송신 전력이 셀당 설정된 최대 전력을 초과하지 않는 경우. UE는 제 1 공간 설정 및 제2 공간 설정을 갖는 셀 1 상에서 하나 이상의 채널을 송신하고, 제3 공간 설정을 갖는 셀 2 상에서 하나 이상의 채널을 송신한다. UE는 또한 전력이 셀당 설정된 최대 전력을 초과하지 않는 경우 제3 공간 설정을 갖는 셀 2에서 하나 이상의 채널을 송신한다. 다른 하위 예에서, 전력이 TRP/공간 설정당 설정된 최대 전력을 초과하지 않고, 다수의 TRP/공간 설정당 최대 전력을 초과하지 않을 경우 UE는 각각의 공간 설정으로 하 나 이상의 채널을 송신한다. 도 15는 본 개시의 실시예에 따라 UE가 셀 또는 반송파 상에서의 PUSCH 송신에 대한 전력 감소를 위한 우선 순 위를 결정하는 예시적인 방법을 도시한다. 방법의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116)에 의해 수행될 수 있다. 도 15의 방법은 단지 예시를 위한 것이며, 본 개시의 범위를 벗어나 지 않고 다른 실시예가 사용될 수 있다. 단계에서, (UE와 같은) UE는 다수의 셀 상에서 동작하고 다수의 공간 설정으로 송신하도록 상위 계 층에 의해 설정된다. 단계에서, UE는 스케줄링되거나 설정된 송신을 위해 필요한 전력 및 공간 설정을 위 해 설정된 최대 전력을 기반으로 공간 설정을 갖는 각각의 송신에 대한 제1 전력을 결정한다. 단계에서, UE는 모든 공간 설정에 걸친 모든 송신에 대해 설정된 최대 전력에 따라 결정된 제1 전력에 기초하여 각각의 송 신에 대한 제2 전력을 결정한다. 단계에서, UE는 결정된 제2 전력을 공간 설정을 갖는 상응하는 송신에 적용한다. 도 15는 방법을 도시하지만 도 15에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 15의 방법 이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발 생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법의 단계는 상이한 순서로 실행될 수 있다. 또 다른 예의 경우, UE는 제1 공간 설정 및 제2 공간 설정을 갖는 셀 1 상에서 송신하고, 제3 공간 설정을 갖는 셀 2 상에서 송신하도록 설정될 수 있다. UE는 셀 1과 셀 2에 대한 송신 오케이젼에서 송신 전력의 상이한 분할 (partition)을 갖기 위해 전력을 할당할 수 있다. UE는 제1 공간 설정 및 제2 공간 설정을 갖는 셀 1 상에서 송 신하며, 여기서 2개의 공간 설정을 갖는 송신에 대한 전력의 합은 제3 공간 설정을 갖는 셀 2 상의 송신 전력과 동일하다. 셀 1 상에서, UE는 제1 및 제2 공간 설정을 갖는 두 송신 간의 전력을 동일하게 분할하거나 UE 구현 에 따라 또는 두 송신의 내용을 기반으로 분할할 수 있다. 본 개시의 실시예는 또한 gNB 설정 또는 인디케이션에 의한 송신 전력 감소를 위한 우선 순위화를 설명한다. 이 것은 아래의 예와 도 16 및 17에 설명되어 있다. 예를 들어, 2개의 셀 상에서의 송신을 위한 설정에 관하여, (UE와 같은) UE는 셀 1 상에서 제1 공간 설정 을 갖는 제1 PUSCH 또는 제1 PUCCH 및 셀 2 상에서 제2 공간 설정을 갖는 제2 PUSCH 또는 제2 PUCCH를 송신하 도록 설정될 수 있고, UE는 제1 및 제2 공간 설정과 동시에 송신할 수 있다. 셀 1은 셀 2와 같거나 상이할 수 있다. (BS와 같은) gNB는 상위 계층에 의해 셀 1 상의 제1 PUSCH 송신 및 셀 2 상의 제2 PUSCH 송신에 대 한 전력 할당의 우선 순위화를 UE에 설정할 수 있다. gNB는 또한 상위 계층에 의해 셀 1 상의 제1 PUCCH 및 셀 2 상의 제2 PUCCH의 송신에 대한 전력 할당의 우선 순위화를 UE에 설정할 수 있다. 또한, gNB는 상위 계층에 의 해 상이한 셀 상의 송신 및 동일한 셀 상의 상이한 채널의 송신을 위한 전력 할당에 대한 우선 순위화를 UE에 설정할 수 있다. 이러한 설정은 상이한 셀 상의 채널 조건 또는 공간 설정에 따라 유용하고, 주어진 서비스에 대한 상이한 채널의 성능 요구 사항에 따라 유용할 수 있다. 대안적으로 또는 부가적으로, gNB는 PUSCH 송신 또 는 PUCCH 송신을 스케줄링하는 DCI 포맷의 필드에 의해 UE 동작을 나타낼 수 있다. 예를 들어, PUSCH 송신을 스 케줄링하는 DCI 포맷의 1비트 필드는 PUSCH 송신이 다른 채널/신호의 송신보다 송신 전력 감소를 적용할 때 우 선 순위화되거나, 다른 셀 또는 반송파에서 또는 다른 공간 설정을 갖는 다른 PUSCH의 송신보다 우선 순위화됨 을 나타낼 수 있다. 다수의 셀 상의 PUSCH 송신의 경우, 필드는 하나 이상의 셀로부터의 셀 그룹에 각각 상응하 는 둘 이상의 비트를 포함할 수 있으며, 여기서 예를 들어 gNB는 상위 계층 시그널링에 의해 각각의 셀 그룹을 설정할 수 있다.도 16은 본 개시의 실시예에 따라 UE가 상이한 셀 상에서의 PUSCH의 송신에 대한 전력 감소를 위한 우선 순위를 결정하는 예시적인 방법을 도시한다. 도 17은 본 개시의 실시예에 따라 UE가 셀 상에서 PUSCH 및 PUCCH의 송신에 대한 전력 감소를 위한 우선 순위를 결정하는 예시적인 방법을 도시한다. 방법(1600 및 1700)의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116) 및/또는 BS와 같은 기지국에 의해 수행될 수 있 다. 도 16의 방법 및 도 17의 방법은 단지 예시를 위한 것이며, 본 개시의 범위를 벗어나지 않고 다른 실시예가 사용될 수 있다. 도 16의 방법에 도시된 바와 같이, (BS와 같은) gNB는 상위 계층에 의해 상이한 셀 상의 송신 및/또 는 셀 내의 상이한 채널/신호의 송신에 대한 전력 감소를 위한 우선 순위화를 UE에 설정할 수 있다(단계 ). 단계에서, gNB는 셀 상에서 PUSCH 송신을 스케줄링하는 DCI 포맷의 필드에 의해 셀 상에서 PUSCH 송신에 대한 전력 감소를 위한 우선 순위화를 나타낼 수 있다. 단계에서, UE는 동시 송신 간의 전 력 할당에 대한 우선 순위화에 기초하여 UE 최대 송신 전력에 대한 제한(limit)에 따라 PUSCH 송신에 대한 전력 을 결정한다. 동시 송신은 동일하거나 상이한 공간 설정으로 이루어질 수 있다. 도 17의 방법에 도시된 바와 같이, (BS와 같은) gNB는 상위 계층에 의해 셀의 그룹 상에서 PUSCH 및 PUCCH의 송신에 대한 전력 감소를 위한 우선 순위화를 UE에 설정할 수 있다. 예를 들어, PUSCH 송신은 상이한 셀 상에서 상이한 공간 설정으로 이루어지고, PUCCH 송신은 동일한 셀 상에서 PUSCH 송신과 동일한 공간 설정으 로 이루어진다. 단계에서, gNB는 제1 셀 상에서 PUSCH 송신을 스케줄링하는 DCI 포맷의 필드에 의해 셀의 그룹 상에서 PUSCH 송신에 대한 전력 감소를 위한 우선 순위화를 나타낼 수 있다. 단계에서, gNB는 제1 셀 상에서 PUCCH 송신을 스케줄링하는 DCI 포맷의 필드에 의해 셀의 그룹 상에서 PUCCH 송신에 대한 전력 감소 를 위한 우선 순위화를 나타낼 수 있다. 단계에서, (UE와 같은) UE는 동시 송신 간의 전력 할당에 대한 우선 순위에 기초하여 UE 최대 송신 전력에 대한 제한에 따라 각각의 셀 상에서 PUSCH 또는 PUCCH 송신을 위한 전력을 결정한다. 도 16 및 17은 방법(1600 및 1700)을 도시하지만, 도 16 및 17에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 17의 방법이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법의 단계는 상이한 순서로 실행될 수 있다. 본 개시의 실시예는 또한 상이한 공간 설정을 갖는 PUSCH 송신에 대한 전력 결정을 설명한다. 이것은 아래의 예 에서 설명된다. (UE와 같은) UE는 상이한 공간 설정을 사용하여 PUSCH, PUCCH, SRS 또는 PRACH를 송신할 수 있고, PUSCH, PUCCH, SRS 또는 PRACH 송신을 위한 전력을 결정할 수 있다. 결정된 전력은 SS/PBCH 블록 또는 CSI-RS와 같은 기준 신호의 수신으로부터 UE에 의해 계산된 경로 손실 추정에 기초할 수 있으며, 이는 송신 오케이젼에서 UE 최대 송신 전력에 따라 상응하는 공간 설정과 연관된다. 공간 설정 p를 갖는 송신을 위한 PUSCH 송신 전력의 결 정에 대한 다음의 설명은 UE가 반송파 f의 활성 UL BWP b 및 서빙 셀 c의 공간 설정 p에서 송신하는 것을 지칭 한다. 서빙 셀 c의 반송파 f의 활성 UL BWP b 상에서 공간 설정 p에 대해, UE는 PUSCH 송신 오케이젼 i에서 공간 설정 p를 갖는 PUSCH 송신에 대한 전력 PPUSCH,p(i)를 PUSCH 송신 오케이젼 i에서의 공간 설정 p에 대해 설정된 최대 전력 PPUSCH_MAX,p(i)과 식 에 설명된 바와 같은 전력 간의 최소 값으로서 결정한다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, j는 파라미터 세트 설정 인덱스이고, qd는 활성 DL BWP에 대한 RS 인덱스이며, l은 예를 들어 폐쇄 루 프 전력 제어(closed loop power control; CLPC) 조정 상태에 대한 PUSCH 전력 제어 조정 상태 인덱스이다. 표 현(expression) PO_PUSCH,b,f,p은 공간 설정 p마다 gNB에 의해 설정된 전력 값이다. 표현 MRB,b,f은 PUSCH 자원 할당 의 대역폭이고, μ는 SCS 설정이다. 표현 PLb,f,p은 공간 설정 p와 연관된 RS 수신을 기반으로 UE에 의해 측정된 경로 손실 레벨이다. 표현 αb,f,p은 gNB에 의해 설정된 경로 손실에 대한 보상을 나타내는 가중 인자이고 공간설정 p마다 별개로 제공될 수 있다. 표현 은 gNB에 의해 설정되는 송신된 데이터의 MCS 종속 오프셋이 며, 공간 설정 p를 갖는 각각의 송신에 대해 별개로 계산된다. 표현 fb,f,p(i)은 송신 오케이젼 i에서의 송신 전력 제어 값이며, 공간 설정 p마다 유지될 수 있다. 식 에서, 상술한 PO_PUSCH,b,f,p(j)는 구성 요소 PO_NOMINAL_PUSCH,f,p(j)와 구성 요소 PO_UE_PUSCH,b,f,p(j)의 합으로 구성된 파라미터이다. 인 것이 주목된다. 예를 들어, UE가 Type-1 랜덤 액세스 절차를 사용하여 전용 RRC 연결을 설정하고, P0-PUSCH-AlphaSet이 제공되 지 않거나 RAR UL 승인에 의해 스케줄링된 PUSCH 송신의 경우, 상술한 식 에 대해, 다음의 표현은 (i) j=0, (ii) 및 (iii) 로서 정의될 수 있 다. 여기서, 는 preambleReceivedTargetPower에 의해 제공되고, 는 msg3- DeltaPreamble에 의해 제공되거나, msg3-DeltaPreamble이 공간 설정 p의 반송파 f에 대해 제공되지 않으면 dB이다. 예를 들어, UE가 Type-2 랜덤 액세스 절차를 사용하여 전용 RRC 연결을 설정하고, P0-PUSCH-AlphaSet이 제공되 지 않거나 Type-2 랜덤 액세스 절차를 위한 PUSCH 송신의 경우, 상술한 식 에 대해, 다음의 표현은 (i) j=0, (ii) 및 (iii) 로서 정의될 수 있 다. 여기서, 는 preambleReceivedTargetPower에 의해 제공되고, 는 msgADeltaPreamble 에 의해 제공되거나, msgADeltaPreamble이 공간 설정 p의 반송파 f에 대해 제공되지 않으면 dB이다. ConfiguredGrantConfig에 의해 설정된 PUSCH (재)송신의 경우, j=1, PO_NOMINAL_PUSCH,f,p은 p0- NominalWithoutGrant에 의해 제공되거나, p0-NominalWithoutGrant가 제공되지 않을 경우 PO_NOMINAL_PUSCH, f,p=PO_NOMINAL_PUSCH,f,p이고, PO_UE_PUSCH,b,f,p은 ConfiguredGrantConfig의 p0-PUSCH-Alpha로부터 획득된 p0에 의해 제공되며, 이는 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 P0-PUSCH-AlphaSet의 세트에 인덱스 P0- PUSCH-AlphaSetId를 제공한다. 마찬가지로, 에 대해, 모든 에 적용 가능한 PO_NOMINAL_PUSCH,f,p(j) 값은 p0- NominalWithGrant에 의해 제공되거나, p0-NominalWithoutGrant가 제공되지 않을 경우 PO_NOMINAL_PUSCH, f,p=PO_NOMINAL_PUSCH,f,p이고, 공간 설정 p의 각각의 반송파 f에 대해 PO_UE_PUSCH,b,f,p(j) 값의 세트는 공간 설정 p 의 반송파 f의 활성 UL BWP b에 대한 각각의 p0-PUSCH-AlphaSetId 세트에 의해 나타내어지는 P0-PUSCH- AlphaSet의 p0 세트에 의해 제공된다. UE가 p0-PUSCH-AlphaSetId의 둘 이상의 값을 SRI-PUSCH-PowerControl에 의해 제공받고, PUSCH 송신을 스케줄링 하는 DCI 포맷이 SRI 필드를 포함하는 경우, UE는 매핑을 획득한다. 매핑은 DCI 포맷의 SRI 필드에 대한 값의 세트와 P0-PUSCH-AlphaSetId에 의해 제공되고 P0-PUSCH-AlphaSet 값의 세트에 매핑하는 인덱스의 세트 사이의 SRI-PUSCH-PowerControl의 sri-PUSCH-PowerControlId로부터 이루어질 수 있고, SRI 필드 값에 매핑되는 p0- PUSCH-AlphaSetId 값으로부터 PO_UE_PUSCH,b,f,p(j)의 값을 결정한다. DCI 포맷이 또한 개루프 전력 제어 파라미터 세트 인디케이션 필드를 포함하고, 개루프 전력 제어 파라미터 세트 인디케이션 필드의 값이 '1'인 경우, UE는 SRI 필드 값에 매핑된 p0-PUSCH-SetId-r16 값을 갖는 P0-PUSCH-Set-r16의 제1 값으로부터 PO_UE_PUSCH,b,f,p(j)의 값 을 결정한다. RAR UL 승인에 상응하는 PUSCH 재송신을 제외한 PUSCH 송신이 SRI 필드를 포함하지 않는 DCI 포맷에 의해 스케 줄링되는 경우, 또는 SRI-PUSCH-PowerControl이 UE에게 제공되지 않는 경우, j=2이다. 그런 다음 P0-PUSCH-Set 이 UE에 제공되고, DCI 포맷이 개루프 전력 제어 파라미터 세트 인디케이션 필드를 포함하는 경우, UE는 (i) 개 루프 전력 제어 파라미터 세트 인디케이션 필드의 값이 '0' 또는 '00'인 경우 p0-AlphaSets의 제1 P0-PUSCH- AlphaSet, (ii) 개루프 전력 제어 파라미터 세트 인디케이션 필드의 값이 '1' 또는 '01'인 경우 가장 낮은 P0-PUSCH-SetID 값을 갖는 P0-PUSCH-Set의 제1 값, (iii) 개루프 전력 제어 파라미터 세트 인디케이션 필드의 값이 '10'인 경우 가장 낮은 P0-PUSCH-SetID 값을 갖는 P0-PUSCH-Set의 제2 값으로부터 PO_UE_PUSCH,b,f,p(j)의 값을 결정 한다. 그렇지 않으면, UE는 p0-AlphaSets의 제1 P0-PUSCH-AlphaSet의 값으로부터 PO_UE_PUSCH,b,f,p(j)를 결정한다. j=0인 의 경우, 및 msgA-Alpha가 제공되면, 는 msgA-Alpha의 값이다. 대안으로, 또는 msgA- Alpha가 제공되지 않고, msg3-Alpha가 제공되면, 는 msg3-Alpha의 값이다. 그렇지 않으면, 이다. j=1인 의 경우, 는 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 P0-PUSCH-AlphaSet 세트 에 인덱스 P0-PUSCH-AlphaSetId를 제공하는 ConfiguredGrantConfig의 p0-PUSCH-Alpha로부터 획득된 Alpha에 의 해 제공된다. 인 의 경우, 값의 세트는 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 각각의 p0- PUSCH-AlphaSetId 세트에 의해 나타내어지는 P0-PUSCH-AlphaSet의 Alpha의 세트에 의해 제공된다. (i) SRI- PUSCH-PowerControl가 UE에 제공되고, (ii) p0-PUSCH-AlphaSetId의 둘 이상의 값이 제공되고, 및 (iii) PUSCH 송신을 스케줄링하는 DCI 포맷이 SRI 필드를 포함하면, UE는 DCI 포맷의 SRI 필드에 대한 값의 세트와 P0- PUSCH-AlphaSet 값의 세트에 매핑되는 p0-PUSCH-AlphaSetId에 의해 제공되는 인덱스의 세트 사이의 SRI-PUSCH- PowerControl의 sri-PUSCH-PowerControlId로부터 매핑을 획득하고, SRI 필드 값에 매핑되는 p0-PUSCH- AlphaSetId 값으로부터 의 값을 결정한다. PUSCH 송신이 SRI 필드를 포함하지 않는 DCI 포맷에 의해 스 케줄링되거나, SRI-PUSCH-PowerControl가 UE에 제공되지 않고, j=2인 경우, UE는 p0-AlphaSets의 제1 P0- PUSCH-AlphaSet의 값으로부터 를 결정한다. 는 반송파 f의 활성 UL BWP b 상에서 PUSCH 송신 오케이젼 i에 대한 자원 블록의 수로 표현되는 PUSCH 자원 할당의 대역폭이다. 본 개시의 실시예는 또한 경로 손실을 설명한다. 경로 손실은 다음의 예에서 설명된다. 예를 들어, (UE와 같은) UE는 반송파 f 및 공간 설정 p의 활성 DL BWP에 대한 경로 손실을 추정하기 위해 제1 공간 설정으로 송수신되는 기준 신호를 사용할 수 있으며, 여기서 제1 공간 설정은 공간 설정 p와 같거나 상이할 수 있다. 다음의 예에서, 는 활성 DL BWP, 서빙 셀 c의 반송파 f 및 공간 설정 p에 대한 기준 신호(RS) 인덱스 를 사용하여 UE에 의해 계산된 dB의 다운링크 경로 손실 추정치이다. 경로 손실의 결정을 위해, 공간 설정 p에 대한 PUSCH-PathlossReferenceRS 및 enableDefaultBeamPlForSRS가 UE 에 제공되지 않거나, 전용 상위 계층 파라미터가 UE에 제공되기 전에, UE는 UE가 MIB를 획득하기 위해 사용하는 것과 동일한 SS/PBCH 블록 인덱스를 가진 SS/PBCH 블록으로부터 RS 자원을 사용하여 계산한다. 그런 다음, 최대 maxNrofPUSCH-PathlossReferenceRSs의 값까지의 RS 자원 인덱스의 수와 PUSCH- PathlossReferenceRS에 의해 RS 자원 인덱스의 수에 대한 각각의 RS 설정 세트가 UE에 설정되면, RS 자원 인덱 스 세트는 상응하는 pusch-PathlossReferenceRS-Id의 값이 SS/PBCH 블록 인덱스에 매핑될 경우 ssb-Index에 의 해 각각 제공되는 SS/PBCH 블록 인덱스의 세트, 및 상응하는 pusch-PathlossReferenceRS-Id의 값이 CSI-RS 자 원 인덱스에 매핑될 경우 csi-RS-Index에 의해 각각 제공되는 CSI-RS 자원 인덱스의 세트 중 하나 또는 둘 다를 포함할 수 있다. UE는 PUSCH-PathlossReferenceRS의 pusch-PathlossReferenceRS-Id에 의해 제공되는 바와 같은 SS/PBCH 블록 인덱스 또는 CSI-RS 자원 인덱스에 상응하도록 RS 자원 인덱스의 세트에서 RS 자원 인덱스 를 식별한다.SRI-PUSCH-PowerControl 및 둘 이상의 PUSCH-PathlossReferenceRS-Id 값이 UE에 제공되는 경우, UE는 PUSCH 송 신을 스케줄링하는 DCI 포맷의 SRI 필드에 대한 값의 세트와 PUSCH-PathlossReferenceRS-Id 값의 세트 사이의 SRI-PUSCH-PowerControl의 sri-PUSCH-PowerControlId로부터 매핑을 획득한다. UE는 또한 SRI 필드 값에 매핑되 는 PUSCH-PathlossReferenceRS-Id의 값으로부터 RS 자원 인덱스 를 결정하며, 여기서 공간 설정 p와 연관된 RS 자원은 서빙 셀 c 상에 있거나, 제공되는 경우, pathlossReferenceLinking의 값에 의해 나타내어진 서빙 셀 상에 있다. PUSCH 송신이 DCI 포맷 0_0에 의해 스케줄링되고, 각각의 반송파 f 및 공간 설정 p의 활성 UL BWP b에 대한 가 장 낮은 인덱스를 갖는 PUCCH 자원에 대한 PUCCH-SpatialRelationInfo에 의해 공간 설정이 UE에 제공되면, UE 는 가장 낮은 인덱스를 가진 PUCCH 자원에서 PUCCH 송신에 대해서와 동일한 RS 자원 인덱스 를 사용한다. PUSCH 송신이 DCI 포맷 0_1에 의해 스케줄링되고, enableDefaultBeamPlForSRS가 UE에 제공되고, PUSCH- PathlossReferenceRS 및 PUSCH-PathlossReferenceRS-r16이 UE에 제공되지 않으면, UE는 PUSCH 송신과 연관된 SRS 자원을 가진 SRS 자원 세트에 대해서와 동일한 RS 자원 인덱스 를 사용한다. (i) PUSCH 송신이 DCI 포맷 0_0에 의해 스케줄링되고, PUCCH 송신을 위한 공간 설정이 UE에 제공되지 않는 경우, (ii) PUSCH 송신이 SRI 필드를 포함하지 않는 DCI 포맷 0_1 또는 DCI 포맷 0_2에 의해 스케줄링되는 경우, 또는 (iii) SRI-PUSCH-PowerControl이 UE에 제공되지 않는 경우, UE는 각각의 PUSCH- PathlossReferenceRS-Id 값이 0인 RS 자원 인덱스 를 결정하며, 여기서 RS 자원은 공간 설정 p와 연관되고, 서빙 셀 c 상에 있거나, 제공되는 경우, pathlossReferenceLinking의 값에 의해 나타내어진 서빙 셀 상에 있다. (i) PUSCH 송신이 서빙 셀 c 상에서 DCI 포맷 0_0에 의해 스케줄링되고, (ii) 서빙 셀 c의 활성 UL BWP에 대한 PUCCH 자원이 UE에 제공되지 않고, (iii) enableDefaultBeamPlForPUSCH0_0이 UE에 제공되는 경우, UE는 서빙 셀 c의 활성 DL BWP에서 가장 낮은 인덱스를 가진 CORESET의 QCL 가정 또는 TCI 상태에서 'QCL-TypeD'를 가진 공간 설정 p와 연관된 주기적 RS 자원을 제공하는 RS 자원 인덱스 를 결정한다. (i) PUSCH 송신이 서빙 셀 c 상에서 DCI 포맷 0_0에 의해 스케줄링되고, (ii) 1차 셀의 활성 UL BWP 상에서 PUCCH 자원에 대한 공간 설정이 UE에 제공되지 않고, (iii) enableDefaultBeamPlForPUSCH0_0가 UE에 제공되면, UE는 서빙 셀 c의 활성 DL BWP에서 가장 낮은 인덱스를 가진 CORESET의 QCL 가정 또는 TCI 상태에서 'QCL- TypeD'를 가진 공간 설정 p와 연관된 주기적 RS 자원을 제공하는 RS 자원 인덱스 를 결정한다. ConfiguredGrantConfig에 의해 설정된 PUSCH 송신의 경우, rrc-ConfiguredUplinkGrant가 ConfiguredGrantConfig에 포함되어 있으면, RS 자원 인덱스 는 rrc-ConfiguredUplinkGrant에 포함된 pathlossReferenceIndex의 값에 의해 제공된다. 이 예에서, RS 자원은 공간 설정 p에 연관되고, 서빙 셀 c 상에 있거나, 제공되는 경우, pathlossReferenceLinking의 값에 의해 나타내어진 서빙 셀 상에 있다. rrc-ConfiguredUplinkGrant를 포함하지 않는 ConfiguredGrantConfig에 의해 설정된 PUSCH 송신의 경우, UE는 PUSCH 송신을 활성화하는 DCI 포맷에서의 SRI 필드 값에 매핑되는 PUSCH-PathlossReferenceRS-Id의 값으로부터 RS 자원 인덱스 를 결정한다. PUSCH 송신을 활성화하는 DCI 포맷이 SRI 필드를 포함하지 않는 경우, UE는 각 각의 PUSCH-PathlossReferenceRS-Id 값이 0인 RS 자원 인덱스 를 결정하며, 여기서 RS 자원은 공간 설정 p 와 연관되고, 서빙 셀 c 상에 있거나, 제공되는 경우, pathlossReferenceLinking의 값에 의해 나타내어진 서빙 셀 상에 있다. UE에 enablePL-RS-updateForPUSCH-SRS가 제공되면, sri-PUSCH-PowerControlId와 PUSCH-PathlossReferenceRS- Id 값 사이의 매핑은 MAC CE에 의해 업데이트될 수 있다. SRI 필드를 포함하지 않는 DCI 포맷에 의해 스케줄링 된 PUSCH 송신 또는 ConfiguredGrantConfig에 의해 설정되고 SRI 필드를 포함하지 않는 DCI 포맷에 의해 활성 화되는 PUSCH 송신의 경우, RS 자원 인덱스 는 sri-PUSCH-PowerControlId = 0에 매핑된 PUSCH- PathlossReferenceRS-Id로부터 결정된다.경로 손실 공간 설정 p는 = referenceSignalPower - 상위 계층 필터링된 RSRP로서 결정되며, 여기 서 reference SignalPower는 기준 서빙 셀 및 공간 설정 p에 대한 상위 계층 및 RSRP와, 기준 서빙 셀에 대한 QuantityConfig에 의해 제공되는 상위 계층 필터 설정에 의해 제공된다. 주기적인 CSI-RS 수신이 UE에 설정되지 않으면, referenceSignalPower는 ss-PBCH-BlockPower에 의해 제공된다. 주기적인 CSI-RS 수신이 UE에 설정되면, referenceSignalPower는 ss-PBCH-BlockPower 또는 SS/PBCH 블록 송신 전력에 대한 CSI-RS 송신 전력 의 오프셋을 제공하는 powerControlOffsetSS에 의해 제공된다. powerControlOffsetSS가 UE에 제공되지 않으면, UE는 0 dB의 오프셋을 가정한다. 본 개시의 실시예는 또한 전력 제어 오프셋 을 설명한다. 이는 아래의 예에서 설명된다. 식 는 전력 제어 오프셋을 계산하기 위한 자원 요소의 수를 설명한다. 식 에서, 는 공간 설 정 p의 반송파 f의 활성 UL BWP b 상에서 PUSCH 송신 오케이젼 i에 대한 심볼의 수이다. 표현 은 PUSCH 심볼 j에서 DM-RS 부반송파와 위상 추적 RS 샘플을 제외한 부반송파의 수이며, PUSCH 송신이 반복 타입 B 를 사용하는 경우 공칭 반복에 대한 분할이 없다고 가정하며, 이다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 개시의 실시예는 또한 PUSCH 전력 제어 조정 상태 , 예를 들어 CLPC 조정 상태를 설명한다. 이는 아 래의 예와 도 18에 설명되어 있다. 다음의 예는 PUSCH 송신 오케이젼 i에서 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 PUSCH 전력 제어 조정 상태 를 설명한다. 표현 은 공간 설정 p의 반송파 f의 활성 UL BWP b 상에서 PUSCH 송신 오케이젼 i를 스케줄링하는 DCI 포맷에 포함되거나 TPC-PUSCH-RNTI에 의해 스크램블된 CRC와 함께 DCI 포맷 2_2의 다른 TPC 명령과 공동으 로 코딩된 송신 전력 제어(TPC) 명령 값이다. 여기서, twoPUSCH-PC-AdjustmentStates가 UE에 설정되면 이고, twoPUSCH-PC-AdjustmentStates가 UE에 설정되지 않거나 PUSCH 송신이 RAR UL 승인에 의해 스케 줄링되면 l=0이다. ConfiguredGrantConfig에 의해 설정된 PUSCH (재)송신의 경우, 의 값은 powerControlLoopToUse에 의해 UE에 제공된다. SRI-PUSCH-PowerControl가 UE에 제공되면, UE는 PUSCH 송신을 스케줄링하는 DCI 포맷에서의 SRI 필드에 대한 값의 세트와 sri-PUSCH-ClosedLoopIndex에 의해 제공되는 l 값 사이의 매핑을 획득하고, SRI 필드 값에 매핑되는 ㅣ값을 결정한다. PUSCH 송신이 SRI 필드를 포함하지 않는 DCI 포맷에 의해 스케줄링되거나, SRI-PUSCH-PowerControl이 UE에 제공되지 않는 경우, l=0이다. UE가 TPC- PUSCH-RNTI에 의해 스크램블된 CRC와 함께 DCI 포맷 2_2로부터 하나의 TPC 명령을 획득하면, l 값은 DCI 포맷 2_2의 폐루프 지시자 필드에 의해 제공된다. 식 은 tpc-Accumulation이 UE에 제공되지 않은 경우 공간 설정 p의 반송파 f 및 PUSCH 송신 오케이젼 i의 활성 UL BWP b에 대한 PUSCH 전력 제어 조정 상태 l을 설명한다. 식 에서, 값은 3GPP TS 38.213 v16.6.0, \"NR; Physical layer procedures for control\"의 Table 7.1.1-1에 있고, 는 PUSCH 전력 제어 조정 상태 l에 대한 공간 설정 p의 반송파 f의 활성 UL BWP b 상 에서 PUSCH 송신 오케이젼 이전의 심볼과 PUSCH 송신 오케이젼 i 이전의 심볼 사이에서 UE가 수신하는 카디널리티(cardinality) 를 갖는 TPC 명령 값의 세트 에서의 TPC 명 령 값의 합이며, 여기서 는 PUSCH 송신 오케이젼 이전의 심볼이 PUSCH 송신 오케이 젼 i 이전의 심볼 보다 앞서는 가장 작은 정수이다. 식 에 관하여, PUSCH 송신이 DCI 포맷에 의해 스케줄링된 경우, 는 상응하는 PDCCH 수신의 마지 막 심볼 이후 및 PUSCH 송신의 제1 심볼 이전의 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 심볼의 수이다. PUSCH 송신이 ConfiguredGrantConfig에 의해 설정되는 경우, 는 슬롯당 심볼의 수 와 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 PUSCH-ConfigCommon에서 k2에 의해 제공되는 값 중 최소값의 곱과 동일한 심볼의 수이다. UE가 PUSCH 송신 오케이젼 및 에서 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 최대 전력에 도달한 경우, 이다. UE가 PUSCH 송신 오케이젼 및 에서 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 최소 전력에 도달한 경우, 이다. (i) 상응하는 PO_UE_PUSCH,b,f,p(j) 값에 대한 설정이 상위 계층에 의해 제공되거나 (ii) 상응하는 값에 대한 설정이 상위 계층에 의해 제공되는 경우, UE는 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 PUSCH 전력 제 어 조정 상태 l의 누적을 로 재설정할 수 있다. 여기서, l은 j의 값으로부터 결정된 다. 예를 들어, j>1이고, 더 높은 SRI-PUSCH-PowerControl이 UE에 제공되는 경우, l은 j에 상응하는 sri-P0- PUSCH-AlphaSetId 값을 갖는 임의의 SRI-PUSCH-PowerControl에 설정된 sri-PUSCH-ClosedLoopIndex 값이다. 다 른 예의 경우, j>1이고, SRI-PUSCH-PowerControl가 UE에 제공되지 않거나 j=0인 경우, l=0이다. 또 다른 예의 경우, j=1인 경우, l은 powerControlLoopToUse의 값에 의해 제공된다. 식 는 tpc-Accumulation가 UE에 제공되는 경우 공간 설정 p의 반송파 f 및 PUSCH 송신 오케이젼 i의 활성 UL BWP b에 대한 PUSCH 전력 제어 조정 상태를 설명한다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "식 는 공간 설정 p의 반송파 f의 활성 UL BWP b 상에서 PRACH 송신 또는 MsgA 송신에 응답하여 UE가 랜덤 액 세스 응답 메시지를 수신할 때 PUSCH 전력 제어 조정을 설명한다. 식 에서, l=0이고, 는 Type-1 랜덤 액세스 절차에 따른 PRACH 송신에 상응하는 랜덤 액세스 응답 메시지의 랜덤 액세스 응답 승인 또는 공간 설정 p에서의 반송파 f의 활성 UL BWP b 상에서 fallbackRAR에 대한 RAR 메시지를 가진 Type-2 랜덤 액세스 절 차 및 식 에 따른 MsgA 송신에 상응하는 랜덤 액세스 응답 메시지의 랜덤 액세스 응답 승인에서 나타내어진 TPC 명령 값이다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, 는 상위 계층에 의해 제공되며, 공간 설정 p에서 반송파 f에 대한 제1 랜덤 액세스 프리앰블로부터 마지막 랜덤 액세스 프리앰블까지 상위 계층에 의해 요청된 전체 전력 램프업(ramp-up)에 상응 한다. 표현 은 공간 설정 p의 반송파 f의 활성 UL BWP b 상에서 제1 PUSCH 송신에 대한 자원 블록 의 수로 표현되는 PUSCH 자원 할당의 대역폭이다. 표현 은 공간 설정 p의 반송파 f의 활성 UL BWP b 상에서 제1 PUSCH 송신의 전력 조정이다. UE가 반송파 f 및 공간 설정 p의 활성 UL BWP b 상에서 PUSCH 송신 오케이젼 i에서 PUSCH를 송신하면, 이며, 여기서 l=0이고, 는 식 에서 설명된다. 는 식 에서 설명되는 바와 같이 상위 계층에 의해 제공되고, 상위 계층에 의해 요청된 전체 전력 램프업에 상응 하고, 가 자원 블록의 수로 표현되는 PUSCH 자원 할당의 대역폭이며, 가 PUSCH 송신 오케이젼 i에서 PUSCH 송신의 전력 조정인 것이 주목된다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 6, "content": "도 18은 본 개시의 실시예에 따라 UE가 PUSCH 송신 오케이젼에서 공간 설정 p를 갖는 PUSCH 송신에 대한 전력 을 결정하는 예시적인 방법을 도시한다. 방법의 단계는 도 3의 UE와 같은 도 1 의 임의의 UE(111-116)에 의해 수행될 수 있다. 도 18의 방법은 예시만을 위한 것이다. 본 개시의 범위를 벗어나지 않고 다른 실시예가 사용될 수 있다. 단계에서, (UE와 같은) UE에는 gNB에 의한 서빙 셀의 반송파 f 및 공간 설정 p의 활성 UL BWP b에 대해 송신 오케이젼에서의 최대 전력 , 송신 오케이젼에서의 전력 값 , 경로 손실 보상 인자 및 오프셋 이 설정된다. 단계에서, UE는 DCI 포맷의 상응하는 TPC 명령에 기초하 여 공간 설정 p마다 송신 오케이젼에 대한 폐루프 전력 제어 조정 상태 에 대한 값을 결정하며, 여기서 DCI 포맷은 PUSCH 송신을 스케줄링하는 DCI 포맷 또는 상술한 바와 같은 DCI 포맷 2_2일 수 있다. 단계에서, UE는 공간 설정 p와 연관된 RS 수신을 기반으로 경로 손실 을 측정한다. 단계에서, UE는 설정된 최대 전력 및 추정된 전력을 기반으로 송신 오케이젼 i에서 공간 설정 p를 가진 PUSCH 송신에 대한 전력을 결정하며, 여기서 추정된 전력은 다수의 구성 요소로 구성된다. 도 18은 방법을 도시하지만, 도 18에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 18의 방법 이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발 생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법의 단계는 상이한 순서로 실행될 수 있다. 본 개시의 실시예는 또한 상이한 셀 또는 반송파에서 상이한 공간 설정을 갖는 PUCCH 송신에 대한 송신 전력을 설명한다. 이는 아래의 예와 도 19에 설명되어 있다. 특정 실시예에서, UE는 다중 공간 설정을 갖는 송신을 위한 공간 설정을 제공하거나 결정할 때, UE는 인덱스 l 을 갖는 PUCCH 전력 제어 조정 상태를 사용하여 1차 셀에서의 반송파 f 및 공간 설정 p의 활성 UL BWP b 상에서 의 PUCCH 송신 오케이젼 i에서 PUCCH 송신을 위한 전력을 PUCCH 송신 오케이젼 i에서 공간 설정 p을 위해 설정 된 최대 전력 와 식 에서 설명된 바와 같은 전력 사이의 최소값으로서 결정한다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "는 PUCCH 송신 오케이젼 i에서 1차 셀 c의 공간 설정 p의 반송파 f에 대한 UE 설정된 최대 출력 전력이다. 식 에서, 는 공간 설정 p마다 gNB에 의해 설정된 전력 값이다. 는 PUSCH 자원 할당의 대역폭이고, 는 SCS 설정이다. 는 공간 설정 p와 연관된 RS 수신을 기반으로 UE에 의해 측정된 경로 손실 레벨이다. 는 제공되는 경우 PUCCH 포맷에 따른 인자이다. 는 gNB에 의 해 설정된 경로 손실에 대한 보상을 나타내는 가중치 인자이고, 공간 설정 p마다 개별적으로 제공될 수 있다.는 송신 오케이젼 i에서의 송신 전력 제어 값이고, 공간 설정 p마다 유지될 수 있다. 식 PO_PUCCH,b,f,p(qu)은 p0-nominal에 의해 제공되는 구성 요소 PO_NOMINAL_PUCCH, 또는 p0-nominal이 제공되지 않는 경 우 공간 설정 p의 반송파 f에 대한 PO_NOMINAL_PUCCH=0dBm, 및 제공되는 경우, 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 P0-PUCCH의 p0-PUCCH-Value에 의해 제공되는 구성 요소 PO_UE_PUCCH(qu)의 합으로 구성되는 파라미터 이며, 여기서 이다. 는 maxNrofPUCCH-P0-PerSet에 의해 제공되는 PO_UE_PUCCH 값의 세트에 대한 크기이다. PO_UE_PUCCH 값의 세트는 p0-Set에 의해 제공된다. p0-Set이 UE에 제공되지 않으면, PO_UE_PUCCH(qu), 이다. 부가적으로, 식 에서, 는 공간 설정 p의 반송파 f의 활성 DL BWP b에 대한 RS 자원 인덱스"}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "를 사용하여 UE에 의해 계산된 dB의 다운링크 경로 손실 추정치이다. pathlossReferenceRS가 UE에 제공되지 않은 경우 또는 전용 상위 계층 파라미터가 UE에 제공되기 전에, MIB를 획득하기 위해 UE가 사용하는 것과 동일한 SS/PBCH 블록 인덱스를 가진 SS/PBCH 블록으로부터 획득된 RS 자원을 사용하여 를 계산한다. 식 의 파라미터 는 PUCCH 포맷 0에 대한 deltaF-PUCCH-f0, PUCCH 포맷 1에 대한 deltaF- PUCCH-f1, PUCCH 포맷 2에 대한 deltaF-PUCCH-f2, PUCCH 포맷 3에 대한 deltaF-PUCCH-f3, 및 제공되는 경우, PUCCH 포맷 4에 대한 deltaF-PUCCH-f4의 값이고; 그렇지 않으면, 이다. 식 의 파라미터 는 공간 설정 p의 반송파 f의 활성 UL BWP b 상의 PUCCH 송신 전력 조정 구성 요 소이다. PUCCH 포맷 0 또는 PUCCH 포맷 1을 사용하는 PUCCH 송신에 대해, 는 아래의 식 에서 설 명된다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서, 는 PUCCH 송신에 대한 PUCCH 포맷 0 심볼 또는 PUCCH 포맷 1 심볼의 수이다. PUCCH 포맷 0 에 대한 , PUCCH 포맷 1에 대한 , PUCCH 포맷 0에 대한 , 그렇지 않으 면 PUCCH 포맷 1에 대한 이며, 여기서 는 PUCCH 송신 오케이젼 i에서의 UCI 비트의 수인 것이 주목된다. PUCCH 포맷 2 또는 PUCCH 포맷 3 또는 PUCCH 포맷 4를 사용하는 PUCCH 송신의 경우 및 11보다 작거나 같은 UCI 비트의 수에 대해, 는 아래의 식 에서 설명된다. 식 에서 설명된 바와 같이, K1=6이다. 파라 미터 nHARQ-ACK는 UE가 Type-1 HARQ-ACK 코드북 및 Type-2 HARQ-ACK 코드북에 대해 결정하는 HARQ-ACK 정보 비트 의 수이다. pdsch-HARQ-ACK-Codebook이 UE에 제공되지 않으면, 이다. UE가 PUCCH 송신에 HARQ-ACK 정보 비트를 포함하는 경우; 그렇지 않으면, 이다. 파라미터 는 UE가 결정 하는 SR 정보 비트의 수이다. 파라미터 는 UE가 결정하는 CSI 정보 비트의 수이다. 파라미터 는 식 에 기초한 자원 요소의 수이다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "여기서, 는 DM-RS 송신에 사용되는 부반송파를 제외한 자원 블록당 부반송파의 수이고, 는 공간 설정 p의 반송파 f의 활성 UL BWP b 상에서 PUCCH 송신 오케이젼 i에 대해 DM-RS 송 신에 사용되는 심볼을 제외한 심볼의 수이다. PUCCH 포맷 2 또는 PUCCH 포맷 3 또는 PUCCH 포맷 4를 사용하는 PUCCH 송신의 경우와 11보다 큰 UCI 비트의 수 에 대해, 는 아래의 식 에서 설명된다. 식 에서 설명된 바와 같이, K1=24이다. 파라미터 BPRE(i)는 식 에서 설명된다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "식 에서 설명되는 바와 같이, 는 Type-1 HARQ-ACK 코드북과 Type-2 HARQ-ACK 코드북에 대해 UE가 결정하는 HARQ-ACK 정보 비트의 수이다. pdsch-HARQ-ACK-Codebook이 UE에 제공되지 않으면, UE가 PUCCH 송신에 HARQ-ACK 정보 비트를 포함하는 경우 =1이고, 그렇지 않으면, =0이다. 파라미터 는 SR 정보 비트의 수이다. 파라미터 는 CSI 정보 비트의 수이다. 파라미터 는 CRC 비트의 수이 다. 파라미터 는 식 에 기초하여 UE가 결정하는 자원 요소의 수이다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "여기서, 는 DM-RS 송신에 사용되는 부반송파를 제외한 자원 블록당 부반송파의 수이고, 은 공간 설정 p의 반송파 f의 활성 UL BWP b 상에서 PUCCH 송신 오케이젼 i에 대해 DM-RS 송 신에 사용되는 심볼을 제외한 심볼의 수이다. 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 PUCCH 전력 제어 조정 상태 및 PUCCH 송신 오케이 젼 i에 대해, 는 TPC 명령 값이고, UE가 PUCCH 송신 오케이젼 i에 대해 검출하는 공간 설정 p의 반송파 f의 활성 UL BWP f에 대한 DCI 포맷 1_0 또는 DCI 포맷 1_1에 포함되거나 TPC-PUCCH-RNTI에 의해 스크 램블된 CRC를 갖는 DCI 포맷 2_2에서 다른 TPC 명령과 공동으로 코딩된다. 여기서, twoPUSCH-PC- AdjustmentStates 및 PUCCH-SpatialRelationInfo가 UE에 설정되면 이고, twoPUSCH-PC- AdjustmentStates 또는 PUCCH-SpatialRelationInfo가 UE에 설정되지 않으면 l=0이다. 식 는 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 현재 PUCCH 전력 제어 조정 상태 l 및 PUCCH 송신 오케이젼 i에 대한 전력 제어 조정 상태 를 설명한다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "여기서, 값은 전력 제어 명령과의 매핑을 기반으로 미리 결정된다. 표현 은 PUCCH 전력 제어 조정 상태에 대한 공간 설정 p의 반송파 f의 활성 UL BWP b 상에 서 PUCCH 송신 오케이젼 이전의 심볼과 PUCCH 송신 오케이젼 i 이전의 심볼 사이에서 UE가 수신하는 카디널리티 를 갖는 TPC 명령 값의 세트 Ci에서의 TPC 명령 값의 합이며, 여기 서 는 PUCCH 송신 오케이젼 이전의 심볼이 PUCCH 송신 오케이젼 i 이전의 심볼 보다 앞서는 가장 작은 정수이다. PUCCH 송신이 DCI 포맷 1_0 또는 DCI 포맷 1_1의 UE에 의한 검출에 응답하는 경우, 는 상응하는 PDCCH 수신의 마지막 심볼 이후와 PUCCH 송신의 제1 심볼 이전의 공간 설정 p의 반송파 f의 활성 UL BWP b에 대 한 심볼의 수이다. PUCCH 송신이 DCI 포맷 1_0 또는 DCI 포맷 1_1의 UE에 의한 검출에 응답하지 않는 경우, 는 슬롯당 심볼의 수 와 공간 설정 p의 반송파 f의 활성 UL BWP b에 대해 PUSCH-ConfigCommon에서 k2에 의해 제공 된 값 중 최소값의 곱과 동일한 심볼의 수이다. UE가 PUCCH 송신 오케이젼 에서 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 최대 전력에 도달하고, 인 경우, 이다. UE가 PUCCH 송신 오케이젼 에서 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 최소 전력에 도달하고, 인 경우, 이다. 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 상응하는 PUCCH 전력 제어 조정 상태 l에 대한 값의 설정이 상위 계층에 의해 제공되는 경우, 이다. PUCCH- SpatialRelationInfo가 UE에 제공되는 경우, UE는 에 상응하는 p0-PUCCH-Id 값 및 l에 상응하는 closedLoopIndex 값과 연관된 pucch-SpatialRelationInfoId 값에 기초하여 의 값으로부터 l의 값을 결정하 며; 그렇지 않으면 l=0이다. 그렇지 않으면, 식 은 전력 제어 조정 상태 를 설명한다. 파라미터 k는 0으로 설정된다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "파라미터 는 Type-1 랜덤 액세스 절차에 따른 PRACH 송신에 상응하는 랜덤 액세스 응답 승인 또는 fallbackRAR에 대한 RAR 메시지와 함께 Type-2 랜덤 액세스 절차에 따른 MsgA 송신에 상응하는 랜덤 액세스 응 답 승인에 나타내어진 TPC 명령 값이다. 그렇지 않으면, 파라미터 는 Type-2 랜덤 액세스 절차에 대한 MsgA 송신에 상응하는 성공적 RAR에 나타내어진 TPC 명령 값이다. 그렇지 않으면, 파라미터 는 PUCCH 송신 이 제1 PDCCH 수신의 마지막 심볼로부터 28 심볼 이후의 제1 PUCCH 송신인 경우 recoverySearchSpaceId에 의해 제공되는 검색 공간 세트에서의 제1 PDCCH 수신에서 UE가 검출하는 C-RNTI 또는 MCS-C-RNTI에 의해 스크램블된 CRC를 가진 DCI 포맷의 TPC 명령 값이다. UE가 공간 설정 p의 반송파 f의 활성 UL BWP b 상에서 PUCCH를 송신하면, 식 의 는 식 에 서 설명되고, 그렇지 않으면, 식 에서 설명된다. 파라미터 는 상위 계층에 의해 제공되 고, 공간 설정 p의 반송파 f의 활성 UL BWP b에 대한 제1 프리앰블에서 마지막 프리앰블까지 상위 계층에 의해 요청된 총 전력 램프업에 상응한다. 파라미터 는 PUCCH 포맷 0 또는 PUCCH 포맷 1에 상응한다."}
{"patent_id": "10-2023-7008300", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 15, "content": "도 19는 본 개시의 실시예에 따라 UE가 PUCCH 송신 오케이젼 i에서 공간 설정 p를 갖는 PUCCH 송신을 위한 전력 을 결정하는 예시적인 방법을 도시한다. 방법의 단계는 도 3의 UE와 같은 도 1 의 임의의 UE(111-116)에 의해 수행될 수 있다. 도 19의 방법은 예시만을 위한 것이고, 본 개시의 범위를 벗어나지 않고 다른 실시예가 사용될 수 있다. 단계에서, UE에는 전력 값 , PUCCH 포맷에 따른 전력 조정 인자 , gNB에 의 한 서빙 셀의 반송파 f 및 공간 설정 p의 활성 UL BWP b에서 PUCCH 송신의 스펙트럼 효율에 대한 보상을 나타내 는 인자 가 설정된다. 단계에서, UE는 공간 설정 p마다 송신 오케이젼에서 폐루프 전력 조정 상태 의 값을 결정한다. 단계에서, UE는 공간 설정 p와 연관된 RS 수신을 기반으로 경로 손실 을 측정한다. 단계에서, UE는 PUCCH 송신 오케이젼에서 설정된 최대 전력 과 추정된 전 력을 기반으로 PUCCH 송신 오케이젼 i에서 공간 설정 p를 갖는 PUCCH 송신을 위한 전력을 결정하며, 추정된 전 력은 다수의 구성 요소로 구성된다. 도 19은 방법을 도시하지만, 도 19에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 19의 방법 이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발 생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법의 단계는 상이한 순서로 실행될 수 있다. 본 개시의 실시예는 또한 반복을 통한 송신을 설명한다. 이것은 아래의 예에서 설명된다. 다음의 실시예에서, (UE와 같은) UE에는 하나의 슬롯에서의 단일 반복의 송신을 지칭하는 PUSCH 반복 타입 A가 설정되며, 여기서 반복의 모든 심볼은 슬롯 지속 시간 내에 있고, 후속 반복은 후속 슬롯에서 송신되며, 슬 롯에서의 송신은 생략될 수 있다. PUSCH 반복 타입 B가 설정된 UE는 UE가 하나의 슬롯에서 둘 이상의 반복을 송 신할 수 있고, 하나의 반복은 둘 이상의 슬롯에 걸쳐 있을 수 있으며, 상이한 반복은 상이한 수의 심볼에 걸쳐 있을 수 있는 경우를 포함한다. UE가 PUSCH를 반복하여 송신하지 않는 경우, UE는 PUSCH 송신에 대해 1회/제1 반복만을 송신하는 것으로 간주된다. 또한, UE는 상이한 공간 설정으로 동시에 송신할 수 없다고 가정된다. 본 명세서에서 PUSCH에 대해 설명된 반복을 통한 송신에 대한 우선 순위를 결정하는 실시예는 또한 PUCCH 송신에 적용된다. 특정 실시예에서, UE는 셀 1 상에서 제1 공간 설정을 갖는 PUSCH를 송신하고, 셀 2 상에서 제2 공간 설정을 갖 는 PUSCH를 송신하도록 설정된다. 이는 아래의 예 및 도 20 내지 도 24에서 설명된다. PUSCH 송신이 셀 1 상에서의 송신을 위해 반복으로 설정되고, PUSCH 송신이 송신 오케이젼 상의 셀 2 상에서 반 복 없이 설정되는 경우, UE는 셀 2 상에서 반복 없이 설정된 송신을 우선 순위화한다. PUSCH 송신이 셀 1과 셀 2 모두에서 송신을 위해 반복으로 설정되고, UE가 송신 오케이젼 상의 셀 1과 셀 2 모 두에서 PUSCH를 반복하여 송신할 필요가 있는 경우, UE는 다양한 송신을 우선 순위화할 수 있다. 예를 들어, UE 는 타입 A 반복에 대한 제1 공칭(nominal) 반복 또는 타입 B 반복에 대한 제1 실제(actual) 반복일 수 있는 제1 반복의 송신을 우선 순위화할 수 있다. 다른 예의 경우, UE는 두 셀 상의 PUSCH 반복이 제1 반복인 경우 공칭 타입 A 반복의 송신을 우선 순위화할 수 있다. 다른 예의 경우, UE는 반복 횟수가 더 적은 PUSCH 송신에 대해 반복 송신을 우선 순위화할 수 있다. 다른 예의 경우, UE는 반복 횟수가 더 적은 PUSCH 송신에 대해 반복 송신 을 우선 순위화할 수 있다. 다른 예의 경우, UE는 타입 A 반복에 대해 반복마다 더 작은(또는 더 큰) PUSCH 심 볼 수를 가진 반복 송신을 우선 순위화할 수 있다. 다른 예의 경우, UE는 하나의 슬롯에서 더 적은 수의 PUSCH 심볼을 가진 반복 송신을 우선 순위화할 수 있다. 또 다른 예의 경우, UE는 더 적은(또는 더 큰) SCS를 가진 반 복의 송신을 우선 순위화할 수 있다. UE는 도 20에 설명된 바와 같이 내림차순으로 상술한 우선 순위화 및 상술한 우선 순위화의 조합을 적용할 수 있다. 도 20은 본 개시의 실시예에 따라 UE가 반복을 우선 순위화하는 예시적인 방법을 도시한다. 방법의 단계는 도 3의 UE와 같은 도 1의 임의의 UE(111-116)에 의해 수행될 수 있다. 도 20의 방법은 예시 만을 위한 것이고, 본 개시의 범위를 벗어나지 않고 다른 실시예가 사용될 수 있다. 단계에서, (UE와 같은) UE는 제1 셀 상에서 반복 없이 설정된 PUSCH 또는 PUCCH 송신이 각각 제2 셀 상에서 반복을 통한 PUSCH 또는 PUCCH 송신보다 우선 순위화할 수 있다. 제1 및 제2 셀 상의 송신이 모두 반 복되는 경우, 다른 송신 특성이 고려된다. UE는 PUSCH 또는 PUCCH 송신의 후속 반복보다 PUSCH 또는 PUCCH 송신 의 제1 반복을 우선 순위화한다(단계). 제1 타입 A 반복은 제1 타입 B 반복보다 우선 순위화되거나, 일반 적으로, 두 반복이 모두 제1 반복인 경우, 슬롯당 단일 반복의 송신은 슬롯당 다수의 반복의 송신보다 우선 순 위화된다(단계). 슬롯당 다수의 반복이 UE가 슬롯에서 송신하는 데 사용할 수 있는 더 많은 심볼을 활용 할 수 있으므로 그 반대도 선택된 송신 특성일 수 있다. 두 송신이 모두 둘 이상 반복되는 경우, UE는 반복 횟 수가 더 적은 송신에 상응하는 반복을 우선 순위화한다(단계). 두 송신이 모두 반복적일 때, 반복 횟수가 더 적은 송신이 우선 순위화된다. 도 20은 방법을 도시하지만, 도 20에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 20의 방법 이 일련의 단계로서 도시되어 있지만, 다양한 단계가 중첩되거나, 병렬로 발생하거나, 상이한 순서로 발 생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 예를 들어, 방법의 단계는 상이한 순서로 실행될 수 있다. 도 21, 22, 23 및 24는 본 개시의 실시예에 따른 예시적인 신호 다이어그램을 도시한다. 또한, 반복 및 반복 타입의 설정은 송신 전력 감소를 위한 우선 순위를 결정하기 위해 사용될 수 있다. 이러한 우선 순위화는 반복을 통한 PUSCH 송신의 전체 송신에 사용될 수 있다. 예를 들어, UE가 셀 1 상에서 반복 타입 A를 갖는 제1 PUSCH를 송신하고, 셀 2 상에서 반복 타입 B를 갖는 제2 PUSCH를 송신하는 경우, UE는 셀 2 상의 제2 PUSCH 송신의 반복보다 셀 1 상의 제1 PUSCH 송신의 반복을 우선 순위화할 수 있다. UE가 셀 1 및 셀 2 상에서 각각 타입 B 반복을 갖는 제1 및 제2 PUSCH를 송신하는 경우, UE는 다양한 송신을 우 선 순위화할 수 있다. 예를 들어, UE는 제1 실제 반복으로 송신을 우선 순위화할 수 있다. 예를 들어, 도 21에 도시된 바와 같이, UE가 하나의 슬롯을 통해 제1 PUSCH에 대한 제1 반복을 송신하고, 동일한 슬롯을 통해 제2 PUSCH에 대한 제3 반복을 송신하는 경우, UE는 제1 반복을 우선 순위화한다. 일반적으로, 송신 전력 감소에 대 한 우선 순위화는 송신 오케이젼에 적용하며, 이는 이 예에서는 11개의 심볼 그룹에 상응한다. 도 21은 UE가 슬롯의 심볼 4 내지 14를 통해 셀 1(PUSCH1) 및 셀 2(PUSCH2) 상에서 반복을 통한 PUSCH 송신을 위해 설정되는 신호 다이어그램을 도시한다. UE는 셀 1 상에서 PUSCH1의 길이 11 심볼의 제1 반복 을 송신하고, 셀 2 상에서 PUSCH2의 길이 11 심볼의 제3 반복을 송신한다. 다른 예의 경우, UE는 반복당 더 적은 수의 PUSCH 심볼로 반복 송신을 우선 순위화할 수 있다(예를 들어, 도 22 에 도시된 바와 같이, UE가 셀 1 상에서 반복을 통한 제1 PUSCH를 송신하고 공칭 반복 길이가 4 심볼이고, 셀 2 상에서 반복을 통한 제2 PUSCH를 송신하고 공칭 반복 길이가 8 심볼인 경우, UE는 제1 PUSCH의 송신을 우선 순 위화한다). 도 22는 UE가 슬롯의 심볼 4 내지 14를 통해 셀 1(PUSCH1) 및 셀 2(PUSCH2) 상에서 반복을 통한 PUSCH 송신을 위해 설정되는 신호 다이어그램을 도시한다. UE는 셀 1 상에서 길이 4 심볼의 PUSCH 반복을 송신하고 , 셀 2 상에서 길이 8 심볼의 PUSCH 반복을 송신한다. 다른 예의 경우, UE는 하나의 슬롯에서 더 적은 수의 PUSCH 심볼로 반복의 송신을 우선 순위화할 수 있으며, 여 기서 UE는 하나 이상의 반복을 송신할 수 있다(예를 들어, 도 23에 도시된 바와 같이, UE가 셀 1 상의 슬롯에서 총 8개의 심볼에 걸쳐 제1 PUSCH의 반복을 송신하고, 동일한 슬롯을 통해 셀 2 상에서 11개의 심볼에 걸쳐 제2 PUSCH의 반복을 송신하는 경우, UE는 슬롯을 통해 제1 PUSCH 송신의 반복을 우선 순위화한다). 도 23은 UE가 슬롯의 심볼 4 내지 14를 통해 셀 1(PUSCH1) 및 셀 2(PUSCH2) 상에서 반복을 통한 PUSCH 송신을 위해 설정되는 신호 다이어그램을 도시한다. UE는 셀 1 상의 길이 4 심볼의 각각과 셀 2 상 의 길이 11 심볼의 하나의 반복인 두 PUSCH 반복을 송신한다. 다른 예의 경우, UE는 더 적은 수의 반복을 통한 송신에 대한 반복의 송신을 우선 순위화할 수 있다(예를 들어, UE가 셀 1 상에서 4 반복을 통한 제1 PUSCH를 송신하고 셀 2 상에서 8 반복을 통한 제2 PUSCH를 송신하도록 설 정되는 경우, UE는 제1 PUSCH에 대한 반복의 송신을 우선 순위화한다). 다른 예의 경우, UE는 슬롯을 통해 더 작은 반복 횟수/인덱스를 갖는 반복의 송신을 우선 순위화할 수 있다(예 를 들어, UE가 슬롯을 통해 셀 1 상에서 제1 PUSCH 송신의 제2 반복을 송신하고 제1 PUSCH의 제2 반복의 제1 심 볼이 슬롯에 있고, UE가 슬롯을 통해 셀 2 상에서 제2 PUSCH 송신의 제3 반복을 송신하고 제3 반복의 제1 심볼 이 슬롯에 있는 경우, UE는 제2 반복의 송신을 우선 순위화한다). 또 다른 예의 경우, UE는 제1 PUSCH 송신에 대한 반복의 송신을 우선 순위화할 수 있으며, 여기서 반복의 제1 심볼은 제2 PUSCH 송신에 대한 반복의 제1 심볼 이후에 시작한다(예를 들어, 도 24에 도시된 바와 같이, 셀 1 상에서의 제1 PUSCH 송신에 대한 반복의 제1 심볼이 셀 2 상에서의 제2 PUSCH 송신의 제1 반복의 제3 심볼과 중 첩하는 경우, UE는 제1 PUSCH 송신에 대한 반복의 송신을 우선 순위화한다). 도 24는 UE가 셀 1 상에서 14 심볼을 통해 제1 PUSCH(PUSCH1)를 송신하고 셀 2 상에서 4 반복을 사용하여 4 심 볼을 통해 제2 PUSCH(PUSCH2)를 송신하는 신호 다이어그램을 도시한다. PUSCH1의 제1 심볼은 PUSCH2의 제1 반복의 제3 심볼과 중첩한다. 상술한 흐름도는 본 개시의 원리에 따라 구현될 수 있는 예시적인 방법을 도시하며, 본 명세서에서의 흐름도에 도시된 방법에 대해 다양한 변경이 이루어질 수 있다. 예를 들어, 일련의 단계로서 도시되었지만, 각각의 도면 의 다양한 단계는 중첩하거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 도면은 사용자 장치의 상이한 예를 예시하지만, 도면에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 사용 자 장치는 임의의 적절한 배치로 임의의 수의 각각의 구성 요소를 포함할 수 있다. 일반적으로, 도면은 본 개시 의 범위를 임의의 특정 설정으로 제한하지 않는다. 더욱이, 도면은 본 특허 문서에 개시된 다양한 사용자 장치 특징이 사용될 수 있는 동작 환경을 예시하지만, 이러한 특징은 임의의 다른 적절한 시스템에서 사용될 수 있다. 본 개시가 예시적인 실시예로 설명되었지만, 다양한 변경 및 수정이 통상의 기술자에게 제시될 수 있다. 본 개 시는 첨부된 청구항의 범주 내에 속하는 이러한 변경 및 수정을 포함하는 것으로 의도된다. 본 출원에서의 설명 은 임의의 특정 요소, 단계 또는 기능이 청구 범위에 포함되어야 하는 필수 요소임을 암시하는 것으로 해석되지 않아야 한다. 특허된 주제(patented subject matter)의 범위는 청구항에 의해 정의된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22 도면23 도면24"}
{"patent_id": "10-2023-7008300", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시 및 그 이점에 대한 더욱 완전한 이해를 위해, 동일한 도면 부호가 동일한 부분을 나타내는 첨부된 도면 과 관련하여 취해진 다음의 설명에 대한 참조가 이제 이루어진다. 도 1은 본 개시의 실시예에 따른 예시적인 무선 네트워크를 도시한다. 도 2는 본 개시의 실시예에 따른 예시적인 기지국(BS)를 도시한다. 도 3은 본 개시의 실시예에 따른 예시적인 사용자 장치(UE)를 도시한다. 도 4 및 5는 본 개시의 실시예에 따른 예시적인 무선 송수신 경로를 도시한다. 도 6은 본 개시의 실시예에 따라 UE가 주어진 송신 발생에서 셀 0 상의 제1 물리적 업링크 공유 채널(physical uplink shared channel; PUSCH) 및 셀 1 상의 제2 PUSCH를 송신하는 예시적인 방법을 도시한다. 도 7은 본 개시의 실시예에 따라 UE가 시간 패턴에 따라 마스터 셀 그룹(master cell group; MCG) 및 2차 셀 그 룹(secondary cell group; SCG) 상에서 송신의 우선 순위를 결정하는 예시적인 방법을 도시한다. 도 8은 본 개시의 실시예에 따라 UE가 gNB에 의한 인디케이션(indication)에 따라 송신의 우선 순위를 결정하는 예시적인 방법을 도시한다. 도 9는 본 개시의 실시예에 따라 2개 이상의 중첩 PUSCH 송신 중에서 PUSCH의 송신을 우선 순위하기 위한 규칙 세트가 적용될 수 있는 순서의 예시적인 방법을 도시한다. 도 10은 본 개시의 실시예에 따른 제1 PUSCH 송신 및 제2 PUSCH 송신의 예시적인 신호 다이어그램을 도시한다. 도 11은 본 개시의 실시예에 따른 제1 PUSCH 송신 및 제2 PUSCH 송신의 예시적인 신호 다이어그램을 도시한다. 도 12는 본 개시의 실시예에 따라 UE가 PUSCH 송신을 연기할지 또는 취소할지를 결정하는 예시적인 방법을 도시 한다. 도 13은 본 개시의 실시예에 따라 UE가 PUSCH 송신에 대한 우선 순위를 결정하는 예시적인 방법을 도시한다. 도 14는 본 개시의 실시예에 따라 UE가 PUSCH 또는 물리적 업링크 제어 채널(physical uplink control channel; PUCCH) 송신에 대한 우선 순위를 결정하는 예시적인 방법을 도시한다. 도 15는 본 개시의 실시예에 따라 UE가 셀 또는 반송파 상에서 PUSCH 송신에 대한 전력 감소를 위한 우선 순위 를 결정하는 예시적인 방법을 도시한다. 도 16은 본 개시의 실시예에 따라 UE가 상이한 셀 상에서 PUSCH의 송신에 대한 전력 감소를 위한 우선 순위를 결정하는 예시적인 방법을 도시한다. 도 17은 본 개시의 실시예에 따라 UE가 셀 상에서 PUSCH 및 PUCCH의 송신에 대한 전력 감소를 위한 우선 순위를 결정하는 예시적인 방법을 도시한다. 도 18은 본 개시의 실시예에 따라 UE가 PUSCH 송신 오케이젼 i에서 공간 설정 p를 갖는 PUSCH 송신에 대한 전력 PPUSCH,p(i)를 결정하는 예시적인 방법을 도시한다. 도 19는 본 개시의 실시예에 따라 UE가 PUCCH 송신 오케이젼 i에서 공간 설정 p를 갖는 PUCCH 송신에 대한 전력 PPUCCH,p(i)를 결정하는 예시적인 방법을 도시한다. 도 20은 본 개시의 실시예에 따라 UE가 반복을 우선 순위화하는 예시적인 방법을 도시한다. 도 21은 본 개시의 실시예에 따른 예시적인 신호 다이어그램을 도시한다. 도 22는 본 개시의 실시예에 따른 예시적인 신호 다이어그램을 도시한다.도 23은 본 개시의 실시예에 따른 예시적인 신호 다이어그램을 도시한다. 도 24는 본 개시의 실시예에 따른 예시적인 신호 다이어그램을 도시한다."}
