{"patent_id": "10-2022-0082588", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0008427", "출원번호": "10-2022-0082588", "발명의 명칭": "부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템", "출원인": "(주)성주컴퍼니", "발명자": "이형태"}}
{"patent_id": "10-2022-0082588", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "회원가입절차를 진행하되, 분양현장 영업직원 및 수분양자에 대한 증빙 절차를 각각 진행하고, 증빙 완료된 대상자에 대하여 게시판의 글쓰기가 가능한 정회원으로 가입 처리하는 회원 가입 처리부; 및미리 정의된 부동산 피해 사례 별로 카테고리화 된 민원 게시글을 상기 정회원으로부터 익명으로 등록 받아 공유하는 블라인드 민원 게시판 관리부를 포함하는 것을 특징으로 하는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템."}
{"patent_id": "10-2022-0082588", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 회원 가입 처리부는,분양현장 영업직원에 대한 회원 가입 절차를 진행하되, 분양현장 영업직원을 증빙하기 위한 명함을 촬영한 사진파일을 등록 받고, 등록된 사진파일에 대한 이미지를 저장한 후, 해당 이미지 내 텍스트 추출 및 인식하고, 인식된 텍스트에 대한 필수 항목이 포함된 경우 해당 텍스트를 저장하여 증빙 절차를 완료하고, 저장된 텍스트의필수 항목을 제외한 기본 항목에 대한 정보를 추가 등록 받아 회원 가입 절차를 진행하는 분양현장 영업직원 회원 가입 처리부;수분양자에 대한 회원 가입 절차를 진행하되, 분양사실을 증빙하기 위해 청약홈페이지에서 캡처한 당첨사실조회화면 캡처파일을 등록 받고, 등록된 캡처파일에 대한 이미지를 저장한 후, 해당 이미지 내 텍스트 추출 및 인식하고, 인식된 텍스트에 대한 필수 항목이 포함된 경우 해당 텍스트를 저장하여 증빙 절차를 완료하고, 수분양자의 기본 항목에 대한 정보를 추가 등록 받아 회원 가입 절차를 진행하는 수분양자 회원 가입 처리부; 및상기 민원 게시글의 열람 및 댓글쓰기 권한을 부여 받는 일반 회원에 대한 회원 가입 절차를 진행하는 일반 회원 가입 처리부를 포함하는 것을 특징으로 하는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템."}
{"patent_id": "10-2022-0082588", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 블라인드 민원 게시판 관리부는,상기 분양현장 영업직원 회원으로부터 부동산 피해 사례 별로 카테고리화 된 민원 게시글을 익명으로 등록 받아분양현장 영업직원 블라인드 민원 게시판을 관리하는 분양현장 영업직원 블라인드 민원 게시판 관리부; 및상기 수분양자 회원으로부터 부동산 피해 사례 별로 카테고리화 된 민원 게시글을 익명으로 등록 받아 수분양자블라인드 민원 게시판을 관리하는 수분양자 블라인드 민원 게시판 관리부를 포함하는 것을 특징으로 하는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템."}
{"patent_id": "10-2022-0082588", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 분양현장 영업직원 블라인드 민원 게시판 관리부는,급여 미지급, 제시된 급여와 수령 급여 상이, 실제 분양 일정 상이, 및 상사의 갑질, 폭언 및 욕설에 대한 카테공개특허 10-2024-0008427-3-고리로 분류하여 민원 게시글을 관리하고,상기 수분양자 블라인드 민원 게시판 관리부는, 분양현장 영업직원의 무례한 태도, 계약해지 불가, 개인정보 유출, 및 분양현장 영업직원 사칭에 대한 카테고리로 분류하여 민원 게시글을 관리하는 것을 특징으로 하는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템."}
{"patent_id": "10-2022-0082588", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3 항에 있어서,상기 블라인드 민원 게시판 관리부는,상기 분양현장 영업직원 블라인드 민원 게시판 관리부의 민원 게시글 및 상기 수분양자 블라인드 민원 게시판관리부의 민원 게시글에 대한 조회수 및 댓글수를 수치화하여 민원 게시글에 대한 랭킹을 산정하고, 일정 기간이내에 미리 설정된 랭킹 이내의 게시글에 대하여 미리 협약된 언론사 및 방송사 중 적어도 하나로 제보 처리하는 민원 게시글 제보 처리부를 더 포함하는 것을 특징으로 하는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템."}
{"patent_id": "10-2022-0082588", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,상기 블라인드 민원 게시판 관리부는,민원 게시글에 대한 찬반 투표 기능을 부여하여 각 회원으로부터 찬반 투표를 실시하고, 투표 참여 인원과 투표결과에 따라 상기 민원 게시글 제보 처리부에 해당 민원 게시글을 등록하여 제보 처리되도록 하는 민원 게시글찬반 투표 처리부를 더 포함하는 것을 특징으로 하는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티서비스 제공 시스템."}
{"patent_id": "10-2022-0082588", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,미리 협약된 건설사로부터 채용정보를 수신하여 제공하는 채용정보 제공부;미리 협약된 건설사로부터 모델하우스 현장사진정보 및 건설현장 진행상황정보를 수신하여 제공하는 자유 게시판 관리부; 및상기 회원 가입 처리부를 통해 회원 가입된 회원을 대상으로 해당 홈페이지의 출석을 관리하고, 미리 설정된 출석횟수 달성 시 해당 홈페이지의 회원활동을 위한 쿠폰을 지급하는 출석 관리부를 포함하는 것을 특징으로 하는부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템."}
{"patent_id": "10-2022-0082588", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템에 관한 것으로, 해결하 고자 하는 과제는 개인정보에 대한 익명성을 보장하는 블라인드 게시판을 제공하여 신분노출 없이 부동산 업무 및 분양에 관한 고민과 피해사례를 자유롭게 공유하고, 그와 관련된 다양한 주제로 소통할 수 있는 공간을 제공 (뒷면에 계속)"}
{"patent_id": "10-2022-0082588", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템에 관한 것이다."}
{"patent_id": "10-2022-0082588", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 부동산 분양 시장에 있어서, 해당 분양현장 영업직원의 경우 열악하고 부당한 현장으로부터 피해가 클 수 밖에 없지만 이에 대한 고민이나 피해사례를 알릴만한 시스템적인 환경이 부재하며, 수분양자의 경우 부족한 부동산 지식과 섣부른 판단으로 정신적, 금전적 피해를 받는 자가 늘고 있으나 이 또한 이에 대한 고민이나 피해 사례를 공유할 만한 시스템적인 환경에 대한 부재가 문제로 대두되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2010-0101732호(공개일자: 2010년09월20일) (특허문헌 0002) 등록특허공보 제10-0464143호(등록일자: 2004년12월21일)"}
{"patent_id": "10-2022-0082588", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는, 개인정보에 대한 익명성을 보장하는 블라인드 게시판을 제공하여 신분노출 없이 부동산 업 무 및 분양에 관한 고민과 피해사례를 자유롭게 공유하고, 그와 관련된 다양한 주제로 소통할 수 있는 공간을 제공함으로써, 노동자로서 권리를 내세울 수 있는 분양현장 영업직원들과 불완전한 영업활동에 의한 충동적 구 매로 피해를 받은 수분양자들 각각의 정보공유와 상호보완을 통해 피해를 최소화시킬 수 있으며, 정확하지 않은 채용정보로 인한 피해를 감소시키기 위해 공정성 있는 심의를 통해 채용정보를 등록하는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템을 제공한다."}
{"patent_id": "10-2022-0082588", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템은, 회 원가입절차를 진행하되, 분양현장 영업직원 및 수분양자에 대한 증빙 절차를 각각 진행하고, 증빙 완료된 대상 자에 대하여 게시판의 글쓰기가 가능한 정회원으로 가입 처리하는 회원 가입 처리부; 및 미리 정의된 부동산 피 해 사례 별로 카테고리화 된 민원 게시글을 상기 정회원으로부터 익명으로 등록 받아 공유하는 블라인드 민원 게시판 관리부를 포함한다. 또한, 상기 회원 가입 처리부는, 분양현장 영업직원에 대한 회원 가입 절차를 진행하되, 분양현장 영업직원을 증빙하기 위한 명함을 촬영한 사진파일을 등록 받고, 등록된 사진파일에 대한 이미지를 저장한 후, 해당 이미지 내 텍스트 추출 및 인식하고, 인식된 텍스트에 대한 필수 항목이 포함된 경우 해당 텍스트를 저장하여 증빙 절 차를 완료하고, 저장된 텍스트의 필수 항목을 제외한 기본 항목에 대한 정보를 추가 등록 받아 회원 가입 절차 를 진행하는 분양현장 영업직원 회원 가입 처리부; 수분양자에 대한 회원 가입 절차를 진행하되, 분양사실을 증 빙하기 위해 청약홈페이지에서 캡처한 당첨사실조회화면 캡처파일을 등록 받고, 등록된 캡처파일에 대한 이미지 를 저장한 후, 해당 이미지 내 텍스트 추출 및 인식하고, 인식된 텍스트에 대한 필수 항목이 포함된 경우 해당 텍스트를 저장하여 증빙 절차를 완료하고, 수분양자의 기본 항목에 대한 정보를 추가 등록 받아 회원 가입 절차 를 진행하는 수분양자 회원 가입 처리부; 및 상기 민원 게시글의 열람 및 댓글쓰기 권한을 부여 받는 일반 회원 에 대한 회원 가입 절차를 진행하는 일반 회원 가입 처리부를 포함할 수 있다. 또한, 상기 블라인드 민원 게시판 관리부는, 상기 분양현장 영업직원 회원으로부터 부동산 피해 사례 별로 카테 고리화 된 민원 게시글을 익명으로 등록 받아 분양현장 영업직원 블라인드 민원 게시판을 관리하는 분양현장 영 업직원 블라인드 민원 게시판 관리부; 및 상기 수분양자 회원으로부터 부동산 피해 사례 별로 카테고리화 된 민 원 게시글을 익명으로 등록 받아 수분양자 블라인드 민원 게시판을 관리하는 수분양자 블라인드 민원 게시판 관 리부를 포함할 수 있다. 또한, 상기 분양현장 영업직원 블라인드 민원 게시판 관리부는, 급여 미지급, 제시된 급여와 수령 급여 상이, 실제 분양 일정 상이, 및 상사의 갑질, 폭언 및 욕설에 대한 카테고리로 분류하여 민원 게시글을 관리하고, 상 기 수분양자 블라인드 민원 게시판 관리부는, 분양현장 영업직원의 무례한 태도, 계약해지 불가, 개인정보 유출, 및 분양현장 영업직원 사칭에 대한 카테고리로 분류하여 민원 게시글을 관리할 수 있다. 또한, 상기 블라인드 민원 게시판 관리부는, 상기 분양현장 영업직원 블라인드 민원 게시판 관리부의 민원 게시 글 및 상기 수분양자 블라인드 민원 게시판 관리부의 민원 게시글에 대한 조회수 및 댓글수를 수치화하여 민원 게시글에 대한 랭킹을 산정하고, 일정 기간 이내에 미리 설정된 랭킹 이내의 게시글에 대하여 미리 협약된 언론사 및 방송사 중 적어도 하나로 제보 처리하는 민원 게시글 제보 처리부를 더 포함할 수 있다. 또한, 상기 블라인드 민원 게시판 관리부는, 민원 게시글에 대한 찬반 투표 기능을 부여하여 각 회원으로부터 찬반 투표를 실시하고, 투표 참여 인원과 투표 결과에 따라 상기 민원 게시글 제보 처리부에 해당 민원 게시글 을 등록하여 제보 처리되도록 하는 민원 게시글 찬반 투표 처리부를 더 포함할 수 있다. 또한, 미리 협약된 건설사로부터 채용정보를 수신하여 제공하는 채용정보 제공부; 미리 협약된 건설사로부터 모 델하우스 현장사진정보 및 건설현장 진행상황정보를 수신하여 제공하는 자유 게시판 관리부; 및 상기 회원 가입 처리부를 통해 회원 가입된 회원을 대상으로 해당 홈페이지의 출석을 관리하고, 미리 설정된 출석횟수 달성 시 해당 홈페이지의 회원활동을 위한 쿠폰을 지급하는 출석 관리부를 포함할 수 있다. 또한, 상기 분양현장 영업직원 블라인드 민원 게시판 및 상기 수분양자 블라인드 민원 게시판 각각에서 동일 카 테고리를 가지며 미리 설정된 기간 이내에 등록된 조건을 갖는 민원 게시글을 1차 분류하고, 1차 분류된 민원 게시글의 내용에 대해 미리 학습된 인공지능 알고리즘에 기반한 자연어 처리 분석을 수행하여, 해당 민원 게시 글에 대하여 미리 정의된 피해사례 이슈 카테고리로 2차 분류하고, 2차 분류된 민원 게시글에 대한 회원 간 채 팅 서비스 및 공동 법률 상담 중개 서비스 중 적어도 하나의 솔루션을 제공하는 민원 게시글 솔루션 제공부를 더 포함할 수 있다. 또한, 상기 분양현장 영업직원 블라인드 민원 게시판 및 상기 수분양자 블라인드 민원 게시판 중 어느 하나를 통해 새로운 게시글이 등록되면, 해당 게시글에 대하여 부여된 URL을 기반으로 위젯을 생성하고, 상기 위젯의 선택 시 해당 URL을 통해 접속하여 해당 게시글에 대해 추가된 시리즈 게시글의 작성 환경을 제공하되, 각 위젯 의 종료 선택 시 종료 선택된 위젯을 통해 등록된 게시글에 대한 핵심 키워드를 추출하여 해시 태그를 생성하고, 생성된 해시 태그를 상기 분양현장 영업직원 블라인드 민원 게시판 및 상기 수분양자 블라인드 민원 게시판 중 해당 게시판으로 제공하는 위젯 시리즈 게시글 관리부를 더 포함할 수 있다."}
{"patent_id": "10-2022-0082588", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 개인정보에 대한 익명성을 보장하는 블라인드 게시판을 제공하여 신분노출 없이 부동산 업무 및 분양에 관한 고민과 피해사례를 자유롭게 공유하고, 그와 관련된 다양한 주제로 소통할 수 있는 공간을 제공 함으로써, 노동자로서 권리를 내세울 수 있는 분양현장 영업직원들과 불완전한 영업활동에 의한 충동적 구매로 피해를 받은 수분양자들 각각의 정보공유와 상호보완을 통해 피해를 최소화시킬 수 있으며, 정확하지 않은 채용 정보로 인한 피해를 감소시키기 위해 공정성 있는 심의를 통해 채용정보를 등록하는 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템을 제공할 수 있다."}
{"patent_id": "10-2022-0082588", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나 이상의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설 명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 본 발명의 실시예에 따른 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템 의 구현 형태와 동작 방식을 나타낸 개요도이다. 도 1을 참조하면, 본 발명의 실시예에 따른 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템은 분양현장 영업직원 회원 통신단말(10a), 수분양자 회원 통신단말(10b), 일반 회원 통신단 말(10c)에 각각 설치되는 어플리케이션 또는/및 웹 사이트와, 통합 관리 서버의 형태로 구현될 수 있으며, 분양현장 영업직원과 수분양자들에 대한 블라인드 게시판을 제공하여 부동산 업무 및 분양에 관한 고민과 피해 사례를 공유하고, 그와 관련된 다양한 주제로 소통할 수 있는 공간을 제공하기 위한 커뮤니티 서비스를 제공할 수 있다. 상기 분양현장 영업직원 회원 통신단말(10a), 수분양자 회원 통신단말(10b), 일반 회원 통신단말(10c)은, 부동 산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스를 제공하기 위한 전용 어플리케이션이 설치 또는 탑재되거나 웹 브라우저의 웹 사이트에 접속할 수 있으며, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단 말, 스마트폰(smartphone), 스마트 패드(smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드 (Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 여기서, 웹 브라우저는 웹(WWW: world wide web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(hyper text mark-up language)로 서술된 하이퍼텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프 (Netscape), 익스플로러(Explorer), 크롬(chrome) 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그 램(application)을 의미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(app)을 포함할 수 있다. 상기 통합 관리 서버는, 분양현장 영업직원 회원 통신단말(10a), 수분양자 회원 통신단말(10b), 일반 회원 통신단말(10c) 각각과 인터넷 통신을 통해 연결되어 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스를 제공하기 위한 구성으로, 하드웨어적으로 통상적인 웹 서버와 동일한 구성을 가지며, 소프트웨어적으 로는 C, C++, Java, Visual Basic, Visual C 등과 같은 다양한 형태의 언어를 통해 구현되어 여러 가지 기능을 하는 프로그램 모듈을 포함할 수 있다. 또한, 일반적인 서버용 하드웨어에 도스(dos), 윈도우(window), 리눅스 (linux), 유닉스(unix), 매킨토시(macintosh), 안드로이드(Android), 아이오에서(iOS) 등의 운영 체제에 따라 다양하게 제공되고 있는 웹 서버 프로그램을 이용하여 구현될 수 있다. 한편, 분양현장 영업직원 회원 통신단말(10a), 수분양자 회원 통신단말(10b), 일반 회원 통신단말(10c) 각각과 통합 관리 서버 간을 연결하는 인터넷 네트워크의 무선 통신망의 일 예로는, 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced), 5G 등)에 따라 구축된 이동 통신망을 포함할 수 있으나, 특별히 한정하는 것은 아니다. 또한, 유선 통신망의 일 예로는, LAN(Local Area Network), WAN(Wide Area Network)등의 폐쇄형 네트워크일 수 있으며, 인터넷과 같은 개방형 네트워크인 것이 바람직하다. 인터넷은 TCP/IP 프로토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(HyperText Transfer Protocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(Network Information Service)를 제공하는 전세계적인 개방형 컴퓨터 네트워크 구조를 의미한다. 한편, 본 실시예에 따른 수분양자는 아파트 등 부동산의 분양을 받은 사람뿐만 아니라, 부동산의 분양을 받을 예정되거나 예비 분양자를 포함하는 것이며, 더 나아가 부동산을 접하는 모든 고객을 지칭하는 것이 바람직하다. 도 2는 본 발명의 실시예에 따른 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템 의 전체 구성을 나타낸 블록도이고, 도 3은 본 발명의 실시예에 따른 회원 가입 처리부의 구성을 나타낸 블록도 이고, 도 4는 본 발명의 실시예에 따른 분양현장 영업직원 회원 가입 처리부를 통한 분양현장 영업직원의 회원 가입 방식을 설명하기 위해 나타낸 도면이고, 도 5는 본 발명의 실시예에 따른 수분양자 회원 가입 처리부를 통 한 수분양자의 회원 가입 방식을 설명하기 위해 나타낸 도면이고, 도 6은 본 발명의 실시예에 따른 블라인드 민 원 게시판 관리부의 구성을 나타낸 블록도이고, 도 7 내지 도 9는 본 발명의 실시예에 따른 수분양자 블라인드 민원 게시판의 일례를 나타낸 도면이며, 도 10은 본 발명의 실시예에 따른 민원 게시글 제보 처리부의 동작 순 서를 나타낸 흐름도이다. 도 2를 참조하면, 본 발명의 실시예에 따른 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템은 회원 가입 처리부, 블라인드 민원 게시판 관리부, 채용정보 제공부, 자유 게시판 관리부, 출석 관리부, 민원 게시글 솔루션 제공부 및 위젯 시리즈 게시글 관리부 중 적어도 하나를 포함할 수 있다. 상기 회원 가입 처리부는, 회원가입절차를 진행하되, 분양현장 영업직원 및 수분양자에 대한 증빙 절차를 각각 진행하고, 증빙 완료된 대상자에 대하여 게시판의 글쓰기가 가능한 정회원으로 가입 처리할 수 있으며, 본 시스템을 통해 구현되는 홈페이지의 로그인 및 로그아웃 관리도 함께 실시할 수 있다. 이를 위해 회원 가입 처리부는 도 3에 도시된 바와 같이, 분양현장 영업직원 회원 가입 처리부, 수분 양자 회원 가입 처리부 및 일반 회원 가입 처리부 중 적어도 하나를 포함할 수 있다. 상기 분양현장 영업직원 회원 가입 처리부는, 분양현장 영업직원에 대한 회원 가입 절차를 진행하되, 분양 현장 영업직원을 증빙하기 위한 명함을 촬영한 사진파일을 등록 받고, 등록된 사진파일에 대한 이미지를 저장한 후, 해당 이미지 내 텍스트 추출 및 인식하고, 인식된 텍스트에 대한 필수 항목이 포함된 경우 해당 텍스트를 저장하여 증빙 절차를 완료하고, 저장된 텍스트의 필수 항목을 제외한 기본 항목에 대한 정보를 추가 등록 받아 회원 가입 절차를 진행할 수 있다. 예를 들어, 도 4에 도시된 바와 같이 분양현장 영업직원에 대한 회원 가입 시 해당 영업직원의 명함을 분양현장 영업직원 통신단말(10a)의 카메라를 통해 촬영하면, 분양현장 영업직원 회원 가입 처리부가 촬영영상(명함 사진파일)을 등록하고, OCR(optical character reader)을 이용하여 명함사진 내 텍스트를 추출 및 인식하며, 인 식된 텍스트에 대한 필수 항목을 선별해 회원정보의 각 항목에 대한 입력 처리를 수행할 수 있다. 회원 가입을 위한 필수 항목에는 이름, 회사명, 소속/직급, 연락처, 회사주소 등을 포함할 수 있으며, 명함사진으로부터 얻 을 수 있는 정보에 해당된다. 또한, 기본항목을 포함하는 회원정보는 선택항목으로서 분양현장 영업직원으로부 터 추가로 등록 받아 회원 가입 절차를 완료할 수 있다. 이때, 회원정보뿐만 아니라, 해당 회원이 분양현장 영 업직원임을 증빙하기 위한 명함사진파일 또한 함께 저장되어 관리할 수 있다. 상기 수분양자 회원 가입 처리부는, 수분양자에 대한 회원 가입 절차를 진행하되, 분양사실을 증빙하기 위 해 청약홈페이지에서 캡처한 당첨사실조회화면 캡처파일을 등록 받고, 등록된 캡처파일에 대한 이미지를 저장한 후, 해당 이미지 내 텍스트 추출 및 인식하고, 인식된 텍스트에 대한 필수 항목이 포함된 경우 해당 텍스트를 저장하여 증빙 절차를 완료하고, 수분양자의 기본 항목에 대한 정보를 추가 등록 받아 회원 가입 절차를 진행할 수 있다. 예를 들어, 도 5에 도시된 바와 같이 수분양자에 대한 회원 가입 시 해당 수분양자 통신단말(10b)을 통해 청약 홈페이지 등 분양사실을 조회 및 확인할 수 있는 웹 페이지로 접속하고, 해당 수분양자에 대한 당첨사실조회내역을 화면 캡처를 통해 별도의 캡처파일을 생성하고, 생성된 캡처파일을 등록할 수 있다. 이때, OCR(optical character reader)을 이용하여 캡처파일 내 텍스트를 추출 및 인식하며, 인식된 텍스트에 대한 필수 항목을 선 별해 회원정보의 각 항목에 대한 입력 처리를 수행할 수 있다. 회원 가입을 위한 필수 항목에는 수분양자 명, 생년월일, 주택 명, 주택 형, 당첨구분, 동/호수, 연락처 등을 포함할 수 있으며, 캡처파일로부터 얻을 수 있는 정보에 해당된다. 또한, 기본항목을 포함하는 회원정보는 선택항목으로서 수분양자로부터 추가로 등록 받아 회 원 가입 절차를 완료할 수 있다. 이때, 회원정보뿐만 아니라, 해당 회원이 분양사실을 증빙하기 위한 캡처파일 또한 함께 저장되어 관리할 수 있다. 상기 일반 회원 가입 처리부는, 민원 게시글의 열람 및 댓글쓰기 권한을 부여 받는 일반 회원에 대한 회원 가입 절차를 진행할 수 있다. 본 실시예에서 일반 회원은 분양현장 영업직원이나 수분양자 등과 달리 본 실시예 에서 이슈가 되는 피해사례에 대한 글을 직접적으로 작성하는 대상자가 아니라, 분양현장 영업직원이나 수분양 자들의 다양한 피해사례에 대한 글을 열람하고 공감하며 그에 대한 자유로운 소통을 할 수 있는 회원을 의미하 며, 해당 회원이 본 실시예에서 정의한 소정의 자격 요건(분양현장 영업직원, 수분양자)이 충족되는 경우 게시 판에 새로운 글을 작성할 수 있는 회원으로 승격될 수도 있다. 물론, 일반 회원은 후술하는 자유 게시판을 통해 부동산과 관련하여 다양한 주제로 자유로운 소통이 가능하다. 한편, 본 실시예에서 게시판에 새로운 글을 작성할 수 있는 대상자를 분양현장 영업직원과 수분양자로 한정하였 으나, 보다 다양한 부동산 관련 피해사례에 대한 스토리를 작성할 수 있는 일정 자격 요건을 추가적으로 설정하 여 부동산 관련 피해사례를 알릴 수 있는 대상자 범위를 확대할 수 있음을 물론이다. 상기 블라인드 민원 게시판 관리부는, 미리 정의된 부동산 피해 사례 별로 카테고리화 된 민원 게시글을 상기 정회원으로부터 익명으로 등록 받아 공유할 수 있다. 이를 위해 블라인드 민원 게시판 관리부는 도 6에 도시된 바와 같이, 분양현장 영업직원 블라인드 민원 게 시판 관리부, 수분양자 블라인드 민원 게시판 관리부, 민원 게시글 제보 처리부 및 민원 게시글 찬반 투표 처리부 중 적어도 하나를 포함할 수 있다. 상기 분양현장 영업직원 블라인드 민원 게시판 관리부는, 분양현장 영업직원 회원으로부터 부동산 피해 사 례 별로 카테고리화 된 민원 게시글을 익명으로 등록 받아 분양현장 영업직원 블라인드 민원 게시판을 관리할 수 있다. 좀 더 구체적으로, 분양현장 영업직원 블라인드 민원 게시판 관리부는, 급여 미지급, 제시된 급여와 수령 급여 상이, 실제 분양 일정 상이, 및 상사의 갑질, 폭언 및 욕설에 대한 카테고리로 분류하여 민원 게시글을 관 리할 수 있다. 예를 들어, '급여 미지급' 카테고리에는, 보장되지 않는 근로상태로 급여 연체 및 미지급 등에 관한 주제의 글 을 작성할 수 있고, '제시된 급여와 수령 급여 상이' 카테고리에는 수령 급여 상이로 금전적 피해 등에 관한 주 제의 글을 작성할 수 있고, '실제 분양 일정 상이' 카테고리에는 예정된 분양 날짜와 달라 계획했던 업무가 불 가한 이야기 등에 관한 주제의 글을 작성할 수 있고, '상사의 갑질, 폭언 및 욕설' 카테고리에는 상사의 도를 넘은 갑질로 인한 정신적 피해 등에 관한 주제의 글을 작성할 수 있다. 상기 수분양자 블라인드 민원 게시판 관리부는, 수분양자 회원으로부터 부동산 피해 사례 별로 카테고리화 된 민원 게시글을 익명으로 등록 받아 수분양자 블라인드 민원 게시판을 관리할 수 있다. 좀 더 구체적으로, 수분양자 블라인드 민원 게시판 관리부는, 분양현장 영업직원의 무례한 태도, 계약해지 불가, 개인정보 유출, 및 분양현장 영업직원 사칭에 대한 카테고리로 분류하여 민원 게시글을 관리할 수 있다. 예를 들어, '분양현장 영업직원의 무례한 태도' 카테고리에는 계약 강요, 계약 유무에 따라 달라지는 태도 등에 관한 주제의 글을 작성할 수 있고, '계약해지 불가' 카테고리에는 과대광고, 거짓 계약 유도로 인한 계약해지 불가 등에 관한 주제의 글을 작성할 수 있고, '개인정보 유출' 카테고리에는 개인정보 유출로 상담 이후 타 현 장의 계속적인 TM 발생 등에 관한 주제의 글을 작성할 수 있고, '분양현장 영업직원 사칭' 카테고리에는 홈쇼핑 직원으로 사칭하여 이벤트 당첨 문자 발송 등에 관한 주제의 글을 작성할 수 있다. 상기 민원 게시글 제보 처리부는, 분양현장 영업직원 블라인드 민원 게시판 관리부의 민원 게시글 및 수분양자 블라인드 민원 게시판 관리부의 민원 게시글에 대한 조회수 및 댓글수를 수치화하여 민원 게시글 에 대한 랭킹을 산정하고, 일정 기간 이내에 미리 설정된 랭킹 이내의 게시글에 대하여 미리 협약된 언론사 및 방송사 중 적어도 하나로 제보 처리할 수 있다.좀 더 구체적으로, 도 10에 도시된 바와 같이 분양현장 영업직원 블라인드 민원 게시판에 등록된 게시글과 수분 양자 블라인드 민원 게시판의 게시글을 각각 탐색(S1, S2)하고, 탐색된 각각의 게시글에 대한 조회수와 댓글수 를 합산하여 수치화할 수 있다(S2). 이때, 조회수와 댓글수에 대한 가중치를 카테고리 별로 달리 설정할 수 있 고, 설정된 각각의 가중치를 조회수와 댓글수에 각각 곱한 후 합산하여 총점을 게시글 별로 산출할 수 있다. 이 후, 모든 게시글에 대한 총점이 산출되면 랭킹 순위를 산정하여 각 카테고리 별로 1위 또는 1위 내지 3위의 게 시글을 선별하고, 선별된 게시글이 최근 한달 이내 또는 일주일 이내에 등록된 글인지를 판단(S4)한 후, 해당 기간 조건이 만족되면, 모든 조건(일정 기간 이내 & 랭킹 범위 이내)을 충족되는 게시글을 미리 협약되어 있는 언론사 및 방송사 서버(30, 40)에 등록하여 회원들에 대한 부동산 관련 피해사례를 제보할 수 있다. 상기 민원 게시글 찬반 투표 처리부는, 민원 게시글에 대한 찬반 투표 기능을 부여하여 각 회원으로부터 찬반 투표를 실시하고, 투표 참여 인원과 투표 결과에 따라 민원 게시글 제보 처리부에 해당 민원 게시글 을 등록하여 제보 처리되도록 할 수 있도록 한다. 좀 더 구체적으로, 회원이 게시판에 글을 등록할 때 찬반 투표 기능을 선택하는 경우, 일정 기간 이내에 이를 열람한 다른 회원들로부터 찬반 투표 값을 입력 받고, 이를 취합하여 하나의 게시글에 대해 투표에 참여한 총 인원이 미리 설정된 투표 참여 기준 인원을 초과하면서, 찬성표와 반대표 간의 차이가 미리 설정된 비율 이상의 차이를 보이게 되면 해당 게시글을 민원 게시글 제보 처리부로 전달하여 해당 게시글(찬반 투표 결과로 선 정된 게시글)을 미리 협약되어 있는 언론사 및 방송사 서버(30, 40)에 등록하여 게시글에 대한 부동산 관련 피 해사례를 제보할 수 있도록 한다. 상기 채용정보 제공부는, 미리 협약된 건설사로부터 채용정보를 각각 수신하고, 수신된 채용정보를 모든 회원들을 대상으로 공유할 수 있다. 이때, 채용정보에는 분양건설에 따른 일자리 정보를 포함할 수 있으며, 미 리 알림을 받도록 설정한 경우 신규 채용정보가 등록되면 해당 회원에게 알림 메시지를 전송할 수 있다. 또한, 채용정보에 포함된 각 항목 별 조건 값을 미리 설정해 놓으면, 해당 항목에 대한 조건 값이 미리 설정해 놓은 조건 값과 일치할 때 해당 회원에게 알림 메시지를 전송할 수도 있다. 상기 자유 게시판 관리부는, 미리 협약된 건설사로부터 모델하우스 현장사진정보 및 건설현장 진행상황정 보를 수신하여 제공할 수 있다. 모델하우스 현장사진정보 및 건설현장 진행상황정보는 각각의 카테고리로 분류 되어 등록 일자 별로 순차적으로 관리될 수 있다. 상기 출석 관리부는, 회원 가입 처리부를 통해 회원 가입된 회원을 대상으로 해당 홈페이지의 출석을 관리하고, 미리 설정된 출석횟수 달성 시 해당 홈페이지의 회원활동을 위한 쿠폰을 지급할 수 있다. 예를 들어, 본 시스템에 의해 구현된 홈페이지에 월 기준으로 20회 이상 출석하거나, 댓글과 게시글 조회 수가 일 평균 20회를 초과한 경우, 홈페이지에서 유료로 이용할 수 있는 메뉴의 결제가 가능한 전자쿠폰을 지급 할 수 있다. 또한, 전자쿠폰은 별도의 결제수단(신용카드, 계좌이체, 암호화폐 등)을 이용하여 충전 가능하며, 홈페이지에서 권한이 없는 글을 열람하기 위한 어드밴티지 등을 추가적으로 제공할 수 있다. 상기 민원 게시글 솔루션 제공부는, 분양현장 영업직원 블라인드 민원 게시판 및 수분양자 블라인드 민원 게시판 각각에서 동일 카테고리를 가지며 미리 설정된 기간 이내에 등록된 조건을 갖는 민원 게시글을 1차 분류 할 수 있다. 예를 들어, 분양현장 영업직원 블라인드 민원 게시판에서 현재를 기준으로 최근 1주일 이내에 등록되었으면서 '급여 미지급'에 관한 카테고리의 게시글을 탐색하여 1차 분류할 수 있으며, 또한 수분양자 게시판에서 현재를 기준으로 최근 5일 이내에 등록되었으면서 '개인정보 유출'에 관한 카테고리의 게시글을 탐색하여 1차 분류할 수 있다. 또한, 민원 게시글 솔루션 제공부는, 1차 분류된 민원 게시글의 내용에 대해 미리 학습된 인공지능 알고리 즘에 기반한 자연어 처리 분석을 수행하여, 해당 민원 게시글에 대하여 미리 정의된 피해사례 이슈 카테고리로 2차 분류할 수 있다. 예를 들어, 1차 분류된 '영업직원의 무례한 태도'의 카테고리에 관한 게시글의 내용 중 '고발할 것이라', '담당 자를 바꿔준다고', '믿고 주문했지만', '고함을 지르고', '불만이 많은 것으로' 등의 자연어를 인식 및 그 의미 를 해석 및 분석하고, 이들의 사용 빈도수를 파악하여 일정 빈도수 이상에 도달한 자연어를 갖는 게시글에 대해 미리 정의된 다양한 피해사례 이슈 카테고리 중 적어도 하나의 이슈 카테고리로 정의함으로써 해당 게시글에 대 한 2차 분류를 실시할 수 있다.또한, 민원 게시글 솔루션 제공부는, 특정 피해사례 이슈 카테고리로 2차 분류된 민원 게시글에 대하여 회 원 간 채팅 서비스 및 공동 법률 상담 중개 서비스 중 적어도 하나의 솔루션을 제공할 수 있다. 예를 들어, '영업직원의 무례한 태도'의 피해사례 이슈 카테고리로 정의된 다수의 회원이 존재하는 경우, 해당 회원 간 채팅 채널을 개설하여 해당 회원 간의 고민에 대한 이야기를 나루 수 있는 공간을 마련하며, 이와 동시 에 해당 이슈 카테고리와 매칭된 법률 상담사를 해당 회원들에게 소개하여 법적 문제를 해결할 수 있도록 안내 할 수 있다. 상기 위젯 시리즈 게시글 관리부는, 분양현장 영업직원 블라인드 민원 게시판 및 수분양자 블라인드 민원 게시판 중 어느 하나를 통해 새로운 게시글이 등록되면, 해당 게시글에 대하여 부여된 URL을 기반으로 위젯을 생성할 수 있다. 예를 들어, '영업직원의 무례한 태도'와 관련된 게시글을 등록하면, 해당 게시글을 등록한 회원의 통신단말에 위젯을 생성하여, 해당 위젯을 통해 자신이 등록한 게시글에 바로 접속할 수 있도록 한다. 또한, 위젯 시리즈 게시글 관리부는, 상기와 같이 생성된 위젯을 선택하면, 해당 위젯에 할당된 URL을 통 해 해당 웹 페이지로 이동하여 해당 게시글에 대해 추가된 시리즈 게시글의 작성 환경을 제공할 수 있으며, 각 위젯의 종료 선택 시 종료 선택된 위젯을 통해 등록된 게시글에 대한 핵심 키워드를 추출하여 해시 태그를 생성 할 수 있다. 예를 들어, '영업직원의 무례한 태도'에 대한 게시글 위젯을 선택하면, 회원 자신이 작성한 웹 페이지로 바로 이동하면서, 해당 웹 페이지에서 해당 게시글과 관련하여 후속의 이야기 등을 시리즈로 작성할 수 있는 게시글 작성 환경을 제공하여 계속해서 해당 회원의 특정 피해사례에 관한 이야기를 업데이트 할 수 있도록 한다. 또한, 위젯 종료를 선택하면 해당 게시글의 시리즈 작성 기능은 종료되며, 해당 게시글의 제목이나 빈도수가 가 장 높은 단어 등을 기반으로 해당 게시글에 대한 핵심 키워드를 적어도 하나 이상을 추출하여 해시 태그를 생성 하고, 해당 시리즈 게시글에 등록시켜 다른 회원이 해당 핵심 키워드 기반의 해시태그를 통해 분양현장 영업직 원 블라인드 민원 게시판 및 수분양자 블라인드 민원 게시판에 대한 게시글 검색이 가능하도록 한다. 본 실시예에 따르면, 분양현장 영업직원과 수분양자들에 대한 블라인드 게시판을 제공하여 부동산 업무 및 분양 등 다양한 주제에 관한 고민과 피해사례를 공유하고, 그와 관련된 다양한 주제로 소통할 수 있는 공간을 제공함 으로써, 노동자로서 권리를 내세울 수 있는 분양현장 영업직원들과 불완전한 영업활동에 의한 충동적 구매로 피 해를 받은 수분양자들 각각의 정보공유와 상호보완을 통해 피해를 최소화할 수 있다. 이상에서 설명한 것은 본 발명에 의한 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템을 실시하기 위한 하나의 실시예에 불과한 것으로서, 본 발명은 상기 실시예에 한정되지 않고, 이하의 특 허청구범위에서 청구하는 바와 같이 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 분야에서 통상의 지식 을 가진 자라면 누구든지 다양한 변경 실시가 가능한 범위까지 본 발명의 기술적 정신이 있다고 할 것이다."}
{"patent_id": "10-2022-0082588", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템 의 구현 형태와 동작 방식을 나타낸 개요도이다. 도 2는 본 발명의 실시예에 따른 부동산 관련 피해자의 민원 게시 및 소통을 위한 커뮤니티 서비스 제공 시스템 의 전체 구성을 나타낸 블록도이다. 도 3은 본 발명의 실시예에 따른 회원 가입 처리부의 구성을 나타낸 블록도이다. 도 4는 본 발명의 실시예에 따른 분양현장 영업직원 회원 가입 처리부를 통한 분양현장 영업직원의 회원 가입 방식을 설명하기 위해 나타낸 도면이다. 도 5는 본 발명의 실시예에 따른 수분양자 회원 가입 처리부를 통한 수분양자의 회원 가입 방식을 설명하기 위 해 나타낸 도면이다. 도 6은 본 발명의 실시예에 따른 블라인드 민원 게시판 관리부의 구성을 나타낸 블록도이다. 도 7 내지 도 9는 본 발명의 실시예에 따른 수분양자 블라인드 민원 게시판의 일례를 나타낸 도면이다. 도 10은 본 발명의 실시예에 따른 민원 게시글 제보 처리부의 동작 순서를 나타낸 흐름도이다."}
