{"patent_id": "10-2022-0180426", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0098563", "출원번호": "10-2022-0180426", "발명의 명칭": "실시간 데이터를 이용한 지도 데이터 관리장치 및 그 방법", "출원인": "현대오토에버 주식회사", "발명자": "정성문"}}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "도로 및 도로 주변 시설물에 대한 데이터를 실시간으로 수집하는 통신부;수집된 데이터 및 지도 데이터가 저장되는 메모리; 및상기 통신부를 통해 실시간으로 수집되는 데이터를 분석하여, 변경 정보를 기반으로 변경점을 추출하고, 상기변경점에 대한 변경점 데이터가 자동화 대상인지 판단하여 분류한 후, 상기 자동화 대상으로 분류된 상기 변경점 데이터를 기 저장된 상기 지도 데이터에 반영하여 상기 지도 데이터를 업데이트 하는 프로세서; 를 포함하는 실시간 데이터를 이용한 지도 데이터 관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는 상기 지도 데이터와 상기 데이터를 비교하여, 도로 및 도로 주변의 시설물에 대한 선형 및 속성 중 적어도 하나의 변화를 상기 변경점으로 추출하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 프로세서는 상기 데이터 중 도로 및 상기 도로 주변의 시설물에 대한 정보를 기반으로 추가, 삭제 및 변경에 대한 데이터를 상기 변경점으로 검출하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 프로세서는 상기 데이터 중 금융 정보를 기반으로, 상기 도로 주변 시설물에 대한 거래내역, 명칭,연락처, 위치, 대표명 및 업종 중 적어도 하나의 변경 정보를 상기 변경점으로 검출하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 프로세서는 상기 변경점 데이터 및 다른 데이터와의 연관성을 분석하여, 연관성을 낮은 상기 변경점 데이터를 상기 자동화 대상으로 분류하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 프로세서는 속성이 변경된 상기 변경점 데이터를 상기 자동화 대상으로 분류하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 프로세서는 상기 변경점 데이터를 상기 지도 데이터에 적용하여 업데이트 한 후, 업데이트된 지도 데이터에 대한 검증을 수행하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리장치.공개특허 10-2024-0098563-3-청구항 8 제7항에 있어서, 상기 프로세서는 상기 업데이트된 지도 데이터가 기 설정된 규칙 또는 속성에 위배되는지 여부를 판단하여 검증을 수행하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 프로세서는 추가 수집되는 데이터를 기반으로, 상기 업데이트된 지도 데이터에 대한 검증을 수행하는 것을특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 프로세서는 검증 시 오류가 발견되면, 상기 지도 데이터를 일정 시간 이전으로 롤백하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리장치."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "통신부가, 도로 및 도로 주변 시설물에 대한 데이터를 실시간으로 수집하는 단계;프로세서가, 상기 데이터를 분석하여, 변경 정보를 기반으로 변경점을 추출하는 단계;상기 변경점에 대한 변경점 데이터가 자동화 대상인지 판단하여 분류하는 단계; 및상기 자동화 대상으로 분류된 상기 변경점 데이터를 지도 데이터에 반영하여 상기 지도 데이터를 업데이트 하는단계; 를 포함하는 실시간 데이터를 이용한 지도 데이터 관리방법."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 변경점을 추출하는 단계에서, 상기 프로세서는, 상기 지도 데이터와 상기 데이터를 비교하고, 상기 도로 또는 상기 도로 주변의 시설물에 대한 선형 및 속성 중적어도 하나의 변화를 상기 변경점으로 추출하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리방법."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 변경점을 추출하는 단계에서 상기 프로세서는, 상기 데이터 중 상기 도로 및 상기 도로 주변의 시설물에 대한 정보를 기반으로 추가, 삭제, 변경에 대한 데이터를 상기 변경점으로 추출하고, 상기 데이터 중 금융 정보를 기반으로, 상기 도로 주변 시설물에 대한 거래내역, 명칭, 연락처, 위치, 대표명및 업종 중 적어도 하나의 변경을 상기 변경점으로 추출하는 것을 특징으로 하는 실시간 데이터를 이용한 지도데이터 관리방법."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 분류하는 단계에서 상기 프로세서는,상기 변경점 데이터 및 다른 데이터의 연관성을 분석하고, 연관성을 낮은 상기 변경점 데이터를 상기 자동화 대공개특허 10-2024-0098563-4-상으로 분류하는 것을 특징으로 하는 실시간 데이터를 이용한 지도 데이터 관리방법."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 분류하는 단계에서 상기 프로세서는, 속성 변경에 대한 상기 변경점 데이터를 상기 자동화 대상으로 분류하는 것을 특징으로 하는 실시간 데이터를이용한 지도 데이터 관리방법."}
{"patent_id": "10-2022-0180426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서, 상기 지도 데이터를 업데이트 하는 단계 후, 상기 프로세서가, 상기 업데이트된 지도 데이터가 기 설정된 규칙 또는 속성에 위배되는지 여부를 판단하여 검증하는 단계;추가 수집되는 데이터를 기반으로, 상기 업데이트된 지도 데이터의 일치 여부를 판단하여 검증하는 단계; 및기 설정된 규칙 또는 속성에 위배되거나, 추가 수집되는 데이터와 일치하지 않는 경우 일정 시간 이전으로 상기지도 데이터를 롤백하는 단계; 를 더 포함하는 실시간 데이터를 이용한 지도 데이터 관리방법."}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 실시간 데이터를 이용한 지도 데이터 관리장치 및 그 방법에 관한 것으로, 도로 및 도로 주변 시설물 에 대한 데이터를 실시간으로 수집하고 수집된 데이터를 분석하여 변경 정보를 기반으로 변경점을 추출하며, 상 기 변경점에 대한 변경점 데이터가 자동화 대상인지 판단하여 분류한 후, 상기 자동화 대상으로 분류된 상기 변 경점 데이터를 기 저장된 상기 지도 데이터에 반영하여 상기 지도 데이터를 업데이트 하여, 자동화 분류를 통해 다량의 데이터를 효과적으로 분류하고 업데이트 할 수 있고, 검증 과정을 통해, 정확한 정보를 제공할 수 있다."}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 실시간 데이터를 이용한 지도 데이터 관리장치 및 그 방법에 관한 것으로, 보다 상세하게는 실시간으 로 수집되는 데이터를 기반으로 지도 데이터를 갱신하는, 실시간 데이터를 이용한 지도 데이터 관리장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "내비게이션 시스템은 자동차에 설치되어 설정된 목적지까지의 경로를 안내한다. 내비게이션 시스템은 차량의 위 치를 지도 정보에 매칭하여 자동차의 현재 위치를 기준으로 주변의 일정 영역에 대한 지도를 표시하고, 목적지 까지의 경로를 지도 상에 표시한다. 내비게이션 시스템은 주행경로를 안내하면서 교차로를 포함하여 국도, 지방도, 고속도로, 인터체인지 등의 정보 와, 주행 도로에 대한 제한속도, 단속정보, 경고문 등의 도로 정보를 제공한다. 또한, 내비게이션 시스템은 일정 거리 내의 도로 주변에 위치한 시설물에 대한 부가 정보를 지도를 통해 제공할 수 있다. 예를 들어, 내비게이션 시스템은 주행 방향에 대하여 일정 거리 내에 위치하는 주유소, 휴게소, 졸음 쉼터, 화 장실 등에 대한 정보를 제공한다. 또한, 내비게이션 시스템은 도로 주변의 편의점, 약국, 음식점, 카페 등에 대 한 정보를 추가로 제공할 수 있다. 내비게이션 시스템은, 지도 정보를 기반으로 부가 정보를 출력하며, 지도 데이터를 업데이트 함으로써 신규 정 보를 지도에 반영할 수 있다. 그러나 내비게이션 시스템은 도로 주변의 편의점 또는 음식점 등의 시설물이 없어지거나 변경되고, 또는 신규 점포가 생기는 등 변화하더라도 이러한 변화를 지도에 반영하는데 시간이 소요되므로 잘못된 정보를 제공할 가 능성이 있다. 또한, 관련 정보를 수집하더라도 이를 분류하고 필요한 정보를 선별하여 지도에 반영하기 위해서는 많은 인력과 시간이 소요된다."}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 발명의 배경기술은 대한민국 공개특허 제10-2019-0078685호, '점진적 군집화를 이용한 센서 데이터의 이상 패턴 감지 방법'에 개시되어 있다."}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "발명의 내용"}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 실시간으로 데이터를 수집하고 수집된 데이터를 분석하여 변경점을 추출하고, 자동화 적용 여부에 따 라 분류하여 지도 데이터를 자동으로 갱신하는, 실시간 데이터를 이용한 지도 데이터 관리장치 및 그 방법을 제 공하는데 그 목적이 있다."}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 실시간 데이터를 이용한 지도 데이터 관리장치는, 도로 및 도로 주변 시설물에 대한 데이터를 실시간으로 수집하는 통신부; 수집된 데이터 및 지도 데이터가 저장되는 메모리; 및 상기 통신부를 통해 실시간 으로 수집되는 데이터를 분석하여, 변경 정보를 기반으로 변경점을 추출하고, 상기 변경점에 대한 변경점 데이 터가 자동화 대상인지 판단하여 분류한 후, 상기 자동화 대상으로 분류된 상기 변경점 데이터를 기 저장된 상기 지도 데이터에 반영하여 상기 지도 데이터를 업데이트 하는 프로세서; 를 포함한다. 본 발명에 있어 상기 프로세서는 상기 지도 데이터와 상기 데이터를 비교하여, 도로 및 도로 주변의 시설물에 대한 선형 및 속성 중 적어도 하나의 변화를 상기 변경점으로 추출하는 것을 특징으로 한다. 본 발명에 있어 상기 프로세서는 상기 데이터 중 도로 및 상기 도로 주변의 시설물에 대한 정보를 기반으로 추 가, 삭제 및 변경에 대한 데이터를 상기 변경점으로 검출하는 것을 특징으로 한다. 본 발명에 있어 상기 프로세서는 상기 데이터 중 금융 정보를 기반으로, 상기 도로 주변 시설물에 대한 거래내 역, 명칭, 연락처, 위치, 대표명 및 업종 중 적어도 하나의 변경 정보를 상기 변경점으로 검출하는 것을 특징으 로 한다. 본 발명에 있어 상기 프로세서는 상기 변경점 데이터 및 다른 데이터와의 연관성을 분석하여, 연관성을 낮은 상 기 변경점 데이터를 상기 자동화 대상으로 분류하는 것을 특징으로 한다. 본 발명에 있어 상기 프로세서는 속성이 변경된 상기 변경점 데이터를 상기 자동화 대상으로 분류하는 것을 특 징으로 한다. 본 발명에 있어 상기 프로세서는 상기 변경점 데이터를 상기 지도 데이터에 적용하여 업데이트 한 후, 업데이트 된 지도 데이터에 대한 검증을 수행하는 것을 특징으로 한다. 본 발명에 있어 상기 프로세서는 상기 업데이트된 지도 데이터가 기 설정된 규칙 또는 속성에 위배되는지 여부 를 판단하여 검증을 수행하는 것을 특징으로 한다. 본 발명에 있어 상기 프로세서는 추가 수집되는 데이터를 기반으로, 상기 업데이트된 지도 데이터에 대한 검증 을 수행하는 것을 특징으로 한다. 본 발명에 있어 상기 프로세서는 검증 시 오류가 발견되면, 상기 지도 데이터를 일정 시간 이전으로 롤백하는 것을 특징으로 한다. 본 발명에 따른 실시간 데이터를 이용한 지도 데이터 관리방법은, 통신부가, 도로 및 도로 주변 시설물에 대한 데이터를 실시간으로 수집하는 단계; 프로세서가, 상기 데이터를 분석하여, 변경 정보를 기반으로 변경점을 추 출하는 단계; 상기 변경점에 대한 변경점 데이터가 자동화 대상인지 판단하여 분류하는 단계; 및 상기 자동화 대상으로 분류된 상기 변경점 데이터를 지도 데이터에 반영하여 상기 지도 데이터를 업데이트 하는 단계; 를 포 함한다. 본 발명에 있어 상기 변경점을 추출하는 단계에서, 상기 프로세서는, 상기 지도 데이터와 상기 데이터를 비교하 고, 상기 도로 또는 상기 도로 주변의 시설물에 대한 선형 및 속성 중 적어도 하나의 변화를 상기 변경점으로 추출하는 것을 특징으로 한다. 본 발명에 있어 상기 변경점을 추출하는 단계에서 상기 프로세서는, 상기 데이터 중 상기 도로 및 상기 도로 주 변의 시설물에 대한 정보를 기반으로 추가, 삭제, 변경에 대한 데이터를 상기 변경점으로 추출하고, 상기 데이 터 중 금융 정보를 기반으로, 상기 도로 주변 시설물에 대한 거래내역, 명칭, 연락처, 위치, 대표명 및 업종 중 적어도 하나의 변경을 상기 변경점으로 추출하는 것을 특징으로 한다. 본 발명에 있어 상기 분류하는 단계에서 상기 프로세서는, 상기 변경점 데이터 및 다른 데이터의 연관성을 분석 하고, 연관성을 낮은 상기 변경점 데이터를 상기 자동화 대상으로 분류하는 것을 특징으로 한다. 본 발명에 있어 상기 분류하는 단계에서 상기 프로세서는, 속성 변경에 대한 상기 변경점 데이터를 상기 자동화 대상으로 분류하는 것을 특징으로 한다. 본 발명에 있어 상기 지도 데이터를 업데이트 하는 단계 후, 상기 프로세서가, 상기 업데이트된 지도 데이터가 기 설정된 규칙 또는 속성에 위배되는지 여부를 판단하여 검증하는 단계; 추가 수집되는 데이터를 기반으로, 상 기 업데이트된 지도 데이터의 일치 여부를 판단하여 검증하는 단계; 및 기 설정된 규칙 또는 속성에 위배되거나, 추가 수집되는 데이터와 일치하지 않는 경우 일정 시간 이전으로 상기 지도 데이터를 롤백하는 단 계; 를 더 포함한다."}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 본 발명의 실시간 데이터를 이용한 지도 데이터 관리장치 및 그 방법은, 실시간으 로 수집되는 데이터의 변경점 분석 및 자동화 대상 분류를 통해, 다량의 데이터를 효과적으로 처리할 수 있고, 자동화 대상인 데이터를 기반으로 변경된 정보를 자동으로 지도 데이터에 반영할 수 있다. 또한, 본 발명의 일 측면에 따르면, 본 발명은 변경되는 정보를 효과적으로 검출하고, 지도 데이터에 반영하여 지도 데이터를 업데이트 할 수 있다. 또한, 본 발명의 일 측면에 따르면, 지도 데이터의 검증 과정을 통해, 정확한 정보를 제공할 수 있다."}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명을 설명하도록 한다. 이 과정에서 도면에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료성과 편의상 과장되게 도시되어 있 을 수 있다. 또한, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로써 이는 사용자, 운용자 의 의도 또는 관례에 따라 달라질 수 있다. 그러므로 이러한 용어들에 대한 정의는 본 명세서 전반에 걸친 내용 을 토대로 내려져야 할 것이다. 도 1 은 본 발명의 일 실시예에 따른 실시간 데이터를 이용한 지도 데이터 관리장치의 구성이 간략하게 도시된 도이다. 도 1에 도시된 바와 같이, 본 발명의 실시간 데이터를 이용한 지도 데이터 관리장치(이하, 관리장치)는 복 수의 자동차, 단말(51, 52), 도로 시설물, 서버 등으로부터 실시간으로 데이터를 수집하고, 수 집된 데이터를 분석하여 지도 데이터를 관리한다. 예를 들어, 관리장치는 휴대 단말, 컴퓨터 등의 사용자 단말과 자동차(11, 12)의 위치정보, 체 류시간 등을 획득하고, 자동차(11, 12) 또는 단말을 통해 인식되는 객체에 대한 정보, 도로 시설물을 통해 도로 교통량에 대한 정보를 획득할 수 있다. 또한, 관리장치는 금융 회사 등의 서버를 통해 금융 정보, 예를 들어 카드 승인 내역, 거래 내역에 대 한 데이터를 획득할 수 있다. 관리장치는 수집된 데이터를 데이터베이스에 저장하고, 딥 러닝 기반 데이터 분석 알고리즘을 통해 데 이터를 분석하여 데이터의 상관관계 및 데이터의 변경 정보를 도출하고, 데이터의 자동화 여부에 따라 자동화 대상으로 분류하여 지도를 업데이트 한다. 관리장치는 실시간으로 수집되는 데이터와 기 저장된 지도 데이터와 비교하여 차이점을 검출하고, 이를 변 경점으로 하여 변경점 데이터를 추출한다. 또한, 관리장치는 변경된 정보가 자동으로 반영 가능한 정보인지 자동화 대상에 대한 분류를 수행하고 자동화 대상에 대한 변경점 데이터를 지도 데이터에 반영하여 실시간으로 지도 데이터를 업데이트 한다. 또한, 관리장치는 변경된 정보가 반영된, 업데이트된 지도 데이터를 검증한다. 관리장치는 추가로 수집되는 데이터를 업데이트된 지도 데이터의 정보와 비교하여 업데이트된 지도 데이터 와 일치하는지 여부를 판단하여 지도 데이터를 검증할 수 있다. 관리장치는 이동통신, 와이파이, 이더넷 등 다양한 통신 방식을 이용하여 데이터를 수집하고, 중계기 (41, 42)를 통해 지도 데이터에 대한 정보를 자동차 또는 단말로 전송할 수 있다. 예를 들어, 관리장치는 특정 위치, A 영역에 접근하는 자동차로 A영역에 대한 업데이트된 지도 데이터 를 제공할 수 있다. 관리장치는 A영역에 위치하는 점포 등 시설에 대한 정보를 아이콘, 이미지, 문자 및 숫 자 중 적어도 하나의 조합으로 지도 상에 표시할 수 있다. 또한, 관리장치는 필요에 따라 A영역에 위치하는 특정 시설에 대한 광고 정보를 제공할 수 있다. 도 2 는 본 발명의 일 실시예에 따른 실시간 데이터를 이용한 지도 데이터 관리장치의 제어구성이 간략하게 도 시된 블록도이다. 도 2에 도시된 바와 같이, 관리장치는 통신부, 메모리, 입력부, 출력부 및 프로세서 를 포함한다. 또한, 관리장치는 데이터베이스(DB)와 연결되어 수집된 데이터를 저장하고, 저장된 데이터를 분석하고 분류하며, 업데이트된 지도 데이터를 데이터베이스(DB)에 저장한다. 경우에 따라, 관리장치는 데이터베 이스(DB)를 포함할 수 있다. 데이터베이스(DB)는 다량의 데이터를 저장하는 저장장치로, 대용량 로우 데이터 파일을 저장하기 위한 하둡 파일 관리시스템(HDFS)과 분석 및 모니터링 데이터를 저장하기 위한 NoSQL, DB, RDD 등으로 구성될 수 있다. 메모리는 통신부를 통해 실시간 수신되는 데이터가 데이터베이스로 전송되기 전 임시저장하고, 데이터 취합 후 가공되는 데이터를 저장하며, 데이터 분석결과 및 분류된 데이터를 저장한다. 메모리는 자 동화 대상인 데이터를 별도 저장하고, 업데이트 적용된 지도 데이터를 저장한다. 메모리는 통신부를 통해 데이터베이스로부터 수신되는 데이터를 저장한다. 또한, 메모리는 데이터 취합 알고리즘, 데이터 가공 알고리즘, 데이터 분석 알고리즘, 데이터 분류 알고리 즘, 데이터 업데이트 알고리즘, 데이터 검증 알고리즘에 대한 데이터를 저장한다. 메모리는 램(RAM, Random Access Memory), 롬(ROM), EEPROM(Electrically Erased Programmable ROM) 등 의 비휘발성 메모리, 플래시 메모리 등의 저장수단을 포함할 수 있다. 통신부는 네트워크를 통해 복수의 단말 및 서버와 연결되어 실시간으로 데이터를 수신한다. 통신 부는 외부 수집 데이터 API를 수신하고, AFKA 수신 데이터를 취합하여 프로세서로 인가한다. 예를 들어, 통신부는 금융회사의 서버와 연결되어, 카드 결제 내역 등의 금융 정보를 수신하고 금융 정보에 포함된 해당 지점의 위치정보를 바탕으로 지도 데이터를 업데이트 할 수 있다. 통신부는 유선 또는 무선의 통신모듈을 포함한다. 예를 들어 통신부는 이더넷(Ethernet), 와이파이 (WIFI), 블루투스(Bluetooth) 등의 근거리 통신, 이동 통신, 및 시리얼 통신 중 적어도 하나를 포함할 수 있다. 또한, 통신부는 차량과 도로설비와의 통신을 위한 WAVE(Wireless Access in Vehicular Environment), 차 량 간 통신을 위한 V2X(Vehicle to Everything)를 통해 통신한 수 있다. 입력부는 데이터의 취합, 가공 및 분류를 위한 설정 데이터가 입력된다. 또한, 입력부는 지도 데이터 업데이트를 위한 설정 및 검증을 위한 규칙 또는 설정을 입력할 수 있다. 입력부는 적어도 하나의 버튼, 스위치 및 터치패드를 포함하여, 입력된 데이터를 프로세서로 인가한 다. 출력부는 동작램프, 디스플레이 및 스피커 중 적어도 하나를 포함한다. 출력부는 데이터의 취합, 가공, 분석 및 분류에 따른 진행상황을 출력한다. 출력부는 업데이트 대상 인 데이터가 분류되면, 자동 업데이트에 대한 알림을 출력한다. 또한, 출력부는 지도 데이터 업데이트 과 정을 출력하며, 업데이트 결과를 출력한다. 출력부는 수집되는 데이터, 데이터의 가공, 분석, 분류 및 업데이트에 대한 메뉴화면을 구현하여 출력할 수 있다. 출력부는 메뉴 화면 및 동작상태를 디스플레이를 통해 출력하고, 효과음, 경고음 및 음성안내 중 적어도 하나를 스피커를 통해 출력하며, 테스트 진행 상황 및 동작상태를 동작램프를 통해 출력한다. 프로세서는 적어도 하나의 마이크로-프로세서를 포함할 수 있다. 프로세서는 메모리에 저장된 알고리즘 데이터를 기반으로 동작하여 알고리즘에 따라 데이터를 처리하 고, 지도 데이터를 업데이트 한다. 프로세서는 복수의 프로세서가 연계하여 데이터를 분산처리 할 수 있다. 또한, 프로세서는 인공지능 기반 딥러닝 알고리즘에 따라 데이터를 분석하고 분류할 수 있다. 프로세서는 통신부를 통해 실시간으로 수집되는 데이터를 메모리 또는 데이터베이스에 저장 하고, 종류에 따라 취합한다. 프로세서는 수집된 데이터를 로우 데이터 테이블 형태로 취합하여 저장할 수 있다. 예를 들어, 프로세서는 레드박스(RedBox) 인식 객체, 예를 들어 도로, 차선, 표지판 등에 대한 데이터를 수집하고, 금융회사의 서버로부터 카드 결제 내역 또는 거래 내역 등의 금융 정보를 수집할 수 있다. 프로 세서는 자동차로부터 센서 등을 통해 수집되는 레드박스 데이터, 위치정보 데이터 등을 수집할 수 있 다. 프로세서는 저장된 데이터를 호출하여 오류데이터를 제거하고 분석을 위한 일정 형식의 데이터로 변환하여 지도 데이터로 가공한다. 프로세서는 데이터 처리를 위한 해쉬값을 부여할 수 있다. 프로세서는 수집된 데이터를 기 저장된 지도 데이터와 비교하여 변경점을 분석한다. 프로세서는 관리 중인 도로에 대한 데이터에서 변경된 정보가 존재하는 경우 이를 비교하고 분석하여 변경내용을 파악하고 변경 점 데이터로 추출한다. 예를 들어, 프로세서는 도로의 차선이 추가되거나 새로운 도로가 건설된 경우 변경점으로 추출한다. 프로 세서는 레드박스 데이터를 기반으로 인식된 객체를 지도 데이터와 비교하여 변경 여부를 판단하여 변경점 으로 추출한다. 또한, 프로세서는 금융회사의 서버로부터 수신된 금융 정보를 기반으로, 특정 점포의 최근 일정 기간 내에 해당 지점의 결제가 있는지 여부를 통해 변경 정보를 파악할 수 있다. 프로세서는 금융 정보를 기반 으로 도로 주변의 시설물에 대하여 거래내역, 명칭, 연락처, 위치, 대표명 및 업종의 변경 여부를 검출하여 변 경점으로 추출할 수 있다. 프로세서는 자동차 등을 통해 수집되는 데이터 중, 도로 주변의 지형지물의 형상을 분석하여 클러스터 를 생성하고, 좌표 기준으로 선형비교를 통해 동일한 데이터인지 변경 여부를 판단할 수 있다. 프로세서는 기 저장된 데이터와 상이한 데이터를 변경점으로 추출하고, 변경점에 대한 에러코드(ERROR), 에러의 이름(ERROR NAME) 및 에러에 대한 설명을 변경점 데이터에 포함할 수 있다. 프로세서는 변경점 데이터를 자동으로 지도 데이터에 적용할 수 있는지 여부를 판단하고, 자동 적용이 가 능한 경우 자동화 대상으로 분류한다. 프로세서는 변경점 데이터에 대하여, 형상 또는 속성과 관련된 데이터가 변경되었는지 판단하고, 다른 데 이터와의 연관성을 분석하여, 연관성이 적은 변경점 데이터를 자동화 대상으로 분류한다. 프로세서는 형상 데이터를 기준으로 변경점을 검출하더라도 대표 선형 데이터를 생성하여 비교 데이터를 설정할 필요가 있다. 프로세서는 형상 관련 데이터들을 관리하고, 이를 통해 자동화 대상으로 분류할 지 판단한다. 프로세서는 속성 데이터가 변경된 경우에는 변경점 데이터를 자동화 대상으로 분류한다. 예를 들어, 프로세서는 변경점에 대하여 도로표지, 표지판, 신호등, 도로 유도선, 통행규제, 통행정보, 운 전운행데이터 등으로 분류하고, 각각의 데이터 중 변경된 내용을 확인한 후 자동화 대상인지 판단한다. 변경점 데이터를 바탕으로 좌회전 정보 또는 우회전 정보가 존재하는 경우, 프로세서는 검출지점 기준 위 치를 매칭하여 통행규제 정보 중 좌회전 또는 우회전에 대한 정보가 있는지 확인하고 이를 자동화 대상으로 분 류할 수 있다. 또한, 노면 또는 표지판에 일방통행 표지가 존재하는 경우, 해당 검출 지점을 기준으로 위치를 매칭하여 확인하 고 일방통행에 대한 데이터가 있는지 확인한다. 이때, 프로세서는 일방통행에 대한 확인을 위해 수작업이 필요한 것으로 판단되면, 자동화 대상에서 제외하고 수작업 대상으로 분류한다. 한편, 프로세서는 형상 또는 속성의 변경에 대한 변경점 데이터가 다른 데이터와의 연관성이 높은 경우, 작업자에 의해 수동 작업하도록 분류할 수 있다. 프로세서는 자동화 대상으로 분류된 변경점 데이터에 대해 자동화 작업 대상을 리포팅하고, 변경점 데이터 를 적용하여 지도 데이터를 자동으로 업데이트 한다. 프로세서는 자동화 대상으로 분류되는 변경점 데이터에 대하여, 지도 데이터의 형식으로 수정 데이터를 생 성할 수도 있다. 프로세서는 예를 들어 변경내용 및 변경위치를 포함하여 SQL 문서로 수정 데이터를 생성 할 수 있다. 프로세서는 변경된 정보가 업데이트를 통해 지도 데이터에 반영되면, 업데이트된 지도 데이터에 대하여 논 리적 또는 물리적 무결성을 판단하여 검증을 수행한다. 프로세서는 업데이트된 지도 데이터가 실제 도로 정보 또는 도로 상황과 일치하는지 여부를 판단하여 업데 이트된 지도 데이터를 검증할 수 있다. 또한, 프로세서는 업데이트된 지도 데이터의 규칙 또는 속성에 위 배되는지 판단하고, 오류 검출 여부를 통해 무결성을 판단한다. 예를 들어, 도로에 국도인 경우, 지방도인 경우, 고속도로인 경우에 대하여 각각 일정 논리 규칙을 설정하고, 해당 논리가 정상인지 판단하여 검증을 수행할 수 있다. 프로세서는 검증이 완료되면 검증 완료에 대하여 리포팅하고, 검증과정에서 오류가 검출된 경우 오류를 리 포팅하고, 롤백하여 업데이트 이전 데이터로 복구할 수 있다. 도 3 은 본 발명의 일 실시예에 따른 실시간 데이터를 이용한 지도 데이터 관리장치의 지도 업데이트에 따른 예 시도이다. 관리장치는 자동차의 현재 위치를 기반으로 지도 데이터를 자동차의 내비게이션 시스템에 제공한다. 그에 따라 자동차는 도 3의 (a)에 도시된 바와 같이, 현재 위치를 기반으로 일정 거리 내의 지도 데이터를 수신하여 화면에 출력한다. 지도 데이터는, 도로의 형태, 주행방향 및 도로 주변의 시설물에 대한 정보를 포함한다. 지도 데이터는, 도로 주변의 시설물 중, 주유소, 패스트푸드점, 베이커리 등에 대한 부가 정보 를 포함할 수 있다. 부가 정보는 도시된 바와 같이, 아이콘 또는 이미지로 표시될 수 있다. 자동차는 주행 중 감지되는 데이터를 수집하여 관리장치로 전송한다. 관리장치는 자동차, 도로 시설물 및 서버로부터 실시간으로 수집되는 데이터를 통해 지도 데이 터와 비교하여 변경점을 검출하고 변경 정보가 지도 데이터에 반영되도록 지도 데이터를 업데이트 한다. 도 3의 (b)에 도시된 바와 같이, 관리장치는 자동차로부터 수신된 데이터를 기반으로 주행방향의 좌측 에 위치한 점포가 패스트푸드점에서 카페로 변경됨에 따라, 해당 정보를 변경점으로 검출한다. 또한, 관리장치는 금융회사의 서버로부터 수신된 금융 정보를 기반으로 결제내역에 포함됨 명칭 또는 업종 등 의 정보를 통해 변경점을 검출할 수 있다. 관리장치는 패스트푸드점에서 카페로의 변경에 대한 변경 내용과 위치정보를 포함하는 변경 정보 를 변경점 데이터로 생성하고, 변경점 데이터와 다른 데이터와의 연관성을 판단하여 자동화 대상으로 분류한다. 관리장치는 자동화 대상에 대하여 변경점 데이터를 지도 데이터에 적용하여 지도 데이터를 업데이트 한다. 또한, 관리장치는 실시간으로 수집되는 데이터를 기반으로, 자동차의 현재 위치에서 우측 도로에 위치 하는 시설물 중 미등록 데이터를 변경점으로 검출한다. 관리장치는 미등록 데이터에 관련하여 서버의 금융 정보를 통해 점포 명칭, 위치 및 연락처에 대 한 정보를 기반으로 변경점 데이터를 생성한다. 관리장치는 미등록된 변경점 데이터를 자동화 대상으로 분 류하고, 지도 데이터 형식의 변경점 데이터를 지도 데이터에 적용하여 자동으로 지도 데이터를 업데이트 한다. 자동차는 업데이트된 지도 데이터를 기반으로 우측의 신규 충전소가 포함된 지도를 표시한다. 또한, 자동차는 주행 중 미등록 데이터를 기반으로 신규 추가된 충전소에 대한 데이터를 수집하여 관리장치 로 전송한다. 관리장치는 업데이트된 지도 데이터의 변경 내용에 대하여, 자동차로부터 추가 수집된 데이터를 기반으 로 해당 위치에 충전소가 실제 위치하는지 검증할 수 있다. 관리장치는 지도 데이터를 업데이트 한 후, 수집되는 데이터를 통해 추가되거나 변경된 정보에 대하여 수집 되는 데이터를 통해 검증한다. 관리장치는 오류가 발생하는 경우, 예를 들어 신규 추가된 충전소가 해 당 위치에 존재하지 않거나, 충전소가 아니라 다른 시설물인 경우, 결제내역의 상호 분류가 상이한 경우 등, 업데이트된 정보에 오류가 있는 경우 과거 일정 시점으로 롤백하고 수집되는 데이터를 바탕으로 다시 업데 이트 할 수 있다. 관리장치는 업데이트 및 검증에 대한 리포트를 생성하여 출력한다. 도 4 는 본 발명의 일 실시예에 따른 관리장치의 실시간 데이터를 이용한 지도 데이터 관리방법이 도시된 순서 도이다. 관리장치는 실시간으로 수집되는 데이터를 분석하여 지도 데이터를 자동으로 업데이트 한다. 도 4에 도시된 바와 같이, 통신부를 통해 자동차, 단말, 도로 시설물, 서버 등으로부터 실시간으로 데이터를 수신하고, 프로세서는 수집된 데이터를 메모리 또는 데이터베이스에 저장한 다(S310). 예를 들어, 프로세서는 자동차로부터 도로, 차선, 표지판 등에 대한 도로 정보, 레드박스(RedBox) 인 식 객체에 대한 데이터, 금융회사 서버의 일일 거래 내역 등의 금융 정보를 수집할 수 있다. 프로세서는 저장된 데이터를 취합하고, 지정된 형식의 데이터로 가공한다(S320). 프로세서는 저장된 데이터로부터 오류데이터를 제거하고, 관련성이 낮은 데이터를 보류하거나 삭제한다. 또한 프로세서는 데 이터 분석을 위한 특정 포맷으로 데이터를 변환할 수 있다. 프로세서는 가공된 데이터를 기존의 지도 데이터와 비교하여 변경점을 검출하여 분석한다(S330). 프로세서는 이전의 지도 데이터와 신규 수집된 데이터를 비교하여 선형 또는 속성이 상이한 데이터를 변경 점으로 검출한다. 예를 들어 도로 주변의 지형지물이 변경되면 선형 특성의 변경을 통해 검출하고, 도로 주변의 시설물이 변경되는 경우 속성을 통해 변경점을 검출할 수 있다. 프로세서는 선형이 특성이 변경되거나 데이터의 속성이 변경되는 것에 대하여 변경내용 및 위치정보를 포 함하는 변경점 데이터를 추출하고, 테이블로 구성하여 관리한다. 프로세서는 변경점 데이터와 다른 데이터의 연관성을 분석하고, 연관성이 적은 경우 자동화 대상으로 분류 한다(S340). 또한, 프로세서는 속성에 대한 변경점 데이터인 경우 자동화 대상으로 분류한다. 프로세서는 다른 데이터와의 연관성이 높거나 선형 특징의 변경에 대항하는 경우 수동 업데이트하도록 수 동작업 대상으로 분류한다. 프로세서는 자동화 대상과 수동작업 대상에 대한 리스트를 리포트로 생성하여 출력한다(S350). 이때, 관리 자는 리포트를 확인하여 수동작업 대상을 처리한다. 관리자는 자동화 대상에 대하여 리스트를 확인하고 추후 업 데이트 및 검증 결과를 통해 업데이트 여부를 확인할 수 있다. 프로세서는 자동화 대상에 대하여, 변경점 데이터를 지도 데이터에 반영하여 자동으로 지도 데이터를 업데 이트 한다(S360). 그에 따라 자동차 및 단말은 업데이트된 지도 데이터를 수신하여 화면에 출력한다. 자동차 및 단말 은 업데이트된 지도 데이터를 표시하면서, 현재 위치를 기반으로 주변 정보를 수집하여 관리장치로 전 송한다. 프로세서는 신규 수집되는 데이터를 기반으로 업데이트된 지도 데이터를 검증한다(S370). 프로세서는 업데이트된 정보가 실제 지정된 위치에 실존하는지 선형 또는 속성에 대한 데이터가 일치하는 지 확인하여 업데이트된 지도 데이터를 검증할 수 있다. 프로세서는 업데이트된 지도 데이터의 일치 여부를 통해 오류를 확인하고, 오류가 있는 경우 일정 시간 이 전 시점으로 데이터를 롤백하여 오류를 복구한다. 프로세서는 데이터를 롤백한 후, 수집되는 데이터를 분 석하여 지도 데이터를 다시 업데이트 할 수 있다. 따라서, 본 발명의 일 측면에 따른 실시간 데이터를 이용한 지도 데이터 관리장치 및 그 방법은, 실시간으로 수 집되는 데이터를 이전 데이터와 비교하여 변경점을 검출하고, 변경점의 특성에 따라 자동화 대상인지 분류한 후, 변경점 데이터를 기반으로 지도 데이터를 자동으로 업데이트 할 수 있다. 또한, 본 발명은 새로 수집되는 데이터를 통해 업데이트된 데이터를 검증하여, 변경내용을 신속하게 지도에 반 영할 수 있고, 오류 검증을 통해 보다 정확한 지도 데이터를 제공할 수 있다. 본 발명은 도면에 도시된 실시예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며 당해 기술이 속하"}
{"patent_id": "10-2022-0180426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이 해할 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 아래의 특허청구범위에 의하여 정해져야할 것이다."}
{"patent_id": "10-2022-0180426", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 실시간 데이터를 이용한 지도 데이터 관리장치의 구성이 간략하게 도시된 도이다. 도 2는 본 발명의 일 실시예에 따른 실시간 데이터를 이용한 지도 데이터 관리장치의 제어구성이 간략하게 도시 된 블록도이다. 도 3은 본 발명의 일 실시예에 따른 실시간 데이터를 이용한 지도 데이터 관리장치의 지도 업데이트에 따른 예 시도이다. 도 4는 본 발명의 일 실시예에 따른 관리장치의 실시간 데이터를 이용한 지도 데이터 관리방법이 도시된 순서도 이다."}
