{"patent_id": "10-2021-0065741", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0157783", "출원번호": "10-2021-0065741", "발명의 명칭": "생체 데이터를 이용하여 개인 맞춤형 코칭을 제공하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이우상"}}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 센서;디스플레이;메모리; 및상기 센서, 상기 메모리 및 상기 디스플레이와 작동적으로 연결된 프로세서를 포함하고,상기 프로세서는,상기 센서를 이용하여 복수의 종류들의 생체 데이터를 수집하고,상기 복수의 종류들의 생체 데이터 사이의 우선 순위를 설정하고,상기 우선 순위에 기반하여 상기 복수의 종류들의 생체 데이터 각각이 지정된 조건에 해당하는지 여부를 판단하고,상기 지정된 조건에 해당하는지 여부에 대하여 판단한 결과를 분석하여 오버 트레이닝(over-training) 여부를판단하고, 상기 오버 트레이닝 여부에 따라 사용자에게 운동과 관련된 가이드(guide)를 포함하는 메시지를 출력하는 전자장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 프로세서는,상기 복수의 종류들의 생체 데이터 중 상기 지정된 조건에 해당하는 상기 생체 데이터의 개수 및 상기 지정된조건에 해당하는 상기 생체 데이터의 종류 중 적어도 하나에 기반하여 상기 운동과 관련된 가이드를 포함하는메시지를 제공하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 복수의 종류들의 생체 데이터는 운동 데이터, 수면 데이터, 심박(Heart Rate) 데이터, 체중 데이터, 또는음식 데이터 중 적어도 하나를 포함하고,상기 프로세서는,상기 우선 순위를 상기 운동 데이터, 상기 수면 데이터, 상기 심박 데이터, 상기 체중 데이터, 및 상기 음식 데이터의 순서대로 설정하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 프로세서는상기 전자 장치와 무선 통신으로 연결된 외부 전자 장치로부터 상기 외부 전자 장치가 수집한 복수의 종류들의생체 데이터를 수신하는 전자 장치.공개특허 10-2022-0157783-3-청구항 5 제1 항에 있어서, 상기 복수의 종류들의 생체 데이터는 운동 데이터, 수면 데이터, 심박 데이터, 체중 데이터, 및 음식 데이터를포함하고,상기 운동 데이터는 거리, 지속 시간, 또는 랩 수(lap counting) 중 적어도 하나를 포함하고,상기 수면 데이터는 수면 점수, 수면 효율, 수면 등급, 또는 수면 시간 중 적어도 하나를 포함하고,상기 심박 데이터는 운동 심박수 또는 기상 심박수 중 적어도 하나를 포함하고,상기 체중 데이터는 체중을 포함하고,상기 음식 데이터는 탄수화물 데이터 또는 단백질 데이터 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서, 상기 프로세서는,상기 운동 데이터에 포함된 상기 거리, 상기 지속 시간, 또는 상기 랩 수 중 적어도 하나가 불규칙하면 상기 운동 데이터의 상기 지정된 조건이 성립한다고 판단하고,상기 분석의 대상이 되는 제1 운동의 제1 거리가 평균 거리보다 제1 비율 이상 길면 상기 거리를 불규칙하다고판단하고,상기 제1 운동의 제1 지속 시간이 평균 지속 시간보다 상기 제1 비율 이상 길면 상기 지속 시간을 불규칙하다고판단하고, 또는상기 제1 운동의 제1 랩 수가 평균 랩 수보다 상기 제1 비율 이상 많으면 상기 랩 수를 불규칙하다고 판단하는전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5 항에 있어서, 상기 프로세서는,상기 수면 데이터에 포함된 상기 수면 점수, 상기 수면 효율, 상기 수면 등급, 또는 상기 수면 시간 중 적어도하나를 불규칙하다고 판단하면 상기 수면 데이터의 상기 지정된 조건이 성립한다고 판단하고,상기 분석의 대상이 되는 제1 수면의 제1 수면 점수가 평균 수면 점수보다 제1 임계치 이상 감소하면 상기 수면점수를 불규칙하다고 판단하고,상기 제1 수면의 제1 수면 효율이 평균 수면 효율의 제2 비율 이하로 감소하면 상기 수면 효율을 불규칙하다고판단하고,상기 제1 수면의 제1 수면 등급이 평균 수면 등급보다 제2 임계치 이상 감소하면 상기 수면 등급을 불규칙하다고 판단하고, 또는상기 제1 수면의 제1 수면 시간이 평균 수면 시간의 제3 비율 이하로 감소하면 상기 수면 시간을 불규칙하다고판단하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5 항에 있어서, 상기 프로세서는,상기 심박 데이터에 포함된 상기 운동 심박수 또는 상기 기상 심박수 중 적어도 하나를 불규칙하다고 판단하면공개특허 10-2022-0157783-4-상기 심박 데이터의 상기 지정된 조건이 성립한다고 판단하고,상기 운동 심박수 중 상기 분석의 대상이 되는 제1 심박수가 제1 평균 심박수의 제4 비율 이상이면 상기 운동심박수를 불규칙하다고 판단하고, 또는상기 기상 심박수 중 상기 분석의 대상이 되는 제2 심박수가 제2 평균 심박수의 제4 비율 이상이면 상기 기상심박수를 불규칙하다고 판단하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제5 항에 있어서, 상기 프로세서는,상기 체중 중 상기 분석의 대상이 되는 제1 체중이 평균 체중의 제5 비율 이하이면 상기 체중 데이터의 상기 지정된 조건이 성립한다고 판단하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제5 항에 있어서, 상기 프로세서는, 상기 분석의 대상이 되는 날짜에 사용자가 섭취한 탄수화물 또는 단백질 중 적어도 하나가 상기 사용자의 신체에 대응하는 상기 탄수화물 또는 상기 단백질 각각의 권장 섭취량 미만인 경우 상기 음식 데이터의 상기 지정된조건이 성립한다고 판단하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서, 상기 복수의 종류들의 생체 데이터는 운동 데이터, 수면 데이터, 심박 데이터, 체중 데이터, 및 음식 데이터를포함하고,상기 프로세서는,상기 운동 데이터가 상기 지정된 조건에 해당하지 않는다고 판단한 경우 제1 분석을 수행하고, 또는상기 운동 데이터가 상기 지정된 조건에 해당한다고 판단한 경우 제2 분석을 수행하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서, 상기 프로세서는상기 제1 분석을 수행하는 경우,상기 수면 데이터, 상기 심박 데이터, 또는 상기 체중 데이터 중 적어도 하나가 상기 지정된 조건에 해당하면,상기 음식 데이터가 상기 지정된 조건에 해당하는지 여부를 판단하고, 또는상기 수면 데이터, 상기 심박 데이터, 및 상기 체중 데이터가 각각 상기 지정된 조건에 해당하지 않으면, 상기음식 데이터가 상기 지정된 조건에 해당하는지 여부에 대한 판단을 생략하고, 또는상기 제2 분석을 수행하는 경우, 상기 수면 데이터, 상기 심박 데이터, 상기 체중 데이터, 및 상기 음식 데이터가 각각 상기 지정된 조건에 해당하는지 여부를 판단하는 전자 장치."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2022-0157783-5-운동과 관련된 가이드를 포함하는 메시지를 출력하는 방법에 있어서, 복수의 종류들의 생체 데이터를 수집하는 동작;상기 복수의 종류들의 생체 데이터 사이의 우선 순위를 설정하는 동작;상기 우선 순위에 기반하여 상기 복수의 종류들의 생체 데이터 각각이 지정된 조건에 해당하는지 여부를 판단하는 동작;상기 판단의 결과를 분석하여 오버 트레이닝(over-training) 여부를 판단하는 동작; 및상기 오버 트레이닝 여부에 따라 사용자에게 운동과 관련된 가이드를 포함하는 메시지를 출력하는 동작; 을 포함하는 방법."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서, 상기 메시지를 출력하는 동작은,상기 복수의 종류들의 생체 데이터 중 상기 지정된 조건에 해당하는 상기 데이터의 개수 또는 상기 지정된 조건에 해당하는 상기 데이터의 종류 중 적어도 하나에 기반하여 알림이 제공되는 동작; 을 포함하는 방법."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서, 상기 우선 순위를 설정하는 동작은,상기 복수의 종류들의 생체 데이터에 포함된 운동 데이터, 수면 데이터, 심박 데이터, 체중 데이터, 및 음식 데이터 순서대로 설정하는 동작; 을 포함하는 방법."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13 항에 있어서, 상기 복수의 종류들의 생체 데이터를 수집하는 동작은,전자 장치 및 상기 전자 장치와 무선 통신으로 연결된 외부 전자 장치로부터 상기 복수의 종류들의 생체 데이터를 수집하는 동작; 을 포함하는 방법."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13 항에 있어서, 상기 복수의 종류들의 생체 데이터 각각이 상기 지정된 조건에 해당하는지 여부를 판단하는동작은,운동 데이터에 포함된 거리, 지속 시간, 또는 랩 수 중 적어도 하나를 불규칙하다고 판단하는 경우 상기 운동데이터의 상기 지정된 조건이 성립한다고 판단하는 동작;수면 데이터에 포함된 수면 점수, 수면 효율, 수면 등급, 또는 수면 시간 중 적어도 하나를 불규칙하다고 판단하는 경우 상기 수면 데이터의 상기 지정된 조건이 성립한다고 판단하는 동작;심박 데이터에 포함된 운동 심박수 또는 기상 심박수 중 적어도 하나를 불규칙하다고 판단하는 경우 상기 심박데이터의 상기 지정된 조건이 성립한다고 판단하는 동작;체중 데이터에 포함된 체중을 불규칙하다고 판단하는 경우 상기 체중 데이터의 상기 지정된 조건이 성립한다고판단하는 동작; 또는음식 데이터에 포함된 탄수화물 데이터 또는 단백질 데이터 중 적어도 하나를 불규칙하다고 판단하는 경우 상기음식 데이터의 상기 지정된 조건이 성립한다고 판단하는 동작; 중 적어도 하나를 포함하는 방법.공개특허 10-2022-0157783-6-청구항 18 제17 항에 있어서, 상기 운동 데이터의 상기 지정된 조건이 성립하는지 판단하는 동작은,상기 분석의 대상이 되는 제1 운동의 제1 거리가 평균 거리보다 제1 비율 이상 길면 거리가 불규칙하다고 판단하는 동작;상기 제1 운동의 제1 지속 시간이 평균 지속 시간보다 상기 제1 비율 이상인 길면, 지속 시간이 불규칙하다고판단하는 동작; 또는상기 제1 운동의 제1 랩 수가 평균 랩 수보다 상기 제1 비율 이상 많으면, 랩 수가 불규칙하다고 판단하는동작; 중 적어도 하나를 포함하고, 상기 수면 데이터의 상기 지정된 조건이 성립하는지 판단하는 동작은,상기 분석의 대상이 되는 제1 수면의 제1 수면 점수가 평균 수면 점수보다 제1 임계치 이상 감소하면 수면 점수를 불규칙하다고 판단하는 동작;상기 제1 수면의 제1 수면 효율이 평균 수면 효율의 제2 비율 이하로 감소하면 수면 효율이 불규칙하다고 판단하는 동작;상기 제1 수면의 제1 수면 등급이 상기 평균 수면 등급보다 제2 임계치 이상 감소하면 상기 수면 등급을 불규칙하다고 판단하는 동작; 또는상기 제1 수면의 제1 수면 시간이 상기 평균 수면 시간의 제3 비율 이하로 감소하면 상기 수면 시간을 불규칙하다고 판단하는 동작; 중 적어도 하나를 포함하고,상기 심박 데이터의 상기 지정된 조건이 성립하는지 판단하는 동작은, 상기 운동 심박수 중 상기 분석의 대상이되는 제1 심박수가 제1 평균 심박수의 제4 비율 이상이면 상기 운동 심박수를 불규칙하다고 판단하는 동작; 또는상기 기상 심박수 중 상기 분석의 대상이 되는 제2 심박수가 제2 평균 심박수의 제4 비율 이상이면 상기 기상심박수를 불규칙하다고 판단하는 동작; 중 적어도 하나를 포함하고,상기 체중 데이터의 상기 지정된 조건이 성립하는지 판단하는 동작은,상기 분석의 대상이 되는 제1 체중이 평균 체중의 제5 비율 이하이면 상기 체중을 불규칙하다고 판단하는 동작;을 포함하고, 또는상기 음식 데이터의 상기 지정된 조건이 성립하는지 판단하는 동작은,상기 분석의 대상이 되는 날짜에 사용자가 섭취한 탄수화물 또는 단백질 중 적어도 하나가 상기 사용자의 신체에 대응하는 상기 탄수화물 또는 상기 단백질 각각의 권장 섭취량 미만인 경우 불규칙하다고 판단하는 동작; 을포함하는 방법."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17 항에 있어서, 상기 운동 데이터가 상기 지정된 조건에 해당하지 않는다고 판단한 경우 제1 분석을 수행하는 동작; 또는상기 운동 데이터가 상기 지정된 조건에 해당한다고 판단한 경우 제2 분석을 수행하는 동작; 을 더 포함하는 방법."}
{"patent_id": "10-2021-0065741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서,공개특허 10-2022-0157783-7-상기 제1 분석을 수행하는 경우,상기 수면 데이터, 상기 심박 데이터, 또는 상기 체중 데이터 중 적어도 하나가 상기 지정된 조건에 해당하면상기 음식 데이터가 상기 지정된 조건에 해당하는지 여부를 판단하는 동작; 또는상기 수면 데이터, 상기 심박 데이터, 또는 상기 체중 데이터가 각각 상기 지정된 조건에 해당하지 않으면, 상기 음식 데이터가 상기 지정된 조건에 해당하는지 여부에 대한 판단을 생략하는 동작; 을 더 포함하고, 또는상기 제2 분석을 수행하는 경우,상기 수면 데이터, 상기 심박 데이터, 상기 체중 데이터, 또는 상기 음식 데이터가 각각 상기 지정된 조건에 해당하는지 여부를 판단하는 동작; 을 더 포함하는 방법."}
{"patent_id": "10-2021-0065741", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "센서, 디스플레이, 메모리, 상기 센서, 상기 메모리 및 상기 디스플레이와 작동적으로 연결된 프로세서를 포함하 고, 상기 프로세서는 상기 센서를 이용하여복수의 종류들의 생체 데이터 사이의 우선 순위를 설정하고, 상기 우 선 순위에 기반하여 상기 복수의 종류들의 생체 데이터 각각이 지정된 조건에 해당하는지 여부를 판단하고, 상기 지정된 조건에 해당하는지 여부에 대하여 판단한 결과를 분석하여 오버 트레이닝(over-training) 여부를 판단하 고, 상기 오버 트레이닝 여부에 따라 사용자에게 운동과 관련된 가이드를 포함하는 메시지를 출력하는 전자 장치 가 개시된다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2021-0065741", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 다양한 실시 예들은 생체 데이터를 이용하여 개인 맞춤형 코칭을 제공하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0065741", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치 또는 웨어러블 전자 장치와 같은 전자 장치와 무선 통신으로 연결된 외부 전자 장치에 포함된 센서를 통해 사용자의 각종 생체 데이터를 수집한다. 전자 장치는 수집된 생체 데이터를 사용자에게 단순히 제시하거나, 수집된 생체 데이터를 가공하여 가공된 데이터를 포함하는 피드백을 사용자에게 제시할 수 있다."}
{"patent_id": "10-2021-0065741", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "과도한 운동, 잘못된 코칭, 영양 불균형 등 다양한 요소에 의해 오버 트레이닝(over training)이 발생할 수 있 음에도 불구하고, 사용자가 이를 인지하지 못함으로써 다양한 문제가 발생할 수 있다. 다양한 문제에는 신체적 인 문제로서 심한 근육통, 수면의 질 하락, 설사 등이 발생할 수 있고, 정신적인 문제로서 의욕 저하 등이 발생 할 수 있다. 본 발명은 사용자에게 이러한 다양한 문제를 일으킬 수 있는 오버 트레이닝을 모니터링하고자 한다. 본 문서에 개시되는 다양한 실시 예들은, 다양한 생체 데이터를 이용하여 오버 트레이닝을 모니터링하고, 이에 기반하여 개인 맞춤형 코칭을 제공하는 전자 장치를 제공하고자 한다."}
{"patent_id": "10-2021-0065741", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 전자 장치는, 센서, 디스플레이, 메모리, 상기 센서, 상기 메모리 및 상 기 디스플레이와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 센서를 이용하여 복수의 종류 들의 생체 데이터를 수집하고, 상기 복수의 종류들의 생체 데이터 간 우선 순위를 설정하고, 상기 우선 순위에 기반하여 상기 복수의 종류들의 생체 데이터 각각이 지정된 조건에 해당하는지 여부를 판단하고, 상기 지정된 조건에 해당하는지 여부에 대하여 판단한 결과를 분석하여 오버 트레이닝(over-training) 여부를 판단하고, 상 기 오버 트레이닝 여부에 따라 사용자에게 운동과 관련된 가이드(guide)를 포함하는 메시지를 출력할 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 운동과 관련된 가이드를 포함하는 메시지를 출력하는 방법은, 복 수의 종류들의 생체 데이터를 수집하는 동작, 상기 복수의 종류들의 생체 데이터 사이의 우선 순위를 설정하는 동작, 상기 우선 순위에 기반하여 상기 복수의 종류들의 생체 데이터 각각이 지정된 조건에 해당하는지 여부를 판단하는 동작, 상기 판단의 결과를 분석하여 오버 트레이닝(over-training) 여부를 판단하는 동작, 및 상기 오 버 트레이닝 여부에 따라 사용자에게 운동과 관련된 가이드를 포함하는 메시지를 출력하는 동작을 포함할 수 있다."}
{"patent_id": "10-2021-0065741", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 실시 예들에 따르면, 사용자가 오버 트레이닝을 간과하고 지속적인 운동을 할 때, 근육의 이화작용이 촉진 됨으로써 운동량은 증가하지만 운동의 효과는 감소하는 것을 예방한다. 또한, 사용자가 운동량을 늘리지만 운동의 효과가 증가하지 않아 받을 수 있는 스트레스를 예방하고, 이러한 스 트레스로 인해 식욕 부진, 불면증 등으로 신체 리듬이 깨지는 것을 방지할 수 있다. 본 발명을 통해 사용자는 오버 트레이닝의 징후를 미리 파악할 수 있고, 이에 따라 스스로에게 알맞은 운동 방 법 및 휴식을 통해 운동 효과를 상승시키고 부상을 방지할 수 있다. 또한, 사용자가 이미 오버 트레이닝에 해당하는 경우, 사용자의 상태에 알맞은 운동 방법 및 휴식을 제공하여 회복을 돕고 효율적인 운동을 수행할 수 있도록 유도할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2021-0065741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성 요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 일 실시 예에 따른 센서를 설명하는 도면이다. 센서 (예: 도 1의 센서 모듈)는 제1 센서 모듈(21 0)과 대응될 수 있다. 제1 센서 모듈은 전자 장치(예: 도 1의 전자 장치)에 포함될 수 있다. 제2 센 서 모듈은 제1 센서 모듈과 실질적으로 동일한 기능을 갖는 센서 모듈일 수 있다. 제2 센서 모듈 은 전자 장치와 무선 통신으로 연결된 웨어러블(wearable) 전자 장치와 같은 외부 전자 장치(예: 도 1의 전자 장치)에 포함될 수 있다. 제1 센서 모듈은 제1 PPG 센서(photoplethysmography sensor) 또는 제1 모션 센서 중 적어도 하나를 포함할 수 있다. 제1 PPG 센서는 사용자로부터 광혈류(이하 PPG라고 한다.) 신호를 측정할 수 있다. 제1 PPG 센서를 포함하는 전자 장치는 PPG 신호를 분석함으로써, 사용자의 심박수(heart rate), 산소 포화도(SPO2), 스트레스, 부정맥, 또는 혈압(blood pressure)등을 포함하는 생체 정보를 획득할 수 있다. 제2 PPG 센서는 제1 PPG 센서과 실질적으로 동일한 기능을 갖는 PPG 센서일 수 있다. 제2 모션 센서은 제1 모션 센서와 실질적으로 동일한 기능을 갖는 모션일 수 있다. PPG 센서는 빛을 방출하는 광 송신부(Light Emitter)(예: LED) 및 광 검출기(Light Detector)(예: 포토다이오 드)를 포함할 수 있다. 광 송신부는 사용자의 피부 속의 조직이나 혈관으로 빛을 방출하고, 광 검출기는 반사된 빛을 수집할 수 있다. 광 검출기에 의하여 수집된 빛은 전기 신호로 변환될 수 있다. 변환된 전기 신호는 PPG 신호로 참조될 수 있다. 전자 장치는 PPG 신호의 파형을 분석함으로써, 심박수 또는 혈압 등의 생체 정보 를 획득할 수 있다. 광 송신부는 전류가 인가되면, 인가된 전류의 세기에 대응되는 세기의 광 신호를 방출할 수 있다. 예를 들어, 광 송신부는 LED(light emitting diode)를 포함할 수 있다. 광 송신부에 인가될 수 있는 최대 전류 값은 광 송 신부의 하드웨어 사양에 따라 결정될 수 있다. 광 검출부는 광 송신부로부터 방출된 광 신호가 외부 객체에 반 사되어, 반사된 광 신호를 수신할 수 있다. 광 검출부는 설정된 게인 값에 따라 수신한 광 신호를 증폭시킬 수 있다. 예를 들어, 광 검출부에 설정될 수 있는 복수의 게인 값은 미리 정해질 수 있다. 광 검출부는 미리 정해 진 복수의 게인 값 중 어느 하나의 게인 값에 따라 수신된 광 신호를 증폭하도록 설정될 수 있다. 제1 모션 센서는 전자 장치가 사용자의 자세 또는 제스처와 전자 장치의 자세를 추정할 수 있도 록 각종의 물리량을 계측할 수 있는 장치일 수 있다. 제1 모션 센서는 제1 가속도 센서, 제1 자이로 센서, 또는 제1 지자계 센서 중 적어도 하나를 포함할 수 있다. 제1 가속도 센서는 전자 장치의 가속도를 센싱할 수 있다. 예를 들어, 제1 는 전자 장치의 가속도를 센싱하여 3 축(예: x, y 및 z 축) 방향의 전자 장치의 가속도 값을 출력할 수 있다. 제1 가속도 센서는 전자 장치의 움직임이 지정된 범위 내인지 또는 지정된 범위를 벗어나는지 여부를 감지할 수 있다. 예를 들어, 제1 가속도 센서는 전자 장치가 설정된 각도 이상의 움직임이 있는지 여부를 판단 할 수 있다. 제1 자이로 센서는 전자 장치의 회전의 변화를 측정할 수 있다. 제1 지자계 센서는 지구 자기장에 대한 전자 장치의 상대적 변위를 측정할 수 있다. 제1 센서 모듈은 복수의 가속도 센 서 및/또는 복수의 자이로 센서를 포함할 수 있다. 사용자는 전자 장치에 포함된 제1 센서 모듈을 이용하여 사용자의 생체 데이터(예: 도 3의 생체 데이 터)를 수집할 수 있다. 외부 전자 장치에 포함된 제2 센서 모듈은 전자 장치에 포함된 제1 센서 모듈과 실질적으로 동일한 기능을 수행할 수 있다. 전자 장치의 프로세서(예: 도 1의 프로세서)는 제1 센서 모듈로 수집된 생체 데이터를 이 용하여 사용자가 현재 오버 트레이닝(over training)에 해당하는지 분석할 수 있다. 오버 트레이닝은 전자 장치 의 사용자가 사용자의 체력 수준 이상으로 과도하게 운동을 수행하는 상태를 포함할 수 있다. 전자 장치의 프로세서는 오버 트레이닝 여부에 따라 사용자에게 운동과 관련된 가이드를 포함하는 메 시지를 출력할 수 있다. 본 문서에서 운동과 관련된 가이드를 포함하는 메시지는 사용자가 오버 트레이닝에 해 당하는지 여부를 사용자에게 알릴 수 있다. 이를 통해 사용자가 오버 트레이닝을 예방할 수 있게 하거나, 또는 사용자가 오버 트레이닝에 이미 해당하는 경우 사용자의 신체 상태에 알맞는 운동을 수행할 수 있도록 사용자에 게 알림, 안내, 및/또는 경고를 제공하는 것을 포함할 수 있다. 운동과 관련된 가이드를 포함하는 메시지는 사용자에게 시각, 청각, 및/또는 촉각적 방법을 통해 출력될 수 있 다. 예를 들어, 운동과 관련된 가이드를 포함하는 메시지는 디스플레이 모듈(예: 도 1의 디스플레이 모듈(16 0))을 통해 시각적으로 출력될 수 있고, 오디오 모듈(예: 도 1의 오디오 모듈)을 통해 청각적으로 출력될 수 있고, 및/또는 햅틱 모듈(예: 도 1의 햅틱 모듈)을 통해 촉각적으로 출력될 수 있다. 상기 예시는 어느 하나의 모듈을 통해 사용자에게 운동과 관련된 가이드를 포함하는 메시지를 제공하는 동작으로 한정하는 것이아니라 복수의 모듈을 이용하여 사용자에게 메시지를 제공하는 동작을 포함하여 설명될 수 있다. 도 3은 일 실시 예에 따른 생체 데이터를 설명하는 도면이다. 생체 데이터에는 운동 데이터, 수면 데 이터, 심박 데이터, 체중 데이터, 또는 음식 데이터 중 적어도 하나가 포함될 수 있다. 생 체 데이터에 대한 내용은 사용자에게 시각, 청각, 및/또는 촉각적 방법을 통해 출력될 수 있다. 예를 들어, 생체 데이터에 대한 내용은 디스플레이 모듈(예: 도 1의 디스플레이 모듈)을 통해 시각적으로 출력될 수 있고, 오디오 모듈(예: 도 1의 오디오 모듈)을 통해 청각적으로 출력될 수 있고, 및/또는 햅틱 모듈(예: 도 1의 햅틱 모듈)을 통해 촉각적으로 출력될 수 있다. 상기 예시는 어느 하나의 모듈을 통해 사 용자에게 생체 데이터에 대한 내용을 제공하는 동작으로 한정하는 것이 아니라 복수의 모듈을 이용하여 사 용자에게 생체 데이터에 대한 내용을 제공하는 동작을 포함하여 설명될 수 있다. 프로세서(예: 도 1의 프로세서)는 사용자가 오버 트레이닝에 해당하는지 여부를 분석하는 날짜 이전, 제1 센서 모듈(예: 도 2의 제1 센서 모듈) 또는 제2 센서 모듈(예: 도 2의 제2 센서 모듈) 중 적어도 하 나를 통해 제1 기간 동안 저장된 생체 데이터를 이용하여 사용자가 오버 트레이닝에 해당하는지 여부에 대 한 분석을 수행할 수 있다. 제1 기간은 사용자가 설정한 기간 또는 시스템 상 기본적으로 설정된 기간일 수 있 다. 예를 들어, 제1 기간은 1주일 이상 1년 이하의 기간일 수 있다. 프로세서는 복수의 종류들의 데이터를 이용하여 사용자가 오버 트레이닝에 해당하는지 여부를 판단할 수 있다. 운동 데이터에는 거리, 지속 시간, 또는 랩 수(lap counting) 중 적어도 하나가 포함될 수 있다. 거리는 운동을 수행한 거리를 의미할 수 있다. 지속 시간은 운동을 수행한 시간을 의미할 수 있다. 랩 수는 운동 시 동작을 여러 번 수행하는 경우, 해당 동작을 수행한 횟수를 의미할 수 있다. 수면 데이터에는 수면 점수, 수면 효율, 수면 등급, 또는 수면 시간 중 적어도 하나 가 포함될 수 있다. 수면 점수는 사용자가 수면에 대해 평가한 점수일 수 있다. 수면 효율은 수면 시 실질 수면 시간을 전체 수면 시간으로 나누어 백분율로 나타낸 데이터일 수 있다. 실질 수면 시간은 전체 수면 시간에서 뒤척임이 발생한 시간, 수면 중 깬 시간, 및/또는 특정 상태 수면 시간을 제외한 시간일 수 있다. 예 를 들어, 특정 상태 수면 시간은 사용자가 렘 수면 상태로 수면을 취하는 시간을 포함할 수 있다. 프로세서 는 제1 센서 모듈 또는 제2 센서 모듈 중 적어도 하나를 이용하여 수면 시 뒤척임이 발생한지 여부 및 수면 시 뒤척임이 발생한 정도를 판단할 수 있다. 수면 등급은 사용자의 수면 시작 시각과 사용자의 수면 종결 시각이 사용자의 목표 수면 시작 시간대와 사 용자의 목표 수면 종결 시간대에 각각 포함되는지 및/또는 수면 시간이 목표 수면 시간을 충족 했는지를 기준으로 결정될 수 있다. 목표 수면 시작 시간대는 사용자가 설정한 목표 수면 시작 시각의 전후로 임계 시간 이 더해진 시간대로 설정될 수 있다. 목표 수면 종결 시간대는 사용자가 설정한 목표 수면 종결 시각의 전후로 임계 시간이 더해진 시간대로 설정될 수 있다. 예를 들어, 프로세서는 사용자의 수면 시작 시각과 사용자의 수면 종결 시각이 사용자의 목표 수면 시작 시간대와 사용자의 목표 수면 종결 시간대에 각각 포함되는지를 기준으로 임시 등급을 도출할 수 있다. 임시 등 급이 수면 등급으로 결정될 수 있는 최대 등급의 값이 아닌 경우, 프로세서는 사용자가 수면을 취한 시간이 목표 수면 시간을 충족한다면 임시 등급의 값보다 증가한 값을 수면 등급으로 결정할 수 있다. 목 표 수면 시간은 사용자의 수면 종결 시각에서 수면 시작 시각을 뺀 시간일 수 있다. 예를 들어, 사용자가 목표 수면 시작 시각을 11:00 PM으로 설정하고 사용자가 목표 수면 종결 시각을 07:00 AM 으로 설정한 경우, 목표 수면 시작 시간대는 목표 수면 시작 시각의 전후 30분으로 설정된 10:30 PM에서 11:30 PM으로 설정될 수 있고, 목표 수면 종결 시간대는 목표 수면 종결 시각의 전후 30분으로 설정된 06:30 AM에서 07:30 AM으로 설정될 수 있다. 수면 등급은 복수의 단계로 구분될 수 있다. 예를 들어, 수면 등급은 1단계(Poor), 2단계(Fair), 또 는 3단계(Good)로 구분될 수 있다. 사용자의 수면 시작 시각 및 사용자의 수면 종결 시각이 각각 목표 수면 시 작 시간대 및 목표 수면 종결 시간대에 포함되지 않은 경우, 프로세서는 수면 등급을 1단계(Poor)로 판단할 수 있다. 예를 들어, 사용자의 수면 시작 시각이 11:50 PM이고 사용자의 수면 종결 시각이 08:00 AM인 경우, 각각 목표 수면 시작 시간대인 10:30 PM부터 11:30 PM까지 및 목표 수면 종결 시간대인 06:30 AM 부터07:30 AM까지에 포함되지 않으므로, 프로세서는 수면 등급을 1단계(Poor)로 판단할 수 있다. 사용자의 수면 시작 시각이 목표 수면 시작 시간대에 포함되고 수면 종결 시각이 목표 수면 종결 시간대에 포함 되지 않는 경우 또는 사용자의 수면 시작 시간은 목표 수면 시작 시간대에 포함되지 않으나 사용자의 수면 종결 시각이 목표 수면 종결 시간대에 포함된 경우, 프로세서는 수면 등급을 2단계(Fair)로 판단할 수 있 다. 예를 들어, 사용자의 수면 시작 시각이 11:20 PM이고 사용자의 수면 종결 시각이 08:00 AM인 경우, 사용자 수면 시작 시간은 목표 수면 시작 시간대인 10:30 PM부터 11:30 PM까지에 포함되지만, 사용자의 수면 종결 시각 은 목표 수면 종결 시간대인 06:30 AM 부터 07:30 AM까지에 포함되지 않으므로, 프로세서는 수면 등급 을 2단계(Fair)로 판단할 수 있다. 사용자의 수면 시작 시각이 목표 수면 시작 시간대에 포함되고 사용자의 수면 종결 시각이 목표 수면 종결 시간 대에 포함되는 경우, 프로세서는 수면 등급을 3단계(Good)로 판단할 수 있다. 예를 들어, 사용자의 수면 시작 시각이 11:20 PM이고 사용자의 수면 종결 시각이 07:20 AM인 경우, 사용자 수면 시작 시간이 목표 수 면 시작 시간대인 10:30 PM부터 11:30 PM까지에 포함되고, 사용자의 수면 종결 시각 또한 목표 수면 종결 시간 대인 06:30 AM 부터 07:30 AM까지에 포함되므로, 프로세서는 수면 등급을 3단계(Good)로 판단할 수 있다. 심박 데이터에는 운동 심박수, 기상 심박수 중 적어도 하나가 포함될 수 있다. 운동 심박수 는 운동을 지속하는 시간 동안 측정된 심장 박동 수의 평균 값을 나타낼 수 있다. 기상 심박수는 운 동을 수행한 다음 날의 기상 시각부터 제1 임계 시간 동안 측정된 심장 박동 수의 평균 값을 나타낼 수 있다. 제1 임계 시간은 사용자가 설정한 시간 또는 시스템 상 기 설정된 시간을 의미할 수 있다. 예를 들어, 제1 임계 시간은 1시간일 수 있다. 체중 데이터에는 체중 및/또는 BIA(Bioelectric Impedance Analysis) 중 적어도 하나가 포함될 수 있다. 체중은 운동을 수행한 다음 날의 기상 시각부터 제1 임계 시간 내에 측정된 체중의 값과 대응 될 수 있다. 측정된 체중의 값은 사용자로부터 직접 전자 장치에 입력되거나, 또는 전자 장치와 무선 통신으로 연결된 체중계로부터 값을 수신 받을 수 있다. BIA는 사용자의 체지방과 근육량을 측정할 수 있 는 생체 전기 임피던스 분석을 포함할 수 있다. 음식 데이터에는 단백질 데이터 및/또는 탄수화물 데이터 가 포함될 수 있다. 단백질 데이터 는 오버 트레이닝 분석의 대상이 되는 날에 사용자가 섭취한 단백질 섭취량과 대응될 수 있다. 탄수화물 데이터는 오버 트레이닝 분석의 대상이 되는 날에 사용자가 섭취한 탄수화물 섭취량과 대응될 수 있다. 탄수화물 섭취량 및/또는 단백질 섭취량은 사용자가 전자 장치에 직접 오버 트레이닝 분석의 대상이 되는 날짜에 섭취한 음식을 기입하여 측정될 수 있다. 탄수화물 섭취량 또는 단백질 섭취량은 오버 트레이닝 분석의 대상이 되는 날짜에 사용자의 식단의 예정된 경우, 예정된 식단으로 섭취할 수 있는 탄수화물 또는 단백질과 각 각 대응될 수 있다. 예정된 식단은 서버(예: 도 1의 서버)에 저장된 식단과 연동될 수 있다. 예를 들어, 예정된 식단은 식사 제공 업체의 서버에 저장된 취식 내역 또는 식단표와 연동될 수 있다. 다른 예로, 예정된 식단은 사용자가 서버에 저장한 식단표일 수 있다. 도 4는 일 실시 예에 따른 운동 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 프로세서(예: 도 1의 프 로세서)는 동작 410에서, 제1 거리가 평균 거리보다 제1 범위 내의 비율 이상 길면 거리(예: 도 3의 거리 )가 불규칙하다고 판단할 수 있다. 제1 거리는 오버 트레이닝 분석의 대상이 되는 운동에서 측정된 운동 거리를 의미할 수 있다. 운동 거리는 통신 모듈(예: 도 1의 통신 모듈)을 이용하여 측정될 수 있다. 예를 들어, 운동 거리는 GNSS(Global Navigation Satellite system) 통신 모듈을 이용하여 위치 측위 방식을 통해 측정될 수 있다. 평균 거리는 제1 기간(예: 도 3의 제1 기간) 동안 수행한 복수의 운동에서 각각 측정된 거리 들의 평균 값과 대응될 수 있다. 제1 범위는 사용자가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응 될 수 있다. 예를 들어, 제1 범위는 10%에서 40%로 설정될 수 있다. 제1 범위 내의 비율은 제1 범위에 포함된 값을 의미할 수 있다. 예를 들어 동작 410에서 평균 거리와 제1 거리를 비교하는데 사용된 제1 범위 내의 비율 은 20%로 설정될 수 있다. 프로세서는 동작 420에서, 제1 지속 시간이 평균 지속 시간보다 제1 범위 내의 비율 이상 길면 지속 시간 (예: 도 3의 지속 시간)이 불규칙하다고 판단할 수 있다. 제1 지속 시간은 오버 트레이닝 분석의 대상이 되는 운동에서 측정된 사용자가 운동한 시간일 수 있다. 평균 지속 시간은 제1 기간 동안 수행한 복수의 운동에서 각각 측정된 지속 시간들의 평균 값과 대응될 수 있다. 제1 범위는 사용자가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응될 수 있다. 예를 들어, 제1 범위는 10%에서 40%로 설정될 수 있다. 제1 범위 내의 비 율은 제1 범위에 포함된 값을 의미할 수 있다. 예를 들어, 동작 420에서 제1 지속 시간과 평균 지속 시간을 비 교하는데 사용된 제1 범위 내의 비율은 25%로 설정될 수 있다. 프로세서는 동작 430에서, 제1 랩 수가 평균 랩 수보다 제1 범위 내의 비율 이상 많으면 랩 수(예: 도 3의 랩 수)가 불규칙하다고 판단할 수 있다. 제1 랩 수는 오버 트레이닝 분석의 대상이 되는 운동에서 사용자 가 운동한 랩 수를 의미할 수 있다. 평균 랩 수는 제1 기간 동안 사용자가 수행한 복수의 운동에서 각각 측정된 랩 수의 평균 값과 대응될 수 있다. 제1 범위는 사용자가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응될 수 있다. 예를 들어, 제1 범위는 10%에서 40%로 설정될 수 있다. 제1 범위 내의 비율은 제1 범위에 포함 된 값을 의미할 수 있다. 예를 들어, 동작 430에서 제1 랩 수와 평균 랩 수를 비교하는데 사용된 제1 범위 내의 비율은 30%로 설정될 수 있다. 프로세서는 동작 440에서, 운동 데이터(예: 도 3의 운동 데이터)의 지정된 조건이 성립된 지 판단할 수 있다. 프로세서는 동작 410의 거리, 동작 420의 지속 시간, 또는 동작 430 랩 수 중 적어도 하나를 불규칙하다고 판단하는 경우, 운동 데이터의 지정된 조건이 성립한다고 판단할 수 있다. 프 로세서는 동작 410, 동작 420, 및 동작 430을 병렬적으로 각각 판단할 수 있다. 도 5a는 일 실시 예에 따른 수면 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 프로세서(예: 도 1의 프로세서)는 동작 510에서, 제1 수면 점수가 평균 수면 점수보다 제2 범위 내의 임계치 이상 감소하면 수 면 점수(예: 도 3의 수면 점수)가 불규칙하다고 판단할 수 있다. 제1 수면 점수는 오버 트레이닝 분석의 대상이 되는 수면에 대해 사용자가 입력한 수면 점수일 수 있다. 평균 수면 점수는 제1 기간(예: 도 3의 제1 기간) 동안 복수의 수면에 대해 각각 입력된 수면 점수들의 평균 값과 대응될 수 있다. 제2 범위는 사 용자가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응될 수 있다. 예를 들어, 제2 범위는 1에서 4일 수 있 다. 제2 범위 내의 임계치는 제2 범위에 포함된 값을 의미할 수 있다. 예를 들어, 동작 510에서 제1 수면 점수 와 평균 수면 점수를 비교하는데 사용된 임계치는 2 일 수 있다. 프로세서는 동작 520에서, 제1 수면 효율이 평균 수면 효율의 제4 범위 내의 비율 이하로 감소하면 수면 효율(예: 도 3의 수면 효율)이 불규칙하다고 판단할 수 있다. 제1 수면 효율은 오버 트레이닝 분석의 대상 이 되는 수면에서 측정된 수면 효율을 의미할 수 있다. 평균 수면 효율은 제1 기간 동안의 복수의 수면에 서 각각 측정된 수면 효율들의 평균 값과 대응될 수 있다. 제4 범위는 사용자가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응될 수 있다. 예를 들어, 제4 범위는 80%이상 95%일 수 있다. 제4 범위 내의 비율은 제 4 범위에 포함된 값을 의미할 수 있다. 예를 들어, 동작 520에서 제1 수면 효율과 평균 수면 효율을 비교하는데 사용된 제4 범위 내의 비율은 90%일 수 있다. 프로세서는 동작 530에서, 제1 수면 등급이 평균 수면 등급보다 제3 범위 내의 임계치 이상 감소하면 수면 등급(예: 도 3의 수면 등급)이 불규칙하다고 판단할 수 있다. 제1 수면 등급은 오버 트레이닝 분석의 대상 이 되는 수면에서 측정된 수면 등급일 수 있다. 평균 수면 등급은 제1 기간 동안 복수의 수면에서 각각 측 정된 수면 등급들의 평균 값과 대응될 수 있다. 제3 범위는 사용자가 설정한 범위 또는 시스템 상 기 설정 된 범위와 대응될 수 있다. 예를 들어, 제3 범위는 1 이상 2 이하일 수 있다. 제3 범위 내의 임계치는 제3 범위 에 포함된 값을 의미할 수 있다. 예를 들어, 동작 530에서 제1 수면 등급과 평균 수면 등급을 비교하는데 사용 된 임계치는 1일 수 있다. 프로세서는 동작 540에서, 제1 수면 시간이 평균 수면 시간의 제4 범위(예: 동작 520의 제4 범위) 내의 비 율 이하로 감소하면 수면 시간(예: 도 3의 수면 시간)이 불규칙하다고 판단할 수 있다. 제1 수면 시간은 오버 트레이닝 분석의 대상이 되는 수면에 대해 측정된 수면 시간을 의미할 수 있다. 평균 수면 시간은 제 1 기간 동안의 복수의 수면에서 각각 측정된 수면 시간들의 평균 값과 대응될 수 있다. 제4 범위는 사용자 가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응될 수 있다. 예를 들어, 제4 범위는 80%이상 95%이하일 수 있다. 제4 범위 내의 비율은 제4 범위에 포함된 값을 의미할 수 있다. 예를 들어, 동작 540에서 제1 수면 시 간과 평균 수면 시간을 비교하는데 사용된 제4 범위 내의 비율은 90%일 수 있다. 프로세서가 동작 510의 수면 점수, 동작 520의 수면 효율, 동작 530의 수면 등급, 동작 540의 수면 시간 중 적어도 하나를 불규칙하다고 판단하는 경우, 프로세서는 동작 550에서 수면 데이터(예: 도 3의 수면 데이터)의 지정된 조건이 성립한다고 판단할 수 있다. 프로세서는 동작 510, 동 작 520, 동작 530, 및 동작 540을 병렬적으로 각각 판단할 수 있다. 도 5b는 일 실시 예에 따른 수면 데이터에 대한 예시 도면이다. 도 5b를 참조하면, 전자 장치(예: 도 1의 전자 장치)는 수면 데이터에 대한 정보를 디스플레이 모듈(예: 도 1의 디스플레이 모듈), 오디오 모듈(예: 도 1의 오디오 모듈), 및/또는 햅틱 모듈(예: 도 1의 햅틱 모듈)을 통해 사용자에게 전달할 수 있다. 예를 들어, 전자 장치는 디스플레이 모듈을 통해 수면 데이터에 대한 정보를 표시할 수 있다. 다른 예로, 전자 장치는 수면 데이터에 대한 정보를 디스플레이 모듈에 표시함과 동시에 오디오 모듈(17 0)을 통해 소리로 출력할 수 있다. 또 다른 예로, 전자 장치는 수면 데이터에 대한 정보를 디스플레이 모 듈에 표시함과 동시에 햅틱 모듈을 통해 진동으로 사용자에게 전달할 수 있다. 수면 점수에 대한 정보를 제공하는 디스플레이 모듈에는 점수를 나타낼 수 있는 기호, 문자, 및/또는 도형이 포함될 수 있다. 예를 들어, 수면 점수는 별 도형을 이용하여 표현될 수 있다. 다른 예로, 수면 점 수는 숫자를 이용하여 표현될 수 있다. 수면 효율에 대한 정보를 제공하는 화면에는 수면 효율, 실질 수면 시간, 및/또는 총 수면 시간에 대한 정보가 포함될 수 있다. 수면 등급에 대한 정보를 제공하는 화면에는 날짜 별 수면 등급이 포함될 수 있다. 날짜 별 수면 등 급은, 날짜 별로 수면 시작 시각부터 수면 종결 시각까지의 시간대와 대응되는 막대 도형, 수면 시작 시각 의 표시 선, 및/또는 수면 종결 시각의 표시 선을 이용하여 제공될 수 있다. 수면 등급은 막대 도형의 형 태, 색, 및/또는 무늬와 같은 식별 요소에 기반하여 날짜 별로 표현될 수 있다. 예를 들어, 수면 등급이 1단계(Poor)인 경우, 막대 도형은 제1색으로 표현될 수 있다. 수면 등급이 2 단계(Fair)인 경우, 막대 도형은 제1 색과 시각적으로 구별 가능한 제2 색으로 표현될 수 있다. 수면 등급(32 5)이 3단계(Good)인 경우, 막대 도형은 제1 색 및 제2 색과 각각 시각적으로 구별 가능한 제3 색으로 표현될 수 있다. 다른 예로, 수면 등급이 3단계(Good)인 경우, 막대 도형은 제2 색으로 표현됨과 동시에 수면 등급 이 2단계(Fair)인 경우와 구별 가능한 식별 요소가 사용되어 표현될 수 있다. 수면 시간에 대한 정보를 제공하는 화면에는 실질 수면 시간, 수면 효율, 및/또는 수면의 깊이와 같 은 수면과 관련된 정보가 포함될 수 있다. 수면의 깊이는 복수의 단계로 구분될 수 있다. 예를 들어, 수면 중 깸, 렘 수면, 얕은 수면, 또는 깊은 수면과 같이 수면의 깊이는 네 단계로 구분될 수 있다. 수면의 깊이는 제1 센서 모듈 및/또는 제2 센서 모듈을 통해 측정될 수 있다. 예를 들어, 수면의 깊이는 제1 센서 모듈 에 포함된 제1 가속도 센서(예: 도 2의 제1 가속도 센서)를 통해 사용자가 수면 중 움직이는 정도에 기반하여 측정될 수 있다. 수면의 깊이는 시간에 따른 수면 깊이에 대한 그래프로 표현될 수 있다. 예를 들어, 수면의 깊이는 시간에 따른 꺾은 선 그래프로 표현될 수 있다. 도 6은 일 실시 예에 따른 심박 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 프로세서(예: 도 1의 프 로세서)는 동작 610에서, 제1 심박수가 제1 평균 심박수의 제5 범위 내의 비율 이상 감소하면 운동 심박수 (예: 도 3의 운동 심박수)가 불규칙하다고 판단할 수 있다. 제1 심박수는 오버 트레이닝 분석의 대상이 되 는 운동 시 측정된 평균 심장 박동 수일 수 있다. 제1 평균 심박수는 제1 기간(예: 도 3의 제1 기간) 동안 복수의 운동에 대해 각각 측정된 운동 심박수들의 평균 값과 대응될 수 있다. 제5 범위는 사용자가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응될 수 있다. 예를 들어, 제5 범위는 5%에서 30%일 수 있다. 제5 범위 내의 비율은 제5 범위에 포함된 값을 의미할 수 있다. 예를 들어, 제1 심박수와 제1 평균 심박수를 비교하는데 사용된 제5 범위 내의 비율은 20%일 수 있다. 프로세서는 동작 620에서, 제2 심박수가 제2 평균 심박수의 제5 범위 내의 비율 이상 감소하면 기상 심박 수(예: 도 3의 기상 심박수)가 불규칙하다고 판단할 수 있다. 제2 심박수는 오버 트레이닝 분석의 대상이 되는 운동을 수행한 다음날의 기상 시각부터 제1 임계 시간 동안 측정된 평균 심장 박동 수일 수 있다. 예를 들 어, 오버 트레이닝 분석의 대상이 되는 운동을 수행한 날짜가 2월 2일인 경우, 제2 심박수는 2월 3일 사용자의 기상 시각부터 1시간 동안 측정된 평균 심장 박동수 일 수 있다. 제2 평균 심박수는 제1 기간 동안 복수의 운동들의 다음날에 각각 측정된 기상 심박수들의 평균 값과 대응 될 수 있다. 제5 범위는 사용자가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응될 수 있다. 예를 들어,제5 범위는 5%이상 30%이하일 수 있다. 제5 범위 내의 비율은 제5 범위에 포함된 값을 의미할 수 있다. 예를 들 어, 제2 심박수와 제2 평균 심박수를 비교하는데 사용된 제5 범위 내의 비율은 20%일 수 있다. 동작 610의 운동 심박수 또는 동작 620의 기상 심박수 중 적어도 하나를 불규칙하다고 판단한 경우, 프로세서는 동작 630에서 심박 데이터(예: 도 3의 심박 데이터)의 지정된 조건이 성립하는 것으로 판 단할 수 있다. 프로세서는 동작 610 및 동작 620을 병렬적으로 각각 판단할 수 있다. 도 7은 일 실시 예에 따른 체중 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 프로세서(예: 도 1의 프 로세서)는 동작 710에서, 제1 체중이 평균 체중의 제6 범위 내의 비율 이하면 체중(예: 도 3의 체중(34 1))이 불규칙하다고 판단할 수 있다. 제1 체중은 오버 트레이닝 분석의 대상이 되는 운동을 수행한 다음날의 기 상 시각부터 제1 임계 시간 내에 측정된 체중일 수 있다. 평균 체중은 제1 기간 동안 각각 측정된 체중 들의 평균 값과 대응될 수 있다. 제6 범위는 사용자가 설정한 범위 또는 시스템 상 기 설정된 범위와 대응될 수 있다. 예를 들어, 제6 범위는 95%이상 100%이하일 수 있다. 제6 범위 내의 비율은 제6 범위에 포함된 값을 의미할 수 있다. 예를 들어, 동작 710에서 제1 체중과 평균 체중을 비교하는데 사용된 제6 범위 내의 비율은 98%일 수 있다. 동작 710의 체중 이 불규칙하다고 판단한 경우, 프로세서는 동작 720에서 체중 데이터(예: 도 3의 체중 데이터) 의 지정된 조건이 성립하는 것으로 판단할 수 있다. 도 8은 일 실시 예에 따른 음식 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 프로세서(예: 도 1의 프 로세서)는 동작 810에서, 탄수화물 섭취량이 일일 탄수화물 권장 섭취량 미만이면 탄수화물 데이터(예: 도 3의 탄수화물 데이터)가 불규칙하다고 판단할 수 있다. 탄수화물 섭취량은 오버 트레이닝 분석의 대상이 되는 운동을 수행한 날에 사용자가 하루 동안 섭취한 탄수화물을 나타낼 수 있다. 일일 탄수화물 권장 섭취량을 결정하는 데에 있어 사용자의 탄수화물 소모량과 관련된 정보가 고려될 수 있다. 예를 들어, 일일 탄수화물 권 장 섭취량을 결정하는 데에 있어, 사용자의 키, 체중(예: 도 3의 체중), 나이, 운동 강도, 및/또는 운동 빈도가 고려될 수 있다. 프로세서는 동작 820에서, 단백질 섭취량이 일일 단백질 권장 섭취량 미만이면 단백질 데이터(예: 도 3의 단백질 데이터)가 불규칙하다고 판단할 수 있다. 단백질 섭취량은 오버 트레이닝 분석의 대상이 되는 운동 을 수행한 날에 사용자가 하루 동안 섭취한 단백질을 나타낼 수 있다. 일일 단백질 권장 섭취량을 결정하는 데 에 있어 사용자의 단백질 소모량과 관련된 정보가 고려될 수 있다. 예를 들어, 일일 단백질 권장 섭취량을 결정 하는 데에 있어, 사용자의 키, 체중, 나이, 운동 강도, 및/또는 운동 빈도가 고려될 수 있다. 프로세서가 동작 810의 탄수화물 섭취 또는 동작 820의 단백질 섭취 중 적어도 하나를 불규칙하다고 판단 한 경우, 프로세서는 동작 830에서 음식 데이터(예: 도 3의 음식 데이터)의 지정된 조건이 성립된 것으로 판단할 수 있다. 프로세서는 동작 810 및 동작 820을 병렬적으로 각각 판단할 수 있다. 도 9는 일 실시 예에 따른 운동 데이터의 지정된 조건 성립 여부에 따라 다른 분석을 수행하는 것을 설명하는 도면이다. 프로세서(예: 도 1의 프로세서)는 동작 910에서, 스코어(Score)를 0으로 설정할 수 있다. 스코 어는 복수의 종류들의 생체 데이터(예: 도 3의 생체 데이터)에 포함된 데이터 중 지정된 조건에 해당하는 데이터의 수와 대응될 수 있다. 프로세서는 동작 920에서, 운동 데이터(예: 도 3의 운동 데이터)의 지정된 조건이 성립하는지 판단할 수 있다. 운동 데이터의 지정된 조건이 성립하지 않는 경우(동작 920 - No), 프로세서는 동작 930에서 제1 분석을 수행할 수 있다. 운동 데이터의 지정된 조건이 성립하는 경우(동작 920 - Yes), 프로세서는 동작 940에서 제2 분석을 수행할 수 있다. 본 실시 예에 따르면, 프로세서는 운동 데이터의 지정된 조건이 성립한다고 판단하는 경우에만 제2 분석을 통해 동작 1115에서 음식 데이터의 지정된 조건이 성립하는지 판단할 수 있다. 이를 통해 운동 데 이터가 지정된 조건에 해당하는지 여부와 무관하게 항상 음식 데이터의 지정된 조건 해당 여부를 파 악 하는 것이 아니라, 운동 데이터이 지정된 조건에 해당하는 경우에만 음식 데이터가 지정된 조건에 해당하는지 여부를 판단하기 때문에 리소스의 낭비를 방지할 수 있다. 또한 프로세서는 운동 데이터 가 지정된 조건에 해당하는 경우에 음식 데이터까지 지정된 조건에 해당하는지 판단함으로써, 사용자가 오버 트레이닝에 해당하는지 여부를 다양한 데이터를 통해 더 정확하게 판단할 수 있고, 사용자에게 더 구체적인 운동과 관련된 가이드를 지시할 수 있다. 도 10은 일 실시 예에 따른 제1 분석을 설명하는 도면이다. 프로세서(예: 도 1의 프로세서)는 도 9의 동작 930에 해당하는 경우 제1 분석을 수행할 수 있다. 프로세서는 동작 1001에서 수면 데이터(예: 도 3의 수면 데이터)의 지정된 조건이 성립한 지 판단할 수 있다. 수면 데이터의 지정된 조건이 성립하는 경우(동 작 1001 - Yes), 프로세서는 동작 1003에서 스코어의 값을 1 증가시킬 수 있다. 수면 데이터의 지정된 조건이 성립하지 않는 경우(동작 1001 - No), 프로세서는 동작 1005에서 심박 데이터(예: 도 3의 심박 데이터)의 지정된 조건이 성립하는지 판단할 수 있다. 심박 데이터의 지정된 조건이 성립하는 경우(동작 1005 - Yes), 프로세서는 동작 1007에서 스코어의 값을 1 증가시킬 수 있다. 심박 데이터의 지정된 조건이 성립하지 않는 경우(동작 1005 - No), 프로세서는 동작 1009에서 체중 데이터(예: 도 3의 체중 데이터)의 지정된 조건이 성립하는지 판단할 수 있다. 체중 데이터의 지정된 조건이 성립하는 경우(동작 1009 -Yes), 프로세서는 동작 1011에서 스코어의 값을 1 증가시킬 수 있다. 체중 데이터의 지정된 조건이 성립하지 않는 경우(동작 1009 - No), 프로세서는 동작 1013에서 스코 어의 값을 제1 스코어에 대입할 수 있다. 프로세서는 동작 1015에서, 운동과 관련된 가이드를 제공할 수 있다. 운동과 관련된 가이드는 제1 스코어 의 값과 동작 920, 동작 1001, 동작1005, 동작1009에서 지정된 조건이 성립한 데이터의 종류에 기반하여 이루어 질 수 있다. 도 11은 일 실시 예에 따른 제2 분석을 설명하는 도면이다. 프로세서(예: 도 1의 프로세서)는 도 9의 동작 940에 해당하는 경우, 제2 분석을 수행할 수 있다. 프로세서는 동작 1101에서 스코어의 값을 1 증가시킬 수 있다. 프로세서는 동작 1103에서 수면 데이터(예: 도 3의 수면 데이터)의 지정된 조건이 성립한 지 판단할 수 있다. 수면 데이터의 지정된 조건이 성립하는 경우(동작 1103 - Yes), 프로세서는 동작 1105에서 스코어의 값을 1 증가시킬 수 있다. 수면 데이터의 지정된 조건이 성립하지 않는 경우(동작 1103 - No), 프로세서는 동작 1107에서 심박 데이터(예: 도 3의 심박 데이터)의 지정된 조건이 성립하는지 판단할 수 있다. 심박 데이터의 지정된 조건이 성립하는 경우(동작 1107 - Yes), 프로세서는 동작 1109에서 스코어의 값을 1 증가시킬 수 있다. 심박 데이터의 지정된 조건이 성립하지 않는 경우(동작 1107 - No), 프로세서는 동작 1111에서 체중 데이터(예: 도 3의 체중 데이터)의 지정된 조건이 성립하는지 판단할 수 있다. 체중 데이터의 지정된 조건이 성립하는 경우(동작 1111 -Yes), 프로세서는 동작 1113에서 스코어의 값을 1 증가시킬 수 있다. 체중 데이터의 지정된 조건이 성립하지 않는 경우(동작 1111 - No), 프로세서는 동작 1115에서 음식 데이터(예: 도 3의 음식 데이터)의 지정된 조건이 성립하는지 판단할 수 있다. 음식 데이터의 지정된 조건이 성립하는 경우(동작 1115 - Yes), 프로세서는 동작 1117에서 스코어의 값을 1 증가시킬 수 있다. 음식 데이터의 지정된 조건이 성립하지 않는 경우(동작 1115 - No), 프로세서는 동작 1119에서 스코 어의 값을 제2 스코어에 대입할 수 있다. 프로세서는 동작 1121에서, 운동과 관련된 가이드를 제공할 수 있다. 운동과 관련된 가이드는 제2 스코어의 값과 동작 920, 동작 1103, 동작 1107, 동작 1111, 동작 1115에서 지정된 조건이 성립한 데이터의 종류에 기반하여 이루어질 수 있다. 도 12는 일 실시 예에 따른 운동과 관련된 가이드를 포함하는 메시지에 대한 예시를 설명하는 도면이다. 운동과 관련된 가이드는 전자 장치(예: 도 1의 전자 장치)의 음향 출력 모듈(예: 도 1의 음향 출력 모듈), 오디오 모듈(예: 도 1의 오디오 모듈), 햅틱 모듈(예: 도 1의 햅틱 모듈), 및/또는 디스플레이 모듈 (예: 도 1의 디스플레이 모듈)에 포함된 알림 영역 상에서 제공될 수 있다. 운동과 관련된 가이드는 동작 920에서 운동 데이터(예: 도 3의 운동 데이터)의 지정된 조건이 성립하지 않는 경우 동작 1015의 운동과 관련된 가이드와 대응되고, 동작 920에서 운동 데이터의 지정된 조건이 성립하는 경우 동작 1121의 운동과 관련된 가이드와 대응될 수 있다. 운동과 관련된 가이드가 동작 1015의 운동과 관련된 가이드와 대응되는 경우 동작 1019의 제1 스코어에 기반하 여 가이드가 제공되고, 운동과 관련된 가이드가 동작 1121의 운동과 관련된 가이드와 대응되는 경우 동작 1119 의 제2 스코어에 기반하여 가이드가 제공될 수 있다. 운동과 관련된 가이드는 스코어에 따라 가이드의 강도가 달라질 수 있다. 프로세서(예: 도 1의 프로세서)는 지정된 조건이 성립한 데이터에 대한 설명과 함께 가이 드를 제공할 수 있다. 스코어가 1인 경우, 프로세서는 제1 강도를 갖는 운동과 관련된 가이드를 제공할 수 있다. 스코어가 1인 경우, 프로세서는 지정된 조건이 성립한 데이터에 대한 설명과 함께 “무리한 운동을 하셨는지 생각해보세 요” 또는 “오늘은 가볍게 운동해 보세요”와 같은 가이드를 제공할 수 있다. 예를 들어, 제1 알림과 같이 생 체 데이터(예: 도 3의 생체 데이터) 중 운동 데이터의 지정된 조건만 성립하는 경우, 프로세서 는 지속 시간(예: 도 3의 지속 시간)이 평균 지속 시간보다 30% 증가했다는 설명과 함께 “무리한 운동을 하셨는지 생각해보세요.”와 같은 가이드를 제공할 수 있다. 스코어가 2인 경우, 프로세서는 제1 강도보다 높은 제2 강도를 갖는 가운동과 관련된 가이드를 제공할 수 있다. 스코어가 2인 경우, 프로세서는 지정된 조건이 성립한 데이터에 대한 설명과 함께 “무리한 운동을 한 것 같습니다” 또는 “오늘은 가볍게 운동해 보세요”와 같은 가이드를 제공할 수 있다. 스코어가 3인 경우, 프로세서는 제2 강도보다 높은 제3 강도를 갖는 운동과 관련된 가이드를 제공할 수 있 다. 스코어가 3인 경우 프로세서는 지정된 조건이 성립한 데이터에 대한 설명과 함께 “무리한 운동을 한 것 같습니다. 휴식이 필요해 보입니다.”와 같은 가이드를 제공할 수 있다. 예를 들어, 제2 알림과 같이 생체 데이터 중 운동 데이터, 수면 데이터(예: 도 3의 수면 데이터), 및 체중 데이터(예: 도 3의 체 중 데이터)의 지정된 조건 성립하는 경우, 프로세서는 거리(예: 도 3의 거리)가 평균 거리보다 20% 증가했고, 수면 시간(예: 도 3의 수면 시간)이 평균 수면 시간보다 12% 감소했으며 체중(예: 도 3의 체중)이 평균 체중보다 3% 감소했다는 설명과 함께 “무리한 운동을 한 것 같습니다. 휴식이 필요해 보입 니다.”와 같은 가이드를 제공할 수 있다. 스코어가 4인 경우, 프로세서는 제3 강도보다 높은 제4 강도를 갖는 운동과 관련된 가이드를 제공할 수 있 다. 스코어가 4인 경우, 프로세서는 지정된 조건이 성립한 데이터에 대한 설명과 함께 “오늘은 운동을 하 지 말아주세요. 3일 동안 휴식을 하고 신체를 회복해 주세요.”와 같은 가이드를 제공할 수 있다. 스코어가 5인 경우, 프로세서는 제4 강도보다 높은 제5 강도를 갖는 운동과 관련된 가이드를 제공할 수 있 다. 스코어가 5인 경우, 프로세서는 지정된 조건이 성립한 데이터에 대한 설명과 함께 “오늘 운동을 절대 하지 말아주세요. 충분한 회복없이 운동을 한다면 부상이 발생할 수 있습니다”와 같은 가이드를 제공할 수 있 다. 예를 들어, 제3 알림과 같이 생체 데이터 중 운동 데이터, 수면 데이터, 심박 데이터(예: 도 3의 심박 데이터), 체중 데이터, 및 음식 데이터(예: 도 3의 음식 데이터) 각각의 지정된 조 건 성립하는 경우, 프로세서는 랩 수(예: 도 3의 랩 수)가 평균 랩 수보다 30% 증가했고 수면 효율 (예: 도 3의 수면 효율)이 평균 수면 효율보다 7%가 감소했으며 운동 심박수가(예: 도 3의 운동 심박수 ) 제1 평균 심박수보다 20%가 증가했고 체중이 평균 체중보다 3% 감소했으며 단백질 섭취량 및 탄수 화물 섭취량 모두 섭취 부족이라는 설명과 함께 “오늘 운동을 절대 하지 말아주세요. 충분한 회복없이 운동을 한다면 부상이 발생할 수 있습니다”와 같은 가이드를 제공할 수 있다. 본 실시 예에 따르면, 사용자가 오버 트레이닝을 인지하지 못하고 지속적인 운동을 하여 운동 효과가 떨어지거 나 부상을 입는 것을 방지할 수 있다. 나아가, 신체 능력에 맞지 않는 운동을 수행하고 있는 경우, 사용자에게 알맞은 운동 방법 및 휴식을 권장하여 올바른 운동을 수행하도록 유도할 수 있다. 도 13은 일 실시 예에 따른 각 동작 과정을 설명하는 도면이다. 프로세서(예: 도 1의 프로세서)는 동작 1310에서 복수의 종류들의 생체 데이터(예: 도 3의 생체 데이터 )를 수집할 수 있다. 프로세서은 동작 1320에서 복수의 종류들의 생체 데이터 사이의 우선 순위 를 설정할 수 있다. 프로세서는 동작 1330에서 우선 순위에 기반하여 복수의 종류의 생체 데이터 각 각이 지정된 조건에 해당하는지 여부를 판단할 수 있다. 프로세서는 동작 1340에서 지정된 조건에 해당하 는지 여부에 대하여 판단한 결과를 분석하여 오버 트레이닝(over-training)여부를 판단할 수 있다. 프로세서 는 동작 1350에서, 상기 오버 트레이닝 여부에 따라 사용자에게 운동과 관련된 가이드를 포함하는 메시지 를 출력할 수 있다.본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5a 도면5b 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2021-0065741", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 일 실시 예에 따른 센서를 설명하는 도면이다. 도 3은 일 실시 예에 따른 생체 데이터를 설명하는 도면이다. 도 4는 일 실시 예에 따른 운동 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 도 5a는 일 실시 예에 따른 수면 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 도 5b는 일 실시 예에 따른 수면 데이터에 대한 예시 도면이다. 도 6은 일 실시 예에 따른 심박 데이터의 지정된 조건 성립 여부를 설명하는 도면 이다. 도 7은 일 실시 예에 따른 체중 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 도 8은 일 실시 예에 따른 음식 데이터의 지정된 조건 성립 여부를 설명하는 도면이다. 도 9는 일 실시 예에 따른 운동 데이터의 지정된 조건 성립 여부에 따라 다른 분석을 수행하는 것을 설명하는 도면이다. 도 10은 일 실시 예에 따른 제1 분석을 설명하는 도면이다. 도 11은 일 실시 예에 따른 제2 분석을 설명하는 도면이다. 도 12는 일 실시 예에 따른 운동과 관련된 가이드를 포함하는 메시지에 대한 예시를 설명하는 도면이다. 도 13은 일 실시 예에 따른 각 동작 과정을 설명하는 도면이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
