{"patent_id": "10-2018-0075869", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0077145", "출원번호": "10-2018-0075869", "발명의 명칭": "중공구체를 함유하는 새로운 인조 점토 조성물 및 이의 제조방법", "출원인": "주식회사 엠씨에이", "발명자": "조현"}}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인조 점토 조성물로서, 상기 인조 점토 조성물은- 조성물의 총 중량을 기준으로 유리 중공구체 50 내지 95 중량% 및 액상물질 4 내지 50 중량%을 포함하고,- 수용성이고,- 밀도가 0 g/cm3 초과이며 0.6 g/cm3 이하이고,- 건조실험 전후의 밀도 변화가 10 % 이하이고,- 형태변화 실험 전후의 중량 변화가 2 % 이하인 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "인조 점토 조성물로서, 상기 인조 점토 조성물은- 플라스틱 중공구체, 액상물질을 포함하고, 방염제를 더 포함할 수 있으며, 방염제를 제외한 조성물의 총 중량을 기준으로 플라스틱 중공구체 10 내지 65 중량% 및 액상물질 30 내지 80 중량%을 포함하고,- 수용성이고,- 밀도가 0 g/cm3 초과이며 0.6 g/cm3 이하이고,- 건조실험 전후의 밀도 변화가 10 % 이하인 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서, 밀도가 0 g/cm3 초과이며 0.4 g/cm3 이하인 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 밀도가 0 g/cm3 초과이며 0.2 g/cm3 이하인 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 또는 제2항에 있어서, 액상물질은 프로필렌글리콜, 폴리에틸렌글리콜, 폴리비닐알코올, 붕산, 수성 접착제, 고무 접착제, 파라핀, 유동파라핀, 왁스, 글리세린, 젤라틴, 점성 있는 오일, 또는 이들의 혼합물, 또는 이들과 물의 혼합물을 포함하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 유리 중공구체는 밀도가 0 g/cm3 초과이며 0.6 g/cm3 이하인 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 유리 중공구체는 밀도가 0 g/cm3 초과이며 0.4 g/cm3 이하인 것을 특징으로 하는 인조 점토 조성물.공개특허 10-2018-0077145-2-청구항 8 제1항에 있어서, 조성물의 총 중량을 기준으로 응집제를 0 중량% 초과이며 10 중량% 이하로 더 포함하는 것을특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서, 응집제를 더 포함하는 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 또는 제2항에 있어서, 항균물질을 더 포함하는 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 항균물질은 은; 자몽추출물; 알리신을 포함하는 마늘 추출물; 및 녹차추출물로 구성된 군으로부터 선택된 1종 이상인 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 항균물질은 은 이온을 다공성 물질에 담지시킨 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 다공성 물질은 규조토, 제올라이트, 펄라이트 중 어느 하나를 포함하며, 항균물질은 조성물의총 중량(방염제가 사용된 경우 방염제는 제외)을 기준으로 0.5 중량% 이상으로 포함되는 것을 특징으로 하는 인조 점토 조성물."}
{"patent_id": "10-2018-0075869", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "중공구체에 중공구체와 혼합 반죽될 수 있는 액상물질을 혼합한 후 혼합물이 안정된 균일상에 도달할 때까지 충분히 반죽하는 과정을 포함하는 제1항 또는 제2항에 따른 인조 점토 조성물의 제조방법."}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 굳지 않아 오랜 시간 형태가 유지되면서 물 없이 반복적인 조형이 가능한 인조 점토 조성물에 관한 것으로, 특히 물에 용해되어 세척이 용이하며 인체에 대한 안전성이 높고, 가벼우며, 필요에 따라 다시 반복적으로 새로운 조형을 할 수 있고, 형태 유지능이 뛰어나 뭉쳐진 형태 그대로 장시간 동일한 형상을 유지할 수 있고 던 지기와 같은 놀이가 가능한 새로운 인조 점토 조성물 및 이의 제조방법에 관한 것이다."}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 굳지 않아 오랜 시간 형태가 유지되면서 물 없이 반복적인 조형이 가능한 인조 점토 조성물에 관한 것으로, 특히 물에 용해되어 세척이 용이하며 인체에 대한 안전성이 높고, 가벼우며, 필요에 따라 다시 반복적 으로 새로운 조형을 할 수 있고, 형태 유지능이 뛰어나 뭉쳐진 형태 그대로 장시간 동일한 형상을 유지할 수 있 고 던지기와 같은 놀이가 가능한 새로운 인조 점토 조성물 및 이의 제조방법에 관한 것이다."}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "천연 모래나 찰흙을 대신하여 놀이나 교육에 사용될 수 있는 인공 모래 및 점토에 관해 많은 기술이 소개되어 있다. 특허 제231408호에서는 수공예용 조형제 조성물, 특허공개 제2004-361호에서는 점도를 갖는 모래의 제조 방법 및 이러한 모래를 사용한 입체 학습 방법, US 6,235,070호에서는 점성 모래 및 이의 제조방법, 특허 제 598001호에서는 모래 소재 혼합물 및 그의 제조방법, US 5,873,933호에서는 푸석푸석한 흙과 같은 느낌을 갖는 전성(展性)의 놀이재료 혼합물, 특허공개 제2006-11619호에서는 자연경화 및 가압에 의한 향방출형 기능성 인조 점토 등을 기술하고 있다. 이들을 개략적으로 설명하면, 특허 제231408호의 수공예용 조형제 조성물은 물, 소금, 밀가루, 전분, 돌가루, 황산알루미늄, 기름, 붕사, 염화마그네슘, 안식향산나트륨, 산화티탄 및 염료를 적정배합비율에 따라 배합하고 교반 및 가열한 후 성형시킨 것으로, 적은 양의 물로 반죽을 용이하게 할 수 있고, 동결과 부패의 방지 및 수분 유지가 가능하며, 밀가루와 전분 등에 의해 촉감이 좋은 등의 장점이 있다. 특허공개 제2004-361호의 점도를 갖는 모래는 가해지는 힘의 정도에 따라 조형 및 분산을 반복할 수 있는 모래 의 제조방법으로, 80 내지 90 중량%의 모래를 75 내지 90 ℃로 가열하고, 여기에 0.5 내지 3.5 중량%의 카나우 바를 투입하여 위 온도를 그대로 유지하면서 모두 녹아 코팅될 때까지 혼합하고, 여기에 8 내지 12 중량%의 밀납과 1.5 내지 4.5 중량%의 라놀린을 투입하여 55 내지 70 ℃를 유지하면서 모두 녹아 코팅되도록 한 후 서냉시 킨 것이다. US 6,235,070호의 점성 모래 및 특허 제598001호의 모래 소재 혼합물은 공통적으로 모래 입자 및 결합제를 포함 하는 모래 소재 혼합물로서, 상기 결합제는 모래 입자상에 피막(coating)을 형성하며 밀랍; 세레신왁스; 미세 결정상 왁스; 및 지랍과 파라핀 왁스의 혼합물로 구성된 군으로부터 하나 이상 선택된다. 장난감 소재, 교육자 재 및 모조 건축 디자인, 박물관 또는 수족관에서의 조경 디자인의 구성 등을 위한 소재로 사용할 수 있다. US 5,873,933호의 푸석푸석한 흙과 같은 느낌을 갖는 전성(展性)의 놀이재료 혼합물은 전성의 무정형 결합제와 많은 양의 모래를 포함하며, 상기 결합제는 가용성 셀룰로오스, 폴리비닐 알코올, 프로필렌글리콜, 물, 붕산나 트륨, 탄산나트륨 등을 포함한다. 이 혼합물은 전성의 결합제가 많은 양의 모래와 결합하여 독특한 촉감 특성 을 갖게 되며, 과립상의 전성의 무정형의 성상을 갖는다. 또한, 특허공개 제2006-11619호의 자연경화 및 가압에 의한 향방출형 기능성 인조점토는 폴리비닐알코올 및 에 틸렌 비닐아세테이트를 모재로 밀도가 낮은 중공 형태의 폴리아크릴로니트릴 분말과 열팽창성 마이크로스피어를 충진제로 선택하여, 농후제, 글리세린, 건조지연제 및 기타 첨가물을 실온 및 가열 혼합하여 제조한다. 그러나 상기에서 언급한 종래의 점성 모래 또는 인조 점토 등은 물리적인 특성 및 외형이 기존의 모래나, 물기 를 머금은 모래 또는 파라핀이 코팅된 유성분의 모래, 천연 찰흙 등과 대부분 유사하여 영유아, 아동들에게 새 로운 흥미를 부여하지 못하고 있었다. 또, 사용시 물을 필요로 하거나 제한된 조형활동만 가능하고, 조형이 가 능한 경우에도 시간이 지나면 굳어버려 반복사용이 어렵고 작품으로 보관하는 외에는 폐기시키게 되므로 환경오 염을 유발하는 문제가 있었다. 특히 모래에 파라핀을 코팅한 점성 모래의 경우는 파라핀이 바닥이나 손, 옷 등 에 묻어나 많은 불편을 초래하고 세균과 먼지가 묻으면 떨어지지 않으며, 바로 부패하고 냄새가 심하게 나고 끈 적이는 촉감이 불쾌감을 주는 문제가 있었다. 이에 본 출원인은 종래의 점성 모래 또는 인조 점토 등과는 전혀 다른 촉감과 성상을 지니고 물 없이도 반복적 인 사용이 가능한 공기점토를 개발하여 대한민국 등록특허 제10-0874091호 및 제10-1178944호로 특허받은 바 있 다. 등록특허 제10-0874091호는 곱게 빻아 미세한 분말로 만든 모래가루 등의 모재와 글리세린을 포함하며, 잡 아당기면 늘어나면서 공기가 흡입되어 마치 구름이나 솜, 눈(snow)처럼 성기고 부드러운 상태가 되고 다시 힘을 가해 뭉치면 공기가 빠져나가면서 조밀하고 단단한 점토형태로 되돌아가는 공기점토를 개시하고 있다. 이 공기 점토는 종래의 점성 모래 또는 인조 점토가 갖는 여러 문제점과 한계를 극복하고 있다. 등록특허 제10-1178944 호는 상기 공기점토를 보다 다양한 용도로 활용할 수 있도록 성상을 보다 다양화하고, 항균 등의 기능성을 부여 하기 위해 기능성 물질을 결합 또는 담지시킬 수 있도록 표면 특성이나 물성을 개선한 것으로, 다공성의 규조토 분말(제1모재)과 친수성과 친유성의 양쪽성을 갖는 액상물질을 포함하고 여기에 제1모재보다 더 작은 입자 크기 의 제2모재를 다양한 성상의 부여를 위해 더 포함할 수 있다. 그러나 본 출원인에 의한 상기 공기점토나 이를 개량한 점토 조성물 모두 물 없이 반복적인 조형이 가능하고 오 랫동안 굳지 않으면서 동일한 물리적 성상이 유지되는 인조 점토로서, 종래의 점토나 인조 점토에서 볼 수 없는 특성을 지니고 있으나, 조형된 형태 그대로 장시간 동일한 형상을 유지하거나 뭉쳐서 던지기 같은 놀이가 가능 할 정도의 형태 유지능을 갖고 있지는 못하였다. 중공구체(hollow sphere)는 속이 비어있는 미세한 구형 입자로서 밀도가 낮다. 보통 유기고분자 물질로 되어 있는 플라스틱 중공구체가 많이 알려져 있으며, 유리 중공구체, 최근 활발한 연구가 진행되고 있는 세라믹 중공 구체, 금속 중공구체 등 소재의 종류가 다양하다. 이중에서도 유리성분인 실리카로 만들어지는 유리 중공구체 (Hollow Glass Sphere)는 밀도가 낮고 난연성과 단열성이 우수하여 많은 주목을 받고 있는데, 3M, 에머슨 등의 회사에서 대량 생산하고 있다. 유리 중공구체는 고강도, 저밀도의 첨가제로서 각종 수지, 구조용 폼, 엘라스토 머 등의 다양한 소재에 적용되고 있다. 제품명 '할로우 글래스 마이크로스피어스(Hollow Glass Microsphere s)'는 소다 라임 보로실리케이트 유리(Soda-lime borosilicate glass)로 된 유리 중공구체로 시노스틸 마안샨 뉴 머티리얼 테크놀로지 코., 엘티디.(Sinosteel Maanshan New Material Technology Co., Ltd., 중국)에서 생 산하고 있다. 다른 유리 중공구체로 제품명 '글래스버블스'(쓰리엠(3M), 미국), 제품명 '큐-셀®(Q-cel®)'(포 터스 인더스트리즈 엘엘씨(Potters Industries LLC), 미국) 등이 있다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 등록특허 공보 10-0231408 (특허문헌 0002) 대한민국 공개특허공보 10-2004-361 (특허문헌 0003) US 6,235,070 (특허문헌 0004) 대한민국 등록특허 공보 10-0598001 (특허문헌 0005) US 5,873,933 (특허문헌 0006) 대한민국 공개특허공보 10-2006-11619 (특허문헌 0007) 대한민국 등록특허공보 10-0874091 (특허문헌 0008) 대한민국 등록특허공보 10-1178944"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 물에 용해되어 세척이 용이하고 인체에 대한 안전성이 높으며, 매우 가볍고, 오랜 시간 물 없이 반복 적인 조형이 가능하고, 특히 형태 유지능이 뛰어나 조형된 형태 그대로 장시간 동일한 형상을 유지할 수 있고 공처럼 뭉쳐서 던지기와 같은 놀이를 할 수 있는, 새로운 물성의 인조 점토 조성물 및 이의 제조방법을 제공하 는 것을 목적으로 한다."}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이를 위해 본 발명에서는, 수용성이고, 밀도가 0 g/cm3 초과 0.6 g/cm3 이하이며, 건조실험 전후의 밀도 변화가 10 % 이하인 인조 점토 조성물을 제공한다. 인조 점토 조성물의 밀도는 바람직하게는 0 g/cm3 초과 0.4 g/cm3 이하이고, 더 바람직하게는 0 g/cm3 초과 0.2 g/cm3 이하이다. 본 발명의 인조 점토 조성물의 형태변화 실험 전후의 중량 변화는 약 2 % 이하, 바람직하게는 약 1 % 이하, 더 바람직하게는 약 0 %일 수 있다. 본 발명의 인조 점토 조성물은 중공구체 및 중공구체와 혼합 반죽될 수 있는 액상물질을 포함할 수 있다. 중공 구체는 바람직하게는 유리 중공구체이다. 유리 중공구체의 밀도는 바람직하게는 0 g/cm3 초과 0.6 g/cm3 이하, 더 바람직하게는 0 g/cm3 초과 0.4 g/cm3 이하일 수 있다. 본 발명의 다른 실시예에서 중공구체는 플라스틱 중 공구체이다. 액상물질은 글리세린을 포함할 수 있다. 본 발명의 인조 점토 조성물은, 바람직하게는 응집제를 더 포함할 수 있다. 본 발명의 인조 점토 조성물은, 필요에 따라 항균물질을 더 포함할 수 있다. 또한, 본 발명에서는, 중공구체에 중공구체와 혼합 반죽될 수 있는 액상물질을 혼합한 후 혼합물이 안정된 균일 상에 도달할 때까지 충분히 반죽하는 과정을 포함하는 인조 점토 조성물의 제조방법을 제공한다. 본 발명의 제조방법은, 바람직하게는 중공구체에 액상물질과 함께 응집제를 더 첨가하고 혼합할 수 있다. 본 발명의 제조방법은, 필요에 따라 혼합에 앞서 액상물질에 항균물질을 첨가하고 용해시키는 과정을 더 포함할 수 있다. 본 발명에서 \"점토\"는 미세한 입자의 집합체를 의미하며, 조형이 가능한 찰흙, 진흙과 같이 점성이 있는 점토 성상부터 만지면 흩어지는 전성(展性)이 있는 모래의 성상, 미세하고 고운 가루 집합체까지 모두 포함하는 의미 이다."}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 새로운 인조 점토 조성물은, 물에 용해되어 세척이 용이하고 인체에 대한 안전성이 높으며, 매우 가 벼우면서도, 조형된 형태로 방치하더라도 오랜 시간 동안 질량 변화가 거의 없이 그 성질을 유지하므로 오랜 시간 물 없이 반복적인 조형이 가능하다. 또한, 형태 유지능이 뛰어나 조형된 형태 그대로 장시간 동일한 형상을 유지할 수 있고 공처럼 뭉쳐서 던지기 같은 놀이가 가능하다. 따라서, 본 발명의 인조 점토 조성물은 아이들이 반복적으로 다양한 조형을 해보는 놀이용 점토로 사용하는 것은 물론, 뭉쳐서 던지기 같은 놀이도 가능하므로 새로운 공놀이나 눈싸움 같은 놀이에도 이용할 수 있다. 또한, 본 발명의 인조 점토 조성물은 형태 유지능이 매우 뛰어나 조형된 형태 그대로 장시간 동일한 형상을 유지할 수 있으므로, 장시간 전시가 필요한 전시작품이 나 예술작품의 조형, 모델링 등에도 사용될 수 있으며, 매우 가볍기 때문에 어디에나 설치 가능한 조형물을 만 들 수 있다."}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 새로운 인조 점토 조성물과 그 제조방법의 실시예를 설명한다. 아래에 기재될 기술 구성은 본 발명의 바람직한 일 실시예에 불과할 뿐이고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시 점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다. 본 발명의 인조 점토 조성물 본 발명의 인조 점토 조성물은 물에 용해되는 성질(수용성)을 가져 세척이 용이하여 인체에 대한 안전성이 높다. 또한, 본 발명의 인조 점토 조성물은 밀도가 0 g/cm3 초과 0.6 g/cm3 이하, 바람직하게는 0 g/cm3 초과 0.4 g/cm3 이하, 바람직하게는 0 g/cm3 초과 0.2 g/cm3로, 매우 가벼운 특징을 가진다. 또한, 본 발명의 인조 점토 조성물은 건조실험(25 ℃에서 96 시간 동안 건조) 전후의 밀도 차이가 약 10 % 이하, 바람직하게는 약 8 % 이하, 더욱 바람직하게는 약 4 % 이하이다. 점토 조성물은 물 없이 반복적인 조형이 가능하고 오랫동안 굳지 않는 것이 중요하며 이를 위해서는 장시간 건조 또는 방치하더라도 일부 성분의 휘발 등으로 인한 점토 조성물의 밀도 변화가 작은 것이 바람직하다. 또한, 본 발명의 인조 점토 조성물의 형태변화 실험 전후의 중량 변화는 2 % 이하이다. 이는 점토 조성물을 가 지고 노는 경우 가루가 날림이 없이 잘 뭉쳐지고, 조형 후 외력에 의해 점토 조성물이 잘 부서지지 않음을 의미 한다. 본 발명의 인조 점토 조성물은 중공구체를 포함한다. 중공구체는 속이 비어있는 미세한 구형입자로서 밀도가 낮아 가벼우며, 지금까지 플라스틱, 유리, 세라믹, 금속 등 다양한 소재의 중공구체가 알려져 있다. 본 발명의 인조 점토 조성물은 중공구체로 바람직하게는 유리 중공구체를 포함할 수 있다. 유리 중공구체는 밀 도가 낮고 난연성과 단열성이 우수한 소재로 알려져 있는데, 각종 수지, 폼, 엘라스토머 등에 첨가제로 사용되 고 있다. 유리 중공구체는 3M, 에머슨 등에서 대량 생산하고 있는데, 본 발명에서는 이렇게 상업적으로 판매되 는 유리 중공구체를 사용할 수 있다. 본 발명의 일 실시예에서는 시노스틸 마안샨 뉴 머티리얼 테크놀로지코., 엘티디.에서 생산하는 소다 라임 보로실리케이트 유리로 된 유리 중공구체인 '할로우 글래스 마이크로스피 어스 H 시리즈'를 사용하였다. 유리 중공구체는 밀도가 낮을수록 가벼운데, 본 발명에서 유리 중공구체의 밀도 는 0 g/cm3 초과 0.6 g/cm3 이하이다. 밀도가 낮을수록 더 가벼운 제품을 만들 수 있는 장점이 있으나 반면 가 격이 상승되는 문제가 있다. 본 발명에서는 바람직하게는 상기 범위 내에서 필요에 따라 적정한 밀도의 유리 중공구체를 선택 사용할 수 있는데, 가벼운 인조점토를 만들기 위해 바람직하게는 0 g/cm3 초과 0.4 g/cm3 이하, 더 바람직하게는 0 g/cm3 초과 0.2 g/cm3 이하 범위의 밀도를 갖는 유리 중공구체를 사용할 수 있다. 유리 중공 구체를 사용한 본 발명의 인조 점토 조성물은 난연성이고 가소성이 좋으며 강성이 높고 인체에 안전한 친환경적 인 특징을 갖게 된다. 본 발명의 다른 실시예에서는 중공구체로 플라스틱 중공구체를 사용할 수 있다. 플라스틱 중공구체는 유리 중 공구체에 비해 훨씬 가볍고 기본적으로 10 배 정도 작은 밀도를 구현할 수 있는 장점이 있다. 그러나 플라스틱 중공구체들은 인화점(평균 약 200 ℃)이 유리 중공구체에 비해 매우 낮기 때문에 본 발명의 인조 점토 조성물을 만들 때 많은 양의 액상 물질을 혼합하여야 어린이가 안전하게 가지고 놀 수 있는 정도로 인화점이 높아진다. 또한, 플라스틱 중공구체를 사용하여 인조 점토 조성물을 제조하는 경우, 인조 점토 조성물의 인화성을 감소시 키기 위하여 방염제를 첨가할 수 있다. 방염제의 함량은 목적하는 인화성 감소의 정도에 따라 조절할 수 있으 나, 방염제를 제외한 인조 점토 조성물의 총 중량을 기준으로 약 50 중량부 이상이 바람직하다. 한편, 플라스 틱 중공구체는 탄성이 높은 장점을 갖는다. 본 발명의 인조 점토 조성물은 중공구체로서 유리 중공구체나 플라스틱 중공구체 외에도 세라믹 중공구체, 금속 중공구체 등 소재의 제한 없이 속이 비어있는 미세한 구형 입자로서 밀도가 낮은 다양한 중공구체를 사용할 수 있다. 본 발명의 인조 점토 조성물은 중공구체와 혼합 반죽될 수 있는 액상물질을 포함한다. 본 발명의 액상물질은 중공구체보다 높은 밀도와 0.1 내지 1,500 cP(=mPas) 범위의 점도를 가질 수 있다. 본 발명의 액상물질은 중공 구체와 완전히 혼합 반죽되어 안정된 균일상을 형성할 수 있다. 중공구체의 표면에 대한 액상물질의 반응성이 높으면, 중공구체와 액상물질이 혼합 반죽되어 안정된 균일상을 형성할 수 있으며, 이때 중공구체의 표면에 액 상물질의 침착이 일정하게 일어나기 때문에 독립적인 중공구체는 관찰하기 어렵다. 그러나, 중공구체의 표면에 대한 액상물질의 반응성이 높지 않으면, 중공구체의 표면의 일부에만 액상물질이 침착되거나 전혀 침착되지 않 기 때문에 중공구체가 독립적으로 관찰되며, 이는 혼합하는 액상물질의 양을 증가시키더라도 점토 조성물의 점 도가 증가하지 않는 등 혼합 반죽이 제대로 이루어지지 않는 문제를 일으킨다. 중공구체의 표면이 친유성일 때 상기 액상물질은 친유성인 것이 바람직하며, 반대로 중공구체의 표면이 친수성일 때 상기 액상물질은 친수성인 것이 바람직하다. 액상물질은, 예를 들어, 프로필렌글리콜, 폴리에틸렌글리콜, 폴리비닐알코올, 붕산, 수성 접착제(예컨대, PVAc 등), 고무 접착제, 파라핀, 유동파라핀, 왁스, 글리세린, 젤라틴, 점성 있는 오일, 이들의 혼합물, 이들과 물의 혼합물 등이 될 수 있다. 본 발명의 인조 점토 조성물은 조성물의 총 중량을 기준으로 바람직하게는 유리 중공구체 약 50 내지 약 95 중 량%과 액상물질 약 4 내지 약 50 중량%을 포함할 수 있다. 또한, 본 발명의 인조 점토 조성물은 조성물의 총 중량(방염제가 사용된 경우 방염제는 제외)을 기준으로 바람직하게는 플라스틱 중공구체 약 10 내지 약 65 중량 %과 액상물질 약 30 내지 약 80 중량%을 포함할 수 있다. 중공구체에 대한 액상물질의 비율이 너무 작아지면 무게감과 점성이 줄고 손에 가루가 묻어나는 현상이 나타날 수 있다. 반대로 중공구체에 대한 액상물질의 비율 이 너무 커지면 무게감이 커지고, 액상 또는 액상과 가루가 동시에 손에 묻어나는 현상이 나타날 수 있다. 본 발명의 인조 점토 조성물은 바람직하게는 응집제를 더 포함할 수 있다. 응집제는 액체 속에 현탁되어 있는 고체입자가 몇 개씩 모여 약간 큰 덩어리를 만들도록 하기 위해 액체에 첨가하는 약품을 말한다. 응집제에는 소석회, 백반, 염화알루미늄, 산화철(Ⅲ), 황산철(Ⅱ) 등의 무기전해질과, 녹말류, 폴리아크릴아미드와 그 유도 체 등의 유기고분자물이 있는데, 본 발명에서는 양쪽 다 사용 가능하며 바람직하게는 폴리아크릴아미드와 그 유 도체 등의 유기고분자물을 사용할 수 있다. 액상물질을 매질로 하여 중공구체와 액상물질이 균일상을 이루는 조성물에 응집제를 투입하고 반죽하면 전체적으로 좀더 걸쭉한 에멀전 상태가 되면서 질기고 강력한 점성이 생 기게 된다. 본 발명의 인조 점토 조성물은 응집제를 바람직하게 조성물의 총 중량(방염제가 사용된 경우 방염 제는 제외)을 기준으로 0 중량% 초과 약 10 중량% 이하로 포함할 수 있다. 본 발명의 인조 점토 조성물은, 필요에 따라 항균제를 더 포함할 수 있다. 항균제로 바람직하게는 천연 항균물 질이 사용될 수 있다. 상기 천연 항균물질은, 예를 들어, 은이온, 은나노 등을 포함하는 은제품; 자몽추출물; 알리신을 포함하는 마늘추출물; 녹차추출물 등이 될 수 있으며, 이들로 구성된 군으로부터 선택된 l종 이상이 조성물에 포함될 수 있다. 본 발명에서 \"은\"은 은이온, 은나노 등을 포함하는 은제품을 의미한다. 상기 항균 물질은 항균작용을 나타내는데 필요한 양으로 포함될 수 있으며, 항균물질의 종류에 따라 그 포함되는 양은 달 라질 수 있다. 항균제는 많이 들어갈수록 항균 효과와 지속력이 좋지만, 단가가 올라가게 되는 문제가 있다. 따라서 바람직하게는 최소량으로 최대의 항균 효과를 내는 것이 좋다. 항균물질로 더욱 바람직하게는 은이온을 사용할 수 있다. 은이온을 사용할 경우, 특히 바람직하게는 은이온을 다공성 물질에 담지시켜 사용할 수 있다. 이때 다공성 물질로는 규조토, 제올라이트, 펄라이트 등을 사용할 수 있다. 은이온이 담지된 다공성 물질의 양 을 기준으로, 조성물의 총 중량(방염제가 사용된 경우 방염제는 제외) 중 약 0.5 중량% 이상을 포함하면 항균력 을 94 % 이상을 발휘, 유지시킬 수 있다. 항균물질은 더욱 바람직하게는 조성물의 총 중량(방염제가 사용된 경 우 방염제는 제외)을 기준으로 약 0.5 내지 약 10 중량%로 포함될 수 있다. 항균제로 자몽추출물 (DF-100™)을 사용할 경우에는, 조성물의 총 중량(방염제가 사용된 경우 방염제는 제외)을 기준으로 약 0.1 내지 약 10 중량% 로 포함되는 것이 바람직하다. 이때 자몽추출물은 액상물질에 쉽게 용해될 수 있으므로, 바람직하게는 상기 액 상물질에 용해된 상태로 본 조성물에 포함될 수 있다. 본 발명의 인조 점토 조성물은, 이 밖에도 필요에 따라 물성개선제, 착색제, 가향제 등의 첨가제를 더 포함할 수 있다. 본 발명의 인조 점토 조성물의 제조방법 이하 본 발명의 인조 점토 조성물을 제조하는 바람직한 실시예를 설명한다. 사용되는 각 구성성분에 대한 설명 은 앞서 설명한 인조 점토 조성물에서와 동일하므로, 중복되는 설명은 생략한다. 본 발명의 제조방법은, 중공구체에 이와 혼합 반죽될 수 있는 액상물질을 혼합한 후 혼합물이 안정된 균일상에 도달할 때까지 충분히 반죽하는 과정을 포함한다. 이때 바람직하게는 중공구체에 액상물질과 함께 응집제를 첨 가하고 혼합할 수 있다. 또한, 필요에 따라 액상물질에 먼저 항균물질, 첨가제 등을 첨가하고 용해시킨 후, 중 공구체와의 혼합, 반죽 과정에 들어갈 수 있다. 플라스틱 중공구체를 사용하는 경우, 방염제를 더 첨가할 수 있다. 방염제는 필요에 따라 적절한 단계에서 첨가할 수 있다. 예를 들어, 방염제는 중공구체와 액상물질을 먼저 혼합한 후에 단독으로 또는 액상물질과 혼합하여 첨가할 수도 있고, 액상물질에 먼저 용해시킨 후 이를 중 공구체와 혼합할 수도 있다. 중공구체에 액상물질 및 필요에 따라 다른 첨가제를 혼합하고 완전히 혼화될 때까지 반죽함으로써 서로 다른 물 질들이 하나의 균일하고 안정된 상태를 이룬 인조 점토가 만들어진다. 이때 바람직하게는 각 물질들을 혼합한 후 반죽기로 옮겨 반죽시키는데, 이때 응집제를 첨가하면 혼합물이 전체적으로 걸쭉한 에멀전 상태가 되면서 보 다 질기고 강력한 점성이 생기게 된다. 필요에 따라 반죽 후 마지막에 또는 혼합 반죽 전의 액상물질에, 형광 물질, 감온색소, 야광물질 등의 안료나 매끈한 감촉을 주기 위한 코팅물질(유동파라핀, 왁스 등) 등의 추가 기 능성 물질을 혼합할 수 있다. 실시예 이하 구체적인 실시예를 통해 본 발명을 보다 상세히 설명한다. 그러나 이들 실시예는 오로지 본 발명을 보다 구체적으로 설명하기 위한 것으로, 본 발명의 범위가 이들 실시예에 의해 한정되는 것은 아니다. 실시예 A1 조성물의 총 중량을 기준으로 하여, 밀도 0.2 g/cm3인 유리 중공구체 20.0 g, 액상물질 35.0 g, 응집제 3.0 g 을 혼합하고 반죽하여 인조 점토 조성물을 얻었다. 유리 중공구체는 소다 라임 보로실리케이트 유리로 된 밀도 0.2 g/cm3의 '할로우 글래스 마이크로스피어스(Hollow Glass Microspheres) H20'(중국, 시노스틸 마안샨 뉴 머 티리얼 테크놀로지 코., 엘티디. 제조)을 사용하였다. 액상물질로 글리세린을 사용하였다. 응집제로서, 유기고 분자물인 '한플록(폴리아크릴아미드 에멀젼) HA-시리즈'(HANFLOC(POLYACRYLAMIDE EMULSION) HA-Series)(한국, (주)한솔케미칼 제조)를 사용하였다. 얻어진 인조 점토 조성물을 사용하여 만든 조형물은 형상을 그대로 유지 할 수 있었고, 뭉쳐서 공처럼 만들면 던지기 놀이를 해도 형상 그대로를 지속적으로 유지할 수 있었다. 실시예 A2 내지 A9 아래 표 1a에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 A1과 동일하게 실시하여 인조 점토 조성물을 얻 었다. [표 1a]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "실시예 B1 내지 B9 유리 중공구체로서 밀도 0.4 g/cm3의 '할로우 글래스 마이크로스피어스 H40'(중국, 시노스틸 마안샨 뉴 머티리 얼 테크놀로지 코., 엘티디. 제조)을 사용하고, 아래 표 1b에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 A1과 동일하게 실시하여 인조 점토 조성물을 얻었다. [표 1b]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "실시예 B13 내지 B21 유리 중공구체로서 밀도 0.46 g/cm3의 '할로우 글래스 마이크로스피어스 H46'(중국, 시노스틸 마안샨 뉴 머티리 얼 테크놀로지 코., 엘티디. 제조)을 사용하고, 아래 표 1c에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 A1과 동일하게 실시하여 인조 점토 조성물을 얻었다.[표 1c]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "실시예 C1 내지 C9 유리 중공구체로서 밀도 0.6 g/cm3의 '할로우 글래스 마이크로스피어스 H60'(중국, 시노스틸 마안샨 뉴 머티리 얼 테크놀로지 코., 엘티디. 제조)을 사용하고, 아래 표 1d에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 A1과 동일하게 실시하여 인조 점토 조성물을 얻었다. [표 1d]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "실시예 D1 내지 D12 유리 중공구체 대신 플라스틱 중공구체를 사용하고, 방염제를 더 첨가하였으며, 아래 표 1e에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 A1과 동일하게 실시하여 인조 점토 조성물을 얻었다. 플라스틱 중공구체로서, 아크릴 공중합체로 된 입자 크기(d0.5) 35 내지 55 ㎛, 진밀도 25±3 kg/m3의 익스팬셀®마이크로스피어스 (Expancel®Microspheres) 461 DET 40 d25 모델(네덜란드, 악조노벨(Akzo Nobel) 제조)을 사용하였다. 방염제 는 에스콘-773(ESCON-773)(한국, ㈜이에스씨 제조)를 사용하였다.[표 1e]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "실시예 A10 내지 A12 아래 표 2에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 A1과 동일하게 실시하여 점성이 있는 인조 점토 조성물을 얻었다. 실시예 B10 내지 B12 아래 표 2에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 B1과 동일하게 실시하여 점성이 있는 인조 점토 조성물을 얻었다. 실시예 C10 내지 C12 아래 표 2에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 C1과 동일하게 실시하여 점성이 있는 인조 점토 조성물을 얻었다. [표 2]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "실시예 D13 내지 D15 아래 표 3에 나타낸 조성으로 혼합한 것을 제외하고는 실시예 D1과 동일하게 실시하여 점성이 있는 인조 점토 조성물을 얻었다. [표 3]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "비교예 1 내지 13 아래 표 4에 나타낸 시중에서 입수가능한 인조 점토 제품 13 종을 시중에서 입수하였다. [표 4]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "비교예 14 중공 형태의 폴리아크릴로니트릴 분말을 모재로 사용한 특허공개 제2006-11619호의 실시예 1에 기재된 조성과 방법으로 제조하였다. 시험예 실시예 A1 내지 A12, B1 내지 B21, C1 내지 C12, D13 내지 D15에서 얻은 인조 점토 조성물에 대하여 다양한 물 성을 시험하였다. 현미경 관찰 본 발명의 실시예에서 유리 중공구체와 액상물질이 골고루 혼합 반죽되어 안정한 균일상을 형성하였는지 여부를 현미경 관찰을 통해 확인하였다. 니콘(Nikon) 광학 현미경을 이용하였으며, 100 배율 및 200 배율로 촬영하였 다. 이때, 콘트라스트(contrast)를 위해 편광을 사용하여 유리 중공구체와 액상물질을 구분하였다. 현미경 사 진에서 액상물질은 검은 색으로 나타나며, 유리 중공구체는 밝고 둥근 모습을 보인다. 유리 중공구체와 액상물 질의 혼합 정도를 현미경 사진을 통해 평가할 수 있으며, 혼합 정도가 미약한 정도에서 혼합 정도가 완전한 정 도로 갈수록 유리 중공구체에 액상물질이 침착되는 정도가 점진적으로 증가한다. 도 2a 및 도 2b는 본 발명의 실시예에서 사용된 밀도 0.2 g/cm3의 유리 중공구체 '할로우 글래스 마이크로스피 어스 H20'를 액상물질인 글리세린과 혼합하고 각각 100 배율 및 200 배율로 촬영한 현미경 사진이다. 유리 중 공구체 표면에 액상물질의 침착이 일정하게 일어나 독립적인 유리 중공구체가 관찰되지 않았다. 즉, 본 발명의 실시예의 인조 점토 조성물에서는 중공구체와 액상물질이 혼합 반죽되어 안정된 균일상이 형성되었음을 알 수 있다. 접촉각 측정 접촉각 측정은 접촉각 및 웨팅 에너지(wetting energy)를 측정하여 시료나 액체의 물성과 표면 상태를 분석하기 위한 것으로서, 본 발명에서는 이를 이용하여 보로실리케이트와 글리세린의 상호작용에 따른 효과 우수성을 평 가하였다. 접촉각 측정 장비로 포닉스300(Phoenix300)(한국, 에스이오(SEO) 제조)를 사용하였다. 실린더 니들 은 2 ㎛를 사용하였다. 먼저, 측정 시료인 보로실리케이트 유리, 슬라이드 글라스, 쿼츠를 30 분간 초음파 세척하였다. 세척 후 실린더 니들을 이용하여 글리세린을 적하하였다. 시료와 글리세린의 접촉각과 웨팅 에너지 를 측정하여 얻은 결과를 도 3과 아래 표 5에 나타내었다. [표 5]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 10, "content": "도 3 및 표 5로부터 알 수 있듯이, 글리세린을 보로실리케이트 유리와 접촉시키는 경우, 다른 시료와 접촉시키 는 경우에 비하여 작은 접촉각을 가지며 따라서 웨팅이 용이하게 일어남을 알 수 있다. 이러한 실험으로, 본 발명의 실시예에서 사용된 유리 중공구체의 표면에 대한 글리세린(액상물질)의 반응성이 상대적으로 높기 때문 에 양 물질의 혼합 반죽이 용이하게 이루어져 안정된 균일상을 형성할 수 있음을 확인하였다. 관능테스트 본 발명의 실시예 A1 내지 A9, B1 내지 B9, B13 내지 B21, C1 내지 C9, D1 내지 D12의 인조 점토 조성물에 대 해 손에 묻는 정도 및 부서짐과 날림 정도를 관능테스트로 평가하였다. 관능테스트 결과를 종합하여 전체적인 상품성을 하(下), 중하(中下), 중(中), 중상(中上), 상(上)으로 분류하였다. 중하 이상의 경우, 상품화하기에 적합한 것으로 판단하였다. 관능테스트 결과를 상기 표 1a 내지 표 1e에 나타내었다. 표 1a 내지 표 1e로부터 알 수 있듯이, 액상물질인 글리세린의 양을 증가시킬수록 점토 조성물의 점도가 증가하 였으며, 조성물의 총 중량을 기준으로 유리 중공구체 약 50 내지 약 95 중량% 및 글리세린 약 4 내지 약 50 중 량%을 혼합하였을 때, 인조 점토 조성물의 전체적인 물성이 바람직한 것으로 확인되었다. 플라스틱 중공구체를 사용한 경우, 조성물의 총 중량(방염제가 사용된 경우 방염제는 제외)을 기준으로 플라스틱 중공구체 약 10 내 지 약 65 중량% 및 액상물질 약 30 내지 약 80 중량%을 혼합하였을 때, 전체적으로 바람직한 물성을 가진 인조 점토 조성물을 얻을 수 있었다. 실시예와 비교예의 비교실험 실시예 A10 내지 A12, B10 내지 B12, C10 내지 C12, D13 내지 D15을 비교예 1 내지 14와 다음 물성들을 기준으 로 비교하였다. 밀도 측정 점토 조성물이 얼마나 가벼운지, 점토 조성물을 상온에서 장시간 방치 후에 밀도의 변화가 어느 정도인지를 확 인하기 위하여 밀도 측정을 수행하였다. 제조한 본 발명의 점토 조성물(비교예 14를 제외한 비교예의 경우 시판 되는 제품의 포장을 개봉하고, 포장에서 꺼낸 내용물) 적정량을 지름 15 mm, 높이 25 mm의 원기둥형 몰드에 몰 드의 높이를 초과할 때까지 반복하여 눌러 담아 내부에 빈 공간이 없도록 충전하고 몰드에서 넘친 부분은 칼과 몰드 윗면을 수평으로 밀착시켜 천천히 제거한 후, 잘라진 면을 다듬고 몰드에서 빼내어 밀도 측정용 시료를 만 든다(도 4 참조). 얻은 시료의 질량을 소수점 4번째 자리까지 측정하고, 시료의 지름 및 높이를 버니어 캘리퍼 스로 측정하여 시료의 부피를 계산하였다. 얻어진 질량을 부피로 나누어 밀도를 계산하였다. 위 시료를 96 시간 동안 25 ℃에서 건조시키고, 건조된 시료의 질량과 부피를 앞서 설명한 방법으로 다시 측정 하여, 건조실험 후의 밀도를 계산하였다. 실시예 및 비교예에 대하여 각각 시료를 10 개를 제조하여 얻은 밀도 측정 결과의 평균값을 도 5a 및 도 5b에 나타내었다. 비교예 1 내지 9가 0.9 g/cm3 이상의 높은 밀도를 나타낸 것에 비하여, 실시예 A10 내지 A12, B10 내지 B12, C10 내지 C12, D13 내지 D15은 0.6 g/cm3 이하의 낮은 밀도를 나타내었다. 실시예 중 특히 A10 내지 A12, B10 내지 B12는 0.4 g/cm3 이하의 낮은 밀도를 가졌고, D13 내지 D15는 0.2 g/cm3 이하의 낮은 밀도를 가졌다. 한편, 모든 실시예는 건조실험 전후의 밀도 변화가 10 % 미만으로 장시간 건조 또는 방치하더라도 오랫동안 굳 지 않고 원래 상태를 유지하였지만, 비교예 10, 12, 13은 각각 45.13 %, 74.58 %, 45.64 %로 매우 큰 밀도 변 화를 보이고, 단단하게 굳어버려, 밀도가 높고 쉽게 증발되는 성분이 상당량 포함된 것으로 판단된다. 비교예 14에 따라 제조된 인조 점토 조성물은 비교예 13과 동일한 것으로 확인되었는바, 본 실험을 비롯한 이하 의 비교실험에서 별도로 결과를 나타내지 않았다.용해도 측정 세척 용이 여부, 인체에 대한 유해성 여부를 판단하기 위하여, 다섯 가지 용매에 대한 점토 조성물의 용해도를 측정하였다. 점토 조성물 2 g을 각각 아세톤, 톨루엔, 헥산, 에틸 알코올, 증류수 5 ml에 넣은 뒤 10 분 동안 관찰하여 용해가 되었는지 여부를 육안으로 확인하였다. 다만, 밀도가 0.1 g/cm3 이하인 점토 조성물에 대해서 는 용매 10 ml를 사용하였다. 본 발명에서 용질이 용매에 분산되고 입자가 어느 정도 관찰되는 경우를 \"용해\"된 것으로 보고, 용질의 개별적 인 입자를 식별할 수 없을 정도로 섞인 경우를 \"완전 용해\"된 것으로 보았다. 구체적인 평가 기준은 아래 표 6 과 같으며, 용해도에 따른 인조 점토 조성물의 상태 사진을 도 6에 나타내었다. [표 6]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "상기 평가 기준에 따른 실험 결과를 아래 표 7에 나타내었다. [표 7]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "표 7의 결과에서 볼 수 있듯이, 비교예 1 내지 3, 5, 7 및 11의 경우 증류수에 용해되지 않은 반면, 모든 실시 예는 증류수에 용해되었다. 도 7은 실시예의 인조 점토 조성물이 증류수에 용해된 모습으로, 조성물이 증류수 에 분산되어 균일하게 섞여있음을 알 수 있다. 본 실험결과로부터, 본 발명의 모든 실시예의 인조 점토 조성물 은 수용성인 것이 확인되었다. 형태변화 실험 형태변화 실험은 에어 컴프레서를 통해 받은 외력에 의해 점토 조성물이 부서지는 정도를 측정하는 실험으로서, 조형된 점토 조성물을 가지고 노는 경우 가루가 날리거나 깨지지 않고 조형된 형태를 잘 유지하는 정도를 확인 하기 위해 수행하였다. 도 8a 및 도 8b에 형태변화 실험 장치의 사진과 대략적인 치수를 나타내었다. 본 실험 에서는 내경 1.4 cm, 외경 2.0 cm, 길이 30 cm, 직경의 관(아크릴파이프)을 사용하였는데, 내경 1.4 cm, 외경2.0 cm관을 사용한 이유는 제품의 세밀한 정도의 사이즈(조형 활동시 세밀한 표현이 가능한 범위로 정하였음)를 기준으로 부서짐의 정도를 측정하기 위해서이다. 먼저 미세 저울을 사용하여 각각의 비교예, 실시예에 대해 각각 시료 10 개를 오차범위 0.01 g이내의 동일한 중 량으로 만들었다(아래 표 8 참조). 이때, 시료의 양은 아크릴파이프에 시료가 들어갔을 때 부서지지 않을 정도 로 한다. 다만, 각각의 비교예, 실시예는 서로 밀도가 다를 수 있으므로 모든 비교예, 실시예의 시료 중량이 동일하지 않아도 된다. 핀셋으로 시료를 집어 아크릴파이프의 끝으로부터 3 cm 지점(오차범위 0.5 cm)에 놓고 조준되어 있는 에어건의 압력을 8.5 MPa(오차범위 0.5 MPa)로 맞춘 후 분사한다. 날아간 시료가 사각형 아크릴 판의 안쪽 벽에 부딪히고 난 후 부서진 시료들 중 가장 중량이 많이 나가는 시료를 핀셋으로 잡아 중량을 측정 하되, 육안으로 구별이 불가능할 경우에는 각 시료들의 중량을 측정한 후 가장 무거운 시료의 중량을 기입한다. 실험 전과 실험 후의 중량 감소를 백분율로 환산한다. 분사 전후의 중량 감소가 적을수록 시료가 조금 부서졌 음을 의미한다. 중량이 감소되지 않은 경우 0 %로 표시하였다. 본 실험 결과를 도 9a에 나타내었다. 시료의 중량에 따른 부서짐의 차이를 보기 위하여, 앞서 실험한 중량과 상이한 중량으로 시료를 제조한 것을 제 외하고는, 앞서 수행한 실험과 동일한 조건으로 실험을 반복 수행하였다. 두번째 실험의 시료 중량은 첫번째 실험의 시료 중량의 약 1.3 배 내지 약 1.5 배로 하였다(아래 표 8 참조). 두번째 실험 결과를 도 9b에 나타내 었다. [표 8]"}
{"patent_id": "10-2018-0075869", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 13, "content": "도 9a 및 도 9b에 나타낸 바와 같이, 대부분의 비교예는 형태변화 실험 전후의 중량 감소가 크게 일어났으며, 이는 조형 후 외력에 의해 가루가 날리거나 깨지는 정도가 큰 것을 의미한다. 반면에, 실시예의 점토 조성물은 모두 2 % 이내의 중량 감소를 나타내었으며, 대부분의 실시예에서는 중량 감소가 관찰되지 않았다. 이는 본 발 명의 인조 점토 조성물의 형태 유지능이 매우 우수함을 보여준다. 이상의 실험결과를 통해 확인된 바와 같이, 종래의 인조 점토 조성물은 본 발명의 인조 점토 조성물과 같이 수 용성, 낮은 밀도 및 건조 실험 전후의 작은 밀도 변화를 동시에 만족하지 못하므로 그 유용성에서 한계가 있다. 이에 비해, 본 발명의 인조 점토 조성물은 수용성으로 세척이 용이하며 인체에 대한 안전성이 높고, 밀도가 0 g/cm3 초과 0.6 g/cm3 이하로 매우 가볍고, 동시에 건조실험 전후의 밀도 변화가 10 % 이하로 장시간 건조 또는 방치 이후에도 반복적으로 다양한 조형이 가능한 놀이용 점토로 사용할 수 있다. 또한, 형태 유지능이 뛰어나 므로 뭉쳐진 형태 그대로 장시간 동일한 형상을 유지할 수 있고 던지기와 같은 놀이가 가능하다. 본 발명의 인조 점토 조성물은 매우 가벼우면서도 점성이 있는 점토, 전성이 있는 흙, 모래 등의 다양한 성상을 지닐 수 있으므로, 기존의 일반 점토나 모래, 찰흙, 고무찰흙, 지점토 등을 대신하여 놀이, 교육, 작품 조형 등 에 광범위하게 사용될 수 있다.도면 도면1a 도면1b 도면1c 도면1d 도면1e 도면1f 도면2a 도면2b 도면3 도면4 도면5a 도면5b 도면6 도면7 도면8a 도면8b 도면9a 도면9b"}
{"patent_id": "10-2018-0075869", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 la 내지 도 1f는 실시예에 따른 본 발명의 인조 점토 조성물의 다양한 사진이다. 도 2a 및 도 2b는 본 발명의 실시예에서 중공구체와 액상물질을 혼합한 후 광학 현미경으로 관찰한 사진이다. 도 3은 보로실리케이트 유리, 슬라이드 글라스, 쿼츠와 글리세린의 접촉각을 측정한 사진이다. 도 4는 인조 점토 조성물의 밀도 측정을 위한 시료의 제조 과정을 나타낸 사진이다. 도 5a 및 도 5b는 실시예에 따른 본 발명의 인조 점토 조성물과 비교예에 따른 인조 점토 조성물의 건조실험 전 후의 밀도를 나타낸 표와 그래프이다. 도 6은 용해도에 따른 인조 점토 조성물의 차이를 보여주는 사진이다. 도 7은 실시예에 따른 본 발명의 인조 점토 조성물이 증류수에 용해된 모습을 나타낸 사진이다. 도 8a 및 도 8b는 형태변화 실험 장치를 옆면과 윗면에서 바라본 사진과 개략도이다. 도 9a 및 도 9b는 실시예에 따른 본 발명의 인조 점토 조성물과 비교예에 따른 인조 점토 조성물의 형태변화 실 험 결과를 나타낸 그래프이다."}
