{"patent_id": "10-2021-0166442", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0115046", "출원번호": "10-2021-0166442", "발명의 명칭": "시맨틱 검색 방법, 장치, 기기 및 저장매체", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "린, 즈난"}}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시맨틱 검색 방법으로서, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 상기 쿼리 정보에 대해 시퀀스 레이블링을 수행하여시퀀스 레이블링 결과를 취득하는 단계 - 상기 시퀀스 레이블링 결과는 지식 그래프 기정 정보 부분 및 시맨틱검색 부분을 포함함 - ; 상기 지식 그래프에 기반하여 상기 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하는 단계; 및 상기 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 단계를 포함하는, 시맨틱 검색 방법."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 상기 쿼리 정보에 대해 시퀀스 레이블링을 수행하여 시퀀스 레이블링 결과를 취득하는 단계는, 쿼리 정보를 수신하고, 사전구축된 지식 그래프 및 사전훈련된 시퀀스 레이블링 모델을 이용하여 상기 쿼리 정보를 시퀀스 레이블링하여 제1 레이블링 결과를 취득하는 단계; 상기 제1 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는 단계를 포함하는, 시맨틱 검색 방법."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제1 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는 단계는, 자연어 처리 토큰화 도구에 기반하여 상기 제1 레이블링 결과의 시맨틱 검색 부분을 토큰화하여 제1 시맨틱 검색 부분을 취득하는 단계; 자연어 처리 개체명 인식 도구에 기반하여 상기 제1 시맨틱 검색 부분에 대해 개체명 수정을 수행하여 제2 시맨틱 검색 부분을 취득하는 단계; 자연어 처리 의존 파싱 도구에 기반하여 상기 제1 레이블링 결과의 지식 그래프 기정 정보 부분과 상기 제2 시맨틱 검색 부분 중의 각 시퀀스 레이블링 부분 간의 의존 관계에 대해 판정 수정을 수행하여 제2 레이블링 결과를 취득하는 단계; 상기 지식 그래프에 기반하여 상기 제2 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는 단계를 포함하는, 시맨틱 검색 방법."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 단계는, 사전훈련된 2개-타워 시맨틱 매칭 모델에 기반하여 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중공개특허 10-2022-0115046-3-의 시맨틱 검색 부분을 시맨틱 매칭시켜 상기 개체와 상기 시맨틱 검색 부분의 의미 관련도를 취득하는 단계; 상기 의미 관련도를 사전설정 역치와 비교하여 상기 의미 관련도가 상기 사전설정 역치보다 높은 개체 집합을취득하는 단계를 포함하는, 시맨틱 검색 방법."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 사전훈련된 2개-타워 시맨틱 매칭 모델의 입력소스는, 상기 시맨틱 검색 부분의 시맨틱 검색 워드와 상기 지식 그래프의 개체 정보를 포함하는,시맨틱 검색 방법."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "시맨틱 검색 장치로서, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 상기 쿼리 정보에 대해 시퀀스 레이블링을 수행하여시퀀스 레이블링 결과를 취득하는 레이블링 모듈 - 상기 시퀀스 레이블링 결과는 지식 그래프 기정 정보 부분및 시맨틱 검색 부분을 포함함 - ; 상기 지식 그래프에 기반하여 상기 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하는 구축 모듈; 및 상기 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 매칭 모듈을 포함하는,시맨틱 검색 장치."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 레이블링 모듈은쿼리 정보를 수신하고, 사전구축된 지식 그래프 및 사전훈련된 시퀀스 레이블링 모델을 이용하여 상기 쿼리 정보를 시퀀스 레이블링하여 제1 레이블링 결과를 취득하는 레이블링 서브모듈; 상기 제1 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는 수정 서브모듈을 포함하는, 시맨틱 검색 장치."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 수정 서브모듈은 나아가, 자연어 처리 토큰화 도구에 기반하여 상기 제1 레이블링 결과의 시맨틱 검색 부분을 토큰화하여 제1 시맨틱 검색 부분을 취득하고; 자연어 처리 개체명 인식 도구에 기반하여 상기 제1 시맨틱 검색 부분에 대해 개체명 수정을 수행하여 제2 시맨틱 검색 부분을 취득하고; 자연어 처리 의존 파싱 도구에 기반하여 상기 제1 레이블링 결과의 지식 그래프 기정 정보 부분과 상기 제2 시맨틱 검색 부분 중의 각 시퀀스 레이블링 부분 간의 의존 관계에 대해 판정 수정을 수행하여 제2 레이블링 결과를 취득하고; 상기 지식 그래프에 기반하여 상기 제2 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는,시맨틱 검색 장치. 공개특허 10-2022-0115046-4-청구항 9 제8항에 있어서, 상기 매칭 모듈은 나아가, 사전훈련된 2개-타워 시맨틱 매칭 모델에 기반하여 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 상기 개체와 상기 시맨틱 검색 부분의 의미 관련도를 취득하고; 상기 의미 관련도를 사전설정 역치와 비교하여 상기 의미 관련도가 상기 사전설정 역치보다 높은 개체 집합을취득하는,시맨틱 검색 장치."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 사전훈련된 2개-타워 시맨틱 매칭 모델의 입력소스는상기 시맨틱 검색 부분의 시맨틱 검색 워드와 상기 지식 그래프의 개체 정보를 포함하는,시맨틱 검색 장치."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자기기로서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신적으로 연결되는 메모리를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장되어 있고, 상기 명령은 상기적어도 하나의 프로세서에 의해 실행됨으로써 상기 적어도 하나의 프로세서가 제1항 내지 제5항 중 어느 한 항에 따른 방법을 수행하도록 하는, 전자기기."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 저장매체로서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제5항 중 어느 한 항에 따른 방법을 수행하도록 하는, 비일시적 컴퓨터 판독가능 저장매체."}
{"patent_id": "10-2021-0166442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램은 프로세서에 의해 실행되는 경우, 제1항 내지 제5항 중 어느 한 항에 따른 방법을 구현하는, 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2021-0166442", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 시맨틱 검색 방법, 장치, 기기 및 저장매체를 개시하는바, 인공지능"}
{"patent_id": "10-2021-0166442", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것으로, 특히 지식 그래프, 심층학습 및 자연어 처리 분야에 관한 것이다. 해당 방법의 일 구체적인 실시방식은, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 쿼리 정보를 시퀀스 레이블링하여 시퀀스 레이블링 결과를 취득하 는 단계 - 여기서, 시퀀스 레이블링 결과는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함함 - ; 지식 그래프에 기반하여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하는 단계; 및 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 단계를 포함한다. 해당 실시방식은 지식 그래프에 기반하는 시맨틱 검색 방법으로, 시맨틱 검색의 효율 및 정확률을 향상시키고, 나아가 사용자 경험을 향상시킨다. 대 표 도 - 도2"}
{"patent_id": "10-2021-0166442", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2022-0115046 CPC특허분류 G06F 16/9024 (2019.01) G06F 40/284 (2020.01) G06F 40/289 (2020.01) G06F 40/30 (2020.01)명 세 서 청구범위 청구항 1 시맨틱 검색 방법으로서, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 상기 쿼리 정보에 대해 시퀀스 레이블링을 수행하여 시퀀스 레이블링 결과를 취득하는 단계 - 상기 시퀀스 레이블링 결과는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함함 - ; 상기 지식 그래프에 기반하여 상기 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하는 단계; 및 상기 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 단계를 포함하는, 시맨틱 검색 방법. 청구항 2 제1항에 있어서, 상기 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 상기 쿼리 정보에 대해 시퀀스 레이블링을 수 행하여 시퀀스 레이블링 결과를 취득하는 단계는, 쿼리 정보를 수신하고, 사전구축된 지식 그래프 및 사전훈련된 시퀀스 레이블링 모델을 이용하여 상기 쿼리 정 보를 시퀀스 레이블링하여 제1 레이블링 결과를 취득하는 단계; 상기 제1 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는 단계를 포함하는, 시맨틱 검색 방법. 청구항 3 제2항에 있어서, 상기 제1 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는 단계는, 자연어 처리 토큰화 도구에 기반하여 상기 제1 레이블링 결과의 시맨틱 검색 부분을 토큰화하여 제1 시맨틱 검 색 부분을 취득하는 단계; 자연어 처리 개체명 인식 도구에 기반하여 상기 제1 시맨틱 검색 부분에 대해 개체명 수정을 수행하여 제2 시맨 틱 검색 부분을 취득하는 단계; 자연어 처리 의존 파싱 도구에 기반하여 상기 제1 레이블링 결과의 지식 그래프 기정 정보 부분과 상기 제2 시 맨틱 검색 부분 중의 각 시퀀스 레이블링 부분 간의 의존 관계에 대해 판정 수정을 수행하여 제2 레이블링 결과 를 취득하는 단계; 상기 지식 그래프에 기반하여 상기 제2 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는 단계 를 포함하는, 시맨틱 검색 방법. 청구항 4 제3항에 있어서, 상기 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 단계는, 사전훈련된 2개-타워 시맨틱 매칭 모델에 기반하여 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 상기 개체와 상기 시맨틱 검색 부분의 의미 관련도를 취득하는 단계; 상기 의미 관련도를 사전설정 역치와 비교하여 상기 의미 관련도가 상기 사전설정 역치보다 높은 개체 집합을 취득하는 단계를 포함하는, 시맨틱 검색 방법. 청구항 5 제4항에 있어서, 상기 사전훈련된 2개-타워 시맨틱 매칭 모델의 입력소스는, 상기 시맨틱 검색 부분의 시맨틱 검색 워드와 상기 지식 그래프의 개체 정보를 포함하는, 시맨틱 검색 방법. 청구항 6 시맨틱 검색 장치로서, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 상기 쿼리 정보에 대해 시퀀스 레이블링을 수행하여 시퀀스 레이블링 결과를 취득하는 레이블링 모듈 - 상기 시퀀스 레이블링 결과는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함함 - ; 상기 지식 그래프에 기반하여 상기 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하는 구축 모듈; 및 상기 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 매칭 모듈을 포함하는, 시맨틱 검색 장치. 청구항 7 제6항에 있어서, 상기 레이블링 모듈은 쿼리 정보를 수신하고, 사전구축된 지식 그래프 및 사전훈련된 시퀀스 레이블링 모델을 이용하여 상기 쿼리 정 보를 시퀀스 레이블링하여 제1 레이블링 결과를 취득하는 레이블링 서브모듈; 상기 제1 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는 수정 서브모듈을 포함하는, 시맨틱 검색 장치. 청구항 8 제7항에 있어서, 상기 수정 서브모듈은 나아가, 자연어 처리 토큰화 도구에 기반하여 상기 제1 레이블링 결과의 시맨틱 검색 부분을 토큰화하여 제1 시맨틱 검 색 부분을 취득하고; 자연어 처리 개체명 인식 도구에 기반하여 상기 제1 시맨틱 검색 부분에 대해 개체명 수정을 수행하여 제2 시맨 틱 검색 부분을 취득하고; 자연어 처리 의존 파싱 도구에 기반하여 상기 제1 레이블링 결과의 지식 그래프 기정 정보 부분과 상기 제2 시 맨틱 검색 부분 중의 각 시퀀스 레이블링 부분 간의 의존 관계에 대해 판정 수정을 수행하여 제2 레이블링 결과 를 취득하고; 상기 지식 그래프에 기반하여 상기 제2 레이블링 결과를 수정하여 상기 시퀀스 레이블링 결과를 취득하는, 시맨틱 검색 장치. 청구항 9 제8항에 있어서, 상기 매칭 모듈은 나아가, 사전훈련된 2개-타워 시맨틱 매칭 모델에 기반하여 후보 개체 집합 중의 개체와 상기 시퀀스 레이블링 결과 중 의 시맨틱 검색 부분을 시맨틱 매칭시켜 상기 개체와 상기 시맨틱 검색 부분의 의미 관련도를 취득하고; 상기 의미 관련도를 사전설정 역치와 비교하여 상기 의미 관련도가 상기 사전설정 역치보다 높은 개체 집합을 취득하는, 시맨틱 검색 장치. 청구항 10 제9항에 있어서, 상기 사전훈련된 2개-타워 시맨틱 매칭 모델의 입력소스는 상기 시맨틱 검색 부분의 시맨틱 검색 워드와 상기 지식 그래프의 개체 정보를 포함하는, 시맨틱 검색 장치. 청구항 11 전자기기로서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신적으로 연결되는 메모리를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장되어 있고, 상기 명령은 상기 적어도 하나의 프로세서에 의해 실행됨으로써 상기 적어도 하나의 프로세서가 제1항 내지 제5항 중 어느 한 항 에 따른 방법을 수행하도록 하는, 전자기기. 청구항 12 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 저장매체로서, 상기 컴퓨터 명령은 상기 컴퓨터가 제1항 내지 제5항 중 어느 한 항에 따른 방법을 수행하도록 하는, 비일시적 컴퓨터 판독가능 저장매체. 청구항 13 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 프로세서에 의해 실행되는 경우, 제1항 내지 제5항 중 어느 한 항에 따른 방법을 구현 하는, 매체에 저장된 컴퓨터 프로그램. 발명의 설명 기 술 분 야 본 출원의 실시예는 컴퓨터 분야에 관한 것으로, 구체적으로 지식 그래프에 관한 것이고, 심층학습 및 자연어 처리 등의 인공지능 분야에 관한 것이고, 특히 시맨틱 검색 방법, 장치, 기기 및 저장매체에 관한 것이다."}
{"patent_id": "10-2021-0166442", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능의 보급과 발전에 따라, 인터넷의 방대한 정보 중에서 사용자는 자주 서치 엔진에 의해 필요한 정보를 검색하여야 하나, 현재 서치 엔진의 검색 효과는 그다지 이상적이지 않아 사용자의 쿼리 정보를 완전히 이해할 수 없다. 현재의 시맨틱 검색 방법은 대다수가 사용자의 쿼리 정보를 단지 개체명을 포함하는 정보로 간주하고 직접 퍼지 검색으로 매칭하거나, 또는 쿼리 정보에 대해서만 토큰화하고 관련성을 이용하여 판정하는바, 사용자의 쿼리 정 보를 제대로 이해하지 못하게 되고 따라서 보다 큰 착오율이 초래된다. 본 출원의 실시예는 시맨틱 검색 방법, 장치, 기기 및 저장매체를 제시한다. 첫 번째 측면으로, 본 출원의 실시예는 시맨틱 검색 방법을 제시하는바, 이는, 쿼리 정보를 수신하고, 사전구축 된 지식 그래프에 기반하여 쿼리 정보를 시퀀스 레이블링하여 시퀀스 레이블링 결과를 취득하는 단계 - 여기서, 시퀀스 레이블링 결과는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함함 - ; 지식 그래프에 기반하 여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하는 단계; 및 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 단계를 포함한다. 두 번째 측면으로, 본 출원의 실시예는 시맨틱 검색 장치를 제시하는바, 이는, 쿼리 정보를 수신하고, 사전구축 된 지식 그래프에 기반하여 쿼리 정보를 시퀀스 레이블링하여 시퀀스 레이블링 결과를 취득하는 레이블링 모듈 - 여기서, 시퀀스 레이블링 결과는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함함 - ; 지식 그래프 에 기반하여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하는 구축 모듈; 및 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득하는 매칭 모듈을 포함한다. 세 번째 측면으로, 본 출원의 실시예는 전자기기를 제시하는바, 이는, 적어도 하나의 프로세서; 및 적어도 하나 의 프로세서에 통신적으로 연결되는 메모리를 포함하고, 메모리에는 적어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장되어 있고, 명령은 적어도 하나의 프로세서에 의해 실행됨으로써 적어도 하나의 프로세서는 첫 번째 측면의 어느 한 구현방식에 따른 방법을 수행할 수 있다. 네 번째 측면으로, 본 출원의 실시예는 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 저장매체를 제 시하는바, 컴퓨터 명령은 컴퓨터가 첫 번째 측면의 어느 한 구현방식에 따른 방법을 수행하도록 한다. 다섯 번째 측면으로, 본 출원의 실시예는 매체에 저장된 컴퓨터 프로그램을 제시하는바, 컴퓨터 프로그램은 프 로세서에 의해 실행되는 경우, 첫 번째 측면의 어느 한 구현방식에 따른 방법을 구현한다. 본 출원의 실시예에 의해 제공되는 시맨틱 검색 방법, 장치, 기기 및 저장매체는, 우선, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 쿼리 정보를 시퀀스 레이블링하여 시퀀스 레이블링 결과를 취득하는바, 여 기서, 시퀀스 레이블링 결과는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함하고; 다음, 지식 그래 프에 기반하여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하고; 마지막으로 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득한다. 본 출원은 지식 그래프에 기반하는 시맨틱 검색 방법을 제공하는바, 시맨틱 검색의 효율 및 정확률을 향상하고, 나아가 사용자 경험을 향상한다. 이 부분에서 기술하는 내용은 본 개시의 실시예의 핵심적인 또는 중요한 특징을 표시하고자 하는 것이 아니며, 본 개시의 범위를 한정하고자 하는 것도 아님을 이해하여야 한다. 본 개시의 다른 특징은 하기한 발명의 설명에 의해 이해하기 수월해질 것이다."}
{"patent_id": "10-2021-0166442", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래, 첨부도면을 결부하여 본 출원의 예시적인 실시예를 설명하고자 하는데, 여기에는 본 출원의 실시예의 다 양한 세부사항이 이해를 돕기 위해 포함되는바, 이는 단지 예시적인 것으로 간주되어야 한다. 따라서 당업자라 면, 본 출원의 범위 및 사상에 위배되지 않으면서 여기서 기술되는 실시예에 대한 다양한 변경 및 수정이 가능 하다는 것을 인지하여야 한다. 마찬가지로, 명확함과 간결함을 위해, 아래 기술에서는 공지된 기능 및 구조에 대한 기술은 생략한다. 부연하면, 상충되지 않은 한, 본 출원의 실시예 및 실시예 중의 특징은 상호 결합될 수 있다. 아래, 첨부도면을 참조하고 실시예를 결부하여 본 출원을 상세히 설명하고자 한다. 도1은 본 출원의 시맨틱 검색 방법 또는 시맨틱 검색 장치의 실시예가 응용될 수 있는 예시적인 시스템 아키텍 처를 도시한다. 도1에 도시한 바와 같이, 시스템 아키텍처는 단말기기(101, 102, 103), 네트워크 및 서버를 포 함할 수 있다. 네트워크는 단말기기(101, 102, 103) 및 서버 사이에서 통신 링크를 제공하는 매체로 사용된다. 네트워크는 다양한 연결 유형, 예를 들어 유선, 무선 통신 링크 또는 광섬유 케이블 등을 포함 할 수 있다. 사용자는 단말기기(101, 102, 103)를 사용하여 네트워크를 통해 서버와 인터랙션함으로써 메세지 등 을 수신하거나 송신할 수 있다. 단말기기(101, 102, 103)에는 다양한 클라이언트 앱, 예를 들어 서치 엔진 등이 설치될 수 있다. 단말기기(101, 102, 103)는 하드웨어일 수도 있고 소프트웨어일 수도 있다. 단말기기(101, 102, 103)가 하드웨 어인 경우, 다양한 전자기기일 수 있는바, 스마트폰, 태블릿 컴퓨터, 휴대형 랩톱 컴퓨터 및 데스크톱 컴퓨터 등을 포함하나 이에 한정되지 않는다. 단말기기(101, 102, 103)가 소프트웨어인 경우, 상술한 전자기기에 설치 될 수 있다. 이는 복수의 소프트웨어 또는 소프트웨어 모듈로 구현될 수도 있고, 단일 소프트웨어 또는 소프트 웨어 모듈로 구현될 수도 있다. 여기서 구체적으로 한정하지 않기로 한다. 서버는 다양한 서비스를 제공할 수 있다. 예를 들어, 서버는 단말기기(101, 102, 103)로부터 취득된 메세지를 분석하고 처리하여 처리 결과(예를 들어 개체 집합)를 생성할 수 있다. 부연하면, 서버는 하드웨어일 수도 있고 소프트웨어일 수도 있다. 서버가 하드웨어인 경우, 복수의 서버로 구성되는 분산 서버 클러스터로 구현될 수도 있고 단일한 서버로 구현될 수도 있으며. 서버가 소프 트웨어인 경우, 복수의 소프트웨어 또는 소프트웨어 모듈(예를 들어 분산 서비스를 제공하기 위한)로 구현될 수 도 있고, 단일 소프트웨어 또는 소프트웨어 모듈로 구현될 수도 있다. 여기서 구체적으로 한정하지 않기로 한다. 부연하면, 본 출원의 실시예에 의해 제공되는 시맨틱 검색 방법은 일반적으로 서버에 의해 수행되는바, 상 응하게, 시맨틱 검색 장치는 일반적으로 서버에 설치된다. 도1에서의 단말기기, 네트워크 및 서버의 수량은 단지 예시적인 것임을 이해하여야 한다. 구현의 필요에 따라 임의 수량의 단말기기, 네트워크 및 서버를 가질 수 있다. 계속하여 도2를 참조하면, 이는 본 출원에 따른 시맨틱 검색 방법의 일 실시예의 흐름을 도시한다. 해당 시맨틱 검색 방법은 하기 단계를 포함한다. 단계에서, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 쿼리 정보를 시퀀스 레이블링하여 시퀀스 레이블링 결과를 취득한다. 본 실시예에서, 시맨틱 검색 방법의 수행주체(예를 들어 도1에 도시한 서버)는 쿼리 정보를 수신하고, 사 전구축된 지식 그래프에 기반하여 쿼리 정보를 시퀀스 레이블링하여 시퀀스 레이블링 결과를 취득할 수 있는바, 여기서, 시퀀스 레이블링 결과는 지식 그래프 기정(旣定) 정보 부분 및 시맨틱 검색 부분을 포함한다. 쿼리 정 보는 사용자에 의해 입력된, 그의 쿼리 수요를 표현할 수 있는 임의의 텍스트 정보일 수 있고, 사용자에 의해 입력된 쿼리 정보가 수신되면, 사전구축된 지식 그래프에 기반하여 쿼리 정보에 대해 시퀀스 레이블링을 수행한 다. 지식 그래프는, 서로 다른 개체 간의 관계 및 개체(entity)의 속성을 표시하는 데이터베이스이다. 지식 그 래프에서, 개체를 노드로 하고 개체와 개체 사이, 및 개체와 그에 대응되는 값 사이를 간선으로 연결함으로써 구조화된, 그래프 형태의 데이터베이스를 구성한다. 개체(또는 개념으로 지칭됨)는, 현실 세계에 존재하거나 또 는 존재한 적 있는 구체적인 물체 개체 또는 추상적인 개념을 가리키는바, 예를 들면 인물, 물품, 구조, 제품, 영화/텔레비전, 건축물, 지점, 국가, 조직, 예술 작품, 과학기술, 과학 정리 등이 있다. 개체와 개체 간의 연결 (간선)은 개체 간의 관계를 표시하고; 개체와 값 간의 연결(간선)은 개체가 해당 값을 가진다는 속성을 표시한 다. 지식 그래프는 종래의 지식 그래프 구축 방법을 적용하여 구축할 수 있는 것으로, 예를 들면 지식 그래프 신경망 훈련 모델을 적용하여 지식 그래프를 구축하는 등이 있는데, 본 출원은 이에 대해 구체적으로 한정하지 않는다. 예시로, 사전훈련된 시퀀스 레이블링 모델을 적용하여 쿼리 정보에 대해 시퀀스 레이블링을 수행하여 쿼리 정보를 지식 그래프 기정 정보 부분과 시맨틱 검색 부분으로 레이블링할 수 있다. 지식 그래프 기정 정보 부분은 지식 그래프에 이미 존재하는 정보이며, 예를 들어, 쿼리 정보가 \"A가 연기한 야외 생존 영화가 황야 뭐 였지\"인 경우, 지식 그래프에 기반하여 \"A\"는 개체로서 스타 배우 A1의 별칭이고, 사용자가 알고 있는 도메인 (domain)은 영화이고, 영화의 제목이 \"황야 xx\" 임을 알 수 있다. 시맨틱 검색 부분은 지식 그래프 문자열 측면 에서 인지되지 않는 부분으로, 후속으로 시맨틱 매칭이 필요한 정보이다. 예시로, 쿼리 정보가 \"B가 역1을 연기 하고 C가 역2를 연기하고 N한 영화가 뭐였지\"인 경우, 여기서, N은 영화 줄거리를 기술한 정보이고, B와 C는 쿼 리 정보에서 이미 연기자로 지정되었고(지식 그래프 기정 정보), B의 역이 역1(지식 그래프 기정 정보)이고, C 가 연기한 것이 역2(지식 그래프 기정 정보)이고, 사용자가 찾는 domain이 영화(지식 그래프 기정 정보)이고, 사용자가 질문한 문제가 영화 제목(지식 그래프 기정 정보)이고, 시맨틱 검색 부분(semantic)이 N이므로, 취득 된 시퀀스 레이블링 결과는, B[starring(주연)]가 역1[character(역)]을 연기하고 C[starring]가 역 2[character]를 연기하고 N[semantic]한 영화[domain]가 뭐였지[expression(표현)]이다. 단계에서, 지식 그래프에 기반하여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축한다. 본 실시예에서, 상술한 수행주체는 지식 그래프에 기반하여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축할 수 있다. 완비된 지식 그래프 정보에 기반하여, 시퀀스 레이블링 결과에 대하여 후보 개체 집합의 선별 을 수행하고, 이미 있는 정보에 기반하여 후보 개체 집합을 최대한으로 축소하여 후보 개체 집합이 시퀀스 레이 블링 결과에 더 부합되고, 더 정확해지도록 한다. 예시로, 쿼리 정보가 \"B가 역1을 연기하고 C가 역2를 연기하 고 N한 영화가 뭐였지\"인 경우, 여기서, N은 영화 줄거리를 기술한 정보이고, 해당 쿼리 정보에 대해 시퀀스 레 이블링을 수행하는바, 시퀀스 레이블링 결과로, B[starring]가 역1[character]을 연기하고 C[starring]가 역 2[character]를 연기하고 N[semantic]한 영화[domain]가 뭐였지[expression]를 취득할 수 있다. 쿼리 정보를 분석하면 찾고자 하는 바가 domain이 영화인 일 부류의 개체임을 발견하게 되는데, 지식 그래프 정보를 이용하 여 우선, domain이 영화인 전체 개체 집합을 서치하고; 다음 B와 C가 동시에 starring 연기자인 개체 집합을 찾 고; 다음, B가 개체 중의 역이 역1인지를 판정하고, 존재하지 않음이 발견되면, 다시 C의 역이 역2인지 여부를 판정하고, 역시 존재하지 않음이 발견되면, 이때 사용자에 의해 입력된 역은 대신 쓰는 호칭이거나 또는 별칭이 거나 또는 상하위 개념 정보라고 판정한다. 따라서, 지식 그래프 상하위 개념 정보를 이용하여 B가 연기한 것이 역3이고, 역1은 역3의 하위이고, 역3은 역1의 상위(총칭)임을 발견하고, 따라서 B가 연기한 역이 역1이고, 역3 이 상하위 개념 중에 존재하는 모든 개체를 선별하여 후보 개체 집합을 나아가 축소한다. 따라서, 비록 역1이 어느 한 영화 개체의 character와 완전히 동일하지 않더라도, 일부 개체의 character가 역3이고 하위가 역1인 경우가 존재하는바, 따라서 이 또한 후보 개체 집합의 선별을 수행할 수 있다. 그러나 역2에 있어서, 지식 그래 프 상하위 개념 정보를 이용하여서는 후보 개체 집합을 축소하는 관련된 방법을 취득할 수 없는바, 이때는 시퀀 스 레이블링 결과를 수정할 수 밖에 없으며, 역2의 character를 semantic으로 수정하고, 후속으로 시맨틱 매칭 을 수행할 수 밖에 없다. 그리고, 얻게되는 최종 시퀀스 레이블링 결과는 하기와 같이, \"B[starring]가 역 1[character]을 연기하고 C[starring]가 역2[semantic]를 연기하고 N[semantic]한 영화[domain]가 뭐였지 [expression]\"이다. 단계에서, 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득한다. 본 실시예에서, 상술한 수행주체는 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득할 수 있다. 단계에서 이미 구축 된 후보 개체 집합에 기반하면, 오프라인 훈련된, 사전훈련된 시맨틱 매칭 모델에 기반하여 후보 개체 집합 중 의 각각의 개체를 순차로 쿼리 정보의 시퀀스 레이블링 결과 중의 semantic 부분과 시맨틱 매칭시킴으로써 의미 관련도가 높은 개체 집합을 선택할 수 있다. 예시로, 쿼리 정보가 \"B가 역1을 연기하고 C가 역2를 연기하고 N한 영화가 뭐였지\"인 경우, 여기서, N은 영화 줄거리를 기술한 정보이고, 쿼리 정보의 시퀀스 레이블링 결과는, B[starring]가 역1[character]을 연기하고 C[starring]가 역2[semantic]를 연기하고 N[semantic]한 영화 [domain]가 뭐였지[expression]이고, 가령, 단계에 기반하여 얻은 후보 개체 집합에 30개의 후보 개체가 포함된다면, 오프라인 훈련된 사전훈련된 시맨틱 매칭 모델을 이용하여, 30개의 개체를 순차로 semantic부분(즉 \"역2\" 및 \"N\")에 시맨틱 매칭시키고, 의미 관련도를 계산하여, 의미 관련도가 높은 개체 또는 개체 집합을 얻는 바, 여기서, 의미 관련도는 0~1 사이의 수치이고, 수치가 높을수록 관련성이 더 높다. 본 출원의 실시예에 의해 제공되는 시맨틱 검색 방법, 우선, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 쿼리 정보를 시퀀스 레이블링하여 시퀀스 레이블링 결과를 취득하는바, 여기서, 시퀀스 레이블링 결과 는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함하고; 다음, 지식 그래프에 기반하여 시퀀스 레이블 링 결과에 부합되는 후보 개체 집합을 구축하고; 마지막으로 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득한다. 본 출 원은 지식 그래프에 기반하는 시맨틱 검색 방법을 제공하는데, 사용자 쿼리 정보의 복잡한 시맨틱을 충분히 이 해하여, 사용자의 쿼리 정보를 지식 그래프 기정 정보 부분과 시맨틱 검색 부분으로 나눌 수 있고, 시맨틱 검색 부분을 구축된 후보 개체 집합 내의 각각의 개체에 시맨틱 매칭시켜 의미 관련도가 가장 높은 개체 집합을 선택 하여 이를 최종 결과로 하여 사용자한테 반환할 수 있는바, 시맨틱 검색의 효율 및 정확률을 향상시키고 사용자 경험 역시 향상시킨다. 계속하여 도3을 참조하면, 도3은 본 출원에 따른 시맨틱 검색 방법의 다른 실시예의 흐름을 도시한다. 해 당 시맨틱 검색 방법은 하기 단계를 포함한다. 단계에서, 쿼리 정보를 수신하고, 사전구축된 지식 그래프 및 사전훈련된 시퀀스 레이블링 모델을 이용하 여 쿼리 정보를 시퀀스 레이블링하여 제1 레이블링 결과를 취득한다. 본 실시예에서, 시맨틱 검색 방법의 수행주체는 쿼리 정보를 수신하고, 사전구축된 지식 그래프 및 사전훈련된 시퀀스 레이블링 모델을 이용하여 쿼리 정보를 시퀀스 레이블링하여 제1 레이블링 결과를 취득할 수 있는바, 여 기서, 제1 레이블링 결과는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함한다. 사용자 쿼리 정보를 지식 그래프 기정 정보 부분과 시맨틱 검색 부분으로 레이블링함으로써 사용자 쿼리 정보의 복잡 시맨틱을 충분 히 이해하는 효과에 달성할 수 있다. 대안으로, 또한 사전구축된 지식 그래프과 ERNIE+BiLSTM+CRF사전훈련된 시퀀스 레이블링 모델을 이용하여 쿼리 정보를 시퀀스 레이블링하여 쿼리 정보 중의 지식 그래프 기정 정보 부분과 시맨틱 검색 부분을 구분함으로써 제1 레이블링 결과를 취득할 수 있다. BiLSTM+CRF는 시퀀스 레이블링 알고리즘으로, 이는 BiLSTM(Bilateral Long Short-Term Memory, 양방향 장단기 메모리 네트워크)과 CRF(Conditional Random Field, 조건적 임의 필드)를 일체로 결합시킨 것인바, 모델이 CRF처럼 시퀀스 전후 간의 관련성을 고려하도록 할 수 있으면서 LSTM 의 특징 추출 및 피팅 능력을 가질 수도 있게끔 할 수 있다. ERNIE(Enhanced Representation from kNowledge IntEgration)는 지식 강화에 기반하는 지속 학습 시맨틱 이해 프레임워크로, 해당 프레임춰크는 빅 데이터 사전 훈련에 멀티소스의 풍부한 지식을 결합시키고, 지속 학습 기술에 의해, 방대한 양의 텍스트 데이터 중의 어휘, 구조, 시맨틱 등 측면의 지식을 부단히 흡수하여, 모델 효과의 부단한 진화를 구현한다. ERNIE는 하나의 문맥에 상관되는 전이 학습 모델이므로, 모델 능력이 나아가 더 강화된다. 예시로, 수동 레이블링된 훈련 샘플에 기반 하여 ERNIE+BiLSTM+CRF사전훈련된 시퀀스 레이블링 모델을 구축하고 쿼리 정보 중의 성분에 대해 레이블링할 수 있다. 대안으로, 사전구축된 지식 그래프과 BiLSTM+CRF사전훈련된 시퀀스 레이블링 모델을 이용하여 쿼리 정보를 시퀀 스 레이블링하여 쿼리 정보 중의 지식 그래프 기정 정보 부분과 시맨틱 검색 부분을 구분함으로써 제1 레이블링 결과를 취득할 수 있다. 단계에서, 제1 레이블링 결과를 수정하여 시퀀스 레이블링 결과를 취득한다. 본 실시예에서, 상술한 수행주체는 제1 레이블링 결과를 수정하여 시퀀스 레이블링 결과를 취득할 수 있다. 예 시로, 지식 그래프과 자연어 처리 도구를 이용하여 제1 레이블링 결과를 수정하여 더 정확하게 쿼리 정보 중의 각 부분을 레이블링하여 쿼리 정보 중의 지식 그래프 기정 정보 부분과 시맨틱 검색 부분을 구분하여, 검색이 필요한 부분만을 검색함으로써 시맨틱 검색의 범위를 축소할 수 있다. 예를 들어, 상술한 쿼리 정보인 \"A가 연 기한 야외 생존 영화가 황야 뭐였지\" 중의 \"뭐였지\"는 사실 상 문제의 표현어이지, 시맨틱 검색해야 할 부분이 아닌바, 강제로 검색개체와 \"뭐였지\"를 시맨틱 매칭시키는 경우, 정확률을 급격히 저하시키거나 또는 \"A\"라는 별칭을 전혀 모르면서, 강제로 \"A\"를 사용하여 개체 줄거리 정보에 대해 시맨틱 매칭을 수행하는 경우에도 정확 률을 급격히 저하시킨다. 단계에서, 지식 그래프에 기반하여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축한다. 본 실시예에서, 상술한 수행주체는 지식 그래프에 기반하여 상술한 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축할 수 있다. 단계는 전술한 실시예의 단계에 대응되고, 구체적인 구현방식은 전술한, 단 계에 대한 기술을 참조할 수 있는바, 여기서 상세한 설명은 생략하기로 한다. 단계에서, 사전훈련된 2개-타워 시맨틱 매칭 모델에 기반하여 후보 개체 집합 중의 개체와 시퀀스 레이블 링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 개체와 시맨틱 검색 부분의 의미 관련도를 취득한다. 본 실시예에서, 상술한 수행주체는 사전훈련된 2개-타워 시맨틱 매칭 모델에 기반하여 후보 개체 집합 중의 개 체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 개체와 시맨틱 검색 부분의 의미 관련도 를 취득할 수 있다. 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 semantic부분을 사전훈련된 2개-타 워 시맨틱 매칭 모델에 입력하여 후보 개체 집합 중의 각각의 개체와 semantic부분의 의미 관련도를 취득함으로 써 시맨틱 검색의 관련성 매칭의 문제를 해결한다. 예시로, 시맨틱 검색 부분의 시맨틱 검색 워드와 후보 개체 집합 중의 개체 정보를 ERNIE+SIAMESE+POINTWISE+LSTM사전훈련된 시맨틱 매칭 모델에 입력함으로써 시맨틱 검색 워드와 후보 개체 집합 중의 개체의 의미 관련도를 취득할 수 있다. SIAMESE네트워크는 2개 입력을 수신할 수 있고, POINTWISE는 관용의 합성곱 방식인바, ERNIE, SIAMESE, POINTWISE 및 LSTM(Long Short-Term Memory, 장 단기 메모리 네트워크)를 결합시켜 사전훈련된 시맨틱 매칭 모델을 구축함으로써, 시맨틱 검색 워드 및 후보 개 체 집합 중의 각각의 개체를 입력하면 출력 결과 - 시맨틱 검색 워드 및 후보 개체 집합 중의 각각의 개체의 의 미 관련도 - 를 얻을 수 있도록 한다. 예를 들어, 쿼리 정보가 \"M단지생활에 관한 영화\"인 경우, 얻게 되는 시 퀀스 레이블링 결과는, \"[preposition(전치사)]M단지[semantic]생활[semantic]에 관한 영화[domain]\"이고, 단 계에 기반하여 영화/텔레비전 후보 개체 집합을 얻을 수 있고, 영화/텔레비전 후보 개체 집합 중의 각각의 개체의 개체 정보를 semantic부분의 \"M단지\" 및 \"생활\"에 시맨틱 매칭시키면, semantic부분과 각각의 개체의 의 미 관련도를 취득할 수 있다. 본 실시예의 일부 대안적인 구현방식에서, 사전훈련된 2개-타워 시맨틱 매칭 모델의 입력소스를 시맨틱 검색 부 분의 시맨틱 검색 워드와 지식 그래프의 개체 정보를 포함하는바, 여기서, 지식 그래프의 개체 정보는 개체 줄 거리 기술과 개체 기술적 태그를 포함한다. 단계에서, 의미 관련도를 사전설정 역치와 비교하여 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득한다. 본 실시예에서, 상술한 수행주체는 의미 관련도를 사전설정 역치와 비교하여 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득할 수 있다. 의미 관련도는 0~1 사이의 한 수치로, 예시로, 역치를 0.9로 설정할 수 있는 바, 즉semantic부분의 각각의 시맨틱 검색 워드와의 관련도가 모두 0.9이상인 개체를 선택하고, 해당 개체와 모 든 시맨틱 검색 워드와의 관련도의 평균값을 계산하여, 해당 평균값을 해당 개체의 최종 점수로 한다. 예를 들 어, \"[preposition(전치사)]M단지[semantic]생활[semantic]에 관한 영화[domain]\"라는 쿼리 정보에서, semantic부분은 \"M단지\" 및 \"생활\"을 포함하는데, 가령, 영화/텔레비전 후보 개체 집합 중의 개체1은 검색 워드 \"M단지\"와의 관련도가 0.92이고 검색 워드 \"생활\"과의 관련도가 0.8이며, 개체2는 검색 워드 \"M단지\"와의 관련 도가 0.92이고 검색 워드 \"생활\"과의 관련도가 0.96인 경우, 개체2는 남겨두고 개체1은 남겨두지 않는 쪽을 선 택하는바, 개체2의 최종 점수는 (0.92+0.96)/2=0.94이다. 최종적으로 평균 점수가 가장 높은 앞의 3개 개체를 답으로 하여 사용자한테 반환하고, 3개까지 없다면 몇개이면 몇개를 반환하는바, 본 출원은 이에 대해 구체적으 로 한정하지 않는다. 본 출원의 실시예에 의해 제공되는 시맨틱 검색 방법은, 우선, 쿼리 정보를 수신하고, 사전구축된 지식 그래프 및 사전훈련된 시퀀스 레이블링 모델을 이용하여 쿼리 정보를 시퀀스 레이블링하여 제1 레이블링 결과를 취득하고; 제1 레이블링 결과를 수정하여 시퀀스 레이블링 결과를 취득하고; 다음, 지식 그래프에 기반하여 시퀀스 레 이블링 결과에 부합되는 후보 개체 집합을 구축하고; 이후, 사전훈련된 2개-타워 시맨틱 매칭 모델에 기반하여 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 개체와 시맨틱 검 색 부분의 의미 관련도를 취득하고; 마지막으로 의미 관련도를 사전설정 역치와 비교하여 의미 관련도가 사전설 정 역치보다 높은 개체 집합을 취득한다. 본 출원의 실시예에 의해 제공되는 시맨틱 검색 방법은, 시퀀스 레이 블링 결과의 시맨틱 검색 부분을 후보 개체 집합 중의 각각의 개체에 시맨틱 매칭시킴으로써 의미 관련도가 가 장 높은 개체 집합을 획득하는바, 사용자의 쿼리 의도를 충분히 이해하고, 시맨틱 검색의 정확률를 향상시키고 사용자 경험을 향상시킨다. 계속하여 도4를 참조하면, 이는 도3에 도시한 시맨틱 검색 방법의 수정 단계의 분해 흐름을 도시한다. 해 당 수정 단계는 하기한 바와 같이 분해할 수 있다. 단계에서, 자연어 처리 토큰화 도구에 기반하여 제1 레이블링 결과의 시맨틱 검색 부분을 토큰화하여 제1 시맨틱 검색 부분을 취득한다. 본 실시예에서, 자연어 처리(Natural Language Processing, NLP) 토큰화 도구를 이용하여 제1 레이블링 결과의 semantic부분을 토큰화하여 제1 시맨틱 검색 부분을 취득한다. 토큰화는 semantic시맨틱 검색 부분을 더 잘 이 해하고 semantic시맨틱 검색 부분과 개체의 시맨틱 매칭이 더 정확해지도록 하기 위한 것으로, 그러지 아니한 경우, 문자열이 너무 길어져 시맨틱 정보에 편차가 있게 된다. 예를 들어, 쿼리 정보가 \"M단지생활에 관한 영화\"인 경우, 시퀀스 레이블링 결과는, [preposition(전치사)][country]M단지생활[semantic]에 관한 영화 [domain]이다. NLP 토큰화 도구를 이용하여 semantic부분인 \"M단지생활\"을 토큰화하여 얻게 되는 제1 시맨틱 검 색 부분은, M[semantic]단지[semantic]생활[semantic]이다. 단계에서, 자연어 처리 개체명 인식 도구에 기반하여 제1 시맨틱 검색 부분에 대해 개체명 수정을 수행하 여 제2 시맨틱 검색 부분을 취득한다. 본 실시예에서, NLP 개체명 인식 도구를 이용하여, 단계에서 토큰화된 semantic시맨틱 검색 부분에 대해 개체명 수정을 수행함으로써, 토큰화 도구에 의해 개체명 부분이 토큰화로 분할됨으로 인해 시맨틱 매칭 효과에 영향주는 것을 방지할 수 있다. 예를 들면, 상술한 쿼리 정보 \"M단지생활에 관한 영화\"의 semantic부분 \"M단지 생활\"이, 단계를 거쳐 얻어지는 토큰화 결과는, M[semantic]단지[semantic]생활[semantic]이다. 그러나 \"M단지\"는 사실상 하나의 개체명으로 토큰화로 분할되어서는 안되므로, NLP 개체명 인식 도구를 이용하여 \"M단 지\" 전체를 하나의 개체명으로 인식하는바, 따라서 전체 시퀀스 레이블링 결과를 수정하여 얻게되는 제2 시맨틱 검색 부분은, M단지[semantic]이고, 온전한 쿼리 정보의 레이블링 결과는, [preposition]M단지[semantic]생활 [semantic]에 관한 영화[domain]이다. 단계에서, 자연어 처리 의존 파싱 도구에 기반하여 제1 레이블링 결과의 지식 그래프 기정 정보 부분과 제 2 시맨틱 검색 부분 중의 각 시퀀스 레이블링 부분 간의 의존 관계에 대해 판정 수정을 수행하여 제2 레이블링 결과를 취득한다. 본 실시예에서, NLP 의존 파싱 도구를 이용하여 쿼리 정보 중의 각 시퀀스 레이블링 부분 간의 의존 관계를 판 정하는바, 즉 제1 레이블링 결과의 지식 그래프 기정 정보 부분과 제2 시맨틱 검색 부분 중의 각 시퀀스 레이블 링 부분 간의 의존 관계에 대해 판정 수정을 수행하여 제2 레이블링 결과를 취득함으로써, 레이블링 결과가 더 정확해지도록 한다. 예를 들면, 쿼리 정보가 \"B가 역1을 연기하고 C가 역2를 연기하고 N한 영화가 뭐였지\"인 경 우, 시퀀스 레이블링 결과는, B[person]가 역1[character]을 연기하고 C[person]가 역2[character]를 연기하고 N[semantic]한 영화[domain]가 뭐였지[expression]이다. NLP 의존 파싱 도구에 기반하여 의존 관계(노드 간의 의존 관계)를 판정하는 경우, \"역1을 연기\"가 \"B\"를 수식하고 \"역2를 연기\"가 \"C\"를 수식한다는 것을 발견하게 되는바, 따라서 \"B\"와 \"C\" 이 두 명의 person은 반드시 연기자(starring)이지 감독이나 각본가 등이 아니다. 따 라서 계속하여 시퀀스 레이블링 결과를 수정하면, 제2 레이블링 결과인, \"B[starring]가 역1[character]을 연기 하고 C[starring]가 역2[character]를 연기하고 N[semantic]한 영화[domain]가 뭐였지[expression]\"를 취득하 게 된다. 단계에서, 지식 그래프에 기반하여 제2 레이블링 결과를 수정하여 시퀀스 레이블링 결과를 취득한다. 본 실시예에서, 지식 그래프를 이용하여 제2 레이블링 결과를 수정하여 최종의 시퀀스 레이블링 결과를 얻는다. 지식 그래프가 완비된 정보를 구비하므로, 제2 레이블링 결과 중의 기존의 레이블링 정보를 수정하는 것을 이용 하여, 시퀀스 레이블링을 그래프화함으로써 시퀀스 레이블링 결과가 더 정확해지도록 할 수 있다. 예를 들면,쿼리 정보가 \"D인 문예영화\"인 경우, 시퀀스 레이블링 결과는 하기한 바와 같이, D[person]인 문예[semantic] 영화[domain]이다. 지식 그래프 정보에 기반하면, D는 domain이 \"영화\"인 분야에 있고, 사람person으로서 감독, 각본가, 연기자 세 가지 유형의 신분이 있고, 쿼리 정보에서 D를 감독 등으로 강제로 지정한 바가 없다는 점을 발견하게 되는바, 따라서 수정을 수행하여 최종의 시퀀스 레이블링 결과는 하기한 바와 같이, D[director(감 독)/writing_credits(각본가)/starring]인 문예[semantic] 영화[domain]이다. 본 출원의 실시예에 의해 제공되는 수정 방법은, 우선, 자연어 처리 토큰화 도구에 기반하여 제1 레이블링 결과 의 시맨틱 검색 부분을 토큰화하여 제1 시맨틱 검색 부분을 취득하고; 다음, 자연어 처리 개체명 인식 도구에 기반하여 제1 시맨틱 검색 부분에 대해 개체명 수정을 수행하여 제2 시맨틱 검색 부분을 취득하고; 이후, 자연 어 처리 의존 파싱 도구에 기반하여 제1 레이블링 결과의 지식 그래프 기정 정보 부분과 제2 시맨틱 검색 부분 중의 각 시퀀스 레이블링 부분 간의 의존 관계에 대해 판정 수정을 수행하여 제2 레이블링 결과를 취득하고; 마 지막으로 지식 그래프에 기반하여 제2 레이블링 결과를 수정하여 시퀀스 레이블링 결과를 취득한다. 따라서 시 퀀스 레이블링 결과를 수정하는 방법이 제공되는바, NLP 도구를 이용하여 시퀀스 레이블링 결과 중의 시맨틱 검 색 부분에 대해 토큰화 및 개체명 인식을 수행함으로써, 시맨틱 매칭의 효과 및 정확률을 향상시키고, 지식 그 래프를 이용하여 기존의 시퀀스 레이블링 정보를 수정함으로써, 시퀀스 레이블링을 그래프화하여 레이블링 결과 의 정확성을 향상시킨다. 계속하여 도5를 참조하면, 도5는 본 출원의 시맨틱 검색 방법의 구현 블록도이다. 도5에 도시한 바와 같이, 사 용자에 의해 쿼리 정보(query)가 입력되면, 사전훈련된 시퀀스 레이블링 모델(ERNIE+BiLSTM+CRF)을 이용하여 쿼 리 정보를 시퀀스 레이블링하는데 레이블링 결과는 지식 그래프 기정 정보 부분과 시맨틱 검색 부분을 포함하고, 여기서, 사전훈련된 시퀀스 레이블링 모델은 수동 레이블링된 훈련 샘플을 훈련하고 미세조정하여 얻 어진다. 일 측면으로, npl 토큰화 도구, npl 개체명 인식 도구 및 npl 의존 파싱 도구를 이용하여 지식 그래프 기정 정보 부분을 처리하고, 지식 그래프에 기반하여 지식 그래프 기정 정보 부분을 수정하고 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축한다. 다른 측면으로, 시맨틱 검색 부분의 시맨틱 검색 워드 및 지식 그 래프의 개체 지식 정보를 사전훈련된 시맨틱 매칭 모델(ERNIE+SIAMESE+POINTWISE+LSTM)에 입력하여 EMBEDDING 층(임베딩층), LSTM층 및 DENSE층(완전연결층)을 거치도록 하고 그 Manhattan(맨해튼 거리) 또는 Cosine(코사인 유사도)를 계산하여 시맨틱 검색 부분의 시맨틱 검색 워드와 후보 개체 집합의 개체의 의미 관련도를 얻고, 의 미 관련도에 기반하여 후보 개체 집합을 선별하여 최종의 개체 집합을 얻는다. 계속하여 도6을 참조하면, 도6은 시맨틱 검색 방법의 응용 시나리오 도면이다. 도6에 도시한 바와 같이, 사용자 가 단말기기에서 쿼리 정보\"XXXXXXXXXX\"를 입력하고 클릭하여 서치하면, 서버는 단말기기 상의, 사용 자에 의해 입력된 쿼리 정보를 취득하고 사전구축된 지식 그래프에 의해 쿼리 정보를 시퀀스 레이블링하여 지식 그래프 기정 정보 부분과 시맨틱 검색 부분을 포함하는 시퀀스 레이블링 결과를 얻고, 지식 그래프에 기반하여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하고, 마지막으로 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득하고, 해당 개체 집합을 사용자한테 반환하여 단말기기에 표시하는바, 여기서, 개체 집합은 하나 또는 복수의 개체, 예컨대 개체1, 개체2, 개체3 등을 포함할 수 있다. 나아가 도7을 참조하면, 위의 각 도면에 도시한 방법에 대한 구현으로, 본 출원은 시맨틱 검색 장치의 일 실시 예를 제공하는바, 해당 장치 실시예는 도2에 도시한 방법 실시예에 대응되고, 해당 장치는 구체적으로 다양한 전자기기에 응용될 수 있다. 도7에 도시한 바와 같이, 본 실시예의 시맨틱 검색 장치는, 레이블링 모듈, 구축 모듈 및 매칭 모듈을 포함할 수 있다. 여기서, 레이블링 모듈, 쿼리 정보를 수신하고, 사전구축된 지식 그래프에 기반하여 쿼리 정보를 시퀀스 레이블링하여 시퀀스 레이블링 결과를 취득하는바, 여기서, 시퀀스 레이블링 결과 는 지식 그래프 기정 정보 부분 및 시맨틱 검색 부분을 포함하고; 구축 모듈은, 지식 그래프에 기반하여 시퀀스 레이블링 결과에 부합되는 후보 개체 집합을 구축하고; 매칭 모듈은, 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 의미 관련도가 사전설정 역치보다 높은 개체 집합을 취득한다. 본 실시예에서, 시맨틱 검색 장치에서 레이블링 모듈, 구축 모듈 및 매칭 모듈의 구체적인 처리 및 이에 따른 기술 효과는 도2에 대응되는 실시예 중의 단계 내지 단계의 관련 설명을 참조할 수 있는바, 이에 대한 상세한 설명은 생략하기로 한다. 본 실시예의 일부 대안적인 구현방식에서, 레이블링 모듈은, 쿼리 정보를 수신하고, 사전구축된 지식 그래프 및 사전훈련된 시퀀스 레이블링 모델을 이용하여 쿼리 정보를 시퀀스 레이블링하여 제1 레이블링 결과를 취득하는 레이블링 서브모듈; 제1 레이블링 결과를 수정하여 시퀀스 레이블링 결과를 취득하는 수정 서브모듈을 포함한다. 본 실시예의 일부 대안적인 구현방식에서, 수정 서브모듈은 나아가, 자연어 처리 토큰화 도구에 기반하여 제1 레이블링 결과의 시맨틱 검색 부분을 토큰화하여 제1 시맨틱 검색 부분을 취득하고; 자연어 처리 개체명 인식 도구에 기반하여 제1 시맨틱 검색 부분에 대해 개체명 수정을 수행하여 제2 시맨틱 검색 부분을 취득하고; 자연 어 처리 의존 파싱 도구에 기반하여 제1 레이블링 결과의 지식 그래프 기정 정보 부분과 제2 시맨틱 검색 부분 중의 각 시퀀스 레이블링 부분 간의 의존 관계에 대해 판정 수정을 수행하여 제2 레이블링 결과를 취득하고; 지 식 그래프에 기반하여 제2 레이블링 결과를 수정하여 시퀀스 레이블링 결과를 취득한다. 본 실시예의 일부 대안적인 구현방식에서, 매칭 모듈은 나아가, 사전훈련된 2개-타워 시맨틱 매칭 모델에 기반 하여 후보 개체 집합 중의 개체와 시퀀스 레이블링 결과 중의 시맨틱 검색 부분을 시맨틱 매칭시켜 개체와 시맨 틱 검색 부분의 의미 관련도를 취득하고; 의미 관련도를 사전설정 역치와 비교하여 의미 관련도가 사전설정 역 치보다 높은 개체 집합을 취득한다. 본 실시예의 일부 대안적인 구현방식에서, 사전훈련된 2개-타워 시맨틱 매칭 모델의 입력소스는 시맨틱 검색 부 분의 시맨틱 검색 워드와 지식 그래프의 개체 정보를 포함한다. 본 출원의 실시예에 따르면, 본 출원은 전자기기, 판독가능 저장매체 및 매체에 저장된 컴퓨터 프로그램을 더 제공한다. 도8은 본 개시의 실시예를 실시할 수 있는 예시적인 전자기기의 개략적인 블록도를 도시한다. 전자 기기는 다양한 형식의 디지털 컴퓨터, 예를 들어 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크벤치, 개인용 디지털 보조기, 서 버, 블레이드 서버, 대형 컴퓨터 및 다른 적합한 컴퓨터를 가리키고자 하는 것이다. 전자 기기는 다양한 형식의 이동 장치, 예를 들어 개인용 디지털 보조기, 셀룰러 폰, 스마트폰, 웨어러블 기기 및 이와 유사한 다른 컴퓨팅 기기를 가리킬 수도 있다. 본 명세서에서 제시하는 부품, 이들의 연결과 관계 및 이들의 기능은 단지 예시일 뿐, 본 명세서에서 기술한 및/또는 요구하는 본 개시의 구현을 한정하고자 하는 것이 아니다. 도8에 도시한 바와 같이, 기기는 컴퓨팅 유닛을 포함하고, 읽기 전용 메모리(ROM)에 저장된 컴 퓨터 프로그램 또는 저장 유닛에서 랜덤 액세스 메모리(RAM)로 로딩된 컴퓨터 프로그램에 따라 여러 가지 적당한 동작과 처리를 수행할 수 있다. RAM에는 기기 조작에 필요한 여러 가지 프로그램과 데이 터를 저장할 수도 있다. 컴퓨팅 유닛, ROM 및 RAM는 버스에 의해 서로 연결된다. I/O 인 터페이스도 버스에 연결된다. 기기 중의 복수의 부재가 I/O 인터페이스에 연결되는바, 입력 유닛, 예를 들어 키보드, 마우스 등; 출력 유닛, 예를 들어 다양한 유형의 표시장치, 스피커 등; 저장 유닛, 예를 들어 자기 디스크, 광 디스크 등; 및 통신 유닛, 예를 들어 네트워크 인터페이스 카드, 모뎀, 무선 통신 송수신기 등이 포함 된다. 통신 유닛은 기기가 인터넷과 같은 컴퓨터 네트워크 및/또는 다양한 전기통신망을 통해 다른 기기와 정보/데이터를 교환하도록 허락한다. 컴퓨팅 유닛은 처리 및 계산 능력을 가지는 다양한 범용의 및/또는 전용의 처리 어셈블리일 수 있다. 컴퓨 팅 유닛의 일부 예시는 중앙처리장치(CPU), 그래픽 처리 장치(GPU), 다양한 전용의 인공지능(AI) 컴퓨팅 칩, 머신 러닝 모델 알고리즘을 실행하는 다양한 컴퓨팅 유닛, 디지털 신호 프로세서(DSP) 및 임의의 적당한 프 로세서, 제어기, 마이크로제어기 등을 포함하나 이에 한정되지 않는다. 컴퓨팅 유닛은 상술한 각각의 방법 과 처리를 수행하는바, 예를 들어 시맨틱 검색 방법. 예를 들어, 일부 실시예에서, 시맨틱 검색 방법은 컴퓨터 소프트웨어 프로그램으로 구현될 수 있고, 이는 기계 판독가능 매체, 예를 들어 저장 유닛에 유형으로 (tangibly) 포함된다. 일부 실시예에서, 컴퓨터 프로그램의 일부 또는 전부가 ROM 및/또는 통신 유닛(80 9)에 의해 기기로 로딩되거나 설치될 수 있다. 컴퓨터 프로그램이 RAM에 로딩되어 컴퓨팅 유닛 에 의해 실행되는 경우, 상술한 시맨틱 검색 방법의 하나 또는 복수의 단계를 수행할 수 있다. 대안으로, 다른 실시예에서, 컴퓨팅 유닛은 다른 임의의 적당한 방식(예를 들어 펌웨어에 의해)으로 시맨틱 검색 방법을 수행할 수 있다. 본 명세서의 상술한 시스템 및 기술의 다양한 실시방식은 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프 로그램가능 게이트 어레이(FPGA), 주문형 집적회로(ASIC), 주문형 표준제품(ASSP), 시스템온칩(SOC), 복잡한 프 로그램 가능 논리 소자(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합 중에서 구현될 수있다. 이러한 다양한 실시방식은 하기한 바를 포함할 수 있다. 하나 또는 복수의 컴퓨터 프로그램에서 실시되고, 해당 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그램가능 프로세서를 포함하는 프로그 램가능 시스템에서 실행되거나 및/또는 해석될 수 있고, 해당 프로그램가능 프로세서는 전용의 또는 범용의 프 로그램가능 프로세서이고, 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있고 데이터와 명령을 해당 저장 시스템, 해당 적어도 하나의 입력 장치 및 해당 적어도 하나 의 출력 장치에 전송할 수 있다. 본 개시의 방법을 구현하는 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의 조합을 적용하여 작성할 수 있다. 이러한 프로그램 코드는 범용 컴퓨터, 전용 컴퓨터 또는 다른 프로그램가능 데이터 처리 장치의 프로 세서 또는 제어기에 제공되어, 프로그램 코드가 프로세서 또는 제어기에 의해 실행되는 경우, 흐름도 및/또는 블록도에서 규정하는 기능/조작이 수행되도록 한다. 프로그램 코드는 완전히 기계에서 실행될 수도 있고 부분적 으로 기계에서 실행될 수도 있고, 독립적인 소프트웨어 패키지로서 부분적으로는 기계에서 실행되고 부분적으로 는 원격 기계에서 실행되거나 또는 완전히 원격 기계 도는 서버에서 실행될 수 있다. 본 개시의 문맥 상으로, 기계 판독가능 매체는 유형의(tangible) 매체일 수 있는바, 이는, 명령 실행 시스템, 장치 또는 기기에 의해 사용되도록 또는 명령 실행 시스템, 장치 또는 기기에 결합되어 사용되도록 프로그램을 포함하거나 또는 저장할 수 있다. 기계 판독가능 매체는 기계 판독가능 저장 매체일 수 있다. 기계 판독가능 매 체는 전자의, 자기의, 광학의, 전자기의, 적외선의, 또는 반도체의 시스템, 장치 또는 기기, 또는 상술한 내용 의 임의 적합한 조합을 포함하나 이에 한정되지 않는다. 기계 판독가능 저장매체의 더 구체적인 예시는 하나 또 는 복수의 선에 기반하는 전기 연결, 휴대형 컴퓨터 디스크, 하드 디스크, 랜덤 액세스 메모리(RAM), 읽기 전용 메모리(ROM), 소거 및 프로그램 가능 읽기 전용 메모리(EPROM 또는 플래시 메모리), 광섬유, 컴팩트 디스크 읽 기 전용 메모리(CD-ROM), 광학 저장 기기, 자기 저장 기기, 또는 상술한 내용의 임의 적합한 조합을 포함할 수 있다. 사용자와의 인터랙션을 제공하기 위하여, 컴퓨터에서 여기서 기술하는 시스템과 기술을 실시할 수 있는바, 해당 컴퓨터는 사용자한테 정보를 표시하는 표시 장치(예를 들면 음극선관(CRT) 또는 액정 디스플레이(LCD) 모니터); 및 키보드와 포인팅 장치(예를 들면 마우스 또는 트랙볼)를 가질 수 있고, 사용자는 해당 키보드 및 해당 포인 팅 장치를 통해 컴퓨터에 입력을 제공할 수 있다. 다른 종류의 장치에 의해 사용자와의 인터랙션을 제공할 수도 있는바; 예를 들어 사용자한테 제공하는 피드백은 임의 형식의 센싱 피드백(예를 들면 시각 피드백, 청각 피드 백 또는 촉각 피드백)일 수 있고; 임의 형식(사운드 입력, 음성 입력 또는 촉각 입력을 포함함)으로 사용자로부 터의 입력을 수신할 수 있다. 여기서 기술하는 시스템 및 기술을 백그라운드 부품을 포함하는 컴퓨팅 시스템(예를 들면 데이터 서버로서), 또 는 미들웨어 부품을 포함하는 컴퓨팅 시스템(예를 들면 애플리케이션 서버), 또는 프론트엔드 부품을 포함하는 컴퓨팅 시스템(예를 들면 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 가지는 사용자 컴퓨터임, 사용자 는 해당 그래픽 사용자 인터페이스 또는 해당 네트워크 브라우저를 통해 여기서 기술하는 시스템 및 기술의 실 시방식과 인터랙션할 수 있음), 또는 이러한 백스테이지 부품, 미들웨어 부품, 또는 프론트엔드 부품의 임의 조 합을 포함하는 컴퓨팅 시스템에서 실시할 수 있다. 임의 형식 또는 매체의 디지털 데이터 통신(예를 들면 통신 망)를 통해 시스템의 부품을 서로 연결할 수 있다. 통신망의 예시는 근거리 통신망(LAN), 원거리 통신망(WAN) 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트와 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있 고 통상적으로는 통신망을 통해 인터랙션한다. 상응한 컴퓨터에서 실행되고 서로 클라이언트-서버 관계를 가지 는 컴퓨터 프로그램을 통해 클라이언트와 서버의 관계를 발생한다. 위에 도시한 다양한 형식의 흐름, 단계의 재정렬, 추가 또는 삭제를 이용할 수 있음을 이해하여야 한다. 예를 들어, 본 개시에 기재된 각 단계는 병렬로 수행될 수도 있고 순차로 수행될 수도 있고 서로 다른 순서로 수행될 수도 있는바, 본 개시에 개시된 기술방안의 기대 결과를 구현할 수 있기만 하면 되는 것으로, 본 명세서에서는 이에 대해 한정하지 않는다. 상술한 구체적인 실시방식은 본 개시의 보호 범위를 한정하지 않는다. 당업자라면, 설계 요구 및 다른 요소에 따른 다양한 수정, 조합, 서브 조합 및 치환이 가능하다는 점을 인지하여야 한다. 본 개시의 사상과 원칙 내에 서 수행되는 임의의 수정, 등가치환 및 개량 등은 모두 본 개시의 보호 범위에 포함되어야 한다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2021-0166442", "section": "도면", "subsection": "도면설명", "item": 1, "content": "아래 첨부도면을 참조한 비한정적인 실시예에 대한 상세한 기술을 읽어보면, 본 출원의 다른 특징, 목적 및 이 점이 더욱 분명해질 것이다. 첨부도면은 본 방안을 더 잘 이해하기 위한 것으로, 본 출원을 한정하지 않는다. 도1은 본 출원이 응용될 수 있는 예시적인 시스템 아키텍처 도면이고; 도2는 본 출원에 따른 시맨틱 검색 방법의 일 실시예의 흐름도이고; 도3은 본 출원에 따른 시맨틱 검색 방법의 다른 실시예 의 흐름도이고; 도4는 도3에 도시한 시맨틱 검색 방법의 수정 단계의 분해 흐름도이고; 도5는 본 출원의 시맨틱 검색 방법의 구현 블록도이고; 도6은 시맨틱 검색 방법의 응용 시나리오 도면이고; 도7은 본 출원에 따른 시맨틱 검색 장치의 일 실시예의 구조 개략도이고; 도8은 본 출원의 실시예의 시맨틱 검색 방법을 구현하느 전자기기의 블록도이다."}
