{"patent_id": "10-2024-7021823", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0155185", "출원번호": "10-2024-7021823", "발명의 명칭": "치과 치료 계획을 위한 방법 및 시스템", "출원인": "큐 앤 엠 덴탈 그룹", "발명자": "잉, 친 시오"}}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "환자의 치과 치료 계획을 생성하기 위한 컴퓨터 구현 방법으로서, 상기 방법은 다음:상기 환자의 치과 이미지를 포함한 환자 데이터를 수신하는 단계;상기 환자의 치아 감지, 넘버링 및 치과 문제에 대한 AI 예측(predictions)을 생성하기 위한 AI 모델을 사용하여 상기 환자의 상기 치과 이미지를 분석하는 단계;상기 AI 예측 및 하나 이상의 사용자로부터 받은 입력에 기반하여 치과 차트를 작성하는 단계;상기 작성된 치과 차트, 환자 데이터 및 상기 하나 이상의 사용자로부터 받은 입력을 기반으로, 임상 의사 결정지원 시스템(clinical decision support system, CDSS)을 사용하여 완성된 치과 설문지(questionnaire)를 생성하는 단계;상기 완성된 치과 설문지를 기반으로 최종 치료 계획을 생성하는 단계; 및상기 최종 치료 계획을 상기 하나 이상의 사용자에게 표시하는 단계를 포함하는, 방법."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 AI 예측은, 다음 구성 요소,너비와 높이를 가지는 x-min, y-min 좌표의 바운딩 박스;상기 바운딩 박스 내에 객체가 존재할 확률; 및상기 바운딩 박스 내에서 감지된 상기 객체의 클래스 확률에 기반하는, 방법."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 AI 모델은 크기가 동적인 객체를 감지하기 위한 제1 딥러닝 CNN과 크기가 정적인 객체를 식별하기 위한 제2 딥러닝 CNN을 포함하는, 방법."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제1 딥러닝 CNN은 크기가 동적인 객체를 감지하기 위한 CenterNet 모델을 포함하고, 상기 제2 딥러닝 CNN은 크기가 정적인 객체를 식별하기 위한 EfficientDet 모델을 포함하는, 방법."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 CDSS는 규칙 기반 또는 지식 기반 CDSS인, 방법."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 규칙 기반 CDSS는 방향성 그래프 형태의 프레임워크를 포함하는, 방법."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0155185-3-제 18 항에 있어서,상기 지식 기반 CDSS는 진단 추론을 하기 위한 지식 설명 언어(knowledge description language)를 생성하는데 중점을 두고, 소프트웨어에 코드화된 그래프 규칙 형태의 프레임워크를 포함하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항 내지 제 7 항에 따른 방법을 수행하도록 구성된 프로세서를 포함하는 컴퓨터 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "프로그램이 컴퓨터에 의해 실행될 때, 상기 컴퓨터가 제 1 항 내지 제 7 항에 따른 방법을 수행하도록 하는 명령어를 포함하는, 컴퓨터 프로그램."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "프로그램이 컴퓨터에 의해 실행될 때, 상기 컴퓨터가 제 1 항 내지 제 7 항에 따른 방법을 수행하도록 하는 명령어(instructions)를 포함하는, 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "환자의 치과 치료 계획을 생성하기 위한 시스템으로서, 상기 시스템은 다음:치과 이미지를 포함하는 환자 데이터를 수신하기 위한 입력 유닛;AI 모델을 정의하는 명령어(instructions)를 저장하도록 구성된 컴퓨터 판독 가능 저장 매체;CDSS를 실행하기 위한 제1 서버;상기 AI 모델을 정의하는 상기 명령어를 실행하기 위한 제2 서버, 상기 제2 서버는 다음:상기 AI 모델을 사용하여 상기 환자의 상기 치과 이미지를 기반으로 치아 감지, 넘버링 및 치과 문제에 대한 AI예측을 생성하는 것; 및상기 AI 예측 및 하나 이상의 사용자로부터 받은 입력에 기반하여 치과 차트를 작성하는 것을 포함하는 작업을수행하도록 구성되고,상기 제1 서버는 다음: 상기 CDSS를 사용하여 상기 치과 차트 및 하나 이상의 사용자로부터 받은 입력에 기반하여 완성된 치과 설문지를 생성하는 것; 및상기 CDSS를 사용하여 상기 완성된 치과 설문지를 기반으로 최종 치료 계획을 생성하는 것을 포함하는 작업을수행하도록 구성되며,상기 치과 차트, 설문지 및 최종 치료 계획을 상기 사용자에게 전달하도록 구성된 출력 유닛을 포함하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 AI 모델은 입력 치과 이미지에서 객체를 탐지하기 위해 이미지 인식(image recognition)과 로컬라이제이션을 결합하여, 치아 문제와 관련된 치아의 넘버링 및 분류를 위해 치아 위치를 감지하고 식별하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 치아의 위치와 치아 넘버링은 치아 주위에 바운딩 박스를 형성하여 결정되는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,공개특허 10-2024-0155185-4-상기 AI 예측은 다음 구성 요소,너비와 높이를 가지는 x-min, y-min 좌표의 바운딩 박스;상기 바운딩 박스 내에 객체가 존재할 확률; 및상기 바운딩 박스 내에서 감지된 상기 객체의 클래스 확률에 기반하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 바운딩 박스는 상기 치과 이미지에서 캡처된 각 치아에 대한 경계이고, 각 감지된 치아에 번호를할당하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11 항에 있어서,상기 AI 모델은 크기가 동적인 객체를 감지하기 위한 제1 딥러닝 CNN과 크기가 정적인 객체를 식별하기 위한 제2 딥러닝 CNN을 포함하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 제1 딥러닝 CNN은 크기가 동적인 객체를 감지하기 위한 CenterNet 모델을 포함하고, 상기 제2 딥러닝 CNN은 크기가 정적인 객체를 식별하기 위한 EfficientDet 모델을 포함하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 11 항에 있어서,상기 CDSS는 규칙 기반 또는 지식 기반 CDSS인, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 규칙 기반 CDSS는 방향성 그래프 형태의 프레임워크를 포함하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,상기 지식 기반 CDSS는 진단 추론을 하기 위한 지식 설명 언어(knowledge description language)를 생성하는데 중점을 두고, 소프트웨어에 코드화된 그래프 규칙 형태의 프레임워크를 포함하는, 시스템."}
{"patent_id": "10-2024-7021823", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 일반적으로 개인의 구강 상태를 분석하는 데 사용될 수 있는 방법 및 시스템에 관한 것이다. 이 방법 및 시스템은 구강 상태나 질병을 식별하여 개인에게 개인화된 전체적 치료 관리 계획을 제공하는데 사용될 수 있 다. 보다 구체적으로, 본 발명은 식별된 구강 상태 또는 질병에 대한 치료 계획을 생성하기 위해 인공지능 기능 을 사용하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2024-7021823", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일반적으로 개인의 구강 상태(mouth condition)를 분석할 수 있는 방법 및 시스템에 관한 것이다. 이 러한 방법 및 시스템은 구강 상태(oral condition) 또는 질병을 식별하여, 개인에게 개인화된 전체적 치료 관리 계획을 제공할 수 있다. 보다 구체적으로, 본 발명의 분야는 식별된 구강 상태 또는 질병에 대한 치료 계획을 생성하기 위해 인공지능 기능을 사용하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2024-7021823", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "치과 방사선 사진과 디지털 이미지는 치과의사들이 병변을 발견하거나 개인의 치아 상태의 치료 경과를 모니터 링하는 데 널리 사용되어 왔다. 즉각적인 가용성, 낮은 방사선량, 이미지 향상 가능성, 이미지 재구성 등과 같 은 디지털 치과 엑스레이(X-ray) 및 이미지의 장점으로 인해, 지난 십 년간 임상 진단에서 디지털 치과 이미지 의 사용이 크게 증가했다.그러나 디지털 치과 이미지가 빠르게 대중화되고 있음에도 불구하고, 경험 많은 치과의사들조차도 방사선 사진 의 오진 가능성이 매우 높다. 또한, 치과의사 간의 내부 및 외부 검사자 합의도 매우 낮다. 충치, 치주 질환 및 치아 결손은 개인의 삶의 질에 영향을 미치는 가장 흔한 구강 상태 및질병이므로 중요한 건 강 문제를 야기할 수 있다. 구강 상태 또는 질병의 효과적인 관리는 위험 요인, 치료 계획, 치료 결과, 발병률 및 진행률 등 많은 지식을 요구하는 결정 논리에 크게 의존한다. 이 모든 것은 개인의 구강 상태를 검사하는 의 료진의 전문적 판단에 달려 있다. 그러나 의료진이 항상 올바른 결정을 내릴 수 있는 능력은 추론 및 기억 능력 과 같은 인지 기능에 의해 제한된다. 이러한 요인들은 서로 다른 의료진이 내린 결정 사이에 차이를 초래하며, 이는 종종 과다 치료 또는 과소 치료로 이어지는 심각한 문제이다. 충치, 치주 질환 및 치아 결손과 같은 구강 상태 및 질병을 관리하기 위한 임상 의사 결정지원 시스템(clinical decision support system, CDSS)을 개발하여 치과의사들의 결정 사이에서 발생할 수 있는 추론의 불확실성과 의 견의 분산을 제한할 필요가 있다. WO201994504 A1은 치과 방사선 사진에서 특징, 즉 치과 병리를 분석하고 감지하기 위한 머신 러닝 시스템 및 방 법을 공개한다. 특히, 실제 얼굴의 입 부위에 초점을 맞춘 이미지를 바탕으로 객체 감지가 수행되며, 입 부위 주위에 경계 상자를 그린 후 UNet 분할 모델을 사용하여 각 픽셀이 치아인지 아닌지를 결정한다. 이 개시는 치 아 번호(number)와 해당 위치를 동시에 감지하기 위해 엑스레이 이미지를 사용하는 데 기반한 것이 아니다. CN109528323A는 인공지능을 기반으로 한 치아 교정 방법 및 장치를 개시한다. 특히, 생성적 적대 신경망 (Generative Adversarial Network, GAN) 모델을 사용하여 개인의 치아 세트의 3D 재구성(3D-reconstruction)을 생성한다. CT 스캔은 시간적 구성 요소가 없는 엑스레이와는 달리 구강의 시간적 슬라이스를 생성하는 데 사용 된다. CN105260598A는 치과 진단 및 치료 의사결정 지원 시스템 및 질병 진단에서 가장 유사한 권장 사례를 얻고 자동 으로 의사결정 데이터를 제공하는 의사결정 방법을 개시한다. 특히, 빠른 스크리닝 속도를 위해 진단에서 가장 유사한 사례를 얻기 위한 3단계 스크리닝 방법이 채택된다. 의사 결정 지원 시스템은 사례 연구를 활용하여 이 를 수치적 표현으로 변환하고 유클리드 거리를 기반으로 사례와의 일치 여부를 결정하는데, 이는 규칙 기반으로, 보다 결정론적인 성격을 가진 의료 지침에 기반한 것과 대조된다. 이러한 점에서, 인공지능 능력을 활용하여 치과 차트 작성, 구강 상태 분석 및 필요한 경우 전체적인 치료 계획 을 생성하는 자동화된 시스템 및 방법을 제공할 필요가 있다. 본 발명의 주요 목적은 환자의 치과 치료 계획을 생성하기 위한 컴퓨터 구현 방법을 제공하는 것으로, 이는 다 음 단계를 포함할 수 있다: 상기 환자의 치아 감지, 넘버링 및 치과 문제에 대한 AI 예측(predictions)을 생성 하기 위한 AI 모델을 사용하여 상기 환자의 상기 치과 이미지를 분석하는 단계; 상기 AI 예측 및 하나 이상의 사용자로부터 받은 입력에 기반하여 치과 차트를 작성하는 단계; 상기 작성된 치과 차트, 환자 데이터 및 상기 하나 이상의 사용자로부터 받은 입력을 기반으로, 임상 의사 결정 지원 시스템(clinical decision support system, CDSS)을 사용하여 완성된 치과 설문지(questionnaire)를 생성하는 단계; 상기 완성된 치과 설문지를 기 반으로 최종 치료 계획을 생성하는 단계; 및 상기 최종 치료 계획을 상기 하나 이상의 사용자에게 표시하는 단 계. 또 다른 목적은 본 발명에서 개시된 방법을 수행하도록 구성된 프로세서를 포함하는 컴퓨터 시스템을 제공하는 것이다. 추가적인 목적은 컴퓨터가 실행될 때 컴퓨터가 본 발명에서 개시된 방법을 수행하도록 하는 프로그램이 포함된 컴퓨터 판독 가능 저장 매체를 제공하는 것이다. 또 다른 목적은 환자의 치과 치료 계획을 생성할 수 있는 시스템을 제공하는 것으로, 이는 다음을 포함할 수 있 다: 치과 이미지를 수신하기 위한 입력 유닛; AI 모델을 정의하는 명령어(instructions)를 저장하도록 구성된 컴퓨터 판독 가능 저장 매체; CDSS를 실행하기 위한 제1 서버; 상기 AI 모델을 정의하는 상기 명령어를 실행하 기 위한 제2 서버; 여기서, 제2 서버는 다음을 포함하는 작업을 수행하도록 구성된다: 상기 AI 모델을 사용하여 상기 환자의 상기 치과 이미지를 기반으로 치아 감지, 넘버링 및 치과 문제에 대한 AI 예측을 생성하는 것, 상 기 AI 예측 및 하나 이상의 사용자로부터 받은 입력에 기반하여 치과 차트를 작성하는 것. 여기서 상기 제1 서 버는 다음을 포함하는 작업을 수행하도록 구성된다: 상기 CDSS를 사용하여 상기 치과 차트 및 하나 이상의 사용자로부터 받은 입력에 기반하여 완성된 치과 설문지를 생성하는 것, 상기 CDSS를 사용하여 상기 완성된 치과 설 문지를 기반으로 최종 치료 계획을 생성하는 것: 그리고 상기 치과 차트, 설문지 및 최종 치료 계획을 상기 사 용자에게 전달하도록 구성된 출력 유닛. 추가적인 발명의 목적들은 본 설명이 진행됨에 따라 나타날 것이다. 상기 목적 및 관련 목적을 달성하기 위해, 본 발명은 첨부된 도면에 도시된 형태로 구현될수 있으며, 그러나 도 면은 예시적인 것일 뿐이며 첨부된 청구항의 범위 내에서 도시되고 설명된 구체적인 구성은 변경될 수 있다는 사실에 유의해야 한다. 정의 본 명세서에서 사용된 용어들은 일반적으로 본 개시의 문맥 내에서 당업자에게 통상의 의미를 가지며, 각 용어 가 사용되는 특정 맥락에서 통상의 의미를 갖는다. 본 개시를 설명하는데 사용되는 특정 용어들은 아래 또는 본 명세서의 다른 곳에서 논의되어, 본 개시의 설명과 관련하여 실무자에게 추가적인 안내(guidandce)를 제공한다. 동일한 내용을 다양한 방식으로 표현할 수 있다는 점을 알 수 있다. 따라서 여기에서 논의된 하나 이상의 용어에 대해 대체 언어와 동의어를 사용할 수 있다. 또한 용어가 본 발명 에서 자세히 설명되었거나 논의되었는지 여부에 특별한 의미를 두지 않는다. 특정 용어에 대한 동의어가 제공된 다. 하나 이상의 동의어를 언급한다고 해서 다른 동의어의 사용이 배재되는 것은 아니다. 본 발명에서 논의된 모든 용어의 예를 포함하여 본 발명 어디에서나 예를 사용하는 것은 단지 설명을 위한 것이며, 개시 또는 예시 된 용어의 범위와 의미를 추가로 제한하려는 의도가 아니다. 마찬가지로, 본 개시는 본 명세서에 제시된 다양한 실시예에 한정되지 않는다. 본 발명에서 사용되는 다음 단어와 용어의 의미는 다음과 같다: \"구강 상태(mouth condition)\" 또는 \"구강 질병(mouth diseases)\"이라는 용어는 충치(caries), 치주 문제 (periodontal problem), 치아 상실(missing tooth), 크라운(crown), 브릿지(bridge), 임플란트(implant), 충전 (filling), 온레이(onlay), 인레이(inlay), 베니어(vaneer), 실패 또는 결함이 있는 복원(failed or defective restoration)(충전, 크라운, 브릿지, 베니어, 인레이, 온레이), 근관 치료(root canal treatment), 포스트 및 코어(post and core), 매복된 치아(impacted tooth), 부분적으로 돌출된 치아(partially erupted tooth), 돌출 되지 않은 치아(unerupted tooth), 유치(primary tooth), 골절(fracture), 치근단 주위 병변(periapical lesion), 남아 있는 뿌리(retained root), 구강 및 안면 병리학(oral and maxillofacial pathology), 구강 해 부학적 표지(oral anatomical landmark), 적용 가능한 치열 교정 기준에 따라 바람직하지 않은 환자 치아 배열 및/또는 이들의 조합을 포함할 수 있으나 이에 국한되지 않는다. 치아 배열은 의학적, 교정학적, 심미적 이유, 및 과개교합, 교차교합, 개방교합, 오버교합, 언더교합 등과 같은 기타 이유로 바람직하지 않을 수 있다. \"응용 프로그래밍 인터페이스\" 또는 \"API\"라는 용어는 소프트웨어 구축을 위한 일련의 서브루틴 정의, 프로토콜 및 도구를 의미한다. 일반적으로 이는 다양한 구성 요소 간의 통신을 위한 명확하게 정의된 방법의 세트이다. \"클라우드\" 또는 \"클라우드 컴퓨팅\"이라는 용어는 구성 가능한 시스템 리소스와 최소한의관리 노력으로 신속하 게 제공될 수 있는 상위 수준의 서비스 공유 풀에 대한 유비쿼터스 액세스를 가능하게 하는 정보 기술 (information technology, IT) 패러다임을 나타내며, 이는 종종 인터넷을 통해 이루어진다. \"합성곱 신경망(convolutional neural network, CNN)”이라는 용어는 기술 분야에서 일반적으로 사용되는 용어 이며, 일반적으로 컴퓨터 비전 작업을 위한 강력한 도구를 의미하며, 딥러닝 CNN을 이용하여 이미지와 같은 원 시 데이터로부터 자동적으로 미드 레벨 및 하이 레벨의 추상화를 학습할 수 있다. 컨볼루션 레이어는 하나 이상 의 컨볼루션 커널을 포함할 수 있으며, 각 커널은 입력 텐서를 가지며 이 입력 텐서는 동일할 수 있지만 서로 다른 필터에 해당하는 서로 다른 계수를 가질 수 있다. 레이어의 각 컨볼루션 커널은 각 커널마다 출력 뉴런이 달라지도록 다른 출력 맵을 생성한다. 컨볼루션 네트워크에는 하나 이상의 출력 맵의 뉴런 그룹 출력을 결합하 는 로컬 또는 글로벌 \"풀링\" 레이어가 포함될 수도 있다. 출력의 조합은 예를 들어, “풀링” 레이어의 출력 맵 에서 해당 출력에 대해 뉴런 그룹의 출력의 최대 또는 평균값을 취하는 것을 구성될 수 있다. \"풀링\" 레이어는 네트워크의 한 레이어에서 다른 레이어로 출력 맵의 크기를 줄이는 동시에 입력 데이터에서의 작은 변형이나 변 환에 대한 내성을 향상시킴으로써 성능 수준을 개선할 수 있다. 기본적인 CNN의 작동 방식에 대한 예시적인 의 사코드(pseudocode) 알고리즘을 아래에 보여준다. “머신 러닝(machine learning, ML)”이라는 용어는 시스템이 명시적으로 프로그래밍되지 않고도 경험을 통해 학습하고 개선할 수 있는 능력을 제공하는 인공지능(artificial intelligence, AI)의 응용 프로그램을 말한다. 머신 러닝은 데이터에 액세스하고 이를 활용하여 스스로 학습할 수 있는 컴퓨터 프로그램의 개발에 중점을 둔다. \"딥러닝(deep learning, DL)”이라는 용어는 인공 신경망이라고 불리는 뇌의 구조와 기능에서 영감을 받은 알고 리즘고 관련된 머신 러닝의 하위 분야이다. 딥러닝 모델의 장점으로 자주 언급되는 것은 특징 학습이라고도 하 는 원시 데이터에서 자동 특징 추출을 수행할 수 있다는 점이다. \"모듈\"이라는 용어는 전자 부품과 관련 배선의 조립체 또는 컴퓨터 소프트웨어의 세그먼트와 같이 자체적으로 정의된 작업을 수행하고 다른 모듈과 연결하여 더 큰 시스템을 형성할 수 있는 독립된 유닛을 의미한다. “서버”라는 용어는 프로세스 데이터, 신호 또는 기타 정보를 처리하는 적합한 하드웨어 및/또는 소프트웨어 시스템, 메커니즘 또는 구성 요소를 포함한다. 서버에는 범용 중앙 처리 장치(central processing unit, CPU), 다중 처리 장치, 특정 기능을 구현하는 전용 회로 또는 기타 시스템을 포함할 수 있다. 프로세서는 지리적 위치 에 제한되지 않으며 시간 제한도 없다. 예를 들어, 서버는 \"실시간\", \"오프라인\", \"배치 모드\" 등으로 기능을 수행할 수 있다. 일부 프로세싱은 다른 시간과 장소에서 다른(또는 동일한) 프로세싱 시스템에 의해 수행될 수 있다. 서버 시스템의 예로는 클라이언트, 최종 사용자 장치, 라우터, 스위치, 네트워크 스토리지 등이 있다. 컴 퓨터는 메모리와 통신할 수 있는 모든 서버일 수 있다. 메모리는 랜덤 액세스 메모리(random-access memory, RAM), 읽기 전용 메모리(read-only memory, ROM), 하드 디스크 드라이브(hard-disk drive, HDD) 또는 솔리드 스테이트 디스크(solid-state disk, SSD) 또는 서버에서 실행할 명령을 저장하는데 적합한 기타 유형의 매체와 같은 모든 적합한 프로세서 판독 가능 저장 매체일 수 있다. 달리 명시되지 않는 한, \"포함하는(comprising)\" 및 \"포함하다(comprise)\"와 같은 용어와 그 문법적 변형은 언 급된 요소를 포함하되 추가적으로 언급되지 않은 요소도 포함하는 것을 허용하는 “개방적(open)” 또는 \"포괄 적(inclusive)\" 언어를 나타낸다. 본 개시의 전반에 걸쳐, 특정 실시 예가 범위 형식으로 개시될 수 있다. 범위 형식의 설명은 단순히 편의 및 간 결성을 위한 것이며, 개시된 범위에 대한 융통성 없는 제한으로 해석되어서는 안 된다는 것을 이해해야 한다. 따라서 범위로 설명된 것은 해당 범위 내의 개별 수치뿐만 아니라 모든 가능한 하위 범위를 구체적으로 개시한 것으로 간주되어야 한다. 예를 들어, 1 내지 6까지의 범위를 설명하는 것은 1 내지 3, 1 내지 4, 1 내지 5, 2 내지 4, 2 내지 6, 3 내지 6 등의 하위 범위와 해당 범위 내의 개별 숫자(예: 1, 2, 3, 4, 5, 6)를 구체적으로 공개한 것으로 간주되어야 한다. 이는 범위의 너비에 관계없이 적용된다. 본 명세서에 예시적으로 설명된 발명은 본 명세서에 구체적으로 개시되지 않은 요소 또는 요소들, 제한 또는 제 한이 없는 경우에도 적절하게 실행될 수 있다. 따라서 예를 들어, \"포함하는(comprising)\", \"포함하는 (including)\", \"함유하는(containing)\" 등의 용어는 제한 없이 광범위하게 읽어야 한다. 또한, 본 명세서에 사 용된 용어 및 표현은 제한이 아닌 설명의 용어로 사용되었으며, 이러한 용어 및 표현을 사용하는 데 있어서 표 시되고 설명된 특징의 균등물 또는 그 일부를 배제하려는 의도는 없으나, 청구된 발명의 범위 내에서 다양한 수 정이 가능하다는 것이 인정된다. 따라서 본 발명은 바람직한 실시예 및 선택적 특징에 의해 구체적으로 개시되었지만, 당업자에 의해 본 발명이 개시된 실시예의 수정 및 변형이 이루어질 수 있으며, 그러한 수정 및 변형은 본 발명의 범위 내에 있는 것으로 간주된다는 것을 이해해야 한다."}
{"patent_id": "10-2024-7021823", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 설명에서는, 본 발명의 일부를 구성하는 첨부 도면을 참조하며, 본 발명을 실시할수 있는 구체적인 실시 예를 예시적으로 보여준다. 다른 실시예가 활용될 수 있으며, 본 발명의 범위를 벗어나지 않고 구조적 변경이 이루어질 수 있음을 이해해야 한다. 본 발명에 개시된 것은 환자의 구강 상태를 분석하여 해당 환자의 진단 및 치료 계획 제공을 지원하기 위한 컴 퓨터 구현 방법 및 시스템이다. 본 발명에 개시된 방법 및 시스템은 시각적으로 간단한 방식으로 환자에게 구강 상태에 대한 지식을 제공하여 “발견되지 않은” 치아 문제의 위험을 줄여 환자가 가능한한 한 조기에 치료를 받을 수 있도록 한다. 이에 치아 문제와 구강 상태 또는 질병을 조기에 발견하고 치료하여 늦은 발견으로 인해 향후 비용이 많이 드는 치료를 예방할 수 있다. 따라서 생성된 진단 및 치료 계획은 치과 전문가(예: 치과의 사)의 분석에만 전적으로 의존하지 않으며, 이는 전문가의 훈련, 역량 및 교육 배경의 강도에 따라 크게 달라질 수 있다. 본 발명에 개시된 방법 및 시스템은 개발 및 훈련된 인공지능(AI) 기능을 사용하여 환자의 구강 상태에 대한 통 찰을 제공함으로써 진단 및 치과 차트 작성에서 환자의 치료 계획 수립까지 종단 간 솔루션을 제공하는 것을 목 표로 한다. 사용된 인공지능 기능은 환자의 치과 이미지를 분석하여 통찰을 제공하고, 치과 전문가의 수작업으 로 놓칠 수 있는 임상적으로 관련성 있는 정보를 추론할 수 있다. 환자를 위한 윤리적 치료 계획 옵션을 생성하기 위해 인공지능(AI)을 CDSS와 함께 사용할 수 있다. 이와 관련하 여 환자의 구강 상태를 AI 모델로 분석하여 구강 상태나 질병을 식별하고, 그 결과를 CDSS에 입력하여 진단 및 개인화된 치료 계획 옵션 생성을 지원할 수 있다. 환자 데이터(즉, 치과 이미지)의 분석에서 소프트웨어만의 시스템 성능은 종종 정확한 결과와 오류의 방지에 필 요한 수준에 미치지 못한다. 따라서 본 발명에 개시된 방법과 시스템은 인공지능 기능을 활용하는 것 외에도, 치과 전문가의 지식과 의견을 활용할 수 있다. 특히, 의사 결정 프로세스와 전체적인 치료 계획 생성을 용이하게 하기 위해, 본 발명에 개시된 방법과 시스템은 소프트웨어 구성 요소만으로는 수행할 수 없거나 제대로 수행 되지 않는 특정 업데이트, 결정 및 선택을 수행하는 데 치과 전문가(즉, 사용자)의 의견을 활용할 수 있다. 이 와 관련하여, 본 발명에 개시된 방법 및 시스템은 환자의 구강 상태를 분석하는 데 있어서 컴퓨터와 인간의 데 이터 처리의 각각의 강점을 결합하는 동시에 필요한 인간의 관여를 최소화하는 공생적 인간-기계 접근 방식을 나타낸다. 결과적으로 인공지능과 인간 지능을 결합하여 환자에 대한 진단 및 치료 계획을 생성할 수 있다. 주지하는 바와 같이, 본 발명에 개시된 시스템 및 방법은 하드웨어와 소프트웨어의 조합을 사용하여 컴퓨터에서 구현될 수 있다. 다양한 측면이 프로그래밍 가능한 컴퓨터에서 구현될 수 있으며, 각 컴퓨터는 하나 이상의 입 력 장치, 데이터 저장 매체, 하드웨어 프로세서 및 출력 장치 또는 통신 인터페이스를 포함한다. 서버, 서비스, 유닛, 모듈, 인터페이스, 포털, 플랫폼 또는 컴퓨팅 장치로 구성된 기타 시스템과 같은 용어의 사용은 컴퓨터 판독 가능 저장 매체에 저장된 소프트웨어 명령을 실행하도록 구성된 적어도 하나 이상의 프로세서를 갖는 하나 이상의 컴퓨팅 장치를 나타내는 것으로 간주되어야 한다. 예를 들어, 서버는 설명된 역할, 책임 또는 기능을 충 족하는 방식으로 웹 서버, 데이터베이스 서버 또는 기타 유형의 컴퓨터 서버로 작동하는 하나 이상의 컴퓨터를 포함할 수 있다. 일 실시예에서, 본 발명에 설명된 시스템 및 방법은 적어도 하나의 치과 이미지를 입력하기 위한 하나 이상의 입력 유닛, AI 모델 및 CDSS를 정의하는 명령을 저장하도록 구성된 하나 이상의 컴퓨터 판독 가능 저장 매체, AI 모델 및 CDSS를 정의하는 명령을 실행하기 위한 하나 이상의 서버, 하나 이상의 데이터베이스, 하나 이상의 클라우드 스토리지 시스템 및 하나 이상의 출력 유닛을 포함할 수 있다. 도 1은 본 발명에 개시된 방법 및 시스템에서 사용될 수 있는 컴퓨팅 하드웨어의 대표적인 실시예를 도시한다. 일 실시예에서, 본 발명에 개시된 방법 및 시스템은 일반적으로 사용자로부터 치과 이미지를 수신하여 제1 서버 로 입력하기 위한 입력 유닛을 포함할 수 있다. 제2 서버는 제1 서버와 통신하여 하나 이상의 컴퓨터 판독 가능 저장 매체에 소프트웨어 명령어로 저장된 AI 모델에 액세스하고 실행할 수 있다. AI 모델은 제1 서버 및 제2 서 버를 통해 데이터베이스와 클라우드 스토리지 시스템 모두와 통신할 수 있다. 제1 서버는 또한 CDSS를 포함하고 실행할 수 있다. 출력 유닛은 제1 서버를 통해 사용자와 통신하도록 포함되고 구성될 수 있다. 일 실시예에서, 사용자는 하나 이상의 개인, 하나 이상의 환자, 하나 이상의 치과 임상의 또는 임상 전문가, 하 나 이상의 의사 및 기타 이해 관계자/관련 개인을 포함할 수 있다. 일 실시예에서, 시스템의 입력 유닛은 하나 이상의 데이터베이스, 클라우드 스토리지 시스템 또는 이미지 캡처 장치로부터 입력을 수신할 수 있는 임의의 컴퓨팅 장치 또는 입력 모듈을 포함할 수 있다. 일 실시예에서, 치과 이미지는 사용자가 입력 유닛을 통해 입력되거나 이미지 캡처 장치와 컴퓨터 시스템과의 통합을 통해 입력될 수 있다. 예를 들어, 컴퓨터 시스템은 엑스레이 기계와 통합되어 방사선 이미지를 컴퓨터 시스템으로 읽을 수 있다. 그런 다음 입력된 치과 이미지는 출력 유닛(즉, 사용자 인터페이스)을 통하여 검토를 위해 표시될 수 있 다. 일 실시예에서, 제1 서버는 통합 치과 관리 시스템(Integrated Dental Management System, IDMS) 서버와 같은 웹 기반 데이터베이스 서버일 수 있다. 일 실시예에서, 제2 서버는 AI 서버일 수 있다. AI 서버는 입력된 치과 이미지를 추론하고치과 차트를 채우기 위한 AI 예측을 제공하기 위해 본 발명에 개시된 AI 모델을 실행할 수 있는 CPU 성능을 갖는 통상적으로 사용되 는 임의의 가상 머신일 수 있다. 도 2는 컴퓨터 시스템의 소프트웨어 및 하드웨어 구성 요소들 간의 운영 관계 를 위한 다양한 통신 링크와 함께 AI 모델을 배치하기 위한 제2 서버의 구조를 나타내는 대표적인 실시예를 도 시한 도면이다. 특히, 제2 서버는 제1 서버, 제1 서버를 통한 데이터베이스 및 AI 모델을 사용하여 치과 이미지 를 분석하기 위하여 클라우드 스토리지 시스템에 액세스하거나 통신할 수 있다. 일 실시예에서, 제2 서버는 전 처리 모듈, 후처리 모듈, AI 예측을 제공하기 위해 AI 모델을 배포하거나 실행하기 위한 애플리케이션 프로그래 밍 인터페이스(application programming interface, API) 엔드포인트 모듈을 포함할 수 있다. 전처리 모듈은 치과 이미지를 AI 모델에서 사용할 수 있는 적절한 형식으로 변환할 수 있다. 후처리 모듈은 AI 모델에서의 원 시 출력을 제1 서버에서 사용할 수 있는 적절한 형식으로 변환할 수 있으며, 모든 AI 예측이 치아와 관련하여 어디에 속하는지 결정할 수 있다. 일 실시예에서, 데이터베이스는 로컬 메모리 저장소로 기능할 수 있으며, 이는 지속성을 가진 메모리 캐시일 수 있다. 데이터베이스는 또한 디스크 스토리지 기반의 관계형, noSQL 및/또는 기타의 데이터베이스일 수 있다. 데 이터베이스에 입력 및 출력되는 데이터는 하나 이상의 내부 API를 통해 라우팅될 수 있다. 데이터베이스에 저장된 데이터는 AI 모델에 의해 출력된 AI 예측, 학습된 AI 모델의 모델 레지스트리, 배포된 AI 모델의 모델 배포 로그, 개별 치과 이미지에 대한 AI 예측의 감사 로그 등을 포함할 수 있지만 이에 국한되지 않는다. 이하에서 자세히 설명하는 바와 같이 AI 예측은 바운딩 박스 데이터 형태일 수 있다. 일 실시예에서, 클라우드 스토리지 시스템은 WiFi, Bluetooth, Sigfox, Lora, IoT, 셀룰러 및/또는 기타 등의 통신 스펙트럼을 기반으로 할 수 있는 링크를 통해 제1 서버 및 제2 서버로부터 데이터를 저장할 수 있다. 하나 이상의 API는 클라우드 스토리지 시스템과 제1 및/또는 제2 서버 간의 데이터 전송을 허용할 수 있다. 하나 이 상의 API는 데이터 및 요청을 라우팅하기 위해 클라우드 스토리지 시스템과 통신할 수 있다. 일 실시예에서, 클 라우드 스토리지 시스템에 저장된 데이터는 원시 치과 이미지, TensorFlow(TF) 레코드 파일, AI 모델 가중치, 추적을 위한 AI 모델 로그 파일 및 환자 데이터를 포함할 수 있으나 이에 국한되지 않는다. 이와 관련하여, TF 레코드 파일은 바운딩 박스 데이터가 표시되고 TensorFlow 프레임워크에서 사용할 수 있도록 최적화된 AI 모델 을 통해 처리된 치과 이미지를 의미한다. 환자 데이터에는 환자의 병력, 치과 병력, 사회 이력, 생물학적 데이 터(예: 나이, 성별)에 대한 데이터가 포함될 수 있다. AI 모델 가중치는 AI 모델을 훈련한 후 AI 모델의 수학적 함수에서 파생된 수학적 값을 참조할 수 있다. 일 실시예에서, 출력 유닛은 최종 치료 계획 결과와 더불어 본 발명에 개시된 방법의 하나 이상의 단계의 출력 을 사용자 단말에 통신하거나 표시할 수 있다. 이와 관련하여, 출력은 제1 서버, 보다 구체적으로는 IDMS 서버 를 통해 표시될 수 있으며, 여기서 하나 이상의 API는 요구에 따라 제1 서버와 통신하여 출력 유닛을 통해 출력 을 표시할 수 있다. 일 실시예에서, 출력 유닛은 최종 치료 계획 결과와 더불어 본 발명에 개시된 방법의 하나 이상의 단계의 출력을 나타내는 대시보드를 사용자에게 통신하거나 표시할 수 있다. 일 실시예에서, 출력 유닛은 그래픽 사용자 인터페이스(graphical user interface, GUI)를 포함할 수 있다. 일 실시예에서, GUI는 환자 데이터, 치과 차트, 치과 설문지, 치료 계획 옵션 및 최종 치료 계획을 로드하고 표시 할 수 있는 기능을 가질 수 있다. 일 실시예에서, 출력 유닛은 사용자가 환자 데이터, 치과 차트, 치과 설문지 및 치료 계획 옵션과 관련된 시스템의 출력을 선택적으로 구성하거나 업데이트할 수 있도록 할 수 있다. 일 실 시예에서, GUI는 사용자가 시스템으로부터 출력을 선택적으로 구성하거나 업데이트할 수 있도록 하는 대시보드 디스플레이 시스템을 포함할 수 있다. 대시보드는 원하는 표시 항목 및 표시 항목의 모양을 선택하기 위한 터치 스크린 기술 또는 작동 가능한 버튼을 사용하여 표시할 항목을 선택하기 위해, 사용자가 액세스 할 수 있는 메 뉴 항목의 인터랙티브 데이터베이스를 포함할 수 있다. 본 발명에 개시된 컴퓨터 시스템의 구조 설계는 사용자로부터 파생된 데이터의 생성, 액세스 및 소비와, AI 모 델 및 CDSS를 통해 치과 이미지를 처리하고 AI 모델을 훈련하기 위한 API를 제공한다. 일 실시예에서, 본 발명 에 개시된 시스템에서 사용되는 API는 엔드포인트 API, 객체 감지 API, 추론 API, 훈련 API 및 CDSS API를 포함 할 수 있다. 이와 같이 하나 이상의 추가 API는 데이터베이스와 클라우드 스토리지 시스템을 연결하여 서버와 데이터를 주고받을 수 있다. 또한, 본 발명에 개시된 컴퓨터 시스템은 추가 구성 요소를 포함할 수 있다. 예를 들어, 시스템은 버스, 컨트롤 러 또는 네트워크와 같은 하나 이상의 통신 채널 또는 상호 연결 메커니즘을 포함할 수 있으며, 이는 시스템의 구성 요소를 상호 연결한다. 다양한 실시예에서, 운영 시스템 소프트웨어는 컴퓨터 시스템에서 실행되는 다양한 소프트웨어를 위한 운영 환경을 제공하고 컴퓨터 시스템의 구성 요소의 다양한 기능을 관리한다. 통신 채널은 통신 매체를 통해 다양한 다른 컴퓨팅 엔티티와의 통신을 허용한다. 통신 매체는 프로그램 명령어 또는 기타 데 이터와 같은 정보를 통신 매체로 제공한다. 통신 매체는 전기, 광학, 무선 주파수, 적외선, 음향, 마이크로파, Bluetooth® 또는 기타 전송 매체로 구현된 유선 또는 무선 방식을 포함할 수 있다. 일 실시예에서, 환자의 치과 치료 계획을 생성하기 위한 시스템이 제공되며, 이는 다음을포함할 수 있다: 치과 이미지를 수신하기 위한 하나 이상의 입력 유닛; AI 모델 및 CDSS를 정의하는 명령어를 저장하도록 구성된 하나 이상의 컴퓨터 판독 가능 저장 매체; 적어도 하나의 AI 모델 및 CDSS를 정의하는 명령어를 실행하기 위해 구성 된 하나 이상의 서버; 데이터베이스; 클라우드 스토리지 시스템; 및 사용자에게 결과를 전달하기 위해 구성된 출력 유닛, 여기서 하나 이상의 서버는 다음을 포함하는 작업을 수행하도록 구성될 수 있다: AI 모델을 사용하 여 치과 이미지를 기반으로 AI 예측을 생성하는 것; AI 예측 및 하나 이상의 사용자로부터의 입력에 기반하여 치과 차트를 작성하는 것; CDSS를 사용하여 치과 차트 및 하나 이상의 사용자로부터의 입력에 기반하여 완성된 치과 설문지를 생성하는 것; 그리고 CDSS를 사용하여 완성된 치과 설문지를 기반으로 최종 치료 계획을 생성하 는 것. 또 다른 실시예에서는 환자의 치과 치료 계획을 생성하기 위한 시스템이 제공되며, 이는 다음을 포함할 수 있다: 치과 이미지를 수신하기 위한 입력 유닛; AI 모델 및 CDSS를 정의하는 명령어를 저장하기 위해 구성된 컴 퓨터 판독 가능 저장 매체; AI 예측 및 사용자 입력에 따라 치과 차트를 작성하고 사용자 입력에 따라 완성된 치과 설문지와 최종 치료 계획을 생성하기 위해 CDSS를 정의하는 명령어를 실행하는 제1 서버; AI 예측을 생성 하기 위해 AI 모델을 정의하는 명령어를 실행하는 제2 서버; 데이터베이스; 클라우드 스토리지 시스템; 및 사용 자에게 결과를 전달하기 위해 구성된 출력 유닛. 도 3은 환자의 치료 계획 생성을 위해 본 발명에 개시된 컴퓨터 시스템에서 구현될 수 있는 방법에 관련된 대표 적인 워크플로우 및 단계를 도시한다. 101 단계에서 환자의 구강 상태 분석 및 치료 계획 생성은 환자의 치과 이미지를 제1 서버에 입력하여 초기 처 리하는 것으로 시작된다. 입력된 환자의 치과 이미지는 그래픽 사용자 인터페이스와 같은 출력 유닛을 통해 제1 서버에서 사용자에게 전달될 수 있다. 환자의 치과 이미지는 엑스레이 이미지와 같은 방사선 사진일 수 있다. 일 실시예에서, 엑스레이 이미지는 바이 트윙(bitewing) 이미지, 치근단 이미지 또는 파노라마 방사선 이미지/파노라마 이미지일 수 있다. 102 단계에서, 사용자의 요청에 따라 제1 서버는 제2 서버에 AI 모델을 실행하여 치과 이미지를 처리하고 AI 예 측을 생성하도록 지시할 수 있다. AI 예측은 AI 모델의 결합된 출력 또는 추론 결과를 기반으로 하여 치아 번호, 치과 문제 및 복원에 대한 예측을 제공할 수 있다. 예를 들어, AI 예측은 다음 구성 요소를 기반으로 할 수 있다: 1) 바운딩 박스의 x-min, y-min 좌표 및 너비와 높이(x-min 및 y-min은 바운딩 박스의 왼쪽 상단 모서 리 좌표임); 2) 바운딩 박스에 개재가 존재할 확률; 3) 바운딩 박스에서 감지된 객체의 클래스 확률. 103 단계 로 보내기 전에 이 프로세스의 예시적인 의사코드가 아래에 표시되어 있다."}
{"patent_id": "10-2024-7021823", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "103 단계에서, AI 예측은 제2 서버에서 제1 서버로 전송된다. 제1 서버는 수신된 AI 예측을 기반으로 치과 차트 를 작성한다. 104 단계에서는 작성된 치과 차트가 사용자 인터페이스를 통해 사용자에게 전달되어 치과 차트와 그 안에 제시된 정보를 확인할 수 있도록 한다. 치과 차트를 새로운 임상 정보, 환자 데이터, 검사 결과로 수정 하거나 업데이트해야 하거나 불일치 사항을 수정해야 하는 경우, 사용자는 치과 차트를 선택적으로 편집할 수 있다. 최종적으로 업데이트된 치과 차트는 사용자가 확인하고 검증하여 제1 서버에서 추가 처리될 수 있다. 사용자 인터페이스에는 사용자가 생성된 AI 예측을 확인하거나 거부하거나, 임의의 치아에 대한 정보를 추가할 수 있는 요소가 포함될 수 있다. 치과 차트를 표시하는 사용자 인터페이스는 치과 차트의 시각적 요소 및/또는 레이블(lable)로 표시된 치과 문 제 외에도 번호가 매겨진 치아를 표시할 수 있다. 시각적 요소의 위치와 크기는 감지된 치과 문제의 유형에 따 라 시각적으로 구분될 수 있다. 예를 들어, 비병리적 상태는 첫 번째 색상으로 이미지에 표시될 수 있고, 병리 적 상태는 다른 색상을 사용하여 표시될 수 있다. 사용자 인터페이스는 사용자가 환자의 구강에 대한 물리적 검 토 및 평가에 따라 시각적 요소를 추가하거나 제거할 수 있도록 하는 사용자 인터페이스 요소를 포함할 수 있다. 성인 치아 또는 유치의 전체 컴플리먼트의 일반적인 배열을 나타내는 복수 개의 치아를 포함하는 표준 기호 번 호 치과 차트가 표시될 수 있으며, 치아 위치, 번호 및 감지된 치과 문제에 매핑되거나 상관관계가 있을 수 있 다. 치과 차트는 치과 문제의 위치(예: 표면 또는 치아 레벨)를 표시하기 위해 색상으로 구분될 수 있다. 또한 표준 차트에 나타나는 치아 중 감지되지 않은 치아(예: 결손 치아)는 검은색으로 표시될 수 있다. 따라서, 치과 차트에 기호로 표시된 치아는 바운딩 박스 또는 기타 시각적 요소로 식별된 관심 영역과 상관관계가 있을 수 있 다. 치과 문제가 없는 것으로 검출된 치아(즉, “정상” 치아)는 치과 차트에서 제외하거나 정상으로 포함하여 표시될 수 있다. 일 실시예에서, 치과 차트는 각 치아에 대한 AI 예측을 나열한 표가 포함될 수 있다. 사용자가 작성된 치과 차트와 그 안의 정보를 검토하고 필요한 경우 수정한 후 최종 치과 차트를 생성할 수 있 다. 105 단계에서, 최종 검증된 치과 차트를 기반으로 제1 서버는 CDSS에 부분적으로 완성된 치과 설문지를 생성하 도록 지시하고 실행한다. 이 맥락에서 “부분적으로”는 하나 이상의 질문이 답변되지 않은 불완전한 설문지를 의미할 수 있다. 설문지는 클라우드 스토리지 시스템에 저장된 환자 데이터와 최종 치과 차트에서 일부 답변이 자동으로 추출되기 때문에 부분적으로 완성될 수 있다. 제1 서버는 답변된 질문과 답변되지 않은 질문이 모두 포함된 부분적으로 완성된 치과 설문지를 사용자에게 전 달할 수 있다. 106 단계에서, 사용자는 답변된 질문을 확인하고 답변되지 않은 질문을 완료하여 제1 서버가 추 가로 처리할 수 있도록 완성된 치과 설문지를 제공할 수 있다. 일 실시예에서, 질문은 치과 문제의 위치, 치과 문제의 증상, 환자 바이오 데이터 및 치료 옵션과 관련된 단일 및/또는 복수 선택형 질문의 형태일 수 있다. 일 실시예에서, 질문은 단일 및/또는 복수 선택형 질문 외에도 ' 예' 또는 '아니오' 형식의 질문일 수 있다. 일 실시예에서, 설문지는 환자 바이오 데이터, 치과 차트에 표시된 각 치과 문제 및 치료옵션에 대한 별도의 상 호 작용 섹션(탭)과 함께 사용자 인터페이스 또는 대시보드를 통해 사용자에게 제공될 수 있다. 일 실시예에서, 설문지는 일반 환자 바이오 데이터 섹션과 각 치과 문제에 대한 섹션을 포함할 수 있다. 이러한 섹션 각각은 사 용자가 답할 치과 문제에 따라 사전 설정된 일련의 질문을 포함할 수 있다. 일반 환자 바이오 데이터 섹션은 환 자의 병력, 치과 병력, 사회 병력, 일반 치과 위험 요인 및 환자가 제시하는 현재 증상(예: 열, 구취 잇몸 출혈, 전신 통증 등)에 대한 질문을 포함할 수 있다. 각 치과 문제에 대한 섹션은 해당 치과 문제에 적용되는 치아 번호, 표면 레벨 또는 치아 레벨에서의 치과 문제의 위치(예: 근심, 교합, 원심, 협측, 혀)를 나타내는 작 성된 치과 차트의 표시 및 치과 문제의 증상과 관련된 하나 이상의 질문을 포함할 수 있다. 일 실시예에서, 치과 문제의 증상과 관련된 질문은 일련의 질문으로 한 번에 하나씩 제시될 수 있으며, 여기서 질문 번호 2는 질문 1에 대한 답변이 선택된 후에만 나타난다. 따라서 CDSS는 규칙 기반 프레임워크로 질문들이 방향 그래프 형태로 생성될 수 있다. 107 단계에서, 제1 서버는 CDSS에 완성된 치과 설문지를 처리하고 하나 이상의 치료 계획 옵션과 함께 환자의 구강 상태에 대한 예비 진단 평가를 생성하도록 지시할 수 있다. 진단 평가 및 하나 이상의 치료 계획 옵션은 출력 유닛(즉, 대시보드)를 통해 사용자에게 전달되어 검토될 수 있다. 특히, 식별된 각 진단 평가에 대해 CDSS는 하나 이상의 치료 계획, 교정 기구 또는 이들의 조합을 제안할 수 있다. 진단 평가 및 치료 계획은 문제로 식별된 각 치아별 및 구강 전체에 대해 별도로 생성될 수 있다. 108 단계에서, 사용자는 치과 문제로 식별된 각 치아에 대해 치료 계획 옵션을 선택한다. 치료 계획 옵션의 선 택은 사용자의 재량에 따르거나 사용자와 환자가 가장 적합한 치료 계획을 결정하기 위해 협의한 후에 이루어질 수 있다. 이와 관련하여, 사용자는 치료 계획 옵션을 선택할 때 환자의 선호도 및/또는 치과의사가 지정한 선호도를 고려할 수 있다. 예를 들어, 환자는 비용, 위험 대비 이점, 부작용, 개인적 선호도, 통증, 식사 어려움 또 는 치료의 상대적 심미성을 기준으로 제안된 치료 및 교정 기구 결과를 필터링할 수 있다. 마찬가지로, 치과의 사는 구강 상태, 의학적 상태, 사회경제적 상태, 식이 및 행동, 환경적 상태, 치료 옵션의 위험 및 예후를 포함 하여 환자의 전반적인 상태를 고려하여 이상적으로 제안된 치료를 필터링할 수 있다. 109 단계에서, 사용자가 선택한 각 식별된 치과 문제에 대한 치료 계획 옵션이 제1 서버에 입력된다. 제1 서버 는 CDSS에 선택된 치료 계획 옵션을 처리하고 해당 치료에 대한 단계 순서와 함께 최종 치료 계획을 생성하도록 지시하고 실행한다. 최종 치료 계획은 출력 유닛을 통해 사용자에게 전달된다. 치료 단계의 순서는 “긴급 단계”, “컨트롤 단계”, “재평가 단계”, “최종 단계” 및 “유지 관리 단계” 를 포함하되 이에 국한되지 않는 하나 이상의 단계의 형태일 수 있다. “긴급 단계”는 식별된 치과 문제의 응 급 치료가 필요한 경우와 관련이 있지만, 응급 치료가 필요하지 않은 경우 치료 계획에 “긴급 단계”가 포함되 지 않을 수도 있음을 알 수 있다. 따라서, 일 실시예에서는 환자의 치과 치료 계획을 생성하기 위한 컴퓨터 구현 방법이 제공되는데, 이는 다음 단계를 포함할 수 있다: AI 모델을 사용하여 환자의 치과 이미지를 분석하여 AI 예측을 생성하는 단계; AI 예측 과 하나 이상의 사용자로부터 수신한 입력을 기반으로 치과 차트를 작성하는 단계; 작성된 치과 차트와 하나 이 상의 사용자로부터 수신한 입력을 기반으로 CDSS를 사용하여 완성된 치과 설문지를 생성하는 단계; 완성된 치과 설문지를 기반으로 최종 치료 계획을 생성하는 단계; 및 최종 치료 계획을 하나 이상의 사용자에게 표시하는 단 계. 또 다른 실시예에서는, 환자의 치과 치료 계획을 생성하기 위한 컴퓨터 구현 방법이 제공되며, 이는 다음 단계 를 포함할 수 있다: 치과 이미지를 입력하는 단계; 치과 이미지를 제1 서버에서 제2 서버로 전송하고 제2 서버 에 AI 모델을 실행하여 AI 예측을 생성하도록 지시하는 단계; 제1 서버에 AI 예측과 사용자 입력을 기반으로 치 과 차트를 작성하도록 지시하는 단계; 제1 서버에 CDSS를 실행하고 검증된 치과 차트와 사용자 입력을 기반으로 완성된 치과 설문지를 생성하도록 지시하는 단계; 제1 서버에 CDSS를 실행하여 완성된 치과 설문지를 기반으로 최종 치료 계획을 생성하도록 지시하는 단계; 및 최종 치료 계획을 사용자에게 표시하는 단계. 일 실시예에서, 컴퓨터 프로그램이 제공되며, 이 프로그램은 컴퓨터에 의해 실행될 때 컴퓨터가 본 발명에 개시 된 방법을 수행하도록 하는 명령어를 포함한다. 일 실시예에서, 본 발명에 개시된 방법을 수행하도록 구성된 프로세서를 포함하는 컴퓨터 시스템이 제공된다. 일 실시예에서, 프로그램이 컴퓨터에 의해 실행될 때 컴퓨터가 본 발명에 개시된 방법을 수행하도록 하는 명령 어를 포함하는 컴퓨터 판독 가능 저장 매체가 제공된다. 도 4는 치과 차트 작성 및 검증, 완성된 치과 설문지와 최종 치료 계획에 따른 치료 계획 옵션 생성에 관련된 컴퓨팅 하드웨어, 소프트웨어 구성 요소 및 사용자 입력 간의 시스템 및 운영 관계의 대표적인 흐름도이다. 특 히 도 4는 중간 단계를 포함함으로써 도 3에 개시된 방법을 더 정의한다. 201 단계에서, 환자의 치과 이미지는 초기 처리될 제1 서버에 입력된다. 201a 단계에서, 입력된 환자의 치과 이 미지는 출력 유닛을 통해 제1 서버에서 사용자에게 전달될 수 있으며, 제2 서버로도 전송될 수 있다. 201b 단계 에서, 사용자의 요청에 따라 제1 서버는 제1 서버에 AI 모델을 통해 치과 이미지를 처리하도록 지시한다. 202 단계에서, AI 모델은 치과 이미지를 처리하고 출력으로 AI 예측을 생성한다. 203 단계에서, AI 예측은 제2 서버에서 제1 서버로 전송된다. 제1 서버는 수신된 AI 예측을 기반으로 치과 차트 를 작성한다. 204 단계에서, 작성된 치과 차트는 치과 차트와 그 안에 제시된 정보를 검토하고 확인할 목적으로 사용자 인터 페이스를 통해 사용자에게 전달될 수 있다. 204a 단계에서, 치과 차트가 새로운 임상 정보, 환자 데이터, 검사 결과로 수정 또는 업데이트되거나 불일치 사항을 수정해야 하는 경우, 사용자는 치과 차트를 선택적으로 편집할 수 있다. 단계 204b 단계에서, 업데이트된 최종 치과 차트는 제1 서버에 의해 수신되어 추가로 처리될 수 있다. 204c 단계에서, 업데이트된 치과 차트는 추가 검토 및 확인의 목적으로 사용자 인터페이스를 통해 사용자에게 전달될 수 있다. 업데이트된 치과 차트에 추가 수정이나 업데이트가 필요하지 않은 경우, 사용자는 제1 서버에 서 추가로 처리할 수 있도록 최종 치과 차트를 확인하고 검증할 수 있다. 204d 단계에서, 사용자의 요청에 따라, 제1 서버는 CDSS에 최종 치과 차트를 처리하도록 지시하고 실행할 수 있다.205 단계에서, CDSS는 제1 서버로 전송되는 부분적으로 완성된 치과 설문지를 생성한다. 205a 단계에서, 부분적 으로 완성된 치과 설문지는 제1 서버에서 수신되어 검토 및 확인의 목적으로 사용자 인터페이스를 통해 사용자 에게 전달될 수 있다. 206 단계에서, 사용자는 답변된 질문을 확인하고 답변되지 않은 질문을 완료하여 완성된 치과 설문지를 제1 서 버가 추가 처리할 수 있도록 제출할 수 있다. 206a 단계에서, 사용자의 요청에 따라, 제1 서버는 CDSS에 완성된 치과 설문지를 추가 처리하도록 지시할 수 있다. 207 단계에서, CDSS는 완성된 치과 설문지를 처리하고 하나 이상의 치료 계획 옵션과 함께 환자의 구강 상태에 대한 예비 진단 평가를 생성한다. 207a 단계에서, 예비 진단 평가 및 치료 계획 옵션은 제1 서버에서 수신되어 검토 및 확인의 목적으로 사용자 인터페이스를 통해 사용자에게 전달될 수 있다. 208 단계에서, 사용자는 예비 진단 평가를 검토하고 치료 계획 옵션을 선택한다. 208a 단계에서, 사용자의 요청 에 따라, 제1 서버는 CDSS에 선택된 치료 계획 옵션을 추가로 처리하도록 지시할 수 있다. 208b 단계에서, CDSS 는 선택된 치료 계획 옵션을 처리하고 해당 치료에 대한 단계 순서와 함께 최종 치료 계획을 생성한다. 209 단계에서, 상기 치료를 위한 단계 순서와 함께 최종 치료 계획은 제1 서버에 의해 수신될 수 있으며, 사용 자 인터페이스를 통해 사용자에게 전달될 수 있다. 209a 단계에서, 사용자는 단계 순서와 함께 최종 치료 계획 을 검토할 수 있다. 인공지능(Artificial Intelligence, AI) 모델 인공지능 이미지 인식은 파노라마 방사선 이미지와 같은 환자의 치과 이미지를 분석하여, 구강 상태를 판단하는 데 사용될 수 있다. 본 발명에 개시된 인공지능 모델은 객체 감지를 위해 이미지 인식 및 로컬라이제이션을 결 합하고 분석 결과를 자동 치아 차트 시스템에 통합할 수 있다. 본 발명에 개시된 AI 모델의 분석 결과와 출력은 AI 예측을 제공할 수 있다. AI 예측은 신뢰 임계값을 충족하는 것을 기반으로 할 수 있다. AI 예측을 생성하기 위해, AI 모델은 입력된 치과 이미지의 객체 감지를 자동으로 수행하여 치아 위치를 감지하 고 식별하여 치과 문제와 관련된 치아의 넘버링 및 분류를 할 수 있다. 일 실시예에서, AI 모델은 추가적으로 키포인트 감지를 수행할 수 있다. 치아의 위치와 치아 넘버링은 치아 주변에 바운딩 박스를 형성하여 결정될 수 있다. 치아의 분류는 바운딩 박스 내의 객체 감지를 기반으로 할 수 있다. 객체 감지에서, AI 모델은 주로 바운 딩 박스 영역을 감지하는 데 도움이 되는 특징을 추출하는 데 중점을 두며, 해당 영역에 객체가 존재할 가능성 과 그 객체가 치과 문제 자체와 관련될 가능성도 함께 판단할 수 있다. AI 예측은 다음 구성 요소를 기반으로 할 수 있다: 1) 바운딩 박스의 x-min, y-min 좌표, 너비 및 높이(x-min 및 y-min은 바운딩 박스의 좌측 상단 모서리 좌표임); 2) 바운딩 박스에 개체가 존재할 확률; 및 3) 바운딩 박 스에서 감지된 개체의 클래스 확률. 이와 관련하여, 바운딩 박스는 치과 이미지에서 캡처된 각 치아에 대한 경계를 정의할 수 있다. 이후, 감지된 각 치아에 번호를 할당할 수 있다. 번호는 FDI 표기법, 유니버셜 넘버링 시스템, 팔머(Palmer) 표기법 또는 기 타 적절한 치과 표기법에 따라 할당할 수 있다. 치아 번호는 성인 치과 차트를 기반으로 매겨질 수 있지만, 어 린 환자의 경우 유치 치과 차트와 적절한 표기법을 사용할 수 있다는 점을 이해할 수 있을 것이다. 치아 주위에 형성된 바운딩 박스는 치과 이미지에서 치아의 다양한 배열을 나타낼 수 있습다. 예를 들어, 전치 부 치아 주위의 제1 바운딩 박스, 좌측 후치부 치아 주위의 제2 바운딩 박스, 우측 후치부 치아 주위의 제3 바 운딩 박스, 모든 치아 주위의 제4 바운딩 박스가 형성될 수 있다. 또한, 바운딩 박스는 감지된 객체(예: 치과 문제)의 위치가 표면 레벨 또는 치아 레벨에 있을 수 있다는 데이터가 포함될 수 있다(예: 근심, 교합, 원심, 협측, 혀). 따라서 AI 모델의 출력으로서의 AI 예측은 하나 이상의 확률이 될 수 있다. 일 실시예에서, AI 모델의 출력은 분류기 역할을 할 수 있고 치과 이미지에서 위치한 치아에 대한 치과 문제를 감지하기 위한 확률을 할당할 수 있다. 각 분류 및 치과 문제에 대한 임계값 및 확률 값 범위(즉, 0~1 범위)는 다양할 수 있으며 적절히 설정될 수 있다. 일 실시예에서, 분류는 충치, 치주 문제, 결손 치아, 크라운, 브릿지, 임플란트, 충전물, 온레이, 인레이, 베니 어, 실패 또는 결함이 있는 복원물(충전물, 크라운, 브릿지, 베니어, 인레이, 온레이), 근관 치료, 포스트 및 코어, 매복 치아, 부분적으로 돌출된 치아, 돌출되지 않은 치아, 유치, 골절, 치근단 병변, 잔류된 뿌리, 구강 및 악안면 병리학, 구강 해부학적 랜드마크, 적용 가능한 치열 교정 기준에 따라 바람직하지 않은 환자의 치아배열 및/또는 이들의 조합을 포함하되 이에 국한되지 않는 치과 문제를 나타낼 수 있다. 치아 배열은 과교합, 교차교합, 개방교합, 과도교합, 과소교합 등과 같은 의학적, 치열 교정적, 심미적 및 기타 이유로 바람직하지 않을 수 있다. 일 실시예에서, 분류는 충치, 치주 질환 영역 및 복원물일 수 있다. 각 치과 문제는 서로 다른 단계, 진행 상태 및/또는 발병 심각도를 가질 수 있다. 이에 따라 AI 모델은 입력된 치과 이미지에서 치아를 탐지하고 넘버링 할 수 있으며, 비병리적, 병리적 치과 문 제를 탐지하고 분류할 수 있다. 일 실시예에서, AI 모델은 객체 감지를 위한 하나 이상의 딥러닝 CNN을 포함할 수 있으며, 여기서 각 딥러닝 CNN은 다른 치과 문제를 감지하는 데 사용될 수 있다. 일 실시예에서, 각 딥러닝 CNN은 크기가 동적인 객체(예: 결손 치아, 충치 및 잇몸 질환 및 모든 치아 복원물 또는 충전물) 또는 크기가 정적인 객체(예: 치아 위치/넘버 링 및 매복 치아)를 감지하는 데 사용될 수 있다. 일 실시예에서, AI 모델은 객체 감지를 위한 두 개 이상의 딥러닝 CNN을 포함할 수 있으며, 여기서 각 딥러닝 CNN은 순차적으로 또는 순서대로가 아니라 동일한 입력 치과 이미지를 개별적으로 처리하기 위해 병렬로 작동할 수 있다. 이와 관련하여, 치과 이미지는 각 딥러닝 CNN에 입력되어 동시에 처리되고 별도의 출력 예측을 제공할 수 있으며, 이를 결합하여 통합된 AI 예측을 형성할 수 있다. 예를 들어, 제1 딥러닝 CNN은 치아 위치/번호를 감지하는 데 사용될 수 있고, 제2 딥러닝 CNN은 충치를 감지하는 데 사용될 수 있으며, 제3 딥러닝 CNN은 복원 물을 감지하는 데 사용될 수 있으며, 제4 딥러닝 CNN은 유치를 감지하는 데 사용될 수 있으며, 제5 딥러닝 CNN 은 매복된 치아를 감지하는 데 사용될 수 있으며, N번째 딥러닝 CNN은 기타 치과 문제 중 하나를 감지하는 데 사용될 수 있다. 일 실시예에서, 머신 러닝 CNN은 딥러닝 CNN일 수 있다. 일 실시예에서, AI 모델은 두 개 이상의 딥러닝 CNN을 포함할 수 있다. 또 다른 실시예에서, AI 모델은 두 개의 딥러닝 CNN을 포함할 수 있다. 제1 딥러닝 CNN은 크기가 동적인 객체를 감지하는 데 사용될 수 있다. 제2 딥러닝 CNN은 크기가 정적인 객체를 식별하는 데 사용될 수 있습니다. 일 실시예에서, 제1 및 제2 딥러닝 CNN은 모두 객체 감지 CNN 모델이 될 수 있다. 제1 딥러닝 CNN은 로컬라이제이션 및 분류를 위해 각 객체에 대한 바운딩 박스를 형성하는 3개 지점을 기반으로 객체를 예측하는 아키텍처를 가질 수 있다. 3개 지점은 왼쪽 상단 모서리, 오른쪽 하단 모서리 및 중앙이 될 수 있으며, 이를 사용하여 각 객체에 대한 바운딩 박스를 형성할 수 있다. 제1 딥러닝 CNN은 센터 풀링 및 캐스케 이드 코너 풀링의 개념으로 기능할 수 있다. 센터 풀링은 피처 맵의 수평 및 수직 방향에서 최대값을 참조하고, 캐스케이드 코너 풀링은 경계 최대값, 내부 최대값 및 이 두 값의 합을 식별하는 것을 참조한다. 제2 딥러닝 CNN은 제1 딥러닝 CNN과 다른 아키텍처를 가질 수 있는데, 제1 딥러닝 CNN은 영역이나 박스의 객체 를 예측하는 것과는 반대로 포인트로 객체를 예측한다. 제2 딥러닝 CNN은 Faster-RCNN과 같은 다른 CNN 아키텍 처와 달리 양방향 피처 피라미드 네트워크(bi-directional feature pyramid network, BiFPN)를 채택할 수 있다. 특히, 제2 딥러닝 CNN은 더 미세한 세부 사항을 캡처할 수 있을 만큼 충분한 폭(더 작은 객체는 더 큰 이 미지에서 더 크기 때문)과 이미지 자체에서 더 큰 시멘틱을 추출할 수 있을 만큼 충분한 깊이의 아키텍처를 가 질 수 있다. 입력 이미지의 크기는 중요할 수 있으며, 제2 딥러닝 CNN 내에 휴리스틱 기반 스케일링 메커니즘이 존재할 수 있다. 이러한 요구 사항을 수용하기 위해 제2 딥러닝 CNN은 복합 스케일링 아키텍처를 가질 수 있다. 바람직한 실시예에서, 딥러닝 CNN은 EfficientDet 및 CenterNet을 포함할 수 있다. EfficientDet 모델은 크기 가 정적인 객체를 식별하는 데 사용될 수 있는 반면, CenterNet 모델은 크기가 동적인 객체를 감지하는 데 사용 될 수 있다. EfficientDet는 검출을 위한 사전 관심 영역을 결정하기 위해 앵커 메커니즘에 의존하지만, 다양한 크기를 제공 하기 위해 앵커를 적절하게 구성해야 하는 필요성은 번거로울 수 있다. 반면, CenterNet은 포인트로 객체를 검 출하고 튜닝할 하이퍼-파라미터가 덜 필요하며, 예측에 더 많은 역동성을 허용하여 모델이 샘플 예측 중에 크기 가 다를 수 있는 객체 클래스를 보는 경우에 잘 작동한다. EfficientDet 및 CenterNet 이외의 CNN도 객체 검출 에 대해 동일한 기능과 결과를 수행하는 본 발명에 개시된 AI 모델에 채택될 수 있다는 점이 인식될 것이다. 본 발명에 개시된 딥러닝 CNN은 다양한 구강 구조 및 구강 상태(건강하거나 치과 문제가 있는)를 나타내는 환자 정보 데이터 세트를 사용하여 훈련될 수 있다. CNN은 딥러닝 기술을 통해 훈련될 수 있으므로 본 발명에 개시된 시스템 및 방법에 적용되어 치아의 위치 및 클래스와 치과 문제의 증상적 특징을 나타낼 수 있는 객체를 정확하 고 민감하게 식별할 수 있다. 특히, 딥러닝 CNN은 환자 집단에서 파생된 대규모 데이터 세트를 사용하여 훈련될수 있다. 머신 러닝 패키지 또는 플랫폼을 사용하여 CNN을 훈련할 수 있다. 데이터 세트에는 CNN의 분석 결과를 검증하는 데 도움이 되는 임상 전문가 검사 결과와 결합된 환자의 파노라마 방사선 이미지 레코드가 포함될 수 있다. 도 5는 딥러닝 CNN을 훈련하는 데 사용할 수 있는 모듈의 구조와 서로 및 컴퓨터 시스템의 특정 하드웨어와의 작동 관계에 대한 대표적인 실시예를 보여준다. 특히 CNN의 훈련에는 전처리 증강 모듈, TF 레코드 생성 모듈, 데이터 검사기 모듈, 데이터 생성 모듈 및 TF 객체 감지 API를 사용하는 것이 포함될 수 있다. 전처리 증강 모듈은 불필요한 이미지 부분을 잘라내는 것과 같이 개선된 객체 감지를 위해 치과 이미지를 조작 하는 데 사용될 수 있다. TF 레코드 생성 모듈은 치과 이미지를 protobuf 파일(즉, 모든 이미지를 포함하는 하 나의 파일)로 변환하는 데 사용될 수 있으며, 이는 데이터를 로드/처리할 때 TensorFlow 프레임워크 내에서 최 적화된다. 데이터 검사 모듈은 특정 휴리스틱 검사를 수행하여 품질 레이블(예: 치아 번호 레이블)을 보장하는 데 사용될 수 있다. 데이터 생성 모듈은 XML 파일 레이블을 TF 레코드 섹션과 분석을 위해 더 쉽게 사용할 수 있도록 표 형식으로 변환하는 데 사용될 수 있다. 객체 감지 API는 Google과 같은 검색 플랫폼의 오픈 소스 라 이브러리가 될 수 있으며, 여기에는 많은 인기 있는 객체 감지 모델 아키텍처가 코딩되어 사용될 수 있다. 훈련 시스템의 모듈 및 API는 각각 데이터베이스 및 클라우드 스토리지 시스템과 양방향 링크를 통해 연결되어 이들 사이에서 데이터를 수신하고 전송할 수 있다. 일 실시예에서, 훈련 시스템의 모듈은 컴퓨터 판독 가능 저 장 매체에 소프트웨어 명령어로 저장될 수 있다. 일 실시예에서, 딥러닝 CNN은 지속적으로가 아니라 주기적으로 재교육되거나 최적화될 수 있다. 따라서 딥러닝 CNN은 필요할 때 일괄 처리로 업데이트되고 재훈련될 수 있다. 딥러닝 CNN의 훈련에 따라, 출력 AI 예측 결과는 블라인드 데이터 세트에서 교차 검증 기법으로 검증하는 것이 바람직하다. 특히, 딥러닝 CNN은 훈련에 사용되지 않은 치과 이미지의 검증 세트로 처리될 수 있으며, 훈련 데 이터 세트에 대한 별도의 개별 이미지 데이터 세트이다. 검증 데이터 세트를 사용하는 딥러닝 CNN의 성능은 훈 련 데이터 세트와 비교하여 본 발명에 개시된 딥러닝 CNN의 정확도를 판단할 수 있다. 이와 관련하여, 검증 데 이터 세트는 사용된 각 CNN에 대해 사용될 수 있으며, 그 결과는 치과 문제 감지에 사용하기에 가장 적합한 CNN 을 나타낼 수 있다. 검출된 치아 번호 및 치과 문제와 관련하여 AI 모델에서 얻은 출력은 AI 예측을 형성한다. 이러한 AI 예측은 제 2 서버에서 제1 서버로 전송되어 치과 차트를 작성할 수 있다. 일 실시예에서, AI 모델의 원시 출력은 텐서 형 식일 수 있으며, 그런 다음 JSON으로 변환되어 제1 서버로 반환된다. 특히, AI 모델의 각 CNN의 출력 결과는 확 률 및 위치 정보를 포함하여 결합되어 최종 원시 AI 모델 출력을 형성할 수 있다. AI 예측은 후처리 단계에서 치과 차트를 자동으로 작성하는 데 사용될 수 있다. 치과 차트의 자동 작성은 IOU(Intersection over Union)와 같은 메트릭을 사용할 수 있다. 특히, IOU는 두 바운딩 박스 사이의 겹치는 면적의 백분율을 2개 박스의 결합된 전체 면적에 대한 비율로 나타내며, 치과 차트에 표시하기 위해 해당 치아 에 탐지된 분류(충치, 보철물 등)를 할당하는 알고리즘이다. 임상 의사결정 지원 시스템(Clinical Decision Support System, CDSS) 임상 의사결정 지원 시스템(CDSS)은 의료 지식 엔지니어링을 활용하는 전문가 시스템(expert systems, ESs)의 한 분야를 나타낸다. CDSS는 ES 설계 원칙을 사용하여 일반적으로 의료 전문가가 수행하는 진단 및 치료 프로세 스를 시뮬레이션할 수 있다. 목표는 임상 전문가들이 복잡한 의료 문제를 해결하거나 진단을 내릴 수 있도록 돕 는 것이다. 의사결정 지원 시스템의 기존 구조에서, 의사결정자 또는 사용자는 주어진 정보와 문제에대한 해석과 이해를 통 해 해결책에 도달하게 된다. 의사결정자가 둘 이상인 경우 프로세스가 복잡해질 수 있으며, 특히 사용 가능한 정보가 주관적이거나 객관적이거나 둘의 조합일 때 더욱 그렇다. 치과 클리닉의 특정 맥락에서 문제와 해결책은 환자에게 가장 적합한 치과 치료와 관련이 있다. 의사 결정자가 내리는 결정은 문제 자체에 따라 달라지며, 이는 의사 결정자가 채택하는 기준과 문제에 대한 관련 정보에 영향 을 미친다. 대부분의 임상 상황에서 환자는 재정적 비용과 심미적 요구 사항 측면에서의 정보가 의사 결정의 최 종 결과에 영향을 미칠 수 있는 의사 결정자 역할을 할 수도 있다. 치과의사는 가능한 위험 요인의 회상 및 적 용과 평가와 같이 인지 기능에 의해 제한되고 다르기 때문에 서로 다른 치과의사 또는 한 치과의사가 다른 시간 에 내리는 결정에 잠재적인 차이가 있을 수 있다. 본 발명에 개시된 CDSS는 이러한 차이를 최소화할 수 있다.구체적으로, 환자를 관리하는 개별 임상 전문가에 기반한 주관적인 분석이나 진단이 아니라, 본 발명에서 개시 된 CDSS는 교수, 치과 전문의 및 경험이 풍부한 치과의사로 구성된 치과 전문가 위원회에서 수집한 전문 지식을 나타낸다. 따라서 환자에게 상당한 이점을 제공하여 과소치료, 과잉 치료 및/또는 과실의 위험을 줄여 환자에게 큰 이익을 제공할 수 있다. 전통적으로 CDSS는 과거 데이터를 사용하여 데이터 중심 접근 방식만을 기반으로 할 수 있다. 이 접근 방식은 편향되지 않고 지식 기반 접근 방식보다 비교적 저렴하지만, 가장 큰 단점은 데이터 중심 접근 방식이 특정 종 류의 치료 계획으로 제한된다는 것이다. 의사 결정 지원 시스템을 성공적으로 구현하려면 도메인 및 기술 분야 내에서 지식 기반 데이터와 정보를 고려하는 것이 중요하다. 따라서, 일 실시예에서 사용되는 CDSS는 규칙 기반 또는 지식 기반 CDSS일 수 있다. 즉, 본 발명에 개시된 CDSS 는 데이터 기반 접근 방식을 사용하지 않고, 오로지 지식 기반 CDSS를 사용하여 치과 설문지, 진단 및 치료 계 획 옵션을 생성한다. 본 발명에 개시된 방법과 시스템에 사용된 CDSS는 자동화된 진단 및 치료 계획 옵션 시스템을 제공하여 사용자 가 환자의 필요에 따라 객관적이고 신뢰할 수 있는 치료 계획 옵션을 받을 수 있다. 이와 관련하여, 본 발명에 개시된 CDSS는 각 환자의 특정 특성을 사용하여 의사 결정 프로세스를 위한 전문가 시스템을 제공하도록 구성 및 설계될 수 있다. 일 실시예에서, 본 발명에 개시된 CDSS는 데이터 처리 방법을 나타내는 소프트웨어 애플리 케이션 또는 프로그램의 형태일 수 있다. 일 실시예에서, CDSS는 방향 그래프 형태의 규칙 기반 프레임워크를 포함한다. 방향 그래프는 기본 단위로 하나 이상의 노드/정점과 노드 사이의 커넥터로서 특정 방향을 가리키는 에지를 포함할 수 있다. 예를 들어, A>B는 A 가 B로 이동할 수 있지만 그 반대는 불가능하다는 것을 의미한다. 따라서 CDSS와 규칙 기반 또는 지식 기반 접 근 방식은 소프트웨어에 코딩된 그래프 규칙의 형태일 수 있다. 이러한 규칙은 이전 질문의 답변에 따라 사용자 에게 다음에 나타나는 질문을 지시하고, 진단 및 치료 계획 옵션을 생성하는 규칙이다. 일 실시예에서, CDSS는 방향 비순환 그래프 형태의 규칙 기반 프레임워크를 갖춘 규칙 엔진을 포함할 수 있다. 규칙 기반 프레임워크는 규칙이 XML 파일이나 그래프 데이터베이스에 저장될 수 있는 JavaScript 프런트엔드 프 레임워크이다. JavaScript 프런트엔드는 로드 시 규칙을 구문 분석하고 이후 사용자의 선택에 따라 JavaScript 가 그래프를 탐색하고 규칙에 명시된 논리에 따라 출력을 반환하는 데 도움이 된다. 일 실시예에서, 본 발명에 개시된 CDSS는 도메인 내의 지식 기반 데이터를 시뮬레이션하는 그래프 데이터 구조 를 사용하여 구축되고 개발될 수 있다. CDSS의 규칙 기반 또는 지식 기반 프레임워크는 교과서, 저널 등과 같은 산업계에서 인정하는 의학 문헌에서 발 견되는 정보에서 파생될 수 있습니다. 따라서 이 지식 기반 접근 방식은 학술 연구 및 조사, 임상 전문가 지식 및 산업 모범 사례를 통합하여 주어진 구강 상태에 대해 환자에게 치료를 제공하는 윤리적 단계를 포함할 수 있 다. 임상 전문가 지식은 유명한 교수 및 전문가 전문가로부터 파생될 수 있다. CDSS의 지식 기반 접근 방식은 추론과 결합될 때 진단 추론을 할 수 있는 지식 설명 언어를 만드는 데 중점을 둔다. 본 발명에 개시된 CDSS는 포괄적인 단계별 프로토콜 또는 규칙 기반 그래프를 기반으로 하여 사용자(예: 임상 전문가)가 환자의 개인 및 임상 데이터를 직관적이고 체계적으로 수집하고 분석하여 포괄적이고 개별화된 치료 및 치료 계획을 개발할 수 있도록 지원할 수 있다. 머신 러닝 도구(예: 지도 학습)보다 CDSS를 사용하는 이점은 다른 \"블랙박스\" 알고리즘과 달리 각 결정 단계가 명확하게 식별되고 추적 가능한 임상적으로 해석될 수 있다. 도 6a는 본 발명에 개시된 CDSS와 제1 서버와의 관계를 나타내는 대표적인 실시예이다. 제1 서버는 사용자가 환 자의 사회적, 의료적 및 치과적 병력, 생체 데이터와 치과 차트를 보고 필요한 경우 이를 업데이트할 수 있는 사용자 인터페이스 구성 요소를 포함할 수 있다. 제1 서버 사용자 인터페이스 구성 요소는 IDMS 웹페이지를 포 함할 수 있다. 환자의 사회적, 의료적 및 치과적 병력, 생체 데이터와 치과 차트는 데이터베이스 모듈에 의해 관리되고 추출될 수 있다. 데이터베이스 모듈은 MySQL 데이터베이스 모듈일 수 있다. 데이터 모델은 데이터베이 스 모듈로부터 수신된 데이터를 조직하고 이들 간의 관계를 표준화하기 위해 제1 서버에 포함될 수 있다. CDSS는 사용자가 생성된 설문지, 치료 계획 옵션 및 최종 치료 계획을 보고, 그 안의 정보를 완성하거나 선택할 수 있는 CDSS 사용자 인터페이스 구성 요소를 포함할 수 있다. CDSS 사용자 인터페이스 구성 요소는 HTML 웹페 이지를 포함할 수 있다. JavaScript 프레임워크에서 규칙을 사용하는 규칙 엔진을 사용할 수 있다. 또한, 확장가능한 마크업 언어(Extensible Markup Language, XML)에서 규칙을 정의할 수 있는 의료 규칙 모듈을 포함할 수 있다. API 컨트롤러는 제1 서버와 CDSS 간의 요청, 보다 구체적으로는 CDSS 사용자 인터페이스와 제1 서버의 데이터 모델 간의 요청을 처리하기 위해 포함될 수 있다. 여기서 데이터 모델은 단순히 지정된 논리에 따라 데이터 구 조를 관리한다. 도 6b는 컴퓨팅 구성요소 간의 CDSS의 흐름도 및 운영 관계와 사용자로부터의 입력 및이들이 CDSS와 상호 작용 하는 방식을 보여준다. 301a 단계에서, 환자의 사회적, 의료적 및 치과적 병력과 생체 데이터는 사용자가 제1 서버 사용자 인터페이스 를 통해 보고 업데이트할 수 있다. 마찬가지로, 301b 단계에서, 작성된 치과 차트는 사용자가 제1 서버 사용자 인터페이스를 통해 업데이트하고 마무리할 수 있다. 사용자는 이후 CDSS가 301a 및 301b 단계의 입력을 처리하 도록 요청할 수 있다. 302 단계에서, CDSS 사용자 인터페이스는 301a 및 301b 단계로부터 입력을 수신한다. 303 단계에서, CDSS 규칙 엔진은 의료 규칙 처리를 위해 의료 규칙 모듈에서 추출할 것을 요청한다. 304 단계에서, 의료 규칙 모듈은 규 칙 엔진으로부터 요청을 수신하고, 305 단계에서 규칙을 규칙 엔진으로 전송한다. 306 단계에서, 규칙 엔진은 처리된 규칙에 따라 301a 및 301b 단계에서 수신된 정보를 사용하여 질문에 자동으 로 답변한다. 규칙 엔진은 307 단계에서 CDSS 사용자 인터페이스로 보낼 질문과 답변이 포함된 HTML 코드를 생 성한다. 308 단계에서, CDSS 사용자 인터페이스는 307 단계의 답변으로 로드되어 부분적으로 완성된 설문지와 치료 계획 옵션이 생성된다. 309 단계에서, 사용자는 답변된 질문을 확인하고 답변되지 않은 질문을 완료하여 완성된 치과 설문지를 제출할 수 있다. 설문지가 완료되면 사용자 선택을 위한 치료 계획 옵션이 생성된다. 310 단계에서, 규칙 엔진은 완성된 설문지와 선택된 치료 계획 옵션을 처리하여 일련의 단계로 구성된 최종 치 료 계획을 생성한다. 최종 치료 계획은 렌더링되어 사용자가 311 단계에서 검토할 수 있도록 CDSS 사용자 인터 페이스로 전송된다. 최종 치료 계획은 제1 서버 사용자 인터페이스에서 수신되어 저장된다. 사용자 인터페이스 (대시보드) 도 7a-f에 도시된 바와 같이, AI 모델 및 CDSS로부터의 정보 및 출력은 제1 서버 및 사용자 인터페이스 또는 대 시보드를 통해 사용자에게 표시될 수 있다. 도 6a 및 b에 표시된 바와 같이, 이 사용자 인터페이스는 제1 서버 사용자 인터페이스 및 CDSS 사용자 인터페이스를 포함할 수 있다. 특히, 사용자 인터페이스/대시보드는 환자 데이터, 치과 문제 또는 상태 및 치료 계획과 관련된 별도의 카테고 리를 통해 정보를 제공할 수 있다. 이 대시보드는 URL로 식별되는 웹 액세스 페이지 형태로 사용자에게 제공되 거나 컴퓨터에서 실행되는 애플리케이션으로 제공될 수 있다. 대시보드는 부분적으로 완성된 설문지를 제공하고 사용자가 질문을 입력하고 완성할 수 있도록 작동할 수 있다. 도 7a에 도시된 바와 같이, \"일반\"이라는 레이블이 붙은 기능 탭은 환자의 증상 및 위험의 수를 선택하는 옵션 과 환자의 의료, 사회 또는 치과 병력에 대한 환자 생체 데이터의 관련성을 포함하는 환자 정보 표시 영역과 관 련될 수 있다. 도 7b-e는 AI 모델에 의해 식별되고 최종 치과 차트에 표시된 치과 문제에 대한 전용 질문이 있는 별도의 탭을 보여준다. 각 탭은 사용자가 완료하고 검토할 치과 문제의 증상과 관련된 사전 설정된 선택 및 일련의 질문으로 식별된 각 치과 문제에 대해 제공될 수 있다. 사용자가 증상과 관련된 질문을 완료한 후, 사용자가 선택할 수 있는 하나 이상의 치료 옵션과 함께 진단이 제공된다. 예를 들어, 도 7b에서 검출된 충치에 대한 탭이 표시되고 대표적인 치과 차트는 충치가 치아 번호 23과 관련이 있음을 나타내며, 충치는 중등도 충치 또는 근관 충치로 구별될 수 있고, 그 다음에 해당 충치의 위치(근심, 교합, 원심, 협측, 혀)가 이어지며, 사용자는 그런 다음 진 단과 선택할 수 있는 세 가지 치료 옵션을 제공하는 번호가 매겨진 질문 1 및 2에서 충치의 증상(통증)을 선택 할 수 있다. 도 7c 및 7d에서, 검출된 치주 질환에 대한 탭이 표시되어 있으며, 이 치주 질환은 일반적(전체 구 강) 또는 국소적(치아별)으로 구분할 수 있으며, 각각은 진단을 제공하고 선택할 수 있는 두 가지 치료 옵션을 제공하기 위해 해당 치주 질환의 위치(좌측, 우측, 상부, 하부), 크기(<3mm, >5mm) 및 증상(궤양, 부기, 통증)과 관련된 하나 이상의 질문을 포함한다. 도 7e에서, 하나 이상의 검출된 결손 치아에 대한 탭이 표시되어 있으 며, 진단을 제공하고 선택할 수 있는 네 가지 치료 옵션을 제공하기 위해 해당 결손 치아의 증상(정렬, 치수)에 대한 질문이 제공된다. 각 치과 문제에 대한 치료 옵션을 선택하고 모든 필수 질문에 답하면, 완성된 설문지는 CDSS에서 추가 처리되어 일련의 치료 단계가 포함된 최종(전체) 치료 계획을 생성할 수 있다. 치료 단계의 순서는 \"긴급 단계\", \"컨트롤 단계\", 재평가 단계\", \"최종 단계\" 및 \"유지 관리 단계\"를 포함하되 이에 국한되지 않는 하나 이상의 단계의 형 태일 수 있다. \"긴급 단계\"는 식별된 치과 문제에 대한 응급 치료의 필요성과 관련이 있지만, 응급 치료가 필요 하지 않은 경우 치료 계획에 \"긴급 단계\"가 포함되지 않을 수 있음을 알 수 있다. 도 7f에서 예시된 최종 치료 계획이 치료 단계의 순서와 함께 표시되어 있다. 주지한 바와 같이, 최종(전체) 치 료 계획에 포함된 단계는 답변된 질문에 따라 달라진다. 예를 들어, 도 7b에서 사용자가 옵션 1 대신 옵션 2를 선택하면 최종 치료 계획에 재평가 단계가 나타난다. 따라서, 일 실시예에서 치료 단계의 순서는 1. 긴급 단계; 2. 컨트롤 단계; 3. 재평가 단계; 4. 최종 단계; 및 5. 유지 단계일 수 있다. 다른 실시예에서, 치료 단계의 순서는 1. 컨트롤 단계; 2. 재평가 단계; 3. 최종 단계; 및 4. 유지 단계일 수 있다. 또 다른 실시예에서, 치료 단계의 순서는 1. 긴급 단계; 2. 컨트롤 단계; 3. 최종 단계; 및 4. 유지 단계일 수 있다. 긴급 또는 응급 단계(Urgent or Emergency Phase, UP)는 발열, 부기, 통증, 출혈 또는 감염이 있는 환자가 긴 급하게 치료를 받아야 하는 경우와 관련될 수 있다. 컨트롤 단계(Control Phase, CP)는 a) 충치 및 염증과 같은 활성 질환을 제거하기 위해; b) 유지 관리를 방해하 는 상태를 제거하기 위해; c) 질병의 잠재적 원인을 제거하기 위해; 그리고 d) i) 잇몸 및 치주 감염 관리; ii) 충치 위험 관리; 및 iii) 충치가 있는 치아 관리와 같은 예방 치과 활동을 시작하기 위해 계획될 수 있다. 재평가 단계(Re-Evaluation Phase, RP)는 염증이 해소되고 치유될 시간을 허용하는 보류 단계를 의미할 수 있다. 따라서 이 단계 동안 가정 치료 습관이 강화되고 추가 치료에 대한 동기가 평가되며 확정적인 치료를 시 작하기 전에 초기 치료 및 치수 반응이 재평가된다. 최종 단계(Definitive Phase, DP)는 특정 치과 문제를 교정하고 해결하기 위한 단계를 의미할 수 있다. 이 단계 에는 치주 수술, 구강 수술, 결손 치아 교체가 필요할 수 있다. 일 실시예에서, 결손 치아/치아 관리가 이 확정 적 단계에서 이루어진다. 유지 관리 단계(Maintenance Phase, MP)에는 검토 및 후속 검사를 위한 정기적인 리콜 기간이 포함될 수 있으며, 이는 다음을 포함할 수 있다: a) 향후 악화를 방지하기 위한 조정이 필요한지 여부를 나타낼 수 있으며, b) 가정 내 관리를 강화할 수 있는 기회를 제공한다. 이 단계는 식별된 치과 문제의 발달 단계 및 심각 도에 따라 3개월, 6개월 또는 12개월마다 환자를 검토해야 함을 나타낼 수 있다. 예를 들어, i) 환자가 3단계 및 4단계 치주염 또는 고위험 충치가 있는 경우 3개월마다 검토해야 하고; ii) 환자가 중간 위험 충치 및 1단계 또는 2단계 치주염인 경우 6개월마다 검토해야 하며; 그리고 iii) 환자가 저위험 충치 또는 치주 건강 상태인 경우 12개월마다 검토해야 한다. 치료 권장 사항에 따라 사용자는 자신의 판단과 경험과 함께 CDSS와 권장 사항을 기반으로 결정을 내릴 수 있다. 또한 CDSS의 출력 결과는 시각적 검사와 표준 테스트(예: 단위 테스트, 통합 테스트)를 사용하여 결정 맵 과 일관성을 확인하고 검증하여 견고성을 보장할 수 있다. 또한 CDSS는 전문가 그룹에서 진단의 포괄성과 정확 성을 테스트하고 생성된 권장 치료 계획을 검증했다. 작동 예시 다음의 비제한적 예들은 현재 고려 중인 대표적인 실시예에 대한 보다 완전한 이해를 용이하게 하기 위해 설명 목적으로만 제공된다. 이러한 예들은 본 발명에 개시된 시스템의 구성 요소와 방법의 단계가 결합될 수 있는 모 든 가능한 맥락의 단순한 하위 집합이 되도록 의도되었다. 따라서 이러한 예들은 시스템의 구성 요소의 유형 및 양 및/또는 그 방법 및 용도에 관한 것을 포함하며 본 발명에서 설명된 실시예를 제한하는 것으로 해석되어서는 안 된다. 치과 클리닉 환경에서 환자는 하나 이상의 치과 문제를 가지고 클리닉을 방문할 수 있다. 치과의사는 환자의 치 과 상태를 더 잘 이해하기 위해 엑스레이(파노라마 방사선 이미지)를 요청할 것이다.이 엑스레이 및 기타 환자 데이터는 본 발명에 개시된 컴퓨터 시스템에 입력될 수 있다. 이와 관련하여, 시스템 은 클리닉의 환자 관리 시스템(Patient Management System, PMS)에 내장될 수 있다. 시스템은 환자가 가지고 있 는 구강 문제를 나타내는 출력을 몇 초 이내에 제공한다. 종종 환자가 통증을 호소하며 내원하면 치과의사의 즉 각적인 우선순위는 엑스레이에서 단일 통증 영역을 확인하는 것이며, 다른 치과 문제를 간과할 수 있다. 본 발명에 개시된 시스템의 AI 모델을 통해 엑스레이 이미지를 공급함으로써, 전체적인 분석이 수행되어 몇 초 이내에 여러 구강 문제를 잠재적으로 감지할 수 있다. 결과적으로 치과 차트는 치과의사가 환자와 즉시 검토할 수 있는 구강 상태에 대한 AI 예측으로 자동으로 채워진다. 예를 들어, 환자가 치통으로 클리닉에 왔을 수 있지 만, 시스템 분석을 통해 추가로 4-5개의 상호 연관된 문제가 감지될 수 있다. 치과의사가 추가 임상 검사를 통해 발견한 치과 문제는 본 발명에 개시된 CDSS에 의해 추가로 처리된다. CDSS는 치과의사가 선택할 수 있는 치료 계획 옵션과 함께 치과의사가 답할 수 있는 설문지를 생성한다. 치료 옵션을 선택하고 설문지를 완료한 후, 모든 발견된 치과 문제에 대해 적절한 순서가 있는 최종 치료 계획이 생성된다. 치료 단계의 올바른 순서는 때때로 치료의 성공률이 올바른 순서에 의해 결정되기 때문에 중요하다. 예를 들어, 잇몸/뼈 문제가 먼저 해결된 경우 임플란트의 성공률이 더 높아진다. 잇몸/뼈 문제를 포함한 구강 위생 상태가 좋지 않은 구강에 임플란트를 삽입하는 경우 임플란트 실패 가능성이 증가한다. 따라서 본 발명에 개시된 시스 템 및 방법은 잇몸을 치료한 다음 임플란트 시술을 진행하는 것과 관련된 올바른 순서를 생성한다. AI 모델을 사용하여 환자 데이터(엑스레이 이미지)를 분석하고 CDSS를 사용하여 치료 계획을 생성하는 것은 환 자의 초기 방문 중에 완료된다. 즉, 환자는 잠재적인 구강 상태 또는 질병을 위해 치과 클리닉을 방문하고 환자 의 치과 상태를 해결하기 위한 완전한 전체적 치료 계획이 제공될 것이다. 또한, 심각한 치과 문제는 전체적 치 료 계획을 통해 조기에 발견되거나 예방될 것이다. 따라서, 본 발명에 개시된 시스템 및 방법은 업계 전반의 치과 진료 표준을 개선하는 것을 목표로 한다. 환자는 더 이상 주된 구강 질환에 대한 정보와 조언만을 받지 않고, 구강 상태에 대한 포괄적이고 전체적이면서도 개인 화된 진단 및 치료 계획을 받게 된다. 환자는 개인적 판단과 편견에 따른 가능한 오류를 피하면서 보다 정확한 진단과 최상의 치료 옵션을 제공받을 수 있다. 더욱이 치과 질환을 조기에 발견할 수 있다. 이를 통해 환자는 치료 비용을 관리하는 데 도움이 되고 동시에 지역 사회에서 우수한 치과 의료 제도에 대한 인식과 지식을 높일 수 있다. 예시 1 도 8은 환자의 구강 상태를 분석하고 도 3에 설명된 대표적인 방법 단계를 따라 치료 계획을 생성하기 위해 본 발명에서 개시된 시스템 및 방법에 입력된 예시적 엑스레이 이미지를 보여준다. 처음에 치과의사는 환자를 검사하는 동안 구강 전체 엑스레이를 촬영한다. 엑스레이는 시스템에 업로드되어 사 용자 인터페이스를 통해 치과의사에게 검토를 위해 표시된다. 이후 시스템은 AI 모델을 사용하여 치과의사의 요 청에 따라 엑스레이 이미지를 분석한다. AI 모델 분석 결과는 추가 관련 정보 및 세부 정보와 함께 표시된 치과 문제와 함께 치아 번호를 나열하는 치과 차트를 작성하는데 사용된다. 치과 차트는 사용자 인터페이스를 통해 치과의사에게 표시되며, 치과의사는 환자 를 추가로 검사한 후 해당 치과 차트를 업데이트하고 변경한다. 작성된 최종 치과 차트는 도 9에 표시되어 있으며 아래 표 1에 표시된 바와 같이 AI 예측으로 채워진 표가 함께 제공된다. 표 1 치아 번호 세부 사항 증상 18 결손 - 24 임플란트 - 24 크라운 크라운 26 결손 - 36 충전 충전 - O 38 발치 충돌 46 충치 광범위한 충치 - D 46 충전 충치 충전 - O 47 결손 -48 결손 - 최종 치과 차트를 기반으로 치과의사는 각 치아와 증상에 대해 질문에 답변해야 하는 부분적으로 완성된 치과 설문지를 생성한다. 이 설문지는 사용자 인터페이스를 통해 치과의사에게 표시되며, 치과의사는 이를 완성할 수 있다. 치과 설문지는 아래 표 2에 표시된 대로 치아 #46의 문제와 관련하여 선택을 위한 다음과 같은 다중 선택형 질 문을 포함한다. 이와 같이, 설문지는 해당 문제와 관련 세부 정보에 따라 문제가 있는 다른 치아에 대해 다를 수 있다. 표 2 치아 #46 Q1. 통증 ·자발적(spontaneous), 심하고 지속적 ·자극적(stimulated), 심하고 지속적 ·자극적, 심하고 비지속적 ·둔하고 지속적 ·자극적, 둔하고 지속적 ·둔하고 비지속적 ·자극적, 둔하고 비지속적 ·없음 Q2. 크라운에서의 방사선투과성 ·에나맬 ·상아질 외부 3분의 1 ·상아질 중간 3분의 1 ·상아질 내부 3분의 1 ·치수에 접근하거나 치수 내 ·관련 없음 Q3. 치수 감각 검사 ·대조군에 비해 과도한 반응 또는 낮은 수치 ·대조군에 비해 동일한 반응 또는 더 높은 수치 ·반응 없음 설문지를 완료하고 제출한 후, CDSS에서 진단 평가와 하나 이상의 치료 계획 옵션을 생성하여, 이를 사용자 인 터페이스를 통해 치과의사에게 표시한다. 아래 표 3은 치아 #46 및 결손 치아 26 및 47과 관련된 정보를 사용자 에게 제공하는 정보를 간략히 설명한다. 표 3 치아 46 진단 - 회복 불가능한 치수염을 동반한 광범위한 충치 치료 옵션 1 (a) 치아 46 - 치수 제거(pulp extirpation) (b) 치아 46 - 근관 치료(Root Canal Treatment) (c) 치아 46 - 루트 충전 완료 후 2-4주 후 검사 (d) 치아 46 - 온레이 복원(Onlay restoration)치료 옵션 2 (a) 치아 46 - 치수 제거 (b) 치아 46 - 근관 치료 (c) 치아 46 - 루트 충전 완료 후 2-4주 후 검사 (d) 치아 46 - 크라운 복원치료 옵션 3 (a) 치아 46 - 발치코멘트: 치수가 치유할 수 없을 정도로 염증이 생겼을 때(비가역적 치수 염) 또는 치수 조직이 죽었을 때 (괴사) 또는 독소가 뿌리 끝 너 머 골 조직에 도달하여 염증과 뼈 파괴를 일으킬 때(치근치주염)에는 감염 조직을 깨끗이 제거하고 루트 충전으로 봉하기 위해 근관 치료가 필요하 다. 충치로 인해 크라운의 치아 조직이 손실되어 첨단(cusp/s)이 약해졌을 때, 기능을 저하시키는 골절(fracture)로부터 첨단을 보 호하기 위해 보철(only)/복원 (restoration)이 필요하다.코멘트: 치수가 치유할 수 없을 정도로 염 증이 생겼을 때(비가역적 치수염) 또는 치수 조직이 죽었을 때(괴사) 또는 독소가 뿌리 끝 너머 골 조직 에 도달하여 염증과 뼈 파괴를 일 으킬 때(치근치주염)에는 감염 조 직을 시스템에서 깨끗이 제거하고 루트 충전으로 봉하기 위해 근관 치료가 필요하다. 충치로 인해 크 라운의 치아 조직이 광범위하게 손 실된 경우 크라운 복원을 통해 모 양, 크기 및 기능을 회복해야 한다.코멘트: 발치된 치아의 교체를 고려할 수 있다. 계획:치아 46 - 치수 제거 치아 46 - 근관 치료 치아 46 - 루트 충전 완료 후 2- 4주 후 검사 치아 46 - 온레이 복원계획: 치아 46 - 치수 제거 치아 46 - 근관 치료 치아 46 - 루트 충전 완료 후 2- 4주 후 검사 치아 46 - 크라운 복원계획: 치아 46 - 발치 결손된 치아 그룹 26 ·임플란트 지지 단일 크라운 ·고정-고정 브릿지 ·치아 교정 공간 봉합(closure)을 위해 교정 전문의에게 의뢰 ·탈착식 부분 의치 결손된 치아 그룹 47 ·임플란트 지지 단일 크라운 ·탈착식 부분 의치 치과의사가 각 치아에 대한 치료 계획 옵션을 선택하고 치과 문제를 식별한 후, CDSS는 모든 치아에 대한 식별 된 문제를 고려하여 전체적인 치료 계획과 단계 순서를 위한 치료 단계 시퀀스가 있는 최종 치료 단계를 생성한 다. 치료 단계는 아래 표 4에 표시된 바와 같이, 긴급 단계, 컨트롤 단계, 재평가 단계, 최종 단계 및 유지 단 계로 나뉜다. 표 4 환자 정보 이름: 나이: >20 긴급 단계 치아 46 - 치수 제거(Pulp extirpation) 컨트롤 단계 스케일링 및 폴리싱 구강 위생 지침 - 불화 성분의 치약으로 하루 두 번 양치 (>1,450 ppm) 식이 상담 불화 바니시 적용 치아 46 - 근관 치료 재평가 단계 치아 46 - 루트 충전 완료 후 2-4주 후 검사최종 단계 치아 46 - 온레이 복원(Onlay Restoration) 결손 치아 26의 대체 (a) 임플란트 지지 단일 크라운 결손 치아 47의 대체 (a) 임플란트 지지 단일 크라운 유지 단계 환자 6개월마다 재검진 본 발명의 사용 및 작동 방식에 대한 추가 논의에 관해서는 상기 설명에서 명백해야 한다. 따라서 사용 및 작동 방식과 관련된 추가 논의는 제공되지 않는다. 따라서 상기 설명과 관련하여, 크기, 재료, 모양, 형태, 기능 및 작동, 조립 및 사용 방식의 변화를 포함하는 발명의 부품에 대한 최적의 치수 관계는 당해 기술 분야의 숙련자에게 쉽게 명확하고 명백하다고 여겨지며, 도 면에 도시되고 명세서에 설명된 것과 동일한 모든 관계는 본 발명에 포함되는 것으로 의도된다. 따라서, 상기 내용은 본 발명의 원리를 예시한 것으로만 간주된다. 또한, 당업자라면 수많은 수정 및 변경이 쉽 게 발생할 수 있으므로, 본 발명을 표시 및 설명된 정확한 구성 및 작동에 제한하는 것은 바람직하지 않으며, 따라서 본 발명의 범위 내에 속하는 모든 적절한 수정 및 등가물을 사용할 수 있다. 상기에서는 본 발명의 원리, 실시예 및 작동 방식을 설명한다. 그러나 본 발명은 논의된 특정 실시예에 한정되 는 것으로 해석되어서는 안 된다. 상기에서 설명된 실시예는 제한적인 것이 아니라 예시적인 것으로 간주되어야 하며, 해당 분야의 숙련된 작업자가 다음 청구항에 정의된 본 발명의 범위를 벗어나지 않고 해당 실시예에서 변 형을 가할 수 있음을 이해해야 한다. 본 발명은 여기에서 광범위하고 일반적으로 설명되었다. 일반적인 공개 범위 내에 포함되는 각각의 더 좁은 종 과 하위 일반적 그룹도 본 발명의 일부를 형성한다. 여기에는 조건 또는 부정적 제한이 있는 본 발명의 일반 설 명도 포함된다. 다른 실시예는 다음 청구항 및 비제한적 예에 포함된다. 또한, 발명의 특징 또는 측면이 마쿠시(Markush) 그룹 의 관점에서 설명되는 경우, 해당 기술 분야의 숙련자는 발명이 또한 마쿠시 그룹의 개별 구성원 또는 구성원의 하위 그룹의 관점에서 설명된다는 것을 인식할 것이다."}
{"patent_id": "10-2024-7021823", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 다양한 다른 목적, 특징 및 수반되는 이점은 첨부된 도면을 참조하면 보다 잘 이해될 수 있으므로 충 분히 인식될 것이다. 첨부된 도면에서 동일한 참조 부호가 여러 도면에 걸쳐 동일하거나 유사한 부분을 나타낸 다. 여기서: 도 1은 본 발명에 개시된 시스템 및 방법의 다양한 컴퓨터 하드웨어의 일 실시예를 도시한 도면이다. 도 2는 본 발명에 개시된 제2 서버에서 사용되는 모듈들의 구조 및 이들의 상호 동작 관계와 컴퓨터 시스템에 대한 일 실시예를 도시한 도면이다. 도 3은 환자의 치료 계획을 생성하기 위해 본 발명에 개시된 방법에 포함된 일반적인 단계 및 프로세스를 나타 내는 대표적인 워크플로우이다. 도 4는 치과 진료 차트, 치과 설문지, 치료 계획 옵션에 관한 사용자의 입력과 컴퓨팅 하드웨어, 소프트웨어 구 성 요소 간의 시스템 및 운용 관계를 나타내는 대표적인 흐름도이다. 도 5는 본 발명에 개시된 딥러닝 CNN을 트레이닝하는 데 사용되는 모듈들의 구조와 이들모듈들 간의 운용 관계 및 컴퓨터 시스템의 하드웨어를 도시한 일 실시예를 나타낸 도면이다. 도 6a는 본 발명에 개시된 CDSS 및 제1 서버의 일 실시예 및 이들의 동작 관계를 예시하는 도면이고; 도 6b는 컴퓨팅 하드웨어, 소프트웨어 구성요소와 사용자로부터의 입력 사이의 CDSS 운용 관계와 이들이 CDSS와 상호작 용하는 방법을 설명하는 대표적인 흐름도이다. 도 7a-f는 출력 유닛을 통해 사용자에게 제공된 대시보드의 대표적인 스크린샷으로, 설문지 및 최종 치료 계획 의 예시적인 프레젠테이션을 나타낸다. 도 8은 본 발명에 개시된 방법 및 시스템에 입력되는 엑스레이 이미지의 예시이다. 도 9는 본 발명에 개시된 방법 및 시스템에서 입력되는 치과 진료 차트의 예시이다."}
