{"patent_id": "10-2020-7027498", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0124719", "출원번호": "10-2020-7027498", "발명의 명칭": "NR에서 전력 절감 신호 설계를 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "린 충지에"}}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전력 절감을 위한 사용자 장비(UE)에 있어서,송수신기로서,서빙 셀로부터, 구성들의 세트를 수신하고; 또한상기 서빙 셀로부터, 수신된 상기 구성들의 세트에 기초하여 제 1 다운링크 채널을 통해 전력 절감 신호(powersaving signal, PoSS)를 수신하도록 구성되는, 상기 송수신기; 및상기 송수신기에 동작 가능하게 연결된 프로세서로서, 상기 PoSS로부터 전력 절감을 위한 정보의 제 1 부분을획득하도록 구성되는, 상기 프로세서를 포함하며,상기 송수신기는 수신된 상기 구성들의 세트에 기초하여, 제어 채널인 제 2 다운링크 채널을 수신하도록 더 구성되고,상기 프로세서는 수신된 상기 제 2 다운링크 채널로부터 상기 전력 절감을 위한 정보의 제 2 부분을 획득하도록더 구성되는, 사용자 장비(UE)."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 프로세서는,상기 전력 절감을 위한 정보의 상기 제 2 부분을 수신할지 또는 상기 전력 절감을 위한 정보의 상기 제 2 부분의 크기를 수신할지 여부를 결정하고; 또한상기 결정의 결과를 상기 서빙 셀로부터의 상기 구성들의 세트의 일부로서 구성하도록 더 구성되며, 또한상기 전력 절감을 위한 정보의 상기 제 2 부분의 상기 크기는 0 이상으로 구성되는, 사용자 장비(UE)."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 프로세서는 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여 다음 하나 이상의 불연속 수신(DRX) 사이클들에 대한 파라미터들을 결정하고, 슬립 기간의 듀레이션 동안 PDCCH 모니터링을스킵하도록 더 구성되며, 상기 파라미터들은 상기 다음 하나 이상의 DRX 사이클들의 활성 기간 내의PDCCH(Physical Downlink Control Channel) 모니터링을 위한 시작 타이밍의 표시 또는 상기 다음 하나 이상의DRX 사이클들의 활성 기간의 듀레이션 중 적어도 하나를 포함하며, 또한상기 슬립 기간의 상기 듀레이션은 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분 중 적어도 하나에 기초하거나, 또는 상기 PoSS를 수신하는 타이밍부으로부터 다음 DRX 사이클의 활성 기간의 시작 시간까지의 듀레이션에 기초하여 결정되는, 사용자 장비(UE)."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 프로세서는 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여 채널 점유 시간(channel occupancy time, COT)에 대한 파라미터들을 결정하고, 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여 상기 구성들의 세트의 적어도 하나의 구성을 업데이트하도록 더 구성되며,상기 파라미터들은 상기 COT의 듀레이션 또는 상기 COT 내의 다운링크-업링크 구성 중 적어도 하나를 포함하고,공개특허 10-2020-0124719-3-상기 구성들의 세트의 상기 적어도 하나의 구성은 PDCCH 모니터링 주기 또는 모니터링되는 것으로 구성된 PDCCH모니터링 후보들의 서브세트 중 적어도 하나를 포함하며; 또한상기 구성된 PDCCH 모니터링 후보들의 서브세트는 제어 채널 요소(control channel element, CCE) 집계 레벨(aggregation level, AL)들, 제어 리소스 세트(control resource set, CORESET), 탐색 공간 세트, 다운링크 제어 인디케이터(downlink control indicator, DCI) 포맷 길이들, 또는 다운링크 제어 정보(downlink controlinformation, DCI) 포맷들 중 적어도 하나에 따라 결정되는, 사용자 장비(UE)."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 프로세서는 수신된 상기 PoSS에 기초하여, 기준 신호 수신 전력(reference signal receive power, RSRP),기준 신호 수신 품질(reference signal receive quality, RSRQ) 또는 신호 대 간섭 플러스 노이즈 비율(signal-to-interference-plus-noise ratio, SINR) 중 적어도 하나를 측정하도록 더 구성되고;상기 송수신기는 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여,PUSCH(physical layer uplink shared channel)을 통해 채널 상태 정보(channel state information, CSI)를 상기 서빙 셀에 보고하도록 더 구성되며, 또한상기 PoSS는 DMRS(demodulation reference signal) 또는 CSI-RS(channel state information referencesignal) 중 적어도 하나인, 사용자 장비(UE)."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "전력 절감을 위한 서빙 셀에 있어서,송수신기로서,사용자 장비(UE)로, 구성들의 세트를 송신하고; 또한상기 UE로, 송신된 상기 구성들의 세트에 기초하여 제 1 다운링크 채널을 통해 전력 절감 신호(PoSS)를 송신하고 - 전력 절감을 위한 정보의 제 1 부분은 상기 UE에 의해서 상기 PoSS로부터 획득됨; 또한송신된 상기 구성들의 세트에 기초하여, 제어 채널인 제 2 다운링크 채널을 송신하도록 - 상기 전력 절감을 위한 정보의 제 2 부분은 송신된 상기 제 2 다운링크 채널로부터 상기 UE에 의해 획득됨 - 구성되는 상기 송수신기를 포함하는, 서빙 셀."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 송수신기에 동작 가능하게 연결된 프로세서로서, 전력 절감을 위한 전력 절감을 위한 정보의 상기 제 2 부분을 송신할지 또는 전력 절감을 위한 전력 절감을 위한 정보의 상기 제 2 부분의 크기를 송신할지 여부를 결정하도록 구성된, 상기 프로세서를 더 포함하며,상기 전력 절감을 위한 정보의 상기 제 2 부분의 크기는 0 이상으로 구성되는, 서빙 셀."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,다음 하나 이상의 불연속 수신(DRX) 사이클에 대한 제 1 파라미터들이 상기 전력 절감을 위한 정보의 상기 제 1부분 또는 상기 제 2 부분에 기초하여 결정되고;상기 제 1 파라미터들은 상기 다음 하나 이상의 DRX 사이클들의 활성 기간 내의 PDCCH(Physical DownlinkControl Channel) 모니터링을 위한 시작 타이밍의 표시 또는 상기 다음 하나 이상의 DRX 사이클들의 활성 기간의 듀레이션 중 적어도 하나를 포함하고;PDCCH 모니터링은 슬립 기간의 듀레이션 동안 스킵되고;공개특허 10-2020-0124719-4-상기 슬립 기간의 상기 듀레이션은 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분 중 적어도 하나에 기초하거나, 또는 상기 PoSS를 수신하는 타이밍부으로부터 다음 DRX 사이클의 활성 기간의 시작 시간까지의 듀레이션에 기초하여 결정되고;채널 점유 시간(COT)에 대한 제 2 파라미터들이 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2부분에 기초하여 결정되고;상기 제 2 파라미터들은 상기 COT의 듀레이션 또는 상기 COT 내의 다운링크-업링크 구성 중 적어도 하나를 포함하고;상기 구성들의 세트의 적어도 하나의 구성은 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여 결정되고;상기 구성들의 세트의 상기 적어도 하나의 구성은 PDCCH 모니터링 주기 또는 모니터링되는 것으로 구성된 PDCCH모니터링 후보들의 서브세트 중 적어도 하나를 포함하며; 또한상기 구성된 PDCCH 모니터링 후보들의 서브세트는 제어 채널 요소(control channel element, CCE) 집계 레벨(aggregation level, AL)들, 제어 리소스 세트(control resource set, CORESET), 탐색 공간 세트, 다운링크 제어 인디케이터(downlink control indicator, DCI) 포맷 길이들, 또는 다운링크 제어 정보(downlink controlinformation, DCI) 포맷들 중 적어도 하나에 따라 결정되는, 서빙 셀."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서,상기 송수신기는 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여,PUSCH(physical layer uplink shared channel)을 통해 채널 상태 정보(CSI)를 상기 UE로부터 수신하도록 더 구성되고, 또한상기 PoSS는 DMRS(Demodulation Reference Signal) 또는 CSI-RS(Channel State Information ReferenceSignal) 중 적어도 하나인, 서빙 셀."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전력 절감을 위한 사용자 장비(UE)의 방법에 있어서,서빙 셀로부터, 구성들의 세트를 수신하는 단계; 및상기 서빙 셀로부터, 수신된 상기 구성들의 세트에 기초하여 제 1 다운링크 채널로부터 전력 절감 신호(PoSS)를수신하는 단계;상기 PoSS로부터 전력 절감을 위한 정보의 상기 제 1 부분을 획득하는 단계;수신된 상기 구성들의 세트에 기초하여, 제어 채널인 제 2 다운링크 채널을 수신하는 단계; 및수신된 상기 제 2 다운링크 채널로부터 상기 전력 절감을 위한 정보의 상기 제 2 부분을 획득하는 단계를 포함하는, 방법."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 전력 절감을 위한 정보의 상기 제 2 부분을 수신할지 또는 상기 전력 절감을 위한 정보의 상기 제 2 부분의 크기를 수신할지 여부를 결정하는 단계; 및상기 결정의 결과를 상기 서빙 셀로부터의 상기 구성들의 세트의 일부로서 구성하는 단계 - 상기 전력 절감을위한 정보의 상기 제 2 부분의 크기는 0 이상으로 구성됨 - 를 더 포함하는, 방법."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2020-0124719-5-제 10 항에 있어서, 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여 다음 하나 이상의 불연속 수신(DRX) 사이클들에 대한 파라미터들을 결정하는 단계 - 상기 파라미터들은 상기 다음 하나 이상의 DRX 사이클들의 활성 기간 내의 PDCCH(Physical Downlink Control Channel) 모니터링을 위한 시작 타이밍의 표시 또는 상기다음 하나 이상의 DRX 사이클들의 활성 기간의 듀레이션 중 적어도 하나를 포함함 - 를 더 포함하는, 방법."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 10 항에 있어서, 슬립 기간의 듀레이션 동안 PDCCH 모니터링을 스킵하는 단계 - 상기 슬립 기간의 상기 듀레이션은 상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분 중 적어도 하나에 기초하거나, 또는 상기 PoSS를 수신하는 타이밍부으로부터 다음 DRX 사이클의 활성 기간의 시작 시간까지의 듀레이션에 기초하여 결정됨 - 를 더 포함하는, 방법."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 10 항에 있어서,상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여 채널 점유 시간(COT)에 대한 파라미터들을 결정하는 단계, 및상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여 상기 구성들의 세트의 적어도하나의 구성을 업데이트하는 단계를 더 포함하며,상기 파라미터들은 상기 COT의 듀레이션 또는 상기 COT 내의 다운링크-업링크 구성 중 적어도 하나를 포함하고,상기 구성들의 세트의 상기 적어도 하나의 구성은 PDCCH 모니터링 주기 또는 모니터링되는 것으로 구성된 PDCCH모니터링 후보들의 서브세트 중 적어도 하나를 포함하며; 또한상기 구성된 PDCCH 모니터링 후보들의 서브세트는 제어 채널 요소(CCE) 집계 레벨(AL)들, 제어 리소스 세트(CORESET), 탐색 공간 세트, 다운링크 제어 인디케이터(DCI) 포맷 길이들, 또는 다운링크 제어 정보(DCI) 포맷들 중 적어도 하나에 따라 결정되는, 방법."}
{"patent_id": "10-2020-7027498", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 10 항에 있어서,수신된 상기 PoSS에 기초하여, 기준 신호 수신 전력(RSRP), 기준 신호 수신 품질(RSRQ) 또는 신호 대 간섭 플러스 노이즈 비율(SINR) 중 적어도 하나를 측정하는 단계; 및상기 전력 절감을 위한 정보의 상기 제 1 부분 또는 상기 제 2 부분에 기초하여, PUSCH(physical layer uplinkshared channel)을 통해 채널 상태 정보(CSI)를 상기 서빙 셀에 보고하는 단계를 더 포함하며,상기 PoSS는 DMRS(demodulation reference signal) 또는 CSI-RS(channel state information referencesignal) 중 적어도 하나인, 방법."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 4G 시스템 이후 보다 높은 데이터 전송률을 지원하기 위한 5G 통신 시스템을 IoT 기술과 융합하는 통 신 기법 및 그 시스템에 관한 것이다. 본 개시는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스 (예 를 들어, 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 헬스 케어, 디지털 교육, 소매업, 보안 및 안전 관련 서비스 등)에 적용될 수 있다. 전력 절감을 위한 사용자 장비(UE)의 방법이 제공된다. 이 방 법은 서빙 셀로부터 구성들의 세트를 수신하는 단계, 수신된 구성들의 세트에 기초하여 제 1 다운링크 채널로부 터 전력 절감 신호(PoSS)를 수신하는 단계, PoSS로부터 전력 절감을 위한 정보의 제 1 부분을 획득하는 단계, 수 신된 구성들의 세트에 기초하여, 제어 채널인 제 2 다운링크 채널을 수신하는 단계, 및 수신된 제 2 다운링크 채 널로부터 전력 절감을 위한 정보의 제 2 부분을 획득하는 단계를 포함한다."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 전력 절감 동작에 관한 것이다. 구체적으로, 본 개시는 진보된 무선 통신 시스템에서 전 력 절감 신호 설계에 관한 것이다."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시 스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 4G 네트워크 이후 (Beyond 4G Network) 통신 시스템 또는 LTE 시스템 이후 (Post LTE) 시스템이라 불리어지고 있다. 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파(mmWave) 대역(예를 들어, 60기가(60GHz) 대역과 같은)에서의 구현이 고려되고 있다. 초고주파 대역에서의 전파의 경로손실 완화 및 전파의 전달 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(beamforming), 거대 배열 다중 입 출력(massive MIMO), 전차원 다중입출력(Full Dimensional MIMO: FD-MIMO), 어레이 안테나(array antenna), 아 날로그 빔형성(analog beam-forming), 및 대규모 안테나 (large scale antenna) 기술들이 논의되고 있다. 또한 시스템의 네트워크 개선을 위해, 5G 통신 시스템에서는 진화된 소형 셀, 개선된 소형 셀 (advanced small cell), 클라우드 무선 액세스 네트워크 (cloud radio access network: cloud RAN), 초고밀도 네트워크 (ultra- dense network), 기기 간 통신 (Device to Device communication: D2D), 무선 백홀 (wireless backhaul), 이동 네트워크 (moving network), 협력 통신 (cooperative communication), CoMP (Coordinated Multi-Points), 및 수신 간섭제거 (interference cancellation) 등의 기술 개발이 이루어지고 있다. 이 밖에도, 5G 시스템에서는 진보된 코딩 변조(Advanced Coding Modulation: ACM) 방식인 FQAM (Hybrid FSK and QAM Modulation) 및 SWSC (Sliding Window Superposition Coding)과, 진보된 접속 기술인 FBMC(Filter Bank Multi Carrier), NOMA(non orthogonal multiple access), 및SCMA(sparse code multiple access) 등이 개발되고 있다. 한편, 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 IoT(Internet of Things, 사물인터넷) 망으로 진화하고 있다. 클라우드 서버 등과 의 연결을 통한 빅데이터(Big data) 처리 기술 등이 IoT 기술에 결합된 IoE (Internet of Everything) 기술도 대두되고 있다. IoT를 구현하기 위해서, 센싱 기술, 유무선 통신 및 네트워크 인프라, 서비스 인터페이스 기술, 및 보안 기술과 같은 기술 요소 들이 요구되어, 최근에는 사물간의 연결을 위한 센서 네트워크(sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 연구되고 있다. IoT 환경에서는 연결된 사물들에서 생성된 데이터를 수집, 분석하여 인간의 삶에 새로운 가치를 창출하는 지능 형 IT(Internet Technology) 서비스가 제공될 수 있다. IoT는 기존의 IT(information technology)기술과 다양 한 산업 간의 융합 및 복합을 통하여 스마트홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마 트 그리드, 헬스 케어, 스마트 가전, 첨단의료서비스 등의 분야에 응용될 수 있다. 이에, 5G 통신 시스템을 IoT 망에 적용하기 위한 다양한 시도들이 이루어지고 있다. 예를 들어, 센서 네트워크 (sensor network), 사물 통신(Machine to Machine, M2M), MTC(Machine Type Communication)등의 기술이 5G 통 신 기술인 빔 포밍, MIMO, 및 어레이 안테나 등의 기법에 의해 구현되고 있는 것이다. 앞서 설명한 빅데이터 처 리 기술로써 클라우드 무선 액세스 네트워크(cloud RAN)가 적용되는 것도 5G 기술과 IoT 기술 융합의 일 예라고 할 수 있을 것이다."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "무선 통신 네트워크에서, 네트워크 액세스 및 무선 리소스 관리(radio resource management, RRM)는 물리적 계 층 동기화 신호(physical layer synchronization signal) 및 상위(MAC) 계층 절차에 의해 가능해진다. 특히, 사용자 장비(user equipment, UE)는 초기 액세스를 위해 적어도 하나의 셀 아이덴티피케이션(identification, ID)과 함께 동기화 신호의 존재를 검출하려고 시도한다. UE가 네트워크에 있고, 서빙 셀과 연관되면, UE는 동 기화 신호를 검출하려고 시도하고/하거나 연관된 셀 특정 기준 신호(reference signal, RS)를 측정함으로써 다 수의 인접한 셀을 모니터링한다. 3GPP-NR(third generation partnership-new radio access or interface)과 같은 차세대 셀룰러 시스템의 경우, eMBB(enhanced mobile broadband), URLLC(ultra reliable low latency), mMTC(massive machine type communication)와 같은 다양한 유스 케이스에 대해 작동하는 효율적이고 통합된 무 선 리소스 획득 또는 추적 메커니즘은 각각 상이한 커버리지 요구 사항과 상이한 전파 손실을 갖는 주파수 대역 에 상응하는 것이 바람직하다."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에서, 전력 절감을 위한 사용자 장비(UE)가 제공된다. 이 UE는 서빙 셀로부터 구성들의 세트를 수신 하고 수신된 구성들의 세트에 기초하여 제 1 다운링크 채널을 통해 전력 절감 신호(power saving signal, PoS S)를 수신하도록 구성된 송수신기를 포함한다. UE는 송수신기에 동작 가능하게 연결된 프로세서를 더 포함하고, 프로세서는 PoSS로부터 전력 절감을 위한 정보의 제 1 부분을 획득하도록 구성된다. UE는 수신된 구 성들의 세트에 기초하여 제어 채널인 제 2 다운링크 채널을 수신하도록 구성된 송수신기를 더 포함한다. UE는 수신된 제 2 다운링크 채널로부터 전력 절감을 위한 정보의 제 2 부분을 획득하도록 구성된 프로세서를 더 포함한다. 다른 실시예에서, 전력 절감을 위한 서빙 셀(예를 들어, 서빙 BS)이 제공된다. 이 서빙 셀은 사용자 장비(UE) 에 구성들의 세트를 송신하고, 송신된 구성들의 세트에 기초하여 제 1 다운링크 채널을 통해 전력 절감 신호 (PoSS)를 UE에 송신하고 - 여기서 전력 절감을 위한 정보의 제 1 부분은 UE에 의해 PoSS로부터 획득됨 -, 송신 된 구성들의 세트에 기초하여 제어 채널인 제 2 다운링크 채널을 송신하도록 - 여기서 전력 절감을 위한 정보의 제 2 부분은 송신된 제 2 다운링크 채널로부터 UE에 의해 획득됨 - 구성되는 송수신기를 포함한다. 또 다른 실시예에서, 전력 절감을 위한 사용자 장비(UE)의 방법이 제공된다. 이 방법은 서빙 셀로부터 구성들 의 세트를 수신하는 단계, 수신된 구성들의 세트에 기초하여 제 1 다운링크 채널로부터 전력 절감 신호(PoSS)를 수신하는 단계, PoSS로부터 전력 절감을 위한 정보의 제 1 부분을 획득하는 단계, 수신된 구성들의 세트에 기초 하여, 제어 채널인 제 2 다운링크 채널을 수신하는 단계, 및 수신된 제 2 다운링크 채널로부터 전력 절감을 위 한 정보의 제 2 부분을 획득하는 단계를 포함한다. 다른 기술적 특징들은 다음의 도면, 설명 및 청구 범위로부터 당업자에게 쉽게 명백해질 수 있다. 아래의 상세한 설명에 들어가기 전에, 본 특허 명세서 전체에 걸쳐 사용되는 특정 단어 및 어구들의 정의를 기 재하는 것이 도움이 될 수 있다. 용어 \"커플(couple)\" 및 그 파생어는 두 개 이상의 요소 사이의 어떤 직접 또 는 간접 통신을 나타내거나, 이들 요소가 서로 물리적으로 접촉하고 있는지의 여부를 나타낸다. 용어 \"송신 (transmit)\", \"수신(receive)\" 및 \"통신(communicate)\" 그리고 그 파생어는 직접 통신 및 간접 통신 모두를 포 함한다. 용어 \"포함한다(include)\" 및 \"구성한다(comprise)\" 그리고 그 파생어는 제한이 아닌 포함을 의미한다. 용어 \"또는(or)\"은 포괄적 용어로써, '및/또는'을 의미한다. 어구 \"~와 관련되다(associated with)\" 및 그 파생어는 ~을 포함한다(include), ~에 포함된다(be included within), ~와 결합하다(interconnect with), ~을 함유하다(contain), ~에 함유되어 있다(be contained within), ~에 연결한다(connect to or with), ~와 결합하다(couple to or with), ~ 전달한다(be communicable with), 와 협력하다(cooperate with), ~를 끼 우다(interleave), ~을 나란히 놓다(juxtapose), ~에 인접하다(be proximate to), 구속하다/구속되다(be bound to or with), 소유하다(have), 속성을 가지다(have a property of), ~와 관계를 가지다(have a relationship to or with) 등을 의미한다. 용어 \"제어기(controller)\"는 적어도 하나의 동작을 제어하는 어떤 장치, 시스템 또는 그 일부를 의미한다. 이러한 제어기는 하드웨어 또는 하드웨어와 소프트웨어의 조합 및/또는 펌웨어로 구 현될 수 있다. 특정 제어기와 관련된 기능은 로컬 또는 원격으로 중앙 집중식으로 처리(centralized)되거나 또 는 분산식으로 처리(distributed)될 수 있다. 어구 \"적어도 하나\"는, 그것이 항목들의 나열과 함께 사용될 경 우, 나열된 항목들 중 하나 이상의 상이한 조합이 사용될 수 있음을 의미한다. 예를 들어, \"A, B, 및 C 중 적 어도 하나\"는 다음의 조합, 즉 A, B, C, A와 B, A와 C, B와 C, 그리고 A와 B와 C 중 어느 하나를 포함한다. 또한, 후술하는 각종 기능들은 컴퓨터 판독 가능한 프로그램 코드로 형성되고 컴퓨터 판독 가능한 매체에서 구 현되는 하나 이상의 컴퓨터 프로그램 각각에 의해 구현 또는 지원될 수 있다. 용어 \"애플리케이션\" 및 \"프로그 램\"은 하나 이상의 컴퓨터 프로그램, 소프트웨어 컴포넌트, 명령 세트, 프로시저, 함수, 객체, 클래스, 인스턴 스, 관련 데이터, 혹은 적합한 컴퓨터 판독 가능한 프로그램 코드에서의 구현용으로 구성된 그것의 일부를 지칭 한다. 어구 \"컴퓨터 판독 가능한 프로그램 코드\"는 소스 코드, 오브젝트 코드, 및 실행 가능한 코드를 포함하 는 컴퓨터 코드의 종류를 포함한다. 어구 \"컴퓨터 판독 가능한 매체\"는 ROM(read only memory), RAM(random access memory), 하드 디스크 드라이브, 컴팩트 디스크(CD), 디지털 비디오 디스크(DVD), 혹은 임의의 다른 타 입의 메모리와 같은, 컴퓨터에 의해 액세스될 수 있는 임의의 타입의 매체를 포함한다. \"비-일시적인\" 컴퓨터 판독 가능한 매체는 유선, 무선, 광학, 일시적인 전기적 또는 다른 신호들을 전달시키는 통신 링크를 제외한다. 비-일시적 컴퓨터 판독 가능한 매체는 데이터가 영구적으로 저장되는 매체 그리고 재기록이 가능한 광디스크 또 는 소거 가능한 메모리 장치와 같은, 데이터가 저장되어 나중에 덮어 씌어지는 매체를 포함한다. 다른 특정 단어 및 어구에 대한 정의가 이 특허 명세서 전반에 걸쳐 제공된다. 당업자는 대부분의 경우가 아니 더라도 다수의 경우에 있어서, 이러한 정의는 종래에 뿐만 아니라 그러한 정의된 단어 및 어구의 향후 사용에 적용될 수 있음을 이해해야 한다."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예들은 진보된 무선 통신 시스템에서 전력 절감 신호 설계를 위한 방법 및 장치를 제공한다."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에 설명되는 도 1 내지 36, 및 이 특허 명세서에 있어서의 본 개시의 원리들을 설명하기 위해 사용되는 각 종 실시예들은 오직 예시의 방법에 의한 것이며, 어떤 방식으로도 본 개시의 범위를 제한하는 것으로 해석되어 서는 아니 된다. 본 개시의 원리들은 임의의 적절하게 구성된 시스템 또는 장치에서 구현될 수 있다는 것을 당 업자는 이해할 수 있을 것이다. 다음의 문헌들 및 표준 설명들 즉, 3GPP TS 38.211 v15.4.0, \"NR; Physical channels and modulation;\" 3GPP TS 38.212 v15.4.0, \"NR; Multiplexing and channel coding;\" 3GPP TS 38.213 v15.4.0, \"NR; Physical layer procedures for control;\" 3GPP TS 38.214 v15.4.0, \"NR; Physical layer procedures for data;\" 3GPP TS 38.215 v15.4.0, \"NR; Physical layer measurements;\" 3GPP TS 38.321 v15.4.0, \"NR; Medium Access Control(MAC) protocol specification;\" 및 3GPP TS 38.331 v15.4.0, \"NR; Radio Resource Control(RRC) protocol specification.\"은 본 명세서에서 완전히 설명된 것처럼 참조로서 본 개시에 통합된다. 본 개시의 양태, 특징 및 이점은 본 개시를 수행하기 위해 고려되는 최상의 모드를 포함하는 다수의 특정 실시 예 및 구현을 단순히 예시함으로써 다음의 상세한 설명으로부터 쉽게 명백하다. 본 개시는 또한 다른 및 상이 한 실시예들이 가능하며, 그 몇몇 세부 사항은 본 개시의 사상 및 범위를 벗어나지 않고 다양한 명백한 관점에 서 수정될 수 있다. 따라서, 도면 및 설명은 제한적인 것이 아니라 본질적으로 예시적인 것으로 간주되어야한 다. 본 개시 내용이 첨부 도면에 제한이 아닌 예로서 도시되어 있다. 이하에서는 간결함을 위해 FDD와 TDD를 모두 DL 및 UL 시그널링에 대한 이중 방식으로서 간주한다. 다음의 예시적인 설명 및 실시예가 직교 주파수 분할 다중화(OFDM) 또는 직교 주파수 분할 다중 접속(OFDMA)을 가정하지만, 본 개시는 다른 OFDM 기반 전송 파형 또는 필터링된 OFDM(F-OFDM)과 같은 다중 접속 방식으로 확장 될 수 있다. 본 개시 내용은 함께 또는 서로 조합하여 사용될 수 있거나 독립한 방식으로 동작할 수 있는 여러 구성 요소를 포함한다. 4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시 스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 '비욘드(Beyond) 4G 네트워크' 또는 '포스트(Post) LTE 시스템'이라 불리어지고 있다. 더 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파(mmWave) 대역(예를 들어, 60GHz 대역)에서 의 구현이 고려되고 있다. 무선파의 전파 손실을 줄이고 송신 거리를 늘리기 위해, 5G 통신 시스템에서는 빔포 밍(beamforming), 거대 배열 다중 입출력(massive MIMO), 전차원 다중입출력(Full Dimensional MIMO, FD- MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍(analog beam forming), 및 대규모 안테나(large scale antenna) 기술들이 논의되고 있다. 또한, 시스템 네트워크 개선을 위해, 5G 통신 시스템에서는 개선된 소형 셀(advanced small cell), 클라우드 무 선 액세스 네트워크(cloud radio access network, cloud RAN), 초고밀도 네트워크(ultra-dense network), D2D(device-to-device) 통신, 무선 백홀(wireless backhaul), 이동 네트워크, 협력 통신, CoMP(CoordinatedMulti-Points) 송수신, 간섭 완화 및 제거 등의 기술 개발이 이루어지고 있다. 5G 시스템에서, AMC(adaptive modulation and coding) 기술로서 하이브리드 FQAM(frequency shift keying and quadrature amplitude modulation) 및 SWSC(sliding window superposition coding), 및 진보된 액세스 기술로 서 FBMC(filter bank multi carrier), NOMA(non-orthogonal multiple access) 및 SCMA(sparse code multiple access)가 개발되었다. 아래의 도 1 내지 도 4b에서는 무선 통신 시스템들에서 구현되고 또한 OFDM(orthogonal frequency division multiplexing) 또는 OFDMA(orthogonal frequency division multiple access) 통신 기술들을 사용하여 구현되는 다양한 실시예들을 설명한다. 도 1 내지 도 3의 설명은 상이한 실시예들이 구현될 수 있는 방식에 대한 물리적 또는 구조적 제한을 나타내는 것을 의미하지 않는다. 본 개시의 상이한 실시예들은 임의의 적절하게 구성된 통 신 시스템에서 구현될 수 있다. 도 1은 본 개시의 실시예들에 따른 예시적 무선 네트워크를 도시한 것이다. 도 1에 나타낸 무선 네트워크의 실 시예는 단지 설명을 위한 것이다. 무선 네트워크에 대한 다른 실시예들이 본 개시의 범위를 일탈하지 않 는 범위 내에서 사용될 수 있다. 도 1에 도시된 바와 같이, 무선 네트워크는 gNB, gNB, 및 gNB을 포함한다. gNB는 gNB 및 gNB과 통신한다. 또한, gNB는 적어도 하나의 네트워크, 예를 들어, 인터넷, 전용 IP(Internet Protocol) 네트워크, 또는 다른 데이터 네트워크와도 통신한다. gNB는 gNB의 커버리지 영역 내에 있는 제 1 복수의 사용자 장비(UE)들에게, 네트워크에의 무선 광대역 액세스를 제공한다. 제 1 복수의 UE들은 중소기업(SB)에 위치할 수 있는 UE; 대기업(E)에 위 치할 수 있는 UE; 와이파이 핫 스팟(HS)에 위치할 수 있는 UE; 제 1 주거지역(R)에 위치할 수 있는 UE; 제 2 주거지역(R)에 위치할 수 있는 UE; 및 휴대 전화, 무선 랩탑, 무선 PDA 등과 같은 모바일 장치(M)일 수 있는 UE를 포함한다. gNB은 gNB의 커버리지 영역 내에 있는 제 2 복수의 UE들에 게, 네트워크에의 무선 광대역 액세스를 제공한다. 제 2 복수의 UE들은 UE 및 UE를 포함한다. 몇몇 실시예들에서, gNB들(101-103) 중 하나 이상의 gNB들은 5G, LTE, LTE-A, WiMAX, WiFi 또는 다른 무선 통 신 기술들을 사용하여 서로 간에 및 UE들(111-116)과 통신할 수 있다. 네트워크 타입에 따라 \"기지국\" 또는 \"BS\"라는 용어는 네트워크에 무선 액세스를 제공하도록 구성된 컴포넌트 (또는 컴포넌트 집합), 예를 들면, 송신 포인트(TP), 송-수신 포인트(TRP), 향상된 기지국(eNodeB 또는 eNB), 5G 기지국(gNB), 매크로셀, 펨토셀, WiFi 액세스 포인트(AP) 또는 기타 무선 가능 장치를 지칭할 수 있다. 기 지국은 하나 이상의 무선 통신 프로토콜, 예컨대 5G 3GPP 새로운 무선 인터페이스/액세스(NR), LTE(long term evolution), LTE-A(LTE-advanced), HSPA(high speed packet access), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세스를 제공할 수 있다. 편의상, 용어 \"BS\" 및 \"TRP\"는 본 특허 명세서에서 원격 단말에 대한 무선 액세스를 제공하는 네트워크 인프라스트럭처를 나타내기 위해 상호 교환적으로 사용된다. 또한, 네트워크 타입에 따라, \"사용자 장비\" 또는 \"UE\"라는 용어는 \"이동국\", \"가입자국\", \"원격 단말\", \"무선 단말\", \"단말\", \"수신 포인트\" 또는 \"사용자 장치\"와 같은 임의의 컴포넌트를 지칭할 수 있다. 편의상, 용어들 \"사용자 장비\" 및 \"UE\"는, UE 가 이동 장치(예컨대, 휴대 전화기 또는 스마트 폰)이든 일반적으로 고려되는 고정 장치(예컨대, 데스크탑 컴퓨 터 또는 벤딩 머신)이든 간에, BS에 무선으로 액세스하는 원격 무선 장비를 지칭하는 것으로 본 특허 명세서에 서는 사용된다. 점선은, 단지 예시 및 설명의 목적으로 대략의 원형으로 나타낸 커버리지 영역들(120 및 125)의 대략적인 범위 들을 나타낸다. gNB들과 연관된 커버리지 영역들, 예를 들어 커버리지 영역들(120 및 125)은 gNB들의 구성, 및 자연 및 인공 장애물들과 관련된 무선 환경의 변화에 따라, 불규칙한 형태들을 포함하는 다른 형태들을 가질 수 있음을 명확하게 이해해야 한다. 아래에서 더 상세히 설명되는 바와 같이, UE들(111-116) 중 하나 이상은 진보된 무선 통신 시스템에서 효율적인 전력 절감 동작을 위한 회로, 프로그래밍 또는 이들의 조합을 포함한다. 특정 실시예EMF에서, gNB들(101-103) 중 하나 이상은 진보된 무선 통신 시스템에서 공간-주파수 압축에 기초한 CSI 획득을 위한 회로, 프로그래밍 또 는 이들의 조합을 포함한다. 도 1이 무선 네트워크의 일 예를 도시한 것이지만, 다양한 변화들이 도 1에 대하여 이루어질 수 있다. 예를 들 어, 무선 네트워크는 임의의 적절한 배열로 임의의 개수의 gNB들 및 임의의 개수의 UE들을 포함할 수 있다. 또 한, gNB는 임의의 개수의 UE들과 직접 통신하여, 이 UE들에게 네트워크로의 무선 광대역 액세스를제공할 수 있다. 이와 유사하게, 각 gNB(102-103)은 네트워크와 직접 통신하여, UE들에게 네트워크 로의 직접 무선 광대역 액세스를 제공할 수 있다. 또한, gNB들(101, 102, 및/또는 103)은 외부 전화 네트워크 들 또는 다른 타입의 데이터 네트워크들과 같은 다른 또는 추가의 외부 네트워크들에의 액세스를 제공할 수 있 다. 도 2는 본 개시의 실시예들에 따른, 예시적 gNB를 도시한 것이다. 도 2에 도시된 gNB의 실시예는 단 지 설명을 위한 것이며, 도 1의 gNB들(101 및 103)은 동일하거나 유사한 구성을 가질 수 있다. 그러나, gNB들 은 각종의 다양한 구성들로 이루어지며, 도 2는 gNB에 대한 임의의 특정 구현으로 본 개시의 범위를 제한하지 않는다. 도 2에 도시된 바와 같이, gNB는 복수의 안테나들(205a-205n), 복수의 RF 송수신기들(210a-210n), 송신 (TX) 처리 회로, 및 수신(RX) 처리 회로를 포함한다. 또한, gNB는 컨트롤러/프로세서, 메모리, 백홀 또는 네트워크 인터페이스를 포함한다. RF 송수신기들(210a-210n)은, 안테나들(205a-205n)으로부터, 네트워크 내에서 UE들에 의해 송신되는 신호 들과 같은 내향(incoming) RF 신호들을 수신한다. RF 송수신기들(210a-210n)은 내향 RF 신호들을 하향 변환 (down-convert)하여, IF 또는 기저대역 신호들을 생성한다. IF 또는 기저대역 신호들은, 기저대역 또는 IF 신 호들을 필터링하고, 디코딩하고, 및/또는 디지털화하는 것에 의하여 처리된 기저대역 신호들을 생성하는 RX 처 리 회로로 전송된다. RX 처리 회로는 이 처리된 기저대역 신호들을, 추가의 처리를 위하여 컨트롤러 /프로세서로 송신한다. TX 처리 회로는, 컨트롤러/프로세서로부터 아날로그 또는 디지털 데이터(예컨대, 음성 데이터, 웹 데 이터, 이-메일, 또는 쌍방향 비디오 게임 데이터)를 수신한다. TX 처리 회로는, 외향(outgoing) 기저대역 데이터를 인코딩, 다중화, 및/또는 디지털화하여, 처리된 기저대역 또는 IF 신호들을 생성한다. RF 송수신기들 (210a-210n)은 TX 처리 회로로부터, 외향 처리된 기저대역 또는 IF 신호들을 수신하고, 그 기저대역 또는 IF 신호들을, 안테나들(205a-205n)을 통해 송신되는 RF 신호들로 상향 변환한다. 컨트롤러/프로세서는 gNB의 전반적인 동작을 제어하는 하나 이상의 프로세서들 또는 다른 처리 장치 들을 포함할 수 있다. 예를 들어, 컨트롤러/프로세서는, 잘 알려진 원리들에 따라 RF 송수신기들(210a- 210n), RX 처리 회로, 및 TX 처리 회로에 의해 순방향 채널 신호들의 수신 및 역방향 채널 신호들의 송신을 제어할 수 있다. 컨트롤러/프로세서는 보다 진보된 무선 통신 기능들과 같은 추가 기능들도 지원 할 수 있다. 예를 들어, 컨트롤러/프로세서는 복수의 안테나들(205a-205n)로부터의 외향 신호들이 원하는 방향으로 효 과적으로 조종하기 위해 다르게 가중처리되는 빔포밍 또는 지향성 라우팅 동작들을 지원할 수 있다. 다양한 다 른 기능들 중 임의의 기능이 컨트롤러/프로세서에 의해 gNB에서 지원될 수 있다. 또한, 컨트롤러/프로세서는 메모리에 상주하는 프로그램들 및 다른 프로세스들, 예를 들어 OS를 실행 할 수 있다. 컨트롤러/프로세서는 실행 프로세스에 의한 요구에 따라 데이터를 메모리 내로 또는 외 부로 이동시킬 수 있다. 또한, 컨트롤러/프로세서는 백홀 또는 네트워크 인터페이스에 커플링된다. 백홀 또는 네트워크 인터 페이스는, gNB가 백홀 연결을 통해 또는 네트워크를 통해 다른 장치들 또는 시스템들과 통신하는 것 을 가능하게 한다. 인터페이스는 임의의 적절한 유선 또는 무선 연결(들)을 통한 통신들을 지원할 수 있 다. 예를 들어, gNB가 셀룰러 통신 시스템(예컨대, 5G, LTE, 또는 LTE-A를 지원하는 것)의 일부로서 구현 되는 경우, 인터페이스는, gNB가 유선 또는 무선 백홀 연결을 통해 다른 gNB들과 통신하는 것을 가능 하게 할 수 있다. gNB가 액세스 포인트로서 구현되는 경우, 인터페이스는, gNB가 유선 또는 무 선 로컬 영역 네트워크를 통해 또는 유선 또는 무선 연결을 통해 더 큰 네트워크(예컨대, 인터넷)로 전송하는 것을 가능하게 한다. 인터페이스는 유선 또는 무선 연결, 예를 들어 이더넷 또는 RF 송수신기를 통한 통 신들을 지원하는 임의의 적절한 구조를 포함한다. 메모리는 컨트롤러/프로세서에 커플링된다. 메모리의 일부는 RAM을 포함할 수 있으며, 메모리 의 다른 일부는 플래시 메모리 또는 다른 ROM을 포함할 수 있다. 도 2가 gNB의 일 예를 도시하고 있지만, 다양한 변화들이 도 2에 대하여 이루어질 수 있다. 예를 들어, gNB는 도 2에 나타낸 각 컴포넌트에 대한 임의의 개수를 포함할 수 있다. 일 특정 예로서, 액세스 포인트 는 다수의 인터페이스들을 포함할 수 있고, 컨트롤러/프로세서는 상이한 네트워크 주소들 사이에서데이터를 라우팅하는 라우팅 기능들을 지원할 수 있다. 다른 특정 예로서, 단일 인스턴스의 TX 처리 회로 및 단일 인스턴스의 RX 처리 회로를 포함하는 것으로 도시되어 있지만, gNB는 각각에 대한 복수의 인 스턴스들을 포함할 수 있다(예컨대, RF 송수신기당 하나). 또한, 도 2의 각종 컴포넌트들이 조합되거나, 더 세 분화되거나, 생략될 수 있으며, 특정 필요들에 따라 추가의 컴포넌트들이 부가될 수도 있다. 도 3은 본 개시의 실시예들에 따른, 예시적 UE를 도시한 것이다. 도 3에 도시된 UE의 실시예는 단지 설명을 위한 것이며, 도 1의 UE들(111-115)은 동일하거나 유사한 구성을 가질 수 있다. 그러나, UE들은 각종의 다양한 구성들로 이루어지며, 도 3은 UE에 대한 임의의 특정 구현으로 본 개시의 범위를 제한하지 않는다. 도 3에 도시된 바와 같이, UE는 안테나, 무선 주파수(radio frequency, RF) 송수신기, TX 처리 회로, 마이크로폰, 및 수신(RX) 처리 회로를 포함한다. 또한, UE는 스피커, 프로세 서, 입/출력(I/O) 인터페이스(IF), 터치스크린, 디스플레이, 및 메모리를 포함한다. 메모리는 운영 시스템(OS) 및 하나 이상의 애플리케이션들을 포함한다. RF 송수신기는 네트워크의 gNB에 의해 송신되는 내향 RF 신호를 안테나로부터 수신한다. RF 송 수신기는 내향 RF 신호를 하향-변환하여, 중간 주파수(intermediate frequency, IF) 또는 기저대역 신호 를 생성한다. IF 또는 기저대역 신호는, 그 기저대역 또는 IF 신호를 필터링하고, 디코딩하고, 및/또는 디지털 화하는 것에 의해 처리된 기저대역 신호를 생성하는 RX 처리 회로로 전송된다. RX 처리 회로는 그 처리된 기저대역 신호를, 스피커로 송신하거나(예컨대, 음성 데이터), 또는 추가 처리를 위해 프로세서 로 송신한다(예컨대, 웹 브라우징 데이터). TX 처리 회로는 마이크로폰으로부터 아날로그 또는 디지털 음성 데이터를 수신하거나 또는 프로세서 로부터 다른 외향 기저대역 데이터(예컨대, 웹 데이터, 이-메일, 또는 쌍방향 비디오 게임 데이터)를 수신 한다. TX 처리 회로는 그 외향 기저대역 데이터를 인코딩, 다중화, 및/또는 디지털화하여, 처리된 기저대 역 또는 IF 신호를 생성한다. RF 송수신기는 TX 처리 회로로부터 외향 처리된 기저대역 또는 IF 신 호를 수신하고, 그 기저대역 또는 IF 신호를, 안테나를 통해 송신되는 RF 신호로 상향 변환한다. 프로세서는 하나 이상의 프로세서들 또는 다른 처리 장치들을 포함할 수 있으며, 메모리에 저장된 OS를 실행함으로써 UE의 전반적인 동작을 제어할 수 있다. 예를 들어, 프로세서는 잘 알려진 원리들에 따라 RF 송수신기, RX 처리 회로, 및 TX 처리 회로에 의해 순방향 채널 신호들의 수신 및 역방향 채널 신호들을 송신을 제어할 수 있다. 몇몇 실시예들에서, 프로세서는 적어도 하나의 마이크 로프로세서 또는 마이크로컨트롤러를 포함한다. 프로세서는 또한 업링크 채널에서 CSI 보고를 위한 프로세스와 같이 메모리에 상주하는 다른 프로세 스 및 프로그램을 실행할 수 있다. 프로세서는 실행 프로세스에 의한 요구에 따라 메모리 내로 또는 외부로 데이터를 이동할 수 있다. 몇몇 실시예들에서, 프로세서는 OS에 기초하여 또는 gNB들 또는 오퍼레이터로부터 수신된 신호들에 따라 애플리케이션들을 실행하도록 구성된다. 또한, 프로세서는, 랩탑 컴퓨터 및 휴대용 컴퓨터와 같은 다른 장치들에 연결되는 능력을 UE에게 제공하는 I/O 인터페이스 에 커플링되어 있다. I/O 인터페이스는 이 주변기기들과 프로세서 간의 통신 경로이다. 또한, 프로세서는 터치스크린 및 디스플레이에 커플링된다. UE의 오퍼레이터는 터치스크 린을 사용하여 UE에 데이터를 입력할 수 있다. 디스플레이는 예를 들어, 웹 사이트들로부터의 텍스트 및/또는 적어도 제한된 그래픽들을 렌더링할 수 있는 액정 표시 장치, 발광 다이오드 디스플레이, 또는 다른 디스플레이일 수 있다. 메모리는 프로세서에 커플링된다. 메모리의 일부는 랜덤 액세스 메모리(random access memory, RAM)를 포함할 수 있으며, 메모리의 다른 일부는 플래시 메모리 또는 다른 판독 전용 메모리 (read-only memory, ROM)를 포함할 수 있다. 도 3이 UE의 일 예를 도시하고 있지만, 다양한 변화들이 도 3에 대하여 이루어질 수 있다. 예를 들어, 도 3의 각종 컴포넌트들은 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요들에 따라 추가 컴포넌트들 이 부가될 수도 있다. 일 특정 예로서, 프로세서는 복수의 프로세서들, 예를 들어 하나 이상의 중앙 처리 유닛(CPU)들 및 하나 이상의 그래픽 처리 유닛(GPU)들로 분할될 수 있다. 또한, 도 3이 모바일 전화기나 스마 트 폰과 같이 구성된 UE를 도시하고 있지만, UE들은 다른 타입의 모바일 또는 고정 장치들로서 동작하도록 구성될 수도 있다. 도 4a는 송신 경로 회로의 하이-레벨 다이어그램이다. 예를 들어, 송신 경로 회로는 OFDMA(orthogonal frequency division multiple access) 통신을 위해 사용될 수 있다. 도 4b는 수신 경로 회로의 하이-레벨 다 이어그램이다. 예를 들어, 수신 경로 회로는 OFDMA(orthogonal frequency division multiple access) 통신을 위해 사용될 수 있다. 도 4a 및 도 4b에서, 다운링크 통신의 경우, 송신 경로 회로는 기지국(gNB) 또는 중계국에서 구현될 수 있으며, 수신 경로 회로는 사용자 장비(예컨대, 도 1의 사용자 장비)에서 구현될 수 있다. 다른 예들에서, 업링크 통신의 경우, 수신 경로 회로는 기지국(예컨대, 도 1의 gNB) 또는 중 계국에서 구현될 수 있으며, 송신 경로 회로는 사용자 장비(예컨대, 도 1의 사용자 장비)에서 구현될 수 있다. 송신 경로 회로는 채널 코딩 및 변조 블록, 직렬-병렬(S-to-P) 블록, 사이즈 N 역 고속 푸리에 변환 (Inverse Fast Fourier Transform, IFFT) 블록, 병렬-직렬(P-to-S) 블록, 가산 사이클릭 프리픽스 블록, 및 업-컨버터(up-converter, UC) 430을 포함한다. 수신 경로 회로는 다운-컨버터(down- converter, DC), 제거 사이클릭 프리픽스 블록, 직렬-병렬(S-to-P) 블록, 사이즈 N 고속 푸리 에 변환(Fast Fourier Transform, FFT) 블록, 병렬-직렬(P-to-S) 블록, 및 채널 디코딩 및 복조 블 록을 포함한다. 도 4a 및 도 4b에서의 컴포넌트들 중 적어도 몇몇은 소프트웨어로 구현될 수 있는 한편, 다른 컴포넌 트들은 설정 가능한 하드웨어 또는 소프트웨어와 설정 가능한 하드웨어의 혼합에 의해 구현될 수도 있다. 특히, 본 개시의 명세서에서 설명되는 FFT 블록들 및 IFFT 블록들은 설정 가능한 소프트웨어 알고리즘들로서 구 현될 수 있으며, 여기서 사이즈 N의 값은 그 구현에 따라 변경될 수 있음에 유의한다. 또한, 본 개시가 고속 푸리에 변환 및 역 고속 푸리에 변환을 구현하는 실시예에 관한 것이지만, 이것은 단지 예시에 의한 것일 뿐이며, 본 개시의 범위를 한정하는 것으로 해석되어서는 아니 된다. 본 개시의 다른 실시예 들에서는, 고속 푸리에 변환 함수들 및 역 고속 푸리에 변환 함수들이 이산 푸리에 변환(DFT) 함수들 및 역 이 산 푸리에 변환(IDFT) 함수들로 각각 용이하게 대체될 수도 있음을 이해할 것이다. DFT 및 IDFT 함수들의 경우, 변수 N의 값은 임의의 정수(예컨대, 1, 2, 3, 4 등)가 될 수 있으며, FFT 및 IFFT 함수들의 경우, 변수 N 의 값은 2의 제곱(즉, 1, 2, 4, 8, 16 등)인 임의의 정수가 될 수 있음을 이해할 것이다. 송신 경로 회로에서, 채널 코딩 및 변조 블록은 정보 비트들의 세트를 수신하여, 코딩(예컨대, LDPC 코딩)을 적용하고, 그 입력 비트들을 변조(예컨대, QPSK(Quadrature Phase Shift Keying) 또는 QAM(Quadrature Amplitude Modulation))함으로써, 주파수-영역 변조 심볼들의 시퀀스를 생성한다. 직렬-병렬 블록은 직렬 변조된 심볼들을 병렬 데이터로 변환(즉, 역다중화)하여 N 병렬 심볼 스트림들을 생성하며, 여기서 N은 BS 102 및 UE에서 사용되는 IFFT/FFT 크기이다. 그 후에, 사이즈 N IFFT 블록은 N 병렬 심볼 스트림들 상에 서 IFFT 동작을 수행하여, 시간-영역 출력 신호들을 생성한다. 병렬-직렬 블록은 사이즈 N IFFT 블록 로부터의 병렬 시간-영역 출력 심볼들을 변환(즉, 다중화)하여, 직렬 시간-영역 신호를 생성한다. 그 후 에, 가산 사이클릭 프리픽스 블록는 시간-영역 신호에 사이클릭 프리픽스를 삽입한다. 마지막으로, 업-컨 버터는 무선 채널을 통한 송신을 위해 가산 사이클릭 프리픽스 블록의 출력을 RF 주파수로 변조(즉, 상향 변환)한다. 또한, 이 신호는 RF 주파수로 변환하기 이전에, 기저대역에서 필터링될 수도 있다. 송신된 RF 신호는 무선 채널을 통과한 이후에 UE에 도달하여, gNB에서의 동작들에 대한 역 동작들이 수행된다. 다운-컨버터는 수신된 신호를 기저대역 주파수로 하향 변환하며, 제거 사이클릭 프리픽스 블록 은 그 사이클릭 프리픽스를 제거하여, 직렬 시간-영역 기저대역 신호를 생성한다. 직렬-병렬 블록은 시간-영역 기저대역 신호를 병렬 시간-영역 신호들로 변환한다. 그 후에, 사이즈 N FFT 블록은 FFT 알고 리즘을 수행하여 N 병렬 주파수-영역 신호들을 생성한다. 병렬-직렬 블록은 병렬 주파수-영역 신호들을 변조된 데이터 심볼들의 시퀀스로 변환한다. 채널 디코딩 및 복조 블록은 그 변조된 심볼들에 대한 복조 를 행한 후에 디코딩함으로써, 원래의 입력 데이터 스트림을 복구한다. gNB들(101-103) 각각은 사용자 장비(111-116)로의 다운링크 송신과 유사한 송신 경로를 구현할 수 있으며, 사용 자 장비(111-116)로부터의 업링크 수신과 유사한 수신 경로를 구현할 수도 있다. 이와 유사하게, 사용자 장비 (111-116) 각각은 gNB들(101-103)로의 업링크 송신을 위한 아키텍처에 대응하는 송신 경로를 구현할 수 있으며, gNB들(101-103)로부터의 다운링크 수신을 위한 아키텍처에 대응하는 수신 경로를 구현할 수도 있다. 5G 통신 시스템 활용 사례가 확인되고 설명되어 왔다. 이러한 활용 사례들은 크게 세 가지 그룹으로 분류될 수 있다. 일 예로, eMBB(enhanced mobile broadband)는 보다 덜 엄격한 레이턴시(latency) 및 신뢰성 요구사항들 (less stringent latency and reliability requirements)로 높은 bits/sec 요구사항이 수행되도록 결정된다. 다른 예에 있어서, URLL(ultra-reliable and low latency)은 보다 덜 엄격한 bits/sec 요구사항으로 결정된다.또 다른 예에 있어서, mMTC(massive machine type communication)는 장치들의 개수가 km2 당 십만에서 백만에 달할 수 있지만 안정성/처리량/레이턴시 요구사항은 보다 덜 엄격 할 수 있도록 결정된다. 이러한 시나리오는 또한 배터리 소비가 가능한 최소화되어야 한다는 점에서 전력 효율 요구사항을 포함할 수도 있다. 통신 시스템은 기지국(BS) 또는 NodeB와 같은 송신 포인트로부터 사용자 장비(UE)로 신호를 반송하는 다운링크 (DL) 및 UE로부터 NodeB와 같은 수신 포인트로 신호를 반송하는 업링크(UL)를 포함한다. 또한 일반적으로 단말 기 또는 이동국으로서 지칭되는 UE는 고정식 또는 이동식일 수 있고, 셀룰러 폰, 개인용 컴퓨터 디바이스 또는 자동화된 디바이스일 수 있다. 일반적으로 고정국인 eNodeB는 또한 액세스 포인트 또는 다른 동등한 용어로서 지칭될 수 있다. LTE 시스템의 경우, NodeB는 종종 eNodeB로서 지칭된다. LTE 시스템과 같은 통신 시스템에서, DL 신호는 정보 컨텐츠를 반송하는 데이터 신호, DL 제어 정보(DL control information, DCI)를 반송하는 제어 신호, 및 파일럿 신호로서도 알려진 기준 신호(reference signal, RS)를 포함할 수 있다. eNodeB는 물리적 DL 공유 채널(physical DL shared channel, PDSCH)을 통해 데이터 정보를 송신한다. eNodeB는 물리적 DL 제어 채널(physical DL control channel, PDCCH) 또는 EPDCCH(Enhanced PDCC H)를 통해 DCI를 송신한다. eNodeB는 PHICH(physical hybrid ARQ indicator channel)에서 UE로부터의 데이터 전송 블록(transport block, TB) 송신에 응답하여 확인 응답 정보(acknowledgement information)를 송신한다. eNodeB는 UE-공통 RS(common RS, CRS), 채널 상태 정보 RS(CSI-RS) 또는 복조 RS(demodulation RS, DMRS)를 포함하는 다수의 RS 타입 중 하 나 이상을 송신한다. CRS는 DL 시스템 대역폭(BW)을 통해 송신되고, 데이터 또는 제어 정보를 복조하거나 측정 을 수행하기 위해 채널 추정치를 획득하기 위해 UE에 의해 사용될 수 있다. CRS 오버헤드를 줄이기 위해, eNodeB는 CRS보다 시간 및/또는 주파수 도메인에서 더 작은 밀도를 갖는 CSI-RS를 송신할 수 있다. DMRS는 각 각의 PDSCH 또는 EPDCCH의 BW에서만 송신될 수 있고, UE는 PDRSCH 또는 EPDCCH에서 각각 데이터 또는 제어 정보 를 복조하기 위해 DMRS를 사용할 수 있다. DL 채널에 대한 송신 시간 간격은 서브프레임으로서 지칭되고, 예를 들어 1 밀리초의 지속 시간을 가질 수 있다. DL 신호는 또한 시스템 제어 정보를 반송하는 논리 채널의 송신을 포함한다. BCCH는 BCCH가 MIB(master information block)를 반송할 때에는 브로드캐스트 채널(broadcast channel, BCH)로서 지칭되는 전송 채널에 매핑되거나 BCCH가 SIB(system information block)를 반송할 때에는 DL 공유 채널(DL-SCH)에 매핑된다. 대부 분의 시스템 정보는 DL-SCH를 사용하여 송신되는 상이한 SIB에 포함된다. 서브프레임에서의 DL-SCH 상의 시스 템 정보의 존재는 특별한 시스템 정보 RNTI(SI-RNTI)로 스크램블링된 CRC(cyclic redundancy check)를 갖는 코 드워드를 반송하는 상응하는 PDCCH의 송신에 의해 나타내어질 수 있다. 대안적으로, SIB 송신에 대한 스케줄링 정보는 이전의 SIB에 제공될 수 있고, 제 1 SIB(SIB-1)에 대한 스케줄링 정보는 MIB에 의해 제공될 수 있다. DL 리소스 할당은 서브프레임의 유닛 및 물리적 리소스 블록(physical resource block, PRB)의 그룹으로 수행된 다. 송신 BW는 리소스 블록(RB)으로서 지칭되는 주파수 리소스 유닛을 포함한다. 각각의 RB는 서브캐리어, 또 는 12개의 RE와 같은 리소스 요소(RE)를 포함한다. 하나의 서브프레임에 걸친 하나의 RB의 유닛은 PRB로서 지 칭된다. UE는 PDSCH 송신 BW에 대한 총 RE에 대한 RB를 할당받을 수 있다. UL 신호는 데이터 정보를 반송하는 데이터 신호, UL 제어 정보(UCI)를 반송하는 제어 신호 및 UL RS를 포함할 수 있다. UL RS는 DMRS 및 SRS(Sounding RS)를 포함한다. UE는 각각의 PUSCH 또는 PUCCH의 BW에서만 DMRS를 송신한다. eNodeB는 DMRS를 사용하여 데이터 신호 또는 UCI 신호를 복조할 수 있다. UE는 eNodeB에 UL CSI를 제공하도록 SRS를 송신한다. UE는 각각의 물리적 UL 공유 채널(PUSCH) 또는 물리적 UL 제어 채널(PUCCH)을 통 해 데이터 정보 또는 UCI를 송신한다. UE가 동일한 UL 서브프레임에서 데이터 정보 및 UCI를 송신할 필요가 있 을 경우, UE는 둘 다를 PUSCH로 다중화할 수 있다. UCI는 PDSCH에서 데이터 TB에 대한 올바른(correct)(ACK) 또는 올바르지 않은(incorrect)(NACK) 검출 또는 PDCCH 검출(DTX)의 부재를 나타내는 HARQ-ACK(Hybrid Automatic Repeat request acknowledgement) 정보, UE가 UE의 버퍼 내에 데이터를 갖는지를 나타내는 스케줄링 요청(scheduling request, SR), 랭크 인디케이터(rank indicator, RI), 및 eNodeB가 UE로의 PDSCH 송신을 위해 링크 적응을 수행할 수 있게 하는 채널 상태 정보(CSI)를 포함한다. HARQ-ACK 정보는 또한 반영속적으로 스케 줄링된 PDSCH의 해제를 나타내는 PDCCH/EPDCCH의 검출에 응답하여 UE에 의해 송신된다. UL 서브프레임은 2개의 슬롯을 포함한다. 각각의 슬롯은 데이터 정보, UCI, DMRS 또는 SRS를 송신하기 위한 심볼을 포함한다. UL 시스템 BW의 주파수 리소스 유닛은 RB이다. UE는 송신 BW에 대한 총 RE에 대한 RB를 할당받는다. PUCCH의 경우, 이다. 마지막 서브프레임 심볼은 하 나 이상의 UE로부터 SRS 송신을 다중화하는데 사용될 수 있다. 데이터/UCI/DMRS 송신에 이용 가능한 서브프레 임 심볼의 수는 이며, 여기서 마지막 서브프레임 심볼이 SRS를 송신하는데 사용된 다면, 이고, 그렇지 않으면, 이다. DL 시그널링 또는 UL 시그널링을 위한 단위는 하나의 심볼이다. 심볼은 14 개의 심볼과 같은 다수의 심볼을 포 함하는 슬롯에 속하며, DL 시그널링에 사용되는 경우 DL 심볼, UL 시그널링에 사용되는 경우 UL 심볼, DL 시그 널링 또는 UL 시그널링에 사용되는 경우 플렉시블 심볼이라고 한다. 대역폭(BW) 단위를 리소스 블록(RB)이라고 한다. 하나의 RB는 다수의 서브캐리어(SC)를 포함하고, 슬롯의 하나 의 심볼에 있는 하나의 SC를 리소스 요소(RE)라고 한다. 예를 들어, 슬롯은 1 밀리 초의 듀레이션을 가질 수 있고, RB가 15 KHz의 SC 간 간격을 가진 12 개의 SC를 포함할 때 RB는 180 KHz의 대역폭을 가질 수 있다. 예를 들어, 슬롯은 0.25 밀리 초의 듀레이션을 가질 수 있고, RB가 60 KHz의 SC 간 간격을 가진 12 개의 SC를 포함할 때 RB는 720 KHz의 대역폭을 가질 수 있다. DL 신호는 정보 컨텐츠를 전달하는 데이터 신호, DL 제어 정보(DCI)를 전달하는 제어 신호 및 파일럿 신호라고 도 알려진 기준 신호(RS)를 포함한다. gNB는 각각의 물리적 DL 공유 채널(PDSCH) 또는 물리적 DL 제어 채널 (PDCCH)을 통해 데이터 정보 또는 DCI를 송신한다. gNB는 채널 상태 정보 RS(CSI-RS) 및 복조 RS(DMRS)를 포 함하는 여러 유형의 RS 중 하나 이상을 송신한다. CSI-RS는 주로 UE가 측정을 수행하고 채널 상태 정보(CSI)를 gNB에 제공하기 위한 것이다. DMRS는 각 PDCCH 또 는 PDSCH 수신의 BW에서만 수신되며, UE는 일반적으로 DMRS를 사용하여 데이터 또는 제어 정보를 복조하다. UL 신호는 또한 정보 컨텐츠를 전달하는 데이터 신호, UL 제어 정보(UCI)를 전달하는 제어 신호, 데이터 또는 UCI 복조와 관련된 DMRS, gNB가 UL 채널 측정을 수행할 수 있게 하는 사운딩 RS(SRS), 및 UE가 랜덤 액세스를 수행할 수 있게 하는 RA(Random Access) 프리앰블을 포함한다. UE는 각각의 물리적 UL 공유 채널(PUSCH) 또는 물리적 UL 제어 채널(PUCCH)을 통해 데이터 정보 또는 UCI를 송 신한다. UE가 데이터 정보와 UCI를 동시에 송신할 경우 UE는 PUSCH에서 양쪽 모두를 다중화할 수 있다. UCI는 PDSCH에서 데이터 정보를 가진 전송 블록(TB)들에 대한 올바른(correct) 또는 올바르지 않은(incorrect) 검출을 나타내는 HARQ-ACK(Hybrid Automatic Repeat request acknowledgement) 정보, UE가 자신의 버퍼 내에 송신할 데이터를 갖는지 여부를 나타내는 스케줄링 요청(scheduling request, SR), 및 gNB가 UE에 대한 PDSCH 또는 PDCCH 전송을 위한 적절한 파라미터를 선택할 수 있게 하는 CSI 보고를 포함한다. UL RS는 DMRS 및 SRS를 포함한다. DMRS는 각각의 PUSCH 또는 PUCCH 전송의 BW에서만 송신된다. gNB는 DMRS를 사용하여 각각의 PUSCH 또는 PUCCH에서 정보를 복조할 수 있다. SRS가 UE에 의해 송신되어 gNB에게 UL CSI를 제공하며, TDD 시스템의 경우, DL CSI에도 송신된다. 또한, gNB와의 동기화 또는 초기 RRC 연결을 확립하기 위 해, UE는 물리적 랜덤 액세스 채널을 송신할 수 있다. 다중 RB를 통한 수신 또는 송신을 스케줄링하기 위한 제 어 오버헤드를 줄이기 위해, 미리 정해진 개수의 RB를 포함하는 PDSCH 수신 또는 PUSCH 송신을 위한 단위로서 RBG(RB group)를 사용할 수 있다. DL 전송 또는 UL 전송은 DFT-확산-OFDM으로 알려진 DFT 프리코딩을 사용하는 변형을 포함하는 직교 주파수 분할 다중화(OFDM) 파형을 기반으로 할 수 있다. 도 5는 본 개시의 실시예들에 따른 OFDM을 사용하는 예시적인 송신기 구조를 도시한 것이다. 도 5에 도시 된 송신기 구조의 실시예는 단지 설명을 위한 것이다. 도 5는 본 개시의 범위를 임의의 특정 구현으로 제 한하지 않는다. 도 5에 도시된 바와 같이, DCI 비트 또는 데이터 비트와 같은 정보 비트가 인코더에 의해 인코딩되고, 레이트 매칭기에 의해서, 할당된 시간/주파수 리소스에 레이트 매칭되고, 변조기에 의해 변조된다. 이어서, 변조 및 인코딩된 심볼들과 DMRS 또는 CSI-RS가 SC 매핑 유닛에 의해 SC들(56 0)에 매핑되고, 역 고속 푸리에 변환(IFFT)이 필터에 의해 수행되고, CP 삽입 유닛에 의해 사이클릭 프리픽스(CP)가 추가되며, 결과 신호가 필터에 의해 필터링된 다음, 무선 주파수(RF) 유닛에 의해 송신된다. 도 6은 본 개시의 실시예들에 따른 OFDM을 사용하는 예시적인 수신기 구조를 도시한 것이다. 도 6에 도시 된 수신기 구조의 실시예는 단지 설명을 위한 것이다. 도 6은 본 개시의 범위를 임의의 특정 구현으로 제 한하지 않는다. 도 6에 도시된 바와 같이, 수신 신호가 필터에 의해 필터링되고, CP 제거 유닛이 CP를 제거하고, 필터가 고속 푸리에 변환(FFT)을 적용하고, SC 디-매핑 유닛이 BW 선택기 유닛에 의 해 선택된 SC들을 디-매핑하며, 수신 심볼들이 채널 추정기 및 복조기 유닛에 의해 복조되고, 레이트 디- 매칭기가 레이트 매칭을 복원한 다음, 디코더가 결과 비트들을 디코딩하여 정보 비트들을 제공 한다. UE는 일반적으로 슬롯에서 하나 이상의 DCI 포맷을 디코딩하기 위해 각각의 잠재적 PDCCH 수신들을 위한 여러 후보 위치들을 모니터링하다. DCI 포맷은 UE가 DCI 포맷의 정확한 검출을 확인할 수 있도록 하기 위한 CRC(Cyclic Redundancy Check) 비트들을 포함한다. DCI 포맷 타입은 CRC 비트들을 스크램블링하는 무선 네트 워크 임시 식별자(radio network temporary identifier, RNTI)에 의해 식별된다. PDSCH 또는 PUSCH를 단일 UE 에 스케줄링하는 DCI 포맷의 경우, RNTI는 셀 RNTI(C-RNTI)일 수 있으며 이것이 UE 식별자 역할을 한다. 시스템 정보(system information, SI)를 전달하는 PDSCH를 스케줄링하는 DCI 포맷의 경우, RNTI는 SI-RNTI일 수 있다. RAR(Random Access Response)을 제공하는 PDSCH를 스케줄링하는 DCI 포맷의 경우, RNTI는 RA-RNTI일 수 있다. UE 그룹에 송신 전력 제어(transmit power control, TPC) 명령을 제공하는 DCI 포맷의 경우, RNTI는 TPC-RNTI가 될 수 있다. 각 RNTI 타입은 RRC 시그널링과 같은 상위 계층 시그널링을 통해 UE에게 구성될 수 있 다. UE에 대한 PDSCH 전송을 스케줄링하는 DCI 포맷을 DL DCI 포맷 또는 DL 할당이라고도 하며, UE로부터의 PUSCH 전송을 스케줄링하는 DCI 포맷을 UL DCI 포맷 또는 UL 그랜트라고도 한다. PDCCH 송신은 PRB 세트 내에서 이루어질 수 있다. gNB는 PDCCH 수신을 위해 제어 리소스 세트(CORESET)라고도 하는 하나 이상의 PRB 세트를 UE에 구성할 수 있다. PDCCH 수신은 CORESET의 제어 채널 요소(CCE)들을 통해 이 루어질 수 있다. UE는 탐색 공간 세트에 기초하여 PDCCH 수신하기 위한 CCE를 결정한다. UE에 의한 PDCCH 수 신에 사용될 수 있는 CCE 세트가 PDCCH 후보 위치를 정의한다. 도 7은 본 개시의 실시예들에 따른 DCI 포맷에 대한 예시적인 인코딩 프로세스를 도시한 것이다. 도 7에 도시된 인코딩 프로세스의 실시예는 단지 설명을 위한 것이다. 도 7은 본 개시의 범위를 임의의 특정 구 현으로 제한하지 않는다. 도 7에 도시된 바와 같이, gNB는 각각의 PDCCH에서 각각의 DCI 포맷을 개별적으로 인코딩하여 송신한다. 적용 가능한 경우, DCI 포맷이 의도된 UE에 대한 RNTI가 UE로 하여금 DCI 포맷을 식별할 수 있도록 DCI 포맷 코드워 드의 CRC를 마스킹한다. 예를 들어, CRC는 16 비트 또는 24 비트를 포함할 수 있고, RNTI는 16 비트 또는 24 비트를 포함할 수 있다. 그렇지 않고, RNTI가 DCI 포맷에 포함되지 않은 경우, DCI 포맷 타입 인디케이터 필드 가 DCI 포맷에 포함될 수 있다. (비-코딩된) DCI 포맷 정보 비트의 CRC가 CRC 계산 유닛을 사용하여 결정되고, 이 CRC가 CRC 비트와 RNTI 비트 사이의 배타적 OR(XOR) 연산 유닛을 사용하여 마스킹된다. XOR 연산은 XOR(0,0) = 0, XOR(0,1) = 1, XOR(1,0) = 1, XOR(1,1) = 0으로 정의된다. 마스킹된 CRC 비트가 CRC 추가 유닛을 사용하여 DCI 포맷 정보 비트에 추가된다. 인코더가 채널 코딩(예를 들어 테일-바 이팅 컨벌루션 코딩 또는 폴라 코딩)을 수행하고, 이어서 레이트 매칭기가 할당된 리소스에 대한 레이트 매칭을 수행한다. 인터리빙 및 변조 유닛이 QPSK와 같은 인터리빙 및 변조를 적용함으로써, 출력 제어 신 호가 송신된다. 도 8은 본 개시의 실시예들에 따른 DCI 포맷에 대한 예시적인 디코딩 프로세스를 도시한 것이다. 도 8에 도시된 디코딩 프로세스의 실시예는 단지 설명을 위한 것이다. 도 8은 본 개시의 범위를 임의의 특정 구 현으로 제한하지 않는다. 도 8에 도시된 바와 같이, 수신된 제어 신호가 복조기 및 디-인터리버에 의해 복조 및 디-인터리빙된 다. 송신기에서 적용된 레이트 매칭이 레이트 매칭기에 의해서 복원되고, 결과 비트들이 디코더에 의해 디코딩된다. 디코딩 후에, CRC 추출기가 CRC 비트들을 추출하고 DCI 포맷 정보 비트들을 제공 한다. DCI 포맷 정보 비트들이 RNTI(적용 가능한 경우)와의 XOR 연산에 의해 마스킹 해제되고, 유닛 에 의해 CRC 검사가 수행된다. CRC 검사가 성공하면(체크섬이 0 임), DCI 포맷 정보 비트들이 유효한 것으로 간주된다(적어도 해당 정보가 유효한 경우). CRC 검사가 성공하지 못하면, DCI 포맷 정보 비트들이 유효하지 않은 것으로 간주된다. 서빙 셀에서 UE에 구성된 각 DL 대역폭 부분(BWP)에 대해, UE는 상위 계층 시그널링에 의해서 다수의 CORESET을 제공받을 수 있다. 각 CORESET에 대해, UE는 다음의 사항들을 제공받는다: CORESET 인덱스 ; DM-RS 스크램 블링 시퀀스 초기화 값; UE가 동일한 DM-RS 프리코더의 사용을 가정할 수 있는 주파수에서의 REG 수에 대한 프 리코더 그래뉼래러티; 연속 심볼의 수; 리소스 블록 세트; CCE-REG 매핑 파라미터들; PDCCH 수신을 위한 DM-RS 안테나 포트의 QCL(quasi co-location) 정보를 나타내는, 안테나 포트 QCL 세트로부터의, 안테나 포트 QCL; 및 CORESET 에서 PDCCH에 의해 송신되는 DCI 포맷 1_1에 대한 TCI(transmission configuration indication) 필 드의 존재 또는 부재에 대한 표시. 서빙 셀에서 UE에 구성된 각 DL BWP에 대해, UE는 상위 계층에 의해 다수의 탐색 공간 세트를 제공받으며, 여기 서, 이 다수의 탐색 공간 세트로부터의 각 탐색 공간 세트에 대해 UE는 다음의 사항을 제공받는다: 탐색 공간 세트 인덱스 ; 탐색 공간 세트 와 CORESET 사이의 연관; 슬롯의 PDCCH 모니터링 주기 및 슬롯 의 PDCCH 모니터링 오프셋; PDCCH 모니터링을 위한 슬롯 내의 제어 리소스 세트의 첫 번째 심볼(들)을 나타내는, 슬롯 내 PDCCH 모니터링 패턴; CCE 집계 레벨 당 PDCCH 후보 수 ; 탐색 공간 세트 가 공통 탐색 공간 세트 또는 UE 특정 탐색 공간 세트라는 표시; 및 탐색 공간 세트 가 존재하는 슬롯의 수를 나 타내는 슬롯의 듀레이션. CORESET 와 연관된 탐색 공간 세트 에 대해, 캐리어 인디케이터 필드 값 (탐색 공간이라고도 함)에 대 응하는 서빙 셀에 대해 슬롯 에서의 탐색 공간 세트의 PDCCH 후보 에 대응하는 집계 레벨 에 대 한 CCE 인덱스들이 수학식 1과 같이 주어진다 :"}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 공통 탐색 공간 에 대한; UE 특정 탐색 공간에 대해, 일 경우 , , 이고, 일 경우 이고, 일 경우 이며, ; 이고; 은 CORESET 에서 0에서 까지 번호가 부여된 CCE의 수이고; 은 UE가 캐리어 인디케이터 필드를 구성받을 경우의 캐리어 인 디케이터 필드 값이고; 그렇지 않을 경우, 임의의 공통 탐색 공간에 대해, 이고; 이며, 여기서 은 및 탐색 공간 세트 에 대응하는 서빙 셀에 대한 집 계 레벨 을 UE가 모니터링하도록 구성된 PDCCH 후보의 수이고; 임의의 공통 탐색 공간에 대해, 이고; UE 특정 탐색 공간에 대해, 은 제어 리소스 세트 에서 탐색 공간 세트 의 CCE 집계 레벨 에 대해 구성된 모든 값들에 대한 의 최대 값이고; RNTI 값이 에 사용된다. PUCCH는 여러 PUCCH 포맷들 중 하나에 따라 송신될 수 있다. 상이한 UCI 비트 수는 상이한 PUCCH 전송 구조를 필요로 하므로, PUCCH 포맷은 UCI 비트 수의 특정 범위를 위해 설계된 구조에 대응한다. PUCCH 전송은 또한 PUCCH 전송을 위한 공간 도메인 필터를 제공하는 TCI 상태와 관련된다. PUCCH는 HARQ-ACK 정보, SR 또는 주기적/반지속적 CSI 및 이들의 조합을 전달하는데 사용될 수 있다. UE는 DL 시스템 BW(DL BWP) 및 UL 시스템 BW(UL BWP)에서 다중 대역폭 부분(BWP)으로 작동하도록 구성될 수 있 다. 주어진 시간에, 단 하나의 DL BWP와 단 하나의 UL BWP만이 UE에 대해 활성화된다. PDCCH 수신을 위한 탐 색 공간 세트 구성이나 PUCCH 송신을 위한 PUCCH 리소스들과 같은 다양한 파라미터의 구성이, 각각의 BWP에 대 해 개별적으로 제공될 수 있다. BWP 동작의 주된 목적은 UE의 전력 절감을 가능하게 하는 것이다. UE가 송신 또는 수신할 데이터를 가지고 있는 경우, 큰 BWP가 사용될 수 있으며, 예를 들어 탐색 공간 세트는 둘 이상일 수 있고, 모니터링 주기가 짧은 여러 PDCCH 후보를 가질 수 있다. UE가 송신 또는 수신할 데이터를 가지고 있 지 않은 경우, 작은 BWP가 사용될 수 있으며, 예를 들어 단일 탐색 공간 세트가 더 적은 PDCCH 후보 및 더 긴 모니터링 주기로 구성될 수 있다. 도 9는 본 개시의 실시예들에 따른 2 개의 슬라이스의 예시적인 다중화를 도시한 것이다. 도 9에 도시된 2 개의 슬라이스의 다중화의 실시예는 단지 설명을 위한 것이다. 도 9는 본 개시의 범위를 2 개의 슬라이 스의 다중화의 임의의 특정 구현으로 제한하지 않는다. 공통 서브프레임 또는 프레임 내에서 2 개의 슬라이스를 다중화하는 2 개의 예시적인 인스턴스들이 도 9에 도시 되어 있다. 이러한 예시적인 실시예들에서, 슬라이스는 하나의 전송 인스턴스가 제어(CTRL) 컴포넌트(예를 들 어, 920a, 960a, 960b, 920b 또는 960c) 및 데이터 컴포넌트(예를 들어, 930a, 970a, 970b, 930b 또는 970c)를 포함하는 하나 이상의 전송 인스턴스들로 구성될 수 있다. 실시예 910에서, 2 개의 슬라이스는 주파수 도메인 에서 다중화되는 반면, 실시예 950에서는 2 개의 슬라이스가 시간 도메인에서 다중화된다. 이러한 2 개의 슬라 이스가 서로 다른 뉴머롤로지(numerology) 세트들로 송신될 수 있다. 3GPP 사양은 최대 32 개의 CSI-RS 안테나 포트를 지원하며 이에 따라 gNB에 많은 수의 안테나 요소(예를 들면, 64 또는 128)를 장착할 수 있다. 이 경우, 하나의 CSI-RS 포트에 다수의 안테나 요소가 매핑된다. 5G와 같은 차세대 셀룰러 시스템의 경우, CSI-RS 포트의 최대 수가 동일하게 유지되거나 증가할 수 있다. 도 10은 본 개시의 실시예들에 따른 예시적인 안테나 블록을 도시한 것이다. 도 10에 도시된 안테나 블 록의 실시예는 단지 설명을 위한 것이다. 도 10은 본 개시의 범위를 안테나 블록의 임의의 특정 구현으로 제한하지 않는다. mmWave 대역들의 경우, 주어진 폼 팩터에 대해 안테나 요소의 수가 더 클 수 있지만, CSI-RS 포트의 수(디지털 프리코딩된 포트 수에 대응할 수 있음)는 하드웨어 제약 사항(예를 들면, mmWave 주파수에서 많은 수의 ADC/DAC 를 설치할 수 있는 가능성)으로 인해 제한되는 경향이 있다(도 10 참조). 이 경우, 하나의 CSI-RS 포트가 아날 로그 위상 시프터의 뱅크에 의해서 제어될 수 있는 많은 수의 안테나 요소에 매핑된다. 그러면 하나의 CSI-RS 포트가 아날로그 빔포밍을 통해 좁은 아날로그 빔을 생성하는 하나의 서브 어레이에 대응할 수 있다. 이 아날 로그 빔은 심볼들 또는 서브프레임들에 걸쳐 위상 시프터 뱅크를 변경하여 더 넓은 범위의 각도로 스위핑하도록 구성될 수 있다. 서브 어레이의 수(RF 체인 수와 동일)는 CSI-RS 포트 NCSI-PORT의 수와 동일하다. 디지털 빔포 밍 유닛은 NCSI-PORT 아날로그 빔에 걸쳐 선형 조합을 수행함으로써 프리코딩 이득을 더욱 증가시킨다. 아날로그 빔들은 광대역(따라서 주파수 선택적이지 않음)이지만, 디지털 프리코딩은 주파수 하위 대역들 또는 리소스 블 록들에 따라 달라질 수 있다. 도 11은 본 개시의 실시예들에 따른 C-DRX의 구성 및 관련 UE 프로세싱의 예를 도시한 것이다. 도 11에 도시된 구성의 실시예는 단지 설명을 위한 것이다. 도 11은 본 개시의 범위를 임의의 특정 구현으로 제 한하지 않는다. RRC_CONNECTED 상태의 UE의 경우, C-DRX(connected mode discontinuous reception) 동작은 LTE에서 승계된 NR 의 UE 전력 절감을 위한 메커니즘이다. \"온 듀레이션(On Duration)\" 기간 동안, UE는 구성된 탐색 공간 세트에서 PDCCH를 모니터링한다(DCI 포맷을 검출하려고 시도함). UE가 \"온 듀레이션\" 기간 동안 PDSCH 수신 또는 PUSCH 송신을 스케줄링하는 DCI 포맷을 검출하면, UE는 \"비활성 타이머(\"Inactivity Timer\")\"(110 3)를 시작하고 \"비활성 타이머\"가 만료되고 UE가 슬립 모드에 들어갈 때까지 PDCCH를 계속 모니터링한다. NR Rel-15는 상위 계층 시그널링을 사용하여 미리 정의된 값 세트로부터 모든 관련 DRX 파라미터에 대한 재구성 을 지원한다. 그러나, 네트워크 유연성의 이점을 위해, UE 특정 구성은 UE 전력 소모 상태 또는 BWP 대역폭 및 활성화된 컴포넌트 캐리어(CC)/셀 수에 관계없이 장기간에 걸쳐 변경되지 않는 경향이 있다. 관련 구성 파라미 터들은 다음과 같다: drx-onDurationTimer: DRX 사이클 시작시의 듀레이션; drx-SlotOffset: drx-onDurationTimer를 시작하기 전의 슬롯들에서의 지연; drx-InactivityTimer: PDCCH가 매체 액세스 제어(MAC) 엔티티에 대한 초기 UL 또는 DL 사용자 데이터 전송을 나타내는 PDCCH 오케이전 이후의 듀레이션; drx- RetransmissionTimerDL(DL 하이브리드 자동 반복 요청(HARQ) 프로세스마다): DL 재전송이 수신될 때까지의 최대 듀레이션; drx-RetransmissionTimerUL(UL HARQ 프로세스마다): UL 재전송에 대한 그랜트가 수신될 때까지의 최 대 듀레이션; drx-LongCycle: 긴 DRX 사이클; drx-ShortCycle(선택 사항): 짧은 DRX 사이클; drx- ShortCycleTimer(선택 사항): UE가 짧은 DRX 사이클을 따를 수 있는 듀레이션; drx-HARQ-RTT-TimerDL(DL HARQ 프로세스마다): HARQ 재전송을 위한 DL 할당이 MAC 엔티티에 의해 예상되기 전의 최소 듀레이션; 및 drx-HARQ- RTT-TimerUL(UL HARQ 프로세스마다): UL HARQ 재전송 그랜트가 MAC 엔티티에 의해 예상되기 전의 최소 듀레이션. 페이징은 네트워크가 RRC_IDLE/INACTIVE 불연속 수신 모드에서 수신 전화, 시스템 정보 변경, 지진 및 쓰나미 경고 시스템(ETWS) 또는 상업 모바일 경보 시스템(CMAS) 통지에 대해 UE에게 알리는 메커니즘이다. UE는 P- RNTI에 의해 스크램블링되는 CRC를 사용하여 연관된 PO에서의 PDCCH 모니터링 오케이전들에서 페이징 메시지를 디코딩할 수 있다. PO에서 디코딩되는 DCI 포맷은 시스템 정보 업데이트 또는 ETWS 통지에 대한 짧은 메시지만 을 나타낼 수 있으며, 이 경우 UE는 PDSCH를 디코딩할 필요가 없다. 일부 다른 경우들에 있어서, UE는 DCI 포 맷이, 스케줄링 정보가 페이징 메시지에 포함되어 있음을 나타낼 경우 PDSCH를 디코딩해야 할 수도 있다. 네트 워크는 각 UE에 대해 하나의 페이징 레코드를 포함시켜서 페이징 메시지 내에 다수의 UE들을 어드레싱할 수 있 다. 그러나, 유휴 모드에서 페이징 레이트가 낮거나 C-DRX의 활성 기간에서 스케줄링 레이트가 낮은 경우, UE는 PDCCH 모니터링에 전력을 낭비할 수 있다. 슬립 듀레이션의 기간 후에 성공적으로 웨이크 업하기 위해, UE는 일부 셀 특정 DL 기준 시퀀스에 기초하여, 자 동 이득 제어(AGC), 시간 추적 루프(TTL), 주파수 추적 루프(FTL)와 같은 루프 컨버전스를 수행해야 한다. LTE 와는 다르게, NR에는 상시 CRS(Cell-Specific Signal)가 없다. 대안적으로, UE는 루프 컨버전스를 위해 SS/PBCH 블록 버스트 세트를 사용할 수 있다. 그러나, SS/PBCH 블록 버스트 세트의 전송은 셀마다 구성된다. 특정 UE의 경우, 온 듀레이션 또는 PO의 시작 시간과 관련된 가장 가까운 SS/PBCH 블록 모니터링 오케이전이 수 십 밀리 초만큼 분리될 수 있다. 이러한 경우, UE는 다음 온 듀레이션 또는 PO 이전의 가장 가까운 SS/PBCH 블 록 버스트 세트를 모니터링한 이후에 웨이크-업/마이크로-슬립 상태를 계속하면서 시간-주파수 추적을 유지해야 한다. 따라서, 적어도 UE가 C-DRX 모드 또는 유휴/비활성 모드 페이징에서 동작하기 위한 동적 웨이크-업 표시를 위한 메커니즘 및 관련 시그널링 지원을 개발할 필요가 있다. 구성된 C-DRX를 갖거나 갖지 않는 활성 기간에서의 동적 고-투-슬립을 위한 메커니즘 및 관련 시그널링 지원을 개발할 또 다른 필요성이 있다. RRC_CONNECTED 상태에서 다양한 전력 소모 차원들에 대한 동적 적응 요청을 위한 시그널링 지원을 개발할 또 다 른 필요성이 있다. 채널 추적 및 RRM 측정을 위해 UE에 의해 사용될 수 있는 UE에 대한 DRX 사이클에 맞춰 정렬된 전송 오케이전들 을 갖는, 추가 기준 신호를 설계할 또 다른 필요성이 있다. 본 개시는 LTE(Long Term Evolution)와 같은 4G(4 세대) 통신 시스템을 넘어 더 높은 데이터 전송률을 지원하기 위해 제공되는 pre-5G 또는 5G 통신 시스템에 관한 것이다. 본 개시는 모니터링 오케이전, 리소스 할당, 뉴머 롤로지, QCL 가정, 전송 방식을 포함하는, 구성에 대한 세부 설계를 통해 전력 절감 신호를 가능하게 하는 것에 관한 것이다. 본 개시는 또한 연결 모드 불연속 수신(C-DRX) 및 유휴/비활성 모드 페이징 모두에 대한 동적 웨 이크-업 표시로서 전력 절감 신호를 지원하는 것에 관한 것이다. 본 개시는 또한 C-DRX가 있거나 없는 RRC_CONNECTED 상태에서의 UE 동작들을 위한 동적 고-투-슬립 표시로서 전 력 절감 신호를 지원하는 것에 관한 것이다. 본 개시는 또한 NR 비면허 스펙트럼(NR-U)에서 채널 점유 시간 (channel occupancy time, COT)의 시작의 표시로서 전력 절감 신호를 지원하는 것에 관한 것이다. 본 개시는 또한 RRC_CONNECTED 상태에 있는 UE 동작들에 대한 동적 적응 요청으로서 전력 절감 신호를 지원하는 것에 관한 것이다. 본 개시는 또한 C-DRX 사이클의 활성 기간 밖에서의 채널 추적 및 RRM 측정을 위한 추가 기준 신호 (RS)로서 전력 절감 신호를 지원하는 것에 관한 것이다. 본 개시는 또한 UE 보조 정보 보고를 위한 표시로서 전력 절감 신호를 지원하는 것에 관한 것이다.일 실시예에서, 모니터링 오케이전, 채널 리소스 할당, 뉴머롤로지, QCL 가정 및 전송 방식을 포함하는 PoSS 구 성이 제공된다. PoSS는 gNB에 의해서 단일 UE 또는 UE 그룹 또는 관련 서빙 셀(들) 내의 모든 UE들로 송신될 수 있다. PoSS는 적어도 관련 UE ID 또는 UE 그룹 UD 또는 본 개시에서 I^ID로 표시되는 셀 ID를 전달할 수 있다. 0<=I^ID<2^N_bits-1이며, 여기서 N_bits는 단일 UE의 경우 N_bits = 16과 같은 양의 정수이다. UE는 PoSS에서 I^ID를 결정하여 다음 중 하나를 통해 모니터링할 수 있다. 일 예에서, UE는 C-RNTI에 의해 스크램블링되는 CRC를 사용하여 DCI 포맷에 의해 스케줄링된 PDSCH에서 관련 RRC 파라미터를 디코딩함으로써 I^ID를 결정할 수 있다. 다른 예에서, UE는 SIB에서 관련 RRC 파라미터를 디코딩함으로써 I^ID를 결정할 수 있다. 또 다른 예에서, UE는 I^ID = mod(floor(I^UE/c1), c2)*c3이되도록, UE ID에 의해 I^ID를 결정할 수 있으며, 여기서 I^UE는 UE ID이며, 예를 들어, I^UE는 C-RNTI이고, c1, c2, c3은 c1=1, c2=4, c3=1과 같이 시스템 동작 에서 미리 결정되거나 상위 계층들에 의해서 UE에 제공된다. 하나의 하위 예에서, I^ID = mod(C-RNTI, N_UG)이며, 여기서 N_UG는 UE 그룹의 수이다. 또 다른 예에서, UE는 I^ID = mod(floor(I^cell_ID/c1), c2)*c3이 되도록, 셀 ID에 의해 I^ID를 결정할 수 있 으며, 여기서 I^cell_ID는 셀 ID이고, c1, c2, c3은 c1=1, c2=4, c3=1와 같이, 시스템 동작에서 미리 결정되거 나 상위 계층에 의해 UE에 제공된다. 하나의 하위 예에서, I^ID = mod(I^cell_ID, N_CG)이며, 여기서 N_CG는 셀 그룹의 수이다. 도 12는 본 개시의 실시예들에 따른 PoSS의 예시적인 모니터링 오케이전을 도시한 것이다. 도 12에 도시 된 모니터링 오케이전의 실시예는 단지 설명을 위한 것이다. 도 12는 본 개시의 범위를 임의의 특정 구 현으로 제한하지 않는다. 도 12에 도시된 바와 같이, UE는 다음 중 하나를 통해 하나의 슬롯 또는 1 밀리 초 또는 하나의 OFDM 심볼 단위 로, 주기 T^PoSS에 의해 PoSS를 모니터링하기 위한 구성을 결정할 수 있다. 일 예에서, T^PoSS는 시스템 동작의 사양에서 고정 및 정의될 수 있다(예를 들면, T^PoSS = 1 ms 또는 1 슬롯). 하나의 하위 예에서, T^PoSS는 URLLC UE들에 대해 또는 NR-U에 있어서 1 개 미만의 슬롯일 수 있다. 다른 예에서는, T^PoSS가 상위 계층 시그널링을 통해 UE에게 제공된다. 또 다른 예에서, T^PoSS는 T^PoSS = c1*T^DRX가 되도록, DRX 사이클 T^DRX와 연관될 수 있으며, 여기서 c1은 양의 정수(예를 들면, c1 = 1)일 수 있고, 미리 결정되거나 상위 계층 시그널링을 통해 UE에 제공된다. T_DRX 는 셀 특정 DRX, T_c 또는 UE 특정 DRX, T_UE 또는 min(T_c, T_UE) 또는 유휴/비활성 모드 페이징에서의 eDRX/DRX 또는 C-DRX에서의 길거나 짧은 DRX 사이클일 수 있다. 또 다른 예에서, T^PoSS는 T^PoSS = c1*T^PDCCH가 되도록, PDCCH 모니터링 주기, T^PDCCH와 연관될 수 있다. 하나의 하위 예에서, c1은 양의 정수(예를 들어 c1 = 1)일 수 있으며, 미리 결정되거나 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 다른 하위 예에서, c1은 분수 값(예를 들어, c1 = 0.25)일 수 있으며, 미리 결정되거나 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 또 다른 예에서, T^PoSS는 UE로부터 gNB로 제공되는 T^PoSS에 대한 선호 값들의 보조 정보에 기초하여 서빙 gNB 로부터의 상위 계층 시그널링에 의해 UE에 제공된다. UE는 PoSS 모니터링 오프셋 O^PoSS의 구성을 결정할 수 있다. O^PoSS는 하나의 슬롯 또는 1 ms의 단위의, PoSS 모니터링 기간의 시작에 대한 시간 오프셋으로서 또는 기준점(예를 들면, ON 듀레이션의 시작 또 는 PO의 시작) 이전의 시간 오프셋으로서 정의될 수 있다. UE는 다음 중 하나를 통해 O^PoSS의 구성을 결정할 수 있다. 일 예에서, O^ PoSS는 시스템 동작의 사양에서 고정 및 정의될 수 있다(예를 들면, O^PoSS = 1 슬롯). 다른 예에서, O^PoSS는 상위 계층 시그널링을 통해 UE에게 제공된다. 다른 예에서, O^PoSS는 I^ID에 의해 결정될 수 있다. 예를 들어, O^PoSS = mod( , c2)*c3(여기서 0<c2<T^PoSS)이며 c1, c2, c3가 c1=1, c2=4, c3=1와 같이, 시스템 동작에서 미리 결정되거나, 또는 상위 계층 들에 의해 UE에게 제공된다. PoSS는 gNB에 의한 요청 시에 UE로 송신될 수 있다. PoSS에 의해 표시되는 기능/제어 정보는 관련 PoSS가 시작 된 이후, 시간 갭 t_gap 이후의, 제한된 유효 듀레이션 I^ED 동안 유효할 수 있다. UE가 제한된 I^ED를 갖는 PoSS를 검출할 경우, UE는 관련 유효 듀레이션 내의 나머지 PoSS의 모니터링을 스킵(skip)할 수 있다. UE는 다음 중 하나를 통해, 하나의 ms 또는 하나의 슬롯 또는 하나의 OFDM 심볼 단위로, I^ED와 I_gap을 결정할 수 있다. 일 예에서는, I^ED 및 I_gap가 시스템 동작의 사양에 고정 및 정의될 수 있으며(예를 들어 I_gap = 0), I^ED는 NR-U의 COT와 같다. 다른 예에서는, I^ED 및 I_gap가 상위 계층 시그널링을 통해 UE에게 제공된다. 또 다른 예에서는, 다음 PoSS 모니터링 오케이전에서 PoSS가 검출되지 않는 경우, 현재의 모니터링 오케이전에 서 검출된 PoSS의 I^ED가 자동으로 다음 PoSS 모니터링 기간으로 확장된다. 또 다른 예에서, I^ED는 I^ED = c1*T^PoSS가 되도록, PoSS 모니터링 주기 T^PoSS와 연관될 수 있다. 하나의 하위 예에서, c1은 양의 정수(예를 들어, c1 = 2)일 수 있으며, 미리 결정되거나 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 이 경우, 모니터링 주기는 유효 기간보다 상대적으로 작으며, 이것이 적어도 NR 비 면허 스펙트럼 동안 적용될 수 있다. 다른 하위 예에서, c1은 분수 값(예를 들어, c1 = 0.5)일 수 있으며, 미리 결정되거나 상위 계층 시그널링을 통 해 UE에게 제공될 수 있다. UE는 다음 중 하나를 통해 PoSS_startOS로 표시되는, 모니터링 오케이전 내에서 PoSS의 시작 OFDM 심볼을 결정 할 수 있다. 일 예에서는, PoSS_startOS가 시스템 동작 사양에 고정 및 정의될 수 있다(예를 들면, PoSS_startOS = 0). 다른 예에서는, PoSS_startOS가 상위 계층 시그널링을 통해 UE에게 제공될 수 있다. 다른 예에서는, PoSS_startOS가 관련 UE ID, I^ID에 의해 결정될 수 있다. 예를 들어, PoSS_startOS = mod( , c2)*c3이며(여기서 0<c2<14), c1, c2, c3가 c1=1, c2=4, c3=1과 같이 시스템 동작에서 미리 결정 되거나, 또는 상위 계층들에 의해 UE에게 제공된다. 채널 리소스 할당의 경우, PoSS는 빔 스위핑 방식으로, 또는 요청 시에 단방향 빔 방식으로 gNB에 의해 송신될 수 있다. PoSS 전송 버스트는 L^PoSS>=1 PoSS 블록(들)으로 구성될 수 있다. 도 13은 본 개시의 실시예들에 따른 빔 스위핑 방식의 예시적인 PoSS 전송 버스트를 도시한 것이다. 도 13에 도시된 PoSS 전송 버스트의 실시예는 단지 설명을 위한 것이다. 도 13은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 빔 스위핑 방식으로 송신되는 PoSS의 경우, L^PoSS PoSS 블록(들)이 시간 도메인에서 연속 또는 비-연속 OFDM 심볼들/슬롯들에 매핑될 수 있으며, 주파수 도메인에서 N^PoSS_RB 리소스 블록(RB)들에 매핑될 수 있다. 일 예 1301에서, PoSS 전송이 전방향인 단일 빔 동작의 경우 L^PoSS = 1이다. 다른 예 1302에서, 상이한 영역들에 있 는 UE들이 다중 빔에 의해 커버될 수 있는 다중 빔 동작의 경우 L^PoSS > 1이다. UE는 다음 중 하나를 통해 L^PoSS를 결정할 수 있다. 일 예에서, L^PoSS는 SS/PBCH 블록의 최대 수와 동일하며(예를 들어, L^PoSS = L), 여기서 캐리어 주파수 범위 0 내지 3 GHz의 경우 L = 4이고; 캐리어 주파수 범위 3 내지 6 GHz의 경우 L = 8이고; 캐리어 주파수 범위 6 내 지 52.6 GHz의 경우 L = 64이다. 하나의 하위 예에서는, PoSS 버스트 세트 내의 각 PoSS 블록의 모니터링 윈도우가 SS/PBCH 블록 인덱스와 연관 된다. PoSS 버스트 세트 내 i 번째 PoSS 블록의 시작 심볼을 N^PoSS_{sym, i}로 표시하고, SS/PBCH 버스트 세트 내 i 번째 SS/PBCH 블록의 시작 심볼을 N^SSB_{sym, i}로 표시하며, 여기서 0≤i≤L-1이다. 그러면, N^PoSS_{sym, i} = N^SSB_{sym, i} + d_i이 되며, 여기서 d_i는 주어진 i 및 주어진 PoSS을 위한 시간 도메인 리소스 구성에 대한 오프셋을 나타내는 상수 정수이다. 다른 예에서는, L^PoSS가 상위 계층들에 의해 구성될 수 있으며, PoSS 버스트 세트 내의 각 PoSS 블록의 위치에 대한 매핑 패턴은 각각의 구성된 L^WUS에 대해 미리 정의된다. UE는 구성된 L^PoSS 및 미리 정의된 매핑 패턴 에 따라 각 PoSS 블록의 모니터링 윈도우를 결정할 수 있다. 또 다른 예에서는, L^PoSS가 UE로부터 gNB로 제공되는 L^PoSS에 대한 선호 값들의 보조 정보에 기초하여 서빙 gNB로부터의 상위 계층 시그널링에 의해 UE에 제공될 수 있다. 도 14는 본 개시의 실시예들에 따른 단방향 빔 방식의 예시적인 PoSS 전송 버스트를 도시한 것이다. 도 14에 도시된 PoSS 전송 버스트의 실시예는 단지 설명을 위한 것이다. 도 14는 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 단방향 빔 방식으로 송신되는 PoSS의 경우, 빔포밍 전송을 위한 단일 PoSS 블록이 PoSS 전송 버스트를 형 성하며, 예를 들어 RRC_CONNECTED 상태에서 특정 영역에 있는 UE 또는 UE 그룹을 어드레싱하기 하기 위해, L^PoSS = 1이다. UE는 다음 중 하나를 통해 하나의 RB 단위로, N^PoSS_RB로서 표시되는, PoSS의 대역폭(BW)에 대한 구성을 결정 할 수 있다. 일 예에서는, N^PoSS_RB가 관련 DL BWP, N^BWP_RB의 BW와 연관될 수 있다. 예를 들어, N^PoSS_RB = N^BWP_RB * a_BW + b_BW이며, 여기서 a_BW는 상수이고 0<a_BW<=1이고; b_BW는 상수 정수이며, b_BW >= 0이고(예를 들면, a_BW = 1, b_BW = 0), 여기서 PoSS의 크기는 관련 DL BWP의 크기와 동일하다. 다른 예에서는, N^PoSS_RB가 관련 CORESET의 대역폭과 연관될 수 있다. 예를 들어, N^PoSS_RB는 관련 CORESET 의 BW와 같다. 또 다른 예에서는, N^PoSS_RB가 시스템 동작의 사양에서 고정 및 정의될 수 있다. 일 예에서는, N^PoSS_RB = 24 RB이며, 공통 탐색 공간에 대해 구성된 최소 CORESET BW와 동일하다. 다른 예에서는, N^PoSS_RB = 12 RB이며, PRACH 프리앰블 및 PSS 및 SSS의 대역폭과 동일하다. 다른 예에서는, N^PoSS_RB = 6 RB이며, 협대역이다. 또 다른 예에서는, N^PoSS_RB가 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 또 다른 예에서, N^PoSS_RB는 UE로부터 gNB에 제공되는 N^PoSS_RB에 대한 선호 값들의 보조 정보에 기초하여 서 빙 gNB로부터의 상위 계층 시그널링에 의해 UE에 제공된다. UE는 다음 중 하나를 통해, 하나의 RB 단위로, PoSS_startRB로 표시되는, PoSS의 시작 RB에 대한 구성을 결정할 수 있다. 일 예에서는, PoSS_startRB가 활성 DL BWP와 연관된다. 하나의 하위 예에서는, PoSS_startRB가 PoSS_startRB = floor(N^BWP_RB/2) - floor(N^PoSS_RB/2)와 같이, 활성 DL BWP의 중심이다. 다른 하위 예에서는, PoSS_startRB = startRB_BWP + c1이며, 여기서 startRB_BWP는 활성 DL BWP의 시작 RB이고, c1은 음이 아닌 정 수이며, 미리 결정되거나(예를 들면, c1 = 0) 또는 상위 계층 시그널링을 통해 UE에 제공된다. 또 다른 예에서, PoSS_startRB는 PoSS_startRB = CORESET_startRB + c1가 되도록, CORESET_startRB로 표시되는, CORESET의 시작 RB와 연관되며, 여기서 c1은 음이 아닌 정수이고, 미리 결정되거나 상위 계층 시그널 링을 통해 UE에 제공된다. 하나의 하위 예에서는, PoSS_startRB가 관련 CORESET의 시작 RB와 동일하며, 여기서 c1 = 0이다. 다른 하위 예에서는, c1이 관련 CORESET의 대역폭보다 작지 않으며, 따라서 PoSS가 관련 CORESET 와 FDM된다. 또 다른 예에서, PoSS_startRB는 PoSS_startRB = startRB_PO + c2와 같이, PO와 연관되며, 여기서 startRB_BWP 는 연관된 PO의 시작 RB이고, c2는 음이 아닌 정수이며, 미리 결정되거나(예를 들면, c1 = 0) 또는 상위 계층 시그널링을 통해 UE에 제공된다. 또 다른 예에서는, PoSS_startRB이 시스템 동작 사양에서 고정 및 미리 정의될 수 있다(예를 들면, PoSS_startRB = 0). 또 다른 예에서는, PoSS_startRB가 상위 계층 시그널링을 통해 UE에 제공될 수 있다. PoSS 블록은 슬롯 내의 모든 RE에 매핑되지 않을 수 있으며 슬롯의 나머지 RE들은 PoSS 전송 버스트의 시간 도 메인 및 주파수 도메인 위치에 따라, 다른 신호/채널(예를 들면, SS/PBCH 블록, SIB의 PDCCH/PDSCH)의 다중화 전송에 사용되거나, 또는 엠프티 상태로 남겨질 수 있다. 일 예에서는, PoSS가 RE에 불연속적으로 매핑되며, 여기서 PoSS는 K0의 배수로 RE 또는 서브캐리어 인덱스들에 매핑된다. 보다 구체적으로, PoSS는 서브캐리어 인덱스 x에 매핑되며, 여기서 mod(x, K0) = K1이고, 0 <= K1 < K0이고, K0 및 K1은 상수 정수이다. 하나의 하위 예에서는, K0 = 2, K1 = 0이며, 여기서 PoSS는 연관된 대역폭 내의 모든 짝수 서브캐리어를 차지한다. 다른 하위 예에서는, K0 = 2, K1 = 1이며, 여기서 PoSS는 연관된 대역 폭 내의 모든 홀수 서브캐리어를 차지한다. 또 다른 하위 예에서는, K0 = 4이며, 여기서 PoSS는 연관된 대역폭 내의 4 개의 서브캐리어 중 하나를 차지한다. UE는 다음 중 하나를 통해, SCS(Subcarrier Spacing) 및 CP(Cyclic Prefix) 길이 측면에서, PoSS의 뉴머롤로지 의 구성을 결정할 수 있다. 일 예에서는, PoSS의 뉴머롤로지가 활성 DL BWP로서의 디폴트 뉴머롤로지와 동일하다. 다른 예에서는, PoSS의 뉴머롤로지가 구성 가능하며, 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 하나의 하위 예에서는, PoSS의 후보 SCS가 BWP에 대한 후보 SCS와 동일할 수 있다. 다른 하위 예에서는, PoSS의 후보 SCS가 7.5KHz로 될 수 있다. 이러한 방식으로, 더 긴 PoSS 시퀀스를 지원할 수 있다. UE는 다음 중 하나를 통해 PoSS를 모니터링할 DL BWP를 결정할 수 있다. 일 예에서는, PoSS의 BWP가 초기 DL BWP이다. 다른 예에서는, PoSS의 BWP가 상위 계층 시그널링을 통해 UE에게 제공된다. 또 다른 예에서는, PoSS의 BWP가 활성 DL BWP와 동일하다. 또 다른 예에서, PoSS의 BWP는 대역폭이 N^PoSS_BW인 PoSS 모니터링을 위한 전용 BWP이다. 하나의 하위 예에서, N^PoSS_BW는 시스템 동작 사양에 고정 및 정의되어 있다(예를 들면, N^PoSS_BW = 12 PRB). 다른 하위 예에서, N^PoSS_BW는 NR-U에서의 LBT 대역폭과 동일하다(예를 들면, 20MHz). 또 다른 하위 예에서, N^PoSS_BW는 상위 계층 시그널링을 통해 UE에 제공된다. 또 다른 예에서, PoSS의 BWP는 UE로부터 gNB로의 보조 정보에 기초하는 타겟 BWP이다. 하나의 하위 예에서, 타 겟 BWP는 스위칭할 UE의 선호 BWP일 수 있다. 이 하위 실시예는 UE 관점에서 SS/PBCH 수신과 관련된 DMRS(de-modulation reference signal) 안테나 포트 또 는 PDCCH/PDSCH의 수신관 관련된 다른 DL RS(reference signal) 안테나 포트, 및 PoSS 수신과 관련된 안테나 포트 간의 QCL(quasi co-located) 가정을 고려한다. QCL 가정은 지연 확산, 도플러 확산, 도플러 시프트, 평균 지연 및 공간 수신(RX) 파라미터들과 관련된다. UE는 다음 중 하나를 통해 PoSS의 QCL 가정을 결정할 수 있다. 일 예에서는, PoSS의 수신과 관련된 안테나 포트(들)가 SS/PBCH 수신과 관련된 DMRS 안테나 포트와 QCL되는 것으로 가정될 수 있다. 다른 예에서는, PoSS의 수신과 관련된 안테나 포트(들)가 탐색 공간 세트 구성에 대해 TCI(Transmission Configuration Indicator) 상태에 의해 구성된 하나 이상의 DL RS와 관련된 안테나 포트와 QCL되는 것으로 가정 될 수 있다. 또 다른 예에서는, PoSS의 수신과 관련된 안테나 포트(들)가 다른 RS와 관련된 안테나 포트와 QCL되는 것으로 가정되지 않을 수 있다. 예를 들어, 높은 이동성을 가진 UE 또는 UE 그룹 또는 긴 DRX 사이클을 가진 UE 또는 UE 그룹이, 이러한 타입의 QCL 가정을 사용할 수 있다. 또 다른 예에서는, PoSS의 수신과 관련된 안테나 포트(들)가 PDCCH/PDSCH 수신과 관련된 DMRS 안테나 포트와 QCL되는 것으로 가정될 수 있다. PoSS는 L^PoSS >= 1 PoSS 블록들이 N^PoSS_reps >= 1 회 반복될 수 있도록, 반복적으로 송신될 수 있다. 일 예에서는, UE가 상이한 반복들 내에서 동일한 블록 인덱스를 갖는 PoSS 블록(들)이 동일한 QCL을 갖는 것으 로 가정할 수 있다. UE는 다음 중 하나를 통해 반복 위치를 결정할 수 있다. 일 예에서는 N^PoSS_reps 반복이 시간 도메인에서 상이한 슬롯들에 대해 매핑될 수 있다. 슬롯 개수 측면에 있 어서 시간 도메인에서 인접한 두 반복 사이의 갭은 N^gap_slot일 수 있다. N^gap_slot은 미리 결정되거나(예를 들면, N^gap_slot = 0), 또는 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 다른 예에서는, N^PoSS_reps 반복이 주파수 도메인에서 상이한 RB들로 매핑될 수 있다. RB 개수 측면에 있어서 주파수 도메인에서 인접한 두 반복 사이의 갭은 N^gap_RB일 수 있다. N^gap_RB는 미리 결정되거나 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 다른 예에서는, 전송 다이버시티 방식이 N^PoSS_reps 반복의 PoSS 전송 버스트들에 적용될 있다. 전송 다이버 시티 방식은 UE에 대해 투명하거나, 최대한으로는 동일한 PoSS 블록 인덱스를 가진 PoSS 블록들의 고정된 수의 전송이 동일한 안테나 포트 가정을 갖도록 미리 정의될 수 있다. 또 다른 예에서는, N^PoSS_reps 반복의 PoSS 전송 버스트들에 주파수 호핑이 적용될 수 있다. PoSS 반복 전송 에 사용 가능한 협대역의 수는 N_NB = floor(N^BWP_RB/N^PoSS_RB)로 결정될 수 있으며, 여기서 N^BWP_RB 및 N^PoSS_RB는 각각 연관된 DL BWP 및 PoSS의 BW이다. N^PoSS_reps 반복의 PoSS 전송 버스트들이 서로 다른 협 대역들에 순차적으로 매핑될 수 있다. 또 다른 예에서는, 시간에 따른 무작위성을 증가시키기 위해 상이한 커버 코드들이 상이한 반복들에 적용될 수 있다. PoSS에 대한 반복의 경우, UE 측에서의 PoSS 검출 성능을 향상시키기 위해 각 PoSS 블록 내에서의 시퀀스 반복 이 고려될 수 있다. 이 하위 실시예는 PoSS를 수신하기 위한 UE 절차를 고려한다. PoSS는 N>=1 비트의 정보를 명시적으로 전달할 수 있다. 한편, PDCCH에서 추가의 전력 절감 정보가 전달될 수 있으며, 연관된 PDCCH의 수신이 PoSS에 의해 트 리거되거나 표시될 수 있다. 추가의 전력 절감 정보를 전달하는 연관된 PDCCH를 전력 절감 채널로 정의/지칭할 수 있다. 연관된 PDCCH 수신의 리소스 및 구성은 시스템 동작 사양에서 고정 및 미리 정의되거나 또는 PoSS 구 성과 함께 상위 계층 시그널링을 통해 UE에 제공될 수 있다. PoSS가 UE 그룹에 의해 모니터링되는 경우, 연관 된 PDCCH는 그룹 공통 PDCCH일 수 있다. PoSS가 전용 UE에 의해 모니터링되는 경우, 연관된 PDCCH는 C-RNTI 또는 전력 절감 목적 전용의 새로운 RNTI(예를 들면, P-RNTI)에 의해 스크램블링되는 CRC를 사용하여 UE에 의해 디코딩될 수 있다. 도 15는 본 개시의 실시예들에 따른 시간 도메인에서 PoSS 및 연관된 PDCCH의 예시적인 구성을 도시한 것 이다. 도 15에 도시된 구성의 실시예는 단지 설명을 위한 것이다. 도 15는 본 개시의 범위를 임의의 특 정 구현으로 제한하지 않는다. N^gap_PDCCH으로 표시되는, PoSS의 시작과 연관된 PDCCH의 시작 사이의 슬롯들 또는 OFDM 심볼들 수의 관점에서의 갭은 시스템 동작 사양에서 미리 결정될 수 있거나(예를 들면, N^gap_DCI = 1 슬롯), 또는 상위 계층 시그널링을 통해 UE에 제공된다. UE는 다음 중 하나를 통해 PoSS에 대한 연관된 PDCCH의 수신을 결정할 수 있다. 일 예에서는, 연관된 PDCCH의 존재가 UE에게 미리 알려진다. UE는 PoSS를 검출한 후 연관된 PDCCH를 디코딩할 수 있다. PoSS와 추가 PDCCH 간의 연관은 동작 시스템의 사양에서 고정 및 미리 정의되거나 상위 계층 시그널 링을 통해 UE에 제공될 수 있다. 다른 예에서는, 연관된 PDCCH의 수신 표시가 PoSS에서 전달될 수 있다. 이 경우, UE는 PoSS에서 정보를 검출 및 디코딩한 후 연관된 PDCCH를 디코딩할지 여부를 결정할 수 있다. 도 16은 본 개시의 실시예들에 따른 PoSS를 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 도 16에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 16은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. UE는 단계 1601에서 모니터링 주기, 대역폭 등과 같은 전술한 실시예에서 설명한 파라미터들을 포함하는, PoSS 수신을 위한 구성을 제공받는다. UE는 단계 1602에서 자신이 PoSS 모니터링 오케이전에 있고 PoSS를 검출했는 지 여부를 결정한다. UE가 PoSS 모니터링 오케이전에 있고 PoSS를 검출하는 경우, UE는 단계 1603에서 동적 적응 또는 임의의 기능들의 표시를 트리거하기 위한 정보를 얻기 위해 PoSS를 디코딩한다. 그 후 UE는 단계 1604 에서, 수신된 PoSS에 의해 표시되는 동적 적응 또는 임의의 기능을 수행한다. 도 17은 본 개시의 실시예들에 따른 PoSS를 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 도 17에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 17은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. UE는 단계 1701에서 모니터링 주기, 대역폭 및 연관된 PDCCH와 같은, 전술한 실시예에서 설명된 파라미터들을 포함하는, PoSS 수신을 위한 구성을 제공받는다. UE는 단계 1702에서 자신이 PoSS 모니터링 오케이전에 있고 PoSS를 검출했는지 여부를 결정한다. UE가 PoSS 모니터링 오케이전에 있고 PoSS를 검출하는 경우, UE는 단계 1703에서 동적 적응 또는 임의의 기능들의 표시를 트리거하기 위한 정보를 얻기 위해 PoSS를 디코딩한다. 그 다음, UE는 단계 1704에서 PoSS에 의해 표시된 경우 전력 절감 목적을 위한 추가의 전력 절감 정보를 얻기 위해 연관된 PDCCH를 디코딩한다. UE는 단계 1705에서, 수신된 PoSS 및 추가의 전력 절감 정보에 의해 표시되는 동 적 적응 또는 임의의 기능을 수행한다. 일 실시예에서는, PoSS가 웨이크-업(PoSS-WU)의 표시로서 사용된다. PoSS-WU는 C-DRX 모드 또는 유휴/비활성 모드 페이징의 활성 기간에서 PDSCH 수신 및 PUSCH 전송의 스케줄링 그랜트를 위해 슬립 모드에 있는 UE를 웨이 크-업시키도록 트리거하고 적어도 PDCCH 모니터링을 수행하는데 사용될 수 있다. C-DRX 모드의 디폴트 활성 기 간은 PoSS의 모니터링 주기 내의 연관된 CDRX 사이클(들)에서의 ON 듀레이션이다. 유휴/비활성 모드 페이징의 디폴트 활성 기간은 PoSS 모니터링 주기 내의 페이징 오케이전(들)이다. 구성된 모니터링 오케이전에서 PoSS- WU를 검출한 UE는 활성 기간 동안 PDCCH 모니터링을 위해 웨이크-업할 수 있다. 디폴트 활성 기간 동안의 웨이크-업 표시를 제외하고는, 전력 절감 목적을 위해 PoSS-WU에서 명시적으로 또는 PoSS-WU에 의해 표시되는 PDCCH 수신에서 더 많은 정보가 전달될 수 있다. 일 예에서는, PoSS-WUS가 UE 그룹에 의해 모니터링될 경우, L^WU_IDs로 표시되는, 웨이크-업할 수 있는 UE들의 서브세트가 PoSS에서 명시적으로 또는 연관된 PDCCH에서 전달될 수 있다. 다른 예에서는, T_active로 표시되는, UE가 웨이크 업할 수 있고 PDCCH를 계속 모니터링할 수 있는 동적 활성 기간이 PoSS에서 명시적으로 또는 연관된 PDCCH에서 전달될 수 있다. 또 다른 예에서는, 웨이크 업하도록 트리거되는 UE들에 대한 하나 또는 다수의 전력 소모 차원들에 대한 적응적 요청이 PoSS에서 명시적으로 또는 연관된 PDCCH에서 전달될 수 있다. 도 18은 본 개시의 실시예들에 따른 예시적인 동적 부분 활성 기간을 도시한 것이다. 도 18에 도시된 동 적 부분 활성 기간의 실시예는 단지 설명을 위한 것이다. 도 18은 본 개시의 범위를 임의의 특정 구현으 로 제한하지 않는다. 동적 활성 기간의 일 예에서는, T_active가 두 개의 연속적인 PoSS-WU 모니터링 오케이전(1801 및 1802) 사이의 부분 기간일 수 있다. 이 경우, 두 개의 연속적인 PoSS-WU 모니터링 오케이전 사이의 시간 인터벌이 다 음과 같이 표시될 수 있다: [t^wu_n, t^wu_(n+1)], 여기서 t^wus_n은 n 번째 PoSS-WU 모니터링 오케이전이고, t^wus_n+1은 (n+1) 번째 PoSS-WU 모니터링 오케이전이다. N 비트 크기를 갖는, I_active = [b_0, b_1, ..b_{N-1}]로 표시되는, 비트맵 정보는 n 번째 PoSS-WU 모니터링 오케이전에서 검출된 PoSS-WU와 관련된 불연속 활성 주기를 나타내는데 사용될 수 있다. N은 T0로 표시되는, 시간 그래뉼래러티로부터 도출될 수 있다 (예를 들면, N = ceil(T^PoSS/T0)). i 번째 비트 b_i가 1일 경우, 시간 인터벌 [b_i*T0++ t^wu_n, b_{i+1}*T0+ t^wus_n]이 활성화되고, 여기서 UE가 슬립 모드에서 활성 모드로 전환할 수 있으며; 그렇지 않고, i 번째 비트 b_i가 0일 경우, 시간 인터벌 [b_i*T0++ t^wu_n, b_{i+1}*T0+ t^wu_n]이 비활성화되며, 여기서 UE 는 계속 슬립될 수 있다. 제어 정보 I_active는 PoSS-WU에 의해 전달되거나 PoSS-WU에 의해 표시되는 PDCCH 수 신에서 전달될 수 있다. 동적 활성 기간의 다른 예에서는, T_active가 PoSS-WU 모니터링 주기 T^PoSS의 몇 배일 수 있으며, 즉 T_active = I_active * T^PoSS이고, 여기서 I_active는 양의 정수이다. 이 경우, UE는 동적 활성 기간 내의 나머지 PoSS-WU 오케이전들의 모니터링을 스킵할 수 있다. 보조 정보 I_active는 PoSS-WU에 의해 전달되거나 PoSS-WU에 의해 표시되는 PDCCH 수신에서 전달될 수 있다. PoSS-WU에 의해 트리거되는 동적 적응에 대한 일 예에서는, 적응 테이블 또는 프로파일이 미리 결정되거나 또는 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 적응 프로파일의 동적 행(row) 인덱스는 PoSS-WU에 의해 전달되거나 또는 PoSS-WU에 의해 표시되는 PDCCH 수신에서 전달될 수 있다. 이 경우, 동적 적응 요청에 대한 정 보, I_AR이 미리 알려진 적응 프로파일에 대한 행 인덱스이다. PoSS-WU에 의해 트리거되는 동적 적응에 대한 다른 예에서는, 관련된 적응적 파라미터(들) X에 대한 동적 스케 일링을 나타내는, 하나 이상의 스칼라(들), sX가 PoSS-WU에서 전달되거나 또는 PoSS-WU에 의해 표시되는 PDCCH 수신에서 전달될 수 있다. 이 경우, 동적 적응 요청에 대한 정보가 스칼라들 sX의 리스트인, I_AR = { sX }로 표시될 수 있다. 동적 웨이크-업 UE(들)의 리스트, L^WU_IDs, 동적 웨이크-업 주기, I_active 및 동적 적응 요청, I_AR을 포함하 는 웨이크-업 표시 이외의 정보의 수신은 PoSS-WU에서 직접 UE에 의해 수신될 수 있다. 도 19는 본 개시의 실시예들에 따른 PoSS-WU을 수신하고 웨이크-업하기 위한 예시적인 UE 절차를 도시한 것이다. 도 19에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 19는 본 개시의 범위를 임의 의 특정 구현으로 제한하지 않는다. 도 19에 도시된 바와 같이, UE는 단계 1901에서 모니터링 주기, 대역폭 등과 같은 실시예 I에서 설명된 파라미 터들을 포함하는, PoSS-WU 수신에 대한 구성을 제공받는다. UE는 단계 1902에서 자신이 PoSS-WU 모니터링 오케 이전에 있고 PoSS-WU를 검출했는지 여부를 결정한다. UE가 PoSS-WU 모니터링 오케이전에 있지 않거나 PoSS- WU를 검출하지 못하는 경우, UE는 단계 1903에서 슬립 모드에 들어가며; 그렇지 않으면 UE는, 구성되는 경우 전 력 절감을 위한 제어 정보를 얻기 위해 PoSS를 디코딩한다. UE는 PoSS-WU에 의해 표시되는 활성 기간에서 PUSCH 전송 및 PDSCH 수신에 대한 그랜트들을 스케줄링하기 위해 웨이크 업하여 PDCCH를 모니터링하며, 단계 1904에서 추가 정보 I_AR이 PoSS-WU에 의해 전달되면, 관련 전력 소모 도메인들에서 동적 적응을 수행할 수 있 다. 동적 웨이크 업 UE(들)의 리스트, L^WU_IDs, 동적 웨이크-업 기간, I_active, 동적 적응 요청, I_AR을 포함하는, 웨이크-업 표시 이외의 추가 정보 수신은 PoSS-WU에 의해 표시되는 PDCCH에서 UE에 의해 수신될 수 있다. 연관된 PDCCH가 PoSS-WU의 수신 이후에 수신될 수 있다. 이 경우, UE는 웨이크-업을 준비하는데 필요한 모든 정보를 얻기 위해 2 개의 단계/스테이지로 웨이크 업해야 한다. 도 20은 본 개시의 실시예들에 따른 PoSS-WU를 수신하고 웨이크-업하기 위한 다른 예시적인 UE 절차를 도 시한 것이다. 도 20에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 20은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. UE는 단계 2001에서 추가의 전력 절감 정보 수신을 위해 실시예 I 및 연관된 PDCCH에서 설명된 파라미터들을 포 함하는, PoSS-WU 수신에 대한 구성을 제공받는다. UE는 단계 2002에서 자신이 PoSS-WU 모니터링 오케이전에 있 고 PoSS-WU를 검출했는지 여부를 결정한다. UE가 PoSS-WU 모니터링 오케이전에 있지 않거나 PoSS-WU를 검출하 지 못하는 경우, UE는 단계 2003에서 슬립 모드에 들어가며; 그렇지 않은 경우 UE는 동적 웨이크-업 UE 리스트, I^WU_IDs, 동적 활성 기간, I_active 및 동적 적응 요청, I_AR을 포함하는 추가 정보를 위해 단계 2004에서 PoSS를 디코딩하고 단계 2005에서 연관된 PDCCH를 디코딩한다. UE는 단계 2005에서 적어도 PDCCH 모니터링을 위해 웨이크 업하고 PoSS-WU에 의해 표시되는 활성 기간에 동적 적응을 수행한다. 이 하위 실시예에서는, C-DRX 모드로 동작하는 UE에 대해 PoSS-WU가 지원된다. PoSS-WU의 모니터링 주기, T^PoSS는 C-DRX 사이클, T^DRX와 연관될 수 있다. PoSS-WU와 C-DRX 사이클들 사이에는 일대일 또는 일대N 매 핑이 있을 수 있다. 도 21은 본 개시의 실시예들에 따른 C-DRX와 연관된 PoSS-WU의 예시적인 시간 도메인 구성을 도시한 것이다. 도 21에 도시된 시간 도메인 구성의 실시예는 단지 설명을 위한 것이다. 도 21은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 21에 도시된 바와 같이, gNB는 T^PoSS = c1*T^DRX이 되도록, DRX 사이클, T^DRX와 연관된 PoSS-WU의 모니터 링 주기, T^PoSS를 구성할 수 있으며, 여기서 c1은 양의 정수이며, 미리 결정되거나(예를 들면, c1 = 1), 또는 상위 계층 시그널링을 통해 UE에 제공된다. PoSS-WU의 시작은 주기 내의 첫 번째 온듀레이션(210 3)의 시작과 연관될 수 있다. 모니터링 시간 갭은 PoSS-WU의 시작과 첫 번째 온듀레이션의 시작 사이의 갭을 나타낸다. UE가 연관된 모니터링 오케이전에서 PoSS-WU를 검출하지 못하는 경우 UE는 연관된 온듀 레이션에 대한 웨이크-업을 스킵할 수 있으며; 그렇지 않고 UE가 PoSS-WU를 검출할 경우, UE는 연 관된 온듀레이션에서 웨이크 업한다.도 22는 본 개시의 실시예들에 따른 C-DRX에서의 PoSS-WU 프로세싱을 위한 예시적인 UE 절차를 도시한 것 이다. 도 22에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 22는 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. UE는 단계 2201에서 C-DRX와 연관된 PoSS-WU 수신에 대한 구성을 제공받는다. UE는 단계 2202에서 자신이 PoSS-WU 모니터링 오케이전에 있고 PoSS-WU를 검출했는지 여부를 결정한다. UE가 PoSS-WU 모니터링 오케이전에 있지 않거나 PoSS-WU를 검출하지 못하는 경우, UE는 단계 2203에서 슬립 모드에 들어가며; 그렇지 않은 경우 UE 는 단계 2204에서 PDCCH 수신이 필요한지 여부를 결정한다. PDCCH 수신이 PoSS의 검출에 의해 표시되는 경우, UE는 단계 2205에서, 연관된 PDCCH에서 추가의 전력 절감 정보를 디코딩하기 위해 웨이크 업하고, 단계 2207에 서, C-DRX(들)의 활성 기간에서의 데이터 수신 및 송신의 그랜트들을 스케줄링하기 위해 PDCCH를 모니터링하고 PoSS-WU 및 추가의 전력 절감 정보 모두에 의해 표시되는 동적 적응을 수행하기 위해 웨이크 업하며; 그렇지 않 으면 단계 2206에서 UE는 C-DRX(들)의 활성 기간에서의 데이터 수신 및 송신의 그랜트들을 스케줄링하기 위해 PDCCH를 모니터링하고 PoSS-WU에서 디코딩된 정보에 의해 표시되는 동적 적응을 수행하기 위해 웨이크 업한다. 이 하위 실시예에서는, 유휴/비활성 모드 페이징으로 동작하는 UE에 대해 PoSS-WU가 지원된다. PoSS-WU의 모니 터링 주기, T^PoSS는 PF 및 PO와 같은 페이징 구성과 연관될 수 있다. 일 예에서는, PoSS-WU와 PF(들) 사이에 일대일 또는 일대N 매핑이 있을 수 있다. 하나의 PoSS-WU 모니터링 오 케이전이 N1>=1 연속 PF(들)와 연관될 수 있으며 연관된 PF(들) 내의 모든 페이징 오케이전(PO)들과 실질적으로 연관된다. PoSS-WU는 gNB로부터, 연관된 PO들에서 페이징 메시지를 모니터링하는 UE 그룹으로 송신된다. PoSS-WU는 연관된 PO에서 페이징 메시지를 디코딩하기 위해 웨이크 업하도록 UE를 트리거하는데 사용될 수 있다. 도 23은 본 개시의 실시예들에 따른 PF와 연관된 PoSS-WU의 예시적인 시간 도메인 구성을 도시한 것이다. 도 23에 도시된 시간 도메인 구성의 실시예는 단지 설명을 위한 것이다. 도 23은 본 개시의 범위를 임의 의 특정 구현으로 제한하지 않는다. 도 23에 도시된 바와 같이, gNB는 유휴 모드 페이징에서 DRX 사이클 T^DRX 내에서 N1>=1 연속 PF(들) 이 전에 PoSS-WU 모니터링 오케이전을 구성할 수 있다. PoSS-WU의 모니터링 시간 오프셋은 PoSS- WU의 시작과 첫 번째 연관된 PF의 시작 사이의 시간 갭일 수 있다. PoSS-WU 모니터링 주기는 T^PoSS = floor(T_DRX/N_PF)*c1일 수 있으며, 여기서 N_PF는 하나의 DRX 사이클 내의 PF 수이고, c1>=1은 양의 정수이며 미리 결정되거나 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 다른 예에서는, PoSS-WU와 PO(들) 사이에 일대일 또는 일대N 매핑이 있을 수 있다. 하나의 PoSS-WU 모니터링 오케이전이 N2>=1 연속 PO(들)와 연관될 수 있다. PoSS-WU는 gNB로부터 연관된 PO들에서 페이징 메시지들을 모 니터링하는 UE 그룹으로 송신된다. PoSS-WU는 연관된 PO에서 페이징 메시지를 디코딩하기 위해 웨이크 업하도 록 UE를 트리거하는데 사용될 수 있다. 도 24는 본 개시의 실시예들에 따른 PO(들)와 연관된 PoSS-WU의 예시적인 시간 도메인 구성을 도시한 것 이다. 도 24에 도시된 시간 도메인 구성의 실시예는 단지 설명을 위한 것이다. 도 24는 본 개시의 범위 를 임의의 특정 구현으로 제한하지 않는다. 도 24에 도시된 바와 같이, gNB는 유휴/비활성 모드 페이징을 위해 PF 내의 시간 도메인에서 N2>=1 연속 PO(들) 이전에 하나의 PoSS-WU 모니터링 오케이전을 구성할 수 있다. PoSS-WU 모니터링 오케이전 은 PoSS-WU의 시작과 첫 번째 연관된 PO의 시작 사이의 시간 오프셋에 의해 식별될 수 있다. 시간 오프 셋은 0일 수 있으며, 이에 따라 PoSS-WU가 PO(s)와 FDM된다. PoSS-WU 모니터링 주기는 T^PoSS = floor(T_0/N_PO)*c2일 수 있으며, 여기서 N_PO는 하나의 PF 내의 PO 수이고, T0은 하나의 PF의 듀레이션이며, c2는 양의 정수이며 미리 결정될 수 있거나(예를 들어, c2=1), 또는 상위 계층 시그널링을 통해 UE에게 제공된다. 도 25는 본 개시의 실시예들에 따른 PO(들)와 연관된 PoSS-WU의 다른 예시적인 시간 도메인 구성을 도시 한 것이다. 도 25에 도시된 시간 도메인 구성의 실시예는 단지 설명을 위한 것이다. 도 25는 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 25에 도시된 바와 같이, gNB는 유휴/비활성 모드 페이징을 위해 PF 내의 주파수 도메인에서 N2>=1 연 속 PO(들) 이전에 하나의 PoSS-WU 모니터링 오케이전을 구성할 수 있다. PoSS-WU 모니터링 오케이전은 PoSS-WU의 시작과 첫 번째 연관된 PO의 시작 사이의 시간 오프셋에 의해 식별될 수 있다. UE는 사양에서 고정 및 미리 정의될 수 있거나(예를 들면, N1/N2 = 1), 상위 계층 시그널링을 통해 UE에게 제공 될 수 있는 N1/N2의 구성을 결정할 수 있다. 도 26은 본 개시의 실시예들에 따른 PoSS-WU를 처리하기 위한 예시적인 UE 절차를 도시한 것이다. 도 26 에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 26은 본 개시의 범위를 임의의 특정 구현으 로 제한하지 않는다. 도 26에 도시된 바와 같이, UE는 단계 2601에서 페이징과 연관된 PoSS-WU 수신을 위한 구성을 제공받는다. UE 는 단계 2602에서 자신이 PoSS-WU 모니터링 오케이전에 있고 PoSS-WU를 검출했는지 여부를 결정한다. UE가 PoSS-WU 모니터링 오케이전에 있지 않거나 PoSS-WU를 검출하지 못하는 경우, UE는 단계 2603에서 슬립 모드에 들어가며; 그렇지 않은 경우 UE는 단계 2604에서 PoSS-WU에서 디코딩된 정보에 의해 표시되는 페이징 오케이전 (들)의 활성 기간에서 PDCCH를 모니터링하기 위해 웨이크 업한다. 일 실시예에서, PoSS는 고-투-슬립의 표시, 즉 PoSS-GTS로서 사용된다. PoSS-GTS는 UE가 RRC_CONNECTED 상태 로 구성된 C-DRX가 있거나 없는 슬립 기간 동안 PDCCH 모니터링을 스킵하고 고-투-슬립이 되도록 트리거하는데 사용될 수 있다. 고-투-슬립 표시를 제외한, 더 많은 정보가 PoSS-GTS에 의해 직접 전달될 수 있거나, 또는 PoSS-GTS에 의해 표시하는 PDCCH 수신을 통해 전달될 수 있다. 일 예에서는, PoSS-GTS가 UE 그룹에 의해 모니터링될 경우, L^GTS_ID로 표시되는, 슬립에 들어갈 수 있는 UE의 서브세트에 대한 표시가 PoSS-GTS에서 명시적으로 전달되거나 또는 연관된 PDCCH에서 전달될 수 있다. 다른 예에서는, T_sleep으로 표시되는, 슬립 기간의 듀레이션이 PoSS-GTS에서 명시적으로 전달되거나 또는 연관 된 PDCCH에서 전달될 수 있다. 또 다른 예에서는, UE가 상이한 \"전력 절감 상태\" 또는 \"슬립 타입\"을 제공받을 수 있으며, 여기서 각 슬립 타 입은 상이한 전력 절감 모드/슬립 모드로부터 활성 모드로 전환하기 위해 상이한 최소 슬립 듀레이션 또는 상이 한 전력 소모 특성 또는 상이한 전환 오버헤드와 연관될 수 있다. 가능한 모든 슬립 모드/타입이 시스템 동작 사양에서 미리 정의되거나 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 이 경우, I_AR로 표시되는, 미리 알려진 전력 절감 모드/슬립 모드와 연관된 행 인덱스가 PoSS-GTS에서 명시적으로 전달되거나 또는 연관된 PDCCH에서 전달될 수 있다. 도 27은 본 개시의 실시예들에 따라 PoSS-GTS에 의해 표시된 예시적인 동적 슬립 기간을 도시한 것이다. 도 27에 도시된 동적 슬립 기간의 실시예는 단지 설명을 위한 것이다. 도 27은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 27에 도시된 바와 같이, 동적 활성 기간의 일 예에서, T_sleep은 T_sleep = I_sleep *T^PoSS이 되도 록, PoSS-GTS 모니터링 주기 T^PoSS의 배수가 될 수 있으며, 여기서 I_sleep은 양의 정수이다. 이 경우, UE는 동적 슬립 기간 내의 나머지 PoSS-GTS 오케이전들의 모니터링을 스킵할 수 있다. 보조 정보 I_sleep은 PoSS-GTS에 의해 전달되거나 PoSS-GTS에 의해 표시되는 PDCCH 수신에서 전달될 수 있다. 도 28은 본 개시의 실시예들에 따라 PoSS-GTS에 의해 표시된 예시적인 동적 부분 슬립 기간을 도시한 것 이다. 도 28에 도시된 동적 부분 슬립 기간의 실시예는 단지 설명을 위한 것이다. 도 28은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 28에 도시된 바와 같이, 동적 슬립 기간의 또 다른 예에서는, T_sleep이 2 개의 연속적인 PoSS-GTS 모니터링 오케이전(2801 및 2802) 사이의 부분 기간일 수 있다. 이 경우, 2 개의 연속적인 PoSS-GTS 모니터링 오케이전 사이의 시간 인터벌은 다음과 같이 표시될 수 있으며: [t^gts_n, t^gts_(n+1)], 여기서 t^gts_n은 n 번 째 PoSS-GTS 모니터링 오케이전이고 t^gts_n+1은 (n+1) 번째 PoSS-GTS 모니터링 오케이전이다. N 비트 크기를 갖는, I_sleep = [b_0, b_1, ..b_{N-1}]로 표시되는 비트맵 정보는 n 번째 PoSS-GTS 모니터링 오케이전에서 검 출된 PoSS-GTS와 연관된 동적 슬립 기간을 표시하는데 사용될 수 있다. N은 T0로 표시된 시간 그래뉼래러티로부터 도출될 수 있다. 예를 들어 N = ceil(T^PoSS/T0)이다. i 번 째 비트 b_i가 1일 경우, UE는 시간 인터벌 [b_i*T0++ t^wus_n, b_{i+1}*T0+ t^wus_n] 동안 활성 모드에서 절 전 모드로 전환할 수 있으며; 그렇지 않고 i 번째 비트 b_i가 0일 경우, UE는 시간 인터벌 [b_i*T0++ t^wus_n, b_{i+1}*T0+ t^wus_n] 동안 활성 모드가 된다. 제어 정보 I_sleep은 PoSS-GTS에 의해 전달되거나 PoSS-GTS에의해 표시되는 PDCCH 수신에서 전달될 수 있다. 표 1"}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "행 인덱스슬립 타입 전력 소모 특성 평균 전력 /슬롯추가 전환 에너 지 (상대 전력 x ms)최소 슬립 듀레이션 0 딥 슬립 BB 모듈들 & RF 턴오프낮음, 예를 들면, 1높음, 예를 들면, 450예를 들면, 20 ms 1 라이트 슬립 모듈들 턴오프 중간, 예를 들면, 20중간, 예를 들면, 100예를 들면, 6 ms 2 마이크로 슬립대부분의 BB 모듈들 턴 오프높음, 예를 들면, 45거의 없음 예를 들면, 0ms 3 휴면 PDCCH 처리/데이터 송/ 수신과 연관된 BB 모듈 들 턴오프높음, 예를 들면, 50거의 없음 예를 들면, 0ms 표 2"}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "행 인덱스시간 도메인 [DRX 사이클, 비활 성 타이머]주파수 도메인 [PCell BWP, 활성화 CC]안테나 도메인 [N_계층]비고; (잠재적 적응 조 건) 0 (N/A, N/A) {BWP #1, CC #1-8 } 4 높은/버스트 트래픽 부하 1 (40ms, 10ms){BWP #2, CC #1-4} 2 중간 트래픽 부하 2 (160ms, 100ms){BWP #2, CC #1-2} 1 낮은 트래픽 부하 … … … … … 표 3 행 인덱스 DRX 사이클 비활성 온 듀레이션 0 40ms 10ms 4 ms 1 160ms 100ms 2 ms … … … … 동적 적응 요청의 다른 접근 방식에서, PoSS-AR은 하나 또는 여러 개의 스칼라 sX를 전달할 수 있으며, 이것은 연관된 적응 파라미터 X에 대한 동적 스케일링을 나타낸다. 이 경우, 동적 적응 요청을 위한 제어 정보는 스칼 라 sX의 리스트인, I_AR = { sX }로 표시될 수 있다.일 예에서, 연관된 적응 파라미터 X가 L_X = {v_0, v_1. …, v_K-1}와 같은, 후보 리스트 중 하나의 값 v_i로 선택될 경우, X의 값은 다음에 따라 v_i에서 v_j로 조정될 수 있다."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, a_step은 양의 상수 정수이며, 예를 들어 a_step = 1과 같이 미리 결정되거나 상위 계층 시그널링을 통 해 UE에 제공될 수 있다. 다른 예에서, 연관된 적응 파라미터 X가 고정 값으로 구성될 경우, X의 값은 다음에 따라 조정될 수 있다."}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서, 는 양의 정수이며, 및 는 X의 최대 값 및 최소값이다. 및 는 미리 결정 되거나(예를 들어, ) 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 적응 파라미터 X는 다음 중 하나 또는 임의의 조합일 수 있다. 일 예에서, X는 주기/듀레이션을 모니터링하는 PDCCH 또는 탐색 공간(들)일 수 있다. 다른 예에서, X는 크로스 -슬롯 스케줄링 지연의 최대 값일 수 있다. 또 다른 예에서, X는 UE 안테나의 개수일 수 있다. 또 다른 예에 서, X는 안테나 패널의 개수 또는 안테나 패널의 최대/최소 개수일 수 있다. 또 다른 예에서, X는 MIMO 계층의 최대 개수일 수 있다. 또 다른 예에서, X는 활성 BWP 또는 활성 BWP의 대역폭일 수 있다. 또 다른 예에서, X 는 C-DRX 사이클, 유휴/비활성 모드 페이징을 위한 DRX, eDRX 사이클과 같은 DRX 사이클일 수 있다. 또 다른 예에서, X는 하나의 C-DRX 내의 ON 듀레이션일 수 있다. 또 다른 예에서, X는 C-DRX 모드에서 비활성 타이머일 수 있다. 또 다른 예에서, X는 CSI 보고 주기일 수 있다. 또 다른 예에서, X는 CSI 또는 RRM 측정들을 위한 CSI-RS 대역폭일 수 있다. 또 다른 예에서, X는 CSI-RS 또는 RRM 측정 주기일 수 있다. 동적 적응 요청의 또 다른 접근 방식에서, PoSS-AR은 모니터링할 실제/유효 PDCCH 후보들을 나타낼 수 있다. PoSS-AR은 하나 또는 여러 PDCCH 모니터링 관련 파라미터 Y에 대한 후보들의 서브세트를 나타낼 수 있다. Y는 다음 중 하나 또는 임의의 조합일 수 있다. 일 예에서, Y는 연관된 BWP마다 구성된 모든 CORESET일 수 있다. 다른 예에서, Y는 연관된 BWP마다 구성된 모 든 탐색 공간 세트일 수 있다. 또 다른 예에서, Y는 PDCCH를 모니터링하기 위한 모든 CCE 집계 레벨일 수 있다. 또 다른 예에서, Y는 모니터링할 모든 DCI 포맷 길이일 수 있다. 또 다른 예에서, Y는 모니터링할 모든 DCI 포맷일 수 있다. 또 다른 예에서, Y는 모니터링할 CCE 집계 레벨마다에 대한 모든 PDCCH 후보일 수 있다. PDCCH 모니터링 관련 파라미터 Y에 대한 후보들이 N 개의 그룹으로 나누어질 수 있으며, PDCCH 모니터링 파라미 터 Y와 연관된 비트맵 즉, N 비트 크기의 Bitmap_Y = [c0, .., cN-1]이 PoSS-AR에서 전달될 수 있다. i 번째 비 트, ci가 1인 경우, 이 비트는 i 번째 그룹의 PDCCH 후보가 연관된 UE들에 의해 모니터링됨을 표시하며; 그렇지 않고 i 번째 비트, ci가 0일 경우, UE는 i 번째 그룹에서 연관된 PDCCH 후보들을 모니터링하는 것을 스킵할 수 있다. 예를 들어, Y가, UE가 모니터링할 모든 DCI 포맷인 경우, Y는 2 개의 그룹으로 나누어질 수 잇으며, 여 기서 한 그룹은 DL 스케줄링(PDSCH)을 위한 모든 DCI 포맷으로 구성되고 다른 그룹은 UL 스케줄링(PUSCH)을 위 한 모든 DCI 포맷으로 구성된다. PoSS-AR의 구성을 위한 일 접근 방식에서, PoSS-AR은 본 개시의 실시예 I에서 정의된 구성으로 BWP마다 구성될 수 있다. PoSS-AR 구성을 위한 다른 접근 방식에서, PoSS-AR은 탐색 공간 세트(들)마다 구성될 수 있다. PoSS-AR과 탐색 공간 세트(들) 간에 일대일 또는 일대N 매핑이 있을 수 있다. PoSS-AR은 연관된 탐색 공간 세트(들)와 함께 FDM 또는 TDM될 수 있다. 도 33은 본 개시의 실시예들에 따른 활성 기간 동안 PoSS-AR을 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 도 33에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 33은 본 개시의 범위를 임의 의 특정 구현으로 제한하지 않는다. 도 33에 도시된 바와 같이, UE는 단계 3301에서 PoSS-AR 수신 구성을 제공받는다. UE는 단계 3302에서 자신이 PoSS-AR 모니터링 오케이전에 있고 PoSS-AR을 검출했는지 여부를 결정한다. UE가 PoSS-AR에 있고 PoSS-AR을 검 한 경우, UE는 단계 3303에서, 수신된 PoSS-AR에 적응 프로파일이 표시되어 있으면 연관 시스템 파라미터들을 재구성하거나, 단계 3304에서, 수신된 PoSS-AR에 연관 스칼라(들)가 표시되어 있으면 적응 파라미터들을 재구성 하거나, 또는 단계 3305에서, PoSS-AR에 유효한 후보들의 서브세트가 표시되어 있으면 모니터링할 유효 PDCCH후보들을 재구성한다. UE는 적응된 구성에 기초하여 PDSCH 및 PUSCH의 그랜트들을 스케줄링하기 위해 PDCCH 후 보들을 모니터링한다. 일 실시예에서, PoSS는 RRC_CONNECTED 또는 RRC_INACTIVE/IDLE 상태에서 채널 추적/측정, 재동기화 및 RRM 측 정을 위한 추가 기준 신호(RS)로서 UE에 의해 사용된다. 채널 추적/측정 및 재동기화를 위한 추가 RS로 사용되는 PoSS의 경우, 이 PoSS는 타이밍 정보를 전달할 수 있다. RRM 측정을 위한 추가 RS인 PoSS의 경우, 이 PoSS는 적어도 셀 ID 또는 UE ID를 전달할 수 있다. UE는 다음 중 하나를 통해 PoSS에 의해 표시되는 CSI 보고를 제공하는 연관된 PUSCH/PUCCH의 전송을 위한 리소 스를 결정할 수 있다. 일 예에서, 연관된 PUSCH/PUCCH의 전송을 위한 리소스는 UE에게 미리 알려져있다. UE는 PoSS의 검출 후에 연관 된 PUSCH/PUCCH를 송신할 수 있다. CSI 보고를 제공하는 PoSS와 PUSCH/PUCCH 간의 연관은 시스템 동작 사양에 서 고정 및 미리 정의되거나 또는 상위 계층 시그널링을 통해 UE에 제공될 수 있다. 다른 예에서는, CSI 보고를 제공하는 연관된 PUSCH/PUCCH의 전송을 위한 리소스의 표시가 PoSS에서 전달될 수 있다. 이 경우, UE는 PoSS에서 정보를 검출 및 디코딩한 후 CSI 보고를 위해 연관된 PUSCH/PUCCH를 송신할지 여부를 결정할 수 있다. PoSS-WU는 C-DRX ON 듀레이션 이전의 추가 RS로서 UE에 의해 사용될 수 있다. PoSS-WU는 또한 연관된 ON 듀레 이션의 시작에서 UE로부터 PUSCH/PUCCH에서 CSI 보고를 트리거하는데 사용된다. 활성 기간 또는 ON 듀레이션의 시작과 연관된 PUSCH/PUCCH의 시작 사이의 슬롯 또는 OFDM 심볼 수 관점에서의 갭, N^gap_CSI는 시스템 동작 사 양에서 미리 결정되거나(예를 들면, N^gap_CSI = 1 슬롯), 또는 PoSS 구성과 함께 상위 계층 시그널링을 통해 UE에게 제공될 수 있다. 도 34는 본 개시의 실시예들에 따라 추가 RS로서 PoSS-WU를 수신하기 위한 예시적인 UE 절차를 도시한 것 이다. 도 34에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 34는 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 34에 도시된 바와 같이, UE는 단계 3401에서 DRX 사이클의 활성 기간 밖의 채널 추적 또는 RRM 측정을 위한 추가 RS로서 C-DRX와 연관된 PoSS-WU의 구성을 제공받는다. UE는 단계 3402에서 자신이 PoSS-WU 모니터링 오케 이전 내에 있고 PoSS-WU를 검출했는지 여부를 결정한다. UE가 PoSS-WU 모니터링 오케이전 내에 있지 않거나 PoSS-WU를 검출하지 못한 경우, UE는 단계 3406에서 슬립 모드에 들어가며; 그렇지 않은 경우 UE는 단계 3403에 서, 검출된 PoSS-WU에 기초하여 RSRP/RSRQ/SINR을 측정한다. UE는 단계 3404에서 PoSS-WU에 의해 표시된 C- DRX(들)의 활성 기간 동안 웨이크 업한다. UE는 단계 3405에서 C-DRX(들)의 활성 기간 내에 PoSS-WU에 의해 표 시된 PUSCH/PUCCH에 대한 CSI를 보고한다. PoSS가 채널 측정을 위한 추가 RS로서 사용되어 UE 트리거된 BWP 전환에 대한 CSI 보고를 트리거할 수 있다. CSI 보고를 위한 PoSS의 시작과 연관 PUSCH/PUCCH의 시작 사이의 슬롯 수 또는 OFDM 심볼 수 관점에서의 갭, N^gap_CSI이 상위 계층 시그널링을 통해 서빙 gNB에 의해서 UE에게 제공될 수 있다. UE는 타겟 BWP 또는 활성 BWP에서 PUSCH/PUCCH를 통해 CSI를 보고할 수 있다. CSI 보고를 위한 N^gap_CSI의 값과 PUSCH/PUCCH 리소스의 구성이 시스템 동작 사양에서 미리 결정되거나(예를 들면, N^gap_CSI = 1 슬롯), 또는 예를 들어 PoSS 구성과 함께, 상위 계층 시그널링을 통해 UE에게 제공될 수 있다. 도 35는 본 개시의 실시예들에 따라 추가 RS로서 PoSS를 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 도 35에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 35는 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 35에 도시된 바와 같이, UE는 단계 3501에서 채널 추적을 위한 추가 RS로서 PoSS에 대한 구성을 제공받으며 UE는 BWP 전환을 트리거받는다. UE는 단계 3502에서 전환할 타겟 BWP를 표시하기 위해 보조 정보를 gNB로 송신 한다. UE는 단계 3503에서 자신이 PoSS 모니터링 오케이전 내에 있고 타겟 BWP에서 PoSS를 검출했는지 여부를 결정한다. UE가 타겟 BWP에서 PoSS를 검출한 경우, UE는 단계 3504에서, 타겟 BWP에서 검출된 PoSS에 기초하여 RSRP/RSRQ/SINR을 측정한다. UE는 단계 3505에서 PoSS에 의해 표시된 연관 PUSCH/PUCCH에 대한 CSI를 보고한 다. UE는 단계 3506에서 동적 BWP 전환을 트리거하는 활성 BWP에서 스케줄링 DCI 포맷을 검출한다. 일 실시예에서, PoSS는 UE 보조 정보 요청, 즉 PoSS-AIR를 나타내기 위해 사용된다. PoSS-AIR는 PoSS-AIR에 의해 표시된 PUSCH/PUCCH에서 필요한 보조 정보를 보고하도록 UE를 트리거할 수 있다. UE 보조 정보는 예를 들어 UE에 의해 선호되는 PDCCH 모니터링 주기와 같은, 다양한 전력 소모 차원들 상의 시 스템 구성에 대한 UE의 프리퍼런스일 수 있다. UE 보조 정보 보고를 위한 PoSS-AIR의 시작과 연관 PUSCH/PUCCH의 시작 사이의 슬롯 수 또는 OFDM 심볼 수 관점 에서의 갭, N^gap_AIR은 상위 계층 시그널링을 통해 서빙 gNB에 의해서 UE에게 제공될 수 있다. 보조 정보 보 고 전송을 위한 N^gap_AIR의 값과 PUSCH/PUCCH 리소스들의 구성은 시스템 동작 사양에서 미리 결정되거나(예를 들면, N^gap_AIR = 1 슬롯), PoSS-AIR의 구성과 함께 상위 계층 시그널링을 통해 UE에게 제공될 수 있다. 도 36은 본 개시의 실시예들에 따른 PoSS-AIR를 수신하는 예시적인 UE 절차를 도시한 것이다. 도 36에 도시된 UE 절차의 실시예는 단지 설명을 위한 것이다. 도 36은 본 개시의 범위를 임의의 특정 구현으로 제한하지 않는다. 도 36에 도시된 바와 같이, UE는 단계 3601에서 PoSS-AIR 수신을 위한 구성을 제공받는다. UE는 단계 3602에서 자신이 PoSS-AIR 모니터링 오케이전 내에 있고 PoSS-AIR를 검출했는지 여부를 결정한다. UE가 PoSS-AIR를 검출 한 경우, UE는 단계 3603에서 PoSS-AIR에 의해 표시된 연관 PUSCH/PUCCH 리소스에서 보조 정보를 보고한다. 본 개시는 다음과 같은 설계 양태들 및 방법들을 포함하는 웨이크-업 신호 및/또는 고-투-슬립 신호를 포함하는, NR에 대한 전력 절감 신호(PoSS)의 시퀀스 설계를 제공한다. 설계 양태들의 일 예에서: PoSS에 의해 전달되는 정보; PoSS를 위한 시퀀스 생성 방법; 및 PoSS를 위한 시퀀스 매핑 패턴. 설계 방법들의 다른 예에서: PN-시퀀스 기반 PoSS; M-시퀀스 기반 PoSS; 골드-시퀀스 기반 PoSS; 및 ZC-시퀀스 기반 PoSS. PoSS 구성 유닛의 다른 예에서: 단일 심볼 기반 PoSS 유닛; 그리고 두 개의 심볼 기반 PoSS 유닛. 본 개시의 양태들 및 양태들의 조합은 NR PoSS를 구성하고 매핑하기 위한 시퀀스 설계 원리를 공식화하기 위해 이용될 수 있다. 일 실시예에서, PoSS 시퀀스의 설계 원리는 모든 PoSS 포맷들에 대해 공통적인 것일 수 있으며, 여기서 PoSS 포 맷은 PoSS 전송을 위한 시간 도메인/주파수 도메인 리소스들, 및/또는 PoSS의 뉴머롤로지, 및/또는 잠재적으로 지원되는 QCL 가정, 및/또는 잠재적으로 지원되는 전송 방식의 조합으로서 정의될 수 있다. 다른 실시예에서, PoSS 시퀀스의 설계 원리는 지원되는 각각의 PoSS 포맷에 대해 전적인 것일 수 있다. 일 실시예에서, PoSS 시퀀스의 설계 원리는 NR에서 지원되는 캐리어 주파수 범위들에 대해 공통적인 것일 수 있 다. 다른 실시예에서, PoSS 시퀀스의 설계 원리는 NR에서 지원되는 각 캐리어 주파수 범위에 대해 전적인 것일 수 있다. 일 실시예에서, PoSS 시퀀스의 설계 원리는 NR-U에서 지원되는 캐리어 주파수 범위들에 대해 공통적인 것일 수 있다. 다른 실시예에서, PoSS 시퀀스의 설계 원리는 NR-U에서 지원되는 각 캐리어 주파수 범위에 대해 전적인 것일 수 있다. PoSS는 NR-U의 업링크 및 다운링크 모두에서 LBT의 성공 및 COT의 시작을 표시하는데에도 사용 될 수 있다. PoSS를 생성하는 시퀀스는 그 시퀀스가 전달하는 정보를 기반으로 구성된다. 일 실시예에서, PoSS 시퀀스의 수 는 PoSS의 수가 전달하는 정보의 수와 같고, PoSS 시퀀스와 그 정보 사이에 일대일 연관이 있다. 다른 실시예 에서, PoSS 시퀀스의 수는 PoSS의 수가 전달하는 정보의 수보다 적을 수 있으며, PoSS 시퀀스와 그 정보 사이에 는 일대다 연관이 있다. PoSS에 의해 전달되는 정보는 다음 부분들 중 적어도 하나 및/또는 다음 부분들 중 하나보다 많은 부분의 조합 을 포함할 수 있으며, 여기서 여러 부분의 조합(지원되는 경우)은 선형 또는 비선형 방식일 수 있다. 셀 ID 또는 셀 ID의 일부의 일 실시예에서, 셀 ID의 일부가 PoSS에 의해 전달되는 경우, 예를 들어 PoSS 시퀀스 의 총 수를 줄이기 위해, 셀 ID의 일부는 및/또는 N_ID^cell mod b의 형식으로 이루어질 수 있으며, 여기서 a 및 b는 미리 정의된 상수 정수이다. 셀 ID를 I_ID^cell로 표시하도록 하며, 이것은 다음 중 하나 이상으로부터의 값을 취할 수 있다(I_ID^cell은 상이한 PoSS 포맷들(예를 들면, PoSS에 대해 연관된 BWP를 적어도 포함) 및/또는 캐리어 주파수 범위들에 대한 상이한 예들로부터의 형식일 수 있음에 유의한다): 모든 전 체 셀 ID가 PoSS에 의해 전달되는 경우, I_ID^cell = N_ID^cell, 여기서 0 ≤ I_ID^cell ≤ 1007; 셀 ID의 일부가 PoSS에 의해 전달되는 경우, I_ID^cell = , 여기서 0 ≤ I_ID^cell ≤ - 1; 및/또는 셀 ID의 일부가 PoSS에 의해 전달되는 경우, I_ID^cell = N_ID^cell mod b, 여기서 0 ≤ I_ID^cell ≤ b-1. UE ID 또는 UE ID의 일부의 일 실시예에서, UE ID의 일부가 PoSS에 의해 전달되는 경우, 예를 들어, PoSS 시퀀 스의 총 수를 줄이기 위해, UE ID의 일부는 그룹화된 형식, 예를 들어 및/또는 N_ID^UE mod d으로 이루어질 수 있으며, 여기서 c 및 d는 미리 정의된 상수 정수이다. UE ID를 I_ID^UE로 표시하도록 하며, 이것은 다음 중 하나 이상으로부터의 값을 취할 수 있다(I_ID^UE는 상이한 PoSS 포맷들(예를 들면, PoSS에 대해 연관된 BWP를 적어도 포함) 및/또는 캐리어 주파수 범위들에 대한 상이한 예들로부터의 형식으로 이루어질 수 있으며, I_ID^UE는 하나의 예에서 동일한 형식일 수 있지만 상이한 PoSS 포맷들(예를 들면, PoSS에 대해 연관된 BWP를 적어도 포함) 및/또는 캐리어 주파수 범위들에 대한 N_{ID,max}^UE에서 상이한 값을 가질 수 있음에 유의 한다). 일 예에서, UE ID는 IMSI(International Mobile Subscriber Identity) 또는 S-TMSI(SAE Temporary Mobile Subscriber Identity)이거나 그로부터 도출될 수 있다. 다른 예에서, UE ID는 예를 들어, UE가 RRC_CONNECTED 상태에 있는 경우 N_ID^UE = C-RNTI와 같이, RNTI(Radio Network Temporary Identifier)로부터 도출될 수 있다. 보다 구체적으로, I_ID^UE로 표시되는, PoSS에서 전달되는 UE ID는 다음과 같이 결정될 수 있다: 모든 전체 UE ID가 PoSS에 의해 전달되는 경우, I_ID^UE = N_ID^UE, 여기서 0 ≤ I_ID^UE ≤ N_{ID,max}^UE-1; UE ID의 일부 가 PoSS에 의해 전달되는 경우, I_ID^UE = , 여기서 0 ≤ I_ID^UE ≤ -1; 및/또는 UE ID의 일부가 PoSS에 의해 전달되는 경우, I_ID^UE = N_ID^UE mod d, 여기서 0 ≤ I_ID^UE ≤ d- 1(예를 들면, d = 1024). 타이밍 관련 정보의 일 실시예에서, 타이밍 관련 정보는 다음과 같은 하위 부분들 중의 적어도 하나를 포함할 수 있다: SS/PBCH 블록 인덱스(또는 SS/PBCH 블록 인덱스의 일부, 예를 들어 SS/PBCH 블록 인덱스의 일부 LSB 또는 MSB), 및/또는 시스템 프레임 번호(SFN)(또는 SFN의 일부, 예를 들어, SFN의 일부 LSB 또는 MSB 또는 특정 비트(들)) 및/또는 하프 프레임 인디케이터, 및/또는 슬롯 인덱스, 및/또는 심볼 인덱스. 타이밍 관련 정보를 I_t로 표시하도록 하며, 이것은 다음 중 적어도 하나의 형식일 수 있다(I_t는 상이한 PoSS 포맷들(예를 들면, PoSS에 대해 연관된 BWP를 적어도 포함) 및/또는 캐리어 주파수 범위들에 대한 상이한 예들로부터의 형식일 수 있음에 유의한다). 일 예에서, SS/PBCH 블록 인덱스만이 PoSS에 의해 전달되는 경우, I_t = I_SSB이다. 일 예에서, SS/PBCH 블록 인덱스의 일부만이 PoSS에 의해 전달되는 경우, I_t = I_SSB mod a_t이며, 여기서 a_t은 I_t가 SS/PBCH 블록 인덱스의 LSB들이 되도록 하는 미리 정의된 상수 정수이다. 일 예에서, SS/PBCH 블록 인덱스의 일부만이 PoSS에 의해 전달되는 경우, I_t = 이며, 여기서 b_t는 I_t가 SS/PBCH 블록 인덱스의 MSB들이 되도록 하는 미리 정의된 상수 정수이다. 일 예에서, SFN만이 PoSS에 의해 전달되는 경우, I_t = I_SFN이다. 일 예에서, SFN의 일부만이 PoSS에 의해 전달되는 경우, I_t = I_SFN mod c_t이며, 여기서 c_t는 I_t가 SFN의 LSB들이 되도록 하는 미리 정의된 상수 정수이다. 일 예에서, SFN의 일부만이 PoSS에 의해 전달되는 경우, I_t = 이며, 여기서 d_t는 I_t가 SFN 의 MSB들이 되도록 하는 미리 정의된 상수 정수이다. 일 예에서, SS/PBCH 블록 인덱스 및 하프 프레임 인디케이터 모두가 PoSS에 의해 전달되는 경우, I_t = I_SSB'+e_t*I_HF이고, 여기서 e_t는 미리 정의된 상수 정수(예를 들면, e_t = 4 또는 64)이며, I_SSB'는 예 1- 3 중의 임의의 형식일 수 있다. 일 예에서, SS/PBCH 블록 인덱스, 하프 프레임 인디케이터 및 SFN이 PoSS에 의해 전달되는 경우, I_t = I_SSB'+f_t*I_HF+g_t*I_SFN'이고, 여기서 e_t 및 f_t는 미리 정의된 상수 정수(예를 들면, e_t = 64, f_t =128)이며, I_SSB'는 전술한 예들 중의 임의의 형식일 수 있고, I_SFN'은 예 4-6 중의 임의의 형식일 수 있다. 일 예에서, 슬롯 인덱스만이 PoSS에 의해 전달되는 경우, It = I_slot이다. 일 예에서, 심볼 인덱스만이 PoSS에 의해 전달되는 경우, I_t = I_sym이다. 일 예에서, 슬롯 인덱스 및 심볼 인덱스 모두가 PoSS에 의해 전달되는 경우, I_t = I_sym+g_t*I_slot이며, 여기 서 g_t는 미리 정의된 상수 정수(예를 들면, g_t = 14)이다. 일 예에서, SFN, 슬롯 인덱스 및 심볼 인덱스가 PoSS에 의해 전달되는 경우, I_t = I_sym+h_t*I_slot+i_t*I_SFN'이고, 여기서 h_t 및 i_t는 미리 정의된 상수 정수(예를 들면, h_t = 14, i_t = 10*2^μ)이며, I_SFN'은 전술한 예들 중의 임의의 형식일 수 있다. 시스템 정보 업데이트 인디케이터 및/또는 업데이트된 시스템 정보의 일 실시예에서. 시스템 정보 업데이트 인 디케이터 및/또는 업데이트된 시스템 정보와 관련된 정보를 I_s로 표시하도록 하며, 여기서 0 ≤ I_s ≤ N_s- 1이고, N_s는 시스템 정보 업데이트 인디케이터 및/또는 업데이트된 시스템 정보와 관련된 총 가설 수이다( 예 를 들어, 시스템 정보 업데이트를 나타내는 N_s = 2, 및 시스템 정보를 나타내는 N_s = 2 또는 4 또는 8). PoSS 포맷 관련 정보의 일 실시예. PoSS는 관련 PoSS 포맷에 대한 일부 전용 정보를 전달할 수 있다. PoSS 포 맷과 관련된 정보를 I_f로 표시하도록 하며, 이것은 다음 중 하나 이상의 형식일 수 있다(I_f는 상이한 PoSS 포 맷들 및/또는 캐리어 주파수 범위들에 대한 상이한 예들로부터의 형식일 수 있음에 유의한다). 일 예에서, PF 특정 PoSS 포맷의 경우, I_f는 DRX 사이클 내에서의 PF의 인덱스를 나타낼 수 있다. 일 예에서, I_f = I_SFN mod T이며, 여기서 T는 연관된 DRX 사이클이고, I_SFN은 SFN 인덱스이다. 일 예에서, PF 특정 PoSS 포맷의 경우, I_f는 DRX 사이클 내에서의 연관된 PF 내의 모든 PO의 비트맵 인덱스를 나타낼 수 있다. 일 예에서, PO 특정 PoSS 포맷의 경우, I_f는 DRX 사이클 내에서의 연관된 PF 내의 PO의 인덱스를 나타낼 수 있 다. 일 예에서, I_f = I_PO mod N_PO이며, 여기서 I_PO는 프레임 내의 연관된 PO에 대한 슬롯 인덱스이고, N_PO는 연관된 PF 내에 구성된 PO의 총 수이다. 다른 예에서, I_f = I_PO이며, 여기서 I_PO는 프레임 내의 연 관된 PO에 대한 슬롯 인덱스이다. 일 예에서, 탐색-공간-특정 PoSS 포맷의 경우, I_f는 연관된 BWP 내의 CORESET 인덱스를 나타낼 수 있다. 일 예에서, I_f = p이며, 여기서 p는 CORESET 인덱스이다. 일 예에서, 탐색-공간-특정 PoSS 포맷의 경우, I_f는 DRX 사이클 내의 탐색 공간 세트의 인덱스를 나타낼 수 있 다. 일 예에서, I_f = s mod N_{p,s}이며, 여기서 s는 탐색-공간 인덱스이고, N_{p,s}는 PoSS에 의해 모니터 링되는 탐색 공간의 수이며, 여기서 N_{p, s} ≤ S-1이고, S는 S ≤ 10인 주어진 CORESET에 대해 구성된 PDCCH 모니터링 오케이전들의 수이다. 다른 예에서, I_f = s이며, 여기서 s는 탐색-공간 인덱스이다. 또 다른 예에 서, I_f = s_PoSS이며, 여기서 s_PoSS는 연관된 CORESET 내의 상대 탐색 공간 인덱스이며, s_PoSS ≤ N_{p,s}- 1이고 N_{p,s}는 PoSS에 의해 모니터링되는 탐색 공간의 수이다. 일 예에서, 탐색-공간-특정 PoSS 포맷의 경우, I_f는 DRX 사이클 내의 탐색 공간 인덱스 세트의 조합을 나타낼 수 있다. 일 예에서, I_f=(p + 1)(s + 1)이며, 여기서 s는 탐색-공간 세트 인덱스이고 p는 CORESET 인덱스이다. 다른 예에서, I_f = S * (p + 1) + (s + 1)이며, 여기서 s는 탐색 공간 세트 인덱스이고 p는 CORESET 인덱스이다. 추적 영역 관련 정보의 일 실시예에서, PoSS는 연관된 추적 영역(tracking area, TA)에 대한 일부 전용 정보를 전달할 수 있다. 예를 들어, 추적 영역 코드(tracking area code, TAC)는 각 운영자가 그들의 TA 각각에 할당 하는 고유 코드이다. TA ID와 관련된 정보를 I_ID^TA로 표시하도록 하며, 이것은 다음 중 적어도 하나의 형식 일 수 있다(I_TA는 상이한 PoSS 포맷들(예를 들면, PoSS에 대해 연관된 BWP를 적어도 포함) 및 캐리어 주파수 범위들에 대한 상이한 예들로부터의 형식일 수 있음에 유의한다): 모든 TAC가 PoSS에 의해 전달되는 경우, I_ID^TA = TAC; TAC의 일부가 PoSS에 의해 전달되는 경우, I_ID^TA = ; 및/또는 TAC의 일부가 PoSS에 의해 전달되는 경우, I_ID^TA = TAC mod b. 동적 재구성/적응 관련 정보의 일 실시예에서, PoSS는 동적 재구성/적응 목적을 위해 일부 알려지지 않은 정보 를 UE에게 전달할 수 있다. 동적 재구성/적응과 관련된 정보를 I_conf로 표시하도록 하며, 이것은 다음 중 적어도 하나의 형식일 수 있다(I_conf는 상이한 PoSS 기능들에 대한 상이한 예들로부터의 형식일 수 있음). 일 예에서, I_conf는 본 발명의 다른 실시예에서 정의된 I_AR 또는 I_sleep 또는 I_PS와 동일하다. 다른 예에서, I_conf는 동적 DRX 재구성을 위해 구성된 파라미터들과 연관된 스칼라들의 조합을 나타낼 수 있다. 하나의 하위 예에서, I_conf = s_DRX + a*s_nB이며, 여기서 a는 미리 정의된 상수 정수이고, s_DRX 및 s_nB는 DRX 사이클의 스칼라 팩터들이며 또한 s_nB는 유휴/연결 모드 페이징에 대해 구성되고, 예를 들면, a = 2이다. 다른 하위 예에서, I_conf = s_sDRX + b*s_lDRX이며, 여기서 b는 미리 정의된 상수 정수이고, s_sDRX 및 s_lDRX는 연결 모드 DRX에 대해 구성된 짧은 DRX 사이클 및 긴 DRX 사이클의 스칼라 팩터들이고, 예를 들면, b = 2이다. 또 다른 하위 예에서, I_conf = s_eDRX + c*s_PTW이며, 여기서 c는 미리 정의된 상수 정수이고, s_eDRX 및 s_PTW는 유휴/비활성 모드 페이징에서 eDRX에 대해 구성된 eDRX 사이클 및 PTW 길이의 스칼라 팩터들 이다. 또 다른 예에서, I_conf = s_DRX이며, 이것은 DRX 사이클의 이진 스칼라이다. 다른 예에서, I_conf는 PDCCH 모니터링을 위해 구성된 파라미터들과 연관된 스칼라들의 조합을 나타낼 수 있다. 하나의 하위 예에서, I_conf = s_ k_{p, s}이며, 여기서 s_k_{p, s}는 탐색 공간 모니터링 주기의 스칼라 팩터 이다. 다른 하위 예에서, I_conf = s_format + a*s_AL + b*s_candidate이며, 여기서 a 및 b는 미리 정의된 상 수 정수이고, s_format, s_AL 및 s_candidate는 DCI 포맷 수, CCE 집계 레벨 수 및 PDCCH 후보 수와 관련된 스 칼라들이며, 예를 들면, a = 2, b = 2이다. 또 다른 예에서, I_conf는 RRM 모니터링 및 보고를 위해 구성된 파라미터들과 연관된 스칼라들의 조합을 나타낼 수 있다. 하나의 하위 예에서, I_conf = s^RRM_p + a*s^RRM_RB이며, 여기서 a는 미리 정의된 상수이고, s^RRM_p 및 s^RRM_RB는 주기 및 RRM 측정 대역폭을 보고하는 CQI와 관련된 스칼라들이다. 또 다른 예에서, I_conf는 파라미터 X에 대한 재구성을 나타낸다. 보다 구체적으로, X에 대한 재구성은 표 4 및 표 5에 의해 결정되고, 여기서 a_step은 상수 값이며, 예를 들면 a_step = 2이다. 표 4 I_ conf X 0 동일하게 유지, X = X 1 증가, X = a_step*X 2 감소, X = X/a_step 표 5 I_ conf X 0 동일하게 유지, X = X 1 디폴트로 리셋, X = X_default 2 증가, X = a_step*X 3 감소, X = X/a_step 하나의 하위 예에서, X는 X = 1 슬롯 또는 2 심볼과 같은, PDCCH 모니터링 주기이다. 다른 하위 예에서, X는 성공적인 LBT 이후의 COT이다. 또 다른 하위 예에서, X는 CDRX 또는 비활성/유휴 모드 페이징과 관련된 DRX 사 이클이다. 또 다른 하위 예에서, X는 CDRX와 관련된 온듀레이션 또는 비활성 듀레이션이다.또 다른 예에서, I_conf는 후보 리스트 L_x = {c_0, c_1, c_2,… c_N-1}로부터 선택되는 파라미터 X에 대한 재구성을 나타낸다. 후보 c_i에 대한 X의 재구성은 I_conf에 의해 전달되며, 여기서 I_conf = i이다. 하나의 하위 예에서, X는 LBT 와 연관된 COT이다. 다른 하위 예에서, X는 LBT 우선 순위 클래스 또는 연관된 MCOT이다. 일 실시예에서, PoSS는 PDCCH 모니터링을 위해 일부 알려지지 않은 정보를 UE에게 전달할 수 있다. PDCCH 모니 터링 타겟들과 관련된 정보를 I_tgt로 표시하도록 한다. 일 예에서, I_tgt는 비트맵 정보이다. 다른 예에서, I_tgt는 활성 시간 또는 ON 듀레이션 시간, T_active 내에 서 유효한 시간 인터벌(들)을 나타낸다. UE는 유효한 시간 인터벌 내의 PDCCH 모니터링 오케이전에서의 PDCCH 후보들만을 디코딩하면 된다. 보다 구체적으로, I_tgt = [b0, b1, …b_i. …, b_N-1]이며, 여기서 b_i = 0은시간 인터벌 [i*T_active/N,(i+1)*T_active/N]이 유효하지 않고 UE가 이 시간 인터벌 내에서 PDCCH 오케이전들 을 모니터링하는 것을 스킵할 수 있음을 나타내며, b_i = 1은 타겟 시간 인터벌이 유효하고 이 기간 동안 UE가 PDCCH 모니터링을 수행함을 나타낸다. DL/UL 방향 구성 관련 정보의 일 실시예에서, PoSS는 DL/UL 방향 표시를 위해 일부 알려지지 않은 정보를 UE에 게 전달할 수 있다. 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보의 일 실시예에서, PoSS는 전력 소모 프로파일 또는 UE 적응 구성 표시를 위해 일부 알려지지 않은 정보를 UE에게 전달할 수 있다. 슬립 타입 또는 전력 절감 상태 관련 정보의 일 실시예에서, PoSS는 슬립 타입 또는 전력 절감 상태 관련 표시 를 위해 일부 알려지지 않은 정보를 UE에게 전달할 수 있다. 일 실시예에서, 일반 ID는 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 그 조합을 나타내는 것으로 정의될 수 있다. 다음 중 적어도 하나의 형식일 수 있는 I_ID로 ID를 표시하 도록 한다(I_ID는 상이한 PoSS 포맷들(예를 들면, PoSS에 대해 연관된 BWP를 적어도 포함) 및 캐리어 주파수 범 위들에 대한 상이한 예들로부터의 형식일 수 있음)(0 ≤ I_ID ≤ N_{ID,max}이며, 여기서 N_{ID,max}는 ID의 최 대 개수): 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 모두가 PoSS에 의해 전달되고, a_ID가 미리 정의된 상수 인 경우, I_ID = a_ID*I_ID^cell+I_ID^UE. 예를 들어, a_ID는 I_ID^UE가 가질 수 있는 최대 값과 같고; 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 모두가 PoSS에 의해 전달되고, b_ID가 미리 정의된 상수인 경우(예를 들면, b_ID는 I_ID^cell이 가질 수 있는 최대 값과 같음), I_ID = b_ID*I_ID^UE+I_ID^cell이고; 셀 ID/셀 ID의 일부만이 PoSS 시퀀스에 의해 전달되고, c_ID가 미리 정의된 상수인 경우(예를 들면, c_ID가 1 또는 2와 같음), I_ID = c_ID*I_ID^cell이고; UE ID/UE ID의 일부만이 PoSS 시퀀스에 의해 전달되고, d_ID가 미리 정의된 상수 인 경우(예를 들면, d_ID가 1 또는 2와 같음), I_ID = d_ID*I_ID^UE이고; TA ID/TA ID의 일부만이 PoSS 시퀀스 에 의해 전달되고, e_ID가 미리 정의된 상수인 경우(예를 들면, e_ID가 1 또는 2와 같음), I_ID = e_ID*I_ID^TA이고; 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 모두가 PoSS에 의해 전달되는 경우, I_ID = f_ID*(I_ID^cell + 1)(I_ID^UE + 1) + g_ID* I_ID^cell + h_ID *I_ID^UE +i_ID이고, 여기서 f_ID, g_ID, h_ID, 및 i_ID는 미리 정의된 상수들이며; 및/또는 TA ID/TA ID의 일부 및 UE ID/UE ID의 일부 모두가 PoSS에 의해 전달되는 경우, I_ID = j_ID*(I_ID^TA + 1)(I_ID^UE + 1) + k_ID* I_ID^TA+ l_ID* I_ID^UE+ m_ID이고, 여 기서 j_ID, k_ID, l_ID, 및 m_ID는 미리 정의된 상수들이다. PoSS를 구성하는 시퀀스는 PoSS에서의 모든 정보 또는 적어도 일부의 정보를 전달할 수 있다. 시퀀스가 PoSS에 서의 정보의 일부를 전달하는 경우, PoSS에서의 나머지 정보는 PoSS의 시퀀스의 시퀀스 매핑 패턴 및/또는 PoSS 에 대한 RE 위치 변경 중 적어도 하나에 의해 전달될 수 있다. 다음 시퀀스 생성 실시예들 중 적어도 하나가 PoSS를 생성하기 위해 지원될 수 있다. 일 실시예에서, PN-시퀀스 기반 생성 방법. 이 방법에서는, PN-시퀀스(예를 들어, 길이 31인 LTE 및 NR PN-시 퀀스)를 이용하여 PoSS를 생성할 수 있으며, 여기서 PoSS에서의 정보는 PN-시퀀스의 초기 조건(예를 들어, PN- 시퀀스를 생성하는 M-시퀀스들 중 하나의 초기 조건)에 의해 전달될 수 있다. 일 실시예에서, M-시퀀스 기반 생성 방법. 이 방법에서는, 적어도 하나의 M-시퀀스가 PoSS를 생성하기 위한 베 이스 시퀀스로서 사용될 수 있으며, 여기서 M-시퀀스에 적용되는 적어도 하나의 추가 커버 코드가 있을 수 있다 (예를 들어, 더 많은 정보를 전달하기 위해 및/또는 무작위화 목적을 위해). 일 실시예에서, PoSS에서의 모든 정보 또는 일부의 정보는 PoSS를 생성하는 M-시퀀스의 사이클릭 시프트에 의해 전달될 수 있다. 다른 실시예에 서, PoSS에서의 모든 정보 또는 일부 정보는 PoSS를 생성하는 M-시퀀스의 초기 조건에 의해 전달될 수 있다. 또 다른 실시예에서, PoSS의 모든 정보 또는 일부 정보는 사이클릭 시프트 및 PoSS를 생성하는 M-시퀀스의 초기 조건 모두에 의해 전달될 수 있다. 일 실시예에서, 골드-시퀀스 기반 생성 방법. 이 방법에서는, 적어도 하나의 골드-시퀀스가 PoSS를 생성하기 위한 베이스 시퀀스로 이용될 수 있으며, 여기서 골드-시퀀스에 적용되는 적어도 하나의 추가 커버 코드가 있을 수 있다(예를 들어, 더 많은 정보를 전달하기 위해 및/또는 무작위화 목적을 위해). 일 실시예에서, PoSS에서 의 모든 정보 또는 일부 정보는 골드-시퀀스를 구성하는 2 개의 M-시퀀스 중 적어도 하나의 사이클릭 시프트에 의해 전달될 수 있다. 다른 실시예에서, PoSS에서의 모든 정보 또는 일부 정보는 골드-시퀀스를 구성하는 2 개 의 M-시퀀스 중 적어도 하나의 초기 조건에 의해 전달될 수 있다. 또 다른 실시예에서, PoSS에서의 모든 정보 또는 일부 정보는 골드-시퀀스를 구성하는 2 개의 M-시퀀스 중 적어도 하나의 사이클릭 시프트 및 초기 조건 모두에 의해 전달될 수 있다. 일 실시예에서, ZC-시퀀스 기반 생성 방법. 이 방법에서는, 적어도 하나의 ZC-시퀀스가 PoSS를 생성하기 위한 베이스 시퀀스로 사용될 수 있으며, 여기서 ZC-시퀀스에 적용되는 적어도 하나의 추가 커버 코드가 있을 수 있 다(예를 들어, 더 많은 정보를 전달하기 위해 및/또는 무작위화 목적을 위해). 일 실시예에서, PoSS에서의 모 든 정보 또는 일부 정보는 PoSS를 생성하는 ZC-시퀀스의 루트에 의해 전달될 수 있다. 다른 실시예에서, PoSS 에서의 모든 정보 또는 일부 정보는 PoSS를 생성하는 ZC-시퀀스의 사이클릭 시프트에 의해 전달될 수 있다. 또 다른 실시예에서, PoSS에서의 모든 정보 또는 일부 정보는 PoSS를 생성하는 ZC-시퀀스의 위상 시프트에 의해 전 달될 수 있다. 또 다른 실시예에서, PoSS에서의 모든 정보 또는 일부 정보는 PoSS를 생성하는 ZC-시퀀스의 루 트, 사이클릭 시프트 및 위상 시프트 중 적어도 2 개의 조합에 의해 전달될 수 있다. 일부 실시예들에서, PoSS의 시퀀스 매핑 패턴은 사양에서 고정 및 미리 정의된다. 일 예에서, 시퀀스는 PoSS에 대한 모든 가용 RE에 대해 주파수 도메인 우선 및 시간 도메인 차선 패턴으로 매핑되며, 여기서 PoSS 시퀀스는 PoSS의 모든 심볼들에 대해 생성되고 매핑된다. 다른 예에서, 시퀀스는 PoSS에 대한 모든 가용 RE에 대해 시간 도메인 우선 및 주파수 도메인 차선 패턴으로 매 핑되며, 여기서 PoSS 시퀀스는 PoSS의 모든 심볼들에 대해 생성되고 매핑된다. 또 다른 예에서, 시퀀스는 PoSS에 대한 각 심볼 내의 모든 가용 RE에 대해 가장 낮은 값에서 가장 높은 값 순서 로 매핑되며, 여기서 PoSS 시퀀스는 심볼마다 생성되고 매핑된다. 또 다른 예에서, 시퀀스는 PoSS에 대한 각 심볼 내의 모든 가용 RE에 대해 가장 높은 값에서 가장 낮은 값 RE 순서로 매핑되며, 여기서 PoSS 시퀀스는 심볼마다 생성되고 매핑된다. 또 다른 예에서, PoSS 시퀀스는 주파수 도메인에서 불연속적으로 매핑된다. RB 레벨에서 매핑할 경우, PoSS 시 퀀스는 구성된 두 개의 인접한 M RB 리소스들 사이에 N^gap>=0 RB의 갭을 두고 모든 M>=1 연속 RB들에 매핑된다. 보다 구체적으로, PoSS 시퀀스는 인덱스 [x, x+1, …, x+M-1]을 사용하여 M 개의 연속 RB들에 매핑 되며, 여기서 mod(x, N^gap+M) = N^offset이고, 여기서 N^offset은 RB 개수 관점에서의 오프셋이며, N^offset<N^gap이다. 서브캐리어 레벨에서 매핑할 경우, PoSS 시퀀스는 구성된 두 개의 인접한 M 개의 서브캐 리어 리소스들 사이에 N^gap>=0 서브캐리어의 갭을 두고 모든 M>=1 연속 서브캐리어에 매핑된다. 보다 구체적 으로, PoSS 시퀀스는 인덱스 [x, x+1, …, x+M-1]을 사용하여 M 개의 연속 서브캐리어에 매핑되며, 여기서 mod(x, N^gap+M) = N^offset이고, 여기서 N^offset는 서브캐리어 개수 관점에서 오프셋이며, N^offset<N^gap이 다. 일 실시예에서, 두 개의 인접한 할당 주파수 리소스들 사이의 갭은 구성된 대역폭과 연관되어 스케일링될 수 있 다. 일 하위 예에서, N^gap = N^gap_0 + s^BW*M이며, 여기서 N^gap_0은 기준 대역폭에 대한 갭이고(예를 들면, N^gap_0 = 0), s^BW>=1은 기준 대역폭에 상대적인 PoSS 시퀀스에 대해 구성된 대역폭의 스칼라이다. 기 준 대역폭은 디폴트 활성 DL BWP의 대역폭 또는 초기 액세스 DL BWP의 대역폭일 수 있다. 다른 실시예에서, N^gap, M 및 N^offset은 미리 정의된 상수들일 수 있다. 하나의 하위 예에서, N^gap = 2의 서브캐리어들, N^offset = 0, M = 1의 서브캐리어이며, 여기서 PoSS 시퀀스는 연관된 대역폭 내의 모든 짝수 서 브캐리어를 차지한다. 다른 하위 예에서, N^gap = 2의 서브캐리어들, N^offset = 1, M = 1의 서브캐리어이며, 여기서 PoSS 시퀀스는 연관된 대역폭 내의 모든 홀수 서브캐리어를 차지한다. 또 다른 하위 예에서, N^gap = 4 의 서브캐리어들, M = 1의 서브캐리어이며, 여기서 PoSS 시퀀스는 구성된 대역폭 내의 4 개의 서브캐리어 중 하 나를 차지한다. 다른 실시예에서, PoSS의 시퀀스 매핑 패턴은 일부 정보를 전달할 수 있다. 일 예에서, 심볼 내 PoSS 시퀀스의 매핑 순서(예를 들어, 가장 낮은 값에서 가장 높은 값으로의 RE 또는 가장 높은 값에서 가장 낮은 값으로의 R E)가 PoSS에 의해 전달되는 일부 정보를 나타내기 위해 사용될 수 있다. 다른 예에서, 주파수 및 시간 도메인에서 PoSS의 매핑 순서(예를 들어, 주파수 도메인 우선 및 시간 도메인 차 선 또는 시간 도메인 우선 및 주파수 도메인 차선)가 PoSS에 의해 전달되는 일부 정보를 나타내기 위해 사용될 수 있다. 또 다른 예에서, PoSS가 심볼 내의 다른 신호/채널과 다중화하는 경우, 상이한 심볼들 내의 상이한 RE 위치(예 를 들어, 미리 정의된 또는 셀 특정 RE 시프트)가 PoSS에 의해 전달되는 일부 정보를 나타내기 위해 사용될 수 있다.또 다른 예에서, PoSS 시퀀스가 주파수 도메인에서 불연속적으로 매핑되는 경우, 갭(즉, N^gap) 및 오프셋(즉, N^offset)이 PoSS에 포함된 전달 정보를 전달할 수 있다. 하나의 하위 예에서, N^offset은 UE ID 관련 정보를 전달할 수 있으며, 이것은 Aspect 1의 Part 2에서의 I_ID^UE를 나타낸다. 상이한 UE 그룹 또는 UE들에 관한 PoSS는 인터레이스 주파수 분할 다중화(IFDMed)될 수 있다. 일 실시예에서, PoSS는 PN-시퀀스로 구성될 수 있으며, 여기서 PN-시퀀스는 길이가 2^31-1인 2 개의 M-시퀀스의 XOR에 의해 구성되는 QPSK 변조 시퀀스로 생성되고, 예를 들어 PN-시퀀스 s(n)은 s(n) = (1 - 2*((s_A(2n+Nc) + s_B(2n+Nc)) mod 2))/√2 + j*(1 - 2*((s_A(2n+Nc+1) + s_B(2n+Nc+1)) mod 2))/√2에 따라 생성되며 여기서 s_A의 생성자는 g_A(x) = x^31+x^3+1일 수 있고, s_B의 생성자는 g_B(x) = x^31+x^3+x^2+x+1일 수 있고, s_A의 초기 조건은 c_A=1로 고정되고, s_B, c_B의 초기 조건은 PoSS에서의 정보를 전달할 수 있으며, Nc는 출력 시프 트 오프셋이다(예를 들면, Nc=1600). 일 실시예에서는, PoSS 시퀀스가 ID만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부의 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실 시예에서는, 초기 조건 c_B가 c_B = b_PN*(I_ID+1)에 따라 결정될 수 있으며, 여기서 a_PN 및 b_PN은 미리 정 의된 상수 정수들이다. 다른 실시예에서, PoSS 시퀀스는 ID 및 타이밍 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(I_t+1) + c_PN*(I_ID+1) + d_PN*(I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN 및 d_PN은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 PoSS 포맷 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나 타낼 수 있으며, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(I_f +1) + c_PN*(I_ID+1) + d_PN*(I_f+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN 및 d_PN은 미리 정의된 상수 정수들 이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 시스템 정보/시스템 정보 업데이트 인디케이터의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 시스템 정보/시스템 정보 업데이트 인디케이터는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(I_s +1) + c_PN*(I_ID+1) + d_PN*(I_s+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN 및 d_PN은 미리 정의된 상수 정수들 이다. 또 다른 실시예에서, PoSS 시퀀스는 ID, 타이밍 관련 정보 및 PoSS 포맷 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있고, PoSS 포맷 관련 정보는 I_f를 나 타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(e_PN*I_ID+I_f+1)*(I_t+1) + c_PN*(e_PN*I_ID+I_f+1) + d_PN*(I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(e_PN*I_t+I_f+1) + c_PN*(I_ID+1) + d_PN*(e_PN*I_t+I_f+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의 된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(e_PN*I_f+I_t+1) + c_PN*(I_ID+1) + d_PN*(e_PN*I_f+I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정 의된 상수 정수들이다.또 다른 실시예에서, PoSS 시퀀스는 ID, 타이밍 관련 정보 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정 보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있고, 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(e_PN*I_ID+I_profile+1)*(I_t+1) + c_PN*(e_PN*I_ID+I_profile+1) + d_PN*(I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(e_PN*I_t+I_profile+1) + c_PN*(I_ID+1) + d_PN*(e_PN*I_t+I_profile+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(e_PN*I_profile+I_t+1) + c_PN*(I_ID+1) + d_PN*(e_PN*I_profile+I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID, 타이밍 관련 정보 및 슬립 타입 또는 전력 절감 상태 관련 정보의 조합 을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일 부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있고, 슬립 타 입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(e_PN*I_ID+I_sleep+1)*(I_t+1) + c_PN*(e_PN*I_ID+I_sleep+1) + d_PN*(I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(e_PN*I_t+I_sleep+1) + c_PN*(I_ID+1) + d_PN*(e_PN*I_t+I_sleep+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예 의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(e_PN*I_sleep+I_t+1) + c_PN*(I_ID+1) + d_PN*(e_PN*I_sleep+I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID, 타이밍 관련 정보 및 시스템 정보/시스템 정보 업데이트 인디케이터의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있고, 시스템 정보/시스템 정보 업데이트 인디케이터는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(e_PN*I_ID+I_s+1)*(I_t+1) + c_PN*(e_PN*I_ID+I_s+1) + d_PN*(I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의된 상수 정수들이다. 다른 예에서, 본 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(e_PN*I_t+I_s+1) + c_PN*(I_ID+1) + d_PN*(e_PN*I_t+I_s+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정의 된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(e_PN*I_s+I_t+1) + c_PN*(I_ID+1) + d_PN*(e_PN*I_s+I_t+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN, d_PN 및 e_PN은 미리 정 의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 PDCCH 모니터링 및 DRX에 대한 동적 재구성을 위한 일부 알려지지 않은 정 보를 전달할 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_conf+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN 및 b_PN은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 동적 재구성 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 동적 재구성 정보는 I_conf를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(I_conf+1) + c_PN*(I_ID+1) + d_PN*(I_conf+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN 및 d_PN은 미리 정의된 상수 정수들이다.또 다른 실시예에서, PoSS 시퀀스는 ID 및 DL/UL 방향 표시의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, DL/UL 방향 표시는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 초기 조건 c_B는 c_B = b_PN*(I_ID+1)*(I_SF+1) + c_PN*(I_ID+1) + d_PN*(I_SF+1) + a_PN에 따라 결정될 수 있으며, 여기서 a_PN, b_PN, c_PN 및 d_PN은 미리 정의된 상수 정수들이다. 일 실시예에서, PoSS는 QPSK 또는 BPSK 변조된 M-시퀀스로부터 구성될 수 있으며, 예를 들어 베이스 시퀀스 s(n)은, QPSK 변조되는 경우 s(n) =(1 - 2*s_M((2n+m_M) mod L_M))/√2 + j*(1 - 2*s_M(2n+1+m_M) mod L_M))/ √2에 따라 생성되며, 또는 BPSK 변조되는 경우 s(n) = 1 - 2*s_M((n+m_M) mod L_M)에 따라 생성될 수 있으며, 여기서 L_M은 M-시퀀스의 길이이고, m_M은 M-시퀀스에 적용되는 사이클릭 시프트이다. M-시퀀스 생성자를 g_M(x)로 표시하도록 하며, 이것은 시퀀스 길이 L_M에 따라 결정될 수 있고, 미리 정의된 초기 조건을 갖는다. 일 실시예에서, M-시퀀스의 길이, L_M과 관련하여, L_M은 PoSS 포맷에 의존할 수 있다. 예를 들어, 셀 특정, PF 특정 및 PO 특정 PoSS 포맷들의 경우, 공통 M-시퀀스 길이가 사용되며; 탐색 공간 특정 PoSS 포맷의 경우, 다른 M-시퀀스 길이가 사용된다. 다른 실시예에서, M-시퀀스의 길이, L_M과 관련하여, L_M은 PoSS 시퀀스가 구 성되고 심볼마다 매핑되는 경우, PoSS BW에 의존할 수 있다. 또 다른 실시예에서, M-시퀀스의 길이, L_M과 관 련하여, L_M은 PoSS 시퀀스가 구성되고 PoSS에 대한 모든 심볼(들)에 걸쳐 매핑되는 경우, PoSS에 대한 RE의 총 수에 의존할 수 있다. 또 다른 실시예에서, M-시퀀스의 길이 L_M과 관련하여, L_M은 지원되는 모든 PoSS 포맷 들, PoSS BW 및 RE들에 대해 공통일 수 있다. 일 실시예에서, M-시퀀스의 생성자, g_M(x) 및 M-시퀀스의 사이클릭 시프트, m_M과 관련하여, M-시퀀스의 생성 자만이 PoSS에서 정보를 전달하고, 사이클릭 시프트는 미리 정의될 수 있다(예를 들어, 각 생성자에 대하여 m_M = 0, 즉 사이클릭 시프트 없음). 다른 실시예에서, M-시퀀스의 생성자, g_M(x) 및 M-시퀀스의 사이클릭 시프트, m_M에 관해서, M-시퀀스의 사이 클릭 시프트만이 PoSS에서 정보를 전달하고, 생성자는 미리 정의될 수 있다. 또 다른 실시예에서, M-시퀀스의 생성자, g_M(x) 및 M-시퀀스의 사이클릭 시프트, m_M에 관하여, M-시퀀스 생성 자의 사이클릭 시프트는 모두 PoSS에서 정보의 일부를 전달할 수 있다. 일 실시예에서, PoSS 시퀀스는 ID만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 단일 생성자가 있을 수 있으며, m_M = b_M * I_ID + a_M이고, 여기서 a_M 및 b_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스들의 n_M개 생성자들이 있을 수 있으 며, 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_ID mod n_M = i에 대응하고, m_M = b_M* + a_M 이며, 여기서 a_M 및 b_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 다른 실시예에서, PoSS 시퀀스는 ID 및 타이밍 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 단일 생성자가 있을 수 있으며, m_M = b_M*(I_ID+1)*(I_t+1) + c_M*(I_ID+1) + d_M*(I_t+1) + a_M이고, 여기서 a_M, b_M, c_M 및 d_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스들의 n_M개 생성자들이 있을 수 있으며, 여기서 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_ID mod n_M = i에 대응하고, m_M = b_M*( +1)*(I_t+1) + c_M*( +1) + d_M*(I_t+1) + a_M이며, 여기서 a_M, b_M, c_M 및 d_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시퀀스들 의 N_t개 생성자들이 있을 수 있으며, 여기서 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_t mod N_t = i에 대응 하고, m_M = b_M * I_ID + a_M이며, 여기서 a_M 및 b_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 PoSS 포맷 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나 타낼 수 있으며, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 단 일 생성자가 있을 수 있으며, m_M = b_M*(I_ID+1)*(I_f+1) + c_M*(I_ID+1) + d_M*(I_f+1) + a_M이고, 여기서 a_M, b_M, c_M 및 d_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스들의 n_M개 생성자들이 있을 수 있으며, 여기서 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_ID mod n_M = i에 대응하고,m_M = b_M*( +1)*(I_f+1) + c_M*( +1) + d_M*(I_f+1) + a_M이며, 여기서 a_M, b_M, c_M 및 d_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시 퀀스들의 N_f개 생성자들이 있을 수 있으며, 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_f mod N_f = i에 대응 하고, m_M = b_M*I_ID + a_M이며, 여기서 a_M 및 b_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 시스템 정보/시스템 정보 업데이트 인디케이터의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또 는 이들의 조합을 나타낼 수 있으며, 시스템 정보/시스템 정보 업데이트 인디케이터는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 단일 생성자가 있을 수 있으며, m_M = b_M*(I_ID+1)*(I_s+1) + c_M*(I_ID+1) + d_M*(I_s+1) + a_M이고, 여기서 a_M, b_M, c_M 및 d_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스들의 n_M개 생성자들이 있을 수 있으며, 여기서 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_ID mod n_M = i에 대응하고, m_M = b_M*( +1)*(I_s+1) + c_M*( +1) + d_M*(I_s+1) + a_M이며, 여기서 a_M, b_M, c_M 및 d_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시퀀스들의 N_s개 생성자들이 있을 수 있으며, 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_s mod N_s = i에 대응하고, m_M = b_M*I_ID + a_M이며, 여기서 a_M 및 b_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어 도 하나 또는 이들의 조합을 나타낼 수 있으며, 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 단일 생성자가 있을 수 있으며, m_M = b_M*(I_ID+1)*(I_profile+1) + c_M*(I_ID+1) + d_M*(I_profile+1) + a_M이고, 여기서 a_M, b_M, c_M 및 d_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스들의 n_M개 생성자들이 있을 수 있으 며, 여기서 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_ID mod n_M = i에 대응하고, m_M = b_M*( +1)*(I_profile+1) + c_M*( +1) + d_M*(I_profile+1) + a_M이며, 여기서 a_M, b_M, c_M 및 d_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시퀀스들의 N_s개 생성자들이 있을 수 있으며, 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_profile mod N_s = i에 대응하고, m_M = b_M*I_ID + a_M이며, 여기서 a_M 및 b_M은 각 생성자에 대해 미리 정의된 상수 정수들이 다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보의 조합을 전달할 수 있으 며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중의 적어도 일 부 또는 이들의 조합을 나타낼 수 있으며, 슬립 타입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있 다. 일 예에서, 이 실시예의 경우, M-시퀀스의 단일 생성자가 있을 수 있으며, m_M = b_M*(I_ID+1)*(I_sleep+1) + c_M*(I_ID+1) + d_M*(I_sleep+1) + a_M이고, 여기서 a_M, b_M, c_M 및 d_M은 미 리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스들의 n_M개 생성자들이 있을 수 있으며, 여기서 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_ID mod n_M = i에 대응하고, m_M = b_M*( +1)*(I_sleep+1) + c_M*( +1) + d_M*(I_sleep+1) + a_M이며, 여기서 a_M, b_M, c_M 및 d_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시퀀스들의 N_s개 생성자들이 있을 수 있으며, 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_sleep mod N_s = i에 대응하고, m_M = b_M*I_ID + a_M이며, 여기서 a_M 및 b_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 PDCCH 모니터링 및 DRX에 대한 동적 재구성을 위한 일부 알려지지 않은 정 보를 전달할 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 단일 생성자가 있을 수 있으며, m_M = b_M*I_conf + a_M이고, 여기서 a_M 및 b_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스들의 N_conf개 생성자들이 있을 수 있으며, 여기서 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_conf mod N_conf = i에 대응하고, N_conf는 I_conf의 크기이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 재구성 스칼라들의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼수 있으며, 동적 재구성 정보는 I_conf를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스들의 n_M개 생성자들이 있을 수 있으며, 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_ID mod n_M = i에 대응하고, m_M = c_M* + b_M*I_conf + a_M이며, 여기서 a_M, b_M, c_M 및 d_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시퀀스들의 N_conf개 생성자들이 있을 수 있으며, 인 덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_conf mod N_conf = i에 대응하고, m_M = b_M*I_ID + a_M이며, 여기서 a_M 및 b_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 DL/UL 방향 표시의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, DL/UL 방향 표시는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스들의 n_M개 생 성자들이 있을 수 있으며, 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_ID mod n_M = i에 대응하고, m_M = c_M* + b_M*I_SF + a_M이며, 여기서 a_M, b_M, c_M 및 d_M은 각 생성자에 대해 미리 정의된 상 수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시퀀스들의 N_SF개 생성자들이 있을 수 있으며, 여기서 인덱스 i를 갖는 각 생성자 g_{M,i}(x)는 I_SF mod N_SF = i에 대응하고, m_M = b_M*I_ID + a_M이며, 여기서 a_M 및 b_M은 각 생성자에 대해 미리 정의된 상수 정수들이다. 일부 실시예들에서, PoSS는 인터리빙된 시퀀스들 s_1(m) 및 s_2(m)로부터 구성될 수 있으며, 여기서 s_1(m) 및 s_2(m)은 모두 M-시퀀스(들)로부터 생성되고, 예를 들어, PoSS에 대한 베이스 시퀀스, s(n)은 s(2*m) = s_1(m), 및 s(2*m+1) = s_2(m)에 따라 생성될 수 있고, 여기서 s_1(m) = 1 - 2*s_M1((m+m_M1) mod L_M), s_2(m) = 1 - 2*s_M2((m+m_M2) mod L_M)이고, s_M1(m) 및 s_M2(m)은 길이가 L_M인 M-시퀀스들이고, 사이클릭 시프트들 m_M1 및 m_M2가 각각 s_M1(m) 및 s_M2(m)에 적용된다. 일 실시예에서, s_M1(m) 및 s_M2(m)에 대한 생성자들이 동일할 수 있으며, 즉, PoSS를 생성할 때 동일한 베이스 M-시퀀스를 사용하지만, 서로 다른 사이클릭 시프트들 m_M1 및 m_M2를 갖는다. 다른 실시예에서는, s_M1(m) 및 s_M2(m)에 대한 생성자들이 상이할 수 있다. 일 실시예에서, M-시퀀스들의 길이 L_M과 관련하여, L_M은 PoSS 포맷에 의존할 수 있다. 예를 들어, 셀 특정, PF 특정 및 PO 특정 PoSS 포맷들의 경우, 공통 M-시퀀스 길이가 사용되며; 탐색 공간 특정 PoSS 포맷의 경우, 다른 M-시퀀스 길이가 사용된다. 다른 실시예에서, M-시퀀스의 길이 L_M과 관련하여, L_M은 PoSS 시퀀스가 구성되어 심볼마다 매핑되는 경우, PoSS BW에 의존할 수 있다. 또 다른 실시예에서, M-시퀀스들의 길이 L_M과 관련하여, L_M은 PoSS 시퀀스가 구성되어 PoSS에 대한 모든 심볼 (들)에 걸쳐 매핑되는 경우, PoSS에 대한 RE의 총 수에 의존할 수 있다. 또 다른 실시예에서, M-시퀀스들의 길이 L_M과 관련하여, L_M은 지원되는 모든 PoSS 포맷들, PoSS BW 및 RE들에 대해 공통일 수 있다. 일 실시예에서, PoSS 시퀀스는 ID만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID의 일부를 나타낼 수 있으며, m_M1 = b_M*(I_ID mod c_M) + a_M, m_M2 = d_M* +e_M이고, 여기서 a_M, b_M, c_M, d_M 및 e_M은 미리 정의된 상수 정수들이 다(예를 들면, a_M = 0, b_M = 1, c_M = L_M). 다른 실시예에서, PoSS 시퀀스는 ID 및 타이밍 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 두 사이클릭 시프트를 사용하여 ID 및 타이밍 관련 정보를 나타낼 수 있으며, m_M1 = b_M*([ +1)*(I_t+1) + c_M*( +1) + d_M*(I_t+1) + a_M, m_M2 = f_M*(I_ID mod e_M) + h_M이고, 여기서 a_M, b_M, c_M, d_M, e_M, f_M 및 h_M은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 PoSS 포맷 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시 프트를 사용하여 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_M1 = b_M*( +1)*(I_f+1) + c_M*( +1) + d_M*(I_f+1) + a_M, m_M2 = f_M*(I_ID mod e_M) + h_M이고, 여기서 a_M, b_M, c_M, d_M, e_M, f_M 및 h_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시 프트를 사용하여 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_M1 = c_M* + b_M*I_f + a_M, m_M2 = d_M*(I_ID mod e_M) + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수 들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 PoSS 포맷 관련 정보를 나 타낼 수 있으며, m_M1 = c_M*(I_ID mod e_M) + b_M*I_f + a_M, m_M2 = d_M* + f_M이고, 여기 서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 또 다른 실시 예에서, PoSS 시퀀스는 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보의 조합을 전달 할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적 어도 하나 또는 이들의 조합을 나타낼 수 있으며, 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타낼 수 있으며, m_M1 = b_M*( +1)*(I_profile+1) + c_M*( +1) + d_M*(I_profile+1) + a_M, m_M2 = f_M*(I_ID mod e_M) + h_M이고, 여기서 a_M, b_M, c_M, d_M, e_M, f_M 및 h_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 두 사이클 릭 시프트를 사용하여 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타낼 수 있으며, m_M1 = c_M* + b_M*I_profile + a_M, m_M2 = d_M*(I_ID mod e_M) + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타낼 수 있으며, m_M1 = c_M*(I_ID mod e_M) + b_M*I_profile + a_M, m_M2 = d_M* + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보의 조합을 전달할 수 있으 며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 슬립 타입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보 를 나타낼 수 있으며, m_M1 = b_M*( +1)*(I_sleep+1) + c_M*( +1) + d_M*(I_sleep+1) + a_M, m_M2 = f_M*(I_ID mod e_M) + h_M이고, 여기서 a_M, b_M, c_M, d_M, e_M, f_M 및 h_M 은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있으며, m_M1 = c_M* + b_M*I_sleep + a_M, m_M2 = d_M*(I_ID mod e_M) + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이 다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있으며, m_M1 = c_M*(I_ID mod e_M) + b_M*I_profile + a_M, m_M2 = d_M* + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 시스템 정보/시스템 정보 업데이트 인디케이터의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 시스템 정보/시스템 정보 업데이트 인디케이터는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_M1 = b_M*( +1)*(I_s+1) + c_M*( +1) + d_M*(I_s+1) + a_M, m_M2 = f_M*(I_ID mod e_M) + h_M이고, 여기서 a_M, b_M, c_M, d_M, e_M, f_M 및 h_M은 미리 정의된 상수 정수 들이다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 시스템 정보 관련 정보를 나타 낼 수 있으며, m_M1 = c_M* + b_M*I_s + a_M, m_M2 = d_M*(I_ID mod e_M) + f_M이고, 여기서a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이 클릭 시프트를 사용하여 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_M1 = c_M*(I_ID mod e_M) + b_M*I_s + a_M, m_M2 = d_M* + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의 된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 PDCCH 모니터링 및 DRX에 대한 동적 재구성을 위한 일부 알려지지 않은 정 보를 전달할 수 있다. 일 예에서, 이 실시예의 경우, 사이클릭 시프트 중 하나만을 사용하여 재구성 스칼라를 전달할 수 있으며, m_M1 = b_M*I_conf + a_M, m_M2 = c_M이고, 여기서 a_M, b_M, c_M은 미리 정의된 상수 정수 들이다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 재구성 스칼라를 전달할 수 있으며, m_M1 = b_G*(I_conf mod c_G) + a_G, m_M2 = d_G* +e_G이고, 여기서 a_G, b_G, c_G, d_G, 및 e_G는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 동적 재구성 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나 타낼 수 있으며, 동적 재구성 정보는 I_conf를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시 프트를 사용하여 ID 및 재구성 스칼라를 나타낼 수 있으며, m_M1 = c_M* + b_M*I_conf + a_M, m_M2 = d_M*(I_ID mod e_M) + f_M이고, 여기서 a_M , b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이 다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 재구성 스칼라를 나타낼 수 있으며, m_M1 = c_M*(I_ID mod e_M) + b_M*I_conf + a_M, m_M2 = d_M* + f_M이고, 여기서 a_M , b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 DL/UL 방향 표시의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, DL/UL 방향 표시는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 DL/UL 방향 관련 정보를 나타낼 수 있으며, m_M1 = c_M* + b_M*I_SF + a_M, m_M2 = d_M*(I_ID mod e_M) + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이 다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 DL/UL 방향 관련 정보를 나타낼 수 있으며, m_M1 = c_M*(I_ID mod e_M) + b_M*I_SF + a_M, m_M2 = d_M* + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 일부 실시예들에서, PoSS는 QPSK 또는 BPSK 변조된 골드-시퀀스로부터 구성될 수 있으며, 예를 들어, 베이스 시 퀀스 s(n)은 QPSK 변조되는 경우, s(n) =(1 - 2*((s_M1((2n+m_M1) mod L_G) + s_M2((2n+m_M2) mod L_G)) mod 2))/√2+ j*(1 - 2*((s_M1((2n+1+m_M1) mod L_G) + s_M2((2n+1+m_M2) mod L_G)) mod 2))/√2에 따라 생성될 수 있으며, 또는 BPSK 변조되는 경우 s(n) = 1 - 2*((s_M1((n+m_M1) mod L_G) + s_M2((n+m_M2) mod L_G)) mod 2)에 따라 생성될 수 있으며, 여기서 L_G는 골드-시퀀스의 길이이고, m_M1 및 m_M2는 골드-시퀀스를 구성하는 두 개의 M-시퀀스 각각에 적용되는 사이클릭 시프트들이다. 골드-시퀀스를 두 개의 M-시퀀스의 생성자를 각각 g_M1(x) 및 g_M2(x)로 표시하도록 하며, 이것은 시퀀스 길이 L_G에 따라 결정될 수 있으며, 각 M-시퀀스에 대해 미리 정의된 초기 조건을 갖는다. 일 실시예에서, 골드-시퀀스의 길이 L_G와 관련하여, L_G는 PoSS 포맷에 의존할 수 있다. 예를 들어, 셀 특정, PF 특정 및 PO 특정 PoSS 포맷들의 경우, 공통 골드-시퀀스 길이가 사용되며; 탐색 공간 특정 PoSS 포맷의 경우, 다른 골드-시퀀스 길이가 사용된다. 다른 실시예에서, 골드-시퀀스의 길이 L_G와 관련하여, L_G는 PoSS 시퀀스가 구성되어 심볼마다 매핑되는 경우, PoSS BW에 의존할 수 있다. 또 다른 실시예에서, 골드-시퀀스의 길이 L_G와 관련하여, L_G는 PoSS 시퀀스가 구성되어 PoSS에 대한 모든 심 볼(들)에 걸쳐 매핑되는 경우, PoSS에 대한 RE의 총 수에 의존할 수 있다. 또 다른 실시예에서, 골드-시퀀스의 길이 L_G와 관련하여, L_G는 지원되는 모든 PoSS 포맷들, PoSS BW 및 RE들 에 대해 공통일 수 있다. 일 실시예에서, 골드-시퀀스의 사이클릭 시프트들 m_M1 및 m_M2와 관련하여, 사이클릭 시프트들 중 하나만을 사 용하여 PoSS에서 정보를 전달하고(예를 들어, m_M1), 다른 사이클릭 시프트는 고정된다(예를 들어, m_M2 = 0, 즉, 사이클릭 시프트 없음). 다른 실시예에서, 골드-시퀀스의 사이클릭 시프트들 m_M1 및 m_M2과 관련하여, 골드-시퀀스의 두 사이클릭 시프 트가 모두 PoSS에서 정보의 일부를 전달할 수 있다. 일 실시예에서, PoSS 시퀀스는 ID만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나를 사용하여 ID를 나타낼 수 있으며, m_M1 = b_G*I_ID+ a_G이고, 여 기서 a_G 및 b_G는 미리 정의된 상수 정수들이며, 예를 들면, b_G = 이다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID의 일부를 나타낼 수 있으며, m_M1 = b_G*(I_ID mod c_G) + a_G, m_M2 = d_G* +e_G이고, 여기서 a_G, b_G, c_G, d_G 및 e_G는 미리 정의된 상수 정수들이 며, 예를 들면, a_G = 0, b_G = 1, c_G = L_G이다. 다른 실시예에서, PoSS 시퀀스는 ID 및 타이밍 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나 를 사용하여 ID 및 타이밍 관련 정보를 나타낼 수 있으며, m_M1 = b_G*(I_ID+1)*(I_t+1) + c_G*(I_ID+1) + d_G*(I_t+1) + a_G이고, 여기서 a_G, b_G, c_G 및 d_G는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시 예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 타이밍 관련 정보를 나타낼 수 있으며, m_M1 = b_G*( +1)*(I_t+1) + c_G*( +1) + d_G*(I_t+1) + a_G, m_M2 = f_G*(I_ID mod e_G) + h_G이고, 여기서 a_G, b_G, c_G, d_G, e_G, f_G 및 h_G는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 PoSS 포맷 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나 타낼 수 있으며, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 사이클릭 시프 트들 중 하나를 사용하여 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_M1 = b_G*(I_ID+1)*(I_f+1) + c_G*(I_ID+1) + d_G*(I_f+1) + a_G이고, 여기서 a_G, b_G, c_G 및 d_G는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나를 사용하여 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있 으며, m_M1 = c_G*I_ID + b_G*I_f + a_G이고, 여기서 a_G, b_G 및 c_G는 미리 정의된 상수 정수들이다. 또 다 른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_M1 = b_G*( +1)*(I_f+1) + c_G*( +1) + d_G*(I_f+1) + a_G, m_M2 = f_G*(I_ID mod e_G) + h_G이고, 여기서 a_G, b_G, c_G, d_G, e_G, f_G 및 h_G는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있 으며, m_M1 = c_G* + b_G*I_f + a_G, m_M2 = d_G*(I_ID mod e_G) + f_G이고, 여기서 a_G, b_G, c_G, d_G, e_G 및 f_G는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프 트를 사용하여 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_M1 = c_G*(I_ID mod e_G) + b_G*I_f + a_G, m_M2 = d_G* + f_G이고, 여기서 a_G, b_G, c_G, d_G, e_G 및 f_G는 미리 정의된 상수 정수들 이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 시스템 정보/시스템 정보 업데이트 인디케이터의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 시스템 정보/시스템 정보 업데이트 인디케이터는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나를 사용하여 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_M1 = b_G*(I_ID+1)*(I_s+1) + c_G*(I_ID+1) + d_G*(I_s+1) + a_G이고, 여기서 a_G, b_G, c_G 및 d_G는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나를 사 용하여 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_M1 = c_G*I_ID + b_G*I_s + a_G, where a_G, b_G 이고, 여기서 a_G, b_G 및 c_G는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클 릭 시프트를 사용하여 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_M1 = b_G*( +1)*(I_s+1) + c_G*( +1) + d_G*(I_s+1) + a_G, m_M2 = f_G*(I_ID mode_G) + h_G이고, 여기서 a_G, b_G, c_G, d_G, e_G, f_G 및 h_G는 미리 정의된 상수 정수들이다. 또 다른 예에 서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_M1 = c_G* + b_G*I_s + a_G, m_M2 = d_G*(I_ID mod e_G) + f_G이고, 여기서 a_G, b_G, c_G, d_G, e_G 및 f_G는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하 여 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_M1 = c_G*(I_ID mod e_G) + b_G*I_s + a_G, m_M2 = d_G* + f_G이고, 여기서 a_G, b_G, c_G, d_G, e_G 및 f_G는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어 도 하나 또는 이들의 조합을 나타낼 수 있으며, 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나를 사용하여 ID 및 전 력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타낼 수 있으며, m_M1 = b_G*(I_ID+1)*(I_profile+1) + c_G*(I_ID+1) + d_G*(I_profile+1) + a_G이고, 여기서 a_G, b_G, c_G 및 d_G는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나를 사용하여 ID 및 전력 소모 프로파일/UE 적응 구 성 테이블 관련 정보를 나타낼 수 있으며, m_M1 = c_G*I_ID + b_G*I_profile + a_G이고, 여기서 a_G, b_G, c_G 는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타낼 수 있으며, m_M1 = b_G*( +1)*(I_profile+1) + c_G*( +1) + d_G*(I_profile+1) + a_G, m_M2 = f_G*(I_ID mod e_G) + h_G이고, 여기서 a_G, b_G, c_G, d_G, e_G, f_G 및 h_G는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 시스템 정보 관련 정보 전력 소모 프 로파일/UE 적응 구성 테이블 관련 정보를 나타낼 수 있으며, m_M1 = c_G* + b_G*I_profile + a_G, m_M2 = d_G*(I_ID mod e_G) + f_G이고, 여기서 a_G, b_G, c_G, d_G, e_G 및 f_G는 미리 정의된 상수 정수 들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 시스템 정보 관련 정보 전 력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타낼 수 있으며, m_M1 = c_G*(I_ID mod e_G) + b_G*I_profile + a_G, m_M2 = d_G* + f_G이고, 여기서 a_G, b_G, c_G, d_G, e_G 및 f_G는 미 리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보의 조합을 전달할 수 있으 며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 슬립 타입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나를 사용하여 ID 및 슬립 타입 또는 전력 절감 상태 관 련 정보를 나타낼 수 있으며, m_M1 = b_G*(I_ID+1)*(I_sleep+1) + c_G*(I_ID+1) + d_G*(I_sleep+1) + a_G이고, 여기서 a_G, b_G, c_G 및 d_G는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 사이클릭 시프 트들 중 하나를 사용하여 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있으며, m_M1 = c_G*I_ID + b_G*I_sleep + a_G이고, 여기서 a_G, b_G 및 c_G 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있으며, m_M1 = b_G*( +1)*(I_sleep+1) + c_G*( +1) + d_G*(I_sleep+1) + a_G, m_M2 = f_G*(I_ID mod e_G) + h_G이고, 여기서 a_G, b_G, c_G, d_G, e_G, f_G 및 h_G는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있으며, m_M1 = c_G* + b_G*I_sleep + a_G, m_M2 = d_G*(I_ID mod e_G) + f_G이고, 여기서 a_G, b_G, c_G, d_G, e_G 및 f_G는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 슬립 타입 또는 전력 절감 상태 관련 정 보를 나타낼 수 있으며, m_M1 = c_G*(I_ID mod e_G) + b_G*I_sleep + a_G, m_M2 = d_G* + f_G 이고, 여기서 a_G, b_G, c_G, d_G, e_G 및 f_G는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 PDCCH 모니터링 및 DRX에 대한 동적 재구성을 위한 일부 알려지지 않은 정 보를 전달할 수 있다. 일 예에서, 이 실시예의 경우, 사이클릭 시프트들 중 하나만을 사용하여 재구성 스칼라 를 전달하며, m_M1 = b_M*I_conf + a_M, m_M2 = c_M이고, 여기서 a_M, b_M, c_M은 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 재구성 스칼라를 전달할 수 있으며, m_M1 = b_G*(I_conf mod c_G) + a_G, m_M2 = d_G* +e_G이고, 여기서 a_G, b_G, c_G, d_G, 및 e_G는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 동적 재구성 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나 타낼 수 있으며, 동적 재구성 정보는 I_conf를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시 프트를 사용하여 ID 및 재구성 스칼라를 나타낼 수 있으며, m_M1 = c_M* + b_M*I_conf + a_M, m_M2 = d_M*(I_ID mod e_M) + f_M이고, 여기서 a_M , b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이 다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 재구성 스칼라를 나타낼 수 있으며, m_M1 = c_M*(I_ID mod e_M) + b_M*I_conf + a_M, m_M2 = d_M* + f_M이고, 여기서 a_M , b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 DL/UL 방향 표시의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, DL/UL 방향 표시는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 DL/UL 방향 관련 정보를 나타낼 수 있으며, m_M1 = c_M* + b_M*I_SF + a_M, m_M2 = d_M*(I_ID mod e_M) + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이 다. 다른 예에서, 이 실시예의 경우, 두 사이클릭 시프트를 사용하여 ID 및 DL/UL 방향 관련 정보를 나타낼 수 있으며, m_M1 = c_M*(I_ID mod e_M) + b_M*I_SF + a_M, m_M2 = d_M* + f_M이고, 여기서 a_M, b_M, c_M, d_M, e_M 및 f_M은 미리 정의된 상수 정수들이다. 일부 실시예들에서, PoSS는 ZC-시퀀스에 기초하여 구성될 수 있으며, 예를 들어 PoSS를 구성하는 시퀀스 s(n)은 s(n) = c(m)*exp(-j*2*π*θ*n)*exp(-j*π*u*n'*(n'+1))/L_ZC), n = 0,…, L_ZC - 1에 따라 생성될 수 있으며, 여기서 c(m)는 잠재적 커버 코드이고, θ는 ZC-시퀀스의 잠재적 위상 시프트이고, m_ZC는 ZC-시퀀스의 잠재적 사이클릭 시프트이고, u는 ZC-시퀀스의 루트이며, n' = (n + m_ZC) mod L_ZC, m = n mod L_c이고, 여기서 L_ZC 는 ZC-시퀀스의 길이이고, L_c는 커버 코드 c(m)의 길이이다. 일 실시예에서, ZC-시퀀스의 길이 L_ZC와 관련하여, L_ZC는 PoSS 포맷에 의존할 수 있다. 예를 들어, 셀 특정, PF 특정 및 PO 특정 PoSS 포맷들의 경우, 공통 M-시퀀스 길이가 사용되며; 탐색 공간 특정 PoSS 포맷의 경우, 다른 M-시퀀스 길이가 사용된다. 다른 실시예에서, ZC-시퀀스의 길이 L_ZC와 관련하여, L_ZC는 PoSS 시퀀스가 구성되어 심볼마다 매핑되는 경우 PoSS BW에 의존할 수 있다. 일 예에서, PoSS BW가 6 PRB인 경우, L_ZC = 71이다. 다른 예에서, PoSS BW가 12 PRB인 경우, L_ZC = 139이다. 또 다른 실시예에서, ZC-시퀀스의 길이 L_ZC와 관련하여, L_ZC는 PoSS 시퀀스가 구성되어 PoSS에 대한 모든 심 볼(들)에 걸쳐 매핑되는 경우, PoSS에 대한 RE의 총 수에 의존할 수 있다. 또 다른 실시예에서, ZC-시퀀스의 길이 L_ZC와 관련하여, L_ZC는 지원되는 모든 PoSS 포맷들, PoSS BW 및 RE들 에 대해 공통일 수 있다. 일 실시예에서, PoSS에서 전달되는 정보에 관하여, ZC-시퀀스는 UE ID 관련 정보를 전달하고, 커버 코드는 셀 ID 및 타이밍 관련 정보를 전달한다. 동일한 셀에 있는 서로 다른 UE들 또는 서로 다른 UE 그룹에 연관된 여러 PoSS 시퀀스들이 동시에 송신될 수 있으며, 즉 CDM될 수 있다. 하나의 하위 실시예에서는, 모든 m에 대해 c(m) = 1이며, 즉 커버 코드가 없다. 일 실시예에서, ZC-시퀀스의 루트 u 및/또는 위상 시프트 θ는 PoSS를 생성하고 PoSS에서 정보를 전달하기 위해 사용되며, ZC-시퀀스의 사이클릭 시프트 m_ZC는 0으로 고정된다(즉, 사이클릭 시프트 없음). 다른 실시예에서, ZC-시퀀스의 루트 u 및/또는 사이클릭 시프트 m_ZC는 PoSS를 생성하고 PoSS에서 정보를 전달 하기 위해 사용되며, ZC-시퀀스의 위상 시프트 θ는 0으로 고정된다(즉, 위상 시프트 없음). 일 실시예에서, PoSS 시퀀스는 ID만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC에 따라 결정될 수 있고, 여기서 a_ZC 및 b_ZC는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC 및 θ = /d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이 다. 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 ID를 전달하기 위해 사용 될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC + e_ZC에 따라 결정될 수 있 고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC 및 e_ZC는 미리 정의된 상수 정수들이다. 다른 실시예에서, PoSS 시퀀스는 ID 및 타이밍 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전 달하기 위해 사용될 수 있고, 위상 시프트 θ는 타이밍 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 θ = I_t/c_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC 및 c_ZC는 미리 정의된 상수 정수들이다. 다른 예에서, 본 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 사이클 릭 시프트 m_ZC는 타이밍 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 m_ZC = c_ZC*I_t+d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 타이밍 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =( +1)(I_t+1)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시 예의 경우, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 ID 및 타이밍 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC*( +1)(I_t+1)+e_ZC*( +1)+f_ZC*(I_t+1)+g_ZC에 따라 결정될 수 있고, 여 기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 PoSS 포맷 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나 타낼 수 있으며, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u 만이 ID를 전달하기 위해 사용될 수 있고, 위상 시프트 θ는 PoSS 포맷 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 θ = I_f/c_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC 및 c_ZC는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 사이클릭 시프트 m_ZC는 PoSS 포맷 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 m_ZC = c_ZC*I_f+d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수 들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 PoSS 포맷 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =( +1)(I_f+1)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 PoSS 포 맷 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =(e_ZC* +f_ZC*I_f+g_ZC)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 ID 및 PoSS 포맷 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC*( +1)(I_f+1)+e_ZC*( +1)+f_ZC*(I_f+1)+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다 른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 PoSS 포맷 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ = e_ZC* +f_ZC*I_f+g_ZC에 따라 결정될 수 있으며, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC 및 f_ZC는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어 도 하나 또는 이들의 조합을 나타낼 수 있으며, 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있으며, 위상 시프트 θ는 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타내기 위해 사용될 수 있으 며, u = b_ZC*I_ID + a_ZC, 및 θ = I_profile/c_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC 및 c_ZC는 미 리 정의된 상수 정수들이다. 다른 예에서, 본 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 사이클릭 시프트 m_ZC는 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 m_ZC = c_ZC*I_profile+d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위 상 시프트 θ 모두가 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 전달하기 위해 사용될 수 있 으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =( +1)(I_profile+1)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =(e_ZC* +f_ZC*I_profile+g_ZC)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 사 이클릭 시프트 m_ZC 모두가 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC*( +1)(I_profile+1)+e_ZC*( +1)+f_ZC*(I_profile+1)+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC, 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예 에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 전력 소모 프로파일/UE 적응 구성 테 이블 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ = e_ZC* +f_ZC*I_profile+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC 및 f_ZC는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보의 조합을 전달할 수 있으 며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있고, 슬립 타입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있다. 일 예에서, 본 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있으며, 위상 시프트 θ는 슬 립 타입 또는 전력 절감 상태 관련 정보를 나타내기 위해 사용될 수 있고, u = b_ZC*I_ID + a_ZC, 및 θ = I_sleep/c_ZC, where a_ZC, b_ZC에 따라 결정될 수 있으며, 여기서 a_ZC, b_ZC 및 c_ZC는 미리 정의된 상수 정 수들이다. 다른 예에서, 본 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 사이클릭 시프트 m_ZC는 슬립 타입 또는 전력 절감 상태 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 m_ZC = c_ZC*I_sleep+d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 슬립 타 입 또는 전력 절감 상태 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =( +1)(I_sleep+1)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =(e_ZC* +f_ZC*I_sleep+g_ZC)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인 덱스 u 및 사이클릭 시프트 m_ZC 모두가 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 전달하기 위해 사용 될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC*( +1)(I_f+1)+e_ZC*( +1)+f_ZC*(I_sleep+1)+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실 시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 전달 하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =e_ZC* +f_ZC*I_sleep+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC 및 f_ZC는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 PDCCH 모니터링 및 DRX에 대한 동적 재구성을 위한 일부 알려지지 않은 정 보를 전달할 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u만이 재구성 스칼라를 전달하기 위해 사용 될 수 있고, u = b_ZC*I_conf + a_ZC에 따라 결정될 수 있으며, 여기서 a_ZC 및 b_ZC는 미리 정의된 상수 정수 들이다. 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 I_conf를 전달하기 위해 사 용될 수 있으며, u = b_ZC*(I_conf mod c_ZC) + a_ZC, 및 θ = /d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 I_conf를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_conf mod c_ZC) + a_ZC, 및 m_ZC = d_ZC* + e_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC 및 e_ZC는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 동적 재구성 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 동적 재구성 정보는 I_conf를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 위상 시프트 θ는 재구성 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 θ = I_conf/c_ZC, 여기서 a_ZC, b_ZC 및 c_ZC는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 사이클릭 시프트 m_ZC는 재 구성 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 m_ZC = c_ZC*I_conf+d_ZC에 따 라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실 시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 재구성 관련 정보를 전달하기 위해 사용될 수 있 으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =( +1)(I_conf+1)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 ID 및 재구성 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC*( +1)(I_conf+1)+e_ZC*( +1)+f_ZC*(I_conf+1)+g_ZC에 따라 결정될 수 있 고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 DL/UL 방향 표시의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있고, DL/UL 방향 표시는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 위상 시프트 θ는 DL/UL 방향 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 θ = I_SF/c_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC 및 c_ZC는 미리 정의된 상 수 정수들이다. 다른 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 사이 클릭 시프트 m_ZC는 DL/UL 방향 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 m_ZC = c_ZC*I_SF+d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 DL/UL 방향 관련 정보를 전 달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =( +1)(I_SF+1)/d_ZC 에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 ID 및 DL/UL 방향 관련 정보를 전달하기 위 해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC*( +1)(I_SF+1)+e_ZC*( +1)+f_ZC*(I_SF+1)+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 UE ID 관련 정보 I_ID^UE 및 재구성 관련 정보 I_conf = 0,…, N_conf-1을 전달하기 위해 사용될 수 있다. 보다 구체적으로 m_ZC = mod(I_ID^UE, a_ZC), 여기서 a_ZC, b_ZC, c_ZC, u0은 미리 정의된 상수들이다. 일 예에서, a_ZC = N_ZC, b_zc = ceil((N_ZC-1)/N_conf), c_zc = 1, 및 u0 = floor((N_ZC - 1 - N_conf* )/2)이다. 다른 예에서, a_ZC = N_ZC, b_zc = ceil((N_ZC-1)/N_conf), c_zc = 0, 및 u0 = floor((N_ZC - 1 - N_conf)/ 2)이다. 또 다른 실시예에서, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 UE ID 관련 정보 I_ID^UE 및 PDCCH 타겟 관련 정보 I_tgt를 전달하기 위해 사용될 수 있다. 보다 구체적으로, m_ZC = mod(I_ID^UE, a_ZC),"}
{"patent_id": "10-2020-7027498", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "I^d_tgt = 는 크기가 N_tgt인 비트맵 I_tgt의 10 진수 값이며, 여기서 a_ZC, b_ZC, c_ZC, u0은 미리 정의된 상수들이다. 예를 들어, a_ZC = N_ZC, b_zc = ceil((N_ZC-1)/N_tgt), , c_zc = 1, 및 u0 = floor((N_ZC - 1 - N_tgt* )/2)이다. 또 다른 실시예에서, PoSS 시퀀스는 ID 및 시스템 정보 관련 정보의 조합을 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조 합을 나타낼 수 있으며, 시스템 정보 관련 정보는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 위상 시프트 θ는 시스템 정보 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 θ = I_s/c_ZC에 따라 결정될 수 있으며, 여기서 a_ZC, b_ZC 및 c_ZC는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 사이클릭 시프트 m_ZC는 시스템 정보 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 m_ZC = c_ZC*I_s+d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 시스템 정보 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =( +1)(I_s+1)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 시스템 정보 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =(e_ZC* +f_ZC*I_s+g_ZC)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 사이클릭 시프트 m_ZC 모두가 ID 및 시스템 정보 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC*( +1)(I_s+1)+e_ZC*( +1)+f_ZC*(I_s+1)+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 시스템 정보 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ = e_ZC* +f_ZC*I_s+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC 및 f_ZC 는 미리 정의된 상수 정수들이다.또 다른 실시예에서, PoSS 시퀀스는 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부의 조합 을 전달할 수 있으며, DL/UL 방향 표시는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 위상 시프트 θ는 DL/UL 방향 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 θ = I_SF/c_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC 및 c_ZC는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 루트 인덱스 u만이 ID를 전달하기 위해 사용될 수 있고, 사이클릭 시프트 m_ZC는 DL/UL 방향 관련 정보를 나타내기 위해 사용될 수 있으며, u = b_ZC*I_ID + a_ZC, 및 m_ZC = c_ZC*I_SF+d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상 수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 DL/UL 방 향 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =( +1)(I_SF+1)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC 및 d_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 DL/UL 방향 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ =(e_ZC* +f_ZC*I_SF+g_ZC)/d_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, 루트 인덱스 u 및 사 이클릭 시프트 m_ZC 모두가 ID 및 DL/UL 방향 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 m_ZC = d_ZC*( +1)(I_SF+1)+e_ZC*( +1)+f_ZC*(I_s+1)+g_ZC에 따라 결정될 수 있고, 여 기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC, f_ZC 및 g_ZC는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시 예의 경우, 루트 인덱스 u 및 위상 시프트 θ 모두가 ID 및 DL/UL 방향 관련 정보를 전달하기 위해 사용될 수 있으며, u = b_ZC*(I_ID mod c_ZC) + a_ZC, 및 θ = e_ZC* +f_ZC*I_SF+g_ZC에 따라 결정될 수 있고, 여기서 a_ZC, b_ZC, c_ZC, d_ZC, e_ZC 및 f_ZC는 미리 정의된 상수 정수들이다. 일부 실시예들에서, c(m)는 하다마드(Hadamard) 코드이며, ZC-시퀀스 설계에 대한 전술한 실시예의 모든 실시예 들이 서브 컴포넌트의 커버 코드 설계와 결합될 수 있다. 일 예에서, c(m)는 고정된 하다마드 코드이며, 예를 들어 직교성 목적으로만 사용되는 것과 같이, PoSS에서 정보를 전달하지 않는다. 다른 예에서, c(m)는 길이가 같은 하다마드 코드 세트로부터의 것일 수 있으며, PoSS에서 정보의 일부를 전달한다. 일 실시예에서, 커버 코드 c(m)는 ID의 일부만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID를 나타내기 위해 사용되고, 인덱 스 i를 갖는 코드 c_i(m)는 I_ID mod a_c를 나타내며, 여기서 a_c는 미리 정의된 상수 정수이다. 다른 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID를 나타내기 위해 사용되며, 인덱 스 i를 코드 c_i(m)는 를 나타내고, 여기서 a_c는 미리 정의된 상수 정수이다. 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 타이밍 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m) 는 커버 코드들에 의해 전달되는 ID 및 타이밍 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 b_c*(I_ID mod a_c)+I_t를 나타내고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 다른 예에 서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID 및 타이밍 관련 정보를 나타 내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 b_c*( )+I_t를 나타내고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 PoSS 포맷 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조 합을 나타낼 수 있고, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID 및 PoSS 포맷 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 b_c*(I_ID mod a_c)+I_f를 나타내고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID 및 PoSS 포맷 관련정보를 나타내기 위해 사용되고, 인덱스 i를 갖는 코드 c_i(m)는 b_c*( )+I_f를 나타내고, 여기 서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 전 달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전 달되는 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)은 b_c*(I_ID mod a_c)+I_profile를 나타내고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID 및 전력 소모 프로 파일/UE 적응 구성 테이블 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)은 b_c*( )+I_profile를 나타내고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 슬립 타입 또는 전력 절감 상태 관련 정보를 전달할 수 있 으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하 나 또는 이들의 조합을 나타낼 수 있으며, 슬립 타입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있 다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID 및 슬립 타입 또 는 전력 절감 상태 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 b_c*(I_ID mod a_c)+I_sleep를 나타내고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보 를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 b_c*( )+I_sleep를 나타내고, 여기 서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 시스템 정보 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합 을 나타낼 수 있고, 시스템 정보 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID 및 시스템 정보 관련 정보를 나타내기 위해 사용되며, 인덱스 i 를 갖는 코드 c_i(m)는 b_c*(I_ID mod a_c)+I_f를 나타내고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이 다. 다른 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 ID 및 시스템 정 보 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 b_c*( )+I_f를 나타내 고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 타이밍 관련 정보만을 전달할 수 있으며, 여기서 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 타이밍 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 I_t를 나타내고, 예를 들어, i = I_t이다. 또 다른 실시예에서, 커버 코드 c(m)는 PoSS 포맷 관련 정보만을 전달할 수 있으며, 여기서 PoSS 포 맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 PoSS 포맷 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 I_t를 나타내고, 예를 들어, i = I_f이다. 또 다른 실시예에서, 커버 코드 c(m)는 시스템 정보 관련 정보만을 전달할 수 있으며, 여기서 시스템 정보 관련 정보는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드에 의해 전달 되는 시스템 정보 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 I_s를 나타내고, 예를 들어 i = I_s이다. 또 다른 실시예에서, 커버 코드 c(m)는 DL/UL 방향 정보만을 전달할 수 있으며, 여기서 DL/UL 방향 관련 정보는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 다중 커버 코드 c_i(m)는 커버 코드들에 의해 전달되는 DL/UL 방향 관련 정보를 나타내기 위해 사용되며, 인덱스 i를 갖는 코드 c_i(m)는 I_SF를 나타내고, 예를 들어, i = I_SF이다. 일부 실시예에서, c(m)는 M-시퀀스에 기반하는 것이고, ZC-시퀀스 설계에 대해 전술한 실시예의 모든 실시형태 들이 이 서브 컴포넌트에서 커버 코드 설계와 결합될 수 있다. 예를 들어, 커버 코드가 PoSS에서 정보를 전달하는 경우, M-시퀀스에 대한 사이클릭 시프트 m_c를 사용하여 PoSS에서 정보를 나타낼 수 있다. 일 실시예에서, 커버 코드 c(m)는 ID의 일부만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타낼 수 있으며, m_c = b_c*(I_ID mod a_c) + c_c이고, 여기서 a_c, b_c 및 c_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나 타낼 수 있으며, m_c = b_c* + c_c이고, 여기서 a_c, b_c 및 c_c는 미리 정의된 상수 정수들이 다. 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 타이밍 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시 프트를 사용하여 커버 코드들에 의해 전달되는 ID 및 타이밍 관련 정보를 나타낼 수 있으며, m_c = b_c*((I_ID mod a_c) +1)(I_t+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_t+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c 는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커 버 코드들에 의해 전달되는 ID 및 타이밍 관련 정보를 나타낼 수 있으며, m_c = b_c*( +1)(I_t+1) + c_c*( +1) + d_c*(I_t+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 PoSS 포맷 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조 합을 나타낼 수 있으며, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀 스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_c = b_c*((I_ID mod a_c) +1)(I_f+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_f+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_c = b_c*( +1)(I_f+1) + c_c*( +1) + d_c*(I_f+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 전 달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부의 적어도 하나 또는 이들의 조합을 나타낼 수 있고, 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코 드들에 의해 전달되는 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 나타낼 수 있으며, m_c = b_c*((I_ID mod a_c) +1)(I_profile+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_profile+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스의 사이 클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정 보를 나타낼 수 있으며, m_c = b_c*( +1)(I_profile+1) + c_c*( +1) + d_c*(I_profile+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 슬립 타입 또는 전력 절감 상태 관련 정보를 전달할 수 있 으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부의 적어도 하나 또는 이들의 조합을 나타낼 수 있고, 슬립 타입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID 및 슬 립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있으며, m_c = b_c*((I_ID mod a_c) +1)(I_sleep+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_sleep+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c, e_c는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID 및 슬립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있고, m_c = b_c*( +1)(I_sleep+1) + c_c*( +1) + d_c*(I_sleep+1) +e_c이고, 여기서 a_c,b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 시스템 정보 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합 을 나타낼 수 있고, 시스템 정보 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스 의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_c = b_c*((I_ID mod a_c) +1)(I_s+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_s+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스의 사이 클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, m_c = b_c*( +1)(I_s+1) + c_c*( +1) + d_c*(I_s+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 타이밍 관련 정보만을 전달할 수 있으며, 타이밍 관련 정보는 I_t를 나 타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전 달되는 타이밍 관련 정보를 나타낼 수 있으며, m_c = a_c*I_t + b_c이고, 여기서 a_c 및 b_c는 미리 정의된 상 수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 PoSS 포맷 관련 정보만을 전달할 수 있으며, PoSS 포맷 관련 정보는 I_f 를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의 해 전달되는 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_c = a_c*I_f + b_c이고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 PoSS 포맷 관련 정보만을 전달할 수 있으며, 여기서 시스템 정보 관련 정보는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코 드들에 의해 전달되는 시스템 정보 관련 정보를 나타낼 수 있으며, m_c = a_c * I_s + b_c이고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 DL/UL 방향 정보만을 전달할 수 있으며, 여기서 DL/UL 방향 관련 정보는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 DL/UL 방향 관련 정보를 나타낼 수 있으며, m_c = a_c*I_SF + b_c이고, 여기서 a_c 및 b_c는 미 리 정의된 상수 정수들이다. 일부 실시예에서, c(m)는 골드-시퀀스에 기반하는 것이고, ZC-시퀀스 설계에 대한 전술한 실시예의 모든 실시형 태들이 이 서브 컴포넌트의 커버 코드 설계와 결합될 수 있다. 예를 들어, 커버 코드가 PoSS에서 정보를 전달 하는 경우, 골드-시퀀스를 생성하는 M-시퀀스들 중 하나 또는 둘 모두, m_c1 및/또는 m_c2를 사용하여 PoSS에서 정보를 나타낼 수 있다. 일 실시예에서, 커버 코드 c(m)는 ID의 일부만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타낼 수 있으며, m_c1 = b_c*(I_ID mod a_c) + c_c이고, 여기서 a_c, b_c 및 c_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나 타낼 수 있으며, m_c1 = b_c* + c_c이고, 여기서 a_c, b_c 및 c_c는 미리 정의된 상수 정수들이 다. 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 타이밍 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있으며, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 하나의 M-시퀀스의 사이 클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타낼 수 있고, 다른 M-시퀀스의 사이클릭 시프트 를 사용하여 타이밍 관련 정보를 나타낼 수 있으며, m_c1 = b_c*(I_ID mod a_c) + c_c, m_c2 = d_c*I_t + e_c 이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 하 나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타낼 수 있고, 다른 M-시퀀 스의 사이클릭 시프트를 사용하여 타이밍 관련 정보를 나타낼 수 있으며, m_c1 = b_c* + c_c,m_c2 = d_c*I_t + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 PoSS 포맷 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조 합을 나타낼 수 있고, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 하나의 M- 시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타내고, 다른 M-시퀀스의 사이클릭 시프트를 사용하여 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_c1 = b_c*(I_ID mod a_c) + c_c, m_c2 = d_c*I_f + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실 시예의 경우, 하나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타내기 위해 사용될 수 있고, 다른 M-시퀀스의 사이클릭 시프트를 사용하여 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_c1 = b_c*(I_ID mod a_c) + c_c, m_c2 = d_c*I_f + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상 수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보를 전 달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있고, 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 하나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타내고, 다른 M-시퀀스의 사이클릭 시프트를 사용하여 전력 소모 프로파일 /UE 적응 구성을 나타낼 수 있으며, m_c1 = b_c*(I_ID mod a_c) + c_c, m_c2 = d_c*I_profile + e_c이고, 여기 서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 하나의 M-시 퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타내고, 다른 M-시퀀스의 사이클릭 시 프트를 사용하여 전력 소모 프로파일/UE 적응 구성을 나타낼 수 있으며, m_c1 = b_c* + c_c, m_c2 = d_c*I_profile + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 슬립 타입 또는 전력 절감 상태 관련 정보를 전달할 수 있 으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부의 적어도 하나 또는 이들의 조합을 나타낼 수 있고, 슬립 타입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 하나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID 를 나타내고, 다른 M-시퀀스의 사이클릭 시프트를 사용하여 슬립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있으며, m_c1 = b_c*(I_ID mod a_c) + c_c, m_c2 = d_c*I_sleep + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, 하나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타내고, 다른 M-시퀀스의 사이클릭 시프트를 사용하여 슬립 타입 또는 전력 절감 상태 관련 정보를 나타낼 수 있으며, m_c1 = b_c* + c_c, m_c2 = d_c*I_sleep + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 시스템 정보 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합 을 나타낼 수 있고, 시스템 정보 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 하나의 M- 시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타내고, 다른 M-시퀀스의 사이클릭 시프트를 사용하여 시스템 정보 관련 정보를 나타낼 수 있으며, m_c1 = b_c*(I_ID mod a_c) + c_c, m_c2 = d_c*I_s + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실 시예의 경우, 하나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 ID를 나타내고, 다 른 M-시퀀스의 사이클릭 시프트를 사용하여 시스템 정보 관련 정보를 나타낼 수 있으며, m_c1 = b_c* + c_c, m_c2 = d_c*I_s + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상 수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 타이밍 관련 정보만을 전달할 수 있으며, 타이밍 관련 정보는 I_t를 나 타낼 수 있다. 일 예에서, 이 실시예의 경우, 하나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 타이밍 관련 정보를 나타낼 수 있으며, m_c1 = a_c*I_t + b_c이고, 여기서 a_c 및 b_c는 미리 정 의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 PoSS 포맷 관련 정보만을 전달할 수 있으며, PoSS 포맷 관련 정보는 I_f 를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 하나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 PoSS 포맷 관련 정보를 나타낼 수 있으며, m_c1 = a_c*I_f + b_c이고, 여기서 a_c 및 b_c 는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 시스템 정보 관련 정보만을 전달할 수 있으며, 여기서 시스템 정보 관련 정보는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, 하나의 M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 시스템 정보 관련 정보를 나타낼 수 있으며, m_c1 = a_c*I_s + b_c이고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 DL/UL 방향 정보만을 전달할 수 있으며, 여기서 DL/UL 방향 관련 정보는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, M-시퀀스의 사이클릭 시프트를 사용하여 커버 코드들에 의해 전달되는 DL/UL 방향 관련 정보를 나타낼 수 있으며, m_c1 = a_c*I_SF + b_c이고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 일부 실시예에서, c(m)는 PN-시퀀스에 기반하는 것이며, ZC-시퀀스 설계에 대한 전술한 실시예들은 이 서브 컴 포넌트에서 커버 코드 설계와 결합될 수 있다. 예를 들어, 커버 코드가 PoSS에서 정보를 전달하는 경우, PN-시 퀀스의 초기 조건 c_int를 사용하여 PoSS에서 정보를 나타낼 수 있다. 일 실시예에서, 커버 코드 c(m)는 ID의 일부만을 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 ID를 나타낼 수 있으며, c_int = b_c*I_ID + a_c이고, 여기서 a_c 및 b_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 ID를 나타낼 수 있으며, c_int = b_c*(I_ID mod a_c) + c_c이고, 여기서 a_c, b_c 및 c_c는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 ID를 나타낼 수 있으며, c_int = b_c* + c_c이고, 여기서 a_c, b_c 및 c_c는 미리 정의된 상수 정수들이다. 다른 실시예에서, 커버 코드 c(m)는 ID 및 타이밍 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합을 나타낼 수 있고, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사 용하여 커버 코드들에 의해 전달되는 ID 및 타이밍 관련 정보를 나타낼 수 있으며, c_int = b_c*(I_ID+1)(I_t+1) + c_c*(I_ID+1) + d_c*(I_t+1) + e_c이고, 여기서 b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전 달되는 ID 및 타이밍 관련 정보를 나타낼 수 있으며, c_int = b_c*((I_ID mod a_c) +1)(I_t+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_t+1) + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 ID 및 타 이밍 관련 정보를 나타낼 수 있으며, c_int = b_c*( +1)(I_t+1) + c_c*( +1) + d_c*(I_t+1) + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 실시예에서, 커버 코드 c(m)는 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보 및 타이밍 관련 정보를 전달할 수 있으며, 여기서 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보는 I_profile를 나타낼 수 있고, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보 및 타이밍 관련 정보를 나타 낼 수 있으며, c_int = b_c*(I_profile+1)(I_t+1) + c_c*(I_profile+1) + d_c*(I_t+1) + e_c이고, 여기서 b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조 건을 사용하여 커버 코드들에 의해 전달되는 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보 및 타이밍 관 련 정보를 나타낼 수 있으며, c_int = b_c*((I_profile mod a_c) +1)(I_t+1) + c_c*((I_profile mod a_c) +1) + d_c*(I_t+1) + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 예에 서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 전력 소모 프로파일/UE 적응 구성 테이블 관련 정보 및 타이밍 관련 정보를 나타낼 수 있으며, c_int = b_c*( +1)(I_t+1) + c_c*( +1) + d_c*(I_t+1) + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 실시예에서, 커버 코드 c(m)는 슬립 타입 또는 전력 절감 상태 관련 정보 및 시간 관련 정보를 전달할 수 있으며, 여기서 슬립 타입 또는 전력 절감 상태 관련 정보는 I_sleep을 나타낼 수 있고, 타이밍 관련 정보는 I_t를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 슬립 타입 또는 전력 절감 상태 관련 정보 및 타이밍 관련 정보를 나타낼 수 있으며, c_int = b_c*(I_sleep+1)(I_t+1) + c_c*(I_sleep+1) + d_c*(I_t+1) + e_c, where b_c, c_c, d_c이고, 여기서 b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 슬립 타입 또는 전력 절감 상태 관련 정보 및 타이밍 관련 정보를 나타 낼 수 있으며, c_int = b_c*((I_sleep mod a_c) +1)(I_t+1) + c_c*((I_sleep mod a_c) +1) + d_c*(I_t+1) + e_c이고, 여기서 a_c, b_c, c_c, d_c, e_c는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 슬립 타입 또는 전력 절감 상태 관련 정 보 및 타이밍 관련 정보를 나타낼 수 있으며, c_int = b_c*( +1)(I_t+1) + c_c*( +1) + d_c*(I_t+1) + e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 PoSS 포맷 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉, 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조 합을 나타낼 수 있으며, PoSS 포맷 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀 스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, c_int = b_c*(I_ID +1)(I_f+1) + c_c*(I_ID +1) + d_c*(I_f+1) +e_c이고, 여기서 b_c, c_c, d_c 및 e_c는 미 리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드 들에 의해 전달되는 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, c_int = b_c*((I_ID mod a_c) +1)(I_f+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_f+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달 되는 ID 및 PoSS 포맷 관련 정보를 나타낼 수 있으며, c_int = b_c*( +1)(I_f+1) + c_c*( +1) + d_c*(I_f+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정 수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 시스템 정보 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합 을 나타낼 수 있으며, 시스템 정보 관련 정보는 I_f를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀 스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, c_int = b_c*(I_ID+1)(I_s+1) + c_c*(I_ID+1) + d_c*(I_s+1) +e_c이고, 여기서 b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, c_int = b_c*((I_ID mod a_c) +1)(I_s+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_s+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정 수들이다. 또 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되 는 ID 및 시스템 정보 관련 정보를 나타낼 수 있으며, c_int = b_c*( +1)(I_s+1) + c_c*( +1) + d_c*(I_s+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정 수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 ID의 일부 및 시스템 정보 관련 정보를 전달할 수 있으며, 여기서 ID는 I_ID, 즉 셀 ID/셀 ID의 일부 및 UE ID/UE ID의 일부 및 TA ID/TA ID의 일부 중 적어도 하나 또는 이들의 조합 을 나타낼 수 있고, DL/UL 방향 관련 정보는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스 의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 ID 및 DL/UL 방향 관련 정보를 나타낼 수 있으며, c_int = b_c*(I_ID+1)(I_SF+1) + c_c*(I_ID+1) + d_c*(I_SF+1) +e_c이고, 여기서 b_c, c_c, d_c 및 e_c는 미리 정의 된 상수 정수들이다. 또 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의 해 전달되는 ID 및 DL/UL 방향 관련 정보를 나타낼 수 있으며, c_int = b_c*((I_ID mod a_c) +1)(I_SF+1) + c_c*((I_ID mod a_c) +1) + d_c*(I_SF+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정 수들이다. 또 다른 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되 는 ID 및 DL/UL 방향 관련 정보를 나타낼 수 있으며, c_int = b_c*( +1)(I_SF+1) +c_c*( +1) + d_c*(I_SF+1) +e_c이고, 여기서 a_c, b_c, c_c, d_c 및 e_c는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 타이밍 관련 정보만을 전달할 수 있으며, 타이밍 관련 정보는 I_t를 나 타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 타이밍 관련 정보를 나타낼 수 있으며, c_int = a_c*I_t + b_c이고, 여기서 a_c 및 b_c는 미리 정의된 상수 정 수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 PoSS 포맷 관련 정보만을 전달할 수 있으며, PoSS 포맷 관련 정보는 I_f 를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전 달되는 PoSS 포맷 관련 정보를 나타낼 수 있으며, c_int = a_c*I_f + b_c이고, 여기서 a_c 및 b_c는 미리 정의 된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 PoSS 포맷 관련 정보만을 전달할 수 있으며, 여기서 시스템 정보 관련 정보는 I_s를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들 에 의해 전달되는 시스템 정보 관련 정보를 나타낼 수 있으며, c_int = a_c*I_s + b_c이고, 여기서 a_c 및 b_c 는 미리 정의된 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 DL/UL 방향 정보만을 전달할 수 있으며, 여기서 DL/UL 방향 관련 정보는 I_SF를 나타낼 수 있다. 일 예에서, 이 실시예의 경우, PN-시퀀스의 초기 조건을 사용하여 커버 코드들에 의해 전달되는 DL/UL 방향 관련 정보를 나타낼 수 있으며, c_int = a_c*I_SF + b_c이고, 여기서 a_c 및 b_c는 미리 정의되는 상수 정수들이다. 또 다른 실시예에서, 커버 코드 c(m)는 셀 ID 관련 정보 및 타이밍 정보를 전달한다. 일 예에서, c(m)는 PDCCH DMRS와 동일하며, 여기서 초기화의 ID는 셀 ID이다. 또 다른 예에서, c(m)는 PDCCH DMRS의 변형이며, 여기서 초기 PN 시퀀스 p(n)로부터의 c(m) 변조는, PoSS에서 전달되는 경우 또는 에 의해 결정된다. 초기 화의 ID는 셀 ID이다. 보다 구체적으로, 가 PoSS에서 전달될 때, 인 경우, c(m) = 1/sqrt(1-2*p(2n)) + j*1/sqrt(1-2*p(2*n+1))이고, 인 경우, c(m) = 1/sqrt(1-2*p(2n)) - j*1/sqrt(1- 2*p(2*n+1))이며, 가 PoSS에서 전달될 때, 인 경우, c(m) = 1/sqrt(1-2*p(2n)) + j*1/sqrt(1-2*p(2*n+1))이고, 인 경우, c(m) = 1/sqrt(1-2*p(2n)) - j*1/sqrt(1- 2*p(2*n+1))이며, PoSS 구성 유닛은 PoSS 버스트 블록의 기본 RE 리소스들에 매핑되는 PoSS 컨텐츠이다. 일 실시예에서, PoSS 구성 유닛은 하나의 OFDM 심볼 시퀀스 s(m)이다. s(m)은 전술한 실시예들에서 설명된 바 와 같은 임의의 설계 방법에 기초하여 생성될 수 있다. 일 실시예에서, PoSS 구성 유닛은 유효한 PDCCH의 존재를 표시하고 알려진 정보만을 UE에 전달하기 위해 사용될 수 있다. 다른 실시예에서, PoSS 구성 유닛은 동적 재구성을 위해 사용될 수 있고, 일부 알려지지 않은 정보만을 UE에 전 달한다. 또 다른 실시예에서, PoSS 구성 유닛은 알려진 정보와 알려지지 않은 정보 모두를 UE에 전달할 수 있다. 일 실시예에서, PoSS 구성 유닛은 2 개의 연속적인 OFDM 심볼, s(m, 1) 및 s(m, 2)로 구성되며, 여기서 s(m, 1), s(m, 2)는 전술한 임의의 설계 실시예들에 기초하여 생성될 수 있다. 일 실시예에서, 제 1 심볼은 유효한 PDCCH의 존재를 나타내고 알려진 정보만을 UE에 전달하기 위해 사용될 수 있다. 제 2 심볼은 동적 재구성하여 일부 알려지지 않은 정보를 UE에게 전달하기 위해 사용될 수 있다. 본 개시는 PDDCH DMRS, CSI-RS, SSS, PSS 기반 전력 절감 신호 설계를 포함하는, 기존의 기준 신호(RS)를 지원 하는 것에 관한 것이다. 본 개시는 또한 UE 다중화 또는 정보 전달을 지원하기 위해 기존의 RS 기반 전력 절감 신호에 대한 변형에 관한 것이다.일 실시예에서, 기존의 기준 시퀀스/신호(RS)의 기능은 전력 절감 신호를 기반으로 제공된다. 기존의 RS는 PDCCH DMRS, CSI-RS, SSS 또는 PSS이거나 이들의 변형일 수 있다. NR 사양에 정의된 기본 기능을 제외하고, 기 존의 RS를 전력 절감 신호(PoSS)로서 사용하여 UE 적응 또는 PoSS-WU, PoSS-GTS, PoSS-COT, PoSS-AR, PoSS-AIR 와 같은, 본 발명에서 정의되는 가능들을 트리거할 수 있다. 일 실시예에서, 기존의 RS 기반 PoSS는 UE 전력 소모 상태 전환을 트리거하는데 사용될 수 있다. 전력 소모 상 태는 다음과 같은 예들 중 하나일 수 있다. 일 예에서, 전력 소모 상태는 UE가 RRC_CONNECTED 상태에서 일반적인 PDCCH/PDSCH/PUSCH/PUCCH 처리 및 주기적 CSI 및 RRM 측정을 수행하는 활성 또는 일반 액세스 상태일 수 있다. 이 상태에서는, 모든 베이스밴드 및 FR 모듈들이 켜져 있으며, 데이터 수신 및 송신을 수행하는데 추가 전환 오버헤드를 필요로 하지 않는다. 다른 예에서, 전력 소모 상태는 UE가 데이터 수신 또는 송신을 위해 PDCCH를 모니터링하지 않고 RRC_CONNECTED 상태에서 주기적 CSI 및 RRM 측정을 수행하는 휴면/비활성일 수 있다. 이 상태에서, UE는 베이스밴드 모듈들의 일부를 턴 오프할 수 있으며 활성 상태로의 전환 오버헤드가 낮다. 하나의 하위 예에서는, 휴면/비활성 상태가 예를 들어 6 ms와 같이 고정될 수 있거나 또는 상위 계층 시그널링을 통해 구성될 수 있는 듀레이션 T_dormant 과 연관된다. 또 다른 예에서, 전력 소모 상태는 UE가 어떠한 베이스밴드 처리도 하지 않는 슬립 상태일 수 있다. 일반 활성 /일반 액세스 상태로의 전환 오버헤드가 높다. UE는 RRM/CSI 측정 및 채널 시간/주파수 및/또는 빔 추적을 수 행해야 할 수 있다. 하나의 하위 예에서, 슬립 상태는 예를 들어 20ms와 같이 고정될 수 있거나 상위 계층 시 그널링을 통해 구성될 수 있는 듀레이션 T_sleep과 연관된다. RS 기반 PoSS를 사용하여 현재 전력 소모 상태에서 N_states 중 하나로 전환하도록 UE를 트리거할 수 있다(여기 서 N_states >= 1). RS 기반 PoSS는 다음 경우(들) 중 하나 또는 임의의 조합에 대한 전력 소모 상태 전환을 나타낼 수 있다. 일 예에서, RS 기반 PoSS는 일반 액세스/활성 상태에서 휴면 상태로 전환하도록 UE에게 지시할 수 있다. 다른 예에서, RS 기반 PoSS는 일반 액세스/활성 상태에서 다른 일반/활성 상태로 전환하도록 UE에게 지시할 수 있다. 또 다른 예에서, RS 기반 PoSS는 일반 액세스/활성 상태에서 슬립 상태로 전환하도록 UE에게 지시할 수 있다. 또 다른 예에서, RS 기반 PoSS는 휴면 상태에서 일반 액세스/활성 상태로 전환하도록 UE에게 지시할 수 있다. 또 다른 예에서, RS 기반 PoSS는 휴면 상태에서 다른 휴면 상태로 전환하도록 UE에게 지시할 수 있다. 또 다른 예에서, RS 기반 PoSS는 슬립 상태에서 일반 액세스/활성 상태로 전환하도록 UE에게 지시할 수 있다. 또 다른 예에서, RS 기반 PoSS는 휴면 상태에서 슬립 상태로 전환하도록 UE에게 지시할 수 있다. 또 다른 예에서, RS 기반 PoSS는 슬립 상태에서 휴면 상태로 전환하도록 UE에게 지시할 수 있다. 또 다른 예에서, RS 기반 PoSS는 슬립 상태에서 다른 슬립 상태로 전환하도록 UE에게 지시할 수 있다. 일 실시예에서, RS 기반 PoSS는 하나 또는 다수의 전력 소모 차원들에서 동적 UE 적응을 트리거하는데 사용될 수 있다. PoSS에 의해 전달되는 정보는 log2(N_adaptation) 비트 크기의 I_d로 표시될 수 있다. 연관된 UE 또는 UE 그룹당 RS 풀과 N_adaptation 후보 적응 옵션들 간에 일대일 매핑이 있다. 일 예에서, N_adaptation 후보 적응 요청은 시스템 동작의 사양에서 고정될 수 있다. 다른 예에서, N_adaptation 후보 적응 요청은 상위 계층 시그널링을 통해 제공될 수 있다. 일 실시예에서, RS 기반 PoSS는 UE로부터의 적응 요청에 대한 확인 응답을 표시하기 위해 사용될 수 있다. 예 를 들어, 전체 시퀀스 풀 중 2 개의 시퀀스가 UE에 의한 적응 요청에 대한 긍정적 또는 부정적 확인 응답을 표 시하는데 사용될 수 있다. 이 경우, UE는 적응 요청을 gNB로 송신한 후 연관된 2 개의 시퀀스를 모니터링하기 시작하다. 일 실시예에서는, RS 기반 PoSS를 위한 채널 리소스 할당을 위한 구성이 상위 계층 시그널링을 통해 gNB에 의해 서 UE에게 제공된다. UE는 다음의 예들 중 하나를 통해 RB의 개수 N_RB의 관점에서 RS 기반 PoSS의 대역폭을 결정할 수 있다. 일 예에서, N_RB는 N_RB = 24와 같이 시스템 동작의 사양에서 고정될 수 있다. 다른 예에서, RS 기반 PoSS의 BW는 상위 계층 시그널링을 통해 gNB로부터 UE로 구성될 수 있다. 또 다른 예에서, RS 기반 PoSS의 BW는 UE로부터의 UE 보조 정보에 응답하여 gNB에 의해 구성될 수 있다. 또 다른 예에서, UE는 RS 기반 PoSS의 BW의 스케일링을 표시하기 위해 보조 정보를 송신할 수 있다. 예를 들어, 연관된 UE 보조 정보는 \"0\" 값이 N_RB/2를 나타내고, \"1\" 값이 2xN_RB를 나타낼 수 있는 1 비트일 수 있 다. 또 다른 예에서, UE는 N_RB의 최소값을 표시하기 위해 보조 정보를 송신할 수 있다. 또 다른 예에서, UE는 N_RB의 선호 값을 표시하기 위해 보조 정보를 송신할 수 있다. UE는 다음과 같은 접근 방식들 중 하나를 통해, OFDM 심볼 개수 N_OS 관점에서 RS 기반 PoSS의 시간 듀레이션을 결정할 수 있다. 일 예에서, N_OS는 시스템 동작의 사양에서 고정될 수 있다. 예를 들어, N_OS = 2 또는 N_OS = 3이다. 다른 예에서, N_OS는 상위 계층 시그널링을 통해 gNB에 의해 UE에게 구성될 수 있다. 또 다른 예에서, N_OS는 UE 보 조 정보의 수신에 응답하여 gNB에 의해 구성될 수 있다. 일 예에서, UE는 N_OS의 최소 값을 표시하기 위해 보 조 정보를 송신할 수 있다. 다른 예에서, UE는 N_OS의 선호 값을 표시하기 위해 보조 정보를 송신할 수 있다. 또 다른 예에서, UE는 연관된 RS의 모든 가능한 구성 중 하나를 나타낼 수 있다. 예를 들어, UE는 CSI-RS가 PoSS에 사용되는 경우, PRB 당 고밀도 RE 매핑으로 특정 CSI-RS 구성을 나타낼 수 있다. UE는 다음과 같은 접근 방식들 중 하나를 통해, RS 기반 PoSS, T_PoSS의 주기를 결정할 수 있다. 일 예에서, T_PoSS는 시스템 동작 사양에서 고정될 수 있다. 다른 예에서, T_PoSS는 상위 계층 시그널링을 통 해 서빙 gNB에 의해서 UE에게 제공될 수 있다. 또 다른 예에서, T_PoSS는 PDCCH 모니터링 주기, T_PDCCH와 연 관될 수 있다. 예를 들어, T_PoSS = c0*T_PDCCH이며, 여기서 c0은 c0 = 1과 같은 상수이다. 또 다른 예에서, T_PoSS는 CDRX 모드에서 긴/짧은 DRX 사이클과 또는 유휴 모드 페이징을 위한 DRX 사이클 T_DRX와 연관될 수 있 다. 예를 들면, T_PoSS = c1*T_DRX이며 여기서 c1은 c1 = 1과 같은 상수이다. 또 다른 예에서, T_PoSS는 UE 보조 정보의 수신에 응답하여 gNB에 의해서 UE에게 구성될 수 있다. 일 예에서, UE는 T_PoSS의 최소 값을 표시하기 위해 보조 정보를 송신할 수 있다. 다른 예에서, UE는 T_PoSS의 선호 값을 표시하기 위해 보조 정보를 송신할 수 있다. 또 다른 예에서, UE는 T_PoSS의 동적 스케일링을 표시하기 위해 보조 정보를 송신할 수 있다. 예를 들어, UE 보조 정보는 \"0\" 값이 T_PoSS/2를 나타낼 수 있고 \"1\" 값이 2xT_PoSS를 나타낼 수 있는 1 비트일 수 있다. 또 다른 예에서, T_PoSS는 RS의 디폴트 주기, T_RS와 연관될 수 있다. 예를 들어, T_PoSS = c3*T_RS이며, 여 기서 c3은 c3 = 1과 같은 양의 정수이다. 일 실시예에서, PDCCH DMRS 기반 PoSS가 제공된다. PDCCH DMRS는 PoSS-WU, PoSS-GTS, PoSS-COT, PoSS-AR, PoSS-RS, PoSS-AIR와 같은 본 발명에서 설명된 모든 기능을 지원하는데 사용될 수 있다. 일 접근 방식에서, DMRS 기반 PoSS는 BWP 내에서 하나의 CORESET와 연관될 수 있다. UE는 연관된 CORESET의 DMRS를 PoSS로서 모니터링할 수 있다. UE는 다음 중 하나를 통해 DMRS 기반 PoSS 모니터링/검출을 위해 인덱스 p를 갖는 CORESET을 결정할 수 있다: 일 예에서: PBCH 및/또는 시스템 정보 및/또는 랜덤 액세스 절차와 연관된 p = 0; 다른 예에서: RB 개수 관점에서 최대 주파수 도메인 리소스를 갖는 CORESET; 또 다른 예에서: RB의 개수 관점에서 최소 주파수 도메인 리소스를 갖는 CORESET; 또 다른 예에서, RB의 최대 개수와 연관된 CORESET. UE 는 다음 중 하나를 통해 UE가 동일한 DMRS 프리코더를 사용하는 것으로 가정할 수 있는 주파수 도메인에서 REG 개수에 대한 프리코더 그래뉼래러티를 결정할 수 있다: 일 예에서, 프리코더 그래뉼래러티는 시스템 동작의 사 양에서 고정 및 정의되어 있으며, 예를 들어, 프리코더 그래뉼래러티는 CORESET에서 모든 연속 RB이며; 다른 예 에서, 프리코더 그래뉼래러티는 상위 계층 시그널링에 의해 구성된다. 다른 접근 방식에서, DMRS 기반 PoSS는 하나 또는 다수의 탐색 공간 세트(들)와 연관될 수 있다. UE는 PoSS로 서 연관된 탐색 공간 세트들의 CORESET에서 DMRS를 모니터링할 수 있다. UE는 다음에 대한 임의의 조합을 통해 DMRS 기반 PoSS 모니터링/검출하기 위해 CORESET p와 연관된 하나 또는 다수의 탐색 공간 세트 s를 결정할 수 있으며: 일 예에서, 탐색 공간 세트 s는 UE가 데이터 수신 또는 송신을 모니터링하는 구성된 USS이고; 다른 예 에서, 탐색 공간 세트 s는 상위 레벨 시그널링에 의해 제공되며; 또 다른 예에서, 탐색 공간 세트 s는 구성된 CSS이다.또 다른 접근 방식에서, DMRS 기반 PoSS는 GC-PDCCH와 연관될 수 있다. UE는 연관된 GC-PDCCH에서 DMRS를 PoSS로서 모니터링할 수 있다. UE는 다음 중 하나를 통해 DMRS 기반 PoSS 모니터링/검출하기 위한 연관된 GC- PDCCH를 결정할 수 있다: 일 예에서, GC-PDCCH는 UE가 모니터링하는 구성된 GC-PDCCH 중 하나이고; 다른 예에서, GC-PDCCH는 UE 전력 절감을 위한 전용 GC-PDCCH이다. 또 다른 접근 방식에서, DMRS 기반 PoSS는 연관된 PDCCH의 DMRS이거나 또는 추가의 전력 절감 정보를 전달하는 전력 절감 채널일 수 있다. DMRS 기반 PoSS는 PoSS를 모니터링하는 UE(들)의 ID를 전달할 수 있다. DMRS 기반 PoSS를 모니터링하기 위한 연관된 UE(들)의 ID, NID는 연관된 DMRS 시퀀스를 생성하는 의사 랜덤 시퀀스의 초기화에 포함될 수 있으며, 예 를 들어, . 연관된 UE ID에 대해, NID는 UE ID 또는 UE 그룹 ID 또는 셀 ID일 수 있으며, UE는 다음 중 하나를 통해 NID를 결정할 수 있다. 일 예에서, UE는 C-RNTI에 의해 스크램블링된 CRC를 사용하여 DCI 포맷에 의해 스케줄링되는 PDSCH에서 연관된 RRC 파라미터를 디코딩함으로써 NID를 결정할 수 있다. 다른 예에서, UE는 SIB에서 연관된 RRC 파라미터를 디코딩함으로써 NID를 결정할 수 있다. 또 다른 예에서, UE는 NID = mod(floor(I^UE/c1), c3)*c3이 되도록 UE ID로부터 도출되는 NID를 결정할 수 있으며, 여기서 I^UE는 UE ID이고, 예를 들어 I^UE는 C-RNTI이며, 여기서 c1, c2, c3은 c1 = 1, c2 = 4, c3 = 1과 같이, 시스템 동작에서 미리 결정되거나 상위 계 층에 의해 UE에게 제공된다. 일 예에서, PDCCH DMRS 기반 PoSS는, 상위 계층 파라미터 pdcch-DMRS-ScramblingID에 의해(제공된다면) 이 주어질 경우, UE 특정적인 것이다. 다른 예에서, PDCCH DMRS 베이스 PoSS는, NID = Ncell ID일 경우, 셀 특정적인 것이며, 여기서 NID = Ncell ID는 셀 ID이다. 또 다른 예에서, PDCCH DMRS 기반 PoSS는 NID = Ngroup ID일 경우(여기서 Ngroup ID는 UE 그룹 ID), UE 그룹 특정한 것이다. N_ID의 ID를 갖는 UE 또는 UE 그룹 당 크기가 N_PoSS인 시퀀스 풀이 있을 수 있다. 시퀀스 풀의 크기 N_PoSS는 PoSS에 의해 지원되는 기능에 따라 결정된다. 시퀀스와 PoSS에 의해 전달되는 정보 간에 일대일 매핑이 있을 수 있다. PDCCH DMRS 기반 PoSS는 적어도 활성/일반 액세스 상태에서 슬립 상태 또는 휴면/비활성 상태 또는 활성/일반 액세스 상태로의 UE 전환을 트리거하는데 사용될 수 있다. PDCCH DMRS 기반 PoSS에 의해 트리거되는 후보 상태 의 수는 N_states에 의해 표시될 수 있으며, N_states >= 2이다. N_states = 2인 경우, 연관된 PDCCH DMRS의 존재가 일반 액세스 상태에서 일반 액세스 상태로의 전환을 트리거 할 수 있는 반면, PDCCH DMRS가 존재하지 않으면 일반 액세스 상태에서 슬립 상태 또는 휴면 상태로의 전환을 트리거할 수 있다. N_states >= 2이면, 시퀀스와 전환할 후보 상태 간에 일대일 매핑이 있을 수 있다. 이 경우, 시퀀스 풀 크기는 전환할 후보 상태 수와 같다(즉 N_PoSS = N_states). PDCCH DMRS 기반 PoSS를 사용하여 일반 액세스 상태에서 UE에 대한 동적 적응을 트리거하는 경우, 후보 시퀀스 와 후보 적응 옵션 간에 일대일 매핑이 있을 수 있으며, 시퀀스 풀 크기는 총 후보 동적 적응 수와 동일하다(즉, N_PoSS = N_d). DMRS 기반 PoSS의 N_PoSS 크기의 시퀀스 풀은 다음에 정의된 실시예들 중 하나 또는 조합에 의해 생성될 수 있 다. RE 매핑에 대한 주파수 시프트의 일 실시예에서, N_PoSS 시퀀스들이 RE 매핑의 주파수 시프트 v에 대한 변형으 로 생성될 수 있다. 이 경우, PDCCH DMRS 기반 PoSS는 구성된 OFDM 심볼에 매핑되고 RE의 주파수 시프트 v(여 기서 v = 0,…, N_PoSS-1)와 매핑된다. 일 예에서, 주파수 시프트는 다음에 따라 결정될 수 있다: v = I_state*b + a, 여기서 a와 b는 상수 정수이고, I_state는 PoSS에 의해 표시되는 전환할 전력 소모 상태이다. 예를 들어, a = 1, b = 2이다. I_state = 1일 경우, v = 3은 UE가 연관된 PDCCH 및/또는 PDSCH를 디코딩해야 함을 나타내기 위해 사용되는 반면, I_state = 0, v = 1은 PoSS가 존재하지 않으며 UE가 연관된 PDCCH 디코딩을 스킵하고, 슬립 또는 마이크로-슬립할 수 있음 을 나타내기 위해 사용된다. 다른 예에서는, a = 3, b = -2이다. I_state = 0일 경우, v = 3은 UE가 연관된 PDCCH 및/또는 PDSCH를 디코딩해야 함을 나타내기 위해 사용되는 반면, I_state = 1, v = 1은 PoSS가 존재하지 않으며 UE가 연관된 PDCCH 디코딩을 스킵하고, 슬립 또는 마이크로-슬립할 수 있음을 나타내기 위해 사용된다. 시퀀스 매핑 순서의 일 실시예에서, N_PoSS 시퀀스들이 연관된 PDCCH DMRS의 시퀀스 매핑 순서에 기초하여 생성 될 수 있다. 후보 N_PoSS 매핑 순서는 다음과 같을 수 있다. 일 예에서, 매핑은 가장 낮은 값 RE에서 가장 높 은 값 RE로 일 수 있다. 다른 예에서, 매핑은 가장 높은 값 RE에서 가장 낮은 값 RE로 일 수 있다. PN-시퀀스 초기화의 일 실시예에서, N_PoSS 시퀀스들이 연관된 PDCCH DMRS에 대한 PN-시퀀스의 초기화, C_init 를 수정함으로써 생성될 수 있다. UE 특정 또는 UE 그룹 특정 정보 N_ID가 이미 PoSS, c_init에 의해 전달된다. 수정된 초기화 조건을, PoSS 시퀀스 ID를 전달하는(즉, n_PoSS, 여기서 n_PoSS = 0,…, N_PoSS - 1) c^PoSS_init로 표시하도록 한다. 일 실시예에서, PN-시퀀스의 수정된 초기화가 C^PoSS_init =(a_PoSS*n_PoSS+ C_init) mod 2^31로 계산되며, 여기서 a_PoSS는 미리 정의된 상수 정수이다(예를 들어, a_PoSS = 2^30). 위상 마스크의 일 실시예에서, N_PoSS 시퀀스들이 위상 마스크, M^PoSS(i)를 연관된 PDCCH DMRS, r(n)에 적용함 으로써 생성될 수 있다. PDCCH DMRS 기반 PoSS 시퀀스는 d(n) = M^PoSS * r(n), n = 0, …, N_DMRS-1로 정의되며, 여기서 a_PM과 b_PM은 양의 상수 정수이고, N_PM은 위상 마스크의 길이이며, r (n)은 원래 PDCCH DMRS 시퀀스이다. N_DMRS는 연관된 PDCCH DMRS의 길이이다. a_PM 및 b_PM 모두가 N_PoSS 후보 시퀀스들을 생성하는데 사용될 수 있다. 일 예에서, 위상 마스크, M^PoSS(i) = [1, -1], N_PM = 2이다. 다른 예에서, 위상 마스크, M^PoSS(i) = [j, -j], N_PM = 2이다. 또 다른 예에서, 위상 마스크는 4 개의 후보 [1, -1, j, -j], a_PM = N_DMRS를 갖는다. 또 다른 예에서, a_PM = floor(N_DMRS/c_PM), 여기서 c_PM은 양의 상수이다(예를 들면, c_PM = 3). b_PM만이 정보를 전달하는데 사용된다. 또 다른 예에서, M^PoSS(i) = [1, -1, j, -j]이다. PDCCH DMRS 기반 PoSS는 RRC_CONNECTED 모드에서 일반적인 PDCCH 모니터링에 적용할 수 있다. UE는 DRX를 사 용하지 않고 RRC_CONNECTED 상태에서 네트워크 액세스를 위해 PoSS를 모니터링할 수 있으며, 이 시나리오에서는, DMRS 기반 PoSS의 포맷들 중 적어도 하나가 UE에 구성될 수 있다. 일부 실시예들에서, CSI 기준 시퀀스/신호(CSI-RS) 기반 PoSS가 제공된다. CSI-RS는 제 1 실시예에서 설명된 바와 같은 임의의 기능을 지원하기 위해 사용될 수 있다. CSI-RS 기반 PoSS는 적어도 휴면 상태 또는 슬립 상태에 있는 연관된 UE(들)를 웨이크 업하거나 휴면 상태 또는 슬립 상태로부터 일반 액세스/활성 상태로 전환하도록 UE를 트리거하는데 사용될 수 있다. CSI-RS 기반 PoSS는 채널 추적 또는 재동기화 또는 RRM 측정에 사용될 수 있다. CSI-RS 기반 PoSS는 트래픽 도착에 따른 요청 시에 송신될 수 있다. CSI-RS 기반 PoSS는 CSI-RS 리소스들의 세트일 수 있으며, 여기서 각 CSI-RS 리소스는 리소스 ID와 연관된다. UE는 검출 성능을 향상시키기 위해 CSI-RS 리소스들의 세트를 모니터링할 수 있다. CSI-RS 기반 PoSS 리소스들 의 세트는 FDM 또는 TDM될 수 있다. CSI-RS 기반 PoSS는 UE가 PDCCH를 모니터링하지 않는 휴면 BWP에서 송신될 수 있다. I_ID로 표시된 ID를 갖는 연관된 UE(들)는 주기적으로 PoSS를 모니터링하도록 구성된 단일 UE 또는 UE 그룹일 수 있다. 일 예에서, PoSS와 연관된 UE 사이에 1 대 1 매핑이 있는 경우, UE ID는 CSI-RS의 scramblingID가 될 수 있다. 또 다른 예로, PoSS와 연관된 UE 사이에 1 대 N 매핑이 있는 경우, UE 그룹 ID가 CSI-RS의 scramblingID에서 도출될 수 있다. 일 하위 예에서 I_ID = mod(scramblingID, N_UEgroups)이며, 여기서 N_UEgroups는 PoSS 모니터링을 위해 셀마다 지원되는 UE 그룹 수이다. CSI-RS 기반 PoSS는 UE의 전력 소모 프로파일을 나타내는 L1 시그널링으로서 사용될 수 있다. 전력 소모 프로 파일은 미리 정의되거나 또는 반정적인 UE 적응 구성 테이블에서 선택될 수 있다. 다수의 UE 송신 또는 수신 관련 구성 파라미터들이 UE 적응 구성 테이블에 공동으로 인코딩된다. PoSS는 연관된 UE 적응 구성 또는 전력소모 프로파일을 표시하기 위해 테이블에 행 인덱스를 전달할 수 있다. CSI-RS 기반 PoSS의 경우, CDM된 안테나 포트들을 사용하여 전력 소모 프로파일 또는 UE 적응 구성을 나타낼 수 있다. CSI-RS 기반 PoSS가 N 개의 안테나 포트로 구성될 경우, 가장 높은 N' 안테나 포트가 N' 전력 소모 프로 파일 또는 UE 적응 구성 후보에 매핑되거나 또는 UE 적응 구성 테이블의 N' 행에 매핑될 수 있다. CSI-RS 기반 PoSS의 CDM된 안테나 포트들이 UE 또는 UE 그룹의 다중화에 사용될 수 있다. CSI-RS 기반 PoSS가 N 개의 안테나 포트로 구성될 경우, 가장 높은 N' 안테나 포트들이 N' UE들 또는 ID, I_ID를 가진 UE 그룹들에 매핑될 수 있다. 일 실시예에서, SSS 기반 PoSS가 제공된다. NR SSS는 제 1 실시예에서 설명된 바와 같은 임의의 기능을 지원하 기 위해 사용될 수 있다. SSS 기반 PoSS는 적어도 라이트-슬립 또는 딥 슬립에서 연관된 UE(들)를 웨이크 업하거나 휴면 상태 또는 슬립 상태에서 일반 액세스/활성 상태로의 UE 전환을 트리거하는데 사용될 수 있다. SSS 기반 PoSS는 채널 추적 또 는 재동기화 또는 RRM 측정에 사용될 수 있다. SSS 기반 PoSS는 트래픽 도착에 따른 요청 시에 따라 송신될 수 있다. SSS 기반 PoSS는 리소스 세트일 수 있으며, 여기서 각 SSS 리소스는 SS/PBCH 블록과 QCL된다. UE는 검출 성능 을 향상시키기 위해 SSS 리소스 세트를 모니터링할 수 있다. SSS 리소스 세트는 시간 도메인 다중화될 수 있거 나(즉, TDM됨), 또는 주파수 도메인 다중화될 수 있다(즉, FDM됨). SSS 기반 PoSS는 UE가 PDCCH를 모니터링하 지 않는 휴면 BWP에서 송신될 수 있다. 전력 절감 신호인 SSS 기반 PoSS는 UE의 전력 소모 프로파일을 나타내 기 위한 L1 시그널링으로서 사용될 수 있다. 전력 소모 프로파일은 미리 정의되어 있거나 또는 반정적인 UE 적 응 구성 테이블에서 선택될 수 있다. 다수의 UE 송신 또는 수신 관련 구성 파라미터들이 UE 적응 구성 테이블 에 공동으로 인코딩된다. PoSS는 연관된 UE 적응 구성 또는 전력 소모 프로파일을 표시하기 위해 테이블에 행 인덱스를 전달할 수 있다. SSS 기반 PoSS의 경우, 사이클릭 시프트 {m0, m1}을 사용하여 전력 소모 프로파일 또는 UE 적응 구성을 나타낼 수 있다. 일 예에서, m0 = 15*floor(N^1_ID) + 5*N^2_ID, m1 = mod(N^1_ID, 112) + I_state*a이며, 여기서 셀 ID는, N^cellID = 3*N^1_ID+N^2_ID이고, I_state는 UE 적응 구성 테이블의 행 인덱스이다. I_state = {0, 1,…, N_states-1}이며, 여기서 N_states는 UE 적응 테이블의 크기 또는 전력 소모 프로파일의 수이다. a는 상수이다 (예를 들면, a = 1). SSS의 사이클릭 시프트 {m0, m1}은 SSS 기반 PoSS를 위한 UE들 또는 UE 그룹들의 다중화에 사용될 수 있다. 일 예에서, m0 = 15*floor(N^1_ID) + 5*N^2_ID, m1 = mod(N^1_ID, 112) + I_ID*a이며, 여기서 셀 ID는, N^cellID = 3*N^1_ID+N^2_ID이고, I_ID는 UE ID 또는 UE 그룹 ID이고, a는 상수(예를 들면, a = 1)이다. 일 실시예에서, PSS 기반 PoSS가 제공된다. NR PSS는 제 1 실시예에서 설명된 바와 같은 임의의 기능을 지원하 기 위해 사용될 수 있다. PSS 기반 PoSS는 적어도 슬립 상태에서 활성/일반 액세스 상태로 전환하도록 연관된 UE(들)를 트리거하는데 사 용될 수 있다. 라이트 슬립 또는 딥 슬립에서 UE를 웨이크 업하기 위해, PSS 기반 PoSS가 채널 추적 또는 재동 기화 또는 RRM 측정에 사용될 수 있다. PSS 기반 PoSS는 트래픽 도착에 따른 요청 시에 송신될 수 있다. PSS 기반 PoSS는 리소스 세트일 수 있으며, 여기서 각 PSS 리소스는 SS/PBCH 블록과 QCL된다. UE는 검출 성능 을 향상시키기 위해 PSS 리소스 세트를 모니터링할 수 있다. PSS 리소스 세트는 시간 도메인 다중화될 수 있거 나(즉, TDM됨), 또는 주파수 도메인 다중화될 수 있다(즉, FDM됨). PSS 기반 PoSS는 UE가 PDCCH를 모니터링하 지 않는 휴면 BWP에서 송신될 수 있다. 전력 절감 신호인 PSS 기반 PoSS는 UE의 전력 소모 프로파일을 나타내기 위한 L1 시그널링으로서 사용될 수 있 다. 전력 소모 프로파일은 미리 정의되어 있거나 또는 반정적인 UE 적응 구성 테이블에서 선택될 수 있다. 다 수의 UE 송신 또는 수신 관련 구성 파라미터들이 UE 적응 구성 테이블에 공동으로 인코딩된다. PSS 기반 PoSS 는 연관된 UE 적응 구성 또는 전력 소모 프로파일을 표시하기 위해 테이블에 행 인덱스를 전달할 수 있다. PSS 기반 PoSS의 경우, PSS의 사이클릭 시프트를 사용하여 전력 소모 프로파일 또는 UE 적응 구성을 나타낼 수 있다. 이 경우, PoSS는 d_PoSS(n) = d_sss(n+m0)일 수 있으며, 여기서 m0은 사이클릭 시프트이다. 일예에서, m0 = I_state*a이고, I_state는 UE 적응 구성 테이블의 행 인덱스이다. I_state = {0, 1, …, N_states-1}이며, 여기서 N_states는 UE 적응 테이블의 크기 또는 전력 소모 프로파일의 수이다. a는 상수이다 (예를 들면, a = 1). PSS의 사이클릭 시프트는 UE들 또는 UE 그룹들의 다중화에 사용될 수 있다. 이 경우, PoSS는 d_PoSS(n) = d_sss(n + m0)일 수 있으며, 여기서 m0은 사이클릭 시프트이다. 예를 들어, m0 = I_ID*a이며, 여기서 I_ID는 UE ID 또는 UE 그룹 ID이고, a는 상수이다(예를 들면, a = 1). 본 개시가 예시적인 실시예로 설명되었지만, 다양한 변경 및 수정이 당업자에게 제안될 수 있다. 본 개시는 첨 부된 청구 범위의 범주 내에 있는 이러한 변경 및 수정을 포함하는 것으로 의도된다. 본원의 설명 중의 어떤 것도 임의의 특정 요소, 단계, 또는 기능이 필수 요소인 것을 나타내는 것으로 독해되어 서는 아니되며, 이것은 청구범위에 포함되어야만 한다. 본 발명의 범위는 청구범위에 의해서만 규정된다. 또 한, 정확한 단어 \"~을 위한 수단\" 다음에 분사 구문이 뒤따르지 않는다면, 본 청구항들 중의 어느 항도 35 U.S.C. § 112(f)를 적용하는 것으로 의도되지 않는다."}
{"patent_id": "10-2020-7027498", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시 및 그 이점에 대한 보다 완전한 이해를 위해, 이제 첨부 도면과 함께 취해지는 다음의 설명에 대한 참 조가 이루어지며, 도면에서 유사한 참조 부호는 유사한 부분을 나타낸다. 도 1은 본 개시의 실시예들에 따른 예시적인 무선 네트워크를 도시한 것이다. 도 2는 본 개시의 실시예들에 따른 예시적인 gNB를 도시한 것이다. 도 3은 본 개시의 실시예들에 따른 예시적인 UE를 도시한 것이다. 도 4a는 본 개시의 실시예들에 따른 직교 주파수 분할 다중 액세스 송신 경로의 예시적인 하이 레벨 다이어그램 을 도시한 것이다. 도 4b는 본 개시의 실시예들에 따른 직교 주파수 분할 다중 액세스 수신 경로의 예시적인 하이 레벨 다이어그램 을 도시한 것이다. 도 5는 본 개시의 실시예들에 따른 OFDM을 사용하는 예시적인 송신기 구조를 도시한 것이다. 도 6은 본 개시의 실시예들에 따른 OFDM을 사용하는 예시적인 수신기 구조를 도시한 것이다. 도 7은 본 개시의 실시예들에 따른 DCI 포맷에 대한 예시적인 인코딩 프로세스를 도시한 것이다. 도 8은 본 개시의 실시예들에 따른 DCI 포맷에 대한 예시적인 디코딩 프로세스를 도시한 것이다. 도 9는 본 개시의 실시예들에 따른 2 개의 슬라이스들의 예시적인 다중화를 도시한 것이다. 도 10은 본 개시의 실시예들에 따른 예시적인 안테나 블록들을 도시한 것이다. 도 11은 본 개시의 실시예들에 따른 C-DRX의 구성 및 관련 UE 프로세싱의 예를 도시한 것이다. 도 12는 본 개시의 실시예들에 따른 PoSS의 예시적인 모니터링 오케이전을 도시한 것이다. 도 13은 본 개시의 실시예들에 따른 빔 스위핑 방식의 예시적인 PoSS 전송 버스트를 도시한 것이다. 도 14는 본 개시의 실시예들에 따른 단방향 빔 방식의 예시적인 PoSS 전송 버스트를 도시한 것이다. 도 15는 본 개시의 실시예들에 따른 시간 도메인에서 PoSS 및 연관된 PDCCH의 예시적인 구성을 도시한 것이다. 도 16은 본 개시의 실시예들에 따른 PoSS를 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 도 17은 본 개시의 실시예들에 따른 PoSS를 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 도 18은 본 개시의 실시예들에 따른 예시적인 동적 부분 활성 기간을 도시한 것이다. 도 19는 본 개시의 실시예들에 따른 PoSS-WU를 수신하고 웨이크 업하기 위한 예시적인 UE 절차를 도시한 것이다. 도 20은 본 개시의 실시예들에 따른 PoSS-WU를 수신하고 웨이크 업하기 위한 다른 예시적인 UE 절차를 도시한 것이다. 도 21은 본 개시의 실시예들에 따른 C-DRX와 연관된 PoSS-WU의 예시적인 시간 도메인 구성을 도시한 것이다. 도 22는 본 개시의 실시예들에 따른 C-DRX에서의 PoSS-WU 프로세싱을 위한 예시적인 UE 절차를 도시한 것이다. 도 23은 본 개시의 실시예들에 따른 PF와 연관된 PoSS-WU의 예시적인 시간 도메인 구성을 도시한 것이다. 도 24는 본 개시의 실시예들에 따른 PO(들)와 연관된 PoSS-WU의 예시적인 시간 도메인 구성을 도시한 것이다. 도 25는 본 개시의 실시예들에 따른 PO(들)와 연관된 PoSS-WU의 다른 예시적인 시간 도메인 구성을 도시한 것이다. 도 26은 본 개시의 실시예들에 따른 PoSS-WU를 처리하기 위한 예시적인 UE 절차를 도시한 것이다. 도 27은 본 개시의 실시예들에 따라 PoSS-GTS에 의해 표시된 예시적인 동적 슬립 기간을 도시한 것이다. 도 28은 본 개시의 실시예들에 따라 PoSS-GTS에 의해 표시된 예시적인 동적 부분 슬립 기간을 도시한 것이다. 도 29는 본 개시의 실시예들에 따라 C-DRX로 PoSS-GTS를 모니터링하기 위한 예시적인 UE 절차를 도시한 것이다. 도 30은 본 개시의 실시예들에 따라 C-DRX 없이 PoSS-GTS를 모니터링하기 위한 예시적인 UE 절차를 도시한 것이다. 도 31은 본 개시의 실시예들에 따른 시간 도메인에서 PoSS-COT 모니터링 오케이전의 예시적인 구성을 도시한 것 이다. 도 32는 본 개시의 실시예들에 따른 NR-U에서 PoSS-COT를 모니터링하기 위한 예시적인 UE 절차를 도시한 것이다. 도 33은 본 개시의 실시예들에 따른 활성 기간 동안 PoSS-AR을 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 도 34는 본 개시의 실시예들에 따라 추가 RS로서 PoSS-WU를 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 도 35는 본 개시의 실시예들에 따라 추가 RS로서 PoSS를 수신하기 위한 예시적인 UE 절차를 도시한 것이다. 과 도 36은 본 개시의 실시예들에 따른 PoSS-AIR를 수신하는 예시적인 UE 절차를 도시한 것이다."}
