{"patent_id": "10-2020-0075063", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0157148", "출원번호": "10-2020-0075063", "발명의 명칭": "꽃양귀비 추출물 또는 이의 분획물을 유효성분으로 함유하는 안구건조증 또는 퇴행성 뇌질환", "출원인": "대한민국", "발명자": "최정숙"}}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 안구건조증 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 꽃양귀비 추출물은 물, 탄소수 1 내지 4의 알코올 및 이들의 혼합용매로 구성되는 군으로부터 선택된 용매로 추출하는 것을 특징으로 하는, 안구건조증 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 꽃양귀비는 꽃양귀비의 잎, 줄기 및 열매로 구성된 군으로부터 선택되는 어느 하나 이상인 것을 특징으로하는, 안구건조증 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 꽃양귀비는 꽃양귀비의 잎인 것을 특징으로 하는, 안구건조증 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항의 꽃양귀비 추출물의 분획물을 유효성분으로 함유하는, 안구건조증 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 분획물은 헥산, 에틸 아세테이트 및 부탄올로 구성되는 군으로부터 선택되는 하나 이상의 유기용매로 분획한 것을 특징으로 하는, 안구건조증 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 안구건조증 예방 또는 개선용 건강기능식품조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물.공개특허 10-2021-0157148-3-청구항 9 제8항에 있어서,상기 꽃양귀비 추출물은 물, 탄소수 1 내지 4의 알코올 및 이들의 혼합용매로 구성되는 군으로부터 선택된 용매로 추출하는 것을 특징으로 하는, 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 꽃양귀비는 꽃양귀비의 잎, 줄기 및 열매로 구성된 군으로부터 선택되는 어느 하나 이상인 것을 특징으로하는, 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 꽃양귀비는 꽃양귀비의 잎인 것을 특징으로 하는, 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항의 꽃양귀비 추출물의 분획물을 유효성분으로 함유하는, 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 분획물은 헥산, 에틸 아세테이트 및 부탄올로 구성되는 군으로부터 선택되는 하나 이상의 유기용매로 분획한 것을 특징으로 하는, 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물."}
{"patent_id": "10-2020-0075063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 퇴행성 뇌질환 예방 또는 개선용 건강기능식품 조성물."}
{"patent_id": "10-2020-0075063", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 꽃양귀비 잎 추출물 또는 이의 분획물을 유효성분으로 함유하는 안구건조증 또는 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물에 관한 것으로, 본 발명의 꽃양귀비(Papaver rhoeas) 추출물 또는 이의 분획물은 산 화스트레스에 대한 결막세포 보호 활성 정도를 높이고, 퇴행성 뇌질환의 병증을 완화시킴으로써, 상기 꽃양귀비 추출물 또는 이의 분획물은 안구건조증 또는 퇴행성 뇌질환의 예방 또는 치료용 약학적 조성물 또는 건강기능식 품 조성물로 유용하게 사용될 수 있고, 인지능 개선 소재의 개발로 고령화 시대의 사회적 비용절감과 삶의 질 향 상에 기여할 수 있다."}
{"patent_id": "10-2020-0075063", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 꽃양귀비 잎 추출물 또는 이의 분획물을 유효성분으로 함유하는 안구건조증 또는 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물에 관한 것이다."}
{"patent_id": "10-2020-0075063", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "안구 건조증(건성안: dry eye syndrome)은 단순히 눈물부족이 아닌, 눈물과 안구표면(각막 및 결막)의 염증에 의한 안구의 불편감, 눈피로, 시력저하, 눈물층의 불안정성을 유발하여 안구표면에 손상을 주어, 통증, 불규칙 한 각막 표면, 흐리고 변동폭이 커진 시력 및 각막궤양 등의 발병 위험성이 크다. 그러나 이러한 발병기전은 아 직 완전히 규명되지 않았으나, 염증세포의 침윤, 면역활성화 분자 및 접착분자발현 증가, Th1 및 Th17 반응, 세 포사멸 마커 및 케모카인의 비정상적인 변화 등 염증이 중요한 역할을 한다는 연구결과가 보고되고 있다. 일반 적으로 안구 건조증 치료를 위해서 칼륨과 안토시아닌이 풍부한 음식섭취를 권장하고 있고, 이외에도 케일, 키위, 사과 등의 과일섭취도 적극 권장하고 있다. 또한 인공눈물 점안, 눈물점을 막아 배출되는 눈물의 양을 조절 하는 치료법을 사용하기도 한다. 건강보험심사평가원 자료에 의하면 국내 안구건조증 치료에 사용된 총 진료비는 연평균 8.6%씩 증가해 2009년에 는 521억원, 2013년에는 726억원으로 5년 사이 200억원 이상 증가하였다. 그러나 안구건조증은 우리나라 성인의 20% 내외로 발생하는 흔한 질병으로, 특히 전 세계적인 기후 변화 특히 엘니뇨 현상으로 온도가 올라가고 있는 상황과 미세먼지 등 환경오염으로 인해 안구건조증 환자가 지속적으로 증가하고 있으나, 특별한 치료제 또는 기 능성 식품이 없는 상황이다. 퇴행성 뇌질환(degenerative brain disease)은 나이가 들어감에 따라 발생하는 퇴행성 질환 중에서 뇌에서 발생 하는 질환을 뜻한다. 현재까지 알려지지 않은 원인으로 뇌와 척수의 특정 뇌세포군이 서서히 그 기능을 잃고 뇌 신경계의 정보전달에 가장 중요한 뇌신경세포의 사멸, 뇌신경세포와 뇌신경세포 사이의 정보를 전달하는 시냅스 의 형성이나 기능상의 문제, 뇌신경의 전기적 활동성의 이상적 증가나 감소로 인하여 야기되는 것으로 알려져 있다. 뇌와 척수의 신경세포들은 위치에 따라 매우 다양한 기능을 하고 있어 어느 부위의 신경세포들이 먼저 손 상되고 기능을 잃어가느냐에 따라, 또 이러한 기능장애가 어떤 형태로 진행되는가에 따라 매우 다양한 임상 양 상을 보이게 된다. 퇴행성 뇌질환은 나타나는 주요 증상과 침범되는 뇌부위를 고려하여 구분할 수 있으며, 알츠하이머 병 (Alzheimer's disease, AD), 파킨슨 병(Parkinson's disease, PD), 헌팅톤 병(Huntington's disease, HD), 다 발성 경화증(Multiple sclerosis, MS) 및 루게릭병으로 알려진 근위축성 측삭 경화증(Amyotrophic lateral sclerosis, ALS) 등이 포함된다. 퇴행성 뇌질환은 노화에 따른 신경퇴화, 유전적 및 환경적 요인들로 인해 단백질이 응집되어 신경세포가 사멸하 여 야기되는 것으로 알려져 있으나, 아직 정확한 원인은 밝혀지지 않아 원인 규명을 위한 기초 연구가 활발히 진행되고 있다. AD는 가장 흔한 퇴행성 뇌질환으로, 대개 만성적이고 진행성으로 나타나며, 점진적인 기억, 판단, 언어능력 등 지적 기능의 감퇴와 일상생활능력, 인격, 행동양상의 장애를 보인다. AD의 주요한 신경병리 소견은 해마와 피질 에 두 가지 단백질이 응집하여 침착되는 것으로, 신경세포 밖에는 아밀로이드베타단백(amyloid beta protein, A ß)으로 구성된 노인반(senile plaque, SP)이, 신경세포 안에는 과인산화된 타우단백질로 이루어진 신경섬유농 축제(neurofibrillary tangle, NFT)가 축적된다. AD의 발병 원인과 기전에 대해서는 아직까지 명확히 밝혀진 바 없으며, 신경전달물질인 아세틸콜린의 합성 감소, Aß의 침착, 타우(Tau)단백의 과인산화로 인한 신경세포의 손 상이 주된 원인으로 알려져 있다. 이외에도 apoE 유전자, α-synuclein 단백질의 변화, 산화적 스트레스 또는 노화에 따른 미엘린(myelin)의 파괴 등도 뇌세포 손상 및 AD 발병에 영향을 미치는 것으로 알려져 있다. AD 환자의 뇌조직을 관찰해 보면 콜린성 신경의 손상이 심각하게 일어난 것이 확인되는데, 이와 같이 AD의 원인 을 콜린성 신경의 손상에 맞추어 설명하는 설을 콜린 가설(Cholinergic Hypothesis in Alzheimer's disease)이 라 하며, 최근 이를 바탕으로 하여 아세틸콜린의 기능저하를 유도하는 아세틸콜린에스터라제의 활성을 저해시키 려는 시도가 많이 이루어지고 있다. 현재 AD의 치료제로 사용되는 약물은 아세틸콜린에스터라제 저해제로서 타 크린(tacrine), 도네페질(donepezil), 리바스티그민(rivastigmine) 그리고 갈란타민(galantamine) 등이 있다. 이 중에 가장 최근에 FDA의 승인을 받아 사용되는 것은 갈란타민이다. 갈란타민은 아세틸콜린의 분해를 막아 시 냅스에서의 아세틸콜린 농도를 유지시킴으로써 저하된 인지기능을 개선시키는 효과를 나타낸다. 하지만 갈란타 민은 독성과 부작용으로 그 효능과 안전성이 의심되고 있으며, 이와 같은 부작용은 대중들의 의심과 두려움을 높여주고 있다. 그러므로 보다 안전하고 효능이 우수한 천연 기능성 소재 개발이 요구되고 있는 실정이다. 꽃양귀비는 피자식물문 쌍자엽식물강 양귀비목 양귀비과 양귀비속(Papaver. L)에 속하며 양귀비속은 전체 140여 종, 북반구에 자생하는 종은 110여종이 알려져 있다. 1년생 화초로 꽃은 5월과 6월 사이에 피고 꽃색은 백색, 홍색, 자색 등 여러 가지가 있으며 꽃잎은 4개이다. 열매는 관상용 양귀비는 털이 있으며, 마약성 양귀비는 보 통 털이 없다. 양귀비는 염증, 기침, 설사, 호흡기 질환, 천식, 불면증, 통증 완화 등의 치료에 쓰이며, 어린 잎에 대한 효능이 보고된 바 있다. 어린 잎은 쌈용으로도 섭취 가능하며 종자의 경우 식품첨가용으로도 사용된 다. 이러한 효능은 고서(동의보감 등)에서부터 본초학에 이르는 학문에서도 기록되어 있으며 약재로 쓰였다. 그러나, 꽃양귀비의 안구건조증 완화 또는 퇴행성 뇌질환 개선 효능에 관해서는 기재된 바 없다. 이에 본 발명자들은, 인체에 부작용이 없으면서 안구건조증 또는 퇴행성 뇌질환 예방 또는 치료 효과를 가지는 천연물 유래 성분의 약물 또는 건강기능식품을 개발하기 위해 노력하던 중, 꽃양귀비 추출물 및 이의 분획물이 산화스트레스에 대한 결막세포를 보호하고 Aβ42 생성량을 억제한다는 것을 확인함으로써, 본 발명을 완성하였 다."}
{"patent_id": "10-2020-0075063", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 기존 화합물 치료제가 갖는 독성과 부작용의 문제가 없고 보다 인체에 안전하며, 효능이 우수 한 안구건조증 또는 퇴행성 뇌질환 예방 또는 치료 효과를 가지는 천연물 유래 성분의 약물 또는 건강기능식품 을 제공하는 것이다."}
{"patent_id": "10-2020-0075063", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명은 꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 안구건조증 예방 또는 치료용 약학적 조 성물을 제공한다. 또한, 본 발명은 상기 꽃양귀비 추출물의 분획물을 유효성분으로 함유하는, 안구건조증 예방 또는 치료용 약학 적 조성물을 제공한다. 또한, 본 발명은 꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 안구건조증 예방 또는 개선용 건 강기능식품 조성물을 제공한다. 또한, 본 발명은 꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물을 제공한다. 또한, 본 발명은 상기 꽃양귀비 추출물의 분획물을 유효성분으로 함유하는, 퇴행성 뇌질환 예방 또는 치료용 약 학적 조성물을 제공한다. 아울러, 본 발명은 꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 퇴행성 뇌질환 예방 또는 개선 용 건강기능식품 조성물을 제공한다."}
{"patent_id": "10-2020-0075063", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 꽃양귀비(Papaver rhoeas) 추출물 또는 이의 분획물은 산화스트레스에 대한 결막세포 보호 활성 정도 를 높이고, 퇴행성 뇌질환의 병증을 완화시킴으로써, 상기 꽃양귀비 추출물 또는 이의 분획물은 안구건조증 또 는 퇴행성 뇌질환의 예방 또는 치료용 약학적 조성물 또는 건강기능식품 조성물로 유용하게 사용될 수 있고, 인 지능 개선 소재의 개발로 고령화 시대의 사회적 비용절감과 삶의 질 향상에 기여할 수 있다."}
{"patent_id": "10-2020-0075063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명을 상세하게 설명한다. 본 발명은 꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 안구건조증 예방 또는 치료용 약학적 조 성물을 제공한다. 본 발명의 조성물에서 유효성분으로 이용되는 꽃양귀비는 양귀비과(Papaveraceae) 양귀비속(Papaver L.)에 속하 는 식물로 우리나라를 비롯하여, 유라시아 등에 분포한다. 1년생 화초로 꽃은 5월과 6월 사이에 피고 꽃색은 백 색, 홍색, 자색 등 여러 가지가 있으며 꽃잎은 4개이다. 열매는 관상용 양귀비는 털이 있으며, 마약성 양귀비는 보통 털이 없다. 꽃양귀비는 염증, 기침, 설사, 호흡기 질환, 천식, 불면증, 통증 완화 등의 치료에 쓰이며, 어 린 잎에 대한 효능이 보고된 바 있다. 어린 잎은 쌈용으로도 섭취 가능하며 종자의 경우 식품첨가용으로도 사용 된다. 이러한 효능은 고서(동의보감 등)에서부터 본초학에 이르는 학문에서도 기록되어 있으며 약재로 쓰였다. 본 발명에서의 꽃양귀비는 Papaver rhoeas이다. 상기 꽃양귀비 추출물은 하기의 단계를 포함하는 제조방법에 의해 제조될 수 있다. 1) 꽃양귀비 추출물을 동결건조하여 균일하게 분쇄하는 단계; 2) 단계 1)의 분쇄물을 추출하는 단계; 3) 단계 2)의 추출물을 여과하는 단계; 및 4) 단계 3의 여과한 추출물을 감압 농축한 후 건조하는 단계. 상기 방법에 있어서, 단계 1)의 꽃양귀비는 재배한 것 또는 시판되는 것 등 제한 없이 사용될 수 있다. 상기 꽃 양귀비는 꽃양귀비의 잎, 줄기 및 열매로 구성된 군으로부터 선택되는 어느 하나 이상일 수 있고, 바람직하게는 꽃양귀비의 잎일 수 있으나, 이에 한정하지 않는다. 상기 방법에 있어서, 단계 2)의 추출 용매는 물, 알코올 및 이들의 혼합용매로 구성되는 군으로부터 선택된 용 매일 수 있다. 상기 알코올은 탄소수 1 내지 4의 알코올일 수 있고, 바람직하게는 상기 알코올은 메탄올 또는 에탄올일 수 있고, 더욱 바람직하게는 상기 알코올은 에탄올일 수 있다. 상기 단계 2)의 추출 방법은 진탕추출, Soxhlet 추출 또는 환류추출일 수 있다. 이때, 추출 온도는 40 내지 80 ℃일 수 있고, 구체적으로 50 내지 70℃일 수 있으나 이에 한정하지 않는다. 또한, 상기 추출 용매는 추출에 사 용되는 꽃양귀비의 중량에 1 내지 20배 첨가될 수 있고, 1 내지 10배일 수 있고, 또는 5 내지 15 배 첨가될 수 있으나, 이에 한정되지 않는다. 또한, 추출 시간은 1 내지 60시간 일 수 있고, 4 내지 58시간일 수 있고, 10 내 지 48시간일 수 있고 또는 15 내지 30시간일 수 있으나 이에 한정되지 않는다. 아울러, 추출 횟수는 1 내지 5회 일 수 있고, 3 내지 5회일 수 있고, 예를 들어 3회 반복 추출하는 것이 바람직하나 이에 한정되는 것은 아니다. 상기 추출 온도, 추출 시간 또는 추출 횟수의 조건을 벗어난 범위에서는 추출이 충분히 이루어지지 않아 꽃양귀 비 추출물 내에 유효성분의 함량이 미미할 수 있다. 또는 더 이상 추출 수율이 증가하지 않아 추출 작업의 효율 이 떨어질 수 있다. 또한, 발명의 일 측면에서 상기 단계 2)의 추출은 에탄올은 10 % ~ 90 %의 에탄올, 20 % ~ 80 %의 에탄올 또는 30 % ~ 70 %의 에탄올 등이 사용가능하며, 추출시간은 2 내지 24 시간, 3 내지 21 시간 또는 5 내지 19시간으로 할 수 있다. 상기 단계 4)의 감압 농축은 진공감압농축기 또는 진공회전증발기를 이용할 수 있다. 또한, 상기 건조는 감압건 조, 진공건조, 비등건조, 분무건조 또는 동결건조일 수 있고, 바람직하게 동결건조할 수 있다. 또한, 상기 추출물은 추가적으로 유기용매로 추출하여 제조된 유기용매의 분획물을 유효성분으로 함유하는 안구 건조증의 예방 또는 치료용 약학적 조성물을 제공한다. 상기 유기용매는 n-헥산, 메틸렌클로라이드,클로로포름, 에틸 아세테이트, 디클로메탄 및 부탄올로 구성된 군으로부터 선택되는 하나 이상의 유기용매일 수 있고, 바람직하게는 헥산, 에틸 아세테이트 및 부탄올로 구성되는 군으로부터 선택되는 하나 이상의 유기용매일 수 있으나 이에 한정하지 않는다. 본 명세서의 \"안구건조증\"은 안구 표면이 손상되어 자극감, 이물감, 건조감 같은 자극증상을 느끼게 되는 눈의 질환을 의미한다. 상기 안구건조증은 눈물샘 또는 마이봄선(Meibomian gland)의 염증 및 각막의 탈신경화에 의 하여 눈물 분비가 억제되거나 비정상적인 눈물 증발 등에 의하여 발생할 수 있다. 이러한 안구건조증이 심화되 어 눈물이 과다 건조되면 각막의 상처로 나타나는 각결막 상피장애가 야기될 수 있다. 현재, 안구건조증의 치료 제로 항염증 활성을 나타내는 시클로스포린 A(Cyclosporin A), 플루오로메톨론(Fluorometholone) 등이 사용되고 있음에 따라, 안구건조증은 염증의 감소에 인하여 치료 또는 개선의 효과가 달성될 수 있음은 자명하다. 상기 약학적 조성물은 생물학적 제제에 통상적으로 사용되는 담체, 희석제, 부형제 또는 이의 혼합물을 포함할 수 있다. 약학적으로 허용 가능한 담체는 조성물을 생체 내에 전달하는데 적합한 것이면 모두 사용할 수 있다. 구체적으로, 상기 담체는 Merck Index, 13th ed., Merck & Co. Inc.에 기재된 화합물, 식염수, 멸균수, 링거액, 덱스트로스 용액, 말토덱스트린 용액, 글리세롤, 에탄올 또는 이의 혼합물일 수 있다. 또한, 필요에 따 라 항산화제, 완충액, 정균제 등과 같은 통상의 첨가제를 첨가할 수 있다. 상기 조성물을 제제화하는 경우, 보통 사용하는 충진제, 증량제, 결합제, 습윤제, 붕해제, 계면활성제 등의 희 석제 또는 부형제를 첨가할 수 있다. 본 발명의 조성물은 경구용 제제 또는 비경구용 제제로 제형화될 수 있다. 경구용 제제로는 고형 제제 및 액상 제제가 포함될 수 있다. 상기 고형 제제는 정제, 환제, 산제, 과립제, 캡슐제 또는 트로키제일 수 있고, 이러한 고형 제제는 상기 조성물에 적어도 하나 이상의 부형제를 첨가하여 조제할 수 있다. 상기 부형제는 전분, 탄산 칼슘, 수크로스, 락토오스, 젤라틴 또는 이의 혼합물일 수 있다. 또한, 상기 고형 제제는 윤활제를 포함할 수 있고, 그 예로는 마그네슘 스티레이트, 탈크 등이 있다. 한편, 상기 액상 제제는 현탁제, 내용액제, 유제 또는 시럽제일 수 있다. 이때, 상기 액상 제제에는 습윤제, 감미제, 방향제, 보존제 등과 같은 부형제가 포함될 수 있다. 상기 비경구용 제제는 주사제, 좌제, 호흡기 흡입용 분말, 스프레이용 에어로졸제, 파우더 및 크림 등을 포함할 수 있다. 상기 주사제는 멸균된 수용액, 비수성용제, 현탁용제, 유제 등을 포함할 수 있다. 이때, 비수성용제 또는 현탁용제로서는 프로필렌글리콜, 폴리에틸렌글리콜, 올리브 오일과 같은 식물성 기름이나, 에틸올레이트와 같이 주사가능한 에스테르 등이 사용될 수 있다. 본 발명의 조성물은 목적하는 방법에 따라 경구 또는 비경구로 투여될 수 있다. 비경구 투여는 복강내, 직장내, 피하, 정맥, 근육내 또는 흉부내 주사방식을 포함할 수 있다. 상기 조성물은 약제학적으로 유효한 양으로 투여될 수 있다. 이는 질환의 종류, 중증도, 약물의 활성, 약물에 대한 환자의 민감도, 투여 시간, 투여 경로, 치료기간, 동시에 사용되는 약물 등에 따라 달라질 수 있다. 그러 나 바람직한 효과를 위해서, 본 발명에 따른 약학 조성물에 포함되는 유효성분의 양은 0.0001 내지 1,000 ㎎/㎏, 구체적으로 0.001 내지 500 ㎎/㎏일 수 있다. 상기 투여는 하루에 1회 수회일 수 있다. 본 발명의 조성물은 단독 또는 다른 치료제와 병용하여 투여될 수 있다. 병용 투여시, 투여는 순차적 또는 동시 일 수 있다. 또한, 본 발명은 꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 안구건조증 예방 또는 개선용 건 강기능식품 조성물을 제공한다. 상기 건강기능식품 조성물의 유효성분인 꽃양귀비 추출물은 상기 약학적 조성물의 꽃양귀비 추출물의 제조방법 과 동일한 방법으로 제조할 수 있다. 본 명세서의 \"건강기능식품\"이란 일상 식사에서 결핍되기 쉬운 영양소나 인체에 유용한 기능을 가진 원료나 성 분을 사용하여 제조한 식품으로, 인체의 건강을 유지하는데 도움을 주는 식품을 의미하나 이에 한정되지 않으며 통상적인 의미의 건강식품을 모두 포함하는 의미로 사용한다. 건강기능식품의 형태 및 종류는 특별히 제한되지 않는다. 구체적으로, 상기 건강기능식품은 정제, 캅셀, 분말, 과립, 액상 및 환의 형태일 수 있다. 상기 건강기능식품은 추가성분으로서 여러 가지 향미제, 감미제 또는 천연 탄수화물을 포함할 수 있다. 상기 감미제는 천연 또는 합성 감미제일 수 있고, 천연 감미제의 예로는 타우마틴, 스테비아 추출물 등이 있다. 한편, 합성 감미제의 예로는 사카린, 아스파르탐 등이 있다. 또한, 상기 천연 탄수 화물은 모노사카라이드, 디사카라이드, 폴리사카라이드, 올리고당 및 당알코올 등일 수 있다. 본 발명의 건강기능식품은 상기 서술한 추가성분 외에, 영양제, 비타민, 전해질, 풍미제, 착색제, 펙스탄 및 그 의 염, 알긴산 및 그의 염, 유기산, 보호성 콜로이드 증점제, pH 조절제, 안정화제, 방부제, 글리세린, 알코올 등을 더 포함할 수 있다. 이러한 성분은 독립적으로 또는 조합으로 사용될 수 있다. 상기 첨가제의 비율은 본 발명의 조성물의 100 중량부당 0.01 내지 0.1 중량부의 범위에서 선택될 수 있다. 본 발명의 꽃양귀비 추출물 또는 이의 분획물은 식품에 그대로 첨가하거나 다른 식품 또는 식품 성분과 함께 사 용될 수 있다. 이때, 첨가되는 유효성분의 함량은 목적에 따라 결정될 수 있다. 일반적으로, 건강기능식품 중의 함량은 전체 식품 중량의 0.01 내지 90 중량부일 수 있다. 그러나 건강 및 위생을 목적으로 하거나 또는 건강 조절을 목적으로 하는 장기간의 섭취의 경우에는 상기 양은 상기 범위 이하일 수 있으며, 안전성 면에서 아무런 문제가 없다면 유효성분은 상기 범위 이상의 양으로도 사용될 수 있다. 또한, 본 발명은 꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 퇴행성 뇌질환 예방 또는 치료용 약학적 조성물을 제공한다. 본 발명의 조성물에서 유효성분으로 이용되는 꽃양귀비는 양귀비과(Papaveraceae) 양귀비속(Papaver L.)에 속하 는 식물로 우리나라를 비롯하여, 유라시아 등에 분포한다. 1년생 화초로 꽃은 5월과 6월 사이에 피고 꽃색은 백 색, 홍색, 자색 등 여러 가지가 있으며 꽃잎은 4개이다. 열매는 관상용 양귀비는 털이 있으며, 마약성 양귀비는 보통 털이 없다. 꽃양귀비는 염증, 기침, 설사, 호흡기 질환, 천식, 불면증, 통증 완화 등의 치료에 쓰이며, 어 린 잎에 대한 효능이 보고된 바 있다. 어린 잎은 쌈용으로도 섭취 가능하며 종자의 경우 식품첨가용으로도 사용 된다. 이러한 효능은 고서(동의보감 등)에서부터 본초학에 이르는 학문에서도 기록되어 있으며 약재로 쓰였다. 본 발명에서의 꽃양귀비는 Papaver rhoeas이다. 상기 꽃양귀비 추출물은 하기의 단계를 포함하는 제조방법에 의해 제조될 수 있다. 1) 꽃양귀비 추출물을 동결건조하여 균일하게 분쇄하는 단계; 2) 단계 1)의 분쇄물을 추출하는 단계; 3) 단계 2)의 추출물을 여과하는 단계; 및 4) 단계 3의 여과한 추출물을 감압 농축한 후 건조하는 단계. 상기 방법에 있어서, 단계 1)의 꽃양귀비는 재배한 것 또는 시판되는 것 등 제한 없이 사용될 수 있다. 상기 꽃 양귀비는 꽃양귀비의 잎, 줄기 및 열매로 구성된 군으로부터 선택되는 어느 하나 이상일 수 있고, 바람직하게는 꽃양귀비의 잎일 수 있으나, 이에 한정하지 않는다. 상기 방법에 있어서, 단계 2)의 추출 용매는 물, 알코올 및 이들의 혼합용매로 구성되는 군으로부터 선택된 용 매일 수 있다. 상기 알코올은 탄소수 1 내지 4의 알코올일 수 있고, 바람직하게는 상기 알코올은 메탄올 또는 에탄올일 수 있고, 더욱 바람직하게는 상기 알코올은 에탄올일 수 있다. 상기 단계 2)의 추출 방법은 진탕추출, Soxhlet 추출 또는 환류추출일 수 있다. 이때, 추출 온도는 40 내지 80 ℃일 수 있고, 구체적으로 50 내지 70℃일 수 있으나 이에 한정하지 않는다. 또한, 상기 추출 용매는 추출에 사 용되는 꽃양귀비의 중량에 1 내지 20배 첨가될 수 있고, 1 내지 10배일 수 있고, 또는 5 내지 15 배 첨가될 수 있으나, 이에 한정되지 않는다. 또한, 추출 시간은 1 내지 60시간 일 수 있고, 4 내지 58시간일 수 있고, 10 내 지 48시간일 수 있고 또는 15 내지 30시간일 수 있으나 이에 한정되지 않는다. 아울러, 추출 횟수는 1 내지 5회 일 수 있고, 3 내지 5회일 수 있고, 예를 들어 3회 반복 추출하는 것이 바람직하나 이에 한정되는 것은 아니다.상기 추출 온도, 추출 시간 또는 추출 횟수의 조건을 벗어난 범위에서는 추출이 충분히 이루어지지 않아 꽃양귀 비 추출물 내에 유효성분의 함량이 미미할 수 있다. 또는 더 이상 추출 수율이 증가하지 않아 추출 작업의 효율 이 떨어질 수 있다. 또한, 발명의 일 측면에서 상기 단계 2)의 추출은 에탄올은 10 % ~ 90 %의 에탄올, 20 % ~ 80 %의 에탄올 또는 30 % ~ 70 %의 에탄올 등이 사용가능하며, 추출시간은 2 내지 24 시간, 3 내지 21 시간 또는 5 내지 19시간으로 할 수 있다. 상기 단계 4)의 감압 농축은 진공감압농축기 또는 진공회전증발기를 이용할 수 있다. 또한, 상기 건조는 감압건 조, 진공건조, 비등건조, 분무건조 또는 동결건조일 수 있고, 바람직하게 동결건조할 수 있다. 또한, 상기 추출물은 추가적으로 유기용매로 추출하여 제조된 유기용매의 분획물을 유효성분으로 함유하는 퇴행 성 뇌질환의 예방 또는 치료용 약학적 조성물을 제공한다. 상기 유기용매는 n-헥산, 메틸렌클로라이드, 클로로 포름, 에틸 아세테이트, 디클로메탄 및 부탄올로 구성된 군으로부터 선택되는 하나 이상의 유기용매일 수 있고, 바람직하게는 헥산, 에틸 아세테이트 및 부탄올로 구성되는 군으로부터 선택되는 하나 이상의 유기용매일 수 있 으나 이에 한정하지 않는다. 본 발명의 \"퇴행성 뇌질환\"은 나이가 들어감에 따라 발생하는 퇴행성 질환 중에서 뇌에서 발생하는 질환을 뜻한 다. 상기 퇴행성 뇌질환은 나이가 들어감에 따라 발생하는 퇴행성 질환 중에서도 뇌에서 발생하는 질환을 말하 며, 알츠하이머 병(Alzheimer's disease, AD), 파킨슨 병(Parkinson's disease, PD), 헌팅톤 병(Huntington's disease, HD), 다발성 경화증(Multiple sclerosis, MS) 및 근위축성 측삭 경화증(amyotrophic lateral sclerosis, ALS) 등일 수 있다. 상기 약학적 조성물은 생물학적 제제에 통상적으로 사용되는 담체, 희석제, 부형제 또는 이의 혼합물을 포함할 수 있다. 약학적으로 허용 가능한 담체는 조성물을 생체 내에 전달하는데 적합한 것이면 모두 사용할 수 있다. 구체적으로, 상기 담체는 Merck Index, 13th ed., Merck & Co. Inc.에 기재된 화합물, 식염수, 멸균수, 링거액, 덱스트로스 용액, 말토덱스트린 용액, 글리세롤, 에탄올 또는 이의 혼합물일 수 있다. 또한, 필요에 따 라 항산화제, 완충액, 정균제 등과 같은 통상의 첨가제를 첨가할 수 있다. 상기 조성물을 제제화하는 경우, 보통 사용하는 충진제, 증량제, 결합제, 습윤제, 붕해제, 계면활성제 등의 희 석제 또는 부형제를 첨가할 수 있다. 본 발명의 조성물은 경구용 제제 또는 비경구용 제제로 제형화될 수 있다. 경구용 제제로는 고형 제제 및 액상 제제가 포함될 수 있다. 상기 고형 제제는 정제, 환제, 산제, 과립제, 캡슐제 또는 트로키제일 수 있고, 이러한 고형 제제는 상기 조성물에 적어도 하나 이상의 부형제를 첨가하여 조제할 수 있다. 상기 부형제는 전분, 탄산 칼슘, 수크로스, 락토오스, 젤라틴 또는 이의 혼합물일 수 있다. 또한, 상기 고형 제제는 윤활제를 포함할 수 있고, 그 예로는 마그네슘 스티레이트, 탈크 등이 있다. 한편, 상기 액상 제제는 현탁제, 내용액제, 유제 또는 시럽제일 수 있다. 이때, 상기 액상 제제에는 습윤제, 감미제, 방향제, 보존제 등과 같은 부형제가 포함될 수 있다. 상기 비경구용 제제는 주사제, 좌제, 호흡기 흡입용 분말, 스프레이용 에어로졸제, 파우더 및 크림 등을 포함할 수 있다. 상기 주사제는 멸균된 수용액, 비수성용제, 현탁용제, 유제 등을 포함할 수 있다. 이때, 비수성용제 또는 현탁용제로서는 프로필렌글리콜, 폴리에틸렌글리콜, 올리브 오일과 같은 식물성 기름이나, 에틸올레이트와 같이 주사가능한 에스테르 등이 사용될 수 있다. 본 발명의 조성물은 목적하는 방법에 따라 경구 또는 비경구로 투여될 수 있다. 비경구 투여는 복강내, 직장내, 피하, 정맥, 근육내 또는 흉부내 주사방식을 포함할 수 있다. 상기 조성물은 약제학적으로 유효한 양으로 투여될 수 있다. 이는 질환의 종류, 중증도, 약물의 활성, 약물에 대한 환자의 민감도, 투여 시간, 투여 경로, 치료기간, 동시에 사용되는 약물 등에 따라 달라질 수 있다. 그러 나 바람직한 효과를 위해서, 본 발명에 따른 약학 조성물에 포함되는 유효성분의 양은 0.0001 내지 1,000 ㎎/㎏, 구체적으로 0.001 내지 500 ㎎/㎏일 수 있다. 상기 투여는 하루에 1회 수회일 수 있다. 본 발명의 조성물은 단독 또는 다른 치료제와 병용하여 투여될 수 있다. 병용 투여시, 투여는 순차적 또는 동시 일 수 있다. 또한, 본 발명은 꽃양귀비(Papaver rhoeas) 추출물을 유효성분으로 함유하는, 퇴행성 뇌질환 예방 또는 개선용 건강기능식품 조성물을 제공한다. 상기 건강기능식품 조성물의 유효성분인 꽃양귀비 추출물은 상기 약학적 조성물의 꽃양귀비 추출물의 제조방법 과 동일한 방법으로 제조할 수 있다. 본 명세서의 \"건강기능식품\"이란 일상 식사에서 결핍되기 쉬운 영양소나 인체에 유용한 기능을 가진 원료나 성 분을 사용하여 제조한 식품으로, 인체의 건강을 유지하는데 도움을 주는 식품을 의미하나 이에 한정되지 않으며 통상적인 의미의 건강식품을 모두 포함하는 의미로 사용한다. 건강기능식품의 형태 및 종류는 특별히 제한되지 않는다. 구체적으로, 상기 건강기능식품은 정제, 캅셀, 분말, 과립, 액상 및 환의 형태일 수 있다. 상기 건강기능식품은 추가성분으로서 여러 가지 향미제, 감미제 또는 천연 탄수화물을 포함할 수 있다. 상기 감미제는 천연 또는 합성 감미제일 수 있고, 천연 감미제의 예로는 타우마틴, 스테비아 추출물 등이 있다. 한편, 합성 감미제의 예로는 사카린, 아스파르탐 등이 있다. 또한, 상기 천연 탄수 화물은 모노사카라이드, 디사카라이드, 폴리사카라이드, 올리고당 및 당알코올 등일 수 있다. 본 발명의 건강기능식품은 상기 서술한 추가성분 외에, 영양제, 비타민, 전해질, 풍미제, 착색제, 펙스탄 및 그 의 염, 알긴산 및 그의 염, 유기산, 보호성 콜로이드 증점제, pH 조절제, 안정화제, 방부제, 글리세린, 알코올 등을 더 포함할 수 있다. 이러한 성분은 독립적으로 또는 조합으로 사용될 수 있다. 상기 첨가제의 비율은 본 발명의 조성물의 100 중량부당 0.01 내지 0.1 중량부의 범위에서 선택될 수 있다. 본 발명의 꽃양귀비 추출물 또는 이의 분획물은 식품에 그대로 첨가하거나 다른 식품 또는 식품 성분과 함께 사 용될 수 있다. 이때, 첨가되는 유효성분의 함량은 목적에 따라 결정될 수 있다. 일반적으로, 건강기능식품 중의 함량은 전체 식품 중량의 0.01 내지 90 중량부일 수 있다. 그러나 건강 및 위생을 목적으로 하거나 또는 건강 조절을 목적으로 하는 장기간의 섭취의 경우에는 상기 양은 상기 범위 이하일 수 있으며, 안전성 면에서 아무런 문제가 없다면 유효성분은 상기 범위 이상의 양으로도 사용될 수 있다. 본 발명의 꽃양귀비(Papaver rhoeas) 추출물 또는 이의 분획물은 산화스트레스에 대한 결막세포 보호 활성 정도 를 높여 안구건조증의 병증을 개선시키고(도 1, 2 및 3 참조), 퇴행성 뇌질환의 주요 인자인 아밀로이드 베타 단백질 중 하나인 Aβ42의 생성을 억제하여 퇴행성 뇌질환의 병증을 완화시킴으로써(도 4 참조), 상기 꽃양귀비 추출물 또는 이의 분획물은 안구건조증 또는 퇴행성 뇌질환의 예방 또는 치료용 약학적 조성물로 유용하게 사용 될 수 있고, 인지능 개선 소재의 개발로 고령화 시대의 사회적 비용절감과 삶의 질 향상에 기여할 수 있다. 이하, 본 발명을 실시예 및 실험예를 통해 상세히 설명한다. 단, 후술하는 실시예 및 실험예는 본 발명을 일 측면에서 구체적으로 예시하는 것일 뿐, 본 발명이 이에 제한되 는 것은 아니다. <실시예 1> 꽃양귀비 추출물의 제조 꽃양귀비 추출물을 제조하기 위해 꽃양귀(papaver rhoeas) 종자(rhoeas A)를 국립농업과학원 농업생명부 유전체 과로부터 제공받아 국립원예특작과학원 인삼특작부 포장(충북 음성 소재)에서 재배하였다. 꽃양귀비 잎을 씻은 후 동결건조(PVTFD 10R, Ilsin Lab., Yangju, Korea)하여 균일하게 분쇄하여 실험에 사용 하였다. 시료 50g에 중량 대비 20배의 50% 에탄올을 가하여 실온에서 160rpm으로 19시간 동안 교반추출(Jeio tech sa-71, Lab companion, Daejeon, Korea)하였다. 추출물은 paper(No.2)(ADVANTEC Co., Tokyo, Japan)를 이용해 감압 여과하고 34℃에서 감압농축(EYELA N-1000. Riakikai Co., Ltd., Tokyo, Japan)한 후 동결건조하 여 -70℃에서 보관하면서 평가를 위한 시료로 사용하였다. <실시예 2> 꽃양귀비 추출물의 분획물 제조 실시예 1에서 수득한 추출물을 증류수에 혼탁하고, n-헥산(n-Hexane, Hex)을 가하여 충분히 흔들어 준 후, 일정 시간 정치하였다. 상기 과정을 2회 이상 반복하여 헥산 분획층을 수득하였으며, 이를 여과한 후 감압 농축하여 최종적으로 헥산 분획물을 얻었다. 상기와 같은 방법에 따라, 에틸 아세테이트(ethyl acetate, EA), n-부탄올 (n-Buthanol, BuOH), 물의 순서로 순차 분획하여 각각의 최종 분획물을 얻었고, 추출물로부터 헥산 분획물, EA 분획물, BuOH 분획물 및 물 분획물을 수득하였다. Total은 상기 추출물을 Dulbecco's Phosphate Buffered Saline(DPBS)에 녹인 후 DMSO(Di-Methyl Sulfoxide)에 녹인 것을 나타낸 것이다(50% DMSO in DPBS). <실험예 1> 꽃양귀비 추출물 투여에 따른 안구건조증 완화 효능 확인 1-1. 실험 준비 본 실험에 사용된 인간 결막세포주인 Clone 1-5c-4 세포는 한국세포주은행(Korea Cell Line Bank, Seoul, Korea)으로부터 구입하였다. Clone 1-5c-4 세포는 10% fatal bovine serum(FBS; Gibco; Thermo fisher scientific, inc., Waltham, MA, USA)와 100units/mL penicillin, 100μg/mL streptomycin(Invitrogen, Thermo fisher scientific, inc., Waltham, MA, USA)를 첨가한 Roswell Park Memorial Institute 1640(RPMI 1640; Gibco) 배지를 사용하여 37℃, 5% CO2 조건에서 배양하였다. 세포 밀도가 70~80%로 포화되었을 때 0.05% trypsin-%-EDTA(Invitrogen)를 처리하여 계대배양하며 실험에 사용하였다. 1-2. 결막세포에 대한 세포 독성 확인 결막세포에 대한 꽃양귀비 추출물의 세포 독성을 확인하고자 꽃양귀비 추출물을 농도 별(0 내지 100μg/mL)로 처리하여 세포 생존율을 확인하였다. 또한, 결막세포에 대한 화학적 자극원인 benzalkonium chloride(BAC; sigma) 처리 농도(0 내지 0.1%)에 따른 세포 생존을 확인하였다. 구체적으로, BAC, carboxymethyl cellulose sodium salt(CMC; sigma) 및 추출물 처리에 따른 결막세포 생존율 은 Ez-Cytox cell viability assay kit(DAEIL Lab, Seoul, Korea)를 사용하였으며, 제조사에서 권장하는 실험 방법에 따라 측정하였다. Clone 1-5c-4 세포를 96 well plate에 최종농도 2×104cells/well이 되도록 분주한 뒤 24시간 배양하였다. 실험 시작 6시간 전 FBS를 제거한 배지로 바꿨으며, 3시간 배양 후 CMC, BAC 및 추출물을 농도 별로 처리하여 24시간 배양하였다. 반응 종료 후 Ez-Cytox 시약 20μL를 넣고 4시간 배양 후 480nm에서 흡 광도를 측정하였다. 실험군의 세포 생존율은 대조군에 대한 생존율로 나타내었다. 그 결과, 꽃양귀비 추출물의 경우 100μg/mL의 농도까지 결막세포 독성을 나타내지 않았다(도 1). 또한, BAC 처 리 농도(0∼0.1%)에 따른 세포 생존을 확인한 결과, BAC에 노출된 Clone 1-5c-4 세포에서 0.01%까지 농도 의존 적으로 세포 생존율이 감소되었다(도 2). 무처리군 대비 세포 생존율이 40% 이상 감소한 0.005% BAC의 농도를 이후 진행되는 간세포 보호 활성 평가의 음성대조군으로 결정하였다. 1-3. 결막세포 보호 활성 측정 결막세포에 대한 세포 보호 활성을 확인하기 위해, 꽃양귀비 추출물을 결막세포에 처리한 뒤 결막세포 보호 활 성 정도를 측정하였다. 구체적으로, BAC 처리에 대한 결막세포 보호 활성은 Ez-Cytox cell viability assay kit(DAEIL Lab)를 사용하 였으며, 제조사에서 권장하는 실험 방법에 따라 측정하였다. Clone 1-5c-4 세포를 96 well plate에 최종농도 2 ×104 cells/mL가 되도록 분주한 뒤 24시간 배양하였다. 실험 시작 6시간 전 FBS를 제거한 배지로 바꿨으며, 3 시간 배양 후 0.5% CMC와 각 추출물을 농도 별로 처리하여 3시간 배양하였다. 0.005% BAC를 15분간 처리하고 PBS(pH7.4)로 3회 세척 후 FBS가 첨가된 배양배지를 넣어 20시간 배양하였다. 반응 종료 후 Ez-Cytox 시약 20μ L를 넣고 4시간 배양한 후 480nm에서 흡광도를 측정하였다. 실험군의 세포 생존율은 대조군에 대한 생존율로 나타내었다. 모든 실험은 3회 이상 반복하였으며, 실험으로부터 얻은 결과는 SPSS 통계프로그램(Statistical Package for the Social Science, ver. 12.0, SPSS Inc., Chicago, IL, USA)을 이용하여 각 실험군의 평균과 표준편차를 산출하였다. 통계적 유의성 검정은 일원배치 분산 분석(one-way analysis of variance)을 한 후 p<0.05 수준에서 Duncan's multiple range test를 수행하였다. 20시간 배양 후 세포 생존율 변화를 확인한 결과, BAC를 단독으로 처리한 세포에서보다 꽃양귀비 추출물(2.5 내지 20㎍/㎖)을 처리한 결막세포의 생존율이 증가하는 것을 확인하였다(도 3). <실험예 2> 꽃양귀비 추출물의 분획물 투여에 따른 퇴행성 뇌질환 개선 효능 확인 꽃양귀비의 퇴행성 뇌질환 개선 효능을 확인하기 위해, 실시예 2에서 제조한 꽃양귀비 추출물의 분획물을 투여 하여 Aβ42의 생성 억제 정도를 측정하였다. Aβ42는 퇴행성 뇌질환 환자의 뇌에서 발견되는 아밀로이드 플라크 의 주성분으로서 퇴행성 뇌질환에 결정적으로 관여하는 베타아밀로이드 단백질 중의 하나이다. 구체적으로, Aβ42 농도는 ELISA kit를 이용하여 측정하였다. HeLa 세포를 6 well plate에 최종농도 6×105 cells/well가 되도록 분주한 후 24시간 배양하였다. 1μM justicidin A와 각 추출물을 50 μg/mL로 처리하여 8 시간 배양하였다. 반응 종료 후 배양액은 1:3의 비율로 buffer와 희석하였다. 각 추출물 처리에 따른 Aβ42의 양은 ELISA Kit 제조사의 방법에 따라 측정되었다. 즉, detection antibody를 처리하여 실온에서 3시간 반응시 킨 후 wash buffer를 이용하여 세척하였다. 이후 anti-rabbit igG HRP를 처리하여 실온에서 30분 반응시킨 후 wash buffer를 이용하여 세척하였다. 세척된 각 well에 chromogen을 100 μL씩 넣고 암소에서 30분 반응시켰다. 이후 동량의 stop solution을 넣어 반응을 종료시키고 450 nm에서 흡광도를 측정하였다. 그 결과, 대조군 대비 꽃양귀비 잎 추출물의 에틸 아세테이트 분획물에서 배지 내 Aβ42가 유의적으로 감소하는 것을 확인하였다(도 4). 이는, 꽃양귀비 잎의 추출물 또는 이의 분획물이 아밀로이드 베타 단백질을 억제하고, 그로써 퇴행성 뇌질환을 개선하는 용도로 이용될 수 있음을 제시한다."}
{"patent_id": "10-2020-0075063", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 꽃양귀비 잎 추출물의 세포 독성을 확인하기 위해, 꽃양귀비 잎 추출물의 농도에 따른 결막세포 생존율 을 나타낸 그래프이다. 도 2는 염화 벤잘코늄(benzalkonium chloride, BAC)에 대한 결막세포 생존율을 농도 별로 나타낸 그래프이다. 도 3은 꽃양귀비 잎 추출물의 결막세포 보호 효과를 확인하기 위해, 꽃양귀비 잎 추출물의 농도에 따른 결막세포 생존율을 나타낸 그래프이다. 도 4는 꽃양귀비 잎 추출물의 분획물의 퇴행성 뇌질환 개선 효과를 확인하기 위해, 상기 추출물 또는 분획물의 Aβ42의 억제 효과를 나타낸 그래프이다."}
