{"patent_id": "10-2021-0008893", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0095579", "출원번호": "10-2021-0008893", "발명의 명칭": "아이템 추천방법, 시스템, 전자기기 및 기록매체", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "천, 량휘"}}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라이브러리 중 각각의 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축하는 단계;상기 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 유저의 상기 적어도 2개의 특징 정보를사용하여, 유저 특징 표현을 획득하는 단계;상기 유저 특징 표현 및 상기 아이템 특징 표현 데이터베이스에 기초하여, 추천할 N개 아이템의 식별자를 획득하는 단계;상기 N개 아이템의 식별자에 기초하여, 상기 유저에게 상기 N개 아이템의 관련 정보를 추천하는 단계;를 포함하는 것을 특징으로 하는,아이템 추천 방법."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 유저 특징 표현 및 상기 아이템 특징 표현 데이터베이스에 기초하여, 추천할 N개 아이템의 식별자를 획득하는 단계는,상기 아이템 특징 표현 데이터베이스에서 상기 유저 특징 표현과 관련성이 가장 높은 N개 아이템 특징 표현을검색하는 단계,상기 N개 아이템 특징 표현에 대응되는 상기 N개 아이템의 식별자를 획득하는 단계를 포함하는 것을 특징으로하는,아이템 추천 방법."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델은, 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈을포함하며, 상기 리콜 태스크 모듈과 상기 클릭률 추정 태스크 모듈 사이는 연합 학습(co-training)을 거치는 것을 특징으로 하는,아이템 추천 방법."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "복수개의 훈련 데이터를 수집하는 단계; 상기 복수개의 훈련 데이터를 사용하여, 상기 유저가 아이템을 클릭하는 태스크 모델 중의 리콜 태스크 모듈 및클릭률 추정 태스크 모듈에 대해 연합 학습을 진행하는 단계;를 포함하며,각각의 상기 훈련 데이터는 훈련 유저의 적어도 2개의 훈련 특징 정보, 훈련 아이템의 적어도 2개의 훈련 특징정보 및 상기 훈련 유저가 상기 훈련 아이템에 대한 클릭 상호작용 정보를 포함하는 것을 특징으로 하는,유저가 아이템을 클릭하는 태스크 모델의 훈련 방법.공개특허 10-2021-0095579-3-청구항 5 제4항에 있어서,상기 복수개의 훈련 데이터를 사용하여, 상기 유저가 아이템을 클릭하는 태스크 모델 중의 리콜 태스크 모듈 및클릭률 추정 태스크 모듈에 대해 연합 학습을 진행하는 단계는:각각의 상기 훈련 데이터에 대하여, 상기 훈련 유저의 적어도 2개의 특징 정보를 임베딩(embedding) 표현 후 접합시켜, 훈련 유저의 조합적 특징 표현을 얻는 단계,상기 훈련 아이템의 적어도 2개의 훈련 특징 정보를 임베딩 표현 후 접합시켜, 훈련 아이템의 조합적 특징 표현을 얻는 단계,상기 리콜 태스크 모듈에서, 상기 훈련 유저의 조합적 특징 표현 및 상기 훈련 아이템의 조합적 특징 표현을 각각 완전연결 처리 및 활성화 처리의 처리 계층을 포함하는 적어도 2개 계층의 처리를 거쳐, 훈련 유저의 특징표현 및 훈련 아이템 특징 표현을 얻는 단계,상기 리콜 태스크 모듈에서 상기 훈련 유저의 특징 표현과 상기 훈련 아이템 특징 표현을 곱하여 상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스를 얻는 단계,상기 클릭률 추정 태스크 모듈에서, 상기 훈련 유저의 조합적 특징 표현과 상기 훈련 아이템의 조합적 특징 표현을 접합시켜, 순차적으로 완전연결 처리 및 활성화 처리의 처리 계층 및 sigmoid 활성화 함수 처리 계층을 포함하는 적어도 2개 계층의 처리를 거쳐, 상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률을 얻는 단계,상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스, 상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률, 기지된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 포괄적인 교차-엔트로피 손실 함수를 생성하는 단계,상기 포괄적인 교차-엔트로피 손실 함수가 수렴되는지 여부를 판단하고, 수렴되지 않을 경우, 상기 유저가 아이템을 클릭하는 태스크 모델의 파라미터를 조정하는 단계, 수렴될 경우, 제1 연속 예정 루프 수의 훈련에서 전부 수렴되었는지 여부를 판단하고, 수렴되었을 경우, 상기유저가 아이템을 클릭하는 태스크 모델의 파라미터를 결정하여, 상기 유저가 아이템을 클릭하는 태스크 모델을결정하는 단계를 포함하는 것을 특징으로 하는,유저가 아이템을 클릭하는 태스크 모델의 훈련 방법."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스, 상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률, 기지된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 포괄적인 교차-엔트로피 손실 함수를 생성하는 단계는;상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스 및 기지된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 제1 교차-엔트로피 함수를 생성하는 단계,상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률 및 기지된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 제2 교차-엔트로피 함수를 생성하는 단계,상기 제1 교차-엔트로피 함수와 상기 제2 교차-엔트로피 함수의 합을 구하여, 상기 포괄적인 교차-엔트로피 손실 함수를 얻는 단계를 포함하는 것을 특징으로 하는,유저가 아이템을 클릭하는 태스크 모델의 훈련 방법."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,공개특허 10-2021-0095579-4-상기 포괄적인 교차-엔트로피 손실 함수가 상기 제1 연속 예정 루프 수의 훈련에서 전부 수렴한다고 판단되는경우, 상술한 방법은:계속하여 상기 복수개의 훈련 데이터를 사용하여, 상기 제1 교차-엔트로피 함수가 제2 연속 예정 루프 수의 훈련에서 전부 수렴될 때까지, 상기 리콜 태스크 모듈을 훈련하며, 상기 리콜 태스크 모듈의 파라미터를결정하여, 상기 리콜 태스크 모듈을 결정하며, 따라서 상기 유저가 아이템을 클릭하는 태스크 모델을 결정하는단계를 더 포함하는 것을 특징으로 하는,유저가 아이템을 클릭하는 태스크 모델의 훈련 방법."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라이브러리 중 각 아이템의 적어도2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축하는 구축 모듈;상기 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특징 정보를 사용하여, 유저 특징 표현을 획득하는 특징 획득 모듈;상기 유저 특징 표현 및 상기 아이템 특징 표현 데이터베이스에 기초하여, 추천할 N개 아이템의 식별자를 획득하는 아이템 획득 모듈;상기 N개 아이템의 식별자에 기초하여, 상기 유저에게 상기 N개 아이템의 관련 정보를 추천하는 추천 모듈;을 포함하는 것을 특징으로 하는,아이템 추천 시스템."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 아이템 획득 모듈은:상기 아이템 특징 표현 데이터베이스에서 상기 유저 특징 표현과 관련성이 가장 높은 N개 아이템 특징 표현을검색하고,상기 N개 아이템 특징 표현에 대응되는 상기 N개 아이템의 식별자를 획득하는 것을 특징으로 하는,아이템 추천 시스템."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항 또는 제9항에 있어서,상기 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델은 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈을포함하며, 상기 리콜 태스크 모듈과 상기 클릭률 추정 태스크 모듈 사이는 연합 학습을 거치는 것을 특징으로 하는, 아이템 추천 시스템."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "복수개의 훈련 데이터를 수집하는 수집모듈;상기 복수개의 훈련 데이터를 사용하여, 상기 유저가 아이템을 클릭하는 태스크 모델 중의 리콜 태스크 모듈 및클릭률 추정 태스크 모듈에 대해 연합 학습을 진행하는 훈련 모듈;을 포함하며,각각의 상기 훈련 데이터는 훈련 유저의 적어도 2개의 훈련 특징 정보, 훈련 아이템의 적어도 2개의 훈련 특징정보 및 상기 훈련 유저가 상기 훈련 아이템에 대한 클릭 상호작용 정보를 포함하는 것을 특징으로 하는,유저가 아이템을 클릭하는 태스크 모델의 훈련 장치.공개특허 10-2021-0095579-5-청구항 12 제11항에 있어서,상기 훈련 모듈은: 각각의 상기 훈련 데이터에 대하여, 상기 훈련 유저의 적어도 2개의 특징 정보를 임베딩 표현 후 접합시켜, 훈련 유저의 조합적 특징 표현을 얻고,상기 훈련 아이템의 적어도 2개의 훈련 특징 정보를 임베딩 표현 후 접합시켜, 훈련 아이템의 조합적 특징 표현을 얻으며,상기 리콜 태스크 모듈에서, 상기 훈련 유저의 조합적 특징 표현 및 상기 훈련 아이템의 조합적 특징 표현을 각각 완전연결 처리 및 활성화 처리의 처리 계층을 포함하는 적어도 2개 계층의 처리를 거쳐, 훈련 유저의 특징표현 및 훈련 아이템 특징 표현을 얻으며,상기 리콜 태스크 모듈에서 상기 훈련 유저의 특징 표현과 상기 훈련 아이템 특징 표현을 곱하여 상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스를 얻으며,상기 클릭률 추정 태스크 모듈에서, 상기 훈련 유저의 조합적 특징 표현과 상기 훈련 아이템의 조합적 특징 표현을 접합시켜, 순차적으로 완전연결 처리 및 활성화 처리의 처리 계층, 및 sigmoid 활성화 함수 처리 계층을포함하는 적어도 2개 계층의 처리를 거쳐, 상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률을얻으며,상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스, 상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률, 기지된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 포괄적인 교차-엔트로피 손실 함수를 생성하며,상기 포괄적인 교차-엔트로피 손실 함수가 수렴되는지 여부를 판단하고, 수렴되지 않을 경우, 상기 유저가 아이템을 클릭하는 태스크 모델의 파라미터를 조정하며, 수렴될 경우, 제1 연속 예정 루프 수의 훈련에서 전부 수렴되었는지 여부를 판단하고, 수렴되었을 경우, 상기유저가 아이템을 클릭하는 태스크 모델의 파라미터를 결정하여, 상기 유저가 아이템을 클릭하는 태스크 모델을결정하는 것을 특징으로 하는,유저가 아이템을 클릭하는 태스크 모델의 훈련 장치."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 훈련 모듈은:상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스 및 기지된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 제1 교차-엔트로피 함수를 생성하고,상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률 및 기지된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 제2 교차-엔트로피 함수를 생성하며,상기 제1 교차-엔트로피 함수와 상기 제2 교차-엔트로피 함수의 합을 구하여, 상기 포괄적인 교차-엔트로피 손실 함수를 얻는 것을 특징으로 하는,유저가 아이템을 클릭하는 태스크 모델의 훈련 장치."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 훈련 모듈은:상기 포괄적인 교차-엔트로피 손실 함수가 상기 제1 연속 예정 루프 수의 훈련에서 전부 수렴한다고 판단되는경우, 계속하여 상기 복수개의 훈련 데이터를 사용하여, 상기 제1 교차-엔트로피 함수가 제2 연속 예정 루프 수의 훈련에서 전부 수렴될 때까지, 상기 리콜 태스크 모듈을 훈련하며, 상기 리콜 태스크 모듈의 파라미터를 결공개특허 10-2021-0095579-6-정하여, 상기 리콜 태스크 모듈을 결정하며, 따라서 상기 유저가 아이템을 클릭하는 태스크 모델을 결정하는 것을 특징으로 하는,유저가 아이템을 클릭하는 태스크 모델의 훈련 장치."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결된 메모리를 구비하며,상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기억되어 있으며, 상기 명령이 상기적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서로 하여금 제 1 항 내지 제 3 항 중 어느 한 항 또는 제 4 항 내지 제 7 항 중 어느 한 항에 기재된 방법을 수행하도록 하는 것을 특징으로 하는,전자 기기."}
{"patent_id": "10-2021-0008893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 명령이 기억되어 있는 비 일시적 컴퓨터 판독 가능 기록 매체에 있어서,상기 컴퓨터 명령은 상기 컴퓨터로 하여금 제 1 항 내지 제 3 항 중 어느 한 항 또는 제 4 항 내지 제 7 항 중어느 한 항에 기재된 방법을 수행하도록 하는 것을 특징으로 하는,기록 매체."}
{"patent_id": "10-2021-0008893", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 아이템 추천 및 모델 훈련 방법, 시스템, 전자기기 및 기록매체를 개시하였으며, 인공지능 분야에 관 한 것이다. 구체적인 실현 방안은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라 이브러리 중 각 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축하고, 상기 (뒷면에 계속)"}
{"patent_id": "10-2021-0008893", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 컴퓨터 기술분야에 관한 것이고, 특히 인공지능, 구체적으로 아이템 추천 방법 및 모델 훈련 방법, 시스템, 전자기기 및 기록매체에 관한 것이다."}
{"patent_id": "10-2021-0008893", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷이 지금까지 발전하면서 각종 인터넷 제품이 파생되었다. 예를 들어 전자상거래와 같은 쇼핑 플랫폼의 등 장에 의해 사람들의 생활방식이 바뀌고 쇼핑의 편리성을 높아졌다. 다양한 인터넷 애플리케이션 제품에서 유저는 관심 아이템을 독립적으로 선택하거나 시스템이 유저에게 아이템 을 추천할 수 있다. 예를 들어, 기존 아이템 추천 시스템에서는 협업 필터링 추천 방식을 채택할 수 있다. 예를 들어, 업계에서 일반적으로 아이템 기반 협업 필터링 추천인 itemCF(Collaborative Filtering) 또는 유저 기반 협업 필터링 추천인 userCF을 사용한다. itemCF는 두 아이템에 모두 관심을 가지는 유저들의 중복 수량을 사용 하여 두 아이템 사이의 유사도를 측정한 다음 유저의 과거 아이템을 기반으로 유사한 후보 아이템을 추천한다. userCF는 두 유저가 모두 관심을 가지는 아이템들의 중복 수량을 사용하여 두 유저 사이의 유사도를 측정한 다 음 유사 유저 그룹이 좋아하는 아이템을 기반으로 타겟 유저에게 후보 아이템을 추천한다. 그러나, 유저 수가 많거나 아이템 수가 많으면 상기 추천 방안의 계산량 대가가 매우 커서 계산 오류가 발생하 기 쉽고 추천 방안의 아이템 추천 정확도가 떨어질 수 있다."}
{"patent_id": "10-2021-0008893", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기 기술적 과제를 해결하기 위해, 본 출원은 아이템 추천 방법 및 모델 훈련 방법, 시스템, 전자기기 및 기록 매체를 제공하여, 아이템 추천 정확도를 높인다."}
{"patent_id": "10-2021-0008893", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한편, 본 출원은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라이브러리 중 각 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축하는 단계, 상기 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특징 정보를 사용하여, 유 저 특징 표현을 획득하는 단계, 상기 유저 특징 표현 및 상기 아이템 특징 표현 데이터베이스에 기초하여, 추천할 N개 아이템의 식별자를 획득 하는 단계, 상기 N개 아이템의 식별자에 기초하여, 상기 유저에게 상기 N개 아이템의 관련 정보를 추천하는 단계를 포함하 는 아이템 추천 방법을 제공한다. 또한 선택적으로, 상기 방법에서, 상기 유저 특징 표현 및 상기 아이템 특징 표현 데이터베이스에 기초하여, 추 천할 N개 아이템의 식별자를 획득하는 단계는 상기 아이템 특징 표현 데이터베이스에서 상기 유저 특징 표현과 관련성이 가장 높은 N개 아이템 특징 표현을 검색하는 단계, 상기 N개 아이템 특징 표현에 대응되는 상기 N개 아이템의 식별자를 획득하는 단계를 포함한다. 또한 선택적으로, 상기 방법에서, 상기 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델은 리콜 태스크 모 듈 및 클릭률 추정 태스크 모듈을 포함하며, 상기 리콜 태스크 모듈과 상기 클릭률 추정 태스크 모듈 사이는 연 합 학습을 거친다. 다른 한편, 본 출원은 복수개의 훈련 데이터를 수집하는 단계, 상기 복수개의 훈련 데이터를 사용하여, 상기 유저가 아이템을 클릭하는 태스크 모델 중의 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈에 대해 연합 학습을 행하는 단계를 포함하며, 각각의 상기 훈련 데이터는 훈련 유저의 적어도 2개의 훈련 특징 정보, 훈련 아이템의 적어도 2개의 훈련 특징 정보 및 상기 훈련 유저가 상기 훈련 아이템에 대한 클릭 상호작용 정보를 포함하는 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법을 제공한다. 또한 선택적으로, 상기 방법에서, 상기 복수개의 훈련 데이터를 사용하여 , 상기 유저가 아이템을 클릭하는 태 스크 모델 중의 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈에 대해 연합 학습을 행하는 단계는: 각각의 상기 훈련 데이터에 대하여, 상기 훈련 유저의 적어도 2개의 특징 정보를 임베딩 표현 후 접합시켜, 훈 련 유저의 조합적 특징 표현을 얻는 단계, 상기 훈련 아이템의 적어도 2개의 훈련 특징 정보를 임베딩 표현 후 접합시켜, 훈련 아이템의 조합적 특징 표현 을 얻는 단계, 상기 리콜 태스크 모듈에서, 상기 훈련 유저의 조합적 특징 표현 및 상기 훈련 아이템의 조합적 특징 표현을 각 각 완전연결 처리 및 활성화 처리의 처리 계층을 포함하는 적어도 2개 계층의 처리를 거쳐, 훈련 유저의 특징 표현 및 훈련 아이템 특징 표현을 얻는 단계, 상기 리콜 태스크 모듈에서 상기 훈련 유저의 특징 표현과 상기 훈련 아이템 특징 표현을 곱하여 상기 훈련 유 저에 대한 상기 훈련 아이템의 추천도 인덱스를 얻는 단계, 상기 클릭률 추정 태스크 모듈에서 상기 훈련 유저의 조합적 특징 표현과 상기 훈련 아이템의 조합적 특징 표현 을 접합시켜, 순차적으로 완전연결 처리 및 활성화 처리의 처리 계층 및 sigmoid 활성화 함수 처리 계층을 포함 하는 적어도 2개 계층의 처리를 거쳐, 상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률을 얻는 단계, 상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스, 상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클 릭 확률, 기지(旣知)된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 포괄적인 교차-엔트로피 손실 함수를 생성하는 단계, 상기 포괄적인 교차-엔트로피 손실 함수가 수렴되는지 여부를 판단하고, 수렴되지 않을 경우, 상기 유저가 아이 템을 클릭하는 태스크 모델의 파라미터를 조정하는 단계, 수렴될 경우, 제1 연속 예정 루프 수의 훈련에서 전부 수렴되었는지 여부를 판단하고, 수렴되었을 경우, 상기 유저가 아이템을 클릭하는 태스크 모델의 파라미터를 결정하여, 상기 유저가 아이템을 클릭하는 태스크 모델을 결정하는 단계를 포함한다. 또한 선택적으로, 상기 방법에서, 상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스, 상기 훈련 아이템 에 대한 상기 훈련 유저의 예측 클릭 확률, 기지된 상기 훈련 아이템에 대한 상기 훈련 유저의 클릭 상호작용 정보에 기반하여, 포괄적인 교차-엔트로피 손실 함수를 생성하는 단계는 상기 훈련 유저에 대한 상기 훈련 아이템의 추천도 인덱스 및 기지된 상기 훈련 아이템에 대한 상기 훈련 유저 의 클릭 상호작용 정보에 기반하여, 제1 교차-엔트로피 함수를 생성하는 단계, 상기 훈련 아이템에 대한 상기 훈련 유저의 예측 클릭 확률 및 기지된 상기 훈련 아이템에 대한 상기 훈련 유저 의 클릭 상호작용 정보에 기반하여, 제2 교차-엔트로피 함수를 생성하는 단계, 상기 제1 교차-엔트로피 함수와 상기 제2 교차-엔트로피 함수의 합을 구하여, 상기 포괄적인 교차-엔트로피 손 실 함수를 얻는 단계를 포함한다. 또한 선택적으로, 상기 방법에서, 상기 포괄적인 교차-엔트로피 손실 함수가 상기 제1 연속 예정 루프 수의 훈 련에서 전부 수렴한다고 판단되는 경우, 계속하여 상기 복수개의 훈련 데이터를 사용하여, 상기 제1 교차-엔트로피 함수가 제2 연속 예정 루프 수의 훈 련에서 전부 수렴될 때까지, 상기 리콜 태스크 모듈을 훈련하며, 상기 리콜 태스크 모듈의 파라미터를 결정하여, 상기 리콜 태스크 모듈을 결정하며, 따라서 상기 유저가 아이템을 클릭하는 태스크 모델을 결정하는 단계를 더 포함한다. 또 다른 한편, 본 출원은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라이브러리 중 각 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축하는 구축 모듈, 상기 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특징 정보를 사용하여, 유 저 특징 표현을 획득하는 특징 획득 모듈, 상기 유저 특징 표현 및 상기 아이템 특징 표현 데이터베이스에 기초하여, 추천할 N개 아이템의 식별자를 획득 하는 아이템 획득 모듈, 상기 N개 아이템의 식별자에 기초하여, 상기 유저에게 상기 N개 아이템의 관련 정보를 추천하는 추천 모듈을 포 함하는 아이템 추천 시스템을 제공한다. 또 다른 한편, 본 출원은 복수개의 훈련 데이터를 수집하는 수집모듈, 상기 복수개의 훈련 데이터를 사용하여, 상기 유저가 아이템을 클릭하는 태스크 모델 중의 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈에 대해 연합 학습을 행하는 훈련 모듈을 포함하며, 각각의 상기 훈련 데이터는 훈련 유저의 적어도 2개의 훈련 특징 정보, 훈련 아이템의 적어도 2개의 훈련 특징 정보 및 상기 훈련 유저가 상기 훈련 아이템에 대한 클릭 상호작용 정보를 포함하는 유저가 아이템을 클릭하는 태스크 모델의 훈련 장치를 제공한다. 또 다른 한편, 본 출원은 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결된 메모리를 구비하며, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기억되어 있으며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 수행되어, 상기 적어도 하나의 프로세서로 하여금 상기 방법을 수행하도록 하는 전자기기를 제공한다. 또 다른 한편, 본 출원은 컴퓨터 명령이 기억되어 있는 비 일시적 컴퓨터 판독 가능 기록 매체를 제공하며, 상 기 컴퓨터 명령은 상기 컴퓨터로 하여금 상기 방법을 수행하도록 한다."}
{"patent_id": "10-2021-0008893", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 발명 중의 일 실시예는 아래와 같은 이점 또는 유익한 효과를 갖는다. 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라이브러리 중의 각 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축하고, 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특 징 정보를 사용하여, 유저 특징 표현을 획득하며, 유저 특징 표현 및 아이템 특징 표현 데이터베이스에 기반하 여, 추천할 N개 아이템의 식별자를 획득하며, N개 아이템의 식별자에 기반하여, 유저에게 N개 아이템의 관련 정 보를 추천함으로써 기존기술과 비교할 시, 본 출원의 기술 방안은 사전에 훈련된 유저가 아이템을 클릭하는 태 스크 모델을 통해 아이템을 추천하며, 계산량을 효과적으로 줄일 수 있고, 계산 오류를 피할 수 있으며, 추천 정확도를 높일 수 있다. 또한 아이템 추천의 지능성을 효과적으로 높이고, 아이템 추천 효율을 향상시킬 수 있 다. 또한, 본 출원의 유저가 아이템을 클릭하는 태스크 모델에 포함되는 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈은 2개의 서로 독립적인 태스크이므로, 클릭률 추정 태스크 모듈에서 유저 특징 표현 및 아이템 특징 표현 을 상호작용시킬 수 있다. 따라서, 훈련 시, 당해 클릭률 추정 태스크 모듈은 역전파를 통해, 임베딩 처리 모듈 중의 embedding 파라미터에 영향을 미칠 수 있어, 유저 특징 표현 및 아이템 특징 표현 사이의 상호작용이 있는 정보가 embedding 파라미터에 기록되게 되며, 리콜 태스크에 영향을 주게 되어 리콜 효과가 더 우수하게 되며, 아이템 추천 효과를 더욱 효과적으로 높일 수 있다. 본 출원의 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법은 리콜 태스크 와 클릭률 추정 태스크를 동시에 훈련할 수 있으며, 훈련 시, 역전파를 통해, 임베딩 처리모듈의 embedding 파라미터에 영향을 줌으로써, 유저 특징 표현 및 아이템 특징 표현 사이 상호작용이 있는 정보가 embedding 파라미터에 기록되게 하여, 리콜 태스 크에 영향을 주게 되어, 리콜 효과가 더 우수하게 된다. 따라서, 본 출원의 기술 방안을 통해 훈련된 유저가 아 이템을 클릭하는 태스크 모델은 리콜 효과를 효과적으로 높일 수 있고, 당해 유저가 아이템을 클릭하는 태스크 모델에 기반하여 아이템 추천 시, 추천 정확도를 효과적으로 높일 수 있으며, 아이템 추천 효율을 향상시킬 수 있다. 또한, 본 출원에서, 포괄적인 교차-엔트로피 손실 함수가 제1 연속 예정 루프 수의 훈련에서 전부 수렴한다고 판단되는 경우, 또한 계속하여 복수개의 훈련 데이터를 사용하여, 제1 교차-엔트로피 함수가 제2 연속 예정 루 프 수의 훈련에서 전부 수렴될 때까지 유저가 아이템을 클릭하는 태스크 모델의 리콜 태스크 모듈을 훈련하며, 리콜 태스크 모듈의 파라미터를 결정하고, 리콜 태스크 모듈을 결정하여, 유저가 아이템을 클릭하는 태스크 모 델을 결정함으로써 리콜 효과를 더 한층 높일 수 있고, 추천 정확도를 높일 수 있으며, 아이템 추천 효율을 향 상시킬 수 있다. 상술한 선택적인 방식이 가지는 기타 효과는 구체적인 실시예를 참조하여 후술된다."}
{"patent_id": "10-2021-0008893", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 시범적인 실시예를 기술하는 바, 본 발명에 대한 이해를 돕기 위해 여기에는 본 발명 실시예의 다양한 세부 사향이 포함되며, 이러한 세부 사향을 단지 시범적인 것으로 간주해야 할 것이다. 따라서, 당업자는 본 발명의 범위 및 정신을 벗어나지 않는 전제 하에서, 여기서 설명되는 실시예에 대 해 다양한 변경 및 수정을 수행할 수 있음을 인식해야 한다. 마찬가지로, 명확성 및 간결성을 위하여 이하의 기술에서는 잘 알려진 기능 및 구조의 기술을 생략하였다. 도 1은 본 출원에 따른 실시예 1의 개략도이다. 도 1에 나타낸 바와 같이, 본 실시예의 아이템 추천방법은 구체 적으로 단계 S101, 단계 S102, 단계 S103 및 단계 S104를 포함한다. 단계 S101에서, 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라이브러리 중 각 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축한다. 본 실시예에서 아이템 추천 방법을 수행하는 주체는 아이템 추천 장치이며, 당해 아이템 추천 장치는 전자 엔티 티일 수 있고 또는 프로그램이 통합된 애플리케이션일 수 있으며, 사용시, 컴퓨터 장비에 의해 실행되면 바로 아이템 추천이 실현될 수 있다. 본 실시예의 아이템 추천 방법은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델에 기반하여 실현된다. 당해 유저가 아이템을 클릭하는 태스크 모델은 신경망 모델이며, 당해 신경망 모델은 유저가 아이템을 클릭하는 적어도 하나의 태스크 예를 들면 리콜 태스크 및/또는 클릭률 추정 태스크에 대한 시뮬레이션을 실현할 수 있다. 유저가 아이템을 클릭하는 태스크에 대한 시뮬레이션 과정에서, 필연코 먼저 유저 특징정보 및 아이템 특 징정보에 기반하여 유저 및 아이템 각각에 대하여 임베딩（embedding）처리를 하여, 해당하는 특징 표현을 얻은 후 특징 표현에 기반하여, 태스크에 대한 시뮬레이션을 실현한다. 따라서, 유저가 아이템을 클릭하는 태스크 모 델 중의 훈련된 특징 표현의 파라미터에 기반하여, 아이템 특징 정보에 따라, 아이템 특징 표현을 획득할 수 있 다. 본 실시예의 특징 표현은 구체적으로 벡터 형태를 채택할 수 있으며, 벡터 표현이라고도 칭할 수 있다. 따 라서, 아이템 특징 표현 데이터베이스는 FAISS 벡터 인덱스 데이터베이스일 수 있다. 본 실시예의 추천 대기 아이템 라이브러리는 사전 수집된 복수의 아이템 정보를 포함하며, 예컨대, 각각의 아이 템 정보에는 당해 아이템의 식별자 및 당해 아이템의 적어도 2개의 특징 정보를 포함한다. 여기서, 아이템의 식 별자는 당해 아이템을 유일하게 식별하기 위해 사용되며, 예컨대, 아이템의 식별자는 숫자, 알파벳 및 문자 중 의 적어도 하나 또는 적어도 2가지의 조합을 채택할 수 있다. 아이템의 적어도 2개의 특징 정보는 아이템의 타 입, 아이템의 키워드 등 기타 정보를 포함할 수 있다. 본 실시예에서, 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라이브러리 중의 각 아이템의 적어도 2개의 특징 정보에 기반하여, 각 아이템 특징 표현을 획득할 수 있다. 또한 각 아이템 특징 표 현에 기반하여, 아이템 라이브러리 중의 각 아이템 특징 표현을 포함하는 아이템 특징 표현 데이터베이스를 구 축할 수 있다. 여기서, 당해 아이템 특징 표현 데이터베이스에는 각 아이템의 식별자를 더 포함할 수 있다. 본 실시예의 특징 표현은 모두 벡터 형태를 사용하며, 벡터 표현 또는 벡터라고도 칭할 수 있다. 단계 S102에서, 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특징 정보를 사 용하여, 유저 특징 표현을 획득한다. 단계 S101의 실시 형태를 참조하면, 또한 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특징 정보에 기반하여, 유저 특징 표현을 획득할 수도 있으며, 상세한 내용은 상술한 단계 S101의 기재를 참조할 수 있으며, 여기서 반복하여 설명하지 않는다. 본 실시예의 유저의 적어도 2개의 특징 정보는 유저의 동작 정보, 유저의 관심 태그 및 연령, 성별, 라이프 스 테이지와 같은 유저의 인구 통계학적 속성 등을 포함할 수 있으며 여기서 일일이 반복하여 설명하지 않는다. 단계 S103에서, 유저 특징 표현 및 아이템 특징 표현 데이터베이스에 기초하여, 추천할 N개 아이템의 식별자를 획득한다. 구체적으로, 먼저 아이템 특징 표현 데이터베이스에서 유저 특징 표현과 관련성이 가장 높은 N개 아이템 특징 표현을 검색한다. 그 다음 N개 아이템 특징 표현에 대응되는 N개 아이템의 식별자를 획득한다. 단계 S104에서, N개 아이템의 식별자에 기초하여, 유저에게 N개 아이템의 관련 정보를 추천한다. 예컨대, N개 아이템의 식별자에 기초하여, 유저에게 N개 아이템의 식별자, 특징 정보, 세부 정보 또는 링크 등 관련 정보를 추천할 수 있다. 본 실시예에서, 유저에게 추천하는 N개 아이템의 관련 정보는 상술한 몇 가지에 제한되지 않으며, 실제 적용 시 N개 아이템의 기타 정보를 더 포함할 수 있으며, 여기서 일일이 반복하여 설명 하지 않는다. 구체적으로, 본 실시예의 기술 방안의 적용 시나리오에 따라, N개 아이템의 식별자에 기반하여, N 개 아이템의 관련 정보를 획득하여, 유저에게 추천할 수 있다. 예컨대, 인터넷 쇼핑 플랫폼일 경우, N개 아이템 의 식별자에 기반하여, N개 아이템의 세부 정보 또는 구매 링크를 획득하여, 유저에게 추천할 수 있다. 상기 기재에 따르면, 본 실시예의 아이템 추천 방법의 적용 시나리오가 이미 추천 대기 아이템 라이브러리 및 유저의 적어도 2개의 특징 정보를 기지하였을 경우일 때, 이미 훈련된 유저가 아이템을 클릭하는 태스크 모델에 기반하여, 유저에게 아이템 라이브러리 중의 N개 아이템의 관련 정보 추천을 실현할 수 있음을 알 수 있다. 선택적으로, 본 실시예의 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델은 리콜 태스크 모듈과 클릭률 추정 태스크 모듈을 포함할 수 있으며, 리콜 태스크 모듈과 클릭률 추정 태스크 모듈 사이는 연합 학습(Co- training)을 통해 얻을 수 있다. 예컨대, 도 2는 본 실시예에서 제공하는 유저가 아이템을 클릭하는 태스크 모 델의 구성도이다. 도 2에 나타낸 바와 같이, 본 실시예의 유저가 아이템을 클릭하는 태스크 모델은 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈을 포함하는 외, 기본 정보 처리 모듈 즉 임베딩（embedding）처리 모듈을 더 포함한다. 임베딩 처리 모듈은 유저의 적어도 2개의 특징 정보 및 아이템의 적어도 2개의 특징 정보에 대해 각 각 임베딩（embedding）처리를 진행하여 접합(splicing)시킨다. 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈 은 모두 접합 후의 표현을 입력으로 사용하여 처리를 진행한다. 여기서, 리콜 태스크 모듈은 유저에 대한 아이템 추천도 인덱스를 계산하는데 사용되고, 당해 추천도 인덱스가 높을수록 당해 유저에게 아이템 추천 시, 당해 아이템이 리콜될 확률이 더 크다. 반대로, 당해 추천도 인덱스가 작을수록, 당해 아이템이 리콜될 확률이 더 작다. 클릭률 추정 태스크 모듈은 아이템에 대한 유저 클릭률을 예측하는데 사용되고, 클릭률이 클수록, 당해 유저가 당해 아이템에 대한 관심이 더 많고, 당해 아이템을 클릭할 수 있는 확률이 더 크다는 것을 나타낸다. 반대로, 클릭률이 작을수록, 유저가 당해 아이템에 대한 관심이 더 적고, 당해 아이템을 클릭할 수 있는 확률이 더 작다 는 것을 나타낸다. 본 실시예의 유저가 아이템을 클릭하는 태스크 모델 중의 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈은 2개 의 서로 독립적인 태스크 이다. 실제 적용 과정에서, 임베딩 처리 모듈은 리콜 태스크 모듈과 조합하여 하나의 독립적인 태스크 모델을 형성하여 리콜 태스크를 실현할 수 있다. 또는 임베딩 처리 모듈은 클릭률 추정 태스크 모듈과 조합하여 하나의 독립적인 태스크 모델을 형성하여 클릭률 추정을 실현할 수 있다. 예컨대, 본 실시예에서, 유저가 아이템을 클릭하는 태스크 모델은 임베딩 처리모듈 및 리콜 태스크 모듈만 포함 하고, 클릭률 추정 태스크 모듈을 포함하지 않을 수 있다. 당해 태스크 모델을 훈련한 후, 당해 태스크 모델에 기반하여, 상술한 도 1에 나타낸 실시예의 단계 S101 및 단계 S102를 실현할 수 있다. 하지만, 도 2에 나타낸 바와 같이, 유저가 아이템을 클릭하는 태스크 모델이 임베딩 처리모듈 및 리콜 태스크 모듈만 포함하였을 경우, 유저 특징 표현 및 아이템 특징 표현은 최상위에서 유저에 대한 아이템 추천도 인덱스 를 계산할 때 서로 곱하는 외에, 어떠한 상호 작용도 없다. 최상위 정보는 이미 압축된 형태이므로, 모델은 최 하위 특징 표현 사이의 특징들의 교차 상호작용이 부족하여, 당해 유저가 아이템을 클릭하는 태스크 모델 훈련 시, 유저 특징 표현 및 아이템 특징 표현이 서로 완전히 독립되어, 유저와 아이템 사이의 교차 정보를 학습할 수 없어, 훈련된 모델의 리콜 효과가 떨어진다. 도 2에 나타낸 본 실시예의 유저가 아이템을 클릭하는 태스크 모델은 클릭률 추정 태스크 모듈을 더 도입하였으 며, 당해 클릭률 추정 태스크 모듈은 유저의 조합적 특징 표현과 아이템의 조합적 특징 표현의 접합 후의 특징 에 기반하여, 클릭률을 예측한다. 즉 유저 특징 표현 및 아이템 특징 표현을 상호작용 시켰다. 이와 같이, 훈련 시, 당해 클릭률 추정 태스크 모듈은 역전파(back propagating)를 통해, 임베딩 처리 모듈 중의 embedding 파라 미터에 영향을 미칠 수 있어, 유저 특징 표현 및 아이템 특징 표현 사이의 상호작용이 있는 정보가 embedding 파라미터에 기록되게 되며, 리콜 태스크에 영향을 주게 되어, 리콜 효과가 더 우수하다. 이때 이와 대응하여, 단계 S101에서 실시 시, 훈련된 도 2에 나타낸 유저가 아이템을 클릭하는 태스크 모델 중 의 임베딩 처리 모듈과 리콜 태스크 모듈 중의 네트워크 구조의 파라미터에 따라, 아이템 라이브러리 중 각 아 이템의 적어도 2개의 특징 정보에 기반하여, 아이템 라이브러리 중 각 아이템 특징 표현을 획득할 수 있다. 아 이템 라이브러리 중의 모든 아이템 특징 표현을 조합하여, 하나의 아이템 특징 표현 데이터베이스를 구축한다. 마찬가지로, 단계 S102에서 실시 시, 훈련된 도 2에 나타낸 유저가 아이템을 클릭하는 태스크 모델 중의 임베딩 처리 모듈과 리콜 태스크 모듈 중의 네트워크 구조의 파라미터에 따라, 유저의 적어도 2개의 특징 정보에 기반 하여, 유저 특징 표현을 획득할 수도 있다. 본 실시예에서의 아이템은 상품인 외에, 광고 등 기타 정보일 수도 있으며, 또한 기타 다른 분야에서 광고 또는 기타 정보의 추천을 실현할 수 있음에 유의하여야 한다. 본 실시예의 아이템 추천 방법은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라 이브러리 중의 각 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축하고, 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특징 정보를 사용하여, 유저 특징 표현을 획득 하며, 유저 특징 표현 및 아이템 특징 표현 데이터베이스에 기반하여, 추천할 N개 아이템의 식별자를 획득하며, N개 아이템의 식별자에 기반하여, 유저에게 N개 아이템의 관련 정보를 추천함으로써 기존기술과 비교할 시, 본 실시예의 기술 방안은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델을 통해 아이템을 추천하며, 계산량 을 효과적으로 줄일 수 있고, 계산 오류를 피할 수 있으며, 추천 정확도를 높일 수 있다. 또한 아이템 추천의 지능성을 효과적으로 높이고, 아이템 추천 효율을 향상시킬 수 있다. 또한, 본 실시예의 유저가 아이템을 클릭하는 태스크 모델에 포함되는 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈은 2개의 서로 독립적인 태스크이므로, 클릭률 추정 태스크 모듈에서 유저 특징 표현 및 아이템 특징 표현 을 상호작용시킬 수 있다. 이와 같이, 훈련 시, 당해 클릭률 추정 태스크 모듈은 역전파를 통해, 임베딩 처리 모듈 중의 embedding 파라미터에 영향을 미칠 수 있어, 유저 특징 표현 및 아이템 특징 표현 사이의 상호작용이 있는 정보가 embedding 파라미터에 기록되게 되며, 리콜 태스크에 영향을 주게 되어 리콜 효과가 더 우수하게 되며, 아이템 추천 효과를 더욱 효과적으로 높일 수 있다. 도3은 본 출원의 실시예 2의 개략도이며, 도 3에 나타낸 바와 같이, 본 실시예의 유저가 아이템을 클릭하는 태 스크 모델의 훈련 방법은 구체적으로 단계 S301 및 단계 S302를 포함할 수 있다. 단계 S301에서, 복수개의 훈련 데이터를 수집하며, 각 훈련 데이터는 훈련 유저의 적어도 2개의 훈련 특징 정보, 훈련 아이템의 적어도 2개의 훈련 특징 정보 및 훈련 유저가 훈련 아이템에 대한 클릭 상호작용 정보를 포함한다. 본 실시예에서 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법의 수행주체는 유저가 아이템을 클릭하는 태 스크 모델의 훈련 장치이다. 당해 유저가 아이템을 클릭하는 태스크 모델의 훈련 장치는 전자 엔티티일 수 있고 또는 소프트웨어가 통합된 애플리케이션일 수 있으며, 사용 시 당해 애플리케이션을 대형 컴퓨터 장비에 의해 수행하고, 본 실시예의 기술 방안을 사용하여, 당해 유저가 아이템을 클릭하는 태스크 모델에 대한 훈련을 실현 한다. 본 실시예에서, 수집된 훈련 데이터 수량은 백만 개 이상 넘을 수 있으며, 수집된 훈련 데이터 개수가 많을 수 록, 훈련된 유저가 아이템을 클릭하는 태스크 모델이 더 정확하다. 본 실시예에서, 수집된 각 훈련 데이터에 포함되는 훈련 유저의 적어도 2개의 훈련 특징 정보 및 훈련 아이템의 적어도 2개의 훈련 특징 정보는 상술한 도 1에 나타낸 실시예의 유저의 적어도 2개의 특징 정보 및 아이템의 적 어도 2개의 특징 정보를 참조할 수 있으며, 여기서 반복하여 설명하지 않는다. 여기서, 훈련 유저가 훈련 아이 템에 대한 클릭 상호작용 정보는 유저가 당해 훈련 아이템을 클릭하였거나 또는 유저가 당해 훈련 아이템을 클 릭하지 않았음을 포함할 수 있다. 본 실시예에서 훈련 데이터를 수집할 시, 사이트 또는 애플리케이션（application；app）의 사건 트래킹(event tracking)을 통해 유저의 과거에 나타난 클릭, 동작 데이터를 획득하여, 훈련 데이터를 마이닝한다. 단계 S302에서, 복수개의 훈련 데이터를 사용하여, 유저가 아이템을 클릭하는 태스크 모델 중의 리콜 태스크 모 듈 및 클릭률 추정 태스크 모듈에 대해 연합 학습을 행한다. 훈련 전, 유저가 아이템을 클릭하는 태스크 모델 중의 네트워크 구조의 각 층의 파라미터에 대해 무작위로 초기 화한 후, 무작위로 초기화된 파라미터에 기반하여 유저가 아이템을 클릭하는 태스크 모델을 훈련하기 시작해야 한다는 점에 유의해야 한다. 본 실시예의 유저가 아이템을 클릭하는 태스크 모델은 도2에 나타낸 구조를 사용할 수 있으며, 예컨대, 훈련 시 구체적으로 단계（a） 내지 단계(j)를 포함할 수 있다. 단계（a）에서, 각 훈련 데이터에 대하여, 훈련 유저의 적어도 2개의 특징 정보를 임베딩 표현 후 접합시켜, 훈 련 유저의 조합적 특징 표현을 얻는다. 단계（b）에서, 훈련 아이템의 적어도 2개의 훈련 특징 정보를 임베딩 표현 후 접합시켜, 훈련 아이템의 조합적 특징 표현을 얻는다. 임베딩 표현하여 얻은 것이 모두 벡터 형태인 표현이므로, 접합 후의 훈련 유저의 조합적 특징 표현을 또한 훈 련 유저의 조합 벡터라고도 칭할 수 있으며, 접합 후의 훈련 아이템의 조합적 특징 표현을 또한 훈련 아이템의 조합 벡터라고도 칭할 수 있다. 단계（c）에서, 리콜 태스크 모듈에서, 훈련 유저의 조합적 특징 표현 및 훈련 아이템의 조합적 특징 표현을 각 각 완전연결(fully connected) 처리 및 활성화(Activation) 처리의 처리 계층을 포함하는 적어도 2개 계층의 처 리를 거쳐, 훈련 유저의 특징 표현 및 훈련 아이템 특징 표현을 얻는다. 본 실시예에서, 훈련 유저의 특징 표현 및 훈련 아이템 특징 표현을 생성하는 과정에서, 완전연결 처리 및 활성 화 처리의 처리 계층을 포함하는 적어도 2개 계층을 거쳐야 하며, 구체적으로 처리 계층의 층수는 훈련 유저의 특징 정보의 수량에 의해 결정된다. 훈련 유저의 특징 정보 수량이 비교적 많을 경우, 정보 혼합이 더 균일하게 이루어져, 보다 정확한 훈련 유저의 특징 표현을 얻을 수 있도록 처리 계층의 층수도 비교적 많이 수요된다. 훈 련 아이템 특징 표현 측의 원리도 이와 유사하며, 여기서 반복하여 설명하지 않는다. 예컨대, 도2의 네트워크 구조에서 나타낸 바와 같이, 리콜 태스크 모듈의 각 층의 처리 계층에는 완전연결 처리와 활성화 처리를 포함하 며, 여기서, 활성화 처리는 ReLU 활성화 처리를 사용할 수 있다. 단계（d）에서, 리콜 태스크 모듈에서 훈련 유저의 특징 표현과 훈련 아이템 특징 표현을 곱하여 훈련 유저에 대한 훈련 아이템의 추천도 인덱스를 얻는다. 본 실시예에서 훈련 유저의 특징 표현과 훈련 아이템 특징 표현을 곱하여 얻은 것은 점 곱(dot product)이며, 당해 점 곱은 훈련 유저에 대한 훈련 아이템의 추천도 인덱스를 나타내기 위해 사용된다. 단계（e）에서, 클릭률 추정 태스크 모듈에서 훈련 유저의 조합적 특징 표현과 훈련 아이템의 조합적 특징 표현 을 접합시켜, 순차적으로 완전연결 처리 및 활성화 처리의 처리 계층 및 sigmoid 활성화 함수 처리 계층을 포함 하는 적어도 2개 계층의 처리를 거쳐, 훈련 아이템에 대한 훈련 유저의 예측 클릭 확률을 얻는다. 마찬가지로, 클릭률 추정 태스크 모듈에서, 훈련 유저 특징 정보 및 훈련 아이템 특징 정보의 수량이 비교적 많 을 경우, 더 많은 층수의 처리 계층을 설정하여, 특징 정보를 더 균일하게 혼합하여, 보다 정확한 특징 정보를 얻어, 예측 클릭 확률의 값을 높인다. 마찬가지로, 도 2에 나타낸 네트워크 구조에서, 클릭률 추정 태스크 모듈 의 각 층의 처리 계층에도 완전연결 처리와 활성화 처리를 포함하며, 여기서, 활성화 처리는 ReLU 활성화 처리 를 사용할 수도 있다. 단계（f）에서, 훈련 유저에 대한 훈련 아이템의 추천도 인덱스, 훈련 아이템에 대한 훈련 유저의 예측 클릭 확 률 및 기지된 훈련 아이템에 대한 훈련 유저의 클릭 상호작용 정보에 기반하여, 포괄적인 교차-엔트로피 손실 (Cross Entropy Loss) 함수를 생성한다. 예컨대, 당해 단계는 구체적으로 하기 단계（1）, 단계（2） 및 단계（3）를 포함할 수 있다. 단계（1）에서, 훈련 유저에 대한 훈련 아이템의 추천도 인덱스 및 기지된 훈련 아이템에 대한 훈련 유저의 클 릭 상호작용 정보에 기반하여, 제1 교차-엔트로피 함수를 생성한다. 단계（2）에서, 훈련 아이템에 대한 훈련 유저의 예측 클릭 확률 및 기지된 훈련 아이템에 대한 훈련 유저의 클 릭 상호작용 정보에 기반하여, 제2 교차-엔트로피 함수를 생성한다. 단계（3）에서, 제1 교차-엔트로피 함수와 제2 교차-엔트로피 함수의 합을 구하여, 포괄적인 교차-엔트로피 손 실 함수를 얻는다. 예컨대, 본 실시예의 포괄적인 교차-엔트로피 손실 함수는, 하기 식으로 표시할 수 있다."}
{"patent_id": "10-2021-0008893", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, 는 제1 교차-엔트로피 함수를 표시하고, 는 리콜 태 스크 중 기지된 훈련 아이템에 대한 훈련 유저의 클릭 상호작용 정보에 기반하여 얻은 훈련 유저에 대한 훈련 아이템의 기지된 추천도 인덱스이다. 예컨대, 훈련 유저가 훈련 아이템에 대하여 실제적인 클릭 동작이 있었을 경우, 를 1로 표기하고, 아닐 경우, 즉 실제 동작이 없었을 경우, 를 0으로 표기한다. 는 훈련 유저에 대한 훈련 아이템의 예측 추천도 인덱스를 표시한다. 는 제2 교차-엔트로피 함수를 표시하고, 는 클릭률 추정 태스크 중 기지된 훈련 아이템에 대한 훈련 유저의 클릭 상호작용 정보에 기반하여 얻은 훈련 유저가 훈련 아이템에 대한 실제 클릭률이다. 클릭이 1이면 비클릭은 0이다. 는 모델에 의해 예측된 클릭률이다. 단계（g）에서, 포괄적인 교차-엔트로피 손실 함수가 수렴되는지 여부를 판단하며, 수렴되지 않을 경우, 단계（ h）를 수행하고, 수렴될 경우, 단계（i）를 수행한다. 단계（h）에서, 유저가 아이템을 클릭하는 태스크 모델의 파라미터를 조정하고, 단계（a）에 돌아가서 다음 훈 련 데이터를 사용하여 계속하여 훈련을 행한다. 구체적으로 임베딩 처리 모듈, 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈 중의 네트워크 구조의 파라미터를 조정하는 것을 포함할 수 있다. 단계（i）에서, 제1 연속 예정 루프 수의 훈련에서 전부 수렴되었는지 여부를 판단하고, 수렴되었을 경우, 단계 （j）를 수행하고, 수렴되지 않았을 경우, 단계（a）에 돌아가서 다음 훈련 데이터를 사용하여 계속하여 훈련을 행한다. 단계（j）에서, 유저가 아이템을 클릭하는 태스크 모델의 파라미터를 결정하여, 유저가 아이템을 클릭하는 태스 크 모델을 결정한다. 선택적으로, 단계（i）에서 포괄적인 교차-엔트로피 손실 함수가 제1 연속 예정 루프 수의 훈련에서 전부 수렴 한다고 판단되는 경우, 계속하여 복수개의 훈련 데이터를 사용하여, 제1 교차-엔트로피 함수가 제2 연속 예정 루프 수의 훈련에서 전부 수렴될 때까지 리콜 태스크 모듈을 훈련하며, 리콜 태스크 모듈의 파라미터를 결정하 여, 리콜 태스크 모듈을 결정하며, 따라서 유저가 아이템을 클릭하는 태스크 모델을 결정하는 단계를 더 포함할 수 있다. 다시 말해서, 본 실시예의 유저가 아이템을 클릭하는 태스크 모델 중의 클릭률 추정 태스크 모듈은 다만 모델을 훈련하는 과정에만 사용되고, 유저 특징 표현 및 아이템 특징 표현의 상호작용을 인입하기 위해 사용되며, 재차 훈련 시, 역전파를 통해 임베딩 처리 모듈의 embedding 파라미터에 영향을 줌으로써, 유저 특징 표현 및 아이템 특징 표현 사이의 상호작용이 있는 정보가 embedding 파라미터에 기록되게 하여, 리콜 태스크에 영향을 주게 되 어, 리콜 효과가 더 우수하게 된다. 또한, 리콜 효과를 더 한층 높이기 위해, 리콜 태스크 모듈의 네트워크 구 조의 파라미터를 최적화하며, 본 실시예는 포괄적인 교차-엔트로피 손실 함수가 수렴되도록 훈련한 후, 추가적 으로 리콜 태스크 모듈의 네트워크 구조의 파라미터를 조정하여, 제1 교차-엔트로피 함수가 제2 연속 예정 루프 수의 훈련에서 전부 수렴되도록 하여 리콜 태스크 모듈의 파라미터를 결정하고, 리콜 태스크 모듈을 결정하여, 유저가 아이템을 클릭하는 태스크 모델을 결정한다. 본 실시예의 제1 연속 예정 루프 수 및 제2 연속 예정 루프 수는 실제 수요에 따라 100, 200 또는 기타 수치로 설정할 수 있으며, 여기서 이에 대해 한정하지 않는다. 도 1에 나타낸 실시예에서 사용한 훈련된 유저가 아이템을 클릭하는 태스크 모델은 상술한 훈련 방법을 사용하 여 훈련된 유저가 아이템을 클릭하는 태스크 모델이다. 본 실시예의 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법은 상술한 기술 방안을 사용함으로써 리콜 태스 크 와 클릭률 추정 태스크를 동시에 훈련할 수 있으며, 훈련 시, 역전파를 통해, 임베딩 처리모듈의 embedding 파라미터에 영향을 줌으로써, 유저 특징 표현 및 아이템 특징 표현 사이 상호작용이 있는 정보가 embedding 파 라미터에 기록되게 하여, 리콜 태스크에 영향을 주게 되어, 리콜 효과가 더 우수하게 된다. 따라서, 본 실시예 의 기술 방안을 통해 훈련된 유저가 아이템을 클릭하는 태스크 모델은 리콜 효과를 효과적으로 높일 수 있고, 당해 유저가 아이템을 클릭하는 태스크 모델에 기반하여 아이템 추천 시, 추천 정확도를 효과적으로 높일 수 있 으며, 아이템 추천 효율을 향상시킬 수 있다. 또한, 본 실시예의 훈련 과정에서, 포괄적인 교차-엔트로피 손실 함수가 제1 연속 예정 루프 수의 훈련에서 전 부 수렴한다고 판단되는 경우, 또한 계속하여 복수개의 훈련 데이터를 사용하여, 제1 교차-엔트로피 함수가 제2 연속 예정 루프 수의 훈련에서 전부 수렴될 때까지 유저가 아이템을 클릭하는 태스크 모델의 리콜 태스크 모듈 을 훈련하며, 리콜 태스크 모듈의 파라미터를 결정하고, 리콜 태스크 모듈을 결정하여, 유저가 아이템을 클릭하 는 태스크 모델을 결정함으로써 리콜 효과를 더 한층 높일 수 있고, 추천 정확도를 높일 수 있으며, 아이템 추천 효율을 향상시킬 수 있다. 도 4는 본 출원에 따른 실시예 3의 개략도이다. 도 4에 나타낸 바와 같이, 본 실시예의 아이템 추천 시스템 은 구체적으로 구축 모듈, 특징 획득 모듈, 아이템 획득 모듈 및 추천 모듈을 포함한 다. 구축 모듈은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이템 라이브러리 중 각 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징 표현 데이터베이스를 구축한다. 특징 획득 모듈은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특징 정 보를 사용하여, 유저 특징 표현을 획득한다. 아이템 획득 모듈은 유저 특징 표현 및 아이템 특징 표현 데이터베이스에 기초하여, 추천할 N개 아이템의 식별자를 획득한다. 추천 모듈은 N개 아이템의 식별자에 기초하여, 유저에게 N개 아이템의 관련 정보를 추천한다. 선택적으로, 본 실시예의 아이템 추천 시스템의 아이템 획득 모듈은 아이템 특징 표현 데이터베이스에서 유저 특징 표현과 관련성이 가장 높은 N개 아이템 특징 표현을 검색하고, N개 아이템 특징 표현에 대응되는 N개 아이템의 식별자를 획득한다. 선택적으로, 본 실시예의 아이템 추천 시스템에서, 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 은 리콜 태스크 모듈과 클릭률 추정 태스크 모듈을 포함하고, 리콜 태스크 모듈과 클릭률 추정 태스크 모듈 사 이는 연합 학습(Co-training, 협동 학습)을 거친다. 본 실시예의 아이템 추천 시스템에 있어서 상술한 모듈을 통해 아이템 추천을 실현하는 실현 원리 및 기술 효과는 상술한 관련 방법의 실시예의 실현과 동일하며, 세부 사항은 상술한 관련 방법의 실시예의 기재를 참조 할 수 있으며, 여기서 반복하여 설명하지 않는다. 도 5는 본 출원에 따른 실시예 4의 개략도이다. 도 5에 나타낸 바와 같이, 본 실시예의 유저가 아이템을 클릭하 는 태스크 모델의 훈련 장치는 수집 모듈 및 훈련 모듈을 포함한다. 수집 모듈은 복수개의 훈련 데이터를 수집하며, 각 훈련 데이터는 훈련 유저의 적어도 2개의 훈련 특징 정 보, 훈련 아이템의 적어도 2개의 훈련 특징 정보 및 훈련 유저가 훈련 아이템에 대한 클릭 상호작용 정보를 포 함한다. 훈련 모듈은 복수개의 훈련 데이터를 사용하여, 유저가 아이템을 클릭하는 태스크 모델 중의 리콜 태스크 모듈 및 클릭률 추정 태스크 모듈에 대해 연합 학습을 행한다. 선택적으로, 본 실시예의 유저가 아이템을 클릭하는 태스크 모델의 훈련 장치에 있어서, 훈련 모듈은 구체적으로 각 훈련 데이터에 대하여, 훈련 유저의 적어도 2개의 특징 정보를 임베딩 표현 후 접합시켜, 훈련 유저의 조합 적 특징 표현을 얻고, 훈련 아이템의 적어도 2개의 훈련 특징 정보를 임베딩 표현 후 접합시켜, 훈련 아이템의 조합적 특징 표현을 얻 으며, 리콜 태스크 모듈에서, 훈련 유저의 조합적 특징 표현 및 훈련 아이템의 조합적 특징 표현을 각각 완전연결 (fully connected ) 처리 및 활성화(Activation ) 처리의 처리 계층을 포함하는 적어도 2개 계층의 처리를 거쳐, 훈련 유저의 특징 표현 및 훈련 아이템 특징 표현을 얻으며, 리콜 태스크 모듈에서, 훈련 유저의 특징 표현과 훈련 아이템 특징 표현을 곱하여 훈련 유저에 대한 훈련 아이 템의 추천도 인덱스를 얻으며, 클릭률 추정 태스크 모듈에서, 훈련 유저의 조합적 특징 표현과 훈련 아이템의 조합적 특징 표현을 접합시켜, 순차적으로 완전연결 처리 및 활성화 처리를 포함하는 적어도 2개 계층의 처리 계층, 및 sigmoid 활성화 함수 처리 계층의 처리를 거쳐, 훈련 아이템에 대한 훈련 유저의 예측 클릭 확률을 얻으며, 훈련 유저에 대한 훈련 아이템의 추천도 인덱스, 훈련 아이템에 대한 훈련 유저의 예측 클릭 확률 및 기지된 훈 련 아이템에 대한 훈련 유저의 클릭 상호작용 정보에 기반하여, 포괄적인 교차-엔트로피 손실 함수(Cross Entropy Loss)를 생성하고, 포괄적인 교차-엔트로피 손실 함수가 수렴되는지 여부를 판단하며, 수렴되지 않을 경우, 유저가 아이템을 클릭 하는 태스크 모델의 파라미터를 조정하고, 수렴될 경우, 제1 연속 예정 루프 수의 훈련에서 전부 수렴되었는지 여부를 판단하고, 수렴되었을 경우, 유저가 아이템을 클릭하는 태스크 모델의 파라미터를 결정하여, 유저가 아이템을 클릭하는 태스크 모델을 결정한다. 선택적으로, 본 실시예의 유저가 아이템을 클릭하는 태스크 모델의 훈련 장치에 있어서, 훈련 모듈은 훈련 유저에 대한 훈련 아이템의 추천도 인덱스 및 기지된 훈련 아이템에 대한 훈련 유저의 클릭 상호작용 정보 에 기반하여, 제1 교차-엔트로피 함수를 생성하고, 훈련 아이템에 대한 훈련 유저의 예측 클릭 확률 및 기지된 훈련 아이템에 대한 훈련 유저의 클릭 상호작용 정 보에 기반하여, 제2 교차-엔트로피 함수를 생성하며, 제1 교차-엔트로피 함수와 제2 교차-엔트로피 함수의 합을 구하여, 포괄적인 교차-엔트로피 손실 함수를 얻는다. 선택적으로, 본 실시예의 유저가 아이템을 클릭하는 태스크 모델의 훈련 장치에 있어서, 훈련 모듈은 또한 포괄적인 교차-엔트로피 손실 함수가 제1 연속 예정 루프 수의 훈련에서 전부 수렴한다고 판단되는 경우, 계속 하여 복수개의 훈련 데이터를 사용하여, 제1 교차-엔트로피 함수가 제2 연속 예정 루프 수의 훈련에서 전부 수 렴될 때까지 리콜 태스크 모듈을 훈련하며, 리콜 태스크 모듈의 파라미터를 결정하여, 리콜 태스크 모듈을 결정 하며, 따라서 유저가 아이템을 클릭하는 태스크 모델을 결정한다. 본 실시예의 유저가 아이템을 클릭하는 태스크 모델의 훈련 장치에 있어서, 상술한 모듈을 통해 유저가 아 이템을 클릭하는 태스크 모델의 훈련을 실현하는 실현 원리 및 기술 효과는 상술한 관련 방법의 실시예의 실현 과 동일하며, 세부사항은 상술한 관련 실시예의 기재를 참조할 수 있으며, 여기서 반복하여 설명하지 않는다. 본 발명에 따른 실시예에 의하면, 본 발명은 전자 기기 및 판독 가능 기록 매체를 더 제공한다. 도 6에 나타낸 바와 같이, 본 발명의 실시예의 상술한 방법을 구현하기 위한 전자 기기의 블럭도이다. 전자 기 기는 예를 들면 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크 스테이션, 개인 디지털 보조기, 서버, 블레이드 서버, 대 형 컴퓨터 및 기타 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 나타낸다. 전자 기기 또한 예를 들면 개인 디지털 처리기, 셀폰, 스마트 전화, 웨어러블 기기 및 기타 유사한 계산 장치와 같은 다양한 형태의 모바 일 장치를 나타낼 수 있다. 본 명세서에 나타낸 구성 요소, 이들의 연결과 관계 및 이들의 기능은 단지 예일 뿐 이며, 본 명세서에서 기술하거나 및/또는 요구하는 본 발명의 실현을 한정하려는 것이 아니다. 도 6에 나타낸 바와 같이, 당해 전자 기기는 하나 또는 복수의 프로세서, 메모리 및 각 구성 요소를 연결하기 위한 인터페이스를 구비하며, 당해 인터페이스는 고속 인터페이스 및 저속 인터페이스를 포함한다. 각 구성 요소는 서로 다른 버스를 통해 상호 연결되며, 공통 마더 보드에 설치되거나 또는 수요에 따라 기타 방식 으로 설치된다. 프로세서 전자 기기 내에서 수행되는 명령에 대해 처리를 실행할 수 있으며, 메모리 내에 기억 되어 외부 입력/출력 장치（예를 들면 인터페이스에 연결된 디스플레이 기기） 상에 GUI의 그래픽 정보를 표시 하기 위한 명령을 포함한다. 기타 실시 방식에 있어서, 필요할 경우, 복수의 프로세서 및/또는 복수의 버스와 복수의 메모리를 함께 사용할 수 있다. 마찬가지로, 복수의 전자 기기를 연결할 수 있으며, 각 기기는 부분적인 필요한 조작（예를 들면, 서버 어레이, 일 그룹의 블레이드 서버, 또는 다중 프로세서 시스템）을 제공한다. 도 6에서는 하나의 프로세서의 예를 들었다. 메모리는 본 발명에 의해 제공되는 비 일시적 컴퓨터 판독 가능 기록 매체이다. 여기서, 상기 메모리에는 적어도 하나의 프로세서에 의해 수행 가능한 명령이 기억되어 있으며, 상기 적어도 하나의 프로세서로 하여금 본 발명에 의해 제공되는 아이템 추천 방법 또는 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법을 수행하 도록 한다. 본 발명의 비 일시적 컴퓨터 판독 가능 기록 매체는 컴퓨터 명령을 기억하며, 당해 컴퓨터 명령은 컴퓨터로 하여금 본 발명에 의해 제공되는 아이템 추천 방법 또는 유저가 아이템을 클릭하는 태스크 모델의 훈 련 방법을 수행하도록 한다. 메모리는 일종의 비 일시적 컴퓨터 판독 가능 기록 매체로서, 비 일시적 소프트웨어 프로그램, 비 일시적 컴퓨터 수행 가능 프로그램 및 모듈을 기억하는데 사용될 수 있는 바, 예를 들면 본 발명 실시예의 아이템 추천 방법 또는 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법에 대응하는 프로그램 명령/모듈（예를 들면, 도 4에 나타낸 관련 모듈 또는 도 5에 나타낸 관련 모듈）을 기억하는데 사용될 수 있다. 프로세서는 메모리 내에 기억된 비 일시적 소프트웨어 프로그램, 명령 및 모듈을 운행함으로써, 서버의 다양한 기능 응용 및 데이터 처리를 수행하는 바, 상술한 방법 실시예의 아이템 추천방법 또는 유저가 아이템을 클릭하는 태스크 모 델의 훈련 방법을 실현한다. 메모리는 프로그램 기록 영역 및 데이터 기록 영역을 포함할 수 있으며, 여기서, 프로그램 기록 영역은 운 영 체제 및 적어도 하나의 기능에 필요한 응용 프로그램을 기억할 수 있고, 데이터 기록 영역은 아이템 추천 방 법 또는 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법을 실현하기 위한 전자 기기의 사용을 통해 생성된 데이터 등을 기억할 수 있다. 또한, 메모리는 고속 랜덤 액세스 메모리를 포함할 수 있고, 비 일시적 메모 리를 더 포함할 수 있는 바, 예를 들면 적어도 하나의 자기 디스크 저장 장치, 플래시 장치, 또는 기타 비 일시 적 고체 저장 장치를 포함할 수 있다. 일부 실시예에 있어서, 메모리는 선택적으로 프로세서에 대해 원격 설치한 메모리를 포함할 수 있으며, 이러한 원격 메모리는 네트워크를 통해 아이템 추천방법 또는 유저가 아이템을 클릭하는 태스크 모델의 훈련방법을 실현하기 위한 전자기기에 연결될 수 있다. 상술한 네트워크의 실 시예는 인터넷, 기업 인트라 넷, 근거리 통신망, 이동 통신 네트워크 및 이들의 조합을 포함하나 이에 한정되지 않는다. 아이템 추천 방법 또는 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법을 실현하기 위한 전자기기는 입력 장치와 출력 장치를 더 포함할 수 있다. 프로세서, 메모리, 입력 장치 및 출력 장치 는 버스 또는 기타 방식을 통해 연결될 수 있으며, 도 6에서는 버스를 통해 연결하는 예를 들었다. 입력 장치는 입력된 디지털 또는 문자 정보를 수신하고, 또한 아이템 추천 방법 또는 유저가 아이템을 클 릭하는 태스크 모델의 훈련 방법을 실현하기 위한 전자 기기의 유저 설정 및 기능 제어에 관한 키 신호 입력을 생성할 수 있다. 예를 들면 터치 스크린, 키패드, 마우스, 트랙 패드, 터치 패드, 포인팅 스틱, 하나 또는 복수 의 마우스 버튼, 트랙볼, 조이스틱 등 입력 장치를 포함할 수 있다. 출력 장치는 디스플레이 기기, 보조 조명 장치（예를 들면, LED） 및 촉각 피드백 장치（예를 들면, 진동 모터） 등을 포함할 수 있다. 당해 디스플 레이 기기는 액정 디스플레이（LCD）, 발광 다이오드（LED） 디스플레이 및 등 플라즈마 디스플레이를 포함할 수 있으나 이에 한정되지 않는다. 일부 실시 방식에 있어서, 디스플레이 기기는 터치 스크린일 수 있다. 여기서 설명하는 시스템 및 기술의 다양한 실시 방식은 디지털 전자 회로 시스템, 집적 회로 시스템, 전용 ASIC （전용 집적 회로）, 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 실현될 수 있다. 이러한 다양한 실시형태는 하나 또는 복수의 컴퓨터 프로그램에서 실시되고, 당해 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능 시스템 상에서 수행 및/또는 해석될 수 있으 며, 당해 프로그램 가능 프로세서는 전용 또는 일반 프로그램 가능 프로세서일 수 있고, 기록 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이터 및 명령을 수신할 수 있으며, 또한 데이터 및 명령 을 당해 기록 시스템, 당해 적어도 하나의 입력 장치 및 당해 적어도 하나의 출력 장치에 전송할 수 있다. 이러한 계산 프로그램 （프로그램, 소프트웨어, 소프트웨어 응용 또는 코드로도 불림）은 프로그램 가능 프로세 서의 기계 명령을 포함하며, 또한 고급 과정 및/또는 객체 지향 프로그래밍 언어 및/또는 어셈블리/기계 언어를 이용하여 이러한 계산 프로그램을 실시할 수 있다. 본 명세서에서 사용되는 “기계 판독 가능 매체” 및 “컴퓨 터 판독 가능 매체”와 같은 용어는, 기계 명령 및/또는 데이터를 프로그램 가능 프로세서의 임의의 컴퓨터 프 로그램 제품, 기기 및/또는 장치（예를 들면, 자기 디스크, 광 디스크, 메모리, 프로그램 가능 논리 장치（PLD ））에 제공하기 위한 것을 의미하며, 기계 판독 가능 신호로서의 기계 명령을 수신하는 기계 판독 가능 매체를 포함한다. “기계 판독 가능 신호 ”와 같은 용어는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서에 제 공하기 위한 임의의 신호를 의미한다. 유저와의 대화를 제공하기 위하여, 컴퓨터 상에서 여기서 설명하는 시스템 및 기술을 실시할 수 있으며, 당해 컴퓨터는 유저에게 정보를 표시하기 위한 디스플레이 장치（예를 들면, CRT （음극선관） 또는 LCD （액정 디스 플레이） 모니터） 및 키보드와 포인팅 장치（예를 들면, 마우스 또는 트랙볼）를 구비할 수 있으며, 유저는 당 해 키보드 및 당해 포인팅 장치를 통해 입력을 컴퓨터에 제공할 수 있다. 기타 유형의 장치는 또한 유저와의 대 화를 제공하는데 사용될 수 있다. 예를 들면, 유저에 제공하는 피드백은 임의의 형태의 감각 피드백（예를 들면, 시각적 피드백, 청각적 피드백, 또는 촉각 피드백）일 수 있으며, 또한 임의의 형태（음향 입력, 음성 입 력 또는 촉각 입력을 포함함）를 통해 유저로부터의 입력을 수신할 수 있다. 여기서 설명하는 시스템 및 기술을 백엔드 구성 요소를 포함하는 계산 시스템（예를 들면, 데이터 서버）, 또는 미들웨어 구성 요소를 포함하는 계산 시스템（예를 들면, 응용 서버）, 또는 프런트 엔드 구성 요소를 포함하는 계산 시스템（예를 들면, 그래픽 유저 인터페이스 또는 웹 브라우저를 구비하는 유저 컴퓨터인 바, 유저는 당해 그래픽 유저 인터페이스 또는 당해 웹 브라우저를 통해 여기서 설명하는 시스템 및 기술의 실시 방식과 대화함 ）, 또는 이러한 백엔드 구성 요소, 미들웨어 구성 요소, 또는 프런트 엔드 구성 요소의 임의의 조합을 포함하 는 계산 시스템에서 실시할 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신（예를 들면, 통신 네트워크 ）을 통해 시스템의 구성 요소를 상호 연결할 수 있다. 통신 네트워크의 예는 근거리 통신망（LAN）, 광역 통신 망（WAN） 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있 고, 또한 일반적으로 통신 네트워크를 통해 대화를 실행한다. 해당되는 컴퓨터 상에서 운행되고, 또한 클라이언 트 - 서버 관계를 갖는 컴퓨터 프로그램을 통해 클라이언트와 서버의 관계를 발생시킬 수 있다. 본 출원의 실시예에 따른 기술 방안은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델 및 추천 대기 아이 템 라이브러리 중의 각 아이템의 적어도 2개의 특징 정보를 사용하여, 아이템 특징표현 데이터베이스를 구축하 고, 유저가 아이템을 클릭하는 태스크 모델 및 유저의 적어도 2개의 특징 정보를 사용하여, 유저 특징 표현을 획득하며, 유저 특징 표현 및 아이템 특징 표현 데이터베이스에 기반하여, 추천할 N개 아이템의 식별자를 획득 하며, N개 아이템의 식별자에 기반하여, 유저에게 N개 아이템의 관련 정보를 추천함으로써 기존기술과 비교할 시, 본 출원의 실시예의 기술 방안은 사전에 훈련된 유저가 아이템을 클릭하는 태스크 모델을 통해 아이템을 추 천하며, 계산량을 효과적으로 줄일 수 있고, 계산오류를 피할 수 있으며, 추천 정확도를 높일 수 있다. 또한 아 이템 추천의 지능성을 효과적으로 높이고, 아이템 추천효율을 향상시킬 수 있다. 또한, 본 출원의 실시예에 따른 기술방안에 있어서, 유저가 아이템을 클릭하는 태스크 모델에 포함되는 리콜 태 스크 모듈 및 클릭률 추정 태스크 모듈은 2개의 서로 독립적인 태스크이므로, 클릭률 추정 태스크 모듈에서 유 저 특징 표현 및 아이템 특징 표현을 상호작용시킬 수 있다. 따라서, 훈련 시, 당해 클릭률 추정 태스크 모듈은 역전파를 통해, 임베딩 처리모듈 중의 embedding 파라미터에 영향을 미칠 수 있어, 유저 특징 표현 및 아이템 특징 표현 사이의 상호작용이 있는 정보가 embedding 파라미터에 기록되게 되며, 리콜 태스크에 영향을 주게 되 어 리콜 효과가 더 우수하게 되며, 아이템 추천 효과를 더욱 효과적으로 높일 수 있다. 본 출원의 실시예에 따른 기술방안에 있어서, 유저가 아이템을 클릭하는 태스크 모델의 훈련 방법은 리콜 태스 크와 클릭률 추정 태스크를 동시에 훈련할 수 있으며, 훈련 시, 역전파를 통해, 임베딩 처리모듈의 embedding 파라미터에 영향을 줌으로써, 유저 특징 표현 및 아이템 특징 표현 사이 상호작용이 있는 정보가 embedding 파 라미터에 기록되게 하여, 리콜 태스크에 영향을 주게 되어, 리콜 효과가 더 우수하게 된다. 따라서, 본 출원 실 시예의 기술 방안을 통해 훈련된 유저가 아이템을 클릭하는 태스크 모델은 리콜 효과를 효과적으로 높일 수 있 고, 당해 유저가 아이템을 클릭하는 태스크 모델에 기반하여 아이템 추천 시, 추천 정확도를 효과적으로 높일 수 있으며, 아이템 추천 효율을 향상시킬 수 있다. 또한, 본 출원의 실시예에 따른 기술 방안에 있어서 포괄적인 교차-엔트로피 손실 함수가 제1 연속 예정 루프 수의 훈련에서 전부 수렴한다고 판단되는 경우, 또한 계속하여 복수개의 훈련 데이터를 사용하여, 제1 교차-엔 트로피 함수가 제2 연속 예정 루프 수의 훈련에서 전부 수렴될 때까지 유저가 아이템을 클릭하는 태스크 모델의 리콜 태스크 모듈을 훈련하며, 리콜 태스크 모듈의 파라미터를 결정하고, 리콜 태스크 모듈을 결정하여, 유저가 아이템을 클릭하는 태스크 모델을 결정함으로써 리콜 효과를 더 한층 높일 수 있고, 추천 정확도를 높일 수 있 으며, 아이템 추천 효율을 향상시킬 수 있다. 상기에 나타낸 다양한 형태의 흐름을 이용하여 단계를 재정열, 증가 또는 삭제할 수 있음을 이해해야 한다. 예 를 들면, 본 발명에 기재된 각 단계는 병열로 수행되거나 또는 차례로 수행되거나 또는 다른 순서로 수행될 수 있으며, 본 발명이 개시하는 기술 방안이 원하는 결과를 실현할 수 있는 한, 본 명세서는 이에 대해 한정하지 않는다. 상술한 구체적인 실시 방식은 본 발명의 보호 범위를 한정하지 않는다. 당업자는 설계 요건 및 기타 요인에 따 라 다양한 수정, 조합, 서브 조합 및 대체를 실행할 수 있음을 이해해야 한다. 본 발명의 정신 및 원칙 내에서 이루어진 임의의 수정 동등한 대체 및 개선 등은 모두 본 발명의 보호 범위 내에 포함되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2021-0008893", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 방안을 더욱 잘 이해하기 위하여 이용되며 본 발명을 제한하지 않는다. 도 1은 본 출원에 따른 실시예 1의 개략도이다. 도 2는 본 실시예에서 제공하는 유저가 아이템을 클릭하는 태스크 모델의 구성도이다. 도 3은 본 출원에 따른 실시예 2의 개략도이다. 도 4는 본 출원에 따른 실시예 3의 개략도이다. 도 5는 본 출원에 따른 실시예 4의 개략도이다. 도 6은 본 출원의 실시예의 상술한 방법을 구현하기 위한 전자기기의 블럭도이다."}
