{"patent_id": "10-2020-0115287", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0033194", "출원번호": "10-2020-0115287", "발명의 명칭": "가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템", "출원인": "주식회사 코탁스", "발명자": "김태균"}}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가상 공간과 가상의 호스트 캐릭터(host character)를 형성하고, 상기 가상 공간에 접속한 유저(user)에게 임의의 가상 캐릭터를 부여하는 인터페이싱 유닛(interfacing unit);상기 가상 공간에 접속한 상기 유저의 보이스 데이터(voice data)를 획득하는 레코그니션 유닛(recognitionunit);상기 레코그니션 유닛으로부터 획득된 상기 보이스 데이터를 분석하여 레터 데이터(letter data)로 변환하는 애널라이징 유닛(analyzing unit);상기 애널라이징 유닛으로부터 변환된 상기 레터 데이터를 분류하여 미리 저장된 시나리오 중 하나의 시나리오에 매칭하는 매칭 유닛(matching unit); 및상기 매칭 유닛으로부터 매칭된 시나리오에 따라 상기 호스트 캐릭터 또는 상기 가상 캐릭터가 선택적으로 응답하는 리플라잉 유닛(replying unit)을 포함하는 것을 특징으로 하는, 가상 공간 기반의 보이스 데이터의 선택적추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 인터페이싱 유닛은,상기 가상 공간에 적어도 한 명 이상의 유저가 접속하면, 상기 호스트 캐릭터와 가상의 미팅룸(meeting room)이자동으로 형성되는 크리에이팅(creating)부; 및상기 가상 공간에 접속한 유저에게 가상의 유저 캐릭터를 부여하는 어사이닝(assigning)부를 포함하는 것을 특징으로 하는, 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 레코그니션 유닛은,상기 가상 공간 접속한 복수 개의 유저 캐릭터 중 적어도 한 개 이상의 유저 캐릭터를 선택하는 유저 셀렉팅(user selecting)부; 및상기 유저 셀렉팅부로부터 선택된 상기 유저 캐릭터의 보이스 데이터를 추출하여 획득하는 어콰이어링(acquiring)부를 포함하는 것을 특징으로 하는, 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 유저 셀렉팅부는,상기 가상 공간에 접속한 상기 복수 개의 유저 캐릭터의 보이스 데이터로부터 음색, 음소, 음조, 강세, 억양,속도, 숨소리, 발음, 무성음, 유성음, 보이스의 시작점, 보이스의 끝점, 보이스의 주파수 또는 보이스의 진폭중 적어도 하나 이상을 식별하여 상기 유저 캐릭터의 보이스 데이터를 선택적으로 선별하는 것을 특징으로하는, 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템.공개특허 10-2022-0033194-3-청구항 5 제3항에 있어서, 상기 애널라이징 유닛은,상기 어콰이어링부로부터 획득된 상기 보이스 데이터를 음절 단위로 분할하는 디바이딩부;상기 디바이딩부로부터 분할된 상기 보이스 데이터의 발음으로부터 언어를 분석하는 랭귀지(language)부; 및상기 랭귀지부로부터 분석된 언어에 따라 상기 보이스 데이터를 임의 조합하여 단어 또는 문장 단위의 보이스데이터로 형성하는 센텐스(sentence)부를 포함하는 것을 특징으로 하는, 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 애널라이징 유닛은, 상기 단어 또는 문장 단위로 조합된 상기 보이스 데이터를 상기 레터 데이터로 변환하는 컨버팅(converting)부;및상기 컨버팅부로부터 변환된 상기 레터 데이터로부터 유효 단어를 선별하는 솔팅(sorting)부를 더 포함하는 것을 특징으로 하는, 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 매칭 유닛은,상기 솔팅부로부터 선별된 상기 유효 단어에 따라서 상기 레터 데이터를 복수 개의 카테고리 중 하나의 카테고리에 분류 설정하는 카테고리(category)부; 및상기 카테고리부로부터 분류된 상기 레터 데이터를 미리 저장된 시나리오에 매칭하는 어댑팅(adapting)부를 포함하는 것을 특징으로 하는, 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 어댑팅부는,상기 미리 저장된 시나리오는 복수 개의 질문 데이터와 복수 개의 답변 데이터가 저장되어, 상기 유효 단어를상기 복수 개의 질문 데이터 또는 상기 복수 개의 답변 데이터와 비교하여 매칭하는 것을 특징으로 하는, 가상공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 리플라잉 유닛은,상기 유저 캐릭터의 상기 보이스 데이터로부터 응답할 언어를 임의 설정하는 랭귀지 세팅부;상기 보이스 데이터에 대해 응답할 상기 호스트 캐릭터 또는 다른 유저 캐릭터 중 리플라이 대상자를 임의 설정하는 리플라이 세팅부; 및상기 매칭 유닛으로부터 매칭된 상기 시나리오에 따라, 상기 리플라이 대상자가 자동으로 상기 리플라이 데이터를 제공하는 리플라이 기빙부를 포함하는 것을 특징으로 하는, 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2022-0033194-4-제9항에 있어서, 상기 리플라잉 유닛은,상기 리플라이 데이터에 대한 상기 유저 캐릭터의 리액션 데이터를 캐치하여 상기 미리 저장된 시나리오 데이터에 추가하는 것을 특징으로 하는, 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템."}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템에 관한 것으로서, 가상 공간에 접속한 유저에게 임의의 가상 캐릭터를 부여하는 인터페이싱 유닛; 가상 공간에 접속한 상기 유저의 보이스 데이터를 획득하는 레코그니션 유닛; 레코그니션 유닛으로부터 획득된 상기 보이스 데이터를 분석하여 레 터 데이터로 변환하는 애널라이징 유닛; 레터 데이터를 분류하여 미리 저장된 시나리오 중 하나의 시나리오에 매 칭하는 매칭 유닛; 및 매칭된 시나리오에 따라 선택적으로 응답하는 리플라잉 유닛을 포함하는 기술적 사상을 개 시한다."}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템에 관한 것이다. 보 다 자세하게는, 가상 현실 공간에서 인공지능을 탑재한 가상의 캐릭터와 대화를 시도할 수 있으며, 대화 중 보 이스 데이터를 획득하여, 획득한 보이스 데이터와 시나리오와의 매칭을 통해 리플라이 데이터를 제공하는 커뮤"}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "니케이팅 시스템에 관한 기술분야이다."}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "음성 인식 기술이란 사람이 말하는 음성 언어를 컴퓨터가 해석하여 문자 데이터로 전환 처리하여 자동적으로 인 식하는 기술을 뜻한다. 음성 인식 기술은 1954년 IBM과 조지타운 대학의 기계 번역 기술 개발 프로젝트로부터 시작되었다. 음성 인식 기술은 2000년대 중반까지도 상용화되지 못했으나, 기술의 발달로 음성 인식에 인공지능 이 결합되면서 음성 인식 기술은 점차 비약적으로 발전하게 되었다. 보통 우리가 알고 있는 음성 인식 기술에는 음성 인식 스피커가 있는데, 대표적으로 KT의 기가 지니가 있으며, 그 밖에도 다음의 카카오 미니, SKT의 누구, 네이버의 클로버 및 구글의 구글 홈 등의 다양한 음성 인식 스피커 가 존재한다. 일반적으로 사용되는 음성 인식 스피커는 자주 사용하는 명령어만을 인식하여 수행하는 정도였으 나, 여러 분야에 적용되고 데이터가 축적되면서 다양한 방식의 음성 인식 기술이 개발되고 있다. 최근에는 코로나 19로 인해 비대면 서비스에 대한 수요가 늘어나면서 음성 인식 기능과 인공지능을 활용한 음성 인식 기술의 필요성이 증대되어 새로운 비즈니스 모델로 떠오르고 있다. 이와 관련된 선행 특허문헌의 예로서 “양방향 커뮤니케이션이 가능한 가상현실 시스템 (등록번호 제10-1839726 호, 이하 특허문헌1이라 한다.)”이 존재한다. 특허문헌1에 따른 발명의 경우, 양방향 커뮤니케이션이 가능한 가상현실 시스템에 관한 것으로, 사용자가 가상 현실 시스템을 통해 대상체(고인, 미래의 특정인에게 자신의 메시지 또는 이벤트를 남기기 원하는 유저 등)와 쌍방향 교감 또는 대화를 할 수 있다. 또한, 3차원 가상현실 공간 상에 표시되는 대상체가, 사용자의 모션정보, 음성정보 등에 반응하고, 이벤트가 발생된 미래 특정 시점의 실세계정보(날씨, 뉴스 등)와 연동되어 3차원 가상 현실 공간 상에 표시된다. 또 다른 특허문헌의 예로서 “가상현실 및 음성인식 기반의 실감 어학학습 콘텐츠 제공 장치 및 방법 (등록번호 제10-1743230호, 이하 특허문헌2이라 한다.)”이 존재한다. 특허문헌2에 따른 발명의 경우, 저장모듈과 영사모듈과 오디오모듈과 음성인식모듈과 콘텐츠 제공모듈을 포함한 다. 저장모듈은 가상현실을 재현하기 위한 영상 및 음성을 포함하는 콘텐츠를 저장한다. 영사모듈은 영상을 영 사하고, 오디오모듈은 음성을 입력받거나 출력한다. 음성인식모듈은 오디오모듈로부터 수신되는 가상현실의 객 체에 대한 사용자의 답변 혹은 질문을 음성인식하여 음성인식 결과를 출력한다. 콘텐츠 제공모듈은 음성인식 결 과에 따라 사용자의 답변 혹은 질문을 평가하고, 평가 결과에 대응하여 객체가 사용자의 답변 혹은 질문에 대해 응답하는 음성 및 영상을 포함하는 콘텐츠를 영상모듈 및 오디오모듈이 출력하도록 제공한다. 또 다른 특허문헌의 예로서 “인공지능 기반의 음성 모방 대화 서비스 베공 방법 및 시스템 (공개번호 제10- 2019-0109651호, 이하 특허문헌3이라 한다.)”이 존재한다. 특허문헌3에 따른 발명의 경우, 인공지능 기반의 음성 모방 대화 서비스 제공 방법은, 대상 사람의 대화가 녹음 된 파일을 획득하는 단계; 파일을 분석하여 대상 사람의 음성 모델을 학습하는 단계; 및 사용자의 대화가 발생 됨에 응답하여, 음성 모델을 기초로 대상 사람을 모방한 인공지능의 음성 모방 대화 서비스를 사용자에게 제공하는 단계를 포함한다. 또 다른 특허문헌의 예로서 “인공지능을 이용한 음성 대화 분석 방법 및 장치 (공개번호 제10-2019-0123362호, 이하 특허문헌4이라 한다.)”이 존재한다. 특허문헌4에 따른 발명의 경우, 인공지능 학습 모델을 이용하여 음성 대화를 분석하여 적합한 동작 모드를 통해 동작을 수행하기 위한 전자 장치의 제어 방법은, 음성을 입력받고, 음성에 대한 정보를 획득하는 단계, 음성에 대한 정보를 바탕으로 음성의 카테고리 정보를 획득하여 카테고리 정보에 대응되는 적어도 하나의 동작 모드를 결정하는 단계, 결정된 동작 모드에 대응되는 인공지능 모델을 이용하여 동작 모드와 관련된 동작을 수행하는 단계를 포함한다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록번호 제10-1839726호 (특허문헌 0002) 등록번호 제10-1743230호 (특허문헌 0003) 공개번호 제10-2019-0109651호 (특허문헌 0004) 공개번호 제10-2019-0123362호"}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템은 상기한 바 와 같은 종래 문제점을 해결하기 위해 안출된 것으로서, 다음과 같은 해결하고자 하는 과제를 제시한다. 첫째, 가상 현실 공간에 접속한 유저는 가상 캐릭터를 통해 대화를 하고자 한다. 둘째, 유저와 연동된 가상 캐릭터로부터 보이스 데이터를 선별적으로 획득하여 분석하고자 한다. 셋째, 분석된 보이스 데이터와 미리 저장된 시나리오를 자동으로 매칭하여 적절한 응답을 하고자 한다. 본 발명의 해결 과제는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 해결과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템은 상기의 해 결하고자 하는 과제를 위하여 다음과 같은 과제 해결 수단을 가진다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템은 가상 공간 과 가상의 호스트 캐릭터(host character)를 형성하고, 상기 가상 공간에 접속한 유저(user)에게 임의의 가상 캐릭터를 부여하는 인터페이싱 유닛(interfacing unit); 상기 가상 공간에 접속한 상기 유저의 보이스 데이터 (voice data)를 획득하는 레코그니션 유닛(recognition unit); 상기 레코그니션 유닛으로부터 획득된 상기 보이 스 데이터를 분석하여 레터 데이터(letter data)로 변환하는 애널라이징 유닛(analyzing unit); 상기 애널라이 징 유닛으로부터 변환된 상기 레터 데이터를 분류하여 미리 저장된 시나리오 중 하나의 시나리오에 매칭하는 매 칭 유닛(matching unit); 및 상기 매칭 유닛으로부터 매칭된 시나리오에 따라 상기 호스트 캐릭터 또는 상기 가 상 캐릭터가 선택적으로 응답하는 리플라잉 유닛(replying unit)을 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 인터 페이싱 유닛은, 상기 가상 공간에 적어도 한 명 이상의 유저가 접속하면, 상기 호스트 캐릭터와 가상의 미팅룸 (meeting room)이 자동으로 형성되는 크리에이팅(creating)부; 및 상기 가상 공간에 접속한 유저에게 가상의 유저 캐릭터를 부여하는 어사이닝(assigning)부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 레코 그니션 유닛은, 상기 가상 공간 접속한 복수 개의 유저 캐릭터 중 적어도 한 개 이상의 유저 캐릭터를 선택하는 유저 셀렉팅(user selecting)부; 및 상기 유저 셀렉팅부로부터 선택된 상기 유저 캐릭터의 보이스 데이터를 추 출하여 획득하는 어콰이어링(acquiring)부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 유저 셀렉팅부는, 상기 가상 공간에 접속한 상기 복수 명의 유저 캐릭터의 보이스 데이터의 음색, 음소, 음조, 강세, 억양, 속도, 숨소리, 발음, 무성음, 유성음, 보이스의 시작점, 보이스의 끝점, 보이스의 주파수 또는 보이스의 진폭 중 적어도 하나 이상을 식별하여 상기 유저의 보이스를 선택적으로 선별하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 유저 셀렉팅부는, 상기 복수 개의 유저 캐릭터의 각각의 보이스 데이터를 임의의 패턴으로 구획하여 복수 개의 패턴 영역을 설정하는 패턴 파티션부; 상기 패턴 파티션부로부터 구획된 상기 복수 개의 패턴 영역 각각에 상이한 매 칭넘버를 부여하는 매칭넘버 할당부; 상기 매칭넘버 할당부로부터 상기 매칭넘버가 부여된 상기 복수 개의 패턴 영역을 랜덤하게 믹싱하고 조합하여, 물리적으로 분할된 공간에 분산하여 저장하도록 하는 패턴 스캐터링부; 및 상기 패턴 스캐터링부로부터 분산 저장된 상기 복수 개의 패턴 영역을 상기 매칭넘버 할당부로부터 부여된 상기 매칭넘버를 이용하여 리매칭하는 패턴 리매칭부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 애널 라이징 유닛은, 상기 어콰이어링부로부터 획득된 상기 보이스 데이터를 음절 단위로 분할하는 디바이딩부; 상기 디바이딩부로부터 음절 단위로 분할된 상기 보이스 데이터의 발음으로부터 언어를 분석하는 랭귀지(language)부; 및 상기 랭귀지로부터 분석된 언어에 따라 음절 단위로 분할된 상기 보이스 데이터를 임의 조합하여 단어 또는 문장 단위의 보이스 데이터로 형성하는 센텐스(sentence)부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 애널 라이징 유닛은, 상기 단어 또는 문장 단위로 조합된 상기 보이스 데이터를 상기 레터 데이터로 변환하는 컨버팅 (converting)부; 및 상기 컨버팅부로부터 변환된 상기 레터 데이터로부터 유효 단어를 선별하는 솔팅(sorting) 부를 더 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 솔팅 부로부터 선별된 상기 유효 단어에 따라서 상기 레터 데이터를 복수 개의 카테고리 중 하나의 카테고리에 분류 설정하는 카테고리(category)부; 및 상기 카테고리부로부터 분류된 상기 레터 데이터를 미리 저장된 시나리오에 매칭하는 어댑팅(adapting)부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 어댑 팅부는, 상기 미리 저장된 시나리오는 복수 개의 질문 데이터와 복수 개의 답변 데이터가 저장되어, 상기 유효 단어를 상기 복수 개의 질문 데이터 또는 상기 복수 개의 답변 데이터와 비교하여 매칭하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 리플 라잉 유닛은, 상기 유저 캐릭터의 상기 보이스 데이터로부터 응답할 언어를 임의 설정하는 랭귀지 세팅부; 상기 보이스 데이터에 대해 응답할 상기 호스트 캐릭터 또는 다른 유저 캐릭터 중 리플라이 대상자를 임의 설정하는 리플라이 세팅부; 및 상기 매칭 유닛으로부터 매칭된 상기 시나리오에 따라, 상기 리플라이 대상자가 자동으로 상기 리플라이 데이터를 제공하는 리플라이 기빙부를 포함하는 것을 특징으로 할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 상기 리플 라잉 유닛은, 상기 리플라이 데이터에 대한 상기 유저 캐릭터의 리액션 데이터를 캐치하여 상기 미리 저장된 시 나리오 데이터에 추가하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 구성의 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템은 다음과 같은 효과를 제공한다. 첫째, 가상 현실 공간에 접속한 유저는 가상 캐릭터를 통해 다양한 상대와 대화를 할 수 있게 된다. 둘째, 유저와 연동된 복수 개의 가상 캐릭터로부터 보이스 데이터를 선별적으로 획득하여 레터 데이터를 추출할 수 있게 된다. 셋째, 분석된 보이스 데이터와 미리 저장된 시나리오를 자동으로 매칭하여 대화 주제에 따른 적절한 응답을 할 수 있게 된다."}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0115287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템은 다양한 변 경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 기술적 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도1은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템을 도시한 개념도이다. 도2는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추 출과 매칭 통한 커뮤니케이팅 시스템의 인터페이싱 유닛을 도시한 블록도이다. 도3은 본 발명의 일 실시예에 따 른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 레코그니션 유닛을 도시 한 블록도이다. 도4는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 레코그니션 유닛을 도시한 개념도이다. 도5는 본 발명의 일 실시예에 따른 가상 공간 기 반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 유저 셀렉팅부를 도시한 블록도이다. 도 6은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시 스템의 패턴 파티션부를 도시한 개념도이다. 도7은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이 터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 매칭넘버 할당부를 도시한 개념도이다. 도8은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 패턴 스 캐터링부를 도시한 개념도이다. 도9는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 애널라이징 유닛을 도시한 블록도이다. 도10은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 애널라이징 유닛을 도 시한 개념도이다. 도11은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 매칭 유닛을 도시한 블록도이다. 도12는 본 발명의 일 실시예에 따른 가상 공간 기 반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 매칭 유닛을 도시한 개념도이다. 도13은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템 의 리플라잉 유닛을 도시한 블록도이다. 도14는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 리플라잉 유닛을 도시한 개념도이다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템은, 인터페이 싱 유닛(interfacing unit, 100), 레코그니션 유닛(recognition unit, 200), 애널라이징 유닛(analyzing unit, 300), 매칭 유닛(matching unit, 400) 및 리플라잉 유닛(replying unit, 500)을 포함하게 된다. 먼저, 인터페이싱 유닛은 가상 공간과 가상의 호스트 캐릭터를 형성하고, 가상 공간에 접속한 유저에게 임 의의 가상 캐릭터를 부여하는 구성이다. 인터페이싱 유닛에서는 도1에 도시된 바와 같이, 임의의 가상 현실 공간을 형성하며, 가상 공간은 회의실, 면접실, 강의실, 다목적실, 세미나실, 강당 등의 대화 장소를 형성할 수 있으며, 장소는 대화 주제에 맞는 장소 를 생성할 수 있는 것이 바람직하다. 또한, 여기서 말하는 가상의 호스트 캐릭터(host character)는, 인공지능(artificial intelligence)을 탑재된 캐릭터가 되거나, 또는 대화를 위해 가상 공간을 오픈한 유저 자체가 될 수도 있으며, 가상 공간에 참여하는 인 원 또한 제한이 없으나, 호스트 캐릭터의 권한으로 참여 인원을 제한할 수도 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 인터페이싱 유닛은 도2에 도시된 바와 같이, 크리에이팅(creating)부 및 어사이닝(assigning)부을 포함하 게 된다. 먼저, 크리에이팅부는 가상 공간에 적어도 한 명 이상의 유저가 접속하면 호스트 캐릭터와 가상의 미팅룸 (meeting room)이 자동으로 형성되는 구성이다. 크리에이팅부는 가상의 미팅룸을 생성하며, 여기서 말하는 가상의 미팅룸은 호스트 캐릭터와 또 다른 가상 캐릭터들간의 대화가 이루어지는 곳이다. 어사이닝부는 가상 공간에 접속한 유저에게 가상의 유저 캐릭터를 부여하는 구성이다. 어사이닝부는 인터넷, 인트라넷, 유무선 통신망, 이동 통신망을 매개로 스마트폰, 스마트 노트, 태블릿 PC, 노트북, 데스크탑, 스마트 TV를 통해 가상 공간에 접속한 유저에게 각각의 고유한 유저 캐릭터를 부여하며, 가상 공간 유저는 자신이 원하는 캐릭터를 직접 선택할 수도 있다. 또한, 유저는 본인의 보이스를 통해 대화에 참여할 수 있으나, 유저 캐릭터에 맞는 적절한 보이스로 변경하여 대화에 참여할 수도 있다. 레코그니션 유닛은 도4에 도시된 바와 같이, 가상 공간에 접속한 유저의 보이스 데이터(voice data)를 획 득하는 구성이다. 레코그니션 유닛은 가상 공간에 접속한 유저의 마이크, 헤드셋, 이어폰, 스피커 등을 통해 송출되는 보이 스 데이터를 획득할 수 있으나, 이 외에도 다양한 장치를 통해 보이스 데이터를 획득할 수 있다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 레코그니션 유닛은 도3에 도시된 바와 같이, 유저 셀렉팅(user selecting)부 및 어콰이어링(acquiring)부 를 포함하게 된다. 먼저, 유저 셀렉팅부는 가상 공간에 접속한 복수 개의 유저 캐릭터 중 적어도 하나 이상의 유저 캐릭터를 선택하는 구성이다. 또한, 유저 셀렉팅부는 가상 공간에 접속한 복수 개의 유저 캐릭터의 보이스 데이터로부터 음색, 음소, 음 조, 강세, 억양, 속도, 숨소리, 발음, 무성음, 유성음, 보이스의 시작점, 보이스의 끝점, 보이스의 주파수 또는 진폭 중 적어도 하나 이상을 식별하여, 유저의 보이스 데이터를 선택적으로 선별하는 구성이다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 유저 셀렉 팅부는 도5에 도시된 바와 같이, 패턴 파티션(pattern partition)부, 매칭넘버(matching number) 할 당부, 패턴 스캐터링(pattern scattering)부 및 패턴 리매칭(pattern rematching)부를 포함하 게 된다. 먼저, 패턴 파티션부는 복수 개의 유저 캐릭터 각각의 보이스 데이터를 임의의 패턴으로 구획하여 복수 개 의 패턴 영역을 설정하는 구성이다. 패턴 파티션부의 복수 개의 패턴 영역은 도6에 도시된 바와 같이, 각기 다른 유저 캐릭터의 보이스 파형 데이터를 분할하여 복수 개의 패턴 영역으로 지정할 수 있다. 또한, 복수 개의 패턴 영역에 내재되는 파형은 유저 캐릭터에 따라 다르며, 동일한 유저 캐릭터의 파형이라 하 더라도, 임의의 패턴으로 구획됨에 따라서 서로 다른 파형 데이터를 내재하게 된다. 아울러, 복수 개의 패턴 영역에 내재되는 파형 데이터로부터, 유저 캐릭터의 고유한 보이스 데이터를 분별할 수 있게 된다. 매칭넘버 할당부는 패턴 파티션부로부터 구획된 복수 개의 패턴 영역 각각에 상이한 매칭 넘버를 부 여하는 구성이다. 매칭넘버 할당부의 매칭 넘버는 일종의 암호화된 넘버로서, 유저 캐릭터의 고유한 보이스 데이터를 보호하 기 위한 것이다. 이때, 부여되는 매칭 넘버는 암호화되어, 접근이 허가된 관리자만에게만 공유될 수 있다. 또한, 매칭넘버 할당부는 도7에 도시된 바와 같이, a1, a2, b1, b2, c1, c2와 같이 문자와 숫자의 조합으 로 이루어진 상이한 매칭 넘버를 복수 개의 패턴 영역 각각에 부여하게 된다. 패턴 스캐터링부는 도8에 도시된 바와 같이, 매칭넘버 할당부로부터 매칭 넘버가 부여된 복수 개의 패턴 영역을 랜덤하게 믹싱하고 조합하여, 물리적으로 분할된 공간에 분산 저장하도록 하는 구성이다. 패턴 스캐터링부는 매칭 넘버가 부여된 복수 개의 패턴 영역을 무작위로 믹싱한 다음 조합하게 되는데, 이 는 유저 캐릭터의 각각이 가진 고유한 보이스 데이터 정보를 보호하고, 외부로부터 유출되거나 카피되는 것을 방지하기 위한 것이다. 아울러, 복수 개의 패턴 영역을 랜덤하게 믹싱하기 위해 적용되는 랜덤 변수는 마찬가지로 접근이 허가된 관리 자에게만 공유시키게 된다. 패턴 리매칭부는 패턴 스캐터링부로부터 분산 저장된 복수 개의 패턴 영역을 매칭 넘버를 이용하여 리매칭하는 구성이다. 패턴 리매칭부에서 복수 개의 패턴 영역을 리매칭하기 위해서는, 접근이 허가된 관리자는 패턴 스캐터링부 로부터 공유된 랜덤 변수를 통해 매개하여 리매칭할 수 있게 된다. 어콰이어링부는 유저 셀렉팅부로부터 선택된 상기 유저 캐릭터의 보이스 데이터를 추출하여 획득하는 구성이다. 어콰이어링부는 가상 공간에서 호스트 캐릭터와 유저 캐릭터의 자연스러운 대화 중에 유저 셀렉팅부 로부터 선택된 유저 캐릭터의 보이스 데이터만을 추출하여 획득할 수 있으며, 예컨대 유저 셀렉팅부로부터 복수 개의 유저 캐릭터가 선택될 경우, 복수 개의 유저 캐릭터의 각각의 복수 개의 보이스 데이터를 추출할 수 있다. 애널라이징 유닛은, 레코그니션 유닛으로부터 획득된 보이스 데이터를 분석하여 레터 데이터(letter data)로 변환하는 구성이다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 애널라이징 유닛은, 도9에 도시된 바와 같이, 디바이딩(dividing)부, 랭귀지(language)부, 센텐스 (sentence)부, 컨버팅(converting)부 및 솔팅(sorting)부을 포함하게 된다. 디바이딩부는 어콰이어링부로부터 획득된 보이스 데이터를 음절 단위로 분할하는 구성이다. 랭귀지부는 디바이딩부로부터 분할된 상기 보이스 데이터의 발음으로부터 언어를 분석하는 구성이다. 예컨대, 영어는 받침이 없는 언어이며 한국어는 초성, 중성, 종성으로 구성되어 각각의 다른 소리를 낸다. 영어 와 한국어는 단어와 문장의 조합하는 방식이 상이하므로, 획득된 보이스 데이터로부터 언어의 분석이 필요하다. 센텐스부는 랭귀지부로부터 분석된 언어에 따라, 분할된 보이스 데이터를 임의 조합하여 단어 또는 문장 단위의 보이스 데이터로 형성하는 구성이다. 컨버팅부는, 단어 또는 문장 단위로 조합된 보이스 데이터를 레터 데이터로 변환하는 구성이다. 솔팅부는 컨버팅부로부터 변환된 레터 데이터로부터 유효 단어를 선별하는 구성이다. 솔팅부는 도10에 도시된 바와 같이, 유효 단어를 선별하며, 유효 단어는 핵심어에 해당하는 것으로, 레터 데이터로부터 보이스 데이터의 의미를 추출하여 적절한 응답을 하기 위한 것이다. 매칭 유닛은, 도12에 도시된 바와 같이, 애널라이징 유닛으로부터 변환된 레터 데이터를 분류하여 미 리 저장된 시나리오 중 하나의 시나리오에 매칭하는 구성이다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 매칭 유닛 은 도11에 도시된 바와 같이 카테고리(category)부 및 어댑팅(adapting)부를 포함하게 된다. 카테고리부는 솔팅부로부터 선별된 유효 단어에 따라서 레터 데이터를 복수 개의 카테고리에 중 하나 의 카테고리에 분류 설정하는 구성이다. 어댑팅부는 카테고리부로부터 분류된 레터 데이터를 미리 저장된 시나리오에 매칭하는 구성이다. 어댑팅부의 미리 저장된 시나리오는 복수 개의 질문 데이터와 복수 개의 답변 데이터가 저장되어, 유효 단 어를 복수 개의 질문 데이터 또는 복수 개의 답변 데이터와 비교하여 매칭하게 된다. 또한, 미리 저장된 시나리 오에는 어떤 주제에도 응답할 수 있는 데이터가 존재한다. 리플라잉 유닛은 도14에 도시된 바와 같이, 매칭 유닛으로부터 매칭된 시나리오에 따라 호스트 캐릭 터 또는 가상의 캐릭터가 유저의 보이스 데이터에 선택적으로 응답하는 구성이다. 본 발명에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 리플라잉 유닛은 도13에 도시된 바와 같이, 랭귀지 세팅(language setting)부, 리플라이 세팅부(reply setting)부 및 리플라이 기빙(reply giving)부을 포함하게 된다. 먼저, 랭귀지 세팅부는 유저 캐릭터의 보이스 데이터로부터 응답할 언어를 임의 설정하는 구성이다. 랭귀지 세팅부는 응답할 언어를 임의 설정하여, 예컨대, 유저 캐릭터가 한국어로 질문을 하더라도, 이에 응답하는 리플라이 대상자는 영어로 대답할 수 있으며, 랭귀지 세팅부는 대화 언어를 각각의 언어로 설정 하여 제공하고, 이를 통해 가상 공간 상에서는 언어가 미스매칭된 상태에서도 서로 대화가 자연스럽게 이루어질 수 있게 되는 것이다. 리플라이 세팅부는 보이스 데이터에 대해 응답할 호스트 캐릭터 또는 다른 유저 캐릭터 중 리플라이 대상 자를 임의 설정하는 구성이다. 리플라이 세팅부의 리플라이 대상자는 유저 캐릭터의 보이스 데이터에 대해 응답할 캐릭터를 설정하는 것으로, 유저 캐릭터의 지목 또는 호스트 캐릭터나 다른 유저 캐릭터의 자발적인 참여 또는 랜덤하게 설정할 수 있다.리플라이 기빙부는 매칭 유닛으로부터 매칭된 시나리오에 따라 리플라이 대상자가 자동으로 리플라이 데이터를 제공하는 구성이다. 리플라이 기빙부는, 리플라이 세팅부로부터 설정된 리플라이 대상자에게 유저 캐릭터의 보이스 데이 터에 대한 적절한 응답 데이터를 제시할 수 있다. 아울러, 리플라잉 유닛에서는 리플라이 데이터에 대한 유저 캐릭터의 리액션 데이터를 캐치하여 미리 저장 된 시나리오 데이터를 추가하여, 이를 통해 다양한 시나리오 데이터를 확보하는 것이 바람직하다. 본 발명의 권리 범위는 특허청구범위에 기재된 사항에 의해 결정되며, 특허 청구범위에 사용된 괄호는 선택적 한정을 위해 기재된 것이 아니라, 명확한 구성요소를 위해 사용되었으며, 괄호 내의 기재도 필수적 구성요소로 해석되어야 한다."}
{"patent_id": "10-2020-0115287", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템을 도시한 개념도이다. 도2는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 인터페이싱 유닛을 도시한 블록도이다. 도3은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 레코그니션 유닛을 도시한 블록도이다. 도4는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 레코그니션 유닛을 도시한 개념도이다. 도5는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 유저 셀렉팅부를 도시한 블록도이다. 도6은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 패턴 파티션부를 도시한 개념도이다. 도7은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 매칭넘버 할당부를 도시한 개념도이다. 도8은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 패턴 스캐터링부를 도시한 개념도이다. 도9는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 애널라이징 유닛을 도시한 블록도이다. 도10은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 애널라이징 유닛을 도시한 개념도이다. 도11은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 매칭 유닛을 도시한 블록도이다. 도12는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 매칭 유닛을 도시한 개념도이다. 도13은 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 리플라잉 유닛을 도시한 블록도이다. 도14는 본 발명의 일 실시예에 따른 가상 공간 기반의 보이스 데이터의 선택적 추출과 매칭 통한 커뮤니케이팅 시스템의 리플라잉 유닛을 도시한 개념도이다."}
