{"patent_id": "10-2013-0140719", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0057392", "출원번호": "10-2013-0140719", "발명의 명칭": "반도체 부품이 장착된 전자모듈의 하드웨어 안정성 검증 방법", "출원인": "전자부품연구원", "발명자": "천성일"}}
{"patent_id": "10-2013-0140719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "선정된 반도체 부품에 정전기, 전류, 전압 중 적어도 하나를 인가하여 상기 반도체 부품의 전기적 특성을 변화하는 단계;전기적 특성이 변화된 반도체 부품을 전자모듈의 하드웨어에 장착하는 단계;상기 반도체 부품이 장착된 전자모듈의 하드웨어에 설정된 온도, 진동, EMI 중 적어도 하나의 외부 스트레스를인가하는 단계; 및상기 외부 스트레스가 인가된 전자모듈의 하드웨어에서 고장이 발생하는 지 여부를 판단하는 단계를 포함함을특징으로 하는 반도체 부품이 장착된 전자모듈의 하드웨어의 안정성 검증 방법."}
{"patent_id": "10-2013-0140719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 전자 모듈의 하드웨어에서 고장이 발생하면,상기 외부 스트레스는 상기 반도체 부품의 고장과 관련이 있다고 판단함을 특징으로 하는 반도체 부품이 장착된전자모듈의 하드웨어 안정성 검증 방법."}
{"patent_id": "10-2013-0140719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 전기적 특성이 변화된 반도체 부품을 전자모듈의 하드웨어에 장착하는 단계 이후에,반도체 부품이 장착된 전자모듈의 하드웨어가 정상적으로 동작하는 것을 확인하는 단계를 추가하며, 상기 하드웨어가 정상적으로 동작하면 상기 외부 스트레스를 인가함을 특징으로 하는 반도체 부품이 장착된 전자모듈의하드웨어 안정성 검증 방법."}
{"patent_id": "10-2013-0140719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 선정된 상기 반도체 부품에 정전기를 인가하는 회로는, 고전압펄스 발생부;일단은 스위치에 의해 상기 고전압펄스 발생부와 연결되며, 타단은 접지되며, 상기 스위치의 스위칭에 의해 상기 고전압펄스 발생부에 의해 발생된 전원이 충전되는 커패시턴스;일단은 상기 스위치에 의해 상기 고전압펄스 발생부와 연결되며, 타단은 상기 반도체 부품과 연결되며, 상기 스위치의 스위칭에 의해 상기 커패시턴스에 충전된 전원이 방전되면서 발생하는 전류가 흐르는 저항;상기 반도체 부품의 일단은 저항과 연결되며, 타단은 접지되며,상기 반도체 부품에 접촉하는 대상이 사람인지 기계인지 여부에 따라 상기 고전압펄스 발생부에서 발생하는 전압이 달라지며, 상기 저항과 접지 사이에 흐르는 전류가 달라지며,상기 접촉하는 대상이 기계인 경우에는 상기 접촉하는 대상이 사람인 경우에 상대적으로 발생되는 전압은 높게설정하며, 방전시 발생되는 전류는 낮게 설정함을 특징으로 하는 반도체 부품이 장착된 전자모듈의 하드웨어 안정성 검증 방법."}
{"patent_id": "10-2013-0140719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "선정된 반도체 부품에 정전기, 전류, 전압 중 적어도 하나를 인가하여 상기 반도체 부품의 전기적 특성을 변화공개특허 10-2015-0057392-3-하는 단계;전기적 특성이 변화된 반도체 부품을 전장모듈의 하드웨어에 장착하는 단계;반도체 부품이 장착된 전장모듈의 하드웨어가 정상적으로 동작하는 것을 확인하는 단계;상기 반도체 부품이 장착된 전장모듈의 하드웨어에 설정된 온도, 진동, EMI 중 적어도 하나의 외부 스트레스를인가하는 단계; 및상기 외부 스트레스가 인가된 전장모듈의 하드웨어에서 고장이 발생하는 지 여부를 판단하는 단계를 포함함을특징으로 하는 반도체 부품이 장착된 전장모듈의 하드웨어의 안정성 검증 방법."}
{"patent_id": "10-2013-0140719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서, 상기 전장 모듈의 하드웨어에서 고장이 발생하면,상기 외부 스트레스는 상기 반도체 부품의 고장과 관련이 있다고 판단함을 특징으로 하는 반도체 부품이 장착된전장모듈의 하드웨어 안정성 검증 방법."}
{"patent_id": "10-2013-0140719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서, 상기 전장 모듈의 하드웨어에서 고장이 발생하면,상기 외부 스트레스는 상기 반도체 부품의 고장과 상기 전장 모듈의 고장과 관련이 있다고 판단함을 특징으로하는 반도체 부품이 장착된 전장모듈의 하드웨어 안정성 검증 방법."}
{"patent_id": "10-2013-0140719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5항에 있어서, 선정된 상기 반도체 부품에 정전기를 인가하는 회로는, 고전압펄스 발생부;일단은 스위치에 의해 상기 고전압펄스 발생부와 연결되며, 타단은 접지되며, 상기 스위치의 스위칭에 의해 상기 고전압펄스 발생부에 의해 발생된 전원이 충전되는 커패시턴스;일단은 상기 스위치에 의해 상기 고전압펄스 발생부와 연결되며, 타단은 상기 반도체 부품과 연결되며, 상기 스위치의 스위칭에 의해 상기 커패시턴스에 충전된 전원이 방전되면서 발생하는 전류가 흐르는 저항;상기 반도체 부품의 일단은 저항과 연결되며, 타단은 접지되며,상기 반도체 부품에 접촉하는 대상이 사람인지 기계인지 여부에 따라 상기 고전압펄스 발생부에서 발생하는 전압이 달라지며, 상기 저항과 접지 사이에 흐르는 전류가 달라지며,상기 접촉하는 대상이 기계인 경우에는 상기 접촉하는 대상이 사람인 경우에 상대적으로 발생되는 전압은 높게설정하며, 방전시 발생되는 전류는 낮게 설정함을 특징으로 하는 반도체 부품이 장착된 전자모듈의 하드웨어 안정성 검증 방법."}
{"patent_id": "10-2013-0140719", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 반도체 부품이 장착된 전자모듈의 하드웨어 안정성 검증 방법에 관한 것으로, 더욱 상세하게는 자동차 나 인공위성 등의 구동에 구동에 사용되는 반도체 부품이 장착된 전자모듈의 하드웨어 안정성 검증 방법에 관한 것이다. (뒷면에 계속)"}
{"patent_id": "10-2013-0140719", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 반도체 부품이 장착된 전자모듈의 하드웨어 안정성 검증 방법에 관한 것으로, 더욱 상세하게는 자동 차나 인공위성 등의 구동에 구동에 사용되는 반도체 부품이 장착된 전자모듈의 하드웨어 안정성 검증 방법에 관 한 것이다."}
{"patent_id": "10-2013-0140719", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "배터리에서 전원을 공급하여 동작하는 전기/전자 부품 및 저항이나 콘덴서와 같은 소자들로 이루어진 작은 기판 을 포함하는 부품과 마이크로컴퓨터를 포함한 단면/양면 기판들과 기계적인 기구들이 조합된 부품들까지 포함된 것을 자동차 전장부품이라고 하며, 이는 전기가 흐르는 모든 부품이나 장치를 의미해 ESM(Electric/Electronic Sub Assembly)라고도 부른다. 최근 친환경 자동차 및 지능형 자동차, 하이브리드 자동차 등이 주목을 받으면서 더욱 전장부품 시장은 점점 최 신 기술 등의 발명을 통해 발전해 나가고 있으며, 기존 자동차 시장이 각종 환경적 사회 규제로 인해 대체 에너 지원을 활용한 자동차 계발에 앞서 투자하면서 그와 관련된 자동차 전장부품 시장도 더욱 활기를 띄고 있다. 자동차 전장부품은 자동차의 지능화를 위한 컨트롤 기능인 ECU, 이미 자동차 산업의 첨단 장치 발달로 높은 점 유율을 보이는 첨단 안전 차량, 최근 시장을 점유해 나가는 유해가스 배출량을 줄인 환경자동차 그리고 이제 막 시장에 뛰어들어 입지를 다지려는 유해가스는 물론 지구온난화의 주범인 이산화탄소를 전혀 배출하지 않는 무공 해자동차 등의 첨단 안전차량 및 친환경자동차의 첨단 전장부품 산업이 시장을 주도해 나가고 있다. 그러나 기존 자동차 기능 안전에서의 하드웨어(반도체)에 대해서는 Heavy-Ion Radiation, Pin-forcing Fault Injection, Electromagnetic Interterences 등에 대해 제안되고 있으나, 실질적으로 전장부품에 대한 하드웨어 결합을 도출함에 있어 전자부품 등의 결함 주입에 대한 방법 및 검증에 대한 연구가 부족한 상황이다."}
{"patent_id": "10-2013-0140719", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하려는 과제는 시장에 출고된 차량에 장착되어 있는 전장모듈의 기능 안전 시험을 위한 반도체 부품의 결합 주입 방법을 제안함에 있다."}
{"patent_id": "10-2013-0140719", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이를 위해 본 발명의 반도체 부품이 장착된 전자모듈의 하드웨어의 안정성 검증 방법은 선정된 반도체 부품에 정전기, 전류, 전압 중 적어도 하나를 인가하여 상기 반도체 부품의 전기적 특성을 변화하는 단계, 전기적 특성 이 변화된 반도체 부품을 전자모듈의 하드웨어에 장착하는 단계, 반도체 부품이 장착된 전자모듈의 하드웨어가 정상적으로 동작하는 것을 확인하는 단계, 상기 반도체 부품이 장착된 전자모듈의 하드웨어에 설정된 온도, 진 동, EMI 중 적어도 하나의 외부 스트레스를 인가하는 단계, 상기 외부 스트레스가 인가된 전자모듈의 하드웨어 에서 고장이 발생하는 지 여부를 판단하는 단계를 포함한다. 이를 위해 본 발명의 반도체 부품이 장착된 전자모듈의 하드웨어의 안정성 검증 방법은 선정된 반도체 부품에 정전기, 전류, 전압 중 적어도 하나를 인가하여 상기 반도체 부품의 전기적 특성을 변화하는 단계, 전기적 특성 이 변화된 반도체 부품을 전자모듈의 하드웨어에 장착하는 단계, 상기 반도체 부품이 장착된 전자모듈의 하드웨 어에 설정된 온도, 진동, EMI 중 적어도 하나의 외부 스트레스를 인가하는 단계, 상기 외부 스트레스가 인가된 전자모듈의 하드웨어에서 고장이 발생하는 지 여부를 판단하는 단계를 포함한다."}
{"patent_id": "10-2013-0140719", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 반도체 부품의 집적도 향상 및 칩 사이즈 감소 등에 따른 전자모듈 사용과정에서 발생 가능한 고장에 대한 모의 시뮬레이션이 가능하며, 특히 Electrical Overstress(EOS) 등과 같은 반도체 주요 고장 현상에 대한 검증이 가능하다는 장점이 있다."}
{"patent_id": "10-2013-0140719", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한, 그리고 추가적인 본 발명의 양상들은 첨부된 도면을 참조하여 설명되는 바람직한 실시 예들을 통하여 더욱 명백해질 것이다. 이하에서는 본 발명의 이러한 실시 예를 통해 당업자가 용이하게 이해하고 재현할 수 있 도록 상세히 설명하기로 한다. 도 1은 차량에 장착되어 있는 전장부품을 도시하고 있다. 일반적으로 자동차 관련 핵심 전장부품은 다음과 같다. 전기 구동 모터는 엔진을 대체하여 자동차 구동을 가능 하게 하는 모터로 엔진과 함께 장착되어 엔진 보조역할을 하며, 전기자동차의 핵심 부품이다. 대용량 배터리는 하이브리드 자동차 및 전기 자동차에서 기존의 엔진을 대신하며, 동력을 지원해주는 역할을 수행한다. 인버터는 전력용 반도체를 사용하여 상용 교류전원을 직류전원으로 변환시킨 후 다시 임의의 주파수와 전압을 갖는 교류 로 변환시켜 유도전동기의 회전 속도를 제어한다. IGBT 모듈은 인버터용으로 대전력 스위칭 및 제어용 파워 모듈이다. DC-DC 컨버터는 구동회로를 보호하고 냉각 시스템을 갖추고 있으며, 고전압 빈딩(binding) 기술이 집적되어 있는 부품이다. 전력 반도체 및 제어 모듈은 자동차의 주행상태 및 운전자의 의지를 판단하여 최적의 운행 상태가 되도록 엔진 및 자동변속기를 통합 제어하 는 장치로 인버터, 컨버터, 제어기 등을 구동 및 제어한다. 캐패시터는 PCU 내에 모듈화되어 공급되며, 필터, 전압안정, 과도전압 크램프 기능을 수행한다. 또한 자동차는 14V에서 600V까지의 고전압과 80A 이상의 대전류를 사용하기 때문에 커넥터에서도 새로운 기술이 요구되고 있다. 고전력 하니스는 ALT 및 배터리의 응축 전류를 손실없이 전기 전장품에 전달하는 전지 전선을 셋팅한 것으로 전자파 차폐가 가능한 실드 케이블, 안정성과 고내구성 확보 기술이 핵심이다. DC 파워 릴레이는 배터리의 고압 직류 전원을 개폐하는 파워 릴레이로서 핵심 기술은 아크 방지, 작동 노이즈 저감, 접촉 신뢰성 확보가 핵심이다. 전자제어 연료분사 시스템은 연료소비 감소와 배기가스 감축을 위한 필수 장치로서 연료를 각 실린더로 흡입하 여 다기관에 직접 분사하는 시스템을 갖추고 있다. 전자식 트로로바디 컨트롤 장치는 공기-연료 혼합비를 최적화하고 엔진으로의 흡입 공기를 제어함으로써 연소를 최적화하여 엔진 성능 및 내구성을 극대화시키고, 연비를 향상시키며 배기량을 감소시키는 기능을 수행한다. 전자식 조향장치는 기존 유압식 파워 스티어링을 전기 모터로 대체하여 전자제어를 통한 조향력을 보조해주는 장치이다. 이외에도 텔레매틱스, 차체 제어 모듈, 가변제어 전자식 써모스탯, 전자제어식 서스팬스 컨트롤, 에 어백 센싱 및 컨트롤 유닛, 전류 센서 등이 있다. 이외에도 다양한 전장 모듈이 차량에 장착된다. 도 2는 본 발명의 일실시 예에 따른 전장 모듈에 장착된 반도체 부품에 대한 안정성 검증 방법을 도시한 흐름도 이다. 이하 도 2를 이용하여 본 발명의 일실시 예에 따른 전장 모듈에 장착된 반도체 부품에 대한 안정성 검증 방법에 대해 상세하게 알아보기로 한다. S200단계는 자동차 전장모듈의 주 기능에 영향을 줄 수 있는 핵심 반도체 부품을 선정하고, 선정된 부품에 과부 하를 인가하여 부품 내부의 특성을 변화시킨다. S202단계는 반도체 부품 입력단에 정격이상의 정전기, 과전압 그리고 과전류 등을 인가하여 칩 내부회로의 특성 값을 변화시킨다. S204단계는 외부 스트레스로 인해 잠재결함을 갖고 있는 반도체 부품을 전장모듈 하드웨어에 장착하여 하드웨어 의 기능이 정상동작하고 있는 것을 확인한다. S206단계는 잠재결함 부품을 장착한 전장 모듈 하드웨어에 대해 하드웨어 고장발생과 유사한 외부환경(온도, 진 동, EMI 등)을 인위적으로 가하여 전장 하드웨어의 결함을 촉진하여 고장으로 검출한다. 이와 같이 본 발명은 잠재결함을 내포하고 있는 부품을 하드웨어에 장착한 후, 인위적으로 하드웨어 고장발생과 유사한 외부환경에 가함으로써, 하드웨어의 고장발생 유무를 이용하여 해당 외부환경과의 상관관계를 파악한다. 즉, 하드웨어에 고장이 발생한 경우에는 해당 외부환경과 밀접한 관련이 있는 것으로 판단하며, 하드웨어에 고 장이 발행하는 경우에는 해당 외부 환경은 하드웨어의 고장과 관련이 없는 것으로 판단한다. 부가하여, 하드웨어에 고장이 발생한 경우에는 해당 반도체 부품의 고장과 해당 외부 환경과 관련이 있음을 판 단할 수 있으며, 하드웨어에 고장이 발생하지 않은 경우에는 해당 반도체 부품과 해당 외부 환경은 관련이 없다 고 판단할 수 있다. 도 3은 본 발명의 일실시 예에 따른 전장 모듈에 장착된 반도체 부품에 대한 안정성을 검증하는 장치를 도시하 고 있다. 이하 도 3을 이용하여 본 발명의 일실시 예에 따른 전장 모듈에 장착된 반도체 부품에 대한 안정성을 검증하는 장치의 구성에 대해 상세하게 알아보기로 한다. 도 3에 의하면, 전장 모듈에 장착된 반도체 부품의 안정성 검증 장치는 저장부, 제어부, 입력부, 표시부, 테스 트 실행부를 포함한다. 물론 상술한 구성 이외에 다른 구성이 전장 모듈의 안정성 검증 장치에 포함될 수 있음 은 자명하다. 저장부는 반도체 부품의 종류, 각 반도체 부품별 스트레스 조건, 스트레스 유형, 각 반도체 부품별 고장 유형을 저장한다. 또한 저장부는 전장 모듈의 안정성을 검증하기 위한 구동 프로그램을 저장한다. 입력부는 사용자로부터 필요한 데이터를 입력받기 위해 키보드, 터치스크린(터치 패드) 형태로 구성된다. 입력부가 터치스크린 형태로 구성되는 표시부가 입력부의 기능을 수행할 수 있다. 입력부는 사용자로 부터 테스트를 수행할 반도체부품, 해당 반도체 부품의 스트레스 조건을 입력받는다. 또한, 입력부는 사용 자로부터 스트레스를 받은 반도체 부품을 장착된 전장모듈 하드웨어, 해당 전장모듈 하드웨어의 스트레스 조건 을 입력받는다. 표시부는 제어부의 제어 명령에 따라 다양한 정보를 표시한다. 일 예로 입력부를 통해 입력되는 정보 를 표시하거나, 전장 모듈 테스트 장치에서 수행되고 있는 스트레스 조건을 표시할 수 있다. 이외에도 사용자가 요청하는 다양한 정보를 표시할 수 있다. 테스트 실행부는 입력부에 의해 입력된 스트레스 조건 또는 제어부에 의한 제어 명령에 따라 해 당 반도체 부품, 또는 전장 모듈 하드웨어에 대한 테스트를 수행한다. 테스트 실행부에서 실행된 테스트 결과는 제어부의 제어 명령에 따라 표시부에 표시되거나, 별도의 장치를 이용하여 고장 여부를 표시한다. 제어부는 전장 모듈에 장착된 반도체 부품의 안정성 검증 장치를 구성하고 있는 구성요소를 제어한다. 제 어부는 입력부를 통해 입력된 스트레스 조건으로 해당 반도체 부품 또는 반도체 부품이 실장된 전장 모듈 하드웨어에 대한 안정성을 검증하도록 테스트 실행부를 제어한다. 또한 제어부는 각 전장 모듈별 고 장 유형이나 스트레스 조건을 저장하도록 저장부를 제어한다. 이외에도 제어부는 사용자의 요청에 따 라 다양한 정보를 표시하도록 표시부를 제어한다. 도 4는 본 발명의 일실시 예에 따른 전자 모듈에 장착된 반도체 부품에 대한 안정성 검증 방법을 도시한 흐름도 이다. 이하 도 4를 이용하여 본 발명의 일실시 예에 따른 전자 모듈에 장착된 반도체 부품에 대한 안정성 검증 방법에 대해 상세하게 알아보기로 한다. S400단계는 전자부품을 포함하는 전자모듈의 주 기능에 영향을 줄 수 있는 핵심 반도체 부품을 선정하고, 선정 된 부품에 과부하를 인가하여 부품 내부의 특성을 변화시킨다. S402단계는 반도체 부품 입력단에 정격이상의 정전기, 과전압 그리고 과전류 등을 인가하여 칩 내부회로의 특성 값을 변화시킨다. 특히 본 발명은 정전기를 인가하여 칩 내부의 전압-전류 특성을 변화시킨다. 도 5는 본 발명의 일실시 예에 따른 칩 내부에 정전기를 인가하는 회로 구성을 도시한 도면이다. 이하 도 5를 이용하여 칩 내부에 정전기를 인가하는 회로 구성에 대해 상세하게 알아보기로 한다. 도 5에 의하면, 정전기를 인가하는 회로는 고전압펄스 발생부, 커패시턴스, 저항, 두 개의 스위치를 포함한다. 물론 상술한 구성 이외에 다른 구성이 고전압펄스 발생부에 포함될 수 있음은 자명하다. 본 발명과 관련하여 HBM(휴먼 바디 모델, 인체 모델, 접촉대상이 사람인 모델)에 관련된 반도체 부품은 100pF의 커패시턴스, 1500Ω 의 저항을 사용한다. 또한, HBM에 관련된 반도체 부품은 2200V 충전 후 방전시 10ns일 때 최대 1.3A의 전류가발생하도록 한다. MM(머신 모델, 접촉대상이 기계인 모델)에 관련된 반도체 부품은 200pF의 커패시턴스, 25Ω의 저항을 사용한다. 또한, HBM(휴먼 바디 모델)에 관련된 반도체 부품은 400V 충전 후 방전시 방전시 10ns 일 때 최대 7A 의 전류가 발생하도록 한다. S404단계는 외부 스트레스로 인해 잠재결함을 갖고 있는 반도체 부품을 전자모듈 하드웨어에 장착하여 하드웨어 의 기능이 정상동작하고 있는 것을 확인한다. S406단계는 잠재결함 부품을 장착한 전자 모듈 하드웨어에 대해 하드웨어 고장발생과 유사한 외부환경(온도, 진 동, EMI 등)을 인위적으로 가하여 전장 하드웨어의 결함을 촉진하여 고장으로 검출한다. 본 발명은 도면에 도시된 일실시 예를 참고로 설명되었으나, 이는 예시적인 것에 불과하며, 본 기술 분야의 통 상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다."}
{"patent_id": "10-2013-0140719", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 차량에 장착되어 있는 전장부품을 도시하고 있다. 도 2는 본 발명의 일실시 예에 따른 전장 모듈에 장착된 반도체 부품에 대한 안정성 검증 방법을 도시한 흐름도 이다.도 3은 본 발명의 일실시 예에 따른 전장 모듈에 장착된 반도체 부품에 대한 안정성을 검증하는 장치를 도시하 고 있다. 도 4는 본 발명의 일실시 예에 따른 전자 모듈에 장착된 반도체 부품에 대한 안정성 검증 방법을 도시한 흐름도 이다. 도 5는 본 발명의 일실시 예에 따른 정전기를 인가하는 회로를 도시하고 있다."}
