{"patent_id": "10-2022-0068345", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0131499", "출원번호": "10-2022-0068345", "발명의 명칭": "렌탈 마켓 시스템", "출원인": "(주)빅팟", "발명자": "배지영"}}
{"patent_id": "10-2022-0068345", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "마켓 서버(20)에 사용자 인증을 거친 후, 판매하고자 하는 중고 물품을 등록하고, 중고 물품을 등록할 때 고객이 중고 물품을 렌탈할 수 있는 판매 조건을 설정하는 판매 단말기(10);상기 판매 단말기(10)로부터 중고 물품을 등록받고, 판매 조건에 더해 기부 조건, 할인 조건, 경품 조건을 저장하고, 고객 단말기(30)가 렌탈할 중고 물품을 조회할 때 판매 조건, 기부 조건, 할인 조건, 경품 조건에 대한정보를 제공하는 마켓 서버(20);상기 마켓 서버(20)에 접속하여 상기 마켓 서버(20)에 등록된 중고 물품을 조회하고, 중고 물품에 설정된 판매조건, 기부 조건, 할인 조건, 경품 조건을 열람하는 고객 단말기(30); 및상기 판매 단말기(10)가 상기 마켓 서버(20)에 중고 물품을 등록할 때, 상기 고객 단말기(30)가 상기 마켓 서버(20)에 접속하여 중고 물품을 선택할 때, 상기 판매 단말기(10)가 상기 고객 단말기(30)에 중고 물품을 배송할때 중 어느 하나의 시점에 상기 마켓 서버(20)의 대금 보증 요청에 대해 대금 보증을 수행하는 보증 서버(40);를 포함하는 것을 특징으로 하는, 렌탈 마켓 시스템."}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예들은, 마켓 서버에 사용자 인증을 거친 후, 판매하고자 하는 중고 물품을 등록하고, 중고 물품을 등록 할 때 고객이 중고 물품을 렌탈할 수 있는 판매 조건을 설정하는 판매 단말기; 상기 판매 단말기로부터 중고 물품을 등록받고, 판매 조건에 더해 기부 조건, 할인 조건, 경품 조건을 저장하고, 고객 단말기가 렌탈 (뒷면에 계속)"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 중고 물품을 마켓 서버에 등록하고, 고객 단말기는 마켓 서버에 접속해서 등록된 중고 물 품을 열람하고, 고객이 원하는 중고 물품을 렌탈 서비스로 이용하는 렌탈 마켓 시스템에 대한 것이다."}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명 렌탈 마켓 시스템에 관련된 종래기술을 예로 들면, 특허문헌 1 오픈 마켓서버를 이용한 렌탈 서비스 제 공 방법은 온라인상에 물품 대여 서비스를 제공할 수 있는 네트워크를 구축하여 사용자가 다양한 가입자(서비스 제공자)의 물품을 접할 수 있도록 하여 물품의 대여를 손쉽게 할 수 있다. 또한, 특허문헌 2 전자상거래를 통한 중고물품 렌탈서비스방법은 개인이 보유한 잉여중고물품도 앱 또는 웹을 통해 렌탈사업자와 연결되어 렌탈이 이루어질 수 있고, 렌탈사업자는 추가비용없이 중고물품을 확보하여 렌탈사 업을 더욱 활성화시킬 수 있고, 렌탈수요자가 원하는 렌탈물건이 렌탈서버에 없었을 때 즉시 렌탈요청정보를 렌 탈사업자에게 전송하여 요청물건은 찾아 렌탈서버에 등록시키게 함으로써 빠른 렌탈거래가 이루어질 수 있다. 그러나 종래 렌탈 마켓 시스템은 본 발명과 같이, 중고 물품의 판매 조건에 기부 조건, 할인 조건, 경품 조건을 더함으로써 중고 물품에 대한 렌탈 거래를 활성화하지 못하는 문제점이 있다. 선행기술문헌 관련 선행기술로, 한국 등록특허공보 제10-0910616호(발명의 명칭: 오픈 마켓서버를 이용한 렌탈 서비스 제공 방법), 한국 공개특허공보 제10-2017-0101669호(발명의 명칭: 전자상거래를 통한 중고물품 렌탈서비스방법)가 있다."}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "위에서 설명한 배경기술은 발명자가 본원의 개시 내용을 도출하는 과정에서 보유하거나 습득한 것으로서, 반드"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "시 본 출원 전에 일반 공중에 공개된 공지기술이라고 할 수는 없다. [[배경기술에 기재한 내용이 공개된 것인지"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 4, "content": "여부가 불명확할 경우에 기재할 것. 배경기술 관련 최신 판례: 대법원 2017. 1. 19. 선고 2013후37 전원합의체 판결]]"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 5, "content": "발명의 내용"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예들은, 판매 단말기가 판매할 중고 물품을 등록하고, 고객 단말기가 렌탈할 중고 물품을 조회하고, 원하는 중고 물품을 렌탈 서비스로 이용하는 렌탈 마켓 시스템을 제공할 수 있다. 또한, 실시예들은, 중고 물품에 대해 판매 조건, 기부 조건, 할인 조건, 경품 조건을 열람하고, 조건에 맞는 중 고 물품을 렌탈 서비스로 이용하는 렌탈 마켓 시스템을 제공할 수 있다. 또한, 실시예들은, 중고 물품을 등록, 조회, 선택에 대한 사용 경험을 수집하고, 수집된 사용 경험에 기반한 중 고 물품 추천을 제공하는 렌탈 마켓 시스템을 제공할 수 있다. 실시예들에서 이루고자 하는 기술적 과제들은 이상에서 언급한 사항들로 제한되지 않으며, 언급하지 않은 또 다"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "른 기술적 과제들은 이하 설명할 다양한 실시예들로부터 당해 기술분야에서 통상의 지식을 가진 자에 의해 고려 될 수 있다."}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예들에 따르면, 마켓 서버에 사용자 인증을 거친 후, 판매하고자 하는 중고 물품을 등록하고, 중고 물 품을 등록할 때 고객이 중고 물품을 렌탈할 수 있는 판매 조건을 설정하는 판매 단말기; 상기 판매 단말기 로부터 중고 물품을 등록받고, 판매 조건에 더해 기부 조건, 할인 조건, 경품 조건을 저장하고, 고객 단말 기가 렌탈할 중고 물품을 조회할 때 판매 조건, 기부 조건, 할인 조건, 경품 조건에 대한 정보를 제공하는 마켓 서버; 상기 마켓 서버에 접속하여 상기 마켓 서버에 등록된 중고 물품을 조회하고, 중고 물품 에 설정된 판매 조건, 기부 조건, 할인 조건, 경품 조건을 열람하는 고객 단말기; 및 상기 판매 단말기(1 0)가 상기 마켓 서버에 중고 물품을 등록할 때, 상기 고객 단말기가 상기 마켓 서버에 접속하여 중 고 물품을 선택할 때, 상기 판매 단말기가 상기 고객 단말기에 중고 물품을 배송할 때 중 어느 하나의 시점에 상기 마켓 서버의 대금 보증 요청에 대해 대금 보증을 수행하는 보증 서버;를 포함하는 것을 특 징으로 한다. 또한, 상기 판매 단말기는, 중고 물품을 등록할 때 고객이 중고 물품을 렌탈할 수 있는 판매 조건을 설정하 고, 상기 판매 조건에는 렌탈 가입 개월, 물품 가격, 월 납입 비용이 포함될 수 있고, 상기 렌탈 가입 개월은 물품 렌탈이 계속되는 가입 개월이고, 상기 물품 가격은 물품에 책정된 가격이고, 상기 월 납입 비용은 렌탈이 계속될 때 월에 고객이 판매자에게 지급해야 할 비용인 것을 특징으로 한다. 또한, 상기 판매 단말기는, 상기 마켓 서버에 판매하고자 하는 중고 물품을 등록함에 있어 기부 조건을 설정하고, 상기 기부 조건은 상기 판매 조건에 더해 부가되며, 기부 서버에 입금된 기부 비용에 대한 정보를 포 함하고, 상기 기부 서버는 상기 판매 단말기가 상기 마켓 서버에 등록된 물품이 고객에게 렌탈되면서 월마다 상기 마켓 서버에 지급되는 월 납입 비용에서 기부 비용을 상기 마켓 서버로부터 입금받는 것을 특징으로 한다. 또한, 상기 판매 단말기는, 상기 마켓 서버에 판매하고자 하는 중고 물품을 등록함에 있어 할인 조건을 설정하고, 상기 할인 조건은 상기 판매 조건에 더해 부가되며, 상기 마켓 서버에 입금될 월 납입 비용에서 제외될 할인 비용에 대한 정보를 포함하고, 상기 마켓 서버는 상기 판매 단말기가 상기 마켓 서버 에 등록된 물품이 고객에게 렌탈되면서 월마다 상기 마켓 서버에 지급되는 월 납입 비용에서 할인 비용이 제외되고 상기 마켓 서버에 입금되는 것을 특징으로 한다. 또한, 상기 판매 단말기는, 상기 마켓 서버에 판매하고자 하는 중고 물품을 등록함에 있어 경품 조건을 설정하고, 상기 경품 조건은 상기 판매 조건에 더해 부가되며, 상기 마켓 서버에 등록된 물품이 고객에게 렌탈될 때 추가로 제공될 경품에 대한 정보를 포함하고, 상기 판매 단말기는 상기 마켓 서버의 중개로, 상기 고객 단말기에 중고 물품과 경품 물품을 제공하는 것을 특징으로 한다. 또한, 상기 판매 단말기 또는 상기 고객 단말기는, 스마트폰의 키값, 생체 정보를 입력받아 인증 서버 에 사용자 인증을 요청하고, 생성된 킷값을 디스플레이에 표시하고, 상기 디스플레이에 표시된 킷값을 입력 하고, 사용자 정보와 함께 상기 인증 서버로 전송하고, 상기 인증 서버는 상기 스마트폰로부터 킷값을 수 신하고, 상기 스마트폰으로부터 킷값과 사용자 정보를 수신하여 상기 스마트폰의 킷값과 사용자 정보를 비교하 고, 상기 사용자 정보를 대응시켜 상기 스마트폰의 렌탈 마켓 시스템에 대한 인증을 처리하고, 인증 결과를 상 기 스마트폰로 전송하여 상기 렌탈 마켓 시스템에 대한 사용자의 사용을 허가하는 것을 특징으로 한다.또한, 상기 인증 서버는, 사용자 정보의 히스토리 분석을 수행하고, 시간 흐름에 따라 사용자 정보의 일관성, 변화를 비교 판단하고, 상기 히스토리 분석에서 사용자 정보가 일관성을 나타내면 사용자의 사용을 허 가하고, 변화를 나타내면 사용자의 사용을 허가하지 않고, 사용자 정보가 일관성을 나타낼 때 사용자의 시스템 사용을 허가함으로써 사용자 정보가 변조된 사용자가 시스템에 접근하지 못하도록 보안을 강화하는 것을 특징으 로 한다. 또한, 신경망이 탑재된 제어부를 포함하는 상기 마켓 서버는, 상기 판매 단말기의 중고 물품 등록, 상기 고객 단말기의 물품 조회에 대한 사용 경험 정보를 수집하고, 수집된 사용 경험 정보에 기반한 통계 분석, 신경망 학습, 패턴 분석을 수행하고, 분석 결과에 따른 중고 물품 추천을 상기 고객 단말기에 제공하 는 것을 특징으로 한다. 또한, 상기 마켓 서버는, 머신 러닝 알고리즘을 이용하여 상기 판매 단말기의 물품 등록, 상기 고객 단 말기의 물품 조회, 중고 물품 선택, 판매 조건, 기부 조건, 할인 조건, 경품 조건에 대한 사용자 경험을 분 석하고, 대금 지급과 관련된 상관 관계도 분석하는 것을 특징으로 한다. 또한, 상기 고객 단말기는, 임베디드 장치로 구현될 수 있고, 상기 임베디드 장치는 스마트폰을 포함하며, 기본 구성 요소로 프로세서, 메모리, 디스플레이를 포함하고, 상용 OS를 구비하고, OS에서 동작하는 애플리케이 션 형태로 렌탈 마켓 시스템이 구현되는 것을 특징으로 한다."}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들에 따르면, 판매 단말기가 판매할 중고 물품을 등록하고, 고객 단말기가 렌탈할 중고 물품을 조회함으 로써, 고객이 원하는 중고 물품을 렌탈 서비스로 이용할 수 있다. 또한, 실시예들에 따르면, 중고 물품에 대해 판매 조건, 기부 조건, 할인 조건, 경품 조건을 열람함으로써, 고 객이 조건에 맞는 중고 물품을 렌탈 서비스로 이용할 수 있다. 또한, 실시예들에 따르면, 중고 물품을 등록, 조회, 선택에 대한 사용 경험을 수집함으로써, 렌탈 마켓 시스템 은 수집된 사용 경험에 기반한 중고 물품 추천을 제공하고, 고객은 자신이 원하는 중고 물품을 이용할 수 있다. 실시예들로부터 얻을 수 있는 효과들은 이상에서 언급된 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 이하의 상세한 설명을 기반으로 당해 기술분야에서 통상의 지식을 가진 자에게 명확하게 도출되고 이해 될 수 있다."}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 실시예들은 실시예들의 구성요소들과 특징들을 소정 형태로 결합한 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려될 수 있다. 각 구성요소 또는 특징은 다른 구성요소나 특 징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 다양한 실시예 들을 구성할 수도 있다. 다양한 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있다. 도면에 대한 설명에서, 다양한 실시예들의 요지를 흐릴 수 있는 절차 또는 단계 등은 기술하지 않았으며, 당해"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자의 수준에서 이해할 수 있을 정도의 절차 또는 단계는 또한 기술하지 아니 하였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함(comprising 또는 including)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미 한다. 또한, 명세서에 기재된 \"...부\", \"...기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, \"일(a 또는 an)\", \"하나(one)\", \"그(the)\" 및 유사 관련어는 다양한 실시예들을 기술하는 문맥에 있어서(특히, 이하의 청구항의 문맥에서) 본 명세서에 달리 지시되거나 문맥에 의해 분명하게 반박되지 않는 한, 단수 및 복 수 모두를 포함하는 의미로 사용될 수 있다. 이하, 다양한 실시예들에 따른 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이 하에 개시될 상세한 설명은 다양한 실시예들의 예시적인 실시형태를 설명하고자 하는 것이며, 유일한 실시형태 를 나타내고자 하는 것이 아니다. 또한, 다양한 실시예들에서 사용되는 특정(特定) 용어들은 다양한 실시예들의 이해를 돕기 위해서 제공된 것이 며, 이러한 특정 용어의 사용은 다양한 실시예들의 기술적 사상을 벗어나지 않는 범위에서 다른 형태로 변경될 수 있다. 도 1은 본 발명 렌탈 마켓 시스템의 구성을 보인 예시도로서, 도 1을 참조하면, 렌탈 마켓 시스템은 판매 단말 기, 마켓 서버, 고객 단말기, 보증 서버를 포함한다. 판매 단말기는 마켓 서버에 사용자 인증을 거친 후, 판매하고자 하는 중고 물품을 등록한다. 판매 단말 기는 중고 물품을 등록할 때 고객이 중고 물품을 렌탈할 수 있는 판매 조건을 설정한다. 판매 조건에는 렌 탈 가입 개월, 물품 가격, 월 납입 비용이 포함될 수 있고, 렌탈 가입 개월은 물품 렌탈이 계속되는 가입 개월 이고, 물품 가격은 물품에 책정된 가격이고, 월 납입 비용은 렌탈이 계속될 때 월에 고객이 판매자에게 지급해 야 할 비용이다. 판매 단말기는 마켓 서버에 판매하고자 하는 중고 물품을 등록함에 있어 기부 조건을 설정할 수 있다. 기부 조건은 판매 조건에 더해 부가되며, 기부 서버에 입금된 기부 비용에 대한 정보를 포함한다. 기부 서버는 판매 단말기가 마켓 서버에 등록된 물품이 고객에게 렌탈되면서 월마다 마켓 서버에 지급되는 월 납입 비용에서 기부 비용을 마켓 서버로부터 입금받는다. 판매 단말기는 마켓 서버에 판매하고자 하는 중고 물품을 등록함에 있어 할인 조건을 설정할 수 있다. 할인 조건은 판매 조건에 더해 부가되며, 마켓 서버에 입금될 월 납입 비용에서 제외될 할인 비용에 대한 정보를 포함한다. 마켓 서버는 판매 단말기가 마켓 서버에 등록된 물품이 고객에게 렌탈되면서 월 마다 마켓 서버에 지급되는 월 납입 비용에서 할인 비용이 제외되고 마켓 서버에 입금된다. 판매 단말기는 마켓 서버에 판매하고자 하는 중고 물품을 등록함에 있어 경품 조건을 설정할 수 있다. 경품 조건은 판매 조건에 더해 부가되며, 마켓 서버에 등록된 물품이 고객에게 렌탈될 때 추가로 제공될 경 품에 대한 정보를 포함한다. 판매 단말기는 마켓 서버의 중개로, 고객 단말기에 중고 물품과 경품 물품을 제공한다. 마켓 서버는 판매 단말기로부터 중고 물품을 등록받고, 판매 조건에 더해 기부 조건, 할인 조건, 경품 조건을 저장한다. 마켓 서버는 고객 단말기가 렌탈할 중고 물품을 조회할 때 판매 조건, 기부 조건, 할 인 조건, 경품 조건에 대한 정보를 제공한다. 판매 조건은 물품이 어떤 렌탈 조건으로 고객에게 렌탈될 조건이 고, 기부 조건은 물품이 렌탈될 때 얼마만큼의 기부 비용이 지급될 조건이고, 할인 조건은 물품 가격에서 얼마 만큼의 할인 비용이 제외될 조건이고, 경품 조건은 중고 물품에 더해 어떤 경품이 제공될 조건이다. 마켓 서버는 고객 단말기가 렌탈할 중고 물품을 조회할 때 고객 단말기에 판매 조건을 제공한다. 마켓 서버는 판매 조건으로, 가입 개월, 물품 가격, 월 납입 비용을 제공하고, 고객 단말기는 마켓 서 버에 등록된 중고 물품의 판매 조건을 조회하고, 고객이 원하는 중고 물품을 선택할 수 있도록 편의를 제공한다. 마켓 서버는 고객 단말기가 렌탈할 중고 물품을 조회할 때 고객 단말기에 판매 조건에 더해 기부 조건을 제공한다. 마켓 서버는 기부 조건으로, 기부 비용을 제공하고, 고객 단말기는 마켓 서버에 등록된 중고 물품의 판매 조건에 더해 설정된 기부 조건을 조회하고, 고객이 원하는 중고 물품을 선택할 수 있 도록 편의를 제공한다. 마켓 서버는 고객 단말기가 렌탈할 중고 물품을 조회할 때 고객 단말기에 판매 조건에 더해 할인 조건을 제공한다. 마켓 서버는 할인 조건으로, 할인 비용을 제공하고, 고객 단말기는 마켓 서버에 등록된 중고 물품의 판매 조건에 더해 설정된 할인 조건을 조회하고, 고객이 원하는 중고 물품을 선택할 수 있 도록 편의를 제공한다. 마켓 서버는 고객 단말기가 렌탈할 중고 물품을 조회할 때 고객 단말기에 판매 조건에 더해 경품 조건을 제공한다. 마켓 서버는 경품 조건으로, 경품 정보를 제공하고, 고객 단말기는 마켓 서버에 등록된 중고 물품의 판매 조건에 더해 설정된 경품 조건을 조회하고, 고객이 원하는 중고 물품을 선택할 수 있 도록 편의를 제공한다. 마켓 서버는 판매 단말기가 물품을 등록하면, 보증 서버에 대금 보증을 등록한다. 마켓 서버와 보증 서버 사이에는 판매 단말기가 등록한 중고 물품이 렌탈될 때 발생할 중개 비용에 대한 대금 보증 이 이루어진다. 마켓 서버는 보증 서버에 대금 보증을 등록하고, 보증 서버는 고객 단말기와 판매 단말기 사이에 이루어질 비용 지급을 보증한다. 고객 단말기는 마켓 서버에 접속하여 마켓 서버에 등록된 중고 물품을 조회하고, 중고 물품에 설정 된 판매 조건, 기부 조건, 할인 조건, 경품 조건을 열람한다. 판매 조건은 물품이 어떤 렌탈 조건으로 고객에게 렌탈될 조건이고, 기부 조건은 물품이 렌탈될 때 얼마만큼의 기부 비용이 지급될 조건이고, 할인 조건은 물품 가격에서 얼마만큼의 할인 비용이 제외될 조건이고, 경품 조건은 중고 물품에 더해 어떤 경품이 제공될 조건이 다. 고객 단말기는 마켓 서버에 등록된 중고 물품을 조회하고, 중고 물품에 설정된 판매 조건을 열람한다. 고객 단말기는 판매 조건으로, 가입 개월, 물품 가격, 월 납입 비용을 열람하고, 고객이 원하는 중고 물품 을 선택하고, 마켓 서버에 중고 물품 배송을 요청한다. 고객 단말기는 마켓 서버에 등록된 중고 물품을 조회하고, 중고 물품에 설정된 기부 조건을 열람한다. 고객 단말기는 기부 조건으로, 기부 비용을 열람하고, 고객이 원하는 중고 물품을 선택하고, 마켓 서버(2 0)에 중고 물품 배송을 요청한다. 고객 단말기는 마켓 서버에 등록된 중고 물품을 조회하고, 중고 물품에 설정된 할인 조건을 열람한다. 고객 단말기는 할인 조건으로, 할인 비용을 열람하고, 고객이 원하는 중고 물품을 선택하고, 마켓 서버(2 0)에 중고 물품 배송을 요청한다. 고객 단말기는 마켓 서버에 등록된 중고 물품을 조회하고, 중고 물품에 설정된 경품 조건을 열람한다. 고객 단말기는 경품 조건으로, 경품 정보를 열람하고, 고객이 원하는 중고 물품을 선택하고, 마켓 서버(2 0)에 중고 물품 배송을 요청한다. 보증 서버는 판매 단말기가 마켓 서버에 중고 물품을 등록할 때, 고객 단말기가 마켓 서버(2 0)에 접속하여 중고 물품을 선택할 때, 판매 단말기가 고객 단말기에 중고 물품을 배송할 때 중 어느 하나의 시점에 마켓 서버의 대금 보증 요청에 대해 대금 보증을 수행한다. 보증 서버는 판매 단말기 , 마켓 서버, 고객 단말기 사이에 중고 물품 렌탈에 대한 안전 거래를 보증한다. 도 2는 도 1 렌탈 마켓 시스템의 메시지 흐름도로서, 도 2를 참조하면, 렌탈 마켓 시스템은 물품 등록(S101), 물품 조회(S102), 대금 보증(S103), 물품 수령(S104), 대금 매달 지급(S105), 대금 매달 수령(S106)을 포함한 다. 판매 단말기는 마켓 서버에서 운영하는 렌탈 마켓 시스템을 이용하고자 마켓 서버에 물품 등록 (S101)을 요청한다. 물품 등록(S101)은 판매 단말기와 마켓 서버 사이에 이루어지는 단계로, 판매 단말 기가 판매할 중고 물품에 대한 사진, 물품 상태, 판매 조건을 마켓 서버에 등록한다. 판매 단말기는 판매 조건에 더해, 기부 조건, 할인 조건, 경품 조건을 설정할 수 있다. 판매 조건은 물품이 어떤 렌탈 조건 으로 고객에게 렌탈될 조건이고, 기부 조건은 물품이 렌탈될 때 얼마만큼의 기부 비용이 지급될 조건이고, 할인 조건은 물품 가격에서 얼마만큼의 할인 비용이 제외될 조건이고, 경품 조건은 중고 물품에 더해 어떤 경품이 제 공될 조건이다. 고객 단말기는 중고 물품을 렌탈하고자 마켓 서버에 접속하고, 고객이 원하는 중고 물품을 조회한다. 물품 조회(S102)는 고객 단말기와 마켓 서버 사이에 이루어지는 단계로, 고객 단말기가 렌탈할 중 고 물품에 대한 사진, 물품 상태, 판매 조건, 기부 조건, 할인 조건, 경품 조건을 열람하고, 고객이 원하는 중 고 물품을 선택할 수 있도록 편의를 제공한다. 마켓 서버는 고객 단말기가 중고 물품을 선택하면, 보증 서버에 대금 보증(S103)을 요청한다. 대금 보증(S103)은 마켓 서버와 보증 서버 사이에 이루어지는 단계로, 판매 단말기가 마켓 서버에 중고 물품을 등록할 때, 고객 단말기가 마켓 서버에 접속하여 중고 물품을 선택할 때, 판매 단말기(1 0)가 고객 단말기에 중고 물품을 배송할 때 중 어느 하나의 시점에 마켓 서버의 대금 보증 요청에 대해 대금 보증을 수행한다. 보증 서버는 판매 단말기, 마켓 서버, 고객 단말기 사이에 중고 물품 렌탈에 대한 안전 거래를 보증한다. 판매 단말기는 마켓 서버로부터 중고 물품 렌탈을 통보받고, 고객 단말기에 물품을 배송한다. 물품 배송/수령(S104)은 판매 단말기와 고객 단말기 사이에 이루어지는 단계로, 판매 단말기가 마켓 서 버로부터 중고 물품 렌탈을 통보받으면, 고객 단말기로 중고 물품을 배송하고, 고객 단말기는 판매 단말기로부터 중고 물품을 수령한다. 고객 단말기는 중고 물품을 렌탈하고, 마켓 서버에 렌탈 비용을 매달 지급한다. 대금 매달 지급(S105) 은 마켓 서버와 고객 단말기 사이에 이루어지는 단계로, 고객 단말기가 중고 물품을 렌탈하고, 마 켓 서버에 렌탈 비용을 매달 지급하면, 마켓 서버가 고객 단말기로부터 수령한 렌탈 비용을 판매 단말기에 제공한다. 판매 단말기는 중고 물품이 판매되고, 마켓 서버로부터 판매 대금을 매달 수령한다. 대금 매달 수령 (S106)은 판매 단말기와 마켓 서버 사이에 이루어지는 단계로, 마켓 서버가 고객 단말기로부터 렌탈 비용을 지급받고, 판매 단말기에 렌탈 비용에 상응하는 판매 대금을 지급한다. 도 3은 도 1 렌탈 마켓 시스템에서의 고객 단말기의 물품 조회 사용자 인터페이스를 보인 예시도로서, 도 3을 참조하면, 고객 단말기의 물품 조회 사용자 인터페이스는 물품 리스트, 물품 정보를 포함한다. 고객 단말기는 마켓 서버에서 운영하는 렌탈 마켓 시스템을 이용할 때 물품 리스트, 물품 정보를 포함 하는 물품 조회 사용자 인터페이스를 제공하고, 물품 조회 사용자 인터페이스에서 물품이 선택되면 가입 개월, 물품 가격, 월 납입 비용을 포함하는 렌탈 조건 사용자 인터페이스를 제공한다. 물품 조회 사용자 인터페이스에 는 물품 리스트, 물품 정보가 포함되고, 물품 리스트에는 물품 사진이 리스트 업되고, 물품 정보는 가격, 상태 를 표시한다. 고객 단말기는 임베디드 장치로 구현될 수 있고, 임베디드 장치는 스마트폰을 포함하며, 기본 구성 요소로 프로세서, 메모리, 디스플레이를 포함하고, 상용 OS를 구비하고, OS에서 동작하는 애플리케이션 형태로 렌탈 마 켓 시스템이 구현될 수 있다. 예를 들어, 스마트폰의 경우 스마트폰의 프로세서는 물품 조회 사용자 인터페이스 를 실행하고, 스마트폰의 디스플레이는 물품 조회 사용자 인터페이스를 표시할 수 있다. 애플리케이션 측면에서 소프트웨어 구조는, 렌탈 마켓 시스템을 포함할 수 있다. 이러한 애플리케이션은 임베디드 장치에서 요구되는 다양한 동작 환경에 따라 프로그래밍 언어를 이용한 통합 개발 환경에 의해 만들어진다. 고객 단말기를 포함한 판매 단말기, 마켓 서버, 보증 서버에서의 프로그래밍은 사용자와 인터 페이스되는 컴퓨팅 환경에 따라 웹, 모바일 앱, 윈도우 앱으로 구분되고, 앱 종류에 맞게 웹 프로그래밍, 모바 일 프로그래밍, 윈도우 프로그래밍으로 나누어진다. 웹 프로그래밍 태그 정의로 이루어진 html과 문서 형식 정의 css가 결합되어 웹 프레임워크를 구성한다. 웹 프레임워크에서 클 라이언트단의 프런트 엔드와 서버 측 프로그래밍 언어가 사용되는 백 엔드가 서로 데이터를 주고받으면서 거대 한 웹 환경을 만든다. 웹 환경은 서버가 동작하는 주요 무대이며, 서버는 모바일 앱, 콘솔 앱 및 윈도우 앱과웹 환경에서 통신하며 사용자에게 컴퓨팅 서비스를 제공한다. 모바일 앱 프로그래밍 모바일 앱 프로그래밍은 스마트폰에서 운영하는 OS에서 요구되는 모바일 앱을 작성하는데 필요한 프로그래밍 언 어를 사용한다. 프로그래밍 언어는 모바일 앱의 UI, 제어 로직, 통신 모듈을 이용하여 다양한 작업을 하는 모바 일 앱을 작성할 수 있다. 모바일 앱에는 문서 작업, 파일 작업, 금융 작업, 메일 작업, 메신저 작업, 게임 작업 등 다양하다. 서버는 임베디드 장치로 구현될 수 있고, 임베디드 장치는 컴퓨터를 포함하며, 기본 구성 요소로 프로세서, 메 모리, 디스플레이를 포함하고, 상용 OS를 구비하고, OS에서 동작하는 애플리케이션 형태로 서버가 구현될 수 있 다. 이러한 애플리케이션은 임베디드 장치에서 요구되는 다양한 동작 환경에 따라 프로그래밍 언어를 이용한 통 합 개발 환경에 의해 만들어진다. 통합 개발 환경에 사용되는 프로그래밍은 사용자와 인터페이스되는 컴퓨팅 환 경에 따라 웹, 모바일 앱, 윈도우 앱으로 구분되고, 앱 종류에 맞게 웹 프로그래밍, 모바일 프로그래밍, 윈도우 프로그래밍으로 나누어진다. 서버에 사용되는 웹 프로그래밍은 태그 정의로 이루어진 html과 문서 형식 정의 css가 결합되어 웹 프레임워크 를 구성한다. 웹 프레임워크에서 클라이언트단의 프런트 엔드와 서버 측 프로그래밍 언어가 사용되는 백 엔드가 서로 데이터를 주고받으면서 거대한 웹 환경을 만든다. 웹 환경은 서버가 동작하는 주요 무대이며, 서버는 모바 일 앱, 콘솔 앱 및 윈도우 앱과 웹 환경에서 통신하며 사용자에게 컴퓨팅 서비스를 제공한다. 도 4는 도 1 렌탈 마켓 시스템에서의 고객 단말기의 렌탈 조건 사용자 인터페이스를 보인 예시도로서, 도 4를 참조하면, 고객 단말기의 렌탈 조건 사용자 인터페이스는 가입 개월, 가격, 월 납입 비용을 포함한다. 고객 단말기는 물품 조회 사용자 인터페이스에서 물품이 선택되면 가입 개월, 물품 가격, 월 납입 비용을 포함하는 렌탈 조건 사용자 인터페이스를 제공한다. 렌탈 조건 사용자 인터페이스에는 물품 렌탈이 계속되는 가 입 개월인 렌탈 가입 개월; 물품에 책정된 가격인 물품 가격; 렌탈이 계속될 때 월에 고객이 판매자에게 지급해 야 할 비용인 월 납입 비용이 표시된다. 고객 단말기는 임베디드 장치로 구현될 수 있고, 임베디드 장치는 스마트폰을 포함하며, 기본 구성 요소로 프로세서, 메모리, 디스플레이를 포함하고, 상용 OS를 구비하고, OS에서 동작하는 애플리케이션 형태로 렌탈 마 켓 시스템이 구현될 수 있다. 예를 들어, 스마트폰의 경우 스마트폰의 프로세서는 렌탈 조건 사용자 인터페이스 를 실행하고, 스마트폰의 디스플레이는 렌탈 조건 사용자 인터페이스를 표시할 수 있다. 애플리케이션 측면에서 소프트웨어 구조는, 렌탈 마켓 시스템을 포함할 수 있다. 이러한 애플리케이션은 임베디드 장치에서 요구되는 다양한 동작 환경에 따라 프로그래밍 언어를 이용한 통합 개발 환경에 의해 만들어진다. 도 5는 도 1 렌탈 마켓 시스템에서의 고객 단말기의 렌탈 상태 사용자 인터페이스를 보인 예시도로서, 도 5를 참조하면, 렌탈 상태 사용자 인터페이스는 물품 사진, 월 납입 비용, 가입 개월, 대금 납부 메뉴를 포함한다. 고객 단말기는 중고 물품을 렌탈하고, 매달 중고 물품에 대한 렌탈 상태를 열람하고, 고객이 렌탈 비용을 납부할 수 있도록 편의를 제공한다. 고객 단말기는 렌탈 상태 사용자 인터페이스에서 물품 사진, 월 납입 비용, 가입 개월, 대금 납부 메뉴를 열람하고, 대금 납부 메뉴가 선택되면 결제 페이지로 이동하여 고객이 대금 납부를 진행할 수 있도록 편의를 제공한다. 고객 단말기는 임베디드 장치로 구현될 수 있고, 임베디드 장치는 스마트폰을 포함하며, 기본 구성 요소로 프로세서, 메모리, 디스플레이를 포함하고, 상용 OS를 구비하고, OS에서 동작하는 애플리케이션 형태로 렌탈 마 켓 시스템이 구현될 수 있다. 예를 들어, 스마트폰의 경우 스마트폰의 프로세서는 렌탈 상태 사용자 인터페이스 를 실행하고, 스마트폰의 디스플레이는 렌탈 상태 사용자 인터페이스를 표시할 수 있다. 애플리케이션 측면에서 소프트웨어 구조는, 렌탈 마켓 시스템을 포함할 수 있다. 이러한 애플리케이션은 임베디드 장치에서 요구되는 다양한 동작 환경에 따라 프로그래밍 언어를 이용한 통합 개발 환경에 의해 만들어진다. 도 6은 본 발명 렌탈 마켓 시스템을 설명하기 위한 하드웨어 자원과 운영체제, 코인인 제어부의 동작, 제어부 동작을 실행할 권한을 부여하는 시스템 인증 구성을 설명하는 예시도로서, 도 6을 참조하면, 본 발명은 프로세서, 메모리, 입출력장치, 운영체제, 제어부를 포함한다. 프로세서는 CPU(Central Processing Units), GPU(Graphic Processing Unit), FPGA(Field Programmable Gate Array), NPU(Neural Processing Unit)로서, 메모리에 탑재된 운영체제, 제어부의 실행 코드를 수행한다. 메모리는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device)를 포함할 수 있다. 입출력장치는 입력 장치로, 오디오 센서 및/또는 이미지 센서를 포함한 카메라, 키보드, 마이크로폰, 마우스 등의 장치를, 그리고 출력 장치로, 디스플레이, 스피커, 햅틱 피드백 디바이스(haptic feedback device) 등과 같은 장치를 포함할 수 있다. 운영체제는 윈도우, 리눅스, IOS, 가상 머신, 웹브라우저, 인터프리터를 포함할 수 있다. 제어부는 운영체제의 지원하에 입출력장치의 센서, 키, 터치, 마우스 입력에 의한 상태를 결정하고, 결정된 상태에 따른 동작을 수행한다. 제어부는 병렬 수행 루틴으로 타이머, 쓰레드에 의한 작업 스케줄링을 수행한다. 제어부는 입출력장치의 센서값을 이용하여 상태를 결정하고, 결정된 상태에 따른 알고리즘을 수행한다. 도 6을 참조하면, 시스템 인증 구성은 제어부를 포함하는 단말기, 인증 서버를 포함한다. 단말기는 판매 단말기, 고객 단말기로 구현될 수 있다. 단말기는 데이터 채널을 이중화하고, 단말기의 키값, 생체 정보를 입력받아 인증 서버에 제1데이터 채 널을 통해 사용자 인증을 요청하고, 단말기는 생성된 킷값을 디스플레이에 표시하고, 인증 서버로 전송한 다. 단말기는 단말기의 디스플레이에 표시된 킷값을 입력하고, 사용자 정보와 함께 제2데이터 채널을 통해 인 증 서버로 전송한다. 단말기는 킷값과 사용자 정보를 이용하여 단말기에 탑재된 시스템의 인증을 인증 서버에 요청한다. 단말기의 킷값은 컴퓨터 고유의 정보인 CPU 제조번호, 이더넷 칩의 맥주소로부터 생성 될 수 있다. 단말기는 카메라를 이용한 얼굴 인식, 마이크를 이용한 음성 인식, 디스플레이를 이용한 필기 인식을 통해 사용자 정보를 획득하고, 인증에 활용할 수 있다. 인증 서버는 단말기로부터 킷값을 수신하고, 단말기로부터 이중화된 데이터 채널을 통해 킷값과 사용 자 정보를 수신하여 단말기의 킷값과 사용자 정보를 비교하고, 사용자 정보를 대응시켜 단말기의 시스템 이용에 대한 인증을 처리한다. 인증 서버는 인증 결과를 단말기로 전송하여 시스템에 대한 사용자의 사용 을 허가한다. 단말기의 이중화된 데이터 채널로 인해 킷값 손실이 최소화되는 효과를 가질 수 있다. 인증 서버는 사용자 정보의 히스토리 분석을 수행하고, 시간 흐름에 따라 사용자 정보의 일관성, 변화를 비 교 판단한다. 히스토리 분석에서 사용자 정보가 일관성을 나타내면 사용자의 사용을 허가하고, 변화를 나타내면 사용자의 사용을 허가하지 않는다. 사용자 정보가 일관성을 나타낼 때 사용자의 시스템 사용을 허가함으로써 사 용자 정보가 변조된 사용자가 시스템에 접근하지 못하도록 보안을 강화한다. 인증 서버는 아래의 수학식 1 및 수학식 2에 따라 사용자 정보의 일관성 지표 및 변화율을 계산할 수 있다. 인증 서버는 히스토리 분석의 대상 기간, 히스토리 분석의 대상 기간 동안 발생한 사용자 인증과 관련된 특 정 시점의 정보, PCA는 사용자 인증과 관련된 정보를 기초로 인증했을 때의 결과의 정답률의 평균, SGP는 인증 서버에 저장된 식별 가능한 사용자들의 수를 기초로 일관성 지표를 계산할 수 있다. 인증 서버는 일관성 지표, 사용자 인증과 관련된 정보를 기초로 인증했을 때의 결과의 정답률의 평균을 기초 로 GustD를 계산할 수 있다. [수학식 1] [수학식 2]"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 1에서, LF는 일관성 지표이고, T는 히스토리 분석의 대상 기간, TP는 히스토리 분석의 대상 기간 동안 발생한 사용자 인증과 관련된 특정 시점 각각의 정보의 사용자 관련도, PCA는 사용자 인증과 관련된 정보를 기 초로 인증했을 때의 결과의 정답률의 평균, SGP는 인증 서버에 저장된 식별 가능한 사용자들의 수를 의미할 수 있다. 수학식 2에서, GustD는 변화율을 의미하며, LF는 일관성 지표이고, PCA는 PCA는 사용자 인증과 관련된 정보를 기초로 인증했을 때의 결과의 정답률의 평균을 의미할 수 있다. 시스템의 사용을 인증하는 수단인 단말기는 시스템과 직접 연결하지 않고, 인증 서버를 통한 우회 경로를 형성함으로써 인터넷망을 이루는 네트워크가 내부망과 외부망으로 구성되어 아이피 주소 설정 과정이 번거로울 때 단말기를 이용한 인증 과정이 원활히 수행되는 장점이 있다. 이때, 단말기에는 시스템이 탑재되고, 단 말기는 인증 단말 수단이 되고, 인증 서버는 인증 서버 수단이 된다. 도 7은 본 발명 렌탈 마켓 시스템에 신경망 적용을 보인 예시도로서, 도 7을 참고하여 설명한다. 신경망 학습은 온도, 고도, 지문 등 각종 센서, 이미지, 적외선 등 카메라, 라이더와 같은 입력 장치로부터 수 집된 시계열 데이터로부터 특징량 선택, 알고리즘 선택을 통해 모델을 선택하고, 학습, 성능 검증 과정에 의한 반복 시행 착오를 거쳐 모델 선택을 반복한다. 성능 검증이 마치면 인공지능 모델이 선택된다. 제어부는 센서값 판단에 신경망을 이용한 딥러닝 알고리즘을 수행하고, 신경망 학습에 훈련 데이터를 이용하 고, 시험 데이터로 신경망 성능을 검증한다. 신경망이 탑재된 제어부를 포함하는 마켓 서버는 판매 단말기의 중고 물품 등록, 고객 단말기의 물품 조회에 대한 사용 경험 정보를 수집하고, 수집된 사용 경험 정보에 기반한 통계 분석, 신경망 학습, 패턴 분석을 수행하고, 분석 결과에 따른 중고 물품 추천을 고객 단말기에 제공한다. 고객 단말기는 마켓 서 버의 중고 물품 추천을 이용하고, 마켓 서버는 렌탈 마켓 시스템의 사용자 경험을 높일 수 있다. 통계 분석, 신경망 학습, 패턴 분석에는 선형 판별 분석(LDA), 로지스틱 회귀(LR), 지원 벡터 머신(SVM), 결정 트리(DT), k-최근접 이웃(KNN), 랜덤 포레스트(RF) 등 6가지 머신 러닝 알고리즘이 적용될 수 있다. 선형 판별 분석(LDA)은 새로운 입력 세트가 각 클래스에 속할 확률을 추정하여 예측한다. 가장 높은 확률을 얻는 클래스가 출력 클래스이며 예측이 수행된다. 로지스틱 회귀(LR)은 두 가지 가능한 분류 문제에 대한 확률이다. 지원 벡터 머신(SVM)은 예제를 두 개의 클래스로 가장 잘 분할하는 초평면 결정 경계를 찾는다. 분할은 일부 포 인트가 잘못 분류될 수 있는 여백을 사용하여 부드럽게 만들어진다. 결정 트리(DT)에는 훈련 데이터 세트의 예 를 분류하기 위해 트리를 성장시키는 작업이 포함된다. 트리는 훈련 데이터 세트를 나누는 것으로 생각할 수 있 다. 여기서, 예제는 트리의 결정 지점을 따라 진행되어 트리의 잎에 도달하고 클래스 레이블이 할당된다. k-최 근접 이웃(KNN)은 사용 가능한 모든 데이터를 저장하고 유사성을 기반으로 새로운 데이터 포인트를 분류한다. 즉, 새로운 데이터가 나타날 때 k-최근접 이웃(KNN)을 사용하여 웰 스위트 범주로 쉽게 분류할 수 있다. 마지막 으로 랜덤 포레스트(RF)는 최종 출력을 위한 많은 의사결정나무로 구성되며, 그 과정에 참여하는 의사결정나무 의 수가 많기 때문에 매우 정확하고 강력한 방법으로 간주된다. 마켓 서버는 머신 러닝 알고리즘을 이용하여 판매 단말기의 물품 등록, 고객 단말기의 물품 조회, 중고 물품 선택, 판매 조건, 기부 조건, 할인 조건, 경품 조건에 대한 사용자 경험을 분석하고, 대금 지급과 관 련된 상관 관계도 분석할 수 있다. 도 8은 일 실시예에 따른 전자 장치의 구성을 나타내는 도면이다. 도 8은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 전자 장치는 클라이언트, 단말기 또는 피 어로 지칭될 수도 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhancedmobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(802, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(802, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 서버는 전자 장치가 접속되며, 접속된 전자 장치로 서비스를 제공할 수 있다. 또한, 서버 는 회원 가입 절차를 진행하여 그에 따라 회원으로 가입된 사용자의 각종 정보를 저장하여 관리하고, 서비스에 관련된 각종 구매 및 결제 기능을 제공할 수도 있다. 또한, 서버는, 사용자 간에 서비스를 공유할 수 있도 록, 복수의 전자 장치 각각에서 실행되는 서비스 애플리케이션의 실행 데이터를 실시간으로 공유할 수도 있다. 이러한 서버는 하드웨어적으로는 통상적인 웹 서버(Web Server) 또는 왑 서버(WAP Server)와 동일한구성을 가질 수 있다. 그러나, 소프트웨어적으로는, C, C++, Java, Visual Basic, Visual C 등 여하한 언어를 통하여 구현되어 여러 가지 기능을 하는 프로그램 모듈(Module)을 포함할 수 있다. 또한, 서버는 일반적으 로 인터넷과 같은 개방형 컴퓨터 네트워크를 통하여 불특정 다수 클라이언트 및/또는 다른 서버와 연결되어 있 고, 클라이언트 또는 다른 서버의 작업수행 요청을 접수하고 그에 대한 작업 결과를 도출하여 제공하는 컴퓨터 시스템 및 그를 위하여 설치되어 있는 컴퓨터 소프트웨어(서버 프로그램)를 뜻하는 것이다. 또한, 서버는, 전술한 서버 프로그램 이외에도, 서버 상에서 동작하는 일련의 응용 프로그램(Application Program)과 경 우에 따라서는 내부 또는 외부에 구축되어 있는 각종 데이터베이스(DB: Database, 이하 \"DB\"라 칭함)를 포함하 는 넓은 개념으로 이해되어야 할 것이다. 따라서, 서버는, 회원 가입 정보와, 게임에 대한 각종 정보 및 데이터를 분류하여 DB에 저장시키고 관리하는데, 이러한 DB는 서버의 내부 또는 외부에 구현될 수 있다. 또한, 서버는, 일반적인 서버용 하드웨어에 도스(DOS), 윈도우(windows), 리눅스(Linux), 유닉스(UNIX), 매킨토시(Macintosh) 등의 운영체제에 따라 다양하게 제공되고 있는 서버 프로그램을 이용하여 구현될 수 있으 며, 대표적인 것으로는 윈도우 환경에서 사용되는 웹사이트(Website), IIS(Internet Information Server)와 유 닉스환경에서 사용되는 CERN, NCSA, APPACH등이 이용될 수 있다. 또한, 서버는, 서비스의 사용자 인증이나 서비스와 관련된 구매 결제를 위한 인증 시스템 및 결제 시스템과 연동할 수도 있다. 제1 네트워크 및 제2 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능 한 연결 구조 또는 서버와 전자 장치들(801, 104)을 연결하는 망(Network)을 의미한다. 제1 네트워크 및 제2 네트워크는 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 3G, 4G, LTE, 5G, Wi-Fi 등이 포함되나 이 에 한정되지는 않는다. 제1 네트워크 및 제2 네트워크는 LAN, WAN 등의 폐쇄형 제1 네트워크 및 제2 네트워크일 수도 있으나, 인터넷(Internet)과 같은 개방형인 것이 바람직하다. 인터넷은 TCP/IP 프로 토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(HyperText Transfer Protocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(Network Information Service)를 제공하는 전 세계적 인 개방형 컴퓨터 제1 네트워크 및 제2 네트워크 구조를 의미한다. 데이터베이스는 데이터베이스 관리 프로그램(DBMS)을 이용하여 컴퓨터 시스템의 저장공간(하드디스크 또는 메모 리)에 구현된 일반적인 데이터구조를 가질 수 가질 수 있다. 데이터베이스는 데이터의 검색(추출), 삭제, 편집, 추가 등을 자유롭게 행할 수 있는 데이터 저장형태를 가질 수 있다. 데이터베이스는 오라클(Oracle), 인포믹스 (Infomix), 사이베이스(Sybase), DB2와 같은 관계형 데이타베이스 관리 시스템(RDBMS)이나, 겜스톤(Gemston), 오리온(Orion), O2 등과 같은 객체 지향 데이타베이스 관리 시스템(OODBMS) 및 엑셀론(Excelon), 타미노 (Tamino), 세카이주(Sekaiju) 등의 XML 전용 데이터베이스(XML Native Database)를 이용하여 본 개시의 일 실 시예의 목적에 맞게 구현될 수 있고, 자신의 기능을 달성하기 위하여 적당한 필드(Field) 또는 엘리먼트들을 가 질 수 있다. 도 2는 일 실시예에 따른 프로그램의 구성을 나타내는 도면이다. 도 2은 다양한 실시예에 따른 프로그램을 예시하는 블록도이다. 일실시예에 따르면, 프로그램은 전자 장치의 하나 이상의 리소스들을 제어하기 위한 운영 체제, 미들웨어, 또는 상기 운영 체제 에서 실행 가능한 어플리케이션을 포함할 수 있다. 운영 체제는, 예를 들면, AndroidTM, iOSTM, WindowsTM, SymbianTM, TizenTM, 또는 BadaTM를 포함할 수 있다. 프로그램 중 적어도 일부 프로그 램은, 예를 들면, 제조 시에 전자 장치에 프리로드되거나, 또는 사용자에 의해 사용 시 외부 전자 장치(예: 전자 장치(802 또는 104), 또는 서버)로부터 다운로드되거나 갱신 될 수 있다. 프로그램의 전부 또는 일부는 뉴럴 네트워크를 포함할 수 있다. 운영 체제는 전자 장치의 하나 이상의 시스템 리소스들(예: 프로세스, 메모리, 또는 전원)의 관리(예: 할당 또는 회수)를 제어할 수 있다. 운영 체제는, 추가적으로 또는 대체적으로, 전자 장치 의 다른 하드웨어 디바이스, 예를 들면, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 구동하기 위한 하나 이상의 드라이 버 프로그램들을 포함할 수 있다. 미들웨어는 전자 장치의 하나 이상의 리소스들로부터 제공되는 기능 또는 정보가 어플리케이션 에 의해 사용될 수 있도록 다양한 기능들을 어플리케이션으로 제공할 수 있다. 미들웨어는, 예를 들 면, 어플리케이션 매니저, 윈도우 매니저, 멀티미디어 매니저, 리소스 매니저, 파워 매니 저, 데이터베이스 매니저, 패키지 매니저, 커넥티비티 매니저, 노티피케이션 매니저, 로케이션 매니저, 그래픽 매니저, 시큐리티 매니저, 통화 매니저, 또는 음성 인식 매니저 를 포함할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션의 생명 주기를 관리할 수 있다. 윈도우 매니저 는, 예를 들면, 화면에서 사용되는 하나 이상의 GUI 자원들을 관리할 수 있다. 멀티미디어 매니저는, 예를 들면, 미디어 파일들의 재생에 필요한 하나 이상의 포맷들을 파악하고, 그 중 선택된 해당하는 포맷에 맞 는 코덱을 이용하여 상기 미디어 파일들 중 해당하는 미디어 파일의 인코딩 또는 디코딩을 수행할 수 있다. 리 소스 매니저는, 예를 들면, 어플리케이션의 소스 코드 또는 메모리의 메모리의 공간을 관리할 수 있다. 파워 매니저는, 예를 들면, 배터리의 용량, 온도 또는 전원을 관리하고, 이 중 해당 정보를 이용하여 전자 장치의 동작에 필요한 관련 정보를 결정 또는 제공할 수 있다. 일실시예에 따르면, 파워 매 니저는 전자 장치의 바이오스(BIOS: basic input/output system)(미도시)와 연동할 수 있다. 데이터베이스 매니저는, 예를 들면, 어플리케이션에 의해 사용될 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는, 예를 들면, 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 갱신을 관리할 수 있다. 커넥티비티 매니저는, 예를 들면, 전자 장치와 외부 전자 장치 간의 무선 연 결 또는 직접 연결을 관리할 수 있다. 노티피케이션 매니저는, 예를 들면, 지정된 이벤트(예: 착신 통화, 메시지, 또는 알람)의 발생을 사용자에게 알리기 위한 기능을 제공할 수 있다. 로케이션 매니저는, 예를 들면, 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는, 예를 들면, 사용자에게 제공될 하 나 이상의 그래픽 효과들 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 시큐리티 매니저는, 예를 들면, 시스템 보안 또는 사용자 인증을 제공할 수 있다. 통화(telephony) 매니저 는, 예를 들면, 전자 장치에 의해 제공되는 음성 통화 기능 또는 영상 통화 기능을 관리할 수 있다. 음성 인식 매니저는, 예를 들면, 사용자의 음성 데이터를 서버로 전송하고, 그 음성 데이터에 적어도 일부 기반하여 전자 장치에서 수행될 기능에 대응하는 명령어(command), 또는 그 음성 데이터에 적어도 일 부 기반하여 변환된 문자 데이터를 서버로부터 수신할 수 있다. 일 실시예에 따르면, 미들웨어는 동 적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. 일 실시예에 따르면, 미들웨 어의 적어도 일부는 운영 체제의 일부로 포함되거나, 또는 운영 체제와는 다른 별도의 소프트웨 어로 구현될 수 있다. 어플리케이션은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우 저, 카메라, 알람, 컨택트, 음성 인식, 이메일, 달력, 미디어 플레이어 , 앨범, 와치, 헬스(예: 운동량 또는 혈당과 같은 생체 정보를 측정), 또는 환경 정보 (예: 기압, 습도, 또는 온도 정보 측정) 어플리케이션을 포함할 수 있다. 일실시예에 따르면, 어플리케이 션은 전자 장치와 외부 전자 장치 사이의 정보 교환을 지원할 수 있는 정보 교환 어플리케이션(미도 시)을 더 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치로 지정된 정보 (예: 통화, 메 시지, 또는 알람)를 전달하도록 설정된 노티피케이션 릴레이 어플리케이션, 또는 외부 전자 장치를 관리하도록 설정된 장치 관리 어플리케이션을 포함할 수 있다. 노티피케이션 릴레이 어플리케이션은, 예를 들면, 전자 장치 의 다른 어플리케이션(예: 이메일 어플리케이션)에서 발생된 지정된 이벤트(예: 메일 수신)에 대응하 는 알림 정보를 외부 전자 장치로 전달할 수 있다. 추가적으로 또는 대체적으로, 노티피케이션 릴레이 어플리케 이션은 외부 전자 장치로부터 알림 정보를 수신하여 전자 장치의 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치 또는 그 일부 구성 요소(예: 외부 전자장치의 디스플레이 모듈 또는 카메라 모듈)의 전원(예: 턴-온 또는 턴-오프) 또는 기능(예: 밝기, 해 상도, 또는 포커스)을 제어할 수 있다. 장치 관리 어플리케이션은, 추가적으로 또는 대체적으로, 외부 전자 장 치에서 동작하는 어플리케이션의 설치, 삭제, 또는 갱신을 지원할 수 있다. 본 명세서에 걸쳐, 뉴럴 네트워크(neural network), 신경망 네트워크, 네트워크 함수는, 동일한 의미로 사용될 수 있다. 뉴럴 네트워크는, 일반적으로 \"노드\"라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 \"노드\"들은, \"뉴런(neuron)\"들로 지칭될 수도 있다. 뉴럴 네트워크는, 적어도 둘 이상의 노드 들을 포함하여 구성된다. 뉴럴 네트워크들을 구성하는 노드(또는 뉴런)들은 하나 이상의 \"링크\"에 의해 상호 연 결될 수 있다.뉴럴 네트워크 내에서, 링크를 통해 연결된 둘 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 전술 한 바와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상 의 출력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드는 입력 노드에 입력된 데이터에 기초 하여 그 값이 결정될 수 있다. 여기서, 입력 노드와 출력 노드를 상호 연결하는 노드는 가중치를 가질 수 있다. 가중치는 가변적일 수 있으며, 뉴럴 네트워크가 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘에 의해 가 변될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연결된 경우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하는 링크에 설 정된 가중치에 기초하여 출력 노드 값을 결정할 수 있다. 전술한 바와 같이, 뉴럴 네트워크는, 둘 이상의 노드들이 하나 이상의 링크를 통해 상호연결 되어 뉴럴 네트워 크 내에서 입력 노드 및 출력 노드 관계를 형성한다. 뉴럴 네트워크 내에서 노드들과 링크들의 개수 및 노드들 과 링크들 사이의 연관관계, 링크들 각각에 부여된 가중치의 값에 따라, 신경망 네트워크의 특성이 결정될 수 있다. 예를 들어, 동일한 개수의 노드 및 링크들이 존재하고, 링크들 사이의 가중치 값이 상이한 두 신경망 네 트워크가 존재하는 경우, 두 개의 신경망 네트워크들은 서로 상이한 것으로 인식될 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터 를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도"}
{"patent_id": "10-2022-0068345", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "록 구성될 수 있으며, 그 역도 마찬가지이다.이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2022-0068345", "section": "도면", "subsection": "도면설명", "item": 1, "content": "실시예들에 대한 이해를 돕기 위해 상세한 설명의 일부로 포함된, 첨부 도면은 다양한 실시예들을 제공하고, 상 세한 설명과 함께 다양한 실시예들의 기술적 특징을 설명한다. 도 1은 본 발명 렌탈 마켓 시스템의 구성을 보인 예시도이다. 도 2는 도 1 렌탈 마켓 시스템의 메시지 흐름도이다. 도 3은 도 1 렌탈 마켓 시스템에서의 고객 단말기의 물품 조회 사용자 인터페이스를 보인 예시도이다. 도 4는 도 1 렌탈 마켓 시스템에서의 고객 단말기의 렌탈 조건 사용자 인터페이스를 보인 예시도이다. 도 5는 도 1 렌탈 마켓 시스템에서의 고객 단말기의 렌탈 상태 사용자 인터페이스를 보인 예시도이다. 도 6은 본 발명 렌탈 마켓 시스템을 설명하기 위한 하드웨어 자원과 운영체제, 코인인 제어부의 동작, 제어부 동작을 실행할 권한을 부여하는 시스템 인증 구성을 설명하는 예시도이다. 도 7은 본 발명 렌탈 마켓 시스템에 신경망 적용을 보인 예시도이다."}
