{"patent_id": "10-2022-0141993", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0060919", "출원번호": "10-2022-0141993", "발명의 명칭": "반려동물 안면인식 기술을 이용한 개체식별 시스템", "출원인": "(주)인투씨엔에스", "발명자": "허성호"}}
{"patent_id": "10-2022-0141993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "동물병원 및 공공기관에서 촬영한 반려동물의 안면 영상 이미지와 반려동물의 보호자 정보를 매칭하여 통합 데이터베이스에 저장하는 안면 이미지 저장부;상기 통합 데이터베이스에 저장된 안면 영상 이미지를 딥러닝 기반의 특정부위 분류 알고리즘으로 학습하여 반려동물의 눈, 코, 귀, 입의 위치를 분류하는 안면 특징 분류부;분류된 눈, 코, 귀, 입의 위치 정보를 이용하여 각 부위 상호간의 거리 비율을 계산하고 통합 데이터베이스에기록하는 안면 거리비율 계산부;상기 통합 데이터베이스에 저장된 안면 영상 이미지를 딥러닝 기반의 개체식별 알고리즘으로 학습하는 개체식별학습부;개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 입력 받아 상기 안면 특징 분류부와 안면 거리비율 계산부를 통해 각 부위 상호간의 거리비율을 계산하고, 상기 통합 데이터베이스에서 각 부위 상호 간의 거리비율의 유사도가 높은 안면 영상 이미지를 복수 개 추출하는 개체선별부; 및상기 개체선별부가 추출한 복수 개의 안면 영상 이미지와 개체식별의 대상이 되는 안면 영상 이미지를 개체식별학습부에 적용하여 개체선별부가 추출한 복수 개의 안면 영상 이미지 중 개체식별의 대상이 되는 안면 영상 이미지와 일치하는 개체를 식별하는 개체식별부;를 포함하는 것을 특징으로 하는 반려동물 안면인식 기술을 이용한 개체식별 시스템."}
{"patent_id": "10-2022-0141993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 안면 이미지 저장부는,반려동물의 안면 정면 영상 이미지, 안면 좌측면 영상 이미지 및 안면 우측면 영상 이미지로 구분하여 통합 데이터베이스에 저장하고,상기 안면 특징 분류부는 좌측눈, 우측눈, 코, 좌측귀, 우측귀, 입의 위치를 분류하며,상기 안면 거리비율 계산부는,안면 정면 영상 이미지에서 분류된 좌측눈, 우측눈, 코, 좌측귀, 우측귀, 입의 위치 정보를 이용하여 각 부위상호간의 거리 비율을 계산하는 정면 거리비율 계산모듈;안면 좌측면 영상 이미지에서 분류된 좌측눈, 코, 좌측귀, 입의 위치 정보를 이용하여 각 부위 상호간의 거리비율을 계산하는 좌측면 거리비율 계산모듈; 및안면 우측면 영상 이미지에서 분류된 우측눈, 코, 우측귀, 입의 위치 정보를 이용하여 각 부위 상호간의 거리비율을 계산하는 우측면 거리비율 계산모듈;을 포함하는 것을 특징으로 하는 반려동물 안면인식 기술을 이용한개체식별 시스템."}
{"patent_id": "10-2022-0141993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 개체선별부는 개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 입력 받으면, 좌측면 거리비율 계산모듈이 계산한 거리 비율 또는 우측면 거리비율 계산모듈이 계산한 거리 비율을 이용하여 통합 데이터베이스에공개특허 10-2024-0060919-3-서 유사도가 일정 범위 내에 해당하는 반려동물의 안면 영상 이미지를 1차 검색하고, 1차 검색된 반려동물의 안면 영상 이미지 중에서 정면 거리비율 계산모듈이 계산한 거리비율을 이용하여 유사도가 일정 범위 내에 해당하는 반려동물의 안면 영상 이미지를 2차 검색하여 복수 개 추출하는 것을 특징으로 하는 반려동물 안면인식 기술을 이용한 개체식별 시스템."}
{"patent_id": "10-2022-0141993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 안면 거리비율 계산부는,안면 특징 분류부의 분류 결과를 이용하여 좌측눈-코, 우측눈-코, 좌측눈-입, 우측눈-입, 좌측눈-좌측귀, 우측눈-우측귀, 좌측귀-코, 우측귀-코, 좌측귀-입, 우측귀-입, 입-코 각각에 대해서 이 중 어느 하나를 기준으로 나머지 각 값에 대한 비율을 계산하는 것을 특징으로 하는 반려동물 안면인식 기술을 이용한 개체식별 시스템."}
{"patent_id": "10-2022-0141993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,좌측귀-입을 기준으로 좌측면에 위치한 각 부위 상호간의 거리 비율을 계산하고,우측귀-입을 기준으로 우측면에 위치한 각 부위 상호간의 거리 비율을 계산하는 것을 특징으로 하는 반려동물안면인식 기술을 이용한 개체식별 시스템."}
{"patent_id": "10-2022-0141993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 상기 안면 특징 분류부에 적용하여 눈, 코, 귀, 입의위치를 분류한 결과 안면 정면 영상 이미지가 정면 중앙을 기준으로 좌측 또는 우측으로 어느 정도 회전하였는지를 판단하는 정면 영상 회전판단부; 및 정면 영상 회전판단부에서 판단한 회전 정보를 이용하여 안면 특징 분류부에서 분류한 눈, 코, 귀, 입의 위치를보정하는 안면 특징 보정부;를 더 포함하는 것을 특징으로 하는 반려동물 안면인식 기술을 이용한 개체식별 시스템."}
{"patent_id": "10-2022-0141993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 안면 거리비율 계산부는 안면 특징 보정부에서 보정한 눈, 코, 귀, 입의 위치를 이용하여 각 부위 상호간의 거리 비율을 계산하는 것을 특징으로 하는 반려동물 안면인식 기술을 이용한 개체식별 시스템."}
{"patent_id": "10-2022-0141993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,실명인증된 보호자 정보를 동물병원의 EMR 서버에서 조회하여 등록된 반려동물의 리스트를 제공하고, 제공된 반려동물 리스트에서 ID를 발급할 반려동물을 선택받아 해당 반려동물 관련정보 및 보호자 정보를 이용하여 QR 형태의 ID를 생성하는 개체식별 ID 생성부; 및상기 QR 형태의 ID를 스캔하면 동물병원의 EMR 서버와 연동하여 등록된 반려동물 정보, 접종정보 및 보호자 정보를 표시하고, 상기 개체식별부에서 식별한 개체의 안면 영상 이미지를 표시하는 개체식별 ID조회부;를 더 포공개특허 10-2024-0060919-4-함하는 것을 특징으로 하는 반려동물 안면인식 기술을 이용한 개체식별 시스템."}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 동물병원이나 공공기관에서 반려동물의 안면 영상 이미지를 획득하여 통합 데이터베이스로 저장한 후 인공지능 기반으로 안면 영상 이미지의 특징점을 학습 및 분류하고, 분류된 반려동물의 눈, 코, 귀, 입 각 부위 상호간의 거리비율을 기록하여, 추후 개체식별의 대상이 되는 반려동물이 동물병원이나 공공기관 또는 각종 시설 (뒷면에 계속)"}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 반려동물 안면인식 기술을 이용한 개체식별 시스템에 관한 것으로서, 더욱 상세하게는 각종 시설, 기 관, 병원 등에서 반려동물의 출입시, 접종증명시 현장에서 실시간 촬영한 안면 영상 이미지와 통합 데이터베이 스에 사전에 저장된 안면 영상 이미지를 비교하여 반려동물 개체를 식별함으로써 반려동물의 접종여부 및 기타 정보를 확인할 수 있도록 하는 반려동물 안면인식 기술을 이용한 개체식별 시스템에 관한 것이다."}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "반려동물 등록과 관련하여 비문인식, 홍채인식, 안면인식 등 바이오인식을 활용한 반려동물에 대한 다양한 형태 의 개체식별기술이 활발히 연구중에 있다. 사람에 대한 신원확인 수단으로 활용되는 바이오인식기술은 지문인식 센서·적외선카메라 등 정교한 바이오정보 획득장비, 오래동안의 성능시험 과정을 거친 정확한 인식알고리즘 개 선 등으로 일상생활속에서 널리 활용되고 있는데 반하여 반려동물에 대한 개체식별기술로 활용되는 바이오인식 기술의 경우에 있어서 특히 반려견의 경우 사람에 비하여 비협조적인 특성으로 인하여 반려동물에 대한 바이오 정보 획득에 어려움이 수반된다. 또한 부정확한 바이오 정보 획득장비, 충분한 선행연구, 시험용 빅데이터 구축이 미흡하고 이에 따라 명확한 성 능평가체계가 부재하여 실제 적용에 애로사항이 있으며, 온라인 동물등록은 현 동물등록 업무 절차상 관할 지차 제가 등록처리를 전담하고 있어 원활한 등록처리가 어려운 실정이다. 현재 반려동물에 주로 적용하고 있는 바이오인식기술의 장점과 단점을 살펴보면 다음과 같다. 비문인식은 코의 지문을 이용하는 방식으로 바이오인식 기반의 반려동물 개체 인식방법중에서 가장 널리 사용되 고 있는 방식이다. 비문인식의 단점으로는 반려동물을 정지상태로 유지시키는 것이 어려운 점 그리고 코에 질병 등이 발병하였을 때, 코점액으로 인해 온전한 이미지를 취득하기 어려운 문제가 있으며, 접촉식 비문인식은 정 확한 반면 코 접촉 촬영이 어려운 문제가 있다. 안면인식은 근골격계가 완성된 12개월 이후의 성견으로부터 추출한 랜드마크는 불변한다는 장점이 있다. 현재까 지 견종 판별에서는 높은 성공률을 보이고 있지만, 견종내 개체인식은 해결해야 할 과제로 남아있다. 또한 반려 동물의 정면촬영이 어렵고, 반려동물이 밀집한 지역에서는 흥분상태로 제어가 불가하다. 반려동물의 개체식별을 위한 종래의 여러 선행특허들이 있다. 등록특허 10-2325250 '반려동물 식별 시스템 및 그 방법'은 안면 인식, 비문 인식, 음성 인식, 모션 인식을 중 적어도 하나 이상을 수행하여 동물 개체를 식별하며, 특히 안면 인식에 있어서 캡쳐된 안면 이미지로부터 추출 된 8개의 특징점에 대한 정보를 포함한 복수의 학습 데이터를 바탕으로 정규화를 수행하고 학습 데이터 및 정규 화된 학습 데이터에 가중치를 적용하여 생성한 데이터 세트를 이용하여 견종 또는 묘종과 같은 품종 및 성별을 식별하도록 학습을 수행함으로써 식별 정확도를 상승시키는 기술에 관한 것이다. 등록특허 10-2325250은 반려동물의 코에 질병이 발생하거나 코점액으로 인해 비문을 정확하게 인식하기 어렵고, 반려동물의 안면 데이터는 정면 데이터만 가지고 판단하기 때문에 정확성이 떨어지는 문제가 있다. 공개특허 10-2022-0087310 '영상 기반 반려견 개체 식별 방법 및 장치'는 개체 식별장치가 반려견의 이미지를 딥러닝 모델에 입력하여 반려견의 눈과 코를 검출하는 단계, 개체 식별장치가 눈과 코 각각의 위치 및 크기에 따라 이미지의 방향이 정면인지 확인하는 단계, 개체 식별장치가 이미지에 포함된 노이즈에 따라 이미지에서 비 문 영역의 추출을 결정하는 단계, 개체 식별장치가 비문 영역의 크기를 조절하고 히스토그램을 정규화하여 전처 리를 수행하는 단계, 개체 식별장치가 특징점 추출 알고리즘을 이용하여 전처리된 비문 영역에서 특징정보를 추 출하는 단계 및 개체 식별장치가 기 등록된 복수의 개체정보에 포함된 복수개의 특징정보와 특징정보를 비교하 는 단계를 포함한다. 공개특허 10-2022-0087310은 반려견의 이미지가 정면 이미지인지 확인하여 정면으로 확인되면 비문 영역을 관심 영역으로 추출하고, 비문 영역을 복수 개의 영역으로 분할하여 각각에 대한 특징정보를 추출하고 이를 개체정보에 포함된 특징정보와 비교한다. 공개특허 10-2022-0087310은 반려견의 정면 이미지를 정확하게 촬영해야 하는 어려움이 있고, 코에 질병이 발생하거나 코점액으로 인해 비문 이미지를 정확하게 인식하기 어려운 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-2325250호 (특허문헌 0002) 대한민국 공개특허 제10-2022-0087310호"}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 개선하기 위하여 발명된 것으로, 동물병원이나 공공기관에서 반려동물의 안면 영상 이미지를 획득하여 통합 데이터베이스로 저장한 후 인공지능 기반으로 안면 영상 이미지의 특징점을 학습 및 분류하고, 분류된 반려동물의 눈, 코, 귀, 입 각 부위 상호간의 거리비율을 기록하여, 추후 개체식별의 대상 이 되는 반려동물이 동물병원이나 공공기관 또는 각종 시설에 출입시 안면 영상 이미지를 촬영하고 눈, 코, 귀, 입 각 부위 상호간의 거리비율을 기준으로 통합 데이터베이스에서 거리비율의 유사도가 높은 안면 영상 이미지 를 1차 선별한 후 1차 선별된 안면 영상 이미지 중에서 개체식별의 대상이 되는 반려동물의 안면 영상 이미지와 일치하는 개체를 식별하는 반려동물 안면인식 기술을 이용한 개체식별 시스템을 제공하기 위한 것이다."}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여, 본 발명에 따른 반려동물 안면인식 기술을 이용한 개체식별 시스템 은 동물병원 및 공공기관에서 촬영한 반려동물의 안면 영상 이미지와 반려동물의 보호자 정보를 매칭하여 통합 데이터베이스에 저장하는 안면 이미지 저장부, 상기 통합 데이터베이스에 저장된 안면 영상 이미지를 딥러닝 기 반의 특정부위 분류 알고리즘으로 학습하여 반려동물의 눈, 코, 귀, 입의 위치를 분류하는 안면 특징 분류부, 분류된 눈, 코, 귀, 입의 위치 정보를 이용하여 각 부위 상호간의 거리 비율을 계산하고 통합 데이터베이스에 기록하는 안면 거리비율 계산부, 상기 통합 데이터베이스에 저장된 안면 영상 이미지를 딥러닝 기반의 개체식별 알고리즘으로 학습하는 개체식별 학습부, 개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 입력 받아 상 기 안면 특징 분류부와 안면 거리비율 계산부를 통해 각 부위 상호간의 거리비율을 계산하고, 상기 통합 데이터 베이스에서 각 부위 상호 간의 거리비율의 유사도가 높은 안면 영상 이미지를 복수 개 추출하는 개체선별부 및 상기 개체선별부가 추출한 복수 개의 안면 영상 이미지와 개체식별의 대상이 되는 안면 영상 이미지를 개체식별 학습부에 적용하여 개체선별부가 추출한 복수 개의 안면 영상 이미지 중 개체식별의 대상이 되는 안면 영상 이 미지와 일치하는 개체를 식별하는 개체식별부를 포함한다. 구체적으로, 안면 이미지 저장부는 반려동물의 안면 정면 영상 이미지, 안면 좌측면 영상 이미지 및 안면 우측 면 영상 이미지로 구분하여 통합 데이터베이스에 저장하고, 상기 안면 특징 분류부는 좌측눈, 우측눈, 코, 좌측 귀, 우측귀, 입의 위치를 분류하며, 안면 거리비율 계산부는 안면 정면 영상 이미지에서 분류된 좌측눈, 우측눈, 코, 좌측귀, 우측귀, 입의 위치 정보를 이용하여 각 부위 상호간의 거리 비율을 계산하는 정면 거리비 율 계산모듈, 안면 좌측면 영상 이미지에서 분류된 좌측눈, 코, 좌측귀, 입의 위치 정보를 이용하여 각 부위 상 호간의 거리 비율을 계산하는 좌측면 거리비율 계산모듈 및 안면 우측면 영상 이미지에서 분류된 우측눈, 코, 우측귀, 입의 위치 정보를 이용하여 각 부위 상호간의 거리 비율을 계산하는 우측면 거리비율 계산모듈을 포함 하는 구성된다. 또한 개체선별부는 개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 입력 받으면, 좌측면 거리비율 계산 모듈이 계산한 거리 비율 또는 우측면 거리비율 계산모듈이 계산한 거리 비율을 이용하여 통합 데이터베이스에 서 유사도가 일정 범위 내에 해당하는 반려동물의 안면 영상 이미지를 1차 검색하고, 1차 검색된 반려동물의 안면 영상 이미지 중에서 정면 거리비율 계산모듈이 계산한 거리비율을 이용하여 유사도가 일정 범위 내에 해당하 는 반려동물의 안면 영상 이미지를 2차 검색하여 복수 개 추출하도록 구성된다. 안면 거리비율 계산부는 안면 특징 분류부의 분류 결과를 이용하여 좌측눈-코, 우측눈-코, 좌측눈-입, 우측눈- 입, 좌측눈-좌측귀, 우측눈-우측귀, 좌측귀-코, 우측귀-코, 좌측귀-입, 우측귀-입, 입-코 각각에 대해서 이 중 어느 하나를 기준으로 나머지 각 값에 대한 비율을 계산하는 것을 특징으로 한다. 구체적으로, 안면 거리비율 계산부는 좌측귀-입을 기준으로 좌측면에 위치한 각 부위 상호간의 거리 비율을 계 산하고, 우측귀-입을 기준으로 우측면에 위치한 각 부위 상호간의 거리 비율을 계산할 수 있다. 또한 개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 상기 안면 특징 분류부에 적용하여 눈, 코, 귀, 입의 위치를 분류한 결과 안면 정면 영상 이미지가 정면 중앙을 기준으로 좌측 또는 우측으로 어느 정도 회전하 였는지를 판단하는 정면 영상 회전판단부 및 정면 영상 회전판단부에서 판단한 회전 정보를 이용하여 안면 특징 분류부에서 분류한 눈, 코, 귀, 입의 위치를 보정하는 안면 특징 보정부를 더 포함하여 구성될 수 있다. 이 때 안면 거리비율 계산부는 안면 특징 보정부에서 보정한 눈, 코, 귀, 입의 위치를 이용하여 각 부위 상호간 의 거리 비율을 계산한다. 또한, 본 발명은 상기의 개체식별 기술과 결합하여 다음의 개체식별 ID 생성 및 조회기술을 제공한다. 본 발명은 실명인증된 보호자 정보를 동물병원의 EMR 서버에서 조회하여 등록된 반려동물의 리스트를 제공하고, 제공된 반려동물 리스트에서 ID를 발급할 반려동물을 선택받아 해당 반려동물 관련정보 및 보호자 정보를 이용 하여 QR 형태의 ID를 생성하는 개체식별 ID 생성부 및 상기 QR 형태의 ID를 스캔하면 동물병원의 EMR 서버와 연 동하여 등록된 반려동물 정보, 접종정보 및 보호자 정보를 표시하고, 상기 개체식별부에서 식별한 개체의 안면 영상 이미지를 표시하는 개체식별 ID조회부를 더 포함하도록 구성된다."}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기 본 발명에 의하면, 반려동물의 비문 영역의 이미지를 추출할 필요가 없고, 반려동물의 정면 영상 이미지, 좌측면 영상 이미지, 우측면 영상 이미지만을 이용하여 눈, 코, 귀, 입의 위치를 분류하여 상호 간의 거리 비율 을 계산하고, 거리비율이 유사한 영상 이미지 중에서 개체식별의 대상이 되는 반려동물의 안면 영상 이미지와 일치하는 개체를 식별할 수 있기 때문에 영상 이미지만을 이용하여 개체식별의 대상이 되는 반려동물을 정확하 게 식별할 수가 있다. 반려견은 단두종, 장두종이라는 품종에 따른 얼굴 형태의 차이가 존재하는데, 종래의 영상 이미지를 이용하여 반려동물을 식별하는 방법은 정면 영상 이미지만을 인공지능으로 분석하여 개체를 식별하기 때문에 단두종, 장 두종을 정확하게 구별하기 어려운 문제가 있다. 본 발명은 측면 영상 이미지를 이용하여 눈, 코, 귀, 입 위치 상호간의 거리비율을 계산하기 때문에 품종에 따른 차이를 정확하게 식별할 수가 있으며, 눈, 코, 귀, 입의 위 치를 거리비율을 기준으로 1차 선별 후 선별된 영상 이미지 중에서 인공지능으로 개체를 식별하기 때문에 정확 하게 식별할 수가 있다. 각종 인구밀집시설이나 기관에서는 반려동물의 영상 이미지만 촬영하여 서버로 전송하면 실시간으로 해당 개체 를 식별하여 접종여부, 보호자 정보를 확인할 수 있기 때문에 보호자 및 반려동물 모두가 거부감이 없어 이용자 편의성을 향상시킬 수 있다."}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 도 1 내지 도 8을 참고하면, 반려동물 안면인식 기술을 이용한 개체식별 시스템은 안면 이미지 저장부 , 안면 특징 분류부, 안면 거리비율 계산부, 개체식별 학습부, 개체선별부 및 개체식 별부를 포함하며, 정면 영상 회전판단부, 안면 특징 보정부, 개체식별 ID 생성부 및 개체 식별 ID 조회부를 더 포함할 수 있다. 본 발명의 실시예에서는 반려견을 대상으로 설명하였으나, 반드시 강아지에 국한되지는 않는다. 안면 이미지 저장부는 동물병원 및 공공기관에서 촬영한 반려동물의 안면 영상 이미지와 반려동물의 보호 자 정보를 매칭하여 통합 데이터베이스에 저장한다. 보호자는 동물병원이나 동물호보기관 등의 공공기관에 방문하여 반려견의 안면을 촬영하고, 보호자 정보와 함께 등록하면, 해당 기관은 반려견의 안면 영상 이미지와 보호자 정보를 통합 데이터베이스로 전송한다. 수집되는 데이터의 공익성과 공정성을 위해 데이터 수집은 동물병원이나 공공기관과 같이 지정된 기관에서 수행 한다. 기업 데이터베이스, 공공 데이터베이스에 저장된 반려견의 안면 영상 이미지는 통합 데이터베이스로 전송하여 통합 관리한다. 이때 반려견의 안면 정면, 안면 좌측면 및 안면 우측면을 모두 촬영하여 통합 데이터베이스로 전송한다. 안면 특징 분류부는 통합 데이터베이스에 저장된 안면 영상 이미지를 딥러닝 기반의 특정부위 분류 알고리즘으로 학습하여 반려동물의 눈, 코, 귀, 입의 위치를 분류한다. 눈, 코, 귀, 입의 위치를 분류하기 위한 알고리즘은 CNN(Convolutional Neural Network)을 이용하는 것이 바람직하다. CNN은 이미지를 분석하기 위해 패턴을 찾는데 유용한 알고리즘으로 통합 데이터베이스에 저장된 안면 영상 이미지를 학습하고 패턴을 사 용해 이미지를 분류한다. 안면 거리비율 계산부는 안면 특징 분류부에서 분류된 눈, 코, 귀, 입의 위치 정보를 이용하여 각 부 위 상호간의 거리 비율을 계산하고 통합 데이터베이스에 기록한다. 여기서 각 부위 상호간의 거리 비율은 귀-입의 거리 대비 코-입의 거리 비율(코-입의 거리/귀-입의 거리), 귀입 의 거리 대비 눈-코의 거리 비율(눈-코의 거리/귀-입의 거리) 등을 말하는 것으로, 각 부위간의 실제 간격이 아 니라 비율을 의미한다. 안면 거리비율 계산부는 안면 특징 분류부에서 분류된 영상 이미지에서 눈, 코, 귀, 입의 위치를 나 타내는 픽셀을 이용하여 각 부위의 위치값을 결정하고, 위치값을 이용하여 각 부위 상호간의 거리 비율을 계산 하고 통합 데이터베이스에 기록한다. 안면 거리비율 계산부는 안면 특징 분류부의 분류 결과를 이용하여 좌측눈-코, 우측눈-코, 좌측눈-입, 우측눈-입, 좌측눈-좌측귀, 우측눈-우측귀, 좌측귀-코, 우측귀-코, 좌측귀-입, 우측귀-입, 입-코 각 각에 대해서 이 중 어느 하나를 기준으로 나머지 각 값에 대한 비율을 계산한다. 개체식별 학습부는 통합 데이터베이스에 저장된 안면 영상 이미지를 딥러닝 기반의 개체식별 알고리 즘으로 학습한다. 딥러닝 기반의 개체식별 알고리즘은 위에서 설명한 딥러닝 기반의 특정부위 분류 알고리즘과는 다른 알고리즘이 다. 딥러닝 기반의 개체식별 알고리즘은 CNN을 이용하는 것이 바람직하며, 안면 영상 이미지에서 특징점을 추출 하고 학습한다. 통합 데이터베이스에는 수백만장 이상의 반려견 영상 이미지가 저장되는데, 반려견의 눈, 코, 귀, 입의 위치 뿐만 아니라 얼굴 형상, 색상, 수염, 털의 모양 등 모든 특징을 추출하고 학습하여, 개체를 식별하는데 사용한다. 개체선별부는 개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 입력 받아 안면 특징 분류부와 안면 거리비율 계산부를 통해 각 부위 상호간의 거리비율을 계산하고, 통합 데이터베이스에서 각 부 위 상호 간의 거리비율의 유사도가 높은 안면 영상 이미지를 복수 개 추출한다. 개체식별부는 개체선별부가 추출한 복수 개의 안면 영상 이미지와 개체식별의 대상이 되는 안면 영상 이미지를 개체식별 학습부에 적용하여 개체선별부가 추출한 복수 개의 안면 영상 이미지 중 개체식별 의 대상이 되는 안면 영상 이미지와 일치하는 개체를 식별한다. 다시 말해서, 동물병원, 각종 공공기관, 인구밀집시설에 반려견이 출입시 촬영한 안면 영상 이미지를 기준으로 개체선별부가 통합 데이터베이스에서 각 부위 상호 간의 거리비율의 유사도가 높은 안면 영상 이미지 를 복수 개 추출하면, 개체식별 학습부는 통합 데이터베이스에서 추출한 복수 개의 안면 영상 이미지 중에서 출입 당시 촬영한 반려견의 안면 영상 이미지와 일치하는 개체를 식별한다. 통합 데이터베이스에 저장된 전체 안면 영상 이미지 모두를 비교하여 개체를 식별하는게 아니라, 개체선별 부가 각 부위 상호 간의 거리비율의 유사도를 기준으로 1차 검색한 안면 영상 이미지 중에서 일치하는 개 체를 식별하기 때문에 동일 또는 유사한 개체를 식별하는 시간을 단축시킬 수 있다. 도 1을 참고하면, 안면 이미지 저장부는 반려동물의 안면 정면 영상 이미지, 안면 좌측면 영상 이미지 및 안면 우측면 영상 이미지로 구분하여 통합 데이터베이스에 저장한다. 동물병원이나 동물보호기관에서 반려 견의 안면을 촬영할 때 정면, 좌측면, 우측면으로 구분하여 촬영한 후 전송하면 통합 데이터베이스에 정면, 좌측면, 우측면으로 구분하여 저장하며, 이때 동물 보호자 정보를 매칭하여 저장한다. 반려견의 안면 이미지를 정면, 좌측면, 우측면으로 구분하는 것은 딥러닝 기반의 엔진으로 구분하여 저장할 수도 있고, 관리자가 구분하여 저장할 수도 있다. 도 2를 참고하면, 안면 특징 분류부는 통합 데이터베이스에 저장된 안면 정면 영상 이미지, 안면 좌 측면 영상 이미지 및 안면 우측면 영상 이미지를 딥러닝 기반의 특정부위 분류 알고리즘으로 학습하여 좌측눈, 우측눈, 코, 좌측귀, 우측귀, 입의 위치를 분류한다. 도 3을 참고하면, 반려견은 장두종, 단두종의 품종 차이에 따라 측면 영상 이미지에서 많은 차이가 있다. 즉, 품종에 따라 눈, 코, 귀, 입 상호간의 거리 차이가 뚜렷하다. 본 발명은 개체의 정확한 식별을 위해 안면 좌측 면 영상 이미지와 안면 우측면 영상 이미지를 적극 활용한다. 안면 거리비율 계산부는 다음과 같이 구성된다. 정면 거리비율 계산모듈은 안면 정면 영상 이미지에서 분류된 좌측눈(e1), 우측눈(e2), 코(n), 좌측귀 (ea1), 우측귀(ea2), 입(m)의 위치 정보를 이용하여 각 부위 상호간의 거리 비율을 계산한다. 위에서 설명한 바 와 같이 눈, 코, 귀, 입의 위치를 나타내는 픽셀을 이용하여 각 부위의 위치값을 결정하고, 위치값을 이용하여 각 부위 상호간의 거리 비율을 계산한다. 좌측귀(ea1)-입(m)의 거리 대비 좌측귀(ea1)-좌측눈(e1)의 거리 비율, 좌측귀(ea1)-입(m)의 거리 대비 좌측귀 (ea1)-코(n)의 거리 비율, 좌측귀(ea1)-입(m)의 거리 대비 좌측눈(e1)-코(n)의 거리 비율, 좌측귀(ea1)-입(m) 의 거리 대비 코(n)-입(m)의 거리비율을 각각 계산하고 통합 데이터베이스에 기록한다. 그리고 우측귀 (ea2)-입(m)의 거리 대비 우측귀(ea2)-우측눈(e2)의 거리 비율, 우측귀(ea2)-입(m)의 거리 대비 우측귀(ea2)-코 (n)의 거리 비율, 우측귀(ea2)-입(m)의 거리 대비 우측눈(e2)-코(n)의 거리 비율, 우측귀(ea2)-입(m)의 거리 대 비 코(n)-입(m)의 거리비율을 각각 계산하고 통합 데이터베이스에 기록한다. 좌측면 거리비율 계산모듈는 안면 좌측면 영상 이미지에서 분류된 좌측눈, 코, 좌측귀, 입의 위치 정보를 이용하여 각 부위 상호간의 거리 비율을 계산한다. 좌측귀(ea1)-입(m)의 거리 대비 좌측귀(ea1)-좌측눈(e1)의 거리 비율, 좌측귀(ea1)-입(m)의 거리 대비 좌측귀 (ea1)-코(n)의 거리 비율, 좌측귀(ea1)-입(m)의 거리 대비 좌측눈(e1)-코(n)의 거리 비율, 좌측귀(ea1)-입(m) 의 거리 대비 코(n)-입(m)의 거리비율을 각각 계산하고 통합 데이터베이스에 기록한다. 좌측면 거리비율 계산모듈은 정면이 아닌 좌측면 눈, 코, 귀, 입의 픽셀 위치를 기준으로 계산하기 때문에 정면 거리비율 계산모듈이 계산한 값과 다르게 나온다. 정면에서 볼 때의 눈과 코 사이의 거리, 눈과 입 사이의 거리보다 좌측면에서 본 눈과 코 사이의 거리, 눈과 입 사이의 거리는 더 길게 나올 수 있기 때문에 좌측면 거리 비율 계 산모듈가 계산한 각 부위 상호간의 거리 비율값은 거리비율의 유사도 측정에서 중요한 의미를 가진다. 우측면 거리비율 계산모듈은 안면 우측면 영상 이미지에서 분류된 우측눈, 코, 우측귀, 입의 위치 정보를 이용하여 각 부위 상호간의 거리 비율을 계산한다. 우측귀(ea2)-입(m)의 거리 대비 우측귀(ea2)-우측눈(e2)의 거리 비율, 우측귀(ea2)-입(m)의 거리 대비 우측귀 (ea2)-코(n)의 거리 비율, 우측귀(ea2)-입(m)의 거리 대비 우측눈(e2)-코(n)의 거리 비율, 우측귀(ea2)-입(m) 의 거리 대비 코(n)-입(m)의 거리비율을 각각 계산하고 통합 데이터베이스에 기록한다. 우측면 거리비율 계산모듈은 정면이 아닌 우측면 눈, 코, 귀, 입의 픽셀 위치를 기준으로 계산하기 때문에 정면 거리비율 계산모듈이 계산한 값과 다르게 나온다. 또한, 우측귀의 크기가 좌측 귀와 다를 수 있기 때문에 좌측면 거 리비율 계산모듈이 계산한 값과도 다르게 나올 수 있다. 이와 같이 우측면 거리 비율 계산모듈가 계산한 각 부위 상호간의 거리 비율값은 거리비율의 유사도 측정 에서 중요한 의미를 가진다. 개체선별부는 개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 입력 받으면, 좌측면 거리비율 계산 모듈이 계산한 거리 비율 또는 우측면 거리비율 계산모듈이 계산한 거리 비율을 이용하여 통합 데이터베이스에서 유사도가 일정 범위 내에 해당하는 반려동물의 안면 영상 이미지를 1차 검색한다. 동물병원, 동물보호기관 또는 인구밀집시설에서 반려동물의 안면 이미지 중 정면 영상 이미지와 좌측면 영상 이 미지만 전송할 수도 있고, 정면 영상 이미지와 우측면 영상 이미지만 전송할 수도 있다. 또는 정면, 좌측면, 우 측면 영상 이미지를 모두 전송할 수도 있다. 개체선별부는 동물병원, 동물보호기관 또는 인구밀집시설에서 개체식별을 위해 전송 받은 좌측면 영상 이 미지를 좌측면 거리비율 계산모듈에 적용하여 좌측면의 거리 비율을 계산하거나, 우측면 영상 이미지를 우 측면 거리비율 계산모듈에 적용하여 우측면의 거리비율을 계산한다. 좌측면 영상 이미지와 우측면 영상 이미지를 모두 전송 받으면, 좌측면 거리비율 계산모듈이 계산한 거리 비율과 우측면 거리비율 계산모듈이 계산한 거리 비율 모두 유사도가 일정 범위 내에 해당하는 반려동물의 안면 영상 이미지를 통합 데이터베이스에서 1차 검색할 수 있다. 좌측면 거리비율 계산모듈이 계산한 거리 비율은 다음과 같이 네 개 항목으로 나올 수 있다. 좌측귀(ea1)-좌측눈(e1)의 거리 / 좌측귀(ea1)-입(m)의 거리 : 0.65 좌측귀(ea1)-코(n)의 거리 / 좌측귀(ea1)-입(m)의 거리 : 1.1 좌측눈(e1)-코(n)의 거리 / 좌측귀(ea1)-입(m)의 거리 : 0.45 코(n)-입(m)의 거리 / 좌측귀(ea1)-입(m)의 거리 : 0.33 우측면 거리비율 계산모듈이 계산한 거리 비율은 다음과 같이 네 개 항목으로 나올 수 있다. 우측귀(ea2)-우측눈(e2)의 거리 / 우측귀(ea2)-입(m)의 거리 : 0.66 우측귀(ea1)-코(n)의 거리 / 우측귀(ea2)-입(m)의 거리 : 1.1 우측눈(e1)-코(n)의 거리 / 우측귀(ea2)-입(m)의 거리 : 0.37 코(n)-입(m)의 거리 / 우측귀(ea2)-입(m)의 거리 : 0.29 위의 예는 우측귀의 크기가 좌측귀보다 크고 다른 부위는 동일한 경우의 예이다. 우측귀가 좌측귀보다 크기 때 문에 번 값이 번 값보다 작게 나오고, 번 값이 번 값보다 작게 나왔다. 나머지 , 은 , 와 거의 차이가 없다. 개체선별부는 개체식별의 대상이 되는 반려동물의 안면 좌측면 영상 이미지를 입력 받으면 좌측면 거리비 율 계산모듈이 계산한 거리비율을 이용하여 소수점 둘째 자리까지 계산한 유사도가 일정 범위(예를 들어, 0.5 이내 차이 범위)에 해당하는 반려견의 안면 영상 이미지를 통합 데이터베이스에서 1차 검색한다. 개체선별부는 개체식별의 대상이 되는 반려동물의 안면 우측면 영상 이미지를 입력 받으면 우측면 거리비 율 계산모듈이 계산한 거리비율을 이용하여 소수점 둘째 자리까지 계산한 유사도가 일정 범위(예를 들어, 0.5 이내 차이 범위)에 해당하는 반려견의 안면 영상 이미지를 통합 데이터베이스에서 1차 검색한다. 안면 좌측면 영상 이미지만 입력 받으면 좌측면 거리비율 계산모듈이 계산한 거리비율을 이용하여 유사도 가 일정 범위에 해당하는 반려견의 안면 영상 이미지를 1차 검색하고, 안면 우측면 영상 이미지만 입력 받으면 우측면 거리비율 계산모듈이 계산한 거리비율을 이용하여 유사도가 일정 범위에 해당하는 반려견의 안면 영상 이미지를 1차 검색한다. 안면 좌측면 영상 이미지와 안면 우측면 영상 이미지를 모두 입력 받으면 좌측면 거리비율 계산모듈이 계 산한 거리비율과 우측면 거리비율 계산모듈이 계산한 거리비율 모두 유사도가 일정 범위에 해당하는 반려 견의 안면 영상 이미지를 1차 검색한다. 상기에서는 좌측귀-입을 기준으로 좌측면에 위치한 각 부위 상호간의 거리 비율을 계산하고, 우측귀-입을 기준 으로 우측면에 위치한 각 부위 상호간의 거리 비율을 계산하는 예를 설명하였으나, 반드시 이에 국한되지 않는 다. 다른 부위를 기준으로 각 부위 상호간의 거리 비율을 계산하도록 설정할 수도 있다.도 4를 참고하면, 개체선별부는 1차 검색된 반려동물의 안면 영상 이미지 중에서 정면 거리비율 계산모듈 이 계산한 거리비율을 이용하여 유사도가 일정 범위 내에 해당하는 반려동물의 안면 영상 이미지를 2차 검 색하여 복수 개 추출한다. 정면 거리비율 계산모듈이 거리비율을 계산하는 방식은 상기의 좌측면 거리비율 계산모듈 및 우측면 거리비율 계산모듈이 계산하는 방식과 동일하다. 좌측면 거리비율 계산모듈 및 우측면 거리비율 계산 모듈을 이용하여 1차 추출 후 정면 거리비율 계산모듈을 이용하여 2차 추출함으로써, 측면 및 정면의 눈, 코, 귀, 입 상호 간의 거리비율의 유사도가 높은 반려견 안면 영상 이미지를 최종적으로 복수 개 추출하는 점이 특징이다. 정면 영상 회전판단부는 개체식별의 대상이 되는 반려동물의 안면 영상 이미지를 안면 특징 분류부에 적용하여 눈, 코, 귀, 입의 위치를 분류한 결과 안면 정면 영상 이미지가 정면 중앙을 기준으로 좌측 또는 우측 으로 어느 정도 회전하였는지를 판단한다. 동물병원, 동물보호기관 또는 인구밀집시설에서 촬영한 반려동물의 안면 영상 이미지는 반드시 정 중앙을 기준 으로 촬영되지 않을 수 있다. 반려견의 얼굴이 정면을 기준으로 다소 좌측으로 치우친 상태로 촬영될 수도 있고, 정면을 기준으로 다소 우측으로 치우친 상태로 촬영될 수도 있다. 정면 영상 회전판단부는 반려동물의 안면 영상 이미지를 안면 특징 분류부에 적용하여 눈, 코, 귀, 입의 위치를 분류한 결과 코 또는 입의 위치가 픽셀값 기준으로 좌측눈 또는 우측눈 측으로 얼마나 치우쳤는지 를 판단한다. 예를 들어, 코의 위치와 좌측 눈 사이의 간격이 10픽셀이고, 코위 위치와 우측눈 사이의 간격이 20픽셀이라고 하면, 회전계수 5를 적용하여 (20픽셀/10픽셀)*5 = 10, 10도 정도 좌측으로 회전한 것으로 판단한다. 코의 위치와 좌측 눈 사이의 간격이 15픽셀이고, 코위 위치와 우측눈 사이의 간격이 20픽셀이라고 하면, 회전계 수 5를 적용하여 (20픽셀/15픽셀)*5 = 약 7, 7도 정도 좌측으로 회전한 것으로 판단한다. 계산값이 회전계수 값 에 가까울수록 회전이 덜 된 것으로 판단한다. 즉, 회전계수 값에 가까울수록 반려견의 얼굴이 정면을 기준으로 한쪽으로 치우치지 않았다고 판단한다. 여기서 회전계수는 사용자의 설정에 따라 다른 값으로 설정할 수도 있다. 안면 특징 보정부는 정면 영상 회전판단부에서 판단한 회전 정보를 이용하여 안면 특징 분류부 에서 분류한 눈, 코, 귀, 입의 위치를 보정한다. 정면 영상 회전판단부에서 판단한 결과 10도 좌측으로 회전한 것으로 판단했다면, 안면 특징 보정부 는 10도 좌측으로 회전한 눈, 코, 귀, 입의 위치를 우측으로 10도 회전시킨 상태로 위치 보정한다. 10도 좌측으로 회전한 상태이기 때문에 코와 입의 위치를 우측으로 이동시켜 픽셀값과 회전계수 5를 이용하여 다시 계산한 결과 회전계수 값에 근사하도록 코와 입의 위치를 조정한다. 이때 정확도를 향상시키기 위해 두 눈 과 두 귀의 위치도 일정 부분 조정이 필요하다. 안면 거리비율 계산부는 안면 특징 보정부에서 보정한 눈, 코, 귀, 입의 위치를 이용하여 각 부위 상 호간의 거리 비율을 계산한다. 개체선별부는 동물병원, 동물보호기관 또는 인구밀집시설에서 반려견이 출입시 해당 반려견의 안면 영상 이미지를 입력받아 안면 특징 분류부와 안면 거리비율 계산부를 통해 각 부위 상호간의 거리비율을 계산하고, 통합 데이터베이스에서 각 부위 상호간의 거리비율의 유사도가 높은 안면 영상 이미지를 복수 개 추출한다. 그리고 추출된 복수 개의 안면 영상 이미지와 개체식별의 대상이 되는 해당 반려견의 안면 영상 이미지를 개체식별 학습부에 적용하여 해당 반려견의 안면 영상 이미지와 일치하는 개체를 식별한다. 개체식별 학습부의 식별 결과 유사도 순으로 여러 개가 추출될 수 있으며 이 중에서 유사도 값이 일정 수 치 이상이 되는 것이 없을 경우는 일치하는 개체가 없는 것으로 판단하며, 유사도 값이 일정 수치 이상이 되는 반려견 안면 영상 이미지가 여러 개 검출되면 이 중에서 유사도 값이 가장 높은 반려견 안면 영상 이미지가 해당 반려견에 해당하는 것으로 식별한다. 도 7 및 도 8을 참고하여 본 발명의 비즈니스 서비스 모델을 살펴본다. 반려동물 보호자가 문자 또는 실명인증 앱을 이용하여 실명인증을 수행하면 실명인증된 보호자 정보를 개체식별 시스템과 연동된 동물병원의 EMR 서버에서 조회하여 등록된 반려동물 리스트를 제공한다. 보호자는 그 중에서 자신의 반려동물을 선택하여 QR 형태의 개체식별 ID를 생성한다. 구체적으로, 개체식별 ID 생성부는 실명인증된 보호자 정보를 동물병원의 EMR 서버에서 조회하여 등록된 반려동물의 리스트를 보호자의 단말기로 제공하고, 제공된 반려동물 리스트에서 ID를 발급할 반려동물을 보호자 로부터 선택받아 해당 반려동물 관련정보 및 보호자 정보를 이용하여 QR 형태의 ID를 생성한다. 도면에서는 펫 ID로 표기되어 있다. 보호자가 반려동물의 개체식별 ID를 QR 형태로 생성한 후 동물병원이나 공공기관, 인구밀집시설 등에서 QR 코드 를 스캔하면 동물병원의 EMR 서버와 연동하여 해당 반려동물의 정보, 보호자 정보 및 반려동물의 접종정보를 출 력한다. 구체적으로, 개체식별 ID 조회부는 보호자가 앱을 실행하여 QR 형태의 ID를 스캔하면 동물병원의 EMR 서버 와 연동하여 등록된 반려동물 정보, 접종정보 및 보호자 정보를 표시한다. 그리고 반려동물을 촬영한 안면 영상 이미지와 일치하는 개체의 안면 영상 이미지를 개체식별부를 통해 식별하여 반려동물 정보, 접종정보 및 보호자 정보와 함께 화면에 표시한다. 따라서 QR ID를 통해 반려동물의 정보, 접종정보 및 보호자 정보가 출력되어도 반려동물의 안면 영상 이미지가 통합 데이터베이스의 검색 결과 매칭되지 않으면(즉 QR ID에 해당하지 않는 다른 동물을 데리고 출입하 면), 일치하는 개체의 안면 영상 이미지가 검색되지 않기 때문에 화면에 개체의 안면 영상 이미지가 표시되지 않는다. 도 8은 QR ID를 통해 반려동물 정보, 접종정보 및 보호자 정보와 현장에서 촬영한 반려동물의 안면 영상 이미지 와 일치하는 개체를 통합 데이터베이스에서 식별하여 표시한 경우의 예이다. 상기와 같은 본 발명에 의하면, 종래의 일반적인 딥러닝 기반 개체식별 기술에 비해 시간을 단축할 수 있으며, 정확성을 향상시킬 수 있다. 2022년 기준으로 한국의 반려견은 약 650만 두수, 반려묘는 300만 두수로 추정된다. 해당 데이터를 모두 보유하고 있다고 가정하고 진행할 경우, 유사한 개체의 식별에서 발생하는 시간 을 효과적으로 단축할 수 있다. 본 발명은 개체식별의 대상이 되는 반려견의 안면 영상 이미지를 CNN 알고리즘을 이용하여 눈, 코, 귀, 입의 위 치를 분류하고, 분류된 눈, 코, 귀, 입의 위치간 거리비율을 측정하여 유사도가 높은 데이터를 1차 선별하고, 1 차 선별된 데이터 중에서 CNN 알고리즘을 이용하여 최종 개체를 식별하기 때문에 종래 기술대비 시간 및 정확성 을 향상시킬 수 있다."}
{"patent_id": "10-2022-0141993", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2022-0141993", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시예에 따른 반려동물 안면인식 기술을 이용한 개체식별 시스템의 데이터 수집 단 계에서 촬영하여 통합 데이터베이스에 저장되는 반려견의 우측면, 정면, 좌측면 영상 이미지, 도 2는 통합 데이터베이스에 저장된 우측면, 정면, 좌측면 영상 이미지의 눈, 코, 귀, 입의 위치를 분류하고 각 부위 상호간의 거리 비율을 계산하는 예시,도 3은 장두종과 단두종의 측면 영상 이미지에서 각 부위 상호간의 거리 비율 차이를 나타내는 예시, 도 4는 개체식별의 대상이 되는 반려견의 안면 정면 영상 이미지를 수신하여 눈, 코, 귀, 입의 위치를 분류하고, 각 부위 상호간의 거리 비율을 계산하는 예시, 도 5는 본 발명의 바람직한 실시예에 따른 반려동물 안면인식 기술을 이용한 개체식별 시스템의 기능 블록도, 도 6은 본 발명의 바람직한 실시예에 따른 반려동물 안면인식 기술을 이용한 개체를 식별하는 방법을 나타낸 순 서도. 도 7은 본 발명의 바람직한 실시예에 따른 반려동물 안면인식 기술을 이용한 개체식별 시스템이 적용된 서비스 모델 구성도, 도 8은 보호자 실명인증 정보를 기반으로 동물병원의 EMR 서버에 등록된 반려동물 정보와 보호자 정보를 이용하 여 QR 기반의 개체식별 ID를 생성한 후 동물병원이나 각종 공공기관에서 QR 체크인 시 EMR 서버에 등록된 반려 동물 정보, 보호자정보와 통합 데이터베이스에 등록된 반려동물의 안면 영상 이미지의 매칭 여부를 확인하여 개 체를 식별하는 서비스 화면의 예시"}
