{"patent_id": "10-2021-0161246", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0075047", "출원번호": "10-2021-0161246", "발명의 명칭": "연성회로기판을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "신광하"}}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,하우징;상기 하우징 내에 배치된 제1 인쇄회로기판;상기 하우징 내에 배치된 제2 인쇄회로기판;상기 제1 인쇄회로기판과 상기 제2 인쇄회로기판을 전기적으로 연결하는 연성회로기판으로서, 상기 제1 인쇄회로기판에 연결되는 제1 커넥터, 상기 제2 인쇄회로기판에 연결되는 제2 커넥터 및 상기 제1 커넥터로부터 상기제2 인쇄회로기판과 멀어지는 방향으로 연장되다가 상기 제2 인쇄회로기판을 향해 굴곡되어 연장되는 벤딩부를포함하는 연성회로기판;상기 하우징 내에 배치되고, 적어도 일 부분이 상기 연성회로기판과 마주하는 전기 부품; 및상기 벤딩부의 일 부분과 상기 벤딩부의 일 부분과 마주하는 상기 벤딩부의 타 부분 사이에 배치된 완충부재를포함하는 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 연성회로기판 중 상기 제1 커넥터가 결합된 면의 반대 면에 결합된 보강부재로서, 적어도 일 부분이 상기하우징을 지지하는 돌출부를 포함하는 보강부재;를 더 포함하는 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 돌출부의 두께는 상기 연성회로기판의 두께보다 큰 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서,상기 돌출부는 제1 돌출부 및 상기 제1 돌출부와 상기 하우징의 폭 방향으로 이격된 제2 돌출부를 포함하고,상기 제1 돌출부 및 상기 제2 돌출부의 이격 거리는 상기 연성회로기판의 폭보다 큰 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 벤딩부는 상기 제1 커넥터로부터 상기 제2 인쇄회로기판과 멀어지는 방향으로 연장되는 제1 평면부, 상기제1 평면부로부터 상기 제2 인쇄회로기판을 향해 굴곡된 굴곡부 및 상기 굴곡부로부터 상기 제2 인쇄회로기판을향해 연장되는 제2 평면부를 포함하는 전자 장치.공개특허 10-2023-0075047-3-청구항 6 제5 항에 있어서,상기 완충부재는 상기 제1 평면부 및 상기 제2 평면부 중 어느 하나에 배치된 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5 항에 있어서,상기 제2 평면부는 상기 제1 평면부와 실질적으로 평행한 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2 항에 있어서,상기 벤딩부는 상기 제1 커넥터로부터 상기 제2 인쇄회로기판과 멀어지는 방향으로 연장되는 제1 평면부, 상기제1 평면부로부터 상기 제2 인쇄회로기판을 향해 굴곡된 굴곡부 및 상기 굴곡부로부터 상기 제2 인쇄회로기판을향해 연장되는 제2 평면부를 포함하고,상기 완충부재는 상기 보강부재 중 상기 굴곡부를 향하는 부위에 배치된 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 전기 부품은 배터리 및 카메라 중 적어도 어느 하나를 포함하는 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서,상기 완충부재의 높이는 상기 제1 평면부와 상기 제2 평면부의 이격 거리보다 작은 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제2 항에 있어서,상기 돌출부는 상기 보강부재와 일체로 형성된 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제2 항에 있어서,상기 돌출부는 상기 보강부재와 별도로 형성된 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 돌출부는 부착부재를 통해 상기 보강부재에 결합된 전자 장치.공개특허 10-2023-0075047-4-청구항 14 제12 항에 있어서,상기 돌출부는 상기 보강부재를 관통하여 상기 하우징에 결합된 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제5 항에 있어서,상기 연성회로기판은 상기 전기 부품과 멀어지는 방향으로 상기 제2 평면부로부터 연장되는 제1 경사부 및 상기제1 경사부로부터 상기 제2 인쇄회로기판을 향해 연장되는 제3 평면부를 포함하는 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치에 있어서,하우징;상기 하우징 내에 배치된 제1 인쇄회로기판;상기 제1 인쇄회로기판과 전기적으로 연결된 연성회로기판으로서, 상기 제1 인쇄회로기판에 결합되는 제1 커넥터 및 상기 제1 커넥터로부터 일 방향으로 연장되다가 상기 일 방향과 반대 방향인 타 방향을 향해 굴곡되어 연장되는 벤딩부를 포함하는 연성회로기판;상기 하우징 내에 배치되고, 적어도 일 부분이 상기 연성회로기판과 마주하는 전기 부품;상기 연성회로기판 중 상기 제1 커넥터가 결합된 면의 반대 면에 결합된 보강부재로서, 적어도 일 부분이 상기하우징을 지지하는 돌출부를 포함하는 보강부재; 및상기 벤딩부의 내측에 배치되고, 상기 보강부재와 인접 배치된 완충부재를 포함하는 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 보강부재는 제1 방향을 향하는 제1 면, 상기 제1 방향과 반대 방향인 제2 방향을 향하는 제2 면 및 상기제1 면 중 적어도 일 부분에서 상기 제2 방향을 향해 함몰 형성되는 유동공간을 포함하고,상기 유동공간의 깊이는 상기 연성회로기판의 두께보다 큰 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서,상기 유동공간의 폭은 상기 연성회로기판의 폭보다 큰 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16 항에 있어서,상기 벤딩부는 상기 제1 커넥터로부터 일 방향을 향해 연장되는 제1 평면부, 상기 제1 평면부로부터 상기 일 방향과 반대 방향인 타 방향을 향해 굴곡된 굴곡부 및 상기 굴곡부로부터 상기 타 방향을 향해 연장되는 제2 평면부를 포함하는 전자 장치.공개특허 10-2023-0075047-5-청구항 20 전자 장치에 있어서,하우징;상기 하우징 내에 배치된 제1 인쇄회로기판;상기 제1 인쇄회로기판과 전기적으로 연결된 연성회로기판으로서, 상기 제1 인쇄회로기판과 연결되는 제1 커넥터, 상기 제1 커넥터로부터 일 방향으로 연장되다가 상기 일 방향과 반대 방향인 타 방향을 향해 굴곡되어 연장되는 벤딩부를 포함하는 연성회로기판;상기 제1 인쇄회로기판과 인접 배치되고, 적어도 일 부분이 상기 연성회로기판과 마주하는 전기 부품; 및상기 벤딩부의 내측에 배치되는 완충부재를 포함하고,상기 벤딩부는 상기 제1 커넥터로부터 상기 제1 인쇄회로기판과 실질적으로 평행하게 연장되는 제1 평면부, 상기 제1 평면부로부터 상기 제1 커넥터를 향해 굴곡되어 연장되는 굴곡부 및 상기 굴곡부로부터 상기 제1 인쇄회로기판과 실질적으로 평행하게 연장되는 제2 평면부를 포함하는 전자 장치."}
{"patent_id": "10-2021-0161246", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 실시예들에 따르면, 전자 장치는, 하우징, 상기 하우징 내에 배치된 제1 인쇄회로기판, 상기 하우징 내에 배치된 제2 인쇄회로기판, 상기 제1 인쇄회로기판과 상기 제2 인쇄회로기판을 전기적으로 연결하는 연성회로기판으로서, 상기 제1 인쇄회로기판에 연결되는 제1 커넥터, 상기 제2 인쇄회로기판에 연결되는 제2 커 넥터 및 상기 제1 커넥터로부터 상기 제2 인쇄회로기판과 멀어지는 방향으로 연장되다가 상기 제2 인쇄회로기판 을 향해 굴곡되어 연장되는 벤딩부를 포함하는 연성회로기판, 상기 하우징 내에 배치되고, 적어도 일 부분이 상 기 연성회로기판과 마주하는 전기 부품 및 상기 벤딩부의 일 부분과 상기 벤딩부의 일 부분과 마주하는 상기 벤 딩부의 타 부분 사이에 배치된 완충부재를 포함할 수 있다."}
{"patent_id": "10-2021-0161246", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 개시된 다양한 실시예는 전자 장치에 관한 것으로, 예를 들면, 연성회로기판을 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0161246", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보통신 기술과 반도체 기술 등의 눈부신 발전에 힘입어 각종 전자 장치들의 보급과 이용이 급속도로 증가하고 있다. 전자 장치들은 휴대하고 다니며 통신할 수 있도록 개발되고 있다. 전자 장치라 함은, 가전제품으로부터, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영 상/음향 장치, 데스크톱/랩톱 컴퓨터, 또는 차량용 내비게이션과 같이, 탑재된 프로그램에 따라 특정 기능을 수 행하는 장치를 의미할 수 있다. 예를 들면, 이러한 전자 장치들은 저장된 정보를 음향이나 영상으로 출력할 수 있다. 전자 장치의 집적도가 높아지고, 초고속, 대용량 무선통신이 보편화되면서, 이동통신 단말기와 같은 하나 의 전자 장치에 다양한 기능이 탑재될 수 있다. 예를 들면, 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼트 기능, 음악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹과 같은 통신 및 보안 기능, 일정 관리나 전자 지 갑 등의 기능이 하나의 전자 장치에 집약되고 있는 것이다. 이러한 전자 장치는 사용자가 편리하게 휴대할 수 있도록 소형화되고 있다. 최근 스마트 폰과 같은 휴대용 전자 장치의 소형화, 박형화 그리고 안테나 관련 최신 기술의 적용과 같은 높은 집적도 및 고성능에 대한 요구로 인해, 전자 장치 내부에 인쇄회로기판(printed circuit board)을 배치할 공간 이 줄어들어 회로기판을 소형화하고, 분리 및 이격하여 회로기판을 배치하고 있다. 이에 따라, 전자 장치는 연성회로기판(flexible printed circuit board)이 구비되어, 연성회로기판을 통해 분리 및 이격된 인쇄회로기판을 연결하고 있다."}
{"patent_id": "10-2021-0161246", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치(예: 스마트폰 또는 태블릿 PC)는 배터리 및 카메라와 같은 전기 부품들, 전기 부품들과 전기적으로 연결된 인쇄회로기판 및 인쇄회로기판과 전기 부품들을 연결하거나 분리된 인쇄회로기판들을 연결하는 연성회로 기판을 포함할 수 있다. 연성회로기판은 전자 장치 내부에서 일정한 공간을 점유할 수 있고, 인쇄회로기판들과 연결 및/또는 체결되기 위한 커넥터를 포함할 수 있다. 연성회로기판은 전자 장치 내부에서 전기 부품들이나 지지부재들과 인접 배치될 수 있다. 사용자가 전자 장치를 사용하는 과정에서, 전자 장치의 전기 부품들 또는 지지부재들은 전자 장치의 내부에서 전자 장치의 하우징(예: 케이스)을 기준으로 상대적인 거동이 발생할 수 있다. 연성회로기판은 전기 부품들이나 지지부재들에 의해 특정 부위가 당겨질 수 있고, 이로 인해 인쇄회로기판과 결합된 연성회로기판의 커넥터의 파손 또는 커넥터의 이탈이 발생할 수 있다. 본 개시의 다양한 실시예들에 따르면, 연성회로기판의 커넥터가 인쇄회로기판으로부터 이탈되는 것을 감소시킬 수 있는 전자 장치를 제공할 수 있다. 본 개시의 다양한 실시예들에 따르면, 연성회로기판의 일 영역이 다른 영역과 충돌하는 것을 제한할 수 있는 전 자 장치를 제공할 수 있다. 다만, 본 개시에서 해결하고자 하는 과제는 상기 언급된 과제에 한정되는 것이 아니며, 본 개시의 사상 및 영역 으로부터 벗어나지 않는 범위에서 다양하게 확정될 수 있을 것이다."}
{"patent_id": "10-2021-0161246", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 하우징, 상기 하우징 내에 배치된 제1 인쇄회로기판, 상 기 하우징 내에 배치된 제2 인쇄회로기판, 상기 제1 인쇄회로기판과 상기 제2 인쇄회로기판을 전기적으로 연결 하는 연성회로기판으로서, 상기 제1 인쇄회로기판에 연결되는 제1 커넥터, 상기 제2 인쇄회로기판에 연결되는 제2 커넥터 및 상기 제1 커넥터로부터 상기 제2 인쇄회로기판과 멀어지는 방향으로 연장되다가 상기 제2 인쇄회 로기판을 향해 굴곡되어 연장되는 벤딩부를 포함하는 연성회로기판, 상기 하우징 내에 배치되고, 적어도 일 부 분이 상기 연성회로기판과 마주하는 전기 부품 및 상기 벤딩부의 일 부분과 상기 벤딩부의 일 부분과 마주하는 상기 벤딩부의 타 부분 사이에 배치된 완충부재를 포함할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 하우징, 상기 하우징 내에 배치된 제1 인쇄회로기판, 상 기 제1 인쇄회로기판과 전기적으로 연결된 연성회로기판으로서, 상기 제1 인쇄회로기판에 결합되는 제1 커넥터 및 상기 제1 커넥터로부터 일 방향으로 연장되다가 상기 일 방향과 반대 방향인 타 방향을 향해 굴곡되어 연장 되는 벤딩부를 포함하는 연성회로기판, 상기 하우징 내에 배치되고, 적어도 일 부분이 상기 연성회로기판과 마 주하는 전기 부품, 상기 연성회로기판 중 상기 제1 커넥터가 결합된 면의 반대 면에 결합된 보강부재로서, 적어 도 일 부분이 상기 하우징을 지지하는 돌출부를 포함하는 보강부재 및 상기 벤딩부의 내측에 배치되고, 상기 보 강부재와 인접 배치된 완충부재를 포함할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 하우징, 상기 하우징 내에 배치된 제1 인쇄회로기판, 상 기 제1 인쇄회로기판과 전기적으로 연결된 연성회로기판으로서, 상기 제1 인쇄회로기판과 연결되는 제1 커넥터, 상기 제1 커넥터로부터 일 방향으로 연장되다가 상기 일 방향과 반대 방향인 타 방향을 향해 굴곡되어 연장되는 벤딩부를 포함하는 연성회로기판, 상기 제1 인쇄회로기판과 인접 배치되고, 적어도 일 부분이 상기 연성회로기 판과 마주하는 전기 부품 및 상기 벤딩부의 내측에 배치되는 완충부재를 포함하고, 상기 벤딩부는 상기 제1 커 넥터로부터 상기 제1 인쇄회로기판과 실질적으로 평행하게 연장되는 제1 평면부, 상기 제1 평면부로부터 상기 제1 커넥터를 향해 굴곡되어 연장되는 굴곡부 및 상기 굴곡부로부터 상기 제1 인쇄회로기판과 실질적으로 평행 하게 연장되는 제2 평면부를 포함할 수 있다."}
{"patent_id": "10-2021-0161246", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예들에 따르면, 전자 장치는 복수의 인쇄회로기판들과 복수의 인쇄회로기판들을 연결하거 나 또는 인쇄회로기판과 전기 부품을 연결하는 연성회로기판을 포함할 수 있다. 연성회로기판은 벤딩부를 포함 함으로써, 연성회로기판의 일부 영역이 당겨지더라도 이를 수용할 수 있으므로, 연성회로기판에 크랙이 발생하 는 것을 제한하거나 감소시킬 수 있다. 본 개시의 다양한 실시예들에 따르면, 전자 장치는 연성회로기판의 이탈 및/또는 연성회로기판의 파손이 제한됨으로써, 전자 장치의 내구성 및 신뢰성이 확보될 수 있다.본 개시의 다양한 실시예들에 따르면, 전자 장치는 완충부재를 포함함으로써, 연성회로기판의 일부 영역이 과도 하게 굴곡되거나 또는 꺾이는 것을 제한하거나 감소시킬 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0161246", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서 버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통 신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장 치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안 테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다.디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 전도체 또는 전도성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다.도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2는 본 개시의 다양한 실시예에 따른, 전자 장치의 전면 사시도이다. 도 3은 본 개시의 다양한 실시예에 따 른, 전자 장치의 후면 사시도이다. 도 2 및 도 3을 참조하면, 일 실시예에 따른 전자 장치는, 전면(310A), 후면(310B), 및 전면(310A) 및 후 면(310B) 사이의 공간을 둘러싸는 측면(310C)을 포함하는 하우징을 포함할 수 있다. 다른 실시예(미도시) 에서는, 상기 하우징은, 도 2의 전면(310A) 및 측면(310C), 도 3의 후면(310B)들 중 일부를 형성하는 구조 를 지칭할 수도 있다. 일 실시예에 따르면, 상기 전면(310A)은 적어도 일부분이 실질적으로 투명한 전면 플레이트(예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트)에 의하여 형성될 수 있 다. 후면(310B)은 후면 플레이트에 의하여 형성될 수 있다. 상기 후면 플레이트는, 예를 들어, 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 상기 측면(310C)은, 전면 플레이트 및 후면 플레이트와 결합하며, 금 속 및/또는 폴리머를 포함하는 측면 베젤 구조 (또는 \"측면 부재\")에 의하여 형성될 수 있다. 어떤 실시예 에서는, 후면 플레이트 및 측면 베젤 구조는 일체로 형성되고 동일한 물질(예: 유리, 알루미늄과 같 은 금속 물질 또는 세라믹)을 포함할 수 있다. 도시된 실시예에서는, 상기 전면 플레이트는, 상기 전면(310A)으로부터 상기 후면 플레이트 쪽으로 휘어져 심리스하게(seamless) 연장된 2개의 제1 엣지 영역(310D)들을, 상기 전면 플레이트의 긴 엣지(long edge) 양단에 포함할 수 있다. 도시된 실시예(도 3 참조)에서, 상기 후면 플레이트는, 상기 후면(310B)으 로부터 상기 전면 플레이트 쪽으로 휘어져 심리스하게 연장된 2개의 제2 엣지 영역(310E)들을 긴 엣지 양 단에 포함할 수 있다. 어떤 실시예에서는, 상기 전면 플레이트(또는 상기 후면 플레이트)가 상기 제1 엣지 영역(310D)들(또는 상기 제2 엣지 영역(310E)들) 중 하나 만을 포함할 수 있다. 다른 실시예에서는, 상기 제1 엣지 영역(310D)들 또는 제2 엣지 영역(310E)들 중 일부가 포함되지 않을 수 있다. 상기 실시예들에서, 상 기 전자 장치의 측면에서 볼 때, 측면 베젤 구조는, 상기와 같은 제1 엣지 영역(310D)들 또는 제2 엣 지 영역(310E)들이 포함되지 않는 측면 쪽에서는 제1 두께(또는 폭)을 가지고, 상기 제1 엣지 영역(310D)들 또 는 제2 엣지 영역(310E)들을 포함한 측면 쪽에서는 상기 제1 두께보다 얇은 제2 두께를 가질 수 있다. 일 실시예에 따르면, 전자 장치는, 디스플레이, 오디오 모듈(303, 307, 314)(예: 도 1의 오디오 모듈 ), 센서 모듈(예: 도 1의 센서 모듈), 카메라 모듈(305, 312)(예: 도 1의 카메라 모듈), 키 입 력 장치(예: 도 1의 입력 모듈), 및 커넥터 홀(308, 309)(예: 도 1의 연결 단자) 중 적어도 하 나 이상을 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나(예: 커넥터 홀 )를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 일 실시예에 따르면, 디스플레이는, 예를 들어, 전면 플레이트의 상당 부분을 통하여 시각적으로 노 출될 수 있다. 어떤 실시예에서는, 상기 전면(310A), 및 상기 제1 엣지 영역(310D)들을 형성하는 전면 플레이트 를 통하여 상기 디스플레이의 적어도 일부가 시각적으로 노출될 수 있다. 어떤 실시예에서는, 디스플 레이의 모서리를 상기 전면 플레이트의 인접한 외곽 형상과 대체로 동일하게 형성할 수 있다. 다른 실시예(미도시)에서는, 디스플레이가 시각적으로 노출되는 면적을 확장하기 위하여, 디스플레이의 외 곽과 전면 플레이트의 외곽간의 간격이 대체로 동일하게 형성될 수 있다. 일 실시예에 따르면, 하우징의 표면(또는 전면 플레이트)은 디스플레이가 시각적으로 노출됨에 따라 형성되는 화면 표시 영역을 포함할 수 있다. 일례로, 화면 표시 영역은 전면(310A), 및 제1 엣지 영역 (310D)들을 포함할 수 있다. 일 실시예에 따르면, 하우징의 +X 방향(예: 도 4의 +X 방향)에는 제1 측면(310F)이 배치되고, -X 방향(예: 도 4의 -X 방향)에는 제2 측면(310G)이 배치될 수 있다. 다른 실시예(미도시)에서는, 디스플레이의 화면 표시 영역(예: 전면(310A), 제1 엣지 영역(310D))의 일부 에 리세스 또는 개구부(opening)를 형성하고, 상기 리세스 또는 상기 개구부(opening)와 정렬되는 오디오 모듈 , 센서 모듈(미도시), 발광 소자(미도시), 및 카메라 모듈 중 적어도 하나 이상을 포함할 수 있다. 다른 실시예(미도시)에서는, 디스플레이의 화면 표시 영역의 배면에, 오디오 모듈, 센서 모듈(미도시), 카메라 모듈, 지문 센서(미도시), 및 발광 소자(미도시) 중 적어도 하나 이상을 포함할 수 있다. 다른 실시예(미도시)에서는, 디스플레이는, 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있 다. 어떤 실시예에서는, 상기 키 입력 장치의 적어도 일부가, 상기 제1 엣지 영역(310D)들, 및/또는 상기 제2 엣지 영역(310E)들에 배치될 수 있다. 다양한 실시예에 따르면, 카메라 모듈들(305, 312) 중 제1카메라 모듈 및/또는 센서 모듈은 전자 장치 의 내부 공간에서, 디스플레이의 투과 영역을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 한 실시예에 따르면, 디스플레이의 제1카메라 모듈과 대면하는 영역은 컨텐츠를 표시하는 영역의 일부로 서 지정된 투과율을 갖는 투과 영역으로 형성될 수도 있다. 한 실시예에 따르면, 투과 영역은 약 5% 내지 약 20% 범위의 투과율을 갖도록 형성될 수 있다. 이러한 투과 영역은 이미지 센서로 결상되어 화상을 생성하기 위 한 광이 통과하는, 제1카메라 모듈의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예를들어, 디스플레이의 투과 영역은 주변보다 픽셀의 밀도 및/또는 배선 밀도가 낮은 영역을 포함할 수 있다. 예를 들어, 투과 영역은 리세스 또는 개구부를 대체할 수 있다. 일 실시예에 따르면, 오디오 모듈(303, 307, 314)은, 예를 들면, 마이크 홀 및 스피커 홀(307, 314)을 포 함할 수 있다. 마이크 홀은 외부의 소리를 획득하기 위한 마이크가 내부에 배치될 수 있고, 어떤 실시예에 서는 소리의 방향을 감지할 수 있도록 복수개의 마이크가 배치될 수 있다. 스피커 홀(307, 314)은, 외부 스피커 홀 및 통화용 리시버 홀을 포함할 수 있다. 어떤 실시예에서는 스피커 홀(307, 314)과 마이크 홀 이 하나의 홀로 구현 되거나, 스피커 홀(307, 314) 없이 스피커가 포함될 수 있다(예: 피에조 스피커). 오 디오 모듈(303, 307, 314)은 상기 구조에 한정된 것은 아니며, 전자 장치의 구조에 따라 일부 오디오 모듈 만 장착되거나 새로운 오디오 모듈이 부가되는 등 다양하게 설계 변경할 수 있다. 일 실시예에 따르면, 센서 모듈(미도시)은, 예를 들면, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(미도시)은, 예를 들어, 하우징의 전면(310A)에 배치된 제1 센서 모듈(예: 근접 센서) 및/또는 제2 센서 모듈(예: 지문 센서), 및/또는 상기 하우 징의 후면(310B)에 배치된 제3 센서 모듈(예: HRM 센서) 및/또는 제4 센서 모듈(예: 지문 센서)을 포함할 수 있다. 어떤 실시 예에서(미도시), 상기 지문 센서는 하우징의 전면(310A)(예: 디스플레이)뿐만 아 니라 후면(310B)에 배치될 수 있다. 전자 장치는, 도시되지 않은 센서 모듈, 예를 들어, 제스처 센서, 자 이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온 도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 더 포함할 수 있다. 상기 센서 모듈은 상기 구조에 한정 된 것은 아니며, 전자 장치의 구조에 따라 일부 센서 모듈만 장착되거나 새로운 센서 모듈이 부가되는 등 다양하게 설계 변경할 수 있다. 일 실시예에 따르면, 카메라 모듈(305, 312)은, 예를 들면, 전자 장치의 전면(310A)에 배치된 제1 카메라 모듈, 및 후면(310B)에 배치된 제2 카메라 모듈, 및/또는 플래시(미도시)를 포함할 수 있다. 상기 카 메라 모듈(305, 312)은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 플래시(미도시)는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 어떤 실시 예에서는, 2개 이상의 렌즈들 (적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면 에 배치될 수 있다. 카메라 모듈(305, 312)은 상기 구조에 한정된 것은 아니며, 전자 장치의 구조에 따라 일부 카메라 모듈만 장착되거나 새로운 카메라 모듈이 부가되는 등 다양하게 설계 변경할 수 있다. 일 실시예에 따르면, 전자 장치는 각각 다른 속성(예: 화각) 또는 기능을 가진 복수의 카메라 모듈들(예: 듀얼 카메라, 또는 트리플 카메라)을 포함할 수 있다. 예를 들면, 서로 다른 화각을 갖는 렌즈를 포함하는 카메 라 모듈(305, 312)이 복수로 형성될 수 있고, 전자 장치는 사용자의 선택에 기반하여, 전자 장치에서 수행되는 카메라 모듈(305, 312)의 화각을 변경하도록 제어할 수 있다. 예를 들면, 상기 카메라 모듈(305, 31 2)들 중 적어도 하나는 광각 카메라이고, 적어도 다른 하나는 망원 카메라일 수 있다. 유사하게, 상기 카메라 모듈(305, 312)들 중 적어도 하나는 전면 카메라이고, 적어도 다른 하나는 후면 카메라일 수 있다. 또한, 카메 라 모듈(305, 312)들은, 광각 카메라, 망원 카메라, 또는 IR(infrared) 카메라(예: TOF(time of flight) camera, structured light camera) 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, IR 카메라는 센서 모듈의 적어도 일부로 동작될 수 있다. 예를 들어, TOF 카메라는 피사체와의 거리를 감지하기 위한 센서 모듈 (미도시)의 적어도 일부로 동작될 수 있다. 일 실시예에 따르면, 키 입력 장치는, 하우징의 측면(310C)에 배치될 수 있다. 다른 실시 예에서는, 전자 장치는 상기 언급된 키 입력 장치 중 일부 또는 전부를 포함하지 않을 수 있고 포함되지 않은 키 입력 장치는 디스플레이 상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 어떤 실시예에서, 키 입력 장치는 하우징의 제2 면(310B)에 배치된 센서 모듈을 포함할 수 있다. 일 실시예에 따르면, 발광 소자(미도시)는, 예를 들어, 하우징의 전면(310A)에 배치될 수 있다. 발광 소자 (미도시)는, 예를 들어, 전자 장치의 상태 정보를 광 형태로 제공할 수 있다. 다른 실시 예에서, 발광 소 자(미도시)는, 예를 들어, 전면 카메라 모듈의 동작과 연동되는 광원을 제공할 수 있다. 발광 소자(미도시)는, 예를 들어, LED, IR LED 및/또는 제논 램프를 포함할 수 있다. 일 실시예에 따르면, 커넥터 홀(308, 309)은, 예를 들면, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터(예를 들어, USB 커넥터)를 수용할 수 있는 제1 커넥터 홀, 및/또는 외부 전자 장치와 오디오 신호를 송수신하기 위한 커넥터를 수용할 수 있는 제2 커넥터 홀(예를 들어, 이어폰 잭)을 포함할 수 있다.일 실시예에 따르면, 카메라 모듈들(305, 312) 중 제1 카메라 모듈, 및/또는 센서 모듈(미도시)들 중 일부 센서 모듈은 디스플레이의 적어도 일부를 통해 외부로 시각적으로 노출되도록 배치될 수 있다. 예를 들어, 카메라 모듈은 디스플레이의 배면에 형성된 홀 또는 리세스의 내부에 배치되는, 펀치 홀 카메라를 포 함할 수 있다. 일 실시예에 따르면, 제2 카메라 모듈은 렌즈가 전자 장치의 제2 면(310B)으로 시각적 으로 노출되도록 하우징 내부에 배치될 수 있다. 예를 들어, 제2 카메라 모듈은 인쇄 회로 기판(예: 도 4의 인쇄 회로 기판)에 배치될 수 있다. 일 실시예에 따르면, 제1 카메라 모듈, 및/또는 센서 모듈은 전자 장치의 내부 공간에서, 디스플레이 의, 전면 플레이트까지 투명 영역을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 또한, 일부 센서 모듈은 전자 장치의 내부 공간에서 전면 플레이트를 통해 시각적으로 노출되지 않고 그 기능을 수행하도록 배치될 수도 있다. 도 4는 본 개시의 다양한 실시예에 따른, 전자 장치의 후면 분해도이다. 도 5는 본 개시의 다양한 실시예에 따 른, 전자 장치의 인쇄회로기판, 연성회로기판 및 전기 부품의 배치관계를 나타낸 후면도이다. 이하, 설명의 편의를 위해, 도 4 내지 도 7에서, 후면 플레이트에서 전면 플레이트를 향하는 방향을 +Z 방향, 전면 플레이트에서 후면 플레이트를 향하는 방향을 -Z 방향, 제2 인쇄회로기판에서 제 1 인쇄회로기판을 향하는 방향을 +X 방향, 제1 인쇄회로기판에서 제2 인쇄회로기판을 향하는 방 향을 -X 방향, 배터리를 기준으로 X축과 Z축이 형성하는 평면과 수직한 일 방향을 +Y 방향 및 배터리(35 0)를 기준으로 X축과 Z축이 형성하는 평면과 수직하고 상기 +Y 방향과 다른 방향을 -Y 방향으로 정의 및 해석될 수 있다. 예를 들면, X 축 방향은 전자 장치 및 전자 장치의 구성요소들의 길이 방향으로 해석될 수 있고, Y 축 방향은 전자 장치 및 전자 장치의 구성요소들의 폭 방향으로 해석될 수 있고, Z 축 방향 은 전자 장치 및 전자 장치의 구성요소들의 높이 및/또는 두께 방향으로 해석될 수 있다. 도 4 내지 도 5를 참조하면, 다양한 실시예에 따른 전자 장치(예: 도 1 내지 도 3의 전자 장치)는 제 1 지지부재, 전면 플레이트(예: 도 2의 전면 플레이트), 인쇄회로기판(예: PCB(printed circuit board), FPCB(flexible PCB) 또는 RFPCB(rigid flexible PCB)), 배터리(예: 도 1 의 배터리 ), 연성회로기판, 제2 지지부재(예: 리어 케이스), 및/또는 후면 플레이트(예: 도 2의 후 면 플레이트)를 포함할 수 있다. 한 실시예에 따른, 전자 장치의 제1 지지부재는, 측면 베젤 구 조(예: 도 2의 측면 베젤 구조)를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 전술한 구성요소들 중 적어도 하나(예: 제1 지지부재 또는 제2 지지부재)를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 전자 장치의 구성요소들 중 적 어도 하나는, 도 2 또는 도 3의 전자 장치의 구성요소들 중 적어도 하나와 동일, 또는 유사할 수 있으며, 중복되는 설명은 이하 생략될 수 있다. 다양한 실시예에 따르면, 제1 지지부재는 전자 장치 내부에 배치되어 측면 베젤 구조(예: 도 2의 측 면 베젤 구조)와 연결되거나 또는 측면 베젤 구조와 일체로 형성될 수 있다. 예를 들면, 제1 지지부재 는 금속 재질 및/또는 비금속(예: 폴리머) 재질로 형성될 수 있다. 일 실시예에 따르면, 제1 지지부재 는 일면에 디스플레이(미도시)(예: 도 2의 디스플레이)가 결합되고, 타면에 인쇄회로기판이 결 합될 수 있다. 다양한 실시예에 따르면, 인쇄회로기판은 프로세서(미도시)(예: 도 1 의 프로세서), 메모리(미도시) (예: 도 1의 메모리) 및/또는 인터페이스(미도시)(예: 도 1의 인터페이스)가 장착될 수 있다. 예를 들면, 프로세서는 중앙처리장치, 어플리케이션 프로세서, 그래픽 처리 장치, 이미지 시그널 프로세서, 센서 허 브 프로세서 또는 커뮤니케이션 프로세서 중 하나 또는 그 이상을 포함할 수 있다. 다양한 실시예에 따르면, 인 쇄회로기판은 연성회로기판 유형의 무선 주파수 케이블(flexible printed circuit board type radio frequency cable, FRC)을 포함할 수 있다. 예를 들면, 인쇄회로기판은 제1 지지부재의 적어도 일부에 배치될 수 있고, 안테나 모듈(예: 도 1의 안테나 모듈 및/또는 통신 모듈(미도시)(예: 도 1의 통신 모듈 )과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 인쇄회로기판은 제1 인쇄회로기판 및/또 는 제2 인쇄회로기판를 포함할 수 있다. 제1 인쇄회로기판 및/또는 제2 인쇄회로기판는 인쇄회 로기판에 포함된 구성을 일부 또는 전부를 포함할 수 있다. 일 실시예에 따르면, 제1 인쇄회로기판은 배터리를 기준으로 +X 방향에 배치될 수 있고, 제2 인쇄회 로기판은 -X 방향에 배치될 수 있다. 다른 실시예(미도시)에 따르면, 제1 인쇄회로기판은 배터리 를 기준으로 +Z 방향에 배치될 수 있으며, 제2 인쇄회로기판은 배터리를 기준으로 -Z 방향에 배 치될 수 있다. 또 다른 실시예(미도시)에 따르면, 제1 인쇄회로기판은 배터리를 기준으로 +Y 방향에 배치될 수 있으며, 제2 인쇄회로기판은 배터리를 기준으로 -Y 방향에 배치될 수 있다. 또 다른 실시 예(미도시)에 따르면, 제1 인쇄회로기판은 배터리를 기준으로 어느 일 방향에 배치될 수 있고, 제2 인쇄회로기판은 배터리를 기준으로 상기 일 방향과 다른 방향에 배치될 수 있다. 또 다른 실시예(미 도시)에 따르면, 제1 인쇄회로기판 및 제2 인쇄회로기판은 배터리를 기준으로 같은 방향에 서로 이격되어 배치될 수 있다. 일 실시예에 따르면, 메모리는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 일 실시예에 따르면, 인터페이스는 HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스 및/또는 오디오 인터페이스를 포함할 수 있다. 예를 들면, 인터페이스는 전자 장치와 외부 전자 장치(예: 도 1의 전자 장치 또는 전자 장치)를 전기적 및/또는 물리적으로 연 결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터 및/또는 오디오 커넥터를 포함할 수 있다. 다양한 실시예에 따르면, 배터리는 전자 장치의 적어도 하나의 구성요소 또는 전기 부품에 전력을 공 급하기 위한 장치로서, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 일 실시예에 따르면, 배터리는 전자 장치 내부에 일체로 배치될 수 있다. 다른 실시예에 따르면, 배 터리는 전자 장치에 탈부착 가능하게 배치될 수 있다. 다양한 실시예에 따르면, 제2 지지 부재(예: 리어 케이스)는 인쇄회로기판과 안테나(미도시)(예: 도 1의 안테나 모듈) 사이에 배치될 수 있다. 일 실시예에 따르면, 제2 지지부재는 인쇄회로기판 또는 배터리 중 적어도 하나가 결합된 일면 및 안테나가 결합된 타면을 포함할 수 있다. 다양한 실시예에 따르면, 안테나(미도시)(예: 도 1의 안테나 모듈)는 후면 플레이트와 배터리 사이에 배치될 수 있다. 예를 들면, 안테나는 NFC(near field communication) 안테나, 무선 충전 안테나 및/또 는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 예를 들면, 안테나는 외부 장치와 근거리 통 신을 하거나 또는 충전에 필요한 전력을 무선으로 송수신할 수 있다. 다른 실시예에서는, 측면 베젤 구조 및/또 는 제1 지지부재의 일부 또는 그 조합에 의해 안테나 구조가 형성될 수 있다. 다양한 실시예에 따르면, 후면 플레이트는 전자 장치의 후면(예: 도 3의 제2 면(310B))의 적어도 일 부를 형성할 수 있다. 다양한 실시예에 따르면, 전자 장치는 연성회로기판(flexible printed circuit board, FPCB)을 포함 할 수 있다. 일 실시예에 따르면, 연성회로기판은 제1 인쇄회로기판과 제2 인쇄회로기판를 전기 적으로 연결할 수 있다. 일 실시예에 따르면, 제1 인쇄회로기판은 후면 플레이트를 향하는 일면(예: -Z 방향을 향하는 면) 및 전면 플레이트를 향하는 타면(예: +Z 방향을 향하는 면)을 포함할 수 있다. 일 실시예에 따르면, 연성회로 기판은 제1 인쇄회로기판의 상기 일면에 전기적 및/또는 물리적으로 연결될 수 있다. 다른 실시예(미 도시)에 따르면, 연성회로기판은 제1 인쇄회로기판의 상기 타면에 전기적 및/또는 물리적으로 연결될 수 있다. 또 다른 실시예(미도시)에 따르면, 연성회로기판은 제1 인쇄회로기판의 상기 일면 및 타면 에 모두 전기적 및/또는 물리적으로 연결되는 구조를 포함할 수 있다. 일 실시예에 따르면, 제2 인쇄회로기판은 후면 플레이트를 향하는 일면(예: -Z 방향을 향하는 면) 및 전면 플레이트를 향하는 타면(예: +Z 방향을 향하는 면)을 포함할 수 있다. 일 실시예에 따르면, 연성회로 기판은 제2 인쇄회로기판의 상기 일면에 전기적 및/또는 물리적으로 연결될 수 있다. 다른 실시예(미 도시)에 따르면, 연성회로기판은 제2 인쇄회로기판의 상기 타면에 전기적 및/또는 물리적으로 연결될 수 있다. 또 다른 실시예(미도시)에 따르면, 연성회로기판은 제2 인쇄회로기판의 상기 일면 및 타면 에 모두 전기적 및/또는 물리적으로 연결되는 구조를 포함할 수 있다. 일 실시예에 따르면, 전기 부품(예: 배터리은 적어도 일 부분이 연성회로기판과 마주할 수 있다. 일 실시예에 따르면, 배터리는 후면 플레이트를 향하는 일면(예: -Z 방향을 향하는 면) 및 전면 플레 이트를 향하는 타면(예: +Z 방향을 향하는 면)을 포함할 수 있다. 일 실시예에 따르면, 연성회로기판(36 0)은 배터리의 상기 일면과 마주할 수 있다. 예를 들면, 연성회로기판은 배터리의 상기 일면과소정 거리 이격될 수 있다. 다양한 실시예에 따르면, 연성회로기판은 제1 인쇄회로기판과 연결된 제1 영역, 제2 인쇄회로기 판과 연결된 제2 영역 및 제1 영역과 제2 영역을 연결하는 연결 영역을 포함할 수 있 다. 일 실시예에 따르면, 연결 영역은 전자 장치의 내부에서 배터리를 가로지르도록 어느 일 방 향(예: X 방향)으로 연장될 수 있다. 일 실시예에 따르면, 연결 영역은 배터리와 후면 플레이트 사이에 배치될 수 있다. 예를 들면, 연결 영역은 배터리와 소정 거리 이격되며, 후면 플레이트 과 소정 거리 이격될 수 있다. 다른 실시예(미도시)에 따르면, 연결 영역은 배터리와 전면 플레이트 사이에 배치될 수 있다. 예를 들면, 연결 영역은 배터리와 소정 거리 이격되며, 전면 플레이트 와 소정 거리 이격될 수 있다. 다른 실시예(미도시)에 따르면, 연결 영역은 전자 장치 내부에서 디스플레이(미도시)(예: 도 2의 디스플레이)와 간섭 및/또는 중첩되지 않도록 배치될 수 있다. 일 실시예에 따르면, 제2 영역는 제2 인쇄회로기판의 일 부분에 연결되는 제2-1 영역(362-1) 및 제2 인쇄회로기판의 다른 부분에 연결되는 제2-2 영역(362-2)을 포함할 수 있다. 다른 실시예에 따르면, 상기 제2-1 영역(362-1) 및 제2-2 영역(362-2) 중 어느 하나는 제2 인쇄회로기판에 연결되고, 다른 하나는 전기 부품(예: 도 3의 오디오 모듈 또는 커넥터 홀(308, 309))과 전기적으로 연결될 수 있다. 도 6a는 본 개시의 다양한 실시예에 따른, 도 5의 A-A' 선을 절개한 단면도이고, 연성회로기판의 벤딩부가 변형 되기 전 상태를 나타낸 도면이다. 도 6b는 본 개시의 다양한 실시예에 따른, 도 5의 A-A' 선을 절개한 단면도이 고, 연성회로기판의 벤딩부가 변형된 후 상태를 나타낸 도면이다. 도 6a 내지 도 6b를 참조하면, 다양한 실시예에 따른 전자 장치는 하우징, 연성회로기판, 완충 부재, 보강부재, 제1 인쇄회로기판, 배터리 모듈 및/또는 제2 지지구조를 포함할 수 있다. 도 6a 내지 도 6b의 전자 장치, 연성회로기판, 제1 인쇄회로기판 및/또는 배터리 모듈 의 구성은 도 4 내지 도 5의 전자 장치, 연성회로기판, 제1 인쇄회로기판 및/또는 배터리 의 구성과 일부 또는 전부가 동일할 수 있다. 다양한 실시예에 따르면, 하우징은 제1 하우징 및 제2 하우징을 포함할 수 있다. 일 실시예에 따르면, 제1 하우징 및 제2 하우징은 별도로 형성될 수 있다. 다른 실시예(미도시)에 따르면, 제1 하 우징 및 제2 하우징은 일체로 형성될 수 있다. 일 실시예에 따르면, 제1 하우징은 적어도 일 부분이 제1 인쇄회로기판을 지지하는 지지부(441a)를 포함할 수 있다. 지지부(441a)는 제1 인쇄회로기판(예: 도 4의 제1 인쇄회로기판)과 배터리 모듈 (예: 도 4의 배터리) 사이에 배치될 수 있다. 예를 들면, 지지부(441a)는 제1 인쇄회로기판과 배터리 모듈이 충돌하는 것을 제한할 수 있다. 일 실시예에서, 제1 하우징은 제1 지지부재(예: 도 4 의 제1 지지부재)의 적어도 일부로 해석될 수 있다. 다른 실시예에서, 제1 하우징은 하우징(예: 도 2 내지 도 3의 하우징)의 적어도 일부로 해석될 수 있다. 일 실시예에 따르면, 제2 하우징은 적어도 일 부분이 제1 하우징과 전자 장치의 두께 방향(Z 축 방향)으로 이격될 수 있다. 제2 하우징은 적어도 일 부분이 연성회로기판(예: 도 4 내지 도 5의 연성 회로기판)과 마주할 수 있다. 예를 들면, 제2 하우징은 연성회로기판의 적어도 일 부분이 전자 장치의 외부로 노출되는 것을 제한할 수 있다. 일 실시예에서, 제2 하우징은 제2 지지부재(예: 도 4 의 제2 지지부재)의 적어도 일부로 해석될 수 있다. 다른 실시예에서, 제2 하우징은 하우징(예: 도 2 내지 도 3의 하우징)의 적어도 일부로 해석될 수 있다. 일 실시예에 따르면, 제1 인쇄회로기판은 제1 하우징과 제2 하우징 사이에 배치될 수 있다. 일 실시예에 따르면, 제1 인쇄회로기판은 적어도 일 부분이 제1 하우징에 의해 지지될 수 있고, 제2 하 우징을 향하는 일면(예: -Z 방향을 향하는 면)에 배치된 제3 커넥터(441a)를 포함할 수 있다. 예를 들면, 제3 커넥터(441a)는 연성회로기판의 제1 커넥터(461a-1)과 전기적 및/또는 물리적으로 연결될 수 있다. 다양한 실시예에 따르면, 연성회로기판은 벤딩부, 제1 경사부 및 제3 평면부를 포함할 수 있다. 예를 들어, 연성회로기판은 적어도 일 부분이 하우징 내에 배치되고, 제1 인쇄회로기판과 제2 인쇄회로기판(미도시)(예: 도 4의 제2 인쇄회로기판)를 전기적으로 연결할 수 있다. 다양한 실시예에 따르면, 벤딩부는 제2 인쇄회로기판(미도시)(예: 도 4 내지 도 5의 제2 인쇄회로기판 )과 멀어지는 방향으로 연장되다가 제2 인쇄회로기판을 향해 굴국되어 연장될 수 있다. 다양한 실시예에 따르면, 벤딩부는 제1 평면부(461a), 굴곡부(461b) 및/또는 제2 평면부(461c)를 포함할 수 있다. 일 실시예에서, 벤딩부는 제1 인쇄회로기판과 연결되는 연성회로기판의 제1 영역(예: 도 4 내지 도 5의 제1 영역)의 적어도 일부로 해석될 수 있다. 일 실시예에 따르면, 제1 평면부(461a)는 제1 인쇄회로기판과 실질적으로 평행하게 배치될 수 있다. 예를 들어, 제1 평면부(461a)는 제1 인쇄회로기판과 연결되는 부위(예: 제1 커넥터(461a-1)가 배치되는 부위)로 부터 제2 인쇄회로기판(미도시)(예: 도 4 내지 도 5의 제2 인쇄회로기판)과 멀어지는 방향(예: +X 방향)으 로 연장될 수 있다. 다른 실시예(미도시)에 따르면, 제1 평면부(461a)는 제1 인쇄회로기판에 대해 임의의 각도(예: 도 6a 내지 도 6b의 X 축에 대해 임의의 각도)를 가지도록 경사지게 배치될 수 있으며, 제2 인쇄회로 기판과 멀어지는 방향으로 연장될 수 있다. 일 실시예에 따르면, 제1 커넥터(461a-1)는 제1 인쇄회로기판의 제3 커넥터(441a)와 전기적 및/또는 물리 적으로 연결될 수 있다. 일 실시예에 따르면, 제1 인쇄회로기판은 제3 커넥터(441a), 제1 커넥터(461a-1), 연성회로기판, 연성회로기판의 제2 커넥터(미도시) 및/또는 제2 인쇄회로기판의 제4 커넥터(미도시) 를 통해 제2 인쇄회로기판과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 굴곡부(461b)는 일단이 제1 평면부(461a)의 일단(예: 제2 인쇄회로기판으로부터 가장 먼 부위)에 연결될 수 있다. 일 실시예에 따르면, 굴곡부(461b)는 타단이 제2 평면부(461c)의 일단(예: 제2 인쇄회 로기판으로부터 가장 멀게 위치한 부위)에 연결될 수 있다. 일 실시예에 따르면, 굴곡부(461b)는 제2 인쇄회로 기판을 향해 굴곡된 형상을 가질 수 있다. 예를 들면, 굴곡부(461b)는 적어도 일 부분이 제2 인쇄회로기판과 반 대 방향(예: +X 방향)을 향해 볼록하게 돌출될 수 있다. 일 실시예에 따르면, 제2 평면부(461c)는 제1 평면부(461a)와 실질적으로 평행하게 배치될 수 있다. 예를 들어, 제2 평면부(461c)는 굴곡부(461b)로부터 제2 인쇄회로기판과 가까워지는 방향(예: 도 6a 내지 도 6b의 -X 축 방 향)으로 연장될 수 있다. 제2 평면부(461c)는 적어도 일 부분이 제2 하우징에 인접 배치될 수 있다. 다른 실시예(미도시)에 따르면, 제2 평면부(461c)는 제1 평면부(461a)에 대해 임의의 각도를 가지도록 경사지게 배치 될 수 있으며, 제2 인쇄회로기판과 가까워지는 방향으로 연장될 수 있다. 일 실시예에 따르면, 제1 경사부는 일단이 제2 평면부(461c)의 타단(예: 제2 인쇄회로기판과 가장 가까운 부위)에 연결될 수 있다. 일 실시예에 따르면, 제1 경사부는 제1 하우징의 길이 방향(예: 도 6a 내지 도 6b의 X 축 방향)에 대해 임의의 각도를 가지도록 경사지게 연장될 수 있다. 예를 들면, 제1 경사부는 제1 인쇄회로기판과 멀어지는 방향(예: 도 6a 내지 도 6b의 -X 방향) 및 제1 하우징과 점진적으로 멀 어지는 방향(예: 도 6a 내지 도 6b의 -Z 방향)을 향해 경사지도록 배치될 수 있다. 일 실시예에 따르면, 제3 평면부는 일단이 제1 경사부의 타단(예: 제1 인쇄회로기판과 가장 먼 부위)에 연결될 수 있다. 일 실시예에 따르면, 제3 평면부는 실질적으로 제1 하우징과 평행하게 배치 될 수 있다. 일 실시예에 따르면, 제3 평면부는 제1 경사부로부터 제2 인쇄회로기판과 가까워지는 방 향(예: 도 6a 내지 도 6b의 -X 방향)으로 연장될 수 있다. 일 실시예에 따르면, 제3 평면부는 적어도 일 부분이 제2 인쇄회로기판과 연결되는 연성회로기판의 제2 영역(미도시)(예: 도 4 내지 도 5의 제2 영역 )로 해석될 수 있다. 다양한 실시예에 따르면, 연성회로기판의 제1 경사부 및/또는 제3 평면부는 적어도 일 부분이 전기 부품(예: 배터리 모듈)과 마주할 수 있다. 예를 들면, 연성회로기판의 제1 경사부 및/또는 제3 평면부는 전기 부품(예: 배터리 모듈)과 임의의 거리만큼 이격되어 배치될 수 있다. 일 실시예에 따르면, 전자 장치의 전기 부품(예: 배터리 모듈)은 적어도 일 부분이 제1 하우징 에 의해 고정 및/또는 지지될 수 있다. 다양한 실시예에 따르면, 완충부재는 벤딩부의 내측에 배치될 수 있다. 일 실시예에 따르면, 완충부 재는 제1 평면부(461a)와 제2 평면부(461c) 사이에 배치될 수 있다. 예를 들면, 완충부재의 높이 (h1)(예: Z 축 방향으로의 길이)는 제1 평면부(461a)와 제2 평면부(461c)의 이격 거리(s1)보다 작을 수 있다. 예를 들면, 완충부재는 고무(rubber) 또는 합성수지와 같은 탄성부재(elastic member)로 마련될 수 있으며, 제1 평면부(461a)와 제2 평면부(461c)가 직접적으로 충돌하는 것을 제한할 수 있다. 다른 예를 들면, 완충부재는 제1 평면부(461a)와 제2 평면부(461c)가 직접적으로 충돌하는 것을 제한하는 다양한 부재로 마 련될 수 있다. 일 실시예에 따르면, 완충부재는 제1 평면부(461a)의 일면(예: 도 6a 내지 도 6b의 -Z 방향을 향하는 면)에 배치될 수 있다. 다른 실시예(미도시)에 따르면, 완충부재는 제2 평면부(461c)의 일면(예: +Z 방향을 향하는 면)에 배치될 수 있다. 또 다른 실시예(미도시)에 따르면, 완충부재는 보강부 재의 일면(예: +X 방향을 향하는 면)에 배치될 수 있다. 다양한 실시예에 따르면, 완충부재는 벤딩부 의 일 부분(예: 제1 평면부(461a))과 상기 벤딩부의 일 부분과 마주하는 상기 벤딩부의 타 부분(예: 제2 평면부(461c)) 사이에 배치될 수 있다. 일 실시예에 따르면, 완충부재는 제1 평면부(461a)와 제1 평면 부(461a)와 마주하는 제2 평면부(461c) 사이에 배치될 수 있다. 다양한 실시예에 따르면, 보강부재는 적어도 일 부분이 연성회로기판에 결합될 수 있다. 일 실시예에 따르면, 보강부재는 연성회로기판 중 제1 커넥터(441a)가 결합된 면의 반대 면에 결합될 수 있다. 예 를 들면, 제1 평면부(461a)의 일면(예: +Z 방향을 향하는 면)에 제1 커넥터(441a)가 결합되며, 제1 평면부 (461a)의 타면(예: -Z 방향을 향하는 면)에 보강부재가 결합될 수 있다. 일 실시예에 따르면, 보강부재 는 적어도 일 부분이 하우징(예: 제2 하우징)를 지지하는 돌출부(미도시)(예: 도 7의 돌출부)를 포함할 수 있다. 이하, 도 6a 및 도 6b를 참조하여, 벤딩부의 변형 전 상태와 변형 후 상태에 대해 설명한다. 도 6a를 참조하면, 벤딩부는 변형되기 전에 제1 위치에 배치될 수 있다. 일 실시예에 따르면, 벤딩부(46 1)가 제1 위치에 배치된 상태에서, 연성회로기판의 제1 경사부 및/또는 제3 평면부는 배터리 모 듈과 이격된 상태가 유지될 수 있다. 전자 장치는 사용 과정에서 특정되지 않는 방향으로 가압될 수 있다. 이와 같은 경우, 전자 장치의 전기 부품(예: 배터리 모듈)은 전자 장치의 내부에서 전자 장치에 대해 상대적인 거동(움직임)이 발생할 수 있다. 예를 들면, 배터리 모듈은 전자 장치의 내부에서 일 방향(예: -Z 방향)으로 거동이 발생할 수 있다. 배터리 모듈은 지지부재(421a) 및/또는 제2 인쇄회로기판에 의해 배터리 모듈의 길이 방향(예: X 축 방향)으로 거동이 제한될 수 있다. 배터리 모듈 은 제1 하우징에 의해 배터리 모듈의 두께 방향(예: Z 축 방향) 중 일 방향(예: +Z 방향)으로 거동이 제한될 수 있다. 배터리 모듈은 전자 장치에 가해지는 충격이나 힘에 의해, 전자 장치의 내부에서 일 방향(예: -Z 방향)으로 거동이 발생할 수 있다. 배터리 모듈이 일 방향(예: -Z 방향)으로 거 동되는 경우, 배터리 모듈은 제1 경사부의 적어도 일 부분 및/또는 제3 평면부의 적어도 일 부 분과 충돌할 수 있다. 제1 경사부 및/또는 제3 평면부는 배터리 모듈에 의해 일 방향(예: -Z 방 향)으로 거동이 발생할 수 있고, 이에 따라 벤딩부는 제1 경사부와 연결된 벤딩부가 제2 인쇄회 로기판을 향해 당겨지는 힘(예: -X 방향으로 당겨지는 힘)이 작용될 수 있다. 도 6b를 참조하면, 벤딩부는 변형된 후 제2 위치에 배치될 수 있다. 제2 평면부(461c)는 제1 위치(예: 도 6a의 제2 평면부(461c)의 위치)에서 제2 인쇄회로기판을 향해 소정 거리 이동하여 제2 위치에 배치될 수 있다. 굴곡부(461b)는 제1 위치(예: 도 6a의 굴곡부(461b)의 위치)에서 제2 인쇄회로기판을 향해 굴곡되며 제2 위치에 배치될 수 있다. 제1 평면부(461a)는 적어도 일 부분(예: 굴곡부(461b)와 연결된 부위 및 이와 인접한 부위)이 제2 인쇄회로기판을 향해 굴곡될 수 있다. 제1 평면부(461a)의 다른 부분(예: 제1 커넥터(461a-1)가 결합된 부 위 및 이와 인접한 부위)은 벤딩부에 가해지는 힘에도 불구하고 그 위치가 고정될 수 있다. 제2 평면부 (461c)가 소정 거리 이동하는 경우, 굴곡부(461b)의 일부 및/또는 제1 평면부(461a)의 일부가 굴곡 변형되며 이 동량을 수용하므로, 제1 평면부(461a) 중 제1 커넥터(461a-1)가 결합된 부위의 이동이 발생하지 않을 수 있다. 이에 따라, 본 개시의 전자 장치는 연성회로기판에 대해 전기 부품(예: 배터리 모듈)에 의한 힘 이 작용하는 경우에도, 제1 커넥터(461a-1)가 제1 인쇄회로기판의 제3 커넥터(441a)로부터 이탈되는 것이 제한될 수 있다. 다른 실시예(미도시)에 따르면, 벤딩부, 완충부재 및/또는 보강부재의 구조 및/또는 배치관계는 연성회로기판(예: 도 4 내지 도 5의 연성회로기판) 중 제2 인쇄회로기판(미도시)(예: 도 4 내지 도 5 의 제2 인쇄회로기판)과 연결되는 영역(미도시)(예: 도 5의 제2 영역)에도 형성될 수 있다. 도 7은 본 개시의 다양한 실시예에 따른, 도 5의 B-B' 선을 절개한 단면도이다. 도 7을 참조하면, 다양한 실시예에 따른 전자 장치는 제2 하우징, 연성회로기판, 보강부재 및/또는 제1 인쇄회로기판을 포함할 수 있다. 도 7의 제2 하우징, 연성회로기판, 보강부재 및/또는 제1 인쇄회로기판의 구성은 도 6a 내지 도 6b의 제2 하우징, 연성회로기판, 보강부재 및/또는 제1 인쇄회로기판의 구성과 일부 또는 전부가 동일할 수 있다.다양한 실시예에 따르면, 보강부재는 일면(예: +Z 방향을 향하는 면)이 연성회로기판의 적어도 일부 (예: 제1 평면부(461a))에 결합될 수 있다. 일 실시예에 따르면, 보강부재의 폭은 제1 평면부(461a)의 폭 과 실질적으로 동일할 수 있다. 다른 실시예(미도시)에 따르면, 보강부재의 폭은 제1 평면부(461a)의 폭보 다 작거나 또는 클 수 있다. 다양한 실시예에 따르면, 보강부재는 적어도 일 부분이 하우징(예: 제2 하우징)을 지지하는 돌출부 를 포함할 수 있다. 예를 들면, 돌출부는 일면(예: -Z 방향을 향하는 면)이 직접적 또는 간접적으로 제2 하우징을 지지함으로써, 제2 하우징과 제1 인쇄회로기판의 이격 거리를 유지할 수 있다. 일 실시예에서, 보강부재는 적어도 일 부분(예: 돌출부)이 하우징(예: 제2 하우징)에 결합된 것으 로 해석될 수 있다. 일 실시예에 따르면, 돌출부는 제1 돌출부(492a) 및 제1 돌출부(492a)와 하우징(예: 제2 하우징)의 폭 방향으로 이격된 제2 돌출부(492b)를 포함할 수 있다. 일 실시예에 따르면, 돌출부의 두께(예: 제1 돌 출부(492a)의 두께 및 제2 돌출부(492b)의 두께, Z 축 방향으로의 길이)는 연성회로기판의 두께보다 클 수 있다. 예를 들면, 돌출부의 두께(예: 제1 돌출부(492a)의 두께 및 제2 돌출부(492b)의 두께)는 제2 평면부 (461c)의 두께(예: Z 축 방향으로의 길이)보다 클 수 있다. 일 실시예에 따르면, 제1 돌출부(492a) 및 제2 돌출 부(492b)의 이격 거리(s2)는 연성회로기판의 폭(w1)(예: Y 축 방향으로의 길이)보다 클 수 있다. 일 실시 예에서, 제1 돌출부(492a) 및 제2 돌출부(492b)의 두께 및 상호간의 이격 거리가 제2 평면부(461c)의 두께 및 폭보다 크기 때문에, 제2 평면부(461c)는 제2 하우징, 돌출부 및 보강부재가 형성하는 유동공간 (490a)에서 거동이 허용될 수 있다. 예를 들면, 제2 평면부(461c)는 유동공간(490a)에서 제2 하우징의 폭 방향(예: Y 축 방향) 및/또는 두께 방향(예: Z 축 방향)으로 거동할 수 있는 공간이 확보될 수 있다. 다른 실시 예에서, 유동공간(490a)는 보강부재의 구성요소로 해석될 수 있다. 예를 들면, 보강부재는 제1 방향 (예: 도 7의 -Z 방향)을 향하는 제1 면, 제1 방향과 반대 방향을 향하는 제2 방향(예: 도 7의 +Z 방향)을 향하 는 제2 면 및 제1 면 중 적어도 일 부분에서 제2 방향을 향해 함몰 형성되는 유동공간(490a)를 포함할 수 있다. 다른 실시예에서, 유동공간(490a)의 깊이(예: 도 7의 Z 축 방향으로의 길이)는 연성회로기판의 두께(예: 제2 평면부(461c)의 두께(예: 도 7의 Z 축 방향으로의 길이))보다 클 수 있다. 다른 실시예에서, 유동공간 (490a)의 폭(예: 도 7의 Y 축 방향으로의 길이)은 연성회로기판의 폭(예: 제2 평면부(461c)의 폭(예: 도 7 의 Y 축 방향으로의 길이))보다 클 수 있다. 도 8a는 본 개시의 다양한 실시예에 따른, 전자 장치의 벤딩부가 형성되기 전 연성회로기판을 나타낸 정면도이 고, 도 8b는 본 개시의 다양한 실시예에 따른, 전자 장치의 벤딩부가 형성되기 전 연성회로기판을 나타낸 후면 도이고, 도 8c는 본 개시의 다양한 실시예에 따른, 전자 장치의 벤딩부가 형성되기 전 연성회로기판을 나타낸 후면 사시도이다. 도 8a 내지 도 8c의 연성회로기판의 구성은 도 4 내지 도 5의 연성회로기판의 구성 및/또는 도 6 내 지 도 7의 연성회로기판과 일부 또는 전부가 동일할 수 있다. 도 8a 내지 도 8c의 완충부재의 구성은 도 6 내지 도 7의 완충부재의 구성과 일부 또는 전부가 동일할 수 있다. 도 8a 내지 도 8c의 보강부재 의 구성은 도 6 내지 도 7의 보강부재의 구성과 일부 또는 전부가 동일할 수 있다. 다양한 실시예에 따르면, 연성회로기판은 제1 영역, 제2 영역 및/또는 연결 영역을 포함할 수 있다. 일 실시예에 따르면, 연성회로기판은 제1 영역(예: 도 4 내지 도 5의 제1 영역)의 정면(예: 도 8a에 도시된 면)에 배치된 제1 커넥터(561a)(예: 도 6 내지 도 7의 제1 커넥터(461a-1))를 포함할 수 있다. 일 실시예에서, 제1 커넥터(561a)는 제1 인쇄회로기판(예: 도 4 내지 도 5의 제1 인쇄회로기판)과 전기적 및/ 또는 물리적으로 연결될 수 있다. 일 실시예에서, 제1 커넥터(561a)는 연성회로기판의 적어도 일부로 해석 될 수 있다. 다른 실시예에서, 제1 커넥터(561a)는 연성회로기판과 별개의 구성으로 해석될 수 있다. 일 실시예에 따르면, 보강부재는 제1 영역의 후면(예: 도 8b에 도시된 면, 정면과 반대 방향을 향하 는 면)에 배치될 수 있다. 일 실시예에 따르면, 보강부재는 제1 영역과 별도 부재로 형성되어 제1 영 역에 부착될 수 있다. 다른 실시예(미도시)에 따르면, 보강부재는 제1 영역과 일체의 부재로 형 성될 수 있다. 일 실시예에 따르면, 연결 영역(예: 도 4 내지 도 5의 연결 영역)은 제1 영역 및 제2 영역(56 2)를 연결할 수 있다. 일 실시예에 따르면, 연결 영역의 적어도 일부는 전자 장치(예: 도 1 내지 도 7의 전자 장치)의 내부에서 전기 부품(예: 도 4 내지 도 5의 배터리 및/또는 도 6a 내지 도 6b의 배 터리 모듈)과 마주할 수 있다. 일 실시예에 따르면, 제2 영역(예: 도 4 내지 도 5의 제2 영역)은 제2-1 영역(562-1)(예: 도 4 내지 도 5의 제2-1 영역(362-1)) 및/또는 제2-2 영역(562-2)(예: 도 4 내지 도 5의 제2-2 영역(362-2))를 포함할 수 있다. 일 실시예에 따르면, 연성회로기판은 제2-1 영역(562-1)의 후면(예: 도 8b에 도시된 면)에 배치된 제2-1 커넥터(562-1a) 및/또는 제2-2 영역(562-2)의 후면(예: 도 8b에 도시된 면)에 배치된 제2-2 커넥터(562-2a)를 포함할 수 있다. 일 실시예에 따르면, 제2-1 커넥터(562-1a) 및 제2-2 커넥터(562-2a)는 제2 인쇄회로기판(예: 도 4 내지 도 5의 제2 인쇄회로기판)에 전기적으로 연결될 수 있다. 다른 실시예에 따르면, 제2-1 커넥터 (562-1a) 및 제2-2 커넥터(562-2a) 중 어느 하나는 제2 인쇄회로기판에 연결되고, 나머지 하나는 제2 인쇄회로 기판과 다른 전기 부품과 연결될 수 있다. 어떤 실시예에서, 제2-1 커넥터(562-1a) 및 제2-2 커넥터(562-2a)는 연성회로기판의 적어도 일부로 해석될 수 있다. 다른 어떤 실시예에서, 제2-1 커넥터(562-1a) 및/또는 제 2-2 커넥터(562-2a)는 연성회로기판과 별개의 구성으로 해석될 수 있다. 일 실시예에 따르면, 제2-1 보강부재(562-1b)는 제2-1 영역(562-1)의 정면(예: 도 8a에 도시된 면)에 배치될 수 있다. 제2-1 보강부재(562-1b)는 적어도 일 부분이 하우징(예: 도 6 내지 도 7의 제2 하우징)을 직접적 및 /또는 간접적으로 지지함으로써, 하우징과 제2 인쇄회로기판 사이의 이격 거리를 유지할 수 있다. 일 실시예에 따르면, 제2-1 보강부재(562-1b)는 제2-1 영역(562-1)과 별도 부재로 형성되어 제2-1 영역(562-1)에 부착될 수 있다. 다른 실시예(미도시)에 따르면, 제2-1 보강부재(562-1b)는 제2-1 영역(562-1)과 일체의 부재로 형성될 수 있다. 일 실시예에 따르면, 제2-2 보강부재(562-2b)는 제2-2 영역(562-2)의 정면(예: 도 8a에 도시된 면)에 배치될 수 있다. 제2-2 보강부재(562-2b)는 적어도 일 부분이 하우징(예: 도 6 내지 도 7의 제2 하우징)을 직접적 및 /또는 간접적으로 지지함으로써, 하우징과 제2 인쇄회로기판 사이의 이격 거리를 유지할 수 있다. 일 실시예에 따르면, 제2-2 보강부재(562-2b)는 제2-2 영역(562-2)과 별도 부재로 형성되어 제2-2 영역(562-2)에 부착될 수 있다. 다른 실시예(미도시)에 따르면, 제2-2 보강부재(562-2b)는 제2-2 영역(562-2)과 일체의 부재로 형성될 수 있다. 일 실시예에 따르면, 완충부재(예: 도 6 내지 도 7의 완충부재는 제1 영역의 정면(도 8b에 도시 된 면)에 배치될 수 있다. 완충부재는 보강부재에 인접 배치될 수 있다. 도 8c를 참조하면, 다양한 실시예에 따른 보강부재는 적어도 일 부분이 나머지 부분보다 돌출된 돌출부 (예: 도 7의 돌출부)를 포함할 수 있다. 일 실시예에 따르면, 돌출부는 제1 돌출부(592a)(예: 도 7의 제1 돌출부(492a)) 및/또는 제1 돌출부(592a)과 이격된 제2 돌출부(592b)(예: 도 7의 제2 돌출부 (492b))를 포함할 수 있다. 도 9는 본 개시의 다양한 실시예에 따른, 전자 장치의 벤딩부가 형성된 연성회로기판을 나타낸 사시도이다. 도 9를 참조하면, 연성회로기판은 제1 영역, 제2 영역 및/또는 연결 영역을 포함할 수 있 다. 도 9의 제1 영역, 제2 영역, 연결 영역, 완충부재 및/또는 보강부재의 구성은 도 8a 내지 도 8c의 제1 영역, 제2 영역, 연결 영역, 완충부재 및/또는 보강부재의 구성과 일부 또는 전부가 동일할 수 있다. 일 실시예에 따르면, 제1 영역의 적어도 일부는 벤딩부(561a)(예: 도 6 내지 도 7의 벤딩부)를 형성 할 수 있다. 예를 들면, 벤딩부(561a)는 적어도 일 부분이 일 방향을 향해 볼록한 형상을 가질 수 있다. 예를 들면, 벤딩부(561a)는 내측에 완충부재가 배치될 수 있다. 예를 들면, 벤딩부(561a)는 내측에 보강부재 의 적어도 일 부분이 배치될 수 있다. 일 실시예에 따르면, 제1 영역의 적어도 일부는 제1 경사부(561b)(예: 도 6a 내지 도 6b의 제1 경사부 )를 형성할 수 있다. 예를 들면, 제1 경사부(561b)는 벤딩부(561a)에 대해 임의의 각도를 가지도록 벤딩부(561a)에 연결될 수 있다. 일 실시예에 따르면, 제2-1 영역(562-1)의 적어도 일부는 제2-1 경사부(562-11)를 형성할 수 있다. 예를 들면, 제2-1 경사부(562-11)는 연결 영역에 대해 임의의 각도를 가지도록 연결 영역에 연결될 수 있다. 일 실시예에 따르면, 제2-1 영역(562-1)의 적어도 일부는 제2-1 보강부재(562-1b)가 배치될 수 있다. 일 실시예에 따르면, 제2-2 영역(562-2)의 적어도 일부는 제2-2 경사부(562-21)를 형성할 수 있다. 예를 들면, 제2-2 경사부(562-21)는 연결 영역에 대해 임의의 각도를 가지도록 연결 영역에 연결될 수 있다. 일 실시예에 따르면, 제2-2 영역(562-2)의 적어도 일부는 제2-2 보강부재(562-2b)가 배치될 수 있다. 이하, 도 8 내지 도 9를 참조하여, 연성회로기판의 제조 및/또는 조립 공정에 대해 설명한다. 도 8은 본 개시의 다양한 실시예에 따른, 벤딩부가 형성되기 전 연성회로기판에 적어도 하나 이상의 구성들이 부착 또는 결합된 상태가 도시된다. 도 9는 본 개시의 다양한 실시예에 따른, 벤딩부가 형성된 연성회로기판이 도시된다. 연성회로기판은 제1 영역의 일면에 제1 커넥터(561a)가 부착 또는 결합될 수 있다(공정 1). 연성회로 기판은 제1 영역의 상기 일면과 반대 방향을 향하는 타면에 보강부재가 부착 또는 결합될 수 있 다(공정 2). 연성회로기판은 제1 영역의 타면에 완충부재가 부착 또는 결합될 수 있다(공정 3). 연성회로기판은 제2-1 영역(562-1)의 일면에 제2-1 커넥터(562-1a)가 부착 또는 결합될 수 있다(공정 4). 연성회로기판은 제2-2 영역(562-2)의 일면에 제2-2 커넥터(562-2a)가 부착 또는 결합될 수 있다(공정 5). 연성회로기판은 제2-1 영역(562-1)의 상기 일면과 반대 방향을 향하는 타면에 제2-1 보강부재(562-1b)가 부착 또는 결합될 수 있다(공정 6). 연성회로기판은 제2-2 영역(562-2)의 상기 일면과 반대 방향을 향하는 타면에 제2-2 보강부재(562-2b)가 부착 또는 결합될 수 있다(공정 7). 일 실시예에 따르면, 전술한 공정 1 내지 공정 7은 서술된 순서대로 진행될 수 있다. 다른 실시예에 따르면, 전 술한 공정 1 내지 공정 7은 무작위의 순서대로 진행될 수 있다. 또 다른 실시예에 따르면, 전술한 공정 1 내지 공정 7은 동시에 진행될 수 있다. 연성회로기판은 제1 영역의 적어도 일부가 굴곡되어 벤딩부(561a)가 형성될 수 있다(공정 8). 연성회 로기판은 제1 영역의 적어도 일부가 굴곡되어 제1 경사부(561b)가 형성될 수 있다(공정 9). 연성회로 기판은 제2-1 영역(562-1)의 적어도 일부가 굴곡되어 제2-1 경사부(562-11)가 형성될 수 있다(공정 10). 연성회로기판은 제2-2 영역(562-2)의 적어도 일부가 굴곡되어 제2-2 경사부(562-21)가 형성될 수 있다(공 정 11). 일 실시예에 따르면, 전술한 공정 8 내지 공정 11은 서술된 순서대로 진행될 수 있다. 다른 실시예에 따르면, 전술한 공정 8 내지 공정 11은 무작위의 순서대로 진행될 수 있다. 또 다른 실시예에 따르면, 전술한 공정 8 내 지 공정 11은 동시에 진행될 수 있다. 연성회로기판은 제1 커넥터(561a)가 제1 인쇄회로기판(미도시)(예: 도 6a 내지 도 6b의 제1 인쇄회로기판 )에 전기적 및/또는 물리적으로 연결될 수 있다(공정 12). 연성회로기판은 제2-1 커넥터(562-1a)가 제2 인쇄회로기판(미도시)(예: 도 4 내지 도 4의 제2 인쇄회로기판) 또는 전기 부품(미도시)에 전기적 및/ 또는 물리적으로 연결될 수 있다(공정 13). 연성회로기판은 제2-2 커넥터(562-2a)가 전기 부품(미도시) 또 는 제2 인쇄회로기판에 전기적 및/또는 물리적으로 연결될 수 있다(공정 14). 일 실시예에 따르면, 전술한 공정 12 내지 공정 14은 서술된 순서대로 진행될 수 있다. 다른 실시예에 따르면, 전술한 공정 12 내지 공정 14은 무작위의 순서대로 진행될 수 있다. 또 다른 실시예에 따르면, 전술한 공정 12 내지 공정 14는 동시에 진행될 수 있다. 도 10은 본 개시의 다양한 실시예에 따른, 전자 장치의 연성회로기판과 인쇄회로기판이 연결된 상태를 나타낸 사시도이다. 도 10을 참조하면, 전자 장치는 제2 지지부재, 키 입력 장치, 배터리, 제1 인쇄회로기판 , 연성회로기판, 완충부재 및/또는 보강부재를 포함할 수 있다.도 10의 제2 지지부재의 구성은 도 4의 제2 지지부재의 구성과 일부 또는 전부가 동일할 수 있다. 도 10의 키 입력 장치의 구성은 도 2 내지 도 3의 키 입력 장치의 구성과 일부 또는 전부가 동일할 수 있다. 도 10의 배터리 및/또는 제1 인쇄회로기판의 구성은 도 4의 배터리 및/또는 제1 인쇄회로 기판의 구성과 일부 또는 전부가 동일할 수 있다. 도 10의 연성회로기판의 구성은 도 6 내지 도 7의 연성회로기판의 구성과 일부 또는 전부가 동일할 수 있다. 도 10의 완충부재의 구성은 도 6a 내지 도 6b의 완충부재의 구성과 일부 또는 전부가 동일할 수 있다. 도 10의 보강부재의 구성은 도 7의 보강 부재의 구성과 일부 또는 전부가 동일할 수 있다. 다양한 실시예에 따르면, 연성회로기판은 벤딩부, 제1 경사부 및/또는 제3 평면부를 포함 할 수 있다. 일 실시예에 따르면, 벤딩부는 제1 평면부(661a)(예: 도 6a 내지 도 6b의 제1 평면부(461a)), 굴곡부 (661b)(예: 도 6a 내지 도 6b의 굴곡부(461b)) 및/또는 제2 평면부(661c)(예: 도 6a 내지 도 6b의 제2 평면부 (461c))를 포함할 수 있다. 일 실시예에 따르면, 제1 평면부(661a)는 제1 인쇄회로기판과 전기적 및/또는 물리적으로 연결되기 위한 제1 커넥터(미도시)(예: 도 6a 내지 도 6b의 제1 커넥터(461a-1))를 포함할 수 있다. 일 실시예에 따르면, 제1 경사부(예: 도 6a 내지 도 6b의 제1 경사부)는 적어도 일 부분이 전기 부품 (예: 배터리)과 마주할 수 있다. 일 실시예에 따르면, 제1 경사부는 제2 평면부(661c)에 대해 임의의 각도를 가지도록 경사지게 배치될 수 있다. 일 실시예에 따르면, 제3 평면부(예: 도 6a 내지 도 6b의 제3 평면부)는 제1 경사부로부터 제2 지지부재를 향해 연장되도록 배치될 수 있다. 일 실시예에 따르면, 제3 평면부는 키 입력 장치 과 전기적으로 연결된 제2 인쇄회로기판(미도시)(예: 도 4 내지 도 4의 제2 인쇄회로기판)과 전기적 및/또 는 전기적으로 연결될 수 있다. 다른 실시예에 따르면, 제3 평면부는 키 입력 장치와 직접적으로 연 결될 수 있다. 일 실시예에 따르면, 보강부재(예: 도 6a 내지 도 6b의 보강부재)는 적어도 일 부분이 제1 평면부 (661a)와 제2 평면부(661c) 사이에 배치될 수 있다. 예를 들면, 보강부재는 제1 평면부(661a)의 일면(예: 제2 평면부(661c)와 마주하는 면)에 배치될 수 있다. 일 실시예에 따르면, 보강부재는 적어도 일 부분이 하우징(미도시)(예: 도 6a 내지 도 6b의 제2 하우징)를 지지하는 돌출부(예: 도 7의 돌출부)를 포함할 수 있다. 일 실시예에 따르면, 돌출부는 제1 돌출부(692a)(예: 도 7의 제1 돌출부(492a)) 및 제1 돌출부(692a)와 이격된 제2 돌출부(692b)(예: 도 7의 제2 돌출부(492b))를 포함할 수 있다. 일 실시예에 따르면, 완충부재(예: 도 6a 내지 도 6b의 완충부재)는 제1 평면부(661a)의 일면(예: 제 2 평면부(661c)와 마주하는 면)에 배치될 수 있다. 다른 실시예(미도시)에 따르면, 완충부재는 제2 평면부 (661c)의 일면(예: 제1 평면부(661a)와 마주하는 면)에 배치될 수 있다. 또 다른 실시예에 따르면, 완충부재 은 보강부재의 일면(예: 굴곡부(662b)와 마주하는 면)에 배치될 수 있다. 도 10을 참조하면, 본 개시의 전자 장치는, 키 입력 장치의 사용 및/또는 전기 부품(예: 배터리 )의 거동에 의해 연성회로기판에 대해 외력이 작용하는 경우에도, 연성회로기판의 굴곡부(661b) 및/또는 제1 평면부(661a)의 적어도 일 부분이 굴곡되고, 이에 따라 제1 커넥터(미도시)가 제1 인쇄회로기판 로부터 이탈되는 것이 제한될 수 있다. 도 11a는 본 개시의 다양한 실시예에 따른, 전자 장치의 전기 부품과 연성회로기판이 연결된 상태를 나타낸 사 시도이며, 도 11b는 본 개시의 다양한 실시예에 따른, 도 11a의 C-C'선을 절개한 단면도이다. 도 11a 내지 도 11b를 참조하면, 다양한 실시예에 따른 전자 장치(예: 도 1 내지 도 4의 전자 장치) 는 전기 부품, 제2 지지부재, 연성회로기판, 완충부재 및/또는 보강부재를 포함할 수 있다. 도 11a 내지 도 11b의 제2 지지부재의 구성은 도 4 내지 도 4의 제2 지지부재의 구성과 일부 또는 전 부가 동일할 수 있다. 도 11a 내지 도 11b의 연성회로기판의 구성은 도 6 내지 도 7의 연성회로기판 의 구성과 일부 또는 전부가 동일할 수 있다. 도 11a 내지 도 11b의 완충부재의 구성은 도 6a 내지 도 6b 의 완충부재의 구성과 일부 또는 전부가 동일할 수 있다. 도 11a 내지 도 11b의 보강부재의 구성은 도 7의 보강부재의 구성과 일부 또는 전부가 동일할 수 있다.다양한 실시예에 따르면, 연성회로기판은 벤딩부 및/또는 제3 평면부를 포함할 수 있다. 일 실시예에 따르면, 벤딩부는 제1 평면부(761a)(예: 도 6a 내지 도 6b의 제1 평면부(461a)), 굴곡부 (761b)(예: 도 6a 내지 도 6b의 굴곡부(461b)) 및/또는 제2 평면부(761c)(예: 도 6a 내지 도 6b의 제2 평면부 (461c))를 포함할 수 있다. 일 실시예에 따르면, 제1 평면부(761a)는 제1 인쇄회로기판(미도시)(예: 도 4 내지 도 4의 제1 인쇄회로기판)과 전기적 및/또는 물리적으로 연결되기 위한 제1 커넥터(761a-1)를 포함할 수 있다. 일 실시예에 따르면, 제3 평면부는 제2 평면부(761c)로부터 연장되어 전기 부품(예: 카메라)에 연결 될 수 있다. 일 실시예에 따르면, 전기 부품(예: 카메라)은 제2 지지부재에 의해 지지될 수 있다. 일 실시예에 따 르면, 카메라(예: 도 1의 카메라 모듈)는 연성회로기판과 전기적 및/또는 물리적으로 연결될 수 있다. 다른 실시예(미도시)에 따르면, 카메라는 제2 인쇄회로기판(미도시)(예: 도 4 내지 도 5의 제2 인쇄 회로기판)를 통해 연성회로기판과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 보강부재(예: 도 6a 내지 도 6b의 보강부재)는 적어도 일 부분이 제1 평면부 (761a)와 제2 평면부(761c) 사이에 배치될 수 있다. 예를 들면, 보강부재는 제1 평면부(761a)의 일면(예: 제2 평면부(761c)와 마주하는 면)에 배치될 수 있다. 일 실시예에 따르면, 보강부재는 적어도 일 부분이 하우징(미도시)(예: 도 6a 내지 도 6b의 제1 하우징)를 지지하는 돌출부(미도시)(예: 도 7의 돌출부(49 2))를 포함할 수 있다. 일 실시예에 따르면, 완충부재(예: 도 6a 내지 도 6b의 완충부재)는 제1 평면부(761a)의 일면(예: 제 2 평면부(761c)와 마주하는 면)에 배치될 수 있다. 다른 실시예(미도시)에 따르면, 완충부재는 제2 평면부 (761c)의 일면(예: 제1 평면부(761a)와 마주하는 면)에 배치될 수 있다. 또 다른 실시예에 따르면, 완충부재 은 보강부재의 일면(예: 굴곡부(762b)와 마주하는 면)에 배치될 수 있다. 도 11를 참조하면, 본 개시의 전자 장치는, 전기 부품(예: 카메라)의 거동에 의해 연성회로기판(76 0)에 대해 외력이 작용하는 경우에도, 연성회로기판의 굴곡부(761b) 및/또는 제1 평면부(761a)의 적어도 일 부분이 굴곡되고, 이에 따라 제1 커넥터(761a-1)가 제1 인쇄회로기판으로부터 이탈되는 것이 제한될 수 있다. 도 12는 본 개시의 다양한 실시예에 따른, 전자 장치의 보강부재, 돌출부 및 부착부재를 나타낸 분해 사시도이 다. 도 12의 연성회로기판, 완충부재 및/또는 보강부재의 구성은 도 8a 내지 도 8c의 연성회로기판 , 완충부재 및/또는 보강부재의 구성과 일부 또는 전부가 동일할 수 있다. 다양한 실시예에 따르면, 완충부재 및/또는 보강부재은 연성회로기판의 제1 영역(예: 도 8a 내지 도 8c의 제1 영역)의 일면에 배치될 수 있다. 일 실시예에 따르면, 돌출부재는 보강부재의 일면(예: 보강부재 중 제1 영역과 결합된 면 과 반대 방향을 향하는 면)에 결합될 수 있다. 일 실시예에 따르면, 돌출부재는 적어도 일 부분이 하우징 (미도시)(예: 도 6a 내지 도 6b의 제2 하우징)를 지지하는 제1 돌출부(881a)(예: 도 7의 제1 돌출부 (492a)) 및/또는 제1 돌출부(881a)와 이격된 제2 돌출부(881b)(예: 도 7의 제2 돌출부(492b))를 포함할 수 있 다. 일 실시예에 따르면, 돌출부재는 부착부재를 통해 보강부재의 일면에 결합될 수 있다. 예를 들면, 부착부재는 테이프(tape)를 포함할 수 있다. 다른 예를 들면, 부착부재는 보강부재와 돌 출부재를 부착시키는 다양한 부재를 포함할 수 있다. 도 13은 본 개시의 다양한 실시예에 따른, 전자 장치의 인쇄회로기판, 보강부재 및 연성회로기판의 배치 관계를 나타낸 단면도이다. 도 13를 참조하면, 전자 장치(예: 도 1 내지 도 4의 전자 장치)는 하우징, 제1 인쇄회로기판 , 연성회로기판, 보강부재 및/또는 돌출부재를 포함할 수 있다.도 13의 하우징의 구성은 도 6a 내지 도 6b의 하우징의 구성과 일부 또는 전부가 동일할 수 있다. 도 13의 제1 인쇄회로기판의 구성은 도 6a 내지 도 6b의 제1 인쇄회로기판의 구성과 일부 또는 전부가 동일할 수 있다. 도 13의 보강부재의 구성은 도 12의 보강부재의 구성과 일부 또는 전부가 동일할 수 있다. 다양한 실시예에 따르면, 연성회로기판은 벤딩부를 포함할 수 있다. 일 실시예에 따르면, 벤딩부는 제1 평면부(961a)(예: 도 6a 내지 도 6b의 제1 평면부(461a), 굴곡부(미도 시)(예: 도 6a 내지 도 6b의 굴곡부(461b)) 및/또는 제2 평면부(961c)(예: 도 6a 내지 도 6b의 제2 평면부 (461c))를 포함할 수 있다. 일 실시예에 따르면, 제1 평면부(961a)는 제1 인쇄회로기판(예: 도 6a 내지 도 6b의 제1 인쇄회로기판)의 제3 커넥터(941a)(예: 도 6a 내지 도 6b의 제3 커넥터(441a))와 전기적 및/또는 물리적으로 연결되기 위한 제1 커넥터(961a-1)(예: 도 6a 내지 도 6b의 제1 커넥터(461a-1))를 포함할 수 있다. 일 실시예에 따르면, 하우징은 제1 하우징(예: 도 6a 내지 도 6b의 제1 하우징) 및/또는 제1 하 우징과 이격된 제2 하우징(예: 도 6a 내지 도 6b의 제2 하우징)를 포함할 수 있다. 일 실시예에 따르면, 제1 하우징은 적어도 일 부분이 제1 인쇄회로기판 및/또는 보강부재를 지지하는 지지부 재(921a)(예: 도 6a 내지 도 6b의 지지부재(421a))를 포함할 수 있다. 일 실시예에 따르면, 지지부재(921a)는 제1 영역 지지부재(921a-1) 및/또는 제1 영역 지지부재(921a-1)와 이격된 제2 영역 지지부재(921a-2)를 포함할 수 있다. 일 실시예에 따르면, 보강부재는 적어도 일 부분이 제1 평면부(961a)와 제2 평면부(961c) 사이에 배치될 수 있다. 예를 들면, 보강부재는 적어도 일 부분이 제1 평면부(961a)의 일면(예: 제2 평면부(961c)와 마주 하는 면)에 배치될 수 있다. 일 실시예에 따르면, 돌출부재는 보강부재가 지지부재에 고정되도록 보강부재를 관통하여 지지부재에 결합될 수 있다. 일 실시예에 따르면, 돌출부재는 적어도 일 부분이 제2 하우징을 지지할 수 있다. 일 실시예에 따르면, 돌출부재는 보강부재의 일 영역이 제1 영역 지지부재(921a- 1)에 고정되도록 하는 제1 돌출부재(980a) 및/또는 보강부재의 타 영역이 제2 영역 지지부재(921a-2)에 고 정되도록 하는 제2 돌출부재(980b)를 포함할 수 있다. 예를 들면, 제1 돌출부재(980a) 및/또는 제2 돌출부재 (980b)는 볼트를 포함할 수 있다. 다른 예를 들면, 제1 돌출부재(980a) 및/또는 제2 돌출부재(980b)는 핀을 포 함할 수 있다. 또 다른 예를 들면, 제1 돌출부재(980a) 및/또는 제2 돌출부재(980b)는 보강부재가 지지부 재에 고정되도록 하는 다양한 부재를 포함할 수 있다. 일 실시예에 따르면, 연성회로기판의 적어도 일 부분(예: 제2 평면부(961c))은 제2 하우징, 돌출부재 및/또는 보강부재가 형성하는 유동공간(예: 도 7의 유동공간(490a))에서 거동할 수 있는 공간이 확 보될 수 있다. 본 개시의 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 전자 장치)는 하우징(예: 도 6a 내지 도 6b의 하우징), 상기 하우징 내에 배치된 제1 인쇄회로기판(예: 도 4의 제1 인쇄회로기판), 상기 하우징 내 에 배치된 제2 인쇄회로기판(예: 도 4의 제2 인쇄회로기판), 상기 제1 인쇄회로기판과 상기 제2 인쇄회로 기판을 전기적으로 연결하는 연성회로기판(예: 도 6a 내지 도 6b의 연성회로기판)으로서, 상기 제1 인쇄회 로기판에 연결되는 제1 커넥터(예: 도 6a 내지 도 6b의 제1 커넥터(461a-1)), 상기 제2 인쇄회로기판에 연결되 는 제2 커넥터(예: 도 8a 내지 도 8c의 제2-1 커넥터(562-1a) 또는 제2-2 커넥터(562-2a)) 및 상기 제1 커넥터 로부터 상기 제2 인쇄회로기판과 멀어지는 방향으로 연장되다가 상기 제2 인쇄회로기판을 향해 굴곡되어 연장되 는 벤딩부(예: 도 6a 내지 도 6b의 벤딩부)를 포함하는 연성회로기판, 상기 하우징 내에 배치되고, 적어도 일 부분이 상기 연성회로기판과 마주하는 전기 부품(예: 도 6a 내지 도 6b의 배터리 모듈) 및 상기 벤딩부 의 일 부분(예: 도 6a 내지 도 6b의 제1 평면부(461a))과 상기 벤딩부의 일 부분과 마주하는 상기 벤딩부의 타 부분(예: 도 6a 내지 도 6b의 제2 평면부(461c)) 사이에 배치된 완충부재(예: 도 7의 완충부재)를 포함할 수 있다. 다양한 실시예들에 따르면, 상기 연성회로기판 중 상기 제1 커넥터가 결합된 면의 반대 면에 결합된 보강부재로 서, 적어도 일 부분이 상기 하우징을 지지하는 돌출부(예: 도 7의 돌출부)를 포함하는 보강부재(예: 도 7 의 보강부재)를 더 포함할 수 있다.다양한 실시예들에 따르면, 상기 돌출부의 두께는 상기 연성회로기판의 두께보다 클 수 있다. 다양한 실시예들에 따르면, 상기 돌출부는 제1 돌출부(예: 도 7의 제1 돌출부(492a)) 및 상기 제1 돌출부와 상 기 하우징의 폭 방향으로 이격된 제2 돌출부(예: 도 7의 제2 돌출부(492b))를 포함하고, 상기 제1 돌출부 및 상 기 제2 돌출부의 이격 거리(예: 도 7의 이격 거리(s2))는 상기 연성회로기판의 폭(예: 도 7의 폭(w1))보다 클 수 있다. 다양한 실시예들에 따르면, 상기 벤딩부는 상기 제1 커넥터로부터 상기 제2 인쇄회로기판과 멀어지는 방향으로 연장되는 제1 평면부(예: 도 6a 내지 도 6b의 제1 평면부(461a)), 상기 제1 평면부로부터 상기 제2 인쇄회로기 판을 향해 굴곡된 굴곡부(예: 도 6a 내지 도 6b의 굴곡부(461b)) 및 상기 굴곡부로부터 상기 제2 인쇄회로기판 을 향해 연장되는 제2 평면부(예: 도 6a 내지 도 6b의 제2 평면부(461c))를 포함할 수 있다. 다양한 실시예들에 따르면, 상기 완충부재는 상기 제1 평면부 및 상기 제2 평면부 중 어느 하나에 배치될 수 있 다. 다양한 실시예들에 따르면, 상기 제2 평면부는 상기 제1 평면부와 실질적으로 평행할 수 있다. 다양한 실시예들에 따르면, 상기 벤딩부는 상기 제1 커넥터로부터 상기 제2 인쇄회로기판과 멀어지는 방향으로 연장되는 제1 평면부, 상기 제1 평면부로부터 상기 제2 인쇄회로기판을 향해 굴곡된 굴곡부 및 상기 굴곡부로부 터 상기 제2 인쇄회로기판을 향해 연장되는 제2 평면부를 포함하고, 상기 완충부재는 상기 보강부재 중 상기 굴 곡부를 향하는 부위에 배치될 수 있다. 다양한 실시예들에 따르면, 상기 전기 부품은 배터리(예: 도 6a 내지 도 6b의 배터리 모듈) 및 카메라(예: 도 11a 내지 도 11b의 카메라) 중 적어도 어느 하나를 포함할 수 있다. 다양한 실시예들에 따르면, 상기 완충부재의 높이(예: 도 6a 내지 도 6b의 높이(h1))는 상기 제1 평면부와 상기 제2 평면부의 이격 거리(예: 도 6a 내지 도 6b의 이격 거리(s1))보다 작을 수 있다. 다양한 실시예들에 따르면, 상기 돌출부는 상기 보강부재와 일체로 형성될 수 있다. 다양한 실시예들에 따르면, 상기 돌출부는 상기 보강부재와 별도로 형성될 수 있다. 다양한 실시예들에 따르면, 상기 돌출부는 부착부재(예: 도 12의 부착부재)를 통해 상기 보강부재에 결합 될 수 있다. 다양한 실시예들에 따르면, 상기 돌출부는 상기 보강부재를 관통하여 상기 하우징에 결합될 수 있다. 다양한 실시예들에 따르면, 상기 연성회로기판은 상기 전기 부품과 멀어지는 방향으로 상기 제2 평면부로부터 연장되는 제1 경사부(예: 도 6a 내지 도 6b의 제1 경사부) 및 상기 제1 경사부로부터 상기 제2 인쇄회로기 판을 향해 연장되는 제3 평면부(예: 도 6a 내지 도 6b의 제3 평면부)를 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 전자 장치)는 하우징(예: 도 6a 내지 도 6b의 하우징), 상기 하우징 내에 배치된 제1 인쇄회로기판(예: 도 6a 내지 도 6b의 제1 인쇄회로기판), 상 기 제1 인쇄회로기판과 전기적으로 연결된 연성회로기판(예: 도 6a 내지 도 6b의 연성회로기판)으로서, 상 기 제1 인쇄회로기판에 결합되는 제1 커넥터(예: 도 6a 내지 도 6b의 제1 커넥터(461a-1)) 및 상기 제1 커넥터 로부터 일 방향으로 연장되다가 상기 일 방향과 반대 방향인 타 방향을 향해 굴곡되어 연장되는 벤딩부(예: 도 6a 내지 도 6b의 벤딩부)를 포함하는 연성회로기판, 상기 하우징 내에 배치되고, 적어도 일 부분이 상기 연성회로기판과 마주하는 전기 부품(예: 도 6a 내지 도 6b의 배터리 모듈), 상기 연성회로기판 중 상기 제 1 커넥터가 결합된 면의 반대 면에 결합된 보강부재(예: 도 7의 보강부재)로서, 적어도 일 부분이 상기 하 우징을 지지하는 돌출부(예: 도 7의 돌출부)를 포함하는 보강부재 및 상기 벤딩부의 내측에 배치되고, 상 기 보강부재와 인접 배치된 완충부재(예: 도 6a 내지 도 6b의 완충부재)를 포함할 수 있다. 다양한 실시예들에 따르면, 상기 보강부재는 제1 방향을 향하는 제1 면, 상기 제1 방향과 반대 방향인 제2 방향 을 향하는 제2 면 및 상기 제1 면 중 적어도 일 부분에서 상기 제2 방향을 향해 함몰 형성되는 유동공간(예: 도 7의 유동공간(490a))을 포함하고, 상기 유동공간의 깊이는 상기 연성회로기판의 두께보다 클 수 있다. 다양한 실시예들에 따르면, 상기 유동공간의 폭은 상기 연성회로기판의 폭보다 클 수 있다. 다양한 실시예들에 따르면, 상기 벤딩부는 상기 제1 커넥터로부터 일 방향을 향해 연장되는 제1 평면부(예: 도 6a 내지 도 6b의 제1 평면부(461a)), 상기 제1 평면부로부터 상기 일 방향과 반대 방향인 타 방향을 향해 굴곡된 굴곡부(예: 도 6a 내지 도 6b의 굴곡부(461b)) 및 상기 굴곡부로부터 상기 타 방향을 향해 연장되는 제2 평 면부(예: 도 6a 내지 도 6b의 제2 평면부(461c))를 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 전자 장치(예: 도 1의 전자 장치)는 하우징(예: 도 6a 내지 도 6b의 하우징), 상기 하우징 내에 배치된 제1 인쇄회로기판(예: 도 6a 내지 도 6b의 제1 인쇄회로기판), 상 기 제1 인쇄회로기판과 전기적으로 연결된 연성회로기판(예: 도 6a 내지 도 6b의 연성회로기판)으로서, 상 기 제1 인쇄회로기판과 연결되는 제1 커넥터(예: 도 6a 내지 도 6b의 제1 커넥터(461a-1)), 상기 제1 커넥터로 부터 일 방향으로 연장되다가 상기 일 방향과 반대 방향인 타 방향을 향해 굴곡되어 연장되는 벤딩부(예: 도 6a 내지 도 6b의 벤딩부)를 포함하는 연성회로기판, 상기 제1 인쇄회로기판과 인접 배치되고, 적어도 일 부분 이 상기 연성회로기판과 마주하는 전기 부품(예: 도 6a 내지 도 6b의 배터리 모듈) 및 상기 벤딩부의 내측 에 배치되는 완충부재(예: 도 6a 내지 도 6b의 완충부재)를 포함하고, 상기 벤딩부는 상기 제1 커넥터로부 터 상기 제1 인쇄회로기판과 실질적으로 평행하게 연장되는 제1 평면부(예: 도 6a 내지 도 6b의 제1 평면부 (461a)), 상기 제1 평면부로부터 상기 제1 커넥터를 향해 굴곡되어 연장되는 굴곡부(예: 도 6a 내지 도 6b의 굴 곡부(461b)) 및 상기 굴곡부로부터 상기 제1 인쇄회로기판과 실질적으로 평행하게 연장되는 제2 평면부(예: 도 6a 내지 도 6b의 제2 평면부(461c))를 포함할 수 있다. 이상, 본 문서의 상세한 설명에서는 구체적인 실시 예에 관해서 설명하였으나, 본 문서의 범위에서 벗어나지 않 는 한도 내에서 여러 가지 변형이 가능함은 당해 분야에서 통상의 지식을 가진 자에게 있어서 자명하다 할 것이다."}
{"patent_id": "10-2021-0161246", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2는 본 개시의 다양한 실시예에 따른, 전자 장치의 전면 사시도이다. 도 3은 본 개시의 다양한 실시예에 따른, 전자 장치의 후면 사시도이다. 도 4는 본 개시의 다양한 실시예에 따른, 전자 장치의 후면 분해도이다. 도 5는 본 개시의 다양한 실시예에 따른, 전자 장치의 인쇄회로기판, 연성회로기판 및 전기 부품의 배치관계를 나타낸 후면도이다. 도 6a는 본 개시의 다양한 실시예에 따른, 도 5의 A-A' 선을 절개한 단면도이고, 연성회로기판의 벤딩부가 변형 되기 전 상태를 나타낸 도면이다. 도 6b는 본 개시의 다양한 실시예에 따른, 도 5의 A-A' 선을 절개한 단면도이고, 연성회로기판의 벤딩부가 변형 된 후 상태를 나타낸 도면이다. 도 7은 본 개시의 다양한 실시예에 따른, 도 5의 B-B' 선을 절개한 단면도이다. 도 8a는 본 개시의 다양한 실시예에 따른, 전자 장치의 벤딩부가 형성되기 전 연성회로기판을 나타낸 정면도이 다. 도 8b는 본 개시의 다양한 실시예에 따른, 전자 장치의 벤딩부가 형성되기 전 연성회로기판을 나타낸 후면도이 다. 도 8c는 본 개시의 다양한 실시예에 따른, 전자 장치의 벤딩부가 형성되기 전 연성회로기판을 나타낸 후면 사시 도이다. 도 9는 본 개시의 다양한 실시예에 따른, 전자 장치의 벤딩부가 형성된 연성회로기판을 나타낸 사시도이다. 도 10은 본 개시의 다양한 실시예에 따른, 전자 장치의 연성회로기판과 인쇄회로기판이 연결된 상태를 나타낸 사시도이다. 도 11a는 본 개시의 다양한 실시예에 따른, 전자 장치의 전기 부품과 연성회로기판이 연결된 상태를 나타낸 사 시도이다. 도 11b는 본 개시의 다양한 실시예에 따른, 도 11a의 C-C' 선을 절개한 단면 사시도이다. 도 12는 본 개시의 다양한 실시예에 따른, 전자 장치의 보강부재, 돌출부 및 부착부재를 나타낸 분해 사시도이 다. 도 13은 본 개시의 다양한 실시예에 따른, 전자 장치의 인쇄회로기판, 보강부재 및 연성회로기판의 배치 관계를 나타낸 단면도이다."}
