{"patent_id": "10-2019-7024214", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0130560", "출원번호": "10-2019-7024214", "발명의 명칭": "진보된 무선 통신 시스템에서의 비균등 비트 할당을 기반으로 하는 고해상 CSI 보고", "출원인": "삼성전자주식회사", "발명자": "라흐만 엠디 사이푸르"}}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말(UE)로서,(ⅰ) 보고를 위해 구성된 복수의 부대역에 대해 공통인 광대역 진폭 계수 표시자 및 (ⅱ) 부대역 진폭 계수 표시자 및 상기 부대역 각각에 대한 부대역 위상 계수 표시자를 포함하는 프리코딩 매트릭스 표시자(PMI)에 대한보고를 생성하도록 구성된 프로세서; 및기지국에 생성된 상기 PMI에 대한 보고를 전송하도록 구성되어 상기 프로세서에 작동 가능하게 연결된 송수신기를 포함하는 UE."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 보고는 상기 부대역 각각에 대해 및 복수의 υ 계층 각각에 대해 2*L개의 빔 계수를 포함하고,하나 이상의 상기 빔 계수 각각은 (ⅰ) 상기 부대역에 대해 공통인 상기 광대역 진폭 계수 표시자 및 (ⅱ) 상기부대역 진폭 계수 표시자 및 상기 부대역 각각에 대한 부대역 위상 계수 표시자를 포함하고,상기 빔 계수 중 적어도 하나의 빔 계수는 상기 빔 계수 중 다른 하나의 빔 계수를 보고하기 위해 사용된 비트수와 동일하지 않은 비트 수를 사용하여 보고되고,L은 보고를 위해 구성된 빔의 개수이고,υ는 상기 보고된 PMI와 관련된 랭크 표시자(RI)인 UE."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 프로세서는상기 보고에, 상기 υ 계층 각각에 대해, 상기 부대역에 대해 공통인 상기 2*L개의 빔 계수 중 가장 강한 빔 계수를 포함하고,상기 나머지 2*L-1개의 빔 계수를 2개의 그룹으로 그룹화하도록 구성되고,상기 2개의 그룹 중 제2 그룹의 상기 빔 계수를 보고하기 위해 사용되는 비트 수는 상기 2개의 그룹 중 제1 그룹의 상기 빔 계수를 보고하기 위해 사용되는 비트 수보다 적은 UE."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 제1 그룹은 min(M,K)-1개의 빔 계수를 포함하고,상기 제2 그룹은 2L-min(M,K)개의 빔 계수를 포함하고,상기 제1 그룹은 상기 나머지 2*L-1개의 빔 계수 중 가장 강한 계수를 포함하고,상기 보고는 상기 제2 그룹의 빔 계수에 대한 부대역 진폭 계수 표시자를 포함하지 않고,M은 광대역 진폭 계수가 0이 아닌 광대역 진폭 값을 표시하는 빔 계수의 개수이고,K는 양의 정수인 UE."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,공개특허 10-2019-0130560-3-상기 제1 그룹의 빔 계수 각각에 대해:3 비트는 상기 광대역 진폭 계수 표시자를 보고하기 위해 사용되고,1 비트는 상기 부대역 진폭 계수 표시자를 보고하기 위해 사용되고,2 비트 또는 3 비트는 상기 부대역 위상 계수 표시자를 보고하도록 구성되고,상기 제2 그룹에 대해:빔 계수 각각에 대해, 3 비트는 상기 광대역 진폭 계수 표시자를 보고하기 위해 사용되고,광대역 진폭 계수 표시자가 0이 아닌 광대역 진폭 값을 표시하는 상기 M-min(M,K)개의 빔 계수 각각에 대해, 2비트는 상기 부대역 위상 계수 표시자를 보고하기 위해 사용되고,광대역 진폭 계수 표시자가 0인 광대역 진폭 값을 표시하는 상기 나머지 2L-M개의 빔 계수에 대해, 부대역 위상계수 표시자는 보고되지 않고,K는 다음에 따라 L을 기반으로 하여 결정되고,상기 나머지 2*L-1개의 빔 계수를 상기 2개의 그룹으로 그룹화하기 위해 사용된 상기 가장 강한 계수는 상기 빔계수 각각에 대한 상기 광대역 진폭 계수 표시자를 기반으로 하여 결정되는 UE."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서, 상기 부대역 진폭 계수 표시자(k)에 의해 표시된 상기 부대역 진폭의 값(p)은 다음에 따라 결정되는 UE."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "기지국(BS)으로서,(ⅰ) 보고를 위해 구성된 복수의 부대역에 대해 공통인 광대역 진폭 계수 표시자 및 (ⅱ) 부대역 진폭 계수 표시자 및 상기 부대역 각각에 대한 부대역 위상 계수 표시자를 포함하는 프리코딩 매트릭스 표시자(PMI)에 대한보고를 수신하도록 구성된 송수신기; 및상기 송수신기에 작동 가능하게 연결된 프로세서를 포함하는 BS."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 보고는 상기 부대역 각각에 대해 및 복수의 υ 계층 각각에 대해 2*L개의 빔 계수를 포함하고,하나 이상의 상기 빔 계수 각각은 (ⅰ) 상기 부대역에 대해 공통인 상기 광대역 진폭 계수 표시자 및 (ⅱ) 상기공개특허 10-2019-0130560-4-부대역 진폭 계수 표시자 및 상기 부대역 각각에 대한 부대역 위상 계수 표시자를 포함하고,상기 빔 계수 중 적어도 하나의 빔 계수는 상기 빔 계수 중 다른 하나의 빔 계수를 보고하기 위해 사용된 비트수와 동일하지 않은 비트 수를 사용하여 보고되고,L은 보고를 위해 구성된 빔의 개수이고,υ는 상기 보고된 PMI와 관련된 랭크 표시자(RI)인 BS."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 υ 계층 각각에 대해, 상기 부대역에 대해 공통인 상기 2*L개의 빔 계수 중 가장 강한 빔 계수가 상기 보고에 포함되고,상기 나머지 2*L-1개의 빔 계수는 2개의 그룹에서 보고되고,상기 2개의 그룹 중 제2 그룹의 상기 빔 계수를 보고하기 위해 사용되는 비트 수는 상기 2개의 그룹 중 제1 그룹의 상기 빔 계수를 보고하기 위해 사용되는 비트 수보다 적은 BS."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 제1 그룹은 min(M,K)-1개의 빔 계수를 포함하고,상기 제2 그룹은 2L-min(M,K)개의 빔 계수를 포함하고,상기 제1 그룹은 상기 나머지 2*L-1개의 빔 계수 중 가장 강한 계수를 포함하고,상기 보고는 상기 제2 그룹의 빔 계수에 대한 부대역 진폭 계수 표시자를 포함하지 않고,M은 광대역 진폭 계수 표시자가 0이 아닌 광대역 진폭 값을 표시하는 빔 계수의 개수이고,K는 양의 정수인 BS."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서,상기 제1 그룹의 빔 계수 각각에 대해:3 비트는 상기 광대역 진폭 계수 표시자를 보고하기 위해 사용되고,1 비트는 상기 부대역 진폭 계수 표시자를 보고하기 위해 사용되고,2 비트 또는 3 비트는 상기 부대역 위상 계수 표시자를 보고하도록 구성되고,상기 제2 그룹에 대해:빔 계수 각각에 대해, 3 비트는 상기 광대역 진폭 계수 표시자를 보고하기 위해 사용되고,광대역 진폭 계수 표시자가 0이 아닌 광대역 진폭 값을 표시하는 상기 M-min(M,K)개의 빔 계수 각각에 대해, 2비트는 상기 부대역 위상 계수 표시자를 보고하기 위해 사용되고,광대역 진폭 계수 표시자가 0인 광대역 진폭 값을 표시하는 상기 나머지 2L-M개의 빔 계수에 대해, 부대역 위상계수 표시자는 보고되지 않고,공개특허 10-2019-0130560-5-K는 다음에 따라 L을 기반으로 하여 결정되고,상기 나머지 2*L-1개의 빔 계수를 상기 2개의 그룹으로 그룹화하기 위해 사용된 상기 가장 강한 계수는 상기 빔계수 각각에 대한 상기 광대역 진폭 계수 표시자를 기반으로 하여 결정되는 BS."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7 항에 있어서, 상기 부대역 진폭 계수 표시자(k)에 의해 표시된 상기 부대역 진폭의 값(p)은 다음에 따라 결정되는 BS."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "사용자 단말(UE)에 의해 프리코딩 매트릭스 표시자(PMI)를 보고하기 위한 방법으로서, 상기 방법은(ⅰ) 보고를 위해 구성된 복수의 부대역에 대해 공통인 광대역 진폭 계수 표시자 및 (ⅱ) 부대역 진폭 계수 표시자 및 상기 부대역 각각에 대한 부대역 위상 계수 표시자를 포함하는 상기 PMI에 대한 보고를 생성하는 단계;및기지국에 생성된 상기 PMI에 대한 보고를 전송하는 단계를 포함하는 방법."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 보고는 상기 부대역 각각에 대해 및 복수의 υ 계층 각각에 대해 2*L개의 빔 계수를 포함하고,하나 이상의 상기 빔 계수 각각은 (ⅰ) 상기 부대역에 대해 공통인 상기 광대역 진폭 계수 표시자 및 (ⅱ) 상기부대역 진폭 계수 표시자 및 상기 부대역 각각에 대한 부대역 위상 계수 표시자를 포함하고,상기 빔 계수 중 적어도 하나의 빔 계수는 상기 빔 계수 중 다른 하나의 빔 계수를 보고하기 위해 사용된 비트수와 동일하지 않은 비트 수를 사용하여 보고되고,L은 보고를 위해 구성된 빔의 개수이고,υ는 상기 보고된 PMI와 관련된 랭크 표시자(RI)인 방법."}
{"patent_id": "10-2019-7024214", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서, 상기 보고를 생성하는 단계는상기 보고에, 상기 υ 계층 각각에 대해, 상기 부대역에 대해 공통인 상기 2*L개의 빔 계수 중 가장 강한 빔 계수를 포함하는 단계, 및상기 나머지 2*L-1개의 빔 계수를 2개의 그룹으로 그룹화하는 단계를 더 포함하고,공개특허 10-2019-0130560-6-상기 2개의 그룹 중 제2 그룹의 상기 빔 계수를 보고하기 위해 사용되는 비트 수는 상기 2개의 그룹 중 제1 그룹의 상기 빔 계수를 보고하기 위해 사용되는 비트 수보다 적고,상기 제1 그룹은 min(M,K)-1개의 빔 계수를 포함하고,상기 제2 그룹은 2L-min(M,K)개의 빔 계수를 포함하고,상기 제1 그룹은 상기 나머지 2*L-1개의 빔 계수 중 가장 강한 계수를 포함하고,상기 보고는 상기 제2 그룹의 빔 계수에 대한 부대역 진폭 계수 표시자를 포함하지 않고,M은 광대역 진폭 계수 표시자가 0이 아닌 광대역 진폭 값을 표시하는 빔 계수의 개수이고,K는 양의 정수인 방법."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사물 인터넷(IoT) 기술과 제4 세대(4G) 시스템 이후의 더 높은 데이터율을 지원하기 위한 제5 세대 (5G) 통신 시스템을 융합하기 위한 통신 방법 및 시스템에 관한 것이다. 본 발명은 스마트 홈, 스마트 빌딩, 스 마트 도시, 스마트 자동차, 커넥티드 카, 헬스 케어, 디지털 교육, 스마트 리테일, 보안 및 안전 서비스와 같이 (뒷면에 계속)"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일반적으로 진보된 무선 통신 시스템에서의 비균등 비트 할당을 기반으로 하는 CSI 보고 체계에 관한 것이다."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4G 통신 시스템의 전개 이후 증가하고 있는 무선 데이터 트래픽에 대한 요구를 충족시키기 위해, 향상된 5G 또 는 5G 이전 통신 시스템을 개발하려는 노력이 이루어졌다. 따라서, 5G 또는 5G 이전 통신 시스템은 \"4G 이후 네트워크\" 또는 \"LTE 이후 시스템\"이라고도 불린다. 5G 통신 시스템은 더 높은 데이터율을 달성하기 위해, 더 높은 주파수(밀리미터파) 대역, 예를 들어 60 GHz 대역에서 구현되는 것이 고려된다. 전파의 전파 손실을 줄이 고 전송 거리를 늘리기 위해, 빔포밍, 대규모 다중 입력 다중 출력(MIMO), 전차원 MIMO(FD-MIMO), 배열 안테나, 아날로그 빔 형성, 대규모 안테나 기술이 5G 통신 시스템에서 논의된다. 또한, 5G 통신 시스템에서는 진보된 소형 셀, 클라우드 무선 액세스 네트워크(RAN), 초고밀도 네트워크, 장치 대 장치(D2D) 통신, 무선 백홀, 이동 네트워크, 협업 통신, 협력 다지점(CoMP), 수신 측 간섭 제거 등을 기반으로 하여 시스템 네트워크 개선을 위한 개발이 진행되고 있다. 5G 시스템에서, 진보된 코딩 변조(ACM)로서 하이브리드 FSK 및 QAM 변조(FQAM) 및 슬라 이딩 윈도우 중첩 코딩(SWSC) 및 진보된 액세스 기술로서 필터 뱅크 다중 반송파(FBMC), 비-직교 다중 액세스 (NOMA) 및 희소 코드 다중 액세스(SCMA)가 개발되었다. 사람이 정보를 생성하고 소비하는 사람 중심의 연결 네트워크인 인터넷은 이제 사람의 개입없이 사물과 같은 분 산된 엔티티들이 정보를 교환하고 처리하는 사물 인터넷(IoT)으로 진화하고 있다. 클라우드 서버와의 연결을 통해 IoT 기술과 빅 데이터 처리 기술이 결합한 만물 인터넷(IoE)이 등장했다. IoT 구현을 위해 \"감지 기술\", \"유선/무선 통신 및 네트워크 인프라구조\", \"서비스 인터페이스 기술\" 및 \"보안 기술\"과 같은 기술 요소가 필요 했기 때문에 센서 네트워크, 기계 간(Machine-to-Machine, M2M) 통신, 기계 유형 통신(MTC) 등이 최근에 연구되 었다. 그러한 IoT 환경은 연결된 사물 간에 생성된 데이터를 수집하고 분석함으로써 인간의 삶에 새로운 가치 를 창출하는 지능형 인터넷 기술 서비스를 제공할 수 있다. IoT는 기존 정보 기술(IT)과 다양한 산업적 응용 간의 융합 및 결합을 통해 스마트 홈, 스마트 빌딩, 스마트 도시, 스마트 자동차 또는 커넥티드 카(connected car), 스마트 그리드, 헬스 케어, 스마트 가전 및 첨단 의료 서비스를 포함하여 다양한 분야에 적용될 수 있다. 같은 맥락에서, IoT 네트워크에 5G 통신 시스템을 적용하기 위한 다양한 시도가 이루어졌다. 예를 들어, 센서 네트워크, 기계 유형 통신(MTC) 및 기계 간(M2M) 통신과 같은 기술이 빔포밍, MIMO 및 배열 안테나에 의해 구현 될 수 있다. 전술한 빅 데이터 처리 기술로서의 클라우드 무선 액세스 네트워크(RAN)의 적용은 5G 기술과 IoT 기술 간 융합의 예로서 또한 고려될 수 있다. 사용자 단말(UE)과 eNode B(eNB) 간의 진보된 무선 통신 시스템에서 채널을 이해하고 정확하게 추정하는 것은 효율적이고 효과적인 무선 통신을 위해 중요하다. 채널 조건을 정확하게 추정하기 위해, UE는 eNB에 채널 측정 에 관한 정보, 예를 들어 CSI를 보고(예를 들어, 피드백)할 수 있다. 이러한 채널에 관한 정보를 사용하여, eNB는 UE와의 무선 데이터 통신을 효율적이고 효과적으로 수행하기 위해 적절한 통신 매개변수를 선택할 수 있 다."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러나, 무선 통신 장치의 채널 경로 및 안테나 수가 증가함에 따라, 채널을 이상적으로 추정하기 위해 필요할 수 있는 피드백의 양도 증가하였다. 이러한 추가로 원하는 채널 피드백은 추가적인 오버헤드를 생성함으로써 무선 통신의 효율, 예를 들어 데이터율을 감소시킬 수 있다."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예는 진보된 무선 통신 시스템에서 비균등 비트 할당(unequal bit allocation)을 기반으로 하는 CSI 보고 체계를 위한 방법 및 장치를 제공한다. 하나의 실시예에서, UE가 제공된다. UE는 프리코딩 매트릭스 표시자(PMI, precoding matrix indicator)에 대 한 보고를 생성하도록 구성된 프로세서를 포함한다. 보고는 (ⅰ) 보고를 위해 구성된 복수의 부대역에 대해 공 통인 광대역 진폭 계수 표시자(wideband amplitude coefficient indicator) 및 (ⅱ) 부대역 진폭 계수 표시자 및 부대역 각각에 대한 부대역 위상 계수 표시자(subband phase coefficient indicator)를 포함한다. 또한, UE는 프로세서에 작동 가능하게 연결된 송수신기를 포함한다. 송수신기는 생성된 PMI에 대한 보고를 기지국에 전송하도록 구성된다. 다른 실시예에서, 기지국(BS)이 제공된다. BS는 PMI에 대한 보고를 수신하도록 구성된 송수신기를 포함한다. 보고는 (ⅰ) 보고를 위해 구성된 복수의 부대역에 대해 공통인 광대역 진폭 계수 표시자 및 (ⅱ) 부대역 진폭 계수 표시자 및 부대역 각각에 대한 부대역 위상 계수 표시자를 포함한다. 또한, BS는 송수신기에 작동 가능하 게 연결된 프로세서를 포함한다. 또 다른 실시예에서, UE에 의해 PMI를 보고하기 위한 방법이 제공된다. 방법은 PMI에 대한 보고를 생성하는 단 계를 포함한다. 보고는 (ⅰ) 보고를 위해 구성된 복수의 부대역에 대해 공통인 광대역 진폭 계수 표시자 및 (ⅱ) 부대역 진폭 계수 표시자 및 부대역 각각에 대한 부대역 위상 계수 표시자를 포함한다. 또한, 방법은 생 성된 PMI에 대한 보고를 기지국에 전송하는 단계를 포함한다. 다른 기술적 특징은 다음의 도면, 설명 및 청구 범위로부터 당업자에게 쉽게 명백해질 수 있다."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, CSI 보고 절차가 효율적으로 수행될 수 있기 때문에 시그널링 오버헤드가 감소될 수 있고 데이터율의 효율이 달성될 수 있다."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래의 설명을 시작하기 전에, 본 특허 문서 전반에 걸쳐서 사용된 특정 단어 및 구문의 정의를 규정하는 것이 유리할 수 있다. 용어 \"결합(couple)\" 및 그 파생어는 서로 물리적으로 접촉하든 아니든 두 개 이상의 요소 간 의 직접 또는 간접 통신을 의미한다. 용어 \"전송하다\", \"수신하다\", \"통신하다\" 및 그 파생어는 직접 및 간접 통신 모두를 포함한다. 용어 \"포함하다(include)\", \"포함하다(comprise)\" 및 그 파생어는 제한없는 포함을 의 미한다. 용어 \"또는\"은 \"및/또는\"을 의미하는 포함이다. 구문 \"~와 관련된\" 및 그 파생어는 포함하는, ~내에 포함되는, ~와 상호 연결하는, 포함하는, ~ 내에 포함되는, ~와 또는 ~에 연결하는, ~와 또는 ~에 결합하는, ~ 와 통신할 수 있는, ~와 협력하는, 인터리브하는, 나란히 놓는, ~에 인접하는, ~에 또는 ~와 바인딩하는, 갖는, ~의 속성이 있는, ~에 또는 ~와 관계가 있는 등을 의미한다. 용어 \"제어기\"는 적어도 하나의 동작을 제어하는 장치, 시스템 또는 그 일부를 의미한다. 그러한 제어기는 하드웨어 또는 하드웨어 및 소프트웨어 및/또는 펌웨 어의 조합으로 구현될 수 있다. 임의의 특정 제어기와 관련된 기능은 국부적으로든 원격으로든 중앙 집중화되 거나 분산될 수 있다. 항목들의 목록과 함께 사용될 때 \"~의 적어도 하나\"라는 구문은 나열된 항목들 중 하나 이상의 상이한 조합들이 사용될 수도 있고, 목록에 있는 하나의 항목만 필요할 수 있다는 것을 의미한다. 예를 들어, \"A, B 및 C 중 적어도 하나\"는 다음의 조합, 즉 A, B, C, A와 B, A와 C, B와 C, 및 A와 B와 C 중 어느 하나를 포함한다. 또한, 후술되는 다양한 기능은 각각 컴퓨터 판독 가능 프로그램 코드로부터 형성되고 컴퓨터 판독 가능 매체에 구현되는 하나 이상의 컴퓨터 프로그램에 의해 구현되거나 지원될 수 있다. 용어 \"어플리케이션\" 및 \"프로그램\"은 하나 이상의 컴퓨터 프로그램, 소프트웨어 구성 요소, 일련의 명령, 절차, 기능, 목적, 클래스, 인스턴스, 관련 데이터, 또는 적합한 컴퓨터 판독 가능 프로그램 코드로의 구현을 위해 구성된 그 일부를 지칭 한다. 구문 \"컴퓨터 판독 가능 코드\"는 소스 코드, 목적 코드 및 실행 가능 코드를 포함하여 모든 유형의 컴퓨 터 코드를 포함한다. 구문 \"컴퓨터 판독 가능 매체\"는 읽기 전용 메모리(ROM), 랜덤 액세스 메모리(RAM), 하드 디스크 드라이브, 콤팩트 디스크(CD), 디지털 비디오 디스크(DVD), 또는 모든 다른 유형의 메모리와 같이, 컴퓨 터에 의해 액세스될 수 있는 모든 유형의 매체를 포함한다. \"비일시적\" 컴퓨터 판독 가능 매체는 유선, 무선, 광학, 또는 일시적인 전기 신호 또는 다른 신호를 전달하는 다른 통신 링크들을 제외한다. 비일시적 컴퓨터 판 독 가능 매체는 데이터를 영구적으로 저장할 수 있는 매체 및 재기록 가능한 광 디스크 또는 소거 가능한 메모 리 장치와 같이, 데이터를 저장하고 나중에 덮어쓸 수 있는 매체를 포함한다. 다른 특정 단어 및 구문에 대한 정의가 본 특허 문서 전체에 걸쳐서 제공된다. 당업자는 대부분의 경우는 아니 지만 많은 경우에 그러한 정의들이 그러한 정의된 단어 및 구문들의 이전 및 이후 사용에 적용된다는 것을 이해 해야 한다. 본 특허 문서에서 본 발명의 원리를 설명하기 위해 사용된 다양한 실시예 및 아래에서 논의되는 도 1 내지 도 13은 단지 예시를 위한 것이고, 어떠한 방식으로든 발명의 범위를 제한하는 것으로 해석되어서는 안된다. 당업 자는 본 발명의 원리가 모든 적절하게 준비된 시스템 또는 장치에서 구현될 수 있음을 이해할 것이다. 다음의 문서 및 표준 설명 즉, 3GPP TS 36.211 v14.2.0, \"E-UTRA, 물리적 채널 및 변조\"; 3GPP TS 36.212 v14.2.0, \"E-UTRA, 멀티플렉싱 및 채널 코딩\"; 3GPP TS 36.213 v14.2.0, \"E-UTRA, 물리적 계층 절차\"; 3GPP TS 36.321 v14.2.0, \"E-UTRA, 매체 액세스 제어(MAC) 프로토콜 사양\"; 3GPP TS 36.331 v14.2.0, \"E-UTRA, 무선 리 소스 제어(RRC) 프로토콜 사양\"; 및 3GPP TR 22.891 v1.2.0, \"신규 서비스 및 시장 기술 지원 수단에 대한 타당 성 조사\"는 본 명세서에서 완전하게 명시된 것처럼 본 발명에 참조로 포함된다. 본 발명의 양태, 특징 및 장점은 단순히 본 발명을 수행하기 위해 고려된 최적의 실시예를 포함하여 다수의 특 정 실시예 및 구현을 도시함으로써 다음의 상세한 설명으로부터 쉽게 명백해진다. 또한, 본 발명은 다른 상이 한 실시예가 가능하고, 그 몇몇 세부 사항은 모두 본 발명의 범위 및 사상을 벗어나지 않고 다양한 명백한 사항 에서 변경될 수 있다. 따라서, 도면 및 설명은 제한적인 것이 아니라 사실상 예시적인 것으로 간주되어야 한다. 본 발명은 첨부 도면의 도면에서 제한이 아니라 예로서 도시된다.다음에서는 간결함을 위해, FDD 및 TDD는 모두 DL 및 UL 시그널링 모두에 대한 듀플렉스 방법으로 고려된다. 이하의 예시적인 설명 및 실시예는 직교 주파수 분할 멀티플렉싱(OFDM) 또는 직교 주파수 분할 다중 액세스 (OFDMA)를 가정하지만, 본 발명은 다른 OFDM 기반 전송 파형 또는 필터링된 OFDM(F-OFDM)과 같은 다중 액세스 방식으로 확장될 수 있다. 본 발명은 독립형 방식으로 작동할 수 있거나, 함께 또는 서로 조합하여 사용될 수 있는 여러 구성 요소를 다룬 다. 4G 통신 시스템의 전개 이후 증가하고 있는 무선 데이터 트래픽에 대한 요구를 충족시키기 위해, 향상된 5G 또 는 5G 이전 통신 시스템을 개발하려는 노력이 이루어졌다. 따라서, 5G 또는 5G 이전 통신 시스템은 \"4G 이후 네트워크\" 또는 \"LTE 이후 시스템\"이라고도 불린다. 5G 통신 시스템은 더 높은 데이터율을 달성하기 위해, 더 높은 주파수(밀리미터파) 대역, 예를 들어 60 GHz 대 역에서 구현되는 것이 고려된다. 전파의 전파 손실을 줄이고 전송 거리를 늘리기 위해, 빔포밍, 대규모 다중 입력 다중 출력(MIMO), 전차원 MIMO(FD-MIMO), 배열 안테나, 아날로그 빔 포밍, 대규모 안테나 기술이 5G 통신 시스템에서 논의된다. 또한 5G 통신 시스템에서, 진보된 소형 셀, 클라우드 무선 액세스 네트워크(RAN), 초고밀도 네트워크, 장치 대 장치(D2D) 통신, 무선 백홀 통신, 이동 네트워크, 협업 통신, 협력 다지점(CoMP) 전송 및 수신, 간섭 완화 및 제거 등을 기반으로 하여 시스템 네트워크 개선을 위한 개발이 진행되고 있다. 5G 시스템에서, 적응형 변조 및 코딩(ACM) 기술로서 하이브리드 주파수 시프트 키잉 및 직교 진폭 변조(FQAM) 및 슬라이딩 윈도우 중첩 코딩(SWSC), 및 진보된 액세스 기술로서 필터 뱅크 다중 반송파(FBMC), 비직교 다중 액세스(NOMA) 및 희소 코드 다중 액세스(SCMA)가 개발되었다. 아래의 도 1 내지 도 4b는 직교 주파수 분할 멀티플렉싱(OFDM) 또는 직교 주파수 분할 다중 액세스(OFDMA) 통신 기술을 사용하고 무선 통신 시스템에서 구현된 다양한 실시예를 설명한다. 도 1 내지 도 3의 설명은 상이한 실 시예가 구현될 수 있는 방식에 대한 물리적 또는 구조적 제한을 의미하는 것이 아니다. 본 발명의 상이한 실시 예는 모든 적절하게 준비된 통신 시스템에서 구현될 수 있다. 도 1은 본 발명의 실시예에 따른 예시적인 무선 네트워크를 도시한다. 도 1에 도시된 무선 네트워크의 실시예 는 단지 예시를 위한 것이다. 본 발명의 범위를 벗어나지 않고 무선 네트워크의 다른 실시예가 사용될 수 있다. 도 1에 도시된 바와 같이, 무선 네트워크는 eNB, eNB, 및 eNB를 포함한다. eNB는 eNB 및 eNB와 통신한다. 또한, eNB는 인터넷, 전용 인터넷 프로토콜(IP) 네트워크, 또는 다른 데이터 네트워크와 같은 적어도 하나의 네트워크와 통신한다. eNB는 eNB의 커버리지 영역 내에 있는 복수의 제1 사용자 단말(UE)에 네트워크에 대한 무 선 광대역 액세스를 제공한다. 복수의 제1 UE는 소기업(SB)에 위치할 수 있는 UE, 대기업(E)에 위치할 수 있는 UE, WiFi 핫스팟(HS)에 위치할 수 있는 UE, 제1 거주지(R)에 위치할 수 있는 UE, 제2 거 주지(R)에 위치할 수 있는 UE, 및 휴대폰, 무선 랩톱, 무선 PDA 등과 같은 이동 장치(M)일 수 있는 UE를 포함한다. eNB은 eNB의 커버리지 영역 내에 있는 복수의 제2 UE에 네트워크에 대한 무선 광대역 액세스를 제공한다. 복수의 제2 UE는 UE 및 UE를 포함한다. 일부 실시예에서, 하 나 이상의 eNB(101 내지 103)는 5G, LTE, LTE-A, WiMAX, WiFi 또는 다른 무선 통신 기술을 사용하여 서로 및 UE(111 내지 116)와 통신할 수 있다. 네트워크 유형에 따라, \"기지국\" 또는 \"BS\"라는 용어는 송신 지점(TP), 송신-수신 지점(TRP), 향상된 기지국 (eNodeB 또는 eNB), 5G 기지국(gNB), 매크로셀, 펨토셀, WiFi 액세스 지점(AP), 또는 다른 무선으로 가능한 장 치와 같이, 네트워크에 대한 무선 액세스를 제공하도록 구성된 모든 구성 요소(또는 구성 요소 모음)을 지칭할 수 있다. 기지국은 하나 이상의 무선 통신 프로토콜, 예를 들어, 5G 3GPP 새로운 무선 인터페이스/액세스(NR), LTE, LTE-A, 고속 패킷 액세스(HSPA), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세스를 제공할 수 있다. 편 의상, 용어 \"BS\" 및 \"TRP\"는 원격 단말에 대한 무선 액세스를 제공하는 네트워크 인프라구조 구성 요소를 지칭 하기 위해 본 특허 문서에서 상호 교환적으로 사용된다. 또한, 네트워크 유형에 따라, 용어 \"사용자 단말\" 또 는 \"UE\"는 \"이동국\", \"가입국\", \"원격 단말\", \"무선 단말\", \"수신 지점\" 또는 \"사용자 장치\"와 같은 모든 구성 요소를 지칭할 수 있다. 편의상, 용어 \"사용자 단말\" 및 \"UE\"는 본 특허 문서에서 UE가 (휴대폰 또는 스마트폰과 같은) 이동 장치이든, 일반적으로 (데스크톱 컴퓨터 또는 자판기와 같은) 고정 장치로 간주되든 상관없이, BS에 무선으로 액세스하는 원격 무선 장비를 지칭하기 위해 사용된다. 점선은 단지 예시 및 설명을 위해 대략적인 원형으로 도시되는 커버리지 영역(120 및 125)의 대략적인 범위를 나타낸다. 커버리지 영역(120 및 125)과 같이, eNB와 관련된 커버리지 영역은 천연 및 인공 장애물과 관련된 무선 환경에서의 변동 및 eNB의 구성에 따라, 불규칙한 형상을 포함하여, 다른 형상을 가질 수 있음을 명확히 이해해야 한다. 보다 상세히 후술되는 바와 같이, UE(111 내지 116)의 하나 이상은 진보된 무선 통신 시스템에서의 효율적인 CSI 보고를 위해 회로, 프로그래밍, 또는 이들의 조합을 포함한다. 특정 실시예에서, eNB(101 내지 103)의 하 나 이상은 진보된 무선 통신 시스템에서 비균등 비트 할당을 기반으로 하는 PMI에 대한 효율적인 CSI 보고를 수 신하기 위해 회로, 프로그래밍, 또는 이들의 조합을 포함한다. 도 1은 무선 네트워크의 일 예를 도시하지만, 도 1에 대해 다양한 변경이 이루어질 수 있다. 예를 들어, 무선 네트워크는 모든 적절한 배열로 임의의 개수의 eNB 및 임의의 개수의 UE를 포함할 수 있다. 또한, eNB는 임의의 개수의 UE와 직접 통신하여 이들 UE에 네트워크에 대한 무선 광대역 액세스를 제공할 수 있다. 마 찬가지로, 각각의 eNB(102 및 103)는 네트워크와 직접 통신하여 UE에 네트워크에 대한 직접적인 무선 광대역 액세스를 제공할 수 있다. 또한, eNB(101, 102 및/또는 103)는 외부 전화 네트워크 또는 다른 유형의 데이터 네트워크와 같이, 다른 또는 추가적인 외부 네트워크에 대한 액세스를 제공할 수 있다. 도 2는 본 발명의 실시예에 따른 예시적인 eNB를 도시한다. 도 2에 도시된 eNB의 실시예는 예시를 위한 것이고, 도 1의 eNB(101 및 103)는 동일하거나 유사한 구성을 가질 수 있다. 그러나, eNB는 매우 다양한 구성을 갖고, 도 2는 eNB의 특정 구현으로 본 발명의 범위를 제한하지 않는다. 도 2에 도시된 바와 같이, eNB는 복수의 안테나(205a 내지 205n), 복수의 RF 송수신기(210a 내지 210n), 송신(TX) 처리 회로, 및 수신(RX) 처리 회로를 포함한다. 또한, eNB는 제어기/프로세서, 메모리, 및 백홀 또는 네트워크 인터페이스를 포함한다. RF 송수신기(210a 내지 210n)는 네트워크에서 UE에 의해 전송된 신호와 같은 입력 RF 신호를 안테나(205a 내지 205n)로부터 수신한다. RF 송수신기(210a 내지 210n)는 입력 RF 신호를 다운컨버팅하여 IF 또는 기저대역 신호를 생성한다. IF 또는 기저대역 신호는 기저대역 또는 IF 신호를 필터링, 디코딩, 및/또는 디지털화함으로 써 처리된 기저대역 신호를 생성하는 RF 처리 회로에 전송된다. RF 처리 회로는 추가 처리를 위해 처리된 기저대역 신호를 제어기/프로세서에 전송한다. TX 처리 회로는 제어기/프로세서로부터 (음성 데이터, 웹 데이터, 이메일, 또는 인터랙티브 비디오 게임 데이터와 같은) 아날로그 또는 디지털 데이터를 수신한다. TX 처리 회로는 처리된 기저대역 또는 IF 신호를 생성하기 위해 출력 기저대역 데이터를 인코딩, 멀티플렉싱, 및/또는 디지털화한다. RF 송수신기(210a 내지 210n)는 TX 처리 회로로부터 출력되는 처리된 기저대역 또는 IF 신호를 수신하고, 안테나(205a 내지 205n)를 통해 전송되는 RF 신호로 기저대역 또는 IF 신호를 업컨버팅한다. 제어기/프로세서는 eNB의 전체 작업을 제어하는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있다. 예를 들어, 제어기/프로세서는 잘 알려져 있는 원리들에 따라 RF 송수신기(210a 내지 210n), RX 처리 회로 및 TX 처리 회로에 의해 순방향 채널 신호의 수신 및 역방향 채널 신호의 송신을 제어할 수 있다. 제어기/프로세서는 더 진보된 무선 통신 기능과 같은 추가 기능을 또한 지원할 수 있다. 예를 들어, 제어기/프로세서는 원하는 방향으로 출력 신호를 효과적으로 조종하기 위해 복수의 안테나 (205a 내지 205n)로부터의 출력 신호에 상이한 가중치를 부여하는 빔포밍 또는 방향성 라우팅 작업을 지원할 수 있다. 매우 다양한 다른 기능 중 어느 하나의 기능이 제어기/프로세서에 의해 eNB에서 지원될 수 있 다. 또한, 제어기/프로세서는 OS와 같이 메모리에 상주하는 프로그램 및 다른 프로세스를 실행할 수 있다. 제어기/프로세서는 실행하는 프로세스가 필요로 할 때 데이터를 메모리 안으로 또는 밖으로 이동시킬 수 있다. 또한, 제어기/프로세서는 백홀 또는 네트워크 인터페이스에 결합된다. 백홀 또는 네트워크 인터페이 스는 eNB가 네트워크를 통해 또는 백홀 연결을 통해 다른 장치 또는 시스템과 통신하는 것을 가능하 게 한다. 인터페이스는 모든 적합한 유선 또는 무선 연결(들)을 통해 통신을 지원할 수 있다. 예를들어, eNB가 (5G, LTE 또는 LTE-A를 지원하는 것과 같은) 셀룰러 통신 시스템의 일부로서 구현되는 경우, 인터페이스는 eNB가 유선 또는 무선 백홀 연결을 통해 다른 eNB와 통신하는 것을 가능하게 할 수 있 다. eNB가 액세스 지점으로서 구현되는 경우, 인터페이스는 eNB가 (인터넷과 같은) 더 큰 네트 워크에 대한 유선 또는 무선 연결을 통해 또는 유선 또는 무선 근거리 네트워크를 통해 통신하는 것을 가능하게 할 수 있다. 인터페이스는 이터넷 또는 RF 송수신기와 같은 유선 또는 무선 연결을 통해 통신을 지원하는 모든 적합한 구조를 포함한다. 메모리는 제어기/프로세서에 결합된다. 메모리의 일부는 RAM을 포함할 수 있고, 메모리의 다른 일부는 플래시 메모리 또는 다른 ROM을 포함할 수 있다. 도 2는 eNB의 일 예를 도시하지만, 도 2에 대해 다양한 변경이 이루어질 수 있다. 예를 들어, eNB는 도 2에 도시된 각 구성 요소의 임의의 수를 포함할 수 있다. 특정 예로서, 액세스 지점은 다수의 인터페이스 를 포함할 수 있고, 제어기/프로세서는 상이한 네트워크 주소 사이에서 데이터를 라우팅하는 라우팅 기능을 지원할 수 있다. 다른 특정 예로서, RX 처리 회로의 단일 예 및 TX 처리 회로의 단일 예를 포함하는 것으로 도시되지만, eNB는 (RF 송수신기 당 하나와 같이) 각각에 대해 복수의 예를 포함할 수 있 다. 또한, 도 2의 다양한 구성 요소는 결합되거나, 더 세분화되거나, 생략될 수 있고, 추가 구성 요소가 특정 요구에 따라 추가될 수 있다. 도 3은 본 발명의 실시예에 따른 예시적인 UE를 도시한다. 도 3에 도시된 UE의 실시예는 단지 예시 를 위한 것이고, 도 1의 UE(111 내지 115)는 동일하거나 유사한 구성을 가질 수 있다. 그러나, UE는 매우 다양 한 구성을 가지며, 도 3은 UE의 어느 특정 구현으로 본 발명의 범위를 제한하지 않는다. 도 3에 도시된 바와 같이, UE는 안테나, 무선 주파수(RF) 송수신기(310a), TX 처리 회로, 마이 크로폰, 및 수신(RX) 처리 회로를 포함한다. 또한, UE는 스피커, 프로세서, 입력/ 출력(I/O) 인터페이스(IF), 터치스크린, 디스프레이 및 메모리를 포함한다. 메모리(36 0)는 기본 운영 체계(OS) 및 하나 이상의 어플리케이션을 포함한다. RF 송수신기는 네트워크의 eNB에 의해 전송된 입력 RF 신호를 안테나로부터 수신한다. RF 송수 신기는 중간 주파수(IF) 또는 기저대역 신호를 생성하기 위해 입력 RF 신호를 다운컨버팅한다. IF 또는 기저대역 신호는 기저대역 또는 IF 신호를 필터링, 디코딩, 및/또는 디지털화함으로써 처리된 기저대역 신호를 생성하는 RF 처리 회로에 전송된다. RF 처리 회로는 (웹 브라우징 데이터 등에 대한) 추가 처리를 위해 프로세서에 또는 (음성 데이터 등을 위해) 스피커에 처리된 기저대역 신호를 전송한다. TX 처리 회로는 마이크로폰으로부터 아날로그 또는 디지털 음성 데이터를 수신하거나, 프로세서(34 0)로부터 (웹 데이터, 이메일, 또는 인터랙티브 비디오 게임 데이터와 같은) 다른 출력 기저대역 데이터를 수신 한다. TX 처리 회로는 처리된 기저대역 또는 IF 신호를 생성하기 위해 출력 기저대역 데이터를 인코딩, 멀티플렉싱, 및/또는 디지털화한다. RF 송수신기는 TX 처리 회로로부터 출력된 처리된 기저대역 또 는 IF 신호를 수신하고, 안테나를 통해 전송되는 RF 신호로 기저대역 또는 IF 신호를 업컨버팅한다. 프로세서는 하나 이상의 프로세서 또는 다른 처리 장치들을 포함할 수 있고, UE의 전체 작업을 제어 하기 위해 메모리에 저장된 OS를 실행할 수 있다. 예를 들어, 프로세서는 잘 알려져 있는 원리 에 따라 RF 송수신기, RX 처리 회로 및 TX 처리 회로에 의해 순방향 채널 신호의 수신 및 역방 향 채널 신호의 전송을 제어할 수 있다. 일부 실시 예들에서, 프로세서는 적어도 하나의 마이크로프로세 서 또는 마이크로제어기를 포함한다. 또한, 프로세서는 비균등 비트 할당을 기반으로 하는 PMI에 대한 CSI 보고를 위한 프로세스와 같이 메모리 에 상주하는 다른 프로세스 및 프로그램을 실행할 수 있다. 프로세서는 실행하는 프로세스에서 요구 하는 대로 메모리의 안으로 또는 밖으로 데이터를 이동시킬 수 있다. 일부 실시 예에서, 프로세서는 운영자 또는 eNB로부터 수신된 신호들에 응답하여, 또는 OS를 기반으로 하여 어플리케이션을 실행하 도록 구성된다. 또한, 프로세서는 UE에 랩톱 컴퓨터 및 핸드헬드 컴퓨터와 같은 다른 장치에 연결하 는 능력을 제공하는 I/O 인터페이스와 결합된다. I/O 인터페이스는 프로세서와 이들 부속 장치 간의 통신 경로이다. 또한, 프로세서는 터치스크린 및 디스플레이에 결합된다. UE의 운영자는 UE에 데이 터를 입력하기 위해 터치스크린을 사용할 수 있다. 디스플레이는 액정 디스플레이, 발광 다이오드 디스플레이, 또는 예를 들어 웹 사이트들로부터의 텍스트 및/또는 적어도 제한된 그래픽을 랜더링할 수 있는 다른 디스플레이일 수 있다. 메모리는 프로세서에 결합된다. 메모리의 일부는 랜덤 액세스 메모리(RAM)를 포함할 수 있고, 메모리의 다른 일부는 플래시 메모리 또는 다른 읽기 전용 메모리(ROM)를 포함할 수 있다. 도 3은 UE의 일 예를 도시하지만, 다양한 변경이 도 3에 대해 이루어질 수 있다. 예를 들어, 도 3의 다양 한 구성 요소는 결합되거나, 더 세분화되거나, 생략될 수 있고, 추가 구성 요소가 특정 요구에 따라 추가될 수 있다. 특정 예로서, 프로세서는 하나 이상의 중앙 처리 유닛(CPU) 및 하나 이상의 그래픽 처리 유닛(GP U)과 같이 복수의 프로세서로 나뉠 수 있다. 또한, 도 3은 휴대 전화 또는 스마트폰으로서 구성된 UE를 도시하지만, UE는 다른 유형의 이동 장치 또는 고정 장치로서 운영되도록 구성될 수 있다. 도 4a는 송신 경로 회로의 하이-레벨 다이어그램이다. 예를 들어, 송신 경로 회로는 직교 주파수 분할 다중 액 세스(OFDMA) 통신에 사용될 수 있다. 도 4b는 수신 경로 회로의 하이-레벨 다이어그램이다. 예를 들어, 수신 경로 회로는 직교 주파수 분할 다중 액세스(OFDMA) 통신에 사용될 수 있다. 도 4a 및 도 4b에서, 다운링크 통 신의 경우, 송신 경로 회로는 기지국(eNB) 또는 중계국에서 구현될 수 있고, 수신 경로 회로는 사용자 단 말(예를 들어, 도 1의 사용자 단말)에서 구현될 수 있다. 다른 예에서, 업링크 통신의 경우, 수신 경로 회로는 기지국(예를 들어, 도 1의 eNB) 또는 중계국에서 구현될 수 있고, 송신 경로 회로는 사용자 단말(예를 들어, 도 1의 사용자 단말)에서 구현될 수 있다. 송신 경로 회로는 채널 코딩 및 변조 블록, 직렬-병렬 변환(S-to-P) 블록, 크기 N의 역 고속 푸리에 변환(IFFT) 블록, 병렬-직렬 변환(P-to-S) 블록, 추가 순환 전치 블록, 및 업컨버터(UC) 를 포함한다. 수신 경로 회로는 다운컨버터(DC), 제거 순환 전치 블록, 직렬-병렬 변환(S-to- P) 블록, 크기 N의 고속 푸리에 변환(FFT) 블록, 병렬-직렬 변환(P-to-S) 블록, 및 채널 디코 딩 및 복조 블록을 포함한다. 도4a 및 도 4b의 구성 요소 중 적어도 일부는 소프트웨어로 구현될 수 있는 반면에, 다른 구성 요소 는 구성 가능한 하드웨어, 또는 소프트웨어와 구성 가능한 하드웨어의 혼합체에 의해 구현될 수 있다. 특히, 본 특허 문서에 기술된 FFT 블록 및 IFFT 블록은 구성 가능한 소프트웨어 알고리즘으로서 구현될 수 있고, 여기 서 크기 N의 값은 구현에 따라 수정될 수 있다. 또한, 본 발명은 고속 푸리에 변환 및 역 고속 푸리에 변환을 구현하는 실시예를 지향하지만, 이것은 단지 예시 를 위한 것이며 본 발명의 범위를 제한하는 것으로 해석되어서는 안된다. 본 발명의 대안적인 실시예에서, 고 속 푸리에 변환 함수 및 역 고속 푸리에 변환 함수는 각각 이산 푸리에 변환(DFT) 함수 및 역 이산 푸리에 변환 (IDFT) 함수에 의해 쉽게 대체될 수 있음을 알 수 있다. DFT 및 IDFT 함수의 경우, 변수 N의 값은 임의의 정수 (즉, 1, 2, 3, 4 등)일 수 있고, FFT 및 IFFT 함수의 경우, 변수 N의 값은 2의 거듭제곱인 임의의 정수(즉, 1, 2, 4, 8, 16 등)일 수 있다는 것을 알 수 있다. 송신 경로 회로에서, 채널 코딩 및 변조 블록은 정보 비트 집합을 수신하고, 코딩(예를 들어, LDPC 코딩)을 적용하고, 입력 비트를 변조(예를 들어,직교 위상 시프트 키잉(QPSK) 또는 직교 진폭 변조(QAM))하여 일련의 주파수 도메인 변조 심볼을 생성한다. 직렬-병렬 변환 블록은 N개의 병렬 심볼 스트림을 생성하기 위해 직렬 변조된 심볼을 병렬 데이터로 변환(즉, 디멀티플렉싱)하고, 여기서 N은 eNB 및 UE에서 사 용되는 IFFT/FFT 크기이다. 크기 N의 IFFT 블록은 시간 도메인 출력 신호들을 생성하기 위해 N개의 병렬 심볼 스트림에 대해 IFFT 연산을 수행한다. 병렬-직렬 변환 블록은 직렬 시간 도메인 신호를 생성하기 위 해 크기 N의 IFFT 블록으로부터의 병렬 시간 도메인 출력 심볼을 변환(즉, 멀티플렉싱)한다. 추가 순환 전치 블록은 시간 도메인 신호에 순환 전치를 삽입한다. 마지막으로, 업컨버터는 무선 채널을 통해 전송을 위한 RF 주파수로 추가 순환 전치 블록의 출력을 변조(즉, 업컨버팅)한다. 또한, 신호는 RF 주파 수로의 변환 전에 기저대역에서 필터링될 수 있다. 전송된 RF 신호는 무선 채널을 통과한 후에 UE에 도달하고, eNB에서의 작업에 대한 역 작업이 수행된 다. 다운컨버터는 수신된 신호를 기저대역 주파수로 다운컨버팅하고, 제거 순환 전치 블록은 직렬 시간 도메인 기저대역 신호를 생성하기 위해 순환 전치를 제거한다. 직렬-병렬 변환 블록은 시간 도메인 기저대역 신호를 병렬 시간 도메인 신호로 변환한다. 크기 N의 FFT 블록은 N개의 병렬 주파수 도메인 신 호를 생성하기 위해 FFT 알고리즘을 수행한다. 병렬-직렬 변환 블록은 병렬 주파수 도메인 신호를 일련의 변조된 데이터 심볼로 변환한다. 채널 디코딩 및 복조 블록은 원래의 입력 데이터 스트림을 복구하기 위 해 변조된 심볼을 복조한 후 디코딩한다.eNB(101 내지 103)는 각각 사용자 단말(111 내지 116)로의 다운링크를 통한 전송과 유사한 송신 경로를 구현할 수 있고, 사용자 단말(111 내지 116)로부터의 업링크를 통한 수신과 유사한 수신 경로를 구현할 수 있다. 마찬 가지로, 사용자 단말(111 내지 116)은 각각 eNB(101 내지 103)로의 업링크를 통한 전송을 위한 아키텍처에 대응 하는 송신 경로를 구현할 수 있고, eNB(101 내지 103)로부터의 다운링크를 통한 수신을 위한 아키텍처에 대응하 는 수신 경로를 구현할 수 있다. 5G 통신 시스템 사용 사례가 확인되고 기술되었다. 이들 사용 사례는 대략적으로 세 개의 상이한 그룹으로 분 류될 수 있다. 하나의 예에서, 향상된 모바일 광대역(eMBB)은 덜 엄격한 대기 시간 및 신뢰성 요건과 함께 높 은 비트/초 요건과 관련이 있는 것으로 결정된다. 다른 예에서, 매우 높은 신뢰성 및 짧은 대기 시간(URLL)은 덜 엄격한 비트/초 요건으로 결정된다. 또 다른 예에서, 대규모 사물 통신은 장치의 개수가 무려 ㎢ 당 10만 내지 백만 개나 존재할 수 있지만, 신뢰성/처리량/대기 시간 요건은 덜 엄격할 수 있다고 결정된다. 또한, 이 러한 시나리오는 배터리 소모가 가능한 한 최소화될 수 있다는 점에서 전력 효율 요건을 또한 포함할 수 있다. 통신 시스템은 BS 또는 NodeB와 같은 전송 지점에서 UE로 신호를 전달하는 다운링크(DL) 및 UE에서 NodeB와 같 은 수신 지점으로 신호를 전달하는 업링크(UL)를 포함한다. 일반적으로 단말 또는 이동국이라고도 지칭되는 UE 는 고정되거나 이동 가능하고, 셀룰러 폰, 개인용 컴퓨터 장치 또는 자동화 장치일 수 있다. 일반적으로 고정 국인 eNodeB는 액세스 지점 또는 다른 등가의 용어로 지칭될 수도 있다. LTE 시스템의 경우, NodeB는 종종 eNodeB로 지칭된다. LTE 시스템과 같은 통신 시스템에서, DL 신호는 정보 내용을 전달하는 데이터 신호, DL 제어 정보(DCI)를 전달 하는 제어 신호, 및 파일롯 신호라고도 알려져 있는 기준 신호(RS)를 포함할 수 있다. eNodeB는 물리적 DL 공 유 채널(PDSCH)을 통해 데이터 정보를 전송한다. eNodeB는 물리적 DL 제어 채널(PDCCH) 또는 향상된 PDCCH(EPDCCH)를 통해 DCI를 전송한다. eNodeB는 물리적 하이브리드 ARQ 표시자 채널(PHICH)에서 UE로부터의 데이터 전송 블록(TB) 전송에 응답하여 응 답 정보를 전송한다. eNodeB는 UE-공통 RS(CRS), 채널 상태 정보 RS(CSI-RS), 또는 복조 RS(DMRS)를 포함하여 여러 유형의 RS 중 하나 이상을 전송한다. CRS는 DL 시스템 대역폭(BW)을 통해 전송되고, 측정을 수행하거나 데이터 또는 제어 정보를 복조하기 위한 채널 추정을 획득하기 위해 UE에 의해 사용될 수 있다. CRS 오버헤드 를 감소시키기 위해, eNodeB는 CRS보다 작은 시간 및/또는 주파수 도메인에서의 밀도를 갖는 CSI-RS를 전송할 수 있다. DMRS는 각각의 PDSCH 또는 EPDCCH의 BW에서만 전송될수 있고, UE는 PDSCH 또는 EPDCCH에서 각각 데 이터 또는 제어 정보를 복조하기 위해 DMRS를 사용할 수 있다. DL 채널에 대한 전송 시간 간격은 서브프레임으 로 지칭되고, 예를 들어 1 ms의 지속 시간을 가질 수 있다. 또한, DL 신호는 시스템 제어 정보를 전달하는 논리 채널의 전송을 포함한다. BCCH는 DL 신호가 시스템 정보 블록(SIB)을 전달하는 경우에는 DL 공유 채널(DL-SCH)에 또는 DL 신호가 마스터 정보 블록(MIB)을 전달하는 경 우에는 방송 채널(BCH)로 지칭되는 전송 채널에 매핑된다. 대부분의 시스템 정보는 DL-SCH를 사용하여 전송되 는 상이한 SIB에 포함된다. 서브프레임에서 DL-SCH에 대한 시스템 정보의 존재는 시스템 정보 RNTI(SI-RNTI)로 스크램블링된 순환 중복 검사(CRC)를 갖는 코드워드를 전달하는 해당 PDCCH의 전송에 의해 표시될 수 있다. 대 안적으로, SIB 전송에 대한 스케줄링 정보는 이전 SIB에서 제공될 수 있고, 제1 SIB(SIB-1)에 대한 스케줄링 정 보는 MIB에 의해 제공될 수 있다. DL 리소스 할당은 물리적 리소스 블록(PRB)의 그룹 및 서브프레임의 유닛에서 수행된다. 전송 BW는 리소스 블 록(RB)으로 지칭되는 주파수 리소스 유닛을 포함한다. 각각의 RB는 개의 부반송파 또는 12개의 RE와 같이 리소스 요소(RE)를 포함한다. 하나의 서브프레임에 대한 하나의 RB의 유닛은 PRB로 지칭된다. UE는 PDSCH 전 송 BW에 대한 총 개의 RE에 대해 개의 RB를 할당받을 수 있다. UL 신호는 데이터 정보를 전달하는 데이터 신호, UL 제어 정보(UCI)를 전달하는 제어 신호 및 UL RS를 포함할 수 있다. UL RS는 DMRS 및 사운딩 RS(SRS)를 포함한다. UE는 각각의 PUSCH 또는 PUCCH의 BW에서만 DMRS를 전 송한다. eNodeB는 데이터 신호 또는 UCI 신호를 복조하기 위해 DMRS를 사용할 수 있다. UE는 eNodeB에 UL CSI를 제공하기 위해 SRS를 전송한다. UE는 각각의 물리적 UL 공유 채널(PUSCH) 또는 물리적 UL 제어 채널 (PUCCH)을 통해 데이터 정보 또는 UCI를 전송한다. UE가 동일한 UL 서브프레임에서 데이터 정보 및 UCI를 전송 해야 하는 경우, UE는 PUSCH에서 데이터 정보 및 UCI 모두를 멀티플렉싱할 수 있다. UCI는 PDCCH 검출(DTX)의 부재 또는 PDSCH에서의 데이터 TB에 대한 정확한 (ACK) 또는 부정확한 (NACK) 검출을 표시하는 하이브리드 자동 반복 요청 응답(HARQ-ACK) 정보, UE가 UE의 버퍼에 데이터를 가지고 있는지 여부를 표시하는 스케줄링 요청(SR), 랭크 표시자(RI) 및 eNodeB가 UE로의 PDSCH 전송을 위한 링크 적응을 수행할 수 있도록 하는 채널 상태 정보(CSI)를 포함한다. 또한, HARQ-ACK 정보는 반영구적으로 스케줄링된 PDSCH의 해제를 표시하는 PDCCH/EPDCCH의 검출에 응답하여 UE에 의해 전송된다. UL 서브프레임은 2개의 슬롯을 포함한다. 각 슬롯은 데이터 정보, UCI, DMRS, 또는 SRS를 전송하기 위해"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "개의 심볼을 포함한다. UL 시스템 BW의 주파수 리소스 유닛은 RB이다. UE는 전송 BW에 대한 총 개의 RE에 대해 개의 RB를 할당받는다. PUCCH의 경우, 이다. 마지막 서브프레임 심볼은 하나 이상의 UE로 부터의 SRS 전송을 멀티플렉싱하기 위해 사용될 수 있다. 데이터/UCI/DMRS 전송을 위해 이용 가능한 서브프레 임 심볼의 개수는 개 이고, 여기서 마지막 서브프레임 심볼이 SRS를 전송하기 위해 사용되 는 경우, 이고, 그렇지 않은 경우, 이다. 도 5는 본 발명의 실시예에 따른 서브프레임에서 PDSCH에 대한 송신기 블록도를 도시한다. 도 5에 도시된 송신기 블록도의 실시예는 단지 예시이다. 도 5는 송신기 블록도의 특정 구현으로 본 발명의 범위를 제한하지 않는다. 도 5에 도시된 바와 같이, 정보 비트는 터보 인코더와 같은 인코더에 의해 인코딩되고, 예를 들어 직 교 위상 시프트 키잉(QPSK) 변조를 사용하는 변조기에 의해 변조된다. 직렬-병렬(S/P) 변환기는 할 당된 PDSCH 전송 BW에 대해 전송 BW 선택 유닛에 의해 선택된 RE에 매핑될 매퍼(mapper)에 후속 제공 되는 M개의 변조 심볼을 생성하고, 유닛은 역고속 푸리에 변환(IFFT)을 적용하고, 시간 도메인 신호를 생 성하기 위해 병렬-직렬(P/S) 변환기에 의해 출력이 직렬화되고, 필터에 의해 필터링이 적용되고, 신 호가 전송된다. 데이터 스크램블링, 순환 전치 삽입, 시간 윈도윙, 인터리빙 및 당해 분야에 잘 알려져 있는 다른 것들과 같은 추가 기능은 간결성을 위해 도시되지 않는다. 도 6은 본 발명의 실시예에 따른 서브프레임에서 PDSCH에 대한 수신기 블록도를 도시한다. 도 6에 도시된 블록도의 실시예는 단지 예시이다. 도 6은 블록도의 특정 구현으로 본 발명의 범위를 제한하지 않는 다. 도 6에 도시된 바와 같이, 수신된 신호는 필터에 의해 필터링되고, 할당된 수신 BW에 대한 RE는 BW 선택기에 의해 선택되고, 유닛은 고속 푸리에 변환(FFT)을 적용하고, 병렬-직렬 변환기에 의 해 출력이 직렬화된다. 이후, 복조기는 DMRS 또는 CRS(도시되지 않음)로부터 획득된 채널 추정을 적용하 여 데이터 심볼을 코히어런트하게 복조하고, 터보 디코더와 같은 디코더는 정보 데이터 비트의 추정 을 제공하기 위해 복조된 데이터를 디코딩한다. 시간 윈도윙, 순환 전치 제거, 디스크램블링, 채널 추정 및 디 인터리빙과 같은 추가 기능은 간결성을 위해 도시되지 않는다. 도 7은 본 발명의 실시예에 따른 서브프레임에서 PUSCH에 대한 송신기 블록도를 도시한다. 도 7에 도시된 블록도의 실시예는 단지 예시이다. 도 7은 블록도의 특정 구현으로 본 발명의 범위를 제한하지 않는 다. 도 7에 도시된 바와 같이, 정보 데이터 비트는 터보 인코더와 같은 인코더에 의해 인코딩되고, 변조 기에 의해 변조된다. 이산 푸리에 변환(DFT) 유닛은 변조된 데이터 비트에 DFT를 적용하고, 할당된 PUSCH 전송 BW에 대응하는 RE는 전송 BW 선택 유닛에 의해 선택되고, 유닛은 IFFT를 적용하고, 순환 전치 삽입(도시되지 않음) 후, 필터에 의해 필터링이 적용되고, 신호가 전송된다. 도 8은 본 발명의 실시예에 따른 서브프레임에서 PUSCH에 대한 수신기 블록도를 도시한다. 도 8에 도시된 블록도의 실시예는 단지 예시이다. 도 8은 블록도의 특정 구현으로 본 발명의 범위를 제한하지 않는 다. 도 8에 도시된 바와 같이, 수신된 신호는 필터에 의해 필터링된다. 이어서, 순환 전치가 제거된 후 (도시되지 않음), 유닛은 FFT를 적용하고, 할당된 PUSCH 수신 BW에 대응하는 RE가 수신 BW 선택기 에 의해 선택되고, 유닛은 역 DFT(IDFT)를 적용하고, 복조기는 DMRS(도시되지 않음)로부터 획득 된 채널 추정을 적용하여 데이터 심볼을 복조하고, 터보 디코더와 같은 디코더는 정보 데이터 비트의 추정을 제공하기 위해 복조된 데이터를 디코딩한다. 차세대 셀룰러 시스템에서, 다양한 사용 사례가 LTE 시스템의 기능을 넘어서 구상된다. 5G 또는 제5 세대 셀룰 러 시스템이라고 불리는 6 GHz 이하 및 6 GHz 이상에서(예를 들어, 밀리미터파에서) 작동할 수 있는 시스템은 요건 중 하나가 된다. 3GPP TR 22.891에서, 74 5G 사용 사례가 확인 및 기술되었고, 이들 사용 사례는 대략적 으로 3개의 상이한 그룹으로 분류될 수 있다. 덜 엄격한 대기 시간 및 신뢰성 요건을 갖는 높은 데이터율 서비 스를 목표로 하는 제1 그룹은 \"향상된 모바일 광대역(eMBB)\"라고 칭한다. 대기 시간에는 덜 관대하지만 덜 엄 격한 데이터율 요건을 갖는 어플리케이션을 목표로 하는 제2 그룹은 \"매우 높은 신뢰성 및 낮은 대기 시간 (URLL)\"이라고 칭한다. 덜 엄격한 신뢰성, 데이터율 및 대기 시간 요건을 갖는 ㎢ 당 백만 개와 같은 다수의 저전력 장치 연결을 목표로 하는 제3 그룹은 \"대용량 MTC(mMTC)\"라고 칭한다. 5G 네트워크가 상이한 서비스 품질(QoS)을 갖는 그러한 다양한 서비스를 지원하기 위해, 네트워크 슬라이싱이라 고 불리는 하나의 방법이 LTE 사양에서 확인되었다. PHY 리소스를 효율적으로 활용하고 DL-SCH에서 (상이한 리 소스 할당 방식, 뉴머롤로지 및 스케줄링 전략으로) 다양한 슬라이스를 멀티플렉싱하기 위해, 유연하고 독립적 인 프레임 또는 서브프레임 설계가 활용된다. 도 9는 본 발명의 실시예에 따른 두 슬라이스의 예시적인 멀티플렉싱을 도시한다. 도 9에 도시된 두 슬라 이스의 멀티플렉싱의 실시예는 단지 예시이다. 도 9는 두 슬라이스의 멀티플렉싱의 특정 구현으로 본 발명의 범위를 제한하지 않는다. 공통 서브프레임 또는 프레임 내에 있는 두 슬라이스를 멀티플렉싱하는 2개의 예시적인 인스턴스가 도 9에 도시 된다. 이들 예시적인 실시예에서, 슬라이스는 하나의 전송 인스턴스가 제어(CTRL) 구성 요소(예를 들어, 920a, 960a, 960b, 920b, 또는 960c) 및 데이터 구성 요소(예를 들어, 930a, 970a, 970b, 930b, 또는 970c)를 포함하 는 1개 또는 2개의 전송 인스턴스로 구성될 수 있다. 실시예에서 두 슬라이스는 주파수 도메인에서 멀티 플렉싱되고, 실시예에서 두 슬라이스는 시간 도메인에서 멀티플렉싱된다. 이들 두 슬라이스는 상이한 뉴 머롤로지의 집합으로 전송될 수 있다. LTE 사양은 eNB에 (64개 또는 128개와 같이) 다수의 안테나 요소가 장착될 수 있도록 최대 32개의 CSI-RS 안테 나 포트를 지원한다. 이러한 경우, 복수의 안테나 요소는 하나의 CSI-RS 포트에 매핑된다. 5G와 같은 차세대 셀룰러 시스템의 경우, CSI-RS 포트의 최대 개수는 동일하게 유지되거나 증가될 수 있다. 도 10은 본 발명의 실시예에 따른 예시적인 안테나 블록을 도시한다. 도 10에 도시된 안테나 블록(100 0)의 실시예는 단지 예시이다. 도 10은 안테나 블록의 특정 구현으로 본 발명의 범위를 제한하지 않는다. 밀리미터파 대역의 경우, 안테나 요소의 개수는 주어진 폼 팩터(form factor)에 대해 더 많아질 수 있지만, 디 지털 방식으로 프리코딩된 포트의 개수에 대응할 수 있는 CSI-RS 포트의 개수는 도 10에 도시된 바와 같이 (밀 리미터파 주파수에서 다수의 ADC/DAC를 설치할 수 있는 가능성과 같은) 하드웨어 제약으로 인해 제한되는 경향 이 있다. 이러한 경우, 하나의 CSI-RS 포트는 아날로그 위상 시프터의 뱅크에 의해 제어될 수 있는 다수의 안 테나 요소에 매핑된다. 이때, 하나의 CSI-RS 포트는 아날로그 빔포밍을 통해 좁은 아날로그 빔을 생성하는 하 나의 하위 배열에 대응할 수 있다. 이러한 아날로그 빔은 심볼 또는 서브프레임에 대한 위상 시프터 뱅크를 변 화시킴으로써 보다 넓은 범위의 각도에서 스윕하도록 구성될 수 있다. (RF 체인의 개수와 동일한) 하위 배열의 개수는 CSI-RS 포트의 개수(NCSI-PORT)와 동일하다. 디지털 빔포밍 유닛은 프리코딩 이득을 더 증가시키기 위해 NCSI-PORT개의 아날로그 빔에 대해 선형 조합을 수행한다. 아날로그 빔은 광대역(따라서, 주파수 선택적이 아님) 이지만, 디지털 프리코딩은 주파수 부대역 또는 리소스 블록에 대해 달라질 수 있다. 도 11은 본 발명의 실시예에 따른 예시적인 네트워크 구성을 도시한다. 도 11에 도시된 네트워크 구성 의 실시예는 단지 예시이다. 도 11은 네트워크 구성의 특정 구현으로 본 발명의 범위를 제한하지 않는다. 5G 네트워크가 상이한 서비스 품질(QoS)을 갖는 그러한 다양한 서비스를 지원하기 위한, 네트워크 슬라이싱이라 고 불리는 하나의 방식이 LTE 사양에서 확인되었다. 도 11에 도시된 바와 같이, 운영자 네트워크는 eNB(1130a 및 1130b), 소형 셀 기지국(펨토/피코 eNB 또는 Wi-Fi 액세스 지점)(1135a 및 1135b)과 같은 네트워크 장치와 연결되는 다수의 무선 액세스 네트워크 (들)(RAN(들))을 포함한다. 네트워크는 각각 슬라이스로 나타내는 다양한 서비스를 지원할 수 있 다. 예에서, URLL 슬라이스(1140a)는 자동차(1145b), 트럭(1145c), 스마트 시계(1145a) 및 스마트 안경(1145d)과 같은 URLL 서비스를 요구하는 UE에 서비스를 제공한다. 2개의 mMTC 슬라이스(1150a 및 550b)는 전력계(555b) 및 온도 제어 박스(1155b)와 같은 mMTC 서비스를 요구하는 UE에 서비스를 제공한다. 하나의 eMBB 슬라이스 (1160a)는 휴대폰(1165a), 랩톱(1165b) 및 태블릿(1165c)과 같은 eMBB 서비스를 요구하는 UE에 서비스를 제공 한다. 2개의 슬라이스로 구성된 장치가 또한 구상될 수 있다. LTE 사양에서, MIMO는 높은 시스템 처리량 요건을 달성하는 데 필수적인 특징으로 확인되었고, NR에서 계속 동 일하게 유지될 것이다. MIMO 전송 방식의 주요 구성 요소 중 하나는 eNB (또는 TRP)에서의 정확한 CSI 획득이 다. 특히 MU-MIMO의 경우, 높은 MU 성능을 보장하기 위해 정확한 CSI의 가용성이 필요하다. TDD 시스템의 경 우, CSI는 채널 상반성에 의존하는 SRS 전송을 사용하여 획득될 수 있다. 한편, FDD 시스템의 경우, CSI는 eNB로부터의 CSI-RS 전송 및 UE로부터의 CSI 획득 및 피드백을 사용하여 획득 될 수 있다. FDD 시스템에서, CSI 피드백 프레임워크는 eNB로부터의 SU 전송을 가정한 코드북으로부터 도출된 CQI/PMI/RI의 형태로 \"내재되어\" 있다. CSI를 도출하는 동안의 고유한 SU 가정 때문에, 이러한 내재되어 있는 CSI 피드백은 MU 전송에 부적당하다. 미래의 (예를 들어, NR) 시스템은 보다 MU 중심일 가능성이 있기 때문에, 이러한 SU-MU CSI 불일치는 높은 MU 성능 이득을 달성하는 데 장애물이 될 수 있다. 내재되어 있는 피드백에 의한 다른 문제는 eNB에서 더 많은 개수의 안테나 포트를 사용하는 확장성이다. 다수의 안테나 포트의 경우, 내재되어 있는 피드백에 대한 코드북 설계는 매우 복잡하고(예를 들어, LTE 사양에 서 클래스 A 코드북의 총 개수 = 44), 설계된 코드북은 실질적인 전개 시나리오에서 정당한 성과 이익을 가져올 수 있다고 보장받지 못한다(예를 들어, 많아야 작은 비율의 이득만 보여질 수 있다). 전술한 문제를 인식하고, LTE 사양에서 진보된 CSI 보고에 대한 사양 지원을 제공하기로 합의하였고, 이는 아주 최소한 NR MIMO에서 진보 된 CSI 방식을 설계하기 위한 좋은 시작점이 될 수 있다. LTE 사양과 비교할 때, NR MIMO에 대한 CSI 획득은 다음의 추가적인 차별화 요소를 고려할 수 있다. 융통성 CSI 보고 프레임워크의 일 예에서, NR에서의 CSI 보고는 상이한 CSI 보고 기능을 갖는 사용자를 지원하 기 위해 융통성이 있을 수 있다. 예를 들어, 일부 사용자는 LTE에서와 같이 PMI/CQI/RI의 형태로 내재되어 있 는 CSI만 보고할 수 있고, 일부 다른 사용자는 내재되어 있는 및 명시적인 채널 보고를 둘 다 보고할 수 있다. 또한, NR에서의 UE 운동성은 0 kmph 내지 500 kmph일 수 있다. 따라서, CSI 보고 프레임워크는 그러한 다양한 사용 사례 및 UE 기능을 지원할 수 있다. 증가된 안테나 포트 개수의 일 예에서, NR MIMO에서 eNB의 안테나 요소 개수는 최대 256개일 수 있고, 이는 안 테나 포트의 총 개수가 LTE eFD-MIMO에서 지원된 최대 안테나 포트 개수인 32개보다 많을 수 있음을 의미이다. 이것은 각 부분집합이 최대 32개 포트로 구성되는 부분 포트 CSI-RS 매핑으로 수용될 수 있지만, 시간에 따른 포트의 총 개수는 더 많은 개수까지 확장될 수 있다. 포트 개수가 증가함에 따라, 의미있는 시스템 이득은 MU 중심 시스템에서만 획득될 수 있다. 증가된 처리량 요건의 일 예에서, (예를 들어, NR의 eMBB 경우) 시스템 처리량 요건은 LTE eFD-MIMO의 경우보다 몇 배 더 높다. 그러한 높은 처리량 요건은 eNB에 매우 정확한 CSI를 제공하는 메커니즘을 통해서만 충족될 수 있다. 빔포밍의 일 예에서, FD-MIMO에서 확립된 트렌드에 따르면, NR MIMO 시스템은 셀 특정 또는 UE 특정으로 빔 형 성될 수 있고, 빔은 아날로그 (RF) 또는 디지털 또는 하이브리드 유형일 수 있다. 그러한 빔 형성 시스템의 경 우, eNB에서 정확한 빔포밍 정보를 획득하기 위한 메커니즘이 필요하다. 통합 설계의 일 예에서, NR이 6 GHz 이상 및 이하 주파수 대역을 모두 포함하기 때문에, 양쪽 주파수 영역 모두 에서 작동하는 통합된 MIMO 프레임워크가 바람직할 수 있다. 이하에서는 간략화를 위해, DL 및 UL 시그널링 모두에 대한 듀플렉스 방법으로서 FDD 및 TDD가 모두 고려된다. 이하의 예시적인 설명 및 실시예는 직교 주파수 분할 멀티플렉싱(OFDM) 또는 직교 주파수 분할 다중 액세스 (OFDMA)를 가정하지만, 본 발명은 필터링된 OFDM(F-OFDM)과 같은 다른 OFDM 기반 전송 파형 또는 다중 액세스 방식으로 확장될 수 있다. 본 발명의 개시는 독립형 방식으로 작동할 수 있거나 함께 또는 조합하여 사용될 수 있는 여러 구성 요소를 다 룬다. 네트워크 유형에 따라, \"기지국\" 또는 \"BS\"라는 용어는 송신 지점(TP), 송신-수신 지점(TRP), 향상된 기지국 (eNodeB 또는 eNB), gNB, 매크로셀, 펨토셀, WiFi 액세스 지점(AP), 또는 다른 무선으로 가능한 장치와 같이 네트워크에 대한 무선 액세스를 제공하도록 구성된 모든 구성 요소(또는 구성 요소 모음)을 지칭할 수 있다. 기 지국은 하나 이상의 무선 통신 프로토콜, 예를 들어, 5G 3GPP 새로운 무선 인터페이스/액세스(NR), LTE, LTE-A, 고속 패킷 액세스(HSPA), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세스를 제공할 수 있다. 편의상, 용어 \"BS\" 및 \"TRP\"는 본 특허 문서에서 원격 단말에 대한 무선 액세스를 제공하는 네트워크 인프라구조 구성 요소를 지칭하기 위해 상호 교환적으로 사용된다. 또한, 네트워크 유형에 따라, 용어 \"사용자 단말\" 또는 \"UE\"는 \"이동국\", \"가입국\", \"원격 단말\", \"무선 단말\", \"수신 지점\" 또는 \"사용자 장치\"와 같은 구성 요소를 지칭할 수 있다. 편의상, 용어 \"사용자 단말\" 및 \"UE\"는 본 특허 문서에서 UE가 (휴대폰 또는 스마트폰과 같은) 이동 장치이든, 일반적으로 (데스크톱 컴퓨터 또는 자판 기와 같은) 고정 장치로 간주되든 상관없이, BS에 무선으로 액세스하는 원격 무선 장비를 지칭하기 위해 사용된 다. 도 12는 본 발명의 실시예에 따른 예시적인 2D 안테나 포트 레이아웃을 도시한다. 도 12에 도시된 2D 안 테나 포트 레이아웃의 실시예는 단지 예시이다. 도 12는 특정 구현으로 본 발명의 범위를 제한하지 않는 다. 이하에서, N1 및 N2는 각각 제1 및 제2 차원에서 동일한 편광을 갖는 안테나 포트의 개수라고 가정한다. 2D 안 테나 포트 레이아웃의 경우, N1 > 1, N2 > 1로 결정되고, 1D 안테나 포트 레이아웃의 경우, N1 > 1 및 N2 = 1 또 는 N2 > 1 및 N1 = 1을 가질 수 있다. 본 발명의 나머지 부분에서는 N1 > 1 및 N2 = 1을 갖는 1D 안테나 포트 레이아웃이 고려된다. 그러나, 본 발명은 N2 > 1 및 N1 = 1을 갖는 다른 1D 안테나 포트 레이아웃에도 적용할 수 있다. 이중 편광 안테나 포트 레이아웃의 경우, 안테나 포트의 총 개수는 2N1N2개이다. 하나의 실시예에서, 고해상 CSI 보고를 위한 이중 스테이지 W = W1W2 코드북이 제공된다. 그러한 실시예에서, W1 코드북은 균일하게 이격된 (L1,L2) DFT 빔으로 구성된 직교 기저계(basis set); 기저계에 있는 L1L2 개의 DFT 빔 중에서 자유롭게 L ∈ {2,3,4,6,8}개의 빔; 및/또는 L개의 빔 중 계층 별로 가장 강한 빔 및 두개의 편광을 선택하기 위해 사용된다. 그러한 경우, L은 (예를 들어, RRC) 구성 가능하거나 UE가 바람직한 L 값을 보고한다. 이러한 선택은 WB 또는 부분 대역(예를 들어, SB의 집합)이다. 기저계 크기에 대한 두 가지 예는 L1L2 = min(8, N1N2)인 제한된 직교 기저계 및 L1L2 = N1N2인 완전 직교 기저계이고, 두 가지 중 하나가 RRC 시그 널링을 통해 구성되거나 사양에서 지원된다. 그러한 실시예에서, W2 코드북은 공통인 W1 빔 그룹과 계층 별로 독립적으로 L개의 빔을 결합시키기 위해 사용된 다 즉, 선택된 L개의 빔은 모든 계층 및 2개의 편광에 대해 동일하지만 가장 강한 빔 선택은 계층 별이다. 결 합 계수의 진폭 및 위상은 별도로 보고되어, 위상은 부대역(SB) 별로 보고되고, 진폭은 광대역(WB) 또는 SB 또 는 WB와 SB 둘 다로 보고된다. SB의 개수는 구성될 수 있고, WB 보고는 모든 SB에 대해 공통인 보고를 의미한 다. 하나의 실시예에서, UE는 랭크(R) 프리코딩 매트릭스가 로 주어지는 고해상 CSI 코드북 으로 구성되고, 계층(l)에 대한 프리코딩 벡터는 로 주어지고, 여기서 가장 강한 빔이 하나의 편광, 예 를 들어 0 (또는 +45)에 대응하면 이고, 가장 강한 빔이 다른 편광, 예를 들어 편광 1 (또는 -45)에 대응하면 이고, 이다. 매트릭스 및 벡터 은 다음과 같이 정의된다. 일 예에서, 은 이 선택된 (L1,L2) 기저 계에서 선택된 L개의 직교 DFT 빔 중 하나인 편광 모두에 대해 공통인 기본 행렬 이고, 은 이 계층(l)에 대해 가장 강한 빔인 L개 빔의 해 당 인덱스이다. 랭크(R) > 1인 경우, 가장 강한 빔은 상이한 계층에 대해 상이할 수 있기 때문에 가장 강한 빔 의 인덱스는 계층 별로 표시되고, 이러한 표시는 WB라는 것을 유의한다. 일 예에서, 은 2개의 편광 및 L개의 빔에 대한 상대 빔 전력 레벨(relative beam power level)의 WB 구성 요소를 표시하기 위한, 각각 [0, 1]에 속하는 대각선 요소 를 갖는 2L×2L 대각선 행렬이다. 일 예에서, 은 2개의 편광 및 L개의 빔에 대한 상대 빔 전력 레벨의 SB 구성 요소를 표시하기 위한, 각각 [0, 1]에 속하는 대각선 요소 를 갖는 2L×2L 대각선 행렬이다. 일 예에서, 은 2L×1 벡터 이고, 2개의 편광 및 L개의 빔에 대한 계 수의 SB 상대 위상을 표시하기 위한 이다. , 의 대각선 요소 및 의 요소 중 하나는 정확하게, 계수(전력 및 위상 모두)가 일반적으로 하나라고 가정할 수 있는 가장 강한 빔에 대응하는 하나임을 유의한다. 또한, 상대 빔 전력 레벨의 WB 구성 요소만 보고 되는 경우, 은 단위 행렬이다(따라서, 보고되지 않는다). 마찬가지로, 상대 빔 전력 레벨의 SB 구성 요소만 보고되는 경우, 은 단위 행렬이다(따라서, 보고되지 않는다). 본 발명에서, 진폭 또는 빔 전력 레벨을 보고하기 위한 비트 할당 및 및 상대 위상 가 고려되고, 여기서 이다. 특히, , 및 를 보고하기 위해 비균등 비트 수가 할당되는 사례에 집 중한다. 본 발명의 나머지 부분에서, 및 는 빔 결합 계수 또는 가중치의 진폭으로 지칭된다. 및 는 빔 전력 레벨로도 지칭될 수 있다. 또한, , 및 는 각각 광대역 진폭 계수, 부대역 진폭 계수 및 부대역 위상 계수로 동등하게 지칭될 있다. 마찬가지로, 및 는 각각 제1 진폭 계수 및 제2 진폭 계수 로 동등하게 지칭될 수 있다. 일부 실시예 0에서, UE는 , 및 중 적어도 하나가 다음과 같이 양자화되는 전술한 고해상 CSI 코드 북 로 구성된다. 정렬의 일 예에서, 계층 별 2L개의 계수가 내림차순으로 정렬된다. 및 는 정렬 후의 진폭 및 를 의미하고, 는 정렬 후의 위상 를 의미한다. 계수는 (가장 큰 진폭에 대 응하는) 가장 강한 계수로 정규화될 수 있기 때문에, 계수는 , 및 이라고 가정할 수 있 기 때문에 계수는 보고되지 않는다는 것을 유의해야 한다. 진폭 양자화의 일 예에서, i(i > 0) 번째로 정렬된 계수의 진폭을 보고하기 위해 i 번째로 정렬된 진폭과 (i-1) 번째로 정렬된 진폭의 비율 이 양자화되고, 여기서 는 정렬된 진폭의 양자화된 비율을 의미한다. i 번째로 정렬된 진폭을 재구성하기 위해, 곱셈 이 고려되고, 여기서 이다. 에 대한 양자화된 비율 은 유사하게 정의될 수 있다. N은 각각의 진폭을 양자화하기 위한 비트 수이다. 진폭 양자화 코드북은 다음과 같이 정의되는 C0 또는 C1이다 즉, N=0이면, 이고, N=1이면, 및 이고, N=2이면, 및 이고, N=3이면, 및 이다. 위상 양자화의 일 예에서, i 번째로 정렬된 계수 의 위상을 보고하기 위해서 (K = 0, 1, 2, 3) 알파벳이 고려된다. 계수 정렬 정보는 WB 또는 SB로 보고된다. 보고는 예를 들어, WB로 고정될 수 있다. 대안적으로, UE는 1 비트 상위 계층 RRC 또는 동적 MAC CE 또는 DCI 기반 시그널링을 통해 WB 또는 SB 보고 중 하나로 구성된다.WB로 보고되는 경우, 계수 정렬 정보는 RI 및 WB 빔 선택과 같은 적어도 하나의 WB CSI 보고와 함께 보고되거나 독립적인 WB CSI 보고로서 별도로 보고된다. 마찬가지로, SB로 보고되는 경우, 계수 정렬 정보는 SB 진폭 및 SB 위상과 같은 적어도 하나의 SB CSI 보고와 함께 보고되거나 독립적인 SB CSI 보고로서 별도로 보고된다. 또한, 계수 정렬 정보는 계층 별로 독립적으로 또는 모든 계층에 대해 공통적으로 보고된다. 하나의 방식에서, 두 가지 정렬 대안 중 하나는 예를 들어 계층 별 정렬로 고정된다. 대안적으로, UE는 1 비트 상위 계층 RRC 또 는 동적 MAC CE 또는 DCI 기반 시그널링을 통해 두 가지 정렬 대안 중 하나로 구성된다. 일부 실시예 1에서, UE는 계층(l) 및 계수(i)에 대한 진폭 및/또는 가 전술한 실시예 0에 따라 양자화 되는 고해상 CSI 코드북으로 구성된다. 또한, 진폭 정렬은 다음의 대안 중 적어도 하나에 따르는 WB이다. Alt 1-0의 일 예에서, 진폭 정렬은 모든 계층에 대해 공통 및 2개의 편광에 대해 공통이다. 예를 들어, 2-계층 CSI 보고의 경우, WB 정렬 정보를 보고하기 위한 비트 수는 이고, 여기서 이다. L=4인 경우, 5 비트가 필요하다. Alt 1-1의 다른 예에서, 진폭 정렬은 2개의 편광에 대해 공통이고, 모든 계층 에 대해 독립적이다. 예를 들어, 2-계층 CSI 보고의 경우, WB 정렬 정보를 보고하기 위한 비트 수는 이다. L=4인 경우, 10 비트가 필요하다. Alt 1-2의 또 다른 예에서, 진폭 정렬은 2개의 편광에 대해 독립적이고, 모든 계층에 대해 공통이다. 예를 들 어, 2-계층 CSI 보고의 경우, WB 정렬 정보를 보고하기 위한 비트 수는 이고, 이다. L=4인 경우, 16 비트가 필요하다. Alt 1-3의 또 다른 예에서, 진폭 정렬은 2개의 편광에 대해 독립적이고, 모든 계층에 대해 독립적이다. 예를 들어, 2-계층 CSI 보고의 경우, WB 정렬 정보를 보고하기 위한 비트 수는 이다. L=4인 경우, 32 비트가 필요하다. 진폭 정렬 정보는 RI 및 WB 빔 선택과 같은 적어도 하나의 WB CSI 보고와 함께 보고되거나 독립적인 WB CSI 보 고로서 별도로 보고된다. WB 전용 진폭() 보고 또는 SB 전용 진폭() 보고의 경우, 적어도 다음의 진폭 정렬 방법이 고려될 수 있 다. 하나의 방법에서, Alt 1-0 내지 Alt 1-3 중 단지 하나, 예를 들어 Alt 1-0 또는 Alt 1-3이 사양에서 지원 된다. 다른 방법에서, Alt 1-0 내지 Alt 1-3 중 단지 2개, 예를 들어 Alt 1-0과 Alt 1-3 또는 Alt 1-0과 Alt 1-2가 사양에서 지원된다. 또 다른 방법에서, Alt 1-0 내지 Alt 1-3 모두가 사양에서 지원된다. 복수의 대안 이 지원되는 경우, UE는 그들 중 하나로 구성되거나, UE는 CSI 보고의 일부로서 바람직한 대안을 보고한다. WB()및 SB() 진폭이 모두 보고되는 경우, 진폭은 Alt 1-0 내지 Alt 1-3 중 적어도 하나에 따라 WB 및 SB 진폭 구성 요소 모두에 대해 공통적이거나, Alt 1-0 내지 Alt 1-3 중 적어도 하나에 따라 WB 및 SB 진폭 구 성 요소에 대해 독립적이다. 이러한 경우, 정렬 정보 보고 페이로드는 두 배가 된다는 것을 유의한다. 가장 강한 빔은 이미 WB로 보고되는 진폭 정렬 정보에 포함되어 있기 때문에 WB 보고의 일부로서 가장 강한 빔 을 보고할 필요가 없다는 것을 유의한다. 하위 실시예 1-0에서, 위상 정렬은 진폭 정렬을 따른다. 및 는 각각 전술한 실시예 0에서 설명한 바와 같이 계층(l) 및 계수(i)에 대한 WB()및 SB() 진폭 또는 WB() 및 SB() 진폭 비율을 양자화하기 위한 비트 수이다. 가장 강한 진폭 또는 은 1이라고 가정할 수 있기 때문에 보고되지 않는다 즉, 그들을 보고하기 위해 0 비트가 할당된다는 것은 주목할 가치가 있다. 일부 실시예 2에서, 단순화를 위한 2-계층 CSI 보고를 가정할 수 있다. 그러나, 실시예는 2개 이상의 계층에 적용 가능하다. 그러한 실시예에서, (각 계층에 대해) 나머지 2L-1개의 진폭 비율을 양자화하기 위한 비트 수 는 다음의 대안 중 적어도 하나에 따른다. Alt 2-0의 일 예에서, 정렬 대안에 관계없이 모든 진폭에 대해 공통적이다 즉, 각 계층(l) 및 계수(i)에 대해 (또는 )에 대한 단일 값이 사용된다. 단일 값은 예를 들어 3 비트로 고정되거나 RRC 시그널링을 통해구성되고, 또는 UE는 CSI 보고(WB 보고)의 일부로서 보고한다. Alt 2-1의 다른 예에서, 정렬 대안에 관계없이 모든 진폭에 대해 독립적이다. 진폭 정렬의 Alt 1-0의 일 예에 서, L-1개의 값 (또는 )은 각각 진폭 인덱스 및 인덱스 둘 다에 대해 및 모든 계층(l)에 대해 사용된다. 진폭 정렬의 Alt 1-1의 일 예에서, L-1개의 값 (또 는 )은 각각 진폭 인덱스 및 인덱스 둘 다에 대해 사용된다. 진폭 정 렬의 Alt 1-1의 일 예에서, 계층 1에 대해, L-1개의 값 (또는 )은 각각 진폭 인덱스 및 인덱스 둘 다에 대해 사용된다. 진폭 정렬의 Alt 1-2의 일 예에서, 2L-1개의 값 (또는 )은 각각 진폭 인덱스 에 대해 및 모든 계층(l)에 대해 사용된다. 진폭 정렬의 Alt 1-3의 일 예에서, 계층 0에 대해, 2L-1개의 값 (또는 )은 각각 진폭 인덱스 에 대해 사용된다. 진폭 정렬의 Alt 1-3의 일 예에서, 계층 1에 대해, 2L-1개의 값 (또는 )은 각각 진폭 인덱스 에 대해 사용된다. (또는 )에 대한 값은 예를 들어 {0, 1, 2, 3} 비트로부터 고정되거나 RRC 시그널링을 통해 구성되고, 또는 UE는 CSI 보고(WB 보고)의 일부로서 보고한다. Alt 2-2의 일 예에서, 진폭은 복수의 별도 집합으로 분할되고, 각 집합은 독립적으로 진폭 보고 비트에 대해 단 일 값을 할당받는다. 2개의 집합의 몇 가지 예는 다음과 같다. Ex 2-0의 일 예에서, 집합의 개수는 2개이고, 여기서 제1 집합은 L1 = [M/2] 또는 [M/2]개의 진폭을 갖고, 제2 집합은 개의 진폭을 갖고, 전술한 실시예 1에서의 진폭 정렬 대안에 따라 M=L 또는 M=2L이다. Ex 2-1의 일 예에서, 집합의 개수는 2개이고, 제1 집합은 2L개의 계수 중 더 강한 L개 계수에 대응하는"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "개의 진폭을 갖고, 제2 집합은 2L개의 계수 중 더 약한 L개 계수에 대응하는 나머지 개의 진폭을 갖고, 여기서 전술한 실시예 1에서의 진폭 정렬 대안 1-2 및 대안 1-3을 가정하였다. Ex 2-2의 일 예에서, 집합의 개수는 2개로 제1 집합은 (M 번째 진폭에 대응하는) 가장 약한 진폭을 제외한 모든 진폭을 갖고, 제2 집합은 가장 약한 진폭(M 번째 진폭)을 갖는다. Ex 2-3의 일 예에서, 집합의 개수는 2개로 제1 집합은 (제1 진폭에 대응하는) 가장 강한 진폭을 제외한 모든 진 폭을 갖고, 제2 집합은 가장 강한 진폭(제1 진폭)을 갖는다. Ex 2-4의 일 예에서, 집합의 개수는 L개의 빔 각각에 대응하는 L개이다. Alt 1-2 및 Alt 1-3의 경우, 진폭 양 자화를 위한 비트 수는 동일한 빔에 대응하는 2개의 진폭에 대해 공통이다. 하위 실시예 2-0에서, 2L-1개 계수의 위상을 양자화하기 위한 비트 할당은 Alt 2-0 내지 Alt 2-3 중 적어도 하 나에 따라 진폭을 양자화하는 비트 할당을 따른다. 달리 명시되지 않는 한, 본 발명의 나머지 부분은 비트 할당 대안에 관한 것이고, 진폭 및 위상 양자화 모두에 적용 가능하다. 간략화를 위해, 이하의 실시예에서는 진폭만 언급한다. 또한, 에 대한 비트 할 당 대안을 설명한다. 그러나, 대안은 에 대한 비트 할당에도 적용 가능하다. 일부 실시예 3에서, 진폭 또는/및 위상은 전술한 실시예 2의 Alt 2-2에 따라 공통 원소를 갖지 않은 2개의 집합 으로 분할되고, 각각의 집합은 동일한 개수(L)의 계수를 갖고, (WB 진폭의 경우) , (SB 진폭의 경 우) 및 (SB 위상의 경우) 에 대해 다음의 비트 할당이 사용된다. 계수 인덱스 i = 0, 1, …, 2L-1은 정렬된 계수에 대응한다는 것을 유의해야 한다. 일 예에서, 2L개의 빔 또는 계수 중 제1 선행 빔 또는 계수의 경우, 이다 즉, 리딩 빔 계수의 진폭 및 위상은 보고되지 않고, 예를 들어 리딩 빔 계수는 1로 설정되고, 여기서 \"리딩(leading)\"은 (본 발명에서 나중에 가장 강 한 계수로 지칭되는) 가장 큰 진폭을 갖는 계수를 지칭할 수도 있다. 광대역 진폭 + 부대역 진폭 보고에 대한 일 예에서, (2L개의 빔 또는 계수 중) 처음 L-1개 즉, i = 1, …, L-1개의 더 강한 빔 또는 계수에 대해 ; (2L 개의 빔 또는 계수 중) 나머지 L개 즉, i = L, …, 2L-1개의 더 약한 빔 또는 계수에 대해 ; 및/또는 P = 2 또는 P = 3이다. 부대역 전용 진폭 보고에 대한 일 예에서, 모든 i에 대해 , (2L개의 빔 또는 계수 중) 처음 L-1개 즉, i = 1, …, L-1개의 더 강한 빔 또는 계수에 대해 ; 및/또는 (2L개의 빔 또는 계수 중) 나 머지 L개 즉, i = L, …, 2L-1개의 더 약한 빔 또는 계수에 대해 이다. 광대역 전용 진폭 보고에 대한 일 예에서, 모든 i에 대해 ; 및/또는 이고, 여기서 P,Q = 2 또는 P,Q = 3이다. 하위 실시예 3-0에서, 전술한 실시예 3의 비트 할당은 모든 L 값에 대해 적용 가능하다. 하위 실시예 3-1에서, 전술한 실시예 3의 비트 할당은 모든 L > R에 대해 적용 가능하고, 예를 들어, R = 2 또 는 R = 3이다. 이러한 경우에서 L ≤ R인 경우, 동일한 비트 할당이 모든 계수 i = 1, …, 2L-1에 대해 사용된 다. 일부 실시예 3A에서, 진폭 또는/및 위상은 전술한 실시예 2의 Alt 2-2에 따라 공통 원소를 갖지 않은 2개의 집 합으로 분할되고, 각각의 집합은 K개의 계수를 갖고, (WB 진폭의 경우) , (SB 진폭의 경우) 및 (SB 위상의 경우) 에 대해 다음의 비트 할당이 사용된다. 계수 인덱스 i = 0, 1, …, 2L-1은 정렬된 계수에 대응한다는 것을 유의해야 한다. 2L개의 빔 또는 계수 중 제1 리딩 빔 또는 계수에 대한 일 예에서, 이다. 광대역 진폭 + 부대역 진폭 보고에 대한 일 예에서, (2L개의 빔 또는 계수 중) 처음 K-1개 즉, i = 1, … , K-1 개의 더 강한 빔 또는 계수에 대해 ; (2L개의 빔 또는 계수 중) 나머지 2L-K개 즉, i = K, …, 2L-1개의 더 약한 빔 또는 계수 에 대해 ; 및/또는 P = 2 또는 P = 3이다. 부대역 전용 진폭 보고에 대한 일 예에서, 모든 i에 대해 ; (2L개의 빔 또는 계수 중) 처음 K-1개 즉, i = 1, …, K-1개의 더 강한 빔 또는 계수에 대해 ; 및/또는 (2L개의 빔 또는 계수 중) 나 머지 2L-K개 즉, i = K, …, 2L-1개의 더 약한 빔 또는 계수에 대해 이다. 광대역 전용 진폭 보고에 대한 일 예에서, 모든 i에 대해 ; 및/또는 이고, 여기 서 P,Q = 2 또는 P,Q = 3이다. K에 대한 몇 가지 대안은 다음과 같다 즉, Alt 3A-0: 모든 L에 대해 K = 2; Alt 3A-1: 모든 L에 대해 K = L; Alt 3A-2: L = 2에 대해 K = 2L 및 L > 2에 대해 K = L; Alt 3A-3: L ≤ 3에 대해 K = 2L 및 L > 3에 대해 K = L; Alt 3A-4: L ≤ 4에 대해 K = 2L 및 L > 4 예를 들어 L=6 또는 L=8에 대해 K = L; Alt 3A-5: K는 상위 계층 (RRC) 시그널링을 통해 구성; Alt 3A-6: K는 MAC CE 기반 시그널링을 통해 구성; Alt 3A-7: K는 DCI(DL 관련 또는 UL 관련) 시그널링을 통해 구성; Alt 3A-8: WB 전용 진폭 보고를 위한 K 값은 WB + SB 진폭 보고를 위한 K 값과 동일하고 Alt 3A-0 내지 Alt 3A-7 중 하나에 따르고; Alt 3A-9: WB 전용 진폭 보고를 위한 K 값은 WB + SB 진폭 보고를 위한 K 값과 상이하고 WB 전용 진폭 보고 및 WB + SB 진폭 보고를 위해 각각 하나씩 2개의 상이 한 K 값이 Alt 3A-0 내지 Alt 3A-7 중 하나에 따라 사용되고; Alt 3A-10: K는 Alt 3A-0 내지 Alt 3A-9 중 적어 도 2개의 조합에 따른다. 일부 실시예 3B에서, UE는 상위 계층 RRC 시그널링을 통해 부대역 진폭과 함께 또는 부대역 진폭 없이 광대역 진폭을 보고하도록 구성되고, 비트를 갖는 (광대역 진폭, 부대역 진폭, 부대역 위상 양자화)에 대한 비트 할당은 다음과 같다. 2L개의 계수 중 (i=0에 대응하는) 리딩(가장 강한) 계수에 대한 일 예에서, 이고 리딩(가장 강한) 계수 = 1이다. 광대역 + 부대역 진폭 보고에 대한 일 예에서, (가장 강한 계수를 제외한) 나머지 2L-1개의 계수 중 처음 K-1개 즉, i = 1, …, K-1의 리딩(가장 강한) 계수에 대해 및 이고, 여기서 2개의 M 값 중 하나는 상위 계층 RRC 시그널링을 통해 구성되고; (2L-1개의 계수 중) 나머지 2L-K 개 즉, i = K, …, 2L-1의 더 약한 계수에 대해 이고; 및/또는 K = 2, 3, …, 2L이다. 광대역 전용 진폭 즉 에 대한 일 예에서, 및 이고; 여기서 2개의 M 값 중 하나는 상위 계층 RRC 시그널링을 통해 구성되고; 및/또는 2L개의 계수 중 가장 강한 계수는 WB 방식으로 계층 별로 보고된다. 일부 실시예 3C에서, 의 지원된 값 및 전술한 실시예 3B의 K 값은 다음의 대안 중 적어도 하나에 따 른다. Alt 3C-0의 일 예에서, 각각의 L 값에 대해 단지 하나의 고정 값; 다음의 예 중 하나는 사양에서 고정된 다 즉, 예 3C-0: 모든 L에 대해 K = L; 예 3C-1: L = 2에 대해 K = 2L 및 L= 3, 4에 대해 K = L; 예 3C-2: L = 2, 3에 대해 K = 2L 및 L = 4에 대해 K = L; 예 3C-3: 모든 L에 대해 K = L + 1; 예 3C-4: L = 2에 대해 K = 2L 및 L= 3, 4에 대해 K = L+1; 예 3C-5: L = 2,3에 대해 K = 2L 및 L = 4에 대해 K = L+1; 예 3C-6: L = 2에 대해 K = 2L, L = 3에 대해 K = L 및 L = 4에 대해 K = L+1; 예 3C-7: L = 2에 대해 K = 2L, L = 3에 대해 K = L+1 및 L = 4에 대해 K = L; 예 3C-8: L = 2에 대해 K = L, L = 3에 대해 K = L 및 L = 4에 대해 K = L+1; 예 3C-9: L = 2에 대해 K = L, L = 3에 대해 K = L+1 및 L = 4에 대해 K = L+1; 예 3C-10: L = 2에 대해 K = L, L = 3에 대해 K = L+1 및 L = 4에 대해 K = L; 예 3C-11: 모든 L에 대해 K = L + 2; 예 3C-12: L = 2에 대해 K = 2L 및 L = 3, 4에 대해 K = L+2; 예 3C-13: L = 2,3에 대해 K = 2L 및 L = 4에 대해 K = L+2; 예 3C-14: L = 2 에 대해 K = 2L, L = 3에 대해 K = L+1 및 L = 4에 대해 K = L+2, 즉, L = 2, 3 및 4에 대해 각각 K = 4, 4 및 6; 및 예 3C-14: K = 2L, L = 3에 대해 K = L+2 및 L = 4에 대해 K = L+1이다. Alt 3C-1의 일 예에서, L의 일부 값 또는 모든 값에 대한 복수의 K 값 및 하나의 K 값은 RRC 시그널링을 통해 구성되거나 UE가 WB 보고로서 바람직한 K 값을 보고한다. 일부 실시예 3D에서 광대역 + 부대역 진폭 양자화의 경우, 전술한 실시예 3B 및 실시예 3C의 K 값에 따라 균등 비트 할당 및 비균등 비트 할당 중 하나가 사용된다. 일 예에서, K = 2L이면 진폭 및 위상 모두에 대해 균등 비트 할당이 사용되고 이러한 경우, 다음의 진폭 양자화 방법이 사용된다 즉, 2L개의 계수 중 (i = 0에 대응하는) 리딩(가장 강한) 계수는 WB 방식으로(WB 보고로서) 계 층 별로 보고된다. 이를 위해 계층 별로 [log2(2L)] 비트가 필요하다. L = 4인 경우, 랭크 1 CSI 보고를 위해 3 비트가 필요하고 랭크 2 CSI 보고를 위해 6 비트가 필요하고, 진폭 양자화는 나머지 2L-1개의 계수 각각에 대 해 독립적이다(즉, 전술한 실시예 0에서 제안된 계수에 대한 차등과 같은 의존적인 양자화는 사용되지 않는다). 일 예에서, K < 2L이면 다음의 진폭 양자화 대안 중 하나가 사용된다. Alt 3D-0의 일 예에서, 2L개의 계수는 각 계층에 대해 독립적으로, 보고된 WB 진폭의 내림차순에 따라 보고되고, 여기서 그룹핑 정보는 WB 진폭 보고 와 함께 내재적으로 보고된다. 이를 위해 계층 별로 [log2(2L)!] 비트가 필요하다. L = 4인 경우, 랭크 1 CSI 보고를 위해 16 비트가 필요하고 랭크 2 CSI 보고를 위해 32 비트가 필요하다. Alt 3D-1의 일 예에서, 2L개의 계수는 2개의 그룹으로 그룹화되고, 그룹핑 정보는 각각의 계층에 대해 독립적으 로 WB 방식으로 보고된다. 또한, (i= 0에 대응하는) 리딩(가장 강한) 계수는 제1 계수 그룹에 속하는 가장 강 한 계수로서 명시적으로 또는 내재적으로 보고된다(WB 보고). 그러한 예에서, 제1 그룹은 2L개의 계수 중 K개 의 리딩(가장 강한) 계수에 대응한다. 그러한 예에서, 제2 그룹은 나머지 계수에 대응한다. 각 계층에 대해, 제1 그룹을 보고하기 위해 비트가 필요하고 리딩(가장 강한) 계수를 보고하기 위해 비트가 필요하다. 제2 그룹에 필요한 보고는 없다는 것을 유의해야 한다. L = 4 및 K = 5인 경우, 제1 그룹을 보고하기 위해 6 비트가 필요하고 계층 별 리딩 계수를 보고하기 위해 3 비트가 필요하고, 각각 랭크 1 CSI 보고를 위해 총 9 비트 및 랭크 2 CSI 보고를 위해 18 비트가 필요하다. Alt 3D-2의 일 예에서, 2L개의 계수는 3개의 그룹으로 그룹화되고, 그룹핑 정보는 각 계층에 대해 독립적으로 WB 방식으로 보고된다. 그러한 예에서, 제1 그룹은 2L개의 계수 중 (i=0에 대응하는) 리딩(가장 강한) 계수에 대응한다. 그러한 예에서, 제2 그룹은 (가장 강한 계수를 제외한) 나머지 2L-1개의 계수 중 K-1개의 리딩(가장 강한) 계수에 대응한다. 그러한 예에서, 제3 그룹은 나머지 계수에 대응한다. 각 계층에 대해, 제1 그룹을 보고하기 위해 비트 및 리딩(가장 강한) 계수를 보고하기 위해 비트가 필요하다. 제2 그룹에 대해 필요한 보고는 없다는 것을 유의해야 한다. L = 4 및 K = 5인 경우, 제1 그룹을 보고하기 위해 6 비트가 필요하고 계층 별 리딩 계수를 보고하기 위해 3 비트가 필요하고, 각 각 랭크 1 CSI 보고를 위해 총 9 비트 및 랭크 2 CSI 보고를 위해 18 비트가 필요하다. Alt 3D-3의 일 예에서, 2L개의 계수 중 (i = 0에 대응하는) 리딩(가장 강한) 계수는 WB 방식으로(WB 보고로서) 계층 별로 보고된다. 제1 그룹(더 큰 비트 할당을 사용하는 계층 별 K-1개의 가장 강한 계수)은 고정된 규칙을 기반으로 하여, 어떤 명시적인 보고없이, 보고된 WB 진폭으로부터 직접 결정된다. 고정된 규칙의 몇 가지 예는 다음과 같다. Ex 3D-0의 일 예에서, 나머지 2L-1개의 계수에 대한 보고된 WB 진폭은 내림차순으로 정렬되고, 정렬된 진폭의 처음 K-1개는 제1 그룹을 형성하고 나머지 정렬된 진폭은 제2 그룹을 형성한다. 2개의 계수에 대한 WB 진폭이 동일하면 WB 진폭은 계수 인덱스 i의 오름차순으로 정렬되고 즉, 및 이 계수 에 대한 2개의 WB 진폭인 경우, 이면 및 은 로 정렬되고, 그렇지 않으면 로 정렬된다. Ex 3D-1의 일 예에서, 나머지 2L-1개의 계수에 대한 보고된 WB 진폭은 내림차순으로 정렬되고, 정렬된 진폭의 처음 K-1개는 제1 그룹을 형성하고 나머지 정렬된 진폭은 제2 그룹을 형성한다. 2개의 계수에 대한 WB 진폭이 동일하면 WB 진폭은 계수 인덱스 i의 내림차순으로 정렬되고 즉, 및 이 계수 에 대한 2개의 WB 진폭인 경우, 이면 및 은 로 정렬되고, 그렇지 않으면 로 정렬된다. 이러한 경우(K < 2L) 진폭의 양자화는 의존적(즉, 전술한 실시예 0에서 제안된 바와 같이 차등)이거나 나머지 2L-1개의 계수 각각에 대해 독립적이다. 두 가지 진폭 양자화 방법 중 하나는 사양에서 사용될 수 있다. 일부 실시예 3E에서, 광대역 전용 및 (RRC 구성에 의존하는, 전술한 실시예 3B 참조) 광대역 + 부대역 진폭 양 자화 모두에 대해, 진폭 양자화는 각 계층에 대해 및 나머지 2L-1개의 계수 각각에 대해 독립적이다. 진폭 양 자화에 대한 코드북은 다음과 같다. WB 진폭 코드북의 일 예에서, 이고, 이는 에 대응한다. WB 진폭 코드북 표의 예는 표 1에 도시된다. 인덱싱하기 위 한 두 가지 대안 즉 진폭의 내림차순 및 진폭의 오름차순이 도시되고, 둘 중 하나는 고정될 수 있다. SB 진폭 코드북의 일 예에서, {0, -3} dB에 대응하는 제1 그룹( )에 대해 이고, 제2 그룹 ( , SB 진폭이 보고되지 않음)에 대해 이다. SB 진폭 코드북 표의 일 예는 표 2에 도시된다. 인덱싱을 위한 두 가지 대안 즉 진폭의 내림차순 및 진폭의 오름차순이 도시되고, 둘 중 하나는 고정될 수 있다. 변형에서, SB 진폭을 위한 별도의 코드북은 없다. SB 진폭 코드북은 WB 진폭 코드북 표 1의 인덱스 (IA,WB) = 6,7(alt 0) 또는 인덱스(IA,WB)= 0, 1(Alt 1)에 대응한다.표 1"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "표 2"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "일부 실시예 3F에서, 광대역 전용 및 (RRC 구성에 의존하는, 전술한 실시예 3B 참조) 광대역 + 부대역 진폭 양 자화 모두에 대해, 진폭 양자화는 각각의 계층에 대해 및 나머지 2L-1개의 계수 각각에 대해 독립적이다. 진폭 양자화에 대한 코드북은 다음과 같다. WB 진폭 코드북의 일 예에서, 이고, 이는 dB에 대응한다. WB 진폭 코드북 표의 예는 표 3에 도시된다. 인덱싱을 위한 2개의 대안 즉, 진폭의 오름차순 및 진폭의 내림차순이 도시되고, 이들 중 하나는 고정될 수 있다. SB 진폭 코드북의 다른 예에서, 제1 그룹( )에 대해 이고 이는 dB에 대응하고, 제2 그룹( , SB 진폭은 보고되지 않음)에 대해 이다. SB 진폭 코드북 표의 예는 표 4 에 도시된다. 인덱싱을 위한 2개의 대안 즉, 진폭의 오름차순 및 진폭의 내림차순이 도시되고, 이들 중 하나는 사양에서 고정될 수 있다. 변형에서, SB 진폭에 대한 별도의 코드북은 없다. SB 진폭 코드북은 WB 진폭 코드 북 표인 표 3의 인덱스(IA,WB) = 6,7(alt 0) 또는 인덱스(IA,WB)= 0, 1(Alt 1)에 대응한다.표 3"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "표 4"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "일부 실시예 3G에서, WB 진폭 코드북은 표 1의 Alt 0 및 Alt 1 중 하나에 따르고, SB 진폭 코드북은 표 4의 Alt 0 및 Alt 1 중 하나에 따른다. 일부 실시예 3H에서, WB 진폭 코드북은 표 3의 Alt 0 및 Alt 1 중 하나에 따르고, SB 진폭 코드북은 표 2의 Alt 0 및 Alt 1 중 하나에 따른다. 일부 실시예 3I에서, WB 진폭 코드북은 표 1의 Alt 0 및 Alt 1 중 하나에 따르고, SB 진폭 코드북은 표 5의 Alt 0 및 Alt 1 중 하나에 따른다. 표 5"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "일부 실시예 3J에서, WB 진폭 코드북은 표 1의 Alt 0 및 Alt 1 중 하나에 따르고, SB 진폭 코드북은 표 6의 Alt 0 및 Alt 1 중 하나에 따른다.표 6"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "일부 실시예 3K에서, WB 진폭 코드북은 표 1의 Alt 0 및 Alt 1 중 하나에 따르고, 2개의 SB 진폭 코드북 및 이 지원되고, 여기서 이고 이다. 일 예에서, 2개의 SB 코드북은 및 이고, 해당 SB 코드북 표는 표 7에 도시된다. 다른 예는 표 8에 도시된다. 표 7 및 표 8에 SB 진폭 () 매핑의 인덱스(IA,SB)에 대한 2개의 대안(Alt 0 및 Alt 1)이 도시된다. SB 코드북 인덱스(ISB CB)의 보고 또는 구성은 다음의 대안 중 적어도 하나에 따른다. Alt 3K-0의 일 예에서, 2 개의 SB 코드북 중 하나, 예를 들어 는 사양에서 고정된다. Alt 3K-1의 다른 예에서, 2개의 SB 코드 북 중 하나는 UE에 구성된다. 예를 들어, 이러한 구성은 1 비트 RRC 시그널링 또는 더 동적인 MAC CE 기반 또 는 SCI 기반 시그널링을 통해 구성될 수 있다. Alt 3K-2의 또 다른 예에서, UE는 이러한 보고가 WB 방식으로 이루어지는 CSI 보고의 일부로서 2개의 SB 코드북 중 하나를 보고한다. 또한, 이러한 보고는 다른 WB CSI 보고(예를 들어, WB PMI 또는 RI) 중 적어도 하나와 함 께 보고되거나 새로운 WB CSI 보고로서 별도로 보고될 수 있다. ISB CB의 WB 보고는 다음의 하위 대안 중 적어도 하나에 따른다. Alt 3K-2-0의 일 예에서, ISB CB는 계층 공통(layer-common) 및 계수 공통(coefficient-common)으로 보고되고, 1 비트 WB CSI 보고는 모든 계층에 대해 공통으로 및 모든 계수(K-1)에 대해 공통으로 보고되고, 여기서 K는 전술 한 실시예 3B에서와 같이 정의된다. Alt 3K-2-1의 다른 예에서, ISB CB는 계층 공통 및 계수 독립적으로 보고되고, 1 비트 WB CSI 보고는 모든 계층에 대해 공통으로 및 모든 계수(K-1)에 대해 독립적으로 보고되고, 여기서 K는 전술한 실시예 3B에서와 같이 정의 된다. 따라서, 총 WB 보고 비트 수는 K-1이다. Alt 3K-2-2의 또 다른 예에서, ISB CB는 계층 독립적 및 계수 공통으로 보고되고, 1 비트 WB CSI 보고는 모든 계 층에 대해 독립적으로 및 모든 계수(K-1)에 대해 공통으로 보고되고, 여기서 K는 전술한 실시예 3B에서와 같이 정의된다. 따라서, 총 WB 보고 비트 수는 R이고, R은 계층 수(랭크 1 및 랭크 2에 대해 각각 1 및 2)이다. Alt 3K-2-3의 또 다른 예에서, ISB CB는 계층 독립적으로 및 계수 독립적으로 보고되고, 1 비트 WB CSI 보고는 모 든 계층에 대해 독립적으로 및 모든 계수(K-1)에 대해 독립적으로 보고되고, 여기서 K는 전술한 실시예 3B에서 와 같이 정의된다. 따라서, 총 WB 보고 비트 수는 R(K-1)이고, R은 계층 수이므로 랭크 1 및 랭크 2에 대한 비 트 수는 각각 K-1 및 2(K-1)이다.표 7"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "표 8"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "전술한 실시예 3E, 실시예 3F, 실시예 3G, 실시예 3H, 실시예 3I, 실시예 3J 및 실시예 3K 중 하나의 실시예만 따르는 WB 및 SB 진폭 양자화 코드북이 본 발명에서 구체적으로 명시될 것이다. 일부 실시예 3L에서, 4개의 안테나 포트(예를 들어, {3000, 3001, 3002, 3003}), 8개의 안테나 포트(예를 들어, {3000, 3001, …, 3007}), 12개의 안테나 포트(예를 들어, {3000, 3001, …, 3011}), 16개의 안테나 포 트(예를 들어, {3000, 3001, …, 3015}), 24개의 안테나 포트(예를 들어, {3000, 3001, …, 3023}) 및 32개의 안테나 포트(예를 들어, {3000, 3001, …, 3031})의 경우, UE가 Type2_Parameters로 설정된 상위 계층 매개변 수 CodebookType로 구성될 때, Type2_Parameters는 매개변수 {CodebookConfig-N1, CodebookConfig-N2, NumberOfBeams, PhaseAlphabetSize, SubbandAmplitude}를 포함한다. 그러한 실시예에서, N1 및 N2 값은 각각 상위 계층 매개변수 CodebookConfig-N1 및 CodebookConfig-N2로 구성된 다. CSI-RS 포트의 개수(PCSI-RS)는 2N1N2개이다. 그러한 실시예에서, L 값은 상위 계층 매개변수 NumberOfBeams로 구성되고, PCSI-RS = 4인 경우 L = 2이고 PCSI-RS > 4인 경우 L∈{2,3,4}이다. 그러한 실시예에서, Npsk 값은 상위 계층 매개변수 PhaseAlphabetSize로 구성되고, 여기서 Npsk∈{4, 8}의 Npsk = 4는 QPSK 위상 코드북을 표시하고 Npsk = 8은 8PSK 위상 코드북을 표시한다. 그러한 실시예에서, UE는 OFF 또는 ON 으로 설정된 상위 계층 매개변수 SubbandAmplitude로 구성된다. υ ≤ 2인 경우, υ는 관련 RI 값이고, 각각의 PMI 값은 코드북 인덱스 i1 및 i2에 대응하고, i1 및 i2는 다음과 같다. 코드북에 의해 결합된 L 벡터는 인덱스 i1,1 및 i1,2에 의해 식별되고, i1,1 및 i1,2는 다음과 같다. 및"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "계층(l, l=1,…,υ)에서 가장 강한 계수는 에 의해 식별된다. 진폭 계수 표시자 i1,4,l 및 i2,2,l는 l = 1,…,υ에 대해 다음과 같다."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "표시자 i1,4,l 및 i2,2,l는 각각 본 발명에서 전술한 바와 같이 계수 진폭의 WB 및 SB 구성 요소를 표시한다. 표 9 에 에서 WB 진폭 계수 로의 매핑이 제공되고 표 10에 에서 SB 진폭 계수 로의 매핑이 제공된다. 진폭 계수는 l = 1,…,υ에 대해 로 표현된다. 및 는 각각 WB 및 SB 진폭 구 성 요소에 대한 본 발명에서 이미 사용된 (또는 나중에 사용되는) 및 에 일대일로 매핑된다는 것을 유 의해야 한다. 표 9 표 10"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "위상 계수 표시자는 l = 1,…,υ에 대해 이다. 진폭 및 위상 계수 표시자는 다음과 같이 보고된다. 일 예에서, 표시자 = 7, 표시자 = 1, 표시자 = 0이고, 여기서 l = 1,…,υ이다. , 및 는 l = 1,…,υ에 대해 보고되지 않는다. 다른 예에서, i1,4,1(l = 1,…,υ)의 나머지 2L-1개 요소는 보고되고, 여기서 이다. Ml(l = 1,…,υ) 은 를 만족시키는 i1,4,1의 요소 개수이다. 또 다른 예에서, i2,1,l 및 i2,2,l (l = 1,…,υ)의 나머지 2L-1개 요소는 다음과 같이 보고된다. 일 예에서, SubbandAmplitude = OFF인 경우: l = 1,…,υ 및 i = 0, 1,…,2L-1에 대해 이다. i2,2,l은 l = 1,…,υ에 대해 보고되지 않고, l = 1,…,υ에 대해, 보고된 i1,4,1 요소에 의해 결정된 바와 같이 을 만족시키는 계수 에 대응하는 i2,2,l의 Ml-1개의 요소가 보고되고 이고, i2,1,l의 나머지 2L-Ml개 요소는 보고되지 않 고 으로 설정된다. 다른 예에서, SubbandAmplitude = ON인 경우, l = 1,…,υ에 대해, i1,4,l의 해당 요소에 의해 결정된 바와 같이 개의 가장 강한 계수에 대응하는 i2,2,l 및 i2,1,l의 요소가 보고되고, 및 이다. 값은 표 11에서 제공된다. i2,2,l의 개의 요소는 보고되지 않고 로 설정된다. 을 만족시키는 나머지 개의 계수에 대응하는 i2,1,l의 요소가 보고되고 이다. i2,1,l의 나머지 개 요소는 보고되지 않고 으로 설정되고, 보고된 i1,4,1의 2개 요소 및 이 동일( )한 경우, 요소 min(x,y)는 및 (l = 1,…,υ)에 대한 개의 가장 강한 계수의 집합에 포함되기 위해 우선 순위가 결정된다. 다른 대안에서, max(x,y)는 및 (l = 1,…, υ)에 대한 개의 가장 강한 계수의 집합에 포함되기 위해 우선 순위가 결정된다. 표 11 위상 계수는 수량 에 의해 결정되고. 는 다음과 같다."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "일부 실시예 3M에서, 4개의 안테나 포트(예를 들어, {3000, 3001, 3002, 3003}), 8개의 안테나 포트(예를 들어, {3000, 3001, …, 3007}), 12개의 안테나 포트(예를 들어, {3000, 3001, …, 3011}), 16개의 안테나 포 트(예를 들어, {3000, 3001, …, 3015}), 24개의 안테나 포트(예를 들어, {3000, 3001, …, 3023}) 및 32개의 안테나 포트(예를 들어, {3000, 3001, …, 3031})의 경우, UE가 Type2_Parameters로 설정된 상위 계층 매개변 수 CodebookType로 구성될 때, Type2_prameters는 매개변수 {CodebookConfig-N1, CodebookConfig-N2, NumberOfBeams, PhaseAlphabetSize, SubbandAmplitude, PortSelectionSamplingSize}를 포함한다. 그러한 실시예에서, CSI-RS 포트의 개수는 로 주어진다. 그러한 실시예에서, L 값은 상위 계층 매개변수 NumberOfBeams로 구성되고, 인 경우 L = 2이고, 인 경우 이다. 그러한 실시예에서, d 값은 상위 계층 매개변수 PortSelectionSamplingSize로 구성되고, 및 , 대안적으로 이다. 그러한 실시예에서, 값은 상위 계층 매개변수 PhaseAlphabetSize로 구성 되고, 여기서 Npsk∈{4, 8}의 Npsk = 4는 QPSK 위상 코드북을 표시하고 Npsk = 8은 8PSK 위상 코드북을 표시한다. 그러한 실시예에서, UE는 OFF 또는 ON으로 설정된 상위 계층 매개변수 SubbandAmplitude로 구성된다. υ ≤ 2인 경우, υ는 관련 RI 값이고, 각각의 PMI 값은 코드북 인덱스 i1 및 i2에 대응하고, i1 및 i2는 다음과 같다."}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "편광 별 L개의 안테나 포트는 인덱스(i1,1)에 의해 선택되고, 여기서 이다. 나머지 세부 사항은 전술한 실시예(예를 들어, 실시예 3L)와 동일하다. 일부 실시예 4에서, 진폭 정렬의 Alt-1-0 또는 Alt-1-1의 경우, 비트 할당은 2개의 편광에 대한 L개의 빔 각각 에 대해 공통이다 즉, L = 2개의 빔 및 최대 2 비트/진폭의 경우, 비트 할당은 표 12의 적어도 하나의 대안에 따르고; L = 2개의 빔 및 최대 3 비트/진폭의 경우, 비트 할당은 표 13의 적어도 하나의 대안에 따르고; L = 3 개의 빔 및 최대 2 비트/진폭의 경우, 비트 할당은 표 14의 적어도 하나의 대안에 따르고; L = 3개의 빔 및 최 대 비트/진폭의 경우, 비트 할당은 표 15의 적어도 하나의 대안에 따르고; L = 4개의 빔 및 최대 2 비트/진폭의 경우, 비트 할당은 표 16의 적어도 하나의 대안에 따르고; L = 4개의 빔 및 최대 3 비트/진폭의 경우, 비트 할 당은 표 17의 적어도 하나의 대안에 따른다. 비트 수가 인 경우, 진폭은 1(가장 강한 빔)이고, 인 경우, 진폭 코드북은 전술한 실시예 0에서 와 같다. 이들 대안에서, 가장 강한 빔은 2개의 편광(i = 0 및 L) 모두에 대해 공통이므로 해당 진폭은 보고되 지 않는다(1이라고 가정). UE는 {2, 3, 4}에 속하는 L 값 및 {2, 3}에 속하는 최대 비트 수/진폭 값으로 구성된다. 이러한 구성은 상위 계층 RRC 시그널링을 통해 구성된다. 다른 대안에서, UE는 바람직한 L 값을 보고(WB 보고)하고, {2, 3}에 속하 는 최대 비트 수/진폭 값은 RRC 시그널링을 통해 구성된다. 하나의 실시예에서, 표 12 내지 표 17에 있는 대안 중 단지 하나의 대안이 본 발명에서 지원된다. 다른 실시예 에서, UE는 상위 계층 RRC 또는 더 동적인 MAC CE 기반 또는 DCI 기반 시그널링을 통해 표 12 내지 표 17에 있 는 비트 할당 대안 중 하나로 구성된다. 또 다른 실시예에서, UE는 적어도 하나의 다른 WB CSI 보고와 함께 또 는 다른 WB CSI 보고로서 별도로 이러한 보고가 WB인 CSI 보고의 일부로서 바람직한 비트 할당을 보고한다. 표 12"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "표 13"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "표 14"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "표 15 표 16"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "표 17"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "일부 실시예 5에서, 진폭 정렬의 Alt 1-0 또는 Alt 1-1의 경우, 비트 할당은 2개의 편광에 대해 L개의 빔 각각 에 대해 공통이다 즉, L = 2개의 빔 및 최대 2 비트/진폭의 경우, 비트 할당은 표 18의 적어도 하나의 대안에 따르고; L = 2개의 빔 및 최대 3 비트/진폭의 경우, 비트 할당은 표 19의 적어도 하나의 대안에 따르고; L = 3 개의 빔 및 최대 2 비트/진폭의 경우, 비트 할당은 표 20의 적어도 하나의 대안에 따르고; L = 3개의 빔 및 최 대 3 비트/진폭의 경우, 비트 할당은 표 21의 적어도 하나의 대안에 따르고; L = 4개의 빔 및 최대 2 비트/진폭 의 경우, 비트 할당은 표 22의 적어도 하나의 대안에 따르고; L = 4개의 빔 및 최대 3 비트/진폭의 경우, 비트 할당은 표 23의 적어도 하나의 대안에 따른다. 비트 수 이면 진폭은 1이고, 이면 진폭 코드북은 전술한 실시예 0에서와 같다. 이들 대안에서, 가장 강한 빔은 2개의 편광 중 하나의 편광(i = 0)에 대응하므로 해당 진폭은 보고되지 않고(1이라고 가정), 다 른 편광(i = L)에 대응하는 진폭은 보고된다. UE는 {2, 3, 4}에 속하는 L 값 및 {2, 3}에 속하는 최대 비트 수/진폭 값으로 구성된다. 이러한 구성은 상위 계층 RRC 시그널링을 통해 구성된다. 다른 대안에서, UE는 바람직한 L 값(WB 보고)를 보고하고, {2, 3}에 속하 는 최대 비트 수/진폭 값은 RRC 시그널링을 통해 구성된다. 하나의 실시예에서, 표 18 내지 표 23에 있는 대안 중 하나의 대안만 사양에서 지원된다. 다른 방법에서, UE는 상위 계층 RRC 또는 더 동적인 MAC CE 기반 또는 DCI 기반 시그널링을 통해 표 18 내지 표 23에 있는 비트 할당 대안 중 하나의 대안으로 구성된다. 또 다른 대안에서, UE는 적어도 하나의 다른 WB CSI 보고와 함께 또는 다 른 WB CSI 보고로서 별도로, 이러한 보고가 WB인 CSI 보고의 일부로서 바람직한 비트 할당을 보고한다.표 18"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "표 19"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "표 20"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "표 21 표 22"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "표 23"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "일부 실시예 6에서, 진폭 정렬의 Alt 1-2 또는 Alt 1-3의 경우, 비트 할당은 2개의 편광 및 L개의 빔 각각에 대 해 독립적이다 즉, L = 2개의 빔 및 최대 2 비트/진폭의 경우, 비트 할당은 표 24의 적어도 하나의 대안에 따르 고; L = 2개의 빔 및 최대 3 비트/진폭의 경우, 비트 할당은 표 25의 적어도 하나의 대안에 따르고; L = 3개의 빔 및 최대 2 비트/진폭의 경우, 비트 할당은 표 26의 적어도 하나의 대안에 따르고; L = 3개의 빔 및 최대 3 비트/진폭의 경우, 비트 할당은 표 27의 적어도 하나의 대안에 따르고; L = 4개의 빔 및 최대 2 비트/진폭의 경 우, 비트 할당은 표 28의 적어도 하나의 대안에 따르고; L = 4개의 빔 및 최대 3 비트/진폭의 경우, 비트 할당 은 표 29의 적어도 하나의 대안에 따른다. 비트 수 이면 진폭은 1이고, 이면 진폭 코드북은 전술한 실시예 0에서와 같다는 것을 유의해야 한다. 이들 대안에서, 가장 강한 빔은 2개의 편광 중 하나의 편광(i = 0)에 대응하므로 해당 진폭은 보고되지 않고(1이라고 가정), 다른 편광(i = L)에 대응하는 진폭은 보고된다. 나머지 2L-2개의 계수에 대한 진폭은 독 립적으로 보고된다. UE는 {2, 3, 4}에 속하는 L 값 및 {2, 3}에 속하는 최대 비트 수/진폭 값으로 구성된다. 이러한 구성은 상위 계층 RRC 시그널링을 통해 구성된다. 다른 대안에서, UE는 바람직한 L 값(WB 보고)을 보고하고, {2, 3}에 속하 는 최대 비트 수/진폭 값은 RRC 시그널링을 통해 구성된다. 하나의 실시예에서, 표 24 내지 표 29의 대안 중 하나의 대안만 사양에서 지원된다. 다른 실시예에서, UE는 상 위 계층 RRC 또는 더 동적인 MAC CE 기반 또는 DCI 기반 시그널링을 통해 표 24 내지 표 29의 비트 할당 대안 중 하나로 구성된다. 또 다른 대안에서, UE는 적어도 하나의 다른 WB CSI 보고와 함께 또는 다른 WB CSI 보고 로서 별도로, 이러한 보고가 WB인 CSI 보고의 일부로서 바람직한 비트 할당을 보고한다. 표 24"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "표 25"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 28, "content": "표 26 표 27"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "표 28 표 29"}
{"patent_id": "10-2019-7024214", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 30, "content": "일부 실시예 7에서, 위상에 대한 비트 할당은 다음 중 적어도 하나에 따른다. Alt 7-0의 일 예에서, 위상에 대 한 비트 할당은 진폭에 대한 것과 동일하고 전술한 실시예 4 내지 실시예 6에 있는 비트 할당 대안 중 적어도 하나에 따른다. Alt 7-1의 다른 예에서, 위상에 대한 비트 할당은 진폭에 대한 것과 상이하고 전술한 실시예 4 내지 실시예 6에 있는 비트 할당 대안 중 적어도 하나에 따른다. Alt 7-2의 또 다른 예에서, 위상의 비트 할당 은 예를 들어 비트 할당이 2 비트 또는 3 비트로 동일하게 고정된다. 일부 실시예 8에서, UE는 {2, 3, 4}에 속하는 L 값, {2, 3}에 속하는 최대 비트 수/진폭 값, 및 진폭 양자화의 총 비트 또는/및 로 (RRC 시그널링을 통해) 구성된다. UE는 전술한 실시예 4 내지 실시예 6에 있는 비트 할당 대안 중 하나에 따라 양자화된 진폭을 보고한다. 구성된 진폭 양자화 총 비트의 값을 만족 시키는 하나 이상의 비트 할당 대안이 존재하는 경우, UE는 다른 WB CSI 보고와 함께 또는 다른 WB CSI 보고와별도로, 이러한 보고가 WB인 모든 그러한 비트 할당 대안 중에서 바람직한 비트 할당을 보고한다. 일부 실시예 9에서, UE는 다음의 대안 중 적어도 하나에 따른 진폭 또는/및 위상 보고에 대한 비트 할당으로 구 성된다. Alt 9-0의 일 예에서, 비트 할당은 모든 L에 대해 동일하다. Alt 9-1의 일 예에서, 비트 할당은 모든 L값에 대해 동일하지 않다. Alt 9-2의 일 예에서, 비트 할당은 구성에 따라 모든 L 값에 대해 동일하거나 동일 하지 않다. Alt 9-3의 일 예에서, 비트 할당은 L ≤ M에 대해서는 동일하고 L > M에 대해서는 동일하지 않다. M에 대한 예시적인 값은 2이다. M에 대한 다른 예시적인 값은 3이다. 도 13은 본 발명의 실시예에 따른 PMI 보고를 위한 방법의 흐름도를 도시한다. 방법은 본 발명의 실시예에 따른 UE, 예를 들어 UE에 의해 수행될 수 있다. 도 13에 도시된 방법의 실시예는 단지 예 시이다. 도 13은 특정 구현으로 본 발명의 범위를 제한하지 않는다. 방법은 UE가 PMI에 대한 보고를 생성하는 단계(단계 1305)로 시작된다. 단계 1305에서, 보고는 적어도 (ⅰ) 보 고를 위해 구성된 복수의 부대역에 대해 공통인 광대역 진폭 계수 표시자 및 (ⅱ) 부대역 진폭 계수 표시자 및 부대역 각각에 대한 부대역 위상 계수 표시자를 포함한다. 일부 실시예에서, 보고는 L은 보고를 위해 구성된 빔의 개수이고 υ는 보고된 PMI와 관련된 RI 값인 복수인 υ-계층 각각에 대해 및 부대역 각각에 대해 2*L 개의 빔 계수를 포함한다. 하나 이상의 빔 계수는 각각 (ⅰ) 부대역에 대해 공통인 광대역 진폭 계수 표시자 및 (ⅱ) 부대역 진폭 계수 표시자 및 부대역 각각에 대한 부대역 위상 계수 표시자를 포함한다. 또한, 빔 계수 중 적어도 하나는 다른 빔 계수를 보고하기 위해 사용되는 비트 수와 동일하지 않은 비트 수를 사용하여 보고된다. 다양한 실시예에서, UE는 υ-계층 각각에 대해 부대역에 대해 공통인 2*L 개의 빔 계수 중 가장 강한 빔 계수를 보고에 포함하고, 나머지 2*L-1개의 빔 계수를 2개의 그룹으로 그룹화한다. 이들 실시예에서, 2개의 그룹 중 제2 그룹의 빔 계수를 보고하는 데 더 적은 비트 수가 사용되기 때문에 2개의 그룹을 보고하는 데 동일하지 않 는 비트 수가 사용된다. 이들 실시예의 적어도 일부에서, 2개의 그룹 중 제1 그룹은 나머지 2*L-1개의 빔 계수 중 가장 강한 계수인 min(M,K)-1개의 빔 계수를 포함하고, 제2 그룹은 2L-min(M,K) 개의 빔 계수를 포함하고, 여기서 M은 광대역 진폭 계수 표시자는 0이 아닌 광대역 진폭 값을 표시하는 빔 계수의 개수이고, K는 양의 정 수이다. 이들 실시예에서, 보고는 제2 그룹의 빔 계수에 대한 부대역 진폭 계수 표시자를 포함하지 않는다. 일부 실시예에서, 나머지 2*L-1 개의 빔 계수를 2개의 그룹으로 그룹화하기 위해 사용된 가장 강한 계수는 빔 계수 각각에 대한 광대역 진폭 계수 표시자를 기반으로 하여 결정된다. 다양한 실시예에서, 제1 그룹에 있는 각각의 빔 계수에 대해, 3 비트는 광대역 진폭 계수 표시자를 보고하기 위 해 사용되고, 1 비트는 부대역 진폭 계수 표시자를 보고하기 위해 사용되고, 2 비트 또는 3 비트는 부대역 위상 계수 표시자를 보고하기 위해 구성된다. 제2 그룹의 경우, 각각의 빔 계수에 대해 3 비트는 광대역 진폭 계수 표시자를 보고하기 위해 사용되고, 광대역 진폭 계수 표시자가 0이 아닌 광대역 진폭 값을 표시하는 M - min(M,K) 개의 빔 계수에서 각각의 빔 계수에 대해 2 비트가 부대역 위상 계수 표시자를 보고하기 위해 사용되 고, 광대역 진폭 계수 표시자가 0인 광대역 진폭 값을 표시하는 나머지 2L - M개의 빔 계수에 대해 광대역 위상 계수 표시자는 보고되지 않는다. 이후, UE는 BS에 생성된 PMI에 대한 보고를 전송한다(단계 1310). 단계 1310에서, UE는 BS, 예를 들어 BS에 PMI를 보고한다. 예시적인 실시예로 본 발명을 기술하였지만, 다양한 변경 및 수정이 당업자에게 제안될 수 있다. 본 발명은 첨 부된 청구 범위의 범위 내에 속하는 그러한 변경 및 수정을 포함하는 것으로 의도된다. 본 출원의 설명은 특정 요소, 단계 또는 기능이 청구 범위에 포함되어야 하는 필수 요소임을 암시하는 것으로 해석되어서는 안된다. 특허된 주제의 범위는 청구 범위에 의해서만 정의된다. 또한, 분사 다음에 \"~를 위한 수단\"이라는 정확한 단어가 없다면, 어떠한 청구 범위도 35 U.S.C. § 112(f)를 호출하려는 의도는 없다.도면 도면1 도면2 도면3 도면4a 도면4b 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2019-7024214", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명 및 본 발명의 장점에 대한 보다 완전한 이해를 위해, 유사 참조 번호는 유사 부품을 나타내는 첨부 도 면과 함께 제공된 다음의 설명을 참조한다. 도 1은 본 발명의 실시예에 따른 예시적인 무선 네트워크를 도시한다. 도 2는 본 발명의 실시예에 따른 예시적인 eNB를 도시한다. 도 3은 본 발명의 실시예에 따른 예시적인 UE를 도시한다. 도 4a는 본 발명의 실시예에 따른 직교 주파수 분할 다중 액세스 송신 경로의 하이-레벨 다이어그램을 도시한다. 도 4b는 본 발명의 실시예에 따른 직교 주파수 분할 다중 액세스 수신 경로의 하이-레벨 다이어그램을 도시한다. 도 5는 본 발명의 실시예에 따른 서브프레임에서의 PDSCH에 대한 송신기 블록도를 도시한다. 도 6은 본 발명의 실시예에 따른 서브프레임에서의 PDSCH에 대한 수신기 블록도를 도시한다. 도 7은 본 발명의 실시예에 따른 서브프레임에서의 PUSCH에 대한 송신기 블록도를 도시한다. 도 8은 본 발명의 실시예에 따른 서브프레임에서의 PUSCH에 대한 수신기 블록도를 도시한다. 도 9는 본 발명의 실시예에 따른 예시적인 두 슬라이스의 멀티플렉싱을 도시한다.도 10은 본 발명의 실시예에 따른 예시적인 안테나 블록을 도시한다. 도 11은 본 발명의 실시예에 따른 예시적인 네트워크 구성을 도시한다. 도 12는 본 발명의 실시예에 따른 예시적인 2D 안테나 포트 레이아웃을 도시한다. 도 13은 본 발명의 실시예에 따른 PMI 보고를 위한 방법의 흐름도를 도시한다."}
