{"patent_id": "10-2019-0168949", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0077843", "출원번호": "10-2019-0168949", "발명의 명칭": "자율주행 차량 정보를 이용한 VR 게임 제공 방법 및 시스템", "출원인": "이휘원", "발명자": "이휘원"}}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량에 구비된 카메라(Camera), 레이더(Radar), 라이다(Lidar), 위치측위모듈을 이용하여 주변 상황을 인지한주변 상황 정보를 생성하고, 상기 주변 상황 정보를 기반으로 상기 차량이 자율주행하도록 제어하면서 차량 제어 정보를 생성하고, 상기 주변 상황 정보와 상기 차량 제어 정보를 포함하는 상기 차량에 대한 자율주행정보를생성하는 자율주행장치;상기 차량에 탑재한 사용자의 신체에 착용되어, 상기 신체의 움직임에 따른 신체 움직임 정보를 생성하는 웨어러블 디바이스(Wearable Device);수신된 상기 자율주행정보에 포함된 상기 주변 상황 정보와 상기 차량 제어 정보를 추출하고, 상기 주변 상황정보와 상기 차량 제어 정보를 기반으로 가상 게임 데이터를 생성하여 출력하는 게임 제공 서버; 및상기 차량에 탑재한 사용자의 머리에 착용되어, 가상 게임 데이터를 출력하면서, 상기 머리의 움직임에 대응하는 시선 정보에 따라 상기 가상 게임 데이터의 시점(Viewpoint)이 이동하도록 하며, 상기 신체 움직임 정보에따라 상기 가상 게임 데이터를 갱신하여 출력하는 HMD(Head Mounted Display);를 포함하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 자율주행장치는,상기 카메라(Camera)로 촬영된 영상 데이터를 생성하고,상기 레이더(Radar) 또는 상기 라이다(Lidar)를 이용하여 주변에 위치한 객체를 인지한 객체인지정보를 생성하고,상기 위치측위모듈을 이용하여 상기 차량의 이동에 따라 변화하는 현재 위치 정보를 실시간으로 산출하고,상기 영상 데이터, 상기 객체인지정보, 상기 현재 위치 정보를 기반으로 상기 차량이 자율주행하도록 하는 것을특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 자율주행장치는,상기 주변 상황 정보를 기반으로 입력된 목적지까지 상기 차량이 자율주행하도록 하며,상기 현재 위치 정보를 기반으로 인근의 디지탈 맵을 추출하거나 외부 서버로부터 수신하고, 상기 디지탈 맵을상기 HMD 및 상기 게임 제공 서버로 전송하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 게임 제공 서버는,상기 객체인지정보, 상기 현재위치정보, 상기 가상 게임 데이터를 상기 디지탈 맵상에 매칭하여 출력하도록 제어하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2021-0077843-3-제4항에 있어서,상기 게임 제공 서버는,상기 현재 위치 정보를 기반으로 상기 차량이 특정 지역에 진입하는 경우, 상기 특정 지역에 대응하는 마스코트또는 게임 캐릭터를 추출하고, 상기 마스코트 또는 상기 게임 캐릭터를 상기 가상 게임 데이터에 반영하는 것을특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 게임 제공 서버는,상기 디지탈 맵 상에 상기 영상 데이터를 기반으로 인지한 도로 및 건물에 상기 마스코트 또는 상기 게임 캐릭터가 매칭되어 출력되도록 제어하며, 상기 시선 정보, 상기 신체 움직임 정보를 기반으로 상기 마스코트 또는상기 게임 캐릭터가 파괴되거나 폭발하도록 제어하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 자율주행장치는,상기 디지탈 맵으로부터 상기 레이더 또는 상기 라이다를 이용하여 상기 현재 위치 정보를 중심으로 기 설정된반경 내의 주위 표지판 정보를 읽어온 후 상기 게임 제공 서버로 전송하는 것을 특징으로 하는 자율주행 차량정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 게임 제공 서버는,상기 주위 표지판 정보에 대응한 게임 데이터를 추출하여 상기 가상 게임 데이터에 반영하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 게임 제공 서버는,상기 차량 제어 정보로부터 차량 조향 정보, 가속정보, 제동정보를 추출하고, 상기 차량 조향 정보에 따라 상기 마스코트 또는 상기 게임 캐릭터가 좌측 또는 우측으로 이동하도록 제어하며,상기 가속정보 및 상기 제동정보에 따라 상기 마스코트 또는 상기 게임 캐릭터가 상측 또는 하측으로 이동하도록 제어하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 게임 제공 서버는,상기 디지탈 맵 상에서 상기 현재위치정보를 기반으로 사용자 캐릭터의 위치를 설정하고, 상기 마스코트 또는 상기 게임 캐릭터가 기 설정된 인공지능으로 상기 사용자 캐릭터를 공격 대상으로 공격하도록 제어하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2021-0077843-4-제10항에 있어서,상기 게임 제공 서버는,상기 시선 정보, 상기 신체 움직임 정보가 상기 디지탈 맵 상에 상기 마스코트 또는 상기 게임 캐릭터가 조준된상태 판별된 상태에서 상기 신체 움직임 정보 중 제1 특정 동작이 판별되면 발사 명령어로 인지하여, 상기 마스코트 또는 상기 게임 캐릭터 파괴되거나 폭발하도록 제어하는 것을 특징으로 하는 자율주행 차량 정보를 이용한VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 게임 제공 서버는,상기 신체 움직임 정보 중 제2 특정 동작이 판별되면 무기 교체 명령어 또는 탄창 장전 명령어로 인지하여, 상기 사용자 캐릭터의 무기 교체 또는 탄창 장전이 이루어지도록 제어하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 자율주행장치와 상기 게임 제공 서버는 V2X(Vehicle to Everything)를 기반으로 통신하는 것을 특징으로하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "차량에 구비된 카메라(Camera), 레이더(Radar), 라이다(Lidar), 위치측위모듈을 이용하여 주변 상황을 인지한주변 상황 정보를 생성하고, 상기 주변 상황 정보를 기반으로 상기 차량이 자율주행하도록 제어하면서 차량 제어 정보를 생성하고, 상기 주변 상황 정보와 상기 차량 제어 정보를 포함하는 상기 차량에 대한 자율주행정보를생성하는 자율주행장치;상기 차량에 탑재한 사용자의 신체에 착용되어, 상기 신체의 움직임에 따른 신체 움직임 정보를 생성하는 웨어러블 디바이스(Wearable Device);수신된 상기 자율주행정보에 포함된 상기 주변 상황 정보와 상기 차량 제어 정보를 추출하고, 상기 주변 상황정보와 상기 차량 제어 정보를 기반으로 가상 게임 데이터를 생성하여 출력하는 게임 제공 서버;상기 차량의 전면 윈도우의 일측에 설치되어 상기 가상 게임 데이터를 출력하면서, 상기 신체 움직임 정보에 따라 상기 가상 게임 데이터를 갱신하여 출력하는 HUD(Head UP Display);를 포함하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템."}
{"patent_id": "10-2019-0168949", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "자율주행 차량 정보를 이용한 VR 게임 제공 방법 및 시스템을 개시한다. 본 실시예는 자율주행차량 내부에서 차량 이동시에, 차량의 외부 정보를 기초로 가상게임을 제공하는 기술로서, 자율주행 차량에 구비된 카메라, 레이더, 라이다를 이용하여 주변 상황을 인지한 후, 주변 상황 인지 결과를 기 반으로 판단한 결과를 차용하고, 판단한 결과 내에서 차량 내 HMD를 이용하여 자율주행차량과 정보를 주고받는 VR 게임 데이터를 송수신하는 자율주행 차량 정보를 이용한 VR 게임 제공 방법 및 시스템을 제공하는 데 목적이 있다."}
{"patent_id": "10-2019-0168949", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 실시예는 자율주행 차량 정보를 이용한 VR 게임 제공 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2019-0168949", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에 기술되는 내용은 단순히 본 실시예와 관련되는 배경 정보만을 제공할 뿐 종래기술을 구성하는 것이 아니 다. 일반적인 게임은 사용자가 모니터를 보면서 조이스틱이나 키보드와 같은 간단한 조작 수단을 이용하여 화면에 나타나는 게임 상황에 따라 게임을 즐긴다. 사용자는 게임의 상황을 실제로 경험하는 것과 같은 체험은 할 수 없어, 한계가 존재한다. 최근 들어, 가상현실(VR: Virtual Reality)을 게임에 적용하는 경우 사용자가 실제 상 황처럼 경험할 수 있으므로 게임의 몰입도를 증가시킬 수 있다.가상현실 시스템은 사용자의 시점과 동작이 실현되는 가상의 환경을 제공한다. 일반적으로 가상현실 시스템은 사용자의 시점이나 동작의 변화를 가상의 공간에서 실제로 행하도록 하거나 가상현실 공간에서 인간의 신체를 대신하여 행위를 수행하여 가상 환경을 사용자가 경험할 수 있도록 한다. 가상현실 시스템은 가상현실 환경에서 인터랙션 디바이스들을 이용하여 입력용 센서로부터 입력된 센싱 정보를 기반으로 사용자의 다양한 정보를 인식 한다. 1인칭 슈팅 게임(FPS: First-Person Shooter)은 사용자의 시점, 즉 1인칭 시점에서 총기류를 이용해 전투를 벌 이는 슈팅 게임을 의미한다. 게임 속 캐릭터의 시점과 사용자의 시점이 동일해야 하기 때문에 보통 3D 방식으로 제작된다. 다른 게임에 비해 높은 사실감이 필요하기 때문에, 가상현실 기술을 적용한 게임을 개발하기에 적합 하다고 볼 수 있다. 1인칭 슈팅 게임에 가상현실 기술을 적용시켜 실감형 게임을 개발을 필요로 한다."}
{"patent_id": "10-2019-0168949", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 실시예는 자율주행차량 내부에서 차량 이동시에, 차량의 외부 정보를 기초로 가상게임을 제공하는 기술로서, 자율주행 차량에 구비된 카메라, 레이더, 라이다를 이용하여 주변 상황을 인지한 후, 주변 상황 인지 결과를 기 반으로 판단한 결과를 차용하고, 판단한 결과 내에서 차량 내 HMD를 이용하여 자율주행차량과 정보를 주고받는 VR 게임 데이터를 송수신하는 자율주행 차량 정보를 이용한 VR 게임 제공 방법 및 시스템을 제공하는 데 목적이 있다."}
{"patent_id": "10-2019-0168949", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 실시예의 일 측면에 의하면, 차량에 구비된 카메라(Camera), 레이더(Radar), 라이다(Lidar), 위치측위모듈을 이용하여 주변 상황을 인지한 주변 상황 정보를 생성하고, 상기 주변 상황 정보를 기반으로 상기 차량이 자율주 행하도록 제어하면서 차량 제어 정보를 생성하고, 상기 주변 상황 정보와 상기 차량 제어 정보를 포함하는 상기 차량에 대한 자율주행정보를 생성하는 자율주행장치; 상기 차량에 탑재한 사용자의 신체에 착용되어, 상기 신체 의 움직임에 따른 신체 움직임 정보를 생성하는 웨어러블 디바이스(Wearable Device); 수신된 상기 자율주행정 보에 포함된 상기 주변 상황 정보와 상기 차량 제어 정보를 추출하고, 상기 주변 상황 정보와 상기 차량 제어 정보를 기반으로 가상 게임 데이터를 생성하여 출력하는 게임 제공 서버; 및 상기 차량에 탑재한 사용자의 머리 에 착용되어, 가상 게임 데이터를 출력하면서, 상기 머리의 움직임에 대응하는 시선 정보에 따라 상기 가상 게 임 데이터의 시점(Viewpoint)이 이동하도록 하며, 상기 신체 움직임 정보에 따라 상기 가상 게임 데이터를 갱신 하여 출력하는 HMD(Head Mounted Display);를 포함하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게 임 제공 시스템을 제공한다. 본 실시예의 다른 측면에 의하면, 차량에 구비된 카메라(Camera), 레이더(Radar), 라이다(Lidar), 위치측위모듈 을 이용하여 주변 상황을 인지한 주변 상황 정보를 생성하고, 상기 주변 상황 정보를 기반으로 상기 차량이 자 율주행하도록 제어하면서 차량 제어 정보를 생성하고, 상기 주변 상황 정보와 상기 차량 제어 정보를 포함하는 상기 차량에 대한 자율주행정보를 생성하는 자율주행장치; 상기 차량에 탑재한 사용자의 신체에 착용되어, 상기 신체의 움직임에 따른 신체 움직임 정보를 생성하는 웨어러블 디바이스(Wearable Device); 수신된 상기 자율주 행정보에 포함된 상기 주변 상황 정보와 상기 차량 제어 정보를 추출하고, 상기 주변 상황 정보와 상기 차량 제 어 정보를 기반으로 가상 게임 데이터를 생성하여 출력하는 게임 제공 서버; 상기 차량의 전면 윈도우의 일측에 설치되어 상기 가상 게임 데이터를 출력하면서, 상기 신체 움직임 정보에 따라 상기 가상 게임 데이터를 갱신하 여 출력하는 HUD(Head UP Display);를 포함하는 것을 특징으로 하는 자율주행 차량 정보를 이용한 VR 게임 제공 시스템을 제공한다."}
{"patent_id": "10-2019-0168949", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이 본 실시예에 의하면, 자율주행차량 내부에서 차량 이동시에, 차량의 외부 정보를 기 초로 가상게임을 제공하는 기술로서, 자율주행 차량에 구비된 카메라, 레이더, 라이다를 이용하여 주변 상황을 인지한 후, 주변 상황 인지 결과를 기반으로 판단한 결과를 차용하고, 판단한 결과 내에서 차량 내 HMD를 이용 하여 자율주행차량과 정보를 주고받는 VR 게임 데이터를 송수신할 수 있는 효과가 있다."}
{"patent_id": "10-2019-0168949", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 실시예에 따른 자율주행 차량 정보를 이용한 VR 게임 제공 시스템을 나타낸 도면이다. 본 실시예에 따른 VR(Virtual Reality) 게임 제공 시스템은 자율주행차량 내부에 탑재된 자율주행장치 에서 차량의 외부 정보를 기초로 차량이 자율주행하도록 제어하고, 게임 제공 서버에서 자율주행장치 로부터 수신된 자율주행정보를 기반으로 가상 게임 데이터를 생성하여 자율주행장치 내에 HMD 또는 HUD에 출력되도록 한다. 본 실시예에 따른 VR 게임 제공 시스템은 자율주행차량, 자율주행장치, 게임 제공 서버, 웨어러 블 디바이스, HMD를 포함한다. VR 게임 제공 시스템에 포함된 구성요소는 반드시 이에 한정되는 것은 아니다. 자율주행장치는 자율주행차량에 구비된 카메라, 레이더, 라이다를 이용하여 외부 환경 정보를 인지하 고 차량이 자율 주행하도록 한다. 게임 제공 서버는 자율주행장치로부터 수신된 자율주행정보를 기반 으로 가상 게임 데이터를 생성하여 자율주행장치 내에 HMD 또는 HUD로 전송한다. HMD 또는 HUD 는 게임 제공 서버와 데이터를 송수신하면서 가상 게임 데이터를 출력한다. 자율주행장치는 차량에 구비된 카메라(Camera), 레이더(Radar), 라이다(Lidar), 위치측위모듈을 이용 하여 주변 상황을 인지한 주변 상황 정보를 생성한다. 자율주행장치는 주변 상황 정보를 기반으로 차량 이 자율주행하도록 제어하면서 차량 제어 정보를 생성한다. 자율주행장치는 주변 상황 정보와 차량 제어 정보를 포함하는 차량에 대한 자율주행정보를 생성한다. 자율주행장치는 차량 내에 구비된 카메라(Camera)로 촬영된 영상 데이터를 생성한다. 자율주행장치 는 차량 내에 구비된 레이더(Radar) 또는 라이다(Lidar)를 이용하여 주변에 위치한 객체를 인지한 객 체인지정보(사람, 차량, 사물 인지 정보)를 생성한다. 자율주행장치는 차량 내에 구비된 위치측위모 듈을 이용하여 차량의 이동에 따라 변화하는 현재 위치 정보를 실시간으로 산출한다. 자율주행장치는 영상 데이터, 객체인지정보, 현재 위치 정보를 기반으로 차량이 자율주행하도록 제어한다. 자율주행장치는 주변 상황 정보를 기반으로 입력된 목적지까지 차량이 자율주행하도록 하며, 현재 위 치 정보를 기반으로 인근(약 1km~수십 km)의 디지탈 맵을 추출하거나 외부 서버로부터 수신하고, 디지탈 맵을 HMD 및 게임 제공 서버로 전송한다. 자율주행장치는 디지탈 맵으로부터 레이더 또는 라이다를 이용하여 현재 위치 정보를 중심으로 기 설정된 반경(20~30m) 내의 주위 표지판 정보(표지판)을 읽어온 후 게임 제공 서버로 전송한다. 게임 제공 서버는 수신된 자율주행정보에 포함된 주변 상황 정보와 차량 제어 정보를 추출한다. 게임 제공 서버는 주변 상황 정보와 차량 제어 정보를 기반으로 가상 게임 데이터를 생성하여 출력한다. 게임 제공 서버는 객체인지정보, 현재위치정보, 가상 게임 데이터를 디지탈 맵상에 매칭하여 출력하도록 제어한다. 웨어러블 디바이스(Wearable Device)는 차량에 탑재한 사용자의 신체에 착용되어, 신체의 움직임에 따른 신체 움직임 정보를 생성한다. HMD(Head Mounted Display)는 사용자의 머리 부분에 착용되어 사용자의 눈 앞에 직접 영상이 출력되도록 하는 디스플레이 장치를 의미한다. HMD(Head Mounted Display)는 차량에 탑재한 사용자의 머리에 착 용되어, 가상 게임 데이터를 출력한다. HMD는 가상 게임 데이터를 출력하면서, 머리의 움직임에 대응하는 시선 정보에 따라 가상 게임 데이터의 시점(Viewpoint)이 이동하도록 한다. HMD는 가상 게임 데이터를 출 력하면서, 신체 움직임 정보에 따라 가상 게임 데이터를 갱신한다.도 2는 본 실시예에 따른 게임 제공 서버의 동작 과정을 설명하기 위한 도면이다. 게임 제공 서버는 특정 지역을 기준의 게임 컨텐츠를 특화시켜서 출력한다. 예컨대, 게임 제공 서버 는 특정 지역에 자율주행차량이 진입하면, 해당 지역의 마스코트 또는 해당 지역에 부합하는 몬스터, 캐릭 터를 추출하여 해당 지역에서 출몰하도록 제어한다. 자율주행장치는 현재 GPS 위치 및 디지털 맵과 라이다 등의 센서 수집 정보를 기반으로 현재 위치 정보를 산출한다. 자율주행장치는 현재 위치 주변의 디지탈 맵을 추출하여 자율주행차량 내부로 읽어온다. 자율주행장치는 자율주행차량 내의 HMD로 현재 위치 주변의 디지탈 맵을 전송한다. HMD는 현재 위치 주변의 디지탈 맵을 출력한다. 게임 제공 서버는 자율주행장치로부터 디지탈 맵을 수신한 후 디지탈 맵을 기반으로 가상 게임 데이터를 제공한다. 게임 제공 서버와 자율주행장치는 V2X(Vehicle to Everything)통신으로 고속 통신을 수행하므로 3차 원 대용량 데이터를 빠르게 송수신한다. 자율주행장치는 게임 제공 서버와 통신하면서 자율주행차량 내에 구비된 레이더(Radar) 또는 라 이다(Lidar)를 이용하여 목적지까지 자율주행을 수행한다. 자율주행장치는 현재 위치를 기반으로 인근(약 1km~수십 km)의 디지탈 맵을 추출하거나 외부 서버로부터 수신한다. 자율주행장치는 디지탈맵이 HMD 또는 HUD로 전송한다. 자율주행장치는 라이다를 이용하여 반경(20~30m) 내의 주위 표지판 정보를 읽어와서 게임 제공 서버로 전송한다. 자율주행장치는 디지탈 맵과 LIDAR 센싱 정보를 비교하여 자기 위치를 특정한다. 게임 제공 서버는 수신된 자율주행정보에 포함된 주변 상황 정보와 차량 제어 정보를 추출한다. 게임 제공 서버는 주변 상황 정보와 차량 제어 정보를 기반으로 가상 게임 데이터를 생성하여 출력한다. 게임 제공 서버는 객체인지정보, 현재위치정보, 가상 게임 데이터를 디지탈 맵상에 매칭하여 출력하도록 제어한다. 게임 제공 서버는 현재 위치 정보를 기반으로 차량이 특정 지역에 진입하는 경우, 특정 지역에 대응하는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)를 추출한다. 게임 제공 서버는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)를 가상 게임 데이터에 반영한다. 게임 제공 서버는 디지탈 맵 상에 영상 데이터를 기반으로 인지한 도로 및 건물에 마스코트 또는 게임 캐 릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 매칭되어 출력되도록 제어한다. 게임 제공 서버는 시선 정보, 신체 움직임 정보를 기반으로 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 파괴되 거나 폭발하도록 제어한다. 게임 제공 서버는 주위 표지판 정보에 대응한 게임 데이터(시나리오 데이터, 타겟 캐릭터)를 추출하여 가 상 게임 데이터에 반영한다. 게임 제공 서버는 차량 제어 정보로부터 차량 조향 정보, 가속정보, 제동정보를 추출한다. 게임 제공 서버 는 차량 조향 정보에 따라 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 좌측 또는 우측으로 이동하도록 제어한다. 게임 제공 서버는 가속정보 및 제동정보에 따라 마스코트 또는 게임 캐릭 터(150-1, 150-2, 150-3, 150-4, 150-5)가 상측 또는 하측으로 이동하도록 제어한다. 게임 제공 서버는 디지탈 맵 상에서 현재위치정보를 기반으로 사용자 캐릭터의 위치를 설정한다. 게임 제 공 서버는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 기 설정된 인공지능으로 사 용자 캐릭터를 공격 대상으로 공격하도록 제어한다. 게임 제공 서버는 시선 정보, 신체 움직임 정보가 디지탈 맵 상에 마스코트 또는 게임 캐릭터(150-1, 150- 2, 150-3, 150-4, 150-5)가 조준된 상태 판별된 상태에서 신체 움직임 정보 중 제1 특정 동작이 판별되면 발사 명령어로 인지하여, 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 파괴되거나 폭발하도록 제어한다. 게임 제공 서버는 신체 움직임 정보 중 제2 특정 동작이 판별되면 무기 교체 명령어 또는 탄창 장전 명령 어로 인지하여, 사용자 캐릭터의 무기 교체 또는 탄창 장전이 이루어지도록 제어한다. 자율주행장치와 게임 제공 서버는 V2X(Vehicle to Everything)를 기반으로 통신한다. 도 3은 본 실시예에 따른 자율주행 차량 정보를 이용한 VR 게임 제공 방법을 나타낸 도면이다. 자율주행장치는 차량에 구비된 카메라(Camera), 레이더(Radar), 라이다(Lidar), 위치측위모듈을 이용 하여 주변 상황을 인지한 주변 상황 정보를 생성한다(S310). 단계 S310에서, 자율주행장치는 차량 내에 구비된 카메라(Camera)로 촬영된 영상 데이터를 생성한다. 자율주행장치는 차량 내에 구비된 레이더(Radar) 또는 라이다(Lidar)를 이용하여 주변에 위치한 객체 를 인지한 객체인지정보를 생성한다. 자율주행장치는 차량 내에 구비된 위치측위모듈을 이용하여 차 량의 이동에 따라 변화하는 현재 위치 정보를 실시간으로 산출한다. 단계 S310에서, 자율주행장치는 영상 데이터, 객체인지정보, 현재 위치 정보를 주변 상황 정보로 패키징한 다. 자율주행장치는 주변 상황 정보를 기반으로 차량이 자율주행하도록 제어하면서 차량 제어 정보를 생 성한다(S320). 단계 S320에서, 자율주행장치는 영상 데이터, 객체인지정보, 현재 위치 정보를 기반으로 차 량이 자율주행하도록 제어한다. 자율주행장치는 주변 상황 정보와 차량 제어 정보를 포함하는 차량에 대한 자율주행정보를 생성한다 (S330). 단계 S330에서 자율주행장치는 디지탈 맵으로부터 레이더 또는 라이다를 이용하여 현재 위치 정보 를 중심으로 기 설정된 반경(20~30m) 내의 주위 표지판 정보(표지판)을 읽어온 후 게임 제공 서버로 전송 한다. 게임 제공 서버는 수신된 자율주행정보에 포함된 주변 상황 정보와 차량 제어 정보를 추출한다. 게임 제공 서버는 주변 상황 정보와 차량 제어 정보를 기반으로 가상 게임 데이터를 생성하여 HMD 또는 HUD로 출력한다(S340). 단계 S340에서, 자율주행장치는 주변 상황 정보를 기반으로 입력된 목적지까지 차량이 자율주행하도 록 하며, 현재 위치 정보를 기반으로 인근(약 1km~수십 km)의 디지탈 맵을 추출하거나 외부 서버로부터 수신하 고, 디지탈 맵을 HMD로 전송한다. 게임 제공 서버는 객체인지정보, 현재위치정보, 가상 게임 데이터 를 디지탈 맵상에 매칭하여 출력하도록 제어한다. 게임 제공 서버는 현재 위치 정보를 기반으로 차량이 특정 지역에 진입하는 경우, 특정 지역에 대응하는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)를 추출한다. 게임 제공 서버는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)를 가상 게임 데이터에 반영한다. 게임 제공 서버는 디지탈 맵 상에 영상 데이터를 기반으로 인지한 도로 및 건물에 마스코트 또는 게임 캐 릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 매칭되어 출력되도록 제어한다. 게임 제공 서버는 시선 정보, 신체 움직임 정보를 기반으로 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 파괴되 거나 폭발하도록 제어한다. 게임 제공 서버는 주위 표지판 정보에 대응한 게임 데이터(시나리오 데이터, 타겟 캐릭터)를 추출하여 가 상 게임 데이터에 반영한다. 게임 제공 서버에서 웨어러블 디바이스로부터 수신된 신체 움직임 정보를 가상 게임 정보에 반영한다(S350). 단 계 S350에서, 게임 제공 서버는 디지탈 맵 상에 영상 데이터를 기반으로 인지한 도로 및 건물에 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 매칭되어 HMD 또는 HUD로 출력되도록 제어한다. 게임 제공 서버는 시선 정보, 신체 움직임 정보를 기반으로 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 파괴되거나 폭발하도록 제어한다. 게임 제공 서버는 디지탈 맵 상에서 현재위치정보를 기반으로 사용자 캐릭터의 위치를 설정한다. 게임 제 공 서버는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 기 설정된 인공지능으로 사 용자 캐릭터를 공격 대상으로 공격하도록 제어한다. 게임 제공 서버는 차량 제어 정보로부터 차량 조향 정보, 가속정보, 제동정보를 추출한다. 게임 제공 서버 는 차량 조향 정보에 따라 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 좌측 또는 우측으로 이동하도록 제어한다. 게임 제공 서버는 가속정보 및 제동정보에 따라 마스코트 또는 게임 캐릭 터(150-1, 150-2, 150-3, 150-4, 150-5)가 상측 또는 하측으로 이동하도록 제어한다. 게임 제공 서버는 시선 정보, 신체 움직임 정보가 디지탈 맵 상에 마스코트 또는 게임 캐릭터(150-1, 150- 2, 150-3, 150-4, 150-5)가 조준된 상태 판별된 상태에서 신체 움직임 정보 중 제1 특정 동작이 판별되면 발사 명령어로 인지하여, 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 파괴되거나 폭발하도록 제어한다. 게임 제공 서버는 신체 움직임 정보 중 제2 특정 동작이 판별되면 무기 교체 명령어 또는 탄창 장전 명령 어로 인지하여, 사용자 캐릭터의 무기 교체 또는 탄창 장전이 이루어지도록 제어한다. HMD는 차량에 탑재한 사용자의 머리에 착용되어, 가상 게임 데이터를 출력한다. HMD는 가상 게 임 데이터를 출력하면서, 머리의 움직임에 대응하는 시선 정보에 따라 가상 게임 데이터의 시점(Viewpoint)이 이동하도록 한다. HMD는 가상 게임 데이터를 출력하면서, 신체 움직임 정보에 따라 가상 게임 데이터를 갱 신한다(S360). 단계 S360에서, 별도의 HMD가 설치되어 있지 않은 경우, HUD는 차량의 전면 윈도우의 일측에 설 치되어 가상 게임 데이터를 출력하면서, 신체 움직임 정보에 따라 가상 게임 데이터를 갱신하여 출력한다. 도 3에서는 단계 S310 내지 단계 S360을 순차적으로 실행하는 것으로 기재하고 있으나, 반드시 이에 한정되는 것은 아니다. 다시 말해, 도 3에 기재된 단계를 변경하여 실행하거나 하나 이상의 단계를 병렬적으로 실행하는 것으로 적용 가능할 것이므로, 도 3은 시계열적인 순서로 한정되는 것은 아니다. 전술한 바와 같이 도 3에 기재된 본 실시예에 따른 자율주행 차량 정보를 이용한 VR 게임 제공 방법은 프로그램 으로 구현되고 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 본 실시예에 따른 자율주행 차량 정보를 이 용한 VR 게임 제공 방법을 구현하기 위한 프로그램이 기록되고 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스 템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 도 4는 본 실시예에 따른 HMD를 이용하여 자율주행 차량 정보를 이용한 VR 게임 출력을 나타낸 도면이다. 게임 제공 서버는 자율주행차량이 주행하고 있는 도로 및 주변 건물 등에서 적 또는 괴물 등이 등장 하도록 한다. 자율주행차량 내에 승객은 도 4에 도시된 바와 같이, HMD를 착용한 후 웨어러블 디바이 스(예컨대, 총)을 이용하여 적 또는 괴물을 사격한다. 게임 제공 서버는 현재 위치 정보를 기반으로 차량이 특정 지역에 진입하는 경우, 특정 지역에 대응하는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)를 추출한다. 게임 제공 서버는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)를 가상 게임 데이터에 반영하여 HMD로 출력한다. 게임 제공 서버는 디지탈 맵 상에 영상 데이터를 기반으로 인지한 도로 및 건물에 마스코트 또는 게임 캐 릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 매칭되어 HMD로 출력되도록 제어한다. 게임 제공 서버 는 시선 정보, 신체 움직임 정보를 기반으로 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150- 5)가 파괴되거나 폭발하도록 HMD를 제어한다. 게임 제공 서버는 시선 정보, 신체 움직임 정보가 디지탈 맵 상에 마스코트 또는 게임 캐릭터(150-1, 150- 2, 150-3, 150-4, 150-5)가 조준된 상태 판별된 상태에서 신체 움직임 정보 중 제1 특정 동작이 판별되면 발사 명령어로 인지하여, 가상 게임 데이터 상에서 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150- 5)가 파괴되거나 폭발하도록 HMD를 제어한다. 게임 제공 서버는 신체 움직임 정보 중 제2 특정 동작이 판별되면 무기 교체 명령어 또는 탄창 장전 명령 어로 인지하여, 가상 게임 데이터 상에서 사용자 캐릭터의 무기 교체 또는 탄창 장전이 이루어지도록 HMD 를 제어한다. 도 5는 본 실시예에 따른 HUD를 이용하여 자율주행 차량 정보를 이용한 VR 게임 출력을 나타낸 도면이다. 게임 제공 서버는 자율주행차량이 주행하고 있는 도로 및 주변 건물 등에서 적 또는 괴물 등이 등장 하도록 한다. 자율주행차량 내에 승객은 도 5에 도시된 바와 같이, 별도로 HMD를 착용하지 않고 HUD 에 출력되는 가상 게임 데이터를 보고 웨어러블 디바이스(예컨대, 총)을 이용하여 적 또는 괴물을 사격한다. 자율주행장치는 차량에 구비된 카메라(Camera), 레이더(Radar), 라이다(Lidar), 위치측위모듈을 이용 하여 주변 상황을 인지한 주변 상황 정보를 생성한다. 자율주행장치는 주변 상황 정보를 기반으로 차량 이 자율주행하도록 제어하면서 차량 제어 정보를 생성한다. 자율주행장치는 주변 상황 정보와 차량 제어 정보를 포함하는 차량에 대한 자율주행정보를 생성한다.웨어러블 디바이스는 차량에 탑재한 사용자의 신체에 착용되어, 신체의 움직임에 따른 신체 움직임 정보를 생성한다. 게임 제공 서버는 수신된 자율주행정보에 포함된 주변 상황 정보와 차량 제어 정보를 추출한다. 게임 제공 서버는 주변 상황 정보와 차량 제어 정보를 기반으로 가상 게임 데이터를 생성하여 출력한다. HUD(Head UP Display)는 차량의 전면 윈도우의 일측에 설치되어 가상 게임 데이터를 출력하면서, 신체 움 직임 정보에 따라 가상 게임 데이터를 갱신하여 출력한다. 게임 제공 서버는 현재 위치 정보를 기반으로 차량이 특정 지역에 진입하는 경우, 특정 지역에 대응하는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)를 추출한다. 게임 제공 서버는 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)를 가상 게임 데이터에 반영하여 HUD로 출력한다. 게임 제공 서버는 디지탈 맵 상에 영상 데이터를 기반으로 인지한 도로 및 건물에 마스코트 또는 게임 캐 릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 매칭되어 HUD로 출력되도록 제어한다. 게임 제공 서버는 시 선 정보, 신체 움직임 정보를 기반으로 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5)가 파 괴되거나 폭발하도록 HUD를 제어한다. 게임 제공 서버는 시선 정보, 신체 움직임 정보가 디지탈 맵 상에 마스코트 또는 게임 캐릭터(150-1, 150- 2, 150-3, 150-4, 150-5)가 조준된 상태 판별된 상태에서 신체 움직임 정보 중 제1 특정 동작이 판별되면 발사 명령어로 인지하여, 가상 게임 데이터 상에서 마스코트 또는 게임 캐릭터(150-1, 150-2, 150-3, 150-4, 150-5) 파괴되거나 폭발하도록 HUD를 제어한다. 게임 제공 서버는 신체 움직임 정보 중 제2 특정 동작이 판별되면 무기 교체 명령어 또는 탄창 장전 명령 어로 인지하여, 가상 게임 데이터 상에서 사용자 캐릭터의 무기 교체 또는 탄창 장전이 이루어지도록 HUD를 제 어한다. 이상의 설명은 본 실시예의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 실시예가 속하는 기술 분 야에서 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변 형이 가능할 것이다. 따라서, 본 실시예들은 본 실시예의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위 한 것이고, 이러한 실시예에 의하여 본 실시예의 기술 사상의 범위가 한정되는 것은 아니다. 본 실시예의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2019-0168949", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 실시예에 따른 자율주행 차량 정보를 이용한 VR 게임 제공 시스템을 나타낸 도면이다. 도 2는 본 실시예에 따른 게임 제공 서버의 동작 과정을 설명하기 위한 도면이다. 도 3은 본 실시예에 따른 자율주행 차량 정보를 이용한 VR 게임 제공 방법을 나타낸 도면이다. 도 4는 본 실시예에 따른 HMD를 이용하여 자율주행 차량 정보를 이용한 VR 게임 출력을 나타낸 도면이다. 도 5는 본 실시예에 따른 HUD를 이용하여 자율주행 차량 정보를 이용한 VR 게임 출력을 나타낸 도면이다."}
