{"patent_id": "10-2023-0035404", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0140694", "출원번호": "10-2023-0035404", "발명의 명칭": "사용자 맞춤형 체형관리방법 및 이를 위한 스마트 미러", "출원인": "주식회사 엠피아이모던필라테스", "발명자": "임규돈"}}
{"patent_id": "10-2023-0035404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "내측에 디스플레이 장치가 마련되되, 상기 디스플레이 장치를 통해 출력되는 화면이 외부에서 투영되도록 형성되는 미러 몸체부;상기 미러 몸체부의 일측에 마련되며, 사용자를 촬영하여 사용자 촬영 데이터를 획득하는 촬영부; 및획득된 상기 사용자 촬영 데이터와 기 저장된 기준 데이터를 비교한 결과를 토대로 상기 사용자의 체형 상태를분석하고, 분석 결과를 토대로 관리방법 데이터를 생성하는 분석부;를 포함하며,생성된 상기 관리방법 데이터는 상기 디스플레이 장치의 화면을 통해 출력되어 사용자에게 시인되는 것을 특징으로 하는, 사용자 맞춤형 체형관리가 가능한 스마트 미러."}
{"patent_id": "10-2023-0035404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 촬영부는,사용자를 촬영하는 깊이 카메라(depth camera);를 포함하는 것을 특징으로 하는, 사용자 맞춤형 체형관리가 가능한 스마트 미러."}
{"patent_id": "10-2023-0035404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 분석부는,하나 이상의 학습용 사용자 촬영 데이터와 학습용 기준 데이터를 비교하는 과정을 반복 학습한 결과를 토대로,상기 사용자 촬영 데이터로부터 사용자의 각 신체부위 별 체형 이미지를 분류 및 수치화하고,상기 기준 데이터에 포함된 각 신체부위 별 기준 체형 이미지의 수치값과 상기 각 신체부위 별 체형 이미지의수치값을 서로 비교한 후, 수치값 편차가 높은 신체부위를 기준으로 사용자의 체형 상태를 6단계의 체형 상태중 어느 하나 이상의 체형 상태로 결정하는 것을 특징으로 하는, 사용자 맞춤형 체형관리가 가능한 스마트미러."}
{"patent_id": "10-2023-0035404", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 분석부는,상기 수치값 편차가 높은 신체부위를 기준으로, 각 신체부위 별 상응하는 운동 프로그램 정보 및 식습관 정보를상기 관리방법 데이터에 포함시키는 것을 특징으로 하는, 사용자 맞춤형 체형관리가 가능한 스마트 미러."}
{"patent_id": "10-2023-0035404", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 깊이 카메라 및 인공지능 기술을 이용하여 사용자의 체형 분석을 통한 최적의 운동 가이드 서비스를 시공간에 구애받지 않고 제공할 수 있음은 물론, 코치 및 다수 참여자 간의 실시간 화상 강의 서비스를 제공함으 로써 실시간 피드백에 기반한 1:1 매칭운동 혹은 그룹 매칭운동이 가능하도록 하는 사용자 맞춤형 체형관리가 가 능한 스마트 미러에 관한 것이다."}
{"patent_id": "10-2023-0035404", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자 맞춤형 체형관리가 가능한 스마트 미러에 관한 것으로서, 보다 구체적으로는, 깊이 카메라 및 인공지능 기술을 이용하여 사용자의 체형 분석을 통한 최적의 운동 가이드 서비스를 시공간에 구애받지 않고 제 공할 수 있음은 물론, 코치 및 다수 참여자 간의 실시간 화상 강의 서비스를 제공함으로써 실시간 피드백에 기 반한 1:1 매칭운동 혹은 그룹 매칭운동이 가능하도록 하는 사용자 맞춤형 체형관리가 가능한 스마트 미러에 관 한 것이다."}
{"patent_id": "10-2023-0035404", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 코로나 19와 같은 팬데믹 상황이 발생하는 가운데, 비대면 생활패턴의 증가 및 집단 활동이 감소함은 물 론, 언택트로 인한 재택근무, 온라인쇼핑 서비스, 원격의료 서비스, 원격교육 서비스, OTT 등 4차 산업혁명 기 술이 확산되면서 사회적 거리두기 실천을 위해 기존의 라이프 스타일에도 많은 변화가 일어나고 있다. 특히, 피트니스 산업에 있어서도 기존 피트니스 센터 이용자들은 대부분 온라인 영상에 기반한 홈트레이닝으로 전환하고 있는 가운데, 오프라인 피트니스 센터의 영업 부진, 매출 하락 등이 이슈화되고 있는 현실이다. 온라인 영상에 기반한 홈트레이닝 산업은 편의성 및 안전성을 기반으로 현재 급격한 성장을 이루고 있지만, 코 치가 옆에서 직접 자세를 교정해줄 수 없다는 문제점과 온라인 영상 특성 상 오프라인 강의에 비해 지속성 및 동기부여가 떨어진다는 문제점이 있다. 특히, 홈트레이닝을 하는 이용자들은 체형, 체력, 근력량, 신체조건 등이 제각각 인데 반해, 온라인 홈트레이닝 영상을 통해서는 이러한 모든 이용자 각각의 체형에 적합한 운동을 가이드해줄 수 없다는 점에서, 현재 온라인 영상에 기반한 홈트레이닝을 하면서도 자신의 체형이나 신체조건에 맞는 최적의 운동을 가이드해줄 수 있는 서 비스 및 기술이 요구되고 있다."}
{"patent_id": "10-2023-0035404", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술된 문제점을 해결하기 위해 도출된 것으로서, 깊이 카메라 및 인공지능 기술을 이용하여 사용자 의 체형 분석을 통한 최적의 운동 가이드 서비스를 시공간에 구애받지 않고 제공할 수 있음은 물론, 코치 및 다 수 참여자 간의 실시간 화상 강의 서비스를 제공함으로써 실시간 피드백에 기반한 1:1 매칭운동 혹은 그룹 매칭 운동이 가능하도록 하는 사용자 맞춤형 체형관리가 가능한 스마트 미러를 제공하고자 한다."}
{"patent_id": "10-2023-0035404", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 사용자 맞춤형 체형관리가 가능한 스마트 미러는 내측에 디스플레이 장치가 마련되 되, 상기 디스플레이 장치를 통해 출력되는 화면이 외부에서 투영되도록 형성되는 미러 몸체부, 상기 미러 몸체 부의 일측에 마련되며, 사용자를 촬영하여 사용자 촬영 데이터를 획득하는 촬영부 및 획득된 상기 사용자 촬영 데이터와 기 저장된 기준 데이터를 비교한 결과를 토대로 상기 사용자의 체형 상태를 분석하고, 분석 결과를 토 대로 관리방법 데이터를 생성하는 분석부를 포함하며, 생성된 상기 관리방법 데이터는 상기 디스플레이 장치의 화면을 통해 출력되어 사용자에게 시인되는 것을 특징으로 할 수 있다. 일 실시예에서, 상기 촬영부는 사용자를 촬영하는 깊이 카메라(depth camera)를 포함하는 것을 특징으로 할 수 있다. 일 실시예에서, 상기 분석부는 하나 이상의 학습용 사용자 촬영 데이터와 학습용 기준 데이터를 비교하는 과정 을 반복 학습한 결과를 토대로, 상기 사용자 촬영 데이터로부터 사용자의 각 신체부위 별 체형 이미지를 분류 및 수치화하고, 상기 기준 데이터에 포함된 각 신체부위 별 기준 체형 이미지의 수치값과 상기 각 신체부위 별 체형 이미지의 수치값을 서로 비교한 후, 수치값 편차가 높은 신체부위를 기준으로 사용자의 체형 상태를 6단계 의 체형 상태 중 어느 하나 이상의 체형 상태로 결정하는 것을 특징으로 할 수 있다. 일 실시예에서, 상기 분석부는 상기 수치값 편차가 높은 신체부위를 기준으로, 각 신체부위 별 상응하는 운동 프로그램 정보 및 식습관 정보를 상기 관리방법 데이터에 포함시키는 것을 특징으로 할 수 있다. 일 실시예에서, 상기 분석부는 상기 사용자 촬영 데이터를 토대로 사용자의 각 신체부위 별 체형 이미지를 사용 자의 관리 전 체형 상태로 설정하고, 상기 기준 데이터에 포함된 각 신체부위 별 기준 체형 이미지를 사용자의 관리 후 체형 상태로 설정한 후, 각 이미지를 서로 오버랩하여 상기 디스플레이 장치의 화면을 통해 출력되도록 하는 것을 특징으로 할 수 있다.일 실시예에서, 상기 분석부는 하나 이상의 학습용 사용자 촬영 데이터와 학습용 기준 데이터를 비교하는 과정 을 반복 학습한 결과를 토대로, 상기 사용자 촬영 데이터로부터 사용자의 의류착용 유무를 판단하는 것을 특징 으로 할 수 있다. 일 실시예에서, 사용자의 상기 디스플레이 장치에 대한 조작을 기반으로 생성된 사용자 계정이 유무선 네트워크 통신을 통해 외부 서버와 연결되도록 하는 통신부를 더 포함하며, 상기 통신부는 상기 외부 서버에 연결된 코치 단말과 연동된 코치 계정에 의해 개설된 그룹운동방에 참여요청을 송신 후 상기 코치 단말의 허가 신호를 수신 하여 상기 사용자 계정이 그룹운동방에 입장되도록 하고, 상기 외부 서버에 의해 상기 코치 단말로부터 운동시 작요청이 수신되는 경우, 상기 코치 단말로부터 수신되는 실시간 영상과 상기 외부 서버에 연결된 하나 이상의 타 사용자 단말로부터 수신되는 실시간 영상과 상기 촬영부를 통해 촬영되는 실시간 사용자 영상이 상기 디스플 레이 장치의 화면을 통해 출력되도록 하며, 또한 상기 외부 서버에 연결된 상기 코치 단말 및 상기 하나 이상의 타 사용자 단말 중 어느 하나 이상에 상기 실시간 사용자 영상을 제공하여 각 단말의 화면 상에 상기 실시간 사 용자 영상이 출력되도록 하는 것을 특징으로 할 수 있다. 일 실시예에서, 상기 미러 몸체부는 마이크 및 스피커를 포함하며, 상기 통신부는 상기 코치 단말로부터 수신되 는 실시간 음성이 상기 스피커를 통해 출력되도록 하고, 또한 상기 마이크를 통해 입력되는 실시간 음성이 상기 외부 서버를 통해 상기 코치 단말에 제공 및 출력되도록 하는 것을 특징으로 할 수 있다. 일 실시예에서, 상기 통신부는 사용자의 상기 디스플레이 장치에 대한 조작을 기반으로 강의 영상 재생에 대한 요청신호가 생성되는 경우, 상기 사용자 계정이 유무선 네트워크 통신을 통해 강의 영상 제공 서버와 연결되도 록 하며, 상기 강의 영상 제공 서버로부터 수신되는 강의 영상이 상기 디스플레이 장치의 화면을 통해 출력되도 록 하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2023-0035404", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 깊이 카메라 및 인공지능 기술을 이용하여 사용자의 체형 분석을 통한 최적의 운 동 가이드 서비스를 시공간에 구애받지 않고 제공할 수 있음은 물론, 코치 및 다수 참여자 간의 실시간 화상 강 의 서비스를 제공함으로써 실시간 피드백에 기반한 1:1 매칭운동 혹은 그룹 매칭운동이 가능하도록 하는 이점을 가진다. 특히, 인공지능 체형 분석 솔루션을 통해 팔, 복부, 다리 등의 분할과 의류 착용 유무, 체형의 이슈정보나 대략 적인 수치 등을 자동으로 분석 및 도출할 수 있으며, 이를 기반으로 사용자에게 최적의 운동방식, 식습관을 추 천해줄 수 있는 이점을 가진다."}
{"patent_id": "10-2023-0035404", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 이해를 돕기 위하여 바람직한 실시예를 제시한다. 그러나 하기의 실시예는 본 발명을 보다 쉽"}
{"patent_id": "10-2023-0035404", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "게 이해하기 위하여 제공되는 것일 뿐, 실시예에 의해 본 발명의 내용이 한정되는 것은 아니다. 또한 하기에서 분석부 및 통신부는 별도 물리적인 형체가 있는 구성으로 해석되기 보다는 본 발명에 따른 사용자 맞춤형 체형 관리가 가능한 스마트 미러의 기능을 구성적으로 표현한 의미로 해석됨이 바람직하다. 도 1은 본 발명의 일 실시예에 따른 사용자 맞춤형 체형관리가 가능한 스마트 미러의 구성을 도시한 도면 이고, 도 2는 도 1에 도시된 사용자 맞춤형 체형관리가 가능한 스마트 미러의 전체적인 형상을 도시한 도 면이다. 도 1 및 도 2를 살펴보면, 본 발명의 일 실시예에 따른 사용자 맞춤형 체형관리가 가능한 스마트 미러는 크게 미러 몸체부, 촬영부, 분석부 및 통신부를 포함하여 구성된다. 먼저, 미러 몸체부는 전신거울 형태로 형성되며, 직립된 상태에서 상측이 후방으로 일부 각도로 기울어지 되 고정 프레임을 통해 고정각도가 유지되는 형태로 형성된다. 미러 몸체부는 평상시에는 거울처럼 빛을 반사하지만, 내측에 디스플레이 장치(110a)가 마련됨에 따라 디 스플레이 장치(110a)를 통해 출력되는 화면이 미러 몸체부의 외부 거울을 통해 외측으로 투영될 수 있다. 이때, 디스플레이 장치(110a)는 정전식 터치 센서를 포함함에 따라 사용자의 터치 동작을 인식하게 되며, 디스 플레이 장치(110a)를 덮는 외부 거울은 디스플레이 장치(110a)의 터치 동작에 전혀 방해되지 않는 두께를 가진 다. 미러 몸체부의 일측, 보다 구체적으로 외부 거울의 상부에는 미러 몸체부 주변에 위치한 사용자의 신 체를 촬영하여 사용자 촬영 데이터를 획득하는 촬영부가 마련된다. 도 3은 도 2에 도시된 촬영부를 통해 사용자를 촬영 및 사용자 촬영 데이터를 획득하는 상태를 도시한 도 면이다. 도 3을 살펴보면, 촬영부는 사용자의 신체를 촬영하되, 사용자의 3차원 체형분석을 위하여 너비, 높이, 깊 이를 측정할 수 있는 깊이 카메라(depth camera)가 적용된다. 이러한 촬영부는 미러 몸체부의 외부 거울 내측에 삽입된 형태이기 때문에, 미러 몸체부를 측면에서 보았을 때 촬영부가 외부 거울에서 돌 출되지 않는다. 여기에서, 깊이 카메라는 단일 렌즈를 사용하여 피사체를 촬영하는 2D 카메라와는 달리, 적외선 방출기, 컬러 센서, 적외선 깊이 센서 등을 포함하는 3D 카메라를 의미한다. 촬영부에 의해 촬영된 사용자 촬영 데이터는 후술되는 분석부로 제공되어 사용자의 체형분석을 위한 정보로 이용된다. 다시 도 1 및 도 2로 돌아와서, 분석부는 촬영부를 통해 획득된 사용자 촬영 데이터를 기 저장된 기 준 데이터와 비교한 결과를 토대로 사용자의 체형 상태를 분석하고, 분석 결과를 토대로 사용자에 적합한 최적 의 관리방법 데이터를 생성하며, 생성된 관리방법 데이터가 미러 몸체부의 디스플레이 장치(110a)를 통해 출력되도록 한다. 이에 관해서는 도 4 및 도 5를 통해 보다 구체적으로 살펴보기로 한다. 도 4는 사용자 촬영 데이터를 토대로 결정된 체형 상태가 디스플레이 장치의 화면을 통해 출력되는 상태를 도시 한 도면이고, 도 5는 사용자의 신체부위 별 체형 이미지 및 기준 체형 이미지가 오버랩되어 디스플레이 장치의 화면을 통해 출력되는 상태를 도시한 도면이다. 도 4 및 도 5를 살펴보면, 분석부는 하나 이상의 학습용 사용자 촬영 데이터와 학습용 기준 데이터를 비교 하는 과정을 반복 학습하는 머신러닝 기술에 기반하여, 사용자의 전신을 촬영한 사용자 촬영 데이터로부터 사용 자의 각 신체부위 별 체형 이미지를 분류 및 수치화한다. 이는 촬영부에 적용된 깊이 카메라가 형태 정보 및 수치 정보를 모두 획득할 수 있는 점에 기반한다. 예컨대, 사용자 촬영 데이터로부터 사용자의 각 신체부위(복부, 하체, 상체(팔), 상체(등))를 자동으로 분류한 후, 표준체형 대비 각 신체부위가 비만 상태인지, 마른 상태인지를 판단하게 된다. 이때 기준 데이터에는 이미 표준체형의 각 신체부위 별 형태 정보 및 수치 정보에 기초한 수치값이 포함되어 있기 때문에, 분석부에서는 사용자 촬영 데이터로부터 분류된 각 신체부위들을 표준체형의 각 신체부위들과 비교한 후, 수치값의 편차가 높은 신체부위를 기준으로 사용자의 체형 상태를 6단계의 체형 상태 중 어느 하나 이상의 체형 상태로 결정하게 된다. 이때, 결정되는 6단계의 체형 상태는 1)복부비만, 2)하체비만, 3)상체비만(팔), 4)상체비만(등), 5)하체마름, 6)상체마름을 의미한다. 즉, 분석부에서는 사용자 촬영 데이터로부터 분류된 각 신체부위들의 수치값과 표준체형의 각 신체부위들 의 수치값을 서로 비교한 후 편차가 높은 신체부위를 기준으로, 해당 사용자가 현재 복부비만 상태인지, 하체비 만 상태인지, 상체 중에서도 팔이 비만 상태인지, 상체 중에서도 등이 비만 상태인지, 하체마름 상태인지, 상체 마름 상태인지를 판단하게 된다. 또한, 분석부에서는 Hello Data 플랫폼을 이용하여 레이블링(laveling) 작업을 수행하게 된다 또한, 분석부는 사용자의 현재 체형 상태에 대한 체형 이미지와 표준 체형의 체형 이미지를 시각적으로 부 각시켜 표시함으로써 사용자에게 더욱 직관적으로 알릴 수 있는데, 이는 다음과 같다. 도 5는 사용자의 신체부위 별 체형 이미지 및 기준 체형 이미지가 오버랩되어 디스플레이 장치의 화면을 통해 출력되는 상태를 도시한 도면이다. 도 5를 살펴보면, 분석부는 사용자 촬영 데이터를 토대로 사용자의 각 신체부위 별 체형 이미지를 사용자 의 관리 전 상태로 설정하여 미러 몸체부의 디스플레이 장치(110a)의 화면에 출력되도록 하고, 또한 기준 데이터에 포함된 표준체형의 각 신체부위 별 기준 체형 이미지를 사용자의 관리 후 상태로 설정하여 디스플레이 장치(110a)의 화면에 출력되도록 한다. 이때, 각 이미지는 서로 오버랩된 상태에서 서로 다른 색상으로 표시될 수 있기 때문에, 사용자로 하여금 관리 전, 관리 후 상태를 직관적으로 파악할 수 있도록 함은 물론, 각 신체부위 별로 관리 시에는 어떤 체형으로 변 화될 수 있는지도 미리 예기로 보여줄 수 있는 이점을 가지게 된다. 다시 도 1 및 도 2로 돌아와서, 분석부는 사용자들이 적어도 500벌 이상의 의류를 착용하여 촬영한 데이터 인 학습용 사용자 촬영 데이터와 이를 학습용 기준 데이터와 비교하는 과정을 반복 학습한 결과를 토대로, 촬영 부를 통해 획득된 사용자 촬영 데이터에서 사용자의 의류착용 유무를 판단하게 된다. 특히, 분석부에 서는 체형의 수치화 및 다양화를 위하여 적어도 500건 이상의 체형 이미지 및 체형 수치정보를 수집한 후, 의류 착용 유무, 종류 등의 분류와 체형 이미지 수치화를 위하여 Hello Data 플랫폼을 이용하여 레이블링(laveling) 작업을 수행하게 된다. 한편, 분석부에서는 앞서 살펴본 사용자의 체형 분석 결과에 기초하여, 체형 특징 별로 적합한 최적의 관 리방법 데이터를 생성 후 이를 디스플레이 장치(110a)의 화면을 통해 출력하게 된다. 여기에서, 관리방법 데이터라 함은, 체형 특징 별 운동 정보, 운동 프로그램, 운동 종류, 운동 시간은 물론 식 습관 정보, 식단 정보 등을 모두 포함하는 정보를 의미한다. 이를 통해, 사용자는 자신의 체형에 맞는 최적의 관리방법을 확인할 수 있게 된다. 통신부는 사용자가 외부 거울에 투영된 디스플레이 장치(110a)의 화면을 터치하는 터치 조작에 기반하여 생성된 사용자 계정이 유무선 네트워크 통신을 통해 외부 서버와 연결되도록 한다. 이에 관해서는 도 6을 통해 보다 구체적으로 살펴보기로 한다. 도 6은 사용자 계정이 코치 계정에 의해 개설된 그룹운동방에 입장 및 다수 사용자 간 실시간 영상이 출력되는 상태를 도시한 도면이다. 도 6을 살펴보면, 통신부는 외부 서버에 연결된 코치 단말과 연동된 코치 계정에 의해 개설된 그룹운동방 에 참여요청을 송신한 후, 코치 단말로부터 해당 참여요청에 대한 피드백으로서 허가 신호가 수신될 경우, 해당 사용자 계정이 해당 그룹운동방에 입장되도록 한다. 이때, 그룹운동방은 코치 단말에 의해서 개설될 수 있으며,최신순, 인기순 리스트 정렬, 필터 적용 등이 구현될 수 있다. 사용자 계정이 그룹운동방에 접속된 후, 코치 단말로부터 운동시작요청이 수신되는 경우, 통신부는 코치 단말로부터 수신되는 실시간 영상과, 외부 서버에 연결된 다른 사용자들의 사용자 단말 각각으로부터 수신되는 실시간 영상과, 앞서 살펴본 촬영부를 통해 촬영되는 사용자의 실시간 사용자 영상이 디스플레이 장치 (110a)의 화면을 통해 출력되도록 한다. 즉, 코치 단말에 마련된 카메라 장치를 통해 촬영되는 영상이 디스플레이 장치(110a)의 화면에 실시간으로 출력 됨은 물론, 타 사용자들의 단말에 마련된 카메라 장치를 통해 촬영되는 영상이 디스플레이 장치(110a)의 화면에 실시간으로 출력될 수 있기 때문에, 결과적으로는 코치의 지도 하에 모든 사용자들이 그룹운동을 진행할 수 있 게 된다. 이때, 코치 단말 및 타 사용자들의 단말이라 함은, 본원발명에서와 같은 사용자 맞춤형 체형관리가 가능한 스마 트 미러를 의미할 수 있다. 따라서, 코치도 자신의 집 혹은 피트니스 센터에 설치된 사용자 맞춤형 체형관 리가 가능한 스마트 미러를 통해 회원가입 후 코치 계정으로 그룹운동방을 개설할 수 있고, 해당 그룹운동 방에 접속된 타 사용자 맞춤형 체형관리가 가능한 스마트 미러를 이용하는 사용자들 각각은 마치 다중 화 상회의와 같이 실시간 영상으로 소통하면서 운동을 진행할 수 있게 된다. 이때, 미러 몸체부에는 마이크 및 스피커가 마련됨에 따라, 통신부에서는 코치 단말로부터 수신되는 실시간 음성이 스피커를 통해 출력되도록 함은 물론, 마이크를 통해 입력되는 사용자의 실시간 음성이 코치 단 말에 마련된 스피커를 통해 출력되도록 함으로써, 코치와 사용자들 간의 실시간 소통이 가능하게 된다. 또한, 일 실시예에서 통신부는 사용자가 디스플레이 장치(110a)를 조작하여 강의 영상 재생에 대한 요청신 호가 생성되는 경우, 해당 요청신호를 토대로 사용자 계정이 유무선 네트워크 통신을 통해 강의 영상 제공 서버 와 연결되도록 하며, 강의 영상 제공 서버로부터 수신되는 강의 영상이 디스플레이 장치(110a)의 화면을 통해 출력되도록 한다. 여기에서, 강의 영상 제공 서버라 함은, 뮤복(MUBOK), 뮤핏(MUFIT), 필라테스, 웨이트 등 전 문 강사들이 제공하는 코칭 영상 제공 서버를 의미할 수 있다. 또한, 일 실시예에서 본 발명에 따른 사용자 맞춤형 체형관리가 가능한 스마트 미러는 그룹운동방에 접속 된 사용자 계정의 참여 일수 및 참여도에 관하여, 코치 단말에 의해 책정되는 보상 포인트 정보를 수신한 후 이 를 디스플레이 장치(110a)의 화면에 출력할 수 있다. 이에 관해서는 도 7을 통해 살펴보기로 한다. 도 7은 사용자 계정의 그룹운동방 참여도에 따른 보상이 디스플레이 장치의 화면을 통해 출력되는 상태를 도시 한 도면이다. 도 7을 살펴보면, 그룹운동방에 접속된 다수의 사용자들 각각의 계정은, 코치 단말에 의해 책정되는 보상 포인 트 정보를 토대로 랭킹이 적용되어 높은 순위에 따라 차등적으로 노출될 수 있다. 예컨대, 월단위 운동 기록 및 참여도에 따라 보상 포인트가 책정될 수 있다. 이에 따라, 그룹운동 참여자들로 하여금 우수 참여자가 누구인지 서로 선의의 경쟁심을 유발할 수 있어 운동에 대한 동기 부여 및 운동 지속률을 향상시킬 수 있는 이점을 가지 게 된다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 청 구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0035404", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 사용자 맞춤형 체형관리가 가능한 스마트 미러의 구성을 도시한 도면 이다. 도 2는 도 1에 도시된 사용자 맞춤형 체형관리가 가능한 스마트 미러의 전체적인 형상을 도시한 도면이다. 도 3은 도 2에 도시된 촬영부를 통해 사용자를 촬영 및 사용자 촬영 데이터를 획득하는 상태를 도시한 도 면이다. 도 4는 사용자 촬영 데이터를 토대로 결정된 체형 상태가 디스플레이 장치의 화면을 통해 출력되는 상태를 도시 한 도면이다. 도 5는 사용자의 신체부위 별 체형 이미지 및 기준 체형 이미지가 오버랩되어 디스플레이 장치의 화면을 통해 출력되는 상태를 도시한 도면이다. 도 6은 사용자 계정이 코치 계정에 의해 개설된 그룹운동방에 입장 및 다수 사용자 간 실시간 영상이 출력되는 상태를 도시한 도면이다. 도 7은 사용자 계정의 그룹운동방 참여도에 따른 보상이 디스플레이 장치의 화면을 통해 출력되는 상태를 도시 한 도면이다."}
