{"patent_id": "10-2021-0147334", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0062257", "출원번호": "10-2021-0147334", "발명의 명칭": "기업 정보를 이용한 기업 미래 성장지수 분석 시스템", "출원인": "주식회사 벡스인텔리전스", "발명자": "최재호"}}
{"patent_id": "10-2021-0147334", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대상 기업의 미래 매출액을 추정하여 수치화한 매출지표를 산출하는 매출지표산출부와;대상 기업이 보유한 재무요소로부터 미래 재무제표를 추정하여 대상 기업의 미래 재무적 성과를 양적으로 평가하여 수치화한 재무지표를 산출하는 재무지표 산출부와;대상 기업에 대한 등록 특허 증감률을 수치화한 기술지표를 산출하는 기술지표 산출부와;대상 기업에 대한 성장단계를 산출하고, 산출된 성장단계의 핵심요소에 대한 평가등을 나타내는 평가지수를 산출하는 핵심지수 산출부; 그리고 상기 매출지표, 재무지표, 신용지표 및 기술지표를 평균화하여 산출된 미래성장 지표에, 상기 핵심지수 산출부에서 산출된 핵심요소별 평가지수에 따른 등급별 가감률을 부가하여 대상 기업의 미래 성장성을 표시하는 성장지수를 산출하는 성장지수 산출부를 포함하여 구성되고:상기 기업에 대한 성장단계 구분 및 상기 성장단계별 핵심요소는 테이블로 저장되어 제공됨을 특징으로 하는 기업 정보를 이용한 기업 미래 성장지수 분석 시스템."}
{"patent_id": "10-2021-0147334", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 기술지표는, 특허등록 건수의 변화율과;출원 건수 대비 등록 건수의 변화율을 합산하여 산출됨을 특징으로 하는 기업 정보를 이용한 기업 미래 성장지수 분석 시스템."}
{"patent_id": "10-2021-0147334", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 핵심지수는, 대상 기업에 대한 인터넷 상의 수요자 평판을 수치화한 평판지수를 포함하고;상기 핵심지수 산출부는, 상기 평판지수를 산출하는 평판지수 산출부를 포함하여 구성됨을 특징으로 하는 기업정보를 이용한 기업 미래 성장지수 분석 시스템."}
{"patent_id": "10-2021-0147334", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 평판지수 산출부는,인터넷 상에 해당기업에 대한 웹페이지 정보를 수집하는 자동화된 알고리즘을 포함하여 구성되는 기업별 크롤링엔진과;상기 기업별 크롤링 엔진이 수집한 웹 페이지정보를 분석하여 해당 기업에 대한 인지도 및 호감도를 산출하는수집데이터 분석모듈; 그리고 상기 수집데이터 분석모듈이 해당 기업의 호감도를 산출하기 위하여, 긍정키워드들 및 부정키워드들이 구분되어공개특허 10-2023-0062257-3-저장되는 키워드DB를 포함하여 구성되어,기업의 사회적 이미지를 평가하여 평판지수를 산출함을 특징으로 하는 기업 정보를 이용한 기업 미래 성장지수분석 시스템."}
{"patent_id": "10-2021-0147334", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 평판지수 산출부는,상기 기업별 크롤링 엔진이 수집한 해당 기업에 대한 웹 페이지정보의 양을 산출하여 해당기업에 대한 인지도를파악하고;해당 웹페이지에 포함된 댓글을 추출하여 해당 댓글에 대한 호감도를 산출하여, 산출된 인지도(P)와 호감도(L)를 통합하여 상기 평판지수를 산출함을 특징으로 하는 기업 정보를 이용한 기업 미래 성장지수 분석 시스템."}
{"patent_id": "10-2021-0147334", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 호감도는,해당 댓글에 포함된 단어들 중 상기 키워드DB에 포함된 긍정키워드와 일치하는 단어의 수와 부정키워드와 일치하는 단어의 수를 대비하여, 해당 댓글을 긍정 댓글과 부정댓글로 구분 분류하고;전체 댓글들 중 긍정댓글과 부정댓글의 수를 대비하여 산출됨을 특징으로 하는 기업 정보를 이용한 기업 미래성장지수 분석 시스템."}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 기업의 미래성장 가능성을 나타내는 기업 미래 성장지수를 분석하는 시스템에 관한 것으로, 본 발명은 대상 기업의 미래 매출액을 추정하여 수치화한 매출지표를 산출하는 매출지표산출부와; 대상 기업이 보유한 재무 요소로부터 미래 재무제표를 추정하여 대상 기업의 미래 재무적 성과를 양적으로 평가하여 수치화한 재무지표를 (뒷면에 계속)"}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기업의 미래성장 가능성을 나타내는 기업 미래 성장지수를 분석하는 시스템에 관한 것으로, 더욱 구 체적으로는 기업의 재무정보 등의 정형적 데이터와 평판이나 명성 등을 나타내는 신뢰도 정보를 이용하여 기업 의 성장 가능성을 도출하는 기업 정보를 이용한 기업 미래 성장지수 분석 시스템에 관한 발명이다."}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에는 금융보증기관, 투자기관 또는 정책자금을 집행하는 기관이 대출 및 투자를 진행시에 거래기업의 성장 성을 객관적으로 평가하여 파악하는 것이 중요하다. 이에, 종래에는 기업의 자산을 성장성을 평가하는 경우, 매출액, 재무상태 및 영업권 등의 정형적인 평가자료를 바탕으로 기업의 성장성을 평가하여 수치화된 성장성 또는 등급별 성장성을 도출하여왔다. 이와 같은 예로 대한민국등록특허 제10-2052513호에는 매출액 및 재무상태를 기준으로 미래의 기업 성장성을 평 가하는 기술이 개시되어 있다. 그러나, 최근에는 전자통신의 발달과 인터넷의 파급력이 확대됨에 따라 기업의 성장이 전통적인 과거 매출이나 재무상태에만 의존하지 않고, 기업에 대한 소비자들의 반응과 이에 대한 평가에 좌우되는 경향이 심화되고 있다. 즉, 인터넷 상에서 호평이나 악평에 따라 기업의 성장이 크게 좌우되고 있는 현실이나, 종래기술에서는 이와 같 은 기업의 인터넷상의 소비자 평판이 기업 성장성을 예측하는데 활용되지 못하는 문제점이 있었다.선행기술문헌 특허문헌 (특허문헌 0001) 대한민국등록특허 제10-1909133호 (특허문헌 0002) 대한민국등록특허 제10-2052513호"}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래의 문제점을 해결하기 위하여 안출된 것으로, 본 발명은 전통적인 매출과 재무상태 뿐만 아니라, 기업에 대한 소비자들의 반응과 이에 대한 평가를 포함하여 기업의 성장가능성을 객관적으로 분석 할 수 있는 미래 성장지수 분석 시스템을 제공하고자 하는 것이다."}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명의 특징에 따르면, 본 발명은, 대상 기업의 미래 매출액을 추정 하여 수치화한 매출지표를 산출하는 매출지표산출부와; 대상 기업이 보유한 재무요소로부터 미래 재무제표를 추 정하여 대상 기업의 미래 재무적 성과를 양적으로 평가하여 수치화한 재무지표를 산출하는 재무지표 산출부와; 대상 기업에 대한 등록 특허 증감률을 수치화한 기술지표를 산출하는 기술지표 산출부와; 대상 기업에 대한 성 장단계를 산출하고, 산출된 성장단계의 핵심요소에 대한 평가등을 나타내는 평가지수를 산출하는 핵심지수 산출 부; 그리고 상기 매출지표, 재무지표, 신용지표 및 기술지표를 평균화하여 산출된 미래성장 지표에, 상기 핵심 지수 산출부에서 산출된 핵심요소별 평가지수에 따른 등급별 가감률을 부가하여 대상 기업의 미래 성장성을 표 시하는 성장지수를 산출하는 성장지수 산출부를 포함하여 구성되고: 상기 기업에 대한 성장단계 구분 및 상기 성장단계별 핵심요소는 테이블로 저장되어 제공된다. 이때, 상기 기술지표는, 특허등록 건수의 변화율과; 출원 건수 대비 등록 건수의 변화율을 합산하여 산출될 수 도 있다. 그리고 상기 핵심지수는, 대상 기업에 대한 인터넷 상의 수요자 평판을 수치화한 평판지수를 포함하고; 상기 핵 심지수 산출부는, 상기 평판지수를 산출하는 평판지수 산출부를 포함하여 구성될 수도 있다. 또한, 상기 평판지수 산출부는, 인터넷 상에 해당기업에 대한 웹페이지 정보를 수집하는 자동화된 알고리즘을 포함하여 구성되는 기업별 크롤링 엔진과; 상기 기업별 크롤링 엔진이 수집한 웹 페이지정보를 분석하여 해당 기업에 대한 인지도 및 호감도를 산출하는 수집데이터 분석모듈; 그리고 상기 수집데이터 분석모듈이 해당 기업 의 호감도를 산출하기 위하여, 긍정키워드들 및 부정키워드들이 구분되어 저장되는 키워드DB를 포함하여 구성되 어, 기업의 사회적 이미지를 평가하여 평판지수를 산출할 수도 있다. 그리고 상기 평판지수 산출부는, 상기 기업별 크롤링 엔진이 수집한 해당 기업에 대한 웹 페이지정보의 양을 산 출하여 해당기업에 대한 인지도를 파악하고; 해당 웹페이지에 포함된 댓글을 추출하여 해당 댓글에 대한 호감도 를 산출하여, 산출된 인지도(P)와 호감도(L)를 통합하여 상기 평판지수를 산출할 수도 있다. 또한, 상기 호감도는, 해당 댓글에 포함된 단어들 중 상기 키워드DB에 포함된 긍정키워드와 일치하는 단어의 수 와 부정키워드와 일치하는 단어의 수를 대비하여, 해당 댓글을 긍정 댓글과 부정댓글로 구분 분류하고; 전체 댓 글들 중 긍정댓글과 부정댓글의 수를 대비하여 산출될 수도 있다."}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "위에서 살핀 바와 같은 본 발명에 의한 기업 정보를 이용한 기업 미래 성장지수 분석 시스템에서는 다음과 같은 효과를 기대할 수 있다. 즉, 본 발명에서는 전통적인 매출과 재무상태 뿐만 아니라, 기업에 대한 소비자들의 반응과 이에 대한 평가로부 터 산출되는 인터넷 상의 기업 평판을 통해 기업을 성장 가능성을 객관적으로 분석할 수 있으므로, 기업 투자 및 운영자의 운영 상태 점검에 있어, 바람직한 의사결정을 할 수 있도록 하는 효과가 있다. 그리고 본 발명에서는 객관성이 결여되기 쉬운 온라인 상의 데이터로부터 객관성을 향상시킨 데이터를 이용하여 기업 성장가능성을 산출할 수 있으므로, 객관성이 향상된 기업 미래 성장 가능성을 산출할 수 있는 효과가 있다."}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면을 참조하여 본 발명의 구체적인 실시예에 의한 기업 정보를 이용한 기업 미래 성장지수 분석 시스템을 살펴보기로 한다."}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "설명에 앞서 먼저, 본 발명의 효과, 특징 및 이를 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있 는 실시 예에서 명확해진다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는"}
{"patent_id": "10-2021-0147334", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 발명의 실시 예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이며, 후술되는 용어들은 본 발명의 실시 예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 첨부된 블록도의 각 블록과 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들(실행 엔진)에 의해 수 행될 수도 있으며, 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세 싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 블록도의 각 블록 또는 흐름도의 각 단계에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능 하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트럭션들은 블록도의 각 블록 또는 흐 름도의 각 단계에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 그리고 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되 는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수 행되어 컴퓨터로 실행되는 프로세스를 생성하여 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 블록도의 각 블록 및 흐름도의 각 단계에서 설명되는 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록 또는 각 단계는 특정된 논리적 기능들을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있으며, 몇 가지 대체 실시 예들에서는 블록들 또는 단 계들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능하다. 즉, 도시된 두 개의 블록들 또는 단계들은 사실 실질적으로 동시에 수행되는 것도 가능하며, 또한 그 블록들 또 는 단계들이 필요에 따라 해당하는 기능의 역순으로 수행되는 것도 가능하다. 이하에서는 상기한 바와 같은 본 발명에 의한 기업 정보를 이용한 기업 미래 성장지수 분석 시스템을 첨부된 도 면을 참고하여 상세하게 설명한다. 도 2는 본 발명에 의한 기업 미래 성장지수 분석 개념을 도시한 개념도이고, 도 3은 본 발명에 의한 기업 미래 성장지수의 분석 결과예를 도시한 예시도이며, 도 4는 본 발명에 의한 기업 미래 성장지수의 분석 시스템의 구 조를 도시한 블록도이고, 도 5는 본 발명에 의한 기업 미래 성장지수의 분석 시스템을 구성하는 평판지수 산출 부의 구성을 도시한 블록도이며, 도 6은 본 발명에 의한 기업 미래 성장지수의 분석 시스템의 데이터 저장구조 의 일예를 도시한 예시도이고, 도 7은 본 발명에 의한 기업 미래 성장지수의 분석 시스템의 활용예를 도시한 예 시도이며, 도 8은 본 발명에 의한 기업 미래 성장지수의 분석 시스템의 다른 활용예를 도시한 예시도이다. 먼저, 도 4에 도시된 바와 같이, 본 발명에 의한 성장지수 분석 시스템은 매출지표 산출부, 재무지표 산출부, 기술지표 산출부, 핵심지수 산출부 및 성장지수 산출부를 포함하여 구성된다. 상기 매출지표 산출부와 재무지표 산출부는 전통적인 정량적 기업 성장성 평가를 수행하기 위한 것으 로, 정량적 기업 성장성 평가방법은 선행기술인 대한민국등록특허 제10-2052513호에 상세히 기재되어 있다. 따 라서, 정량적 기업 성장성 평가와 관련되어 본 명세서에서 생략된 기술구성은 위 선행기술을 참조하도록 한다. 상기 매출지표 산출부는 매출액을 추정하는 역할을 수행하는 부분으로, 상기 매출지표 산출부는 대상 기업을 업종에 따라 창업 초기로부터 지속성장기까지 다수의 단계로 구분한다. 이때, 업종은 대분류로 구분할 수도 있고, 소분류로 세분화할 수 있으나, 바람직하게는 예측정확도를 높이기 위하여는 세분화된 업종분류를 사 용하고, 데이터 처리의 효율성을 높이기 위하여는 대분류로 구분된 업종분류를 사용한다. 한편, 기업의 규모는 외감기업, 중규모기업, 소규모기업 및 영세기업 등과 같이 구분할 수도 있다. 상기 매출지표 산출부는 이와 같이 구분된 기업의 업종, 규모 등을 통해 다중회귀모형 또는 의사결정나무 모형 등의 통계치 산출방식에 의해, 기업 정보를 변수로 하는 함수에 의해 매출지표를 산출한다. 대한민국등록특허 제10-2052513호에는 매출액 추정부에 의한 매출액 예측 모형의 구분 예가 도시되어 있는데, 이에 개시된 바와 같이, 매출액 예측은 기업의 성장단계, 규모 및 업종으로 구분하며, 각 구분(Segment) 1~20은 제조업과 도소매 기타 서비스업에 할당하였고, 구분 21 및 22는 건설업 등으로 구분될 수 있다. 한편, 상기 재무지표 산출부는 기업의 재무제표를 이용하여 향후 차 회기의 재무재표를 추정하는 부분으로, 최근 재무제표들을 취합하여 예측 매출액, 본건 차입금 데이터를 이용하여 차기 재무제표를 추정한다. 이때, 재무제표는 재무회계의 과정을 통해 수집, 처리된 정보를 정기적으로 정리한 것으로, 상법에서는 재무상 태표, 손익계산서 및 이익잉여금처분계산서 또는 결손금처리계산서를 재무제표로 하고 있으며, 기업회계기준에 서는 재무상태표, 손익계산서, 현금흐름표, 주기 및 주석을 재무제표로 정하고 있다. 상기 재무지표 산출부는 손익계산서 항목 중 일부와 재무상태표 항목 중 일부를 선별하여 사용할 수 있다. 한편, 상기 재무지표 산출부는 재무제표 상의 이상 유무를 확인하여, 이를 기업 성장성 평가에 반영할 수 있다. 이때, 재무 이상은 기업의 부실 규모를 숨기거나 실적을 부풀리기 위해 회계 장부상의 정보를 고의로 조 작하는 행위인 분식의 결과로 재무제표상 나타나는 재무비율 간의 불일치 데이터로 정의된다. 이와 같은 재무 이상을 감지하는 방법은 외감 또는 비외감 등의 회계기법이 사용되는데 이에 대하여 본 명세서 에서 상세히 설명하지는 않도록 한다. 한편, 상기 기술지표 산출부는 특허권리의 변동 및 권리화비율에 따라 대상 기업의 기술성을 나타내는 기 술지표를 산출하는 부분으로, 대상 기업의 특허등록 건수의 변화율 및 출원 건수 대비 등록 건수의 변화율을 합산하여 산출된다. 즉, 상기 기술지표는 등록특허의 보유 건수가 증가할 수록, 특허 출원 대비 등록 비율이 높아질 수록 높게 평가 되어, 대상 기업의 미래 기술성 향상 전망이 높게 평가된다. 아울러, 도 2에 도시된 바와 같이, 본 발명에 의한 성장지수 분석 시스템은 경제성 지표 및 미래지표를 산출하 여, 해당 기업의 정장지수를 산출한다. 이때, 경제성 지표는 대상 기업의 주요 업무 지역(국가)에 대한 경제 전망에 따라 산출되는 예상지표를 말하고, 미래지표는 대상 기업의 주요 업무 분야에 대한 시장 동향 및 전망에 따라 산출되는 예상지표로, 상기 경제성 지표 및 미래지표는 다양한 경제분석 이론에 따라 산출방식이 적용될 수 있는 바, 본 명세서에서 이에 대한 상 세한 설명은 생략하기로 한다. 한편, 상기 핵심지수 산출부는, 대상기업의 현재 역량을 나타내는 지수들을 산출하는 부분으로, 평판지수, 마케팅역량지수, 인적자원지수, R&D역량지수, 신용지수 및 BM지수 등을 산출할 수 있다. 이때, 상기 핵심지수 산출부는, 대상기업의 평판지수를 산출하기 위하여, 평판지수 산출부를 포함하 여 구성될 수 있다. 상기 평판지수 산출부는 도 5에 도시된 바와 같이, 기업의 사회적 이미지를 평가하여 기업의 성장성 평가 에 반영하기 위한 것으로, 상기 평판지수 산출부는 기업에 대한 평판지수를 산출한다. 상기 평판지수는 온라인상의 기업 관련 정보에 의해 취득되는데, 구체적으로는 웹상에 게재된 기업관련 데이터 의 양, 해당 웹페이지에 후속되는 긍정 댓글과 부정 댓글의 수 등을 통해 해당 기업에 대한 인지도 및 긍/부정 평가에 따라 해당 기업에 대한 사용자의 평판을 수치화한 것을 말한다. 이를 위해 본 발명에 의한 상기 평판지수 산출부는 기업별 크롤링 엔진, 수집데이터 분석모듈 및 키워드DB를 포함하여 구성된다. 상기 기업별 크롤링 엔진은 웹상에 해당기업에 대한 웹페이지 정보를 수집하는 자동화된 알고리즘을 포함 하여 구성된다. 여기서 웹 크롤링 소프트웨어는 상용화된 다수의 프로그램이 존재하는 바, 이에 대한 상세한 설 명은 생략하기로 한다. 그리고 상기 수집데이터 분석모듈은 상기 기업별 크롤링 엔진이 수집한 웹 페이지정보를 분석하여 해 당 기업에 대한 인지도(P) 및 호감도(L)를 산출한다. 구체적으로, 상기 수집데이터 분석모듈은 상기 기업별 크롤링 엔진이 수집한 해당 기업에 대한 웹 페 이지정보의 양을 산출하여 해당기업에 대한 인지도(P)를 파악하고, 해당 웹페이지에 포함된 댓글을 추출하여 해 당 댓글에 대한 호감도(L)를 산출한다. 상기 호감도 레벨의 산출은 해당 댓글에 포함된 단어와 키워드DB에 포함된 키워드를 비교하여 산출되는데, 이를 위해 상기 키워드DB에는 긍정키워드들과 부정키워드들이 구분되어 저장된다. 상기 수집데이터 분석모듈의 기업 평판지수 산출 예를 살피면, 상기 기업별 크롤링 엔진이 수집한 해 당 기업에 대한 웹 페이지정보의 양에 따라 해당기업의 인지도를 0으로부터 10까지의 단계로 구분될 수 있다. 그리고 상기 해당 웹페이지들에 포함된 모든 댓글들을 추출하여 해당 기업에 대한 호감도(L) 레벨)을 산출한다. 상기 호감도 레벨의 산출은 해당 댓글에 포함된 단어와 키워드DB에 포함된 키워드를 비교하여 산출되는데, 이를 위해 상기 키워드DB에는 긍정키워드들과 부정키워드들이 구분되어 저장된다. 즉, 상기 수집데이터 분석모듈은 추출된 댓글들을 정리하고, 각 댓글에 포함된 긍정키워드의 수와 부정키 워드의 수를 대비하여 해당 댓글이 긍정 댓글인지 부정댓글인지 판단하며, 전체 댓글들 중 긍정댓글과 부정댓글 의 수를 대비하여 기업에 대한 호감도(L) 레벨을 산출한다. 이때 상기 호감도 레벨은 기 설정된 범위 안에서 등급으로 구분될 수 있고, 긍정적인 경우 양(+)의 값이고 부정 적인 경우 음(-)의 값으로 설정될 수 있다. 이에 따라 상기 기업 평판지수는 산출된 인지도(P)와 호감도(L)를 통합(예를들면 이들의 곱)하여 산출될 수 있 다. 즉, 어느 특정 기업에 대한 많은 수의 웹 페이지가 검색된는 경우, 인지도(P)는 높게 산출되나, 이용자들에 의 해 작성되는 댓글이 부정적 댓글이 대다수라하면, 호감도(L)가 음의 큰 값을 갖어, 평판지수는 음의 큰값으로 산출된다. 한편, 상기 댓글의 긍정성과 부정성에 의해 좌우되는 기업 평판지수는 바이럴 마케팅이나 기업측 작업자에 의해 의도적으로 생성된 댓글에 의해 오염될 수 있다. 이를 방지하기 위해 본 발명에 의한 신뢰성평가부는 수집된 댓글중에 기업측 의도에 의해 생성된 댓글을 제외시킨 후 기업 평판지수가 산출되도록 할 수 있다. 이를 위해 상기 평판지수 산출부는 이용자별 크롤링 엔진을 더 포함하여 구성될 수 있다. 구체적으로, 상기 평판지수 산출부는 수집된 댓글로부터 작성자 ID를 추출한다. 그리고 상기 이용자별 크 롤링 엔진은 추출된 작성자 ID를 기준으로, 동일한 작성자 ID가 포함된 댓글 및 이를 포함한 웹페이지를 수집한다. 이후, 상기 평판지수 산출부는, 상기 이용자별 크롤링 엔진에 의해 수집된 데이터를 바탕으로, 해당 작성자 ID가 특정 극소수 기업의 웹 페이지에 댓글이 집중된 경우, 해당 작성자 ID에 의해 작성된 댓글은 기업 평판지수 산출에서 제외시킬 수 있다. 구체적으로, 상기 평판지수 산출부가 상기 이용자별 크롤링 엔진에 의해 수집된 데이터로부터 해당 작성자 ID가 댓글을 게재한 웹페이지 기업들과 각 기업별 댓글의 수를 산출하여, 기업별 댓글수의 편차가 기준 값 이상인 경우, 해당 작성자 ID에 의해 작성된 댓글은 기업 평판지수 산출에서 제외시키도록 한다. 물론, 상기 작성자가 극소수의 댓글을 게재한 경우에는 이와 같은 통계적 평가가 적용될 수 없으므로, 해당 작 성자 ID에 의해 게재된 댓글의 수가 제한값 이상인 경우에만 이를 적용할 수 있다. 한편, 상기 핵심지수는 대상 기업에 대한 성장단계에 따라 서로 다른 지수들로 구성될 수 있다. 단, 본 발명에 서 전술한 평판지수는 상기 핵심지수에 포함되는 것이 바람직하다. 예를 들어, 기업 성장단계는, 1) 성장단계, 2) 상업화단계, 3)고도화단계, 4) 성숙단계, 5) 쇠퇴단계 등으로 구 분될 수 있고, 이들 단계를 구분하는 구분요소는 기업의 매출액변화율, 수익률변화율, 자본금변화율, 인력변화 율 및 판매제품(서비스)군 변화율로 특정될 수 있다. 이에 따라, 상기 핵심지수 산출부는 대상 기업의 매출액변화율, 수익률변화율, 자본금변화율, 인력변화율 및 판매제품(서비스)군 변화율을 저장된 테이블과 대비하여 상기 대상 기업의 성장단계를 산출하고, 산출된 성 장단계에 해당하는 핵심지수들을 산출할 수 있다. 한편, 상기 성장지수 산출부는, 상기 매출지표, 재무지표, 신용지표 및 기술지표를 평균화하여 미래성장 지표를 산출한다. 이후, 상기 미래성장 지표에 상기 핵심지수 산출부에서 산출된 핵심요소별 평가지수에 따른 등급별 가감률을 부 가하여 대상 기업의 미래 성장성을 표시하는 성장지수를 산출하여 이용자에게 제공할 수 있다. 이와 같이 평가된 성장지수 산출 예가 도 3에 도시되어 있다. 한편, 본원 발명에서 산출된 성장지수는 다양한 기업 분석 방법에 부가되어 사용될 수 있다. 도 7에 도시된 실시예의 경우, 산출된 성장지수와 BM2 지수를 병행하여 기업의 미래가치를 평가하는 방법이 도 시되어 있고, 도 8에 도시된 실시예의 경우, 본원 발명에 의한 성장지수 분석 시스템에 인공지능 알고리즘을 적 용하여 학습에 의해 분석결과의 정확도를 향상시키는 AI 분석 시스템의 구현 방법을 도시하고 있다. 본 발명의 권리는 위에서 설명된 실시예에 한정되지 않고 청구범위에 기재된 바에 의해 정의되며, 본 발명의 분 야에서 통상의 지식을 가진 자가 청구범위에 기재된 권리범위 내에서 다양한 변형과 개작을 할 수 있다는 것은 자명하다. 산업상 이용가능성 본 발명은 기업의 재무정보 등의 정형적 데이터와 평판이나 명성 등을 나타내는 신뢰도 정보를 이용하여 기업의 성장 가능성을 나타내는 기업 미래 성장지수를 분석하는 시스템에 관한 것으로, 본 발명에 의하면 전통적인 매 출과 재무상태 뿐만 아니라, 기업에 대한 소비자들의 반응과 이에 대한 평가로부터 산출되는 인터넷 상의 기업 평판을 통해 기업을 성장 가능성을 객관적으로 분석할 수 있으므로, 기업 투자 및 운영자의 운영 상태 점검에 있어, 바람직한 의사결정을 할 수 있도록 하는 효과가 있다."}
{"patent_id": "10-2021-0147334", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래기술에 의한 기업성장진단에 따른 기관의 지원 프로그램 매칭 시스템의 구성을 도시한 블록도. 도 2는 본 발명에 의한 기업 미래 성장지수 분석 개념을 도시한 개념도. 도 3은 본 발명에 의한 기업 미래 성장지수의 분석 결과예를 도시한 예시도. 도 4는 본 발명에 의한 기업 미래 성장지수의 분석 시스템의 구조를 도시한 블록도. 도 5는 본 발명에 의한 기업 미래 성장지수의 분석 시스템을 구성하는 평판지수 산출부의 구성을 도시한 블록도. 도 6은 본 발명에 의한 기업 미래 성장지수의 분석 시스템의 데이터 저장구조의 일예를 도시한 예시도. 도 7은 본 발명에 의한 기업 미래 성장지수의 분석 시스템의 활용예를 도시한 예시도. 도 8은 본 발명에 의한 기업 미래 성장지수의 분석 시스템의 다른 활용예를 도시한 예시도."}
