{"patent_id": "10-2023-0134585", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0051465", "출원번호": "10-2023-0134585", "발명의 명칭": "실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법", "출원인": "주식회사 비즈모델라인", "발명자": "이혜란"}}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "운영서버를 통해 실행되는 방법에 있어서,실시간 내지 최근 일정 기간 내 현실세계에서 발생한 실화(Real Story) 중 사용자의 가치 참여 욕구를 형성 가능한 가치형 실화와 관련된 가치형 실화 정보를 지정된 등록 단말을 통해 적어도 i(i≥1)회 등록받아 운영DB에저장하는 제1 단계;지정된 가치형 실화에 대해 등록된 j(j≥1, j⊂i)개의 가치형 실화 정보가 지정된 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건을 만족 시, 지정된 k(1≤k≤j)개의 가치형 실화 정보를 기반으로 상기 가치형실화의 지정된 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하는 제2 단계;상기 가치형 실화의 실화 가치 대상과 상기 확인된 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식별코드와 상기 가치 적응 컨텐츠를 지정된 저장매체에 연계 설정하고, 가치형 실화의 가치 참여 관리를 위해 설정된 C(C≥1)개의 가치 참여 분류 항목 중 상기 k개의 가치형 실화 정보에 적용 가능한 c(1≤c≤C)개의 가치 참여 분류 항목을 기반으로 상기 확인된 가치 적응 컨텐츠와 상기 실화 가치 대상의조합에 적용할 제c'(1≤c'≤c) 가치 참여 분류 항목을 설정하는 제3 단계;상기 가치형 실화의 실화 가치 대상에 적응하여 창작 또는 생성된 N(N≥1)개의 가치 적응 컨텐츠 중 지정된 사용자 단말을 통해 제n(1≤n≤N) 가치 적응 컨텐츠를 확인한 제m(m≥1) 사용자가 상기 제n 가치 적응 컨텐츠에대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청한 경우, 상기 제m 사용자의 가치 참여 요청을상기 설정된 제c' 가치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수행하는 제4 단계; 및상기 가치 참여 절차의 결과에 대응하는 제m 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 저장매체에 연계 저장하는 제5 단계;를 포함하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 가치형 실화는,현실세계에서 발생한 실화 중 이야기 전개 구조나 결과에 통상적으로 해내기 어려운 일을 해내는 실화 영웅(Hero/Heroine)이 실존하는 실화를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 가치형 실화 정보는,실시간 내지 최근 일정 기간 내 현실세계에서 발생한 가치형 실화를 제보하거나 등록하기 위한 t(t≥1)개의 정보를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서, 상기 가치형 실화 정보는,상기 가치형 실화의 실화 영웅을 식별하거나 특정 가능한 실화 영웅 정보,상기 가치형 실화가 발생한 일시 정보,상기 가치형 실화가 위치/장소 정보,공개특허 10-2025-0051465-3-상기 가치형 실화의 적어도 하나의 주체가 적어도 하나의 객체에 대해 지정된 행위를 행하거나 당한 내용을 시계열적으로 설명하는 실화 설명 정보,상기 가치형 실화가 발생한 시점 내지 후에 상기 가치형 실화와 관련된 적어도 하나의 실화 현장에서 지정된 등록 단말에 구비되거나 연동된 카메라와 마이크 중 적어도 하나를 통해 입력되는 신호를 이용하여 생성된 동영상컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠,상기 가치형 실화에 개입하거나 관련된 관공서 정보,상기 가치형 실화에 개입하거나 관련된 병의원 정보,상기 가치형 실화에 개입하거나 관련된 업체 정보 중 가치형 실화를 제보하거나 등록하기 위해 설정된 정보 항목에 대응하는 t개의 정보를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서, 상기 제1 단계는,상기 운영DB에 복수의 가치형 실화 정보가 등록된 경우,상기 등록된 복수의 가치형 실화 정보를 비교 판독하여 동일한 가치형 실화에 대응하는 i'(1≤i'≤i)개의 가치형 실화 정보를 판별하는 단계; 및상기 판별된 i'개의 가치형 실화 정보에 포함된 적어도 하나의 정보를 각기 지정된 정보 항목 별로 분류 처리하는 단계;를 더 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서, 상기 제1 단계는,가치형 실화의 가치 참여 관리를 위해 설정된 C개의 가치 참여 분류 항목 중 상기 등록되는 가치형 실화 정보에적용 가능한 적어도 하나의 가치 참여 분류 항목을 확인하여 상기 가치형 실화 정보에 연계 설정하는 단계를 더포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서, 상기 제2 단계는,지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보를 판독하여 유효한 실화 영웅 정보를 포함하는지 확인하는 단계; 및상기 가치형 실화 정보에 유효한 실화 영웅 정보를 포함하는 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단하는 단계;를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서, 상기 제2 단계는,지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 제각기 포함된 정보 중 지정된 카메라와 마이크중 적어도 하나를 이용하여 상기 가치형 실화와 관련되어 생성된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠중 적어도 하나의 컨텐츠를 확인하는 단계;상기 확인된 컨텐츠의 품질 상태를 판독하여 지정된 가치 적응 컨텐츠의 창작 또는 생성에 이용 가능한 지정된공개특허 10-2025-0051465-4-기준 품질 이상인지 판단하는 단계; 및상기 컨텐츠의 품질 상태가 지정된 기준 품질 이상인 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단하는 단계;를 포함하는 것을 특징으로 하는 실화기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서, 상기 제2 단계는,지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보의 관측된 특징에 대응하는 실화 특징 정보를 추출하는 단계;허구로 짜여진 인기있거나 감동적인 이야기와 과거의 감동 실화와 관련된 이야기 중 적어도 하나의 이야기의 관측된 특징을 지정된 규모 이상 학습한 인공지능모듈에 상기 추출된 실화 특징 정보를 적용하여 상기 j개의 가치형 실화 정보에 대응하는 가치형 실화가 사용자의 가치 참여 욕구를 형성 가능한 이야기 구조를 포함하는지 확인하는 단계; 및상기 가치형 실화가 가치 참여 욕구를 형성 가능한 이야기 구조를 포함하는 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단하는 단계;를 포함하는것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서, 상기 제2 단계는,지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 포함된 실화 영웅의 연락처 정보 또는 상기 실화영웅의 가족/유가족의 연락처 정보를 이용하여 상기 가치형 실화의 실화 영웅 측과 연락하여 지정된 가치 적응컨텐츠의 창작 또는 생성에 대한 실화 영웅 측의 동의 상태를 입증 가능한 실화 영웅 측 동의 정보를 확인하는단계; 및상기 실화 영웅 측 동의 정보를 확인한 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단하는 단계;를 포함하는 것을 특징으로 하는 실화 기반 가치대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항에 있어서, 상기 제2 단계는,지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 포함된 실화 영웅의 연락처 정보 또는 상기 실화영웅의 가족/유가족의 연락처 정보를 이용하여 상기 가치형 실화의 실화 영웅 측과 연락하여 상기 가치형 실화의 지정된 실화 가치 대상에 대한 가치 참여 진행의 실화 영웅 측의 동의 상태를 입증 가능한 실화 영웅 측 동의 정보를 확인하는 단계; 및상기 실화 영웅 측 동의 정보를 확인한 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단하는 단계;를 포함하는 것을 특징으로 하는 실화 기반 가치대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있어서, 상기 가치 적응 컨텐츠는,상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여욕구를 자극 가능한 내용을 포함하여 제작된 동영상 컨텐츠,공개특허 10-2025-0051465-5-상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여욕구를 자극 가능한 내용을 포함하여 제작되어 지정된 영상플랫폼을 통해 송출하도록 설정된 동영상 컨텐츠,상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여욕구를 자극 가능한 내용을 포함하여 지정된 영상플랫폼을 통해 실시간 생성 내지 송출되는 라이브 컨텐츠 중적어도 하나의 컨텐츠를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1항에 있어서, 상기 제2 단계는,상기 k개의 가치형 실화 정보에 적용 가능한 c개의 가치 참여 분류 항목 중 지정된 컨텐츠생성모듈을 통해 생성할 가치 적응 컨텐츠에 적용될 제c' 가치 참여 분류 항목을 설정하는 단계;상기 k개의 가치형 실화 정보에 대응하는 각기 지정된 정보 항목 별 정보와 상기 설정된 제c' 가치 참여 분류항목 정보를 지정된 컨텐츠생성모듈에 적용하여 상기 가치형 실화의 지정된 실화 가치 대상에 적용 가능한 가치참여 분류 항목 중 상기 제c' 가치 참여 분류 항목에 매칭되게 적응된 가치 적응 컨텐츠를 생성하는 단계를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서, 상기 컨텐츠생성모듈은,상기 가치형 실화 정보에 포함된 동영상 컨텐츠나 이미지 컨텐츠 중 적어도 하나의 컨텐츠를 전체 비디오 영역또는 지정된 일부 비디오 영역에 포함하거나 상기 가치형 실화 정보에 포함된 지정된 항목 별 정보를 자막화하거나 이미지화한 컨텐츠를 지정된 일부 비디오 영역에 포함하는 비디오 데이터를 생성하고,지정된 음원 컨텐츠와 상기 가치형 실화 정보에 포함된 지정된 항목 별 정보를 음성 멘트화한 음성 멘트 컨텐츠와 상기 가치형 실화 정보에 포함된 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 오디오 데이터로 생성하여 조합한 동영상 형태의 가치 적응 컨텐츠를 생성하는 프로그램모듈을 포함하는 것을 특징으로 하는 실화 기반 가치대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1항에 있어서, 상기 제2 단계는,지정된 창작자가 이용하는 창작자 단말로 상기 k개의 가치형 실화 정보를 제공하는 단계; 및상기 창작자 단말로부터 상기 k개의 가치형 실화 정보를 근거로 상기 창작자에 의해 창작된 가치 적응 컨텐츠를수신하거나, 또는 상기 창작자에 의해 창작되어 지정된 영상플랫폼을 통해 송출 예정이거나 송출되는 가치 적응컨텐츠에 대응하는 컨텐츠 정보를 수신하고, 상기 k개의 가치형 실화 정보에 적용 가능하게 설정된 c(1≤c≤C)개의 가치 참여 분류 항목 중 상기 창작자 단말을 통해 설정된 제c' 가치 참여 분류 항목을 확인하는 단계;를포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 1항에 있어서, 상기 가치 참여 분류 항목은,가치형 실화의 실화 영웅에 대한 자금 지원을 위한 가치 참여,가치형 실화의 실화 영웅에 대한 보상 지원을 위한 가치 참여,가치형 실화의 실화 영웅에 대한 치료 비용 지원을 위한 가치 참여,공개특허 10-2025-0051465-6-가치형 실화의 실화 영웅에 대한 법률 비용 지원을 위한 가치 참여,가치형 실화의 실화 영웅에 대한 보험 가입 지원을 위한 가치 참여,가치형 실화의 실화 영웅에 대한 가족/유가족 대상 자금 지원을 위한 가치 참여,가치형 실화의 실화 영웅에 대한 가족/유가족 대상 보상 지원을 위한 가치 참여,가치형 실화의 실화 영웅에 대한 가족/유가족 대상 법률 비용 지원을 위한 가치 참여,가치형 실화의 실화 영웅에 대한 가족/유가족 대상 보험 가입 지원을 위한 가치 참여 중 적어도 하나의 가치 참여 분류 항목을 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1항에 있어서, 상기 가치 적응 컨텐츠는,어느 한 가치형 실화의 어느 한 실화 가치 대상에 일대일 적응되어 창작 또는 생성된 컨텐츠,어느 한 가치형 실화의 둘 이상 실화 가치 대상에 다대일 적응되어 창작 또는 생성된 컨텐츠,둘 이상 가치형 실화 별 실화 가치 대상에 다대일 적응되어 창작 또는 생성된 컨텐츠 중 적어도 하나의 컨텐츠를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 1항에 있어서, 상기 가치 참여 식별코드는,사용자 단말을 통해 상기 가치 적응 컨텐츠를 출력하는 중 또는 후에 상기 가치 적응 컨텐츠에 대응하는 지정된가치형 실화의 지정된 실화 가치 대상에 대한 사용자의 가치 참여를 고유 식별하기 위해 중복되지 않게 고유 생성 또는 결정된 식별코드를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서, 상기 가치 참여는,지정된 가치형 실화의 지정된 실화 가치 대상에 대한 기부 형태의 가치 참여,커머스를 위해 결제하는 결제금액 중 지정된 금액이 지정된 가치형 실화의 지정된 실화 가치 대상에 대한 가치참여에 이용되는 커머스 형태의 가치 참여 중 적어도 하나의 가치 참여를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 1항에 있어서, 상기 제4 단계는,상기 가치형 실화의 실화 가치 대상에 적응하여 창작 또는 생성된 N개의 가치 적응 컨텐츠 중 지정된 제n 가치적응 컨텐츠를 지정된 제m 사용자가 이용하는 사용자 단말을 통해 출력하도록 처리하는 단계; 및상기 사용자 단말을 통해 상기 제n 가치 적응 컨텐츠를 출력하는 중 또는 후에 상기 사용자 단말로부터 상기 출력된 제n 가치 적응 컨텐츠를 시각기관이나 청각기관 중 적어도 하나를 통해 인식한 제m 사용자가 상기 제n 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청하는 가치 참여 요청 정보를수신하는 단계;를 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영방법.공개특허 10-2025-0051465-7-청구항 21 제 20항에 있어서,상기 제m 사용자의 사용자 단말을 통해 상기 제n 가치 적응 컨텐츠를 출력 시,상기 사용자 단말을 통해 상기 제m 사용자가 상기 제n 가치 적응 컨텐츠에 설정된 제c' 가치 참여 분류 항목을확인 가능한 가치 참여 분류 확인정보를 출력하도록 처리하는 단계를 더 포함하는 것을 특징으로 하는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법."}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법에 관한 것으로서, 본 발명에 따른 운 영서버를 통해 실행되는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법은, 실시간 내지 최근 일 정 기간 내 현실세계에서 발생한 실화(Real Story) 중 사용자의 가치 참여 욕구를 형성 가능한 가치형 실화와 관 (뒷면에 계속)"}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법에 관한 것이다."}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 MZ세대를 중심으로 소비 행위 등을 통하여 자신의 신념과 가치를 표출하는 ‘미닝아웃(Meaning Out)’ 트 렌드가 확산되고 있다(https://terms.naver.com/entry.naver?docId=6451790&cid=40942&categoryId=31614). 한편 미닝아웃은 소비 행위에만 한정되는 것은 아니며, 금전적 지출을 통해 자신의 신념과 가치를 표출 가능한 다양한 참여 형태와 참여 방식으로 이루어질 수 있으나, 종래의 상용화된 플랫폼으로는 다양한 참여 형태와 참 여 방식으로 미닝아웃을 체계적으로 구현하여 제공하기 난해한 문제점을 지니고 있을 뿐만 아니라, 설령 종래 플랫폼을 일부 수정하여 미닝아웃을 지원하려고 시도하도라도 이러한 시도가 MZ세대의 신념과 가치를 표출하는 형태나 방식에 적용하기 난해한 기술적 문제점을 지니고 있다."}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 현실세계에서 발생한 가치형 실화와 관련된 가치형 실화 정보를 저장하고, 가치형 실화의 지 정된 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하여, 가치형 실화의 실화 가치 대 상과 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식별코드와 가치 적 응 컨텐츠를 연계 설정하고, 가치형 실화 정보에 적용 가능한 가치 참여 분류 항목을 기반으로 상기 확인된 가 치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 가치 참여 분류 항목을 설정하여, 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청한 사용자의 가치 참여 요청을 상기 설정된 가 치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수행한 후, 상기 사용자의 가치 참여 정보와 상기 가 치 참여 식별코드를 지정된 연계 저장하도록 하는 실화 기반 가치 대상에 대한 가치 참여 운영 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 운영서버를 통해 실행되는 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 방법은, 실시간 내지 최근 일정 기간 내 현실세계에서 발생한 실화(Real Story) 중 사용자의 가치 참여 욕구를 형성 가 능한 가치형 실화와 관련된 가치형 실화 정보를 지정된 등록 단말을 통해 적어도 i(i≥1)회 등록받아 운영DB에 저장하는 제1 단계와, 지정된 가치형 실화에 대해 등록된 j(j≥1, j⊂i)개의 가치형 실화 정보가 지정된 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건을 만족 시, 지정된 k(1≤k≤j)개의 가치형 실화 정보를기반으로 상기 가치형 실화의 지정된 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하 는 제2 단계와, 상기 가치형 실화의 실화 가치 대상과 상기 확인된 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식별코드와 상기 가치 적응 컨텐츠를 지정된 저장매체에 연계 설정하 고, 가치형 실화의 가치 참여 관리를 위해 설정된 C(C≥1)개의 가치 참여 분류 항목 중 상기 k개의 가치형 실화 정보에 적용 가능한 c(1≤c≤C)개의 가치 참여 분류 항목을 기반으로 상기 확인된 가치 적응 컨텐츠와 상기 실 화 가치 대상의 조합에 적용할 제c'(1≤c'≤c) 가치 참여 분류 항목을 설정하는 제3 단계와, 상기 가치형 실화 의 실화 가치 대상에 적응하여 창작 또는 생성된 N(N≥1)개의 가치 적응 컨텐츠 중 지정된 사용자 단말을 통해 제n(1≤n≤N) 가치 적응 컨텐츠를 확인한 제m(m≥1) 사용자가 상기 제n 가치 적응 컨텐츠에 대응하는 가치형 실 화의 실화 가치 대상에 대한 가치 참여를 요청한 경우, 상기 제m 사용자의 가치 참여 요청을 상기 설정된 제c' 가치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수행하는 제4 단계와, 상기 가치 참여 절차의 결과 에 대응하는 제m 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 저장매체에 연계 저장하는 제5 단계를 포함한다. 본 발명에 따르면, 상기 가치형 실화는, 현실세계에서 발생한 실화 중 이야기 전개 구조나 결과에 통상적으로 해내기 어려운 일을 해내는 실화 영웅(Hero/Heroine)이 실존하는 실화를 포함할 수 있다. 본 발명에 따르면, 상기 가치형 실화 정보는, 실시간 내지 최근 일정 기간 내 현실세계에서 발생한 가치형 실화 를 제보하거나 등록하기 위한 t(t≥1)개의 정보를 포함할 수 있다. 본 발명에 따르면, 상기 가치형 실화 정보는, 상기 가치형 실화의 실화 영웅을 식별하거나 특정 가능한 실화 영 웅 정보, 상기 가치형 실화가 발생한 일시 정보, 상기 가치형 실화가 위치/장소 정보, 상기 가치형 실화의 적어 도 하나의 주체가 적어도 하나의 객체에 대해 지정된 행위를 행하거나 당한 내용을 시계열적으로 설명하는 실화 설명 정보, 상기 가치형 실화가 발생한 시점 내지 후에 상기 가치형 실화와 관련된 적어도 하나의 실화 현장에 서 지정된 등록 단말에 구비되거나 연동된 카메라와 마이크 중 적어도 하나를 통해 입력되는 신호를 이용하여 생성된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠, 상기 가치형 실화에 개입하거 나 관련된 관공서 정보, 상기 가치형 실화에 개입하거나 관련된 병의원 정보, 상기 가치형 실화에 개입하거나 관련된 업체 정보 중 가치형 실화를 제보하거나 등록하기 위해 설정된 정보 항목에 대응하는 t개의 정보를 포함 할 수 있다. 본 발명에 따르면, 상기 제1 단계는, 상기 운영DB에 복수의 가치형 실화 정보가 등록된 경우, 상기 등록된 복수 의 가치형 실화 정보를 비교 판독하여 동일한 가치형 실화에 대응하는 i'(1≤i'≤i)개의 가치형 실화 정보를 판 별하는 단계와, 상기 판별된 i'개의 가치형 실화 정보에 포함된 적어도 하나의 정보를 각기 지정된 정보 항목 별로 분류 처리하는 단계를 더 포함할 수 있다. 본 발명에 따르면, 상기 제1 단계는, 가치형 실화의 가치 참여 관리를 위해 설정된 C개의 가치 참여 분류 항목 중 상기 등록되는 가치형 실화 정보에 적용 가능한 적어도 하나의 가치 참여 분류 항목을 확인하여 상기 가치형 실화 정보에 연계 설정하는 단계를 더 포함할 수 있다. 본 발명에 따르면, 상기 제2 단계는, 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보를 판독하여 유 효한 실화 영웅 정보를 포함하는지 확인하는 단계와, 상기 가치형 실화 정보에 유효한 실화 영웅 정보를 포함하 는 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단하는 단계를 포함할 수 있다. 본 발명에 따르면, 상기 제2 단계는, 정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 제각기 포함된 정보 중 지정된 카메라와 마이크 중 적어도 하나를 이용하여 상기 가치형 실화와 관련되어 생성된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 확인하는 단계와, 상기 확인된 컨텐츠의 품질 상 태를 판독하여 지정된 가치 적응 컨텐츠의 창작 또는 생성에 이용 가능한 지정된 기준 품질 이상인지 판단하는 단계와, 상기 컨텐츠의 품질 상태가 지정된 기준 품질 이상인 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단하는 단계를 포함할 수 있다. 본 발명에 따르면, 상기 제2 단계는, 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보의 관측된 특징 에 대응하는 실화 특징 정보를 추출하는 단계와, 허구로 짜여진 인기있거나 감동적인 이야기와 과거의 감동 실 화와 관련된 이야기 중 적어도 하나의 이야기의 관측된 특징을 지정된 규모 이상 학습한 인공지능모듈에 상기 추출된 실화 특징 정보를 적용하여 상기 j개의 가치형 실화 정보에 대응하는 가치형 실화가 사용자의 가치 참여 욕구를 형성 가능한 이야기 구조를 포함하는지 확인하는 단계와, 상기 가치형 실화가 가치 참여 욕구를 형성 가 능한 이야기 구조를 포함하는 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어 도 하나의 조건을 만족하는 것으로 판단하는 단계를 포함할 수 있다. 본 발명에 따르면, 상기 제2 단계는, 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 포함된 실화 영웅의 연락처 정보 또는 상기 실화 영웅의 가족/유가족의 연락처 정보를 이용하여 상기 가치형 실화의 실화 영 웅 측과 연락하여 지정된 가치 적응 컨텐츠의 창작 또는 생성에 대한 실화 영웅 측의 동의 상태를 입증 가능한 실화 영웅 측 동의 정보를 확인하는 단계와, 상기 실화 영웅 측 동의 정보를 확인한 경우, 상기 가치 적응 컨텐 츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단하는 단계를 포함 할 수 있다. 본 발명에 따르면, 상기 제2 단계는, 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 포함된 실화 영웅의 연락처 정보 또는 상기 실화 영웅의 가족/유가족의 연락처 정보를 이용하여 상기 가치형 실화의 실화 영 웅 측과 연락하여 상기 가치형 실화의 지정된 실화 가치 대상에 대한 가치 참여 진행의 실화 영웅 측의 동의 상 태를 입증 가능한 실화 영웅 측 동의 정보를 확인하는 단계와, 상기 실화 영웅 측 동의 정보를 확인한 경우, 상 기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판 단하는 단계를 포함할 수 있다. 본 발명에 따르면, 상기 가치 적응 컨텐츠는, 상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여 욕구를 자극 가능한 내용을 포함하여 제작된 동영상 컨텐츠, 상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여 욕구를 자극 가능한 내용을 포함하여 제작되어 지정된 영상플랫폼을 통해 송출하도록 설정된 동영상 컨텐츠, 상기 가치 형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여 욕구를 자 극 가능한 내용을 포함하여 지정된 영상플랫폼을 통해 실시간 생성 내지 송출되는 라이브 컨텐츠 중 적어도 하 나의 컨텐츠를 포함할 수 있다. 본 발명에 따르면, 상기 제2 단계는, 상기 k개의 가치형 실화 정보에 적용 가능한 c개의 가치 참여 분류 항목 중 지정된 컨텐츠생성모듈을 통해 생성할 가치 적응 컨텐츠에 적용될 제c' 가치 참여 분류 항목을 설정하는 단 계와, 상기 k개의 가치형 실화 정보에 대응하는 각기 지정된 정보 항목 별 정보와 상기 설정된 제c' 가치 참여 분류 항목 정보를 지정된 컨텐츠생성모듈에 적용하여 상기 가치형 실화의 지정된 실화 가치 대상에 적용 가능한 가치 참여 분류 항목 중 상기 제c' 가치 참여 분류 항목에 매칭되게 적응된 가치 적응 컨텐츠를 생성하는 단계 를 포함할 수 있다. 본 발명에 따르면, 상기 컨텐츠생성모듈은, 상기 가치형 실화 정보에 포함된 동영상 컨텐츠나 이미지 컨텐츠 중 적어도 하나의 컨텐츠를 전체 비디오 영역 또는 지정된 일부 비디오 영역에 포함하거나 상기 가치형 실화 정보 에 포함된 지정된 항목 별 정보를 자막화하거나 이미지화한 컨텐츠를 지정된 일부 비디오 영역에 포함하는 비디 오 데이터를 생성하고, 지정된 음원 컨텐츠와 상기 가치형 실화 정보에 포함된 지정된 항목 별 정보를 음성 멘트화한 음성 멘트 컨텐츠와 상기 가치형 실화 정보에 포함된 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 오디오 데이터로 생성하여 조합한 동영상 형태의 가치 적응 컨텐츠를 생성하는 프로그램모듈을 포함할 수 있다. 본 발명에 따르면, 상기 제2 단계는, 지정된 창작자가 이용하는 창작자 단말로 상기 k개의 가치형 실화 정보를 제공하는 단계와, 상기 창작자 단말로부터 상기 k개의 가치형 실화 정보를 근거로 상기 창작자에 의해 창작된 가치 적응 컨텐츠를 수신하거나, 또는 상기 창작자에 의해 창작되어 지정된 영상플랫폼을 통해 송출 예정이거나 송출되는 가치 적응 컨텐츠에 대응하는 컨텐츠 정보를 수신하고, 상기 k개의 가치형 실화 정보에 적용 가능하게 설정된 c(1≤c≤C)개의 가치 참여 분류 항목 중 상기 창작자 단말을 통해 설정된 제c' 가치 참여 분류 항목을 확인하는 단계를 포함할 수 있다. 본 발명에 따르면, 상기 가치 참여 분류 항목은, 가치형 실화의 실화 영웅에 대한 자금 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 보상 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 치료 비용 지원 을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 법률 비용 지원을 위한 가치 참여, 가치형 실화의 실화 영 웅에 대한 보험 가입 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 가족/유가족 대상 자금 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 가족/유가족 대상 보상 지원을 위한 가치 참여, 가치형 실화 의 실화 영웅에 대한 가족/유가족 대상 법률 비용 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 가 족/유가족 대상 보험 가입 지원을 위한 가치 참여 중 적어도 하나의 가치 참여 분류 항목을 포함할 수 있다. 본 발명에 따르면, 상기 가치 적응 컨텐츠는, 어느 한 가치형 실화의 어느 한 실화 가치 대상에 일대일 적응되 어 창작 또는 생성된 컨텐츠, 어느 한 가치형 실화의 둘 이상 실화 가치 대상에 다대일 적응되어 창작 또는 생 성된 컨텐츠, 둘 이상 가치형 실화 별 실화 가치 대상에 다대일 적응되어 창작 또는 생성된 컨텐츠 중 적어도 하나의 컨텐츠를 포함할 수 있다. 본 발명에 따르면, 상기 가치 참여 식별코드는, 사용자 단말을 통해 상기 가치 적응 컨텐츠를 출력하는 중 또는 후에 상기 가치 적응 컨텐츠에 대응하는 지정된 가치형 실화의 지정된 실화 가치 대상에 대한 사용자의 가치 참 여를 고유 식별하기 위해 중복되지 않게 고유 생성 또는 결정된 식별코드를 포함할 수 있다. 본 발명에 따르면, 상기 가치 참여는, 지정된 가치형 실화의 지정된 실화 가치 대상에 대한 기부 형태의 가치 참여, 커머스를 위해 결제하는 결제금액 중 지정된 금액이 지정된 가치형 실화의 지정된 실화 가치 대상에 대한 가치 참여에 이용되는 커머스 형태의 가치 참여 중 적어도 하나의 가치 참여를 포함할 수 있다. 본 발명에 따르면, 상기 제4 단계는, 상기 가치형 실화의 실화 가치 대상에 적응하여 창작 또는 생성된 N개의 가치 적응 컨텐츠 중 지정된 제n 가치 적응 컨텐츠를 지정된 제m 사용자가 이용하는 사용자 단말을 통해 출력하 도록 처리하는 단계와, 상기 사용자 단말을 통해 상기 제n 가치 적응 컨텐츠를 출력하는 중 또는 후에 상기 사 용자 단말로부터 상기 출력된 제n 가치 적응 컨텐츠를 시각기관이나 청각기관 중 적어도 하나를 통해 인식한 제 m 사용자가 상기 제n 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청하는 가치 참여 요청 정보를 수신하는 단계를 포함할 수 있다. 본 발명에 따르면, 상기 제m 사용자의 사용자 단말을 통해 상기 제n 가치 적응 컨텐츠를 출력 시, 상기 사용자 단말을 통해 상기 제m 사용자가 상기 제n 가치 적응 컨텐츠에 설정된 제c' 가치 참여 분류 항목을 확인 가능한 가치 참여 분류 확인정보를 출력하도록 처리하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 현실세계에서 실시간 내지 최근 일정 기간 내 발생한 가치형 실화의 실화 영웅을 포함하는 실화 기반 가치 대상에 대한 사용자의 가치 참여를 체계적으로 운영, 관리하는 이점이 있다. 본 발명에 따르면, 현실세계에서 실시간 내지 최근 일정 기간 내 발생한 가치형 실화의 실화 가치 대상과 상기 가치형 실화의 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠의 조합 별로 사용자들의 가치 참 여를 체계적으로 운영하는 이점이 있다. 본 발명에 따르면, 현실세계에서 실시간 내지 최근 일정 기간 내 발생한 가치형 실화 중 어떤 가치형 실화의 어 느 실화 가치 대상에 적응하여 창작 또는 생성된 특정 가치 적응 컨텐츠를 통해 이루어지는 사용자들의 가치 참 여를 체계적으로 추적 관리하는 이점이 있다. 본 발명에 따르면, 현실세계에서 실시간 내지 최근 일정 기간 내 발생한 가치형 실화의 실화 가치 대상과 상기 가치형 실화의 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 각기 설정된 가치 참여 분류 항목 별로 체계적으로 운영하는 이점이 있다. 본 발명에 따르면, 현실세계에서 실시간 내지 최근 일정 기간 내 발생한 가치형 실화 중 어떤 가치형 실화의 어 느 실화 가치 대상에 적응하여 창작 또는 생성된 특정 가치 적응 컨텐츠를 기반으로 각기 지정된 가치 참여 분 류 항목 별로 이루어지는 사용자들의 가치 참여를 체계적으로 추적 관리하는 이점이 있다."}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면과 설명을 참조하여 본 발명의 바람직한 실시예에 대한 동작 원리를 상세히 설명한다. 다만, 하기에 도시되는 도면과 후술되는 설명은 본 발명의 특징을 효과적으로 설명하기 위한 여러 가지 방법 중에서 바람직한 실시 방법에 대한 것이며, 본 발명이 하기의 도면과 설명만으로 한정되는 것은 아니다. 즉, 하기의 실시예는 본 발명의 수 많은 실시예 중에 바람직한 합집합 형태의 실시예에 해당하며, 하기의 실시 예에서 특정 구성(또는 단계)을 생략하는 실시예, 또는 특정 구성(또는 단계)에 구현된 기능을 특정 구성(또는 단계)으로 분할하는 실시예, 또는 둘 이상의 구성(또는 단계)에 구현된 기능을 어느 하나의 구성(또는 단계)에 통합하는 실시예, 특정 구성(또는 단계)의 동작 순서를 교체하는 실시예 등은, 하기의 실시예에서 별도로 언급 하지 않더라도 모두 본 발명의 권리범위에 속함을 명백하게 밝혀두는 바이다. 따라서 하기의 실시예를 기준으로 부분집합 또는 여집합에 해당하는 다양한 실시예들이 본 발명의 출원일을 소급받아 분할될 수 있음을 분명하게 명기하는 바이다.또한, 하기에서 본 발명을 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지 를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서, 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 발명에서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 결과적으로, 본 발명의 기술적 사상은 청구범위에 의해 결정되며, 이하 실시예는 진보적인 본 발명의 기술적 사"}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상을 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 효율적으로 설명하기 위한 일 수단일 뿐이다. 도면1은 본 발명의 실시 방법에 따른 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 시스템의 구성 을 도시한 도면이다. 보다 상세하게 본 도면1에 따르면, 현실세계에서 발생한 가치형 실화와 관련된 가치형 실화 정보를 저장하고, 가치형 실화의 지정된 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하여, 가치형 실화 의 실화 가치 대상과 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식 별코드와 가치 적응 컨텐츠를 연계 설정하고, 가치형 실화 정보에 적용 가능한 가치 참여 분류 항목을 기반으로 상기 확인된 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 가치 참여 분류 항목을 설정하여, 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청한 사용자의 가치 참여 요청을 상기 설정된 가치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수행한 후, 상기 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 연계 저장하도록 하는 시스템의 구성을 도시한 것으로서, 본 발명이"}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "속한 기술분야에서 통상의 지식을 가진 자라면, 본 도면1을 참조 및/또는 변형하여 본 발명에 따른 시스템의 구 성에 대한 다양한 실시 방법(예컨대, 일부 구성부가 생략되거나, 또는 세분화되거나, 또는 합쳐진 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면1에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 본 발명의 시스템은, 실시간 내지 최근 일정 기간 내 현실세계에서 발생한 실화(Real Story) 중 사용자의 가치 참여 욕구를 형성 가능한 가치형 실화와 관련된 가치형 실화 정보를 지정된 운영서버에 등록하는 등록 단 말과, 운영서버로 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청하는 사용자가 이용하는 사용자 단말과, 가치형 실화 정보를 운영서버로 제공하는 창작자가 이용 하는 창작자 단말과, 가치 적응 컨텐츠를 생성 가능한 운영자가 이용하는 운영자 단말과, 상기 등록 단말, 사용자 단말, 창작자 단말 및 운영자 단말과 연동하여 실화 기반 가치 대상에 대한 가치 참여 분류 별 가치 참여와 관련된 서비스를 운영하는 운영서버를 포함한다. 본 발명에 따른 가치형 실화는, 현실세계에서 발생한 실화 중 이야기 전개 구조나 결과에 통상적으로 해내기 어 려운 일을 해내는 실화 영웅(Hero/Heroine)이 실존하는 실화를 포함할 수 있다. 여기서, 상기 실화 영웅은, 통상의 사람이 해내기 어려운 일을 해내는 실존 사람, 통상의 동물이 해내기 어려운 일을 해내는 실존 동물, 통상의 사람과 동물이 해내기 어려운 일을 해내는 실존 사람과 실존 동물의 조합, 통상 적으로 해내기 어려운 일을 해내는 적어도 하나의 생명체 중 어느 하나일 수 있다. 또한, 본 발명에 따른 가치형 실화 정보는, 실시간 내지 최근 일정 기간 내 현실세계에서 발생한 가치형 실화를 제보하거나 등록하기 위한 t(t≥1)개의 정보를 포함할 수 있다. 여기서, 상기 t개의 정보는, 가치형 실화를 제보하거나 등록하기 위해 지정된 정보 항목 별 정보를 포함할 수 있다.또한, 상기 가치형 실화 정보는, 상기 가치형 실화의 실화 영웅을 식별하거나 특정 가능한 실화 영웅 정보를 포 함할 수 있다. 여기서 상기 실화 영웅 정보는, 상기 가치형 실화의 실화 영웅이 사람인 경우, 상기 실화 영웅의 성명 정보, 상 기 실화 영웅의 성별 정보, 상기 실화 영웅의 연령대 정보, 상기 실화 영웅의 연락처 정보, 상기 실화 영웅의 가족/유가족의 연락처 정보, 상기 실화 영웅의 외형 특징 정보, 상기 실화 영웅의 신체 특징 정보, 상기 실화 영웅의 직업/소속 정보 중 실화 영웅을 식별하거나 특정하기 위한 적어도 하나의 정보를 포함할 수 있다. 또한, 상기 실화 영웅 정보는, 상기 가치형 실화의 실화 영웅이 동물을 포함하는 경우, 상기 동물의 반려인 성 명 정보, 반려인 연락처 정보, 반려인 외형 특징 정보, 반려인 신체 특징 정보, 반려인 직업/소속 정보 중 적어 도 하나의 반려인 정보, 상기 동물의 과/속/종 중 적어도 하나를 식별 가능한 동물 종류 정보, 상기 동물의 품 종을 식별 가능한 동물 품종 정보, 상기 동물의 외형 특징 정보, 상기 동물의 신체 특징 정보 중 실화 영웅에 해당하는 동물을 식별하거나 특정하기 위한 적어도 하나의 정보를 포함할 수 있다. 또한, 상기 가치형 실화 정보는, 상기 가치형 실화가 발생한 일시 정보, 상기 가치형 실화가 위치/장소 정보, 상기 가치형 실화의 적어도 하나의 주체가 적어도 하나의 객체에 대해 지정된 행위를 행하거나 당한 내용을 시 계열적으로 설명하는 실화 설명 정보 중 적어도 하나의 정보를 포함할 수 있다. 또한, 상기 가치형 실화 정보는, 상기 가치형 실화가 발생한 시점 내지 후에 상기 가치형 실화와 관련된 적어도 하나의 실화 현장에서 지정된 등록 단말에 구비되거나 연동된 카메라와 마이크 중 적어도 하나를 통해 입 력되는 신호를 이용하여 생성된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 포함 할 수 있다. 여기서, 상기 실화 현장은, 상기 가치형 실화가 발생한 위치/장소에 대응하는 실화 발생 현장, 상기 가치형 실 화가 발생한 이후에 상기 가치형 실화와 연계된 적어도 하나의 연계 실화가 발생하는 연계 실화 현장 중 적어도 하나의 현장을 포함할 수 있다. 상기 연계 실화 현장은, 상기 가치형 실화가 발생한 이후에 상기 가치형 실화와 연계된 조사가 이루어지는 관공 서, 상기 가치형 실화와 관련된 병의원, 상기 가치형 실화와 관련된 업체, 상기 가치형 실화의 실화 영웅과 관 련된 장소, 상기 가치형 실화와 연계된 재판이 이루어지는 법원 중 적어도 하나의 현장을 포함할 수 있다. 또한, 상기 가치형 실화 정보는, 상기 가치형 실화에 개입하거나 관련된 관공서 정보, 상기 가치형 실화에 개입 하거나 관련된 병의원 정보, 상기 가치형 실화에 개입하거나 관련된 업체 정보 중 적어도 하나의 정보를 포함할 수 있다. 등록 단말은, 가치형 실화 정보를 지정된 운영서버에 등록하는 등록자가 이용하는 단말의 총칭으로, 바람직하게 유선단말과 무선단말을 포함한다. 등록 단말은 웹 방식으로 지정된 통신망을 경유하여 운영서 버와 통신하거나, 지정된 앱(Application; App)을 이용한 앱 방식으로 지정된 통신망을 경유하여 운영서버 와 통신하거나, 웹 방식과 앱 방식을 혼합한 하이브리드 방식으로 지정된 통신망을 경유하여 운영서버 와 통신할 수 있다. 본 발명의 실시 방법에 따르면, 등록 단말은 웹 방식으로 운영서버와 통신하는 경우 상기 웹 방식을 구현하기 위한 브라우져를 탑재하며, 앱 방식으로 운영서버와 통신하는 경우 상기 앱 방식을 구현하기 위 한 앱을 탑재하며, 하이브리드 방식으로 운영서버와 통신하는 경우 상기 하이브리드 방식을 구현하기 위한 브라우져 기능을 내장한 앱을 탑재할 수 있다.한편 상기 등록 단말에 상기 앱 방식이나 하이브리드 방식을 구현하기 위한 앱이 탑재되는 경우, 등록 단 말의 앱에는 본 도면1의 운영서버에 도시한 기능 구성부의 기능 중 적어도 일부 기능이 앱에 탑재되 어 구현되거나 및/또는 앱과 운영서버에 분산 구현되는 형태로 탑재될 수 있으며, 본 발명은 이러한 실시 예도 권리범위로 포함할 수 있다. 본 발명에 따른 등록 단말은, 카메라와 마이크 중 적어도 하나를 구비하거나 연동하고, 상기 카메라와 마 이크 중 적어도 하나를 통해 입력되는 신호를 이용하여 상기 가치형 신화와 관련된 동영상 컨텐츠, 이미지 컨텐 츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 생성한 단말을 포함할 수 있다. 또한, 상기 등록 단말은, 상기 가치형 실화가 발생한 시점에 상기 가치형 실화가 발생한 실화 현장이나 실 화 현장 주변에 있었던 실화 당사자나 실화 관계자 내지 실화 견자 중 적어도 하나가 소지한 무선단말 중 상기 가치형 실화와 관련된 적어도 하나의 컨텐츠를 생성한 무선단말을 포함할 수 있다. 또한, 상기 등록 단말은, 상기 가치형 실화가 발생한 시점에 상기 가치형 실화가 발생한 실화 현장을 촬영 하여 기록한 감시카메라나 감시장비와 연동하는 단말을 포함할 수 있다. 또한, 상기 등록 단말은, 상기 가치형 실화가 발생한 시점에 상기 가치형 실화가 발생한 실화 현장이나 실 화 현장 주변에 있었던 실화 당사자나 실화 관계자 내지 실화 견자 중 상기 가치형 실화 또는 상기 가치형 실화 의 실화 영웅을 제보하려는 제보자가 이용하는 단말을 포함할 수 있다. 사용자의 단말은 운영서버로 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가 치 참여를 요청하는 사용자가 이용하는 단말의 총칭으로, 바람직하게 유선단말과 무선단말을 포함한다. 사용자 단말은 웹 방식으로 지정된 통신망을 경유하여 운영서버와 통신하거나, 지정된 앱(Application; Ap p)을 이용한 앱 방식으로 지정된 통신망을 경유하여 운영서버와 통신하거나, 웹 방식과 앱 방식을 혼합한 하이브리드 방식으로 지정된 통신망을 경유하여 운영서버와 통신할 수 있다. 본 발명의 실시 방법에 따르면, 사용자 단말은 웹 방식으로 운영서버와 통신하는 경우 상기 웹 방식 을 구현하기 위한 브라우져를 탑재하며, 앱 방식으로 운영서버와 통신하는 경우 상기 앱 방식을 구현하기 위한 앱을 탑재하며, 하이브리드 방식으로 운영서버와 통신하는 경우 상기 하이브리드 방식을 구현하기 위 한 브라우져 기능을 내장한 앱을 탑재할 수 있다. 한편 상기 사용자 단말에 상기 앱 방식이나 하이브리드 방식을 구현하기 위한 앱이 탑재되는 경우, 사용자 단말의 앱에는 본 도면1의 운영서버에 도시한 기능 구성부의 기능 중 적어도 일부 기능이 앱에 탑재 되어 구현되거나 및/또는 앱과 운영서버에 분산 구현되는 형태로 탑재될 수 있으며, 본 발명은 이러한 실 시예도 권리범위로 포함할 수 있다. 창작자 단말은 가치형 실화 정보를 운영서버로 제공하는 창작자가 이용하는 단말의 총칭으로, 바람직 하게 유선단말과 무선단말을 포함한다. 창작자 단말은 웹 방식으로 지정된 통신망을 경유하여 운영서버 와 통신하거나, 지정된 앱(Application; App)을 이용한 앱 방식으로 지정된 통신망을 경유하여 운영서버 와 통신하거나, 웹 방식과 앱 방식을 혼합한 하이브리드 방식으로 지정된 통신망을 경유하여 운영서버 와 통신할 수 있다. 본 발명의 실시 방법에 따르면, 창작자 단말은 웹 방식으로 운영서버와 통신하는 경우 상기 웹 방식 을 구현하기 위한 브라우져를 탑재하며, 앱 방식으로 운영서버와 통신하는 경우 상기 앱 방식을 구현하기 위한 앱을 탑재하며, 하이브리드 방식으로 운영서버와 통신하는 경우 상기 하이브리드 방식을 구현하기 위 한 브라우져 기능을 내장한 앱을 탑재할 수 있다. 한편 상기 창작자 단말에 상기 앱 방식이나 하이브리드 방식을 구현하기 위한 앱이 탑재되는 경우, 창작자 단말의 앱에는 본 도면1의 운영서버에 도시한 기능 구성부의 기능 중 적어도 일부 기능이 앱에 탑재 되어 구현되거나 및/또는 앱과 운영서버에 분산 구현되는 형태로 탑재될 수 있으며, 본 발명은 이러한 실 시예도 권리범위로 포함할 수 있다. 운영자 단말은 가치 적응 컨텐츠를 생성 가능한 운영자가 이용하는 단말의 총칭으로, 바람직하게 유선단말 과 무선단말을 포함한다. 운영자 단말은 웹 방식으로 지정된 통신망을 경유하여 운영서버와 통신하거 나, 지정된 앱(Application; App)을 이용한 앱 방식으로 지정된 통신망을 경유하여 운영서버와 통신하거나, 웹 방식과 앱 방식을 혼합한 하이브리드 방식으로 지정된 통신망을 경유하여 운영서버와 통신 할 수 있다. 본 발명의 실시 방법에 따르면, 운영자 단말은 웹 방식으로 운영서버와 통신하는 경우 상기 웹 방식 을 구현하기 위한 브라우져를 탑재하며, 앱 방식으로 운영서버와 통신하는 경우 상기 앱 방식을 구현하기 위한 앱을 탑재하며, 하이브리드 방식으로 운영서버와 통신하는 경우 상기 하이브리드 방식을 구현하기 위 한 브라우져 기능을 내장한 앱을 탑재할 수 있다. 한편 상기 운영자 단말에 상기 앱 방식이나 하이브리드 방식을 구현하기 위한 앱이 탑재되는 경우, 창작자 단말의 앱에는 본 도면1의 운영서버에 도시한 기능 구성부의 기능 중 적어도 일부 기능이 앱에 탑재 되어 구현되거나 및/또는 앱과 운영서버에 분산 구현되는 형태로 탑재될 수 있으며, 본 발명은 이러한 실 시예도 권리범위로 포함할 수 있다. 운영서버는 현실세계에서 발생한 가치형 실화와 관련된 가치형 실화 정보를 저장하고, 가치형 실화의 지정 된 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하여, 가치형 실화의 실화 가치 대상 과 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식별코드와 가치 적응 컨텐츠를 연계 설정하고, 가치형 실화 정보에 적용 가능한 가치 참여 분류 항목을 기반으로 상기 확인된 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 가치 참여 분류 항목을 설정하여, 가치 적응 컨텐츠에 대 응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청한 사용자의 가치 참여 요청을 상기 설정된 가치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수행한 후, 상기 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 연계 저장하도록 하는 절차를 수행하는 서버의 총칭으로서, 본 도면1의 운영서버 가 특정한(또는 어느 하나의) 물리적 서버장치로 한정되는 것은 아니다. 또한, 본 도면1에 도시된 운영서버의 각 구성부는 어느 한 주체(예컨대, 사업자, 기업, 기관, 개인 등)가 운영하는 서버를 통해 구현되거나 및/또는 어느 한 주체가 운영하는 둘 이상의 서버나 장치를 통해 분산 구현되 거나 및/또는 제휴된 둘 이상의 주체가 운영하는 둘 이상의 서버나 장치를 통해 분산 구현되거나 및/또는 어느 한 주체가 기 구축한 서버나 장치에 추가/설치되는 소프트웨어 형태로 구현되거나 및/또는 제휴된 둘 이상의 주 체가 운영하는 둘 이상의 서버나 장치에 추가/설치되는 소프트웨어 형태로 구현되는 형태 등의 실시예가 모두 가능하며, 상기 운영서버를 구현하는 방식에 의해 본 발명이 한정되지 아니함을 명백하게 밝혀두는 바이다. 한편 본 발명의 상세한 설명이나 청구항에서 상기 운영서에 구비된 구성부가 실행하는 특정한 기능에 대해 '~도록 처리'한다거나 '~하는 절차를 수행'한다는 취지의 기재의 의미는 특정 주체의 서버(또는 소프트웨 어)가 해당 기능을 직접 실행한다는 의미를 내포함은 물론, 특정 주체의 서버(또는 소프트웨어)와 제휴된 다른 주체의 서버나 장치를 통해 해당 기능을 실행하도록 요청하거나 다른 주체의 서버나 장치가 해당 기능을 실행하 기 위해 필요한 전처리를 실행하거나 다른 주체의 서버나 장치가 해당 기능을 실행한 결과를 제공받는다는 의미를 모두 내포하는 기재로서, 이러한 기재에 대응하는 행위의 주체는 특정 주체가 직접 수행하지 않고(권리범위 의 회피를 위해) 다른 주체의 서버나 장치를 통해 실행하도록 요청하거나 전처리하거나 실행된 결과를 제공받더 라도 특정 주체의 행위로 귀속되는 것으로 해석할 수 있음을 명백하게 밝혀두는 바이다. 도면1을 참조하면, 운영서버는, 현실세계에서 발생한 가치형 실화와 관련된 가치형 실화 정보를 저장하는 정보 등록부와, 가치형 실화의 지정된 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하는 컨텐츠 확인부와, 가치형 실화의 실화 가치 대상과 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식별코드와 가치 적응 컨텐츠를 연계 설정하고, 가치형 실화의 가치 참여 관리를 위해 설정된 가치 참여 분류 항목 중 상기 가치형 실화 정보에 적용 가능한 가치 참여 분류 항목을 기반으로 상기 확인된 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 가치 참여 분류 항목을 설정하 는 분류항목 설정부와, 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청한 사용자의 가치 참여 요청을 상기 설정된 가치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수 행하는 가치 참여부와, 상기 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 연계 저장하는 참여결과 저장부를 포함하여 구성될 수 있다. 상기 정보 등록부는 실시간 내지 최근 일정 기간 내 현실세계에서 발생한 실화(Real Story) 중 사용자의 가치 참여 욕구를 형성 가능한 가치형 실화와 관련된 가치형 실화 정보를 지정된 등록 단말을 통해 적어도 i(i≥1)회 등록받아 운영DB에 저장한다. 본 발명의 실시 방법에 따르면, 상기 정보 등록부는, 가치형 실화의 가치 참여 관리를 위해 설정된 C(C≥ 1)개의 가치 참여 분류 항목에 대응하는 C개의 가치 참여 분류 정보를 저장할 수 있다. 여기서, 상기 C개의 가치 참여 분류 정보는, C개의 가치 참여 분류 항목 별 가치 참여 분류를 식별하는 가치 참 여 분류 식별정보, C개의 가치 참여 분류 항목 별 가치 참여 분류의 명칭에 대응하는 가치 참여 분류 명칭정보, C개의 가치 참여 분류 항목 별 가치 참여 분류를 설명하는 가치 참여 분류 설명정보 중 적어도 하나의 정보를 포함할 수 있다. 또한, 상기 C개의 가치 참여 분류 정보는, 상기 가치형 실화 정보에 포함된 정보 중 지정된 정보 항목 별 정보 를 판독하여 상기 가치형 실화 정보에 적용 가능한 가치 참여 분류 항목을 판별하기 위한 가치 참여 분류 판별 정보를 더 포함할 수 있다. 또한, 상기 가치 참여 분류 판별정보는, 상기 가치형 실화 정보에 포함된 지정된 정보 항목 별 정보에 포함 가 능한 단어나 문자열 중 지정된 가치 참여 분류 항목과 매칭되는 적어도 하나의 키워드 정보를 포함하거나, 또는 상기 가치형 실화 정보에 포함된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 지정된 가치 참여 분류 항목 과 매칭되는 컨텐츠를 판별하기 위한 컨텐츠 특징 인식 정보를 포함할 수 있다. 본 발명의 실시 방법에 따르면, 상기 정보 등록부는, 지정된 등록 단말을 통해 가치형 실화 정보를 수신한 경우, 상기 수신된 가치형 실화 정보를 판독하여 기 등록된 가치형 실화와 다른 신규 가치형 실화에 대 응하는 신규 가치형 실화 정보인지 판별할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 정보 등록부는, 상기 수신된 가치형 실화 정보에 포함된 지정 된 정보 항목 별 t'(t'≥1)개의 정보와 상기 운영DB에 기 등록된 가치형 실화 정보에 포함된 동일한 정보 항목 별 t'개의 정보를 비교 판독하여 상기 수신된 가치형 실화 정보가 신규 가치형 실화에 대응하는 신규 가치형 실 화 정보인지 판별할 수 있다. 여기서, 상기 t’개의 정보는, 가치형 실화 정보에 포함된 일시 정보, 위치/장소 정보, 실화 영웅 정보 중 적어 도 하나에 대응하는 정보를 포함할 수 있다.또한, 본 발명의 실시 방법에 따르면, 상기 정보 등록부는, 지정된 등록 단말을 통해 신규 가치형 실 화에 대응하는 신규 가치형 실화 정보를 수신한 경우, 상기 신규 가치형 실화를 고유 식별하거나 상기 신규 가 치형 실화의 실화 영웅을 고유 식별하기 위해 중복되지 않는 고유의 가치 대상 식별코드를 생성하거나 결정하여 상기 수신된 가치형 실화 정보와 연계 저장할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 정보 등록부는, 지정된 등록 단말을 통해 기 등록된 가치 형 실화에 대응하는 가치형 실화 정보를 수신한 경우, 상기 등록된 가치형 실화를 고유 식별하거나 상기 등록된 가치형 실화의 실화 영웅을 고유 식별하기 위해 기 생성되거나 결정된 가치 대상 식별코드와 상기 수신된 가치 형 실화 정보를 연계 저장할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 정보 등록부는, 상기 운영DB에 복수의 가치형 실화 정보가 등 록된 경우, 상기 등록된 복수의 가치형 실화 정보를 비교 판독하여 동일한 가치형 실화에 대응하는 i'(1≤i'≤ i)개의 가치형 실화 정보를 판별하고, 상기 판별된 i'개의 가치형 실화 정보에 포함된 적어도 하나의 정보를 각 기 지정된 정보 항목 별로 분류 처리할 수 있다. 상기 가치형 실화 정보를 판별하는 과정에서, 상기 정보 등록부는, 상기 등록된 복수의 가치형 실화 정보 에 포함된 지정된 정보 항목 별 t'(t'≥1)개의 정보를 비교 판독하여 동일한 가치형 실화에 대응하는 i'개의 가 치형 실화 정보를 판별할 수 있다. 여기서, 상기 t’개의 정보는, 가치형 실화 정보에 포함된 일시 정보, 위치/장소 정보, 실화 영웅 정보 중 적어 도 하나에 대응하는 정보를 포함할 수 있다. 또한, 상기 가치형 실화 정보에 포함된 적어도 하나의 정보를 각기 지정된 정보 항목 별로 분류 처리하는 과정 에서, 상기 정보 등록부는, 상기 가치형 실화 정보에 포함된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐 츠 중 적어도 하나의 컨텐츠를 지정된 분류 기준에 따라 분류 처리할 수 있다. 여기서, 상기 분류 기준은, 일시 별 분류 기준, 현장 별 분류 기준, 실화의 시계열적 분류 기준, 컨텐츠 종류 별 분류 기준 중 적어도 하나의 분류 기준을 포함할 수 있다. 또한, 상기 가치형 실화 정보에 포함된 적어도 하나의 정보를 각기 지정된 정보 항목 별로 분류 처리하는 과정 에서, 상기 정보 등록부는, 상기 가치형 실화 정보에 포함된 실화 설명 정보를 지정된 분류 기준에 따라 분류 처리할 수 있다. 여기서, 상기 분류 기준은, 실화 설명 정보를 통해 설명되는 대상의 일시 별 분류 기준, 실화 설명 정보를 통해 설명되는 대상의 현장 별 분류 기준, 실화 설명 정보에 포함된 설명 내용의 시계열적 분류 기준, 실화 설명 정 보를 통해 설명되는 실화 주체 별 분류 기준, 실화 설명 정보를 통해 설명되는 실화 객체 별 분류 기준 중 적어 도 하나의 분류 기준을 포함할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 정보 등록부는, 가치형 실화의 가치 참여 관리를 위해 설정된 C개의 가치 참여 분류 항목 중 상기 등록되는 가치형 실화 정보에 적용 가능한 적어도 하나의 가치 참여 분류 항목을 확인하여 상기 가치형 실화 정보에 연계 설정할 수 있다. 여기서, 상기 정보 등록부는, 기 설정된 C개의 가치 참여 분류 항목 별 가치 참여 분류 판별정보를 기반으 로 상기 등록되는 가치형 실화 정보에 포함된 지정된 정보 항목 별 정보를 판독하여 상기 등록되는 가치형 실화 정보에 적용 가능한 적어도 하나의 가치 참여 분류 항목을 확인할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 정보 등록부는, 상기 가치형 실화를 제보하는 제보자의 단말을 통해 상기 가치형 실화 정보가 등록된 경우, 상기 제보자를 식별 가능한 제보자 식별정보와 상기 가치형 실화정보를 연계 저장할 수 있다. 상기 컨텐츠 확인부는, 상기 정보 등록부를 통해 가치형 실화 정보가 저장된 이후, 지정된 가치형 실 화에 대해 등록된 j(j≥1, j⊂i)개의 가치형 실화 정보가 지정된 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨 텐츠 구성 조건을 만족 시, 지정된 k(1≤k≤j)개의 가치형 실화 정보를 기반으로 상기 가치형 실화의 지정된 실 화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인한다. 여기서, 상기 j개의 가치형 실화 정보는, 상기 운영DB에 등록 저장된 가치형 실화 정보 중 동일한 가치형 실화 에 대응하는 가치형 실화 정보를 포함할 수 있다. 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보를 판독하여 유효한 실화 영웅 정보를 포함하는지 확인하고, 상기 가치형 실화 정보에 유효한 실화 영 웅 정보를 포함하는 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가 치형 실화 정보에 제각기 포함된 정보를 각기 지정된 정보 항목 별로 분석하여 상기 가치형 실화에 대한 육하원 칙이 지정된 기준치 이상 성립하는지 확인하고, 상기 가치형 실화의 육하원칙이 지정된 기준치 이상 성립하는 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가 치형 실화 정보에 제각기 포함된 정보 중 지정된 카메라와 마이크 중 적어도 하나를 이용하여 상기 가치형 실화 와 관련되어 생성된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 확인하고, 상기 확인된 컨텐츠의 품질 상태를 판독하여 지정된 가치 적응 컨텐츠의 창작 또는 생성에 이용 가능한 지정된 기준 품질 이상인지 판단하여, 상기 컨텐츠의 품질 상태가 지정된 기준 품질 이상인 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가 치형 실화 정보에 제각기 포함된 정보 중 지정된 카메라와 마이크 중 적어도 하나를 이용하여 상기 가치형 실화 와 관련되어 생성된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 확인하고, 상기 확인된 컨텐츠의 품질 상태를 판독하여 지정된 가치 적응 컨텐츠의 창작 또는 생성에 이용 가능한 지정된 기준 품질 이상인 컨텐츠의 개수가 지정된 기준 개수 이상인지 판단하여, 상기 컨텐츠의 품질 상태가 지정된 기준 품 질 이상인 컨텐츠의 개수가 지정된 기준값 이상인 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐 츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가 치형 실화 정보에 제각기 포함된 정보 중 지정된 카메라와 마이크 중 적어도 하나를 이용하여 상기 가치형 실화 와 관련되어 생성된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 확인하고, 상기 확인된 컨텐츠의 종류가 지정된 가치 적응 컨텐츠의 창작 또는 생성에 이용 가능한 컨텐츠 종류인지 판단하여, 상기 컨텐츠의 종류가 지정된 컨텐츠 종류인 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구 성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가 치형 실화 정보에 제각기 포함된 정보 중 지정된 카메라와 마이크 중 적어도 하나를 이용하여 상기 가치형 실화와 관련되어 생성된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 확인하고, 상기 확인된 컨텐츠의 종류가 지정된 가치 적응 컨텐츠의 창작 또는 생성에 이용 가능한 컨텐츠 종류에 대응하는 컨 텐츠의 개수가 지정된 기준 개수 이상인지 판단하여, 상기 컨텐츠의 종류기 자정된 컨텐츠 종류인 컨텐츠의 개 수가 지정된 기준값 이상인 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가 치형 실화 정보의 관측된 특징에 대응하는 실화 특징 정보를 추출하고, 허구로 짜여진 인기있거나 감동적인 이 야기와 과거의 감동 실화와 관련된 이야기 중 적어도 하나의 이야기의 관측된 특징을 지정된 규모 이상 학습한 인공지능모듈(예컨대, 챗GPT 또는 이야기를 학습한 별도의 AI 등)에 상기 추출된 실화 특징 정보를 적용하여 상 기 j개의 가치형 실화 정보에 대응하는 가치형 실화가 사용자의 가치 참여 욕구를 형성 가능한 이야기 구조를 포함하는지 확인하여, 상기 가치형 실화가 가치 참여 욕구를 형성 가능한 이야기 구조를 포함하는 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 여기서, 상기 허구로 짜여진 인기있거나 감동적인 이야기는, 소설이나 영화 대본 중 적어도 하나를 포함할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 허구로 짜여진 인기있거나 감동적인 이야기 와 과거의 감동 실화와 관련된 이야기 중 적어도 하나의 이야기의 관측된 특징을 포함하는 학습데이터를 이용하 여 인공지능모듈을 학습시킬 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가 치형 실화 정보에 포함된 실화 영웅의 연락처 정보 또는 상기 실화 영웅의 가족/유가족의 연락처 정보를 이용하 여 상기 가치형 실화의 실화 영웅 측과 연락하여 지정된 가치 적응 컨텐츠의 창작 또는 생성에 대한 실화 영웅 측의 동의 상태를 입증 가능한 실화 영웅 측 동의 정보를 확인하고, 상기 실화 영웅 측 동의 정보를 확인한 경 우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으 로 판단할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 가치형 실화에 대해 등록된 j개의 가 치형 실화 정보에 포함된 실화 영웅의 연락처 정보 또는 상기 실화 영웅의 가족/유가족의 연락처 정보를 이용하 여 상기 가치형 실화의 실화 영웅 측과 연락하여 상기 가치형 실화의 지정된 실화 가치 대상에 대한 가치 참여 진행의 실화 영웅 측의 동의 상태를 입증 가능한 실화 영웅 측 동의 정보를 확인하고, 상기 실화 영웅 측 동의 정보를 확인한 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건 을 만족하는 것으로 판단할 수 있다. 여기서, 상기 실화 영웅 측은, 실화 영웅 본인, 실화 영웅의 가족/유가족을 포함하며, 상기 실화 영웅이 동물인 경우, 동물의 반려인을 포함할 수 있다. 또한, 상기 k개의 가치형 실화 정보는, 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보 중 가치 적 응 컨텐츠 창작 또는 생성에 이용된 가치형 실화 정보를 포함할 수 있다. 또한, 상기 실화 가치 대상은, 상기 가치형 실화의 실화 영웅, 상기 가치형 실화의 실화 영웅의 가족/유가족 중 적어도 하나를 포함할 수 있다. 또한, 상기 실화 가치 대상은, 상기 가치형 실화의 실화 영웅이 동물인 경우, 상기 동물의 반려인을 포함할 수 있다. 본 발명의 실시 방법에 따르면, 상기 가치 적응 컨텐츠는, 상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여 욕구를 자극 가능한 내용을 포함하여 제작된 동영상 컨 텐츠, 상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여 욕구를 자극 가능한 내용을 포함하여 제작되어 지정된 영상플랫폼을 통해 송출하도록 설정된 동영상 컨텐 츠, 상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참 여 욕구를 자극 가능한 내용을 포함하여 지정된 영상플랫폼을 통해 실시간 생성 내지 송출되는 라이브 컨텐츠 중 적어도 하나의 컨텐츠를 포함할 수 있다. 여기서, 상기 영상 플랫폼은, 기 구축된 범용의 영상플랫폼, 상기 운영서버와 연계된 영상플랫폼 중 적어도 하 나의 영상플랫폼을 포함할 수 있다. 본 발명의 실시 방법에 따르면, 상기 가치 적응 컨텐츠는, 상기 가치형 실화의 지정된 실화 가치 대상과 관련된 내용과 상기 실화 가치 대상에 대한 사용자의 가치 참여 욕구를 자극 가능한 내용을 포함하는 이미지 컨텐츠와 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 포함할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 상기 k개의 가치형 실화 정보에 적용 가능한 c개의 가치 참여 분류 항목 중 지정된 컨텐츠생성모듈을 통해 생성할 가치 적응 컨텐츠에 적용될 제c' 가치 참 여 분류 항목을 설정하고, 상기 k개의 가치형 실화 정보에 대응하는 각기 지정된 정보 항목 별 정보와 상기 설 정된 제c' 가치 참여 분류 항목 정보를 지정된 컨텐츠생성모듈에 적용하여 상기 가치형 실화의 지정된 실화 가 치 대상에 적용 가능한 가치 참여 분류 항목 중 상기 제c' 가치 참여 분류 항목에 매칭되게 적응된 가치 적응 컨텐츠를 생성할 수 있다. 여기서, 상기 컨텐츠생성모듈은, 상기 가치형 실화 정보에 포함된 동영상 컨텐츠나 이미지 컨텐츠 중 적어도 하 나의 컨텐츠를 전체 비디오 영역 또는 지정된 일부 비디오 영역에 포함하거나 상기 가치형 실화 정보에 포함된 지정된 항목 별 정보를 자막화하거나 이미지화한 컨텐츠를 지정된 일부 비디오 영역에 포함하는 비디오 데이터 를 생성하고, 지정된 음원 컨텐츠와 상기 가치형 실화 정보에 포함된 지정된 항목 별 정보를 음성 멘트화한 음 성 멘트 컨텐츠와 상기 가치형 실화 정보에 포함된 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 오디오 데이터로 생성하여 조합한 동영상 형태의 가치 적응 컨텐츠를 생성하는 프로그램모듈을 포함할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 상기 k개의 가치형 실화 정보에 적용 가능한 c개의 가치 참여 분류 항목 중 지정된 컨텐츠 생성용 인공지능모듈을 통해 생성할 가치 적응 컨텐츠에 적용될 제c' 가치 참여 분류 항목을 설정하고, 상기 k개의 가치형 실화 정보에 대응하는 각기 지정된 정보 항목 별 정 보와 상기 설정된 제c' 가치 참여 분류 항목 정보를 지정된 컨텐츠 생성용 인공지능모듈에 적용하여 상기 가치 형 실화의 지정된 실화 가치 대상에 적용 가능한 가치 참여 분류 항목 중 상기 제c' 가치 참여 분류 항목에 매 칭되게 적응된 가치 적응 컨텐츠를 생성할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 지정된 창작자가 이용하는 창작자 단말(14 0)로 상기 k개의 가치형 실화 정보를 제공하고, 상기 창작자 단말로부터 상기 k개의 가치형 실화 정보를 근거로 상기 창작자에 의해 창작된 가치 적응 컨텐츠를 수신하거나, 또는 상기 창작자에 의해 창작되어 지정된 영상플랫폼을 통해 송출 예정이거나 송출되는 가치 적응 컨텐츠에 대응하는 컨텐츠 정보를 수신하고, 상기 k개 의 가치형 실화 정보에 적용 가능하게 설정된 c(1≤c≤C)개의 가치 참여 분류 항목 중 상기 창작자 단말을 통해 설정된 제c' 가치 참여 분류 항목을 확인할 수 있다. 여기서, 상기 컨텐츠 확인부는, 상기 창작자 단말로 상기 k개의 가치형 실화 정보를 제공 시, 상기 k 개의 가치형 실화 정보에 적용 가능하게 설정된 c개의 가치 참여 분류 항목을 확인하고, 상기 c개의 가치 참여분류 항목에 대응하는 c개의 가치 참여 분류 정보를 상기 창작자 단말로 제공할 수 있다. 여기서, 상기 컨텐츠 정보는, 지정된 영상플랫폼을 통해 송출 예정이거나 송출되는 가치 적응 컨텐츠의 링크 정 보를 포함할 수 있다. 여기서, 상기 창작자는, 지정된 영상플랫폼이나 SNS에서 활동하면서 가치 적응 컨텐츠를 창작 가능한 인플루언 서를 포함할 수 있다. 한편, 본 발명의 실시 방법에 따르면, 상기 컨텐츠 확인부는, 가치 적응 컨텐츠를 생성 가능한 운영자가 이용하는 운영자 단말로 상기 k개의 가치형 실화 정보를 제공하고, 상기 운영자 단말로부터 상기 k개 의 가치형 실화 정보를 근거로 생성된 가치 적응 컨텐츠를 수신하거나, 또는 상기 운영자에 의해 생성되어 지정 된 영상플랫폼을 통해 송출 예정이거나 송출되는 가치 적응 컨텐츠에 대응하는 컨텐츠 정보를 수신하고, 상기 k 개의 가치형 실화 정보에 적용 가능하게 설정된 c(1≤c≤C)개의 가치 참여 분류 항목 중 상기 운영자 단말을 통 해 설정된 제c' 가치 참여 분류 항목을 확인할 수 있다. 여기서, 상기 컨텐츠 확인부는, 상기 운영자 단말로 상기 k개의 가치형 실화 정보를 제공 시, 상기 k 개의 가치형 실화 정보에 적용 가능하게 설정된 c(1≤c≤C)개의 가치 참여 분류 항목을 확인하고, 상기 c개의 가치 참여 분류 항목에 대응하는 c개의 가치 참여 분류 정보를 상기 운영자 단말로 제공할 수 있다. 상기 분류항목 설정부는, 상기 컨텐츠 확인부를 통해 상기 가치 적응 컨텐츠가 확인된 이후, 상기 가 치형 실화의 실화 가치 대상과 상기 확인된 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식별코드와 상기 가치 적응 컨텐츠를 지정된 저장매체에 연계 설정하고, 가치형 실화의 가치 참여 관리를 위해 설정된 C(C≥1)개의 가치 참여 분류 항목 중 상기 k개의 가치형 실화 정보에 적용 가능한 c(1 ≤c≤C)개의 가치 참여 분류 항목을 기반으로 상기 확인된 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 제c'(1≤c'≤c) 가치 참여 분류 항목을 설정한다. 여기서, 상기 가치 참여 분류 항목은, 가치형 실화의 실화 영웅에 대한 자금 지원을 위한 가치 참여 , 가치형 실화의 실화 영웅에 대한 보상 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 치료 비용 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 법률 비용 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대 한 보험 가입 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 가족/유가족 대상 자금 지원을 위한 가 치 참여, 가치형 실화의 실화 영웅에 대한 가족/유가족 대상 보상 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 가족/유가족 대상 법률 비용 지원을 위한 가치 참여, 가치형 실화의 실화 영웅에 대한 가족/유가족 대상 보험 가입 지원을 위한 가치 참여 중 적어도 하나의 가치 참여 분류 항목을 포함할 수 있다. 또한, 상기 C개의 가치 참여 분류 항목은, 상기 가치형 실화의 실화 영웅이 동물인 경우, 상기 동물의 치료 비 용 지원을 위한 가치 참여, 상기 동물의 보험 가입 지원을 위한 가치 참여, 상기 동물의 반려인 대상 자금 지원 을 위한 가치 참여, 상기 동물의 반려인 대상 보상 지원을 위한 가치 참여, 상기 동물의 반려인 대상 법률 지원 을 위한 가치 참여, 상기 동물의 반려인 대상 보험 가입 지원을 위한 가치 참여 중 적어도 하나의 가치 참여 분 류 항목을 포함할 수 있다. 본 발명의 실시 방법에 따르면, 상기 가치 적응 컨텐츠는, 어느 한 가치형 실화의 어느 한 실화 가치 대상에 일 대일 적응되어 창작 또는 생성된 컨텐츠, 어느 한 가치형 실화의 둘 이상 실화 가치 대상에 다대일 적응되어 창 작 또는 생성된 컨텐츠, 둘 이상 가치형 실화 별 실화 가치 대상에 다대일 적응되어 창작 또는 생성된 컨텐츠 중 적어도 하나의 컨텐츠를 포함할 수 있다. 예컨대, 상기 가치 적응 컨텐츠는 어느 한 실화 가치 대상에 일대 일 적응되고 하지만, 둘 이상 실화 가치 대상에 다대일 관계로 적응될 수 있으며, 이에 실화 가치 대상과 가치 적응 컨텐츠의 조합에 가치 참여 식별코드를 할당할 수 있다. 여기서, 상기 가치 참여 식별코드는, 사용자 단말을 통해 상기 가치 적응 컨텐츠를 출력하는 중 또는 후에 상기 가치 적응 컨텐츠에 대응하는 지정된 가치형 실화의 지정된 실화 가치 대상에 대한 사용자의 가치 참여를 고유 식별하기 위해 중복되지 않게 고유 생성 또는 결정된 식별코드를 포함할 수 있다.본 발명의 실시 방법에 따르면, 상기 분류항목 설정부는, 상기 가치 참여 식별코드와 상기 가치 적응 컨텐 츠에 대응하는 컨텐츠 파일을 지정된 저장매체에 연계 저장할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 분류항목 설정부는, 상기 가치 참여 식별코드와 지정된 영상플 랫폼을 통해 송출되는 가치 적응 컨텐츠의 링크 정보를 포함하는 컨텐츠 정보를 지정된 저장매체에 연계 저장할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 분류항목 설정부는, 상기 가치 적응 컨텐츠에 대응하는 가치형 실화를 고유 식별하거나 상기 가치형 실화의 실화 영웅을 고유 식별하는 가치 대상 식별코드와 상기 가치 참여 식별코드를 지정된 저장매체에 연계 저장할 수 있다. 상기 가치 참여부는, 상기 분류항목 설정부를 통해 상기 가치 참여 식별코드와 상기 가치 적응 컨텐 츠가 연계 설정되고, 가치형 실화 정보에 적용 가능한 가치 참여 분류 항목을 기반으로 상기 확인된 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 가치 참여 분류 항목을 설정된 후, 상기 가치형 실화의 실화 가 치 대상에 적응하여 창작 또는 생성된 N(N≥1)개의 가치 적응 컨텐츠 중 지정된 사용자 단말을 통해 제n(1 ≤n≤N) 가치 적응 컨텐츠를 확인한 제m(m≥1) 사용자가 상기 제n 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청한 경우, 상기 제m 사용자의 가치 참여 요청을 상기 설정된 제c' 가치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수행한다. 여기서, 상기 가치 참여는, 지정된 가치형 실화의 지정된 실화 가치 대상에 대한 기부 형태의 가치 참여, 커머 스를 위해 결제하는 결제금액 중 지정된 금액이 지정된 가치형 실화의 지정된 실화 가치 대상에 대한 가치 참여 에 이용되는 커머스 형태의 가치 참여 중 적어도 하나의 가치 참여를 포함할 수 있다. 여기서, 상기 지정된 금액은, 상기 결제금액의 지정된 비율에 대응하는 일부 금액, 상기 결제금액 중 커머스의 수익금에 대응하는 금액의 지정된 비율에 대응하는 일부 금액 중 적어도 하나의 금액을 포함할 수 있다. 또한, 상기 지정된 금액은, 상기 커머스의 상품이나 서비스가 상기 가치형 실화의 지정된 실화 가치 대상에 대 한 가치 참여를 위해 현물 형태로 기부된 상품이나 서비스인 경우, 상기 커머스의 결제금액을 포함할 수 있다. 본 발명의 실시 방법에 따르면, 상기 가치 참여부는, 상기 가치형 실화의 실화 가치 대상에 적응하여 창작 또는 생성된 N개의 가치 적응 컨텐츠 중 지정된 제n 가치 적응 컨텐츠를 지정된 제m 사용자가 이용하는 사용자 단말을 통해 출력하도록 처리하고, 상기 사용자 단말을 통해 상기 제n 가치 적응 컨텐츠를 출력하는 중 또는 후에 상기 사용자 단말로부터 상기 출력된 제n 가치 적응 컨텐츠를 시각기관이나 청각기관 중 적 어도 하나를 통해 인식한 제m 사용자가 상기 제n 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가치 참여를 요청하는 가치 참여 요청 정보를 수신할 수 있다. 여기서, 상기 가치 참여부는, 상기 제m 사용자의 사용자 단말을 통해 상기 제n 가치 적응 컨텐츠를 출력 시, 상기 사용자 단말을 통해 상기 제m 사용자가 상기 제n 가치 적응 컨텐츠에 설정된 제c' 가치 참 여 분류 항목을 확인 가능한 가치 참여 분류 확인정보를 출력하도록 처리할 수 있다. 또한, 상기 가치 참여 요청 정보는, 상기 제n 가치 적응 컨텐츠와 상기 제m 사용자가 가치 참여를 요청한 실화 가치 대상의 조합을 식별 가능한 가치 참여 식별코드, 상기 제m 사용자를 식별 가능한 사용자 식별정보, 상기 실화 가치 대상에 대한 상기 제m 사용자의 가치 참여에 대응하는 가치 참여 금액 또는 가치 참여 가치를 확인하 거나 산출 가능한 가치 참여 정보 중 적어도 하나의 정보를 포함할 수 있다. 또한, 상기 가치 참여 금액은, 지정된 명목화폐 단위의 금액을 포함할 수 있다. 또한, 상기 가치 참여 가치는, 지정된 포인트, 전자화폐, 가상화폐, 암호화폐 중 지정된 명목화폐 단위의 금액 으로 전환 가능한 적어도 하나의 금전형 가치를 포함할 수 있다. 또한, 상기 가치 참여 금액 또는 가치 참여 가치는, 상기 가치 참여가 기부 형태의 가치 참여인 경우, 상기 기 부 형태의 가치 참여를 위해 사용자가 지출하는 금액 또는 금전형 가치를 포함할 수 있다. 또한, 상기 가치 참여 금액은, 상기 가치 참여가 지정된 커머스 형태의 가치 참여인 경우, 상기 커머스의 결제 금액 중 가치 참여에 대응하는 지정된 금액을 포함할 수 있다. 본 발명의 실시 방법에 따르면, 상기 가치 참여 절차는, 상기 가치 참여가 기부 형태의 가치 참여인 경우, 상기 제m 사용자의 지정된 사용자 계좌에서 지정된 가치 참여 금액을 인출하여 상기 가치 참여를 관리하는 지정된 관 리 계좌로 입금하는 절차를 포함할 수 있다. 여기서, 상기 사용자 계좌는, 금융사에 개설된 사용자 명의의 금융계좌, 금융사에 개설된 지정된 실계좌를 모계 좌로 하여 개설된 사용자 명의의 가상계좌 중 적어도 하나의 계좌를 포함할 수 있다. 또한, 상기 실계좌는, 상기 사용자의 가치 참여를 위해 예치된 예치금을 관리하는 금융계좌를 포함할 수 있다. 또한, 상기 관리 계좌는, 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리하기 위해 금융사에 개설 된 금융계좌, 금융사에 개설된 지정된 실계좌를 모계좌로 하여 상기 제c' 가치 참여 분류 항목을 포함하는 사용 자의 가치 참여를 관리하기 위해 개설된 사용자 명의의 가상계좌, 상기 가치 참여를 관리하기 위해 체결된 신탁 계약에 따라 금융사에 개설된 신탁계좌와 연결되어 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관 리하는 금융계좌, 상기 가치 참여를 관리하기 위해 체결된 신탁계약에 따라 금융사에 개설된 신탁계좌와 연결되 도록 지정된 실계좌를 모계좌로 하여 개설되어 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리하 는 가상계좌 중 적어도 하나의 계좌를 포함할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 가치 참여 절차는, 상기 가치 참여가 기부 형태의 가치 참여인 경우, 상기 제m 사용자의 지정된 금전형 가치를 관리하는 지정된 가치플랫폼의 사용자 계정에서 상기 제m 사용 자의 가치 참여를 위한 가치 참여 가치에 대응하는 금전형 가치를 인출하여 상기 가치 참여를 관리하는 지정된 관리 계정으로 이전하는 절차를 포함할 수 있다. 여기서, 상기 가치 참여 절차는, 상기 관리 계정으로 이전된 가치 참여 가치에 대응하는 금전형 가치를 지정된 명목화폐 단위의 가치 참여 금액으로 전환한 후 상기 가치 참여를 관리하는 지정된 관리 계좌로 입금하는 절차 를 더 포함할 수 있다. 여기서, 상기 관리 계좌는, 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리하기 위해 금융사에 개 설된 금융계좌, 금융사에 개설된 지정된 실계좌를 모계좌로 하여 상기 제c' 가치 참여 분류 항목을 포함하는 사 용자의 가치 참여를 관리하기 위해 개설된 사용자 명의의 가상계좌, 상기 가치 참여를 관리하기 위해 체결된 신 탁계약에 따라 금융사에 개설된 신탁계좌와 연결되어 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리하는 금융계좌, 상기 가치 참여를 관리하기 위해 체결된 신탁계약에 따라 금융사에 개설된 신탁계좌와 연결 되도록 지정된 실계좌를 모계좌로 하여 개설되어 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리 하는 가상계좌 중 적어도 하나의 계좌를 포함할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 가치 참여 절차는, 상기 가치 참여가 기부 형태의 가치 참여인 경우, 상기 제m 사용자의 지정된 금전형 가치를 관리하는 지정된 가치플랫폼의 사용자 계정에서 상기 제m 사용 자의 가치 참여를 위한 가치 참여 가치에 대응하는 금전형 가치를 인출하여 지정된 명목화폐 단위의 가치 참여 금액으로 전환한 후 상기 가치 참여를 관리하는 지정된 관리 계좌로 입금하는 절차를 포함할 수 있다. 여기서, 상기 관리 계좌는, 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리하기 위해 금융사에 개 설된 금융계좌, 금융사에 개설된 지정된 실계좌를 모계좌로 하여 상기 제c' 가치 참여 분류 항목을 포함하는 사 용자의 가치 참여를 관리하기 위해 개설된 사용자 명의의 가상계좌, 상기 가치 참여를 관리하기 위해 체결된 신탁계약에 따라 금융사에 개설된 신탁계좌와 연결되어 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리하는 금융계좌, 상기 가치 참여를 관리하기 위해 체결된 신탁계약에 따라 금융사에 개설된 신탁계좌와 연결 되도록 지정된 실계좌를 모계좌로 하여 개설되어 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리 하는 가상계좌 중 적어도 하나의 계좌를 포함할 수 있다. 또한, 본 발명의 실시 방법에 따르면, 상기 가치 참여 절차는, 상기 가치 참여가 커머스 형태의 가치 참여인 경 우, 상기 커머스의 결제금액을 결제 처리하는 절차와, 상기 커머스의 결제 처리된 결제금액 중 가치 참여를 위 해 지정된 금액을 확인하여 상기 가치 참여를 관리하는 지정된 관리 계정으로 이전하는 절차를 포함할 수 있다. 여기서, 상기 관리 계좌는, 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리하기 위해 금융사에 개 설된 금융계좌, 금융사에 개설된 지정된 실계좌를 모계좌로 하여 상기 제c' 가치 참여 분류 항목을 포함하는 사 용자의 가치 참여를 관리하기 위해 개설된 사용자 명의의 가상계좌, 상기 가치 참여를 관리하기 위해 체결된 신 탁계약에 따라 금융사에 개설된 신탁계좌와 연결되어 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리하는 금융계좌, 상기 가치 참여를 관리하기 위해 체결된 신탁계약에 따라 금융사에 개설된 신탁계좌와 연결 되도록 지정된 실계좌를 모계좌로 하여 개설되어 상기 제c' 가치 참여 분류 항목을 포함하는 가치 참여를 관리 하는 가상계좌 중 적어도 하나의 계좌를 포함할 수 있다. 상기 참여결과 저장부는, 상기 가치 참여부를 통해 상기 제m 사용자의 가치 참여를 위한 가치 참여 절차가 수행된 이후, 상기 가치 참여 절차의 결과에 대응하는 제m 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 저장매체에 연계 저장한다. 본 발명의 실시 방법에 따르면, 상기 참여결과 저장부는, 상기 제m 사용자를 식별하는 사용자 식별정보와 상기 제m 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 저장매체에 연계 저장할 수 있다. 본 발명의 실시 방법에 따르면, 상기 참여결과 저장부는, 상기 제m 사용자의 가치 참여 정보와 상기 제m 사용자의 가치 참여에 적용된 제c' 가치 참여 분류 항목과 연계 설정하는 단계를 더 포함할 수 있다. 여기서, 상기 제m 사용자의 가치 참여 정보는, 상기 가치형 실화의 실화 가치 대상에 대한 상기 제m 사용자의 가치 참여에 대응하는 가치 참여 금액 또는 가치 참여 가치를 확인하거나 산출 가능한 정보를 포함할 수 있다. 또한, 상기 제m 사용자의 가치 참여 정보는, 상기 제m 사용자의 가치 참여에 대응하는 가치 참여 금액 또는 가 치 참여 가치 중 지정된 수수료를 확인하거나 산출 가능한 정보를 더 포함할 수 있다. 여기서, 상기 수수료는, 지정된 운영 수수료를 포함하거나, 또는 상기 제n 가치 적응 컨텐츠가 지정된 창작 수 수료를 설정한 창작자에 의해 창작된 경우, 상기 창작자의 창작 수수료를 더 포함하거나 또는 상기 제n 가치 적 응 컨텐츠가 지정된 제보 수수료를 설정한 제보자가 등록한 가치형 실화 정보에 포함된 정보를 이용하여 창작 또는 생성된 경우, 상기 제보자의 제보 수수료를 더 포함할 수 있다. 또한, 상기 제보자가 등록한 가치형 실화 정보에 포함된 정보는, 상기 제보자가 등록한 가치형 실화 정보에 포 함된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠, 가치형 실화 정보의 정보 항목 별 정보 중 상기 제보자가 등록한 가치형 실화 정보에 최초 또는 활용 가능한 정도로 상세하게 포함된 정보 중 적어도 하나의 정보를 포함할 수 있다. 도면2는 본 발명의 실시 방법에 따른 가치형 실화와 관련된 가치형 실화 정보를 지정된 등록 단말을 통해 등록 받아 저장하는 과정을 도시한 도면이다.보다 상세하게 본 도면2는 운영서버에서 실시간 내지 최근 일정 기간 내 현실세계에서 발생한 실화(Real Story) 중 사용자의 가치 참여 욕구를 형성 가능한 가치형 실화와 관련된 가치형 실화 정보를 지정된 등록 단말"}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "을 통해 적어도 i(i≥1)회 등록받아 운영DB에 저장하는 과정을 도시한 것으로서, 본 발명이 속한 기술분야 에서 통상의 지식을 가진 자라면, 본 도면2를 참조 및/또는 변형하여 상기 과정에 대한 다양한 실시 방법(예컨 대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되 는 모든 실시 방법을 포함하여 이루어지며, 본 도면2에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아 니한다. 도면2를 참조하면, 운영서버는 가치형 실화의 가치 참여 관리를 위해 설정된 C(C≥1)개의 가치 참여 분류 항목에 대응하는 C개의 가치 참여 분류 정보를 저장한다. 여기서, 상기 C개의 가치 참여 분류 정보는, C개의 가치 참여 분류 항목 별 가치 참여 분류를 식별하는 가치 참 여 분류 식별정보, C개의 가치 참여 분류 항목 별 가치 참여 분류의 명칭에 대응하는 가치 참여 분류 명칭정보, C개의 가치 참여 분류 항목 별 가치 참여 분류를 설명하는 가치 참여 분류 설명정보 중 적어도 하나의 정보를 포함할 수 있다. 이후, 상기 운영서버는 실시간 내지 최근 일정 기간 내 현실세계에서 발생한 실화(Real Story) 중 사용자 의 가치 참여 욕구를 형성 가능한 가치형 실화와 관련된 가치형 실화 정보를 지정된 등록 단말을 통해 수 신한다. 상기 가치형 실화 정보가 등록 단말을 통해 수신되면, 상기 운영서버는 상기 수신된 가치형 실화 정 보를 판독하여 기 등록된 가치형 실화와 다른 신규 가치형 실화에 대응하는 신규 가치형 실화 정보인지 판별한 다. 여기서, 상기 운영서버는 상기 수신된 가치형 실화 정보에 포함된 지정된 정보 항목 별 t'(t'≥1)개의 정 보와 상기 운영DB에 기 등록된 가치형 실화 정보에 포함된 동일한 정보 항목 별 t'개의 정보를 비교 판독하여 상기 수신된 가치형 실화 정보가 신규 가치형 실화에 대응하는 신규 가치형 실화 정보인지 판별할 수 있다. 지정된 등록 단말을 통해 신규 가치형 실화에 대응하는 신규 가치형 실화 정보를 수신한 경우, 상기 운영 서버는 상기 신규 가치형 실화를 고유 식별하거나 상기 신규 가치형 실화의 실화 영웅을 고유 식별하기 위 해 중복되지 않는 고유의 가치 대상 식별코드를 생성하거나 결정한다. 그리고, 상기 운영서버는 상기 생성 또는 결정된 고유의 가치 대상 식별코드를 상기 수신된 가치형 실화 정보와 연계하여 운영DB에 등록 저장한다. 이후, 상기 운영DB에 복수의 가치형 실화 정보가 등록된 경우, 상기 운영서버는 상기 등록된 복수의 가치 형 실화 정보를 비교 판독하여 동일한 가치형 실화에 대응하는 i'(1≤i'≤i)개의 가치형 실화 정보를 판별한다 . 여기서, 상기 운영서버는 상기 등록된 복수의 가치형 실화 정보에 포함된 지정된 정보 항목 별 t'(t'≥1) 개의 정보를 비교 판독하여 동일한 가치형 실화에 대응하는 i'개의 가치형 실화 정보를 판별할 수 있다. 그리고, 상기 운영서버는 상기 판별된 i'개의 가치형 실화 정보에 포함된 적어도 하나의 정보를 각기 지정 된 정보 항목 별로 분류 처리한다. 여기서, 상기 운영서버는 상기 가치형 실화 정보에 포함된 동영상 컨텐츠, 이미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 지정된 분류 기준에 따라 분류 처리하거나, 또는 상기 가치형 실화 정보에 포함된 실화 설명 정보를 지정된 분류 기준에 따라 분류 처리할 수 있다. 그리고, 상기 운영서버는 가치형 실화의 가치 참여 관리를 위해 설정된 C개의 가치 참여 분류 항목 중 상 기 등록되는 가치형 실화 정보에 적용 가능한 적어도 하나의 가치 참여 분류 항목을 확인하여 상기 가치형 실화 정보에 연계 설정한다. 여기서, 상기 운영서버는 기 설정된 C개의 가치 참여 분류 항목 별 가치 참여 분류 판별정보를 기반으로 상기 등록되는 가치형 실화 정보에 포함된 지정된 정보 항목 별 정보를 판독하여 상기 등록되는 가치형 실화 정 보에 적용 가능한 적어도 하나의 가치 참여 분류 항목을 확인할 수 있다. 도면3은 본 발명의 실시 방법에 따른 가치형 실화의 지정된 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하고, 가치 참여 분류 항목을 기반으로 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 가치 참여 분류 항목을 설정하는 과정을 도시한 도면이다. 보다 상세하게 본 도면3은 상기 도면2의 과정 이후, 운영서버에서 지정된 가치형 실화에 대해 등록된 j(j ≥1, j⊂i)개의 가치형 실화 정보가 지정된 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건을 만 족 시, 지정된 k(1≤k≤j)개의 가치형 실화 정보를 기반으로 상기 가치형 실화의 지정된 실화 가치 대상에 적응 하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하고, 상기 가치형 실화의 실화 가치 대상과 상기 확인된 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식별코드와 상기 가치 적응 컨 텐츠를 지정된 저장매체에 연계 설정하고, 가치형 실화의 가치 참여 관리를 위해 설정된 C(C≥1)개의 가치 참여 분류 항목 중 상기 k개의 가치형 실화 정보에 적용 가능한 c(1≤c≤C)개의 가치 참여 분류 항목을 기반으로 상 기 확인된 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 제c'(1≤c'≤c) 가치 참여 분류 항목을 설"}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "정하는 과정을 도시한 것으로서, 본 발명이 속한 기술분야에서 통상의 지식을 가진 자라면, 본 도면3을 참조 및 /또는 변형하여 상기 과정에 대한 다양한 실시 방법(예컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면3에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 도면3을 참조하면, 상기 도면2의 과정 이후, 운영서버는 지정된 가치형 실화에 대해 등록된 j(j≥1, j⊂ i)개의 가치형 실화 정보가 지정된 k(1≤k≤j)개의 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조 건을 만족하는지 확인한다. 여기서, 상기 운영서버는 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보를 판독하여 유효한 실화 영웅 정보를 포함하는지 확인하고, 상기 가치형 실화 정보에 유효한 실화 영웅 정보를 포함하는 경우, 상 기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판 단할 수 있다. 또한, 상기 운영서버는 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 제각기 포함된 정보 중 지정된 카메라와 마이크 중 적어도 하나를 이용하여 상기 가치형 실화와 관련되어 생성된 동영상 컨텐츠, 이 미지 컨텐츠, 사운드 컨텐츠 중 적어도 하나의 컨텐츠를 확인하고, 상기 확인된 컨텐츠의 품질 상태를 판독하여 지정된 가치 적응 컨텐츠의 창작 또는 생성에 이용 가능한 지정된 기준 품질 이상인지 판단하여, 상기 컨텐츠의 품질 상태가 지정된 기준 품질 이상인 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 또한, 상기 운영서버는 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보의 관측된 특징에 대응 하는 실화 특징 정보를 추출하고, 허구로 짜여진 인기있거나 감동적인 이야기와 과거의 감동 실화와 관련된 이 야기 중 적어도 하나의 이야기의 관측된 특징을 지정된 규모 이상 학습한 인공지능모듈에 상기 추출된 실화 특 징 정보를 적용하여 상기 j개의 가치형 실화 정보에 대응하는 가치형 실화가 사용자의 가치 참여 욕구를 형성가능한 이야기 구조를 포함하는지 확인하여, 상기 가치형 실화가 가치 참여 욕구를 형성 가능한 이야기 구조를 포함하는 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만 족하는 것으로 판단할 수 있다. 또한, 상기 운영서버는 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 포함된 실화 영웅의 연락처 정보 또는 상기 실화 영웅의 가족/유가족의 연락처 정보를 이용하여 상기 가치형 실화의 실화 영웅 측과 연락하여 지정된 가치 적응 컨텐츠의 창작 또는 생성에 대한 실화 영웅 측의 동의 상태를 입증 가능한 실화 영 웅 측 동의 정보를 확인하고, 상기 실화 영웅 측 동의 정보를 확인한 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 또한, 상기 운영서버는 지정된 가치형 실화에 대해 등록된 j개의 가치형 실화 정보에 포함된 실화 영웅의 연락처 정보 또는 상기 실화 영웅의 가족/유가족의 연락처 정보를 이용하여 상기 가치형 실화의 실화 영웅 측과 연락하여 상기 가치형 실화의 지정된 실화 가치 대상에 대한 가치 참여 진행의 실화 영웅 측의 동의 상태를 입 증 가능한 실화 영웅 측 동의 정보를 확인하고, 상기 실화 영웅 측 동의 정보를 확인한 경우, 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단할 수 있다. 상기 가치 적응 컨텐츠를 창작 또는 생성 가능한 컨텐츠 구성 조건 중 적어도 하나의 조건을 만족하는 것으로 판단되면, 상기 운영서버는 상기 k개의 가치형 실화 정보에 적용 가능한 c개의 가치 참여 분류 항목 중 지 정된 컨텐츠 생성용 인공지능모듈을 통해 생성할 가치 적응 컨텐츠에 적용될 제c' 가치 참여 분류 항목을 설정 한다. 상기 제c' 가치 참여 분류 항목이 설정되면, 상기 운영서버는 상기 k개의 가치형 실화 정보에 대응하는 각 기 지정된 정보 항목 별 정보와 상기 설정된 제c' 가치 참여 분류 항목 정보를 지정된 컨텐츠 생성용 인공지능 모듈에 적용한다. 그리고, 상기 운영서버는 상기 가치형 실화의 지정된 실화 가치 대상에 적용 가능한 가치 참여 분류 항목 중 상기 제c' 가치 참여 분류 항목에 매칭되게 적응된 가치 적응 컨텐츠를 생성한다. 이후, 상기 운영서버는 상기 창작 또는 생성된 가치 적응 컨텐츠를 확인하고, 상기 가치형 실화의 실화 가 치 대상과 상기 확인된 가치 적응 컨텐츠의 조합에 대한 사용자들의 가치 참여를 고유 식별 가능한 가치 참여 식별코드와 상기 가치 적응 컨텐츠를 지정된 저장매체에 연계 설정한다 여기서, 상기 가치 참여 식별코드는 사용자 단말을 통해 상기 가치 적응 컨텐츠를 출력하는 중 또는 후에 상기 가치 적응 컨텐츠에 대응하는 지정된 가치형 실화의 지정된 실화 가치 대상에 대한 사용자의 가치 참여를 고유 식별하기 위해 중복되지 않게 고유 생성 또는 결정된 식별코드를 포함할 수 있다. 그리고, 상기 운영서버는 가치형 실화의 가치 참여 관리를 위해 설정된 C(C≥1)개의 가치 참여 분류 항목 중 상기 k개의 가치형 실화 정보에 적용 가능한 c(1≤c≤C)개의 가치 참여 분류 항목을 기반으로 상기 확인된 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 제c'(1≤c'≤c) 가치 참여 분류 항목을 설정한다 . 도면4는 본 발명의 실시 방법에 따른 사용자의 가치 참여를 위한 가치 참여 절차를 수행하는 과정을 도시한 도 면이다. 보다 상세하게 본 도면4는 상기 도면3의 과정 이후, 운영서버에서 상기 가치형 실화의 실화 가치 대상에 적응하여 창작 또는 생성된 N(N≥1)개의 가치 적응 컨텐츠 중 지정된 사용자 단말을 통해 제n(1≤n≤N) 가 치 적응 컨텐츠를 확인한 제m(m≥1) 사용자가 상기 제n 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치대상에 대한 가치 참여를 요청한 경우, 상기 제m 사용자의 가치 참여 요청을 상기 설정된 제c' 가치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수행하고, 상기 가치 참여 절차의 결과에 대응하는 제m 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 저장매체에 연계 저장하는 과정을 도시한 것으로서, 본 발"}
{"patent_id": "10-2023-0134585", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "명이 속한 기술분야에서 통상의 지식을 가진 자라면, 본 도면4를 참조 및/또는 변형하여 상기 과정에 대한 다양 한 실시 방법(예컨대, 일부 단계가 생략되거나, 또는 순서가 변경된 실시 방법)을 유추할 수 있을 것이나, 본 발명은 상기 유추되는 모든 실시 방법을 포함하여 이루어지며, 본 도면4에 도시된 실시 방법만으로 그 기술적 특징이 한정되지 아니한다. 도면4를 참조하면, 상기 도면3의 과정 이후, 운영서버는 가치형 실화의 실화 가치 대상에 적응하여 창작 또는 생성된 N개의 가치 적응 컨텐츠 중 지정된 제n 가치 적응 컨텐츠를 지정된 제m 사용자가 이용하는 사용자 단말을 통해 출력하도록 처리한다. 여기서, 상기 운영서버는 상기 제m 사용자의 사용자 단말을 통해 상기 제n 가치 적응 컨텐츠를 출력 시, 상기 사용자 단말을 통해 상기 제m 사용자가 상기 제n 가치 적응 컨텐츠에 설정된 제c' 가치 참여 분 류 항목을 확인 가능한 가치 참여 분류 확인정보를 출력하도록 처리할 수 있다. 그리고, 상기 운영서버는 상기 사용자 단말을 통해 상기 제n 가치 적응 컨텐츠를 출력하는 중 또는 후에 상기 사용자 단말로부터 상기 출력된 제n 가치 적응 컨텐츠를 시각기관이나 청각기관 중 적어도 하나 를 통해 인식한 제m 사용자가 상기 제n 가치 적응 컨텐츠에 대응하는 가치형 실화의 실화 가치 대상에 대한 가 치 참여를 요청하는 가치 참여 요청 정보를 수신한다. 여기서, 상기 가치 참여 요청 정보는, 상기 제n 가치 적응 컨텐츠와 상기 제m 사용자가 가치 참여를 요청한 실 화 가치 대상의 조합을 식별 가능한 가치 참여 식별코드, 상기 제m 사용자를 식별 가능한 사용자 식별정보, 상 기 실화 가치 대상에 대한 상기 제m 사용자의 가치 참여에 대응하는 가치 참여 금액 또는 가치 참여 가치를 확 인하거나 산출 가능한 가치 참여 정보 중 적어도 하나의 정보를 포함할 수 있다. 상기 가치 참여 요청 정보가 수신되면, 상기 운영서버는 상기 제m 사용자의 가치 참여 요청을 상기 설정된 제c' 가치 참여 분류 항목에 매칭되게 처리하는 가치 참여 절차를 수행한다. 여기서, 상기 가치 참여 절차는, 상기 가치 참여가 기부 형태의 가치 참여인 경우, 상기 제m 사용자의 지정된 금전형 가치를 관리하는 지정된 가치플랫폼의 사용자 계정에서 상기 제m 사용자의 가치 참여를 위한 가치 참여 가치에 대응하는 금전형 가치를 인출하여 상기 가치 참여를 관리하는 지정된 관리 계정으로 이전하는 절차를 포 함할 수 있다. 또한, 상기 가치 참여 절차는, 상기 가치 참여가 기부 형태의 가치 참여인 경우, 상기 제m 사용자의 지정된 금 전형 가치를 관리하는 지정된 가치플랫폼의 사용자 계정에서 상기 제m 사용자의 가치 참여를 위한 가치 참여 가 치에 대응하는 금전형 가치를 인출하여 지정된 명목화폐 단위의 가치 참여 금액으로 전환한 후 상기 가치 참여 를 관리하는 지정된 관리 계좌로 입금하는 절차를 포함할 수 있다. 또한, 상기 가치 참여 절차는, 상기 가치 참여가 커머스 형태의 가치 참여인 경우, 상기 커머스의 결제금액을 결제 처리하는 절차와, 상기 커머스의 결제 처리된 결제금액 중 가치 참여를 위해 지정된 금액을 확인하여 상기 가치 참여를 관리하는 지정된 관리 계정으로 이전하는 절차를 포함할 수 있다. 상기 제m 사용자의 가치 참여 절차가 수행된 이후, 상기 운영서버는 상기 가치 참여 절차의 결과에 대응하 는 제m 사용자의 가치 참여 정보와 상기 가치 참여 식별코드를 지정된 저장매체에 연계 저장한다. 그리고, 운영서버는 상기 제m 사용자의 가치 참여 정보와 상기 제m 사용자의 가치 참여에 적용된 제c' 가 치 참여 분류 항목과 연계 설정한다.부호의 설명 100 : 운영서버 105 : 정보 등록부 110 : 컨텐츠 확인부 115 : 분류항목 설정부 120 : 가치 참여부 125 : 참여결과 저장부 130 : 등록 단말 135 : 사용자 단말 140 : 창작자 단말 145 : 운영자 단말"}
{"patent_id": "10-2023-0134585", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 방법에 따른 실화 기반 가치 대상의 가치 참여 분류 별 가치 참여 운영 시스템의 구성을 도시한 도면이다. 도 2는 본 발명의 실시 방법에 따른 가치형 실화와 관련된 가치형 실화 정보를 지정된 등록 단말을 통해 등록받 아 저장하는 과정을 도시한 도면이다. 도 3은 본 발명의 실시 방법에 따른 가치형 실화의 지정된 실화 가치 대상에 적응하여 창작 또는 생성된 가치 적응 컨텐츠를 확인하고, 가치 참여 분류 항목을 기반으로 가치 적응 컨텐츠와 상기 실화 가치 대상의 조합에 적용할 가치 참여 분류 항목을 설정하는 과정을 도시한 도면이다. 도 4는 본 발명의 실시 방법에 따른 사용자의 가치 참여를 위한 가치 참여 절차를 수행하는 과정을 도시한 도면 이다."}
