{"patent_id": "10-2023-0119967", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0175276", "출원번호": "10-2023-0119967", "발명의 명칭": "다중 선택형 크라우드소싱 모델에서 상위 두 개 답변 및 혼동 확률을 복원하는 방법 및 장치", "출원인": "한국과학기술원", "발명자": "정혜원"}}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 장치에서 실행되는 아이템 레이블 복원 방법에 있어서,상기 컴퓨터 장치는 메모리에 포함된 컴퓨터 판독가능한 명령들을 실행하도록 구성된 적어도 하나의 프로세서를포함하고,상기 아이템 레이블 복원 방법은,상기 적어도 하나의 프로세서에 의해, 크라우드소싱(crowdsourcing)을 통해 수집된 데이터로서 다수의 작업자가각 아이템에 대한 적어도 둘 이상의 선택지 중에서 고른 답변을 이용하여 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계를 포함하는 아이템 레이블 복원 방법."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는,상기 다수의 작업자로부터 수집된 답변을 이용하여 상기 아이템 별로 정답과 가장 그럴듯한 오답(mostconfusing answer)을 추론하는 단계를 포함하는 아이템 레이블 복원 방법."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는,상기 상위 두 개의 답변으로 상기 아이템에 대한 정답과 가장 그럴듯한 오답을 추론하는 단계; 및상기 정답과 상기 가장 그럴듯한 오답 사이의 혼동 확률(confusion probability)을 추론하는 단계를 포함하는 아이템 레이블 복원 방법."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는,상기 수집된 데이터를 두 개의 데이터 행렬로 분할하는 단계를 포함하고,분할된 데이터 행렬 각각은 상기 작업자의 신뢰도 추정과 상기 아이템의 난이도 추론에 이용되는 것을 특징으로 하는 아이템 레이블 복원 방법."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는,상기 수집된 데이터를 행렬화한 후 이진 행렬로 변환하는 단계; 및공개특허 10-2024-0175276-3-상기 이진 행렬에 대한 특이값 분해(singular value decomposition)를 통해 상기 아이템에 대한 정답과 가장 그럴듯한 오답을 추론하는 단계를 포함하는 아이템 레이블 복원 방법."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는,상기 아이템에 대한 상기 작업자의 답변과 상기 아이템에 대한 상기 정답 및 상기 가장 그럴듯한 오답 간의 유사도를 기초로 상기 작업자의 신뢰도를 추론하는 단계; 및상기 아이템에 대한 난이도로서 상기 정답과 상기 가장 그럴듯한 오답 사이의 혼동 확률을 추론하는 단계를 더 포함하는 아이템 레이블 복원 방법."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는,상기 작업자의 신뢰도와 상기 아이템의 난이도를 기초로 상기 상위 두 개의 답변으로 추론된 상기 정답과 상기가장 그럴듯한 오답으로부터 상기 아이템에 대한 최종 레이블을 추론하는 단계를 더 포함하는 아이템 레이블 복원 방법."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 최종 레이블을 추론하는 단계는,상기 작업자의 신뢰도와 상기 아이템의 난이도를 이용한 MLE(maximum-likelihood estimator)를 통해 상기 최종레이블을 추론하는 것을 특징으로 하는 아이템 레이블 복원 방법."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "아이템 레이블 복원 방법을 컴퓨터에 실행시키기 위해 컴퓨터 판독가능한 기록 매체에 저장되는 컴퓨터 프로그램에 있어서,상기 아이템 레이블 복원 방법은,크라우드소싱(crowdsourcing)을 통해 수집된 데이터로서 다수의 작업자가 각 아이템에 대한 적어도 둘 이상의선택지 중에서 고른 답변을 이용하여 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계를 포함하는, 컴퓨터 프로그램."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨터 장치에 있어서,메모리에 포함된 컴퓨터 판독가능한 명령들을 실행하도록 구성된 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는,크라우드소싱(crowdsourcing)을 통해 수집된 데이터로서 다수의 작업자가 각 아이템에 대한 적어도 둘 이상의선택지 중에서 고른 답변을 이용하여 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 과정을 처리하는 컴퓨터 장치.공개특허 10-2024-0175276-4-청구항 11 제10항에 있어서,상기 적어도 하나의 프로세서는,상기 상위 두 개의 답변으로 상기 아이템에 대한 정답과 가장 그럴듯한 오답을 추론하고,상기 정답과 상기 가장 그럴듯한 오답 사이의 혼동 확률(confusion probability)을 추론하는 것을 특징으로 하는 컴퓨터 장치."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 적어도 하나의 프로세서는,상기 수집된 데이터를 두 개의 데이터 행렬로 분할하고,분할된 데이터 행렬 각각은 상기 작업자의 신뢰도 추정과 상기 아이템의 난이도 추론에 이용되는 것을 특징으로 하는 컴퓨터 장치."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 적어도 하나의 프로세서는,상기 수집된 데이터를 행렬화한 후 이진 행렬로 변환하고,상기 이진 행렬에 대한 특이값 분해(singular value decomposition)를 통해 상기 아이템에 대한 정답과 가장 그럴듯한 오답을 추론하는 것을 특징으로 하는 컴퓨터 장치."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 적어도 하나의 프로세서는,상기 아이템에 대한 상기 작업자의 답변과 상기 아이템에 대한 상기 정답 및 상기 가장 그럴듯한 오답 간의 유사도를 기초로 상기 작업자의 신뢰도를 추론하고,상기 아이템에 대한 난이도로서 상기 정답과 상기 가장 그럴듯한 오답 사이의 혼동 확률을 추론하는 것을 특징으로 하는 컴퓨터 장치."}
{"patent_id": "10-2023-0119967", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 적어도 하나의 프로세서는,상기 작업자의 신뢰도와 상기 아이템의 난이도를 이용한 MLE(maximum-likelihood estimator)를 통해 상기 상위두 개의 답변으로 추론된 상기 정답과 상기 가장 그럴듯한 오답으로부터 상기 아이템에 대한 최종 레이블을 추론하는 것을 특징으로 하는 컴퓨터 장치."}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다중 선택형 크라우드소싱 모델에서 상위 두 개 답변 및 혼동 확률을 복원하는 방법 및 장치가 개시된다. 다중 선택형 크라우드소싱 모델에서 상위 두 개 답변 및 혼동 확률을 복원하는 방법은, 크라우드소싱(crowdsourcing) 을 통해 수집된 데이터로서 다수의 작업자가 각 아이템에 대한 적어도 둘 이상의 선택지 중에서 고른 답변을 이 용하여 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명은 낮은 정확도를 가지는 데이터를 높은 정확도로 바꾸어 주는 크라우드소싱(crowdsourcing) 기술에 관한 것이다."}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "딥러닝(deep learning) 기술은 영상처리, 자연어처리 등 다양한 분야에서 혁신을 일으키고 있다. 일례로, 한국 공개특허공보 제10-2022-0081869호(공개일 2022년 06월 16일)에는 영상 데이터의 처리에 딥러닝을 활용하는 기술이 개시되어 있다. 딥러닝에 기반한 인공지능 시스템들이 성장하기 위해서는 많은 양의 질 좋은 데이터가 동반되어야 한다. 데이터 를 수집하는 것은 비교적 쉽더라도, 데이터에 높은 정확도를 가지는 레이블을 부여하는 일은 많은 비용이 발생 한다. 이를 해결하기 위해 딥러닝을 활용한 기계학습 분야에서는 최대한 적은 양의 데이터를 이용해 네트워크를 학습 시키는 기법이나 레이블 되지 않은 데이터를 학습에 활용하는 기법이 최근 연구되고 있다. 다른 한편으로는, 적은 비용으로 높은 정확도의 레이블을 가지는 데이터셋을 구축하는 방법들이 연구되고 있다. 대표적으로는 비전문가 집단 혹은 일반 대중에게서 수집한 많은 양의 낮은 정확도를 가지는 데이터를 높은 정확 도로 바꾸어 주는 크라우드소싱 시스템이 있다. 크라우드소싱은 빅데이터에 속한 각 아이템에 대한 레이블링을 비용, 시간 효율적으로 수행하기 위한 기법으로, 다수의 비전문가에게 아이템에 대한 질문과 선택지를 주고, 받은 답변을 종합하여 각 아이템에 대한 정확한 레 이블을 추론하는 것을 목표로 한다. 현재 인공지능에 사용되는 큰 데이터셋은 대부분 크라우드소싱을 통해 만들어지며, 이는 크라우드소싱이 비용 및 시간적 측면에서 뛰어난 효율성을 보이기 때문이다. 그러나, 비전문가 집단에게 지급하는 낮은 비용은 곧 답변의 부정확도를 야기하며, 이에 따라 크라우드소싱으로 수집된 데이터는 정확도가 떨어지는 문제를 지닌다."}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "크라우드소싱 시스템의 효과적 활용을 위해 정확도가 떨어지는 다수의 답변을 종합하여 정답인 레이블을 복원할 수 있는 신뢰도 높은 추론 기술을 제공한다. 주어진 크라우드소싱 시스템에서 비전문가 집단이 제공한 부정확한 답변을 효율적으로 종합하여 유용한 정보를 복원하는 기술로서 레이블을 수행하고자 하는 각 아이템(예를 들어, 이미지 등) 별로 정답과 가장 그럴듯한 오 답(즉, 정답과 가장 가까운 오답)이 존재한다고 가정할 때 크라우드소싱을 통해 수집된 데이터를 바탕으로 각 아이템 별로 정답과 가장 그럴듯한 오답, 그리고 그 사이의 혼동 확률을 복원하는 알고리즘을 제공한다."}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "컴퓨터 장치에서 실행되는 아이템 레이블 복원 방법에 있어서, 상기 컴퓨터 장치는 메모리에 포함된 컴퓨터 판 독가능한 명령들을 실행하도록 구성된 적어도 하나의 프로세서를 포함하고, 상기 아이템 레이블 복원 방법은, 상기 적어도 하나의 프로세서에 의해, 크라우드소싱(crowdsourcing)을 통해 수집된 데이터로서 다수의 작업자가 각 아이템에 대한 적어도 둘 이상의 선택지 중에서 고른 답변을 이용하여 상기 아이템 별로 상위 두 개의 답변 과 난이도를 추론하는 단계를 포함하는 아이템 레이블 복원 방법을 제공한다. 일 측면에 따르면, 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는, 상기 다수의 작업자로부 터 수집된 답변을 이용하여 상기 아이템 별로 정답과 가장 그럴듯한 오답(most confusing answer)을 추론하는 단계를 포함할 수 있다. 다른 측면에 따르면, 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는, 상기 상위 두 개의 답 변으로 상기 아이템에 대한 정답과 가장 그럴듯한 오답을 추론하는 단계; 및 상기 정답과 상기 가장 그럴듯한 오답 사이의 혼동 확률(confusion probability)을 추론하는 단계를 포함할 수 있다. 또 다른 측면에 따르면, 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는, 상기 수집된 데이터 를 두 개의 데이터 행렬로 분할하는 단계를 더 포함하고, 분할된 데이터 행렬 각각은 상기 작업자의 신뢰도 추 정과 상기 아이템의 난이도 추론에 이용될 수 있다. 또 다른 측면에 따르면, 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는, 상기 수집된 데이터 를 행렬화한 후 이진 행렬로 변환하는 단계; 및 상기 이진 행렬에 대한 특이값 분해(singular value decomposition)를 통해 상기 아이템에 대한 정답과 가장 그럴듯한 오답을 추론하는 단계를 포함할 수 있다. 또 다른 측면에 따르면, 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는, 상기 아이템에 대한 상기 작업자의 답변과 상기 아이템에 대한 상기 정답 및 상기 가장 그럴듯한 오답 간의 유사도를 기초로 상기 작업자의 신뢰도를 추론하는 단계; 및 상기 아이템에 대한 난이도로서 상기 정답과 상기 가장 그럴듯한 오답 사 이의 혼동 확률을 추론하는 단계를 더 포함할 수 있다. 또 다른 측면에 따르면, 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계는, 상기 작업자의 신뢰 도와 상기 아이템의 난이도를 기초로 상기 상위 두 개의 답변으로 추론된 상기 정답과 상기 가장 그럴듯한 오답 으로부터 상기 아이템에 대한 최종 레이블을 추론하는 단계를 더 포함할 수 있다. 또 다른 측면에 따르면, 상기 최종 레이블을 추론하는 단계는, 상기 작업자의 신뢰도와 상기 아이템의 난이도를 이용한 MLE(maximum-likelihood estimator)를 통해 상기 최종 레이블을 추론할 수 있다. 아이템 레이블 복원 방법을 컴퓨터에 실행시키기 위해 컴퓨터 판독가능한 기록 매체에 저장되는 컴퓨터 프로그 램에 있어서, 상기 아이템 레이블 복원 방법은, 크라우드소싱(crowdsourcing)을 통해 수집된 데이터로서 다수의 작업자가 각 아이템에 대한 적어도 둘 이상의 선택지 중에서 고른 답변을 이용하여 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 단계를 포함하는, 컴퓨터 프로그램을 제공한다. 컴퓨터 장치에 있어서, 메모리에 포함된 컴퓨터 판독가능한 명령들을 실행하도록 구성된 적어도 하나의 프로세 서를 포함하고, 상기 적어도 하나의 프로세서는, 크라우드소싱(crowdsourcing)을 통해 수집된 데이터로서 다수 의 작업자가 각 아이템에 대한 적어도 둘 이상의 선택지 중에서 고른 답변을 이용하여 상기 아이템 별로 상위 두 개의 답변과 난이도를 추론하는 과정을 처리하는 컴퓨터 장치를 제공한다."}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 다중 선택 크라우드소싱 모델에서 아이템 별로 상위 두 개의 헷갈리는 레이블을 가지는 새로운 모델을 제안한 후, 각 아이템 별 상위 두 개의 레이블과 혼동 확률을 추론할 수 있는 알고리즘을 통해 높은 추론 정확도를 달성하기 위해 필요한 비용을 절감할 수 있다. 본 발명의 실시예들에 따르면, 정확도가 떨어지는 다수의 답변을 종합하여 정답인 레이블을 복원하는 추론 기술 을 크라우드소싱 플랫폼이나 데이터 수집 시스템 등에 적용할 수 있고, 단순히 각 아이템 별로 한 개의 정답 레 이블만 추론하는 기존 방법에서 벗어나 상위 두 개의 레이블과 혼동 확률을 추론함으로써 인공지능 분야 등에 유용한 데이터에 대한 부가 정보를 제공할 수 있다."}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 본 발명의 실시예들은 낮은 정확도를 가지는 데이터를 높은 정확도로 바꾸어 주는 크라우드소싱 기술에 관한 것 이다. 본 명세서에서 구체적으로 개시되는 것들을 포함하는 실시예들은 크라우드소싱 시스템의 효과적 활용을 위해 정 확도가 떨어지는 다수의 답변을 종합하여 정답인 레이블을 추론하여 복원할 수 있다. 본 발명의 실시예들에 따른 아이템 레이블 복원 장치는 적어도 하나의 컴퓨터 장치에 의해 구현될 수 있으며, 본 발명의 실시예들에 따른 아이템 레이블 복원 방법은 아이템 레이블 복원 장치에 포함되는 적어도 하나의 컴 퓨터 장치를 통해 수행될 수 있다. 이때, 컴퓨터 장치에는 본 발명의 일실시예에 따른 컴퓨터 프로그램이 설치 및 구동될 수 있고, 컴퓨터 장치는 구동된 컴퓨터 프로그램의 제어에 따라 본 발명의 실시예들에 따른 아이템 레이블 복원 방법을 수행할 수 있다. 상술한 컴퓨터 프로그램은 컴퓨터 장치와 결합되어 아이템 레이블 복원 방 법을 컴퓨터에 실행시키기 위해 컴퓨터 판독 가능한 기록매체에 저장될 수 있다. 도 1은 본 발명의 일실시예에 따른 컴퓨터 장치의 예를 도시한 블록도이다. 예를 들어, 본 발명의 실시예들에 따른 아이템 레이블 복원 장치는 도 1을 통해 도시된 컴퓨터 장치에 의해 구현될 수 있다. 도 1에 도시된 바와 같이 컴퓨터 장치는 본 발명의 실시예들에 따른 아이템 레이블 복원 방법을 실행하기 위한 구성요소로서, 메모리, 프로세서, 통신 인터페이스 그리고 입출력 인터페이스를 포함 할 수 있다. 메모리는 컴퓨터에서 판독 가능한 기록매체로서, RAM(random access memory), ROM(read only memory) 및 디스크 드라이브와 같은 비소멸성 대용량 기록장치(permanent mass storage device)를 포함할 수 있다. 여기서 ROM과 디스크 드라이브와 같은 비소멸성 대용량 기록장치는 메모리와는 구분되는 별도의 영구 저장 장치로 서 컴퓨터 장치에 포함될 수도 있다. 또한, 메모리에는 운영체제와 적어도 하나의 프로그램 코드가 저장될 수 있다. 이러한 소프트웨어 구성요소들은 메모리와는 별도의 컴퓨터에서 판독 가능한 기록매체로 부터 메모리로 로딩될 수 있다. 이러한 별도의 컴퓨터에서 판독 가능한 기록매체는 플로피 드라이브, 디스 크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 실시예에서 소프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매체가 아닌 통신 인터페이스를 통해 메 모리에 로딩될 수도 있다. 예를 들어, 소프트웨어 구성요소들은 네트워크를 통해 수신되는 파일들에 의해 설치되는 컴퓨터 프로그램에 기반하여 컴퓨터 장치의 메모리에 로딩될 수 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리 또는 통신 인터페이스에 의해 프로세서로 제공될 수 있다. 예를 들어, 프로세서는 메모리와 같은 기록 장치에 저장된 프로그램 코드에 따라 수신되는 명령을 실행하 도록 구성될 수 있다. 통신 인터페이스는 네트워크를 통해 컴퓨터 장치가 다른 장치와 서로 통신하기 위한 기능을 제 공할 수 있다. 일례로, 컴퓨터 장치의 프로세서가 메모리와 같은 기록 장치에 저장된 프로그램 코드에 따라 생성한 요청이나 명령, 데이터, 파일 등이 통신 인터페이스의 제어에 따라 네트워크를 통해 다른 장치들로 전달될 수 있다. 역으로, 다른 장치로부터의 신호나 명령, 데이터, 파일 등이 네트워크 를 거쳐 컴퓨터 장치의 통신 인터페이스를 통해 컴퓨터 장치로 수신될 수 있다. 통신 인터 페이스를 통해 수신된 신호나 명령, 데이터 등은 프로세서나 메모리로 전달될 수 있고, 파일 등 은 컴퓨터 장치가 더 포함할 수 있는 저장 매체(상술한 영구 저장 장치)로 저장될 수 있다. 통신 방식은 제한되지 않으며, 네트워크가 포함할 수 있는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방송망)을 활용하는 통신 방식뿐만 아니라 기기들 간의 근거리 유선/무선 통신 역시 포함될 수 있다. 예를 들어, 네트워크는, PAN(personal area network), LAN(local area network), CAN(campus areanetwork), MAN(metropolitan area network), WAN(wide area network), BBN(broadband network), 인터넷 등의 네트워크 중 하나 이상의 임의의 네트워크를 포함할 수 있다. 또한, 네트워크는 버스 네트워크, 스타 네트 워크, 링 네트워크, 메쉬 네트워크, 스타-버스 네트워크, 트리 또는 계층적(hierarchical) 네트워크 등을 포함 하는 네트워크 토폴로지 중 임의의 하나 이상을 포함할 수 있으나, 이에 제한되지 않는다. 입출력 인터페이스는 입출력 장치와의 인터페이스를 위한 수단일 수 있다. 예를 들어, 입력 장치는 마이크, 키보드, 카메라 또는 마우스 등의 장치를, 그리고 출력 장치는 디스플레이, 스피커와 같은 장치를 포함 할 수 있다. 다른 예로 입출력 인터페이스는 터치스크린과 같이 입력과 출력을 위한 기능이 하나로 통합된 장치와의 인터페이스를 위한 수단일 수도 있다. 입출력 장치는 컴퓨터 장치와 하나의 장치로 구성될 수도 있다. 또한, 다른 실시예들에서 컴퓨터 장치는 도 1의 구성요소들보다 더 적은 혹은 더 많은 구성요소들을 포함 할 수도 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 예를 들어, 컴퓨터 장치는 상술한 입출력 장치 중 적어도 일부를 포함하도록 구현되거나 또는 트랜시버(transceiver), 카메라, 각종 센서, 데이터베이스 등과 같은 다른 구성요소들을 더 포함할 수도 있다. 이하에서는 다중 선택형 크라우드소싱 모델에서 상위 두 개 답변 및 혼동 확률을 복원하는 방법 및 장치의 구체 적인 실시예를 설명하기로 한다. 크라우드소싱은 빅데이터의 레이블링을 위한 기법으로, 다수의 비전문가에게 아이템에 대한 질문과 선택지를 주 고받은 답변을 종합하여 각 아이템의 레이블을 추론한다. 현재 인공지능에 사용되는 큰 데이터셋은 대부분 크라 우드소싱을 통해 만들어지고 있으며, 이는 크라우드소싱을 통한 데이터 수집이 비용 및 시간적 측면에서 뛰어난 효율성을 지니기 때문이다. 그러나, 비전문가 집단에게 지급하는 낮은 비용은 곧 답변의 부정확도를 야기하며, 이에 따라 크라우드소싱으로 수집된 데이터는 정확도가 떨어지는 문제를 지닌다. 따라서, 크라우드소싱 시스템의 효과적 활용을 위해 정확도가 떨어지는 다수의 답변을 종합하여 정답인 레이블 을 복원하는 신뢰도 높은 추론 알고리즘이 필요하다. 크라우드소싱을 통해 답변을 제공하는 작업자는 각기 다양 한 이유로 정확한 답변을 주지 않을 수 있기 때문에 답변에 대한 실제적 에러 모델을 가정하여 작업자의 답변을 분석하는 기술이 필요하다. 본 발명은 크라우드소싱을 통한 레이블링 기술 중 2개 이상의 선택지를 갖는 다중 선택형 크라우드소싱을 고려 한다. 다중 선택형 크라우드소싱 문제에서 답변을 제공하는 작업자는 다양한 이유로 오답을 주게 되는데, 이를 모델링하는 대표적인 방법으로 데이비드-스케네(Dawid-Skene) 모델이 있다. 데이비드-스케네 모델은 작업자 별로 모든 아이템에 대해 고정적인 혼동 행렬(confusion matrix)이 존재함을 가 정한다. 이때, 혼동 행렬의 (i,j) 성분은 정답 레이블이 i일 때 답변을 j라고 답할 확률을 의미한다. 하지만, 데이비드-스케네 모델은 모든 아이템에 대해 가능한 레이블 셋이 고정되어 있으며, 모든 아이템이 같은 난이도를 갖는다고 가정하기 때문에, 이는 실제 데이터셋 내 아이템의 다양성을 반영하지 못한다. 아이템의 난이도가 다를 때의 레이블 추정에 대한 알고리즘 또한 연구되고 있으나, 대부분의 알고리즘이 각 아 이템 별로 선택 가능한 분류 레이블이 2개인 이진 크라우드소싱에서만 적용 가능하다는 한계점이 있다. 이에 따라, 본 발명은 다중 선택 크라우드소싱 모델에서 각 아이템 별 선택 가능 레이블이 고정적이지 않으며, 아이템 별로 답변 난이도 차이가 존재하는 일반적인 모델에서 동작 가능한 레이블 복원 알고리즘을 제공한다. 본 발명은 크라우드소싱을 통한 레이블링 문제에서 각 아이템에 대한 정답 레이블 및 가장 그럴듯한 오답 레이 블(most confusing label)을 비용 효율적으로 복원하는 알고리즘을 포함한다. 또한, 아이템 별로 정답 레이블 및 가장 그럴듯한 오답 레이블 간의 혼동 확률(confusion probability)을 추정하여 이를 각 아이템의 난이도로 표현함으로써 아이템 별 난이도 역시 복원할 수 있다. 본 발명에 따른 아이템 레이블 복원 알고리즘은 두 개 이상의 물체가 공존하는 이미지의 레이블링 혹은 평점이 나 리뷰와 같이 뚜렷한 정답이 존재하지 않는 데이터의 수집에서 정답 뿐만 아니라 가장 그럴듯한 오답(즉, 정 답과 가장 가까운 오답)을 복원하고, 그 둘 사이의 혼동 확률까지 추정함으로써 크라우드소싱을 통해 수집된 데 이터에서 아이템 별 정답 레이블 이외 더 많은 정보에 대한 추론을 가능케 하는 장점을 지닌다. 도 2는 본 발명의 일실시예에 따른 컴퓨터 장치가 수행할 수 있는 아이템 레이블 복원 방법의 예를 도시한 순서 도이다. 본 실시예에 따른 컴퓨터 장치는 클라이언트(client)를 대상으로 클라이언트 상에 설치된 전용 어플리케이 션이나 컴퓨터 장치와 관련된 웹/모바일 사이트 접속을 통해 목적하는 서비스를 제공할 수 있다. 컴퓨터 장치에는 컴퓨터로 구현된 아이템 레이블 복원 장치가 구성될 수 있다. 일례로, 아이템 레이블 복원 장치 는 독립적으로 동작하는 프로그램 형태로 구현되거나, 혹은 특정 어플리케이션의 인-앱(in-app) 형태로 구성되 어 상기 특정 어플리케이션 상에서 동작이 가능하도록 구현될 수 있다. 컴퓨터 장치의 프로세서는 이하의 아이템 레이블 복원 방법을 수행하기 위한 구성요소로 구현될 수 있다. 실시예에 따라 프로세서의 구성요소들은 선택적으로 프로세서에 포함되거나 제외될 수도 있다. 또한, 실시예에 따라 프로세서의 구성요소들은 프로세서의 기능의 표현을 위해 분리 또는 병합될 수 도 있다. 이러한 프로세서 및 프로세서의 구성요소들은 이하의 아이템 레이블 복원 방법이 포함하는 단계들을 수행하도록 컴퓨터 장치를 제어할 수 있다. 예를 들어, 프로세서 및 프로세서의 구성요소들은 메모리가 포함하는 운영체제의 코드와 적어도 하나의 프로그램의 코드에 따른 명령(instruction)을 실행하 도록 구현될 수 있다. 여기서, 프로세서의 구성요소들은 컴퓨터 장치에 저장된 프로그램 코드가 제공하는 명령에 따라 프로 세서에 의해 수행되는 서로 다른 기능들(different functions)의 표현들일 수 있다. 프로세서는 컴퓨터 장치의 제어와 관련된 명령이 로딩된 메모리로부터 필요한 명령을 읽어들일 수 있다. 이 경우, 상기 읽어들인 명령은 프로세서가 이후 설명될 단계들을 실행하도록 제어하기 위한 명 령을 포함할 수 있다. 이후 설명될 아이템 레이블 복원 방법이 포함하는 단계들은 도시된 순서와 다른 순서로 수행될 수 있으며, 단계 들 중 일부가 생략되거나 추가의 과정이 더 포함될 수 있다. 도 2를 참조하면, 본 발명에 따른 아이템 레이블 복원 방법은 데이터 행렬을 분할하는 단계(S210), 분할된 데이 터 행렬을 기초로 아이템 별 초기 레이블을 추론하는 단계(S220), 초기 레이블을 이용하여 작업자 별 신뢰도 및 아이템 별 난이도를 추론하는 단계(S230), 및 작업자 별 신뢰도 및 아이템 별 난이도를 통해 아이템에 대한 정 답 레이블과 오답 레이블을 추론하는 단계(S240)를 포함할 수 있다. 다중 선택 크라우드소싱 모델은 크게 세 가지 방법으로 비전문가 집단의 부정확성을 모델링할 수 있다. 첫 번째, 앞서 설명한 데이비드-스케네 모델을 활용한 기법들이 있으며, 수집된 데이터로부터 혼동 행렬을 추론하 는 다양한 모델이 사용되고 있다. 두 번째, 아이템 별 난이도를 모델링하는 기법이 있다. 마지막으로, 베이지안 확률 모델, 클러스터링 기법 등을 통하여 비전문가 집단의 부정확성을 모델링하는 기법이 있다. 그러나, 이러한 모델들은 모든 아이템 별로 선택지가 고정되어 있다고 가정하고 알고리즘을 디자인하기 때문에 아이템 별로 선 택지가 변화한다면 모델의 정확도를 보장할 수 없는 문제가 있다. 따라서, 본 실시예에서는 아이템 별로 선택지가 변하는 일반적 상황에서 아이템 별로 상위 두 개의 레이블을 추 론하고 아이템 별 난이도를 추론하는 모델을 제안한다. 아이템 레이블 복원 과정의 세부 내용을 구체적으로 설명하기로 한다. 먼저, 작업자의 수는 n명, 레이블링하고자 하는 아이템의 수는 m개이다. 각 아이템 별로 가능한 선택지는 k(k≥ 2)개가 있으며, 각 작업자는 주어진 아이템에 대해 1,…,K의 답변을 1개만 제시한다. 각 작업자는 모든 아이템 에 대해 독립적으로 s의 확률로 배정된다. 모든 아이템을 답변한 경우에 보상이 주어진다. 이하에서는 i를 작업자의 인덱스, j를 아이템의 인덱스로 사용한다. 본 실시예에서 사용되는 작업자 답변에 대한 에러 모델은 다음과 같다. 1) 작업자는 s의 확률로 각 아이템에 배정된다. 때문에 1-s의 확률로 작업자의 답변은 0(답변 없음)이다. 2) 작업자 i는 신뢰도 pi를 가지며 1-pi의 확률로 랜덤하게(모든 레이블 b∈[K]에 대해 동일한 확률로) 답변한다. 3) 작업자 i는 pi의 확률로 아이템 j에 대해 정답 또는 가장 그럴듯한 오답을 제시하며, 나머지 확률로 그 외의 답변을 제시한다. 이때, 정답 레이블을 gj, 가장 그럴듯한 오답 레이블을 hj라고 정의한다. 4) gj와 hj 간에는 혼동 확률 qj가 존재하여 qj의 확률로 gj로 답변하고, 1-qj의 확률로 hj로 답변한다. qj는 의 범위에 존재한다. 이때, qj가 1/2에 가까울수록 gj와 hj가 헷갈린다는 뜻이므로 어려운 아이템이 되고, qj가 1에 가까울수록 쉬운 아이템이 된다. A를 모든 작업자들의 모든 답변을 모은 행렬이라고 하고, Aij를 i번째 작업자의 j번째 아이템에 대한 답변이라고 할 때, Aij는 다음 수학식 1의 확률 분포를 따른다. [수학식 1]"}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명에 따른 아이템 레이블 복원 방법은 각 아이템 별로 상위 두 개의 답변 (gj, hj) 및 난이도 (즉, 혼동 확 률) qj를 복원하는 과정이다. 단계(S210)에서 프로세서는 주어진 데이터 행렬 A를 같은 크기의 두 개의 행렬의 합으로 표현할 수 있으며, 각각의 행렬을 작업자의 신뢰도 추정과 아이템의 난이도 추론에 이용한다. 데이터 행렬 분할 과정 (S210)이 필요한 이유는 작업자의 신뢰도와 아이템의 난이도에 대한 독립성이 보장되어야 하기 때문이다. 다시 말해, 프로세서는 데이터 행렬 A를 가공하는 과정으로서 작업자의 신뢰도에 따른 오답과 혼동 확률에 따른 오답을 각기 독립적으로 추론하기 위해 크라우드소싱을 통해 수집된 데이터를 독립된 두 개의 데이터 행렬로 나 눌 수 있다. 데이터 행렬 A의 각 엔트리는 s1의 확률로 행렬 A1에 포함되고, 1-s1의 확률로 행렬 A2에 포함된다. 이때, A1+A2=A가 성립된다. 단계(S220)에서 프로세서는 주어진 데이터 행렬의 특성을 활용하여 아이템 별 상위 두 개의 레이블 gj와 hj 를 추론한다. 주어진 데이터 행렬 A를 답변이 k(1≤k<K)보다 큰지 또는 작은지에 대한 이진 데이터 행렬 A(k)로 변환한다. 이때, 이진 데이터 행렬 A(k)의 기대값은 수학식 2의 성질을 만족한다. [수학식 2]"}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, s는 행렬의 희소성(sparsity)를 의미하고, p는 작업자의 신뢰도로 구성된 벡터이다. 그리고, 벡터 r에 대해 이 수학식 3의 성질을 만족한다. [수학식 3] 여기서, 는 아이템 의 혼동 확률이다. qj∈(1/2, 1]에 대해, 는 k=gj에서 최소 값을 가지며, k=hj에서 두 번째로 작은 값을 갖는다. 따라서, 이진 데이터 행렬 A, …, A(k-1)을 특이값 분해(singular value decomposition)를 통해 분해하여 r(k) 를 추정하고, 아이템 별로 값을 계산하여 가장 작은 값을 갖는 k를 아이템의 정답 으로, 두 번째로 작 은 값을 갖는 k를 아이템의 가장 헷갈리는 오답 으로 추론한다. 이를 식으로 표현하면 수학식 4와 같다. [수학식 4]"}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "프로세서는 크라우드소싱을 통해 수집된 데이터를 행렬화한 후 행렬화된 데이터를 값이 0 또는 1인 이진 행렬로 변환할 수 있고, 이때 이진 행렬의 특이값 분해를 통해 아이템에 대한 정답과 그럴듯한 오답을 추론할 수 있다. 초기 레이블 추론을 위한 알고리즘은 도 3과 같다. 단계(S230)에서 프로세서는 단계(S220)에서 추론된 초기 레이블을 이용하여 작업자 별 신뢰도 및 아이템 별 난이도를 추론한다. 이때, 작업자 i의 신뢰도 pi는 작업자 i의 답변이 단계(S220)에서 추론한 , 와 얼 마나 일치하는지 비교를 통해 계산할 수 있다. 프로세서는 아이템에 대한 정답과 가장 그럴듯한 오답, 그 리고 각 작업자 별 답변 간의 유사도를 통해 작업자 i의 신뢰도 pi를 추론할 수 있다. [수학식 5]"}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "그리고, 아이템 별 난이도 qj는 의 값이 k가 , 가 아닐 때는 일정하다는 성질을 이용하여 계산할 수 있다. 프로세서는 아이템에 대한 정답과 가장 그럴듯한 오답 간의 혼동 확률로부터 아이템 별 난이도 qj를 추론할 수 있다. 단계(S240)에서 프로세서는 초기 레이블 추론을 보완하기 위하여 단계(S230)에서 구한 작업자 별 신뢰도 및 아이템 별 난이도를 통해 MLE(maximum-likelihood estimator)를 적용하여 gj와 hj를 추론한다. 특정 아이템 j에 대한 상위 두 개의 레이블 gj와 hj는 수학식 6과 같이 계산된다. [수학식 6]"}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "이를 모든 아이템들에 적용하여 최종 상위 두 개의 레이블을 아이템 별로 선택할 수 있다. 최종 레이블 추론을 위한 알고리즘은 도 4와 같다. 따라서, 본 발명은 다중 선택 크라우드소싱 모델에서 아이템 별로 상위 두 개의 헷갈리는 레이블을 가지는 새로 운 모델을 제안한 후 각 아이템 별 상위 두 개의 레이블과 혼동 확률을 추론함으로써 높은 추론 정확도를 달성 하기 위해 필요한 비용(아이템 당 질문 수)을 절감시킬 수 있다. 본 발명에 따른 아이템 레이블 복원 알고리즘은 Amazon Mechanical Turk와 같은 크라우드소싱 플랫폼, 리뷰 시 스템과 같은 다양한 데이터 수집 시스템 등에 활용될 수 있으며, 단순히 각 아이템 별로 한 개의 정답 레이블만 추론하는 방식에서 벗어나 상위 두 개의 레이블과 혼동 확률을 추론함으로써 인공지능 분야 등에 유용한 데이터 에 대한 부가 정보를 제공할 수 있다. 특히, 본 발명에 따른 아이템 레이블 복원 알고리즘은 두 개 이상의 물체가 공존하는 이미지의 레이블링 혹은 평점이나 리뷰와 같이 뚜렷한 정답이 존재하지 않는 데이터의 수집에서 정답뿐만 아니라 가장 그럴듯한 오답을 복원하고, 그들 사이의 혼동 확률까지 추정함으로써 크라우드소싱을 통해 수집된 데이터에서 아이템 별 정답 레 이블 이외 더 많은 정보에 대한 추론이 가능하다는 장점이 있다. 본 발명에서 가정한 에러 모델로부터 실험 데이터셋을 생성하여 알고리즘의 성능을 확인할 결과, 본 발명에 따 른 아이템 레이블 복원 알고리즘은 이론적으로 도달 가능한 최고의 알고리즘에 1% 내외의 성능차를 보임을 확인 할 수 있다. 또한, 실제 크라우드소싱을 통해 사람들로부터 수집한 데이터셋에 대한 분석에서도 다른 기존 알고 리즘에 비해 같은 비용(질문 수) 대비 각 아이템별 상위 두 개의 레이블을 높은 정확도로 추정함을 확인할 수 있다. 도 5는 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 합성 데이터셋의 시나리오를 도시한 것이다. 도 5를 참조하면, 합성 데이터셋 실험은 네 가지 가능한 시나리오(Easy, Hard, Few-Smart, High-Variance)를 가정하여 에러 모델을 통해 다양한 데이터셋을 생성하고, 본 발명에 따른 아이템 레이블 복원 알고리즘이 기존 알고리즘 대비 같은 비용으로 상위 두 개의 레이블을 보다 높은 정확도로 추론할 수 있음을 검증할 수 있다. 이 때, 시나리오 별로 작업자 별 신뢰도와 아이템 별 난이도의 범위에 차이를 둔다. 50명의 작업자에게 500개의 아 이템에 대한 질문을 하는 상황을 가정하고, 희소성(sparsity) 를 변화시켜 아이템 당 답변 수의 변화에 따른 성 능을 비교한다. 도 6은 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 합성 데이터셋의 실험 결과를 도시한 것이다. 도 6을 참조하면, 상위 두 개의 레이블 추론에서 기존의 알고리즘 대비 모든 시나리오에서 본 발명의 아이템 레 이블 복원 알고리즘(TopTwo2-파란 선)이 가장 좋은 성능을 보임을 확인할 수 있다. 또한, 이론상 도달 가능한 한계인 오라클(Oracle-검은 선)과 비교하여도 거의 근접하게 에러 확률을 줄이는 알고리즘임을 확인할 수 있다. 도 7은 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 컬러 데이터셋 예시를 도시한 것이고, 도 8은 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 컬러 데이터셋의 실험 결과 를 도시한 것이다. 다음 실험은 컬러(Color)라는 데이터셋을 직접 크라우드소싱 플랫폼 MTurk를 통해 제작하고 작업자(사람)들의 답변 데이터를 모아 진행한 것이다. 도 7을 참조하면, 컬러 데이터셋은 기준 색과 가장 유사한 색을 주어진 선 택지 중에서 고르는 다중 선택 크라우드소싱 데이터셋으로, 상단에 기준 색이 주어지고, 아래 6개의 선택지 중 에서 기준 색과 가장 가까운 선택지를 고르는 아이템이다. 이 아이템에서 정량화된 방법으로 두 색 사이의 거리 를 측정하여 기준 색과 가장 거리가 가까운 색을 정답 레이블로, 두 번째로 가까운 색을 가장 헷갈리는 레이블 로 선택한다. 도 8에 도시한 바와 같이, 컬러 데이터셋에 대해, 본 발명에 따른 아이템 레이블 복원 알고리즘은 다른 알고리즘에 비해 높은 정확도로 상위 두 개의 레이블을 추론함을 확인할 수 있다. 도 9는 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 신경망 실험 결과를 도시한 것이다. 마지막으로, 도 9는 상위 두 개의 레이블이 신경망(neural network) 학습에서 좋은 부가정보의 역할을 할 수 있 음을 나타내고 있다. 한 개의 레이블을 사용하여 네트워크를 학습하는 경우(hard)에 비해 상위 두 개의 레이블 을 사용하여 네트워크를 학습하는 경우(top2)가 더 좋은 성능을 나타냄을 확인할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 프로세서, 콘트롤 러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터,FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접 근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명"}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되 어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 이때, 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하는 것일 수도 있다. 또한, 매체는 단일 또는 수 개의 하드웨어가 결합된 형태의 다 양한 기록수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워 크 상에 분산 존재하는 것일 수도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체의 예시로, 어플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어 를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다."}
{"patent_id": "10-2023-0119967", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2023-0119967", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 있어서 컴퓨터 장치의 내부 구성의 일례를 설명하기 위한 블록도이다. 도 2는 본 발명의 일실시예에 따른 컴퓨터 장치가 수행할 수 있는 아이템 레이블 복원 방법의 예를 도시한 순서 도이다. 도 3은 본 발명의 일실시예에 있어서 아이템에 대한 초기 레이블 추론 알고리즘을 도시한 것이다. 도 4는 본 발명의 일실시예에 있어서 아이템에 대한 최종 레이블 추론 알고리즘을 도시한 것이다. 도 5는 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 합성 데이터셋의 시나리오를 도시한 것이다. 도 6은 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 합성 데이터셋의 실험 결과를 도시한 것이다. 도 7은 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 컬러 데이터셋 예시를 도시한 것이다.도 8은 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 컬러 데이터셋의 실험 결과를 도시한 것이다. 도 9는 본 발명의 일실시예에 있어서 아이템 레이블 복원 알고리즘에 대한 신경망 실험 결과를 도시한 것이다."}
