{"patent_id": "10-2023-0080133", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0178363", "출원번호": "10-2023-0080133", "발명의 명칭": "자동차 배기 가스 저감 장치", "출원인": "김주환", "발명자": "김주환"}}
{"patent_id": "10-2023-0080133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자동차 배기 가스 저감 장치에 있어서,제어부(5) 및 드라이버(20)에 전원을 공급하는 배터리 전원(7),상기 배터리 전원(7)에서 공급되는 전력으로 구동되고, 상기 드라이버(20)에 디지털 신호를 제공하는 제어부(5),상기 제어부(5)에서 제공되는 디지털 신호를 조정하여 정현파 전력을 출력하는 드라이버(20),상기 드라이버(20)에서 제공되는 사인파 전력을 제공 받아 전자기파를 방사하는 연료라인(30)에 설치되는 제1/2 코일(31,32)로 이루어지되,상기 드라이버(20)는,변환 컨버터(21), 저역통과필터(23), 스무딩필터(25) 및 전압+정현파형 증폭 변압기 회로(27)로 구성되고,상기 변환 컨버터(21)는 1개씩 증가되는 2진수 입력값에 대해 아날로그 신호를 1개씩 증가하면서 계단파형 주파수를 생성하는 것을 특징으로 하는 자동차 배기 가스 저감 장치."}
{"patent_id": "10-2023-0080133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부(5)는 엔진 RPM에 연동되는 전기신호를 생성하여 상기 변환 컨버터(21)에 제공하고,상기 저역통과필터(23)는 상기 변환 컨버터(21)에서 생성된 계단파를 저주파 필터링하여 0.9~4.5kHz로 출력하며,상기 스무딩 필터(25)는 0.9~4.5kHz 신호를 입력 받아 노이즈 필터링하고, 계단파의 주파수 펄스를 정현파로 변환하여 출력 하고,상기 전압+정현파형 증폭 변압기 회로(27)는 상기 스무딩 필터(25)에서 제공 받은 정현파 전력을 22~30v로 증폭하여 + 사인파(+SW)와 - 사인파(-SW)로 나누어 제1코일(31)과 제2코일(32)에 제공하는 것을 특징으로 하는 자동차 배기 가스 저감 장치."}
{"patent_id": "10-2023-0080133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제 1/2 코일(31, 32)은,제1코일(31)은 0.8mm 직경의 동(Cu)선으로, 엔진 연소실 측에서 연료탱크 방향으로 진행하며 시계 방향으로 22회 권선되고,제2코일(32)은 0.8mm 직경의 동(Cu)선으로, 연료탱크 측에서 엔진 연소실 방향으로 진행하며 시계 방향으로 18회 권선되며,제1코일(31)에는 +SW가 연결되고, 제2코일(32)에는 -SW가 연결되는 것을 특징으로 하는 자동차 배기 가스 저감장치.공개특허 10-2024-0178363-2-청구항 4 제2항에 있어서,엔진 RPM에 대응한 배기 가스의 유해 물질 농도를 감지하여 상기 제어부(5)에 유해 물질 농도를 제공하는 배기가스 감지부(50)를 더 포함하는 것을 특징으로 하는 자동차 배기 가스 저감 장치."}
{"patent_id": "10-2023-0080133", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 자동차 배기 가스 저감 장치에 관한 것으로, 보다 상세하게는 엔진 연소실로 인입되는 연료 라인 상의 중앙 지점에 전자기파를 발생시켜 연료의 주성분 탄화수소 분자를 미세 분열화로 미립화하고, 화학 반응을 연료 의 옥탄가를 높이고, 불완전연소를 제거하고, 폭발성을 좋게 하여 완전 연소를 이루어 유해 배기 가스 방출을 제 거하고, 에너지 효율을 높이는 자동차 배기 가스 저감 장치에 관한 것이다."}
{"patent_id": "10-2023-0080133", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자동차 배기 가스 저감 장치에 관한 것으로, 보다 상세하게는 엔진 연소실로 인입되는 연료 라인 상 의 중앙 지점에 전자기파를 발생시켜 연료의 주성분 탄화수소 분자를 미세 분열화로 미립화하고, 화학 반응을 연료의 옥탄가를 높이고, 불완전연소를 제거하고, 폭발성을 좋게 하여 완전 연소를 이루어 유해 배기 가스 방출 을 제거하는 자동차 배기 가스 저감 장치에 관한 것이다."}
{"patent_id": "10-2023-0080133", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명에 관련된 종래기술에는 연료 미립화, 연료 이온화가 있다. 특허문헌 1 연료의 미립화 및 이온화 수단을 갖는 연료저감 및 배기가스 저감장치는 간단한 구조로써 내연기관에 공급되는 연료를 예열하여 연료의 완전연소 를 도모하면서도 예열된 연료를 초음파 진동자를 이용하여 미립화 시키고, 미립화된 연료를 와류구를 이용하여 연료가 연료호스 내에서 와류되면서도 고압으로 이동할 수 있도록 하며, 와류되면서 고압으로 연료호스 내를 이 동하는 연료에는 연료의 양에 대응되는 사인파를 방사하여 연료를 이온화하고, 이온화된 연료에는 자성체를 이 용하여 재차 내연기관에 공급되는 연료를 이온화함으로서 미립화, 이온화 및 예열된 연료로 인해 내연기관에서 연료가 완전연소되도록 하여 연료의 절감은 물론 연료의 완전연소로 인해 유해물질을 포함하는 배기가스도 감소 되는 연료의 미립화 및 이온화 수단을 갖는다. 또한, 특허문헌 2 전기장을 이용한 연료 이온화 방법 및 연료 이 온화 장치는 연료 공급관의 외측에 서로 간격을 두고 설치된 양(+)/음(-)의 전극부재에 펄스파 형태로 전원을 인가하여 연료 공급관의 일정 길이 범위에 걸쳐 전기장을 형성함으로써, 이 전기장의 작용에 의해, 연료 공급관 의 내부 유로를 따라 유동하는 연료가 이온화되거나 미립화되도록 하여, 연료의 완전연소를 도모함과 아울러, 내연기관의 연비와 엔진의 출력을 둘 다 향상시킬 수 있다. 또한, 특허문헌 3 연료 이온화 장치는 연료 공급관 의 외측에 서로 간격을 두고 설치된 양(+)/음(-)의 전극부에 펄스파 형태로 전원을 인가하여 연료 공급관의 일 정 길이 범위에 걸쳐 전기장을 형성함으로써, 이 전기장의 작용에 의해, 연료 공급관의 내부 유로를 따라 유동 하는 연료가 이온화되거나 미립화되도록 하여, 연료의 완전연소를 도모함과 아울러, 내연 기관의 연비와 엔진의 출력을 둘 다 향상시킬 수 있다. 또한, 특허문헌 4 연료 미립화를 통한 매연 저감 장치는 연료호스 내를 이동하 는 연료에는 연료의 양에 대응되는 사인파를 방사하여 연료를 미립화함으로써, 내연기관에서 미립화된 연료가 완전연소되도록 하여 연료의 절감을 도모한다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1512281호(2015.04.14) (특허문헌 0002) 공개특허공보 제10-2019-0066847호(2019.06.14) (특허문헌 0003) 등록특허공보 제10-2166406호(2020.10.15) (특허문헌 0004) 등록특허공보 제10-2102082호(2020.04.17)"}
{"patent_id": "10-2023-0080133", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 엔진 RPM에 맞게 파형을 생성하여 제1코일과 제2코일을 구동하고, 제1코일과 제2코일에 의해 생성된 전자기파를 연료 라인에 출력하여 배기 가스를 저감시키는 자동차 배기 가스 저감 장치를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0080133", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 바람직한 일 실시예에 따른 자동차 배기 가스 저감 장치에 있어서, 제어부 및 드라이버에 전 원을 공급하는 배터리 전원, 상기 배터리 전원에서 공급되는 전력으로 구동되고, 상기 드라이버에 디지털 신호를 제공하는 제어부, 상기 제어부에서 제공되는 디지털 신호를 조정하여 정현파 전력을 출력 하는 드라이버, 상기 드라이버에서 제공되는 사인파 전력을 제공 받아 전자기파를 방사하는 연료라인 에 설치되는 제 1/2 코일(31,32)로 이루어지되, 상기 드라이버는, 변환 컨버터, 저역통과필터, 스무딩필터 및 전압+정현파형 증폭 변압기 회로로 구성되고, 상기 변환 컨버터는 1개씩 증가되는 2 진수 입력값에 대해 아날로그 신호를 1개씩 증가하면서 계단파형 주파수를 생성하는 것을 특징으로 한다. 또한, 상기 제어부는 엔진 RPM에 연동되는 전기신호를 생성하여 상기 변환 컨버터에 제공하고, 상기 저 역통과필터는 상기 변환 컨버터에서 생성된 계단파를 저주파 필터링하여 0.9~4.5kHz로 출력하며, 상기 스무딩 필터는 0.9~4.5kHz 신호를 입력 받아 노이즈 필터링하고, 계단파의 주파수 펄스를 정현파로 변환하 여 출력하고, 상기 전압+정현파형 증폭 변압기 회로는 상기 스무딩 필터에서 제공 받은 정현파 전력을 22~30v로 증폭 하여 + 사인파(+SW)와 - 사인파(-SW)로 나누어 제1코일과 제2코일에 제공하는 것을 특징 으로 한다. 또한, 상기 제 1/2 코일(31, 32)은, 제1코일은 0.8mm 직경의 동(Cu)선으로, 엔진 연소실 측에서 연료탱크 방향으로 진행하며 시계 방향으로 22회 권선되고, 제2코일은 0.8mm 직경의 동(Cu)선으로, 연료탱크 측에서 엔진 연소실 방향으로 진행하며 시계 방향으로 18회 권선되며, 제1코일에는 +SW가 연결되고, 제2코일에 는 -SW가 연결되는 것을 특징으로 한다. 또한, 엔진 RPM에 대응한 배기 가스의 유해 물질 농도를 감지하여 상기 제어부에 유해 물질 농도를 제공하는 배기 가스 감지부를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0080133", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 엔진 연소실로 인입되는 연료 라인 상의 중앙 지점에 전자기파를 발생시켜 연료의 주성분 탄화수소 분자를 미세 분열화로 미립화하고, 화학 반응을 연료의 옥탄가를 높이고, 불완전연소를 제거하고, 폭발성을 좋 게 하여 완전 연소를 이루어 유해 배기 가스 방출을 제거하고, 엔진 효율, 연료 효율도 높이는 효과를 가질 수 있다."}
{"patent_id": "10-2023-0080133", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시 예에 따른 자동차 배기 가스 저감 장치에 대하여 상세히 설명하기로 한 다. 이하에서 종래 주지된 사항에 대한 설명은 본 발명의 요지를 명확히 하기 위해 생략하거나 간단히 한다. 본 발명의 설명에 포함된 구성은 개별 또는 복합 결합 구성되어 동작한다. 도 1은 본 발명 자동차 배기 가스 저감 장치가 탑재되는 자동차를 보인 예시도이다. 도 1을 참조하면, 자동차는 연료 라인에 자동차 배기 가스 저감 장치를 구성하여 엔진에 주입되는 연료의 옥탄가를 높이고, 엔진에서 연료가 연소된 후 배출되는 배기 가스의 유해 성분을 줄이고, 연료 효율을 높인다. 자동차 배기 가스 저감 장치는 엔진 연소실로 인입되는 자동차 연료를 연료 기관 상에서 전자기파를 발생시켜 연료의 주성분인 탄화수소 분자를 미세 분열화하여 미립화하고, 화학 반응으로 옥탄가를 높여, 폭발성을 좋게 하여 완전 연소를 통한 배기 가스를 저감시킨다.도 2는 본 발명 자동차 배기 가스 저감 장치의 구성을 보인 블록도이다. 도 2를 참조하면, 자동차 배기 가스 저감 장치는 배터리 전원, 제어부, 드라이버 및 연료라인에 설치되는 제1코일(L1), 제2코일(L2)로 이루어지며, 상기 드라이버는 변환 컨버터, 저역통과필터, 스무딩 필터, 전압+정현파형 증폭 변압기 회로로 구성된다 배터리 전원은 자동차에 탑재되어 충전용 발전기(제너레이터)를 통해 유휴 전력을 충전하고, 자동차 배기 가 스 저감 장치에 전원을 공급한다. 상기 배터리 전원에서 출력되는 전압은 12~24V Power Free Voltage 전원으로 배기 가스 저감장치에 구동 전 력을 제공하여 배기 가스 저감장치가 올바로 동작되게 한다. 제어부는 엔진 RPM에 연동되는 전기신호를 생성하여 디지털 신호로 변환 컨버터에 제공한다. 즉, 엔진의 구동력에 의해 전력을 발전하는 상기 제너레이터는 엔진 RPM에 따라 전력의 주파수가 변환되며, 상 기 제어부는 변환된 전력 주파수를 감지하여 변환 컨버터에 제공하는 디지털 신호를 조정한다. 상기 변환 컨버터는 DAC(Digital-to-Analog Converter)로 상기 제어부에서 입력된 디지털 신호를 계단 파형 아날로그 신호로 변환하여 저역통과필터로 출력한다. 이때 변환 컨버터는 1씩 증가되는 2진수 입력값에 대해 아날로그 신호를 1개씩 증가하면서 계단파형 주파수 를 생성한다. 예를 들어, 2진수 입력값이 0이면, 1, 10, 11, 100, 1씩 증가되며, 이러한 2진수 입력값에 대응하 여 아날로그 신호도 1씩 증가하는 계단파형 주파수 전기 신호가 생성된다. 상기 저역통과필터는 상기 변환 컨버터에서 생성된 계단파를 저주파 필터링하여 0.9~4.5kHz 사이의 중 간 주파수를 출력한다. 상기 스무딩 필터는 0.9~4.5kHz 사이의 중간 주파수를 입력 받아 노이즈 필터링하고, 계단파의 주파수 펄스 를 정현파로 변환하여 전압+정현파형 증폭 변압기 회로로 출력 한다. 상기 전압+정현파형 증폭 변압기 회로는 정현파 증폭 변압기로 전압을 22~30v로 증폭한다. 상기 전압+정현파형 증폭 변압기 회로에서 출력되는 정현파 전력은 180도 위상차로 교번되는 사인파로, + 사인파(+SW)와 - 사인파(-SW)로 나누어 제1코일(L1)과 제2코일(L2)에 출력된다. 도 3은 본 발명 배기 가스 저감 방법을 설명하기 위한 배기 가스 저감 시스템을 보인도이다. 도 3을 참조하면, 배기 가스 저감 시스템은 제어부, 드라이버, 연료 라인, 엔진 제어부, 배기 가스 감지부를 포함한다. 제어부는 엔진 RPM(revolutions per minute)에 맞게 파형을 생성하여 드라이브을 통해 제1코일(L1)과 제2코일(L2)을 구동하고, 제1코일(L1)과 제2코일(L2)에 의해 생성된 전자기파를 연료 라인에 방사하여 엔진 실에 공급되는 연료를 미립화하여 배기 가스를 저감 시킨다. 즉, 드라이버는 제어부에 의해 생성된 파형을 증폭하여 제1코일(L1)과 제2코일(L2)을 구동해서 전자기파 를 연료 라인에 방사하고, 연료 라인은 전자기파에 의해 엔진 연소실로 인입되는 연료의 탄화수소 분자 를 미립화하고, 옥탄가를 높인다. 엔진 제어부는 자동차 배기 가스 저감 장치의 제어부에 엔진 RPM 정보를 제공하고, 제어부는 엔진 RPM 정보에 대응한 파형 생성을 제어한다. 엔진 RPM은 엔진에서 소모되는 연료량에 따라 달라지고, 연료량은 전 자기파의 세기, 주파수에 영향을 미친다. 배기 가스 감지부는 엔진 RPM에 대응한 배기 가스의 유해 물질 농도를 감지하고, 자동차 배기 가스 저감 장 치의 제어부에 유해 물질 농도를 제공한다. 제어부는 배기 가스 감지부에 의해 감지된 유해 물질 농 도를 참고하여 파형 생성을 제어한다. 제어부는 파형 생성에서 2진값 증가 정도, 저주파통과필터의 차단 주 파수 값 조정, 스무딩 필터의 잡음 제거 정도, 변압기 회로의 증폭 정도를 제어한다. 제어부의 파형 생성은 제1코일(L1)과 제2코일(L2)의 전자기파 출력에 영향을 미치고, 전자기파 출력은 연료 미립화에 영향을 주어 엔 진 RPM에 따른 배기 가스 저감을 도모한다. 도 4는 본 발명 단말기 구성을 보인 블록도이다. 단말기는 자동차 배기 가스 저감 장치로, 엔진 RPM(revolutions per minute)에 맞게 파형을 생성하여 제1코 일(L1)과 제2코일(L2)을 구동하고, 제1코일(L1)과 제2코일(L2)에 의해 생성된 전자기파를 연료 라인에 출력 하여 배기 가스를 저감시키는 제어부를 포함한다. 단말기는 배기 가스 감지부로부터 수신된 센서값을 저장하여 시간 흐름에 따라 모니터링하고, 단말기 의 동작 에러를 처리하고, 에러 메시지를 출력하고, 제어 대상인 제어부를 스위칭 제어한다. 단말기는 프로세서, 메모리, 입출력장치, 운영체제, 제어부를 포함한다. 프로세서는 CPU(Central Processing Units), GPU(Graphic Processing Unit), FPGA(Field Programmable Gate Array), NPU(Neural Processing Unit)로서, 메모리에 탑재된 운영체제, 제어부의 실행 코드를 수행한다. 메모리는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device)를 포함할 수 있다. 입출력장치는 입력 장치로, 오디오 센서 및/또는 이미지 센서를 포함한 카메라, 키보드, 마이크로폰, 마우스 등의 장치를, 그리고 출력 장치로, 디스플레이, 스피커, 햅틱 피드백 디바이스(haptic feedback device) 등과 같은 장치를 포함할 수 있다. 운영체제는 윈도우, 리눅스, IOS, 가상 머신, 웹브라우저, 인터프리터를 포함할 수 있고, 태스크, 쓰레드, 타이머 실행, 스케줄링, 자원 관리, 그래픽, 폰트 처리, 통신 등을 지원한다. 제어부는 운영체제의 지원하에 입출력장치의 센서, 키, 터치, 마우스 입력에 의한 상태를 결정하고, 결정된 상태에 따른 동작을 수행한다. 제어부는 병렬 수행 루틴으로 타이머, 쓰레드에 의한 작업 스케줄링을 수행한다. 제어부는 입출력장치의 센서값을 이용하여 상태를 결정하고, 결정된 상태에 따른 알고리즘을 수행한다. 제어부는 단말기의 센서값 확률 빈도에 대한 빈도 집중도를 계산하고, 빈도 집중도가 일정 임계치 이상으 로 발생하면 모니터링 동작에 투여되는 시스템 자원을 늘리고, 시스템 자원이 고갈되면 모니터링 동작을 중지한 다. 제어부는 빈도 집중도가 높은 센서값의 구성 요소를 분리하여 빈도 집중도를 분산하고, 빈도 집중도가 일정 임계치 이하로 낮아질 때까지 분리 분산 작업을 반복한다. 신경망 학습은 온도, 고도, 지문 등 각종 센서, 이미지, 적외선 등 카메라, 라이더와 같은 입력 장치로부터 수 집된 시계열 데이터로부터 특징량 선택, 알고리즘 선택을 통해 모델을 선택하고, 학습, 성능 검증 과정에 의한 반복 시행 착오를 거쳐 모델 선택을 반복한다. 성능 검증이 마치면 인공지능 모델이 선택된다. 제어부는 센서값 판단에 신경망을 이용한 딥러닝 알고리즘을 수행하고, 신경망 학습에 훈련 데이터를 이용하 고, 시험 데이터로 신경망 성능을 검증한다. 제어부는 엔진 RPM, 파형 생성, 배기 가스 농도의 데이터를 시계열 데이터로 입력하고, 인공지능 모델을 이 용하여 파형 생성의 최적화를 수행한다. 인공지능 모델은 학습, 성능 검증의 반복 시행 착오를 거쳐 모델 선택 되고, 파형 생성 출력을 최적화한다. 또한, 제어부는 파형 생성 명령에 대해 파형 생성을 최적화하는데 인공지능 모델을 이용한다. 최적화는 파형 생성에 관계되며, 파형 생성에 배기 가스가 얼마만큼 저감되었는지에 따라 파형 생성이 최적화된다. 최적화는 엔진 RPM, 배기 가스 농도에 관계되며, 제어부는 이들 변수를 인공지능 모델에 적용해서 파형 생성을 최적화 한다. 제어부는 상태 머신을 포함하고, 상태 머신은 이벤트 처리, 상태 전이, 상태 처리를 포함한다. 상태 머신은 키, 마우스, 터치의 입력에 따른 이벤트를 처리하는 이벤트 처리; 이벤트에 대응한 상태를 전이하 는 상태 전이; 전이된 상태에 대한 루틴을 처리하는 상태 처리;를 수행한다. 상태는 파향 생성을 포함하고, 루 틴은 파형 생성 루틴을 포함한다. 제어부는 사용자 조작, 데이터 입력에 대응한 이벤트 처리, 상태 전이, 상태 처리의 상태 머신을 실행한다. 이벤트 처리는 조작, 입력에 따른 이벤트를 처리하고, 상태 처리는 연산, 표시, 진동, 알람을 수행하고, 사용자 조작, 데이터 입력, 랜덤 입력에 대한 범위, 시간, 레벨의 입력을 검증하고, 사용자 조작, 데이터 입력, 랜덤 입력에 대한 상태 확률에 따른 시스템 검증을 실행한다. 시스템 검증은 샘플링 데이터에 기반한 상태 머신 검증을 포함한다. 제어부는 샘플링 데이터를 저장하고, 일정 시간 동안 샘플링 데이터의 크기 별로 발생 회수를 누적하여 제1 확률 분포를 계산하고, 또 다른 일정 시간 동안의 제2확률 분포를 계산하고, 두 제1,제2확률 분포의 차, 면적 차, 차 거리 누적을 계산해서 샘플링 회로 이상, 데이터 오류, 데이터 변화를 예측하고, 이에 대응할 수 있다. 제어부는 예측 결과를 사용자에게 알림으로써 사용자가 대응하거나 제어부가 하드웨어 고장, 데이터 오류, 데이터 변화에 대응할 수 있다. 예를 들어, 두 제1,제2확률 분포의 면적 차가 일정 임계치를 초과하면 제 어부는 샘플링 회로 이상, 데이터 오류, 데이터 변화를 예측하고, 이상, 오류, 변화에 대처한다. 대응은 이 상 표시, 알림, 시스템 정지를 포함한다. 샘플링 데이터는 데이터 분석, 설비 선택, 결과 리포트의 데이터를 포함하고, 제어부는 샘플링 데이터에 기반하여 하드웨어 고장, 데이터 오류, 데이터 변화에 대응한다. 제어부는 일정 시간 동안 마다 각각의 확률 분포 추이를 보고, 확률 분포 중 특이 현상 이상을 예측하고, 이 상 사고에 대응하고, 확률 분포에 대해 데이터 변화가 일정하면 정상 동작을 외부에 알린다. 또한, 제어부는 일정 시간 간격을 조정하기 위해 데이터 변화율을 피드백한다. 예를 들어, 데이터 변화율이 크면 일정 시간 간 격을 늘리고, 데이터 변화율이 작으면 일정 시간 간격을 줄인다. 도 5는 본 발명 자동차 배기 가스 저감 장치의 제1코일과 제2코일 구성을 보인 예시도이다. 도 5에 도시된 바와 같이, 배기가스 저감을 위한 연료 미립화가 이루어지는 구간은 제1코일(L1)과 제2코일(L2) 간에 형성된 AS(Atomization Section) 구간으로 엔진 연소실 측에 형성되는 제1코일(L1)의 끝단과 연료탱크 측 에 형성되는 제2코일(L2)의 끝단 간에 형성된다[제1코일:L1, 제2코일:L2]. 제1코일(L1)은 0.8mm 직경의 동(Cu)선으로 엔진 연소실 측에서 연료탱크 방향으로 진행하며 시계 방향으로 권선 되고, 권선 회수(턴수:N)는 22회 권선되는 것이 바람직하다. 제2코일(L2)은 0.8mm 직경의 동(Cu)선으로 연료탱크 측에서 엔진 연소실 방향으로 진행하며 시계 방향으로 권선 되고, 권선 회수(턴수:N)는 제1코일 턴수 보다 20% 내외로 감축한 18회 권선되는 것이 바람직하다. 제 1/2 코일의 권선되는 인접 코일 간 이격 거리는 최소화하는 것이 바람직하며 동(Cu)선이 에나멜로 코팅된 에 나멜코일인 경우 밀착해서 감으면 된다. 상기 제1코일(L1)에는 +SW가 연결되고, 제2코일(L2)에는 -SW가 연결되며, 제1코일(L1) 끝단과 제2코일(L2) 끝단 간 이격 거리(AS 구간)는 20mm로 하는 것이 바람직하다. 즉, 22~30v 정현파 전압은 제1코일(L1)에는 +극을 제2코일(L2)에는 -극을 연결하여 전자기파를 발생시켜 연 료 라인 상의 AS 구간에서 연료의 주성분인 탄화수소 분자를 미세원자로 분열화하여 미립화하고 연료의 옥 탄가를 높여 불완전연소를 제거하고, 엔진 연소실의 폭발성을 좋게 하여 유해 배기 가스 방출을 저감한다. 본 발명은 상술한 특정의 바람직한 실시 예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗 어남이 없이 해당 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형실시가 가능한 것은 물론이고, 그와 같은 변경은 청구범위 기재의 범위 내에 있게 된다."}
{"patent_id": "10-2023-0080133", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명 자동차 배기 가스 저감 장치가 탑재되는 자동차를 보인 예시도이다. 도 2는 본 발명 자동차 배기 가스 저감 장치의 구성을 보인 블록도이다. 도 3은 본 발명 배기 가스 저감 방법을 설명하기 위한 배기 가스 저감 시스템을 보인도이다. 도 4는 본 발명 단말기 구성을 보인 블록도이다. 도 5는 본 발명 자동차 배기 가스 저감 장치의 제1코일과 제2코일 구성을 보인 예시도이다."}
