{"patent_id": "10-2021-0171266", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0083136", "출원번호": "10-2021-0171266", "발명의 명칭": "딥 러닝을 이용한 가스 검지기의 농도값 산출 방법", "출원인": "한국가스안전공사", "발명자": "박규태"}}
{"patent_id": "10-2021-0171266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 데이터 쌍 획득부가 n+1(n은 7 이상 9 이하의 양의 정수)종의 제1 농도값을 갖는 시험가스가 주입된 가스검지기로부터 상기 제1 농도값에 매칭되는 n+1개의 제1 전압값을 입력받아 상기 제1 농도값과 상기 제1 전압값으로 이루어진 n+1개의 제1 데이터 쌍을 획득하는 제1 데이터 쌍 획득단계;제1 연립방정식 생성부가 상기 제1 데이터 쌍을 농도값이 변수이고 해가 전압값인 제1 n차 방정식에 대입하여n+1개의 1차 방정식으로 이루어진 n+1원 1차의 제1 연립방정식을 생성하는 제1 연립방정식 생성단계;제1 n차 함수 획득부가 상기 n+1원 1차의 제1 연립방정식에 가우스 소거법을 적용하여 상기 제1 n차 방정식에포함된 n+1개의 계수(상수인 0차항의 계수 포함)를 연산함으로써 농도값이 변수이고 해가 전압값인 제1 n차 함수를 획득하는 제1 n차 함수 획득단계;제2 데이터 쌍 획득부가 상기 제1 농도값과 상이한 n+1개의 제2 농도값을 갖는 시험가스가 주입된 가스 검지기로부터 상기 2 농도값에 매칭되는 n+1개의 제2 전압값을 입력받아 상기 제2 농도값과 상기 제2 전압값으로 이루어진 n+1개의 제2 데이터 쌍을 획득하는 제2 데이터 쌍 획득단계;제2 연립방정식 생성부가 상기 제2 데이터 쌍을 농도값이 변수이고 해가 전압값인 제2 n차 방정식에 대입하여n+1개의 1차 방정식으로 이루어진 n+1원 1차의 제2 연립방정식을 생성하는 제2 연립방정식 생성단계;제2 n차 함수 획득부가 상기 n+1원 1차의 제2 연립방정식에 가우스 소거법을 적용하여 상기 제2 n차 방정식에포함된 n+1개의 계수(상수인 0차항의 계수 포함)를 연산함으로써 농도값이 변수이고 해가 전압값인 제2 n차 함수를 획득하는 제2 n차 함수 획득단계;역함수 연산부가 상기 제2 n차 함수의 역함수를 연산하는 역함수 연산단계;오차 검증부가 상기 제2 n차 함수의 역함수에 상기 제1 데이터 쌍을 구성하는 제1 전압값을 대입하여 계산한 농도값과 상기 제1 전압값에 매칭되는 제1 농도값을 비교하여 오차를 검증하는 오차 검증단계;제3 n차 함수 획득부가 상기 제2 데이터 쌍과 상기 제2 n차 함수에 오차 역전파(back-propagation) 알고리즘을적용하여 상기 오차를 최소화하는 n개의 계수를 연산함으로써 농도값이 변수이고 해가 전압값인 제3 n차 함수를획득하는 제3 n차 함수 획득단계; 및농도값 산출부가 제3 n차 함수의 역함수에 상기 가스 검지기가 측정 가스의 주입에 대응하여 측정한 측정 전압값에 대응하는 측정 농도값을 산출하는 농도값 산출단계를 포함하는, 딥 러닝을 이용한 가스 검지기의 농도값산출 방법."}
{"patent_id": "10-2021-0171266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제3 n차 함수 획득단계에서, 상기 제3 n차 함수 획득부는 상기 제3 n차 함수를 구성하는 고차항의 계수를 저차항의 계수보다 먼저 연산하는것을 특징으로 하는, 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법."}
{"patent_id": "10-2021-0171266", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제3 n차 함수 획득단계에서, 공개특허 10-2023-0083136-3-상기 제3 n차 함수 획득부는 상기 제3 n차 함수의 각각의 항의 계수의 평균값을 최종적인 계수로 결정하는 것을특징으로 하는, 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법."}
{"patent_id": "10-2021-0171266", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법에 관한 것이다. 본 발명에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법은 제1 데이터 쌍 획득부가 n+1(n은 7 이상 9 이하의 양의 정수)종의 제1 농도값을 갖는 시험가스가 주입된 가스 검지기로부터 상기 제1 농도값에 매칭되는 (뒷면에 계속)"}
{"patent_id": "10-2021-0171266", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법에 관한 것이다. 보다 구체적으로, 본 발명은 수소 경제 활성화 제도에 발맞추어 수소, 탄화수소계열 등의 가스 검지기의 농도 산출에 인공지능 딥 러닝기술을 적 용하여 가스 검지기의 농도값 산출 정확도와 산출 속도를 향상시킬 수 있는 딥 러닝을 이용한 가스 검지기의 농 도값 산출 방법에 관한 것이다."}
{"patent_id": "10-2021-0171266", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 수소 센서 또는 검지기에서 수소농도를 측정하고 그 측정값을 표시하기 위해서는, 특정 농도를 가 진 표준가스 2종 내지 3종을 제조하고, 이를 센서 또는 검지기에 주입하여서 전류 또는 전압의 변화량을 측정 및 기록하여 2종 내지 3종의 입력 및 출력에 대한 값을 순서쌍으로 수집하여 이 순서쌍의 점(point)을 지나는 선형방정식을 구하여 농도 표시에 활용하고 있다. 즉, 종래 기술은 센서의 입력에 대한 출력의 선형 함수를 도출한 후, 이 함수의 역함수를 구하여 수소농도를 표 시한다. 즉, 미지의 전류나 전압이 측정될 때, 측정되는 값에 상응하는 미지의 농도를 상기 역함수에 대입하여 미지의 농도를 결정한다. 그러나, 센서나 검지기의 입출력 특성은 비선형성을 포함하고 있으므로 입출력 지점을 2 내지 3 포인트의 선형 방정식을 이용하는 종래의 농도 산출기술은 정확도가 떨어진다는 문제점이 있다. 또한, 종래 기술은 미지의 전류나 전압이 측정될 때, 측정되는 값에 상응하는 미지의 농도를 역함수에 대입하여 연산하기 때문에, 농도 연산에 소요되는 시간이 길어진다는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2017-0114985호(공개일자: 2017년 10월 16일, 명칭: 수소 가스 센서를 이용 한 수소 가스 측정 방법)"}
{"patent_id": "10-2021-0171266", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 기술적 과제는 수소경제 활성화 제도에 발맞추어 수소, 탄화수소계열 등의 가스 검지기의 농도 산출 에 인공지능 딥 러닝기술을 적용하여 가스 검지기의 농도값 산출 정확도와 산출 속도를 향상시킬 수 있는 딥 러 닝을 이용한 가스 검지기의 농도값 산출 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0171266", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 기술적 과제를 해결하기 위한 본 발명에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법은 제1 데이터 쌍 획득부가 n+1(n은 7 이상 9 이하의 양의 정수)종의 제1 농도값을 갖는 시험가스가 주입된 가스 검지 기로부터 상기 제1 농도값에 매칭되는 n+1개의 제1 전압값을 입력받아 상기 제1 농도값과 상기 제1 전압값으로 이루어진 n+1개의 제1 데이터 쌍을 획득하는 제1 데이터 쌍 획득단계, 제1 연립방정식 생성부가 상기 제1 데이터 쌍을 농도값이 변수이고 해가 전압값인 제1 n차 방정식에 대입하여 n+1개의 1차 방정식으로 이루어진 n+1원 1차의 제1 연립방정식을 생성하는 제1 연립방정식 생성단계, 제1 n차 함수 획득부가 상기 n+1원 1차의 제1 연립 방정식에 가우스 소거법을 적용하여 상기 제1 n차 방정식에 포함된 n+1개의 계수(상수인 0차항의 계수 포함)를 연산함으로써 농도값이 변수이고 해가 전압값인 제1 n차 함수를 획득하는 제1 n차 함수 획득단계, 제2 데이터 쌍 획득부가 상기 제1 농도값과 상이한 n+1개의 제2 농도값을 갖는 시험가스가 주입된 가스 검지기로부터 상기 2 농도값에 매칭되는 n+1개의 제2 전압값을 입력받아 상기 제2 농도값과 상기 제2 전압값으로 이루어진 n+1개의 제2 데이터 쌍을 획득하는 제2 데이터 쌍 획득단계, 제2 연립방정식 생성부가 상기 제2 데이터 쌍을 농도값이 변수이고 해가 전압값인 제2 n차 방정식에 대입하여 n+1개의 1차 방정식으로 이루어진 n+1원 1차의 제2 연립방 정식을 생성하는 제2 연립방정식 생성단계, 제2 n차 함수 획득부가 상기 n+1원 1차의 제2 연립방정식에 가우스 소거법을 적용하여 상기 제2 n차 방정식에 포함된 n+1개의 계수(상수인 0차항의 계수 포함)를 연산함으로써 농 도값이 변수이고 해가 전압값인 제2 n차 함수를 획득하는 제2 n차 함수 획득단계, 역함수 연산부가 상기 제2 n 차 함수의 역함수를 연산하는 역함수 연산단계, 오차 검증부가 상기 제2 n차 함수의 역함수에 상기 제1 데이터 쌍을 구성하는 제1 전압값을 대입하여 계산한 농도값과 상기 제1 전압값에 매칭되는 제1 농도값을 비교하여 오 차를 검증하는 오차 검증단계, 제3 n차 함수 획득부가 상기 제2 데이터 쌍과 상기 제2 n차 함수에 오차 역전파 (back-propagation) 알고리즘을 적용하여 상기 오차를 최소화하는 n개의 계수를 연산함으로써 농도값이 변수이 고 해가 전압값인 제3 n차 함수를 획득하는 제3 n차 함수 획득단계 및 농도값 산출부가 제3 n차 함수의 역함수 에 상기 가스 검지기가 측정 가스의 주입에 대응하여 측정한 측정 전압값에 대응하는 측정 농도값을 산출하는 농도값 산출단계를 포함한다. 본 발명에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법에 있어서, 상기 제3 n차 함수 획득단계에서, 상기 제3 n차 함수 획득부는 상기 제3 n차 함수를 구성하는 고차항의 계수를 저차항의 계수보다 먼저 연산하는 것을 특징으로 한다. 본 발명에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법에 있어서, 상기 제3 n차 함수 획득단계에서, 상기 제3 n차 함수 획득부는 상기 제3 n차 함수의 각각의 항의 계수의 평균값을 최종적인 계수로 결정하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0171266", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 수소경제 활성화 제도에 발맞추어 수소, 탄화수소계열 등의 가스 검지기의 농도 산출에 인공 지능 딥 러닝기술을 적용하여 가스 검지기의 농도값 산출 정확도와 산출 속도를 향상시킬 수 있는 딥 러닝을 이 용한 가스 검지기의 농도값 산출 방법이 제공되는 효과가 있다."}
{"patent_id": "10-2021-0171266", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 개시된 본 발명의 개념에 따른 실시 예들에 대해서 특정한 구조적 또는 기능적 설명은 단지 본 발 명의 개념에 따른 실시 예들을 설명하기 위한 목적으로 예시된 것으로서, 본 발명의 개념에 따른 실시 예들은 다양한 형태들로 실시될 수 있으며 본 명세서에 설명된 실시 예들에 한정되지 않는다. 본 발명의 개념에 따른 실시 예들은 다양한 변경들을 가할 수 있고 여러 가지 형태들을 가질 수 있으므로 실시 예들을 도면에 예시하고 본 명세서에서 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 개념에 따른 실시 예들을 특정한 개시 형태들에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변 경, 균등물, 또는 대체물을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어는 본 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 나타낸다. 일반적 으로 사용되는 사전에 정의된 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해 석되지 않는다. 이하에서는, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예를 상세히 설명한다. 도 1은 본 발명의 일 실시 예에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법이 구현되는 예시적인 장치 구성을 나타낸 도면이고, 도 2 및 도 3은 본 발명의 일 실시 예에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법을 나타낸 도면이다. 도 1 내지 도 3을 참조하면, 본 발명의 일 실시 예에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법은 제1 데이터 쌍 획득단계(S10), 제1 연립방정식 생성단계(S20), 제1 n차 함수 획득단계(S30), 제2 데이터 쌍 획 득단계(S40), 제2 연립방정식 생성단계(S50), 제2 n차 함수 획득단계(S60), 역함수 연산단계(S70), 오차 검증단 계(S80), 제3 n차 함수 획득단계(S90) 및 농도값 산출단계(S100)를 포함하여 구성된다. 제1 데이터 쌍 획득단계(S10)에서는, 제1 데이터 쌍 획득부가 n+1(n은 7 이상 9 이하의 양의 정수)종의 제1 농도값을 갖는 시험가스가 주입된 가스 검지기로부터 n+1종의 제1 농도값에 매칭되는 n+1개의 제1 전압값을 입 력받아 제1 농도값과 제1 전압값으로 이루어진 n+1개의 제1 데이터 쌍을 획득하는 과정이 수행된다. 예를 들어, 시험가스는 탄화수소계열의 가스일 수 있으며, n은 7일 수 있다. 다음 표 1에는 8종의 제1 농도값을 갖는 시험가스가 주입된 가스 검지기가 출력하는 8개의 제1 전압값이 예시되 어 있다. 표 1 Y(전압, V)0.4 0.6 0.8 1.0 1.2 1.4 1.6 1.8 X(농도, %)0.0020.0040.0060.0080.0100.0200.0300.040 제1 연립방정식 생성단계(S20)에서는, 제1 연립방정식 생성부가 n+1개의 제1 데이터 쌍을 농도값이 변수이 고 해가 전압값인 제1 n차 방정식에 대입하여 n+1개의 1차 방정식으로 이루어진 n+1원 1차의 제1 연립방정식을 생성하는 과정이 수행된다. 예를 들어, 제1 n차 방정식은 다음 수식 1과 같이 표현될 수 있다. [수식 1] y = ax7 + bx6 + cx5 + dx4 + ex3 + fx2 + gx + h 제1 n차 함수 획득단계(S30)에서는, 제1 n차 함수 획득부가 n+1원 1차의 제1 연립방정식에 가우스 소거법을 적용하여 제1 n차 방정식에 포함된 n+1개의 계수(상수인 0차항의 계수 포함)를 연산함으로써 농도값이 변수이고 해가 전압값인 제1 n차 함수를 획득하는 과정이 수행된다. 제2 데이터 쌍 획득단계(S40)에서는, 제2 데이터 쌍 획득부가 n+1개의 제1 농도값과 상이한 n+1개의 제2 농 도값을 갖는 시험가스가 주입된 가스 검지기로부터 n+1개의 제2 농도값에 매칭되는 n+1개의 제2 전압값을 입력 받아 n+1개의 제2 농도값과 n+1개의 제2 전압값으로 이루어진 n+1개의 제2 데이터 쌍을 획득하는 과정이 수행된 다. 예를 들어, n+1개의 제2 농도값은 n+1개의 제1 농도값의 1/2값을 더한 값일 수 있다. 구체적인 예로, 제1 농도 값이 0.002에 대응하는 제2 농도값은 0.003일 수 있다. 제2 연립방정식 생성단계(S50)에서는, 제2 연립방정식 생성부가 n+1개의 제2 데이터 쌍을 농도값이 변수이 고 해가 전압값인 제2 n차 방정식에 대입하여 n+1개의 1차 방정식으로 이루어진 n+1원 1차의 제2 연립방정식을 생성하는 과정이 수행된다. 제2 n차 함수 획득단계(S60)에서는, 제2 n차 함수 획득부가 n+1원 1차의 제2 연립방정식에 가우스 소거법을 적용하여 제2 n차 방정식에 포함된 n+1개의 계수(상수인 0차항의 계수 포함)를 연산함으로써 농도값이 변수이고해가 전압값인 제2 n차 함수를 획득하는 과정이 수행된다. 역함수 연산단계(S70)에서는, 역함수 연산부가 제2 n차 함수의 역함수를 연산하는 과정이 수행된다. 제2 n 차 함수의 역함수는 전압값이 변수이고 해가 농도값이다. 오차 검증단계(S80)에서는, 오차 검증부가 제2 n차 함수의 역함수에 제1 데이터 쌍을 구성하는 제1 전압값 을 대입하여 계산한 농도값과 제1 전압값에 매칭되는 제1 농도값을 비교하여 오차를 검증하는 과정이 수행된다. 제3 n차 함수 획득단계(S90)에서는, 제3 n차 함수 획득부가 제2 데이터 쌍과 제2 n차 함수에 오차 역전파 (back-propagation) 알고리즘을 적용하여 오차를 최소화하는 n개의 계수를 연산함으로써 농도값이 변수이고 해 가 전압값인 제3 n차 함수를 획득하는 과정이 수행된다. 예를 들어, 제3 n차 함수 획득단계(S90)에서, 제3 n차 함수 획득부는 제3 n차 함수를 구성하는 고차항의 계 수를 저차항의 계수보다 먼저 연산하도록 구성될 수 있다. 또한, 예를 들어, 제3 n차 함수 획득단계(S90)에서, 제3 n차 함수 획득부는 제3 n차 함수의 각각의 항의 계 수의 평균값을 최종적인 계수로 결정하도록 구성될 수 있다. 보다 구체적인 예로, 오차가 최소화된 최종적인 함수인 제3 n차 함수를 획득하는 과정에 딥 러닝 강화 학습 기 술을 적용하여 새로운 농도 표준에 더 가까운 값을 나타내도록 오차 역전파 알고리즘을 사용하여 새로운 고차방 정식의 계수값을 고차항부터 저차항까지 순서대로 구하도록 구성될 수 있다. 새로운 8종의 농도, 즉 제2 농도값을 각각 주입시 각 계수를 na, nb....nh라고 할 때, na~ nh는 각각 8개가 도 출된다. 이 때 도출된 각 계수를 (na1+na2+...+na8)/8로 평균하여 취하도록 구성될 수 있다. nb~nh도 각각 도출하여 1/8 로 평균하여 AI 딥 러닝을 이용한 새로운 함수, 즉, 제3 n차 함수가 도출될 수 있다. 농도값 산출단계(S100)에서는, 농도값 산출부가 제3 n차 함수의 역함수에 가스 검지기가 측정 가스의 주입 에 대응하여 측정한 측정 전압값에 대응하는 측정 농도값을 산출하는 과정이 수행된다. 이상에서 상세히 설명한 바와 같이 본 발명에 따르면, 수소경제 활성화 제도에 발맞추어 수소, 탄화수소계열 등 의 가스 검지기의 농도 산출에 인공지능 딥 러닝기술을 적용하여 가스 검지기의 농도값 산출 정확도와 산출 속 도를 향상시킬 수 있는 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법이 제공되는 효과가 있다."}
{"patent_id": "10-2021-0171266", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법이 구현되는 예시적인 장치 구성을 나타낸 도면이고, 도 2 및 도 3은 본 발명의 일 실시 예에 따른 딥 러닝을 이용한 가스 검지기의 농도값 산출 방법을 나타낸 도면 이다."}
