{"patent_id": "10-2020-0096539", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0126473", "출원번호": "10-2020-0096539", "발명의 명칭": "소비 데이터와 소셜 데이터를 이용한 소비동향 예측 지수 생성 방법과 이를 적용한 소비동향", "출원인": "주식회사 제로투원파트너스", "발명자": "권성은"}}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대상 상품 또는 브랜드에 연관된 소비 데이터 및 비정형의 소셜 데이터를 수신하고, 상기 대상 상품 또는 브랜드의 소비동향 예측 지수를 제공하도록 구성된 플랫폼 제공 서버; 및 상기 소비 데이터를 이용하여 소비동향 지수를 생성하고, 상기 소셜 데이터를 정형 데이터로 변환하며, 학습 데이터로부터 추출된 상기 소비동향 지수 및 상기 정형 데이터를 특징값으로 이용한 머신러닝에 의해 생성된 분석모델을 이용하여, 상기 소비동향 지수 및 상기 정형 데이터로부터 상기 소비동향 예측 지수를 생성하도록 구성된 데이터 분석 서버를 포함하는 소비동향 예측 지수 생성 시스템."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 학습 데이터 또는 경제 또는 인구에 연관된 통계 데이터를 저장하도록 구성된 데이터베이스 서버를 더 포함하되,상기 분석 모델은 학습 데이터로부터 추출된 상기 통계 데이터를 더 이용하여 생성된 것인 소비동향 예측 지수생성 시스템."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 데이터 분석 서버는, 자연어 처리에 의하여 상기 소셜 데이터에 포함된 텍스트를 추출하도록 구성된 텍스트 마이닝부; 및 머신러닝에 의해 상기 분석 모델을 생성하며, 상기 소비 데이터를 미리 설정된 기준 시점의 데이터와 비교하여상기 소비동향 지수를 산출하고, 상기 소비동향 지수 및 상기 정형 데이터를 상기 분석 모델의 입력값으로 이용하여 상기 소비동향 예측 지수를 생성하도록 구성된 머신러닝부를 포함하는 소비동향 예측 지수 생성 시스템."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 머신러닝부는, 상기 분석 모델에 대한 입력 데이터의 변화에 기초한 시뮬레이션을 통하여 상기 대상 상품또는 브랜드에 연관된 소비동향 시뮬레이션 정보를 생성하도록 구성된 시뮬레이션부를 포함하는 소비동향 예측지수 생성 시스템."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 텍스트 마이닝부는, 상기 소셜 데이터로부터 미리 설정된 속성어를 추출하고, 상기 소셜 데이터에서 상기속성어가 포함된 리뷰의 특성을 긍정 또는 부정으로 분류하며, 긍정으로 분류된 리뷰에 상기 속성어가 포함된횟수에 기초하여 정의되는 만족 극성 및 부정으로 분류된 리뷰에 상기 속성어가 포함된 횟수에 기초하여 정의되는 불만족 극성을 이용하여 상기 소셜 평가 지수를 산출하도록 더 구성된 소비동향 예측 지수 생성 시스템. 공개특허 10-2021-0126473-3-청구항 6 제1항에 있어서,상기 정형 데이터는, 상기 상품 또는 브랜드에 연관된 단어의 언급 빈도에 기초한 시장 관심도 지수 및 상기 상품 또는 브랜드에 대한 소비자 반응에 연관된 소셜 평가 지수를 포함하는 소비동향 예측 지수 생성 시스템."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "소비동향 예측 지수 생성 시스템이 대상 상품 또는 브랜드에 연관된 소비 데이터 및 비정형의 소셜 데이터를 수신하는 단계; 상기 소비동향 예측 지수 생성 시스템이, 상기 소비 데이터를 이용하여 소비동향 지수를 생성하는 단계; 상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터를 정형 데이터로 변환하는 단계; 및 상기 소비동향 예측 지수 생성 시스템이, 학습 데이터로부터 추출된 상기 소비동향 지수 및 상기 정형 데이터를특징값으로 이용한 머신러닝에 의해 생성된 분석 모델을 이용하여, 상기 소비동향 지수 및 상기 정형 데이터로부터 상기 대상 상품 또는 브랜드의 소비동향 예측 지수를 생성하는 단계를 포함하는 소비동향 예측 지수 생성방법."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 소비동향 예측 지수를 생성하는 단계 전에, 상기 소비동향 예측 지수 생성 시스템이 외부 서버로부터 통계데이터를 수신하는 단계를 더 포함하며, 상기 분석 모델은 학습 데이터로부터 추출된 상기 통계 데이터를 더 이용하여 생성된 것인, 소비동향 예측 지수생성 방법."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 소비동향 지수를 생성하는 단계는, 상기 소비동향 예측 지수 생성 시스템이, 상기 소비 데이터를 미리 설정된 기준 시점의 데이터와 비교하여 상기 소비동향 지수를 산출하는 단계를 포함하는 소비동향 예측 지수 생성방법."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 정형 데이터로 변환하는 단계는, 상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터에 포함된 텍스트를 추출하는 단계;상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터로부터 추출된 텍스트의 분석을 통해, 상기 상품 또는 브랜드에 연관된 단어의 언급 빈도에 기초한 시장 관심도 지수를 산출하는 단계; 및상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터로부터 추출된 텍스트의 분석을 통해, 상기 상품 또는 브랜드에 대한 소비자 반응에 연관된 소셜 평가 지수를 산출하는 단계를 포함하는 소비동향 예측 지수 생성방법. 공개특허 10-2021-0126473-4-청구항 11 제10항에 있어서,상기 텍스트를 추출하는 단계는, 상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터로부터 미리 설정된속성어를 추출하는 단계를 포함하며, 상기 소셜 평가 지수를 산출하는 단계는, 상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터에서 상기 속성어가 포함된 리뷰의 특성을 긍정 또는부정으로 분류하는 단계; 및 상기 소비동향 예측 지수 생성 시스템이, 상기 분류하는 단계에서 긍정으로 분류된 리뷰에 상기 속성어가 포함된 횟수에 기초하여 정의되는 만족 극성, 및 상기 분류하는 단계에서 부정으로 분류된 리뷰에 상기 속성어가 포함된 횟수에 기초하여 정의되는 불만족 극성을 이용하여 상기 소셜 평가 지수를 산출하는 단계를 포함하는 소비동향 예측 지수 생성 방법."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 소비동향 예측 지수 생성 시스템이, 상기 분석 모델에 대한 입력 데이터의 변화에 기초한 시뮬레이션을 통하여 상기 대상 상품 또는 브랜드에 연관된 소비동향 시뮬레이션 정보를 생성하는 단계를 더 포함하는 소비동향예측 지수 생성 방법."}
{"patent_id": "10-2020-0096539", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "하드웨어와 결합되어 청구항 제7항 내지 제12항 중 어느 한 항에 따른 소비동향 예측 지수 생성 방법을 실행하도록 컴퓨터로 판독 가능한 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2020-0096539", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "소비동향 예측 지수 생성 방법은, 대상 상품 또는 브랜드에 연관된 소비 데이터 및 비정형의 소셜 데이터를 수신 하는 단계; 상기 소비 데이터를 이용하여 소비동향 지수를 생성하는 단계; 상기 소셜 데이터를 정형 데이터로 변 환하는 단계; 및 학습 데이터로부터 추출된 상기 소비동향 지수 및 상기 정형 데이터를 특징값으로 이용한 머신 러닝에 의해 생성된 분석 모델을 이용하여, 상기 소비동향 지수 및 상기 정형 데이터로부터 상기 대상 상품 또는 브랜드의 소비동향 예측 지수를 생성하는 단계를 포함한다. 상기 소비동향 예측 지수 생성 방법에 의하면, 각 상 품군별 시장 동향을 정확히 반영하는 정량적인 빅데이터와 다수의 소비자 의견을 반영하고 있는 정성적인 빅데이 터를 수집하고, 이에 인공지능(Artificial Intelligence; AI) 기반 예측적 분석 방법을 적용함으로써, 각 상품 군이 현재 시장에서 소비되는 동향을 정확히 파악하고 나아가 향후 동향을 예측할 수 있다."}
{"patent_id": "10-2020-0096539", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "실시예들은 소비 데이터와 소셜(social) 데이터를 이용한 소비동향 지수 예측 방법과 이를 적용한 소비동향 예 측지수 생성 시스템 및 이를 위한 컴퓨터 프로그램에 관한 것이다. 보다 상세하게는, 실시예들은 컴퓨터에 의해 자동적으로 수행되는 소비 데이터와 소셜 데이터의 분석을 통한 소비 동향 지수 예측 기술에 대한 것이다."}
{"patent_id": "10-2020-0096539", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소비 동향은, 소비자 대상 설문조사와 같이 한정된 샘플 수와 설문지 길이의 제한을 갖는 정량적 방식 또는 소 수의 소비자를 관찰하거나 인터뷰하는 정성적 방식으로 데이터를 수집하는, 전형적인 스몰 데이터를 이용하여 측정된다. 가장 자주 사용되는 설문조사와 같은 접근 방법은 사람의 기억에 의존하여 소비 경험을 기록하는 방 식이기 때문에, 소비 동향을 정확히 측정했다는 정확성을 담보하기 어려울 뿐만 아니라, 설문지 길이의 제한성 으로 인해 다양한 관련 상품군에 대한 소비 동향 데이터를 수집하기 어려운 제한적 자료 수집 방법이다. 뿐만 아니라, 소비자 관찰과 같은 정성적 데이터 수집 방식은 소수의 관찰자의 주관적인 판단과 해석에 의한 편향성 (bias)으로 인해 데이터로서의 정확성에 문제가 제기되어 왔으며, 소수의 소비자 개인 또는 집단과의 인터뷰를 하는 또 다른 정성적 데이터 수집 방식은 지나치게 소수의 소비자 경험을 바탕으로 소비 동향을 측정하는 과잉 일반화의 문제를 갖고 있다. 최근에는, 소비자의 구매 행동을 전자적으로 기록하여 정량적으로 데이터화한 소비 트랜잭션 빅데이터 (transaction big data) 및 소셜(social) 미디어 또는 미디어 컨텐츠에 대한 댓글 등의 온라인 텍스트(online text)와 같은 대규모 정성적 빅데이터가 실시간으로 생산되고 있다. 또한 이와 같이 활용 가치가 높은 소비 동 향과 관련된 정량적 및 정성적 빅데이터에 적용 가능한 인공지능(Artificial Intelligence; AI) 기반의 분석 기술이 나날이 발전하고 있다. 그럼에도 불구하고, 기존의 소비 동향 데이터 수집 및 분석은 데이터 수집 비용이 크고 전문적인 데이터 분석 인력 및 시간 투입이 요구되는 특징으로 인해 최신 기술이 도입되지 못하고 있는 실 정이다. 결국, 종래의 시장 동향 분석 기술은 한정된 경로를 통하여 수집한 지엽적인 데이터를 기반으로 시장 동향을 추 정하고 가설적 제안을 하는 정도에 그치고 있으며, 소비 트랜잭션 빅데이터와 같은 정량적 빅데이터 및 및 온라 인 텍스트와 같은 정성적 빅데이터에 기반하여 소비 동향을 정확히 파악하거나 나아가 향후 동향을 예측할 수 있는 방법은 종래에는 존재하지 않았다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1679750호"}
{"patent_id": "10-2020-0096539", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 각 상품군별 시장 동향을 정확히 반영하는 정량적인 빅데이터와 다수의 소비자 의 견을 반영하고 있는 정성적인 빅데이터를 수집하고, 이에 인공지능(Artificial Intelligence; AI) 기반 예측적 분석 방법을 적용함으로써, 각 상품군이 현재 시장에서 소비되는 동향을 정확히 파악하고 나아가 향후 동향을 예측할 수 있는 소비동향 예측 지수 생성 방법과 이를 적용한 소비동향 예측 지수 생성 시스템 및 이를 위한 컴 퓨터 프로그램을 제공할 수 있다."}
{"patent_id": "10-2020-0096539", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 소비동향 예측 지수 생성 시스템은, 대상 상품 또는 브랜드에 연관된 소비 데이터 및 비정형의 소셜(social) 데이터를 수신하고, 상기 대상 상품 또는 브랜드의 소비동향 예측 지수를 제공하도록 구 성된 플랫폼(platform) 제공 서버; 및 상기 소비 데이터를 이용하여 소비동향 지수를 생성하고, 상기 소셜 데이 터를 정형 데이터로 변환하며, 학습 데이터로부터 추출된 상기 소비동향 지수 및 상기 정형 데이터를 특징값으 로 이용한 머신러닝(machine learning)에 의해 생성된 분석 모델을 이용하여, 상기 소비동향 지수 및 상기 정형 데이터로부터 상기 소비동향 예측 지수를 생성하도록 구성된 데이터 분석 서버를 포함한다. 일 실시예에 따른 소비동향 예측 지수 생성 시스템은, 상기 학습 데이터 또는 경제 또는 인구에 연관된 통계 데 이터를 저장하도록 구성된 데이터베이스 서버를 더 포함한다. 이때, 이때, 상기 분석 모델은 학습 데이터로부터 추출된 상기 통계 데이터를 더 이용하여 생성된 것이다. 일 실시예에서, 상기 데이터 분석 서버는, 자연어 처리에 의하여 상기 소셜 데이터에 포함된 텍스트를 추출하도 록 구성된 텍스트 마이닝(text mining)부; 및 머신러닝에 의해 상기 분석 모델을 생성하며, 상기 소비 데이터를 미리 설정된 기준 시점의 데이터와 비교하여 상기 소비동향 지수를 산출하고, 상기 소비동향 지수 및 상기 정형 데이터를 상기 분석 모델의 입력값으로 이용하여 상기 소비동향 예측 지수를 생성하도록 구성된 머신러닝부를 포함한다. 일 실시예에서, 상기 머신러닝부는, 상기 분석 모델에 대한 입력 데이터의 변화에 기초한 시뮬레이션을 통하여 상기 대상 상품 또는 브랜드에 연관된 소비동향 시뮬레이션 정보를 생성하도록 구성된 시뮬레이션부를 포함한다. 일 실시예에서, 상기 정형 데이터는, 상기 상품 또는 브랜드에 연관된 단어의 언급 빈도에 기초한 시장 관심도 지수 및 상기 상품 또는 브랜드에 대한 소비자 반응에 연관된 소셜 평가 지수를 포함한다. 일 실시예에서, 상기 텍스트 마이닝부는, 상기 소셜 데이터로부터 미리 설정된 속성어를 추출하고, 상기 소셜 데이터에서 상기 속성어가 포함된 리뷰의 특성을 긍정 또는 부정으로 분류하며, 긍정으로 분류된 리뷰에 상기 속성어가 포함된 횟수에 기초하여 정의되는 만족 극성 및 부정으로 분류된 리뷰에 상기 속성어가 포함된 횟수에 기초하여 정의되는 불만족 극성을 이용하여 상기 소셜 평가 지수를 산출하도록 더 구성된다.본 발명의 또 다른 측면에 따른 소비동향 예측 지수 생성 방법은, 소비동향 예측 지수 생성 시스템이 대상 상품 또는 브랜드에 연관된 소비 데이터 및 비정형의 소셜 데이터를 수신하는 단계; 상기 소비동향 예측 지수 생성 시스템이, 상기 소비 데이터를 이용하여 소비동향 지수를 생성하는 단계; 상기 소비동향 예측 지수 생성 시스템 이, 상기 소셜 데이터를 정형 데이터로 변환하는 단계; 및 상기 소비동향 예측 지수 생성 시스템이, 학습 데이 터로부터 추출된 상기 소비동향 지수 및 상기 정형 데이터를 특징값으로 이용한 머신러닝에 의해 생성된 분석 모델을 이용하여, 상기 소비동향 지수 및 상기 정형 데이터로부터 상기 대상 상품 또는 브랜드의 소비동향 예측 지수를 생성하는 단계를 포함한다. 일 실시예에 따른 소비동향 예측 지수 생성 방법은, 상기 소비동향 예측 지수를 생성하는 단계 전에, 상기 소비 동향 예측 지수 생성 시스템이 외부 서버로부터 경제 또는 인구에 연관된 통계 데이터를 수신하는 단계를 더 포 함한다. 이때, 상기 분석 모델은 학습 데이터로부터 추출된 상기 통계 데이터를 더 이용하여 생성된 것이다. 일 실시예에서, 상기 소비동향 지수를 생성하는 단계는, 상기 소비동향 예측 지수 생성 시스템이, 상기 소비 데 이터를 미리 설정된 기준 시점의 데이터와 비교하여 상기 소비동향 지수를 산출하는 단계를 포함한다. 일 실시예에서, 상기 정형 데이터로 변환하는 단계는, 상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이 터에 포함된 텍스트를 추출하는 단계; 상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터로부터 추출된 텍스트의 분석을 통해, 상기 상품 또는 브랜드에 연관된 단어의 언급 빈도에 기초한 시장 관심도 지수를 산출하 는 단계; 및 상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터로부터 추출된 텍스트의 분석을 통해, 상기 상품 또는 브랜드에 대한 소비자 반응에 연관된 소셜 평가 지수를 산출하는 단계를 포함한다. 일 실시예에서, 상기 텍스트를 추출하는 단계는, 상기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터로 부터 미리 설정된 속성어를 추출하는 단계를 포함한다. 또한, 이때 상기 소셜 평가 지수를 산출하는 단계는, 상 기 소비동향 예측 지수 생성 시스템이, 상기 소셜 데이터에서 상기 속성어가 포함된 리뷰의 특성을 긍정 또는 부정으로 분류하는 단계; 및 상기 소비동향 예측 지수 생성 시스템이, 상기 분류하는 단계에서 긍정으로 분류된 리뷰에 상기 속성어가 포함된 횟수에 기초하여 정의되는 만족 극성, 및 상기 분류하는 단계에서 부정으로 분류 된 리뷰에 상기 속성어가 포함된 횟수에 기초하여 정의되는 불만족 극성을 이용하여 상기 소셜 평가 지수를 산 출하는 단계를 포함한다. 일 실시예에 따른 소비동향 예측 지수 생성 방법은, 상기 소비동향 예측 지수 생성 시스템이, 상기 분석 모델에 대한 입력 데이터의 변화에 기초한 시뮬레이션을 통하여 상기 대상 상품 또는 브랜드에 연관된 소비동향 시뮬레 이션 정보를 생성하는 단계를 더 포함한다. 본 발명의 일 측면에 따른 컴퓨터 프로그램은, 하드웨어와 결합되어 전술한 실시예들에 따른 소비동향 예측 지 수 생성 방법을 실행하기 위한 것으로서 컴퓨터로 판독 가능한 기록매체에 저장될 수 있다."}
{"patent_id": "10-2020-0096539", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 측면에 따른 소비동향 예측 지수 생성 시스템 및 방법에 의하면, 각 상품군별 시장 동향을 정확히 반영하는 정량적인 빅데이터와 다수의 소비자 의견을 반영하고 있는 정성적인 빅데이터를 수집하고, 이에 연구 자 편향성을 최소화할 수 있는 인공지능(Artificial Intelligence; AI) 기반 예측적 분석 방법을 적용함으로써, 각 상품군이 현재 시장에서 소비되는 동향을 정확히 파악하고 나아가 향후 동향을 예측할 수 있는 이점이 있다."}
{"patent_id": "10-2020-0096539", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 도면을 참조하여 본 발명의 실시예들에 대하여 상세히 살펴본다. 도 1은 일 실시예에 따른 소비동향 예측 지수 생성 시스템의 예시적인 아키텍처(architecture)를 나타내는 블록 도이다. 도 1을 참조하면, 본 실시예에 따른 소비동향 예측 지수 생성 시스템은 하나 이상의 사용자의 사용자 장치 로부터의 요청에 대한 응답으로, 상품 또는 브랜드에 대한 소비동향 예측 지수를 사용자 장치에 제공하도 록 구성된다. 또한, 소비동향 예측 지수 생성 시스템은 소비동향의 예측을 위한 소비 데이터 및 소셜 (social) 데이터를 사용자 장치 및/또는 외부 서버로부터 수신할 수 있다. 본 명세서에서 상품 또는 브랜드란, 소비동향 예측 지수를 생성하고자 하는 대상이 되는 제품이나 서비스를 특 정할 수 있는 임의의 분류를 지칭하는 것으로서, 어느 하나의 소비 품목을 지칭하는 것일 수도 있고, 동일 사업 자에 의해 제공되는 일련의 제품 또는 서비스의 그룹을 지칭하는 것일 수도 있다. 사용자들은 스마트폰(smartphone) 등 이동 통신 단말기, 개인용 컴퓨터(personal computer), PDA(personal digital assistant), 태블릿(tablet), IPTV(Internet Protocol Television) 등을 위한 셋톱박스(set-top box) 또는 네트워크 서버 등 임의의 컴퓨팅 장치인 사용자 장치를 이용하여 소비동향 예측 지수 생성 시스템을 이용할 수 있다. 사용자 장치를 이용하여 소비동향 예측 지수 생성 시스템을 이용하는 사용자들은, 예컨 대, 생활 소비재 중소기업, 마케팅 지식 서비스 기업, 리서치 지식 서비스 기업, 연구소 또는 기관 등일 수 있 으나, 이에 한정되는 것은 아니다. 일 실시예에서, 소비동향 예측 지수 생성 시스템은 웹 서비스를 제공하는 웹 서버(web server)이며, 사용 자들은 사용자 장치에서 실행되는 웹 브라우저(web browser)를 통하여 웹 서비스에 접속함으로써 소비동 향 예측 지수 생성 시스템을 이용할 수 있다. 예를 들어, 소비동향 예측 지수 생성 시스템은 사용자들이 상품 또는 브랜드에 관련된 데이터를 업로드하고 관련 시장동향에 대해 자동으로 생성된 예측 정보를 검색 및 열람할 수 있는 웹 포털(web portal) 환경을 제공할 수 있다. 도면에 도시된 사용자 장치의 형태 및 수는 예시적인 것으로서, 이는 소비동향 예측 지수 생성 시스템과 관련하여 동작하는 장치의 형태 또는 개수, 또는 소비동향 예측 지수 생성 시스템을 이용하는 사용자의 수를 한정하는 것이 아니라는 점이 용이하게 이해될 것이다. 일 실시예에서, 소비동향 예측 지수 생성 시스템은 아키텍처의 측면에서 비즈니스 레이어(business layer), 빅데이터(big data) 분석 레이어, 및 데이터베이스 레이어로 구분될 수 있다. 일 실시예에서, 소비동향 예측 지 수 생성 시스템은 비즈니스 레이어에 해당하는 플랫폼(platform) 제공 서버 및 빅데이터 분석 레이어에 해당하는 데이터 분석 서버를 포함할 수 있다. 또한, 소비동향 예측 지수 생성 시스템은 데이터베이스 레이어에 해당하는 데이터베이스 서버를 더 포함할 수도 있다. 전술한 각각의 서버는 후술하는 하나 이상의 기능 부(unit)를 포함할 수 있다. 본 명세서에 기재된 장치들은 전 적으로 하드웨어이거나, 또는 부분적으로 하드웨어이고 부분적으로 소프트웨어인 측면을 가질 수 있다. 예컨대, 소비동향 예측 지수 생성 시스템 및 이를 구성하는 각 서버(31-33)에 포함된 모듈 또는 부는, 특정 형식 및 내용의 데이터를 전자통신 방식으로 주고받기 위한 장치 및 이에 관련된 소프트웨어를 통칭할 수 있다. 본 명세 서에서 \"부\", \"모듈\", \"서버\", \"시스템\", \"플랫폼\", \"장치\" 또는 \"단말\" 등의 용어는 하드웨어 및 해당 하드웨 어에 의해 구동되는 소프트웨어의 조합을 지칭하는 것으로 의도된다. 예를 들어, 여기서 하드웨어는 CPU 또는 다른 프로세서(processor)를 포함하는 데이터 처리 기기일 수 있다. 또한, 하드웨어에 의해 구동되는 소프트웨 어는 실행중인 프로세스, 객체(object), 실행파일(executable), 실행 스레드(thread of execution), 프로그램 (program) 등을 지칭할 수 있다. 또한, 본 명세서에서 소비동향 예측 지수 생성 시스템을 구성하는 각 서버(31-33) 및 이들에 포함된 각 부는 반드시 물리적으로 구분되는 별개의 구성요소를 지칭하는 것으로 의도되지 않는다. 즉, 도 1에서 소비동향 예측 지수 생성 시스템의 플랫폼 제공 서버, 데이터 분석 서버 및 데이터베이스 서버는 서로 구분되 는 별개의 블록으로 도시되었으나, 이는 소비동향 예측 지수 생성 시스템을 이에 의해 실행되는 동작에 의해 기능적으로 구분한 것이다. 실시예에 따라서는 전술한 각 서버 중 일부 또는 전부가 동일한 하나의 장치 내에 집적화될 수 있으며, 또는 하나 이상의 서버가 다른 부와 물리적으로 구분되는 별개의 장치로 구현될 수도 있다. 예컨대, 소비동향 예측 지수 생성 시스템의 각 서버 또는 이들에 포함된 각 부는 분산 컴퓨팅 환경 하 에서 서로 통신 가능하게 연결된 컴포넌트들일 수도 있다. 플랫폼 제공 서버는, 예컨대 웹 서비스를 통하여, 사용자 장치와 통신하며 사용자 장치에 소비동 향 예측 지수를 포함한 예측 정보를 제공하는 기능을 한다. 이상의 동작을 위하여, 플랫폼 제공 서버는 사용자 장치로부터 소비 데이터를 수신할 수 있다. 이때, 소비 데이터에는 시장 구조 및 소비자 프로파일 (profile) 등에 대한 정보가 포함될 수도 있다. 플랫폼 제공 서버는, 소비 데이터에 더하여, 소셜 데이터와, 또는/또한 경제 또는 인구에 관련된 통계 데이터를 사용자 장치로부터 더 수신할 수도 있다. 그러나, 다른 실시예에서 플랫폼 제공 서버는 소비 활동 관련 빅데이터를 제공하는 외부 사업자의 서버나, 신문, 잡지, 블로그, 포털 등 미디어 서버, 또는 통계 정보나 소셜 정보 등을 제공하는 공공 서버와 같은 외부 서버(미도시)로부터 전술한 정보들을 수신할 수도 있다. 또한, 플랫폼 제공 서버는, 소비 데이터의 데이터 셋(data set) 및 시스템 자원(resource)에 대한 관리, 데 이터 셋 이력 관리 및 통계 등을 위한 출력 데이터를 사용자에게 제공하고, 사용자가 데이터베이스 서버에 저장된 데이터를 메타데이터(metadata), 태그(tag), 또는 패싯(facet) 필터와 같은 필터 등을 기반으로 검색할 수 있는 기능을 제공할 수 있다. 나아가, 플랫폼 제공 서버는 사용자가 소비동향 예측 지수 생성 시스템에 저장된 데이터 셋을 수신, 공 유 또는 그 외 다른 방식으로 확장된 이용이 가능한 기능을 제공한다. 예컨대, 일 실시예에서 플랫폼 제공 서버 는 사전에 정의된 개방형 API(Application Programming Interface)를 통한 사용자 장치로부터의 요청에 대한 응답으로 데이터 셋을 제공할 수도 있다. 나아가, 플랫폼 제공 서버는 소비동향 예측 지수 생성 시스 템이 제공하는 소비동향 예측 지수 및 이의 가공 데이터 등에 접근 가능한 사용자 또는 사용자들의 조직이나 그룹을 정의하는 권한 관리 기능을 수행할 수도 있다. 일 실시예에서, 플랫폼 제공 서버는 데이터 전처리부, 데이터 응용부 및 데이터 시각화부를 포함한다. 데이터 전처리부는 사용자 장치 또는 외부 서버로부터 수신된 정보를 이용하여 시장동향을 예측하기 위하여 소비 데이터를 구조화된(structured) 데이터로 변환하는 전처리를 수행할 수 있다. 본 명세서에서 소비 데이터란, 분석의 대상이 되는 상품 또는 브랜드에 관련된 소비 활동 관련 데이터로서 매출 정보를 포함할 수 있다. 예컨대, 소비 데이터는 일정 기간 동안 대상 사용자들을 대상으로 수집된 거래 영수증 데이터일 수 있으나, 이에 한정되는 것은 아니다. 소비 데이터에 포함되는 매출 정보는 고객의 구매 행태를 나 타내는 임의의 정보로서, 결제 금액, 결제 횟수 및/또는 유효 고객 수 등을 포함할 수 있다. 한편, 소비 데이터 는 소비 활동에 관련된 메타데이터(meta data)를 더 포함할 수 있다. 메타데이터는 소비 활동의 결제 지역, 소 비자의 성별이나 연령 등과 같은 인구통계 정보를 포함할 수 있다. 본 명세서에서 소비 데이터를 구조화한다는 것은, 소비 활동에 대한 정보로부터 특정 상품 또는 브랜드에 연관 된 데이터를 대분류, 중분류 및 소분류 등으로 구분되는 상품의 카테고리별로 그룹화 또는 태깅(tagging)하거나, 또는/또한 메타데이터를 기반으로 구매자의 연령 및/또는 성별이나 결제 지역 등 소비자 를 정의하는 세그먼트(segment)별로 데이터를 그룹화 또는 태깅하는 것 등을 의미할 수 있다. 그러나 구조화 방 법은 이에 한정되는 것은 아니며, 구조화 방법은 소비동향 예측 지수를 생성하고자 하는 대상 상품 또는 브랜드 의 특정 방식이나 대상 세그먼트의 결정 방식에 따라 상이할 수 있다. 데이터 응용부는, 구조화된 소비 데이터를 데이터 분석 서버의 머신러닝(machine learning) 기반 분석 모델에 적용함으로써 이에 대한 피드백으로 제공되는 예측 정보(예컨대, 소비동향 예측 지수)를 수신하는 역할 을 한다. 데이터 시각화부는 데이터 응용부를 통해 수신된 예측 정보를 사용자에게 제공되기 위한 시각화된 형 태로 가공하는 기능을 할 수 있다. 예를 들어, 데이터 시각화부는 소비동향 예측 지수를 제품군별 또는 브 랜드별로 정리된 표나 그래프 등으로 가공하거나, 대상 소비자 세그먼트에 연관된 표나 그래프 등으로 가공하여 제공함으로써 분석 결과를 시각화할 수 있다. 일 예로, 데이터 시각화부는 대상 세그먼트를 각 지역(예컨 대, 시, 구 등)으로 하여 지역별 시장 동향과 이의 예측 정보를 지도 형태로 나타낼 수 있다. 그러나 이는 예시 적인 것으로서, 다른 실시예에서 대상 세그먼트는 구매자의 성별이나 연령과 같은 구매자 특성, 주/월/분기/반 기와 같은 시점 등 다른 정보를 기준으로 결정될 수도 있다. 데이터베이스 서버는, 플랫폼 제공 서버 또는 데이터 분석 서버를 통해 수집되는 소비 데이터, 소 셜 데이터, 및/또는 경제 또는 인구 관련 통계 데이터들이 저장되기 위한 장치이다. 일 실시예에서, 데이터베이 스 서버는 수집된 정보들을 공공 또는 상용 데이터, 소비자 및 소셜 네트워크 서비스(Social Network Service; SNS) 데이터, 용어 데이터 및 파라미터(parameter) 데이터로 분류하여 저장할 수도 있다. 용어 데이터는 속성어를 정의하기 위한 데이터를 지칭하며, 파라미터 데이터는 머신러닝 분석 모델 의 학습을 통하여 얻어진 분석 파라미터들을 지칭한다.데이터베이스 서버는 저장된 데이터에 대해 사용자에 의한 데이터의 열람 및 이용이 가능하도록 할 수 있다. 예컨대, 본 실시예에 따른 소비동향 예측 지수 생성 시스템은 클라우드(cloud) 기반의 데이터베이스 서버를 포함하는 오픈 플랫폼으로 구현될 수 있다. 또는, 소비동향 예측 지수 생성 시스템은 데이터베이 스 서버와 병행하여 또는 이를 대체하여 클라우드 서버 등 외부 데이터 저장소를 이용하여 전술한 데이터들 을 저장할 수도 있다. 데이터 분석 서버는, 사용자 장치 및/또는 외부 서버(미도시)로부터 수집되어 데이터베이스 서버에 저장된 정보들을 이용하여, 사용자 장치의 요청에 대한 응답으로 대상 상품 또는 브랜드에 연관된 소비동향 예측 지수를 생성하기 위한 장치이다. 이상의 동작을 위하여, 데이터 분석 서버는, 머신러닝 기반의 분석 모델을 학습 데이터를 이용하여 학습시키고, 학습된 분석 모델을 이용하여 대상 상품 또는 브랜드의 소비동향의 예측 정보를 도출하기 위한 머신러닝부를 포함할 수 있다. 일 실시예에서, 머신러닝부는 데이터 예측부를 포함한다. 데이터 예측부는, 학습 데이터를 이 용하여 학습된 분석 모델에 대상 상품 또는 브랜드의 소비동향 지수 테스트 데이터 및 소셜 평가지수 테스트 데 이터를 입력하여, 지수 예측적 머신러닝 분석을 통해 대상 상품 또는 브랜드의 소비동향 예측 지수를 산출하는 역할을 할 수 있다. 일 실시예에서, 머신러닝부는 클러스터링(clustering)부를 더 포함한다. 클러스터링부는 특정 상품 또는 브랜드에 연관된 예측 정보를 대분류, 중분류 및 소분류 등 카테고리별로 그룹화하거나, 구매자의 연 령, 성별 및/또는 결제 지역 등에 의해 정의되는 세그먼트 별로 예측 정보를 그룹화함으로써 세분화된 예측 정 보나 이에 따른 시장 기회에 대한 분석 결과를 생성할 수 있도록 하는 역할을 한다. 일 실시예에서, 머신러닝부는 시뮬레이션부를 더 포함한다. 시뮬레이션부는 머신 러닝 분석 모델에 대한 입력 데이터의 변화에 기초하여 소비동향 시뮬레이션 정보를 생성할 수 있다. 소비동향 시뮬레이션 정보란, 입력 데이터의 변화로부터 예측되는 미래의 소비동향 정보를 지칭하는 것으로서, 향후 소비동향 지수의 증가가 예상되는 고객 세그먼트에 대한 정보 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 과거의 소비동향 데이터에서 제1 고객 세그먼트에서 나타난 소비 동향이 이후 제2 고객 세그먼트에서 재생산되 는 경향이 있다고 가정할 경우, 시뮬레이션부는 머신러닝 분석 모델에 대한 입력 데이터의 변화에서 제1 고객 세그먼트의 소비 동향을 산출하고 이를 기반으로 제2 고객 세그먼트의 소비동향 변화를 예측하여 이를 소 비동향 시뮬레이션 정보로 생성할 수 있다. 시뮬레이션부에 의한 시뮬레이션은 클러스터링부에 의하여 그룹화된 각 상품 또는 브랜드 카테고리, 또는 각 소비자 세그먼트 별로 이루어질 수 있다. 또한, 시뮬레이션부에 의한 시뮬레이션은 사 전에 정의된 규칙(rule) 기반으로 이루어질 수도 있으며, 또는 머신러닝부의 학습된 분석 모델을 이용한 머신러닝 방식으로 이루어질 수도 있고, 특정 시뮬레이션 기법에 의한 것으로 제한되지 않는다. 일 실시예에서, 소비동향 예측 지수는, 소비 빅데이터의 시계열적 동향에 연관된 자료인 소비동향 지수와, 소셜 미디어 등 비정형 데이터로부터 온라인 텍스트(online text)를 추출하고 이를 변환하여 생성된 정형 데이터를 분석 모델에 입력되는 특징(feature)값으로 이용하여 생성될 수도 있다. 데이터 분석 서버는, 소셜 데이터 로부터 텍스트를 추출하기 위한 텍스트 마이닝(text mining)부를 더 포함할 수도 있다. 나아가 일 실시예에서, 데이터 분석 서버는 외부 장치 또는 서버와 통신 세션을 형성함으로써 소셜 데이터 및/또는 경제나 인구 관련 통계 데이터 등을 수신하기 위한 통신부를 더 포함할 수도 있다. 또한, 데이터 분석 서버는 데이터 예측부가 사전에 정의된 규칙(rule)에 기반하여 소비동향 지수의 산출 또는 비정 형 데이터의 정형 데이터 변환 등을 수행할 수 있도록 미리 설정된 규칙 기반 정보가 저장된 저장부를 더 포함할 수도 있다. 도 2는 일 실시예에 따른 소비동향 예측 지수 생성 방법을 나타내는 순서도이다. 본 실시예에 따른 소비동향 예 측 지수 생성 방법은, 참조하여 전술한 실시예들에 따른 소비동향 예측 지수 생성 시스템을 이용하여 수행될 수 있다. 이하에서는, 설명의 편의를 위하여 도 1 및 도 2를 참조하여 본 실시예에 따른 소비동향 예측 지수 생 성 방법에 대하여 설명한다. 도 1 및 도 2를 참조하면, 실시예들에 따른 소비동향 예측 지수 생성 방법은 데이터 확보 단계(S1), 데이터 정 제 단계(S2), 데이터 분석 단계(S3) 및 분석 결과를 시각화하는 단계(S4)를 포함할 수 있다. 또한, 각각의 단계 들은 후술하는 것과 같이 하나 또는 복수의 세분화된 단계들로 이루어질 수 있다. 데이터 확보 단계(S1)는, 소비동향 예측을 위한 기초가 되는 데이터들을 하나 이상의 데이터 소스로부터 수집하 거나 또는 데이터를 구매하는 등의 방법으로 데이터를 수신하는 것을 의미한다. 예를 들어, 플랫폼 제공 서버 는 대형할인마트, 슈퍼마켓, 편의점, 백화점 등 오프라인 유통 채널로부터 거래 영수증 데이터를 수신할 수 있다. 또한, 플랫폼 제공 서버는 면세점, 양판점, 온라인 쇼핑몰 등 전술한 오프라인 유통 채널과 상이한 형태의 소비 채널 또는 온라인 소비 채널로부터 소비 데이터를 수신할 수도 있다. 이러한 소비 데이터는, 거래가 발생하는 시점에 판매시점관리(Point-Of-Sales; POS) 장치 등을 이용한 자동화된 방식으로 생성되며, 소정의 저장 공간에 데이터베이스의 형태로 저장된 정형화된 데이터를 지칭할 수 있다. 또 한, 소비 데이터는 소비동향의 분석 및 예측을 위하여 거래된 상품 및 서비스의 품명, 거래 일시, 거래 장소, 거래 금액 및/또는 거래 개수 등의 정보를 포함할 수 있다. 한편, 플랫폼 제공 서버는 소비자의 VOC(Voice of Customer)와 같은 소셜 데이터를 더 수신할 수 있다. 소 셜 데이터는 웹(web) 방식 또는 애플리케이션(또는, 앱(app))을 이용한 크롤링(crawling) 또는 스크래핑 (scraping) 방식으로 주기적으로 수집될 수 있다. 예를 들어, 소셜 데이터는 블로그 또는 카페의 게시글이나 댓 글, 인터넷 뉴스, 기사 또는 팟캐스트(podcast) 등에 대한 사용자의 댓글, 또는 트위터, 인스타그램 등 SNS 서 비스로부터 수신되는 데이터들을 포함할 수 있으나, 이에 한정되는 것은 아니다. 또한, 소셜 데이터는 웹(web) 게시를 위한html 문서, PDF(Portable Document Format) 등 전자문서 형식의 데이터 파일, 이미지 파일 및 동영 상 파일 중 적어도 하나를 포함할 수도 있다. 데이터 정제 단계(S2)에서는, 데이터 확보 단계(S1)에서 수집된 소비 데이터 및 소셜 데이터를 정제하여 데이터 베이스 서버에 저장하고, 정제된 데이터들에 머신러닝 분석 모델을 적용하여 향후 소비동향을 예측할 수 있 도록 데이터를 전처리하는 과정을 수행할 수 있다. 도 3은 일 실시예에 따른 소비동향 예측 지수 생성 방법의 데이터 정제 과정의 각 단계를 나타내는 순서도이다. 도 1 및 도 3을 참조하면, 플랫폼 제공 서버의 데이터 전처리부는, 소비 데이터를 대상 상품 또는 브 랜드의 카테고리별로 그룹화 또는 태깅하거나, 구매자의 연령, 성별, 결제 지역 등에 기초한 세그먼트 별로 그 룹화하거나 태깅하는 등 구조화를 통하여, 분석에 필요한 정보를 추출할 수 있다(S21). 또한 데이터 전처리부 는 블로그, 까페, 뉴스, 기사 또는 SNS 서비스 등을 제공하는 외부 서버(미도시) 등로부터 크롤링 또는 스 크래핑된 데이터에서 필요한 부분을 추출하는 방식으로 소셜 데이터를 추출할 수 있다(S21). 다음으로, 데이터 분석 서버는 소비 데이터 및 소셜 데이터로부터 추출된 정보들을 머신러닝을 위한 데이터 로 정제하는 과정을 수행할 수 있다. 특히, 데이터 분석 서버는 소비 데이터를 이용하여 소비동향 지수를 생성할 수 있다. 또한, 데이터 분석 서버는 비정형 데이터인 소셜 데이터를 전술한 과정에서 추출된 키워드 를 기반으로 정형 데이터로 변환할 수 있다. 먼저, 소비동향 지수 산출 과정에 대해 설명하면, 본 명세서의 소비동향 지수란 상품 또는 브랜드를 기준으로 구분되는 그룹에 따라 소비 데이터의 거래 금액을 합산한 것을 소정의 기준 시점의 데이터와 비교하여 생성되는 것이다. 이를 위하여, 데이터 분석 서버의 데이터 예측부는 먼저 기준시점의 데이터인 기준 데이터를 결정하고(S22), 기준 데이터와의 비교를 통하여 분석 대상 시점의 소비동향 지수를 산출할 수 있다(S23). 구체적으로, 소비동향 지수(Market Index; MI)는 기준 시점의 상품 구매액을 100이라고 할 때 분석 대상 시점의 상품 구매액의 규모를 환산한 수치로, 기준 시점의 해당 상품 구매액을 Pref, 분석 대상 시점의 상품 구매액을 Pi 라 할 경우 하기 수학식 1과 같이 정의될 수 있다. [수학식 1] MI = Pi / Pref 다음으로, 소셜 데이터를 정형화하는 과정에 대하여 설명하면, 비정형인 소셜 데이터를 정형 데이터로 변환하기 위하여 먼저 데이터 분석 서버의 텍스트 마이닝부는 소셜 데이터에 대해 자연어 분석(Natural Language Processing; NLP) 기법 기반의 분석을 실시할 수 있다(S24). 본 명세서에서 자연어 처리란, 텍스트, 이미지 또는 동영상 등의 형태를 가지는 소셜 데이터에 포함된 표현들을 텍스트 데이터로 변환하고, 형태소 분 석을 통하여 텍스트 데이터로부터 시장동향에 관련하여 미리 설정된 하나 이상의 키워드를 추출하는 것을 의미한다. 다음으로, 데이터 예측부는 분석하고자 하는 상품 또는 브랜드에 관련된 속성어를 소셜 데이터로부터 추 출할 수 있다(S25). 이때 속성어란, 분석 대상 상품 또는 브랜드 자체가 소셜 데이터 내에서 언급된 것을 확인 할 수 있는 상품 또는 브랜드의 이름일 수도 있으며, 또는 대상 상품 또는 브랜드의 특정 측면을 확인하기 위하 여 상품 또는 브랜드의 세부 모델명이나, 생산년도, 판매점 위치, 제품 특성 등을 지칭하는 단어일 수도 있다. 다음으로, 데이터 분석 서버의 데이터 예측부는 소셜 데이터에 포함된 리뷰(review)들에 대하여 이를 긍정 또는 부정으로 분류하는 과정을 수행할 수 있다(S26). 이때, 리뷰란 데이터 형식에 무관하게 소셜 데이터 에 포함되며 상품 또는 브랜드에 대한 사용자의 감정을 나타내는 데이터 객체들을 의미하는 것으로서, 까페 또 는 블로그의 게시글에 포함된 각 문장이나, 인터넷 신문, 방송, 잡지, 라디오 등 미디어 서비스에 게시된 사용 자 댓글의 각 문장, 또는 사용자가 SNS 서비스에 업로드한 게시글이나 댓글의 각 문장이 본 명세서에 기재된 리 뷰에 해당될 수 있다. 예를 들어, 데이터 예측부는 각 리뷰에 포함된 키워드마다 이를 긍정 또는 부정 중 어느 하나로 결정함으 로써, 각 리뷰를 긍정 또는 부정으로 분류할 수 있다. 예를 들어, 긍정의 키워드는 \"좋다\", \"싸다\", \"합리적이 다\", \"장점\", \"만족\", \"빠르다\" 등을 들 수 있으며, 부정의 키워드는 \"나쁘다\", \"비싸다\", \"불만\", \"단점\", \"느 리다\" 등을 들 수 있다. 데이터 분석 서버는 이러한 긍정 및 부정의 키워드를 정의한 테이블 등을 저장부 에 저장하고, 이를 이용하여 리뷰에 포함된 키워드 전체들을 평가함으로써 각 리뷰가 전체로서 긍정 리뷰 에 해당하는지 또는 부정 리뷰에 해당하는지를 결정할 수 있다. 다음으로, 데이터 예측부는 긍정 및 부정으로 분류된 각 리뷰와 이로부터 추출된 속성어들을 이용하여, 시장 관심도 지수 및 소셜 평가지수를 도출할 수 있다(S27). 즉, 비정형의 소셜 데이터가 이상에서 설명한 과정 을 통하여 정형 데이터인 시장 관심도 지수 및 소셜 평가지수로 변환될 수 있다. 구체적으로, 일 실시예에서 시장 관심도 지수는 상품 또는 서비스에 관련된 속성어의 언급 횟수, 문서 당 언급 빈도, 특정 시간 단위(예컨대, 1일)당 언급 빈도와 같은 발생 양을 점수화한 것이다. 예를 들어, 시장 관심도 지수는 속성어의 언급 횟수나 빈도 자체의 수치를 지칭하는 것일 수도 있으며, 또는 속성어의 언급 횟수나 빈도 를 소정의 기준 수치와의 비교를 통하여 비례적으로 나타낸 수치일 수도 있다. 다음으로, 일 실시예에서 소셜 평가지수란 상품 또는 브랜드에 대한 사용자들의 감정(예컨대, 만족 또는 불만족 등)을 점수로 수치화한 것으로서, 하기 수학식 2 및 수학식 3과 같이 각각 정의되는 만족 극성(Satisfied Polarity; SP) 및 불만족 극성(Dissatisfied Polarity; DP)을 이용하여 산출될 수 있다. 수학식 2 및 3에서 si 는 속성어 i가 긍정 리뷰에 나타난 횟수를 의미하며, di는 속성어 i가 부정 리뷰에 나타난 횟수를 의미한다. 또 한, 수학식 2 및 3에서 r은 분석된 리뷰의 총 개수를 나타낸다. [수학식 2] SP = si / r [수학식 3] DP = di / r 상기 수학식 2 및 수학식 3과 같이 정의되는 극성 개념을 통하여, 다수의 리뷰에 나타난 소비자들의 감성적 태 도를 수치화할 수 있다. 상품 또는 브랜드에 관련된 속성어 i가 복수 개일 경우, 만족 극성(SP)과 불만족 극성 (DP)은 각각의 속성어를 이용하여 도출된 극성 수치들의 합계 또는 평균으로 산출될 수도 있다. 다음으로, 소셜 평가지수(Social Evaluation Index; SEI)는 만족 극성(SP)과 불만족 극성(DP)의 차이를 이용하 여 정의될 수 있다. 또한, 소셜 평가지수는 대상 상품 또는 브랜드의 만족 극성 및 불만족 극성의 차이를, 대상 상품 또는 브랜드가 속하는 시장 전체의 평균적인 만족 극성과 불만족 극성의 차이와 비교하여 산출될 수도 있 다. 이때 시장이란, 대분류, 중분류 또는 소분류를 기준으로 대상 상품 또는 브랜드에 속하는 제품이나 서비스 전체를 지칭할 수 있다. 또한, 이때 시장은 분석 대상 상품 또는 브랜드에 연관된 특정 소비자 세그먼트를 지칭 하는 것일 수도 있다. 예컨대, 일 실시예에서, 소셜 평가지수는 하기 수학식 4와 같이 산출될 수 있다. 수학식 4에서 SP 및 DP는 각각 분석 대상 상품 또는 브랜드의 만족 극성과 불만족 극성을 나타내며, SPave 및 DPave는 각각 시장 평균 만족 극성 및 시장 평균 불만족 극성을 나타낸다. [수학식 4] SEI = (SPave - DPave) - (SP-DP) 수학식 4의 소셜 평가지수에서 SP와 DP의 차이는 만족 위치를 나타내고, 소셜 평가지수 전체는 시장 평균 만족 위치로부터 대상 상품 또는 브랜드의 만족 위치까지의 거리를 나타내는 것으로, 이 지수의 값이 클수록 시장 평 균에 비해 열위에 있는 것이므로, 대상 상품 또는 브랜드에 대한 잠재적인 개선의 여지가 큰 것으로 볼 수 있다. 일 실시예에서, 데이터 예측부는 대상 상품 또는 브랜드에 관련된 시장 관심도 지수 및 소셜 평가지수와 함께 연관어를 더 도출할 수도 있다(S27). 이때 연관어란, 소셜 데이터에 포함될 수 있는 속성어 중 소셜 데이 터의 분석 결과 대상 상품 또는 브랜드와 관련성이 깊은 것으로 결정된 데이터의 집합을 지칭한다. 예를 들어, 주류 상품에 대한 속성어인 \"거품\", \"알코올 지수\", \"목넘김\" 등 중에서 특정 주류 상품이 일정 수준 이상으로 \"거품\"이라는 속성어와 함께 언급되는 경우가 많았을 경우, \"거품\"이라는 속성어 자체, 또는 이와 함께 소셜 데 이터에 자주 등장하는 표현, 예컨대, \"거품 풍부함\" 등이 해당 주류 상품의 연관어로 결정될 수 있다. 상품 또는 브랜드에 대한 연관어는, 해당 상품 또는 브랜드에 대한 소비자들의 인식을 구조화하기 위한 용도로 사용될 수 있다. 예를 들어, 데이터 예측부는 상품 또는 브랜드별 연관어를 네트워크 구조도의 형태로 가 공하여 이를 활용하거나 사용자에게 제시할 수 있다. 나아가, 데이터 예측부는 상품 또는 브랜드에 대한 연관어를 머신러닝 분석 모델에 대한 입력 데이터 중 하나로 더 이용하여 후술하는 소비동향 예측 지수의 생성 과정을 수행할 수도 있다. 다시 도 1 및 도 2를 참조하면, 데이터 분석 단계(S3)에서는, 데이터 정제(S2) 단계에 의하여 전처리된 데이터 를 이용하여 머신러닝 기반의 학습 및 새로운 소비 데이터 및 소셜 데이터의 분석을 통한 소비동향 예측 지수의 생성 과정을 수행할 수 있다. 도 4는 일 실시예에 따른 소비동향 예측 지수 생성 방법의 데이터 분석 과정의 각 단계를 나타내는 순서도이다. 도 1 및 도 4를 참조하면, 데이터 분석 서버의 머신러닝부는 분석 모델의 학습을 위한 학습 데이터를 수신하고(S31), 수신된 학습 데이터로부터 특징값을 추출할 수 있다(S32). 학습 데이터란, 소비동향이 어떻게 변화하였는지가 사전에 알려져 있는 과거의 시계열적인 데이터로서, 소비 데이터 및 소셜 데이터의 추이에 연관 된 정보를 포함할 수 있다. 머신러닝을 위한 특징값은 소비 데이터 및 소셜 데이터로부터 추출되는 소비동향 지 수, 시장 관심도 지수 및 소셜 평가지수를 의미할 수도 있으며, 또는 이들 지수를 가공한 정보가 특징값으로 이 용될 수도 있다. 머신러닝부는, 전술한 특징값으로부터 머신러닝 학습 알고리즘을 통하여 분석 모델을 생성할 수 있다 (S33). 이때 머신러닝 알고리즘으로는 타임시리즈(time series), 신경망(neural net), 순환 신경망(Recurrent Neural Network; RNN) 등 공지된 또는 향후 개발될 머신러닝 알고리즘이 이용될 수 있다. 또한, 예측의 정확도 를 높이기 위하여 LSTM(Long Short Term Memory), 어텐션(attention), 트랜스포머(transformer)와 같은 시퀀스 -투-시퀀스(Sequence to Sequence) 딥러닝 알고리즘이 추가로 적용될 수도 있다. 그러나 이는 예시적인 것으로 서, 머신러닝부에 의한 분석 모델의 학습에 이용되는 머신러닝 또는 딥러닝 알고리즘은 전술한 것에 한정 되지 않는다. 일 실시예에서, 분석 모델의 학습은 하나의 머신러닝 알고리즘을 이용한 단일 모델링(single modeling) 방식으 로 이루어질 수 있다. 그러나, 다른 실시예에서는 단일 모델 시험(Single Modeling test)이 이루어진 후 아키텍 처의 변혀이나 앙상블(ensemble) 등의 복합 모델링을 적용하여 분석 모델에 대한 수정을 실시할 수도 있다 (S34). 나아가, 시퀀스-투-시퀀스 학습을 위해 RNN 알고리즘을 적용하고, 가중치 소멸 문제 발생 시에는 LSTM 알고리즘을 이용하며, 연산량 또는 병렬처리 문제 시 어텐션 및/또는 트랜스포머 알고리즘으로 이동하는 순서와 같이 복수의 머신러닝 알고리즘을 병렬적으로 또는 순차적으로 이용하여 학습이 이루어질 수도 있다. 일 실시예에서는, 소비 데이터 및 소셜 데이터에 더하여, 동일 시점의 경제 또는 인구 관련 통계 데이터가 학습 을 위한 특징값으로 더 이용될 수도 있다. 연령별 인구 구성이나 인구 변동 추이와 같은 인구 통계, 그리고 국가 또는 지역의 금리 변동이나 실업률 등 경제 통계는 소비자들의 소비 활동에 큰 영향을 미칠 수 밖에 없으므 로, 이러한 환경 통계 데이터를 특징값에 더 이용하여 학습을 수행함으로써 예측의 정확도를 높일 수 있다. 분석 모델에 대한 학습이 이루어진 후, 소비동향 예측 지수 생성 시스템의 플랫폼 제공 서버는 소비동향 을 예측하고자 하는 대상 상품 또는 브랜드에 연관된 소비동향 지수 테스트 데이터를 수신할 수 있다(S35). 대 상 상품 또는 브랜드의 소비동향 지수 테스트 데이터는 학습 데이터와 마찬가지로 머신러닝 분석 모델에 입력되 기 위한 특징값을 추출할 수 있는 정보로서, 예컨대, 대상 상품 또는 브랜드의 소비 데이터를 지칭할 수 있다. 또한, 플랫폼 제공 서버는 소비동향을 예측하고자 하는 대상 상품 또는 브랜드에 연관된 소셜 평가지수 테 스트 데이터를 수신할 수 있다(S36). 소셜 평가지수 테스트 데이터란, 대상 상품 또는 브랜드의 소셜 데이터 자 체, 또는 비정형인 대상 상품 또는 브랜드의 소셜 데이터를 변환한 정형 데이터를 지칭할 수 있다. 다음으로, 데이터 분석 서버의 머신러닝부는 대상 상품 또는 브랜드의 데이터로부터 추출된 특징값을 분석 모델에 입력하여 지수 예측적 머신러닝 분석을 실행함으로써, 대상 상품 또는 브랜드의 소비동향 예측 지 수를 산출할 수 있다(S37). 일 실시예에서는, 대상 상품 또는 브랜드의 데이터 외에 분석 대상 시점의 경제 또 는 인구 관련 통계 데이터를 분석 모델에 특징값으로 더 입력할 수도 있다. 이상의 과정에 의하여, 데이터 분석 서버는 대상 상품 또는 브랜드의 소비동향 예측 지수를 산출할 수 있다 (S38). 이때 산출되는 소비동향 예측 지수란, 미래의 특정 시점의 소비동향 지수에 대한 예측값을 포함할 수 있 다. 소비동향 지수는 기준 데이터 대비 비교 시점의 구매액으로 산출되므로, 특정 미래 시점에 대한 소비동향 예측 지수를 통하여 해당 시점의 예측된 판매 금액이나 횟수 등을 도출할 수 있다. 일 실시예에서, 데이터 분석 서버의 클러스터링부 및 시뮬레이션부는 소비동향 예측 지수를 기 초로 미래의 시장 기회에 대한 분석 결과를 생성할 수 있다. 예를 들어, 클러스터링부는 소비동향 예측 지수를 특정 제품군, 소비자 집단, 지역 등을 대상으로 세분화하여 도출할 수 있다. 또한, 시뮬레이션부(320 3)는 시뮬레이션을 통해 향후의 소비동향 증가가 예상되는 제품군이나 소비자 세그먼트를 도출하는 방식으로 시 장 기회를 예측할 수 있다. 또한, 클러스터링부 및 시뮬레이션부는 미리 설정된 또는 사용자에 의 해 입력된 시장 변화 조건을 기반으로 주어진 조건에서 제품군의 소비 변동에 대한 예측 분석을 실시할 수도 있 다. 다시 도 1 및 도 2를 참조하면, 이상의 과정에 의하여 생성된 소비동향 예측 지수를 포함한 예측 정보는, 사용 자 장치에 제공되기 위한 시각화된 데이터의 형태로 가공될 수 있다(S4). 즉, 예측 정보는 직관적인 데이터 이해를 위해 막대그래프, 파이그래프, 히트맵(heatmap) 등 다양한 시각화 방식에 의해 차트 및/또는 데이터 형 태로 제공되어, 사용자가 이들 화면을 통하여 데이터를 파악하고 통찰을 얻을 수 있도록 할 수 있다. 이상에서 설명한 실시예들에 따른 소비동향 예측 지수 생성 방법에 의한 동작은 적어도 부분적으로 컴퓨터 프로 그램으로 구현되고 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 실시예들에 따른 방법에 의한 동작을 구 현하기 위한 프로그램이 기록되고 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연 결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수도 있다. 또 한, 본 실시예를 구현하기 위한 기능적인 프로그램, 코드 및 코드 세그먼트(segment)들은 본 실시예가 속하는 기술 분야의 통상의 기술자에 의해 용이하게 이해될 수 있을 것이다. 이상에서 살펴본 본 발명은 도면에 도시된 실시예들을 참고로 하여 설명하였으나 이는 예시적인 것에 불과하며 당해 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 실시예의 변형이 가능하다는 점을 이해할 것이다. 그러나, 이와 같은 변형은 본 발명의 기술적 보호범위 내에 있다고 보아야 한다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2020-0096539", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 소비동향 예측 지수 생성 시스템의 예시적인 아키텍처(architecture)를 나타내는 블록 도이다. 도 2는 일 실시예에 따른 소비동향 예측 지수 생성 방법을 나타내는 순서도이다. 도 3은 일 실시예에 따른 소비동향 예측 지수 생성 방법의 데이터 정제 과정의 각 단계를 나타내는 순서도이다. 도 4는 일 실시예에 따른 소비동향 예측 지수 생성 방법의 데이터 분석 과정의 각 단계를 나타내는 순서도이다."}
