{"patent_id": "10-2023-0096479", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0015264", "출원번호": "10-2023-0096479", "발명의 명칭": "가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 장치", "출원인": "주식회사 인이지", "발명자": "김권호"}}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치가 가열로(furnace)의 최적 온도를 연산하는 방법에 있어서,운전자가 입력한 재료의 타겟 물성값을 획득하는 단계; 훈련이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터로부터 상기 가열로의 복수의 적정 후보 온도를 획득하는 단계-상기 제1 입력 데이터는 가열로에서 가열할 재료의 두께, 재료의 강종(steel grade), 가열로의 운전속도, 및 상기 타겟 물성값 중 적어도 하나를 변수로 포함함-;훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력 데이터로부터 재료의 예상 물성값을 획득하는 단계-상기제2 입력 데이터는 상기 훈련이 완료된 최적 온도 모델을 통하여 연산된 상기 적정 후보 온도, 가열로에서 가열할 재료의 두께, 재료의 강종, 및 가열로의 운전 속도 중 적어도 하나를 변수로 포함함-;상기 타겟 물성값과 상기 훈련이 완료된 물성 예측 모델을 통하여 연산된 상기 예상 물성값을 비교하여, 상기복수의 적정 후보 온도를 샘플링(sampling)하여 적어도 하나의 샘플링된 적정 후보 온도를 획득하는 단계; 상기 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 획득하고, 상기 열량 정보를 비교하여 상기 샘플링된 적정 후보 온도를 필터링하여 적어도 하나의 적정 온도들을 획득하는 단계; 상기 적정 온도들에 기반하여 최적 온도를 연산하는 단계; 및상기 연산된 최적 온도를 가열로의 설정 온도 값으로 설정을 지시하는 요청을 송신하는 단계를 포함하는, 가열로의 최적 온도를 연산하는 방법."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 복수의 적정 후보 온도를 샘플링하여 복수의 샘플링된 적정 후보 온도를 획득하는 단계는, 상기 타겟 물성값과 상기 예상 물성값을 비교하여, 상기 타겟 물성값과 상기 예상 물성값의 차이가 작은 순으로상기 복수의 적정 후보 온도들을 정렬하는 단계; 및상기 정렬 결과에 기반하여 미리 정해진 순위 내에 대응되는 적정 후보 온도들을 상기 샘플링된 적정 후보 온도로 결정하는 단계를 더 포함하는, 가열로의 최적 온도를 연산하는 방법."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 복수의 적정 후보 온도를 샘플링하여 복수의 샘플링된 적정 후보 온도를 획득하는 단계는, 상기 타겟 물성값과 상기 예상 물성값을 비교하여, 상기 타겟 물성값과 상기 예상 물성값의 차이를 연산하는 단계; 및상기 연산된 차이가 미리 정해진 값 이내에 대응되는 적정 후보 온도들을 상기 샘플링된 적정 후보 온도로 결정하는 단계를 더 포함하는, 공개특허 10-2025-0015264-3-가열로의 최적 온도를 연산하는 방법."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 샘플링된 적정 후보 온도를 필터링하여 복수의 적정 온도들을 획득하는 단계는, 상기 열량 정보에 근거하여 열량이 작은 순으로 상기 샘플링된 적정 후보 온도들을 정렬하는 단계; 및상기 정렬 결과에 기반하여 미리 정해진 순위 내에 대응되는 상기 샘플링된 적정 후보 온도들을 상기 복수의 적정 온도로 결정하는 단계를 더 포함하는, 가열로의 최적 온도를 연산하는 방법."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 적정 온도들에 기반하여 최적 온도를 연산하는 단계는, 상기 적정 온도들의 평균값을 상기 최적 온도로 연산하는 단계를 더 포함하는, 가열로의 최적 온도를 연산하는 방법."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 최적 온도 모델은, 재료의 두께, 재료의 강종, 가열로의 운전 속도, 및/또는 타겟 물성값 중 적어도 하나에 대한 제1 학습 데이터와 상기 제1 학습 데이터에 대응되는 가열로의 운전 온도로 구성된 학습 데이터 세트에 기반하여 훈련되되, 상기 제1 학습 데이터에 기반하여 상기 가열로의 운전 온도에 근사된 값을 출력하도록 상기 최적 온도 모델의파라미터가 갱신되어 훈련되는, 가열로의 최적 온도를 연산하는 방법."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 물성 예측 모델은, 재료의 두께, 재료의 강종, 가열로의 운전 속도, 및 가열로의 운전 온도 중 적어도 하나에 대한 제2 학습 데이터와 상기 제2 학습 데이터에 대응되는 운전 조건으로 재료를 열처리한 경우의 물성 정보로 구성된 학습 데이터세트에 기반하여 훈련되되, 상기 제2 학습 데이터에 기반하여 상기 물성 정보에 근사된 값을 출력하도록 상기 물성 예측 모델의 파라미터가갱신되어 훈련되는, 가열로의 최적 온도를 연산하는 방법."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,공개특허 10-2025-0015264-4-상기 타겟 물성값과 상기 예상 물성값은, 상기 가열로를 통하여 열처리된 재료의 인장 강도(tensile strength), 항복 강도(yield strength), 경도(hardness), 연신율(Elongation) 중 적어도 하나에 관한 것인, 가열로의 최적 온도를 연산하는 방법."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "컴퓨터에 제1 항 내지 제8 항 중 어느 하나의 항에 따른 방법을 실행시키기 위한 프로그램을 기록한 컴퓨터로읽을 수 있는 기록 매체."}
{"patent_id": "10-2023-0096479", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "가열로의 최적 온도를 연산하기 위한 전자 장치에 있어서,운전자가 입력한 재료의 타겟 물성값을 획득하는 송수신부; 및훈련이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터-상기 제1 입력 데이터는 가열로에서 가열할 재료의두께, 재료의 강종(steel grade), 가열로의 운전속도, 및 상기 타겟 물성값 중 적어도 하나를 변수로 포함함-로부터 상기 가열로의 복수의 적정 후보 온도를 획득하고, 훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력데이터-상기 제2 입력 데이터는 상기 훈련이 완료된 최적 온도 모델을 통하여 연산된 상기 적정 후보 온도, 가열로에서 가열할 재료의 두께, 재료의 강종, 및 가열로의 운전 속도 중 적어도 하나를 변수로 포함함-로부터 재료의 예상 물성값을 획득하고, 상기 타겟 물성값과 상기 훈련이 완료된 물성 예측 모델을 통하여 연산된 상기예상 물성값을 비교하여, 상기 복수의 적정 후보 온도를 샘플링하여 적어도 하나의 샘플링된 적정 후보 온도를획득하고, 상기 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 획득하고, 상기 열량 정보를비교하여 상기 샘플링된 적정 후보 온도를 필터링하여 적어도 하나의 적정 온도들을 획득하고, 상기 적정 온도들에 기반하여 최적 온도를 연산하고, 상기 연산된 최적 온도를 가열로의 설정 온도 값으로 설정을 지시하는 요청을 송신하도록 구성된 프로세서;를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법은, 운전자가 입력한 재료의 타겟 물성값을 획 득하는 단계; 훈련이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터로부터 상기 가열로의 복수의 적정 후 보 온도를 획득하는 단계; 훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력 데이터로부터 재료의 예상 물성 (뒷면에 계속)"}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 가열로의 운전을 최적화하기 위한 기술에 관한 것이다. 구체적으로 본 출원은 인공지능을 활용하여 가열로의 운전하기 위한 최적 온도를 연산하기 위한 기술에 관한 것이다."}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기술이 발전하면서 다양한 산업 분야에서 인공지능 기술들이 활용되고 있다. 특히 최근에는 인공지능 모델을 이용하여 철강 제품의 생산 공정의 운전을 최적화하기 위한 연구가 주목을 받고 있다. 목표하는 품질의 철강 제품을 생산하기 위해서는 가열로(Furnace)에서 적절한 열처리를 통하여 철 강판의 물성 변화가 수반되어야 한다. 다만 철 강판의 물성은 열처리에 대하여 선형적으로 변화하지 않으며 적절한 온도 이 상의 열처리가 이루어진 경우에 급격하게 변화하는 비선형 관계를 나타내며, 철 강판의 구성 성분, 철 강판의 두께, 또는 운전 환경과 같은 다양한 원인에 따라 열처리 온도가 물성 변화에 미치는 영향이 달라지는 특성을 보여 철 강판의 물성 변화를 야기하는 열처리가 정밀하게 이뤄지기 어렵다는 한계가 존재하였다. 나아가 열처리 가 운전자의 노하우에 의존하여 같은 철강 제품을 생산하더라도 운전자에 따라 설정되는 가열로의 온도나 운전 조건이 상이하여 철강 제품의 품질 안정성을 확보하는 것에 제약이 존재하였다. 이러한 문제를 해결하기 위하여 철강 공정을 최적화하는 기술이 개발되었으나, 기존의 철강 공정의 최적화 기술은 철강 공정을 안정적으로 제어하기 위한 목적으로만 이용될 뿐이었으며, 가열로의 최적의 운전 온도를 연산해주지는 못한다는 한계가 존재하 였다. 이에 철강 제품의 품질 안정성을 확보하면서도 열 효율을 높이기 위한 가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 장치의 개발이 요구되는 실정이다."}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 일 과제는, 목표하는 품질을 달성하면서도 가열로의 열 사용량을 감소시키기 위한 가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 전자 장치를 제공하는 것이다. 본 발명이 해결하고자 하는 과제가 상술한 과제로 제한되는 것은 아니며, 언급되지 아니한 과제들은 본 명세서"}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "및 첨부된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법은, 운전자가 입력한 재료의 타겟 물성값을 획 득하는 단계; 훈련이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터로부터 상기 가열로의 복수의 적정 후 보 온도를 획득하는 단계-상기 제1 입력 데이터는 가열로에서 가열할 재료의 두께, 재료의 강종(steel grade), 가열로의 운전속도, 및 상기 타겟 물성값 중 적어도 하나를 변수로 포함함-; 훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력 데이터로부터 재료의 예상 물성값을 획득하는 단계-상기 제2 입력 데이터는 상기 훈련이 완 료된 최적 온도 모델을 통하여 연산된 상기 적정 후보 온도, 가열로에서 가열할 재료의 두께, 재료의 강종, 및 가열로의 운전 속도 중 적어도 하나를 변수로 포함함-; 상기 타겟 물성값과 상기 훈련이 완료된 물성 예측 모델 을 통하여 연산된 상기 예상 물성값을 비교하여, 상기 복수의 적정 후보 온도를 샘플링하여 적어도 하나의 샘플 링된 적정 후보 온도를 획득하는 단계; 상기 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 획득하고, 상기 열량 정보를 비교하여 상기 샘플링된 적정 후보 온도를 필터링하여 적어도 하나의 적정 온도들 을 획득하는 단계; 상기 적정 온도들에 기반하여 최적 온도를 연산하는 단계; 및 상기 연산된 최적 온도를 가열 로의 설정 온도 값으로 설정을 지시하는 요청을 송신하는 단계를 포함할 수 있다. 본 출원의 일 실시예에 따른 전자 장치는, 운전자가 입력한 재료의 타겟 물성값을 획득하는 송수신부; 및 훈련 이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터-상기 제1 입력 데이터는 가열로에서 가열할 재료의 두 께, 재료의 강종(steel grade), 가열로의 운전속도, 및 상기 타겟 물성값 중 적어도 하나를 변수로 포함함-로부 터 상기 가열로의 복수의 적정 후보 온도를 획득하고, 훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력 데 이터-상기 제2 입력 데이터는 상기 훈련이 완료된 최적 온도 모델을 통하여 연산된 상기 적정 후보 온도, 가열 로에서 가열할 재료의 두께, 재료의 강종, 및 가열로의 운전 속도 중 적어도 하나를 변수로 포함함-로부터 재료 의 예상 물성값을 획득하고, 상기 타겟 물성값과 상기 훈련이 완료된 물성 예측 모델을 통하여 연산된 상기 예 상 물성값을 비교하여, 상기 복수의 적정 후보 온도를 샘플링하여 적어도 하나의 샘플링된 적정 후보 온도를 획 득하고, 상기 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 획득하고, 상기 열량 정보를 비 교하여 상기 샘플링된 적정 후보 온도를 필터링하여 적어도 하나의 적정 온도들을 획득하고, 상기 적정 온도들 에 기반하여 최적 온도를 연산하고, 상기 연산된 최적 온도를 가열로의 설정 온도 값으로 설정을 지시하는 요청 을 송신하도록 구성된 프로세서;를 포함할 수 있다."}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "본 발명의 과제의 해결 수단이 상술한 해결 수단들로 제한되는 것은 아니며, 언급되지 아니한 해결 수단들은 본"}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "명세서 및 첨부된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 전자 장치에 의하면, 최적 온도 모델과 물성 예측 모델을 이용하여 목표하는 물성 값을 달성하면서도 가열로의 최적의 운전 온도를 연산하는 효과가 제공될 수 있다. 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 전자 장치에 의하면, 최적 온도 모델과 물성 예측 모델을 통하여 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 이 용하여 최적 온도를 연산함으로써, 제품의 목표하는 물성 값을 달성하면서도 가열로의 열 효율을 개선하는 효과 가 제공될 수 있다. 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 전자 장치에 의하면, 인공지능 모델을 통하여 제품의 목표하는 물성 값을 고려하여 가열로의 최적 온도를 자동적으로 연산함으로써, 목표하는 물성 값을 가지는 제품을 안정적으로 생산하도록 가열로의 운전 온도를 제어하는 효과가 제공될 수 있 다."}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과가 상술한 효과들로 제한되는 것은 아니며, 언급되지 아니한 효과들은 본 명세서 및 첨부된 도면"}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0096479", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원의 상술한 목적, 특징들 및 장점은 첨부된 도면과 관련된 다음의 상세한 설명을 통해 보다 분명해질 것 이다. 다만, 본 출원은 다양한 변경을 가할 수 있고 여러 가지 실시예들을 가질 수 있는 바, 이하에서는 특정 실시예들을 도면에 예시하고 이를 상세히 설명하고자 한다. 명세서 전체에 걸쳐서 동일한 참조번호들은 원칙적으로 동일한 구성요소들을 나타낸다. 또한, 각 실시예의 도면 에 나타나는 동일한 사상의 범위 내의 기능이 동일한 구성요소는 동일한 참조부호를 사용하여 설명하며, 이에 대한 중복되는 설명은 생략하기로 한다. 본 출원과 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 출원의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 본 명세서의 설명 과정에서 이용되는 숫자(예를 들어, 제1, 제2 등)는 하나의 구성요소를 다른 구성요소와 구분하기 위한 식별기호에 불과하다. 또한, 이하의 실시예에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되 어 부여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다.이하의 실시예에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 이하의 실시예에서, 포함하다 또는 가지다 등의 용어는 명세서상에 기재된 특징, 또는 구성요소가 존재함을 의 미하는 것이고, 하나 이상의 다른 특징들 또는 구성요소가 부가될 가능성을 미리 배제하는 것은 아니다. 도면에서는 설명의 편의를 위하여 구성 요소들이 그 크기가 과장 또는 축소될 수 있다. 예컨대, 도면에서 나타 난 각 구성의 크기 및 두께는 설명의 편의를 위해 임의로 나타낸 것으로, 본 발명이 반드시 도시된 바에 한정되 지 않는다. 어떤 실시예가 달리 구현 가능한 경우에 특정한 프로세스의 순서는 설명되는 순서와 다르게 수행될 수도 있다. 예를 들어, 연속하여 설명되는 두 프로세스가 실질적으로 동시에 수행될 수도 있고, 설명되는 순서와 반대의 순 서로 진행될 수 있다. 이하의 실시예에서, 구성 요소 등이 연결되었다고 할 때, 구성 요소들이 직접적으로 연결된 경우뿐만 아니라 구 성요소들 중간에 구성 요소들이 개재되어 간접적으로 연결된 경우도 포함한다. 예컨대, 본 명세서에서 구성 요소 등이 전기적으로 연결되었다고 할 때, 구성 요소 등이 직접 전기적으로 연결 된 경우뿐만 아니라, 그 중간에 구성 요소 등이 개재되어 간접적으로 전기적 연결된 경우도 포함한다. 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법은, 운전자가 입력한 재료의 타겟 물성값을 획 득하는 단계; 훈련이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터로부터 상기 가열로의 복수의 적정 후 보 온도를 획득하는 단계-상기 제1 입력 데이터는 가열로에서 가열할 재료의 두께, 재료의 강종(steel grade), 가열로의 운전속도, 및 상기 타겟 물성값 중 적어도 하나를 변수로 포함함-; 훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력 데이터로부터 재료의 예상 물성값을 획득하는 단계-상기 제2 입력 데이터는 상기 훈련이 완 료된 최적 온도 모델을 통하여 연산된 상기 적정 후보 온도, 가열로에서 가열할 재료의 두께, 재료의 강종, 및 가열로의 운전 속도 중 적어도 하나를 변수로 포함함-; 상기 타겟 물성값과 상기 훈련이 완료된 물성 예측 모델 을 통하여 연산된 상기 예상 물성값을 비교하여, 상기 복수의 적정 후보 온도를 샘플링하여 적어도 하나의 샘플 링된 적정 후보 온도를 획득하는 단계; 상기 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 획득하고, 상기 열량 정보를 비교하여 상기 샘플링된 적정 후보 온도를 필터링하여 적어도 하나의 적정 온도들 을 획득하는 단계; 상기 적정 온도들에 기반하여 최적 온도를 연산하는 단계; 및 상기 연산된 최적 온도를 가열 로의 설정 온도 값으로 설정을 지시하는 요청을 송신하는 단계를 포함할 수 있다. 본 출원의 일 실시예에 따르면, 상기 복수의 적정 후보 온도를 샘플링하여 복수의 샘플링된 적정 후보 온도를 획득하는 단계는, 상기 타겟 물성값과 상기 예상 물성값을 비교하여, 상기 타겟 물성값과 상기 예상 물성값의 차이가 작은 순으로 상기 복수의 적정 후보 온도들을 정렬하는 단계; 및 상기 정렬 결과에 기반하여 미리 정해 진 순위 내에 대응되는 적정 후보 온도들을 상기 샘플링된 적정 후보 온도로 결정하는 단계를 더 포함할 수 있 다. 본 출원의 일 실시예에 따르면, 상기 복수의 적정 후보 온도를 샘플링하여 복수의 샘플링된 적정 후보 온도를 획득하는 단계는, 상기 타겟 물성값과 상기 예상 물성값을 비교하여, 상기 타겟 물성값과 상기 예상 물성값의 차이를 연산하는 단계; 및 상기 연산된 차이가 미리 정해진 값 이내에 대응되는 적정 후보 온도들을 상기 샘플 링된 적정 후보 온도로 결정하는 단계를 더 포함할 수 있다. 본 출원의 일 실시예에 따르면, 상기 샘플링된 적정 후보 온도를 필터링하여 복수의 적정 온도들을 획득하는 단 계는, 상기 열량 정보에 근거하여 열량이 작은 순으로 상기 샘플링된 적정 후보 온도들을 정렬하는 단계; 및 상 기 정렬 결과에 기반하여 미리 정해진 순위 내에 대응되는 상기 샘플링된 적정 후보 온도들을 상기 복수의 적정 온도로 결정하는 단계를 더 포함할 수 있다. 본 출원의 일 실시예에 따르면, 상기 적정 온도들에 기반하여 최적 온도를 연산하는 단계는, 상기 적정 온도들 의 평균값을 상기 최적 온도로 연산하는 단계를 더 포함할 수 있다. 본 출원의 일 실시예에 따르면, 상기 최적 온도 모델은, 재료의 두께, 재료의 강종, 가열로의 운전 속도, 및/또 는 타겟 물성값 중 적어도 하나에 대한 제1 학습 데이터와 상기 제1 학습 데이터에 대응되는 가열로의 운전 온 도로 구성된 학습 데이터 세트에 기반하여 훈련되되, 상기 제1 학습 데이터에 기반하여 상기 가열로의 운전 온 도에 근사된 값을 출력하도록 상기 최적 온도 모델의 파라미터가 갱신되어 훈련될 수 있다. 본 출원의 일 실시예에 따르면, 상기 물성 예측 모델은, 재료의 두께, 재료의 강종, 가열로의 운전 속도, 및 가 열로의 운전 온도 중 적어도 하나에 대한 제2 학습 데이터와 상기 제2 학습 데이터에 대응되는 운전 조건으로재료를 열처리한 경우의 물성 정보로 구성된 학습 데이터 세트에 기반하여 훈련되되, 상기 제2 학습 데이터에 기반하여 상기 물성 정보에 근사된 값을 출력하도록 상기 물성 예측 모델의 파라미터가 갱신되어 훈련될 수 있 다. 본 출원의 일 실시예에 따르면, 상기 타겟 물성값과 상기 예상 물성값은, 상기 가열로를 통하여 열처리된 재료 의 인장 강도(tensile strength), 항복 강도(yield strength), 경도(hardness), 연신율(Elongation) 중 적어도 하나에 관한 것일 수 있다. 본 출원의 일 실시예에 따르면, 상기 가열로의 최적 온도를 연산하는 방법을 실행시키기 위한 프로그램을 기록 한 컴퓨터로 읽을 수 있는 기록매체가 제공될 수 있다. 본 출원의 일 실시예에 따른 전자 장치는, 운전자가 입력한 재료의 타겟 물성값을 획득하는 송수신부; 및 훈련 이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터-상기 제1 입력 데이터는 가열로에서 가열할 재료의 두 께, 재료의 강종(steel grade), 가열로의 운전속도, 및 상기 타겟 물성값 중 적어도 하나를 변수로 포함함-로부 터 상기 가열로의 복수의 적정 후보 온도를 획득하고, 훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력 데 이터-상기 제2 입력 데이터는 상기 훈련이 완료된 최적 온도 모델을 통하여 연산된 상기 적정 후보 온도, 가열 로에서 가열할 재료의 두께, 재료의 강종, 및 가열로의 운전 속도 중 적어도 하나를 변수로 포함함-로부터 재료 의 예상 물성값을 획득하고, 상기 타겟 물성값과 상기 훈련이 완료된 물성 예측 모델을 통하여 연산된 상기 예 상 물성값을 비교하여, 상기 복수의 적정 후보 온도를 샘플링하여 적어도 하나의 샘플링된 적정 후보 온도를 획 득하고, 상기 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 획득하고, 상기 열량 정보를 비 교하여 상기 샘플링된 적정 후보 온도를 필터링하여 적어도 하나의 적정 온도들을 획득하고, 상기 적정 온도들 에 기반하여 최적 온도를 연산하고, 상기 연산된 최적 온도를 가열로의 설정 온도 값으로 설정을 지시하는 요청 을 송신하도록 구성된 프로세서;를 포함할 수 있다. 이하에서는 도 1 내지 도 7을 참고하여, 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법, 이 를 수행하기 위한 전자 장치(또는 서버, 이하 전자 장치로 지칭), 및/또는 가열로의 운전 최적화 시스템에 관하 여 설명한다. 도 1은 본 출원의 일 실시예에 따른 가열로의 운전 최적화 시스템의 개략도이다. 도 2는 본 출원의 일 실시 예에 따른 가열로의 운전 최적화 시스템을 설명하기 위한 도면이다. 본 출원의 일 실시예에 따른 가열로의 운전 최적화 시스템은 가열로(100, Furnace), 가열로 제어기, 클라이언트 단말, 및/또는 전자 장치를 포함할 수 있다. 본 출원의 일 실시예에 따른 가열로는, 임의의 송수신부를 통해, 운전 데이터를 가열로 운전 데이터베이스 및/또는 전자 장치을 포함한 임의의 외부 장치 또는 임의의 외부 서버로 송신할 수 있다. 여기서 운전 데 이터란, 재료의 두께, 재료의 강종, 가열로의 운전속도, 가열로의 운전 온도를 포함한 가열로의 운전 조건과 운 전 조건에 따라 제조된 제품의 물성값을 포함하여 가열로의 운전과 관련된 임의의 데이터를 포괄하는 의미일 수 있다. 나아가 가열로는 전자 장치를 통하여 연산된 최적 온도를 설정 온도 값으로 설정하여 재료(예 컨대, 철강 재료)를 열처리할 수 있다. 본 출원의 일 실시예에 따른 전자 장치는, 훈련이 완료된 최적 온도 모델을 이용하여 적정 후보 온도들을 연산하는 동작을 수행할 수 있다. 나아가 전자 장치는, 훈련이 완료된 물성 예측 모델을 이용하여 연산된 적정 후보 온도에 기반하여 가열로를 운전하는 경우의 제품의 예상 물성값을 연산하는 동작을 수행할 수 있다. 나아가 전자 장치는 연산된 예상 물성값과 목표하는 타겟 물성값에 기반하여 최적 온도를 연산하는 동작 을 수행할 수 있다. 이때, 전자 장치는, 송수신부를 통하여 연산된 최적 온도에 기반하여 가열로 의 운전 온도에 대한 제어를 지시하는 요청을 가열로 제어기로 송신하는 동작을 수행할 수 있다. 또 는 전자 장치는, 송수신부를 통하여, 연산된 최적 온도 정보, 예측 물성 정보와 의사 결정 근거를 클라이언트 단말로 송신하는 동작을 수행할 수 있다. 본 출원의 일 실시예에 따른 가열로 제어기는, 임의의 송수신부를 통하여, 전자 장치로부터 가열로 의 운전 온도에 대한 제어를 지시하는 요청을 수신할 수 있다. 이때, 가열로 제어기는 연산된 최적 온도를 가열로의 설정 온도 값으로 설정하고, 가열로의 운전 온도와 설정 온도 값에 기반하여 가열로 의 운전 온도를 설정 온도 값으로 자동으로 제어하는 동작을 수행할 수 있다. 한편, 도 1 및 도 2에서는 가열로 제어기가 가열로, 클라이언트 단말, 전자 장치와는 별개의 장치인 것으로 설명하였다. 다만 이는 설명의 편의를 위한 것이며, 가열로 제어기는 가열로, 클라이언트 단말, 및/또 는 전자 장치와 일체로 구성될 수 있다. 나아가 가열로 제어기는 가열로, 클라이언트 단말 , 및/또는 전자 장치 상에서 실행될 수 있는 프로그램 형태로 제공될 수 있다. 본 출원의 일 실시예에 따른 클라이언트 단말은, 임의의 송수신부를 통하여, 전자 장치로부터 연산 된 최적 온도 정보를 수신할 수 있다. 이때, 클라이언트 단말은 임의의 입력부(예컨대, 마우스, 키보드, 터치패드 등)를 통하여, 연산된 최적 온도 정보를 가열로의 설정 온도 값으로 설정하는 사용자의 요청을 수신할 수 있다. 이때, 클라이언트 단말은, 임의의 송수신부를 통하여, 사용자의 요청에 기반하여 가열로 의 운전 온도를 최적 온도로 세팅된 설정 온도 값으로 제어(예컨대, 도 2의 사용자 제어)하는 요청을 송신 할 수 있다. 한편, 클라이언트 단말은, 임의의 송수신부를 통하여, 연산된 최적 온도 정보, 예측 물성 정 보, 및/또는 의사 결정 근거를 수신하고, 사용자 인터페이스(User Interface)를 통하여 수신된 정보들을 사용자 에게 제공할 수 있다. 다시 도 1을 참고하면, 본 출원의 일 실시예에 따른 전자 장치는 송수신부, 메모리 및 프로 세서를 포함할 수 있다. 전자 장치의 송수신부는 임의의 외부 기기 또는 외부 서버와 통신을 수행할 수 있다. 일 예로, 전 자 장치는, 송수신부를 통해, 가열로로부터 운전 데이터를 획득할 수 있다. 여기서 운전 데이 터란, 전술한 바와 같이, 재료의 두께, 재료의 강종, 가열로의 운전속도, 가열로의 운전 온도를 포함한 가열로 의 운전 조건과 운전 조건에 따라 제조된 제품의 물성값을 포함하여 가열로의 운전과 관련된 임의의 데이터를 포괄하는 의미일 수 있다. 일 예로, 전자 장치는, 송수신부를 통해, 훈련이 완료된 최적 온도 모델 의 구조 정보, 계층 정보, 연산 정보, 및/또는 파라미터 정보를 포함하여 훈련이 완료된 최적 온도 모델을 적절 하게 실행시키기 위한 실행 데이터를 수신할 수 있다. 일 예로, 전자 장치는, 송수신부를 통해, 훈 련이 완료된 물성 예측 모델의 구조 정보, 계층 정보, 연산 정보, 및/또는 파라미터 정보를 포함하여 훈련이 완 료된 물성 예측 모델을 적절하게 실행시키기 위한 실행 데이터를 수신할 수 있다. 일 예로, 전자 장치는, 송수신부를 통해, 연산된 최적 온도 정보, 예측 물성 정보, 및/또는 의사 결정 근거를 포함한 임의의 분 석 정보를 클라이언트 단말을 포함한 임의의 외부 기기 또는 임의의 외부 서버에 송신할 수 있다. 일 예로, 전자 장치는, 송수신부를 통해 연산된 최적 온도를 가열로의 설정 온도 값으로 설정을 지시 하는 요청을 가열로 제어기를 포함한 임의의 외부 기기 또는 임의의 외부 서버에 송신할 수 있다. 전자 장치는, 송수신부를 통해 네트워크에 접속하여 각종 데이터를 송수신할 수 있다. 송수신부 는 크게 유선 타입과 무선 타입을 포함할 수 있다. 유선 타입과 무선 타입은 각각의 장단점을 가지므로, 경우에 따라서 전자 장치에는 유선 타입과 무선 타입이 동시에 마련될 수도 있다. 여기서, 무선 타입의 경우에는 주로 와이파이(Wi-Fi) 같은 WLAN(Wireless Local Area Network) 계열의 통신 방식을 이용할 수 있다. 또는, 무선 타입의 경우에는 셀룰러 통신, 예컨대, LTE, 5G 계열의 통신 방식을 이용할 수 있다. 다만, 무선 통 신 프로토콜이 상술한 예시에 제한되는 것은 아니며, 임의의 적절한 무선 타입의 통신 방식을 이용하는 것도 가 능하다. 유선 타입의 경우에는 LAN(Local Area Network)이나 USB(Universal Serial Bus) 통신이 대표적인 예이 며 그 외의 다른 방식도 가능하다. 전자 장치의 메모리는 각종 정보를 저장할 수 있다. 메모리에는 각종 데이터가 임시적으로 또는 반영구적으로 저장될 수 있다. 메모리의 예로는 하드 디스크(HDD: Hard Disk Drive), SSD(Solid State Drive), 플래쉬 메모리(flash memory), 롬(ROM: Read-Only Memory), 램(RAM: Random Access Memory) 등 이 있을 수 있다. 메모리는 전자 장치에 내장되는 형태나 탈부착 가능한 형태로 제공될 수 있다. 메모리에는 전자 장치를 구동하기 위한 운용 프로그램(OS: Operating System)이나 전자 장치 의 각 구성을 동작시키기 위한 프로그램을 비롯해 전자 장치의 동작에 필요한 각종 데이터가 저장 될 수 있다. 프로세서는 전자 장치의 전반적인 동작을 제어할 수 있다. 예컨대, 프로세서는 후술할 타겟 물성 값을 획득하는 동작, 훈련이 완료된 최적 온도 모델을 이용하여 가열로의 복수의 적정 후보 온도를 획득하 는 동작, 훈련이 완료된 물성 예측 모델을 이용하여 재료의 예상 물성값을 획득하는 동작, 복수의 적정 후보 온 도를 샘플링하여 샘플링된 적정 후보 온도를 획득하는 동작, 샘플링된 적정 후보 온도로 가열로를 운전할 경우 의 열량 정보에 근거하여 적정 온도들을 획득하는 동작, 및/또는 적정 온도들에 기반하여 최적 온도를 연산하는 동작 등을 포함하여 전자 장치의 전반적인 동작을 제어할 수 있다. 구체적으로 프로세서는 메모리 로부터 전자 장치의 전반적인 동작을 위한 프로그램을 로딩하여 실행할 수 있다. 프로세서는하드웨어나 소프트웨어 또는 이들의 조합에 따라 AP(Application Processor), CPU(Central Processing Unit), MCU(Microcontroller Unit)나 이와 유사한 장치로 구현될 수 있다. 이때, 하드웨어적으로는 전기적 신호를 처리 하여 제어 기능을 수행하는 전자 회로 형태로 제공될 수 있으며, 소프트웨어적으로는 하드웨어적 회로를 구동시 키는 프로그램이나 코드 형태로 제공될 수 있다. 도 3은 본 출원의 일 실시예에 따른 전자 장치의 동작을 나타낸 도면이다. 본 출원의 일 실시예에 따른 전자 장치는, 송수신부를 통해, 타겟 물성값을 획득할 수 있다. 보다 구체적으로 전자 장치는, 송수신부를 통해, 가열로의 운전자가 입력한 제조된 제품의 목표하 는 물성 정보에 대한 타겟 물성값을 획득할 수 있다. 여기서 타겟 물성값은 가열로를 통하여 열처리된 재료의 인장 강도(tensile strength), 항복 강도(yield strength), 경도(hardness), 및/또는 연신율(Elongation)을 포 함하여 열처리된 재료(또는 열처리된 제품)의 목표하는 임의의 물성에 대한 값일 수 있다. 본 출원의 일 실시예에 따른 전자 장치는, 송수신부를 통하여, 훈련이 완료된 최적 온도 모델의 실 행 데이터를 획득할 수 있다. 여기서 훈련이 완료된 최적 온도 모델의 실행 데이터란, 훈련이 완료된 최적 온도 모델의 구조 정보, 계층 정보, 연산 정보, 및/또는 파라미터 정보를 포함하여 훈련이 완료된 최적 온도 모델을 적절하게 실행시키기 위한 임의의 데이터를 포괄할 수 있다. 본 출원의 일 실시예에 따른 전자 장치는, 훈련이 완료된 최적 온도 모델을 이용하여, 가열로의 복수의 적정 후보 온도들을 획득할 수 있다. 보다 구체적으로 전자 장치는, 훈련이 완료된 최적 온도 모델의 입 력 레이어에 제1 입력 데이터를 입력하고, 훈련이 완료된 최적 온도 모델의 출력 레이어를 통하여 복수의 적정 후보 온도를 획득할 수 있다. 여기서 제1 입력 데이터는 가열로에서 가열될 재료의 두께, 재료의 강종(steel grade), 가열로의 운전속도, 타겟 물성값, 및/또는 이들의 조합을 변수로 포함할 수 있다. 한편 최적 온도 모델 은, 가열로 운전 데이터베이스로부터 획득된 재료의 두께, 재료의 강종, 가열로의 운전 속도, 및/또는 타겟 물 성값에 대한 제1 학습 데이터와 제1 학습 데이터에 대응되는 가열로의 실제 운전 온도로 구성된 학습 데이터 세 트에 기반하여 훈련될 수 있다. 보다 구체적으로 최적 온도 모델은, 제1 학습 데이터에 기반하여 제1 학습 데이 터에 대응되는 실제 운전 온도에 근사된 값을 출력하도록 최적 온도 모델의 파라미터(또는 가중치)가 갱신되어 훈련될 수 있다. 따라서 훈련이 완료된 최적 온도 모델은 제1 학습 데이터의 변수와 대응되는 제1 입력 데이터 에 기반하여 가열로의 실제 운전 온도에 대응되는 적정 후보 온도를 연산하도록 구성될 수 있다. 최적 온도 모 델의 훈련 방법 및/또는 실행(inference) 양상에 대하여는 도 5와 관련하여 보다 구체적으로 설명하기로 한다. 본 출원의 일 실시예에 따른 전자 장치는, 송수신부를 통하여, 훈련이 완료된 물성 예측 모델의 실 행 데이터를 획득할 수 있다. 여기서 훈련이 완료된 물성 예측 모델의 실행 데이터란, 훈련이 완료된 물성 예측 모델의 구조 정보, 계층 정보, 연산 정보, 및/또는 파라미터 정보를 포함하여 훈련이 완료된 물성 예측 모델을 적절하게 실행시키기 위한 임의의 데이터를 포괄할 수 있다. 본 출원의 일 실시예에 따른 전자 장치는, 훈련이 완료된 물성 예측 모델을 이용하여 재료의 예상 물성값 을 획득할 수 있다. 구체적으로 전자 장치는, 훈련이 완료된 물성 예측 모델의 입력 레이어에 제2 입력 데이터를 입력하고, 훈련이 완료된 물성 예측 모델의 출력 레이어를 통하여 재료의 예상 물성값을 획득할 수 있 다. 여기서 제2 입력 데이터는, 훈련이 완료된 최적 온도 모델을 통하여 연산된 적정 후보 온도, 재료의 두께, 재료의 강종, 가열로의 운전 속도, 및/또는 이들의 조합을 변수로 포함할 수 있다. 한편, 물성 예측 모델은, 가 열로 운전 데이터베이스로부터 획득된 재료의 두께, 재료의 강종, 가열로의 운전 속도, 및/또는 운전 온도에 대 한 제2 학습 데이터와 제2 학습 데이터에 대응되는 운전 조건으로 재료를 열처리한 경우의 물성 정보(예컨대, 재료의 인장 강도(tensile strength), 항복 강도(yield strength), 경도(hardness), 및/또는 연신율 (Elongation))로 구성된 학습 데이터 세트에 기반하여 훈련될 수 있다. 보다 구체적으로 물성 예측 모델은 제2 학습 데이터에 기반하여 제2 학습 데이터에 대응되는 운전 조건으로 재료를 열처리한 경우의 물성 정보에 근사 된 값을 출력하도록 물성 예측 모델의 파라미터(또는 가중치)가 갱신되어 훈련될 수 있다. 따라서 훈련이 완료 된 물성 예측 모델은 제2 학습 데이터의 변수와 대응되는 제2 입력 데이터에 기반하여 제2 입력 데이터에 대응 되는 운전 조건으로 재료를 열처리한 경우의 물성 정보에 대응되는 예상 물성 값을 연산하도록 구성될 수 있다. 물성 예측 모델의 훈련 방법 및/또는 실행(inference) 양상에 대하여는 도 6과 관련하여 보다 구체적으로 설명 하기로 한다. 본 출원의 일 실시예에 따른 전자 장치는, 복수의 적정 후보 온도를 샘플링(Sampling)하여 샘플링된 적정 후보 온도를 획득하는 동작을 수행할 수 있다. 구체적으로 전자 장치는 운전자가 입력한 타겟 물성값과 훈련이 완료된 물성 예측 모델을 통하여 연산된 예상 물성 값을 비교하여, 훈련이 완료된 최적 온도 모델을 통하여 연산된 복수의 적정 후보 온도를 샘플링하여 적어도 하나의 샘플링된 적정 후보 온도를 획득하도록 구성될 수 있다. 일 예로, 전자 장치는 타겟 물성값과 예상 물성값을 비교하여, 타겟 물성값과 예상 물성값의 차 이가 작은 순으로 복수의 적정 후보 온도들을 정렬할 수 있다. 이때, 전자 장치는 정렬 결과에 기반하여 미리 정해진 순위 내에 해당하는 예상 물성값에 대응되는 적정 후보 온도들을 샘플링된 적정 후보 온도로 결정 하도록 구현될 수 있다. 일 예로, 전자 장치는 타겟 물성값과 예상 물성값을 비교하여 타겟 물성값과 예 상 물성값의 차이를 연산할 수 있다. 이때, 전자 장치는 연산된 차이가 미리 정해진 값 이내에 해당하는 예상 물성값에 대응되는 적정 후보 온도들을 샘플링된 적정 후보 온도로 결정하도록 구현될 수 있다. 복수의 적 정 후보 온도들을 샘플링하는 내용에 대하여는 도 7과 관련하여 보다 구체적으로 서술하기로 한다. 일 실시예에 따른 전자 장치는, 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보에 근거하 여 적정 온도들을 획득하는 동작을 수행할 수 있다. 구체적으로 전자 장치는 샘플링된 적정 후보 온도 각 각으로 가열로를 운전할 경우의 각 열량 정보를 획득하고, 각 열량 정보를 비교하여 샘플링된 적정 후보 온도들 을 필터링하여 적어도 하나의 적정 온도들을 획득하도록 구현될 수 있다. 일 예로, 전자 장치는 열량 정 보에 기반하여 열량이 작은 순으로 샘플링된 적정 후보 온도들을 정렬할 수 있다. 이때 전자 장치는 정렬 결과에 기반하여 미리 정해진 순위에 대응되는 열량에 대응되는 샘플링된 적정 후보 온도들을 적어도 하나의 적 정 온도로 결정하도록 구현될 수 있다. 한편 열량 정보는 가열로의 영역 별 적정 후보 온도의 합에 기반하여 연 산되거나 영역 별 적정 후보 온도에 도달하기 위하여 필요한 연료(예컨대, LNG)의 사용량이나 전기에너지의 사 용량에 기반하여 연산될 수 있다. 샘플링된 적정 후보 온도들을 필터링하는 내용에 대하여는 도 7과 관련하여 보다 구체적으로 서술하기로 한다. 본 출원의 일 실시예에 따른 전자 장치는 적정 온도들에 기반하여 최적 온도를 연산하는 동작을 수행할 수 있다. 일 예로, 전자 장치는 적정 온도들의 평균값을 최적 온도로 연산하도록 구현될 수 있다. 최적 온도를 연산하는 내용에 대하여는 도 7과 관련하여 보다 구체적으로 서술하기로 한다. 본 출원의 일 실시예에 따른 전자 장치는, 송수신부를 통해, 연산된 최적 온도를 가열로의 설정 온 도 값으로 설정을 지시하는 요청을 가열로 제어기로 송신하도록 구현될 수 있다. 이때, 가열로 제어기 는 요청에 대응하여 가열로의 설정 온도 값을 연산된 최적 온도로 설정하도록 구현될 수 있다. 나아 가 가열로 제어기는 가열로의 운전 온도와 설정 온도 값에 기반하여 가열로의 운전 온도를 설정 온도 값으로 자동 제어하는 동작을 수행할 수 있다. 한편 본 출원의 일 실시예에 따른 전자 장치는, 송수신부를 통해, 연산된 최적 온도 정보를 클라이 언트 단말로 송신하도록 구현될 수 있다. 이때, 클라이언트 단말은 사용자로부터 연산된 최적 온도 정보로 가열로의 운전 온도를 제어함을 지시하는 입력을 수신할 수 있다. 나아가 클라이언트 단말은 수신 된 입력에 대응하여 가열로의 설정 온도 값을 연산된 최적 온도로의 설정을 지시하는 요청을 가열로 로 송신할 수 있다. 이하에서는 도 4 내지 도 7을 참고하여, 본 출원의 일 실시예에 따른 전자 장치의 동작과 전자 장치 에 의해 수행되는 가열로의 최적 온도를 연산하는 방법을 보다 구체적으로 서술하기로 한다. 한편, 가열 로의 최적 온도를 연산하는 방법을 설명함에 있어서, 앞서 도 1 내지 도 3과 관련하여 설명한 내용과 중복되는 일부 실시예는 생략될 수 있다. 다만, 이는 설명의 편의를 위한 것일 뿐이며, 이에 제한적으로 해석되어서는 아 니된다. 도 4는 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법을 도시한 순서도이다. 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법은, 운전자가 입력한 재료의 타겟 물성값을 획 득하는 단계(S1000), 훈련이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터로부터 가열로의 복수의 적정 후보 온도를 획득하는 단계(S2000), 훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력 데이터로부터 재료의 예상 물성값을 획득하는 단계(S3000), 복수의 적정 후보 온도를 샘플링(sampling)하여 적어도 하나의 샘플링된 적정 후보 온도를 획득하는 단계(S4000), 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 획득 하고, 열량 정보를 비교하여 샘플링된 적정 후보 온도를 필터링하여 적어도 하나의 적정 온도들을 획득하는 단 계(S5000), 적정 온도들에 기반하여 최적 온도를 연산하는 단계(S6000), 및/또는 연산된 최적 온도를 가열로의 설정 온도 값으로 설정을 지시하는 요청을 송신하는 단계(S7000)를 포함할 수 있다. 운전자가 입력한 재료의 타겟 물성값을 획득하는 단계(S1000)에서는, 전자 장치는, 송수신부를 통 해, 가열로의 운전자가 입력한 제품의 목표하는 물성 정보에 대한 타겟 물성값을 획득할 수 있다. 여기서 타겟 물성값은 가열로를 통하여 열처리된 재료의 인장 강도(tensile strength), 항복 강도(yield strength), 경도 (hardness), 및/또는 연신율(Elongation)을 포함하여 열처리된 재료의 목표하는 임의의 물성에 대한 값일 수 있 다. 훈련이 완료된 최적 온도 모델을 이용하여, 제1 입력 데이터로부터 가열로의 복수의 적정 후보 온도를 획득하는 단계(S2000)에서는, 전자 장치는 가열로에서 가열할 재료의 두께, 재료의 강종, 가열로의 운전속도, S1000 단계를 통하여 획득한 타겟 물성값, 및/또는 이들의 조합을 변수로 포함하는 제1 입력 데이터로부터 가열 로의 복수의 적정 후보 온도를 획득할 수 있다. 도 5는 본 출원의 일 실시예에 따른 최적 온도 모델의 훈련 방법 및 훈련이 완료된 최적 온도 모델을 이용하여 적정 후보 온도를 연산하는 양상을 설명하기 위한 도면이다. 구체적으로 도 5(a)는 본 출원의 일 실시예에 따른 훈련이 완료된 최적 온도 모델을 이용하여 적정 후보 온도를 연산하는 양상을 도시한 도면이며, 도 5(b)는 본 출원의 일 실시예에 따른 최적 온도 모델의 훈련 방법을 도시한 도면이다. 훈련이 완료된 최적 온도 모델은, 입력 레이어를 통하여 제1 입력 데이터를 획득하고, 훈련 결과에 따라 갱신된 파라미터(또는 가중치)에 따라 복수의 적정 후보 온도(도 5(a)의 T1, T2 내지 Tn)들을 연산하고, 출력 레이어를 통하여 연산된 적정 후보 온도들을 출력할 수 있다. 이때, 전자 장치는 훈련이 완료된 최적 온도 모델의 출력 레이어를 통하여 복수의 적정 후보 온도들을 획득할 수 있다. 한편, 최적 온도 모델은 가열로 운전 데이터베이스로부터 획득된 재료의 두께, 재료의 강종, 가열로의 운전속도, 타겟 물성값, 및/또는 이들의 조합으로 구성된 제1 학습 데이터와 제1 학습 데이터에 대응되는 가열 로의 운전 온도로 구성된 학습 데이터 세트에 기반하여 훈련될 수 있다. 보다 구체적으로 최적 온도 모델은, 제 1 학습 데이터에 기반하여 예측 온도를 출력하도록 구성될 수 있다. 이때, 최적 온도 모델은 예측 온도와 학습 데이터 세트에 포함된 가열로의 운전 온도의 차이에 기반하여, 가열로의 운전 온도에 근사된 값으로 예측 온도 를 출력하도록 최적 온도 모델의 파라미터(또는 가중치)가 갱신되어 훈련될 수 있다. 따라서 훈련이 완료된 최 적 온도 모델은 제1 학습 데이터의 변수와 대응되는 제1 입력 데이터에 기반하여 가열로의 실 운전 온도에 대응 되는 적정 후보 온도를 연산하도록 구성될 수 있다. 훈련이 완료된 물성 예측 모델을 이용하여, 제2 입력 데이터로부터 재료의 예상 물성값을 획득하는 단계(S300 0)에서는, 전자 장치는, 훈련이 완료된 물성 예측 모델을 이용하여, S2000 단계를 통하여 연산된 적정 후 보 온도, 재료의 두께, 재료의 강종, 가열로의 운전 속도, 및/또는 이들의 조합을 변수로 포함하는 제2 입력 데 이터로부터 재료의 예상 물성값을 획득할 수 있다. 여기서 예상 물성값은 가열로를 통하여 열처리될 재료의 인 장 강도(tensile strength), 항복 강도(yield strength), 경도(hardness), 및/또는 연신율(Elongation)을 포함 하여 열처리될 재료의 임의의 물성에 대한 예상값일 수 있다. 도 6은 본 출원의 일 실시예에 따른 물성 예측 모델의 훈련 방법 및 훈련이 완료된 물성 예측 모델을 이용하여 예상 물성값을 연산하는 양상을 설명하기 위한 도면이다. 구체적으로 도 6(a)는 본 출원의 일 실시예에 따른 훈 련이 완료된 물성 예측 모델을 이용하여 예상 물성 값을 연산하는 양상을 도시한 도면이며, 도 6(b)는 본 출원 의 일 실시예에 따른 물성 예측 모델의 훈련 방법을 도시한 도면이다. 훈련이 완료된 물성 예측 모델은, 입력 레이어를 통하여 제2 입력 데이터를 획득하고, 훈련 결과에 따라 갱신된 파라미터(또는 가중치)에 따라 예상 물성값(예컨대, 도 6(a)의 인장 강도와 관련된 예상 물성값(Q1), 항복 강도 와 관련된 예상 물성값(Q2), 경도와 관련된 예상 물성값(Q3), 연신율과 관련된 예상 물성값(Q4))을 연산하고, 출력 레이어를 통하여 연산된 예상 물성값을 출력할 수 있다. 이때, 전자 장치는 훈련이 완료된 물성 예 측 모델의 출력 레이어를 통하여 예상 물성값을 획득할 수 있다. 한편, 물성 예상 모델은 가열로 운전 데이터베이스로부터 획득된 재료의 두께, 재료의 강종, 가열로의 운전속도, 가열로의 운전 온도, 및/또는 이들의 조합으로 구성된 제2 학습 데이터와 제2 학습 데이터에 대응되 는 운전 조건으로 재료를 열처리한 경우의 물성 정보로 구성된 학습 데이터 세트에 기반하여 훈련될 수 있다. 보다 구체적으로 물성 예측 모델은, 제2 학습 데이터에 기반하여 물성 정보를 관련된 예측 값을 출력하도록 구 성될 수 있다. 이때, 물성 예측 모델은 예측 값과 학습 데이터 세트에 포함된 물성 정보의 차이에 기반하여, 물 성 정보에 근사된 값으로 예측 값을 출력하도록 물성 예측 모델의 파라미터(또는 가중치)가 갱신되어 훈련될 수 있다. 따라서 훈련이 완료된 물성 예측 모델은 제2 학습 데이터의 변수와 대응되는 제2 입력 데이터에 기반하여 제2 입력 데이터에 대응되는 운전 조건으로, 예컨대, 훈련이 완료된 최적 온도 모델을 통하여 연산된 적정 후보온도로 재료를 열처리한 경우의 예상 물성값을 연산하도록 구성될 수 있다. 도 7은 본 출원의 일 실시예에 따른 적정 후보 온도로부터 최적 온도를 연산하는 일 양상을 설명하기 위한 도면 이다. 복수의 적정 후보 온도를 샘플링(sampling)하여 적어도 하나의 샘플링된 적정 후보 온도를 획득하는 단계 (S4000)에서는, 전자 장치는, 복수의 적정 후보 온도를 샘플링(Sampling)하여 샘플링된 적정 후보 온도를 획득하는 동작을 수행할 수 있다. 구체적으로 전자 장치는 운전자가 입력한 타겟 물성값과, 적정 후보 온 도에 근거하여 훈련이 완료된 물성 예측 모델을 통하여 연산된 예상 물성 값을 비교하여, 훈련이 완료된 최적 온도 모델을 통하여 연산된 복수의 적정 후보 온도를 샘플링하도록 구성될 수 있다. 예컨대, 전자 장치는 운전자가 입력한 타겟 물성값과, 훈련이 완료된 물성 예측 모델을 통하여 제1 적정 후보 온도(예컨대, 도 7의 T1)에 근거하여 연산된 제1 예상 물성 값 간의 제1 차이값을 연산할 수 있다. 예컨대, 전자 장치는 운전 자가 입력한 타겟 물성값과, 훈련이 완료된 물성 예측 모델을 통하여 제2 적정 후보 온도(예컨대, 도 7의 T2)에 근거하여 연산된 제2 예상 물성 값 간의 제2 차이값을 연산할 수 있다. 예컨대, 전자 장치는 운전자가 입 력한 타겟 물성값과, 훈련이 완료된 물성 예측 모델을 통하여 제n 적정 후보 온도(예컨대, 도 7의 Tn)에 근거하 여 연산된 제n 예상 물성 값 간의 제n 차이값을 연산할 수 있다. 일 예로, 전자 장치는 타겟 물성값과 예상 물성값 간의 차이값에 기반하여, 타겟 물성값과 예상 물성값 간의 차이값이 작은 순으로 복수의 적정 후보 온도들을 정렬할 수 있다. 나아가 전자 장치는 정렬 결과에 기반하여 미리 정해진 순위 내에 해당하는 예상 물성값에 대응되는 적정 후보 온도들을 샘플링된 적정 후보 온 도(도 7의 ST1, ST2, 내지 STm)로 결정하도록 구현될 수 있다. 일 예로, 전자 장치는 연산된 차이값이 미 리 정해진 값 이내에 해당하는 예상 물성값에 대응되는 적정 후보 온도들을 샘플링된 적정 후보 온도(도 7의 ST1, ST2 내지 STm)로 결정하도록 구현될 수 있다. 다만 상술한 내용은 예시에 불과하며, 전자 장치는 임의의 적절한 방법에 기반하여 적정 후보 온도들을 샘플링하도록 구현될 수 있을 것이다. 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 획득하고, 열량 정보를 비교하여 샘플링된 적 정 후보 온도를 필터링하여 적어도 하나의 적정 온도들을 획득하는 단계(S5000)에서는, 전자 장치는 샘플 링된 적정 후보 온도 각각으로 가열로를 운전할 경우의 각 열량 정보를 획득할 수 있다. 예컨대, 전자 장치 는 샘플링된 제1 적정 후보 온도(예컨대, 도 7의 ST1)로 가열로를 운전할 경우에 사용되는 열량 정보(예 컨대, 도 7의 제1 열량)을 획득할 수 있다. 예컨대, 전자 장치는 샘플링된 제2 적정 후보 온도(예컨대, 도 7의 ST2)로 가열로를 운전할 경우에 사용되는 열량 정보(예컨대, 도 7의 제2 열량)을 획득할 수 있다. 예컨 대, 전자 장치는 샘플링된 제m 적정 후보 온도(예컨대, 도 7의 STm)로 가열로를 운전할 경우에 사용되는 열량 정보(예컨대, 도 7의 제m 열량)을 획득할 수 있다. 이때, 전자 장치는, 획득된 열량 정보를 비교하여 샘플링된 적정 후보 온도들을 필터링하여 적어도 하나 의 적정 온도들을 획득할 수 있다. 구체적으로 전자 장치는 열량 정보에 기반하여 열량이 작은 순으로 샘 플링된 적정 후보 온도들을 정렬할 수 있다. 이때 전자 장치는 정렬 결과에 기반하여 미리 정해진 순위 내에 해당되는 열량에 대응되는 샘플링된 적정 후보 온도들을 적어도 하나의 적정 온도(예컨대, 도 7의 OT1 내 지 OTk)로 결정하도록 구현될 수 있다. 다만 상술한 내용은 예시에 불과하며, 전자 장치는 임의의 적절한 방법에 기반하여 샘플링된 적정 후보 온도들로부터 적정 온도들을 획득하도록 구현될 수 있을 것이다. 적정 온도들에 기반하여 최적 온도를 연산하는 단계(S6000)에서는, 전자 장치는 적정 온도들의 평균값을 최적 온도로 연산하도록 구현될 수 있다. 예컨대, 전자 장치는 S5000 단계를 통하여 획득된 적정 온도들 (예컨대, 도 7의 제1 적정 온도(OT1) 내지 제k 적정 온도(OTk))의 평균값을 연산하고, 연산된 적정 온도들의 평 균값을 최적 온도로 결정하도록 구성될 수 있다. 한편 도 4에서는 도시하지는 않았지만 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법은 S2000 내지 S6000 단계를 수차례 반복하여 최적 온도를 연산하도록 구성될 수 있다. [S7000_한편 도시하지 않았지만 클라이언트 단말에 연산된 최적 온도를 송신하고, 사용자 제어를 통하여 가열로의 운전 온도가 연산된 최적 온도로 제어되도록 구성될 수 있음] 연산된 최적 온도를 가열로의 설정 온도 값으로 설정을 지시하는 요청을 송신하는 단계(S7000)에서는, 전자 장 치는, 송수신부를 통해, 연산된 최적 온도를 가열로의 설정 온도 값으로 설정을 지시하는 요청을 가열로 제어기로 송신하도록 구현될 수 있다. 이때, 가열로 제어기는 요청에 대응하여 가열로의 설정 온도 값을 연산된 최적 온도로 설정하도록 구현될 수 있다. 나아가 가열로 제어기는 가열로의 운전 온도와 설정 온도 값에 기반하여 가열로의 운전 온도를 설정 온도 값으로 자동 제어하는 동작을 수행할 수 있다. 이하에서는 도 8 내지 도 11을 참고하여 본 출원의 일 실시예에 따라 클라이언트 단말에 제공될 수 있는 유저 인터페이스(User Interface)를 설명하기로 한다. 도 8 내지 도 11은 유저 인터페이스(User Interface)의 일 양상들을 설명하기 위한 도면이다. 도 8을 참고하면, 본 출원의 일 실시예에 따른 유저 인터페이스는, 클라이언트 단말의 임의의 출력부(예컨 대, 디스플레이 등)를 통하여, 현재 운전 조건으로 가열로를 운전하는 경우의 제1 예상 물성 정보(도 8의 I1) 및/또는 최적 온도로 가열로를 운전하는 경우의 제2 예상 물성 정보(도 8의 I2)를 사용자에게 출력하도록 제공 될 수 있다. 구체적으로 전자 장치는 훈련이 완료된 물성 예측 모델을 이용하여, 재료의 두께, 강종, 현 재 운전 속도, 및/또는 현재 운전 온도에 대한 현재 운전 조건으로부터 제1 예상 물성 정보(I1)를 획득할 수 있 다. 나아가 전자 장치는 훈련이 완료된 물성 예측 모델을 이용하여, 재료의 두께, 강종, 운전 속도, 및/ 또는 최적 온도에 대한 현재 운전 조건으로부터 제2 예상 물성 정보(I2)를 획득할 수 있다. 이때, 전자 장치 는 유저 인터페이스를 통하여, 제1 예상 물성 정보(I1)와 제2 예상 물성 정보(I2)를 사용자에게 제공하도 록 구현될 수 있다. 나아가 본 출원의 일 실시예에 따른 유저 인터페이스는 클라이언트 단말의 임의의 출력부(예컨대, 디스플 레이 등)를 통하여, 가열로의 실시간 온도 정보(도 8의 I3)와 최적 온도 정보(도 8의 I4)를 사용자에게 출력하 도록 제공될 수 있다. 구체적으로 전자 장치는 가열로의 운전 데이터로부터 가열로의 실시간 온도 정보를 획득할 수 있다. 나아가 전자 장치는 전술한 바에 따라, 훈련이 완료된 최적 온도 모델을 통하여 가열로의 최적 온도를 연산할 수 있다. 이때, 전자 장치는 유저 인터페이스를 통하여, 가열로의 실시간 온도 정보(I3)와 최적 온도 정보(I4)를 사용자에게 제공하도록 구현될 수 있다. 도 9를 참고하면, 본 출원의 일 실시예에 따른 유저 인터페이스는, 클라이언트 단말의 임의의 출력부(예컨 대, 디스플레이 등)를 통하여, 시간, 재료의 두께, 운전 속도, 및/또는 재료의 타겟 물성과 관련된 현재 운전 조건(도 9의 I5)과 현재 운전 온도와 훈련이 완료된 최적 온도 모델을 이용하여 현재 운전 조건으로부터 연산된 최적 온도(또는 적정 후보 온도 등)를 비교한 정보(도 9의 I6, 예컨대, 테이블의 형태)를 사용자에게 출력하도 록 제공될 수 있다. 한편 가열로는 복수 개의 영역으로 구성될 수 있다. 이때, 전자 장치는 전술한 방법을 이용하여 각 영역별로 최적 온도를 연산하도록 구현될 수 있다. 이때, 전자 장치는 유저 인터페이 스를 통하여, 제1 존의 현재 운전 온도와 제1 존의 최적 온도 및/또는 제2 존의 현재 운전 온도와 제2 존의 최 적 온도를 비교한 정보(I6)를 사용자에게 제공하도록 구현될 수 있다. 도 10을 참고하면, 본 출원의 일 실시예에 따른 유저 인터페이스는, 클라이언트 단말의 임의의 출력부(예 컨대, 디스플레이 등)를 통하여, 추후 수행될 가열로의 각 운전 스케줄에 대한 운전 조건(도 10의 I7)과 각 운 전 스케줄에 대한 운전 조건으로부터 훈련이 완료된 최적 온도 모델을 이용하여 연산된 최적 온도(도 10의 I8) 를 사용자에게 출력하도록 제공될 수 있다. 각 운전 스케줄에 대한 운전 조건(I7)에는 재료(coil)의 ID, 운전 시작 시간, 운전 종료 시간, 운전 주체 정보, 재료의 두께, 재료의 예상 물성, 재료의 목표 물성 및/또는 운전 속도가 포함될 수 있다. 나아가 전자 장치는 각 운전 스케줄에 대한 운전 조건에 기반하여, 훈련이 완료 된 최적 온도 모델을 이용하여 가열로의 각 영역의 최적 온도를 연산할 수 있다. 이때, 전자 장치는 유저 인터페이스를 통하여 추후 수행될 가열로의 각 운전 스케줄에 대한 최적 온도(I8)를 사용자에게 제공하도록 구 현될 수 있다. 도 11을 참고하면, 본 출원의 일 실시예에 따른 유저 인터페이스는, 클라이언트 단말의 임의의 입력부(예 컨대, 마우스, 터치패드, 키보드 등)를 통하여, 타겟 물성 값(도 11의 I9)에 대한 입력을 획득하도록 제공될 수 있다. 구체적으로 유저 인터페이스는, 타겟 물성 값(예컨대, 철의 품질(steel quality), 재료의 두께(예컨대, upper 두께, lower 두께, EI, YP, TS, HD, stdspec, pumj 등))에 대한 입력을 획득하도록 제공될 수 있다. 이 때, 전자 장치는 타겟 물성 값을 이용하여 적정 후보 온도를 연산하거나 예상 물성 값을 연산하도록 구현 될 수 있다. 한편 도 8 내지 도 11에 도시된 유저 인터페이스는 하나의 예시에 불과하며, 본 출원의 일 실시예에 따른 가열 로의 운전 최적화 시스템은 임의의 적절한 형태의 유저 인터페이스를 통하여 임의의 적절한 정보를 사용자로부터 획득하거나, 임의의 적절한 정보를 사용자에게 제공하도록 구현될 수 있을 것이다. 한편 도시하지는 않 았지만, 본 출원의 일 실시예에 따르면, 연산된 최적 온도에 대한 근거로, 현재 운전 온도에 따른 예상 물성과 최적 온도에 따른 예상 물성을 비교한 정보가 유저 인터페이스를 통해 사용자에게 제공될 수 있을 것이다. 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 전자 장치에 의하면, 최적 온도 모델과 물성 예측 모델을 이용하여 목표하는 물성 값을 달성하면서도 가열로의 최적의 운전 온도를 연산하는 효과가 제공될 수 있다. 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 전자 장치에 의하면, 최적 온도 모델과 물성 예측 모델을 통하여 샘플링된 적정 후보 온도로 가열로를 운전할 경우의 열량 정보를 이 용하여 최적 온도를 연산함으로써, 제품의 목표하는 물성 값을 달성하면서도 가열로의 열 효율을 개선하는 효과 가 제공될 수 있다. 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법 및 이를 수행하기 위한 전자 장치에 의하면, 인공지능 모델을 통하여 제품의 목표하는 물성 값을 고려하여 가열로의 최적 온도를 자동적으로 연산함으로써, 목표하는 물성 값을 가지는 제품을 안정적으로 생산하도록 가열로의 운전 온도를 제어하는 효과가 제공될 수 있 다. 상술한 전자 장치의 다양한 동작들은 전자 장치의 메모리에 저장될 수 있으며, 전자 장치 의 프로세서는 메모리에 저장된 동작들을 수행하도록 제공될 수 있다. 이상에서 실시 형태들에 설명된 특징, 구조, 효과 등은 본 발명의 적어도 하나의 실시 형태에 포함되며, 반드시 하나의 실시 형태에만 한정되는 것은 아니다. 나아가, 각 실시 형태에서 예시된 특징, 구조, 효과 등은 실시 형 태들이 속하는 분야의 통상의 지식을 가지는 자에 의해 다른 실시 형태들에 대해서도 조합 또는 변형되어 실시 가능하다. 따라서 이러한 조합과 변형에 관계된 내용들은 본 발명의 범위에 포함되는 것으로 해석되어야 할 것 이다. 또한, 이상에서 실시 형태를 중심으로 설명하였으나 이는 단지 예시일 뿐 본 발명을 한정하는 것이 아니며, 본 발명이 속하는 분야의 통상의 지식을 가진 자라면 본 실시 형태의 본질적인 특성을 벗어나지 않는 범위에서 이 상에 예시되지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 즉, 실시 형태에 구체적으로 나타 난 각 구성 요소는 변형하여 실시할 수 있는 것이다. 그리고 이러한 변형과 응용에 관계된 차이점들은 첨부된 청구범위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0096479", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 출원의 일 실시예에 따른 가열로의 운전 최적화 시스템의 개략도이다. 도 2는 본 출원의 일 실시예에 따른 가열로의 운전 최적화 시스템을 설명하기 위한 도면이다. 도 3은 본 출원의 일 실시예에 따른 전자 장치의 동작들을 나타낸 도면이다. 도 4는 본 출원의 일 실시예에 따른 가열로의 최적 온도를 연산하는 방법을 도시한 순서도이다. 도 5는 본 출원의 일 실시예에 따른 최적 온도 모델의 훈련 방법 및 훈련이 완료된 최적 온도 모델을 이용하여 적정 후보 온도를 연산하는 양상을 설명하기 위한 도면이다. 도 6은 본 출원의 일 실시예에 따른 물성 예측 모델의 훈련 방법 및 훈련이 완료된 물성 예측 모델을 이용하여 예상 물성값을 연산하는 양상을 설명하기 위한 도면이다. 도 7은 본 출원의 일 실시예에 따른 적정 후보 온도로부터 최적 온도를 연산하는 일 양상을 설명하기 위한 도면 이다. 도 8은 유저 인터페이스(User Interface)의 일 양상을 설명하기 위한 도면이다. 도 9는 유저 인터페이스(User Interface)의 일 양상을 설명하기 위한 도면이다. 도 10은 유저 인터페이스(User Interface)의 일 양상을 설명하기 위한 도면이다. 도 11은 유저 인터페이스(User Interface)의 일 양상을 설명하기 위한 도면이다."}
