{"patent_id": "10-2021-0181219", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0092130", "출원번호": "10-2021-0181219", "발명의 명칭": "무전원 안테나 센서를 이용한 구조물 모니터링 시스템", "출원인": "주식회사 이엔지소프트", "발명자": "남상혁"}}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "구조물에 부착되어 구조물의 변형과 함께 변형되는 무전원 안테나 센서와,신호를 발생시켜 상기 무전원 안테나 센서에서 반사되어 오는 신호를 읽는 리더기와,상기 리더기에서 읽은 신호를 분석하여 변형률 및 크랙을 분석하는 분석장치를 포함하는 무전원 안테나 센서를이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 무전원 안테나 센서는 RFID칩과,상기 RFID칩의 하부에 구비되는 마이크로스트립안테나와,상기 마이크로스트립안테나의 하부에 구비되는 유전기판을 구비하는 것을 특징으로 하는 무전원 안테나 센서를이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 마이크로스트립안테나와 상기 유전기판은 플렉서블인 것을 특징으로 하는 무전원 안테나 센서를 이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서,상기 마이크로스트립안테나는 인공지능을 이용하여 최적화설계되는 것을 특징으로 하는 무전원 안테나 센서를이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2항에 있어서,상기 마이크로스트립안테나는 전도성 잉크 또는 나노 복합소재를 3D프린팅하여 형성되는 것을 특징으로 하는 무전원 안테나 센서를 이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 리더기는 드론에 설치되어 이동하면서 상기 무전원 안테나 센서와 소정거리 이격된 상태에서 상기 무전원안테나 센서에서 반사되어 오는 신호를 수신하는 것을 특징으로 하는 무전원 안테나 센서를 이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 리더기는 표시신호를 생성하는 신호 생성부와,공개특허 10-2023-0092130-3-생성된 신호를 상기 무전원 안테나 센서로 발송하는 안테나와,상기 무전원 안테나 센서에서 반사되어 온 신호를 받는 신호 수신부와,상기 신호 수신부에서 받은 신호를 처리하는 제어부를 포함하는 것을 특징으로 하는 무전원 안테나 센서를 이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 분석장치는 구조물의 변형 전 소정의 주파수 영역에서 상기 무전원 안테나 센서에서 반사되어 온 신호를 감지하는 각 주파수별 점을 연결한 제1곡선과, 구조물의 변형 후 소정의 주파수 영역에서 상기 무전원 안테나 센서에서 반사되어온 신호를 감지하는 각 주파수별 점을 연결한 제2곡선을 서로 비교하여 구조물의 변형률을 측정하는 것을 특징으로 하는 무전원 안테나 센서를 이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,상기 구조물의 변화에 따른 상기 무전원 안테나 센서에서 감지된 신호를 연결한 곡선의 공진주파수와 상기 구조물의 변형률 간의 관계식을 설정하고,상기 관계식에 의해 상기 구조물의 변형률을 측정하는 것을 특징으로 하는 무전원 안테나 센서를 이용한 구조물모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "상기 분석장치는 상기 리더기에서 읽은 정보를 수집하는 데이터로거와,상기 데이터로거에서 수집된 정보를 저장하는 데이터베이스에 저장하는 데이터베이스 서버와,상기 데이터베이스 서버에 저장된 변형률 및 크랙을 조회하고 가공하여 디스플레이를 제공하는 단말을 포함하는것을 특징으로 하는 무전원 안테나 센서를 이용한 구조물 모니터링 시스템."}
{"patent_id": "10-2021-0181219", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 무전원 안테나 센서를 이용한 구조물 모니터링 시스템은 구조물에 부착되어 구조물의 변형과 함께 변 형되는 무전원 안테나 센서와, 상기 무전원 안테나 센서로 신호를 발생시켜서 반사되어 오는 신호를 읽는 리더기 와, 상기 리더기에서 읽은 신호를 분석하여 변형률 및 크랙을 분석하는 분석장치를 포함한다."}
{"patent_id": "10-2021-0181219", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 구조물 모니터링 시스템에 관한 것으로, 보다 상세하게는 무전원 안테나 센서를 이용한 구조물 모니 터링 시스템에 관한 것이다."}
{"patent_id": "10-2021-0181219", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 많이 사용되고 있는 구조물 모니터링 시스템은 구조물에 스트레인 게이지와 같은 센서를 부착하고, 센서 를 케이블을 이용하여 분석장비로 연결하여 센서에 발생하는 신호를 분석장비로 분석하여 구조물에 구조적 이상 이 발생했는지를 모니터링하게 된다. 그러나 이와 같은 종래의 모니터링 시스템은 무수히 많은 센서와 케이블 등이 사용되므로, 케이블 등이 구조물 에 엉켜 모니터링 시스템이 복잡해지는 문제점이 있었다. 또한 센서와 케이블의 단절이 되는 경우가 발생하면 센서에서 발생한 신호를 전달할 수 없으므로 구조물의 이상 을 정확하게 측정할 수 없다. 또한 센서가 구조물의 이상을 측정하기 위해서는 센서에 지속적인 전원을 공급해야 하며, 센서에 배터리를 사용 하여 전원을 공급하는 경우 배터리를 지속적으로 교체해야 하므로 유지보수 비용이 증대되는 문제점이 있었다. 선행기술문헌특허문헌 (특허문헌 0001) (공개특허공보) 10-2007-0010701호 (공개: 2007년01월24일)"}
{"patent_id": "10-2021-0181219", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 무전원 안테나 센서를 이용하여 구조가 간단하고 외관이 깔끔한 모니터링 시스템을 제공하는 데 있다. 또한 센서와 소정거리 이격된 상태에서 센서로부터 신호를 받을 수 있으므로 측정이 용이한 모니터링 시스템을 제공하는데 있다. 또한 센서에 전원을 공급할 필요가 없어 유지관리가 용이한 무전원 안테나 센서를 이용한 구조물 모니터링 시스 템을 제공하는데 있다. 또한 내구성이 뛰어난 안테나 센서를 이용함으로써 모니터링 시스템의 안정성을 보장할 수 있으며 유지관리 비 용을 절감할 수 있는 무전원 안테나 센서를 이용한 구조물 모니터링 시스템을 제공하는데 있다."}
{"patent_id": "10-2021-0181219", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 일 측면에 따른 무전원 안테나 센서를 이용한 구조물 모니터링 시 스템은 구조물에 부착되어 구조물의 변형과 함께 변형되는 무전원 안테나 센서와, 신호를 발생시켜 상기 무전원 안테나 센서에서 반사되어 오는 신호를 읽는 리더기와, 상기 리더기에서 읽은 신호를 분석하여 변형률 및 크랙 을 분석하는 분석장치를 포함할 수 있다. 또한, 상기 무전원 안테나 센서는 RFID칩과, 상기 RFID칩의 하부에 구비되는 마이크로스트립안테나와, 상기 마 이크로스트립안테나의 하부에 구비되는 유전기판을 구비할 수 있다. 또한, 상기 마이크로스트립안테나와 상기 유전기판은 플렉서블인 것을 특징으로 할 수 있다. 또한, 상기 마이크로스트립안테나는 인공지능을 이용하여 최적화설계될 수 있다. 또한, 상기 마이크로스트립안테나는 전도성 잉크 또는 나노 복합소재를 3D프린팅하여 형성될 수 있다. 또한, 상기 리더기는 드론에 설치되어 이동하면서 상기 무전원 안테나 센서와 소정거리 이격된 상태에서 상기 무전원 안테나 센서에서 반사되어 오는 신호를 수신할 수 있다. 또한, 상기 리더기는 표시신호를 생성하는 신호 생성부와, 생성된 신호를 상기 무전원 안테나 센서로 발송하는 안테나와, 상기 무전원 안테나 센서에서 반사되어 온 신호를 받는 신호 수신부와, 상기 신호 수신부에서 받은 신호를 처리하는 제어부를 포함할 수 있다. 또한, 상기 분석장치는 구조물의 변형 전 소정의 주파수 영역에서 상기 무전원 안테나 센서에서 반사되어 온 신 호를 감지하는 각 주파수별 점을 연결한 제1곡선과, 구조물의 변형 후 소정의 주파수 영역에서 상기 무전원 안 테나 센서에서 반사되어 온 신호를 감지하는 각 주파수별 점을 연결한 제2곡선을 서로 비교하여 구조물의 변형 률을 측정할 수 있다. 또한, 상기 구조물의 변화에 따른 상기 안테나 센서에서 감지된 신호를 연결한 곡선의 공진주파수와 상기 구조 물의 변형률 간의 관계식을 설정하고, 상기 관계식에 의해 상기 구조물의 변형률을 측정할 수 있다. 또한, 상기 분석장치는 상기 리더기에서 읽은 정보를 수집하는 데이터로거와, 상기 데이터로거에서 수집된 정보 를 저장하는 데이터베이스에 저장하는 데이터베이스 서버와, 상기 데이터베이스 서버에 저장된 변형률 및 크랙 을 조회하고 가공하여 디스플레이를 제공하는 단말을 포함할 수 있다."}
{"patent_id": "10-2021-0181219", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 무전원 안테나 센서를 이용한 구조물 모니터링 시스템에 의하면, 무전원 안테나 센서를 이용함 으로써 새로운 개념의 IoT 기반의 모니터링 시스템을 구축할 수 있다.또한 케이블이 필요가 없으므로 구조적으로 간단하면서도 외관적으로 깔끔한 모니터링 시스템을 구축할 수 있다. 또한 내구성이 강한 무전원 안테나 센서를 사용함으로써 안정적이고 유지관리비용이 적게 드는 모니터링 시스템 을 구축할 수 있다."}
{"patent_id": "10-2021-0181219", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명의 일 실시예에 대해 상세하게 설명한다. 그러나 본 발명이 이러한 실시예에 한정되는 것은 아니며 다양한 형태로 변형될 수 있음은 물론이다. 도면에서는 본 발명을 명확하고 간략하게 설명하기 위하여 설명과 관계없는 부분의 도시를 생략하였으며, 명세 서 전체를 통하여 동일 또는 극히 유사한 부분에 대해서는 동일한 도면 참조부호를 사용한다. 그리고 명세서 전체에서 어떠한 부분이 다른 부분을 \"포함\"한다고 할 때, 특별히 반대되는 기재가 없는 한 다른 부분을 배제하는 것이 아니며 다른 부분을 더 포함할 수 있다. 이하, 첨부한 도면을 참조하여 본 발명의 실시예에 따른 무전원 안테나 센서를 이용한 구조물 모니터링 시스템 을 설명한다. 도 1은 본 발명의 일 실시 예에 따른 무전원 안테나 센서를 이용한 구조물 모니터링 시스템의 전체적인 개념을 나타낸 모식도이고, 도 2는 리더기에서 발생시킨 신호가 안테나 센서에서 반사되어 오는 개념을 보인 개념도이 다. 도 1 및 도 2를 참조하면, 본 발명의 일 실시 예에 따른 무전원 안테나 센서를 이용한 구조물 모니터링 시스템 은 구조물에 부착되어 구조물의 변형과 함께 변형되는 무전원 안테나 센서와, 신호를 발생시켜 상기 무전 원 안테나 센서에서 반사되어 오는 신호를 읽는 리더기와, 상기 리더기에서 읽은 신호를 분석하 여 변형률 및 크랙을 분석하는 분석장치를 포함한다. 본 발명의 일 실시 예에 따른 구조물 모니터링 시스템은 무전원 안테나 센서를 사용함으로써 센서에 전원 공급이 필요없기 때문에 구조가 간단하고 외관이 깔끔할 뿐더러 유지보수가 편리한 장점을 가진다. 여기서 말하는 구조물이란 교량, 터널, 도로 등과 같은 토목구조물 및 건물, 창고, 타워크래인 등과 같은 건축 구조물을 통칭하는 개념으로, 건설분야의 구조물이면 어느 구조물에나 사용가능하다. 이와 같이 건설분야의 구조물에 범용적으로 사용될 수 있으므로, 그 활용도가 높으며 사용의 편의성 때문에 구 조물 모니터링 시스템 분야에 큰 파급효과를 나타낼 수 있다. 도 2를 참조하면, 무전원 안테나 센서는 신호를 발생시킬 수 없기 때문에 리더기에서 무전원 안테나 센서를 향해 신호를 발생시키고, 무전원 안테나 센서에서 반사되어 오는 신호를 분석하여 구조물의 변형률 또는 크랙을 분석할 수 있으므로 사용의 편의성을 가진다. 이때 리더기가 무전원 안테나 센서를 감지할 수 있는 거리는 1.5M~2.0M정도이며, 그 이상까지 확장도 가능하다. 한편 교량이나 초고층빌딩과 같은 구조물에 모니터링 시스템이 사용되는 경우 무전원 안테나 센서가 설치 된 위치로 리더기를 접근시켜야 한다. 따라서 상기 리더기는 드론에 설치되어 이동하면서 상기 무전 원 안테나 센서와 소정거리 이격된 상태에서 안테나 센서에서 반사되어 오는 신호를 수신할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 구조물 모니터링 시스템에 사용되는 무전원 안테나 센서의 예이다. 도 3을 참조하면 본 발명의 일 실시 예에 따른 구조물 모니터링 시스템에 사용되는 무전원 안테나 센서는 RFID칩과, 상기 RFID칩의 하부에 구비되는 마이크로스트립안테나와, 상기 마이크로스트립안테나 의 하부에 구비되는 유전기판과, 상기 유전기판의 하부에 구비되는 접지면을 구비할 수 있 다. 한편, 무전원 안테나 센서가 부착되는 구조물의 부착면이 금속재일 경우 상기 유전기판의 하부에 구비되는 접지면이 생략될 수 있다. RFID칩은 무전원 안테나 센서의 ID 정보를 담아 무전원 안테나 센서가 설치되는 위치 등을 파악 하는데 용이하게 한다. 마이크로스트립안테나는 유전기판에 안착되는데 마이크로스트립안테나의 패턴에 따라 무전원 안테나 센서의 감지 특성이 달라지게 된다. 또한, 무전원 안테나 센서에 보내진 신호의 공진주파수는 마이크로스트립안테나의 길이에 따라 달라지게 된다. 이와 같은 무전원 안테나 센서 가 구조물에 부착된 후 구조물에 변형이나 크랙이 발생하면 마이크로스트립안테나도 물리적 변형이 발생하게 된다. 따라서 마이크로스트립안테나의 길이가 변경되어 무전원 안테나 센서에 보내진 신호 의 공진주파수가 변경되므로 구조물의 변형 또는 크랙을 측정할 수 있다. 이때 무전원 안테나 센서에 사용되는 마이크로스트립안테나를 설계할 때 구조물에 알맞게 최적화설계 를 하기 위하여 인공지능을 이용하여 마이크로스트립안테나를 설계할 수 있다. 무전원 안테나 센서를 설계할 때 특히 마이크로스트립안테나의 패턴 등에 따라 무전원 안테나 센서의 신호의 감지 특성 등 이 달라지기 때문에 인공지능을 이용하여 마이크로스트립안테나를 설계함으로써 구조물의 변형률 또는 크 랙을 측정하기에 최적화된 무전원 안테나 센서를 설계할 수 있다. 또한 상기 마이크로스트립안테나를 인공지능을 통해 최적화 설계한 이후 마이크로스트립안테나는 전 도성 잉크 또는 나노 복합소재를 3D프린팅하여 형성될 수 있다. 이와 같이 마이크로스트립안테나를 전도성 잉크 또는 나노 복합소재를 3D프린터를 이용하여 사용함으로써 최적 설계된 마이크로스트립안테나를 원하 는 형태로 자유롭게 프린팅할 수 있어 설계의 자유도를 구현할 수 있다. 3D프린팅의 재료로 사용되는 전도성 잉크로는 실버페이스트 잉크 등이 사용될 수 있다. 또한 나노 복합소재는 탄소나노튜브 복합소재 등이 사용될 수 있다. 이와 같은 실버페이스트 잉크 또는 탄소나노튜브 복합소재는 전도 성을 가지므로 마이크로스트립안테나의 역할을 할 수 있다. 한편, 상기 마이크로스트립안테나와 상기 유전기판은 플렉서블하게 형성될 수 있다. 본 발명의 일 실 시 예에 사용되는 무전원 안테나 센서는 구조물에 부착되는데, 구조물은 용도 및 형태에 따라 다양하게 구 성되므로 상기 무전원 안테나 센서를 구조물에 밀착하여 부착하기 위해서는 무전원 안테나 센서가 플 렉서블하게 구성되는 것이 바람직하기 때문이다. 도 4는 본 발명의 일 실시 예에 따른 구조물 모니터링 시스템에 사용되는 리더기의 구성을 나타낸 블럭도이다. 도 4를 참조하면, 리더기는 표시신호를 생성하는 신호 생성부와, 생성된 신호를 상기 무전원 안테나 센서로 발송하는 안테나와, 상기 무전원 안테나 센서에서 반사되어 온 신호를 받는 신호 수신부 와, 상기 신호 수신부에서 받은 신호를 처리하는 제어부를 포함한다. 한편 상술한 여러 구성에 전원을 공급하는 전원부가 구비된다. 신호 생성부에서는 특정 주파수에서 신호의 강도를 변경하여 가며 신호를 지속적으로 생성하고, 무전원 안 테나 센서는 특정 주파수에서 소정 이상의 강도를 가진 신호만 반사시켜 리더기로 보낼 수 있다. 리 더기의 신호 수신부는 무전원 안테나 센서에서 반사되어온 신호를 수신하고, 제어부는 신 호 수신부에서 받은 신호를 처리하게 된다. 한편, 리더기는 휴대용 단말기 등과 같은 외부장치와 연결되어 리더기의 데이터를 외부장치로 직접적 으로 전송하거나 외부장치에 구비된 사용자 인터페이스 등을 이용하여 정보를 제공할 수 있다. 이를 위해 외부 장치 연결부를 구비할 수 있다. 한편 이와 같이 리더기에서 수신된 신호는 분석장치로 보내져서 신호를 분석하게 된다. 도 1을 참조하면, 상기 분석장치는 상기 리더기에서 읽은 정보를 수집하는 데이터로거와, 상기 데이터로거에서 수집된 정보를 저장하는 데이터베이스에 저장하는 데이터베이스 서버와, 상기 데이터 베이스 서버에 저장된 변형률 및 크랙을 조회하고 가공하여 디스플레이를 제공하는 단말을 포함한다. 도 5는 본 발명의 일 실시 예에 따른 구조물 모니터링 시스템에서 변형률 측정 알고리즘을 보인 순서도이다. 분석해야 할 구조물의 요소를 선정하고, 구조물 요소에 최적화된 무전원 안테나 센서를 설계하고, 설계된 무전원 안테나 센서를 제작한다. 이와 같이 제작된 무전원 안테나 센서를 구조물에 부착할 때 부착 최적 위치를 선정하여 부착한다. 그리고 분석장치는 구조물의 변형 전 소정의 주파수 영역에서 상기 무전원 안테나 센서에서 반사되어 온 신호를 감지하는 각 주파수별 점을 연결한 제1곡선과, 구조물의 변형 후 소정의 주파수 영역에서 상기 무전 원 안테나 센서에서 반사되어 온 신호를 감지하는 각 주파수별 점을 연결한 제2곡선을 서로 비교하여 구조 물의 변형률을 측정한다. 그리고 제 1곡선과 제 2곡선을 서로 비교하여 구조물의 변형률 또는 크랙을 측정한다. 도 6은 구조물의 변형 전과 변형 후에 리더기에서 읽는 신호의 차이를 보인 그래프이다. 도 6에서 보는 바와 같이 구조물에 변형이 발생하면 리더기에서 읽는 신호의 곡선이 좌측으로 이동하게 된다. 이때 곡선의 최저점인 공진주파수는 구조물의 변형률과 반비례 관계를 가지게 된다. 도 7은 구조물의 변형률과 공진주파수의 관계를 나타내는 그래프이다. 상술한 바와 같이 곡선의 최저점인 공진주파수는 구조물의 변형률과 반비례 관계를 가지므로 구조물의 변화에 따른 상기 무전원 안테나 센서에서 감지된 신호를 연결한 곡선의 공진주파수와 상기 구조물의 변형률 간의 관계식을 설정할 수 있다. 이와 같은 상기 관계식에 의해 리더기에서 읽는 신호의 공진주파수를 측정하면 상기 구조물의 변형률을 측정할 수 있다. 이상에서는 본 발명의 실시 예에 따른 무전원 안테나 센서를 이용한 구조물 모니터링 시스템에 대해 설명하였으 나, 본 발명의 사상은 본 명세서에 제시되는 실시 예에 제한되지 아니한다. 그리고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서, 구성요소의 부가, 변경, 삭제, 추가 등에 의해서 다른 실시 예를 용이하 게 제안할 수 있을 것이나, 이 또한 본 발명의 사상범위 내에 든다고 할 것이다."}
{"patent_id": "10-2021-0181219", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 무전원 안테나 센서를 이용한 구조물 모니터링 시스템의 전체적인 개념을 나타낸 모식도. 도 2는 리더기에서 발생시킨 신호가 안테나 센서에서 반사되어 오는 개념을 보인 개념도. 도 3은 본 발명의 일 실시 예에 따른 구조물 모니터링 시스템에 사용되는 무전원 안테나 센서의 예. 도 4는 본 발명의 일 실시 예에 따른 구조물 모니터링 시스템에 사용되는 리더기의 구성을 나타낸 블럭도. 도 5는 본 발명의 일 실시 예에 따른 구조물 모니터링 시스템에서 변형률 측정 알고리즘을 보인 순서도. 도 6은 구조물의 변형 전과 변형 후에 리더기에서 읽는 신호의 차이를 보인 그래프. 도 7은 구조물의 변형률과 공진주파수의 관계를 나타내는 그래프."}
