{"patent_id": "10-2023-0162066", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0054665", "출원번호": "10-2023-0162066", "발명의 명칭": "AI 공기질 환경제어 시스템", "출원인": "삼성물산 주식회사", "발명자": "윤대기"}}
{"patent_id": "10-2023-0162066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공동주택의 각 세대(A) 내에 구비되고, 세대의 휘발성유기화합물(VOCs, 이하 간단히 'VOC'라고 칭함)의 농도를감지하는 VOC 센서(123a)와,공동주택의 각 세대(A) 내에 구비되고, 세대의 이산화탄소 농도를 감지하는 이산화탄소 센서(123b)와,공동주택의 각 세대(A) 내에 구비되고, 세대의 미세먼지를 감지하는 미세먼지센서(123c)와,공동주택의 각 세대(A) 내에 구비되고, 세대 내의 공기와 외부의 공기를 환기하기 위한 전열교환기(133a)와,공동주택의 각 세대(A) 내에 구비되고, 세대 내의 공기를 강제 흡입한 후에 내부의 필터로 필터링한 후에 정화된 공기를 배출하는 공기청정기(133d)와,공동주택의 각 세대(A) 내에 구비되고, 내부의 저장부(117)에 기준 VOC값과, 기준 이산화탄소값과, 기준 미세먼지값이 저장되어 있고,상기 VOC 센서(123a), 이산화탄소 센서(123b) 및 미세먼지 센서(123c)로부터 센서 검출값(VOC 센서 측정값 이산화탄소 센서 측정값 및 미세먼지 센서 측정값)을 수신하고, 상기 VOC 센서(123a), 이산화탄소 센서(123b) 및 미세먼지 센서(123c)로부터 수신한 현재 센서 검출값과 내부의 저장부(117)에 기준 VOC값과, 기준이산화탄소값과, 기준 미세먼지값을 비교한 후에, 그 비교값에 따라서 상기 전열교환기(133a) 및 공기청정기(133d)의 동작을 제어하기 위한 동작제어신호를 출력하는 전열교환기(133a) 및 공기청정기(133d)로 출력하는 세대 통합제어기(110)를 포함하여 구성되는 것을 특징으로 하는 AI 공기질 환경제어 시스템."}
{"patent_id": "10-2023-0162066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 이산화탄소 센서(123b) 및 미세먼지 센서(123c)로부터 수신한 센서 검출값이 모두 기준 농도값보다 큰 경우에는, 이산화탄소 농도 기준에 따라서 상기 전열교환기(133a)를 작동시키고,상기 미세먼지 센서(123c)로부터 수신한 센서 검출값이 기준 농도값보다는 크고, 상기 이산화탄소 센서(123b)로부터 수신한 센서 검출값이 기준 농도값보다는 작은 경우에는, 상기 세대 통합제어기(110)는, 상기 공기청정기(133d)로 구동제어신호를 출력함으로써 미세먼지 농도를 기준으로 공기청정기(133d)를 자동 운전 수행하는 것을특징으로 하는 AI 공기질 환경제어 시스템."}
{"patent_id": "10-2023-0162066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 VOC 센서(123a) 및 미세먼지 센서(123c)로부터 수신한 센서 검출값이 모두 기준 농도값보다 큰 경우에는,상기 세대 통합제어기(110)는, VOC 농도 기준에 따라서 상기 전열교환기(133a)를 작동시켜서 환기 자동 운전하며, VOC 농도가 좋은 상태가 되면 미세먼지 농도 값을 기준으로 상기 공기청정기(133d)의 동작을 제어하며,상기 VOC 센서(123a) 및 이산화탄소 센서(123b)로부터 수신한 센서 검출값 중에서 어느 하나의 센서 검출값이해당 기준 농도값보다 큰 경우에는 상기 세대 통합제어기(110)는, 상기 전열교환기(133a)를 작동시켜서 환기 자동 운전하며, 또한, 미세먼지, 이산화탄소, VOC 모두 나쁠 경우, 상기 세대 통합제어기(110)는, 이산화탄소와 VOC 중에서 나쁜 농도기준에 따라서 전열교환기(133a)의 동작을 제어하고, 이후 이산화탄소와 VOC 농도가 좋은 상태가 되면,미세먼지 농도 값에 따라서 공기청정기(133d)의 운전을 제어하는 것을 특징으로 하는 AI 공기질 환경제어 시스공개특허 10-2025-0054665-3-템."}
{"patent_id": "10-2023-0162066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 세대 통합제어기(110)는,외기 온습도와 외부의 미세먼지농도값과 실내 온습도와 미세먼지 농도, 이산화탄소 농도 및 VCC 농도에 따른 거주자의 환기 및 냉난방 설정값을 날짜, 요일 및 시간 단위로 데이터베이스화하고, 상기 데이터베이스 정보에 의해서 학습한 인공지능프로그램에 의해서 자동으로 환기장치(공기청정기 및 전열교환기)와 냉난방장치의 동작을제어하는 것을 특징으로 하는 AI 공기질 환경제어 시스템."}
{"patent_id": "10-2023-0162066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,공동주택의 각 세대의 실내공간(R)에 난방을 공급하는 난방장치(131)와,공동주택의 세대의 실내공간으로 냉기를 공급하는 냉방장치(132)와,공동주택의 실외의 온도를 검출하고, 측정한 실외온도값을 세대 통합제어기(110)로 전송하는 실외 온도센서(321)와, 공동주택의 각 세대(A) 내에 구비되고, 세대의 실내공간의 온도를 검출하는 실내 온도센서(121)와, 공동주택의 각 세대(A) 내에 구비되고, 세대의 실내공간의 습도를 검출하는 실내 습도센서(122)와, 공동주택의 실외에 구비되고, 실외의 공기질의 오염을 검출하는 실외 공기질센서(323)와,공동주태의 세대 내에 설치되고, 세대의 실내공간에 거주자가 있는지 여부를 감지하는 거주자 센서(124)와, 거주자 맞춤형 환기 및 냉난방을 자동으로 실행하기 위한 명령키인 거주자 맞춤형 모드 실행키(116)와, 세대 통합제어기(110)의 제어에 따라서, 거주자가 실내공간 내에서 실제로 환기 및 냉난방을 했던 이력을 기반으로, 거주자의 인원수에 따른 실내의 설정 공기질 및 온습도값을 날짜와 요일과 시간대별로 저장하고 있는 맞춤형 데이터베이스(118)가 더 포함되어서 구성되고, 상기 세대 통합제어기(110)는, 상기 거주자 센서(124)로부터 거주자 거주감지신호를 수신하는 경우, 수신한 거주자 센싱 신호를 기초로 거주자의 인원수를 판단하고, 상기 판단한 거주자 인원수와 함께 현재 실내의 공기질농도값 및 온습도값을 날짜 및 시간과 함께 맞춤형 데이터베이스(118)에 저장 제어하고, 상기 세대 통합제어기(110)는, 상기 거주자 맞춤형 모드 실행키(116)로부터 명령키신호가 입력되는 경우, 상기맞춤형 데이터베이스(118)에 저장된 거주 인원수에 따라서 저장되어 있는 공기질농도값 및 온습도값을 리드하여서 거주자 맞춤형 환기 및 냉난방의 실행을 제어하는 것을 특징으로 하는 AI 공기질 환경제어 시스템."}
{"patent_id": "10-2023-0162066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "에 있어서,상기 세대 통합제어기(110)는,공동주택의 각 세대 내의 설정온도값을 입력하는 유저 인터페이스인 온도 입력부(111)와, 공동주택의 각 세대 내의 설정습도값을 입력하는 유저 인터페이스인 습도 입력부(112)와, 세대 내의 현재의 온습도와 공기질측정값을 포함한 정보를 표시하는 표시부(미도시)와, 공동주택의 각 세대 내의 기준 VOC 농도값을 입력하는 유저 인터페이스인 VOC값 입력부(117a)와, 공동주택의 각 세대 내의 기준 이산화탄소 농도값을 입력하는 유저 인터페이스인 이산화탄소값 입력부(117b)와,공동주택의 각 세대 내의 기준 미세먼지 농도값을 입력하는 유저 인터페이스인 미세먼지값 입력부(117c)와,세대의 실내공간에서 설정 목표값으로 하는 온도값과 습도값이 저장되어 있는 저장부(117)와, 실내외의 센서와 통신하거나 또는 세대원의 휴대단말기(400)와 통신하거나 또는 공동주택 관리서버(200)와 유무선 및 근거리 통신 및 인터넷 통신하기 위한 통신모듈(119)과, 세대 통합제어기(110) 내의 구성들을 제어하고, 환기 및 온습도 최적화 냉난방 운전 프로그램을 실행하기 위한제어부(110A)를 포함하여 구성되는 것을 특징으로 하는 AI 공기질 환경제어 시스템."}
{"patent_id": "10-2023-0162066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 세대 통합제어기(110)는, 적어도 3 개 이상의 최적 온습도 기준값(T1,H1,..,H4)이 입력되는 경우, 입력된 최적 온습도 기준값(T1,H1,..,H4)에 의해서 2차원의 온습도 최적화 냉난방 운전존을 설정하고, 상기 최적 온습도 기준값(T1,H1,..,H4)에 의해서 설정된 온습도 최적화 냉난방 운전존 내에서만 실내의 공기질농도값 및 온습도값이 유지되도록 냉방장치(132)와 난방장치(131)의 운전을 제어하는 것을 특징으로 하고,상기 세대 통합제어기(110)에는,최적 온습도 기준값(T1,H1,..,H4)의 입력에 의해서 설정되는 온습도 최적화 냉난방 운전존에서만 냉난방이 운전되는 냉난방 모드인 최적화 냉난방 모드를 설정하기 위한 명령을 입력하는 최적화 모드설정부(113)와, 4 개의 최적 온습도 기준값을 입력하기 위한 최적 온습도 기준값 설정부(114)가 더 포함되어서 구성되고, 상기 세대 통합제어기(110)는, 상기 최적 온습도 기준값 설정부(114)를 통해서 4 개 최적 온습도 기준값(T1,H1,..,H4)이 입력되는 경우, 입력된 최적 온습도 기준값(T1,H1,..,H4)을 꼭지점을 직선으로 연결하여 4 개의 직선으로 이루어지는 4 각형의 온습도 최적화 냉난방 운전존(Za)을 설정하며, 상기 온습도 최적화 냉난방 운전존(Za) 내에서만 실내의 공기질농도값 및 온습도값이 유지되도록 냉방장치(132)와 난방장치(131)의 운전을 제어하는 것을 특징으로 하는 AI 공기질 환경제어 시스템."}
{"patent_id": "10-2023-0162066", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 AI 공기질 환경제어 시스템에 관한 것으로, 본 발명에 의하면, 휘발성유기화합물의 농도를 감지하는 VOC 센서(123a)와, 세대의 이산화탄소 농도를 감지하는 이산화탄소 센서(123b)와, 세대의 미세먼지를 감지하는 미세먼지센서(123c)와, 세대 내의 공기와 외부의 공기를 환기하기 위한 전열교환기(133a)와, 세대 내에 구비되는 (뒷면에 계속)"}
{"patent_id": "10-2023-0162066", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공동주택 관리 시스템에 관한 것으로, 특히 VOC와 미세먼지 및 이산화탄소 등의 공기질의 제어를 하 나의 통합제어기에서 통합적으로 편리하게 수행할 수 있도록 하기에 적당하도록 AI 공기질 환경제어 시스템에 관한 것이다."}
{"patent_id": "10-2023-0162066", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 스마트홈(smart home) 시스템은 TV, 에어컨, 냉장고 등의 가전제품을 비롯해 수도, 전기, 냉난방 등 의 에너지 소비장치 및 도어락, 감시카메라 등의 보안기기 및, 이 외에 다양한 분야에서 모든 것을 통신망으로 연결해 모니터링 및 제어할 수 있는 기술을 말하며, 사용자의 특성에 따라 자동 또는 원격으로 조정할 수 있는 시스템의 일종이다. 이러한 시스템은, 편리하고 안락한 일상생활을 영위할 수 있는 인간 중심의 생활환경 증진에 기반을 두고 있으 며, 생활의 편리화에 대한 욕구에 따라 실내에 설치된 가전기기들 즉, 조명기기, 에너지 장치, 전기장치, 보안 장치, 가스장치 등 간의 홈 네트워크가 가능하게 되었고, 이들 가전기기들을 하나의 장치를 통해 통합적으로 제 어 및 관리할 수 있는 홈오토메이션이 가능하게 되었다. 그러나, 현재의 일반적인 스마트 홈 기술은, 실내공간의 조명 온/오프, 가스 잠금 등의 기능을 수행할 뿐이고, 외기와 연동하여서 에너지 절감을 위한 기술이 아직 개발되고 있지 않은 실정이다. 그리고, 실내공간에 거주하는 거주자의 쾌적감을 고려하는 공기질 제어와 냉난방 기술은 개시되지 않아서 그 필 요성이 대두되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 문헌1: 등록특허공보 제10-2186089호(공고일: 2020.12.04)"}
{"patent_id": "10-2023-0162066", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 문제점을 해결하기 위해 창작된 것으로 본 발명에 의한 AI 공기질 환경제 어 시스템 또는 AI 공기질 환경제어 기반의 공동주택 관리 시스템의 목적은, 첫째, VOC와 미세먼지 및 이산화탄소 등의 공기질의 제어를 하나의 통합제어기에서 통합적으로 편리하게 수행할 수 있도록 하고, 둘째, 다수의 공기질센서에서 측정한 검출값(공기질값)의 제어의 우선순위를 정하고 이를 기반으로 공기질을 제 어함으로써 효율적이고도 에너지 절약형 공기질 제어를 수행할 수 있도록 하며, 셋째, AI 기반으로 거주자(재실자)의 생활 패턴 맞춤형으로 최적화된 공기질을 제공하고 또한 그에 따른 주거 환경을 제공할 수 있도록 하며, 넷째, 4 개의 온습도 기준값만으로 온습도 최적화 냉난방 운전이 수행되도록 함으로써 단순히 하나의 온습도값 을 기반으로 냉난방 운전을 하는 종래 기술에 비하여 냉난방 에너지를 절감할 수 있도록 하며, 다섯째, 거주자가 가장 쾌적감을 느끼는 온습도값을 실험치에 의해서 설정하고, 이 실험치에 기반한 온습도값에 의해서 온습도 최적화 냉난방 운전존을 설정하고, 이 온습도 최적화 냉난방 운전존 내에서만 온습도값이 유지되 도록 냉난방장치를 운전함으로써, 거주자의 쾌적감을 만족하면서도 동시에 냉난방 에너지를 절감할 수 있도록 하며, 여섯째, 공동주택 세대 거주자의 거주 여부와 인원수에 따라서, 거주자의 환기 및 냉난방 생활 패턴 분석 결과 를 기초로 환기 및 냉난방을 수행할 수 있도록 함으로써 생활의 편의성을 높임과 동시에 에너지를 절감할 수 있 도록 하며, 일곱째, 공동주택에서 층간소음이 발생한 경우 어느 세대에서 발생한지 여부를 정확하게 판단할 수 있도록 하며, 여덟째, 공동주택에서 층간소음이 발생한 경우에 층간소음의 발생지 세대인 층간소음 발생세대를 특정하여서 그 주변 세대 전부에게 알림으로써 층간소음 발생세대의 주변 세대에서 느끼는 막연한 불안감을 해소하면서도 발생 지에 대한 알 권리를 충족시킬 수 있도록 하며, 아홉째, 공동주택에서의 층간소음을 발생시키는 진원지인 세대 즉, 층간소음 발생세대에게는 자신이 발생시킨 층간소음이 어느 정도의 층간소음인지를 인지할 수 있도록 함으로써 층간소음의 발생을 자제할 수 있도록 하며, 열번째, 공동주택에서의 층간소음 발생세대와 그 주변 세대 모두에게 층간소음의 판정정보 및 발생세대 정보를 신속하게 휴대단말기로 알려줌으로써 층간소음으로 인한 불안감을 신속하게 해소할 수 있고 또한 층간소음의 확 대를 초기에 막을 수 있도록 하며, 열한번째, 공동주택에서의 공조실의 실외기에서 발생하는 화재 사고를 미연에 방지할 수 있도록 하기에 적당하 도록 한 AI 공기질 환경제어 시스템 또는 AI 공기질 환경제어 기반의 공동주택 관리 시스템을 제공하는 데 있다."}
{"patent_id": "10-2023-0162066", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명인 AI 공기질 환경제어 시스템은, 공동주택의 각 세대 내에 구비되고, 세대의 휘발성유기화합물(VOCs, 이하 간단히 'VOC'라고 칭함)의 농도를 감지하는 VOC 센서와, 공동 주택의 각 세대 내에 구비되고, 세대의 이산화탄소 농도를 감지하는 이산화탄소 센서와, 공동주택의 각 세대 내 에 구비되고, 세대의 미세먼지를 감지하는 미세먼지센서와, 공동주택의 각 세대 내에 구비되고, 세대 내의 공기 와 외부의 공기를 환기하기 위한 전열교환기와, 공동주택의 각 세대 내에 구비되고, 세대 내의 공기를 강제 흡 입한 후에 내부의 필터로 필터링한 후에 정화된 공기를 배출하는 공기청정기와, 공동주택의 각 세대 내에 구비 되고, 내부의 저장부에 기준 VOC값과, 기준 이산화탄소값과, 기준 미세먼지값이 저장되어 있고, 상기 VOC 센서, 이산화탄소 센서 및 미세먼지 센서로부터 센서 검출값(VOC 센서 측정값 이산화탄소 센서 측정값 및 미세먼지 센 서 측정값)을 수신하고, 상기 VOC 센서, 이산화탄소 센서 및 미세먼지 센서로부터 수신한 현재 센서 검출값과 내부의 저장부에 기준 VOC값과, 기준 이산화탄소값과, 기준 미세먼지값을 비교한 후에, 그 비교값에 따라서 상 기 전열교환기 및 공기청정기의 동작을 제어하기 위한 동작제어신호를 출력하는 전열교환기 및 공기청정기로 출 력하는 세대 통합제어기를 포함하여 구성되는 것을 특징으로 한다."}
{"patent_id": "10-2023-0162066", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 구성을 가지는 본 발명인 AI 공기질 환경제어 시스템 또는 AI 공기질 환경제어 기반의 공동주택 관 리 시스템은 다음과 같은 효과가 있다. 첫째, VOC와 미세먼지 및 이산화탄소 등의 공기질의 제어를 하나의 통합제어기에서 통합적으로 편리하게 수행할 수 있는 효과가 있다. 둘째, 다수의 공기질센서에서 측정한 검출값(공기질값)의 제어의 우선순위를 정하고 이를 기반으로 공기질을 제 어함으로써 효율적이고도 에너지 절약형 공기질 제어를 수행할 수 있는 효과가 있다. 셋째, AI 기반으로 거주자(재실자)의 생활 패턴 맞춤형으로 최적화된 공기질을 제공하고 또한 그에 따른 주거 환경을 제공할 수 있는 효과가 있다. 넷째, 4 개의 온습도 기준값만으로 온습도 최적화 냉난방 운전이 수행되도록 함으로써 단순히 하나의 온습도값 을 기반으로 냉난방 운전을 하는 종래 기술에 비하여 냉난방 에너지를 절감할 수 있는 효과가 있다. 다섯째, 거주자가 가장 쾌적감을 느끼는 온습도값을 실험치에 의해서 설정하고, 이 실험치에 기반한 온습도값에 의해서 온습도 최적화 냉난방 운전존을 설정하고, 이 온습도 최적화 냉난방 운전존 내에서만 온습도값이 유지되 도록 냉난방장치를 운전함으로써, 거주자의 쾌적감을 만족하면서도 동시에 냉난방 에너지를 절감할 수 있는 효 과가 있다. 여섯째, 공동주택 세대 거주자의 거주 여부와 인원수에 따라서, 거주자의 환기 및 냉난방 생활 패턴 분석 결과 를 기초로 환기 및 냉난방을 수행할 수 있는 효과가 있다. 일곱째, 공동주택에서 층간소음이 발생한 경우 어느 세대에서 발생한지 여부를 정확하게 판단할 수 있는 효과가 있다.여덟째, 공동주택에서 층간소음이 발생한 경우에 층간소음의 발생지 세대인 층간소음 발생세대를 특정하여서 그 주변 세대 전부에게 알림으로써 층간소음 발생세대의 주변 세대에서 느끼는 막연한 불안감을 해소하면서도 발생 지에 대한 알 권리를 충족시킬 수 있는 효과가 있다. 아홉째, 공동주택에서의 층간소음을 발생시키는 진원지인 세대 즉, 층간소음 발생세대에게는 자신이 발생시킨 층간소음이 어느 정도의 층간소음인지를 인지할 수 있도록 함으로써 층간소음의 발생을 자제할 수 있는 효과가 있다. 열번째, 공동주택에서의 층간소음 발생세대와 그 주변 세대 모두에게 층간소음의 판정정보 및 발생세대 정보를 신속하게 휴대단말기로 알려줌으로써 층간소음으로 인한 불안감을 신속하게 해소할 수 있고 또한 층간소음의 확 대를 초기에 막을 수 있는 효과가 있다. 열한번째, 공동주택에서의 공조실의 실외기에서 발생하는 화재 사고를 미연에 방지할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0162066", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다음은 본 발명인 AI 공기질 환경제어 시스템 또는 AI 공기질 환경제어 기반의 공동주택 관리 시스템의 바람직 한 실시예를 첨부한 도면을 참조하여 상세하게 설명한다. 본 발명인 AI 공기질 환경제어 시스템은, 공동주택을 대상으로 하므로 AI 공기질 환경제어가 가능한 공동주택 관리시스템(Apartment housing management system capable of AI air quality environmental control)이다. 본 발명인 AI 공기질 환경제어 시스템에서 층간 소음 발생을 예방할 수 있는 기능이 추가되거나 또는 공조실에 구비된 루버의 개폐를 자동으로 제어할 수 있는 기능이 부가적으로 추가된 경우에는 AI 공기질 환경제어 기능이 있는 공동주택 관리 시스템(Apartment housing management system with AI air quality environmental control function) 또는 AI 공기질 환경제어 기반의 공동주택 관리 시스템(Apartment housing management system based on AI air quality environmental control)이라고 하며 더 간단하게는 공동주택 관리시스템(Apartment housing management system)이라고 한다. 본 명세서에 기재된 용어에 대해서 정의한다. \"온습도 최적화 냉난방 운전 모드\" 또는 \"최적화 모드\"는 거주자가 가장 쾌적감을 느끼는 온습도 상태를 만들어 주는 냉난방 운전모드이다. \"거주자 맞춤형 환기 및 냉난방 모드\" 또는 \"거주자 맞춤형 모드\"는 거주자가 실제로 하고 있는 환기 패턴 및 냉난방의 패턴을 데이터베이스에 저장하고, 이후에는 거주자의 세대의 실내에 있는 경우에는 거주자가 별도로 환기를 위한 공기질 농도값과 냉난방의 온습도를 설정하지 않더라도 데이터베이스에 저장된 과거의 냉난방 패턴 의 이력을 기반으로 자동으로 환기 및 냉난방을 운전하는 동작모드이다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템은, 공동주택의 각 세대(A) 내에 구비되고, 세대의 휘 발성유기화합물(VOCs, 이하 간단히 'VOC'라고 칭함)의 농도를 감지하는 VOC 센서(123a)와, 공동주택의 각 세대 (A) 내에 구비되고, 세대의 이산화탄소 농도를 감지하는 이산화탄소(CO2) 센서(123b)와, 공동주택의 각 세대(A) 내에 구비되고, 세대의 미세먼지를 감지하는 미세먼지센서(123c)와, 공동주택의 각 세대(A) 내에 구비되고, 세대 내의 공기와 외부의 공기를 환기하기 위한 전열교환기(133a)와, 공동주택의 각 세대(A) 내에 구비되고, 세대 내의 공기를 강제 흡입한 후에 내부의 필터로 필터링한 후에 정화된 공기를 배출하는 공기청정기(133d)와, 공동 주택의 각 세대(A) 내에 구비되고 내부의 저장부에 기준 VOC값(기준 VOC 농도값)과, 기준 이산화탄소값(기 준 이산화탄소 농도값)과, 기준 미세먼지값(기준 미세먼지 농도값)이 저장되어 있고, 상기 VOC 센서(123a), 이 산화탄소 센서(123b) 및 미세먼지 센서(123c)로부터 센서 검출값(VOC 센서 측정값 이산화탄소 센서 측정값 및 미세먼지 센서 측정값)을 수신하고, 상기 VOC 센서(123a), 이산화탄소 센서(123b) 및 미세먼지 센서(123c)로부 터 수신한 현재 센서 검출값과 내부의 저장부에 기준 VOC값과, 기준 이산화탄소값과, 기준 미세먼지값을 비교한 후에, 그 비교값에 따라서 상기 전열교환기(133a) 및 공기청정기(133d)의 동작을 제어하기 위한 동작제 어신호를 출력하는 전열교환기(133a) 및 공기청정기(133d)로 출력하는 세대 통합제어기를 포함하여 구성되 는 것을 특징으로 한다. 이에 의하면 VOC와 미세먼지 및 이산화탄소 공기질 제어를 하나의 통합제어기에서 통합적으로 편리하게 수 행할 수 있다. 상기 미세먼지 센서(123c)는 초미세먼지인 PM 2.5 미세먼지 센서이다. 미세먼지(PM2.5) 나쁠 경우, 공기청정기(133d)는 센서 농도에 따라 순환 자동운전하고, 이산화탄소가 나쁠 경우, 이산화탄소 농도기준에 따른 환기를 자동운전하며, VOC가 나쁠 경우 VOC 농도기준에 따른 환기 자동운전 한다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 상기 이산화탄소 센서(123b) 및 미세먼지 센 서(123c)로부터 수신한 센서 검출값이 모두 기준 농도값보다 큰 경우에는 즉, 미세먼지와 이산화탄소 농도가 모 두 나쁠 경우, 이산화탄소 농도 기준에 따라서 상기 전열교환기(133a)를 작동시키고, 상기 미세먼지 센서(123 c)로부터 수신한 센서 검출값이 기준 농도값보다는 크고, 상기 이산화탄소 센서(123b)로부터 수신한 센서 검출 값이 기준 농도값보다는 작은 경우에는, 즉, 이산화탄소 농도가 좋은 상태가 되면 상기 세대 통합제어기 는, 상기 공기청정기(133d)로 구동제어신호를 출력함으로써 미세먼지 농도를 기준으로 공기청정기(133d)를 자동 운전 수행하는 것을 특징으로 한다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 미세먼지와 VOC가 나쁜 경우, 즉, 상기 VOC 센서(123a) 및 미세먼지 센서(123c)로부터 수신한 센서 검출값이 모두 기준 농도값보다 큰 경우에는 즉, VOC와 미세먼지 농도가 모두 나쁠 경우, 상기 세대 통합제어기는, VOC 농도 기준에 따라서 상기 전열교환기 (133a)를 작동시켜서 환기 자동 운전하며, 이후, VOC 농도가 좋은 상태가 되면 미세먼지 농도 값을 기준으로 상 기 공기청정기(133d)의 동작을 제어하며, 이산화탄소와 VOC가 모두 나쁠 경우, 상기 이산화탄소와 VOC 중에서 더 나쁜 농도 값을 기준으로 환기 자동운전을 수행하는데, 즉, 상기 VOC 센서(123a) 및 이산화탄소 센서(123b) 로부터 수신한 센서 검출값 중에서 어느 하나의 센서 검출값이 해당 기준 농도값보다 큰 경우에는 상기 세대 통 합제어기는, 상기 전열교환기(133a)를 작동시켜서 환기 자동 운전하며, 또한, 미세먼지, 이산화탄소, VOC 모두 나쁠 경우(즉, 각각의 센서 검출값이 기준값보다 큰 경우), 상기 세대 통합제어기는, 이산화탄소와 VOC 중에서 나쁜 농도기준에 따라서 전열교환기(133a)의 동작을 제어하고, 이후 이산화탄소와 VOC 농도가 좋은 상태가 되면(즉, 센서 검출값이 기준값보다 작은 경우), 미세먼지 농도 값에 따라서 공기청정기(133d)의 운전을 제어하는 것을 특징으로 한다. 미세먼지가 나쁠 경우 외부공기의 도입보다는 내부 공기의 순환으로 공기청정하는 것이 에너지 절감면에서 유리 하기 때문에 미세먼지는 공기청정기 혹은 전열교환기(133a)의 공기청정모드를 작동하도록 하고 있다. 상기 세대 통합제어기는 렌지후드(133e)가 작동하는 경우에는, 상기 전열교환기(133a)는 렌지후드와 연동 하여서 동작시키는 것을 특징으로 한다. 이산화탄소나 VOC가 나빠지는 경우는 외부공기, 신선한 산소의 공급이 필요하기 때문에 전열교환기를 통해 필터 링된 외부공기를 도입하도록 로직을 설계한다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 전열교환기(133a)의 외부의 공기를 세대 내 로 급기하기 위한 급기 디퓨저(133c)와, 전열교환기(133a)의 내부의 공기를 외부로 배기하기 위한 배기 디퓨저 (133b)가 더 포함되어서 구성됨은 물론이다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 상기 세대 통합제어기는, 외기 온습도 와 외부의 미세먼지농도값과 실내 온습도와 미세먼지 농도, 이산화탄소 농도 및 VCC 농도에 따른 거주자의 환기 및 냉난방 설정값을 날짜, 요일 및 시간 단위로 데이터베이스화하고, 상기 데이터베이스 정보에 의해서 학습한인공지능프로그램에 의해서 자동으로 환기장치(공기청정기 및 전열교환기를 포함한다)와 냉난방장치(난방장치 및 냉방장치)의 동작을 제어하는 것을 특징으로 한다. 이에 의하면, AI 기반으로 거주자(재실자)의 생활 패턴 맞춤형으로 최적화된 공기질을 제공하고 또한 그에 따른 주거 환경을 제공할 수 있다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 공동주택의 각 세대의 실내공간(R)에 난방을 공급하는 난방장치와, 공동주택의 세대의 실내공간으로 냉기를 공급하는 냉방장치와, 공동주택의 실 외의 온도를 검출하고, 측정한 실외온도값을 공동주택 관리서버 또는 세대 통합제어기로 전송하는 실 외 온도센서와, 공동주택의 각 세대(A) 내에 구비되고, 세대의 실내공간의 온도를 검출하는 실내 온도센서 와, 공동주택의 각 세대(A) 내에 구비되고, 세대의 실내공간의 습도를 검출하는 실내 습도센서와, 공 동주택의 실외에 구비되고, 실외의 공기질의 오염을 검출하는 실외 공기질센서[여기서 상기 실외 공기질센 서는 예컨대 실외 미세먼지센서로 구성된다.]와, 공동주태의 세대 내에 설치되고, 세대의 실내공간에 거주 자가 있는지 여부를 감지하는 거주자 센서와, 거주자 맞춤형 환기 및 냉난방을 자동으로 실행하기 위한 명 령키인 거주자 맞춤형 모드 실행키와, 세대 통합제어기의 제어에 따라서, 거주자가 실내공간 내에서 실제로 환기 및 냉난방을 했던 이력을 기반으로, 거주자의 인원수에 따른 실내의 설정 공기질 및 온습도값을 날 짜와 요일과 시간대별로 저장하고 있는 맞춤형 데이터베이스가 더 포함되어서 구성된다. 이때 상기 세대 통합제어기는, 상기 거주자 센서로부터 거주자 거주감지신호를 수신하는 경우, 수신 한 거주자 센싱 신호를 기초로 거주자의 인원수를 판단하고, 상기 판단한 거주자 인원수와 함께 현재 실내의 공 기질농도값 및 온습도값을 날짜 및 시간과 함께 맞춤형 데이터베이스에 저장 제어한다 또한 상기 세대 통합제어기는, 상기 거주자 맞춤형 모드 실행키로부터 명령키신호가 입력되는 경우, 상기 맞춤형 데이터베이스에 저장된 거주 인원수에 따라서 저장되어 있는 공기질농도값 및 온습도값을 리 드하여서 거주자 맞춤형 환기 및 냉난방의 실행을 제어하는 것을 특징으로 한다. 공동주택 세대 거주자의 거주 여부와 인원수에 따라서, 거주자의 환기 및 냉난방 생활 패턴 분석 결과를 기초로 환기 및 냉난방을 수행할 수 있어서 생활의 편의성을 높일 수 있고 환기 및 냉난방 에너지를 절감할 수 있게 된 다. 상기 VOC 센서(123a)와 CO2센서(123b)와 미세먼지 센서(123c)를 실내 공기질센서라고 통칭한다. 그리고, 전열교환기(133a)와 배기 디퓨저(133b)와 급기 디퓨저(133c)와 공기청정기(133d)와 렌지후드(133e)를 통칭하여 환기장치라고 한다. 상기 맞춤형 데이터베이스는 외장 메모리로 구성될 수 있을 것이다. 상기 거주자 센서는 예컨대 적외선센서나 동적감지센서로 구성될 수 있을 것이다. 그리고, 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 실시예에 따라서는, 거주자 맞춤형 환기 및 냉난방을 자동으로 설정하기 위한 거주자 맞춤형 모드설정부가 더 포함되어서 구성되고, 상기 세 대 통합제어기는, 거주자 맞춤형 모드설정부로부터 설정 명령이 있는 경우에 한해서 맞춤형 데이터베 이스에 거주자 맞춤 정보를 저장하는 것을 특징으로 한다. 이에 의하면 거주자의 이용 편의성이 증대된다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 상기 세대 통합제어기는, 세대 내에 구 비되고, 상기 실외 온도센서와 실내 온도센서로부터 검출된 온도값을 수신하고, 난방 가동온도(Th)와 냉방 가동온도(Tr)가 설정되어서 저장되어 있고, 현재 실내온도(Tp)가 난방 가동온도 이하인 경우에는 난방장치 를 운전하기 위한 난방운전제어신호를 난방장치로 출력하고, 현재 실내온도(Tp)가 냉방 가동온도 이 상인 경우에는 냉방장치를 운전하기 위한 냉방운전제어신호를 냉방장치로 출력하는 것을 특징으로 한 다. 여기서 상기 세대 통합제어기는, 상기 난방장치에서의 난방수 공급온도와 난방수 환수온도의 온도차 (ΔT)가 외기보상 기준온도차(ΔTs)를 초과하는 경우에는, 외기온도(To)를 보상값으로 하여서 실내 난방가동온 도를 보상하여서 난방장치의 난방 운전을 제어하는 것을 특징으로 한다. 이에 의하면, 세대의 실내의 온도 제어를 외기의 온도값까지 보상하여서 난방장치를 제어하게 되므로, 난방을 효율적으로 하면서도 난방에너지를 절감할 수 있게 된다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 상기 세대 통합제어기는 외기온도(To) 의 비례하는 보상값을 산출하고, 기 설정된 난방수 공급온도에 상기 산출한 보상값을 가산한 보상된 난방수 공 급온도로써 난방장치를 난방 운전하도록 제어하는 것을 특징으로 한다. 상기 외기보상 기준온도차(ΔTs)는 예컨대 10 도씨로 설정될 수 있다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 상기 세대 통합제어기는, 공동주택의 각 세대 내의 설정온도값을 입력하는 유저 인터페이스인 온도 입력부와, 공동주택의 각 세대 내의 설정습 도값을 입력하는 유저 인터페이스인 습도 입력부와, 세대 내의 현재의 온습도와 공기질측정값을 포함한 정 보를 표시하는 표시부(미도시)와, 공동주택의 각 세대 내의 기준 VOC 농도값을 입력하는 유저 인터페이스인 VOC 값 입력부(117a)와, 공동주택의 각 세대 내의 기준 이산화탄소 농도값을 입력하는 유저 인터페이스인 이산화탄 소값 입력부(117b)와, 공동주택의 각 세대 내의 기준 미세먼지 농도값을 입력하는 유저 인터페이스인 미세먼지 값 입력부(117c)와, 세대의 실내공간에서 설정 목표값으로 하는 온도값과 습도값이 저장되어 있는 저장부 와, 실내외의 센서와 통신하거나 또는 세대원의 휴대단말기와 통신하거나 또는 공동주택 관리서버와 유무선 및 근거리 통신 및 인터넷 통신하기 위한 통신모듈과, 세대 통합제어기 내의 구성들을 제어하 고, 환기 및 온습도 최적화 냉난방 운전 프로그램을 실행하기 위한 제어부(110A)를 포함하여 구성되는 것을 특 징으로 한다. 그리고, 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 상기 세대 통합제어기는, 적어 도 3 개 이상의 최적 온습도 기준값(T1,H1,..,H4)이 입력되는 경우, 입력된 최적 온습도 기준값(T1,H1,..,H4)에 의해서 2차원의 온습도 최적화 냉난방 운전존을 설정하고, 상기 최적 온습도 기준값(T1,H1,..,H4)에 의해서 설 정된 온습도 최적화 냉난방 운전존 내에서만 실내의 공기질농도값 및 온습도값이 유지되도록 냉방장치와 난방장치의 운전을 제어하는 것을 특징으로 한다. 상기 세대 통합제어기에는, 최적 온습도 기준값(T1,H1,..,H4)의 입력에 의해서 설정되는 온습도 최적화 냉 난방 운전존에서만 냉난방이 운전되는 냉난방 모드인 최적화 냉난방 모드를 설정하기 위한 명령을 입력하는 최 적화 모드설정부와, 4 개의 최적 온습도 기준값을 입력하기 위한 최적 온습도 기준값 설정부가 더 포 함되어서 구성되고, 상기 세대 통합제어기는, 상기 최적 온습도 기준값 설정부를 통해서 4 개 최적 온습도 기준값(T1,H1,..,H4)이 입력되는 경우, 입력된 최적 온습도 기준값(T1,H1,..,H4)을 꼭지점을 직선으로 연결하여 4 개의 직선으로 이루어지는 4 각형의 온습도 최적화 냉난방 운전존(Za)을 설정하며, 상기 온습도 최 적화 냉난방 운전존(Za) 내에서만 실내의 공기질농도값 및 온습도값이 유지되도록 냉방장치와 난방장치 의 운전을 제어하는 것을 특징으로 한다. 상기와 같이 4 개의 온습도 기준값을 기초로 온습도 최적화 냉난방 운전존(Za)을 설정하고, 온습도값이 온습도 최적화 냉난방 운전존(Za) 내에서만 운전되도록 제어함으로써, 단순히 하나의 온습도값을 기반으로 냉난방 운전 을 하는 종래 기술에 비하여 냉난방 에너지를 절감할 수 있는 이점이 있다. 또한 거주자가 가장 쾌적감을 느끼는 온습도값을 실험치에 의해서 설정하고, 이 실험치에 기반한 온습도값에 의 해서 산출 프로그램으로 온습도 최적화 냉난방 운전존(Za)을 설정하고, 이 온습도 최적화 냉난방 운전존(Za) 내 에서만 온습도값이 유지되도록 냉난방장치를 운전함으로써, 거주자의 쾌적감을 만족하면서도 동시에 냉난방 에 너지를 절감할 수 있게 된다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 공동주택의 실외의 습도를 검출하고, 측정한 실외습도값을 공동주택 관리서버 또는 세대 통합제어기로 전송하는 실외 습도센서가 더 포함되 어서 구성된다. 그리고, 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 상기 세대 통합제어기()는 상기 온 습도 최적화 냉난방 운전존(Za) 내에서만 실내의 공기질농도값 및 온습도값이 유지되도록 하기 위해서, 냉방장 치와 난방장치 및 환기장치[상기 전열교환기(133a) 및 공기청정기(133d)를 포함한다]의 운전을 통합 제어하는 것을 특징으로 한다. 이에 의하면, 온습도 조절에 외부 공기를 이용함으로써 냉난방 에너지를 더욱더 절감할 수 있게 된다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 상기 최적 온습도 기준값(T1,H1,..,H4)은, 제1 최적 온습도 기준값(T1,H1)과 제2 최적 온습도 기준값(T2,H2)과 제3 최적 온습도 기준값(T3,H3)과 제4 최적온습도 기준값(T4,H4)으로 구성되고, 상기 제1 최적 온습도 기준값(T1,H1)에서 제1 최적 온도 기준값(T1)은 제 2,3,4 최적 온도 기준값(T2,T3,T4)보다 작고, 상기 제1 최적 습도 기준값(H1)은 제2,3,4 최적 습도 기준값 (H2,H3,H4)보다 크며, 제2 최적 온도 기준값(T2)은 제3,4 최적 온도 기준값(T3,T4)보다 작고, 제1 최적 온도 기 준값(T1)보다 크며, 제2 최적 습도 기준값(H2)은 제1,3 최적 습도 기준값(H1,H3)보다 작고, 제4 최적 습도 기준 값(H4)보다 크며, 제3 최적 온도 기준값(T3)은 제4 최적 온도 기준값(T4)보다 작고, 제1,2 최적 온도 기준값 (T1,T2)보다 크며, 제3 최적 습도 기준값(H3)은 제1 최적 습도 기준값(H1)보다 작고, 제2,4 최적 습도 기준값 (H2,H4)보다 크며, 제4 최적 온도 기준값(T4)은 제1,2,3 최적 온도 기준값(T1,T2,T3)보다 크고, 제4 최적 습도 기준값(H4)은 제1,2,3 최적 습도 기준값(H1,H2,H3)보다 작은 값을 가지는 것을 특징으로 한다. 상기와 같은 4 개의 최적 온습도 기준값을 설정하게 되면, 도 4에 도시된 바와 같은 좌상은 높고 우하는 낮은 마름모형에 가까운 온습도 최적화 냉난방 운전존(Za)이 형성되게 된다. 도 4에 도시된 온습도 최적화 냉난방 운전존(Za)은 실험에 의해서 거주자가 가장 쾌적감을 느끼면서도 에너지를 절감할 수 있는 운전존이다. 다음은 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에서 층간 소음 발생을 예방할 수 있는 기능과 공조실(Ra)에 구비된 루버의 개폐를 자동으로 제어할 수 있는 기능이 추가된 AI 공기질 환경제어 기반의 공동주택 관리 시스템에 대해서 설명한다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 기반의 공동주택 관리 시스템에 있어서, 공동주택의 각 세대 내에 설치되고 고유의 아이디가 부여된 소음센서와 진동센서가 더 포함되어서 구성되고, 상기 세대 통합제어기는, 해당 세대 내에 설치된 상기 소음센서와 진동센서가 측정한 신호를 수신하고, 수 신한 소음값과 진동값을 세대 아이디(동호수)와 함께 공동주택 관리서버로 전송하고, 상기 공동주택 관리 서버는 각 세대별의 세대 통합제어기로부터 수신한 소음값과 진동값을 층간소음 데이터베이스에 세대 아이디에 매칭하여서 저장하고, 수신한 소음값과 진동값이 기준값과 비교한 후에, 수신한 소음값과 진동값 의 크기에 따라서 허용, 주의, 경고, 분쟁위험 중의 어느 하나를 판정(이하, 층간소음 판정정보)하고, 상기 층 간소음 판정정보를 해당 세대 통합제어기로 전송하며, 상기 층간소음 판정정보를 수신한 세대 통합제어기 는 기 등록된 새대원의 휴대단말기로 층간소음 판정정보를 전송하는 것을 특징으로 한다. 그리고, 본 발명의 일 실시예에 의한 AI 공기질 환경제어 기반의 공동주택 관리 시스템에 있어서, 상기 공동주 택 관리서버는, 복수의 세대 통합제어기로부터 소음값과 진동값을 수신하는 경우, 소음값과 진동값이 가장 큰 값을 갖는 세대 통합제어기의 세대를 층간소음 발생세대로 판정하고, 상기 공동주택 관리서버 는 상기 판정한 층간소음 발생세대의 세대 통합제어기 및 층산소음 발생세대와 인접한 세대의 세대 통합제어기로 층간소음 판정정보와 층간소음 발생세대임을 알리는 층간소음 발생세대 알림정보를 함께 전 송하는 것을 특징으로 한다. 이에 의하면, 층간소음이 발생한 경우, 어느 세대에서 발생한지 여부를 정확하게 판단할 수 있고, 이렇게 층간 소음 발생세대를 특정하여서 그 주변 세대 전부에게 알림으로써 층간소음 발생세대의 주변 세대에서도 층간소음 진원지를 정확하게 인지할 수 있독 하게 된다. 그리고, 층간소음을 발생시키는 진원지인 세대 즉, 층간소음 발생세대에게는 자신이 발생시킨 층간소음이 어느 정도의 층간소음인지를 인지하게 하여서 층간소음의 발생을 자제할 수 있도록 한다. 이와 같이 층간소음 발생세대와 그 주변 세대 모두에게 층간소음의 판정정보 및 발생세대 정보를 신속하게 휴대 단말기로 알려줌으로써 층간소음으로 인한 불안감을 신속하게 해소할 수 있고 또한 층간소음의 확대를 초기에 막을 수 있게 된다. 본 발명의 일 실시예에 의한 AI 공기질 환경제어 기반의 공동주택 관리 시스템에 있어서, 상기 냉방장치의 실외기(132a)가 설치된 공조실(Ra)에는 루버가 설치되어 있고, 상기 루버를 개폐하는 루버 구동부 (152,153)가 더 포함되어서 구성되고, 상기 냉방장치가 운전하는 경우에는, 상기 세대 통합제어기는 상기 루버 구동부(152,153)로 루버 개방제어신호를 출력한 후에, 냉방장치의 운전을 구동하는 것을 특징으로 한 다. 상기 세대 통합제어기는, 냉방장치의 운전이 정지된 후에는 설정된 시간 경과 후에는 루버 구동부 (152,153)로 루버 닫힘제어신호를 출력하는 것을 특징으로 한다. 이에 의하면, 냉방장치의 운전으로 실외가가 구동하는 경우에도 공조실의 루버가 닫혀 있는 경우에는 실외기에서 발생하는 고온의 공기가 공조실을 빠져나가지 못해서 화재가 발생할 수 있는데, 이러한 실외기의 구 동과 루버의 닫힘에 따른 실외기 화재 사고를 미연에 방지할 수 있다. 그리고, 본 발명의 일 실시예에 의한 AI 공기질 환경제어 기반의 공동주택 관리 시스템에 있어서, 상기 루버 의 개도율을 감지하고, 루버의 개도율을 상기 세대 통합제어기로 출력하는 루버개도 감지부(미도시) 가 더 포함되어서 구성되고, 상기 세대 통합제어기는 상기 루버개도 감지부로부터 수신한 감지신호에 따라 서 상기 루버 구동부를 구동하는 것을 특징으로 한다. 상기 루버 구동부(152,153)는 다양한 실시예로 구성될 수 있을 것이다. 상기 루버 구동부(152,153)는 예컨대 모터와 상기 모터의 회전에 따라서 회전하고, 일방향 및 타방향 회전에 의해서 루버를 개폐하는 회전스크류로 구성될 수도 있을 것이다. 본 발명의 일 실시예에 의한 공동주택 관리 시스템에 있어서, 실외에 구비되고, 강우를 감지하여 네트워크망을 통해서 공동주택 관리서버로 전송하는 강우센서가 더 포함되어서 구성되는 것을 특징으로 한다. 그리고, 공동주택 관리서버는 강우센서로부터 강우감지신호를 수신한 경우, 세대 통합제어기로 강우 중임을 알리는 강우알림신호를 전송하며, 세대 통합제어기는 강우알람신호를 수신한 경우, 강우알림 신호를 등록된 세대원의 휴대단말기로 전송하는 것을 특징으로 한다. 그리고, 본 발명의 일 실시예에 의한 공동주택 관리 시스템에 있어서, 세대원의 휴대단말기는 세대 통합제 어기로 루버 닫힘 명령을 전송하고, 상기 세대 통합제어기는 루버 닫힘 명령을 수신한 경우 루버 구 동부(152,153)로 루버 닫힘제어신호를 출력하는 것을 특징으로 한다. 이에 의하면 강우 시에 비가 공조실로 들어가는 것을 원격에서도 예방할 수 있다. 다음은 상기와 같은 구성을 가지는 본 발명의 일 실시예에 의한 공동주택 관리 시스템의 냉난방 동작에 대하여 기술한다. 먼저 냉난방 가동 온도가 설정되면(S510), 설정된 냉난방 온도는 저장된다(S512). 현재온도와 입력된 설정온도(난방가동온도 또는 냉방가동온도)를 비교하고(S514), 현재온도가 난방가동온도(TS1)보다 낮은 경우에는(S516) 난방운전한다(S518). 그리고, 현재온도가 냉방가동온도(TS2)보다 높은 경우에는(S517) 냉방운전한다(S519) 그리고, 난방수 공급온도와 난방수 환수온도의 온도차(ΔT)가 외기보상 기준온도차(ΔTs)보다 큰 경우에는 (S520), 외기온도(To)를 보상값으로 하여서 실내 난방가동온도를 보상하여서 난방장치의 난방 운전을 하는 외기 온도 보상 난방 최적화 운전이 수행된다(S522). 난방수 공급온도와 난방수 환수온도의 온도차(ΔT)가 외기보상 기준온도차(ΔTs) 이하인 경우에는(S520), 최소 유량을 분단위로 체크한다. 이와 같이 본 발명에 따른 바람직한 실시예를 살펴보았으며, 앞서 설명된 실시예 이외에도 본 발명이 그 기술적"}
{"patent_id": "10-2023-0162066", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것은 해당 기술분야에 있어 서 통상의 지식을 가진 사람에게는 자명한 것이다. 그러므로, 상술한 실시예는 제한적인 것이 아니라 예시적인 것으로 이해해야만 한다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 청구범위에 의하여 나타내어지며, 청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석 되어야 한다."}
{"patent_id": "10-2023-0162066", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템의 블록 구성도이다. 도 2는 도 1에서의 세대 통합제어기의 상세 블록 구성도이다. 도 3은 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 공기질 제어 동작의 흐름도이다. 도 4는 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 냉난방 동작 흐름도이다. 도 5는 본 발명의 일 실시예에 의한 AI 공기질 환경제어 시스템에 있어서, 최적화 온습도 기준값 및 온습도 최 적화 냉난방 운전존(Za)의 개념도이다. 도 6은 본 발명의 일 실시예에 의한 공동주택 관리 시스템에 있어서, 공조실(Ra)에 설치되는 실외기(132a)와 루 버의 구성 개념도이다."}
