{"patent_id": "10-2020-0110015", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0130618", "출원번호": "10-2020-0110015", "발명의 명칭": "전자태그 연계형 자동 잠금 장치", "출원인": "디엑스랩즈 주식회사", "발명자": "박영진"}}
{"patent_id": "10-2020-0110015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자태그 연계형 자동 잠금 시스템에 있어서,식별번호, 특정 기기의 전원 상태, 작업 내용, 작업자, 및 감독자를 나타내는 정보를 포함하는 전자태그를 표시하는 디스플레이(70a),상기 전자태그가 생성되면, 상기 전자태그가 생성되었음을 나타내는 정보를 제1 LED의 점등을 통하여 표시하는제4 알람 표시부(70h), 및상기 전자태그가 회수되면, 상기 전자태그가 회수되었음을 나타내는 정보를 제2 LED의 점등을 통하여 표시하는제5 알람 표시부(70i)를 포함하는 전자태그 표시부(20), 상기 특정 기기에 대한 전원을 차단하기 위한 차단기 스위치(60),도어부(80),상기 도어부와 전원제어장치의 일 측면을 연결하는 힌지부(91, 92), 및상기 도어부를 고정 가능한 잠금부(93)를 포함하는 상기 전원제어장치(10); 및상기 작업 내용이 나타내는 작업을 위한 전원 차단을 요청하는 제1 메시지가 상기 작업자의 단말 또는 상기 감독자의 단말로부터 수신되면, 상기 전자태그를 생성하며 상기 전자태그가 상기 전자태그 표시부를 통하여 표시하도록 제어하는 관리서버(110); 를 포함하고,상기 전원제어장치는 MCC(Motor Control Center)의 패널 보드(panel board)이고,상기 관리서버는,상기 전자태그가 생성되면, 상기 제4 알람 표시부의 상기 제1 LED가 점등되도록 제어하며 상기 잠금부가 잠금되도록 제어하고,상기 작업 내용이 나타내는 작업이 완료되었음을 나타내는 정보가 상기 작업자의 단말을 통하여 입력되고 상기전자태그의 회수를 요청하는 제2 메시지가 상기 작업자의 단말 또는 상기 감독자의 단말로부터 수신되면, 상기제5 알람 표시부의 상기 제2 LED가 점등되도록 제어하며 상기 잠금부의 잠금이 해제되도록 제어하는 것을 특징으로 하는,전자태그 연계형 자동 잠금 시스템."}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전자태그 연계형 자동 잠금 장치에 관한 것이며, 또한 전자태그의 발행, 표시, 및 관리를 위한 장치 및 그 시스템에 관한 것이기도 하다. 본 발명의 일 실시예는 차단기 제어 시스템에 있어서, 전자태그 표시부 및 차단기 스위치를 포함하는 전 원제어장치를 포함하고, 상기 전자태그 표시부는 특정 기기의 전원 상태를 나타내는 정보를 포함하는 전자태 그를 표시하는 차단기 제어 시스템을 제안한다."}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전자태그 연계형 자동 잠금 장치에 관한 것으로서, 전자태그의 발행, 표시, 및 관리를 위한 장치에 관한 것이기도 하다. 또한 본 발명은 전원제어장치를 제어하는 서버 및 그 시스템에 관한 것이며, 구체적으로는 LOTO(Lockout/Tagout) 시스템 및/또는 SLMS(Smart LOTO Management System)에서 활용될 수 있다."}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "산업 현장에는 공정의 설비를 가동하기 위해 수많은 동력 기계, 기구(펌프, 팬 등)들이 설치되어 있고 여기에 동력인 전기를 공급하기 위한 고·저압 전기차단기들이 있다. 각 회사들은 적절한 생산성과 효율성을 목적으로 공정 설비 및 기기 장치들에 대한 정기 점검과 유지보수작업을 하는 한편 불시 고장 발생 시 수리 작업도 시행 하고 있다. 이러한 점검정비 및 수리 작업은 작업자들에 대한 안전이 반드시 확보된 상태에서 착수되어야 하며 산업안전보건법에도 이를 규정하고 있으며 각 회사들은 이를 준수하기 위해 작업 전·후 전원차단과 관련된 내부 관리 절차를 마련하여 운영 중에 있으며, 이때 사용되는 툴(tool)이 소위 \"Red 태그(이하\" 태그\"라 함)\"이다. 종이 카드 형태의 태그를 작성하여 작업 대상 기기의 전기차단기 스위치를 내린 후 그 차단기에 붙여 놓아 작업이 끝날 때까지 차단기의 조작을 금지시켜 작업자의 안전을 확보하고 있는 시스템이다. 그럼에도 불구 하고 차단기 조작자의 실수나 오류, 작업자의 임의조작 등에 의한 사고가 발생하여 인명 상해와 경우에 따라서 설비손상을 일으켜 막대한 손실을 입게 된다. 이를 착안하여 차단기 조작 및 관리상의 사람에 의한 오류나 실수를 근원적으로 차단하여 산업 현장에서의 안전 사고를 막기 위해 본 발명은 개선(enhanced)되고 자동화(automated)된, 전자태그의 발행, 표시, 및 관리를 위한 장치와, 전원제어장치를 제어하는 서버 및 그 시스템을 제안하려고 한다."}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는 전자태그의 발행, 표시, 및 관리를 위한 장치를 제공하는데 그 목적이 있다. 본 발명의 일 실시예는 전원제어장치를 제어하는 서버 및 그 시스템을 제공하는데 그 목적이 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예는 웹 기반의 전자태그 발행(및/또는 생성) 및 관리 시스템과, 판넬 부착형 전자태그, 전자 식 Door Lock 시스템, 차단기 보안 커버와의 연계 방법, 다중(Multi) Tag 발행(및/또는 생성) 시스템, 전기실 입구 내부 위치 표시 시스템, 위치 및 IoT 기반 실시간 감시 시스템, 정보 활용 분석 및 보고 시스템, 저압반 모니터링 시스템 구축 및 연계하는 방법 등을 제안한다. 또한 본 발명의 일 실시예는 차단기 제어 시스템에 있어서, 전자태그 표시부 및 차단기 스위치를 포함 하는 전원제어장치를 포함하고, 상기 전자태그 표시부는 특정 기기의 전원 상태를 나타내는 정보를 포함하 는 전자태그를 표시하는 차단기 제어 시스템을 제안한다. 상기 전원제어장치는 도어부; 상기 도어부와 상기 전원제어장치의 일 측면을 연결하는 힌지부(91, 92); 및 상기 도어부를 고정 가능한 잠금부; 를 포함할 수 있다. 상기 전자태그 표시부는 터치 인식 기능을 포함하는 디스플레이 화면; 상기 특정 기기의 전원 상태에 상응하여 점등되는 제1 알람 표시부를 포함하는 복수의 알람 표시부; 및 적어도 하나의 입력부; 를 포함할 수 있다. 상기 차단기 제어 시스템은 상기 전원제어장치를 제어하는 관리서버; 를 포함하고, 상기 관리서버는 상기 전자태그를 생성하여 상기 전자태그 표시부를 통하여 표시하도록 제어할 수 있다. 상기 전원제어장치는, 도어부; 상기 도어부와 상기 전원제어장치의 일 측면을 연결하는 힌지부(91, 92); 및 상기 도어부를 고정 가능한 잠금부; 를 포함하고, 상기 관리서버는 상기 전자태그를 생성되면 상기 잠금부 가 잠금되도록 제어하고, 상기 전자태그의 회수에 상응하는 신호가 상기 관리서버에 의해 단말로부터 수신되면 상기 잠금부의 잠금이 해제되도록 제어할 수 있다."}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이 본 발명의 일 실시예는 개선된(enhanced) 전원제어장치를 제어하는 서버 및 그 시스템을 제안한다는 측면에서 기술적인 효과를 갖는다고 볼 수 있다. 또한 본 발명의 일 실시예는 전자식 Door Lock을 제안하기에(Normal 상태에는 항상 잠겨 있고, 전자태그 발생 승인 후 자동 Door Lock Open, 차단 후 Door Lock에 의해 자동 잠김, 전자태그 회수 승인 후 자동 Door Lock Open, 차단기 연결 후 Door Lock에 의해 자동 잠김 등), 권한이 없는자(또는 관리자)에 의해 임의 조작 불가능 하고 휴먼 에러 발생 차단할 수 있다는 점에서 기술적인 효과를 제공할 수 있다. 또한 본 발명의 일 실시예는 온라인(online)화 및 디지털(Digital)화된 전자태그의 발행(및/또는 생성), 회수, 승인 절차가 가능하다는 점에서 유의미하다.또한 본 발명의 일 실시예는 전자태그에서 flickering을 통해 위치 표시, 신입 작업자 등 정보 미흡으로 인한 문제 차단을 함으로써 조작 유닛 위치의 파악을 용이하게 한다는 점에서 기술적인 효과를 갖는다. 또한 본 발명의 일 실시예는 각 전자태그에서 음성 안내 기능 부가로 사람으로 인하여 발생하는 에러를 최소화 한다는 점에서 기술적인 효과를 갖는다. 또한 본 발명의 일 실시예는 SLMS(Smart LOTO Management System) 시스템에서 내용 입력, Tag 부착 위치 등을 파악함으로써 원천적으로 혼선을 방지할 수 있다. 또한 본 발명의 일 실시예는 현장의 상태를 실시간 모니터링 하여, 조작 상태를 알 수 있고, 임의 조작 시 알람 을 띄워 줌으로써 감시/감독 용이하게 할 수 있다. 그리고, 전자태그 발행(및/또는 생성)/회수/승인/조작 등의 이력을 데이터베이스화 하여 이력 관리는 물론 분석을 통한 개선점 발굴, 최적화 등에 활용할 수 있다. 또한 본 발명의 일 실시예는 웹기반 시스템을 제안하므로 향후 모바일 등에서 확인 가능하도록 기능 확장이 용 이하며, 제3의 시스템과 연계 가능하다는 측면에서 확장성이 우수하다고 볼 수 있다. 또한 본 발명의 일 실시예는 기존 통신 네트워크를 활용하여 초기 투자 비용 최소화할 수 있다는 점에서 기술적 인 효과를 갖는다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 실시예를 설명함에 있어서 본 발명이 속하는 기술 분야에 익히 알려져 있고 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를지칭한다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴 퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 본 발명의 실시예들을 구체적으로 설명함에 있어서, 특정 시스템의 예를 주된 대상으로 할 것이지만, 본 명세서 에서 청구하고자 하는 주요한 요지는 유사한 기술적 배경을 가지는 여타의 통신 시스템 및 서비스에도 본 명세"}
{"patent_id": "10-2020-0110015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "서에 개시된 범위를 크게 벗어나지 아니하는 범위에서 적용 가능하며, 이는 당해 기술분야에서 숙련된 기술적 지식을 가진 자의 판단으로 가능할 것이다. 도 1a는 본 발명의 일 실시예를 따른 전원제어장치를 나타내는 도면이다. 본 발명의 일 실시예에 따른 전원제어장치는 전자태그의 발행, 표시, 및 관리를 위한 장치일 수 있으며, 도 1a를 참조하면, 상기 전원제어장치는 전자태그 표시부, 제1 버튼, 제2 버튼, 제3 버튼, 및 /또는 스위치를 포함할 수 있다. 다만 전원제어장치에 구비되는 제1 버튼, 제2 버튼, 제3 버튼 , 및/또는 스위치는 선택적인 구성요소일 수 있으며, 일 예로, 상기 전원제어장치는 상기 제1 버튼 , 제2 버튼, 제3 버튼, 및/또는 스위치 중 적어도 어느 하나를 포함할 수 있으며, 다른 예로, 상기 전자태그 표시부 만을 포함할 수도 있다. 여기서 스위치는 차단기, 차단 스위치, 및/또는 차단기 스위치를 나타낼 수 있다. 본 발명에서 스위치를 내리는 것은 특정기기에 전기가 흐르지 않는 것, 전원장치로부터 상기 특정기기 에 전원이 공급되지 않는 것 등에 상응할 수 있다. 한편, 도 1a에서는 전원제어장치에 물리적인 스위치가 구비되는 것을 도시하고 있으나, 이는 일 예에 불과하며, 전원제어장치에 구비되는 스위치는 회로 스위치일 수도 있다. 이때의 스위치는 복수의 회로 스위치들을 포함하는 회로 차단기(서킷 브레이커, Circuit Breaker)일 수도 있다. 여기서 전원제어장치는, 일 예로, 일종의 MCC(Motor Control Center) 및/또는 상기 MCC의 패널(또는 패널 보드)일 수 있다. 상기 전원제어장치는, 다른 예로, 화공 플랜트 또는 발전 플랜트와 관련되는 전력을 제어 하는 장치일 수 있다. 화공플랜트는 정유, 석유화학, 화학플랜트를 의미하고, 발전플랜트는 원자력, 화력, 열병 합 등의 발전소를 의미할 수 있다. 상기 전자태그 표시부는 차단기 제어 화면(및/또는 전원제어장치를 제어하는 플랫폼, 차단기 리스트 (breaker list))을 출력(및/또는 표시)할 수 있으며, 발행 감독, 정비 책임자(의 이름, 직함 등), 조작 책임자 (의 이름, 직함 등), 발행 승인(예; 발행 승인됨, 발행 승인 안됨 등), 투입 승인, 회수 승인, 차단기 명(명 칭), 차단기 번호, 설비명(기기, 설비의 명칭), 전자태그(electrical tag) 발행 횟수(및/또는 개수), 및/또는 시간을 나타내는 정보를 출력(및/또는 표시)할 수 있다. 또한 전자태그 표시부는 기기명(예; 특정기기의 명 칭), 전자태그의 식별번호, 작업내용, 작업기간, 조작 승인자, 감독자, 시행자 정보 등을 나타내는 정보를 출력 (및/또는 표시)할 수 있다.제1 버튼은, 일 예로, 전원장치로부터 출력되는 전력(및/또는 전류, 전압)을 차단하기 위한 버튼일 수 있으며, 다른 예로, 전원제어장치의 전원을 오프(off)하기 위한 버튼일 수 있다. 여기서 전원장치는 전력을 공급하는 장치, 대용량 충전장치, 발전기, 소형 발전소, 소형 플랜트, ESS(energy save system) 등에 상 응할 수 있다. 제2 버튼은, 일 예로, 전원장치로부터 출력되는 전력(및/또는 전류, 전압)을 연결하기 위한 버튼일 수 있으며, 다른 예로, 전원제어장치의 전원을 온(on)하기 위한 버튼일 수 있다. 제3 버튼은, 일 예로, 전원장치(및/또는 전원제어장치)를 재가동(및/또는 재실행)하기 위한 버튼 일 수 있다. 다만, 상기 제1 버튼 내지 제3 버튼이 상기 전원장치에 구비되는 것은 일 예에 불과하며, 전원제 어장치는 상기 제1 버튼 내지 제3 버튼 중 일부만을 포함하거나, 상기 제1 버튼 내지 제3 버튼 을 포함하지 않을 수 있다. 스위치는 차단기에 상응하는 부재(장치)일 수 있으며, 전원장치로부터 출력되는 전력(및/또는 전류, 전압)을 차단하기 위한 부재(장치)일 수 있다. 또한 도 1a를 참조하면, 본 발명의 일 실시예에 따른 전원제어장치는 일축을 중심으로 회전되어 열리는 도 어부 및 힌지부(91, 92)를 더 포함할 수 있다. 상기 도어부는 패널, 도어, 덮개 등을 포함할 수 있다. 도 1a에서는 상기 도어부가 제1 버튼, 제2 버튼, 제3 버튼, 및 스위치를 덮는 크기로 도시 되어 있으나, 이는 도면화의 편의를 위해 일 예를 선택한 것에 불과하며, 다른 예로 상기 도어부는 상기 전 원제어장치의 일 측면을 모두 덮거나, 전자태그 표시부, 제1 버튼, 제2 버튼, 제3 버튼, 스위치를 모두 덮는 넓이로 구성될 수도 있다. 또한 도 1a를 참조하면, 본 발명의 일 실시예에 따른 전원제어장치는 잠금부를 더 포함할 수 있으며, 상기 잠금부는 상기 도어부를 고정시키는 고정 수단일 수 있으며, 상기 잠금부가 잠기거나 풀리는 동작은 관리서버의 제어 모듈에 의해 제어될 수 있다. 또한 도 1a에는 도시되지 않았으나, 상기 전원 제어장치는 상기 잠금부의 잠금 여부를 나타내는 디스플레이 및/또는 소정의 발광 장치(예; LED 램프 등)를 포함할 수도 있다. 전자태그 표시부는 전자태그, 전자태그의 발행(및/또는 생성) 여부, 전자태그의 회수(및/또는 반환) 여부, 알람 신호(예; 음성 신호), 및/또는 차단기 상태를 표시하거나 출력할 수 있다. 상기 전자태그는 전자태그(Tag) 발행 No., 기기명, 승인자, 감독자, 작업 내용, 작업기간, 작업 시행사 등을 포함하거나 표시할 수 있다. 상기 알람 신호는 Unit, Equipment, 전자태그 발행 여부를 나타낼 수 있다. 또한 상기 알람 신호는 도어부 및/또 는 잠금부에 사용자의 터치 등이 감지되는 경우에 표시되거나 출력될 수 있다. 상기 차단기 상태는 운전중, 정지, 차단기 OFF 등을 포함하거나 표시할 수 있다. 또한 전자태그 표시부는 전자태그가 발행(및/또는 생성)되는 경우에는 i) 해당 차단기의 SLMS2000 LCD 화면 Flickering, ii) 운전원이 확인 Push하면 Tag Display 대기 Mode, 전자 Door Lock Released, iii) 차단기 Off or Draw-Out되면 Tag Display, 및/또는 iv) Door Close 후 전자 Door Lock에 의해 자동 잠김 등이 구현될 수 있다. 또한 전자태그 표시부는 전자태그가 회수(및/또는 반환)되는 경우에는 i) Tag 회수 및 차단기 투입 승인되 면 해당 \"차단기 투입 승인 완료\"로 LCD 화면 표시, ii) 운전원 확인 Push, Door Lock Released, iii) 차단기 투입되면 초기 화면 \"BKR No. & 기기명\"으로 전환, 및/또는 iv) 전자 Door Lock에 의해 자동 잠김 등이 구현될 수 있다. 또한 전자태그 표시부는 도어부 및/또는 잠금부와 연계하여 동작할 수 있다. 사용자가 도어부 를 열거나 잠금부를 해제하지 않고 전자태그 표시부를 조작하는 경우에는 다음과 같은 동작이 구현될 수 있다. 예를 들면, 사용자가 차단기 Door를 Open 하지 않고 스위치를 조작할 경우, i) 차단기 스위치 위에 보 안 커버 부착, ii) 보안 커버에 전자식 Door Lock 설치로 자동 Open/Close, iii) 전자 Tag는 Door Lock에 Open/Close Signal 제공이 구현될 수 있다. 또한 Tag 발생/회수 절차는 Door Open식 차단기와 동일하게 구현될 수 있다. 도 1b 및 도 1c는 본 발명의 일 실시예를 따른 전원제어장치의 디스플레이를 나타내는 도면이다. 도 1b를 참조하면, 전원제어장치의 전자태그 표시부는 디스플레이 화면(70a), 제1 알람 표시부(70b), 제2 알람 표시부(70c), 제3 알람 표시부(70d), 제1 입력 버튼(70e), 제2 입력 버튼(70f), 및 스피커(70g)를 포 함할 수 있다. 디스플레이 화면(70a)은 LCD 패널(liquid crystal display, 액정 디스플레이) 및/또는 터치 스크린 등을 포함할 수 있고, 스피커(70g)는 전원제어장치, 전자태그와 관련되는 정보를 녹음된 음성, 기계 음성, 효과음 등으 로 출력할 수 있다. 제1 알람 표시부(70b)는 전원장치(및/또는 전원제어장치)의 전원상태에 상응하는 정보를 표시할 수 있 다. 일 예로, 상기 전원상태가 온(on)에 상응하는 경우에는 상기 제1 알람 표시부(70b)는 발광하거나 점등(및/ 또는 점멸)할 수 있다. 제2 알람 표시부(70c)는 전원장치(및/또는 전원제어장치)의 운전상태에 상응하는 정보를 표시할 수 있 다. 일 예로, 상기 운전상태가 '운전중'에 상응하는 경우에는 상기 제2 알람 표시부(70c)는 발광하거나 점등(및 /또는 점멸)할 수 있다. 제3 알람 표시부(70d)는 전원장치(및/또는 전원제어장치)의 정지상태에 상응하는 정보를 표시할 수 있 다. 일 예로, 상기 전원장치(및/또는 전원제어장치)가 정지되거나 동작을 하지 않는 경우에는 상기 제 3 알람 표시부(70d)는 발광하거나 점등(및/또는 점멸)할 수 있다. 제1 입력 버튼(70e) 및/또는 제2 입력 버튼(70f)은, 예를 들면, 소정의 물리적인 신호를 인식하는 버튼일 수 있 으며, 일 예로 감압식 버튼(압력을 감지하는 버튼)이거나, 다른 예로 정전식 버튼(정전기의 발생 및/또는 변화 를 감지하는 버튼)일 수 있다. 예를 들면, 제1 입력 버튼(70e)은 차단기 on/off에 상응하는 버튼일 수 있으며, 제2 입력 버튼(70f)은 '확인' (및/또는 '입력', '선택')에 상응하는 버튼일 수 있다. 도 1c를 참조하면, 전원제어장치의 전자태그 표시부는 제4 알람 표시부(70h), 제5 알람 표시부(70i), 제6 알람 표시부(70j)를 포함할 수 있다. 제4 알람 표시부(70h)는 전자태그가 발행(및/또는 생성) 중임을 나타내는 정보를 표시할 수 있다. 일 예로, 특 정 전자태그가 발행 중인 경우에는 상기 제4 알람 표시부(70h)는 발광하거나 점등(및/또는 점멸)할 수 있다. 제5 알람 표시부(70i)는 전자태그가 회수되었음을 나타내는 정보를 표시할 수 있다. 일 예로, 특정 전자태그가 회수된 경우에는 상기 제5 알람 표시부(70i)는 발광하거나 점등(및/또는 점멸)할 수 있다. 상기 '전자태그가 회 수되었음을 나타내는 정보'는 관리서버에 의해 생성될 수 있으며, 구체적인 일 예로, 차단기 조작자(및/또 는 사용자B(예; SBO) 및/또는 사용자C(예; 발전차장))가 상기 차단기 조작자의 단말을 통하여 '전자태그 회수' 에 상응하는 정보 입력, 버튼 선택 등을 하는 경우에 상기 관리서버에 의해 생성될 수 있다. 제6 알람 표시부(70j)는 전자태그에 대한 요청이 없음을 나타내는 정보를 표시할 수 있다. 일 예로, 소정의 시 간 동안 전자태그에 대한 요청이 없는 경우에는 상기 제6 알람 표시부(70j)는 발광하거나 점등(및/또는 점멸)할 수 있다. 또한 전자태그 표시부는 다중(multi) 전자태그와 관련될 수 있으며, 다음과 같은 특징을 포함할 수 있다. 1) 해당 부서에서 Tag 발행 요청 : 전자 Tag 상에 붉은 색 표시, 2) 타 부서에서도 Tag 발행 요청 가능하며, Tag 발행 수 만큼 붉은 색으로 버튼 점등, 3) 발행 Tag 표시 버튼 터치 시, 해당 Tag 내용 표시 됨, 4) 작업 완 료 후 Tag 회수 시, 녹색으로 해당 버튼 점등, 5) 모든 Tag 회수 후 차단기 On 하면, 모든 표시 버튼 점멸 (비 활성화), 6) 점멸되는 버튼은 터치 안될 수 있다. 상기 1)과 관련하여, 제1 부서(및/또는 상기 제1 부서의 사용 자)가 전자태그의 발행(및/또는 생성)을 요청한 경우, 상기 제4 알람 표시부(70h)는 소정의 점등 신호를 출력 (및/또는 점등)할 수 있다. 상기 2)와 관련하여, 제2 부서(및/또는 상기 제2 부서의 사용자)가 전자태그의 발행 (및/또는 생성)을 요청한 경우, 상기 제4 알람 표시부(70h)는 소정의 점등 신호를 출력(및/또는 점등)할 수 있 으며, 발행되는 전자태그의 개수만큼 점등할 수도 있다. 도 2는 본 발명의 일 실시예에 따른 전원제어장치 관리 시스템을 나타내는 도면이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 전원제어장치 관리 시스템은 전원제어장치, 관리서버 , 및 사용자 단말을 포함할 수 있다. 관리서버의 구체적인 구성에 대해서는 도 3을 참조하여 후술하며, 관리서버는 전원제어장치를 직 접 제어하거나, 사용자 단말을 통하여 상기 전원제어장치를 간접적으로 제어할 수도 있다.사용자 단말은 사용자가 사용하는 단말(예; 스마트폰을 포함하는 이동 통신 단말기 뿐만 아니라 데스크톱 컴퓨터, 노트북 컴퓨터, 워크스테이션, 팜톱(palmtop) 컴퓨터, 개인 휴대 정보 단말기(personal digital assistant: PDA), 웹 패드 등과 같이 메모리 수단을 구비하고 마이크로 프로세서를 탑재하여 연산 능력을 갖춘 디지털 기기, 입출력 인터페이스를 포함하는 소정의 디바이스 등)일 수 있다. 사용자 단말은 전원관리장치를 제어(및/또는 관리)하는 플랫폼을 제공하는 웹사이트 및/또는 모바일앱을 실행할 수 있다. 상기 웹사이트 및/또는 모바일앱은 관리서버에 의해 운용될 수 있다. 사용자는 사용자 단 말에서 실행되는 웹사이트 및/또는 모바일앱을 통하여 제1 정보를 입력할 수 있다. 상기 제1 정보는 사용 자 단말로부터 관리서버에게 전달되고, 상기 관리서버 및/또는 저장 모듈에 기록될 수 있 다. 제1 정보는 상기 사용자의 개인 정보를 포함할 수 있다. 여기서 개인정보는 사용자의 이름, 아이디(ID; identifier), 패스워드, 도로명 주소, 전화 번호, 휴대폰 번호, 이메일 주소, 및/또는 관리서버에 의해 생 성되는 리워드(reward)(예; 포인트 등)를 나타내는 정보 등을 포함할 수 있다. 또한 제1 정보는 상기 사용자가 본 발명의 웹사이트 및/또는 모바일앱을 통하여 결제한 금액 및/또는 내역(결제내역)에 대한 정보, 상기 사용자 가 지급받거나 사용한 리워드(포인트)에 대한 정보를 더 포함할 수도 있다. 관리서버는 상기 제1 정보가 소정의 기준을 만족하는지 여부에 기반하여 특정 프로세스를 실행할지 여부를 결정할 수 있다. 일 예로, 관리서버는 상기 제1 정보에 포함되는 개인 정보에 기반하여 본인 인증 프로세 스를 실행하도록 제어할 수 있다. 또한 본 발명의 일 실시예에 따른 전원제어장치 관리 시스템은 전원제어장치에 상응하는 제1 전원제어 장치, 제2 전원제어장치, 및 제3 전원제어장치를 포함하고, 관리서버 및 사용자 단말 (또는 네비게이터)을 포함할 수 있으며, 이에 대해서는 도 6을 참조하여 후술하도록 한다. 도 3은 본 발명의 일 실시예에 따른 관리서버를 나타내는 블록도이다. 도 3을 참조하면, 관리서버는 제어 모듈, 통신 모듈, 입력 모듈, 출력 모듈, 및 저장 모듈을 포함할 수 있다. 제어 모듈은 본 발명의 일 실시예에 따른 동작/단계/과정을 구현할 수 있도록 관리서버 및/또는 사용 자 단말을 직/간접적으로 제어할 수 있다. 또한 제어 모듈은 적어도 하나의 프로세서를 포함할 수 있 으며, 프로세서는 적어도 하나의 중앙 처리 유닛(CPU) 및/또는 적어도 하나의 그래픽 처리 디바이스(GPU)를 포 함할 수 있다. 또한 제어 모듈은 API(Application Programming Interface), IoT(Internet of Things), IIoT(Industrial Internet of Things), ICT(Information & Communication Technology) 기술에 기반하여 제어 정보(예; 명령어) 등을 생성하거나 및/또는 관리할 수 있다. 통신 모듈은 관리서버 및/또는 사용자 단말 등과 각종 데이터, 신호, 정보를 송수신할 수 있다. 또한, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 또한, 통신 모듈은 제1 네트워크(예: 블루투스, WiFi direct 또는 IrDA(Infrared Data Association) 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 셀룰러 네트워크, 인터 넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성 요소(예: 단일 칩)으로 통합되거나, 또는 서로 별도의 복수의 구성 요소들(예: 복수 칩들)로 구현될 수 있다. 입력 모듈은 관리서버 및/또는 사용자 단말의 구성요소(예: 제어 모듈 등)에 사용될 명령 또는 데이터를 관리서버 및/또는 사용자 단말의 외부(예: 사용자(예; 제1 사용자, 제2 사용자 등), 관리서버의 관리자 등)로부터 수신할 수 있다. 또한, 입력 모듈은 관리서버 및/또는 사용자 단 말에 설치된 터치인식가능 디스플레이, 터치패드, 버튼형 인식 모듈, 음성인식센서, 지문인식센서, 홍채인 식센서, 마이크, 마우스, 또는 키보드 등을 포함할 수 있다. 여기서 터치인식가능 디스플레이, 터치패드, 버튼 형 인식 모듈은 감압식 및/또는 정전식 방식을 통하여 사용자의 신체(예; 손가락)를 통한 터치를 인식할 수 있 다. 출력 모듈은 관리서버 및/또는 사용자 단말의 제어 모듈에 의해 생성되거나 통신 모듈 을 통하여 획득된 신호(예; 음성 신호), 정보, 데이터, 이미지, 및/또는 각종 객체(object) 등을 표시하는모듈이다. 예를 들면, 출력 모듈은 디스플레이, 스크린, 표시부(displaying unit), 스피커 및/또는 발광장 치(예; LED 램프) 등을 포함할 수 있다. 또한, 관리서버 및/또는 사용자 단말은 저장 모듈(storage module)을 더 포함할 수 있으며, 관 리서버 및/또는 사용자 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장한다. 또한, 저장 모듈은 플래시 메모리 타입(Flash Memory Type), 하드 디스크 타입(Hard Disk Type), 멀티미디어 카드 마이크로 타입(Multimedia Card Micro Type), 카드 타입의 메모리(예를 들면, SD 또는 XD 메모리 등), 자기 메모리, 자기 디스크, 광디스크, 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), PROM(Programmable Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory) 중 적어도 하나의 저장매체를 포함할 수 있다. 또한, 저장 모듈 은 클라우드 서버(cloud server), 빅데이터(big data) 서버 등을 포함할 수도 있다. 또한 저장 모듈은 사용자 단말을 사용하는 고객(제1 사용자)의 개인정보, 및/또는 관리서버의 관리자(제2 사용자)의 개인정보 등을 저장할 수 있다. 여기서 개인정보는 이름, 아이디(ID; identifier), 패스 워드, 도로명 주소, 전화 번호, 휴대폰 번호, 이메일 주소, 및/또는 관리서버에 의해 생성되는 리워드 (reward)(예; 포인트 등)를 나타내는 정보 등을 포함할 수 있다. 또한 제어 모듈은 상기 저장 모듈에 저장된 각종 이미지, 프로그램, 컨텐츠, 데이터 등을 이용하여 다양한 동작을 수행할 수 있다. 도 4는 본 발명의 일 실시예에 따른 방법을 나타내는 흐름도이다. 여기서 SBO는 급전 운영 담당자(Switch Board Operator)를 의미할 수 있다. 본 발명의 일 실시예에 따른 방법은 전자태그(및/또는 전자태그 표시부)에 대한 제1 이벤트(예; 전자태그의 발행(및/또는 생성))가 수행되는 단계(X-1단계), 잠금부에 대한 제2 이벤트(예; 잠금부가 잠금되는 동 작)가 수행되는 단계(X-2단계), 전자태그(및/또는 전자태그 표시부)에 대한 제3 이벤트(예; 전자태그의 발 행(및/또는 생성))을 요청하는 단계(X-3단계), 및/또는 잠금부에 대한 제4 이벤트(예; 잠금부의 잠금이 해제되는 동작)가 수행되는 단계(X-4단계)를 포함할 수 있으며, 그 순서는 변경될 수 있으며, 구체적으로 아래 와 같은 내용에 기반하여 구현될 수 있다. 도 4를 참조하면, 특정기기에 대한 이벤트(불량) 및/또는 현장작업사항이 발생하면(S1), 사용자A(예; 현장감 독)는 전자태그의 발행(및/또는 생성)을 요청할 수 있다(S2). 예를 들면, 사용자A는 자신의 단말 및/또는 관리서버을 통하여 전자태그의 발행을 요청하는 정보를 입력할 수 있다. 일 예로, 사용자A는 자신의 단말 및/또는 관리서버을 통하여 상기 특정기기에 상응하는 특정 전자태그의 발행을 요청하는 정보를 입 력할 수 있다. 이를 위해 단말은 본 발명의 전자태그의 요청/생성/회수/기록관리 등과 관련되는 정보를 입출력할 수 있는 플랫폼을 제공하는 웹사이트 및/또는 모바일앱(어플리케이션)을 실행할 수 있으며, 상기 웹사이트 및/또는 모바 일앱은 관리서버에 의해 운용될 수 있다. 그리고, 사용자B(예; SBO)는 대장기록을 관리서버를 통하여 발행(및/또는 생성)하거나 입력할 수 있으며 (S3), 사용자C(예; 발전차장)는 전자태그의 발행을 상기 관리서버를 통하여 승인할 수 있으며(S4), 상기 관리서버는 전자태그를 발행(및/또는 생성)하여 출력할 수 있다(S5). 여기서 관리서버가 발행하는 전 자태그는 특정기기에 상응하는 것일 수 있다. 그리고, 전기실에 들어간 사용자B(예; SBO)는 전자태그가 발행(및/또는 생성) 중임을 확인하고(S6), 전기 실에 들어간 사용자B는 전자태그가 발행된 차단기를 오프(off)하고(S7), 관리서버는 전자태그를 발행 할 수 있다(S8). 그리고, 현장에서 작업자가 현장작업을 수행하고(S9), 완료하면(S10), 사용자A(예; 현장감독)는 전자태그의 회 수를 요청할 수 있다(S11). 그리고, 사용자B(예; SBO)는 관리서버를 통하여 대장기록을 확인하고(S12), 전기실에 들어간 사용자B 는 전자태그가 회수 중임을 확인하고(S13), 전기실에 들어간 사용자B는 전자태그가 발행(및/또는 생성)된 차단기를 온(on)하고(S14), 관리서버는 대장기록을 회수하도록 제어할 수 있다(S15). 그리고 본 발명의 일 실시예에 따른 방법은 아래와 같은 특징을 포함할 수 있다. 전원제어장치에는 도 1a에 도시된 바와 같은 도어부가 설치되어 있을 수 있으며, 전자태그 표시부 가 포함되어 있을 수 있다. 여기서 전자태그 표시부는 전자식 LED 스크린일 수 있으며, 상기 전자태그 표시부는 평소에는 기기명만 표시(및/또는 출력)될 수도 있다. 사용자A(작업감독)이 차단기 조작자(및/또는 사용자B(예; SBO) 및/또는 사용자C(예; 발전차장))를 찾아와 특정 기기에 대한 작업을 할 예정이니, 상기 특정 기기의 차단기를 내려달라(즉, 전력/전류 off)는 요청을 할 수 있 다. 그리고, 차단기 조작자(및/또는 사용자B(예; SBO) 및/또는 사용자C(예; 발전차장))는 상기 차단기 조작자의 단말(예; 컴퓨터, 핸드폰)을 통하여 전자태그를 발행(및/또는 생성)할 수 있다. 그러면 상기 전원제어장치 에 설치되는 전자태그 표시부 및/또는 점등장치에서 발광 신호가 출력될 수 있다. 차단기 조작자(및/또는 사용자B(예; SBO) 및/또는 사용자C(예; 발전차장))가 해당 차단기의 문을 열고 차단기를 내리면(즉, 전류/전력 off) 상기 전원제어장치에 설치되는 전자태그 표시부에서 전자태그가 표시(및/또는 출력)될 수 있다. 그 후에 작업(현장작업 및/또는 특정 기기에서의 작업)이 완료되면 사용자A(작업감독)이 차단기 조작자(및/또는 사용자B(예; SBO) 및/또는 사용자C(예; 발전차장))를 다시 찾아와 특정 기기에 대한 작업이 완료되었으니 차단 기를 올려달라(즉, 전류/전력 on)는 요청을 할 수 있다. 그 후에 차단기 조작자(및/또는 사용자B(예; SBO) 및/ 또는 사용자C(예; 발전차장))가 상기 차단기 조작자의 단말(예; 컴퓨터, 핸드폰)을 통하여 전자태그를 회수할 수 있다. 그러면 상기 전원제어장치에 설치되는 전자태그 표시부 및/또는 점등장치에서 발광 신호가 출 력될 수 있다. 그 후에 차단기 조작자(및/또는 사용자B(예; SBO) 및/또는 사용자C(예; 발전차장))가 와서 해당 차단기의 문(예; 도어부)을 열고 차단기를 올릴 수 있다(즉, 전류/전력 ON). 그리고 본 발명의 일 실시예에 따른 방법은 아래와 같은 특징을 포함할 수 있다. 전원제어장치에 설치되는 전자태그 표시부 및/또는 점등장치에서 발광 신호가 출력될 때, 사용자가 확 인 버튼(예; 제1 버튼, 제2 버튼, 또는 제3 버튼 등)을 누르면 상기 발광 신호의 출력이 중단될 수 있다(즉, 깜빡깜빡 거리는 불빛이 꺼짐). 상기 전자태그 표시부는 상기 발광 신호의 출력이 중단되면, 디스 플레이 화면(70a)을 통하여 해당 기기명을 표시(및/또는 출력)하거나 스피커(70g)를 통하여 해당 기기명에 상응 하는 사운드(예; 기 녹음된 음성, 기계음성 등)를 출력할 수 있다. 이는 차단기 조작자 중에 시력이 안 좋은 사 람이 있거나 정신적으로 하자가 있는 사람이 있을 수 있다는 점을 고려한 것이다. 또한 차단기(예; 전원제어장치)에 전자식 락기능(예; 도 1a의 잠금부)가 설치되어 있을 수 있다. 이때 차단기 조작자(및/또는 사용자B(예; SBO) 및/또는 사용자C(예; 발전차장))가 와서 해당 차단기의 문(예; 도어부 )을 열고 차단기를 내리면(OFF시키면), 전자태그 표시부에 전자태그가 정상 발행(및/또는 생성)되면 전 자적으로 문이 잠길 수 있다. 그 후에 작업이 완료되어 전자태그가 반납(및/또는 회수)되면 전자적으로 문이 열 리도록 하는 기능할 수 있다. 또한 기기가 작동하고 있는데 차단기 조작자(및/또는 사용자B(예; SBO) 및/또는 사용자C(예; 발전차장))가 컴퓨 터 상에서 차단기(예; 도 1a의 스위치)를 내리려고 차단기 OFF 전자태그를 발급하려고 클릭을 하면 차단기 조작자의 단말(예; 컴퓨터, 핸드폰)에서 해당 차단기 OFF가 불가능하도록 할 수 있으며, 차단기 OFF가 불가능하 다는 알람이 표시되거나 출력될 수 있다. 한편, 공기업은 망분리가 되어있어서(예; 인트라넷, 사내 네트워크 등) 사내 망용 핸드폰을 사용해야 본 발명의 일 실시예에 따른 방법 등을 이용할 수 있으며, 사기업은 망분리가 안되어 있어서 핸드폰 애플리케이션을 통해 서도 본 발명의 일 실시예에 따른 방법 등을 이용할 수 있다. 도 5는 본 발명의 일 실시예에 따른 전기실 및 네비게이터를 설명하기 위한 도면이다. 도 5를 참조하면, 본 발명의 일 실시예에 따른 전기실에는 네비게이터, 카메라 장치, 제1 전원 제어장치, 제2 전원제어장치, 및 제3 전원제어장치를 포함할 수 있다. 네비게이터는 특정 차단기가 위치하는 장소에 익숙하지 않은 인력도 상기 특정 차단기(예; 제1 전원제어장 치, 제2 전원제어장치, 또는 제3 전원제어장치)가 어디에 위치하는지 여부를 안내해주는 기능을 포함하는 장치로서, 전기실의 내부 및/또는 입구에 설치될 수 있다. 본 발명은 이러한 네비게이터를 통한 2차 정보 확인 방법을 제안함으로써 사람의 실수로 인한 에러를 방지할 수 있는 기술적인 효과를 제공할 수 있다. 또한 상기 네비게이터가 전기실의 입구에 설치되는 경우에는, 상기 전기실의 입구에서 부터 전체 차단기의 상태를 용이하게 확인할 수 있다는 장점과 비정상 상황이 발생한 경우에도 상기 전기실 의 입구에서부터 사전 상태를 파악할 수 있다는 점에서도 효율적이라고 할 수 있다. 한편, 도 5에 도시된 바와 같이 전기실에는 카메라 장치가 설치될 수 있으며, 관리서버는 상기 카메라 장치를 통하여 촬영되는 영상 및/또는 획득되는 이미지 정보(예; 정지 이미지, 동적 이미지)에 기반하여 사용자의 움직임(및/또는 동선)을 확인하거나 식별할 수 있다. 이는 관리서버의 카메라 모듈 을 통하여 구현될 수 있으며, 이에 대해서는 도 6을 참조하여 구체적으로 후술한다. 카메라 장치는 다방향 카메라 및/또는 전방향 카메라(예; 어안 카메라)를 포함할 수 있다. 여기서 다방향 카메라는 복수의 카메라를 포함할 수 있으며, 복수의 영상 인식 장치(예; IP(Internet Protocol) 카메라 또는 CCTV(closed circuit television) 카메라 등), 복수의 렌즈, 복수의 카메라 제어 장치, 복수의 조명장치 등을 포함하거나 이를 제어하기 위한 모듈을 포함할 수 있다. 또한, 전방향 카메라는 어안(fisheye) 카메라를 포함할 수 있다. IP 카메라는 전기실의 외부에서도 상기 카메라 장치가 설치된 전기실의 내부 상황을 사용자 단말(예; 스마트폰, 휴대폰 등)로 확인하거나 점검하도록 할 수 있다. 도 6은 본 발명의 일 실시예에 따른 관리서버의 제어 모듈을 나타내는 블록도이다. 도 6을 참조하면, 제어 모듈은 카메라 모듈 및 인공지능 모듈을 포함한다. 카메라 모듈은 상기 카메라 장치를 통하여 획득되는 영상 및/또는 이미지 정보를 분석하여 소정의 정 보를 생성할 수 있다. 카메라 모듈은 HOG(Histogram of Oriented Gradient), Haar-like feature, Co- occurrence HOG, LBP(local binary pattern), FAST(features from accelerated segment test) 등과 같은 객체 특징 추출을 위한 다양한 알고리즘을 통하여, 상기 카메라 장치을 통하여 획득되는 영상(및/또는 이미지 정보)에서 영상(및/또는 이미지 정보)에 포함되는 객체의 윤곽선을 추출하거나 및/또는 상기 추출되는 객체의 영역에서 소정의 글씨(또는 소정의 정보에 상응하는 윤곽선)를 획득할 수 있다. 또한, 카메라 모듈은 상기 카메라 장치을 통하여 획득되는 영상(및/또는 이미지 정보)에서 추출되는 객체에 상응하는 영역을 마스킹 처리하여 마스킹 영상 정보를 생성할 수 있다. 이때, 마스킹 처리 과정은, 예를 들면, 차분영상 방법, GMM(Gaussian Mixture Models)을 이용하는 MOG(Model of Gaussian) 알고리즘, 코드북(Codebook) 알고리즘 등과 같은 객체와 배경을 분리하기 위한 배경 모델링을 통해 객체에 해당하는 객체 후보 영역을 추출하는 방법을 이 용할 수 있다. 또한, 카메라 모듈은 상기 카메라 장치가 설치된 장소에 대한 정보에 기반하여 상기 카메라 장치 을 제어할 수 있다. 예를 들어, 상기 카메라 장치가 설치된 전기실에 대한 출입 정보를 상기 카메라 모듈은 획득할 수 있다. 일 예로, 상기 카메라 장치가 설치된 전기실에는 복수의 출입구(예; 제1 출입구, 제2 출입 구 등)(예; 출입문, 비상구)가 존재할 수 있으며, 예를 들면, 상기 카메라 장치을 통하여 획득되는 영상 (및/또는 이미지 정보)에서 추출되는 객체가 사람(또는 직원)에 상응할 수 있으며, 상기 추출되는 객체가 상기 제1 출입구(또는 상기 제2 출입구)를 통하여 입장하였음을 인식할 수 있다. 카메라 모듈은 상기 추출되는 객체가 상기 제1 출입구(또는 상기 제2 출입구)를 통하여 입장하였음이 인식 되는 횟수가 소정의 횟수 임계값 이상인 경우(또는 \"소정의 시간 동안\" 인식되는 횟수가 상기 소정의 횟수 임계 값 이상인 경우)에 제1 조건이 만족되는 것으로 판단할 수 있다. 일 예로, 상기 카메라 모듈은 상기 제1 조건이 만족되는 경우에 카메라 장치을 제어하여 상기 제1 출입구를 촬영하게 하거나, 상기 제1 출입구를 촬영한 영상에 대한 정보를 다른 영상보다 더 오랜 기간 동안 저장하거나(예를 들어, 저장 모듈에 기록), 상기 제1 출입구를 더 고화질로 촬영하거나, 상기 제1 출입구를 촬영하는 다방향 카메라 모듈(또는 다방향 카메 라 장치)에 구비된 적어도 하나 카메라 장치(또는 카메라 렌즈)를 제어하여 더 확대된 영상(예; zoom-in된 영상)을 촬영(또는 획득)하도록 제어할 수 있다. 다른 예로, 상기 카메라 모듈은 상기 제1 조건이 만족되 었음을 나타내는 정보를 상기 제어 모듈(및/또는 제1 전원제어장치, 제2 전원제어장치, 및/또는 제3 전원제어장치)에게 전달할 수 있으며, 제1 전원제어장치, 제2 전원제어장치, 및/또는 제3 전원제어장치 각각에 설치된(구비된) 잠금부가 잠금되도록 제어되거나, 및/또는 전자태그 표시부 를 통하여 소정의 알람이 표시되거나 출력되도록 제어될 수 있다. 또한 카메라 모듈은 기상 정보에 기반하여 카메라 장치을 제어할 수도 있다. 예를 들어, 카메라 모듈 을 통하여 획득된 기상 정보는 날씨에 대한 포괄적인 정보(예; 일별 날씨 정보, 날씨 예상 정보, 작년 날 씨 정보 등)를 포함할 수 있다. 또한, 상기 카메라 모듈은 상기 기상 정보에 기반하여 밝기(예; 조도(lx), 광도(cd), 광속(lm), 휘도 (cd/m2 또는 sb), 광속 발산도(rlx) 등)에 대한 정보를 설정할 수 있다(예; 기준 값, 최적 값, 최저 값, 최대 값). 또한, 상기 카메라 모듈은 밝기에 대한 정보(예; 밝기의 변화)에 기반하여 카메라 장치가 설치 된 장소 및/또는 카메라 장치이 촬영하는 장소의 최적 조도를 결정(또는 산출)하고, 상기 결정된 최적 조도에 따라 카메라 장치이 촬영하도록 제어할 수 있다. 예를 들어, 카메라 모듈은 밝기에 대한 정보에 따른 가중치를 조도에 대한 값(예; 기준 조도)에 적용하여 카메라 장치가 설치된 장소 및/또는 카메라 장 치이 촬영하는 장소의 최적 조도를 결정(또는 산출)할 수 있다. 또한, 카메라 모듈은 상기 기상 정보에 기반하여 상기 카메라 장치의 전력에 대한 값(예; 예비 전력, 소비 전력, 최소 충전 전력, 최대 충전 전력 등에 대한 값) 또는 전력 모드(예; 안전 모드, 최대 성능 모드 등)를 설정할 수 있다. 예를 들어, 상기 기상 정보가 금일(오늘) 뇌우가 예상된다는 정보를 나타내는 경우, 뇌 우로 인하여 카메라 장치(또는 카메라 모듈)에 전원이 공급되지 않는(또는 전원이 끊기는) 경우를 대 비하기 위하여, 카메라 모듈은 예비 전력에 대한 값을 소정 이상의 값으로 설정하거나 전력 모드를 안전 모드로 설정할 수 있다. 또한, 카메라 모듈은 카메라 장치을 통하여 획득된 영상에서 영상 내 객체의 윤곽선 또는 상기 객체 에서 추출할 수 있는 글씨(또는 정보를 나타내는 윤곽선(또는 외형))를 획득할 수 있다. 예를 들면, 획득된 영 상에 찍힌 사람(즉, 객체)이 입은 옷에 새겨진 글씨를 추출할 수 있으며, 카메라 모듈은 상기 추출된 글씨 가 나타내는 정보에 기반하여 상이한 동작을 수행하거나 카메라 모듈을 제어할 수 있다. 또한, 상기 추출 된 글씨가 나타내는 정보가 특정 직업, 예를 들어, 차단기 조작자, 사용자B(예; SBO) 및/또는 사용자C(예; 발전 차장)) 등임을 나타내는 정보인 경우, 카메라 모듈은 상기 추출된 글씨가 새겨진 객체(사람)가 촬영된 영 상에 대한 특정 제어를 할 수 있다. 예를 들어, 카메라 모듈은 상기 영상을 별도의 리스트로 관리하거나, 상기 객체의 이동 경로를 추적하거나(예를 들어, 상기 객체가 이동하여 다른 영상에 촬영되었는지(또는 존재하 는지) 여부를 확인함으로써 상기 객체의 이동 경로를 추적할 수 있다), (전력 모드가 안전 모드로 설정된 경우) 상기 객체가 촬영된 영상의 저장 기간을 짧게 설정할 수 있다(상시 촬영의 대상이 되는 객체이므로, 전력 절약 을 위한 설정일 수 있다). 전술한 바와 같이 카메라 모듈은 HOG(Histogram of Oriented Gradient), Haar-like feature, Co- occurrence HOG, LBP(local binary pattern), FAST(features from accelerated segment test) 등과 같은 객체 특징 추출을 위한 다양한 알고리즘을 통하여, 상기 카메라 장치을 통하여 획득된 영상에서 영상 내 객체의 윤곽선 또는 상기 객체에서 추출할 수 있는 글씨(또는 정보를 나타내는 윤곽선(또는 외형))를 획득할 수 있다. 또한, 카메라 모듈은 관리 대상에 해당되는 객체가 획득된 영상에 포함되는 경우 소정의 이벤트를 발생시 킬 수 있다. 예를 들면, 블랙리스트와 같은 관리 대상으로 지정된 객체가 소정의 횟수 이상으로 영상에서 확인 되는 경우(또는 카메라 모듈에 의해 획득된 영상에 (소정의 횟수 이상으로) 상기 관리 대상이 포함되는 경우) 소정의 조건이 만족된 것으로 판단하여, 상기 카메라 모듈은 소정의 이벤트를 발생시킬 수 있다. 이와 관 련하여, 상기 카메라 모듈은, 예를 들면, 특정 장소에 설치된 알람 장치(예; 경고등, 스피커)가 동작하도 록 제어하거나, 상기 관리 대상의 영상을 획득하도록 카메라 장치을 제어하거나, 알람 또는 그에 상응하는 신호(또는 정보)를 서버실, 관리실, 및/또는 제어실에게 전송할 수 있다. 여기서 카메라 모듈이 상기 관리 대상의 영상을 획득하도록 카메라 장치을 제어하는 것은, 예를 들면, 상기 카메라 장치이 상기 관리 대상에 대한 고화질 영상을 획득하도록 제어할 수 있다(예를 들면, 주변 배경 또는 다른 객체보다 상기 관리 대 상이 촬영된 부분에 대해서는 더 높은 화질로 카메라 모듈, 카메라 장치, 및/또는 후술하는 저장 모 듈에 저장 또는 관리토록 할 수 있다). 또한, 카메라 모듈이 상기 관리 대상의 영상을 획득하도록 카 메라 장치을 제어하는 것은, 예를 들면, 상기 카메라 장치(또는 상기 카메라 모듈 및/또는 상기 카메라 장치가 제어하는 카메라)이 상기 관리 대상을 계속 촬영하도록 카메라 회전(또는 zoom-in, zoom- out)을 지시하는 명령어 및/또는 상기 관리 대상을 촬영하게 되는 복수의 카메라에 의해 획득되는 영상의 편집 (또는 합성)을 지시하는 명령어 등을 생성하는 동작을 포함할 수 있다. 또한, 관리 대상(또는 감시 대상)인 객체가 제1 위치에서 제4 위치로 이동하는 동안에 제1 감시 영역, 제2 감시 영역, 제3 감시 영역, 제4 감시 영역을 통과하게 되며, 각 감시 영역에 대응되어 설치된 제1 카메라 내지 제4 카메라(예; C1, C2, C3, C4)로부터 얻어지는 영상 사이에는 카메라의 스펙이나 각도 등에 의해서 차이가 발생할 수 있다. 예를 들면, 상기 제1 카메라 내지 제4 카메라 간의 상이한 카메라의 카메라 스펙, 확대(zoom-in)된 정 도(또는 축소(zoom-out)된 정도), 및/또는 촬영 각도 등에 따라 영상의 해상도, 색감, 각도 등에 차이가 발생하 며, 이에 따라 각 영상에서 추출된 객체가 동일한 객체이더라도 특징 정보 추출시 해상도, 색감, 각도 등에 의 해 상이한 값이 산출(또는 획득)될 수 있다. 이에 따라 카메라 모듈 및/또는 카메라 장치에서 서로 다른 카메라에서 촬영된 영상에서 동일 객체를 상이한 객체로 인식하여 객체 추적에 대한 신뢰성 및 효율성이 저하되며, 각 카메라의 감시 영역에 한정하여 객체 추적이 이루어지므로 객체 추적의 단절이 발생할 수 있다.이를 해결하기 위해, 카메라 모듈 및/또는 카메라 장치은 상이한 감시 영역을 대상으로 하는 제1 카 메라(C1)의 영상으로부터 상기 카메라 장치을 통해 얻어지는 객체 특징 정보를 수신할 수 있다. 이때, 상 기 카메라 장치은 제1 카메라(C1)의 감시 영역을 이동하는 객체를 상기 객체 특징 정보를 기초로 동일 객 체인지 여부를 판단하고, 이를 기초로 동일 객체에 대한 추적을 할 수 있다. 이때 상기 카메라 장치은, 예 를 들면, 칼만필터(Kalman Filter)를 이용한 객체 추적 방식을 이용할 수도 있다. 여기서 칼만필터는 잡음이 섞 여 있는 기존의 관측 값(예; 영상 또는 영상 정보)을 최소 제곱법을 통해 분석함으로써 일정 시간 후의 위치를 예측할 수 있도록 하는 최적의 수학적 계산 과정을 포함할 수 있다. 한편, 상기 카메라 모듈 및/또는 상기 카메라 장치은 동일 객체의 다양한 자세 및 위치로부터 얻어지 는 복수의 객체 특징 정보를 지속적으로 추출하여 상기 카메라 모듈로 전송할 수 있으며, 각 객체 특징 정 보에 대응되는 영상(또는 영상 정보)를 함께 상기 카메라 모듈로 전송할 수도 있다. 이때 상기 상기 카메 라 모듈은 객체 특징 정보와 영상 정보가 매핑되어 저장된 저장 모듈로부터, 입력 모듈을 통한 사용자 입력에 따라 선택된 상기 객체 특징 정보와 영상 정보를 추출할 수도 있다. 또한, 상기 카메라 모듈 및/또는 상기 카메라 장치은 제1 카메라(C1)의 감시 영역에서 상기 영상 처 리부를 통해 지속적으로 추출되어 전송되는 객체 특징 정보를 획득(또는 수신)할 수 있다. 또한, 상기 카 메라 모듈 및/또는 상기 카메라 장치은 상기 저장 모듈에 상기 객체 특징 정보와 미리 설정된 수준 이상 일치하는 기존 객체 특징 정보가 존재하는지 여부를 판단할 수 있다. 이때, 상기 카메라 모듈는 상기 객체 특징 정보와 기존 객체 특징 정보를 비교하여 미리 설정된 수준 이상 일치하는 기존 객체 특징 정보 가 없는 경우, 객체 특징 정보를 서버(예; 후술하는 도 3의 카메라 모듈)에 요청할 수 있다. 또한, 상기 카메라 모듈 및/또는 상기 카메라 장치은 객체 특징 정보에 대응되는 객체에 대한 새로운 식별자(ID; identifier)를 부여하여 상기 저장 모듈에 상기 식별자와 객체 특징 정보를 매핑하여 저장할 수 있다. 인공지능 모듈은 인공지능망을 운용하는 하드웨어 모듈 및/또는 소프트웨어 모듈일 수 있으며, 상기 인공 지능망에 기반하여 소정의 임계치를 결정하거나 생성할 수 있다. 또한, 인공지능 모듈은 저장 모듈에 저장된 빅데이터(big data)에 기계학습(machine learning)을 이용하여 상기 소정의 임계치를 결정하거나 설정할 수 있다. 또한, 인공지능 모듈은 관리서버의 저장 모듈에 저장된 빅데이터를 입력변수로 하여 인공지능망 을 학습시키는데, 구체적으로는 머신러닝의 한 분야인 딥러닝(Deep Learning) 기법을 이용하여 정확한 상관 관 계가 도출될 수 있도록 학습을 수행한다. 예를 들면, 인공지능 모듈은 상기 카메라 장치를 통하여 획 득되는 영상 및/또는 이미지 정보, 소정의 임계치 등을 학습데이터로 하여 상기 인공지능망을 학습시킬 수 있다. 예를 들면, 인공지능 모듈은 상기 학습된 인공지능망을 이용하여 상기 소정의 임계치를 결정하거나 재설정할 수 있다. 또한 인공지능 모듈은 딥러닝을 통하여 상기 함수에서의 복수 개의 입력들의 가중치(weight)를 학습을 통 하여 산출할 수 있다. 또한, 이러한 학습을 위하여 활용되는 인공지능망 모델로는 RNN(Recurrent Neural Network), DNN(Deep Neural Network) 및 DRNN(Dynamic Recurrent Neural Network) 등 다양한 모델들을 활용할 수 있을 것이다. 여기서 RNN은 현재의 데이터와 과거의 데이터를 동시에 고려하는 딥 러닝 기법으로서, 순환 신경망(RNN)은 인공 신경망을 구성하는 유닛 사이의 연결이 방향성 사이클(directed cycle)을 구성하는 신경망을 나타낸다. 나아가, 순환 신경망(RNN)을 구성할 수 있는 구조에는 다양한 방식이 사용될 수 있는데, 예컨대, 완전순환망(Fully Recurrent Network), 홉필드망(Hopfield Network), 엘만망(Elman Network), ESN(Echo state network), LSTM(Long short term memory network), 양방향(Bi-directional) RNN, CTRNN(Continuous-time RNN), 계층적 RNN, 2차 RNN 등이 대표적인 예이다. 또한, 순환 신경망(RNN)을 학습시키기 위한 방법으로서, 경사 하강법, Hessian Free Optimization, Global Optimization Method 등의 방식이 사용될 수 있다. 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 기술 내용을 쉽게 설명하고 본 발명의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 즉 본 발명의 기술적 사 상에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 발명의 속하는 기술 분야에서 통상의 지식을 가진 자 에게 자명한 것이다. 또한 상기 각각의 실시예는 필요에 따라 서로 조합되어 운용할 수 있다. 예컨대, 본 발명 의 모든 실시예는 일부분들이 서로 조합되어 전원제어장치, 시스템, 관리서버, 및/또는 사용자 단말에 의해 구현될 수 있다.또한, 본 발명에 따른 전원제어장치, 시스템, 관리서버, 및/또는 사용자 단말을 제어하는 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 이와 같이, 본 발명의 다양한 실시예들은 특정 관점에서 컴퓨터 리드 가능 기록 매체(computer readable recording medium)에서 컴퓨터 리드 가능 코드(computer readable code)로서 구현될 수 있다. 컴퓨터 리드 가 능 기록 매체는 컴퓨터 시스템에 의해 리드될 수 있는 데이터를 저장할 수 있는 임의의 데이터 저장 디바이스이 다. 컴퓨터 리드 가능 기록 매체의 예들은 읽기 전용 메모리(read only memory: ROM)와, 랜덤-접속 메모리 (random access memory: RAM)와, 컴팩트 디스크- 리드 온니 메모리(compact disk-read only memory: CD-ROM)들 과, 마그네틱 테이프(magnetic tape)들과, 플로피 디스크(floppy disk)들과, 광 데이터 저장 디바이스들, 및 캐 리어 웨이브(carrier wave)들(인터넷을 통한 데이터 송신 등)을 포함할 수 있다. 컴퓨터 리드 가능 기록 매체는 또한 네트워크 연결된 컴퓨터 시스템들을 통해 분산될 수 있고, 따라서 컴퓨터 리드 가능 코드는 분산 방식으로 저장 및 실행된다. 또한, 본 발명의 다양한 실시예들을 성취하기 위한 기능적 프로그램들, 코드, 및 코드 세그 먼트(segment)들은 본 발명이 적용되는 분야에서 숙련된 프로그래머들에 의해 쉽게 해석될 수 있다. 추가적으로, 카메라 모듈은 소정의 단말(예; 차단기 조작자의 단말, 또는 관리자 단말)을 이용하여 상기 카메라 장치에 포함되는 다방향 카메라 및/또는 전방향 카메라의 초점을 맞추도록 제어할 수 있다. 한편, 설명의 편의를 위해 상기 소정의 단말을 이하 초점기준 단말이라고 칭할 수 있다. 상기 초점기준 단말의 위치 정보가 나타내는 제1 위치 정보와 상기 카메라 장치가 위치하는 정보를 나타내 는 제2 위치 정보 사이의 거리 차를 나타내는 거리 정보가 소정의 임계값보다 낮은 경우 상기 카메라 장치 및/또는 상기 카메라 모듈는 초점 설정 모드로 동작하거나 설정될 수 있다. 다시 말해 상기 초점기준 단말 이 상기 카메라 장치로부터 소정의 거리 내에 위치하는 경우 상기 초점 설정 모드를 수행하는 조건이 만족 된 것으로 볼 수 있다. 상기 초점 설정 모드로 설정된 카메라 모듈는 상기 카메라 장치의 다방향 카 메라와 전방향 카메라가 순차적으로 작동하도록 제어할 수 있다. 예를 들면, 상기 초점 설정 모드가 설정되면, 상기 다방향 카메라가 제1 초점 타이밍부터 제2 초점 타이밍 사이에 상기 초점기준 단말을 기준으로 상기 다방 향 카메라의 초점을 맞추기 위한 동작을 수행하고, 상기 전방향 카메라가 제3 초점 타이밍부터 제4 초점 타이밍 사이에 상기 초점기준 단말을 기준으로 상기 전방향 카메라의 초점을 맞추기 위한 동작을 수행할 수 있다. 제1 초점 타이밍은 제2 초점 타이밍보다 우선하고, 제3 초점 타이밍은 제4 초점 타이밍보다 우선할 수 있다. 한편, 상기 초점기준 단말은 상기 제1 초점 타이밍과 상기 제2 초점 타이밍 사이, 그리고 상기 제3 초점 타이밍 과 상기 제4 초점 타이밍 사이에는 이동하지 않는 것이 바람직할 수 있다. 그러나, 상기 제1 초점 타이밍과 상 기 제2 초점 타이밍 사이, 그리고 상기 제3 초점 타이밍과 상기 제4 초점 타이밍 사이에 상기 초점기준 단말이 소정의 기준 이상 이동하는 경우, 이는 상기 초점기준 단말의 사용자(또는 관리자)가 상기 장치 내 카메라들의 초점을 다시 맞추려는 의도가 있는 것으로 간주하여, 상기 장치 내 카메라들의 초점을 맞추는 동작을 다시 시작 하도록 제어할 수 있다. 예를 들면, 상기 초점기준 단말의 제1 위치 정보는 GNSS(Global Navigation Satellite System) 정보 및/또는 적어도 하나의 근거리 통신 신호(예; 비콘(beacon) 신호)에 기반하여 획득될 수 있으며, 상기 초점기준 단말의 높이를 나타내는 높이 정보는 상기 초점기준 단말에 구비된 기압계에 의해 측정되는 기압 에 기반하여 획득(및/또는 설정)될 수 있다. 일 예로, 상기 제1 위치 정보에 대한 제1 변화량이 위치 고정 임계 값보다 높고 상기 높이 정보에 대한 제2 변화량이 높이 고정 임계값보다 높은 경우 상기 장치 내 카메라들의 초 점을 맞추는 동작을 다시 시작될 수 있다(또는 초점을 맞추는 프로세스가 재실행될 수 있다). 다른 예로, i) 상 기 제1 위치 정보에 대한 제1 변화량이 위치 고정 임계값보다 높고 상기 높이 정보에 대한 제2 변화량이 높이 고정 임계값보다 낮은 경우, ii) 상기 제1 위치 정보에 대한 제1 변화량이 위치 고정 임계값보다 낮고 상기 높 이 정보에 대한 제2 변화량이 높이 고정 임계값보다 높은 경우에는, 초점기준 단말의 관리자(또는 사용자)가 초 점을 다시 맞추려는 의도가 있었던 것이 아닌, 실수로 이동하여 초점기준 단말의 위치/높이가 달라진 것으로 볼 수 있으므로, 상기 카메라 장치 및/또는 카메라 모듈는 상기 카메라 장치로 하여금 알람 신호를 출력할 수 있다. 이를 통해 상기 초점기준 단말의 사용자(또는 관리자)는 자신이 움직여서 카메라의 초점을 맞 추는데 방해하였음을 인지할 수 있다. 또한 본 발명의 다양한 실시예들에 따른 장치 및 방법은 하드웨어, 소프트웨어 또는 하드웨어 및 소프트웨어의 조합의 형태로 실현 가능하다는 것을 알 수 있을 것이다. 이러한 소프트웨어는 예를 들어, 삭제 가능 또는 재기 록 가능 여부와 상관없이, ROM 등의 저장 장치와 같은 휘발성 또는 비휘발성 저장 장치, 또는 예를 들어, RAM, 메모리 칩, 장치 또는 집적 회로와 같은 메모리, 또는 예를 들어 콤팩트 디스크(compact disk: CD), DVD, 자기 디스크 또는 자기 테이프 등과 같은 광학 또는 자기적으로 기록 가능함과 동시에 기계(예를 들어, 컴퓨터)로 읽을 수 있는 저장 매체에 저장될 수 있다. 본 발명의 다양한 실시예들에 따른 방법은 제어부(제어 모듈) 및 메모리를 포함하는 컴퓨터 또는 휴대 단말에 의해 구현될 수 있고, 이러한 메모리는 본 발명의 실시예들을 구현 하는 명령들을 포함하는 프로그램 또는 프로그램들을 저장하기에 적합한 기계로 읽을 수 있는 저장 매체의 한 예임을 알 수 있을 것이다. 따라서, 본 발명은 본 명세서의 청구항에 기재된 장치 또는 방법을 구현하기 위한 코드를 포함하는 프로그램 및 이러한 프로그램을 저장하는 기계(컴퓨터 등)로 읽을 수 있는 저장 매체를 포함한다. 또한, 이러한 프로그램은 유선 또는 무선 연결을 통해 전달되는 통신 신호와 같은 임의의 매체를 통해 전자적으로 이송될 수 있고, 본 발 명은 이와 균등한 것을 적절하게 포함한다. 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 기술 내용을 쉽게 설명하고, 본 발명의 이해를 돕 기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 또한 앞서 설명된 본 발명에 따른 실시예들은 예시적인 것에 불과하며, 당해 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 범위의 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위 는 다음의 특허청구범위에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2020-0110015", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 특정한 바람직한 실시예들의 상기에서 설명한 바와 같은 또한 다른 측면들과, 특징들 및 이득들은 첨 부 도면들과 함께 처리되는 하기의 설명으로부터 보다 명백하게 될 것이다. 도 1a는 본 발명의 일 실시예를 따른 전원제어장치를 나타내는 도면이다. 도 1b 및 도 1c는 본 발명의 일 실시예를 따른 전원제어장치의 전자태그 출력부를 나타내는 도면이다. 도 2는 본 발명의 일 실시예에 따른 전원제어장치 관리 시스템을 나타내는 도면이다. 도 3은 본 발명의 일 실시예에 따른 관리서버를 나타내는 블록도이다. 도 4는 본 발명의 일 실시예에 따른 방법을 나타내는 흐름도이다. 도 5는 본 발명의 일 실시예에 따른 전기실 및 네비게이터를 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에 따른 관리서버의 제어 모듈을 나타내는 블록도이다. 상기 도면들을 통해, 유사 참조 번호들은 동일한 혹은 유사한 엘리먼트들과, 특징들 및 구조들을 도시하기 위해 사용된다는 것에 유의해야만 한다."}
