{"patent_id": "10-2023-0095487", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0014835", "출원번호": "10-2023-0095487", "발명의 명칭": "캐시 메모리를 포함하는 전자 장치 및 전자 장치의 동작 방법", "출원인": "삼성전자주식회사", "발명자": "박성식"}}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(100)에 있어서,적어도 하나의 명령어(instruction)를 저장하는 메모리(130);캐시(cache) 데이터를 저장하는 캐시 메모리(141);상기 메모리(130)에 저장된 상기 적어도 하나의 명령어를 실행하는 적어도 하나의 프로세서(110); 및통신 인터페이스(340)를 포함하고,상기 적어도 하나의 프로세서(110)는 상기 적어도 하나의 명령어를 실행함으로써,서버(150)로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신하고,상기 네트워크 데이터를 상기 서버(150)로부터 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 네트워크 예상 응답 성능과 상기 캐시 메모리(141)로부터 상기 네트워크 데이터에 대응되는 상기 캐시 데이터를 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 캐시 예상 응답 성능을 비교하고,상기 비교 결과에 따라, 상기 통신 인터페이스(340)를 통하여 상기 서버(150)에 상기 네트워크 데이터를 요청하여 상기 네트워크 데이터를 획득하거나, 또는 상기 캐시 메모리(141)에 상기 캐시 데이터를 요청하여 상기 캐시데이터를 획득하고,상기 획득된 네트워크 데이터 또는 상기 획득된 캐시 데이터를 처리하는 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 명령어를 실행함으로써,상기 서버(150)에 상기 네트워크 데이터를 요청한 때부터 상기 서버(150)로부터 상기 네트워크 데이터를 획득할때까지의 제1 소요 시간에 기반하여 상기 네트워크 예상 응답 성능을 계산하고,상기 캐시 메모리(141)에 상기 캐시 데이터를 요청한 때부터 상기 캐시 메모리(141)로부터 상기 캐시 데이터를획득할 때까지의 제2 소요 시간에 기반하여 상기 캐시 예상 응답 성능을 계산하는 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 명령어를 실행함으로써,상기 제1 소요 시간이 상기 제2 소요 시간 이하라고 판단됨에 따라, 상기 통신 인터페이스(340)를 통하여 상기서버(150)에 상기 네트워크 데이터를 요청하여 상기 서버(150)로부터 상기 네트워크 데이터를 획득하고, 상기 제1 소요 시간이 상기 제2 소요 시간을 초과한다고 판단됨에 따라, 상기 캐시 메모리(141)에 상기 캐시 데이터를 요청하여 상기 캐시 메모리(141)로부터 상기 캐시 데이터를 획득하는 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 또는 제3 항 중 어느 하나의 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 명령어를 실행함으로써,상기 서버(150)에 상기 네트워크 데이터를 요청한 때부터 상기 서버(150)로부터 상기 네트워크 데이터를 획득할때까지의 누적된 복수의 과거 제1 소요 시간들의 평균 시간 또는 상기 서버(150)에 상기 네트워크 데이터를 요공개특허 10-2025-0014835-3-청한 때부터 상기 서버(150)로부터 상기 네트워크 데이터를 획득할 때까지의 직전의 제1 소요 시간 중 적어도하나에 기초하여 상기 제1 소요 시간을 계산하는 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 내지 제4 항 중 어느 하나의 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 명령어를 실행함으로써,상기 캐시 메모리(141)에 상기 캐시 데이터를 요청한 때부터 상기 캐시 메모리(141)부터 상기 캐시 데이터를 획득할 때까지의 누적된 복수의 과거 제2 소요 시간들의 평균 시간, 상기 캐시 메모리(141)에 상기 캐시 데이터를요청한 때부터 상기 캐시 메모리(141)로부터 상기 캐시 데이터를 획득할 때까지의 직전의 제2 소요 시간, 상기캐시 메모리(141)의 큐(queue)에 누적된 전체 데이터 요청의 수, 상기 캐시 메모리(141)의 큐(queue)에 누적된상기 전체 데이터 요청 중 상기 캐시 데이터를 위한 캐시 데이터 요청의 우선 순위(priority) 중 적어도 하나에기초하여 상기 제2 소요 시간을 계산하는 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 내지 제5 항 중 어느 하나의 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 명령어를 실행함으로써,상기 캐시 메모리(141)에 저장된 상기 캐시 데이터가 유효한지 여부를 판단하고,상기 캐시 데이터가 유효하다고 판단됨에 따라, 상기 네트워크 예상 응답 성능과 상기 캐시 응답 성능을 비교하고,상기 캐시 데이터가 비-유효하다고 판단됨에 따라, 상기 통신 인터페이스(340)를 통하여 상기 서버(150)에 상기네트워크 데이터를 요청하여 상기 서버(150)로부터 상기 네트워크 데이터를 획득하는 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 명령어를 실행함으로써,상기 캐시 데이터의 유효 기간의 만료 여부에 기초하여 상기 캐시 데이터가 유효한지 여부를 판단하는 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 내지 제7 항 중 어느 하나의 항에 있어서,상기 캐시 데이터는, 상기 서버(150)로부터 미리 획득하여 상기 캐시 메모리(141)에 저장된 데이터인 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 내지 제8 항 중 어느 하나의 항에 있어서,상기 캐시 메모리(141)는 비-휘발성(non-volatile) 메모리인 전자 장치(100)."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 내지 제9 항 중 어느 하나의 항에 있어서,상기 전자 장치(100)는 애플리케이션(application)를 실행하고,상기 네트워크 데이터 및 상기 캐시 데이터는 상기 애플리케이션을 실행하기 위한 데이터이고,상기 적어도 하나의 프로세서(110)는, 상기 적어도 하나의 명령어를 실행함으로써,상기 획득된 네트워크 데이터 또는 상기 획득된 캐시 데이터를 이용하여 상기 애플리케이션을 실행하는 전자 장치(100).공개특허 10-2025-0014835-4-청구항 11 전자 장치(100)의 동작 방법에 있어서,서버(150)로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신하는 단계(S100);상기 네트워크 데이터를 상기 서버(150)로부터 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 네트워크 예상 응답 성능과 캐시(cache) 데이터를 저장하는 캐시 메모리(141)로부터 상기 네트워크 데이터에 대응되는 상기 캐시 데이터를 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 캐시 예상 응답 성능을 비교하는 단계(S200);상기 비교 결과에 따라, 통신 인터페이스(340)를 통하여 상기 서버(150)에 상기 네트워크 데이터를 요청하여 상기 네트워크 데이터를 획득하거나(S300), 또는 상기 캐시 메모리(141)에 상기 캐시 데이터를 요청하여 상기 캐시 데이터를 획득하는 단계(S400); 및상기 획득된 네트워크 데이터 또는 상기 획득된 캐시 데이터를 처리하는 단계(S500)를 포함하는 전자 장치(100)의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 네트워크 예상 응답 성능과 상기 캐시 예상 응답 성능을 비교하는 단계(S200)는,상기 서버(150)에 상기 네트워크 데이터를 요청한 때부터 상기 서버(S150)로부터 상기 네트워크 데이터를 획득할 때까지의 제1 소요 시간에 기반하여 상기 네트워크 예상 응답 성능을 계산하는 단계(S210);상기 캐시 메모리(141)에 상기 캐시 데이터를 요청한 때부터 상기 캐시 메모리(141)로부터 상기 캐시 데이터를획득할 때까지의 제2 소요 시간에 기반하여 상기 캐시 예상 응답 성능을 계산하는 단계(S220); 및상기 네트워크 예상 응답 성능과 상기 캐시 예상 응답 성능을 비교하는 단계(S230)를 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 네트워크 예상 응답 성능과 상기 캐시 예상 응답 성능을 비교하는 단계(S230)에서는,상기 제1 소요 시간이 상기 제2 소요 시간 이하라고 판단됨에 따라, 상기 통신 인터페이스(340)를 통하여 상기서버(150)에 상기 네트워크 데이터를 요청하여 상기 서버(150)로부터 상기 네트워크 데이터를 획득하고,상기 제1 소요 시간이 상기 제2 소요 시간을 초과한다고 판단됨에 따라, 상기 캐시 메모리(141)에 상기 캐시 데이터를 요청하여 상기 캐시 메모리(141)로부터 상기 캐시 데이터를 획득하는 전자 장치(100)의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12 또는 제13 항 중 어느 하나의 항에 있어서,상기 네트워크 예상 응답 성능을 계산하는 단계(S210)에서는,상기 서버(150)에 상기 네트워크 데이터를 요청한 때부터 상기 서버(150)로부터 상기 네트워크 데이터를 획득할때까지의 누적된 복수의 과거 제1 소요 시간들의 평균 시간 또는 상기 서버(150)에 상기 네트워크 데이터를 요청한 때부터 상기 서버(150)로부터 상기 네트워크 데이터를 획득할 때까지의 직전의 제1 소요 시간 중 적어도하나에 기초하여 상기 제1 소요 시간을 계산하는 전자 장치(100)의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12 내지 제14 항 중 어느 하나의 항에 있어서,상기 캐시 예상 응답 성능을 계산하는 단계(S220)에서는,상기 캐시 메모리(141)에 상기 캐시 데이터를 요청한 때부터 상기 캐시 메모리(141)부터 상기 캐시 데이터를 획공개특허 10-2025-0014835-5-득할 때까지의 누적된 복수의 과거 제2 소요 시간들의 평균 시간, 상기 캐시 메모리(141)에 상기 캐시 데이터를요청한 때부터 상기 캐시 메모리(141)로부터 상기 캐시 데이터를 획득할 때까지의 직전의 제2 소요 시간, 상기캐시 메모리(141)의 큐(queue)에 누적된 전체 데이터 요청의 수, 상기 캐시 메모리(141)의 큐(queue)에 누적된상기 전체 데이터 요청 중 상기 캐시 데이터를 위한 캐시 데이터 요청의 우선 순위(priority) 중 적어도 하나에기초하여 상기 제2 소요 시간을 계산하는 전자 장치(100)의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11 내지 제15 항 중 어느 하나의 항에 있어서,상기 전자 장치(100)의 동작 방법은,상기 캐시 메모리(141)에 저장된 상기 캐시 데이터가 유효한지 여부를 판단하는 단계(S120)를 더 포함하고,상기 캐시 데이터가 유효한지 여부를 판단하는 단계(S120)에서,상기 캐시 데이터가 유효하다고 판단됨에 따라 상기 네트워크 예상 응답 성능과 상기 캐시 응답 성능을 비교(S200)하고, 상기 캐시 데이터가 비-유효하다고 판단됨에 따라 상기 통신 인터페이스(340)를 통하여 상기 서버(150)에 상기 네트워크 데이터를 요청하여 상기 서버(150)로부터 상기 네트워크 데이터를 획득(S300)하는 전자장치(100)의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 캐시 데이터가 유효한지 여부를 판단하는 단계(S120)에서는,상기 캐시 데이터의 유효 기간의 만료 여부에 기초하여 상기 캐시 데이터가 유효한지 여부를 판단하는 전자 장치(100)의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11 내지 제17 항 중 어느 하나의 항에 있어서,상기 캐시 데이터는, 상기 서버(150)로부터 미리 획득하여 상기 캐시 메모리(141)에 저장된 데이터인 전자 장치(100)의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11 내지 제18 항 중 어느 하나의 항에 있어서,상기 캐시 메모리(141)는 비-휘발성(non-volatile) 메모리인 전자 장치(100)의 동작 방법."}
{"patent_id": "10-2023-0095487", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1 항 내지 제10항 중 어느 하나의 항에 기재된 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로읽을 수 있는 기록 매체."}
{"patent_id": "10-2023-0095487", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 저장하는 메모리, 캐시(cache) 데이터를 저장하는 캐시 메모리, 메모리에 저장된 명령어를 실행하는 프로세서 및 통신 인터페이스를 포함하고, 프로세서는 명령어를 실행함으로써, 서버로부터 제공되는 네트워크 데 이터를 가져오도록 하는 요청을 수신하고, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하고, 비교 결 과에 따라 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획득하거나, 또는 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득하고, 획득된 네트워크 데이터 또는 획득된 캐시 데이 터를 처리하는 전자 장치 및 전자 장치의 동작 방법을 포함한다."}
{"patent_id": "10-2023-0095487", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 전자 장치의 동작 방법에 관한 것이다. 구체적으로는, 캐시 메모리를 포함하는 전자 장 치 및 전자 장치의 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0095487", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치 및 네트워크 기술의 발전에 따라, 전자 장치에서 웹 어플리케이션 또는 웹 브라우저를 실행하고, 서 버에 데이터를 요청하고, 서버로부터 데이터를 제공받아 웹 어플리케이션 또는 웹 브라우저를 실행하는 동작이 사용되고 있다. 이때, 네트워크를 통하여 서버에서 데이터를 받아오는 동작은 전자 장치 내에서 이루어지는, 데이터를 요청하고, 데이터를 제공받는 동작보다 속도가 느린 것이 일반적이므로, 웹 어플리케이션이나 웹 브라우저의 동 작에서 반복하여 사용되는 데이터는 전자 장치에 캐시(cache) 메모리에 저장되고, 전자 장치는 캐시 메모리로부 터 웹 어플리케이션이나 웹 브라우저의 실행에 필요한 데이터를 제공받을 수도 있다."}
{"patent_id": "10-2023-0095487", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예는 전자 장치를 제공한다. 전자 장치는 적어도 하나의 명령어(instruction)를 저장하는 메 모리를 포함할 수 있다. 전자 장치는 캐시(cache) 데이터를 저장하는 캐시 메모리를 포함할 수 있다. 전자 장치 는 메모리에 저장된 적어도 하나의 명령어를 실행하는 적어도 하나의 프로세서를 포함할 수 있다. 전자 장치는 통신 인터페이스를 포함할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 명령어를 실행함으로써 서버로부 터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신할 수 있다. 적어도 하나의 프로세서는 적어도 하 나의 명령어를 실행함으로써 네트워크 데이터를 서버로부터 가져오는 동작에 소요될 것으로 예상되는 시간을 나 타내는 네트워크 예상 응답 성능과 캐시 메모리로부터 네트워크 데이터에 대응되는 캐시 데이터를 가져오는 동 작에 소요될 것으로 예상되는 시간을 나타내는 캐시 예상 응답 성능을 비교할 수 있다. 적어도 하나의 프로세서 는 적어도 하나의 명령어를 실행함으로써 비교 결과에 따라 통신 인터페이스를 통하여 서버에 네트워크 데이터 를 요청하여 네트워크 데이터를 획득하거나, 또는 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 명령어를 실행함으로써 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리할 수 있다. 본 개시의 일 실시예는, 전자 장치의 동작 방법을 제공한다. 전자 장치의 동작 방법은 서버로부터 제공되는 네 트워크 데이터를 가져오도록 하는 요청을 수신하는 단계를 포함할 수 있다. 전자 장치의 동작 방법은 네트워크 데이터를 서버로부터 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 네트워크 예상 응답 성능과 캐 시(cache) 데이터를 저장하는 캐시 메모리로부터 네트워크 데이터에 대응되는 캐시 데이터를 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 캐시 예상 응답 성능을 비교하는 단계를 포함할 수 있다. 전자 장치의 동작 방법은 비교 결과에 따라 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 네트워크 데이터 를 획득하거나, 또는 캐시 메모리에 캐시 메모리를 요청하여 캐시 데이터를 획득하는 단계를 포함할 수 있다. 전자 장치의 동작 방법은 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 단계를 포함할 수 있다. 본 개시의 일 실시예로, 개시된 동작 방법의 실시예 중 적어도 하나의 방법을 컴퓨터에서 수행하기 위한 프로그 램이 기록된 컴퓨터로 읽을 수 있는 기록 매체를 제공할 수 있다."}
{"patent_id": "10-2023-0095487", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 사용되는 용어에 대해 간략히 설명하고, 본 개시의 일 실시예에 대해 구체적으로 설명하기로 한다. 본 개시에서 사용되는 용어는 본 개시의 일 실시예에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적 인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 본 개시의 실 시예의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명 칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 명세서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 개시 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 본 개시에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 본 개시에서 사용된 표현 “~하도록 구성된(또는 설정된)(configured to)”은 상황에 따라, 예를 들면, “~에 적합한(suitable for)”, “~하는 능력을 가지는(having the capacity to)”, “~하도록 설계된(designed to) ”, “~하도록 변경된(adapted to)”, “~하도록 만들어진(made to)”, 또는 “~를 할 수 있는(capable of)” 과 바꾸어 사용될 수 있다. 용어 “~하도록 구성된(또는 설정된)”은 하드웨어적으로 “특별히 설계된 (specifically designed to)” 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, “~하도록 구성 된 시스템”이라는 표현은, 그 시스템이 다른 장치 또는 부품들과 함께 “~할 수 있는” 것을 의미할 수 있다. 예를 들면, 문구 “A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서”는 해당 동작을 수행하기 위한 전 용 프로세서(예: 임베디드 프로세서), 또는 메모리에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로 써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 또한, 본 개시에서 일 구성요소가 다른 구성요소와 “연결된다” 거나 “접속된다” 등으로 언급된 때에는, 상 기 일 구성요소가 상기 다른 구성요소와 직접 연결되거나 또는 직접 접속될 수도 있지만, 특별히 반대되는 기재 가 존재하지 않는 이상, 중간에 또 다른 구성요소를 매개하여 연결되거나 또는 접속될 수도 있다고 이해되어야 할 것이다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시의 일 실시예는 여러 가지 상이한 형태 로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시의 일 실시예를 명 확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 본 개시 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 이하에서는 도면을 참조하여 본 개시의 실시예들을 상세하게 설명한다. 도 1은 본 개시의 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 1을 참조하면, 일 실시예에서, 전자 장치는 애플리케이션(application)을 실행하기 위한 전자 장치일 수 있다. 일 실시예에서, 전자 장치는 텔레비전(television), 휴대용 통신 단말기(mobile phone), 스마트 폰(smart phone), 태블릿 PC(tablet personal computer), 웨어러블 기기(wearable device), 헬스케어 기기 또 는 IOT(internet of things) 기기, 개인용(personal) 컴퓨터, 랩탑(laptop) 컴퓨터, 서버(server), 미디어 재 생기(media player) 또는 내비게이션(navigation)과 같은 차량용 장비(automotive device) 등과 같은 다양한 형상을 갖는 전자 장치일 수 있다. 일 실시예에서, 전자 장치가 실행하는 애플리케이션(application)은 이미지, 문서(text), 비디오, 오디오, 웹 페이지(web page), 웹 애플리케이션(web application) 또는 모바일 애플리케이션(mobile application) 등을 포함할 수 있다. 일 실시예에서, 전자 장치는 적어도 하나의 프로세서, 메모리 및 스토리지 장치를 포함할 수 있다. 그러나, 도 1에 도시된 전자 장치의 구성 요소는 전자 장치의 동작을 설명하기 위하여 도시 된 구성으로, 도 1에 도시된 구성 요소가 모두 필수 구성 요소인 것은 아니다. 도 1에 도시된 구성 요소보다 더 많은 구성 요소에 의해 전자 장치가 구현될 수도 있고, 그보다 적은 구성 요소에 의해서도 전자 장치(10 0)는 구현될 수 있다. 일 실시예에서, 파일 시스템은 전자 장치에 포함된 데이터, 자료 또는 파일들을 조직화하고, 관리하 는 방법을 의미할 수 있다. 일 실시예에서, 메모리 및 스토리지 장치는 파일 시스템(file system, 120)을 통하여 조직화되고, 관리될 수 있다. 일 실시예에서, 메모리에 저장된 적어도 하나의 명령어 (instruction) 및 스토리지 장치에 저장된 데이터들은 파일 시스템을 통하여 조직화되고, 관리될 수 있다. 적어도 하나의 프로세서는 파일 시스템을 통하여 메모리에 저장된 적어도 하나의 명령어 를 실행하거나, 혹은 스토리지 장치에 데이터를 요청하고, 저장된 데이터를 독출할 수 있다. 이하, 설명의 편의를 위하여 적어도 하나의 프로세서가 파일 시스템을 통하여 메모리에 저장된 적어도 하나의 명령어를 실행하는 것은, 적어도 하나의 프로세서가 메모리에 저장된 적어도 하나의 명령어를 실행하 는 것으로 지칭될 수 있다. 또한, 적어도 하나의 프로세서가 파일 시스템을 통하여 스토리지 장치 에 데이터를 요청하고, 스토리지 장치로부터 필요한 데이터를 독출하는 것은 적어도 하나의 프로세서 가 스토리지 장치에 데이터를 요청하고, 스토리지 장치로부터 필요한 데이터를 독출하는 것으로 지칭될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 메모리에 저장된 적어도 하나의 명령어(instruction)를 실 행함으로써, 적어도 하나의 애플리케이션을 실행할 수 있다. 적어도 하나의 프로세서는 메모리에 저 장된 적어도 하나의 명령어(instruction)를 실행함으로써, 적어도 하나의 애플리케이션을 실행하기 위한 데이터 를 스토리지(storage) 장치에 요청하고, 스토리지 장치에서 필요한 데이터를 독출할 수 있다. 일 실 시예에서, 스토리지 장치는 전원 공급 여부와 관계 없이 데이터를 저장하는 비-휘발성(non-volatile) 저장 장치를 포함할 수 있다. 일 실시예에서, 적어도 하나의 애플리케이션 중 일부의 애플리케이션을 실행하기 위하여 서버로부터 제공 되는 네트워크 데이터가 필요한 경우, 적어도 하나의 프로세서는 메모리에 저장된 적어도 하나의 명 령어(instruction)를 실행함으로써, 서버로 네트워크 데이터를 요청하고, 서버로부터 네트워크 데이 터를 획득할 수 있다. 서버는 통신 인터페이스를 통하여 전자 장치와 데이터 통신을 수행하는 것으로, 웹 서버(web server), 애플리케이션 서버(application server) 또는 DBMS(Database Management System) 등을 포함할 수 있다. 일 실시예에서, 네트워크 데이터는 서버가 적어도 하나의 프로세서의 요청에 대한 응답으로 제공하는 데이터일 수 있다. 네트워크 데이터는 헤더(header)와 본문(body)으로 구성될 수 있다. 일 실시예에서, 헤더는 네트워크 데이터의 메타데이터(metadata) 정보를 포함할 수 있다. 헤더에는 네트워크 데이터의 유형, 크기, 요 청 시간 및 응답 시간, 네트워크 데이터의 유효 기간, 네트워크 데이터의 캐시 제어 정보 등이 포함될 수 있다. 일 실시예에서, 본문에는 애플리케이션을 실행하기 위하여 필요한 네트워크 데이터의 정보가 포함될 수 있다. 일 실시예에서, 스토리지 장치는 캐시(cache) 데이터가 저장되는 캐시 메모리를 포함할 수 있다. 적 어도 하나의 프로세서는 제공받은 네트워크 데이터의 헤더에 기초하여, 캐시 메모리에 네트워크 데이 터를 캐시 데이터로서 저장할 수 있다. 일 실시예에서, 네트워크 데이터의 헤더에 포함된 캐시 제어 정보에 기 초하여 네트워크 데이터를 캐시 데이터로서 저장할 수 있다. 일 실시예에서, 적어도 하나의 애플리케이션 중 일부의 애플리케이션을 실행하기 위하여 서버로부터 제공 되는 네트워크 데이터가 필요한 경우, 적어도 하나의 프로세서는 메모리에 저장된 적어도 하나의 명 령어(instruction)를 실행함으로써, 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 캐시 데이터의 헤더에 포함된 네트워크 데이터의 요청 시 간, 응답 시간 및 유효 기간 등의 정보에 기초하여 캐시 데이터가 유효한지 여부를 판단할 수 있다. 일 실시예 에서, 캐시 데이터의 헤더에는 캐시 데이터의 유효 기간이 포함될 수도 있다. 일 실시예에서, 캐시 메모리에 저장된 캐시 데이터가 유효하다고 판단된 경우, 적어도 하나의 프로세서 는 메모리에 저장된 적어도 하나의 명령어(instruction)를 실행함으로써, 캐시 메모리에 네트워 크 데이터에 대응되는 캐시 데이터를 요청하고, 캐시 메모리로부터 캐시 데이터를 독출하여 획득할 수 있 다. 일 실시예에서, 캐시 메모리에 저장된 캐시 데이터가 비-유효하다고 판단된 경우, 적어도 하나의 프로 세서는 메모리에 저장된 적어도 하나의 명령어(instruction)를 실행함으로써, 통신 인터페이스를 통 하여 서버에 네트워크 데이터를 요청하여, 서버로부터 네트워크 데이터를 획득할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 복수의 애플리케이션들(111, 112, 113)을 실행할 수 있다. 이때, 복수의 애플리케이션들(111, 112, 113) 각각은 서로 다른 종류의 콘텐츠를 포함하는 애플리케이션일 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 파일 시스템(file system, 120)을 통하여 복수의 애플리케이션 들(111, 112, 113) 각각의 실행을 위한 데이터를 요청하고, 요청한 데이터를 획득할 수 있다. 일 실시예에서, 복수의 애플리케이션들(111, 112, 113) 중 실행을 위하여 서버로부터 네트워크 데이터를 제공받아야 하는 애플리케이션이 포함된 경우, 적어도 하나의 프로세서는 해당 애플리케이션을 실행하기 위하여 서버에 네트워크 데이터를 요청할 수 있다. 이때, 해당 네트워크 데이터에 대응되는 캐시 데이터가 캐시 메모리에 저장되어 있는 경우, 적어도 하나의 프로세서는 서버가 아닌 파일 시스템을 통하여 캐시 메모리에 캐시 데이터를 요청할 수 있다. 다만, 적어도 하나의 프로세서가 복수의 애플리케이션들(111, 112, 113)을 실행하는 경우, 파일 시스템 을 통하여 데이터를 요청하고, 요청한 데이터를 획득하는 동작에서 파일 시스템의 입력/출력 (Input/Output)의 병목 현상이 발생할 수 있다. 이 경우, 파일 시스템을 통하여 캐시 메모리에 캐시 데이터를 요청하여, 캐시 데이터를 획득하는 동작에서 소요되는 시간보다 서버 네트워크 데이터를 요청하 여, 네트워크 데이터를 획득하는 동작에서 소요되는 시간이 짧아, 시간적인 측면에서 더 효율적일 수 있다. 이하, 캐시 데이터가 캐시 메모리에 존재하더라도, 캐시 메모리로부터 캐시 데이터를 가져오는 동작 에 소요될 것으로 예상되는 시간을 나타내는 캐시 예상 응답 성능과 서버로부터 네트워크 데이터를 가져오 는 동작에 소요될 것으로 예상되는 시간을 나타내는 네트워크 예상 응답 성능의 비교 결과에 따라, 효율적인 방 법으로 애플리케이션의 실행에 필요한 데이터를 획득하는 전자 장치 및 전자 장치의 동작 방법을 설명하기 위한 실시예들을 개시한다. 일 실시예에서, 전자 장치에서 복수의 애플리케이션들(111, 112, 113)이 실행되는 경우, (예를 들어, 전자 장치의 부팅시키는 경우 또는 복수의 애플리케이션들을 짧은 시간 내에 함께 실행시키는 경우) 적어도 하 나의 프로세서는 스토리지 장치에 복수의 애플리케이션들(111, 112, 113) 각각을 실행하기 위한 데이 터를 요청할 수 있다. 일 실시예에서, 도 1에는 전자 장치가 제1 애플리케이션, 제2 애플리케이션 및 제3 애플리케이션를 실행하는 경우가 도시되어 있다. 다만, 본 개시는 이에 제한되지 않고, 전자 장치는 두 개의 애플리케이션들을 실행하거나, 혹은 네 개 이상의 애플리케이션들을 실행할 수도 있다. 일 실시예에서, 적어도 하나의 프로세서는 제1 애플리케이션를 실행하기 위한 데이터를 스토리지 장 치에 요청할 수 있다. 적어도 하나의 프로세서는 제2 애플리케이션를 실행하기 위한 데이터를 스토리지 장치에 요청할 수 있다. 적어도 하나의 프로세서는 제3 애플리케이션를 실행하기 위한 데이터 중 스토리지 장치에 저장된 데이터를 스토리지 장치에 요청할 수 있다. 적어도 하나의 프로세 서는 제3 애플리케이션를 실행하기 위한 데이터 중 서버로부터 제공받아야 하는 네트워크 데이 터는 캐시 메모리에 저장된 캐시 데이터가 유효한지 캐시 제어를 통하여 판단하고, 캐시 데이터가 유 효하다고 판단되는 경우에는 캐시 데이터를 스토리지 장치에 요청하고, 캐시 데이터가 비-유효하다고 판단 되는 경우에는 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청할 수 있다. 일 실시예에서, 적어도 하나의 프로세서가 스토리지 장치에 데이터를 요청한 신호는, 파일 시스템 의 큐에 누적될 수도 있다. 일 실시예에서, 큐는 Priority Queue 방식의 자료 구조로, 파일 시스템은큐에 쌓인 적어도 하나의 프로세서의 데이터 요청을 처리하여 대응되는 데이터를 제공할 수 있다. 파일 시 스템은 큐에 쌓인 스토리지 장치에 데이터를 요청하는 신호뿐만 아니라, 메모리에 적어도 하나 의 명령어를 요청하는 신호를 처리하여, 대응되는 데이터 또는 적어도 하나의 명령어를 적어도 하나의 프로세서 에 제공할 수 있다. 이때, 파일 시스템의 처리 속도는 제한되어 있으므로, 큐에 누적된 데이터 요청 신호 및 적어도 하나의 명령어를 요청하는 신호가 많아지면 처리 순서가 뒤쪽에 있는 데이터 요청에 대응되는 데이터가 제공되는 속도도 느려질 수 있다. 이러한 파일 시스템의 입력/출력(Input/Output)의 병목 현상에 의하여, 전자 장치에서의 애플리케이션의 실행 속도가 느려질 수 있다. 다만, 본 개시는 이에 제한되지 않고, 적어도 하나의 프로세서가 스토리지 장치에 데이터를 요청하는 데이터 요청 신호가 스토리지 장치의 큐에 누적되어, 스토리지 장치가 데이터 요청 신호에 대응되는 데이터를 제공되는 속도가 느려지는 스토리지 장치의 입력/출력(Input/Output)의 병목 현상이 발생할 수도 있다. 이때, 스토리지 장치의 처리 속도는 제한되어 있으므로, 큐에 누적된 데이터 요청 신호가 많아지면, 처리 순서가 뒤쪽에 있는 데이터 요청에 대응되는 데이터가 제공되는 속도도 느려질 수 있다. 이러한 입력/출력 (Input/Output)의 병목 현상에 의하여, 전자 장치에서의 애플리케이션의 실행 속도가 느려질 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 네트워크 데이터를 서버에 요청함에 따라, 네트워크 데이 터를 서버로부터 가져오는 것에 기반하여 계산되는 성능을 나타내는 네트워크 예상 응답 성능과 캐시 데이 터를 스토리지 장치에 포함된 캐시 메모리에 요청함에 따라, 캐시 데이터를 캐시 메모리로부터 가져오는 것에 기반하여 계산되는 성능을 나타내는 캐시 예상 응답 성능을 비교할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높다고 판 단됨에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하고, 서버로부터 네트워크 데이터를 획득하여 제3 애플리케이션을 실행하여 표시할 수 있다. 이를 통하여, 캐시 메모리에 캐시 데이터가 저장되어 있더라도, 응답 성능이 높은 서버를 통하여 네트워크 데이터를 획득할 수 있어, 제3 애 플리케이션의 동작 속도를 높일 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 네트워크 예상 응답 성능이 캐시 예상 응답 성능과 동일하다고 판단됨에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하고, 서버로부터 네트워크 데이터를 획득하여 제3 애플리케이션을 실행할 수 있다. 이를 통하여, 캐시 메모리를 포함하는 스토 리지 장치의 큐에 쌓이는 데이터 요청 신호의 개수를 줄여, 입력/출력(Input/Output)의 병목 현상에 의하 여 제1 애플리케이션 및 제2 애플리케이션의 실행 속도가 느려지는 것을 방지할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 높다고 판 단됨에 따라, 캐시 메모리에 캐시 데이터를 요청하고, 캐시 메모리로부터 캐시 데이터를 획득하여 제 3 애플리케이션을 실행할 수 있다. 이를 통하여, 서버로부터 네트워크 데이터를 획득하는 경우보다 빠른 속도로 캐시 메모리로부터 캐시 데이터를 획득하여, 제3 애플리케이션의 실행 속도를 높일 수 있다. 이하, 네트워크 예상 응답 성능과 캐시 예상 응답 성능의 계산 및 비교하는 동작에 대하여는 도 3 내지 도 5에 서 후술하도록 한다. 도 2는 본 개시의 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 이하, 도 1과 동일한 구성에 대하여는 동일한 도면 부호를 부여하고, 중복되는 설명은 생략하도록 한다. 일 실시예에서, 도 2를 참조하면, 도 2에는 전자 장치에서 하나의 애플리케이션이 실행되는 경우가 도시되어 있다. 일 실시예에서, 전자 장치에서 하나의 애플리케이션이 실행되더라도, 애플리케이션 내에서 복수의 동작들이 수행되는 경우, 스토리지 장치의 큐에 쌓이는 데이터 요청 신호가 많아져, 처리 속도가 뒤쪽에 있는 데이터 요청에 대응되는 데이터가 제공되는 속도도 느려질 수 있다. 이에 따라 전자 장치에서 실행되는 애플리케이션의 동작 중 일부가 느리게 수행될 수 있다. 다만, 본 개시는 이에 제 한되지 않고, 전자 장치에서 복수의 애플리케이션들이 실행되는 경우에, 적어도 하나의 애플리케이션에서 복수의 동작들이 수행되는 경우에도 적어도 하나의 애플리케이션의 동작 중 일부가 느리게 수행될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 메모리에 포함된 적어도 하나의 명령어를 실행함으로써, 애플리케이션을 실행하기 위해 필요한 데이터 중 서버에서 제공되는 네트워크 데이터가 있는지 판단 할 수 있다. 일 실시예에서, 애플리케이션의 적어도 하나의 동작 모두 네트워크 데이터가 필요한 동작일수도 있다. 일 실시예에서, 적어도 하나의 프로세서는 캐시 메모리에 포함된 캐시 데이터가 유효한지 캐시 제어 를 통하여 판단하고, 캐시 데이터가 유효하다고 판단되는 경우에 네트워크 예상 응답 성능과 캐시 예상 응 답 성능을 비교할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높다고 판 단됨에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하고, 서버로부터 네트워크 데이터를 획득하여 애플리케이션을 실행할 수 있다. 이를 통하여, 캐시 메모리에 캐시 데이터가 저장 되어 있더라도, 응답 성능이 높은 서버를 통하여 네트워크 데이터를 획득할 수 있어, 애플리케이션의 복수의 동작들 중 네트워크 데이터가 필요한 애플리케이션의 동작 속도를 높일 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 네트워크 예상 응답 성능이 캐시 예상 응답 성능과 동일하다고 판단됨에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하고, 서버로부터 네트워크 데이터를 획득하여 제3 애플리케이션을 실행할 수 있다. 이를 통하여, 캐시 메모리를 포함하는 스토 리지 장치의 큐에 쌓이는 데이터 요청 신호의 개수를 줄여, 입력/출력의 병목 현상에 의하여 애플리케이션 의 복수의 동작들의 속도가 느려지는 것을 방지할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 높다고 판 단됨에 따라, 파일 시스템을 통하여 캐시 메모리에 캐시 데이터를 요청하고, 캐시 메모리로부터 캐시 데이터를 획득하여 제3 애플리케이션을 실행할 수 있다. 이를 통하여, 서버로부터 네트워크 데 이터를 획득하는 경우보다 빠른 속도로 캐시 메모리로부터 캐시 데이터를 획득하여, 애플리케이션의 복수의 동작들 중 네트워크 데이터가 필요한 애플리케이션의 실행 속도를 높일 수 있다. 도 3은 본 개시의 일 실시예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 3을 참조하면, 일 실시예에서, 전자 장치는 메모리, 캐시 메모리, 적어도 하나의 프로세서 및 통신 인터페이스를 포함할 수 있다. 그러나, 도 3에 도시된 구성 요소가 모두 필수 구성 요소인 것은 아니다. 도 3에 도시된 구성 요소보다 더 많은 구성 요소에 의해 전자 장치가 구현될 수도 있고, 그 보다 적은 구성 요소에 의해서도 전자 장치는 구현될 수 있다. 일 실시예에서, 전자 장치는 캐시 메 모리를 포함하는 스토리지 장치를 포함할 수도 있다. 일 실시예에서, 메모리, 캐시 메모리, 적 어도 하나의 프로세서 및 통신 인터페이스는 각각 전기적 및/또는 물리적으로 서로 연결될 수 있다. 일 실시예에서, 메모리에는 적어도 하나의 프로세서가 판독할 수 있는 명령어들, 데이터 구조, 및 프 로그램 코드(program code)가 저장될 수 있다. 일 실시예에서, 메모리는 하나 이상일 수 있다. 개시된 실 시예들에서, 적어도 하나의 프로세서가 수행하는 동작들은 메모리에 저장된 프로그램의 명령어들 또 는 코드들을 실행함으로써 구현될 수 있다. 일 실시예에서, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀 티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), Mask ROM, Flash ROM 등), 하드 디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 중 적어도 하나를 포함할 수 있다. 메모리에는 전자 장치의 기능 또는 동작들을 수행하기 위한 명령어들 또는 프로그램 코드가 저장될 수 있다. 메모리에 저장되는 명령어들, 알고리즘, 데이터 구조, 프로그램 코드 및 애플리케이션 프 로그램은 예를 들어, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 일 실시예에서, 메모리에는 요청 수신 모듈, 캐시 제어 모듈, 응답 성능 계산 모듈, 응답 성능 비교 모듈, 데이터 획득 모듈 및 데이터 처리 모듈이 저장될 수 있다. 그러나, 도 3에 도 시된 모듈 모두가 필수 모듈인 것은 아니다. 메모리에는 도 1에 도시된 모듈보다 더 많은 모듈들이 저장될 수도 있고, 그보다 적은 모듈들이 저장될 수도 있다. 일 실시예에서, 메모리에 포함되는 '모듈'은 적어도 하나의 프로세서에 의해 수행되는 기능이나 동작 을 처리하는 단위를 의미할 수 있다. 메모리에 포함되는 '모듈'은 명령어들(instructions), 알고리즘, 데 이터 구조, 또는 프로그램 코드와 같은 소프트웨어로 구현될 수 있다.일 실시예에서, 요청 수신 모듈은 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신하는 동작이나 기능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서, 전자 장치 에서 애플리케이션을 실행하기 위하여 서버로부터 제공되는 네트워크 데이터가 필요할 수 있다. 일 실시예에서, 애플리케이션을 실행하기 위한 명령어들, 데이터 구조, 또는 프로그램 코드(program code)에서 필 요한 적어도 하나의 데이터 중 서버로부터 제공되는 네트워크 데이터가 포함될 수 있다. 일 실시예에서, 애플리케이션을 실행하기 위한 명령어들, 데이터 구조, 또는 프로그램 코드(program code)는 서버로부터 네트워크 데이터를 획득하여, 획득된 네트워크 데이터를 이용하여 애플리케이션을 실행할 수 있다. 일 실시예에 서, 적어도 하나의 프로세서는 요청 수신 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 애플 리케이션을 실행하기 위한 명령어들, 데이터 구조, 또는 프로그램 코드(program code)를 실행하기 위한 과정에 서 필요한 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신할 수 있다. 일 실시예에서, 캐시 제어 모듈은 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단하 는 동작이나 기능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 캐시 제어 모듈은 서버에 네트워크 데이터를 요청하기 전에, 네트워크 데이터에 대응되는 캐시 데이터가 캐시 메모리에 저장되어 있 는지 여부, 캐시 메모리에 저장되어 있는 캐시 데이터가 유효한지 여부 등을 판단하는 동작이나 기능에 관 한 명령어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서, 캐시 제어 모듈은 서버로부터 제 공되는 네트워크 데이터를 가져오도록 하는 요청에 기초하여, 캐시 메모리에 저장되어 있는 적어도 하나의 캐시 데이터의 헤더를 검색하여, 요청하는 네트워크 데이터에 대응되는 캐시 데이터가 캐시 메모리에 저장 되어 있는지 여부, 요청하는 네트워크 데이터에 대응되는 캐시 데이터의 유효 기간의 만료 여부 등을 판단하여 캐시 데이터가 유효한지 여부를 판단하는 동작이나 기능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 캐시 제어 모듈의 명령어들 또는 프로그램 코드를 실행함 으로써, 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단할 수 있다. 일 실시예에서, 응답 성능 계산 모듈은 네트워크 데이터를 서버에 요청함에 따라, 네트워크 데이터를 서버로부터 가져오는 동작에 기반하여 계산되는 성능을 나타내는 네트워크 예상 응답 성능과 캐시 데이터 를 스토리지 장치에 포함된 캐시 메모리에 요청함에 따라, 캐시 데이터를 캐시 메모리로부터 가 져오는 동작에 기반하여 계산되는 성능을 나타내는 캐시 예상 응답 성능을 계산하는 동작이나 기능에 관한 명령 어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서, 네트워크 예상 응답 성능은 네트워크 데이터를 서 버로부터 획득하기 위하여 필요한 예상 시간을 나타낼 수 있다. 캐시 예상 응답 성능은 캐시 데이터 를 캐시 메모리로부터 획득하기 위하여 필요한 예상 시간을 나타낼 수 있다. 일 실시예에서, 응답 성능 계산 모듈은 서버에 네트워크 데이터를 요청한 때부터 서버로부터 네 트워크 데이터를 획득할 때까지의 제1 소요 시간에 기반하여 네트워크 예상 응답 성능을 계산하는 동작이나 기 능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 계산된 네트워크 예상 응답 성능은, 네트워크 데이 터를 서버에 요청하고, 서버로부터 네트워크 데이터를 획득할 때까지의 소요될 시간을 나타낼 수 있 다. 일 실시예에서, 네트워크 데이터를 획득할 때까지의 소요되는 시간이 짧을수록, 네트워크 예상 응답 성능이 우수하다고 할 수 있다. 일 실시예에서, 응답 성능 계산 모듈은 캐시 메모리에 캐시 데이터를 요청한 때부터 캐시 메모 리로부터 캐시 데이터를 획득할 때까지의 제2 소요 시간에 기반하여 캐시 예상 응답 성능을 계산하는 동작이나 기능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 계산된 캐시 예상 응답 성능은, 캐시 데 이터를 캐시 메모리에 요청하고, 캐시 메모리로부터 캐시 데이터를 획득할 때까지의 소요 될 시간을 나타낼 수 있다. 일 실시예에서, 캐시 데이터를 획득할 때까지의 소요되는 시간이 짧을수록, 캐 시 예상 응답 성능이 우수하다고 할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 응답 성능 계산 모듈의 명령어들 또는 프로그램 코드를 실 행함으로써, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 계산할 수 있다. 이하, 제1 소요 시간 및 제2 소요 시간을 계산하는 동작에 대하여는 도 5에서 후술하도록 한다. 일 실시예에서, 응답 성능 비교 모듈은 계산된 네트워크 예상 응답 성능과 계산된 캐시 예상 응답 성능을 비교하는 동작이나 기능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서, 제1 소요 시간 에 기반하여 네트워크 예상 응답 성능이 계산되고, 제2 소요 시간에 기반하여 캐시 예상 응답 성능이 계산됨에따라, 응답 성능 비교 모듈은 제1 소요 시간과 제2 소요 시간의 비교를 통하여 캐시 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 동작이나 기능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 응답 성능 비교 모듈의 명령어들 또는 프로그램 코드를 실 행함으로써, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교할 수 있다. 일 실시예에서 적어도 하나의 프로세서는 응답 성능 비교 모듈의 명령어들 또는 프로그램 코드를 실 행함으로써, 제1 소요 시간이 제2 소요 시간 이하라고 판단되는 경우, 네트워크 예상 응답 성능이 캐시 예상 응 답 성능보다 높다고 판단할 수 있다. 일 실시예에서 적어도 하나의 프로세서는 응답 성능 비교 모듈 의 명령어들 또는 프로그램 코드를 실행함으로써, 제1 소요 시간이 제2 소요 시간을 초과한다고 판단되는 경우, 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 높다고 판단할 수 있다. 도 3에서는 응답 성능 계산 모듈과 응답 성능 비교 모듈이 서로 별개의 모듈인 것으로 도시되었으나, 본 개시는 이에 제한되지 않는다. 응답 성능을 계산하는 동작과 응답 성능을 비교하는 동작이나 기능에 관한 명 령어들 또는 프로그램 코드는 하나의 모듈로 구성될 수도 있다. 일 실시예에서, 데이터 획득 모듈은 네트워크 예상 응답 성능과 캐시 예상 응답 성능의 비교 결과에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획득하거나, 캐시 메모리에 캐시 데이터를 요청하여 캐시 메모리로부터 캐시 데이터를 획 득하는 동작이나 기능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서 적어도 하나의 프 로세서는 데이터 획득 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 네트워크 예상 응답 성 능과 캐시 예상 응답 성능의 비교 결과에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획득하거나, 캐시 메모리에 캐시 데이터를 요청하여 캐 시 메모리로부터 캐시 데이터를 획득할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높다고 판단됨에 따라, 적어도 하나의 프 로세서는 데이터 획득 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획득할 수 있다. 캐시 예 상 응답 성능이 네트워크 예상 응답 성능보다 높다고 판단됨에 따라, 적어도 하나의 프로세서는 데이터 획 득 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 캐시 메모리에 캐시 데이터를 요청하 여 캐시 메모리로부터 캐시 데이터를 획득할 수 있다. 일 실시예에서, 데이터 처리 모듈은 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 동작이 나 기능에 관한 명령어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서 데이터 처리 모듈은 획득 된 네트워크 데이터 또는 획득된 캐시 데이터를 변환(transformation), 특성 추출(feature extraction), 샘플 링(sampling), 필터링(filtering) 정렬(sorting), 클리닝(cleaning) 등의 전처리하는 동작이나 기능에 관한 명 령어들 또는 프로그램 코드로 구성될 수 있다. 일 실시예에서, 데이터 처리 모듈은 획득된 네트워크 데이 터 또는 획득된 캐시 데이터를 이용하여 애플리케이션을 실행하기 위한 명령어들, 데이터 구조, 또는 프로그램 코드(program code)을 실행하여, 애플리케이션을 실행하는 동작이나 기능에 관한 명령어들 또는 프로그램 코드 로 구성될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 데이터 처리 모듈의 명령어들 또는 프로그램 코드를 실행 함으로써, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 전처리 할 수 있다. 적어도 하나의 프로세서 는 데이터 처리 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 이용하여 애플리케이션을 실행할 수 있다. 일 실시예에서, 캐시 메모리에는 통신 인터페이스를 통하여 서버(150, 도 1 참조)로부터 획득된 캐시 데이터가 저장될 수 있다. 일 실시예에서, 캐시 메모리는 하나 이상일 수 있다. 적어도 하나의 프로 세서가 데이터 처리 모듈의 명령어들 또는 프로그램 코드를 실행함으로써 처리하는 데이터는 캐시 메 모리로부터 독출하여 획득된 캐시 데이터일 수 있다. 적어도 하나의 프로세서가 애플리케이션 실행 모듈의 명령어들 또는 프로그램 코드를 실행함으로써 실행하는 애플리케이션는 캐시 메모리로부터 독 출하여 획득된 캐시 데이터를 이용하여 실행되는 애플리케이션일 수 있다. 일 실시예에서, 캐시 메모리는 비-휘발성(non-volatile) 메모리일 수 있다. 캐시 메모리는 플래시 메 모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 하드 디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 캐시 메모리는 스토리지 장치에 포함된 메모리일 수 있다. 일 실시예에서, 캐시 메모리는 캐시 데이터를 일정 기간동안 저장하기 위한 메모리일 수 있다. 캐시 메모 리는 캐시 데이터를 임시로 저장할 수 있다. 캐시 메모리는 적어도 하나의 프로세서에서의 요청 에 의하여, 서버로부터 제공된 네트워크 데이터 중 일부를 캐시 데이터로 저장하기 위한 메모리일 수 있다. 일 실시예에서, 캐시 메모리는 스토리지 장치 또는 메모리에 저장된 데이터 중 일부를 적어도 하나의 프로세서에 빠르게 전달하기 위하여, 캐시 데이터로 저장하기 위한 메모리일 수 있다. 일 실시예에 서, 캐시 메모리는 스토리지 장치 또는 메모리보다 상위 계층을 갖는 구조로 설계되어, 적어도 하나 의 프로세서에 캐시 데이터를 제공할 수 있다. 일 실시예에서, 캐시 데이터는 캐시 메모리에 저장되는 데이터로, 적어도 하나의 프로세서로부터 기- 요청되어, 적어도 하나의 프로세서에 제공된 데이터, 적어도 하나의 프로세서가 요청하는 빈도가 높 은 데이터 혹은 서버로부터 획득된 네트워크 데이터의 헤더에 포함된 캐시 제어 정보에 기초하여 캐시 메 모리에 저장된 데이터일 수 있다. 일 실시예에서, 캐시 데이터는 적어도 하나의 프로세서의 요청에 의하여, 서버로부터 기-제공된 네트워크 데이터 중 적어도 일부의 데이터일 수 있다. 캐시 데이터는 적어 도 하나의 프로세서의 요청에 의하여, 서버로부터 미리 획득되어 캐시 메모리에 저장된 데이터 일 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 중앙 처리 장치(Central Processing Unit), 마이크로 프로세서 (microprocessor), 그래픽 프로세서(Graphic Processing Unit), 애플리케이션 프로세서(Application Processor, AP), ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays) 및 뉴럴 프로세서(Neural Processing Unit) 또는 인공지능 모델(Artificial Intelligence, AI)의 학습 및 처리에 특화된 하드웨어 구조로 설계된 인공지능 전용 프로세서 중 적어도 하나로 구성될 수 있으나, 이에 제한되는 것은 아니다. 일 실시예에서, 통신 인터페이스는 적어도 하나의 프로세서의 제어에 의해 서버와 데이터 통신 을 수행할 수 있다. 일 실시예에서, 서버는 전자 장치의 외부에 위치한 서버일 수 있다. 또한, 통신 인터페이스는 서버뿐만 아니라, 다른 주변 전자 장치들과도 데이터 통신을 수행할 수 있다. 통신 인 터페이스는 예를 들어, 유선 랜, 무선 랜(Wireless LAN), 와이파이(Wi-Fi), 블루투스(Bluetooth), 지그비 (zigbee), WFD(Wi-Fi Direct), 적외선 통신(IrDA, infrared Data Association), BLE (Bluetooth Low Energy), NFC(Near Field Communication), 와이브로(Wireless Broadband Internet, Wibro), 와이맥스(World Interoperability for Microwave Access, WiMAX), SWAP(Shared Wireless Access Protocol), 와이기그 (Wireless Gigabit Allicance, WiGig) 및 RF 통신을 포함하는 데이터 통신 방식 중 적어도 하나를 이용하여 서 버 또는 다른 주변 전자 장치들과 데이터 통신을 수행할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 통신 인터페이스를 통하여 서버로 애플리케이션을 실 행하기 위한 네트워크 데이터를 요청하는 신호를 제공할 수 있다. 적어도 하나의 프로세서는 통신 인터페 이스를 통하여 서버로부터 네트워크 데이터를 획득할 수 있다. 도 4는 본 개시의 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 순서도이다. 도 1, 도 3 및 도 4를 참조하면, 일 실시예에서, 전자 장치의 동작 방법은 서버로부터 제공되는 네트 워크 데이터를 가져오도록 하는 요청을 수신하는 단계(S100)를 포함할 수 있다. 일 실시예에서, 네트워크 데이 터를 가져오도록 하는 요청을 수신하는 단계(S100)에서, 적어도 하나의 프로세서는 요청 수신 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 애플리케이션을 실행함에 있어 서버로부터 제공되는 네트워 크 데이터를 가져오도록 하는 요청을 수신할 수 있다. 일 실시예에서, 전자 장치의 동작 방법은 네트워크 데이터를 서버로부터 가져오는 동작과 관련된 네 트워크 예상 응답 성능과 캐시 데이터를 저장하는 캐시 메모리로부터 네트워크 데이터에 대응되는 캐 시 데이터를 가져오는 동작과 관련된 캐시 예상 응답 성능을 비교하는 단계(S200)를 포함할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)에서, 적어도 하나의 프로 세서는 응답 성능 계산 모듈의 명령어들 또는 프로그램 코드를 실행함으로써 네트워크 예상 응답 성 능과 캐시 예상 응답 성능을 계산할 수 있다. 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)에서, 적어도 하나의 프로세서는 응답 성능 비교 모듈의 명령어들 또는 프로그램 코드를 실행 함으로써 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교할 수 있다. 이하, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)는 도 5에서 후술하도록 한다. 일 실시예에서, 전자 장치의 동작 방법은 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단 계(S200)에서의 비교 결과에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하고 네 트워크 데이터를 획득하거나, 또는 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득 하는 단계를 포함할 수 있다. 일 실시예에서, 전자 장치의 동작 방법은, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단 계(S200)에서 네트워크 예상 응답 성능이 캐시 예상 응답 성능과 같거나 높다고 판단됨에 따라, 통신 인터페이 스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획득하는 단계 (S300)를 포함할 수 있다. 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획득하는 단계(S300)에 서, 적어도 하나의 프로세서는 데이터 획득 모듈의 명령어들 또는 프로그램 코드를 실행함으로써 통 신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획 득할 수 있다. 일 실시예에서, 전자 장치의 동작 방법은, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단 계(S200)에서 네트워크 예상 응답 성능이 캐시 예상 응답 성능과 같거나 높다고 판단됨에 따라, 통신 인터페이 스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획득하는 단계 (S300)를 포함할 수 있다. 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획득하는 단계(S300)에 서, 적어도 하나의 프로세서는 데이터 획득 모듈의 명령어들 또는 프로그램 코드를 실행함으로써 통 신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획 득할 수 있다. 일 실시예에서, 전자 장치의 동작 방법은, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단 계(S200)에서 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 높다고 판단됨에 따라, 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득하는 단계(S400)를 포함할 수 있다. 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득하는 단계(S400)에서, 적어도 하나의 프로세서는 데 이터 획득 모듈의 명령어들 또는 프로그램 코드를 실행함으로써 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득할 수 있다. 일 실시예에서, 전자 장치의 동작 방법은, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 단계(S500)를 포함할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능이 캐시 예상 응답 성능과 같거나 높다고 판단되어 서버로부터 네 트워크 데이터를 획득한 경우, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 단계(S500)에서는 획득된 네트워크 데이터를 처리할 수 있다. 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 단계 (S500)에서, 적어도 하나의 프로세서는 데이터 처리 모듈의 명령어들 또는 프로그램 코드를 실행함으 로써 획득된 네트워크 데이터를 처리할 수 있다. 일 실시예에서, 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 높다고 판단되어 캐시 메모리로부터 캐시 데이터를 획득한 경우, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 단계(S500)에서 는 획득된 캐시 데이터를 처리할 수 있다. 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 단계(S500)에서, 적어도 하나의 프로세서는 데이터 처리 모듈의 명령어들 또는 프로그램 코드를 실행 함으로써 획득된 캐시 데이터를 처리할 수 있다. 일 실시예에서, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 것은, 애플리케이션을 실행하기 위하여 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 전처리하는 것을 의미할 수도 있다. 획득된 네트워 크 데이터 또는 획득된 캐시 데이터를 처리하는 단계(S500)에서는, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 변환(transformation), 특성 추출(feature extraction), 샘플링(sampling), 필터링(filtering) 정렬 (sorting), 클리닝(cleaning) 등의 전처리하는 동작이 수행될 수 있다. 도 5는 본 개시의 일 실시예에 따른 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 동작을 설명하 기 위한 순서도이다. 이하, 도 4에서 설명한 단계와 동일한 단계에 대하여는 동일한 도면 부호를 부여하고, 중 복되는 설명은 생략하도록 한다.도 1, 도 3, 도 4 및 도 5를 참조하면, 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교 하는 단계(S200)는 서버에 네트워크 데이터를 요청한 때부터 서버로부터 네트워크 데이터를 획득할 때까지의 제1 소요 시간에 기반하여 네트워크 예상 응답 성능을 계산하는 단계(S210)를 포함할 수 있다. 일 실 시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)의 동작은 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신하는 단계(S100)의 동작 이후에 수행될 수 있다. 일 실시예에서, 제1 소요 시간에 기반하여 네트워크 예상 응답 성능을 계산하는 단계(S210)에서, 적어도 하나의 프로세서는 응답 성능 계산 모듈의 명령어들 또는 프로그램 코드를 실행함으로써 서버에 네트워 크 데이터를 요청한 때부터 서버로부터 네트워크 데이터를 획득할 때까지의 제1 소요 시간을 계산하고, 계 산된 제1 소요 시간에 기반하여 네트워크 예상 응답 성능을 계산할 수 있다. 일 실시예에서, 캐시 메모리에 저장된 캐시 데이터의 헤더에는, 서버에 네트워크 데이터를 요청 한 시간과, 서버가 요청에 응답하여 네트워크 데이터를 제공한 시간의 정보가 포함될 수 있다. 일 실시예 에서, 적어도 하나의 프로세서는 응답 성능 계산 모듈의 명령어들 또는 프로그램 코드를 실행함으로 써, 서버에 네트워크 데이터를 요청한 때부터 서버로부터 네트워크 데이터를 획득할 때까지의 누적된 복수의 과거의 제1 소요 시간들의 평균 시간 또는 서버에 네트워크 데이터를 요청한 때부터 서버로부 터 네트워크 데이터를 획득할 때까지의 직전의 제1 소요 시간 중 적어도 하나에 기초하여 제1 소요 시간을 계산 할 수 있다. 다만, 본 개시는 이에 제한되지 않고, 제1 소요 시간에 기반하여 네트워크 예상 응답 성능을 계산하는 단계 (S210)에서는 제1 소요 시간을 계산할 수 있는 다른 방법에 의하여 계산된 제1 소요 시간에 기반하여 네트워크 예상 응답 성능을 계산할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)는 캐시 메모리에 캐시 데이터를 요청한 때부터 캐시 메모리로부터 캐시 데이터를 획득할 때까지의 제2 소요 시간 에 기반하여 캐시 예상 응답 성능을 계산하는 단계(S220)를 포함할 수 있다. 일 실시예에서, 제2 소요 시간에 기반하여 캐시 예상 응답 성능을 계산하는 단계(S220)에서, 적어도 하나의 프 로세서는 응답 성능 계산 모듈의 명령어들 또는 프로그램 코드를 실행함으로써 캐시 메모리에 캐시 데이터를 요청한 때부터 캐시 메모리로부터 캐시 데이터를 획득할 때까지의 제2 소요 시간을 계 산하고, 계산된 제2 소요 시간에 기반하여 캐시 예상 응답 성능을 계산할 수 있다. 일 실시예에서, 캐시 메모리에 저장된 캐시 데이터의 헤더에는, 캐시 메모리에 캐시 데이터 를 요청한 시간과 캐시 메모리가 요청에 응답하여 캐시 데이터를 제공한 시간의 정보가 포함될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 캐시 메모리의 큐에 누적된 전체 데이터 요청의 수를 확인 할 수 있다. 이때, 전체 데이터 요청의 수는 캐시 데이터를 위한 캐시 데이터 요청(예를 들어, 제3 애플리 케이션 을 실행하기 위한 캐시 데이터 요청)뿐만 아니라, 전자 장치에서 실행되는 적어도 하나의 애 플리케이션, 예를 들어 제1 애플리케이션 및 제2 애플리케이션 각각을 실행하기 위한 적어도 하나의 캐시 데이터 요청을 모두 더한 수 일 수 있다. 또한, 전체 데이터 요청의 수는, 캐시 메모리의 큐뿐만 아 니라, 스토리지 장치의 큐에 쌓인 전체 데이터 요청의 수를 의미할 수도 있다. 일 실시예에서, 적어도 하나의 프로세서는 캐시 메모리의 큐에 누적된 전체 데이터 요청 중 캐시 데 이터를 위한 캐시 데이터 요청의 우선 순위(priority)를 확인할 수 있다. 이때, 캐시 메모리는 캐시 메모리가 큐에 쌓인 전체 데이터 요청 중 높은 우선 순위가 부여된 데이터 요청에 먼저 응답하여 대응되는 데이터를 제공할 수 있다. 일 실시예에서, 캐시 메모리가 큐에 쌓인 각각의 데이터 요청에 순차적으로 응답하여, 데이터 요청에 대응 되는 데이터를 제공하는 속도는 캐시 메모리 및 적어도 하나의 프로세서의 성능에 의하여 미리 계산 될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 응답 성능 계산 모듈의 명령어들 또는 프로그램 코드를 실 행함으로써 캐시 메모리에 캐시 데이터를 요청한 때부터 상기 캐시 메모리부터 캐시 데이터 를 획득할 때까지의 누적된 복수의 과거 제2 소요 시간들의 평균 시간, 캐시 메모리에 캐시 데이터 를 요청한 때부터 캐시 메모리로부터 캐시 데이터를 획득할 때까지의 직전의 제2 소요 시간, 캐시 메모리의 큐에 누적된 전체 데이터 요청의 수 또는 캐시 메모리의 큐에 누적된 전체 데이터 요청 중 캐시 데이터를 위한 캐시 데이터 요청의 우선 순위 중 적어도 하나에 기초하여 제2 소요 시간을 계산할 수 있다. 다만, 본 개시는 이에 제한되지 않고, 제2 소요 시간에 기반하여 네트워크 예상 응답 성능을 계산하는 단계 (S220)에서는 제2 소요 시간을 계산할 수 있는 다른 방법에 의하여 계산된 제2 소요 시간에 기반하여 캐시 예상 응답 성능을 계산할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)는 제1 소요 시간과 제2 소요 시간에 기반하여 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S230)를 포함할 수 있 다. 일 실시예에서, 적어도 하나의 프로세서는 응답 성능 비교 모듈의 명령어들 또는 프로그램 코드를 실 행함으로써, 제1 소요 시간이 제2 소요 시간보다 짧다고 판단됨에 따라 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 좋다고 판단할 수 있다. 적어도 하나의 프로세서는 응답 성능 비교 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 제1 소요 시간이 제2 소요 시간과 동일하다고 판단된 경우에도, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 좋다고 판단할 수 있다. 즉, 적어도 하나의 프로세서는 응답 성능 비교 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 제1 소요 시간이 제2 소요 시간 이하라고 판단됨에 따라 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 좋다고 판단할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)에서 제1 소요 시간이 제2 소요 시간 이하라고 판단되어, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높다고 판단됨에 따라, 전자 장치는 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획득하는 단계(S300)의 동작을 수행할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 응답 성능 비교 모듈의 명령어들 또는 프로그램 코드를 실 행함으로써, 제2 소요 시간이 제1 소요 시간보다 짧다고 판단됨에 따라 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 좋다고 판단할 수 있다. 즉, 적어도 하나의 프로세서는 응답 성능 비교 모듈의 명령어 들 또는 프로그램 코드를 실행함으로써, 제1 소요 시간이 제2 소요 시간을 초과한다고 판단됨에 따라 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 좋다고 판단할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)에서 제1 소요 시간이 제2 소요 시간을 초과한다고 판단되어, 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 높다고 판단됨에 따라, 전자 장치는 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득하는 단계 (S400)의 동작을 수행할 수 있다. 도 6은 본 개시의 일 실시예에 따른 캐시 데이터가 유효한지 여부를 판단하는 동작을 설명하기 위한 순서도이다. 이하, 도 4에서 설명한 단계와 동일한 단계에 대하여는 동일한 도면 부호를 부여하고, 중복되는 설 명은 생략하도록 한다. 도 1, 도 3, 도 4 및 도 6을 참조하면, 일 실시예에서, 전자 장치의 동작 방법은 캐시 메모리에 저장 된 캐시 데이터가 유효한지 여부를 판단하는 단계(S120)를 포함할 수 있다. 일 실시예에서, 캐시 메모리 에 저장된 캐시 데이터가 유효한지 여부를 판단하는 단계(S120)의 동작은 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신하는 단계(S100)의 동작 이후에 실행될 수 있다. 일 실시예에서, 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단하는 단계(S120)에서 적어 도 하나의 프로세서는 캐시 제어 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 캐시 메모리 에 저장된 캐시 데이터가 유효한지 여부를 판단할 수 있다. 일 실시예에서, 적어도 하나의 프로세서 는 캐시 제어 모듈의 명령어들 또는 프로그램 코드를 실행함으로써, 서버로부터 제공되는 네트 워크 데이터를 가져오도록 하는 요청을 수신하는 단계(S100)에서 요청된 네트워크 데이터에 대응되는 캐시 데이 터가 캐시 메모리에 저장되어 있는지 여부, 캐시 메모리에 저장되어 있는 캐시 데이터의 헤더에 포함된 유효 기간의 만료 여부 등에 기초하여 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단할 수 있다. 일 실시예에서, 캐시 메모리에 네트워크 데이터에 대응되는 캐시 데이터가 저장되지 않은 경우에도, 캐시 데이터가 비-유효한 경우를 의미할 수 있다. 일 실시예에서, 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단하는 단계(S120)에서 캐시 데이터가 유효하다고 판단됨에 따라, 전자 장치는 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)의 동작을 수행할 수 있다. 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계 (S200)의 비교 결과에 따라, 전자 장치는 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획 득하는 단계(S300)의 동작 또는 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득하는 단계(S400)의 동작을 수행할 수 있다. 일 실시예에서, 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단하는 단계(S120)에서 캐시 데이터가 비-유효하다고 판단됨에 따라, 전자 장치는 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획득하는 단계(S300)의 동작을 수행할 수 있다. 캐시 메모리에 저장된 캐시 데이터가 유효 하지 않기 때문에, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높은지와 무관하게, 적어도 하나의 프 로세서는 통신 인터페이스를 통하여 서버에 애플리케이션을 실행하기 위하여 필요한 네트워크 데이터를 요청하여 네트워크 데이터를 획득할 수 있다. 도 7은 본 개시의 일 실시예에 따른 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교한 이후에 캐시 데 이터가 유효한지 여부를 판단하는 동작을 설명하기 위한 순서도이다. 이하, 도 4 및 도 6에서 설명한 단계와 동 일한 단계에 대하여는 동일한 도면 부호를 부여하고, 중복되는 설명은 생략하도록 한다. 도 1, 도 3, 도 4, 도 6 및 도 7을 참조하면, 일 실시예에서, 전자 장치의 동작 방법은 캐시 메모리 에 저장된 캐시 데이터가 유효한지 여부를 판단하는 단계(S240)를 포함할 수 있다. 일 실시예에서, 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단하는 단계(S240)의 동작은 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)의 동작 이후에 실행될 수 있다. 일 실시예에서, 캐시 메모 리에 저장된 캐시 데이터가 유효한지 여부를 판단하는 단계(S240)의 동작은 네트워크 예상 응답 성능 과 캐시 예상 응답 성능을 비교하는 단계(S200)에서 캐시 예상 응답 성능이 네트워크 예상 응답 성능보다 높다 고 판단됨에 따라 실행될 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)에서 캐시 예상 응답 성 능이 네트워크 예상 응답 성능보다 높고, 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단 하는 단계(S240)에서 캐시 데이터가 유효하다고 판단됨에 따라, 전자 장치는 캐시 메모리에 캐시 데 이터를 요청하여 캐시 데이터를 획득하는 단계(S400)의 동작을 수행할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계(S200)에서 캐시 예상 응답 성 능이 네트워크 예상 응답 성능보다 높다고 판단됨에도, 캐시 메모리에 저장된 캐시 데이터가 유효한 지 여부를 판단하는 단계(S240)에서 캐시 데이터가 비-유효하다고 판단된 경우, 전자 장치는 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획득하는 단계(S300)의 동작을 수행할 수 있다. 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높더라도, 캐시 메모리에 저장된 캐시 데이터가 비-유효하기 때문에, 적어도 하나의 프로세서는 통신 인터페이스를 통하여 서버에 애플리케이션을 실행하기 위하여 필요한 네트워크 데이터를 요청하여 네트워크 데이터를 획득할 수 있다. 도 8은 본 개시의 일 실시예에 따른 네트워크 데이터를 가져오도록 하는 요청이 필요한지 여부를 판단하는 동작 을 설명하기 위한 순서도이다. 이하, 도 4에서 설명한 단계와 동일한 단계에 대하여는 동일한 도면 부호를 부여 하고, 중복되는 설명은 생략하도록 한다. 도 1, 도 3, 도 4 및 도 8을 참조하면, 일 실시예에서, 전자 장치의 동작 방법은 애플리케이션을 실행하기 위하여 필요한 적어도 하나의 데이터 중 서버에 요청하여 획득해야 하는 네트워크 데이터를 판단하는 단계 (S50)를 포함할 수 있다. 일 실시예에서, 네트워크 데이터를 판단하는 단계(S50)의 동작은 서버로부터 제 공되는 네트워크 데이터를 가져오도록 하는 요청을 수신하는 단계(S100)의 동작 이전에 실행될 수 있다. 일 실시예에서, 네트워크 데이터는 애플리케이션을 실행함에 있어, 서버에 저장되어 있어, 서버에 요 청하여 서버로부터 제공받아야 하는 데이터를 의미할 수 있다. 다만, 서버에 기-요청하여 이미 획득 된 이력이 있는 경우, 해당 네트워크 데이터는 캐시 데이터로서 캐시 메모리에 저장되어 있을 수도 있다. 일 실시예에서, 적어도 하나의 프로세서는 요청 수신 모듈의 명령어들 또는 프로그램 코드를 실행함 으로써, 애플리케이션을 실행하기 위한 명령어들, 데이터 구조, 또는 프로그램 코드(program code)에서 필요한 적어도 하나의 데이터 중 서버에 저장되어 있어, 서버에 요청하여 서버로부터 제공받아야 하는 네트워크 데이터를 판단할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 애플리케이션을 실행하기 위한 적어도 하나의 데이터 중, 네트 워크 데이터로 판단된 데이터에 대하여 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 생성할 수 있다. 또한, 적어도 하나의 프로세서는 애플리케이션을 실행함에 있어, 애플리케이션로부터 서 버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신할 수도 있다. 적어도 하나의 프로세서 는 애플리케이션을 실행하기 위한 적어도 하나의 데이터 중, 네트워크 데이터로 판단되지 않은 데이터에 대하여 스토리지 장치에 요청할 수도 있다. 도 9는 본 개시의 일 실시예에 따른 획득된 네트워크 데이터 또는 캐시 데이터에 따라 애플리케이션을 실행하는 동작을 설명하기 위한 순서도이다. 일 실시예에서, 도 4에서 설명한 단계와 동일한 단계에 대하여는 동일한 도 면 부호를 부여하고, 중복되는 설명은 생략하도록 한다. 도 1, 도 3, 도 4 및 도 8을 참조하면, 일 실시예에서, 전자 장치의 동작 방법은 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 이용하여 애플리케이션을 실행하는 단계(S600)를 포함할 수 있다. 일 실시예에서, 전자 장치의 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 이용하여 애플리케이션을 실행하는 단계 (S600)의 동작은 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 단계(S500)의 동작 이후에 실행 될 수 있다. 일 실시예에서, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 이용하여 애플리케이션을 실행하는 단계 (S600)에서, 이용되는 네트워크 데이터 또는 캐시 데이터는, 획득된 네트워크 데이터 또는 획득된 캐시 데이터 를 처리하는 단계(S500)에서 전처리된 네트워크 데이터 또는 전처리된 캐시 데이터일 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 데이터 처리 모듈의 명령어들 또는 프로그램 코드를 실행 함으로써, 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 이용하여 애플리케이션을 실행할 수 있다. 도 10은 본 개시의 일 실시예에 따른 네트워크 데이터 요청의 발생 시간과 미리 설정된 기준 시간과의 관계에 따른 전자 장치의 동작을 설명하기 위한 순서도이다. 일 실시예에서, 도 4에서 설명한 단계와 동일한 단계에 대 하여는 동일한 도면 부호를 부여하고, 중복되는 설명은 생략하도록 한다. 도 1, 도 3, 도 4 및 도 10을 참조하면, 일 실시예에서, 전자 장치의 동작 방법은 미리 설정된 기준 시간 과 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청의 발생 시간을 비교하는 단계(S101)를 포함할 수 있다. 일 실시예에서, 전자 장치의 미리 설정된 기준 시간과 서버로부터 제공되는 네트워 크 데이터를 가져오도록 하는 요청의 발생 시간을 비교하는 단계(S101)의 동작은 서버로부터 제공되는 네 트워크 데이터를 가져오도록 하는 요청을 수신하는 단계(S100)의 동작 이후에 실행될 수 있다. 일 실시예에서, 미리 설정된 기준 시간은, 특정 이벤트를 기준으로 설정된 시간일 수 있다. 일 실시예에서, 미 리 설정된 기준 시간은 특정 이벤트가 발생한 시점부터 3초까지의 시간으로 설정될 수 있다. 다만, 본 개시는 이에 제한되지 않고, 3초보다 작은 시간 혹은 긴 시간으로 설정될 수도 있다. 일 실시예에서 특정 이벤트는 전자 장치가 부팅되는 동작을 포함할 수 있다 이 경우, 기준 시간은 전자 장 치가 부팅이 된 시점부터 3초까지의 시간으로 설정된 시간일 수 있다. 다만, 본 개시는 이에 제한되지 않 고, 특정 이벤트는 특정 애플리케이션의 실행 또는 특정 애플리케이션 내에서의 특정 동작의 실행을 포함할 수 있다. 일 실시예에서, 특정 이벤트는 카메라 애플리케이션에서 동영상 녹화 동작이 시작되는 시점을 의미할 수 있다. 이 경우, 기준 시간은 카메라 애플리케이션에서 동영상 녹화 동작이 시작된 시점부터 3초까지의 시간으로 설정된 시간일 수 있다. 일 실시예에서, 미리 설정된 기준 시간은 특정 이벤트가 발생한 경우에 스토리지 장치 또는 캐시 메모리 의 큐에 쌓이는 데이터 요청의 수가 많아, 입력/출력의 병목 현상에 데이터 응답에 대응되는 데이터가 늦 게 제공되어, 해당 이벤트의 실행 속도나 동작 속도가 느려질 수 있다고 판단되는 구간일 수 있다. 일 실시예에서, 미리 설정된 기준 시간과 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청의 발생 시간을 비교하는 단계(S101)에서, 적어도 하나의 프로세서는 네트워크 데이터의 요청을 수신하는 단 계(S100)에서 수신된 네트워크 데이터의 요청이 발생된 시간과 미리 설정된 기준 시간을 비교할 수 있다. 적어 도 하나의 프로세서는 수신된 네트워크 데이터의 요청이 발생된 시간과 미리 설정된 기준 시간을 비교하여 네트워크 데이터의 요청이 발생한 시간이 미리 설정된 기준 시간과 같거나 이전인지 판단할 수 있다. 적어도 하 나의 프로세서는 수신된 네트워크 데이터의 요청이 발생된 시간과 미리 설정된 기준 시간을 비교하여 네트 워크 데이터의 요청이 발생한 시간이 미리 설정된 기준 시간 이후인지 판단할 수 있다. 일 실시예에서, 미리 설정된 기준 시간과 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청의 발생 시간을 비교하는 단계(S101)에서, 수신된 네트워크 데이터의 요청이 발생된 시간이 미리 설정된 기준 시간 과 같거나 이전이라고 판단됨에 따라, 전자 장치는 서버에 네트워크 데이터를 요청하여 네트워크 데 이터를 획득하는 단계(S102)의 동작을 수행할 수 있다 일 실시예에서, 미리 설정된 기준 시간과 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청의 발생 시간을 비교하는 단계(S101)에서, 수신된 네트워크 데이터의 요청이 발생된 시간이 미리 설정된 기준 시간 이후라고 판단됨에 따라, 전자 장치는 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계 (S200)의 동작을 수행할 수 있다. 이를 통하여, 스토리지 장치 또는 캐시 메모리의 큐에 쌓이는 데이터 요청의 수가 많은 것으로 예상 되는 경우에 캐시 메모리가 아닌 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획득함에 따 라, 입력/출력의 병목 현상에 데이터 응답에 대응되는 데이터가 늦게 제공되어 해당 이벤트의 실행 속도나 동작 속도가 느려지는 것을 방지할 수 있다. 도 11은 본 개시의 일 실시예에 따른 서버에 네트워크 데이터를 요청하고, 캐시 메모리에 캐시 데이터를 요청하 는 전자 장치의 동작을 설명하기 위한 순서도이다. 일 실시예에서, 도 4에서 설명한 단계와 동일한 단계에 대하 여는 동일한 도면 부호를 부여하고, 중복되는 설명은 생략하도록 한다. 도 1, 도 3, 도 4 및 도 11을 참조하면, 일 실시예에서, 전자 장치의 동작 방법은 서버에 네트워크 데이터를 요청하는 단계(S103)를 포함할 수 있다. 전자 장치의 동작 방법은 캐시 메모리에 캐시 데이 터를 요청하는 단계(S104)를 포함할 수 있다. 일 실시예에서, 전자 장치의 서버에 네트워크 데이터를 요청하는 단계(S103) 및 캐시 메모리에 캐시 데이터를 요청하는 단계(S104)는 각각 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신하는 단계(S100)의 동작 이후에 실행될 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 네트워크 데이터의 요청을 수신하는 단계(S100)에서 네트워크 데이터 요청이 수신되면, 서버에 네트워크 데이터를 요청하고, 캐시 메모리에 캐시 데이터를 요 청할 수 있다. 일 실시예에서, 전자 장치의 동작 방법은 획득한 네트워크 데이터 또는 캐시 데이터 중 하나를 처리하는 단계(S150)를 포함할 수 있다. 일 실시예에서, 획득한 네트워크 데이터 또는 캐시 데이터 중 하나를 처리하는 단계(S150)에서, 적어도 하나의 프로세서는 네트워크 데이터를 요청한 서버에서 네트워크 데이터가 획득되거나, 혹은 캐시 데이터를 요청한 캐시 메모리에서 캐시 데이터가 획득되는 경우에 획득 된 네트워크 데이터 또는 캐시 데이터 중 하나를 처리할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는 서버로부터 획득되는 네트워크 데이터와 캐시 메모리(32 0)에서 획득되는 캐시 데이터 중 먼저 획득되는 데이터를 처리할 수 있다. 적어도 하나의 프로세서는 서버로부터 획득되는 네트워크 데이터와 캐시 메모리에서 획득되는 캐시 데이터 중 먼저 획득되 는 데이터를 이용하여 애플리케이션을 실행할 수 있다. 이를 통하여, 적어도 하나의 프로세서는 캐시 메모 리에 포함된 캐시 데이터의 유효 여부 및 네트워크 예상 응답 성능과 캐시 예상 응답 성능 비교와 무 관하게, 네트워크 데이터와 캐시 데이터 중 먼저 획득되는 데이터를 이용하여 애플리케이션을 실행할 수 있어, 애플리케이션의 실행 속도나 동작 속도가 느려지는 것을 방지할 수 있다. 도 12a는 본 개시의 일 실시예에 따른 이미지 품질 평가 방법을 이용하는 전자 장치를 설명하기 위한 도면이다. 도 12b는 본 개시의 일 실시예에 따른 이미지 품질 평가 방법을 이용하는 전자 장치를 설명하기 위한 도면이다. 도 1, 도 3, 도 4 및 도 12a를 참조하면, 도 12a에는 전자 장치가 도시되어 있다. 일 실시예에서, 도 12a 에는 전자 장치가 텔레비전의 형상을 갖는 것으로 도시되었으나, 본 개시는 이에 제한되지 않는다. 일 실시예에서, 도 12a에는 전자 장치의 부팅 후, 전자 장치에서 애플리케이션을 실행하는 것이 도시되어 있다. 일 실시예에서, 텔레비전의 부팅 후, 웹 서버를 통하여 스트리밍 서비스를 제공받기 위한 웹 애플리케이션을 실행시킨 경우일 수 있다. 일 실시예에서, 애플리케이션을 실행하기 위해서 서버로부터 제공되는 네트워크 데이터(예를 들어, 동영상 등)이 필요할 수 있다. 전자 장치는 캐시 메모리에 저장된 캐시 데이터가 유효한지 여 부를 판단할 수 있다. 일 실시예에서, 전자 장치는 필요한 네트워크 데이터에 대응되는 캐시 데이터의 유효 기간이 만료되 기 전이라고 판단된 경우, 캐시 데이터가 유효하다고 판단할 수 있다. 일 실시예에서, 전자 장치는 캐시 데이터가 유효한 경우, 서버에 네트워크 데이터를 요청한 때 부터 서버로부터 네트워크 데이터를 획득할 때까지의 제1 소요 시간 및 캐시 메모리에 캐시 데이터 를 요청한 때부터 캐시 메모리로부터 캐시 데이터를 획득할 때까지의 제2 소요 시간을 계산하고, 제1 소요 시간과 제2 소요 시간을 비교할 수 있다. 일 실시예에서, 캐시 메모리에 캐시 데이터가 저장되어 있더라도, 전자 장치의 부팅 시에 복수 의 기능들 및 다른 종류의 애플리케이션들이 실행됨에 따라, 캐시 메모리의 큐 또는 캐시 메모리를 포함하는 스토리지 장치의 큐에 많은 데이터 응답이 쌓일 수 있다. 따라서 애플리케이션을 실행하기 위해 필요한 캐시 데이터가 늦게 제공될 수 있다. 또한, 통신 인터페이스 및 네트워크(network)의 기술 발 전으로, 서버를 통하여 네트워크 데이터를 제공받는 속도도 종래와 비교하여 빠를 수 있다. 따라서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간보다 짧 은 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높다고 판단할 수 있다. 전자 장치는 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하고, 서버로부터 네트워크 데이터를 제공 받아 애플리케이션을 실행할 수 있다. 일 실시예에서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간 과 같은 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능과 같다고 판단할 수 있다. 전자 장치는 캐시 메모리의 큐 또는 스토리지 장치의 큐에 애플리케이션을 실행하기 위해 필요한 캐시 데이 터 요청이 쌓이지 않고, 전자 장치의 부팅 시에 복수의 기능들 및 다른 종류의 애플리케이션들이 실행되 는 속도를 빠르게 하기 위하여, 통신 인터페이스를 통하여 웹 서버에 네트워크 데이터를 요청하고, 웹 서버로부터 네트워크 데이터를 제공받아 애플리케이션을 실행할 수 있다. 일 실시예에서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간 보다 긴 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 낮다고 판단할 수 있다. 전자 장치는 애플리케이션이 늦게 실행되는 것을 방지하기 위하여, 캐시 메모리에 캐시 데이터를 요청하고, 캐시 메모리로부터 캐시 데이터를 제공받아 애플리케이션을 실행할 수 있다. 일 실시예에서, 전자 장치는 필요한 네트워크 데이터에 대응되는 캐시 데이터가 저장되어 있지 않거 나, 혹은 대응되는 캐시 데이터의 유효 기간이 만료되었다고 판단된 경우 캐시 데이터가 비-유효하다 고 판단할 수 있다. 일 실시예에서, 전자 장치는 캐시 데이터가 비-유효한 경우, 통신 인터페이스를 통하여 웹 애 플리케이션과 연동되는 웹 서버에 웹 애플리케이션을 실행하기 위한 네트워크 데이터를 요청하고, 웹 서버로부 터 네트워크 데이터를 획득할 수 있다. 전자 장치는 획득한 네트워크 데이터를 처리하고, 애플리케이션 을 실행할 수 있다. 도 1, 도 3, 도 4 및 도 12b를 참조하면, 일 실시예에서, 도 12b에는 전자 장치에서 어느 하나의 애플리 케이션의 제1 동작이 실행되고 있던 중, 다른 제2 동작을 추가로 실행하는 것이 도시되어 있다. 일 실시예에서, 텔레비전에서 웹 애플리케이션을 통하여 동영상을 시청하던 중, 다른 동영상을 시청하기 위하여 메 뉴를 표시하거나, 추천 동영상을 제공받거나, 광고가 표시되거나, 또는 알림이 표시되는 경우 등일 수 있 고, 어느 하나로 제한되지 않는다. 일 실시예에서, 제2 동작을 실행하기 위하여 서버로부터 제공되는 네트워크 데이터가 필요할 수 있 다. 전자 장치는 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단할 수 있다. 일 실시예에서, 전자 장치는 필요한 네트워크 데이터에 대응되는 캐시 데이터의 유효 기간이 만료되 기 전이라고 판단된 경우, 캐시 데이터가 유효하다고 판단할 수 있다. 일 실시예에서, 전자 장치는 캐시 데이터가 유효한 경우, 제1 소요 시간 및 제2 소요 시간을 계산하 고, 제1 소요 시간과 제2 소요 시간을 비교할 수 있다. 일 실시예에서, 캐시 메모리에 캐시 데이터가 저장되어 있더라도, 애플리케이션의 제1 동작이 실행되고 있음에 따라, 캐시 메모리의 큐 또는 캐시 메모리를 포함하는 스토리지 장치의 큐에 많은 데이터 응답이 쌓일 수 있다. 따라서 애플리케이션의 제2 동작을 실행하기 위해 필요한 캐시 데이터가 늦게 제공될 수 있다. 따라서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간보다 짧 은 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높다고 판단할 수 있다. 전자 장치는 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하고, 서버로부터 네트워크 데이터를 제공 받아 애플리케이션의 제2 동작을 실행할 수 있다. 일 실시예에서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간 과 같은 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능과 같다고 판단할 수 있다. 전자 장치는 캐시 메모리의 큐 또는 스토리지 장치의 큐에 애플리케이션의 제2 동작을 실행하기 위해 필요 한 캐시 데이터 요청이 쌓이지 않고, 애플리케이션의 제1 동작이 실행되는 속도를 빠르게 하기 위하여, 통신 인터페이스를 통하여 웹 서버에 네트워크 데이터를 요청하고, 웹 서버로부터 네트워크 데 이터를 제공받아 애플리케이션의 제2 동작을 실행할 수 있다. 일 실시예에서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간 보다 긴 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 낮다고 판단할 수 있다. 전자 장치는 애플리케이션의 제2 동작이 늦게 실행되는 것을 방지하기 위하여, 캐시 메모리에 캐시 데이터 를 요청하고, 캐시 메모리로부터 캐시 데이터를 제공받아 애플리케이션의 제2 동작을 실행할 수 있다. 일 실시예에서, 전자 장치는 필요한 네트워크 데이터에 대응되는 캐시 데이터가 저장되어 있지 않거 나, 혹은 대응되는 캐시 데이터의 유효 기간이 만료되었다고 판단된 경우 캐시 데이터가 비-유효하다 고 판단할 수 있다. 일 실시예에서, 전자 장치는 캐시 데이터가 비-유효한 경우, 통신 인터페이스를 통하여 웹 애 플리케이션과 연동되는 웹 서버에 웹 애플리케이션을 실행하기 위한 네트워크 데이터를 요청하고, 웹 서버로부 터 네트워크 데이터를 획득할 수 있다. 전자 장치는 획득한 네트워크 데이터를 처리하고, 애플리케이션의 제2 동작을 실행할 수 있다. 도 13은 본 개시의 일 실시예에 따른 이미지 품질 평가 방법을 이용하는 전자 장치를 설명하기 위한 도면이다. 도 1, 도 3, 도 4 및 도 13을 참조하면, 도 13에는 전자 장치가 스마트폰의 형상을 갖는 것으로 도시되었 으나, 본 개시는 이에 제한되지 않는다. 일 실시예에서, 도 13에는 전자 장치에서 제1 애플리케이션이 실행되고 있는 동안, 다른 제2 애플 리케이션이 실행되는 것이 도시되어 있다. 일 실시예에서, 전자 장치의 카메라를 통하여 동영상 녹 화를 하는 동안, 음악을 듣거나, 메신저 애플리케이션을 하거나, 알람이 오거나, 광고가 제공되는 경우 등일 수 있고, 어느 하나로 제한되지 않는다. 일 실시예에서, 제2 애플리케이션을 실행하기 위하여 서버로부터 제공되는 네트워크 데이터가 필요 할 수 있다. 전자 장치는 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단할 수 있 다. 일 실시예에서, 전자 장치는 필요한 네트워크 데이터에 대응되는 캐시 데이터의 유효 기간이 만료되 기 전이라고 판단된 경우, 캐시 데이터가 유효하다고 판단할 수 있다. 일 실시예에서, 전자 장치는 캐시 데이터가 유효한 경우, 제1 소요 시간 및 제2 소요 시간을 계산하 고, 제1 소요 시간과 제2 소요 시간을 비교할 수 있다. 일 실시예에서, 캐시 메모리에 캐시 데이터가 저장되어 있더라도, 제1 애플리케이션이 실행되 고 있음에 따라, 캐시 메모리의 큐 또는 캐시 메모리를 포함하는 스토리지 장치의 큐에 많은 데 이터 응답이 쌓일 수 있다. 따라서 제2 애플리케이션을 실행하기 위해 필요한 캐시 데이터가 늦게 제공될 수 있다. 따라서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간보다 짧 은 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 높다고 판단할 수 있다. 전자 장치는 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하고, 서버로부터 네트워크 데이터를 제공 받아 제2 애플리케이션을 실행할 수 있다.일 실시예에서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간 과 같은 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능과 같다고 판단할 수 있다. 전자 장치는 캐시 메모리의 큐 또는 스토리지 장치의 큐에 제2 애플리케이션을 실행하기 위해 필요한 캐시 데이터 요청이 쌓이지 않고, 제1 애플리케이션이 실행되는 속도를 빠르게 하기 위하여, 통신 인터페이스 를 통하여 웹 서버에 네트워크 데이터를 요청하고, 웹 서버로부터 네트워크 데이터를 제공받아 제2 애플리케이션을 실행할 수 있다. 일 실시예에서, 전자 장치는 제1 소요 시간과 제2 소요 시간을 비교하여, 제1 소요 시간이 제2 소요 시간 보다 긴 경우, 네트워크 예상 응답 성능이 캐시 예상 응답 성능보다 낮다고 판단할 수 있다. 전자 장치는 제2 애플리케이션이 늦게 실행되는 것을 방지하기 위하여, 캐시 메모리에 캐시 데이터를 요청 하고, 캐시 메모리로부터 캐시 데이터를 제공받아 제2 애플리케이션을 실행할 수 있다. 일 실시예에서, 전자 장치는 필요한 네트워크 데이터에 대응되는 캐시 데이터가 저장되어 있지 않거 나, 혹은 대응되는 캐시 데이터의 유효 기간이 만료되었다고 판단된 경우 캐시 데이터가 비-유효하다 고 판단할 수 있다. 일 실시예에서, 전자 장치는 캐시 데이터가 비-유효한 경우, 통신 인터페이스를 통하여 웹 애 플리케이션과 연동되는 웹 서버에 웹 애플리케이션을 실행하기 위한 네트워크 데이터를 요청하고, 웹 서버로부 터 네트워크 데이터를 획득할 수 있다. 전자 장치는 획득한 네트워크 데이터를 처리하고, 제2 애플리케이 션을 실행할 수 있다. 상술한 기술적 과제를 해결하기 위하여, 일 실시예에서, 전자 장치를 제공한다. 전자 장치는 적어도 하나의 명 령어(instruction)를 저장하는 메모리를 포함할 수 있다. 전자 장치는 캐시(cache) 데이터를 저장하는 캐시 메 모리를 포함할 수 있다. 전자 장치는 메모리에 저장된 적어도 하나의 명령어를 실행하는 적어도 하나의 프로세 서를 포함할 수 있다. 전자 장치는 통신 인터페이스를 포함할 수 있다. 적어도 하나의 프로세서는 적어도 하나 의 명령어를 실행함으로써 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신할 수 있다. 적 어도 하나의 프로세서는 적어도 하나의 명령어를 실행함으로써 네트워크 데이터를 서버로부터 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 네트워크 예상 응답 성능과 캐시 메모리로부터 네트워크 데이터에 대 응되는 캐시 데이터를 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 캐시 예상 응답 성능을 비교할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 명령어를 실행함으로써 비교 결과에 따라 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 네트워크 데이터를 획득하거나, 또는 캐시 메모리에 캐시 데이터를 요청하여 캐시 데이터를 획득할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 명령어를 실행함으로써 획득 된 네트워크 데이터 또는 획득된 캐시 데이터를 처리할 수 있다. 일 실시예에서 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 서버에 네트워크 데이터를 요 청한 때부터 서버로부터 네트워크 데이터를 획득할 때까지의 제1 소요 시간에 기반하여 네트워크 예상 응답 성 능을 계산할 수 있다. 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 캐시 메모리에 캐시 데 이터를 요청한 때부터 캐시 메모리로부터 캐시 데이터를 획득할 때까지의 제2 소요 시간에 기반하여 캐시 예상 응답 성능을 계산할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 제1 소요 시간이 제2 소요 시 간 이하라고 판단됨에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워 크 데이터를 획득할 수 있다. 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 제1 소요 시간 이 제2 소요 시간을 초과한다고 판단됨에 따라, 캐시 메모리에 캐시 데이터를 요청하여 캐시 메모리로부터 캐시 데이터를 획득할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 서버에 네트워크 데이터를 요 청한 때부터 서버로부터 네트워크 데이터를 획득할 때까지의 누적된 복수의 과거 제1 소요 시간들의 평균 시간 또는 서버에 네트워크 데이터를 요청한 때부터 서버로부터 네트워크 데이터를 획득할 때까지의 직전의 제1 소요 시간 중 적어도 하나에 기초하여 제1 소요 시간을 계산할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 캐시 메모리에 캐시 데이터를 요청한 때부터 캐시 메모리부터 캐시 데이터를 획득할 때까지의 누적된 복수의 과거 제2 소요 시간들의 평균 시 간, 캐시 메모리에 캐시 데이터를 요청한 때부터 캐시 메모리로부터 캐시 데이터를 획득할 때까지의 직전의 제2 소요 시간, 캐시 메모리의 큐(queue)에 누적된 전체 데이터 요청의 수, 캐시 메모리의 큐(queue)에 누적된 전체데이터 요청 중 캐시 데이터를 위한 캐시 데이터 요청의 우선 순위(priority) 중 적어도 하나에 기초하여 제2 소요 시간을 계산할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단할 수 있다. 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 캐시 데이터가 유효하다고 판단됨에 따라, 네트워크 예상 응답 성능과 캐시 응답 성능을 비교할 수 있다. 적어 도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 캐시 데이터가 비-유효하다고 판단됨에 따라, 통 신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획득할 수 있다. 일 실시예에서, 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써, 캐시 데이터의 유효 기간의 만료 여부에 기초하여 캐시 데이터가 유효한지 여부를 판단할 수 있다. 일 실시예에서, 캐시 데이터는 서버로부터 미리 획득하여 캐시 메모리에 저장된 데이터일 수 있다. 일 실시예에서, 캐시 메모리는 비-휘발성(non-volatile) 메모리일 수 있다. 일 실시예에서, 전자 장치는 애플리케이션을 실행할 수 있다. 네트워크 데이터 및 캐시 데이터는 애플리케이션 을 실행하기 위한 데이터일 수 있다. 적어도 하나의 프로세서는, 적어도 하나의 명령어를 실행함으로써 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 이용하여 애플리케이션을 실행할 수 있다. 상술한 기술적 과제를 해결하기 위하여 일 실시예에서, 전자 장치의 동작 방법을 제공한다. 전자 장치의 동작 방법은 서버로부터 제공되는 네트워크 데이터를 가져오도록 하는 요청을 수신하는 단계를 포함할 수 있다. 전자 장치의 동작 방법은 네트워크 데이터를 서버로부터 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 네트워크 예상 응답 성능과 캐시(cache) 데이터를 저장하는 캐시 메모리로부터 네트워크 데이터에 대응되는 캐 시 데이터를 가져오는 동작에 소요될 것으로 예상되는 시간을 나타내는 캐시 예상 응답 성능을 비교하는 단계를 포함할 수 있다. 전자 장치의 동작 방법은 비교 결과에 따라 통신 인터페이스를 통하여 서버에 네트워크 데이터 를 요청하여 서버로부터 네트워크 데이터를 획득하거나, 또는 캐시 메모리에 캐시 메모리를 요청하여 캐시 메모 리부터 캐시 데이터를 획득하는 단계를 포함할 수 있다. 전자 장치의 동작 방법은 획득된 네트워크 데이터 또는 획득된 캐시 데이터를 처리하는 단계를 포함할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계는 서버에 네트워크 데이터를 요청한 때부터 서버로부터 네트워크 데이터를 획득할 때까지의 제1 소요 시간에 기반하여 네트워크 예상 응답 성능을 계산하는 단계를 포함할 수 있다. 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계는 캐시 메모리에 캐시 데이터를 요청한 때부터 메모리로부터 캐시 데이터를 획득할 때까지의 제2 소요 시간에 기 반하여 캐시 예상 응답 성능을 계산하는 단계를 포함할 수 있다. 네트워크 예상 응답 성능과 캐시 예상 응답 성 능을 비교하는 단계는 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계를 포함할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계에서는 제1 소요 시간이 제2 소요 시간 이하라고 판단됨에 따라, 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요청하여 서버로부터 네트워크 데이터를 획득할 수 있다. 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 단계에서는 제 1 소요 시간이 제2 소요 시간을 초과한다고 판단됨에 따라, 캐시 메모리에 캐시 데이터를 요청하여 캐시 메모리 로부터 캐시 데이터를 획득할 수 있다. 일 실시예에서, 네트워크 예상 응답 성능을 계산하는 단계에서는, 서버에 네트워크 데이터를 요청한 때부터 서 버로부터 네트워크 데이터를 획득할 때까지의 누적된 복수의 과거 제1 소요 시간들의 평균 시간 또는 서버에 네 트워크 데이터를 요청한 때부터 서버로부터 네트워크 데이터를 획득할 때까지의 직전의 제1 소요 시간 중 적어 도 하나에 기초하여 제1 소요 시간을 계산할 수 있다. 일 실시예에서, 캐시 예상 응답 성능을 계산하는 단계에서는 캐시 메모리에 캐시 데이터를 요청한 때부터 캐시 메모리부터 캐시 데이터를 획득할 때까지의 누적된 복수의 과거 제2 소요 시간들의 평균 시간, 캐시 메모리에 캐시 데이터를 요청한 때부터 캐시 메모리로부터 캐시 데이터를 획득할 때까지의 직전의 제2 소요 시간, 캐시 메모리의 큐(queue)에 누적된 전체 데이터 요청의 수, 캐시 메모리의 큐(queue)에 누적된 전체 데이터 요청 중 캐시 데이터를 위한 캐시 데이터 요청의 우선 순위(priority) 중 적어도 하나에 기초하여 제2 소요 시간을 계산 할 수 있다. 일 실시예에서, 전자 장치의 동작 방법은 캐시 메모리에 저장된 캐시 데이터가 유효한지 여부를 판단하는 단계 를 더 포함할 수 있다. 캐시 데이터가 유효한지 여부를 판단하는 단계에서, 캐시 데이터가 유효하다고 판단됨에따라 네트워크 예상 응답 성능과 캐시 응답 성능을 비교할 수 있다. 캐시 데이터가 유효한지 여부를 판단하는 단계에서, 캐시 데이터가 비-유효하다고 판단됨에 따라 통신 인터페이스를 통하여 서버에 네트워크 데이터를 요 청하여 서버로부터 네트워크 데이터를 획득할 수 있다. 일 실시예에서, 캐시 데이터가 유효한지 여부를 판단하는 단계에서는, 캐시 데이터의 유효 기간의 만료 여부에 기초하여 캐시 데이터가 유효한지 여부를 판단할 수 있다. 상술한 기술적 과제를 해결하기 위하여, 일 실시예에서 개시된 전자 장치의 동작 방법의 실시예 중 적어도 하나 의 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록 매체를 제공할 수 있다. 본 개시에서 설명된 전자 장치에 의해 실행되는 프로그램은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 프로그램은 컴퓨터로 읽을 수 있는 명 령어들을 수행할 수 있는 모든 시스템에 의해 수행될 수 있다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령어(instruction), 또는 이들 중 하나 이상 의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어는, 컴퓨터로 읽을 수 있는 저장 매체(computer-readable storage media)에 저장된 명령어를 포함하 는 컴퓨터 프로그램으로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록 매체로는, 예를 들어 마그네틱 저장 매체 (예컨대, ROM(read-only memory), RAM(random-access memory), 플로피 디스크, 하드 디스크 등) 및 광학적 판 독 매체(예컨대, 시디롬(CD-ROM), 디브이디(DVD: Digital Versatile Disc)) 등이 있다. 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템들에 분산되어, 분산 방식으로 컴퓨터가 판독 가능한 코드가 저장 되고 실행될 수 있다. 기록 매체는 컴퓨터에 의해 판독 가능하며, 메모리에 저장되고, 프로세서에서 실행될 수 있다. 컴퓨터로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구 분하지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 또한, 본 명세서에 개시된 실시예들에 따른 프로그램은 컴퓨터 프로그램 제품(computer program product)에 포 함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 소프트웨어 프로그램, 소프트웨어 프로그램이 저장된 컴퓨터로 읽을 수 있는 저장 매체 를 포함할 수 있다. 예를 들어, 컴퓨터 프로그램 제품은 전자 장치의 제조사 또는 전자 마켓(예를 들어, 삼성 갤럭시 스토어)을 통해 전자적으로 배포되는 소프트웨어 프로그램 형태의 상품(예를 들어, 다운로드 가능한 애 플리케이션(downloadable application))을 포함할 수 있다. 전자적 배포를 위하여, 소프트웨어 프로그램의 적어 도 일부는 저장 매체에 저장되거나, 임시적으로 생성될 수 있다. 이 경우, 저장 매체는 전자 장치의 제조사의 서버, 전자 마켓의 서버, 또는 소프트웨어 프로그램을 임시적으로 저장하는 중계 서버의 저장 매체가 될 수 있 다."}
{"patent_id": "10-2023-0095487", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 컴퓨터 시스템 또는 모듈 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12a 도면12b 도면13"}
{"patent_id": "10-2023-0095487", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시는, 다음의 자세한 설명과 그에 수반되는 도면들의 결합으로 이해될 수 있으며, 참조 번호(reference numerals)들은 구조적 구성요소(structural elements)를 의미한다. 도 1은 본 개시의 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 2는 본 개시의 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 도면이다. 도 3은 본 개시의 일 실시예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 4는 본 개시의 일 실시예에 따른 전자 장치의 동작을 설명하기 위한 순서도이다. 도 5는 본 개시의 일 실시예에 따른 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교하는 동작을 설명하 기 위한 순서도이다. 도 6은 본 개시의 일 실시예에 따른 캐시 데이터가 유효한지 여부를 판단하는 동작을 설명하기 위한 순서도이다. 도 7은 본 개시의 일 실시예에 따른 네트워크 예상 응답 성능과 캐시 예상 응답 성능을 비교한 이후에 캐시 데 이터가 유효한지 여부를 판단하는 동작을 설명하기 위한 순서도이다. 도 8은 본 개시의 일 실시예에 따른 네트워크 데이터를 가져오도록 하는 요청이 필요한지 여부를 판단하는 동작 을 설명하기 위한 순서도이다. 도 9는 본 개시의 일 실시예에 따른 획득된 네트워크 데이터 또는 획득된 캐시 데이터에 따라 애플리케이션을실행하는 동작을 설명하기 위한 순서도이다. 도 10은 본 개시의 일 실시예에 따른 네트워크 데이터 요청의 발생 시간과 미리 설정된 기준 시간과의 관계에 따른 전자 장치의 동작을 설명하기 위한 순서도이다. 도 11은 본 개시의 일 실시예에 따른 서버에 네트워크 데이터를 요청하고, 캐시 메모리에 캐시 데이터를 요청하 는 전자 장치의 동작을 설명하기 위한 순서도이다. 도 12a는 본 개시의 일 실시예에 따른 이미지 품질 평가 방법을 이용하는 전자 장치를 설명하기 위한 도면이다. 도 12b는 본 개시의 일 실시예에 따른 이미지 품질 평가 방법을 이용하는 전자 장치를 설명하기 위한 도면이다. 도 13은 본 개시의 일 실시예에 따른 이미지 품질 평가 방법을 이용하는 전자 장치를 설명하기 위한 도면이다."}
