{"patent_id": "10-2022-0014390", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0117971", "출원번호": "10-2022-0014390", "발명의 명칭": "모돈의 수정적기탐지장치 및 그 방법", "출원인": "(주)엠트리센", "발명자": "서만형"}}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웅돈구역과 모돈구역을 차단하는 벽에 형성된 소정 크기의 관통홀의 주변을 센싱영역으로 설정하고, 상기 센싱영역으로 진입한 모돈의 행동패턴을 파악하는 센서부; 및상기 행동패턴을 기초로 발정기 또는 수정적기를 파악하는 수정적기파악부;를 포함하는 것을 특징으로 하는 모돈의 수정적기탐지장치."}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 관통홀을 개폐하는 개폐부의 개방 시간 또는 개방 횟수를 제어하는 제어부;를 더 포함하는 것을 특징으로하는 모돈의 수정적기탐지장치."}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 발정기 또는 수정적기로 파악된 모돈을 마킹하는 마킹부;를 더 포함하는 것을 특징으로 하는 모돈의 수정적기탐지장치."}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 행동패턴과 발정기(또는 수정적기)를 포함하는 학습데이터로 학습된 인공지능모델;을 더 포함하고,상기 수정적기파악부는 상기 인공지능모델에 상기 센서부가 파악한 행동패턴을 입력하여 발정기(또는 수정적기)를 파악하는 것을 특징으로 하는 모돈의 수정적기탐지장치."}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 발정기 또는 수정적기로 파악되면 기 정의된 사용자 단말로 알람을 제공하는 알람부;를 더 포함하는 것을특징으로 하는 모돈의 수정적기탐지장치."}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "웅돈구역과 모돈구역을 차단하는 벽에 형성된 소정 크기의 관통홀의 주변을 센서부의 센싱영역으로 설정하는 단계;상기 센서부를 통해 상기 센싱영역으로 진입한 모돈의 행동패턴을 파악하는 단계; 및상기 행동패턴을 기초로 발정기 또는 수정적기를 파악하는 단계;를 포함하는 것을 특징으로 하는 모돈의 수정적기 탐지 방법."}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서, 상기 발정기 또는 수정적기를 파악하는 단계는,행동패턴과 발정기(또는 수정적기)를 포함하는 학습데이터로 학습된 인공지능모델을 이용하여 상기 모돈의 발정기 또는 수정적기를 파악하는 단계;를 포함하는 것을 특징으로 하는 모돈의 수정적기 탐지 방법."}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2023-0117971-2-모돈의 수정적기탐지장치가 설치되는 수정적기검출구역 구조물에 있어서,차단벽으로 구분된 웅돈구역과 모돈구역;상기 차단벽의 일측에 형성된 적어도 하나 이상의 관통홀;상기 관통홀의 상부에 설치된 센서부; 및상기 관통홀을 개폐하는 개폐부;를 포함하는 것을 특징으로 하는 수정적기검출구역 구조물."}
{"patent_id": "10-2022-0014390", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,상기 웅돈구역은 벽으로 차단된 둘 이상의 공간으로 분리되고,상기 관통홀은 상기 둘 이상의 공간에 각각 설치되는 것을 특징으로 하는 수정적기검출구역 구조물."}
{"patent_id": "10-2022-0014390", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "모돈의 수정적기탐지장치 및 그 방법이 개시된다. 수정적기탐지장치는 웅돈구역과 모돈구역을 차단하는 벽에 형 성된 소정 크기의 관통홀의 주변을 센싱영역으로 설정하고, 상기 센싱영역으로 진입한 모돈의 행동패턴을 파악하 는 센서부와 행동패턴을 기초로 발정기 또는 수정적기를 파악하는 수정적기파악부를 포함한다."}
{"patent_id": "10-2022-0014390", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시 예는 모돈의 수정적기탐지장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0014390", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 모돈(암퇘지)은 젖을 뗀 후 4일에서 7일 사이에 발정이 오며, 발정이 올때 인공수정을 실시한다. 이 때, 산자수를 증가시키고 수태율을 높이기 위하여 모돈의 발정기를 정확히 탐지하고 수정적기에 인공수정을 시 키는 것이 번식산업인 양돈산업에서 가장 중요한 사육기술 중에 하나이다. 일반적으로 양돈산업에서는 숙련된 작업자가 하루에 2회 이상 웅돈(수퇘지)을 모돈에게 가까이하여 모돈의 반응 을 육안으로 관찰하여 발정여부를 확인하고 있다. 그러나 야간이나 심야시간에는 작업자가 관찰하는 것이 불가 능하므로 정확한 수정적기를 탐지하는 것이 불가능하고 이에 소정의 시간간격으로 2회 내지 4회 연속적으로 인 공수정을 반복 실시하고 있다. 이에 따라 상당한 노동력과 많은 정액비용이 소요되는 문제점이 존재한다. 또한 여러 번의 인공수정은 모돈의 생식기에 염증을 유발시켜 모돈 도태의 원인이 되는 문제점도 있다."}
{"patent_id": "10-2022-0014390", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시 예가 이루고자 하는 기술적 과제는, 웅돈과의 접촉을 통해 모돈의 발정기 또는 수정적기를 정확 하게 파악할 수 있는 장치 및 그 방법을 제공하는 데 있다."}
{"patent_id": "10-2022-0014390", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 달성하기 위한, 본 발명의 실시 예에 따른 모돈의 수정적기탐지장치의 일 예는, 웅돈구역 과 모돈구역을 차단하는 벽에 형성된 소정 크기의 관통홀의 주변을 센싱영역으로 설정하고, 상기 센싱영역으로 진입한 모돈의 행동패턴을 파악하는 센서부; 및 상기 행동패턴을 기초로 발정기 또는 수정적기를 파악하는 수정 적기파악부;를 포함한다. 상기의 기술적 과제를 달성하기 위한, 본 발명의 실시 예에 따른 모돈의 수정적기탐지방법의 일 예는, 웅돈구역 과 모돈구역을 차단하는 벽에 형성된 소정 크기의 관통홀의 주변을 센서부의 센싱영역으로 설정하는 단계; 상기 센서부를 통해 상기 센싱영역으로 진입한 모돈의 행동패턴을 파악하는 단계; 및 상기 행동패턴을 기초로 발정기 또는 수정적기를 파악하는 단계;를 포함한다. 상기의 기술적 과제를 달성하기 위한, 본 발명의 실시 예에 따른 수정적기검출구역 구조물의 일 예는, 모돈의 수정적기탐지장치가 설치되는 수정적기검출구역 구조물에 있어서, 벽으로 구분된 웅돈구역과 모돈구역; 상기 벽 의 일측에 형성된 적어도 하나 이상의 관통홀; 상기 관통홀의 상부에 설치된 센서부; 및 상기 관통홀을 개폐하 는 개폐부;를 포함한다."}
{"patent_id": "10-2022-0014390", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 모돈과 웅돈을 계속 접촉시키는 것이 아니라 일정 시간 또는 일정 횟수 접촉시켜 모돈의 발정기 또는 수정적기를 정확하게 파악할 수 있다. 또한 숙력된 작업자가 아닌 모돈의 행동패턴을 기반 으로 발정기 또는 수정적기를 자동으로 파악할 수 있다."}
{"patent_id": "10-2022-0014390", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면들을 참조하여 본 발명의 실시 예에 따른 모돈의 수정적기탐지장치 및 그 방법에 대해 상 세히 설명한다. 도 1 및 도 2는 본 발명의 실시 예에 따른 수정적기검출구역 구조물과 이에 설치된 수정적기탐지장치의 일 예를 도시한 도면이고, 도 3은 본 발명의 실시 예에 따른 수정적기검출구역 구조물의 관통홀과 개폐부의 일 예를 도 시한 도면이다. 도 1 내지 도 3을 함께 참조하면, 수정적기검출구역 구조물은 차단벽으로 분리된 모돈구역과 웅 돈구역을 포함한다. 모돈구역은 적어도 한 마리 이상의 모돈이 위치하는 영역이고, 웅돈구역 은 적어도 한 마리 이상의 웅돈이 위치하는 영역이다. 본 실시 예는 웅돈구역을 벽으로 차단하여 2개의 영역으로 구분하고 각 영역마다 한 마리의 웅돈이 위치하는 예를 도시하고 있으나, 이는 하나의 예일 뿐 웅돈구역을 하나의 영역으로 만들 수 있으며 또는 셋 이상의 복수 영역으로 구분할 수 있다. 다만 이하에서는 설명의 편의를 위하여 웅돈구역을 벽을 이용하여 두 개의 공간으로 구분되고 각 공간에 각각 한 마리씩의 웅돈이 위치하는 경우를 가정하여 설명 한다. 모돈구역과 웅돈구역을 구분하는 벽에는 관통홀이 존재한다. 관통홀은 모돈구역(10 2)의 모돈과 웅돈구역의 웅돈이 서로를 인지할 수 있도록 돼지의 키높이에 맞게 뚫어진 일정 크 기의 구멍이다. 웅돈과 모돈 사이가 서로 가까워질 때 모돈이 발정기인 경우와 발정기가 아닌 경우에 행동패턴이 달라지므로, 관통홀을 통해 웅돈과 모돈이 가까워질 때의 행동패턴을 파악하 여 발정기 또는 수정적기를 파악한다. 다른 실시 예로, 관통홀을 통해 웅돈과 모돈의 접촉이 빈번해져 서로 적응되는 경우 발정기 징 후의 파악이 어려을 수 있으므로 관통홀에는 개폐부가 존재할 수 있다. 관통홀은 개폐부 (140,145)에 의해 일정 시간 또는 일정 횟수 열려 있을 수 있다. 즉, 개폐제어부는 개폐부의 개방 시 간과 개방 횟수를 제어하여 모돈이 웅돈에게 적응되어 발정징후가 잘 나타나지 않는 문제점을 해결할 수 있다. 또 다른 실시 예로, 모돈이 웅돈에게 적응되는 문제점을 해결하는 방법으로 본 실시 예와 같이 웅돈 구역을 두 개의 영역으로 구분하고 각 영역에 웅돈을 위치시키는 방법이 있다. 관통홀은 웅돈구 역의 각 영역과 모돈구역 사이에 각각 존재한다. 예를 들어 웅돈구역의 제1 영역과 모돈구역 을 구분하는 벽 사이에 제1 관통홀이 존재하고, 웅돈구역의 제2 영역과 모돈구역을 구분하는 벽 사이에 제2 관통홀이 존재한다. 따라서 모돈은 제1 영역에 위치한 제1 웅돈 또는 제 영역에 위치한 제2 웅 돈에 가까이할 수 있어 특정 웅돈에게만 적응되는 문제점을 해결할 수 있다.모돈구역의 관통홀 주변에는 가이드부가 존재할 수 있다. 가이드부는 관통홀 주변에 일정 높이와 길이로 나란히 배치되어, 모돈이 관통홀에 접근할 때 모돈의 자세와 위치가 일정하도록 한다. 관통홀 주변에는 마킹부가 존재한다. 마킹부는 이후 살펴볼 수정적기탐지장치에 의해 모돈 이 발정기 또는 수정적기로 파악되면 관통홀에 진입한 모돈에게 페인트를 분사한다. 마킹부는 모돈 가까이에서 페인트를 분사할 수 있도록 노즐 등을 포함할 수 있다. 수정적기검출구역 구조물의 일측에는 수정적기탐지장치가 존재한다. 본 실시 예는 2개의 관통홀이 존 재하므로 각 관통홀마다 각각의 수정적기탐지장치가가 존재한다. 수정적기탐지장치는 웅돈구역 과 모돈구역을 차단하는 벽에 형성된 관통홀의 주변을 센싱영역으로 설정하고, 센싱영역으로 진입한 모돈의 행동패턴을 파악하는 센서부와, 행동패턴을 기초로 발정기 또는 수정적기를 파악하는 수정적기파악 부를 포함한다. 본 실시 예는 설명의 편의를 위하여 크게 수정적기검출구역 구조물과 수정적기탐지장치로 구분하여 설명하고 있으나, 수정적기검출구역 구조물의 구성 중 일부(예를 들어, 개폐제어부, 마킹부 등) 또는 전부는 수정적기탐지장치의 구성으로 포함되거나, 반대로 수정적기탐지장치의 구성 중 일부 또 는 전부는 수정적기검출구역 구조물의 구성으로 포함될 수 있다. 수정적기탐지장치의 구체적인 구성 에 대해서는 도 7에서 다시 살펴본다. 도 4는 본 발명의 실시 예에 따른 수정적기탐지장치의 센싱영역의 일 예를 도시한 도면이다. 도 4를 참조하면, 수정적기탐지장치는 관통홀 주변을 센싱영역으로 설정한다. 이를 위해 수정적 기탐지장치의 센서부는 관통홀 위쪽에 존재할 수 있다. 모돈의 발정징후의 정확한 파악을 위해 모돈이 웅돈과 접촉할 때 행동패턴을 파악할 수 있다. 이를 위해 센서부 의 센싱영역은 관통홀 주변의 모돈구역뿐만 아니라 웅돈구역을 함께 포함할 수 있다. 즉, 모돈의 행 동패턴을 파악할 때 관통홀 주변에 웅돈이 존재하는지 여부도 함께 파악할 수 있다. 센서부는 행동패턴 파악을 위하여 2차원 또는 3차원 이미지를 촬영하는 센서를 포함할 수 있다. 센서부는 센싱 영역에 진입한 모돈의 2차원 영상 또는 3차원 영상을 촬영하고, 촬영한 영상으로부터 발정기 또는 수 정적기를 파악하는데 필요한 행동패턴 정보를 추출한다. 예를 들어, 모돈이 발정기가 되면 웅돈을 접 촉시켰을 때 부동자세를 10분 내지 15분 지속하거나 귀를 쫑긋 세우는 것으로 알려져 있다. 또는 웅돈의 냄새 (웅취, 페로몬)로 인해 모돈과 웅돈이 주동이와 코를 접촉하는 빈도 및 시간이 평상시와 다를 수 있 다. 이 외에도 발정징후와 관련된 여러 가지 행동 패턴이 있을 수 있다. 센서부는 파악하여야 할 여러 행동패턴에 대한 정의를 미리 저장하고 있으며, 2차원 또는 3차원 영상을 통해 미 리 정의된 행동패턴에 대한 정보를 파악할 수 있다. 예를 들어, 센서부는 센싱영역에 위치한 모돈의 2차원 또는 3차원 영상으로부터 부동자세의 지속시간이나 귀의 형태 변화, 웅돈과 모돈의 주동이와 코의 접촉빈도와 시간 등의 정보를 모돈의 행동패턴 정보로 생성할 수 있다. 행동패턴 분석을 위하여 2차원 또는 3차원 영상을 분석하는 종래의 다양한 영상분석 알고리즘이 본 실시 예에 적용될 수 있다. 본 실시 예에서 설명한 발정징후와 관련된 행동패턴의 예는 이해를 돕기 위한 하나의 예일 뿐 이에 한정되는 것은 아니다. 도 5는 본 발명의 실시 예에 따른 수정적기탐지방법의 일 예를 도시한 흐름도이다. 도 1 및 도 5를 함께 참조하면, 수정적기검출구역 구조물에 설치된 수정적기탐지장치는 웅돈구역과 모돈구역을 차단하는 벽에 형성된 소정 크기의 관통홀의 주변을 센싱영역으로 설정한다(S500). 수정적기탐지장치는 관통홀에 모돈과 웅돈이 접근하면 2차원 또는 3차원 센서를 통해 모돈의 행동패 턴을 파악한다(S510). 일 예로, 수정적기탐지장치는 관통홀에 모돈만 접근하고 웅돈이 접근하지 않았 다면 행동패턴을 파악하지 않고, 관통홀에 모돈과 웅돈이 모두 접근하면 모돈에 대한 행동패턴을 파악할 수 있다. 웅돈이 관통홀에 접근하였는지 파악하기 위하여, 모돈구역의 센싱영역과 웅돈구역의 센싱영역을 각각 측정하는 복수의 센서를 포함하거나 하나의 센서를 통해 두 구역을 모두 포함하는 영역을 촬영 또는 측정 하여 모돈의 행동패턴 파악과 웅돈의 접근 여부를 동시에 파악할 수 있다. 물론 다른 예로, 수정적기탐지장치 는 관통홀에 웅돈의 접근과 관계없이 모돈이 관통홀에 접근하면 모돈의 행동패턴을 파악할 수 있다. 수정적기탐지장치는 센서부를 통해 파악된 모돈의 행동패턴을 기초로 모돈의 발정기 또는 수정적기를 파악 한다(S520). 일 실시 예로, 수정적기탐지장치는 행동패턴의 정보와 기 정의된 조건을 비교하여 발정기 또 는 수정적기 여부를 파악할 수 있다. 예를 들어, 수정적기탐지장치는 행동패턴의 정보로 모돈의 부동자세 의 지속시간과 귀의 형태를 파악하는 경우에, 부동자세의 지속시간이 10분 이상이고, 귀의 형태가 쫑긋하게 세 워진 형태이면 모돈이 발정기 또는 수정적기라고 판단할 수 있다. 행동패턴의 정보의 종류와 개수에 따라 발정 기 또는 수정적기 파악을 위한 다양한 조건이 미리 정의될 수 있다. 다른 실시 예로, 수정적기탐지장치는 기 정의된 수정적기파악모델을 이용하여 수정적기를 파악할 수 있다. 예를 들어, 수정적기파악모델은 인공지능 모델을 이용하여 생성된 모델일 수 있다. 인공지능모델을 이용한 수정적기 파악에 대해서는 도 6에서 다시 살펴 본다. 도 6은 본 발명의 실시 예에 따른 인공지능모델을 이용한 수정적기 파악 방법의 일 예를 도시한 도면이다. 도 6을 참조하면, 인공지능모델은 행동패턴과 발정기(또는 수정적기) 여부에 대한 정보를 포함하는 학습데 이터를 이용하여 학습된 모델이다. 학습데이터는 부동자세의 지속시간이나 귀의 형태, 웅돈과 모돈의 주동이의 접촉시간이나 횟수 등을 포함하는 행동패턴 정보와, 각 행동패턴과 맵핑된 발정기(또는 수정적기) 여 부에 대한 정보(ground truth)를 포함한다. 인공지능모델은 학습데이터의 행동패턴을 입력받으면 발정기(또는 수정적기) 여부에 대한 예측값 을 출력하고, 그 예측값과 학습데이터의 발정기(또는 수정적기) 여부에 대한 정보를 비교하여 내부 파라메터 등을 조정하는 학습 과정을 통해 생성될 수 있다. 수정적기탐지장치는 학습 완료된 인공지 능모델에 센서부를 통해 파악된 행동패턴을 입력하여 발정기(또는 수정적기) 여부를 파악할 수 있다. 도 7은 본 발명의 실시 예에 따른 수정적기탐지장치의 일 예의 구성을 도시한 도면이다. 도 7을 참조하면, 수정적기탐지장치는 센서부, 수정적기파악부, 제어부, 마킹부 및 알람부를 포함한다. 수정적기탐지장치는 메모리, 프로세서, 입출력장치를 포함하는 컴퓨팅 장치를 이 용하여 구현할 수 있다. 실시 예에 따라 구성의 일부(예를 들어, 마킹부, 알람부 등)를 생략하거나 다른 구성을 추가하여 구현할 수 있다. 센서부는 웅돈구역과 모돈구역을 차단하는 벽에 형성된 소정 크기의 관통홀의 주변을 센싱영역으로 설정하 고, 센싱영역으로 진입한 모돈의 행동패턴을 파악한다. 관통홀 주변을 센싱영역을 설정한 예가 도 4에 도시되어 있다. 센서부는 웅돈의 움직임이나 자세 등을 파악할 수 있는 각종 센서를 포함할 수 있다. 예를 들어, 센 서부는 2차원 또는 3차원 이미지를 촬영하는 센서 또는 움직임 감지 센서, 적외선 촬영 센서 등 실시 예에 따라 다양한 센서를 포함할 수 있다. 수정적기파악부는 센서부가 파악한 모돈의 행동패턴을 기초로 발정기 또는 수정적기 여부를 파악한다. 수정적기파악부는 행동패턴에 포함된 각 정보가 기 정의된 조건을 만족하는지 여부에 따라 발정 기 여부를 파악하거나 도 6과 같이 인공지능모델을 이용하여 발정기 여부를 파악할 수 있다. 제어부는 관통홀에 존재하는 개폐부의 개폐 여부를 제어한다. 제어부는 도 1의 개폐제어부로 구 현될 수 있으며, 기 정의된 주기마다 일정 시간 동안 관통홀을 개방시킬 수 있다. 예를 들어, 도 1과 같이 웅돈 구역이 복수이 구역으로 구분되고, 관통홀이 복수 개 존재하는 경우에, 제어부는 각 관통홀의 개방시 간을 동일하게 하거나 서로 다르게 제어할 수 있다. 마킹부는 수정적기파악부에 의해 모돈이 발정기 또는 수정적기로 파악되면 해당 모돈에게 페인트를 분사한다. 일 예로, 마킹부는 도 1의 마킹부로 구현될 수 있다. 다른 실시 예로, 센서부가 2차 원 또는 3차원 영상을 통해 모돈에 페인트가 존재하는지 파악하고, 마킹부는 모돈에 페인트가 존재하지 않 으면 발정기 또는 수정적기로 파악된 모돈에게 페인트를 분사할 수 있다. 즉, 발정기 또는 수정적기로 파악되어 페인트가 이미 분사된 모돈에게 다시 페인트를 분사하는 것을 방지할 수 있다. 알람부는 수정적기파악부에 의해 모돈이 발정기 또는 수정적기로 파악되면 기 등록된 사용자 단말로 메시지 등의 알람을 전송할 수 있다. 사용자는 메시지를 전송받은 후 모돈구역으로 방문하면 되고, 페인트가 마 킹된 모돈이 발정기 또는 수정적기임을 용이하게 파악할 수 있다. 본 발명의 각 실시 예는 또한 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것 이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모 든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, SSD, 광데이터 저장장치 등이 있다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이제까지 본 발명에 대하여 그 바람직한 실시 예들을 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현 될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시 예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내 에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0014390", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 도 2는 본 발명의 실시 예에 따른 수정적기검출구역 구조물과 이에 설치된 수정적기탐지장치의 일 예를 도시한 도면, 도 3은 본 발명의 실시 예에 따른 수정적기검출구역 구조물의 관통홀과 개폐부의 일 예를 도시한 도면, 도 4는 본 발명의 실시 예에 따른 수정적기탐지장치의 센싱영역의 일 예를 도시한 도면, 도 5는 본 발명의 실시 예에 따른 수정적기탐지방법의 일 예를 도시한 흐름도, 도 6은 본 발명의 실시 예에 따른 인공지능모델을 이용한 수정적기 파악 방법의 일 예를 도시한 도면, 도 7은 본 발명의 실시 예에 따른 수정적기탐지장치의 일 예의 구성을 도시한 도면이다."}
