{"patent_id": "10-2019-0087936", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0096849", "출원번호": "10-2019-0087936", "발명의 명칭": "빌딩 관리 로봇 및 그를 이용한 서비스 제공 방법", "출원인": "엘지전자 주식회사", "발명자": "김형국"}}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "빌딩 내의 적어도 하나의 구획 공간 중 제1 구획 공간에 대응하는 식별 장치를 인식하고, 상기 식별 장치로부터상기 제1 구획 공간에 대한 제1 식별 정보를 획득하는 통신부;상기 식별 장치가 인식된 위치를 포함하는 이미지 데이터를 획득하는 카메라; 및상기 이미지 데이터로부터 사용자를 인식하고,데이터베이스로부터, 상기 인식된 사용자의 상기 제1 구획 공간에 대한 인증 레벨을 확인하고,확인된 인증 레벨에 기초한 서비스를 상기 사용자에게 제공하는 프로세서를 포함하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 통신부는,상기 빌딩 관리 로봇 내에 서로 이격 배치된 적어도 두 개의 무선 통신 모듈을 포함하고,상기 프로세서는,상기 식별 장치로부터 상기 적어도 두 개의 무선 통신 모듈 각각으로 수신되는 신호의 세기 또는 시간 차에 기초하여 상기 식별 장치의 위치 또는 방향을 감지하고,감지된 위치 또는 방향을 향하도록 주행부 또는 카메라 방향 조절 기구를 제어하고,상기 이미지 데이터를 획득하도록 상기 카메라를 제어하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는,상기 이미지 데이터로부터 상기 사용자를 포함하는 영역을 추출하고,추출된 영역으로부터 상기 사용자의 이미지 특징 데이터를 획득하고,상기 데이터베이스로부터 상기 이미지 특징 데이터 및 상기 제1 구획 공간의 제1 식별 정보를 갖는 레코드에 포함된 상기 인증 레벨을 획득하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,러닝 프로세서에 의해 학습된 인식 모델을 저장하는 메모리를 더 포함하고,상기 프로세서는,상기 메모리에 저장된 상기 인식 모델을 통해, 상기 이미지 데이터로부터 상기 사용자를 인식하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,공개특허 10-2019-0096849-3-상기 인증 레벨이 기준 레벨 미만인 경우,상기 제1 구획 공간의 관리 장치로 방문자 알림을 전송하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 프로세서는,상기 인증 레벨이 상기 기준 레벨 이상인 경우,상기 빌딩의 출입구 개방 요청을 출입구 관리 장치로 전송하거나, 상기 빌딩의 엘리베이터 관리 장치로 엘리베이터 호출 요청을 전송하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는,상기 데이터베이스에 상기 제1 구획 공간과 매칭되는 상기 사용자의 정보가 존재하지 않는 경우, 상기 이미지데이터로부터 획득되는 상기 사용자의 특징 데이터와 상기 제1 구획 공간에 대한 제1 식별 정보, 및 상기 인증레벨을 포함하는 제1 레코드를 상기 데이터베이스에 저장하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 제1 식별 정보 및 상기 사용자의 특징 데이터가 획득되는 횟수가 소정 횟수 이상인 경우, 상기 제1 레코드에 포함된 상기 인증 레벨을 증가시키는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는,상기 적어도 하나의 구획 공간 중 제2 구획 공간으로 이동하기 위한 엘리베이터 탑승 상황을 인식하고,엘리베이터 관리 장치 또는 서버로부터, 엘리베이터의 내부를 포함하는 제1 영상 데이터를 수신하고,수신된 제1 영상 데이터로부터 상기 엘리베이터 내에 탑승자의 존재 여부를 감지하고,탑승자가 존재하지 않는 경우 상기 엘리베이터의 호출 요청을 상기 엘리베이터 관리 장치 또는 상기 서버로 전송하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는,상기 엘리베이터 관리 장치 또는 서버로부터, 상기 빌딩 내의 적어도 하나의 층 각각의 엘리베이터 탑승 영역을포함하는 적어도 하나의 제2 영상 데이터를 수신하고,수신된 적어도 하나의 제2 영상 데이터로부터 상기 엘리베이터의 이용 대기자 존재 여부를 감지하고,상기 이용 대기자가 존재하지 않는 경우 상기 엘리베이터의 호출 요청을 상기 엘리베이터 관리 장치 또는 상기서버로 전송하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2019-0096849-4-제1항에 있어서,상기 프로세서는,상기 제1 식별 정보에 기초하여 엘리베이터의 호출 요청을 엘리베이터 관리 장치 또는 서버로 전송하고,상기 사용자의 특성에 기초하여 상기 엘리베이터의 동승 여부를 결정하고,상기 사용자의 특성은 성별, 연령대, 장애 여부, 및 거동 불편 여부 중 적어도 하나의 정보를 포함하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 프로세서는,상기 사용자와 상기 엘리베이터에 동승한 경우, 상기 사용자의 하차 시 함께 하차하도록 주행부를 제어하고,상기 사용자를 포함하는 영상 데이터를 획득하도록 상기 카메라를 제어하는 제1 동작, 및 상기 사용자의 이동을따라 주행하도록 상기 주행부를 제어하는 제2 동작 중 적어도 하나를 수행하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 프로세서는,상기 엘리베이터 관리 장치 또는 상기 서버로부터 상기 엘리베이터의 내부를 포함하는 영상 데이터를 수신하고,수신된 영상 데이터로부터 상기 엘리베이터 내부의 타인을 식별하고,상기 타인의 식별 결과에 기초하여 상기 엘리베이터의 동승 여부를 결정하는 빌딩 관리 로봇."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "빌딩 내의 적어도 하나의 구획 공간 중 제1 구획 공간에 대응하는 식별 장치를 인식하는 단계;상기 식별 장치가 인식된 위치를 포함하는 이미지 데이터를 획득하는 단계;획득된 이미지 데이터로부터 사용자를 인식하는 단계;데이터베이스로부터, 상기 인식된 사용자의 제1 구획 공간에 대한 인증 레벨을 확인하는 단계; 및확인된 인증 레벨에 기초한 서비스를 상기 사용자에게 제공하는 단계를 포함하는 빌딩 관리 로봇을 이용한 서비스 제공 방법."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 인증 레벨이 기준 레벨 이상인 경우, 상기 서비스를 상기 사용자에게 제공하는 단계는,상기 빌딩의 출입구 개방 요청을 출입구 관리 장치로 전송하는 단계; 및상기 빌딩의 엘리베이터 관리 장치로 엘리베이터 호출 요청을 전송하는 단계 중 적어도 하나를 포함하는 빌딩관리 로봇을 이용한 서비스 제공 방법."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 데이터베이스에 상기 제1 구획 공간과 매칭되는 상기 사용자의 정보가 존재하지 않는 경우, 상기 이미지데이터로부터 획득되는 상기 사용자의 특징 데이터와 상기 제1 식별 정보, 및 상기 인증 레벨을 포함하는 제1레코드를 상기 데이터베이스에 추가하는 단계를 더 포함하는 빌딩 관리 로봇을 이용한 서비스 제공 방법.공개특허 10-2019-0096849-5-청구항 17 제16항에 있어서,상기 제1 식별 정보 및 상기 사용자의 특징 데이터가 획득되는 횟수가 소정 횟수 이상인 경우, 상기 인증 레벨을 증가시키는 단계를 더 포함하는 빌딩 관리 로봇을 이용한 서비스 제공 방법."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제14항에 있어서,상기 제1 식별 정보에 기초하여 엘리베이터를 상기 빌딩 관리 로봇이 위치한 층으로 호출하는 단계; 및상기 사용자의 특성에 기초하여, 상기 빌딩 관리 로봇의 엘리베이터 동승 여부를 결정하는 단계를 더 포함하고,상기 사용자의 특성은 성별, 연령대, 장애 여부, 및 거동 불편 여부 중 적어도 하나의 정보를 포함하는 빌딩 관리 로봇을 이용한 서비스 제공 방법."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 빌딩 관리 로봇이 상기 사용자와 상기 엘리베이터에 동승한 경우, 상기 사용자의 하차 시 상기 빌딩 관리로봇이 함께 하차하도록 제어하는 단계; 및상기 빌딩 관리 로봇이, 상기 사용자를 포함하는 영상 데이터를 획득하는 동작, 및 상기 사용자의 이동을 따라주행하는 동작 중 적어도 하나의 동작을 수행하는 단계를 더 포함하는 빌딩 관리 로봇을 이용한 서비스 제공 방법."}
{"patent_id": "10-2019-0087936", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서,상기 엘리베이터의 내부를 포함하는 영상 데이터로부터, 상기 엘리베이터의 내부에 존재하는 타인을 식별하는단계; 및상기 타인의 식별 결과에 기초하여, 상기 사용자의 탑승 시 상기 빌딩 관리 로봇의 동승 여부를 결정하는 단계를 더 포함하는 빌딩 관리 로봇을 이용한 서비스 제공 방법."}
{"patent_id": "10-2019-0087936", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 빌딩 관리 로봇은, 빌딩 내의 적어도 하나의 구획 공간 중 제1 구획 공간에 대응하는 식별 장치를 인식하고, 상기 식별 장치로부터 상기 제1 구획 공간에 대한 제1 식별 정보를 획득하는 통신부, 상 기 식별 장치가 인식된 위치를 포함하는 이미지 데이터를 획득하는 카메라, 및 상기 이미지 데이터로부터 사용자 를 인식하고, 데이터베이스로부터, 상기 인식된 사용자의 상기 제1 구획 공간에 대한 인증 레벨을 확인하고, 확 인된 인증 레벨에 기초한 서비스를 상기 사용자에게 제공하는 프로세서를 포함한다. 실시 예에 따라, 상기 빌딩 관리 로봇은 인공지능 기반의 학습 모델을 통해 상기 이미지 데이터로부터 상기 사용자를 인식할 수 있다."}
{"patent_id": "10-2019-0087936", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 빌딩 관리 로봇에 관한 것으로서, 특히 빌딩에 거주 또는 빌딩을 이용하는 사람들에게 다양한 서비스 를 제공할 수 있는 빌딩 관리 로봇에 관한 것이다."}
{"patent_id": "10-2019-0087936", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계로서, 로봇의 응용분야는 대 체로 산업용, 의료용, 우주용, 해저용 등 다양한 분야로 분류된다. 최근에는 자율 주행 기술이나 센서를 이용한 자동 제어 기술, 통신 기술 등의 발전으로 인해, 보다 다양한 분야 에 로봇을 적용하기 위한 연구가 지속되고 있다. 일례로, 아파트, 오피스텔, 호텔, 업무용 빌딩 등의 빌딩에 배치되어, 상기 빌딩과 관련된 다양한 관리 동작을 수행하는 빌딩 관리 로봇이 고려될 수 있다. 예컨대, 빌딩 관리 로봇은 빌딩 내/외부를 주행하면서, 경비 동작, 경비원 보조, 주차장 관리, 청소 동작 등을 수행할 수 있다. 또는, 빌딩 관리 로봇은 아파트의 각 세대에 대한 방문 서비스를 제공하거나 택배나 우편 등의 물품을 전달하는 등의 다양한 서비스를 제공할 수 있다. 한편, 빌딩 관리 로봇이 배치되는 빌딩에는 다양한 사람들이 존재할 수 있다. 이러한 사람들 중에는 빌딩 내 특 정 구획 공간(아파트 동/호수, 호텔 객실 등)에 대한 이용 권한을 갖는 사람과, 일회성 방문자와 같이 이용 권 한이 없는 사람이 혼재될 수 있다. 이러한 다양한 사람들에 대해, 효과적인 관리 및 맞춤형 서비스를 제공할 수 있는 빌딩 관리 로봇이 구현될 경우, 상기 빌딩 관리 로봇의 보급이 확대될 수 있다."}
{"patent_id": "10-2019-0087936", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 빌딩을 이용하는 다양한 사람들을 인식 및 인증하고, 인증 결과에 따른 다 양한 맞춤형 서비스를 제공할 수 있는 빌딩 관리 로봇 및 그를 이용한 서비스 제공 방법을 구현하는 것이다. 본 발명의 해결하고자 하는 다른 과제는, 빌딩 내에 구비된 엘리베이터의 탑승 시 이용자의 불편을 최소화하거 나, 이용자에 대한 효과적인 보호를 가능하게 하는 빌딩 관리 로봇 및 그를 이용한 서비스 제공 방법을 구현하 는 것이다."}
{"patent_id": "10-2019-0087936", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 빌딩 관리 로봇은, 빌딩 내의 적어도 하나의 구획 공간 중 제1 구획 공간에 대응하는 식별 장치를 인식하고, 상기 식별 장치로부터 상기 제1 구획 공간에 대한 제1 식별 정보를 획득하는 통신부, 상 기 식별 장치가 인식된 위치를 포함하는 이미지 데이터를 획득하는 카메라, 및 상기 이미지 데이터로부터 사용 자를 인식하고, 데이터베이스로부터, 상기 인식된 사용자의 상기 제1 구획 공간에 대한 인증 레벨을 확인하고, 확인된 인증 레벨에 기초한 서비스를 상기 사용자에게 제공하는 프로세서를 포함한다. 실시 예에 따라, 상기 통신부는 상기 빌딩 관리 로봇 내에 서로 이격 배치된 적어도 두 개의 무선 통신 모듈을 포함하고, 상기 프로세서는, 상기 식별 장치로부터 상기 적어도 두 개의 무선 통신 모듈 각각으로 수신되는 신 호의 세기 또는 시간 차에 기초하여 상기 식별 장치의 위치 또는 방향을 감지하고, 감지된 위치 또는 방향을 향 하도록 주행부 또는 카메라 방향 조절 기구를 제어하고, 상기 이미지 데이터를 획득하도록 상기 카메라를 제어 할 수 있다. 상기 프로세서는, 상기 이미지 데이터로부터 상기 사용자를 포함하는 영역을 추출하고, 추출된 영역으로부터 상 기 사용자의 이미지 특징 데이터를 획득하고, 상기 데이터베이스로부터 상기 이미지 특징 데이터 및 상기 제1 구획 공간의 제1 식별 정보를 갖는 레코드에 포함된 상기 인증 레벨을 획득할 수 있다. 실시 예에 따라, 상기 빌딩 관리 로봇은 러닝 프로세서에 의해 학습된 인식 모델을 저장하는 메모리를 더 포함 하고, 상기 프로세서는, 상기 메모리에 저장된 상기 인식 모델을 통해, 상기 이미지 데이터로부터 상기 사용자 를 인식할 수 있다. 실시 예에 따라, 상기 프로세서는, 상기 인증 레벨이 기준 레벨 미만인 경우, 상기 제1 구획 공간의 관리 장치 로 방문자 알림을 전송할 수 있다. 실시 예에 따라, 상기 프로세서는, 상기 인증 레벨이 상기 기준 레벨 이상인 경우, 상기 빌딩의 출입구 개방 요 청을 출입구 관리 장치로 전송하거나, 상기 빌딩의 엘리베이터 관리 장치로 엘리베이터 호출 요청을 전송할 수 있다. 상기 프로세서는, 상기 데이터베이스에 상기 제1 구획 공간과 매칭되는 상기 사용자의 정보가 존재하지 않는 경 우, 상기 이미지 데이터로부터 획득되는 상기 사용자의 특징 데이터와 상기 제1 구획 공간에 대한 제1 식별 정 보, 및 상기 인증 레벨을 포함하는 제1 레코드를 상기 데이터베이스에 저장할 수 있다. 상기 프로세서는, 상기 제1 식별 정보 및 상기 사용자의 특징 데이터가 획득되는 횟수가 소정 횟수 이상인 경우, 상기 제1 레코드에 포함된 상기 인증 레벨을 증가시킬 수 있다. 상기 프로세서는, 상기 적어도 하나의 구획 공간 중 제2 구획 공간으로 이동하기 위한 엘리베이터 탑승 상황을 인식하고, 엘리베이터 관리 장치 또는 서버로부터, 엘리베이터의 내부를 포함하는 제1 영상 데이터를 수신하고, 수신된 제1 영상 데이터로부터 상기 엘리베이터 내에 탑승자의 존재 여부를 감지하고, 탑승자가 존재하지 않는 경우 상기 엘리베이터의 호출 요청을 상기 엘리베이터 관리 장치 또는 상기 서버로 전송할 수 있다. 상기 프로세서는, 상기 엘리베이터 관리 장치 또는 서버로부터, 상기 빌딩 내의 적어도 하나의 층 각각의 엘리 베이터 탑승 영역을 포함하는 적어도 하나의 제2 영상 데이터를 수신하고, 수신된 적어도 하나의 제2 영상 데이터로부터 상기 엘리베이터의 이용 대기자 존재 여부를 감지하고, 상기 이용 대기자가 존재하지 않는 경우 상기 엘리베이터의 호출 요청을 상기 엘리베이터 관리 장치 또는 상기 서버로 전송할 수 있다. 상기 프로세서는, 상기 제1 식별 정보에 기초하여 엘리베이터의 호출 요청을 엘리베이터 관리 장치 또는 서버로 전송하고, 상기 사용자의 특성에 기초하여 상기 엘리베이터의 동승 여부를 결정하고, 상기 사용자의 특성은 성 별, 연령대, 장애 여부, 및 거동 불편 여부 중 적어도 하나의 정보를 포함할 수 있다. 상기 프로세서는, 상기 사용자와 상기 엘리베이터에 동승한 경우, 상기 사용자의 하차 시 함께 하차하도록 주행 부를 제어하고, 상기 사용자를 포함하는 영상 데이터를 획득하도록 상기 카메라를 제어하는 제1 동작, 및 상기 사용자의 이동을 따라 주행하도록 상기 주행부를 제어하는 제2 동작 중 적어도 하나를 수행할 수 있다. 실시 예에 따라, 상기 프로세서는 상기 엘리베이터 관리 장치 또는 상기 서버로부터 상기 엘리베이터의 내부를 포함하는 영상 데이터를 수신하고, 수신된 영상 데이터로부터 상기 엘리베이터 내부의 타인을 식별하고, 상기 타인의 식별 결과에 기초하여 상기 엘리베이터의 동승 여부를 결정할 수 있다. 본 발명의 일 실시 예에 따른 빌딩 관리 로봇을 이용한 서비스 제공 방법은, 빌딩 내의 적어도 하나의 구획 공 간 중 제1 구획 공간에 대응하는 식별 장치를 인식하는 단계; 상기 식별 장치가 인식된 위치를 포함하는 이미지 데이터를 획득하는 단계; 획득된 이미지 데이터로부터 사용자를 인식하는 단계; 데이터베이스로부터, 상기 인식 된 사용자의 제1 구획 공간에 대한 인증 레벨을 확인하는 단계; 및 확인된 인증 레벨에 기초한 서비스를 상기 사용자에게 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2019-0087936", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 빌딩 관리 로봇은 빌딩 내/외부에서 인식되는 사람들을 빌딩 내의 구획 공간들 각 각에 매칭시켜 효율적으로 관리할 수 있다. 또한, 빌딩 관리 로봇은 특정 구획 공간에 대해, 매칭된 사람들 각 각의 인증 레벨을 설정함으로써, 특정 구획 공간의 출입 또는 이용 권한을 갖는 사람과 그렇지 않은 사람을 효 과적으로 구분하여 관리할 수 있다. 또한, 빌딩 관리 로봇은 인식된 사람들 각각의 인증 레벨에 기초하여 서로 다른 서비스를 제공함으로써, 사람들 에게 다양한 맞춤형 서비스를 자동으로 제공할 수 있다. 뿐만 아니라, 빌딩 관리 로봇은 엘리베이터의 탑승 상황 시, 엘리베이터의 이용자 또는 이용 대기자가 감지되지 않는 경우에만 엘리베이터를 이용함으로써 이용자 또는 이용 대기자에 대한 방해나 불편을 최소화할 수 있다. 또한, 빌딩 관리 로봇은 엘리베이터 이용자의 특성, 또는 엘리베이터에 존재하는 타인의 식별 결과에 기초하여 상기 이용자와 엘리베이터에 동승하고, 이용자를 모니터링하거나 에스코트하는 등의 서비스를 제공할 수 있다. 이에 따라, 빌딩 관리 로봇은 이용자의 안전한 엘리베이터 이용을 가능하게 하고, 이용자는 빌딩 관리 로봇에 대한 만족감을 느낄 수 있다."}
{"patent_id": "10-2019-0087936", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명한다. 첨부된 도면은 본 명세서에 개 시된 실시 예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사 상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 로봇은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계를 의미할 수 있다. 특히, 환경을 인식하고 스스로 판단하여 동작을 수행하는 기능을 갖는 로봇을 지능형 로봇이라 칭할 수 있다. 로봇은 사용 목적이나 분야에 따라 산업용, 의료용, 가정용, 군사용 등으로 분류할 수 있다. 로봇은 액츄에이터 또는 모터를 포함하는 구동부를 구비하여 로봇 관절을 움직이는 등의 다양한 물리적 동작을 수행할 수 있다. 또한, 이동 가능한 로봇은 구동부에 휠, 브레이크, 프로펠러 등이 포함되어, 구동부를 통해 지 상에서 주행하거나 공중에서 비행할 수 있다. 인공 지능은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구하는 분야를 의미하며, 머신 러닝(기계 학습, Machine Learning)은 인공 지능 분야에서 다루는 다양한 문제를 정의하고 그것을 해결하는 방법론을 연구하는 분야를 의미한다. 머신 러닝은 어떠한 작업에 대하여 꾸준한 경험을 통해 그 작업에 대한 성능을 높이는 알고리 즘으로 정의하기도 한다. 인공 신경망(ANN: Artificial Neural Network)은 머신 러닝에서 사용되는 모델로써, 시냅스의 결합으로 네트워 크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경 망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 인공 신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)를 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공 신경망은 뉴런과 뉴런을 연결하는 시냅 스를 포함할 수 있다. 인공 신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함숫값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함된 다. 그리고, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터를 의미하며, 학습 률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공 신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수 는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning)으로 분류할 수 있다. 지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공 신경망을 학습시키 는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화 하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 인공 신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신 러닝 을 딥 러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥 러닝은 머신 러닝의 일부이다. 이하에서, 머신 러닝은 딥 러닝을 포함하는 의미로 사용된다. 자율 주행은 스스로 주행하는 기술을 의미하며, 자율 주행 차량은 사용자의 조작 없이 또는 사용자의 최소한의 조작으로 주행하는 차량(Vehicle)을 의미한다. 예컨대, 자율 주행에는 주행중인 차선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절 하는 기술, 정해진 경로를 따라 자동으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하 는 기술 등이 모두 포함될 수 있다. 차량은 내연 기관만을 구비하는 차량, 내연 기관과 전기 모터를 함께 구비하는 하이브리드 차량, 그리고 전기 모터만을 구비하는 전기 차량을 모두 포괄하며, 자동차뿐만 아니라 기차, 오토바이 등을 포함할 수 있다. 이때, 자율 주행 차량은 자율 주행 기능을 가진 로봇으로 볼 수 있다. 도 1은 본 발명의 일 실시 예에 따른 로봇을 포함하는 AI 장치를 나타낸다. AI 장치는 TV, 프로젝터, 휴대폰, 스마트폰, 데스크탑 컴퓨터, 노트북, 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 태블릿 PC, 웨어러블 장치, 셋톱박스(STB), DMB 수신기, 라디오, 세탁기, 냉장고, 데스크탑 컴퓨터, 디지털 사이니지, 로봇, 차량 등 과 같은, 고정형 기기 또는 이동 가능한 기기 등으로 구현될 수 있다. 도 1을 참조하면, AI 장치는 통신부, 입력부, 러닝 프로세서, 센싱부, 출력부, 메모리 및 프로세서 등을 포함할 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 AI 장치(100a 내지 100e)나 AI 서버 등의 외부 장치들과 데이터를 송수신할 수 있다. 예컨대, 통신부는 외부 장치들과 센서 정보, 사용자 입력, 학습 모델, 제어 신호 등을 송수신할 수 있다. 이때, 통신부가 이용하는 통신 기술에는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), LTE(Long Term Evolution), 5G, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), 블 루투스(Bluetooth쪠), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), ZigBee, NFC(Near Field Communication) 등이 있다. 입력부는 다양한 종류의 데이터를 획득할 수 있다. 이때, 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰, 사용자로부터 정보를 입력 받기 위한 사용자 입력부 등을 포함할 수 있다. 여기서, 카메라나 마이크로폰을 센서로 취급하여, 카메라나 마이크로폰으로부터 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 입력부는 모델 학습을 위한 학습 데이터 및 학습 모델을 이용하여 출력을 획득할 때 사용될 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 프로세서 또는 러닝 프로세서는 입력 데이터에 대하여 전처리로써 입력 특징점(input feature)을 추출할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망으로 구성된 모델을 학습시킬 수 있다. 여기서, 학습 된 인공 신경망을 학습 모델이라 칭할 수 있다. 학습 모델은 학습 데이터가 아닌 새로운 입력 데이터에 대하여 결과 값을 추론해 내는데 사용될 수 있고, 추론된 값은 어떠한 동작을 수행하기 위한 판단의 기초로 이용될 수 있다. 이때, 러닝 프로세서는 AI 서버의 러닝 프로세서과 함께 AI 프로세싱을 수행할 수 있다. 이때, 러닝 프로세서는 AI 장치에 통합되거나 구현된 메모리를 포함할 수 있다. 또는, 러닝 프로세서 는 메모리, AI 장치에 직접 결합된 외부 메모리 또는 외부 장치에서 유지되는 메모리를 사용하 여 구현될 수도 있다. 센싱부는 다양한 센서들을 이용하여 AI 장치 내부 정보, AI 장치의 주변 환경 정보 및 사용자 정보 중 적어도 하나를 획득할 수 있다. 이때, 센싱부에 포함되는 센서에는 근접 센서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센 서, RGB 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰, 라이다, 레이더 등이 있다.출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있다. 이때, 출력부에는 시각 정보를 출력하는 디스플레이부, 청각 정보를 출력하는 스피커, 촉각 정보를 출력하 는 햅틱 모듈 등이 포함될 수 있다. 메모리는 AI 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예컨대, 메모리는 입력 부에서 획득한 입력 데이터, 학습 데이터, 학습 모델, 학습 히스토리 등을 저장할 수 있다. 프로세서는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 사용하여 결정되거나 생성된 정보에 기초하 여, AI 장치의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 프로세서는 AI 장치(10 0)의 구성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 이를 위해, 프로세서는 러닝 프로세서 또는 메모리의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 상기 적어도 하나의 실행 가능한 동작 중 예측되는 동작이나, 바람직한 것으로 판단되는 동작을 실행 하도록 AI 장치의 구성 요소들을 제어할 수 있다. 이때, 프로세서는 결정된 동작을 수행하기 위하여 외부 장치의 연계가 필요한 경우, 해당 외부 장치를 제 어하기 위한 제어 신호를 생성하고, 생성한 제어 신호를 해당 외부 장치에 전송할 수 있다. 프로세서는 사용자 입력에 대하여 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 사용자의 요구 사 항을 결정할 수 있다. 이때, 프로세서는 음성 입력을 문자열로 변환하기 위한 STT(Speech To Text) 엔진 또는 자연어의 의도 정 보를 획득하기 위한 자연어 처리(NLP: Natural Language Processing) 엔진 중에서 적어도 하나 이상을 이용하여, 사용자 입력에 상응하는 의도 정보를 획득할 수 있다. 이때, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 적어도 일부가 머신 러닝 알고리즘에 따라 학습된 인 공 신경망으로 구성될 수 있다. 그리고, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 러닝 프로세서 에 의해 학습된 것이나, AI 서버의 러닝 프로세서에 의해 학습된 것이거나, 또는 이들의 분산 처리에 의해 학습된 것일 수 있다. 프로세서는 AI 장치의 동작 내용이나 동작에 대한 사용자의 피드백 등을 포함하는 이력 정보를 수집 하여 메모리 또는 러닝 프로세서에 저장하거나, AI 서버 등의 외부 장치에 전송할 수 있다. 수 집된 이력 정보는 학습 모델을 갱신하는데 이용될 수 있다. 프로세서는 메모리에 저장된 응용 프로그램을 구동하기 위하여, AI 장치의 구성 요소들 중 적어 도 일부를 제어할 수 있다. 나아가, 프로세서는 상기 응용 프로그램의 구동을 위하여, AI 장치에 포 함된 구성 요소들 중 둘 이상을 서로 조합하여 동작시킬 수 있다. 도 2는 본 발명의 일 실시 예에 따른 로봇과 연결되는 AI 서버를 나타낸다. 도 2를 참조하면, AI 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습시키거나 학습된 인공 신 경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리를 수행 할 수도 있고, 5G 네트워크로 정의될 수 있다. 이때, AI 서버는 AI 장치의 일부의 구성으로 포함되어, AI 프로세싱 중 적어도 일부를 함께 수행할 수도 있다. AI 서버는 통신부, 메모리, 러닝 프로세서 및 프로세서 등을 포함할 수 있다. 통신부는 AI 장치 등의 외부 장치와 데이터를 송수신할 수 있다. 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 러닝 프로세서을 통하여 학습 중 인 또는 학습된 모델(또는 인공 신경망, 231a)을 저장할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망(231a)을 학습시킬 수 있다. 학습 모델은 인공 신경 망의 AI 서버에 탑재된 상태에서 이용되거나, AI 장치 등의 외부 장치에 탑재되어 이용될 수도 있다. 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우 학습 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리 에 저장될 수 있다.프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기 초한 응답이나 제어 명령을 생성할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 로봇을 포함하는 AI 시스템을 나타낸다. 도 3을 참조하면, AI 시스템은 AI 서버, 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰 (100d) 또는 가전(100e) 중에서 적어도 하나 이상이 클라우드 네트워크와 연결된다. 여기서, AI 기술이 적 용된 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰(100d) 또는 가전(100e) 등을 AI 장치(100a 내지 100e)라 칭할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, AI 시스템을 구성하는 각 장치들(100a 내지 100e, 200)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(100a 내지 100e, 200)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않 고 직접 서로 통신할 수도 있다. AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. AI 서버는 AI 시스템을 구성하는 AI 장치들인 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스 마트폰(100d) 또는 가전(100e) 중에서 적어도 하나 이상과 클라우드 네트워크을 통하여 연결되고, 연결된 AI 장치들(100a 내지 100e)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(100a 내지 100e)에 전송할 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치 (100a 내지 100e)로 전송할 수 있다. 또는, AI 장치(100a 내지 100e)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론 한 결과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. 이하에서는, 상술한 기술이 적용되는 AI 장치(100a 내지 100e)의 다양한 실시 예들을 설명한다. 여기서, 도 3에 도시된 AI 장치(100a 내지 100e)는 도 1에 도시된 AI 장치의 구체적인 실시 예로 볼 수 있다. 로봇(100a)은 AI 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. 로봇(100a)은 동작을 제어하기 위한 로봇 제어 모듈을 포함할 수 있고, 로봇 제어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 로봇(100a)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 로봇(100a)의 상태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결정하거나, 사용 자 상호작용에 대한 응답을 결정하거나, 동작을 결정할 수 있다. 여기서, 로봇(100a)은 이동 경로 및 주행 계획을 결정하기 위하여, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 로봇(100a)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있 다. 예컨대, 로봇(100a)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 동작을 결정할 수 있다. 여기서, 학습 모델은 로봇(100a)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 로봇(100a)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등 의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 로봇(100a)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적 어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계획에 따라 로봇(100a)을 주행시킬 수 있다. 맵 데이터에는 로봇(100a)이 이동하는 공간에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 벽, 문 등의 고정 객체들과 화분, 책상 등의 이동 가능한 객체들에 대한 객체 식별 정보 가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 로봇(100a)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 로봇(100a)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. 로봇(100a)은 AI 기술 및 자율 주행 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터 테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. AI 기술과 자율 주행 기술이 적용된 로봇(100a)은 자율 주행 기능을 가진 로봇 자체나, 자율 주행 차량(100b)과 상호작용하는 로봇(100a) 등을 의미할 수 있다. 자율 주행 기능을 가진 로봇(100a)은 사용자의 제어 없이도 주어진 동선에 따라 스스로 움직이거나, 동선을 스 스로 결정하여 움직이는 장치들을 통칭할 수 있다. 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차량(100b)은 이동 경로 또는 주행 계획 중 하나 이상을 결정 하기 위해 공통적인 센싱 방법을 사용할 수 있다. 예를 들어, 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차량(100b)은 라이다, 레이더, 카메라를 통해 센싱된 정보를 이용하여, 이동 경로 또는 주행 계획 중 하나 이상 을 결정할 수 있다. 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)과 별개로 존재하면서, 자율 주행 차 량(100b)의 내부에서 자율 주행 기능에 연계되거나, 자율 주행 차량(100b)에 탑승한 사용자와 연계된 동작을 수 행할 수 있다. 이때, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)을 대신하여 센서 정보를 획득 하여 자율 주행 차량(100b)에 제공하거나, 센서 정보를 획득하고 주변 환경 정보 또는 객체 정보를 생성하여 자 율 주행 차량(100b)에 제공함으로써, 자율 주행 차량(100b)의 자율 주행 기능을 제어하거나 보조할 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)에 탑승한 사용자를 모니터링하 거나 사용자와의 상호작용을 통해 자율 주행 차량(100b)의 기능을 제어할 수 있다. 예컨대, 로봇(100a)은 운전 자가 졸음 상태인 경우로 판단되는 경우, 자율 주행 차량(100b)의 자율 주행 기능을 활성화하거나 자율 주행 차 량(100b)의 구동부의 제어를 보조할 수 있다. 여기서, 로봇(100a)이 제어하는 자율 주행 차량(100b)의 기능에는 단순히 자율 주행 기능뿐만 아니라, 자율 주행 차량(100b)의 내부에 구비된 네비게이션 시스템이나 오디오 시스 템에서 제공하는 기능도 포함될 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)의 외부에서 자율 주행 차량 (100b)에 정보를 제공하거나 기능을 보조할 수 있다. 예컨대, 로봇(100a)은 스마트 신호등과 같이 자율 주행 차 량(100b)에 신호 정보 등을 포함하는 교통 정보를 제공할 수도 있고, 전기 차량의 자동 전기 충전기와 같이 자 율 주행 차량(100b)과 상호작용하여 충전구에 전기 충전기를 자동으로 연결할 수도 있다. 도 4는 본 발명의 일 실시 예에 따른 빌딩 관리 로봇 및 그를 포함하는 빌딩 관리 시스템의 개념도이다. 이하 본 명세서에서는 빌딩 관리 로봇 및 빌딩 관리 시스템이 적용되는 빌딩이 아파트인 것으로 가정하여 설명 한다. 그러나, 상기 빌딩 관리 로봇 및 빌딩 관리 시스템은 아파트가 아닌 다른 공동주택이나, 호텔, 오피스텔 등의 상업용 빌딩 등의 다양한 빌딩에 대해 적용될 수 있다. 도 4를 참조하면, 빌딩 관리 시스템은 빌딩 관리 로봇, 서버(200a), 식별 장치, 출입구 관리 장치 , 엘리베이터 관리 장치, 및 홈 관리 장치를 포함할 수 있다. 빌딩 관리 시스템에 포함된 구성 들이 도 4에 한정되는 것은 아닌 바, 빌딩 관리 시스템은 도 4에 도시된 구성들보다 많거나 적은 구성들을 포함 할 수도 있다. 빌딩 관리 로봇은 빌딩의 내부 영역 또는 빌딩으로부터 소정 거리 이내의 외부 영역(이하 '빌딩 내/외부' 라 함)을 주행하면서, 빌딩의 관리와 관련된 다양한 동작을 수행할 수 있다. 예컨대, 빌딩 관리 로봇은 빌딩 내/외부를 주행하면서, 경비 동작, 경비원 보조, 주차장 관리, 청소 동작 등을 수행할 수 있다. 또는, 빌딩 관리 로봇은 아파트의 각 세대에 대한 방문 서비스를 제공하거나 택배나 우편 등의 물품을 전 달하는 등의 다양한 서비스를 제공할 수 있다. 특히, 본 발명의 실시 예에 따른 빌딩 관리 로봇은 빌딩 내/외부에 위치하거나 빌딩으로 진입하려는 사람 을 인식하고, 인식 결과에 따라 상기 사람에게 제공할 서비스를 결정할 수 있다. 이와 관련된 구체적인 실시 예 들에 대해서는 추후 도 6 내지 도 16을 통해 후술한다. 서버(200a)는 빌딩 관리 시스템의 전반적인 관리를 수행할 수 있다. 예컨대 서버(200a)는 빌딩 관리 시스템의 제공자가 운영하는 서버일 수 있으나, 실시 예에 따라서는 빌딩 내에 구비된 적어도 하나의 컴퓨팅 장치로 구현 될 수 있다. 서버(200a)는 빌딩 관리 로봇 및 빌딩 내의 다양한 기기들(500, 610, 620, 630)과 연결되어, 다양한 정보 및 데이터를 송수신하거나, 상기 연결된 기기들(400, 610, 620, 630)의 동작을 제어할 수 있다. 한편, 서버 (200a)를 제외한 나머지 기기들(400, 500, 610, 620, 630)은 서버(200a)를 통해 서로 통신 연결될 수 있으나, 실시 예에 따라서는 직접 통신 연결될 수도 있다. 서버(200a) 또는 빌딩 관리 로봇은 상기 빌딩을 이용하는 사람들에 대한 인식 및 식별을 위한 알고리즘 및 데이터베이스를 포함할 수 있다. 또한, 서버(200a) 또는 빌딩 관리 로봇(400은 상기 데이터베이스를 통해, 상기 빌딩에 포함된 복수의 구획 공간 들(아파트 동/호수, 호텔 호실 등) 각각에 대응하는 사용자(입주민, 투숙객, 고용자 등)를 관리할 수 있다. 예 컨대, 상기 데이터베이스는 상기 구획 공간에 대응하는 것으로 인식된 사람이 상기 구획 공간의 출입 또는 이용 권한을 갖는 사용자인지 여부를 인증 레벨에 따라 구분할 수 있다. 이에 대해서는 도 6 내지 도 8을 통해 후술 한다. 한편, 빌딩 관리 로봇이 사람을 인식하는 동작 및 인식 결과에 기초하여 제공할 서비스를 결정하는 동작은 서버(200a)에 의해 수행될 수도 있다. 이 경우, 빌딩 관리 로봇은 사람의 인식을 위한 데이터(영상, 음성 등)를 서버(200a)로 전송하고, 서버(200a)는 수신된 데이터로부터 상기 사람을 인식하고, 인식 결과에 기초하여 제공할 서비스를 결정할 수 있다. 서버(200a)는 결정된 서비스와 관련된 정보 또는 명령을 빌딩 관리 로봇(40 0)으로 전송하고, 빌딩 관리 로봇은 상기 결정된 서비스를 인식된 사람에게 제공할 수 있다. 한편, 서버(200a)는 도 2에서 상술한 AI 서버로 구현될 수도 있다. 즉, 도 2에서 상술한 AI 서버의 구성들 및 그와 관련된 설명은 도 4의 서버(200a)에도 마찬가지로 적용될 수 있다. 식별 장치는 빌딩에 포함된 복수의 구획 공간들 중 어느 하나의 구획 공간과 대응하는 기기일 수 있다. 예 컨대, 상기 빌딩이 아파트인 경우, 상기 식별 장치는 아파트 내의 특정 호수에 대응하는 스마트 키(smart key)로 구현될 수 있다. 식별 장치는 상기 어느 하나의 구획 공간에 대한 식별 정보, 상기 구획 공간의 잠금 또는 잠금 해제를 위 한 보안 정보 등을 포함할 수 있다. 상기 빌딩이 아파트인 경우, 상기 식별 장치는 대응하는 동/호수에 대 한 식별 정보, 상기 동/호수의 잠금 또는 잠금 해제를 위한 보안 정보(패스워드 등)를 포함할 수 있다. 식별 장치는 근거리 무선 통신 모듈을 포함할 수 있다. 예컨대, 식별 장치는 Bluetooth®, BLE(Bluetooth Low Energy), NFC(near field communication), UWB(ultra wideband), Zigbee 등의 근거리 무선 통신 방식에 따라 빌딩 관리 시스템에 포함된 구성들(200a, 400, 610, 620, 630)과 통신 연결될 수 있다. 출입구 관리 장치는 빌딩의 출입구에 대한 개폐 동작을 관리할 수 있다. 예컨대, 출입구 관리 장치는 소정 거리 이내에 식별 장치가 위치하는 경우 상기 식별 장치로부터 식별 정보 또는 보안 정보를 획 득할 수 있다. 출입구 관리 장치 또는 서버(200a)는 획득된 식별 정보 또는 보안 정보가 빌딩 관리 시스템 의 데이터베이스에 등록된 정보인지 여부를 확인할 수 있다. 상기 획득된 식별 정보 또는 보안 정보가 상기 데 이터베이스에 등록된 정보인 경우, 출입구 관리 장치는 빌딩의 출입구를 오픈시킬 수 있다. 엘리베이터 관리 장치는 빌딩에 구비된 엘리베이터의 동작을 관리할 수 있다. 예컨대, 엘리베이터 관리 장 치는 엘리베이터의 승강 동작, 도어의 개폐 동작 등을 제어할 수 있다. 실시 예에 따라, 엘리베이터의 내 부에는 카메라 장치(CCTV 등)가 구비될 수 있고, 엘리베이터 관리 장치는 상기 카메라 장치를 통해 획득되 는 영상 데이터를 서버(200a) 등으로 전송할 수 있다.한편, 실시 예에 따라 출입구 관리 장치 및 엘리베이터 관리 장치 각각에 대한 적어도 일부의 구성 및 기능은 서버(200a)에 통합될 수도 있다. 홈 관리 장치는 구획 공간들 각각에 구비되어, 대응하는 구획 공간에 대한 관리 동작을 수행할 수 있다. 상기 홈 관리 장치는 상기 구획 공간의 도어 개폐 동작, 구획 공간 내의 전력 공급 제어, 구획 공간 내의 모니터링 등 상기 구획 공간과 관련된 다양한 관리 동작을 수행할 수 있다. 일례로, 홈 관리 장치는 도어에 구비되는 도어락 장치를 포함할 수 있다. 상기 도어락 장치는 상기 구획 공간에 대응하는 식별 장치가 소정 거리 이내로 근접할 경우, 상기 식별 장치로부터 식별 정보 또는 보안 정보를 획득할 수 있다. 상기 도어락 장치는 획득된 식별 정보 또는 보안 정보가 상기 구획 공간에 대응하 는 식별 정보 또는 보안 정보와 일치하는 경우, 상기 도어의 잠금을 해제할 수 있다. 그 밖에도, 빌딩 관리 시스템은 빌딩의 종류나 특성에 따른 다양한 구성들을 더 포함할 수 있다. 이하, 본 발명의 실시 예에 따른 빌딩 관리 로봇의 구성 및 상기 빌딩 관리 로봇을 통해 제공되는 다 양한 빌딩 관리 동작의 실시 예들을 설명한다. 도 5는 본 발명의 일 실시 예에 따른 빌딩 관리 로봇의 제어 구성을 나타내는 블록도이다. 도 5를 참조하면, 본 발명의 일 실시 예에 따른 빌딩 관리 로봇은 통신부, 입력부, 센싱부 , 출력부, 주행부, 메모리, 및 프로세서를 포함할 수 있다. 도 5에 도시된 구성들은 설명의 편의를 위한 일례로서, 빌딩 관리 로봇은 도 5에 도시된 구성들보다 많거나 적은 구성들을 포함할 수 있다. 한편, 빌딩 관리 로봇은 도 1에서 상술한 AI 장치의 일례에 해당할 수 있다. 이 경우, 도 1에서 상술 한 구성들 각각에 대한 내용은, 빌딩 관리 로봇의 구성들 중 대응하는 구성들 각각에 대해서도 마찬가지로 적용될 수 있다. 통신부는 빌딩 관리 로봇을 네트워크를 통해 서버(200a), 식별 장치, 기타 다양한 기기들(610, 620, 630) 등과 연결하기 위한 통신 모듈들을 포함할 수 있다. 상기 통신 모듈들 각각은 도 1에서 상술한 통신 기술 중 어느 하나를 지원할 수 있다. 예컨대, 빌딩 관리 로봇은 공유기 등의 액세스 포인트를 통해 네트워크와 연결될 수 있다. 이에 따라, 빌 딩 관리 로봇은 입력부나 센싱부 등을 통해 획득되는 각종 정보 및/또는 데이터를, 상기 네트워 크를 통해 서버(200a) 등으로 제공할 수 있다. 한편, 통신부는 근거리 무선 통신 모듈(블루투스, BLE, NFC 등)을 이용하여 빌딩 관리 로봇으로부터 소정 거리 이내에 존재하는 식별 장치를 인식할 수 있다. 실시 예에 따라, 빌딩 관리 로봇은 서로 이 격되어 배치되는 적어도 두 개의 근거리 무선 통신 모듈을 구비할 수 있다. 이 경우, 프로세서는 상기 적 어도 두 개의 근거리 무선 통신 모듈로부터 인식되는 식별 장치의 방향 및/또는 위치를 감지할 수도 있다. 입력부는 다양한 종류의 데이터를 획득하는 적어도 하나의 입력 수단을 포함할 수 있다. 예컨대, 상기 적 어도 하나의 입력 수단은 버튼이나 다이얼 등의 물리 입력 수단, 터치 패드나 터치 패널과 같은 터치 입력부 등 을 포함할 수 있다. 사용자는 입력부를 통해 각종 요청이나 명령을 빌딩 관리 로봇으로 입력할 수 있 다. 센싱부는 빌딩 관리 로봇 주변의 다양한 정보를 센싱하는 적어도 하나의 센서를 포함할 수 있다. 예 컨대 센싱부는 카메라, 마이크로폰, 및 주행 환경 감지 센서 등을 포함할 수 있다. 카메라는 빌딩 관리 로봇 주변의 영상을 획득할 수 있다. 예컨대, 빌딩 관리 로봇은 적어도 하 나의 카메라를 구비할 수 있고, 적어도 하나의 카메라는 스테레오 카메라, 2D 카메라, 적외선 카메라 등으로 구현될 수 있다. 마이크로폰은 빌딩 관리 로봇 주변의 소리(사람의 음성, 특정 오브젝트로부터 발생하는 음향 등)를 감지할 수 있다. 일례로, 프로세서는 카메라를 통해 사람의 얼굴(face)을 포함하는 이미지 데이터를 획득하고, 획득된 이미지 데이터에 기초하여 상기 사람을 인식할 수 있다. 또는 프로세서는 획득된 이미지 데이터를 통신부 를 통해 서버(200a)로 전송하고, 서버(200a)는 수신된 이미지 데이터에 기초하여 상기 사람을 인식할 수있다. 실시 예에 따라, 프로세서는 마이크로폰을 통해 사람의 음성을 포함하는 음성 데이터를 획득하고, 획 득된 음성 데이터를 이용하여 사람을 인식할 수도 있다. 한편, 서버(200a)는 도 2에서 상술한 AI 서버로 구현될 수 있고, 이 경우 서버(200a)는 러닝 프로세서 을 통해 학습된 모델(인공신경망(231a))을 통해 상기 이미지 데이터 및/또는 음성 데이터로부터 사람을 인 식할 수도 있다. 실시 예에 따라, 프로세서는 빌딩 관리 로봇 내의 러닝 프로세서에 의해 학습된 모델을 통해, 상기 이미지 데이터 및/또는 음성 데이터로부터 사람을 인식할 수 있다. 또는, 프로세서는 상기 서버 (200a)로부터 상기 학습된 모델에 대응하는 데이터를 수신하여 메모리에 저장하고, 저장된 데이터를 통해 상기 이미지 데이터 및/또는 음성 데이터로부터 사람을 인식할 수도 있다. 주행 환경 감지 센서는 빌딩 관리 로봇의 안정적인 주행을 위해, 빌딩 관리 로봇 주변이나 바닥 면의 장애물, 바닥면의 단차 등을 감지하는 적어도 하나의 센서를 포함할 수 있다. 예컨대, 주행 환경 감지 센 서는 카메라, 초음파 센서, 근접 센서 등을 포함할 수 있다. 프로세서는 주행 환경 감지 센서의 센싱값에 기초하여, 빌딩 관리 로봇의 주행 방향이나 주행 속도를 제어할 수 있다. 예컨대, 프로세서는 상기 센싱값에 기초하여 전방의 장애물을 감지하고, 감지된 장애물에 기초하여 주행 경로를 설정 또는 변경하고, 설정 또는 변경된 주행 경로에 기초하여 주행부(462; 예컨 대 주행 모터)를 제어할 수 있다. 실시 예에 따라, 센싱부에 포함된 구성들 중 일부(예컨대, 카메라, 마이크로폰 등)는 입력부로서 기 능할 수도 있다. 출력부는 빌딩 관리 로봇의 동작이나 상태, 빌딩 관리 로봇에서 실행되는 각종 서비스, 프로그 램, 애플리케이션 등과 관련된 각종 정보를 출력할 수 있다. 예컨대 출력부는 디스플레이 및 스피커 등을 포함할 수 있다. 디스플레이는 상술한 각종 정보나 메시지를 그래픽 형태로 출력할 수 있다. 실시 예에 따라, 디스플레이 는 터치 입력부와 함께 터치 스크린 형태로 구현될 수 있고, 이 경우 디스플레이는 출력 수단뿐만 아 니라 입력 수단으로서도 기능할 수 있다. 스피커는 상기 각종 정보나 메시지를 음성이나 음향 형태로 출력 할 수 있다. 실시 예에 따라, 프로세서는 상기 출력부를 이용하여 로봇 주변의 사람과 경비실의 경비 원, 또는 특정 구획 공간의 거주자와의 화상 통화를 지원할 수 있다. 실시 예에 따라, 상기 출력부는 일종의 단말기 형태로 빌딩 관리 로봇의 소정 위치에 탈착될 수도 있 다. 주행부는 빌딩 관리 로봇의 이동(주행)을 위한 것으로서, 예컨대 주행 모터를 포함할 수 있다. 상기 주행모터는 빌딩 관리 로봇의 하부에 구비된 적어도 하나의 휠과 연결되어, 빌딩 관리 로봇의 주행을 위한 구동력을 상기 휠로 제공할 수 있다. 예컨대, 주행부는 적어도 하나의 주행모터를 구비할 수 있고, 프로세서는 상기 적어도 하나의 주행모터를 제어하여 주행 방향 및/또는 주행 속도를 조절할 수 있다. 메모리는 빌딩 관리 로봇에 포함된 구성 요소들의 동작을 제어하기 위한 제어 데이터, 입력부를 통해 획득된 입력이나 센싱부를 통해 획득되는 정보에 기초한 동작을 수행하기 위한 데이터 등의 각종 데 이터를 저장할 수 있다. 또한, 메모리는 프로세서에 포함된 적어도 하나의 프로세서나 컨트롤러에 의해 실행되는 소프트웨어 모듈이나 애플리케이션 등의 프로그램 데이터를 저장할 수 있다. 또한, 본 발명의 실시 예에 따른 메모리는 카메라를 통해 획득된 사람을 포함하는 이미지 데이터, 및 /또는 마이크로폰을 통해 획득된 사람의 음성 데이터로부터, 사람을 인식하기 위한 인식 알고리즘을 저장 할 수 있다. 메모리는 상기 인식된 사람을 식별하거나, 인식된 사람이 빌딩 내의 소정 구획 공간의 출입 또는 이용 권한을 갖는 사람(입주민, 투숙객 등)인지를 인증하기 위한 데이터베이스를 더 포함할 수도 있다. 또한, 메모리는 주행 환경 감지 센서를 통해 획득되는 센싱값에 기초하여 주행 속도나 주행 방향을 조절하는 알고리즘을 저장할 수 있다.이러한 메모리는 하드웨어적으로, ROM, RAM, EEPROM, 플래시 드라이브, 하드 드라이브 등과 같은 다양한 저장기기를 포함할 수 있다. 프로세서는 빌딩 관리 로봇의 동작을 제어하는 적어도 하나의 프로세서나 컨트롤러 등을 포함할 수 있다. 구체적으로, 프로세서는 적어도 하나의 CPU, AP(application processor), 마이크로컴퓨터(또는 마 이컴), 집적 회로, ASIC(application specific integrated circuit) 등을 포함할 수 있다. 프로세서는 빌딩 관리 로봇에 포함된 구성들의 전반적인 동작을 제어할 수 있다. 또한, 프로세서 는 카메라를 통해 획득되는 이미지 신호를 처리하여 이미지 데이터를 생성하는 ISP, 디스플레이(45 2)의 동작을 제어하는 디스플레이 컨트롤러 등을 포함할 수 있다. 이하, 도 6 내지 도 16을 참조하여, 본 발명의 실시 예에 따른 빌딩 관리 로봇 및 그를 포함하는 빌딩 관 리 시스템의 동작에 대해 보다 상세히 설명한다. 도 6은 본 발명의 일 실시 예에 따른 빌딩 관리 로봇이, 인식된 사람에 대한 등록 및 관리 동작을 설명하기 위 한 플로우차트이다. 도 6을 참조하면, 빌딩 관리 로봇은 식별 장치를 인식할 수 있다(S100). 빌딩 관리 로봇은 빌딩 내/외부를 주행하거나 빌딩 내/외부의 소정 위치에 정지한 상태로 각종 동작을 수 행하거나 서비스를 제공할 수 있다. 프로세서는, 빌딩 관리 로봇으로부터 소정 거리 이내로 식별 장치가 근접하는 경우, 통신부 를 통해 상기 식별 장치의 존재를 감지할 수 있다. 예컨대, 통신부에 포함된 근거리 무선 통신 모듈은 식별 장치를 감지하기 위한 신호를 주기적으로 출 력할 수 있다. 상기 식별 장치는 상기 빌딩 관리 로봇으로부터 소정 거리 이내에 위치한 경우 상기 신호를 수신하고, 수신된 신호에 따른 응답을 출력할 수 있다. 상기 응답은 식별 장치에 저장된 식별 정보 를 포함할 수 있으나, 반드시 그러한 것은 아니다. 프로세서는 상기 통신부를 통해 응답을 수신함으로써 상기 식별 장치의 존재를 감지할 수 있다. 또한, 상기 응답에 식별 장치의 식별 정보가 포함된 경우, 프로세서는 상기 응답을 수신함으로써 식 별 장치의 식별 정보를 획득할 수 있다. 빌딩 관리 로봇은 인식된 식별 장치의 위치(또는 방향)를 감지하고, 감지된 위치와 대응하는 위치에 존재하는 사람을 인식할 수 있다(S110). 도 5에서 상술한 바와 같이, 빌딩 관리 로봇은 서로 이격된 적어도 두 개의 근거리 무선 통신 모듈을 포함 할 수 있다. 이 경우, 프로세서는 적어도 두 개의 근거리 무선 통신 모듈 각각으로부터 수신되는 응답의 시간 차이 또는 응답의 신호 세기 차이 등에 기초하여, 상기 식별 장치의 위치 또는 방향을 감지할 수 있 다. 프로세서는 감지된 위치 또는 방향을 카메라가 향하도록 주행부를 제어할 수 있다. 또는, 빌딩 관리 로봇에 카메라의 방향을 조절하는 별도의 카메라 방향 조절 기구가 구비된 경우, 프로세서(48 0)는 상기 구성을 제어하여 카메라가 상기 감지된 위치 또는 방향을 향하게 할 수 있다. 프로세서는 카메라를 이용하여 상기 감지된 위치 또는 방향을 포함하는 이미지 데이터를 획득할 수 있다. 일반적으로 상기 식별 장치는, 식별 장치의 소유자 등의 사람에 의해 소지된 상태로 이동되는 바, 상기 획득된 이미지 데이터에는 식별 장치를 소지하고 있는 사람의 얼굴을 포함하는 이미지가 포함될 수 있다. 프로세서는 획득된 이미지 데이터로부터 상기 식별 장치에 대응하는 사람을 인식할 수 있다. 예컨대, 프로세서는 기 공지된 얼굴 인식 알고리즘을 이용하여 상기 이미지 데이터로부터 사람을 인식할 수 있다. 실시 예에 따라, 프로세서는 마이크로폰을 이용하여 상기 감지된 위치 또는 방향으로부터 발생하는 사람의 음성을 포함하는 음성 데이터를 획득할 수도 있다. 프로세서는 획득된 음성 데이터 내의 음성 특성 (주파수 특성 등)에 기초하여 상기 사람을 인식할 수 있다. 이 경우 상기 마이크로폰은 지향성 마이크로폰 으로 구현될 수 있으나, 반드시 그러한 것은 아니다. 실시 예에 따라, 프로세서는 메모리에 저장된 인식 모델을 이용하여, 이미지 데이터 및/또는 음성 데 이터로부터 사람을 인식할 수도 있다. 상기 인식 모델은 머신 러닝 기반으로 학습된 인공신경망을 포함할 수 있 다. 상기 인식 모델은 빌딩 관리 로봇의 러닝 프로세서, 또는 서버(200a)의 러닝 프로세서에 의 해 학습된 것일 수 있다. 상기 사람의 인식 결과는 이미지 데이터 및/또는 음성 데이터로부터 추출되는 상기 사람의 특징 데이터를 포함 할 수 있다. 예컨대, 상기 특징 데이터는 상기 사람의 얼굴 형태나 색상, 음성 등으로부터 추출되는 고유한 특 징점들을 포함할 수 있다. 이하, 상기 특징 데이터는 이미지 데이터로부터 획득되는 이미지 특징 데이터, 및/또 는 음성 데이터로부터 획득되는 음성 특징 데이터를 포함하는 것으로 가정한다. 도시되지는 않았으나, 프로세서는 식별 장치만이 인식되고, 이미지 데이터로부터 사람의 존재가 인식 되지 않으며, 식별 장치가 소정 시간 이상 이동하지 않는 것이 감지되는 경우, 식별 장치가 분실된 것으로 인식할 수 있다. 이 경우, 프로세서는 식별 장치를 수거하거나, 경비실의 PC 등으로 알림을 전송하거나, 식별 장치에 대해 등록된 사람의 단말기로 알림을 전송할 수 있다. 빌딩 관리 로봇은 인식된 식별 장치와 인식된 사람을 매칭하여 데이터베이스에 저장할 수 있다 (S120). 프로세서는 상기 식별 장치로부터 획득된 식별 정보와, 상기 사람의 인식 결과를 매칭하여 데이터베 이스에 저장함으로써, 상기 빌딩을 이용하는 상기 사람에 대한 관리를 가능하게 한다. 예컨대, 상기 빌딩이 아파트인 경우, 프로세서는 상기 식별 장치로부터 획득된 식별 정보(예컨대 동/ 호수 정보)와, 상기 사람의 인식 결과에 따른 특징 데이터를 매칭하여 데이터베이스에 저장할 수 있다. 상기 식별 장치와 대응하는 위치에서 인식되는 사람은 상기 식별 장치의 동/호수에 거주하는 거주자 이거나, 상기 동/호수와의 관련도가 높은 사람일 수 있다. 이에 따라, 프로세서는 상기 사람에 대한 효과적인 관리를 위해, 상기 식별 장치의 식별 정보와 상기 인식된 사람의 특징 데이터를 매칭하여 데이터베이스에 저장할 수 있다. 한편, 상기 데이터베이스에 상기 식별 정보와 상기 특징 데이터가 매칭된 상태로 기 저장되어 있는 경우에는, 프로세서는 도 9에서 후술할 실시 예와 같이 인식된 사람의 인증 레벨에 기초한 서비스를 제공할 수 있다. 실시 예에 따라, 상기 식별 장치와 대응하는 위치에서 두 명 이상의 사람들이 인식될 수도 있다. 이 경우 프로세서는 상기 식별 장치의 식별 정보와, 상기 인식된 사람들 각각의 특징 데이터를 매칭하여 데이 터베이스에 저장할 수 있다. 한편, 빌딩 관리 로봇은 S100 단계 내지 S110 단계를 지속적으로 수행함에 따라 인식 결과를 누적적으로 획득할 수 있다. 빌딩 관리 로봇은 누적되는 인식 결과에 기초하여, 상기 인식된 사람에 대한 인증 레벨을 설정할 수 있다(S130). 상기 식별 장치와 매칭된 상기 인식된 사람은 상기 식별 장치에 대응하는 구획 공간의 출입 또는 이 용 권한을 갖는 사람 또는 상기 구획 공간에 대해 등록된 사람일 수 있으나(예컨대 거주자, 투숙객, 근무자 등), 반드시 그러한 것은 아니고 단순한 일회성 방문자와 같이 상기 구획 공간의 출입 또는 이용 권한이 없는 사람일 수도 있다. 이에 따라, 빌딩 관리 로봇은 상기 인식된 사람에 대한 인증 레벨을 설정함으로써, 식별 장치와 매칭 되는 사람에 대해 제공되는 서비스를 차별화할 수 있다. 예컨대, 상기 인증 레벨이 높을수록, 상기 사람이 상기 식별 장치에 대응하는 구획 공간의 출입 또는 이용 권한을 가질 가능성이 높을 수 있다. 즉, 빌딩 관리 로 봇은 인식된 사람의 인증 레벨이 높을수록, 상기 사람이 특정 동/호수의 거주자인 가능성이 높은 것으로 인식할 수 있다. 이에 기초하면, 상기 사람이 상기 식별 장치와 함께 인식되는 횟수가 증가할수록, 상기 사람이 상기 구획 공간의 출입 또는 이용 권한을 갖거나 상기 구획 공간에 대해 등록된 사람일 가능성이 높을 수 있다. 따라서, 프로세서는 상기 사람이 상기 식별 장치와 함께 인식되는 횟수가 증가할수록, 또는 인식된 횟수가 소정 횟수 이상인 경우, 상기 인증 레벨을 증가시킬 수 있다. 한편, 상술한 S110 단계 내지 S130 단계 중 적어도 하나는 서버(200a)에 의해 수행될 수도 있다. 이 경우, 빌딩 관리 장치는 서버(200a)로 하여금 상기 S110 단계 내지 S130 단계를 수행하도록 하기 위해, 통신부, 카메라, 및/또는 마이크로폰에 의해 획득되는 정보 및 데이터를 서버(200a)로 전송할 수 있다.도 7 내지 도 8은 도 6에 도시된 빌딩 관리 로봇의 인증 레벨 관리와 관련된 예시도들이다. 도 7을 참조하면, 빌딩 관리 로봇은 소정 거리 내에 위치한 제1 식별 장치(500a)를 감지하고, 제1 식별 장 치(500a)로부터 제1 식별 정보(D_INFO1)를 획득할 수 있다. 빌딩 관리 로봇은 제1 식별 장치(500a)의 위치 또는 방향을 감지하고, 감지된 위치 또는 방향에 대한 이미 지 데이터를 카메라를 이용하여 획득할 수 있다. 상기 이미지 데이터는, 상기 제1 식별 장치(500a)를 소지 한 제1 사용자의 이미지를 포함할 수 있다. 빌딩 관리 로봇은 획득된 이미지 데이터로부터 제1 사용자의 제1 이미지 특징 데이터(IMAGE1)를 획득 할 수 있다. 예컨대, 프로세서는 획득된 이미지 데이터 중 제1 사용자의 얼굴 영역을 추출하고, 추출 된 영역의 이미지 데이터로부터 제1 이미지 특징 데이터(IMAGE1)를 획득할 수 있다. 빌딩 관리 로봇은 획득된 제1 식별 정보(D_INFO1) 및 제1 사용자의 제1 이미지 특징 데이터(IMAGE1) 를 서버(200a)로 전송할 수 있다. 서버(200a)는 수신된 제1 식별 정보(D_INFO1) 및 제1 이미지 특징 데이터(IMAGE1)를 포함하는 제1 레코드 (RECORD1)를 데이터베이스에 추가함으로써, 상기 제1 사용자를 제1 식별 장치(500a)에 매칭시켜 등록할 수 있다. 실시 예에 따라, 빌딩 관리 로봇은 제1 이미지 특징 데이터(IMAGE1) 대신 상기 획득된 이미지 데이터를 서 버(200a)로 전송할 수 있다. 서버(200a)는 상기 이미지 데이터로부터 제1 이미지 특징 데이터(IMAGE1)를 획득하 고, 획득된 제1 이미지 특징 데이터(IMAGE1) 및 제1 식별 정보(D_INFO1)를 포함하는 제1 레코드(RECORD1)를 데 이터베이스에 추가할 수 있다. 한편, 서버(200a)는 제1 식별 정보(D_INFO1)에 대한 제1 사용자의 인증 레벨을 설정할 수 있다. 상술한 바 와 같이, 서버(200a)는 제1 식별 장치(500a) 및 제1 사용자가 함께 인식된 횟수, 즉 제1 식별 정보 (D_INFO1)와 제1 이미지 특징 데이터(IMAGE1)가 함께 획득된 횟수가 증가할수록, 상기 인증 레벨을 증가시킬 수 있다. 또는, 제1 식별 장치(500a)에 대해 제1 사용자만이 인식되는 경우, 상기 제1 사용자는 제1 식별 장치 (500a)를 소지한 사람이고 상기 제1 식별 장치(500a)에 대응하는 구획 공간(아파트 동/호수 등)의 출입 또는 이 용 권한을 갖거나 등록된 사람인 것으로 간주될 수 있다. 따라서, 서버(200a)는 상기 제1 사용자에 대한 인증 레벨을 높게 설정할 수 있다. 한편, 도 8을 참조하면, 빌딩 관리 로봇은 제1 식별 장치(500a)의 위치 또는 방향을 감지하고, 감지된 위 치 또는 방향에 대한 이미지 데이터를 카메라를 이용하여 획득할 수 있다. 이 때, 제1 식별 장치(500a)의 위치에 복수의 사용자들(700, 710, 720)이 존재하는 경우, 상기 이미지 데이터는 상기 사용자들(700, 710, 72 0)의 이미지를 포함할 수 있다. 빌딩 관리 로봇은 획득된 이미지 데이터로부터 복수의 사용자들 각각의 이미지 특징 데이터를 획득할 수 있다. 예컨대, 프로세서는 제1 사용자에 대응하는 제1 이미지 특징 데이터(IMAGE1), 제2 사용자(71 0)에 대응하는 제2 이미지 특징 데이터(IMAGE2), 및 제3 사용자에 대응하는 제3 이미지 특징 데이터 (IMAGE3)를 각각 추출할 수 있다. 빌딩 관리 로봇은 획득된 제1 식별 정보(D_INFO1)와, 획득된 복수의 이미지 특징 데이터(IMAGE1, IMAGE2, IMAGE3)를 서버(200a)로 전송할 수 있다. 서버(200a)는 수신된 제1 식별 정보(D_INFO1) 및 이미지 특징 데이터(IMAGE1, IMAGE2, IMAGE3)에 기초하여, 제 1 식별 정보(D_INFO1) 및 제1 이미지 특징 데이터(IMAGE1)를 포함하는 제1 레코드(RECORD1)를 데이터베이스에 추가할 수 있다. 다만, 데이터베이스에 상기 제1 레코드(RECORD1)가 이미 존재하는 경우, 서버(200a)는 제1 레 코드(RECORD1)의 인증 레벨을 업데이트하거나, 제1 레코드(RECORD1)에 포함될 수 있는 다른 항목(최근 인증일자 등)을 업데이트할 수 있다. 또한, 서버(200a)는 제1 식별 정보(D_INFO1)와 제2 이미지 특징 데이터(IMAGE2)를 포함하는 제2 레코드 (RECORD2), 및 제1 식별 정보(D_INFO1)와 제3 이미지 특징 데이터(IMAGE3)를 포함하는 제3 레코드(RECORD3)를 데이터베이스에 추가함으로써, 상기 제2 사용자 및 제3 사용자 각각을 제1 식별 장치(500a)에 매칭시 켜 등록할 수 있다.서버(200a)는 제1 식별 정보(D_INFO1)에 대한 사용자들(700, 710, 720) 각각의 인증 레벨을 설정할 수 있다. 예 컨대, 제1 사용자 및 제1 식별 장치(500a)가 인식된 횟수가 소정 횟수 이상인 경우, 서버(200a)는 제1 사 용자에 대한 인증 레벨을 증가(예를 들어, LEVEL 3)시킬 수 있다. 반면, 제2 사용자가 제1 식별 장치(500a)와 함께 인식된 횟수, 및 제3 사용자가 제1 식별 장치(500 a)와 함께 인식된 횟수가 소정 횟수 미만인 경우에는, 제2 사용자 및 제3 사용자 각각이 제1 식별 장 치(500a)에 대응하는 구획 공간의 출입 또는 이용 권한을 갖는지 여부(예컨대, 특정 동/호수의 거주자인지 단순 한 방문자인지 여부)를 판단하기 어렵다. 이에 따라, 서버(200a)는 제2 사용자 및 제3 사용자 각각에 대한 인증 레벨을 낮게 설정(예컨대 LEVEL 1)하고, 추후 제2 사용자 또는 제3 사용자가 제1 식별 장 치(500a)와 함께 인식되는 횟수가 증가할 경우 상기 인증 레벨을 증가시킬 수 있다. 즉, 도 6 내지 도 8에 도시된 실시 예에 따르면, 빌딩 관리 로봇 및 그를 포함하는 빌딩 관리 시스템은, 빌딩 내/외부에서 인식되는 사람들을 빌딩 내의 구획 공간들 각각에 매칭시켜 등록 및 관리할 수 있다. 또한, 빌딩 관리 로봇 및 빌딩 관리 시스템은 특정 구획 공간에 대해, 매칭된 사람들 각각의 인증 레벨을 설정함 으로써, 특정 구획 공간의 출입 또는 이용 권한을 갖는 사람과 그렇지 않은 사람을 효과적으로 구분하여 관리할 수 있다. 도 9는 본 발명의 일 실시 예에 따른 빌딩 관리 로봇이, 인식된 사람의 인증 레벨에 기초하여 서비스를 제공하 는 동작을 설명하기 위한 플로우차트이다. 도 9를 참조하면, 빌딩 관리 로봇은 사람의 이미지를 획득하고(S200), 획득된 이미지에 포함된 상기 사람 을 인식할 수 있다(S210). S200 단계 및 S210 단계는 도 6의 S110 단계에서 상술한 내용과 유사한 바, 이에 대한 설명은 생략하기로 한다. 실시 예에 따라, 프로세서는 마이크로폰을 이용하여 사람의 음성 데이터를 획득하고, 획득된 음성 데 이터에 기초하여 상기 사람을 인식할 수도 있다. 빌딩 관리 로봇은 인식된 사람의 인증 레벨을 확인하고(S220), 확인된 인증 레벨에 기초한 서비스를 제공 할 수 있다(S230). 예컨대, 프로세서는 데이터베이스로부터, 인식된 사람의 특징 데이터(이미지 특징 데이터 및/또는 음성 특 징 데이터)를 갖는 레코드를 획득할 수 있다. 프로세서는 획득된 레코드에 포함된 인증 레벨에 기초하여 상기 인식된 사람의 인증 레벨을 확인할 수 있다. 실시 예에 따라, 상기 특징 데이터를 갖는 레코드가 복수인 경우, 프로세서는 복수의 레코드들 각각에 포 함된 인증 레벨 중 가장 높은 인증 레벨을 상기 인식된 사람의 인증 레벨로 확인할 수 있다. 프로세서는 확인된 인증 레벨에 기초하여 상기 인식된 사람에게 서비스를 제공할 수 있다. 즉, 인증 레벨 마다 빌딩 관리 로봇이 제공하는 서비스의 종류나 특성이 서로 다를 수 있다. 일례로, 인증 레벨이 상대적으로 높은 제1 사용자와, 인증 레벨이 상대적으로 낮은 제2 사용자가 존재하는 것으 로 가정한다. 이 경우, 빌딩 관리 로봇은 제2 사용자보다 제1 사용자에게 보다 다양한 서비스를 제공할 수 있다. 일례로, 인증 레벨이 기준 레벨보다 낮은 사용자가 인식된 경우, 빌딩 관리 로봇은 단순한 인사 제공, 경 비실 호출, 특정 구획 공간에 대한 방문 호출 등과 같이, 빌딩 내부 또는 구획 공간 내부로의 진입과 관련된 서 비스를 제공하지는 않을 수 있다. 반면, 인증 레벨이 기준 레벨보다 높은 사용자가 인식된 경우, 빌딩 관리 로 봇은 빌딩 출입구의 개방, 에스코트, 엘리베이터의 호출, 특정 구획 공간의 도어 개방 등과 같이 보다 개 인화된 서비스를 제공할 수 있다. 이와 관련된 예들에 대해 도 10 내지 도 11을 참조하여 설명한다. 도 10 내지 도 11은 도 9에 도시된 빌딩 관리 로봇이 인증 레벨에 따라 서로 다른 서비스를 제공하는 동작을 나 타내는 예시도들이다. 도 10을 참조하면, 빌딩 관리 로봇은 카메라를 이용하여 제1 사용자를 포함하는 이미지를 획득 하고, 획득된 이미지로부터 제1 사용자를 인식할 수 있다. 예컨대, 빌딩 관리 로봇은 빌딩의 외부로 부터 내부로 진입하려는 제1 사용자를 인식할 수 있다.제1 사용자가 제1 식별 장치(500a)를 소지한 경우, 빌딩 관리 로봇은 제1 식별 장치(500a)의 제1 식 별 정보와 상기 제1 사용자를 함께 인식할 수 있다. 반면, 제1 사용자가 제1 식별 장치(500a)를 소지 하지 않은 경우, 빌딩 관리 로봇은 제1 사용자만을 인식할 수 있다. 빌딩 관리 로봇은 데이터베이스로부터, 인식된 제1 사용자에 대응하는 레코드(식별 정보, 인증 레벨 등)를 획득할 수 있다. 획득된 제1 사용자의 인증 레벨이 기준 레벨 이상인 경우, 빌딩 관리 로봇은 빌딩 출입구의 개방, 에 스코트, 엘리베이터의 호출, 특정 구획 공간의 도어 개방 등과 같이 보다 개인화된 서비스를 제1 사용자에 게 제공할 수 있다. 즉, 상기 기준 레벨은 특정 구획 공간에 대한 출입 또는 이용 권한이 있는 사람인지 여부를 구분하는 기준에 해당할 수 있다. 실시 예에 따라, 상기 기준 레벨은 복수 개로 구분될 수 있고, 이 경우 인증 레벨에 따라 제공되는 서비스가 더욱 세분화될 수 있다. 예컨대, 빌딩 관리 로봇은 출입구 관리 장치로 출입구 개방 요청 신호(OPEN)를 전송할 수 있다. 출입 구 관리 장치는 상기 신호(OPEN)를 수신함에 따라 빌딩의 출입구를 개방시킬 수 있다. 제1 사용자는 출입구가 개방됨에 따라 빌딩 내부로 진입할 수 있다. 또한, 빌딩 관리 로봇은 제1 사용자로 하여금 엘리베이터를 이용하도록 하기 위해, 엘리베이터 관리 장치로 엘리베이터 호출 신호(CALL)를 전송할 수 있다. 엘리베이터 관리 장치는 수신된 신호(CALL)에 기초하여 엘리베이터를 제1 사용자 및 빌딩 관리 로봇이 위치한 층으로 이동시킬 수 있다. 실시 예에 따라, 상기 빌딩 관리 로봇은 출력부를 통해 상기 제공 중인 서비스와 관련된 메시지 를 출력할 수도 있다. 또한, 빌딩 관리 로봇은 제1 사용자에 매칭된 식별 장치의 식별 정보로부터, 제1 사용자에 대응하는 구획 공간의 정보(층, 동/호수, 객실번호 등)를 획득할 수 있다. 빌딩 관리 로봇은 획득된 정보 에 기초하여, 제1 사용자의 탑승 후 엘리베이터가 이동할 층에 대한 정보를 엘리베이터 관리 장치로 전송할 수 있다. 엘리베이터 관리 장치는 수신된 정보에 기초하여 엘리베이터를 해당 층으로 이동시킬 수 있다. 도시되지는 않았으나, 빌딩 관리 로봇은 제1 사용자와 함께 엘리베이터에 탑승 및 하차하고, 제1 사 용자에 대응하는 구획 공간의 출입구(도어 등)까지 제1 사용자를 에스코트할 수 있다. 한편, 도 11을 참조하면, 빌딩 관리 로봇은 카메라를 이용하여 제3 사용자를 포함하는 이미지를 획득하고, 획득된 이미지로부터 제3 사용자를 인식할 수 있다. 예컨대, 빌딩 관리 로봇은 빌딩의 외 부로부터 내부로 진입하려는 제3 사용자를 인식할 수 있다. 빌딩 관리 로봇은 데이터베이스로부터, 인식된 제3 사용자에 대응하는 레코드(식별 정보, 인증 레벨 등)를 획득할 수 있다. 획득된 제3 사용자의 인증 레벨이 기준 레벨 미만인 경우, 빌딩 관리 로봇은 제3 사용자는 특정 구획 공간에 대한 출입 또는 이용 권한이 없는 사람(예컨대 방문자)인 것으로 판단할 수 있다. 이에 따라, 빌딩 관리 로봇은 도 10에 도시된 바와 같은 출입구 개방, 엘리베이터 호출 등의 서비스를 제공하지 않을 수 있 다. 예컨대, 빌딩 관리 로봇은 제3 사용자에 대응하는 구획 공간의 관리 장치로 방문자 알림(NOTI) 을 전송할 수 있다. 실시 예에 따라, 빌딩 관리 로봇은 출력부를 통해 상기 제공 중인 서비스와 관련 된 메시지를 출력할 수도 있다. 도시되지는 않았으나, 빌딩 관리 로봇은 상기 방문자 알림(NOTI)의 전송 시, 상기 제3 사용자를 포함 하는 영상 데이터를 관리 장치로 함께 전송할 수도 있다. 또한, 빌딩 관리 로봇은 상기 관리 장치로부터 상기 제3 사용자와의 커뮤니케이션을 위한 영상 및/또는 음성 데이터가 수신되면, 수신된 영상 및/또는 음성 데이터를 출력부를 통해 출력할 수도 있다. 즉, 빌딩 관리 로봇은 상기 구획 공간의 재실자(거주자 등)와 상기 제3 사용자 간의 커뮤니케이션을 가능하게 한다. 실시 예에 따라, 재실자에 의해 제3 사용자의 진입이 승인되는 경우, 빌딩 관리 로봇(40 0)은 도 10에 도시된 바와 같이 출입구 개방, 엘리베이터 호출 등의 서비스를 제3 사용자에게 제공할 수도 있다.한편, 도 9 내지 도 11에 도시된 빌딩 관리 로봇의 동작들 중, 사용자의 이미지를 획득하는 동작, 메 시지, 영상 및/또는 음성 데이터를 출력하는 동작 외의 동작들은 서버(200a)에 의해 수행될 수도 있다. 즉, 도 10 내지 도 11에 도시된 실시 예에 따르면 빌딩 관리 로봇은 인식된 사용자의 인증 레벨에 기초하 여 서로 다른 서비스를 제공할 수 있다. 특히, 상기 사용자가 상기 특정 구획 공간에 대응하는 식별 장치 를 소지하지 않은 상태이더라도, 빌딩 관리 로봇은 상기 사용자와 관련된 정보가 저장된 데이터베이스를 이용하여 상기 사용자에게 원활한 서비스를 제공할 수 있다. 도 12는 빌딩 관리 로봇의 엘리베이터 이용 방법에 대한 일 실시 예를 나타내는 플로우차트이다. 도 12를 참조하면, 빌딩 관리 로봇은 빌딩 내부의 소정 장소로 이동하기 위해, 빌딩 내부에 구비된 엘리베 이터의 탑승 상황이 발생함을 인식할 수 있다(S300). 예컨대, 프로세서는 특정 구획 공간의 관리 장치(예컨대, 홈 관리 장치)로부터 방문 요청을 수신한 경우, 상기 특정 구획 공간으로 이동하기 위해 엘리베이터를 탑승해야 함을 인식할 수 있다. 빌딩 관리 로봇은 엘리베이터 관리 장치로부터 엘리베이터의 내부 영상을 획득하고(S310), 획득된 내 부 영상으로부터 사람의 존재 여부를 감지할 수 있다(S320). 엘리베이터 관리 장치는 엘리베이터의 내부에 설치되는 카메라 장치(CCTV 등)를 이용하여 영상 데이터를 주기적 또는 지속적으로 획득할 수 있다. 상기 획득된 영상 데이터는 서버(200a)로 전송되어 저장될 수 있다. 빌딩 관리 로봇의 프로세서는 상기 엘리베이터의 탑승 상황이 발생한 경우, 엘리베이터 관리 장치 또는 서버(200a)로부터 엘리베이터의 내부에 대한 상기 영상 데이터를 획득할 수 있다. 프로세서는 획득된 영상 데이터로부터 엘리베이터 내부에 사람(이용자)이 존재하는지 여부를 감지할 수 있 다. 예컨대, 프로세서는 기 공지된 이미지 인식 알고리즘을 이용하여 상기 영상 데이터로부터 사람의 존재 여부를 인식할 수 있다. 실시 예에 따라, 사람의 존재 여부를 인식하는 동작은 서버(200a)에 의해 수행될 수도 있다. 감지 결과 엘리베이터의 내부에 사람이 존재하는 경우(S330의 YES), 빌딩 관리 로봇은 엘리베이터에 탑승 한 사람이 하차하기 전까지 엘리베이터를 호출하지 않고 대기할 수 있다(S340). 반면, 감지 결과 엘리베이터의 내부에 사람이 존재하지 않는 경우(S330의 NO), 빌딩 관리 로봇은 엘리베이 터를 호출하여 탑승할 수 있다(S350). 엘리베이터를 이용 중인 이용자가 존재하는 경우, 엘리베이터가 이동 중 상기 빌딩 관리 로봇에 의해 특정 층에서 정지된다면, 상기 이용자의 이동이 지연될 수 있다. 또는, 빌딩 관리 로봇에는 카메라나 마이크로폰이 구비된 상태이므로, 상기 이용자는 빌딩 관리 로봇과 함께 엘리베이터를 이용하는 것에 대해 프라이버시 측면에서 거부감을 느낄 수 있다. 즉, 빌딩 관리 로봇은 엘리베이터의 다른 이용자에 대한 방해 또는 불쾌감을 최소화하도록 상기 엘리베이 터를 이용할 수 있다. 이에 기초하여, 프로세서는 상기 엘리베이터의 내부에 사람이 존재하는 경우, 상기 사람이 하차하기 전까 지는 엘리베이터의 호출 요청을 엘리베이터 관리 장치로 전송하지 않고 대기할 수 있다. 상기 사람이 하차하는 등 상기 엘리베이터의 내부에 사람이 존재하지 않는 경우, 프로세서는 상기 엘리베 이터의 호출 요청을 엘리베이터 관리 장치로 전송할 수 있다. 엘리베이터가 빌딩 관리 로봇이 위치한 층에 도착하고 도어가 개방되면, 프로세서는 엘리베이터에 탑승하기 위해 주행부를 제어할 수 있다. 프로세서는 엘리베이터 탑승 후 상기 특정 구획 공간의 층으로의 이동 요청을 엘리베이터 관리 장치 로 전송할 수 있다. 엘리베이터 관리 장치는 상기 이동 요청에 응답하여 엘리베이터를 상기 특정 구획 공 간의 층으로 이동시킬 수 있다. 실시 예에 따라, 빌딩 관리 로봇은 엘리베이터 내부에 기설정된 인원 수 이상의 사람이 존재하는 경우 엘 리베이터를 호출하지 않고 대기할 수 있다. 그리고, 빌딩 관리 로봇은 엘리베이터 내부에 기설정된 인원 수 미만의 사람이 존재하는 경우에 엘리베이터를 호출하여 탑승할 수 있다. 또는, 빌딩 관리 로봇은 엘리베이터의 호출 후 탑승 전까지 엘리베이터 내부의 인원 수 변동을 모니터링하 고, 엘리베이터의 호출에 따른 이동 중 사람이 탑승하거나, 인원 수가 기설정된 인원 수 이상으로 증가하는 경 우 엘리베이터의 호출을 취소할 수도 있다. 도 13은 빌딩 관리 로봇의 엘리베이터 이용 방법에 대한 다른 실시 예를 나타내는 플로우차트이다. 도 13의 S400 단계는 도 12의 S300 단계와 실질적으로 동일하다. 빌딩 관리 로봇은 엘리베이터 관리 장치로부터 엘리베이터의 이용 대기자 존재 여부를 확인할 수 있 다(S410). 예컨대, 빌딩의 층들 각각에는, 엘리베이터 탑승 영역을 향하도록 배치되는 카메라 장치(CCTV 등)가 구비될 수 있다. 엘리베이터 관리 장치 또는 서버(200a)는 상기 카메라 장치들로부터 영상 데이터를 획득하고, 획득 된 영상 데이터를 빌딩 관리 로봇으로 전송할 수 있다. 프로세서(또는 서버(200a))는 기 공지된 이미지 인식 알고리즘을 이용하여, 획득된 영상 데이터로부터 사 람의 존재 여부를 인식함으로써 상기 엘리베이터의 이용 대기자가 존재하는지 여부를 확인할 수 있다. 확인 결과 이용 대기자가 존재하는 경우(S420의 YES), 빌딩 관리 로봇은 엘리베이터를 호출하지 않고 대기 할 수 있다(S430). 반면, 확인 결과 이용 대기자가 존재하지 않는 경우(S420의 NO), 빌딩 관리 로봇은 엘리베이터를 호출하여 탑승할 수 있다(S440). 프로세서는 특정 층에 이용 대기자가 존재하는 경우, 상기 이용 대기자의 엘리베이터 이용이 종료되기 전 까지는 엘리베이터의 호출 요청을 엘리베이터 관리 장치로 전송하지 않고 대기할 수 있다. 엘리베이터의 이용 대기자가 존재하지 않는 경우, 프로세서는 상기 엘리베이터의 호출 요청을 엘리베이터 관리 장치로 전송할 수 있다. 엘리베이터가 빌딩 관리 로봇이 위치한 층에 도착하고 도어가 개방되면, 프로세서는 엘리베이터에 탑승하기 위해 주행부를 제어할 수 있다. 프로세서는 엘리 베이터 탑승 후 상기 특정 구획 공간의 층으로의 이동 요청을 엘리베이터 관리 장치로 전송할 수 있다. 엘 리베이터 관리 장치는 상기 이동 요청에 응답하여 엘리베이터를 상기 특정 구획 공간의 층으로 이동시킬 수 있다. 즉, 도 12 내지 도 13에 도시된 실시 예에 따르면 빌딩 관리 로봇은 엘리베이터의 이용자 또는 이용 대기 자가 감지되지 않는 경우에만 엘리베이터를 이용함으로써, 이용자 또는 이용 대기자에 대한 방해나 불편을 최소 화할 수 있다. 도 14는 빌딩 관리 로봇이 인식된 사람의 식별 정보에 기초하여 엘리베이터 관련 서비스를 제공하는 동작의 일 실시 예를 설명하기 위한 플로우차트이다. 도 15는 도 14에 도시된 빌딩 관리 로봇의 엘리베이터 관련 서비스 제공 동작에 대한 예시도이다. 도 14를 참조하면, 빌딩 관리 로봇은 데이터베이스에 등록된 사람을 인식할 수 있다(S500). 빌딩 관리 로 봇은 인식된 사람에 대응하는 식별 장치 또는 구획 공간의 식별 정보에 기초하여 엘리베이터를 호출 할 수 있다(S510). 도 6, 도 9 등에서 상술한 바와 같이, 프로세서는 카메라 및/또는 마이크로폰을 통해 획득되는 이미지 데이터 및/또는 음성 데이터를 이용하여 사람을 인식하고, 데이터베이스로부터 상기 인식된 사람에 대응 하는 식별 장치(또는 구획 공간)의 식별 정보를 획득할 수 있다. 프로세서는 획득된 식별 정보로부터 상기 인식된 사람이 이동할 층을 확인하고, 확인 결과에 따라 엘리베 이터의 호출 요청을 엘리베이터 관리 장치로 전송할 수 있다. 실시 예에 따라, 프로세서는 상기 인식 된 사람에 대한 인증 레벨을 확인하고, 확인된 인증 레벨이 기준 레벨 이상인 경우에 상기 엘리베이터의 호출 요청을 엘리베이터 관리 장치로 전송할 수도 있다. 빌딩 관리 로봇은 인식된 사람의 식별 정보에 기초하여 엘리베이터를 동승하고(S520), 상기 사람의 하차 시 함께 하차하거나 에스코트를 수행할 수 있다. S520 단계 및 S530 단계의 식별 정보는, 식별 장치 또는 구획 공간에 대한 식별 정보를 의미하는 것이 아 니라, 상기 인식된 사람의 특징 데이터로부터 획득 가능한 상기 사람의 특성(성별, 연령대, 장애 여부, 거동 불 편 여부 등)을 나타내는 정보를 의미할 수 있다. 이 경우, 데이터베이스에는 상기 식별 장치 또는 구획 공간에 대한 식별 정보뿐만 아니라, 상기 사람의 특성을 나타내는 식별 정보가 함께 저장될 수 있다. 도 15를 함께 참조하면, 예컨대 상기 인식된 사람의 연령대가 소정 연령대 미만(예컨대, 어린이)이거나, 소정 연령대 이상(예컨대, 노인)인 경우, 프로세서는 상기 인식된 사람과 엘리베이터에 동승 및 함께 하차하도록 주행부를 제어할 수 있다. 프로세서는 하차 후 카메라를 이용하여 상기 인 식된 사람을 포함하는 영상 데이터를 획득함으로써, 상기 사람의 정상 이동 여부를 모니터링할 수 있다. 실시 예에 따라, 프로세서는 엘리베이터의 하차 후 상기 인식된 사람의 이동에 맞추어 주행하 도록 주행부를 제어함으로써 상기 인식된 사람에 대한 에스코트를 수행할 수도 있다. 도 16은 빌딩 관리 로봇이 엘리베이터 내의 타인의 식별 결과에 기초하여, 인식된 사람에 대해 엘리베이터 관련 서비스를 제공하는 동작의 일 실시 예를 설명하기 위한 플로우차트이다. 도 16을 참조하면, 빌딩 관리 로봇은 인식된 사람의 식별 정보에 기초하여 엘리베이터를 호출할 수 있다 (S600). S600 단계는 도 14의 S510 단계와 실질적으로 동일할 수 있다. 빌딩 관리 로봇은 호출된 엘리베이터 내에 타인이 존재하는 경우, 상기 타인을 인식 및 식별할 수 있다 (S610). 프로세서는 엘리베이터의 출입구가 개방되면, 카메라를 이용하여 엘리베이터 내부를 포함하는 이미지 데이터를 획득할 수 있다. 또는, 프로세서는 엘리베이터 내부에 구비된 카메라 장치(CCTV 등)로부터 획득 되는 영상 데이터를 엘리베이터 관리 장치로부터 수신할 수도 있다. 프로세서는 획득된 이미지 데이터 또는 수신된 영상 데이터로부터 상기 엘리베이터 내부에 타인이 존재하 는지 여부를 인식할 수 있다. 타인이 존재하는 경우, 프로세서는 상기 타인의 인식 및 식별 동작을 수행할 수 있다. 프로세서는 상 기 타인의 이미지로부터 특징 데이터를 획득하고, 획득된 특징 데이터가 데이터베이스에 존재하는지 여부에 기 초하여 상기 타인의 인식 및 식별 동작을 수행할 수 있다. 빌딩 관리 로봇은 상기 타인의 식별 결과에 기초하여, S600 단계에서 인식된 사람과 엘리베이터에 동승하 여 에스코트를 수행할 수 있다(S620). 예컨대, 상기 타인이 데이터베이스에 등록된 사람인 경우(또는 상기 타인의 인증 레벨이 기준 레벨 이상인 경우), 프로세서는 인식된 사람과 엘리베이터에 동승하지 않을 수 있다. 상기 타인이 데이터베이스에 등록 된 경우, 상기 타인은 S600 단계에서 인식된 사람과 동일 또는 다른 구획 공간의 출입 또는 이용 권한을 갖는 사람일 수 있다. 따라서, 프로세서는 상기 인식된 사람에 대한 안전이 보장된 것으로 인식하여, 상기 엘리 베이터에 동승하지 않을 수 있다. 반면, 상기 타인이 데이터베이스에 등록되지 않은 사람인 경우(또는 상기 타인의 인증 레벨이 기준 레벨 미만인 경우), 프로세서는 인식된 사람과 엘리베이터에 함께 탑승 및 하차하고 에스코트를 수행할 수 있다. 상기 타인이 데이터베이스에 등록되지 않은 경우, 상기 타인은 빌딩 내의 구획 공간들에 대한 출입 또는 이용 권한이 없는 사람(단순 방문자, 또는 위험도가 높은 사람 등)일 수 있다. 따라서, 프로세서는 상기 인식된 사람에 대한 안전을 위해, 인식된 사람과 함께 엘리베이터에 탑승 및 하차하고, 목적지까지의 에스코트 서비스를 제공 할 수 있다. 즉, 도 14 내지 도 16에 도시된 실시 예에 따르면, 빌딩 관리 로봇은 엘리베이터 이용자의 특성, 또는 엘 리베이터에 존재하는 타인의 식별 결과에 기초하여 상기 이용자와 엘리베이터에 동승 및 에스코트 서비스를 제 공할 수 있다. 이에 따라, 빌딩 관리 로봇은 이용자의 안전한 엘리베이터 이용을 가능하게 하고, 이용자는 빌딩 관리 로봇에 대한 만족감을 느낄 수 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이 고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사 상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2019-0087936", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 로봇을 포함하는 AI 장치를 나타낸다. 도 2는 본 발명의 일 실시 예에 따른 로봇과 연결되는 AI 서버를 나타낸다. 도 3은 본 발명의 일 실시 예에 따른 로봇을 포함하는 AI 시스템을 나타낸다. 도 4는 본 발명의 일 실시 예에 따른 빌딩 관리 로봇 및 그를 포함하는 빌딩 관리 시스템의 개념도이다. 도 5는 본 발명의 일 실시 예에 따른 빌딩 관리 로봇의 제어 구성을 나타내는 블록도이다. 도 6은 본 발명의 일 실시 예에 따른 빌딩 관리 로봇이, 인식된 사람에 대한 등록 및 관리 동작을 설명하기 위 한 플로우차트이다. 도 7 내지 도 8은 도 6에 도시된 빌딩 관리 로봇의 인증 레벨 관리와 관련된 예시도들이다. 도 9는 본 발명의 일 실시 예에 따른 빌딩 관리 로봇이, 인식된 사람의 인증 레벨에 기초하여 서비스를 제공하 는 동작을 설명하기 위한 플로우차트이다. 도 10 내지 도 11은 도 9에 도시된 빌딩 관리 로봇이 인증 레벨에 따라 서로 다른 서비스를 제공하는 동작을 나 타내는 예시도들이다.도 12는 빌딩 관리 로봇의 엘리베이터 이용 방법에 대한 일 실시 예를 나타내는 플로우차트이다. 도 13은 빌딩 관리 로봇의 엘리베이터 이용 방법에 대한 다른 실시 예를 나타내는 플로우차트이다. 도 14는 빌딩 관리 로봇이 인식된 사람의 식별 정보에 기초하여 엘리베이터 관련 서비스를 제공하는 동작의 일 실시 예를 설명하기 위한 플로우차트이다. 도 15는 도 14에 도시된 빌딩 관리 로봇의 엘리베이터 관련 서비스 제공 동작에 대한 예시도이다. 도 16은 빌딩 관리 로봇이 엘리베이터 내의 타인의 식별 결과에 기초하여, 인식된 사람에 대해 엘리베이터 관련 서비스를 제공하는 동작의 일 실시 예를 설명하기 위한 플로우차트이다."}
