{"patent_id": "10-2019-0164773", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0073946", "출원번호": "10-2019-0164773", "발명의 명칭": "차량운행 현황 모니터링 시스템 및 그 구동방법", "출원인": "박완규", "발명자": "박완규"}}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실시간으로 GPS 위치 정보를 수신하는 GPS 수신부;상기 GPS 수신부를 통해 수신되는 차량의 위치정보에 기반하여 차간거리 정보, 위험구간정보, 지연상황정보 중적어도 하나를 포함하는 차량 운행정보를 파악하는 운행정보 파악부; 상기 운행정보 파악부에서 파악되는 차량 운행정보를 음성으로 출력하는 음성 출력부;다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 통신을 수행하는 통신부; 및상기 통신부를 통해 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 상기 운행정보 파악부에서 파악된차량 운행정보를 교환하는 정보 교환부;를 포함하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템."}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 마이크로 입력되는 차량 운행 기사의 음성을 인식하여 차량 운행정보 요청 음성을 파악하는 음성 인식부;를 더포함하고, 상기 음성 출력부는 상기 운행정보 파악부에서 상기 음성 인식부로 인식되는 운행정보 요청 음성에 따라 운행정보를 파악하여 음성으로 출력하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템."}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 정보 교환부는 다른 차량에 탑재되는 카메라로 촬영된 영상을 수신하고, 상기 차량운행 현항 모니터링 시스템이,상기 정보 교환부로 수신되는 영상을 차량 운행중인 차량 운행 기사가 소지하는 사용자 단말로 전송하는 영상전송부;를 더 포함하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템."}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,비접촉식 무선통신기술로 경로(敬老) 우대 카드가 인식되면, 차량에 탑재된 스피커로 기저장된 경로 안내 메시지를 출력하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템."}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,차량 운행시에 주행 이력을 모니터링하여 주행 이력 데이터를 취합하고, 차량의 운행이 종료되는 경우에 운행기사 식별 정보와 상기 취합된 주행 이력 데이터를 차량 운행사 서버로 전송하는 주행 이력 모니터링부;를 더포함하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템.공개특허 10-2021-0073946-3-청구항 6 차량운행 현황 모니터링 시스템의 구동방법에 있어서, 운행정보 파악부가 실시간으로 GPS 위치 정보를 수신하는 GPS 수신부를 통해 수신되는 차량의 위치정보에 기반하여 차간거리 정보, 위험구간정보, 지연상황정보 중 적어도 하나를 포함하는 차량 운행정보를 파악하는 단계; 음성 출력부가 상기 파악되는 차량 운행정보를 음성으로 출력하는 단계; 및정보 교환부가 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 통신을 수행하는 통신부를 통해 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 상기 파악된 차량 운행정보를 교환하는 단계;를 포함하는 것을특징으로 하는 차량운행 현황 모니터링 시스템의 구동방법."}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 음성 인식부가 마이크로 입력되는 차량 운행 기사의 음성을 인식하여 차량 운행정보 요청 음성을 파악하는단계;를 더 포함하고, 상기 음성으로 출력하는 단계는 상기 운행정보 파악부에서 상기 음성 인식부로 인식되는 운행정보 요청 음성에따라 차량 운행정보를 파악하여 음성으로 출력하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템의 구동방법."}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서, 상기 운행정보를 교환하는 단계는 다른 차량에 탑재되는 카메라로 촬영된 영상을 수신하고, 상기 차량운행 현항 모니터링 시스템의 구동방법이,영상 전송부가 상기 정보 교환부로 수신되는 영상을 차량 운행중인 차량 운행 기사가 소지하는 사용자 단말로전송하는 단계;를 더 포함하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템의 구동방법."}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서,비접촉식 무선통신기술로 경로(敬老) 우대 카드가 인식되면, 차량에 탑재된 스피커로 기저장된 경로 안내 메시지를 출력하는 단계;를 더 포함하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템의 구동방법."}
{"patent_id": "10-2019-0164773", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6 항에 있어서,주행 이력 모니터링부가 차량 운행시에 주행 이력을 모니터링하여 주행 이력 데이터를 취합하고, 차량의 운행이종료되는 경우에 운행 기사 식별 정보와 상기 취합된 주행 이력 데이터를 차량 운행사 서버로 전송하는 단계;를더 포함하는 것을 특징으로 하는 차량운행 현황 모니터링 시스템의 구동방법."}
{"patent_id": "10-2019-0164773", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량운행 현황 모니터링 시스템 및 그 구동방법에 관한 것으로, 실시간으로 GPS 위치 정보를 수신하는 GPS 수신부, 상기 GPS 수신부를 통해 수신되는 차량의 위치정보에 기반하여 차간거리 정보, 위험구간정보, 지연 상황정보 중 적어도 하나를 포함하는 차량 운행정보를 파악하는 운행정보 파악부, 상기 운행정보 파악부에서 파 (뒷면에 계속)"}
{"patent_id": "10-2019-0164773", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 차량운행 현황 모니터링 시스템 및 그 구동방법에 관한 것으로, 보다 상세하게는 음성 인식 기능이 탑재된 차량운행 현황 모니터링 시스템 및 그 구동 방법에 관한 것이다."}
{"patent_id": "10-2019-0164773", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 광역시와 같은 대도시는 물론 지역 대도시를 중심으로 관할 지역의 버스 운행정보를 제공하는 버스정보시 스템(BIS, Bus Information System)이 구축되고 있다. 이러한 버스정보 시스템은, 운행되는 버스의 위치를 버스 정보센터에서 실시간 수집하여 정류장 도착 예상 시간·노선별 현 운행 버스 위치·뒤차와의 거리·환승 정보 등과 같은 교통정보로 가공하고, 가공된 교통정보를 각 정류장 안내기를 통해 제공하거나 인터넷망 등을 통해 개인 단말기 사용자에게 제공하는 시스템이다. 도 1은 종래의 버스정보시스템의 구성을 나타낸 예시도이다. 도 1을 참조하면, 종래의 버스정보시스템은, 버스 단말기, 정류장 안내 장치, 버스정보센터로 이루어진다. 버스에 구비되는 버스 단말기는 GPS 모듈로부터 해당 버스의 위치좌표, 구간속도 등을 획득하여 무선 인터 넷 망(예컨대, WCDMA 망, LTE 망 등)을 통해 버스정보센터에 송신한다. 버스정보센터는 버스들로부터 수신되는 버스들의 위치좌표에 기초하여 노선을 따라 이동하는 버스들의 이동 궤적을 파악한다. 버스정보센터는 이를 위하여 전자지도 및 전자지도 상에서의 버스노선들에 대한 네트워크 데 이터를 보유한다. 버스정보센터는 버스들의 이동 궤적을 바탕으로 정류장 도착 예상 시간, 노선별 운행 버 스 위치, 뒤차와의 거리, 환승 정보 등을 포함하는 교통정보를 생성한다. 버스정보센터는 생성한 교통정보를 정류장 안내 장치에 전송하여 각 정류장 안내 장치가 수신받은 교통정보를 승차 대기 중인 버스 이용자에게 안내할 수 있도록 한다. 한편 버스정보센터는 생성한 교통정보를 사용자 단말에 제공함으로써, 사용자는 사용자 단말을 통 하여 원하는 버스 또는 버스정류장의 교통정보를 확인할 수 있다. 종래의 버스정보시스템에서는 버스 단말기가 무선 인터넷 망을 통하여 버스의 위치좌표 등을 송신하기 때문 에, 버스 단말기마다 무선 인터넷 서비스(예컨대, SKT, KT LGU+ 등 이동통신 사업자가 제공하는 무선 인터 넷 서비스)를 가입해야 하며, 이를 위한 고가의 통신수단이 요구된다. 따라서 버스 단말기마다 매월 작게는 5천원 내지 많게는 수만원에 이르는 통신 요금이 발생하게된다. 또한 종래의 버스정보시스템에서는 버스정보센터가 전자지도 및 전자지도 상에서의 버스노선들에 대한 네트 워크 데이터를 보유하여야 한다. 이러한 버스노선 네트워크 데이터는 현장 실사 및 조사를 통해서 버스정류장 및 각 버스의 노선정보를 수집하여 만들어진다. 버스노선 네트워크 데이터가 만들어져 있지 않은 지역에 버스정보시스템을 구축하기 위해서는 버스정류장 및 각 버스의 노선정보를 일일이 수집하여 버스노선 네트워크 데이터를 만들어야 하는데, 이를 위한 많은 시간과 비용 이 소요된다. 또한 버스의 노선정보는 수시로 변경되거나 추가될 수 있는데, 이것이 버스노선 네트워크 데이터에 그때그때 반 영되지 못하여 실제와 다른 정확하지 못한 교통 정보가 생성되기도 한다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2001-0036842 A (특허문헌 0002) KR 10-2018-0105516 A (특허문헌 0003) KR 20-0375351 B1 (특허문헌 0004) KR 20-0361115 B1"}
{"patent_id": "10-2019-0164773", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이 같은 기술적 배경에서 도출된 것으로, 버스를 운전하는 운전기사에게 앞뒤 차량 간격 상태 정보뿐 아니라 앞뒤 차량의 현 위치 정보, 운행 상황 정보를 음성 형태로 통보해줄 수 있는 차량운행 현황 모니터링 시 스템 및 그 구동방법을 제공함에 그 목적이 있다. 또한, 승객의 음성을 인식하여 탑승 인원을 파악함으로써, 복수 승객에 대한 운임 결제를 자체적으로 파악하여 수행함으로써 안전 운전에 기여할 수 있는 차량운행 현황 모니터링 시스템 및 그 구동방법을 제공하고자 한다."}
{"patent_id": "10-2019-0164773", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 과제를 달성하기 위한 본 발명은 다음과 같은 구성을 포함한다. 즉 본 발명의 일 실시예에 따른 차량운행 현황 모니터링 시스템은 실시간으로 GPS 위치 정보를 수신하는 GPS 수 신부, 상기 GPS 수신부를 통해 수신되는 차량의 위치정보에 기반하여 차간거리 정보, 위험구간정보, 지연상황정 보 중 적어도 하나를 포함하는 차량 운행정보를 파악하는 운행정보 파악부, 상기 운행정보 파악부에서 파악되는 차량 운행정보를 음성으로 출력하는 음성 출력부, 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 통신 을 수행하는 통신부 및 상기 통신부를 통해 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 상기 운행 정보 파악부에서 파악된 차량 운행정보를 교환하는 정보 교환부를 포함하는 것을 특징으로 한다. 한편, 차량운행 현황 모니터링 시스템의 구동방법은 운행정보 파악부가 실시간으로 GPS 위치 정보를 수신하는 GPS 수신부를 통해 수신되는 차량의 위치정보에 기반하여 차간거리 정보, 위험구간정보, 지연상황정보 중 적어 도 하나를 포함하는 차량 운행정보를 파악하는 단계, 음성 출력부가 상기 파악되는 차량 운행정보를 음성으로 출력하는 단계 및 정보 교환부가 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 통신을 수행하는 통신 부를 통해 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 상기 파악된 차량 운행정보를 교환하는 단계 를 포함한다."}
{"patent_id": "10-2019-0164773", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 버스를 운전하는 운전기사에게 앞뒤 차량 간격 상태 정보뿐 아니라 앞뒤 차량의 현 위치 정 보, 운행 상황 정보를 음성 형태로 통보해줄 수 있어 차량 간 운행 간격을 보다 균등하게 유지할 수 있는 차량 운행 현황 모니터링 시스템 및 그 구동방법을 제공할 수 있는 효과가 도출된다. 또한, 승객의 음성을 인식하여 탑승 인원을 파악함으로써, 복수 승객에 대한 운임 결제를 자체적으로 파악하여 수행함으로써 안전 운전에 기여할 수 있는 차량운행 현황 모니터링 시스템 및 그 구동방법을 제공할 수 있다."}
{"patent_id": "10-2019-0164773", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에서 사용되는 기술적 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려 는 의도가 아님을 유의해야 한다. 또한, 본 발명에서 사용되는 기술적 용어는 본 발명에서 특별히 다른 의미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 의미로해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명한다. 도 2 는 본 발명의 일 실시예에 따른 차량운행 현황 모니터링 시스템의 구성을 도시한 블록도이다. 일 실시예에 따른 차량운행 현황 모니터링 시스템은 버스 차량에 구비되어 결제 기능을 수행하는 버스 단말과 연동하여 동작한다. 또한 차량 운행 현황 모니터링 시스템은 기존의 버스 운행정보를 제공하는 버스정보시 스템(BIS, Bus Information System) 기능을 기본적으로 수행할 수 있도록 구현된다. 즉 일 실시예에 따른 차량 운행 현황 모니터링 시스템은 GPS원리(기존 버스 단말기 시스템: 앞차, 뒤차의 간격 상태만 표시)를 이용한 차량 위치 파악기술과 무선통신 기술을 기반으로 실시간 차량의 위치, 상태를 포함하는 운행정보 일체를 차량 운행 기사가 쉽게 파악할 수 있도록 한다. 차량 운행 기사에게 앞, 뒤 차량의 운행 정보를 실시간으로 제공해주고, 화면을 보면서 대화를 할 수 있도록 음 성 인식 기술을 적용하여 소통의 정확도를 향상시키고, 추가적으로 졸음 운전 예방에도 기여할 수 있다. 기존 버스 단말기 시스템에 앞차, 뒤차의 간격 상태만 표시되는 것에 비해 새로운 앱이 실시된 단말기 즉 본 발 명의 일 실시예에 따른 차량 운행 현황 모니터링 시스템은 음성인식 기술과 인공지능 엔진을 이용한 AI 비서 기 능을 추가하여 실제 운행 중 좁혀질 때 이를 경보 신호로 표시할 수 있다. 일 실시예에 따른 차량 운행 현황 모니터링 시스템은 앞차 또는 뒤차 간의 돌발상황정보, 차 내 승객 돌발정보, 내부/외부요인에 따른 지연상황정보를 AI 음성 서비스로 확인하는 것이 가능하다. 뿐만 아니라 앞차 또는 뒤차 내에서의 상황을 직접 운행 기사가 소지하는 사용자 단말에서 확인 가능하도록 함 으로써 보다 정확하게 앞차 또는 뒤차의 상황을 파악할 수 있다. 예를 들어 운행 회사 측 스케줄에 따라 정한 배차 간격이 5,6분이라고 했을 때 실제 차량 간격이 1,2분일 경우 에는 적색경보로 표시하고, 3,4분으로 좁혀질 경우에는 황색경보로 표시하며, 5,6분 간격이 될 경우에는 녹색경 보로 표시하고, 5,6분 초과시에는 지체 알림 경보로 표시하거나, 또는 배차 간격이 지체되었음을 알리는 내용의 음성 메시지를 출력할 수 있다. 추가적인 양상에 있어서 일 실시예에 따른 차량 운행 현황 모니터링 시스템은 정류장에 구비되는 정류장 안내장치와 통신을 더 수행할 수 있다. 운행 현황 모니터링 시스템은 정류장의 정류장 안내장치로부터 해당 차량의 식별 정보 입력이 감지되면 그 정류장에 도달 예정인 버스의 운행 기사에게 정류장 안내장치가 설치된 정류장에서 승객 탑승 예정임을 알려준 다. 이때 차량의 식별 번호 입력이라 함은 승객이 정류장에 구비되는 정류장 안내 장치에 자신이 탑승하기 원하는 버스 번호를 입력하는 것일 수 있다. 예를 들어 터치스크린 방식으로 원하는 버스 번호를 입력할 수 있다. 정류장 안내 장치는 승객이 대기중인 정류장에 가장 먼저 도달 예정인 차량의 운행 현황 모니터링 시스템 으로 승객 탑승 예정임을 알려준다. 나아가 승객이 버스 정류장에 구비되는 정류장 안내장치를 통해 자신이 도달하기 원하는 목적지 정류장 정보를 입력하면, 승객이 차량의 식별 정보 입력한 정류장에서 목적지까지가 운행 노선에 포함되는 적어도 하나의 버스 에 탑재되는 운행 현황 모니터링 시스템으로 탑승 예정 승객이 다음 정류장에 존재함을 알릴 수 있다. 그러면 운행 기사는 어떤 정류장에 해당 차량의 탑승을 원하는 승객이 위치하고 있음을 미리 파악할 수 있다. 이에 따라 운행 기사가 승객을 파악하지 못하고 무정차 하는 상황을 방지할 수 있다. 도 2 에서 알 수 있듯이, 일 실시예에 따른 차량 운행 현황 모니터링 시스템은 GPS 수신부, 통신부 , 운행정보 파악부, 정보 교환부, 영상 전송부, 음성 출력부, 음성 인식부 및 주행 이력 모니터링부를 포함한다. GPS 수신부는 실시간으로 위성으로부터 좌표형식의 GPS 위치 정보를 수신한다. 운행정보 파악부는 GPS 수신부를 통해 수신되는 차량의 위치정보에 기반하여 차간거리 정보, 위험구 간정보, 지연상황정보 중 적어도 하나를 포함하는 차량 운행정보를 파악한다. 음성 출력부는 운행정보 파악부에서 파악되는 차량 운행정보를 음성으로 출력한다. 음성 출력부(16 0)는 인공지능 모듈을 포함하여 구성된다. 일 실시예에 있어서 음성 출력부는 차간거리 정보, 위험구간정 보, 지연상황정보, 앞뒤 배차 차량의 운행 상황을 음성으로 출력할 수 있다. 통신부는 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 통신을 수행한다. 일 실시예에 있어서 통신부는 무선 통신을 지원하기 위한 이동통신 모듈을 모두 포함할 수 있다. 이동통신 모듈은, 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EVDO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE- A(Long Term Evolution-Advanced) 등)에 따라 구축된 통신망 상에서 기지국 및 외부의 단말 즉 다른 차량에 탑 재되는 차량운행 현황 모니터링 시스템 중 적어도 하나와 무선 신호를 송수신한다. 그러나 이에 한정되는 것은 아니다. 수 내지 수십 키로 이내의 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 무선 통신을 수행할 수 있는 기술적 구성은 모두 포괄하도록 해석된다. 일 실시예에 있어서 통신부는 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 통신을 수행하여 영 상 데이터, 또는 운행 정보의 교환이 가능하고 나아가 운행 기사 간에 음성 형태로 정보 교환이 가능하도록 지 원한다. 정보 교환부는 통신부를 통해 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 운행정보 파악 부에서 파악된 차량 운행정보를 교환한다. 특히 앞뒤 배차 차량에 탑재되는 차량운행 현황 모니터링 시스 템과 통신을 수행한다. 본 발명의 일 양상에 따르면, 마이크로 입력되는 차량 운행 기사의 음성을 인식하여 차량 운행정보 요청 음성을 파악하는 음성 인식부를 더 포함한다. 본 양상에 따라 음성 출력부는 운행정보 파악부에서 음성 인식부로 인식되는 운행정보 요청 음 성에 따라 운행정보를 파악하여 음성으로 출력하는 것을 특징으로 한다. 즉, 차량 운행 기사는 육성으로 알고 싶은 정보를 요청할 수 있다. 음성 인식부는 차량 운행 기사의 음성 을 인식하고, 차량 운행 기사가 구체적으로 원하는 정보 유형을 파악한다. 예를 들어 운행 기사는 \"앞차의 현 위치 알려줘\", \"뒤차의 혼잡 정도 알려줘\" 라고 음성으로 차량 운행정보 요 청을 입력할 수 있다. 그러면 음성 출력부는 차량 운행정보를 파악하여 \"앞차 1035호의 현 위치는 양재역 정거장 300m 전입니다\", \"혼잡한 상태입니다\"와 같이 음성으로 그 대답을 출력한다. 이 같은 양상에 따라 차량 운행 기사가 운전중에도 음성으로 원하는 정보 요청이 가능하고, 그에 대한 응답 역 시 음성 형태로 제공받는 것이 가능하기 때문에 차량 운행중 단말 조작을 최소화하여 안전 사고의 발생을 현저 히 줄일 수 있는 효과가 도출된다. 또한 본 발명의 특징적인 양상에 따르면, 음성 인식부는 마이크로 입력되는 승객의 음성을 인식하여 탑승 인원 정보를 더 파악하는 것을 특징으로 한다. 예를 들어 차량 운행 기사가 간단하게 특정 버튼을 터치하거나, 승객의 결제 요청이 있음을 예측 가능한 상황에 도래한 경우에 승객의 음성을 인식할 수 있다. 또는 차량이 정차 후 앞문이 열린 상태에서 혹은 앞문이 닫힌 후 수초 이내에 음성이 인식되면 승객 음성으로 인식할 수 있다. 그러나 이에 한정되는 것은 아니고 다양한 변형예들을 포괄하도록 해석된다. 기존에는 어른 1명 청소년 1명, 또는 어른 2명과 같이 2인 이상의 승객이 탑승하고 하나의 카드로 결제하고자 하는 경우에 일일이 운전기사가 수동으로 결제 인원 정보를 입력해야 했다. 그러나 일 실시예에 따른 차량운행 현황 모니터링 시스템은 음성 인식부가 마이크로 입력되는 승객의 음성을 인식하여 자동으로 탑승 인원을 파악하고 결제를 수행할 수 있다. 일 예로 음성 인식부는 비접촉식 무선통신기술이 적용된 카드 단말기의 카드 접촉기와 동일한 방향에 탑재 된 마이크로 입력되는 승객의 음성을 인식하여 파싱한다. 그리고 '어른', '초등학생', '청소년'과 같은 단어와숫자의 조합이 인식될 경우에 기계적으로 단어 추출기술을 통해 탑승 인원 정보를 파악하도록 구현된다. 음성 인식부는 자동적 수단에 의하여 음성으로부터 언어적 의미 내용을 식별하는 것으로 구체적으로 입력 되는 음성 파형을 분석하여 단어나 단어열을 식별하고 의미를 추출할 수 있다. 일 실시예에 있어서 음성 인식부는 크게 음성 분석, 음소 인식, 단어 인식, 문장 해석, 의미 추출의 기능 을 수행할 수 있다. 그러나 이에 한정되는 것은 아니다. 본 발명의 또 다른 양상에 따라 일 실시예에 따른 차량 운행 현황 모니터링 시스템은 운임 결제를 위해 비 접촉식 무선통신기술로 경로(敬老) 우대 카드가 인식되면, 차량에 탑재된 스피커로 기저장된 경로 안내 메시지 를 출력한다. 이때 경로우대카드는 노인들이 지하철을 무료로 탈수 있도록 발급된 카드에 충전을 하여 버스 승차시에 이용하 는 것일 수 있다. 즉 노인 승차 시에 카드 단말기에 경로우대카드를 대면 바로 경로 관련 방송멘트가 재생된다. 경로 관련 방송 멘트는 예를 들어 \"노약자 분들은 버스가 완전히 정차하였을 때 일어나시기 바랍니다\"와 같은 내용의 방송 멘트 를 포함한다. 카드를 댈 경우 외에도 음성으로 ‘경로’라고 인식되면 바로 경로 방송이 출력될 수도 있다. 차량 운행 기사가 차량 내 경로 관련 방송 멘트가 출력되어야 한다고 판단되면 해당 단어(경로)를 언급함으로써 방송 멘트가 출력 되도록 조절할 수 있다. 본 발명의 또 다른 양상에 따르면 정보 교환부는 다른 차량에 탑재되는 카메라로 촬영된 영상을 수신하고, 차량운행 현황 모니터링 시스템이 정보 교환부로 수신되는 영상을 차량 운행중인 차량 운행 기사가 소지하는 사용자 단말로 전송한다. 이때 정보 교환부가 수신하는 다른 차량에 탑재되는 카메라로 촬영된 영상은 그 차량에 탑재되는 차량운행 현황 모니터링 시스템으로부터 수신되는 것일 수 있다. 일 실시예에 따른 차량운행 현황 모니터링 시스템은 보조 모니터를 구비한다. 보조 모니터는 차량운행 현 황 모니터링 시스템에서 제공할 수 있는 다양한 정보들을 가시적으로 표시한다. 먼저, 차량운행 현황 모니터링 시스템은 차량 운행 시작 전에 운행 기사 터치에 의해 운행 시작을 감지한 다. 그리고 운행 기사의 식별 정보를 입력받는다. 식별정보는 운행사로부터 발급받은 운행 기사마다 할당된 사 번이거나 또는 차량 운행 기사가 소지하는 전화번호일 수 있다. 운행기사 식별정보에 따라 해당 운행 기사에게 운행 할당된 노선을 파악한다. 예를 들어 그 시간에 식별된 운행 기사에게 할당된 노선이 90번 노선이면, 해당 노선의 정거장 간 거리를 분석한다. 아울러 배차정보에 따라 동일한 노선의 전후에 배차된 차량 정보를 파악한다. 그리고 출퇴근 시간대 여부, 평일 /주말 여부와 같은 교통량 예측 정보, 신호등 상태를 반영하여 이상적인 배차간격을 산출하여 운행 기사에게 제 공해준다. 그리고 산출된 이상적인 배차 간격을 반영하여 운행 기사로부터 앞차 또는 뒤차의 위치 정보 요청이 있을 때 앞 차, 뒤차에 배차된 차량과의 운행 간격을 시간, 거리 단위로 정보 제공해 줄 수 있다. 이후에 차량이 정거장에 정차할 때마다 앞 뒤차와의 간격을 유지할 수 있도록 앞차 또는 뒤차와의 배차 간격 정 보를 제공해준다. 일 실시예에 따른 차량운행 현황 모니터링 시스템은 정보 교환부로 수신되는 영상을 차량 운행중인 차량 운행 기사가 소지하는 사용자 단말로 제공함으로써 운전자가 소지하는 사용자 단말의 영상 모니터링을 통 해 안심캠 기능을 더 제공할 수 있다. 정보 교환부는 다른 차량에 탑재되는 카메라로 촬영된 영상을 수신하고, 영상 전송부는 정보 교환부 로 수신되는 영상을 차량 운행중인 차량 운행 기사가 소지하는 사용자 단말로 전송한다. 즉, 앞차 뒤차의 승객 탑승 상태나, 차량의 위치 정보를 포함하는 현 운행 상황과 같은 정보를 파악할 수 있도 록 사용자 단말의 영상 모니터링을 통해 제공하는 것이 가능하다. 예를 들어 버스 간격이 벌어졌을 경우에 많은 승객이 무리해서 버스에 탑승해야하는 경우가 발생할 수 있다. 그 러면 탑승 시간이 지체하게 됨으로써 차간 간격이 더 벌어지는 악순환이 반복된다. 이 경우에 운행 기사들은 실시간으로 운행 노선 상의 앞차, 뒤차의 상황을 모니터링하고 대화를 통해 소통함으 로써 심리적으로 불안한 상태로 차량을 운행하는 상황을 최소화할 수 있다. 이에 따라 안전사고의 발생을 줄일 수 있다. 또한 승객들에게 정해진 시간 간격의 배차 서비스를 제공할 수 있다. 뿐만 아니라 운행 기사들이 차량 운행 중에 졸음이 오거나, 비상사태가 발생한 경우에 앞차, 뒤차의 운행 기사 와 대화를 시도하거나, 음악을 재생시킴으로써 비상 상황에 대한 신속한 대처가 가능하고 교통사고를 예방하는 효과를 볼 수 있다. 본 발명의 추가적인 양상에 따르면 일 실시예에 따른 차량운행 현황 모니터링 시스템은 차량 운행시에 주 행 이력을 모니터링하여 주행 이력 데이터를 취합하고, 차량의 운행이 종료되는 경우에 운행 기사 식별 정보와 취합된 주행 이력 데이터를 차량 운행사 서버로 전송하는 주행 이력 모니터링부를 더 포함한다. 주행 이력 모니터링부는 차량 운행시에 주행 이력을 모니터링하고 취합한다. 구체적으로 주행 이력 모니터 링부는 차량의 주행 노선에 포함되는 정거장마다 차량의 정차 시각을 파악하고 계획된 시각과 실제 정차 시각 간 오차 범위가 적을수록 차량 운전자에게 높은 점수를 부여하는 평가를 한다. 즉, 설정된 시각에 맞춰 차 량 운행을 완수한 차량 기사에게 높은 점수를 부여함으로써 차량간 간격 유지에 도움을 줄수 있다. 주행 이력 모니터링부는 정해진 노선을 따라 운행을 종료한 경우에 취합된 주행 이력 데이터를 차량 운행 사 서버로 전송한다. 주행 이력 데이터는 급정거, 급출발, 과속과 같은 전반적인 차량 주행 정보를 포함한다. 나아가 주행 이력 모니터링부는 음성 인식부로 운행 기사의 폭언이 인식되는 경우 이를 모니터링 정 보에 포함시켜서 패널티를 적용하도록 구현되는 것도 가능하다. 차량 운행사 서버는 주행 이력 모니터링부로부터 운행 기사 식별 정보와 함께 수신되는 주행 이력 데이터 를 저장, 관리함으로써 운행 기사 근무 평가에 활용할 수 있다. 그리고 운행 기사가 원할 경우에 일별로 운행 상태 평가 정보를 제공하여 스스로 일일 점검을 할 수 있도록 할 수 있다. 나아가 운행 기사가 직접 자신의 운 전 성향을 분석할 수 있도록 제공함으로써 궁극적으로 안전 운전 습관을 들이도록 유도할 수 있다. 주행 이력 모니터링부는 주행하는 동안에 취합된 운행 정보에 기반하여 노선 운행이 종료된 후에 해당 노 선 전체에 대해 적/황/녹색/지체등으로 평균적 평가가 가능하다. 차량 운행사 서버는 주행 이력 모니터링부 로부터 노선 전체에 대한 평균적 평가를 수신하여 운행 기사의 운행 평가 자료로 활용한다. 차량 운행사 서버는 운행 기사의 운행 평가 자료에 따라 포인트를 부여하거나 차감하거나, 인사 고가를 평가하 는 자료로 활용할 수 있다. 도 3 은 본 발명의 일 실시예에 따른 차량운행 현황 모니터링 시스템의 구동방법을 도시한 흐름도이다. 먼저, 차량운행 현황 모니터링 시스템은 차량 운행 시작 전에 운행 기사 터치에 의해 운행 시작을 감지한 다(S300). 그리고 운행 기사의 식별 정보를 입력받는다. 식별정보는 운행사로부터 발급받은 운행 기사마다 할당된 사번이 거나 또는 차량 운행 기사가 소지하는 전화번호일 수 있다(S310). 운행기사 식별정보에 따라 해당 운행 기사에게 운행 할당된 노선을 파악한다. 예를 들어 그 시간에 식별된 운행 기사에게 할당된 노선이 90번 노선이면, 해당 노선의 정거장 간 거리를 분석한다. 그리고 운행정보 파악부가 실시간으로 GPS 위치 정보를 수신하는 GPS 수신부를 통해 수신되는 차량의 위치정보 에 기반하여 차간거리 정보, 위험구간정보, 지연상황정보 중 적어도 하나를 포함하는 차량 운행정보를 파악한다 (S320). 이후에 차량 운행 기사로부터 차량 운행정보 요청이 수신되면(S330), 음성 출력부가 파악되는 차량 운행정보를 음성으로 출력한다(S336). 특히 음성 인식부가 마이크로 입력되는 차량 운행 기사의 음성을 인식하여 차량 운행정보 요청 음성을 파악하고, 운행정보 파악부에서 음성 인식부로 인식되는 운행정보 요청 음성에 따라 차량 운행정보를 파악하여 음성으로 출력한다. 예를 들어 운행 기사는 \"앞차의 현 위치 알려줘\", \"뒤차의 혼잡 정도 알려줘\"라고 음성으로 차량 운행정보 요청 을 입력할 수 있다. 그러면 음성 출력부는 차량 운행정보를 파악하여 \"앞차 1035호의 현 위치는 양재역 정 거장 300m 전입니다\", 또는 \"앞 차의 차량 내부가 혼잡한 상태입니다\", 또는 \"뒤차의 좌석에 여유있는 상태입니 다\" 와 같이 차량 운행 정보를 음성으로 출력해줄 수 있다. 이에 따라 운전 중에도 별도의 부가 조작 없이 다른 차량들의 상황을 파악하는 것이 가능하다. 이 같은 양상에 따라 차량 운행 기사가 운전중에도 음성으로 원하는 정보 요청이 가능하고, 그에 대한 응답 역 시 음성 형태로 제공받는 것이 가능하기 때문에 차량 운행중 단말 조작을 최소화하여 안전 사고의 발생을 현저 히 줄일 수 있는 효과가 도출된다. 일 실시예에 있어서 차량 운행 정보를 음성으로 출력하는 것 이외에 차량 운행 현황정보 모니터링 시스템에 구 비되는 모니터상에 가시적인 데이터로 더 출력하는 것도 가능하다. 본 발명의 일 양상에 있어서 정보 교환부는 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 통신을 수 행하는 통신부를 통해 다른 차량에 탑재되는 차량운행 현황 모니터링 시스템과 파악된 차량 운행정보를 교환한 다(S333). 이후에, 마이크로 입력되는 승객 음성을 인식하여(S340), 탑승 인원 정보를 더 파악할 수 있다(S345). 차량 운행 기사가 간단하게 특정 버튼을 터치하거나, 승객의 결제 요청이 있음을 예측 가능한 상황에 도래한 경 우에 승객의 음성을 인식할 수 있다. 또는 차량이 정차 후 앞문이 열린 상태에서 혹은 앞문이 닫힌 후 수초 이내에 음성이 인식되면 승객 음성으로 인식할 수 있다. 그러나 이에 한정되는 것은 아니고 다양한 변형예들을 포괄하도록 해석된다. 기존에는 어른 1명 청소년 1명, 또는 어른 2명과 같이 2인 이상의 승객이 탑승하고 하나의 카드로 결제하고자 하는 경우에 일일이 운전 기사가 수동으로 결제 인원 정보를 입력해야 했다. 그러나 일 실시예에 따른 차량운행 현황 모니터링 시스템의 구동방법은 마이크로 입력되는 승객의 음성을 인식 하여 자동으로 탑승 인원을 파악하고 결제를 수행할 수 있다. 안심 캠 모드 실행시에는(S350) 다른 차량에 탑재되는 카메라로 촬영된 영상을 수신하고, 영상 전송부가 정보 교환부로 수신되는 영상을 차량 운행중인 차량 운행 기사가 소지하는 사용자 단말로 전송해준다(S355). 일 실시예에 따른 차량 운행 현황 모니터링 시스템의 구동방법은 정보 교환부로 수신되는 영상을 차량 운행중인 차량 운행 기사가 소지하는 사용자 단말로 제공함으로써 운전자가 소지하는 사용자 단말의 영상 모니터링을 통 해 안심 캠 기능을 더 제공할 수 있다. 즉, 앞차 뒤차의 승객 탑승 상태나, 차량의 위치 정보를 포함하는 현 운행 상황과 같은 정보를 파악할 수 있도 록 사용자 단말의 영상 모니터링을 통해 제공하는 것이 가능하다. 그리고 비접촉식 무선통신기술로 경로(敬老) 우대 카드가 인식되면(S360), 차량에 탑재된 스피커로 기저장된 경 로 안내 메시지를 출력한다(S365). 이때 경로 우대 카드는 노인들이 지하철을 무료로 탈수 있도록 발급된 카드에 충전을 하여 버스 승차시에 이용 하는 것일 수 있다. 즉 노인 승차 시에 카드 단말기에 경로우대카드를 대면 바로 경로 관련 방송멘트가 재생된다. 경로 관련 방송 멘트는 예를 들어 \"노약자 분들은 버스가 완전히 정차하였을 때 일어나시기 바랍니다\"와 같은 내용의 방송 멘트 를 포함한다. 카드를 댈 경우 외에도 음성으로 ‘경로’라고 인식되면 바로 경로 방송이 출력될 수도 있다. 차량 운행 기사가 차량 내 경로 관련 방송 멘트가 출력되어야 한다고 판단되면 해당 단어(경로)를 언급함으로써 방송 멘트가 출력 되도록 조절할 수 있다. 그리고 주행 이력 모니터링부가 차량 운행시에 주행 이력을 모니터링하여 주행 이력 데이터를 취합하고, 차량의 운행이 종료되는 경우에(S370) 운행 기사 식별 정보와 상기 취합된 주행 이력 데이터를 차량 운행사 서버로 전 송한다(S375). 구체적으로 주행 이력 모니터링부는 차량의 주행 노선에 포함되는 정거장마다 차량의 정차 시각을 파악하고 계 획된 시각과 실제 정차 시각 간 오차 범위가 적을수록 차량 운전자에게 높은 점수를 부여하는 평가를 한다. 즉, 설정된 시각에 맞춰 차량 운행을 완수한 차량 기사에게 높은 점수를 부여함으로써 차량간 간격 유지에 도움 을 줄수 있다. 그리고 주행 이력 모니터링부는 정해진 노선을 따라 운행을 종료한 경우에 취합된 주행 이력 데이터를 차량 운 행사 서버로 전송한다. 주행 이력 데이터는 급정거, 급출발, 과속과 같은 전반적인 차량 주행 정보를 포함한다. 나아가 주행 이력 모니터링부는 음성 인식부로 운행 기사의 폭언이 인식되는 경우 이를 모니터링 정보에 포함시 켜서 패널티를 적용하도록 구현되는 것도 가능하다. 차량 운행사 서버는 주행 이력 모니터링부로부터 운행 기사 식별 정보와 함께 수신되는 주행 이력 데이터를 저 장, 관리함으로써 운행 기사 근무 평가에 활용할 수 있다. 그리고 운행 기사가 원할 경우에 일별로 운행 상태 평가 정보를 제공하여 스스로 일일 점검을 할 수 있도록 할 수 있다. 나아가 운행 기사가 직접 자신의 운전 성향을 분석할 수 있도록 제공함으로써 궁극적으로 안전 운전 습관을 들이도록 유도할 수 있다. 차량 운행사 서버는 주행 이력 모니터링부로부터 노선 전체에 대한 평균적 평가를 수신하여 운행 기사의 운행 평가 자료로 활용한다. 차량 운행사 서버는 운행 기사의 운행 평가 자료에 따라 운행 기사에게 포인트를 부여하 거나 차감하거나, 인사 고가를 평가하는 자료로 활용할 수 있다. 전술한 방법은 애플리케이션으로 구현되거나 다양한 컴퓨터 구성요소를 통하여 수행될 수 있는 프로그램 명령어 의 형태로 구현되어 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록 매체는 프 로그램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능한 기록 매체에 기록되는 프로그램 명령어는 본 발명을 위하여 특별히 설계되고 구성된 것들이거니와 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능한 기록 매체의 예에는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD- ROM, DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨 어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사 용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 상기 하드웨어 장치는 본 발명에 따른 처 리를 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 이상에서는 실시예들을 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구범위에 기 재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있 음을 이해할 수 있을 것이다."}
{"patent_id": "10-2019-0164773", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 버스정보시스템의 구성을 나타낸 예시도, 도 2 는 본 발명의 일 실시예에 따른 차량운행 현황 모니터링 시스템의 구성을 도시한 블록도, 도 3 은 본 발명의 일 실시예에 따른 차량운행 현황 모니터링 시스템의 구동방법을 도시한 흐름도이다."}
