{"patent_id": "10-2022-0138210", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0058225", "출원번호": "10-2022-0138210", "발명의 명칭": "콘텐츠 연동 재활장치", "출원인": "주식회사 유니브이알", "발명자": "곽태진"}}
{"patent_id": "10-2022-0138210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "리컴번트(Recumbent) 타입으로 형성되는 재활기기부(100);상기 재활기기부(100)를 사용하는 사용자 계정의 로그인을 통해 데이터가 공유되도록 하여, 사용자별 데이터를획득하여 저장하고, 상기 재활기기부(100)와 연동되는 콘텐츠가 구동되도록 하는 통합관리부(200);상기 재활기기부(100)와 연동되록 하는 연동부(310)와 사용자별로 계정이 생성되도록 하는 계정생성부(320)를포함하는 제어단말부(300);를 포함하는 것을 특징으로 하는 콘텐츠 연동 재활장치."}
{"patent_id": "10-2022-0138210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 재활기기부는, 페달링 센서가 내장되는 페달(110);상기 페달(110)과 연동되어 페달(110)의 부하를 조절하는 제어패널(120);상기 페달(110)의 일측에 형성되는 안장(130);상기 안장(130)의 양측에 각각 형성되는 한쌍의 컨트롤러(140);상기 통합관리부(200)와 무선 또는 유선으로 연동되는 통신부(150); 및사용자의 운동강도 데이터를 측정하는 운동강도측정부(160);를 포함하는 것을 특징으로 하는 콘텐츠 연동 재활장치."}
{"patent_id": "10-2022-0138210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 컨트롤러(140)는,사용자의 심박수를 측정하는 심박측정부(141)사용자가 컨트롤러를 파지하였는지 여부를 판단하는 제1감지부(142) 및 제2감지부(143)를 포함하는 것을 특징으로 하는 콘텐츠 연동 재활장치."}
{"patent_id": "10-2022-0138210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "에 있어서,상기 프로세서부(210)는, 운동강도측정부(160)에서 측정된 단계별 부하값과, 선형 회귀 분석을 통해, 페달(110)의 회전수에 따른 토크를 추정하는 것을 특징으로 하는 콘텐츠 연동 재활장치."}
{"patent_id": "10-2022-0138210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서,상기 로컬장치(230)는 통합관리부(200)의 근거리 주변에 위치되는 재활기기부(100) 및 측정부(400)의 데이터가로컬서버를 통해 공유되도록 하여, 재활기기부(100)의 통합 관리가 이루어지도록 하고, 제어단말부(300)와 연동되어 제어단말부(300)를 통해 원격으로 통합관리부(200)를 제어하거나, 재활기기부(100)의 운동강도 등을 제어단말부(300)를 통해 원격으로 제어하도록 구성되는 것을 특징으로 하는 콘텐츠 연동 재활장치."}
{"patent_id": "10-2022-0138210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 4에 있어서,상기 판단부(250)는, 제1감지부와 제2감지부의 신호에 따라 제1위험신호를 출력하는 제1알림학습모델을 생성하고, 심박측정부(141)의신호에 따라 제2위험신호를 출력하는 제2알림학습모델을 생성하는 인공지능모듈을 포함하는 것을 특징으로 하는콘텐츠 연동 재활장치."}
{"patent_id": "10-2022-0138210", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 연동부(310)는 재활기기부(100)와 제어단말부(300)가 블루투스 방식에 의해서 연동이 이루어질 때, 재활기기부(100)와 제어단말부(300)간 데이터 전송 중 발생한 오류의 존재 여부를 확인할 수 있도록 하는 오류검출부(311)를 포함하는 것을 특징으로 하는 콘텐츠 연동 재활장치."}
{"patent_id": "10-2022-0138210", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 콘텐츠 연동 재활장치에 관한 것으로, 더욱 상세하게는 재활훈련에 사용되는 재활기기부와, 사용자에 게 콘텐츠를 제공하고 재활기기부를 관리하는 관리부를 포함하여, 사용자에게 재활훈련에 대한 강력한 동기를 부 여하고 재활훈련이 보다 효율적으로 이루어질 수 있도록 하는 콘텐츠 연동 재활장치에 관한 것이다. 이를 위해 본 발명은 상기한 목적을 달성하기 위해 본 발명의 콘텐츠 연동 재활장치는, 재활환자의 재활이 용이 하게 이루어지도록 리컴번트(Recumbent) 타입으로 형성되는 재활기기부; 상기 재활기기부를 사용하는 사용 자 계정의 로그인을 통해 데이터가 공유되도록 하여, 사용자별 데이터를 획득하여 저장하고, 상기 재활기기부와 연동되는 콘텐츠가 구동되도록 하는 통합관리부;재활기기부와 연동되록 하는 연동부와 사용자별로 계정이 생성되 도록 하는 계정생성부를 포함하는 제어단말부;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0138210", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 콘텐츠 연동 재활장치에 관한 것으로, 더욱 상세하게는 재활훈련에 사용되는 재활기기부와, 사용자에 게 콘텐츠를 제공하고 재활기기부를 관리하는 관리부를 포함하여, 사용자에게 재활훈련에 대한 강력한 동기를 부여하고 재활훈련이 보다 효율적으로 이루어질 수 있도록 하는 콘텐츠 연동 재활장치에 관한 것이다."}
{"patent_id": "10-2022-0138210", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "심혈관 질환은 병이 오래 지속되고 호전이 잘 안될 가능성이 높은 질병이다. 이러한 질병을 치료하기 위해, 관 동맥 풍선 성형술과 같은 다양한 시술이나 수술을 했다고 하더라도, 단기간에 심장기능을 정상으로 만들어주는 것은 아니므로, 환자들은 심혈관 재활 혹은 심장 재활을 상당한 기간 동안 받아야 한다. 즉. 심혈관/심장 재활이란 심장병을 지닌 환자들을 신체적, 정신적, 사회경제적, 직업적 수준을 적정 수준으로 회복, 증진, 유지시키는 과정을 말하며, 더 이상 심장질환의 진행을 막고 예방하는 프로그램으로 개개인의 특성 에 맞게 개별적으로 이루어진다. 이러한 심혈관/심장 재활 프로그램은 보통 4단계로 구분되며, 심근 경색 후 입원해 있는 급성기, 발병 후 4~6주 정도의 기간으로 심근경색 부위에 반흔이 생기게 되는 회복기, 운동을 통해 실제적으로 심장 재활 훈련을 하는훈련기, 훈련기가 끝날 때 운동 부하 검사를 통해 운동이나 작업에 대한 지침을 작성한 후 훈련기의 효과를 유 지하기 위한 유지기로 나누어진다. 다만, 이러한 심장재활 훈련은 현재 모두 의사의 처방 하에 병원 내에서 이루어지고 있어, 환자의 재활훈련 수 행의지가 현실적으로 높지 않아, 이러한 심장재활 훈련에 대한 온라인 의료/진료/환자 모니터링 서비스의 필요 성이 증대하게 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-1355506호 (2014.02.06. 공고) (특허문헌 0002) 대한민국 등록특허 제10-1301305호 (제2013.09.10. 공고) (특허문헌 0003) 대한민국 공개특허 제10-2016-0139960호 (제2016.12.07. 공개)"}
{"patent_id": "10-2022-0138210", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 바와 같은 제반 문제점을 해결하기 위해 안출된 것으로, 그 목적은 재활훈련을 실시하는 환자 들에게 콘텐츠 등을 통해 재활훈련에 흥미를 느끼도록 함으로써, 재활훈련에 강력한 동기가 부여될 수 있도록 하는 콘텐츠 연동 재활장치를 제공하는데 있다. 또한, 다른 목적으로는 재활훈련이 이루어지는 재활기기부와 재활기기부와 연동되어 사용자에게 콘텐츠를 제공 하는 통합관리부가 로컬서버를 통해 재활기기부 및 제어단말기와 연동되도록 하여, 사용자의 재활운동 데이터 등의 보안이 유지되도록 하는 콘텐츠 연동 재활장치를 제공하는데 있다. 또한, 재활운동시 발생될 수 있는 사용자의 낙상 사고 발생시 이를 자동으로 알려주고, 재활훈련 중에 재활환자 의 심박수 등을 측정하여 재활환자의 상태를 모니터링 할 수 있는 콘텐츠 연동 재활장치를 제공하는데 있다."}
{"patent_id": "10-2022-0138210", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위해 본 발명의 콘텐츠 연동 재활장치는, 재활환자의 재활이 용이하게 이루어지도록 리 컴번트(Recumbent) 타입으로 형성되는 재활기기부;상기 재활기기부를 사용하는 사용자 계정의 로그인 을 통해 데이터가 공유되도록 하여, 사용자별 데이터를 획득하여 저장하고, 상기 재활기기부와 연동되는 콘텐츠 가 구동되도록 하는 통합관리부;재활기기부와 연동되록 하는 연동부와 사용자별로 계정이 생성 되도록 하는 계정생성부를 포함하는 제어단말부;를 포함하는 것을 특징으로 한다. 또한, 상기 재활기기부는, 페달링 센서가 내장되는 페달; 상기 페달과 연동되어 페달의 부하를 조절하는 제어패널; 상기 페달의 일측에 형성되는 안장; 상기 안장의 양측에 각각 형성되 는 한쌍의 컨트롤러;상기 통합관리부와 무선 또는 유선으로 연동되는 통신부 및 사용자의 운동 강도 데이터를 측정하는 운동강도측정부를 포함하는 것을 특징으로 한다. 또한, 상기 컨트롤러는, 사용자의 심박수를 측정하는 심박측정부 사용자가 컨트롤러를 파지하였는지 여부를 판단하는 제1감지부 및 제2감지부를 포함하는 것을 특징으 로 한다.또한, 상기 통합관리부는, 페달 및 컨트롤러에 의해 조작되는 콘텐츠를 구동하는 프로세서부 ;상기 재활기기부의 상태 및 콘텐츠를 모니터링 하는 모니터링부;상기 재활기기부 및 제어 단말부에서 제공되는 데이터를 공유하는 로컬장치;사용자의 상태를 판단하는 판단부를 포함하는 것을 특징으로 한다. 또한, 상기 프로세서부는, 운동강도측정부에서 측정된 단계별 부하값과, 선형 회귀 분석을 통해, 페 달의 회전수에 따른 토크를 추정하는 것을 특징으로 한다. 또한, 상기 로컬장치는 통합관리부의 근거리 주변에 위치되는 재활기기부 및 측정부의 데 이터가 로컬서버를 통해 공유되도록 하여, 재활기기부의 통합 관리가 이루어지도록 하고, 제어단말부(30 0)와 연동되어 제어단말부를 통해 원격으로 통합관리부를 제어하거나, 재활기기부의 운동강도 등을 제어단말부를 통해 원격으로 제어할 수 있도록 구성되는 것을 특징으로 한다. 또한, 상기 판단부는, 제1감지부와 제2감지부의 신호에 따라 제1위험신호를 출력하는 제1알림학습모델을 생성하고, 심박측정부의 신호에 따라 제2위험신호를 출력하는 제2알림학습모델을 생성하는 인공지능모듈을 포함하는 것을 특징으로 한다. 또한, 상기 연동부는 재활기기부와 제어단말부가 블루투스 방식에 의해서 연동이 이루어질 때, 재활기기부와 제어단말부간 데이터 전송 중 발생한 오류의 존재 여부를 확인할 수 있도록 하는 오류 검출부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0138210", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 콘텐츠 연동 재활장치에 의하면, 재활환자들에게 재활훈련에 대한 동기 및 재미를 부여하여 재활훈련 이 효율적으로 이루어지도록 하는 효과가 있다. 또한, 재활훈련이 이루어지는 재활기기부와 재활기기부와 연동되어 사용자에게 콘텐츠를 제공하는 관리부가 로 컬서버를 통해 재활기기부 및 단말기와 연동되도록 하여, 사용자의 재활운동 데이터 등의 보안이 유지되도록 하 는 효과가 있다. 또한, 재활운동시 발생될 수 있는 사용자의 낙상 사고 발생시 이를 자동으로 알려주고, 재활훈련 중에 재활환자 의 심박수 등을 측정하여 재활환자의 상태를 모니터링 할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0138210", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 본 발명의 목적들, 다른 목적들, 특징들 및 이점들은 첨부된 도면과 관련된 이하의 바람직한 실시예들을 통해서 쉽게 이해될 것이다. 그러나 본 발명은 여기서 설명되는 실시예들에 한정되지 않고 다른 형태로 구체화 될 수도 있다. 오히려, 여기서 소개되는 실시예들은 개시된 내용이 철저하고 완전해질 수 있도록 그리고 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 여기에 설명되고 예시되는 실시예들은 그것의 상보적인 실시예들도 포함한다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 '포함한 다(comprise)' 및/또는 '포함하는(comprising)'은 언급된 구성요소는 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 이하, 도면을 참조하여 본 발명을 상세히 설명하도록 한다. 아래의 특정 실시예들을 기술하는데 있어서, 여러가 지의 특정적인 내용들은 발명을 더 구체적으로 설명하고 이해를 돕기 위해 작성되었다. 하지만 본 발명을 이해 할 수 있을 정도로 이 분야의 지식을 갖고 있는 자는 이러한 여러 가지의 특정적인 내용들이 없어도 사용될수 있다는 것을 인지할 수 있다. 어떤 경우에는, 발명을 기술하는데 있어서 흔히 알려졌으면서 발명과 크게 관련없 는 부분들은 본 발명을 설명하는데 있어 혼돈을 막기 위해 기술하지 않음을 미리 언급해 둔다. 도 1은 본 발명의 콘텐츠 연동 재활장치의 구성을 나타낸 도면, 도 2는 본 발명의 재활기기부의 구성을 나타낸 도면, 도 3은 본 발명의 컨트롤러, 통신부 및 운동강도측정부의 구성을 나타낸 블록도, 도 4는 본 발명의 통합 관리부의 구성을 나타낸 블록도, 도 5는 본 발명의 제어단말부의 구성을 나타낸 블록도이다. 도 1 내지 도 5에 도시된 바와 같이 본 발명의 콘텐츠 연동 재활장치(이하, 재활장치라 함)는 재활기기부 , 통합관리부 및 제어단말부를 포함할 수 있다. 재활기기부는 재활환자의 재활이 용이하게 이루어지도록 리컴번트(Recumbent) 타입으로 형성되는 것이 바 람직하며, 페달링 센서가 내장되는 페달, 페달과 연동되어 페달의 부하를 조절하는 제어패널 , 페달의 일측에 형성되는 안장, 안장의 양측에 각각 형성되는 한쌍의 컨트롤러, 통 합관리부와 무선 또는 유선으로 연동되는 통신부 및 사용자의 운동강도 데이터를 측정하는 운동강도 측정부를 포함할 수 있다. 페달은 재활기기부의 좌측과 우측에 각각 구비되어, 페달의 움직임에 따라 페달링 센서(미도 시)에서 답력값이 획득되고, 획득된 답력값이 유무선 통신을 통해 통합관리부로 전송 될 수 있다. 또한, 페달은 마그네틱 자력 등을 이용하여 페달의 회전강도를 단계별로 조절하는 회전강도 조절부 (미도시)가 구비되고, 회전강도 조절부는 제어패널 또는 제어단말부를 통해 제어되도록 하여 재활기 기부의 운동 강도가 조절되도록 할 수 있다. 안장은 사용자가 착석하여 안정적인 재활훈련이 이루어지도록 하기 위한 수단으로, 사용자의 신체 체형에 맞도록 프레임의 중첩방식을 통해 손쉽게 높낮이 조절되도록 이루어지며, 사용자가 비스듬히 누워서 재활훈련을 실시할 수 있도록 소정의 각도로 기울어진 등받이가 구비될 수 있다. 컨트롤러는 안장을 기준으로 한쌍의 대칭으로 형성되어 사용자의 양손에 각각 파지되도록 이루어지며, 통합관리부에서 구동되는 콘텐츠와 연동되어, 컨트롤러를 통해 콘텐츠 내에서 캐릭터 등 의 조작이 이루어지도록 하거나, 콘텐츠 내의 메뉴 등을 제어하도록 할 수 있다. 컨트롤러는 사용자의 심박수를 측정하는 심박측정부, 사용자가 컨트롤러를 파지하였는지 여부를 판단 하는 제1감지부 및 제2감지부를 포함할 수 있다. 심박측정부와 제1,2감지부(142,143)는 컨트롤러 상에서 하나의 구성요소로 구현되어 심박측정부(14 1)에서 제1,2감지부(142,143)의 역할을 수행할 수 있고, 심박측정부에서는 사용자의 심박수만을 측정하고, 제1,2감지부(142,143)에서는 사용자의 컨트롤러 파지 여부만을 판단하는 별도의 구성요소로 구현될 수 있다.심박측정부는, 컨트롤러의 일측에 구비되도록 구현되어 있으므로, 사용자가 콘텐츠를 즐기기 위하여 컨트롤러를 파지하게 되면, 자동으로 심박측정부를 파지하게 됨에 따라, 사용자의 심박수가 측정될 수 있 다. 즉, 사용자가 페달에 답력을 가하게 되면서, 손잡이를 파지하고 있는 사용자의 손바닥과 접촉되는 심박측 정센서(heart rate monitoringsensor)를 통해 사용자의 심박수가 무자각(無自覺)으로 측정될 수 있다. 이러한, 심박측정부는 통합관리부와 유무선 통신을 통해 연동되어 심박측정부에서 수집된 사용자의 심박수 를 통합관리부에 실시간으로 디스플레이 할 수 있다. 심박측정부는 광학 센서 , ECG(electrocardiogram)센서 및 PPG(photoplethysmography) 중 어느 하나를 포함할 수 있으며, 심박 측정부가 광학 센서를 포함할 경우, 심박측정부는 발광부와 수광부로 구성될 수 있다. 발광부는 IR(Infrared), Red LED, Green LED, Blue LED 중 적어도 하나일 수 있으며, 수광부는 포토 다이오드 일 수 있다. 사용자의 손바닥으로 심박측정부를 파지하게 되면, 심박측정부는 사용자의 손바닥에 빛을 출력할 수 있으며, 수광부는 발광부에서 출력된 빛이 사용자의 손바닥을 반사되어 돌아오는 것을 검출할 수 있다. 예를 들어, 빛은 사용자의 혈류 변화량을 판단하기 위해 사용자의 피부보다 더 깊이(예: 혈관) 들어갔다가 반사 되어 나올 수 있으며, 심박측정부의 수광부에서 검출된 빛의 양을 수치화하여 순차적으로 나열하여 신호를 생성 할 수 있고, 심박 측정부에서 생성된 신호를 통합관리부로 전달할 수 있다. 또한, PPG 센서는 심장 박동에 따른 혈관 굵기의 변화에 따라 빛의 흡수 및 반사 정도가 변화하는 원리를 이용 한 것일 수 있다 심박측정부가 PPG 센서를 포함할 경우, 심박측정부는 적외선을 방출하는 발광부와 발광부로부터 사용자의 손바 닥으로 조사되어 반사된 빛을 감지하는 수광부로 구성될 수 있다. 심박측정부는 수광부에서 검출되는 시간에 따 른 광혈류량의 변화로부터 광전용적맥파(Photoplethysmography; PPG) 신호를 검출할 수 있다. 이때, 통합관리부는 심박측정부를 통해 측정된 사용자의 심박수를 기준으로 운동강도조절부의 회전세기 즉, 마그네틱의 자력을 자동으로 강약을 조절하도록 제어될 수 있고, 이를 통해 페달의 회전강도를 자동으 로 조절할 수 있다. 또한, 심박측정부는, 생성된 신호로부터 심박에 해당하는 주파수를 스캔하여 심박수를 측정하여 사용자에게 직 관적으로 심박 상태를 보여줄 수 있다. 제1감지부 및 제2감지부는 한쌍의 컨트롤러에 각각 구비되어 사용자의 왼손 또는 오른손에서 컨 트롤러 파지가 이루어졌는지 여부를 판단할 수 있다. 예컨데, 좌측 컨트롤러에 제1감지부가 구비되면, 우측 컨트롤러에 제2감지부가 구비될 수 있고, 우측 컨트롤러에 제1감지부가 구비되면, 좌측 컨트롤러에 제2감지부가 구비될 수 있다. 제1감지부 및 제2감지부는 사용자의 컨트롤러의 파지 여부를 감지하여, 사용자가 컨트롤러에서 손을 떼면 각각의 감지부에서 감지신호를 후술되는 통합관리부의 판단부로 전송할 수 있다. 즉, 좌측 컨트롤러에 제1감지부가 구비되고, 우측 컨트롤러에 제2감지부가 구비된 상태에서, 사용자 가 좌측 컨트롤러에서만 손을 떼고 우측 컨트롤러를 파지하고 있으면 제1감지부에서만 감지신호를 판단부 로 전달하고, 제2감지부에서는 신호를 전달하지 않는다. 이와 같은 제1감지부 및 제2감지부의 구성에 의해 사용자가 재활기기로부터 낙상되는 것을 감지하여, 낙상 징조 발생 및 낙상 시 알림이 이루어지도록 할 수 있는데, 이에 대한 자세한 내용은 후술한다. 통신부는 무선통신 네트워크가 가능한 하나 이상의 통신모듈을 포함할 수 있으며, 무선 통신 또는 근거리 통신 모듈 또는 위치정보 모듈 등을 포함할 수 있다. 무선 통신은, LTE, LTE-A(LTE advance), CDMA(code divisionmultiple access), WCDMA(wideband CDMA), UMTS(universal mobiletelecommunications system), WiBro(wireless broadband), 또는 GSM(global systemfor mobile communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있다. 또한, 무선 통신은, WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE: bluetooth low energy), 지그 비(Zigbee), NFC(near fieldcommunication), 자력 시큐어 트랜스미션(magnetic secure transmission), 라디오프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 아울러, 무선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(global positioning system), Glonass(global navigation satellite system), beidou navigation satellite system(이하 \"Beidou\") 또는 galileo, the european global satellite-based navigation system일 수 있다. 유선 통신은, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 이러한, 통신부를 통해 통합관리부 또는 제어단말부에 재활기기의 상태 데이터등을 유무선 으로 송수신할 수 있는데, 이를 안전하게 보안하기 위해, 유무선 통신에 적합한 암호화를 사용할 수 있다. 또한, 재활기기, 통합관리부 및 제어단말부에서 각각 데이터의 송수신이 이루어지는 경우, 상태 데이터는 특정 위치의 소방 수신기의 상태나 그 제어에 관련되어 민감한 데이터를 포함하고 있으며, 만약 외부 의 해킹 등에 의해, 이러한 상태 데이터가 노출되거나 조작되는 경우, 큰 사회적 비용을 발생할 수 있다. 이러 한 문제를 해결하기 위해, 상기 상태 데이터의 송수신시, 적절한 암호화 스킴(scheme)을 적용하는 것이 바람직 하다. 보다 구체적으로, 이러한 암호화 스킴은 해시(hash) 함수와 같이, 단방향성 함수(on way fuction)를 사용 하는 것이 바람직하다. 해시 함수의 경우, 보통 다양한 데이터의 입력을 고정된 길이의 누메릭 스트링(숫자 형태의 문자열)으로 변환하 는 기능을 수행하며, 서로 다른 입력에 대해서 같은 출력이 나오지 않는 특성을 지녀, 데이터의 위변조를 쉽게 인지할 수 있는 효과를 제공한다. 그러므로, 상기 재활기기, 통합관리부, 및 제어단말부의 상태 데이터의 송수신시에 해시 함수를 사용할 수 있으며, 일 실시예로는 MD5(Messge Digest algorithm 5) 또는 SHA-1(Secure Hash Algorithm) 알고리 즘을 사용할 수 있다. 다른 실시예로는 상기 MD5나 SHA-1 알고리즘의 무결성에 대한 해킹 시도가 빈번한 점에 착안하여, ANN(Aritificial Neural Network) 해시 알고리즘을 적용하는 것도 고려할 수 있다. 즉, ANN의 다층 레이어중, 입력 레이어에 상기 상태 데이터의 입력 값(숫자, 문자의 형태)과 더불어, 해시함수의 출력값을 같이 학습시켜, 히든 레이어의 연산시 해시함수의 출력값이 반영되도록 하고, 이를 출력 레이어의 결과값(메시지 다이제스트)으 로 반영하게 함으로써, 각 ANN의 고유한 특성(각 뉴론/레이어의 활성화 함수의 차이)이 결과값에 반영되게 하고, 외부에서의 해킹 등이 종래 해시 함수보다 한층 더 어려워지는 효과를 제공할 수 있다. 즉, 암호화가 적용되는 통신부를 통해 재활기기부에서 획득된 심박수 등의 데이터를 통합관리부(20 0)로 송수신하도록 구성되고, 재활기기부의 상태를 통합관리부를 통해 모니터링 하거나, 컨트롤러 신호를 통합관리부로 전송함으로써, 보안성 확보 등의 효과를 가지도록 할 수 있다. 한편, 통합관리부는 페달 및 컨트롤러에 의해 조작되는 콘텐츠를 구동하는 프로세서부, 재 활기기부의 상태 및 콘텐츠를 모니터링 하는 모니터링부, 재활기기부 및 제어단말부에서 제공되는 데이터를 공유하는 로컬장치, 사용자의 상태를 판단하는 판단부를 포함할 수 있다. 통합관리부는 재활기기부를 사용하는 사용자 계정의 로그인을 통해 데이터가 공유되도록 하여, 사용 자별 데이터를 획득하여 저장하고, 사용자 정보의 보안이 유지되도록 하는 것이 바람직하며, 사용자의 계정은 후술되는 제어단말부를 통해 생성될 수 있다. 프로세서부는 통합관리부에 내장되어 페달링 센서로부터 센서값을 획득하고, 재활훈련 콘텐츠에 서 캐릭터를 선택하여 페달링 센서로부터 획득된 센서값에 기반하여 선택된 캐릭터에 대해 조작을 수행할 수 있다. 이러한, 프로세서부는 중앙처리장치(central processingunit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 또한, 프로세서부는, 운동강도측정부에서 측정된 단계별 부하값과, 선형 회귀 분석을 통해, 페달 의 회전수에 따른 토크를 추정할 수 있다. 이와 같은, 페달 회전수에 따른 토크 추정방식은, 별도로 구비되는 파워미터(Power meter)를 통해 기준토 크를 측정한 후, 선형 회귀 분석을 통해 회전수를 입력하는 피팅함수를 근사치로 계산한 뒤, 사용자가 설정한 운동강도(페달링의 각 단수)에 맞는 토크를 추정할 수 있다. 이를 통해, 사용자는 고가의 파워미터를 구입하지 않아도 운동강도 (페달링의 각 단수)에 맞는 토크를 추정하여 사용자의 운동능력을 추정함과 동시에, 사용자의 운동능력을 모니터링부를 통해 디스플레이할 수 있으며, 프로세서부에서 사용자의 운동능력에 맞는 게임 컨텐츠를 추천하여 사용자의 운동능력에 맞도록 게임 컨텐 츠를 선택할 수 있다. 모니터링부는 프로세서부와 연동되어 게임 콘텐츠의 영상(텍스트, 이미지, 비디오, 아이콘, 심볼 등)을 디스플레이하거나, 재활기기부를 이용하는 사용자의 상태 등이 모니터링 되도록 구성된다. 모니터링부는 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오드(OLED) 디스플레 이, 또는 마이크로 전자기계시스템 (MEMS) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 로컬장치는 통합관리부의 근거리 주변에 위치되는 재활기기부 의 데이터가 로컬서버를 통해 공 유되도록 하여, 재활기기부의 통합 관리가 이루어지도록 하고, 제어단말부와 연동되어 제어단말부 를 통해 원격으로 통합관리부를 제어하거나, 재활기기부의 운동강도 등을 제어단말부를 통 해 원격으로 제어할 수 있도록 구성된다. 또한, 로컬장치는 재활기기부를 사용하는 사용자의 재활운동 데이터 DB를 저장하는 저장부가 구 비되어 사용자에 따라 적합한 재활운동 콘텐츠가 실행되도록 이루어진다. 이때, 사용자에게 적합한 재활운동 콘텐츠의 경우, 사용자가 이용하는 콘텐츠 내의 맵의 코스를 이를테면 고강 도, 중강도, 저강도로 분류하여 사용자에게 바람직한 강도의 재활운동 콘텐츠를 자동으로 제공하거나, 사용자가 저장된 재활운동 데이터 DB를 확인하여 수동으로 선택하는 구성으로 구현될 수 있다. 판단부는 사용자의 재활운동 데이터를 분석하고 사용자의 현재상태를 판단하여 사용자에게 과도한 재활운 동이 진행될 경우, 재활운동이 중단되도록 할 수 있다. 즉, 판단부는 심박측정부에서 수집된 사용자의 심박수를 분석하여 사용자의 심박수가 설정된 기준치 이상일 경우, 재활기기부의 작동이 중단되도록 하여 재활운동이 중단되도록 할 수 있다. 또한, 상술한 바와 같이 판단부는 제1감지부 및 제2감지부에서 전달되는 신호를 수신하여, 사용 자의 낙상 상태 등을 판단할 수 있는데, 이때 낙상 상태 등의 판단은 제1감지부 및 제2감지부의 신호 와 심박측정부의 신호를 통해서 판단할 수 있다. 즉, 판단부는 제1감지부와 제2감지부의 신호에 따라 제1위험신호를 출력하는 제1알림학습모델을 생성하고, 심박측정부의 신호에 따라 제2위험신호를 출력하는 제2알림학습모델을 생성하는 인공지능모듈 (미도시)을 포함할 수 있다. 이때, 제1위험신호는 제1감지부와 제2감지부에서 동시에 신호가 왔을때 출력하도록 하고, 제2위험신 호는 설정된 사용자의 심박수가 설정된 기준치 이상일 경우에 출력되도록 함으로써, 사용자가 안전한 상태일 때, 각각의 위험신호가 잘못 출력되는 것이 방지될 수 있다. 이와 같이 각각의 알림학습모델에서 위험신호가 생성되었을 때, 인공지능모듈에서 이를 감지하고, 위험이 감지 되면 통합관리부에서 경고메세지를 출력하거나, 제어단말기에서 관리자를 호출하여 즉각적인 후속조 치가 이루어지도록 할 수 있다. 또한, 제1감지부, 제2감지부의 동시 감지 여부(사용자의 접촉이 동시에 떨어지는 경우)에 따라 제1위 험신호를 출력하는데, 이 경우, 사용자의 의도하에 잠시 운동 이외의 다른 동작을 하는 경우 혹은 감지부 상의 일시적인 접촉 노이즈 등에 영향으로, 제1위험신호가 오탐(false alarm)을 출력할 수도 있다. 이러한 오탐을 줄이기 위해, 인공지능모듈에서는 시계열적인 센서 데이터의 관찰을 통해, 이러한 오탐과 정상 (Negative)을 구분하는 binary classification 학습 알고리즘을 사용할 수 있다. 또한, 인공지능모듈은 머신러닝의 한 분야인 딥러닝(Deep Learning) 기법을 이용하여 정확한 상관 관계가 도출 될 수 있도록 학습을 수행할 수 있다. 특히, 상술한 상관 관계의 경우, 입력(input)은 제1위험신호의 입력세기, 입력면적, 입력위치 및 입력지속시간으로, 출력(output)은 낙상정보로 정의될 수 있고, 또는 동일한 입력으로 노이즈 신호를 출력할 수도 있다. 또한, 인공지능모듈은 딥러닝을 통하여 상기 함수에서의 복수 개의 입력들의 가중치(weight)를 학습을 통하여 산출할 수 있다. 또한, 이러한 학습을 위하여 활용되는 인공지능망 모델로는 RNN(Recurrent Neural Network), DNN(Deep Neural Network) 및 DRNN(Dynamic Recurrent Neural Network) 등 다양한 모델들을 활용할 수 있을 것 이다. 여기서 RNN은 현재의 데이터와 과거의 데이터를 동시에 고려하는 딥 러닝 기법으로서, 순환 신경망(RNN)은 인공 신경망을 구성하는 유닛 사이의 연결이 방향성 사이클(directed cycle)을 구성하는 신경망을 나타낸다. 나아가, 순환 신경망(RNN)을 구성할 수 있는 구조에는 다양한 방식이 사용될 수 있는데, 예컨대, 완전순환망(Fully Recurrent Network), 홉필드망(Hopfield Network), 엘만망(Elman Network), ESN(Echo state network), LSTM(Long short term memory network), 양방향(Bi-directional) RNN, CTRNN(Continuous-time RNN), 계층적 RNN, 2차 RNN 등이 대표적인 예이다. 또한, 순환 신경망(RNN)을 학습시키기 위한 방법으로서, 경사 하강법, Hessian Free Optimization, Global Optimization Method 등의 방식이 사용될 수 있다. 또한, 인공지능망 모델로 패턴 인식 등에 잘 활용되는 SVM(Supported Vector Machine) 신경망 알고리즘을 활용 하여 기계학습모델을 생성할 수 있다. 여기서, SVM 즉, 서포트 벡터 머신은 기계학습의 분야 중 하나로 패턴인식, 자료분석을 위한 지도학습모델이며, 주로 분류와 회귀분석을 위해 사용될 수 있고, 두 카테고리 중 어느 하나에 속한 데이터의 집합이 주어졌을 때, SVM 알고리즘은 주어진 데이터 집합을 바탕으로 하여 새로운 데이터가 어느 카테고리에 속할지 판단하는 비확률 적 이진 선형 분류 모델을 만들 수 있다. 보다 상세하게는, 상기 인공지능모듈은 상기 입력신호의 입력세기, 입력면적, 입력위치 및 입력지속시간에 따른 사용자의 자세정보를 구분하도록 학습시킬 수 있고, 사용자가 아닌 다른 물체(물건, 반려동물 등)를 구분 하도록 학습시킬 수도 있다. 한편, 제어단말부는 재활기기부와 연동되록 하는 연동부와 사용자별로 계정이 생성되도록 하는 계정생성부를 포함할 수 있다. 연동부는 재활기기부와 제어단말부가 블루투스 방식 등에 의해서 연동이 이루어질 때, 재활기기 부와 제어단말부간 데이터 전송 중 발생한 오류의 존재 여부를 확인할 수 있도록 하는 오류검출부 를 포함할 수 있다. 이때, 오류검출부는 패리티검사(Parity Check), 검사합(Checksum), 순환중복검사(CRC, Cyclic Redundancy Check) 중 어느 하나 이상을 이용하여 제어단말부와 재활기기부 연동시 신뢰성을 높이도록 할 수 있 다. 패리티검사(Parity Check)는 정보 비트 수가 적고, 에러발생 확률이 낮은 경우에 주로 사용하는 에러검출 방식 으로, 구현이 간단하여 비동기 통신에 많이 이용하는 특징이 있다. 검사합 (Checksum)은 송신측에서, 전송할 모든 데이터를 16 비트 워드 단위로 구분하고, 1의 보수를 취하고, 그 합에 대한 결과를 전송하면, 수신측에서, 같은 합을 해보아서 오류를 검출하는 방식으로, 간단하게 에러를 검출 할 수 있는 특징이 있다. 순환중복검사(CRC, Cyclic Redundancy Check)는 에러검출 능력이 우수한 `순회부호`의 일종으로, 산발 에러 (Random Error) 뿐만 아니라, 연집 에러(Burst Error)에서도 검출 능력이 우수하며, 통상 데이터링크 계층에서 많이 사용되는, 비트 지향적인 에러검출 기술이다. 이와 같은 오류검출부의 구성을 통해 연동의 정확도 및 제어의 신뢰성을 높이도록 하는 효과를 가질 수 있 다. 한편, 재활기기부 사용자를 관리하는 관리자는 계정 생성부를 통해 사용자별로 계정을 생성할 수 있고, 생 성된 사용자 계정을 통해 통합관리부에 로그인 되도록 할 수 있다. 이와 같은 사용자 계정을 통해 사용자를 관리하는 관리자는 사용자의 재활상태 등을 모니터링 할 수 있으며, 사 용자에 따라 콘텐츠 프로그램을 원격으로 지정하도록 하여 사용자에 맞는 콘텐츠가 구동되도록 할 수 있다. 또한, 제어단말부는 사용자의 재활 코스 및 위험수준을 설정하는 설정부를 포함할 수 있다. 이와 같은 설정부를 통해 사용자에 따라 사용자의 재활 코스 및 위험수준을 설정할 뿐만 아니라, 콘텐츠의 구동 시간, 운동강도, 위험 중단 조건 등을 설정하여 사용자에게 적합한 콘텐츠가 제공되도록 하는 것이다. 또한, 제어단말부를 통해 사용자의 재활운동 이행 상황이 자동으로 기록되고 모니터링 되도록 하여 관리자 가 사용자의 재활운동 여부를 확인할 수 있도록 이루어질 수 있다. 즉, 사용자가 재활기기부를 이용할 경우, 재활운동의 이행효율, 사용자의 심박수, 심전도 등이 측정되도록 하고, 측정된 정보가 자동으로 기록되도록 하여 사용자의 관리가 이루어지도록 하는 것이다. 또한, 제어단말부를 통해 사용자의 정보를 관리하여, 다수의 사용자에 맞는 콘텐츠가 제공되도록 이루어진 다. 도 6은 본 발명의 콘텐츠 구동 장면을 나타낸 도면이다. 콘텐츠 구동은 통합관리부의 프로세서부를 통해 구현되고, 디스플레이부를 통해 출력되어 사용 자가 디스플레이부 및 재활기기부의 컨트롤러를 이용하여 콘텐츠를 이용할 수 있다. 콘텐츠는 다양한 게임 방식으로 구현될 수 있으며, 복수개의 재활기기부 연동을 통해 다수의 사용자가 멀 티플레이로 콘텐츠를 이용할 수 있으며, 설정에 따라 솔로 플레이도 이용할 수 있다. 도 7 및 도 8은 본 발명의 실시예를 나타낸 도면이다. 앞서 설명한 바와 같이 사용자 및 관리자는 제어단말부를 통해 계정 생성, 계정 관리 및 재활 관리 등의 업무를 수행할 수 있다. 제어단말부를 이용하여 사용자 계정을 생성하면, 도 8에 도시된 바와 같이 제어단말부를 통해 환자의 심박수, 주행거리 등의 환자 모니터링을 할 수 있고, 재활을 효율적으로 하기 위한 재활기기부 제어 등을 구현할 수 있다. 해당 데이터는 통합관리부의 디스플레이부에서도 출력이 되어 사용자가 실시간으로 해당 데이터를 확 인할 수 있으며, 관리자는 해당 데이터를 실시간으로 확인하여, 사용자의 재활훈련 등이 바람직하게 이루어지고 있는지 여부를 확인할 수 있다. 본 발명의 콘텐츠 연동 재활장치에 의하면, 재활환자들에게 재활훈련에 대한 동기 및 재미를 부여하여 재활훈련 이 효율적으로 이루어지도록 하는 효과가 있다. 또한, 재활훈련이 이루어지는 재활기기부와 재활기기부와 연동되어 사용자에게 콘텐츠를 제공하는 관리부가 로 컬서버를 통해 재활기기부 및 단말기와 연동되도록 하여, 사용자의 재활운동 데이터 등의 보안이 유지되도록 하 는 효과가 있다. 또한, 재활운동시 발생될 수 있는 사용자의 낙상 사고 발생시 이를 자동으로 알려주고, 재활훈련 중에 재활환자 의 심박수 등을 측정하여 재활환자의 상태를 모니터링 할 수 있는 효과가 있다. 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시예에 불과할 뿐이고 본 발 명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물 과 변형 예들이 있을 수 있음을 이해하여야 한다."}
{"patent_id": "10-2022-0138210", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 콘텐츠 연동 재활장치의 구성을 나타낸 도면 도 2는 본 발명의 재활기기부의 구성을 나타낸 도면 도 3은 본 발명의 컨트롤러, 통신부 및 운동강도측정부의 구성을 나타낸 블록도 도 4는 본 발명의 관리부의 구성을 나타낸 블록도 도 5는 본 발명의 단말부의 구성을 나타낸 블록도 도 6은 본 발명의 콘텐츠 구동 장면을 나타낸 도면 도 7은 본 발명의 실시예를 나타낸 도면 도 8은 본 발명의 실시예를 나타낸 도면"}
