{"patent_id": "10-2019-0072331", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0144364", "출원번호": "10-2019-0072331", "발명의 명칭": "카트 로봇 및 로봇 관제 시스템", "출원인": "엘지전자 주식회사", "발명자": "이돈근"}}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "일정 공간 상에 배치된 카트 로봇을 모니터링하는 로봇 관제 시스템의 구동 방법으로서,상기 공간 상에서 이동하는 하나 이상의 카트 로봇 각각이 따르는 추종 대상의 정보를 수신하는 단계;상기 추종 대상의 정보와 상기 공간 내 배치된 하나 이상의 카메라에 의해 촬영된 정보에 기초하여, 상기 공간에 대응되는 기 저장된 공간 맵을 갱신하는 단계; 및상기 공간 맵의 소정 영역 내에 사람 수가 일정 범위를 초과하는 경우, 상기 소정 영역을 혼잡 영역으로 설정하는 단계를 포함하는, 로봇 관제 시스템의 구동 방법."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,특정 카트 로봇의 추종 대상이 상기 혼잡 영역으로 진입하는 경우, 상기 특정 카트 로봇이 혼잡 영역으로 진입하지 않도록 대기 명령을 상기 특정 카트 로봇으로 전송하는 단계를 더 포함하는, 로봇 관제 시스템의 구동 방법."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "일정 공간 상에 배치된 카트 로봇을 모니터링하는 로봇 관제 시스템으로서,상기 공간 상에서 이동하는 하나 이상의 카트 로봇과 통신하는 통신부;상기 공간에 대응되는 공간 맵을 저장하는 저장부; 및 상기 카트 로봇이 따르는 추종 대상의 정보를 상기 통신부를 통해 수신하며, 상기 추종 대상의 정보와 상기 공간 내 배치된 하나 이상의 카메라에 의해 촬영된 정보에 기초하여 상기 공간 맵을 갱신하는 제어 모듈을 포함하며,상기 제어 모듈은,상기 공간 맵의 소정 영역 내에 사람 수가 일정 범위를 초과하는 경우, 상기 소정 영역을 혼잡 영역으로 설정하는, 로봇 관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어 모듈은,특정 카트 로봇의 추종 대상이 상기 혼잡 영역으로 진입하는 경우, 상기 특정 카트 로봇이 대기하도록 상기 특정 카트 로봇에 상기 통신부를 통해 대기 명령을 전송하는, 로봇 관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 제어 모듈은,상기 공간 맵 상에서 혼잡 영역을 소정 주기 또는 실시간으로 갱신하는, 로봇 관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,공개특허 10-2020-0144364-3-상기 제어 모듈은,상기 특정 카트 로봇의 추종 대상이 상기 혼잡 영역을 벗어나거나 상기 혼잡 영역이 비혼잡 영역으로 변경된 경우, 상기 특정 카트 로봇이 상기 추종 대상을 추종하도록 상기 특정 카트 로봇에 추종 명령을 전송하는, 로봇관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제어 모듈은,상기 특정 카트 로봇이 상기 추종 대상을 따라가는 경우, 상기 추종 대상의 위치 정보, 혼잡 영역 정보, 장애물정보 중 적어도 하나를 상기 통신부를 통해 상기 특정 카트 로봇에 전송하는, 로봇 관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 특정 카트 로봇의 추종 대상이 상기 혼잡 영역을 벗어난 경우, 상기 특정 카트 로봇 및 상기 추종 대상 간의 거리에 기초하여, 상기 추종 대상을 촬영할 카메라를 선택하고, 선택된 카메라를 통해 상기 추종 대상을 촬영하는, 로봇 관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제3항에 있어서,상기 통신부는 이동 단말과 통신하며,상기 제어 모듈은,상기 혼잡 영역을 포함하는 공간 맵에 관한 정보를 상기 이동 단말로 상기 통신부를 통해 제공하는, 로봇 관제시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제3항에 있어서,상기 제어 모듈은,갱신된 혼잡 영역으로부터 소정 범위 내에 배치된 카트 로봇에 공간 맵에 관한 정보를 상기 통신부를 통해 전송하는, 로봇 관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "일정 공간 내 배치된 카트 로봇을 모니터링하는 로봇 관제 시스템으로서,상기 공간 상에서 이동하는 하나 이상의 카트 로봇과 통신하는 통신부;상기 공간에 대응되는 공간 맵을 저장하는 저장부; 및 상기 카트 로봇이 따르는 추종 대상의 정보를 상기 통신부를 통해 수신하며, 상기 추종 대상의 정보와 상기 카메라에 의해 촬영된 정보에 기초하여 상기 공간 맵을 갱신하는 제어 모듈을 포함하며,상기 제어 모듈은,상기 공간 맵의 소정 영역 내에 사람 수가 일정 범위를 초과하는 경우, 상기 소정 영역을 혼잡 영역으로 설정하고, 설정된 혼잡 영역을 상기 공간 맵이 표시된 디스플레이에 표시하는, 로봇 관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,공개특허 10-2020-0144364-4-상기 추종 대상의 정보는 외모 정보, 이동 패턴 정보 및 동행 대상 정보 중 적어도 하나를 포함하고,상기 제어 모듈은,상기 추종 대상의 정보를 포함하도록 상기 공간 맵을 갱신하고, 갱신된 공간 맵을 상기 디스플레이 상에 표시하는, 로봇 관제 시스템."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "일정 공간 내에서 추종 대상을 따르는 카트 로봇으로서,이동 모듈;로봇 관제 시스템과 통신하는 통신부;하나 이상의 센싱부;영상 신호의 입력을 위한 입력부 및상기 센싱부로부터 감지된 정보 또는 상기 입력부를 통해 입력된 정보에 기초하여 상기 추종 대상을 따르도록상기 이동 모듈을 제어하는 제어 모듈을 포함하며,상기 제어 모듈은,상기 추종 대상의 정보를 상기 통신부를 통해 상기 로봇 관제 시스템으로 전송하는, 카트 로봇."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제어 모듈은,상기 추종 대상이 혼잡 영역으로 진입하여 상기 로봇 관제 시스템으로부터 대기 명령을 수신한 경우, 상기 혼잡영역으로 진입하지 않도록 상기 이동 모듈을 제어하는, 카트 로봇."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제어 모듈은,상기 추종 대상이 상기 혼잡 영역을 벗어나서 상기 로봇 관제 시스템으로부터 추종 명령을 수신한 경우, 상기추종 대상을 따라가도록 상기 이동 모듈을 제어하는, 카트 로봇."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 제어 모듈은,상기 센싱부의 상기 추종 대상을 감지하는 감지 범위가 상기 혼잡 영역의 사이즈보다 크고, 상기 추종 대상이상기 감지 범위를 이탈한 경우, 상기 추종 대상으로 이동하도록 상기 이동 모듈을 제어하는, 카트 로봇."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제13항에 있어서,상기 입력부는 카메라를 포함하며,상기 제어 모듈은,상기 카메라를 통해 입력된 영상에 기초하여 상기 추종 대상의 외모 정보, 이동 패턴 정보 및 동행 대상 정보중 적어도 하나를 상기 통신부를 통해 상기 로봇 관제 시스템에 전송하는, 카트 로봇."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2020-0144364-5-제14항에 있어서,상기 센싱부는 오도미터 센서(Odometer Sensor) 및 라이더 센서(Lidar Sensor)를 포함하며,상기 제어 모듈은,상기 혼잡 영역에서 상기 추종 대상이 벗어난 경우, 상기 추종 대상의 위치 정보, 혼잡 영역 정보, 장애물 정보중 적어도 하나를 상기 로봇 관제 시스템으로부터 수신하고,상기 센싱부로부터 감지된 정보 및 상기 로봇 관제 시스템으로부터 수신한 정보에 기초하여 상기 추종 대상으로이동하도록 상기 이동 모듈을 제어하는, 카트 로봇."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서,상기 제어 모듈은,상기 센싱부로부터 감지된 정보 또는 상기 입력부를 통해 입력된 정보에 기초하여 추종 대상과 소정 거리를 유지하면서 이동하도록 상기 이동 모듈을 제어하는, 카트 로봇."}
{"patent_id": "10-2019-0072331", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "일정 공간 내에서 추종 대상을 따르는 카트 로봇의 구동 방법에 있어서,상기 추종 대상이 혼잡 영역으로 진입한 경우, 대기 명령을 로봇 관제 시스템으로부터 수신하여 대기하는 단계;상기 추종 대상이 혼잡 영역을 벗어난 경우, 상기 추종 대상을 추종하는 추종 명령을 상기 로봇 관제 시스템으로부터수신하는 단계; 및상기 로봇 관제 시스템으로부터 수신된 경로 정보에 기초하여 상기 추종 대상을 추종하는 단계를 포함하는, 카트 로봇의 구동 방법."}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일정 공간 내 배치된 카트 로봇을 모니터링하는 장치가 개시된다. 본 장치는 공간 상에서 이동하는 하나 이상의 카트 로봇과 통신하는 통신부, 공간에 대응되는 공간 맵을 저장하는 저장부 및 카트 로봇 이 따르는 추종 대상의 정보를 통신부를 통해 수신하여, 추종 대상의 정보와 일정 공간 내 배치된 하나 이상의 카메라에 의해 촬영된 정 보에 기초하여 상기 공간 맵을 갱신하는 제어 모듈을 포함하며, 제어 모듈은 소정 영역에 위치한 사람 수가 일정 범위를 초과하는 경우 소정 영역을 혼잡 영역으로 설정할 수 있다. 이에 따라, 공간 내 트래픽 복잡도가 해소될 수 있으며, 인공지능 및 5G 통신을 지원하는 카트 로봇 및 로봇 관제 시스템이 제공될 수 있다."}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 카트 로봇, 그를 제어하고 모니터링하는 로봇 관제 시스템 및 그들의 구동 방법에 관한 것이다."}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대형 마트, 병원, 백화점, 공항 등 인적, 물적 교류가 활발한 공간에는 사람들에게 정보를 제공하거나 편의를 제공하기 위해 로봇이 배치될 수 있다. 종래기술 1(KR101636773B, “이미지 및 비디오 기반 보행자 트래픽 추정”)에 개시된 트래픽 추정 장치는 복수 의 카메라를 이용하여 특정 공간을 이동하는 보행자를 추적하고 추적된 보행자 정보에 기초하여 특정 시공간에 서의 보행자 트래픽을 추정하고자 한다. 하지만, 상기 트래픽 추정 장치의 경우 소정 공간을 이동하는 로봇과 통신하지는 못하며, 로봇으로부터 수신된 정보에 기초하여 트래픽량을 추정하지 못함으로써 혼잡 영역을 효과적으로 회피하지 못한다는 문제점이 있다. 종래기술 2(KR100788960B, “동적 안내 정보 제공 시스템”)에 개시된 시스템은 단말기로부터 목적지 정보를 입 력받아 경로를 제공하고 제공된 경로 상에서 다양하 부가 정보를 제공하고자 한다. 하지만, 상기 시스템의 경우에도 소정 공간을 이동하는 로봇과 통신하지 못하며, 로봇으로부터 수신된 정보에 기초하여 트래픽량을 추정하지 못함으로써 마찬가지의 문제점이 존재한다."}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 일정 공간 내 혼잡 영역과 비혼잡 영역을 구분함으로써 카트 로봇이 안정적 으로 추종 대상을 추종할 수 있는 로봇 관제 시스템을 제공하는 것이다. 본 발명의 또 다른 과제는, 소정 공간의 혼잡 영역을 설정하고 설정된 혼잡 영역을 회피할 수 있는 방법을 제공 하는 것이다. 본 발명의 또 다른 과제는, 카트 로봇이 추종 대상을 안정적으로 추종할 수 있도록 사용자를 모니터링하는 카트 로봇을 제공하는 것이다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 달성하기 위하여, 본 발명의 일 실시 예에 따른 로봇 관제 시스템은 하나 이상의 카메라로 촬영된 정보와 카트 로봇이 수집한 추종 대상의 정보에 기초하여 공간 맵을 생성하고 생성된 공간 맵의 혼잡 영역과 비 혼잡 영역을 구분하고자 한다. 구체적으로, 본 로봇 관제 시스템은 공간 내 배치된 하나 이상의 카메라, 공간 상에서 이동하는 하나 이상의 카 트 로봇과 통신하는 통신부, 공간에 대응되는 공간 맵을 저장하는 저장부 및 카트 로봇이 따르는 추종 대상의 정보를 통신부를 통해 수신하여, 추종 대상의 정보에 기초하여 공간 맵을 갱신하는 제어 모듈을 포함할 수 있다. 상기 제어 모듈은 특정 카트 로봇의 추종 대상이 혼잡 영역에 진입한 경우, 추종 대상이 혼잡 영역을 벗어나거 나 혼잡 영역이 비혼잡 영역으로 변경되기까지 상기 특정 카트 로봇의 이동을 제한할 수 있다. 상기 과제를 달성하기 위하여, 본 발명의 일 실시 예에 따른 카트 로봇은 카메라 또는 통신 센서를 이용하여 사 용자를 모니터링할 수 있다. 상기 카트 로봇은 이동 모듈, 로봇 관제 시스템과 통신하는 통신부, 하나 이상의 센싱부, 영상 신호의 입력을 위한 입력부 및 센싱부로부터 감지된 정보 또는 입력부를 통해 입력된 정보에 기초 하여 추종 대상을 따르도록 이동 모듈을 제어하는 제어 모듈을 포함할 수 있다. 여기서, 제어 모듈은 추종 대상 의 정보를 통신부를 통해 상기 로봇 관제 시스템으로 전송할 수 있다. 상기 과제를 달성하기 위하여, 본 발명의 일 실시 예에 따른 로봇 관제 시스템의 구동 방법은 상기 공간 상에서 이동하는 하나 이상의 카트 로봇 각각이 따르는 추종 대상의 정보를 수신하는 단계; 상기 추종 대상의 정보와 상기 공간 내 배치된 하나 이상의 카메라에 의해 촬영된 정보에 기초하여, 상기 공간에 대응되는 기 저장된 공 간 맵을 갱신하는 단계; 및 상기 공간 맵의 소정 영역 내에 사람 수가 일정 범위를 초과하는 경우, 상기 소정 영역을 혼잡 영역으로 설정하는 단계를 포함할 수 있다. 여기서, 상기 구동 방법은 특정 카트 로봇의 추종 대상이 상기 혼잡 영역으로 진입하는 경우, 상기 특정 카트 로봇이 혼잡 영역으로 진입하지 않도록 대기 명령을 상기 특정 카트 로봇으로 전송하는 단계를 더 포함할 수 있 다. 본 발명에서 이루고자 하는 기술적 과제들의 해결 수단은 이상에서 언급한 해결 수단들로 제한되지 않으며, 언"}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "급하지 않은 또 다른 해결 수단들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면 아래와 같은 효과가 도출될 수 있다. 첫째로, 소정 공간에 대응되고 혼잡 영역을 반영한 공간 맵이 생성됨으로써, 혼잡 영역을 회피할 수 있는 방법 이 제공될 수 있다. 이에 따라, 사용자 편의가 제고될 수 있다. 둘째로, 추종 대상을 모니터링하는 카트 로봇이 제공됨으로써, 추종 대상을 보다 정확하게 따를 수 있다. 이에 따라, 추종 정확도가 향상될 수 있다. 셋째로, 추종 대상이 혼잡 영역에 진입한 경우, 카트 로봇이 이동 대기함으로써 더 큰 혼잡의 발생이 미연에 방 지될 수 있다."}
{"patent_id": "10-2019-0072331", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 동일하거나 유사한 구성요소에 는 동일유사한 도면 부호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐 릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 도 1은 본 발명의 일 실시 예에 따른 카트 로봇의 외관을 나타낸다. 카트 로봇은 다양한 장소(예를 들면, 마트, 병원 등)에 배치될 수 있는데, 카트 로봇은 수용 공간 을 구비하여 물품을 담을 수 있으며, 이동 모듈을 구비하여 원하는 목적지로 이동할 수 있으며, 카트 손잡이를 구비하여 사용자의 외력에 순응하여 자연스럽게 움직일 수 있다. 또한, 카트 로봇은 자동으로 추종 대상(예를 들면, 사용자)을 따라 움직일 수 있는데, 추종 대상의 손목에 위치한 태그(Tag)를 추적하여 추종 대상을 따라 움직일 수 있다. 한편, 카트 로봇은 도 1에 도시된 것과는 다르게 도어를 오픈시켜야 적재물이 외부로 노출되는 형태의 운 반 로봇으로도 구현될 수도 있다. 도 2는 도 1에 도시된 카트 로봇의 구성을 나타내는 블록도이다. 도 2를 참고하면, 카트 로봇은 통신부, 입력부, 센싱부, 출력부, 저장부, 전원 공급부, 이동 모듈 및 제어 모듈을 포함한다. 도 2에 도시된 구성요소들은 카트 로봇을 구 현하는데 있어서 필수적인 것은 아니어서, 본 명세서 상에서 설명되는 카트 로봇은 위에서 열거된 구성요 소들 보다 많거나, 또는 적은 구성요소들을 가질 수 있다. 보다 구체적으로, 상기 구성요소들 중 통신부는 카트 로봇과 로봇 관제 시스템(도 5의 200) 사이, 카 트 로봇과 추종 대상에 위치한 통신 모듈(이동 단말, 스마트 워치 등에 구비) 사이의 통신을 가능하게 하 는 모듈이다. 통신부는 이동 통신 모듈을 포함할 수 있다. 여기서, 이동 통신 모듈은 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등) 및 5G(Generation) 통신에 따 라 구축된 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 또한, 통신부는 근거리 통신 모듈을 포함할 수 있다. 여기서, 근거리 통신 모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth™), RFID(Radio Frequency Identification), 적외 선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하 나를 이용하여 근거리 통신을 수행할 수 있다. 여기서, 통신부는 통신 센서인 UWB 비콘 센서를 포함하거나 연동되어 외부의 UWB 비콘 태그의 위치를 파악할 수 있다. UWB 비콘 센서는 전파 송수신 시에 소요되는 시간(Time of Flight, TOF)을 이용하여 거리 를 측정하는 기능을 포함할 수 있다. 여기서, UWB 비콘 센서는 초광대역 통신을 이용하여 낮은 전력을 통해서도 데이터를 전송할 수 있으며, 비 콘 통신에 기초하여 외부 통신 기기와 데이터를 송수신할 수 있고, 이를 위해 블루투스 비콘 통신이 수행될 수 있다. 입력부는 영상 신호 입력을 위한 카메라 또는 영상 입력부, 오디오 신호 입력을 위한 마이크로폰 (123, microphone), 또는 오디오 입력부, 사용자로부터 정보를 입력받기 위한 사용자 입력부(예를 들어, 터치키 (touch key), 푸시키(mechanical key) 등)를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데이터는 분석되어 사용자의 제어명령으로 처리될 수 있다. 센싱부는 카트 로봇 내 정보, 카트 로봇을 둘러싼 주변 환경 정보 및 사용자 정보 중 적어도 하 나를 센싱하기 위한 하나 이상의 센서를 포함할 수 있다. 예를 들어, 센싱부는 UWB 비콘 센서, 오도 미터 센서, 라이더 센서, 근접센서(proximity sensor), 조도 센서(illumination sensor), 터치 센서 (touch sensor), 가속도 센서(acceleration sensor), 자기 센서(magnetic sensor), 중력 센서(G-sensor), 자이 로스코프 센서(gyroscope sensor), 모션 센서(motion sensor), RGB 센서, 적외선 센서(IR 센서: infrared sensor), 지문인식 센서(finger scan sensor), 초음파 센서(ultrasonic sensor), 광 센서(optical sensor, 예 를 들어, 카메라), 마이크로폰(microphone), 무게 감지 센서, 배터리 게이지(battery gauge), 환경 센서(예를 들어, 기압계, 습도계, 온도계, 방사능 감지 센서, 열 감지 센서, 가스 감지 센서 등), 화학 센서(예를 들어, 전자 코, 헬스케어 센서, 생체 인식 센서 등) 중 적어도 하나를 포함할 수 있다. 한편, 본 명세서에 개시된 카 트 로봇은, 이러한 센서들 중 적어도 둘 이상의 센서에서 센싱되는 정보들을 조합하여 활용할 수 있다. 여기서, UWB 비콘 센서는 통신부의 구성이면서 거리를 센싱하는 센서로 구동될 수 있다. 상술한 바와 같이, UWB 비콘 센서는 태그의 위치를 정확하게 측정할 수 있다. 오도미터 센서는 카트 로봇이 이동한 거리를 측정할 수 있으며, 라이더 센서는 레이저를 목표물 에 비춰 사물과의 거리 및 다양한 물성을 감지할 수 있는 센서로, 카트 로봇이 장애물을 감지하고 이동하 는데 필요한 센서이다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시키기 위한 것으로, 디스플레이, 하나 이상의 발 광 소자, 소리 출력부 및 햅팁 모듈 중에서 적어도 하나를 포함할 수 있다. 디스플레이는 터치 센서와 상 호 레이어 구조를 이루거나 일체형으로 형성됨으로써, 터치 스크린으로 구현될 수 있다. 이러한 터치 스크린은, 카트 로봇과 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부로써 기능함과 동시에, 카트 로봇 과 사용자 사이의 출력 인터페이스를 제공할 수 있다. 소리 출력부는 카트 로봇 외부로 소리를 출력하기 위한 모듈로 사용자 음성을 출력할 수 있으며, 단순한 경고음(가령, 비프음)을 출력할 수 있다. 저장부는 카트 로봇의 다양한 기능을 지원하는 데이터를 저장한다. 저장부는 카트 로봇에 서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 카트 로봇의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 무선 통신을 통해 외부 서버로부터 다운로드 될 수 있다. 전원공급부는 제어 모듈의 제어 하에서, 외부의 전원, 내부의 전원을 인가 받아 카트 로봇의 각 구성요소들에 전원을 공급한다. 이러한 전원공급부는 배터리를 포함하며, 상기 배터리는 내장형 배터리 또 는 교체가능한 형태의 배터리가 될 수 있다. 상기 배터리는 유선 또는 무선 충전 방식으로 충전될 수 있는데, 무선 충전 방식은 자기 유도 방식 또는 자기 공진 방식을 포함할 수 있다. 이동 모듈은 외력에 순응하여 카트 로봇을 이동시킬 수 있으며, 제어 모듈의 제어에 따라 카트 로봇을 이동시킬 수 있다. 이동 모듈은 하나 이상의 차륜을 포함할 수 있다. 제어 모듈은 카트 로봇을 전반적으로 제어하는 모듈이다. 제어 모듈은 카트 로봇이 추종하 는 추종 대상(가령, 유저)을 따르도록 이동 모듈을 제어할 수 있다. 구체적으로, 제어 모듈은 센싱부 로부터 감지된 정보 또는 입력부 특히, 카메라를 통해 입력된 정보에 기초하여 추종 대상을 따 라도록 이동 모듈을 제어할 수 있다. 아울러, 제어 모듈은 센싱부로부터 감지된 및 입력부로부터 입력된 정보에 기초하여 추종 대상 과의 소정 거리를 유지하면서 이동하도록 이동 모듈을 제어하거나 외부 기기, 사람과 충돌하지 않고 이동 하도록 이동 모듈을 제어할 수 있다. 이하에서는 도 3 및 도 4를 참고하여 추종 대상(Target)을 인식하기 위한 카트 로봇의 구동을 설명하기로 한다. 도 3을 참고하면, 카트 로봇은 소정의 공간 상에서 추종 대상(Target)을 따를 수 있다. 카트 로봇은 UWB 비콘 센서를 구비하여 추종 대상(Target)의 일 영역(예를 들면, 손목)에 위치한 UWB 비콘 태그를 감지할 수 있으며, UWB 비콘 태그와의 거리(di)를 측정할 수 있다. 실시 예에서, UWB 비 콘 태그는 스마트 워치로 구현될 수 있으며, UWB 비콘 태그는 UWB 비콘 센서와 UWB 통신을 수행 하도록 구현될 수 있다. 카트 로봇의 제어 모듈은 UWB 비콘 센서로부터 감지된 정보에 기초하여 추종 대상(Target)을 따 르도록 이동 모듈을 제어할 수 있다. 이 때, 제어 모듈은 추종 대상(Target)과의 거리(di)를 소정 거리 유지하도록 이동 모듈을 제어할 수 있다. 아울러, 카트 로봇은 추종 대상(Target), 외부의 유저들 또는 다른 카트 로봇과의 거리를 소정 만큼 유지할 수 있으며, 소정 거리 내로 추종 대상(Target), 외부의 유저들 또는 다른 카트 로봇이 접근하는 경우, 멈추거나 경고음을 소리 출력부를 통해 출력할 수 있다. 제어 모듈은 UWB 비콘 태그와 통신하기 위해 UWB 비콘 태그의 식별 정보를 수신할 수 있으며, 커넥션을 세팅할 수 있다. 또한, 제어 모듈은 추종 대상(Target)에 대한 정보(거리 정보, 식별 정보 등)를 로봇 관제 시스템으로 전송할 수 있다. 도 4를 참고하면, 제어 모듈은 카메라를 구비하여 추종 대상(Target)을 촬영할 수 있으며, 촬영된 영 상에 기초하여 추종 대상(Target)을 인식할 수 있다. 제어 모듈은 카메라를 통해 입력된 영상에 기초하여 추종 대상(Target)의 외모 정보를 로봇 관제 시 스템으로 전송할 수 있다. 상기 외모 정보는 키 정보, 착용 의류 정보, 머리 색상 정보 등을 포함하여 다 양한 외관적인 정보를 포함할 수 있다. 실시 예에서, 상기 카메라는 전방 방향만 촬영하지 않고 회전하도 록 구현되어 다방면으로 영상을 촬영할 수 있다. 아울러, 제어 모듈은 추종 대상(Target)의 걸음걸이 정보, 동선 정보 등을 기초로 이동 패턴 정보를 인식 할 수 있다. 또한, 제어 모듈은 추종 대상(Target)의 동행 대상 정보를 인식할 수 있다. 예를 들면, 제어 모듈은 추종 대상(Target)과 동행하는 사람(가령, 자녀)이나 반려견을 인식할 수 있다. 여기서, 카트 로봇이 상기 외관 정보, 이동 패턴 정보 및 동행 대상 정보를 인식하는 것으로 설명하나, 실 시 예에서, 카트 로봇은 단순히 촬영만 수행하여 영상 정보만 로봇 관제 시스템으로 전송하고, 로봇 관제 시스템이 실질적으로 해당 정보를 인식하도록 구현될 수 있다. 도 5는 공간 모니터링 시스템에서 복수의 카트 로봇과 통신하는 로봇 관제 시스템을 나타낸다. 로봇 관제 시스템은 공간 상에서 이동하는 복수의 카트 로봇(100a~100n)과 통신할 수 있다. 로봇 관제 시 스템은 공간 상에서 실시간으로 갱신되는 혼잡 영역에 대한 정보(가령, “Warning Zone”)를 복수의 카트 로봇(100a~100n)에 전송할 수 있으며, 혼잡 영역을 회피하는 경로를 포함한 공간 맵을 복수의 카트 로봇 (100a~100n)에 전송할 수 있다. 즉, 로봇 관제 시스템은 경로의 복잡도를 계산하고 이를 바탕으로 경로 맵 을 생성할 수 있으며, 워닝 존을 설정할 수 있다. 로봇 관제 시스템은 복수의 카트 로봇(100a~100n) 각각이 추종하는 추종 대상을 포함한 사람들을 상기 공 간 맵 상에 갱신할 수 있으며, 추종하는 사용자 정보를 상기 공간 맵 상에 동기화할 수 있다. 상기 로봇 관제 시스템 및 카트 로봇은 5G 통신 모듈을 구비할 수 있다. 로봇 관제 시스템 및 카트 로봇은 100Mbps 내지 20Gbps 속도로 데이터를 전송할 수 있어서 대용량의 동영상을 외부 기기로 전송할 수 있으며, 저전력으로 구동되어 전력 소비를 최소화할 수 있다. 카트 로봇이 많이 배치된 영역이 핫스팟(Hot Spot)이며, 해당 장소의 경우 사용자의 밀도가 높아서, 5G 통 신 모듈이 카트 로봇 및 로봇 관제 시스템에 탑재될 경우, 혼잡이 해소될 수 있다. 또한, 로봇 관제 시스템 및 카트 로봇은 각종 사물 지능 통신(IoT(Internet of Things), IoE(Internet of Everything), IoST(Internet of Small Things) 등)을 지원할 수 있으며, 로봇 관제 시스템 및 카트 로봇은 M2M(Machine to Machine) 통신, V2X(Vehicle to Everything Communication) 통신, D2D(Device to Device) 통신 등을 지원할 수 있다. 아울러, 로봇 관제 시스템 및 카트 로봇은 인공지능에 관한 모듈을 탑재할 수 있다. 여기서, 인공 지 능(artificial intelligence, AI)은, 인간의 지능으로 할 수 있는 사고, 학습, 자기계발 등을 컴퓨터가 할 수 있도록 하는 방법을 연구하는 컴퓨터 공학 및 정보기술의 한 분야로, 컴퓨터가 인간의 지능적인 행동을 모방할 수 있도록 하는 것을 의미할 수 있다. 또한, 인공지능은 그 자체로 존재하는 것이 아니라, 컴퓨터 과학의 다른 분야와 직간접으로 많은 관련을 맺고 있다. 특히 현대에는 정보기술의 여러 분야에서 인공지능적 요소를 도입하여, 그 분야의 문제 풀이에 활용하려 는 시도가 매우 활발하게 이루어지고 있다. 머신 러닝(machine learning)은 인공지능의 한 분야로, 컴퓨터에 명시적인 프로그램 없이 배울 수 있는 능력을 부여하는 연구 분야를 포함할 수 있다. 구체적으로 머신 러닝은, 경험적 데이터를 기반으로 학습을 하고 예측 을 수행하고 스스로의 성능을 향상시키는 시스템과 이를 위한 알고리즘을 연구하고 구축하는 기술이라 할 수 있 다. 머신 러닝의 알고리즘들은 엄격하게 정해진 정적인 프로그램 명령들을 수행하는 것이라기보다, 입력 데이터 를 기반으로 예측이나 결정을 이끌어내기 위해 특정한 모델을 구축하는 방식을 취할 수 있다. 도 6은 본 발명의 일 실시 예에 따른 로봇 관제 시스템의 구성을 나타내는 블록도이다. 도 6을 참고하면, 로봇 관제 시스템은 통신부, 입력부, 센싱부, 출력부, 저장부 및 제어 모듈을 포함할 수 있다. 도 6을 설명하는데 있어 도 2와 중복되는 설명은 생략하기로 한다. 아울러, 로봇 관제 시스템이 상기 구성들을 포함하는 것으로 설명하나, 상기 구성들과 단순히 통신만 수행 할 뿐, 별도의 시스템으로 구현될 수 있다. 통신부는 공간 상에서 이동하는 하나 이상의 카트 로봇과 통신할 수 있다. 입력부는 카메라 그룹을 포함하며, 카메라 그룹은 복수의 카메라(221a~221n)를 포함할 수 있다. 복수의 카메라(221a~221n)는 공간의 부분 영역 각각을 촬영할 수 있는 모듈이며, 복수의 카메라(221a~221n) 각 각은 공간의 부분 영역 각각을 구분하여 촬영하거나 공간의 전체 영역 또는 부분 영역을 중복적으로 촬영할 수 있다. 실시 예에 따라서는, 복수의 카메라(221a~221n)의 전부 또는 일부가 UWB 센서를 구비하여 UWB 통신 모듈 의 위치를 인식하도록 구현될 수 있다. 출력부는 디스플레이를 포함하여, 공간에 대응되는 공간 맵을 표시할 수 있는데, 디스플레이는 공간 맵 상에 카트 로봇 및 카트 로봇이 추종하는 추종 대상을 표시할 수 있다. 저장부는 공간의 각 영역들에 대응되는 공간 맵을 저장할 수 있다. 상기 공간 맵은 상기 공간의 전부 또는 부분에 대응되어 공간을 나타내는 맵으로, 2차원이나 3차원으로 구현될 수 있다. 제어 모듈은 카트 로봇 각각이 따르는 추종 대상의 정보를 통신부를 통해 수신하여, 추종 대상의 정 보나 복수의 카메라(221a~221n)로 촬영된 정보에 기초하여 공간 맵을 갱신할 수 있다. 제어 모듈은 사람이 밀집한 영역을 혼잡 영역으로 결정할 수 있다. 구체적으로, 제어 모듈은 소정 영 역에 위치한 카트 로봇의 추종 대상 수나 사람 수가 기 설정된 수용 범위를 초과하는 경우, 해당 영역을 혼잡 영역으로 결정할 수 있다. 즉, 제어 모듈은 “Warning Zone”을 설정할 수 있다. 예를 들면, 제어 모듈은 특정 제곱미터 내에 추종 대상의 수가 일정 범위를 초과하는 경우, 해당 영역을 혼잡 영역으로 설정할 수 있으며, 특정 객체가 특정 수 이상인 경우 복잡한 혼잡 영역으로 설정할 수 있는데, 상기 특정 수는 공간의 상황에 따라 다르게 설정될 수 있다. 또한, 혼잡 영역의 형태 및 모양은 다양하게 설정 될 수 있다. 또한, 제어 모듈은 공간에 대응되는 공간 맵 상에서 혼잡 영역을 실시간 또는 소정 주기로 갱신할 수 있으 며, 상기 소정 주기는 공간 활용도, 방문 빈도가 높은 시간 등에 의해 다르게 구현될 수 있다. 제어 모듈은 특정 카트 로봇의 추종 대상이 혼잡 영역으로 진입하는 경우, 특정 카트 로봇이 대기하도록 대기 명령을 통신부를 통해 특정 카트 로봇에 전송할 수 있다. 즉, 로봇 관제 시스템은 혼잡 영역이 발생되는 경우, 해당 혼잡 영역으로 카트 로봇이 진입하지 못하도록 카트 로봇을 제어할 수 있다. 이에 따라, 통행 효율이 향상될 수 있으며, 공간이 보다 효율적으로 관리될 수 있다. 제어 모듈은 특정 카트 로봇의 추종 대상이 혼잡 영역을 벗어나거나 추종 대상의 위치가 혼잡 영역에서 비 혼잡 영역으로 변경된 경우, 추종 대상을 따라가는 추종 명령을 상기 통신부를 통해 상기 특정 카트 로봇 에 전송할 수 있다. 이 경우, 제어 모듈은 특정 카트 로봇이 추종 대상을 따라갈 때, 추종 대상의 위치 정보, 동선에 배치된 혼잡 영역 정보 및 장애물 정보를 통신부를 통해 특정 카트 로봇에 전송할 수 있다. 가령, 제어 모듈(29 0)은 제1 카메라에서 제2 카메라로 추종 대상이 이동하는 경우, 카트 로봇이 이동해야할 매대 및 통로의 개수에 관한 정보를 카트 로봇에 전송할 수 있다. 그러면, 카트 로봇은 각종 센서(가령, 오도미터 센 서, 라이더 센서 등)를 이용하여 목적지까지 이동할 수 있다. 제어 모듈은 카트 로봇의 혼잡 영역을 벗어난 경우, 카트 로봇 및 추종 대상 간의 거리에 기초 하여 추종 대상을 촬영할 카메라를 선택할 수 있다. 제어 모듈은 선택된 카메라를 이용하여 추종 대상을 촬영할 수 있다. 이 때, 제어 모듈은 카트 로봇의 UWB 비콘 센서의 감지 범위 내에 추종 대상이 배치된 경우, 감 지 범위에 배치된 카메라를 선택할 수 있다. 즉, 제어 모듈은 혼잡 영역으로 특정 카트 로봇의 추종 대상이 이동하였다가 혼잡 영역이 해제된 경우, 상 기 특정 카트 로봇이 상기 추종 대상을 따라기 위해서 카메라를 선택할 수 있으며, 선택된 카메라를 이용하여 추종 대상을 촬영할 수 있다. 제어 모듈은 선택된 카메라를 이용하여 특정 카트 로봇을 촬영하고, 촬영된 영상에 기초하여 특정 카트 로 봇의 이동 방향을 가이드할 수 있다. 가령, 제어 모듈은 추종 대상의 위치 정보, 동선 상의 혼잡 영역 정 보, 장애물 정보들을 특정 카트 로봇에 제공할 수 있다. 마트를 예로 들면, 제어 모듈은 추종 대상과 카트 로봇과의 거리에 기초하여 몇 개의 매대와 통로를 지나가야 하는지에 대한 정보를 카트 로봇에 전송할 수 있으며, 카트 로봇은 오도미터 센서 및 라이더 센서 등의 센싱부를 이용하여 추종 대상을 추적할 수 있다. 또한, 제어 모듈은 외부 이동 단말과 통신할 수 있다. 제어 모듈은 혼잡 영역을 포함하는 공간 맵에 관한 정보를 외부 이동 단말로 전송할 수 있는데, 여기서, 외부 이동 단말은 추종 대상의 통제 범위 내에 있는 이동 단말일 수 있으며, 스마트 워치를 포함할 수 있다. 제어 모듈은 갱신된 혼잡 영역으로부터 소정 범위 내에 배치된 카트 로봇들에 공간 맵에 관한 정보를 소정 주기로 제공할 수 있다. 이에 따라, 카트 로봇들이 혼잡 영역을 벗어나서 이동하게 할 수 있다. 또한, 제어 모듈은 공간 맵을 디스플레이에 표시할 수 있다. 구체적으로, 제어 모듈은 소정 영 역에 위치한 추종 대상의 수 또는 사람 수가 일정 범위를 초과하는 경우, 소정 영역을 혼잡 영역으로 결정하고 결정된 혼잡 영역을 디스플레이에 표시할 수 있다. 더 나아가, 제어 모듈은 상기 디스플레이 상에 추종 대상들의 외모 정보, 이동 패턴 정보 및 동행 대 상 정보가 상기 공간 맵 상에 반영되도록 상기 디스플레이를 제어할 수 있다. 한편, 카트 로봇의 제어 모듈은 센싱부의 추종 대상을 감지하는 감지 범위가 혼잡 영역의 사이 즈보다 크고, 추종 대상이 감지 범위를 이탈한 경우, 추종 대상으로 이동하도록 이동 모듈을 제어할 수 있 다. 즉, 카트 로봇은 추종 대상이 혼잡 영역에 진입하였다가 센싱부의 감지 범위를 이탈한 경우, 추 종 대상이 혼잡 영역을 이탈한 것으로 간주하고, 추종 대상으로 이동할 수 있다. 도 7은 본 발명의 일 실시 예에 따른 로봇 관제 시스템의 구동을 설명하기 위한 도면이다. 도 7을 참고하면, 로봇 관제 시스템은 공간 내의 천장에 복수의 카메라(221a~221n)을 포함할 수 있으며, 복수의 카메라(221a~221n)를 통해 공간(PL-1)를 촬영할 수 있다. 카트 로봇(100a~100n) 각각은 추종 대상(Target 1~n)을 각각 추종할 수 있다. 실시 예에서, 추종 대상이 없는 일반 카트도 공간(PL-1)에 포함될 수 있는데, 로봇 관제 시스템은 공간 (PL-1)에 배치된 사람 수에 기초하여 혼잡 영역을 결정할 수 있다. 도 8은 본 발명의 일 실시 예에 따른 로봇 관제 시스템의 구동을 설명하기 위한 시퀀스도이다. 도 8을 참고하면, 제1 카트 로봇(100a)은 추종 대상인 제1 유저를 등록하고(S803), 제n 카트 로봇(100n)은 추종 대상인 제n 유저를 등록한다(S805). 로봇 관제 시스템은 제1 카트 로봇(100a) 내지 제n 카트 로봇(100n)으로부터 유저의 특성 정보를 수신한다 (S809, S811). 여기서, 유저의 특성 정보는 유저의 외모 정보, 이동 패턴 정보 및 동행 대상 정보를 포함할 수 있다. 로봇 관제 시스템은 복수의 카메라(221a~221n)를 통해 촬영된 정보 및 카트 로봇의 카메라를 통 해 촬영된 정보에 기초하여 제1 유저 내지 제n 유저를 인식한다(S815). 로봇 관제 시스템은 공간 맵에 인식된 유저들을 매핑한다(S818). 그러면, 로봇 관제 시스템은 유저들의 이동에 따라 유동적으로 혼잡 영역을 설정한다(S820). 즉, 로봇 관제 시스템은 유저들의 이동에 따라 “Warning Zone”을 설정할 수 있다. 로봇 관제 시스템은 특정 유저(가령, 제1 유저)가 혼잡 영역에 있으면, 제1 유저의 혼잡 영역 진입 메시지 및 이동 펜딩 명령을 제1 카트 로봇(100a)으로 전송한다(S830). 제1 카트 로봇(100a)은 대기하고, 제1 유저에게 알림을 발생시킨다(S835). 상기 알림은 비프음이나 음성일 수 있으며, 메시지로 구현되어 제1 유저의 통제 범위 내의 단말이 반응하게 할 수 있다. 제1 카트 로봇(100a)은 제1 유저가 혼잡 영역을 이탈할 경우 제1 유저를 추적한다(S840). 이 때, 제1 카트 로봇(100a)은 로봇 관제 시스템이 제공하는 경로 정보에 기초하여 추종 대상을 추종할 수 있다. 도 9 및 도 10은 본 발명의 일 실시 예에 따른 로봇 관제 시스템이 특정 카트 로봇(100a)를 제어하는 것을 설명하기 위한 도면이다. 도 9를 참고하면, 로봇 관제 시스템은 특정 영역(OP1)을 혼잡 영역으로 설정할 수 있다. 로봇 관제 시스템은 특정 카트 로봇(100a)은 추종 대상(Target1a)이 혼잡 영역(OP1)으로 진입(Target1b) 하는 경우 특정 카트 로봇(100a)에 대기 명령을 전송할 수 있다. 이 때, 특정 카트 로봇(100a)은 추종 대상 (Target1b)을 향하여 알림을 출력할 수 있다. 도 10을 참고하면, 로봇 관제 시스템은 혼잡 영역(OP1)을 이탈한 추종 대상(Target 1d)을 따라가는 추종 명령을 상기 특정 카트 로봇(100a)에 전송할 수 있다. 로봇 관제 시스템은 추종 대상(Target 1d)을 따르도록 경로 안내를 카트 로봇(100a)에 제공할 수 있다. 예 를 들면, 로봇 관제 시스템은 추종 대상(Target 1d)의 이동에 따라 카메라 경로(이동 방향에 따른 카메라 매핑)를 미리 인식하고, 추종 대상(Target 1d)을 실시간으로 추적할 수 있다. 도 11은 본 발명의 일 실시 예에 따른 공간 모니터링 시스템(도 5의 1000)의 구동 방법을 나타내는 시퀀스도이 다. 먼저, 로봇 관제 시스템은 제1 유저의 혼잡 영역 이탈 알림을 제1 카트 로봇(100a)에 전송한다(S1110). 그러면, 제1 카트 로봇(100a)은 제1 유저의 위치 추적을 로봇 관제 시스템에 요청한다(S1115). 로봇 관제 시스템은 복수의 카메라를 이용하여 제1 유저를 추적한다(S1120). 추적에 성공하면(S1125), 로봇 관제 시스템은 제1 유저 위치 정보를 제1 카트 로봇(100a)에 제공하고, 추 종 대상인 제1 유저로 접근하도록 제1 카트 로봇(100a)을 제어할 수 있다.추적에 실패하면(S1125), 로봇 관제 시스템은 대기 명령을 제1 카트 로봇(100a)에 전송한다(S1135). 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한, 상기 컴퓨터는 카트 로봇의 제어 모듈 및 로봇 관제 시스템의 제어 모듈을 포함할 수 있다. 앞에서, 본 발명의 특정한 실시예가 설명되고 도시되었지만 본 발명은 기재된 실시예에 한정되는 것이 아니고, 이 기술 분야에서 통상의 지식을 가진 자는 본 발명의 사상 및 범위를 벗어나지 않고서 다른 구체적인 실시예로 다양하게 수정 및 변형할 수 있음을 이해할 수 있을 것이다. 따라서, 본 발명의 범위는 설명된 실시예에 의하여 정하여 질 것이 아니고 청구범위에 기재된 기술적 사상에 의해 정하여져야 할 것이다."}
{"patent_id": "10-2019-0072331", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 카트 로봇의 외관을 설명하기 위한 도면, 도 2는 본 발명의 일 실시 예에 따른 카트 로봇의 구성을 나타내는 블록도, 도 3 및 도 4는 본 발명의 일 실시 예에 따른 추종 대상을 인식하기 위한 카트 로봇의 구동을 설명하기 위한 도면들, 도 5는 본 발명의 일 실시 예에 따른 복수의 카트 로봇과 통신하는 로봇 관제 시스템을 개략적으로 설명하기 위한 도면, 도 6은 본 발명의 일 실시 예에 따른 로봇 관제 시스템의 구성을 나타내는 블록도, 도 7은 본 발명의 일 실시 예에 따른 카트 로봇 및 로봇 관제 시스템이 적용되는 공간을 설명하기 위한 도면, 도 8은 본 발명의 일 실시 예에 따른 공간 모니터링 시스템의 구동을 설명하기 위한 시퀀스도, 도 9 및 도 10은 본 발명의 일 실시 예에 따른 혼잡 영역에서 카트 로봇 및 로봇 관제 시스템의 구동을 설명하 기 위한 도면들, 그리고, 도 11은 본 발명의 일 실시 예에 따른 카트 로봇 및 로봇 관제 시스템의 구동을 설명하기 위한 시퀀스도이다."}
