{"patent_id": "10-2023-0097752", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0017016", "출원번호": "10-2023-0097752", "발명의 명칭": "무선 통신 시스템에서 조건부 재설정을 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "황준"}}
{"patent_id": "10-2023-0097752", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템의 단말에 의해 수행되는 방법에 있어서, 제1 조건부 재설정 정보 및 제2 조건부 재설정 정보를 획득하는 단계; 상기 제1 조건부 재설정 정보와 연관된 적어도 하나의 제1 조건 및 상기 제2 조건부 재설정 정보와 연관된 적어도 하나의 제2 조건이 만족되었음을 식별하는 단계; 및 상기 제1 조건부 재설정 정보 및 제2 조건부 재설정 정보 중 어느 하나를 적용하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다."}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에 관한 것이다. 보다 구체적으로, 본 개시는 무선 통신 시스템에서 단말 및 기지국 의 조건부 재설정을 위한 방법 및 장치에 대한 것이다."}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어,Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다."}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "무선 통신 시스템의 발전에 따라 다양한 서비스를 제공할 수 있게 됨으로써, 이러한 서비스들을 효과적으로 제 공하기 위한 방안이 요구되고 있다. 특히, 무선 통신 시스템에서 조건부 핸드오버(conditional handover), 조건 부 PSCell 추가(conditional PSCell addition; CPA) 및/또는 조건부 PSCell 변경(conditional PSCell change; CPC)과 같은 조건부 재설정(conditional reconfiguration)이 수행됨에 있어서, 지연 시간을 줄이기 위한 방법의 필요성이 대두된다."}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시에서는 무선 통신 시스템의 단말에 의해 수행되는 방법이 제공된다. 상기 방법은 제1 조건부 재설정 정 보 및 제2 조건부 재설정 정보를 획득하는 단계; 상기 제1 조건부 재설정 정보와 연관된 적어도 하나의 제1 조 건 및 상기 제2 조건부 재설정 정보와 연관된 적어도 하나의 제2 조건이 만족되었음을 식별하는 단계; 및 상기 제1 조건부 재설정 정보 및 제2 조건부 재설정 정보 중 어느 하나를 적용하는 단계를 포함한다."}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시 예에 따르면, 무선 통신 시스템에서 조건부 핸드오버, 조건부 PSCell 추가 및/또는 조건부 PSCell 변경과 같은 조건부 재설정이 수행됨에 있어서, 지연 시간을 효과적으로 줄일 수 있다."}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 발명의 동작 원리를 상세히 설명한다. 하기에서 본 발명을 설명하기에 있어 관 련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어 들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반 에 걸친 내용을 토대로 내려져야 할 것이다. 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 망 객체들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등 은 설명의 편의를 위해 예시된 것이다. 따라서, 본 발명이 후술되는 용어들에 한정되는 것은 아니며, 동등한 기 술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 이하, 기지국은 단말의 자원할당을 수행하는 주체로서, gNode B, eNode B, Node B, BS (Base Station), 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말은 UE (User Equipment), MS (Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신 기능을 수행할 수 있는 멀티미디어 시스템을 포 함할 수 있다. 본 개시에서 하향링크(Downlink; DL)는 기지국이 단말에게 전송하는 신호의 무선 전송 경로이고, 상향링크는(Uplink; UL)는 단말이 기국에게 전송하는 신호의 무선 전송경로를 의미한다. 또한, 이하에서 LTE 혹 은 LTE-A 시스템을 일 예로서 설명할 수도 있지만, 유사한 기술적 배경 또는 채널 형태를 갖는 다른 통신시스템 에도 본 개시의 실시예가 적용될 수 있다. 예를 들어 LTE-A 이후에 개발되는 5세대 이동통신 기술(5G, new radio, NR)이 본 개시의 실시예가 적용될 수 있는 시스템에 포함될 수 있으며, 이하의 5G는 기존의 LTE, LTE-A 및 유사한 다른 서비스를 포함하는 개념일 수도 있다. 또한, 본 개시는 숙련된 기술적 지식을 가진 자의 판단으 로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있 다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이 터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므 로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭 션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세 스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블 록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예를 들면, 잇달아 도시되어 있는 두 개의 블 록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으 로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행할 수 있다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의 미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서 들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨 어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들,프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이 터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 이하 설명의 편의를 위하여, 본 발명은 현재 존재하는 통신표준 가운데 3GPP (The 3rd Generation Partnership Project) 단체에서 정의하는 표준인 5GS 및 NR 규격에서 정의하고 있는 용어 및 명칭들을 사용한다. 하지만, 본 발명이 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 무선통신망에도 동일하게 적용 될 수 있다. 예를 들면, 본 발명은 3GPP 5GS/NR (5세대 이동통신 표준)에 적용할 수 있다. 도 1은 본 개시의 일 실시 예에 따른 LTE 시스템의 구조를 도시하는 도면이다. 도 1을 참조하면, 도시한 바와 같이 LTE 시스템의 무선 액세스 네트워크는 차세대 기지국(Evolved Node B, 이하 ENB, Node B 또는 기지국)(1-05, 1-10, 1-15, 1-20)과 이동성 관리 엔티티 (Mobility Management Entity, MME)(1-25) 및 S-GW(1-30, Serving-Gateway)로 구성될 수 있다. 사용자 단말(User Equipment, 이하 UE 또는 단 말)(1-35)은 ENB(1-05 ~ 1-20) 및 S-GW(1-30)를 통해 외부 네트워크에 접속할 수 있다. 도 1에서 ENB(1-05 ~ 1-20)는 UMTS 시스템의 기존 노드 B에 대응될 수 있다. ENB는 UE(1-35)와 무선 채널로 연 결되며 기존 노드 B 보다 복잡한 역할을 수행할 수 있다. LTE 시스템에서는 인터넷 프로토콜을 통한 VoIP(Voice over IP)와 같은 실시간 서비스를 비롯한 모든 사용자 트래픽이 공용 채널(shared channel)을 통해 서비스 될 수 있다. 따라서, UE들의 버퍼 상태, 가용 전송 전력 상태, 채널 상태 등의 상태 정보를 취합해서 스케줄링을 하는 장치가 필요하며, 이를 ENB(1-05 ~ 1-20)가 담당할 수 있다. 하나의 ENB는 통상 다수의 셀들을 제어할 수 있다. 예컨대, 100 Mbps의 전송 속도를 구현하기 위해서 LTE 시스템은 예컨대, 20 MHz 대역폭에서 직교 주파수 분할 다중 방식(Orthogonal Frequency Division Multiplexing, OFDM)을 무선 접속 기술로 사용할 수 있다. 또 한 단말의 채널 상태에 맞춰 변조 방식(modulation scheme)과 채널 코딩률(channel coding rate)을 결정하는 적응 변조 코딩(Adaptive Modulation & Coding, AMC) 방식을 적용할 수 있다. S-GW(1-30)는 데이터 베어러 (bearer)를 제공하는 장치이며, MME(1-25)의 제어에 따라서 데이터 베어러를 생성하거나 제거할 수 있다. MME는 단말에 대한 이동성 관리 기능은 물론 각종 제어 기능을 담당하는 장치로 다수의 기지국 들과 연결될 수 있다. 도 2는 본 개시의 일 실시 예에 따른 LTE 시스템의 무선 프로토콜 구조를 도시하는 도면이다. 도 2를 참조하면, LTE 시스템의 무선 프로토콜은 단말과 ENB에서 각각 패킷 데이터 컨버전스 프로토콜 (Packet Data Convergence Protocol, PDCP)(2-05, 2-40), 무선 링크 제어(Radio Link Control, RLC)(2-10, 2-35), 매 체 액세스 제어 (Medium Access Control, MAC)(2-15, 2-30)으로 이루어질 수 있다. PDCP는 IP 헤더 압축/복원"}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "등의 동작을 담당할 수 있다. PDCP의 주요 기능은 하기와 같이 요약될 수 있다. - 헤더 압축 및 압축 해제 기능(Header compression and decompression: ROHC only) - 사용자 데이터 전송 기능 (Transfer of user data) - 순차적 전달 기능(In-sequence delivery of upper layer PDUs at PDCP re-establishment procedure for RLC AM) - 순서 재정렬 기능(For split bearers in DC (only support for RLC AM): PDCP PDU routing for transmission and PDCP PDU reordering for reception) - 중복 탐지 기능(Duplicate detection of lower layer SDUs at PDCP re-establishment procedure for RLC AM) - 재전송 기능(Retransmission of PDCP SDUs at handover and, for split bearers in DC, of PDCP PDUs at PDCP data-recovery procedure, for RLC AM) - 암호화 및 복호화 기능(Ciphering and deciphering) - 타이머 기반 SDU 삭제 기능(Timer-based SDU discard in uplink.) 무선 링크 제어(Radio Link Control, RLC)(2-10, 2-35)는 PDCP 패킷 데이터 유닛(Packet Data Unit, PDU)을 적"}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "절한 크기로 재구성해서 ARQ 동작 등을 수행할 수 있다.. RLC의 주요 기능은 하기와 같이 요약될 수 있다.- 데이터 전송 기능(Transfer of upper layer PDUs) - ARQ 기능(Error Correction through ARQ (only for AM data transfer)) - 접합, 분할, 재조립 기능(Concatenation, segmentation and reassembly of RLC SDUs (only for UM and AM data transfer)) - 재분할 기능(Re-segmentation of RLC data PDUs (only for AM data transfer)) - 순서 재정렬 기능(Reordering of RLC data PDUs (only for UM and AM data transfer) - 중복 탐지 기능(Duplicate detection (only for UM and AM data transfer)) - 오류 탐지 기능(Protocol error detection (only for AM data transfer)) - RLC SDU 삭제 기능(RLC SDU discard (only for UM and AM data transfer)) - RLC 재수립 기능(RLC re-establishment) MAC(2-15, 2-30)은 한 단말에 구성된 여러 RLC 계층 장치들과 연결되며, RLC PDU들을 MAC PDU에 다중화하고"}
{"patent_id": "10-2023-0097752", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "MAC PDU로부터 RLC PDU들을 역다중화하는 동작을 수행할 수 있다. MAC의 주요 기능은 하기와 같이 요약될 수 있 다. - 맵핑 기능(Mapping between logical channels and transport channels) - 다중화 및 역다중화 기능(Multiplexing/demultiplexing of MAC SDUs belonging to one or different logical channels into/from transport blocks (TB) delivered to/from the physical layer on transport channels) - 스케쥴링 정보 보고 기능(Scheduling information reporting) - HARQ 기능(Error correction through HARQ) - 로지컬 채널 간 우선 순위 조절 기능(Priority handling between logical channels of one UE) - 단말간 우선 순위 조절 기능(Priority handling between UEs by means of dynamic scheduling) - MBMS 서비스 확인 기능(MBMS service identification) - 전송 포맷 선택 기능(Transport format selection) - 패딩 기능(Padding) 물리 계층(2-20, 2-25)은 상위 계층 데이터를 채널 코딩 및 변조하고, OFDM 심벌로 만들어서 무선 채널로 전송 하거나, 무선 채널을 통해 수신한 OFDM 심벌을 복조하고 채널 디코딩해서 상위 계층으로 전달하는 동작을 할 수 있다. 도 3은 본 개시의 일 실시 예에 따른 차세대 이동통신 시스템의 구조를 도시하는 도면이다. 도 3를 참조하면, 차세대 이동통신 시스템(이하 NR 또는 5g)의 무선 액세스 네트워크는 차세대 기지국(New Radio Node B, 이하 NR gNB 또는 NR 기지국)(3-10)과 차세대 무선 코어 네트워크(New Radio Core Network, NR CN)(3-05)로 구성될 수 있다. 차세대 무선 사용자 단말(New Radio User Equipment, NR UE 또는 단말)(3-15)은 NR gNB(3-10) 및 NR CN (3-05)를 통해 외부 네트워크에 접속할 수 있다. 도 3에서 NR gNB(3-10)는 기존 LTE 시스템의 eNB (Evolved Node B)에 대응될 수 있다. NR gNB는 NR UE(3-15)와 무선 채널로 연결되며 기존 노드 B 보다 더 월등한 서비스를 제공해줄 수 있다. 차세대 이동통신 시스템에서는 모든 사용자 트래픽이 공용 채널(shared channel)을 통해 서비스 될 수 있다. 따라서, UE들의 버퍼 상태, 가용 전송 전력 상태, 채널 상태 등의 상태 정보를 취합해서 스케줄링을 하는 장치가 필요하며, 상기 스케줄링은 NR NB(3-10)가 담당할 수 있다. 하나의 NR gNB는 다수의 셀들을 제어할 수 있다. 차세대 이동통신 시스템에서는, 일반적인 LTE 대비 초고속 데이터 전송을 구현하기 위해서, 일반적인 최대 대역폭 이상의 대역폭이 적용될 수 있다. 또한, 직교 주파수 분할 다중 방식(Orthogonal Frequency Division Multiplexing, OFDM)을 무선 접속 기 술로 하여 추가적으로 빔포밍 기술이 접목될 수 있다. 또한, 단말의 채널 상태에 맞춰 변조 방식(modulation scheme)과 채널 코딩률(channel coding rate)을 결정하는 적응 변조 코딩(Adaptive Modulation & Coding, 이하AMC라 한다) 방식이 적용될 수 있다. NR CN (3-05)는 이동성 지원, 베어러 설정, QoS 설정 등의 기능을 수행할 수 있다. NR CN는 단말에 대한 이동성 관리 기능은 물론 각종 제어 기능을 담당하는 장치로 다수의 기지국 들과 연결될 수 있다. 또한 차세대 이동통신 시스템은 LTE 시스템과도 연동될 수 있으며, NR CN이 MME (3-25)와 네트 워크 인터페이스를 통해 연결될 수 있다. MME는 LTE 기지국인 eNB (3-30)과 연결될 수 있다. 도 4는 본 개시의 일 실시 예에 따른 차세대 이동통신 시스템의 무선 프로토콜 구조를 도시하는 도면이다. . 도 4를 참조하면, 차세대 이동통신 시스템의 무선 프로토콜은 단말과 NR 기지국에서 각각 NR 서비스 데이터 적 응 프로토콜(Service Data Adaptation Protocol, SDAP)(4-01, 4-45), NR PDCP(4-05, 4-40), NR RLC(4-10, 4- 35), NR MAC(4-15, 4-30) 및 NR PHY (4-20, 4-25)으로 이루어진다. NR SDAP(4-01, 4-45)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 사용자 데이터의 전달 기능(transfer of user plane data) - 상향 링크와 하향 링크에 대해서 QoS flow와 데이터 베어러의 맵핑 기능(mapping between a QoS flow and a DRB for both DL and UL) - 상향 링크와 하향 링크에 대해서 QoS flow ID를 마킹 기능(marking QoS flow ID in both DL and UL packets) - 상향 링크 SDAP PDU들에 대해서 relective QoS flow를 데이터 베어러에 맵핑시키는 기능 (reflective QoS flow to DRB mapping for the UL SDAP PDUs). SDAP 계층 장치에 대해 단말은 무선 자원 제어(Radio Resource Control, RRC) 메시지로 각 PDCP 계층 장치 별 로 또는 베어러 별로 또는 로지컬 채널 별로 SDAP 계층 장치의 헤더를 사용할 지 여부 또는 SDAP 계층 장치의 기능을 사용할 지 여부를 설정 받을 수 있다. SDAP 헤더가 설정된 경우, 단말은, SDAP 헤더의 비접속 계층(Non- Access Stratum, NAS) QoS(Quality of Service) 반영 설정 1비트 지시자(NAS reflective QoS)와, 접속 계층 (Access Stratum, AS) QoS 반영 설정 1비트 지시자(AS reflective QoS)로, 단말이 상향 링크와 하향 링크의 QoS 플로우(flow)와 데이터 베어러에 대한 맵핑 정보를 갱신 또는 재설정할 수 있도록 지시할 수 있다. SDAP 헤더는 QoS를 나타내는 QoS flow ID 정보를 포함할 수 있다. QoS 정보는 원할한 서비스를 지원하기 위한 데이 터 처리 우선 순위, 스케쥴링 정보 등으로 사용될 수 있다. NR PDCP (4-05, 4-40)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 헤더 압축 및 압축 해제 기능(Header compression and decompression: ROHC only) - 사용자 데이터 전송 기능 (Transfer of user data) - 순차적 전달 기능(In-sequence delivery of upper layer PDUs) - 비순차적 전달 기능 (Out-of-sequence delivery of upper layer PDUs) - 순서 재정렬 기능(PDCP PDU reordering for reception) - 중복 탐지 기능(Duplicate detection of lower layer SDUs) - 재전송 기능(Retransmission of PDCP SDUs) - 암호화 및 복호화 기능(Ciphering and deciphering) - 타이머 기반 SDU 삭제 기능(Timer-based SDU discard in uplink.) 상술한 내용에서, NR PDCP 장치의 순서 재정렬 기능(reordering)은 하위 계층에서 수신한 PDCP PDU들을 PDCP SN(sequence number)을 기반으로 순서대로 재정렬하는 기능을 의미할 수 있다. NR PDCP 장치의 순서 재정렬 기 능(reordering)은 재정렬된 순서대로 데이터를 상위 계층에 전달하는 기능을 포함할 수 있으며, 또는 순서를 고 려하지 않고 바로 전달하는 기능을 포함할 수 있으며, 순서를 재정렬하여 유실된 PDCP PDU들을 기록하는 기능을 포함할 수 있으며, 유실된 PDCP PDU들에 대한 상태 보고를 송신 측에 하는 기능을 포함할 수 있으며, 유실된 PDCP PDU들에 대한 재전송을 요청하는 기능을 포함할 수 있다. NR RLC(4-10, 4-35)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 데이터 전송 기능(Transfer of upper layer PDUs) - 순차적 전달 기능(In-sequence delivery of upper layer PDUs) - 비순차적 전달 기능(Out-of-sequence delivery of upper layer PDUs) - ARQ 기능(Error Correction through ARQ) - 접합, 분할, 재조립 기능(Concatenation, segmentation and reassembly of RLC SDUs) - 재분할 기능(Re-segmentation of RLC data PDUs) - 순서 재정렬 기능(Reordering of RLC data PDUs) - 중복 탐지 기능(Duplicate detection) - 오류 탐지 기능(Protocol error detection) - RLC SDU 삭제 기능(RLC SDU discard) - RLC 재수립 기능(RLC re-establishment) 상술한 내용에서, NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은 하위 계층으로부터 수신한 RLC SDU들을 순서대로 상위 계층에 전달하는 기능을 의미할 수 있다. 원래 하나의 RLC SDU가 여러 개의 RLC SDU들로 분할되어 수신된 경우, NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은 이를 재조립하여 전달하는 기 능을 포함할 수 있다. NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은, 수신한 RLC PDU들을 RLC SN(sequence number) 또는 PDCP SN(sequence number)를 기준으로 재정렬하는 기능을 포함할 수 있으며, 순서를 재정렬하여 유실된 RLC PDU 들을 기록하는 기능을 포함할 수 있으며, 유실된 RLC PDU들에 대한 상태 보고를 송신 측에 하는 기능을 포함할 수 있으며, 유실된 RLC PDU들에 대한 재전송을 요청하는 기능을 포함할 수 있다. NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은, 유실된 RLC SDU가 있을 경우, 유실된 RLC SDU 이전 까지의 RLC SDU들만을 순서대로 상위 계층에 전달하는 기능을 포함할 수 있다. NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은, 유실된 RLC SDU가 있어도 소정의 타이머가 만료되 었다면 타이머가 시작되기 전에 수신된 모든 RLC SDU들을 순서대로 상위 계층에 전달하는 기능을 포함할 수 있 다. NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은, 유실된 RLC SDU가 있어도 소정의 타이머가 만료되 었다면 현재까지 수신된 모든 RLC SDU들을 순서대로 상위 계층에 전달하는 기능을 포함할 수 있다. NR RLC 장치는, 일련번호(Sequence number)의 순서와 상관없이(Out-of sequence delivery) RLC PDU들을 수신하 는 순서대로 처리하여 NR PDCP 장치로 전달할 수 있다. NR RLC 장치가 세그먼트(segment)를 수신할 경우에는, 버퍼에 저장되어 있거나 추후에 수신될 세그먼트들을 수 신하여, 온전한 하나의 RLC PDU로 재구성한 후, 이를 NR PDCP 장치로 전달할 수 있다. NR RLC 계층은 접합(Concatenation) 기능을 포함하지 않을 수 있고, NR MAC 계층에서 기능을 수행하거나 NR MAC 계층의 다중화(multiplexing) 기능으로 대체할 수 있다. 상술한 내용에서, NR RLC 장치의 비순차적 전달 기능(Out-of-sequence delivery)은 하위 계층으로부터 수신한 RLC SDU들을 순서와 상관없이 바로 상위 계층으로 전달하는 기능을 의미할 수 있다. NR RLC 장치의 비순차적 전달 기능(Out-of-sequence delivery)은, 원래 하나의 RLC SDU가 여러 개의 RLC SDU들로 분할되어 수신된 경우, 이를 재조립하여 전달하는 기능을 포함할 수 있다. NR RLC 장치의 비순차적 전달 기능(Out-of-sequence delivery)은, 수신한 RLC PDU들의 RLC SN 또는 PDCP SN을 저장하고 순서를 정렬하여 유실된 RLC PDU들을 기록 해두는 기능을 포함할 수 있다. NR MAC(4-15, 4-30)은 한 단말에 구성된 여러 NR RLC 계층 장치들과 연결될 수 있으며, NR MAC의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 맵핑 기능(Mapping between logical channels and transport channels) - 다중화 및 역다중화 기능(Multiplexing/demultiplexing of MAC SDUs) - 스케쥴링 정보 보고 기능(Scheduling information reporting) - HARQ 기능(Error correction through HARQ) - 로지컬 채널 간 우선 순위 조절 기능(Priority handling between logical channels of one UE) - 단말간 우선 순위 조절 기능(Priority handling between UEs by means of dynamic scheduling) - MBMS 서비스 확인 기능(MBMS service identification) - 전송 포맷 선택 기능(Transport format selection) - 패딩 기능(Padding) NR PHY 계층(4-20, 4-25)은 상위 계층 데이터를 채널 코딩 및 변조하고, OFDM 심벌로 만들어서 무선 채널로 전 송하거나, 무선 채널을 통해 수신한 OFDM 심벌을 복조하고 채널 디코딩해서 상위 계층으로 전달하는 동작을 수 행할 수 있다. 도 5는 본 개시의 일 실시 예에 따른 단말의 구조를 도시하는 블록도이다. 상기 도면을 참고하면, 상기 단말은 RF(Radio Frequency)처리부(5-10), 기저대역(baseband)처리부(5-20), 저장 부(5-30), 제어부(5-40)를 포함한다. 상기 RF처리부(5-10)는 신호의 대역 변환, 증폭 등 무선 채널을 통해 신호를 송수신하기 위한 기능을 수행한다. 상기 RF처리부(5-10)는 상기 기저대역처리부(5-20)로부터 제공되는 기저대역 신호를 RF 대역 신호로 상향 변환 한 후 안테나를 통해 송신하고, 상기 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향 변환한다. 예를 들어, 상기 RF처리부(5-10)는 송신 필터, 수신 필터, 증폭기, 믹서(mixer), 오실레이터(oscillator), DAC(digital to analog convertor), ADC(analog to digital convertor) 등을 포함할 수 있다. 상기 도면에서, 하나의 안테나만이 도시되었으나, 상기 단말은 다수의 안테나들을 구비할 수 있다. 또한, 상기 RF처리부(5- 10)는 다수의 RF 체인들을 포함할 수 있다. 나아가, 상기 RF처리부(5-10)는 빔포밍(beamforming)을 수행할 수 있다. 상기 빔포밍을 위해, 상기 RF처리부(5-10)는 다수의 안테나들 또는 안테나 요소(element)들을 통해 송수 신되는 신호들 각각의 위상 및 크기를 조절할 수 있다. 또한 상기 RF 처리부는 MIMO를 수행할 수 있으며, MIMO 동작 수행 시 여러 개의 레이어를 수신할 수 있다. 상기 기저대역처리부(5-20)은 시스템의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기능을 수행한 다. 예를 들어, 데이터 송신 시, 상기 기저대역처리부(5-20)은 송신 비트열을 부호화 및 변조함으로써 복소 심 벌들을 생성한다. 또한, 데이터 수신 시, 상기 기저대역처리부(5-20)은 상기 RF처리부(5-10)로부터 제공되는 기 저대역 신호를 복조 및 복호화를 통해 수신 비트열을 복원한다. 예를 들어, OFDM(orthogonal frequency division multiplexing) 방식에 따르는 경우, 데이터 송신 시, 상기 기저대역처리부(5-20)는 송신 비트열을 부 호화 및 변조함으로써 복소 심벌들을 생성하고, 상기 복소 심벌들을 부반송파들에 매핑한 후, IFFT(inverse fast Fourier transform) 연산 및 CP(cyclic prefix) 삽입을 통해 OFDM 심벌들을 구성한다. 또한, 데이터 수신 시, 상기 기저대역처리부(5-20)은 상기 RF처리부(5-10)로부터 제공되는 기저대역 신호를 OFDM 심벌 단위로 분할 하고, FFT(fast Fourier transform)를 통해 부반송파들에 매핑된 신호들을 복원한 후, 복조 및 복호화를 통해 수신 비트열을 복원한다. 상기 기저대역처리부(5-20) 및 상기 RF처리부(5-10)는 상술한 바와 같이 신호를 송신 및 수신한다. 이에 따라, 상기 기저대역처리부(5-20) 및 상기 RF처리부(5-10)는 송신부, 수신부, 송수신부 또는 통신부로 지칭될 수 있다. 나아가, 상기 기저대역처리부(5-20) 및 상기 RF처리부(5-10) 중 적어도 하나는 서로 다른 다수의 무선 접 속 기술들을 지원하기 위해 다수의 통신 모듈들을 포함할 수 있다. 또한, 상기 기저대역처리부(5-20) 및 상기 RF처리부(5-10) 중 적어도 하나는 서로 다른 주파수 대역의 신호들을 처리하기 위해 서로 다른 통신 모듈들을 포함할 수 있다. 예를 들어, 상기 서로 다른 무선 접속 기술들은 무선 랜(예: IEEE 802.11), 셀룰러 망(예: LTE) 등을 포함할 수 있다. 또한, 상기 서로 다른 주파수 대역들은 극고단파(SHF:super high frequency)(예: 2.NRHz, NRhz) 대역, mm파(millimeter wave)(예: 60GHz) 대역을 포함할 수 있다. 상기 저장부(5-30)는 상기 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장한 다. 특히, 상기 저장부(5-30)는 제2무선 접속 기술을 이용하여 무선 통신을 수행하는 제2접속 노드에 관련된 정 보를 저장할 수 있다. 그리고, 상기 저장부(5-30)는 상기 제어부(5-40)의 요청에 따라 저장된 데이터를 제공한 다.상기 제어부(5-40)는 상기 단말의 전반적인 동작들을 제어한다. 예를 들어, 상기 제어부(5-40)는 상기 기저대역 처리부(5-20) 및 상기 RF처리부(5-10)을 통해 신호를 송수신한다. 또한, 상기 제어부(5-40)는 상기 저장부(5- 40)에 데이터를 기록하고, 읽는다. 이를 위해, 상기 제어부(5-40)는 적어도 하나의 프로세서(processor)를 포함 할 수 있다. 예를 들어, 상기 제어부(5-40)는 통신을 위한 제어를 수행하는 CP(communication processor) 및 응용 프로그램 등 상위 계층을 제어하는 AP(application processor)를 포함할 수 있다. 도 6은 본 개시의 일 실시 예에 따른 기지국의 구조를 도시하는 블록도이다. 상기 도면에 도시된 바와 같이, 상기 기지국은 RF처리부(6-10), 기저대역처리부(6-20), 백홀통신부(6-30), 저장 부(6-40), 제어부(6-50)를 포함하여 구성된다. 상기 RF처리부(6-10)는 신호의 대역 변환, 증폭 등 무선 채널을 통해 신호를 송수신하기 위한 기능을 수행한다. 상기 RF처리부(6-10)는 상기 기저대역처리부(6-20)로부터 제공되는 기저대역 신호를 RF 대역 신호로 상향변환한 후 안테나를 통해 송신하고, 상기 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향 변환한다. 예 를 들어, 상기 RF처리부(6-10)는 송신 필터, 수신 필터, 증폭기, 믹서, 오실레이터, DAC, ADC 등을 포함할 수 있다. 상기 도면에서, 하나의 안테나만이 도시되었으나, 상기 제1접속 노드는 다수의 안테나들을 구비할 수 있 다. 또한, 상기 RF처리부(6-10)는 다수의 RF 체인들을 포함할 수 있다. 나아가, 상기 RF처리부(6-10)는 빔포밍 을 수행할 수 있다. 상기 빔포밍을 위해, 상기 RF처리부(6-10)는 다수의 안테나들 또는 안테나 요소들을 통해 송수신되는 신호들 각각의 위상 및 크기를 조절할 수 있다. 상기 RF 처리부는 하나 이상의 레이어를 전송함으로 써 하향 MIMO 동작을 수행할 수 있다. 상기 기저대역처리부(6-20)는 제1무선 접속 기술의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기 능을 수행한다. 예를 들어, 데이터 송신 시, 상기 기저대역처리부(6-20)은 송신 비트열을 부호화 및 변조함으로 써 복소 심벌들을 생성한다. 또한, 데이터 수신 시, 상기 기저대역처리부(6-20)은 상기 RF처리부(6-10)로부터 제공되는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열을 복원한다. 예를 들어, OFDM 방식에 따르는 경 우, 데이터 송신 시, 상기 기저대역처리부(6-20)은 송신 비트열을 부호화 및 변조함으로써 복소 심벌들을 생성 하고, 상기 복소 심벌들을 부반송파들에 매핑한 후, IFFT 연산 및 CP 삽입을 통해 OFDM 심벌들을 구성한다. 또 한, 데이터 수신 시, 상기 기저대역처리부(6-20)은 상기 RF처리부(6-10)로부터 제공되는 기저대역 신호를 OFDM 심벌 단위로 분할하고, FFT 연산을 통해 부반송파들에 매핑된 신호들을 복원한 후, 복조 및 복호화를 통해 수신 비트열을 복원한다. 상기 기저대역처리부(6-20) 및 상기 RF처리부(6-10)는 상술한 바와 같이 신호를 송신 및 수 신한다. 이에 따라, 상기 기저대역처리부(6-20) 및 상기 RF처리부(6-10)는 송신부, 수신부, 송수신부, 통신부 또는 무선 통신부로 지칭될 수 있다. 상기 백홀통신부(6-30)는 네트워크 내 다른 노드들과 통신을 수행하기 위한 인터페이스를 제공한다. 상기 백홀 통신부(6-30)는 상기 주기지국에서 다른 노드, 예를 들어, 보조기지국, 코어망 등으로 송신되는 비트열을 물리 적 신호로 변환하고, 상기 다른 노드로부터 수신되는 물리적 신호를 비트열로 변환한다. 상기 저장부(6-40)는 상기 주기지국의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저 장한다. 특히, 상기 저장부(6-40)는 접속된 단말에 할당된 베어러에 대한 정보, 접속된 단말로부터 보고된 측정 결과 등을 저장할 수 있다. 또한, 상기 저장부(6-40)는 단말에게 다중 연결을 제공하거나, 중단할지 여부의 판 단 기준이 되는 정보를 저장할 수 있다. 그리고, 상기 저장부(6-40)는 상기 제어부(6-50)의 요청에 따라 저장된 데이터를 제공한다. 상기 제어부(6-50)는 상기 기지국의 전반적인 동작들을 제어한다. 예를 들어, 상기 제어부(6-50)는 상기 기저대 역처리부(6-20) 및 상기 RF처리부(6-10)을 통해 또는 상기 백홀통신부(6-30)을 통해 신호를 송수신한다. 또한, 상기 제어부(6-50)는 상기 저장부(6-40)에 데이터를 기록하고, 읽는다. 이를 위해, 상기 제어부(6-50)는 적어도 하나의 프로세서를 포함할 수 있다. 무선 통신 시스템이 발전함에 따라, 특정 조건이 만족될 경우 단말이 타겟 PCell (primary cell)과 타겟 PSCell (primary SCG cell)로 동시에 이동을 수행하는 CHO+CPAC (conditional handover plus conditional PSCell addition and change)가 논의되고 있다. 이때, 네트워크는 기존의 CHO의 설정을 활용해야 할 수 있다. 예를 들어, 네트워크는 CHO+CPAC를 위한 타겟 PCell과 기존의 CHO를 위한 타겟 PCell을 동일하게 설정해야 할 수 있다. 하지만, 상기와 같은 네트워크의 설정 은 시그널링 과정에서 동일한 정보를 중복하여 단말에게 전달하는 문제가 있다. 예를 들어, 동일한 타겟 PCell 에 대한 각 조건부 이동 설정에 항상 추가적인 식별자(예: condReconfig ID)가 소모될 수 있다. 일 예로, 설정가능한 condReconfig ID들의 개수가 최대 8개임을 가정하면, 네트워크는 이것의 절반인 최대 4개의 후보 PCell 들만 단말에게 설정할 수 있다. 또한, 동일한 타겟 PCell에 대한 조건부 재설정(Conditional Reconfiguration) 필드의 데이터 사이즈 자체도 증가될 수 있다. 또한, 기지국들 사이의 노드 간(Inter-node) 시그널링 측면에서, CHO 준비 절차(CHO preparation)를 위한 시그널링과 CHO+CPAC 준비 절차(CHO+CPAC preparation)를 위한 시그널 링이 중복될 수 있다. 이에, 본 개시에서는 상술한 바와 같이 시그널링 중복의 문제를 해소하기 위하여, 단말이 CHO+CPAC 조건을 평가 할 때, CHO 조건만 만족하게 되는 경우의 단말 및 기지국의 동작을 제안한다. 또한 본 개시에서는 네트워크가 제1 조건부 재설정 (예: CHO)와 제2 조건부 재설정 (예: CHO+CPAC) 동작을 동시에 단말에게 요구할 경우에 발생 할 수 있는 문제(예를 들어, CPAC 조건이 만족된 상태에서, 해당 조건과 연관된 CHO 조건 역시 만족된 경우, 단 말이 CHO와 CHO+CPAC 동작 중 어떤 것을 실행할 것인지)를 해소하기 위한 단말 및 기지국의 동작을 제안한다. 도 7은 본 개시의 일 실시 예에 따른 CHO 설정과 CHO+CPAC 설정의 예시를 도시하는 도면이다. 여기서, CHO 설정과 CHO+CPAC 설정은 동일한 단말 변수(UE variable)에 저장되는 것을 가정할 수 있다. 이 경우 상기 설정들을 서로 구분하기 위하여 서로 다른 식별자(예: condReconfig ID) 가 각 설정마다 연계될 수 있다. 또는 CHO 설정과 CHO+CPAC 설정이 별도로 지시되는 경우, 각 다른 종류의 설정은 다른 단말 변수에 저장될 수도 있다. 이 경우는 각 변수 내에서의 condReconfig ID 는 고유하지만, 변수 간 condReconfig ID 는 중복될 수 있 다. 도 7을 참조하면, CHO 설정은 condReconfig ID 1, 2, 3 에 대하여, 각 ID 에 타겟 PCell을 위한 조건 정보 및/ 또는 타겟 PCell의 설정 정보가 연계될 수 있다. 각 타겟 PCell의 설정 정보는 특정 타겟 PSCell의 설정 정보를 포함하거나 연계될 수 있다. 예를 들어 ID 1, 3의 경우 타겟 PCell 정보만 존재하나, ID 2는 타겟 PCell 2 와 타겟 PSCell 3의 설정 정보가 함께 연관될 수 있다. 이와 같은 설정은 네트워크 구현에 따를 수 있다. 여기서 “CHO 조건” 은 특정 CHO 설정에 연계된 타겟 PCell로의 CHO 수행을 위한 조건을 의미할 수 있다. CHO+CPAC 설정의 경우, condReconfig ID가 4에서 7까지 할당될 수 있으며, 각 ID 마다 타겟 PCell을 위한 조건 (예를 들어, type 1 조건), 타겟 PSCell을 위한 조건 (예를 들어, type 2 조건), 타겟 PCell 설정 및 타겟 PSCell 설정 중 적어도 하나와 연계될 수 있다. 예를 들어 CHO+CPAC 의 경우, type 1 조건 및 type 2 조건은 항상 설정되어야 하고, 마찬가지로 타겟 PCell 설정 및 타겟 PSCell 설정 역시 항상 존재해야 할 수 있다. CHO+CPAC 관련하여 “CHO 조건” 은 특정 CHO+CPAC 설정에 연계된 타겟 PCell 로의 조건, (예를 들어, type 1 조건)을 의미할 수 있다. 또한 “CPAC 조건” 은 특정 CHO+CPAC 설정에 연계된 타겟 PSCell 로의 조건 (예를 들 어, type 2 조건)을 의미할 수 있다. 본 개시의 일 실시예서는 다음의 시나리오들 중 하나의 경우를 고려할 수 있다. - 단말에 CHO+CPAC 설정만 존재할 경우, - CHO+CPAC 설정과 CHO 설정이 동시에 단말에게 주어지고, CHO를 위한 특정 조건과 CHO+CPAC를 위한 특정 CHO 조건(type 1 조건)이 동시에 만족할 때, 단말은 상기 CHO 조건(type 1 조건)을 가지고 있는 CHO+CPAC 설정을 적 용(사용)하여 CHO+CPAC을 수행하도록 네트워크가 결정하여 단말에게 설정해 준 경우 상기 시나리오들에서, CHO+CPAC 설정에 연관되는 어떠한 CPAC 조건도 만족되지 않았고 특정 CHO 조건이 만족된 경우, 단말은 CHO+CPAC를 수행할 수 있다. 이 때, 단말은 하기와 같이 동작할 수 있다. - 만족된 CHO 조건과 연계된 CHO+CPAC 설정이 하나인 경우, 단말은 상기 만족된 CHO 조건과 연계된 CHO+CPAC 설 정을 적용할 수 있다. ■ 이 때 단말은 상기 CHO+CPAC 설정 그대로 적용할 수 있다; ■ 또는, 단말은 상기 CHO+CPAC 설정 내에서 SCG 설정 부분을 제외한 나머지 부분 만을 적용 할 수 있다; - 만족된 CHO 조건과 연계된 CHO+CPAC 설정들이 다수인 경우, ■ 만약 다수의 타겟 PCell들(또는 다수의 후보 타겟 PCell들, 이하 혼용하기로 한다)에 대한 조건들이 만족될 경우 ◆ 단말은 우선 다수의 타겟 PCell들 중, CHO+CPAC 설정의 CHO 수행의 대상이 되는 특정 타겟 PCell을 다음 방 법들 중 적어도 하나에 기반하여 선택할 수 있다. ● 단말 구현에 따라 임의로 선택 ● 상기 타겟 PCell들 중 가장 강한 수신 신호 세기(best received signal strength) 를 갖는 PCell을 선택 ● 상기 타겟 PCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 개수가 최대(maximum number of beams over threshold)인 PCell을 선택 ● 상기 타겟 PCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 평균이 가장 좋은(best average of beams which is over the threshold) PCell을 선택 ◆ 이후, 선택된 타겟 PCell에 대하여 만족된 상기 CHO 조건과 연계된 CHO+CPAC 설정들이 여전히 다수인 경우, (예를 들어 동일 타겟 PCell에 대하여 다수의 타겟 PSCell 들이 존재할 경우) 추가적으로 단말은 다수의 타겟 PSCell들(또는 다수의 후보 타겟 PSCell들, 이하 혼용하기로 한다) 중에서 CPAC 수행 대상이 되는 특정 타겟 PSCell을 선택하는 동작을 수행할 수 있다. ■ 만족된 CHO 조건들의 타겟 PCell이 동일하고, 상기 타겟 PCell과 연관된 타겟 PSCell들이 다수인 경우, ◆ 단말은 다수의 타겟 PSCell들 중에서 CPAC 수행 대상이 되는 특정 타겟 PSCell을 선택할 수 있다. 예를 들 어, 단말은 동일한 타겟 PCell 을 갖는 CHO+CPAC 설정들 중 특정 타겟 PSCell 을 선택하는 방법으로서 다음과 같은 동작들 중 적어도 하나를 수행할 수 있다. ● 단말 구현에 따라 임의로 선택 ● 네트워크(일례로 master node; MN)는 상기와 같은 경우에서 단말이 선택할 특정 PSCell 정보를 단말에게 설정할 수 있다. 여기서 PSCell 정보로는 다음 중 적어도 하나가 포함될 수 있다. ▲ 선택할 PSCell의 식별자 (예: physical cell ID; PCI) 및/또는 주파수 (예: absolute radio frequency channel number; ARFCN 값) 정보 ▲ 선택할 PSCell을 포함하고 있는 CHO+CPAC의 condReconfig ID 정보 ▲ 조건부 재설정(conditional reconfiguration)들의 리스트에서, 가장 작은 값(또는 가장 큰 값, 또는 상 기 리스트의 첫번째 엔트리, 또는 상기 리스트의 마지막 엔트리)인 condReconfig ID을 갖는 CHO+CPAC 설정의 PSCell을 선택 (이 경우, 네트워크는 해당 PSCell의 CHO+CPAC 설정에 ID 할당 시 우선순위를 설정할 수 있다.) ● 상기 다수의 타겟 PSCell들 중, 만약 현재 단말의 이중 연결(dual connection) 상의 PSCell이 존재할 경 우, 해당 PSCell을 선택 ● 상기 다수의 타겟 PSCell들 중, 무선 신호가 가장 좋은 PSCell을 선택 ▲ 상기 타겟 PSCell들 중 가장 강한 수신 신호 세기(best received signal strength)를 갖는 PSCell을 선 택 ▲ 상기 타겟 PSCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 개수가 최대(maximum number of beams over threshold)인 PSCell을 선택 ▲ 상기 타겟 PSCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 평균이 가장 좋은(best average of beams which is over the threshold) PSCell을 선택 ● 상기 다수의 타겟 PSCell들 중, S-criteria 를 만족하는 임의의 PSCell을 선택 ● 상기 동작들은 순차적 또는 선택적으로 조합되어 적용될 수 있다. 예를 들어, 만약 현재 PSCell이 상기 조 건이 만족된 다수의 PSCell들에 포함되지 않는다면, 단말은 가장 강한 수신 신호 세기(best received signal strength)를 갖는 pscell 을 선택할 수 있다. ■ 단말은 상술한 바에 따라 선택된 타겟 PCell 과 타겟 PSCell 조합을 갖는 CHO+CPAC 설정을 단말이 적용할 대 상으로 고려할 수 있다. 단말은 상기 CHO+CPAC 설정에 대하여 다음과 같이 부분적으로 또는 전체적으로 설정을 적용할 수 있다. ◆ 단말은 상기 CHO+CPAC 설정 전체를 적용할 수 있다, 예를 들어 단말은 conditionalReconfiguration 에서 condRRCReconfig 필드에 포함되는 RRCReconfiguration 메시지를 적용할 수 있다. ◆ 단말은 상기 CHO+CPAC 설정에서, SCG 설정을 제외한 부분을 적용할 수 있다. ◆ 단말은 상기 CHO+CPAC 설정에서, PCell 및/또는 PCell 및/또는 전체 CHO+CPAC 설정의 reference 설정으로 지시되는 부분을 적용할 수 있다. 도 8은 본 개시의 일 실시 예에 따른 단말의 동작을 도시하는 순서도이다. 단말은 기지국으로부터 CHO+CPAC 설정 및 관련 조건 정보를 수신할 수 있다. 단말은 수신한 상기 정보를 저장하고, 측정과 함께 조건의 평가를 수행할 수 있다. 이 후, CPAC 관련 조건은 만족되지 않는데, CHO 조건만 만족되는 상황이 발생할 수 있다. 또한 다음의 상황이 추가적으로 가능하다: - 만약 만족된 CHO 조건이 한 개일 경우, 단말은 상기 CHO 조건과 연계된 CHO+CPAC 설정을 선택할 수 있다. - 만약 만족된 CHO 조건들이 다수이며, 각각 다수의 타겟 PCell들과 연계될 경우, 단말은 특정 타겟 PCell을 선 택하고 (이때, 상술한 타겟 PCell 선택 방법들 중 적어도 하나가 적용될 수 있다), 상기 선택된 타겟 PCell에 해당하는 CHO+CPAC 설정이 하나일 경우, 단말은 상기 하나의 CHO+CPAC 설정을 선택할 수 있다. ■ 상기 특정 타겟 PCell을 선택한 후, 상기 선택된 타겟 PCell과 상응하는 CHO+CPAC 설정들이 다수일 경우, 단 말은 추가적으로 특정 타겟 PSCell을 선택할 수 있다(이때, 상술한 타겟 PSCell 선택 방법들 중 적어도 하나가 적용될 수 있다). 그리고, 단말은 선택된 타겟 PCell과 타겟 PCell의 조합을 갖는 CHO+CPAC 설정을 선택할 수 있다. - 만약 만족된 CHO 조건들이 하나의 타겟 PCell에 대한 것이면서, 동시에 다수의 타겟 PSCell들과 연계될 경우, 상술한 바와 같이 특정 타겟 PSCell을 선택하기 위한 동작을 수행할 수 있다. 그리고, 단말은 선택된 타겟 PCell과 타겟 PCell의 조합을 갖는 CHO+CPAC 설정을 선택할 수 있다. 상기 동작들을 통하여 선택된 CHO+CPAC 설정에 대하여, 단말은 상기 CHO+CPAC 설정의 전체 또는 일부분을 적용 하여 CHO+CPAC를 실행할 수 있다. 도 9는 본 개시의 일 실시 예에 따른 시구간별 CHO 설정과 CHO+CPAC 설정의 예시를 도시하는 도면이다. 단말이 기지국으로부터 CHO 설정을 단독으로 제공받거나 또는 CHO+CPAC 설정을 동시에 제공받는 경우를 가정한 다. 도 9를 참조하면, 특정 시간(T1) 에 CHO+CPAC 설정의 조건들 중 이미 PSCell 1, 2, 3을 위한 조건들은 만족된 상태에서 CHO+CPAC 설정의 조건들 중 PCell들을 위한 조건은 만족된 것이 없다. 동일한 시간 T1에, 마찬가지로 CHO 설정의 조건들 중 PCell들을 위한 조건 역시 만족된 것이 없다. 네트워크는 CHO에 대한 것이든 CHO+CPAC에 대한 것이든 동일한 타겟 PCell에 대한 조건은 동일하게 설정할 수 있다. 따라서, 이러한 경우 CHO+CPAC과 CHO 는 시간 T1 에서 수행되지 않을 수 있다. 이후 특정 시간 (T2) 에서, CHO+CPAC 설정의 PSCell들에 대한 조건들이 여전히 만족된 상태에서 PCell들의 조건 들 중 일부가 만족이 될 수 있다. 이 때, CHO+CPAC 설정의 (PCell 1, PSCell 1)과 (PCell 2, PSCell 2)에 대한 조건들이 만족되고, 동시에 CHO 설정의 PCell 1과 PCell 2에 대한 조건들이 만족될 수 있다. 따라서, 이러한 경 우 단말은 CHO+CPAC 설정에서 트리거된 PCell 및 PSCell의 조합들 중 하나를 선택하고, 및/또는 CHO 설정에서 트리거된 PCell들 중 하나를 선택하는 방법이 정의될 필요가 있다. 상술한 시나리오에서 단말은 다음 중 적어도 하나 또는 이들의 조합에 따른 동작을 수행할 수 있다. Opt 1. 단말은 CHO+CPAC를 우선적으로 수행할 수 있다. 단말은 CHO의 타겟 PCell과 연계된 조건이 만족되면, CHO+CPAC 설정 중, 동일한 타겟 PCell이 존재하고, 해당 타겟 PCell에 대한 조건이 만족되었고, 조건이 만족된 타겟 PCell과 연계된 CHO+CPAC 설정의 타겟 PSCell의 조 건이 만족되었는지 여부를 판단할 수 있다. 만약 CHO+CPAC 설정 상의 타겟 PCell 및 타겟 PSCell에 대한 조건들 이 모두 만족된 상태라면, 단말은 CHO를 수행하지 않고 CHO+CPAC을 수행할 수 있다. 한편 상기 CHO+CPAC 설정의 타겟 PCell 및/또는 타겟 PSCell임을 구분(식별)하기 위하여 단말은 다음 중 적어도 하나 또는 이들의 조합을 판단 기준으로 고려할 수 있다. - 단말 변수(variable)에 저장된 condReconfig ID에 해당하는 condRRCReconfig 에 타겟 PCell 을 위한 조건과 타겟 PSCell 을 위한 조건이 동시에 연계되어 단말에게 설정될 경우, 단말은 타겟 PCell 및/또는 타겟 PSCell이CHO+CPAC 설정에 대한 것으로 고려할 수 있다. - CHO+CPAC 전용 단말 변수(variable)에 저장된 모든 condReconfig ID 들에 condRRCReconfig 에 대하여, 단말 은 타겟 PCell 및/또는 타겟 PSCell이 CHO+CPAC 설정에 대한 것으로 고려할 수 있다. - 단말 변수(variable)에 저장된 condReconfig ID들 중, CHO+CPAC 용도의 ID set 에 해당하는 condReconfig ID 의 condRRCReconfig 에 대하여, 단말은 타겟 PCell 및/또는 타겟 PSCell이 CHO+CPAC 설정에 대한 것으로 고려 할 수 있다. 본 개시의 일 실시예에 따르면, 설정된 조건들이 동시에 만족하는 다수의 conditional reconfiguration들 중, 상기 CHO+CPAC 설정의 두 조건 (즉, type 1 조건 및 type 2 조건)을 모두 만족할 경우, 단말은 CHO+CPAC 설정 을 우선적으로 적용하고, 만약 그렇지 않다면, 단말은 CHO 설정 또는 CPAC 설정을 구분하여 각 조건이 만족될 때, 만족된 조건과 연계된 CHO 설정 또는 CPAC 설정을 적용할 수 있다. 도 10은 본 개시의 일 실시 예에 따른 단말의 CHO+CPAC 설정을 우선적으로 적용하는 동작을 도시하는 순서도이 다. 단말이 conditional Reconfiguration 필드를 네트워크로부터 수신할 때, 상기 conditional Reconfiguration 필 드는 CHO 설정 및/또는 CHO+CPAC 설정을 포함할 수 있다. 상기 설정을 수신하면, 단말은 단말 변수(variable)에 각 설정을 저장할 수 있다. 그리고 단말은 각 설정에 포함된 조건에 해당하는 측정을 수행하고 각 조건을 만족 하는지에 대한 평가를 수행할 수 있다. 단말의 평가 수행 도중 하나 또는 다수의 조건들이 만족되고, 이때 만족된 조건(들) 중 CHO+CPAC 설정과 연관된 타겟 셀 조합 또는 pair (즉, 타겟 PCell 과 타겟 PSCell)(들)의 조건(들)이 만족될 경우, 단말은 CHO+CPAC설 정과 연관된 타겟 셀 pair 를 적용하거나(하나의 타겟 셀 pair에 대한 조건 만족 시), 또는 하나의 타겟 셀 pair 를 선택하여(다수의 타겟 셀 pair들에 대한 조건들 만족 시) 상기 선택된 타겟 셀 pair로의 이동하기 위해 선택된 CHO+CPAC 설정을 적용할 수 있다. 만약 상기 만족된 조건(들)에 CHO+CPAC 설정과 연관된 타겟 셀 pair 들에 대한 조건들이 포함되지 않을 경우, 다시 말해 하나 이상의 조건부 재설정 조건이 만족되었지만 어떠한 CHO+CPAC 설정과 연관된 타겟 셀 pair에 대 한 조건도 만족하지 않은 경우, 단말은 CHO 타겟 셀 또는 그 외 다른 조건부 재설정의 후보 타겟 셀들 중 조건 을 만족하는 하나를 선택하여 해당 설정을 적용할 수 있다. 추가적으로, 다수의 CHO+CPAC설정과 연관된 타겟 셀 pair들에 대한 조건들이 만족한 경우, 단말은 다음의 기준 을 통하여 추가적으로 타겟 PSCell 을 선택하여, 해당 타겟 PSCell을 타겟 셀 pair 에 포함하고 있는 CHO+CPAC 설정을 선택 및 적용할 수 있다. - 타겟 PSCell들 중 가장 강한 수신 신호 세기(best received signal strength)를 갖는 PSCell - 타겟 PSCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 개수가 최대(maximum number of beams over threshold)인 PSCell - 타겟 PSCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 평균이 가장 좋은(best average of beams which is over the threshold) PSCell Opt 2. 단말은 CHO를 우선적으로 수행할 수 있다. 이를 위하여, 기존의 단말의 동작 중 CHO 의 수행 동작은 그대로 유지하되, 단말이 함께 조건이 만족된 CHO+CPAC 설정의 적용 여부를 판단하는 동작이 트리거되는 것을 제한할 필요가 있다. 도 11은 본 개시의 일 실시 예에 따른 단말의 CHO 설정을 우선적으로 적용하는 동작을 도시하는 순서도이다. 단말이 conditional Reconfiguration 필드를 네트워크로부터 수신할 때, 상기 conditional Reconfiguration 필 드는 CHO 설정 및/또는 CHO+CPAC 설정을 포함할 수 있다. 상기 설정을 수신하면, 단말은 단말 변수(variable)에 각 설정을 저장할 수 있다. 그리고 단말은 각 설정에 포함된 조건에 해당하는 측정을 수행하고 각 조건을 만족 하는지에 대한 평가를 수행할 수 있다. 단말의 평가 수행 도중 하나 또는 다수의 조건들이 만족되고, 이때 만족된 조건(들) 중 CHO 설정과 연관된 타겟 셀(즉, 타겟 PCell)(들)의 조건(들)이 만족될 경우, 단말은 CHO 설정과 연관된 타겟 PCell셀을 적용하거나(하나 의 타겟 PCell에 대한 조건 만족 시), 또는 하나의 타겟 PCell을 선택하여(다수의 타겟 PCell들에 대한 조건들만족 시) 상기 선택된 타겟 PCell로의 이동하기 위해 선택된 CHO 설정을 적용할 수 있다. 만약 상기 만족된 조건(들)에 CHO 설정과 연관된 타겟 PCell들에 대한 조건들이 포함되지 않을 경우, 다시 말해 하나 이상의 조건부 재설정 조건이 만족되었지만 어떠한 CHO 설정과 연관된 타겟 PCell에 대한 조건도 만족하지 않은 경우, 단말은 CHO+CPAC 타겟 셀 pair 또는 그 외 다른 조건부 재설정의 후보 타겟 셀들 중 조건을 만족하 는 하나를 선택하여 해당 설정을 적용할 수 있다. 추가적으로, 다수의 CHO 설정과 연관된 타겟 PCell들에 대한 조건들이 만족한 경우, 단말은 다음의 기준을 통하 여 추가적으로 타겟 PCell 을 선택하여, 해당 타겟 PCell에 대한 CHO 설정을 선택 및 적용할 수 있다. - 타겟 PCell들 중 가장 강한 수신 신호 세기(best received signal strength)를 갖는 PCell - 타겟 PCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 개수가 최대(maximum number of beams over threshold)인 PCell - 타겟 PCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 평균이 가장 좋은(best average of beams which is over the threshold) PCell Opt 3. 단말은 CHO 설정 및 CHO+CPAC 설정 중에서 다음의 기준을 통하여 타겟 PCell들 중 하나의 타겟 PCell을 선택하여 해당 설정을 적용할 수 있다. - 타겟 PCell들 중 가장 강한 수신 신호 세기(best received signal strength)를 갖는 PCell - 타겟 PCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 개수가 최대(maximum number of beams over threshold)인 PCell - 타겟 PCell들 중 신호 세기가 특정 임계 값을 초과하는 빔들의 평균이 가장 좋은(best average of beams which is over the threshold) PCell 만약 상기 선택된 타겟 PCell을 포함하는 타겟 셀 pair에 대한 CHO+CPAC 설정이 다수일 경우, 단말은 상기 Opt 1의 PSCell 선택 기준을 사용하여 추가적으로 하나의 CHO+CPAC 설정을 결정할 수 있다. Opt 4. 단말이 구현에 따라 조건이 만족된 다수의 CHO 설정 및 CHO+CPAC 설정들 중에서 적용할 설정을 임의로 선택할 수 있다. Opt 5. 기지국은 CHO 설정 및 CHO+CPAC 설정의 조건들이 동시에 만족할 경우 단말이 적용해야 할 설정을 명시적 으로 신호해 줄 수 있다. 예를 들면 기지국은 단말이 적용할 특정 PCell에 대한 정보 (예: PCI 및/또는 ARFCN) 또는 특정 PSCell에 대한 정보 (PCI 및/또는 AFRCN) 또는 특정 설정의 condReconfig ID중 적어도 하나를 단말 에게 RRC 시그널링/MAC CE/DCI를 통해 지시할 수 있다. 상술한 각 option 들에서, 단말이 만약 CHO를 수행할 경우, 단말은 해당 CHO 설정을 적용하고, 저장하고 있던 조건부 이동의 설정을 지울 수 있다. 예를 들면, 단말은 저장하고 있던 CHO 설정만 지우거나, CHO+CPAC 설정만 지우거나, 또는 CHO 및 CHO+CPAC 설정을 모두 지울 수 있다. 또한 단말은 RRCReconfigurationComplete 메시지 를 선택된 CHO를 위한 타겟 PCell로 전송할 수 있다 마찬가지로 상술한 각 option 들에서, 단말이 만약 CHO+CPAC를 수행할 경우, 단말은 해당 CHO+CPAC 설정을 적용 하고, 저장하던 조건부 이동 설정을 지울 수 있다. 예를 들면, 단말은 저장하고 있던 CHO 설정만 지우거나, CHO+CPAC 설정만 지우거나, 또는 CHO 및 CHO+CPAC 설정을 모두 지울 수 있다. 또한, 단말은 RRCReconfigurationComplete 메시지를 선택된 CHO+CPAC를 위한 타겟 PCell로 전송할 수 있다. 이 때, 상기 RRCReconfigurationComplete 메시지에는 다음의 정보 중 적어도 하나 또는 이들의 조합이 포함될 수 있다. - 수행된 동작이 CHO+CPAC 설정이라는 지시자 - 선택된 CHO+CPAC 설정의 ID, 일례로 단말에게 전달된 선택된 CHO+CPAC 설정의 condReconfig ID 값 - 선택된 타겟 PCell의 ID (예를 들어, PCI 및/또는 ARFCN) 및 선택된 타겟 PSCell의 ID (예를 들어, PCI 그리 고 및/또는 ARFCN) 중 적어도 하나 - 상기 선택된 타겟 PSCell을 운용하는 타겟 SN(secondary node) 의 ID (일례로 CGI (cell global ID), 또는 gNB ID 등)- 타겟 SN에게 CHO+CPAC 수행이 완료되었음을 알리기 위한 메시지 (일례로, SN RRCReconfigurationComplete 메 시지) ■ 여기서, 상기 SN RRCReconfigurationComplete 메시지는 상기에 나열한 정보들 중 일부가 포함될 수 있다. 상기 RRCReconfigurationComplete 메시지가 타겟 PCell에게 전달된 후, 상기 타겟 PCell을 운용하는 타겟 MN(master node)은 단말이 CHO+CPAC를 수행했음을 인지하고, 상기 RRCReconfigurationComplete 메시지에 포함 된 정보(예를 들어 타겟 PSCell의 ID)를 통해, 선택된 타겟 PSCell을 운용하는 타겟 SN 에게 CHO+CPAC 수행이 완료되었음을 알리기 위한 메시지 (일례로 상기 SN RRCReconfigurationComplete 메시지)를 전송할 수 있다. 타 겟 SN은 상기 메시지에 포함된 정보에서 타겟 PSCell을 인지할 수 있다. 또한 타겟 MN은 소스 MN 에게 타겟 MN 으로의 핸드오버가 성공했음을 알리는 메시지를 전송할 수 있다. 상기 메시지는 Xn 인터페이스를 통해 전송되는 Handover Success 메시지일 수 있다. 상기 메시지에는 단말의 ID 및/또는 성공한 핸드오버가 CHO인지 또는 CHO+CPAC인지를 지시하는 지시자가 포함될 수 있다. 상술한 바와 같이 네트워크가 CHO 설정과 CHO+CPAC 설정이 공존하도록 단말에게 설정 정보를 제공할 때, 아래와 같은 방법이 고려될 수 있다. 기존의 CHO 설정 정보는 PCell 설정 뿐만 아니라, PSCell 설정까지 포함할 수 있다. 예를 들어 CHO 설정은 PCell 1+PSCell 1의 설정을 포함할 수 있다. 또한 CHO+CPAC 설정 정보는 PCell 1+PSCell 1의 설정을 포함할 수 있다. 상기의 경우, condRRCReconfig 의 내용(예를 들어, RRCReconfiguration 메시지)은 동일할 수 있다. 이에 따라, 만약 CHO 의 타겟 PCell 과 CHO+CPAC 의 타겟 PCell이 동일하고, 네트워크에서 생성한 PCell 설정이 동일한 경우, 시그널링 부담을 낮추기 아래와 같은 방법들 중 적어도 하나 또는 이들의 조합이 적용될 수 있다. Opt 1. 동일한 단말 변수(variable)를 이용하여 각 설정이 저장될 경우, 기존의 condRRCReconfig 필드에 옥텟 스트링(octet string)에 추가로 condReconfig ID가 포함될 수 있다. 단말은 기존과 같이 condRRCReconfig 필 드에 해당하는 설정 정보(CHO 설정 또는 CHO+CPAC 설정)는 octet string 에 포함되고, 추가적으로 상기 condReconfig ID 가 존재할 경우, 해당 ID는 각각 CHO+CPAC 설정 또는 CHO 설정에 대한 것이고, 해당 타겟 PCell 및/또는 타겟 PSCell에 대한 설정은 상기 octet string에 포함된 설정과 동일함을 알 수 있다. Opt 2. 동일한 단말 변수(variable)을 이용하여 각 설정이 저장될 경우, condRRCReconfig 필드에 동일한 PCell 설정을 갖는 다른 condReconfig ID가 도입될 수 있다. 이 경우, 각 조건 정보 역시 condReconfig ID 와 연계되 어 리스트에 포함될 수 있다. Opt 3. CHO 설정 및 CHO+CPAC 설정이 서로 다른 단말 변수(variable)에 저장될 경우, 한쪽 variable의 condRRCReconfig 필드에 octet string 및 condReconfig ID 가 추가로 포함될 수 있다. 여기서 단말은 상기 condReconfig ID에 대해 다른 variable의 condReconfig ID를 참조할 수 있다. Opt 4. CHO 설정 및 CHO+CPAC 설정에 대해 기존과 동일한 condRRCReconfig 를 그대로 반복하여 사용될 수 있다. 본 발명의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 발명의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 상기 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또 는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접 근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장 치는 외부 포트를 통하여 본 발명의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도 의 저장장치가 본 발명의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 발명의 구체적인 실시 예들에서, 발명에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 발명이 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라하더라도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 발명의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 발명의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 발명의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2023-0097752", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 LTE 시스템의 구조를 도시하는 도면이다. 도 2는 본 개시의 일 실시 예에 따른 LTE 시스템의 무선 프로토콜 구조를 도시하는 도면이다. 도 3은 본 개시의 일 실시 예에 따른 차세대 이동통신 시스템의 구조를 도시하는 도면이다. 도 4는 본 개시의 일 실시 예에 따른 차세대 이동통신 시스템의 무선 프로토콜 구조를 도시하는 도면이다. 도 5는 본 개시의 일 실시 예에 따른 단말의 구조를 도시하는 블록도이다. 도 6은 본 개시의 일 실시 예에 따른 기지국의 구조를 도시하는 블록도이다. 도 7은 본 개시의 일 실시 예에 따른 CHO 설정과 CHO+CPAC 설정의 예시를 도시하는 도면이다. 도 8은 본 개시의 일 실시 예에 따른 단말의 동작을 도시하는 순서도이다. 도 9는 본 개시의 일 실시 예에 따른 시구간별 CHO 설정과 CHO+CPAC 설정의 예시를 도시하는 도면이다. 도 10은 본 개시의 일 실시 예에 따른 단말의 CHO+CPAC 설정을 우선적으로 적용하는 동작을 도시하는 순서도이 다 도 11은 본 개시의 일 실시 예에 따른 단말의 CHO 설정을 우선적으로 적용하는 동작을 도시하는 순서도이다."}
