{"patent_id": "10-2023-0096133", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0015124", "출원번호": "10-2023-0096133", "발명의 명칭": "무선 충전식 생체 삽입형 연속 혈당 센서", "출원인": "주식회사 지와이", "발명자": "이응석"}}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "생체 내에 삽입된 상태에서 혈당을 측정하는 연속 혈당 센서(100)에 있어서,혈액 또는 세포간액에 포함된 당(Glucose)의 변화하는 농도를 연속적으로 감지하는 센서부(10)와,상기 센서부(10)의 당의 농도에 관한 신호를 저장하는 메모리(30)와,상기 센서부(10)와 메모리(30)에 전력을 공급하는 전력모듈(40)와,상기 메모리부(20)의 당의 농도에 관한 데이터를 생체 외부 기기에 전송하는 제1 통신부(50),로 구성되는 것을특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 전력모듈(40)은, 상기 센서부(10)와 메모리(30)에 전력을 공급하는 배터리(41)와,상기 배터리(41)를 충전시키는 전력 수신 코일(45)을 구비하고,상기 전력 수신 코일(45)은 생체 외부의 전력 송신 코일(530)의 전력에 기인하여 전력을 무선을 충전시키는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 센서부(10)와 메모리(30)와 전력모듈(40)과 제1 통신부(50)을 제어하는 제어부(60)를 더 포함하여 구성되고, 상기 메모리(30)와 전력모듈(40)과 제1 통신부(50)과 제어부(60)는 3차원 곡면을 갖는 인체 친화형 캡슐(70)로둘러싸이고,상기 센서부(10)의 감지 영역(10a)는 상기 캡슐(70)의 외부로 노출되는 것을 특징으로 하는 무선 충전식 생체삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,휴대용 단말기 또는 스마트폰(200) 중에서 선택되는 하나로 이루어진 인체 외부 단말기(200)를 더 포함하여 구성되고, 상기 인체 외부 단말기(200)는,상기 제1 통신부(50)로부터 시간에 따른 당(Glucose)에 관한 정보를 수신하는 제2 통신부(210)와,상기 제2 통신부(210)부터 수신된 당(Glucose)에 관한 정보를 디스플레이에 출력시키는 혈당 관리 프로그램을공개특허 10-2025-0015124-3-내장하는 프로세서(제2 제어부, 220)와,상기 제2 제어부(220)와 연결되어 당(Glucose)에 관한 정보를 시각적으로 표출하는 디스플레이(230)를 포함하여구성되는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 센서부(10)의 감지영역(10a)는세포간액(Intercellular fluid; ICF)에 포함된 당을 검지하는 당 검지 전극(working electrode)과 참조 전극(reference electrode, 또는 대향전극)을 구비하고,상기 당 검지 전극와 참조 전극의 전위차를 감지하여 당(Glucose)의 농도를 감지하거나, 당(Glucose, 포도당)의글루코스 산화효소에 의한 효소촉매반응에 의해 생성된 과산화수소(H2O2)가 분해 반응(2H+, 2e-, O2)에 따른 전류를 감지하여 당(Glucose) 의 농도를 감지하는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 센서부(10)는 상기 전극들의 전위차를 감지하는 전위차계(11)와,전위차계(11)의 아날로그 신호를 디지털 신호로 변환하여 제어부(60)로 전달하는 A/D 컨버터(13)를 포함하여 구성되는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서,상기 센서부(10)는빛을 자파를 발생시키는 광원(15)과,상기 감지 영역(10a)의 세포간액(Intercellular fluid; ICF)으로부터 반사되는 빛을 수광하는 수광부(16)와,상기 수광부에서 수신된 반사파의 세기 또는 주파수를 분석하는 광학분석부(17)를 포함하는 것을 특징으로 하는무선 충전식 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 제어부(60)는 센서부(10)를 통해 3 ~ 10분 간격으로 당의 농도를 측정하여 상기 메모리(30)에 저장하고, 상기 제2 제어부(220)는 상기 제1 통신부(50, 송신부)와 상기 제2 통신부(210, 수신부)를 통해 상기 당의 농도를 호출하여 감시하고,상기 혈당 관리 프로그램(App)은 음식과 운동에 대한 이벤트 관리부를 구비하고, 상기 이벤트 관리부는 사용자인터페이스를 위해 음식 종류 선택 버튼 또는 입력창(M1), 음식 량 선택 버튼 또는 입력창(M2), 음식 시간 입력버튼 또는 입력창(M3)과,운동의 종류, 운동 강도, 운동 시간에 관한 입력 버튼 또는 입력창을 제공하며, 상기 이벤트 관리부는 시간에 따른 당의 농도를 시각적으로 표출할 때 사용자에 의해 입력된 음식과 운동에 관공개특허 10-2025-0015124-4-한 이벤트를 그래프에 함께 표출하는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 혈당 관리 프로그램(App)은 인슐린 투약, 약의 복용, 운동, 및 음식을 포함하는 이벤트 정보와 사용자의당의 농도에 관한 정보를 서버(300)에 전송하고,상기 서버는 이벤트 정보와 사용자의 당의 농도에 관한 정보를 인공지능으로 학습한 당의 농도와 이벤트 학습결과를 상기 프로세서(220)에 제공하고,상기 프로세서(220)는 당의 농도와 이벤트 학습 결과를 바탕으로 하여, 현재 사용자의 당의 농도를 입력으로 하여 미래의 이벤트를 사용자에게 출력하는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제8항 중 하나의 청구항에서 선택된 무선 충전식 생체 삽입형 연속 혈당 센서와 무선 충전식 생체삽입형 연속 혈당 센서를 충전하는 웨어러블 충전 수단(500)으로 구성되되,상기 웨어러블 충전 수단(500)은 상기 전력 수신 코일(45)에 전자기 유도(electromagnetic induction) 방식으로 전력을 공급하는 전력 송신 코일(530)과,유선으로 전력소스와 연결되는 연결단자(511)와 전력 저장 수단으로 구성되는 제2 배터리(510)와,상기 전력 송신 코일(530)과 제2 배터리(510)가 지지되는 패드(501)와,상기 패드(501)를 신체에 부착시키기 위한 수단을 이루는 부착 수단(540)으로 구성되는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서 시스템."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 부착 수단(540)은 상기 패드(501)의 가장자리를 둘러서 형성되는 점ㅁ착성분을 갖는 부착수단이거나,손목, 팔목, 다리를 감싸는 형태의 밴드 또는 고리를 포함하는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서 시스템."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제3항에 있어서,상기 제어부(60)는 전력모듈(40)의 배터리(41)의 충전 상태를 감시하고, 상기 제어부(60)는 상기 배터리(41)의충전률이 미리 정한 수준에 미달되는 경우 상기 제1 통신부(50)를 통하여 인체 외부의 전자기기에 송신하는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서 시스템."}
{"patent_id": "10-2023-0096133", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "생체 내에 삽입된 상태에서 혈당을 측정하는 연속 혈당 센서에 있어서,혈액 또는 세포간액에 포함된 당(Glucose)의 변화하는 농도를 연속적으로 감지하는 센서부(110)와,상기 센서부(110)에 전력을 공급하는 전력부(130)와,상기 센서부(110)의 당의 농도에 관한 데이터를 생체 외부 기기에 전송하는 통신부(140)로 구성되고,공개특허 10-2025-0015124-5-상기 전력부(130)는, 상기 전력 수신 코일(135)을 구비하고,상기 전력 수신 코일(135)은 생체 외부의 전력 송신 코일(5)의 전력에 기인하여 전력을 무선을 공급 받는 것을특징으로 하는 생체 삽입형 연속 혈당 센서."}
{"patent_id": "10-2023-0096133", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 무선 충전식 생체 삽입형 연속 혈당 센서에 관한 것으로, 생체 내에 삽입된 상태에서 혈당을 측정하는 연속 혈당 센서에 있어서, 혈액 또는 세포간액에 포함된 당(Glucose)의 변화하는 농도를 연속적으로 감지하 는 센서부와, 상기 센서부의 당의 농도에 관한 신호를 저장하는 메모리와, 상기 센서부와 메모 리에 전력을 공급하는 전력모듈와, 상기 메모리부의 당의 농도에 관한 데이터를 생체 외부 기기에 전송하는 제1 통신부,로 구성되는 것을 특징으로 하는 무선 충전식 생체 삽입형 연속 혈당 센서에 관한 것이다."}
{"patent_id": "10-2023-0096133", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 연속 혈당 측정기로서 배터리와 무선 방식의 충전수단이 인체 내부에 구비되어 재충전 할 수 있는 무 선 충전식 생체 삽입형 연속 혈당 센서에 관한 것이다."}
{"patent_id": "10-2023-0096133", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "아이센스 한국특허 제10-2222045호(발명의 명칭 : 연속혈당 측정 장치)는 체액을 추출하여 주기적으로 혈당을측 정할 수 있도록 신체에 삽입 부착 가능하게 형성되는 신체 부착 유닛; 및 상기 신체 부착 유닛이 내부에 결합 고정되도록 형성되며, 상기 신체 부착 유닛이 신체에 삽입 부착되도록 사용자의 조작에 의해 상기 신체 부착 유 닛을 외부 토출하도록 작동하는 어플리케이터를 포함하고, 상기 신체 부착 유닛은, 상기 어플리케이터에 의해 외부 토출되는 하우징과, 상기 하우징 내부에 장착되며 일단부가 상기 하우징으로부터 외부 돌출되어 상기 하우 징의 외부 토출 이동에 따라 신체에 삽입되는 센서 부재와, 상기 하우징의 외부 토출 이동에 따라 상기 센서 부 재와 함께 신체에 삽입되도록 상기 센서 부재의 일단부를 감싸며 상기 하우징에 분리 가능하게 결합되는 바늘부 를 포함하는 연속혈당 측정 장치를 개시한다. 종래의 인체 삽입형 혈당 센서의 경우 배터리 방전에 의해 수명이 다하는 경우가 발생하며 이를 방지하기 위하 여 상대적으로 대용량 배터리를 인체에 이식하여야 하는 문제점이 있었다."}
{"patent_id": "10-2023-0096133", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 채혈로 인한 통증과 번거로움 없이 혈중(또는 간질액) 포도당을 연속적으로 측정할 수 있으며, 또한, 하루 동안의 혈당 변화를 모니터링할 수 있고 저혈당과 고혈당의 이상 증세를 신속하게 파악하고 대처할 수 있 는 무선 충전식 생체 삽입형 연속 혈당 센서를 제공하기 위한 것이다. 본 발명은 종래의 인체 삽입형 혈당 센서의 경우 배터리 방전에 의해 수명이 다하는 경우가 발생하며 이를 방지 하기 위하여 상대적으로 대용량 배터리를 인체에 이식하여야 하는 문제점을 해결한 무선 충전식 생체 삽입형 연 속 혈당 센서를 제공하기 위한 것이다."}
{"patent_id": "10-2023-0096133", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서는 생체 내에 삽입된 상태에서 혈당을 측정하는 연속 혈당 센서에 있어서, 혈액 또는 세포간액에 포함된 당(Glucose)의 변화하는 농도를 연속적으로 감지하는 센서부 와, 상기 센서부의 당의 농도에 관한 신호를 저장하는 메모리와, 상기 센서부와 메모리에 전력을 공급하는 전력모듈와, 상기 메모리부의 당의 농도에 관한 데이터를 생체 외부 기기에 전송하는 제1 통신부로 구성되는 것을 특징이다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 전력모듈은, 상기 센서부와 메모리 에 전력을 공급하는 배터리와, 상기 배터리를 충전시키는 전력 수신 코일을 구비하고, 상기 전력 수신 코일은 생체 외부의 전력 송신 코일의 전력에 기인하여 전력을 무선을 충전시키는 것이 바람직하 다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 센서부와 메모리와 전력모듈과 제1 통신부을 제어하는 제어부를 더 포함하여 구성되고, 메모리와 전력모듈과 제1 통신부과 제 어부는 3차원 곡면을 갖는 인체 친화형 캡슐로 둘러싸이고, 상기 센서부의 감지 영역(10a)는 상기 캡슐의 외부로 노출되는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서는, 휴대용 단말기 또는 스마트폰 중에서 선택되는 하 나로 이루어진 인체 외부 단말기를 더 포함하여 구성되고, 상기 인체 외부 단말기는, 상기 제1 통신 부로부터 시간에 따른 당(Glucose)에 관한 정보를 수신하는 제2 통신부와, 상기 제2 통신부부터 수신된 당(Glucose)에 관한 정보를 디스플레이에 출력시키는 혈당 관리 프로그램을 내장하는 프로세서(제2 제어 부, 220)와, 상기 제2 제어부와 연결되어 당(Glucose)에 관한 정보를 시각적으로 표출하는 디스플레이 를 포함하여 구성되는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 센서부의 감지영역(10a)는 세포간액 (Intercellular fluid; ICF)에 포함된 당을 검지하는 당 검지 전극(working electrode)과 참조 전극(reference electrode, 또는 대향전극)을 구비하고, 상기 당 검지 전극와 참조 전극의 전위차를 감지하여 당(Glucose)의 농 도를 감지하거나, 당(Glucose, 포도당)의 글루코스 산화효소에 의한 효소촉매반응에 의해 생성된 과산화수소 (H2O2)가 분해 반응(2H+, 2e-, O2)에 따른 전류를 감지하여 당(Glucose)의 농도를 감지하는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 센서부는 상기 전극들의 전위차를 감지하는 전위차계와, 전위차계의 아날로그 신호를 디지털 신호로 변환하여 제어부로 전달하는 A/D 컨버터 를 포함하여 구성되는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 센서부는 빛을 자파를 발생시키는 광원 과, 상기 감지 영역(10a)의 세포간액(Intercellular fluid; ICF)으로부터 반사되는 빛을 수광하는 수광부와, 상기 수광부에서 수신된 반사파의 세기 또는 주파수를 분석하는 광학분석부를 포함하여 구성 되는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 제어부는 센서부를 통해 3 ~ 10분 간격 으로 당의 농도를 측정하여 상기 메모리에 저장하고, 제2 제어부는 상기 제1 통신부(50, 송신부)와 상 기 제2 통신부(210, 수신부)를 통해 상기 당의 농도를 호출하여 감시하고, 혈당 관리 프로그램(App)은 음식과 운동에 대한 이벤트 관리부를 구비하고, 상기 이벤트 관리부는 사용자 인터페이스를 위해 음식 종류 선택 버튼 또는 입력창(M1), 음식 량 선택 버튼 또는 입력창(M2), 음식 시간 입력버튼 또는 입력창(M3)과, 운동의 종류, 운동 강도, 운동 시간에 관한 입력 버튼 또는 입력창을 제공하며, 이벤트 관리부는 시간에 따른 당의 농도를 시 각적으로 표출할 때 사용자에 의해 입력된 음식과 운동에 관한 이벤트를 그래프에 함께 표출하는 것이 바람직하 다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 혈당 관리 프로그램(App)은 인슐린 투약, 약의 복용, 운동, 및 음식을 포함하는 이벤트 정보와 사용자의 당의 농도에 관한 정보를 서버에 전송하고, 서버 는 이벤트 정보와 사용자의 당의 농도에 관한 정보를 인공지능으로 학습한 당의 농도와 이벤트 학습 결과를 상 기 프로세서에 제공하고, 프로세서는 당의 농도와 이벤트 학습 결과를 바탕으로 하여, 현재 사용자의당의 농도를 입력으로 하여 미래의 이벤트를 사용자에게 출력하는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서(시스템)는, 무선 충전식 생체 삽입형 연속 혈당 센서와 무 선 충전식 생체 삽입형 연속 혈당 센서를 충전하는 웨어러블 충전 수단을 더 포함하고, 웨어러블 충전 수 단은 상기 전력 수신 코일에 전자기 유도(electromagnetic induction) 방식으로 전력을 공급하는 전 력 송신 코일과, 유선으로 전력소스와 연결되는 연결단자와 전력 저장 수단으로 구성되는 제2 배터리 와, 전력 송신 코일과 제2 배터리가 지지되는 패드와, 패드를 신체에 부착시키기 위 한 수단을 이루는 부착 수단으로 구성되는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서(시스템)에 있어서, 부착 수단은 상기 패드의 가 장자리를 둘러서 형성되는 점ㅁ착성분을 갖는 부착수단이거나, 손목, 팔목, 다리를 감싸는 형태의 밴드 또는 고 리를 포함하는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서(시스템)에 있어서, 제어부는 전력모듈의 배터리 의 충전 상태를 감시하고, 상기 제어부는 상기 배터리의 충전률이 미리 정한 수준에 미달되는 경우 상기 제1 통신부를 통하여 인체 외부의 전자기기에 송신하는 것이 바람직하다. 생체 내에 삽입된 상태에서 혈당을 측정하는 연속 혈당 센서는, 혈액 또는 세포간액에 포함된 당(Glucose)의 변 화하는 농도를 연속적으로 감지하는 센서부와, 상기 센서부에 전력을 공급하는 전력부와, 상기 센서부의 당의 농도에 관한 데이터를 생체 외부 기기에 전송하는 통신부로 구성되고, 상기 전력부 는, 상기 전력 수신 코일을 구비하고, 상기 전력 수신 코일은 생체 외부의 전력 송신 코일 의 전력에 기인하여 전력을 무선을 공급 받는 것을 특징으로 한다."}
{"patent_id": "10-2023-0096133", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 경우 채혈로 인한 통증과 번거로움 없이 혈중(또는 간질액) 포도당을 연속적으로 측정할 수 있 으며, 또한, 하루 동안의 혈당 변화를 모니터링할 수 있고 저혈당과 고혈당의 이상 증세를 신속하게 파악하고 대처할 수 있는 무선 충전식 생체 삽입형 연속 혈당 센서가 제공된다. 종래의 인체 삽입형 혈당 센서의 경우 배터리 방전에 의해 수명이 다하는 경우가 발생하며 이를 방지하기 위하 여 상대적으로 대용량 배터리를 인체에 이식하여야 하는 문제점을 해결한 무선 충전식 생체 삽입형 연속 혈당 센서가 제공된다."}
{"patent_id": "10-2023-0096133", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 본 발명의 일실시예에 따른 무선 충전식 생체 삽입형 연속 혈당 센서에 대하여 첨부된 도면을 참조하 여 상세하게 설명한다. 도 1은 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서 시스템 전체 구성도, 도 2, 도3은 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서 구성도, 도 4는 본 발명의 인체 외부 단말기(스마트 폰)를 포함하는 무선 충전식 생체 삽입형 연속 혈당 센서 구성도, 도 5a는 본 발명의 전기 화학적 방식 센서부 구성도, 도 5b는 본 발명의 광학 방식 센서부 구성도, 도 6(a, b)은 본 발명의 삽입형 연속 혈당 센서, 웨어러 블 충전수단 구성도, 도 7은 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서 사용상태도이고, 도 8은 본 발 명의 웨어러블 충전수단을 이용한 무선 충전식 생체 삽입형 연속 혈당 센서 사용상태도이다. 도 1 내지 도 3에 도시된 바와 같이, 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서는 생체 내에 삽입된 상태에서 혈당을 측정한다. 연속 혈당 센서는 센서부와 메모리와 전력모듈와 제1 통신부 를 포함한다. 센서부는 혈액 또는 세포간액에 포함된 당(Glucose)의 변화하는 농도를 연속적으로 감지한다. 메모리는 센서부의 당의 농도에 관한 신호를 저장한다. 전력모듈은 센서부와 메모리에 전 력을 공급한다. 제1 통신부는 메모리부의 당의 농도에 관한 데이터를 생체 외부 기기에 전송한다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 센서부와 메모리와 전력모듈과 제1 통신부을 제어하는 제어부를 더 포함하여 구성된다. 메모리와 전력모듈과 제1 통신부과 제어부는 3차원 곡면을 갖는 인체 친화형 캡슐로 둘러 싸이고, 상기 센서부의 감지 영역(10a)는 상기 캡슐의 외부로 노출되는 것이 바람직하다. 인체 친화형 캡슐은 전자소자를 보로하기 위한 비투과성 물질이 바람직하며, 플라스틱 수지 또는 무기재료로 구성될 수 있다. 여기서 사용되는 센서부의 감지영역(10a)은 특정 분석물의 검출을 담당한다. 감지 영역은 일반적으로 비전 도체, 작동 전극, 기준 전극을 포함한다, 본체 상에 전기화학적으로 반응성 표면들을 형성하고 대향 전극을 선 택적으로 포함할 수 있다. <혈당 센서; 감지 방법> 도 3, 도 5a에 도시된 바와 같이, 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 센서부의 감지영역(10a)는 세포간액(Intercellular fluid; ICF)에 포함된 당을 검지하는 당 검지 전극(working electrode)과 참조 전극(reference electrode, 또는 대향전극)을 구비하고, 상기 당 검지 전극와 참조 전극의 전위차를 감지하여 당(Glucose)의 농도를 감지하거나, 당(Glucose, 포도당)의 글루코스 산화효소에 의한 효소촉 매반응에 의해 생성된 과산화수소(H2O2)가 분해 반응(2H+, 2e-, O2)에 따른 전류를 감지하여 당(Glucose)의 농도 를 감지하는 것이 바람직하다. 도 5a에 도시된 바와 같이, 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 센서부는 상기 전극들의 전위차를 감지하는 전위차계와, 전위차계의 아날로그 신호를 디지털 신호로 변환하여 제어부 로 전달하는 A/D 컨버터를 포함하여 구성되는 것이 바람직하다. 작동 전극은 검출 대상물의 효소 촉매 반응에 의해 생성된 과산화수소가 전류를 생성하는 것을 측정한다, 글루 코스 산화효소를 이용한 글루코오스 분석물의 검출은 H2O2을 생성물로 생산한다, H2O2두 개의 양성자 (2H+), 두 개의 전자 (2e)및 한 분자의 산소 (O2)를 생성하는 작업 전극의 표면과 반응하여 전자 전류를 검출한다. 대향전극의 경우, 작동 전극에 의해 생성되는 전류의 균형을 맞추기 위해, 예를 들어, O2이 전극 표면에서 감소된다. 도 5b에 도시된 바와 같이, 본 발명의 다른 실시예에 있어서, 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센 서에 있어서, 센서부는 빛을 자파를 발생시키는 광원과, 상기 감지 영역(10a)의 세포간액 (Intercellular fluid; ICF)으로부터 반사되는 빛을 수광하는 수광부와, 상기 수광부에서 수신된 반사파의 세기 또는 주파수를 분석하는 광학분석부를 포함하여 구성되는 것이 바람직하다. 본 발명의 출원일 이전에 공개된 광학 반사파 분석을 이용한 연속 혈당 측정의 원리는 본 발명의 명세서에 기재된 것으로 보고 그 상세한"}
{"patent_id": "10-2023-0096133", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "설명으로 생략하며 이를 이유로 본 발명의 내용이 불명확해진다고 볼 수 없을 것이다. <무선 충전, 웨어러블 충전> 도 2에 도시된 바와 같이, 전력모듈은 센서부와 메모리에 전력을 공급하는 배터리와, 상기 배 터리를 충전시키는 전력 수신 코일을 구비하고, 전력 수신 코일은 생체 외부의 전력 송신 코일 의 전력에 기인하여 전력을 무선을 충전시킨다. 도 6에 있어서, 전력 수신 코일과 전력 송신 코일을 정렬시킨 후 생체 외부의 전력 송신 코일에 전력을 공급하여 전자기 유도(전력 송신부 코일에서 자기장을 발생시켜 그 자기장의 영향으로 수신부 코일에서 전기가 유도되는 전자기유도 원리)에 의하여 전력 수신 코일에서 전력을 생성시켜서 배터리를 충전할 수 있다. 이와 달리 무선충전의 방식은 코일간 자지 공진을 이용한 자기 공진방식일 수 있으며 본 발명의 범주 에 포함된다. 도 6에 도시된 바와 같이, 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서 시스템는 웨어러블 충전 수단 을 포함한다. 웨어러블 충전 수단은 무선 충전식 생체 삽입형 연속 혈당 센서를 충전하는데 사용된 다. 웨어러블 충전 수단은 전력 수신 코일에 전자기 유도(electromagnetic induction) 방식으로 전력 을 공급하는 전력 송신 코일과, 유선으로 전력소스와 연결되는 연결단자와 전력 저장 수단으로 구성 되는 제2 배터리와, 전력 송신 코일과 제2 배터리가 지지되는 패드와, 패드를 신체에 부착시키기 위한 수단을 이루는 부착 수단으로 구성된다. 도 6, 도 8에 도시된 바와 같이, 부착 수단(54 0)은 패드의 가장자리를 둘러서 형성되는 점착성분을 갖는 부착수단이거나, 손목, 팔목, 다리를 감싸는 형 태의 밴드 또는 고리를 포함하는 것이 바람직하다. 도시된 바와 같이, 본 발명의 연속 혈당 센서 시스템에 있어서, 제어부는 전력모듈의 배터리의 충 전 상태를 감시하고, 제어부는 상기 배터리의 충전률이 미리 정한 수준에 미달되는 경우 제1 통신부 를 통하여 인체 외부의 전자기기에 송신하는 것이 바람직하다. <인체 외부 단말기> 도 4, 도 7에 도시된 바와 같이, 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서는, 휴대용 단말기 또는 스 마트폰 중에서 선택되는 하나로 이루어진 인체 외부 단말기를 더 포함하여 구성되고, 상기 인체 외 부 단말기는, 상기 제1 통신부로부터 시간에 따른 당(Glucose)에 관한 정보를 수신하는 제2 통신부 와, 상기 제2 통신부부터 수신된 당(Glucose)에 관한 정보를 디스플레이에 출력시키는 혈당 관리 프 로그램을 내장하는 프로세서(제2 제어부, 220)와, 상기 제2 제어부와 연결되어 당(Glucose)에 관한 정보를 시각적으로 표출하는 디스플레이를 포함하여 구성되는 것이 바람직하다. 도 4에 도시된 바와 같이, 제1 통신부와 제2 통신부는 센서부에서 측정된 당 농도에 대한 정보를 제2 제어부으로 전송한다. 제1 통신부와 제2 통신부는 블루투스, RF통신, 비콘(Beacon)을 포함하는 근거리 무선 통신 기술을 이용하는 것이 바람직하지만, 상기한 근거리 무선통신 모듈 외 다양한 통신구성이 적용될 수 있으며, 이에 한정하지는 않는다. <제2 제어부 : 혈당 관리 프로그램> 도 4에 도시된 바와 같이, 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 제어부는 센서부 를 통해 3 ~ 10분 간격으로 당의 농도를 측정하여 상기 메모리에 저장하고, 제2 제어부는 상기 제 1 통신부(50, 송신부)와 상기 제2 통신부(210, 수신부)를 통해 상기 당의 농도를 호출하여 감시하고, 혈당 관리 프로그램(App)은 음식과 운동에 대한 이벤트 관리부를 구비하고, 상기 이벤트 관리부는 사용자 인터페이스를 위 해 음식 종류 선택 버튼 또는 입력창(M1), 음식 량 선택 버튼 또는 입력창(M2), 음식 시간 입력버튼 또는 입력 창(M3)과, 운동의 종류, 운동 강도, 운동 시간에 관한 입력 버튼 또는 입력창을 제공하며, 이벤트 관리부는 시 간에 따른 당의 농도를 시각적으로 표출할 때 사용자에 의해 입력된 음식과 운동에 관한 이벤트를 그래프에 함 께 표출하는 것이 바람직하다. 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서에 있어서, 혈당 관리 프로그램(App)은 인슐린 투약, 약의 복용, 운동, 및 음식을 포함하는 이벤트 정보와 사용자의 당의 농도에 관한 정보를 서버에 전송하고, 서버 는 이벤트 정보와 사용자의 당의 농도에 관한 정보를 인공지능으로 학습한 당의 농도와 이벤트 학습 결과를 상 기 프로세서에 제공하고, 프로세서는 당의 농도와 이벤트 학습 결과를 바탕으로 하여, 현재 사용자의 당의 농도를 입력으로 하여 미래의 이벤트를 사용자에게 출력하는 것이 바람직하다. 도시된 바와 같이, 본 발명의 다른 실시예에 있어서, 무선 충전식 생체 삽입형 연속 혈당 센서는 생체 내에 삽 입된 상태에서 혈당을 측정하는 연속 혈당 센서는, 혈액 또는 세포간액에 포함된 당(Glucose)의 변화하는 농도 를 연속적으로 감지하는 센서부와, 상기 센서부에 전력을 공급하는 전력부와, 상기 센서부(11 0)의 당의 농도에 관한 데이터를 생체 외부 기기에 전송하는 통신부로 구성되고, 상기 전력부는, 상 기 전력 수신 코일을 구비하고, 상기 전력 수신 코일은 생체 외부의 전력 송신 코일의 전력에 기 인하여 전력을 무선을 공급 받는 것을 특징으로 한다. 본 발명은 상기에서 언급한 바람직한 실시예와 관련하여 설명됐지만, 본 발명의 범위가 이러한 실시예에 한정되 는 것은 아니며, 본 발명의 범위는 이하의 특허청구범위에 의하여 정하여지는 것으로 본 발명과 균등 범위에 속 하는 다양한 수정 및 변형을 포함할 것이다. 아래의 특허청구범위에 기재된 도면부호는 단순히 발명의 이해를 보조하기 위한 것으로 권리범위의 해석에 영향 을 미치지 아니함을 밝히며 기재된 도면부호에 의해 권리범위가 좁게 해석되어서는 안될 것이다."}
{"patent_id": "10-2023-0096133", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서 시스템 전체 구성도. 도 2, 도3은 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서 구성도. 도 4는 본 발명의 인체 외부 단말기(스마트폰)를 포함하는 무선 충전식 생체 삽입형 연속 혈당 센서 구성도. 도 5a는 본 발명의 전기 화학적 방식 센서부 구성도. 도 5b는 본 발명의 광학 방식 센서부 구성도. 도 6(a, b)은 본 발명의 삽입형 연속 혈당 센서, 웨어러블 충전수단 구성도. 도 7은 본 발명의 무선 충전식 생체 삽입형 연속 혈당 센서 사용상태도. 도 8은 본 발명의 웨어러블 충전수단을 이용한 무선 충전식 생체 삽입형 연속 혈당 센서 사용상태도."}
