{"patent_id": "10-2022-7009792", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0050977", "출원번호": "10-2022-7009792", "발명의 명칭": "의료 이미지 처리 방법, 이미지 처리 방법 및 장치", "출원인": "텐센트 테크놀로지", "발명자": "왕 리앙"}}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버에 의해 실행되는 의료 이미지 처리 방법에 있어서,처리 대상 의료 이미지를 획득하는 단계 - 상기 처리 대상 의료 이미지는 컬러 이미지이고, 상기 처리 대상 의료 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 상기 제1 이미지데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타냄 -;상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 차분 이미지를 생성하는단계; 및이진화된 이미지를 획득하기 위해 상기 차분 이미지에 대해 이진화 처리를 수행하는 단계를 포함하고,상기 이진화된 이미지의 전경(foreground) 영역은 상기 처리 대상 의료 이미지의 병리(pathological) 조직 영역에 해당하는, 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 차분 이미지를 생성하는단계는,상기 처리 대상 의료 이미지에 포함된 상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 최대값 이미지 및 최소값 이미지를 생성하는 단계; 및상기 최대값 이미지와 상기 최소값 이미지에 따라 상기 차분 이미지를 생성하는 단계를 포함하는, 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 최대값 이미지 및 최소값이미지를 생성하는 단계는,상기 제1 이미지 데이터의 제1 픽셀 위치에서의 제1 픽셀값, 상기 제2 이미지 데이터의 제2 픽셀 위치에서의 제2 픽셀값 및 상기 제3 이미지 데이터의 제3 픽셀 위치에서의 제3 픽셀값에 따라 최대 픽셀값 및 최소 픽셀값을결정하는 단계; 및상기 최대 픽셀값에 따라 상기 최대값 이미지를 획득하고, 상기 최소 픽셀값에 따라 상기 최소값 이미지를 획득하는 단계 - 상기 최대값 이미지의 제4 픽셀 위치에서의 픽셀값은 상기 최대 픽셀값이고, 상기 최소값 이미지의제5 픽셀 위치에서의 픽셀값은 상기 최소 픽셀값이며, 상기 제1 픽셀 위치, 상기 제2 픽셀 위치, 상기 제3 픽셀위치, 상기 제4 픽셀 위치 및 상기 제5 픽셀 위치는 모두 상기 처리 대상 의료 이미지의 동일한 픽셀 위치에 대응함 - 를 포함하고,상기 최대값 이미지와 상기 최소값 이미지에 따라 상기 차분 이미지를 생성하는 단계는,상기 최대값 이미지의 제4 픽셀 위치에서의 픽셀값과 상기 최소값 이미지의 제5 픽셀 위치에서의 픽셀값에 따라픽셀 차이를 결정하는 단계; 및상기 픽셀 차이에 따라 상기 차분 이미지를 획득하는 단계공개특허 10-2022-0050977-3-를 포함하고,상기 차분 이미지의 제6 픽셀 위치에서의 픽셀값은 상기 픽셀 차이이고, 상기 제4 픽셀 위치, 상기 제5 픽셀 위치 및 상기 제6 픽셀 위치는 모두 상기 처리 대상 의료 이미지의 동일한 픽셀 위치에 대응하는, 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 차분 이미지를 생성하는단계는,상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 처리 대상 차분 이미지를생성하는 단계; 및상기 차분 이미지를 획득하기 위해 상기 처리 대상 차분 이미지에 대해 가우시안 블러(Gaussian blur) 처리를수행하는 단계를 포함하는, 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 이진화된 이미지를 획득하기 위해 상기 차분 이미지에 대해 이진화 처리를 수행하는 단계는,상기 차분 이미지에 따라 이진화 문턱값을 결정하는 단계; 및상기 이진화된 이미지를 획득하기 위해 상기 이진화 문턱값에 따라 상기 차분 이미지에 대해 이진화 처리를 수행하는 단계를 포함하는, 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 차분 이미지에 따라 이진화 문턱값을 결정하는 단계는,상기 차분 이미지에 따라, N개의 픽셀에 대응하는 N개의 픽셀값을 획득하는 단계 - 상기 픽셀값 및 상기 픽셀은일대일 대응이고, N은 1보다 큰 정수임 -;상기 N개의 픽셀값으로부터 기준 픽셀값을 결정하는 단계 - 상기 기준 픽셀값은 상기 N개의 픽셀값 중 최대값임-; 및상기 기준 픽셀값 및 미리 설정된 비율(proportion)에 따라 상기 이진화 문턱값을 결정하는 단계를 포함하는, 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,플러드(flood) 알고리즘에 기초하여 상기 이진화된 이미지에서 복수의 배경 픽셀을 포함하는 배경 영역을 검출하는 단계;상기 이진화된 이미지 및 상기 이진화된 이미지의 배경 영역에 따라 상기 이진화된 이미지의 전경 영역에서 배경 픽셀을 획득하는 단계 - 상기 전경 영역은 복수의 전경 픽셀을 포함함 -;구멍이 채워진 이미지를 획득하기 위해 상기 이진화된 이미지의 전경 영역의 배경 픽셀을 전경 픽셀로 변경하는단계; 및결과 이미지를 획득하기 위해 상기 구멍이 채워진 이미지에 대해 중간(median) 필터링 처리를 수행하는 단계공개특허 10-2022-0050977-4-를 포함하고,상기 결과 이미지의 전경 영역은 상기 처리 대상 의료 이미지의 병리 조직 영역에 해당하는, 의료 이미지 처리방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 결과 이미지를 획득하기 위해 상기 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행하는 단계는,필터링된 이미지를 획득하기 위해 상기 구멍이 채워진 이미지에 대해 상기 중간 필터링 처리를 수행하는 단계;상기 필터링된 이미지에서 전경 영역의 경계선을 획득하는 단계 - 상기 경계선은 M개의 픽셀을 포함하고, M은 1보다 큰 정수임 -; 및상기 결과 이미지를 획득하기 위해 상기 경계선의 M개의 픽셀 각각을 K 픽셀만큼 바깥쪽으로 확장하는 단계를 포함하고,상기 K는 1 이상의 정수인, 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 처리 대상 의료 이미지를 획득하는 단계는,원본 의료 이미지를 획득하는 단계;슬라이딩 윈도우를 이용하여 상기 원본 의료 이미지로부터 의료 서브 이미지를 추출하는 단계;상기 의료 서브 이미지가 상기 병리 조직 영역을 포함하는 것으로 검출된 경우, 상기 의료 서브 이미지를 상기처리 대상 의료 이미지로 결정하는 단계; 및상기 의료 서브 이미지가 상기 병리 조직 영역을 포함하지 않는 것으로 검출된 경우, 상기 의료 서브 이미지를배경 이미지로 결정하고 상기 배경 이미지를 제거하는 단계를 포함하는, 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,상기 처리 대상 이미지와 상기 처리 대상 이미지의 전경 영역에 따라 타깃 포지티브(positive) 샘플 이미지를생성하는 단계 - 상기 타깃 포지티브 샘플 이미지는 포지티브 샘플 세트의 포지티브 샘플 이미지이고, 각각의포지티브 샘플 이미지는 상기 병리 조직 영역을 포함함 -;네거티브(negative) 샘플 세트를 획득하는 단계 - 상기 네거티브 샘플 세트는 적어도 하나의 네거티브 샘플 이미지를 포함하고, 각각의 네거티브 샘플 이미지는 상기 병리 조직 영역을 포함하지 않음 -; 및상기 포지티브 샘플 세트와 상기 네거티브 샘플 세트에 기초하여 이미지 처리 모델을 트레이닝하는 단계를 더 포함하는 의료 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "서버에서 수행되는 이미지 처리 방법에 있어서,제1 처리 대상 이미지 및 제2 처리 대상 이미지를 획득하는 단계 - 상기 제1 처리 대상 이미지는 컬러이미지고, 상기 제1 처리 대상 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터는 각각 상이한 채널의 컬러정보를 나타냄 -;상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 차분 이미지를 생성하는공개특허 10-2022-0050977-5-단계;이진화된 이미지를 획득하기 위해 상기 차분 이미지에 대해 이진화 처리를 수행하는 단계 - 상기 이진화된 이미지의 전경 영역은 상기 처리 대상 의료 이미지의 병리 조직 영역에 해당함 -;상기 이진화된 이미지의 전경 영역에 따라 상기 제1 처리 대상 이미지로부터 타깃 객체를 추출하는 단계; 및상기 타깃 객체 및 상기 제2 처리 대상 이미지에 따라 합성된 이미지를 생성하는 단계를 포함하고,상기 타깃 객체는 제1 이미지 레이어 상에 있고, 상기 제2 처리 대상 이미지는 제2 이미지 레이어 상에 있으며,상기 제1 이미지 레이어는 상기 제2 이미지 레이어를 커버(cover)하는, 이미지 처리 방법."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "의료 이미지 처리 장치에 있어서,처리 대상 의료 이미지를 획득하도록 구성된 획득 모듈 - 상기 처리 대상 의료 이미지는 컬러 이미지이고, 상기처리 대상 의료 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 상기 제1이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타냄-;상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 차분 이미지를 생성하도록구성된 생성 모듈; 및이진화된 이미지를 획득하기 위해 상기 차분 이미지에 대해 이진화 처리를 수행하도록 구성된 처리 모듈을 포함하고,상기 이진화된 이미지의 전경(foreground) 영역은 상기 처리 대상 의료 이미지의 병리(pathological) 조직 영역에 해당하는, 의료 이미지 처리 장치."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "이미지 처리 장치에 있어서,제1 처리 대상 이미지 및 제2 처리 대상 이미지를 획득하도록 구성된 획득 모듈 - 상기 제1 처리 대상 이미지는컬러 이미지고, 상기 제1 처리 대상 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를포함하며, 상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터는 각각 상이한 채널의컬러 정보를 나타냄 -;상기 제1 이미지 데이터, 상기 제2 이미지 데이터 및 상기 제3 이미지 데이터에 따라 차분 이미지를 생성하도록구성된 생성 모듈;이진화된 이미지를 획득하기 위해 상기 차분 이미지에 대해 이진화 처리를 수행하도록 구성된 처리 모듈 - 상기이진화된 이미지의 전경 영역은 상기 처리 대상 의료 이미지의 타깃 객체에 대응함 -; 및상기 이진화된 이미지의 전경 영역에 따라 상기 제1 처리 대상 이미지로부터 타깃 객체를 추출하도록 구성된 추출 모듈을 더 포함하고,상기 생성 모듈은 또한, 상기 타깃 객체 및 상기 제2 처리 대상 이미지에 따라 합성된 이미지를 생성하도록 구성되고, 상기 타깃 객체는 제1 이미지 레이어 상에 있고, 상기 제2 처리 대상 이미지는 제2 이미지 레이어 상에있으며, 상기 제1 이미지 레이어는 상기 제2 이미지 레이어를 커버(cover)하는, 이미지 처리 장치."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨터 장치에 있어서,메모리, 송수신기, 프로세서, 버스 시스템을 포함하고,상기 메모리는 프로그램을 저장하도록 구성되고,공개특허 10-2022-0050977-6-상기 프로세서는 상기 메모리의 프로그램을 실행하여 제1항 내지 제10항 중 어느 한 항에 따른 방법을 수행하거나 제11항에 따른 방법을 수행하도록 구성되며,상기 버스 시스템은 상기 메모리와 상기 프로세서 간의 통신을 위해 상기 메모리를 상기 프로세서에 연결하도록구성된, 컴퓨터 장치."}
{"patent_id": "10-2022-7009792", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "컴퓨터에서 실행될 때, 상기 컴퓨터로 하여금 제1항 내지 제10항 중 어느 한 항에 따른 방법을 수행하거나 제11항에 따른 방법을 수행하게 하는 명령어를 포함하는 컴퓨터 판독 가능 매체."}
{"patent_id": "10-2022-7009792", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 인공지능 분야에 적용 가능한 의료 이미지 처리 방법, 이미지 처리 방법 및 장치를 개시한다. 본 출원 의 방법은 처리 대상 의료 이미지를 획득하는 단계; 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이 터 및 제3 이미지 데이터에 따라 차분 이미지를 생성하는 단계; 및 이진 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하는 단계를 포함하고, 이진 이미지의 전경 영역은 의료 이미지의 병리 조직 영역에 대 응한다. 본 발명은 이미지에 대해 이진화 처리를 수행하기 전에 상이한 채널의 컬러 정보를 이용하여 차분 이미 지를 생성함으로써 이미지의 컬러 정보를 효과적으로 활용하고, 차분 이미지에 기초한 병리 조직 영역 추출의 정 확도를 향상시키며, 후속 이미지 분석을 용이하게 한다."}
{"patent_id": "10-2022-7009792", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2020년 2월 10일에 중국 국가 지식 재산 관리국에 제출된 \"의료 이미지 처리 방법, 이미지 처리 방법 및 장치\"라는 제목의 중국 특허 출원 번호 202010084678.8에 대한 우선권을 주장하고, 그 전체가 참조로 여기에 포함된다. 본 개시는 인공 지능 분야에 관한 것으로, 특히 이미지 처리 기술에 관한 것이다."}
{"patent_id": "10-2022-7009792", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "의료 기술의 발달과 함께, 전체 슬라이드 이미지(whole slide images, WSI)에 기초하는 인식 및 분석은 의료에 서 중요한 역할을 하고 있다. WSI 이미지의 한 면에는 일반적으로 수만 개의 픽셀이 포함되어 있으므로 분석을 위해 이러한 유형의 이미지를 작은 이미지로 자르거나 축소해야 한다. 이 과정에서, WSI 이미지의 배경 영역의 대부분은 후속 이미지 분석을 위한 병리 조직 슬라이드가 있는 영역을 획득하기 위해 제거되어야 한다. 현재, 병리 조직 영역은 주로 다음과 같은 방법으로 WSI 이미지로부터 추출된다. 먼저 WSI 이미지를 특정 크기 로 축소한 다음, 이미지를 그레이 스케일 이미지로 변환한 다음, 그레이 스케일 이미지에 대해 추가 이미지 처 리(예: 이미지 이진화 처리 및 구멍 제거 처리)를 수행하고, 마지막으로 처리된 이미지로부터 병리 조직 영역을 추출한다. 그러나, 사이즈 변경 후 컬러 이미지를 그레이 스케일 이미지로 직접 변환하는 위와 같은 방식은 컬러 정보의 손실을 초래하며, 컬러 정보 역시 중요한 이미지 특징이다. 그 결과, 추출된 병리 조직 영역은 정확하지 않고, 이는 후속 이미지 분석에서 오류를 쉽게 발생시킨다."}
{"patent_id": "10-2022-7009792", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 이미지에 대해 이진화 처리를 수행하기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이미지를 생 성하여 이미지의 컬러 정보를 효과적으로 사용하는, 의료 이미지 처리 방법, 의료 이미지 처리 장치, 이미지 처 리 방법 및 이미지 처리 장치를 제공한다. 차분 이미지에 기초하여 추출된 병리 조직 영역이 더 정확하고, 이는 후속 이미지 분석을 용이하게 한다."}
{"patent_id": "10-2022-7009792", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 관점에서, 본 개시의 제1 양태는 다음을 포함하는, 서버에 의해 실행되는 의료 이미지 처리 방법을 제공 한다. 처리 대상 의료 이미지를 획득하는 단계 - 처리 대상 의료 이미지는 컬러 이미지이고, 처리 대상 의료 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 제1 이미지 데이터, 제2 이미지 데이 터 및 제3 이미지 데이터는 각각 상이한 속성의 컬러 정보를 나타냄 -; 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성하는 단계; 및 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하는 단계 - 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 대응함 -.본 개시의 제2 양태는 다음을 포함하는, 서버에 의해 실행되는 이미지 처리 방법을 제공한다. 제1 처리 대상 이미지 및 제2 처리 대상 이미지를 획득하는 단계 - 제1 처리 대상 이미지는 컬러 이미지고, 제1 처리 대상 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 제1 이미지 데이 터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타냄 -; 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성하는 단계; 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하는 단계 - 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 대응함 -; 이진화된 이미지의 전경 영역에 따라 제1 처리 대 상 이미지로부터 병리 조직 영역을 추출하는 단계; 및 병리 조직 영역 및 제2 처리 대상 이미지에 따라 합성된 이미지를 생성하는 단계 - 병리 조직 영역은 제1 이미 지 레이어 상에 있고, 제2 처리 대상 이미지는 제2 이미지 레이어 상에 있으며, 제1 이미지 레이어는 제2 이미 지 레이어를 커버함 -. 본 개시의 제3 양태는 다음을 포함하는, 의료 이미지 처리 장치를 제공한다. 처리 대상 의료 이미지를 획득하도록 구성된 획득 모듈 - 처리 대상 의료 이미지는 컬러 이미지이고, 처리 대상 의료 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타냄 -; 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성하도록 구성된 생성 모 듈; 및 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하도록 구성된 처리 모듈 - 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 대응함 -. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 구현에서, 생성 모듈은 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 최대값 이미지 및 최소값 이미지를 생성하고; 최대값 이미지와 최소값 이미지에 따라 차분 이미지를 생성하도록 구성된다. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 다른 구현에서, 생성 모듈은 제1 이미지 데이터의 제1 픽셀 위치에서의 제1 픽셀값, 제2 이미지 데이터의 제2 픽셀 위치에서의 제2 픽셀값 및 제3 이미지 데이터의 제3 픽셀 위치에서의 제3 픽셀값에 따라 최대 픽셀값 및 최소 픽셀값을 결 정하고; 최대 픽셀값에 따라 최대값 이미지를 획득하고, 최소 픽셀값에 따라 최소값 이미지를 획득하도록 구성되고 - 최 대값 이미지의 제4 픽셀 위치에서의 픽셀값은 최대 픽셀값이고, 최소값 이미지의 제5 픽셀 위치에서의 픽셀값은 최소 픽셀값이며, 제1 픽셀 위치, 제2 픽셀 위치, 제3 픽셀 위치, 제4 픽셀 위치 및 제5 픽셀 위치는 모두 처리 대상 의료 이미지의 동일한 픽셀 위치에 대응함 -; 생성 모듈은 또한, 최대값 이미지의 제4 픽셀 위치에서의 픽셀값과 최소값 이미지의 제5 픽셀 위치에서의 픽셀 값에 따라 픽셀 차이를 결정하고; 픽셀 차이에 따라 차분 이미지를 획득하도록 구성되고, 차분 이미지의 제6 픽셀 위치에서의 픽셀값은 픽셀 차이 이고, 제4 픽셀 위치, 제5 픽셀 위치 및 제6 픽셀 위치는 모두 처리 대상 의료 이미지의 동일한 픽셀 위치에 대 응한다. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 다른 구현에서, 생성 모듈은 또한, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 처리 대상 차분 이미지 를 생성하고; 차분 이미지를 획득하기 위해 처리 대상 차분 이미지에 대해 가우시안 블러(Gaussian blur) 처리를 수행되도록 구성된다. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 다른 구현에서, 의료 이미지 처리 장치는 결정 모듈을 더 포 함한다. 결정 모듈은 차분 이미지에 따라 이진화 문턱값을 결정하도록 구성되고; 결정 모듈은 또한, 이진화된 이미지를 획득하기 위해 이진화 문턱값에 따라 차분 이미지에 대해 이진화 처리를 수행하도록 구성된다. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 다른 구현에서, 결정 모듈은 또한, 차분 이미지에 따라 N개의 픽셀에 대응하는 N개의 픽셀값을 획득하고 - 픽셀값 및 픽셀은 일 대일 대응이고, N은 1보다 큰 정수임 -; N개의 픽셀값으로부터 기준 픽셀값을 결정하며 - 기준 픽셀값은 N개의 픽셀값 중 최대값임 -; 기준 픽셀값 및 미리 설정된 비율에 따라 이진화 문턱값을 결정하도록 구성된다. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 다른 구현에서, 생성 모듈은 또한, 플러드 알고리즘에 기초하여 이진화된 이미지에서 복수의 배경 픽셀을 포함하는 배경 영역을 검출하고; 이진화된 이미지 및 이진화된 이미지의 배경 영역에 따라 이진화된 이미지의 전경 영역에서 배경 픽셀을 획득하 고 - 전경 영역은 복수의 전경 픽셀을 포함함 -; 구멍이 채워진 이미지를 획득하기 위해 이진화된 이미지의 전경 영역의 배경 픽셀을 전경 픽셀로 변경하며; 결과 이미지를 획득하기 위해 구멍이 채워진 이미지에 대해 중간(median) 필터링 처리를 수행하도록 구성되고, 결과 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 대응한다. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 다른 구현에서, 처리 모듈은 또한, 필터링된 이미지를 획득하기 위해 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행하 고; 필터링된 이미지에서 전경 영역의 경계선을 획득하며 - 경계선은 M개의 픽셀을 포함하고, M은 1보다 큰 정수임 -; 결과 이미지를 획득하기 위해 경계선의 M개의 픽셀 각각을 K 픽셀만큼 바깥쪽으로 확장하도록 구성되고, K는 1 이상의 정수이다. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 다른 구현에서, 획득 모듈은 또한, 원본 의료 이미지를 획득하고; 슬라이딩 윈도우를 이용하여 원본 의료 이미지로부터 의료 서브 이미지를 추출하고; 의료 서브 이미지가 병리 조직 영역을 포함하는 것으로 검출된 경우, 의료 서브 이미지를 처리 대상 의료 이미 지로 결정하며; 의료 서브 이미지가 병리 조직 영역을 포함하지 않는 것으로 검출된 경우, 의료 서브 이미지를 배경 이미지로 결정하고 배경 이미지를 제거하도록 구성된다. 가능한 설계에서, 본 개시의 실시예의 제3 양태의 다른 구현에서, 이미지 처리 장치는 트레이닝 모듈을 더 포함 하고; 생성 모듈은 또한, 처리 대상 이미지와 처리 대상 이미지의 전경 영역에 따라 타깃 포지티브 샘플 이미지를 생 성하도록 구성되고 - 타깃 포지티브 샘플 이미지는 포지티브 샘플 세트의 포지티브 샘플 이미지이고, 각각의 포 지티브 샘플 이미지는 병리 조직 영역을 포함함 -; 획득 모듈은 또한, 네거티브 샘플 세트를 획득하도록 구성되며 - 네거티브 샘플 세트는 적어도 하나의 네거티브 샘플 이미지를 포함하고, 각각의 네거티브 샘플 이미지는 병리 조직 영역을 포함하지 않음 -; 트레이닝 모듈은 포지티브 샘플 세트와 네거티브 샘플 세트에 기초하여 이미지 처리 모델을 트레이닝하도록 구 성된다.본 개시의 제4 양태는 다음을 포함하는, 이미지 처리 장치를 제공한다. 제1 처리 대상 이미지 및 제2 처리 대상 이미지를 획득하도록 구성된 획득 모듈 - 제1 처리 대상 이미지는 컬러 이미지고, 제1 처리 대상 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타냄 -; 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성하도록 구성된 생성 모 듈; 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하도록 구성된 처리 모듈 - 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 타깃 객체에 대응함 -; 및 이진화된 이미지의 전경 영역에 따라 제1 처리 대상 이미지로부터 타깃 객체를 추출하도록 구성된 추출 모듈. 생성 모듈은 또한, 타깃 객체 및 제2 처리 대상 이미지에 따라 합성된 이미지를 생성하도록 구성되고, 타깃 객 체는 제1 이미지 레이어 상에 있고, 제2 처리 대상 이미지는 제2 이미지 레이어 상에 있으며, 제1 이미지 레이 어는 제2 이미지 레이어를 커버한다. 본 개시의 제5 양태는 컴퓨터에서 실행될 때 컴퓨터로 하여금 전술한 양태에 따른 방법을 실행하게 하는 명령어 를 저장하는 컴퓨터 판독 가능 매체를 제공한다."}
{"patent_id": "10-2022-7009792", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 기술적 해결방안으로부터 본 개시의 실시예는 다음과 같은 이점이 있음을 알 수 있다. 본 개시의 실시예는 의료 이미지 처리 방법을 제공한다. 처리 대상 의료 컬러 이미지가 먼저 획득될 수 있고, 여기서 처리 대상 의료 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하고, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 속성의 컬러 정보를 나타낸다. 그러면, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지가 생성된다. 또한, 차분 이미 지에 대해 이진화 처리를 수행하여 이진화된 이미지를 획득하고, 여기서 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 대응한다. 상이한 채널의 그레이 스케일 픽셀의 컬러 정보는 약간 다르고, 상이한 채널의 컬러 픽셀의 컬러 정보는 크게 다르다. 따라서, 전술한 방식에서는 이미지에 대해 이진 화 처리를 수행하기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이미지를 생성함으로써, 이미지의 컬러 정 보를 효과적으로 사용한다. 차분 이미지에 기초하여 추출된 병리 조직 영역이 더 정확하고, 이는 후속 이미지 분석을 용이하게 한다."}
{"patent_id": "10-2022-7009792", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 실시예는 이미지에 대해 이진화 처리를 수행하기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이 미지를 생성하여 이미지의 컬러 정보를 효과적으로 사용하는, 의료 이미지 처리 방법, 이미지 처리 방법 및 장 치를 제공한다. 차분 이미지에 기초하여 추출된 병리 조직 영역이 더 정확하고, 이는 후속 이미지 분석을 용이 하게 한다. 본 개시의 명세서, 청구범위 및 첨부된 도면에서 \"제1\", \"제2\", \"제3\", \"제4\" 등의 용어(존재하는 경우)는 특정 순서나 시퀀스를 설명하기보다는 유사한 대상을 구별하기 위한 것이다. 이런 식으로 사용되는 숫자는 적절한 경 우에 바꾸어 사용할 수 있으며, 여기에서 설명된 본 개시의 실시예들은 여기에서 예시되거나 설명된 시퀀스와 다른 시퀀스로 구현될 수 있다. 또한, \"포함하다\", \"~에 해당하는\" 및 기타 변형이라는 용어는 비배타적 포함을 커버하도록 의도된다. 예를 들어, 일련의 단계 또는 단위를 포함하는 프로세스, 방법, 시스템, 제품 또는 장치 는 반드시 명시적으로 나열된 단계 또는 유닛으로 제한되지 않지만, 명시적으로 나열되지 않았거나 그러한 프로 세스, 방법, 제품 또는 장치에 고유하지 않은 다른 단계 또는 유닛을 포함할 수 있다. 본 개시의 실시예는 이미지 처리의 시나리오에 적용될 수 있다. 이미지는 인간이 세상을 지각하는 시각적 기반 으로서 인간이 정보를 획득하고, 정보를 표현하고, 정보를 전달하는 중요한 수단이다. 이미지 처리는 이미지를 분석하여 필요한 결과를 획득하기 위해 사용될 수 있는 기술이다. 이미지 처리는 일반적으로 디지털 이미지의 처리를 말하며, 디지털 이미지는 산업용 카메라, 비디오 카메라 또는 스캐너 장치에 의해 획득되는 큰 2차원 어 레이이다. 어레이의 요소를 픽셀이라 하고, 픽셀의 값을 그레이 스케일 값(gray-scale value)이라 한다. 이미지 처리 기술은 사람들이 세상을 보다 객관적이고 정확하게 이해하는 데 도움이 될 수 있다. 인간의 시각 시스템은 인간이 외부 세계로부터 많은 양의 정보를 획득하는 데 도움이 될 수 있다. 이미지와 그래프는 모든 시각적 정 보의 전달자이다. 인간의 눈은 수천 가지 컬러를 구별하는 능력이 뛰어나지만, 이미지가 흐릿하거나 인간의 눈 에는 보이지 않는 경우가 많다. 따라서 이미지 처리 기술은 흐릿하거나 보이지 않는 이미지까지 선명하게 만들 수 있다. 예를 들어, 이미지 처리 기술은 이미지 변환, 이미지 인코딩 압축, 이미지 향상 및 복원, 이미지 분할, 이미지 설명, 이미지 매트화 및 이미지 분류를 포함할 수 있지만, 이에 제한되지 않는다. 예를 들어, 본 개시에서 제공하는 이미지 처리 방법은 의료 분야의 시나리오에 적용될 수 있다. 처리될 수 있는 의료 이미지는 뇌 이미지, 심장 이미지, 흉부 이미지 및 세포 이미지를 포함하지만, 이에 제한되지 않는다. 의 료 이미지는 노이즈, 필드 오프셋 효과, 부분 볼륨 효과 및 조직 움직임에 의해 영향을 받을 수 있다. 개별 생 물은 서로 다르고 복잡한 조직 구조적 형태를 가지고 있기 때문에, 의료 이미지는 일반적으로 일반 이미지보다 더 흐릿하고 고르지 않다. 본 개시에서 의료 이미지는 컬러 이미지고, 이는 컬러 초음파 이미지 또는 전체 슬라 이드 이미지(whole slide image, WSI)일 수 있으며, 현미경으로부터 획득한 컬러 디지털 이미지를 포함할 수도 있다. WSI 이미지가 예시로 사용되며, WSI 이미지의 한 측면은 보통 10000 내지 100000 픽셀을 포함한다. WSI 이미지는 일반적으로 추가 처리를 위해 축소되거나 작은 이미지로 잘라져야 한다. 이미지를 처리하는 과정에서 병리 조직 슬라이드가 있는 영역이 획득되어야 하고, 그 다음 예를 들어 핵 정량 분석, 세포막 정량 분석, 세포 질 정량 분석 및 조직 미세혈관 분석과 같은 병리학적 분석이 영역에 따라 수행된다. 따라서, 의료 이미지의 특 징에 기초하는, 본 개시의 의료 이미지 처리 방법에서, 처리 대상 의료 이미지가 획득될 수 있다. 차분 이미지 는 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 기초하여 생성될 수 있고, 여기서 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 속성의 컬 러 정보를 나타낸다. 또한, 이진화된 이미지를 획득하기 위해, 이진화 처리가 차분 이미지에 대해 수행되고, 여 기서 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 해당한다. 상이한 채널의 그레 이 스케일 픽셀의 컬러 정보는 약간 다르지만 상이한 채널의 컬러 픽셀의 컬러 정보는 크게 다르다. 따라서, 이 미지에 대해 이진화 처리를 수행하기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이미지를 생성함으로써, 이미지의 컬러 정보를 효과적으로 사용할 수 있다. 차분 이미지에 기초하여 추출된 병리 조직 영역이 더 정확하 여, 후속 이미지 분석이 용이하다. 다른 예에서, 이미지 처리는 원격 감지 분야의 시나리오에 더 적용될 수 있다. 정보 기술 및 우주 기술의 급속 한 발전과 위성 공간 해상도의 지속적인 개선으로 인해 고해상도 원격 감지 이미지는 해양 모니터링, 육지 범위 모니터링, 해양 오염 및 해양 구조에 적용될 수 있다. 고해상도 원격 감지 이미지는 풍부한 이미지 디테일 정보, 표면 특징의 명백한 기하학적 구조 및 복잡한 타깃 구조가 특징이다. 예를 들어, 고해상도 원격 감지 이 미지에서는 해안선에 있는 객체의 그림자가 복잡하거나 식생 커버리지 지역이 크거나 인공 시설이 충분히 선명하지 않다. 고해상도 원격 감지 이미지는 일반적으로 일반 이미지보다 디테일이 많고 복잡하기 때문에, 고해상 도 원격 감지 이미지에서 식생 커버리지 지역을 결정해야 하는 경우, 고해상도 원격 감지 이미지에서 식생을 제 거하여 해당 지역을 결정할 수 있다. 따라서, 고해상도 원격 감지 이미지의 특징에 기초하는, 본 개시의 이미지 처리 방법에서, 차분 이미지가 제1 처리 대상 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 기초하여 생성될 수 있고, 여기서 제1 처리 대상 이미지는 컬러 이미지이고, 제1 처리 대상 이 미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타낸다. 또한, 이진화된 이미지를 획득하기 위해, 이진화 처리가 생성된 차분 이미지에 대해 수행되고, 여기 서 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 해당한다. 그러면, 타깃 객체(예 를 들어, 식생 영역)가 결과 이미지에 따라 제1 처리 대상 이미지로부터 추출된다. 이진화 처리가 이미지에 대 해 수행되기 전에 차분 이미지가 상이한 채널의 컬러 정보에 기초하여 생성된다. 상이한 채널의 그레이 스케일 픽셀의 컬러 정보는 약간 다르지만 상이한 채널의 컬러 픽셀의 컬러 정보는 크게 다르기 때문에, 이미지의 컬러 정보가 효과적으로 사용된다. 차분 이미지에 기초하여 추출된 타깃 객체가 보다 정확하고, 고해상도 원격 감지 이미지의 디테일이 보다 정확하게 획득될 수 있어, 고해상도 원격 감지 이미지의 처리 정확도를 향상시킬 수 있 다. 예를 들어, 본 개시의 실시예는 의료 분야의 시나리오에 적용되어, 추출된 병리 조직 영역의 정확도를 향상시키 고 의료 분야의 시나리오에서 후속 이미지 분석을 용이하게 한다. 본 개시는 의료 이미지 처리 방법을 제안한다. 본 방법은 도 1에 도시된 의료 이미지 처리 시스템에 적용된다. 도 1은 본 출원의 실시예에 따른 의 료 이미지 처리 시스템의 개략적인 구조도이다. 도 1에 도시된 바와 같이, 이미지 처리 시스템은 서버와 단말 장치를 포함한다. 의료 이미지 처리 장치는 서버에 배치될 수 있고, 컴퓨팅 능력이 높은 단말 장치에 배치될 수 도 있다. 예를 들어, 의료 이미지 처리 장치는 서버에 배치된다. 서버는 처리 대상 의료 이미지를 획득한 후, 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성 하고, 차분 이미지에 대해 이진화 처리를 더 수행하여, 이진화된 이미지를 획득하고, 여기서 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 대응한다. 서버는 병리 조직 영역에 기초하여 의료 이 미지를 분석할 수 있다. 예를 들어, 의료 이미지 처리 장치는 단말 장치에 배치된다. 단말 장치는 처리 대상 의료 이미지를 획득한 후, 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이 미지를 생성하고, 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 더 수행하며, 여기서 이 진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 해당한다. 단말 장치는 병리 조직 영 역에 기초하여 의료 이미지를 분석할 수 있다. 도 1의 서버는 하나의 서버 또는 복수의 서버를 포함하는 서버 클러스터 또는 클라우드 컴퓨팅 센터일 수 있으 며, 여기에 특별히 제한되지 않는다. 단말 장치는 도 1에 도시된 태블릿 컴퓨터, 노트북 컴퓨터, 팜탑 컴퓨터, 모바일 폰, 퍼스널 컴퓨터(personal computer, PC) 또는 음성 상호작용 장치일 수 있고, 모니터링 장치, 얼굴 인식 장치 등일 수도 있으며, 여기에 제한되지 않는다. 비록 도 1은 5개의 단말 장치와 1개의 서버만을 도시하지만, 도 1의 예는 이 해결방안을 이해하는데만 사용되고, 단말 장치 및 서버의 구체적인 수량은 실제 상황에 따라 유연하게 결정되는 것이 이해되어야 한다. 본 개시의 실시예는 AI 분야에 적용가능하다. 따라서, 본 개시의 실시예에서 제공하는 모델 트레이닝 방법을 설 명하기 전에 먼저 AI 분야의 몇 가지 기본 개념을 소개한다. AI는 환경을 인식하고, 지식을 획득하며, 지식을 사용하여 최적의 결과를 획득하기 위해, 디지털 컴퓨터 또는 디지털 컴퓨터가 제어하는 머신을 사용하여 인간 지능을 시뮬레이션, 연장 및 확대하는 이론, 방법, 기술 또는 응용 시스템이다. 즉, AI는 지능의 본질을 이해하 고자 하고 인간의 지능과 유사한 방식으로 대응할 수 있는 새로운 지능 머신을 생산하는 컴퓨터 과학의 종합 기 술이다. AI는 다양한 지능형 머신의 설계 원리와 구현 방법을 연구하여 머신이 인식, 추론 및 의사 결정 기능을 가질 수 있도록 한다. AI 기술은 하드웨어 수준의 기술과 소프트웨어 수준의 기술을 모두 포함하는 광범위한 분 야를 커버하는 포괄적인 학문이다. 기본 AI 기술은 일반적으로 센서, 전용 AI 칩, 클라우드 컴퓨팅, 분산 스토 리지, 빅 데이터 처리 기술, 운영/상호작용 시스템, 메카트로닉스와 같은 기술을 포함한다. AI 소프트웨어 기술 은 주로 컴퓨터 비전 기술, 음성 처리 기술, 자연어 처리(natural language processing, NLP) 기술, 머신 러닝 (machine learning, ML)/딥 러닝 등을 포함한다. ML은 확률 이론, 통계, 근사 이론, 볼록공간 분석, 알고리즘 복잡도 이론 등과 같은 복수의 학문을 포함하는 학제간 주제이다. ML은 컴퓨터가 인간의 학습 행동을 시뮬레이션하거나 구현하여 새로운 지식이나 기술을 획득하고 기존 지식 구조를 재구성하여 성능을 계속 향상시키는 방 법을 연구하는 것을 전문으로 한다. 머신 러닝은 인공 지능의 핵심이고, 컴퓨터를 지능적으로 만드는 근본적인 방법이며, 머신 러닝 응용은 인공 지능의 모든 분야를 커버한다. ML과 딥 러닝은 일반적으로 인공 신경 네트워 크, 신념 네트워크, 강화 학습, 전달 학습, 귀납적 학습, 시연을 통한 학습과 같은 기술을 포함한다. AI 기술의 연구와 발전으로 AI 기술은 여러 방면에서 연구되고 있다. 컴퓨터 비전(computer vision, CV)은 AI 기술의 여러 연구 방향에서 머신을 사용하여 \"보는\" 방법을 연구하는 과학이고, 또한 인간의 눈을 대신하여 타 깃에 대해 인식, 추적, 측정 등을 수행하고, 그래픽 처리를 더 수행하여 컴퓨터가 타깃을 인간의 눈으로 관찰하 기에 더 적합한 이미지 또는 탐지를 위해 기기로 전송되는 이미지로 처리하기 위해 카메라와 컴퓨터를 사용하는 머신 비전이다. 과학 주제로서, CV는 관련 이론과 기술을 연구하고 이미지나 다차원 데이터로부터 정보를 획득 할 수 있는 AI 시스템을 구축하는 것을 시도한다. CV 기술에는 일반적으로 이미지 처리, 이미지 인식, 이미지 시맨틱 이해(image semantic understanding, ICU), 이미지 검색, 광학 문자 인식(optical character recognition, OCR), 비디오 처리, 비디오 시맨틱 이해, 비디오 콘텐츠/행동 인식, 3D 객체 재구성, 3D 기술, 가 상 현실, 증강 현실, 동기식 측위, 지도 구축과 같은 기술을 포함하고, 공통 얼굴 인식, 지문 인식과 같은 생물 학적 특징 인식 기술을 더 포함한다. 본 개시의 실시예에서 제공하는 해결방안은 AI의 이미지 처리 기술에 관한 것으로, 전술한 내용을 참조하여 본 개시에 따른 의료 이미지 처리 방법을 설명하면 다음과 같다. 도 2를 참조하면, 본 개시의 일 실시예에 따른 의 료 이미지 처리 방법의 개략도는 다음의 단계들을 포함한다. 101: 처리 대상 의료 이미지를 획득하는 단계. 처리 대상 의료 이미지는 컬러 이미지이고, 처리 대상 의료 이미 지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타낸다. 본 실시예에서, 의료 이미지 처리 장치는 컬러 이미지인 처리 대상 의료 이미지를 획득할 수 있고, 여기서 처리 대상 의료 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 이미지를 포함할 수 있고, 제1 이미 지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타낸다. 처리 대상 의료 이미지는 유선 네트워크를 통해 의료 이미지 처리 장치에 의해 수신된 의료 이미지거나, 의료 이미지 처리 장치에 의해 저장된 의료 이미지일 수 있다. 예를 들어, 처리 대상 의료 이미지는 WSI 이미지로부터 클리핑된 영역일 수 있다. WSI 이미지는 현미경을 통해 완성된 슬라이드를 스캔함으로써 획득될 수 있다. 완성된 슬라이드는 헤마톡실린(hematoxylin) 염색이나 다른 염색법을 수행함으로써 생산된 유리 슬라이드이기 때문에 현미경을 통해 완성된 슬라이드를 스캔한 후 획득된 WSI 이미지는 컬러 이미지다. 컬러 이미지의 이미지 컬러 모드는 적색 녹색 청색(red green blue, RGB) 컬러 모 드, 휘도 대역폭 색차(luminance bandwidth chrominance, YUV) 컬러 모드 및 색조-채도-값 (hue-saturation- value, HSV) 컬러 모드를 포함하지만, 이에 제한되지 않는다. 컬러 정보는 R 채널의 픽셀값, G 채널의 픽셀값 및 B 채널의 픽셀값과 같이 상이한 채널의 픽셀값으로 표현될 수 있다. WSI 이미지의 포맷은 SVS 및 NDPI를 포함하지만, 이에 제한되지 않는 반면, WSI 이미지의 길이 및 너비는 일반 적으로 이미지가 크도록 수만 픽셀의 범위에 있다. WSI 이미지를 직접 처리하려면 대용량 메모리가 필요하다. 따라서 WSI 이미지를 잘라야 한다. WSI 이미지는 일반적으로 파이썬의 오픈슬라이드(openslide) 도구를 통해 판 독될 수 있고, 오픈슬라이드 도구는 파일 형식 변환을 구현하고 WSI 이미지로부터 클리핑된 영역을 12*12 해상 도의 이미지로 추가 저장할 수 있다. 실제의 경우 해상도는 15*15 및 50*50을 포함하지만 이에 제한되지 않는다. 복수의 이미지가 동일한 WSI 이미지 파일에 저장된다. 실제 응용에서 최대 해상도의 이미지는 WSI 이미 지 파일로부터 처리 대상 이미지로 판독된다. 게다가, 본 실시예에서, 처리 대상 의료 이미지는 축소된 WSI 이 미지로부터 클리핑될 수 있고, WSI 이미지는 임의의 배수, 예를 들어, 20배 또는 10배만큼 축소될 수 있다. 축 소된 WSI 이미지의 길이와 너비는 수천 픽셀의 범위에 있다. 축소를 위한 배수는 실제 요구 사항에 따라 유연하 게 결정될 수 있다. 이해의 편의를 위해, 본 발명의 일 실시예에 따른 처리 대상 의료 이미지의 개략도인 도 3을 참조한다. 도 3에 도시된 바와 같이, 처리 대상 의료 이미지는 다른 그레이 스케일 배경 또는 순백색 배경이 없는 병리 조직 영역 을 포함한다. 본 실시예를 더 이해하기 위해, 예를 들어, 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이다. 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타내므로, 컬러 이미지에 대응하는 RGB가 (200, 100, 60)이면, 제1 이미지 데이터 는 R 채널에 대응하는 픽셀값 200을 가질 수 있고, 제2 이미지 데이터는 G 채널에 대응하는 픽셀값 100을 가질수 있으며, 제3 이미지 데이터는 B 채널에 대응하는 픽셀값 60을 가질 수 있다. 컬러 이미지에 대응하는 RGB가 (100, 80, 40)이면, 제1 이미지 데이터는 R 채널에 대응하는 픽셀값 100을 가질 수 있고, 제2 이미지 데이터는 G 채널에 대응하는 픽셀값 800을 가질 수 있으며, 제3 이미지 데이터는 B 채널에 대응하는 픽셀값 40을 가질 수 있다. HSV 이미지 또는 YUV 이미지는 후속 처리를 위해 먼저 RGB 이미지로 변환될 수 있다. 실제 응용에서, 구체적으로 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 대응하는 컬러 정보 는 실제 상황에 따라 유연하게 결정되어야 한다. 또한, 의료 이미지 처리 장치는 서버에 배치될 수 있고, 컴퓨 팅 능력이 높은 단말 장치에 배치될 수도 있다. 본 실시예에서, 예컨대 의료 이미지 처리 장치는 서버에 배치된 다. 102: 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차 분 이미지를 생성하는 단계. 본 실시예에서, 의료 이미지 처리 장치는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성할 수 있다. 예를 들어 차분 이미지는 그레이 스케일 이미지로 표현된다. 이해의 편의를 위 해 본 개시의 일 실시예에 따른 차분 이미지의 개략도인 도 4를 참조한다. 도 4에 도시된 바와 같이, 도 4의 (B)에 도시된 차분 이미지는 도 4의 (A)의 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데 이터 및 제3 이미지 데이터에 따라 생성될 수 있다. 차분 이미지는 도 4에 도시된 병리 조직 영역을 포함하는 이미지일 수 있다. 상이한 채널에 대응하는 컬러 정보를 사용하기 때문에 픽셀값이 서로 다르다. 예를 들어, 처 리 대상 의료 이미지의 이미지 컬러 모드는 RGB이다. 처리 대상 의료 이미지가 그레이면 R, G, B 값이 비슷하다. 처리 대상 의료 이미지가 컬러 이미지이면 R, G, B 값이 크게 달라 병리 조직의 영역은 큰 색수차를 갖는다. 103: 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하는 단계. 본 실시예에서, 의료 이미지 처리 장치는 단계 102에서 생성된 차분 이미지에 대해 이진화 처리를 수행하여 이 진화된 이미지를 획득할 수 있다. 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 대응한다. 이해의 편의를 위해 본 개시의 일 실시예에 따른 이진화된 이미지의 개략도인 도 5를 참조한다. 도 5 에 도시된 바와 같이, 도 5의 (A)에 도시된 차분 이미지에 따르면, 차분 이미지는 그레이 스케일 이미지이므로 그레이 스케일 이미지 처리 방법이 수행될 수 있다. 예를 들어, 본 실시예에서 전경은 적응적 이진화에 의해 획 득된다. 즉, 이진화 처리가 차분 이미지에 대해 수행됨으로써, 도 5의 (B)에 도시된 이진화된 이미지를 획득한 다. 또한, 이진화된 이미지에서 흰색은 병리 조직 영역을 포함하는 전경 영역이고 검은색은 병리 조직 영역을 포함하지 않는 배경 영역이다. 이해의 편의를 위해, 본 발명의 일 실시예에 따른 전경 영역의 개략도인 도 6을 참조한다. 도 6에 도시된 바와 같이, 도 6의 (A)에 도시된 이진화된 이미지에 따르면, 흰색 영역은 병리 조직 영역을 포함하는 전경 영역이고 검은색 영역은 병리 조직 영역을 포함하지 않는 배경 영역이므로, 도 6의 (B)의 처리 대상 의료 이미지에 대응 하는 영역은 이진화된 이미지에 따라 생성될 수 있다. 본 개시의 이 실시예에서, 의료 이미지 처리 방법이 제공된다. 상이한 채널의 그레이 스케일 픽셀의 컬러 정보 는 약간 다르고, 상이한 채널의 컬러 픽셀의 컬러 정보는 크게 다르다. 따라서, 전술한 방식에서는 이미지에 대 해 이진화 처리를 수행하기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이미지를 생성함으로써, 이미지의 컬러 정보를 효과적으로 사용한다. 차분 이미지에 기초하여 추출된 병리 조직 영역이 더 정확하고, 이는 후속 이미지 분석이 용이하게 한다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 선택적인 실 시예에서, 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따 라 차분 이미지를 생성하는 단계는 다음을 포함할 수 있다. 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터, 및 제3 이미지 데이터에 따라 최대값 이미지 및 최소값 이미지를 생성하는 단계; 및 최대값 이미지와 최소값 이미지에 따라 차분 이미지를 생성하는 단계. 본 실시예에서, 처리 대상 의료 이미지를 획득한 후, 의료 이미지 처리 장치는 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 최대값 이미지 및 최소값 이미지를 생성하고, 마지막으로 최대값 이미지와 최소값 이미지에 따라 차분 이미지를 생성할 수 있다. 구체적으로, 예를 들어, 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이다. 처리 대상 의료 이미지에 포함 된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타내므로, 컬러 정보는 R 채널, G 채널 및 B 채널에 대응하는 픽셀값으로 표현된다. R 채널, G 채널 및 B 채 널의 최대값이 결정되고, 최대값 이미지가 최대값에 기초하여 결정된다. 유사하게, R 채널, G 채널 및 B 채널의 최소값이 결정될 수 있고, 최소값 이미지가 최소값에 기초하여 결정될 수 있다. 그 다음, 최대값 이미지의 대응 하는 위치에 있는 픽셀에서 최소값 이미지의 각 픽셀을 빼서 차분 이미지를 획득한다. 본 개시의 이 실시예는 차분 이미지를 생성하기 위한 방법을 제공한다. 전술한 방식에서는 최대값 이미지 및 최 소값 이미지가 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 생성된다. 상이한 이미지 데이터는 상이한 컬러 정보에 대응하고, 최대값 이미지와 최소값 이미지가 상이한 이미지 데이터에 따라 결정되 기 때문에, 포함된 처리 대상 의료 이미지의 컬러 정보는 매우 정확하므로 차분 이미지는 더 정확하게 생성된다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 다른 선택적 인 실시예에서, 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터 에 따라 최대값 이미지 및 최소값 이미지를 생성하는 단계는 다음을 포함할 수 있다. 제1 이미지 데이터의 제1 픽셀 위치에서의 제1 픽셀값, 제2 이미지 데이터의 제2 픽셀 위치에서의 제2 픽셀값, 및 제3 이미지 데이터의 제3 픽셀 위치에서의 제3 픽셀값에 따라 최대 픽셀값 및 최소 픽셀값을 결정하는 단계; 및 최대 픽셀값에 따라 최대값 이미지를 획득하고 최소 픽셀값에 따라 최소값 이미지를 획득하는 단계. 본 방법에서, 최대값 이미지의 제4 픽셀 위치에서의 픽셀값은 최대 픽셀값이고, 최소값 이미지의 제5 픽셀 위치 에서의 픽셀값은 최소 픽셀값이며, 제1 픽셀 위치, 제2 픽셀 위치, 제3 픽셀 위치, 제4 픽셀 위치 및 제5 픽셀 위치는 모두 처리 대상 의료 이미지의 동일한 픽셀 위치에 대응한다. 최대값 이미지와 최소값 이미지에 따라 차분 이미지를 생성하는 단계는 다음을 포함할 수 있다. 최대값 이미지의 제4 픽셀 위치에서의 픽셀값과 최소값 이미지의 제5 픽셀 위치에서의 픽셀값에 따라 픽셀 차이 를 결정하는 단계; 및 픽셀 차이에 따라 차분 이미지를 획득하는 단계 - 차분 이미지의 제6 픽셀 위치에서의 픽셀값은 픽셀 차이이고, 제4 픽셀 위치, 제5 픽셀 위치 및 제6 픽셀 위치는 모두 처리 대상 의료 이미지의 동일한 픽셀 위치에 대응함 -. 최대값 이미지에서 타깃 픽셀에 대응하는 최대 픽셀값에서 최소값 이미지에서 타깃 픽셀에 대응하는 최소 픽셀 값을 빼서 픽셀 차이를 획득하고, 픽셀 차이는 차분 이미지에서 타깃 픽셀에 대응하는 차분 픽셀값으로 사용된 다. 본 실시예에서, 의료 이미지 처리 장치는 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이 터 및 제3 이미지 데이터에 따라, 타깃 픽셀에 대응하는 최대 픽셀값 및 최소 픽셀값을 생성하고, 그리고 나서 결정된 최대 픽셀값 및 최소 픽셀값에 따라 최대값 이미지 및 최소값 이미지를 생성할 수 있다. 마지막으로, 최 대값 이미지에서 타깃 픽셀에 대응하는 최대 픽셀값에서 최소값 이미지에서 타깃 픽셀에 대응하는 최소 픽셀값 을 빼서 차분 이미지에서 타깃 픽셀에 대응하는 차분 픽셀값을 획득한다. 이해의 편의를 위해, 예를 들어, 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이다. 제1 이미지 데이터, 제 2 이미지 데이터 및 제3 이미지 데이터를 포함하는 처리 대상 의료 이미지에 대해, 처리 대상 의료 이미지의 각 픽셀은 R 채널, G 채널 및 B 채널 모두에서 대응하는 이미지 데이터를 갖는다. 예를 들어, R 채널에 있는 픽셀 의 이미지 데이터는 제1 픽셀값이고, G 채널에 있는 픽셀의 이미지 데이터는 제2 픽셀값이며, B 채널에 있는 픽 셀의 이미지 데이터는 제3 픽셀값이다. R 채널, G 채널 및 B 채널에서 최대 픽셀값 및 최소 픽셀값은 제1 픽셀 값, 제2 픽셀값 및 제3 픽셀값에 따라 결정될 수 있다. 또한, 픽셀 위치(x, y)에서의 최대 픽셀값 및 최소 픽셀값은 다음의 공식에 기초하여 계산될 수 있다. Imax (x, y) = Max[Ir (x, y), Ig (x, y), Ib (x, y)]; 및 Imin (x, y) = Min[Ir (x, y), Ig (x, y), Ib (x, y)]; 여기서 Imax(x, y)는 최대 픽셀값을 나타내고, Imin(x, y)은 최소 픽셀값을 나타내고, Ir(x, y)은 제1 픽셀값을 나타내고, Ig(x, y)는 제2 픽셀값을 나타내며, Ib(x, y)는 제3 픽셀값을 나타낸다. 본 실시예에서, 상이한 채널에 대응하는 컬러 정보는 픽셀의 값을 구별하기 위해 사용된다. 여전히 예를 들어, 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이다. 처리 대상 의료 이미지가 그레이면 R, G, B 값은 서로 비슷하다. 처리 대상 의료 이미지가 컬러이면 R, G, B 값이 서로 크게 다르고 병리 조직이 있는 부위가 컬러가 된다. 컬러 픽셀의 값은 본 실시예에서 획득되는 픽셀의 값이다. 전술한 수식에서 2차원 이미지에 대응하는 픽 셀만이 예로 사용된다. 실제 응용에서 공식은 3차원(3D) 이미지와 4차원(4D) 이미지와 같은 다차원 이미지의 최 대 픽셀값과 최소 픽셀값의 계산에도 적용될 수 있다. 본 실시예를 더 이해하기 위해, 예를 들어, 타깃 픽셀 위치는 (x1, y1)이고 처리 대상 의료 이미지의 이미지 컬 러 모드는 RGB이다. 타깃 픽셀 위치 (x1, y1)의 제1 픽셀값 Ir (x1, y1)은 100이고, 타깃 픽셀 위치 (x1, y1) 의 제2 픽셀값 Ig (x1, y1)은 200이며, 타깃 픽셀 위치 (x1, y1)의 제3 픽셀값 Ib (x1, y1)은 150이다. 전술한 공식에서 알 수 있듯이, 타깃 픽셀 위치 (x1, y1)의 최대 픽셀값 Imax (x1, y1)은 제2 픽셀값 Ig (x1, y1)에 해당하는 픽셀값 200이고, 타깃 픽셀 위치 (x1, y1)의 최소 픽셀값 Imin (x1, y1)은 제1 픽셀값 Ir (x1, y1)에 해당하는 픽셀값 100이다. 다음으로, 다른 예로, 타깃 픽셀 위치는 (x2, y2)이고 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이다. 타깃 픽셀 위치 (x2, y2)의 제1 픽셀값 Ir (x2, y2)는 30이고, 타깃 픽셀 위치 (x2, y2)의 제2 픽셀값 Ig (x2, y2)는 80이며, 타깃 픽셀 위치 (x2, y2)의 제3 픽셀값 Ib (x2, y2)는 120이다. 전술한 공식에서 알 수 있듯이, 타깃 픽셀 위치 (x2, y2)의 최대 픽셀값 Imax (x2, y2)는 제3 픽셀값 Ib (x2, y2)에 해당하는 픽셀값 120이고, 타깃 픽셀 위치 (x2, y2)의 최소 픽셀값 Imin (x2, y2)는 제1 픽셀값 Ir (x2, y2)에 해당하는 픽셀값 30이다. 여전히 또 다른 예로, 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이고, 처리 대상 의료 이미지는 3D 이미 지이며, 타깃 픽셀 위치는 (x3, y3, z3)이다. 타깃 픽셀 위치 (x3, y3, z3)의 제1 픽셀값 Ir (x3, y3, z3)은 200이고, 타깃 픽셀 위치 (x3, y3, z3)의 제2 픽셀값 Ig (x3, y3, z3)은 10이며, 타깃 픽셀 위치 (x3, y3, z 3)의 제3 픽셀값 Ib (x3, y3, z3)은 60이다. 전술한 공식에서 알 수 있듯이, 타깃 픽셀 위치 (x3, y3, z3)의 최대 픽셀값 Imax (x3, y3, z3)은 제1 픽셀값 Ir (x3, y3, z3)에 해당하는 픽셀값 200이고, 타깃 픽셀 위치 (x3, y3, z3)의 최소 픽셀값 Imin (x3, y3, z3)은 제2 픽셀값 Ig (x3, y3, z3)에 해당하는 픽셀값 10이다. 또한, 타깃 픽셀 위치에 대응하는 최대 픽셀값 및 최소 픽셀값이 결정된 후, 최대 픽셀값에서 최소 픽셀값을 빼 서 차분 이미지에서 타깃 픽셀 위치에 대응하는 차분 픽셀값을 획득할 수 있다. 예를 들어, 차분 픽셀값은 최대 픽셀값 Imax (x, y) 및 최소 픽셀값 Imin (x, y)에 따라 다음의 공식에 기초하여 계산될 수 있고, 여기서 처리 대상 의료 이미지는 10,000 픽셀을 포함한다고 가정한다. Idiff (x, y) = Imax (x, y)-Imin (x, y); 여기서 Imax (x, y)는 최대 픽셀값을 나타내고, Imin (x, y)은 최소 픽셀값을 나타내며, Idiff (x, y)는 위치 (x, y)에서의 차분 픽셀값을 나타낸다. 이해의 편의를 위해, 예를 들어, 타깃 픽셀 위치는 (x1, y1)이고 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이다. 타깃 픽셀 위치 (x1, y1)의 최대 픽셀값 Imax (x1, y1)은 200이고, 타깃 픽셀 위치 (x1, y1)의 최소 픽셀값 Imin (x1, y1)은 100이다. 최대 픽셀값 Imax (x1, y1)에서 최소 픽셀값 Imin (x1, y1)을 빼서 타깃 픽 셀 위치 (x1, y1)에 대응하는 차분 픽셀값 100을 획득할 수 있다. 다음으로, 다른 예로, 타깃 픽셀 위치는 (x2, y2)이고 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이다. 타깃 픽셀 위치 (x2, y2)의 최대 픽셀값 Imax (x2, y2)는 120이고, 타깃 픽셀 위치 (x2, y2)의 최소 픽셀값 Imin (x2, y2)는 30이다. 최대 픽셀값 Imax (x2, y2)에서 최소 픽셀값 Imin (x2, y2)를 빼서 타깃 픽셀 위치 (x2, y2)에 대응하는 차분 픽셀값 90을 획득할 수 있다. 선택적으로, 다른 예로, 처리 대상 의료 이미지의 이미지 컬러 모드는 RGB이고, 처리 대상 의료 이미지는 3D 이 미지이며, 대상 픽셀 위치는 (x3, y3, z3)이다. 전술한 공식에 기초하여 다음 공식이 도출될 수 있다. Imax (x, y, z) = Max[Ir (x, y, z), Ig (x, y, z), Ib (x, y, z)]; Imin (x, y, z) = Min[Ir (x, y, z), Ig (x, y, z), Ib (x, y, z)]; 및 Idiff (x, y, z) = Imax (x, y, z)- Imin (x, y, z). 타깃 픽셀 위치 (x3, y3, z3)의 최대 픽셀값 Imax (x3, y3, z3)이 200이고, 타깃 픽셀 위치 (x3, y3, z3)의 최 소 픽셀값 Imin (x3, y3, z3)이 10이라고 가정한다. 최대 픽셀값 Imax (x3, y3, z3)에서 최소 픽셀값 Imin (x3, y3, z3)을 빼서 타깃 픽셀 위치 (x3, y3, z3)에 대응하는 차분 픽셀값 190을 획득할 수 있다. 예를 들어, 처리 대상 의료 이미지의 차분 픽셀값이 작을 때, 이는 처리 대상 의료 이미지의 제1 픽셀값, 제2 픽셀값 및 제3 픽셀값이 비슷함을 나타낸다. 처리 대상 의료 이미지가 그레이 이미지와 유사함을 나타낼 수 있 다. 처리 대상 의료 이미지의 차분 픽셀값이 클 때, 이는 처리 대상 의료 이미지의 제1 픽셀값, 제2 픽셀값 및 제3 픽셀값이 크게 다름을 나타낸다. 처리 대상 의료 이미지가 컬러 이미지와 유사함을 나타낼 수 있다. 병리 조직 영역의 이미지는 흔히 컬러 이미지이다. 따라서, 차이 픽셀값에 따라 처리 대상 의료 이미지가 병리 조직 영역을 포함하는지 여부를 미리 판단할 수 있다. 본 발명의 이 실시예는 최대값 이미지 및 최소값 이미지를 생성하기 위한 방법을 제공한다. 전술한 방식에서는 최대 픽셀값 및 최소 픽셀값이 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 대응하는 타깃 픽셀의 픽셀값에 기초하여 결정된다. 최대 픽셀값과 최소 픽셀값은 처리 대상 의료 이미지의 컬러 정보를 어느 정도 반영한다. 최대 픽셀값에서 최소 픽셀값을 빼서 차분 픽셀값을 획득한다. 따라서, 차분 픽셀값은 처리 대 상 의료 이미지의 컬러 정보를 정확하게 반영할 수 있으므로, 차분 이미지가 보다 정확하게 생성된다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 다른 선택적 인 실시예에서, 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터 에 따라 차분 이미지를 생성하는 단계는 다음을 포함할 수 있다. 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 처리 대 상 차분 이미지를 생성하는 단계; 및 차분 이미지를 획득하기 위해 처리 대상 차분 이미지에 대해 가우시안 블러 처리를 수행하는 단계. 본 실시예에서, 의료 이미지 처리 장치는 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이 터 및 제3 이미지 데이터에 따라 처리 대상 차분 이미지를 생성하고, 그런 다음 처리 대상 차분 이미지에 대해 가우시안 블러 처리를 수행하여 차분 이미지를 획득할 수 있다. 예를 들어, 블러 처리는 다음과 같이 이해될 수 있다. 처리 대상 차분 이미지의 각 픽셀에 대해, 픽셀을 둘러싼 픽셀의 평균이 픽셀의 픽셀값으로서 획득된다. 이러한 방식으로 픽셀의 값이 매끄러워지는 경향이 있을 수 있다. 이것은 픽셀의 디테일이 손실되는 처리 대상 차분 이미지에 블러 효과를 생성하는 것과 같다. 처리 대상 차분 이미지의 픽셀은 연속적이다. 따라서 서로 가까운 픽셀은 밀접하게 연관되고, 서로 멀리 떨어져 있는 픽셀 은 서로 소외된다. 따라서, 본 실시예에서는 가우시안 블러(Gaussian Blur, GB)를 사용하여 블러 처리를 수행한 다. 가우시안 블러에서는 정규 분포(가우시안 분포)가 처리 대상 차분 이미지를 처리하기 위해 사용될 수 있으 므로 픽셀의 가중된 평균화가 더 적절하다. 픽셀이 가까울수록 가중치가 커지고 픽셀이 멀수록 가중치가 작아진 다. 또한, 예를 들어 픽셀은 (x, y)이다. 픽셀 (x, y)는 2차원 픽셀이다. 따라서 2차원 가우스 함수는 다음 공식에 기초하여 계산될 수 있다. ; 여기서 (x, y)는 픽셀을 나타내고, 는 픽셀의 2차원 가우시안 함수를 나타내며, 는 정규분포의 표준 편차를 나타낸다. 이해의 편의를 위해, 예를 들어, 픽셀은 구체적으로 (0, 0)이다. 그러면, 픽셀 (0, 0)을 둘러싼 8개의 픽셀은 (-1, 1), (0, 1), (1, 1), (-1, 0), (1, 0), (-1, -1), (0, -1) 및 (1, -1)이 될 수 있다. 가중치 행렬을 계산 하기 위해 σ 값이 설정되어야 한다. σ=1.5라고 가정하면, 블러 반경이 1인 가중치 행렬을 획득할 수 있다. 예 를 들어, 가중치 행렬에서 픽셀 (0, 0)에 대응하는 가중치는 0.0707이고, 픽셀 (-1, 1)에 대응하는 가중치는 0.0453이고, 픽셀 (0, 1)에 대응하는 가중치는 0.0566이고, 픽셀 (1, 1)에 대응하는 가중치는 0.0453이고, 픽셀 (-1, 0)에 대응하는 가중치는 0.0566이고, 픽셀 (1, 0)에 대응하는 가중치는 0.0566이고, 픽셀 (-1, -1)에 대 응하는 가중치는 0.0453이고, 픽셀 (0, -1)에 대응하는 가중치는 0.0566이며, 픽셀 (1, -1)에 대응하는 가중치는 0.0453이다. 픽셀 (0, 0)과 주변 8개 픽셀의 가중치 합은 약 0.479이다. 이 9개 점의 가중된 평균만 계산되 면 이 9개 점의 가중치의 합이 1이어야 한다. 즉, 가중치의 합이 정규화된다. 예를 들어, 가중치 행렬에 해당하 는 9개의 값을 가중치의 합 0.479로 나누어 정규화된 가중치 행렬을 획득할 수 있다. 구체적으로, 픽셀 (0, 0) 에 대응하는 정규화된 가중치는 0.147이고, 픽셀 (-1, 1)에 대응하는 정규화된 가중치는 0.0947이고, 픽셀 (0, 1)에 대응하는 정규화된 가중치는 0.0118이고, 픽셀 (1, 1)에 대응하는 가중치는 0.0947이고, 픽셀 (-1, 0)에 대응하는 정규화된 가중치는 0.0118이고, 픽셀 (1, 0)에 대응하는 정규화된 가중치는 0.0118이고, 픽셀 (-1, -1)에 대응하는 정규화된 가중치는 0.0947이고, 픽셀 (0, -1)에 대응하는 정규화된 가중치는 0.0118이며, 픽셀 (1, -1)에 대응하는 정규화된 가중치는 0.0947이다. 가중치 합이 1보다 큰 가중치 행렬은 차분 이미지를 밝게 만들고 가중치 합이 1보다 작은 가중치 행렬은 차분 이미지를 어둡게 만든다. 따라서, 정규화된 가중치 행렬은 차분 이미지에 의해 제시되는 병리 조직 영역을 보다 정확하게 만들 수 있다. 또한, 정규화된 가중치 행렬이 획득된 후, 가우시안 블러(Gaussian Blur) 계산이 픽셀에 대해 수행될 수 있다. 예를 들어, 그레이 스케일 값이 0 내지 255의 범위에 있는 경우 가중치 행렬에서 픽셀 (0, 0)에 대응하는 그레 이 스케일 값은 25이고, 픽셀 (-1, 1)에 대응하는 그레이 스케일 값은 14이고, 픽셀 (0, 1)에 대응하는 그레이 스케일 값은 15이고, 픽셀 (1, 1)에 대응하는 그레이 스케일 값은 16이고, 픽셀 (-1, 0)에 대응하는 그레이 스 케일 값은 24이고, 픽셀 (1, 0)에 대응하는 그레이 스케일 값은 26이고, 픽셀 (-1, -1)에 대응하는 그레이 스케 일 값은 34이고, 픽셀 (0, -1)에 대응하는 그레이 스케일 값은 35이며, 픽셀 (1, -1)에 대응하는 그레이 스케일 값은 36이다. 각 픽셀에 대해 그레이 스케일 값을 픽셀에 대응하는 가중치와 곱하여 9개의 값을 획득한다. 구체 적으로, 픽셀 (0, 0)에 대해 3.69이 획득될 수 있고, 픽셀 (-1, 1)에 대해 1.32이 획득될 수 있고, 픽셀 (0, 1)에 대해 1.77이 획득될 수 있고, 픽셀 (1, 1)에 대해 1.51이 획득될 수 있고, 픽셀 (-1, 0)에 대해 2.83이 획득될 수 있고, 픽셀 (1, 0)에 대해 3.07이 획득될 수 있고, 픽셀 (-1, -1)에 대해 3.22이 획득될 수 있고, 픽 셀 (0, -1)에 대해 4.14이 획득될 수 있으며, 픽셀 (1, -1)에 대해 3.41이 획득될 수 있다. 그런 다음 9개의 값 을 더하여 픽셀 (0, 0)의 가우시안 블러 값을 획득한다. 또한, 가우시안 블러 처리에 의해 처리된 차분 이미지를 획득하기 위해 픽셀 (0, 0)에 대해 수행되는 단계가 처 리 대상 차분 이미지에 포함된 모든 픽셀에 대해 수행될 수 있다. 본 개시의 이 실시예는 차분 이미지를 생성하기 위한 다른 방법을 제공한다. 전술한 방식에서는 가우시안 블러 처리가 생성된 처리 대상 차분 이미지에 대해 수행된다. 가우시안 블러 처리는 처리 강건성을 향상시킬 수 있기 때문에 획득된 차분 이미지는 처리 강건성이 더 우수하여 차분 이미지의 안정성이 향상된다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 다른 선택적 인 실시예에서, 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하는 단계는 다음을 포함할 수 있다. 차분 이미지에 따라 이진화 문턱값을 결정하는 단계; 및 이진화된 이미지를 획득하기 위해 이진화 문턱값에 따라 차분 이미지에 대해 이진화 처리를 수행하는 단계. 본 실시예에서, 의료 이미지 처리 장치는 차분 이미지에 따라 이진화 문턱값을 결정하고, 차분 이미지에서 픽셀 에 대응하는 픽셀값이 이진화 문턱값보다 크거나 같을 때, 해당 픽셀을 이진화된 이미지의 전경 픽셀로 결정하 며, 차분 이미지에서 픽셀에 대응하는 픽셀값이 이진화 문턱값보다 작을 때, 해당 픽셀을 이진화된 이미지의 배 경 픽셀로 결정할 수 있다. 예를 들어, 차분 이미지에 대해 이진화 처리를 수행하여 그레이 스케일 이미지를 값이 0 또는 1인 이진화된 이 미지로 변환하기 위해 이진화 문턱값이 설정될 수 있다. 구체적으로, 차분 이미지의 이진화에서, 이진화 문턱값 은 차분 이미지를 이미지 전경과 이미지 배경이 각각 2개의 값(0 또는 1)으로만 표현되는 이진화된 이미지로 변 환하기 위해 설정될 수 있다. 전경 값은 1이고 배경 값은 0이다. 실제 응용에서 0은 RGB 값이 모두 0인 것에 해 당하고 1은 RGB 값이 모두 255인 것에 해당한다. 이진화된 이미지를 획득하기 위해 이진화 처리가 차분 이미지 에 대해 수행된다. 그러면, 이진화된 이미지가 더 처리될 때, 이진화된 이미지의 기하학적 속성은 0과 1의 위치 에만 관련되고 더 이상 픽셀의 그레이 스케일 값과 관련이 없기 때문에 이진화된 이미지의 처리가 간단해지고, 따라서 이미지 처리 효율성이 향상된다. 이진화 문턱값을 결정하기 위한 방법은 전역 문턱값 방법 및 로컬 문턱 값 방법을 포함할 수 있다. 전역 문턱값 방법은 전체 차분 이미지를 하나의 문턱값에 따라 분할하는 것을 의미 한다. 그러나 상이한 차분 이미지의 그레이 스케일 깊이는 서로 다르다. 또한, 동일한 차분 이미지의 상이한 부 분의 밝기 분포도 서로 다를 수 있다. 따라서, 본 실시예에서 이진화 문턱값은 동적 문턱값 이진화 방법을 사용하여 결정된다. 차분 이미지에 따라 이진화 문턱값이 결정된 후, 차분 이미지에서 픽셀에 대응하는 픽셀값이 이진화 문턱값과 비교된다. 차분 이미지에서 픽셀에 대응하는 픽셀값이 이진화 문턱값보다 크거나 같을 때 해당 픽셀은 이진화된 이미지의 전경 픽셀로 결정된다. 차분 이미지에서 픽셀에 대응하는 픽셀값이 이진화 문턱값보다 작을 때 해당 픽셀은 이진화된 이미지의 배경 픽셀로 결정된다. 예를 들어, 픽셀 A에 대응하는 픽셀값이 이진화 문턱값보다 클 때, 픽셀 A는 이진화된 이미지의 전경 픽셀로 결정된다. 즉, 픽셀값은 1이다. 구체적으로, 픽셀 A는 전경 영 역에 있고, 이미지가 RGB 모드일 때 흰색으로 표시된다. 픽셀 B에 대응하는 픽셀값이 이진화 문턱값보다 작을 때, 픽셀 B는 이진화된 이미지의 배경 픽셀로 결정된다. 즉, 픽셀값은 0이다. 구체적으로, 픽셀 B는 배경 영역 에 있고, 이미지가 RGB 모드일 때 검은색으로 표시된다. 본 개시의 이 실시예는 이진화된 이미지를 획득하기 위한 방법을 제공한다. 전술한 방식에서는 이진화 처리에 의해 이진화된 이미지가 생성된다. 이진화된 이미지의 기하학적 속성은 픽셀의 그레이 스케일 값과 관련이 없기 때문에, 이진화된 이미지의 후속 처리가 간단해질 수 있고, 따라서 결과 이미지 생성의 효율성이 향상된다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 다른 선택적 인 실시예에서, 차분 이미지에 따라 이진화 문턱값을 결정하는 단계는 다음을 포함할 수 있다. 차분 이미지에 따라, N개의 픽셀에 대응하는 N개의 픽셀값을 획득하는 단계 - 픽셀값과 픽셀은 일대일 대응이고, N은 1보다 큰 정수임 -; N개의 픽셀값으로부터 기준 픽셀값을 결정하는 단계 - 기준 픽셀값은 N개의 픽셀값 중 최대값임 -; 및 기준 픽셀값 및 미리 설정된 비율에 따라 이진화 문턱값을 계산하는 단계. 본 실시예에서, 의료 이미지 처리 장치는 차분 이미지에 따라 N개의 픽셀에 대응하는 N개의 픽셀값을 획득하고 - 픽셀값과 픽셀은 일대일 대응함 -, 그런 다음 N개의 픽셀값에서 기준 픽셀값을 결정하며 - 기준 픽셀값은 N개 의 픽셀값 중 최대값임 -, 마지막으로 기준 픽셀값과 미리 설정된 비율에 따라 이진화 문턱값을 계산할 수 있다 - N은 1보다 큰 정수임 -. 예를 들어, 본 실시예에서, 이진화 문턱값은 차분 이미지에 따라 결정된다. 차분 이미지는 처리 대상 의료 이미 지의 최대값 이미지에서 최소값 이미지를 빼서 생성될 수 있고, 차분 이미지에서 픽셀값과 픽셀값은 일대일 대 응된다. 따라서, 차분 이미지에서 복수의 픽셀에 대응하는 픽셀값이 획득될 수 있다. 그리고, 복수의 픽셀값 중 최대값이 기준 픽셀값으로 결정된다. 그런 다음 기준 픽셀값과 미리 설정된 비율에 따라 이진화 문턱값이 계산 된다. 이해의 편의를 위해, 본 실시예에서, 예컨대 미리 설정된 비율은 10%이다. 예를 들어, 축소된 WSI 이미지 의 길이와 너비는 수천 픽셀의 범위에 있다. 축소된 이미지는 100*100 픽셀을 포함한다고, 즉 최대값을 10000 픽셀에 대응하는 픽셀값에서 찾아야 한다고 가정한다. 예를 들어, 최대값은 150이다. 그러면, 최대값 150이 기 준 픽셀값인 것으로 결정될 수 있다. 그런 다음, 기준 픽셀값 150을 미리 설정된 비율 10%와 곱하여 이진화 문 턱값 15를 획득할 수 있다. 실제 응용 시, 미리 설정된 비율은 실제 상황에 따라 유연하게 결정될 수 있는 다른 백분율일 수 있다. 본 개시의 이 실시예는 이진화 문턱값을 획득하기 위한 다른 방법을 제공한다. 전술한 방식에서는 이진화 문턱 값이 최대 픽셀값으로 결정된 기준 픽셀값 및 미리 설정된 비율에 기초하여 결정될 수 있다. 차분 이미지의 그 레이 스케일 깊이는 서로 다르다. 또한, 상이한 영역의 밝기 분포도 서로 다를 수 있다. 따라서, 문턱값 정확도 및 문턱값의 유연성을 개선하여, 이진화된 이미지의 정확도를 향상시키기 위해, 미리 설정된 비율을 조정함으로 써 이진화 문턱값이 유연하게 결정될 수 있다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 다른 선택적 인 실시예에서, 방법은 다음을 더 포함할 수 있다. 플러드 알고리즘에 기초하여 이진화된 이미지에서 배경 영역을 검출하는 단계 - 배경 영역은 복수의 배경 픽셀 을 포함함 -; 이진화된 이미지 및 이진화된 이미지의 배경 영역에 따라 이진화된 이미지의 전경 영역에서 배경 픽셀을 획득하 는 단계 - 전경 영역은 복수의 전경 픽셀을 포함함 -; 구멍이 채워진 이미지를 획득하기 위해 이진화된 이미지의 전경 영역의 배경 픽셀을 전경 픽셀로 변경하는 단계; 및결과 이미지를 획득하기 위해 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행하는 단계 - 결과 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 해당함 -. 본 실시예에서, 의료 이미지 처리 장치는 플러드 알고리즘에 기초하여 이진화된 이미지의 배경 영역을 검출하고 - 배경 영역은 복수의 배경 픽셀을 포함할 수 있음 -, 그런 다음 이진화된 이미지 및 이진화된 이미지의 배경 영역에 따라 이진화된 이미지의 전경 영역에서 배경 픽셀을 획득하고 - 전경 영역은 복수의 전경 픽셀을 포함할 수 있음 -, 그런 다음 구멍이 채워진 이미지를 획득하기 위해 이진화된 이미지의 전경 영역의 배경 픽셀을 전경 픽셀로 변경하며, 마지막으로 결과 이미지를 획득하기 위해 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행할 수 있다. 결과 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 해당한다. 예를 들어, 이진화 처리가 차분 이미지에 대해 수행된 후, 획득된 이진화된 이미지의 전경 영역은 검은 구멍을 포함할 수 있다. 검은 구멍은 전경 영역에서 검출되어야 한다. 이해의 편의를 위해, 본 개시의 일 실시예에 따 른 결과 이미지의 개략도인 도 7를 참조한다. 도 7에 도시된 바와 같이, 도 7의 (A)에 도시된 이진화된 이미지 에서 흰색 전경 영역은 복수의 배경 픽셀을 포함한다. 영역 A1 내지 영역 A5의 검은 점들은 모두 배경 픽셀에 의해 형성된다. 영역 A1 내지 영역 A5의 이러한 검은 점들은 배경 픽셀에서 전경 픽셀로 변경된다. 영역 A6 및 영역 A7의 흰 점들은 전경 픽셀에 의해 형성된다. 영역 A6 및 영역 A7의 이러한 흰 점들은 전경 픽셀에서 배경 픽셀로 변경된다. 이런 식으로, 도 7의 (B)에 도시된 구멍이 채워진 이미지가 획득될 수 있다. 또한, 도 7의 (B)에 도시된 구멍이 채워진 이미지에 대해 중간 필터링 처리가 수행되고, 형태학적 처리가 더 수 행될 수 있다. 그러면, 도 7의 (C)에 도시된 결과 이미지가 획득될 수 있다. 필터링 처리는 구멍이 채워진 이미 지의 디테일 특징을 최대한 유지하면서 처리 대상 의료 이미지의 노이즈를 억제하는 것이고, 필터링 처리는 결 과 이미지의 후속 처리 및 분석의 효율성과 신뢰성을 향상시킬 수 있다. 필터링 작업은 구멍이 채워진 이미지에 서 노이즈 성분을 제거하는 것이다. 구멍이 채워진 이미지의 에너지는 대부분 진폭 스펙트럼의 중저대역에 집중 되어 있다. 고대역에서, 구멍이 채워진 이미지의 정보는 노이즈에 의해 영향을 받는 경우가 많다. 따라서, 이미 지 처리 요구 사항을 충족하고 이미지가 디지털화될 때 발생되는 노이즈를 제거하기 위해, 구멍이 채워진 이미 지에 대해 필터링 작업이 수행될 수 있다. 중간 필터링 처리는 전형적인 비선형 필터링이고, 정렬 통계 이론에 기초하여 노이즈를 효과적으로 억제할 수 있다. 중간 필터링 처리에서, 픽셀의 주변 그레이 스케일 값의 중간 값은 픽셀의 그레이 스케일 값을 대체할 수 있으므로, 주변 픽셀값이 실제 값에 가깝도록 하여 고립된 노이즈 점들을 제거할 수 있다. 본 개시의 이 실시예는 결과 이미지를 생성하기 위한 방법을 제공한다. 전술한 방식에서는 전경 영역의 배경 픽 셀이 전경 픽셀로 변경되어, 획득된 구멍이 채워진 이미지는 신뢰성이 높다. 또한, 중간 필터링 처리를 통해, 처리 대상 의료 이미지에 대응하는 결과 이미지가 선명하고 이미지의 외곽선 및 가장자리와 같은 특징 정보의 손실 없이 바람직한 시각적 효과를 얻을 수 있다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 다른 선택적 인 실시예에서, 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행하는 단계는 다음을 포함할 수 있다. 필터링된 이미지를 획득하기 위해 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행하는 단계 - 결과 이미 지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 해당함 -; 필터링된 이미지에서 전경 영역의 경계선을 획득하는 단계 - 경계선은 M개의 픽셀을 포함하고, M은 1보다 큰 정 수임 -; 및 결과 이미지를 획득하기 위해 경계선의 M개의 픽셀 각각을 K 픽셀만큼 바깥쪽으로 확장하는 단계 - K는 1 이상 의 정수임 -. 본 실시예에서, 의료 이미지 처리 장치는 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행하고 - 필터링 된 이미지는 처리 대상 전경 영역을 포함할 수 있음 -, 필터링된 이미지의 전경 영역의 경계선을 획득하며 - 경 계선은 M개의 픽셀을 포함함 -, 결과 이미지를 획득하기 위해 경계선 상의 M개의 픽셀 각각을 K 픽셀만큼 바깥 쪽으로 확장한다 - M은 1보다 큰 정수이고 K는 1보다 크거나 작은 정수임 -. 예를 들어, 중간 필터링 처리에서, 픽셀의 주변 그레이 스케일 값의 중간 값은 픽셀의 그레이 스케일 값을 대체할 수 있으므로, 주변 픽셀값이 실 제 값에 가깝도록 하여 고립된 노이즈 점들을 제거할 수 있다. 중간 필터링 처리를 통해, 필터링된 이미지의 이 미지 가장자리 디테일이 보존되지만 임펄스 노이즈와 솔트 앤 페퍼 노이즈는 제거된다. 또한, 유사한 컬러의 연결된 영역은 플러드 알고리즘(Flood Fill)에 기초하여 채워진다. 플러드 알고리즘의 기 본 원리는 픽셀에서 시작하여 그래프의 경계까지 주변 픽셀로 확장 및 채색하는 것이다. 플러드 알고리즘은 시 작 노드, 타깃 컬러 및 대체 컬러의 세 가지 매개변수를 사용해야 한다. 플러드 알고리즘에서는 타깃 컬러의 경 로를 통해 시작 노드에 연결된 모든 노드가 감지되어 교체 컬러로 변경된다. 실제 응용에서, 플러드 알고리즘은 큐 데이터 구조 또는 스태킹 데이터 구조를 명시적 또는 묵시적으로 사용하는 복수의 방식으로 구성될 수 있다. 예로는 4개의 이웃 플러드 알고리즘, 8개의 이웃 플러드 알고리즘, 주사선 채우기 알고리즘 및 대규모 동작 알 고리즘이 있다. 기존의 4개의 이웃 플러드 알고리즘의 아이디어는 다음과 같다. 픽셀 (x, y)가 채색된 후, 픽셀 주변의 위쪽, 아래쪽, 왼쪽 및 오른쪽 점들이 각각 채색된다. 그러나, 알고리즘을 재귀적 방식으로 수행하면 메 모리의 많은 부분이 소모될 것이다. 채색될 영역이 너무 크면, 오버플로가 발생한다. 따라서, 4개의 이웃 플러 드 알고리즘이 비재귀적인 방식으로 사용될 수 있다. 8개의 이웃 플러드 알고리즘은 픽셀의 위쪽, 아래쪽, 왼쪽, 오른쪽, 왼쪽 위, 왼쪽 아래, 오른쪽 위 및 오른쪽 아래 위치에 있는 픽셀을 채색한다. 주사선 채우기 알 고리즘은 채우기 선을 사용하여 채색을 가속화할 수 있고, 여기서 선 상의 픽셀이 먼저 채색될 수 있으며, 그런 다음 채색이 끝날 때까지 채색이 위아래로 확장된다. 대규모 행동은 데이터 중심 또는 절차 중심이다. 구멍이 채워진 이미지의 경계선이 불규칙하기 때문에, 본 실시예에서는 주사선 채우기 알고리즘이 사용된다. 예 를 들어, 처리 대상 전경 영역은 1000개의 픽셀의 경계선을 포함한다. 1000개의 픽셀은 형태학적 처리를 통해 K 픽셀만큼 바깥쪽으로 각각 확장된다. K가 2라고 가정하면, 원본 1000개의 픽셀에 더하여 2000개의 픽셀이 전경 영역에 추가되어, 결과 이미지를 획득한다. 실제 응용에서, M과 K의 구체적인 값은 모두 실제 상황에 따라 유연 하게 결정되어야 한다. 본 개시의 이 실시예는 결과 이미지를 생성하기 위한 다른 방법을 제공한다. 전술한 방식에서는 중간 필터링 처 리를 통해, 필터링된 이미지가 선명하고 이미지의 외곽선 및 가장자리와 같은 특징 정보의 손실 없이 바람직한 시각적 효과를 갖는다. 그런 다음, 결과 이미지의 정확도와 무결성을 향상시키기 위해, 형태학적 처리가 플러드 알고리즘에 기초하여 필터링된 이미지에 대해 수행된다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 다른 선택적 인 실시예에서, 처리 대상 의료 이미지를 획득하는 단계는 다음을 포함할 수 있다. 원본 의료 이미지를 획득하는 단계; 슬라이딩 윈도우를 이용하여 원본 의료 이미지로부터 의료 서브 이미지를 추출하는 단계; 의료 서브 이미지가 병리 조직 영역을 포함하는 것으로 검출된 경우, 의료 서브 이미지를 처리 대상 의료 이미 지로 결정하는 단계; 및 의료 서브 이미지가 병리 조직 영역을 포함하지 않는 것으로 검출된 경우, 의료 서브 이미지를 배경 이미지로 결정하고 배경 이미지를 제거하는 단계. 본 실시예에서, 의료 이미지 처리 장치는 먼저 의료 원본 이미지를 획득하고, 슬라이딩 윈도우를 이용하여 원본 의료 이미지로부터 의료 서브 이미지를 추출하고, 의료 서브 이미지가 병리 조직 영역을 포함한다고 검출할 때, 의료 서브 이미지를 처리 대상 의료 이미지로 결정하며, 의료 서브 이미지가 병리 조직 영역을 포함하지 않는다 고 검출할 때, 의료 서브 이미지를 배경 이미지로 결정하고 배경 이미지를 제거할 수 있다. 예를 들어, 원본 의 료 이미지는 유선 네트워크를 통해 의료 이미지 처리 장치에 의해 수신된 이미지이거나, 의료 이미지 처리 장치 에 의해 저장된 이미지일 수 있다. 이해의 편의를 위해, 본 개시의 일 실시예에 따른 처리 대상 의료 이미지를 획득하는 개략도인 도 8을 참조한다. 도 8에 도시된 바와 같이, 도 8의 (A)는 원본 의료 이미지를 나타낸다. 의료 서브 이미지는 슬라이딩 윈도우를 이용하여 원본 의료 이미지로부터 추출된다. B1 내지 B3의 영역은 원본 의료 이미지로부터 추출된 의 료 서브 이미지다. 따라서, 도 8의 (B)에 도시된 의료 서브 이미지는 B1으로부터 상응하게 획득될 수 있고, 도 8의 (C)에 도시된 의료 서브 이미지는 B2로부터 상응하게 획득될 수 있으며, 도 8의 (D)에 도시된 의료 서브 이 미지는 B3로부터 상응하게 획득될 수 있다. 알 수 있는 바와 같이, 도 8의 (B) 및 (C)에 도시된 의료 서브 이미 지는 병리 조직 영역을 포함한다. 따라서, 도 8의 (B) 및 (C)에 도시된 의료 서브 이미지는 처리 대상 의료 이 미지로 결정될 수 있다. 그러나, 도 8의 (D)에 도시된 의료 서브 이미지는 병리 조직 영역을 포함하지 않는다. 따라서, 도 8의 (D)에 도시된 의료 서브 이미지는 배경 이미지로 결정될 수 있고 배경 이미지는 제거된다. 본 개시의 이 실시예는 처리 대상 의료 이미지를 획득하기 위한 방법을 제공한다. 전술한 방식에서는 처리 대상 의료 이미지를 결정하기 위해, 의료 서브 이미지가 병리 조직 영역을 포함하는지 여부가 검출되고, 병리 조직을 포함하는 처리 대상 의료 이미지에 대응하는 결과 이미지가 전술한 단계들을 통해 획득될 수 있다. 결과 이미지는 병리 조직 영역을 포함한다. 이는 결과 이미지에서 병리 조직 영역의 후속 처리 및 분석을 용이하게 한다. 병리 조직 영역을 포함하지 않는 의료 서브 이미지는 배경 이미지로 결정되고 배경 이미지는 제거되어, 자원 점 유를 줄인다. 선택적으로, 도 2에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 방법의 다른 선택적 인 실시예에서, 이진화된 이미지에 따라 결과 이미지를 생성한 후, 의료 이미지 처리 방법은 다음을 포함할 수 있다. 결과 이미지에 따라 타깃 포지티브(positive) 샘플 이미지를 생성하는 단계 - 타깃 포지티브 샘플 이미지는 포 지티브 샘플 세트의 포지티브 샘플 이미지이고, 각각의 포지티브 샘플 이미지는 병리 조직 영역을 포함함 -; 네거티브(negative) 샘플 세트를 획득하는 단계 - 네거티브 샘플 세트는 적어도 하나의 네거티브 샘플 이미지를 포함하고, 각각의 네거티브 샘플 이미지는 병리 조직 영역을 포함하지 않음 -; 및 포지티브 샘플 세트와 네거티브 샘플 세트에 기초하여 이미지 처리 모델을 트레이닝하는 단계. 본 실시예에서, 결과 이미지가 이진화된 이미지에 따라 생성된 후, 의료 이미지 처리 장치는 결과 이미지에 따 라 타깃 포지티브 샘플 이미지를 더 생성할 수 있고, 여기서 타깃 포지티브 샘플 이미지는 포지티브 샘플 세트 의 포지티브 샘플 이미지고, 각각의 포지티브 샘플 이미지는 병리 조직 영역을 포함한다. 또한, 의료 이미지 처 리 장치는 네거티브 샘플 세트를 획득할 수 있고, 여기서 네거티브 샘플 세트는 적어도 하나의 네거티브 샘플 이미지를 포함하고, 각각의 네거티브 샘플 이미지는 병리 조직 영역을 포함하지 않는다. 마지막으로, 의료 이미 지 처리 장치는 획득된 포지티브 샘플 세트 및 네거티브 샘플 세트에 기초하여 이미지 처리 모델을 트레이닝할 수 있다. 이미지 처리 모델은 의료 컬러 이미지에 기초하여 병리 조직 영역을 획득하기 위한 처리를 수행할 수 있다. 본 개시의 이 실시예는 이미지 처리 모델을 트레이닝하기 위한 방법을 제공한다. 전술한 방식에서는 이미지 처 리 모델이 병리 조직 영역을 포함하는 포지티브 샘플 이미지 세트 및 병리 조직 영역을 포함하지 않는 네거티브 샘플 세트에 기초하여 트레이닝된다. 이는 이미지 처리 모델의 정확도와 신뢰성을 향상시켜, 이미지 처리 효율 성과 정확도를 향상시킨다. 예를 들어, 본 개시의 이 실시예는 추출된 병리 조직 영역의 정확도를 개선하고, 후속 이미지 분석을 용이하게 할 수 있다. 본 개시의 이 실시예의 이해를 용이하게 하기 위해, 본 개시의 일 실시예에 따른 의료 이미지 처리 방법의 개략적인 흐름도인 도 9를 참조하고, 이는 다음의 단계들을 포함한다. 단계 S1: 원본 의료 이미지를 획득한다. 단계 S2: 원본 의료 이미지에 기초하여 처리 대상 의료 이미지를 획득한다. 단계 S3: 처리 대상 의료 이미지에 따라 차분 이미지를 생성한다. 단계 S4: 차분 이미지에 대해 이진화 처리를 수행하여 이진화된 이미지를 획득한다. 단계 S5: 이진화된 이미지에 기초하여 구멍이 채워진 이미지를 획득한다. 단계 S6: 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행하여 결과 이미지를 획득한다. 단계 S1에서는 도 9의 (A)와 같은 원본 의료 이미지가 생성된다. 그 다음, 단계 S2에서는 의료 서브 이미지가 슬라이딩 윈도우를 사용하여 도 9의 (A)에 도시된 원본 의료 이미지로부터 추출된다. 의료 서브 이미지가 병리 조직 영역을 포함하는 것으로 검출되면, 의료 서브 이미지가 처리 대상 의료 이미지로 결정되어, 도 9의 (B)와 같은 처리 대상 의료 이미지를 획득한다. 또한, 단계 S3에서는 최대값 이미지 및 최소값 이미지를 생성하기 위 해, 타깃 픽셀에 대응하는 최대 픽셀값 및 최소 픽셀값이 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 제1 픽셀값, 제2 픽셀값 및 제3 픽셀값 중에서 결정될 수 있다. 그 다음, 도 9의 (C)와 같은 차분 이미지가 최대값 이미지와 최소값 이미지에 따라 획득된다. 또한, 단계 S4에서는 N개의 픽셀에 대응하는 N개의 픽셀값이 도 9의 (C)와 같은 차분 이미지에 따라 획득될 수 있고, 여기 서 픽셀값과 픽셀은 일대일 대응이다. N개의 픽셀값 중 최대값은 기준 픽셀값으로 결정되고, 이진화 문턱값은 기준 픽셀값과 미리 설정된 비율에 따라 계산된다. 또한, 도 9의 (D)와 같은 이진화된 이미지를 획득하기 위해, 차분 이미지의 픽셀에 대응하는 픽셀값이 이진화 문턱값보다 크거나 같을 때, 해당 픽셀은 이진화된 이미지의 전경 픽셀로 결정되고, 차분 이미지의 픽셀에 대응하는 픽셀값이 이진화 문턱값보다 작을 때, 해당 픽셀은 이진 화된 이미지의 배경 픽셀로 결정된다. 단계 S5에서는, 플러드 알고리즘에 기초하여 이진화된 이미지의 복수의배경 픽셀을 포함하는 배경 영역이 검출되고, 이진화된 이미지 및 이진화된 이미지의 배경 영역에 따라 이진화 된 이미지의 전경 영역의 배경 픽셀이 획득되며, 도 9의 (E)와 같은 구멍이 채워진 이미지를 획득하기 위해 이 진화된 이미지의 전경 영역의 배경 픽셀이 전경 픽셀로 변경된다. 단계 S6에서는 중간 필터링 처리를 구멍이 채 워진 이미지에 대해 수행하여, 처리 대상 전경 영역을 포함하는 필터링된 이미지를 획득하고, 그 다음 처리 대 상 전경 영역에서 M개의 픽셀을 포함하는 경계선을 획득하며, 경계선 상의 M개의 픽셀 각각을 K 픽셀만큼 바깥 쪽으로 확장하여 도 9의 (F)와 같은 결과 이미지를 획득하고, 여기서 M은 1보다 큰 정수이다. 또한, 결과 이미지가 상이한 처리 대상 의료 이미지에 대해 생성될 수 있다. 도 10은 본 개시의 일 실시예에 따 른 결과 이미지의 개략도이다. 도 10에 도시된 바와 같이, 도 10의 (A)에 도시된 순백색 및 회색의 처리 대상 의료 이미지에 대해, 도 10의 (B)에 도시된 결과 이미지가 본 개시의 실시예에서 제공하는 의료 이미지 처리 방 법을 통해 획득될 수 있다. 도 10의 (C)는 규칙적인 세로 줄무늬가 있는 처리 대상 의료 이미지를 나타낸다. 스 캐너가 유리 슬라이드를 스캔할 때 규칙적인 세로 줄무늬가 생성되며, 이는 스캔 장치에 따라 다르다. (C)에 대 해, 도 10의 (D)에 도시된 결과 이미지가 본 개시의 실시예에서 제공하는 의료 이미지 처리 방법을 통해 획득될 수 있다. 도 10의 (E)는 흑백 줄무늬가 있는 처리 대상 의료 이미지를 나타낸다. 흑백 줄무늬는 형식 변환을 통 해 생성되거나, 스캐너가 유리 슬라이드를 스캔할 때 생성되는 불분명한 영역에 추가될 수 있다. (E)에 대해, 도 10의 (F)에 도시된 결과 이미지가 본 개시의 실시예에서 제공하는 의료 이미지 처리 방법을 통해 획득할 수 있다. 알 수 있는 바와 같이, 이진화 처리가 이미지에 대해 수행되기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이미지가 생성된다. 상이한 채널의 그레이 스케일 픽셀의 컬러 정보가 약간 다르고, 상이한 채널의 컬러 픽셀의 컬러 정보는 크게 다르기 때문에 도 10의 다양한 처리 대상 이미지의 컬러 정보를 효과적으로 사용할 수 있어, 차분 이미지에 기초하여 추출된 병리 조직 영역이 보다 정확하고, 이는 후속 이미지 분석을 용이하게 한 다. 전술한 내용을 참조하여, 다음은 본 개시의 이미지 처리 방법을 설명한다. 도 11은 본 개시의 일 실시예에 따른 이미지 처리 방법의 개략도이다. 도 11에 도시된 바와 같이, 본 개시의 이미지 처리 방법의 일 실시예는 다음을 포함한다. 201: 제1 처리 대상 이미지 및 제2 처리 대상 이미지를 획득하는 단계 - 제1 처리 대상 이미지는 컬러 이미지이 고, 제1 처리 대상 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 제1 이 미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타냄. 본 실시예에서, 이미지 처리 장치는 제1 처리 대상 이미지 및 제2 처리 대상 이미지를 획득할 수 있고, 여기서 제1 처리 대상 이미지는 제1 이미지 데이터, 제2 이미지 데이터, 및 제3 이미지 데이터를 포함할 수 있고, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타낸다. 제1 처 리 대상 이미지 및 제2 처리 대상 이미지는 유선 네트워크를 통해 이미지 처리 장치에 의해 수신된 이미지이거 나, 이미지 처리 장치에 의해 저장된 이미지일 수 있다. 예를 들어, 제1 처리 대상 이미지는 단계 101에서 설명 된 처리 대상 의료 이미지와 유사하다. 디테일은 여기에서 다시 설명되지 않는다. 실제 응용에서, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 구체적으로 대응하는 컬러 정보 는 실제 상황에 따라 유연하게 결정되어야 한다. 또한, 이미지 처리 장치는 서버에 배치될 수 있고, 컴퓨팅 능 력이 높은 단말 장치에 배치될 수도 있다. 본 실시예에서, 예를 들어, 이미지 처리 장치는 서버에 배치된다. 예를 들어, 제1 처리 대상 이미지가 흐린 날 촬영된 이미지라고 가정하면, 이미지의 배경은 흐린 하늘이고 빨간 자동차를 더 포함한다. 제2 처리 대상 이미지는 푸른 하늘과 바다의 이미지이다. 202: 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성하는 단계. 본 실시예에서, 이미지 처리 장치는 단계 201에서 획득된 제1 처리 이미지에 포함된 제1 이미지 데이터, 제2 이 미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성할 수 있다. 예를 들어, 차분 이미지는 그레이 스 케일 이미지이다. 본 실시예에서 차분 이미지를 생성하는 방법은 도 2에 대응하는 실시예에서와 유사하다. 디테 일은 여기에서 다시 설명되지 않는다. 예를 들어, 이 경우에 생성된 차분 이미지는 자동차의 외곽선을 나타낼 수 있다. 203: 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하는 단계 - 이진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 해당함. 본 실시예에서, 이미지 처리 장치는 단계 202에서 생성된 차분 이미지에 대해 이진화 처리를 수행하여 이진화된 이미지를 획득할 수 있다. 예를 들어, 본 실시예에서, 전경 처리는 적응 이진화 방식으로 수행된다. 즉, 차분 이미지에 대해 이진화 처리가 수행되어, 이진화된 이미지를 획득한다. 본 실시예에서 이진화된 이미지를 생성하 는 방법은 도 2에 대응하는 실시예에서와 유사하다. 디테일은 여기에서 다시 설명되지 않는다. 예를 들어, 이 경우에 생성된 이진화 이미지는 자동차의 외곽선을 정확하게 나타낼 수 있다. 204: 이진화된 이미지의 전경 영역에 따라 제1 처리 대상 이미지로부터 타깃 객체를 추출하는 단계. 본 실시예에서, 이미지 처리 장치는 단계 203에서 생성된 전경 영역에 따라 제1 처리 대상 이미지로부터 타깃 객체를 추출할 수 있다. 제1 처리 대상 이미지가 의료 이미지이면, 타깃 객체는 병리 조직 영역일 수 있다. 제1 처리 대상 이미지가 고해상도 원격 감지 이미지이면, 타깃 객체는 식생 영역일 수 있다. 제1 처리 대상 이미지 가 실시간 교통 모니터링 이미지이면, 타깃 객체는 자전거 또는 자동차일 수 있다. 예를 들어, 이 경우, 자동차의 이미지는 제1 처리 대상 이미지로부터 추출될 수 있다. 즉, 자동차의 이미지가 타깃 객체로부터 추출될 수 있다. 205: 타깃 객체 및 제2 처리 대상 이미지에 따라 합성된 이미지를 생성하는 단계 - 타깃 객체는 제1 이미지 레 이어 상에 있고, 제2 처리 대상 이미지는 제2 이미지 레이어 상에 있으며, 제1 이미지 레이어는 제2 이미지 레 이어를 커버함 -. 제1 이미지 레이어를 사용하여 제2 이미지 레이어를 덮고, 합성 이미지를 생성합니다. 예를 들어, 자동차의 이미지는 푸른 하늘과 흰 구름의 이미지를 커버하여 합성된 이미지를 형성한다. 이미지에 서 자동차의 배경은 더 이상 흐린 하늘이 아니라 파란 하늘과 흰 구름임을 알 수 있다. 본 개시의 이 실시예에서, 이미지 처리 방법이 제공된다. 상이한 채널의 그레이 스케일 픽셀의 컬러 정보는 약 간 다르고, 상이한 채널의 컬러 픽셀의 컬러 정보는 크게 다르다. 따라서, 전술한 방식에서는 이미지에 대해 이 진화 처리를 수행하기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이미지를 생성함으로써, 이미지의 컬러 정보를 효과적으로 사용한다. 차분 이미지에 기초하여 추출된 타깃 객체가 더 정확하다. 따라서, 타깃 객체의 레이어를 사용하여 제2 처리 대상 이미지의 레이어를 커버함으로써, 생성된 합성된 이미지의 타깃 객체가 정확 하므로, 합성된 이미지의 정확도를 향상시키고 후속 이미지 분석을 용이하게 한다. 본 개시의 의료 이미지 처리 장치가 아래에서 상세하게 설명된다. 도 12는 본 개시의 일 실시예에 따른 의료 이 미지 처리 장치의 개략도이다. 의료 이미지 처리 장치는 다음을 포함한다. 처리 대상 의료 이미지를 획득하도록 구성된 획득 모듈 - 처리 대상 의료 이미지는 컬러 이미지이고, 처리 대상 의료 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하며, 제1 이미지 데이 터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타냄 -; 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성하도록 구성된 생성 모 듈; 및 이진화된 이미지를 획득하기 위해, 차분 이미지에 대해 이진화 처리를 수행하도록 구성된 처리 모듈 - 이 진화된 이미지의 전경 영역은 처리 대상 의료 이미지의 병리 조직 영역에 해당함 -. 본 개시의 이 실시예에서, 의료 이미지 처리 방법이 제공된다. 상이한 채널의 그레이 스케일 픽셀의 컬러 정보 는 약간 다르고, 상이한 채널의 컬러 픽셀의 컬러 정보는 크게 다르다. 따라서, 전술한 방식에서는 이미지에 대 해 이진화 처리를 수행하기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이미지를 생성함으로써, 이미지의 컬러 정보를 효과적으로 사용한다. 차분 이미지에 기초하여 추출된 병리 조직 영역이 더 정확하고, 이는 후속 이미지 분석을 용이하게 한다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 생성 모듈은 또한, 처리 대상 의료 이미지에 포함된 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 최대값 이미지 및 최소값 이미지를 생성하고; 최대값 이미지와 최소값 이미지에 따라 차분 이미지를 생성하도록 구성된다. 본 개시의 이 실시예는 차분 이미지를 생성하기 위한 방법을 제공한다. 전술한 방식에서는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 최대값 이미지 및 최소값 이미지가 생성된다. 상이한 이미지데이터는 상이한 컬러 정보에 대응하므로, 상이한 이미지 데이터에 따라 결정되는 최대값 이미지와 최소값 이미 지는 처리 대상 의료 이미지의 정확한 컬러 정보를 포함하므로, 차분 이미지가 정확하게 생성된다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 생성 모듈은 또한, 제1 이미지 데이터의 제1 픽셀 위치에서의 제1 픽셀 값, 제2 이미지 데이터의 제2 픽셀 위치에서의 제2 픽셀 값 및 제3 이미지 데이터의 제3 픽셀 위치에서의 제3 픽셀 값에 따라 최대 픽셀값 및 최소 픽셀값을 결정하고; 최대 픽셀값에 따라 최대값 이미지를 획득하고, 최소 픽셀값에 따라 최소값 이미지를 획득 - 최대값 이미지의 제4 픽셀 위치에서의 픽셀값은 최대 픽셀값이고, 최소값 이미지의 제5 픽셀 위치에서의 픽셀값은 최소 픽셀값이 며, 제1 픽셀 위치, 제2 픽셀 위치, 제3 픽셀 위치, 제4 픽셀 위치 및 제5 픽셀 위치는 모두 처리 대상 의료 이 미지의 동일한 픽셀 위치에 대응함 - 하도록 구성된다. 생성 모듈은 또한, 최대값 이미지의 제4 픽셀 위치에서의 픽셀값 및 최소값 이미지의 제5 픽셀 위치에서의 픽셀값에 따라 픽셀 차이를 결정하고; 픽셀 차이에 따라 차분 이미지를 획득 - 차분 이미지의 제6 픽셀 위치의 픽셀값은 픽셀 차이이고, 제4 픽셀 위 치, 제5 픽셀 위치 및 제6 픽셀 위치는 모두 처리 대상 의료 이미지의 동일한 픽셀 위치에 대응함 - 하도록 구 성된다. 본 개시의 이 실시예는 최대값 이미지를 생성하기 위한 방법을 제공한다. 전술한 방식에서는 최대 픽셀값 및 최 소 픽셀값이 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 대응하는 타깃 픽셀의 픽셀값에 기 초하여 결정된다. 최대 픽셀값과 최소 픽셀값은 처리 대상 의료 이미지의 컬러 정보를 어느 정도 반영한다. 최 대 픽셀값에서 최소 픽셀값을 빼서 차분 픽셀값을 획득한다. 따라서, 차분 픽셀값은 처리 대상 의료 이미지의 컬러 정보를 정확하게 반영할 수 있으므로, 차분 이미지가 보다 정확하게 생성된다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 생성 모듈은 또한, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 처리 대상 차분 이미지를 생성하고; 차분 이미지를 획득하기 위해 처리 대상 차분 이미지에 대해 가우시안 블러 처리를 수행하도록 구성된다. 본 개시의 이 실시예는 차분 이미지를 생성하기 위한 다른 방법을 제공한다. 전술한 방식에서는 가우시안 블러 처리가 생성된 처리 대상 차분 이미지에 대해 수행된다. 가우시안 블러 처리는 강건성을 향상시킬 수 있기 때문 에 획득된 차분 이미지는 강건성이 더 우수하여 차분 이미지의 안정성이 향상된다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 의료 이미지 처리 장치는 결정 모듈을 더 포함한다. 결정 모듈은 차분 이미지에 따라 이진화 문턱값을 결정하도록 구성된다. 결정 모듈은 또한, 이진화 문턱값에 따라 차분 이미지에 대해 이진화 처리를 수행하여 이진화된 이미지를 획득하도록 구성된다. 본 개시의 이 실시예는 이진화된 이미지를 획득하기 위한 방법을 제공한다. 전술한 방식에서는 이진화된 이미지 가 이진화 처리에 의해 생성된다. 이진화된 이미지의 기하학적 속성은 픽셀의 그레이 스케일 값과 관련이 없기 때문에, 이진화된 이미지의 후속 처리가 간단해질 수 있고, 따라서 전경 영역 생성의 효율성이 향상된다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 결정 모듈은 또한, 차분 이미지에 따라, N개의 픽셀에 대응하는 N개의 픽셀값을 획득하고 - 픽셀값과 픽셀은 일대일 대응이고, N은 1보다 큰 정수임 -; N개의 픽셀 값으로부터 기준 픽셀값을 결정하며 - 기준 픽셀 값은 N개의 픽셀값 중 최대값임 -; 기준 픽셀 값 및 미리 설정된 비율에 따라 이진화 문턱값을 결정하도록 구성된다. 본 개시의 이 실시예는 이진화 문턱값을 획득하기 위한 다른 방법을 제공한다. 전술한 방식에서는 이진화 문턱 값이 최대 픽셀값으로 결정된 기준 픽셀값 및 기설정된 비율에 기초하여 결정될 수 있다. 차분 이미지의 그레이스케일 깊이는 서로 다르다. 또한, 상이한 영역의 밝기 분포도 서로 다를 수 있다. 따라서, 문턱값 정확도 및 문턱값의 유연성을 개선하여, 이진화된 이미지의 정확도를 향상시키기 위해, 미리 설정된 비율을 조정함으로써 이진화 문턱값이 유연하게 결정될 수 있다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 생성 모듈은 또한, 플러드 알고리즘에 기초하여 이진화된 이미지에서 배경 영역을 검출하고 - 배경 영역은 복수의 배경 픽셀을 포 함함 -; 이진화된 이미지 및 이진화된 이미지의 배경 영역에 따라 이진화된 이미지의 전경 영역에서 배경 픽셀을 획득하 고 - 전경 영역은 복수의 전경 픽셀을 포함함 -; 구멍이 채워진 이미지를 획득하기 위해 이진화된 이미지의 전경 영역의 배경 픽셀을 전경 픽셀로 변경하며; 결과 이미지를 획득하기 위해 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행 - 결과 이미지의 전경 영 역은 처리 대상 의료 이미지의 병리 조직 영역에 해당함 - 하도록 구성된다. 본 개시의 이 실시예는 결과 이미지를 생성하기 위한 방법을 제공한다. 전술한 방식에서는 전경 영역의 배경 픽 셀이 전경 픽셀로 변경되어, 획득된 구멍이 채워진 이미지는 신뢰성이 높다. 또한, 중간 필터링 처리를 통해, 처리 대상 의료 이미지에 대응하는 결과 이미지가 선명하고 이미지의 외곽선 및 가장자리와 같은 특징 정보의 손실 없이 바람직한 시각적 효과를 얻을 수 있다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 처리 모듈은 또한, 필터링된 이미지를 획득하기 위해 구멍이 채워진 이미지에 대해 중간 필터링 처리를 수행하고; 필터링된 이미지에서 전경 영역의 경계선을 획득하며 - 경계선은 M개의 픽셀을 포함하고, M은 1보다 큰 정수임 -; 및 결과 이미지를 획득하기 위해 경계선의 M개의 픽셀 각각을 K 픽셀만큼 바깥쪽으로 확장 - K는 1 이상의 정수임 - 하도록 구성된다. 본 개시의 이 실시예는 결과 이미지를 생성하기 위한 다른 방법을 제공한다. 전술한 방식에서는 중간 필터링 처 리를 통해, 필터링된 이미지가 선명하고 이미지의 외곽선 및 가장자리와 같은 특징 정보의 손실 없이 바람직한 시각적 효과를 갖는다. 그런 다음, 결과 이미지의 정확도와 무결성을 향상시키기 위해, 형태학적 처리가 플러드 알고리즘에 기초하여 필터링된 이미지에 대해 수행된다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 획득 모듈은 또한, 원본 의료 이미지를 획득하고; 슬라이딩 윈도우를 이용하여 원본 의료 이미지로부터 의료 서브 이미지를 추출하고; 의료 서브 이미지가 병리 조직 영역을 포함하는 것으로 검출된 경우, 의료 서브 이미지를 처리 대상 의료 이미 지로 결정하며; 의료 서브 이미지가 병리 조직 영역을 포함하지 않는 것으로 검출된 경우, 의료 서브 이미지를 배경 이미지로 결정하고 배경 이미지를 제거하도록 구성된다. 본 개시의 이 실시예는 처리 대상 의료 이미지를 획득하기 위한 방법을 제공한다. 전술한 방식에서는 처리 대상 의료 이미지를 결정하기 위해, 의료 서브 이미지가 병리 조직 영역을 포함하는지 여부가 검출되고, 병리 조직을 포함하는 처리 대상 의료 이미지에 대응하는 결과 이미지가 전술한 단계들을 통해 획득될 수 있다. 결과 이미지 는 병리 조직 영역을 포함한다. 이는 결과 이미지에서 병리 조직 영역의 후속 처리 및 분석을 용이하게 한다. 병리 조직 영역을 포함하지 않는 의료 서브 이미지는 배경 이미지로 결정되고 배경 이미지는 제거되어, 자원 점 유를 줄인다. 선택적으로, 도 12에 대응하는 실시예에 기초하는, 본 개시에서 제공하는 의료 이미지 처리 장치의 다른 실시예에서, 이미지 처리 장치는 트레이닝 모듈을 더 포함한다.생성 모듈은 또한, 처리 대상 이미지와 처리 대상 이미지의 전경 영역에 따라 타깃 포지티브 샘플 이미지 를 생성하도록 구성되고 - 타깃 포지티브 샘플 이미지는 포지티브 샘플 세트의 포지티브 샘플 이미지이고, 각각 의 포지티브 샘플 이미지는 병리 조직 영역을 포함함 -; 획득 모듈은 또한, 네거티브 샘플 세트를 획득하도록 구성되며 - 네거티브 샘플 세트는 적어도 하나의 네 거티브 샘플 이미지를 포함하고, 각각의 네거티브 샘플 이미지는 병리 조직 영역을 포함하지 않음 -; 트레이닝 모듈은 포지티브 샘플 세트와 네거티브 샘플 세트에 기초하여 이미지 처리 모델을 트레이닝하도 록 구성된다. 본 개시의 이 실시예는 이미지 처리 모델을 트레이닝기 위한 방법을 제공한다. 전술한 방식에서는 이미지 처리 모델이 병리 조직 영역을 포함하는 포지티브 샘플 이미지 세트 및 병리 조직 영역을 포함하지 않는 네거티브 샘 플 세트에 기초하여 트레이닝 된다. 이는 이미지 처리 모델의 정확도와 신뢰성을 향상시켜, 이미지 처리 효율성 과 정확도를 향상시킨다. 본 개시의 이미지 처리 장치가 아래에서 상세하게 설명된다. 도 13은 본 개시의 일 실시예에 따른 이미지 처리 장치의 개략도이다. 이미지 처리 장치는 다음을 포함한다. 제1 처리 대상 이미지 및 제2 처리 대상 이미지를 획득하도록 구성된 획득 모듈 - 제1 처리 대상 이미지는 컬러 이미지고, 제1 처리 대상 이미지는 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터를 포함하 며, 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터는 각각 상이한 채널의 컬러 정보를 나타냄 -; 제1 이미지 데이터, 제2 이미지 데이터 및 제3 이미지 데이터에 따라 차분 이미지를 생성하도록 구성된 생성 모 듈; 이진화된 이미지를 획득하기 위해 차분 이미지에 대해 이진화 처리를 수행하도록 구성된 처리 모듈 - 이진 화된 이미지의 전경 영역은 처리 대상 의료 이미지의 타깃 객체에 대응함 -; 및 이진화된 이미지의 전경 영역에 따라 제1 처리 대상 이미지로부터 타깃 객체를 추출하도록 구성된 추출 모듈 . 생성 모듈은 또한, 타깃 객체 및 제2 처리 대상 이미지에 따라 합성된 이미지를 생성하도록 구성되고, 타 깃 객체는 제1 이미지 레이어 상에 있고, 제2 처리 대상 이미지는 제2 이미지 레이어 상에 있으며, 제1 이미지 레이어는 제2 이미지 레이어를 커버한다. 본 개시의 이 실시예에서, 이미지 처리 방법이 제공된다. 상이한 채널의 그레이 스케일 픽셀의 컬러 정보는 약 간 다르고, 상이한 채널의 컬러 픽셀의 컬러 정보는 크게 다르다. 따라서, 전술한 방식에서는 이미지에 대해 이 진화 처리를 수행하기 전에 상이한 채널의 컬러 정보에 기초하여 차분 이미지를 생성함으로써, 이미지의 컬러 정보를 효과적으로 사용한다. 차분 이미지에 기초하여 추출된 타깃 객체가 더 정확하다. 따라서, 타깃 객체의 레이어를 사용하여 제2 처리 대상 이미지의 레이어를 커버함으로써, 생성된 합성된 이미지의 타깃 객체가 정확 하므로, 합성된 이미지의 정확도를 향상시키고 후속 이미지 분석을 용이하게 한다. 도 14는 본 개시의 일 실시예에 따른 서버의 개략적인 구조도이다. 서버는 다른 구성 또는 성능으로 인해 크게 달라질 수 있고, 하나 이상의 중앙 처리 장치(central processing units, CPU)(예를 들어, 하나 이 상의 프로세서) 및 메모리 및 응용 프로그램 또는 데이터를 저장하는 하나 이상의 저장 매체 (예를 들어, 하나 이상의 대용량 저장 장치)를 포함할 수 있다. 메모리 및 저장 매체는 임시 저 장 또는 영구 저장일 수 있다. 저장 매체에 저장된 프로그램은 하나 이상의 모듈(도면에 표시되지 않음)을 포함할 수 있고, 각 모듈은 서버 상에서의 일련의 명령어 동작을 포함할 수 있다. 또한, CPU는 저장 매체 와 통신하고, 서버 상에서 저장 매체에서 일련의 명령어 동작을 수행하도록 설정될 수 있다. 서버는 하나 이상의 전원 공급 장치, 하나 이상의 유선 또는 무선 네트워크 인터페이스, 하나 이상의 입력/출력 인터페이스 및/또는 하나 이상의 운영 체제, 예를 들어 Windows ServerTM, Mac OS XTM, UnixTM, LinuxTM 또는 FreeBSDTM를 더 포함할 수 있다. 전술한 실시예에서 서버에 의해 수행되는 단계들은 도 14에 도시된 서버의 구조에 기초할 수 있다. 이 실시예에서, CPU는 도 2에 대응하는 실시예의 의료 이미지 처리 장치에 의해 수행되는 단계들을 수행하 도록 구성되고, CPU는 또한, 도 1에 대응하는 실시예의 이미지 처리 장치에 의해 수행되는 단계들을 수행하도록 구성된다. 당업자는 설명의 편의 및 간결함을 위해, 전술한 시스템, 장치 및 유닛의 특정 작업 프로세스에 대해 전술한 방 법 실시예의 해당 프로세스를 참조할 수 있음을 명확하게 이해할 수 있으며, 세부사항은 다음과 같고, 여기에 설명되어 있지 않는다. 본 개시에서 제공되는 몇몇 실시예에서, 개시된 시스템, 장치 및 방법은 다른 방식으로 구현될 수 있다. 예를 들어, 설명된 장치 실시예는 단지 예일뿐이다. 예를 들어, 단위 분할은 단순히 논리적 기능 분할이며 실제 구현 시 다른 분할이 될 수 있다. 예를 들어, 복수의 단위 또는 구성 요소가 다른 시스템에 결합 또는 통합되거나 일 부 기능이 생략되거나 수행되지 않을 수 있다. 또한, 표시되거나 논의된 상호 결합 또는 직접 결합 또는 통신 연결은 일부 인터페이스, 장치 또는 유닛을 통한 간접 결합 또는 통신 연결로서 구현될 수 있고, 전자적, 기계 적 또는 다른 형태로 구현될 수 있다. 별도의 부분으로 설명된 단위는 물리적으로 분리되거나 분리되지 않을 수 있으며, 단위로 표시된 부분은 물리적 단위일 수도 있고 아닐 수도 있고, 한 위치에 위치하거나 복수의 네트워크 단위에 분산될 수 있다. 유닛의 일부 또는 전부는 실시예의 솔루션의 목적을 달성하기 위해 실제 요구사항에 따라 선택될 수 있다. 또한, 본 발명의 실시예에서 기능 유닛은 하나의 처리 유닛으로 통합될 수 있거나, 각각의 유닛이 물리적으로 분리될 수 있거나, 또는 둘 이상의 유닛이 하나의 유닛으로 통합될 수 있다. 통합 유닛은 하드웨어의 형태로 구 현될 수도 있고, 소프트웨어 기능 유닛의 형태로 구현될 수도 있다. 통합 유닛이 소프트웨어 기능 유닛의 형태로 구현되어 독립적인 제품으로 판매되거나 사용되는 경우, 통합 유닛 은 컴퓨터가 읽을 수 있는 저장 매체에 저장될 수 있다. 이러한 이해에 기초하여, 본 발명의 기술적 솔루션은 본질적으로, 또는 종래 기술에 기여하는 부분, 또는 기술적 솔루션의 전부 또는 일부는 소프트웨어 제품의 형태 로 구현될 수 있다. 소프트웨어 제품은 저장 매체에 저장되며 컴퓨터 장치(개인용 컴퓨터, 서버, 네트워크 장치 등일 수 있음)에 본 발명의 실시예에 설명된 방법의 단계 전체 또는 일부를 수행하도록 지시하기 위한 여러 명 령을 포함한다. 전술한 저장 매체에는 USB 플래시 드라이브, 이동식 하드 디스크, 읽기 전용 메모리(읽기 전용 메모리, ROM), 랜덤 액세스 메모리(랜덤 액세스 메모리, RAM), 자기 디스크 또는 광 디스크와 같이 프로그램 코 드를 저장할 수 있는 모든 매체가 포함된다. 전술한 실시예는 본 개시의 기술적 솔루션을 제한하는 대신 설명을 위해 사용된다. 당업자는 본 개시가 전술한 실시예를 참조하여 상세하게 설명되었지만, 전술한 실시예에서 설명된 기술적 솔루션에 수정이 이루어질 수 있 거나, 일부 기술적 솔루션에 대해 동등한 대체가 이루어질 수 있음을 이해할 것이다. 단, 그러한 수정 또는 교 체로 인해 해당 기술 솔루션의 본질이 본 개시 내용의 실시예의 기술적 솔루션의 정신 및 범위를 벗어나지 않아 야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2022-7009792", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 출원의 실시예에 따른 의료 이미지 처리 시스템의 개략적인 구조도이다. 도 2는 본 개시의 일 실시예에 따른 의료 이미지 처리 방법의 개략도이다. 도 3은 본 개시의 일 실시예에 따른 처리 대상 의료 이미지의 개략도이다. 도 4는 본 개시의 일 실시예에 따른 차분 이미지의 개략도이다. 도 5는 본 개시의 일 실시예에 따른 이진화된 이미지의 개략도이다. 도 6은 본 개시의 일 실시예에 따른 결과 이미지의 개략도이다. 도 7은 본 개시의 다른 실시예에 따른 결과 이미지의 개략도이다. 도 8은 본 개시의 일 실시예에 따른 처리 대상 의료 이미지를 획득하는 개략도이다. 도 9는 본 개시의 일 실시예에 따른 의료 이미지 처리 방법의 개략적인 흐름도이다. 도 10은 본 개시의 일 실시예에 따른 결과 이미지의 개략도이다. 도 11은 본 개시의 일 실시예에 따른 이미지 처리 방법의 개략도이다. 도 12는 본 개시의 일 실시예에 따른 의료 이미지 처리 장치의 개략도이다. 도 13은 본 개시의 일 실시예에 따른 이미지 처리 장치의 개략도이다.도 14는 본 개시의 일 실시예에 따른 서버의 개략적인 구조도이다."}
