{"patent_id": "10-2024-7021739", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0115882", "출원번호": "10-2024-7021739", "발명의 명칭": "인공 지능을 이용한 충치 진단", "출원인": "디지털 다이그노스틱스 인코포레이티드", "발명자": "아브라모프, 마이클, 디."}}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "치아 상태를 진단하는 방법에 있어서,치아를 스캔하는 하드웨어 디바이스로부터 획득된 데이터에 기초하여 환자의 상기 치아를 표현하는 이미지 데이터를 캡처하는 단계;상기 이미지 데이터를 제1 지도 기계 학습 모델에 입력하는 단계;상기 제1 지도 기계 학습 모델로부터 출력으로서, 복수의 바이오마커를 수신하는 단계 - 각각의 바이오마커는상기 치아의 상이한 위치에 대응함 -;상기 복수의 바이오마커를 제2 지도 기계 학습 모델에 입력하는 단계; 및상기 제2 지도 기계 학습 모델로부터 출력으로서, 치아 상태에 대한 진단을 수신하는 단계를 포함하는, 치아 상태를 진단하는 방법."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 치아를 스캔하는 상기 하드웨어 디바이스로부터 획득된 데이터는 심층 침투 광 간섭 단층촬영(DPOCT: deep penetration optical coherence tomography) 데이터를 포함하고, 상기 이미지 데이터는 상기DPOCT 데이터에 기초하여 상기 치아의 하나 이상의 광학 속성을 반영하는 세기 맵을 포함하는, 치아 상태를 진단하는 방법."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제1 지도 기계 학습 모델은 상기 세기 맵 내의 영역들 사이의 세기의 변화를 검출하고,세기의 상기 변화에 기초하여 상기 치아의 각각의 상이한 위치에 대한 개개의 분류를 출력하도록 훈련되고, 각각의 개별 분류는 바이오마커를 형성하는, 치아 상태를 진단하는 방법."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 제1 지도 기계 학습 모델은 상기 치아의 컬러 이미지를 추가로 입력받고, 상기 제1 지도기계 학습 모델은 상기 이미지 및 상기 세기 맵 둘 모두에 기초하여 바이오마커를 출력하도록 추가로 훈련되고,상기 제1 지도 기계 학습 모델의 출력은 상기 컬러 이미지로부터 컬러 데이터를 제외하는, 치아 상태를 진단하는 방법."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 치아의 이력 바이오마커에 액세스하는 단계를 더 포함하고, 상기 이력 바이오마커는 상기복수의 바이오마커와 함께 상기 제2 지도 기계 학습 모델에 입력되고, 상기 제2 지도 기계 학습 모델은 상기 이력 바이오마커 및 상기 복수의 바이오마커 둘 모두에 기초하여 상기 진단을 출력하는, 치아 상태를 진단하는 방법."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 복수의 바이오마커와 상기 이력 바이오마커를 상기 제2 지도 기계 학습 모델에 입력하는단계는 상기 이력 바이오마커에 대한 상기 복수의 바이오마커의 각각의 바이오마커에 대한 세기 차이를 계산하는 단계 및 각각의 세기 차이를 상기 제2 지도 기계 학습 모델에 입력하는 단계를 포함하는, 치아 상태를 진단하는 방법."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 제2 지도 기계 학습 모델로부터 출력으로서 상기 치아 상태의 진단을 수신하는 단계는 복공개특허 10-2024-0115882-3-수의 진단을 수신하는 단계를 포함하고, 상기 복수의 진단의 각각의 진단은 상기 복수의 바이오마커 중 상이한바이오마커에 대응하는, 치아 상태를 진단하는 방법."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "치아 상태를 진단하기 위해 인코딩된 명령어를 갖는 메모리를 포함하는 비일시적 컴퓨터 판독가능 매체로서, 상기 명령어는, 실행될 때, 하나 이상의 프로세서로 하여금 동작을 수행하게 하고, 상기 명령어는,치아를 스캔하는 하드웨어 디바이스로부터 획득된 데이터에 기초하여 환자의 상기 치아를 표현하는 이미지 데이터를 캡처하고;상기 이미지 데이터를 제1 지도 기계 학습 모델에 입력하고;상기 제1 지도 기계 학습 모델로부터 출력으로서, 복수의 바이오마커를 수신하고 - 각각의 바이오마커는 상기치아의 상이한 위치에 대응함-;상기 복수의 바이오마커를 제2 지도 기계 학습 모델에 입력하고; 및상기 제2 지도 기계 학습 모델로부터 출력으로서, 치아 상태의 진단을 수신하는 명령어를 포함하는, 비일시적컴퓨터 판독가능 매체."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 치아를 스캔하는 하드웨어 디바이스로부터 획득된 데이터는 심층 침투 광 간섭 단층촬영(DPOCT) 데이터를 포함하고, 상기 이미지 데이터는 상기 DPOCT 데이터에 기초하여 상기 치아의 하나 이상의 광학 속성을 반영하는 세기 맵을 포함하는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 제1 지도 기계 학습 모델은 상기 세기 맵 내의 영역들 사이의 세기의 변화를 검출하고,상기 세기의 변화에 기초하여 상기 치아의 각각의 상이한 위치에 대한 개개의 분류를 출력하도록 훈련되고, 각각의 개별 분류는 바이오마커를 형성하는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 제1 지도 기계 학습 모델은 상기 치아의 컬러 이미지를 추가로 입력받고, 상기 제1 지도기계 학습 모델은 상기 이미지 및 상기 세기 맵 둘 모두에 기초하여 바이오마커를 출력하도록 추가로 훈련되고,상기 제1 기계 학습 모델의 출력은 상기 컬러 이미지로부터 컬러 데이터를 제외하는, 비일시적 컴퓨터 판독가능매체."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 치아의 이력 바이오마커에 액세스하는 단계를 더 포함하고, 상기 이력 바이오마커는 상기복수의 바이오마커와 함께 상기 제2 지도 기계 학습 모델에 입력되고, 상기 제2 지도 기계 학습 모델은 상기 이력 바이오마커 및 상기 복수의 바이오마커 둘 모두에 기초하여 상기 진단을 출력하는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 복수의 바이오마커와 상기 이력 바이오마커를 상기 제2 지도 기계 학습 모델에 입력하기위한 명령어는, 상기 이력 바이오마커에 대한 상기 복수의 바이오마커의 각각의 바이오마커에 대한 세기 차이를계산하고, 각각의 세기 차이를 상기 제2 지도 기계 학습 모델에 입력하기 위한 명령어를 포함하는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서, 상기 제2 지도 기계 학습 모델로부터 출력으로서, 상기 치아 상태의 진단을 수신하기 위한 명령어는 복수의 진단을 수신하기 위한 명령어를 포함하고, 상기 복수의 진단의 각각의 진단은 상기 복수의 바이오마커 중 상이한 바이오마커에 대응하는, 비일시적 컴퓨터 판독가능 매체.공개특허 10-2024-0115882-4-청구항 15 시스템으로서,치아 상태를 진단하기 위한 명령어가 인코딩된 메모리; 및상기 명령어를 실행할 때, 동작을 수행하게 되는 하나 이상의 프로세서를 포함하고, 상기 동작은,치아를 스캔하는 하드웨어 디바이스로부터 획득된 데이터에 기초하여 환자의 상기 치아를 표현하는 이미지 데이터를 캡처하는 동작;상기 이미지 데이터를 제1 지도 기계 학습 모델에 입력하는 동작;상기 제1 지도 기계 학습 모델로부터 출력으로서, 복수의 바이오마커를 수신하는 동작 - 각각의 바이오마커는상기 치아의 상이한 위치에 대응함 -;상기 복수의 바이오마커를 제2 지도 기계 학습 모델에 입력하는 동작; 및상기 제2 지도 기계 학습 모델로부터 출력으로서, 치아 상태에 대한 진단을 수신하는 동작을 포함하는, 시스템."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 치아를 스캔하는 상기 하드웨어 디바이스로부터 획득된 상기 데이터는 심층 침투 광 간섭 단층촬영(DPOCT) 데이터를 포함하고, 상기 이미지 데이터는 상기 DPOCT 데이터에 기초하여 상기 치아의 하나이상의 광학 속성을 반영하는 세기 맵을 포함하는, 시스템."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 제1 지도 기계 학습 모델은 상기 세기 맵 내의 영역들 사이의 세기의 변화를 검출하고,상기 세기의 변화에 기초하여 상기 치아의 각각의 상이한 위치에 대한 개개의 분류를 출력하도록 훈련되고, 각각의 분류는 바이오마커를 형성하는, 시스템."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 제1 지도 기계 학습 모델은 상기 치아의 컬러 이미지를 추가로 입력받고, 상기 제1 지도기계 학습 모델은 상기 이미지 및 상기 세기 맵 둘 모두에 기초하여 바이오마커를 출력하도록 추가로 훈련되고,상기 제1 기계 학습 모델의 출력은 상기 컬러 이미지로부터 컬러 데이터를 제외하는, 시스템."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서, 상기 동작은 상기 치아의 이력 바이오마커에 액세스하는 단계를 더 포함하고, 상기 이력 바이오마커는 상기 복수의 바이오마커와 함께 상기 제2 지도 기계 학습 모델에 입력되고, 상기 제2 지도 기계 학습모델은 상기 이력 바이오마커 및 상기 복수의 바이오마커 둘 모두에 기초하여 상기 진단을 출력하는, 시스템."}
{"patent_id": "10-2024-7021739", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 복수의 바이오마커와 상기 이력 바이오마커를 상기 제2 지도 기계 학습 모델에 입력하는동작은 상기 이력 바이오마커에 대한 상기 복수의 바이오마커의 각각의 바이오마커에 대한 세기 차이를 계산하는 단계 및 각각의 세기 차이를 상기 제2 지도 기계 학습 모델에 입력하는 단계를 포함하는, 시스템."}
{"patent_id": "10-2024-7021739", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "치아 상태 진단을 위한 디바이스가 개시된다. 디바이스는 치아를 스캔하는 하드웨어 디바이스로부터 획득된 데이 터에 기초하여 환자의 치아를 표현하는 이미지 데이터를 캡처한다. 디바이스는 이미지 데이터를 제1 지도 기계 학습 모델에 입력하고, 제1 지도 기계 학습 모델로부터 출력으로서, 복수의 바이오마커를 수신하며, 각각의 바이 오마커는 치아의 상이한 위치에 대응한다. 디바이스는 복수의 바이오마커를 제2 지도 기계 학습 모델에 입력하고, 제2 지도 기계 학습 모델로부터 출력으로서, 치아 상태의 진단을 수신한다."}
{"patent_id": "10-2024-7021739", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "관련 출원의 교차 참조 본 출원은 2021년 12월 17일자로 출원된 미국 임시 출원 제63/291,216호의 이익을 주장한다. 이의 내용은 그 전 체가 본원에 원용되어 포함된다."}
{"patent_id": "10-2024-7021739", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "배경기술 충치(치아 우식증)의 위험은 사회 전반에 만연해 있으며, 특히 탄수화물과 초가공 식품이 풍부한 식단때문에 모 든 인간은 충치의 위험에 노출된다. 충치는 장애와 고통, 의료비의 주요 원인이다. 충치를 멈추고 되돌리기 위 한 효과적인 치료법이 존재하며, 특히 충치가 아직 증상이 없는 초기 단계에서 발생하는 경우에 그렇다. 그러나 치과 의사의 치아 검진을 치료의 표준으로 삼는 조기 진단을 준수하는 것은 차선책이며, 이는 불필요하게 치아 질환을 진행시키는 결과를 낳는다. 치과 의사에 의한 표준 치료 치아 검진 및 추가적으로 X선은 충치의 조기 진 단에 효과적이지만, 이를 확장시키는 것은 고도로 숙련된 전문가(즉, 치과 의사) 또는 고도로 숙련된 X선 기술 자의 필요성 및 부족, 상태마다 매우 다양한 요건, 뿐만 아니라 장기적으로 건강에 영향을 미칠 수 있는 X선에 대한 노출, 일부 형태의 원격의료를 통한 전문가에 의한 평가의 필요성, 이로 인해 상대적으로 높은 비용이 초 래되고 접근성을 감소시키기 때문에 도전적인 일이다. 따라서, a) X선을 필요로 하지 않고, b) 이미지를 평가하는 전문가가 필요 없는 자율적인 치아 스크리닝 인공 지능(AI) 기술은 접근성을 높이고, 비용을 낮추어 영구적인 장애 및 비용을 방지하는 데 매우 유리하다. 구체적 으로, 심층 침투 광 간섭 단층촬영(DPOCT: deep penetration optical coherence tomography)는 어금니를 포함 한 치아 엘리먼트에 최대 4 내지 5 mm까지 침투하기 위해, 낮은 간섭성 광의 간섭도를 기반으로 하는, 방사선이 없는 광학 기술이며, 이는 모든 겉면(face) 상의 임의의 구멍(cavity)을 포함하여, 각 엘리먼트의 모든 겉면이 이미징될 수 있게 한다. 특히, 60%의 구멍이 발생하고 육안 검사가 불가능한 두 엘리먼트 사이의 이른바 근위간 구멍을 이미징할 수 있게 하고, 자율 AI는 다중 평면(multiplanar) DPOCT 이미지에서 구멍을 실시간, 현장 진단 할 수 있게 하는 기술이다. DPOCT는 치아 전체, 특히 더 큰 어금니를 침투하지 않을 수 있으므로, 각각의 액세스 가능한 표면의 이미징이 필요할 수 있다. 이는 낮은 간섭성 광으로 조명하고, 간섭 이미지를 계산하는 DPOCT 디바이스 - 전체 엘리먼트 의 고속 스캐닝을 허용하는 소위 스위프 소스(swept source) 또는 도메인 OCT 간섭계에서 각각의 평면에 대한 미켈슨 간섭계 접근법을 사용함 -에 반사된 낮은 간섭성 광을 수집하기 위해, 3개 이상의 평행 광섬유를 통해 적어도 한 행의 어금니의 겉면, 설측 및 교합 표면(occlusional surface)을 커버하는 작은 프로브 또는 다수의 프로브를 사용하는 다중 평면 DPOCT를 통해 달성될 수 있다. 이는 프로브와 동축으로 이들 3개의 평면으로부터 하나 이상의 B-스캔(2차원 스캔)을 획득하고, 프로브가 수동으로 또는 서보로, 앞뒤로 전진할 때 다중 평면 3D PDOCT 볼륨이 수집된다. 일 예에서, 프로브는 다른 3개의 행의 어금니에 적용되어, 환자의 모든 어금니 엘리먼 트의 다차원 이미징을 완료한다. 자율 AI는 다차원 DPOCT 볼륨을 입력으로서 가지며, 볼륨 내의 구멍의 가능도(likelihood), 진단상 이분지 (dichotomous) 또는 다단계(multilevel) 존재 또는 부재, 또는 심각도를 출력한다. 다른 진단적으로 관련된 출 력이 또한 수행될 수 있다. AI는 융합 스테이지를 갖는 하이브리드, 부분적으로 독립적인 바이오마커 다중 검출 기 AI로서, 또는 딥 러닝, 쉘로우(shallow) 러닝, 재귀적 네트워크(모두 당업자에 공지됨), 또는 이러한 AI 설 계의 임의의 조합을 사용하는 다중 이미지 기반 컨볼루션 신경망으로서 구축될 수 있다. 이러한 방식의 예시적 인 AI는 2018년 10월 30일에 발행된 공동 소유 미국 특허 제10,115,194호에 더 상세히 개시되며, 본 개시내용은 그 전체가 본원에 원용되어 포함된다. 비지도 전이 학습을 포함하는 증강 및 전이 학습 접근법도 사용될 수 있 다. 구멍의 존재, 부재 또는 위치, 또는 가능도 또는 확률로 라벨링된 DPOCT 훈련 이미지는 이러한 AI 시스템을 훈련하는 데 사용될 수 있거나, 다중 검출기 기반 접근법의 경우, 라벨링된 이미지 샘플이 검출기를 훈련하는 데 사용될 수 있거나, 바이오마커의 수학적 설명이 상기 검출기를 설계하는 데 사용될 수 있다. DPOCT는 단지 예시적인 것이며, DPOCT와 관련하여 본원에 설명된 기능을 캡처하는 임의의 다른 형태의 이미징은(예를 들어, 저 간섭성 광, 사운드, 진동, 또는 간섭계 간섭 기술을 사용하는 임의의 다른 파형 생성 기술을 사용하여) DPOCT 또는 임의의 다른 이미징 기술이 언급되는 곳마다 동일하게 적용된다. 더욱이, 임의의 저 간섭 단층 촬영 (LCT: low coherence tomography) 기술은 또한 자외선, 적외선, 치아 침투(dental penetration) 또는 심층 침 투 광학 간섭 단층 촬영, 마이크로파, 광 가시광 LCT, 초음파 이미징 기술 등을 포함하는 DPOCT가 본원에서 언 급되는 모든 곳에서 동일하게 적용된다."}
{"patent_id": "10-2024-7021739", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "(a) 개요 도 1은 충치 결정 툴을 구현하기 위한 시스템 환경의 일 실시형태를 예시한다. 도 1에 도시된 바와 같이, 환경 은 이미징 장치, 네트워크, 충치 결정 툴, 및 환자 데이터를 포함한다. 환경의 엘리먼트는 단지 예시적인 것이며, 본원에 개시된 기능을 달성하기 위해 더 적거나 더 많은 엘리먼트가 환경 에 통합될 수 있다. 이미징 장치는 환자의 치아의 이미지를 캡처하는 임의의 장치일 수 있다. 이미징 장치는 카메라 센서, DPOCT 센서, 및 치아 물질 및 충치의 표시를 캡처할 수 있는 임의의 다른 장파 센서를 포함할 수 있다. 이미징 장치는 환자에 관한 크리덴셜(credential) 및 다른 정보를 수용할 수 있다. 이들은 기술자에 의한 사용자 인터페이스를 통해 입력되거나, 환자에 의해 직접 입력될 수 있다. 즉, 이미징 장치는 환자에 대한 데이터를 입력하기 위한 키보드 또는 터치스크린 인터페이스를 포함할 수 있고, 이미지를 캡처하는 하나 이상의 이미징 컴포넌트를 추가로 포함할 수 있다. 이미징 컴포넌트는 임의의 공지된 이미징 컴포넌트(예를 들어, 기술 자에 의해 치아 위 및 주위에서 활주될 슬라이더)일 수 있다. 이미징 장치는 충치 결정 툴에 의해 제 어되거나 다른 방식으로 분포되는 실행 소프트웨어에 기초하여 이미지를 캡처하고 환자 정보를 프롬프트할 수 있다. 이미징 장치는 비X선 기술을 사용하기 때문에, X선 장비를 동작시키는 라이센스 없는 사람(예를 들 어, 최소 훈련 및 고등학교 교육을 받은 기술자)에 의해 동작가능하고, 따라서 충치 검출의 확장을 가능하게 한 다. 이미징 장치는 DPOCT 센서 외에 다중 평면 OCT 기술을 사용할 수 있다. 예를 들어, DPOCT가 일부 치아를 완전히 침투할 수 없기 때문에, DPOCT가 캡처할 수 없는 충치를 보여주는 이미지를 캡처하기 위해 다중 평면 OCT가 사용될 수 있다. 이미징 장치는 캡처 이미지(예를 들어, 2D 이미지)을 동시에 또는 연속적으로 측정 하고, 이 이미지를 치아의 임의의 주어진 지점에서 충치(또는 이의 결여)를 표현하는 임의의 파라미터의 3D 또 는 다른 멀티볼륨 측정으로 변환하기 위해 다중 평면 OCT를 사용할 수 있다. 본원에 개시된 AI는 이러한 방식으 로 캡처된 다수의 3D 볼륨 또는 다른 멀티볼륨을 함께 프로세싱할 수 있다. 예를 들어, 다수의 치아 또는 치아 의 다수의 섹션이 함께 스캐닝되는 경우, 3D 또는 다른 멀티볼륨 이미지가 이 다수의 치아 및/또는 다수의 섹션 에 대해 캡처될 수 있고, 인접한 볼륨에서의 정보가 서로를 제약할 수 있다는 점을 고려하면(예를 들어, 교합에 의해) 서로를 고려하여 프로세싱될 수 있다. 네트워크는 클라이언트 디바이스와 치료 결정 툴 사이의 데이터 통신을 전송할 수 있는 임의의 데이터 네트워크일 수 있다. 네트워크는 예를 들어, 인터넷, 근거리 네트워크, 광역 네트워크, 또는 임의 의 다른 네트워크일 수 있다. 충치 결정 툴은 이미징 장치로부터 이미지를 수신하고 프로세싱한다. 충치 결정 툴은 또한 이미 징 장치로부터 다른 환자 정보를 수신할 수 있고, 환자에 관한 환자 데이터로부터 정보를 검색할 수 있다. 수신된 일부 또는 모든 정보에 기초하여, 충치 결정 툴은 환자의 상태를 출력할 수 있다. 충치 결정 툴의 동작의 추가적인 세부사항은 도 2를 참조하여 아래에서 논의된다. 치료 결정 툴의 동작은(예를 들어, 이미징 장치 상에 인스톨된 애플리케이션을 통해 또는 브라우저를 통해 이미징 장치에 의해 액 세스되는) 이미징 장치 상에서 전체적으로 또는 부분적으로 인스턴스화될 수 있다. 환자 데이터는 하나 이상의 환자의 데이터의 기록을 저장하는 데이터베이스이다. 환자 데이터는 병원 기록, 환자의 개인 기록, 의사 노트 등일 수 있다. 환자 데이터는 이미징 장치 및/또는 충치 결정 툴 에 공존할 수 있다. 예시적인 실시형태에서, 환자 데이터는 환자에 관한 프로파일 정보(예를 들어, 연령, 성별, 인종 등), 환자의 치아의 이미징 장치에 의해 캡처된 이전 이미지(있는 경우), 및 충치 결정 툴에 의해 검출된 이전 상태(있는 경우)를 포함한다. 환자 데이터는 치과 진료실과 통합될 수 있으며, 여기서 치과 의사는 충치 결정 툴에 의해 식별된 상태에 의해 촉진된 방문 시, 개입(예를 들어, 구멍 충진) 또는 개입이 필요하지 않다는 결정(예를 들어, 거짓 양성)을 표시할 수 있다. 환자 데이터는 환자의 치아의 이미지가 시간에 따라 캡처됨에 따라 충치의 진행을 검출하기 위한 베이스라인(baseline)으로서 사용될 수 있다. 환자 데이터는 충치 결정 툴에 의해 사용되는 기계 학습 모델을 재훈련하기 위해(예 를 들어, 치과 의사에 의해 거짓 양성이 표시되는 충치 상태에 대응하지 않음을 나타내는 훈련 데이터를 재라벨 링하기 위해) 사용될 수 있다. 일 실시형태에서, 환자 데이터의 사용은 선택적이다(예를 들어, 환자 데이 터는 AI 모델의 정확도 또는 다른 성능을 감소시키는 노이즈를 포함할 수 있다). 도 2는 치아 상태를 출력하기 위해 인공 지능을 사용하는 데 있어서 충치 결정 툴에 의해 사용되는 예시적인 모 듈 및 데이터베이스의 일 실시형태를 예시한다. 도 2에 도시된 바와 같이, 충치 결정 툴은 이미지 캡처 모 듈, 충치 결정 모듈, 및 이미지 전처리 모듈뿐만 아니라 기계 학습 모델들을 포함한다. 도 2에 도시된 모듈 및 데이터베이스는 단지 예시적인 것이며, 충치 결정 툴은 더 많거나 더 적은 모듈 및/또 는 데이터베이스를 포함할 수 있고 여전히 본원에 설명된 기능을 달성할 수 있다. 더욱이, 치료 결정 툴의 모듈 및/또는 데이터베이스는 클라이언트 디바이스 및/또는 하나 이상의 서버 상에서 전체적으로 또는 부 분적으로 인스턴스화될 수 있다. 이미지 캡처 모듈은 이미징 장치로 하여금 정보를 캡처하고 해당 정보를 충치 결정 툴 및/또는 환자 데이터 데이터베이스에 전송하게 하는 것과 관련된 활동을 수행한다. 이 활동은 이미징 장치에 (예를 들어, 로컬에 인스톨된 애플리케이션을 통해 또는 원격 명령어를 통해) 환자의 치아의 이미지를 캡처하고 이를 프로세싱하기 위해 이미지 캡처 모듈에 전송하도록 지시하는 것을 포함할 수 있다. 이미지를 수신한 것에 응답하여, 이미지 캡처 모듈은(예를 들어, 이미지 전처리 모듈을 사용하여) 이미지에 대한 전처 리를 선택적으로 수행할 수 있다. 전처리는 이미지 최적화, 아티팩트 제거, 이미지가 하나 이상의 프로토콜을 부합하는지 확인(예를 들어, 이미지가 표시되어야 하는 특정 치아를 보여줌) 등을 포함할 수 있다. 일 실시형태에서, 이미지 캡처 모듈은 기술자에게 특정 활동을 수행하도록 프롬프트한다. 예를 들어, 기술 자는 이미지 캡처 모듈에 의해 특정 치아, 잇몸 영역의 이미지를 캡처하고, 특정 각도에서 이미지를 캡처 하기 위해 기구를 슬라이드하고, 이미지 캡처 디바이스의 임의의 다른 조작을 프롬프트받을 수 있다. 이 프롬프 트에 대응하는 동작 동안 캡처된 이미지는 이미지가 프로토콜에 부합하는지 검증하는 전처리 프로토콜을 통해 검증될 수 있고, 이 이미지가 프로토콜에 부합하지 않는 것에 응답하여, 이미지 캡처 모듈은 기술자에게 이러한 이미지를 재캡처하도록 프롬프트할 수 있다. 충치 결정 모듈은 캡처된 이미지에 기초하여, 환자의 하나 이상의 상태를 결정한다. 일 실시형태에서, 충 치 결정 모듈은 상태를 환자가 충치를 가질 수 있는지 여부의 이진 결정으로 결정한다. 즉, 충치 결정 모 듈의 출력은 환자가 충치를 가질 수 있고 따라서 치과 진료를 받아야 한다는 것, 또는 환자가 충치를 갖지 않고 따라서 치과 진료를 받을 필요가 없다는 것이다. 다른 실시형태에서, 충치 결정 모듈은 진단을 출력 할 수 있다(예를 들어, 우측 상단 사분 앞니에 에나멜을 통과한 부식이 있음). 추가적으로 또는 대안적으로, 충 치 결정 모듈은 치료 방법을 출력할 수 있다(예를 들어, 우측 상단 사분 앞니 상에 충진이 필요함). 추가 적으로 또는 대안적으로, 충치 결정 모듈은 임계 시간 기간 내에 심각해질 가능도(예를 들어, 지금 충진을 필요로 하지만 1개월 내에 근관 치료(root canal)를 필요로 함)에 기초하여, 위험의 긴급성(예를 들어, 이진 \" 긴급\" 또는 \"긴급하지 않음\", 긴급성에 비례하여 증가하는 1 내지 10의 단계별 등급, 또는 임의의 다른 표현 수 단)을 출력할 수 있다. 추가적으로 또는 대안적으로, 충치 결정 모듈은 충치에 의해 야기되는 임의의 위험 (예를 들어, 충치가 치료되지 않으면 잇몸 질환)의 표시를 출력할 수 있다. 충치 결정 모듈은 기계 학습을 사용하여 이러한 결정을 수행할 수 있다. 일 실시형태에서, 하나 이상의 장 파 이미지(예를 들어, DPOCT 이미지)는 이미지 캡처 모듈에 의해 획득되고 충치 결정 모듈에 의해 기 계 학습 모델에 입력된다. 기계 학습 모델은 하나 이상의 상태로 이미지를 라벨링하는 훈련 데이터를 사용하여 훈련된다(예를 들어, 훈련 이미지는 치과 진료가 필요한지 여부, 특정 진단이 존재하는지 여부, 긴급성, 특정 치료가 필요한지 여부, 위험 등의 표시로 라벨링된다). 기계 학습 모델은 신경망(예를 들어, 컨볼루션 신경망), 딥 러닝 네트워크, 또는 임의의 다른 유형의 기계 학습 모델일 수 있다. 기계 학습 모델은 환자의 이미지와 쌍 을 이루는 환자의 프로파일 정보와 같은 다른 보조 데이터로 훈련될 수 있고, 장파 이미지에 추가하여, 주어진환자의 프로파일 데이터를 입력으로서 수용할 수 있다. 치아 표면, 잇몸 표면 등을 보여주는 광학 이미지는 기 계 학습 모델 또는 이의 부분(예를 들어, 치아의 경계 다각형)에 대한 입력으로서 추가로 사용될 수 있다. 단일 모델 방법은 정확할 수 있지만 편향(bias)이 허용될 수 있다. 예를 들어, 캡처된 이미지가 잇몸 색소를 포 함하는 경우, 잇몸 색소는 특정 상태를 결정하기 위해 모델을 훈련하기 위한 기초를 형성할 수 있다. 이를 위해, 두 개의 기계 학습 모델이 사용될 수 있다. 제1 기계 학습 모델은 이미지를 입력으로서 수용할 수 있고, 치아가 특정 특징(예를 들어, 부식, 염색, 이전 충진 또는 실란트 또는 다른 치과 작업 등), 또는 이미지의 일 부 다른 표현(예를 들어, 이미지의 각각의 위치에서의 세기)을 포함하는 치아의 각각의 영역에 대한 가능도를 출력할 수 있다. 제2 기계 학습 모델은 주어진 치아 또는 치아 세트에 대한 가능도(또는 다른 표현)의 벡터를 입력으로서 취하고, 이 벡터에 기초하여 상태를 출력하도록 훈련될 수 있다. 이것은 원하지 않는 요인이 상태 결정을 편향시키는 위험을 제거한다. 일 실시형태에서, 가능도의 벡터는 치주 조직의 가시광 이미징과 같은 보 조 정보로 보충될 수 있다. 일 실시형태에서, 환자 데이터는 장파 이미지와 함께 모델에 입력될 수 있다. 예를 들어, 이전 이미징으로 부터의 베이스라인 이미지가 입력될 수 있거나, 베이스라인 이미지와 새로운 이미지 사이의 델타를 이미지 프로 세싱을 사용하여 식별하는 데 사용될 수 있다. 델타는 질병 상태를 출력하기 위해 기계 학습 모델(들)에 입력될 수 있다. 기계 학습 모델은 상이한 시간에 동일한 치아의 이력 데이터를 사용하여 훈련될 수 있으며, 여기서 주 어진 바이오마커에 대한 시간에 따른 세기 차이는 상태의 심각도(예를 들어, 구멍 악화 또는 좋아짐; 착색 악화 등)를 나타내도록 라벨링된다. 도 3은 치료 결정 툴의 충치 결정 모듈에 의해 사용되는 서브 모듈의 추가 세부사항의 일 실시형태를 도시한다. 도 3에 도시된 바와 같이, 충치 결정 모듈의 서브 모듈은 DPOCT 추상화 모듈, 세기 맵 모듈, 바 이오마커 결정 모듈, 및 충치 진단 모듈을 포함할 수 있다. 본원에 설명된 기능을 달성하기 위해 더 적거나 더 많은 모듈이 사용될 수 있다. 전술한 바와 같이, 일 실시형태에서, 충치 결정 모듈은 기계 학습 모델에 이미지를 입력한다. 그러나, 추 가적으로 또는 의도적으로, DPOCT 이미지의 하나 이상의 추상화가 기계 학습 모델에 입력될 수 있다. 본원에 설 명된 바와 같이, 추상화는 이미지의 표현을 지칭할 수 있다. 예를 들어, DPOCT 이미지는 다양한 세기의 픽셀을 포함할 수 있다. 추상화는 이미지의 각 영역에서 이웃하는 픽셀 사이의 세기 차이의 델타를 포함할 수 있고, 세 기 차이는 기계 학습 모델에 입력될 수 있다. 일 실시형태에서, DPOCT 추상화 모듈은 그러한 영역에 이웃 하는 픽셀에 대한 적어도 임계 세기 차이(예를 들어, 평균 세기 차이 또는 중간 세기 차이)가 있는 영역을 결정 할 수 있고, 기계 학습 모델에 대한 입력으로서 그러한 영역의 맵을 사용할 수 있다. 실측 훈련 데이터는 추상 화를 라벨링하는 임의의 형태의 추상화에 대해 존재할 수 있다. 단일 기계 학습 모델이 사용되는 실시형태에서, 훈련 데이터는 추상화에 대응하는 충치 진단의 라벨을 포함할 수 있다. 이미지가 제1 기계 학습 모델에 입력되 는 실시형태에서, 추상화는 임의의 전술된 출력 분류에 대한 실측으로 라벨링될 수 있다. 세기 맵 모듈은 이미지(예를 들어, DPOCT 이미지)에 대한 하나 이상의 세기 맵을 생성할 수 있다. 세기 맵 은, 주어진 속성(예를 들어, 반사도, 굴절도, 휘도)에 대해, 이미지의 각각의 픽셀에서의 세기를 나타낼 수 있 다. 이러한 세기 맵은 임의의 목적을 위해(예를 들어, 세기 차이의 추상화를 위해, 기계 학습 모델로의 직접 입 력을 위해 등) 사용될 수 있다. 일반적으로, 건강한 치아 재료는 DPOCT 스캔의 많은 부분을 흡수하지 않지만; 충치 또는 다른 작업(예를 들어, 충치 충진)은 상대적으로 더 많이 흡수하고 더 높은 세기를 가질 수 있다. 따 라서, 세기 맵에 대한 실측 데이터 라벨링 분류(예를 들어, 부식, 착색, 이전 충진)는 기계 학습 모델이 세기 맵에 기초하여 분류를 출력할 수 있게 한다. 일 실시형태에서, 세기 맵 모듈은 환자 데이터로부터의 이전 이미지와 현재 이미지의 세기 사이의 세 기의 델타(예를 들어, 동일한 치아의 이전 이미지에 대한 현재 이미지의 세기의 차이)를 사용하여 세기 맵을 결 정할 수 있다. 충치 결정 모듈은 전체 컬러 이미지, DPOCT 이미지, 및 임의의 언급된 추상화 중 임의의 것을, 단독으로 또는 함께, 진단을 직접 출력하도록 훈련되거나, 또는 특정 특징을 포함하는 치아의 영역에 대한 가능도를 출력 하도록 훈련된 기계 학습 모델에 입력할 수 있다. 기계 학습 모델이 이들 입력 중 둘 이상을 함께 취하도록 훈 련되는 경우, 각각의 입력 유형의 실측 데이터는 관련 분류를 최상으로 결정하기 위해 활용된다. 일 실시형태에서, 바이오마커 결정 모듈은 세기 차이를 나타내는 세기 맵 및/또는 추상화에 경험적 기법 (heuristics)을 적용하고, 경험적 기법은 영역의 크기에 대한 파라미터 및/또는 바이오마커로 분류될 영역에 대한 세기 변화를 특정한다. 이러한 바이오마커는 바이오마커에 기초하여 진단을 출력하는 단일 기계 학습 모델에 입력될 수 있다. 2개의 기계 학습 모델이 사용되는 실시형태에서, 제1 기계 학습 모델은 세기 맵으로부터 세기 의 변화를 검출하고, 세기의 변화에 기초하여 치아 내의 각각의 위치에 대한 개개의 분류를 출력하도록 훈련될 수 있다. 바이오마커 결정 모듈은 분류 및 선택적으로 다른 경험적 기법(예를 들어, 위치의 크기)로부터, 주어진 세기 변화를 갖는 각각의 영역이 특정 유형의 바이오마커(예를 들어, 구멍, 사전 충진 등)를 형성할 가 능도를 결정할 수 있다. 바이오마커 결정 모듈은 이들 가능도를 환자 데이터로부터의(예를 들어, 동 일한 치아의 이전 검진에서 이전 스캔에서 촬영된 이미지로부터의) 이전 가능도와 비교할 수 있고, 비교 결과를 제2 기계 학습 모델에 대한 입력으로서 사용할 수 있다. 바이오마커 결정 모듈은 추가적으로 또는 대안적 으로 제2 기계 학습 모델로의 입력을 위해 환자의 이전 스캔으로부터의 바이오마커의 세기 차이로 바이오 마커에 주석을 달 수 있다. 충치 진단 모듈은 치아의 하나 이상의 영역에 대한 진단을 생성한다. 일 실시형태에서, 충치 진단 모듈 은 치아의 각각의 바이오마커에 대한 진단을 결정한다. 즉, 기계 학습 모델(단일 모델, 또는 2개의 모델 접근법에서의 제2 기계 학습 모델)은 치아(또는 바이오마커)가 하나 이상의 상태(예를 들어, 구멍, 이전 충진, 착색 등)을 갖는다는, 전체 치아 또는 치아의 상이한 바이오마커에 대한 가능도를 출력할 수 있다. 충치 진단 모듈은 최소 임계치보다 높은 가능도가 충치 진단 모듈로 이어지고, 충치 진단 모듈이 해당 상 태를 진단으로 적용되는 것으로 결정하도록 임계화를 적용할 수 있다. 따라서 구멍에 대한 바이오마커, 이전 충 진에 대한 바이오마커, 착색에 대한 바이오마커와 같은 3개의 바이오마커가 있는 치아는 각 바이오마커가 치아 상의 위치와 관련하여 개별적으로 진단될 수 있다. 대안적으로, 치아는 영역에 따라 치아의 상이한 영역을 라벨 링하지 않고, 이들 3가지 상태 각각을 갖는 것으로 바깥쪽에 라벨링될 수 있다. 마지막으로, 충치 진단 모듈 은 진단의 추상화를 출력할 수 있다. 예를 들어, \"치과 진료 요망\" 또는 \"문제가 검출되지 않음\"으로 진단 된 것을 분류할지 여부를 나타내는 경험적 기법이 적용될 수 있다. 예를 들어, 착색 및 치아 내 이전 충진을 나 타내는 분류는 이러한 경험적 기법에 기초하여 \"문제가 검출되지 않음\"을 초래할 수 있는 반면, 구멍 또는 사전 구멍 재료의 임의의 발견은 \"치과 진료 요망\"이라는 분류를 초래할 수 있다. 도 4는 DPOCT 세기 맵의 일 실시형태를 도시한다. 도 4에 도시된 바와 같이, 이미지는 치아의 컬러 이미지 및 대응하는 세기 맵을 도시한다. 이러한 세기 맵은 훈련 데이터로서 사용될 수 있으며, 여기서 전문가는 라벨 (예를 들어, 에나멜, 상아질(dentin), 2차 부식, 크랙, 및 복합 충진)을 표시한다. 라벨은 건강한 어금니 대 재 구성된 어금니와 같은 임의의 유형의 치아에 대한 것일 수 있다. 환자 데이터는 치아의 유형을 결정하는 데 사용될 수 있다(예를 들어, 환자 데이터가 어금니가 재구성되었음을 나타내는 경우, 기계 학습 모델은 재구성된 어금니에 대한 실측 데이터에 적합함). 상이한 기계 학습 모델이 상이한 치아 유형에 대해 훈련될 수 있고, 충치 결정 모듈은 주어진 치아에 대한 상태를 진단하기 위해 환자 데이터로부터 결정된 환자의 치아 유형에 맞는 기계 학습 모델을 선택할 수 있다. 이것은 더 나은 타겟팅된 실측 데이터 세트를 사용함으로 써 기계 학습 모델 출력에서 효율성을 개선하고 노이즈를 감소시킬 수 있다. 도 5는 지도 기계 학습 접근법을 사용하여 치아 상태의 진단을 결정하기 위한 예시적인 프로세스를 예시한다. 도 5에 도시된 바와 같이, 프로세스는 충치 결정 툴을 이용하여, 치아(예를 들어, 이미지 캡처 모듈 을 사용하여)를 스캔하는 하드웨어 디바이스로부터 획득된 데이터에 기초하여 환자의 치아를 나타내는 이 미지 데이터를 캡처하는 것으로 시작된다. 일 실시형태에서, 치아를 스캔하는 하드웨어 디바이스로부터 획 득된 데이터는 심층 침투 광 간섭 단층촬영(DPOCT) 데이터를 포함할 수 있다. 이미지 데이터는 DPOCT 데이터에 기초한 치아의 하나 이상의 광학 특성을 반영하는 세기 맵을 포함하거나 또는 세기 맵일 수 있다. 충치 결정 모듈은(예를 들어, 기계 학습 모델로부터) 이미지 데이터를 제1 지도 기계 학습 모델에 입 력한다. 일 실시형태에서, 제1 지도 기계 학습 모델은 세기 맵의 영역 사이의 세기의 변화를 검출하고, 세 기의 변화에 기초하여 치아의 각각의 상이한 위치에 대한 개개의 분류를 출력하도록 훈련될 수 있으며, 각각의 개별 분류는 바이오마커를 형성한다. 일 실시형태에서, 제1 지도 기계 학습 모델은 치아의 컬러 이미지를 추가 로 입력으로서 취하고, 이미지 및 세기 맵 둘 모두에 기초하여 바이오마커를 출력할 수 있다. 충치 결정 모듈은 제1 지도 기계 학습 모델로부터의 출력으로서, 복수의 바이오마커를 수신하고, 각 각의 바이오마커는 치아의 상이한 위치에 대응한다. 입력이 컬러 이미지를 포함하는 경우, 제1 기계 학습 모델 의 출력은(예를 들어, 제2 기계 학습 모델의 사용에서의 편향을 제거하기 위해) 컬러 이미지로부터 컬러 데이터 를 제외할 수 있다. 충치 결정 모듈은 복수의 바이오마커를 제2 지도 기계 학습 모델에 입력하고, 제 2 지도 기계 학습 모델로부터의 출력으로서, 치과 상태의 진단을 수신한다. 일 실시형태에서, 치아의 이력 바이오마커(예를 들어, 이전 이미지가 촬영되고 결정이 제1 모델 및/또는 제2 모델로부터 이루어진 환자 데이터로부터)가 검색되고 제2 기계 학습 모델에 입력된다. 세기 정보가 모델에 입력되는 실시형태에서, 시간에 따른 세기에 대한 변화가 특정 분류에 대한 정보가 될 수 있기 때문에, 이전 세기에 대한 현재 세기에 관한 세 기의 차이가 제2 기계 학습 모델에 입력될 수 있다. 일 실시형태에서, 진단은 주어진 치아의 각각의 바이오마커 에 대한 분류를 포함할 수 있다. 본원의 개시내용은 인간 환자를 지칭하지만, 환자는 비인간일 수 있다. 개, 말 등이 본원에 개시된 시스템 및 방법을 사용하여 충치를 가질 수 있다. 예를 들어, 상태 진단을 수행하기 위해 동물 특이적 기계 학습 모델 (들)을 훈련시키기 위해 동물 치아에 대한 훈련 데이터가 추가될 수 있다. 기계 학습 모델은, 일 실시형태에서, 교차-종 훈련 데이터를 사용하여 훈련될 수 있다. 이러한 훈련 세트의 진실은 치료, 통증 및 임상의적 라벨링의 결과 중 하나 이상에 기반할 수 있다."}
{"patent_id": "10-2024-7021739", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(b) 요약 본 발명의 실시형태의 전술된 설명은 예시의 목적을 위해 제시되었으며; 이는 본 발명을 개시된 정확한 형태에 한정하거나 총망라하도록 의도되지 않는다. 관련 기술 분야의 당업자는 상기 개시내용에 비추어 많은 수정예 및 변형예가 가능하다는 것을 이해할 수 있다. 본 설명의 일부 부분은 정보에 대한 동작의 알고리즘 및 상징적 표현의 관점에서 본 발명의 실시형태를 설명한 다. 이러한 알고리즘적 설명 및 표현은 데이터 프로세싱 분야의 당업자가 자신의 작업의 실체를 다른 당업자에 게 효과적으로 전달하기 위해 일반적으로 사용된다. 이러한 동작은 기능적으로, 계산적으로 또는 논리적으로 설 명되지만, 컴퓨터 프로그램 또는 등가의 전기 회로, 마이크로코드 등에 의해 구현되는 것으로 이해된다. 또한, 이러한 동작의 배열을 일반성의 손실 없이 모듈로서 언급하는 것이 때때로 편리하다는 것이 또한 입증되었다. 설명된 동작 및 이와 연관된 모듈은 소프트웨어, 펌웨어, 하드웨어, 또는 이들의 임의의 조합으로 구현될 수 있 다. 본원에 설명된 단계, 동작, 또는 프로세스 중 임의의 것은 단독으로 또는 다른 디바이스와 조합하여 하나 이상 의 하드웨어 또는 소프트웨어 모듈로 수행되거나 구현될 수 있다. 일 실시형태에서, 소프트웨어 모듈은 설명된 단계, 동작, 또는 프로세스 중 임의의 것 또는 전부를 수행하기 위해 컴퓨터 프로세서에 의해 실행될 수 있는, 컴퓨터 프로그램 코드를 포함하는 컴퓨터 판독가능 매체를 포함하는 컴퓨터 프로그램 제품으로 구현된다. 본 발명의 실시형태는 또한 본원에서의 동작을 수행하기 위한 장치에 관한 것일 수 있다. 이 장치는 요구되는 목적을 위해 특별히 구성될 수 있고/있거나 컴퓨터에 저장된 컴퓨터 프로그램에 의해 선택적으로 활성화되거나 재구성되는 범용 컴퓨팅 디바이스를 포함할 수 있다. 이러한 컴퓨터 프로그램은 비일시적, 유형의 컴퓨터 판독 가능 저장 매체, 또는 컴퓨터 시스템 버스에 결합될 수 있는 전자 명령어를 저장하기에 적합한 임의의 유형의 매체에 저장될 수 있다. 또한, 본원에서 언급된 임의의 컴퓨팅 시스템은 단일 프로세서를 포함할 수 있거나, 증 가된 컴퓨팅 능력을 위해 다수의 프로세서 설계를 채용하는 아키텍처일 수 있다. 본 발명의 실시형태는 또한 본원에 설명된 컴퓨팅 프로세스에 의해 생성되는 제품에 관한 것일 수 있다. 이러한 제품은 컴퓨팅 프로세스로부터 생성된 정보를 포함할 수 있으며, 여기서 정보는 비일시적 유형의 컴퓨터 판독가 능 저장 매체에 저장되고, 본원에 설명된 컴퓨터 프로그램 제품 또는 다른 데이터 조합의 임의의 실시형태를 포 함할 수 있다. 마지막으로, 본원에서 사용되는 언어는 주로 가독성 및 지시 목적을 위해 선택되었으며, 본 발명의 주제를 묘사 하거나 제한하기 위해 선택된 것이 아닐 수 있다. 따라서, 본 발명의 범위는 이러한 상세한 설명에 의해서가 아 니라, 이에 기초한 출원에 공표된 임의의 청구항에 의해 제한되는 것으로 의도된다. 따라서, 본 발명의 실시형 태의 개시는 다음의 청구항에 기재된 본 발명의 범위를 예시하지만, 이에 제한되지 않는 것으로 의도된다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2024-7021739", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 충치 결정 툴을 구현하기 위한 시스템 환경의 일 실시형태를 예시한다. 도 2는 인공 지능을 사용하여 치료법을 직접 출력하는 데 있어서 치료 결정 툴에 의해 사용되는 예시적인 모듈 및 데이터베이스의 일 실시형태를 도시한다. 도 3은 치료 결정 툴의 충치 결정 모듈에 의해 사용되는 서브 모듈의 추가 세부사항의 일 실시형태를 도시한다. 도 4는 DPOCT 세기 맵의 일 실시형태를 도시한다. 도 5는 지도 기계 학습 접근법을 사용하여 치아 상태의 진단을 결정하기 위한 예시적인 프로세스를 예시한다. 도면은 단지 예시의 목적을 위해 본 발명의 다양한 실시형태를 도시한다. 당업자는 다음의 논의로부터 본원에 설명된 본 발명의 원리로부터 벗어나지 않고 본원에 예시된 구조 및 방법의 대안적인 실시형태가 채용될 수 있 다는 것을 쉽게 인식할 것이다."}
