{"patent_id": "10-2022-0147741", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0066672", "출원번호": "10-2022-0147741", "발명의 명칭": "구인기업 선호도와 구직자 선호도의 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천", "출원인": "(주)사람인", "발명자": "장진후"}}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "구직자에 대한 구인기업 선호도와 구인공고에 대한 구직자 선호도의 양방향 분석을 통해 구직자에게 취업에 적합한 구인공고를 추천하는 시스템에 있어서, 구직자 지원서류에서 추출한 구인기업 선호 요소와, 구인공고와 동일 분야의 과거 구인공고들에 대한 구직자들의 지원 결과 데이터를 이용하여 구직자에 대한 구인기업 선호도를 구하는 구인기업 선호도 결정 모듈; 구인공고에서 추출한 구직자 선호 요소에 대한 과거 구직자의 취업관련 행동 데이터를 이용하여 상기 구인공고에 대한 구직자 선호도를 구하는 구직자 선호도 결정 모듈; 상기 구인기업 선호도와 상기 구직자 선호도를 이용하여 구인공고 추천점수를 구하고, 상기 구인공고 추천점수가 추천 기준값 이상인 구인공고 리스트를 구직자 단말로 제공하는 구인공고 추천 모듈; 상기 구인공고 리스트 중에서 구직자로부터 선택된 구인공고에 대해 상기 구인기업 선호도와 상기 구직자 선호도를 포함하는 상세 추천이유를 제공하는 추천 이유 제공 모듈; 을 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 구인기업 선호도 결정 모듈은, 과거 구인공고들에 대한 구직자들의 지원결과 데이터를 이용하여 지도학습되고, 구인기업 선호도에 영향을 미치는 구인기업 선호 특징을 결정하는 인공지능 기업선호도 모델을 포함하여, 구직자의 지원서류에서 구인기업 선호도를 결정하는 구인기업 선호도 결정부; 를 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 인공지능 기업선호도 모델은, 의사결정나무 또는 랜덤포레스트 알고리즘을 기반으로 하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서, 상기 구인기업 선호도 결정 모듈은, 채용하려는 인재의 직무 또는 경력, 구인기업의 규모 중 어느 하나 이상을 기반으로 구인공고의 세그먼트를 분류하는 구인공고 세그먼트 분류부;를 더 포함하며, 상기 인공지능 기업선호도 모델은, 상기 세그먼트별로 복수개 구비되는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 2에 있어서, 공개특허 10-2024-0066672-3-상기 구인기업 선호도 결정 모듈은, 구직자 지원서류에서 추출한 구인기업 선호 요소를 상기 인공지능 기업선호도 모델에서 구한 구인기업 선호 특징과 비교하고, 구직자에게 추가가 필요한 구인기업 선호 특징을 결정하여 상기 추천 이유 제공 모듈로 전달하는 구인기업 선호도 코칭부; 를 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서, 상기 구인기업 선호도 결정 모듈은, 상기 인공지능 기업선호도 모델에서 구한 구인기업 선호 특징을 이용하여 트리 구조를 형성하되, 구직자 지원서류에서 추출한 구인기업 선호 요소의 유무에 대응하는 트리구조를 형성하여 상기 추천 이유 제공 모듈로 전달하는 구인기업 선호도 시각화부; 를 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "에 있어서, 상기 구직자 선호도 결정 모듈은, 상기 구직자의 선호 요소별 선호점수와 상기 구직자 선호 요소의 중요도를 상기 추천 이유 제공 모듈로 전달하는 구직자 선호도 코칭부; 를 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서, 상기 구직자 선호도 결정 모듈은, 구직자의 취업 관련 행동들에 대하여 기준 행동과의 연관도를 구하여, 구직자의 취업 관련 행동들의 행동점수를결정하는 구직자 행동 점수 결정부; 를 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7에 있어서, 상기 구직자 선호도 결정 모듈은, 구직자 선호 요소들을 분류한 항목에 대해 구직자 행동 데이터에서 추출한 구직자 선호 요소의 밀도를 구하여,상기 구직자 선호 요소의 중요도를 결정하는 구직자 선호 요소 중요도 결정부; 를 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7에 있어서, 상기 구직자 선호도 결정 모듈은, 구직자들의 행동을 벡터화한 구직자 행동 벡터의 유사성에 따라 구직자들을 각각의 클러스터로 분류하는 구직자클러스터 분류부; 를 더 포함하는, 구인공고 추천 시스템. 공개특허 10-2024-0066672-4-청구항 11"}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 7에 있어서, 상기 구직자 선호도 결정 모듈은, 상기 구직자 선호 요소들의 중요도와 상기 구직자 선호 요소들의 선호점수를 각 구직자 선호 요소를 나타내는도형의 면적과 상기 도형이 기준선으로부터 떨어져 있는 거리를 이용하여 나타낼 수 있는 데이터를 상기 추천이유 제공 모듈로 전달하는 구직자 선호도 시각화부; 를 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 1에 있어서, 상기 시스템은, 구인공고에서 추출된 스킬에 대하여, 스킬 중요도와, 구직자 지원서류에서 추출된 스킬과의 매칭 여부와, 구직자 지원서류에서 추출한 스킬 숙련도를 반영하여 스킬 적합도를 구하는 스킬 적합도 결정 모듈; 을 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서, 상기 스킬 적합도 결정 모듈은, 구직자 지원서류의 스킬 빈도 또는 위치를 반영하여 구직자의 스킬 숙련도를 결정하는 스킬 숙련도 결정부; 를 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 13에 있어서, 상기 스킬 적합도 결정 모듈은, 과거 구인공고에서 추출한 스킬과 상기 구인공고에 지원하여 취업에 성공한 구직자의 지원서류에서 추출한 스킬의 매칭 패턴을 이용하여, 구인공고에서 추출한 스킬의 중요도를 결정하는 구인공고 스킬 중요도 결정부; 를 더 포함하는, 구인공고 추천 시스템."}
{"patent_id": "10-2022-0147741", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "구직자에 대한 구인기업 선호도와 구인공고에 대한 구직자 선호도의 양방향 분석을 통해 구직자에게 취업에 적 합한 구인공고를 추천하는 시스템에 관한 기술이 개시된다. 구인공고 추천 시스템은 구직자에 대한 구인기업 선 호도를 구하는 구인기업 선호도 결정 모듈과, 구인공고에 대한 구직자 선호도를 구하는 구직자 선호도 결정 모듈 과, 구인기업 선호도와 구직자 선호도가 높은 구인공고 리스트를 구직자 단말로 제공하는 구인공고 추천 모듈과, 구직자로부터 선택된 구인공고에 대해 구인기업 선호도와 구직자 선호도를 포함하는 상세 추천이유를 제공하는 추천 이유 제공 모듈을 포함한다. 구직자 선호도뿐만 아니라 구직기업의 선호도를 이용한 양방향 분석을 사용하 여 구직자의 취업 활동에 적합한 구인공고를 추천할 수 있다."}
{"patent_id": "10-2022-0147741", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 데이터 처리 기술, 특히 구인공고 데이터와 구직자 지원서류 데이터로부터 구인기업 선호도와 구직 자 선호도를 결정하는 방법에 관한 데이터 처리 기술이 개시된다."}
{"patent_id": "10-2022-0147741", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보통신 기술의 발달에 따라, 구인구직 사이트를 이용한 채용 정보 서비스 제공이 증가하고 있다. 구인구직 사이트들은 구직자들이 관심을 가지는 분야에 대한 구인공고를 구직자들에게 제공하고 구직자들이 보다 쉽게 구인기업에 지원할 수 있는 서비스를 제공하고 있다. 일반적으로 구인구직 사이트들은 구직자가 입력한 자료에 맞추어 적당한 구인공고를 추천하여 구직자에게 채용 정보를 제공한다. 그러나, 구직자가 입력한 정보는 객관적인 정보가 아니라 주관적인 정보에 해당하므로, 실제 구인기업에서 요구하는 인재들이 아닌 구직자에게 구인공고가 노출되는 경우가 많다. 이러한 경우 불필요한 채 용절차가 진행되어 구직자와 구인기업에 모두 시간 및 노력이 소요되는 문제가 발생할 수 있다. 따라서, 구인기업에서 선호하는 인재에게 해당 구인공고를 추천하고, 구직자의 주관적 판단이 아닌 구직자가 실 제 선호하는 객관적인 선호도에 따라 구인공고를 추천하는 것이 바람직하다. 즉, 구직자에 대한 구인기업의 선 호도와 구인기업에 대한 구직자의 선호도를 모두 고려하여 구인공고에 대한 양방향 추천을 하는 경우, 구직자에 게 채용 확률이 높은 구인공고를 추천할 수 있다. 2015년 10월 05일 공고된 등록특허 제10-1557201호는 의사결정 트리를 이용한 취업 가능성 예측 방법에 관한 것 이다. 취업 희망자의 역량 정보를 객관적으로 평가하여 취업 희망자의 취업 가능성을 예측하여 제공함으로써, 취업을 위해 필요한 시간과 노력을 절감시킨다. 또한, 취업 희망자에게 취업에 필요한 보완 요소를 제공함으로 써, 취업 희망자가 효과적으로 취업에 대비할 수 있도록 하여 취업율 향상을 도모할 수 있다. 이를 위해, 취업 가능성 예측 방법은, 취업 희망자의 데이터를 입력받아 정규화하고, 정규화된 데이터를 기반으로 의사결정 트리 를 생성하고, 취업 예측 규칙(룰)을 생성하고, 취업 예측 규칙을 기초로 취업 희망자의 취업 가능성을 예측한다. 취업이 불가능한 것으로 예측된 경우에는 취업을 위해 필요한 보완 요소를 제공할 수 있다. 다만, 구직자에 대한 구인기업의 선호도와 구인기업에 대한 구직자의 선호도를 모두 고려하여 구인공고에 대해 양방향 추천을 하는 방법에 대해서는 아직 구체적으로 개시되어 있지 않다."}
{"patent_id": "10-2022-0147741", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 목적은, 구직자에 대한 구인기업의 선호도와 구인기업에 대한 구직자 선호도의 양방향 추천에 의 해 구직자에게 적합한 구인공고를 추천하는 시스템 및 방법을 제공하는 것이다. 본 발명의 다른 목적은, 구인기업 선호도에 대한 구체적인 이유를 제공하고, 구직자가 보완할 점을 코칭하는 구 인공고 추천 시스템 및 방법을 제공하는 것이다. 본 발명의 또 다른 목적은, 구직자가 선호하는 요소에 대해 객관적인 선호도를 결정하는 구인공고 추천 시스템 및 방법을 제공하는 것이다. 본 발명의 또 다른 목적은, 구인공고에서 요구하는 스킬에 대해 구직자가 보유한 스킬의 적합도를 객관적으로 결정하는 구인공고 추천 시스템 및 방법을 제공하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제 들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0147741", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "제안된 발명의 일 양상에 따르면, 구직자에 대한 구인기업 선호도와 구인공고에 대한 구직자 선호도의 양방향 분석을 통해 구직자에게 취업에 적합한 구인공고를 추천하는 구인공고 추천 시스템은, 구인기업 선호도 결정 모 듈과, 구직자 선호도 결정 모듈과, 구인공고 추천 모듈과, 추천 이유 제공 모듈을 포함한다. 구인기업 선호도 결정 모듈은 구직자 지원서류에서 추출한 구인기업 선호 요소와, 구인공고와 동일 분야의 과거 구인공고들에 대한 구직자들의 지원 결과 데이터를 이용하여 구직자에 대한 구인기업 선호도를 구한다. 구직자 선호도 결정 모듈은 구인공고에서 추출한 구직자 선호 요소에 대한 과거 구직자의 취업관련 행동 데이터를 이용 하여 상기 구인공고에 대한 구직자 선호도를 구한다. 구인공고 추천 모듈은 구인기업 선호도와 구직자 선호도를 이용하여 구인공고 추천점수를 구하고, 구인공고 추천점수가 추천 기준값 이상인 구인공고 리스트를 구직자 단 말로 제공한다. 추천 이유 제공 모듈은 구인공고 리스트 중에서 구직자로부터 선택된 구인공고에 대해 구인기업 선호도와 구직자 선호도를 포함하는 상세 추천이유를 제공한다. 추가적인 양상에 따르면, 상기 구인기업 선호도 결정 모듈은, 과거 구인공고들에 대한 구직자의 지원결과 데이 터를 이용하여 지도학습되고, 구인기업 선호도에 영향을 미치는 구인기업 선호 특징을 결정하는 인공지능 기업선호도 모델을 포함하는 구인기업 선호도 결정부를 포함한다. 추가적인 양상에 따르면, 상기 인공지능 기업선호도 모델은, 의사결정나무 또는 랜덤포레스트 알고리즘을 기반 으로 한다. 추가적인 양상에 따르면, 상기 구인기업 선호도 결정 모듈은 채용하려는 인재의 직무 또는 경력, 구인기업의 규 모 중 어느 하나 이상을 기반으로 구인공고의 세그먼트를 분류하는 구인공고 세그먼트 분류부를 더 포함하며, 상기 인공지능 기업선호도 모델은 상기 세그먼트별로 복수개 구비된다. 추가적인 양상에 따르면, 상기 구인기업 선호도 결정 모듈은, 구직자 지원서류에서 추출한 구인기업 선호 요소 를 상기 인공지능 기업선호도 모델에서 구한 구인기업 선호 특징과 비교하고, 구직자에게 추가가 필요한 구인기 업 선호 요소를 결정하여 상기 추천 이유 제공 모듈로 전달하는 구인기업 선호도 코칭부를 더 포함한다. 추가적인 양상에 따르면, 상기 구인기업 선호도 결정 모듈은, 상기 인공지능 기업선호도 모델에서 구한 구인기 업 선호 특징을 이용하여 트리 구조를 형성하되, 구직자 지원서류에서 추출한 구인기업 선호 요소의 유무에 대 응하는 트리구조를 형성하여 상기 추천 이유 제공 모듈로 전달하는 구인기업 선호도 시각화부를 더 포함한다. 추가적인 양상에 따르면, 상기 구직자 선호도 결정 모듈은, 구인공고에서 구직자 선호 요소를 추출하고, 과거 구직자 행동 데이터에서 상기 구직자 선호 요소에 대한 구직자의 행동을 추출하여 각 행동에 행동점수를 부여하 고, 구직자 선호 요소의 중요도를 반영한 각 구직자 선호 요소별 선호점수를 이용하여 구직자 선호도를 구하는 구직자 선호도 결정부를 포함한다. 추가적인 양상에 따르면, 상기 구직자 선호도 결정 모듈은, 구직자의 취업 관련 행동들에 대하여 기준 행동과의 연관도를 구하여, 구직자의 취업 관련 행동들의 행동점수를 결정하는 구직자 행동 점수 결정부를 더 포함한다. 추가적인 양상에 따르면, 상기 구직자 선호도 결정 모듈은, 구직자 선호 요소들을 분류한 항목에 대해 구직자 행동 데이터에서 추출한 구직자 선호 요소의 밀도를 구하여, 구직자 선호 요소의 중요도를 결정하는 구직자 선 호 요소 중요도 결정부를 더 포함한다. 추가적인 양상에 따르면, 상기 구직자 선호도 결정 모듈은, 구직자들의 행동을 벡터화한 구직자 행동 벡터의 유 사성에 따라 구직자들을 각각의 클러스터로 분류하는 구직자 클러스터 분류부를 더 포함한다. 추가적인 양상에 따르면, 상기 구직자 선호도 결정 모듈은, 상기 구직자의 선호 요소별 선호점수와 상기 구직자 선호 요소의 중요도를 상기 추천 이유 제공 모듈로 전달하는 구직자 선호도 코칭부를 더 포함한다. 추가적인 양상에 따르면, 상기 구직자 선호도 결정 모듈은, 상기 구직자 선호 요소들의 중요도와 상기 구직자 선호 요소들의 선호점수를 각 구직자 선호 요소를 나타내는 도형의 면적과 상기 도형이 기준선으로부터 떨어져 있는 거리를 이용하여 나타낼 수 있는 데이터를 상기 추천 이유 제공 모듈로 전달하는 구직자 선호도 시각화부 를 더 포함한다. 추가적인 양상에 따르면, 상기 시스템은, 구인공고에서 추출된 스킬에 대하여, 스킬 중요도와, 구직자 지원서류 에서 추출된 스킬과의 매칭 여부와, 구직자 지원서류에서 추출한 스킬 숙련도를 반영하여 스킬 적합도를 구하는 스킬 적합도 결정 모듈을 더 포함한다. 추가적인 양상에 따르면, 상기 스킬 적합도 결정 모듈은, 구직자 지원서류의 스킬 빈도 또는 위치를 반영하여 구직자의 스킬 숙련도를 결정하는 스킬 숙련도 결정부를 더 포함한다. 추가적인 양상에 따르면, 상기 스킬 적합도 결정 모듈은, 과거 구인공고에서 추출한 스킬과 상기 구인공고에 지 원하여 취업에 성공한 구직자의 지원서류에서 추출한 스킬의 매칭 패턴을 이용하여, 구인공고에서 추출한 스킬 의 중요도를 결정하는 구인공고 스킬 중요도 결정부를 포함한다."}
{"patent_id": "10-2022-0147741", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "제안된 발명에 따른 구인공고를 추천하는 시스템 및 방법은, 구직자에 대한 구인기업 선호도와 구인기업에 대 한 구직자 선호도의 양방향 추천에 의해 구직자에게 적합한 구인공고를 추천할 수 있다. 나아가 제안된 발명은, 구인기업 선호도에 대한 구체적인 이유를 제공하는 인공지능 기업선호도 모델을 사용하 여, 구직자가 보완할 점을 코칭할 수 있다. 나아가 제안된 발명은, 구직자의 행동을 분석하여 구직자가 선호하는 요소에 대해 객관적인 선호도를 결정할 수 있다. 나아가 제안된 발명은, 구인공고에서 추출된 스킬의 중요도를 결정하고 구직자가 보유한 스킬과의 매칭여부를 고려하여 스킬 적합도를 객관적으로 결정할 수 있다."}
{"patent_id": "10-2022-0147741", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한, 그리고 추가적인 양상들은 첨부된 도면을 참조하여 설명하는 실시예들을 통해 구체화된다. 각 실시예들 의 구성 요소들은 다른 언급이나 상호간에 모순이 없는 한 실시예 내에서 또는 타 실시예의 구성 요소들과 다양 한 조합이 가능한 것으로 이해된다. 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개 념을 적절하게 정의할 수 있다는 원칙에 입각하여 본 명세서 및 청구범위에 사용된 용어는 기재 내용 혹은 제안 된 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 본 명세서에서 모듈 또는 부분은, 컴퓨터 또는 프로세서에서 실행 가능하도록 메모리에 저장된 프로그램 명령어의 집합이거나, 이러한 명령들을 수행할 수 있 도록 ASIC, FPGA 등의 전자 부품 또는 회로의 집합을 이용하여 구현할 수 있다. 또한, 각 모듈 또는 부분의 동작은 하나 또는 복수의 프로세서 또는 장치에 의해 수행될 수 있다. 동일·유사한 부호가 표시된 구성요소는 동 일·유사한 기능을 수행하므로, 설명을 생략할 수 있다. 설명이 생략된 도면부호를 가진 구성요소에 대해서는, 동일·유사한 부호를 가진 구성요소에 대해 앞에서 설명한 내용을 참조할 수 있다. 이하 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템의 전체적인 구성을 개략적으로 나타내는 구성도이다. 제안된 발명의 일 양상에 따르면, 구직자에 대한 구인기업 선호도와 구인공고에 대한 구직자 선호도의 양방향 분석을 통해 구직자에게 취업에 적합한 구인공고를 추천하는 구인공고 추천 시스템은, 구인공고 입력 모듈 과, 구인공고 평가 모듈과, 구인공고 추천 모듈과, 추천 이유 제공 모듈을 포함한다. 구인공고 입력 모듈은, 구인공고를 입력받아 구인공고 평가 모듈로 전달한다. 신규 구인공고를 검색하는 구인공고 검색 모듈(미도시)을 포함할 수 있다. 구인공고 평가 모듈은 구인기업 선호도 결정 모듈과 구직자 선호도 결정 모듈을 포함한다. 추가 적인 양상에 따르면, 구인공고 평가 모듈은 스킬 적합도 결정 모듈과, 알고리즘 분석 모듈과, 직무성향 분석 모듈을 더 포함할 수 있다. 구인기업 선호도 결정 모듈은 구직자 지원서류에서 추출한 구인기업 선호 요소와, 구인공고와 동일 분야의 과거 구인공고들에 대한 구직자들의 지원 결과 데이터를 이용하여 구직자에 대한 구인기업 선호도를 구한다. 구직자 선호도 결정 모듈은 구인공고에서 추출한 구직자 선호 요소에 대한 과거 구직자의 취업관련 행동 데이터를 이용하여 상기 구인공고에 대한 구직자 선호도를 구한다. 스킬 적합도 결정 모듈은 구인공고에서 추출된 스킬에 대하여, 스킬 중요도와, 구직자 지원서류에서 추출 된 스킬과의 매칭 여부와, 구직자 지원서류에서 추출한 스킬 숙련도를 반영하여 스킬 적합도를 구한다. 알고리즘 분석 모듈은 과거의 구직자의 행동 또는 공고의 내용 간의 유사도 또는 연관도를 추천 알고리즘 을 이용하여 구한다. 추천 알고리즘으로는 협업필터링, 장바구니 분석, 컨텐츠 기반 분석, 세그먼트 분석, item2vec, 행렬 분해 등을 사용할 수 있다. 직무성향 분석 모듈은 직무성향에 대한 인적성 검사 정보를 바탕으로 공고의 직무와 구직자의 성향이 매칭 되는 정도를 구한다. 구인공고 추천 모듈은 구인기업 선호도와 구직자 선호도를 이용하여 구인공고 추천점수를 구하고, 구인공 고 추천점수가 추천 기준값 이상인 구인공고 리스트를 구직자 단말로 제공한다. 구인공고 추천 모듈은 구 인공고 평가 모듈을 구성하는 각각의 모듈에서 구한 각종 지표에 가중치를 곱하여 합하거나, 평균을 구하 여 추천점수를 구할 수 있다. 추천 이유 제공 모듈은 구인공고 평가 모듈로부터 구인공고를 추천하는 이유를 전달받아 사용자 단말로 전 달한다. 특히, 구인공고 리스트 중에서 구직자로부터 선택된 구인공고에 대해 구인기업 선호도와 구직자 선호도 를 포함하는 상세 추천이유를 제공할 수 있다. 제공된 상세 추천 이유는 단말기의 디스플레이 등을 이용하여 시 각화하거나 출력될 수 있다. 도 2는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구인기업 선호 도 결정 모듈의 구성을 나타내는 구성도이다. 일 실시예에 따르면, 구인기업 선호도 결정 모듈은, 구인공고 세그먼트 분류부와, 구인기업 선호 요 소 추출부와, 구직자 지원서류 레이블링부와, 구인기업 선호도 모델 학습부와, 구인기업 선호도 결정부와, 구인기업 선호도 코칭부와, 구인기업 선호도 시각화부를 포함할 수 있다. 추가적인 양상에 따르면, 구인공고 세그먼트 분류부는 채용하려는 인재의 직무 또는 경력, 구인기업의 규 모 중 어느 하나 이상을 기반으로 구인공고의 세그먼트(Segment)를 분류한다. 구인기업이 선호하는 인재의 선호 요소는 구인기업의 규모, 인재를 채용하려는 직무 분야, 그리고 채용하려는 인재의 경력 등에 의해 차이를 보일 수 있다. 예를 들어, A 세그먼트에서 선호하는 항목의 우선순위가 전공, 학 력, 자격증 순일 때, B 세그먼트의 우선순위는 자격증, 외국어, 학력 순으로, 세그먼트별로 구인기업의 선호 요 소가 다를 수 있다. 따라서 구인공고를 구인기업의 규모, 채용하려는 직무, 인재의 경력 등을 이용하여 세그먼트(Segment)별로 분류 하여 구직자에 대한 구인기업의 선호도를 결정하는 것이 바람직하다. 예를 들어, 구인공고를 대기업*전지개발* 신입, 글로벌기업*의류판매*경력, 중견기업*의약제조*신입, 소기업*물류*경력, 스타트업*인공지능*신입 등으로 분류할 수 있다. 한편, 과거 구인공고 실적이 적은 구인기업의 경우라도 세그먼트별로 구인기업 선호도를 결정 할 수 있어서, 콜드 스타트(Cold Start) 문제 없이 구인기업 선호도를 결정할 수 있다. 구인공고 세그먼트 분류부는 구인공고 세그먼트를 결정하는 인공지능 세그먼트 분류 모델을 구비할 수 있 다. 구인공고 세그먼트를 결정하는 인공지능 세그먼트 분류 모델은 직무분야, 인재의 경력, 구인기업의 규모 등 을 이용하여 구인공고의 세그먼트를 분류하도록 학습시킨다. 구인공고 세그먼트 분류부에 구인공고를 입력 하면, 구인공고에서 직무분야와 인재의 경력을 추출하여 인공지능 세그먼트 분류 모델에 입력한다. 구인기업의 규모는 별도의 데이터베이스로부터 전달받아 입력할 수 있다. 구인공고 세그먼트 분류부는 인공지능 세그 먼트 분류 모델에 의해 결정된 구인공고의 세그먼트를 출력할 수 있다. 추가적인 양상에 따르면, 구인기업 선호 요소 추출부는 형태소 분석기를 포함하여, 구직자의 지원서류로부 터 구인기업이 선호하는 구인기업 선호 요소를 추출한다. 구직자 지원서류는 이력서, 자기소개서 등을 포함한다. 형태소 분석기는 자기소개서 항목 등 비정형 데이터로부터 구인기업 선호 요소를 추출할 수 있다. 구 인기업 선호 요소는 과거 구인공고와 그 공고에 지원한 합격자 및 불합격자 지원서류를 매칭한 결과로부터 결정 할 수 있다. 구인기업 선호 요소는 학력, 전공, 자격증 코드, 자기소개서 길이(글자수), 외국어 코드 등을 포함 할 수 있다. 추가적인 양상에 따르면, 구직자 지원서류 레이블링부는 구직자 지원서류의 합격/불합격 여부를 반영하여 구직자 지원서류에 구인기업 선호도 점수를 레이블링(labeling)한다. 합격자 지원서류는 구인기업 선호도 점수 를 50점 이상 부여하고, 불합격자 지원서류는 구인기업 선호도 점수를 50점 미만으로 부여할 수 있다. 구인기업 선호도 점수에 구직자 지원서류의 완성도 점수를 반영할 수 있다. 예를 들어, 합격자 이력서는 기본 점수로 70 점을 부여하고, 구직자 지원서류 완성도가 높은 서류에 대해서는 30점 내에서 가점하여, 구인기업 선호도 점수 를 100점 만점으로 레이블링할 수 있다. 추가적인 양상에 따르면, 구인기업 선호도 모델 학습부는 구인기업 선호도를 결정하는 인공지능 기업선호 도 모델을 학습시킨다. 인공지능 기업 선호도 모델을 학습시키기 위해, 동일한 세그먼트의 과거 구인공고들에 대해 구직자들이 지원한 지원서류에서 추출한 구인기업 선호 요소와 레이블링된 구인기업 선호도 점수를 입력한 다. 즉, 인공지능 기업선호도 모델은 과거 구인공고들에 대한 구직자의 지원결과 데이터를 이용하여 지도학습된 다. 예를 들어, 합격자 지원서류에서 추출한 구인기업 선호 요소를 입력하면 구인기업 선호도 점수를 50점 이상 으로, 불합격자 지원서류에서 추출한 구인기업 선호 요소를 입력하면 구인기업 선호도 점수를 50점 미만으로 분 류하도록 지도학습될 수 있다. 추가적인 양상에 따르면, 인공지능 기업선호도 모델은 학습이 완료되면 구인기업 선호도에 영향을 미치는 구인 기업 선호 특징(feature)들을 결정할 수 있다. 지니 불순도(Gini impurity) 등을 이용하여 각각의 구인기업 선 호 특징이 구인기업 선호도에 미치는 영향(가중치)을 점수로 나타낼 수 있다. 구인기업 선호 특징은 구인기업 선호도에 미치는 영향 점수가 특징 기준값 이상인 것들을 선택하여 결정하거나, 구인기업 선호도에 미치는 영향 점수가 큰 순서대로 미리 정해진 기준 개수만큼 선택하여 결정할 수 있다. 인공지능 기업선호도 모델은 다양한 분류 모델 중에서 선택하여 사용할 수 있다. 다만, 구인기업 선호도에 미치 는 영향을 설명하기 위해서는, 인공지능 기업선호도 모델은 의사결정나무 또는 랜덤포레스트 알고리즘을 기반으 로 하는 것이 바람직하다. 특히 앙상블 방법을 적용한 랜덤포레스트 기반 모델은 성능이 우수하고 과대적합 (overfitting)을 방지할 수 있다. 추가적인 양상에 따르면, 구인기업 선호 특징을 결정하는 인공지능 기업선호도 모델은 상기 세그먼트별로 복수 개 구비될 수 있다. 구인기업 선호 특징을 결정하는 인공지능 기업선호도 모델은 세그먼트별로 복수개 구비되므로, 학습이 완료되면 구인기업 선호 특징들도 세그먼트별로 구비된다. 구인공고에서 세그먼트가 결정되면, 구인기업 선호 특징을 결 정하는 인공지능 기업선호도 모델과 구인기업 선호 특징이 결정된다. 구직자 지원서류를 인공지능 기업선호도 모델에 입력하여 구직자에 대한 구인기업의 선호도를 구하고, 구인기업 선호 특징과 비교하여 구직자에게 구인 기업 선호도에 대해 코칭할 수 있다. 추가적인 양상에 따르면, 구인기업 선호도 결정부는 구인기업 선호 특징을 결정하는 인공지능 기업선호도 모델을 포함하여, 구직자에 대한 구인기업의 선호도를 결정한다. 새로운 구인공고가 입력된 경우, 우선 구인공고가 속하는 세그먼트를 구인기업(규모)과 채용 직무와 인재의 경 력 등을 이용하여 구한다. 해당 세그먼트의 구인기업 선호도를 결정하는 인공지능 기업선호도 모델을 선택한다. 이력서 등 구직자의 지원서류에서 구인기업 선호 요소를 추출하여, 결정된 세그먼트의 인공지능 기업선호도 모 델에 입력하여 구인기업 선호도를 결정한다. 추가적인 양상에 따르면, 구인기업 선호도 코칭부는 구직자 지원서류에서 추출한 구인기업 선호 요소를 인 공지능 기업선호도 모델에서 구한 구인기업 선호 특징과 비교하고, 구직자에게 추가가 필요한 구인기업 선호 특 징을 결정하여 추천 이유 제공 모듈로 전달한다. 추천 이유 제공 모듈은 구직자에게 추가가 필요한 구인기업 선호 특징을 포함한 코칭 내용을 구직자 단말로 전달한다. 추가적인 양상에 따르면, 구인기업 선호도 시각화부는 인공지능 기업선호도 모델에서 구한 구인기업 선호 특징을 이용하여 트리 구조를 형성하되, 구직자 지원서류에서 추출한 구인기업 선호 요소의 유무에 대응하는 트 리구조를 형성하여 추천 이유 제공 모듈로 전달한다. 추천 이유 제공 모듈은 구인기업 선호 특징의 트리 구조를 구직자 단말로 전달하여, 구직자 단말의 디스플레이 등에서 시각화되도록 한다. 도 3은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구인기업 선호 도 결정 모듈의 인공지능 기업선호도 모델을 학습시키는 방법을 나타내는 순서도이다. 과거 구인공고를 분석하여 구인공고의 세그먼트를 결정한다(S310). 구인공고의 세그먼트는 채용하려는 인재의 직무 또는 경력, 구인기업의 규모 중 어느 하나 이상을 기반으로 분류하여 결정할 수 있다. 구인공고에 대한 구직자의 지원서류에서 구인기업 선호 요소를 추출한다(S320). 구인기업 선호 요소는 이력서, 자기소개서 등의 구직자 지원서류에서 형태소 분석기 등을 이용하여 미리 정해진 구인기업 선호 요소를 추출한 다. 구인기업 선호 요소는 과거 구인공고와 그 공고에 지원한 합격자 및 불합격자 지원서류를 매칭한 결과로부 터 미리 결정할 수 있으며, 학력, 전공, 자격증 코드, 자기소개서 길이(글자수), 외국어 코드 등을 포함할 수 있다. 합격자와 불합격자의 지원서류를 레이블링한다(S340). 구직자 지원서류의 합격/불합격 여부를 반영하여 구직자 지원서류에 구인기업 선호도 점수를 레이블링(labeling)한다. 합격자 지원서류는 구인기업 선호도 점수를 50점 이상 부여하고, 불합격자 지원서류는 구인기업 선호도 점수를 50점 미만으로 부여할 수 있다. 세그먼트별 구직자의 지원 결과(구인기업 선호도 점수)와 구직자 지원서류에서 추출한 구인기업 선호 요소를 입 력하여 인공지능 기업선호도 모델을 학습시킨다(S350). 인공지능 기업선호도 모델은 세그먼트별로 입력된 구인 기업 선호 요소들을 포함하는 지원서류에 대해 구인기업 선호도 점수를 분류하여 출력한다. 이때 합격자 지원서 류의 구인기업 선호 요소들이 입력된 경우 구인기업 선호도 점수를 50점 이상으로 분류할 수 있다. 인공지능 기업선호도 모델은 의사결정나무 또는 랜덤포레스트 알고리즘을 기반으로 하는 모델을 사용할 수 있다. 특히 앙상블 방법을 적용한 랜덤포레스트 기반 모델을 사용하면, 성능이 우수하고 과대적합(overfittin g)을 방지할 수 있다. 구인기업 선호 특징을 결정한다(S360). 의사결정나무 또는 랜덤포레스트 알고리즘을 기반으로 하는 인공지능 기 업선호도 모델을 학습시킨 경우, 그 결과로 구인기업 선호 특징들을 구할 수 있다. 구인기업 선호 특징은 구인 기업 선호도에 영향을 많이 미치는 구인기업 선호 요소에 해당한다. 도 4는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구인기업 선호 도 결정 모듈이 동작하는 방법을 나타내는 순서도이다. 입력된 구인공고를 분석하여, 구인공고의 세그먼트를 결정한다(S410). 구인공고의 세그먼트는 채용하려는 인재 의 직무 또는 경력, 구인기업의 규모 중 어느 하나 이상을 기반으로 분류하여 결정한다. 세그먼트별 인공지능 기업선호도 모델을 학습시킬 때 사용한 세그먼트를 분류 모델과 동일한 모델을 사용하여 세그먼트를 분류하는 것이 바람직하다. 구인공고 세그먼트에 해당하는 인공지능 기업선호도 모델을 결정한다(S430). 구직자 지원서류에서 구인기업 선호 요소를 추출한다(S420). 구인기업 선호 요소는 이력서, 자기소개서 등의 구 직자 지원서류에서 형태소 분석기 등을 이용하여 미리 정해진 구인기업 선호 요소를 추출한다. 인공지능 기업선 호도 모델을 학습시킬 때 사용한 형태소 분석기와 동일한 형태소 분석기를 사용하여 구인기업 선호 요소를 추출하는 것이 바람직하다. 세그먼트별 인공지능 기업선호도 모델에 구직자 지원서류에서 추출한 구인기업 선호 요소를 입력하여 구인기업 선호도를 결정한다(S470). 세그먼트별 인공지능 기업선호도 모델에서 결정된 구인기업 선호 특징과 구직자 지원서류에서 추출한 구인기업 선호 요소를 비교하여 코칭 요소를 산출한다(S480). 구인기업 선호 특징 중에서 구인기업 선호 요소에 없는 특 징에 대해 보완을 요청하는 코칭을 할 수 있다. 한편, 구인기업 선호 특징은 구인기업 선호 요소의 존재 유무를 반영한 트리 구조로 구성하여 시각화할 수 있다. 도 5는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구인기업 선호 도 결정 모듈에서 구인기업 선호도를 결정하는 방법과 구인기업 선호도를 시각화하는 방법을 설명하는 개 념도이다. 도 5(a)는 구인기업 선호 특징과 가중치의 예시를 나타낸다. 도 5(a)를 참조하면, 구인기업에서 선호하는 특징 중 가장 큰 비중을 차지하는 특징이 '정보처리 자격증 보유'이고, 그 다음으로 '인공지능 스킬 보유', '컴퓨터 관련 학과 졸업' 등의 순임을 알 수 있다. 도 5(b)는 구인기업 선호 특징을 트리 구조로 나타낸 예시이다. 구인기업 선호 특징을 점수(가중치) 순으로 배 치할 수 있다. 구인기업 선호 특징들 사이에 논리적으로 연관 관계가 있는 경우, 해당 구인기업 선호 특징들을 미리 정해진 순서에 따라 배치할 수 있다. 구인기업 선호 특징들을 구직자 지원서류에서 추출한 구인기업 선호 요소와의 매칭 여부에 따라 배치할 수 있다. 즉, 구인기업 선호 특징에 해당하는 구인기업 선호 요소가 있는 경우, 다음 구인기업 선호 특징은 오른쪽 에 배치하고, 해당하는 구인기업 선호 요소가 없는 경우, 다음 구인기업 선호 특징을 왼쪽에 배치할 수 있다. 도 5(b)를 참조하면, 구인기업 선호 특징들이 점수(가중치) 순으로 배치되어 있는데, 다음 구인기업 선호 특징 으로 굵은 화살표를 이용하여 연결된다. 가장 위쪽 노드는 가장 큰 점수에 해당하는 '정보처리 자격증'에 관한 것이고, 구인기업 선호 요소에 '정보처리 자격증'이 있는 경우, 굵은 화살표로 표시된 오른쪽 방향에 다음 구인 기업 선호 특징인 '인공지능 스킬'을 배치할 수 있다. 구인기업 선호 요소에 '인공지능 스킬'이 없는 경우, 굵 은 화살표로 표시된 왼쪽 방향에 다음 구인기업 선호 특징인 '컴퓨터 관련 학과'를 배치한다. 이러한 방법으로 구인기업 선호 특징들을 트리 구조로 배치하면, 추천 이유 제공 모듈에서 구직자에게 시 각화하여 보여줄 수 있다. 그 결과, 구직자에게 구인기업 선호도 결정 이유를 알기 쉽게 설명할 수 있고, 구직 자에게 구인기업 선호도를 향상시킬 부분을 코칭하기 쉬워진다. 사용자 단말로부터 트리 구조의 노드 선택 정보가 입력되는 경우, 구인기업 선호도 시각화부는 선택된 노 드에 대해 구인기업 선호 특징과 가중치 정보를 사용자 단말로 전송할 수 있다. 사용자 단말에서는 전달된 가중 치 정보를 팝업창 등을 이용하여 표시할 수 있다. 사용자 단말로부터 새로운 경로를 입력받는 경우, 새로운 경로에 대한 가중치 정보를 반영한 구인기업 선호도를 제공할 수 있다. 예를 들어, 도 5(b)에서 사용자 단말로부터 인공지능 스킬 보유 Y 경로를 입력받은 경우, 가중 치 24점을 추가로 반영한 구인기업 선호도를 사용자 단말로 전송할 수 있다. 구직자들이 구인기업 선호도를 향 상시키는 다양한 경로를 탐색할 수 있어서 구직활동에 도움을 줄 수 있다. 도 6은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구직자 선호도 결정 모듈의 구성을 나타내는 구성도이다. 일 실시예에 따르면, 구직자 선호도 결정 모듈은 구직자 클러스터 분류부와, 구직자 선호 요소 추출 부와, 구직자 행동 추출부와, 구직자 행동점수 결정부와, 구직자 선호 요소 중요도 결정부(65 0)와, 구직자 선호도 결정부와, 구직자 선호도 코칭부와, 구직자 선호도 시각화부를 포함할 수 있다. 추가적인 양상에 따르면, 구직자 클러스터 분류부는 구직자들의 행동을 벡터화한 구직자 행동 벡터의 유사 성에 따라 구직자들을 각각의 클러스터로 분류한다. 구직자들은 직무분야, 경력연차, 직급 등 다양한 조건에 따라 행동 패턴이 각각 다르게 나올 수 있다. 따라서 구직자들의 행동 패턴을 기반으로 사용자들을 각각의 클러스터로 분류하여 구직자가 선호하는 행동을 평가하는 것이 바람직하다. 신규 구직자의 경우, 충분한 행동 데이터가 없기 때문에, 클러스터 구분 없이 전체 구직자 기준으로 행동을 평가할 수 있다. 추가적인 양상에 따르면, 구직자 선호 요소 추출부는 형태소 분석기를 포함하여, 구인공고로부터 구직자 선호 요소를 추출한다. 형태소 분석기는 자기소개서 항목 등 비정형 데이터로부터 구직자 선호 요소를 추출할 수 있다. 구직자 선호 요소는 구직자의 취업관련 행동에 사용된 구인공고와 지원서류를 이용하여 결정할 수 있 다. 구직자 선호 요소는 예를 들어 자격증, 스킬, 주요 키워드, 복지 등 취업에 영향을 주는 항목에서 다양하게 선택하여 결정할 수 있다. 추가적인 양상에 따르면, 구직자 행동 추출부는 과거 구직자의 취업관련 행동 데이터에서 구인공고로부터 추출한 구직자 선호 요소와 관련된 행동을 추출한다. 추가적인 양상에 따르면, 구직자 행동점수 결정부는 구직자의 취업 관련 행동들에 대하여 기준 행동과의 연관도를 구하여, 구직자의 취업 관련 행동들의 행동점수를 결정한다. 구직자의 취업관련 행동을 평가하여 행동점수를 결정하기 위해, 먼저 구직자의 행동들을 선호 행동과 비선호 행 동으로 분류하고, 선호 행동과 비선호 행동의 가장 중요한 기본 행동을 결정한다. 예를 들어, 선호 행동 중에서 구인공고에 대한 '입사 지원'을 기본 선호 행동으로 결정할 수 있다. 비선호 행동의 기본 행동으로 구인공고에 대한 '싫어요 선택'을 선정할 수 있다. 기타 행동들의 행동점수는 기본 행동과의 연관도를 측정하여 결정할 수 있다. 기본 행동에 대한 각각의 행동의 연관도는 연관성 규칙 알고리즘 또는 상관관계 분석을 사용하여 구할 수 있다. 예를 들어, 구인공고에 대한 기 본 선호 행동인 '입사 지원'을 10점으로 결정한 경우, 구인공고를 '스크랩'하는 행동은 8점, 구인공고에 대한 '조회' 행동은 5점으로 결정할 수 있다. 추가적인 양상에 따르면, 구직자 선호 요소 중요도 결정부는 구직자 선호 요소들을 분류한 항목에 대해 구 직자 행동 데이터에서 추출한 구직자 선호 요소의 밀도를 구하여, 구직자 선호 요소의 중요도(가중치)를 결정한 다. 구직자 선호 요소의 밀도는 통계학적 기법으로 결정할 수 있으며, 일반적으로 동일한 항목에 속하는 구직자 선호 요소들의 종류가 적은 경우 밀도가 높은 것으로 결정된다. 예를 들어, 구직자 A는 근무 지역 항목에 대해 구직자 선호 요소가 '서울'인 구인공고에만 입사지원 행동을 하였고, 구직자 B는 근무 지역 항목에 대해 구직자 선호 요소가 '서울', '경기', '충청', '전라', '경상', '부산'인 구인공고에 입사지원 행동을 한 경우, 구직자 A의 근무 '지역' 항목에는 구직자 선호 요소의 종류가 적어서 지역 항목에서 구직자 선호 요소 '서울'의 밀도가 높고, 지역 항목의 가중치는 높게 결정된다. 구직자 B의 근무 '지역' 항목에 대해서는 구직자 선호 요소의 종류 가 많으므로 어느 한 지역의 밀도가 높지 않고, 지역 항목의 중요도는 낮게 결정된다. 각 개인의 활동이 적어서 항목들의 중요도를 구하기에 불충분한 경우, 직무 분야를 포함한 범위에서 구직자 선 호 요소의 밀도를 구하여 항목의 중요도(가중치)를 결정할 수 있다. 예를 들어, 개인의 취업관련 활동이 적은 경우 항목들의 중요도는 개인이 속하는 직무분야와 경력연차를 반영한 그룹의 활동 데이터를 이용하여 결정할 수 있다. 만일 직무분야와 경력연차를 반영한 그룹의 활동 데이터도 적다면, 개인이 속하는 직무분야 전체의 활 동 데이터를 이용하여 항목들의 중요도를 결정할 수 있다. 추가적인 양상에 따르면, 구직자 선호도 결정부는 구인공고에서 구직자 선호 요소를 추출하고, 구직자 선 호 요소에 대해 구직자 클러스터별 선호 행동의 행동점수를 부여하고, 구직자 선호 요소가 포함된 항목의 중요 도를 반영한 각 구직자 선호 요소별 선호점수를 이용하여 구직자 선호도를 구한다. 추가적인 양상에 따르면, 구직자 선호도 코칭부는 구직자의 선호 요소별 선호점수와 구직자 선호 요소의 중요도를 추천 이유 제공 모듈로 전달하여, 사용자 단말로 구직자의 행동에서 비롯된 선호 요소와 행동에 영향을 주는 중요도를 코칭하도록 한다. 추가적인 양상에 따르면, 구직자 선호도 시각화부는 구직자 선호 요소들의 중요도와 구직자 선호 요소들의 선호점수를 각 구직자 선호 요소를 나타내는 도형의 면적과 도형이 기준선으로부터 떨어져 있는 거리를 이용하 여 나타낼 수 있는 데이터를 추천 이유 제공 모듈로 전달하여, 사용자 단말에서 시각화하도록 한다. 도 7은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구직자 선호도 결정 모듈에서 구직자 행동점수를 결정하는 방법과 구직자 선호 항목의 중요도를 결정하는 방법을 나타내 는 순서도이다. 구직자 행동을 분석하여 구직자 클러스터를 결정한다(S720). 구직자들은 직무분야, 경력연차, 직급 등 다양한 조건에 따라 행동 패턴이 각각 다르게 나올 수 있으므로, 구직자들의 행동 패턴을 기반으로 사용자들을 각각의클러스터로 분류하여 구직자가 선호하는 행동을 평가한다. 신규 구직자의 경우, 클러스터 구분 없이 전체 구직 자 기준으로 행동을 평가한다. 구직자 선호 행동과 비선호 행동을 분류하고, 구직자 선호 행동과 비선호 행동에 대해 각각 기준 행동을 선정한 다(S725). 기준 행동은 취업관련 행동 중에서 명확한 선호 행동과 비선호 행동으로 설정하며, 미리 설정된 기준 또는 외부 입력으로 결정할 수 있다. 예를 들어, 선호 행동 중에서 구인공고에 대한 '입사 지원'을 기본 선호 행동으로 결정할 수 있다. 비선호 행동의 기본 행동으로 구인공고에 대한 '싫어요 선택'을 선정할 수 있다. 구직자 선호 행동으로는 구인공고로의 입사지원, 구인공고에 대한 조회, 구인공고 스크랩, 구인공고를 한 구인 기업을 관심기업으로 지정, 추천받은 구인공고 탐색 등의 활동이 있다. 구직자 비선호 행동으로는 구인공고 '싫 어요' 선택, 구인공고를 한 구인기업에 대해 차단기업 지정, 추천받은 구인공고 무시 등이 있다. 구직자 클러스터별로 구직자 선호 행동과 비선호 행동에 대해, 기준 행동과의 연관도를 구하여 구직자 행동의 행동점수를 결정한다(S730). 기타 행동들의 행동점수는 기본 행동과의 연관도를 측정하여 결정할 수 있다. 기본 행동에 대한 각각의 행동의 연관도는 연관성 규칙 알고리즘 또는 상관관계 분석을 사용하여 구할 수 있다. 예를 들어, 구인공고에 대한 기본 선호 행동인 '입사 지원'을 10점으로 결정한 경우, 구인공고를 '스크랩'하는 행동 은 8점, 구인공고에 대한 '조회' 행동은 5점으로 결정할 수 있다. 구직자 선호 항목의 중요도를 결정하기 위해서는, 먼저 구인공고와 구직자 지원서류에서 구직자 선호 요소를 추 출한다(S740). 구직자 지원서류는 이력서, 자기소개서 등을 포함한다. 비정형 데이터의 구직자 선호 요소는 형 태소 분석기를 이용하여 추출할 수 있다. 구직자 선호 요소는 자격증, 스킬, 주요 키워드, 복지 등 취업에 영향 을 주는 항목 으로부터 추출할 수 있다. 구직자 선호 요소를 포함하는 구직자 선호 항목 내에서 구직자 선호 요소의 밀도를 구하여 구직자 선호 항목의 중요도를 결정한다(S750). 구직자 선호 요소의 밀도는 커널밀도추정(Kernel Density Estimation) 등을 이용하여 통계학적 기법으로 결정할 수 있으며, 일반적으로 동일한 항목에 속하는 구직자 선호 요소들의 종류가 적은 경 우 밀도가 높은 것으로 결정된다. 밀도가 높은 구직자 선호 항목에 대해 중요도(가중치)를 높게 결정하면, 해당 항목에 속한 구직자 선호 요소들의 구직자 선호도 결정시 가중치가 높게 반영된다. 도 8은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구직자 선호도 결정 모듈이 동작하는 방법을 나타내는 순서도이다. 입력된 구인공고에서 구직자 선호 요소를 추출한다(S810). 구직자 선호 요소는 형태소 분석기 등을 이용하여 추 출할 수 있다. 구직자 클러스터별 구직자 행동 점수를 결정한다(S830). 과거 구직자의 행동을 이용하여 분류된 구직자 클러스 터에서 구직자 행동들에 대해 결정된 점수를 전달받는다. 구직자 선호 항목의 중요도를 결정한다(S850). 구직자 또는 구직자가 속하는 직무 분야에서 구직자 선호 요소를 포함하는 구직자 선호 항목의 밀도를 이용하여 구한 중요도(가중치)를 전달받는다. 구직자 선호 요소에 대한 구직자 선호 행동에 대해 구직자 클러스터별 선호도 행동점수를 부여하고 구직자 선호 항목의 중요도를 반영하여 구직자 선호도를 결정한다(S870). 구직자 선호도는 각각의 구직자 선호 요소에 대한 구직자 선호 점수를 합하여 구할 수 있다. 구직자 선호도는 전체의 50%를 기본 점수로 하고, 각각의 구직자 선 호 요소에 대한 구직자 선호 점수를 더하고, 각각의 구직자 비선호 요소에 대한 점수를 빼서 결정할 수 있다. 구직자 선호 요소에 대한 코칭 요소를 산출한다(S880). 구직자 선호 점수와 중요도가 큰 구직자 선호 요소를 코 칭 요소로 산출할 수 있다. 산출된 코칭 요소는 추천 이유 제공 모듈을 통해서 구직자에게 제공되고, 구직 자는 구인공고에 있는 구직자 선호 요소를 반영하여 구직활동을 할 수 있다. 도 9는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구직자 선호도 결정 모듈에서 구직자 선호도를 결정하는 방법과 구직자 선호도를 시각화하는 방법을 설명하는 개념도이다. 도 9(a)는 구직자 선호 요소에 대한 선호도 점수의 예를 나타낸다. 구인공고에서 추출한 구직자 선호 요소의 선 호도 점수는 각 선호 요소에 대한 행동의 행동점수에 각 선호 요소의 항목 가중치를 곱하고 빈도를 곱해서 구할 수 있다. 도 9(b)는 구직자 행동의 행동점수의 예시를 나타내고, 도 9(c)는 구직자 선호 항목의 가중치의 예시를 나타낸 다. 도 9(a)를 참조하면, 구인공고에서 추출한 구직자 선호 요소 중 Java 스킬에 대해서, 과거에 구직자가 입사지원 을 2회 한 경우의 예시가 나타나 있다. 도 9(b)를 참조하면, 입사 지원 행동에 대해 행동점수가 10점으로 배정 된 경우가 예시되어 있고, 도 9(c)를 참조하면, 스킬 항목의 가중치는 0.5로 예시되어 있다. 이러한 경우 도 9(a)의 구직자 선호 요소 중 Java 스킬의 구직자 선호도는 10 * 0.5 * 2 = 10점이 된다. 도 9(a)에서 구직자 선 호 요소 중 재택 복지 항목에 대해 구직자의 조회 행동이 5회 이루어진 경우가 예시되어 있다. 이 경우에 구직 자 선호 요소 재택에 대한 선호도 점수는 5* 0.3 * 5 = 7.5점이 된다. 도 9(a)에서 전체 구직자 선호도는 구인공고에서 추출한 구직자 선호 요소의 모든 선호도 점수의 합 또는 평균 으로 구할 수 있다. 이때 선호도는 50점을 기준으로 선호도는 (+), 비선호도는 (-) 값을 부여할 수 있다. 도 9(a)를 참조하면, 선호도만 있으므로, 구직자 선호도는 50 +(10 + 15 + 7.5 + 5) = 50 + 37.5 = 87.5점으로 표 시할 수 있다. 도 9(d)는 구직자 선호 요소와 비선호 요소를 시각화한 예를 나타낸다. 구직자 선호 요소들은 테두리가 굵은 실 선으로 표시된 원형의 도형으로 나타내었으며, 점선으로 표시된 직선의 한쪽에 배치된다. 도 9(d)를 참조하면, 직선은 가로로 배치되어 있으며, 구직자 선호 요소들은 직선의 위쪽에 위치한다. 구직자 비선호 요소들을 직선 의 반대쪽 즉 아래쪽에 배치할 수 있다. 비선호 요소들은 선호 요소들의 도형과 테두리 또는 내부의 색이나 패 턴을 또는 도형의 형태를 다르게 표시할 수 있다. 도 9(d)를 참조하면, 구직자 비선호 요소들은 테두리가 점선 으로 표시된 원형의 도형으로 표시되었다. 구직자 선호/비선호 요소를 나타내는 도형은 원 이외에도, 타원, 다 각형, 별모양 등 다양한 형태를 사용할 수 있다. 도 9(d)를 참조하면, 직선으로부터 구직자 선호 요소를 나타내는 도형까지의 거리가 구직자 선호 요소에 대한 선호도 점수에 해당하도록 도시되었다. 또한 도형의 면적은 구직자 선호 요소의 가중치를 나타내도록 도시되었 다. 즉, 직선에서 가장 먼 위치에 있는 Python 선호 요소는 선호도 점수가 15점으로 가장 크다. 그리고 가중치 가 가장 작은 주요 키워드 항목의 선호 요소인 성실의 경우가 도형의 면적이 가장 작게 표현되었다. 이러한 그 래프를 이용하여 하나의 그래프에서 구직자의 선호 요소의 가중치와 선호도 점수를 동시에 파악할 수 있다. 선 호도 점수와 가중치를 동시에 표현하기 위해 직선의 각도를 바꾸거나 곡선으로 변형할 수 있고, 도형의 면적이 선호도 점수를 나타내도록 하는 등 다양한 변형을 적용할 수 있다. 구직자 선호 요소에 대한 선호도 점수 또는 가중치는 구직자가 변경하도록 할 수 있다. 예를 들어, 구직자는 사 용자 단말을 통해서 각각의 구직자 선호 요소를 나타내는 도형의 크기를 변경하여 구직자 선호 항목의 가중치를 변경할 수 있다. 사용자 단말로부터 구직자 선호 요소를 나타내는 도형의 크기 변화 정보가 입력되는 경우, 구 직자 선호도 시각화부는 변경된 구직자 선호 요소 정보를 구직자 선호도 결정부로 전달한다. 구직자 선호도 결정부는 변경된 가중치를 이용하여 구직자 선호도를 갱신할 수 있다. 갱신된 구직자 선호도는 구 직자 선호도 시각화부를 통해서 사용자 단말로 전달된다. 구직자는 사용자 단말을 통해서 변경된 구직자 선호도를 확인할 수 있다. 한편, 구직자가 각각의 구직자 선호 요소의 선호도 점수를 직접 수정하려는 경우, 사용자 단말을 통해서 각각의 구직자 선호 요소를 나타내는 도형의 직선으로부터의 거리를 조정할 수 있다. 이 경우 구직자 선호도 시각화부 는 각각의 구직자 선호 요소의 선호도 점수를 이용하여 구직자 선호도를 갱신하고, 이를 사용자 단말로 전 송할 수 있다. 도 10은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 스킬 적합도 결정 모듈의 구성을 나타내는 구성도이다. 일 실시예에 따르면, 스킬 적합도 결정 모듈은 구직자 스킬 추출부와, 구직자 스킬 숙련도 결정부 와, 구인공고 분류부와, 구인공고 스킬 중요도 결정부와, 스킬 사분면 결정부와, 스킬 적합도 결정부와, 스킬 적합도 코칭부와, 스킬 적합도 시각화부를 포함할 수 있다. 추가적인 양상에 따르면, 구직자 스킬 추출부는 구직자 지원서류에서 스킬을 추출한다. 형태소 분석기를 포함하여 이력서, 자기소개서 등 구직자 지원서류의 비정형 항목에서도 스킬 항목을 추출할 수 있다. 추가적인 양상에 따르면, 스킬 숙련도 결정부는 구직자 지원서류의 스킬 빈도 또는 위치를 반영하여 구직 자의 스킬 숙련도를 결정한다. 예를 들어, 구직자 지원서류에 나타난 스킬 횟수, 경력에 나타난 스킬 사용 기간 등을 이용하여 숙련도를 결정할 수 있다. 추가적인 양상에 따르면, 구인공고 분류부는 구인공고에서 직무 분야 등 스킬 중요도에 영향을 주는 항목 을 추출하고, 그 항목에 따라 구인공고를 분류할 수 있다. 추가적인 양상에 따르면, 구인공고 스킬 중요도 결정부는 스킬 중요도 산출 모델을 포함하여, 구인공고에 서 추출한 스킬의 중요도를 결정할 수 있다. 스킬 중요도 산출 모델은 과거 구인공고에서 추출한 스킬과 과거 구인공고에 지원하여 취업에 성공한 구직자의 지원서류에서 추출한 스킬의 매칭 패턴을 이용하여, 구인공고에서 추출한 스킬의 중요도를 결정한다. 스킬의 중요도는 구인공고가 속하는 직무분야마다 다르므로, 직무분야마다 별도로 스킬 중요도 산출 모델을 구성하는 것이 바람직하다. 스킬 중요도 산출 모델은 예를 들어, 제목에 나타 난 스킬, 본문에 2회 이상 나타난 스킬, '가점, 우대사항' 등의 특정 문구와 함께 나타난 스킬 등의 매칭 패턴 에 해당하는 스킬 대해 스킬 중요도를 높게 결정할 수 있다. 추가적인 양상에 따르면, 스킬 사분면 결정부는 구인공고에서 추출한 스킬의 중요도를 확인하고, 구인공 고에서 추출한 스킬에 대해 구직자 지원서류에서 추출한 스킬과 매칭되는지 여부를 확인하여, 구인공고에서 추 출한 스킬들을 매칭되고 중요한 스킬, 매칭되고 덜 중요한 스킬, 매칭 안되고 중요한 스킬, 매칭 안되고 덜 중 요한 스킬로 분류하는 스킬 사분면을 결정한다. 추가적인 양상에 따르면, 스킬 적합도 결정부는 구인공고에서 추출된 스킬들에 대하여, 스킬 중요도와, 구직자 지원서류에서 추출된 스킬과의 매칭 여부와, 구인공고 스킬에 대해 구직자 지원서류에서 추출한 구직자 의 스킬 숙련도를 이용하여 스킬 적합도를 결정한다. 추가적인 양상에 따르면, 스킬 적합도 코칭부는 구인공고에서 추출한 중요한 스킬 중에서, 구직자 스킬과 매칭이 되고 숙련도가 높은 스킬, 매칭이 안된 스킬, 숙련도가 낮은 스킬 등을 코칭 요소로 결정하여 추천 이유 제공 모듈로 전달할 수 있다. 추천 이유 제공 모듈은 코칭 요소를 이용하여 구인공고를 추천하는 이 유를 설명하거나, 구직자 스킬에서 보완할 점을 코칭할 수 있다. 추가적인 양상에 따르면, 스킬 적합도 시각화부는 구인공고의 스킬을 스킬 사분면에 따라 분류하고, 서로 다른 색, 모양, 패턴을 이용하여 표시하거나, 스킬들의 숙련도를 비교하는 그래프를 표시하기 위한 데이터를 추 천 이유 제공 모듈 등을 통해서 사용자 단말로 전달할 수 있다. 도 11은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 스킬 적합도 결정 모듈에서 스킬 중요도를 결정하는 방법을 나타내는 순서도이다. 입력된 구인공고를 분석하여 구인공고를 분류한다(S1110). 인재의 스킬은 직무 분야마다 중요도가 다르게 여겨 지므로, 구인공고를 직무 분야에 따라 분류하는 것이 바람직하다. 구인공고에서 직무 분야 등 스킬 중요도에 영 향을 주는 항목을 추출하고, 그 항목에 따라 구인공고를 분류할 수 있다. 과거 구인공고와 관련된 합격자 지원서류에서 스킬을 추출한다(S1130). 형태소 분석기 등을 이용하여 합격자 지 원서류에서 스킬 항목을 추출할 수 있다. 과거 구인공고와 합격자 스킬의 매칭 패턴을 이용하여 구인공고에서 스킬 중요도를 산출하는 모델을 결정한다 (S1150). 합격자 스킬이 구인공고에 나타나는 패턴(위치, 횟수 등)을 이용하여 구인공고에 나타난 스킬에 대해 스킬 중요도를 산출하는 모델을 결정할 수 있다. 스킬 중요도 산출 모델은 예를 들어, 제목에 나타난 스킬, 본 문에 2회 이상 나타난 스킬, '가점, 우대사항' 등의 특정 문구와 함께 나타난 스킬 등에 대해 스킬 중요도를 높 게 결정할 수 있다. 도 12는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 스킬 적합도 결정 모듈이 동작하는 방법을 나타내는 순서도이다. 입력된 구인공고를 분석하여 구인공고를 분류한다(S1210). 구인공고를 스킬 중요도 산출 모델 결정시의 구인공 고 분류 방법과 동일한 방법을 이용하여 구인공고를 분류한다. 구인공고 분류에 따라 스킬 중요도 산출 모델을 결정한다(S1230). 구인공고에서 스킬을 추출하고, 구인공고 분류에 따른 스킬 중요도 산출 모델을 이용하여 구 인공고에서 추출된 스킬의 중요도를 결정한다(S1250). 구직자 지원서류에서 스킬을 추출한다(S1220). 형태소 분석기 등을 이용하여 구직자 지원서류에서 스킬 항목을 추출할 수 있다. 구직자 스킬의 숙련도를 결정한다(S1240). 구직자 지원서류에 나타난 스킬 항목의 패턴을 파악하여 구직자 스킬 의 숙련도를 결정한다. 예를 들어, 구직자 지원서류에 나타난 스킬 횟수, 경력에 나타난 스킬 사용 기간 등을이용하여 숙련도를 결정할 수 있다. 구인공고에서 추출한 스킬과 구직자 지원서류에서 추출한 스킬을 비교하여 매칭여부 확인하여 스킬 사분면을 결 정한다(S1260). 구인공고에서 추출한 스킬에 대하여 스킬 중요도가 스킬 기준점수 이상인 스킬을 중요한 스킬, 나머지 스킬을 덜 중요한 스킬로 결정한다. 구인공고에서 추출한 스킬 중 구직자 지원서류에서 추출한 스킬과 매칭되는 스킬은 매칭된 스킬, 나머지 스킬을 매칭 안된 스킬로 결정한다. 구인공고에서 추출한 스킬은 매칭된 중요한 스킬, 매칭된 덜 중요한 스킬, 매칭 안된 중요한 스킬, 매칭 안된 덜 중요한 스킬의 4가지 종류로 나누 어 배치할 수 있는데, 이렇게 분류한 것을 스킬 사분면이라 한다. 스킬 숙련도와 스킬 사분면을 이용하여 스킬 적합도를 결정한다(S1270). 각 스킬의 적합도 점수는 각 스킬의 중 요도 또는 숙련도에 사분면의 가중치를 반영하여 결정할 수 있다. 매칭된 스킬의 적합도 점수는 각 스킬의 숙련 도에 사분면의 가중치를 곱하거나, 각 스킬의 중요도와 숙련도의 평균에 사분면의 가중치를 곱하는 방법 등을 이용하여 결정할 수 있다. 매칭 안된 스킬은 숙련도가 0 이므로, 각 스킬의 중요도에 사분면의 가중치를 반영하 여 적합도 점수를 결정할 수 있다. 사분면의 가중치는 예를 들어, 매칭된 중요한 스킬에는 1, 매칭된 덜 중요한 스킬에는 0.5, 매칭 안된 중요한 스킬에는 -0.75, 매칭 안된 덜 중요한 스킬에는 0.1을 배정할 수 있다. 전체 스킬 적합도는 각 스킬의 스킬 적합도 점수를 더하거나 평균하여 결정할 수 있다. 스킬 적합도에 대한 코칭 요소를 산출한다(S1280). 코칭 요소는 중요한 스킬 중에서 매칭이 되고 숙련도가 높은 스킬, 매칭이 안된 스킬과 숙련도가 낮은 스킬 등이다. 코칭 요소는 추천 이유 제공 모듈로 전달되어, 구 직자에게 중요하고 매칭되며 숙련도가 높은 스킬을 통해서 구인공고를 추천하는 이유를 설명하거나, 중요하나 매칭이 안된 스킬과 숙련도가 낮은 스킬 등 보완점을 코칭하기 위해 사용될 수 있다. 도 13은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 스킬 적합도 결정 모듈이 스킬 적합도를 결정하는 방법과 스킬 적합도를 시각화하는 방법을 설명하는 개념도이다. 도 13(a)는 스킬 사분면의 예를 나타낸다. 도 13(a)를 참조하면, 구인공고에서 중요한 스킬은 Java, 개발, Linux, DL, Hadoop이고, 중요하지 않은 스킬로는 SQL, 분석, Python이 있다. 이중에서 구직자의 지원서류에서 추출된 스킬과 매칭되는 스킬은 Java, 개발, Linux, DL, SQL이다. 따라서, 중요하고 매칭되는 스킬은 Java, 개 발, Linux, DL이고, 중요하지만 매칭되지 않는 스킬은 Hadoop이고, 중요하지 않지만 매칭되는 스킬은 SQL이다. 분석과 Python은 중요하지도 매칭되지도 않는 스킬이다. 도 13(b)는 각 스킬의 중요도 및 숙련도와 사분면에 따른 점수와 각 스킬의 적합도 점수의 예시를 나타낸다. 매 칭된 스킬의 적합도 점수는 각 스킬의 숙련도 점수에 사분면 가중치를 곱하여 구하고, 매칭 안된 스킬의 적합도 점수는 각 스킬의 중요도 점수에 사분면 가중치를 곱하여 구할 수 있다. 중요하고 매칭되는 사분면의 경우 가중 치로 1이 배정되어, 숙련도가 10점인 Java 스킬은 스킬 적합도 점수가 10점이 되고, 숙련도가 3점인 DL 스킬은 스킬 적합도 점수가 3점이 된다. 중요하지 않지만 매칭되는 스킬 사분면의 경우 가중치로 0.5가 배정되어, 스킬 숙련도가 8점인 SQL 스킬은 스킬 적합도 점수가 4점이 된다. 중요하지만 매칭되지 않는 사분면에는 가중치로 -0.75점이 배정되며, 매칭되지 않은 Hadoop의 중요도가 6점이므로 스킬 숙련도 점수는 -4.5점이 된다. 도 13(c)는 중요하거나 매칭되는 스킬인 6개의 Java, 개발, Linux, DL, SQL, Hadoop 스킬에 대해 도 13(b)를 참조하여 각 스킬의 적합도 점수를 방사상 그래프에 굵은 선으로 표시한 예를 나타낸다. 도 13(c)의 예에서는, 방사상 그래프의 외곽선을 +10점, 중심점을 -10점으로 표시하였다. 전체 스킬 적합도는 각 스킬의 적합도 점수의 합 또는 평균으로 구할 수 있다. 도 13(b)를 참조하면, 중요하거 나 매칭된 6개 스킬에 대해 (10+8+6+3+4-4.5)/60 = 26.5점/60 = 44.2% 이므로, 스킬 적합도는 26.5점 또는 44.2% 등으로 나타낼 수 있다. 각 스킬의 스킬 적합도 점수는 추천 이유 제공 모듈로 전달되어 다양한 그 래프를 이용하여 시각화 또는 출력할 수 있다. 도 14는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템에서 알고리즘 분 석 모듈의 구성을 나타내는 구성도이다. 알고리즘 분석 모듈은 협업필터링 분석부와, 장바구니 분석부와, 컨텐츠 기반 분석부와, 세그먼트 분석부와, Item2Vec 분석부와, 행렬 분해 분석부를 포함할 수 있 다. 협업필터링 분석부는 구인공고를 협업 필터링 알고리즘을 이용하여 추천하는 경우, 구직자간 유사도를 결 정한다. 협업 필터링 알고리즘은 각 항목에 대한 사용자의 선호도가 시간에 따라 변하지 않는다는 가정을 바탕으로 유사도를 측정하여 항목을 추천하는 방법이다. 입사지원, 공고 조회, 스크랩 등 구직자들의 구인공고에 대 한 일련의 행동을 기반으로 선호도가 유사한 구직자들을 분석한다. 그리고 이 분석 결과를 활용하여, 새로운 구 직자에 대해서 해당 구직자와 선호도가 유사한 구직자들이 행동했던 공고를 추천해준다. 분석 과정에서 구직자- 공고의 매트릭스를 생성하는데, 매트릭스를 활용하여 유사도를 계산하고 이를 기반으로 추천 후보 공고들에 대 한 점수를 결정한다. 장바구니 분석부는 구인공고를 장바구니 분석 알고리즘을 이용하여 추천하는 경우, 구직자의 행동 데이터 로부터 공고의 연관성을 분석하여 지지도와 신뢰도를 결정하여 추천 공고에 대한 점수를 결정한다. 장바구니 분 석 알고리즘은 연관성 규칙 알고리즘으로도 불리며, 구직자를 하나의 장바구니로 보고 입사지원, 공고 조회, 스 크랩 등 취업 활동한 공고들 간의 연관성을 분석하여 연관 규칙을 생성한다. &quot;항목A가 구매된 경우는 항목 B도 구매된다&quot;는 연관 규칙을 수치적으로 표현하기 위해 지지도(Support), 신뢰도(Confidence), 향상도 (Lift)라는 3가지 방법을 사용할 수 있다. 예를 들어 약 한달 간의 모든 구직자 행동을 수집하여 연관성을 분석 할 수 있고, 3가지 항목을 적절히 조합하여 추천 공고에 대한 점수를 결정하고 이를 기반으로 추천 후보군을 생 성할 수 있다. 예를 들어, 지지도는 공고 A와 공고 B를 동시에 지원하는 확률로, 공고 A와 공고 B를 동시에 지 원하는 구직자수를 전체 구직자 수로 나누어 구할 수 있다. 신뢰도는 공고 A가 선택되었을 경우 다른 공고 B가 선택될 확률로, 공고 A와 공고 B를 동시에 지원하는 구직자수를 공고 A의 지원자수로 나누어 구할 수 있다. 컨텐츠 기반 분석부는 공고의 컨텐츠를 기반으로 공고들 간의 유사성을 분석하는 알고리즘이다. 공고에 있는 다양한 컨텐츠를 형태소 분석기로 유의미한 키워드를 추출하고, 추출된 키워드를 기반으로 공고들 사이의 유사도를 계산한다. 공고에서 추출된 키워드들의 점수를 산출할 때에는 구직자 행동 종류에 따른 가중치, 키워 드 등장 횟수, 시간 관성 요소를 종합적으로 고려할 수 있다. 이를 기반으로 키워드 별로 대표 점수를 산정하고, 산정된 수치들을 기반으로 벡터화 하여 공고 간의 유사도를 수학적으로 계산한다. 그 결과로 계산된 유사도를 추천 후보군 공고에 대한 점수로서 결정한다. 세그먼트 분석부는 세그먼트(Segment) 분석은 경력 연차, 직무분야, 나이 등 채용 기준 정보로 다양한 조 합을 만들고, 조합 조건을 기반으로 구직자들을 분류한다. 채용 기준은 성별, 경력 연차, 지역, 학력, 직무분야 기준을 사용할 수 있다. 기준의 개수가 증가하면, 조합의 수가 급격하게 많아져서 각 조합에 해당하는 구직자의 수가 적어진다는 단점이 있으므로, 채용의 성격을 잘 반영하면서 분석의 품질이 적절하게 보장될 수 있도록 기 준을 결정한다. 그 이후에 조합 별로 인기 공고 등과 같은 대표할 만한 공고 후보군들을 만들고, 이를 기반으로 구직자에게 해당되는 조합의 대표 공고들을 추천한다. Item2Vec 분석부는 사용자가 지원한 공고(item) 이력 관계를 embedding 한 후, 공고 embedding간 유사도 를 계산하여 최종적으로 추천한다. 행렬 분해 분석부는 구직자와, 사용자의 행동(조회, 지원, 스크랩 등) 점수 기반으로 구성된 메트릭스를 User Latent Matrix, Item Latent Matrix로 분리한 후 사용자가 행동하지 않는 공고에 대해 점수를 채워 추천 해주는 방식이다. 직무성향 분석 모듈은 직무성향에 대한 인적성 검사 정보를 바탕으로 공고의 직무와 구직자의 성향이 매칭 되는 정도를 구한다. Holland 성격이론에서는 성격을 현실형, 탐구형, 예술형, 사회형, 진취형, 관습형의 6가지로 분류한다. HEXACO 성격이론에서는 성격을 정직성, 정서성, 외향성, 원만성, 성실성, 개방성의 6대 요인으로 분류하고, 각 요인은 4개의 하위 척도로 구분할 수 있다. 예를 들어, 개방성은 심미성, 지적호기심, 창조성, 비관습성으로 분류할 수 있다. 직무 성향에 대한 Holland 및 HEXACO 점수 또는 별도의 분석 척도를 이용하여 직무성향 점수를 결정할 수 있다. 예를들어 Holland의 탐구형 점수와 현실성 점수와 관습형 점수의 평균을 체계성 점수로 설정하여, 직무성향 점 수에 반영할 수 있다. 제안된 발명의 또 다른 양상에 따르면, 구인공고 추천 방법은 구인기업 선호도 결정 단계와, 구직자 선호도 결 정 단계와, 구인공고 추천 단계와, 추천 이유 제공 단계를 포함한다. 구인기업 선호도 결정 단계는 구직자 지원서류에서 추출한 구인기업 선호 요소와, 구인공고와 동일 분야의 과거 구인공고들에 대한 구직자들의 지원 결과 데이터를 이용하여 구직자에 대한 구인기업 선호도를 구한다. 구직자 선호도 결정 단계는 구인공고에서 추출한 구직자 선호 요소에 대한 과거 구직자의 취업관련 행동 데이터를 이용 하여 상기 구인공고에 대한 구직자 선호도를 구한다. 구인공고 추천 단계는 구인기업 선호도와 구직자 선호도를이용하여 구인공고 추천점수를 구하고, 구인공고 추천점수가 추천 기준값 이상인 구인공고 리스트를 구직자 단 말로 제공한다. 추천 이유 제공 단계는 구인공고 리스트 중에서 구직자로부터 선택된 구인공고에 대해 구인기업 선호도와 구직자 선호도를 포함하는 상세 추천이유를 제공한다. 제안된 발명의 다른 양상에 따르면, 구인공고 추천 시스템은 프로세서와, 메모리 또는 기록매체를 포함한다. 메 모리 또는 기록매체에는 프로세서가 수행할 명령 프로그램이 저장될 수 있다. 프로세서는 메모리 또는 기록매체 게 기록된 명령 프로그램에 의해 구인공고 추천 방법을 수행할 수 있다. 이상에서 본 발명을 첨부된 도면을 참조하는 실시예들을 통해 설명하였지만 이에 한정되는 것은 아니며, 이들로 부터 당업자라면 자명하게 도출할 수 있는 다양한 변형예들을 포괄하도록 해석되어야 한다. 특허청구범위는 이 러한 변형예들을 포괄하도록 의도되었다."}
{"patent_id": "10-2022-0147741", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템의 전체적인 구성 을 개략적으로 나타내는 구성도이다. 도 2는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구인기업 선호 도 결정 모듈의 구성을 나타내는 구성도이다. 도 3은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구인기업 선호 도 결정 모듈이 동작하는 방법을 나타내는 순서도이다. 도 4는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구인기업 선호 도 결정 모듈의 인공지능 기업선호도 모델을 학습시키는 방법을 나타내는 순서도이다. 도 5는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구인기업 선호 도 결정 모듈에서 구인기업 선호도를 결정하는 방법과 구인기업 선호도를 시각화하는 방법을 설명하는 개념도이 다. 도 6은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구직자 선호도 결정 모듈의 구성을 나타내는 구성도이다. 도 7은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구직자 선호도 결정 모듈에서 구직자 행동점수를 결정하는 방법과 구직자 선호 항목의 중요도를 결정하는 방법을 나타내 는 순서도이다. 도 8은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구직자 선호도 결정 모듈에서 구직자 행동점수를 결정하는 방법을 나타내는 순서도이다. 도 9는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 구직자 선호도 결정 모듈에서 구직자 선호도를 결정하는 방법과 구직자 선호도를 시각화하는 방법을 설명하는 개념도이다. 도 10은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 스킬 적합도 결정 모듈의 구성을 나타내는 구성도이다. 도 11은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 스킬 적합도 결정 모듈이 동작하는 방법을 나타내는 순서도이다. 도 12는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 스킬 적합도 결정 모듈에서 스킬 중요도를 결정하는 방법을 나타내는 순서도이다. 도 13은 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템 중 스킬 적합도 결정 모듈에서 스킬 적합도를 결정하는 방법과 스킬 적합도를 시각화하는 방법을 설명하는 개념도이다. 도 14는 일 실시예에 따른 양방향 분석을 통해 구직자에게 적합한 구인공고를 추천하는 시스템에서 알고리즘 분 석 모듈의 구성을 나타내는 구성도이다."}
