{"patent_id": "10-2023-0128332", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0015663", "출원번호": "10-2023-0128332", "발명의 명칭": "가상 공간 내에서 어플리케이션에 관한 시각적 객체를 표시하기 위한 전자 장치, 방법, 및 컴", "출원인": "삼성전자주식회사", "발명자": "김상헌"}}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웨어러블 장치(wearable device)에 있어서, 디스플레이(display); 적어도 하나의 센서(sensor); 인스트럭션들을 저장하는 메모리(memory); 및상기 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 제1 가상 공간이 표시되는 동안, 상기 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을식별하고, 상기 제1 가상 공간 내에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하고, 상기 제1 어플리케이션의 실행에 기반하여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2가상 공간으로 전환하고, 상기 제2 가상 공간이 표시되는 동안, 상기 적어도 하나의 어플리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별하고, 사용자의 시선이 향하는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블장치의 모션을 식별하고, 상기 웨어러블 장치의 상기 모션에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향하는 제2방향에 기반하여, 상기 제2 가상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체를 표시하도록 설정된,웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 시각적 객체에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간의 상기 제2 부분 내의 지정된 영역 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하도록 더 설정된, 웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때,상기 시각적 객체에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간으로부터, 상기 제2 어플리케이션이 실행되는 상기 제1 가상 공간으로의 전환을 수행하고, 상기 제1 가상 공간 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하도록 더 설정된,웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2025-0015663-3-제1 항에 있어서, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때,상기 제2 가상 공간의 상기 제1 부분 내의 지정된 영역 상에서, 상기 제2 가상 공간과 구별되는 적어도 하나의가상 공간 내에서 실행 중인 하나 이상의 어플리케이션들에 관한 하나 이상의 요소(element)들을 포함하는 객체를 표시하도록 더 설정된,웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 하나 이상의 요소들 중, 상기 제2 어플리케이션에 관한 요소에 대한 입력을 식별하고, 상기 요소에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간 내의 상기 제1 부분 내에서, 상기 제2어플리케이션에 관한 인터페이스를 표시하도록 더 설정된,웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서, 상기 요소는, 상기 제2 어플리케이션에 관한 동작의 실행 정보에 기반하여 표시되는, 웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4 항에 있어서, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때,상기 객체를 제거하기 위한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간 내의 상기 제1 부분 내에서,상기 제2 어플리케이션에 관한 인터페이스를 표시하도록 더 설정된,웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4 항에 있어서, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때,상기 제2 가상 공간으로부터 상기 제1 가상 공간으로의 전환을 위한 입력을 식별하는 것에 기반하여, 상기 제1가상 공간 내에서 표시되는 상기 객체 내에서 상기 요소를 제거하도록 더 설정된,웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 제2 방향에 기반하여, 상기 제2 가상 공간의 상기 제2 부분 내에서 상기 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스를 표시하도록 더 설정된, 웨어러블 장치. 공개특허 10-2025-0015663-4-청구항 10 제1 항에 있어서, 상기 제1 가상 공간은, 상기 적어도 하나의 어플리케이션의 실행을 위한 적어도 하나의 영역을 포함하도록 구성되고, 상기 제2 가상 공간은, 상기 제1 어플리케이션에 관한 인터페이스를 제공하도록 구성된, 웨어러블 장치."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "웨어러블 장치의 방법에 있어서, 제1 가상 공간이 표시되는 동안, 상기 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을 식별하는동작; 상기 제1 가상 공간 내에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하는 동작; 상기 제1 어플리케이션의 실행에 기반하여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2가상 공간으로 전환하는 동작; 상기 제2 가상 공간이 표시되는 동안, 상기 적어도 하나의 어플리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별하는 동작; 사용자의 시선이 향하는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블장치의 모션을 식별하는 동작; 및상기 웨어러블 장치의 상기 모션에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향하는 제2방향에 기반하여, 상기 제2 가상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체를 표시하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서, 상기 방법은, 상기 시각적 객체에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간의 상기 제2 부분 내의 지정된 영역 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11 항에 있어서, 상기 방법은, 상기 시각적 객체에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간으로부터, 상기 제2 어플리케이션이 실행되는 상기 제1 가상 공간으로의 전환을 수행하는 동작; 및 상기 제1 가상 공간 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하는 동작을 더 포함하는,방법."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2025-0015663-5-제11 항에 있어서, 상기 방법은, 상기 제2 가상 공간의 상기 제1 부분 내의 지정된 영역 상에서, 상기 제2 가상 공간과 구별되는 하나 이상의 가상 공간들 내에서 실행 중인 하나 이상의 어플리케이션들에 관한 하나 이상의 요소(element)들을 포함하는 객체를 표시하는 동작을 더 포함하는,방법."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서, 상기 방법은,상기 하나 이상의 요소들 중, 상기 제2 어플리케이션에 관한 요소에 대한 입력을 식별하는 동작; 및 상기 요소에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간 내의 상기 제1 부분 내에서, 상기 제2어플리케이션의 인터페이스를 표시하는 동작을 더 포함하는,방법."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14 항에 있어서, 상기 요소는, 상기 제2 어플리케이션에 관한 동작의 실행 정보에 기반하여 표시되는, 방법."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14 항에 있어서, 상기 방법은, 상기 객체를 제거하기 위한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간 내의 상기 제1 부분 내에서,상기 제2 어플리케이션에 관한 인터페이스를 표시하는 동작을 더 포함하는,방법."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제14 항에 있어서, 상기 방법은,상기 제2 가상 공간으로부터 상기 제1 가상 공간으로의 전환을 위한 입력을 식별하는 것에 기반하여, 상기 제1가상 공간 내에서 표시되는 상기 객체 내에서 상기 요소를 제거하는 동작을 더 포함하는,방법."}
{"patent_id": "10-2023-0128332", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11 항에 있어서, 상기 방법은,상기 제2 방향에 기반하여, 상기 제2 가상 공간의 상기 제2 부분 내에서 상기 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스를 표시하는 동작을 더 포함하는,방법. 공개특허 10-2025-0015663-6-청구항 20 하나 이상의 프로그램들을 저장하는 비일시적 컴퓨터 판독가능 저장 매체(non-transitory computer readablestorage medium)에 있어서, 상기 하나 이상의 프로그램들은, 디스플레이, 적어도 하나의 센서를 가지는(with)웨어러블 장치의 적어도 하나의 프로세서에 의해 실행될 시,제1 가상 공간이 표시되는 동안, 상기 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을식별하고, 상기 제1 가상 공간 내에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하고,상기 제1 어플리케이션의 실행에 기반하여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2가상 공간으로 전환하고, 상기 제2 가상 공간이 표시되는 동안, 상기 적어도 하나의 어플리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별하고, 사용자의 시선이 향하는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블장치의 모션을 식별하고, 상기 웨어러블 장치의 상기 모션에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향하는 제2방향에 기반하여, 상기 제2 가상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체를 표시하도록 상기 웨어러블 장치를 야기하는 인스트럭션들을 포함하는컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2023-0128332", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시 예에 따르면, 웨어러블 장치(wearable device)는, 디스플레이(display), 적어도 하나의 센서(sensor), 인스트럭션들을 저장하는 메모리(memory), 및 상기 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나 의 프로세서는 상기 인스트럭션들이 실행될 때, 제1 가상 공간이 표시되는 동안, 상기 제1 가상 공간 내에서 실 (뒷면에 계속)"}
{"patent_id": "10-2023-0128332", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명들은, 가상 공간 내에서 어플리케이션에 관한 시각적 객체를 표시하기 위한 전자 장치, 방법, 및 컴 퓨터 판독 가능 저장 매체에 관한 것이다."}
{"patent_id": "10-2023-0128332", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "강화된(enhanced) 사용자 경험(user experience)을 제공하기 위해, 실제 세계(real-world) 내 외부 객체와 연 계로 컴퓨터에 의해 생성된 정보를 표시하는 증강 현실(augmented reality, AR), 및/또는 가상 현실(virtual reality, VR) 서비스를 제공하는 전자 장치가 개발되고 있다. 상기 전자 장치는, 사용자에 의해 착용될 수 있는 웨어러블 장치일 수 있다. 예를 들면, 상기 전자 장치는, AR 안경(glasses), 및/또는 머리 착용형 장치(head- mounted device, HMD)일 수 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련된 종래 기술(prior art)로서 적용될 수 있는지에 대하여 어떠한 주장이 나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0128332", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예에 따르면, 웨어러블 장치(wearable device)는, 디스플레이(display), 적어도 하나의 센서(sensor), 인스트럭션들을 저장하는 메모리(memory), 및 상기 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하 나의 프로세서는, 상기 인스트럭션들이 실행될 때, 제1 가상 공간이 표시되는 동안, 상기 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을 식별하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 인 스트럭션들이 실행될 때, 상기 제1 가상 공간 내에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하도록 설 정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 인스트럭션들이 실행될 때, 상기 제1 어플리케이션의 실행 에 기반하여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2 가상 공간으로 전환하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 인스트럭션들이 실행될 때, 상기 제2 가상 공간이 표시되 는 동안, 상기 적어도 하나의 어플리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별 하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 사용자의 시선이 향하 는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블 장치의 모션을 식별하 도록 설정될 수 있다. 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 웨어러블 장치의 상기 모션에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향하는 제2 방향에 기반하여, 상 기 제2 가상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체를 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 웨어러블 장치의 방법은, 제1 가상 공간이 표시되는 동안, 상기 제1 가상 공간 내에서 실 행 중인 적어도 하나의 어플리케이션을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 가상 공간 내 에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 어플 리케이션의 실행에 기반하여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2 가상 공간으 로 전환하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 가상 공간이 표시되는 동안, 상기 적어도 하나의 어플리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별하는 동작을 포함할 수 있다. 상기 방법은, 사용자의 시선이 향하는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블 장치의 모션을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 웨어러블 장치의 상기 모션 에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향하는 제2 방향에 기반하여, 상기 제2 가 상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체를 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 비일시적 컴퓨터 판독가능 저장 매체(non-transitory computer readable storage medium)는, 하나 이상의 프로그램들을 저장할 수 있다. 상기 하나 이상의 프로그램들은, 디스플레이, 적어도 하 나의 센서를 가지는(with) 웨어러블 장치의 적어도 하나의 프로세서에 의해 실행될 시, 제1 가상 공간이 표시되 는 동안, 상기 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을 식별하도록 상기 웨어러블 장치 를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상기 적어 도 하나의 프로세서에 의해 실행될 시, 상기 제1 가상 공간 내에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하도록 상기 웨어러블 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상기 적어도 하나의 프로세서에 의해 실행될 시, 상기 제1 어플리케이션의 실행에 기반하 여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2 가상 공간으로 전환하도록 상기 웨어러 블 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상 기 적어도 하나의 프로세서에 의해 실행될 시, 상기 제2 가상 공간이 표시되는 동안, 상기 적어도 하나의 어플 리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별하도록 상기 웨어러블 장치를 야기 하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상기 적어도 하나 의 프로세서에 의해 실행될 시, 사용자의 시선이 향하는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블 장치의 모션을 식별하도록 상기 웨어러블 장치를 야기하는 인스트럭션들을 포함 할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상기 적어도 하나의 프로세서에 의해 실행 될 시, 상기 웨어러블 장치의 상기 모션에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향 하는 제2 방향에 기반하여, 상기 제2 가상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체 를 표시하도록 상기 웨어러블 장치를 야기하는 인스트럭션들을 포함할 수 있다."}
{"patent_id": "10-2023-0128332", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으 며 여기에서 설명하는 실시예에 한정되지 않는다. 도면의 설명과 관련하여, 동일하거나 유사한 구성요소에 대해 서는 동일하거나 유사한 참조 부호가 사용될 수 있다. 또한, 도면 및 관련된 설명에서는, 잘 알려진 기능 및 구 성에 대한 설명이 명확성과 간결성을 위해 생략될 수 있다. 도 1은, 일 실시 예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참고하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세 서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서 는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈 , 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)과 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통 신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO(full dimensional MIMO)), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안 테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전 자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지 원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다 른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 일 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지 정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안 테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또 는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청 할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있 다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a 및 도 2b는, 일 실시예에 따른, 웨어러블 장치의 사시도의 일 예를 도시한다. 일 실시예에 따른, 웨어러블 장치는, 사용자의 신체 부위(예, 머리) 상에 착용 가능한(wearable on), 안경 의 형태를 가질 수 있다. 도 2a 내지 도 2b의 웨어러블 장치는, 도 1의 전자 장치의 일 예일 수 있다. 웨어러블 장치는, HMD(head-mounted display)를 포함할 수 있다. 예를 들어, 웨어러블 장치의 하우징은 사용자의 머리의 일부분(예를 들어, 두 눈을 감싸는 얼굴의 일부분)에 밀착되는 형태를 가지는 고무, 및/또는 실리콘과 같은 유연성 소재(flexible material)를 포함할 수 있다. 예를 들어, 웨어러블 장치의 하우징은 사용자의 머리에 감길 수 있는(able to be twined around) 하나 이상의 스트랩들, 및/또는 상기 머리 의 귀로 탈착 가능한(attachable to) 하나 이상의 템플들(temples)을 포함할 수 있다. 도 2a를 참고하면, 일 실시예에 따른, 웨어러블 장치는, 적어도 하나의 디스플레이, 및 적어도 하나 의 디스플레이를 지지하는 프레임을 포함할 수 있다. 일 실시예에 따른, 웨어러블 장치는 사용자의 신체의 일부 상에 착용될 수 있다. 웨어러블 장치는, 웨어러블 장치를 착용한 사용자에게, 증강 현실(AR), 가상 현실(VR), 또는 증강 현실과 가상 현실을 혼합한 혼합 현실(MR)을 제공할 수 있다. 예를 들면, 웨어러블 장치는, 도 2b의 동작 인식 카메라(260-2, 260- 3)를 통해 획득된 사용자의 지정된 제스처에 응답하여, 도 2b의 적어도 하나의 광학 장치(282, 284)에서 제공되 는 가상 현실 영상을 적어도 하나의 디스플레이에 표시할 수 있다. 일 실시예에 따르면, 적어도 하나의 디스플레이는, 사용자에게 시각 정보를 제공할 수 있다. 예를 들면, 적어도 하나의 디스플레이는, 투명 또는 반투명한 렌즈를 포함할 수 있다. 적어도 하나의 디스플레이(25 0)는, 제1 디스플레이(250-1) 및/또는 제1 디스플레이(250-1)로부터 이격된 제2 디스플레이(250-2)를 포함할 수 있다. 예를 들면, 제1 디스플레이(250-1), 및 제2 디스플레이(250-2)는, 사용자의 좌안과 우안에 각각 대응되는 위치에 배치될 수 있다. 도 2b를 참조하면, 적어도 하나의 디스플레이는, 적어도 하나의 디스플레이에 포함되는 렌즈를 통해 사용자에게 외부 광으로부터 전달되는 시각적 정보와, 상기 시각적 정보와 구별되는 다른 시각적 정보를 제공할 수 있다. 상기 렌즈는, 프레넬(fresnel) 렌즈, 팬케이크(pancake) 렌즈, 또는 멀티-채널 렌즈 중 적어도 하나에 기반하여 형성될 수 있다. 예를 들면, 적어도 하나의 디스플레이는, 제1 면(surface), 및 제1 면 에 반대인 제2 면을 포함할 수 있다. 적어도 하나의 디스플레이의 제2 면 상에, 표시 영역 이 형성될 수 있다. 사용자가 웨어러블 장치를 착용하였을 때, 외부 광은 제1 면으로 입사되고, 제2 면을 통해 투과됨으로써, 사용자에게 전달될 수 있다. 다른 예를 들면, 적어도 하나의 디스플레이는, 외부 광을 통해 전달되는 현실 화면에, 적어도 하나의 광학 장치(282, 284)에서 제공되는 가상 현실 영상이 결 합된 증강 현실 영상을, 제2 면 상에 형성된 표시 영역에 표시할 수 있다. 일 실시예에서, 적어도 하나의 디스플레이는, 적어도 하나의 광학 장치(282, 284)에서 송출된 광을 회절시 켜, 사용자에게 전달하는, 적어도 하나의 웨이브가이드(waveguide)(233, 234)를 포함할 수 있다. 적어도 하나의 웨이브가이드(233, 234)는, 글래스, 플라스틱, 또는 폴리머 중 적어도 하나에 기반하여 형성될 수 있다. 적어도 하나의 웨이브가이드(233, 234)의 외부, 또는 내부의 적어도 일부분에, 나노 패턴이 형성될 수 있다. 상기 나노 패턴은, 다각형, 및/또는 곡면 형상의 격자 구조(grating structure)에 기반하여 형성될 수 있다. 적어도 하나 의 웨이브가이드(233, 234)의 일 단으로 입사된 광은, 상기 나노 패턴에 의해 적어도 하나의 웨이브가이드(233, 234)의 타 단으로 전파될 수 있다. 적어도 하나의 웨이브가이드(233, 234)는 적어도 하나의 회절 요소(예: DOE(diffractive optical element), HOE(holographic optical element)), 반사 요소(예: 반사 거울) 중 적어도 하나를 포함할 수 있다. 예를 들어, 적어도 하나의 웨이브가이드(233, 234)는, 적어도 하나의 디스플레이 에 의해 표시되는 화면을, 사용자의 눈으로 가이드하기 위하여, 웨어러블 장치 내에 배치될 수 있다. 예를 들어, 상기 화면은, 적어도 하나의 웨이브가이드(233, 234) 내에서 발생되는 전반사(total internal reflection, TIR)에 기반하여, 사용자의 눈으로 송신될 수 있다. 웨어러블 장치는, 촬영 카메라(260-4)를 통해 수집된 현실 영상에 포함된 오브젝트(object)를 분석하고, 분석된 오브젝트 중에서 증강 현실 제공의 대상이 되는 오브젝트에 대응되는 가상 오브젝트(virtual object)를 결합하여, 적어도 하나의 디스플레이에 표시할 수 있다. 가상 오브젝트는, 현실 영상에 포함된 오브젝트에 관련된 다양한 정보에 대한 텍스트, 및 이미지 중 적어도 하나를 포함할 수 있다. 웨어러블 장치는, 스테 레오 카메라와 같은 멀티-카메라에 기반하여, 오브젝트를 분석할 수 있다. 상기 오브젝트 분석을 위하여, 웨어 러블 장치는 멀티-카메라, 및/또는, ToF(time-of-flight)를 이용하여, 공간 인식(예: SLAM(simultaneous localization and mapping))을 실행할 수 있다. 웨어러블 장치를 착용한 사용자는, 적어도 하나의 디스플 레이에 표시되는 영상을 시청할 수 있다. 일 실시예에 따르면, 프레임은, 웨어러블 장치가 사용자의 신체 상에 착용될 수 있는 물리적인 구조 로 이루어질 수 있다. 일 실시예에 따르면, 프레임은, 사용자가 웨어러블 장치를 착용하였을 때, 제1 디스플레이(250-1) 및 제2 디스플레이(250-2)가 사용자의 좌안 및 우안에 대응되는 위치할 수 있도록, 구성될 수 있다. 프레임은, 적어도 하나의 디스플레이를 지지할 수 있다. 예를 들면, 프레임은, 제1 디 스플레이(250-1) 및 제2 디스플레이(250-2)를 사용자의 좌안 및 우안에 대응되는 위치에 위치되도록 지지할 수 있다. 도 2a를 참조하면, 프레임은, 사용자가 웨어러블 장치를 착용한 경우, 적어도 일부가 사용자의 신체 의 일부분과 접촉되는 영역을 포함할 수 있다. 예를 들면, 프레임의 사용자의 신체의 일부분과 접촉 되는 영역은, 웨어러블 장치가 접하는 사용자의 코의 일부분, 사용자의 귀의 일부분 및 사용자의 얼 굴의 측면 일부분과 접촉하는 영역을 포함할 수 있다. 일 실시예에 따르면, 프레임은, 사용자의 신체의 일 부 상에 접촉되는 노즈 패드를 포함할 수 있다. 웨어러블 장치가 사용자에 의해 착용될 시, 노즈 패드는, 사용자의 코의 일부 상에 접촉될 수 있다. 프레임은, 상기 사용자의 신체의 일부와 구별되는 사용자의 신체의 다른 일부 상에 접촉되는 제1 템플(temple) 및 제2 템플을 포함할 수 있다. 예를 들면, 프레임은, 제1 디스플레이(250-1)의 적어도 일부를 감싸는 제1 림(rim), 제2 디스플레이 (250-2)의 적어도 일부를 감싸는 제2 림, 제1 림과 제2 림 사이에 배치되는 브릿지 (bridge), 브릿지의 일단으로부터 제1 림의 가장자리 일부를 따라 배치되는 제1 패드, 브 릿지의 타단으로부터 제2 림의 가장자리 일부를 따라 배치되는 제2 패드, 제1 림으로부터 연장되어 착용자의 귀의 일부분에 고정되는 제1 템플, 및 제2 림으로부터 연장되어 상기 귀의 반대측 귀의 일부분에 고정되는 제2 템플을 포함할 수 있다. 제1 패드, 및 제2 패드는, 사용자의 코의 일부분과 접촉될 수 있고, 제1 템플 및 제2 템플은, 사용자의 안면의 일부분 및 귀의 일부분과 접촉 될 수 있다. 템플(204, 205)은, 도 2b의 힌지 유닛들(206, 207)을 통해 림과 회전 가능하게(rotatably) 연결될 수 있다. 제1 템플은, 제1 림과 제1 템플의 사이에 배치된 제1 힌지 유닛을 통해, 제1 림 에 대하여 회전 가능하게 연결될 수 있다. 제2 템플은, 제2 림과 제2 템플의 사이에 배치 된 제2 힌지 유닛을 통해 제2 림에 대하여 회전 가능하게 연결될 수 있다. 일 실시예에 따른, 웨어러 블 장치는 프레임의 표면의 적어도 일부분 상에 형성된, 터치 센서, 그립 센서, 및/또는 근접 센서를 이용하여, 프레임을 터치하는 외부 객체(예, 사용자의 손끝(fingertip)), 및/또는 상기 외부 객체에 의해 수행된 제스처를 식별할 수 있다. 일 실시예에 따르면, 웨어러블 장치는, 다양한 기능들을 수행하는 하드웨어들(예, 도 4의 블록도에 기반하 여 후술될 하드웨어들)을 포함할 수 있다. 예를 들면, 상기 하드웨어들은, 배터리 모듈, 안테나 모듈 , 적어도 하나의 광학 장치(282, 284), 스피커들(예, 스피커들(255-1, 255-2)), 마이크(예, 마이크들 (265-1, 265-2, 265-3)), 발광 모듈(미도시), 및/또는 PCB(printed circuit board)(예, 인쇄 회로 기판) 을 포함할 수 있다. 다양한 하드웨어들은, 프레임 내에 배치될 수 있다. 일 실시예에 따른, 웨어러블 장치의 마이크(예, 마이크들(265-1, 265-2, 265-3))는, 프레임의 적어도 일부분에 배치되어, 소리 신호를 획득할 수 있다. 브릿지 상에 배치된 제1 마이크(265-1), 제2 림 상 에 배치된 제2 마이크(265-2), 및 제1 림 상에 배치된 제3 마이크(265-3)가 도 2b 내에 도시되지만, 마이 크의 개수, 및 배치가 도 2b의 일 실시예에 제한되는 것은 아니다. 웨어러블 장치 내에 포함된 마이 크의 개수가 두 개 이상인 경우, 웨어러블 장치는 프레임의 상이한 부분들 상에 배치된 복수의 마이크들을 이용하여, 소리 신호의 방향을 식별할 수 있다. 일 실시예에 따르면, 적어도 하나의 광학 장치(282, 284)는, 다양한 이미지 정보를 사용자에게 제공하기 위하여, 적어도 하나의 디스플레이에 가상 오브젝트를 투영할 수 있다. 예를 들면, 적어도 하나의 광학 장 치(282, 284)는, 프로젝터일 수 있다. 적어도 하나의 광학 장치(282, 284)는, 적어도 하나의 디스플레이에 인접하여 배치되거나, 적어도 하나의 디스플레이의 일부로써, 적어도 하나의 디스플레이 내에 포함될 수 있다. 일 실시예에 따르면, 웨어러블 장치는, 제1 디스플레이(250-1)에 대응되는, 제1 광학 장치 및 제2 디스플레이(250-2)에 대응되는, 제2 광학 장치를 포함할 수 있다. 예를 들면, 적어도 하나의 광학 장치(282, 284)는, 제1 디스플레이(250-1)의 가장자리에 배치되는 제1 광학 장치 및 제2 디스플레이(250- 2)의 가장자리에 배치되는 제2 광학 장치를 포함할 수 있다. 제1 광학 장치는, 제1 디스플레이(250- 1) 상에 배치된 제1 웨이브가이드로 광을 송출할 수 있고, 제2 광학 장치는, 제2 디스플레이(250-2) 상에 배치된 제2 웨이브가이드로 광을 송출할 수 있다. 일 실시예에서, 카메라는, 촬영 카메라(260-4), 시선 추적 카메라(eye tracking camera, ET CAM)(260-1), 및/또는 동작 인식 카메라(260-2, 260-3)를 포함할 수 있다. 촬영 카메라(260-4), 시선 추적 카메라(260-1) 및 동작 인식 카메라(260-2, 260-3)는, 프레임 상에서 서로 다른 위치에 배치될 수 있고, 서로 다른 기능을 수행할 수 있다. 시선 추적 카메라(260-1)는, 웨어러블 장치를 착용한 사용자의 눈의 위치 또는 시선 (gaze)을 나타내는 데이터를 출력할 수 있다. 예를 들어, 웨어러블 장치는 시선 추적 카메라(260-1)를 통 하여 획득된, 사용자의 눈동자가 포함된 이미지로부터, 상기 시선을 탐지할 수 있다. 웨어러블 장치는 시 선 추적 카메라(260-1)를 통해 획득된 사용자의 시선을 이용하여, 사용자에 의해 포커스 된 객체(예, 실제 객체, 및/또는 가상 객체)를 식별할 수 있다. 포커스된 객체를 식별한 웨어러블 장치는, 사용자 및 포커스 된 객체 사이의 인터랙션을 위한 기능(예, gaze interaction)을 실행할 수 있다. 웨어러블 장치는 시선 추 적 카메라(260-1)를 통해 획득된 사용자의 시선을 이용하여, 가상 공간 내 사용자를 나타내는 아바타의 눈에 대 응하는 부분을 표현할 수 있다. 웨어러블 장치는 사용자의 눈의 위치에 기반하여, 적어도 하나의 디스플레 이 상에 표시되는 이미지(또는 화면)를 렌더링할 수 있다. 예를 들어, 이미지 내에서 시선과 관련된 제1영역의 시각적 품질 및 상기 제1 영역과 구분되는 제2 영역의 시각적 품질(예, 해상도, 밝기, 채도, 그레이스케 일, PPI)은 서로 다를 수 있다. 웨어러블 장치는, foveated rendering을 이용하여, 사용자의 시선에 매칭 되는 제1 영역의 시각적 품질 및 상기 제2 영역의 시각적 품질을 가지는 이미지를 획득할 수 있다. 예를 들어, 웨어러블 장치가 홍채 인식 기능을 지원하는 경우, 시선 추적 카메라(260-1)를 이용하여 획득한 홍채 정보 에 기반하여, 사용자 인증을 수행할 수 있다. 시선 추적 카메라(260-1)가 사용자의 우측 눈을 향하여 배치된 일 예가 도 2b 내에 도시되지만, 실시예가 이에 제한되는 것은 아니며, 시선 추적 카메라(260-1)는, 사용자의 좌측 눈을 향하여 단독으로 배치되거나, 또는 양 눈들 전부를 향하여 배치될 수 있다. 일 실시예에서, 촬영 카메라(260-4)는, 증강 현실 또는 혼합 현실 콘텐츠를 구현하기 위해서 가상의 이미지와 정합될 실제의 이미지나 배경을 촬영할 수 있다. 촬영 카메라(260-4)는 HR(high resolution) 또는 PV(photo video)에 기반하여, 고해상도를 가지는 이미지를 획득하기 위해 이용될 수 있다. 촬영 카메라(260-4)는, 사용자 가 바라보는 위치에 존재하는 특정 사물의 이미지를 촬영하고, 그 이미지를 적어도 하나의 디스플레이로 제공할 수 있다. 적어도 하나의 디스플레이는, 촬영 카메라(260-4)를 이용해 획득된 상기 특정 사물의 이 미지를 포함하는 실제의 이미지나 배경에 관한 정보와, 적어도 하나의 광학 장치(282, 284)를 통해 제공되는 가 상 이미지가 겹쳐진 하나의 영상을 표시할 수 있다. 웨어러블 장치는 촬영 카메라(260-4)통해 획득한 이미 지를 이용하여, 깊이 정보(예: 깊이 센서를 통해 획득된 웨어러블 장치 및 외부 객체 사이의 거리)를 보상 할 수 있다. 웨어러블 장치는 촬영 카메라(260-4)를 이용하여 획득한 이미지를 통해, 객체 인식을 수행할 수 있다. 웨어러블 장치는 촬영 카메라(260-4)를 이용하여 이미지 내 객체(또는 피사체)에 초점을 맞추는 기능(예, auto focus) 및/또는 OIS(optical image stabilization) 기능(예, 손떨림 방지 기능)을 수행할 수 있 다. 웨어러블 장치는 적어도 하나의 디스플레이 상에, 가상 공간을 나타내는 화면을 표시하는 동안, 촬영 카메라(260-4)를 통해 획득된 이미지를, 상기 화면의 적어도 일부분에 중첩하여 표시하기 위한 pass through 기능을 수행할 수 있다. 일 실시예에서, 촬영 카메라(260-4)는, 제1 림 및 제2 림 사이에 배 치되는 브릿지 상에 배치될 수 있다. 시선 추적 카메라(260-1)는, 웨어러블 장치를 착용한 사용자의 시선(gaze)을 추적함으로써, 사용자의 시선 과 적어도 하나의 디스플레이에 제공되는 시각 정보를 일치시켜 보다 현실적인 증강 현실을 구현할 수 있 다. 예를 들어, 웨어러블 장치는, 사용자가 정면을 바라볼 때, 사용자가 위치한 장소에서 사용자의 정면에 관련된 환경 정보를 자연스럽게 적어도 하나의 디스플레이에 표시할 수 있다. 시선 추적 카메라(260-1)는, 사용자의 시선을 결정하기 위하여, 사용자의 동공의 이미지를 캡쳐 하도록, 구성될 수 있다. 예를 들면, 시선 추적 카메라(260-1)는, 사용자의 동공에서 반사된 시선 검출 광을 수신하고, 수신된 시선 검출 광의 위치 및 움 직임에 기반하여, 사용자의 시선을 추적할 수 있다. 일 실시예에서, 시선 추적 카메라(260-1)는, 사용자의 좌안 과 우안에 대응되는 위치에 배치될 수 있다. 예를 들면, 시선 추적 카메라(260-1)는, 제1 림 및/또는 제2 림 내에서, 웨어러블 장치를 착용한 사용자가 위치하는 방향을 향하도록 배치될 수 있다. 동작 인식 카메라(260-2, 260-3)는, 사용자의 몸통, 손, 또는 얼굴 등 사용자의 신체 전체 또는 일부의 움직임 을 인식함으로써, 적어도 하나의 디스플레이에 제공되는 화면에 특정 이벤트를 제공할 수 있다. 동작 인식 카메라(260-2, 260-3)는, 사용자의 동작을 인식(gesture recognition)하여 상기 동작에 대응되는 신호를 획득하 고, 상기 신호에 대응되는 표시를 적어도 하나의 디스플레이에 제공할 수 있다. 프로세서는, 상기 동작에 대응되는 신호를 식별하고, 상기 식별에 기반하여, 지정된 기능을 수행할 수 있다. 동작 인식 카메라(260-2, 260-3)는, 6 자유도 자세(6 degrees of freedom pose, 6 dof pose)를 위한 SLAM(simultaneous localization and mapping) 및/또는 깊이 맵을 이용한 공간 인식 기능을 수행하기 위해 이용될 수 있다. 프로세서는 동작 인 식 카메라(260-2, 260-3)을 이용하여, 제스처 인식 기능 및/또는 객체 추적(object tracking) 기능을 수행할 수 있다. 일 실시예에서, 동작 인식 카메라(260-2, 260-3)는, 제1 림 및/또는 제2 림상에 배치될 수 있 다. 웨어러블 장치 내에 포함된 카메라는, 상술된 시선 추적 카메라(260-1), 동작 인식 카메라(260-2, 260-3)에 제한되지 않는다. 예를 들어, 웨어러블 장치는 사용자의 FoV를 향하여 배치된 카메라를 이용하여, 상기 FoV 내에 포함된 외부 객체를 식별할 수 있다. 웨어러블 장치가 외부 객체를 식별하는 것 은, 깊이 센서, 및/또는 ToF(time of flight) 센서와 같이, 웨어러블 장치, 및 외부 객체 사이의 거리를 식별하기 위한 센서에 기반하여 수행될 수 있다. 상기 FoV를 향하여 배치된 상기 카메라는, 오토포커스 기 능, 및/또는 OIS(optical image stabilization) 기능을 지원할 수 있다. 예를 들어, 웨어러블 장치는, 웨 어러블 장치를 착용한 사용자의 얼굴을 포함하는 이미지를 획득하기 위하여, 상기 얼굴을 향하여 배치된 카메라(예, FT(face tracking) 카메라)를 포함할 수 있다. 비록 도시되지 않았지만, 일 실시예에 따른, 웨어러블 장치는, 카메라를 이용하여 촬영되는 피사체 (예, 사용자의 눈, 얼굴, 및/또는 FoV 내 외부 객체)를 향하여 빛을 방사하는 광원(예, LED)을 더 포함할 수 있 다. 상기 광원은 적외선 파장의 LED를 포함할 수 있다. 상기 광원은, 프레임, 힌지 유닛들(206, 207) 중 적어도 하나에 배치될 수 있다. 일 실시예에 따르면, 배터리 모듈은, 웨어러블 장치의 전자 부품들에 전력을 공급할 수 있다. 일 실 시예에서, 배터리 모듈은, 제1 템플 및/또는 제2 템플 내에 배치될 수 있다. 예를 들면, 배터리 모듈은, 복수의 배터리 모듈들일 수 있다. 복수의 배터리 모듈들은, 각각 제1 템플과 제2 템플 각각에 배치될 수 있다. 일 실시예에서, 배터리 모듈은 제1 템플 및/또는 제2 템플의 단부에 배치될 수 있다. 안테나 모듈은, 신호 또는 전력을 웨어러블 장치의 외부로 송신하거나, 외부로부터 신호 또는 전력을 수신할 수 있다. 일 실시예에서, 안테나 모듈은, 제1 템플 및/또는 제2 템플 내에 배치될 수 있 다. 예를 들면, 안테나 모듈은, 제1 템플, 및/또는 제2 템플의 일면에 가깝게 배치될 수 있다. 스피커는, 음향 신호를 웨어러블 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 스피커로 참조될 수 있다. 일 실시예에서, 스피커는, 웨어러블 장치를 착용한 사용자의 귀에 인접하게 배치되기 위하 여, 제1 템플, 및/또는 제2 템플 내에 배치될 수 있다. 예를 들면, 스피커는, 제1 템플 내 에 배치됨으로써 사용자의 좌측 귀에 인접하게 배치되는, 제2 스피커(255-2), 및 제2 템플 내에 배치됨으 로써 사용자의 우측 귀에 인접하게 배치되는, 제1 스피커(255-1)를 포함할 수 있다. 발광 모듈(미도시)은, 적어도 하나의 발광 소자를 포함할 수 있다. 발광 모듈은, 웨어러블 장치의 특정 상 태에 관한 정보를 사용자에게 시각적으로 제공하기 위하여, 특정 상태에 대응되는 색상의 빛을 방출하거나, 특 정 상태에 대응되는 동작으로 빛을 방출할 수 있다. 예를 들면, 웨어러블 장치가, 충전이 필요한 경우, 적 색 광의 빛을 일정한 주기로 방출할 수 있다. 일 실시예에서, 발광 모듈은, 제1 림 및/또는 제2 림 상에 배치될 수 있다. 도 2b를 참고하면, 일 실시예에 따른, 웨어러블 장치는 PCB(printed circuit board)을 포함할 수 있 다. PCB는, 제1 템플, 또는 제2 템플 중 적어도 하나에 포함될 수 있다. PCB는, 적어도 두 개의 서브 PCB들 사이에 배치된 인터포저를 포함할 수 있다. PCB 상에서, 웨어러블 장치에 포함된 하나 이상의 하드웨어들(예, 도 4의 상이한 블록들에 의하여 도시된 하드웨어들)이 배치될 수 있다. 웨어러블 장치는, 상기 하드웨어들을 상호연결하기 위한, FPCB(flexible PCB)를 포함할 수 있다. 일 실시예에 따른, 웨어러블 장치는, 웨어러블 장치의 자세, 및/또는 웨어러블 장치를 착용한 사용자의 신체 부위(예, 머리)의 자세를 탐지하기 위한 자이로 센서, 중력 센서, 및/또는 가속도 센서 중 적어 도 하나를 포함할 수 있다. 중력 센서, 및 가속도 센서 각각은, 서로 수직인 지정된 3차원 축들(예, x축, y축 및 z축)에 기반하여 중력 가속도, 및/또는 가속도를 측정할 수 있다. 자이로 센서는 지정된 3차원 축들(예, x축, y축 및 z축) 각각의 각속도를 측정할 수 있다. 상기 중력 센서, 상기 가속도 센서, 및 상기 자이로 센서 중 적어도 하나가, IMU(inertial measurement unit)로 참조될 수 있다. 일 실시예에 따른, 웨어러블 장치(20 0)는 IMU에 기반하여 웨어러블 장치의 특정 기능을 실행하거나, 또는 중단하기 위해 수행된 사용자의 모션, 및/또는 제스처를 식별할 수 있다. 도 3a 및 도 3b는, 일 실시예에 따른, 웨어러블 장치의 외관의 일 예를 도시한다. 도 3a 및 도 3b의 웨어러블 장치는 도 1의 전자 장치 및 도 2a 및 도 2b의 웨어러블 장치의 일 예일 수 있다. 일 실시예에 따른, 웨어러블 장치의 하우징의 제1 면의 외관의 일 예가 도 3a에 도시되고, 상기 제1 면의 반 대되는(opposite to) 제2 면의 외관의 일 예가 도 3b에 도시될 수 있다. 도 3a를 참고하면, 일 실시예에 따른, 웨어러블 장치의 제1 면은, 사용자의 신체 부위(예, 상기 사용 자의 얼굴) 상에 부착가능한(attachable) 형태를 가질 수 있다. 비록 도시되지 않았지만, 웨어러블 장치는, 사용자의 신체 부위 상에 고정되기 위한 스트랩, 및/또는 하나 이상의 템플들(예, 도 2a 내지 도 2b의 제1 템플, 및/또는 제2 템플)을 더 포함할 수 있다. 사용자의 양 눈들 중에서 좌측 눈으로 이미 지를 출력하기 위한 제1 디스플레이(250-1), 및 상기 양 눈들 중에서 우측 눈으로 이미지를 출력하기 위한 제2 디스플레이(250-2)가 제1 면 상에 배치될 수 있다. 웨어러블 장치는 제1 면 상에 형성되고, 상 기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2)로부터 방사되는 광과 상이한 광(예, 외부 광(ambient light))에 의한 간섭을 방지하기 위한, 고무, 또는 실리콘 패킹(packing)을 더 포함할 수 있다. 일 실시예에 따른, 웨어러블 장치는, 상기 제1 디스플레이(250-1), 및 상기 제2 디스플레이(250-2) 각각에 인접한 사용자의 양 눈들을 촬영, 및/또는 추적하기 위한 카메라들(260-1)을 포함할 수 있다. 상기 카메라들 (260-1)은, 도 2b의 시선 추적 카메라(260-1)에 참조될 수 있다. 일 실시예에 따른, 웨어러블 장치는, 사 용자의 얼굴을 촬영, 및/또는 인식하기 위한 카메라들(260-5, 260-6)을 포함할 수 있다. 상기 카메라들(260-5, 260-6)은, FT 카메라로 참조될 수 있다. 웨어러블 장치는 카메라들(260-5, 260-6)을 이용하여 식별된 사용 자의 얼굴의 움직임(motion)에 기반하여, 가상 공간 내 상기 사용자를 표현하는 아바타를 제어할 수 있다. 예를 들어, 웨어러블 장치는, 카메라들(260-5, 260-6)(예, FT 카메라)에 의해 획득되고 웨어러블 장치를 착용한 사용자의 얼굴 표정을 나타내는 정보를 이용하여, 아바타의 일부분(예, 사람의 얼굴을 표현하는 아바타 의 일부분)의 텍스쳐 및/또는 형태를 변경할 수 있다. 도 3b를 참고하면, 도 3a의 제1 면과 반대되는 제2 면 상에, 웨어러블 장치의 외부 환경과 관련 된 정보를 획득하기 위한 카메라(예, 카메라들(260-7, 260-8, 260-9, 260-10, 260-11, 260-12)), 및/또는 센서 (예, 깊이 센서)가 배치될 수 있다. 예를 들어, 카메라들(260-7, 260-8, 260-9, 260-10)은, 외부 객체를 인식하기 위하여, 제2 면 상에 배치될 수 있다. 카메라들(260-7, 260-8, 260-9, 260-10)은, 도 2b의 동작 인식 카메라(260-2, 260-3)에 참조될 수 있다. 예를 들어, 카메라들(260-11, 260-12)을 이용하여, 웨어러블 장치는 사용자의 양 눈들 각각으로 송신될 이 미지, 및/또는 비디오를 획득할 수 있다. 카메라(260-11)는, 상기 양 눈들 중에서 우측 눈에 대응하는 제2 디스 플레이(250-2)를 통해 표시될 이미지를 획득하도록, 웨어러블 장치의 제2 면 상에 배치될 수 있다. 카메라(260-12)는, 상기 양 눈들 중에서 좌측 눈에 대응하는 제1 디스플레이(250-1)를 통해 표시될 이미지를 획 득하도록, 웨어러블 장치의제2 면 상에 배치될 수 있다. 카메라들(260-11, 260-12)은 도 2b의 촬영 카메라(260-4)에 참조될 수 있다. 일 실시예에 따른, 웨어러블 장치는, 웨어러블 장치, 및 외부 객체 사이의 거리를 식별하기 위하여 제2 면 상에 배치된 깊이 센서를 포함할 수 있다. 깊이 센서를 이용하여, 웨어러블 장치는, 웨어러블 장치를 착용한 사용자의 FoV의 적어도 일부분에 대한 공간 정보(spatial information)(예, 깊이 맵(depth map))를 획득할 수 있다. 비록 도시되지 않았지만, 웨어러블 장치의 제2 면 상에, 외부 객체로부터 출력된 소리를 획득하기 위한 마이크가 배치될 수 있다. 마이크의 개수는, 실시 예에 따라 하나 이상일 수 있다. 도 4는, 일 실시예에 따른, 웨어러블 장치의 블록도의 일 예를 도시한다. 도 4를 참조하면, 일 실시예에 따른 웨어러블 장치는 프로세서, 메모리, 디스플레이, 카메라, 센서, 또는, 통신 회 로 중 적어도 하나를 포함할 수 있다. 프로세서, 메모리, 디스플레이, 카메라, 센서 , 및, 통신 회로는 통신 버스(a communication bus)와 같은 전자 소자(electronical component)에 의해 서로 전기적으로 및/또는 작동적으로 연결될 수 있다(electronically and/or operably coupled with each other). 웨어러블 장치에 포함된 하드웨어 컴포넌트의 타입 및/또는 개수는 도 4에 도 시된 바에 제한되지 않는다. 예를 들어, 웨어러블 장치는 도 4에 도시된 하드웨어 컴포넌트 중 일부만 포 함할 수 있다. 이하에서 설명되는 메모리 내의 요소들(예: 레이어들 및/또는 모듈들)은 논리적으로 구분된 상태 일 수 있다. 다만, 이에 한정되는 것은 아니다. 일 실시예에 따른 웨어러블 장치의 프로세서는 하나 이상의 인스트럭션들에 기반하여 데이터를 처리 하기 위한 하드웨어 컴포넌트를 포함할 수 있다. 데이터를 처리하기 위한 하드웨어 컴포넌트는, 예를 들어, ALU(arithmetic and logic unit), FPGA(field programmable gate array), 및/또는 CPU(central processing unit)를 포함할 수 있다. 프로세서의 개수는 하나 이상일 수 있다. 예를 들어, 프로세서는 듀얼 코어 (dual core), 쿼드 코어(quad core) 또는 헥사 코어(hexa core)와 같은 멀티-코어 프로세서의 구조를 가질 수 있다. 일 실시예에 따른 웨어러블 장치의 메모리는 프로세서에 입력 및/또는 출력되는 데이터 및/또는 인스트럭션들을 저장하기 위한 하드웨어 컴포넌트를 포함할 수 있다. 메모리는, 예를 들어, RAM(random- access memory)와 같은 휘발성 메모리(volatile memory) 및/또는 ROM(read-only memory)와 같은 비휘발성 메모 리(non-volatile memory)를 포함할 수 있다. 휘발성 메모리는, 예를 들어, DRAM(dynamic RAM), SRAM(staticRAM), Cache RAM, PSRAM (pseudo SRAM) 중 적어도 하나를 포함할 수 있다. 비휘발성 메모리는, 예를 들어, PROM(programmable ROM), EPROM (erasable PROM), EEPROM (electrically erasable PROM), 플래시 메모리, 하 드디스크, 컴팩트 디스크, eMMC(embedded multi media card) 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 웨어러블 장치의 디스플레이는 웨어러블 장치의 사용자에게 시각화된 정보를 출 력할 수 있다. 예를 들어, 디스플레이는, GPU(graphic processing unit)와 같은 회로를 포함하는 프로세 서에 의해 제어되어, 사용자에게 시각화된 정보(visualized information)를 출력할 수 있다. 디스플레이 는 FPD(flat panel display) 및/또는 전자 종이(electronic paper)를 포함할 수 있다. 상기 FPD는 LCD(liquid crystal display), PDP(plasma display panel) 및/또는 하나 이상의 LED(light emitting diode)를 포함할 수 있다. 상기 LED는 OLED(organic LED)를 포함할 수 있다. 일 실시예에서, 웨어러블 장치의 카메라는 빛의 색상 및/또는 밝기를 나타내는 전기 신호를 생성하는 하나 이상의 광 센서들(예, CCD(charged coupled device) 센서, CMOS(complementary metal oxide semiconductor) 센서)을 포함할 수 있다. 카메라에 포함된 복수의 광 센서들은 2차원 격자(2 dimensional array)의 형태로 배치될 수 있다. 카메라는 복수의 광 센서들 각각의 전기 신호들을 실질적으로 동시에 획 득하여, 2차원 격자의 광 센서들에 도달한 빛에 대응하는 2차원 프레임 데이터를 생성할 수 있다. 예를 들어, 카메라를 이용하여 캡쳐한 사진 데이터는 카메라로부터 획득한 하나의(a) 2차원 프레임 데이터를 의 미할 수 있다. 예를 들어, 카메라를 이용하여 캡쳐한 비디오 데이터는, 프레임 율(frame rate)을 따라 카 메라로부터 획득된, 복수의 2차원 프레임 데이터의 시퀀스(sequence)를 의미할 수 있다. 카메라는, 카메라가 광을 수신하는 방향을 향하여 배치되고, 상기 방향을 향하여 광을 출력하기 위한 플래시 라이트 를 더 포함할 수 있다. 일 실시예에 따른, 웨어러블 장치는 카메라의 일 예로, 상이한 방향들을 향하여 배치된 복수의 카메 라들을 포함할 수 있다. 복수의 카메라들 중 제1 카메라는, 동작 인식 카메라(예, 도 2b의 동작 인식 카메라 (260-2, 260-3))로 지칭되고, 제2 카메라는 시선 추적 카메라(예, 도 2b의 시선 추적 카메라(260-1))로 지칭될 수 있다. 웨어러블 장치는 제1 카메라를 이용하여 획득된 이미지를 이용하여, 손의 위치, 형태 및/또는 제 스처를 식별할 수 있다. 웨어러블 장치는 제2 카메라를 이용하여 획득된 이미지를 이용하여, 웨어러블 장 치를 착용한 사용자의 시선의 방향을 식별할 수 있다. 일 예로, 제1 카메라가 향하는 방향과 제2 카메라가 향하는 방향은 반대일 수 있다. 일 실시예에 따른, 웨어러블 장치의 센서는, 웨어러블 장치와 관련된 비-전기적 정보(non- electronic information)로부터, 웨어러블 장치의 프로세서 및/또는 메모리에 의해 처리될 수 있는 전기적 정보를 생성할 수 있다. 상기 정보는, 센서 데이터로 지칭될 수 있다. 상기 센서는, 웨어러블 장치의 지리적 위치(geographic location)를 탐지하기 위한 GPS(global positioning system) 센서, 이미 지 센서, 조도 센서 및/또는 ToF(time-of-flight) 센서, 웨어러블 장치의 물리적인 모션을 탐지하기 위한 IMU(inertial measurement unit)을 포함할 수 있다. 일 실시예에서, 웨어러블 장치의 통신 회로는, 웨어러블 장치 및 외부 전자 장치 사이의 전기 신호의 송신 및/또는 수신을 지원하기 위한 하드웨어 부품을 포함할 수 있다. 통신 회로는, 예를 들어, 모 뎀(MODEM), 안테나, O/E(optic/electronic) 변환기 중 적어도 하나를 포함할 수 있다. 통신 회로는, 이더 넷(ethernet), LAN(local area network), WAN(wide area network), WiFi(wireless fidelity), Bluetooth, BLE(bluetooth low energy), ZigBee, LTE(long term evolution), 5G NR(new radio) 및/또는 6G와 같은 다양한 타입의 프로토콜에 기반하여 전기 신호의 송신 및/또는 수신을 지원할 수 있다. 일 실시예에 따른, 웨어러블 장치의 메모리 내에서, 웨어러블 장치의 프로세서가 데이터에 수행할 연산, 및/또는 동작을 나타내는 하나 이상의 인스트럭션들(또는 명령어들)이 저장될 수 있다. 하나 이상 의 인스트럭션들의 집합은, 펌웨어, 운영 체제, 프로세스, 루틴, 서브-루틴 및/또는 어플리케이션으로 참조될 수 있다. 예를 들어, 웨어러블 장치, 및/또는 프로세서는, 운영체제, 펌웨어, 드라이버, 및/또는 어 플리케이션 형태로 배포된 복수의 인스트럭션의 집합(set of a plurality of instructions)이 실행될 시에, 이 하에서 설명되는 실시 예에 따른 동작들 중 적어도 하나를 수행할 수 있다. 이하에서, 어플리케이션이 웨어러블 장치 내에 설치되었다는 것은, 어플리케이션의 형태로 제공된 하나 이상의 인스트럭션들이 메모리 내 에 저장된 것으로써, 상기 하나 이상의 어플리케이션들이 프로세서에 의해 실행 가능한(executable) 포맷 (예, 웨어러블 장치의 운영 체제에 의해 지정된 확장자를 가지는 파일)으로 저장된 것을 의미할 수 있다. 일 예로, 어플리케이션은, 사용자에게 제공되는 서비스와 관련된 프로그램, 및/또는 라이브러리를 포함할 수 있다. 도 4를 참고하면, 웨어러블 장치에 설치된 프로그램들은, 타겟에 기반하여, 어플리케이션 레이어, 프 레임워크 레이어 및/또는 하드웨어 추상화 레이어(hardware abstraction layer, HAL)를 포함하는 상 이한 레이어들 중 어느 한 레이어로 분류될 수 있다. 예를 들어, 하드웨어 추상화 레이어 내에, 웨어러블 장치의 하드웨어(예, 디스플레이, 카메라, 및/또는 센서)를 타겟으로 설계된 프로그램들 (예, 모듈, 또는 드라이버)이 분류될 수 있다. 프레임워크 레이어는, XR(extended reality) 서비스를 제공 하기 위한 하나 이상의 프로그램들이 포함된 점에서, XR 프레임 워크 레이어로 지칭될 수 있다. 예를 들어, 도 4는 메모리 내에 레이어들을 구분하여 도시하였으나, 레이어들은 논리적으로 구분될 수 있다. 다만, 이에 제한되지 않는다. 실시예에 따라, 레이어들은 메모리 내의 지정된 영역에 저장될 수도 있다. 예를 들어, 프레임워크 레이어 내에, 하드웨어 추상화 레이어 및/또는 어플리케이션 레이어 중 적어도 하나를 타겟으로 설계된 프로그램들(예, 위치 추적기, 공간 인식기, 제스처 추적기, 및/ 또는 시선 추적기, 얼굴 추적기)이 분류될 수 있다. 프레임워크 레이어로 분류되는 프로그램들 은, 다른 프로그램에 기반하여 실행가능한 API(application programming interface)를 제공할 수 있다. 예를 들어, 어플리케이션 레이어 내에, 웨어러블 장치를 제어하는 사용자를 타겟으로 설계된 프로그 램이 분류될 수 있다. 어플리케이션 레이어으로 분류되는 프로그램들의 일 예로, XR(extended reality) 시 스템 UI(user interface), 및/또는 XR 어플리케이션이 예시되지만, 실시예가 이에 제한되는 것은 아니다. 예를 들어, 어플리케이션 레이어로 분류되는 프로그램들(예, 소프트웨어 어플리케이션)은, API(application programming interface)를 호출하여, 프레임워크 레이어로 분류되는 프로그램들에 의해 지원되는 기능의 실행을 야기할 수 있다. 예를 들어, 웨어러블 장치는 XR 시스템 UI의 실행에 기반하여, 가상 공간을 이용하기 위한 사용자와 상호작용을 수행하기 위한 하나 이상의 시각적 객체들을 디스플레이 상에 표시할 수 있다. 시각적 객체는, 텍스트, 이미지, 아이콘, 비디오, 버튼, 체크박스, 라디오버튼, 텍스트 박스, 슬라이더 및/또는 테이블과 같이, 정보의 송신 및/또는 상호작용(interaction)을 위해 화면 내에 배치될 수 있는(deployable) 객체를 의미할 수 있다. 시각적 객체는 시각적 가이드(visual guide), 가상 객체(virtual object), 시각 요소(visual element), UI 요소(UI element) 뷰 객체(view object) 및/또는 뷰 요소(view element) 로 지칭될 수 있다. 웨어러블 장치 는, XR 시스템 UI의 실행에 기반하여, 사용자에게, 가상 공간 내에서 이용가능한 기능들을 제어할 수 있는 서비스를 제공할 수 있다. 도 4를 참고하면, XR 시스템 UI 내에 경량 렌더러, 및/또는 XR 플러그인이 포함되도록 도시되어 있지만, 이에 제한되는 것은 아니다. 예를 들어, XR 시스템 UI은 프레임 워크 레이어 내에 포함된 경량 렌더러 및/또는 XR 플러그인에 지원되는 기능의 실행을 야기할 수 있다. 예를 들어, 웨어러블 장치는 경량 렌더러(lightweight renderer)의 실행에 기반하여, 부분적인 변경 이 허용된, 렌더링 파이프라인을 정의, 생성 및/또는 실행하기 위해 이용되는 자원(예, API, 시스템 프로세스 및/또는 라이브러리)을 획득할 수 있다. 경량 렌더러는 부분적인 변경이 허용된, 렌더링 파이프라인을 정 의하는 관점에서, lightweight render pipeline으로 지칭될 수 있다. 경량 렌더러는, 소프트웨어 어플리케 이션의 실행 이전에 빌드된 렌더러(예, 프리-빌드(prebuilt) 렌더러)를 포함할 수 있다. 예를 들어, 웨어러블 장치는 XR 플러그인의 실행에 기반하여, 렌더링 파이프라인 전체를 정의, 생성 및/또는 실행하기 위 해 이용되는 자원(예, API, 시스템 프로세스 및/또는 라이브러리)을 획득할 수 있다. XR 플러그인은 렌더 링 파이프라인 전체를 정의(또는 설정)하는 관점에서, open XR native client로 지칭될 수 있다. 예를 들어, 웨어러블 장치는, XR 어플리케이션의 실행에 기반하여, 가상 공간의 적어도 일부분을 나 타내는 화면을 디스플레이 상에 표시할 수 있다. XR 어플리케이션에 포함된 XR 플러그인(444-1)은 XR 시스템 UI의 XR 플러그인에 참조될 수 있다. XR 플러그인(444-1)의 설명 중 XR 플러그인의 설명 과 중복되는 설명은 생략될 수 있다. 웨어러블 장치는, XR 어플리케이션의 실행에 기반하여, 가상 공 간 매니저의 실행을 야기할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 가상 공간 매니저의 실행에 기반하여 가상 공간 서비스를 제 공할 수 있다. 예를 들어, 가상 공간 매니저는 가상 공간 서비스를 지원하기 위한 플랫폼(예: 안드로이드 플랫폼)을 포함할 수 있다. 웨어러블 장치는 가상 공간 매니저의 실행에 기반하여, 센서를 통해 획득한 데이터를 이용하여 렌더링 된 사용자의 자세를 나타내는 가상 객체의 자세를 디스플레이 상에 표시할 수있다. 가상 공간 매니저는, CPM(composition presentation manager)로 참조될 수 있다. 예를 들어, 가상 공간 매니저는, 런타임 서비스를 포함할 수 있다. 일 예로, 런타임 서비스는 OpenXR runtime 모듈로 참조될 수 있다. 웨어러블 장치는 런타임 서비스의 실행에 기반하여, 웨어러 블 장치를 통해 사용자의 포즈 예측 기능, 프레임 타이밍 기능, 및/또는 공간 입력 기능 중 적어도 하나를 제공하기 위해 사용될 수 있다. 일 예로, 웨어러블 장치는 런타임 서비스의 실행에 기반하여 사용자 에게 가상 공간 서비스를 위한 렌더링을 수행하기 위해 사용될 수 있다. 예를 들어, 런타임 서비스의 실행 에 기반하여, 어플리케이션(예, unity 또는 OpenXR native application)이 구현될 수 있다. 예를 들어, 가상 공간 매니저는 pass-through 매니저룰 포함할 수 있다. 웨어러블 장치는, pass-through 매니저의 실행에 기반하여, 가상 공간을 나타내는 화면을 디스플레이상에 표시하는 동 안, 카메라를 통해 획득한 실제 공간을 나타내는 다른 화면을 상기 화면의 적어도 일부분에 중첩하여 표시 할 수 있다. 예를 들어, 가상 공간 매니저는, 입력 매니저를 포함할 수 있다. 웨어러블 장치는 입력 매니저 의 실행에 기반하여, 인식 서비스 레이어 내에 포함된 하나 이상의 프로그램들을 실행하여 획득된 데 이터(예: 센서 데이터)를 식별할 수 있다. 웨어러블 장치는 상기 획득된 데이터를 이용하여, 웨어러블 장 치의 기능들 중 적어도 하나의 실행을 개시할 수 있다. 예를 들어, 인식 추상화 레이어(perception abstract layer)는 가상 공간 매니저와 인식 서비스 레 이어(perception service layer) 사이의 데이터 교환을 위해 사용될 수 있다. 가상 공간 매니저와 인식 서비스 레이어(perception service layer) 사이의 데이터 교환을 위해 사용되는 관점에서, 인식 추상 화 레이어(perception abstract layer)는 인터페이스(interface)로 지칭될 수 있다. 일 예로, 인식 추상 화 레이어는 OpenPX로 참조될 수 있다. 인식 추상화 레이어는 perception client 및 perception service를 위해 사용될 수 있다. 일 실시 예에 따르면, 인식 서비스 레이어는 센서(또는, 카메라)로부터 획득된 데이터를 처리하 기 위한 하나 이상의 프로그램들을 포함할 수 있다. 하나 이상의 프로그램들은 위치 추적기, 공간 인식기 , 제스처 추적기, 시선 추적기, 및/또는, 얼굴 추적기 중 적어도 하나를 포함할 수 있다. 인식 서비스 레이어에 포함된 하나 이상의 프로그램들의 타입 및/또는 개수는 도 4에 도시된 바에 제한되 지 않는다. 예를 들어, 웨어러블 장치는, 위치 추적기의 실행에 기반하여, 센서를 이용하여, 웨어러블 장치 의 자세를 식별할 수 있다. 웨어러블 장치는 위치 추적기의 실행에 기반하여, 카메라 및 IMU를 이용하여 획득된 데이터를 이용하여, 웨어러블 장치의 6 자유도 자세(6 degrees of freedom pose, 6 dof pose)를 식별할 수 있다. 위치 추적기는, 헤드 트래킹(head tracking, HeT) 모듈로 참조될 수 있다. 예를 들어, 웨어러블 장치는 공간 인식기의 실행에 기반하여, 웨어러블 장치(또는, 웨어러블 장 치의 사용자)의 주변 환경을 3 차원의 가상 공간으로 구성하기 위해 사용될 수 있다. 웨어러블 장치 는 공간 인식기의 실행에 기반하여, 카메라를 이용하여 획득된 데이터를 이용하여, 웨어러블 장치 의 주변 환경을 3 차원으로 재현(reconstruct)할 수 있다. 웨어러블 장치는 공간 인식기의 실행 에 기반하여 3 차원으로 재현된 웨어러블 장치의 주변 환경에 기반하여, 평면, 경사, 계단 중 적어도 하나 를 식별할 수 있다. 공간 인식기는, 환경 인식(scene understanding, SU) 모듈로 참조될 수 있다. 예를 들어, 웨어러블 장치는 제스처 추적기의 실행에 기반하여, 웨어러블 장치의 사용자의 손의 포즈 및/또는 제스처를 식별(또는 인식)하기 위해 사용될 수 있다. 일 예로, 웨어러블 장치는, 제스처 추 적기의 실행에 기반하여, 센서로부터 획득된 데이터를 이용하여, 사용자의 손의 포즈 및/또는 제스처 를 식별할 수 있다. 일 예로, 웨어러블 장치는 제스처 추적기의 실행에 기반하여, 카메라를 이용하여 획득된 데이터(또는, 이미지)에 기반하여, 사용자의 손의 포즈 및/또는 제스처를 식별할 수 있다. 제스처 추적 기는, 핸드 트래킹(hand tracking, HaT) 모듈, 및/또는 제스처 트레킹 모듈로 참조될 수 있다. 예를 들어, 웨어러블 장치는 시선 추적기의 실행에 기반하여, 웨어러블 장치의 사용자의 눈의 움직임을 식별(또는 추적(tracking))할 수 있다. 일 예로, 웨어러블 장치는 시선 추적기의 실행에 기 반하여 적어도 하나의 센서로부터 획득된 데이터를 이용하여, 사용자의 눈의 움직임을 식별할 수 있다. 일 예로, 웨어러블 장치는 시선 추적기의 실행에 기반하여 카메라(예 : 도 2a 및 도 2b의 시선 추적 카메라(260-1)) 및/또는 IR LED(infrared light emitting diode)를 이용하여 획득된 데이터에 기반하여, 사용자 의 눈의 움직임을 식별할 수 있다. 시선 추적기는, 아이 트래킹(eye tracking, ET) 모듈, 및/또는 시선 (gaze) 트레킹 모듈로 참조될 수 있다. 예를 들어, 웨어러블 장치의 인식 서비스 레이어는, 사용자의 얼굴을 추적하기 위한 얼굴 추적기 를 더 포함할 수 있다. 예를 들어, 웨어러블 장치(200는 얼굴 추적기의 실행에 기반하여, 사용자의 얼굴의 움직임 및/또는 사용자의 표정을 식별(또는 추적)할 수 있다. 웨어러블 장치는 얼굴 추적기의 실행에 기반하여, 사용자의 얼굴의 움직임에 기반하여, 사용자의 표정을 추정할 수 있다. 일 예로, 웨어러블 장 치는, 얼굴 추적기의 실행에 기반하여, 카메라를 이용하여 획득된 데이터(예, 이미지)에 기반하여, 사용자의 얼굴의 움직임 및/또는 사용자의 표정을 식별할 수 있다. 이하에서 설명되는 실시 예들을 위해, 도 4의 웨어러블 장치가 참조될 수 있다. 예를 들어, 이하에서 설명 되는 실시 예들은, 도 4의 웨어러블 장치의 프로세서에 의해 수행될 수 있다. 도 5a는, 일 실시 예에 따른, 디스플레이를 통해 표시되는 가상 공간의 예를 도시한다. 도 5a를 참고하면, 웨어러블 장치는, 사용자에 의해 착용된 상태 내에서, 사용자의 전방을 향하 여 배치된 카메라를 포함할 수 있다. 사용자의 전방은, 사용자의 머리, 및/또는 사용자의 시선이 향하는 방향을 포함할 수 있다. 일 실시예에 따른 웨어러블 장치는, 사용자에 의해 착용된 상 태 내에서, 사용자의 머리, 및/또는 웨어러블 장치의 모션을 식별하기 위한 센서를 포함할 수 있다. 웨어러블 장치의 프로세서는, 센서의 데이터에 기반하여, 웨어러블 장치의 각도를 식별할 수 있다. 웨어러블 장치를 착용한 사용자에게 VR(virtual reality), AR(augmented reality), 및/또 는 MR(mixed reality)에 기반하는 UI(user interface)를 제공하기 위하여, 프로세서는 카메라, 및/ 또는 센서를 제어할 수 있다. UI는, 웨어러블 장치, 및/또는 웨어러블 장치에 연결된 서버에 의 해 제공되는 메타버스 서비스, 및/또는 알림 서비스와 관련될 수 있다. 일 실시예에 따른, 프로세서는 증강 현실(augmented reality, AR), 및/또는 혼합 현실(mixed reality, MR)과 관련된 기능을 실행할 수 있다. 사용자가 웨어러블 장치를 착용한 상태 내에서, 프로세서(41 0)는 사용자의 눈에 인접하게 배치된 적어도 하나의 렌즈를 포함할 수 있다. 렌즈를 통과하는 주변 광 (ambient light)은, 웨어러블 장치의 디스플레이로부터 방사된 광과 결합(또는, 혼합)될 수 있다. 디 스플레이의 표시 영역은, 주변 광이 통과되는 렌즈 내에서 형성될 수 있다. 프로세서가 상기 주변 광 및 디스플레이로부터 방사된 상기 광을 결합하기 때문에, 사용자는 상기 주변 광에 의해 인식되는 실 제 객체(real object) 및 디스플레이로부터 방사된 상기 광에 의해 형성된 가상 객체(virtual object)가 혼합된 상(image)을 볼 수 있다. 일 실시예에 따른, 웨어러블 장치는 VST(video see-through) 및/또는 가상 현실(virtual reality, VR)과 관련된 기능을 실행할 수 있다. 사용자가 웨어러블 장치를 착용한 상태 내에서, 웨어러블 장치 는 사용자의 눈을 덮는 하우징을 포함할 수 있다. 웨어러블 장치는, 상기 상태 내에서, 상기 눈을 향 하는 제1 면(예, 도 3a의 제1 면)에 배치된 디스플레이를 포함할 수 있다. 웨어러블 장치는 상 기 제1 면과 반대인 제2 면(예, 도 3a의 제2 면) 상에 배치된 카메라(또는, 도 3b의 카메라들(260-7, 260-8, 260-9, 260-10, 260-11, 260-12))를 포함할 수 있다. 상기 카메라를 이용하여, 프로세서는 주변 광이 포함된 프레임 이미지들을 획득할 수 있다. 프로세서는 상기 제1 면에 배치된 디스플레이 에, 프레임 이미지들을 출력하여, 사용자가 디스플레이를 통해 주변 광을 인식하게 할 수 있다. 제1 면에 배치된 디스플레이의 표시 영역은, 디스플레이에 포함된 하나 이상의 픽셀들에 의해 형성될 수 있다. 프로세서는 사용자가 주변 광에 의해 인식되는 실제 객체와 함께 상기 가상 객체를 인식하게 하기 위해, 상기 디스플레이를 통해 출력되는 프레임 이미지들 내에 가상 객체를 합성할 수 있다. 일 실시예에 따른, 웨어러블 장치는 가상 공간을 이용하여, 혼합 현실(mixed reality, MR)에 기반하는 사 용자 경험을 제공할 수 있다. 웨어러블 장치의 프로세서는, 웨어러블 장치가 포함된 외부 공간 (예, 실제 공간(real space))을 인식하여, 상기 외부 공간에 매핑된 가상 공간을 생성할 수 있다. 프로세서 가 수행하는 공간 인식은, SLAM(simultaneous localization and mapping) 및/또는 공간 매핑(예, scene understanding)을 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 디스플레이를 통해 가상 공간를 표시(또는 제공)할 수 있다. 예를 들어, 가상 공간은 적어도 하나의 가상 공간을 나타내도록 설정될 수 있다. 예를 들어, 가상 공간 은 홈 공간(home space)으로 참조될 수 있다. 프로세서의 사용자는 가상 공간 내에 표시된 가상 공간들에 상응하는 시각적 객체들을 식별할 수 있다. 예를 들어, 프로세서는 사용자에게 가상 공간에 관한 서비스의 시작에 관한 입력을 식별하는 것에 기 반하여, 가상 공간을 디스플레이를 통해 표시할 수 있다. 사용자(또는 사용자에 대응하는 아바 타)는 가상 공간 내에서, 웨어러블 장치를 통해 제공가능한 복수의 어플리케이션들 중 적어도 하나를 실행할 수 있다. 예를 들어, 프로세서는 적어도 하나의 가상 공간을 제공할 수 있다. 일 예로, 프로세서는 가상 공간 뿐만 아니라, 제1 가상 공간, 제2 가상 공간, 제3 가상 공간, 및 제4 가상 공간을 제공할 수 있다. 시각 적 객체는 제1 가상 공간에 대응할 수 있다. 시각적 객체는 제2 가상 공간에 대응할 수 있다. 시각적 객체는 제3 가상 공간에 대응할 수 있다. 시각적 객체는 제4 가상 공간에 대응할 수 있다. 일 실시 예에 따르면, 프로세서는 가상 공간에 대응하는 시각적 객체에 대한 입력에 기반하여, 사용자 에게 제공되는 가상 공간을 전환할 수 있다. 예를 들어, 프로세서는 제1 가상 공간에 대응하는 시각 적 객체에 대한 입력에 기반하여, 사용자에게 제공되는 가상 공간을 가상 공간으로부터 제1 가 상 공간으로 전환할 수 있다. 예를 들어, 프로세서는 제1 가상 공간에 대응하는 시각적 객체에 대한 입력에 기반하여, 디스플레이를 통해 제1 가상 공간을 제공할 수 있다. 일 실시 예에 따르면, 프로세서는 가상 공간 내에서 객체를 표시(또는 제공)할 수 있다. 프로세 서는 가상 공간 내에서 지정된 영역 상에 객체를 표시할 수 있다. 프로세서는 사용자(51 0)의 모션과 독립적으로 객체를 지정된 영역 상에서 표시할 수 있다. 예를 들어, 지정된 영역은 가상 공간 내에서 고정된 영역이 아닐 수 있다. 지정된 영역의 위치는 사용자의 시선에 따라 가상 공간 내에서 변경될 수 있다. 프로세서는 사용자의 시선이 이동하는 경우에도 사용자에 의해 식별되는 가상 공간의 부분(또는 디스플레이를 통해 표시되는 화면) 내의 동일한 위치에 객체를 표시할 수 있 다. 실시 예에 따라, 프로세서는 사용자에게 제공(또는 표시)되는 가상 공간이 가상 공간으로부 터 변경되는 경우에도, 객체의 표시를 유지할 수 있다. 일 실시 예에 따르면, 프로세서는 사용자의 시선에 기반하여, 객체를 조건부로 표시할 수 있다. 프로세서는 사용자의 지정된 발언 및/또는 웨어러블 장치에 형성된 버튼을 누르는 제스쳐에 응 답하여, 객체를 표시할 수 있다. 일 실시 예에 따르면, 객체는 메뉴(menu), 유니버셜 메뉴(universal menu), 태스크 바(task bar), 및 상 태 바(state bar) 중 하나로 참조될 수 있다. 예를 들어, 프로세서는 객체 내에, 웨어러블 장치의 상태를 나타내는 하나 이상의 요소 (element)(또는 아이콘(icon))들을 표시할 수 있다. 예를 들어, 프로세서는 객체 내에, 웨어러블 장 치에 포함된 배터리의 SOC(state of charge)를 나타내는 요소를 표시할 수 있다. 프로세서는 객체 내에, 웨어러블 장치가 접속한 네트워크의 종류(예, 와이파이, LTE, 5G 및/또는 6G)를 나타내는 요 소를 표시할 수 있다. 프로세서는 객체 내에, 현재 시간을 나타내는 요소 및/또는 텍스트를 표시할 수 있다. 프로세서는 객체 내에, 웨어러블 장치에 로그인된 사용자의 계정 정보를 표시하 기 위한 요소를 표시할 수 있다. 일 실시예에 따르면, 프로세서는 객체 내에, 표시 영역을 통해 제공되는 가상 공간을 제어하기 위한 옵션들을 표시할 수 있다. 예를 들어, 프로세서는 객체에서, 웨어러블 장치에 설치된 어플리케이션의 리스트를 표시하기 위한 요소를 표시할 수 있다. 지정된 기간을 초과하여 요소를 향하는 사용자의 시선 및/또는 손 가락을 탐지하는 것에 응답하여, 프로세서는 요소의 선택을 나타내는 입력을 식별할 수 있다. 상기 입력에 응답하여, 프로세서는, 요소에 대응하는 어플리케이션의 리스트를 표시할 수 있다. 예를 들어, 프로세서는 객체에서, 웨어러블 장치에 의해 제공되는(또는 생성된) 하나 이상의 가 상 공간들의 리스트를 표시하기 위한 요소를 표시할 수 있다. 프로세서는 요소를 선택하기 위한 제스쳐(예, 요소를 향하는 사용자의 시선 및/또는 손가락)를 탐지하는 것에 기반하여, 프로세서는 상기 하나 이상의 가상 공간들의 리스트(예: 시각적 객체 내지 시각적 객체)를 표시할 수 있다. 예를 들어, 프로세서는 객체에서, 표시 영역을 통해 제공되는 가상 공간 내에서 실행 중인 어플리케 이션들의 리스트를 표시하기 위한 요소을 표시할 수 있다. 도 5b는, 일 실시 예에 따른, 사용자의 시선의 방향에 따라 표시되는 가상 공간의 부분의 예를 도시한다. 도 5b를 참고하면, 프로세서는 센서를 이용하여, 사용자의 모션을 식별할 수 있다. 예를 들어, 프로 세서는 사용자의 신체의 일부(예: 머리)의 모션을 식별할 수 있다. 프로세서는 센서를 이용하여, 웨어러블 장치의 6 자유도 자세(6 degrees of freedom pose, 6 dof pose)를 식별할 수 있다. 예를 들어, 프로세서는 웨어러블 장치의 회전 방향에 따라 사용자의 시선의 방향을 식별할 수 있다. 프로세서는 x축, y축, 및 z축 중 하나를 기준으로, 웨어러블 장치의 회전을 식별할 수 있다. 일 예로, 프로세서는 x축을 기준으로, 웨어러블 장치의 회전을 식별할 수 있다. 프로세서는 x축 을 기준으로 식별되는 웨어러블 장치의 회전에 기반하여, 사용자의 머리의 피칭(pitching)(또는 끄덕임 (nodding))을 식별할 수 있다. 일 예로, 프로세서는 y축을 기준으로, 웨어러블 장치의 회전을 식별할 수 있다. 프로세서는 y축 을 기준으로 식별되는 웨어러블 장치의 회전에 기반하여, 사용자의 머리의 요잉(yawing)(또는 가로 저음 (shaking))을 식별할 수 있다. 일 예로, 프로세서는 z축을 기준으로, 웨어러블 장치의 회전을 식별할 수 있다. 프로세서는 z축 을 기준으로 식별되는 웨어러블 장치의 회전에 기반하여, 사용자의 머리의 롤링(rolling)(또는 갸우뚱함 (tilting))을 식별할 수 있다. 일 실시 예에 따르면, 가상 공간은 3차원으로 구성되기 때문에, 프로세서는 디스플레이를 통해 가상 공간을 모두 표시하지 못할 수 있다. 따라서, 프로세서는 사용자의 시선의 방향에 기반하여, 가 상 공간의 일부를 표시할 수 있다. 예를 들어, 프로세서는 가상 공간 내에서 사용자의 시선의 방향을 식별할 수 있다. 도 5b에서는, 설 명의 편의를 위해 사용자의 시선의 방향이 y축을 기준으로 변경되는 예를 도시하나, 이에 한정되는 것은 아니다. 예를 들어, 프로세서는 가상 공간 내에서 사용자의 시선의 방향이 방향임을 식별할 수 있다. 프 로세서는 방향에 기반하여, 가상 공간의 제1 부분을 디스플레이를 통해 표시할 수 있 다. 예를 들어, 프로세서는 가상 공간 내에서 사용자의 시선의 방향이 방향임을 식별할 수 있다. 프 로세서는 방향에 기반하여, 가상 공간의 제2 부분을 디스플레이를 통해 표시할 수 있 다. 예를 들어, 프로세서는 가상 공간 내에서 사용자의 시선의 방향이 방향임을 식별할 수 있다. 프 로세서는 방향에 기반하여, 가상 공간의 제3 부분을 디스플레이를 통해 표시할 수 있 다. 예를 들어, 프로세서는 가상 공간 내에서 사용자의 시선의 방향이 방향임을 식별할 수 있다. 프 로세서는 방향에 기반하여, 가상 공간의 제4 부분을 디스플레이를 통해 표시할 수 있 다. 상술한 실시 예에서는, 4개의 방향들(551, 552, 553, 554)를 기준으로 가상 공간의 일 부분이 표시되는 예 가 도시되었으나, 이는 예시적인 것이며, 사용자의 시선의 방향은 연속적으로 구성될 수 있다. 프로세서는 연속적으로 변경되는 사용자의 시선의 방향에 기반하여. 디스플레이를 통해 표시되는 가상 공간의 일 부분을 연속적으로 변경할 수 있다. 도 6은, 일 실시 예에 따른, 적어도 하나의 어플리케이션의 실행을 위한 가상 공간의 예를 도시한다. 도 6을 참고하면, 프로세서는 가상 공간을 사용자에게 제공할 수 있다. 가상 공간은 적어 도 하나의 어플리케이션들에 관한 적어도 하나의 인터페이스를 위한 시각적 객체를 포함할 수 있다. 시각 적 객체는 적어도 하나의 어플리케이션들에 관한 적어도 하나의 인터페이스를 제공하기 위해 사용될 수 있 다. 예를 들어, 시각적 객체는 대시(dash)(또는 대시보드(dashboard))로 참조될 수 있다. 프로세서는 시각적 객체 내에서 어플리케이션에 관한 인터페이스를 표시할 수 있다. 예를 들어, 프로 세서는 시각적 객체에 제1 인터페이스, 제2 인터페이스, 및 제3 인터페이스를 표시할 수 있다. 제1 인터페이스는 제1 어플리케이션과 관련될 수 있다. 제2 인터페이스는 제2 어플리케이션 과 관련될 수 있다. 제3 인터페이스는 제3 어플리케이션과 관련될 수 있다. 프로세서는 가상 공간 내에서, 하나 이상의 어플리케이션들을 동시에 실행할 수 있다. 프로세서(41 0)는 가상 공간에 포함된 시각적 객체 내에서, 실행 중인 하나 이상의 어플리케이션들에 관한 하나 이상의 인터페이스들을 표시할 수 있다. 웨어러블 장치의 사용자는 시각적 객체 내에서 하나 이상의 어플리케이션들을 동시에 식별(또는, 사용)할 수 있다. 일 실시 예에 따르면, 프로세서는 가상 공간 내에서 객체를 표시할 수 있다. 예를 들어, 객체 는 도 5에서 도시된 객체에 상응할 수 있다. 일 실시 예에 따르면, 가상 공간은 사용자의 업무 환경과 관련될 수 있다. 프로세서는 무한한 화면(infinite screen), 멀티 윈도우(multi-window), 및/또는 3차원 객체(3D object) 중 적어도 하나를 가상 공간 내에서 제공함으로써, 사용자에게 생산성 높은 경험을 제공할 수 있다. 실시 예에 따라, 프로세서는 웨어러블 장치와 연결된 외부 전자 장치를 가상 공간에서 표시할 수 있다. 예를 들어, 프로세서는 외부 전자 장치를, VST(video see through) 및/또는 OST(optical see through)에 기반하여, 외부 전자 장치를 표시할 수 있다. 프로세서는 외부 전자 장치를 가상 공간 내 에서 표시함으로써, 사용자에게 MDE(multi device experience)를 제공할 수 있다. 실시 예에 따라, 프로세서는 가상 공간 내의 객체, 조도, 테마, 및/또는 환경 중 적어도 하나를 변경 하기 위한 기능을 사용자에게 제공할 수 있다. 프로세서는 사용자에게 가상 공간을 개인화 (personalize)할 수 있는 옵션을 제공할 수 있다. 도 7은, 일 실시 예에 따른, 어플리케이션에 관한 인터페이스를 제공하기 위한 가상 공간의 예를 도시한다. 도 7을 참고하면, 프로세서는 가상 공간을 사용자에게 제공할 수 있다. 예를 들어, 가상 공간 은 지정된 어플리케이션에 관한 인터페이스를 제공하기 위해 구성될 수 있다. 예를 들어, 프로세서는 지정된 어플리케이션의 실행에 기반하여, 가상 공간을 제공할 수 있다. 예를 들어, 가상 공간은 1 개의 어플리케이션에 관련될 수 있다. 실시 예에 따라, 가상 공간 내에서, 다른 어플리케이션의 사용이 제한될 수 있다. 프로세서는 객체 를 통해, 다른 어플리케이션의 사용을 위해, 가상 공간을 전환하기 위한 요소를 표시할 수 있다. 프로세서 는 상기 요소에 대한 입력에 기반하여, 가상 공간을 다른 가상 공간(예: 도 6의 가상 공간)으로 전환하고, 다른 어플리케이션에 관한 인터페이스를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 가상 공간을 통해 하나의 어플리케이션에 관한 인터페이스를 제공하는 동안, 다른 어플리케이션에 대한 정보를 제공하지 못할 수 있다. 사용자는 가상 공간 내에 서, 가상 공간을 다른 가상 공간으로 전환하지 않고, 다른 어플리케이션에 대한 정보를 확인할 수 없을 수 있다. 따라서, 이하 명세서에서는, 가상 공간 내에서, 다른 가상 공간(예: 도 6의 가상 공간)에서 실 행 중인 어플리케이션에 대한 정보(예: 인터페이스 또는 실행 정보)를 표시하기 위한 실시 예가 설명될 것이다. 도 8a는, 일 실시 예에 따른, 가상 공간이 전환되는 예를 도시한다. 도 8b는, 일 실시 예에 따른, 가상 공간이 전환되는 예를 도시한다. 도 8a 및 8b를 참고하면, 웨어러블 장치의 프로세서는 복수의 가상 공간들을 사용자에게 제공할 수 있다. 예를 들어, 프로세서는 가상 공간 내지 가상 공간을 사용자에게 제공할 수 있다. 프로세서는 복수의 가상 공간들을 이동하기 위한 기능을 제공할 수 있다. 예를 들어, 프로세서는 초 기 화면인 가상 공간(또는 가상 공간의 일부)을 디스플레이를 통해 표시할 수 있다. 가상 공간 은 도 5a에 도시된 가상 공간에 상응할 수 있다. 예를 들어, 가상 공간 및 가상 공간 각각은 하나의 어플리케이션에 관한 인터페이스를 제공하도록 구 성될 수 있다. 가상 공간 및 가상 공간 각각은 도 7의 가상 공간에 상응할 수 있다. 예를 들어, 가상 공간, 가상 공간, 및 가상 공간 각각은 도 6의 가상 공간에 상응할 수 있다. 도 8a를 참고하면, 프로세서는 가상 공간 내에서, 다른 가상 공간들 중 하나를 제공하기 위한 경로를 제공할 수 있다. 예를 들어, 프로세서는 가상 공간 내에서 각각의 가상 공간에 대응하는 시각적 객체 를 표시할 수 있다. 프로세서는 가상 공간에 대응하는 시각적 객체에 대한 입력을 식별하는 것에 기 반하여, 디스플레이를 통해 표시되는 가상 공간을 가상 공간으로부터 가상 공간으로 전환할 수 있다. 예를 들어, 프로세서는 디스플레이를 통해 표시되는 가상 공간을 가상 공간으로부터 가상 공간으로 전환하기 위해, 사용자로부터 가상 공간로부터 가상 공간으로 디스플레이를 통해 표시되는 가상 공간을 전환하기 위한 입력을 수신할 수 있다. 디스플레이를 통해 표시되는 가상 공간 이 가상 공간으로 전환된 후, 프로세서는 디스플레이를 통해 표시되는 가상 공간을 가상 공간 으로부터 가상 공간으로 전환하기 위한 입력을 수신할 수 있다. 프로세서는 디스플레이를 통해 표시되는 가상 공간을 가상 공간으로부터 가상 공간으로 전환하기 위한 입력에 기반하여, 가상 공간을 디스플레이를 통해 표시할 수 있다. 따라서, 프로세서는 가상 공간을 전환하기 위해, 항 상 가상 공간으로 이동해야 할 수 있다. 도 8b를 참고하면, 프로세서는 도 8a와 달리, 가상 공간을 통하지 않고, 가상 공간을 전환하기 위한 기능을 제공할 수 있다. 예를 들어, 프로세서는 디스플레이를 통해 표시되는 가상 공간을 가상 공간 으로부터 가상 공간으로 전환하기 위한 입력을 식별하는 것에 기반하여, 가상 공간을 표시하지 않고, 가상 공간을 표시할 수 있다. 도시하지는 않았으나, 프로세서는 디스플레이를 통해 표시되는 가상 공간을 가상 공간으로부터 가상 공간으로 전환하기 위한 입력을 식별하는 것에 기반하여, 가상 공간로부터 가상 공간이 이 동될 수 있음은 물론이다. 이하의 실시 예에 따르면, 프로세서는 도 8b와 같이, 홈 가상 공간에 대응하는 가상 공간을 통하지 않고, 가상 공간들을 전환할 수 있다. 도 9는, 일 실시 예에 따른 웨어러블 장치의 동작에 관한 흐름도를 도시한다. 이하 실시예에서 각 동작들은 순 차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작들의 순서가 변경 될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 도 9를 참고하면, 동작 910에서, 프로세서는 제1 가상 공간이 표시되는 동안, 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을 식별할 수 있다. 예를 들어, 제1 가상 공간은 적어도 하나의 어플리케이션 을 실행하도록 구성될 수 있다. 예를 들어, 제1 가상 공간은, 도 6에 도시된 가상 공간에 상응할 수 있다. 프로세서는 제1 가상 공간 내에서 적어도 하나의 어플리케이션을 실행할 수 있다. 예를 들어, 프로세서 는 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스를 표시 할 수 있다. 예를 들어, 제1 가상 공간은 적어도 하나의 어플리케이션을 실행을 위한 적어도 하나의 영역들을 포함하도록 구성될 수 있다. 프로세서는 적어도 하나의 영역들을 포함하는 시각적 객체(예: 도 6의 시각적 객체)를 제1 가상 공간 내에서 표시할 수 있다. 동작 920에서, 프로세서는 제1 가상 공간 내에서 제1 어플리케이션을 실행하기 위한 입력을 식별할 수 있 다. 예를 들어, 제1 어플리케이션을 실행하기 위한 입력은, 디스플레이를 통해 표시되는 가상 공간을 제1 가상 공간으로부터, 제1 어플리케이션에 따라 제공되는 제2 가상 공간으로 전환하기 위한 입력일 수 있다. 예를 들어, 제1 어플리케이션은 적어도 하나의 어플리케이션과 구별될 수 있다. 예를 들어, 상기 입력은 제1 가상 공 간으로부터, 제1 어플리케이션에 관한 제2 가상 공간으로의 전환을 위한 입력으로 참조될 수 있다. 예를 들어, 상기 입력은 다양하게 설정될 수 있다. 상기 입력은 사용자의 신체의 일부, 외부 장치(예: 리모트 컨트롤러(remote controller), 다른 웨어러블 장치, 키보드, 마우스), 및/또는 음성 입력을 통해 수행될 수 있다. 동작 930에서, 프로세서는 제1 가상 공간을, 제1 어플리케이션에 따라 제공되는 제2 가상 공간으로 전환할 수 있다. 예를 들어, 프로세서는 제1 어플리케이션의 실행에 기반하여, 제1 가상 공간을, 제1 어플리케이 션에 따라 제공되는 제2 가상 공간으로 전환할 수 있다. 예를 들어, 프로세서는 제1 어플리케이션을 실행 하기 위한 입력에 기반하여, 제1 어플리케이션을 실행할 수 있다. 프로세서는 제1 어플리케이션의 실행에 기반하여, 제1 어플리케이션을 통해 제공되는 제2 가상 공간을 표시할 수 있다. 예를 들어, 제2 가상 공간은 제1 어플리케이션과 관련될 수 있다. 제2 가상 공간은 제1 어플리케이션에 관한 인 터페이스를 제공하도록 구성될 수 있다. 예를 들어, 제1 어플리케이션은, 360도의 전 방향으로 구성된 인터페이 스를 제공할 수 있다. 예를 들어, 제1 어플리케이션은 지정된 시야각에 기반하여 구성된 인터페이스를 제공할 수 있다. 예를 들어, 제2 가상 공간은 도 7에 도시된 가상 공간에 상응할 수 있다. 동작 940에서, 프로세서는 제2 가상 공간이 표시되는 동안, 적어도 하나의 어플리케이션 중 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별할 수 있다. 일 실시 예에 따르면, 적어도 하나의 어플리케이션 중 제2 가상 공간이 표시되는 동안 실행되는 제2 어플리케이 션을 식별할 수 있다. 예를 들어, 프로세서는 제1 가상 공간 내에서 실행되었던 적어도 하나의 어플리케이 션 중 제2 가상 공간이 표시되는 동안 실행되는 제2 어플리케이션을 식별할 수 있다. 예를 들어, 프로세서는 제1 가상 공간 내에서 실행되었던 적어도 하나의 어플리케이션 중 백그라운드에서 실행되는 어플리케이션을 식별할 수 있다. 적어도 하나의 어플리케이션 중 제2 어플리케이션은 가상 공간이 전 환되는 경우에도 백그라운드에서 동작할 수 있다. 일 예로, 적어도 하나의 어플리케이션 중 일부는 가상 공간이 전환되는 경우, 종료될 수 있다. 동작 950에서, 프로세서는 제2 가상 공간의 제1 부분을 표시하는 동안, 웨어러블 장치의 모션을 식별 할 수 있다. 예를 들어, 프로세서는 제1 방향에 기반하여 제2 가상 공간의 제1 부분을 표시하는 동안, 웨 어러블 장치의 모션을 식별할 수 있다. 일 실시 예에 따르면, 프로세서는 제1 방향에 기반하여, 제2 가상 공간의 제1 부분을 표시할 수 있다. 예 를 들어, 제1 방향은 정면 방향으로 참조될 수 있다. 프로세서는 제1 가상 공간으로부터 제2 가상 공간으 로의 전환을 위한 입력을 식별하는 것에 기반하여, 제2 가상 공간의 제1 부분을 표시할 수 있다. 예를 들어, 프로세서는 디스플레이를 통해 제2 가상 공간을 모두 표시하지 못할 수 있다. 따라서, 프 로세서는 사용자의 시선이 향하는 방향이 제1 방향임을 식별할 수 있다. 프로세서는 제1 방향에 기반 하여 제2 가상 공간의 제1 부분을 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 웨어러블 장치의 모션을 식별할 수 있다. 프로세서는 센서 (예: 자이로 센서, 관성 센서)를 이용하여 웨어러블 장치의 모션을 식별할 수 있다. 웨어러블 장치 의 모션은 도 5b에서 설명된 웨어러블 장치의 모션과 관련될 수 있다. 예를 들어, 프로세서는 도 5b에서 도시된 y축을 기준으로, 웨어러블 장치의 회전을 식별할 수 있다. 프로세서는 웨어러블 장치(또는 사용자의 머리)의 요잉(yawing)을 식별할 수 있다. 동작 960에서, 프로세서는 제2 가상 공간의 제2 부분 내에서 제2 어플리케이션에 관한 시각적 객체를 표시 할 수 있다. 예를 들어, 프로세서는 웨어러블 장치의 모션에 따라 제1 방향으로부터 변경된 제2 방향 에 기반하여, 제2 가상 공간의 제2 부분 내에서 제2 어플리케이션에 관한 시각적 객체를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 웨어러블 장치의 모션에 따라 제1 방향으로부터 변경된 제2 방향을 식별할 수 있다. 프로세서는 사용자의 시야각(field of view, FoV)가 제1 FoV로부터 제2 FoV로 변경됨을 식별할 수 있다. 프로세서는 제1 FoV에 기반하여, 제2 가상 공간의 제1 부분을 표시할 수 있다. 프로세서 는 제2 FoV에 기반하여, 제2 가상 공간의 제2 부분을 표시할 수 있다. 프로세서는 제2 가상 공간의 제2 부분 내에서 제2 어플리케이션에 관한 시각적 객체를 표시할 수 있다. 예 를 들어, 제2 어플리케이션에 관한 시각적 객체는, 제2 어플리케이션에 관한 인터페이스, 제2 어플리케이션의 기능을 나타내는 시각적 객체 또는 제2 어플리케이션이 실행되는 제1 가상 공간으로 이동하기 위한 시각적 객체 중 하나를 포함할 수 있다. 일 실시 예에 따르면, 제2 어플리케이션에 관한 시각적 객체는 제2 어플리케이션에 관한 인터페이스를 포함할 수 있다. 프로세서는 제2 가상 공간의 제2 부분 내에서, 제1 가상 공간에서 실행 중인 제2 어플리케이션에 관한 인터페이스를 표시할 수 있다. 프로세서는 사용자가 제2 가상 공간 내에서도, 제1 가상 공간 내 에서 실행 중인 제2 어플리케이션에 관한 인터페이스를 표시하는 것에 기반하여, 가상 공간들 간의 연속성을 제 공할 수 있다. 예를 들어, 제2 어플리케이션에 관한 인터페이스는, 제1 가상 공간 내에서 표시되는 인터페이스와 동일 또는 유 사하게 설정될 수 있다. 예를 들어, 제2 어플리케이션에 관한 인터페이스는 축소된 인터페이스로 구성될 수 있 다. 일 예로, 프로세서는 팝업 창의 형태로, 제2 어플리케이션에 관한 인터페이스를 표시할 수 있다. 예를 들어, 제2 어플리케이션에 관한 인터페이스는 제1 어플리케이션에 관한 제2 가상 공간 내에서 투명화되어 표시 될 수 있다. 프로세서는 제2 어플리케이션에 관한 인터페이스를 제2 가상 공간과 다른 레이어어 표시할 수 있다. 프로세서는 제2 가상 공간에 대한 시야를 제한하지 않은 상태에서, 제2 어플리케이션에 관한 인터페 이스를, 제2 가상 공간 내에서 표시할 수 있다. 일 실시 예에 따르면, 제2 어플리케이션에 관한 시각적 객체는 제2 어플리케이션의 기능을 나타내는 시각적 객 체를 포함할 수 있다. 예를 들어, 제2 어플리케이션은 알람 기능을 수행하도록 설정될 수 있다. 프로세서 는 알람 기능을 나타내는 시계 형상의 시각적 객체를 제2 가상 공간 내에서 표시할 수 있다. 예를 들어, 제2 어 플리케이션은 음악 재생 기능을 수행하도록 설정될 수 있다. 프로세서는 음악 재생을 나타내는 음표(또는 재생 버튼) 형상의 시각적 객체를 제2 가상 공간 내에서 표시할 수 있다. 예를 들어, 프로세서는 시각적 객체에 대한 입력에 기반하여, 제2 가상 공간 내에서, 제1 가상 공간 내에 서 실행 중인 제2 어플리케이션에 관한 인터페이스를 표시할 수 있다. 일 실시 예에 따르면, 제2 어플리케이션에 관한 시각적 객체는 제2 어플리케이션이 실행되는 제1 가상 공간으로 이동하기 위한 시각적 객체를 포함할 수 있다. 프로세서는 제2 어플리케이션에 관한 시각적 객체에 대한 입력에 기반하여, 디스플레이를 통해 표시되는 가상 공간을 제1 가상 공간으로부터 제2 가상 공간으로 전 환할 수 있다. 도 10a는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 10a를 참고하면, 상태에서, 프로세서는 제1 가상 공간(또는 제1 가상 공간의 일부분)을 표시할 수 있다. 프로세서는 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이 션을 식별할 수 있다. 프로세서는 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스를 표시할 수 있다. 프로세서는 인터페이스, 인터페이스, 및 인터페이스를 표시할 수 있다. 실시 예에 따라, 프로세서는 객체를 제1 가상 공간 내에서 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 제1 가상 공간으로부터 제1 어플리케이션에 관한 제2 가상 공간 으로의 전환을 위한 입력을 식별할 수 있다. 프로세서는 상기 입력을 식별하는 것에 기반하여, 제2 가상 공간이 표시되는 동안 실행되는 제2 어플리케이션을 식별할 수 있다. 예를 들어, 객체는 제2 가상 공 간으로의 전환을 위한 요소(또는 제1 어플리케이션의 실행을 위한 요소)를 포함할 수 있다. 프로세서 는 상기 요소에 대한 입력을 식별하는 것에 기반하여, 제2 가상 공간이 표시되는 동안 실행되는 제2 어플리케이션을 식별할 수 있다. 예를 들어, 제2 어플리케이션은, 인터페이스에 대응하는 어플리케이션일 수 있다. 예를 들어, 제2 어플리 케이션은 제2 가상 공간이 표시되는 동안 실행될 수 있다. 제2 어플리케이션은 제2 가상 공간이 표 시되는 동안 백그라운드에서 실행될 수 있다. 일 예로, 제1 가상 공간 내에서 실행된 적어도 하나의 어플 리케이션 중 제2 어플리케이션을 제외한 나머지 어플리케이션들은, 제2 가상 공간이 표시되는 동안 실행 되지 않을 수 있다. 예를 들어, 제1 가상 공간 내의 객체는 제1 어플리케이션에 대응하는 요소를 포함할 수 있다. 프로 세서는 제1 어플리케이션에 대응하는 요소에 대한 입력을 식별하는 것에 기반하여, 제1 가상 공간으 로부터 제1 어플리케이션에 관한 제2 가상 공간으로의 전환을 위한 입력을 식별할 수 있다. 상기 입력은 사용자의 신체의 일부, 외부 장치(예: 리모트 컨트롤러(remote controller), 다른 웨어러블 장치, 키보드, 마우 스), 및/또는 음성 입력을 통해 수행될 수 있다.일 실시 예에 따르면, 프로세서는 제1 가상 공간으로부터 제2 가상 공간으로의 전환을 위한 입력을 식별하는 것에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 제1 방향에 기반하여, 제2 가상 공간의 제1 부분을 표시할 수 있다. 프로세서는 웨어러블 장치의 사용자의 시선이 제1 방향을 향함을 식별할 수 있 다. 프로세서는 제1 방향에 기반하여, 제2 가상 공간의 제1 부분을 식별할 수 있다. 프 로세서는 식별된 제2 가상 공간의 제1 부분을 디스플레이를 통해 표시할 수 있다. 예를 들어, 프로세서는 제2 가상 공간의 제1 부분 내에서, 객체를 표시할 수 있다. 프로 세서는 상태에서, 제1 가상 공간에서 표시된 객체를 제2 가상 공간에서도 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 웨어러블 장치의 모션을 식별할 수 있다. 프로세서는 웨어러 블 장치의 모션에 따라 제1 방향으로부터 변경된 제2 방향을 식별할 수 있다. 프로세서 는 웨어러블 장치의 모션에 기반하여, 사용자의 시선의 방향이 제1 방향으로부터 제2 방향으 로 변경됨을 식별할 수 있다. 프로세서는 웨어러블 장치의 모션에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 제2 방향에 기반하여, 제2 가상 공간의 제2 부분 내에서, 제2 어플리케이션에 관한 시각적 객체를 표시할 수 있다. 프로세서는 상태에서, 제2 가상 공 간의 제1 부분에서 표시된 객체를 제2 가상 공간의 제2 부분에서도 표시할 수 있 다. 예를 들어, 제2 어플리케이션은 음악 재생을 위한 어플리케이션을 포함할 수 있다. 프로세서는 제2 어플리 케이션의 기능에 기반하여, 시각적 객체를 표시할 수 있다. 도 10에서는, 제2 어플리케이션이 음악 재생 을 위한 어플리케이션인 경우 시각적 객체가 표시되는 예가 도시되었으나, 이에 한정되는 것은 아니다. 제2 어플리케이션은, 알람을 위한 어플리케이션, 스케줄 관리를 위한 어플리케이션, 및 문서 작업을 위한 어플 리케이션 중 하나일 수 있다. 일 예로, 제2 어플리케이션이 알람을 위한 어플리케이션인 경우, 시각적 객체 의 형상이 알람 시계의 형상으로 설정될 수 있다. 일 예로, 제2 어플리케이션이 스케줄 관리를 위한 어플 리케이션인 경우, 시각적 객체의 형상이 달력의 형상으로 설정될 수 있다. 일 예로, 제2 어플리케이션이 문서 작업을 위한 어플리케이션인 경우, 시각적 객체의 형상의 문서의 형상으로 설정될 수 있다. 일 실시 예에 따르면, 프로세서는 시각적 객체에 대한 입력을 식별할 수 있다. 프로세서는 시 각적 객체에 대한 입력을 식별하는 것에 기반하여, 제2 가상 공간의 제2 부분 내의 지정된 영역 내에서 제2 어플리케이션에 관한 인터페이스를 표시할 수 있다. 프로세서는 제1 가상 공간 내에서 실행되는 제2 어플리케이션에 관한 인터페이스를 제2 가상 공간(또는 제2 가상 공간 의 제2 부분) 내에서 표시할 수 있다. 프로세서는 제1 가상 공간 내에서 실행되는 제2 어플리케이션에 관한 인터페이스를 제2 가상 공간(또는 제2 가상 공간의 제2 부분)에 표시함으로써, 제2 가상 공간 내에서 제2 어플리케이션을 제어할 수 있도록 사용자에게 기능을 제공 할 수 있다. 일 실시 예에 따르면, 프로세서는 시각적 객체에 대한 입력을 식별할 수 있다. 프로세서는 시 각적 객체에 대한 입력을 식별하는 것에 기반하여, 제2 가상 공간으로부터, 제2 어플리케이션이 실 행되는 제1 가상 공간으로의 전환을 수행할 수 있다. 프로세서는 시각적 객체에 대한 입력을 식별하는 것에 기반하여, 디스플레이를 통해 표시되는 가상 공간을 제2 가상 공간으로부터 제1 가상 공간으로 변경할 수 있다. 예를 들어, 프로세서는 시각적 객체에 대한 입력을 식별하는 것에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 프로세서는 제1 가상 공간 내에서 제2 어플리케이션에 관한 인터페이스를 표시할 수 있다. 실시 예에 따라, 프로세 서는 제1 가상 공간 내에서 인터페이스뿐만 아니라, 인터페이스 및 인터페이스를 표시할 수도 있다. 일 실시 예에 따르면, 시각적 객체는 제2 가상 공간 내의 고정된 위치에 배치될 수 있다. 프로세서 는 사용자에 대응하는 아바타가 시각적 객체 상에 위치함을 식별할 수 있다. 프로세서는 사용자에 대응하는 아바타가 시각적 객체 상에 위치함을 식별하는 것에 기반하여, 디스플레이 를 통해 표시되는 가상 공간을 제2 가상 공간으로부터 제1 가상 공간으로 전환할 수 있다. 예를 들어, 프로세서는 사용자에 대응하는 아바타가 시각적 객체 상에 위치함을 식별하는 것에 기반하 여, 가상 공간을 전환할 것인지 여부를 나타내는 알림을 사용자에게 제공할 수 있다. 프로세서는 사 용자로부터 가상 공간의 전환을 지시하는 입력을 식별하는 것에 기반하여, 디스플레이를 통해 표시되 는 가상 공간을 제2 가상 공간으로부터 제1 가상 공간으로 전환할 수 있다. 프로세서는 디스 플레이를 통해 표시되는 가상 공간을 제2 가상 공간으로부터 제1 가상 공간으로 전환함으로써, 공간 전이를 수행할 수 있다. 프로세서는 도 8a에서 도시된 가상 공간에 대응하는 홈 가상 공간을 경유하지 않고, 디스플레이를 통해 표시되는 가상 공간을 제2 가상 공간으로부터 제1 가상 공간으로 전환할 수 있다. 실시 예에 따라, 프로세서는 제2 가상 공간의 제2 부분 내에서 인터페이스, 인터페이스 , 및 인터페이스을 포함하는 시각적 객체(미도시)를 표시할 수 있다. 프로세서는 제2 가상 공 간과 구별되는 제1 가상 공간 내에서 실행 중인 인터페이스들을, 제2 가상 공간의 제2 부분 내에서 표시할 수 있다. 도 10b는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 10b를 참고하면, 상태에서, 프로세서는 제1 가상 공간(또는 제1 가상 공간의 일부분)을 표시할 수 있다. 프로세서는 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이 션을 식별할 수 있다. 프로세서는 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스를 표시할 수 있다. 프로세서는 인터페이스, 인터페이스, 및 인터페이스를 표시할 수 있다. 실시 예에 따라, 프로세서는 객체를 가상 공간 내에서 표시할 수 있다. 예를 들어, 객체가 표 시되는 위치는 다양하게 설정될 수 있다. 일 예로, 객체는 가상 공간(예: 제1 가상 공간)의 엣지 영 역 또는 상단 영역 중 적어도 하나에 표시될 수 있다. 예를 들어, 프로세서는 방향에 기반하여, 제1 가상 공간(또는 제1 가상 공간의 일부)를 표시할 수 있다. 프로세서는 사용자의 시선의 방향이 방향임을 식별하고, 시야각에 기반하여, 제1 가상 공간을 표시할 수 있다. 실시 예에 따라, 시야각의 크기는 가상 공간의 타입 또는 실행되 는 어플리케이션의 타입 중 적어도 하나에 기반하여 변경될 수 있다. 일 실시 예에 따르면, 프로세서는 가상 공간으로부터 제1 어플리케이션에 관한 제2 가상 공간(107 0)으로의 전환을 위한 입력을 식별할 수 있다. 예를 들어, 입력는 제1 어플리케이션에 관한 인터페이스에 대한 입력을 포함할 수 있다. 예를 들어, 입력은 웨어러블 장치와 연결된 외부 전자 장치(예: 컨트롤러)를 통해 수행될 수 있다. 예를 들어, 입력은 웨어러블 장치의 사용자의 신체의 일부, 외부 장치(예: 리모트 컨트롤러(remote controller), 다른 웨어러블 장치, 키보드, 마우스), 및/또는 음성 입력을 통해 수행될 수 있다. 일 실시 예에 따르면, 프로세서는 인터페이스에 대한 입력을 식별하는 것에 기반하여, 제2 가 상 공간이 표시되는 동안 실행되는 제2 어플리케이션을 식별할 수 있다. 예를 들어, 제2 어플리케이션은, 인터페이스에 대응하는 어플리케이션일 수 있다. 예를 들어, 제2 어플리 케이션은 제2 가상 공간이 표시되는 동안 제1 가상 공간 내에서 실행될 수 있다. 제2 어플리케이션 은 제2 가상 공간이 표시되는 동안 백그라운드에서 실행될 수 있다. 일 예로, 제1 가상 공간 내에 서 실행된 적어도 하나의 어플리케이션 중 제2 어플리케이션을 제외한 나머지 어플리케이션들은, 제2 가상 공간 이 표시되는 동안 실행되지 않을 수 있다. 일 실시 예에 따르면, 프로세서는 입력을 식별하는 것에 기반하여, 웨어러블 장치의 상태를 상 태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 방향에 기반하여, 제2 가상 공간의 제1 부분을 표시할 수 있다. 프로세서는 웨어러블 장치의 사용자의 시선이 방향을 향함을 식별할 수 있다. 프로 세서는 방향에 기반하여, 제2 가상 공간의 제1 부분을 식별할 수 있다. 프로세서 는 식별된 제2 가상 공간의 제1 부분을 디스플레이를 통해 표시할 수 있다. 예를 들어, 프로 세서는 인터페이스에 대한 입력을 식별하는 것에 기반하여, 제2 가상 공간의 제1 부분를 표시하기 위한 시야각을 변경할 수 있다. 프로세서는 제2 가상 공간의 제1 부분를 표시하기 위한 시야각을 시야각으로 설정할 수 있다. 일 예로, 프로세서는 제1 어플리케이션의 실행 에 기반하여, 시야각을 더 넓게 변경할 수 있다. 프로세서는 적어도 하나의 어플리케이션을 표시하기 위한 제1 가상 공간으로부터 전환된 제2 가상 공간의 표시를 위해, 더 넓은 시야각(예: 시야각)을 제공할 수 있다. 예를 들어, 프로세서는 제2 가상 공간의 제1 부분 내에서, 제1 가상 공간 내에서 실행 중인 제2 어플리케이션을 식별할 수 있다. 프로세서는 제1 가상 공간 내에서 실행 중인 제2 어플리 케이션에 관한 객체을 제2 가상 공간의 제1 부분 내에서, 표시할 수 있다. 웨어러블 장치 의 사용자는 객체을 이용하여, 제1 가상 공간 내에서 실행 중인 제2 어플리케이션을 제어할 수 있다. 예를 들어, 프로세서는 제2 가상 공간의 제1 부분 내에서, 가상 공간내에서 표시되었던 객체를 제거할 수 있다. 프로세서는 객체가 축소된 객체를 표시할 수 있다. 도시하지는 않았으나, 프로세서는 객체에 대한 입력에 기반하여, 제2 가상 공간의 제1 부분 내에서 객체를 표시할 수 있다. 도시하지는 않았으나, 프로세서는 객체 상에 사용자의 시선이 위치됨 을 식별하는 것에 기반하여, 제2 가상 공간의 제1 부분 내에서 객체를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 웨어러블 장치의 모션을 식별할 수 있다. 프로세서는 웨어러 블 장치의 모션에 따라 방향으로부터 변경된 방향을 식별할 수 있다. 프로세서는 웨어러 블 장치의 모션에 기반하여, 사용자의 시선의 방향이 방향으로부터 방향으로 변경됨을 식별할 수 있다. 프로세서는 웨어러블 장치의 모션에 기반하여, 웨어러블 장치의 상태를 상태로 부터 상태로 변경할 수 있다. 실시 예에 따라, 프로세서는 사용자의 시선의 방향이 임계 각도를 초 과하여 회전되는 것에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 제2 가상 공간의 제2 부분을 표시할 수 있다. 프로세서는 제2 가상 공간의 제1 부분로부터 제2 가상 공간의 제3 부분으로 화면이 전환되는 동안, 제2 가상 공간의 제2 부분을 표시할 수 있다. 상태에서, 제2 가상 공간의 제2 부분은, 제1 부분의 일부 및 제3 부분의 일부 를 포함할 수 있다. 예를 들어, 프로세서는 제1 부분의 외곽을 나타내는 영역를 강조 (highlight)할 수 있다. 예를 들어, 프로세서는 영역의 색상을 그라데이션(gradation) 기법에 기반 하여 변경함으로써, 영역를 강조할 수 있다. 프로세서는 영역 내에, 제1 가상 공간 내에서 실행 중인 제2 어플리케이션에 관한 객체(108 1)을 표시할 수 있다. 프로세서는 제2 가상 공간의 제1 부분로부터 제2 가상 공간의 제 3 부분으로 화면이 전환되는 동안, 객체을 제거하고, 영역 내에 객체을 표시할 수 있 다. 예를 들어, 프로세서는 제2 가상 공간의 제1 부분로부터 제2 가상 공간의 제3 부분 으로 화면이 전환되는 동안, 객체의 표시를 유지할 수 있다. 일 실시 예에 따르면, 프로세서는 웨어러블 장치의 모션에 따라 방향으로부터 변경된 방향 을 식별할 수 있다. 프로세서는 사용자의 시선의 방향이 방향으로부터 방향으로 변경됨 을 식별할 수 있다. 프로세서는 사용자의 시선의 방향이 방향으로부터 방향으로 변경됨을 식 별하는 것에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 제2 가상 공간의 제3 부분을 표시할 수 있다. 프로세서는 제2 가상 공간의 제3 부분 내에서, 제1 가상 공간에서 표시된 적어도 하나의 인터페이스를 표시할 수 있다. 예를 들어, 프로세서는 인터페이스에 상응하는 인터페이스를 제2 가상 공간 의 제3 부분 내에서 표시할 수 있다. 프로세서는 인터페이스에 상응하는 인터페이스 를 제2 가상 공간의 제3 부분 내에서 표시할 수 있다. 예를 들어, 프로세서는 상태 에서 표시된 인터페이스, 인터페이스, 및 인터페이스 중 현재 실행 중인 제1 어플리케 이션에 상응하는 인터페이스를 제외한 나머지 인터페이스들을 표시할 수 있다. 따라서, 프로세서는 인터페이스에 상응하는 인터페이스 및 인터페이스에 상응하는 인터페이스를 제2 가상 공간의 제3 부분 내에서 표시할 수 있다. 예를 들어, 프로세서는 제1 어플리케이션에 관한 기능을 표시하기 위한 제2 가상 공간의 제1 부분 과 구별되는 제2 가상 공간의 제3 부분 내에서, 제1 가상 공간에서 실행되는(또는 실 행 중인) 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스(예: 인터페이스, 인터페이스 )를 표시할 수 있다. 실시 예에 따라, 프로세서는 제2 가상 공간의 제3 부분 내에서 제1 가상 공간 내에서 실행 중인 제2 어플리케이션에 관한 인터페이스(예: 인터페이스)를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 가상 공간의 제1 부분 내에서 제1 어플리케이션에 관한 화면이 표시되는 중임을 나타내기 위해, 제3 부분의 외곽을 나타내는 영역을 강조할 수 있다. 예를 들어, 프로세서는 영역의 색상을 변경함으로써, 3 부분의 외곽을 나타내는 영역을 강조 할 수 있다. 예를 들어, 프로세서는 영역의 색상을 그라데이션(gradation) 기법에 기반하여 변경할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 가상 공간의 제3 부분 내에서, 객체을 표시할 수 있다. 프로세서는 객체를 제거하고, 객체을 표시할 수 있다. 도 11은, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 11을 참고하면, 상태에서, 프로세서는 제1 가상 공간을 디스플레이를 통해 표시할 수 있다. 예를 들어, 프로세서는 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을 식별할 수 있다. 프로세서는 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스를 표시할 수 있다. 상태는 도 10의 상태에 상응할 수 있다. 일 실시 예에 따르면, 프로세서는 가상 공간으로부터 제1 어플리케이션에 관한 제2 가상 공간(112 0)으로의 전환을 위한 입력을 식별할 수 있다. 프로세서는 상기 입력을 식별하는 것에 기반하여, 제2 가상 공간이 표시되는 동안 실행되는 제2 어플리케이션을 식별할 수 있다. 일 실시 예에 따르면, 프로세서는 제1 가상 공간으로부터 제2 가상 공간으로의 전환을 위한 입력을 식별하는 것에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 제1 방향에 기반하여, 제2 가상 공간의 제1 부분을 표시할 수 있다. 프로세서는 웨어러블 장치의 사용자의 시선이 제1 방향을 향함을 식별할 수 있 다. 프로세서는 제1 방향에 기반하여, 제2 가상 공간의 제1 부분을 식별할 수 있다. 프 로세서는 식별된 제2 가상 공간의 제1 부분을 디스플레이를 통해 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 가상 공간의 제1 부분 내에서 객체를 표시할 수 있다. 프로세서는 제2 가상 공간의 제1 부분 내의 지정된 영역 상에서, 제2 가상 공간 과 구별되는 하나 이상의 가상 공간들(예: 제1 가상 공간) 내에서 실행 중인 하나 이상의 어플리케이션들 에 관한 하나 이상의 요소들(예: 요소, 요소, 요소, 및 요소)를 포함하는 객체 를 표시할 수 있다. 예를 들어, 요소는 어포던스(affordance), 온 고잉 어포던스(on-going affordance), 또는 어플리케이션의 기능에 관한 시각적 객체로 참조될 수 있다. 예를 들어, 프로세서는 제1 가상 공간에서 객체를 표시할 수 있다. 프로세서는 디스플레 이를 통해 표시되는 가상 공간이 제1 가상 공간으로부터 제2 가상 공간으로 변경됨을 식별하 는 것에 기반하여, 객체에 제2 가상 공간과 구별되는 하나 이상의 가상 공간들(예: 제1 가상 공간 ) 내에서 실행 중인 하나 이상의 어플리케이션들에 관한 하나 이상의 요소들(예: 요소, 요소 , 요소, 및 요소)을 표시할 수 있다. 예를 들어, 프로세서는 제2 가상 공간과 구별되는 하나 이상의 가상 공간들 중 하나인 제1 가상 공 간 내에서 실행 중인 어플리케이션을 식별할 수 있다. 프로세서는 제1 가상 공간 내에서 실행 중인 어플리케이션에 관한 요소를 객체 내에 표시할 수 있다. 일 실시 예에 따르면, 하나 이상의 요소들 각각은 어플리케이션의 실행 정보에 기반하여 표시될 수 있다. 일 예 로, 하나 이상의 요소들 각각은 어플리케이션의 타입, 어플리케이션의 기능, 어플리케이션의 기능의 진행률, 동 작 시간, 및 동작의 수행 종료까지 남은 시간 중 적어도 하나에 기반하여 표시될 수 있다. 예를 들어, 제1 가상 공간 내에서 실행 중인 어플리케이션은 음악 재생 어플리케이션일 수 있다. 프로세 서는 제1 가상 공간 내에서 실행 중인 음악 재생 어플리케이션에 관한 요소를 객체 내에 표시할 수 있다. 일 예로, 요소는 음악 재생 어플리케이션을 나타내는 이미지, 재생되는 음악의 타 임라인에 상응하는 인디케이터, 및 음악 재생 중임을 나타내는 이미지를 포함할 수 있다. 일 예로, 인디케이터는 이미지 및 이미지에 중첩으로 표시될 수 있다. 예를 들어, 제1 가상 공간 내에서 실행 중인 어플리케이션은 알람(또는 시계) 어플리케이션일 수 있다. 프로세서는 제1 가상 공간 내에서 실행 중인 알람 어플리케이션에 관한 요소를 객체 내 에 표시할 수 있다. 일 예로, 요소는 알람 어플리케이션을 나타내는 이미지, 설정된 시간에 대한 남은 시간의 비율을 나타내는 인디케이터, 및 남은 시간을 나타내는 텍스트를 포함할 수 있다. 일 예로, 인디케이터는 이미지 및 텍스트에 중첩으로 표시될 수 있다. 예를 들어, 제1 가상 공간 내에서 실행 중인 어플리케이션은 녹음(또는 녹화) 어플리케이션일 수 있다. 프로세서는 제1 가상 공간 내에서 실행 중인 녹음(또는 녹화) 어플리케이션에 관한 요소를 객 체 내에 표시할 수 있다. 일 예로, 요소는 녹음(또는 녹화) 어플리케이션을 나타내는 이미지 및 녹음(또는 녹화)가 수행된 시간을 나타내는 텍스트를 포함할 수 있다. 예를 들어, 제1 가상 공간 내에서 실행 중인 어플리케이션은 인터넷 어플리케이션일 수 있다. 프로세서 는 제1 가상 공간 내에서 실행 중인 인터넷 어플리케이션에 관한 요소를 객체 내에 표시 할 수 있다. 일 예로, 요소는 인터넷 어플리케이션을 나타내는 이미지, 인터넷을 통해 다운로드 중 인 콘텐트의 진행도를 나타내는 인디케이터, 및 남은 시간을 나타내는 텍스트를 포함할 수 있다. 일 예로, 인디케이터는 이미지 및 텍스트에 중첩으로 표시될 수 있다. 상술한 예와 같이, 프로세서는 제2 가상 공간과 구별되는 하나 이상의 가상 공간들 내에서 실행 중 인 하나 이상의 어플리케이션들을 식별할 수 있다. 예를 들어, 프로세서는 제2 가상 공간이 표시되 는 동안, 백그라운드에서 실행 중인 하나 이상의 어플리케이션들을 식별할 수 있다. 프로세서는 하나 이상 의 어플리케이션들에 관한 하나 이상의 요소들을 제2 가상 공간의 제1 부분 내의 지정된 영역 상에 서 표시되는 객체 내에 표시할 수 있다. 도 12a는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 12b는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 12a를 참고하면, 프로세서는 제2 가상 공간을 표시할 수 있다. 프로세서는 제2 가상 공간 내에서, 제1 어플리케이션에 관한 인터페이스를 표시할 수 있다. 실시 예에 따라, 프로세서 는 제2 가상 공간 내에서, 복수의 어플리케이션들을 실행할 수 있다. 도시하지는 않았으나, 프로세서 는 복수의 어플리케이션들에 관한 복수의 인터페이스들을 제2 가상 공간에 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 가상 공간 내에서, 객체를 표시할 수 있다. 객체는 도 5a에 도시된 객체에 상응할 수 있다. 프로세서는 제2 가상 공간과 구별되는 제1 가상 공간 (미도시)에서 실행 중인 제2 어플리케이션을 식별할 수 있다. 예를 들어, 프로세서는 제2 가상 공간(121 0)을 표시하는 동안, 백그라운드에서 제2 어플리케이션을 실행할 수 있다. 프로세서는 제2 가상 공간 을 표시하는 동안 실행 중인 제2 어플리케이션에 관한 요소를 객체 내에 표시할 수 있다. 예를 들어, 프로세서는 요소를 객체 내에 표시함으로써, 제2 가상 공간과 다른 가상 공간 내의 제2 어플리케이션이 백그라운드에서 실행 중임을 지시할 수 있다. 일 실시 예에 따르면, 프로세서는 요소에 대한 입력을 식별할 수 있다. 프로세서는 요소에 대한 입력에 기반하여, 요소에 대응하는 제2 어플리케이션에 관한 인터페이스를 표시할 수 있다. 예를 들어, 프로세서는 요소에 대한 입력에 응답하여, 제2 어플리케이션에 관한 인터페이스를 프롬프트 UI(prompt user interface), 팝업 창(pop-up window), 분할화면, 및/또는 PIP(picture in picture) 중 하나에 기반하여, 표시할 수 있다. 일 예로, 프로세서는 제2 가상 공간 내에서 표시되는 제1 어플리케이션에 관한 인터페이스에 중첩으로 제2 어플리케이션에 관한 인터페이스를 표시할 수 있다. 일 예로, 프로세서는 요소에 대한 입력에 응답하여, 제2 가상 공간 내의 적어도 하나의 인터페 이스를 위한 시각적 객체(예: 도 6의 시각적 객체)를 구분할 수 있다. 프로세서는 제2 가상 공 간 내의 적어도 하나의 인터페이스를 위한 시각적 객체의 영역을 제1 영역 및 제2 영역으로 구분할 수 있다. 프로세서는 제1 영역 내에서, 제2 가상 공간 내에서 실행되는 제1 어플리케이션에 관한 인 터페이스를 표시할 수 있다. 프로세서는 제2 영역 내에서, 제1 가상 공간(미도시) 내에서 실행되는 제2 어플리케이션에 관한 인터페이스를 표시할 수 있다. 도 12b를 참고하면, 프로세서는 객체 내에 표시된 요소에 대한 입력을 식별할 수 있다. 예를 들 어, 프로세서는 리모트 컨트롤러를 통해 요소에 대한 입력을 식별할 수 있다. 예를 들어, 프로 세서는 사용자의 신체의 일부(예: 손 또는 손가락)을 통해 요소에 대한 입력을 식별할 수 있다. 예를 들어, 프로세서는 리모트 컨트롤러와 통신을 수행할 수 있다. 프로세서는 리모트 컨트롤 러로부터 수신된 정보에 기반하여, 리모트 컨트롤러가 향하는 방향을 식별할 수 있다. 예를 들어, 리모트 컨트롤러로부터 수신되는 정보는, 리모트 컨트롤러에 포함된 IMU에 의해 식별된, 리 모트 컨트롤러에 대한 모션에 대한 데이터를 포함할 수 있다. 리모트 컨트롤러의 모션은, 리모트 컨트롤러를 쥔 사용자의 손에 의해 발생될 수 있다. 예를 들어, 프로세서는 리모트 컨트롤러가 향하는 방향에 기반하여, 요소에 대한 입력을 식별할 수 있다. 프로세서는 리모트 컨트롤러가 항하는 방향을 나타내는 객체(예: 빔(beam)) 를 표시할 수 있다. 프로세서는, 상기 객체가 요소를 지시하는 동안, 리모트 컨트롤러의 버튼 에 대한 입력을 식별할 수 있다. 프로세서는 상기 리모트 컨트롤러의 버튼에 대한 입력에 기반하여, 제2 어플리케이션에 관한 인터페이스를 요소와 연계로 표시할 수 있다. 예를 들어, 인터페이스 는 요소가 포함된 객체의 상단 영역에 표시될 수 있다. 예를 들어, 인터페이스는 시각적 객체와 구별되는 영역 내에서 표시될 수 있다. 실시 예에 따라, 프로세서는 리모트 컨트롤러가 향하는 방향을 나타내는 객체(예: 빔(beam)) 를 표시할 수 있다. 프로세서는, 상기 객체가 요소를 지시하는 것에 기반하여, 제2 어플리케이션에 관한 인터페이스를 요소와 연계로 표시할 수 있다. 예를 들어, 인터페이스는 요소가 포 함된 객체의 상단 영역에 표시될 수 있다. 도 12b에서는 리모트 컨트롤러를 통해 입력을 수행하는 동작을 도시하였으나, 이에 한정되는 것은 아니다. 웨어러블 장치에서 식별 가능한 입력들(예: 요소에 대한 입력, 가상 공간의 전환을 위한 입 력)은 사용자의 신체의 일부, 외부 장치(예: 리모트 컨트롤러, 다른 웨어러블 장치(예: 워치), 키보드, 마우 스), 및/또는 음성 입력 중 적어도 하나를 통해 수행될 수 있다. 도 13은, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 13을 참고하면, 상태에서, 프로세서는 디스플레이를 통해 제2 가상 공간의 제1 부분 을 표시할 수 있다. 프로세서는 가상 공간의 제1 부분 내에서 객체를 표시할 수 있다. 예를 들어, 객체는 도 5a에 도시된 객체에 상응할 수 있다. 예를 들어, 제2 가상 공간은 제1 어플리케이션의 실행에 기반하여 제공될 수 있다. 일 실시 예에 따르면, 프로세서는 객체에 제2 가상 공간과 구별되는 다른 가상 공간에서 실행 되는 제2 어플리케이션을 식별할 수 있다. 예를 들어, 프로세서는 제2 가상 공간이 표시되는 동안, 백그라운드에서 실행되는 제2 어플리케이션을 식별할 수 있다. 프로세서는 제2 어플리케이션에 관한 요소 를 객체 내에 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 객체를 제거하기 위한 입력을 식별할 수 있다. 예를 들어, 프로세 서는 제2 가상 공간의 제1 부분에서 객체의 표시를 제거하기 위한 입력을 식별할 수 있 다. 예를 들어, 프로세서는 제2 가상 공간 내에서 객체의 표시를 숨기기 위한 입력을 식별할 수 있다. 예를 들어, 프로세서는 객체의 표시 모드를 변경할 수 있다. 프로세서는 객체의 표시 모드 를 일반 모드 및 숨김 모드 중 하나로 설정할 수 있다. 프로세서는 객체의 표시 모드를 일반 모드로 부터 숨김 모드로 변경하는 것에 기반하여, 제2 가상 공간 내에서 객체를 표시하지 않을 수 있다. 실시 예에 따라, 프로세서는 지정된 동작(또는 입력)에 기반하여, 제2 가상 공간 내에서 객체 를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 객체를 제거하기 위한 입력을 식별하는 것에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 객체를 제거하기 위한 입력에 기반하여, 객체를 제2 가상 공간 내에서 표시하지 않을 수 있다. 프로세서는 객체에 포함된 요소를 식별할 수 있다. 프로 세서는 요소가 객체와 함께 표시되지 않음을 식별하는 것에 기반하여, 요소에 대응하는 제 2 어플리케이션에 관한 인터페이스를 제2 가상 공간의 제1 부분에 표시할 수 있다. 예를 들어, 프로세서는 제2 가상 공간이 표시되는 동안, 제2 어플리케이션이 실행 중임을 지시하는 요소가 표시되지 않음을 식별하는 것에 기반하여, 제2 어플리케이션에 관한 인터페이스를 제2 가상 공간(또는 제2 가상 공간의 제1 부분)에 표시할 수 있다. 도 14는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 14를 참고하면, 상태에서, 프로세서는 제1 가상 공간(또는 가상 공간의 일 부분)을 표시할 수 있다. 프로세서는 가상 공간내에서, 제1 어플리케이션에 관한 인터페이스, 제2 어 플리케이션에 관한 인터페이스, 및 제3 어플리케이션에 관한 인터페이스를 표시할 수 있다. 프로세 서는 가상 공간 내에서, 객체를 표시할 수 있다. 객체는 도 5a의 객체에 상응할 수 있다. 예를 들어, 프로세서는 제1 가상 공간을 제2 가상 공간으로 전환하기 위한 입력을 식별할 수 있다. 객체는 제2 가상 공간을 제공하기 위한 제4 어플리케이션의 실행을 위한 요소를 포함할 수 있다. 프로세서는 요소에 대한 입력에 기반하여, 제1 가상 공간을 제2 가상 공간으 로 전환하기 위한 입력을 식별할 수 있다. 프로세서는 제1 가상 공간을 제2 가상 공간으로 전 환하기 위한 입력에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 제4 어플리케이션의 실행에 기반하여, 제2 가상 공간(또는 제2 가상 공 간의 일 부분)을 디스플레이를 통해 표시할 수 있다. 프로세서는 제2 가상 공간 내에 객 체를 표시할 수 있다. 프로세서는 디스플레이를 통해 표시되는 가상 공간이 변경되는 경우에도, 객체의 표시를 유지할 수 있다. 예를 들어, 프로세서는 제1 가상 공간에서 실행된 제1 어플리케이션, 제2 어플리케이션, 및 제3 어 플리케이션 중, 제2 가상 공간이 표시되는 동안 실행되는 어플리케이션을 식별할 수 있다. 프로세서(41 0)는 제2 가상 공간이 표시되는 동안, 제1 어플리케이션 및 제2 어플리케이션이 실행됨을 식별할 수 있다. 프로세서는 객체에 제1 어플리케이션이 실행 중임을 나타내는 요소를 표시할 수 있다. 프 로세서는 객체에 제2 어플리케이션이 실행 중임을 나타내는 요소를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 가상 공간을 제공하는 제4 어플리케이션의 실행이 중단됨을 식별하는 것에 기반하여, 제1 가상 공간을 표시할 수 있다. 프로세서는 제1 가상 공간 내에서, 요소 및 요소를 객체로부터 제거할 수 있다. 프로세서는 요소 및 요소 를 객체로부터 제거하는 것에 기반하여, 제1 어플리케이션에 관한 인터페이스 및 제2 어플리케이션 에 관한 인터페이스를 표시할 수 있다. 프로세서는 인터페이스 및 인터페이스와 함께 제3 어플리케이션에 관한 인터페이스를 표시할 수 있다. 예를 들어, 프로세서는 제2 가상 공간 을 제공하는 제4 어플리케이션의 실행이 중단됨을 식별하는 것에 기반하여, 웨어러블 장치의 상태를 상태로부터 상태로 변경할 수 있다. 도 15는, 일 실시 예에 따른, 제1 가상 공간 내에서 실행 중인 어플리케이션을 표시하기 위한 웨어러블 장치의 동작의 예를 도시한다. 도 15를 참고하면, 상태에서, 프로세서는 가상 공간(또는 가상 공간의 일 부분)을 디스 플레이를 통해 표시할 수 있다. 프로세서는 가상 공간을 포함하는 하나 이상의 가상 공간들에 서 실행 중인 어플리케이션들을 표시하기 위한 요소를 객체 내에 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 요소에 대한 입력을 식별할 수 있다. 프로세서는 웨어러블 장치의 설정 값에 따라, 웨어러블 장치의 상태를 상태로부터, 상태 및 상태 중 하 나로 변경할 수 있다. 상태에서, 프로세서는, 요소에 대한 입력을 식별하는 것에 기반하여, 하나 이상의 시각적 객 체들을 가상 공간 내에서 표시할 수 있다. 예를 들어, 하나 이상의 시각적 객체들은 시각적 객체(1520-1), 시각적 객체(1520-2), 및 시각적 객체(1520-3)를 포함할 수 있다. 일 예로, 시각적 객체(1520- 1)는 가상 공간 내의 적어도 하나의 인터페이스를 제공하기 위한 시각적 객체에 상응할 수 있다. 일 예로, 시각적 객체(1520-2) 및 시각적 객체(1520-3) 각각은 가상 공간과 구별되는 다른 가상 공간 내의 적어도 하나의 인터페이스를 제공하기 위한 시각적 객체에 상응할 수 있다. 예를 들어, 하나 이상의 시각적 객 체들 각각은 실행 중인 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스를 표시할 수 있다. 일 예로, 시각적 객체(1520-1)는 시각적 객체(1520-1)가 표시되는 가상 공간 내에서 실행 중인 적어도 하 나의 어플리케이션들에 관한 적어도 하나의 인터페이스를 포함할 수 있다. 일 예로, 시각적 객체(1520-2)는 시 각적 객체(1520-2)가 표시되는 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션들에 관한 적어도 하나 의 인터페이스를 포함할 수 있다. 일 예로, 시각적 객체(1520-3)는 시각적 객체(1520-3)가 표시되는 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션들에 관한 적어도 하나의 인터페이스를 포함할 수 있다. 예를 들어, 시각적 객체(1520-1)는 가상 공간 내에서 적어도 하나의 인터페이스를 제공하기 위해 사용될 수 있다. 시각적 객체(1520-1)는 하나 이상의 시각적 객체들의 가장 상단에 표시될 수 있다. 실시 예에 따라, 프로세서는 시각적 객체(1520-2)에 대한 입력을 식별하는 것에 기반하여, 시각적 객체 (1520-2)에 대응하는 가상 공간으로, 디스플레이를 통해 표시되는 가상 공간을 변경할 수 있다. 프로세서 는 변경된 가상 공간 내에서, 시각적 객체(1520-2)를 표시할 수 있다. 상태에서, 프로세서는, 요소에 대한 입력을 식별하는 것에 기반하여, 웨어러블 장치 내 에서 실행 중인 하나 이상의 어플리케이션들에 관한 하나 이상의 인터페이스들을 표시할 수 있다. 예를 들어, 프로세서는 가상 공간 내에서 실행 중인 어플리케이션들 뿐만 아니라, 가상 공간과 구 별되는 다른 가상 공간 내에서 실행 중인 어플리케이션들을 식별할 수 있다. 프로세서는 웨어러블 장치 내에서 실행 중인 하나 이상의 어플리케이션들에 관한 하나 이상의 인터페이스들을 표시할 수 있다. 예를 들어, 인터페이스(1530-1), 인터페이스(1530-2), 및 인터페이스(1530-3)에 각각 대응하는 어플리케 이션은, 가상 공간 내에서 실행 중일 수 있다. 도시하지는 않았으나, 프로세서는 가상 공간과 구별되는 다른 가상 공간 내에서 실행 중인 어플리케이션들의 인터페이스들을 표시할 수 있다. 도시하지는 않았으나, 실시 예에 따라, 프로세서는 스택(stack), 리스트(list), 그리드(grid), 캐러셀 (carousel), 슬림 리스트, 및/또는 수직 스택 중 하나에 기반하여, 웨어러블 장치에서 실행 중인 어플리케 이션들에 관한 인터페이스들을, 표시할 수 있다. 도 16은, 일 실시 예에 따른, 제1 가상 공간 내에서 실행 중인 어플리케이션을 표시하기 위한 웨어러블 장치의 동작의 예를 도시한다. 도 16을 참고하면, 상태에서, 프로세서는 가상 공간을 디스플레이를 통해 표시할 수 있 다. 프로세서는 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션들에 관한 적어도 하나의 인터페이스를 표시하기 위한 시각적 객체를 표시할 수 있다. 예를 들어, 시각적 객체는 적어도 하 나의 인터페이스를 표시하기 위한 적어도 하나의 영역을 포함할 수 있다. 예를 들어, 프로세서는 객체 를 표시할 수 있다. 일 예로, 객체는 도 5a의 객체에 상응할 수 있다. 예를 들어, 시각적 객체는 제1 어플리케이션에 관한 인터페이스를 포함할 수 있다. 프로세서 는 제1 어플리케이션의 실행에 기반하여, 시각적 객체 내에 인터페이스를 표시할 수 있다. 프로세 서는 시각적 객체 내에 인터페이스가 표시되는 동안, 제2 어플리케이션의 실행을 위한 입력을식별할 수 있다. 프로세서는 제2 어플리케이션의 실행을 위한 입력에 기반하여, 웨어러블 장치의 상 태를 상태로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 시각적 객체 내에서, 제2 어플리케이션에 관한 인터페이스를 표 시할 수 있다. 예를 들어, 프로세서는 인터페이스를 상태에서 인터페이스가 배치된 영 역 상에 표시할 수 있다. 프로세서는 제2 어플리케이션의 실행에 기반하여, 제1 어플리케이션을 백그라운 드에서 실행할 수 있다. 프로세서는 제1 어플리케이션을 백그라운드에서 실행하는 것에 기반하여, 시각적 객체 내에서 인터페이스를 제거할 수 있다. 프로세서는 제1 어플리케이션을 백그라운드에서 실행하는 것에 기반하여, 객체 내에 요소를 표시할 수 있다. 프로세서는 제1 어플리케이션이 백그라운드에서 실행 중임을 나타내는 요소를 표시할 수 있다. 일 실시 예에 따르면, 프로세서는 객체 내에서 요소가 표시되는 동안, 요소에 대한 입력 을 식별할 수 있다. 프로세서는 요소에 대한 입력에 기반하여, 웨어러블 장치의 상태를 상태 로부터 상태로 변경할 수 있다. 상태에서, 프로세서는 요소에 대한 입력에 기반하여, 인터페이스를 표시할 수 있다. 예 를 들어, 인터페이스는 상태에서 표시된 인터페이스와 구별될 수 있다. 프로세서는 인 터페이스 보다 축소된 인터페이스를 가상 공간 내에 표시할 수 있다. 예를 들어, 인터페이스 는 요소와 연계로 표시될 수 있다. 예를 들어, 인터페이스는 시각적 객체에 중첩으로 표시될 수 있다. 인터페이스를 표시하기 위한 프로세서의 동작은, 도 12b에서 설명된 프로세서(41 0)의 동작에 상응할 수 있다. 상술한 실시 예에 따라, 프로세서는 제1 어플리케이션을 백그라운드에서 실행할 수 있다. 프로세서는 인터페이스를 가상 공간 내의 시각적 객체에서 표시하지 않는 대신, 객체 내에서 요소 를 표시할 수 있다. 프로세서는 사용자가 가상 공간에서 수행하는 작업을 방해하지 않고, 제1 어플리케이션의 실행 정보를 식별할 수 있도록, 객체 내에서 요소를 표시할 수 있다. 일 실시 예에 따르면, 웨어러블 장치(wearable device)는, 디스플레이(display), 적어도 하나의 센서(sensor), 인스트럭션들을 저장하는 메모리(memory), 및 상기 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하 나의 프로세서는, 상기 인스트럭션들이 실행될 때, 제1 가상 공간이 표시되는 동안, 상기 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을 식별하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 인 스트럭션들이 실행될 때, 상기 제1 가상 공간 내에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하도록 설 정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 인스트럭션들이 실행될 때, 상기 제1 어플리케이션의 실행 에 기반하여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2 가상 공간으로 전환하도록 설 정될 수 있다. 상기 적어도 하나의 프로세서는, 상기 인스트럭션들이 실행될 때, 상기 제2 가상 공간이 표시되 는 동안, 상기 적어도 하나의 어플리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별 하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 사용자의 시선이 향하 는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블 장치의 모션을 식별하 도록 설정될 수 있다. 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 웨어러블 장치의 상기 모션에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향하는 제2 방향에 기반하여, 상 기 제2 가상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체를 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 시각적 객체에 대 한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간의 상기 제2 부분 내의 지정된 영역 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 시각적 객체에 대 한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간으로부터, 상기 제2 어플리케이션이 실행되는 상기 제1 가상 공간으로의 전환을 수행하도록 설정될 수 있다. 상기 적어도 하나의 프로세서는 상기 제1 가상 공간 내에 서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 제2 가상 공간의 상기 제1 부분 내의 지정된 영역 상에서, 상기 제2 가상 공간과 구별되는 적어도 하나의 가상 공간 내에서 실행 중인 하나 이상의 어플리케이션들에 관한 하나 이상의 요소(element)들을 포함하는 객체를 표시하도록 설정될수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 하나 이상의 요소 들 중, 상기 제2 어플리케이션에 관한 요소에 대한 입력을 식별하도록 설정될 수 있다. 상기 적어도 하나의 프 로세서는 상기 요소에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간 내의 상기 제1 부분 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 요소는, 상기 제2 어플리케이션에 관한 동작의 실행 정보에 기반하여 표시될 수 있 다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 객체를 제거하기 위한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간 내의 상기 제1 부분 내에서, 상기 제2 어플리케이션 에 관한 인터페이스를 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 제2 가상 공간으로 부터 상기 제1 가상 공간으로의 전환을 위한 입력을 식별하는 것에 기반하여, 상기 제1 가상 공간 내에서 표시 되는 상기 객체 내에서 상기 요소를 제거하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들이 실행될 때, 상기 제2 방향에 기반하 여, 상기 제2 가상 공간의 상기 제2 부분 내에서 상기 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터 페이스를 표시하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 제1 가상 공간은, 상기 적어도 하나의 어플리케이션의 실행을 위한 적어도 하나의 영역을 포함하도록 구성될 수 있다. 상기 제2 가상 공간은, 상기 제1 어플리케이션에 관한 인터페이스를 제공하 도록 구성될 수 있다. 일 실시 예에 따르면, 웨어러블 장치의 방법은, 제1 가상 공간이 표시되는 동안, 상기 제1 가상 공간 내에서 실 행 중인 적어도 하나의 어플리케이션을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 가상 공간 내 에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 어플 리케이션의 실행에 기반하여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2 가상 공간으 로 전환하는 동작을 포함할 수 있다. 상기 방법은, 상기 제2 가상 공간이 표시되는 동안, 상기 적어도 하나의 어플리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별하는 동작을 포함할 수 있다. 상기 방법은, 사용자의 시선이 향하는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블 장치의 모션을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 웨어러블 장치의 상기 모션 에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향하는 제2 방향에 기반하여, 상기 제2 가 상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체를 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 시각적 객체에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간의 상기 제2 부분 내의 지정된 영역 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 시각적 객체에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간으로부터, 상기 제2 어플리케이션이 실행되는 상기 제1 가상 공간으로의 전환을 수행하는 동작을 포함할 수 있다. 상기 방법은, 상기 제1 가상 공간 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 제2 가상 공간의 상기 제1 부분 내의 지정된 영역 상에서, 상기 제2 가상 공간과 구별되는 하나 이상의 가상 공간들 내에서 실행 중인 하나 이상의 어플리케이션들에 관한 하나 이 상의 요소(element)들을 포함하는 객체를 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 하나 이상의 요소들 중, 상기 제2 어플리케이션에 관한 요소에 대한 입력을 식별하는 동작을 포함할 수 있다. 상기 방법은, 상기 요소에 대한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간 내의 상기 제1 부분 내에서, 상기 제2 어플리케이션의 인터페이스를 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 요소는, 상기 제2 어플리케이션에 관한 동작의 실행 정보에 기반하여 표시될 수 있 다. 일 실시 예에 따르면, 상기 방법은, 상기 객체를 제거하기 위한 입력을 식별하는 것에 기반하여, 상기 제2 가상 공간 내의 상기 제1 부분 내에서, 상기 제2 어플리케이션에 관한 인터페이스를 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 제2 가상 공간으로부터 상기 제1 가상 공간으로의 전환을 위한 입력을 식별하는 것에 기반하여, 상기 제1 가상 공간 내에서 표시되는 상기 객체 내에서 상기 요소를 제거하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은,상기 제2 방향에 기반하여, 상기 제2 가상 공간의 상기 제2 부분 내에서 상 기 적어도 하나의 어플리케이션에 관한 적어도 하나의 인터페이스를 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 비일시적 컴퓨터 판독가능 저장 매체(non-transitory computer readable storage medium)는, 하나 이상의 프로그램들을 저장할 수 있다. 상기 하나 이상의 프로그램들은, 디스플레이, 적어도 하 나의 센서를 가지는(with) 웨어러블 장치의 적어도 하나의 프로세서에 의해 실행될 시, 제1 가상 공간이 표시되 는 동안, 상기 제1 가상 공간 내에서 실행 중인 적어도 하나의 어플리케이션을 식별하도록 상기 웨어러블 장치 를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상기 적어 도 하나의 프로세서에 의해 실행될 시, 상기 제1 가상 공간 내에서, 제1 어플리케이션을 실행하기 위한 입력을 식별하도록 상기 웨어러블 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상기 적어도 하나의 프로세서에 의해 실행될 시, 상기 제1 어플리케이션의 실행에 기반하 여, 상기 제1 가상 공간을, 상기 제1 어플리케이션에 따라 제공되는 제2 가상 공간으로 전환하도록 상기 웨어러 블 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상 기 적어도 하나의 프로세서에 의해 실행될 시, 상기 제2 가상 공간이 표시되는 동안, 상기 적어도 하나의 어플 리케이션 중, 상기 제1 가상 공간 내에서 실행되는 제2 어플리케이션을 식별하도록 상기 웨어러블 장치를 야기 하는 인스트럭션들을 포함할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상기 적어도 하나 의 프로세서에 의해 실행될 시, 사용자의 시선이 향하는 제1 방향에 기반하여 상기 제2 가상 공간의 제1 부분을 표시하는 동안, 상기 웨어러블 장치의 모션을 식별하도록 상기 웨어러블 장치를 야기하는 인스트럭션들을 포함 할 수 있다. 상기 하나 이상의 프로그램들은, 상기 웨어러블 장치의 상기 적어도 하나의 프로세서에 의해 실행 될 시, 상기 웨어러블 장치의 상기 모션에 따라 상기 제1 방향으로부터 변경된, 상기 사용자의 상기 시선이 향 하는 제2 방향에 기반하여, 상기 제2 가상 공간의 제2 부분 내에서 상기 제2 어플리케이션에 관한 시각적 객체 를 표시하도록 상기 웨어러블 장치를 야기하는 인스트럭션들을 포함할 수 있다. 상술한 실시 예에 따르면, 제1 가상 공간에서 제2 가상 공간으로 전환되는 경우, 홈 가상 공간을 거치지 않고, 제1 가상 공간으로부터 제2 가상 공간으로 직접(directly) 가상 공간이 전환될 수 있는 효과가 있다. 상술한 실 시 예에 따르면, 멀티 태스킹 환경에서 제1 가상 공간에서 실행 중인 어플리케이션에 관한 정보가 제2 가상 공 간 내에서 표시될 수 있다. 현재 실행 중인 어플리케이션에 관한 작업에 대한 화면이 유지된 상태에서, 제1 가 상 공간에서 실행 중인 어플리케이션에 관한 정보가 표시되는 효과가 있다. 본 문서에 개시된 일 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 일 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정 하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 일 실시 예에서, 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모 듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태 로 구현될 수 있다. 본 문서의 일 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium) (예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프 로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서)는, 저 장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것 은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드 를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함 하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 일 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 일 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수 의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 일 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프 로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 일 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2a 도면2b 도면3a 도면3b 도면4 도면5a 도면5b 도면6 도면7 도면8a 도면8b 도면9 도면10a 도면10b 도면11 도면12a 도면12b 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2023-0128332", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 일 실시 예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a 및 도 2b는, 일 실시예에 따른, 웨어러블 장치의 사시도의 일 예를 도시한다. 도 3a 및 도 3b는, 일 실시예에 따른, 웨어러블 장치의 외관의 일 예를 도시한다. 도 4는, 일 실시예에 따른, 웨어러블 장치의 블록도의 일 예를 도시한다. 도 5a는, 일 실시 예에 따른, 디스플레이를 통해 표시되는 가상 공간의 예를 도시한다. 도 5b는, 일 실시 예에 따른, 사용자의 시선의 방향에 따라 표시되는 가상 공간의 부분의 예를 도시한다. 도 6은, 일 실시 예에 따른, 적어도 하나의 어플리케이션의 실행을 위한 가상 공간의 예를 도시한다. 도 7은, 일 실시 예에 따른, 어플리케이션에 관한 인터페이스를 제공하기 위한 가상 공간의 예를 도시한다. 도 8a는, 일 실시 예에 따른, 가상 공간이 전환되는 예를 도시한다. 도 8b는, 일 실시 예에 따른, 가상 공간이 전환되는 예를 도시한다. 도 9는, 일 실시 예에 따른 웨어러블 장치의 동작에 관한 흐름도를 도시한다. 도 10a는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 10b는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 11은, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 12a는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 12b는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 13은, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 14는, 일 실시 예에 따른, 제2 가상 공간 내에서 제2 어플리케이션에 관한 시각적 객체를 표시하기 위한 웨 어러블 장치의 동작의 예를 도시한다. 도 15는, 일 실시 예에 따른, 제1 가상 공간 내에서 실행 중인 어플리케이션을 표시하기 위한 웨어러블 장치의 동작의 예를 도시한다. 도 16은, 일 실시 예에 따른, 제1 가상 공간 내에서 실행 중인 어플리케이션을 표시하기 위한 웨어러블 장치의 동작의 예를 도시한다."}
