{"patent_id": "10-2012-0153807", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2014-0087099", "출원번호": "10-2012-0153807", "발명의 명칭": "전기로 및 전기로의 전극봉 위치제어방법", "출원인": "주식회사 포스코", "발명자": "김태원"}}
{"patent_id": "10-2012-0153807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "아크를 생성하여 노체에 저장된 용강을 가열하는 전극봉;상기 용강에 부원료를 공급하여 상기 노체 내부에 슬래그 폼을 생성하는 랜스;상기 노체에서 발생하는 노체진동(structure borne noise)을 측정하여 노체진동신호를 생성하는 노체진동센서;및상기 노체진동신호를 이용하여 상기 슬래그 폼의 높이를 계산하고, 상기 슬래그 폼의 높이에 따라 상기 전극봉의 높이를 조절하는 제어부를 포함하는 전기로."}
{"patent_id": "10-2012-0153807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제어부는노체진동에 따른 슬래그 폼의 높이변화를 인공지능망(Neural network)을 이용하여 학습시킨 데이터베이스를 이용하여, 상기 노체진동신호에 대응하는 상기 슬래그 폼의 높이를 계산하는 전기로."}
{"patent_id": "10-2012-0153807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 데이터베이스는상기 전기로에서 생성된 슬래그를 외부로 배출하는 슬래그 게이트를 촬상한 영상신호를 이용하여 상기 슬래그폼의 높이에 대한 기준신호를 생성하고, 상기 노체진동에 따른 상기 기준신호의 변화를 상기 인공지능망(Neuralnetwork)으로 매칭시켜 형성하는 전기로."}
{"patent_id": "10-2012-0153807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 제어부는상기 전극봉의 말단 높이를, 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만큼 뺀 높이로 조절하는 전기로."}
{"patent_id": "10-2012-0153807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 제어부는상기 전극봉에서 아크를 발생시키는 아크전압의 크기와 상기 아크전압의 크기에 대응하는 상기 전극봉 말단의높이를 포함하는 테이블표를 이용하여, 상기 전극봉 말단의 높이를 조절하는 전기로."}
{"patent_id": "10-2012-0153807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "전극봉으로 아크를 발생하여, 노체 내부에 저장된 용강을 가열하는 용강가열단계;랜스로 상기 용강에 부원료를 공급하여, 상기 노체 내부에 슬래그 폼을 형성하는 슬래그 폼 형성단계;노체진동센서를 이용하여 상기 노체에서 발생하는 노체진동을 측정하여 노체진동신호를 생성하는 진동측정단계;상기 노체진동신호를 이용하여 상기 슬래그 폼의 높이를 계산하는 높이계산단계; 및상기 계산된 슬래그 폼의 높이에 따라 상기 전극봉의 높이를 조절하는 전극봉제어단계를 포함하는 전극봉 위치공개특허 10-2014-0087099-3-제어방법."}
{"patent_id": "10-2012-0153807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 높이 계산단계는노체진동에 따른 슬래그 폼의 높이변화를 인공지능망(Neural network)을 이용하여 학습시킨 데이터 베이스를 이용하여, 상기 노체진동신호에 대응하는 상기 슬래그 폼의 높이를 계산하는 전극봉 위치 제어 방법."}
{"patent_id": "10-2012-0153807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 전극봉제어단계는상기 전극봉의 말단 높이를, 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만큼 뺀 높이로 조절하는 전극봉위치제어방법. 명 세 서기 술 분 야본 발명은 전극봉 위치제어방법 및 이를 이용한 전기로에 관한 것으로서, 보다 상세하게는 슬래그 폼의 높이에 [0001]따라 전극봉의 위치를 조절할 수 있는 전극봉 위치제어방법 및 이를 이용한 전기로에 관한 것이다. 배 경 기 술일반적으로, 전기로 조업에서는 슬래그 층 두께를 크게 유지하여 전극봉에서 발생된 아크가 대기에 노출되지 않 [0002]도록 아크를 보호할 수 있다. 따라서, 상기 용강에 대한 아크의 열전달효율을 향상할 수 있으며, 대기로부터의질소 유입을 방지할 수 있다. 다만, 종래에는 슬래그 두께를 정확하게 예측하기보다는 슬래그 폼 높이를 향상시키는 방안으로 기술이 개발되고 있다. 즉, 슬래그 두께를 크게 형성하기 위하여 슬래그에 랜스를 이용하여 탄소와 산소를 취입할 수 있으며, 그 결과 [0003]발생되는 포밍현상을 이용하여 슬래그 층의 두께를 증가시킬 수 있다. 여기서, 슬래그 층의 두께를 슬래그 폼높이라고 할 수 있다. 한편, 상기 슬래그 폼 높이는 슬래그 게이트로 유출되는 슬래그 상태를 조업자가 관찰함으로써 예측될 수 있다. [0004]그러나, 용강 탕면의 위치를 모르기 때문에 슬래그 게이트로 유출되는 슬래그 상태를 가지고서는 정확한 슬래그높이를 알 수 없는 문제점을 가지고 있다. 또한, 작업자가 아크소음의 크기를 직접 청취함으로써, 슬래그 폼의 높이를 예측하는 것도 가능하다. 그러나, [0005]슬래그 폼을 형성하는 시기에서의 아크소음의 크기는 고철을 용해할 때와는 달리 상대적으로 작기 때문에, 인간의 청각능력으로는 아크 소음을 공장내 다른 소음과 분간하기 쉽지 않다. 그리고, 조업자가 느끼는 아크소음의크기는 조업자의 심리적 상태에 따라 상이할 수 있으므로, 상기 판별된 슬래그 폼 높이의 정확도를 신뢰하기 어렵다. 따라서, 종래의 방식으로는 전기로 조업에서 슬래그 폼의 높이를 정확하게 예측하는 것이 불가능한다는문제점이 있다. 발명의 내용해결하려는 과제본 발명은 슬래그 폼의 높이에 따라 전극봉의 위치를 조절할 수 있는 전극봉 위치제어방법 및 이를 이용한 전기 [0006]로를 제공하고자 한다. 과제의 해결 수단본 발명의 일 실시예에 의한 전기로에 의하면, 아크를 생성하여 노체에 저장된 용강을 가열하는 전극봉; 상기 [0007]용강에 부원료를 공급하여 상기 노체 내부에 슬래그 폼을 생성하는 랜스; 상기 노체에서 발생하는 노체진동공개특허 10-2014-0087099-4-(structure borne noise)을 측정하여 노체진동신호를 생성하는 노체진동센서; 및 상기 노체진동신호를 이용하여상기 슬래그 폼의 높이를 계산하고, 상기 슬래그 폼의 높이에 따라 상기 전극봉의 높이를 조절하는 제어부를 포함할 수 있다. 여기서 상기 제어부는, 노체진동에 따른 슬래그 폼의 높이변화를 인공지능망(Neural network)을 이용하여 학습 [0008]시킨 데이터베이스를 이용하여, 상기 노체진동신호에 대응하는 상기 슬래그 폼의 높이를 계산할 수 있다. 여기서 상기 데이터베이스는, 상기 전기로에서 생성된 슬래그를 외부로 배출하는 슬래그 게이트를 촬상한 영상 [0009]신호를 이용하여 상기 슬래그 폼의 높이에 대한 기준신호를 생성하고, 상기 노체진동에 따른 상기 기준신호의변화를 상기 인공지능망(Neural network)으로 매칭시켜 형성할 수 있다.여기서 상기 제어부는, 상기 전극봉의 말단 높이를, 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만큼 뺀 높 [0010]이로 조절할 수 있다. 여기서 상기 제어부는, 상기 전극봉에서 아크를 발생시키는 아크전압의 크기와 상기 아크전압의 크기에 대응하 [0011]는 상기 전극봉 말단의 높이를 포함하는 테이블표를 이용하여, 상기 전극봉 말단의 높이를 조절할 수 있다, 본 발명의 일 실시예에 의한 전극봉 위치제어방법은, 전극봉으로 아크를 발생하여, 노체 내부에 저장된 용강을 [0012]가열하는 용강가열단계; 랜스로 상기 용강에 부원료를 공급하여, 상기 노체 내부에 슬래그 폼을 형성하는 슬래그 폼 형성단계; 노체진동센서를 이용하여 상기 노체에서 발생하는 노체진동을 측정하여 노체진동신호를 생성하는 진동측정단계; 상기 노체진동신호를 이용하여 상기 슬래그 폼의 높이를 계산하는 높이계산단계; 및 상기 계산된 슬래그 폼의 높이에 따라 상기 전극봉의 높이를 조절하는 전극봉제어단계를 포함할 수 있다. 여기서, 상기 높이 계산단계는 노체진동에 따른 슬래그 폼의 높이변화를 인공지능망(Neural network)을 이용하 [0013]여 학습시킨 데이터 베이스를 이용하여, 상기 노체진동신호에 대응하는 상기 슬래그 폼의 높이를 계산할 수 있다. 여기서 상기 전극봉제어단계는, 상기 전극봉의 말단 높이를, 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만 [0014]큼 뺀 높이로 조절할 수 있다. 덧붙여 상기한 과제의 해결수단은, 본 발명의 특징을 모두 열거한 것이 아니다. 본 발명의 다양한 특징과 그에 [0015]따른 장점과 효과는 아래의 구체적인 실시형태를 참조하여 보다 상세하게 이해될 수 있을 것이다.발명의 효과본 발명의 일 실시예에 의한 전극봉 위치제어방법 및 이를 이용한 전기로에 의하면, 전기로의 용강생성과정에서 [0016]생성되는 슬래그 폼의 높이를 정밀하게 측정할 수 있다. 또한, 상기 측정된 슬래그 폼의 높이에 따라 전극봉의 높이를 제어할 수 있으므로, 상기 전극봉은 슬래그 폼의 [0017]내부에서 아크를 발생시키는 것이 가능하다. 따라서, 노체보호와 보온효과에 의한 전력효율향상 및 대기 중의질소와의 접촉차단에 의한 용강품질 향상이 가능하다. 또한, 슬래그 폼의 높이에 따른 전극봉의 높이 제어가 가능하므로, 전력투입을 높이기 위하여 부원료를 추가하 [0018]는 경우, 상기 부원료의 무분별한 낭비를 방지할 수 있다. 도면의 간단한 설명도1은 본 발명의 일 실시예에 의한 전기로를 나타내는 블록도이다. [0019]도2는 본 발명의 일 실시예에 의한 슬래그 폼의 높이측정 결과를 나타내는 그래프이다. 도3은 본 발명의 일 실시예에 의한 전극봉 위치제어방법을 나타내는 순서도이다. 발명을 실시하기 위한 구체적인 내용이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 [0020]시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있공개특허 10-2014-0087099-5-어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐동일한 부호를 사용한다.덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 '연결'되어 있다고 할 때, 이는 '직접적으로 연결'되어 있 [0021]는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 '간접적으로 연결'되어 있는 경우도 포함한다. 또한,어떤 구성요소를 '포함'한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라다른 구성요소를 더 포함할 수 있다는 것을 의미한다.전기로는 고철(scrab) 등을 주원료로 사용하며, 전기로의 전극봉과 고철 사이에 발생하는 아크를 이용하여 상기 [0022]고철을 용해하는 방식으로 용강을 생산할 수 있다. 구체적으로 상기 전기로에서 용강을 제조하는 공정을 설명하면, 상기 전기로의 용강제조공정은, 1차 장입기, 1차 용해기, 2차 장입기, 2차 용해기, 승열기 및 출강기를 포함할 수 있다. 먼저, 전기로에서 주원료로 사용되는 고철은 1차와 2차로 나뉘어서 전기로로 장입될 수 있다. 1차 장입이 완료 [0023]되면, 전기로에 통전을 하여 주원료인 고철을 용해할 수 있으며, 1차 장입된 고철의 용해가 완료되면 2차 장입을 실시한 후, 다시 노내에 통전을 하여 추가로 장입된 주원료를 용해할 수 있다. 여기서, 상기 1차 용해기와 2차 용해기의 도중에는 생석회(CaO)와 돌로마이트 등이 전기로 내로 공급될 수 있다. 2차 용해기 이후에는 랜스(lance)를 이용하여 전기로 내에 부원료 즉, 산소와 포밍재(탄소분말)을 취입할 수 있 [0024]다. 여기서, 상기 랜스가 공급하는 산소는, 상기 고철이 모두 용해되는 2차 용해기 말기와 승열기에 용강 중의탄소를 감소시키는 탈탄 반응을 유도할 수 있다. C(용강) + (1/2) O2(기체) = CO(기체) [0025]이때, 상기 탈탄반응에 의하여 발생하는 CO 기체는 용강 상부에 형성된 슬래그에 포집될 수 있으며, 상기 슬래 [0026]그는 상기 CO 기체에 의하여 실제 부피보다 더 증가하여 슬래그 폼을 형성할 수 있다. 이를 슬래그 포밍(foaming) 현상이라고 하며, 상기 슬래그 폼이 활발히 발생하여 두께가 증가하면, 전극봉의 아크는 안정화되고용강의 열손실이 감소하여 전력사용량이 절감될 수 있다. 통상적으로, 전극봉의 높이가 높을수록 더 높은 아크전압이 인가되며, 높은 아크 전압이 인가될수록 전극봉의 전력효율과 역룰은 높아질 수 있다. 따라서, 상기 슬래그 폼 내부에서 상기 전극봉이 최대한 높이 상승한 후 아크를 발생하도록 상기 전극봉의 위치를 조절할 수 있다. 다만, 종래에는 상기 슬래그 폼의 높이를 조업자가 슬래그 게이트(slag gate)로 유출되는 슬래그의 형상이나 아 [0027]크의 발생에 의한 아크소음 등을 근거로 판별하였다. 따라서, 슬래그 폼 높이에 대한 정확성이 떨어지고 조업자마다 편차가 심하게 되어 효율적인 조업이 이루어지지 못하였다. 하지만, 본 발명의 일 실시예에 의한 전기로에 의하면, 정확하게 슬래그 폼의 높이를 측정한 후, 상기 슬래그 [0028]폼의 높이에 따라 상기 전극봉의 높이를 조절하도록 함으로써 높은 아크전압으로 운전하는 것이 가능하다.이하, 도1을 참조하여 구체적으로 설명한다. 도1은 본 발명의 일 실시예에 의한 전기로를 나타내는 블록도이다. [0029]도1을 참조하면, 본 발명의 일 실시예에 의한 전기로는, 전극봉(10), 랜스(20), 노체진동센서(30) 및 제어부 [0030](40)를 포함할 수 있다. 전극봉(10)은 아크(arc)를 생성하여 노체(1)에 저장된 용강을 가열할 수 있다. 상기 전극봉(10)은 인가되는 아 [0031]크 전압을 이용하여 상기 용강과의 사이에 아크를 형성할 수 있으며, 상기 아크에 의한 아크열을 이용하여 상기용강을 가열할 수 있다. 여기서, 상기 전극봉(10)과 용강 사이의 거리가 증가할수록 상기 아크를 발생시키기 위한 아크 전압도 커질 수 있으며, 상기 아크 전압을 높여서 운전할수록 전력효율이나 역률 향상에 유리할 수 있다. 상기 전극봉(10)은 높낮이가 조절될 수 있으며, 특히, 제어부(40)가 출력하는 위치신호(sig_h)에 따라 상기높낮이가 조절될 수 있다. 추가적으로, 상기 전극봉(10)의 아크 전압의 크기도 상기 제어부(40)에서 제어될 수있다.공개특허 10-2014-0087099-6-랜스(lance, 20)는, 상기 용강에 부원료를 제공하여 상기 노체(1) 내부에 슬래그 폼(S)을 생성할 수 있다. 상기 [0032]부원료에는 산소 및 포밍제(탄소분말)가 포함될 수 있으며, 상기 부원료에 의하여 슬래그가 부풀어 오를 수 있다. 앞서 살핀바와 같이, 상기 랜스(20)가 공급하는 산소에 의하여 탈탄반응이 유도될 수 있으며, 상기 탈탄반응에 의하여 상기 노체(1) 내부에 CO 기체가 생성될 수 있다. 이후, 상기 CO 기체가 용강의 상부에 구성된 슬래그에 포집되면, 상기 슬래그의 부피가 커지면서 슬래그 폼(S)을 형성할 수 있다. 여기서, 상기 랜스(20)가 공급하는 부원료의 양을 조절함으로써 상기 슬래그 폼(S)의 형성 정도를 조절하는 것도 가능하다. 즉, 상기 슬래그폼(S)의 높이를 측정한 후, 상기 슬래그 폼(S)의 형성이 부족하면 상기 부원료의 양을 추가할 수 있으며, 상기슬래그 폼(S)의 형성이 과다하면 상기 부원료의 공급량을 줄일 수 있다.노체진동센서(30)는, 상기 노체(1)에서 발생하는 노체진동을 측정하여 노체진동신호(sig_vib)를 생성할 수 [0033]있다. 상기 전극봉(10)에서 발생하는 아크에 의하여 상기 노체(1)는 진동할 수 있으며, 상기 아크에 의하여 슬래그 폼(S)의 높이가 달라질 수 있다. 따라서, 상기 노체(1)의 진동과 생성된 슬래그 폼(S)의 높이와의 상관관계를 파악한 후, 상기 노체진동신호(sig_vib)를 이용하여 상기 슬래그 폼(S)의 높이를 측정하는 것이 가능하다.상기 노체진동센서(30)에서 생성한 노체진동신호(sig_vib)는 제어부(40)로 전송될 수 있다. 제어부(40)는, 상기 노체진동신호(sig_vib)를 이용하여 상기 슬래그 폼(S)의 높이를 계산할 수 있으며, 상기 계 [0034]산된 슬래그 폼(S)의 높이에 따라 상기 전극봉(10)의 높이를 조절할 수 있다. 이때, 상기 제어부(40)는 위치신호(sig_h)를 상기 전극봉(10)에 출력하여 상기 전극봉(10)의 높이를 조절할 수 있다.먼저, 상기 제어부(40)는 상기 노체진동과 상기 슬래그 폼(S)의 높이 사이의 상관관계가 저장된 데이터베이스를 [0035]이용하여, 상기 노체진동신호(sig_vib)에 따른 상기 슬래그 폼의 높이(S)를 측정할 수 있다.상기 데이터 베이스는 상기 노체진동에 따른 슬래그 폼(S)의 높이변화를 인공지능망(Neural network)을 이용하 [0036]여 학습시킨 것일 수 있으며, 상기 데이터 베이스에는 각각의 노체진동에 대응하는 슬래그 폼(S)의 높이가 저장되어 있을 수 있다. 따라서, 상기 노체진동신호(sig_vib)가 상기 제어부(40)에 입력되면, 상기 제어부(40)는 상기 노체진동신호(sig_vib)에 대응하는 상기 슬래그 폼(S)의 높이를 출력할 수 있다. 여기서, 상기 노체진동과 슬래그 폼(S)의 높이 사이의 상관관계를 구하고, 상기 상관관계를 포함하는 데이터 베 [0037]이스를 형성하기 위해서는, 상기 슬래그 폼(S)의 정확한 높이에 대한 정보가 필요할 수 있다. 따라서, 슬래그게이트를 촬상하여 상기 슬래그 게이트에 대한 영상신호를 획득할 수 있으며, 상기 영상신호로부터 상기 슬래그폼(S)의 높이 정보를 추출할 수 있다. 종래에는 조업자가 상기 슬래그 게이트에서 배출되는 슬래그의 형상 등을이용하여 상기 슬래그 폼(S)의 높이를 식별하였으므로, 상기 슬래그 게이트를 촬상한 영상신호를 분석하여 상기슬래그 폼 높이 정보를 추출한 후, 이를 기준신호로 하는 것이 가능하다. 이후, 기준신호와 상기 기준신호에 대응하는 상기 노체진동신호(sig_vib)을 이용하여 상기 노체진동과 상기 슬 [0038]래그 폼(S)의 높이 사이의 상관관계를 구할 수 있다. 이때, 상기 노체진동과 상기 슬래그 폼(S) 사이의 상관관계는 복수개의 샘플을 활용하여 구할 수 있으며, 상기 인공지능망을 이용하여 상기 노체진동과 상기 슬래그폼(S) 사이의 상관관계를 학습하도록 할 수 있다. 즉, 상기 노체진동과 상기 슬래그 폼(S) 사이의 상관관계를 경험적으로 도출하여 데이터 베이스화하는 것이 가능하다.추가적으로, 상기 노체진동신호(sig_vib)와 함께 상기 전극봉(10)에 전압, 전류를 공급하는 전력투입신호 [0039](sig_pwr)도 입력받을 수 있으며, 상기 노체진동신호(sig_vib) 및 전류공급신호(sig_pwr)와 상기 슬래그 폼(S)의 높이와의 상관관계를 구하여 상기 데이터 베이스를 구성하는 것도 가능하다. 즉, 상기 노체진동신호(sig_vib) 및 전력투입신호(sig_pwr)의 변화에 따른 상기 기준신호의 변화를 인공지능망으로 학습하는 방식으로상기 데이터 베이스를 형성할 수 있다. 따라서, 상기 제어부(40)는, 데이터베이스를 이용하여 상기 전력투입신호(sig_pwr) 및 노체진동신호(sig_vib)에 따른 슬래그 폼의 높이를 판별하는 것이 가능하다. 도2는 본 발명의 일 실시예에 의한 슬래그 폼의 높이측정결과를 나타낸 것으로서, L1은 상기 영상신호를 통하여 [0040]추출한 상기 슬래그 폼의 높이이고, L2는 상기 노체진동신호(sig_vib)를 이용하여 추출한 상기 슬래그 폼의 높이이다. 도2에 도시된 바와 같이, 본 발명의 일 실시예에 의한 슬래그 폼의 높이측정에 의하면, 영상신호에 의한 실제 슬래그 폼의 높이와 거의 유사하게 상기 슬래그 폼의 높이를 측정할 수 있음을 확인할 수 있다. 상기 슬래그 폼(S)의 높이가 계산되면, 상기 제어부(40)는 상기 계산된 슬래그 폼(S)의 높이를 이용하여 상기 [0041]공개특허 10-2014-0087099-7-전극봉(10)의 높이를 조절할 수 있다. 앞서 살핀바와 같이, 상기 전극봉(10)은 상기 슬래그 폼(S) 내부에서 아크를 방전하는 동시에, 상기 전극봉(10)과 상기 용강 사이의 거리를 최대한 증가시키는 것이 바람직하다. 즉,상기 제어부(40)는 상기 전극봉(10)의 말단이 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만큼 뺀 높이를가지도록 상기 전극봉의 높이를 조절할 수 있다. 여기서, 상기 전극봉(10)의 말단은 상기 용강과 통전하여 아크를 발생시키는 상기 전극봉(10)의 최하단부를 의미할 수 있다. 구체적으로, 상기 제어부(40)는 상기 계산된 슬래그 폼의 높이를, 상기 전극봉(10) 말단의 한계높이로 제한함으 [0042]로써, 상기 전극봉(10)이 상기 슬래그 폼(S)의 내부에 항상 위치하도록 할 수 있다. 또한, 상기 계산된 슬래그폼(S)의 높이에서 기 설정된 값만큼 뺀 높이를 상기 전극봉(10) 말단의 한계높이로 제한하는 것도 가능하며, 이경우 상기 전극봉(10)의 높이에 대하여 기 설정된 길이만큼의 마진(margin)을 가지므로, 보다 안정적인 전극봉(10)의 위치 제어가 가능하다. 또한, 상기 전극봉(10)에 인가하는 아크 전압의 크기는 상기 전극봉(10)과 용강 사이의 거리에 비례하므로, 상 [0043]기 전극봉(10) 말단의 한계높이를 상기 전극봉(10)에 인가하는 아크 전압의 크기로 설정하는 것도 가능하다.즉, 상기 전극봉(10)에 대하여 기 설정된 한계높이에 대응하는 한계전압을 설정한 후, 상기 한계전압 이상의 아크 전압을 상기 전극봉(10)에 인가하지 않도록 제한할 수 있다. 상기 아크 전압과 상기 전극봉(10)의 높이 사이에는 대체적으로는 선형적인 관계가 있으나, 보다 정밀한 위치제 [0044]어를 위하여는 테이블표를 이용하여 상기 전극봉(10)의 높이를 제어하는 것도 가능하다. 즉, 미리 실험데이터등을 이용하여 상기 아크 전압의 크기와 상기 전극봉(10)의 높이와의 상관관계를 구하여 테이블표를 구성할 수있으며, 상기 한계높이에 대응하는 한계전압을 상기 테이블표를 통하여 설정할 수 있다. 따라서, 상기 계산된슬래그 폼의 높이를 이용하여 상기 전극봉(10)에 인가하는 한계전압의 크기를 설정함으로써, 상기 전극봉(10)의위치가 상기 슬래그 폼의 높이에 추종하도록 하는 것이 가능하다.도3은, 본 발명의 일 실시예에 의한 전극봉 위치제어방법을 나타내는 순서도이다. [0045]도3을 참조하면, 본 발명의 일 실시예에 의한 전극봉 위치제어방법은, 용강가열단계(S10), 슬래그 폼 형성단계 [0046](S20), 진동측정단계(S30), 높이계산단계(S40) 및 전극봉제어단계(S50)를 포함할 수 있다. 이하, 도3을 참조하여 본 발명의 일 실시예에 의한 전극봉 위치제어방법을 설명한다. [0047]용강가열단계(S10)에서는, 전극봉으로 아크를 발생하여 노체 내부에 저장된 용강을 가열할 수 있다. 앞서 살핀 [0048]바와 같이, 전기로를 이용하여 용강을 형성하는 경우에는, 1차 장입, 1차 용해, 2차 장입, 2차 용해, 승열 및출강의 과정을 거쳐 상기 용강을 생성할 수 있으며, 여기서 상기 용강가열단계(S10)는 상기 승열기에 해당할 수있다. 즉, 상기 용해과정 등을 통하여 이미 용해된 고철 등을 상기 전극봉을 이용하여 가열할 수 있다. 이후, 슬래그 폼 형성단계(S20)에서는 랜스를 이용하여 상기 용강에 부원료를 공급할 수 있으며, 상기 부원료에 [0049]의하여 상기 노체 내부에 슬래그 폼이 형성될 수 있다. 상기 부원료는 산소 및 포밍재(탄소분말)을 포함할 수있으며, 상기 산소에 의한 탈탄반응에 의하여 생성된 CO 기체에 의하여 상기 슬래그 폼이 형성될 수 있다. 여기서, 상기 슬래그 폼의 형성정도는 상기 전극봉이 생성하는 아크 등에 의하여 조절될 수 있다. 상기 슬래그 폼이 형성되면, 진동측정단계(S30)에서는 노체진동센서를 이용하여 상기 노체에서 발생하는 노체진 [0050]동을 측정할 수 있으며, 상기 노체진동에 대응하는 노체진동신호를 생성할 수 있다. 상기 슬래그 폼의 높이는상기 전극봉이 생성하는 아크에 의하여 달라질 수 있으며, 상기 노체의 진동은 상기 전극봉의 아크에 의하여 발생할 수 있다. 따라서, 상기 진동측정단계(S30)에서 측정한 상기 노체진동신호를 이용하면, 상기 슬래그 폼의높이를 계산하는 것이 가능하다.높이계산단계(S40)는, 상기 노체진동신호를 이용하여 상기 슬래그 폼의 높이를 계산할 수 있다. 구체적으로, 상 [0051]기 높이계산단계(S40)는 상기 노체진동과 상기 슬래그 폼의 높이 사이의 상관관계가 저장된 데이터베이스를 이용하여 상기 슬래그 폼의 높이를 계산할 수 있다. 여기서, 상기 데이터베이스는 상기 노체진동에 따른 슬래그폼의 높이변화를 인공지능망을 이용하여 학습시킨 것일 수 있으며, 상기 데이터 베이스에는 각각의 노체진동에대응하는 슬래그 폼의 높이가 저장되어 있을 수 있다. 따라서, 상기 노체진동신호가 입력되면, 상기 노체진동신호에 대응하는 상기 슬래그 폼의 높이를 출력할 수 있다. 공개특허 10-2014-0087099-8-상기 슬래그 폼의 높이가 계산되면, 전극봉제어단계(S50)를 통하여 상기 전극봉의 높이를 조절할 수 있다. 앞서 [0052]살핀 바와 같이, 상기 슬래그 폼의 내부에서 상기 전극봉이 아크를 발생시키는 동시에, 상기 전극봉과 용강 사이의 거리를 최대로 유지하는 것이 전력효율이나 역률의 측면 등에서 유리하다. 따라서, 상기 전극봉제어단계(S50)에서는 상기 전극봉의 말단 높이를 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만큼 뺀 높이를 가지도록 상기 전극봉의 높이를 조절할 수 있다. 즉, 상기 전극봉제어단계(S50)에서는, 상기 전극봉이 상기 슬래그 폼의 내부에 위치하는 동시에 높은 아크 전압을 유지하도록 할 수 있다. 여기서, 상기 전극봉에 인가되는 아크 전압은 상기 전극봉에서 아크가 발생하도록 하는 전압의 크기이므로, 상 [0053]기 전극봉과 용강사이의 거리가 클수록 상기 아크 전압의 크기는 커질 수 있다. 즉, 상기 아크 전압의 크기와전극봉의 높이는 비례하는 것으로 볼 수 있다. 따라서, 상기 설정된 전극봉의 높이에 대응하는 아크 전압의 크기를 설정하는 방식으로 상기 전극봉의 위치제어를 수행하는 것도 가능하다. 이때, 상기 아크전압의 크기와 이에 대응하는 전극봉의 높이를 포함하는 테이블표를 이용하여 상기 전극봉의 위치제어를 수행하는 것도가능하다. 본 발명은 상술한 실시형태 및 첨부된 도면에 의해 한정되지 아니한다. 첨부된 청구범위에 의해 권리범위를 한 [0054]정하고자 하며, 청구범위에 기재된 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양한 형태의 치환,변형 및 변경이 가능하다는 것은 당 기술분야의 통상의 지식을 가진 자에게 자명할 것이다.부호의 설명1: 노체 10: 전극봉 [0055]20: 랜스 30: 노체진동센서40: 제어부S10: 용강가열단계 S20: 슬래그 폼 형성단계S30: 진동측정단계 S40: 높이계산단계S50: 전극봉제어단계도면도면1공개특허 10-2014-0087099-9-도면2도면3공개특허 10-2014-0087099-10-"}
{"patent_id": "10-2012-0153807", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전극봉 위치 제어방법 및 이를 이용한 전기로에 관한 것으로서, 본 발명의 일 실시예에 의한 전기로는, 아크를 생성하여 노체에 저장된 용강을 가열하는 전극봉; 상기 용강에 부원료를 제공하여 상기 노체 내부에 슬래그 폼을 생성하는 랜스; 상기 노체에서 발생하는 노체진동(structure borne noise)을 측정하여 노체 진동신호를 생성하는 노체진동센서; 및 상기 노체진동신호를 이용하여 상기 슬래그 폼의 높이를 계산하고, 상기 슬래그 폼의 높이에 따라 상기 전극봉의 높이를 조절하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2012-0153807", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전극봉 위치제어방법 및 이를 이용한 전기로에 관한 것으로서, 보다 상세하게는 슬래그 폼의 높이에 따라 전극봉의 위치를 조절할 수 있는 전극봉 위치제어방법 및 이를 이용한 전기로에 관한 것이다."}
{"patent_id": "10-2012-0153807", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 전기로 조업에서는 슬래그 층 두께를 크게 유지하여 전극봉에서 발생된 아크가 대기에 노출되지 않 도록 아크를 보호할 수 있다. 따라서, 상기 용강에 대한 아크의 열전달효율을 향상할 수 있으며, 대기로부터의 질소 유입을 방지할 수 있다. 다만, 종래에는 슬래그 두께를 정확하게 예측하기보다는 슬래그 폼 높이를 향상시 키는 방안으로 기술이 개발되고 있다. 즉, 슬래그 두께를 크게 형성하기 위하여 슬래그에 랜스를 이용하여 탄소와 산소를 취입할 수 있으며, 그 결과 발생되는 포밍현상을 이용하여 슬래그 층의 두께를 증가시킬 수 있다. 여기서, 슬래그 층의 두께를 슬래그 폼 높이라고 할 수 있다. 한편, 상기 슬래그 폼 높이는 슬래그 게이트로 유출되는 슬래그 상태를 조업자가 관찰함으로써 예측될 수 있다. 그러나, 용강 탕면의 위치를 모르기 때문에 슬래그 게이트로 유출되는 슬래그 상태를 가지고서는 정확한 슬래그 높이를 알 수 없는 문제점을 가지고 있다. 또한, 작업자가 아크소음의 크기를 직접 청취함으로써, 슬래그 폼의 높이를 예측하는 것도 가능하다. 그러나, 슬래그 폼을 형성하는 시기에서의 아크소음의 크기는 고철을 용해할 때와는 달리 상대적으로 작기 때문에, 인간 의 청각능력으로는 아크 소음을 공장내 다른 소음과 분간하기 쉽지 않다. 그리고, 조업자가 느끼는 아크소음의 크기는 조업자의 심리적 상태에 따라 상이할 수 있으므로, 상기 판별된 슬래그 폼 높이의 정확도를 신뢰하기 어 렵다. 따라서, 종래의 방식으로는 전기로 조업에서 슬래그 폼의 높이를 정확하게 예측하는 것이 불가능한다는 문제점이 있다."}
{"patent_id": "10-2012-0153807", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 슬래그 폼의 높이에 따라 전극봉의 위치를 조절할 수 있는 전극봉 위치제어방법 및 이를 이용한 전기 로를 제공하고자 한다."}
{"patent_id": "10-2012-0153807", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 의한 전기로에 의하면, 아크를 생성하여 노체에 저장된 용강을 가열하는 전극봉; 상기 용강에 부원료를 공급하여 상기 노체 내부에 슬래그 폼을 생성하는 랜스; 상기 노체에서 발생하는 노체진동(structure borne noise)을 측정하여 노체진동신호를 생성하는 노체진동센서; 및 상기 노체진동신호를 이용하여 상기 슬래그 폼의 높이를 계산하고, 상기 슬래그 폼의 높이에 따라 상기 전극봉의 높이를 조절하는 제어부를 포 함할 수 있다. 여기서 상기 제어부는, 노체진동에 따른 슬래그 폼의 높이변화를 인공지능망(Neural network)을 이용하여 학습 시킨 데이터베이스를 이용하여, 상기 노체진동신호에 대응하는 상기 슬래그 폼의 높이를 계산할 수 있다. 여기서 상기 데이터베이스는, 상기 전기로에서 생성된 슬래그를 외부로 배출하는 슬래그 게이트를 촬상한 영상 신호를 이용하여 상기 슬래그 폼의 높이에 대한 기준신호를 생성하고, 상기 노체진동에 따른 상기 기준신호의 변화를 상기 인공지능망(Neural network)으로 매칭시켜 형성할 수 있다. 여기서 상기 제어부는, 상기 전극봉의 말단 높이를, 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만큼 뺀 높 이로 조절할 수 있다. 여기서 상기 제어부는, 상기 전극봉에서 아크를 발생시키는 아크전압의 크기와 상기 아크전압의 크기에 대응하 는 상기 전극봉 말단의 높이를 포함하는 테이블표를 이용하여, 상기 전극봉 말단의 높이를 조절할 수 있다, 본 발명의 일 실시예에 의한 전극봉 위치제어방법은, 전극봉으로 아크를 발생하여, 노체 내부에 저장된 용강을 가열하는 용강가열단계; 랜스로 상기 용강에 부원료를 공급하여, 상기 노체 내부에 슬래그 폼을 형성하는 슬래 그 폼 형성단계; 노체진동센서를 이용하여 상기 노체에서 발생하는 노체진동을 측정하여 노체진동신호를 생성하 는 진동측정단계; 상기 노체진동신호를 이용하여 상기 슬래그 폼의 높이를 계산하는 높이계산단계; 및 상기 계 산된 슬래그 폼의 높이에 따라 상기 전극봉의 높이를 조절하는 전극봉제어단계를 포함할 수 있다. 여기서, 상기 높이 계산단계는 노체진동에 따른 슬래그 폼의 높이변화를 인공지능망(Neural network)을 이용하 여 학습시킨 데이터 베이스를 이용하여, 상기 노체진동신호에 대응하는 상기 슬래그 폼의 높이를 계산할 수 있 다. 여기서 상기 전극봉제어단계는, 상기 전극봉의 말단 높이를, 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만 큼 뺀 높이로 조절할 수 있다. 덧붙여 상기한 과제의 해결수단은, 본 발명의 특징을 모두 열거한 것이 아니다. 본 발명의 다양한 특징과 그에 따른 장점과 효과는 아래의 구체적인 실시형태를 참조하여 보다 상세하게 이해될 수 있을 것이다."}
{"patent_id": "10-2012-0153807", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 의한 전극봉 위치제어방법 및 이를 이용한 전기로에 의하면, 전기로의 용강생성과정에서 생성되는 슬래그 폼의 높이를 정밀하게 측정할 수 있다. 또한, 상기 측정된 슬래그 폼의 높이에 따라 전극봉의 높이를 제어할 수 있으므로, 상기 전극봉은 슬래그 폼의 내부에서 아크를 발생시키는 것이 가능하다. 따라서, 노체보호와 보온효과에 의한 전력효율향상 및 대기 중의 질소와의 접촉차단에 의한 용강품질 향상이 가능하다. 또한, 슬래그 폼의 높이에 따른 전극봉의 높이 제어가 가능하므로, 전력투입을 높이기 위하여 부원료를 추가하 는 경우, 상기 부원료의 무분별한 낭비를 방지할 수 있다."}
{"patent_id": "10-2012-0153807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되 는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 '연결'되어 있다고 할 때, 이는 '직접적으로 연결'되어 있 는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 '간접적으로 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 '포함'한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 전기로는 고철(scrab) 등을 주원료로 사용하며, 전기로의 전극봉과 고철 사이에 발생하는 아크를 이용하여 상기 고철을 용해하는 방식으로 용강을 생산할 수 있다. 구체적으로 상기 전기로에서 용강을 제조하는 공정을 설명하 면, 상기 전기로의 용강제조공정은, 1차 장입기, 1차 용해기, 2차 장입기, 2차 용해기, 승열기 및 출강기를 포 함할 수 있다. 먼저, 전기로에서 주원료로 사용되는 고철은 1차와 2차로 나뉘어서 전기로로 장입될 수 있다. 1차 장입이 완료 되면, 전기로에 통전을 하여 주원료인 고철을 용해할 수 있으며, 1차 장입된 고철의 용해가 완료되면 2차 장입 을 실시한 후, 다시 노내에 통전을 하여 추가로 장입된 주원료를 용해할 수 있다. 여기서, 상기 1차 용해기와 2 차 용해기의 도중에는 생석회(CaO)와 돌로마이트 등이 전기로 내로 공급될 수 있다. 2차 용해기 이후에는 랜스(lance)를 이용하여 전기로 내에 부원료 즉, 산소와 포밍재(탄소분말)을 취입할 수 있 다. 여기서, 상기 랜스가 공급하는 산소는, 상기 고철이 모두 용해되는 2차 용해기 말기와 승열기에 용강 중의 탄소를 감소시키는 탈탄 반응을 유도할 수 있다. C(용강) + (1/2) O2(기체) = CO(기체) 이때, 상기 탈탄반응에 의하여 발생하는 CO 기체는 용강 상부에 형성된 슬래그에 포집될 수 있으며, 상기 슬래 그는 상기 CO 기체에 의하여 실제 부피보다 더 증가하여 슬래그 폼을 형성할 수 있다. 이를 슬래그 포밍 (foaming) 현상이라고 하며, 상기 슬래그 폼이 활발히 발생하여 두께가 증가하면, 전극봉의 아크는 안정화되고 용강의 열손실이 감소하여 전력사용량이 절감될 수 있다. 통상적으로, 전극봉의 높이가 높을수록 더 높은 아크 전압이 인가되며, 높은 아크 전압이 인가될수록 전극봉의 전력효율과 역룰은 높아질 수 있다. 따라서, 상기 슬 래그 폼 내부에서 상기 전극봉이 최대한 높이 상승한 후 아크를 발생하도록 상기 전극봉의 위치를 조절할 수 있 다. 다만, 종래에는 상기 슬래그 폼의 높이를 조업자가 슬래그 게이트(slag gate)로 유출되는 슬래그의 형상이나 아 크의 발생에 의한 아크소음 등을 근거로 판별하였다. 따라서, 슬래그 폼 높이에 대한 정확성이 떨어지고 조업자 마다 편차가 심하게 되어 효율적인 조업이 이루어지지 못하였다. 하지만, 본 발명의 일 실시예에 의한 전기로에 의하면, 정확하게 슬래그 폼의 높이를 측정한 후, 상기 슬래그 폼의 높이에 따라 상기 전극봉의 높이를 조절하도록 함으로써 높은 아크전압으로 운전하는 것이 가능하다. 이하, 도1을 참조하여 구체적으로 설명한다. 도1은 본 발명의 일 실시예에 의한 전기로를 나타내는 블록도이다. 도1을 참조하면, 본 발명의 일 실시예에 의한 전기로는, 전극봉, 랜스, 노체진동센서 및 제어부 를 포함할 수 있다. 전극봉은 아크(arc)를 생성하여 노체에 저장된 용강을 가열할 수 있다. 상기 전극봉은 인가되는 아 크 전압을 이용하여 상기 용강과의 사이에 아크를 형성할 수 있으며, 상기 아크에 의한 아크열을 이용하여 상기 용강을 가열할 수 있다. 여기서, 상기 전극봉과 용강 사이의 거리가 증가할수록 상기 아크를 발생시키기 위 한 아크 전압도 커질 수 있으며, 상기 아크 전압을 높여서 운전할수록 전력효율이나 역률 향상에 유리할 수 있 다. 상기 전극봉은 높낮이가 조절될 수 있으며, 특히, 제어부가 출력하는 위치신호(sig_h)에 따라 상기 높낮이가 조절될 수 있다. 추가적으로, 상기 전극봉의 아크 전압의 크기도 상기 제어부에서 제어될 수 있다.랜스(lance, 20)는, 상기 용강에 부원료를 제공하여 상기 노체 내부에 슬래그 폼(S)을 생성할 수 있다. 상기 부원료에는 산소 및 포밍제(탄소분말)가 포함될 수 있으며, 상기 부원료에 의하여 슬래그가 부풀어 오를 수 있 다. 앞서 살핀바와 같이, 상기 랜스가 공급하는 산소에 의하여 탈탄반응이 유도될 수 있으며, 상기 탈탄반 응에 의하여 상기 노체 내부에 CO 기체가 생성될 수 있다. 이후, 상기 CO 기체가 용강의 상부에 구성된 슬래 그에 포집되면, 상기 슬래그의 부피가 커지면서 슬래그 폼(S)을 형성할 수 있다. 여기서, 상기 랜스가 공급 하는 부원료의 양을 조절함으로써 상기 슬래그 폼(S)의 형성 정도를 조절하는 것도 가능하다. 즉, 상기 슬래그 폼(S)의 높이를 측정한 후, 상기 슬래그 폼(S)의 형성이 부족하면 상기 부원료의 양을 추가할 수 있으며, 상기 슬래그 폼(S)의 형성이 과다하면 상기 부원료의 공급량을 줄일 수 있다. 노체진동센서는, 상기 노체에서 발생하는 노체진동을 측정하여 노체진동신호(sig_vib)를 생성할 수 있다. 상기 전극봉에서 발생하는 아크에 의하여 상기 노체는 진동할 수 있으며, 상기 아크에 의하여 슬 래그 폼(S)의 높이가 달라질 수 있다. 따라서, 상기 노체의 진동과 생성된 슬래그 폼(S)의 높이와의 상관관 계를 파악한 후, 상기 노체진동신호(sig_vib)를 이용하여 상기 슬래그 폼(S)의 높이를 측정하는 것이 가능하다. 상기 노체진동센서에서 생성한 노체진동신호(sig_vib)는 제어부로 전송될 수 있다. 제어부는, 상기 노체진동신호(sig_vib)를 이용하여 상기 슬래그 폼(S)의 높이를 계산할 수 있으며, 상기 계 산된 슬래그 폼(S)의 높이에 따라 상기 전극봉의 높이를 조절할 수 있다. 이때, 상기 제어부는 위치신 호(sig_h)를 상기 전극봉에 출력하여 상기 전극봉의 높이를 조절할 수 있다. 먼저, 상기 제어부는 상기 노체진동과 상기 슬래그 폼(S)의 높이 사이의 상관관계가 저장된 데이터베이스를 이용하여, 상기 노체진동신호(sig_vib)에 따른 상기 슬래그 폼의 높이(S)를 측정할 수 있다. 상기 데이터 베이스는 상기 노체진동에 따른 슬래그 폼(S)의 높이변화를 인공지능망(Neural network)을 이용하 여 학습시킨 것일 수 있으며, 상기 데이터 베이스에는 각각의 노체진동에 대응하는 슬래그 폼(S)의 높이가 저장 되어 있을 수 있다. 따라서, 상기 노체진동신호(sig_vib)가 상기 제어부에 입력되면, 상기 제어부는 상 기 노체진동신호(sig_vib)에 대응하는 상기 슬래그 폼(S)의 높이를 출력할 수 있다. 여기서, 상기 노체진동과 슬래그 폼(S)의 높이 사이의 상관관계를 구하고, 상기 상관관계를 포함하는 데이터 베 이스를 형성하기 위해서는, 상기 슬래그 폼(S)의 정확한 높이에 대한 정보가 필요할 수 있다. 따라서, 슬래그 게이트를 촬상하여 상기 슬래그 게이트에 대한 영상신호를 획득할 수 있으며, 상기 영상신호로부터 상기 슬래그 폼(S)의 높이 정보를 추출할 수 있다. 종래에는 조업자가 상기 슬래그 게이트에서 배출되는 슬래그의 형상 등을 이용하여 상기 슬래그 폼(S)의 높이를 식별하였으므로, 상기 슬래그 게이트를 촬상한 영상신호를 분석하여 상기 슬래그 폼 높이 정보를 추출한 후, 이를 기준신호로 하는 것이 가능하다. 이후, 기준신호와 상기 기준신호에 대응하는 상기 노체진동신호(sig_vib)을 이용하여 상기 노체진동과 상기 슬 래그 폼(S)의 높이 사이의 상관관계를 구할 수 있다. 이때, 상기 노체진동과 상기 슬래그 폼(S) 사이의 상관관 계는 복수개의 샘플을 활용하여 구할 수 있으며, 상기 인공지능망을 이용하여 상기 노체진동과 상기 슬래그폼 (S) 사이의 상관관계를 학습하도록 할 수 있다. 즉, 상기 노체진동과 상기 슬래그 폼(S) 사이의 상관관계를 경 험적으로 도출하여 데이터 베이스화하는 것이 가능하다. 추가적으로, 상기 노체진동신호(sig_vib)와 함께 상기 전극봉에 전압, 전류를 공급하는 전력투입신호 (sig_pwr)도 입력받을 수 있으며, 상기 노체진동신호(sig_vib) 및 전류공급신호(sig_pwr)와 상기 슬래그 폼(S) 의 높이와의 상관관계를 구하여 상기 데이터 베이스를 구성하는 것도 가능하다. 즉, 상기 노체진동신호 (sig_vib) 및 전력투입신호(sig_pwr)의 변화에 따른 상기 기준신호의 변화를 인공지능망으로 학습하는 방식으로 상기 데이터 베이스를 형성할 수 있다. 따라서, 상기 제어부는, 데이터베이스를 이용하여 상기 전력투입신 호(sig_pwr) 및 노체진동신호(sig_vib)에 따른 슬래그 폼의 높이를 판별하는 것이 가능하다. 도2는 본 발명의 일 실시예에 의한 슬래그 폼의 높이측정결과를 나타낸 것으로서, L1은 상기 영상신호를 통하여 추출한 상기 슬래그 폼의 높이이고, L2는 상기 노체진동신호(sig_vib)를 이용하여 추출한 상기 슬래그 폼의 높 이이다. 도2에 도시된 바와 같이, 본 발명의 일 실시예에 의한 슬래그 폼의 높이측정에 의하면, 영상신호에 의 한 실제 슬래그 폼의 높이와 거의 유사하게 상기 슬래그 폼의 높이를 측정할 수 있음을 확인할 수 있다. 상기 슬래그 폼(S)의 높이가 계산되면, 상기 제어부는 상기 계산된 슬래그 폼(S)의 높이를 이용하여 상기 전극봉의 높이를 조절할 수 있다. 앞서 살핀바와 같이, 상기 전극봉은 상기 슬래그 폼(S) 내부에서 아 크를 방전하는 동시에, 상기 전극봉과 상기 용강 사이의 거리를 최대한 증가시키는 것이 바람직하다. 즉, 상기 제어부는 상기 전극봉의 말단이 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만큼 뺀 높이를 가지도록 상기 전극봉의 높이를 조절할 수 있다. 여기서, 상기 전극봉의 말단은 상기 용강과 통전하여 아크 를 발생시키는 상기 전극봉의 최하단부를 의미할 수 있다. 구체적으로, 상기 제어부는 상기 계산된 슬래그 폼의 높이를, 상기 전극봉 말단의 한계높이로 제한함으 로써, 상기 전극봉이 상기 슬래그 폼(S)의 내부에 항상 위치하도록 할 수 있다. 또한, 상기 계산된 슬래그 폼(S)의 높이에서 기 설정된 값만큼 뺀 높이를 상기 전극봉 말단의 한계높이로 제한하는 것도 가능하며, 이 경우 상기 전극봉의 높이에 대하여 기 설정된 길이만큼의 마진(margin)을 가지므로, 보다 안정적인 전극봉 의 위치 제어가 가능하다. 또한, 상기 전극봉에 인가하는 아크 전압의 크기는 상기 전극봉과 용강 사이의 거리에 비례하므로, 상 기 전극봉 말단의 한계높이를 상기 전극봉에 인가하는 아크 전압의 크기로 설정하는 것도 가능하다. 즉, 상기 전극봉에 대하여 기 설정된 한계높이에 대응하는 한계전압을 설정한 후, 상기 한계전압 이상의 아 크 전압을 상기 전극봉에 인가하지 않도록 제한할 수 있다. 상기 아크 전압과 상기 전극봉의 높이 사이에는 대체적으로는 선형적인 관계가 있으나, 보다 정밀한 위치제 어를 위하여는 테이블표를 이용하여 상기 전극봉의 높이를 제어하는 것도 가능하다. 즉, 미리 실험데이터 등을 이용하여 상기 아크 전압의 크기와 상기 전극봉의 높이와의 상관관계를 구하여 테이블표를 구성할 수 있으며, 상기 한계높이에 대응하는 한계전압을 상기 테이블표를 통하여 설정할 수 있다. 따라서, 상기 계산된 슬래그 폼의 높이를 이용하여 상기 전극봉에 인가하는 한계전압의 크기를 설정함으로써, 상기 전극봉의 위치가 상기 슬래그 폼의 높이에 추종하도록 하는 것이 가능하다. 도3은, 본 발명의 일 실시예에 의한 전극봉 위치제어방법을 나타내는 순서도이다. 도3을 참조하면, 본 발명의 일 실시예에 의한 전극봉 위치제어방법은, 용강가열단계(S10), 슬래그 폼 형성단계 (S20), 진동측정단계(S30), 높이계산단계(S40) 및 전극봉제어단계(S50)를 포함할 수 있다. 이하, 도3을 참조하여 본 발명의 일 실시예에 의한 전극봉 위치제어방법을 설명한다. 용강가열단계(S10)에서는, 전극봉으로 아크를 발생하여 노체 내부에 저장된 용강을 가열할 수 있다. 앞서 살핀 바와 같이, 전기로를 이용하여 용강을 형성하는 경우에는, 1차 장입, 1차 용해, 2차 장입, 2차 용해, 승열 및 출강의 과정을 거쳐 상기 용강을 생성할 수 있으며, 여기서 상기 용강가열단계(S10)는 상기 승열기에 해당할 수 있다. 즉, 상기 용해과정 등을 통하여 이미 용해된 고철 등을 상기 전극봉을 이용하여 가열할 수 있다. 이후, 슬래그 폼 형성단계(S20)에서는 랜스를 이용하여 상기 용강에 부원료를 공급할 수 있으며, 상기 부원료에 의하여 상기 노체 내부에 슬래그 폼이 형성될 수 있다. 상기 부원료는 산소 및 포밍재(탄소분말)을 포함할 수 있으며, 상기 산소에 의한 탈탄반응에 의하여 생성된 CO 기체에 의하여 상기 슬래그 폼이 형성될 수 있다. 여기 서, 상기 슬래그 폼의 형성정도는 상기 전극봉이 생성하는 아크 등에 의하여 조절될 수 있다. 상기 슬래그 폼이 형성되면, 진동측정단계(S30)에서는 노체진동센서를 이용하여 상기 노체에서 발생하는 노체진 동을 측정할 수 있으며, 상기 노체진동에 대응하는 노체진동신호를 생성할 수 있다. 상기 슬래그 폼의 높이는 상기 전극봉이 생성하는 아크에 의하여 달라질 수 있으며, 상기 노체의 진동은 상기 전극봉의 아크에 의하여 발 생할 수 있다. 따라서, 상기 진동측정단계(S30)에서 측정한 상기 노체진동신호를 이용하면, 상기 슬래그 폼의 높이를 계산하는 것이 가능하다. 높이계산단계(S40)는, 상기 노체진동신호를 이용하여 상기 슬래그 폼의 높이를 계산할 수 있다. 구체적으로, 상 기 높이계산단계(S40)는 상기 노체진동과 상기 슬래그 폼의 높이 사이의 상관관계가 저장된 데이터베이스를 이 용하여 상기 슬래그 폼의 높이를 계산할 수 있다. 여기서, 상기 데이터베이스는 상기 노체진동에 따른 슬래그 폼의 높이변화를 인공지능망을 이용하여 학습시킨 것일 수 있으며, 상기 데이터 베이스에는 각각의 노체진동에 대응하는 슬래그 폼의 높이가 저장되어 있을 수 있다. 따라서, 상기 노체진동신호가 입력되면, 상기 노체진동신 호에 대응하는 상기 슬래그 폼의 높이를 출력할 수 있다. 상기 슬래그 폼의 높이가 계산되면, 전극봉제어단계(S50)를 통하여 상기 전극봉의 높이를 조절할 수 있다. 앞서 살핀 바와 같이, 상기 슬래그 폼의 내부에서 상기 전극봉이 아크를 발생시키는 동시에, 상기 전극봉과 용강 사 이의 거리를 최대로 유지하는 것이 전력효율이나 역률의 측면 등에서 유리하다. 따라서, 상기 전극봉제어단계 (S50)에서는 상기 전극봉의 말단 높이를 상기 계산된 슬래그 폼의 높이에서 기 설정된 값만큼 뺀 높이를 가지도 록 상기 전극봉의 높이를 조절할 수 있다. 즉, 상기 전극봉제어단계(S50)에서는, 상기 전극봉이 상기 슬래그 폼 의 내부에 위치하는 동시에 높은 아크 전압을 유지하도록 할 수 있다. 여기서, 상기 전극봉에 인가되는 아크 전압은 상기 전극봉에서 아크가 발생하도록 하는 전압의 크기이므로, 상 기 전극봉과 용강사이의 거리가 클수록 상기 아크 전압의 크기는 커질 수 있다. 즉, 상기 아크 전압의 크기와 전극봉의 높이는 비례하는 것으로 볼 수 있다. 따라서, 상기 설정된 전극봉의 높이에 대응하는 아크 전압의 크 기를 설정하는 방식으로 상기 전극봉의 위치제어를 수행하는 것도 가능하다. 이때, 상기 아크전압의 크기와 이 에 대응하는 전극봉의 높이를 포함하는 테이블표를 이용하여 상기 전극봉의 위치제어를 수행하는 것도 가능하다. 본 발명은 상술한 실시형태 및 첨부된 도면에 의해 한정되지 아니한다. 첨부된 청구범위에 의해 권리범위를 한 정하고자 하며, 청구범위에 기재된 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양한 형태의 치환,"}
{"patent_id": "10-2012-0153807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "변형 및 변경이 가능하다는 것은 당 기술분야의 통상의 지식을 가진 자에게 자명할 것이다."}
{"patent_id": "10-2012-0153807", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 일 실시예에 의한 전기로를 나타내는 블록도이다. 도2는 본 발명의 일 실시예에 의한 슬래그 폼의 높이측정 결과를 나타내는 그래프이다. 도3은 본 발명의 일 실시예에 의한 전극봉 위치제어방법을 나타내는 순서도이다."}
