{"patent_id": "10-2022-0121812", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0043209", "출원번호": "10-2022-0121812", "발명의 명칭": "고압수소 평가장치를 활용한 평가방법", "출원인": "주식회사 코르테크", "발명자": "정완철"}}
{"patent_id": "10-2022-0121812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고압의 기체가 공급되는 제어부;상기 제어부의 일측에 연결되어 제어부와 연결된 유로를 개폐하는 개폐밸브;상기 개폐밸브의 후단에 위치되어 개폐밸브의 동작에 따라 공급되는 기체의 압력을 측정하는 측정센서; 및상기 개폐밸브가 설정된 수로 개폐되도록 제어신호를 인가하는 작업부를 포함하는 고압수소 평가장치."}
{"patent_id": "10-2022-0121812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 측정센서는측정된 데이터에 이상이 있으면 상기 작업부로 상기 데이터를 전송하는 것을 특징으로 하는 고압수소 평가장치."}
{"patent_id": "10-2022-0121812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부와 연결되는 장치를 변경하는 장치교환장치를 더 포함하는 고압수소 평가장치."}
{"patent_id": "10-2022-0121812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 장치교환장치는장치를 변경하는 이동부와 상기 장치가 상기 제어부와 대응되어 위치되면 장치와 상기 제어부를 정렬하는 정렬부를 더 포함하는 것을 특징으로 하는 고압수소 평가장치."}
{"patent_id": "10-2022-0121812", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 작업부는기수행되어 축척된 데이터를 이용하여 기준데이터가 저장된 인공지능부를 포함하며, 상기 인공지능부는 상기 측정센서와 연결되어 상기 측정센서가 측정한 데이터와 상기 기준데이터를 비교하여 이상 여부를 체크하는 것을 특징으로 하는 고압수소 평가장치."}
{"patent_id": "10-2022-0121812", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "고압의 기체가 공급되는 제어부, 상기 제어부의 일측에 연결되어 제어부와 연결된 유로를 개폐하는 개폐밸브, 상 기 개폐밸브의 후단에 위치되어 개폐밸브의 동작에 따라 공급되는 기체의 압력을 측정하는 측정센서 및 상기 개 폐밸브가 설정된 수로 개폐되도록 제어신호를 인가하는 작업부를 포함하는 고압수소 평가장치를 활용한 평가방법 이 본 명세서에서는 개시된다."}
{"patent_id": "10-2022-0121812", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 고압수소 평가장치를 활용한 평가방법에 관한 것이다. 특히 본 발명은 편리성과 안전성이 도모된 고압수소 평가장치를 활용한 평가방법에 관한 것이다."}
{"patent_id": "10-2022-0121812", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "수소는 새로운 에너지원으로 각광받고 있다. 최근 친환경 에너지에 대한 요구가 증가됨에 따라 수소를 이용한 부품들이 제조되고 있으며, 이러한 부품의 활용은 전분야로 확산되고 있다. 수소를 이용한 부품을 위하여 가장 필요한 것은 압력을 제어 및 평가하는 장치에 관한 것이다. 수소는 가볍고, 폭발성이 매우 크기 때문에, 고압의 수소를 다룬다는 것은 생명을 담보로 한다고 할 수 있기 때문이다. 그러나 고압의 수소를 핸들링하는 것은 정밀한 장치가 필요로 하는데 이러한 장치는 대부분 고가인바, 주문, 제 작이 어려운 실정이다. 아울러 고압의 수소를 활용하는 장치는 고압으로 인하여 잦은 잔고장이 발생되고 있는 실정이다. 그러므로 현재 대부분 기업은 자체적으로 부품을 대상으로 성능을 실험하기보다는 대부분 해외에 성능을 의뢰하 여 제품의 동작 여부를 확인하고 있는 실정이다. 이로 인하여 기업의 자금이 해외로 유출되는 문제, 성능을 제 대로 검사할 수 없는 문제 등이 발생되고 있다. 또한, 작업의 편의성도 문제가 되고 있다. 현재 고압 수소를 이용한 평가는 수작업으로 수행된다. 즉, 사람이 밸브를 반복 개폐함으로써 수소를 공급하고 차단한다. 이는 단순 작업을 반복하므로 사람의 피로성을 누적시키 는바 이를 개선하여야 한다는 목소리가 높아지고 있는 실정이다."}
{"patent_id": "10-2022-0121812", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결한 것으로 고압 수소 압력을 제어 시 안전성이 확보된 장치를 활용하여 안전하 게 평가를 할 수 있는 방법을 제공하는 데 목적이 있다. 또한, 일 실시예에 의한 본 발명은 자동으로 개폐 동작을 반복함으로써 작업의 편의성이 개선된 평가 방법을 제 공하는 데 목적이 있다."}
{"patent_id": "10-2022-0121812", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 의한 본 발명은 고압의 기체가 공급되는 제어부, 상기 제어부의 일측에 연결되어 제어부와 연결된 유로를 개폐하는 개폐밸브, 상기 개폐밸브의 후단에 위치되어 개폐밸브의 동작에 따라 공급되는 기체의 압력을 측정하는 측정센서 및 상기 개폐밸브가 설정된 수로 개폐되도록 제어신호를 인가하는 작업부를 포함할 수 있다. 상기 측정센서는 측정된 데이터에 이상이 있으면 상기 작업부로 상기 데이터를 전송하는 것을 특징으로 할 수 있다. 상기 제어부와 연결되는 장치를 변경하는 장치교환장치를 더 포함할 수 있다. 상기 장치교환장치는 장치를 변경하는 이동부와 상기 장치가 상기 제어부와 대응되어 위치되면 장치와 상기 제 어부를 정렬하는 정렬부를 더 포함하는 것을 특징으로 할 수 있다. 기수행되어 축척된 데이터를 이용하여 기준데이터가 저장된 인공지능부를 포함하며, 상기 인공지능부는 상기 측 정센서와 연결되어 상기 측정센서가 측정한 데이터와 상기 기준데이터를 비교하여 이상 여부를 체크하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2022-0121812", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 의한 본 발명은 위와 같은 구성으로 형성되어 안전성이 확보될 수 있다. 그러면서 일 실시예에 의한 본 발명은 장치간 연결이 견고하여 고장이 발생되지 않으며, 아울러 고장이 발생된 다 하더라도 매우 쉽게 수리를 할 수 있다. 또한, 일 실시예에 의한 본 발명은 두 단계로 수소를 가압하므로, 설정된 압력의 수소를 인가할 수 있다."}
{"patent_id": "10-2022-0121812", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예를 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 발명에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 발명에서, '포함 하다' 또는 '가지다' 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예들을 상세히 설명한다. 이 때, 첨부된 도면에서 동일 한 구성 요소는 가능한 동일한 부호로 나타내고 있음에 유의한다. 또한, 본 발명의 요지를 흐리게 할 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략할 것이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 도 1은 일 실시예에 의한 본 발명인 고압수소 평가장치를 도시한 것이다. 도 2는 일 실시예에 의한 본 발명인 고압수소 평가장치의 연결관부를 도시한 것이다. 도 3은 일 실시예에 의한 본 발명인 고압수소 평가장치의 회수라인을 강조하여 도시한 것이다. 일 실시예에 의한 본 발명인 고압수소 평가장치는 가압부, 챔버부, 제어부, 회수라인을 포 함할 수 있다. 가압부는 기체를 고압의 기체로 가압할 수 있다. 가압부는 제1가압부, 제2가압부를 포함할 수 있다. 여기서 본 발명의 가압부는 Air boosting 방식을 활용하여 가압을 할 수 있다. 제1가압부는 저압 booster를 통하여 기체를 가압할 수 있다. 제1가압부는 약 30배의 압축비를 가질 수 있다. 즉, 제1가압부는 30배의 압축을 할 수 있다. 즉, 제1가압부는 7bar의 기체를 30배 압축하여 210bar로 가압할 수 있다. 여기서 메인 가스 탱크로부터 제1가압부에 공급되는 질소는 20bar이므로 총 230bar의 가압된 기체를 제2가압부로 공급할 수 있다. 제2가압부는 고압 booster를 통하여 기체를 가압할 수 있다. 제2가압부는 150배의 압축비를 가질 수 있다. 즉, 제2가압부는 150배의 압축을 할 수 있다. 즉, 제2가압부는 8.5bar의 기체를 150배 압축하 여 1250bar로 가압할 수 있다. 그러므로 제2가압부를 통하여 고압으로 가압된 공기는 제1가압부에 의 하여 가압된 230bar의 기체와 함께 공급되므로 총 1,505bar의 기체를 챔버부로 공급할 수 있다. 한편, 제1가압부와 제2가압부 사이에는 제1가압부를 통하여 가압된 공기가 위치되는 탱크부 가 배치될 수 있다. 또한, 제2가압부에서 챔버부로 공급되는 공기는 팽창밸브에 의하여 압력을 가변할 수 있다. 즉, 팽창 밸브는 밸브의 면적을 선형적으로 변형시키며 압력을 가변하여 공급하므로 설정된 압력의 기체를 챔버부로 공급할 수 있다. 챔버부는 제2가압부와 연결관부를 통하여 연결되고, 챔버부는 다시 연결관부를 통하 여 제어부와 연결될 수 있다. 여기서 챔버부는 온도를 변경할 수 있는 온도가변형 챔버일 수 있다. 본 발명은 제2가압부와 챔버부 사이, 그리고 챔버부와 제어부 사이에 연결관부를 통 하여 연결되어 결합이 분리 가능하게 연결되어 편의성이 도모된 것이 특징이다. 종래에는 고압 장비의 특성 상 배관의 누설 염려로 인하여 모든 장치가 일체적으로 연결된 것이 특징이었다. 그러나 이 경우에는 유지, 보수가 어려운 문제가 있다. 본 발명은 이를 해결하고자 특유의 연결관부를 통하여 각각의 부들이 연결된 것이 특징이다. 연결관부는 글랜드, 콜라, 커플러를 포함할 수 있다. 즉, 커플러를 사이에 두고, 도 2에서 도시된 바와 같이 좌측은 글랜드가 우측에는 콜라가 조립 된다. 여기서, 커플러는 도 2의 (a)에서 확인할 수 있듯이 좌측의 직경이 우측의 직경보다 크게 형성된다. 그리 고 커플러는 가운데 부분의 직경은 우측의 직경과 동일하게 배치된다. 다만, 커플러의 내부 공간은 좌측이 우측보다 크게 형성된다. 여기서 글랜드는 좌측보다 우측의 직경 이 작게 형성된다. 그러므로 커플러의 좌측은 글랜드의 우측을 둘러싸는 형태로 배치된다. 커플러의 우측에는 콜라가 배치될 수 있다. 콜라는 글랜드와 대응되는 형상으로 좌측의 직 경이 우측의 직경보다 작게 형성된다. 그러므로 커플러의 우측은 콜라의 좌측을 감싸는 형태로 배치 될 수 있다. 즉, 커플러를 기준으로 글랜드와 콜라는 각각 커플러의 좌측, 우측에 의하여 감싸지는 형 상으로 배치될 수 있다. 커플러는 좌측과 우측 사이에 작은 유로를 포함할 수 있다. 여기서 커플러의 유로는 글랜드의 유로와 콜라의 유로와 연통되도록 형성된다. 그리고 커플러의 외측에는 너트가 배치될 수 있다. 여기서 너트는 커플러를 가압하므로 커 플러를 보다 강하게 가압하여 커플러, 콜라, 글랜드의 기밀성을 강화할 수 있다. 이처럼 본 발명의 연결관부는 글랜드, 커플러, 콜라를 통하여 각각 연결된 관들이 연결된 다. 그러므로 본 발명은 각각의 구성요소들 사이의 기밀성이 높아질 수 있다. 그러면서 필요한 경우 글랜드 , 커플러, 콜라를 분리하여 각각의 구성요소들을 해체하여 점검, 보수 등을 할 수 있다. 그러나 본 발명은 추후 이들을 상호 연결함으로써 각각의 구성요소들을 기밀하게 연결할 수 있다. 또한, 본 발명은 회수라인을 더 포함할 수 있다. 회수라인은 활용된 고압의 기체를 다시 활용하고자 순환된 라인일 수 있다. 도 3에서 확인할 수 있듯이 본 발명의 회수라인은 회수압력탱크, 솔레노이드밸브를 포함할 수 있다. 고압의 기체를 다시 활용하려면 고압의 기체를 감압하여야 한다. 다만, 고압의 기체를 감압하고자 하는 경우 이 때 많은 시간이 소모될 수 있다. 본 발명은 이를 해결하고자, 회수압력탱크, 솔레노이드밸브를 포함하여, 감압 시간을 단축하였다. 고압의 기체가 공급되면 회수압력탱크는 고압의 기체를 일부 회수할 수 있다. 여기서 회수압력탱크는 기체를 공 급하는 탱크들을 의미할 수 있다. 즉, 기체를 공급하는 메인 탱크 및 메인 탱크와 연결되며 고압의 회수된 기체 가 공급되는 라인에 분기되어 연결된 탱크일 수 있다. 이들은 고압의 기체를 일부 저장하여 고압의 기체의 압력 을 낮추는 역할을 한다. 그리고 추후 필요한 경우, 저장된 기체를 다시 라인으로 공급하는 역할을 할 수 있다. 그러므로 본 발명은 감압 의 시간을 단축시킬 수 있다. 솔레노이드밸브는 전원의 공급에 따라 고압의 기체를 안전하게 연결된 외부로 방출하는 역할을 할 수 있다. 즉, 솔레노이드밸브는 전원이 공급된 경우 밸브를 개방하여, 기체를 외부로 방출하도록 할 수 있다. 이처럼 본 발명은 복수의 회수압력탱크들과 솔레노이드밸브를 이용하여 기체의 바이패스 라인을 형성함으로써 감압 시간을 단축한 채 기체를 다시 공급하여 반영구적으로 활용하도록 할 수 있다. 도 4는 일 실시예에 의한 본 발명은 고압수소 평가장치를 활용한 평가방법을 도시한 것이다. 일 실시예에 의한 경우 본 발명인 고압수소 평가장치는 작업부, 개폐밸브, 측정센서를 더 포함 할 수 있다. 일 실시예에 의한 본 발명인 고압수소 평가장치는 챔버부와 제어부 사이에 개폐밸브, 측정센서가 더 설치되어 있을 수 있다. 여기서 개폐밸브와 측정센서는 작업부(일례로 디스플레이)와 연결되어 있을 수 있다. 작업자는 작업부를 활용하여 개폐밸브의 동작 수를 설정할 수 있다. 즉, 작업자는 작업부를 활 용하여 개폐밸브의 작업 동작을 설정하는 것만으로 개폐밸브의 동작을 제어할 수 있다. 일례로 작업 자가 100회 개폐밸브의 동작 수를 설정하면 개폐밸브는 100번, 개방, 폐쇄 동작을 반복할 수 있다. 여기서, 개폐밸브는 스텝모터가 연결된 밸브일 수 있으며 또는 솔레노이드 밸브일 수 있다. 개폐밸브는 작업부의 제어신호에 따라 설정된 작업동작을 반복할 수 있다. 여기서 개폐밸브는 완전 개방, 완전 폐쇄를 할 수도 있으며, 또는 일부 개방, 일부 폐쇄를 할 수도 있다. 측정센서는 개폐밸브의 후단측에 배치되어 인가되는 기체의 압력을 측정할 수 있다. 여기서 측정센서는 기체 압력이 기설정된 압력 이상이 된 경우, 작업부로 알려줄 수 있다. 그러면 작 업부는 자동으로 개폐밸브를 폐쇄하도록 제어신호를 인가할 수 있다. 이처럼 본 발명은 작업부를 이용하여 개폐밸브를 반복 제어하고, 측정센서를 이용하여 안전성을 도모함으로써 작업의 편의성 및 안전성이 도모될 수 있다. 도 5는 일 실시예에 의한 본 발명인 고압수소 평가장치가 장치를 변경하며 평가하는 방법을 도시한 것이다. 도 4에 도시된 발명에 추가되어 본 발명은 장치의 변경을 할 수 있는 장치교체장치가 더 포함될 수 있다. 장치교환장치는 다양한 장치(일례로 리셉터클)와 제어부를 연결하는 동작을 수행할 수 있다. 장치교환장치는 정 렬부, 이동부를 포함할 수 있다. 전술한 바와 같이 작업자는 작업부를 이용하여 장치 변경을 교체할 수 있다. 그러면 개폐밸브는 유로 를 폐쇄하는 방식으로 동작된다. 그후 이동부는 장치를 교체할 수 있다. 그리고 정렬부가 동작되어 제어부와 장치의 연결을 제어할 수 있다. 여기서 정렬부는 로봇암 또는 카메라 등 다양한 장치를 포함하는 구성일 수 있다. 이후 정렬이 완료되면 개폐밸브는 다시 동작할 수 있다. 여기서 측정센서가 압력을 측정한 결과, 설 정된 압력과 상이한 압력으로 기체의 압력이 측정되면 개폐밸브가 유로를 폐쇄하도록 동작될 수 있다. 그 후 정렬부를 재동작시켜 제어부와 장치가 제대로 정렬되도록 할 수 있다. 본 발명은 위와 같은 동작을 반복함으로서 연결되는 장치를 변경할 수 있다. 도 6은 일 실시예에 의한 본 발명인 고압수소 평가장치가 스마트하게 평가하는 방법을 도시한 것이다. 도 4, 도 5 장치에 추가되어 본 발명은 인공지능부를 더 포함할 수 있다. 인공지능부는 빅데이터를 통하여 복수회 수행된 평가결과가 기저장되어 있을 수 있다. 여기서 인공지능부는 본 발명의 장치가 동작될 때마다 기준데이터와 측정센서가 측정한 데이터와 비 교함으로써 문제 이상을 파악할 수 있다. 즉, 본 발명의 인공지능부는 기준데이터를 기준으로 가용범위가 설정되어 있을 수 있다. 가용범위는 인공지능부에 데이터가 축척되며 조정될 수 있다. 그러므로 인공지능부는 장치의 동작 시 이상 없음을 미연에 확인하거나 이상이 있음을 미연에 확인할 수 있다. 일례로 4만 번의 동작이 반복되어야 하는 실험에서 인공지능부는 측정센서가 측정한 데이터가 2만 번 수행되는 경우 가용범위 내에 해당 데이터가 위치되면 이후 2만 번이 더 수행되지 않는다 하더라도, 문제가 없 다고 판단할 수 있다. 만약 그렇지 않고, 가용범위 내 외를 측정센서가 측정한 데이터가 위치되면 그렇지 않고 3만 번이 수행되 는 경우까지 지켜볼 수 있다. 이처럼 본 발명의 인공지능부는 빅데이터와 학습을 통하여 장치의 평가를 보다 효율적으로 할 수 있다. 이상, 본 발명의 일 실시예에 대하여 설명하였으나, 해당 기술 분야에서 통상의 지식을 가진 자라면 특허청구범 위에 기재된 본 발명의 사상으로부터 벗어나지 않는 범위 내에서, 구성 요소의 부가, 변경, 삭제 또는 추가 등 에 의해 본 발명을 다양하게 수정 및 변경시킬 수 있을 것이며, 이 또한 본 발명의 권리범위 내에 포함된다고 할 것이다.부호의 설명 100 : 가압부 110 : 제1가압부 120 : 탱크부 130 : 제2가압부 200 : 챔버부 300 : 제어부 400 : 연결관부 410 : 글랜드 420 : 커플러 430 : 콜라 440 : 너트 500 : 회수라인 610 : 작업부 620 : 개폐밸브 630 : 측정센서 710 : 이동부 720 : 정렬부 800 : 인공지능부도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2022-0121812", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 의한 본 발명인 고압수소 평가장치를 도시한 것이다. 도 2는 일 실시예에 의한 본 발명인 고압수소 평가장치의 연결관부를 도시한 것이다.도 3은 일 실시예에 의한 본 발명인 고압수소 평가장치의 회수라인을 강조하여 도시한 것이다. 도 4는 일 실시예에 의한 본 발명은 고압수소 평가장치를 활용한 평가방법을 도시한 것이다. 도 5는 일 실시예에 의한 본 발명인 고압수소 평가장치가 장치를 변경하며 평가하는 방법을 도시한 것이다. 도 6은 일 실시예에 의한 본 발명인 고압수소 평가장치가 스마트하게 평가하는 방법을 도시한 것이다."}
