{"patent_id": "10-2020-0001128", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0088070", "출원번호": "10-2020-0001128", "발명의 명칭": "앙상블 기계학습 방법을 이용한 재생 에너지 발전량 예측 장치 및 방법", "출원인": "고려대학교 산학협력단", "발명자": "최승연"}}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "과거의 기상정보, 예측 시점의 기상정보 및 과거의 재생 에너지 발전량 정보를 수신하는 데이터 수신부;상기 과거의 기상정보와 상기 예측 시점의 기상정보를 이용하여 예측하고자 하는 미래의 기상정보를 예측하는예측 기상정보 생성부; 및상기 과거의 기상정보, 상기 재생 에너지 발전량 정보 및 상기 미래의 기상정보 중 적어도 하나를 이용하여 재생 에너지 발전량 예측 모델을 생성하는 예측 모델 생성부를 포함하는 재생 에너지 발전량 예측 모델 생성장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 과거의 기상정보와 상기 예측 시점의 기상정보 각각은 적외영상 이미지를 포함하고,상기 예측 기상정보 생성부는 과거의 적외영상 이미지들 중에서 예측 시점의 적외영상 이미지와 유사도가 높은복수의 적외영상 이미지들을 선택하고, 상기 복수의 적외영상 이미지들 각각의 촬영 시점으로부터 소정 기간 동안 촬영된 적외영상 이미지들을 이용하여 상기 미래의 기상정보를 예측하는,재생 에너지 발전량 모델 생성 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 예측 기상정보 생성부는 상기 소정 기간 동안 촬영된 적외영상 이미지들 각각의 조도의 평균을 이용하여미래의 전운량을 산출하는,재생 에너지 발전량 모델 생성 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 예측 모델 생성부는 복수의 예측 모델들을 생성하는 개별 예측 모델 생성부와 상기 복수의 예측 모델들의출력을 이용하여 재생 에너지 발전량을 예측하는 앙상블 모델을 생성하는 앙상블 모델 생성부를 포함하는,재생 에너지 발전량 모델 생성 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 개별 예측 모델 생성부에 포함되는 제1 예측 모델 생성부는 상기 과거의 기상정보와 상기 과거의 재생 에너지 발전량 정보를 이용하여 NARX 모델(Nonlinear Autoregressive Exogenous Model)을 학습시켜 제1 예측 모델을 생성하고,상기 개별 예측 모델 생성부에 포함되는 제2 예측 모델 생성부는 상기 과거의 기상정보와 상기 과거의 재생 에공개특허 10-2021-0088070-3-너지 발전량 정보를 이용하여 LSTM(Long Short Term Memory) 모델을 학습시켜 제2 예측 모델을 생성하는,재생 에너지 발전량 모델 생성 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 앙상블 모델 생성부는 상기 과거의 기상정보와 상기 과거의 재생 에너지 발전량 정보를 이용하여 상기 제1예측 모델과 상기 제2 예측 모델 각각에 대한 가중치를 설정하여 앙상블 모델을 생성하는,재생 에너지 발전량 모델 생성 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 개별 예측 모델 생성부에 포함되는 제1 예측 모델 생성부는 상기 과거의 기상정보와 상기 과거의 재생 에너지 발전량 정보를 이용하여 파워 커브 모델(Power Curve Model)을 학습시켜 제1 예측 모델을 생성하고,상기 개별 예측 모델 생성부에 포함되는 제2 예측 모델 생성부는 상기 과거의 기상정보와 상기 과거의 재생 에너지 발전량 정보를 이용하여 NARX 모델(Nonlinear Autoregressive Exogenous Model)을 학습시켜 제2 예측 모델을 생성하고,상기 개별 예측 모델 생성부에 포함되는 제3 예측 모델 생성부는 상기 과거의 기상정보와 상기 과거의 재생 에너지 발전량 정보를 이용하여 LSTM(Long Short Term Memory) 모델을 학습시켜 제2 예측 모델을 생성하는,재생 에너지 발전량 모델 생성 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 앙상블 모델 생성부는 상기 과거의 기상정보와 상기 과거의 재생 에너지 발전량 정보를 이용하여 상기 제1예측 모델, 상기 제2 예측 모델, 및 상기 제3 예측 모델 각각에 대한 가중치를 설정하여 앙상블 모델을 생성하는,재생 에너지 발전량 모델 생성 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "과거의 기상정보와 특정 시점의 기상정보를 이용하여 상기 특정 시점으로부터 소정 기간 동안의 기상정보를 예측하여 예측 기상정보를 생성하는 예측 기상정보 생성부; 및각각에 대한 가중치가 설정된 복수의 발전량 예측 모델들의 출력에 대응하는 가중치를 적용하여 재생 에너지 발전량을 예측하는 재생 에너지 발전량 예측 모델을 이용하여 재생 에너지 발전량을 예측하는 예측부를 포함하는재생 에너지 발전량 예측 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 과거의 기상정보와 상기 특정 시점의 기상정보 각각은 적외영상 이미지를 포함하고,상기 예측 기상정보 생성부는 과거의 적외영상 이미지들 중에서 상기 특정 시점의 적외영상 이미지와 유사도가공개특허 10-2021-0088070-4-높은 복수의 적외영상 이미지들을 선택하고, 상기 복수의 적외영상 이미지들 각각의 촬영 시점으로부터 소정 기간 동안 촬영된 적외영상 이미지들을 이용하여 상기 예측 기상정보를 생성하는,재생 에너지 발전량 예측 장치."}
{"patent_id": "10-2020-0001128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 예측 기상정보 생성부는 상기 소정 기간 동안 촬영된 적외영상 이미지들 각각의 조도의 평균을 이용하여상기 특정 시점으로부터 소정 기간 동안의 전운량을 산출하는,재생 에너지 발전량 예측 장치."}
{"patent_id": "10-2020-0001128", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "재생 에너지 발전량 예측 모델 생성 장치와 재생 에너지 발전량 예측 장치가 개시된다. 상기 재생 에너지 발전량 예측 모델 생성 장치는 과거의 기상정보, 예측 시점의 기상정보 및 과거의 재생 에너지 발전량 정보를 수신하는 데이터 수신부, 상기 과거의 기상정보와 상기 예측 시점의 기상정보를 이용하여 예측하고자 하는 미래의 기상정 보를 예측하는 예측 기상정보 생성부, 및 상기 과거의 기상정보, 상기 재생 에너지 발전량 정보 및 상기 미래의 기상정보 중 적어도 하나를 이용하여 재생 에너지 발전량 예측 모델을 생성하는 예측 모델 생성부를 포함한다."}
{"patent_id": "10-2020-0001128", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 앙상블 기계학습 방법을 이용한 재생 에너지 발전량 예측 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0001128", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에 신재생 에너지를 이용한 발전량 비율이 증가하고 있으며, 이에 따라 제어할 수 없는 발전량의 비율 또한 증가하고 있다. 따라서, 신재생 에너지를 정확하게 예측하여 전력계통의 안정성과 신뢰도를 향상시켜야 한다. 이를 위해서는, 적절한 발전 예측 모델을 설계를 통해 신재생 에너지 발전량을 정확히 예측하는 것이 중요하다. 신재생 에너지 예측을 위한 모델 연구는 꾸준히 있어왔다. 전통적인 통계적 기반 추론 기법에서 최근 주목을 받 은 인공지능 기법까지 다양한 모델이 존재한다. 하지만, 대부분의 모델이 단기간 예측에 초점이 맞춰져 있으며, 장기간으로 갈수록 정확도가 급격하게 감소하는 문제점이 있다. 이로 인하여, 발전 운용 계획을 수립하는 것이 어렵다. 이는 예보 데이터의 불확실성과 관련이 크다고 볼 수 있다. 기상청의 관측소와 발전소의 위치 차에서 발생하는 오차와 거시적 관점에서의 기후 분석이 동반되지 않는다면 장기간 모델 수립은 어렵다고 볼 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제2017-0124215호 (2017.11.10. 공개) (특허문헌 0002) 대한민국 등록특허 제1761686호 (2017.07.31. 공고)"}
{"patent_id": "10-2020-0001128", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적인 과제는 복수의 발전량 예측 모델을 앙상블하여 보다 정확한 재생 에너지 발 전량을 예측하는 앙상블 모델을 생성하고 이를 통해 정확한 재생 에너지 발전량을 예측하는 것이다."}
{"patent_id": "10-2020-0001128", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 재생 에너지 발전량 예측 모델 생성 장치는 과거의 기상정보, 예측 시점의 기상정보 및 과거의 재생 에너지 발전량 정보를 수신하는 데이터 수신부, 상기 과거의 기상정보와 상기 예측 시점의 기상정보를 이용하여 예측하고자 하는 미래의 기상정보를 예측하는 예측 기상정보 생성부, 및 상기 과거의 기상정보, 상기 재생 에너지 발전량 정보 및 상기 미래의 기상정보 중 적어도 하나를 이용하여 재생 에너지 발 전량 예측 모델을 생성하는 예측 모델 생성부를 포함한다. 본 발명의 실시예에 따른 재생 에너지 발전량 예측 장치는 과거의 기상정보와 특정 시점의 기상정보를 이용하여 상기 특정 시점으로부터 소정 기간 동안의 기상정보를 예측하여 예측 기상정보를 생성하는 예측 기상정보 생성 부 및 각각에 대한 가중치가 설정된 복수의 발전량 예측 모델들의 출력에 대응하는 가중치를 적용하여 재생 에 너지 발전량을 예측하는 재생 에너지 발전량 예측 모델을 이용하여 재생 에너지 발전량을 예측하는 예측부를 포 함한다."}
{"patent_id": "10-2020-0001128", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따른 재생 에너지 발전량 예측 모델 생성 장치 및 방법과 예측 장치 및 방법에 의할 경우, 개별 예측 모델을 앙상블하여 보다 정확한 재생 에너지 발전량을 예측할 수 있는 효과가 있다. 또한, 적외영상 이미지로부터 예측 기상정보를 생성하고, 생성된 예측 기상정보를 발전량 예측에 이용함으로써 발전량 예측의 정확도를 높일 수 있는 효과가 있다."}
{"patent_id": "10-2020-0001128", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 개시되어 있는 본 발명의 개념에 따른 실시 예들에 대해서 특정한 구조적 또는 기능적 설명들은 단 지 본 발명의 개념에 따른 실시 예들을 설명하기 위한 목적으로 예시된 것으로서, 본 발명의 개념에 따른 실시 예들은 다양한 형태들로 실시될 수 있으며 본 명세서에 설명된 실시 예들에 한정되지 않는다. 본 발명의 개념에 따른 실시 예들은 다양한 변경들을 가할 수 있고 여러 가지 형태들을 가질 수 있으므로 실시 예들을 도면에 예시하고 본 명세서에서 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 개념에 따른 실시 예들을 특정한 개시 형태들에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변 경, 균등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용어 들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로 만, 예컨대 본 발명의 개념에 따른 권리 범위로부터 벗어나지 않은 채, 제1 구성 요소는 제2 구성 요소로 명명 될 수 있고 유사하게 제2 구성 요소는 제1 구성 요소로도 명명될 수 있다. 어떤 구성 요소가 다른 구성 요소에 '연결되어 있다'거나 '접속되어 있다'고 언급된 때에는, 그 다른 구성 요소 에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성 요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성 요소가 다른 구성 요소에 '직접 연결되어 있다'거나 '직접 접속되어 있다'고 언급된 때에는 중간에 다른 구성 요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성 요소들 간 의 관계를 설명하는 다른 표현들, 즉 '~사이에'와 '바로 ~사이에' 또는 '~에 이웃하는'과 '~에 직접 이웃하는' 등도 마찬가지로 해석되어야 한다. 본 명세서에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로서, 본 발명을 한정하려는 의 도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, '포함하다' 또는 '가지다' 등의 용어는 본 명세서에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구 성 요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적 으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 이하, 본 명세서에 첨부된 도면들을 참조하여 본 발명의 실시 예들을 상세히 설명한다. 그러나, 특허출원의 범 위가 이러한 실시 예들에 의해 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다. 도 1은 본 발명의 일 실시예에 따른 예측 모델 생성 장치의 기능 블럭도이다. 도 1을 참조하면, 발전량 예측 모델 생성 장치, 재생 에너지 발전량 예측 모델 생성 장치 등으로 명명될 수도 있는 예측 모델 생성 장치는 소정의 입력 정보에 기초하여 태양광 발전량, 풍력 발전량, 조력 발전량 및 지 열 발전량 중 적어도 하나의 재생 에너지 발전량을 예측하는 예측 모델을 생성할 수 있다. 예측 모델은 발전량 예측 모델, 재생 에너지 발전량 예측 모델, 태양광 발전량 예측 모델, 풍력 발전량 예측 모델 등으로 명명될 수 도 있다. 예측 모델 생성 장치는 데이터 수신부, 예측 기상정보 생성부 및 예측 모델 생성부를 포함 한다. 실시예에 따라 예측 모델 생성 장치는 저장부 및/또는 예측부를 더 포함할 수도 있다. 따 라서, 예측 모델 생성 장치는 재생 에너지 발전량 예측 장치나 발전량 예측 장치 등으로 명명될 수도 있다. 실시예에 따라, 발전량 예측 장치는 데이터 수신부, 예측 기상정보 생성부, 저장부 및 예측 부 만을 포함할 수도 있다. 이 경우, 예측부는 예측 모델 생성 장치에 의해 생성된 예측 모델을 이용하여 예측을 수행할 수 있다. 데이터 수신부는 예측 모델 생성 과정(학습 과정)에서 필요한 데이터 및/또는 예측을 수행하기 위해 필요 한 데이터를 수신하고 수신된 데이터를 저장부에 저장할 수 있다. 구체적으로, 데이터 수신부는 다양 한 기상 예보 사이트(또는 기상 예보 정보를 제공하는 서버)로부터 예측 기상정보 및/또는 과거 기상정보 등을 수신할 수 있다. 예컨대, 데이터 수신부는 기상청, 국립기상과학원, Accuweather 및 Darksky 중 적어도 하 나로부터 과거 기상정보 및/또는 예측 기상정보를 수신할 수 있다. 특히, 해당 서버(또는 사이트)가 API를 제공 하는 경우, 실시간으로 데이터를 수신할 수 있다는 장점이 있다. 이를 통해, 자동으로 데이터를 업데이트하고 예측 발전량을 출력하는 모델을 생성할 수 있다. 예측 기상정보 생성부는 데이터 수신부에 의해 수신된 과거 기상정보를 바탕으로 예측 기상정보(데이 터 수신부에 의해 수신되는 예측 기상 정보와 구분하기 위하여 제2 예측 기상정보라 명명될 수 있음)를 생 성할 수 있다. 일 예로, 예측 기상정보 생성부는 기상정보 제공 서버, 예컨대 기상청이 운영하는 서버로부 터 수신되는 위성 영상 데이터에 기초하여 제2 예측 기상정보(예컨대, 전운량 예측정보, 풍향 예측정보, 풍속 예측정보 등)를 생성하거나 제2 예측 기상정보를 생성하는 예측 모델을 생성할 수 있다. 실시예에 따라, 예측 기상정보 생성부는 별도의 기상 예측 동작을 수행하지 않고, 예측 기상정보를 제공하는 서버 등으로부터 데이터를 수신하고 수신된 데이터를 저장부에 저장할 수도 있다. 또한, 예측 기상정보 생성부에 의해 생성된 예측 기상정보(예컨대, 전운량, 풍향, 풍속)는 예측 모델(개별 예측 모델 및/또는 앙상블 모델)의 학습 및/또는 예측에 이용될 수 있다. 예측 기상정보 생성부의 구체적인 동작은 후술하기로 한다. 예측 모델 생성부는 데이터 수신부에 의해 수신된 데이터(또는 저장부에 저장되어 있는 데이터) 및/또는 예측 기상정보 생성부에 의해 생성된 제2 예측 기상정보(또는 저장부에 저장되어 있는 제2 예측 기상정보)를 이용하여 미래의 발전량을 예측하는 예측 모델을 생성할 수 있다. 예측 모델 생성부의 구체적인 동작은 후술하기로 한다. 예측부는 예측 모델 생성부에 의해 생성된 예측 모델을 이용하여 재생 에너지 발전량을 예측할 수 있 다. 구체적으로, 예측부는 온도, 강수량, 풍속, 풍향, 습도, 시정, 증기압, 이슬점 온도, 현지 기압, 해변 기압, 일조, 지면 온도, 전운량, 예측 시점, 예측 종점, 예측 구간(즉, 예측 시점으로부터 예측 종범까지의 구 간) 및 예측 간격 중 적어도 하나 이상을 입력으로 개별 예측 모델들 각각의 예측값과 앙상블 모델의 예측값을 도출하고, 앙상블 모델의 예측값을 최종 예측값으로 출력할 수 있다. 저장부에는 데이터 수신부에 의해 수신된 데이터, 예측 기상정보 생성부에 의해 생성된 제2 예 측 기상정보, 예측 모델 생성부에 의해 생성된 예측 모델 등이 저장될 수 있다. 예측 모델 생성 장치는 각종 연산 처리 및 신호 생성이 가능한 적어도 하나의 전자 장치를 포함할 수 있다. 여기서, 적어도 하나의 전자 장치는 프로세서 및/또는 프로세서가 설치된 컴퓨팅 장치를 포함할 수 있다. 여기서, 프로세서는 중앙 처리 장치(CPU, Central Processing Unit), 마이크로 컨트롤러 유닛(MCU, Micro Controller Unit), 마이컴(Micom, Micro Processor), 애플리케이션 프로세서(AP, Application Processor), 그 래픽 처리 장치(GPU, Graphic Processing Unit) 및/또는 각종 연산 처리 및 제어 신호의 생성이 가능한 처리 장 치 등을 포함할 수 있다. 이들 처리 장치는 예를 들어 하나 또는 둘 이상의 반도체 칩 및 관련 부품을 이용하여 구현될 수 있다. 또한, 컴퓨팅 장치는 데스크톱 컴퓨터, 랩톱 컴퓨터, 서버용 컴퓨터, 태블릿 피씨 및/또는 이 외 정보 처리 기능을 수행할 수 있는 적어도 하나의 전자 장치를 포함할 수 있다. 예측 모델 생성 장치는 도 1에 도시된 바와 같이 저장부와 데이터 송수신이 가능하도록 직접 또는 간 접적으로 연결되어 있을 수 있다. 저장부는 데이터 수신부에 의해 수신된 데이터, 예측 기상정보 생 성부에 의해 생성된 데이터, 예측 모델 생성부에 의해 생성된 예측 모델 및/또는 이외 예측 모델 생 성 장치의 제어, 연산 또는 처리 과정에서 생성된 적어도 하나의 데이터를 일시적으로 또는 비일시적으로 저장할 수 있다. 저장부는 주기억장치 및 보조기억장치 중 적어도 하나를 포함할 수 있으며, 주기억장치는 롬(ROM) 및/또는 램(RAM) 등을 포함할 수 있고, 보조기억장치는 플래시 메모리 장치, SD(Secure Digital) 카드, 솔리드 스테이트 드라이브(SSD, Solid State Drive), 하드 디스크 드라이브(HDD, Hard Disc Drive) 컴팩트 디 스크(CD), 디브이디(DVD) 및/또는 레이저 디스크 등을 포함할 수 있다. 예측 모델 생성 장치는 저장부에 저장된 애플리케이션을 구동시켜, 예측 기상정보 생성, 예측 모델 생 성, 결과 생성 또는 결과 출력 등 다양한 동작을 수행할 수도 있다. 여기서, 애플리케이션은 설계자에 의해 직 접 작성되어 저장부에 저장 또는 갱신된 것일 수도 있고, 또는 유선 또는 무선 통신 네트워크를 통해 접속 가능한 전자 소프트웨어 유통망 등을 통하여 획득 또는 갱신된 것일 수도 있다. 이하에서는, 예측 기상정보 생성부의 구체적인 동작에 대하여 설명한다. 도 2는 도 1에 도시된 예측 기상정보 생성부에 의한 예측 모델 생성과정 및/또는 예측 기상정보 생성 과정을 설 명하기 위한 도면으로써, 적외영상 이미지들을 도시한다. 우선, 데이터 수신부는 소정의 정보 제공 서버, 예컨대 기상청이 운영하는 서버로부터 복수의 위성 적외영 상 이미지들(복수의 구름 이미지들로 명명될 수도 있음)을 수신하고 수신된 복수의 위성 적외영상 이미지들을 저장부에 저장할 수 있다. 복수의 위성 적외영상 이미지들에는 과거의 위성 적외영상 이미지들(과거의 구 름 이미지들)과 현재의 위성 적외영상 이미지들(현재의 구름 이미지들)이 포함될 수 있다. 예측 기상정보 생성부는 예측을 진행할 시점의 구름 이미지(위성 적외영상 이미지)와 과거의 구름 이미지 (위성 적외 영상영상 이미지)를 비교하여 예측 기상정보를 생성할 수 있다. 구름의 형태와 종류에 따라서 구름 이 해당 지역에 얼마나 유지될지 판별할 수 있는 근거 중 하나이기 때문에, 현재 적외영상 이미지에서 나타나는 구름 이미지가 과거 구름 이미지와 유사하면 현재의 구름이 과거의 구름과 유사하게 이동할 가능성이 크다고 볼 수 있다. 구체적으로, 예측 기상정보 생성부는 구름 이미지를 통하여 구름 패턴을 예측하고자 가장 최신의 위성 적외영상 이미지를 바탕으로 예측을 수행한다. 과거의 이미지 데이터를 데이터베이스에 시간 순서에 맞게 저장한 뒤 존재하는 모든 과거 이미지 데이터를 불러와 예측을 시작하고 싶은 시점(즉, 현재)의 이미지를 비교 분석학습을 진행하여 유사도를 확인하고, 유사도가 가장 높은 이미지를 선정한 후 순서대로 연속된 이미지들을 이용하여 수치로 변환한다. 즉, 예측 기상정보 생성부는 과거의 위성 적외영상 이미지들 중에서 현재의 위 성 적외영상 이미지와 가장 유사도가 높은 위성 적외영상 이미지들(즉, 유사 이미지들)을 선택할 수 있다. 이때, 예측 기상정보 생성부는 특정 지역만의 구름의 양을 판별하기 위해서 위성 적외영상 이미지의 일부 만을 이용하여 예측 동작을 수행하는 것도 가능하다. 실제 실험 환경에서는, 한반도 영역만의 구름으로는 구름 의 형태나 흐름을 예측하기 힘들어 아시아 영역 크기의 이미지에서 먼저 구름의 형태와 크기의 유사도를 판별하 고, 다시 동일한 시간대에 있는 한반도 영역 크기의 이미지에서 유사도 비교 작업을 수행하여 유사도를 얻어낼 수 있다. 이를 통해, 유사한 이미지들을 추출하고 이를 바탕으로 새롭게 예측 이미지를 만들어 해남의 구름의 정도를 예측할 수 있다고 판단하였다. 우선, 소정의 이미지 인식 도구, 예컨대 Python에서 mahotas라는 라이브 러리를 이용하여 이미지를 인식하고 이를 바탕으로 유사도를 확인하였다. 해당 라이브러리는 자체적으로 이미지 사이의 거리를 계산한 후 저장되는 프로그램으로, 과거 이미지에서 구름과 현재 기준이미지에서 구름의 모양이 나 크기의 차이가 얼마나 적은지를 찾아 유사도를 판별하는 방식으로 이용된다. 이후에 Matlab을 이용하여 이미 지에 대한 처리를 하였으며, 기존의 이미지에서 나라나 해양을 구분하기 위한 노란색 테두리는 기상 수치로 변 환 시 이상치로 나타나므로 이를 배제하고 판단하였다. 예측 기상정보 생성부는 선택된 유사 이미지들을 이용하여 예측 기상정보를 생성할 수 있다. 구체적으로, 예측 기상정보 생성부는 유사 이미지들 각각에 대하여 유사 이미지가 촬영된 시점(또는 생성된 시점)으로 부터 소정의 시간 구간(예컨대, 3일 동안) 소정의 주기로 촬영된 이미지들을 이용하여 예측 기상정보를 생성할 수 있다. 구체적으로, 현재 이미지와 유사도가 높은 a(a는 2 이상의 자연수, 예컨대 a=3) 개의 유사 이미지들(제1 내지 제3 유사 이미지)이 선택된 경우를 예로 들 수 있다. 예측 기상정보 생성부는 제1 유사 이미지의 촬영 시 점을 기준으로 3일 동안의 이미지들, 제2 유사 이미지의 촬영 시점을 기준으로 3일 동안의 이미지들 및 제3 유사 이미지의 촬영 시점을 기준으로 3일 동안의 이미지들을 이용하여 예측 기상정보를 생성할 수 있다. 현재 이 미지가 t0 시점에 촬영된 이미지이고, 제1 유사 이미지가 t1 시점에 촬영된 이미지이고, 제2 유사 이미지가 t2 시점에 촬영된 이미지이고, 제3 유사 이미지가 t3 시점에 촬영된 이미지일 때, t0+k×d 시점에서의 예측 기상정 보는 t1+k×d 시점에서 촬영된 이미지, t2+k×d 시점에서 촬영된 이미지 및 t3+k×d 시점에서 촬영된 이미지를 이용하여 생성될 수 있다. 즉, 관심 지역(예컨대, 전라남도 해남 지역)의 t1+k×d 시점 이미지의 명도, t2+k×d 시점 이미지의 명도 및 t3+k×d 시점 이미지의 명도의 평균에 대응하도록(또는 비례하도록) t0+k×d 시점의 예 측 기상정보(예컨대, 전운량)를 생성할 수 있다. 여기서, d는 위성 적외영상의 촬영 주기를 의미하고, k는 임의 의 자연수일 수 있다. 판별된 유사 이미지는 유사도 순위에 따라 가중치를 부여하며, 해당 가중치는 이미지의 명도를 수치로 변환 시 반영하여 최종적으로 구름의 정도에 대한 수치를 값으로 도출할 수 있다. 즉, 하나의 예 측지점에서 하나의 이미지만을 사용해서 예측으로 이용하지 않고, 유사도를 기반으로 가중치를 매긴 다중의 이 미지를 이용하여 수치로 변환한다. 도 3에는 2019년 6월 1일부터 2019년 6월 3일까지 예측된 전운량 수치와 실제 측정된 전운량 수치가 도시되어 있다. 예측 데이터와 실제 데이터에 대한 RMSE(Root Mean Square Error, 평균 제곱근 오차)와 MAE(Mean Absolute Error, 평균 절대 오차)는 다음 표 1과 같다. 표 1 RMSE MAE 32.3674 26.9671 도 3 및 표 1과 같이, 예측값과 실제값 사이의 오차는 존재하나 그래프의 모양이 상당히 유사한 형태로 진행되 고 있는 것을 확인할 수 있다. 오차의 원인으로 데이터의 부족이라고 판단되었다. 실험을 진행한 장비의 한계로 인하여 이미지 처리에 사용된 사진이 약 2개월분밖에 없었기 때문이다. 보다 고속으로 이미지를 처리할 수 있는 장비와 많은 이미지 데이터로 정밀한 이미지 전운량 예측을 수행한다면 보다 정밀한 전운량 예측이 가능할 것으 로 판단된다. 이와 같이 산출된 예측 기상정보(예컨대, 전운량)는 소정의 재생 에너지 발전량 예측 모델의 입력 데이터로 활용될 수 있다. 도 4는 도 1에 도시된 예측 모델 생성부의 기능 블럭도이다. 도 4를 참조하면, 예측 모델 생성부는 개별 예측 모델 생성부와 앙상블 모델 생성부를 포함한다. 개별 예측 모델 생성부는 복수의 예측 모델을 생성할 수 있다. 이를 위해, 개별 예측 모델 생성부에 는 제1 예측 모델 생성부와 제2 예측 모델 생성부가 포함될 수 있다. 실시예에 따라, 개별 예측 모델 생성부 는 2 이상의 개별 예측 모델을 생성할 수 있고, 이 경우 개별 예측 모델 생성부에는 각각이 상이한 예측 모델을 생성하는 제1 내지 제n 예측 모델 생성부가 포함될 수 있다. 여기서 n은 2 이상의 자연수로써 개별 예측 모델의 개수를 의미할 수 있다. 개별 예측 모델은 ARMAX 모델, NARX 모델, LSTM 모델 및 파워 커브(Power Curve) 모델 중 적어도 하나 이상을 포함할 수 있다. 또한, 이하에서 설명하는 태양광 발전량을 예측하는 개별 모델과 풍력 발전량을 예측하는 개별 모델은 하나의 예시일 뿐이며, 실시예에 따라 개별 예측 모델의 종류와 개 수는 변화할 수 있다. 앙상블 모델 생성부는 개별 예측 모델 생성부에 의해 생성된 예측 모델들 각각의 출력을 입력으로 이 용하여 재생 에너지 발전량을 예측하는 앙상블 모델을 생성할 수 있다. 구체적으로, 앙상블 모델 생성부는 개별 예측 모델들 각각의 출력(즉, 임의의 시점에 대한 예측된 발전량)과 실제 발전량을 입력으로 학습됨으로써 각 개별 예측 모델들에 대한 가중치를 계산할 수 있다. 가중치가 내장된 함수에 앙상블할 예측값을 입력하면 앙 상블된 결과를 출력할 수 있다. 일 예로, 앙상블 모델 생성부는 여러 데이터를 조합하여 결과를 예측해보 고 실제 데이터와 가장 유사한 결과를 도출하는 경우의 가중치를 최종 가중치로 결정함으로써 앙상블 모델을 생 성할 수 있다. 도 5는 제1 앙상블 모델의 출력값과 실제 출력값을 도시하는 그래프이다. 도 5에는 2019년 6월 1일부터 15일까 지의 예측값과 발전량을 비교하여 학습하고, 2019년 6월 16일부터 30일까지 테스트한 결과가 도시되어 있다. 또 한, 개별 예측 모델로는 NARX 1h와 LSTM 모델을 이용하였고, 이미지 운량 예측 데이터를 이용하였다. 제1 앙상블 모델의 성능 평가는 표 2에 나타내었다. 표 2 모델 MAE nMAE(%) Ensemble1 0.2948 3.994 NARX 1h 0.4335 5.873 LSTM 0.4055 5.494 도 6은 제2 앙상블 모델의 출력값과 실제 출력값을 도시하는 그래프이다. 도 6에는 2019년 6월 1일부터 15일까 지의 예측값과 발전량을 비교하여 학습하고, 2019년 6월 16일부터 30일까지 테스트한 결과가 도시되어 있다. 또 한, 개별 예측 모델로는 NARX 1h, NARX 2h 및 LSTM을 이용하였고, 이미지 운량 예측 데이터를 이용하였다. 제2 앙상블 모델의 성능 평가는 표 3에 나타내었다. 표 3 모델 MAE nMAE(%) Ensemble2 0.3049 4.130 NARX 1h 0.4335 5.873 NARX 2h 0.3988 5.403 LSTM 0.4055 5.494 앙상블 결과, NARX 1h와 LSTM을 앙상블시킨 제2 앙상블 모델이 조금 더 효과적임을 알 수 있다. 도 7은 제3 앙상블 모델의 출력값과 실제 출력값을 도시하는 그래프이다. 도 7에는 2019년 6월 1일부터 15일까 지의 예측값과 발전량을 비교하여 학습하고, 2019년 6월 16일부터 30일까지 테스트한 결과가 도시되어 있다. 또 한, 개별 예측 모델로는 제1 앙상블 모델과 제2 앙상블 모델을 이용하였다. 즉, 상술한 두 개의 앙상블 모델의 결과를 앙상블하였다. 제3 앙상블 모델의 성능 평가는 표 4에 나타내었다. 표 4 모델 MAE nMAE(%) 제1 앙상블 모델 0.2948 3.994 제2 앙상블 모델 0.3049 4.130 제3 앙상블 모델 0.2939 3.982 비교 결과, 제3 앙상블 모델이 보다 좋은 결과를 도출하였지만, 차이가 크지 않았다. 세 가지 앙상블 모델을 실 험해본 결과 제3 앙상블 모델(double ensemble)이 약간의 오차를 가지고 더 좋아졌으나, 프로그램 사용 시간이 나 복잡도를 고려하면 제1 앙상블 모델이 가장 효율적이라 할 수 있다. 이하에서는, 개별 예측 모델에 대하여 설명한다. 제1 예측 모델은 ARMAX 모델(Autoregressive Moving Average Model, 자동회귀이동평균 모델) 또는 NARX 모델 (Nonlinear Autoregressive Exogenous Model) 일 수 있다. 이하에서는 NARX 모델을 이용한 예측 모델 생성 과 정에 대하여 설명하도록 한다. 제1 예측 모델 생성부는 훈련 데이터를 이용하여 NARX 모델을 학습시킴으로써 제1 예측 모델(즉, 학습된 NARX 모델)을 생성할 수 있다. ARMAX처럼 기상데이터를 외부변수로 추가하기 위해 NARX 방식을 선택할 수 있다. 시계열 방식으로 발전량을 예측하되 외부변수를 추가함으로써 기상변화에 유연하게 대응된 결과를 기대할 수 있 다. NARX 모델의 외부변수로 기상데이터 및/또는 시각(time) 정보가 이용될 수 있다. 시각 정보를 외부변수로 사용함으로써, 태양광 발전의 경우 밤과 새벽에 발전량이 없고 낮에 발전량이 있음을 더욱 효과적으로 학습시킬 수 있다. NARX 모델의 입력 데이터(외부변수)로 온도, 강수량, 풍속, 풍향, 습도, 시정, 증기압, 이슬점 온도, 현지 기압, 해면 기압, 일조, 지면 온도와 같은 기상 조건 중 적어도 하나가 이용될 수 있다. 다만, 예측 정확도를높이기 위해, 각 외부변수와 발전량(예컨대, 태양광 발전량)의 상관관계를 조사하였다. 구체적으로, 전라남도 해남에 위치하는 태양광 발전소의 발전량(2년 동안의 발전량)과 외부요인의 상관계수를 분석하였다. 외부요인별 상관계수는 표 5와 같다. 표 5 기상조건(외부요인) 상관계수 기상조건(외부요인) 상관계수 온도 0.3344 증기압 0.0381 강수량 -0.0621 이슬점 온도 0.0443 풍속 0.3716 현지 기압 -0.0434 풍향 0.2749 해면 기압 -0.0454 습도 -0.6344 일조 0.8128 시정 0.3303 지면 온도 0.5515 해남의 태양광 발전소의 태양광 발전량 2년 데이터와의 상관관계를 비교한 결과, 일조, 습도, 지면 온도의 상관 계수가 0.5 이상으로 크다. 하지만, 일조와 지면 온도는 별도의 예보 데이터가 제공되지 않는다. 또한, 계절적 특성을 고려하여 2017년 7, 8월과 2018년 7, 8월의 4개월 간의 상관계수를 비교해 보면, 습도, 온도의 상관계수 가 각각 -0.7658, 0.7525로 영향력이 가장 큼을 알 수 있었다. 따라서, 습도와 온도가 외부요인으로 이용될 수 있다. 다만, 본 발명의 권리범위가 제1 예측 모델의 입력 데이터의 종류에 제한되는 것은 아니며, 실시예에 따 라 다양한 외부변수의 조합으로 제1 예측 모델을 학습시킬 수 있다. 예컨대, 일조와 지면 온도를 포함하는 외부 변수를 이용하여 NARX 모델을 학습시킴으로써 제1 예측 모델의 예측 정확도를 향상시킬 수도 있을 것이다. 제1 예측 모델에 의한 예측 시간 단위는 다양할 수 있다. 예컨대, 제1 예측 모델은 1시간 단위로 또는 2시간 단 위로 발전량을 예측할 수 있다. NARX를 이용한 1시간 단위 예측에서, 온도, 습도, 및 시간이 외부변수로 이용되었다. 일조를 외부변수로 이용하 는 경우 정확도가 높지만 예보 데이터가 제공되지 않으므로 예보데이터가 잘 되어 있고 상관계수가 높은 온도, 습도를 외부변수로 이용하였다. 두 달 동안 온도의 상관계수는 0.6996, 습도의 상관계수는 -0.7574이다. NARX 모델의 학습(training)은 계절적 특정을 고려하여 2017년 7, 8월 2개월 동안의 데이터로 진행하였다. 0 ~ 5시의 이른 시간과 21 ~ 23시의 늦은 시각에 출력이 생기는 잘못된 예측값은 처리해주었다. 도 8은 제1 예측 모델의 학습에 이용된 2개월 데이터 중 501 ~ 1000번째 훈련 데이터를 시각화한 그래프이다. 학습 결과의 오차는 MAE : 0.1915, nMAE : 2.5948%이다. 도 9는 제1 예측 모델을 이용한 3달 예측 데이터 중 301 ~ 700번째 예측 데이터를 시각화한 그래프이다. 학습하 여 생성한 함수를 이용하여, 즉 학습된 제1 예측 모델을 이용하여 2018년 6, 7, 8월을 예측하였다. 오차는 MAE : 0.4158, nMAE : 5.6335%이다. 이 예측값은 앙상블 모델을 학습하기 위한 학습 데이터로 이용될 수 있다. 도 10은 제1 예측 모델을 이용한 1달 예측 데이터 중 301 ~ 700번째 예측 데이터를 시각화한 그래프이다. 즉, 도 10은 학습된 제1 예측 모델을 이용하여 2019년 6월을 예측한 결과이다. 오차는 MAE : 0.4353, nMAE : 5.8977%이다. 이 데이터 역시 앙상블 모델을 학습하기 위한 학습 데이터로 이용될 수 있다. 기상 예보데이터를 이용한 1시간 단위 NARX 모델 예측에서, 온도, 습도, 시간을 외부변수로 이용하였다. 실제 예측을 수행할 때는 기상 예보 데이터를 외부변수로 입력할 수 있으므로 기상청에서 얻은 예보자료를 통해 모델 을 테스트하였다. 기상청 예보데이터의 10시간 유실로 인해 13시부터 결과를 내었다. 도 11에는 예보 데이터를 이용한 2019년 6월 1, 2, 3일의 예측결과를 도시하는 그래프가 도시되어 있다. 이 경우의 오차는 MAE : 0.4399, nMAE : 5.90448%이다. 정확도가 조금 하락하였지만 예보의 오차로 인해 발생한 미미한 수준으로 평가된다. NARX를 이용한 2시간 단위 예측에서, 온도, 습도, 및 시간이 외부변수로 이용되었다. 2017년 7, 8월 2개월 동안 의 데이터를 이용하여 2h 단위 예측을 하도록 학습을 진행하였다. 2h 단위 예측은 (3시간이전, 2시간이전), (1 시간이전, 현재값)을 입력으로 하고 마찬가지의 외부변수를 넣으면 1시간 후 발전량, 2시간 후 발전량을 예측한 다. 도 12는 2시간 단위의 예측을 수행하는 제1 예측 모델의 학습에 이용된 2개월 학습 결과의 1001 ~ 1400번째 데 이터를 시각화한 그래프이다. 오차는 MAE : 0.2390, nMAE : 3.2386%이다. 도 13은 2시간 단위의 예측을 수행하는 제1 예측 모델을 이용한 3달 예측 데이터 중 201 ~ 700번째 예측 데이터 를 시각화한 그래프이다. 2018년 6, 7, 8월에서 예측 테스트를 수행하였으며, 오차는 MAE : 0.4567, nMAE : 6.1868%이다. 도 14는 2시간 단위의 예측을 수행하는 제1 예측 모델을 이용한 1달 예측 데이터 중 201 ~ 700번째 예측 데이터 를 시각화한 그래프이다. 2019년 6월을 예측한 결과이다. 오차는 MAE : 0.4602, nMAE : 6.2347%이다. NARX 1h 단위 예측에 비해 정확도가 떨어지는 것을 알 수 있으나, 앙상블 모델에 이용될 수 있다. 상술한 6가지 경우의 오차 결과를 표 6으로 정리하였다. 2시간 단위의 예측보다 1시간 단위의 예측이 보다 정확 하였다. 표 6 모델 및 기간 MAE nMAE(%) NARX 1h Training (17년 7,8월) 0.1915 2.5948 NARX 1h Prediction (18년 6,7,8월) 0.4158 5.6335 NARX 1h Prediction (19년 6월) 0.4353 5.8977 NARX 1h Prediction (기상예보데이터) 0.4399 5.9045 NARX 2h Training (17년 7,8월) 0.2390 3.2386 NARX 2h Prediction (18년 6,7,8월) 0.4567 6.1868 NARX 2h Prediction (19년 6월) 0.4602 6.2347 제2 예측 모델은 LSTM(Long Short Term Memory) 모델일 수 있다. RNN(Recurrent Neural Network)은 은닉층이 방향을 갖는 엣지(edge)로 연결되어 순환구조를 이루는 인공신경망의 한 종류이다. LSTM은 관련 정보와 그 정보 를 사용하는 지점이 멀어져 역전파시 그래디언트의 감소로 vanishing gradient problem이라는 학습능력의 저하 문제를 해결하기 위한 하나의 모델이다. 제2 예측 모델 생성부는 훈련 데이터를 이용하여 LSTM 모델을 학습시킴으로써 제2 예측 모델(즉, 학습된 LSTM 모델)을 생성할 수 있다. LSTM 모델의 입력 데이터(외부변수)로 온도, 강수량, 풍속, 풍향, 습도, 시정, 증기압, 이슬점 온도, 현지 기압, 해면 기압, 일조, 지면 온도와 같은 기상 조건 중 적어도 하나가 이용될 수 있다. 제2 예측 모델 생성부는 제1 예측 모델의 생성에 이용된 학습 데이터 또는 별도의 학습 데이터를 이용하 여 LSTM 모델을 학습시킴으로써 제2 예측 모델을 생성할 수 있다. 실험적으로는 Python의 Tensorflow를 기반으로 작성된 LSTM 프로그램으로 재생 에너지 발전량(예컨대, 태양광 발전량) 예측을 하였다. 여기서 사용되는 Python은 인터프리터식, 객체지향적 동적 타이핑 대화형 프로그래밍 언어이며, 기계학습, 딥러닝, 빅데이터 등의 다양한 분야에서 사용되고 있다. 본 발명을 위하여 Python 프로그 램 언어에서 사용한 것은 Tensorflow이다. Tensorflow는 구글에서 2015년에 일반인들도 사용할 수 있는 오픈 소 스로 공개되었으며 다양한 환경에서 데이터의 흐름에 대한 연구목적의 기계학습 라이브러리이다. 이런 이유로 딥러닝 및 기계학습 분야의 연구로 많이 사용되는 라이브러리이다. 앞의 Python에서 Tensorflow를 바탕으로 현재 얻을 수 있는 기상 예측 데이터가 기온, 풍속, 풍향, 습도, 이슬 점 및 데이터들이 시계열적으로 존재한다는 것을 염두하여 앞의 데이터들과 함께 시간(시각)까지 데이터로 사용 하여 고려하여 태양광 발전 예측을 시도하였다. 여기서, 풍속 및 풍향의 기후는 사용시 출력량의 유사도와 많이 떨어진다고 판단하여 배제하고 최종적으로 학습 및 테스트를 하였다. 하습 기간은 1개월 기준으로 확실히 나뉘 어서 확인하여 보기 위하여 예측해야 하는 실제 시간인 54시간보다 조금 긴 3일 예측을 위하여 2017년 7월 1일 0시부터 2019년 5월 31일 23시까지로 하고 출력을 6월 1일 0시부터 6월 3일 23시까지로 하였다. 도 15는 제2 예측 모델을 이용한 3일 예측값을 도시하는 그래프이다. 오차는 RMSE : 0.3833, MAE : 0.2454이다. 도 15를 통해 예측값과 실제값이 유사함을 알 수 있으며, 특히 6월 1일차의 경우 거의 일치하는 것을 알 수 있 다. 다음으로, 전운량에 따라서 현재 예보값으로 얻을 수 없는 일사량 및 일조량에 영향을 주어지면 기온 및 기온이 변화하며, 태양광 발전에도 영향을 준다고 판단하여 전운량 데이터를 이용하였을 대는 도 16과 같은 결과가 도 출되었다. 즉, 도 16은 전운량 데이터를 이용한 제2 예측 모델의 예측값을 도시한다. 오차는 RMSE : 0.4455, MAE : 0.2562이다. 전운량 데이터를 사용한 예측값이 앞선 전운량 데이터 없이 학습할 때에 비해서 실제값보다 낮았던 구간을 보여준 것은 6월 2일 발전량 예측에서 확인할 수 있었다. 현재 에러 값이 앞선 방법보다 약간 높 은 것을 알 수 있으나 전운량 데이터가 2018년 8월 1일 1시부터만 존재하여 실제로 데이터량이 앞선 방법과 같 이 2년분이 존재한다면 더욱 정확해졌을 것이라 판단된다. 도 17은 전운량을 학습하고 구름 이미지 패턴 분석을 통하여 얻은 전운량으로 발전량을 예측하였을 때의 결과를 도시하는 그래프이다. 오차는 RMSE : 0.5234, MAE : 0.3067이다. 획득된 데이터는 앞선 두 가지 방법보다 오차 가 크지만 6월 1일에서 전운량 데이터를 사용하지 않은 방법과 같이 발전량 보정이 되었고 6월 2일의 데이터를 확인하면 다른 예측방법과 다르게 실제값이 보이는 V 형태의 출력을 대략 따라가는 것을 확인할 수 있었다. 마 지막 6월 3일에서는 다른 방식과 유사하게 예측을 하는 것을 알 수 있다. 이미지로 전운량을 예측하고 이를 실제로 예측하는 데 사용하였을 때, 6월 2일의 데이터처럼 유사하게 나올 수 있었던 이유는 전운량의 데이터를 보다 정확하게 표현하였기 때문인 것으로 판단된다. 현재 가지고 있는 기상청 전운량 데이터는 10분위 데이터로 이로 인하여 작은 오차가 발생하고 사용되고 마지막 예측 전운량을 이용하는 방식을 100분위 기준이라 보다 정밀하다고 판단된다. 다만, 오차가 난 원인은 앞선 전운량의 학습 데이터 및 구 름 예측의 이미지 처리 개수의 부족으로 판단된다. 학습을 위한 데이터량이 증가한다면 보다 정확한 발전량 예 측을 할 수 있을 것으로 판단된다. 이상으로, 태양광 발전량 예측을 중심으로 본 발명을 설명하였다. 이하에서는, 풍령 발전량 예측에 관하여 구체 적인 설명을 기술한다. 앞서 기재한 내용과 중복되는 내용에 관하여는 그 기재를 생략하고 차이점을 위주로 설 명하기로 한다. 개별 예측 모델 중 제1 예측 모델은 파워 커브(Power Curve) 모델일 수 있다. 파워 커브는 풍력 발전기의 발전 효율을 나타내는 그래프이다. 파워 커브는 제조사가 제공하는 제품 사양을 토대로 하여 구성할 수 있으며, 실제 풍속과 발전량의 실측 자료를 기반으로 한 회귀 모델을 이용하여 계산할 수도 있다. 풍속은 급격하게 변하지 않 기 때문에, 풍속계를 적절한 위치에 설치한다면, 제조사에서 제공하는 파워 커브보다 더 정학하고 해당 발전소 에 특화된 파워 커브를 구할 수 있다. 제주 가시리 풍력 발전소에 대한 과거 데이터, 예컨대 풍속, 풍향, 습도 및 온도와 발전량의 상관관계를 통해 커브 피팅(Curve Fitting)을 위한 상관계수를 추측하였다. 학습 데이터의 범위는 2017년 7월 1일 1시부터 2019 년 5월 31일 24시까지의 데이터(풍속, 풍향, 습도 및 온도와 발전량)이다. 회귀 모델(Regression Model)을 통해 파워 커브를 구하기 위해서는 정확한 데이터가 요구되며, 데이터 전처리 과정이 필요하다. 오류 데이터나 비연속 데이터, Outlier가 많아질수록 커브의 정확도가 하락하게 되며, 예상됐 던 출력에서 벗어난 전혀 다른 결과로 인해 발전량 예측에 실패할 수 있기 때문이다. 도 18에는 외부변수와 풍 력 발전량의 상관관계를 나타낸 그래프가 도시되어 있다. 도 18의 그래프들은 제주 가시리에 있는 풍력 발전소 의 발전량 데이터와 해당 발전소로부터 가장 가까이 위치한 성산 기상관측소에서 측정된 종관관측 데이터를 1 대 1로 맵핑한 것이다. 상황에 따라 약간의 오차가 생기는 것을 고려해도 해당 데이터에서 식을 도출하기는 어 려우며, 이는 데이터 오류가 많은 것으로 생각할 수 있다. 또한, 기존의 풍력발전기는 최소 3m/s의 풍속에서 발 전을 시작한다고 할 때, 저속 단계에서 절대 나올 수 없는 양의 발전량이 출력되는 점을 확인할 수 있다. 도 18 을 통해, 풍속-발전량 이외에 상관관계가 있다고 추측되는 다른 요인들도 정확하지 않은 데이터로 인해 전혀 상 관관계를 찾을 수 없는 것을 알 수 있다. 때문에, 파워 커브 모델을 계산하기 전, 데이터 전처리 과정을 통해 데이터를 정제해야 하며, Outlier나 오차의 원인을 찾아 반영해야 할 필요가 있다. 다양한 커브 피팅을 이용하여 예측 정확도를 최적화하고자 하였다. 우선, 전처리 없이 훈련 기간을 다르게 한 경우(Type 0)이다. 데이터의 훈련 기간 또한 파워 커브의 정확도에 영향을 미치게 된다. 일반적으로 데이터가 많으면 많을수록 정확도가 높아져야 한다. 하지만, 제공된 데이터의 경우, 오차 데이터나 오류 데이터가 훈련 기간이 길수록 급격하게 많아져서, 파워 커브의 정확도가 떨어지게 된 다. 예를 들어 2019.06.28. ~ 2019.06.30. 기간(Case 1)을 대상으로 한 출력 데이터에서는 두 개의 Case 모두 비슷한 MAE 오차를 보이지만, 2019.06.09. ~ 2019.06.12 기간(Case 2)을 대상으로 한 테스트 기간에서는 훈련 기간이 적은 Caserk 훨씬 적은 오차를 보인다. 때문에, 전처리를 사용하여 훈련 데이터의 오류를 필터링하거나,적절한 훈련 기간을 설정하여 파워 커브의 정확도를 높일 수 있다. 도 19에는 제1 케이스(Case 1)에 대한 파워 커브 정확도가 도시되어 있고, 도 20에는 제2 케이스(Case 2)에 대한 파워 커브 정확도가 도시되어 있다. 또한, 표 7에는 제1 케이스와 제2 케이스에 대한 학습 오차를 나타내었다. 표 7 모형 학습RMSE 검증RMSE 검증MAE 비고 17.07.01-19.06.30 Polynomial2_robust 8.680 5.5563 3.0794 Polynomial3_robust 12.23 5.3977 2.9557 Smoothing spline 11.47 5.8588 3.1767 Linear fitting 14.93 6.4039 3.2564 Lowess 10.16 5.6397 3.0256 18.06.01-18.08.31 Polynomial2_robust 1.017 6.3815 3.3346 +0.2552 Polynomial3_robust 1.061 5.8242 2.9970 +0.0413 Smoothing spline 6.867 5.6487 3.0457 -0.1310 Linear fitting 6.864 5.5980 2.9899 -0.2665 Lowess 6.657 5.7380 3.0530 +0.0274 다음으로, 발전 가능범위을 설정하여 데이터를 전처리한 경우(Type 1)이다. 오류 데이터를 제거하고 데이터의 정확성을 향상하기 위해, 풍력 발전기가 발전 가능한 최대 발전범위와 최소 발전범위를 설정하여 데이터를 필터링하였다. 필터링 후, 대상 기간을 다양하게 하여 테스트하였을 시, 정확도 가 좀 더 향상된 것을 확인할 수 있었다. 도 21은 풍력발전기 최대 발전 가능 범위 추측을 통한 파워 커브를 도 시하고, 표 8은 이에 대한 학습 오차를 나타낸다. 표 8 모형 학습RMSE 검증RMSE 검증MAE Polynomial2_robust 1.1300 7.2772 3.1187 Polynomial3_robust 0.6026 6.9716 2.9058 Smoothing spline 3.5990 7.0893 2.7240 Linear fitting 3.6770 8.5502 3.8595 Lowess 3.9500 6.8213 2.9589 Average+Smoothing 3.8370 7.2341 2.6652 다음으로, 발전 가능 범위 및 효율과 발전량 평균을 반영한 경우(Type 2-제주)이다. 발전 가능 범위를 제한하고, 데이터의 중간값과 평균을 반영하여, 파워 커브에서 이론적인 결과를 개선하였다. 해당 그래프에서 가장 결과가 좋은 경우는 Smoothing Spline+평균값의 경우였으며, 다른 기간을 테스트했을 때, 오차가 준수하면서 발전량 추세를 가장 잘 나타내는 것은 Lowess+Average 모델이었다. 도 22는 발전기 효율 및 실제 발전량 평균을 반영한 경우의 파워 커브를 도시하고, 도 23은 다양한 커브 피팅 모형을 통한 발전량 예측 그래프를 도시한다. 또한, 표 9는 학습 오차를 나타낸다. 표 9 모형 학습RMSE 검증RMSE 검증MAE Polynomial2+Average 0.2908 6.0451 2.8879 Polynomial3+Average 0.4127 5.7582 2.7697 SmoothingSpline+Average 5.2920 5.5309 2.6939 Linear fitting+Average 5.5770 7.5507 3.2465 Lowess+Average 5.5360 5.7933 2.8120다음으로, 발전 가능 범위 및 효율과 발전량 평균을 반영한 경우(Type 3-경주)이다. 제주(Type 2)와 비슷하게, 다양한 기법들을 경주 데이터에 적용시켜 테스트해보았으며, 측정된 경주 기상 데이 터가 정확하여, 예측도가 높은 파워 커브를 얻을 수 있었다. 해당 파워 커브는 풍속, 공기밀도, 발전량을 학습 시켜 얻은 모델이다. 도 24는 풍속-공기밀도-발전량을 비교하여 커브 피팅을 수행한 결과를 도시하고, 도 25는 Lowess 모형을 이용하여 경주 풍력 발전소 발전량 예측 결과를 도시한 그래프이다. 상술한 바와 같이, 개별 예측 모델 생성부에 포함되는 복수의 예측 모델 생성부 중 어느 하나는 소정 기간 동안의 기상 데이터, 즉 풍향, 풍속, 공기밀도, 습도 및 온도 중 적어도 하나와 발전량 데이터를 이용하여 학습 함으로써 최적의 파워 커브 모델을 생성할 수 있다. 개별 예측 모델 중 제2 예측 모델은 NARX 모델일 수 있다. 풍력 발전의 경우, 풍속이 가장 유력한 외부변수로 작용한다. 추가적인 외부변수로 온도, 강수량, 풍속, 풍향, 습도, 시정, 증기압, 이슬점온도, 현지기압, 해명기압, 일조, 지면온도 등을 고려할 수 있다. 즉, 개별 예측 모 델 생성부에 포함된 복수의 예측 모델 생성부들 중 어느 하나는 위 외부 변수와 (풍력) 발전량에 대한 정 보를 기반으로 NARX 모델을 학습시킴으로써 제2 예측 모델을 생성할 수 있다. 개별 예측 모델 중 제3 예측 모델은 LSTM 모델일 수 있다. NARX 모델과 LSTM 모델 및/또는 앙상블 모델에 관하 여는 앞선 기재와 중복되기 때문에 이에 대한 상세한 설명은 생략하기로 한다. 이상에서 설명된 장치는 하드웨어 구성 요소, 소프트웨어 구성 요소, 및/또는 하드웨어 구성 요소 및 소프트웨 어 구성 요소의 집합으로 구현될 수 있다. 예를 들어, 실시 예들에서 설명된 장치 및 구성 요소는, 예를 들어, 프로세서, 콘트롤러, ALU(Arithmetic Logic Unit), 디지털 신호 프로세서(Digital Signal Processor), 마이크 로컴퓨터, FPA(Field Programmable array), PLU(Programmable Logic Unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(Operation System, OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응 답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사 용되는 것으로 설명된 경우도 있지만, 해당 기술 분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처 리 요소(Processing Element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (Parallel Processor)와 같은, 다른 처리 구성(Processing Configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(Computer Program), 코드(Code), 명령(Instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (Collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성 요소(Component), 물리적 장치, 가상 장치(Virtual Equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(Signal Wave)에 영구적으로, 또는 일시적으로 구체화(Embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시 예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 좋ㅂ하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시 예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD- ROM, DVD와 같은 광기록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체 (Magneto-optical Media), 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계 어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상 기된 하드웨어 장치는 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 본 발명은 도면에 도시된 실시 예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시 예가 가능하다는 점을 이해할 것이다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성 요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성 요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범 위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2020-0001128", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 상세한 설명이 제공된다. 도 1은 본 발명의 일 실시예에 따른 예측 모델 생성 장치의 기능 블럭도이다. 도 2는 도 1에 도시된 예측 기상정보 생성부에 의한 예측 모델 생성 과정 및/또는 예측 기상정보 생성 과정을 설명하기 위한 도면으로써, 적외영상 이미지들을 도시한다. 도 3은 2019년 6월 1일부터 6월 3일까지의 구간 동안 산출된 전운량의 예측 데이터와 실제 측정 데이터를 도시 한다. 도 4는 도 1에 도시된 예측 모델 생성부의 기능 블럭도이다. 도 5는 제1 앙상블 모델의 출력값과 실제 출력값을 도시하는 그래프이다. 도 6은 제2 앙상블 모델의 출력값과 실제 출력값을 도시하는 그래프이다. 도 7은 제3 앙상블 모델의 출력값과 실제 출력값을 도시하는 그래프이다. 도 8은 제1 예측 모델의 학습에 이용된 2개월 데이터 중 501 ~ 1000번째 훈련 데이터를 시각화한 그래프이다. 도 9는 제1 예측 모델을 이용한 3달 예측 데이터 중 301 ~ 700번째 예측 데이터를 시각화한 그래프이다. 도 10은 제1 예측 모델을 이용한 1달 예측 데이터 중 301 ~ 700번째 예측 데이터를 시각화한 그래프이다. 도 11은 예보 데이터를 이용한 2019년 6월 1, 2, 3일의 예측결과를 도시하는 그래프를 도시한다. 도 12는 2시간 단위의 예측을 수행하는 제1 예측 모델의 학습에 이용된 2개월 학습 결과의 1001 ~ 1400번째 데 이터를 시각화한 그래프이다. 도 13은 2시간 단위의 예측을 수행하는 제1 예측 모델을 이용한 3달 예측 데이터 중 201 ~ 700번째 예측 데이터 를 시각화한 그래프이다. 도 14는 2시간 단위의 예측을 수행하는 제1 예측 모델을 이용한 1달 예측 데이터 중 201 ~ 700번째 예측 데이터 를 시각화한 그래프이다. 도 15는 제2 예측 모델을 이용한 3일 예측값을 도시하는 그래프이다. 도 16은 전운량 데이터를 이용한 제2 예측 모델의 예측값을 도시한다. 도 17은 전운량을 학습하고 구름 이미지 패턴 분석을 통하여 얻은 전운량으로 발전량을 예측하였을 때의 결과를도시하는 그래프이다. 도 18은 외부변수와 풍력 발전량의 상관관계를 나타낸 그래프이다. 도 19는 제1 케이스에 대한 파워 커브 정확도를 도시한 그래프이다. 도 20은 제2 케이스에 대한 파워 커브 정확도를 도시한 그래프이다. 도 21은 풍력발전기 최대 발전 가능 범위 추측을 통한 파워 커브를 도시한다. 도 22는 발전기 효율 및 실제 발전량 평균을 반영한 경우의 파워 커브를 도시한다. 도 23은 다양한 커브 피팅 모형을 통한 발전량 예측 그래프를 도시한다. 도 24는 풍속-공기밀도-발전량을 비교하여 커브 피팅을 수행한 결과를 도시한다. 도 25는 Lowess 모형을 이용하여 경주 풍력 발전소 발전량 예측 결과를 도시한 그래프이다."}
