{"patent_id": "10-2023-0095216", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0014733", "출원번호": "10-2023-0095216", "발명의 명칭": "복수의 소스 장치를 제어하는 전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "김현석"}}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디스플레이;복수의 소스 장치와 통신을 수행하는 통신 인터페이스; 및상기 복수의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이하도록 상기 디스플레이를 제어하며,입력 장치로부터 수신된 기 설정된 신호에 따라, 상기 입력 장치로부터 수신된 제어 신호를 상기 복수의 소스장치 중 제1 소스 장치로 전송하는 상기 통신 인터페이스가 상기 제어 신호를 제2 소스 장치로 전송하도록 상기통신 인터페이스를 제어하고, 상기 입력 장치에 대한 사용자 입력에 따라 상기 입력 장치로부터 상기 제어 신호가 수신되면, 상기 제어 신호를 상기 제2 소스 장치로 전송하고,상기 사용자 입력이 반영된 영상 신호가수신되면, 수신된 영상 신호를 디스플레이하도록 상기 디스플레이를 제어하는 하나 이상의 프로세서;를 포함하는 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,상기 제어 신호를 상기 제1 소스 장치로 전송하는 동안에 상기 기 설정된 신호가 수신되면, 상기 제어 신호를전송하기 위한 소스 장치를 상기 제1 소스 장치에서 상기 제2 소스 장치로 변경하여 상기 제어 신호를 상기 제2소스 장치로 전송하고,상기 제어 신호를 상기 제2 소스 장치로 전송하는 동안에 상기 기 설정된 신호가 수신되면, 상기 제어 신호를전송하기 위한 소스 장치를 상기 제2 소스 장치에서 상기 제3 소스 장치로 순차적으로 변경하여 상기 제어 신호를 상기 제3 소스 장치로 전송하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 복수의 소스 장치 각각에 대응되는 기 설정된 신호 관련 정보가 저장된 메모리;를 더 포함하며,상기 하나 이상의 프로세서는,상기 입력 장치로부터 기 설정된 제1 신호가 수신되면, 상기 정보에 기초하여 상기 기 설정된 제1 신호에 대응되는 상기 제1 소스 장치를 식별하고, 상기 제1 소스 장치로 상기 제어 신호를 전송하며,상기 입력 장치로부터 기 설정된 제2 신호가 수신되면, 상기 정보에 기초하여 상기 기 설정된 제2 신호에 대응되는 상기 제2 소스 장치를 식별하고, 상기 제2 입력 장치로 상기 제어 신호를 전송하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 통신 인터페이스는,스위치 모듈을 포함하며,상기 전자 장치는,무선 통신 인터페이스;를 더 포함하고, 공개특허 10-2025-0014733-3-상기 하나 이상의 프로세서는,상기 전자 장치와 페어링된 상기 입력 장치로부터 상기 기 설정된 신호가 상기 무선 통신 인터페이스를 통해 수신되면, 상기 제어 신호를 전송하기 위한 소스 장치가 상기 제1 소스 장치에서 상기 제2 소스 장치로 전환되도록 상기 스위치 모듈을 제어하고,상기 스위치 모듈은,상기 하나 이상의 프로세서의 제어에 따라 상기 통신 인터페이스를 구성하는 복수의 포트 중 상기 제2 소스 장치에 대응되는 포트로 상기 제어 신호를 전송하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,복수의 입력 장치 중 적어도 하나의 입력 장치로부터 상기 기 설정된 신호가 수신되면, 상기 기 설정된 신호에기초하여 상기 복수의 입력 장치 각각으로부터 수신되는 제어 신호를 전송하기 위한 소스 장치가 상기 제1 소스장치에서 상기 제2 소스 장치로 전환되도록 상기 통신 인터페이스를 제어하고,상기 복수의 입력 장치 각각으로부터 수신되는 상기 제어 신호를 상기 제2 소스 장치로 전송하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 하나 이상의 프로세서는,상기 제1 소스 장치로 상기 제어 신호를 전송하는 동안에 상기 복수의 입력 장치 중 제1 입력 장치로부터 상기기 설정된 신호가 수신되면, 상기 제어 신호를 전송하기 위한 소스 장치를 상기 제1 소스 장치에서 상기 제2 소스 장치로 순차적으로 변경하고,상기 제2 소스 장치로 상기 제어 신호를 전송하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,상기 디스플레이를 메인 디스플레이 영역 및 서브 디스플레이 영역으로 구분하고,상기 제어 신호를 상기 제1 소스 장치로 전송하면, 상기 제1 소스 장치로부터 수신된 영상 신호를 상기 메인 디스플레이 영역에 디스플레이하고,상기 복수의 소스 장치 중 나머지 소스 장치로부터 수신된 영상 신호를 상기 서브 디스플레이 영역에 디스플레이하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 하나 이상의 프로세서는,PBP(Picture By Picture) 모드 또는 PIP(Picture In Picture) 모드에 따라 상기 메인 디스플레이 영역 및 상기서브 디스플레이 영역을 구분하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 입력 장치는, 마우스를 포함하며,상기 하나 이상의 프로세서는,공개특허 10-2025-0014733-4-상기 제1 소스 장치로부터 수신된 제1 영상 신호 및 상기 제2 소스 장치로부터 수신된 제2 영상 신호 각각을 디스플레이하도록 상기 디스플레이를 제어하며,상기 기 설정된 신호에 따라, 상기 마우스로부터 수신된 상기 제어 신호를 전송하기 위한 소스 장치가 상기 제1소스 장치에서 상기 제2 소스 장치로 변경되면, 상기 사용자 입력에 따라 이동하는 포인터는, 상기 제2 영상 신호에 대응되는 화면 내의 초기 위치에 위치한 후에 상기 제어 신호에 따라 이동하며, 상기 제어 신호는,상기 포인터를 이동시키기 위한 좌표 정보를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 입력 장치는, 마우스를 포함하며,상기 하나 이상의 프로세서는,상기 제1 소스 장치로부터 수신된 제1 영상 신호 및 상기 제2 소스 장치로부터 수신된 제2 영상 신호 각각을 디스플레이하도록 상기 디스플레이를 제어하며,상기 기 설정된 신호에 따라 상기 마우스로부터 수신된 상기 제어 신호를 전송하기 위한 소스 장치가 상기 제1소스 장치에서 상기 제2 소스 장치로 변경되면, 상기 제1 영상 신호에 대응되는 화면 내의 제1 포인터의 현 위치를 저장하고, 상기 제2 영상 신호에 대응되는 화면 내의 제2 포인터의 이전 위치를 로드(load)하며,상기 사용자 입력에 따라 이동하는 상기 제2 포인터는,상기 제2 영상 신호에 대응되는 화면 내의 상기 이전 위치에 위치한 후에 상기 제어 신호에 따라 이동하며,상기 제어 신호는,상기 포인터를 이동시키기 위한 좌표 정보를 포함하는, 전자 장치."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치의 제어 방법에 있어서,복수의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이하는 단계;입력 장치로부터 수신된 기 설정된 신호에 따라, 상기 복수의 소스 장치 중 제1 소스 장치로 전송되는 상기 입력 장치로부터 수신된 제어 신호를 제2 소스 장치로 전송하는 단계; 및상기 입력 장치에 대한 사용자 입력에 따라 상기 입력 장치로부터 수신된 상기 제어 신호를 상기 제2 소스 장치로 전송하여 상기 제2 소스 장치로부터 상기 사용자 입력이 반영된 영상 신호가 수신되면, 상기 수신된 영상 신호를 디스플레이하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 전송하는 단계는,상기 제어 신호를 상기 제1 소스 장치로 전송하는 동안에 상기 기 설정된 신호가 수신되면, 상기 제어 신호를전송하기 위한 소스 장치를 상기 제1 소스 장치에서 상기 제2 소스 장치로 변경하여 상기 제어 신호를 상기 제2소스 장치로 전송하는 단계; 및상기 제어 신호를 상기 제2 소스 장치로 전송하는 동안에 상기 기 설정된 신호가 수신되면, 상기 제어 신호를전송하기 위한 소스 장치를 상기 제2 소스 장치에서 상기 제3 소스 장치로 변경하여 상기 제어 신호를 상기 제3소스 장치로 전송하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,공개특허 10-2025-0014733-5-상기 전송하는 단계는,상기 입력 장치로부터 기 설정된 제1 신호가 수신되면, 상기 복수의 소스 장치 각각에 대응되는 기 설정된 신호관련 정보에 기초하여 상기 기 설정된 제1 신호에 대응되는 제1 소스 장치를 식별하고, 상기 제1 소스 장치로상기 제어 신호를 전송하는 단계; 및상기 입력 장치로부터 기 설정된 제2 신호가 수신되면, 상기 정보에 기초하여 상기 기 설정된 제2 신호에 대응되는 제2 소스 장치를 식별하고, 상기 제2 소스 장치로 상기 제어 신호를 전송하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 전송하는 단계는,상기 전자 장치와 페어링된 상기 입력 장치로부터 상기 기 설정된 신호가 수신되면, 상기 제어 신호를 전송하기위한 소스 장치가 상기 제1 소스 장치에서 상기 제2 소스 장치로 전환되도록 스위치 모듈을 제어하는 단계;를포함하며,상기 스위치 모듈을 제어하는 단계는,상기 전자 장치에 구비된 복수의 포트 중 상기 제2 소스 장치에 대응되는 포트로 상기 제어 신호를 전송하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 전송하는 단계는,복수의 입력 장치 중 적어도 하나의 입력 장치로부터 상기 기 설정된 신호가 수신되면, 상기 기 설정된 신호에기초하여 상기 복수의 입력 장치 각각으로부터 수신되는 제어 신호를 전송하기 위한 소스 장치를 상기 제1 소스장치에서 상기 제2 소스 장치로 전환하는 단계; 및상기 복수의 입력 장치 각각으로부터 수신되는 상기 제어 신호를 상기 제2 소스 장치로 전송하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 전송하는 단계는,상기 제1 소스 장치로 상기 제어 신호를 전송하는 동안에 상기 복수의 입력 장치 중 제1 입력 장치로부터 상기기 설정된 신호가 수신되면, 상기 제어 신호를 전송하기 위한 소스 장치를 상기 제1 소스 장치에서 상기 제2 소스 장치로 순차적으로 변경하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 디스플레이하는 단계는,상기 제어 신호를 상기 제1 소스 장치로 전송하면, 상기 제1 소스 장치로부터 수신된 영상 신호를 메인 디스플레이 영역에 디스플레이하는 단계; 및상기 복수의 소스 장치 중 나머지 소스 장치로부터 수신된 영상 신호를 서브 디스플레이 영역에 디스플레이하는단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,공개특허 10-2025-0014733-6-상기 복수의 소스 장치 각각으로부터 수신된 화면을 디스플레이하는 단계는,PBP(Picture By Picture) 모드 또는 PIP(Picture In Picture) 모드에 따라 상기 메인 디스플레이 영역 및 상기서브 디스플레이 영역을 구분하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 입력 장치는, 마우스를 포함하며,상기 복수의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이하는 단계는,상기 제1 소스 장치로부터 수신된 제1 영상 신호 및 상기 제2 소스 장치로부터 수신된 제2 영상 신호 각각을 디스플레이하는 단계;를 포함하며,상기 기 설정된 신호에 따라, 상기 마우스로부터 수신된 상기 제어 신호를 전송하기 위한 소스 장치가 상기 제1소스 장치에서 상기 제2 소스 장치로 변경되면, 상기 사용자 입력에 따라 이동하는 포인터는, 상기 제2 영상 신호에 대응되는 화면 내의 초기 위치에 위치한 후에 상기 제어 신호에 따라 이동하며,상기 제어 신호는,상기 포인터를 이동시키기 위한 좌표 정보를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 입력 장치는, 마우스를 포함하며,상기 복수의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이하는 단계는,상기 제1 소스 장치로부터 수신된 제1 영상 신호 및 상기 제2 소스 장치로부터 수신된 제2 영상 신호 각각을 디스플레이하는 단계;를 포함하며,상기 수신된 영상 신호를 디스플레이하는 단계는,상기 기 설정된 신호에 따라 상기 마우스로부터 수신된 상기 제어 신호를 전송하기 위한 소스 장치가 상기 제1소스 장치에서 상기 제2 소스 장치로 변경되면, 상기 제1 영상 신호에 대응되는 화면 내의 제1 포인터의 현 위치를 저장하고, 상기 제2 영상 신호에 대응되는 화면 내의 제2 포인터의 이전 위치를 로드(load)하는 단계;를포함하며,상기 사용자 입력에 따라 이동하는 상기 제2 포인터는,상기 제2 영상 신호에 대응되는 화면 내의 상기 이전 위치에 위치한 후에 상기 제어 신호에 따라 이동하며,상기 제어 신호는,상기 포인터를 이동시키기 위한 좌표 정보를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0095216", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 전자 장치는 디스플레이, 복수의 소스 장치와 통신을 수행하는 통신 인터페이스 및 복수 의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이하도록 디스플레이를 제어하며, 입력 장치로부터 수신 된 기 설정된 신호에 따라, 입력 장치로부터 수신된 제어 신호를 복수의 소스 장치 중 제1 소스 장치로 전송하는 통신 인터페이스가 제어 신호를 제2 소스 장치로 전송하도록 통신 인터페이스를 제어하고, 입력 장치에 대한 사 용자 입력에 따라 입력 장치로부터 제어 신호가 수신되면, 제어 신호를 제2 소스 장치로 전송하고, 사용자 입력 이 반영된 영상 신호가수신되면, 수신된 영상 신호를 디스플레이하도록 디스플레이를 제어하는 하나 이상의 프로 세서를 포함한다."}
{"patent_id": "10-2023-0095216", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전자 장치 및 그 제어 방법에 관한 것으로, 더욱 상세하게는, 입력 장치를 통해 복수의 소스 장치를 제어하는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2023-0095216", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 다양한 가전 제품이 개발 및 보급되고 있으며, 특히 디스플레이 장치, 소스 장치 등에 대한 개발 및 보급 은 다른 어떠한 분야보다도 활발한 실정이다. 소비자들은 댁 내에도 복수개의 디스플레이 장치, 복수개의 소스 장치를 구비하고 있으며, 이를 제어하는 방법 에 어려움을 토로하고 있다.예를 들어, 복수개의 소스 장치를 개별적으로 제어하기 위해서는, 소스 장치들 각각에 입력 장치(또는, 제어 장 치)가 연결되어야 하며, 이는 댁 내에 요구되는 입력 장치의 개수가 증가하는 문제가 있다. 또한, 입력 장치들 중에서 사용자가 제어하고하는 소스 장치와 연결된 입력 장치를 찾는 과정은 사용자에게 불 편함을 초래할 수 있다. 사용자가 제어하고자 하는 소스 장치가 변경되었을 때에도 사용자가 복수의 입력 장치들 중에서 특정 입력 장치 (제어하고자 하는 소스 장치와 연결된 입력 장치)를 찾을 필요 없이, 하나의 입력 장치로 복수개의 소스 장치를 제어하는 방법, 소스 장치들 중에서 사용자가 제어하고자 하는 소스 장치로 손쉽게 전환하는 방법에 대한 요구 가 있어왔다."}
{"patent_id": "10-2023-0095216", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이상과 같은 목적을 달성하기 위한 본 개시의 일 실시 예에 따른 전자 장치는 디스플레이, 복수의 소스 장치와 통신을 수행하는 통신 인터페이스 및 상기 복수의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이하도 록 상기 디스플레이를 제어하며, 입력 장치로부터 수신된 기 설정된 신호에 따라, 상기 입력 장치로부터 수신된 제어 신호를 상기 복수의 소스 장치 중 제1 소스 장치로 전송하는 상기 통신 인터페이스가 상기 제어 신호를 제 2 소스 장치로 전송하도록 상기 통신 인터페이스를 제어하고, 상기 입력 장치에 대한 사용자 입력에 따라 상기 입력 장치로부터 상기 제어 신호가 수신되면, 상기 제어 신호를 상기 제2 소스 장치로 전송하고, 상기 사용자 입력이 반영된 영상 신호가수신되면, 수신된 영상 신호를 디스플레이하도록 상기 디스플레이를 제어하는 하나 이상의 프로세서를 포함한다. 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법은, 복수의 소스 장치 각각으로부터 수신된 영상 신호를 디 스플레이하는 단계, 입력 장치로부터 수신된 기 설정된 신호에 따라, 상기 복수의 소스 장치 중 제1 소스 장치 로 전송되는 상기 입력 장치로부터 수신된 제어 신호를 제2 소스 장치로 전송하는 단계 및 상기 입력 장치에 대 한 사용자 입력에 따라 상기 입력 장치로부터 수신된 상기 제어 신호를 상기 제2 소스 장치로 전송하여 상기 제 2 소스 장치로부터 상기 사용자 입력이 반영된 영상 신호가 수신되면, 상기 수신된 영상 신호를 디스플레이하는 단계를 포함한다. 본 개시의 상술한 목적을 달성하기 위한 일 실시 예에 따르면 전자 장치의 제어 방법을 실행하는 프로그램을 포 함하는 컴퓨터 판독 가능 기록매체에 있어서, 상기 전자 장치의 제어 방법은, 복수의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이하는 단계, 입력 장치로부터 수신된 기 설정된 신호에 따라, 상기 복수의 소스 장치 중 제1 소스 장치로 전송되는 상기 입력 장치로부터 수신된 제어 신호를 제2 소스 장치로 전송하는 단계 및 상기 입력 장치에 대한 사용자 입력에 따라 상기 입력 장치로부터 수신된 상기 제어 신호를 상기 제2 소스 장치로 전송하여 상기 제2 소스 장치로부터 상기 사용자 입력이 반영된 영상 신호가 수신되면, 상기 수신된 영 상 신호를 디스플레이하는 단계를 포함한다."}
{"patent_id": "10-2023-0095216", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 본 명세서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 1은 본 개시의 일 실시 예에 따른 입력 장치로부터 제어 신호를 수신하는 전자 장치를 설명하기 위한 도면이 다. 도 1을 참조하면, 본 개시의 일 실시 예에 따른 전자 장치는 컨텐츠를 디스플레이할 수 있다. 전자 장치 는 TV로 구현될 수 있으나, 이에 한정되는 것은 아니며 비디오 월(video wall), LFD(large format display), Digital Signage(디지털 간판), DID(Digital Information Display), 프로젝터 디스플레이 등과 같이 디스플레이 기능을 갖춘 장치라면 한정되지 않고 적용 가능하다. 또한, 전자 장치는 LCD(liquid crystal display), OLED(organic light-emitting diode), LCoS(Liquid Crystal on Silicon), DLP(Digital Light Processing), QD(quantum dot) 디스플레이 패널, QLED(quantum dot light-emitting diodes) 등과 같은 다양한형태의 디스플레이를 포함할 수 있다. 이에 한정되지 않으며, 전자 장치는 다양한 유형의 출력 장치로 구현될 수 있다. 예를 들어, 전자 장치 는 사용자 단말 장치 또는, 음향 출력 장치(예를 들어, 사운드 바, 홈씨어터 시스템, 룸 스피커, 헤드폰, 이어폰 등)으로 구현될 수 있음은 물론이다. 일 예에 따른 전자 장치는 소스 장치로부터 영상 신호(또는, 컨텐츠)를 수신하며, 수신된 영상 신호 를 출력할 수 있다. 여기서, 영상 신호는, 비디오 신호, 오디오 신호 등을 포함하며, 이하에서는 설명의 편의를 위해 전자 장치가 디스플레이 장치로 구현되며, 소스 장치로부터 수신된 영상 신호에 대응되는 화면 을 디스플레이하는 경우를 상정하여 설명하도록 한다. 일 예에 따른 소스 장치(Source Device)는, 셋톱 박스(Set-top box), 클라우드(cloud) 서버, OTT 서비스 (Over-the-top media service) 서버, 스트리밍(streaming) 서비스(예를 들어, 삼성 Gaming Hub), 홈 오토매이 션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔 (예: XboxTM, PlayStationTM, SwitchTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 등의 전자 장치로 구현 될 수 있다. 다만, 이에 한정되지 않으며 소스 장치는 TV, 사용자 단말 장치, 태블릿 PC, 이동 전화기, 영 상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 가상 현실(virtual reality(VR)) 구현 장치 또는 웨어 러블 장치 중 적어도 하나를 포함할 수 있다. 여기서, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형 (예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나로 구현될 수 도 있음은 물론이다. 일 예에 따라 전자 장치는 복수의 소스 장치 각각으로부터 컨텐츠를 수신하고, 수신된 컨텐츠에 대응 되는 복수의 화면을 디스플레이할 수 있다. 도 1을 참조하면, 전자 장치는 제1 소스 장치로부터 수신 된 컨텐츠에 대응되는 제1 화면을 디스플레이하고, 제2 소스 장치로부터 수신된 컨텐츠에 대응되는 제2 화면을 디스플레이할 수 있다. 예를 들어, 전자 장치는 PBP(Picture by Picture) 모드로, 제1 소스 장 치로부터 수신된 제1 화면 및 제2 소스 장치로부터 수신된 제2 화면을 동시에 디스플레이할 수 있다. 다만, 이에 한정되지 않으며 전자 장치는 PIP(Picture in Picture) 모드로, 제1 소스 장치로 부터 수신된 제1 화면 및 제2 소스 장치로부터 수신된 제2 화면을 동시에 디스플레이할 수 있다. 일 예에 따른 전자 장치는 입력 장치로부터 사용자 입력을 수신할 수 있다. 예를 들어, 입력 장치는 마우스, 키보드, 원격 제어 장치, 게임 패드, 카메라 및 마이크 등으로 구현되어 사용자 입력을 수신할 수 있다. 다만, 이는 일 예시이며 이에 한정되지 않음은 물론이다. 예를 들어, 입력 장치 는 전자 장치 내에 구비되며, 디스플레이 기능 및 입력 기능을 함께 수행 가능한 터치 스크린 등으로 구현될 수도 있다. 도 1을 참조하면, 전자 장치는 입력 장치로부터 제어 신호를 수신할 수 있다. 여기서, 제어 신호는, 다양한 형태의 사용자 입력을 포함할 수 있다. 예를 들어, 입력 장치가 마우스로 구현되면 제어 신호는 마우스의 이동에 따른 좌표 정보, 마우스에 구비된 버튼에 대한 동작 정보(예를 들어, 클릭, 더블 클릭, 드래그(Drag) 등) 등을 포함하며, 입력 장치가 카메라로 구현되면 제어 신호는 촬영 정보(예를 들어, 얼굴 인식 정보, 홍채 인식 정보 등) 등을 포함하며, 입력 장치 가 마이크로 구현되면 제어 신호는 사용자 음성 정보 등을 포함할 수 있다. 다만, 이는 일 예시이며 제어 신호의 형태는 상술한 예시에 한정되지 않음은 물론이다. 도 1에 도시된 바와 같이 복수의 소스 장치 각각은, 전자 장치와 연결될 수 있다. 복수의 소스 장치 각각을 개별적으로 제어하기 위해서는 복수의 소스 장치 각각에 입력 장치가 연결되어야 하나, 복수의 소스 장치의 개수만큼의 입력 장치를 구비하기에 어려움이 있으며(예를 들어, 공간 상의 제 약), 복수의 소스 장치 각각에 입력 장치가 연결되어도 복수의 소스 장치 중 특정 소스 장치(예 를 들어, 제1 소스 장치)를 제어하기 위해서는 복수의 입력 장치 중에서 특정 소스 장치와 연결된 특 정 입력 장치(예를 들어, 제1 소스 장치와 연결된 입력 장치)를 찾아야하는 사용자의 불편함이 가중되는 문제가 있다. 본 개시의 일 예에 따라, 전자 장치는 입력 장치와 통신하며, 입력 장치로부터 수신된 제어 신호 를 복수의 소스 장치 중 어느 하나의 소스 장치로 전송할 수 있다. 따라서, 하나의 입력 장치로 전자장치와 연결된 복수의 소스 장치를 제어할 수 있다. 일 예로, 전자 장치는 사용자 의도에 따라, 복수의 소스 장치 중에서 입력 장치로부터 수신된 제 어 신호를 전송하기 위한 어느 하나의 소스 장치를 식별할 수 있으며, 식별된 어느 하나의 소스 장치로 제어 신 호를 전송할 수 있다. 이에 대한 구체적인 설명은 도 2를 참조하여 하도록 한다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 2에 따르면, 전자 장치는 디스플레이, 통신 인터페이스 및 하나 이상의 프로세서를 포 함할 수 있다. 본 개시의 일 실시 예에 따른 디스플레이는 LCD(liquid crystal display), OLED(organic light-emitting diode), LCoS(Liquid Crystal on Silicon), DLP(Digital Light Processing), QD(quantum dot) 디스플레이 패 널, QLED(quantum dot light-emitting diodes), μLED(Micro light-emitting diodes), Mini LED 등과 같은 다 양한 형태의 디스플레이로 구현될 수 있다. 한편, 디스플레이는 터치 센서와 결합된 터치 스크린, 플렉시 블 디스플레이(flexible display), 롤러블 디스플레이(rollable display), 3차원 디스플레이(3D display), 복 수의 디스플레이 모듈이 물리적으로 연결된 디스플레이 등으로 구현될 수도 있다. 일 예에 따른 통신 인터페이스는 다양한 규격에 따른 유선 또는 무선의 입출력 인터페이스(또는, 입출력 단자)를 포함할 수 있다. 예를 들어, 통신 인터페이스는 HDMI(High Definition Multimedia Interface), MHL(Mobile High-Definition Link), USB(Universal Serial Bus), DP(Display Port), 썬더볼트(Thunderbolt), VGA(Video Graphics Array)포트, RGB 포트, D-SUB(D-subminiature), DVI(Digital Visual Interface) AP 기반 의 Wi-Fi(와이파이, Wireless LAN 네트워크), 블루투스(Bluetooth), 지그비(Zigbee), 유/무선 LAN(Local Area Network), WAN(Wide Area Network), 이더넷(Ethernet), IEEE 1394, AES/EBU(Audio Engineering Society/European Broadcasting Union), 옵티컬(Optical), 코액셜(Coaxial) 등과 같은 다양한 인터페이스를 포 함할 수 있다. 일 예에 따라 통신 인터페이스는 복수의 입출력 인터페이스를 포함하며, 복수의 입출력 인터페이스 중 제1 단자(예를 들어, USB 1 Port)를 통해 제1 소스 장치와 통신하고, 제2 단자(예를 들어, USB 2 Port)를 통 해 제2 소스 장치와 통신할 수 있다. 다만, 이는 일 예시이며, 통신 인터페이스는 복수의 소스 장치 중 일부와 유선 통신하고, 나머지와 무선 통신할 수도 있음은 물론이다. 예를 들어, 통신 인터페이스는 유선의 입출력 인터페이스(예를 들어, USB Port, HDMI Port 등)를 통해 제1 소스 장치와 통신하고, 무선의 입출력 인터페이스(예를 들어, Wi- Fi, 블루투스, 무선 MHL 등)를 통해 제2 소스 장치와 통신할 수도 있다. 일 예에 따른 하나 이상의 프로세서는 통신 인터페이스 통해 복수의 소스 장치 각각으로부터 수 신된 화면을 디스플레이하도록 디스플레이를 제어할 수 있다. 일 예에 따른 하나 이상의 프로세서는 전자 장치의 전반적인 동작을 제어할 수 있다. 본 개시의 일 실시 예에 따라, 하나 이상의 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서 (digital signal processor(DSP), 마이크로 프로세서(microprocessor), TCON(Timing controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서, AI(Artificial Intelligence) 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세서 는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 프로세서는 메모리에 저장된 컴퓨 터 실행가능 명령어(computer executable instructions)를 실행함으로써 다양한 기능을 수행할 수 있다. 특히, 하나 이상의 프로세서는 유무선 통신 인터페이스(미도시)를 통해 입력 장치로부터 제어 신호를 수신하며, 수신된 제어 신호를 복수의 소스 장치 중 어느 하나로 전송할 수 있다. 예를 들어, 하나 이상의 프로세서는 제1 소스 장치에 대응되는 제1 화면 및 제2 소스 장치에 대응되는 제2 화면을 디스플레이하며, 입력 장치로부터 제어 신호를 수신하면, 수신된 제어 신호를 제1 소스 장치 및 제2 소스 장치 중 어느 하나의 소스 장치로 전송할 수 있다.이에 대한 구체적인 설명은 도 3을 참조하여 하도록 한다. 도 3은 본 개시의 일 실시 예에 따른 복수의 소스 장치 중 어느 하나의 소스 장치로 제어 신호를 전송하는 전자 장치를 설명하기 위한 도면이다. 도 3을 참조하면, 하나 이상의 프로세서는 제1 소스 장치로부터 수신된 제1 화면을 디스플레이 상의 제1 영역에 디스플레이하고, 제2 소스 장치로부터 수신된 제2 화면을 디스플레이 상의 제2 영역에 디스플레이할 수 있다. 일 예에 따라 입력 장치는 마우스를 포함하며, 전자 장치는 마우스에 대한 사용자 입력에 따라, 마우 스로부터 제어 신호를 수신할 수 있다. 하나 이상의 프로세서는 마우스로부터 수신된 제어 신호를 제1 소 스 장치 및 제2 소스 장치 중 어느 하나의 소스 장치로 전송할 수 있다. <Case 1> 일 예에 따라 하나 이상의 프로세서는 제1 소스 장치가 제2 소스 장치보다 먼저 전자 장치(10 0)에 연결되었으면(또는, 제1 소스 장치가 제2 소스 장치보다 먼저 전자 장치와 통신을 시작하 였다면), 제1 소스 장치로 제어 신호를 전송할 수 있다. <Case 2> 일 예에 따라 하나 이상의 프로세서는 제1 소스 장치가 제2 소스 장치보다 나중에 전자 장치 에 연결되었으면(또는, 제1 소스 장치가 제2 소스 장치보다 나중에 전자 장치와 통신을 시 작하였다면), 제1 소스 장치로 제어 신호를 전송할 수 있다. <Case 3> 일 예에 따라 하나 이상의 프로세서는 통신 인터페이스에 포함된 복수의 입출력 인터페이스에 대한 우선 순위(또는, 초기 설정)에 따라 입력 장치로부터 수신된 제어 신호를 제1 소스 장치 및 제2 소스 장치 중 어느 하나의 소스 장치로 전송할 수 있다. 예를 들어, 하나 이상의 프로세서는 복수의 입출 력 인터페이스 중 제1 단자(예를 들어, USB 1 Port)를 통해 제1 소스 장치와 통신하고, 제2 단자(예를 들 어, USB 2 Port)를 통해 제2 소스 장치와 통신하면, 우선 순위에 따라 제1 단자를 통해 통신하는 제1 소스 장치로 제어 신호를 전송할 수 있다. <Case 4> 일 예에 따라 하나 이상의 프로세서는 전자 장치의 턴 오프(또는, 대기 모드) 이전에(또는, 직전에) 입력 장치로부터 수신된 제어 신호를 제1 소스 장치로 전송하였다면, 제1 소스 장치로 제어 신호 를 전송할 수 있다. 도 3에 도시된 바와 같이, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 제1 소스 장 치로 전송하며, 입력 장치에 대한 사용자 입력에 따라, 제1 소스 장치에 대응되는 제1 화면 상의 포인터가 제어될 수 있다. 일 예로, 하나 이상의 프로세서는 입력 장치에 대한 사용자 입력에 따 라 입력 장치로부터 제어 신호를 수신하며, 제어 신호를 제1 소스 장치로 전송한 후에 제1 소스 장치 로부터 사용자 입력이 반영된 영 상 신호가 수신되면, 수신된 영상 신호를 디스플레이할 수 있다. 여기서, 사용자 입력이 반영된 영상 신호는, 전자 장치로부터 수신된 제어 신호에 따라 제어된 포인터(또 는, 위치가 변경된 포인터)를 포함하는 영상 신호를 의미할 수 있다. 다만, 이는 일 예시이며, 입력 장치가 카메라로 구현되면, 하나 이상의 프로세서는 카메라로부터 수신된 촬영 정보를 제1 소스 장치로 전송하며, 제1 소스 장치는 촬영 정보에 기초하여 동작(예를 들어, 보 안 해제 등)할 수 있다. 또한, 입력 장치가 마이크로 구현되면, 하나 이상의 프로세서는 마이크로부터 수신된 사용자 음성 정보를 제1 소스 장치로 전송하며, 제1 소스 장치는 사용자 음성 정보에 대응되는 제어 명령을 인식하고, 인 식된 제어 명령에 따라 동작할 수 있다.도 4는 본 개시의 일 실시 예에 따른 제어 신호를 전송하기 위한 소스 장치를 변경하는 전자 장치를 설명하기 위한 도면이다. 본 개시의 일 예에 따른 하나 이상의 프로세서는 입력 장치로부터 기 설정된 신호가 수신되면, 기 설 정된 신호에 기초하여 복수의 소스 장치 중 입력 장치로부터 수신된 제어 신호를 전송하기 위한 어느 하나의 소스 장치를 식별할 수 있다. 예를 들어, 하나 이상의 프로세서는 도 3에 도시된 바와 같이, 입력 장치로부터 수신된 제어 신호를 제1 소스 장치로 전송하는 동안에 기 설정된 신호가 수신되면, 제어 신호를 전송하기 위한 소스 장치를 제 1 소스 장치에서 제2 소스 장치로 순차적으로 변경할 수 있다. 일 예에 따라 하나 이상의 프로세서는 기 설정된 신호가 수신된 후에 입력 장치로부터 수신된 제어 신 호를 제2 소스 장치로 전송하며, 입력 장치에 대한 사용자 입력에 따라, 제2 소스 장치에 대응되 는 제2 화면 상의 포인터가 제어될 수 있다. 일 예에 따라 기 설정된 신호는, 입력 장치에 대한 기 설정된 사용자 입력에 따라 입력 장치가 전자 장 치로 전송하는 신호를 포함할 수 있다. 예를 들어, 기 설정된 사용자 입력은, 입력 장치가 마우스, 키 보드 또는 게임 패드 등으로 구현되면, 입력 장치에 구비된 특정 버튼(예를 들어, 제어 신호를 전송하는 소 스 장치의 변경을 위한 특정 버튼)을 통한 입력, 입력 장치에 대한 특정 사용자 입력(예를 들어, 삼중 클릭, 입력 장치에 구비된 복수의 버튼 중 일부를 조합한 입력 등)을 포함할 수 있다. 다만, 이는 일 예시 이며 이에 한정되지 않음은 물론이다. 예를 들어, 기 설정된 사용자 입력은, 입력 장치가 마이크로 구현되면 특정 음성 입력(예를 들어, 특정 단 어를 발화한 사용자의 음성 입력 등)을 포함하며, 입력 장치가 카메라로 구현되면 특정 모션 입력(예를 들 어, 카메라를 통해 사용자의 특정 모션을 감지 등)을 포함할 수 있다. 상술한 예시에서는 설명의 편의를 위해 전자 장치가 제1 소스 장치에 대응되는 제1 화면 및 제2 소스 장치에 대응되는 제2 화면을 디스플레이하는 경우를 상정하였으나, 이는 일 예시이며 이에 한정되 지 않음은 물론이다. 도 5는 본 개시의 일 실시 예에 따른 제어 신호를 전송하기 위한 소스 장치를 순차적으로 변경하는 전자 장치를 설명하기 위한 도면이다. 도 5를 참조하면, 전자 장치는 디스플레이를 4 분할하여, 제1 소스 장치에 대응되는 제1 화면 , 제2 소스 장치에 대응되는 제2 화면, 제3 소스 장치에 대응되는 제3 화면 및 제4 소스 장 치에 대응되는 제4 화면 각각을 동시에 디스플레이할 수 있다. 다만, 이는 일 예시이며, 전자 장치는 도 1에 도시된 바와 같이 디스플레이를 2 분할할 수도 있고, 3 분할 이상 다 분할하여 복수의 소스 장치 각각에 대응되는 화면을 동시에 디스플레이할 수 있음은 물론이다. 일 예에 따라 하나 이상의 프로세서는 제1 소스 장치 내지 제4 소스 장치 각각의 연결 시점에 기초하여, 기 설정된 신호에 따라 제어 신호를 전송하기 위한 소스 장치를 순차적으로 변경할 수 있다. 예를 들어, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 제1 소스 장치로 전송 하는 동안에 기 설정된 신호가 수신되면, 제어 신호를 전송하기 위한 소스 장치를 제1 소스 장치에서 제2 소스 장치로 순차적으로 변경할 수 있다. 이어서, 하나 이상의 프로세서는 입력 장치로부터 수신 된 제어 신호를 제2 소스 장치로 전송하는 동안에 기 설정된 신호가 수신되면, 제어 신호를 전송하기 위한 소스 장치를 제2 소스 장치에서 제3 소스 장치로 순차적으로 변경할 수 있다. 일 예에 따라 하나 이상의 프로세서는 통신 인터페이스에 포함된 복수의 입출력 인터페이스에 대한 우선 순위(또는, 변경 순위)에 기초하여, 기 설정된 신호가 수신되면 제어 신호를 전송하기 위한 소스 장치를 변경할 수 있다. 예를 들어, 우선 순위가 USB Port 1 -> USB Port 2 -> HDMI Port 1 이면, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 USB Port 1을 통해 연결된 제1 소스 장치로 전송하는 동안에 기 설정된 신호가 수신되면, 입력 장치로부터 수신된 제어 신호를 USB Port 2를 통해 연결된 제2 소스 장치로 전송할 수 있다. 이어서, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 USB Port 2를 통해 연결된 제2 소스 장치로 전송하는 동안에 기 설정된 신호가 수신되면, 입력 장치로부터 수신된 제어 신호를 HDMI Port 1을 통해 연결된 제3 소스 장치로 전송할 수 있다. 다만, 상술한 우선 순위는 설명의 편의를 위한 예 시이며, 이에 한정되지 않음은 물론이다. 일 예에 따라 우선 순위는 전자 장치의 제원(Specification)(예 를 들어, 전자 장치에 구비된 복수의 입출력 인터페이스), 사용자 또는 제조사의 설정 등에 따라 변경될 수 있음은 물론이다. 도 6은 본 개시의 일 실시 예에 따른 복수의 소스 장치 각각에 대응되는 기 설정된 신호를 설명하기 위한 도면 이다. 도 6을 참조하면, 일 예에 따른 전자 장치는 메모리를 포함할 수 있다. 메모리는 저장 용도에 따라 전자 장치에 임베디드된 메모리 형태로 구현되거나, 전자 장치에 탈부착이 가능한 메모리 형태로 구현될 수도 있다. 예를 들어, 전자 장치의 구동을 위한 데이터는 전자 장치에 임베디드된 메모리에 저장되고, 전자 장 치의 확장 기능을 위한 데이터는 전자 장치에 탈부착이 가능한 메모리에 저장될 수 있다. 한편, 전자 장치에 임베디드된 메모리의 경우 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나로 구현될 수 있다. 또 한, 전자 장치에 탈부착이 가능한 메모리의 경우 메모리 카드(예를 들어, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 등), USB 포트에 연결가능한 외부 메모리(예를 들어, USB 메모리) 등과 같은 형태로 구 현될 수 있다. 일 예에 따라 메모리는 전자 장치를 제어하기 위한 적어도 하나의 인스트럭션(instruction) 또는 인스트럭 션들을 포함하는 컴퓨터 프로그램을 저장할 수 있다. 특히, 메모리는 복수의 소스 장치 각각에 대응되는 기 설정된 신호 관련 정보를 저장할 수 있다. 예를 들어, 하나 이상의 프로세서는 입력 장치로부터 기 설정된 신호가 수신되면, 메모리에 저장된 기 설정된 신호 관련 정보에 기초하여 기 설정된 신호에 대응되는 복수의 소스 장치 중 어느 하나의 소스 장 치를 식별할 수 있다. 예를 들어, 기 설정된 신호 관련 정보는, 복수의 입출력 인터페이스와 복수의 신호 간의 대응 정보를 포함할 수 있다. 예를 들어, 기 설정된 신호 관련 정보는 복수의 신호 중 제1 신호에 대응되는 제1 입출력 인터페이스, 제2 신호 에 대응되는 제2 입출력 인터페이스, 제3 신호에 대응되는 제3 입출력 인터페이스 등을 포함할 수 있다. 일 예에 따라 제1 신호는, 입력 장치에 구비된 제1 특정 버튼 또는 입력 장치에 구비된 복수의 버튼 중 일부로 구성된 제1 조합 등에 대한 사용자 입력에 따라 입력 장치로부터 전자 장치로 전송될 수 있다. 일 예에 따라 하나 이상의 프로세서는 입력 장치로부터 제1 신호가 수신되면, 기 설정된 신호 관련 정 보에 기초하여 복수의 입출력 인터페이스 중에서 제1 신호에 대응되는 제1 입출력 인터페이스(예를 들어, USB Port 1)를 식별할 수 있다. 이어서, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 제1 입출력 인터페이스를 통해 연결된 제1 소스 장치로 전송할 수 있다. 일 예에 따라 제2 신호는, 입력 장치에 구비된 제2 특정 버튼 또는 입력 장치에 구비된 복수의 버튼 중 일부로 구성된 제2 조합 등에 대한 사용자 입력에 따라 입력 장치로부터 전자 장치로 전송될 수 있다.일 예에 따라 하나 이상의 프로세서는 입력 장치로부터 제2 신호가 수신되면, 기 설정된 신호 관련 정 보에 기초하여 복수의 입출력 인터페이스 중에서 제2 신호에 대응되는 제2 입출력 인터페이스(예를 들어, Wi- Fi)를 식별할 수 있다. 이어서, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 제2 입 출력 인터페이스를 통해 연결된 제2 소스 장치로 전송할 수 있다. 도 4를 참조하면, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 제1 소스 장치로 전송하는 동안에 제4 신호가 수신되면, 기 설정된 신호 관련 정보에 기초하여 복수의 입출력 인터페이스 중에서 제4 신호에 대응되는 제4 입출력 인터페이스를 식별할 수 있다. 이어서, 하나 이상의 프로세서는 입력 장 치로부터 수신된 제어 신호를 제4 입출력 인터페이스를 통해 연결된 제4 소스 장치로 전송할 수 있다. 일 예에 따라 하나 이상의 프로세서는 제4 신호가 수신된 후에 입력 장치로부터 수신된 제어 신호를 제4 소스 장치로 전송하므로, 입력 장치에 대한 사용자 입력에 따라, 제4 소스 장치에 대응되는 제4 화면이 변경될 수 있다(예를 들어, 제4 화면 상의 포인터가 제어될 수 있다). 도 7은 본 개시의 일 실시 예에 따른 복수의 입력 장치를 설명하기 위한 도면이다. 도 7을 참조하면, 전자 장치는 복수의 입력 장치 각각으로부터 기 설정된 신호, 또는 제어 신호를 수 신할 수 있다. 예를 들어, 하나 이상의 프로세서는 복수의 입력 장치 중 어느 하나의 입력 장치로부터 기 설정된 신 호가 수신되면, 기 설정된 신호에 기초하여 복수의 입력 장치 각각으로부터 수신되는 제어 신호를 전송하기 위한 소스 장치를 식별할 수 있다. 예를 들어, 하나 이상의 프로세서는 복수의 입력 장치 중 제1 입력 장치로부터 기 설정된 신호가 수신되면, 복수의 입력 장치 각각으로부터 수신되는 제어 신호를 전송하기 위한 소스 장치를 순차적으로 변 경(예를 들어, 제1 소스 장치에서 제2 소스 장치로 변경)할 수 있다. 이어서, 하나 이상의 프로세서 는 복수의 입력 장치 각각으로부터 수신되는 제어 신호를 변경된 소스 장치로 전송할 수 있다. 예를 들어, 하나 이상의 프로세서는 복수의 입력 장치 중 제1 입력 장치로부터 제1 신호가 수신되 면, 기 설정된 신호 관련 정보에 기초하여 복수의 소스 장치 중 제1 신호에 대응되는 제1 소스 장치 를 식별할 수 있다. 이어서, 하나 이상의 프로세서는 복수의 입력 장치 각각으로부터 수신된 제어 신 호를 제1 소스 장치로 전송할 수 있다. 예를 들어, 하나 이상의 프로세서는 제1 입력 장치로부터 수신된 제1 제어 신호, 제2 입력 장치로 부터 수신된 제2 제어 신호, 및 제3 입력 장치로부터 수신된 제3 제어 신호를 제1 소스 장치로 전송할 수 있다. 일 예에 따라, 하나 이상의 프로세서는 복수의 입력 장치 각각으로부터 수신된 제어 신호를 하나의 소 스 장치(예를 들어, 제1 소스 장치)로 전송할 수 있으나, 이는 일 예시이며 이에 한정되지 않는다. 일 예에 따라, 하나 이상의 프로세서는 복수의 입력 장치 각각으로부터 수신된 제어 신호를 서로 다른 소스 장치로 전송할 수도 있다. 일 예에 따라, 하나 이상의 프로세서는 복수의 입력 장치 중 제1 입력 장치로부터 제1 신호가 수 신되면, 기 설정된 신호 관련 정보에 기초하여 제1 신호에 대응되는 제1 소스 장치를 식별할 수 있다. 이 어서, 하나 이상의 프로세서는 제1 입력 장치로부터 수신된 제어 신호를 제1 소스 장치로 전송할 수 있다. 또한, 하나 이상의 프로세서는 복수의 입력 장치 중 제2 입력 장치로부터 제4 신호가 수 신되면, 기 설정된 신호 관련 정보에 기초하여 제4 신호에 대응되는 제4 소스 장치를 식별할 수 있다. 이 어서, 하나 이상의 프로세서는 제2 입력 장치로부터 수신된 제어 신호를 제4 소스 장치로 전송할 수 있다. 일 예에 따라, 제1 입력 장치로부터 수신된 제1 제어 신호는 제1 소스 장치로 전송하고, 제2 입력 장 치로부터 수신된 제2 제어 신호는 제4 소스 장치로 전송할 수 있다.도 8은 본 개시의 일 실시 예에 따른 제어 신호를 전송하기 위한 소스 장치로부터 수신된 화면을 디스플레이하 는 전자 장치를 설명하기 위한 도면이다. 일 예에 따라 하나 이상의 프로세서 PBP(Picture by Picture) 모드로, 제1 소스 장치로부터 수신된 제1 화면을 제1 영역에 디스플레이하고, 제2 소스 장치로부터 수신된 제2 화면을 제2 영역에 디스플 레이할 수 있다. 예를 들어, 하나 이상의 프로세서는 디스플레이를 제1 영역 및 제2 영역으로 2 분할할 수 있다. 여기 서, 제1 영역과 제2 영역은 균등(5:5)할 수도 있고, 어느 하나의 영역(예를 들어, 제1 영역)이 나머지 하나의 영역(예를 들어, 제2 영역)보다 상대적으로 클 수도 있다. 일 예로, 하나 이상의 프로세서는 디스플레이를 메인 디스플레이 영역과 서브 디스플레이 영역으로 구분할 수 있다. 여기서, 메인 디스플레이 영역은, 서브 디스플레이 영역 보다 상대적으로 클 수 있다. 일 예에 따라 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 제1 소스 장치로 전 송하면, 제1 소스 장치에 대응되는 제1 화면을 메인 디스플레이 영역에 디스플레이하고, 제2 소스 장치 에 대응되는 제2 화면을 서브 디스플레이 영역에 디스플레이할 수 있다. 일 예에 따라, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 제1 소스 장치로 전 송하는 동안에 기 설정된 신호(또는, 제2 소스 장치에 대응되는 제2 신호)가 수신되면, 제어 신호를 전송 하기 위한 소스 장치를 제1 소스 장치에서 제2 소스 장치로 변경할 수 있다. 이어서, 하나 이상의 프 로세서는 제1 소스 장치에 대응되는 제1 화면을 서브 디스플레이 영역에 디스플레이하고, 제2 소 스 장치에 대응되는 제2 화면을 메인 디스플레이 영역에 디스플레이할 수 있다. 다만, 이는 일 예시이며 이에 한정되지 않는다. 예를 들어, 도 8의 하단에 도시된 바와 같이, 하나 이상의 프로 세서는 입력 장치로부터 수신된 제어 신호를 전송하기 위한 소스 장치가 제1 소스 장치에서 제2 소스 장치로 변경되면, 제1 소스 장치에 대응되는 제1 화면이 디스플레이되는 제1 영역의 크기를 제2 소스 장치에 대응되는 제2 화면이 디스플레이되는 제2 화면의 크기보다 상대적으로 작게 변경할 수 있다. 도 9는 본 개시의 일 실시 예에 따른 PIP(Picture In Picture) 모드를 설명하기 위한 도면이다. 일 예에 따라 하나 이상의 프로세서 PIP(Picture by Picture) 모드로, 제1 소스 장치로부터 수신된 제1 화면을 전체 화면으로 디스플레이하고, 제2 소스 장치로부터 수신된 제2 화면을 팝업 화면으로 디스플레이할 수 있다. 여기서, 전체 화면은 메인 디스플레이 영역, 팝업 화면은 서브 디스플레이 영역으로 불 릴 수도 있다. 예를 들어, 하나 이상의 프로세서는 입력 장치로부터 기 설정된 신호가 수신되면, 기 설정된 신호에 기초하여 입력 장치로부터 수신되는 제어 신호를 전송하기 위한 어느 하나의 소스 장치를 식별할 수 있다. 예를 들어, 하나 이상의 프로세서는 기 설정된 신호에 기초하여 제1 소스 장치로 제어 신호를 전송할 수도 있고, 제2 소스 장치로 제어 신호를 전송할 수도 있다. 일 예에 따라, 하나 이상의 프로세서는 입력 장치로부터 수신된 제어 신호를 제1 소스 장치로 전 송하는 동안에 기 설정된 신호(또는, 제2 소스 장치에 대응되는 제2 신호)가 수신되면, 제어 신호를 전송 하기 위한 소스 장치를 제1 소스 장치에서 제2 소스 장치로 변경할 수 있다. 이어서, 하나 이상의 프 로세서는 제1 소스 장치에 대응되는 제1 화면을 팝업 화면에 디스플레이하고, 제2 소스 장치(22 0)에 대응되는 제2 화면을 전체 화면에 디스플레이할 수 있다. 일 예에 따라 하나 이상의 프로세서는 기 설정된 신호가 수신된 후에 입력 장치로부터 수신된 제어 신 호를 제2 소스 장치로 전송하며, 입력 장치에 대한 사용자 입력에 따라, 제2 소스 장치에 대응되 는 제2 화면이 디스플레이되는 전체 화면 상의 포인터가 제어될 수 있다. 도 10은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 상세 블록도이다. 도 10에 대한 설명에서 도 2와 중복된 설명은 생략하도록 한다. 도 10을 참조하면, 전자 장치는 메모리, 유무선 통신 인터페이스 및 스위치 모듈을 더 포 함할 수 있다. 일 예에 따라 메모리는 복수의 소스 장치 각각에 대응되는 기 설정된 신호 관련 정보를 저장할 수 있 다. 일 예에 따라 유무선 통신 인터페이스는 다양한 규격에 따른 유선 또는 무선의 입출력 인터페이스(또는, 입출력 단자)를 포함할 수 있다. 예를 들어, 유무선 통신 인터페이스는 HDMI(High Definition Multimedia Interface), MHL(Mobile High-Definition Link), USB(Universal Serial Bus), DP(Display Port), 썬더볼트 (Thunderbolt), VGA(Video Graphics Array)포트, RGB 포트, D-SUB(D-subminiature), DVI(Digital Visual Interface) AP 기반의 Wi-Fi(와이파이, Wireless LAN 네트워크), 블루투스(Bluetooth), 지그비(Zigbee), 유/무 선 LAN(Local Area Network), WAN(Wide Area Network), 이더넷(Ethernet), IEEE 1394, AES/EBU(Audio Engineering Society/European Broadcasting Union), 옵티컬(Optical), 코액셜(Coaxial) 등과 같은 다양한 인 터페이스를 포함할 수 있다. 일 예에 따라 입력 장치는 유무선 통신 인터페이스를 통해 전자 장치와 페어링될 수 있다. 하나 이상의 프로세서는 페어링된 입력 장치로부터 기 설정된 신호가 수신되면, 기 설정된 신호에 대 응되는 어느 하나의 소스 장치를 식별할 수 있다. 예를 들어, 하나 이상의 프로세서는 입력 장치와 무선 통신(예를 들어, Bluetooth pairing)하여 기 설 정된 신호를 수신할 수 있고, 입력 장치와 유선 통신(예를 들어, USB Port)하여 제어 신호를 수신할 수 있 다. 다만, 이는 일 예시이며, 하나 이상의 프로세서는 무선 통신 또는 유선 통신 중 어느 하나를 통해 기 설정된 신호와 제어 신호를 수신할 수도 있음은 물론이다. 일 예에 따라 스위칭 모듈은, 하나 이상의 프로세서의 제어에 따라, 통신 인터페이스에 포함된 복수의 입출력 인터페이스 중 어느 하나로 제어 신호를 전송할 수 있다. 예를 들어, 하나 이상의 프로세서는 기 설정된 신호에 대응되는 제1 소스 장치가 식별되면, 입력 장 치로부터 수신된 제어 신호를 제1 통신 인터페이스(120-1)를 통해 제1 소스 장치로 전송하도록 스위치 모듈을 제어할 수 있다. 또한, 하나 이상의 프로세서는 기 설정된 신호에 대응되는 제2 소스 장치 가 식별되면, 입력 장치로부터 수신된 제어 신호를 제2 통신 인터페이스(120-2)를 통해 제2 소스 장치 로 전송하도록 스위치 모듈을 제어할 수 있다. 일 예에 따라 스위치 모듈은, KVM 스위치, KM 스위치로 불릴 수도 있다. KVM 스위치는, Keyboard, Video and Mouse Switch 이다. 일 예에 따라 스위치 모듈은 통신 인터페이스의 일 구성 요소일 수도 있고, 통신 인터페이스와 독립적인 구성 요소일 수도 있다. 일 예에 따라 하나 이상의 프로세서는 스위치 모듈을 제어하여, 복수의 소스 장치 각각에 대응 되는 출력 장치(예를 들어, 모니터(Monitor)), 입력 장치(예를 들어, 키보드, 마우스 등)를 구비하지 않아 도, 복수의 소스 장치 각각이 제공하는 컨텐츠를 출력할 수 있고, 복수의 소스 장치 각각에 사용자 입력을 전송할 수 있다. 예를 들어, 하나 이상의 프로세서는 기 설정된 신호에 따라 스위치 모듈을 제어하여, 복수의 소스 장 치 중 적어도 하나의 소스 장치가 제공하는 컨텐츠를 디스플레이를 통해 디스플레이할 수 있고, 복수 의 소스 장치 중 적어도 하나의 소스 장치로 입력 장치에 대한 사용자 입력(또는, 제어 신호)을 전송 할 수 있다. 따라서, 하나 이상의 프로세서는 기 설정된 신호에 따라 스위치 모듈을 제어하여, 디스플레이를 통해 디스플레이하기 위한 컨텐츠를 제공하는 소스 장치를 간편히 전환할 수 있고, 입력 장치를 통해 제어 하기 위한 소스 장치를 간편히 전환할 수 있다. 본 개시의 일 예에 따른 하나 이상의 프로세서는, 기 설정된 신호에 따라 입력 장치로부터 수신된 제 어 신호를 전송하기 위한 소스 장치가 제1 소스 장치에서 제2 소스 장치로 변경되면, 제2 화면 내 의 초기 위치에 포인터를 위치시킨 후에 입력 장치로부터 수신된 제어 신호에 기초하여 포인터의 위치를 이동시킬 수 있다. 일 예에 따라 사용자 입력에 따라 이동하는 포인터는, 제2 소스 장치로부터 수신된 제2 영상 신호에 대응 되는 화면(예를 들어, 제2 화면) 내의 초기 위치에 위치한 후에 제어 신호에 따라 이동할 수 있다. 여기서, 초기 위치는 제2 화면 내의 중앙을 포함할 수 있다. 입력 장치로부터 수신된 제어 신호는, 포인 터를 이동시키기 위한 좌표 정보를 포함할 수 있다. 본 개시의 일 예에 따른 하나 이상의 프로세서는 기 설정된 신호에 따라 입력 장치로부터 수신된 제어 신호를 전송하기 위한 소스 장치가 제1 소스 장치에서 제2 소스 장치로 변경되면, 제1 화면 내의 제1 포인터의 현 위치를 메모리에 저장하고, 제2 화면 내의 제2 포인터의 이전 위치를 메모리로부 터 로드(load)할 수 있다. 여기서, 이전 위치는 제어 신호를 전송하기 위한 소스 장치가 제2 소스 장치에서 다른 소스 장치(예를 들어, 제 1 소스 장치)로 변경되는 시점에 메모리에 저장된 제2 화면 내의 제2 포인터의 현 위치를 나타낼 수 있 다. 일 예에 따른 하나 이상의 프로세서는 로드된(loaded) 이전 위치에 제2 포인터를 위치시킨 후에 입력 장치 로부터 수신된 제어 신호에 기초하여 제2 포인터의 위치를 이동시킬 수 있다. 일 예에 따라 사용자 입력에 따라 이동하는 제2 포인터는 제2 영상 신호에 대응되는 화면 내의 이전 위치에 위 치한 후에 제어 신호에 따라 이동할 수 있다. 도 11은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법은, 우선, 복수의 소스 장치 각각으로부터 수신된 영상 신 호를 디스플레이한다(S1110). 이어서, 입력 장치로부터 수신된 기 설정된 신호에 따라, 복수의 소스 장치 중 제1 소스 장치로 전송되는 입력 장치로부터 수신된 제어 신호를 제2 소스 장치로 전송한다(S1120). 이어서, 입력 장치에 대한 사용자 입력에 따라 입력 장치로부터 수신된 제어 신호를 제2 소스 장치로 전송하여 제2 소스 장치로부터 사용자 입력이 반영된 영상 신호가 수신되면, 수신된 영상 신호를 디스플레이한다(S1130). 일 예에 따라 전송하는 S1120 단계는, 제어 신호를 제1 소스 장치로 전송하는 동안에 기 설정된 신호가 수신되 면, 제어 신호를 전송하기 위한 소스 장치를 제1 소스 장치에서 제2 소스 장치로 변경하여 제어 신호를 제2 소 스 장치로 전송하는 단계 및 제어 신호를 제2 소스 장치로 전송하는 동안에 기 설정된 신호가 수신되면, 제어 신호를 전송하기 위한 소스 장치를 제2 소스 장치에서 제3 소스 장치로 변경하여 제어 신호를 제3 소스 장치로 전송하는 단계를 포함할 수 있다. 일 예에 따라 전송하는 S1120 단계는, 입력 장치로부터 기 설정된 제1 신호가 수신되면, 복수의 소스 장치 각각 에 대응되는 기 설정된 신호 관련 정보에 기초하여 기 설정된 제1 신호에 대응되는 제1 소스 장치를 식별하고, 제1 소스 장치로 제어 신호를 전송하는 단계 및 입력 장치로부터 기 설정된 제2 신호가 수신되면, 정보에 기초 하여 기 설정된 제2 신호에 대응되는 제2 소스 장치를 식별하고, 제2 소스 장치로 제어 신호를 전송하는 단계를 포함할 수 있다. 일 예에 따라 전송하는 S1120 단계는, 전자 장치와 페어링된 입력 장치로부터 기 설정된 신호가 수신되면, 제어 신호를 전송하기 위한 소스 장치가 제1 소스 장치에서 제2 소스 장치로 전환되도록 스위치 모듈을 제어하는 단 계를 포함하며, 스위치 모듈을 제어하는 단계는, 전자 장치에 구비된 복수의 포트 중 제2 소스 장치에 대응되는 포트로 제어 신호를 전송하는 단계를 포함할 수 있다. 일 예에 따라 전송하는 S1120 단계는, 복수의 입력 장치 중 적어도 하나의 입력 장치로부터 기 설정된 신호가 수신되면, 기 설정된 신호에 기초하여 복수의 입력 장치 각각으로부터 수신되는 제어 신호를 전송하기 위한 소 스 장치를 제1 소스 장치에서 제2 소스 장치로 전환하는 단계 및 복수의 입력 장치 각각으로부터 수신되는 제어 신호를 제2 소스 장치로 전송하는 단계를 포함할 수 있다. 일 예에 따라 전송하는 S1120 단계는, 제1 소스 장치로 제어 신호를 전송하는 동안에 복수의 입력 장치 중 제1 입력 장치로부터 기 설정된 신호가 수신되면, 제어 신호를 전송하기 위한 소스 장치를 제1 소스 장치에서 제2 소스 장치로 순차적으로 변경하는 단계를 포함할 수 있다. 일 예에 따라 디스플레이하는 S1130 단계는, 제어 신호를 제1 소스 장치로 전송하면, 제1 소스 장치로부터 수신 된 영상 신호를 메인 디스플레이 영역에 디스플레이하는 단계 및 복수의 소스 장치 중 나머지 소스 장치로부터 수신된 영상 신호를 서브 디스플레이 영역에 디스플레이하는 단계를 포함할 수 있다. 일 예에 따라 복수의 소스 장치 각각으로부터 수신된 화면을 디스플레이하는 S1110 단계는, PBP(Picture By Picture) 모드 또는 PIP(Picture In Picture) 모드에 따라 메인 디스플레이 영역 및 서브 디스플레이 영역을 구 분하는 단계를 더 포함할 수 있다. 일 예에 따라 입력 장치는, 마우스를 포함하며, 복수의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이 하는 S1110 단계는, 제1 소스 장치로부터 수신된 제1 영상 신호 및 제2 소스 장치로부터 수신된 제2 영상 신호 각각을 디스플레이하는 단계를 포함하며, 기 설정된 신호에 따라, 마우스로부터 수신된 제어 신호를 전송하기 위한 소스 장치가 제1 소스 장치에서 제2 소스 장치로 변경되면, 사용자 입력에 따라 이동하는 포인터는, 제2 영상 신호에 대응되는 화면 내의 초기 위치에 위치한 후에 제어 신호에 따라 이동하며, 제어 신호는, 포인터를 이동시키기 위한 좌표 정보를 포함할 수 있다. 일 예에 따라 입력 장치는, 마우스를 포함하며, 복수의 소스 장치 각각으로부터 수신된 영상 신호를 디스플레이 하는 S1110 단계는, 제1 소스 장치로부터 수신된 제1 영상 신호 및 제2 소스 장치로부터 수신된 제2 영상 신호 각각을 디스플레이하는 단계를 포함하며, 수신된 영상 신호를 디스플레이하는 S1130 단계는, 기 설정된 신호에 따라 마우스로부터 수신된 제어 신호를 전송하기 위한 소스 장치가 제1 소스 장치에서 제2 소스 장치로 변경되 면, 제1 영상 신호에 대응되는 화면 내의 제1 포인터의 현 위치를 저장하고, 제2 영상 신호에 대응되는 화면 내 의 제2 포인터의 이전 위치를 로드(load)하는 단계를 포함하며, 사용자 입력에 따라 이동하는 제2 포인터는, 제 2 영상 신호에 대응되는 화면 내의 이전 위치에 위치한 후에 제어 신호에 따라 이동하며, 제어 신호는, 포인터 를 이동시키기 위한 좌표 정보를 포함할 수 있다. 다만, 본 개시의 다양한 실시 예들은 전자 장치 뿐 아니라, 컨텐츠를 출력 가능한 다양한 유형의 전자 장치에 적용될 수 있음은 물론이다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합을 이 용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 일부 경우 에 있어 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 소프트 웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 전자 장치의 프로세싱 동작을 수행하기 위한 컴퓨터 명 령어(computer instructions)는 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium) 에 저장될 수 있다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어는 특정 기기의 프로세서에 의해 실행되었을 때 상술한 다양한 실시 예에 따른 전자 장치에서의 처리 동작을 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체 가 아니라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등 이 있을 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0095216", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2023-0095216", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 입력 장치로부터 제어 신호를 수신하는 전자 장치를 설명하기 위한 도면이 다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 블록도이다. 도 3은 본 개시의 일 실시 예에 따른 복수의 소스 장치 중 어느 하나의 소스 장치로 제어 신호를 전송하는 전자 장치를 설명하기 위한 도면이다. 도 4는 본 개시의 일 실시 예에 따른 제어 신호를 전송하기 위한 소스 장치를 변경하는 전자 장치를 설명하기 위한 도면이다. 도 5는 본 개시의 일 실시 예에 따른 제어 신호를 전송하기 위한 소스 장치를 순차적으로 변경하는 전자 장치를 설명하기 위한 도면이다. 도 6은 본 개시의 일 실시 예에 따른 복수의 소스 장치 각각에 대응되는 기 설정된 신호를 설명하기 위한 도면 이다.도 7은 본 개시의 일 실시 예에 따른 복수의 입력 장치를 설명하기 위한 도면이다. 도 8은 본 개시의 일 실시 예에 따른 제어 신호를 전송하기 위한 소스 장치로부터 수신된 화면을 디스플레이하 는 전자 장치를 설명하기 위한 도면이다. 도 9는 본 개시의 일 실시 예에 따른 PIP(Picture In Picture) 모드를 설명하기 위한 도면이다. 도 10은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 설명하기 위한 상세 블록도이다. 도 11은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
