{"patent_id": "10-2021-0092245", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0095818", "출원번호": "10-2021-0092245", "발명의 명칭": "얼굴이미지의 분류방법, 분류장치, 전자기기 및 저장매체", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "짜오, 이쳉"}}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "처리를 위한 얼굴이미지를 획득하는 단계;상기 얼굴이미지에 근거하여 상기 얼굴이미지 중 처리를 위한 얼굴특징을 추출하는 단계;얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 상기 처리를 위한 얼굴특징, 상기 얼굴특징 데이터베이스 중 기존의 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합하여 상기 처리를 위한 얼굴특징에 대응하는 유형을 결정하는 단계; 및상기 처리를 위한 얼굴특징에 대응하는 유형에 근거하여 상기 얼굴이미지의 유형을 결정하는 단계; 를포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족할 경우, 상기 처리를 위한 얼굴특징을 상기 얼굴특징 데이터베이스 중에 업데이트하는 단계;상기 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하여 군집 결과를 획득하는 단계; 및상기 군집 결과에 근거하여 상기 처리를 위한 얼굴특징에 대응하는 얼굴이미지의 유형을 결정하는 단계; 를 포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 트리거 조건은 글로벌 군집 시점에 도달하는 것을 포함하고,상기 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하여 군집 결과를 획득하는 단계는, 상기 글로벌 군집 시점에 도달할 경우 상기 얼굴특징 데이터베이스 중 모든 기존 얼굴특징을 군집화하여 상기군집 결과를 획득하는 단계를 포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 얼굴특징 데이터베이스 중 모든 기존 얼굴특징을 군집화하여 군집 결과를 획득하는 단계는, 상기 얼굴특징 데이터베이스 중 임의의 2개의 기존 얼굴특징사이의 유사도를 획득하는 단계; 상기 얼굴특징 데이터베이스 중 각 기존 얼굴특징과 대응하는 유사도가 가장 큰 기존 얼굴특징을 군집화하여 복수의 군집 조합을 획득하는 단계;상기 얼굴특징 데이터베이스 중 임의의 2개의 기존 얼굴특징사이의 유사도에 근거하여 임의의 2개의 군집 조합사이의 거리를 결정하는 단계;각 군집 조합과 대응하는 최근접 거리 및 최근접 거리가 미리 설정된 거리 역치이하인 군집 조합을 군집화하여복수의 군집후 조합을 얻고, 상기 복수의 군집후 조합 중 임의의 2개의 군집후 조합사이의 거리가 상기 미리 설공개특허 10-2021-0095818-3-정된 거리 역치보다 클 때까지 군집과정을 반복하는 단계;각 군집후 조합 중 기존 얼굴특징에 근거하여 상기 복수의 군집후 조합 중 군집후 조합에 대응하는 유형을 결정하는 단계; 및상기 복수의 군집후 조합 및 각 군집후 조합에 대응하는 유형을 상기 군집 결과로 결정하는 단계; 를 포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서, 상기 처리를 위한 얼굴특징을 상기 얼굴특징 데이터베이스 중에 업데이트하는 단계는, 상기 처리를 위한 얼굴특징에 대해 비군집 표기를 하고 표기처리 후의 처리를 위한 얼굴특징을 얼굴특징 데이터베이스 중에 업데이트하는 단계를 포함하고;상기 트리거 조건은 로컬 클러스터 서브 컨디션을 포함하고, 상기 로컬 클러스터 서브 컨디션은, 상기 얼굴특징 데이터베이스 중 표기를 구비하는 제1기존 얼굴특징의 획득 시점 차이값이 미리 설정된 시간길이보다 큰것; 및 상기 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징의 수가 제1수역치이상인 것;중 적어도 하나를 포함하고,상기 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하여 군집 결과를 획득하는 단계는, 상기 얼굴특징 데이터베이스가 로컬 클러스터 서브 컨디션을 만족하고 상기 글로벌 군집 시점에 도달하지 않을경우, 상기 얼굴특징 데이터베이스 중 표기를 구비하지 않는 제2 기존 얼굴특징을 샘플링하고, 샘플링하여 얻은제2기존 얼굴특징 및 상기 얼굴특징 데이터베이스 중 표기를 구비하는 제1기존 얼굴특징을 군집화하여 군집 결과를 획득하는 단계를 포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 샘플링하여 얻은 제2 기존 얼굴특징 및 상기 기존 얼굴특징 데이터베이스 중 표기를 구비하지 않는 제1 기존 얼굴특징을 군집화하여 상기 군집 결과를 획득하는 단계 후에, 상기 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징에 대해 표기 제거 처리를 수행하는 단계를포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 처리를 위한 얼굴특징, 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합하여 상기 처리를 위한 얼굴특징에 대응하는 유형을 결정하는 단계는, 상기 얼굴특징 데이터베이스 중 기존 얼굴특징의 총수를 획득하는 단계;상기 총수가 제2수역치이하인 경우, 상기 처리를 위한 얼굴특징과 상기 얼굴특징 데이터베이스 중 각 얼굴특징사이의 유사도를 획득하고, 유사도에 따라 상기 각 기존 얼굴특징에 대해 순서 배열하는 단계; 및앞에 배열된 제3예정수의 기존 얼굴특징에 대응하는 유형에 근거하여 상기 처리를 위한 얼굴특징에 대응하는 유형을 결정하는 단계; 를 포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법.공개특허 10-2021-0095818-4-청구항 8 제7항에 있어서,상기 총수가 제2수역치보다 클 경우, 상기 얼굴특징 데이터베이스를 샘플링하고 샘플링하여 얻은 기존 얼굴특징을 획득하거나, 상기 얼굴특징 데이터베이스에 대응하는 유사도 검색 인덱스를 샘플링하고 샘플링하여 얻은 검색 인덱스 중 기존 얼굴특징을 샘플링하여 얻은 기존 얼굴특징으로 결정하는 단계;상기 처리를 위한 얼굴특징과 샘플링하여 얻은 기존 얼굴특징사이의 유사도를 획득하고 유사도에 따라 상기 샘플링하여 얻은 기존 얼굴특징에 대해 순서 배열하는 단계; 및앞에 배열된 제4예정의 기존 얼굴특징에 대응하는 유형을 상기 얼굴특징에 대응하는 유형으로 결정하는 단계;를 포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항에 있어서,상기 복수의 조합 및 각 조합에 대응하는 유형을 상기 군집 결과로 결정하는 단계 후에, 상기 처리를 위한 얼굴특징 및 대응하는 유형을 상기 얼굴특징 데이터베이스 중에 업데이트하는 단계를 포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서, 상기 얼굴특징 데이터베이스 중의 기존 얼굴특징을 군집화하여 군집 결과를 획득하는 단계 후에, 상기 군집 결과에 근거하여 상기 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형을 업데이트하는 단계를 포함하는, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서, 상기 처리를 위한 얼굴특징 및 상기 얼굴특징 데이터베이스 중 상기 기존 얼굴특징은, 양자화 압축 또는 디멘션압축 후의 얼굴특징인, 것을 특징으로 하는 얼굴이미지의 분류방법."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "처리를 위한 얼굴이미지를 획득하는 획득모듈;상기 얼굴이미지에 근거하여 상기 얼굴이미지 중 처리를 위한 얼굴특징을 추출하는 추출모듈;얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 상기 처리를 위한 얼굴특징, 상기 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합하여 상기 처리를위한 얼굴특징에 대응하는 유형을 결정하는 처리모듈; 및상기 처리를 위한 얼굴특징에 대응하는 유형에 근거하여 상기 얼굴이미지의 유형을 결정하는 제1결정모듈; 을포함하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2021-0095818-5-제12항에 있어서, 상기 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족할 경우, 상기 처리를 위한 얼굴특징을 상기 얼굴특징 데이터베이스 중에 업데이트하는 업데이트모듈;상기 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하여 군집 결과를 획득하는 군집모듈; 및상기 군집 결과에 근거하여 상기 처리를 위한 얼굴특징에 대응하는 얼굴이미지의 유형을 결정하는 제2결정모듈;을 포함하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 트리거 조건은 글로벌 군집 시점에 도달하는 것을 포함하고, 상기 군집모듈은, 상기 글로벌 군집 시점에 도달할 경우 상기 얼굴특징 데이터베이스 중 모든 기존 얼굴특징을 군집화하여 상기군집 결과를 획득하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 군집모듈은, 상기 얼굴특징 데이터베이스 중 임의의 2개 기존 얼굴특징사이의 유사도를 획득하고;상기 얼굴특징 데이터베이스 중 각 기존 얼굴특징과 대응하는 유사도가 가장 높은 기존 얼굴특징을 군집화하여복수의 군집 조합을 획득하며;상기 얼굴특징 데이터베이스 중 임의의 2개의 기존 얼굴특징사이의 유사도에 근거하여 임의의 2개 군집 조합사이의 거리를 결정하고;각 군집 조합과 대응하는 최근접 거리 및 최근접 거리가 미리 설정된 거리 역치이하인 군집 조합을 군집화하여복수의 군집후 조합을 얻고, 상기 복수의 군집후 조합 중 임의의 2개의 군집후 조합사이의 거리가 미리 설정된거리 역치보다 클 때까지 군집 과정을 반복하며;각 군집후 조합 중 기존 얼굴특징에 근거하여 상기 복수의 군집후 조합 중 각 군집후 조합에 대응하는 유형을결정하고;상기 복수의 군집후 조합 및 각 군집후 조합에 대응하는 유형을 상기 군집 결과로 결정하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서, 상기 업데이트모듈은, 상기 처리를 위한 얼굴특징에 대해 비군집 표기를 하고 표기처리 후의 처리를 위한 얼굴특징을 얼굴특징 데이터베이스 중에 업데이트하며;상기 트리거 조건은 로컬 클러스터 서브 컨디션을 포함하고, 상기 로컬 클러스터 서브 컨디션은, 상기 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징의 획득 시점 차이값이 미리 설정된 시간길이보다 큰것 및 상기 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징의 수가 제1수역치이상인공개특허 10-2021-0095818-6-것; 중 적어도 하나를 포함하고,상기 군집모듈은, 상기 얼굴특징 데이터베이스가 로컬 클러스터 서브 컨디션을 만족하고 상기 글로벌 군집 시점에 도달하지 않을경우, 상기 얼굴특징 데이터베이스 중 표기를 구비하지 않는 제2 기존 얼굴특징을 샘플링하고, 샘플링하여 얻은제2 기존 얼굴특징 및 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징에 대해 군비화하여 군집결과를 획득하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징에 대해 표기 제거 처리를 수행하는 제거모듈을 더 포함하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12항에 있어서, 상기 처리모듈은, 상기 얼굴특징 데이터베이스 중 기존 얼굴특징의 총수를 획득하고;상기 총수가 제2수역치이하인 경우, 상기 처리를 위한 얼굴특징과 상기 얼굴특징 데이터베이스 중 각 얼굴특징사이의 유사도를 획득하고, 유사도에 따라 상기 각 기존 얼굴특징에 대해 순서 배열하며;앞에 배열된 제3예정수의 기존 얼굴특징에 대응하는 유형에 근거하여 상기 처리를 위한 얼굴특징에 대응하는 유형을 결정하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 처리모듈은, 상기 총수가 제2 수역치보다 큰 경우, 얼굴특징 데이터베이스를 샘플링하고 샘플링하여 얻은 기존 얼굴특징을획득하거나, 상기 얼굴특징 데이터베이스에 대응하는 유사도 검색 인덱스를 샘플링하고 샘플링하여 얻은 검색인덱스 중 기존 얼굴특징을 샘플링하여 얻은 기존 얼굴특징으로 결정하며;상기 처리를 위한 얼굴특징과 샘플링하여 얻은 기존 얼굴특징사이의 유사도를 획득하고 유사도에 따라 샘플링하여 얻은 기존 얼굴특징에 대해 배열하고; 앞에 배열된 제4 예정수의 기존 얼굴특징에 대응하는 유형을 얼굴특징에 대응하는 유형으로 결정하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서, 상기 업데이트 모듈은, 상기 처리를 위한 얼굴특징 및 대응하는 유형을 상기 얼굴특징 데이터베이스 중에 업데이트하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "공개특허 10-2021-0095818-7-제13항에 있어서, 상기 업데이트 모듈은상기 군집 결과에 근거하여 상기 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형을 업데이트하는, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제12항에 있어서, 상기 처리를 위한 얼굴특징 및 상기 얼굴특징 데이터베이스 중 상기 기존 얼굴특징은, 양자화 압축 또는 디멘션압축 후의 얼굴특징인, 것을 특징으로 하는 얼굴이미지의 분류장치."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "전자기기에 있어서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 가능하게 연결된 메모리; 를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행될 경우, 상기 적어도 하나의 프로세서가 제1항 내지 제11항 중 어느 한 항에따른 얼굴이미지의 분류방법을 실행하는, 것을 특징으로 하는 전자기기."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "컴퓨터 프로그램이 저장되어 있는 비일시적 컴퓨터 판독가능 저장매체에 있어서, 상기 컴퓨터 프로그램의 명령이 실행될 경우, 제1항 내지 제11항 중 어는 한 항에 따른 얼굴이미지의 분류방법이 실행되는, 것을 특징으로 하는 컴퓨터 프로그램이 저장되어 있는 비일시적 컴퓨터 판독가능 저장매체."}
{"patent_id": "10-2021-0092245", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "컴퓨터 판독 가능 저장 매체에 저장되는 컴퓨터 프로그램에 있어서,상기 컴퓨터 프로그램의 명령이 실행될 경우, 제1항 내지 제11항 중 어는 한 항에 따른 얼굴이미지의 분류방법이 실행되는,것을 특징으로 하는 컴퓨터 판독 가능 저장 매체에 저장되는 컴퓨터 프로그램."}
{"patent_id": "10-2021-0092245", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 얼굴이미지 분류방법, 장치, 전자기기 및 저장매체를 개시하였고, 인공지능 분야에 관한 것이다. 구체 적인 구현방식은, 획득한 처리를 위한 얼굴이미지에 대해 특징을 추출하여 처리를 위한 얼굴특징을 획득하고, 얼 굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않는 경우, 처리를 위한 얼굴특징, 얼굴특징 데이터 (뒷면에 계속)"}
{"patent_id": "10-2021-0092245", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 인공지능 기술분야에 관한 것으로 특히 이미지 처리 기술분야에 관한 것이다. 구체적으로 본 출원은 얼굴이미지의 분류방법, 분류장치, 전자기기 및 저장매체를 제공한다."}
{"patent_id": "10-2021-0092245", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "얼굴 군집은 스마트 앨범 제품에서 핵심적이고 기본적인 인공지능(AI라 약칭)기능인바 얼굴 군집 알고리즘은 사 용자 앨범 중 동일 인물의 사진을 취합하여 자동으로 앨범을 구축할 수 있다. 그 중 얼굴 군집 알고리즘의 주요 절차는 아래와 같다. 이미지에 대해 얼굴 검측을 하여 이미지 중의 얼굴 구역을 획득하고, 얼굴 구역에 대해 특 징 추출을 하여 얼굴 특징을 획득 후 복수 사람의 얼굴특징을 결합하여 얼굴군집을 하여 복수 사람의 얼굴 패킷 (packet) 및 매개 패킷의 유형을 얻는다.관련 기술 중 주요하게는 2개의 얼굴 군집 알고리즘을 포함하고 있다. 하나는 전량 군집(gdl-full) 알고리즘으 로 새로운 얼굴특징이 존재할 경우 새로운 얼굴특징 및 기존의 얼굴특징을 결합하여 전량 군집화한다. 다른 하 나는 점진적 군집 알고리즘으로 새로운 얼굴특징이 존재할 경우 기존의 얼굴특징을 샘플링하고 샘플링하여 얻은 기존의 얼굴특징 및 새로운 얼굴특징을 결합하여 군집화한다. 그러나 상술한 두가지 군집 알고리즘은 새로운 얼굴특징이 하나씩 증가할 때마다 모두 다시 군집화하여 계산량 이 비교적 크고 실시간성이 떨어진다."}
{"patent_id": "10-2021-0092245", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원은 얼굴이미지의 분류방법, 분류장치, 전자기기 및 저장매체를 제공한다."}
{"patent_id": "10-2021-0092245", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 일측면에서, 얼굴이미지의 분류방법을 제공하고, 당해 방법은, 처리를 위한 얼굴이미지를 획득하는 단계; 상기 얼굴이미지에 근거하여 상기 얼굴이미지 중 처리를 위한 얼굴특징을 추출하는 단계; 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 상기 처리를 위한 얼굴특징, 상기 얼 굴특징 데이터베이스 중 기존의 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합하여 상기 처리 를 위한 얼굴특징에 대응하는 유형을 결정하는 단계; 및 상기 처리를 위한 얼굴특징에 대응하는 유형에 근거하여 상기 얼굴이미지의 유형을 결정하는 단계; 를 포함한다. 본 출원의 다른 측면에서, 얼굴이미지 분류장치를 제공하고, 당해 장치는 처리를 위한 얼굴이미지를 획득하는 획득모듈; 상기 얼굴이미지에 근거하여 얼굴이미지 중 처리를 위한 얼굴특징을 추출하는 추출모듈; 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 상기 처리를 위한 얼굴특징, 상기 얼 굴특징 데이터베이스 중 기존의 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합하여 상기 처리 를 위한 얼굴특징에 대응하는 유형을 결정하는 처리모듈; 및 상기 처리를 위한 얼굴특징에 대응되는 유형에 근거하여 상기 얼굴이미지 유형을 결정하는 제1결정모듈; 을 포 함한다. 본 출원의 또 다른 일 측면에서, 전자기기를 제공하고, 당해 전자기기는 적어도 하나의 프로세서; 및 상기 적어 도 하나의 프로세서와 통신 가능하게 연결된 메모리를 포함하고, 그 중 상기 메모리에는 상기 적어도 하나의 프 로세서에 의해 실행 가능한 명령이 저장되어 있고, 상기 명령은 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 본 출원의 상기 실시예에 따른 얼굴이미지의 분류방법을 실행한다. 본 출원의 또 다른 일측면에서, 컴퓨터 프로그램이 저장되어 있는 비일시적 컴퓨터 판독가능 저장매체를 제공하 고, 상기 컴퓨터 프로그램의 명령이 실행될 경우, 본 출원의 상기 실시예에 따른 얼굴이미지의 분류방법이 실행 된다. 본 출원의 또 다른 일측면에서, 컴퓨터 판독 가능 저장 매체에 저장되는 컴퓨터 프로그램을 제공하고, 상기 컴 퓨터 프로그램의 명령이 실행될 경우, 본 출원의 상기 실시예에 따른 얼굴이미지의 분류방법이 수행된다."}
{"patent_id": "10-2021-0092245", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원은 얼굴이미지의 분류방법, 분류장치, 전자기기 및 저장매체를 제공한다. 본 부분에서 설명하는 내용은 본 출원의 실시예의 관건적 또는 중요한 특징들을 특정화하거나 본 출원의 범위를 한정하려는 것이 아님은 당업자에게 있어서 명백한 것이다. 본 출원의 기타 특징들은 아래의 명세서를 통해 용 이하게 이해될 것이다."}
{"patent_id": "10-2021-0092245", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 예시적인 실시예를 설명하고, 이해를 돕기 위해 본 발명의 실시예의 각종 세부사항을 포함하지만 단지 예시적인 것으로 간주하여야 한다. 따라서, 당업자는 본 발명의 범위 및 사상 으로부터 벗어나지 않고 본 명세서에 기술된 실시예들에 대한 다양한 변경 및 수정이 이루어질 수 있다는 것을 이해할 것이다. 또한, 잘 알려진 기능 및 구조에 대한 설명은 명확성과 간결성을 위해 다음의 설명에서 생략된 다. 아래 도면을 첨부하여 본 출원의 실시예에 따른 얼굴이미지의 분류방법, 장치, 전자기기 및 저장매체에 대해 상 세히 설명한다. 도 1은 본 출원의 실시예1에 따른 얼굴이미지의 분류방법의 흐름도이다. 본 출원의 실시예는 해당 얼굴이미지의 분류방법이 얼굴이미지의 분류장치 중에 배치된 것을 예를 들어 설명한 다. 해당 얼굴이미지의 분류장치는 임의의 전자기기 중에 응용하여 해당 전자기기가 얼굴이미지의 분류기능을 수행하도록 하는 것이 가능하다. 여기서, 전자기기는 임의의 계산능력을 가진 장치일 수 있고, 예를 들어 퍼스널 컴퓨터(Personal Computer, PC 라 약칭함), 이동단말기, 서버 등일 수 있고, 이동단말기는 예를 들어 핸드폰, 태블릿 PC, 개인휴대용정보단말 기(Personal Digital Assistant), 웨어러블 장치, 차량탑재장치 등 각종 오퍼레이팅 시스템, 터치 스크린 및/또 는 디스플레이를 구비하는 하드웨어 장치일 수 있다. 도 1에 표시한 바와 같이, 해당 얼굴이미지의 분류방법은 단계101 내지 단계104를 포함할 수 있다. 단계101에서, 처리를 위한 얼굴이미지를 획득한다. 본 출원의 실시예 중 처리를 위한 얼굴이미지는 사용자가 업로드한 얼굴이미지, 사용자가 다운로드한 얼굴이미 지, 사용자가 촬영하여 얻은 얼굴이미지, 사용자가 이미지처리타입의 어플을 이용하여 임의의 얼굴이미지에 대 해 처리하여 얻은 새로운 이미지 등일 수 있고, 본 출원은 이에 대해 특별히 한정하지 않는다; 단계102에서, 상기 얼굴이미지에 근거하여 상기 얼굴이미지 중 처리를 위한 얼굴특징을 추출한다. 하나의 가능한 구현방식으로서, 얼굴특징 추출 알고리즘에 기초하여 얼굴이미지에 대해 특징 추출을 하여 처리 를 위한 얼굴특징을 얻을 수 있다. 다른 한가지 가능한 구현방식으로서, 식별결과의 정확성을 높이기 위하여 딥 러닝(Deep Learning)기술에 기초하 여 얼굴이미지에 대해 특징 추출을 하여 처리를 위한 얼굴특징을 얻을 수도 있다. 예를 들어, 얼굴특징 추출 모형에 기초하여 얼굴이미지에 대해 얼굴특징을 추출하여 처리를 위한 얼굴특징을 얻을 수 있다. 얼굴이미지에는 여러 명의 얼굴을 포함하고, 이런 경우, 식별결과 및 분류결과의 정확성을 높이기 위하여 얼굴 이미지 중의 매개인의 얼굴에 대해 각각 특징을 추출하여 매개인에 대응된 처리를 위한 얼굴특징을 얻을 수 있 음은 자명한 것이다. 또 다른 한가지 가능한 구현방식으로서, 이미지의 식별효율을 높이기 위하여, 먼저 처리를 위한 얼굴이미지에 대해 얼굴식별을 진행하여 얼굴구역을 얻은 후 얼굴구역에 대해 특징 추출을하여 처리를 위한 얼굴특징을 얻을 수 있다. 예를 들어, 얼굴식별 알고리즘에 기초하여 얼굴이미지에 대해 얼굴식별을 진행하여 얼굴구역을 얻거나, 타겟식별 알고리즘에 기초하여 얼굴이미지에 대해 얼굴식별을 진행하여 얼굴구역을 얻을 수도 있다. 에 를 들어, 싱글샷 멀티박스 디덱터(Single Shot MultiBox Detector, SSD라 약칭함), YOLO(You Only Look Once), Faster-RCNN 등 타겟검출 알고리즘에 기초하여 얼굴이미지에 대해 얼굴식별을 진행하여 얼굴구역을 얻을 수 있 다. 일 예로서, 식별결과의 정확성을 높이기 위하여 딥러닝 기술에 기초하여 얼굴이미지에 대해 얼굴식별을 진행하 여 얼굴구역을 얻을 수 있다. 예를 들어, 이미 얼굴구역으로 표기된 대량의 샘플 이미지를 이용하여 얼굴검측 모형에 대해 훈련하여 훈련 후의 얼굴검측 모형이 얼굴구역과 이미사이의 대응관계에 대해 습득하도록 한다. 따 라서, 본 출원에서 처리를 위한 얼굴이미지를 획득 후 해당 얼굴이미지를 입력하여 얼굴검측 모형을 적용하여 해당 얼굴이미지에 대해 얼굴식별을 진행하고 얼굴구역을 출력한다. 얼굴이미지에는 여러 명의 얼굴을 포함하고, 이런 경우, 식별결과 및 분류결과의 정확성을 높이기 위하여 얼굴 이미지 중의 매개인의 얼굴에 대해 검측하여 매개인에 대응된 얼굴구역을 얻을 수 있음은 자명한 것이다. 따라 서 본 출원에서는 매개인의 얼굴구역에 대해 특징 추출을 진행하여 매개인의 얼굴구역에 대응되는 처리를 위한 얼굴특징을 얻을 수 있다. 단계103에서, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 상기 처리를 위한 얼굴 특징, 상기 얼굴특징 데이터베이스 중 기존의 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합하 여 상기 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 본 출원의 실시예에 따르면, 트리거 조건은 미리 설정되는 것으로, 해당 트리거 조건은 트리거 군집 알고리즘을 실행하는데 쓰이고 얼굴특징 데이터베이스 중 기존의 얼굴특징 및 처리를 위한 얼굴특징을 군집 처리한다. 얼굴 특징 데이터 베이스는 미리 구축되는 것으로, 해당 얼굴특징 데이터베이스에는 복수의 기종 얼굴특징 및 매개 기존 얼굴특징에 대응되는 유형이 저장되어 있다. 본 출원의 실시예에 따르면, 처리를 위한 얼굴특징을 추출 시 얼굴특징 데이터베이스 중 기존의 얼굴특징에 근 거하여 해당 처리를 위한 얼굴특징을 군집 처리를 진행하여 해당 처리를 위한 얼굴특징에 대응되는 유형을 결정 하는 것이 아니라, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족여부를 판단하고 얼굴특징 데이터 베이스가 미리설정한 트리거 조건을 만족하는 경우에만 얼굴특징 데이터베이스 중 기존의 얼굴특징에 근거하여 해당 처리를 위한 얼굴특징에 대해 군집 처리를 진행하여 해당 얼굴특징에 대응되는 유형을 결정하고, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 군집 알고리즘을 이용하여 처리를 위한 얼굴특 징에 대응되는 유형을 결정하는 것이 아니라 처리를 위한 얼굴특징, 얼굴특징 데이터베이스 중 기존의 얼굴특징 에 대응되는 유형 및 이웃한 얼굴특징 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 하나의 가능한 구현방식으로서, 얼굴특징 데이터베이스 중 기존의 얼굴특징 수의 스케일이 비교적 작은 경우, 분류결과의 정확성을 높이기 위하여 해당 이웃한 얼굴특징 알고리즘은 근접한 알고리즘 또는 최근접 이웃 알고 리즘일 수 있고 처리를 위한 얼굴특징 및 얼굴특징 데이터베이스 중 여러 기존의 얼굴특징 간의 유사도를 계산 하고 또 유사도에 따라 각 기존 얼굴특징에 대해 순서를 배열하여 앞에 배열된 미리 설정된 수량의 기존 얼굴특 징에 대응되는 유형에 근거하여 처리를 위한 얼굴특징에 대응되는 유형을 결정한다. 얼굴특징 데이터베이스 중 기존 얼굴특징 수 스케일이 비교적 클 경우, 분류의 효율을 높여 이미지 분류의 실시 간성을 향상시키기 위하여, 해당 이웃한 얼굴특징 알고리즘은 최근접 이웃 알고리즘과 유사할 수 있고 얼굴특징 데이터베이스를 샘플링할 수 있어, 샘플링하여 얻은 기존 얼굴특징을 얻으며 처리를 위한 얼굴특징과 샘플링하 여 얻은 얼굴특징 사이의 유사도를 계산하여 유사도에 따라 샘플링하여 얻은 기존 얼굴특징에 대해 순서 배열하 고, 앞에 배열된 미리 설정된 수량의 기존 얼굴특징에 대응되는 유형에 근거하여 처리를 위한 얼굴특징에 대응 되는 유형을 결정한다. 다시말하면, 본 출원에서 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 이웃한 얼 굴특징 알고리즘에 근거하여 얼굴특징 데이터베이스 중 제일 유사한 몇개의 얼굴특징을 선택하고 제일 유사한 몇개의 얼굴특징 유형에 근거하여 처리를 위한 얼굴특징에 대응되는 유형을 결정한다. 따라서, 군집 알고리즘을 통할 필요없이 처리를 위한 얼굴특징에 대응되는 유형을 결정하기에 계산량을 낮추고 이미지 분류의 효율을 높 여 얼굴이미지 분류의 실시간성을 향상시킨다. 단계104에서, 처리를 위한 얼굴특징에 대응되는 유형에 근거하여 얼굴이미지의 유형을 결정한다. 본 출원의 실시예에 따르면, 처리를 위한 얼굴특징에 대응되는 유형을 결정한 후 해당 처리를 위한 얼굴특징에 대응되는 유형을 얼굴이미지의 유형으로 할 수 있다. 여기서, 상기 유형은 얼굴이미지를 표시하는데 쓰이는데, 예를 들어, 유형은 인물명칭, 닉네임 등일 수 있다. 여기서 설명해야 할 바는, 얼굴이미중에 여러명의 얼굴을 포함할 경우 처리를 위한 이미지 특징도 여러개이고, 이런경우 단계103에 근거하여 매개 처리를 위한 얼굴특징에 대응되는 유형을 산출하여 각 처리를 위한 특징에 대응되는 유형을 얼굴이미지의 유형으로 한다. 즉 얼굴이미지의 유형은 여러개이다. 예를 들어 설명하면, 얼굴 이미지 중 두사람의 얼굴을 포함하고 각각 사용자 “갑” 및 “을”과 대응되는 얼굴일 경우, 해당 얼굴이미지 의 유형은 “갑”과 “을”을 포함할 수 있다. 하나의 사용환경으로서, 스마트 앨범 제품 또는 얼굴 군집 수요를 가지는 제품에 있어서 사용자가 다운로드, 촬 영, 처리를 통해 새로운 얼굴이미지를 얻을 경우 단말장치를 통해 얼굴이미지에 대한 분류처리를 할 수 있다. 다른 사용환경으로서, 사용자가 다운로드, 촬영, 처리를 통해 새로운 얼굴이미지를 얻을 경우, 사용자는 해당 얼굴이미지를 클라우드 포토앨범에 업로드하고 대응되게 클라우드 서버를 통해 얼굴이미지에 대한 분류처리를 할 수도 있다. 본 출원 실시예의 얼굴이미지의 분류방법에 따라, 획득한 처리를 위한 얼굴이미지에 대해 특징을 추출하여 처리 를 위한 얼굴특징을 획득하고, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 처리 를 위한 얼굴특징, 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응되는 유형 및 이웃한 얼굴특징의 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응되는 유형을 결정하며, 처리를 위한 얼굴특징에 대응되는 유형에 근거하 여 얼굴이미지의 유형을 결정한다. 따라서 얼굴이미지 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않 을 경우, 이웃한 얼굴특징 알고리즘을 통해 처리를 위한 얼굴특징에 대응되는 유형을 결정하여 군집화 알고리즘 을 통할 필요없이 처리를 위한 얼굴특징에 대응되는 유형을 결정할 수 있어 계산량을 낮추고 이미지 분류의 효 율을 높여 얼굴이미지 분류의 실시간성을 향상시켰다. 하나의 가능한 구현방식으로서, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족할 경우, 분류결과의 정확성을 높이기 위하여 군집화 알고리즘에 기초하여 모든 얼굴특징을 군집화하여 처리를 위한 얼굴특징에 대응 되는 얼굴이미지를 결정할 수 있다. 아래 실시예2를 결합하여 상기 과정에 대해 상세히 설명하도록 한다. 도 2는 본 출원 제2실시예에 따른 얼굴이미지의 분류방법의 흐름도이다. 도 2에 표시한 바와 같이, 해당 얼굴이미지의 분류방법은 단계201 내지 단계208을 포함한다. 단계201에서, 처리를 위한 얼굴이미지를 획득한다. 단계202에서, 얼굴이미지에 근거하여 얼굴이미지 중 처리를 위한 얼굴특징을 추출한다. 단계 201 내지 단계 202의 실행과정은 상기 실시예 중 단계 101 내지 단계 102의 실행과정을 참조할 수 있으므 로 이에 대한 설명은 줄인다. 단계 203에서, 얼굴특징 데이트베이스가 미리 설정된 트리거 조건 만족 여부를 판단하고, 만족할 경우 단계 204 내지 단계 206을 수행하고; 만족하지 않을 경우 단계 207 내지 단계 208을 수행한다. 단계 204에서, 처리를 위한 얼굴특징을 얼굴특징 데이터베이스 중에 업데이트한다. 단계 205에서, 얼굴특징 데이터베이스 중의 기존 얼굴특징에대해 군집화하여 군집 결과를 획득한다. 본 출원의 실시예에 따르면, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족할 경우, 처리를 위한 얼 굴특징을 얼굴특징 데이터베이스 중에 업데이트하고 군집화 알고리즘에 기초하여 얼굴특징 중의 기존 얼굴특징 을 군집화하여 군집 결과를 획득한다. 단계 206에서, 군집 결과에 근거하여 처리를 위한 얼굴특징에 대응되는 얼굴이미지의 유형을 결정한다. 본 출원의 실시예에 따르면, 군집 결과는 군집화하여 얻은 각 클러스터 및 각 클러스터에 대응하는 분류유형을 포함할 수 있고, 따라서 본 출원에서 처리를 위한 얼굴특징이 속하는 클러스터를 결정하고 클러스터에 대응하는 유형을 결정하여 처리를 위한 얼굴특징에 대응하는 얼굴이미지의 유형으로 한다. 단계 207에서, 처리를 위한 얼굴특징, 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형 및 이웃한 얼 굴특징 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 단계 208에서, 처리를 위한 얼굴특징에 대응하는 유형에 근거하여 얼굴이미지의 유형을 결정한다. 단계 207 내지 단계 208의 수행과정은 상기 실시예 중 단계 103 내지 단계 104의 수행과정을 참조할 수 있으므 로 이에 대한 설명은 줄인다. 본 출원의 실시예에 따르면, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족할 경우, 처리를 위한 얼 굴특징을 얼굴특징 데이터베이스 중에 업데이트하고 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하여 군 집 결가를 얻으며 군집 결과에 근거하여 처리를 위한 얼굴특징에 대응하는 얼굴이미지의 유형을 결정하기에 분 류결과의 정확성을 높일 수 있다. 반면, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경 우, 이웃한 얼굴특징 알고리즘을 통해 처리를 위한 얼굴특징에 대응하는 유형을 결정하기에 계산량을 낮추고 이 미지 분류의 효율을 높여 얼굴이미지 분류의 실시간성을 향상시킬 수 있다. 따라서 서로 다른 조건에서 다른 알 고리즘을 적용하여 처리를 위한 얼굴특징에 대응하는 얼굴이미지의 유형을 결정하기에 해당 방법의 적용성을 높 였고 동시에 분류결과의 정확성 및 이미지 분류의 실시간성도 겸하여 개선하였다. 하나의 가능한 구현방식으로서, 군집 결과의 정확성을 높이기 위하여 트리거 조건은 아래와 같은 내용을 포함할 수 있다. 글로벌 군집(Global clustering)시점에 도달하면 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하 여 군집 결과를 획득한다. 아래와 같은 내용을 더 포함할 수 있다. 글로벌 군집(Global clustering)시점에 도달 할 경우, 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하여 군집 결과를 획득한다. 여기서, 글로벌 군집 (Global clustering)시점은 미리 설정된 것이다. 일 예로서, 저장리소스 및 계산리소스 지출을 줄이기 위하여 해당 글로벌 군집(Global clustering)시점은 매일 의 분류처리 저피크구간(Low peak period) 또는 군집 처리 저피크구간일 수 있는데, 예를 들어 새벽 구간일 수 있다. 다른 일 예로서, 이미지 분류결과의 정확성을 높이기 위하여 해당 글로벌 군집(Global clustering)시점은 주기 성으로 설정될 수 있다. 예를 들어, 매 30분마다 해당 글로벌 군집(Global clustering)시점에 도달하도록 설정 할 수 있다. 예를 들어, 00:00시, 00:30시, 01:00시, 01:30시, 02:00시, …, 에 미리 설정된 트리거 조건을 만 족하도록 결정할 수 있다. 본 출원의 실시예에 따르면, 글로벌 군집(Global clustering)시점에 도달할 경우, 전량 군집 알고리즘에 기초하 여 얼굴특징 데이터베이스 중 모든 기존 얼굴특징을 군집화하여 군집 결과를 획득하고, 이에 따라 얼굴특징 데 이터베이스 중 모든 기존 얼굴특징에 근거하여 군집화하여 처리를 위한 얼굴특징에 대응하는 유형을 결정하기에 분류결과의 정확성을 높일 수 있다. 여기서 설명해야 할 바는, 본 출원에서 스탠드 얼로운(stand alone)으로 전량 군집 알고리즘을 수행하거나 단일 장치의 부하스트레스를 낮추기 위하여 분신식 클러스터 중의 장치로 전량 군집 알고리즘을 수행하여, 얼굴특징 데이터베이스 중 모든 기존 얼굴특징을 군집화하여 군집 결과를 얻을 수 있다. 따라서 해당 방법은 적용성을 향 상시킬 수 있다. 하나의 가능한 구현방식으로서, 분류결과의 정확성을 높이기 위하여 본 출원에서는 전량 군집 알고리즘에 근거 하여 얼굴특징 데이터베이스 중 모든 기존 얼굴특징을 군집화하여 각 클러스터를 얻고, 각 클러스터 중의 기존 얼굴특징에 근거하여 각 클러스터에 대응하는 유형을 결정하여 각 클러스터 및 각 클러스터에 대응하는 유형을 군집 결과로 한다. 아래 실시예 3과 결합하여 상기 과정에 대해 상세히 설명한다. 도 3은 본 출원의 실시예3에 따른 얼굴이미지의 분류방법의 흐름도이다. 도 3에 표시된 바와 같이, 해당 얼굴이미지의 분류방법은 단계 301 내지 단계 313을 포함한다. 단계 301에서, 처리를 위한 얼굴이미지를 획득한다. 단계 302에서, 얼굴이미지에 근거하여 얼굴이미지 중 처리를 위한 얼굴특징을 추출한다. 단계 303에서, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건 만족여부를 판단하고, 만족할 경우 단계 304 내지 단계 311을 수행하고; 만족하지 않을 경우 단계 312 내지 단계 313을 수행한다. 여기서, 미리 설정된 트리거 조건은 글로벌 군집시점에 도달하는 것을 포함할 수 있다. 단계 304에서, 처리를 위한 얼굴특징을 얼굴특징 데이터베이스 중에 업데이트한다. 단계 301 내지 단계 304의 수행과정은 상기 실시예의 수행과정을 참조할 수 있으므로 이에 대한 설명은 생략한 다. 단계 305에서, 얼굴특징 데이터베이스 중 임의의 2개의 기존 얼굴특징사이의 유사도를 획득한다. 본 출원의 실시예에 따르면, 유사도에 기초하여 알고리즘을 계산하여 얼굴특징 데이터베이스 중 임의의 2개의 기존 얼굴특징사이의 유사도를 산출할 수 있다. 여기서, 유사도는 유클리드 거리 유사도(Euclidean distance similarity), 맨해턴 거리 유사도(ManhattanDistance), 코사인 유사도(Cosine Similarity) 등일 수 있으며 본 출원은 이에 대해 특별히 한정하지 않는다. 단계 306에서, 얼굴특징 데이터베이스 중의 매기 기존 얼굴특징과 대응하는 유사도가 가장 높은 기존 얼굴특징 을 군집화하여 복수개의 군집 조합을 얻는다. 본 출원의 실시예에 따르면, 얼굴특징 데이터베이스 중의 매개 기존 얼굴특징에 대해 단계 305에서 산출한 유사 도에 근거하여 해당 기존 얼굴특징과 유사도가 가장 높은 기존 얼굴특징을 결정할 수 있기에, 해당 기존 얼굴특 징과 이에 대응하는 유사도가 가장 높은 기존 얼굴특징을 군집화하여 복수개의 군집 조합을 얻을 수 있다. 단계 307에서, 얼굴특징 데이터베이스 중 임의의 2개의 기존 얼굴특징사이의 유사도에 근거하여 임의의 2개의 군집 조합사이의 거리를 결정한다. 2개의 군집 조합사이의 거리가 작을 수록 군집 조합 중 얼굴특징사이의 유사도가 높은 것은 자명한 것이다. 딸 ㅏ서 상기 거리는 유사도와 역관계를 가진다. 구체적으로 말하면, 군집 조합 1 중 2개의 얼굴특징을 포함하고 각각 얼굴특징 1-1 및 1-2이며, 군집 조합 2 중 2개의 얼굴특징을 포함하고 각각 얼굴특징 2-1 및 2-2일 경우, 얼굴특징 1-1과 얼굴특징 2-1사이의 유사도, 얼 굴특징 1-1과 얼굴특징 2-2사이의 유사도, 얼굴특징 1-2와 얼굴특징 2-1사이의 유사도, 얼굴특징 1-2와 얼굴특 징 2-2사이의 유사도를 결정할 수 있고, 이어서 산출된 최소 유사도에 근거하여 군집 조합 1과 2사이의 거리를 결정하거나 유사도의 평균치에 근거하여 군집 조합 1과 2사이의 거리를 결정할 수 있다. 단계 308에서, 매개 군집 조합과 대응하는 거리가 최소이고 또 최소 거리가 미리 설정된 거리의 역치이하인 군 집 조합을 군집화하여 복수개의 군집후 조합을 얻고, 복수개의 군집후 조합 중 임의의 2개의 군집후 조합사이의 거리가 미리 설정된 거리 역치보다 클 때까지 군집화 과정을 중복하여 수행한다. 서로 다른 군집 조합사이의 거리가 작을 수록 군집 조합 중 얼굴특징사이의 유사도가 높은 것은 자명한 것이다. 따라서 얼굴특징을 군집화 후 각 군집 조합사이의 거리에 근거하여 군집화할 수 있다. 여기서, 군집화하여 얻은 각 조합사이의 거리는 미리 설정된 거리의 역치보다 커야 한다. 여기서, 미리 설정된 거리 역치는 사전에 미리 설정된 것이다. 따라서 본 출원의 실시예에 따르면, 임의의 2개의 군집 조합사이의 거리를 결정한 후 매개 군집 조합에 대해 해 당 군집 조합과 거리가 제일 근접하고 또 최소거리가 미리 설정된 거리의 역치이하인 군집 조합을 결정할 수 있 고, 결정된 군집 조합과 해당 군집조합을 군집화하여 군집 후 조합을 얻으며 복수개의 군집 후 조합 중 임의의 2개의 군집후 조합사이의 거리가 미리 설정된 거리의 역치보다 클 때까지 군집화 과정을 반복하여 수행한다. 단계 309에서, 매개 군집후 조합 중의 기존 얼굴특징에 근거하여 복수개의 군집후 조합 중 매개 군집후 조합에 대응하는 유형을 결정한다. 본 출원의 실시예에 따르면, 군집화하여 각 군집후 조합을 얻을 경우 각 군집후 조합에 대해 해당 군집후 조합 중 기존 얼굴특징에 근거하여 해당 군집후 조합에 대응하는 유형을 결정할 수 있다. 예를 들어, 각 군집후 조합 에 대해 해당 군집후 조합 중 각 기존 얼굴특징에 대응하는 유형을 획득하고 매 유형이 포함하는 기존 얼굴특징 의 수를 통계하여 기존 얼굴특징 수의 수치가 가장 큰 유형에 근거하여 처리를 위한 얼굴특징에 대응하는 유형 을 결정할 수 있다. 예를 들어 설명하면, 해당 군집후 조합 중 기존 얼굴특징이 모두 사용자 “갑”의 얼굴특징이면 해당 군집후 조 합에 대응하는 유형은 “갑”일 수 있고; 또는 해당 군집후 조합 중 복수가 사용자 “갑”에 대응하는 기존 얼 굴특징일 경우 군집후 조합에 대응하는 유형은 “갑”일 수 있다. 계속하여 분류결과의 정확성을 높이기 위하여, 기존 얼굴특징 수의 최대치가 설정한 역치보다 큰지 여부를 판단 하여, 클 경우 얼굴특징 수의 수치가 최대인 유형을 처리를 위한 얼굴특징에 대응하는 유형으로 하고; 크지 않 을 경우에는 처리를 위한 얼굴특징을 단독으로 한가지 유형으로 할 수 있다. 단계 310에서, 복수개의 군집후 조합 및 각 군집후 조합에 대응하는 유형을 군집 결과로 결정한다. 본 출원의 실시예에 따르면, 복수개의 군집후 조합 및 각 군집후 조합에 대응하는 유형을 군집 결과로 할 수 있 다. 단계 311에서, 군집 결과에 근거하여 처리를 위한 얼굴특징에 대응하는 얼굴이미지의 유형을 결정한다. 본 출원의 실시예에 따르면, 처리를 위한 얼굴특징이 속하는 군집후 조합을 결정하고 결정한 군집후 조합에 대 응하는 유형을 처리를 위한 얼굴특징에 대응하는 얼굴이미지의 유형으로 할 수 있다. 본 출원의 실시예의 하나의 가능한 구형방식으로서, 처리를 위한 얼굴특징의 유형을 결정한 후 처리를 위한 얼 굴특징 및 대응하는 유형을 얼굴특징 데이터베이스 중에 업데이트하여 후속적으로 얼굴 군집 처리를 하는데 편 이를 주어 군집 결과의 정확성을 향상시킬 수 있다. 단계 312에서, 처리를 위한 얼굴특징, 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형 및 이웃한 얼 굴특징 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 단계 313에서, 처리를 위한 얼굴특징에 대응하는 유형에 근거하여 얼굴이미지의 유형을 결정한다. 단계 312 내지 단계 313의 수행과정은 상기 실시예 중의 단계 103 내지 단계 104의 수행과정을 참조할 수 있으 므로 이에 대한 설명은 생략한다. 하나의 가능한 구현방식으로서, 이미지 분류의 실시간성을 제고하기 위하여 트리거 조건은 로컬 클러스터(local cluster) 서브 컨디션을 포함할 수 있고, 점진적 군집 알고리즘에 근거하여 얼굴특징 데이터베이스 중 기존 얼 굴특징을 군집화하여 군집 결과를 얻는다. 아래 실시예 4와 결합하여 상기 과정에 대해 상세히 설명한다. 도 4는 본 출원의 실시예 4에 따른 얼굴이미지의 분류방법의 흐름도이다. 도 4에 표시한 바와 같이, 해당 얼굴이미지의 분류방법은 단계 401 내지 단계 409를 포함할 수 있다. 단계 401에서, 처리를 위한 얼굴이미지를 획득한다. 단계 402에서, 얼굴이미지에 근거하여 얼굴이미지 중 처리를 위한 얼굴특징을 추출한다. 단계 401 내지 단계 402의 수행과정은 상기 실시예 중 단계 101 내지 단계 102의 수행과정을 참조할 수 있으므 로 이에 대한 설명은 생략한다. 단계403에서, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건 만족여부를 판단하고, 만족할 경우 단계 404 내지 단계 406을 수행하고; 만족하지 않을 경우 단계 407 내지 단계 408을 수행한다. 여기서, 미리 설정된 트리거 조건은 글로벌 군집 시점에 도달 및 로컬 클러스터 서브 컨디션을 포함할 수 있고, 그 중 로컬 클러스터 서브 컨디션은 아래와 같은 것을 포함한다. 얼굴특징 데이터베이스 중 비군집 표기를 구비 하는 제1 기존 얼굴특징의 획득시점 차이값이 미리 설정된 시간길이보다 큼 및/또는 얼굴특징 데이터베이스 중 비군집 표기를 구비하는 제1 기존 얼굴특징의 수가 제1수역치보다 크거나 같다. 여기서, 상기 획득시점 차이값은 비군집 표기를 구비하는 제1 기존 얼굴특징을 획득하는 가장 늦은 시점과, 비 군집 표기를 구비하는 제1 기존 얼굴특징을 획득하는 가장 빠른 시점사이의 차이값이다. 미리 설정된 시간길이 와 제1수량 역치는 모두 사전에 미리 설정된 것이다. 다시말하면, 최근 회에 비군집 표기를 구비하는 얼굴특징을 얼굴특징 데이터베이스에 저장하는 시점과 얼굴특징 데이터베이스 중 최초 비군집 표기를 구비하는 제1 기존 얼굴특징을 저장하는 시점사이의 차이값이 비교적 클 경우, 및/또는 얼굴특징 데이터베이스 중 비군집 표기를 구비하는 제1 기존 얼굴특징의 수가 비교적 클 경우, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 결정하여 후속의 군집화 과정을 트리거닝할 수 있다. 단계 404에서, 처리를 위한 얼굴특징에 대해 비군집 표기를 하고 표기 처리된 처리를 위한 얼굴특징을 얼굴특징 데이터베이스 중에 업데이트한다. 본 출원의 실시예에 따르면, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족할 경우, 처리를 위한 얼 굴특징에 대해 비군집 표기를 하여 표기 처리된 처리를 위한 얼굴특징을 얼굴특징 데이터베이스 중에 업데이트 할 수 있다. 단계 405에서, 얼굴특징 데이테베이스가 로컬 클러스터 서브 컨디션을 만족하고 글로벌 군집 시점을 만족하지 않을 경우, 얼굴특징 데이터베이스 중 표기를 구비하지 않는 제2 기존 얼굴특징을 샘플링한다. 본 출원의 실시예에 따르면, 얼굴특징 데이터베이스가 로컬 클러스터 서브 컨디션을 만족하고 글로벌 군집 시점 을 만족하지 않을 경우, 점진적 군집 알고리즘에 기초하여 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하 여 군집 결과를 획득한다. 구체적으로는, 먼저 점진적 군집 알고리즘에 기초하여 얼굴특징 데이터베이스 중 표 기를 구비하지 않는 제2 기존 얼굴특징을 샘플링한다. 단계 406에서, 샘플링하여 얻은 제2 기존 얼굴특징 및 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼 굴특징을 군집화하여 군집 결과를 획득한다. 본 출원의 실시예에 따르면, 획득한 제2 기존 얼굴특징을 샘플링 후, 샘플링하여 얻은 제2 기존 얼굴특징 및 얼 굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징을 군집화하여 군집 결과를 획득한다. 하나의 가능한 구현방식으로서, 후속의 이미지 분류의 효율 및 분류결과의 정확성을 높이기 위하여 군집 결과를 얻은 후 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징에 대해 표기 제거 처리를 할 수 있다. 단계 407에서, 군집 결과에 근거하여 처리를 위한 얼굴특징에 대응하는 얼굴이미지의 유형을 결정한다. 본 출원의 실시예에 따르면, 군집화 전에 얼굴특징 데이터베이스 중 기존 얼굴특징에 대해 샘플링하는 것을 통 하여 계산량을 줄이고 이미지 분류의 실시간성을 향상시킬 수 있다. 또한 군집 알고리즘에 근거하여 처리를 위 한 얼굴특징에 대응하는 얼굴이미지의 유형을 결정하여 분류결과의 정확성을 향상시킬 수 있다. 단계 408에서, 처리를 위한 얼굴특징, 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형 및 이웃한 얼 굴특징 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 단계 409에서, 처리를 위한 얼굴특징에 대응하는 유형에 근거하여 얼굴이미지의 유형을 결정한다. 단계 407 내지 단계 409의 수행과정은 상기 실시예 중 단계 103 내지 단계 104의 수행과정을 참조할 수 있으므 로 이에 대한 설명은 생략한다. 본 출원의 실시예에 따른 얼굴이미지의 분류방법은 이미지 분류의 실시간성 및 분류결과의 정확성을 보장할 수 있고, 또 점진적 군집 또는 전량 군집을 빈번히 하는 상황을 피할 수 있기에 계산 원가 및 계산량을 줄일 수 있 다. 하나의 가능한 구현방식으로서, 본 출원에서 얼굴특징 데이터베이스 중 기존 얼굴특징 수의 스케일에 근거하여 적합한 이웃한 얼굴특징 알고리즘을 선택하여 처리를 위한 얼굴특징에 대응하는 유형을 결정할 수 있다. 아래 실시예 5와 결합하여 상기 과정에 대해 상세시 설명한다. 도 5는 본 출원의 실시예 5에 따른 얼굴이미지의 분류방법의 흐름도이다. 도 5에 표시한 바와 같이, 해당 얼굴이미지의 분류방법은 단계 501단계 내지 510을 포함할 수 있다. 단계 501에서, 처리를 위한 얼굴이미지를 획득한다. 단계 502에서, 얼굴이미지에 근거하여 얼굴이미지 중 처리를 위한 얼굴특징을 추출한다. 단계 501 내지 단계 502의 수행과정은 상기 실시예 중의 단계 101 내지 단계 102의 수행과정을 참조할 수 있으 므로 이에 대한 설명은 생략한다. 단계 503에서, 얼굴특징 데이터베이스 중 기존 얼굴특징의 총수를 획득한다. 단계 504에서, 상기 총수가 제2수역치보다 큰지 여부를 판단하고, 크지 않을 경우 단계 505 내지 단계 506을 수 행하며; 클 경우에는 단계 507 내지 단계 509를 수행한다. 여기서, 제2수량 역치는 사전에 미리 설정된 것으로 제2수역치가 비교적 큰 수치임은 자명한 것이다. 단계 505에서, 처리를 위한 얼굴특징과 얼굴특징 데이터베이스 중 각 기존 얼굴특징사이의 유사도를 획득하고 유사도에 따라 각 기존 얼굴특징에 대해 순서를 배열한다. 본 출원의 실시예에 따르면, 얼굴특징 데이터베이스 중 기존 얼굴특징의 총수가 비교적 작을 경우, 분류결과의 정확성을 높이기 위하여 얼굴특징 데이터베이스 중 기존 얼굴특징을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정할 수 있다. 구체적으로, 먼저 유사도 계산 알고리즘에 기초하여 처리를 위한 얼굴특징과 얼굴특징 데이터베이스 중 각 기존 얼굴특징사이의 유사도를 결정하고 이어서 유사도 수치에 따라 각 기존 얼굴특징에 대 해 큰 것으로부터 작은 순서로 배열할 수 있다. 단계 506에서, 앞에 배열된 제3 예정 수의 기존 얼굴특징에 대응하는 유형에 근거하여 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 여기서, 제3 예정 수는 사전에 미리 설정된 것이다. 본 출원의 실시예에 따르면, 유사도 수치에 따라 큰 것으로부터 작은 순서로 각 기존 얼굴특징에 대해 순서 배 열 후 앞에 배열된 제3 예정 수의 기존 얼굴특징에 대응하는 유형에 근거하여 처리를 위한 얼굴특징에 대응하는 유형을 결정할 수 있다. 구체적으로는, 앞에 배열된 제3 예정 수의 기존 얼굴특징에 대응하는 유형에 근거하여 각 유형이 포함하는 기존 얼굴특징 수를 결정하고 기존 얼굴특징 수의 수치가 가장 큰 유형에 근거하여 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 예를 들어, 제3 예정 수가 100이고 100개의 기존 얼굴특징이 3개의 유형을 포함하며 각각 유형 1, 유형 2 및 유 형 3이며, 유형 1하에 55개의 기존 얼굴특징이 포하되고 유형 2하에 20개의 얼굴특징이 포함되며 유형 3하에는 25개의 얼굴특징이 포함된다고 가정하면, 유형 1을 처리를 위한 얼굴특징에 대응하는 유형으로 할 수 있다. 나아가 분류결과의 정확성을 높이기 위하여 최대 기존 얼굴특징 수가 설정한 역치보다 큰지 여부를 판단하고, 큰 경우 기존 얼굴특징 수의 수치가 최대인 유형을 처리를 위한 얼굴특징에 대응하는 유형으로 하고; 크지 않을 경우, 처리를 위한 얼굴특징을 단독으로 하나의 유형으로 할 수 있다. 또는 최대 유사도가 소정역치보다 큰지 여부를 판단하고, 크지 않을 경우 해당 처리를 위한 얼굴특징을 단독으로 하나의 유형으로 하고; 큰 경우에는 최대 유사도에 대응하는 기존 얼굴특징에 대응하는 유형을 처리를 위한 얼굴특징에 대응하는 유형으로 할 수 있 다. 단계 507에서, 얼굴특징 데이터베이스를 샘플링하고 샘플링하여 얻은 기존 얼굴특징을 획득한다. 또는 얼굴특징 데이터베이스에 대응하는 유사도 검색 인덱스를 샘플링하고 샘플링하여 얻은 검색 인덱스 중 기존 얼굴특징을 샘플링하여 얻은 기존 얼굴특징으로 결정한다. 본 출원의 실시예에 따르면, 얼굴특징 데이터베이스 중 기존 얼굴특징의 총수가 비교적 클 경우, 이미지 분류의 실시간성을 높이기 위하여 얼굴특징 데이터베이스 중의 부분 기존 얼굴특징을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정할 수 있다. 구체적으로, 먼저 얼굴특징 데이터베이스를 샘플링하고, 샘플링하여 얻은 기 존얼굴특징을 획득한다. 예를 들어, 얼굴특징 데이터베이스에 대해 무작위로 샘플링하고, 샘플링하여 얻은 기존 얼굴특징을 획득한다. 또는 얼굴특징 데이터베이스에 대응하는 유사도 검색 인덱스를 샘플링하고, 샘플링하여 얻은 검색 인덱스 중의 기존 얼굴특징을 샘플링하여 얻은 기존 얼굴특징으로 결정한다. 예를 들어, 얼굴특징 데이터베이스에 대해 인덱 스 트리를 구축할 수 있다. 예를 들어, K-D트리를 구축하여 복수개의 브런치를 얻을 수 있는데 여기서, 동일 브 런치에 속하는 기존 얼굴특징의 유사도가 비교적 높으므로 복수개의 브런치를 샘플링하고 샘플링하여 얻은 브런 치 중 기존 얼굴특징을 샘플링하여 얻은 기존 얼굴특징으로 하거나 처리를 위한 얼굴특징에 근거하여 인덱스 트 리를 조회하여 처리를 위한 얼굴특징과 유사도가 비교적 높은 브런치를 획득하여 조회하여 얻은 브런치 중의 기 존 얼굴특징을 샘플링하여 얻은 기존 얼굴특징으로 할 수도 있다. 단계 508에서, 처리를 위한 얼굴특징과 샘플링하여 얻은 기존 얼굴특징사이의 유사도를 획득하고 유사도에 따라 샘플링하여 얻은 기존 얼굴특징에 대해 배열한다. 본 출원의 실시예에 따르면, 유사도 계산 알고리즘에 기초하여 처리를 위한 얼굴특징과 샘플링하여 얻은 기존 얼굴특징사이의 유사도를 결정하고 이어서 유사도의 수치에 따라 큰 것으로부터 작은 순서로 샘플링하여 얻은 기존 얼굴특징에 대해 배열한다. 단계 509에서, 앞에 배열된 제4 예정 숭의 기존 얼굴특징에 대응하는 유형에 근거하여 얼굴특징에 대응하는 유 형을 결정한다. 여기서, 제4 예정 수는 사전에 미리 설정된 것이다. 본 출원의 실시에에 따르면, 유사도의 수치에 따라 큰 것으로부터 작은 순서로 샘플링하여 얻은 기존 얼굴특징 에 대해 배열 수 앞에 배열된 제4 예정 수의 기존 얼굴특징에 대응하는 유형을 처리를 위한 얼굴특징에 대응하 는 유형으로 결정할 수 있다. 구체적으로, 앞에 배열된 제4 예정 수의 기존 얼굴특징에 대응하는 유형에 근거하여 각 유형이 포함하는 기존 얼굴특징의 수를 결정하고 기존 얼굴특징 수의 수치가 최대인 유형에 근거하여 처리를 위한 얼굴특징에 대응하 는 유형을 결정한다. 예를 들어, 제4 예정 수가 100이고 100개의 기존 얼굴특징이 도합 3개의 유형을 포함하며 각각 유형 1, 유형 2 및 유형 3이고 유형 1하에는 35개의 기존 얼굴특징이 포함되고 유형 2하에는 20개의 기존 얼굴특징이 포함되며 유형 3하에는 45개의 기존 얼굴특징이 포함된다고 가정하면, 유형 3을 처리를 위한 얼굴특징에 대응하는 유형으 로 할 수 있다. 여기서 설명해야 할 바는, 상기에서 제3 예정 수와 제4 예정 수가 같은 상황을 예시하였지만, 실제 응용에서 필 요에 따라 대응되는 제3 예정 수 및 제4 예정 수를 설정할 수 있으며, 그 중 제 3에정 수 및 제4 에정 수는 같 을 수도 있고 다를 수도 있는바 본 출원에서 이에 대해 특별히 한정하지 않는다. 계속하여 분류결과의 정확성을 높이기 위하여 최디 기존 얼굴특징의 수가 설정 역치보다 큰지 여부를 판단하고, 클 경우 기존 얼굴특징 수의 수치가 최대인 유형을 처리를 위한 얼굴특징에 대응하는 유형으로 하고; 크지 않을 경우 처리를 위한 얼굴특징을 단독으로 하나의 유형으로 한다. 또는 최대 유사도가 소정역치보다 큰지 여부를 판단하고, 크지 않을 경우 해당 처리를 위한 얼굴특징을 단독으로 하나의 유형으로 하고; 큰 경우에는 최대 유 사도에 대응하는 기존 얼굴특징에 대응하는 유형을 처리를 위한 얼굴특징에 대응하는 유형으로 할 수 있다. 단계 510에서, 처리를 위한 얼굴특징에 대응하는 유형을 얼굴이미지의 유형으로 한다. 단계 510의 수행과정은 상기 실시예 중의 단계 104를 참조할 수 있으므로 이에 대한 설명은 생략한다. 본 출원의 실시예에 따르면, 얼굴특징 데이터베이스 중 기존 얼굴특징의 총수가 비교적 작을 경우, 분류결과의 정확성을 높이기 위하여 얼굴특징 데이터베이스 중 모든 기존 얼굴특징에 대응하는 유형, 처리를 위한 얼굴특징 및 이웃한 얼굴특징 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정할 수 있다. 얼굴특징 데이터베이스 중 기존 얼굴특징의 총수가 비교적 클 경우, 이미지 분류의 실시간성을 높이기 위하여 얼굴특징 데이터베이스 중 부분 기존 얼굴특징에 대응하는 유형, 처리를 위한 얼굴특징 및 이웃한 얼굴특징 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정할 수 있다. 따라서 서로 다른 방식에 따라 처리를 위한 얼굴특징에 대응하는 유형을 결정하여 해당 방법의 적용성을 향상시킬 수 있다. 본 출원의 실시예의 하나의 가능한 구현방식으로서, 군집하여 얻은 각 얼굴특징에 대응하는 유형이 비교적 정확 하므로 본 출원에서 군집 결과에 근거하여 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형을 업데이 트할 수 있고 따라서 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형에 대해 동적 보수（dynamic maintenance）를 실현하여 후속 분류결과의 정확성을 향상시킬 수 있다. 여기서 설명해야 할 바는, 얼굴특징에 대해 저장 시 저장량을 줄이기 위하여 기존 얼굴특징에 대해 양자화 (quantization) 압축, 디멘션 압축(Dimension compression) 또는 비트 넘버 압축을 진행하여 압축 후의 기존 얼굴특징을 저장할 수 있다. 대응되게 신규 처리를 위한 얼굴특징을 획득 후 신규 처리를 위한 얼굴특징에 대해 같은 압축 방식으로 압축하여 신규 처리를 위한 얼굴특징과 기존 얼굴특징사이의 압축방식의 일치성을 확보하여 분류결과 또는 분류결과의 정확성을 향상시킬 수 있다. 상기 내용을 종합하여 말하면, 본 출원에서 신규의 처리를 위한 얼굴특징을 획득 시 최근접 이웃 알고리즘 또는 최근접 이웃 알고리즘과 유사한 알고리즘을 적용하여 얼굴특징 데이터베이스 중 기존 얼굴특징에서 처리를 위한 얼굴특징과 근접한 복수의 기존 얼굴특징을 획득하고, 인접한 복수의 기존 얼굴특징의 유형에 근거하여 처리를 위한 얼굴특징의 유형을 결정하며 결정결과를 제1결과로 한다. 여기서, 기존 얼굴특징 중 처리를 위한 얼굴특징 과 근접한 복수의 기존 얼굴특징을 획득하지 못할 경우 신규 얼굴특징을 신규 유형으로 한다. 이어서 주기적 알고리즘의 트리거 조건(시간 역치, 주기적 군집화 처리를 하지 않는 얼굴특징의 수)을 만족 여 부를 판단하고, 트리거 조건을 만족할 경우 트리거 조건에 근거하여 점진적 군집 또는 전량 군집 진행 여부를결정하고, 점진적 군집 진행을 결정할 경우 처리를 위한 얼굴특징 및 샘플링하여 얻은 복수의 기존 얼굴특징을 군집화하여 제2결과를 생성한다. 전량 군집 진행을 결정할 경우, 처리를 위한 얼굴특징 및 모든 기존 얼굴특징 을 군집화하여 제3결과를 생성한다. 따라서, 상기 제1결과, 제2결과 및 제3결과 중 적어도 하나의 결과 및 취합전략에 근거하여 처리를 위한 얼굴특 징의 유형을 결정하고 각 기존 얼굴특징의 유형을 업데이트한다. 여기서, 취합전략은 제3결과를 기준으로 제2결과 및 제1결과를 보조로 할 수 있다. 다시 말해서, 임의의 처리를 위한 얼굴특징에 있어서 만약 제3결과가 존재한다면 제3결과에 근거하여 해당 처리를 위한 얼굴특징의 유형을 결정한다. 만약 제3결과가 존재하지 않는다면 제2결과에 근거하여 해당 처리를 위한 얼굴특징의 유형을 결정한 다. 만약 제2결과가 존재하지 않는다면 제1결과에 근거하여 해당 얼굴특징의 유형을 결정한다. 여기서, 본 출원에 따르면 최근접 이웃 알고리즘 및 최근접 이웃 알고리즘과 유사한 알고리즘에 대해 특별히 한 정하지 아니하는바, 구체적은 사용환경에 근거하여 제일 적합한 알고리즘을 결정할 수 있다. 예를 들어, 얼글특 징 데이터베이스 중 10억개 이상의 기존 얼굴특징이 있을 경우, 역 인덱스((Inverted Index)의 벡터 양자화 (vector quantization) 알고리즘(IVFPQ)을 기초하여 인덱스의 저장공간 및 조회효율을 낮출 수 있고, 얼굴특징 데이터베이스 중 기존 얼굴특징의 개수가 만단위 레벨일 경우, Flat알고리즘을 사용하여 인덱스 구축 원가를 절 감할 수 있으며 이런 유형의 알고리즘은 통상적으로 초 단위급의 조회결과 피드백을 실현할 수 있다. 따라서, 대규모 군집 환경(예를 들어 십억개 클러스터 센터 규모의 수량급)에 적용하여 산업화 양산환경에서의 얼굴 군 집화 수요를 만족시킬 수 있다. 여기서, 점진적 군집 알고리즘은 신규 처리를 위한 얼굴특징을 제일 적합한 기존 클러스터에 분배하고 매칭도가 떨어지는 얼굴특징은 새로운 클러스터 및 대응하는 유형을 생성한다. 전량 군집 알고리즘은 사용자의 전량 데이 터를 로딩하여 스탠드 얼로운 또는 분산식 방법에서 군집 알고리즘을 수행하고 이전의 군집 결과를 수정할 수 있다. 여기서, 기존 얼굴특징 수의 스케일에 근거하여 최근접 이웃 알고리즘을 선택할지 근사 최근접 이웃을 선택할지 결정할 수 있다. 예를 들어, 수의 스케일이 큰 경우 근사 최근접 이웃을 적용하고; 수의 스케일이 작은 경우 최 근접 이웃 알고리즘을 선택한다. 여기서, 근사 최근접 이웃 중 수의 스케일에 근거하여 구체적인 인텍수 구축 및 인덱스 전략을 선택할 수 있다. 일 예로서, 본 출원의 시스템 구조는 도 6에서 표시한 바와 같이, 실시간 군집 모듈은 신규 특징 데이터 흐름 중에서 실시간으로 사용자의 신규 데이터를 판독하고 근사 최근접 이웃(Approximate Nearest Neighbor, ANN이라 약칭) 인덱스를 사용하여 신규 얼굴특징이 속하는 클러스터 및 해당 클러스터에 대응하는 유형을 예측할 수 있 다. 여기서, ANN인덱스는 개체 저장 시스템(object storage system) 중에 저장될 수 있고 사용 시 캐시 서비스 (cache service;)를 이용하여 캐시 재사용(Cache reuse)을 진행하여 객체 저장 시스템의 판독 스트레스를 낮춘 다. 주기성 군집 모율은 주기적으로 신규 특징 데이터 흐름 중으로부터 사용자 데이터를 판독하여 지정된 군집 알고 리즘을 작동하고 결과를 군집결과 취합모듈로 발송할 수 있다. 여기서, 주기성 군집 모듈은 서로 다른 트리거 주기를 설정하고 복수 세트의 주기성 군집 서비스를 배치할 수 있다. 예를 들어, 30분의 트리거 규칙에 따라 한 세트의 점진적 군집 서비스를 배치하고 동시에 한세트의 매일 저피크 구간에서 수행하는 전량 군집 서비스를 배 치할 수 있다. 또한, 주기성 군집 모듈은 군집화 전에 객체 저장 시스템 중으로부터 클러스터 센터 묘사를 로딩 하여 군집화가 결속 후 클러스터 센터 묘사 및 ANN 인덱스를 업데이트한다. 군집결과 취합모듈은 실시간 군집 모듈 및 주기성 군집 모듈이 생성하는 결과를 처리하고 두 모듈이 생성하는 결과에 대해 취합하여 사용자에게 디스플레이할 수 있다. 여기서, 사용자에게 디스플레이하는 결과는 주기성 군 집결과를 기준하고 실시간 군집 결과를 보조로 하며 주기성 군집결과가 없을 경우 사용자에게 실시간 군집 결과 를 디스플레이한다. 종래기술에서 사용자가 간헐적으로 얼굴이미지를 업로드하는 환경에 있어서 아래와 같은 두가지 모델을 이용하 여 업로드한 얼굴이미지에 대해 군집화를 실현하고 해당 얼굴이미지에 대응하는 유형을 얻을 수 있다. 첫번째 모델은FDM(Full Data Model, 풀데이터 모델）로서 매회 군집화 시 해당 사용자의 모든 이미지를 판독하 고 해당 사용자의 모든 이미지와 새로 업로드한 얼굴이미지를 군집화한다. 예를 들어, DBSCAN（Density-Based Spatial Clustering of Applications with Noise, 밀도에 기초한 군집 알고리즘）、BIRCH（Balanced Iterative Reducing and Clustering Using Hierarchies, 평행 반복삭감 군집 알고리즘）、CURE（Clustering UsingRepresentatives, 층차 군집 알고리즘）등 알고리즘에 기초하여 이미지에 대해 군집화 처리를 하여 복수의 얼굴 그룹 및 매 그룹의 유형을 얻을 수 있다. 두번째 모델은PDM(Part Data Model, 부분 데이터 모델)로서 매회 군집화 후 이미지에 대해 분획하거나 샘플링하 여 부분 이미지를 선택하고 신규 이미지를 군집화한다. 여기서, 샘플링 방법은 시간에 따라 샘플링 또는 특정 샘플 알고리즘을 포함할 수 있고, 특정 샘플링 알고리즘은 증량DBSCAN, 증량식CURE, COBWEB(통계학에 기초한 군 집 알고리즘) 등 샘플링 알고리즘을 포함할 수 있다. 그러나 첫번째 모델에 있어서 이미지의 개수가 비교적 많을 경우 1개 또는 복수개의 이미지 특징이 새로 증가할 때마다 전부 다시 군집화하여야 하므로 군집화 원가 지출이 엄청나게 크고 타임 딜레이(time-delay)현상도 아주 많다. 두번째 모델에 있어서 샘플링 방법으로 군집화를 진행하여 군집화 결과의 정확도에 영향을 끼친다. 일 예로서, 도면 7을 참조하면, gdl+cure알고리즘은Graph Degree Linkage에 기초한 층차 군집 알고리즘으로CURE 알고리즘 중의 데이터 샘플링과 증량 합병방식을 사용하였다. gdl-full는 Graph Degree Linkage에 기초한 층차 군집 알고리즘으로 군집화 시 이전의 모든 기존 데이터를 이용하여 다시 군집화하고, knn-full은 특징 유사도의 KNN(k개의 최근접 이웃)관계에 기초하여 클라스 클라스터(?族)를 분획하는 군집 알고리즘으로서 gdl알고리즘의 간편버전이다. 도 7에 표시한 바와 같이, 이미지에 대해 샘플링 후 점진적 군집 알고리즘(gdl+cure)의 군집효과(pairwise f1score)는 샘플링 횟수에 따라 증가하고 전량 이미지를 이용하여 다시 군집화한 전량 군집 알고리즘(gdl- full)보다 현저히 낮으며 이미지 수량의 증가에 따라 지속적으로 감소한다. 비록 종래기술에서 특정의 알고리즘, 예를 들어 증량DBSCAN알고리즘을 사용하여 이미지에 대해 목적성있는 분획 을 진행하여 풀 데이터 모델 하에서 군집화하는 것과 등가의 효과를 실현할 수 있으나 해당 특정 알고리즘은 군 집화의 지출을 증가하고 특정의 알고리즘에만 사용가능하여 적용성이 높지 않다. 본 출원에 따르면, 여러 종류의 얼굴 군집 알고리즘, 예를 들어ANN 실시간 군집 알고리즘과 주기성 군집 알고리 즘을 종합하여 사용하여 구체적인 알고리즘과의 디컬플링(decoupling)을 실현함과 동시에 타임 딜레이를 단축하 고 실시간 군집 알고리즘의 원가를 현저히 낮추어 시효성, 효과, 원가의 총체적인 최적화에 도달할 수 있다. 동 시에 해당 방법은 임의의 기존 알고리즘 또는 후속적으로 제출할 수 있는 신규의 군집 알고리즘에 적용할 수 있 어 해당 방법의 적용성도 높일 수 있다. 여기서 설명해야 할 바는, 비록 종래기술의 점진적 알고리즘(앞에서 언급한gdl+cure알고리즘)의 수행 주기를 단 축하여 이미지 분류의 실시간성을 향상시킬 수 있으나 해당 방법은 시스템의 계산량을 증가시킨다. 일 예로서, 표 1을 참조하면, 본 출원에서 ANN+점진적 군집 방법을 사용하여 점진적 군집 알고리즘의 수행 주기 를 직접적으로 단축하여 시효성을 높이는 방법에 비해, 수행의 복잡성을O(N^2)에서O(N)으로의 선행 복잡도로 단 축시켰다. 또한 실시간 군집 모듈이 빈번히 클러스터 센터 또는 ANN 인덱스 판독 시의 판독 대역폭의 지출을 줄 여O(N*D)에서 O(N*M*log2(K))으로 줄였으며 효과가 변하지 않는 상황에서 대역폭 지출을 16배까지 줄일 수 있다. 여기서 점진적 알고리즘은 GDL+CURE 알고리즘을 예로 진행한다. 여기서, D는 특정 벡터의 디멘션이고, M는 ANN알고리즘 압축 후 벡터 디멘션이며, log2(K)는 매개 디멘션 압축 후의 비트수이고, N은 얼굴특징의 수이며, K는 ANN알고리즘 중의Product Quantization을 이용하여 압축 후의 매 개 디멘션치의 개수, M은 ANN 알고리즘 중 Product Quantization을 이용하여 압축 후의 디멘션 수이다. 표 1 방안 효과 시효 계산 능력 저장 방안 1: GDL단축주기손실 있음 분 단위 레벨, 원가 가 비교적 높음, 분 단위 내로 단축 시 원가가 용납할 수 없 게 됨.O(N^2) 군집 횟수에 근접함, 배등하여 증가함, 5 배 이상 증가할 것으 로 예상됨O(N*D) 군집 회수와 관련됨, 입력과 출력이 5배로 확대될 것으로 예성됨, 무효 데이터 도 5배로 확대됨.방안 2: 실시간 ANN+주기성 GDL손실없음 초 단위 레벨 ANN예측:O(DK+NM, 및 N 선형 관련, 지출이 적음, ANN인덱스 업 데이트 : O(M*K), 상 수 례벨O(N*M*log2(K)) ANN는 저장에 대해 압축 가능, M의 수치 범위는 1~D이고, 서 로다른 압축도에 대응 하여 증량 업데이트를 지지하여 출력 확대를 피함. 일 예로서, 도 8은 특정 벡터(128 디멘션, int32)가 서로 다른 압축도하에서 클러스를 배분하는 정확도 (precision) 및 예측수(predict percent)를 제시하고 있는바, PQ32를 사용하여 압축 후(32 디멘션, int8) 정확 도 및 예측수가 압축하지 않는 Flat와 기본적으로 같음을 보아낼 수 있다. PQ32는 초기화 벡터와 비교하여 16배 압축되었다. 여기서, 도 8의 Flat알고리즘은 압축하지 않고 직접 정장하며 PCAR, SQ, PQ는 모두 종래의 압축 알 고리즘이고 압축 알고리즘 사용 후 저장 하였다. 상기 내용을 종합하면, 임의의 단독 군집 알고리즘과 비교하여, 본 방안은 최종적으로 사용자에게 전량 군집 알 고리즘과 같은 효과를 제공할 수 있다. 또한 도 1에서 표시한 바와 같이, ANN인덱스를 이용한 선행 조회 지출의 장점은 초 단위 레벨의 분류 타임 딜레이까지 실현할 수 있다. 따라서 원래의 30분을 초 단위로 줄이고 동시에 계산 원가를 제곱 복잡성에서 선형 복잡성으로 감축하며 저장한 대역폭의 지출을 16배 줄이는 것을 실현할 수 있다. 상기 실시예를 실현하기 위하여, 본 출원은 얼굴이미지의 분류 장치를 제공한다. 도 9는 본 출원의 실시예에 따른 얼굴이미지의 분류장치의 구조 예시도이다. 도 9에서 표시한 바와 같이, 해당 얼굴이미지의 분류장치는 획득모듈, 추출모듈, 처리모듈 및 제1결정모듈을 포함한다. 여기서, 획득모듈은 처리를 위한 얼굴이미지를 획득한다. 추출모듈은 얼굴이미지에 근거하여 얼굴이미지 중 처리를 위한 얼굴특징을 추출한다. 처리모듈은 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 처리를 위한 얼굴특 징, 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 제1결정모듈은 처리를 위한 얼굴특징에 근거하여 대응하는 얼굴이미지의 유형을 결정한다. 본 출원 실시예의 하나의 가능한 구현방식으로서, 해당 얼굴이미지의 분류장치은 업데이트 모듈, 군집모듈 및 제2결정모듈을 더 포함할 수 있다. 업데이트 모듈은, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 처리를 위한 얼굴 특징을 얼굴특징 데이터베이스 중에 업데이트한다. 군집모듈은, 얼굴특징 데이터베이스 중 기존 얼굴특징을 군집화하여 군집 결과를 획득한다. 제2결정모듈은, 군집 결과에 근거하여 처리를 위한 얼굴특징에 대응하는 얼굴이미지 유형을 결정한다. 하나의 가능한 구현방식으로서, 트리거 조건은 글로벌 군집 시점에 도달하는 것을 포함하고, 군집모듈은 글로벌 군집 시점에 도달할 경우 얼굴특징 데이터베이스 중 모든 기존 얼굴특징을 군집화하여 군집 결과를 획득한다. 하나의 가능한 구현방식으로서, 군집모듈은 구체적으로, 얼굴특징 데이터베이스 중 임의의 2개의 기존 얼굴특징 사이의 유사도를 획득하고; 얼굴특징 데이터베이스 중 각 기존 얼굴특징과 대응하는 유사도가 가장 높은 기존 얼굴특징을 군집화하여 복수의 군집 조합을 얻으며; 얼굴특징 데이터베이스 중 임의의 2개 기존 얼굴특징사이의 유사도에 근거하여 임의의 2개 군집 조합사이의 거리를 결정하고; 각 군집 조합과 대응하는 거리가 가장 근접하 고 또 최근접 거리가 미리 설정된 거리 역치이하인 군집 조합을 군집화하여 복수의 군집후 조합을 얻으며 복수 의 군집후 조합 중 임의의 2개의 군집후 조합사이의 거리가 미리 설정된 거리 역치이상일 때까지 군집과정을 반 복하며; 각 군집후 조합 중 기존 얼굴특징에 근거하여 복수의 군집후 조합 중 각 군집후 조합에 대응하는 유형 을 결정하고; 복수의 군집후 조합 및 각 군집후 조합에 대응하는 유형을 군집 결과로 결정한다. 하나의 가능한 구현방식으로서, 업데이트모듈은 구체적으로, 처리를 위한 얼굴특징에 대해 비군집표기하고 표기 처리 후의 처리를 위한 얼굴특징을 얼굴특징 데이터베이스 중에 업데이트한다. 트리거 조건은 또 로컬 클러스터 서브 컨디션을 포함하고, 로컬 클러스터 서브 컨디션은, 얼굴특징 데이터베이 스 중 표기를 구비하는 제1 기존 얼굴특징의 획득 시점차이값이 미리 설정된 시간길이보다 큰것 및 얼굴특징 데 이터베이스 중 표기를 구비하는 제1 기존 얼굴특징의 수가 제1수역치이상인 것 중 적어도 하나를 포함한다. 군집모듈은 구체적으로, 얼굴특징 데이터베이스가 로컬 클러스터 서브 컨디션을 만족하고 글로벌 군집 시점에 도달하지 못할 경우, 얼굴특징 데이터베이스 중 표기를 구비하지 않는 제2 기존 얼굴특징을 샘플링하고; 샘플링 하여 얻은 제2 기존 얼굴특징 및 얼굴특징 데이터베이스 중 표기를 구비하는 제1 기존 얼굴특징에 대해 군비화 하여 군집 결과를 획득한다. 본 출원 실시예의 하나의 가능한 구현방식으로서, 해당 얼굴이미지의 분류장치은 제거모듈을 더 포함한다. 제거모듈은 얼굴특징 데이터베이스 중의 표기를 구비하는 제1 기존 얼굴특징에 대해 표기 제거 처리를 한다. 하나의 가능한 구현방식으로서, 처리모듈은 구체적으로, 얼굴특징 데이터베이스 중 기존 얼굴특징의 총수 를 획득하고; 총수가 제2수 역치이하인 경우, 처리를 위한 얼굴특징과 얼굴특징 데이터베이스 중 각 기존 얼굴 특징사이의 유사도를 획득하고 유사도에 따라 각 기존 얼굴특징에 대해 배열하며; 앞에 배열된 제3 예정수의 기 존 얼굴특징에 대응하는 유형에 근거하여 처리를 위한 얼굴특징에 대응하는 유형을 결정한다. 다른 가능한 구현방식으로서, 처리모듈은 구체적으로, 총수가 제2 수역치보다 큰 경우, 얼굴특징 데이터베 이스를 샘플링하고 샘플링하여 얻은 기존 얼굴특징을 획득하거나; 또는 얼굴특징 데이터베이에 대응하는 유사도 검색 인덱스를 샘플링하고 샘플링하여 얻은 검색 인덱스 중의 기존 얼굴특징을 샘플링하여 얻은 기존 얼굴특징 으로 결정하며; 처리를 위한 얼굴특징과 샘플링하여 얻은 기존 얼굴특징사이의 유사도를 획득하고 유사도에 따 라 샘플링하여 얻은 기존 얼굴특징에 대해 배열하고; 앞에 배열된 제4 예정수의 기존 얼굴특징에 대응하는 유형 을 얼굴특징에 대응하는 유형으로 결정한다. 하나의 가능한 구현방식으로서, 업데이트모듈은 또한 처리를 위한 얼굴특징 및 대응하는 유형을 얼굴특징 데이 터베이스 중에 업데이트한다. 다른 가능한 구현방식으로서, 업데이트모듈은 또한 군집 결과에 근거하여 얼굴특징 데이터베이스 중 기존 얼굴 특징에 대응하는 유형을 업데이트한다. 하나의 가능한 구현방식으로서, 처리를 위한 얼굴특징 및 얼굴특징 데이터베이스 중의 기존 얼굴특징은 양자화 압축 또는 디멘션 압축 후의 얼굴특징이다. 여기서 설명해야 할 바는, 상기 도 1 내지 도 8의 실시예에서 얼굴이미지의 분류방법에 대한 해석설명은 해당 실시예의 얼굴이미지의 분류장치에도 적용되므로 이에 대한 설명은 생략한다. 본 출원의 실시예에 따른 얼굴이미지의 분류장치는 획득한 처리를 위한 얼굴이미지에 대해 특징 추출은 진행하 여 처리를 위한 얼굴특징을 얻고, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 처 리를 위한 얼굴특징, 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합하여 처리를 위한 얼굴특징에 대응하는 유형을 결정하며, 처리를 위한 얼굴특징에 대응하는 유형을 얼굴이 미지의 유형으로 결정한다. 따라서, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 이웃한 얼굴특징 알고리즘을 통해 처리를 위한 얼굴특징에 대응하는 유형을 결정하고 군집 알고리즘을 통할 필 요없이 처리를 위한 얼굴특징에 대응하는 유형을 결정하기에 계산량을 줄이고 이미지 분류의 효율을 높이며 따 라서 얼굴이미지 분류의 실시간성을 향상시킬 수 있다. 본 출원의 실시예에 따르면, 본 출원은 전자기기 및 판독 가능한 저장매체를 더 제공한다. 도 10이 표시하는 것은 본 출원 실시예에 따른 얼굴이미지의 분류방법의 전자기기의 블록도이다. 전자기기는 여 러가지 형식의 디지털 컴퓨터를 가리키는데, 예를 들어, 랩탑 컴퓨터, 데스크탑 컴퓨터, 워크스테이션, 개인용 정보 단말기, 서버, 블레이드 서버, 메인프레임 컴퓨터, 및 다른 적절한 컴퓨터일 수 있다. 전자기기는 또한 개 인 디지털 프로세싱, 셀룰러 전화기, 스마트 폰, 웨어러블 장치, 및 다른 유사한 컴퓨팅 장치와 같은 다양한 형 태의 모바일 장치를 나타낼 수도 있다. 본 명세서에 나타낸 부품, 그들의 연결 및 관계, 및 그들의 기능은 단지 예시적인 것이며, 본 명세서에 설명 및/또는 청구된 본 발명의 구현을 한정하도록 의도되지 않는다. 도 10에서 표시한 바와 같이, 전자 설비는 하나 또는 복수의 프로세서, 메모리, 및 고속 인터페이 스 및 저속 인터페이스를 포함하는 각 부품을 연결하기 위한 인터페이스를 포함한다. 각 부품은 상이한 버스를이용하여 상호 연결되고, 공통 마더보드 상에 장착되거나 또는 필요에 따라 다른 방식으로 장착될 수도 있다. 프로세서는 전자기기 내에서 실행되는 명령을 프로세싱할 수 있고, 외부 입력/출력 장치(예를 들어, 인터페이스 에 결합된 디스플레이 장치) 상에 GUI의 그래픽 정보를 디스플레이하기 위해 메모리 또는 메모리 상에 저장된 명령을 포함한다. 다른 실시예에서, 필요에 따라 복수의 프로세서 및/또는 복수의 버스를 복수의 메모리와 함께 사용할 수 있다. 또한, 복수의 전자기기를 연결할 수 있고, 각 기기는 필요한 동작의 일부를 제공할 수 있다 (예를 들어, 서버 어레이, 한 그룹의 블레이드 서버의 세트 또는 멀티 프로세서 시스템). 도 10에서는 하나의 프로세서를 예로 든다. 메모리는 본 발명에서 제공하는 비일시적 컴퓨터 판독가능 저장 매체이다. 상기 메모리에는 적어도 하나 의 프로세서에 의해 실행가능한 명령이 저장되고, 상기 적어도 하나의 프로세서가 본 발명에서 제공하는 얼굴이 미지의 분류방법을 저장하는 방법을 수행하게 한다. 본 발명의 비일시적 컴퓨터 판독가능 저장 매체에는 컴퓨터 가 본 발명에서 제공하는 얼굴이미지의 분류방법을 실행하게 하기 위한 컴퓨터 명령이 저장된다. 메모리는 비일시적 컴퓨터 판독가능 저장 매체로서, 본 발명의 실시예에 따른 얼굴이미지의 분류방법에 대응하는 프로그램 명령/모듈(예를 들어, 도 9에 도시된 획득모듈, 추출모듈, 처리모듈, 및 제1 결정모듈)와 같은 비일시적 소프트웨어 프로그램, 비일시적 컴퓨터 실행가능 프로그램 및 모듈을 저장하는 데 사용될 수 있다. 프로세서는 메모리에 저장된 비일시적 소프트웨어 프로그램, 명령 및 모듈을 실행함으로써 서버의 다양한 기능 애플리케이션 및 데이터 처리를 실행하며, 즉 전술한 방법의 실시예에서 제공 하는 얼굴이미지의 분류방법을 구현한다. 상기 메모리는 또 프로그램 저장영역 및 데이터 저장영역을 포함할 수 있으며, 여기서, 프로그램 저장영 역은 운영 체제, 적어도 하나의 기능에 필요한 애플리케이션 프로그램을 저장할 수 있고, 데이터 저장영역은 얼 굴이미지의 분류방법에 따른 전자기기의 사용에 의해 생성된 데이터 등을 저장할 수 있다. 또한, 메모리 는 고속 랜덤 액세스 메모리를 포함할 수 있고, 또한 적어도 하나의 자기 디스크 저장 장치, 플래시 메모리 장 치, 또는 다른 비일시적 솔리드 스테이트 저장 장치와 같은 비일시적 메모리를 포함할 수도 있다. 일부 실시예 에서, 메모리는 선택적으로 프로세서에 대해 원격으로 설치된 메모리를 포함할 수 있고, 당해 원격 메모리는 네트워크를 통해 전자기기에 연결될 수 있다. 이러한 네트워크의 예는 인터넷, 인트라넷, 로컬 영역 네트워크, 이동 통신 네트워크, 및 이들의 조합을 포함하지만, 이에 한정되지 않는다. 전자기기는 입력장치 및 출력장치를 더 포함할 수 있다. 프로세서, 메모리, 입력장치 , 및 출력장치는 버스 또는 다른 수단에 의해 연결될 수 있으며, 도 10에서 버스를 통한 연결이 예 시되어 있다. 입력장치는 입력된 숫자 또는 문자 정보를 수신할 수 있을 뿐만 아니라,전자기기의 사용자 설정 및 기능 제어에 관련된 키 신호 입력을 생성할 수 있으며, 예를 들어, 터치 스크린, 키패드, 마우스, 트랙패드, 터치패 드, 포인팅 스틱, 하나 또는 복수의 마우스 버튼, 트랙볼, 조이스틱 등과 같은 입력장치이다. 출력장치는 디스플레이 장치, 보조 조명 장치(예를 들어, LED), 및 햅틱 피드백 장치(예를 들어, 진동 모터)등을 포함할 수 있다. 당해 디스플레이 장치는 액정표시장치(LCD), 발광 다이오드(LED) 디스플레이, 및 플라즈마 디스플레이를 포함할 수 있지만, 이에 한정되지 않는다. 일부 실시방식에서, 디스플레이 장치는 터치 스크린일 수 있다. 본 출원의 실시예에 따르면, 컴퓨터 판독 가능 저장 매체에 저장되는 컴퓨터 프로그램을 더 제공한다. 당해 컴 퓨터 프로그램의 명령이 실행될 경우, 본 출원의 임의의 실시예의 얼굴이미지의 분류방법이 수행된다. 본 명세서에 기술된 시스템 및 기술의 다양한 실시방식은 디지털 전자 회로 시스템, 집적 회로 시스템, 전용 ASIC(특정 용도 지향 집적 회로), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합으로 구현될 수 있다. 이들 다양한 실시예는 하나 또는 복수의 컴퓨터 프로그램에서 구현하는 것을 포함할 수 있으며, 당해 하 나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그램 가능 프로세서를 포함하는 프로그램 가능한 시스템 상에서 실행 및/또는 해석될 수 있고, 이 프로그램 가능 프로세서는 전용 또는 일반 프로그램 가능 프로세서일 수 있으며, 저장 시스템, 적어도 하나의 입력장치, 및 적어도 하나의 출력장치로부터 데이터 및 명령을 수신하 고, 데이터 및 명령을 당해 저장 시스템, 적어도 하나의 입력장치, 및 적어도 하나의 출력장치에 송신할 수 있 다. 이들 컴퓨팅 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션, 또는 코드로 또한 지칭됨)은 프로그램 가능 프로세서의 기계 명령을 포함하며, 하이 레벨 절차 및/또는 객체 지향 프로그래밍 언어, 및/또는 어셈블리 /기계 언어로 구현될 수 있다. 본 명세서에서 사용되는 바와 같이, “기계 판독가능 매체”및 “컴퓨터 판독가능 매체”라는 용어는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서에 제공하기 위한 임의의 컴퓨터 프 로그램 제품, 디바이스, 및/또는 장치(예를 들어, 자기 디스크, 광 디스크, 메모리, 프로그래머블 논리 소자 (PLD))를 지칭하며, 기계 판독 가능 신호인 기계 명령을 수신하기 위한 기계 판독가능 매체를 포함한다. “기계 판독 가능 신호”라는 용어는 기계 명령 및/또는 데이터를 프로그램 가능 프로세서에 제공하는데 사용되는 임의 의 신호를 지칭한다. 사용자와의 대화를 제공하기 위해, 본 명세서에서 설명된 시스템 및 기술을 컴퓨터 상에서 구현할 수 있으며, 당해 컴퓨터는 사용자에게 정보를 디스플레이하기 위한 디스플레이 장치(예를 들어, 음극선관(CRT) 또는 액정표 시장치(LCD) 모니터), 및 키보드 및 포인팅 장치(예를 들어, 마우스 또는 트랙볼)을 가지고, 사용자는 당해 키 보드 및 당해 포인팅 장치를 통해 컴퓨터에 입력을 제공할 수 있다. 다른 종류의 장치도 사용자와의 대화를 제 공하기 위해 사용될 수 있으며, 예를 들어, 사용자에게 제공되는 피드백은 임의의 형태의 감각 피드백(예를 들 어, 시각적 피드백, 청각적 피드백, 또는 촉각적 피드백) 일 수 있고, 임의의 형태(음향 입력, 음성 입력, 또는 촉각 입력을 포함함)로 사용자로부터의 입력을 수신할 수 있다. 본 명세서에서 설명된 시스템 및 기술은 백그라운드 컴포넌트를 포함하는 컴퓨팅 시스템(예를 들어, 데이터 서 버), 또는 미들웨어 컴포넌트를 포함하는 컴퓨팅 시스템 (예를 들어, 애플리케이션 서버), 또는 프론트 엔드 컴 포넌트를 포함하는 컴퓨팅 시스템(예를 들어, 그래픽 사용자 인터페이스 또는 웹 브라우저를 갖는 사용자 컴퓨 터이고, 사용자는 당해 그래픽 사용자 인터페이스 또는 웹 브라우저를 통해 본 명세서에 기술된 시스템 및 기술 의 실시예와 대화할 수 있다), 또는 이러한 백그라운드 컴포넌트, 미들웨어 컴포넌트 또는 프론트 엔드 컴포넌 트의 임의의 조합을 포함하는 컴퓨팅 시스템에서 구현될 수 있다. 시스템의 컴포넌트는 임의의 형태 또는 매체 의 디지털 데이터 통신(예를 들어, 통신 네트워크)에 의해 상호 연결될 수 있다. 통신 네트워크의 예는 근거리 통신망(LAN), 광역통신망(WAN) 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 떨어져 있으며, 통상적으로 통신 네트워크를 통해 대화한다. 클라이언트와 서버 사이의 관계는 대응하는 컴퓨터 상에서 실행되 고 서로 클라이언트-서버 관계를 갖는 컴퓨터 프로그램에 의해 생성된다. 서버는 클라우드 서버, 즉 클라우드 컴퓨팅 서버 또는 클라우드 호스팅일 수 있고, 이는 클라우드 컴퓨팅 시스템 중의 하나의 호스팅 제품으로 종래 의 물리적 호시팅과 VPS서비스 중 관리 난이도가 크고 업무 확충성이 떨어지는 단점을 해결하였다. 본 발명의 실시예에 따른 기술안은, 획득한 처리를 위한 얼굴이미지에 대해 특징 추출을 진행하여 처리를 위한 얼굴특징을 얻고, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만족하지 않을 경우, 상기 처리를 위한 얼굴특징, 상기 얼굴특징 데이터베이스 중 기존 얼굴특징에 대응하는 유형 및 이웃한 얼굴특징 알고리즘을 결합 하여 상기 처리를 위한 얼굴특징에 대응하는 유형을 결정하며, 상기 처리를 위한 얼굴특징에 대응하는 유형에 근거하여 상기 얼굴이미지의 유형을 결정한다. 따라서, 얼굴특징 데이터베이스가 미리 설정된 트리거 조건을 만 족하지 않을 경우, 이웃한 얼굴특징 알고리즘을 통해 상기 처리를 위한 얼굴특징에 대응하는 유형을 결정하고 군집 알고리즘을 통해 처리를 위한 얼굴특징에 대응하는 유형을 결정할 필요가 없기에 계산량을 줄이고 이미지 분류의 효율을 높이며 따라서 얼굴이미지의 분류의 실시간성을 향상시킬 수 있다. 전술한 다양한 형태의 흐름을 사용하여, 단계를 재배열, 부가 또는 삭제할 수 있다는 것을 이해해야 한다. 예를 들어, 본 발명에 기재된 각 단계는 본 발명에 개시된 기술안의 원하는 결과를 구현할 수 있는 한, 병렬로 또는 순서로 또는 상이한 순서로 수행될 수 있으며, 본 명세서에서는 한정하지 않는다. 상기 상세한 실시방식은 본 발명의 청구항을 한정하는 것으로 의도되지 않는다. 다양한 수정, 조합, 서브 조합, 및 대체가 설계 요건 및 다른 요인을 고려하여 이루어질 수 있다는 것은 당업자에게 명백할 것이다. 본 발명의 사상 및 원리 내에서 이루어진 임의의 수정, 동등한 교체, 및 개선 등은 본 발명의 청구 범위 내에 포함된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2021-0092245", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부된 도면은 본 발명의 해결방법을 보다 잘 이해하기 위해 사용되며, 본 발명을 한정하려 하지 않는다. 여기 서, 도 1은 본 출원의 실시예1에 따른 얼굴이미지 분류방법의 흐름도이다. 도 2는 본 출원의 실시예2에 따른 얼굴이미지 분류방법의 흐름도이다. 도 3은 본 출원의 실시예3에 따른 얼굴이미지 분류방법의 흐름도이다. 도 4는 본 출원의 실시예4에 따른 얼굴이미지 분류방법의 흐름도이다. 도 5는 본 출원의 실시예5에 따른 얼굴이미지 분류방법의 흐름도이다. 도 6은 본 출원의 실시예에 따른 시스템 구조의 예시도이다. 도 7은 군집 효과의 예시도이다. 도 8은 본 출원의 실시예 중 특성벡터(feature vector)가 다른 압축도하에서의 군집 분배 정확도 및 예측수의 예시도이다. 도 9는 본 출원의 실시예 6에 따른 얼굴이미지의 분류장치의 구조 예시도이다. 도 10은 본 출원의 실시예에 따른 얼굴이미지의 분류방법의 전자기기의 블록도이다."}
