{"patent_id": "10-2021-0127050", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0125447", "출원번호": "10-2021-0127050", "발명의 명칭": "차량 연계 방법, 차량 연계 장치, 노변 장치 및 클라우드 제어 플랫폼", "출원인": "아폴로 인텔리전트 커넥티비티", "발명자": "차오, 후어"}}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집하는 단계;미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정하는 단계;상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재 차량에 대한 각각의 관측점의타깃 관측 시퀀스를 확정하는 단계;상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이동일 차량인지 여부를 검출하는 단계; 를 포함하는 차량 연계 방법."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정하는 단계는, 상기 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 각각의 관측점이 각 영상을 수집할 때의 상기 현재 차량의 위치를 확정하는 단계;각각의 관측점이 각 영상을 수집할 때의 상기 현재 차량의 위치 및 각각의 관측점이 각 영상을 수집하는 시점에따라, 각 시점에서의 각각의 관측점의 관측 데이터를 확정하는 단계, 여기서, 상기 관측 데이터에 시점과 위치가 포함되며;각 시점에서의 각각의 관측점의 관측 데이터에 따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 얻는 단계; 를 포함하는 차량 연계 방법."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재 차량에 대한 각각의 관측점의타깃 관측 시퀀스를 확정하는 단계는, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스 중의 각 관측 데이터에 따라, 상기 현재 차량에 대한각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하는지 여부를 검출하는 단계;만약 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하면, 각 최초 관측 시퀀스중의 각 관측 데이터 중의 시점에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 대해캡쳐 처리를 실행하고, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 얻는 단계; 를 포함하는 차량 연계 방법."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이동일 차량인지 여부를 검출하는 단계는, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량의주행 궤적의 평균 길이 및 두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적을 각각 산출하는 단계;공개특허 10-2021-0125447-3-두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적 및 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의 평균 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 유사도를 산출하는 단계;두 관측점마다 관측한 상기 현재 차량의 유사도에 따라, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지여부를 검출하는 단계; 를 포함하는 차량 연계 방법."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량의주행 궤적의 평균 길이를 산출하는 단계는,현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에서 각 관측 데이터 중의 위치를 추출하는 단계;상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여 각 관측 데이터 중의 위치를 추출하고,각각의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이를 산출하는 단계;각각의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의주행 궤적의 평균 길이를 산출하는 단계; 를 포함하는 차량 연계 방법."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집하도록 구성되는 수집모듈;미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정하고; 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하도록 구성되는 확정 모듈;상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이동일 차량인지 여부를 검출하도록 구성되는 검출 모듈; 을 포함하는 차량 연계 장치."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 확정 모듈은, 상세하게, 상기 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 각각의관측점이 각 영상을 수집할 때의 상기 현재 차량의 위치를 확정하고, 각각의 관측점이 각 영상을 수집할 때의상기 현재 차량의 위치 및 각각의 관측점이 각 영상을 수집하는 시점에 따라, 각 시점에서의 각각의 관측점의관측 데이터를 확정하도록 구성되고, 여기서, 상기 관측 데이터에 시점과 위치가 포함되며, 각 시점에서의 각각의 관측점의 관측 데이터에 따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 얻는 차량 연계장치."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "상기 확정 모듈은, 상세하게, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스 중의 각 관측 데이터에따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하는지 여부를 검출하도록구성되고; 만약 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하면, 각 최초 관측 시퀀스 중의 각 관측 데이터 중의 시점에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 대해 캡쳐 처리를 실행하고, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 얻는 차량 연계 장치."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서, 상기 검출 모듈은, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량의주행 궤적의 평균 길이 및 두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적을 각각 산출하고, 두관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적 및 두 관측점마다 관측한 상기 현재 차량의 주행공개특허 10-2021-0125447-4-궤적의 평균 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 유사도를 산출하도록 구성되는 산출 서브 모듈;두 관측점마다 관측한 상기 현재 차량의 유사도에 따라, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지여부를 검출하도록 구성되는 검출 서브 모듈; 을 포함하는 차량 연계 장치."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 산출 서브 모듈은, 상세하게, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에서 각 관측 데이터 중의 위치를 추출하고, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여 각 관측 데이터 중의 위치를 추출하며, 각각의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이를 산출하고, 각각의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의평균 길이를 산출하도록 구성되는 차량 연계 장치."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "적어도 하나의 프로세서 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리가 포함되고; 여기서, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능하는 명령이 저장되어 있으며, 상기 명령이 상기적어도 하나의 프로세서에 의해 실행 시, 상기 적어도 하나의 프로세서가 제 1 항 내지 제 5 항 중의 어느 한항에 따른 차량 연계 방법을 구현하는 전자 디바이스."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨터 명령이 저장되어 있고, 상기 컴퓨터 명령에 의해 상기 컴퓨터가 제 1 항 내지 제 5 항 중의 어느 한 항에 따른 차량 연계 방법을 구현하는, 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "컴퓨터 프로그램이 포함되고, 상기 컴퓨터 프로그램이 프로세서에 의해 실행 시 제 1 항 내지 제 5 항 중의 어느 한 항에 따른 차량 연계 방법을 구현하는 컴퓨터 프로그램 제품."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 11 항에 따른 전자 디바이스를 포함하는 노변 장치."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 11 항에 따른 전자 디바이스를 포함하는 클라우드 제어 플랫폼."}
{"patent_id": "10-2021-0127050", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "컴퓨터 판독가능 저장 매체에 저장된 컴퓨터 프로그램에 있어서,상기 컴퓨터 프로그램 중의 컴퓨터 명령이 프로세서에 의해 실행될 경우, 제 1 항 내지 제 5 항 중 어느 한 항에 따른 방법을 구현하는, 컴퓨터 판독가능 저장 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2021-0127050", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량 연계 방법, 장치, 노변 장치 및 클라우드 제어 플랫폼을 개시하였고, 인공지능"}
{"patent_id": "10-2021-0127050", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관한 것으로, 상세하게는, 지능 교통기술에 관한 것이다. 실시하기 위한 구체적인 수단은: 각각의 관측점에 대해, 미 리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집하는 것; 미리 설정된 시간대 내에 각각의 관측 점이 수집한 영상에 기반하여, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정하는 것; 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확 정하는 것; 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차량이 동일한 차량인지 여부를 검출하는 것이다. 본 개시는 단일 프레임 영상의 비정상으로 인한 연계 착오를 효과적으 로 방지할 수 있으므로, 연계 성공률을 향상시킬 수 있다. 대 표 도 - 도1"}
{"patent_id": "10-2021-0127050", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2021-0125447 CPC특허분류 G06K 9/6215 (2013.01) G06T 2207/30241 (2013.01)명 세 서 청구범위 청구항 1 각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집하는 단계; 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최 초 관측 시퀀스를 확정하는 단계; 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하는 단계; 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하는 단계; 를 포함하는 차량 연계 방법. 청구항 2 제 1 항에 있어서, 상기 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점 의 최초 관측 시퀀스를 확정하는 단계는, 상기 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 각각의 관측점이 각 영상을 수집할 때 의 상기 현재 차량의 위치를 확정하는 단계; 각각의 관측점이 각 영상을 수집할 때의 상기 현재 차량의 위치 및 각각의 관측점이 각 영상을 수집하는 시점에 따라, 각 시점에서의 각각의 관측점의 관측 데이터를 확정하는 단계, 여기서, 상기 관측 데이터에 시점과 위치 가 포함되며; 각 시점에서의 각각의 관측점의 관측 데이터에 따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스 를 얻는 단계; 를 포함하는 차량 연계 방법. 청구항 3 제 1 항에 있어서, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하는 단계는, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스 중의 각 관측 데이터에 따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하는지 여부를 검출하는 단계; 만약 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하면, 각 최초 관측 시퀀스 중의 각 관측 데이터 중의 시점에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 대해 캡쳐 처리를 실행하고, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 얻는 단계; 를 포함하는 차량 연 계 방법. 청구항 4 제 1 항에 있어서, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하는 단계는, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의 평균 길이 및 두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적을 각각 산출하는 단 계;두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적 및 두 관측점마다 관측한 상기 현재 차량의 주 행 궤적의 평균 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 유사도를 산출하는 단계; 두 관측점마다 관측한 상기 현재 차량의 유사도에 따라, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하는 단계; 를 포함하는 차량 연계 방법. 청구항 5 제 4 항에 있어서, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의 평균 길이를 산출하는 단계는, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에서 각 관측 데이터 중의 위치를 추출하는 단계; 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여 각 관측 데이터 중의 위치를 추출하고, 각각의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이를 산출하는 단계; 각각의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의 평균 길이를 산출하는 단계; 를 포함하는 차량 연계 방법. 청구항 6 각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집하도록 구성되는 수집 모듈; 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최 초 관측 시퀀스를 확정하고; 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하도록 구성되는 확정 모듈; 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하도록 구성되는 검출 모듈; 을 포함하는 차량 연계 장치. 청구항 7 제 6 항에 있어서, 상기 확정 모듈은, 상세하게, 상기 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 각각의 관측점이 각 영상을 수집할 때의 상기 현재 차량의 위치를 확정하고, 각각의 관측점이 각 영상을 수집할 때의 상기 현재 차량의 위치 및 각각의 관측점이 각 영상을 수집하는 시점에 따라, 각 시점에서의 각각의 관측점의 관측 데이터를 확정하도록 구성되고, 여기서, 상기 관측 데이터에 시점과 위치가 포함되며, 각 시점에서의 각각 의 관측점의 관측 데이터에 따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 얻는 차량 연계 장치. 청구항 8 상기 확정 모듈은, 상세하게, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스 중의 각 관측 데이터에 따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하는지 여부를 검출하도록 구성되고; 만약 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하면, 각 최초 관 측 시퀀스 중의 각 관측 데이터 중의 시점에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀 스에 대해 캡쳐 처리를 실행하고, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 얻는 차량 연계 장치. 청구항 9 제 6 항에 있어서, 상기 검출 모듈은, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의 평균 길이 및 두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적을 각각 산출하고, 두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적 및 두 관측점마다 관측한 상기 현재 차량의 주행궤적의 평균 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 유사도를 산출하도록 구성되는 산출 서브 모 듈; 두 관측점마다 관측한 상기 현재 차량의 유사도에 따라, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하도록 구성되는 검출 서브 모듈; 을 포함하는 차량 연계 장치. 청구항 10 제 9 항에 있어서, 상기 산출 서브 모듈은, 상세하게, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에서 각 관측 데이터 중 의 위치를 추출하고, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여 각 관측 데이터 중 의 위치를 추출하며, 각각의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이를 산출하고, 각각의 관측점 에서 관측한 상기 현재 차량의 주행 궤적의 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의 평균 길이를 산출하도록 구성되는 차량 연계 장치. 청구항 11 적어도 하나의 프로세서 및 상기 적어도 하나의 프로세서와 통신 연결되는 메모리가 포함되고; 여기서, 상기 메모리에 상기 적어도 하나의 프로세서에 의해 실행 가능하는 명령이 저장되어 있으며, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행 시, 상기 적어도 하나의 프로세서가 제 1 항 내지 제 5 항 중의 어느 한 항에 따른 차량 연계 방법을 구현하는 전자 디바이스. 청구항 12 컴퓨터 명령이 저장되어 있고, 상기 컴퓨터 명령에 의해 상기 컴퓨터가 제 1 항 내지 제 5 항 중의 어느 한 항 에 따른 차량 연계 방법을 구현하는, 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독가능 저장 매체. 청구항 13 컴퓨터 프로그램이 포함되고, 상기 컴퓨터 프로그램이 프로세서에 의해 실행 시 제 1 항 내지 제 5 항 중의 어 느 한 항에 따른 차량 연계 방법을 구현하는 컴퓨터 프로그램 제품. 청구항 14 제 11 항에 따른 전자 디바이스를 포함하는 노변 장치. 청구항 15 제 11 항에 따른 전자 디바이스를 포함하는 클라우드 제어 플랫폼. 청구항 16 컴퓨터 판독가능 저장 매체에 저장된 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램 중의 컴퓨터 명령이 프로세서에 의해 실행될 경우, 제 1 항 내지 제 5 항 중 어느 한 항 에 따른 방법을 구현하는, 컴퓨터 판독가능 저장 매체에 저장된 컴퓨터 프로그램. 발명의 설명 기 술 분 야 본 개시는 인공지능 기술 분야에 관한 것으로, 상세하게는, 지능 교통기술, 특히 차량 연계 방법, 차량 연계 장 치, 노변 장치 및 클라우드 제어 플랫폼에 관한 것이다."}
{"patent_id": "10-2021-0127050", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량 연계는 현재 지능 교통 및 그와 관련된 기술에 있어서의 핵심적인 과제이다. 현실 환경에서 단지 하나의 관측점에 의해 피관측 차량의 전부 정보를 정확하게 얻을 수는 없다. 여러 방향과 여러 각도에서 수집되는 여러 관측점의 정보는 서로 다르므로, 여러 관측점에서 얻은 동일한 차량의 데이터를 결합하여 하나 차량의 각 방향또는 각종 각도의 고정확성 정보를 얻는 것이 극히 필요된다. 종래의 연계 방법의 대다수는 단일 프레임 영상에 기반하여 실행하나, 단일 프레임 영상에 한계가 있고, 상이한 관측점에서 수집한 영상을 정확하게 연계시킬 수 없어 연계 성공률이 비교적 낮다."}
{"patent_id": "10-2021-0127050", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 차량 연계 방법, 장치, 노변 장치 및 클라우드 제어 플랫폼을 제공함으로써, 단일 프레임 영상의 비 정상으로 인한 연계 착오를 효과적으로 방지할 수 있고, 이에 따라 연계 성공률을 향상시킬 수 있다."}
{"patent_id": "10-2021-0127050", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 제 1 측면에 따르면, 차량 연계 방법을 제공하되, 상기 방법은, 각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집하는 단계; 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최 초 관측 시퀀스를 확정하는 단계; 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하는 단계; 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하는 단계; 를 포함한다. 본 발명의 제 2 측면에 따르면, 차량 연계 장치를 제공하되, 상기 장치는, 각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집하도록 구성되는 수집 모듈; 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최 초 관측 시퀀스를 확정하고, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하도록 구성되는 확정 모듈; 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하도록 구성되는 검출 모듈; 을 포함한다. 본 발명의 제 3 측면에 따르면, 하나 또는 복수 개의 프로세서; 및 하나 또는 복수 개의 프로그램을 저장하는 메모리를 포함하는 전자 디바이스를 제공하되, 상기 하나 또는 복수 개의 프로그램이 상기 하나 또는 복수 개의 프로세서에 의해 실행 시 상기 하나 또는 복수 개의 프로세서에 의해 본 출원의 어느 한 실시예에서 서술된 차량 연계 방법을 구현한다. 본 발명의 제 4 측면에 따르면, 컴퓨터 프로그램이 저장되어 있는 저장 매체를 제공하되, 해당 프로그램이 프로 세서에 의해 실행 시 본 출원의 어느 한 실시예에서 서술된 차량 연계 방법을 구현한다. 본 발명의 제 5 측면에 따르면, 컴퓨터 프로그램 제품을 제공하되, 상기 컴퓨터 프로그램 제품이 컴퓨터 장치에 의해 실핼 시 본 출원의 어느 한 실시예에서 서술된 차량 연계 방법을 구현한다. 본 발명의 제 6 측면에 따르면, 본 출원의 실시예에서 서술된 상기 전자 디바이스를 포함하는 노변 장치를 제공 한다. 본 발명의 제 7 측면에 따르면, 본 출원의 실시예에서 서술된 상기 전자 디바이스를 포함하는 클라우드 제어 플 랫폼을 제공한다. 이해해야 할 것은, 본 부분에서 서술되는 내용은 본 발명의 실시예의 핵심 특징 또는 중요한 특징을 명시하려는 것이 아니며, 본 발명의 범위를 한정하려는 것도 아니다. 본 발명의 기타 특징은 아래의 명세서를 통해 용이하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0127050", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원에 따른 기술은, 종래 기술에서 단일 프레임 영상에 기반하여 연계를 실행하나, 단일 프레임 영상에 한 계가 있고, 상이한 관측점에서 수집한 영상을 정확하게 연계시킬 수 없어 연계 성공률이 비교적 낮은 기술적 과 제를 해결하였으며, 본 출원에 의해 제공되는 기술 수단에 의하면, 단일 프레임 영상의 비정상으로 인한 연계 착오를 효과적으로 방지할 수 있으므로, 연계 성공률을 향상시킬 수 있다."}
{"patent_id": "10-2021-0127050", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에 도면을 결합하여 본 발명의 예시적 실시예에 대해 설명하되, 여기서, 이해하기 쉽도록, 본 발명의 실시 예에 여러 가지 세부 내용이 포함되어 있으나, 단지 예시적인 것일 뿐이라는 것을 이해해야 한다. 이에 따라, 해당 분야 기술자라면 이해할 수 있는 바, 본 발명의 범위 및 기술적 사상을 벗어나지 않는 전제 하에, 본 명세 서에서 서술되는 실시예에 대해 각종 변경 및 수정을 실행할 수 있다. 마찬가지로, 명확하고 간명하게 서술하기 위하여, 아래의 서술은 공지된 기능 및 구조에 대한 서술을 생략한다. 실시예 1 도 1은 본 출원의 실시예에 의해 제공되는 차량 연계 방법의 제 1 흐름 개략도이고, 해당 방법은 차량 연계 장 치 또는 전자 디바이스 또는 노변 장치에 의해 실행될 수 있며, 해당 장치 또는 전자 디바이스 또는 노변 장치 는 소프트웨어 및/또는 하드웨어 형태로 구현될 수 있고, 해당 장치 또는 전자 디바이스 또는 노변 장치는 임의 의 네트워크 통신 기능이 있는 스마트 장치에 집적화될 수 있다. 도 1에서 도시한 바와 같이, 차량 연계 방법은 다음의 단계를 포함할 수 있다. 단계(S101)에서, 각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집한다. 본 단계에서, 각각의 관측점에 대해, 전자 디바이스는 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영 상을 수집할 수 있다. 본 출원에 있어서, 관측점은 여러 가지 영상 수집 장치, 예를 들면, 카메라, 비디오 카메 라 등일 수 있다. 상세하게는, 차량 주행 과정에서, 전자 디바이스는 미리 설정된 주기에 따라 해당 차량에 대 해 영상을 수집할 수 있되, 예를 들면, 수집하는 주파수는 60Hz일 수 있다. 단계(S102)에서, 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정한다. 본 단계에서, 전자 디바이스는 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정할 수 있다. 상세하게는, 전자 디바이스는 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 각각의 관측점이 각 영상을 수집할 때의 현재 차량의 위치를 확 정하고; 그 다음에 각각의 관측점이 각 영상을 수집할 때의 현재 차량의 위치 및 각각의 관측점이 각 영상을 수 집하는 시점에 따라, 각 시점에서의 각각의 관측점의 관측 데이터를 확정하며; 여기서, 관측 데이터에 시점과 위치가 포함되며; 나아가 각 시점에서의 각각의 관측점의 관측 데이터에 따라, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 얻는다. 단계(S103)에서, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관 측점의 타깃 관측 시퀀스를 확정한다. 본 단계에서, 전자 디바이스는 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정할 수 있다. 상세하게는, 전자 디바이스는 현재 차량에 대한 각 각의 관측점의 최초 관측 시퀀스 중의 각 관측 데이터에 따라, 현재 차량에 대한 각각의 관측점의 최초 관측 시 퀀스가 캡쳐 요건을 만족하는지 여부을 검출하고; 만약 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하면, 전자 디바이스는 각 최초 관측 시퀀스의 각 관측 데이터 중의 시점에 기반하여, 현재 차 량에 대한 각각의 관측점의 최초 관측 시퀀스에 대해 캡쳐 처리를 실행함으로써, 현재 차량에 대한 각각 관측점 의 타깃 관측 시퀀스를 얻는다. 단계(S104)에서, 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차 량이 동일한 차량인지 여부를 검출한다. 본 단계에서, 전자 디바이스는 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차량이 동일한 차량인지 여부를 검출할 수 있다. 상세하게는, 전자 디바이스는 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차량의 주행 궤적의 평균 길이 및 두 관측점마다 관측한 현재 차량의 주행 궤적 사이의 면적을 각각 산출하고; 그 다음에 두 관측점마다 관측한 현재 차량의 주행 궤적 사이의 면적 및 두 관측점마다 관측한 현재 차량의 주행 궤적의 평균 길이에 따라, 두 관측점 마다 관측한 현재 차량의 유사도를 각각 산출하며; 나아가 두 관측점마다 관측한 현재 차량의 유사도에 따라, 두 관측점마다 관측한 현재 차량이 동일한 차량인지 여부를 검출한다. 본 출원의 실시예에 의해 제공되는 차량 연계 방법은, 각각의 관측점에 대해, 우선 미리 설정된 주기에 따라 현 재 차량의 도로 상의 주행 영상을 수집하고; 그 다음에 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상 에 기반하여, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정하며; 이어서, 현재 차량에 대한 각각 의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하고; 나아가 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차량이 동일 한 차량인지 여부를 검출한다. 즉, 본 출원은 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여 차량 연계를 실행할 수 있다. 하지만, 기존의 차량 연계 방법에 있어서, 종래의 연계 방법은 대다수가 단일 프 레임 영상에 의해 실행된다. 본 출원은 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기초한 차량 연 계의 기술 수단을 사용함으로써, 종래 기술에서 단일 프레임 영상에 기반하여 연계를 실행하나, 단일 프레임 영 상에 한계가 있고, 상이한 관측점에서 수집한 영상을 정확하게 연계시킬 수 없어 연계 성공률이 비교적 낮은 기 술적 과제를 극복하였고, 본 출원에 의해 제공되는 기술 수단에 의하면, 단일 프레임 영상의 비정상으로 인한 연계 착오를 효과적으로 방지할 수 있으므로, 연계 성공률을 향상시킬 수 있고, 또한 본 출원의 실시예의 기술 수단은 실현하기 간단하고 편리하며, 보급하기 쉬워서, 적용 범위가 넓다. 실시예 2 도 2는 본 출원의 실시예에 의해 제공되는 차량 연계 방법의 제 2 흐름 개략도이다. 도 2에서 도시한 바와 같이, 차량 연계 방법은 다음의 단계를 포함할 수 있다. 단계(S201)에서, 각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집한다. 단계(S202)에서, 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 각각의 관측점이 각 영상 을 수집할 때의 현재 차량의 위치를 확정한다. 본 단계에서, 전자 디바이스는 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 각각의 관측 점이 각 영상을 수집할 때의 현재 차량의 위치를 확정할 수 있다. 상세하게는, 전자 디바이스는 미리 설정된 시 간대 내에 각각의 관측점이 수집한 영상에 대해 식별하되, 예를 들면, 전자 디바이스는 미리 설정된 시간대 내 에 각각의 관측점이 수집한 영상을 미리 학습시킨 영상 식별 모델에 입력하여, 해당 영상 식별 모델을 통해 각 각의 관측점이 각 영상을 수집할 때의 현재 차량의 위치를 확정할 수 있다. 단계(S203)에서, 각각의 관측점이 각 영상을 수집할 때의 현재 차량의 위치 및 각각의 관측점이 각 영상을 수집 하는 시점에 따라, 각 시점에서의 각각의 관측점의 관측 데이터를 확정하되, 여기서, 관측 데이터에 시점과 위 치가 포함된다. 본 단계에서, 전자 디바이스는 각각의 관측점이 각 영상을 수집할 때의 현재 차량의 위치 및 각각의 관측점이 각 영상을 수집하는 시점에 따라, 각 시점에서의 각각의 관측점의 관측 데이터를 확정할 수 있고, 여기서, 관측 데이터에는 시점과 위치가 포함된다. 상세하게는, 관측점 A에서 각 영상이 수집될 때의 현재 차량의 위치가 A1, A2, A3, 쪋., An이고, n은 1보다 크거나 같은 자연수라고 가정하면, A1은 관측점 A에서의 제 1 시점의 관측 데 이터를 나타내고, A2는 관측점 A에서의 제 2 시점의 관측 데이터를 나타내며, 이와 같이 유추한다. 단계(S204)에서, 각 시점에서의 각각의 관측점의 관측 데이터에 따라, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 얻는다. 단계(S205)에서, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관 측점의 타깃 관측 시퀀스를 확정한다. 단계(S206)에서, 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차 량이 동일한 차량인지 여부를 검출한다. 본 출원의 실시예에 의해 제공되는 차량 연계 방법은, 우선 각각의 관측점에 대해 미리 설정된 주기에 따라 현 재 차량의 도로 상의 주행 영상을 수집하고; 그 다음에 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상 에 기반하여, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정하며; 이어서, 현재 차량에 대한 각각 의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하며; 나아가 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차량이 동일 한 차량인지 여부를 검출한다. 즉, 본 출원은 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여 차량 연계를 실행할 수 있다. 하지만, 기존의 차량 연계 방법에 있어서, 종래의 연계 방법은 대다수가 단일 프 레임 영상에 기반하여 실행한다. 본 출원은 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여 차 량 연계를 실행할 수 있는 기술 수단을 사용함으로써, 종래 기술에서 단일 프레임 영상에 기반하여 결합을 실행 하나, 단일 프레임 영상에 한계가 있고, 상이한 관측점에서 수집한 영상을 정확하게 연계시킬 수 없어 연계 성 공률이 비교적 낮은 기술적 과제를 극복하였고, 본 출원에 의해 제공되는 기술 수단에 의하면, 단일 프레임 영 상의 비정상으로 인한 연계 착오를 효과적으로 방지할 수 있으므로, 연계 성공률을 향상시킬 수 있고, 또한 본 출원의 실시예의 기술 수단은 실현하기 간단하고 편리하며, 보급하기 쉬워서, 적용 범위가 넓다. 실시예 3 도 3은 본 출원의 실시예에 의해 제공되는 차량 연계 방법의 제 3 흐름 개략도이다. 도 3에서 도시한 바와 같이, 차량 연계 방법은 다음의 단계를 포함할 수 있다. 단계(S301)에서, 각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집한다. 단계(S302)에서, 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정한다. 단계(S303)에서, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관 측점의 타깃 관측 시퀀스를 확정한다. 본 단계에서, 전자 디바이스는 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정할 수 있다. 상세하게는, 전자 디바이스는 현재 차량에 대한 각 각의 관측점의 최초 관측 시퀀스 중의 각 관측 데이터에 따라, 현재 차량에 대한 각각의 관측점의 최초 관측 시 퀀스가 캡쳐 요건을 만족하는지 여부을 검출하고; 만약 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하면, 전자 디바이스는 각 최초 관측 시퀀스의 각 관측 데이터 중의 시점에 기반하여, 현재 차 량에 대한 각각의 관측점의 최초 관측 시퀀스에 대해 캡쳐 처리를 실행하고, 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스를 얻는다. 예를 들면, 관측점 A에 대하여, 수집한 최초 관측 시퀀스가 각각 A1, A2, A3, A4, A5, A6, A7, A8, A9, A10이고; 관측점 B에 대하여, 수집한 최초 관측 시퀀스가 각각 B7, B8, B9, B10이라고 가 정한다면, 본 단계는 관측점 A에서 수집한 최초 관측 시퀀스에 대해 캡쳐를 실행하여 A7, A8, A9, A10을 얻을 수 있고, 이에 따라 관측점 B에서 수집한 최초 관측 시퀀스와 정렬된다. 단계(S304)에서, 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차 량의 주행 궤적의 평균 길이 및 두 관측점마다 관측한 현재 차량의 주행 궤적 사이의 면적을 산출한다. 본 단계에서, 전자 디바이스는 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차량의 주행 궤적의 평균 길이 및 두 관측점마다 관측한 현재 차량의 주행 궤적 사이의 면적을 각 각 산출할 수 있다. 상세하게는, 전자 디바이스는 두 관측점마다 관측한 현재 차량의 주행 궤적의 평균 길이을 산출할 때, 먼저 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에서 각 관측 데이터 중의 위치를 추출하고; 그 다음에 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스 중의 각 관측 데이터 중의 위치에 기반하여, 각각 의 관측점에서 관측한 현재 차량의 주행 궤적의 길이를 산출하고; 그 다음에 각각의 관측점에서 관측한 현재 차 량의 주행 궤적의 길이에 따라, 두 관측점마다 관측한 현재 차량의 주행 궤적의 평균 길이를 산출할 수 있다. 예를 들면, 관측점 A에서 각 영상이 수집될 때의 현재 차량의 위치가 A1, A2, A3, 쪋, An이고, n은 1보다 크거 나 같은 자연수라고 가정하고; 관측점 B에서 각 영상이 수집될 때의 현재 차량의 위치가 B1, B2, B3, 쪋, Bm이 고, m이 1보다 크거나 같은 자연수라고 가정하면, 관측점 A에서 관측한 현재 차량의 주행 궤적의 길이는 dist(A1, A2, A3, 쪋, An)으로 나타낼 수 있고; 관측점 B에서 관측한 현재 차량의 주행 궤적의 길이는 dist(B1, B2, B3, 쪋, Bm)으로 나타낼 수 있으며; 관측점 A과 관측점 B에서 관측한 현재 차량의 주행 궤적의 평균 길이는 Length=[dist(A1, A2, A3, 쪋, An) + dist (B1, B2, B3, 쪋, Bm)]/2로 나타낼 수 있다 단계(S305)에서, 두 관측점마다 관측한 현재 차량의 주행 궤적 사이의 면적 및 두 관측점마다 관측한 현재 차량 의 주행 궤적의 평균 길이에 따라, 두 관측점마다 관측한 현재 차량의 유사도를 산출한다. 본 단계에서, 전자 디바이스는 두 관측점마다 관측한 현재 차량의 주행 궤적 사이의 면적 및 두 관측점마다 관 측한 현재 차량의 주행 궤적의 평균 길이에 따라, 두 관측점마다 관측한 현재 차량의 유사도를 산출할 수 있다. 상세하게는, 두 관측점마다 관측한 현재 차량의 주행 궤적 사이의 면적을 SA이라고 가정하고; 두 관측점마다 관 측한 현재 차량의 주행 궤적의 평균 길이를 Length이라고 가정하면, 전자 디바이스는 다음의 공식: Similarity=1-SA/(LengthХLength)에 의해 두 관측점마다 관측한 현재 차량의 유사도를 산출할 수 있다. 단계(S306)에서, 두 관측점마다 관측한 현재 차량의 유사도에 따라, 두 관측점마다 관측한 현재 차량이 동일한 차량인지 여부를 각각 검출한다. 도 4는, 본 출원에 의해 제공되는 차량의 도로 상에서의 주행 장면을 나타내는 도면이다. 도 4에서 도시한 바와 같이, 특정된 단일 프레임 상황하에 동일한 차량의 이탈이 비교적 크나, 궤적 유사도는 모두 비교적 높으므로, 면적에 의해 궤적 유사도를 구분하는 방법은 잡음을 제거할 수 있고, 단일 프레임 정보의 불정확성으로 인해 운 동 중의 물체와의 연계 착오를 회피할 수 있다. 본 출원의 실시예에 의해 제공되는 차량 연계 방법은, 각각의 관측점에 대해, 우선 미리 설정된 주기에 따라 현 재 차량의 도로 상의 주행 영상을 수집하고; 그 다음에 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상 에 기반하여, 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 확정하며; 이어서, 현재 차량에 대한 각각 의 관측점의 최초 관측 시퀀스에 기반하여, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하고; 나아가 현재 차량에 대한 각각 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 현재 차량이 동일 한 차량인지 여부를 검출한다. 즉, 본 출원은 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여 차량 연계를 실행할 수 있다. 종래의 차량 연계 방법에 있어서, 종래의 연계 방법은 대다수가 단일 프레임 영상 에 의해 실행된다. 이에 따라, 본 출원은 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여 차량 연계를 실행할 수 있는 기술 수단을 사용함으로써, 종래 기술에서 단일 프레임 영상에 기반하여 연계를 실행하 나, 단일 프레임 영상에 한계가 있고, 상이한 관측점에서 수집한 영상을 정확하게 결합시킬 수 없어 연계 성공 률이 비교적 낮은 기술적 과제를 극복하였고, 본 출원에 의해 제공되는 기술 수단에 의해, 단일 프레임 영상의 비정상으로 인한 연계 착오를 효과적으로 방지할 수 있으므로, 연계 성공률을 향상시킬 수 있고, 또한 본 출원 의 실시예의 기술 수단은 실현하기 간단하고 편리하며, 보급하기 쉬워서, 적용 범위가 넓다. 실시예 4 도 5는 본 출원의 실시예에 의해 제공되는 차량 연계 장치의 구조 개략도이다. 도 5에서 도시한 바와 같이, 상 기 장치는, 각각의 관측점에 대해, 미리 설정된 주기에 따라 현재 차량의 도로 상의 주행 영상을 수집하도록 구성되는 수집 모듈; 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최 초 관측 시퀀스를 확정하고; 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스에 기반하여, 상기 현재차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 확정하도록 구성되는 확정 모듈; 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하도록 구성되는 검출 모듈; 을 포함한다 나아가, 상기 확정 모듈은, 상세하게, 상기 미리 설정된 시간대 내에 각각의 관측점이 수집한 영상에 기반 하여, 각각의 관측점이 각 영상을 수집할 때의 상기 현재 차량의 위치를 확정하고; 각각의 관측점이 각 영상을 수집할 때의 상기 현재 차량의 위치 및 각각의 관측점이 각 영상을 수집하는 시점에 따라, 각 시점에서의 각각 의 관측점의 관측 데이터를 확정하며; 여기서, 상기 관측 데이터에 시점과 위치가 포함되며; 각 시점에서의 각 각의 관측점의 관측 데이터에 따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스를 얻도록 구성된 다. 나아가, 상기 확정 모듈은, 상세하게, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스 중의 각 관측 데이터에 따라, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하는지 여부 를 검출하고; 만약 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시퀀스가 캡쳐 요건을 만족하면, 각 최초 관측 시퀀스 중의 각 관측 데이터 중의 시점에 기반하여, 상기 현재 차량에 대한 각각의 관측점의 최초 관측 시 퀀스에 대해 캡쳐 처리를 실행하고, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스를 얻도록 구성된다. 도 6은 본 출원의 실시예에 의해 제공되는 검출 모듈의 구조 개략도이다. 도 6에서 도시한 바와 같이, 상기 검 출 모듈은, 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여, 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의 평균 길이 및 두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적을 각각 산출하고; 두 관측점마다 관측한 상기 현재 차량의 주행 궤적 사이의 면적 및 두 관측점마다 관측한 상기 현재 차량의 주행 궤적의 평균 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 유사도를 각각 산출하도록 구성되는 산출 서 브 모듈; 두 관측점마다 관측한 상기 현재 차량의 유사도에 따라, 두 관측점마다 관측한 상기 현재 차량이 동일 차량인지 여부를 검출하도록 구성되는 검출 서브 모듈; 을 포함한다. 나아가, 산출 서브 모듈은, 상세하게, 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에서 각 관측 데이터 중의 위치를 추출하고; 상기 현재 차량에 대한 각각의 관측점의 타깃 관측 시퀀스에 기반하여 각 관측 데이터 중의 위치를 추출하며, 각각의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이를 산출하고; 각각 의 관측점에서 관측한 상기 현재 차량의 주행 궤적의 길이에 따라, 두 관측점마다 관측한 상기 현재 차량의 주 행 궤적의 평균 길이를 산출하도록 구성된다. 상술한 차량 연계 장치는 본 출원의 임의의 실시예에 의해 제공되는 방법을 실행 가능하며, 실행하는 방법과 상 응되는 기능 모듈 및 유리한 효과를 구비한다. 본 실시예에서 상세하게 설명되지 못한 기술적 세부는 본 출원의 임의의 실시예에 의해 제공되는 차량 연계 방법을 참조한다. 실시예 5 본 발명의 실시예에 따르면, 본 개시는 전자 디바이스, 판독 가능 저장 매체 및 컴퓨터 프로그램 제품을 더 제 공한다. 도 7은 본 발명의 실시예를 실행 가능하도록 구성되는 예시 전자 디바이스의 예시적 블록도를 도시하였다. 전자 디바이스는 예를 들면, 랩톱 컴퓨터, 탁상용 컴퓨터, 워크 스테이션, 개인 정보 단말기, 서버, 블레이드 서버, 메인 프레임 컴퓨터 및 기타 적합한 컴퓨터와 같은 다양한 형태의 디지털 컴퓨터를 나타내려는 것이다. 전자 디바이스는 개인 정보 처리 단말기, 셀룰러 폰, 스마트 폰, 웨어러블 장치 및 기타 유사한 컴퓨팅 장치와 같은 다양한 형태의 모바일 장치를 나타낼 수도 있다. 본 명세서에서 나타내는 구성요소, 이들의 연결 및 관계 및 이들의 기능은 단지 예시 일 뿐이며, 본 명세서에서 설명 및/또는 요구되는 본 발명의 구현을 제한하려는 것 은 아니다. 도 7에서 도시한 바와 같이, 디바이스는 읽기 전용 메모리(Read Only Memory, ROM)에 저장되어 있는 컴퓨터 프로그램 또는 저장 유닛으로부터 랜덤 액세스 메모리(Random Access Memory, RAM)에 로딩되 는 컴퓨터 프로그램에 따라 여러 가지 적당한 동작 및 처리가 실행 가능한 컴퓨팅 유닛을 포함한다. RAM에는, 디바이스의 조작에 요구되는 여러 가지 프로그램 및 데이터가 저장될 수도 있다. 컴퓨팅 유 닛, ROM와 RAM는 버스를 통해 상호 연결된다. 입력/출력(I/O) 인터페이스도 버스에 연결된다. 디바이스 내의 복수 개의 구성요소는 I/O인터페이스에 연결되고, 예를 들면, 키보드, 마우스 등 입력 유닛; 예를 들면, 다양한 유형의 디스플레이, 스피커 등 출력 유닛; 예를 들면, 자기 디스크, 광 디 스크 등 저장 유닛; 및 예를 들면, 랜 카드, 모뎀, 무선통신 송수신 장치 등 통신 유닛; 을 포함한다. 통신 유닛은 디바이스가 인터넷 상의 컴퓨터 네트워크 및/또는 다양한 전기통신 네트워크 를 통해 기타 장치와 정보/데이터를 교환할 것을 허용한다. 컴퓨팅 유닛은 처리 및 컴퓨팅 기능이 구비된 다양한 범용 처리 컴포넌트 및/또는 전용 처리 컴포넌트일 수 있다. 컴퓨팅 유닛의 일부 예시로는, 중앙 처리 장치(Central Processing Unit, CPU), 그래픽 처리 장 치(Graphics Processing Unit, GPU), 다양한 전용 인공지능(Artificial Intelligence, AI) 컴퓨팅 칩, 다양한 운행 기계 학습 모델 알고리즘의 산출 유닛, 디지털 신호 프로세서(Digital Signal Processor, DSP) 및 임의의 적합한 프로세서, 컨트롤러, 마이크로 컨트롤러 등을 포함하지만 이에 한정되지 않는다. 컴퓨팅 유닛은 상 술한 각 방법 및 처리, 예를 들면, 차량 연계 방법을 실행한다. 예를 들면, 일부 실시예에서, 차량 연계 방법은 컴퓨터 소프트웨어 프로그램에 의해 구현 가능하고, 유형적으로 기계 판독 가능 매체, 예를 들면, 저장 유닛 에 포함될 수 있다. 일부 실시예에 있어서, 컴퓨터 프로그램의 일부 또는 전부는 ROM 및/또는 통신 유닛에 의해 디바이스에 로딩 및/또는 설치될 수 있다. 컴퓨터 프로그램이 RAM에 로딩되고 또한 컴퓨팅 유닛에 의해 실행 시, 상술한 차량 연계 방법의 하나 또는 복수 개의 단계를 실행할 수 있다. 선택 적으로, 기타 실시예에서, 컴퓨팅 유닛은 기타 임의의 적합한 형태(예를 들면, 펌웨어에 의해)에 의해 차 량 연계 방법을 실행하도록 구성될 수 있다. 본 명세서의 상술한 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 현장 프 로그래머블 게이트 어레이(Field Programmable Gate Array, FPGA), 특정 용도 집적 회로 (Application Specific Integrated Circuit, ASIC), 특정 용도 표준 제품(Application Specific Standard Product, ASSP), 시스템 온 칩(System on Chip) 시스템, 복합 프로그래머블 논리 소자(Complex Programmable Logic Device, CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에 의해 구형될 수 있다. 이들의 다양한 실시 형태는, 하나 또는 복수 개의 컴퓨터 프로그램에 실시하는 것을 포함할 수 있으며, 해당 하나 또는 복수 개의 컴퓨터 프로그램은 적어도 하나의 프로그래밍 가능 프로세서를 포함하는 프로그래밍 가능 시스템에서 실행 및/ 또는 해석될 수 있고, 해당 프로그래밍 가능 프로세서는 특정 용도 프로그래밍 가능 프로세서 또는 범용 프로그 래밍 가능 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치로부터 데이 터 및 명령을 수신하고 또한 데이터 및 명령을 해당 저장 시스템, 해당 적어도 하나의 입력 장치 및 적어도 하 나의 출력 장치로 전송할 수 있다. 본 발명의 방법를 실시하기 위한 프로그램 코드는 하나 또는 복수 개의 프로그래밍 언어의 임의의 조합에 의해 편성된다. 이들의 프로그램 코드는 범용 컴퓨터, 특정 용도 컴퓨터 또는 기타 프로그래밍 가능 데이터 처리 장 치의 프로세서 또는 컨트롤러에 제공되고, 프로그램 코드가 프로세서 또는 컨트롤러에 의해 실행 시 흐름도 및/ 또는 블록도 중에 정한 기능/조작이 구현된다. 프로그램 코드는 장치에 의해 전부가 실행될 수도 있고, 장치에 의해 일부가 실행될 수도 있으며, 독립된 소프트웨어 패키지로서 장치에서 일부 실행되거나 또는 전부 원격 장 치에서 일부가 실행되거나, 또는 전부 원격 장치 또는 서버에 의해 전부가 실행될 수도 있다. 본 발명의 명세서에서, 기계 판독 가능 매체는 유형적인 매체일 수 있고, 이는, 명령을 실행하는 시스템, 장치 및 디바이스에 의해 사용되거나 또는 명령을 실행하는 시스템, 장치 또는 디바이스와 결합하여 사용되는 프로그 램을 포함하거나 또는 저장할 수 있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 저장 매체일 수 있다. 기계 판독 가능 매체는 전자 시스템, 자기 시스템, 광학 시스템, 전자기 시스템, 적외 시 스템 또는 반도체 시스템, 장치 또는 디바이스 또는 상술한 내용의 임의의 적합한 조합을 포함할 수 있지만 이 에 한정되지 않는다. 기계 판독 가능 저장 매체의 더 구체적인 예로 하나 또는 복수 개의 케이블에 기반한 전기 적 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 랜덤 액세스 메모리(RAM), 읽기 전용 메모리(ROM), 소거 및 프로 그래밍 가능 읽기 전용 메모리(EPROM 또는 플래시 메모리), 광섬유, 휴대용 컴팩트 디스크 읽기 전용 메모리 (CD-ROM), 광학 저장 디바이스, 자기 저장 디바이스, 또는 상술한 내용의 임의의 적합한 조합을 포함할 수 있다. 본 명세서에서 서술되는 시스템 및 기술은, 사용자와의 상호 작용을 제공하기 위해, 컴퓨터에서 실시할 수 있고, 해당 컴퓨터에는, 사용자에게 정보를 표시하는 디스플레이 장치, 예를 들면, 음극선관(Cathode-Ray Tube, CRT) 또는 액정 디스플레이 장치(Liquid Crystal Display, LCD) 모니터; 및 키보드 및 위치 지정 장치, 예를들면, 마우스 또는 트랙볼; 이 구비되며, 사용자는 해당 키보드 및 해당 위치 지정 장치를 통해 컴퓨터에 입력 한다. 사용자와의 상호 작용을 제공하기 위해 기타 유형의 장치도 사용할 수 있는바, 예를 들면, 사용자에게 제 공되는 피드백은 임의의 형태의 감각 피드백, 예를 들면, 시각 피드백, 청각 피드백, 또는 촉각 피드백일 수 있 고; 또한 음향 입력, 음성 입력 또는 촉각 입력을 포함한 임의의 형태로 사용자의 입력을 수신할 수 있다. 본 명세서에서 서술되는 시스템 및 기술은 백그라운드 구성요소를 포함하는 컴퓨팅 시스템(예를 들면, 데이터 서버), 또는 미들웨어 구성요소를 포함하는 컴퓨팅 시스템(예를 들면, 응용 서버), 또는 프런트 엔드 구성요소 를 포함하는 컴퓨팅 시스템(예를 들면, 그래픽 유저 인터페이스 또는 네트워크 브라우저의 사용자 컴퓨터가 구 비되고, 사용자는 해당 그래픽 유저 인터페이스 또는 해당 네트워크 브라우저를 통해 본 명세서에서 서술되는 시스템 및 기술의 실시형태와 상호 작용함), 또는 이러한 백그라운드 구성요소, 미들웨어 구성요소 또는 프런트 엔드 구성요소를 임의로 조합한 컴퓨팅 시스템에서 실시된다. 임의의 형태 또는 매체의 디지털 데이터 통신(예 를 들면, 통신 네트워크)를 통해 시스템의 구성요소와 상호 연결된다. 통신 네트워크의 예로 근거리 통신망 (Local Area Network, LAN), 광역 통신망(Wide Area Network, WAN), 블록체인 네트워크 및 인터넷이 포함된다. 컴퓨팅 시스템은 클라이언트 및 서버를 포함할 수 있다. 클라이언트 및 서버는 일반적으로 서로 떨어져 있고 또 한 통상적으로 통신 네트워크를 통해 상호 작용한다. 상응한 컴퓨터에서 운행하고 또한 서로가 클라이언트-서버 관계를 갖는 컴퓨터 프로그램에 의해 클라이언트와 서버의 관계를 생성한다. 서버는 클라우드 서버일 수 있고, 이는 클라우드 컴퓨팅 서버 또는 클라우드 호스트라고도 하는바, 클라우드 컴퓨팅 서비스 체계 중의 하나의 호 스트 제품으로서, 종래의 물리 호스트와 시각 위치 확인 서비스(Visual Positioning Service, VPS)에 존재하는 관리하기 어렵고, 업무 확장성이 약하는 단점을 해결하였다. 본 출원에서 개시된 실시예에 따르면, 본 개시는 노변 장치 및 클라우드 제어 플랫폼을 더 제공하며, 노변 장치 및 클라우드 제어 플랫폼은 본 출원의 실시예에서 서술된 상기 전자 디바이스를 포함할 수 있다. 해당 노변 장 치는 전자 디바이스를 포함하는 외에, 통신 구성요소 등을 더 포함할 수 있으며, 전자 디바이스는 통신 구성요 소와 일체로 집적될 수 있고, 분리되어 설치될 수도 있다. 전자 디바이스는 감지 장치(예를 들면 노변 카메라) 의 데이터, 예를 들면, 사진 및 동영상 등을 획득함으로써, 동영상 처리 및 데이터 컴퓨팅을 실행할 수 있다. 클라우드 제어 플랫폼은 클라우드에서 처리를 실행하고, 클라우드 제어 플랫폼에 포함된 전자 디바이스는 감지 장치(예를 들면, 노변 카메라)의 데이터, 예를 들면, 사진 및 동영상 등을 획득함으로써, 동영상 처리 및 데이 터 컴퓨팅을 실행할 수 있고; 클라우드 제어 플랫폼은 차량 인프라 협력 관리 플랫폼, 엣지(Edge) 컴퓨팅 플랫 폼, 클라우드 컴퓨팅 플랫폼, 중앙 시스템, 클라우드 서버 등이라고도 칭할 수 있다. 이해해야 할 것은, 상술한 다양한 형태의 프로세스에 의해 단계의 재배열, 추가 또는 삭제를 실행할 수 있다. 예를 들면, 본 발명에 개시된 각 단계는 병렬로 실행될 수도 있고, 순서대로 실행될 수도 있으며, 상이한 순서 로 실행할 수도 있는바, 본 발명에 개시된 기술 수단에 의해 추구하려는 결과를 구현할 수만 있다면, 본 발명은 이에 대해 한정하지 않는다. 상술한 구체적 실시 형태는 본 출원의 보호 범위를 한정하려는 것은 아니다. 해당 분야의 기술자라면 명확해야 할 것은, 본 발명은 설계의 요구 사항 및 기타 요인에 따라, 각종 수정, 조합, 하위 조합 및 대체가 실행될 수 있다. 본 발명의 기술적 사상 및 원칙 내에서 실행된 임의의 수정, 동등 교체 및 개진 등은 모두 본 발명의 보 호 범위 내에 속한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2021-0127050", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 발명을 보다 잘 이해하기 위한 것으로, 본 발명은 이에 의해 한정되지 않는다. 여기서, 도 1은 본 출원의 실시예에 의해 제공되는 차량 연계 방법의 제 1 흐름 개략도이고, 도 2는 본 출원의 실시예에 의해 제공되는 차량 연계 방법의 제 2 흐름 개략도이고, 도 3은 본 출원의 실시예에 의해 제공되는 차량 연계 방법의 제 3 흐름 개략도이고, 도 4는 본 출원에 의해 제공되는 차량의 도로 상의 주행 장면을 나타내는 도면이며, 도 5는 본 출원의 실시예에 의해 제공되는 차량 연계 장치의 구조 개략도이고, 도 6은 본 출원의 실시예에 의해 제공되는 검출 모듈의 구조 개략도이고, 도 7은 본 출원의 실시예의 차량 연계 방법을 구현하는 전자 디바이스의 블록도이다."}
