{"patent_id": "10-2023-0138874", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0015688", "출원번호": "10-2023-0138874", "발명의 명칭": "안테나 모듈을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "조수진"}}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(101; 200)에 있어서, 전면(220a), 상기 전면의 반대방향을 향하는 후면(220b), 및 상기 전면과 상기 후면 사이의 공간을 적어도 부분적으로 둘러싸는 측벽(221; 321)을 포함하는 하우징(220; 320);상기 공간의 일측 가장자리에서, 상기 측벽에 인접하게 배치된 상기 카메라 조립체(204, 304);상기 카메라 조립체에서 일 방향으로 돌출된 지지 돌기(345);상기 카메라 조립체에 인접하는 상기 측벽의 제1 부분(321a)의 적어도 일부로서 배치되고, 제1 주파수 대역의무선 통신을 수행하도록 구성된 제1 방사체; 상기 제1 부분에 인접하는 상기 측벽의 제2 부분(321b)과 상기 카메라 조립체 사이에 적어도 부분적으로 배치된안테나 모듈(307)로서, 제2 주파수 대역의 무선 통신을 수행하도록 구성된 상기 안테나 모듈; 및상기 안테나 모듈로부터 연장되어 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 제1가요성 인쇄회로 기판(373)을 포함하고,상기 제1 가요성 인쇄회로 기판은, 상기 지지 돌기의 표면 중 서로에 대하여 경사지게 또는 수직하게 배치된 두영역을 감싸게 또는 상기 두 영역을 덮도록 배치된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 제1 부분과 상기 제2 부분 사이에 배치된 분절 구조(321c); 및상기 제2 부분의 적어도 일부로서 배치되고, 제3 주파수 대역의 무선 통신을 수행하도록 구성된 제2 방사체를더 포함하는 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항 내지 제2 항 중 어느 한 항에 있어서, 상기 안테나 모듈은, 적어도 부분적으로 상기 제2 부분과 상기 카메라 조립체 사이에 배치된 안테나 기판(antenna substrate)(371)을 포함하고,상기 제1 가요성 인쇄회로 기판이 상기 안테나 기판으로부터 연장된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서, 상기 지지 돌기의 주위에서, 상기 제1 가요성 인쇄회로 기판이 적어도 1회 절곡됨(bent)으로써,상기 제1 가요성 인쇄회로 기판의 일부분은 상기 제2 부분과 상기 카메라 조립체 사이에서 또는 상기 제1 부분과 상기 카메라 조립체 사이에서 상기 측벽을 바라보는 방향으로 정렬되고, 상기 제1 가요성 인쇄회로 기판의 다른 일부분은 상기 제1 부분과 상기 카메라 조립체 사이에서 상기 전면 또는상기 후면을 바라보는 방향으로 정렬된 전자 장치.공개특허 10-2025-0015688-3-청구항 5 제4 항에 있어서,상기 제1 가요성 인쇄회로 기판의 절곡 부분(bent portion)에 배치된 제1 더미 부재(375)를 더 포함하는 전자장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항 내지 제5 항 중 어느 한 항에 있어서, 상기 전면과 상기 후면 사이의 공간에 배치되며, 상기 카메라 조립체의 일부부분을 수용하는 개구 영역(364a)을제공하는 회로 기판(364); 상기 회로 기판의 일부분이면서 상기 개구 영역의 일부분을 정의하는(defining) 연장부(364b)로서, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 상기 연장부; 및상기 제1 부분에서 상기 측벽으로부터 연장되어 적어도 부분적으로 상기 연장부에 마주보게 배치된 접촉 편(contact piece)(329)을 더 포함하는 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 연장부의 일면에 배치되며, 상기 접촉 편에 전기적으로 연결된 접촉 단자(contact terminal)(364c)를 더포함하며, 상기 제1 방사체는 상기 접촉 단자와 상기 접촉 편을 통해 급전 신호를 제공받도록 구성된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서, 적어도 부분적으로 상기 연장부의 타면에 배치된 지지 플레이트(364d); 및상기 연장부에 인접하는 영역에서, 상기 회로 기판 및 상기 지지 플레이트를 관통하게 형성된 체결 홀(364e)을더 포함하는 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6 항 내지 제8 항 중 어느 한 항에 있어서, 상기 후면과 상기 회로 기판 사이에 배치된 지지 부재(270, 279)를 더 포함하고, 상기 지지 부재는 상기 회로 기판 또는 상기 연장부의 일면을 지지하도록 구성된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6 항 내지 제9 항 중 어느 한 항에 있어서, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 키패드 조립체(308)를 더 포함하고,상기 키패드 조립체는,적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 스위치 기판(381); 및공개특허 10-2025-0015688-4-상기 스위치 기판으로부터 연장되며, 상기 카메라 조립체의 일측에서 상기 회로 기판에 접속된 제2 가요성 인쇄회로 기판(383)을 포함하는 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10 항에 있어서, 상기 후면 상에서 상기 카메라 조립체 둘레의 적어도 일부분에 배치된 커버 플레이트(299); 및상기 제2 가요성 인쇄회로 기판에 배치된 제2 더미 부재(385)를 더 포함하고, 상기 제2 더미 부재가 상기 커버 플레이트와 마주보게 배치된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서, 상기 제1 가요성 인쇄회로 기판의 적어도 일부분이 상기 회로 기판과 상기 제2 더미 부재 사이에 배치된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11 항 내지 제12 항 중 어느 한 항에 있어서, 상기 커버 플레이트는 일측 가장자리에서 내측으로 연장된 노치부(notch portion)(299b)를 포함하고,상기 노치부가 상기 제2 더미 부재와 적어도 부분적으로 중첩하게 배치된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1 항 내지 제13 항 중 어느 한 항에 있어서, 제2 하우징; 상기 제2 하우징을 상기 하우징에 회동 가능하게 결합시키며, 상기 하우징 또는 상기 제2 하우징의 회동 중심이되는 적어도 하나의 폴딩 축(A)을 제공하도록 구성된 힌지 구조(202); 및상기 하우징의 내부로부터 상기 힌지 구조를 가로질러 상기 제2 하우징의 내부로 배치된 가요성 인쇄회로 기판(266)을 더 포함하는 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서, 상기 하우징과 상기 제2 하우징 중 어느 하나에 배치된 제1 디스플레이 영역(231)과, 상기 하우징과 상기 제2하우징 중 다른 하나에 배치된 제2 디스플레이 영역(232)과, 상기 힌지 구조 상에 배치된 폴딩 영역(233)을 포함하는 플렉서블 디스플레이를 더 포함하고,상기 플렉서블 디스플레이는 상기 하우징 전면의 적어도 일부를 통해 화면을 출력하도록 구성된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치(101; 200)에 있어서, 제1 하우징(210); 공개특허 10-2025-0015688-5-제2 하우징(220, 320); 상기 제1 하우징과 상기 제2 하우징을 회동 가능하게 결합시키며, 상기 제1 하우징 또는 상기 제2 하우징의 회동 중심이 되는 적어도 하나의 폴딩 축(A)을 제공하도록 구성된 힌지 구조(202); 상기 제1 하우징의 내부로부터 상기 힌지 구조를 가로질러 상기 제2 하우징의 내부로 배치된 가요성 인쇄회로기판(266); 제1 디스플레이 영역(231)과, 제2 디스플레이 영역(232)과, 상기 제1 디스플레이 영역을 상기 제2 디스플레이영역에 연결하며 상기 힌지 구조 상에 배치된 폴딩 영역(233)을 포함하는 플렉서블 디스플레이(230); 상기 제1 하우징과 상기 제2 하우징 중 어느 하나의 내부의 일측 가장자리에서 측벽(321)에 인접하게 배치된 카메라 조립체(204, 304);적어도 부분적으로 상기 카메라 조립체에 인접하게 배치된 상기 측벽의 제1 부분(321a)으로서, 제1 주파수 대역의 무선 통신을 수행하도록 구성된 제1 방사체; 상기 제1 부분에 인접하는 상기 측벽의 제2 부분(321b)과 상기 카메라 조립체 사이에 적어도 부분적으로 배치된안테나 기판(371)을 포함하는 안테나 모듈(307)로서, 제2 주파수 대역의 무선 통신을 수행하도록 구성된 상기안테나 모듈; 및상기 제2 부분(321b)의 적어도 일부로서, 제3 주파수 대역의 무선 통신을 수행하도록 구성된 제2 방사체를 포함하고, 상기 안테나 모듈은, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 제1 가요성 인쇄회로 기판(373)을 포함하는 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서, 상기 카메라 조립체의 일부부분을 수용하는 개구 영역(364a)을 제공하는 회로 기판(364); 상기 회로 기판의 일부분이면서 상기 개구 영역의 일부분을 정의하는 연장부(364b)로서, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 상기 연장부; 상기 제1 부분에서 상기 측벽으로부터 연장되어 적어도 부분적으로 상기 연장부에 마주보게 배치된 접촉 편(329); 및상기 연장부의 일면에 배치되며, 상기 접촉 편에 전기적으로 연결된 접촉 단자(364c)를 더 포함하며, 상기 제1 방사체는 상기 접촉 단자와 상기 접촉 편을 통해 급전 신호를 제공받도록 구성된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17 항에 있어서, 상기 제1 가요성 인쇄회로 기판은 상기 연장부를 사이에 두고 상기 접촉 편에 마주보게 배치된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17 항 내지 제18 항 중 어느 한 항에 있어서, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 키패드 조립체(308)를 더 포함하고,상기 키패드 조립체는,적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 스위치 기판(381); 및상기 스위치 기판으로부터 연장되어 상기 제1 가요성 인쇄회로 기판을 가로지르게 배치되며, 상기 카메라 조립공개특허 10-2025-0015688-6-체의 일측에서 상기 회로 기판에 접속된 제2 가요성 인쇄회로 기판(383)을 포함하는 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19 항에 있어서, 상기 제1 가요성 인쇄회로 기판의 일부분이 상기 회로 기판과 상기 제2 가요성 인쇄회로 기판 사이에 배치된 전자 장치."}
{"patent_id": "10-2023-0138874", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 전자 장치는, 전면, 상기 전면의 반대방향을 향하는 후면, 및 상기 전면과 상기 후면 사이의 공간을 적어도 부분적으로 둘러싸는 측벽을 포함하는 하우징, 상기 공간의 일측 가장자리에서, 상기 측벽에 인접하게 배치된 상기 카메라 조립체, 상기 카메라 조립체에서 일 방향으로 돌출된 지지 돌기, 상기 카메 (뒷면에 계속)"}
{"patent_id": "10-2023-0138874", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 실시예(들)는 전자 장치에 관한 것으로서, 예를 들면, 안테나 모듈을 포함하는 전자 장치에 관한 것 이다."}
{"patent_id": "10-2023-0138874", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치라 함은, 가전제품으로부터, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영 상/음향 장치, 데스크톱/랩톱 컴퓨터 또는 차량용 내비게이션과 같이 탑재된 프로그램에 따라 특정 기능을 수행 하는 장치를 의미할 수 있다. 예를 들면, 이러한 전자 장치들은 저장된 정보를 음향이나 영상으로 출력할 수 있 다. 전자 장치의 집적도가 높아지고, 초고속, 대용량 무선통신이 보편화되면서, 이동통신 단말기와 같은 하나의 전자 장치에 다양한 기능이 탑재될 수 있다. 예를 들면, 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼트 기능, 음악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹 등을 위한 통신 및 보안 기능 또는 일정 관리나 전자 지갑의 기능이 하나의 전자 장치에 집약되고 있다. 스마트 폰과 같은 개인용 또는 휴대용 통신 장치의 사용이 보편화되면서, 휴대성과 사용의 편의성에 대한 사용 자 요구가 증가하고 있다. 예를 들어, 터치스크린 디스플레이는 화면, 예컨대, 시각적 정보를 출력하는 출력 장 치이면서, 기계적인 입력 장치(예: 버튼식 입력 장치)를 대체하는 가상의 키패드를 제공할 수 있다. 이로써, 휴 대용 통신 장치 또는 전자 장치는 소형화되면서도 동일한 또는 더욱 향상된 활용성(예: 더 큰 화면)을 제공할 수 있게 되었다. 다른 한편으로, 유연성을 가진(flexible), 예를 들어, 접혀질 수 있는(foldable) 또는 말아질 수 있는(rollable) 디스플레이가 상용화되면서, 전자 장치의 휴대성과 사용의 편의성은 더욱 향상될 것으로 예 상된다. 플렉서블 디스플레이를 포함하는 전자 장치는 서로 다른 복수의 구조물(예: 하우징들)이 접혀진 상태로 또는 말아진 상태로 휴대가 가능하며, 펼친 상태에서는 큰 화면을 제공할 수 있어, 휴대성과 사용의 편의성을 향상시킬 수 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련하여 종래 기술(prior art)로서 적용될 수 있는지에 관해서는 어떠한 주 장이나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0138874", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 전자 장치는, 전면, 상기 전면의 반대방향을 향하는 후면, 및 상기 전면과 상기 후면 사이의 공간을 적어도 부분적으로 둘러싸는 측벽을 포함하는 하우징, 상기 공간의 일측 가장자리에서, 상 기 측벽에 인접하게 배치된 상기 카메라 조립체, 상기 카메라 조립체에서 일 방향으로 돌출된 지지 돌기, 상기 카메라 조립체에 인접하는 상기 측벽의 제1 부분의 적어도 일부로 배치되고, 제1 주파수 대역의 무선 통신을 수 행하도록 구성된 제1 방사체, 상기 제1 부분에 인접하는 상기 측벽의 제2 부분과 상기 카메라 조립체 사이에 적 어도 부분적으로 배치된 안테나 모듈로서, 제2 주파수 대역의 무선 통신을 수행하도록 구성된 상기 안테나 모듈, 및 상기 안테나 모듈로부터 연장되어 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배 치된 제1 가요성 인쇄회로 기판을 포함할 수 있다. 일 실시예에서, 상기 제1 가요성 인쇄회로 기판은, 상기 지 지 돌기의 표면 중 서로에 대하여 경사지게 또는 수직하게 배치된 두 영역을 감싸게 또는 상기 두 영역을 덮도 록 배치될 수 있다. 본 개시의 일 실시예에 따르면, 전자 장치는, 제1 하우징, 제2 하우징, 상기 제1 하우징과 상기 제2 하우징을 회동 가능하게 결합시키며, 상기 제1 하우징 또는 상기 제2 하우징의 회동 중심이 되는 적어도 하나의 폴딩 축(A)을 제공하도록 구성된 힌지 구조, 상기 제1 하우징의 내부로부터 상기 힌지 구조를 가로질러 상기 제2 하우 징의 내부로 배치된 가요성 인쇄회로 기판, 제1 디스플레이 영역과, 제2 디스플레이 영역과, 상기 제1 디스플레 이 영역을 상기 제2 디스플레이 영역에 연결하며 상기 힌지 구조 상에 배치된 폴딩 영역을 포함하는 플렉서블 디스플레이, 상기 제1 하우징과 상기 제2 하우징 중 어느 하나의 내부의 일측 가장자리에서 측벽에 인접하게 배 치된 카메라 조립체, 적어도 부분적으로 상기 카메라 조립체에 인접하게 배치된 상기 측벽의 제1 부분으로서, 제1 주파수 대역의 무선 통신을 수행하도록 구성된 제1 방사체, 상기 제1 부분에 인접하는 상기 측벽의 제2 부 분과 상기 카메라 조립체 사이에 적어도 부분적으로 배치된 안테나 기판을 포함하는 안테나 모듈로서, 제2 주파 수 대역의 무선 통신을 수행하도록 구성된 상기 안테나 모듈, 및 상기 제2 부분의 적어도 일부로서, 제3 주파수 대역의 무선 통신을 수행하도록 구성된 제2 방사체를 포함할 수 있다. 일 실시예에서, 상기 안테나 모듈은, 적 어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 제1 가요성 인쇄회로 기판을 포함할 수 있 다."}
{"patent_id": "10-2023-0138874", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상용 통신망을 통한 접속뿐만 아니라, 블루투스나 와이파이와 같은 통신 규약은 서로 다른 전자 장치 사이의 무 선 통신을 직접 연결할 수 있는 환경을 제공할 수 있다. 예를 들어, 전자 장치는 복수의 안테나를 포함함으로써 서로 다른 규약의 무선 통신을 수행할 수 있다. 하지만, 성능은 더욱 고도화되면서 소형화 또는 경량화된 전자 장치에서는 복수의 안테나를 배치하기 위한 공간의 확보가 어려울 수 있다. 접혀질 수 있는 또는 말아질 수 있 는 전자 장치에서는 공간의 확보가 용이할 수 있지만, 복수의 구조물(예: 하우징들)이 상대적으로 이동 가능하 게 결합된 전자 장치에서 무선 통신 성능에 편차가 발생될 수 있다. 예를 들어, 통신 회로와 안테나의 방사체 (radiating body)가 멀리 배치된 때, 구조물들의 상대적인 위치에 따라 통신 회로와 방사체를 연결하는 배선(예: 동축 케이블이나 가요성 인쇄회로 기판)의 형상이 달라질 수 있다. 통신 회로와 방사체 사이에서의 신 호 전송에 있어, 배선의 형상 변화는 신호 전송의 효율에 편차를 발생시키거나 전송 신호를 왜곡시키는 원인이 될 수 있다. 본 개시의 일 실시예는, 상술한 문제점 및/또는 단점을 적어도 해소하고 후술하는 장점을 적어도 제공하기 위한 것으로서, 협소한 공간에 용이하게 배치될 수 있는 안테나 모듈을 포함하는 전자 장치를 제공할 수 있다. 본 개시의 일 실시예는, 협소한 공간에 배치되면서 안정적인 무선 통신 환경을 구현하는 안테나 모듈을 포함하 는 전자 장치를 제공할 수 있다. 본 개시의 일 실시예는, 구조물(예: 하우징)들의 상대적인 위치에 따른 배선의 형상 변화를 억제 또는 실질적으 로 방지함으로써, 작동 환경에 따른 무선 통신 성능의 편차를 억제할 수 있는 안테나 모듈을 포함하는 전자 장 치를 제공할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2023-0138874", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 첨부된 도면에 관한 다음 설명은 청구항 및 이에 상응하는 내용을 포함하는 본 개시의 다양한 예시적인 구현에 대한 이해를 제공할 수 있다. 다음의 설명에서 개시된 예시적인 실시예는 이해를 돕기 위한 다양한 구체적인 세 부사항들을 포함하고 있지만 이는 다양한 예시적인 실시예 중 하나인 것으로 간주된다. 따라서, 일반 기술자는 본 문서에 기술된 다양한 구현의 다양한 변경과 수정이 공개의 범위와 기술적 사상에서 벗어나지 않고 이루어질 수 있음을 이해할 것이다. 또한 명확성과 간결성을 위해 잘 알려진 기능 및 구성의 설명은 생략될 수 있다. 다음 설명과 청구에 사용된 용어와 단어는 참고 문헌적 의미에 국한되지 않고, 본 개시의 일 실시예를 명확하고"}
{"patent_id": "10-2023-0138874", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "일관되게 설명하기 위해 사용될 수 있다. 따라서, 기술분야에 통상의 기술자에게, 공시의 다양한 구현에 대한 다음의 설명이 권리범위 및 이에 준하는 것으로 규정하는 공시를 제한하기 위한 목적이 아니라 설명을 위한 목 적으로 제공된다는 것은 명백하다 할 것이다. 문맥이 다르게 명확하게 지시하지 않는 한, \"a\", \"an\", 그리고 \"the\"의 단수형식은 복수의 의미를 포함한다는 것을 이해해야 한다. 따라서 예를 들어 \"구성 요소 표면\"이라 함은 구성 요소의 표면 중 하나 또는 그 이상을 포함하는 것으로 이해될 수 있다. 도 1은, 본 개시의 일 실시예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통 하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장 치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 일 실시예에서는, 전자 장치에 는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성 요소가 추가될 수 있다. 일 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈 )은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서), 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU; neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성 요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼) 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부의 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰))를 통 해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부의 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위 해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부의 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부의 전자 장치(예: 전자 장치, 전자 장치, 또는 서버)간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷,또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성 요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복 수의 구성 요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부의 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어 진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워 크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수 의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈 과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 일 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 일 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지 정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗면 또는 측면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안 테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들 간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))를 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치 간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104 또는 108) 중 하나 이상의 외부 장치들에서 실행될 수 있다. 예를 들 면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하 나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치 는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC; mobile edge computing) 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 일 실시예에 있어서, 외부의 전자 장 치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 개시의 실시예(들)에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 개시의 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설 명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하 는 명사의 단수형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함 할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“A 또는 B 중 적어도 하나”, \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나”, 및 “A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하 는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소 가 다른(예: 제2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어와 함께 또는 이런 용어없이, “커 플드” 또는 “커넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것으로 이해될 수 있다. 본 개시의 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현 될 수 있다. 본 개시의 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서)는, 저장 매체로부터 저장된 하나 이상의 명령 어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명 령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴 파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있 는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장매 체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 개시의 실시예(들)에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포 되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제 품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 일 실시예에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수 있다. 일 실시예에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요 소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그 램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성 요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것 과 동일 또는 유사하게 수행할 수 있다. 일 실시예에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행 되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 이하의 상세한 설명에서, 전자 장치의 길이 방향, 폭 방향 및/또는 두께 방향이 언급될 수 있으며, 길이 방향은 'Y축 방향'으로, 폭 방향은 'X축 방향'으로, 및/또는 두께 방향은 'Z축 방향'으로 정의될 수 있다. 일 실시예에 서, 구성요소가 지향하는 방향에 관해서는 도면에 예시된 직교 좌표계와 아울러, '음/양(-/+)'이 함께 언급될 수 있다. 예를 들어, 전자 장치 및/또는 하우징의 전면은 '+Z 방향을 향하는 면'으로, 후면은 '-Z 방향을 향하 는 면'으로 정의될 수 있다. 일 실시예에서, 전자 장치 및/또는 하우징 측면은, +X 방향을 향하는 영역, +Y 방 향을 향하는 영역, -X 방향을 향하는 영역 및/또는 -Y 방향을 향하는 영역을 포함할 수 있다. 일 실시예에서, 'X축 방향'은 '-X 방향'과 '+X 방향'을 모두 포함하는 의미일 수 있다. 이는 설명의 간결함을 위해 도면에 기재 된 직교 좌표계를 기준으로 한 것으로, 이러한 방향이나 구성요소들에 대한 설명이 본 개시의 실시예(들)를 한 정하지 않음에 유의한다. 예를 들어, 전자 장치의 설계 사양이나 사용자의 사용 습관에 따라 직교 좌표계는 본 개시와는 다르게 정의될 수 있다. 후술되는 실시예에서는, 복수의 하우징이 회동 가능하게 결합되어 서로 마주보게 접혀진 제1 위치와, 서로의 일 측에 나란하게 펼쳐진 제2 위치 사이에서 하우징들이 서로에 대하여 회동할 수 있다. 후술되는 실시예에서 전자 장치의 실시예(들)를 언급함에 있어 직교 좌표계를 참조하는 설명은 대체로 펼침 상태를 기준으로 설명될 수 있 다. 후술되는 실시예의 전자 장치에서 폴딩 축(들)은 Y축 방향과 실질적으로 평행한 것으로 이해될 수 있다. 하 지만 본 개시의 실시예(들)가 이에 한정되지 않으며, 본 개시의 실시예(들)는 폴딩 축(들)이 X축 방향에 평행한 구조의 전자 장치를 포함하는 것으로 이해될 수 있다. 도 2는 본 개시의 일 실시예에 따른 전자 장치의 펼쳐진 상태를 도시한 도면이다. 도 3은 본 개시의 일 실시예 에 따른 전자 장치의 접힌 상태를 도시한 도면이다. 도 2와 도 3을 참조하면, 전자 장치는, 하우징, 상기 하우징의 접힘 가능한 부분을 커버하는 힌 지 커버, 및 상기 하우징에 의해 형성된 공간 내에 배치된 디스플레이를 포함할 수 있다. 일 실 시예에 따르면, 상기 디스플레이에서 출력된 화면이 노출되는 면은 전자 장치의 전면(예: 제1 전면 (210a) 및 제2 전면(220a))으로 정의될 수 있다. 상기 전면의 반대 면은 전자 장치의 후면(예: 제1 후면 (210b) 및 제2 후면(220b))으로 정의될 수 있다. 일 실시예에서, 전면과 후면 사이의 공간을 둘러싸는 면을 전 자 장치의 측면(예: 제1 측면(210c) 및 제2 측면(220c))으로 정의될 수 있다. 전자 장치의 측면은 제 1 하우징 또는 제2 하우징 중 적어도 하나의 측면일 수 있다. 도 2 및 도 3의 전자 장치는 폴더 블 전자 장치, 휴대용 전자 장치 또는 휴대용 폴더블 전자 장치로 지칭될 수 있다. 일 실시예에 따르면, 하우징 은 폴더블 하우징으로 지칭될 수 있다. 일 실시예에서, 디스플레이는 \"플렉서블 디스플레이\"로 이름 될 수 있다. 일 실시예에 따르면, 상기 하우징은 제1 하우징, 제1 하우징에 대하여 회전할 수 있는 제2 하우 징, 제1 후면 커버 및 제2 후면 커버를 포함할 수 있다. 전자 장치의 하우징은 도 2 및 도 3에 도시된 형태 및 결합으로 제한되지 않으며, 다른 형상이나 부품의 조합 및/또는 결합에 의해 구현될 수 있다. 예를 들어, 일 실시예에서는, 제1 하우징과 제1 후면 커버가 일체로 형성될 수 있고, 제2 하우징과 제2 후면 커버가 일체로 형성될 수 있다. 일 실시예에 따르면, 상기 제1 하우징은 힌지 구조(예: 도 4의 힌지 어셈블리)에 연결되며, 제1 방향 을 향하는 제1 전면(210a), 및 제1 방향과 반대인 제2 방향을 향하는 제1 후면(210b)을 포함할 수 있다. 상기 제2 하우징은 힌지 어셈블리에 연결되며, 제3 방향을 향하는 제2 전면(220a), 및 상기 제3 방향과 반 대인 제4 방향을 향하는 제2 후면(220b)을 포함하며, 상기 힌지 어셈블리를 중심으로 상기 제1 하우징 에 대해 회전할 수 있다. 이에 따라, 전자 장치는 접힌(folded) 상태 또는 펼쳐진(unfolded) 상태로 가변할 수 있다. 전자 장치가 접히거나 펼쳐지는 동작은 힌지 구조에 대한 제1 하우징의 회전 또는 힌지 구조에 대한 제2 하우징의 회전으로 이해될 수 있다. 상기 전자 장치는 접힌(folded) 상태에서 상기 제1 전면(210a)이 상기 제2 전면(220a)에 대면할 수 있으며, 펼쳐진(unfolded) 상태에서 상기 제3 방향이 상기 제1 방향과 동일할 수 있다. 아래에서는, 별도의 언급이 없는 경우, 방향은 전자 장치가 펼쳐진 상태 를 기준으로 설명된다. 일 실시예에 따르면, 제1 하우징과 제2 하우징은 폴딩 축(A)을 중심으로 양측에 배치되고, 상기 폴딩 축(A)에 대하여 전체적으로 대칭인 형상을 가질 수 있다. 후술하는 바와 같이, 제1 하우징 및 제2 하우징 은 전자 장치의 상태가 펼침 상태인지, 접힌 상태인지, 또는 중간 상태인지 여부에 따라 서로 이루는 각도나 거리가 달라질 수 있다. 일 실시예에 따르면, 상기 제2 하우징은, 센서(예: 전면 카메라)들이 배치 되는 센서 영역을 추가로 포함하지만, 이외의 영역에서는 상호 대칭적인 형상을 가질 수 있다. 일 실시예에 따르면, 폴딩 축(A)은 평행한 복수(예: 2 개)의 폴딩 축일 수 있다. 본 개시에서는 폴딩 축(A)은 전자 장치의 길이 방향(Y축 방향)을 따라서 제공되나, 폴딩 축(A)의 방향은 이에 한정되지 않는다. 예를 들어(미도시), 전자 장치는 폭 방향(예: X축 방향)을 따라서 연장된 폴딩 축을 포함하는 실시예가 구현될 수 있다. 일 실시예에 따르면, 전자 장치는 도시되지 않은 디지털 펜이 부착될 수 있는 구조를 포함할 수 있다. 예 를 들어, 전자 장치는 디지털 펜을 제1 하우징의 측면 또는 제2 하우징의 측면에 부착시키도록 구성된 자성체를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 디지털 펜이 삽입될 수 있는 구조를 포함할 수 있다. 예를 들어, 전자 장치의 제1 하우징의 측면 또는 제2 하우징의 측면에는 디지 털 펜이 삽입될 수 있는 홀(미도시)이 형성될 수 있다. 일 실시예에 따르면, 제1 하우징 및 제2 하우징의 적어도 일부는 디스플레이를 지지하기 위해 선택된 크기의 강성을 갖는 금속 재질이나 비금속 재질로 형성될 수 있다. 금속 재질로 형성된 적어도 일부분은 전자 장치의 그라운드 면(ground plane)을 제공할 수 있으며, 인쇄 회로 기판(예: 도 4의 기판부)에 형성된 그라운드 라인과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 센서 영역은 제2 하우징의 일 모서리 또는 일 코너에 인접하여 소정 영역을 가 지도록 형성될 수 있다. 다만 센서 영역의 배치, 형상, 및 크기는 도시된 예시에 한정되지 아니한다. 예를 들어, 다른 실시예에서 센서 영역은 제2 하우징의 다른 코너 혹은 상단 코너와 하단 코너 사이의 임 의의 영역 또는 제1 하우징에 제공될 수 있다. 일 실시예에서, 전자 장치에 내장된 다양한 기능을 수 행하기 위한 부품들(components)이 센서 영역을 통해, 또는 센서 영역에 마련된 하나 이상의 개구 (opening)를 통해 전자 장치의 전면에 노출될 수 있다. 일 실시예에서, 상기 부품들은 다양한 종류의 센서 들을 포함할 수 있다. 상기 센서(들)는, 예를 들어, 전면 카메라, 리시버 또는 근접 센서 중 적어도 하나를 포 함할 수 있다. 일 실시예에 따르면, 제1 후면 커버는 전자 장치의 후면에서 상기 폴딩 축(A)의 일편에 배치되고, 예 를 들어, 실질적으로 직사각형인 가장자리(periphery)를 가질 수 있으며, 제1 하우징의 다른 구조물에 의 해 가장자리가 감싸질 수 있다. 유사하게, 제2 후면 커버는 전자 장치의 후면에서 폴딩 축(A)의 다른 편에 배치되고, 제2 하우징의 다른 구조물에 의해 그 가장자리가 감싸질 수 있다. 일 실시예에 따르면, 제1 후면 커버 및/또는 제2 후면 커버는 폴딩 축(A 축)을 중심으로 실질적으로 대칭적인 형상을 가질 수 있다. 다만, 제1 후면 커버 및 제2 후면 커버가 반드시 상호 대칭적인 형상 을 가지는 것은 아니며, 일 실시예에서, 전자 장치는 대칭이 아닌 서로 다른 형상의 제1 후면 커버 및 제2 후면 커버를 포함할 수 있다. 일 실시예에 따르면, 제1 후면 커버, 제2 후면 커버, 제1 하우징, 및 제2 하우징은 전자 장치의 다양한 부품들(예: 인쇄 회로 기판 또는 배터리)이 배치될 수 있는 공간을 제공할 수 있다. 일 실 시예에 따르면, 전자 장치의 후면에는 하나 이상의 부품(components)이 배치되거나 시각적으로 노출될 수 있다. 예를 들어, 제1 후면 커버의 적어도 일부를 통해 서브 디스플레이의 적어도 일부가 시각적으로 노출될 수 있다. 다른 실시예에서, 제2 후면 커버의 적어도 일부를 통해 하나 이상의 부품 또는 센서가 시각적으로 노출될 수 있다. 다양한 실시예에서 상기 센서는 근접 센서 및/또는 카메라 모듈(예: 후면 카 메라)을 포함할 수 있다. 일 실시예에 따르면, 센서 영역에 마련된 하나 이상의 개구(opening)를 통해 전자 장치의 전면에 노 출된 전면 카메라 또는 제2 후면 커버의 적어도 일부를 통해 노출된 카메라 모듈은 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 어떤 실시예에서는, 2개 이상의 렌즈 들(적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 배치될 수 있다. 일 실시예에 따르면, 힌지 커버는, 제1 하우징과 제2 하우징 사이에 배치되어, 내부 부품(예: 도 4의 힌지 어셈블리)을 가릴 수 있다. 일 실시예에 따르면, 힌지 커버는, 전자 장치의 상태 (펼쳐진 상태(flat state) 또는 접힌 상태(folded state))에 따라, 제1 하우징 및 제2 하우징의 일부에 의해 가려지거나, 외부로 노출될 수 있다. 일 실시예에 따르면, 도 2에 도시된 바와 같이, 전자 장치가 펼쳐진 상태인 경우, 상기 힌지 커버는 제1 하우징 및 제2 하우징에 의해 가려져 노출되지 않을 수 있다. 또 다른 예로, 도 3에 도시된 바와 같이, 상기 전자 장치가 접힌 상태(예: 완전 접힌 상태(fully folded state))인 경우, 상기 힌지 커버 는 제1 하우징 및 제2 하우징 사이에서 외부로 노출될 수 있다. 또 다른 예로, 제1 하우징 및 제2 하우징이 소정의 각도를 이루는(folded with a certain angle) 중간 상태(intermediate state)인 경우, 힌지 커버는 제1 하우징 및 제2 하우징의 사이에서 외부로 일부 노출될 수 있다. 다만 이 경우 노출되는 영역은 완전히 접힌 상태보다 적을 수 있다. 일 실시예에서, 힌지 커버는 곡면을 포함할 수 있다. 일 실시예에 따르면, 디스플레이는, 하우징에 의해 형성된(또는 정의된) 공간 상에 배치될 수 있다. 예를 들어, 디스플레이는 하우징에 의해 제공된 리세스(recess) 상에 안착되며, 전자 장치의 전 면의 대부분을 형성할 수 있다. 따라서, 전자 장치의 전면은 디스플레이 및 디스플레이에 인접 한 제1 하우징의 일부 영역 및 제2 하우징의 일부 영역을 포함할 수 있다. 전자 장치의 후면은 제1 후면 커버, 제1 후면 커버에 인접한 제1 하우징의 일부 영역, 제2 후면 커버 및 제2 후면 커버에 인접한 제2 하우징의 일부 영역을 포함할 수 있다. 일 실시예에 따르면, 디스플레이는 서로 이격된 복수의 디스플레이 영역들을 포함할 수 있다. 예를 들어, 디스플레이는 제1 하우징 상에 배치된 제1 디스플레이 영역, 제2 하우징 상에 배치된 제2 디스플레이 영역 및 폴딩 영역을 포함할 수 있다. 일 실시예에 따르면, 제1 디스플레이 영역 및 제2 디스플레이 영역은 폴딩 축(A)을 기준으로 회전할 수 있다. 일 실시예에 따르면, 디스플레이는 적어도 일부 영역이 평면 또는 곡면으로 변형될 수 있는 디스플레이를 의미할 수 있다. 예를 들어, 디스플레이는 폴더블(foldable) 또는 플렉서블(flexible) 디스플레이일 수 있 다. 일 실시예예 따르면, 상기 디스플레이는 폴딩 영역, 폴딩 영역을 기준으로 일측(예: 도 2에 도시된 폴딩 영역의 좌측)에 배치되는 제1 디스플레이 영역 및 타측(예: 도 2에 도시된 폴딩 영역 의 우측)에 배치되는 제2 디스플레이 영역을 포함할 수 있다. 다만, 이러한 디스플레이의 영역 구분은 예시적인 것이며, 디스플레이는 구조 또는 기능에 따라 복수(예를 들어, 4 개 이상 혹은 2 개)의 영역으로 구분될 수도 있다. 예를 들어, 도 2에 도시된 실시예에서는 Y축에 평행하게 연장되는 폴딩 영역 또는 폴딩 축(A)에 의해 디스플레이의 영역이 구분될 수 있으나, 다른 실시예에서 디스플레이는 다른 폴딩 영역(예: X축에 평행한 폴딩 영역) 또는 다른 폴딩 축(예: X축에 평행한 폴딩 축)을 기준으로 영역이 구분 될 수도 있다. 일 실시예에 따르면, 디스플레이는, 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일러스 펜을 검출하도록 구성된 디지타이저(미도시)와 결합되거나 인접 하여 배치될 수 있다. 일 실시예에 따르면, 제1 디스플레이 영역과 제2 디스플레이 영역은 폴딩 영역을 중심으로 전체 적으로 대칭인 형상을 가질 수 있다. 일 실시예(미도시)에 따르면, 제2 디스플레이 영역은, 제1 디스플레 이 영역과 달리, 센서 영역의 존재에 따라 컷(cut)된 노치(notch)를 포함할 수 있으나, 이외의 영역 에서는 제1 디스플레이 영역과 실질적으로 대칭인 형상을 가질 수 있다. 예를 들어, 제1 디스플레이 영역 과 제2 디스플레이 영역은 서로 대칭적인 형상을 갖는 부분과, 서로 비대칭적인 형상을 갖는 부분을 포함할 수 있다. 이하, 전자 장치의 상태(예: 펼쳐진 상태(flat state, 또는 unfolded state) 및 접힌 상태(folded state))에 따른 제1 하우징 및 제2 하우징의 동작과 디스플레이의 각 영역을 설명한다. 일 실시예에 따르면, 전자 장치가 펼쳐진 상태(flat state)(예: 도 2)인 경우, 제1 하우징 및 제2 하 우징은 실질적으로 180도의 각도를 이루며 동일 방향을 향하도록 배치될 수 있다. 디스플레이의 제1 디스플레이 영역의 표면과 제2 디스플레이 영역의 표면은 서로 180도를 형성하며, 동일한 방향(예: 전자 장치의 전면 방향)을 향할 수 있다. 폴딩 영역은 제1 디스플레이 영역 및 제2 디스플레이 영역 과 동일 평면을 형성할 수 있다. 일 실시예에 따르면, 전자 장치가 접힌 상태(folded state)(예: 도 3)인 경우, 제1 하우징 및 제2 하우징은 서로 마주보게 배치될 수 있다. 디스플레이의 제1 디스플레이 영역의 표면과 제2 디스 플레이 영역의 표면은 서로 좁은 각도(예: 약 0도에서 10도 사이)를 형성하며, 서로 마주볼 수 있다. 전자장치가 접힌 상태일 때, 폴딩 영역은 적어도 일부가 소정의 곡률을 가지는 곡면으로 이루어질 수 있 다. 일 실시예에 따르면, 전자 장치가 중간 상태(미도시)인 경우, 제1 하우징 및 제2 하우징은 서로 소정의 각도(a certain angle)로 배치될 수 있다. 디스플레이의 제1 디스플레이 영역의 표면과 제2 디스플레이 영역의 표면은 접힌 상태보다 크고 펼침 상태보다 작은 각도를 형성할 수 있다. 폴딩 영역 은 적어도 일부가 소정의 곡률을 가지는 곡면으로 이루어질 수 있으며, 이 때의 곡률은 접힌 상태(folded state)인 경우보다 작을 수 있다. 도 4는 본 개시의 일 실시예에 따른 전자 장치의 분해 사시도이다. 도 5는 본 개시의 일 실시예에 따른 전자 장 치에서, 하우징들이 결합된 모습을 나타내는 도면이다. 도 6은 본 개시의 일 실시예에 따른 전자 장치에서, 힌 지 플레이트들이 배치된 모습을 나타내는 도면이다. 도 7은 본 개시의 일 실시예에 따른 전자 장치의 내부에서, 힌지 모듈(들)과 전자 부품들의 배치를 나타내는 도면이다. 도 4 내지 도 7을 참조하면, 전자 장치(예: 도 1 내지 도 3의 전자 장치)는 하우징, 디스플레이 , 힌지 어셈블리, 배터리 및 기판부를 포함할 수 있다. 예를 들어, 하우징은 제1 하 우징, 제2 하우징, 제1 후면 커버 및 제2 후면 커버를 포함할 수 있다. 일 실시예에서, 하 우징은 힌지 커버을 포함하는 것으로 이해될 수 있다. 도 4의 제1 하우징, 제2 하우징, 힌 지 커버, 제1 후면 커버 및 제2 후면 커버의 구성은 도 2 및/또는 도 3의 제1 하우징, 제 2 하우징, 힌지 커버, 제1 후면 커버 및 제2 후면 커버의 구성과 전부 또는 일부와 동일할 수 있다. 일 실시예에 따르면, 제1 하우징 및 제2 하우징은 힌지 어셈블리의 양측으로 결합되도록 서로 조립될 수 있다. 예를 들어, 힌지 어셈블리는 제1 하우징과 제2 하우징 사이의 힌지 영역에 배 치되어 제1 하우징과 제2 하우징을 회동 가능하게 결합시킬 수 있다. 여기서, '힌지 영역'이라 함은, 힌지 어셈블리가 배치된 공간, 힌지 커버에 의해 적어도 부분적으로 둘러싸인 영역, 및/또는 디스플 레이의 폴딩 영역과 힌지 커버 사이의 공간을 언급한 것일 수 있다. 일 실시예에서, 힌지 영역 은 실질적으로 폴딩 영역과 상응하게 배치된 공간으로 이해될 수 있다. 일 실시예에 따르면, 도 5 내지 도 7에 예시된 바와 같이, 힌지 어셈블리는 적어도 하나의 힌지 모듈(22 9)과, 복수의 힌지 플레이트(227a, 227b)를 포함할 수 있다. 도시된 실시예에서, 3개의 힌지 모듈이 폴딩 축(A) 방향을 따라 순차적으로 배치되며, 가요성 인쇄회로 기판이 2개의 힌지 모듈 사이의 영역을 통 해 폴딩 축(A)을 가로지르게 배치될 수 있다. 후술되겠지만, 카메라 조립체(예: 도 2 또는 도 3의 카메라 모듈)의 주위에서, 복수의 안테나 또는 방사체가 배치(또는 구현)됨으로써, 가요성 인쇄회로 기판의 설계 자유도가 높아질 수 있다. 예를 들어, 복수의 하우징(210, 220) 중 하나에 더 많은 수의 안테나가 구현되 면서 통신 회로(예: 도 1의 통신 모듈)와 동일한 하우징에 배치됨으로써, 폴딩 축(A)을 가로지르는 배선에 서 통신 회로와 안테나 사이의 전송 선로가 간소화될 수 있다. 도시되지는 않지만, 힌지 모듈은, 폴딩 축(A)(들)을 제공하는 힌지부와, 하우징(210, 220)들의 상대적인 이동을 연동시키는(interlocking) 연동부를 포함할 수 있다. 예를 들어, 하우징(210, 220)(들)은 힌지 모듈 에 결합되어 힌지 모듈 또는 힌지 커버에 대하여 회동할 수 있다. 연동부는, 예를 들면, 제1 하 우징이 회동함에 따라 힌지 커버 상에서 회전하는 제1 기어와, 제2 하우징이 회동함에 따라 힌 지 커버 상에서 회전하는 제2 기어를 포함할 수 있다. 일 실시예에서, 제1 기어와 제2 기어가 치합된 때, 제1 하우징과 제2 하우징은 서로에 대하여 역방향으로 회동하도록 구성될 수 있다. 예를 들어, 제1 하우징이 힌지 커버 상에서 시계 방향으로 회동할 때, 힌지 어셈블리(예: 힌지 모듈의 연 동부)는 제2 하우징을 힌지 커버 상에서 반시계 방향으로 회동시킬 수 있다. 일 실시예에서는, 제1 기어와 제2 기어 사이에 복수(예: 한 쌍 또는 두 쌍)의 기어가 더 배치됨으로써, 제1 하우징과 제2 하우징 의 회동을 연동시킬 수 있다. 힌지 모듈(예: 연동부)에 포함되는 기어의 수는 배치 공간의 크기나 형 상과 같은 전자 장치의 설계 사양에 따라 적절하게 선택될 수 있다. 일 실시예에 따르면, 힌지 플레이트(227a, 227b)(들)는 하우징(210, 220)들 중 어느 하나를 힌지 모듈에 연결시킬 수 있다. 예를 들어, 힌지 플레이트(227a, 227b) 중 ‘227a’로 지시된 힌지 플레이트는 제1 하우징 을 힌지 모듈(들)에 기계적으로 연결하거나 고정시킬 수 있으며, ‘227b’로 지시된 힌지 플레이트는제2 하우징을 힌지 모듈(들)에 기계적으로 연결하거나 고정시킬 수 있다. 도 2의 펼침 상태일 때, 힌 지 플레이트(227a, 227b)들은 연속된 평면을 이루게 정렬되어 디스플레이의 일부(예: 도 2 또는 도 4의 폴 딩 영역)를 지지할 수 있다. 도 3의 접힘 상태일 때, 힌지 플레이트(227a, 227b)들은 서로에 대하여 경사 지게 배치될 수 있으며, 곡면 형상으로 변형된 폴딩 영역을 수용하는 공간을 구현할 수 있다. 일 실시예에 서는, 힌지 플레이트(227a, 227b)들이 서로에 대하여 경사진 상태로 폴딩 영역을 수용하는 공간을 제공할 때, 폴딩 영역은 접힌 상태에서 지정된 곡률 이내의 곡면 형상을 유지할 수 있다. 예를 들어, 도 3의 접힌 상태에서, 폴딩 영역이 지정된 크기의 곡률 반경을 가짐으로써 과도한 접힘으로 인한 손상으로부터 보호될 수 있고, 제1 디스플레이 영역과 제2 디스플레이 영역의 표면은 실질적으로 0도 각도를 이루게 배치 될 수 있다. 일 실시예에 따르면, 제1 하우징은 전자 장치의 부품(예: 제1 회로 기판 및/또는 제1 배터리 )을 지지할 수 있는 제1 지지 영역(예: 제1 지지 부재) 및 상기 제1 지지 영역의 적어도 일부를 둘러싸는 제1 측벽을 포함할 수 있다. 제1 측벽은 전자 장치의 제1 측면(예: 도 2의 제1 측면 (210c))을 포함할 수 있다. 일 실시예에 따르면, 제2 하우징은 전자 장치의 부품(예: 제2 회로 기판 및/또는 제2 배터리)을 지지할 수 있는 제2 지지 영역 및 상기 제2 지지 영역의 적어도 일부를 둘러싸는 제2 측벽을 포함할 수 있다. 상기 제2 측벽은 전자 장치의 제2 측면(예: 도 2 의 제2 측면(220c))을 포함할 수 있다. 일 실시예에 따르면, 제1 측벽 또는 제2 측벽은 전자 장치(예: 제1 하우징 또는 제2 하우 징)의 전면과 후면 사이의 공간을 적어도 부분적으로 둘러싸는 프레임 형상으로 이해될 수 있다. 일 실시 예에서, 지지 영역(212, 222)들은 측벽(211, 221)들 중 어느 하나로부터 연장된 구조일 수 있다. 예를 들어, 설 명의 편의를 위해 지지 영역(212, 222)들과 측벽(211, 221)들을 구분하여 설명하고 있으나, 본 개시의 실시예 (들)가 이에 한정되지 않으며, 지지 영역(212 또는 222)들과 측벽(211 또는 221)들은 하나의 몸체(single bod y)로 구현될 수 있다. 일 실시예에서는, 지지 영역(212 또는 222)들과 측벽(211 또는 221)들이 절연 물질과 전 도성 물질이 조합되어 구현될 수 있으며, 이 경우, 하우징(210, 220)들은 인서트 사출 공정 및/또는 컴퓨터 수 치 제어 가공 공정을 통해 지지 영역(212 또는 222)들과 측벽(211 또는 221)들이 일체형으로 구현될 수 있다. 후술되는 실시예를 통해 살펴보겠지만, 전도성 물질을 포함할 때, 지지 영역(212, 222)들과 측벽(211, 221)들의 일부분은 안테나(들) 또는 방사체(들)로서 기능할 수 있다. 일 실시예에 따르면, 앞서 언급한 바와 같이, 전자 장치에서 하우징(210, 220)들 중 적어도 하나의 일부분 은 안테나로서 기능할 수 있다. 일 실시예에서, 전자 장치의 안테나로서 기능하는 부분은 하우징(210, 220)들 중 적어도 하나의 측면을 구현할 수 있다. 일 실시예에서, 전자 장치의 안테나로서 기능하는 부분 은 하우징(210, 220)들 중 적어도 하나의 측면에 인접하게, 및/또는 Z축에 교차하는 방향을 지향하도록 배치될 수 있다. 예를 들어, 전자 장치의 안테나로서 기능하는 부분은 하우징(210, 220)들의 일부분에 의해 구현 되거나, 하우징(210, 220)들과는 별도의 부품 형태로 제작되면서 하우징(210, 220)의 가장자리에 인접하게 배치 될 수 있다. 일 실시예에서, ‘전자 장치의 안테나로서 기능하는 부분은 하우징(210, 220)들의 일부분에 의해 구현된다’라 함은, 예를 들어, 안테나로서 기능하는 부분이 하우징(210, 220)들 중 적어도 하나의 측면을 형성하도록 배치된 예를 포함하는 것으로 이해될 수 있다. 일 실시예에 따르면, 도시되지는 않지만, 제1 하우징은 제1 지지 영역에 배치된 제1 방수 부재를 포 함하거나, 및/또는 제2 하우징이 제2 지지 영역에 배치된 제2 방수 부재를 포함할 수 있다. 제1 방수 부재 및/또는 제2 방수 부재는 디스플레이와 지지 영역(212, 222)(들) 사이의 간격에 배치되어 외부로부터 수분이나 이물질이 제1 하우징 및/또는 제2 하우징의 내부로 유입되는 것을 억제할 수 있다. 일 실시예에 따르면, 디스플레이는 제1 디스플레이 영역, 제2 디스플레이 영역 및/또는 폴딩 영 역을 포함할 수 있다. 도 3의 제1 디스플레이 영역, 제2 디스플레이 영역 및 폴딩 영역의 구성은 도 2의 제1 디스플레이 영역, 제2 디스플레이 영역 및 폴딩 영역의 구성과 전부 또는 일 부와 동일할 수 있다. 일 실시예에 따르면, 전자 장치는 서브 디스플레이를 더 포함할 수 있다. 일 실시예에서, 서브 디스 플레이는 디스플레이 영역(231, 232)과 다른 방향에서 화면을 표시할 수 있다. 예를 들어, 서브 디스플레 이는 제1 디스플레이 영역의 반대 방향에서 화면을 출력할 수 있다. 일 실시예에 따르면, 서브 디스 플레이는 제1 후면 커버 상에 배치될 수 있다. 예를 들어, 서브 디스플레이는 제1 후면 커버 의 일부로서 이해될 수 있으며, 일 실시예에서는, 서브 디스플레이가 제1 후면 커버의 내부로배치되고 제1 후면 커버를 통해 외부에 시각적으로 노출될 수 있다. 일 실시예에 따르면, 전자 장치는 복수의 카메라가 조합된 카메라 조립체(예: 도 2 또는 도 3의 카메 라 모듈)를 포함할 수 있다. 도시되지는 않지만, 디스플레이의 일부분(예: 제1 디스플레이 영역 또는 제2 디스플레이 영역)을 투과하여 피사체를 촬영하는 카메라 또는 서브 디스플레이의 일부분을 투과하여 피사체를 촬영하는 카메라를 더 포함할수 있다. 후술되겠지만, 카메라 조립체는, 화각이 서로 다 른 복수의 카메라를 포함할 수 있다. 예를 들어, 대략 100도 이상의 화각을 가진 카메라(예: 도 10의 제1 카메 라), 대략 65도 내지 85도의 화각을 가진 카메라(예: 도 10의 제2 카메라) 및/또는 대략 15도 내지 40도의 화각을 가진 카메라(예: 도 10의 제3 카메라)가 카메라 조립체에 포함될 수 있다. 일 실시예 에서는, 상술한 화각의 범위와는 다른 화각(예: 대략 40도 내지 60도)을 가진 추가의 카메라가 카메라 조립체에 포함될 수 있다. 일 실시예에 따르면, 전자 장치 및/또는 제2 후면 커버는 카메라 조립체에 상응하게 배치된 커 버 플레이트를 포함할 수 있다. 커버 플레이트는 예를 들어, 카메라 조립체에 상응하는 광학 경 로(예: 관통 홀)를 제공하면서, 광학 경로를 전자 장치의 외관에 조화를 이루게 할 수 있다. 전자 장치 의 외관에서 심미감을 부여하기 위해 또는 조화로운 외관을 구현하기 위해, 커버 플레이트는 금속 재 질을 포함할 수 있다. 예를 들어, 커버 플레이트는 금속 재질로 제작되거나, 금속 재질로 마감 처리(예: 인쇄, 증착, 코팅 또는 도금)될 수 있다. 일 실시예에서, 커버 플레이트는 제2 후면 커버의 일부로서 이해될 수 있으며, 일부분(예: 가장자리)이 제2 후면 커버의 내부로 배치되고 다른 일부분은 외부에 노출 된 상태로 배치될 수 있다. 후술되겠지만, 커버 플레이트가 금속 재질, 예를 들어, 전도성을 가진 물질을 포함할 때, 전송 배선(도 24 또는 도 26의 가요성 인쇄회로 기판(373b, 383)들)과 중첩하는 영역의 적어도 일부 에 노치부(notch portion)을 포함함으로써 전자계 결합이 형성되는 것을 억제할 수 있다. 일 실시예에 따르면, 배터리는 제1 하우징 내에 배치된 제1 배터리 및 제2 하우징 내에 배 치된 제2 배터리를 포함할 수 있다. 일 실시예에 따르면, 제1 배터리는 제1 회로 기판과 연결되 고, 제2 배터리는 제2 회로 기판에 연결될 수 있다. 일 실시예에 따르면, 배터리는 전자 장치 의 적어도 하나의 구성 요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 일 실시예에 따르면, 기판부는 제1 하우징 내에 배치된 제1 회로 기판 및 제2 하우징 내에 배치된 제2 회로 기판을 포함할 수 있다. 일 실시예에 따르면, 제1 회로 기판과 제2 회로 기판 은 적어도 하나의 가요성 인쇄회로 기판에 의하여 전기적으로 연결될 수 있다. 일 실시예에 따르면, 가요 성 인쇄회로 기판의 적어도 일부는 힌지 영역 또는 힌지 구조(예: 힌지 어셈블리)를 가로질러 배치될 수 있다. 일 실시예에 따르면, 상기 제1 회로 기판과 제2 회로 기판은, 제1 하우징, 제2 하우징 , 제1 후면 커버 및 제2 후면 커버에 의해 형성되는 공간의 내부에 배치될 수 있다. 제1 회로 기판과 제2 회로 기판에는 전자 장치의 다양한 기능을 구현하기 위한 부품들이 배치될 수 있다. 후술되겠지만, 제1 회로 기판과 제2 회로 기판 중 어느 하나는 카메라 조립체를 수용하는 개구 영역(예: 도 12 또는 도 13의 개구 영역(364a))을 제공할 수 있다. 일 실시예에 따르면, 전자 장치는 스피커(208a, 208b)를 포함할 수 있다. 일 실시예에 따르면, 스피커 (208a, 208b)는 전기 신호를 소리로 변환할 수 있다. 일 실시예에 따르면, 스피커(208a, 208b)는 제1 하우징 , 제2 하우징, 제1 후면 커버 및 제2 후면 커버에 의해 형성되는 공간의 내부에 배치될 수 있다. 일 실시예에 따르면, 스피커(208a, 208b)는 전자 장치의 상부(+Y 방향)에 위치한 상부 스피커(208a) 및 전자 장치의 하부(-Y 방향)에 위치한 하부 스피커(208b)를 포함할 수 있다. 본 개시에서 스피커(208a, 208b)는 하나의 하우징(예: 도 4의 제1 하우징) 내에 위치한 것으로 도시되었으나 이는 선택적인 구조이다. 예를 들어, 스피커(208a, 208b)는 제1 하우징 또는 제2 하우징 중 적어도 하나 내에 위치 할 수 있다. 도 4의 스피커(208a, 208b)의 구성은 도 1의 음향 출력 모듈의 구성과 전부 또는 일부와 동일 할 수 있다. 일 실시예에 따르면, 전자 장치는 리어 부재(또는 리어 케이스)를 포함할 수 있다. 일 실시예에 따르 면, 리어 부재는 하우징(예: 제2 하우징) 내에 배치될 수 있다. 일 실시예에 따르면, 리어 부재 는 적어도 하나의 안테나를 수용할 수 있다. 일 실시예에서, 리어 부재은 안테나를 배치하 기 위한 구조물로서 기능할 수 있으며, 회로 기판(262, 264) 중 어느 하나를 지지 또는 보호하는 구조물로서 기 능할 수 있다. 예를 들어, 리어 부재 중 참조번호 '279'로 지시된 부분은 회로 기판(262, 264)의 일부를지지할 수 있다. 일 실시예에 따르면, 전자 장치는 안테나를 포함할 수 있다. 안테나(275a, 275b)는 예를 들어, UWB(ultra wide band) 안테나(275a), NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나(275b)를 포함할 수 있다. 안테나는 예를 들어, 외부 장치와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신 할 수 있다. 일 실시예에서는, 하우징의 일부 또는 그 조합에 의하여 안테나 구조가 형성될 수 있다. 예를 들어, 안테 나는 전자 장치의 외부로 적어도 일부가 노출되고, 전자 장치의 외부의 적어도 일부를 형성하는 추가의 안테나(275c)를 포함할 수 있다. 일 실시예에서, 안테나(275c)는 외부 전자 장치와의 통신(예: 와이파이)을 위하여 사용될 수 있다. 예를 들어, 안테나(275c)는 리어 부재의 상부(271a) 또는 하부(271 b)에 위치될 수 있다. 이 외에도, 전자 장치는 측벽(211, 221)들의 일부분 또는 카메라 조립체와 같 은 전자 부품과 인접하게 배치된 추가의 안테나를 더 포함할 수 있으며, 이에 관해서는 후술되는 실시예를 통해 살펴보게 될 것이다. 이하의 상세한 설명에서, 한 쌍의 하우징(또는, '하우징 구조'라 함)이 힌지 구조(또는, '힌지 어셈블리' 라 함)에 의해 회전 가능하게 결합된 구성에 관해 예시될 수 있다. 하지만 이러한 실시예가 본 문서에 개시된 다양한 실시예에 따른 전자 장치를 한정하지 않음에 유의한다. 예를 들어, 본 개시의 실시예(들)에 따른 전자 장치는 세개 이상의 하우징을 포함할 수 있으며, 이하에서 개시하는 실시예의 \"한 쌍의 하우징\"은 \"세개 이상의 하우징 중 서로 회전 가능하게 결합된 두개의 하우징\"을 언급한 것일 수 있다. 일 실시예에서는, 상술한 제1 하 우징 또는 제2 하우징 중 어느 하나에 도 1의 전자 장치의 구성이 모두 포함될 수 있으며, 이 경우, 제1 하우징 또는 제2 하우징 중 어느 하나 자체로서 전자 장치의 실시예로 이해될 수 있다. 예 를 들어, 본 개시의 실시예(들)에 따른 전자 장치는, 하우징(들)의 수, 또는 복수의 하우징 사이에 구현되는 결 합 구조에 의해 한정되지 않음에 유의한다. 후술되는 실시예에서는, 서로 중복되는 구성요소 또는 선행 실시예를 통해 용이하게 이해될 수 있는 구성요소에 대하여 동일한 참조번호를 부여하거나 생략하고, 그 상세한 설명이 생략될 수 있다. 도면에서 참조번호가 부여 되었지만 해당 도면을 참조한 상세한 설명에서 언급되지 않더라도 본 개시의 상세한 설명 전반을 통해 당업자라 면 해당 구성을 용이하게 이해할 수 있을 것이다. 도 8은 본 개시의 일 실시예에 따른 전자 장치의 접촉 편을 나타내는 사시도이다. 도 9는 본 개시의 일 실시예 에 따른 전자 장치에서, 접촉 편이 배치된 모습을 나타내는 사시도이다. 도 8과 도 9를 더 참조하면, 전자 장치는 접촉 편(contact piece)(들)을 포함할 수 있다. 접촉 편 은 예를 들어, 알파벳 'L'자 형상으로 절곡된 플레이트 또는 판 스프링으로서, 측벽(예: 도 4의 제2 측벽)의 제1 부분(321a)에 배치될 수 있다. 측벽의 제1 부분(321a)은, 예를 들면, 프레임 형상의 일 부분을 이루며, 적어도 부분적으로 전도성 물질을 포함할 수 있다. 접촉 편은, 제1 부분(321a)의 내측면에 배치되는 고정부(329a)와, 고정부(329a)에 대하여 지정된 각도로 절곡된 접촉부(329b)를 포함할 수 있다. 고정 부(329a)가 제1 부분(321a)의 내측면에 배치된 상태에서, 접촉부(329b)는 제1 부분(321a)의 내측면으로부터 하 우징(예: 도 4의 제2 하우징)의 내측으로 연장된 것으로 이해될 수 있다. 예를 들어, 고정부(329a)는 용접이나 솔더링에 의해, 및/또는 전도성 접착제나 전도성 테이프에 의해 제1 부분(321a)의 내측면에 고정될 수 있다. 도시된 실시예에서, 접촉 편은 금속 플레이트를 가공하여 제작될 수 있으며, 가공 과정에서 가장자 리의 일부에는 노치(notch) 또는 홈(recess)이 생성될 수 있다. 하지만, 도면에 예시된 바에 의해 접촉 편(32 9)의 형상이나 구조가 한정되지 않으며, 접촉 편의 가장자리는 실질적으로 직선 형태일 수 있다. 일 실시예에 따르면, 측벽의 제1 부분(321a)은 접촉 편을 통해 통신 회로(예: 도 1의 통신 모듈 )와 전기적으로 연결될 수 있다. 예를 들어, 전자 장치, 프로세서(예: 도 1의 프로세서) 및/또 는 통신 모듈(예: 도 1의 통신 모듈)은 제1 부분(321a)을 이용하여 무선 통신을 수행할 수 있다. 일 실시 예에서, 제1 부분(321a)은 대략 1.8GHz의 주파수 대역, 대략 2.4GHz의 주파수 대역 및/또는 3.5GHz의 주파수 대 역 중 적어도 하나에서 무선 통신을 수행하는 방사체로서 기능할 수 있다. 하지만 본 개시의 실시예(들)가 이에 한정되지 않으며, 방체로서 기능하는 부분들을 통해 수행되는 무선 통신 주파수 대역은 상술한, 또는 후술될 주 파수 대역에 한정되지 않음에 유의한다. 일 실시예에서, 제1 부분(321a)이 방사체로서 기능할 때, 접촉 편(32 9)은 급전점으로서 제공되고, 도 9의 'GP'로 지시된 부분은 단락점 또는 접지점으로서 제공될 수 있다. 예를 들 어, 제1 부분(321a)은 역-F(inverted-F) 형 안테나로 구현될 수 있다.일 실시예에 따르면, 측벽은 제1 부분(321a)에 인접하면서 제1 부분(321a)에 대하여 분절된 제2 부분 (321b)을 포함할 수 있다. 일 실시예에서, 제2 부분(321b)(예: 외측 표면)은, 전자 장치의 외부에서 바라 볼 때, 제1 부분(321a)과 연속된 곡면 또는 연속된 평면을 이루게 배치될 수 있다. 도 9에서 도면에 도시되지는 않지만 '321c'로 지시된 부분은 실질적으로 분절 구조(예: 도 14, 도 16 및/또는 도 17의 분절 구조(321c))를 예시한 것일 수 있다. 예를 들어, 제1 부분(321a)과 제2 부분(321b)은 전기적으로 서로에 대하여 절연되면서, 기계적으로는 분절 구조(321c)로서 제공되는 절연 물질에 의해 연결 또는 결합될 수 있다. 전도성 물질(예: 금 속)과 분절 구조(321a)를 포함할 때, 하우징(예: 측벽 및/또는 지지 영역)은 인서트 사출 공정 을 통해 제작될 수 있다. 예를 들어, 먼저 제작된 전도성 부분을 금형에 투입한 상태로 분절 구조(321c)를 성형 할 수 있으며, 성형 후 필요에 따라 컴퓨터 수치 제어 가공과 같은 추가의 공정을 통해 설계 형상의 하우징 이 제작될 수 있다. 도 10은 본 개시의 일 실시예에 따른 전자 장치의 카메라 조립체를 나타내는 도면이다. 도 11은 본 개시의 일 실시예에 따른 전자 장치에서, 도 10의 카메라 조립체 중 제3 카메라를 나타내는 사시도이다. 도 10과 도 11을 참조하면, 카메라 조립체(예: 도 4 또는 도 7의 카메라 조립체)는, 복수의 카메라 (341, 342, 343)를 포함할 수 있다. 예를 들어, 카메라 조립체는 초광각 성능을 제공하는 제1 카메라 , 광각 성능을 제공하는 제2 카메라 및/또는 망원 성능을 제공하는 제3 카메라를 포함할 수 있 다. 여기서, '초광각', '광각' 및/또는 '망원'과 같은 광학적 성능(예: 화각이나 초점 거리)은 카메라(341, 342, 343)들의 사양에 의해 정의된 것으로 한정되지 않음에 유의한다. 예를 들어, 본 개시의 실시예(들)에서 언 급되는 카메라(341, 342, 343)들의 광학적 성능은, 카메라 조립체에 포함된 카메라(341, 342, 343)들의 화 각이나 초점 거리의 상대적인 비교에 의해 정의될 수 있다. 일 실시예에 따르면, 카메라(341, 342, 343)들은 전자 장치 또는 하우징의 길이 방향(예: 도 4의 Y축 방향)을 따라 배열될 수 있다. 일 실시예에서는, 카메라(341, 342, 343)들이 전자 장치의 폭 방향(예: 도 4의 X축 방향)을 따라 배열되거나, 폐루프 궤적을 따라 배열될 수 있다. 예를 들어, 카메라(341, 342, 343)들의 수와 배열은 본 개시의 실시예(들)를 한정하지 않으며, 전자 장치의 사양에 따라 다양하게 변경될 수 있다. 일 실시예에서, 카메라(341, 342, 343)들은 배선 기판(347a, 347b, 347c)(들)을 포함함으로써, 회로 기 판(예: 도 4의 제2 회로 기판 또는 도 12의 회로 기판)에 전기적으로 연결될 수 있다. 일 실시예에 따르면, 전자 장치 및/또는 카메라 조립체는, 지지 돌기를 더 포함할 수 있다. 일 실시에에서, 다른 전자 부품(예: 도 15의 안테나 모듈)이 카메라 조립체와 인접하게 배치된 때, 지지 돌기는 다른 전자 부품을 지지하는 구조, 또는 다른 전자 부품의 배선(예: 도 15의 제1 가요성 인쇄회로 기판)의 정렬 구조를 제공할 수 있다. 도시된 실시예에서, 지지 돌기는 제3 카메라의 한 측면에 서 돌출된 것으로 이해될 수 있다. 하지만 본 개시의 실시예(들)가 이에 한정되지 않으며, 추가의 지지 돌기가 제1 카메라나 제2 카메라에 제공될 수 있고, 및/또는 제1 카메라나 제2 카메라에 지지 돌 기가 제공된 경우 제3 카메라의 지지 돌기가 생략될 수 있다. 예를 들어, 지지 돌기는 카메라 조립체에 인접하게 배치된 전자 부품의 위치나 배선 경로에 따라 다양하게 구현될 수 있다. 도 12는 본 개시의 일 실시예에 따른 전자 장치의 회로 기판을 나타내는 제1 도면이다. 도 13은 본 개시의 일 실시예에 따른 전자 장치의 회로 기판을 나타내는 제2 도면이다. 도 12와 도 13을 참조하면, 회로 기판(예: 도 4의 제2 회로 기판)은 일측 가장자리에서 개구 영역 (364a)을 제공할 수 있다. 참조번호를 부여하지는 않았지만, 회로 기판의 적어도 일면에는 집적회로 칩과 같은 전기/전자 소자(electric/electronic component)(들), 및/또는 각종 커넥터가 배치될 수 있다. 커넥터(들)는 카메라 조립체와 같은 전자 부품과의 접속 구조를 제공할 수 있다. 개구 영역(364a)은 예를 들면, 카메라 조립체의 적어도 일부분을 수용하는 공간을 제공할 수 있다. 일 실시예에서, 하우징의 전면(예: 도 2의 제2 전면(220a))과 후면(예: 도 2의 제2 후면(220b)) 사이에서 회로 기판이 카메라 조립 체와 두께 방향(예: 도 4의 Z축 방향)에서 중첩하게 정렬된 때, 전자 장치의 두께가 증가될 수 있다. 개구 영역(364a)은 카메라 조립체가 배치될 수 있는 공간 또는 영역을 제공하며, 따라서 카메라 조립체 와 회로 기판의 배치에 있어 전자 장치의 두께 증가를 억제할 수 있다. 예를 들어, 회로 기판 은 하우징의 전면과 후면 사이에의 두께 방향에서 카메라 조립체와는 중첩하지 않게 배치될 수 있다. 일 실시예에 따르면, 회로 기판은 개구 영역(364a)의 일부분을 정의하는, 또는 개구 영역(364a)의 적어도 일부분을 둘러싸는 연장부(364b)를 포함할 수 있다. 후술되겠지만, 연장부(364b)는 예를 들면, 하우징 내에서 제1 부분(321a)과 카메라 조립체 사이에 배치될 수 있다. 일 실시예에서, 접촉 편(예: 접촉부 (329b))은 적어도 부분적으로 연장부(364b)와 마주보게 배치될 수 있다. 예를 들어, 연장부는 전자 장치의 폭 방향(예: 도 4의 X축 방향)에서 측벽(예: 제1 부분)과 카메라 조립체 사이에 배치되고, 전자 장치의 두 께 방향(예: 도 4의 Z축 방향)에서 접촉 편에 마주보게 배치될 수 있다. 일 실시예에서는, 전자 장치의 두 께 방향에서 접촉 편이 하우징의 전면과 연장부(364b) 사이에 배치된 것으로 이해될 수 있다. 일 실 시예에서, 연장부(364b)는 실질적으로 접촉 편 및/또는 측벽(예: 제1 부분(321a))을 회로 기판 에 전기적으로 연결시키는 부분으로 활용될 수 있다. 일 실시예에 따르면, 제1 부분(321a) 및/또는 접촉 편이 회로 기판에 전기적으로 연결됨에 있어, 전 자 장치 및/또는 회로 기판은, 회로 기판(예: 연장부(364b))의 일면에 배치된 판 스프링 구조의 접촉 단자(contact terminal)(364c)를 더 포함할 수 있다. 일 실시예에서, 제1 부분(32a)이 방사체로서 기능할 때, 접촉 단자(364c)는 접촉 편(예: 접촉부(329b))에 직접 접촉됨으로써, 제1 부분(321a) 및/또는 접촉 편 (329b)이 접촉 단자(364c)를 통해 회로 기판에 전기적으로 연결될 수 있다. 예를 들어, 방사체로서 기능하 는 제1 부분(321a)은 접촉 편 및/또는 접촉 단자(364c)를 경유하여 급전 신호를 제공받을 수 있다. 일 실 시예에서, 접촉부(329b)가 굴곡진 형상으로 제작되어 회로 기판(예: 연장부(364b))에 직접 접촉될 수 있으 며, 이 경우, 접촉 단자(364c)는 판 스프링 구조가 아닌 평판 형상의 패드로 대체될 수 있다. 일 실시예에 따르면, 접촉 편과 접촉 단자(364c)의 접촉 상태를 안정적으로 유지함에 있어, 접촉 편 또는 접촉 단자(364c)는 판 스프링 구조를 가질 수 있다. 예를 들어, 회로 기판이 하우징 상에 배치 된 때, 접촉 편과 접촉 단자(364c)가 접촉되면서 탄성력을 축적한 상태로 부분적으로 변형되거나 부분적으 로 이동할 수 있다. 일 실시예에서, 연장부(364b)가 제1 부분(321a)과 카메라 조립체 사이의 좁은 간격에 배치될 수 있을 정도로 작은 폭을 가질 수 있다. 이 경우, 접촉 편과 접촉 단자(364c)가 축적한 탄성력은 연장부를 변형 또는 손상시킬 수 있다. 예를 들어, 연장부(364b)가 변형될 때 접촉 편과 접촉 단자(364c) 의 접속을 안정적으로 유지하기 어려울 수 있고, 연장부(364b)의 내구성이 저하될 수 있다. 일 실시예에 따르면, 전자 장치 및/또는 회로 기판은 지지 플레이트(364d)를 더 포함함으로써, 연장 부(364c)의 변형을 억제할 수 있으며, 접촉 편과 접촉 단자(364c)의 접속 상태를 안정적으로 유지할 수 있 다. 일 실시예에서, 지지 플레이트(364d)는 스테인리스 스틸과 같은 금속 재질로 제작될 수 있으며, 회로 기판 의 타면에 배치될 수 있다. 일 실시예에서, 지지 플레이트(364d)는 적어도 부분적으로 연장부(364b)의 타 면에 배치된 것으로 이해될 수 있다. 예를 들어, 접촉 편과 접촉 단자(364c)에 의해 연장부(364b)에 탄성 력이 가해지더라도, 지지 플레이트(364d)가 연장부(364b)를 지지함으로써 연장부(364b)의 변형이나 손상을 억제 할 수 있다. 일 실시예에 따르면, 전자 장치 및/또는 회로 기판은 연장부(364b)에 인접하는 영역에서 회로 기판 및/또는 지지 플레이트(364d)를 관통하는 체결 홀(364e)을 더 포함할 수 있다. 예를 들어, 회로 기판 의 하우징(예: 지지 영역) 내에 고정함에 있어, 스크류와 같은 체결 부재가 체결 홀(364e)을 통 해 회로 기판과 지지 플레이트(364d)를 지지 영역에 고정할 수 있다. 체결 부재가 제공하는 체결력은 탄성력에 의해 연장부(364b) 및/또는 지지 플레이트(364d)가 변형되는 것을 더욱 억제할 수 있다. 도 14는 본 개시의 일 실시예에 따른 전자 장치에서, 도 11의 카메라 조립체와 도 13의 회로 기판이 하우징에 배치된 모습을 나타내는 도면이다. 도 14를 더 참조하면, 측벽에 의해 적어도 부분적으로 둘러싸인 공간 내에서, 카메라 조립체는 측벽 의 일부분에 인접하게 배치될 수 있다. 예를 들어, 카메라 조립체는 하우징의 지지 영역 상에서 측벽의 제1 부분(321a) 및/또는 제2 부분(321b)과 인접하게 배치될 수 있다. 카메라 조립체의 지지 돌기는, 예를 들어, 측벽(예: 제1 부분(321a))을 향하는 방향으로 돌출된 형태로 배치될 수 있 다. 예를 들어, 지지 돌기는 제3 카메라의 한 측면에서 제1 부분을 향해 돌출된 것으로 이해될 수 있다. 후술되겠지만, 안테나 모듈(예: 도 15의 안테나 모듈)로부터 연장된 제1 가요성 인쇄회로 기판 은 부분적으로 측벽과 지지 돌기 사이에 배치될 수 있으며, 지지 돌기의 적어도 일부분을 감싸는 상태로 절곡될 수 있다. 일 실시예에 따르면, 회로 기판은 연장부(364b)가 카메라 조립체와 제1 부분(321a) 사이의 영역에 위 치된 상태로 지지 영역 상에(또는 측벽의 내측에) 배치될 수 있다. 예를 들어, 카메라 조립체와 제1 부분(321a) 사이에서, 회로 기판의 접촉 단자(364c)가 접촉 편에 접촉됨으로써, 측벽(예: 제1 부분(321a))이 접촉 편과 접촉 단자(364c)를 순차적으로 경유하여 연장부(364b) 및/또는 회로 기판에 전기적으로 연결될 수 있다. 일 실시예에 따르면, 측벽의 제2 부분(321b)이 회로 기판에 전기적으로 연결됨으로써 안테나(예: 방 사체)로서 기능할 수 있다. 예를 들어, 도 1의 프로세서 및/또는 통신 모듈은 제1 부분(321a)과는 다 른 주파수 대역(예: 대략 850MHz 주파수 대역 및/또는 대략 900MHz 주파수 대역)에서 제2 부분(321b)을 이용하 여 무선 통신을 수행하도록 구성될 수 있다. 일 실시예에서, 제1 부분(321a)과 제2 부분(321b) 외에도, 측벽 의 다른 전도성 부분(들)이 회로 기판과 전기적으로 연결됨으로써 다양한 주파수 대역의 무선 통신을 수행할 수 있다. 일 실시예에서, 전도성 부분들은 분절 구조(예: 도 14, 도 16 및/또는 도 17의 분절 구조 (321c))에 의해 서로에 대하여 전기적으로 절연되면서 기계적으로 연결 또는 결합될 수 있다. 도 14에서, 참조 번호 'EP'로 지시된 지점(들)은 측벽을 이루는 전도성 부분(들)이 회로 기판에 전기적으로 연결된 지 점(예: 급전점 또는 접지점)을 예시한 것일 수 있다. 도 15는 본 개시의 일 실시예에 따른 전자 장치의 안테나 모듈을 나타내는 사시도이다. 도 15를 참조하면, 안테나 모듈은 안테나 기판과, 안테나 기판으로부터 연장된 제1 가요성 인쇄 회로 기판을 포함할 수 있다. 일 실시예에서, 제1 가요성 인쇄회로 기판은 안테나 모듈과 구분 되는 구성으로 이해될 수 있다. 일 실시예에서는, 안테나 기판과 제1 가요성 인쇄회로 기판은 실질적 으로 하나의 기판으로 구현될 수 있으며, 이 경우, 제1 가요성 인쇄회로 기판이 안테나 기판보다 유 연하게('flexibly' 또는 'softly') 제작될 수 있다. 안테나 모듈은, 예를 들어, 수십 GHz 이상의 주파수 대역의 밀리미터파(mmWave) 통신을 수행하도록 구성될 수 있다. 예를 들어, 안테나 기판의 일면에는 인쇄 회로 패턴 형태로 구현된 복수의 방사체가 제공될 수 있으며, 방사체들이 배열된 면이 지향하는 방향으로 전자 장치는 무선 통신을 수행할 수 있다. 도시된 실시예에서는 안테나 기판의 일면에 보호 몰딩이 제공되 어 방사체들이 은폐된 구조가 예시되고 있음에 유의한다. 일 실시예에 따르면, 제1 가요성 인쇄회로 기판은 적어도 1회 절곡된 상태로 전자 장치 및/또는 하우 징의 내부에 배치될 수 있다. 제1 가요성 인쇄회로 기판은 안테나 기판과 절곡 부분(예: 참조번 호 'BP'로 지시된 부분) 사이의 제1 정렬 부분(373a)과 제1 정렬 부분(373a)으로부터 연장된 제2 정렬 부분 (373b)으로 구분하여 설명될 수 있다. 일 실시예에서 도 15에 도시된 제1 가요성 인쇄회로 기판은 하우징 상에 조립된 상태로 예시된 것으로서, 최초 제작 상태에서 제1 가요성 인쇄회로 기판은 안테나 기판 과 실질적으로 평행할 수 있다. 절곡된 후, 제2 정렬 부분(373b)은 안테나 기판에 대하여 및/또는 제 1 정렬 부분(373a)에 대하여 경사지게 또는 실질적으로 수직하게 배치될 수 있다. 일 실시예에서, 제1 가요성 인쇄회로 기판은 제2 정렬 부분(373b)의 단부에서 회로 기판(예: 도 4의 제2 회로 기판 또는 도 17의 회로 기판)에 전기적으로 연결될 수 있다. 일 실시예에 따르면, 전자 장치 및/또는 제1 가요성 인쇄회로 기판의 절곡 부분(BP)에 배치된 제1 더 미 부재를 더 포함할 수 있다. 일 실시예에서, 제1 더미 부재는 탄성체, 합성 수지 및/또는 금속 물 질로 제작될 수 있으며, 절곡 부분(BP)의 형상을 설계 형상으로 유지할 수 있다. 예를 들어, 제1 가요성 인쇄회 로 기판은 탄성력을 가짐으로써 절곡된 형상으로 배치된 때 최초 제작된 형상으로 복원되려는 성향을 가질 수 있으며, 제1 더미 부재는 제1 가요성 인쇄회로 기판의 복원력을 억제하여 절곡 형상으로 유지되도 록 강제할 수 있다. 일 실시예에 따르면, 제1 가요성 인쇄회로 기판은 그 형상에 따라 주변의 다른 부품(예: 측벽, 카메 라 조립체, 및/또는 도 26의 커버 플레이트)으로부터의 이격 거리가 달라질 수 있다. 제1 가요성 인 쇄회로 기판이 무선 통신 신호를 전송하도록 구성된 경우, 이러한 거리의 편차는 실질적으로 무선 통신 성 능의 편차를 유발할 수 있다. 일 실시예에서, 제1 더미 부재는 절곡 부분(BP)에서 제1 가요성 인쇄회로 기 판을 설계 형상으로 유지함으로써, 주변 부품과의 거리를 일정하게 유지할 수 있다. 예를 들어, 제1 더미 부재는 제1 가요성 인쇄회로 기판의 형상 또는 주변 부품으로부터의 거리를 일정하게 함으로써, 무선 통신 성능의 편차를 억제할 수 있다. 안테나 모듈이 하우징 상에 배치된 구성에 관해서는 도 16 내지 도 18을 더 참조하여 살펴보기로 한 다. 도 16은 본 개시의 일 실시예에 따른 전자 장치에서, 도 15의 안테나 모듈이 하우징에 배치되는 과정을 설명하 기 위한 사시도이다. 도 17은 본 개시의 일 실시예에 따른 전자 장치에서, 도 15의 안테나 모듈이 하우징에 배 치된 모습을 나타내는 도면이다. 도 18은 도 17의 라인 A-A'을 따라 본 개시의 일 실시예에 따른 전자 장치의일부분을 절개하여 나타내는 도면이다. 도 16 내지 도 18을 더 참조하면, 안테나 모듈(예: 안테나 기판)은 측벽(예: 제2 부분(321b)) 과 카메라 조립체 사이에서, 방사체들이 배열된 면이 제2 부분(321b)을 바라보게 배치될 수 있다. 일 실시 예에서, 제1 가요성 인쇄회로 기판은 안테나 기판으로부터 연장되어, 적어도 부분적으로 제2 부분 (321b)과 카메라 조립체 사이 및/또는 제1 부분(321a)과 카메라 조립체 사이에 배치될 수 있다. 일 실시예에서, 제1 가요성 인쇄회로 기판(예: 제2 정렬 부분(373b))의 한 단부는 제3 카메라의 일측에 서 회로 기판에 전기적으로(또는 기계적으로) 연결될 수 있다. 예를 들어, 제1 가요성 인쇄회로 기판(37 3)은 회로 기판에 배치된 통신 회로(예: 도 1의 통신 모듈)로부터 무선 통신 신호를 안테나 기판 으로 전달할 수 있다. 일 실시예에서는, 안테나 기판을 통해 수신된 무선 통신 신호가 제1 가요성 인 쇄회로 기판을 통해 회로 기판으로 제공될 수 있다. 일 실시예에 따르면, 지지 돌기는 접촉 편(또는 접촉 단자(364c))과 안테나 기판 사이에 배치될 수 있으며, 제1 가요성 인쇄회로 기판의 절곡 부분(BP)(예: 제1 더미 부재)은 지지 돌기의 적어 도 일부분을 감싸게(지지 돌기의 적어도 일부분을 덮도록) 배치될 수 있다. 예를 들어, 제1 가요성 인쇄회 로 기판의 절곡 부분(BP)은 지지 돌기의 표면 중 서로에 대하여 경사진 또는 실질적으로 수직하는 두 영역에 인접하게(또는 실질적으로 접촉하게) 배치될 수 있다. 일 실시예에서는, 도 16에 예시된 바와 같이, 제1 가요성 인쇄회로 기판의 일부분(예: 제1 정렬 부분(373a))이 안테나 기판과 평행한 상태로 카메라 조 립체와 측벽(예: 제1 부분(321a) 및/또는 제2 부분(321b)) 사이에 배치될 수 있다. 예를 들어, 절곡 부분(BP)과 안테나 기판 사이에서 제1 정렬 부분(373a)은 안테나 기판과 함께 측벽을 바라보는 방향으로 정렬될 수 있다. 일 실시예에 따르면, 절곡 부분(BP)(예: 제1 더미 부재)으로부터 회로 기판에 접속되는 단부까지, 제 1 가요성 인쇄회로 기판의 다른 일부분(예: 제2 정렬 부분(373b))은 제1 정렬 부분(373a)에 대하여 절곡됨 으로써, 제1 정렬 부분(373a)과는 다른 방향을 지향하도록 배치될 수 있다. 예를 들어, 제1 정렬 부분(373a)이 측벽을 지향하도록 배치된 때, 제2 정렬 부분(373b)은 실질적으로 전자 장치의 전면(예; 도 2의 제2 전면(220a))이나 후면(예: 도 2의 제2 후면(220b))을 지향하도록 배치된 것으로 이해될 수 있다. 일 실시예에서, 제2 정렬 부분(373b)은, 카메라 조립체와 제1 부분(321a) 사이에 및/또는 카메라 조립체(30 4)와 제2 부분(321b) 사이에 배치될 수 있다. 일 실시예에 따르면, 측벽과 카메라 조립체 사이에서, 제1 가요성 인쇄회로 기판은 접촉 편 및/또는 접촉 단자(364c)가 배치된 영역을 가로지르게 배치될 수 있다. 접촉 편, 접촉 단자(364c) 및/또는 제1 가요성 인쇄회로 기판이 무선 통신 신호용 전송 선로로서 기능하면서 서로 인접하게 배치될 때, 전자기적인 간섭이 발생될 수 있다. 전송 선로 사이에서 발생되는 전자기적인 간섭은 무선 통신의 효율을 저하시키거나 무선 통신 신호를 왜곡할 수 있다. 앞서 언급한 바와 같이, 제1 가요성 인쇄회로 기판은 적 어도 1회 절곡됨으로써 협소한 공간에서 허용되면서 전자기적 간섭을 억제할 수 있는 충분한 거리에 배치될 수 있다. 여기서, '협소한 공간에서 허용되면서 전자기적 간섭을 억제할 수 있는 충분한 거리'라 함은 접촉 편 또는 접촉 단자(364c)로부터의 거리를 언급한 것으로서, 전자 장치 또는 하우징의 설계 사양에 서 허용되는 거리일 수 있다. 일 실시예에 따르면, 지지 돌기 및/또는 제1 가요성 인쇄회로 기판의 절곡 부분(BP)은 접촉 편 과 안테나 기판 사이의 영역에 배치될 수 있다. 예를 들어, 제1 가요성 인쇄회로 기판 중 접촉 편 이나 접촉 단자(364c)가 배치된 영역을 가로지르는 부분은 실질적으로 제2 정렬 부분(373b)일 수 있다. 일 실시예에서, 제2 정렬 부분(373b)은 회로 기판(예: 연장부(364b))를 사이에 두고 접촉 편(또는 접촉 단자(364c))과 마주보게 배치된 것으로 이해될 수 있다. 일 실시예에서, 제1 정렬 부분(373a)이 접촉 편이 나 접촉 단자(364c)가 배치된 영역을 가로지르게 배치된 때, 제1 가요성 인쇄회로 기판은 접촉 단자(364 c)에 상당히 가까이 배치되어 전자기적 간섭을 발생시킬 수 있다. 본 개시의 실시예(들)에서, 접촉 단자(364c), 지지 돌기 및/또는 제1 가요성 인쇄회로 기판의 절곡 부분(BP)의 배치는, 전자 장치의 내부 공 간이 허용하는 범위에서 접촉 단자(364c)와 제1 가요성 인쇄회로 기판 사이의 거리(및/또는 접촉 편 과 제1 가요성 인쇄회로 기판 사이의 거리)를 충분히 확보하게 함으로써 전자기적 간섭을 억제할 수 있다. 접촉 단자(364c)와 제1 가요성 인쇄회로 기판 사이의 거리는, 도 17에 예시된 구조에서 접촉 단자(364c)로 부터 제1 정렬 부분(373a)까지 Y축 방향을 따라 측정된 것으로 이해될 수 있고, 도 18에 예시된 구조에서는 접 촉 단자(364c)로부터 제2 정렬 부분(373b)까지 Z축 방향을 따라 측정된 것으로 이해될 수 있다. 도 18에 예시된 구조에서, 'S1'으로 지시된 영역은 후술되는 키패드 조립체(예: 도 19 또는 도 20의 키패드 조 립체)가 배치되는 공간을 예시할 수 있으며, 'S2'로 지시된 영역은 키패드 조립체를 작동시키기 위해 사용자가 조작하게 될 키(예: 도 24의 버튼 부재)가 배치되는 공간을 예시할 수 있다. 키가 배치되기 전까 지 S2 영역은 측벽의 외부에서 홈 형상으로 사용자에게 인지될 수 있다. 일 실시예에서, 후술되는 키패드 조립체의 스위치(예: 도 19의 스위치(381a, 381b))들에 마주하는 부분에서 S2 영역은 측벽의 외측면 으로부터 S1 영역에 이르는 관통 홀 구조일 수 있으며, 스위치들과 마주하지 않는 부분에서는 도 22 또는 도 23 에서와 같이 리세스(recess) 또는 그루브(groove) 형상을 가질 수 있다. 일 실시예에서, S1 영역 또는 S2 영역 은 적어도 부분적으로 측벽의 제1 부분(321a)에 의해 제공된 것으로 이해될 수 있다. 키패드 조립체의 구성과 배치에 관해서는 도 19 내지 도 23을 더 참조하여 살펴보기로 한다. 도 19는 본 개시의 일 실시예에 따른 전자 장치의 키패드 조립체를 나타내는 제1 사시도이다. 도 20은 본 개시 의 일 실시예에 따른 전자 장치의 키패드 조립체를 나타내는 제2 사시도이다. 먼저, 도 19와 도 20을 참조하면, 키패드 조립체는 스위치 기판과 제2 가요성 인쇄회로 기판을 포함할 수 있다. 스위치 기판은 예를 들어, 일면에 배치된 적어도 하나의 스위치(381a, 381b)를 포함할 수 있다. 일 실시예에서, 스위치(381a, 381b)는 돔 스위치나 택트 스위치와 같은 기계적인 구조로 구현될 수 있으 며, 일 실시예에서는 정전 용량 센서나 감압 센서로 구현될 수 있다. 일 실시예에서, 제2 가요성 인쇄회로 기판 은 스위치 기판으로부터 연장되며 그의 단부에서 회로 기판에 전기적으로 연결될 수 있다. 일 실시예에서는, 전자 장치 및/또는 키패드 조립체는 제2 가요성 인쇄회로 기판에 배치된 제2 더 미 부재를 더 포함함으로써, 제2 가요성 인쇄회로 기판 및/또는 제1 가요성 인쇄회로 기판의 배 치를 정형화할 수 있다. 일 실시예에서, 제2 더미 부재가 스위치 기판로부터 제1 거리에 위치된 때, 제2 가요성 인쇄회로 기판의 단부로부터는 제1 거리보다 큰 제2 거리에 위치된 것으로 이해될 수 있다. 일 실시예에 따르면, 전자 장치 및/또는 키패드 조립체는 스위치 기판의 일면에 배치된 보호 플 레이트와 스위치 기판의 타면에 배치된 보호 브라켓을 더 포함할 수 있다. 도 22 또는 도 23을 통해 예시되는 바와 같이, 키패드 조립체가 하우징 상에 배치된 때, 보호 플레이트는 스위치 기 판의 일면과 측벽(예: 제1 부분(321a)) 사이에 배치됨으로써 스위치 기판을 보호하고, 보호 브 라켓은 스위치 기판의 타면이 측벽 또는 지지 영역의 구조물에 직접 접촉하는 것을 방지할 수 있다. 예를 들어, 스위치 기판은 실질적으로 보호 플레이트와 보호 브라켓에 의해 측벽(32 1)의 내측에 배치 또는 고정될 수 있다. 일 실시예에서, 보호 플레이트는 고무(rubber)나 실리콘 (silicone)과 같은 탄성체로 제작됨으로써, 관통 홀 구조의 S2 영역 또는 측벽의 내측면에서 방수/방진 구 조를 제공할 수 있다. 도 21은 본 개시의 일 실시예에 따른 전자 장치에서, 도 19 또는 도 20의 키패드 조립체가 하우징에 배치된 모 습을 나타내는 도면이다. 도 22는 도 21의 라인 B-B'을 따라 본 개시의 일 실시예에 따른 전자 장치의 일부분을 절개하여 나타내는 도면이다. 도 23은 도 21의 라인 C-C'을 따라 본 개시의 일 실시예에 따른 전자 장치의 일부 분을 절개하여 나타내는 도면이다. 도 22와 도 23은 후면 플레이트(예: 도 4의 제2 후면 플레이트)나 커버 플레이트를 예시하고 있 으나, 도 21에서는 카메라 조립체, 안테나 모듈 및/또는 키패드 조립체의 배치를 예시하기 위해 후면 플레이트나 커버 플레이트가 생략되었음에 유의한다. 도 21 내지 도 23을 더 참조하면, 키패드 조립체는 하우징의 내부 공간(예: 도 18의 S1 영역)에서, 측벽(예: 제1 부분(321a))과 마주보게 배치될 수 있다. 일 실시예에서, '키패드 조립체가 측벽과 마 주보게 배치된다'라 함은 스위치 기판 또는 스위치(381a, 381b)(들)가 측벽의 내측면에 마주보게 배 치된 것을 언급한 것일 수 있다. 일 실시예에서, 보호 플레이트 및/또는 보호 브라켓에 의해 스위치 기판은 하우징(예: 측벽 또는 지지 영역)이 제공하는 구조물 상에 안정적으로 배치될 수 있다. 일 실시예에서, 제2 가요성 인쇄회로 기판은 스위치 기판에 대하여 절곡된 상태로 회로 기판 상에 배치될 수 있다. 예를 들어, 스위치 기판이 측벽을 지향하도록 배치된 때, 제2 가요성 인 쇄회로 기판은 전자 장치의 전면(예: 도 2의 제2 전면(220a))이나 후면(예: 도 2의 제2 후면(220 b))을 지향하도록 배치된 것으로 이해될 수 있다. 일 실시예에 따르면, 제2 가요성 인쇄회로 기판은 부분적으로 제1 가요성 인쇄회로 기판을 사이에 두 고 회로 기판과 실질적으로 마주보게 정렬되며 그의 단부가 회로 기판에 전기적으로(및/또는 기계적으로) 연결될 수 있다. 예를 들어, 제2 가요성 인쇄회로 기판은 회로 기판 상에서 제1 가요성 인쇄회 로 기판의 일부분을 가로지르게(또는 제1 가요성 인쇄회로 기판의 일부분과 교차하게) 배치될 수 있 다. 일 실시예에서는, 제1 가요성 인쇄회로 기판이 접촉 편(또는 접촉 단자(364c))가 배치된 영역과 제2 가요성 인쇄회로 기판(또는 제2 더미 부재)이 배치된 영역을 순차적으로 가로지르게 배치되면서 그의 단부에서 회로 기판에 접속된 것으로 이해될 수 있다. 일 실시예에 따르면, 회로 기판이 하우징(예: 지지 영역) 상에 배치된 때, 접촉 단자(364c)와 접촉 편이 기계적으로 및/또는 전기적으로 접촉될 수 있다. 접촉 편과의 접촉 상태에서 접촉 단자 (364c)가 변형되면서 탄성력을 축적함으로써, 접촉 상태는 더욱 안정적으로 유지될 수 있다. 일 실시예에서, 접 촉 단자(364c)에 축적된 탄성력은 회로 기판(예: 연장부(364b))를 -Z 방향으로 가압할 수 있다. 연장부 (364b)가 상당히 작은 길이 또는 폭(예: 수mm 이내의 길이 또는 폭)을 가진 구조에서 접촉 단자(364c)의 탄성력 이 작용할 때, 연장부(364b)가 변형되거나 손상될 수 있다. 일 실시예에서, 도 13 또는 도 14의 지지 플레이트 (364d)는 연장부(364b)의 타면에서 연장부(364b)를 지지함으로써, 접촉 단자(364c)의 탄성력에 의해 연장부 (364b)가 변형되는 것을 억제하면서 접촉 단자(364c)와 접촉 편의 접촉 상태를 더욱 안정적으로 유지할 수 있다. 일 실시예에 따르면, 후면 플레이트는 카메라 조립체에 상응하는 위치에 관통 홀 구조를 제공함으로 써, 카메라 조립체의 촬영 경로 또는 광학 경로를 제공할 수 있다. 일 실시예에서, 카메라 조립체를 보호하기 위해, 전자 장치 및/또는 후면 플레이트는 커버 플레이트를 더 포함할 수 있다. 일 실 시예에서, 커버 플레이트는 후면 플레이트의 일부인 것으로 이해될 수 있다. 일 실시예에 따르면, 커버 플레이트는 카메라 조립체 둘레의 적어도 일부에 배치될 수 있으며, 카메 라(341, 342, 343)들과 상응하는 위치에 광학 홀(들)을 제공할 수 있다. 도시된 실시예에서는, 커버 플레이트 의 광학 홀(들)에 윈도우 플레이트(399a)가 배치된 구조가 예시될 수 있다. 일 실시예에서, 커버 플레이트 는 가장자리의 적어도 일부가 후면 플레이트의 내측면에 부착 또는 고정되며, 외측면의 적어도 일부 는 후면 플레이트의 외부에 노출될 수 있다. 일 실시예에서, 전자 장치 및/또는 후면 플레이트 의 외관과 조화를 이루기 위해, 또는 전자 장치의 외관에서 심미감을 향상시키기 위해, 커버 플레이트 는 금속 물질로 제작되거나 금속 물질로 마감처리(예: 인쇄, 코팅, 증착 또는 도금)될 수 있다. 일 실시예에 따르면, 회로 기판 상에서 또는 후면 플레이트의 내측에서, 제2 더미 부재는 적어 도 부분적으로 커버 플레이트의 내측면에 마주보게 또는 접촉하게 배치될 수 있다. 예를 들어, 제2 더미 부재가 제2 가요성 인쇄회로 기판과 커버 플레이트 사이의 간격을 유지할 수 있다. 일 실시예에 서, 제1 가요성 인쇄회로 기판은 제2 더미 부재가 배치된 영역에서 제2 가요성 인쇄회로 기판과 중첩하게 배치될 수 있다. 예를 들어, 제2 더미 부재와 제2 가요성 인쇄회로 기판이 제공됨으로써, 제1 가요성 인쇄회로 기판은 설계 형상으로 회로 기판(예: 도 12 내지 도 14의 연장부(364b)) 상에 배치되며 후면 플레이트 및/또는 커버 플레이트로부터 지정된 거리에 위치될 수 있다. 일 실시예에 따르면, 카메라 조립체, 예를 들어, 제3 카메라는 외측면 둘레 중, 지지 돌기가 제 공된 면에서 지지 돌기와 연결된 플랜지부(flange portion)(345a)를 더 포함할 수 있다. 일 실시예에서, 지지 돌기는 플랜지부(345a)의 일부로서 이해될 수 있으며, 플랜지부(345a) 중에서 제1 가요성 인쇄회로 기판의 절곡 부분(BP)에 상응하는 위치에서 플랜지부(345a)의 나머지 부분보다 더 돌출된 구조를 가질 수 있다. 절곡 부분(BP)으로부터 회로 기판에 연결된 단부에 이르기까지 제1 가요성 인쇄회로 기판의 일 부(예: 제2 정렬 부분(373b))는 플랜지부(345a)에 의해 지지됨으로써 설계 형상을 유지하면서, 후면 플레이트 및/또는 커버 플레이트로부터 지정된 거리에 위치될 수 있다. 일 실시예에 따르면, 제1 가요성 인쇄회로 기판이 아날로그 신호(예: 무선 통신 신호)용 전송 선로로서 기 능할 때, 주변의 전도성 구조에서 유도 전류가 발생될 수 있다. 유도 전류가 발생될 때, 신호 전송의 효율이 저 하되거나 전송 신호의 왜곡으로 인해 무선 통신의 품질이 저하될 수 있다. 다양한 형태의 전자기 차폐 구조가 제공됨으로써 이러한 유도 전류의 발생이나 전자기적인 간섭을 억제할 수 있다. 일 실시예에서는, 제2 더미 부 재와 제2 가요성 인쇄회로 기판이 제공됨으로써, 제1 가요성 인쇄회로 기판이 후면 플레이트 및/또는 커버 플레이트로부터 지정된 거리에 위치됨으로써, 유도 전류의 발생을 억제할 수 있다. 일 실시예에서, 박막 필름 형태의 제1 가요성 인쇄회로 기판이 설계 형상과 다르게 배치된 때, 동일 사양 으로 제작된 서로 다른 전자 장치의 무선 통신 성능에 편차가 발생될 수 있다. 본 개시의 실시예(들)에서는, 지 지 돌기, 플랜지부(345a), 및/또는 더미 부재(375, 385)들을 이용하여 제1 가요성 인쇄회로 기판을설계 형상으로 배치함으로써, 금속 물질이나 전도성 물질을 포함하는 구조물(예: 커버 플레이트)이 인접하 게 배치되더라도 무선 통신 성능의 저하 또는 무선 통신 성능의 편차를 억제할 수 있다. 도 24는 본 개시의 일 실시예에 따른 전자 장치에서, 가요성 인쇄회로 기판(들)이 배치된 모습을 나타내는 도면 이다. 도 25는 도 24의 라인 D-D'을 따라 본 개시의 일 실시예에 따른 전자 장치의 일부분을 절개하여 나타내는 도면이다. 도 24와 도 25를 참조하면, 도 4의 리어 부재가 하우징 내에서 각종 부품들의 배치 구조 또는 연결 상태를 안정적으로 유지할 수 있다. 예를 들어, 리어 부재에서, 참조번호 '279'로 지시된 지지 부분 및/또 는 그 외의 다른 부분(들)은 회로 기판의 일부분을 지지하거나 제1 가요성 인쇄회로 기판 및/또는 제 2 가요성 인쇄회로 기판의 단부를 지지하여 회로 기판에 접속된 상태를 안정적으로 유지할 수 있다. 일 실시예에서, 참조번호를 부여하지는 않았지만, 지지 부분은 회로 기판과 마주보는 면에 형성된 돌 기들을 통해 회로 기판 또는 지지 플레이트(364d)에 직접 접촉하게 배치될 수 있다. 이로써, 회로 기판 은 지지 영역과 리어 부재에 의해 안정적으로 고정될 수 있고, 연장부(364b)의 변형이나 손상이 억제될 수 있다. 일 실시예에 따르면, 버튼 부재는 도 18, 도 22 및/또는 도 23의 S2 영역에 배치될 수 있으며, 측벽 (예: 제1 부분(321a))의 외측면에서 지정된 높이만큼 돌출될 수 있다. 측벽의 외측면으부터 버튼 부재 가 돌출된 높이는 예를 들면, 키패드 조립체의 스위치(381a, 381b)(들)을 작동시킬 수 있는 버튼 부 재의 이동 거리에 의해 결정될 수 있다. 도 26은 본 개시의 일 실시예에 따른 전자 장치에서, 커버 플레이트가 배치된 모습을 나타내는 제1 도면이다. 도 27은 본 개시의 일 실시예에 따른 전자 장치에서, 커버 플레이트가 배치된 모습을 나타내는 제2 도면이다. 도 26과 도 27을 참조하면, 아날로그 신호가 전송되는 배선(예: 도 15 및/또는 도 22 내지 도 25의 제1 가요성 인쇄회로 기판)이 커버 플레이트와 같은 전도성 구조물과 인접하게 배치될 때, 유도 전류나 전자기적 인 간섭이 발생되어 무선 통신 성능을 저하시킬 수 있음을 앞서 살펴본 바 있다. 본 개시의 실시예(들)에서는 제1 가요성 인쇄회로 기판과 전도성 구조물 사이에서 발생될 수 있는 전자기적인 간섭을 억제함에 있어, 제2 가요성 인쇄회로 기판이 제1 가요성 인쇄회로 기판과 커버 플레이트 사이에 배치될 수 있으 며, 제2 더미 부재가 제2 가요성 인쇄회로 기판과 커버 플레이트 사이에 및/또는 제1 가요성 인 쇄회로 기판과 커버 플레이트 사이에 배치될 수 있다. 예를 들어, 제1 가요성 인쇄회로 기판과 커버 플레이트 사이에 지정된 간격이 제공됨으로써, 제1 가요성 인쇄회로 기판과 커버 플레이트 사이에서 전자기적인 간섭이 발생되는 것을 억제할 수 있다. 일 실시예에 따르면, 제1 가요성 인쇄회로 기판과 커버 플레이트가 마주보는 면적(또는 중첩되는 면 적)을 줄임으로써, 제1 가요성 인쇄회로 기판과 커버 플레이트 사이에 전자기적인 간섭이나 또는 유 도 전류의 발생을 억제할 수 있다. 일 실시예에서, 커버 플레이트는 일측의 가장자리에서 내측으로 연장된 노치부(299b)를 제공할 수 있다. 노치부(299b)는 예를 들어, 커버 플레이트의 일부분이 제거되어 구현된 것으로서, 제2 더미 부재, 제1 가요성 인쇄회로 기판 및/또는 제2 가요성 인쇄회로 기판에 중첩 하는 위치에 배치될 수 있다. 일 실시예에서, 제2 더미 부재는 적어도 부분적으로 노치부(299b)와 제1 가 요성 인쇄회로 기판의 사이에, 또는 노치부(299b)와 제2 가요성 인쇄회로 기판 사이에 배치된 것으로 이해될 수 있다. 일 실시예에 따르면, 커버 플레이트의 가장자리 일측에 돌출부(299c)가 제공됨으로써 노치부(299b)가 구현 된 것으로 이해될 수 있다. 예를 들어, 돌출부(299c)는 커버 플레이트의 일측에서 커버 플레이트의 외측으로 연장됨으로써, 노치부(299b)의 적어도 일부분을 둘러싸게 구현될 수 있다. 일 실시예에서, 돌출부 (299c)는 제2 더미 부재, 제1 가요성 인쇄회로 기판 및/또는 제2 가요성 인쇄회로 기판과는 실 질적으로 중첩하지 않는 영역에 배치될 수 있다. 일 실시예에 따르면, 제2 더미 부재는 지정된 크기로 제작되며, 제2 가요성 인쇄회로 기판 상에서 지 정된 위치에 배치될 수 있다. 일 실시예에서, 제2 가요성 인쇄회로 기판의 한 단부는 스위치 기판에 연결된 것으로 이해될 수 있으며, 다른 한 단부가 회로 기판에 직접 결속될 수 있다. 이 경우, 스위치 기 판과 회로 기판의 높이 차이로 인해, 제2 가요성 인쇄회로 기판의 일부는 회로 기판 상에 서 경사지거나 곡면을 이루는 형상으로 배치될 수 있다. 스위치 기판에 가까울수록 또는 회로 기판 접속 부분에 가까울수록 제2 가요성 인쇄회로 기판의 부분적인 경사도 또는 곡률이 커질 수 있다. 일 실시예에서, 이러한 제2 가요성 인쇄회로 기판의 경사도나 곡률이 상대적으로 작은 부분에 제2 더미 부재(38 5)가 배치될 수 있다. 일 실시예에서는, 제2 더미 부재가 제2 가요성 인쇄회로 기판의 단부와 스위치 기판 중 스위치 기판에 더 가까이 배치된 것으로 이해될 수 있다. 일 실시예에 따르면, 스위치 기판과 인접하는 부분에서 제2 가요성 인쇄회로 기판은 지정된 각도(예: 대략 90도)로 절곡되고, 회로 기판과 커버 플레이트 사이에서 완만한 경사를 이루면서 단부에서 회로 기판에 접속될 수 있다. 일 실시예에서는 제2 가요성 인쇄회로 기판 중 제2 더미 부재가 배치된 영역이 회로 기판이나 커버 플레이트에 실질적으로 평행하게 배치되며, 제2 가요성 인쇄회로 기판 중 제2 더미 부재와 회로 기판에 접속된 부분 사이 영역은 회로 기판에 대하여 경사지게 배치되거 나 곡면 형태로 배치될 수 있다. 상술한 바와 같이, 안테나 모듈(예: 도 15 내지 도 17의 안테나 모듈)이 협소한 공간에 배치되면서 전송 배선의 형상 변화를 억제함으로써 전자 장치(예: 도 1 내지 도 4의 전자 장치(101, 200))는 안정된 무선 통신 환경을 제공받을 수 있다. 일 실시예에서는, 하나의 하우징(예: 도 2 내지 도 4의 제2 하우징 또는 도 14 의 하우징) 내에서 복수의 안테나가 배치됨으로써 복수의 하우징을 포함하는 구조라 하더라도 안테나용 전 송 배선의 형상 변화가 억제될 수 있다. 예를 들어, 복수의 하우징을 포함하는 전자 장치에서, 하우징들의 상대 적인 위치 또는 전송 배선의 형상 변화에 의한 무선 통신 성능의 편차가 억제될 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 상술한 실시예(들)의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 본 개시의 일 실시예에 따르면, 전자 장치(예: 도 1 내지 도 4의 전자 장치(101, 200))는, 전면(예: 도 2의 제2 전면(220a)), 상기 전면의 반대방향을 향하는 후면(예: 도 2의 제2 후면(220b)), 및 상기 전면과 상기 후면 사 이의 공간을 적어도 부분적으로 둘러싸는 측벽(예: 도 4의 제2 측벽 또는 도 14의 측벽)을 포함하는 하우징(예: 도 2 내지 도 4의 제2 하우징 또는 도 14의 하우징), 상기 공간의 일측 가장자리에서, 상 기 측벽에 인접하게 배치된 상기 카메라 조립체(예: 도 4, 도 7, 도 10 및/또는 도 14의 카메라 조립체(204, 304)), 상기 카메라 조립체에서 일 방향으로 돌출된 지지 돌기(예: 도 10, 도 11 및/또는 도 14의 지지 돌기 ), 상기 카메라 조립체에 인접하는 상기 측벽의 제1 부분(예: 도 14의 제1 부분(321a))의 적어도 일부로 배치되고, 제1 주파수 대역의 무선 통신을 수행하도록 구성된 제1 방사체, 상기 제1 부분에 인접하는 상기 측벽 의 제2 부분(예: 도 14의 제2 부분(321b))과 상기 카메라 조립체 사이에 적어도 부분적으로 배치된 안테나 모듈 (예: 도 15 내지 도 17의 안테나 모듈)로서, 제2 주파수 대역의 무선 통신을 수행하도록 구성된 상기 안테 나 모듈, 및 상기 안테나 모듈로부터 연장되어 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 제1 가요성 인쇄회로 기판(예: 도 15 내지 도 17의 제1 가요성 인쇄회로 기판)을 포함할 수 있다. 일 실시예에서, 상기 제1 가요성 인쇄회로 기판은, 상기 지지 돌기의 표면 중 서로에 대하여 경사지게 또는 수 직하게 배치된 두 영역을 감싸게 또는 상기 두 영역을 덮도록 배치(도 18 참조)될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 제1 부분과 상기 제2 부분 사이에 배치된 분절 구조(예: 도 14, 도 16 및/또는 도 17의 분절 구조(321c)), 및 상기 제2 부분의 적어도 일부로서 배치되고, 제3 주파수 대역의 무선 통신을 수행하도록 구성된 제2 방사체를 더 포함할 수 있다. 일 실시예에 따르면, 상기 안테나 모듈은, 적어도 부분적으로 상기 제2 부분과 상기 카메라 조립체 사이에 배치 된 안테나 기판(antenna substrate)(예: 도 15의 안테나 기판)을 포함할 수 있다. 일 실시예에서, 상기 제 1 가요성 인쇄회로 기판이 상기 안테나 기판으로부터 연장될 수 있다. 일 실시예에 따르면, 상기 지지 돌기의 주위에서 상기 제1 가요성 인쇄회로 기판이 적어도 1회 절곡됨(bent)으 로써, 상기 제1 가요성 인쇄회로 기판의 일부분(예: 도 15의 제1 정렬 부분(373a))은 상기 제2 부분과 상기 카 메라 조립체 사이에서 또는 상기 제1 부분과 상기 카메라 조립체 사이에서 상기 측벽을 바라보는 방향으로 정렬 될 수 있다. 일 실시예에서는, 상기 제1 가요성 인쇄회로 기판의 다른 일부분(예: 도 15의 제2 정렬 부분 (373b))은 상기 제1 부분과 상기 카메라 조립체 사이에서 상기 전면 또는 상기 후면을 바라보는 방향으로 정렬 될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 제1 가요성 인쇄회로 기판의 절곡 부분(bent portion)에 배치된 제1 더미 부재(예: 도 15의 제1 더미 부재)를 더 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 전면과 상기 후면 사이의 공간에 배치되며 상기 카메라 조 립체의 일부부분을 수용하는 개구 영역(예: 도 12 및/또는 도 13의 개구 영역(364a))을 제공하는 회로 기판(예: 도 4의 제2 회로 기판 및/또는 도 12 내지 도 14의 회로 기판), 상기 회로 기판의 일부분이면서 상기 개구 영역의 일부분을 정의하는(defining) 연장부(예: 도 12 내지 도 14의 연장부(364b))로서, 적어도 부분적으 로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 상기 연장부, 및 상기 제1 부분에서 상기 측벽으로부터 연장되어 적어도 부분적으로 상기 연장부에 마주보게 배치된 접촉 편(contact piece)(예: 도 8, 도 9 및/또는 도 14의 접촉 편)을 더 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 연장부의 일면에 배치되며 상기 접촉 편에 전기적으로 연 결된 접촉 단자(contact terminal)(예: 도 12 또는 도 22의 접촉 단자(364c))를 더 포함할 수 있다. 일 실시예 에서, 상기 제1 방사체는 상기 접촉 단자와 상기 접촉 편을 통해 급전 신호를 제공받도록 구성될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 적어도 부분적으로 상기 연장부의 타면에 배치된 지지 플레이트 (예: 도 13 또는 도 14의 지지 플레이트(364d)), 및 상기 연장부에 인접하는 영역에서, 상기 회로 기판 및 상기 지지 플레이트를 관통하게 형성된 체결 홀(예: 도 12 또는 도 13의 체결 홀(364e))을 더 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 후면과 상기 회로 기판 사이에 배치된 지지 부재(예: 도 4 의 리어 부재 또는, 도 4, 도 24, 도 25의 지지 부분)를 더 포함할 수 있다. 일 실시예에서, 상기 지 지 부재는 상기 회로 기판 또는 상기 연장부의 일면을 지지하도록 구성될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 키패드 조립체(예: 도 19 내지 도 24의 키패드 조립체)를 더 포함할 수 있다. 일 실시예에서, 상기 키패드 조립체는, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 스위치 기판(예: 도 19의 스위치 기판), 및 상기 스위치 기판으로부터 연장되며, 상기 카메라 조립체의 일측에서 상기 회로 기 판에 접속된 제2 가요성 인쇄회로 기판(예: 도 19의 제2 가요성 인쇄회로 기판)을 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 후면 상에서 상기 카메라 조립체 둘레의 적어도 일부분에 배치된 커버 플레이트(예: 도 4, 도 22, 도 23, 도 26 및/또는 도 27의 커버 플레이트) 및 상기 제2 가요 성 인쇄회로 기판에 배치된 제2 더미 부재(예: 도 19 또는 도 20의 제2 더미 부재)를 더 포함할 수 있다. 일 실시예에서, 상기 제2 더미 부재가 상기 커버 플레이트와 마주보게 배치될 수 있다. 일 실시예에 따르면, 상기 제1 가요성 인쇄회로 기판의 적어도 일부분이 상기 회로 기판과 상기 제2 더미 부재 사이에 배치될 수 있다. 일 실시예에 따르면, 상기 커버 플레이트는 일측 가장자리에서 내측으로 연장된 노치부(notch portion)(예: 도 26의 노치부(299b))를 포함할 수 있다. 일 실시예에 따르면, 상기 노치부가 상기 제2 더미 부재와 적어도 부분적으로 중첩하게 배치될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 제2 하우징(예: 도 2 내지 도 4의 제1 하우징), 상기 제2 하우징을 상기 하우징에 회동 가능하게 결합시키며, 상기 하우징 또는 상기 제2 하우징의 회동 중심이 되는 적 어도 하나의 폴딩 축을 제공하도록 구성된 힌지 구조(예: 도 4의 힌지 어셈블리), 및 상기 하우징의 내부 로부터 상기 힌지 구조를 가로질러 상기 제2 하우징의 내부로 배치된 가요성 인쇄회로 기판(예: 도 4, 도 5 및/ 또는 도 7의 가요성 인쇄회로 기판)을 더 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 하우징과 상기 제2 하우징 중 어느 하나에 배치된 제1 디 스플레이 영역(예: 도 2 또는 도 4의 제1 디스플레이 영역)과, 상기 하우징과 상기 제2 하우징 중 다른 하 나에 배치된 제2 디스플레이 영역(예: 도 2 또는 도 4의 제1 디스플레이 영역)과, 상기 힌지 구조 상에 배 치된 폴딩 영역(예: 도 2 또는 도 4의 폴딩 영역)을 포함하는 플렉서블 디스플레이(예: 도 2 또는 도 4의 플렉서블 디스플레이)를 더 포함할 수 있다. 일 실시예에서, 상기 플렉서블 디스플레이는 상기 하우징 전 면의 적어도 일부를 통해 화면을 출력하도록 구성될 수 있다. 본 개시의 일 실시예에 따르면, 전자 장치(예: 도 1 내지 도 4의 전자 장치(101, 200))는, 제1 하우징(예: 도 2 내지 도 4의 제1 하우징), 제2 하우징(예: 도 2 내지 도 4의 제2 하우징 또는 도 14의 하우징 ), 상기 제1 하우징과 상기 제2 하우징을 회동 가능하게 결합시키며, 상기 제1 하우징 또는 상기 제2 하우 징의 회동 중심이 되는 적어도 하나의 폴딩 축(예: 도 2 또는 도 4의 폴딩 축(A))을 제공하도록 구성된 힌지 구조(예: 도 4의 힌지 어셈블리), 상기 제1 하우징의 내부로부터 상기 힌지 구조를 가로질러 상기 제2 하우 징의 내부로 배치된 가요성 인쇄회로 기판(예: 도 4, 도 5 및/또는 도 7의 가요성 인쇄회로 기판), 제1 디 스플레이 영역(예: 도 2 또는 도 4의 제1 디스플레이 영역)과, 제2 디스플레이 영역(예: 도 2 또는 도 4의 제2 디스플레이 영역)과, 상기 제1 디스플레이 영역을 상기 제2 디스플레이 영역에 연결하며 상기 힌지 구 조 상에 배치된 폴딩 영역(예: 도 2 또는 도 4의 폴딩 영역)을 포함하는 플렉서블 디스플레이(예: 도 2 또 는 도 4의 플렉서블 디스플레이), 상기 제1 하우징과 상기 제2 하우징 중 어느 하나의 내부의 일측 가장자 리에서 측벽(예: 도 4의 제2 측벽 또는 도 14의 측벽)에 인접하게 배치된 카메라 조립체(예: 도 4, 도 7, 도 10 및/또는 도 14의 카메라 조립체(204, 304)), 적어도 부분적으로 상기 카메라 조립체에 인접하게 배 치된 상기 측벽의 제1 부분(예: 도 14의 제1 부분(321a))으로서, 제1 주파수 대역의 무선 통신을 수행하도록 구 성된 제1 방사체, 상기 제1 부분에 인접하는 상기 측벽의 제2 부분(예: 도 14의 제2 부분(321b))과 상기 카메라 조립체 사이에 적어도 부분적으로 배치된 안테나 기판(예: 도 15의 안테나 기판)을 포함하는 안테나 모듈 (예: 도 15 내지 도 17의 안테나 모듈)로서, 제2 주파수 대역의 무선 통신을 수행하도록 구성된 상기 안테 나 모듈, 및 상기 제2 부분의 적어도 일부로서, 제3 주파수 대역의 무선 통신을 수행하도록 구성된 제2 방사체 를 포함할 수 있다. 일 실시예에서, 상기 안테나 모듈은, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립 체 사이에 배치된 제1 가요성 인쇄회로 기판(예: 도 15 내지 도 17의 제1 가요성 인쇄회로 기판)을 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 카메라 조립체의 일부부분을 수용하는 개구 영역(예: 도 12 및/또는 도 13의 개구 영역(364a))을 제공하는 회로 기판(예: 도 4의 제2 회로 기판 및/또는 도 12 내 지 도 14의 회로 기판), 상기 회로 기판의 일부분이면서 상기 개구 영역의 일부분을 정의하는 연장부(예: 도 12 내지 도 14의 연장부(364b))로서, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 상기 연장부, 상기 제1 부분에서 상기 측벽으로부터 연장되어 적어도 부분적으로 상기 연장부에 마주보게 배치 된 접촉 편(예: 도 8, 도 9 및/또는 도 14의 접촉 편), 및 상기 연장부의 일면에 배치되며, 상기 접촉 편 에 전기적으로 연결된 접촉 단자(예: 도 12 또는 도 22의 접촉 단자(364c))를 더 포함할 수 있다. 일 실시예에 서, 상기 제1 방사체는 상기 접촉 단자와 상기 접촉 편을 통해 급전 신호를 제공받도록 구성될 수 있다. 일 실시예에 따르면, 상기 제1 가요성 인쇄회로 기판은 상기 연장부를 사이에 두고 상기 접촉 편에 마주보게 배 치될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 키패드 조립체(예: 도 19 내지 도 24의 키패드 조립체)를 더 포함할 수 있다. 일 실시예에서, 상기 키패드 조립체는, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 스위치 기판(예: 도 19의 스위치 기판), 및 상기 스위치 기판으로부터 연장되어 상기 제1 가요성 인쇄회로 기판을 가로지르게 배치되며, 상기 카메라 조립체의 일측에서 상기 회로 기판에 접속된 제2 가요성 인쇄회로 기판(예: 도 19의 제2 가요성 인쇄회로 기판)을 포함할 수 있다. 일 실시예에 따르면, 상기 제1 가요성 인쇄회로 기판의 일부분이 상기 회로 기판과 상기 제2 가요성 인쇄회로 기판 사이에 배치될 수 있다. 본 개시의 일 실시예에 따르면, 전자 장치(예: 도 1 내지 도 4의 전자 장치(101, 200))는, 전면(예: 도 2의 제2 전면(220a)), 상기 전면의 반대방향을 향하는 후면(예: 도 2의 제2 후면(220b)), 및 상기 전면과 상기 후면 사 이의 공간을 적어도 부분적으로 둘러싸는 측벽(예: 도 4의 제2 측벽 또는 도 14의 측벽)을 포함하는 하우징(예: 도 2 내지 도 4의 제2 하우징 또는 도 14의 하우징), 상기 공간의 일측 가장자리에서, 상 기 측벽에 인접하게 배치된 카메라 조립체(예: 도 4, 도 7, 도 10 및/또는 도 14의 카메라 조립체(204, 304)), 상기 카메라 조립체 둘레의 적어도 일부분에 배치되며, 상기 후면을 통해 적어도 부분적으로 외부에 노출된 커 버 플레이트(예: 도 4, 도 22, 도 23, 도 26 및/또는 도 27의 커버 플레이트), 적어도 부분적으로 상기 카 메라 조립체에 인접하는 상기 측벽의 제1 부분과 상기 카메라 조립체 사이에 배치된 키패드 조립체(예: 도 19 내지 도 24의 키패드 조립체), 및 상기 제1 부분에 인접하는 상기 측벽의 제2 부분과 상기 카메라 조립체 사이에 일부분이 배치된 안테나 모듈(예: 도 15 내지 도 17의 안테나 모듈)로서, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 제1 가요성 인쇄회로 기판(예: 도 15 내지 도 17의 제1 가요성 인쇄회로 기판)을 포함하는 상기 안테나 모듈을 포함할 수 있다. 일 실시예에서, 상기 키패드 조립체는, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 스위치 기판(예: 도 19의 스위치 기판 ), 상기 스위치 기판으로부터 연장되어 상기 카메라 조립체의 일측에서 상기 제1 가요성 인쇄회로 기판에 교차하게 배치된 제2 가요성 인쇄회로 기판(예: 도 19의 제2 가요성 인쇄회로 기판), 및 적어도 부분적으로 상기 커버 플레이트와 마주보는 상태로 상기 제2 가요성 인쇄회로 기판에 배치된 더미 부재(예: 도 19 또는 도 20의 제2 더미 부재)를 포함할 수 있다. 일 실시예에 따르면, 상기 커버 플레이트는 가장자리의 일측에서 상기 커버 플레이트의 외측으로 연장된 돌출부 (예: 도 26의 돌출부(299c))를 포함함으로써, 상기 돌출부에 의해 적어도 부분적으로 둘러싸인 노치부(예: 도 26의 노치부(299b))를 제공할 수 있다. 일 실시예에서, 상기 더미 부재의 일부분이 상기 노치부와 제1 가요성 인쇄회로 기판 사이에, 또는 상기 노치부와 상기 제2 가요성 인쇄회로 기판 사이에 배치될 수 있다. 일 실시예에 따르면, 상기 제2 가요성 인쇄회로 기판의 일부분이 상기 제1 가요성 인쇄회로 기판과 상기 커버 플레이트 사이에 배치될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 제1 부분, 상기 제2 부분 및/또는 상기 안테나 모듈을 이 용하여 무선 통신을 수행하도록 설정된 프로세서(예: 도 1의 프로세서) 또는 통신 모듈(예: 도 1의 통신 모듈)을 더 포함할 수 있다. 일 실시예에 따르면, 상기 측벽은 상기 제1 부분과 상기 제2 부분 사이에 배치된 분절 구조(예: 도 14, 도 16 및/또는 도 17의 분절 구조(321c))를 포함할 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 전면과 상기 후면 사이의 공간에 배치되며 상기 카메라 조 립체의 일부부분을 수용하는 개구 영역(예: 도 12 및/또는 도 13의 개구 영역(364a))을 제공하는 회로 기판(예: 도 4의 제2 회로 기판 및/또는 도 12 내지 도 14의 회로 기판)을 더 포함할 수 있다. 일 실시예에서, 상기 제2 가요성 인쇄회로 기판의 단부가 상기 회로 기판에 접속될 수 있다. 일 실시예에 따르면, 상기 더미 부재는 상기 스위치 기판으로부터 제1 거리에 배치되고, 상기 제2 가요성 인쇄 회로 기판의 단부로부터 제2 거리에 위치될 수 있다. 일 실시예에서, 상기 제1 거리는 상기 제2 거리보다 작을 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 회로 기판의 일부분이면서 상기 개구 영역의 일부분을 정 의하는(defining) 연장부(예: 도 12 내지 도 14의 연장부(364b))로서, 적어도 부분적으로 상기 제1 부분과 상기 카메라 조립체 사이에 배치된 상기 연장부를 더 포함할 수 있다. 일 실시예에서, 상기 더미 부재가 상기 연장부 와 상기 커버 플레이트 사이에 배치될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 제1 부분에서 상기 측벽으로부터 연장되어 적어도 부분적 으로 상기 연장부에 마주보게 배치된 접촉 편(contact piece)(예: 도 8, 도 9 및/또는 도 14의 접촉 편)을 더 포함할 수 있다. 일 실시예에서, 상기 제1 부분은 상기 접촉 편을 통해 상기 회로 기판에 전기적으로 연결될 수 있다. 일 실시예에 따르면, 상기 제1 가요성 인쇄회로 기판은 상기 접촉 편이 배치된 영역과 상기 제2 가요성 인쇄회 로 기판이 배치된 영역을 순차적으로 가로지르게 배치되며, 상기 제1 가요성 인쇄회로 기판의 단부가 상기 회로 기판에 접속될 수 있다. 일 실시예에 따르면, 상기 연장부는 적어도 부분적으로 상기 접촉편과 상기 제1 가요성 인쇄회로 기판 사이에 배치될 수 있다. 일 실시예에 따르면, 상기와 같은 전자 장치는, 상기 연장부의 일면에 배치되어 상기 접촉 편에 전기적으로 연 결된 접촉 단자(contact terminal)(예: 도 12 또는 도 22의 접촉 단자(364c))를 더 포함할 수 있다. 일 실시예 에서, 상기 제1 부분이 상기 접촉 단자와 상기 접촉 편을 통해 급전 신호를 제공받도록 구성될 수 있다. 본 개시는 일 실시예에 관해 예시하여 설명되었지만, 일 실시예가 본 개시를 한정하는 것이 아니라 예시를 위한 것으로 이해되어야 할 것이다. 첨부된 청구항과 그 균등물을 포함하여, 본 개시의 전체 관점에서 벗어나지 않는 범위에서 그 형식과 세부적인 구성에 다양한 변화가 이루어질 수 있음은 당업자에게 자명하다 할 것이다."}
{"patent_id": "10-2023-0138874", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 일 실시예에 관해 상술한 측면 또는 다른 측면, 구성 및/또는 장점은 첨부된 도면을 참조하는 다음의 상세한 설명을 통해 더욱 명확해질 수 있다. 도 1은 본 개시의 일 실시예에 따른, 네트워크 환경 내의 전자 장치를 나타내는 블록도이다. 도 2는 본 개시의 일 실시예에 따른 전자 장치의 펼쳐진 상태를 도시한 도면이다. 도 3은 본 개시의 일 실시예에 따른 전자 장치의 접힌 상태를 도시한 도면이다. 도 4는 본 개시의 일 실시예에 따른 전자 장치의 분해 사시도이다. 도 5는 본 개시의 일 실시예에 따른 전자 장치에서, 하우징들이 결합된 모습을 나타내는 도면이다. 도 6은 본 개시의 일 실시예에 따른 전자 장치에서, 힌지 플레이트들이 배치된 모습을 나타내는 도면이다. 도 7은 본 개시의 일 실시예에 따른 전자 장치의 내부에서, 힌지 모듈(들)과 전자 부품들의 배치를 나타내는 도 면이다. 도 8은 본 개시의 일 실시예에 따른 전자 장치의 접촉 편을 나타내는 사시도이다. 도 9는 본 개시의 일 실시예에 따른 전자 장치에서, 접촉 편이 배치된 모습을 나타내는 사시도이다. 도 10은 본 개시의 일 실시예에 따른 전자 장치의 카메라 조립체를 나타내는 도면이다. 도 11은 본 개시의 일 실시예에 따른 전자 장치에서, 도 10의 카메라 조립체 중 제3 카메라를 나타내는 사시도 이다. 도 12는 본 개시의 일 실시예에 따른 전자 장치의 회로 기판을 나타내는 제1 도면이다. 도 13은 본 개시의 일 실시예에 따른 전자 장치의 회로 기판을 나타내는 제2 도면이다. 도 14는 본 개시의 일 실시예에 따른 전자 장치에서, 도 11의 카메라 조립체와 도 13의 회로 기판이 하우징에 배치된 모습을 나타내는 도면이다. 도 15는 본 개시의 일 실시예에 따른 전자 장치의 안테나 모듈을 나타내는 사시도이다. 도 16은 본 개시의 일 실시예에 따른 전자 장치에서, 도 15의 안테나 모듈이 하우징에 배치되는 과정을 설명하 기 위한 사시도이다. 도 17은 본 개시의 일 실시예에 따른 전자 장치에서, 도 15의 안테나 모듈이 하우징에 배치된 모습을 나타내는 도면이다. 도 18은 도 17의 라인 A-A'을 따라 본 개시의 일 실시예에 따른 전자 장치의 일부분을 절개하여 나타내는 도면 이다. 도 19는 본 개시의 일 실시예에 따른 전자 장치의 키패드 조립체를 나타내는 제1 사시도이다. 도 20은 본 개시의 일 실시예에 따른 전자 장치의 키패드 조립체를 나타내는 제2 사시도이다. 도 21은 본 개시의 일 실시예에 따른 전자 장치에서, 도 19 또는 도 20의 키패드 조립체가 하우징에 배치된 모습을 나타내는 도면이다. 도 22는 도 21의 라인 B-B'을 따라 본 개시의 일 실시예에 따른 전자 장치의 일부분을 절개하여 나타내는 도면 이다. 도 23은 도 21의 라인 C-C'을 따라 본 개시의 일 실시예에 따른 전자 장치의 일부분을 절개하여 나타내는 도면 이다. 도 24는 본 개시의 일 실시예에 따른 전자 장치에서, 가요성 인쇄회로 기판(들)이 배치된 모습을 나타내는 도면 이다. 도 25는 도 24의 라인 D-D'을 따라 본 개시의 일 실시예에 따른 전자 장치의 일부분을 절개하여 나타내는 도면 이다. 도 26은 본 개시의 일 실시예에 따른 전자 장치에서, 커버 플레이트가 배치된 모습을 나타내는 제1 도면이다. 도 27은 본 개시의 일 실시예에 따른 전자 장치에서, 커버 플레이트가 배치된 모습을 나타내는 제2 도면이다. 첨부된 도면의 전반에서, 유사한 부품, 구성 및/또는 구조에 대해서는 유사한 참조 번호가 부여될 수 있다."}
