{"patent_id": "10-2023-0018113", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0125268", "출원번호": "10-2023-0018113", "발명의 명칭": "장애유형별 등급별 무장애 내비게이션 시스템", "출원인": "한남대학교 산학협력단", "발명자": "고창룡"}}
{"patent_id": "10-2023-0018113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "장애정보를 포함하는 사용자의 정보가 저장되는 사용자정보DB(111)와, 인도 및 도로의 정보가 저장되는 이동로DB(112)와, 건물별로 설치되어 있는 슬로프 및 승강기를 포함하는 무장애 시설의 설치 정보가 저장되는 무장애시설DB(113)와, 건물별로 설치되어 있는 장애인 주차구역의 위치 정보가 저장되는 주차구역DB(114)를 포함하는 데이터베이스부(110); 및상기 데이터베이스부(110)의 사용자정보DB(111)에 저장된 사용자의 장애정보를 통하여 장애수준을 판단하는 장애수준판단수단(121)과, 상기 장애수준판단수단(121)에서 판단된 사용자의 장애수준을 기반으로, 상기 이동로DB(112), 무장애시설DB(113) 및 주차구역DB(114)의 정보로부터 이동경로를 생성하는 이동경로생성수단(122)을 포함하는 경로생성부(120);를 포함하는 장애유형별 등급별 무장애 내비게이션 시스템."}
{"patent_id": "10-2023-0018113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 이동로DB(112)는 인도 및 도로의 경사 정보가 저장되는 경사도DB(112a)와,이동로의 계단 정보가 저장되는 계단DB(112b)를 포함하는 것을 특징으로 하는 장애유형별 등급별 무장애 내비게이션 시스템."}
{"patent_id": "10-2023-0018113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 무장애시설DB(113)는 슬로프 및 승강기를 포함하는 무장애 시설의 종류, 위치 및 고장여부를 포함하는 상태정보가 저장되는 상태정보부(113a)와, 슬로프 및 승강기를 포함하는 무장애 시설의 종류별 아이콘 정보가 저장되는 무장애 시설 아이콘 저장수단(113b)을 포함하는 것을 특징으로 하는 장애유형별 등급별 무장애 내비게이션 시스템."}
{"patent_id": "10-2023-0018113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 무장애 시설의 고장 신고 및 이용불편 신고를 할 수 있는 고장신고수단을 더 포함하는 것을 특징으로 하는장애유형별 등급별 무장애 내비게이션 시스템."}
{"patent_id": "10-2023-0018113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 경로생성부(120)는 상기 장애수준판단수단(121)에서 판단된 사용자의 장애수준을 기반으로, 사용자의 이동공개특허 10-2024-0125268-3-가능수준을 판단하는 이동가능수준판단수단을 더 포함하는 것을 특징으로 하는 장애유형별 등급별 무장애 내비게이션 시스템."}
{"patent_id": "10-2023-0018113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 경로생성부(120)는 사용자의 장애수준에 따른 이동 가능수준을 매칭하여 저장하는 이동가능수준매칭부를더 포함하는 것을 특징으로 하는 장애유형별 등급별 무장애 내비게이션 시스템."}
{"patent_id": "10-2023-0018113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 이동경로생성수단(122)은 이동경로 및 도착 예정시간을 제공하는데 있어, 빅데이터를 기반으로 인공지능을활용한 머신러닝 또는 딥러닝을 수행하도록 구성되는 것을 특징으로 하는 장애유형별 등급별 무장애 내비게이션시스템."}
{"patent_id": "10-2023-0018113", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 장애인이 사용하는 내비게이션 시스템에 관한 것으로서, 더욱 상세하게는 미리 입력된 사용자의 장애 정보(장애유형, 장애등급 등)를 기반으로 이동 가능 수준을 도출하여 사용자가 안전하게 이동할 수 있는 이동경 로를 제공하는 장애유형별 등급별 무장애 내비게이션 시스템에 관한 것이다."}
{"patent_id": "10-2023-0018113", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 장애인이 사용하는 내비게이션 시스템에 관한 것으로서, 더욱 상세하게는 미리 입력된 사용자의 장애 정보(장애유형, 장애등급 등)를 기반으로 이동 가능 수준을 도출하여 사용자가 안전하게 이동할 수 있는 이동경 로를 제공하는 장애유형별 등급별 무장애 내비게이션 시스템에 관한 것이다."}
{"patent_id": "10-2023-0018113", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "우리 국민 20명 중 1명은 신체 또는 정신적 장애를 갖고 있다. 장애인의 88%는 사고나 질병 등 후천적으로 장애 를 얻게 되는 만큼 우리 사회의 고령화가 심화될수록 장애인 비율이 더 늘어날 것이라는 예측이 나온다. 이러한 상황에서 장애인들은 이동을 할 때 일반인에게는 어려움으로 다가오지 않던 많은 요소들이 이동의 방해 요소로 작용하여 장애인들의 이동을 어렵게 하는 문제가 있다. 근래에는 이러한 문제를 해결하고자 유니버설 디자인(Universal Design)이나 무장애 디자인(Barrier-free design)과 같이 장애인에게 불편을 주는 요소들을 최소화하는 제품 디자인이나 건축 설계가 많은 부분에서 사용 되고 있다. 그러나 이러한 설계도 장애의 유형 및 등급에 따라 여전히 이동을 제한하는 요소를 갖고 있다. 이러한 문제를 해결하기 위해 안출된 종래의 발명이 한국공개특허 제 10-2022-0168240호로 개시된 바 있다. 종래의 기술은 보행 장애인 중심의 최적 경로를 안내하는 스마트 내비게이션 시스템에 관한 것으로서, 사용자로 부터 목적지에 따라 사용자 이동 정보를 입력 받고, 최적의 이동경로데이터에 따라 이동 경로를 안내하는 하나 이상의 사용자단말, 날짜, 요일 및 시간에 따른 날씨 정보를 제공하는 기상청 서버와 공사 현장이나 이동 경로 의 통제 상황의 공공 정보를 제공하는 공공API서버를 포함하는 외부정보서버 및 보조 보행장치로부터 상기 거리 정보를 수집하여 생성된 빅데이터를 기반으로 상기 날씨 정보와 공공 정보를 이용하여 상기 사용자 이동 정보에 따라 상기 최적의 이동경로데이터를 생성하여 상기 사용자단말로 제공하는 중앙 서버를 포함하여 구성된다. 그러나 이러한 종래의 기술은 여전히 사용자의 장애유형 및 등급에 따른 맞춤형 길 안내가 불가능하며, 각 건물 의 무장애 인증여부 및 장애인주차장 위치 확인이 어렵다는 문제를 가지고 있다.선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제 10-2022-0168240호(2022.12.23.)"}
{"patent_id": "10-2023-0018113", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이와 같은 문제를 해결하기 위해 안출된 본 발명은 장애인이 사용하는 내비게이션 시스템에 관한 것으로서, 더 욱 상세하게는 미리 입력된 사용자의 장애정보(장애유형, 장애등급 등)를 기반으로 이동 가능 수준을 도출하여 사용자가 안전하게 이동할 수 있는 이동경로를 제공하는 장애유형별 등급별 무장애 내비게이션 시스템에 관한 것이다."}
{"patent_id": "10-2023-0018113", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명의 일실시예에 따른 장애유형별 등급별 무장애 내비게이션 시스 템은, 장애정보(장애유형, 장애등급 등)를 포함한 사용자의 정보가 저장되는 사용자정보DB와, 인도 및 도로의 정보가 저장되는 이동로DB와, 건물별로 설치되어 있는 슬로프 및 승강기를 포함하는 무장애 시설의 설치 정보가 저장되는 무장애시설DB 와, 건물별로 설치되어 있는 장애인 주차구역의 위치 정보가 저장되는 주차구역DB를 포함하는 데이터베이스부 ; 및 상기 데이터베이스부의 사용자정보DB에 저장된 사용자의 장애정보를 통하여 장애수준을 판단하는 장 애수준판단수단과, 상기 장애수준판단수단에서 판단된 사용자의 장애수준을 기반으로, 상기 이동로DB, 무장애시설 DB 및 주차구역DB의 정보로부터 이동경로를 생성하는 이동경로생성수단을 포함하는 경로생성부 ;를 포함할 수 있다. 이때 상기 이동로DB는 인도 및 도로의 경사 정보가 저장되는 경사도DB(112a)와, 이동로의 계단 정보가 저장되는 계단DB(112b)를 포함할 수 있다. 또한 상기 무장애시설DB는 슬로프 및 승강기를 포함하는 무장애 시설의 종류, 위치 및 고장여부를 포함하 는 상태정보가 저장되는 상태정보부(113a)와, 슬로프 및 승강기를 포함하는 무장애 시설의 종류별 아이콘 정보가 저장되는 무장애 시설 아이콘 저장수단 (113b)을 포함할 수 있다. 아울러 상기 데이터베이스부는 건물별로 설치되어 있는 계단의 위치 정보가 저장되는 건물계단DB를 더 포 함할 수 있다. 또한 상기 경로생성부는 상기 장애수준판단수단에서 판단된 사용자의 장애수준을 기반으로, 사용자의 이동 가능수준을 판단하는 이동가능수준판단수단을 더 포함할 수 있다. 또한 상기 경로생성부는 사용자의 장애수준에 따른 이동 가능수준을 매칭하여 저장하는 이동가능수준매칭 부를 더 포함할 수 있다. 또한 상기 이동경로생성수단은 이동경로 및 도착 예정시간을 제공하는데 있어, 빅데이터를 기반으로 인공 지능을 활용한 머신러닝 또는 딥러닝을 수행하도록 구성될 수 있다."}
{"patent_id": "10-2023-0018113", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 사용자의 장애정보(장애유형, 장애등급 등)가 포함된 사용자정보DB의 정보를 바탕으로 장애수준판단 수단에서 사용자의 장애수준을 판단하고, 상기 판단된 장애수준으로부터 사용자의 이동 가능수준을 판단하며, 상기 판단된 이동 가능수준을 기반으로, 이동로DB, 무장애시설DB 및 주차구역DB에 저장되어 있는 정보로부터 맞 춤형 이동경로를 제공함으로써, 장애인인 사용자가 안전하고 편안하게 이동할 수 있다. 또한 상기 이동경로생성수단은 이동경로 및 도착 예정시간을 제공하는데 있어, 빅데이터를 기반으로 인공지능을 활용한 머신러닝 또는 딥러닝을 수행함으로써, 지속적인 학습을 통하여 사용하는 시간이 지날수록 더욱 정확한 이동경로 및 도착 예정시간의 제공이 가능하다."}
{"patent_id": "10-2023-0018113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명을 더욱 상세하게 설명한다. 이에 앞서, 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정하여 해석되어서는 아니 되며, 발명자는 그 자신의 발명을 가 장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여, 본 발명의 기술 적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 또한, 사용되는 기술 용어 및 과학 용어에 있어서 다"}
{"patent_id": "10-2023-0018113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "른 정의가 없다면, 이 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 통상적으로 이해하고 있는 의미를 가지며, 하기의 설명 및 첨부 도면에서 본 발명의 요지를 불필요하게 흐릴 수 있는 공지 기능 및 구성에 대한 설명은 생략한다. 다음에 소개되는 도면들은 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 예로서 제공되는 것이다. 따라서, 본 발명은 이하 제시되는 도면들에 한정되지 않고 다른 형태로 구체화될 수도 있다. 또한, 명세서 전반에 걸쳐서 동일한 참조번호들은 동일한 구성요소들을 나타낸다. 도면들 중 동일한 구성 요소들은 가능한 한 어느 곳에서든지 동일한 부호들로 나타내고 있음에 유의해야 한다. 도 1은 본 발명 장애유형별 등급별 무장애 내비게이션 시스템의 일실시예이고, 도 2는 본 발명 이동로DB의 일실 시예이며, 도 3은 본 발명 경로생성부의 일실시예이다. 도 1 내지 도 3에서 도시한 바와 같이, 본 발명의 일실시예에 따른 장애유형별 등급별 무장애 내비게이션 시스 템은, 장애정보(장애유형, 장애등급 등)를 포함한 사용자의 정보가 저장되는 사용자정보DB와, 인도 및 도로의 정보가 저장되는 이동로DB와, 건물별로 설치되어 있는 슬로프 및 승강기를 포함하는 무장애 시설의 설치 정보가 저장되는 무장애시설DB 와, 건물별로 설치되어 있는 장애인 주차구역의 위치 정보가 저장되는 주차구역DB를 포함하는 데이터베이스부 ; 및 상기 데이터베이스부의 사용자정보DB에 저장된 사용자의 장애정보를 통하여 장애수준을 판단하는 장 애수준판단수단과, 상기 장애수준판단수단에서 판단된 사용자의 장애수준을 기반으로, 상기 이동로DB, 무장애시설 DB 및 주차구역DB의 정보로부터 이동경로를 생성하는 이동경로생성수단을 포함하는 경로생성부;를 포함할 수 있다. 도 1에서 도시한 바와 같이, 상기 사용자정보DB는 사용자의 장애정보(장애유형, 장애등급 등), 개인정보 등의 사용자 정보를 미리 저장할 수 있다. 상기 이동로DB는 인도 및 도로의 정보를 저장할 수 있으며, 이때 도 2에서 도시하고 있는 바와 같이, 상기 이동로DB는 인도 및 도로의 경사 정보가 저장되는 경사도DB(112a)와, 이동로의 계단 정보가 저장되는 계단 DB(112b)를 포함할 수 있다. 장애를 가지고 있는 사용자에게 이동경로를 제공하기 위해서는, 해당 이동경로가 장애인이 이용할 수 있는 이동 경로인지를 알아야 한다. 종래의 일반적인 내비게이션은 사용자의 장애여부에 무관하게 동일한 기준으로 이동경로를 제공하므로, 제공된 이동경로가 장애인이 이용할 수 있는 이동경로인지 여부를 확인할 수 없다. 장애인이 이용할 수 없는 이동경로를 제공받는 경우, 장애인은 목적지까지 이동하는데 많은 어려움이 있다. 본 발명의 상기 이동로DB는 인도 및 도로의 경사 정보가 저장되는 상기 경사도DB(112a) 및 이동로 상에 존 재하는 계단의 정보가 저장되는 상기 계단DB(112b)의 정보를 통하여, 사용자인 장애인에게 이동로를 제공할 수 있어 보다 현실적인 이동경로 생성이 가능하며, 이를 통하여 장애인은 보다 안전하고 신속하게 목적지까지 이동 할 수 있다. 상기 무장애시설DB는 건물별로 설치되어 있는 슬로프 및 승강기를 포함하는 무장애 시설의 설치 정보(종류, 위치, 고장여부, 수리기간, 가동일자 등)를 저장할 수 있다. 상기 무장애시설DB는 슬로프 및 승강기를 포함하는 무장애 시설의 종류, 위치, 고장여부, 수리기간, 가동 일자 등을 포함하는 상태정보가 저장되는 상태정보부(113a)와, 슬로프 및 승강기를 포함하는 무장애 시설의 종류별 아이콘 정보가 저장되는 무장애 시설 아이콘 저장수단 (113b)을 포함할 수 있다. 본 발명은 상기 상태정보부(113a) 및 무장애 시설 아이콘 저장수단(113b)의 정보를 기반으로, 건물별 무장애 시 설 정보를 사용자가 보기 편하게 아이콘으로 나타내어 보다 쉽게 인지할 수 있도록 유도하며, 해당 아이콘에 해 당 무장애 시설의 현재 사용가능 여부를 나타내어, 단순히 무장애 시설의 존재 여부 및 위치를 표시하여 고장난 무장애 시설로 이동하여 발생되는 불편을 방지할 수 있다. 이때, 도면에 도시되지 않았으나, 본 발명은 무장애 시설의 고장 신고 및 건물이 공공기관일 경우 이용불편 신 고를 할 수 있는 고장신고수단을 더 포함할 수 있다. 사용자는 이동경로를 제공받아 이동하는 과정에서 무장애 시설의 고장을 발견하였을 경우 이를 신고하여 빠른 조치를 유도할 수 있으며, 민간 건물에는 민원을 제기할 수 없으나 공공기관의 경우 민원을 제기할 수 있으므로 민원을 제기하여 자신뿐만 아니라 다른 장애를 가지는 사람이 해당 공공기관을 이용할 때 겪는 불편을 해결할 수 있다. 상기 주차구역DB는 건물별로 설치되어 있는 장애인 주차구역의 위치 정보를 저장할 수 있다. 상기 주차구역DB는 사용자 중, 장애인용으로 나온 차량을 직접 운전할 수 있거나, 장애인 이동을 돕는 전 용 차량을 이용할 경우 해당 장애인 주차구역으로 이동경로를 제공하여 목적지에 편안하게 도착하도록 유도할 수 있다.또한 상기 데이터베이스부는 건물별로 설치되어 있는 계단의 위치 정보가 저장되는 건물계단DB를 더 포함 할 수 있다. 도 3에서 도시하고 있는 바와 같이, 상기 경로생성부는 상기 데이터베이스부의 사용자정보DB에 저장된 사용자의 장애정보를 통하여 장애수준을 판단하는 장애수준판단수단과, 상기 장애수준판단수단에서 판단된 사용자의 장애수준을 기반으로, 상기 이동로DB, 무장애시설 DB 및 주차구역DB의 정보로부터 이동경로를 생성하는 이동경로생성수단을 포함할 수 있다. 본 발명은 사용자의 장애정보(장애유형, 장애등급 등)가 포함된 사용자정보DB의 정보를 바탕으로 장애수준 판단수단에서 사용자의 장애수준을 판단하고, 상기 판단된 장애수준으로부터 사용자의 이동 가능수준을 판 단하며, 상기 이동경로생성수단에서 상기 판단된 이동 가능수준을 기반으로, 이동로DB, 무장애시설 DB 및 주차구역DB에 저장되어 있는 정보로부터 맞춤형 이동경로를 제공함으로써, 장애인인 사용자가 안전하고 편안하게 이동할 수 있다. 상기 장애수준판단수단은 상기 사용자정보DB에 저장되어 있는 정보를 기반으로 현재 사용자가 가지고 있는 장애의 유형 및 장애 등급에 대한 정보를 습득하고, 습득된 정보를 기반으로 사용자의 장애수준을 판단하 고 판단된 장애수준으로부터 이동할 수 있는 능력의 정도를 판단하며, 상기 이동경로생성수단에서 이동경 로, 소요시간, 도착 예정시간 등의 정보를 시각정보 및 음성 정보로 제공할 수 있다. 이때 상기 장애수준판단수단을 통하여 판단된 사용자의 장애수준을 통하여 사용자가 이동을 위해 필요한 장비를 상기 이동경로생성수단을 통해 이동경로 선택과 함께 연결 또는 예약할 수 있다. 상기 장애수준판단수단의 판단을 통해 이동을 위해 장애인 전용 이동차량과 전동휠체어의 이용이 필요한 장애수준이라고 판단될 경우, 상기 이동경로생성수단에서 사용자의 현재 위치에서 목적 위치까지 이동하기 위한 방법으로 장애인 전용 이동차량과 전동휠체어 중에서 선택하여 추천할 수 있다. 이때 장애인 전용 이동차량의 이용이 필요하여 사용자가 선택할 경우, 외부 네트워크에 연결하여 장애인 전용 이동차량을 예약하여 사용자의 편의성을 극대화 할 수 있다. 또한 상기 경로생성부는 상기 장애수준판단수단에서 판단된 사용자의 장애수준을 기반으로, 사용자의 이동 가능수준을 판단하는 이동가능수준판단수단을 더 포함할 수 있다. 아울러 상기 경로생성부는 사용자의 장애수준에 따른 이동 가능수준을 매칭하여 저장하는 이동가능수준매 칭부를 더 포함할 수 있다. 상기 이동가능수준판단수단은 상기 장애수준판단수단에서 판단된 사용자의 장애수준을 기반으로, 상기 이 동가능수준매칭부의 정보로부터 상기 판단된 장애수준에 해당하는 사용자의 이동 가능수준을 판단할 수 있다. 또한 상기 경로생성부는 사용자의 이동 가능수준에 따른 이동경로를 매칭하여 저장하는 이동경로매칭부를 더 포함할 수 있다. 상기 이동경로생성수단은 상기 이동가능수준판단수단에서 판단된 사용자의 이동 가능수준을 기반으로, 상 기 이동경로매칭부의 정보로부터 상기 판단된 이동 가능수준에 해당하는 이동경로를 제공할 수 있다. 또한 상기 경로생성부는 상기 이동가능수준판단수단에서 판단된 사용자의 이동 가능수준을 변경하는 이동 가능수준 변경부를 더 포함할 수 있다. 상기 이동가능수준판단수단에서 사용자의 이동 가능수준이 특정 등급으로 판단되더라도, 장애인을 보조할 수 있 는 보호자가 있는 경우, 사용자는 상기 이동가능수준 변경부를 통하여 이동 가능수준을 다른 등급으로 변경할수 있다. 이를 통해 변경된 이동 가능수준을 기반으로 이동경로를 수신함으로써, 장애인은 보호자와 같이 보다 효율적으 로 목적지에 도착할 수 있다. 또한 상기 이동경로생성수단은 이동경로, 소요시간 및 도착 예정시간을 제공하는데 있어, 빅데이터를 기반 으로 인공지능을 활용한 머신러닝 또는 딥러닝을 수행하도록 구성될 수 있다. 상기 데이터베이스부의 정보를 기반으로 인공지능을 활용한 머신러닝 또는 딥러닝을 사용함으로써, 지속적 인 학습을 통하여 사용하는 시간이 지날수록 더욱 정확한 이동경로, 소요시간 및 도착 예정시간의 제공이 가능 하다. 또한 본 발명은 사용자의 장애수준 판단 정보 및 이동 가능수준 판단 정보를 제공하는데 있어, 빅데이터를 기반 으로 인공지능을 활용한 머신러닝 또는 딥러닝을 수행하도록 구성될 수 있다."}
{"patent_id": "10-2023-0018113", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명 장애유형별 등급별 무장애 내비게이션 시스템의 일실시예. 도 2는 본 발명 데이터베이스부의 일실시예. 도 3은 본 발명 경로생성부의 일실시예."}
