{"patent_id": "10-2019-0148914", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0061103", "출원번호": "10-2019-0148914", "발명의 명칭": "이동 로봇 및 그의 작동 방법", "출원인": "엘지전자 주식회사", "발명자": "김다은"}}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이동 로봇으로서,보관 영역을 포함하는 바디(Body); 및상기 바디를 중심으로 시큐리티 존(Security Zone)을 설정하되, 소정의 조건에 기초하여 상기 시큐리티 존의 범위를 가변적으로 조정하며, 상기 시큐리티 존에 진입한 타겟 대상의 존 점유 시간 및 거동에 기초하여, 위험 대응 등급을 결정하는 제어부를 포함하는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 바디와의 거리에 기초하여, 상기 시큐리티 존을 복수의 부분 시큐리티 존으로 분할하고, 상기 복수의 부분시큐리티 존의 시큐리티 등급을 상기 바디와 인접할수록 높게 설정하며,상기 제어부는,상기 시큐리티 등급이 높은 부분 시큐리티 존에서 타겟 대상의 존 점유 시간 및 거동에 더 높은 가중치를 부여하여 상기 위험 대응 등급을 결정하도록 구성되는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는,상기 복수의 부분 시큐리티 존 각각에서 서로 다른 기준으로 거동 수상 대상을 결정하도록 구성되는, 이동로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어부는,물품을 상기 보관 영역에 저장하여 목적지로 이동하는 경우 또는 상기 목적지에 도착하는 경우에 상기 시큐리티존을 설정하되,상기 제어부는,상기 이동 로봇의 이동 시간 정보, 상기 목적지로 이동하는 경로 상의 위험 지역 정보, 유동 인구 정보 및 사용자 설정 정보 중 적어도 하나에 기초하여 상기 시큐리티 존의 범위를 조정하도록 구성되는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는,상기 복수의 부분 시큐리티 존 중에서 상기 시큐리티 등급이 가장 높은 부분 시큐리티 존의 범위를 기 학습된존 설정 모델에 기초하여 설정하는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2021-0061103-3-제5항에 있어서,상기 시큐리티 존에 상기 타겟 대상의 진입을 감지하는 거리 감지 센서;상기 시큐리티 존을 촬영하는 카메라를 더 포함하며,상기 제어부는,상기 거리 감지 센서를 통해 상기 타겟 대상의 진입이 감지되는 경우, 상기 타겟 대상을 모니터링하도록 상기카메라를 제어하는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 거리 감지 센서는 라이다(Lidar) 센서, 적외선 센서, 초음파 센서 중 적어도 하나를 포함하며, 상기 카메라는 비전 인식 기반의 카메라를 포함하는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제어부는,상기 거리 감지 센서 및 카메라를 이용하여 상기 시큐리티 존에 진입한 타겟 대상을 모니터링하되, 상기 타겟대상의 시선을 트래킹하고, 상기 타겟 대상의 접근 속도 정보를 모니터링하도록 구성되는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,복수의 휠을 구동하여 상기 바디를 이동시키는 휠 구동부; 또는 복수의 레그를 구동하여 상기 바디를 이동시키는 레그 구동부를 더 포함하며,상기 제어부는,목적지로 이동하는 중에, 상기 위험 대응 등급이 소정 등급 이상인 경우, 상기 타겟 대상의 이동 속도보다 더빠르게 이동하도록 상기 휠 구동부 또는 상기 레그 구동부를 제어하도록 구성되는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,통신부를 더 포함하며,상기 제어부는,상기 위험 대응 등급이 소정 등급 이상인 경우, 상기 통신부를 통해 촬영된 타겟 대상의 영상을 로봇 관제 시스템에 전송하는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 제어부는,목적지로 이동하는 중에, 위험 대응 등급이 소정 등급 이상인 경우, 상기 타겟 대상이 추적하기 어려운 장소 또는 치안 담당 장소로 목적지를 변경하여 이동하도록 상기 휠 구동부 또는 상기 레그 구동부를 제어하는, 이동로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,공개특허 10-2021-0061103-4-스피커를 더 포함하며,상기 제어부는,상기 변경된 목적지에 대한 정보를 상기 타겟 대상에 경고성 알림으로 제공하도록 상기 스피커를 제어하도록 구성되는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 보관 영역을 노출하기 위한 도어를 개폐하는 도어 개폐부를 더 포함하며, 상기 제어부는,상기 도어를 오픈하기 위해 추가적인 인증 절차 또는 상기 도어를 이중으로 잠그는 락을 활성화하도록구성되는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,디스플레이를 더 포함하며,상기 제어부는,상기 보관 영역에 위치한 물품의 목적지에 도착한 경우, 물품 수령자에 대해 수령자 인증을 수행하고,상기 수령자 인증이 성공하고, 상기 위험 대응 등급이 소정 등급 이하인 경우, 상기 이동 로봇의 주변을 촬영한영상을 상기 수령자에게 제공하도록 상기 디스플레이를 제어하도록 구성되며,상기 보관 영역이 노출되도록 상기 도어 개폐부를 제어하도록 구성되는, 이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제어부는,상기 위험 대응 등급이 소정 등급 이상으로 변경되는 경우, 경고음을 스피커를 통해 출력하고, 물품이 아직 보관 영역에 배치된 경우, 상기 도어가 상기 보관 영역을 클로징하도록 상기 도어 개폐부를 제어하도록 구성되는,이동 로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제어부는,촬영된 타겟 대상의 영상을 로봇 관제 시스템에 전송하기 위해, 상기 통신부를 제어하도록 구성되는, 이동로봇."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "이동 로봇의 작동 방법으로서,물품이 바디에 포함된 보관 영역에 배치되는 단계;목적지로 이동하거나 목적지에 도착하는 경우, 상기 바디를 중심으로 시큐리티 존을 설정하되, 소정의 조건에기초하여 상기 시큐리티 존의 범위를 가변적으로 조정하는 단계;시큐리티 존에 진입한 타겟 대상의 존 점유 시간 및 거동을 모니터링하는 단계; 및모니터링된 상기 존 점유 시간 및 거동에 기초하여, 위험 대응 등급을 결정하는 단계를 포함하는, 이동 로봇의작동 방법.공개특허 10-2021-0061103-5-청구항 18 제17항에 있어서,상기 시큐리티 존의 범위를 가변적으로 조정하는 단계는,상기 이동 로봇의 이동 시간 정보, 상기 목적지로 이동하는 경로 상의 위험 지역 정보, 유동 인구 정보 및 사용자 설정 정보 중 적어도 하나에 기초하여 상기 시큐리티 존의 범위를 조정하는 단계를 포함하는, 이동 로봇의작동 방법."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 바디와의 거리에 기초하여, 상기 시큐리티 존을 복수의 부분 시큐리티 존으로 분할하는 단계; 및상기 복수의 부분 시큐리티 존의 시큐리티 등급을 상기 바디와 인접할수록 높게 설정하는 단계를 더 포함하는,이동 로봇의 작동 방법."}
{"patent_id": "10-2019-0148914", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 복수의 부분 시큐리티 존 각각에서 거동 수상 대상을 서로 다른 기준으로 결정하는 단계를 더 포함하는,이동 로봇의 작동 방법."}
{"patent_id": "10-2019-0148914", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이동 로봇이 개시된다. 본 이동 로봇은 바디 및 제어부를 포함할 수 있다. 상기 이동 로봇은 인공지능 (artificial intelligence, AI) 알고리즘 및/또는 기계학습(machine learning) 알고리즘을 실행할 수 있으며, 5G 통신 환경에서 다른 전자 기기들과 통신을 수행할 수 있다. 이에, 사용자 편의가 제고될 수 있다."}
{"patent_id": "10-2019-0148914", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 물품을 운송하는 이동 로봇 및 그의 작동 방법에 관한 것이다."}
{"patent_id": "10-2019-0148914", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온라인 및 오프라인 시장에서의 물품 운송 경쟁은 나날이 과열되고 있다. 최근에는, 사용자에게 보다 나은 편의 를 제공하기 위해 물품을 구매한 당일에 물품을 목적지까지 운송하는 서비스가 제공되기도 한다. 아울러, 물품 운송을 수행하는 무인 기반의 로봇에 대한 연구가 활발하게 진행되고 있으며, 관련 법규들이 마련되는 중이다. 종래 기술에는 적재함을 구비하여 물품을 목적지까지 운송하는 운반 로봇이 개시되며, 상기 운반 로봇은 물품의 성질에 따라 맞춤형으로 적재 공간을 제공할 수 있다. 그러나, 종래 기술의 운반 로봇은 운반 로봇으로 접근하는 거동 수상자를 모니터링하지 못하여 물품이 도난될 위험이 있으며, 수령자와 운반 로봇이 외부 공격에 노출되는 한계점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2019-0107617호(공개일 : 2019.09.20)"}
{"patent_id": "10-2019-0148914", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 보안 영역을 설정하고 설정된 보안 영역으로 침입하는 거동 수상자를 모니터 링하는 이동 로봇 및 그의 작동 방법을 제안하는 데에 있다. 본 발명의 또 다른 과제는, 물품 도난 가능성이 있거나 수령자에 해가 끼칠 우려가 있는 경우 물품 운송을 멈추 고 안전한 장소로 이동하는 이동 로봇 및 그의 작동 방법을 제안하는 데에 있다.본 발명의 또 다른 과제는, 수령 권한이 있는 대상에게 물품을 정확하게 운송하는 이동 로봇 및 그의 작동 방법 을 제안하는 데에 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2019-0148914", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0148914", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 달성하기 위하여, 본 발명의 일 실시 예에 따른 이동 로봇은 보관 영역을 포함하는 바디(Body) 및 바디를 중심으로 시큐리티 존(Security Zone)을 설정하되, 소정의 조건에 기초하여 시큐리티 존의 범위를 가변 적으로 조정하며, 시큐리티 존에 진입한 타겟 대상의 존 점유 시간 및 거동에 기초하여, 위험 대응 등급을 결정 하는 제어부를 포함할 수 있다. 상기 과제를 달성하기 위하여, 본 발명의 일 실시 예에 따른 이동 로봇의 작동 방법은 물품이 바디에 포함된 보 관 영역에 배치되는 단계, 목적지로 이동하거나 목적지에 도착하는 경우, 바디를 중심으로 시큐리티 존을 설정 하되, 소정의 조건에 기초하여 시큐리티 존의 범위를 가변적으로 조정하는 단계, 시큐리티 존에 진입한 타겟 대 상의 존 점유 시간 및 거동을 모니터링하는 단계 및 모니터링된 존 점유 시간 및 거동에 기초하여, 위험 대응 등급을 결정하는 단계를 포함할 수 있다. 보다 구체적으로, 상기 시큐리티 존의 범위를 가변적으로 조정하는 단계는, 이동 로봇의 이동 시간 정보, 목적 지로 이동하는 경로 상의 위험 지역 정보, 유동 인구 정보 및 사용자 설정 정보 중 적어도 하나에 기초하여 시 큐리티 존의 범위를 조정하는 단계를 포함할 수 있다. 보다 구체적으로, 상기 이동 로봇의 작동 방법은 바디와의 거리에 기초하여, 시큐리티 존을 복수의 부분 시큐리 티 존으로 분할하는 단계 및 복수의 부분 시큐리티 존의 시큐리티 등급을 바디와 인접할수록 높게 설정하는 단 계를 더 포함할 수 있다. 보다 구체적으로, 상기 이동 로봇의 작동 방법은 복수의 부분 시큐리티 존 각각에서 거동 수상 대상을 서로 다 른 기준으로 결정하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2019-0148914", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, 거동 수상자를 발견하는 경우 이에 대처하는 이동 로봇이 제공됨으로써, 물품 운송이 안전하고 정확하게 수행될 수 있으며, 외부 공격에 의한 사고가 미연에 방지될 수 있다."}
{"patent_id": "10-2019-0148914", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 다양한 실시 예는 인공 지능에 관한 기술을 이용할 수 있으므로, 이하에서는, 인공 지능에 대해 개략 적으로 설명한다. 인공 지능(AI: Artificial Intelligence)은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구하는 분야를 의미하며, 머신 러닝(기계 학습, Machine Learning)은 인공 지능 분야에서 다루는 다양한 문제를 정의하고 그것 을 해결하는 방법론을 연구하는 분야를 의미한다. 머신 러닝은 어떠한 작업에 대하여 꾸준한 경험을 통해 그 작 업에 대한 성능을 높이는 알고리즘으로 정의하기도 한다.인공 신경망(ANN: Artificial Neural Network)은 머신 러닝에서 사용되는 모델로서, 시냅스의 결합으로 네트워 크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경 망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 인공 신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)을 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공 신경망은 뉴런과 뉴런을 연결하는 시냅 스를 포함할 수 있다. 인공 신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함숫값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향(Bias) 등이 포함된다. 그리고, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터를 의미하며, 학습률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공 신경망에서 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함 수는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning)으로 분류할 수 있다. 지도 학습은 학습 데이터에 대한 레이블(Label)이 주어진 상태에서 인공 신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공 신경망을 학습시키 는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화 하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 인공 신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신 러닝 을 딥 러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥 러닝은 머신 러닝의 일부이다. 이하에서, 머신 러닝은 딥 러닝을 포함하는 의미로 사용된다. 이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 동일하거나 유사한 구성요소에 는 동일 유사한 도면 부호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐 릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. \"제1\", \"제2\" 등의 용어는 다양한 구성요소들을 설명하는 데 사용될 수 있지만, 상기 구성요소들은 상기 용어들 에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로 사용 된다. 또한, 실시예의 구성 및 작용을 고려하여 특별히 정의된 용어들은 실시예를 설명하기 위한 것일 뿐이고, 실시예의 범위를 한정하는 것이 아니다. 도 1은 본 발명의 일 실시 예에 따른 5G 네트워크 기반의 클라우드 시스템을 나타낸다. 도 1을 참고하면, 클라우드 시스템은 이동 로봇, 이동 단말, 로봇 관제 시스템, 각종 기 기 및 5G 네트워크를 포함할 수 있다. 이동 로봇은 이동 가능한 로봇으로, 다양한 물품을 출발지에서 목적지로 운반할 수 있다. 이동 로봇 은 물류 센터에서 직접 목적지까지 이동할 수 있으며, 물류 센터에서 물품 목적지 주변까지 차량에 적재되 어 이동한 후, 목적지 주변에서 하차하여 목적지까지 이동할 수 있다. 다만, 이동 로봇의 출발지 및 목적 지는 다양하게 설정될 수 있다. 또한, 이동 로봇은 실외뿐만 아니라 실내에서도 물품을 목적지로 이동할 수 있다. 이동 로봇은 AGV(Automated Guided Vehicle)로 구현될 수 있으며, AGV는 바닥면의 센서, 자기장, 비전기기 등에 의해 움직 이는 운송 장치일 수 있다. 이동 로봇은 물품을 저장하는 보관 영역(Storage Area)을 포함할 수 있으며, 보관 영역은 다양한 물품을 적재하기 위해 분할될 수 있으며, 분할된 복수의 부분 보관 영역에는 다양한 종류의 물품이 배치될 수 있다. 이 에 따라, 물품의 혼입이 방지될 수 있다. 이동 로봇은 5G 네트워크를 통해 서버, 각종의 통신가능한 단말과 데이터를 송신하고 수신할 수 있다. 특히, 이동 로봇은 5G 네트워크를 통해 모바일 브로드밴드(Enhanced Mobile Broadband, eMBB), URLLC(Ultra-reliable and low latency communications) 및 mMTC(Massive Machine-type communications) 중에서 적어도 하나의 서비스를 이용하여 서버, 단말과 데이터 통신을 할 수 있다. eMBB(Enhanced Mobile Broadband)는 모바일 브로드밴드 서비스로, 이를 통해 멀티미디어 콘텐츠, 무선데이터 액 세스 등이 제공된다. 또한, 폭발적으로 증가하고 있는 모바일 트래픽을 수용하기 위한 핫스팟(hot spot)과 광대 역 커버리지 등 보다 향상된 모바일 서비스가 eMBB를 통해 제공될 수 있다. 핫스팟을 통해 사용자 이동성이 작 고 밀도가 높은 지역으로 대용량 트래픽이 수용될 수 있다. 광대역 커버리지를 통해 넓고 안정적인 무선 환경과 사용자 이동성이 보장될 수 있다. URLLC(Ultra-reliable and low latency communications) 서비스는 데이터 송수신의 신뢰성과 전송 지연 측면에 서 기존 LTE 보다 훨씬 엄격한 요구사항을 정의하고 있으며, 산업 현장의 생산 프로세스 자동화, 원격 진료, 원 격 수술, 운송, 안전 등을 위한 5G 서비스가 여기에 해당한다. mMTC(Massive Machine-type communications)는 비교적 작은 양의 데이터 전송이 요구되는 전송지연에 민감하지 않은 서비스이다. 센서 등과 같이 일반 휴대폰 보다 훨씬 더 많은 수의 단말들이 동시에 무선액세스 네트워크에 mMTC에 의해 접속할 수 있다. 이 경우, 단말의 통신모듈 가격은 저렴해야 하고, 배터리 교체나 재충전 없이 수 년 동안 동작할 수 있도록 향상된 전력 효율 및 전력 절감 기술이 요구된다. 이동 단말은 5G 네트워크를 통해 이동 로봇과 통신할 수 있다. 이동 단말은 물품의 이동을 의뢰한 의뢰자 또는 물품의 수령자가 소지한 단말일 수 있다. 이동 단말은 휴대폰, 스마트 폰(smart phone), 웨어러블 디바이스(wearable device, 예를 들어, 워치형 단말기 (smartwatch), 글래스형 단말기 (smart glass), HMD(head mounted display)) 등의 이동형 기기들을 포함할 수 있다. 로봇 관제 시스템는 이동 로봇을 원격으로 제어할 수 있으며, 이동 로봇의 다양한 요청에 응답 할 수 있다. 예를 들면, 로봇 관제 시스템은 이동 로봇의 요청에 기초하여, 인공 지능을 이용한 연산 을 수행할 수 있으며, 이동 로봇의 위험 발생 알림에 대응하여 경찰서, 소방서 등과 연계된 시스템과 통신 할 수 있다. 로봇 관제 시스템은 이동 로봇의 이동 경로를 설정할 수 있으며, 로봇 관제 시스템은 복수의 목 적지가 있는 경우, 목적지의 이동 순서를 설정할 수 있다. 각종 기기는 개인 컴퓨터(PC, 400a), 자율 주행차(400b), 홈 로봇(400c) 등을 포함할 수 있다. 이동 로봇 은 물품의 운송 목적지에 도착하는 경우, 홈 로봇(400c)과의 통신을 통해 홈 로봇(400c)에게 직접 물품을 전달할 수 있다. 각종 기기는 이동 로봇, 이동 단말, 로봇 관제 시스템과 5G 네트워크를 통해 유무선 으로 연결될 수 있다. 5G 네트워크는 5G 이동 통신 네트워크, 근거리 네트워크, 인터넷 등을 포함할 수 있으며, 유무선으로 기기 들의 통신 환경을 제공할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 안전한 운송을 위해 시큐리티 존을 설정하는 이동 로봇을 개략적으로 설명하기 위한 도면이다. 이동 로봇은 바디(Body) 및 바디(Body)와 결합되어 바디(Body)를 이동시킬 수 있는 복수의 휠(WHa~WHc, WH)을 포함할 수 있다. 바디(Body)는 물품을 저장하는 보관 영역 및 전자/기계적 구성들을 포함할 수 있다. 이동 로봇은 시큐리티 존(SZ, Security Zone)을 설정할 수 있는데, 시큐리티 존 라인(SZL, Security Zone Line) 내부의 영역을 시큐리티 존이라 할 수 있다. 아울러, 시큐리티 존은 이동 로봇의 이동 중에 또는 정지한 상태에서 이동 로봇, 물품 수령자, 물품 운송 의뢰자 등을 다양한 위험(범죄, 재난 등)으로부터 보호하기 위한 안전을 유지하기 위한 영역이라 할 수 있 다. 예를 들면, 이동 로봇은 이동 로봇에 보관된 물품을 강탈하기 위한 시도에 대응하기 위해 시큐리 티 존(SZ)을 설정할 수 있다. 이동 로봇은 시큐리티 존(SZ)의 범위를 가변적으로 설정할 수 있다. 가령, 이동 로봇은 이동 중에 해 당 지역의 치안 등급이 높은 경우, 해당 지역을 지나갈 때, 시큐리티 존(SZ)의 커버 범위를 보다 넓게 설정할 수 있다. 선택적 실시 예로 치안 등급은 다양한 서버를 통해 수집될 수 있으며, 생활 안전 지도에 기반하여 설정될 수 있다. 시큐리티 존(SZ)은 이동 로봇의 중심으로부터 반지름 d로 구성된 원으로 설정될 수 있으나, 선택적 실시 예로, 다른 형태, 사이즈, 모양의 시큐리티 존이 설정될 수 있다. 이동 로봇은 다양한 센서 및 카메라를 통해 이동 로봇의 주변을 모니터링할 수 있다. 이동 로봇(10 0)은 시큐리티 존(SZ)의 범위를 정할 때, 후술할 다양한 센서 및 카메라를 이용하여 시큐리티 존(SZ)의 범위를 특정할 수 있다. 이동 로봇은 다양한 센서 및 카메라를 통해 인식된 타겟 대상들(USa~USd) 중에서 시큐리티 존(SZ)에 진입 한 타겟 대상들(USc, USd)을 보다 주의깊게 추적 및 모니터링할 수 있다. 이동 로봇은 타겟 대상들(USc,USd)의 거동 및 시큐리티 존(SZ)의 점유 시간에 기초하여 위험 대응 등급을 설정할 수 있다. 이동 로봇은 위험 대응 등급에 기초한 다양한 작동을 수행할 수 있다. 위험 대응 등급은 시큐리티 존에 대해 위험도를 산정하고 산정된 위험도에 대응하기 위한 등급이다. 이에 따라, 소매치기, 수령자 를 타겟으로 한 범죄 등이 예방될 수 있다. 도 3은 본 발명의 일 실시 예에 따른 복수의 거리 감지 센서(도 4의 131)의 배치를 설명하기 위한 도면이다. 상 기 거리 감지 센서의 일 예로 라이다 센서(도 4의 131a)가 배치된 것으로 가정하기로 한다. 도 3를 참고하면, 복수의 라이다 센서(131a, 131a1~131a4)가 바디(Body)에 배치되어 이동 로봇의 주변 영 역을 감지할 수 있다. 제어부(도 4의 190)는 복수의 거리 감지 센서(131a1~131a4)를 통해 타겟 대상과의 거리를 감지할 수 있다. 카메라(도 4의 121)도 상기 복수의 거리 감지 센서(131a1~131a4)가 위치한 지점에 같이 배치될 수 있다. 이동 로봇의 전방향을 모두 촬영 가능한 경우, 상기 카메라의 배치는 다르게 구현될 수 있다. 이동 로봇은 카메라를 통해 촬영된 영상에서 타겟 대상을 인식할 수 있으며, 타겟 대상이 수령자인지 거동 수상 대상인지 판별할 수 있다. 이를 위해, 수령자에 대한 정보가 미리 이동 로봇에 제공될 수 있다. 이동 로봇은 이동 로봇의 측정 기준점(CoB)로 설정하여 상기 측정 기준점(CoB)을 기준으로 시큐리티 존을 설정할 수 있다. 상기 측정 기준점(CoB)은 무게 중심일 수 있으나, 실시 예가 이에 한정되는 것은 아니다. 도 4는 본 발명의 일 실시 예에 따른 이동 로봇의 구성을 나타내는 블록도이다. 도 4를 참고하면, 이동 로봇은 보관 영역(Storage Area)을 포함하는 바디(Body)를 포함할 수 있으며, 이동 로봇의 구성들이 바디(Body)에 모두 포함될 수 있다. 이동 로봇은 통신부, 입력부, 센싱부 , 출력부, 메모리, 전원공급부, 휠 구동부, 도어 개폐부 및 제어부를 포 함할 수 있다. 도 4에 도시된 구성요소들은 이동 로봇을 구현하는데 있어서 필수적인 것은 아니어서, 본 명세서 상에서 설명되는 이동 로봇은 위에서 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가 질 수 있다. 통신부(110, Transceiver)는 로봇 관제 시스템, 5G 네트워크 등과 통신할 수 있는 유무선의 통신 모 듈을 포함할 수 있다. 선택적 실시 예로 상기 통신부는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), LTE(Long Term Evolution), 5G, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), 블 루투스(Bluetooth쪠), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association;IrDA), ZigBee, NFC(Near Field Communication) 통신에 관한 모듈을 탑재할 수 있다. 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰(123, \"이하, 마이 크로 칭함\")을 포함할 수 있다. 여기서, 카메라나 마이크를 센서로 취급하여, 카메라나 마이크 에서 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 입력부는 모델 학습을 위한 학습 데이터 및 학습 모델을 이용하여 출력을 획득할 때, 사용될 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 제어부는 입력 데이터에 대하여 전처리로써 입력 특징점(input feature)을 추출할 수 있다. 입력부는 물품 정보 입력부를 포함할 수 있는데, 상기 물품 정보 입력부는 물품의 사이즈 정보, 무게 정보, 목적지 정보, 운송 의뢰자에 대한 정보 등을 입력받을 수 있다. 이때, 상기 물품 정보 입력부는 코드 리더(미도시) 방식으로 구현될 수 있다. 센싱부는 다양한 센서들을 이용하여 이동 로봇의 내부 정보, 이동 로봇의 주변 환경 정보 및 사 용자 정보 중 적어도 하나를 획득할 수 있다. 센싱부는 위성에 기반한 위치 수신 센서, 거리 감지 센서, 조도 센서, 가속도 센서, 자기 센서, 자이 로 센서, 관성 센서, RGB 센서, 적외선 센서, 지문 인식 센서, 광 센서, 마이크, 자석 센서 등을 포함할 수 있 다. 여기서, 거리 감지 센서는 라이다(Lidar) 센서(131a), 적외선(IR) 센서(131b) 및 초음파 센서(131c) 등을 포함할 수 있으며, 상기 센서들을 이용하여 타겟 대상의 접근을 감지할 수 있다. 제어부는 입력부 및 센싱부를 통해 수신된 정보에 기초하여 정당 권한이 있는 수령자를 인식할 수 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있는데, 출력부는 시각 정보를 출력 하는 광 출력부, 디스플레이, 청각 정보를 출력하는 스피커 등을 포함할 수 있고, 촉각 정보를 출력 하는 햅틱 모듈을 포함할 수 있다. 메모리는 이동 로봇의 다양한 기능을 지원하는 데이터를 저장한다. 메모리는 이동 로봇에 서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 이동 로봇의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 아울러, 메모리는 인공 지능, 머신 러닝, 인공 신경망을 이용하여 연산을 수행하는데 필요한 정보를 저장 할 수 있다. 메모리는 심층 신경망 모델을 저장할 수 있다. 상기 심층 신경망 모델은 학습 데이터가 아닌 새로운 입력 데이터에 대하여 결과 값을 추론해 내는데 사용될 수 있고, 추론된 값은 어떠한 동작을 수행하기 위한 판단의 기초로 이용될 수 있다. 메모리는 존 설정 모델을 저장할 수 있으며, 제어부는 메모리에 저장된 존 설정 모델(15 1)에 기초하여 시큐리티 등급이 가장 높은 부분 시큐리티 존의 범위를 가변적으로 결정할 수 있다. 전원공급부는 제어부의 제어 하에서, 외부의 전원, 내부의 전원을 인가 받아 이동 로봇의 각 구 성요소들에 전원을 공급한다. 이러한 전원공급부는 배터리를 포함하며, 상기 배터리는 내장형 배터리 또는 교체가능한 형태의 배터리가 될 수 있다. 상기 배터리는 유선 또는 무선 충전 방식으로 충전될 수 있는데, 무선 충전 방식은 자기 유도 방식 또는 자기 공진 방식을 포함할 수 있다. 휠 구동부는 복수의 휠을 제어하여 바디(Body)를 이동시킬 수 있다. 레그 구동부(미도시)는 제어부의 제어에 따라 복수의 레그를 제어하여 바디를 이동시킬 수 있다. 복수의 레그는 이동 로봇이 걷거나 뛸 수 있도록 형성된 구성에 해당될 수 있다. 복수의 레그는 4개로 구현될 수 있으나, 실시 예가 이에 국한되는 것은 아니다. 복수의 레그는 바디에 결합되어 일체형으로 형성될 수 있으며, 바디에 탈부착 형태로 구현될 수 있다. 이동 로봇은 휠 구동부 및/또는 레그 구동부를 구비하여 바디를 이동시킬 수 있다. 다만, 본 명세서 상에서는 휠 구동부가 이동 로봇에 탑재된 예를 주로 설명한다. 도어 개폐부는 제어부의 제어에 따라 보관 영역을 노출 또는 비노출시키는 도어를 개방 및 폐쇄를 수 행할 수 있다. 제어부는 이동 로봇의 구성들을 컨트롤하는 모듈이다. 상기 제어부는 프로그램 내에 포함된 코 드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로써, 마이크로프로세서 (microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세 서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 제어부는 바디(Body)를 중심으로 시큐리티 존(SZ)을 설정할 수 있는데, 제어부는 소정의 조건에 기초 하여 시큐리티 존(SZ)의 범위를 가변적으로 조정할 수 있다. 제어부는 이동 로봇의 이동 시간 정보, 상기 목적지로 이동하는 경로 상의 위험 지역 정보, 유동 인 구 정보 및 사용자 설정 정보 중 적어도 하나에 기초하여 시큐리티 존(SZ)의 범위를 조정할 수 있다. 제어부는 밤에 이동하는 경우, 시큐리티 존(SZ)을 보다 넓게 설정할 수 있으며, 경로 상에 치안 등급이 높 은 위험 지역을 통과하는 경우 시큐리티 존(SZ)을 보다 넓게 설정할 수 있으며, 유동 인구가 많은 지역을 지나 갈 때는 시큐리티 존(SZ)을 보다 좁게 설정할 수 있으며, 사용자가 설정한 지역에 대해서는 사용자의 의도에 따 라 시큐리티 존(SZ)의 범위를 설정할 수 있다. 다만, 상기 시큐리티 존(SZ)의 범위 설정은 구현 예에 따라 다를 수 있다. 제어부는 이동 중에, 출발지/목적지에서, 중간에 멈춘 지점에서 소정의 주기 또는 이벤트가 발생될 때마다 시큐리티 존을 설정 및 조정할 수 있다. 제어부는 시큐리티 존에 진입한 타겟 대상의 존 점유 시간 및 거동에 기초하여 위험 대응 등급을 결정할 수 있다. 여기서, 타겟 대상은 사람, 동물, 차량 등을 포함한 다양한 장애물이 다양하게 포함될 수 있다. 제어부는 시큐리티 존(SZ)에서 타겟 대상이 위치한 시간 정보(존 점유 시간 정보)를 모니터링할 수 있으며, 시큐리티 존 (SZ)에서의 타겟 대상의 시선 처리, 행동, 발화 음성 등을 모니터링할 수 있다. 제어부는 위험 대응 등급을 결정할 수 있으며, 저위험부터 고위험에 대응하는 위험 대응 등급을 결정할 수 있다. 구체적으로, 제어부는 위험도에 기초하여 위험 대응 등급을 결정할 수 있다. 예를 들면, 제어부는 시큐리티 존에 거동 수상 대상이 없는 경우, 위험도를 0으로 설정할 수 있으며, 위험 대응 등급을 안전 상태(0 등급)로 결정할 수 있다. 제어부는 시큐리티 존 내의 시큐리티 존 라인 부근에 위치한 타겟 대상이 소정 시간 위치하거나 물품 수령이 진행 중인데 거동 수상 대상이 없는 경우, 위험도를 1로 설정할 수 있으며, 위험 대응 등급을 주의 상태(1 등급)로 결정할 수 있다. 제어부는 거동 수상 대상이 시 큐리티 존 내를 20분 이상 점유하거나 거동 수상 대상이 이동 로봇에 소정 속도로 접근하는 경우, 위험도 를 2로 설정할 수 있으며, 위험 대응 등급을 위험 상태(2 등급)으로 결정할 수 있다. 제어부는 이동 로봇 과 아주 근접한 거리에 거동 수상 대상이 위치하거나 물품 수령 중에 거동 수상 대상이 소정 속도로 이동 로봇에 접근하는 경우, 위험도를 3으로 설정할 수 있으며, 위험 대응 등급을 고위험 상태(3 등급)으로 결 정할 수 있다. 다만, 상기 위험도의 등급 및 위험 대응 등급의 결정은 실시 예에 따라 다양하게 구현될 수 있다. 제어부는 거리 감지 센서를 이용하여 주변의 타겟 대상을 감지할 수 있으며, 카메라를 이용하여 타겟 대상을 모니터링할 수 있다. 카메라는 비전 인식 기반의 카메라를 포함하여, 타겟 대상을 인식할 수 있다. 제어부는 카메라에서 촬영된 영상에서 타겟 대상이 수령자인지 거동 수상 대상인지 식별할 수 있다. 제어부는 거리 감지 센서 및 카메라를 이용하여 타겟 대상의 시선을 트래킹할 수 있으며, 이동 로봇으로 접근하는 타겟 대상의 접근 속도를 측정할 수 있다. 도 5 내지 도 7은 본 발명의 일 실시 예에 따른 이동 로봇의 작동 방법을 설명하기 위한 도면들이다. 도 5는 본 발명의 일 실시 예에 따른 목적지에서 이동 로봇의 작동을 설명하기 위한 도면이다. 이동 로봇은 목적지에 도착하는 경우, 시큐리티 존(SZ)을 설정할 수 있으며, 거리 감지 센서 및 카메 라를 이용하여 시큐리티 존(SZ)에 진입한 타겟 대상(USe, USf)을 모니터링하되, 상기 타겟 대상(USe, US f)의 시선을 트래킹할 수 있다. 또한, 이동 로봇은 타겟 대상(USe, USf)의 접근 속도 정보를 모니터링할 수 있다. 여기서, 소정의 타겟 대상(USf)가 수령자인 것으로 가정하기로 한다. 제어부는 수령자(USf)에 대해 수령자 인증을 수행할 수 있다. 이동 로봇은 생체 인식, 비밀 번호 입 력, 코드 입력 등을 통해 수령자 인증을 수행할 수 있다. 제어부는 수령자 인증이 성공하고, 주변에 타겟 대상(USe)이 있는 경우, 디스플레이(미도시, 도 4의 141) 에 이동 로봇의 주변을 촬영한 영상 및 타겟 대상(USe)의 영상을 출력할 수 있다. 제어부는 수령자 (USf)의 진행 명령(가령, 음성 명령 등)을 받아, 도어(Door)를 오픈하여 물품(Art)을 수령자(USf)에게 오픈시킬 수 있다. 그러면, 수령자(USf)는 물품(Art)을 수령할 수 있다. 이때, 제어부는 타겟 대상(USe)이 특이한 거동(가령, 갑작스럽게 이동 로봇에 접근)하는 경우, 경고 음을 스피커를 통해 출력할 수 있으며, 보관 영역에 물품(Art)이 그대로 있으면 도어 개폐부를 제어하여 도어(Door)를 클로징할 수 있다. 만약, 이동 로봇은 수령자(USf)가 물품(Art)을 꺼냈다가 급작스럽게 물품(Art)을 보관 영역에 다시 위치시 키면, 도어(Door)를 신속하게 클로징할 수 있다. 또한, 제어부는 통신부를 통해 외부 치안 시스템, 로봇 관제 시스템 등에 타겟 대상(USe)의 영상을 제공하여 상황을 공유할 수 있다. 다른 실시 예에서, 제어부는 수령자(USf) 이외의 타겟 대상이 이동 로봇의 주변에 있는 경우, 수령자 (USf)에게 추가 인증 절차를 요구하거나 배송을 진행해도 될지 문의할 수 있다. 제어부는 수령자(USf)가 수령을 거부하면, 도어(Door)를 이중으로 잠그는 락을 활성화시킬 수 있다. 도 6은 본 발명의 일 실시 예에 따른 시큐리티 존(SZ)을 가변적으로 설정하는 이동 로봇의 작동을 설명하 기 위한 도면이다. 도 6을 참고하면, 제어부는 출발지에서 목적지까지 이동하는 경우, 이동 시간 정보, 목적지 로 이동하는 경로 상의 위험 지역 정보, 유동 인구 정보 및 사용자 설정 정보 중 적어도 하나에 기초하여 상기 시큐리티 존의 범위를 조정할 수 있다. 예를 들면, 제어부는 휠 구동부를 제어하여 제1 로드(LD1)을 이동할 때, A 지점(630a1)에서 반지름 d1+d2로 형성되는 시큐리티 존을 설정할 수 있다. 이동 로봇은 치안 등급이 비교적 낮은 1S 지점(1S) 및 2S 지점(2S)을 지나고 나서, B 지점(630b1)에서 반지름 d1+d2+d3로 형성되는 시큐리티 존을 설정할 수 있다. 제 어부는 전방에 치안 등급이 높은 S3 지점(S3)가 있으므로, S3 지점(S3)으로 이동하지 않도록 경로(Path)를 설정하며, 시큐리티 존 사이즈를 크게 설정할 수 있다. 이에, 제어부는 제2 로드(LD2)가 아닌 제3 로드(LD3) 방향으로 이동하도록 휠 구동부를 제어할 수 있 으며, 제어부는 C 지점(630c1) 및 D 지점(630d1)에서 반지름 d1으로 형성되는 시큐리티 존을 설정할 수 있 다. 도 7은 본 발명의 일 실시 예에 따른 시큐리티 존(SZ)을 복수의 부분 시큐리티 존(SZa~SZc)으로 설정하는 이동 로봇의 작동을 설명하기 위한 도면이다. 도 7을 참고하면, 제어부는 이동 로봇과의 거리에 기초하여, 시큐리티 존(SZ)을 복수의 부분 시큐리 티 존(SZa~SZc)으로 분할하고, 복수의 부분 시큐리티 존(SZa~SZc)의 시큐리티 등급을 상기 바디와 인접할수록 높게 설정할 수 있다. 제어부는 시큐리티 등급이 높은 부분 시큐리티 존에서 타겟 대상의 존 점유 시간 및 거동에 더 높은 가중 치를 부여하여 상기 위험 대응 등급을 결정할 수 있다. 위험 대응 등급은 위험도에 대응하여 위험도가 높을수록 상기 위험 대응 등급이 높게 설정될 수 있다. 제어부는 복수의 부분 시큐리티 존(SZa~SZc) 각각에서 서로 다른 기준으로 거동 수상 대상을 결정할 수 있 다. 예를 들면, 제어부는 제1 부분 시큐리티 존(SZa)을 타겟 대상(USm, USk)이 소정 시간(가령, 10분) 점유하 는 경우, 해당 타겟 대상(USm, USk)을 거동 수상 대상으로 설정할 수 있고, 식별 번호(ID)를 매핑하여 추적할 수 있다. 또한, 제어부는 제2 부분 시큐리티 존(SZb)에서 타겟 대상(USi, USj)이 소정 시간(가령, 5분) 점 유하는 경우, 해당 타겟 대상(USi, USj)을 거동 수상 대상으로 설정하고, 식별 번호(ID)를 매핑하여 추적할 수 있다. 또한, 제어부는 제3 부분 시큐리티 존(SZc)을 타겟 대상(USh, USg)이 소정 시간(가령, 1분) 점유하 는 경우, 해당 타겟 대상(USh, USg)을 거동 수상 대상으로 설정하고, 식별 번호(ID)를 매핑하여 추적할 수 있다. 또한, 제어부는 복수의 부분 시큐리티 존 중에서 시큐리티 등급이 가장 높은 부분 시큐리티 존(제3 부분 시큐리티 존(SZc))의 범위를 기 학습된 존 설정 모델에 기초하여 설정할 수 있다. 가령, 제어부는 이동 로 봇의 이동 시간 정보, 목적지로 이동하는 경로 상의 위험 지역 정보, 목적지의 위치 정보, 유동 인구 정보, 물품의 가치 정보, 실제 도난을 포함한 범죄 발생 장소 정보 등을 입력 데이터로, 제3 부분 시큐리티 존 (SZc)의 범위를 레이블 데이터로 입력받아, 제3 부분 시큐리티 존(SZc)의 적합한 범위를 설정할 수 있다. 제어부는 목적지로 이동하는 중에, 위험 대응 등급이 소정 등급 이상인 경우, 타겟 대상의 이동 속도보다 더 빠르게 이동하도록 휠 구동부를 제어할 수 있다. 제어부는 위험 대응 등급이 소정 등급 이상인 경우, 통신부를 통해 촬영된 타겟 대상의 영상을 로봇 관제 시스템에 전송할 수 있다. 제어부는 목적지로 이동하는 중에, 위험 대응 등급이 소정 등급 이상인 경우, 타겟 대상이 추적하기 어려 운 장소 또는 치안 담당 장소로 목적지를 변경하여 이동하도록 휠 구동부를 제어할 수 있다. 이 경우, 제어부는 변경된 목적지에 대한 정보를 타겟 대상에 경고성 알림으로 제공하도록 스피커를 제어할 수 있다. 도 8 내지 도 11은 본 발명의 다양한 실시 예에 따른 이동 로봇의 작동 방법을 설명하기 위한 시퀀스도들 이다. 도 8은 본 발명의 일 실시 예에 따른 시큐리티 존의 범위를 설정하는 방법을 설명하기 위한 시퀀스도이다. 먼저, 이동 로봇은 바디를 중심으로 시큐리티 존을 설정한다(S810). 이동 로봇은 이동 시간에 기초하여 시큐리티 존의 범위를 조정한다(S820). 즉, 이동 로봇은 밤/낮 시간에 따라 시큐리티 존의 범위를 조정할 수 있는데, 밤인 경우에 보다 범죄 가능 성을 높게 인식하여, 시큐리티 존의 범위를 넓게 조정할 수 있다. 가령, 이동 로봇은 설정된 시큐리티 존 보다 몇 스텝 더 넓게 조정할 수 있다. 그 다음으로, 이동 로봇은 경로 상 위험 지역 존부에 기초하여, 시큐리티 존의 범위를 조정한다(S830). 가령, 이동 로봇은 경로 상의 치안 등급이 높은 지역에 대해 시큐리티 존을 보다 넓게 조정할 수 있다. 이동 로봇은 목적지 도착할 때까지(S840), 상기 S820, S830 단계를 반복 수행한다. 이동 로봇은 목적 지에 도착하면(S840), 시큐리티 존의 범위를 초기화한다(S850). 도 9는 본 발명의 일 실시 예에 따른 거동 수상 대상을 결정하는 방법을 설명하기 위한 시퀀스도이다. 도 9를 참고하면, 이동 로봇은 시큐리티 존에 진입한 타겟 대상을 감지한다(S910). 이동 로봇은 타겟 대상이 위치한 부분 시큐리티 존에 기초하여, 거동 수상 대상으로 결정하기 위한 임계 시간을 설정한다(S920). 이동 로봇은 타겟 대상을 추적(S930)하고, 시큐리티 등급이 최우선인 부분 시큐리티 존에 타겟 대상이 위 치하면(S940), 임계 시간과 상관없이 타겟 대상을 거동 수상 대상으로 결정한다(S950). 이동 로봇은 타겟 대상이 시큐리티 등급이 최우선인 부분 시큐리티 존에 없는 경우(S940), 타겟 대상의 위 치 및 경과 시간에 기초하여 거동 수상 대상으로 결정하기 위한 임계 시간을 재설정한다(S960). 여기서, 이동 로봇은 임계 시간이 경과하면(S970)은 타겟 대상을 거동 수상 대상으로 결정하고(S950), 임 계 시간이 경과하지 않으면(S970), 타겟 대상을 계속 추적한다(S930). 상기 임계 시간은 타겟 대상이 이동 로봇에 가까워질수록 짧아질 수 있으며, 멀어질수록 서서히 길어지도 록 구현될 수 있다. 도 10은 본 발명의 일 실시 예에 따른 이동 중에 위험 대응 등급에 기초하여 작동하는 이동 로봇을 설명하 기 위한 시퀀스도이다. 위험 대응 등급은 위험도에 대응하는 등급으로 0 등급 내지 3 등급 이상으로 구현될 수 있다. 먼저, 이동 로봇은 이동한다(S110). 이때, 이동 로봇은 위험 대응 등급이 0 등급인 경우, 계속 이동한다(S120). 이동 로봇은 위험 대응 등급이 1 등급인 경우(S115, S125), 거동 수상 대상을 추적하고(S130), 이동 속도 를 상향 설정하며(S135), 추적한 거동 수상 대상이 시큐리티 존을 그대로 점유하면(S140), 위험 대응 등급을 상 향 설정한다(S145). 이동 로봇은 위험 대응 등급이 2 등급인 경우(S150), 이동 경로 를 수정한다(S155). 이동 로봇은 보 다 안전한 곳으로 이동할 수 있다. 이동 로봇은 추적한 거동 수상 대상이 시큐리티 존에 그대로 있는 경우(S160), 위험 대응 등급을 상향 설 정한다(S165).이동 로봇은 위험 대응 등급이 3 등급 이상인 경우(S170), 경고음 출력하고(S175), 경찰서에 연결된 서버 또는 로봇 관제 시스템에 신고하고, 거동 수상 대상에게 경고음 출력한다(S180). 도 11은 본 발명의 일 실시 예에 따른 목적지에서 거동 수상 대상에 따라 작동하는 이동 로봇을 설명하기 위한 시퀀스도이다. 먼저, 이동 로봇은 목적지에 도착하고(S210), 수령자가 없는 경우(S215), 시큐리티 존에 거동 수상 대상이 있는지 모니터링한다(S245). 이동 로봇은 거동 수상 대상이 없는 경우(S245), 수령자를 기다리고(S250), 거동 수상 대상이 있는 경우 (S245), 거동 수상 대상을 추적하고, 수령자에게 알림을 제공한다(S255, S260). 이동 로봇은 수령자가 있는 경우(S215), 시큐리티 존에 거동 수상 대상이 있는지 모니터링한다(S220). 이동 로봇은 시큐리티 존에 거동 수상 대상이 있는 경우(S220), 경고음을 출력하고, 수령을 중단하며 (S225), 로봇 관제 시스템에 신고할 수 있다. 이동 로봇은 시큐리티 존에 거동 수상 대상이 없는 경우(S220), 이동 로봇의 주변 영상을 출력하고(S235), 수령자에 의해 물품 수령이 완료된다(S240). 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 또한, 상기 컴퓨터는 이동 로봇의 제어부를 포함할 수도 있다. 앞에서, 본 발명의 특정한 실시예가 설명되고 도시되었지만 본 발명은 기재된 실시예에 한정되는 것이 아니고, 이 기술 분야에서 통상의 지식을 가진 자는 본 발명의 사상 및 범위를 벗어나지 않고서 다른 구체적인 실시예로 다양하게 수정 및 변형할 수 있음을 이해할 수 있을 것이다. 따라서, 본 발명의 범위는 설명된 실시예에 의하여 정하여 질 것이 아니고 청구범위에 기재된 기술적 사상에 의해 정하여져야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2019-0148914", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 5G 네트워크 기반의 클라우드 시스템을 설명하기 위한 도면, 도 2는 본 발명의 일 실시 예에 따른 안전한 운송을 위해 시큐리티 존을 설정하는 이동 로봇을 개략적으로 설명 하기 위한 도면, 도 3은 본 발명의 일 실시 예예 따른 복수의 거리 감지 센서의 배치를 설명하기 위한 도면, 도 4는 본 발명의 일 실시 예에 따른 이동 로봇의 구성을 나타내는 블록도, 도 5 내지 도 7은 본 발명의 일 실시 예에 따른 이동 로봇의 작동 방법을 설명하기 위한 도면들, 그리고, 도 8 내지 도 11은 본 발명의 다양한 실시 예에 따른 이동 로봇의 작동 방법을 설명하기 위한 시퀀스도들이다."}
