{"patent_id": "10-2019-0113242", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0032038", "출원번호": "10-2019-0113242", "발명의 명칭": "심리상태를 시각화하여 상품에 적용하는 방법, 프로그램 및 시스템", "출원인": "이재원", "발명자": "이재원"}}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터에 의해 수행되는,사용자로부터 하나 이상의 비주얼 저널(visual journal)을 입력받는 단계;상기 하나 이상의 비주얼 저널을 기반으로 분석 데이터 및 분석 이미지를 생성하는 단계;상기 하나 이상의 비주얼 저널을 기반으로 심볼 디자인을 생성하는 단계 및상기 심볼 디자인을 상품에 적용하여 상품 디자인을 생성하는 단계를 포함하고,상기 비주얼 저널은 작품이미지, 텍스트 및 감정 카테고리를 포함하고,상기 분석 데이터는 상기 감정 카테고리의 통계치를 포함하고,상기 분석 이미지는 상기 분석 데이터를 시각화한 이미지이고,상기 심볼 디자인은 상기 작품이미지 및/또는 상기 텍스트를 조합한 것인,심리상태를 시각화하여 상품에 적용하는 방법."}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 분석 데이터는 상기 작품이미지에 대한 특징정보를 포함하고,상기 특징정보는 화풍, 색상, 벡터값 중 하나 이상을 포함하는,심리상태를 시각화하여 상품에 적용하는 방법."}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 분석 데이터를 기반으로 상기 사용자의 작품이미지와 유사도가 높은 작품을 추출하는 단계 및상기 추출된 작품을 기반으로 상기 사용자에게 어드바이스를 제공하는 단계를 더 포함하고,상기 유사도는 상기 특징정보를 수치화하여 비교측정되는 것인,심리상태를 시각화하여 상품에 적용하는 방법."}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,다른 사용자들의 작품 중 상기 사용자의 작품에 대한 특징정보와 유사도가 높은 작품을 제공하는 단계를 더 포함하는,심리상태를 시각화하여 상품에 적용하는 방법."}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 사용자의 작품에 대한 특징정보를 기반으로 서버에 등록된 전문작가와 매칭하는 단계를 더 포함하는,심리상태를 시각화하여 상품에 적용하는 방법.공개특허 10-2021-0032038-2-청구항 6 제1항에 있어서,상기 심볼 디자인을 생성하는 단계는,상기 하나 이상의 비주얼 저널에 포함된 작품이미지와 텍스트를 팔레트 형태로 제공하는 단계 및상기 제공한 작품이미지와 키워드 중 각각 하나 이상이 선택되는 단계를 포함하는,심리상태를 시각화하여 상품에 적용하는 방법."}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 심볼 디자인을 생성하는 단계는,상기 사용자에게 질문을 제공하여 답변을 입력받는 단계를 더 포함하는,심리상태를 시각화하여 상품에 적용하는 방법."}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 상품 디자인을 생성하는 단계는,2D 또는 3D 형태로 상품 이미지를 제공하는 단계와,상기 상품 이미지 내에 상기 심볼 디자인의 배치를 결정하는 단계를 포함하는,심리상태를 시각화하여 상품에 적용하는 방법."}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "하드웨어인 컴퓨터와 결합되어, 제1항 내지 제8항 중 어느 한 항의 방법을 실행시키기 위하여 매체에 저장된,심리상태를 시각화하여 상품에 적용하는 프로그램."}
{"patent_id": "10-2019-0113242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "사용자로부터 하나 이상의 비주얼 저널(visual journal)을 입력받는 입력부;상기 하나 이상의 비주얼 저널을 기반으로 분석 데이터 및 분석 이미지를 생성하는 분석부;상기 하나 이상의 비주얼 저널을 기반으로 심볼 디자인을 생성하는 심볼 디자인 생성부 및상기 심볼 디자인을 상품에 적용하여 상품 디자인을 생성하는 상품 디자인 생서부를 포함하고,상기 비주얼 저널은 작품이미지, 텍스트 및 감정 카테고리를 포함하고,상기 분석 데이터는 상기 감정 카테고리의 통계치를 포함하고,상기 분석 이미지는 상기 분석 데이터를 시각화한 이미지이고,상기 심볼 디자인은 상기 작품이미지 및/또는 상기 텍스트를 조합한 것인,심리상태를 시각화하여 상품에 적용하는 시스템."}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "심리상태를 시각화하여 상품에 적용하는 방법, 프로그램 및 시스템이 제공된다. 상기 심리상태를 시각화하여 상 품에 적용하는 방법은 컴퓨터에 의해 수행되는, 사용자로부터 하나 이상의 비주얼 저널(visual journal)을 입력 받는 단계, 상기 하나 이상의 비주얼 저널을 기반으로 분석 데이터 및 분석 이미지를 생성하는 단계, 상기 하나 이상의 비주얼 저널을 기반으로 심볼 디자인을 생성하는 단계 및 상기 심볼 디자인을 상품에 적용하여 상품 디자 인을 생성하는 단계를 포함하고, 상기 비주얼 저널은 작품이미지, 텍스트 및 감정 카테고리를 포함하고, 상기 분 석 데이터는 상기 감정 카테고리의 통계치를 포함하고, 상기 분석 이미지는 상기 분석 데이터를 시각화한 이미지 이고, 상기 심볼 디자인은 상기 작품이미지 및/또는 상기 텍스트를 조합한 것이다."}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 심리상태를 시각화하여 상품에 적용하는 방법, 프로그램 및 시스템에 관한 것으로, 보다 상세하게는 사용자의 심리상태를 시각화하고, 이를 기반으로 디자인을 생성하여 상품에 적용하는 방법, 프로그램 및 시스템에 관한 것이다."}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 소비자들은 패션 브랜드들이 만들어 놓은 상품을 그대로 구매하는 것보다 개성있는 본인의 스타일이 반영 된 상품을 구매하는 것을 추구한다. 이러한 추세에 따라 소비자 개개인별로 커스터마이징(customizing)된 상품 들에 대한 인기가 높다. 즉, 소비자들은 대중성이 있는 인기 상품 등과 차별화되어 희소성 있는 상품들에 대한 관심이 커지고 있다. 이에 따라 패션 브랜드들은 변화된 소비 시장 및 소비자의 구매 욕구에 발맞춰서 소비자의 감성과 감각이 반영 될 수 있는 상품 및 서비스를 제공하기 위해 노력하고 있다. 예를 들어, 패션 브랜드들은 기존에 판매하던 상품 들을 제작된 형태 그대로 판매하기 보다는 해당 상품들의 일부에 구매자의 이름, 이니셜, 원하는 문구 등이 삽 입된 형태로 판매하는 서비스를 개발에 몰두하고 있으며, 이러한 서비스가 제공되는 대상 품목들도 제한없이 확 대되고 있다. 한편, 현대인들은 자신의 감정 상태에 대해 타인과 공유하고자 하는 욕구가 크다. 이를 위해 현대인들은 소셜 네트워크 서비스(Social Network Service; SNS) 등을 통해 온라인상에서도 이미지, 동영상, 텍스트 등을 활용하 여 자신이 현재 느끼는 기분, 감정들에 대해 자유롭게 표현한다. 또한, 다른 사람들이 업로드한 게시물 등을 감 상하며 해당하는 감정에 공감하거나, 해당 게시물로부터 영감을 얻기도 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2001-0000244호, 2001.01.05"}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래의 커스터마이징 시스템 및 제품들은 개인의 개성, 스토리 등을 깊이있게 반영하지 못하고, 단순히 이름, 이니셜 등을 삽입하는 형태에 국한되어 있다. 본 발명이 해결하고자 하는 과제는 사용자 개인의 고유한 예술적 특성, 감정 등의 심리상태를 시각화하는 방법, 프로그램 및 시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 과제는 사용자 개인의 개성 및 정체성이 반영된 디자인을 생성하고, 이를 상 품에 다양한 형태로 적용할 수 있도록 하여 희소성있고 차별화된 상품 디자인을 생성하는 방법, 프로그램 및 시 스템을 제공하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 면에 따른 심리상태를 시각화하여 상품에 적용하는 방법은 컴퓨터에 의해 수행되는, 사용자로부터 하나 이상의 비주얼 저널(visual journal)을 입력받는 단계, 상기 하나 이상의 비 주얼 저널을 기반으로 분석 데이터 및 분석 이미지를 생성하는 단계, 상기 하나 이상의 비주얼 저널을 기반으로 심볼 디자인을 생성하는 단계 및 상기 심볼 디자인을 상품에 적용하여 상품 디자인을 생성하는 단계를 포함하고, 상기 비주얼 저널은 작품이미지, 텍스트 및 감정 카테고리를 포함하고, 상기 분석 데이터는 상기 감 정 카테고리의 통계치를 포함하고, 상기 분석 이미지는 상기 분석 데이터를 시각화한 이미지이고, 상기 심볼 디 자인은 상기 작품이미지 및/또는 상기 텍스트를 조합한 것이다. 상기 방법에서 상기 분석 데이터는 상기 작품이미지에 대한 특징정보를 포함하고, 상기 특징정보는 화풍, 색상, 벡터값 중 하나 이상을 포함한다. 상기 방법은 상기 분석 데이터 및 사전 저장된 데이터베이스를 기반으로 상기 사용자의 작품이미지와 유사도가 높은 작품을 추출하는 단계 및 상기 추출된 작품을 기반으로 상기 사용자에게 어드바이스를 제공하는 단계를 더 포함하고, 상기 사전 저장된 데이터베이스는 전문작가의 작품에 대한 특징정보를 포함하고, 상기 유사도는 상기 전문작가의 작품에 대한 특징정보와 상기 사용자의 작품에 대한 특징정보를 비교하여 측정되는 것이다. 상기 방법은 다른 사용자들의 작품 중 상기 사용자의 작품에 대한 특징정보와 유사도가 높은 작품을 제공하는 단계를 더 포함한다. 상기 방법은 상기 사용자의 작품에 대한 특징정보를 기반으로 서버에 등록된 전문 작가와 매칭하는 단계를 더 포함한다. 상기 방법에서 상기 심볼 디자인을 생성하는 단계는, 상기 하나 이상의 비주얼 저널에 포함된 작품이미지 및 텍 스트를 팔레트 형태로 제공하는 단계와, 상기 제공한 작품이미지 및 텍스트 중 각각 하나 이상이 선택되는 단계 를 포함한다. 상기 방법에서 상기 심볼 디자인을 생성하는 단계는, 상기 사용자에게 질문을 제공하여 답변을 입력받는 단계를 더 포함한다. 상기 방법에서 상품 디자인을 생성하는 단계는, 2D 또는 3D 형태로 상품 이미지를 제공하는 단계와, 상기 상품 이미지 내에 상기 심볼 디자인의 배치를 결정하는 단계를 포함한다. 상술한 과제를 해결하기 위한 본 발명의 다른 면에 따른 심리상태를 시각화하여 상품에 적용하는 프로그램은 하 드웨어인 컴퓨터와 결합되어, 상기 심리상태를 시각화하여 상품에 적용하는 방법을 실행하며 매체에 저장된다. 상술한 과제를 해결하기 위한 본 발명의 또 다른 면에 따른 심리상태를 시각화하여 상품에 적용하는 시스템은 사용자로부터 하나 이상의 비주얼 저널(visual journal)을 입력받는 입력부, 상기 하나 이상의 비주얼 저널을 기반으로 분석 데이터 및 분석 이미지를 생성하는 분석부, 상기 하나 이상의 비주얼 저널을 기반으로 심볼 디자 인을 생성하는 심볼 디자인 생성부 및 상기 심볼 디자인을 상품에 적용하여 상품 디자인을 생성하는 상품 디자 인 생서부를 포함하고, 상기 비주얼 저널은 작품이미지, 텍스트 및 감정 카테고리를 포함하고, 상기 분석 데이 터는 상기 감정 카테고리의 통계치를 포함하고, 상기 분석 이미지는 상기 분석 데이터를 시각화한 이미지이고, 상기 심볼 디자인은 상기 작품이미지 및/또는 상기 텍스트를 조합한 것이다."}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기 본 발명에 의하면, 커스터마이징 디자인을 제작하는데 있어서 단순히 이름, 이니셜 등을 삽입하는 것에 그 치지 않고 개인의 고유한 예술적 특성, 감정 등의 심리상태를 시각화할 수 있다. 또한, 상기 본 발명에 의하면, 사용자 개인의 개성 및 정체성이 반영된 디자인을 상품에 적용한 상품 디자인을 컴퓨터가 자동으로 또는 사용자에 의해 수동으로 편리하게 생성할 수 있다."}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 도 1은 본 발명의 일 실시예에 따른 심리상태를 시각화하여 상품에 적용하는 시스템의 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 심리상태를 시각화하여 상품에 적용하는 시스템은 입력부 , 심볼 디자인 생성부, 상품 디자인 생성부 및 분석부를 포함한다. 시스템은 서버의 형태로 구축될 수 있고, 입력부, 심볼 디자인 생성부, 상품 디자인 생성부 및 분석부 전체가 하나의 서버로 운영되거나 각각 또는 일부가 별도의 서버로 운영될 수 있다. 입력부는 외부로부터 데이터를 입력받는 역할을 한다. 외부로부터 입력받는 데이터는 사용자로부터 입력받 는 데이터와 시스템의 관리자로부터 입력받는 데이터가 있다. 사용자로부터 입력받는 데이터는 하나 이상의 비주얼 저널(Visual journal)을 포함한다. \"비주얼 저널(Visual journal)\"은 특정 주제나 전문분야를 다루는 신문이나 잡지, 학술지, 일기(Diary) 등의 저널로서 시각화된 이미 지를 포함하는 형태의 기록물이다. 비주얼 저널은 필요에 따라 다양한 입력 항목을 포함할 수 있다. 사용자는 지속적으로 하나 이상의 비주얼 저널을 입력한다. 사용자로부터 입력받는 비주얼 저널은 해당 사용자의 예술적 특징, 감정 등의 심리상태에 대한 정보를 포함하는 기록물이다. 사용자는 제공되는 비주얼 저 널 양식에 포함된 입력 항목을 작성함에 따라 감상한 콘텐츠에 대해 느낀 감정 및 본인의 예술적 특징 등의 심 리상태에 대하여 텍스트와 이미지를 활용하여 표현할 수 있다. 일 실시예로, 비주얼 저널은 작품이미지, 텍스트 및 감정 카테고리를 포함한다. 이 때, \"작품이미지\"는 사 용자가 직접 작업한 작품 또는 사용자가 감상한 작품의 이미지이다. \"텍스트\"는 키워드, 구절, 에세이 등 문자 로 구성된 항목을 포함한다. \"감정 카테고리\"는 복수의 카테고리(예를 들어, 희노애락애오욕(기쁨, 노여움, 슬 픔, 즐거움, 사랑, 미움, 욕심)을 포함)를 포함하며, 사용자는 비주얼 저널을 입력할 때마다 하나 또는 복 수의 감정 카테고리를 선택할 수 있다. 구체적인 예로, 비주얼 저널은 1) 사용자가 감상한 콘텐츠의 명칭, 2) 작성 일자, 3) 사용자 성명, 4) 사용자가 콘텐츠로부터 인상 깊었던 또는 영감을 얻은 텍스트 구절이나 키워드, 5) 키워드 입력 항목을 형상화하고 사용 자의 예술적 특성 또는 감정 등의 심리상태를 시각적으로 표현하는 작품이미지(선, 도형, 색상을 포함) 6) 상기 이미지와 관련하여 사용자가 느끼는 현재 감정 카테고리(복수 선택 가능), 7) 상기 이미지와 관련하여 사용자가느끼는 감정과 생각(에세이)을 입력 항목으로 포함하는 그림일기 형태의 양식으로 사용자에게 제공될 수 있다. 한편, 비주얼 저널의 입력 방식은 온라인 방식 및 오프라인 방식이 가능하다. 온라인 방식의 경우, 사용자는 온 라인 상에 표시된 입력창에서 제공된 입력 항목들을 순서대로 입력한다. 오프라인 방식의 경우, 사용자는 정해 진 양식에 따라 오프라인에서 작성한 비주얼 저널을 스캔 또는 촬영하여 켑쳐된 이미지 형태로 업로드한다. 이 경우, 시스템은 광학 문자 인식(Optical character recognition; OCR)을 이용하여 사용자가 업로드한 이미 지에 포함된 텍스트를 인식하고 입력 항목별로 데이터를 저장 및 관리할 수 있다. 일 실시예로, 사용자가 일반인이 아닌 전문작가인 경우, 일반 사용자와 구별되는 전문작가로 등록하거나 시스템 의 관리자 측과 파트너십을 맺을 수 있다. \"전문작가\"는 예술계에 종사하는 전문가로서 일반인들의 작품 활 동에 도움주는 역할을 수행할 수 있는 사람이다. 한편, 시스템은 전문작가가 등록한 정보에 대한 검증 절차 를 추가적으로 진행할 수 있다. 즉, 전문작가가 등록한 경력, 포트폴리오 등이 도용되거나 허위인지 여부를 검 증하는 절차 및 등록된 정보를 업데이트하는 절차를 추가적으로 진행할 수 있다. 구체적인 예로, 전문작가는 자신의 경력, 포트폴리오 등을 등록할 수 있으며, 비전문가인 사용자의 작품활동을 돕는 활동을 수행할 수 있다. 이 때, 수행한 활동에 따라 시스템의 관리자나 도움받은 사용자로부터 이익을 창출하는 구조도 가능하다. 즉, 시스템은 전문작가와 일반인인 사용자를 연결(매칭)해주고, 연결되어 수행 된 활동에 따라 시스템 자체에서 전문작가에게 대가를 지불하거나, 일반인인 사용자가 해당 전문작가에게 직접 대가를 지불할 수 있는 수단을 제공할 수 있다. 한편, 전문작가와 사용자는 시스템에서 정해진 알고리 즘에 따라 자동으로 연결 및 추천해줄 수 있으며, 사용자가 직접 전문작가가 등록해놓은 경력, 포트폴리오 등을 참조하여 선택 및 요청하는 것도 가능하다. 시스템의 관리자로부터 입력받는 데이터는 유명 작가의 데이터베이스를 포함할 수 있다. \"유명 작가\"는 파 블로 피카소, 빈센트 반 고흐, 클로드 모네, 폴 고갱 등과 같이 대중에게 널리 알려져있는 주지저명한 작가들이 다. 유명 작가 리스트는 관리자가 임의로 또는 사용자의 요청에 따라 업데이트될 수 있다. 유명 작가의 데이터 베이스는 유명 작가의 작품에 대한 특징정보로서 화풍, 색상, 벡터 값 등에 대한 정보를 포함한다. 이와 같이 사전 저장된 유명 작가의 데이터베이스는 사용자의 작품에 대한 분석 데이터와 함께 사용자의 작품을 더 발전시 키기 위한 서비스 제공에 활용된다. 제공되는 서비스로는 어드바이스 제공, 필터 효과 제공, 전문작가 매칭 서 비스가 있으며, 각각에 대한 상세한 설명은 도 7 내지 도 9를 참조하여 후술한다. 심볼 디자인 생성부는 사용자로부터 입력받은 비주얼 저널를 기반으로 심볼 디자인을 생성하는 역할을 한다. “심볼 디자인\"은 사용자 개인의 개성 및 정체성이 반영된 디자인으로서, 상기 비주얼 저널에 포함된 작품 이미지 및/또는 텍스트를 조합하여 생성되는 디자인이다. 심볼 디자인이 생성되는 과정 및 예시에 대한 상 세한 내용은 후술한다. 상품 디자인 생성부는 심볼 디자인을 상품에 적용하여 상품 디자인을 생성하는 역할을 한다. \"상품 디자인\"은 대상 상품에 심볼 디자인을 적용하여 생성된 커스터마이징(Customizing) 디자인이다. 대상 상품은 의류, 악세서리, 신발 등의 심볼 디자인을 적용할 수 있는 임의의 상품이다. 상품 디자인 은 시스템에서 자동으로 생성되거나 사용자가 수동으로 직접 생성할 수 있으며, 상품 디자인이 생성되 는 과정에 대한 상세한 설명은 후술한다. 분석부는 사용자로부터 입력받은 비주얼 저널에 포함된 데이터를 분석하여 분석 데이터를 생성하고, 상기 분석 데이터를 기반으로 분석 이미지를 생성하는 역할을 한다. 일 실시예로, 분석 데이터는 비주얼 저널에 포함된 작품이미지에 대한 특징정보를 포함한다. \"특징정보\"는 작품이미지에 사용된 화풍, 색상, 벡터값에 대한 정보이다. 이 때, 벡터값은 작품에 포함된 선에 대한 값(예를 들어, 선의 방향, 각도 등)이다. 분석된 작품이미지의 특징정보는 유사한 화풍 스타일의 유명작가 또는 전문작가를 찾는데 이용되며, 사용자에게 작품을 발전시킬 수 있는 어드바이스를 제공하거나 전문작가를 매칭시켜주는 서비스에 활용될 수 있다. 또한, 분석된 작품이미지의 특징정보는 유사한 화풍 또는 색상을 사용하는 다른 사용자의 작품을 찾는데 이용되며, 사 용자에게 유사한 스타일의 다른 사용자의 작품을 선별하여 제공하는 서비스에 활용될 수 있다. 이에 대한 상세 한 설명은 후술한다. 다른 실시예로, 분석 데이터는 비주얼 저널에 포함된 색상, 텍스트 및 감정 카테고리의 통계치를 포함한다. 통계치를 통해 사용자가 사용한 색상, 텍스트와 사용자가 선택한 감정 카테고리의 빈도수를 파악할 수 있다. 분석부는 사용자가 통계치에 대한 정보를 직관적으로 파악할 수 있도록 분석 이미지를 생성한다. \"분 석 이미지\"는 분석 데이터를 시각화하여 표시하는 이미지이다. 구체적인 예로, 분석 이미지는 자주 사 용하거나 선택하는 색상, 단어, 감정 카테고리의 점유율을 파악할 수 있는 이미지(예를 들어, 그래프, 히트맵, 워드 클라우드 등) 또는 사용자의 감정 변화를 시계열적으로 표시하는 이미지(예를 들어, 곡선 그래프, 바이오 리듬 등)일 수 있으며, 상술한 예시로 한정되지 않는다. 도 2는 본 발명의 일 실시예에 따른 심리상태를 시각화하여 상품에 적용하는 방법을 개략적으로 나타내는 흐름 도이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 심리상태를 시각화하여 상품에 적용하는 방법은, 사용자로부터 비주얼 저널을 입력받는 단계(S100), 비주얼 저널을 기반으로 분석 데이터 및 분석 이미지를 생성하는 단계 (S200), 비주얼 저널을 기반으로 심볼 디자인을 생성하는 단계(S300) 및 심볼 디자인을 상품에 적용하여 상품 디자인을 생성하는 단계(S400)를 포함한다. S100 단계는 사용자로부터 비주얼 저널을 입력받는 단계이다. 전술한 바와 같이 사용자는 제공된 비주얼 저널 양식에 따라 온라인에서 입력 항목을 작성하거나 오프라인에서 작성하고 스캔 또는 촬영하여 이미지 형태로 업로드할 수 있다. S200 단계는 비주얼 저널에 포함된 데이터를 분석하여 분석 데이터를 생성하고, 이를 시각화하여 분석 이미지 를 생성하는 단계이다. 분석 데이터는 사용자가 비주얼 저널을 업로드할 때마다 지속적으로 축적되며, 사용자는 분석 데이터를 통해 자신의 예술적 특징, 감정 등의 심리상태를 지속적으로 관리하고 발전시킬 수 있 다. 분석 이미지는 사용자가 상기 분석 데이터를 직관적으로 파악할 수 있도록 한다. 일 실시예로, 분석 데이터는 사용자의 특정 기간동안의 감정 변화를 포함할 수 있다. 예를 들어, 사용자는 특정 기간으로서 2개월을 선택하고, 2개월 동안 사용자의 감정 카테고리별 선택 빈도수에 대한 분석 데이터를 시각화 한 분석 이미지로서 2개월 동안 사용자의 감정 변화를 시계열적으로 나타내는 곡선 그래프 또는 감정 카테 고리의 빈도수 점유율을 나타내는 원 그래프 형태로 제공받을 수 있다. S300 단계는 사용자로부터 입력받은 비주얼 저널에 포함된 작품이미지 및/또는 텍스트를 조합하여 심볼 디자인 을 생성하는 단계이다. S300 단계에서 심볼 디자인은 자동, 반자동 또는 수동으로 생성될 수 있다. 이하, 각각의 경우에 대해 설명 한다. 심볼 디자인이 자동으로 생성되는 경우, 시스템이 입력받은 비주얼 저널에 포함된 데이터를 기반으 로 하여 자동으로 심볼 디자인을 생성하여 사용자에게 제공한다. 시스템은 비주얼 저널에 포함된 작품이미지 및/또는 텍스트를 조합하여 복수의 디자인을 생성한다. 시스템은 작품이미지의 전부 또는 일부 와 텍스트를 조합할 수 있다. 시스템은 작품이미지의 특징정보(예를 들어, 화풍, 색상, 벡터값 등)와 어울 리는 키워드를 조합하기 위해 인공지능, 머신러닝, 딥러닝 등의 기술을 적용될 수 있다. 일 실시예로, 시스템이 심볼 디자인을 자동으로 생성하는 과정을 사용자에게 표시할 수 있다. 시스템 은 사용자가 입력했던 비주얼 저널에 포함된 작품이미지, 텍스트, 감정 카테고리 등을 팔레트 형식으로 제공하고, 그 중 일부를 선별하여 조합하는 과정을 사용자에게 표시할 수 있다. 시스템이 자동으로 생성하여 제공하는 심볼 디자인은 하나 또는 복수일 수 있으며 그 개수에 제한이 없 다. 따라서, 사용자는 시스템이 자동 생성하여 제공하는 복수의 심볼 디자인 중 하나 이상을 선택하는 것이 가능하다. 또한, 사용자가 제공된 심볼 디자인에 만족하지 않는 경우, 시스템이 다시 새로운 심볼 디자인을 생성하도록 하는 것도 가능하며, 사용자는 만족하는 디자인이 생성될 때까지 반복할 수 있다. 심볼 디자인이 반자동으로 생성되는 경우, 사용자는 시스템의 도움을 받으며 직접 심볼 디자인을 생성하거나, 시스템이 사용자로부터 심볼 디자인을 생성하는데 이용할 수 있는 추가적인 정보를 입력받 거나 사용자의 수정 요청 사항을 반영하며 심볼 디자인을 생성할 수 있다. 일 실시예로, 시스템은 사용자로부터 특정 사항에 대해 조건을 입력받고 조건에 만족하는 심볼 디자인 을 생성할 수 있다. 사용자는 텍스트 단독, 이미지 단독, 또는 텍스트와 이미지의 조합, 색상의 개수, 또는 색 상 값 등과 관련한 조건을 입력할 수 있다. 구체적인 예로, 사용자는 심볼 디자인에 텍스트없이 이미지만 삽입되도록 설정하고, 이미지에 포함되는 색상의 개수를 2가지로 제한하고, 메인 색상을 빨간색, 보조 색상을 파란색으로 설정할 수 있다. 시스템은 해당 조건을 만족하는 형태의 심볼 디자인만 생성하여 제공하게 된다. 또 다른 실시예로, 사용자가 심볼 디자인의 일부분만 직접 제작하고 추가적인 구성에 대해 시스템이 자 동으로 생성할 수 있도록 요청할 수 있다. 구체적인 예로, 사용자가 심볼 디자인에 포함될 텍스트 부분만을 수동으로 제작한 뒤에 시스템이 이미지를 자동으로 추가하여 해당 텍스트 부분을 포함하는 심볼 디자인(3 0)을 생성할 수 있다. 또 다른 실시예로, 시스템은 사용자로부터 추가 정보를 입력받기 위해 사전 저장된 질문을 제공하여 답변을 입력받을 수 있다. 구체적인 예로, 시스템은 사용자에게 \"xx님이 인생에서 가장 소중하게 생각하는 가치는 무엇인가요? (키워드 및 이미지를 포함하여 5개 이내로 작성해주세요.)\"라는 질문을 제공할 수 있다. 사용자는 해당 질문에 대해 키워드 및 이미지로 답변을 입력한다. 시스템은 사용자가 입력한 답변을 기반으로 입력된 키워드 및 이미지가 반영된 심볼 디자인을 생성한다. 이를 통해 사용자는 제공된 질문에 대답하기 위해 스 스로 고민하고 생각하게 되어 사용자의 개성 및 정체성이 보다 정확히 반영된 디자인을 생성할 수 있게 된다. 심볼 디자인이 수동으로 생성되는 경우, 사용자는 자유롭게 심볼 디자인을 직접 제작할 수 있다. 이 경 우, 일반적인 입력수단인 마우스, 키보드를 포함하여 터치 패드(Touch pad), 터치 스크린(Touch screen), 펜 태 블릿(Pen tablet) 등 임의의 입력수단을 이용할 수 있다. 한편, 사용자는 수동으로 작업 도중에 수동 작업을 멈 추고 제작된 부분을 포함하는 심볼 디자인이 자동으로 생성되도록(반자동으로 생성되는 경우) 하는 것도 가 능하다. S400 단계는 생성된 심볼 디자인을 상품에 적용하여 상품 디자인을 생성하는 단계이다. S400 단계는 2D 또는 3D 형태로 상품 이미지를 제공하는 단계와 상기 상품 이미지 내에 상기 심볼 디자인의 배치를 결정하 는 단계를 포함한다. “상품 이미지”는 심볼 디자인이 적용되기 전 상품 본연의 이미지이다. 시스템은 상품 카테고리별로 상품 이미지를 저장 및 관리한다. 시스템은 대상 상품의 상품 이미지 를 2D 또는 3D 형태로 제공한다. 시스템은 제공된 상품 이미지 내에서 심볼 디자인이 배치된 상품 디자인을 생성한다. 일 실시예로, 상품 이미지 내에서 심볼 디자인의 배치는 시스템에 의해 자동으로 결정될 수 있다. 시스템은 인공지능, 머신러닝, 딥러닝 등의 기술을 이용하여 사용자들이 자주 삽입하는 위치 및 형태를 학 습하여 심볼 디자인의 배치를 결정할 수 있다. 구체적인 예로, 대상상품이 티셔츠인 경우, 티셔츠의 앞면의 정중앙에 이미지를 삽입한 상품 디자인이 사용자들에 의해 다수 생성될 수 있다. 시스템은 이를 참조하여 상품 디자인을 자동으로 생성하여, 임의의 위치에 심볼 디자인이 배치되는 것보다 사용자가 만족할 가능성 이 높은 상품 디자인을 생성할 수 있게 된다. 다른 실시예로, 상품 이미지 내에서 심볼 디자인의 배치는 사용자로부터 입력받은 정보에 따라 결정될 수 있다. 즉, 사용자가 직접 심볼 디자인을 삽입할 위치 및 형태를 결정할 수 있다. 사용자는 제공된 상품 이미지 내에서 자유롭게 심볼 디자인 이미지를 이동 및 배치하며 상품 디자인을 생성하게 된다. 한편, 도 2에는 도시되어 있지 않지만, 일 실시예로, 시스템이 생성된 상품 디자인이 반영된 제품을 상 품화하여 판매할 수 있는 판매 시스템의 역할을 수행할 수 있다. 구체적인 예로, 사용자는 시스템의 관리자와 계약하여, 시스템을 통해 생성된 심볼 디자인을 상품 에 적용하여 판매할 수 있는 권한을 획득할 수 있다. 또한, 시스템은 판매자가 상품화 완료된 상품들을 게 시할 수 있고, 구매자가 게시된 상품들을 살펴보고 구매 요청 및 결제를 진행할 수 있도록 하는 서비스를 제공 할 수 있다. 이를 통해, 각각의 사용자가 본인의 심볼 디자인이 적용된 상품 디자인을 생성하는데 그치 지 않고, 해당 상품 디자인이 적용된 상품을 실제로 상품화하여 판매할 수 있는 기회까지 가질 수 있게 되 므로 작품 활동의 동기부여가 된다. 도 3은 본 발명의 일 실시예에 따른 비주얼 저널의 예시도이다. 시스템은 비주얼 저널의 예로 그림일기 형태의 양식을 사용자에게 제공하고, 사용자는 그림일기 형태로 제공되는 양식에 포함된 입력 항목을 순서대로 작성할 수 있다. 도 3의 일 실시예를 참조하면, 그림일기는 제목, 날짜, 이름, 키워드, 작품, 감정 카테고리 및 에세이 입력 항 목을 포함할 수 있다. 한편, 시스템은 각 항목을 필수 기재 항목 및 선택 기재 항목으로 구분하여 제공할 수 있다. 이와 같이 사용자는 정해진 항목들에 맞는 정보를 입력하는 과정을 통해 자신의 예술적 특징, 감정 등의 심리상 태에 대해 자연스럽게 표현하고 관련 정보를 입력하게 된다. 따라서, 사용자는 심리상태를 어떻게 표현할지 고 민하지 않고 자신의 심리상태에 대해 입력할 수 있다. 사용자는 누적하여 그림일기 형태의 심리상태 데이터를 입력함으로써, 자신의 감정을 지속적으로 모니터링하고, 개인의 정체성 및 자아가 투사된 본인만의 고유한 예술 스타일을 찾아갈 수 있다. 또한, 미술치료와 같이 예술 활동을 통해 창의력, 유연한 사고, 자아탄력성, 자존감, 인성, 안정감, 스트레스 대처 능력 등을 개발할 수 있 다. 도 4는 본 발명의 일 실시예에 따른 심볼 디자인의 예시도이다. 도 4에는, 사용자가 비주얼 저널에 입력한 작품 이미지의 일부와 키워드 중 하나인 '비겁함'을 조합한 심볼 디자인이 도시되어 있다. 이와 같이 작품이미지는 일부 또는 전부가 이용될 수 있으며, 텍스트로서 삽입된 키워드의 글씨체, 크기 및 형태는 다양하게 적용될 수 있다. 또한, 도 4에는 편의상 이미지와 키워드가 조합된 형태의 심볼 디자인만 도시하였으나, 텍스트는 키워드로 한정되지 않고 문장, 문단일 수 있으며, 텍스트 단독 또는 이미지 단독으로 생성되는 것도 가능하다. 심볼 디자 인이 생성되는 방법 및 과정에 대한 내용은 전술한 것과 중복되므로 생략한다. 도 5는 본 발명의 일 실시예에 따른 상품 이미지 및 상품 디자인의 예시도이다. 도 5에 도시된 바와 같이, 대상 상품이 티셔츠인 경우, 심볼 디자인이 적용되기 전 상품 본연의 이미지인 티셔츠 형태의 상품 이미지가 제공된다. 상품 이미지 내에서 티셔츠 앞면의 중앙에 심볼 디자인을 배치하기로 결정되었다면 해당 내용이 적용된 상품 디자인이 생성된다. 전술한 바와 같이, 상품 디자인은 시스템에 의해 자동으로 생성되거나 사용자에 의해 수동으로 생성될 수 있으며, 상세한 내용은 중복되므로 생략한다. 도 6은 본 발명의 일 실시예에 따른 분석 이미지의 예시도이다. 도 6을 참조하면, 시스템은 사용자가 2개월동안 선택한 감정 카테고리를 기반으로 원형 차트 형태의 분석 이미지를 생성하여 제공할 수 있다. 사용자는 본인이 2개월 동안 가장 많이 선택한 감정 카테고리를 한 눈에 확인할 수 있으며, 설정 기간을 달리하 며 단기간, 장기간에 따른 감정 변화를 파악할 수 있다. 도 7은 본 발명의 일 실시예에 따른 유사도 높은 작품을 추출하고 어드바이스를 제공하는 단계를 더 포함하는 심리상태를 시각화하여 상품에 적용하는 방법을 개략적으로 나타내는 흐름도이다. 도 2와 비교하여 더 추가된 단계를 중심으로 설명한다. 도 7을 참조하면, 본 발명의 일 실시예에 따른 심리상태를 시각화하여 상품에 적용하는 방법은 분석 데이터 및 사전 저장된 데이터베이스를 기반으로 사용자의 작품과 유사도가 높은 작품을 추출하는 단계(S210) 및 추출된 작품을 기반으로 사용자에게 어드바이스를 제공하는 단계(S220)를 더 포함한다. S210 단계는 시스템이 사용자의 작품에 대한 특징정보를 분석한 데이터를 바탕으로 사전 저장된 데이터베이 스에 포함된 전문작가, 유명작가 및 다른 사용자들의 작품에 대한 특징정보와 유사도를 측정하고, 유사도가 높 은 작품을 추출하는 단계이다. 사전 저장된 데이터베이스는 유명 작가의 데이터베이스를 포함한다. 전술한 바와 같이, 유명 작가는 파블로 피 카소, 빈센트 반 고흐, 클로드 모네, 폴 고갱 등과 같이 대중에게 널리 알려져있는 주지저명한 작가들이다. 유 명 작가 리스트는 관리자가 임의로 또는 사용자의 요청에 따라 업데이트할 수 있다. 유명 작가의 데이터베이스 는 유명 작가의 작품에 대한 특징정보로서 화풍, 색상, 벡터값에 대한 정보 중 하나 이상을 포함한다. 일 실시예로, 유사도에 사용되는 작품에 대한 특징정보는 해당 작품에 이용된 화풍, 색상, 벡터값 중 하나 이상 일 수 있다. 시스템은 상기 특징정보를 수치화하고 비교 및 분석하여 % 단위의 유사도를 제공할 수 있다. 유사도 측정을 위해 특징 정보를 수치화하고, 항목당 가중치를 부여하거나, 연산하는 과정에 대해서는 제한이 없다. 시스템은 측정된 유사도가 설정된 유사도보다 높은 작품들을 선별하여 사용자에게 제공한다. 설정된 유사도 는 추천되는 작품의 수를 조정하기 위해 시스템의 관리자가 설정하거나, 사용자가 직접 원하는대로 설정할 수 있다. S220 단계는 사용자의 작업 스타일 발전을 도와주는 서비스로서, 추출된 작품의 특징정보를 바탕으로 사용자에 게 작품 활동을 발전시킬 수 있는 어드바이스를 제공하는 단계이다. 구체적인 예로, 사용자가 입력한 작품이 유명작가 A의 작품과 유사도가 높은 경우(측정된 유사도가 설정된 유사 도보다 높은 경우), 시스템은 사용자에게 \"이후의 작업은 유화를 활용하여 A 작가의 화풍으로 작업해보시는 건 어떨까요?\"라는 메시지를 제공할 수 있다. 이를 통해 사용자는 본인의 작품과 유사한 유명작가를 확인하고, 해당 유명작가의 작품에 사용된 화풍으로 작업해보며 더욱 발전된 작품 활동을 할 수 있게 된다. 다른 실시예로, 시스템은 필터 서비스를 제공할 수 있다. \"필터\"는 사용자의 작품이미지에 특정한 효과를 적용하는 수단이다. 사용자는 작품이미지를 원본 그대로 업로드하거나, 필터를 통해 특정한 효과를 적용하여 업 로드할 수 있다. 구체적인 예로, 사용자의 작품이미지의 특징정보를 분석한 결과, 유명작가 중 하나인 빈센트 반 고흐의 작품의 화풍과 유사도가 높다면, 시스템은 사용자에게 빈센트 반 고흐의 화풍으로 작업한 것과 같은 효과를 주는 필터를 제공한다. 이를 통해 사용자는 해당 필터를 자신의 작품이미지에 적용해보며, 작품이미지에 효과를 주는 재미를 느끼고, 이후의 작업 스타일을 발전시키는데 활용할 수 있다. 즉, 사용자는 자신의 스타일과 유사한 유명 작가가 누가 있는지 확인하고, 해당 유명 작가의 스타일을 흉내내거나 모방함으로서 자신의 작품을 발전킬 수 있고, 보다 다 채로운 작품 활동이 가능하게 된다. 도 8은 본 발명의 일 실시예에 따른 다른 사용자들의 작품 중 유사도가 높은 작품을 제공하는 단계를 더 포함하 는 심리상태를 시각화하여 상품에 적용하는 방법을 개략적으로 나타내는 흐름도이다. 도 8을 참조하면, 도 2와 비교하여, 다른 사용자들의 작품 중 유사도가 높은 작품을 제공하는 단계(S230)를 더 포함한다. S230 단계는 사용자의 작업 스타일 발전 및 다른 사용자들과의 교류를 도와주는 서비스로서, 사용자의 작품이미 지의 특징정보를 분석하여 다른 사용자들의 작품들 중 유사도가 높은 작품을 선별하여 사용자에게 제공하는 단 계이다. 사용자는 제공되는 유사한 스타일의 다른 사용자들의 작품을 보며, 본인의 작업 스타일을 객관적으로 인지하고 이후의 작업 스타일을 발전시킬 수 있다. 또한, 유사한 스타일의 사용자들과 교류할 수 있는 기회를 얻을 수 있 다. 도 9는 본 발명의 일 실시예에 따른 서버에 등록된 전문작가와 매칭하는 단계를 더 포함하는 심리상태를 시각화 하여 상품에 적용하는 방법을 개략적으로 나타내는 흐름도이다. 도 9를 참조하면, 도 2와 비교하여, 서버에 등록된 전문작가와 매칭하는 단계(S240)를 더 포함한다. S240 단계는 사용자의 작업 스타일 발전을 도와주는 서비스로서, 시스템에 전문작가로 사전 등록되어 있거 나 파트너십을 맺은 전문작가들과 사용자를 연결(매칭)해주는 단계이다. 일 실시예로, 사용자는 시스템에서 자동으로 제공되는 어드바이스뿐만 아니라, 매칭된 전문작가가 직접 작성한 어드바이스를 제공받을 수 있다. 더 나아가서 전문작가에게 수업료를 지불하고 트레이닝을 받는 것도 가능하다. 이를 통해, 사용자는 스스로 발전시키기 어려운 부분에 있어서 전문작가에게 도움을 받는 것이 가능하고, 전문 작가는 해당 사용자의 정보를 공유받음으로써 사용자에 대한 정확한 판단을 하는 것이 가능하여, 보다 효율적인 트레이닝이 가능하게 된다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM),EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2019-0113242", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2019-0113242", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 심리상태를 시각화하여 상품에 적용하는 시스템의 구성도이다. 도 2는 본 발명의 일 실시예에 따른 심리상태를 시각화하여 상품에 적용하는 방법을 개략적으로 나타내는 흐름 도이다. 도 3은 본 발명의 일 실시예에 따른 비주얼 저널의 예시도이다. 도 4는 본 발명의 일 실시예에 따른 심볼 디자인의 예시도이다. 도 5는 본 발명의 일 실시예에 따른 상품 이미지 및 상품 디자인의 예시도이다. 도 6은 본 발명의 일 실시예에 따른 분석 이미지의 예시도이다. 도 7은 본 발명의 일 실시예에 따른 유사도 높은 작품을 추출하고 어드바이스를 제공하는 단계를 더 포함하는 심리상태를 시각화하여 상품에 적용하는 방법을 개략적으로 나타내는 흐름도이다. 도 8은 본 발명의 일 실시예에 따른 다른 사용자들의 작품 중 유사도가 높은 작품을 제공하는 단계를 더 포함하는 심리상태를 시각화하여 상품에 적용하는 방법을 개략적으로 나타내는 흐름도이다. 도 9는 본 발명의 일 실시예에 따른 서버에 등록된 전문작가와 매칭하는 단계를 더 포함하는 심리상태를 시각화 하여 상품에 적용하는 방법을 개략적으로 나타내는 흐름도이다."}
