{"patent_id": "10-2023-0117841", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0015629", "출원번호": "10-2023-0117841", "발명의 명칭": "전자 장치 및 전자 장치에서 브로드캐스트 데이터를 전송하는 방법", "출원인": "삼성전자주식회사", "발명자": "정구필"}}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 전자 장치(도 1의 101; 도 3의 300)에 있어서,통신 회로(도 1의 190); 및상기 통신 회로(도 1의 190)에 작동적으로 연결된 적어도 하나의 프로세서(도 1의 120)를 포함하고, 상기 적어도 하나의 프로세서(도 1의 120)는,적어도 하나의 BIS(broadcast isochronous stream) 소스 장치로부터 복수의 BIS 싱크 장치들로 BIS 데이터가스트리밍되도록 적어도 하나설정된 BIG(broadcast isochronous group)에 대한 요청을 확인하고,상기 BIG에 대한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들를 포함하는 BIG 정보를 생성하고,제2 전자 장치가 상기 BIG에 대한 상기 복수의 파라미터들을 적용할 수 있도록, 상기 BIG에 대한 상기 복수의파라미터들을 포함하는 상기 BIG 정보를 전송하도록 제어하는, 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 BIG에 대한 상기 요청은,상기 제1 전자 장치에서의 사용자 입력, 상기 제1 전자 장치에서의 어플리케이션 실행, 외부 전자 장치로부터수신한 요청, 상기 제1 전자 장치의 위치 정보, 및 상기 제1 전자 장치의 네트워크 연결 정보 중에서 적어도 하나에 기반하여 확인되는, 제1 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 내지 제2항 중 어느 하나에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들은,상기 BIS 데이터에 대한 전송 시간 정보, 상기 BIS 데이터에 대한 전송 파워(Tx power), 상기 PA에 대한 전송시간 정보, 및 상기 PA에 대한 전송 파워 중 적어도 일부를 포함하는, 제1 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들은,상기 BIS 데이터에 대한 암호화(encryption) 여부에 대한 정보, 피지컬 링크 타입(physical link type), 액세스 주소(access address), 채널 맵(channel map), 및 프레이밍 모드(framing mode) 중 적어도 일부를 더 포함하는, 제1 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 하나에 있어서, 상기 적어도 하나의 프로세서(도 1의 120)는,상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 BIG 정보를 상기 복수의 BIS 소스 장치들 중에서 적어도하나로 전송하도록 제어하는, 제1 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 상기 BIG 정보는,BLE 어드벌타이징(advertising), PA 송수신, 또는 외부 네트워크를 통해 전송되는, 제1 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2025-0015629-3-제1항 내지 제6항 중 어느 하나에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 상기 BIG 정보는,상기 복수의 BIS 소스 장치들 중에서 제1 소스 장치에 대한 복수의 파라미터들을 포함하는 제1 BIG 정보; 및상기 복수의 BIS 소스 장치들 중에서 제2 소스 장치에 대한 복수의 파라미터들을 포함하는 제2 BIG 정보를 포함하는, 제1 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제1 BIG 정보에 기반하여 상기 제1 소스 장치의 PA 전송 여부, 상기 제1 소스 장치의 전송 파워, 상기 제1소스 장치가 전송하는 BIS 데이터에 대한 제1 NSE(number of subevent), 제1 IRC(immediate repetitioncount), 및 제1 PTO(pre-transmission offset) 중 적어도 하나가 설정되고,상기 제2 BIG 정보에 기반하여 상기 제2 소스 장치의 PA 전송 여부, 상기 제2 소스 장치의 전송 파워, 상기 제2소스 장치가 전송하는 BIS 데이터에 대한 제2 NSE, 제2 IRC, 및 제2 PTO 중 적어도 하나가 설정되는, 제1 전자장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2 전자 장치(도 1의 101; 도 3의 300)에 있어서,통신 회로(도 1의 190); 및상기 통신 회로(도 1의 190)에 연결된 적어도 하나의 프로세서(도 1의 120)를 포함하고, 상기 적어도 하나의 프로세서(도 1의 120)는,적어도 하나의 BIS(broadcast isochronous stream) 소스 장치로부터 복수의 BIS 싱크 장치들로 BIS 데이터가스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 복수의 파라미터들을 포함하는 BIG 정보를 제1 전자 장치로부터 수신하고,상기 BIG에 대한 상기 복수의 파라미터들에 기반하여 상기 BIG를 생성하고,상기 BIG에 대한 상기 복수의 파라미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터 중에서 적어도일부를 전송하도록 제어하는, 제2 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 적어도 하나의 프로세서(도 1의 120)는,상기 제2 전자 장치 내에서 제1 SDU(service data unit)를 수신하고, 상기 제1 SDU에 상응하는 제1 PDU를 상기BIS 데이터로써 외부로 전송하도록 제어하고,상기 제2 전자 장치 내에서 제2 SDU를 수신하고, 상기 제2 SDU에 상응하는 제2 PDU를 상기 BIS 데이터로써 외부로 전송하도록 제어하는, 제2 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항 내지 제10항 중 어느 하나에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들은,상기 BIS 데이터에 대한 전송 시간 정보, 상기 BIS 데이터에 대한 전송 파워(Tx power), 상기 PA에 대한 전송시간 정보, 및 상기 PA에 대한 전송 파워 중 적어도 일부를 포함하는, 제2 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들은,상기 BIS 데이터에 대한 암호화(encryption) 여부에 대한 정보, 피지컬 링크 타입(physical link type), 액세스 주소(access address), 채널 맵(channel map), 및 프레이밍 모드(framing mode) 중 적어도 일부를 더 포함하는, 제2 전자 장치. 공개특허 10-2025-0015629-4-청구항 13 제9항 내지 제12항 중 어느 하나에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 상기 BIG 정보는,BLE 어드벌타이징(advertising), PA 송수신, 또는 외부 네트워크를 통해 수신되는, 제2 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항 내지 제13항 중 어느 하나에 있어서, 상기 BIG 정보에 기반하여 상기 전자 장치의 PA 전송 여부, 상기 전자 장치의 전송 파워, 상기 전자 장치가 전송하는 상기 BIS 데이터에 대한 제1 NSE(number of subevent), 제1 IRC(immediate repetition count), 및 제1PTO(pre-transmission offset) 중 적어도 하나가 설정되는, 제2 전자 장치."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1 전자 장치(도 1의 101; 도 3의 300)의 동작 방법에 있어서,적어도 하나의 BIS(broadcast isochronous stream) 소스 장치로부터 복수의 BIS 싱크 장치들로 BIS 데이터가스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인하는 동작;상기 BIG에 대한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 BIG 정보를 생성하는 동작; 및제2 전자 장치가 상기 BIG에 대한 상기 복수의 파라미터들을 적용할 수 있도록, 상기 BIG에 대한 상기 복수의파라미터들을 포함하는 상기 BIG 정보를 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 BIG에 대한 상기 요청은,상기 제1 전자 장치에서의 사용자 입력, 상기 제1 전자 장치에서의 어플리케이션 실행, 외부 전자 장치로부터수신한 요청, 상기 제1 전자 장치의 위치 정보, 및 상기 제1 전자 장치의 네트워크 연결 정보 중에서 적어도 하나에 기반하여 확인되는 방법."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항 내지 제16항 중 어느 하나에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들은,상기 BIS 데이터에 대한 전송 시간 정보, 상기 BIS 데이터에 대한 전송 파워(Tx power), 상기 PA에 대한 전송시간 정보, 및 상기 PA에 대한 전송 파워 중 적어도 일부를 포함하는 방법."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들은,상기 BIS 데이터에 대한 암호화(encryption) 여부에 대한 정보, 피지컬 링크 타입(physical link type), 액세스 주소(access address), 채널 맵(channel map), 및 프레이밍 모드(framing mode) 중 적어도 일부를 더 포함하는 방법."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제2 전자 장치(도 1의 101; 도 3의 300)의 동작 방법에 있어서,적어도 하나의 BIS(broadcast isochronous stream) 소스 장치들부터 복수의 BIS 싱크 장치들로 BIS 데이터가스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 복수의 파라미터들을 포함하는 BIG 정보를 제1 전자 장치로부터 수신하는 동작;상기 BIG에 대한 상기 복수의 파라미터들에 기반하여 상기 BIG를 생성하는 동작; 및상기 BIG에 대한 상기 복수의 파라미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터 중에서 적어도공개특허 10-2025-0015629-5-일부를 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2023-0117841", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 제2 전자 장치 내에서 제1 SDU(service data unit)를 수신하고, 상기 제1 SDU에 상응하는 제1 PDU를 상기BIS 데이터로써 외부로 전송하는 동작; 및상기 제2 전자 장치 내에서 제2 SDU를 수신하고, 상기 제2 SDU에 상응하는 제2 PDU를 상기 BIS 데이터로써 외부로 전송하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2023-0117841", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따르면, 전자 장치(도 1의 101; 도 3의 300)는 통신 회로(도 1의 190) 및 상기 통신 회로(도 1의 190)에 연결된 적어도 하나의 프로세서(도 1의 120)를 포함한다. 상기 적어도 하나의 프로세서(도 1의 120)는 적 어도 하나의 BIS(broadcast isochronous stream) 소스 장치로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트 리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인할 수 있다. 상기 적어도 하나의 프로 세서(도 1의 120)는 상기 BIG에 대한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들를 포함하는 BIG 정보를 생성할 수 있다. 상기 적어도 하나의 프로세서(도 1의 120)는 제2 전자 장치가 상기 BIG에 대한 상기 복수의 파라미터들을 적용할 수 있도록, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 상기 BIG 정보를 전송하도록 제어할 수 있다."}
{"patent_id": "10-2023-0117841", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 전자 장치 및 전자 장치에서 브로드캐스트 데이터를 전송하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0117841", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "Bluetooth Core Version 5.2 이상의 LE(low energy) 전자 장치들은 BIS(broadcast isochronous stream) 방식 또는 CIS(connected isochronous stream) 방식을 통해 LE 오디오 서비스를 지원할 수 있다. 일반적으로 LE 오디오를 이용한 BIS 서비스는 다수의 사용자와 통신할 수 있는 비디오/오디오 전자 장치에 주로 사용되며, 오랜 시간 불특정 다수를 위한 오디오/비디오 서비스 용도로 사용될 수 있다. 최근에는 TV 또는 모바 일 전자 장치에, 불특정 다수가 아닌 소수의 사용자 그룹에 동시에 오디오 서비스를 제공할 목적으로, BIS 서비 스의 사용이 점점 확대되고 있는 추세이다."}
{"patent_id": "10-2023-0117841", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른, 전자 장치는, 통신 회로 및 상기 통신 회로에 연결된 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는 상기 전자 장치를 포함하는 복수의 BIS(broadcast isochronous stream) 소스 장치들로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인할 수 있다. 상기 적어도 하나의 프로세서는 상기 BIG에 대한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여 상기 BIG를 생성할 수 있다. 상기 적어도 하나 의 프로세서는 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터 를 전송하도록 제어할 수 있다. 일 실시예에 따른, 전자 장치는, 통신 회로 및 상기 통신 회로에 연결된 적어도 하나의 프로세서를 포함할 수 있다. 상기 적어도 하나의 프로세서는 상기 전자 장치를 포함하는 복수의 BIS(broadcast isochronous stream) 소스 장치들로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인할 수 있다. 상기 적어도 하나의 프로세서는 상기 BIG에 대한 복수의 파라미터들을 포함하는 BIG 정보를 수신할 수 있다. 상기 적어도 하나의 프로세서는 상기 BIG에 대한 상기 복수의 파라미터들 에 기반하여 상기 BIG를 생성할 수 있다. 상기 적어도 하나의 프로세서는 상기 BIG에 대한 상기 복수의 파라미 터들에 기반하여, PA(periodic advertising) 및 BIS 데이터를 전송하도록 제어할 수 있다. 일 실시예에 따른, 전자 장치의 동작 방법은, 상기 전자 장치를 포함하는 복수의 BIS(broadcast isochronous stream) 소스 장치들로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인하는 동작을 포함할 수 있다. 전자 장치의 동작 방법은, 상기 BIG에 대 한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여 상기 BIG를 생성하는 동작을 포함할 수 있다. 전자 장치의 동작 방법은 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터를 전송하는 동작을 포함할 수 있다. 일 실시예에 따른, 전자 장치의 동작 방법은, 상기 전자 장치를 포함하는 복수의 BIS(broadcast isochronous stream) 소스 장치들로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcastisochronous group)에 대한 요청을 확인하는 동작을 포함할 수 있다. 전자 장치의 동작 방법은 상기 BIG에 대한 복수의 파라미터들을 포함하는 BIG 정보를 수신하는 동작을 포함할 수 있다. 전자 장치의 동작 방법은 상기 BIG 에 대한 상기 복수의 파라미터들에 기반하여 상기 BIG를 생성하는 동작을 포함할 수 있다. 전자 장치의 동작 방 법은 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터를 전송하 는 동작을 포함할 수 있다. 일 실시예에 따라서, 컴퓨터로 독출 가능한 적어도 하나의 인스트럭션을 저장한 저장 매체가 제공될 수 있다. 상기 적어도 하나의 인스트럭션은, 적어도 하나의 프로세서에 의하여 실행 시에, 전자 장치로 하여금, 복수 개 의 동작들을 수행하도록 야기할 수 있다. 상기 복수 개의 동작들은, 상기 전자 장치를 포함하는 복수의 BIS(broadcast isochronous stream) 소스 장치들로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도 록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인하는 동작을 포함할 수 있다. 상기 복수 개의 동작들은, 상기 BIG에 대한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하 여 상기 BIG를 생성하는 동작을 포함할 수 있다. 상기 복수 개의 동작들은, 상기 BIG에 대한 상기 복수의 파라 미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터를 전송하는 동작을 포함할 수 있다. 일 실시예에 따라서, 컴퓨터로 독출 가능한 적어도 하나의 인스트럭션을 저장한 저장 매체가 제공될 수 있다. 상기 적어도 하나의 인스트럭션은, 적어도 하나의 프로세서에 의하여 실행 시에, 전자 장치로 하여금, 복수 개 의 동작들을 수행하도록 야기할 수 있다. 상기 복수 개의 동작들은, 상기 전자 장치를 포함하는 복수의 BIS(broadcast isochronous stream) 소스 장치들로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도 록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인하는 동작을 포함할 수 있다. 상기 복수 개의 동작들은, 상기 BIG에 대한 복수의 파라미터들을 포함하는 BIG 정보를 수신하는 동작을 포함할 수 있다. 상기 복수 개의 동작들은, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여 상기 BIG를 생성하는 동작을 포함할 수 있다. 상기 복수 개의 동작들은, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터를 전송하는 동작을 포함할 수 있다."}
{"patent_id": "10-2023-0117841", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 개시의 일 실시예를 첨부된 도면을 참조하여 상세히 설명한다. 그리고, 본 개시의 일 실시예를 설명함 에 있어서, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 일 실시예의 요지를 불필요하게 흐 릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 그리고 후술되는 용어들은 본 개시의 일 실시예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 본 명세서에서 사용되는 기술적 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 개시의 일 실시 예를 한정하려는 의도가 아님을 유의해야 한다. 또는, 본 명세서에서 사용되는 기술적 용어는 본 명세서에서 특 별히 다른 의미로 정의되지 않는 한, 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으 로 이해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또는, 본 명세서에서 사용되는 기술적인 용어가 본 개시의 사상을 정확하게 표현하지 못하는 잘못 된 기술적 용어일 때에는, 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또는, 본 개시의 일 실시예에서 사용되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상 에 따라 해석되어야 하며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또는, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\"와 같은 용어는 명세서 상에 기재된 여러 구성 요소들, 또 는 여러 동작들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 동작 들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 동작들을 더 포함할 수 있는 것으로 해석되어야 한다. 또는, 본 명세서에서 사용되는 제1, 또는 제2와 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는 데 사용될 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구 성 요소를 다른 구성 요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 개시의 권리 범위를 벗어나지않으면서 제1 구성 요소는 제2 구성 요소로 명명될 수 있고, 유사하게 제2 구성 요소도 제1 구성 요소로 명명될 수 있다. 어떤 구성 요소가 다른 구성 요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성 요소 에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성 요소가 존재할 수도 있다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성 요소가 존재하지 않는 것으로 이해되어야 할 것이다. 이하, 첨부된 도면을 참조하여 본 개시에 따른 일 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또는, 본 개시 의 일 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또는, 첨부된 도면은 본 개시의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 개시의 사상이 제한되는 것으로 해석되어서는 아니 됨에 유의하여야만 한 다. 본 개시의 사상은 첨부된 도면들 외에 모든 변경들, 균등물들 내지 대체물들에 까지도 확장되는 것으로 해 석되어야 한다. 도 1은 일 실시예에 따른 네트워크 환경 내의 전자 장치를 개략적으로 도시한 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입 력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 일 실시예에 따르면, 전자 장치(10 1)에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가 될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비 휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deepneural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, 와이파이(Wi-Fi: wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인 터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치(10 4)와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크 와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 일 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗면 또 는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 일 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 개시의 일 실시예에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 가전 장치, 또는 무선 이어폰, 이어 버즈(ear buds)를 포함할 수 있다. 본 개시의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 일 실시예 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한정하려 는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응 하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당 하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사 용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구 성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 일 실시예에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 일 실시예는 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프로그램 )로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서)는, 저장 매 체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기 기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드 를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포 함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으 로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 일 실시예에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 일 실시예에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 일 실시예에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프 로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 일 실시예에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수 행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이 상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2는 일 실시예에 따른, 오디오 모듈의 블록도이다. 도 2를 참조하면, 오디오 모듈은, 예를 들면, 오디오 입력 인터페이스, 오디오 입력 믹서, ADC(analog to digital converter), 오디오 신호 처리기, DAC(digital to analog converter), 오디오 출력 믹서, 또는 오디오 출력 인터페이스를 포함할 수 있다. 오디오 입력 인터페이스는 입력 모듈의 일부로서 또는 전자 장치와 별도로 구성된 마이크(예: 다이나믹 마이크, 콘덴서 마이크, 또는 피에조 마이크)를 통하여 전자 장치의 외부로부터 획득한 소리에 대응하는 오디오 신호를 수신할 수 있다. 예를 들어, 오디오 신호가 외부의 전자 장치(예: 헤드셋 또는 마 이크)로부터 수신되는 경우, 오디오 입력 인터페이스는 상기 외부의 전자 장치와 연결 단자를 통해 직접(예: 유선으로), 또는 무선 통신 모듈을 통하여 무선으로(예: Bluetooth 통신) 연결되어 오디오 신호를 수신할 수 있다. 일 실시예에 따르면, 오디오 입력 인터페이스는 상기 외부의 전자 장치로부 터 획득되는 오디오 신호와 관련된 제어 신호(예: 입력 버튼을 통해 수신된 볼륨 조정 신호)를 수신할 수 있다. 오디오 입력 인터페이스는 복수의 오디오 입력 채널들을 포함하고, 상기 복수의 오디오 입력 채널들 중 대 응하는 오디오 입력 채널 별로 다른 오디오 신호를 수신할 수 있다. 일 실시예에 따르면, 추가적으로 또는 대체 적으로, 오디오 입력 인터페이스는 전자 장치의 다른 구성 요소(예: 프로세서 또는 메모리 )로부터 오디오 신호를 입력 받을 수 있다. 오디오 입력 믹서는 입력된 복수의 오디오 신호들을 적어도 하나의 오디오 신호로 합성할 수 있다. 예를 들어, 일 실시예에 따르면, 오디오 입력 믹서는, 오디오 입력 인터페이스를 통해 입력된 복수의 아날 로그 오디오 신호들을 적어도 하나의 아날로그 오디오 신호로 합성할 수 있다. ADC는 아날로그 오디오 신호를 디지털 오디오 신호로 변환할 수 있다. 예를 들어, 일 실시예에 따르면, ADC는 오디오 입력 인터페이스을 통해 수신된 아날로그 오디오 신호, 또는 추가적으로 또는 대체적으 로 오디오 입력 믹서를 통해 합성된 아날로그 오디오 신호를 디지털 오디오 신호로 변환할 수 있다. 오디오 신호 처리기는 ADC를 통해 입력 받은 디지털 오디오 신호, 또는 전자 장치의 다른 구성 요소로부터 수신된 디지털 오디오 신호에 대하여 다양한 처리를 수행할 수 있다. 예를 들어, 일 실시예에 따르 면, 오디오 신호 처리기는 하나 이상의 디지털 오디오 신호들에 대해 샘플링 비율 변경, 하나 이상의 필터 적용, 보간(interpolation) 처리, 전체 또는 일부 주파수 대역의 증폭 또는 감쇄, 노이즈 처리(예: 노이즈 또는 에코 감쇄), 채널 변경(예: 모노 및 스테레오간 전환), 합성(mixing), 또는 지정된 신호 추출을 수행할 수 있다. 일 실시예에 따르면, 오디오 신호 처리기의 하나 이상의 기능들은 이퀄라이저(equalizer)의 형태로 구현될 수 있다. DAC는 디지털 오디오 신호를 아날로그 오디오 신호로 변환할 수 있다. 예를 들어, 일 실시예에 따르면, DAC는 오디오 신호 처리기에 의해 처리된 디지털 오디오 신호, 또는 전자 장치의 다른 구성 요 소(예: 프로세서 또는 메모리)로부터 획득한 디지털 오디오 신호를 아날로그 오디오 신호로 변환할 수 있다. 오디오 출력 믹서는 출력할 복수의 오디오 신호들을 적어도 하나의 오디오 신호로 합성할 수 있다. 예를 들어, 일 실시예에 따르면, 오디오 출력 믹서는 DAC를 통해 아날로그로 전환된 오디오 신호 및 다른 아날로그 오디오 신호(예: 오디오 입력 인터페이스을 통해 수신한 아날로그 오디오 신호)를 적어도 하나의아날로그 오디오 신호로 합성할 수 있다. 오디오 출력 인터페이스는 DAC를 통해 변환된 아날로그 오디오 신호, 또는 추가적으로 또는 대체적으 로 오디오 출력 믹서에 의해 합성된 아날로그 오디오 신호를 음향 출력 모듈을 통해 전자 장치 의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들어, dynamic driver 또는 balanced armature driver 같은 스피커, 또는 리시버를 포함할 수 있다. 일 실시예에 따르면, 음향 출력 모듈은 복수의 스피 커들을 포함할 수 있다. 이런 경우, 오디오 출력 인터페이스는 상기 복수의 스피커들 중 적어도 일부 스피 커들을 통하여 서로 다른 복수의 채널들(예: 스테레오, 또는 5.1채널)을 갖는 오디오 신호를 출력할 수 있다. 일 실시예에 따르면, 오디오 출력 인터페이스는 외부의 전자 장치(예: 외부 스피커 또는 헤드셋)와 연결 단자를 통해 직접, 또는 무선 통신 모듈을 통하여 무선으로 연결되어 오디오 신호를 출력할 수 있다. 일 실시예에 따르면, 오디오 모듈은 오디오 입력 믹서 또는 오디오 출력 믹서를 별도로 구비하 지 않고, 오디오 신호 처리기의 적어도 하나의 기능을 이용하여 복수의 디지털 오디오 신호들을 합성하여 적어도 하나의 디지털 오디오 신호를 생성할 수 있다. 일 실시예에 따르면, 오디오 모듈은 오디오 입력 인터페이스를 통해 입력된 아날로그 오디오 신호, 또는 오디오 출력 인터페이스를 통해 출력될 오디오 신호를 증폭할 수 있는 오디오 증폭기(미도시)(예: 스 피커 증폭 회로)를 포함할 수 있다. 일 실시예에 따르면, 상기 오디오 증폭기는 오디오 모듈과 별도의 모 듈로 구성될 수 있다. Bluetooth Core Version 5.2 이상의 LE 전자 장치들은 BIS(broadcast isochronous stream) 방식 또는 CIS(connected isochronous stream) 방식을 통해 LE 오디오 서비스를 지원할 수 있다. 본 개시의 다양한 실시예들은 Bluetooth Low Energy(또는 BLE) 전자 장치간 제공할 수 있는 오디오 서비스 (audio service) 중 BIS 방식에 관한 것으로, BIS는 Non Acknowledgment protocol로 데이터 송수신 시 신뢰성 을 확보하기 어려울 수 있다. 이를 해결하기 위해, BIS는 동일한 PDU(protocol data unit)에 대해 재전송 횟수 를 늘림으로써 데이터 송수신 시 신뢰성을 해결하기 위한 프로토콜을 가지고 있다. 이 경우, 의무적으로 동일 PDU를 여러 번 재전송해야 하기 때문에, WiFi와의 공존성(coexistance) 또는 BT 동시 실행(concurrency)을 위 해 할당할 리소스가 낭비될 수 있다. 또한, 의무적인 재전송은 전자 장치의 전류 소모를 크게 발생시킬 수 있으 며, 정확한 주변 환경에 대응이 불가하기 때문에 고정 비트레이트를 유지해야 하므로 이로 인해 데이터 전송률 에 손해를 볼 수 있다. 본 개시에서 비트레이트는 초당 처리해야 하는 비트(bit) 단위의 데이터 크기를 의미할 수 있다. 예를 들어, 비 트레이트의 단위는 '비트 퍼 세컨드(bps, bit per second)'를 사용할 수 있다. 도 3은 일 실시예에 따른 복수의 전자 장치들의 동작 예시를 나타낸다. 도 3을 참조하면, 제1 전자 장치 및 제6 전자 장치 각각은 휴대용 통신 장치(예: 스마트폰) 또는 스 피커(speaker)를 포함하는 전자 장치(예: 오디오 장치, 가전 제품, 웨어러블 장치, 스마트 워치, 및/또는 스마 트 링)로 구현될 수 있다. 제2 전자 장치 내지 제5 전자 장치(310~340), 제7 전자 장치, 및 제8 전자 장치 각각은 스피커(speaker)를 포함하는 전자 장치(예: 무선 이어폰, 오디오 장치, 블루투스 스피커, 가전 제 품, 웨어러블 장치, 스마트 워치, 및/또는 스마트 링)로 구현될 수 있다. 제6 전자 장치는 제1 전자 장치 로부터 BIS 방식으로 브로드캐스트되는 데이터(또는 오디오 데이터)를 수신하여 제7 전자 장치 및 제 8 전자 장치 중에서 적어도 하나로 전달할 수 있다. 제6 전자 장치는 제1 전자 장치와 다른 전 자 장치들(360, 370) 간 데이터를 중계하는 어시스턴트 롤(assistant role)을 수행할 수 있다. 일 실시예에 따라, 제2 전자 장치 및 제3 전자 장치는 사용자의 좌측 귀 및 우측 귀 각각에 착용되는 한 쌍의 무선 이어폰으로 구현될 수 있다. 일 실시예에 따라, 제4 전자 장치 및 제5 전자 장치는 사 용자의 좌측 귀 및 우측 귀 각각에 착용되는 한 쌍의 무선 이어폰으로 구현될 수 있다. 일 실시예에 따라, 제7 전자 장치 및 제8 전자 장치는 사용자의 좌측 귀 및 우측 귀 각각에 착용되는 한 쌍의 무선 이어폰으 로 구현될 수 있다. 제1 전자 장치는 BIS 방식으로 오디오 데이터를 브로드캐스트할 수 있다. 일 실시예에 따라, 제2 전자 장 치, 제3 전자 장치, 제4 전자 장치, 및 제5 전자 장치 중에서 적어도 하나는 제1 전자 장치에서 브로드캐스트되는 오디오 데이터를 수신할 수 있다. 일 실시예에 따라, 제7 전자 장치 및 제8 전자 장치 중에서 적어도 하나는 제1 전자 장치에서 브로드캐스트되는 오디오 데이터를 제6 전자 장 치로부터 수신할 수 있다. 제1 전자 장치는 다른 전자 장치가 오디오 데이터를 수신하기 위해 필요한 설정 정보(또는 제어 정보)를 브로드캐스트할 수 있다. 일 실시예에 따라, 제2 전자 장치 내지 제8 전자 장치 중에서 적어도 하나 는 제1 전자 장치에서 브로드캐스트되는 설정 정보(또는 제어 정보)에 기반하여 제1 전자 장치에서 브로드캐스트되는 오디오 데이터를 수신할 수 있다. 일 실시예에 따라, 제2 전자 장치 및 제3 전자 장치 가 한 쌍으로 동작하는 경우, 제2 전자 장치 및 제3 전자 장치 중에서 어느 하나가 제1 전자 장 치에서 브로드캐스트되는 설정 정보(또는 제어 정보)에 기반하여 오디오 데이터를 수신할 수 있다. 도 4는 일 실시예에 따른 링크 레이어 패킷 포맷(link layer packet format)을 나타낸다. LE Uncoded PHYs(LE 1M, LE 2M)는 도 4와 같은 패킷 포맷(packet format)으로 정의되며, 피지컬 채널(physical channel)의 패킷에 상기 패킷 포맷이 사용될 수 있다. 도 4를 참조하면, 링크 레이어 패킷 포맷(link layer packet format)은 4개의 필수적 필드들(mandatory fields)과 1개의 옵셔널 필드(optional field)로 구성된다. 4개의 필수적 필드들(mandatory fields)은 Preamble, Access Address, PDU, CRC이고, 옵셔널 필드(optional field)는 Constant Tone Extension이다. Preamble은 LE 1M PHY에서 송수신시 1 octet, LE 2M PHY에서 송수신 시 2 octets으로 구성될 수 있다. Access Address는 4 octets으로 구성되고, PDU는 2에서 258 octets으로 구성될 수 있다. CRC는 3 octets으로 구성될 수 있다. Preamble이 먼저 전송되고, 순서대로 Access Address, PDU, CRC, 및 Constant Tone Extension(존재하 는 경우)이 전송될 수 있다. 전체 패킷은 동일한 심볼 속도(symbol rate)(예를 들어, 1 Msym/s 또는 2 Msym/s modulation중 하나)로 전송될 수 있다. 패킷(Constant Tone Extention을 포함하지 않음) 전송 시 44~2128 μs 가 소요될 수 있다. Constant Tone Extension이 존재하는 경우 Constant Tone Extension 지속 시간은, 예를 들 어, 16~160μs일 수 있다. 도 5는 일 실시예에 따른 EA(extended advertising) 및 PA(periodic advertising) 이벤트를 설명하기 위한 도 면이다. 도 5를 참조하면, 어드벌타이징 이벤트(Advertising Event)(또는 ADV_EXT_IND PDUs)가 발생하면, AUX_ADV_IND PDU가 전송될 수 있다. AUX_ADV_IND PDU가 전송되면, AUX_SYNC_IND PDU, 및 AUX_CHAIN_IND PDU를 포함하는 PA 트레인(periodic advertising train)이 전송될 수 있다. PA 트레인(periodic advertising train)에 대한 PA 인 터벌(Periodic Advertising Interval)이 설정되고, 시작 시점(periodic event start) 및 끝 시점(periodic event end)이 설정될 수 있다. PA 트레인(periodic advertising train)에서 전송되는 AUX_SYNC_IND PDU, AUX_CHAIN_IND PDU는 PA 트레인을 설명하는 AUX_ADV_IND PDU에 포함된 동기 정보 필드(SyncInfo field)에 설 정된 Access Address(AA) 값을 사용해야 한다. Isochronous Broadcasting State의 링크 레이어(Link Layer)는 BIG별로 Seed Access Address(SAA)를 새로 생성할 수 있다. 생성할 BIS(es)에 대한 Access Address는 SAA로부 터 유도될 수 있다. BIG의 각 BIS 및 BIG Control Logical link에 대한 Access Address는 해당 BIG에 대한 SAA 에서 파생될 수 있다. 도 6은 일 실시예에 따른 BIG 이벤트 및 BIS 이벤트를 설명하기 위한 도면이다. 브로드캐스트 방식은 동기화된 스트림 그룹(group of synchronized streams)을 사용하여 적어도 하나의 소스(또는 적어도 하나의 소스 전자 장 치)에서 복수의 싱크(또는 싱크 전자 장치)로 데이터가 스트리밍되는 방식일 수 있다. 브로드캐스트 방식에서 사용되는 각 스트림을 BIS(broadcast isochronous stream)로 칭하고, BIS의 그룹을 BIG(broadcast isochronous group)로 칭할 수 있다. BIS logical transport는 하나 이상의 isochronous data stream을 범위 내(예: 일정 거리 내)의 BIS를 위한 모 든 장치로 전송하는데 사용될 수 있다. BIS는 Isochronous data packets을 전송하기 위한 하나 이상의 서브이벤 트(subevent)를 포함할 수 있다. BIS는 모든 BIS events에서 복수 개의 isochronous data packets 전송을 지원 할 수 있다. 도 6을 참조하면, BIG event x는 적어도 하나의 BIS event x를 포함하고, BIS event x 내에서 특정 Isochronous data가 전송될 수 있다. ISO_Interval은 인접한 두 BIG Anchor point 사이의 시간을 나타내고, Sub_Interval은 각 BIS에서 2개의 연속된 subevent의 시작 사이의 시간을 나타낸다. 일 실시예에 따라, BIG event x는 적어도 하나 이상의 BIS event x를 포함하고, BIS event x는 적어도 하나 이상의 subevent를 포함할수 있다. BIS event는 하나 이상의 BIS PDU들(410, 420, 430)로 구성될 수 있다. Link Layer는 BIG events에서만 BIS PDU를 전송할 수 있다. Link Layer는 BIG Event의 일부로 BIS PDU만을 전송할 수 있다. 각 BIG event는 Num_BIS로 나눠지는 BIS events와 control subevent로 구분될 수 있다. 일 실시예에 따라, 소스 전자 장치는 채널 정보 변경이 필요하다고 판단하는 경우 변경된 채널 정보를 포함하는 control subevent를 전송할 수 있다. 일 실시예에 따라, 소스 전자 장치는 채널 정보 변경이 필요하지 않 은 경우 control subevent를 전송하지 않을 수 있다. 일 실시예에 따라, 소스 전자 장치는 BIG 종료가 필 요하다고 판단하는 경우 control subevent를 전송할 수 있다. 각 BIS event는 NSE subevents로 구분될 수 있다. 각 BIS event는 BIS Anchor point라고 불리는 순간에 시작하여, 마지막 subevent후에 종료될 수 있다. 각 BIG event는 BIG Anchor point라고 불리는 순간에 시작하여, control subevent가 있다면 그 후에 종료 되며, control subevent가 없는 경우, 마지막 BIS event에 종료될 수 있다. BIG Anchor point는 ISO_Interval 간격으로 규칙적으로 이격될 수 있다. BIS는 Acknowledgment protocol이 없으며 트래픽(traffic)은 브로드캐스팅 장치(broadcasting device)인 적어 도 하나의 소스 전자 장치로부터 단방향으로 전송될 수 있다. 전송 신뢰성 향상을 위해 isochronous data packets은 event내 subevents의 수를 증가시킴으로써 재전송될 수 있다. BIG 내의 다수의 BIS는 공통의 타이밍 기준(timing reference)을 가지며 시간적으로 동기화될 수 있다. 예를 들 어, 별도의 장치에 의해 수신되는 audio stereo stream의 좌우 채널은 동시에 rendering 될 필요가 있다. BIG 내의 다수의 BIS는 순차적으로(sequentially) 또는 교차(interleaved) 배열로 스케줄(schedule)될 수 있다. 전자 장치가 BIS를 수신하기 위해 Link Layer가 streams를 설명하는 BIG 정보(BIGInfo)를 획득해야 할 수 있다. BIG 정보(BIGInfo)는 주기적 어드벌타이징(periodic advertising)의 ACAD(additional controller advertising data)로부터 획득할 수 있다. 각 BIG는 다음과 같은 파라미터들(parameters)을 포함할 수 있다. - Num_BIS는 BIG내의 BIS들의 개수이다. BIG내의 BIS들은 각각 1부터 Num_BIS까지 서로 다른 BIS_Number를 할 당 받을 수 있다. - ISO_Interval은 인접한 두 BIG Anchor point 사이의 시간(예를 들어, 1.25ms 단위)이다. 예를 들어, ISO_Interval 값은4에서 3200 사이일 수 있다. (5ms ~ 4s) - BIS_Spacing은 BIG에서 인접한 BIS들에서 해당 Subevent의 시작 시점과, 마지막 BIS의 첫 번째 subevent의 시작 시점과 control subevent 사이의 시간이다. - Sub_Interval은 각 BIS의 2개의 연속된 subevent의 시작 사이의 시간이다. - Max_PDU는 BIG에서 각 BIS Data PDU를 전송할 수 있는 최대 data octets 수 (MIC 제외)이다. 예를 들어, Max_PDU 값은 1에서 251 사이이다. - Max_SDU는 이 BIG의 SDU(service data unit)의 최대 크기이다. 예를 들어, Max_SDU 값은 1에서 4095 사이이 다. - Max SDU는 최대 전송할 수 있는 데이터의 크기를 의미한다. 예를 들어, Max SDU가 120byte이고, ISO Interval이 10ms라고 가정하면, 비트레이트(bitrate)는 96kbps가 될 수 있다(120byte = 960bit, 96,000bit/second => 96kbps). - MPT(max PDU transmission time)는 BIS에 사용되는 PHY에서 Max_PDU octet의 payload와 함께 BIS Data PDU가 포함된 packet을 전송하는데 걸리는 시간과 같아야 하며, LE Coded PHY에서는 S=8을 가정한다. - BN(burst number), PTO(pre-transmission offset), IRC(immediate repetition count)는 각 BIG event에서 어떤 데이터를 전송하는지 제어한다. BN의 값은 1에서 7 사이어야 한다. PTO의 값은 0에서 15 사이여야 한다. IRC의 값은 1에서 15 사이여야 한다. IRC는 해당 BIS event와 관련된 데이터를 운반하는 group의 수를 지정할 수 있다. 나머지 그룹은 PTO에 의해 지정된 BIS event와 관련된 데이터를 운반할 수 있다. - NSE(number of subevent)는 각 BIG event에서 BIS당 subevents의 수이다. 이 값은 1에서 31 사이여야 하며, BN의 정수 배수여야 한다.- Framed는 BIG가 framed 또는 unframed data를 전달하는지 나타낸다. - Encrypted는 BIG의 암호화 여부를 나타낸다. 도 7a는 일 실시예에 따른 순차 배열(sequential arrangement)을 갖는 BIS들의 예시를 나타내고, 도 7b는 일 실시예에 따른 교차 배열(interleaved arrangement)을 갖는 BIS들의 예시를 나타낸다. BIG내의 BIS들은 Sub_Interval 및 BIS_Spacing parameter의 값을 적절하게 설정하여 순차적으로(sequential) 또는 교차적으로(interleaved) 배열될 수 있다. BIS subevents는 Isochronous Broadcaster가 Broadcaster Isochronous BIS PDU를 전송하고, Synchronized Receiver가 이를 수신할 수 있는 기회이다. 도 7a를 참조하면, Num_BIS=2이고 NSE=2인 BIG가 순차적으로(sequential) 배열된 예시를 나타낸다. BIG event x는 BIS1 event x 및 BIS2 event x를 순차적으로 포함하고, BIS1 event x는 BIS1 Event x Subevt 1 및 BIS1 Event x Subevt 2를 포함하고, BIS2 event x는 BIS2 Event x Subevt 1 및 BIS2 Event x Subevt 2를 포함할 수 있다. 일 실시예에 따라, 순차 배열인 경우, BIS_Spacing은 NSE * Sub_Interval 이상이어야 하므로, BIS Event 의 모든 subevent가 함께 발생할 수 있다. 도 7b를 참조하면, Num_BIS=2이고 NSE=2인 BIG가 교차적으로(interleaved) 배열된 예시를 나타낸다. BIG event x는 BIS1 event x 및 BIS2 event x를 교차적으로 포함할 수 있다. BIG event x는 시간 순으로 BIS1 Event x Subevt 1, BIS2 Event x Subevt 1, BIS1 Event x Subevt 2, BIS2 Event x Subevt 2를 포함할 수 있다. 일 실 시예에 따라, 교차 배열인 경우, Sub_Interval은 Num_BIS * BIS_Spacing이어야 하며, 모든 BIS의 첫 번째 subevent가 인접하고, 그 다음 모든 BIS의 두 번째 subevent가 인접할 수 있다. 각 경우 BIS_Spacing에 대한 최소값을 사용해야 할 수 있다. 도 7a 및 도 7b를 참고하면, BIG event의 data 부분(control subevent를 제외)에 대한 가능한 최대 길이는 BIG_Sync_Delay로 표시될 수 있다. BIG_Sync_Delay의 값은 Anchor point부터 마지막 subevent에서 전송된 Max_PDU octet의 payload를 포함하는 packet의 끝인 BIG Synchronization까지의 시간과 같을 수 있다. BIG_Sync_Delay는 (Num_BIS - 1) * BIS_Spacing + (NSE - 1) * Sub_Interval + MPT와 같다. Link Layer는 예 를 들어, scheduling conflicts이 없는 한, isochronous broadcasting event의 각 subevent가 시작되는 시점에 하나의 BIC Data PDU를 전송해야 한다. 일 실시예에 따라, 6개의 연속적인 BIS events내에 적어도 하나의 BIS PDU가 전송될 수 있다. PDU를 전송하지 못한 경우, Link Layer는 다른 모든 목적(Packet timing, payload의 선 택)이 완료된 것처럼 해야 할 수 있다. BIS event마다 data source는 BN(burst number) payloads로 구성된 data burst를 공급해야 하며, 각 data는 single fragment 또는 하나 이상의 SDU segments를 보유해야 할 수 있다. 이 burst는 대응하는 BIS event와 연 관되지만, 이른 event에서도 전송될 수 있다. 주어진 payload를 포함하는 각 PDU는 동일한 LLID(link layer identifier) 값을 가지지만, 다른 CSSN과 CSTF를 가질 수 있다. 참고로, BIS event와 연관된 burst는 bigEventCounter * BN과 (bigEventCounter + 1) * BN - 1 사이의 bisPayloadCounter의 payloads로 구성될 수 있다. 각 BIS event의 subevents는 각각 BN subevent의 그룹으로 분할될 수 있다. 따라서, GC(Group Count) groups은 GC = NSE / BN 일 수 있다. IRC(immediate repetition count)는 현재 BIS event와 관련된 데이터를 운반하는 그룹의 수를 지정할 수 있다. 나머지 그룹은 PTO(pre-transmission offset)에 의해 지정된 BIS event와 관련된 데이터를 운반할 수 있다. IRC는 0보다 크고 GC보다 크지 않아야 한다. IRC = GC 이면 PTO는 무시되어야 한다. 그렇지 않으면 PTO는 0보다 커야 한다. Subevents의 groups은 순서대로 0부터 GC-1까지 g를 사용하여 번호가 매겨진다. - g < IRC인 경우, group g는 현재 BIS event와 관련된 data를 포함해야 한다. - g >= IRC인 경우, group g는 현재 BIS event 후 PTO * (g - IRC + 1) BIS event의 future BIS event와 관련 된 data를 포함해야 한다.각 burst의 payload는 항상 동일한 순서로 전송되어야 한다. 도 8a 내지 도 8c 각각은 일 실시예에 따른 BIS 내 페이로드 할당의 예시를 나타낸다. 도 8a는 BN=2, IRC=2, PTO=0, NSE=4 의 특성을 갖는 BIS 내 페이로드 할당을 나타낸다. BN=2이므로 BIS event(x)에서 페이로드 p0, p1이 전송될 수 있고, IRC=2이므로 BIS event(x)에서 페이로드 p0, p1이 한번 더 전송될 수 있다(retransmission of burst). PTO=0이므로 BIS event(x)에서 이후에 전송되는 BIS event와 관련 된 데이터는 미리 전송되지 않을 수 있다. BIS event(x)는 시간 순으로 페이로드 p0, p1, p0, p1를 포함하고, 반복 전송되는 p0, p1는 retransmission of burst이다. BIS event(x+1)는 시간 순으로 페이로드 p2, p3, p2, p3를 포함하고, 반복 전송되는 p2, p3는 retransmission of burst이다. 도 8a에서는 PTO=0이므로 각 BIS event 에서 현재 BIS event와 관련된 데이터가 반복 전송되고, 이후에 전송되는 BIS event와 관련된 데이터는 미리 전송되지 않을 수 있다. 도 8b는 BN=1, IRC=3, PTO=2, NSE=5 의 특성을 갖는 BIS 내 페이로드 할당을 나타낸다. BN=1이므로 BIS event(x)에서 페이로드 p0가 전송될 수 있고, IRC=3이므로 BIS event(x)에서 페이로드 p0가 세번 전송될 수 있 다(retransmission of burst). BN=1, PTO=2, IRC=3, NSE=5이므로 BIS event(x)에서 BIS event(x+2)와 관련된 페이로드 p2 및 BIS event(x+4)와 관련된 페이로드 p4가 미리 전송될 수 있다. BIS event x는 시간 순으로 페이 로드 p0, p0, p0, p2, p4를 포함하고, p0는 현재 BIS event(Event x)와 관련된 데이터이고, p2는 BIS event(Event x+2)와 관련되며 BIS event(Event x)에서 미리 전송되는 데이터이고, p4는 BIS event(Event x+4) 와 관련되며 BIS event(Event x)에서 미리 전송되는 데이터일 수 있다. BIS event(Event x+2)의 시작 시점은 BIS event(Event x)의 시작 시점에서 2 인터벌(ISO_Interval) 이후의 시점일 수 있다. BIS event(Event x+4)의 시작 시점은 BIS event(Event x)의 시작 시점에서 4 인터벌(ISO_Interval) 이후의 시점일 수 있다. BIS event(x+1)에서 페이로드 p1이 세 번 전송되고(retransmission of burst), BIS event(x+1)에서 BIS event(x+3)과 관련된 페이로드 p3 및 BIS event(x+5)와 관련된 페이로드 p5가 미리 전송될 수 있다. 도 8c는 BN=2, IRC=2, PTO=4, NSE=6 의 특성을 갖는 BIS 내 페이로드 할당을 나타낸다. BN=2이므로 BIS event(x)에서 페이로드 p0, p1이 전송될 수 있고, IRC=2이므로 BIS event(x)에서 페이로드 p0, p1가 한번 더 전송될 수 있다(retransmission of burst). BN=2, PTO=4, NSE=6이므로 BIS event(x)에서 BIS event(x+4)와 관 련된 페이로드 p8, p9가 전송될 수 있다. BIS event x는 시간 순으로 페이로드 p0, p1, p0, p1, p8, p9를 포함 하고, p0, p1은 현재 BIS event(Event x)와 관련된 데이터이며 반복 전송될 수 있고, p8, p9는 BIS event(Event x+4)와 관련된 데이터일 수 있다. 한편, BIS 서비스는 불특정 다수를 위해 BIS 오디오 데이터(audio data)를 전송하는 서비스로 하나의 BIS Source에 동기화(synchronization)되어 BIS 오디오 데이터를 수신하는 싱크 전자 장치가 BIS Source와 거리가 멀어지는 경우, 블루투스(Bluetooth) 통신이 끊길 수 있고 더 이상 BIS Source로부터 송신되는 BIS 오디오 데이 터를 수신하지 못할 수 있다. 소스 전자 장치와 싱크 전자 장치 간 거리 이동에 따른 문제를 해결하기 위해, 또는 각각의 전자 장치들이 고유 의 오디오 채널(audio channel)을 운용하도록 BIS Service를 구성하기 위해, 복수의 소스 전자 장치를 하나의 BIS Source 것처럼 구성할 수 있다. 복수의 BIS Source를 이용해 BIS Service를 수행하는 경우, 복수의 BIS 소 스 전자 장치가 Clock 및 BIG Parameters를 동기화를 통한 PA 및 BIS 데이터 전송을 동기화해야 할 수 있다. 본 개시는 복수의 전자 장치들을 이용한 BIS 데이터 전송 방법을 제안하며, 복수의 전자 장치들이 하나의 BIS Source와 같이 동작하여 BIS 데이터, EA(extended advertising), 및/또는 PA(periodic advertising)를 전송하 는 방법을 제안한다. 복수의 전자 장치들이 하나의 BIS Source와 같이 동작하여 BIS 데이터, EA, 및/또는 PA를 전송하면, 복수의 싱크 전자 장치에게 안정적이고, 높은 오디오 품질(audio quality)로 브로드캐스트 서비스 (broadcast service)를 제공할 수 있다. 일 실시예에 따라, 복수의 전자 장치들이 블루투스 클락(Bluetooth clock) 및 BIG 파라미터들(parameters)에 대한 동기화를 수행하고, 하나의 소스 전자 장치가 BIS 데이터를 전송 하는 것처럼 동작함으로써, 싱크 전자 장치는 좀 더 강한 신호를 브로드캐스트하는 소스 전자 장치로부터 BIS 데이터를 수신할 수도 있고, 싱크 전자 장치가 이동 시 주변에 위치하는 적어도 하나의 소스 전자 장치를 통해 끊김 없이 BIS 데이터를 수신할 수 있다.복수의 전자 장치들이 하나의 BIS Source처럼 동작하기 위해, 복수의 소스 전자 장치들은 서로의 동작 시점을 동기화하고, PA(periodic advertising)를 전송할 수 있다. 일 실시예에 따라, 복수의 소스 전자 장치들 중에서 적어도 하나는 설정된 시간 구간(또는 인터벌)에서 PA를 전송할 수 있다. 일 실시예에 따라, 복수의 소스 전자 장치들 중에서 적어도 하나는 필요 시 전송될 동일한 BIG 정보 공유를 통해 동일한 타이밍에 BIS 데이터를 전송 할 수 있다. 복수의 소스 전자 장치들 중에서 적어도 하나는, BT/BLE를 이용한 직접 링크 생성, BLE Advertising/Scan 동작, PA 및 BIS 데이터 송수신, 및/또는 다른 베어러(bearer)를 통한 통신(예를 들어, Wi-Fi)을 통해 복수의 소스 전 자 장치들의 동작 시점(예: Bluetooth Clock)을 동기화시켜 패킷(packet) 전송 시점을 동기화할 수 있다. 복수 의 소스 전자 장치들 중에서 적어도 하나는, PA 전송을 위한 인터벌(interval) 및 해당 PA에 사용되는 채널 맵 (channel map) 및 이벤트 카운터(event counter)를 동기화하여 PA 동시 전송 시 사용할 수 있다. 복수의 소스 전자 장치들 중에서 적어도 하나는, BIG 파라미터들을 포함하는 BIG 정보를 동기화하고, 필요시 전 송할 오디오 데이터의 음원도 동기화하여, 이를 기준으로 하나의 소스 전자 장치가 전송하는 것과 같이, BIS 오 디오 데이터를 전송할 수 있다. 복수의 소스 전자 장치들 중에서 적어도 하나는, 브로드캐스트(broadcast ID), 프로그램 정보(program Information), 및 전송 파워(Tx power) 중에서 적어도 하나를 동기화 할 수 있다. 일 실시예에 따라, 복수의 소스 전자 장치들 중에서 적어도 하나는, 필요시 의도적으로 다른 전송 파워를 사용할 수도 있고, 전자 장치의 상태에 따라 전송 횟수, 및/또는 전송 구간을 다르게 운용할 수도 있다. 일 실시예에 따라, 사용자 입력(또는 사용자 의도) 또는 특정 어플리케이션의 동작에 기반하여 PA 전송 정보 및 /또는 BIG 정보(BIGInfo)가 설정될 수 있다. 제1 소스 전자 장치는 PA 전송 정보 및/또는 BIG 정보(BIGInfo)를 제2 소스 전자 장치로 공유(또는 전송)할 수 있다. 제1 소스 전자 장치는 상기 PA 전송 정보와 적어도 일부가 동일한 설정을 기반으로 PA를 전송할 수 있다. 제1 소스 전자 장치는 상기 BIG 정보와 적어도 일부가 동일한 설 정을 기반으로 BIS 데이터를 전송할 수 있다. 일 실시예에 따라, 제2 소스 전자 장치는 적어도 제1 소스 전자 장치 또는 외부 네트워크로부터 PA 전송 정보 및/또는 BIG 정보(BIGInfo)를 수신할 수 있다. 제2 소스 전자 장치는 상기 PA 전송 정보와 적어도 일부가 동일 한 설정을 기반으로 PA를 전송할 수 있다. 제2 소스 전자 장치는 상기 BIG 정보와 적어도 일부가 동일한 설정을 기반으로 BIS 데이터를 전송할 수 있다. 도 9는 일 실시예에 따른 복수의 전자 장치들이 하나의 BIG로 동기화되어 BIS 데이터 및 PA를 전송하는 일 예시 를 나타낸다. 도 9를 참조하면, 제1 전자 장치, 제2 전자 장치, 및 제3 전자 장치 각각은 BIS 소스의 역할을 수행하고, 동일하게 설정된 시점에 PA를 전송하고, 동일하게 설정된 이벤트 카운터(event counter)에 기반하여 하나의 BIG로 동기화되어 BIS 데이터를 전송할 수 있다. 이벤트 카운터 값(예를 들어, 0, 1, 2)에 기반하여, 제1 전자 장치, 제2 전자 장치, 및 제3 전자 장 치 각각은 동일한 시점에 동일한 BIS 데이터를 전송할 수 있다. 예를 들어, 제1 전자 장치, 제2 전자 장치, 및 제3 전자 장치 각각은 이벤트 카운터 값이 0인 시점부터 동일한 BIS 데이터(R0, L0, R1, L1, R0, L0, R1, L1)를 전송할 수 있다. 예를 들어, 제1 전자 장치, 제2 전자 장치, 및 제3 전자 장 치 각각은 이벤트 카운터 값이 1인 시점부터 동일한 BIS 데이터(R2, L2, R3, L3, R2, L2, R3, L3)를 전송 할 수 있다. 도 10은 일 실시예에 따른 복수의 전자 장치들이 하나의 BIG로 동기화되고, BIS 데이터 전송과 PA 전송이 달리 설정되는 일 예시를 나타낸다. 도 10을 참조하면, 제1 전자 장치, 제2 전자 장치, 및 제3 전자 장치 각각은 BIS 소스의 역 할을 수행하고, 각각 설정된 시점에 PA를 전송하고, 이벤트 카운터(event counter)에 기반하여 각각 BIS 데이터 를 전송할 수 있다. 제2 전자 장치 및 제3 전자 장치는 동일한 시점에 PA를 전송하고, 이후 이벤트 카운터 값이 0인 시 점부터 제1 전자 장치 내지 제3 전자 장치 각각은 BIS 데이터의 전부 또는 일부를 전송할 수 있다. 예를 들어, 이벤트 카운터 값이 0인 시점부터 제1 전자 장치는 제1 BIS 데이터(R0, L0, R1, L1)를 전송하 고, 제3 전자 장치는 제2 BIS 데이터(R0, L0, R1, L1, R0, L0, R1, L1)를 전송할 수 있다. 제1 전자 장치가 제1 BIS 데이터(R0, L0, R1, L1) 전송을 완료한 이후 시점부터, 제2 전자 장치는 제3 BIS 데 이터(R0, L0, R1, L1)를 전송할 수 있다.. 도 10에서, 제1 전자 장치, 제2 전자 장치, 및 제3 전자 장치 각각은 서로 동일하거나 달리 설정된 시점에 기반하여 PA 및/또는 BIS 데이터를 전송할 수 있다. 도 11a는 일 실시예에 따른 복수의 전자 장치들이 네트워크를 통해 하나의 BIG로 동기화되는 일 예시를 나타낸 다. 도 11a를 참조하면, 제1 전자 장치는 PA 및/또는 BIS데이터에 대한 전송 시점, PA 전송 정보, 및 BIG 정 보 중에서 적어도 하나를 결정 및/또는 전송할 수 있다. 일 실시예에 따라, 제1 전자 장치는 컴퓨터, 서 버, 또는 핸드폰으로 구현될 수 있다. 제1 전자 장치는 PA 및/또는 BIS데이터에 대한 전송 시점, PA 전송 정보, 및 BIG 정보 중에서 적어도 하나를 네트워크를 통해 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치 각각으로 전송할 수 있다. 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치 각각은 PA 및/또는 BIS데이터에 대한 전송 시점, PA 전송 정보, 및 BIG 정보 중에서 적어도 하나에 기반하여 PA 및/또는 BIS데이터를 전송할 수 있다. 도 11b는 일 실시예에 따라 전자 장치가 PA 전송 및 직접 연결을 통해 BIG 정보를 공유하는 예시를 나타낸다. 도 11b를 참조하면, 제1 전자 장치는 PA를 통해 제2 전자 장치, 제3 전자 장치, 및 제4 전 자 장치 중에서 적어도 하나로 BIG 정보를 공유할 수 있다. 제1 전자 장치는 직접 연결을 통해 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치 중에서 적어도 하나로 BIG 암호화 키 (encryption key)를 공유할 수 있다. 제1 전자 장치는 BIG 생성 여부 결정과 별개로, 제1 전자 장치가 결정한 BIG 정보 중 적어도 하나 BIG 파라미터를 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치 중에서 적어도 하나로 공 유할지 여부를 결정할 수 있다. 제1 전자 장치는 BIG 정보 공유 여부 결정에 따라, BIG 정보를 수신할 전 자 장치와 BT/BLE 링크 생성을 통한 직접 연결, 또는 BLE Scan/Advertising, PA 송신, 또는 Wi-Fi와 같은 다른 네트워크를 통한 통신 방법을 통해 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치 중에서 적어도 하나로 BIG 정보를 공유할 수 있다. 제1 전자 장치는 상기 방법들 중 두 개 이상의 방법을 동시에 사용하여 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치 중에서 적어도 하나로 BIG 정보 를 공유할 수 있다. 제1 전자 장치는 PA 송신을 통해 다른 전자 장치가 BIG 정보를 획득할 수 있게 하고, Wi-Fi 통신을 통해 BIG 암호화 키(encryption key)를 공유할 수 있다. 도 12는 일 실시예에 따른 복수의 전자 장치들이 BIG 생성 커맨드를 통해 하나의 BIG로 동기화되는 일 예시를 나타낸다. 도 9는 BIS 소스의 역할을 수행하는 복수의 전자 장치들이 PA 및 BIS 데이터를 전송하는 일 예시를 도시하고, 도 12는 BIS 소스의 역할을 수행하는 복수의 전자 장치들 중에서 BIG 정보를 수신하는 전자 장치들 (1220~1240)의 동작의 일 예시를 도시한다. 도 12를 참조하면, BIS 소스의 역할을 수행하며 BIG 정보를 생성하는 제1 전자 장치는 BIS 소스의 역할을 수행 하며 BIG 정보를 수신하는 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치로 BIG 생성 커 맨드를 전송할 수 있다. 상기 BIG 생성 커맨드는 동기화된 PA 및/또는 BIS데이터에 대한 전송 시점 정보, PA 전 송 정보, 및 BIG 정보 중에서 적어도 하나를 포함할 수 있다. BIS 소스의 역할을 수행하며 BIG 정보를 수신하는 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장 치 각각은 상기 BIG 생성 커맨드에 기반하여 설정된 시점에 제1 PA를 전송하고, 제1 채널(예를 들어, 좌 측 이어폰을 위한 채널)을 위한 제1 BIS 데이터(L0, L1, L0, L1)를 설정된 시점에 전송하고, 제2 채널(예를 들 어, 우측 이어폰을 위한 채널)을 위한 제2 BIS 데이터(R0, R1, R0, R1)를 설정된 시점에 전송할 수 있다. 이후, 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치 각각은 상기 BIG 생성 커맨드에 기 반하여 제1 채널(예를 들어, 좌측 이어폰을 위한 채널)을 위한 제3 BIS 데이터(L2, L3, L2, L3)를 설정된 시점 에 전송하고, 제2 채널(예를 들어, 우측 이어폰을 위한 채널)을 위한 제4 BIS 데이터(R2, R3, R2, R3)를 설정된 시점에 전송할 수 있다. 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치 각각은 상기 BIG 생성 커맨드에 기반하여 설정된 시점에 제2 PA를 전송할 수 있다. 도 13은 일 실시예에 따른 복수의 전자 장치들이 PA를 통해 하나의 BIG로 동기화되는 일 예시를 나타낸다. 도 13을 참조하면, BIG 정보를 생성하는 제1 전자 장치가 전송하는 BIG 정보 또는 PA를 수신한 제2 전자 장치는 제1 전자 장치와 동일한 BIG 속성으로 EA, PA, 및/또는 BIS 데이터를 전송할 수 있다. 일 실시예에 따라, 제1 전자 장치는 BIG 정보만을 생성하거나 BIG 정보 생성 후 EA 또는 PA만 전송할 수 있 다. 일 실시예에 따라, 제1 전자 장치는 BIS를 위해 전송하는 정보를 적어도 일부만 전송할 수 있다. 제1 전자 장치로부터 BIG 정보 또는 PA를 수신한 제2 전자 장치가 전송하는 PA를 수신한 제3 전자 장치 는 제1 전자 장치 및 제2 전자 장치와 동일한 BIG 속성으로 EA, PA, 및/또는 BIS 데이터를 전송할 수 있다. BIG 정보를 수신한 제2 전자 장치는 PA를 전송함으로써 동일 BIG 속성으로 운영하는 전 자 장치가 증가되도록 동작할 수 있다. 도 13을 참조하면, 제1 전자 장치는 액세스 주소(access address), 채널 맵(channel map), 이벤트 카운 터(event counter), 오디오 채널(audio channel) 중에서 적어도 하나를 포함하는 제1 PA를 전송할 수 있다. 제 2 전자 장치는 상기 PA를 수신하고, 액세스 주소(access address), 채널 맵(channel map), 이벤트 카운 터(event counter), 오디오 채널(audio channel) 중에서 적어도 하나를 확인 및/또는 연산할 수 있다. 제1 전 자 장치 및 제2 전자 장치 각각은 상기 제1 PA에 기반하여 제1 채널(예를 들어, 좌측 이어폰을 위 한 채널)을 위한 제1 BIS 데이터(L0, L1, L0, L1)를 설정된 시점에 전송하고, 제2 채널(예를 들어, 우측 이어폰 을 위한 채널)을 위한 제2 BIS 데이터(R0, R1, R0, R1)를 설정된 시점에 전송할 수 있다. 이후, 제1 전자 장치 및 제2 전자 장치 각각은 상기 제1 PA에 기반하여 제1 채널(예를 들어, 좌측 이어폰을 위한 채널)을 위한 제3 BIS 데이터(L2, L3, L2, L3)를 설정된 시점에 전송하고, 제2 채널(예를 들어, 우측 이어폰을 위한 채널)을 위한 제4 BIS 데이터(R2, R3, R2, R3)를 설정된 시점에 전송할 수 있다. 제1 전자 장치 및 제2 전자 장치 각각은 상기 BIG 생성 커맨드에 기반하여 설정된 시점에 제2 PA를 전송할 수 있다. 제3 전자 장치는 상기 제2 PA를 수신하고, 상기 제2 PA에 포함된 액세스 주소(access address), 채널 맵(channel map), 이벤트 카운터(event counter), 오디오 채널(audio channel) 중에서 적어도 하나를 확인 및/또는 연산할 수 있다. 이후, 제3 전자 장치는 제1 전자 장치 및 제2 전자 장치 와 동기화되어 PA 및/또는 BIS 데이터(L4, R4, L5, R5, L4, R4, L5, R5)를 전송할 수 있다. 도 14는 일 실시예에 따른 BIS 소스 호스트로 동작하는 제1 전자 장치의 동작 방법을 설명하기 위한 순서도이다. 도 14를 참조하면, 1410 동작에서, BIS 소스 호스트(BIS source host)로 동작하는 제1 전자 장치는 제1 전자 장 치의 장치 타입(device type)에 따라 다양하게 설정되는 사용자 입력, 특정 어플리케이션 실행, 및/또는 제 1 전자 장치와 통신 링크(communication link)가 형성된 외부 전자 장치의 요청에 기반하여, PA 전송 정보 및 BIG 정보에 대한 결정 요청(또는 BIG 생성 요청)을 확인 및/또는 수신할 수 있다. 일 실시예에 따라, 제1 전자 장치가 Buds 형태의 전자 장치와 같이 디스플레이가 없이 터치 입력(touch input) 만 가지는 장치 타입(device type)인 경우, 특정 터치 입력이 PA 전송 정보 및 BIG 정보에 대한 결정 요청(또는 BIG 생성 요청)일 수 있다. 일 실시예에 따라, 제1 전자 장치가 외부 전자 장치들에게 BIS Service 수행을 지시 하는 서버와 같은 호스트 장치 타입(host device type)인 경우, 제 1 전자 장치의 키보드, 음성 입력, 터치 입 력, 및 특정 어플리케이션 실행 중에서 적어도 하나의 입력이 PA 전송 정보 및 BIG 정보에 대한 결정 요청(또는 BIG 생성 요청)일 수 있다. 1420 동작에서, 제1 전자 장치는 BIS 데이터에 대한 암호화(encryption) 여부, 암호화 여부에 따른 암호화 키 (encryption key), 피지컬 링크 타입(physical link type), 액세스 주소(access address), 채널 맵(channel map), 프레이밍 모드(framing mode) 중에서 적어도 하나를 포함하는 BIG 파라미터들을 결정할 수 있다. 제1 전 자 장치는 데이터 전송 시점 및 구간에 관한 정보, 전송 파워(Tx power), PA 인터벌(interval)과 같이 BIS 데이 터 전송에 필요한 BIG 정보 및/또는 PA 전송 정보 결정할 수 있다. 1430 동작에서, 제1 전자 장치는 BIG를 직접 생성할지 여부를 결정할 수 있다. 제1 전자 장치가 BIG를 직접 생 성하기로 결정하면(1430-예), 1440 동작에서 제1 전자 장치는 BIG를 생성하고, 생성된 BIG에 기반하여 PA 및 BIS 데이터를 전송할 수 있다. 1450 동작에서, 제1 전자 장치는 PA 전송 정보 및 BIG 정보를 외부 전자 장치에 게 공유할지 여부를 결정할 수 있다. 1450 동작에서 제1 전자 장치가 PA 전송 정보 및 BIG 정보를 외부 전자 장 치에게 공유하기로 결정하면(1450-예), 1460 동작에서 제1 전자 장치는 BLE Scan/Advertising, PA 송수신, 및 Wi-Fi와 같은 네트워크 중에서 적어도 하나 이상의 방법을 통해 외부 전자 장치로 PA 전송 정보 및 BIG 정보를 공유할 수 있다. 제1 전자 장치가 BIG를 직접 생성하지 않기로 결정하면(1430-아니오), 1450 동작에서, 제1 전자 장치는 PA 전송 정보 및 BIG 정보를 외부 전자 장치에게 공유할지 여부를 결정할 수 있다. 일 실시예에 따라, 제1 전자 장치가 서버로 구현되는 경우, 제1 전자 장치는 BIG 정보를 결정하지만 BIG를 생성하지 않을 수 있다. 제1 전자 장치가 PA 전송 정보 및 BIG 정보를 외부 전자 장치에게 공유하지 않기로 결정하면(1450-아니오), 제1 전자 장치는 BIS 관련 동작을 종료할 수 있다. 도 15는 일 실시예에 따른 BIS 소스로 동작하는 제2 전자 장치의 동작 방법을 설명하기 위한 순서도이다. 도 15를 참조하면, 1510 동작에서, BIS 소스로 동작하는 제2 전자 장치는 제2 전자 장치의 장치 타입(device type)에 따라 다양하게 설정되는 사용자 입력, 특정 어플리케이션 실행, 및/또는 제 2 전자 장치와 통신 링크 (communication link)가 형성된 외부 전자 장치의 요청에 기반하여, PA 전송 정보 및 BIG 정보에 대한 결정 요 청(또는 BIG 생성 요청)을 확인 및/또는 수신할 수 있다. 일 실시예에 따라, 제2 전자 장치는 1510 동작을 생략 하고, 1520 동작을 수행할 수도 있다. 1520 동작에서, 제2 전자 장치는 제1 전자 장치가 결정한 BIG 정보 및/또는 PA 전송 정보를 수신 및/또는 확인 할 수 있다. 상기 BIG 정보는 BIS 데이터에 대한 암호화(encryption) 여부, 암호화 여부에 따른 암호화 키 (encryption key), 피지컬 링크 타입(physical link type), 액세스 주소(access address), 채널 맵(channel map), 프레이밍 모드(framing mode), 데이터 전송 시점 및 구간에 관한 정보, 전송 파워(Tx power) 중에서 적어 도 하나를 포함할 수 있다. 상기 PA 정보는 PA 전송 시점 및 구간에 관한 정보, 전송 파워(Tx power), PA 인터 벌(interval) 중에서 적어도 하나를 포함할 수 있다. 일 실시예에 따라, 제2 전자 장치는 BLE Scan/Advertising, PA 송수신, 및 Wi-Fi와 같은 네트워크 중에서 적어도 하나 이상의 방법을 통해 제1 전자 장 치로부터 PA 전송 정보 및/또는 BIG 정보를 수신할 수 있다. 1530 동작에서, 제2 전자 장치는 제1 전자 장치로부터 수신한 BIG 정보 및/또는 PA 전송 정보에 기반하여 BIG를 생성할 수 있다. 1540 동작에서, 제2 전자 장치는 제 1 전자 장치가 지정한 또는 제 1 전자 장치가 전송 중인, 전송 타이밍(timing)에 맞춰 EA, PA 및/또는 BIS 데이터의 전부 또는 일부를 전송할 수 있다. 도 16은 일 실시예에 따른 복수의 전자 장치들을 포함하는 BIG의 동작을 설명하기 위한 일 예시이다. 도 16을 참조하면, 1601 동작에서, 제1 전자 장치는 BIG 정보를 포함하는 PA(periodic advertising)를 전송할 수 있다. 1602 동작에서 제1 전자 장치는 상기 BIG 정보에 기반하여 제1 채널(left channel)을 통 해 제1 BIS 데이터(left audio data)를 전송할 수 있다. 1603 동작에서 제1 전자 장치는 상기 BIG 정보 에 기반하여 제2 채널(right channel)을 통해 제2 BIS 데이터(right audio data)를 전송할 수 있다. 1601 동작 에서, 제4 전자 장치는 BIG 정보를 포함하는 PA를 제1 전자 장치로부터 수신할 수 있다. 1604 동작 에서, 제4 전자 장치는 상기 BIG 정보에 기반하여 BIS 소스로 동작할 적어도 하나의 전자 장치를 추가할 수 있다. 일 실시예에 따라, 제4 전자 장치는 상기 BIG 정보에 기반하여 제2 전자 장치 및 제3 전 자 장치를 BIS 소스로 추가할 수 있다. 이후, 제2 전자 장치 및 제3 전자 장치 각각은 상기 BIG 정보에 기반하여 1602 동작에서 제1 채널(left channel)을 통해 제1 BIS 데이터(left audio data)를 전송 할 수 있다. 예를 들어, 제2 전자 장치 및 제3 전자 장치는 제1 전자 장치와 동기화 되어 제 1 BIS 데이터(left audio data)를 전송할 수 있다. 제2 전자 장치 및 제3 전자 장치 각각은 상기 BIG 정보에 기반하여 1603 동작에서 제2 채널(right channel)을 통해 제2 BIS 데이터(right audio data)를 전 송할 수 있다. 예를 들어, 제2 전자 장치 및 제3 전자 장치는 제1 전자 장치와 동기화 되어 제2 BIS 데이터(right audio data)를 전송할 수 있다. 1605 동작에서, 제4 전자 장치는 상기 BIG 정보에 기반하여 제5 전자 장치가 제1 채널(left channel)만을 통해 BIS 데이터를 수신하도록 제어 및/또는 명령(command)할 수 있다. 1606 동작에서, 제4 전자 장치는 상기 BIG 정보에 기반하여 제6 전자 장치가 제2 채널(right channel)만을 통해 BIS 데이터 를 수신하도록 제어 및/또는 명령(command)할 수 있다. 일 실시예에 따라, 제4 전자 장치는 BIS Assistant 전자 장치로, 제5 전자 장치 및 제6 전자 장치와 연결 시 제5 전자 장치 및 제6 전자 장치로부터 선호되는 채널(Channel) 정보를 획득할 수 있다. 일 실시예에 따라, 제5 전자 장치 및 제6 전자 장치는 제4 전자 장치에 의해 제어되며 쌍(pair)을 이루는 오디오 장치(예를 들어, 이어폰)로 구현될 수 있다. 1607 동작에서, 제5 전자 장치는 제1 채널(left channel)을 통해 제1 전자 장치로부터 전송되는 제1 BIS 데이터(left audio data)를 수신할 수 있다. 1608 동작에서, 제6 전 자 장치는 제2 채널(right channel)을 통해 제1 전자 장치로부터 전송되는 제2 BIS 데이터(rightaudio data)를 수신할 수 있다. 일 실시예에 따라, 제5 전자 장치 및 제6 전자 장치가 제1 전자 장치로부터 임계 거리 이상 으로 멀어지면, 제5 전자 장치 및 제6 전자 장치는 다른 BIS 소스인 제2 전자 장치 및/또는 제3 전자 장치로부터 BIS 데이터를 수신할 수 있다. 일 실시예에 따라, 제5 전자 장치 및 제6 전자 장치는 BIG 정보에 따라 끊김 없이 제2 전자 장치 및/또는 제3 전자 장치로부터 BIS 데이터 를 수신할 수 있다. 일 실시예에 따라, 제2 전자 장치 및/또는 제3 전자 장치는 제1 전자 장치 와 SDU까지 동기화하기 위해서는 동일 음원을 보유하거나 네트워크를 통해 동일 음원을 지속적으로 공유 받을 수 있다. 도 17은 일 실시예에 따른 BIG 정보의 일 예시를 나타낸다. 도 17을 참조하면, BIS 소스 호스트로 동작하는 제1 전자 장치는 BIG 정보를 결정할 수 있다. 일 실시예에 따라, BIG 정보는 정보의 길이(length), BIG 정보임을 지시하는 데이터 타입, BIG 오프셋, BIG 오프셋 단위, ISO 인터벌, NUM BIS, NSE, BN, sub interval, PTO, BIS spacing, IRC, Max PDU, Framing mode, seed access address, SDU interval, Max SDU Size, 또는 channel map 중에서 적어도 하나를 포함할 수 있다. BIS 소스 호 스트로 동작하는 제1 전자 장치가 결정하는 BIG 정보는 BIS 서비스 타입(service type), BIS 서비스가 수행될 전자 장치의 종류, 개수, 위치 정보 중에서 적어도 하나의 기준에 의해, BIG 그룹 내 전자 장치들 모두 동일하 게 또는 일부의 전자 장치들만 동일하게 설정될 수 있다. 일 실시예에 따라, 제 1 전자 장치가 미디어 타입(media type), 대화 타입(conversational type)과 같이 다양 한 BIS 서비스 타입을 수행하는 경우, 제 1 전자 장치는 미리 정의된 BIG 파라미터들을 기반으로 BIS service를 수행할 수 있다. 일 실시예에 따라, 제1 전자 장치는 BIS 서비스를 수행하지 않고, 제2 전자 장치, 제3 전자 장 치, 및/또는 제4 전자 장치가 미디어 타입(media type), 대화 타입(conversational type)과 같이 다양한 BIS 서비스 타입을 수행하는 경우, 제2 전자 장치, 제3 전자 장치, 및/또는 제4 전자 장치의 위치를 고려하여 간섭 을 최소화 할 수 있도록 각 전자 장치들의 차별적인 전송 파워(Tx power)가 설정될 수 있다. 일 실시예에 따라, 제1 전자 장치는 BIS 서비스를 수행하지 않고, 제2 전자 장치, 제3 전자 장치, 및/또는 제4 전자 장치가 미디어 타입(media type), 대화 타입(conversational type)과 같이 다양한 BIS 서비스 타입을 수행하는 경우, 각 전자 장치들의 전류 소모 및 효용성을 고려하여, 하나의 BIG이지만 각 전자 장치가 상이한 전송 기회를 가질 수 있도 록 설정될 수 있다. 일 실시예에 따라, 제2 전자 장치, 제3 전자 장치, 및/또는 제4 전자 장치가 하나의 BIG로 동작하지만 서로 상이한 전송 능력을 갖는 경우 각 전자 장치들 각각은 서로 다른 전송 설정으로 동작할 수 있 다. 일 실시예에 따라, 제2 전자 장치, 제3 전자 장치, 및/또는 제4 전자 장치가 동일한 액세스 주소(access address), 채널 맵(channel map), 암호화 키(encryption key), 타이밍(timing)을 기반으로 BIS 데이터를 전송 하지만, 전송 횟수, PTO 사용 여부와 같이 세부적인 BIS 데이터 전송 설정은 달리 구성될 수 있다. 이때, 세부 적인 BIS 데이터 전송 설정의 차이가 있는 경우라도, 최종적으로 전송되는 PA 정보에는 모든 BIS 데이터 전송을 포괄할 수 있는 정보가 포함될 수 있다. 일 실시예에 따라, 제 1 전자 장치는 BIG 정보에 대한 결정 요청을 확인 및/또는 수신한 경우, BIS 서비스가 수 행될 전자 장치의 종류, 개수, 위치 정보, 제공 언어와 같이 다양한 정보를 고려할 수 있다. 일 실시예에 따라, 제 1 전자 장치는 해당 BIG에서 암호화(encryption) 적용 여부, 암호화에 따른 암호화 키 (encryption key), 사용할 피지컬 링크 타입(physical link type), 오디오 채널(audio channel)의 종류 및 개 수, 오디오 채널 별로 사용할 액세스 주소(access address), 초기 채널 맵(channel map), 채널 맵 업데이트 (channel map update) 방법, 프레이밍(framing mode), 세부 전송 정보를 포함한 BIG 파라미터들을 포함하는 BIG 정보, PA 인터벌(interval), PA 및 BIS 데이터 전송 타이밍, 브로드캐스트 ID(Broadcast_ID), 프로그램 정 보(program_Info), BIS 오디오의 음원 및 언어, 전송 파워(Tx power), 전송 파워 제어(x power control) 방법, 및 PA 전송 정보 중에서 적어도 하나 이상의 정보를 결정할 수 있다. 도 18은 일 실시예에 따라 전자 장치에 의해 설정되는 BIG 정보의 일 예시를 나타낸다. 도 18을 참조하면, BIS 소스 호스트로 동작하는 제1 전자 장치는 BIG에 속하는 제2 전자 장치, 제3 전자 장치, 제4 전자 장치 모두에 동일한 BIG 파라미터들이 적용되도록 BIG 정보를 설정할 수 있다. 제1 전자 장치는 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치가 PA를 전송하도록 설정하고, PA 인터벌을 예를 들어, 50ms로 설 정하고, 전송 파워를 예를 들어, 20dBm으로 설정하고, NSE 값(예를 들어, 6), IRC 값(예를 들어, 2), 및 PTO 값(예를 들어, 1)을 설정할 수 있다. 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치는 동일한 전송 타이밍에 PA 및 BIS 데이터를 전송할 수 있다. 도 19는 일 실시예에 따라 전자 장치에 의해 설정되는 BIG 정보의 일 예시를 나타낸다. 도 19를 참조하면, BIS 소스 호스트로 동작하는 제1 전자 장치는 동일한 BIG에 속하는 제2 전자 장치, 제3 전자 장치, 제4 전자 장치 각각에 서로 다른 BIG 파라미터들이 적용되도록 BIG 정보를 설정할 수 있다. 제1 전자 장 치는 제2 전자 장치가 PA를 전송하도록 설정하고, PA 인터벌을 예를 들어, 50ms로 설정하고, 전송 파워를 예를 들어, 16dBm으로 설정하고, NSE 값(예를 들어, 4), IRC 값(예를 들어, 2), 및 PTO 값(예를 들어, 0)을 설정할 수 있다. 제1 전자 장치는 제3 전자 장치가 PA를 전송하지 않도록 설정하고, 전송 파워를 예를 들어, 20dBm으로 설정하고, NSE 값(예를 들어, 6), IRC 값(예를 들어, 2), 및 PTO 값(예를 들어, 1)을 설정할 수 있다. 제1 전자 장치는 제4 전자 장치가 PA를 전송하지 않도록 설정하고, 전송 파워를 예를 들어, 12dBm으로 설정하고, NSE 값 (예를 들어, 2), IRC 값(예를 들어, 2), 및 PTO 값(예를 들어, 0)을 설정할 수 있다. 일 실시예에 따라, BIS 소스 호스트로 동작하는 제 1 전자 장치는 필요에 따라 직접 BIG를 생성할 수 있다. 제 1 전자 장치는 생성된 BIG에 기반하여 BIS 데이터를 전송할 수 있고, 또는 다른 전자 장치들의 타이밍(timing) 정보 및 BIG 정보 동기화를 유도할 목적으로 빈 PDU만 전송할 수 있다. 이는 네트워크를 통한 전송 타이밍(Tx timing) 동기화보다 더 정밀한 전송 타이밍(Tx timing) 조율이 필요하거나, 다수의 전자 장치들을 사용자가 가 까운 거리에서 직접 제어할 수 있는 경우에 사용될 수 있다. 예를 들어, 제2 전자 장치, 제3 전자 장치, 제4 전자 장치가 제 1 전자 장치와 동일한 전송 타이밍(Tx timing) 을 기반으로 동작해야 하고 제1 전자 장치와 BT/BLE 링크 생성을 통한 직접 연결이 어려운 경우, 제1 전자 장치 는 결정된 BIG 정보를 이용하여 BIG를 직접 생성하고, PA와 BIS 데이터를 전송함으로써, 제2 전자 장치, 제3 전 자 장치, 제4 전자 장치와의 빠르고 정확한 BIG 동기화를 유도할 수 있다. 일 실시예에 따라, 제1 전자 장치는 PA만 전송하고, BIS 데이터는 직접 전송하지 않을 수도 있다. 도 20a 내지 도 20d는 전자 장치가 BIG를 생성하고 PA 및/또는 BIS 데이터의 전부 또는 일부를 전송하는 예시들 을 나타낸다. 도 20a 내지 도 20d는 설명의 편의를 위한 예시들이며, 본 개시의 기술적 사상은 이에 한정되지 않고, 도 20a 내지 도 20d의 예시들이 다양하게 조합되어 구현될 수 있다. 도 20a 내지 도 20d는 설명의 편의를 위한 예시들이며, 전자 장치는 BIG를 생성하고 PA 및/또는 BIS 데이터의 전부 또는 일부를 다양한 형태로 전송 할 수 있다. 도 20a는 일 실시예에 따라 전자 장치가 BIG를 생성하고, PA만 전송하는 예시를 나타낸다. 도 20a를 참조하면, 제1 전자 장치는 BIG를 생성하고 PA만 전송하고 BIS 데이터는 전송하지 않을 수 있다. 동일한 BIG 에 속하는 제2 전자 장치는 제1 전자 장치가 생성한 BIG 정보에 기반하여 제1 채널을 위한 제1 BIS 데이터(RO,R1,RO,R1) 및 제2 채널을 위한 제2 BIS 데이터(L0,L1,L0)를 전송할 수 있다. 도 20b는 일 실시예에 따라 전자 장치가 BIG를 생성하고, PA와 빈 PDU를 전송하는 예시를 나타낸다. 도 20b를 참조하면, 제1 전자 장치는 BIG를 생성하고, PA를 전송하고, 빈(empty) PDU들(2022, 2024)를 일부 시간 구간에서 전송할 수 있다. 동일한 BIG에 속하는 제2 전자 장치는 제1 전자 장치가 생성한 BIG 정보에 기반하여 제1 채널을 위한 제1 BIS 데이터(RO,R1,RO,R1) 및 제2 채널을 위한 제2 BIS 데이터(L0,L1,L 0)를 전송할 수 있다. 일 실시예에 따라, 제1 전자 장치는 빈(empty) PDU를 제2 전자 장치로 전송하고, 제2 전자 장치 는 빈(empty) PDU를 기반으로 정확한 전송 타이밍을 연산할 수 있다. 일 실시예에 따라, 제2 전자 장치 는, 제2 전자 장치의 장치 타입(device type)에 맞는 다양한 입력에 따른 사용자의 의도, BIS 서비 스와 관련된 특정 어플리케이션 실행, 또는 제2 전자 장치와 통신 링크가 형성된 외부 전자 장치의 요청 과 같은 다양한 방법에 의해, 제1 전자 장치가 결정한 BIG 정보를 수신하고, BIG 정보를 기반으로 BIG를 생성할 수 있다. 제2 전자 장치는 제1 전자 장치 또는 다른 전자 장치와 BT/BLE 링크 생성을 통한 직접 연결, 또는 BLE Scan/Advertising, PA 송신, Wi-Fi와 같은 다른 네트워크를 통한 통신 방법과 같은 다양한 방법을 통해, 제1 전자 장치가 결정한 BIG 정보를 수신 또는 확인할 수 있다. 일 실시예에 따라, 제2 전자 장치는 제1 전자 장치의 PA를 수신하고, 제1 전자 장치로부터 전송되는 BIS 데이터를 수신하여, 제1 전자 장치의 BIS 데이터 전송 타이밍을 포함하는 BIG 상세 정보를 수신 및/또는 확인할 수 있다. 일 실시예에 따라, 제2 전자 장치는 제1 전자 장치와 생성한 통신 링크를 통해, BIS 데이터 전송 타이밍을 포함한 BIG 정보를 수신 및/또는 확인할 수 있다. 일 실시예에 따라,제2 전자 장치는 제1 전자 장치가 결정한 BIG 정보를 이용하여 timing 및 사용 채널까지 동기화할 수 있는 모든 BIG 정보가 아닌, Broadcast_ID, Access Address, 또는 Program info와 같이 제1 전자 장치 가 결정한 BIG 정보와 관련된 적어도 하나의 정보만 수신 및/또는 확인할 수 있다. 일 실시예에 따라, 제 2 전자 장치는 PA 수신 및 BIS 데이터 수신 이외에, 제1 전자 장치로부터 제1 전자 장치가 정의한 세부 전송 정보도 수신할 수 있다. 세부 전송 정보는 PA 전송 여부, PA 전송 시 Interval 또는 Skip 개 수, Tx power, NSE/IRC/PTO 정보, 및/또는 사용 언어 정보를 포함할 수 있다. 도 20c는 일 실시예에 따라 전자 장치가 BIG를 생성하고, PA와 빈 PDU를 전송하는 예시를 나타낸다. 도 20c를 참조하면, 제1 전자 장치는 BIG를 생성하고, PA를 전송하고, 빈(empty) PDU들(2031~2037)을 주기 적으로 전송할 수 있다. 동일한 BIG에 속하는 제2 전자 장치는 제1 전자 장치가 생성한 BIG 정보에 기반하여 제1 채널을 위한 제1 BIS 데이터(RO,R1,RO,R1) 및 제2 채널을 위한 제2 BIS 데이터(L0,L1,L0)를 전송 할 수 있다. 도 20d는 일 실시예에 따라 전자 장치가 BIG를 생성하고, PA와 BIS 데이터를 전송하는 예시를 나타낸다. 도 20d 를 참조하면, 제1 전자 장치는 BIG를 생성하고, PA, 제1 채널을 위한 제1 BIS 데이터 (RO,R1,RO,R1) 및 제2 채널을 위한 제2 BIS 데이터(L0,L1,L0)를 전송할 수 있다. 동일한 BIG에 속하는 제2 전 자 장치는 제1 전자 장치가 생성한 BIG 정보에 기반하여 동일한 제1 채널을 위한 제1 BIS 데이터 (RO,R1,RO,R1) 및 제2 채널을 위한 제2 BIS 데이터(L0,L1,L0)를 제1 전자 장치와 동일한 타이밍에 전송 할 수 있다. BIG를 생성하고 BIS 데이터를 전송하는 복수의 BIS 소스 장치들은 PDU 전송 타이밍(timing) 및 RF 채널 (channel)을 동기화하여 하나의 BIS 소스 장치가 하나의 BIG를 생성하고 BIS 서비스를 수행하는 것처럼 동작할 수 있다. 다만, 이는 PDU 전송 동기화를 통한 하나의 BIG 생성에 대한 방법으로, 실제 전자 장치들로부터 전송 되는 페이로드(payload)에 포함된 데이터(또는 오디오 데이터)까지 동일한 데이터(또는 오디오 데이터)임은 보 장되지 않을 수 있다. 필요에 따라, 이를 해결하기 위해 복수의 BIS 소스 장치들은 전송되는 PDU에 매칭되는 SDU까지 동기화하여 동작할 수 있도록 요청하거나, 미리 정해진 방법들을 사용할 수 있다. 일 실시예에 따라, 전자 장치는 BIG 정보 결정 시 추후 전송되는 PDU에 매칭되는 SDU의 정보를 정의할 수 있다. 일 실시예에 따라, 복수의 전자 장치들 간 동일한 오디오 데이터를 사용할 것이 결정되고, 결정된 오디오 데이터를 기준으로 PDU의 페이로드 카운터(payload counter)에 맞춰 전송되어야 하는 SDU의 시퀀스 넘버(sequence number)가 동기화될 수 있다. BIS 소스 장치들 간 핸드오버(handover)를 고려해야 하는 경우와 같이 BIS 서비스 시나리오에 따라 필수적으로 정확한 SDU 동기화가 요구될 수도 있다. 도 21은 일 실시예에 따른 전자 장치 내부에서 PDU에 상응하는 SDU를 전달하는 동작의 예시를 나타낸다. 도 21을 참조하면, 전자 장치 내 호스트는 AP(application processor)로 구현되고, 전자 장치 내 컨트롤 러는 통신 프로세서(communication processor) 또는 BT(Bluetooth) 통신 회로로 구현될 수 있다. 전자 장치 내 호스트는 제1 SDU(Rx-1, Lx-1)을 동일한 전자 장치 내 컨트롤러로 전달하고, 전자 장치 내 컨트롤러는 제1 SDU(Rx-1, Lx-1)에 상응하는 제1 PDU(Rk, Lk)가 전송되도록 제어할 수 있다. 전자 장치 내 호스트는 제2 SDU(Rx, Lx)을 동일한 전자 장치 내 컨트롤러로 전송하고, 전자 장치 내 컨트롤러 는 제2 SDU(Rx, Lx)에 상응하는 제2 PDU(Rk+1, Lk+1)가 전송되도록 제어할 수 있다. 일 실시예에 따라, PDU의 전송 시점은 이미 동기화 된 상태에서, PDU가 전송되는 시점에 동일한 순서의 SDU가 포함될 수 있도록 BIS 데이터의 호스트에서 컨트롤러로의 전송 타이밍이 동기화될 수 있다. 도 22는 일 실시예에 따른 전자 장치들 간 동일한 SDU를 동일한 PDU에 전송하기 위한 동작의 예시를 나타낸다. 제2 전자 장치는 제1 전자 장치에서 전송되는 BIG 정보를 수신할 수 있다. 상기 BIG 정보는 BIS 데이터에 대한 전송 시간 정보, 상기 BIS 데이터에 대한 전송 파워(Tx power), PA에 대한 전송 시간 정보, 및 상기 PA에 대한 전송 파워, 상기 BIS 데이터에 대한 암호화(encryption) 여부에 대한 정보, 피지컬 링크 타입(physical link type), 액세스 주소(access address), 채널 맵(channel map), 및 프레이밍 모드(framing mode) 중 적어도 일부 를 포함할 수 있다. 일 실시예에 따라, 제2 전자 장치는 상기 BIG 정보에 포함되는 BIS 데이터에 대한 전송 시 간 정보, 및/또는 PA에 대한 전송 시간 정보에 기반하여 제1 전자 장치와 동기화를 구성할 수 있다. 도 22를 참조하면, 제2 전자 장치 내 제2 호스트는 AP(application processor)로 구현되고, 제2 전자 장 치 내 제2 컨트롤러는 통신 프로세서(communication processor) 또는 BT(Bluetooth) 통신 회로로 구현될 수 있다. 제3 전자 장치 내 제3 호스트는 AP(application processor)로 구현되고, 제3 전자 장치 내 제3컨트롤러는 통신 프로세서(communication processor) 또는 BT(Bluetooth) 통신 회로로 구현될 수 있다. 제2 전자 장치와 제3 전자 장치가 동일한 PDU를 전송하도록 각 전자 장치 내부에서 전달되는 SDU가 동기화될 수 있다. 제2 전자 장치 내 제2 호스트는 제1 SDU(Rx-1, Lx-1)을 제2 전자 장치 내 제2 컨트롤러로 전송하고, 제2 전자 장치 내 제2 컨트롤러는 제1 SDU(Rx-1, Lx-1)에 상응하는 제1 PDU(Rk,Lk)가 전송되 도록 제어할 수 있다. 동일한 타이밍에, 제3 전자 장치 내 제3 호스트는 제1 SDU(Rx-1, Lx-1)을 제3 전자 장치 내 제3 컨트롤러로 전송하고, 제3 전자 장치 내 제3 컨트롤러는 제1 SDU(Rx-1, Lx-1)에 상응 하는 제1 PDU(Rk,Lk)가 전송되도록 제어할 수 있다. 제2 전자 장치 내 제2 호스트는 제2 SDU(Rx, Lx)을 동일한 제2 전자 장치 내 제2 컨트롤러로 전송 하고, 제2 전자 장치 내 제2 컨트롤러는 제2 SDU(Rx, Lx)에 상응하는 제2 PDU(Rk+1, Lk+1)가 전송되도록 제어할 수 있다. 동일한 타이밍에, 제3 전자 장치 내 제3 호스트는 제2 SDU(Rx, Lx)를 제3 전자 장치 내 제3 컨트롤러로 전송하고, 제3 전자 장치 내 제3 컨트롤러는 제2 SDU(Rx, Lx)에 상응하는 제2 PDU(Rx+1, Lx+1)가 전송되도록 제어할 수 있다. 도 23은 일 실시예에 따라 출력 기능을 갖는 전자 장치가 BIS 데이터를 수신 및 처리하는 동작의 예시를 나타낸 다. 도 23은 스테레오(stereo)를 처리하는 외부 전자 장치(또는 제4 전자 장치)를 표현한 것으로, 스피커 (speaker) 형태와 같은 외부 전자 장치가 다수의 BIS 소스들이 동시에 전송하는 BIS 데이터 중 정상적으로 수신 한 BIS 데이터를 출력할 수 있음을 나타낸다. 도 23을 참조하면, 제4 전자 장치는 제2 전자 장치로 부터 BIS 데이터(R0) 및 BIS 데이터(L1)를 수신하고, 제3 전자 장치로부터 BIS 데이터(L0)를 수신할 수 있다. 제4 전자 장치는 다른 전자 장치가 수신한 PA 정보를 전달 받거나 또는 직접 스캔(scan)을 통해 전 자 장치들이 전송하는 PA를 수신하여 BIG 정보를 획득하고, 획득한 BIG 정보를 기반으로 BIS 데이터를 수신 및/ 또는 출력할 수 있다. 도 24는 일 실시예에 따라 전자 장치의 이동에 따른 연속적인 BIS 데이터 수신 동작의 예시를 나타낸다. 도 24를 참조하면, 제1 전자 장치, 제2 전자 장치, 제3 전자 장치, 제4 전자 장치는 BIS 소스로 동작하고, 제5 전자 장치는 BIS 싱크로 동작할 수 있다. 제5 전자 장치는 제1 전자 장 치, 제2 전자 장치, 제3 전자 장치, 또는 제4 전자 장치 중에서 어느 하나가 전송하는 BIS 데이터를 수신하는 중에 이동할 수 있고, BIS 데이터를 전송하는 전자 장치와 멀어짐에 따라 약전계가 되어 BIS 데이터 수신이 어려워 질 수 있다. 다만, 제5 전자 장치가 이동 시 하나의 BIG로 동작하는 다른 전자 장치들(제1 전자 장치, 제2 전자 장치, 제3 전자 장치, 또는 제4 전자 장치 중에서 적어도 하나)이 위치하고 있다면, 가까운 위치에서 전송되는 BIS 데이터가 수신되어, BIS 데이터 수신의 누락 없이 BIS 데이터를 수신 및/또는 출력할 수 있다. 도 25는 일 실시예에 따라 전자 장치의 판단에 따라 동일한 BIG를 재 동기화하는 동작의 예시를 나타낸다. 도 25를 참조하면, 제1 전자 장치, 제2 전자 장치, 제3 전자 장치, 및 제4 전자 장치(254 0)는 BIS 소스로 동작하고, 제5 전자 장치는 BIS 싱크로 동작할 수 있다. 제1 전자 장치, 제2 전자 장치, 제3 전자 장치, 제4 전자 장치, 제5 전자 장치 각각에는 브로드캐스트 ID가 설 정될 수 있다. 제5 전자 장치가 제1 전자 장치으로부터 BIS 데이터를 수신하는 중에 이동 시 BIS 데이터를 제공할 수 있는 제2 전자 장치, 제3 전자 장치, 제4 전자 장치 중에서 브로드캐스 트 ID를 기반으로 BIS 재 검색 및/또는 BIS 수신을 위한 동기화(synchronization)를 수행할 수 있다. 제5 전자 장치는 제1 전자 장치가 송신하는 BIS 데이터의 신호가 약해지는 것과 같은 특정 기준에 의해, 제1 전자 장치를 통해서 또는 스스로 스캔하여, 주변에 이미 동기화된 BIG와 동일 목적의 BIG가 있 는지를 스캔하고 스캔된 정보들 중 적어도 하나 이상의 정보를 이용해 동일 목적의 BIG 존재 여부를 판단할 수 있다. 이후 제5 전자 장치는 필요 시 이미 동기화되어 있던 BIG를 종료시킨 후, 새로 검색한 BIG에 동기 화할 수 있다. 예를 들어, 제5 전자 장치가 Broadcast_ID: 0x 79 02 06을 가지는 BIG에 동기화하여 BIS 데이터를 수신 하고 있는 상태에서, 물리적 거리 차이 발생에 의해 해당 BIS 데이터의 수신 감도가 일정 수준 이하로 떨어지는 경우, 스캔을 재 시작하고 주변에 동일한 Broadcast_ID: 0x 79 02 06을 가지는 BIG가 있는지를 확인할 수 있다. 동일한 Broadcast_ID를 가지는 BIG가 검색되고, 해당 BIG의 수신 감도가 현재 동기화된 BIG보다 더 우수하다 판 단되는 경우, 제5 전자 장치는 기존 동기화되어 있던 BIG를 종료시키고 새로운 BIG에 동기화하여 BIS 데이터를 수신할 수 있다. 이는 단순히 Broadcast_ID에 한정되는 동작이 아닌, 동일 프로그램 정보(Program Info), 동일 Access Address와 같이, 특정 BIG를 표현할 수 있는 정보들 중 적어도 하나 이상의 정보를 이용할 수 있다. 도 26은 일 실시예에 따라 BIG 정보를 생성하는 제1 전자 장치의 동작을 설명하기 위한 도면이다. 도 26을 참조하면, 2610 동작에서, 제1 전자 장치(도 1의 101; 도 3의 300)는 적어도 하나의 BIS(broadcast isochronous stream) 소스 장치로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인할 수 있다. 2620 동작에서, 제1 전자 장치(도 1의 101; 도 3의 300)는 상기 BIG에 대한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들을 포 함하는 BIG 정보를 생성할 수 있다. 2630 동작에서, 제1 전자 장치(도 1의 101; 도 3의 300)는 제2 전자 장치가 상기 BIG에 대한 상기 복수의 파라미터들을 적용할 수 있도록, 상기 BIG에 대한 상기 복수의 파라미터들을 포함 하는 상기 BIG 정보를 전송할 수 있다. 일 실시예에 따른, 전자 장치(도 1의 101; 도 3의 300)는, 통신 회로(도 1의 190) 및 상기 통신 회로에 연결된 적어도 하나의 프로세서(도 1의 120)를 포함할 수 있다. 상기 적어도 하나의 프로세서는 상기 전자 장치를 포함 하는 복수의 BIS(broadcast isochronous stream) 소스 장치들로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인할 수 있다. 상기 적어도 하나의 프로세서는 상기 BIG에 대한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하 여 상기 BIG를 생성할 수 있다. 상기 적어도 하나의 프로세서는 상기 BIG에 대한 상기 복수의 파라미터들에 기 반하여, PA(periodic advertising) 및 BIS 데이터를 전송하도록 제어할 수 있다. 일 실시예에 따라, 상기 BIG 에 대한 상기 요청은, 상기 제1 전자 장치에서의 사용자 입력, 상기 제1 전자 장치에서의 어플리케이션 실행, 외부 전자 장치로부터 수신한 요청, 상기 제1 전자 장치의 위치 정보, 및 상기 제1 전자 장치의 네트워크 연결 정보 중에서 적어도 하나에 기반하여 확인될 수 있다. 일 실시예에 따라, 상기 BIG에 대한 상기 복수의 파라미터들은, 상기 BIS 데이터에 대한 전송 시간 정보, 상기 BIS 데이터에 대한 전송 파워(Tx power), 상기 PA에 대한 전송 시간 정보, 및 상기 PA에 대한 전송 파워 중 적 어도 일부를 포함할 수 있다. 일 실시예에 따라, 상기 BIG에 대한 상기 복수의 파라미터들은, 상기 BIS 데이터 에 대한 암호화(encryption) 여부에 대한 정보, 피지컬 링크 타입(physical link type), 액세스 주소(access address), 채널 맵(channel map), 및 프레이밍 모드(framing mode) 중 적어도 일부를 더 포함할 수 있다. 일 실시예에 따라, 상기 적어도 하나의 프로세서(도 1의 120)는, 상기 BIG에 대한 상기 복수의 파라미터들을 포 함하는 BIG 정보를 상기 복수의 BIS 소스 장치들 중에서 적어도 하나로 전송하도록 제어할 수 있다. 일 실시예 에 따라, 제5항에 있어서, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 상기 BIG 정보는, BLE 어드벌타 이징(advertising), PA 송수신, 또는 외부 네트워크를 통해 전송될 수 있다. 일 실시예에 따라, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 상기 BIG 정보는, 상기 복수의 BIS 소 스 장치들 중에서 제1 소스 장치에 대한 복수의 파라미터들을 포함하는 제1 BIG 정보; 및 상기 복수의 BIS 소스 장치들 중에서 제2 소스 장치에 대한 복수의 파라미터들을 포함하는 제2 BIG 정보를 포함할 수 있다. 일 실시예에 따라, 상기 제1 BIG 정보에 기반하여 상기 제1 소스 장치의 PA 전송 여부, 상기 제1 소스 장치의 전송 파워, 상기 제1 소스 장치가 전송하는 BIS 데이터에 대한 제1 NSE(number of subevent), 제1 IRC(immediate repetition count), 및 제1 PTO(pre-transmission offset) 중 적어도 하나가 설정될 수 있다. 일 실시예에 따라, 상기 제2 BIG 정보에 기반하여 상기 제2 소스 장치의 PA 전송 여부, 상기 제2 소스 장치의 전송 파워, 상기 제2 소스 장치가 전송하는 BIS 데이터에 대한 제2 NSE, 제2 IRC, 및 제2 PTO 중 적어도 하나가 설정될 수 있다. 일 실시예에 따라서, 컴퓨터로 독출 가능한 적어도 하나의 인스트럭션을 저장한 저장 매체가 제공될 수 있다. 상기 적어도 하나의 인스트럭션은, 적어도 하나의 프로세서에 의하여 실행 시에, 전자 장치(도 1의 101; 도 3의 300)로 하여금, 복수 개의 동작들을 수행하도록 야기할 수 있다. 상기 복수 개의 동작들은, 적어도 하나의 BIS(broadcast isochronous stream) 소스 장치로부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 요청을 확인하는 동작을 포함할 수 있다. 상기 복수 개의 동 작들은, 상기 BIG에 대한 복수의 파라미터들을 결정하고, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 BIG 정보를 생성하는 동작을 포함할 수 있다. 상기 복수 개의 동작들은, 상기 BIG에 대한 상기 복수의 파라미터 들을 적용할 수 있도록, 상기 BIG에 대한 상기 복수의 파라미터들을 포함하는 상기 BIG 정보를 전송하는 동작을포함할 수 있다. 도 27은 일 실시예에 따라 BIG 정보를 수신하는 제2 전자 장치의 동작을 설명하기 위한 도면이다. 도 27을 참조하면, 2710 동작에서, 제2 전자 장치(도 1의 101; 도 3의 300)는, 적어도 하나의 BIS(broadcast isochronous stream) 소스 장치들부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 복수의 파라미터들을 포함하는 BIG 정보를 제1 전자 장치로부터 수 신할 수 있다. 2720 동작에서, 제2 전자 장치(도 1의 101; 도 3의 300)는, 상기 BIG에 대한 상기 복수의 파라미 터들에 기반하여 상기 BIG를 생성할 수 있다. 2730 동작에서, 제2 전자 장치(도 1의 101; 도 3의 300)는, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터 중에서 적어도 일부 를 전송할 수 있다. 일 실시예에 따라서, 컴퓨터로 독출 가능한 적어도 하나의 인스트럭션을 저장한 저장 매체가 제공될 수 있다. 상기 적어도 하나의 인스트럭션은, 적어도 하나의 프로세서에 의하여 실행 시에, 전자 장치(도 1의 101; 도 3의 300)로 하여금, 복수 개의 동작들을 수행하도록 야기할 수 있다. 상기 복수 개의 동작들은, 적어도 하나의 BIS(broadcast isochronous stream) 소스 장치들부터 복수의 BIS 싱크 장치들로 BIS 데이터가 스트리밍되도록 설정된 BIG(broadcast isochronous group)에 대한 복수의 파라미터들을 포함하는 BIG 정보를 제1 전자 장치로 부터 수신하는 동작을 포함할 수 있다. 상기 복수 개의 동작들은, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여 상기 BIG를 생성하는 동작을 포함할 수 있다. 상기 복수 개의 동작들은, 상기 BIG에 대한 상기 복수의 파라미터들에 기반하여, PA(periodic advertising) 및 BIS 데이터 중에서 적어도 일부를 전송하는 동작을 포함 할 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7a 도면7b 도면8a 도면8b 도면8c 도면9 도면10 도면11a 도면11b 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20a 도면20b 도면20c 도면20d 도면21 도면22 도면23 도면24 도면25 도면26 도면27"}
{"patent_id": "10-2023-0117841", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 네트워크 환경 내의 전자 장치를 개략적으로 도시한 블록도이다. 도 2는 일 실시예에 따른, 오디오 모듈의 블록도이다. 도 3은 일 실시예에 따른 복수의 전자 장치들의 동작 예시를 나타낸다. 도 4는 일 실시예에 따른 링크 레이어 패킷 포맷(link layer packet format)을 나타낸다. 도 5는 일 실시예에 따른 EA(extended advertising) 및 PA(periodic advertising) 이벤트를 설명하기 위한 도 면이다. 도 6은 일 실시예에 따른 BIG 이벤트 및 BIS 이벤트를 설명하기 위한 도면이다. 도 7a는 일 실시예에 따른 순차 배열(sequential arrangement)을 갖는 BIS들의 예시를 나타낸다. 도 7b는 일 실시예에 따른 교차 배열(interleaved arrangement)을 갖는 BIS들의 예시를 나타낸다. 도 8a 내지 도 8c 각각은 일 실시예에 따른 BIS 내 페이로드 할당의 예시를 나타낸다. 도 9는 일 실시예에 따른 복수의 전자 장치들이 하나의 BIG로 동기화되어 BIS 데이터 및 PA를 전송하는 일 예시 를 나타낸다. 도 10은 일 실시예에 따른 복수의 전자 장치들이 하나의 BIG로 동기화되고, BIS 데이터 전송과 PA 전송이 달리 설정되는 일 예시를 나타낸다. 도 11a는 일 실시예에 따른 복수의 전자 장치들이 네트워크를 통해 하나의 BIG로 동기화되는 일 예시를 나타낸 다. 도 11b는 일 실시예에 따라 전자 장치가 PA 전송 및 직접 연결을 통해 BIG 정보를 공유하는 예시를 나타낸다. 도 12는 일 실시예에 따른 복수의 전자 장치들이 BIG 생성 커맨드를 통해 하나의 BIG로 동기화되는 일 예시를 나타낸다. 도 13은 일 실시예에 따른 복수의 전자 장치들이 PA를 통해 하나의 BIG로 동기화되는 일 예시를 나타낸다. 도 14는 일 실시예에 따른 BIS 소스 호스트로 동작하는 제1 전자 장치의 동작 방법을 설명하기 위한 순서도이다. 도 15는 일 실시예에 따른 BIS 소스로 동작하는 제2 전자 장치의 동작 방법을 설명하기 위한 순서도이다. 도 16은 일 실시예에 따른 복수의 전자 장치들을 포함하는 BIG의 동작을 설명하기 위한 일 예시이다. 도 17은 일 실시예에 따른 BIG 정보의 일 예시를 나타낸다. 도 18은 일 실시예에 따라 전자 장치에 의해 설정되는 BIG 정보의 일 예시를 나타낸다. 도 19는 일 실시예에 따라 전자 장치에 의해 설정되는 BIG 정보의 일 예시를 나타낸다. 도 20a는 일 실시예에 따라 전자 장치가 BIG를 생성하고, PA만 전송하는 예시를 나타낸다. 도 20b는 일 실시예에 따라 전자 장치가 BIG를 생성하고, PA와 빈 PDU를 전송하는 예시를 나타낸다. 도 20c는 일 실시예에 따라 전자 장치가 BIG를 생성하고, PA와 빈 PDU를 전송하는 예시를 나타낸다. 도 20d는 일 실시예에 따라 전자 장치가 BIG를 생성하고, PA와 BIS 데이터를 전송하는 예시를 나타낸다. 도 21은 일 실시예에 따른 전자 장치 내부에서 PDU에 상응하는 SDU를 전달하는 동작의 예시를 나타낸다. 도 22는 일 실시예에 따른 전자 장치들 간 동일한 SDU를 동일한 PDU에 전송하기 위한 동작의 예시를 나타낸다. 도 23은 일 실시예에 따라 출력 기능을 갖는 전자 장치가 BIS 데이터를 수신 및 처리하는 동작의 예시를 나타낸 다. 도 24는 일 실시예에 따라 전자 장치의 이동에 따른 연속적인 BIS 데이터 수신 동작의 예시를 나타낸다. 도 25는 일 실시예에 따라 전자 장치의 판단에 따라 동일한 BIG를 재 동기화하는 동작의 예시를 나타낸다. 도 26은 일 실시예에 따라 BIG 정보를 생성하는 제1 전자 장치의 동작을 설명하기 위한 도면이다. 도 27은 일 실시예에 따라 BIG 정보를 수신하는 제2 전자 장치의 동작을 설명하기 위한 도면이다."}
