{"patent_id": "10-2022-0029380", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0132179", "출원번호": "10-2022-0029380", "발명의 명칭": "도면 생성 장치, 도면 생성 방법 및 기록 매체", "출원인": "주식회사 하이컴텍", "발명자": "강구만"}}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로세서에 의해 수행되는 도면 생성 방법에 있어서,숫자를 포함하는 수치부 및 기호를 포함하는 분별부를 갖는 제1이미지를 획득하는 제1이미지 획득 단계;상기 제1이미지로부터 상기 수치부 및 상기 분별부를 인식하는 이미지 인식 단계;및인식된 상기 수치부 및 분별부로부터 가공도형의 종류, 사이즈 및 형상에 관한 도면 정보를 획득하는 데이터 생성 단계;를 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 이미지 인식 단계는,제1인공지능모델에 의해 학습된 데이터를 기반으로 상기 수치부의 상기 숫자 및 상기 분별부의 상기 기호를 분류하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 제1이미지는 수량부를 더 포함하며,획득한 상기 도면 정보와 상기 수량부에 기재된 수량을, 재고 관리 시스템에 업로드하는 관리 단계;를 더 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 제1이미지는 가공부를 더 포함하며,획득한 상기 도면 정보와 상기 가공부에 기재된 가공사항을, 재고 관리 시스템에 업로드하는 관리 단계를 더 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,획득한 상기 도면 정보를 이용하여 도면파일의 형태로 메모리에 저장하는 저장 단계;를 더 포함하는, 도면 생성방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,데이터 생성 단계는,상기 분별부의 기호에 따라, 상기 가공도형의 종류를 결정하는 종류 생성 단계 및결정된 상기 가공도형의 종류와 상기 수치부에 따라, 상기 가공도형의 사이즈 및 형상을 결정하는 형상 생성 단계를 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0132179-3-제 6 항에 있어서,상기 종류 생성 단계는,상기 분별부의 기호와 일치하는 것을 기호리스트에서 찾아 가공도형의 종류를 결정하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 이미지 인식 단계에서 상기 수치부 및 상기 분별부 중 적어도 하나를 인식할 수 없거나, 상기 데이터 생성단계에서 상기 분별부로부터 상기 가공도형의 종류를 획득할 수 없는 경우,상기 제1이미지를 정정하도록 알림을 제공하는 알림 단계를 더 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "프로세서;를 포함하는 도면 생성 장치에 있어서,상기 프로세서는, 숫자를 포함하는 수치부 및 기호를 포함하는 분별부를 갖는 제1이미지를 획득하고, 상기 제1이미지로부터 상기 수치부 및 상기 분별부를 인식하고, 인식된 상기 수치부 및 분별부로부터 가공도형의 종류,사이즈 및 형상에 관한 도면 정보를 획득하는, 도면 생성 장치."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "프로세서에 의해 수행되는 도면 생성 방법에 있어서,가도형을 포함하는 가도면의 제2이미지를 획득하는 제2이미지 획득 단계;상기 제2이미지 상의 상기 가도형에 관한 가도형정보를 획득하는 가도형정보 획득 단계; 및상기 가도형정보를 이용하여 제1최종도형을 획득하는 제1최종도형 획득 단계;를 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 가도형정보 획득 단계는,상기 제2이미지의 픽셀의 색을 기준으로 상기 가도형의 외곽을 형성하는 복수의 라인을 인식하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서,상기 제1최종도형을 이용하여 도면파일을 생성하는 단계;를 더 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "프로세서;를 포함하는 도면 생성 장치에 있어서,상기 프로세서는, 가도형을 포함하는 가도면의 제2이미지를 획득하고, 상기 제2이미지 상의 상기 가도형에 관한가도형정보를 획득하고, 상기 가도형정보를 이용하여 제1최종도형을 획득하는, 도면 생성 장치."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "프로세서에 의해 수행되는 도면 생성 방법에 있어서,가도형 및 심볼을 포함하는 가도면의 제3이미지를 획득하는 제3이미지 획득 단계;상기 제3이미지 상의 상기 가도형에 관한 가도형정보를 획득하는 가도형정보 획득 단계;상기 제3이미지 상의 상기 심볼에 관한 심볼정보를 획득하는 심볼정보 획득 단계; 및상기 심볼정보를 상기 가도형정보에 적용하여 제2최종도형을 획득하는 제2최종도형 획득 단계;를 포함하는, 도공개특허 10-2023-0132179-4-면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 가도형정보 획득 단계는,상기 제3이미지의 픽셀의 색을 기준으로 상기 가도형의 외곽을 형성하는 복수의 라인을 인식하는 단계;상기 복수의 라인에 대응하는 복수의 가숫자를 인식하는 단계; 및상기 인식된 복수의 라인 및 상기 인식된 복수의 가숫자에 기초하여 상기 가도형정보를 획득하는 단계;를 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 10 항 또는 제 14 항에 있어서,상기 가도형정보 획득 단계에서 획득한 가도형정보에 따라 상기 가도형이 왜곡 요소를 가지는 경우,상기 왜곡 요소를 제거하는 보정 단계를 더 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 14 항에 있어서,상기 심볼정보 획득 단계는,상기 제3이미지 상에서 상기 가도형 및 상기 심볼을 포함하는 관심영역을 특정하는 단계;상기 관심영역 내에서 제2인공지능모델에 의해 상기 심볼을 분류하는 단계; 및상기 분류된 심볼에 대한 상기 심볼정보를 획득하는 단계;를 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 14 항에 있어서,상기 제2최종도형을 이용하여 도면파일을 생성하는 단계;를 더 포함하는, 도면 생성 방법."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "프로세서;를 포함하는 도면 생성 장치에 있어서,상기 프로세서는, 가도형 및 심볼을 포함하는 가도면의 제3이미지를 획득하고, 상기 제3이미지 상의 상기 가도형에 관한 가도형정보를 획득하고, 상기 제3이미지 상의 상기 심볼에 관한 심볼정보를 획득하고, 상기 심볼정보를 상기 가도형정보에 적용하여 제2최종도형을 획득하는, 도면 처리 장치."}
{"patent_id": "10-2022-0029380", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 1 항 내지 제 8 항, 제 10 항 내지 제 12 항 및 제 14 항 내지 제 18 항 중 어느 한 항에 따른 방법을 수행하는 프로그램이 기록된, 컴퓨터로 판독 가능한 기록 매체."}
{"patent_id": "10-2022-0029380", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 숫자, 기호, 가도형 및 심볼 중 적어도 하나를 포함하는 이미지를 이용하여, 도면에 관한 정보를 획득 하여 자동으로 가공하는 도면 생성 장치 및 도면 생성 방법을 제공한다."}
{"patent_id": "10-2022-0029380", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 도면 생성 장치 및 도면 생성 방법에 관한 것으로, 보다 상세하게는 숫자, 기호, 가도형 및 심볼을 인식하여 도면으로 가공시키는 도면 생성 장치, 도면 생성 방법 및 기록 매체에 관한 것이다."}
{"patent_id": "10-2022-0029380", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "데이터의 양적 증가, 첨단 알고리즘, 컴퓨팅 파워와 스토리지가 개선되어 오늘날 인공지능은 매우 활발이 연구 되고 있다. 이러한 인공지능은 현재 국방, 헬스케어, 교육, 게임, 보안 등 다양한 분야에서 활용되고 있다. 인공지능의 활용 중에서도 특히 촬영된 이미지를 이용하여 숫자나 문자를 인식하는 기술이 다방면으로 활용되고 있다. 하나의 예로, 등록번호 제 10-2181861 호는 차량 번호판 검출 및 인식 시스템 및 방법에 관한 내용을 개 시하고 있다. 한편, 유리, 철판, 합판 제조 등의 산업 현장에서, 필요한 가공정보를 담고 있는 도면의 작성이 필수적이다. 종 래에는, 발주업체에서 임의로 그린 도면을 제공하면, 수주업체에서는 제공받은 도면을 CAD 작업을 통해 정형화 되는 과정이 필요했다. 이러한 도면 가공을 수작업으로 진행하면, 복잡하고 오류가 발생할 여지가 있으며, 많은 시간 및 비용이 소요될 수 있다. 인공지능의 활용범위가 넓어지면서 제조 산업 현장에서도 발빠르게 이를 적용하고자 하는 시도가 이어지고 있다. 특히, 임의로 기재한 숫자나 문자와 임의로 도시된 가도형을 자동으로 인식하여 도면을 도시하는 방법으 로, 산업 자재들의 제조 비용 및 제조 시간을 감소시킬 수 잇는 방법들이 연구될 필요가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록번호 제 10-2181861 호 특허공보"}
{"patent_id": "10-2022-0029380", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제점을 해결하기 위해 본 발명은 숫자, 기호, 가도형 및 심볼 중 적어도 하나를 포함하는 이미지를 이 용하여, 도면에 관한 정보를 획득하고 자동으로 가공하는 도면 생성 장치 및 도면 생성 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0029380", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위해 본 발명에 따른 도면 생성 방법은, 프로세서에 의해 수행되는 도면 생성 방법에 있어서, 숫자를 포함하는 수치부 및 기호를 포함하는 분별부를 갖는 제1이미지를 획득하는 제1이미지 획득 단계; 상기 제1이미지로부터 상기 수치부 및 상기 분별부를 인식하는 이미지 인식 단계;및 인식된 상기 수치부 및 분별부로부터 가공도형의 종류, 사이즈 및 형상에 관한 도면 정보를 획득하는 데이터 생성 단계;를 포함할 수 있다. 또한, 상기 이미지 인식 단계는, 제1인공지능모델에 의해 학습된 데이터를 기반으로 상기 수치부의 상기 숫자 및 상기 분별부의 상기 기호를 분류할 수 있다. 또한, 상기 제1이미지는 수량부를 더 포함하며, 도면 생성 방법은 획득한 상기 도면 정보와 상기 수량부에 기재 된 수량을, 재고 관리 시스템에 업로드하는 관리 단계;를 더 포함할 수 있다. 또한, 상기 제1이미지는 가공부를 더 포함하며, 도면 생성 방법은 획득한 상기 도면 정보와 상기 가공부에 기재 된 가공사항을, 재고 관리 시스템에 업로드하는 관리 단계;를 더 포함할 수 있다. 또한, 도면 생성 방법은 획득한 상기 도면 정보를 이용하여 도면파일의 형태로 메모리에 저장하는 저장 단계;를 더 포함할 수 있다. 또한, 데이터 생성 단계는, 상기 분별부의 기호에 따라, 상기 가공도형의 종류를 결정하는 종류 생성 단계 및 결정된 상기 가공도형의 종류와 상기 수치부에 따라, 상기 가공도형의 사이즈 및 형상을 결정하는 형상 생성 단 계를 포함할 수 있다. 또한, 상기 종류 생성 단계는, 상기 분별부의 기호와 일치하는 것을 기호리스트에서 찾아 가공도형의 종류를 결 정할 수 있다. 또한, 도면 생성 방법은, 상기 이미지 인식 단계에서 상기 수치부 및 상기 분별부 중 적어도 하나를 인식할 수 없거나, 상기 데이터 생성 단계에서 상기 분별부로부터 상기 가공도형의 종류를 획득할 수 없는 경우, 상기 제1 이미지를 정정하도록 알림을 제공하는 알림 단계를 더 포함할 수 있다. 한편, 프로세서;를 포함하는 도면 생성 장치에 있어서, 상기 프로세서는, 숫자를 포함하는 수치부 및 기호를 포 함하는 분별부를 갖는 제1이미지를 획득하고, 상기 제1이미지로부터 상기 수치부 및 상기 분별부를 인식하고, 인식된 상기 수치부 및 분별부로부터 가공도형의 종류, 사이즈 및 형상에 관한 도면 정보를 획득할 수 있다. 한편, 본 발명에 따른 도면 생성 방법은 프로세서에 의해 수행되는 도면 생성 방법에 있어서, 가도형을 포함하 는 가도면의 제2이미지를 획득하는 제2이미지 획득 단계; 상기 제2이미지 상의 상기 가도형에 관한 가도형정보 를 획득하는 가도형정보 획득 단계; 및 상기 가도형정보를 이용하여 제1최종도형을 획득하는 제1최종도형 획득 단계;를 포함할 수 있다. 또한, 상기 가도형정보 획득 단계는, 상기 제2이미지의 픽셀의 색을 기준으로 상기 가도형의 외곽을 형성하는 복수의 라인을 인식할 수 있다. 또한, 도면 생성 방법은, 상기 가도형정보 획득 단계에서 획득한 가도형정보에 따라 상기 가도형이 왜곡 요소를 가지는 경우, 상기 왜곡 요소를 제거하는 보정 단계;를 더 포함할 수 있다. 또한, 도면 생성 방법은, 상기 제1최종도형을 이용하여 도면파일을 생성하는 단계;를 더 포함할 수 있다. 한편, 프로세서;를 포함하는 도면 생성 장치에 있어서, 상기 프로세서는, 가도형을 포함하는 가도면의 제2이미 지를 획득하고, 상기 제2이미지 상의 상기 가도형에 관한 가도형정보를 획득하고, 상기 가도형정보를 이용하여 제1최종도형을 획득할 수 있다. 한편, 본 발명에 따른 도면 생성 방법은, 프로세서에 의해 수행되는 도면 생성 방법에 있어서, 가도형 및 심볼 을 포함하는 가도면의 제3이미지를 획득하는 제3이미지 획득 단계; 상기 제3이미지 상의 상기 가도형에 관한 가 도형정보를 획득하는 가도형정보 획득 단계; 상기 제3이미지 상의 상기 심볼에 관한 심볼정보를 획득하는 심볼 정보 획득 단계; 및 상기 심볼정보를 상기 가도형정보에 적용하여 제2최종도형을 획득하는 제2최종도형 획득 단 계;를 포함할 수 있다. 또한, 상기 가도형정보 획득 단계는, 상기 제3이미지의 픽셀의 색을 기준으로 상기 가도형의 외곽을 형성하는 복수의 라인을 인식하는 단계; 상기 복수의 라인에 대응하는 복수의 가숫자를 인식하는 단계; 및 상기 인식된 복수의 라인 및 상기 인식된 복수의 가숫자에 기초하여 상기 가도형정보를 획득하는 단계;를 포함할 수 있다. 또한, 도면 생성 방법은, 상기 가도형정보 획득 단계에서 획득한 가도형정보에 따라 상기 가도형이 왜곡 요소를 가지는 경우, 상기 왜곡 요소를 제거하는 보정 단계를 더 포함할 수 있다. 또한, 상기 심볼정보 획득 단계는, 상기 제3이미지 상에서 상기 가도형 및 상기 심볼을 포함하는 관심영역을 특 정하는 단계; 상기 관심영역 내에서 제2인공지능모델에 의해 상기 심볼을 분류하는 단계; 및 상기 분류된 심볼 에 대한 상기 심볼정보를 획득하는 단계;를 포함할 수 있다. 또한, 도면 생성 방법은 상기 제2최종도형을 이용하여 도면파일을 생성하는 단계;를 더 포함할 수 있다. 한편, 프로세서;를 포함하는 도면 생성 장치에 있어서, 상기 프로세서는, 가도형 및 심볼을 포함하는 가도면의 제3이미지를 획득하고, 상기 제3이미지 상의 상기 가도형에 관한 가도형정보를 획득하고, 상기 제3이미지 상의 상기 심볼에 관한 심볼정보를 획득하고, 상기 심볼정보를 상기 가도형정보에 적용하여 제2최종도형을 획득할 수 있다. 한편, 본 발명의 실시예에 따른 도면 생성 방법을 수행하는 프로그램이 컴퓨터로 판독 가능한 기록 매체에 기록 될 수 있다."}
{"patent_id": "10-2022-0029380", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 도면 생성 장치, 도면 생성 방법 및 기록 매체는, 숫자 및 기호를 인식하여 가공도형의 종류, 사이즈 및 형상에 관한 도면 정보를 획득할 수 있고, 가도면에 포함된 가도형을 인식하여 가도형에 관한 가도형 정보를 획득할 수 있으며, 가도면에 포함된 가도형 및 심볼을 인식하여 가도형정보 및 심볼정보를 획득할 수 있 게 함으로써, 자동으로 도면을 가공하고 자재의 제조 비용 및 제조시간을 감소시키는 효과를 제공할 수 있다."}
{"patent_id": "10-2022-0029380", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 본 발명의 실시예에 따른 도면 생성 장치, 도면 생성 방법 및 기록 매체에 대하여 설명한다. 통상의 기술자는 비록 본 명세서에 명확히 설명되거나 도시되지 않았지만, 발명의 원리를 구현하고 발명의 개념 과 범위에 포함된 다양한 장치를 개발할 수 있다. 또한, 본 명세서에 열거된 모든 조건부 용어 및 실시예들은 원칙적으로, 발명의 개념이 이해되도록 하기 위한 목적으로만 명백히 의도되고, 이처럼 특별히 열거된 실시예 및 상태에 제한적이지 않은 것으로 이해되어야 한다. 상술한 목적, 특징 및 장점은 첨부된 도면과 관련한 다음의 발명의 상세한 설명을 통하여 더욱 분명해질 것이며, 그에 따라 발명이 속하는 기술 분야에서 통상의 기술자가 발명의 기술적 사상을 쉽게 실시할 수 있을 것이다. 본 명세서에서 기술하는 실시예들은 본 발명의 이상적인 예시도인 단면도 및/또는 사시도들을 참고하여 설명될 것이다. 이러한 도면들에 도시된 막 및 영역들의 두께 등은 기술적 내용의 효과적인 설명을 위해 과장된 것이다. 제조 기술 및/또는 허용 오차 등에 의해 예시도의 형태가 변형될 수 있다. 또한, 도면에서 나타나는 가 공도형, 가도형 및 수치들은 기술 설명을 위한 예시적인 것으로 반드시 가공도형, 가도형의 길이가 수치에 비례 하지 않을 수 있다. 따라서, 본 발명의 실시예들은 도시된 특정 형태로 제한되는 것이 아니라 제조 공정에 따라 생성되는 형태의 변화도 포함하는 것이다. 다양한 실시예들을 설명하면서, 동일한 기능을 수행하는 구성요소에 대해서는 실시예가 다르더라도 편의상 동일 한 명칭 및 동일한 참조번호를 부여하기로 한다. 나아가, 이미 다른 실시예에서 설명된 구성 및 작동에 대해서는 편의상 생략하기로 한다. 이하에서, 본 발명의 실시예에 따른 도면 생성 방법을 수행하는 도면 생성 장치(이하 “전자 장치”)의 구성에 대하여 설명한다. 도 22은 본 발명의 실시예에 따른 도면 생성 장치를 나타낸 블록도이다. 본 발명의 실시예로서, 전자 장치는, 단말기, 디바이스, 전자기기 등으로 호칭될 수 있다. 전자 장치 는, 스마트폰, 태블릿 PC, PC, 스마트 TV, 휴대폰, PDA(personal digital assistant), 랩톱, 미디어 플 레이어, 마이크로 서버, 네비게이션, 키오스크, MP3 플레이어, 디지털 카메라, 가전기기 및 기타 컴퓨팅 장치일 수 있으나, 이에 한정되는 것은 아니다. 또한, 전자 장치는 디스플레이 기능 및 데이터 프로세싱 기능을 구비한 시계, 안경, 헤어 밴드 및 반지 등의 웨어러블 디바이스일 수 있다. 그러나, 이에 한정되지 않으며, 전 자 장치는 데이터를 처리하고, 처리된 데이터를 제공할 수 있는 모든 종류의 기기를 포함할 수 있다. 예를 들어, 도 22에 도시된 바와 같이, 일 실시예에 따른 전자 장치는, 메모리, 출력부, 프 로세서, 통신부, 및 촬영수단를 포함할 수도 있다. 도시된 구성 요소 모두가 전자 장치 의 필수 구성 요소인 것은 아니며, 보다 많은 구성 요소에 의해 전자 장치가 구현될 수도 있고, 보 다 적은 구성 요소에 의해 전자 장치가 구현될 수도 있다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 전자 장치로 입력되 는 정보 또는 전자 장치로부터 출력되는 정보를 저장할 수도 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 후술할 기록 매체는 상기 메모리일 수 있다. 출력부는, 오디오 신호 또는 비디오 신호 또는 진동 신호를 출력할 수 있으며, 출력부는 디스플레 이부, 음향 출력부를 포함할 수 있다. 디스플레이부는 전자 장치에서 처리되는 정보를 표시 출력한다. 구체적으로, 디스플레이부는 카메라에서 촬영된 이미지를 출력할 수 있다. 디스플레이부는, 사용자의 입력에 대한 응답으로, 응답에 관련된 동작을 실행 하기 위한 사용자 인터페이스를 디스플레이할 수 있다. 음향 출력부는 통신부로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력한다. 또한, 음향 출력부는 전자 장치에서 수행되는 기능(예를 들어, 호신호 수신음, 메시지 수신음, 알림음)과 관련된 음 향 신호를 출력한다. 프로세서는, 통상적으로 전자 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 메 모리에 저장된 프로그램들을 실행함으로써, 출력부, 통신부, 촬영수단 등을 전반적으 로 제어할 수 있다. 통신부는, 전자 장치가 다른 장치(미도시) 및 서버(미도시)와 통신을 하게 하는 하나 이상의 구성 요소를 포함할 수 있다. 다른 장치(미도시)는 전자 장치와 같은 컴퓨팅 장치이거나, 센싱 장치일 수 있으 나, 이에 한정되는 것은 아니다. 예를 들어, 통신부는 근거리 통신부(미도시), 이동 통신부(미도시)를 포 함할 수 있다. 근거리 통신부(short-range wireless communication unit)는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무선 통신부(Near Field Communication unit), WLAN(와이파이) 통신부, 지그비 (Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 이동 통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여 기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형 태의 데이터를 포함할 수 있다.촬영수단는 화상 통화모드 또는 촬영 모드에서 이미지 센서를 통해 정지영상 또는 동영상 등의 화상 프레 임을 얻을 수 있다. 이미지 센서를 통해 캡처된 이미지는 프로세서 또는 별도의 이미지 처리부(미도시)를 통해 처리될 수 있다. 단, 촬영수단은 다양한 종류의 이미지 획득 장치를 포함할 수 있으며, 종류에 한정 되지 않는다. 다음으로, 본 발명의 실시예에 따른 도면 생성 방법에 대하여 살펴본다. 구체적인 설명에 앞서, 유사한 용어들을 구분한다. '숫자' 및 '기호'는 다음과 같은 의미로 사용된다. '사전적 의미의 숫자' 및 '사전적 의미의 기호'는 본 명세서 및 도면에 다수 등장하지만, 본 발명에서의 '숫자'는 제1이미지 및 가공도형과 관련된 단계에서 사용되고, 수치부에 기재된 것을 의미하고, '기호'는 제1이미지 및 가공도형과 관련된 과정에서 사용되고, 분별 부에 기재된 것을 의미한다. '가도형', '가숫자' 및 '가기호'는 제2이미지 및 제3이미지 상에 나타난 임시로 도시된 것을 의미하며, 제2이미지, 제2이미지, 제1최종도형 및 제2최종도형과 관련된 과정에서 사용된다. 각 용어의 의미는 이하에서 도면과 함께 설명하기로 한다. 도 1은 본 발명의 실시예에 따른 제1이미지를 이용하는 도면 생성 방법을 나타낸 순서도이다. 도 2는 도면 정보 에 기반하여 생성된 가공도형을 나타낸 도면이다. 도 3은 수치부, 분별부, 수량부 및 가공부의 예를 나타낸 도 면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 도면 생성 방법은, 프로세서에 의해 수행되는 도면 생성 방법 에 있어서, 숫자를 포함하는 수치부 및 기호를 포함하는 분별부를 갖는 제1이미지를 획득하는 제1이미 지 획득 단계(S1100); 상기 제1이미지로부터 상기 수치부 및 상기 분별부를 인식하는 이미지 인식 단계 (S1200);및 인식된 상기 수치부 및 분별부로부터 가공도형의 종류, 사이즈 및 형상에 관한 도면 정보를 획득하는 데이터 생성 단계(S1300);를 포함할 수 있다. 먼저, 숫자를 포함하는 수치부 및 기호를 포함하는 분별부를 갖는 제1이미지를 획득하는 제1이미지 획 득 단계(S1100)가 진행될 수 있다. 도 2를 참조하면, 숫자는 가공도형의 사이즈에 관한 정보가 기재된 것을 의미한다. 예를 들어, 숫자는 다 각형의 변의 길이, 각의 크기, 원의 지름 또는 원의 반지름을 의미할 수 있다. 기호는 가공도형의 종류에 관한 정보가 기재된 것을 의미한다. 예를 들어, 기호는 삼각형, 사각형 또는 원 중의 하나를 의미할 수 있다. 기호의 구체적인 예시들은 후술하기로 한다. 수치부는 숫자를 포함할 수 있다. 수치부는 숫자만으로 이루어질 수도 있고, '°'을 포함할 수도 있다. 숫자 및 기호는 수기에 의해 기재될 수 있고, 전자 기기에 의해 기재될 수 있다. 제1이미지는 수치부 및 분별부를 가지며, 촬영되어 생성될 수 있고, 전자 기기에 의해 작성되어 생성될 수 있다. 프로세서가 제1이미지를 획득하는 방법은 제한되지 않는다. 제1이미지는 도면 생성 장치의 촬영에 의해 획득될 수 있다. 또한, 제1이미지는 외부 장치로부터의 유무선 전송 방식 또는 온라인으로부터의 다운로드 방식 으로 획득될 수 있다. 이어서, 상기 제1이미지로부터 상기 수치부 및 상기 분별부를 인식하는 이미지 인식 단계(S1200)가 진 행될 수 있다. 프로세서는 제1이미지에서 수치부와 분별부를 각각 인식할 수 있다. 수치부는 생성할 도면에 나타날 가공도형의 사이즈 및 형상과 관련되며, 분별부는 상기 가공도형의 종류와 관련될 수 있 다. 이때, 수치부 및 분별부는 각각 제1인공지능모델에 의해 인식될 수 있다. 구체적인 사항은 후술하 기로 한다. 이어서, 인식된 상기 수치부 및 분별부로부터 가공도형의 종류, 사이즈 및 형상에 관한 도면 정보 를 획득하는 데이터 생성 단계(S1300)가 진행될 수 있다. 가공도형은 수치부와 분별부로부터 인식된 숫자 및 기호로부터 형성된 것을 의미한다. 프로세서는 데이터를 생성할 수 있다. 즉, 프로세서는 제1이미지 상의 수치부 및 분별부로 부터 데이터 형식으로 가공도형의 종류, 사이즈 및 형상을 추출할 수 있다. 데이터 생성 단계(S1300)는 제 1이미지 상에서 이미지로 존재하는 숫자 및 기호를 데이터화 화여 전자 장치에서 사용될 수 있도록 데이 터를 생성하는 과정이다. 도 2를 다시 참조하면, 수치부는 '200' 및 '100'을 의미하고, 분별부는 'X'를 의미한다. 즉, 프로세서 는 식별 요소인 분별부의 'X'기호가 사각형을 의미함을 인식할 수 있고, 수치부의 '200' 및 '100' 숫자가 각각 사각형의 가로 및 세로 길이를 의미함을 인식할 수 있다. 숫자의 단위는 mm, cm, m일 수 있 으나, 이에 제한되는 것은 아니다. 예를 들어, 프로세서는 '200 X 100'를 포함하는 제1이미지를 이용하여 가로 길이 200cm 및 세로 길이 100cm인 사각형으로 이루어진 도면 정보를 획득할 수 있다. 프로세서는 도면 정보를 이용하여 가공도형 을 생성할 수 있다. 다음으로, 수량부에 대하여 살펴본다. 도 2를 다시 참조하면, 본 발명의 실시예에 따른 상기 제1이미지는 수량부를 더 포함하며, 도면 생성 방법 은 획득한 상기 도면 정보와 상기 수량부에 기재된 수량을, 재고 관리 시스템에 업로드하는 관리 단 계;를 더 포함할 수 있다. 수량부는 생성될 도면의 수를 나타낼 수 있다. 또한, 수량부는 주문할 자재의 수를 나타낼 수 있다. 프로세 서는 도면 정보 및 수량을 재고 관리 시스템에 업로드할 수 있다. 수량부는 수량기호와 수량 을 포함할 수 있다. 수량은 생성될 도면의 수를 의미하고, 수량기호는 수량을, 수치부 및 분별부로부터 구별할 수 있다. 도 2 및 도 3에 따르면, 수량부는 '='인 수량기호와 '1'인 수량으로 구성될 수 있다. 프로세서 는, '200 X 100 = 1'의 표기를 가로 길이 '200', 세로길이 '100'인 사각형의 도면이 수량 '1'로 인 식하여, 상기 사각형의 도면 1개를 재고 관리 시스템에 업로드할 수 있다. 이때, 수량기호는 '='에 한정되 는 것은 아니고, '→', '/', '장', 'EA' 및 '-' 등의 다양한 형태로 이루어질 수 있다. 다음으로, 가공부에 대하여 살펴본다. 도 3을 참조하면, 본 발명의 실시예에 따른 상기 제1이미지는 가공부를 더 포함하며, 도면 생성 방법은 획 득한 상기 도면 정보와 상기 가공부에 기재된 가공사항을, 재고 관리 시스템에 업로드하는 관리 단계;를 더 포함할 수 있다. 가공부는 주문할 자재의 가공사항을 나타낼 수 있다. 가공사항은 발주자가 주문하는 가공 내용을 의미한다. 가공사항은 제1가공사항, 제2가공사항 및/또는 제3가공사항으로 분류될 수 있다. 가공가공부는 제1가공사항, 제2가공사항 및 제3가공사항 중 적어도 하나를 포함할 수 있다. 유리를 예를 들어 설명하면, 제1가공사항은 자재(유리)의 두께를 의미할 수 있다. 도 3(a)에서 제1가공사항 은 '5T'을 포함하며, 이는 자재의 두께가 5mm임을 의미한다. 도 3(b)에서 제1가공사항은 '8T'를 포함하 며, 이는 자재의 두께가 8mm임을 의미한다. 단, 단위가 mm에 한정되는 것은 아니며, 자재가 유리에 한정되는 것 은 아니다. 제2가공사항은 자재(유리)의 색을 의미할 수 있다. 도 3(a) 내지 도 3(c)에서 제2가공사항은 각각 '투 명', '블루' 및 '그린'을 포함하며, 이는 자재의 색이 각각 투명, 블루 및 그린임을 의미한다. 제3가공사항은 자재(유리)의 외형을 나타낼 수 있다. 도 3(c)에서 제3가공사항은 '면취'를 포함하며, 이는 자재를 면취할 것을 의미한다. 도 4(d)에서 제3가공사항은 '천공'을 포함하며, 이는 자재를 천공할 것 을 의미한다. 단, '면취' 및 '천공'에 한정되는 것은 아니고, 다양한 가공사항이 기재될 수 있다. 후술할 제1인공지능모델은 제1가공사항, 제2가공사항 및 제3가공사항에 대한 데이터를 학습할 수 있으며, 학습된 제1인공지능모델은 가공부를 인식하여 분류할 수 있다. 프로세서는 도면 정보 및 가공부의 가공사항을 재고 관리 시스템에 업로드할 수 있다. 예를 들어, 도 3(d)의 경우 프로세서는 가로 길이 200cm 및 세로 길이 100cm인 사각형으로 이루어진 도면 정보를 획득할 수 있다. 또한, 프로세서는 수량을 '5'로 인식할 수 있다. 또한, 프로세서는 제1가공정보를 '5T'로 인식할 수 있다. 또한, 프로세서는 제2가공정보를 '그린'으로 인식할 수 있다. 또한, 프로세 서는 제3가공정보를 '천공'으로 인식할 수 있다. 즉, 프로세서는 가로 길이 200cm, 세로 길이 100cm의 사각형, 수량 '5', 두께 '5T', 색 '그린' 및 '천공'에 관한 데이터를 재고 관리 시스템에 업로드할 수 있다. 본 발명은 발주자가 간략하게 임의로 도시된 내용을 제1이미지를 제공하면, 도면 생성 장치가 자동으로 제1이미 지 상에 기재된 내용을 데이터화 하여 재고 관리 시스템에 업로드할 수 있고, 도면 데이터를 생성할 수 있다. 이는, 자재의 제조 비용, 제조 시간 등을 감소시키는 효과를 일으킬 수 있다. 다음으로, 이미지 인식 단계(S1200)에 대하여 살펴본다. 도 4는 제1인공지능모델에 의해 분류되는 숫자 및 기호를 나타내는 도면이다. 도 5는 기호의 종류에 따른 가공 도형의 종류의 예시를 나타낸 도면이다. 도 4를 참조하면, 본 발명의 실시예에 따른 상기 이미지 인식 단계(S1200)는, 제1인공지능모델에 의해 학습된 데이터를 기반으로 상기 수치부의 상기 숫자 및 상기 분별부의 상기 기호를 분류할 수 있다. 제1인공지능모델은 숫자 및 문자 인식모델일 수 있다. 제1인공지능모델은 '0' 내지 '9'의 숫자이미지와 라벨링 데이터를 이용하여, 숫자를 분류하도록 학습될 수 있다. 또한, 제1인공지능모델은 'X', '□' 및 '△' 등의 기호 이미지와 라벨링데이터를 이용하여, 기호를 분류하도록 학습될 수 있다. 이때, 학습되는 기호의 종류는 제한되 지 않는다. 제1인공지능모델의 다른 특성은 후술할 제2인공지능모델과 동일하므로 생략하기로 한다. 프로세서는 제1인공지능 모델을 이용하여 수치부의 숫자를 분류할 수 있고, 분별부의 기호를 분 류할 수 있다. 이는 이미지에 불과한 숫자 및 기호를 전자 장치에서 활용할 수 있도록 인식하는 과정에 해당한다. 도 5를 참조하면, 기호와 가공도형의 종류와의 관계를 알 수 있다. 기호가 'X' 또는 '□'인 경우 가공도형 의 종류는 사각형에 해당하고, 기호가 '△'인 경우 가공도형의 종류는 삼각형에 해당하며, 기호가 'R', 'ø' 또는 '○'인 경우 가공도형의 종류는 원에 해당한다. 상술한 예와 같이, 프로세서는 분별부의 기호에 따라 가공도형의 종류를 분별할 수 있다. 기호 및 가공도형 종류는 기호리스트로 저장될 수 있다. 또한, 상술한 기호는 예시적인 것으로 반드시 이에 제 한되는 것은 아니며, 기호리스트에서 제거되거나 추가될 수 있다. 다음으로, 도면파일을 저장하는 과정을 살펴본다. 본 발명의 실시예에 따른 도면 생성 방법은, 획득한 상기 도면 정보를 이용하여 도면파일의 형태로 메모리에 저 장하는 저장 단계(S1400);를 더 포함할 수 있다. 프로세서는 데이터 생성 단계(S1300)에서 도면 정보를 획득할 수 있으며, 획득한 도면 정보를 이용하여 도면파일의 형태로 메모리에 저장할 수 있다. 도면파일은 STEP, STP, STL 및 DWG 중 적어도 하나로 이루어질 수 있다. 그러나, 도면파일은 나열한 예에 한정되는 것은 아니며, 컴퓨터 프로그램으로 활용될 수 있는 다양한 확 장자를 가질 수 있다. 다음으로, 데이터 생성 단계(S1300)에 대하여 살펴본다. 본 발명의 실시예에 따른 데이터 생성 단계(S1300)는, 상기 분별부의 기호에 따라, 상기 가공도형의 종류를 결정하는 종류 생성 단계(S1310) 및 결정된 상기 가공도형의 종류와 상기 수치부에 따라, 상기 가공도형의 사이즈 및 형상을 결정하는 형상 생성 단계(S1320)를 포함할 수 있다.먼저, 상기 분별부의 기호에 따라, 상기 가공도형의 종류를 결정하는 종류 생성 단계(S1310)가 진행될 수 있다. 프로세서는 분별부에서 나타난 기호에 따라 가공도형의 종류를 결정할 수 있다. 분별부의 기호가 사각형을 상징하는 경우 가공도형의 종류는 사각형으로 결정되며, 수치부의 숫자는 사각형을 형성하는 데이터로 활용될 수 있다. 또한, 분별부의 기호가 삼각형을 상징하는 경우 가공도형의 종류는 삼각형으로 결정되며, 수치부 의 숫자는 삼각형을 형성하는 데이터로 활용될 수 있다. 또한, 분별부의 기호가 원을 상징하는 경우 가공도형의 종류는 원으로 결정되며, 수치부의 숫자는 원을 형성하는 데이터로 활용될 수 있다. 나아가, 삼각형 및 사각형 이외의 다각형도 이와 같다. 이어서, 결정된 상기 가공도형의 종류와 상기 수치부에 따라, 상기 가공도형의 사이즈 및 형상을 결정하는 형상 생성 단계(S1320)가 진행될 수 있다. 도 6은 사각형으로 인식된 가공도형의 예시를 나타낸 도면이다. 도 7은 삼각형으로 인식된 가공도형의 예시를 나타낸 도면이다. 도 8은 원으로 인식된 가공도형의 예시를 나타낸 도면이다. 프로세서는 수치부를 인식하여 가공도형의 사이즈 및 형상을 결정할 수 있다. 프로세서는 수치부 및 분별부를 인식할 때 수치부 및 분별부의 배치 순서를 불문한다. 또한, 수치부 간의 구별 및 수치부와 분별부의 구분은 공백으로 표현될 수 있으며, ',' 및 '.' 등의 다양한 수단으로 표현될 수 있다. 단, 이제 한정되는 것은 아니다. 도 6(a)를 참조하면, 수치부는 '200' 및 '100'으로 이루어지며, 분별부는 'X'로 이루어질 수 있다. 이 때, 도 2와는 달리 수치부 및 분별부는 '200 100 X'로 배치를 달리하여 기재되어 있으나, 이는 도 2와 같이 가로 길이 '200' 및 세로 길이 '100'인 사각형을 의미할 수 있다. 도 6(b)를 참조하면, 수치부는 '200' 및 '100'으로 이루어지며, 분별부는 '□'로 이루어질 수 있다. '200 □ 100'는 가로 길이 '200' 및 세로 길이 '100'인 사각형을 의미할 수 있다. 도 7(a)를 참조하면, 수치부는 '200', '100' 및 '150'으로 이루어지며, 분별부는 '△'로 이루어질 수 있다. '200 100 150 △”는 세 변의 길이가 각각 '200', '100' 및 '150'인 삼각형을 의미할 수 있다. 도 7(b)를 참조하면, 수치부는 '200', '100' 및 '45°'로 이루어지며, 분별부는 '△'로 이루어질 수 있 다. 이때, ','은 수치부를 서로 구분하며, 수치부와 분별부를 서로 구분하지만, 구분의 수단은 ','로 제한되는 것은 아니다. '200, 100, 45°'는 두 변의 길이가 각각 '200', '100'이고, 그 사잇각이 '45°'인 삼각형을 의미할 수 있다. 도 7(c)를 참조하면, 수치부는 '200', '30°' 및 '60°'로 이루어지며, 분별부는 '△'로 이루어질 수 있다. '△ 200 30°60°'는 한 변의 길이가 '200'이고, 양 끝 각이 각각 '30°' 및 '60°'인 삼각형을 의미할 수 있다. 도 8(a)를 참조하면, 수치부는 '100'으로 이루어지며 분별부는 'R'로 이루어질 수 있다. '100 R'은 반 지름이 '100'인 원을 의미할 수 있다. 도 8(b)를 참조하면, 수치부는 '200'으로 이루어지며 분별부는 'ø'로 이루어질 수 있다. 'ø 200'은 지름이 '200'인 원을 의미할 수 있다. 분별부는 기호에 따라서 수치부를 반지름으로 인식하거나 지름으 로 인식하게 할 수 있다. 도 8(c)를 참조하면, 수치부는 '100'으로 이루어지며 분별부는 '○'로 이루어질 수 있다. '100 ○'는 반지름이 '100'인 원을 의미할 수 있다. 도 8(d)를 참조하면, 수치부는 '100' 및 '50'으로 이루어질 수 있고, 분별부는 '○'로 이루어질 수 있 다. '○ 100 50'은 장축 길이 '100' 및 단축 길이 '50'인 타원을 의미할 수 있다. 도 6 내지 도 8에서 나타난 다양한 예와 같이, 프로세서는 분별부를 이용하여 가공도형의 종류 를 결정하고, 수치부를 이용하여 상기 가공도형의 사이즈 및 형상을 결정할 수 있다. 또한, 수치부 및 분별부의 배치에 제한되지 않고 프로세서는 수치부 및 분별부를 인식하 여 도면 정보를 획득할 수 있다. 또한, 분별부의 종류에 제한되지 않고 프로세서는 분별부를 인 식하여 가공도형의 종류를 결정할 수 있다. 이는, 프로세서가 수치부 및 분별부를 각각 인식함으로써 달성할 수 있다. 즉, 서로 다른 사용자 가 수치부 및 분별부의 배치를 달리하거나, 분별부의 기호를 일부 다르게 기재하는 경우에도 대응 이 가능하다는 효과를 발생시킨다. 다음으로, 종류생성 단계에 대하여 살펴본다. 도 5 내지 도 8을 다시 참조하면, 본 발명의 실시예에 따른 상기 종류생성 단계는, 상기 분별부의 기호와 일치하는 것을 기호리스트에서 찾아 가공도형의 종류를 결정할 수 있다. 프로세서의 제1인공지능모델은 분별부의 기호를 분류하고, 프로세서는 분류된 기호와 일치하는 것을 기호리스트에서 찾아 가공도형의 종류를 결정할 수 있다. 이때, 기호리스트는 추가, 삭제 및 변경될 수 있다. 즉, 기호의 분류는 제1인공지능모델에 의해 수행되며, 가공도형의 종류를 결정하는 것은 프로세 서에서 수행될 수 있다. 다음으로, 알림 단계에 대하여 살펴본다. 본 발명의 실시예에 따른 도면 생성 방법은 상기 이미지 인식 단계(S1200)에서 상기 수치부 및 상기 분별부 중 적어도 하나를 인식할 수 없거나, 상기 데이터 생성 단계(S1300)에서 상기 분별부로부터 상기 가공 도형의 종류를 획득할 수 없는 경우, 상기 제1이미지를 정정하도록 알림을 제공하는 알림 단계를 더 포함 할 수 있다. 수치부 및 분별부 중 적어도 하나를 인식할 수 없는 경우는, 수치부만 있거나 분별부만 있는 경우를 포함할 수 있고, 수치부 및 분별부가 형식에 맞지 않게 기재되지 않은 경우를 포함할 수 있고, 제1인공지능모델이 기호를 분류할 때 기호의 일치율이 0.5보다 작은 경우를 포함할 수 있다. 단, 이에 한정되는 것은 아니다. 이 경우 수치부 및 분별부를 포함하는 제1이미지를 정정할 수 있도록 알림을 제공할 수 있다. 나아가, 분별부로부터 가공도형의 종류를 획득할 수 없는 경우는, 기호리스트에서 해당하는 기호가 없 는 경우를 포함할 수 있다. 단, 이에 한정되는 것은 아니다. 이 경우 수치부 및 분별부를 포함하는 제1 이미지를 정정할 수 있도록 알림을 제공할 수 있다. 이때, 알림은 출력부을 통해 제공될 수 있다. 이처럼 알림 단계를 통해 본 발명에 따라 생성되는 도면의 정확성을 높이는 효과가 있다. 다음으로, 본 발명의 실시예에 다른 도면 생성 장치는 프로세서를 포함하며, 상기 프로세서는 숫자 를 포함하는 수치부 및 기호를 포함하는 분별부를 갖는 제1이미지를 획득하고, 상기 제1이미지로부터 상기 수치부 및 상기 분별부를 인식하고, 인식된 상기 수치부 및 분별부로부터 가공도형 의 종류, 사이즈 및 형상에 관한 도면 정보를 획득할 수 있다. 상술한 도면 생성 방법은 프로세서에 의해 수행될 수 있으며, 도면 생성 장치는 프로세서를 포함할 수 있다. 또한, 도면 생성 장치는 전자 장치일 수 있다. 다음으로, 도면 생성 방법에 대하여 더 살펴본다. 도 9는 본 발명의 실시예에 따른 제2이미지를 이용하는 도면 생성 방법을 나타낸 순서도이다. 도 10은 가도면의 제2이미지에서 구분된 분석영역을 나타낸 도면이다. 도 9를 참조하면, 본 발명의 실시예에 따른 도면 생성 방법은 가도형을 포함하는 가도면의 제2이미지를 획득하 는 제2이미지 획득 단계(S2100); 상기 제2이미지 상의 상기 가도형에 관한 가도형정보를 획득하는 가도형정보 획득 단계(S2200); 및 상기 가도형정보를 이용하여 제1최종도형을 획득하는 제1최종도형 획득 단계 (S2300);를 포함할 수 있다.먼저, 가도형을 포함하는 가도면의 제2이미지를 획득하는 제2이미지 획득 단계(S2100)가 진행될 수 있다. 가도형은 삼각형, 사각형 등 다각형으로 이루어질 수 있다. 그러나 이에 한정되는 것은 아니다. 가도형(1 1)은 이차원 형태로 이루어질 수 있다. 또한, 가도형은 유리, 합판, 철판 등의 얇은 소재가 도시된 것일 수 있다. 그러나 이에 한정되는 것은 아니다. 나아가, 가도형은 소재가 직접 반영된 것은 아니나, 얇은 이차원 형태로 도시될 수 있다. 도면 생성 방법은 가도면을 가공할 수 있다. 여기서 가도면의 가공은 가도면의 정형화를 의미한다. 가도면은 수 작업으로 그려지거나, 임의의 방법으로 그려진 도면이므로 정형화가 필요할 수 있다. 정형화는 완전한 직선으로 이루어지지 않은 가도형을 완전한 직선으로 이루어진 가도형으로 가공하는 것을 의미한다. 즉, 정형화는 가도형을 이루는 라인이 곡선인 경우 이를 직선으로 가공하는 것을 의미할 수 있고, 가도형 을 이루는 라인이 불연속적으로 이루어진 경우 이를 연속적인 상태로 가공하는 것을 의미할 수 있다. 제2이미지는 가도면을 촬영하여 얻어질 수 있고, 전자 장치에 의해 도시된 가도면으로부터 얻어질 수 있 다. 즉, 제2이미지는 가도형을 포함할 수 있다. 제2이미지는 파일로 이루어져 메모리에 저장될 수 있 다. 이때, 제2이미지 파일은 전자 장치의 촬영수단에 의해 가도면이 촬영되어 생성될 수 있고, 전자 장치 에 의해 직접 도시된 가도면으로부터 생성될 수 있으며, 통신부에 의해 외부 장치로부터 전송받을 수 있다. 여기서, 외부 장치는 모바일기기, 랩탑, 데스크탑, 키오스크 등의 컴퓨팅 장치로 이루어질 수 있으나, 나열한 것에 한정되는 것은 아니다. 본 발명의 실시예에 따른 전자 장치 및/또는 프로세서는 가도형 포함하는 가도면의 제2이미지 를 획득하고, 상기 가도형 또는 가도면을 정형화시킬 수 있다. 이어서, 상기 제2이미지 상의 상기 가도형에 관한 가도형정보를 획득하는 가도형정보 획득 단계(S2200)가 전자 장치 또는 프로세서에 의해 진행될 수 있다. 도 10을 참조하면, 전자 장치는 분석영역을 특정할 수 있으며, 분석영역마다 가도형정보를 획득 할 수 있다. 가도형정보는 가도형, 가숫자 및 가기호에 관한 정보를 포함할 수 있다. 가도형은 가 도형의 외곽을 이루는 복수의 라인을 포함할 수 있다. 가숫자는 상기 복수의 라인에 대응하는 길이 정 보일 수 있다. 가기호는 상기 복수의 라인 간 형성되는 각의 정보일 수 있다. 또한, 각 표시의 가기호는 각도 정보를 포함할 수 있다. 본 발명의 실시예에서 나타나는 모든 가숫자의 단위는 mm, cm 및 m 중 적어도 하나 일수 있으나, 이에 제한 되는 것은 아니다. 즉, 전자 장치는 제2이미지로부터 가도형정보를 획득할 수 있다. 여기서 가도형정보는 가도형의 형태, 가도형의 외곽을 이루는 복수의 라인 및 가숫자 등을 포함할 수 있다. 이때, 가도형정보는 메모 리에 저장될 수 있다. 이어서, 상기 심볼정보를 상기 가도형정보에 적용하여 제1최종도형을 획득하는 제1최종도형 획득 단 계(S2300)가 전자 장치 또는 프로세서에 의해 진행될 수 있다. 도 11은 가도형정보에 기반하여 제1최종도형이 형성되는 과정을 나타낸 도면이다. 도 10 및 도 11을 참조하면, 가도형정보는 가도형을 포함할 수 있다. 또한, 가도형정보는 가도형 및 가 숫자를 포함할 수 있다. 즉, 프로세서는 가도형을 이용하여 제1최종도형을 획득할 수 있다. 또한, 프로세서는 가도형 및 가숫자를 이용하여 제1최종도형을 획득할 수 있다. 제2이미지에 가도형 만을 포함하는 경우, 제1최종도형은 가도형의 형상만 특정될 수 있고, 가도형 의 사이즈는 특정되지 않을 수 있다. 반대로, 제2이미지에 가도형 및 가숫자를 포함하는 경우, 제1 최종도형은 가도형의 형상 및 가도형의 사이즈 모두 특정될 수 있다. 다음으로, 가도형정보 획득 단계(S2200)에 대하여 살펴본다. 본 발명의 실시예에 따른 상기 가도형정보 획득 단계(S2200)는, 상기 제2이미지의 픽셀의 색을 기준으로 상기 가도형의 외곽을 형성하는 복수의 라인을 인식할 수 있다. 제2이미지에서 복수의 라인을 인식하는 방법은 제3이미지에서 복수의 라인을 인식하는 방법과 동일하며, 이와 관련한 구체적인 내용은 후술하기로 한다.다음으로, 보정 단계에 대하여 살펴본다. 본 발명의 실시예에 따른 도면 생성 방법은, 상기 가도형정보 획득 단계에서 획득한 가도형정보에 따라 상기 가 도형이 왜곡 요소를 가지는 경우, 상기 왜곡 요소를 제거하는 보정 단계;를 더 포함할 수 있다. 이와 관련 한 구체적인 내용은 후술하기로 한다. 다음으로, 도면파일 생성하는 단계(S2300)에 대하여 살펴본다. 본 발명은 실시예에 따른 도면 생성 방법은, 상기 제1최종도형을 이용하여 도면파일을 생성하는 단계 (S2300);를 더 포함할 수 있다. 제1최종도형을 이용하여 도면파일을 생성하는 방법은 제2최종도형을 이용하여 도면파일을 생성하는 방법과 동일하며, 이와 관련한 구체적인 내용은 후술하기로 한다. 다음으로, 본 발명의 실시예에 다른 도면 생성 장치는 프로세서를 포함하며, 상기 프로세서는, 가 도형을 포함하는 가도면의 제2이미지를 획득하고, 상기 제2이미지 상의 상기 가도형에 관한 가도형정보 를 획득할 수 있다. 상술한 도면 생성 방법은 프로세서에 의해 수행될 수 있으며, 도면 생성 장치는 프로세서를 포함할 수 있다. 또한, 도면 생성 장치는 전자 장치일 수 있다. 다음으로, 본 발명의 실시예에 따른 도면 생성 방법에 대하여 더 살펴본다. 도 12는 본 발명의 실시예에 따른 제3이미지를 이용하는 도면 생성 방법을 나타낸 순서도이다. 도 13은 복수의 가도형을 포함하는 가도면의 제3이미지를 나타낸 도면이다. 도 14는 가도면의 제3이미지에서 구분된 분석영역을 나타낸 도면이다. 도 15는 관심영역 내에서 인식되는 심볼을 나타낸 도면이다. 도 12를 참조하면, 본 발명의 실시예에 따른 도면 생성 방법은, 프로세서에 의해 수행되는 도면 생성 방 법에 있어서, 가도형 및 심볼을 포함하는 가도면의 제3이미지를 획득하는 제3이미지 획득 단계(S3100); 상기 제3이미지 상의 상기 가도형에 관한 가도형정보를 획득하는 가도형정보 획득 단계(S3200); 상기 제3이 미지 상의 상기 심볼에 관한 심볼정보를 획득하는 심볼정보 획득 단계(S3300); 및 상기 심볼정보를 상기 가 도형정보에 적용하여 제2최종도형을 획득하는 제2최종도형 획득 단계(S3400);를 포함할 수 있다. 먼저, 가도형 및 심볼을 포함하는 가도면의 제3이미지를 획득하는 제3이미지 획득 단계(S3100)가 전자 장치에 의해 진행될 수 있다. 도 13을 참조하면, 가도형은 삼각형, 사각형 등 다각형으로 이루어질 수 있다. 그러나 이에 한정되는 것은 아니다. 가도형은 이차원 형태로 이루어질 수 있다. 또한, 가도형은 유리, 합판, 철판 등의 얇은 소재 가 도시된 것일 수 있다. 그러나 이에 한정되는 것은 아니다. 나아가, 가도형은 소재가 직접 반영된 것은 아니나, 얇은 이차원 형태로 도시될 수 있다. 심볼은 가도형 상에 도시되거나, 가도형과 적어도 일부가 중첩되도록 도시될 수 있다. 심볼은 소재가 가공될 가공 예정 상태를 나타낼 수 있다. 심볼은 종류에 한정되지 않으나, 주로 심볼규약에 맞도록 도시될 수 있다. 그러나, 심볼은 반드시 심볼규약에 맞게 도시되어야 하는 것은 아니나, 이 경우 다시 도시 하도록 전자 장치에 의해 요청될 수 있다. 관련된 내용은 후술하기로 한다. 가도면은 가도형 및 심볼을 포함할 수 있다. 가도면은 임시로 그려진 도면을 의미한다. 가도면은 수작 업으로 도시될 수 있다. 또한, 가도면은 컴퓨터 등의 장치에 의해 도시될 수도 있다. 구체적으로, 가도면은 본 발명의 실시예에 따른 도면 생성 장치에 의해 가공되기 전 임시로 그려진 도면일 수 있다. 도면 생성 방법은 가도면을 가공할 수 있다. 여기서 가도면의 가공은 가도면의 정형화를 의미한다. 가도면은 수 작업으로 그려지거나, 임의의 방법으로 그려진 도면이므로 정형화가 필요할 수 있다. 정형화는 완전한 직선으로 이루어지지 않은 가도형을 완전한 직선으로 이루어진 가도형으로 가공하는 것을 의미한다. 또한, 정형 화는 심볼이 의미하는 가공 예정 상태를 가도형에 적용시키는 것을 의미한다. 정형화된 제2최종도형은 가도형의 가공 상태를 미리보기 한 것과 같을 수 있다. 즉, 정형화는 가도형을 이루는 라인이 곡선인 경우 이를 직선으로 가공하는 것을 의미할 수 있고, 가도형 을 이루는 라인이 불연속적으로 이루어진 경우 이를 연속적인 상태로 가공하는 것을 의미할 수 있다. 제3이미지는 가도면을 촬영하여 얻어질 수 있고, 전자 장치에 의해 도시된 가도면으로부터 얻어질 수 있 다. 즉, 제3이미지는 가도형 및 심볼을 포함할 수 있다. 제3이미지는 파일로 이루어져 메모리에 저장될 수 있다. 이때, 제3이미지 파일은 전자 장치의 촬영수단에 의해 가도면이 촬영되어 생성될 수 있 고, 전자 장치에 의해 직접 도시된 가도면으로부터 생성될 수 있으며, 통신부에 의해 외부 장치로 부터 전송받을 수 있다. 여기서, 외부 장치는 모바일기기, 랩탑, 데스크탑, 키오스크 등의 컴퓨팅 장치로 이루 어질 수 있으나, 나열한 것에 한정되는 것은 아니다. 본 발명의 실시예에 따른 전자 장치는 가도형 및 심볼을 포함하는 가도면의 제3이미지를 획득하 고, 상기 가도형 또는 가도면을 정형화시킬 수 있다. 이어서, 상기 제3이미지 상의 상기 가도형에 관한 가도형정보를 획득하는 가도형정보 획득 단계(S3200)가 전자 장치에 의해 진행될 수 있다. 도 14를 참조하면, 전자 장치는 분석영역을 특정할 수 있으며, 분석영역마다 가도형정보를 획득 할 수 있다. 가도형정보는 가도형, 가숫자 및 가기호에 관한 정보를 포함할 수 있다. 가도형은 가 도형의 외곽을 이루는 복수의 라인을 포함할 수 있다. 가숫자는 상기 복수의 라인에 대응하는 길이 정 보일 수 있다. 가기호는 상기 복수의 라인 간 형성되는 각의 정보일 수 있다. 또한, 각 표시 가기호는 각도 정 보를 포함할 수 있다. 본 발명의 실시예에서 나타나는 모든 가숫자의 단위는 mm, cm 및 m 중 적어도 하나 일수 있으나, 이에 제한 되는 것은 아니다. 즉, 전자 장치는 제3이미지로부터 가도형정보를 획득할 수 있다. 여기서 가도형정보는 가도형의 형태, 가도형의 외곽을 이루는 복수의 라인 및 가숫자 등을 포함할 수 있다. 이때, 가도형정보는 메모 리에 저장될 수 있다. 이어서, 상기 제3이미지 상의 상기 심볼에 관한 심볼정보를 획득하는 심볼정보 획득 단계(S3300)가 전자 장 치에 의해 진행될 수 있다. 도 15를 참조하면, 심볼정보는 심볼에 관한 정보를 포함할 수 있다. 심볼은 가공 예정 상태를 의미할 수 있으며, 도형부 및 심볼수치부를 포함할 수 있다. 하나의 가도형에는 하나의 심볼이 도시될 수 있으나, 하나의 가도형에는 복수의 심볼이 도시될 수도 있다. 복수의 심볼이 도시된 것은 하나의 소재에 복수의 가공 예정 구역이 존재한다는 것을 의미한다. 심볼정보 획득 단계(S3300)는 가도형정보 획득 단계(S3200) 이후에 진행될 수 있고, 가도형정보 획득 단계 (S3200)와 동시에 진행될 수 있으며, 가도형정보 획득 단계(S3200)보다 먼저 진행될 수 있다. 최종적으로, 심볼 정보 및 가도형정보는 가도면에 도시된 도면을 가공하는 과정에서 이용될 수 있다. 이어서, 상기 심볼정보를 상기 가도형정보에 적용하여 제2최종도형을 획득하는 제2최종도형 획득 단 계(S3400)가 전자 장치에 의해 진행될 수 있다. 도 16은 중간도형으로부터 제2최종도형이 형성되는 과정을 나타내는 도면이다. 도 17은 제2최종도형을 나타낸 도면이다. 도 16을 참조하면, 심볼정보는 가도형정보에 적용될 수 있다. 심볼은, 가도형 상에 또는 가도형에 적어도 일부가 중첩된 형태로 도시되어 있으며, 가공 예정 상태를 의미한다. 구체적으로, 전자 장치는 가도형정보를 이용하여 중간도형을 형성할 수 있다. 중간도형은 가도 형에 심볼이 그대로 도시된 상태의 것을 의미한다. 중간도형은 후술할 왜곡 요소가 제거된 것일 수 있다. 도 17을 참조하면, 전자 장치는 중간도형에서 심볼을 제거하고, 제거된 위치에 제거된 심볼(2 0)을 적용하여 제2최종도형을 형성할 수 있다. 즉, 제2최종도형이란 심볼이 의미하는 가공 예정 정보를 가도형정보에 적용하여, 최종적으로 정형화된 상태의 가도형을 의미한다.전자 장치는 가도면의 제3이미지를 획득하고, 가도형정보 및 심볼정보를 획득하며, 가도형정보에 심볼정 보를 적용하여 제2최종도형을 형성할 수 있다. 즉, 전자 장치는 가도면을 제2최종도형으로 정 형화할 수 있다. 다음으로, 가도형정보 획득 과정(S3200)에 대하여 살펴본다. 본 발명의 실시예에 따른 상기 가도형정보 획득 단계(S3200)는, 상기 제3이미지의 픽셀의 색을 기준으로 상기 가도형의 외곽을 형성하는 복수의 라인을 인식하는 단계(S3210); 상기 복수의 라인에 대응하는 복수의 가숫 자를 인식하는 단계(S3220); 및 상기 인식된 복수의 라인 및 상기 인식된 복수의 가숫자에 기초하여 상 기 가도형정보를 획득하는 단계(S3230);를 포함할 수 있다. 먼저, 상기 제3이미지의 픽셀의 색을 기준으로 상기 가도형의 외곽을 형성하는 복수의 라인을 인식하는 단 계(S3210)가 전자 장치에 의해 수행될 수 있다. 가도형정보를 획득하기 위해서, 전자 장치는 제3이미지의 픽셀을 색에 따라 가도형의 외곽 라인을 인 식할 수 있다. 전자 장치는 픽셀의 색을 기준으로 라인과 라인이 아닌 부분을 인식할 수 있다. 상기 복수 의 라인을 인식하는 단계(S3210)는 라인 인식 알고리즘을 통해 수행될 수 있다. 예를 들어, 검은 색에 해당하는 픽셀은 라인으로 인식되고, 흰 색에 해당하는 픽셀은 배경으로 인식될 수 있다. 단, 라인과 배경의 색은 각각 검은색, 흰색에 한정되는 것은 아니고, 서로 구분되는 색이면 가능하다. 또한, 복수의 라인을 인식하는 단계(S3210) 전에, 상기 제3이미지를 그레이 스케일화 하는 단계 또는 상기 제3 이미지를 이진화 하는 단계가 진행될 수 있다. 그레이스케일화 또는 이진화는 인식의 대상이 되는 라인과 인식 의 대상이 아닌 배경을 쉽게 구분할 수 있게 한다. 특히, 제3이미지를 이진화하는 경우에는 라인은 흰색으로, 배경은 검은색으로 변환될 수 있다. 즉, 라인의 인식을 용이하게 하기 위하여 제3이미지를 회색조로 표현하거나, 흑과 백의 두 가지 색으로만 표현 하는 단계가 선행될 수 있다. 이어서, 상기 복수의 라인에 대응하는 복수의 가숫자를 인식하는 단계(S3220)가 전자 장치에 의해 수 행될 수 있다. 복수의 라인은 가도형의 외곽 라인을 의미한다. 따라서, 가도면에는 복수의 라인에 대응하는 복수의 가숫자 가 함께 도시될 수 있으므로, 복수의 라인과 함께, 가숫자가 인식될 필요가 있다. 전자 장치는 각 라인에 대응하는 각 가숫자를 인식할 수 있다. 가숫자 인식은 가숫자인식모델에 의해 수행될 수 있다. 가숫자인식모델은 제2인공지능모델로서, 사전에 가숫자 데이터셋을 이용하여 학습될 수 있다. 가숫자인식모델은 학습된 데이터를 기반으로 제3이미지 상의 가숫자들을 인식할 수 있다. 이어서, 상기 인식된 복수의 라인 및 상기 인식된 복수의 가숫자에 기초하여 상기 가도형정보를 획득하는 단계(S3230)가 진행될 수 있다. 전자 장치는 복수의 라인을 인식할 수 있고, 복수의 라인에 대응하는 복수의 가숫자를 인식할 수 있 다. 전자 장치는 복수의 라인에 관한 정보 및 복수의 가숫자에 대한 정보를 이용하여 가도형정보를 획득할 수 있다. 이때, 가도형정보는 복수의 라인, 복수의 라인이 형성하는 각 및 복수의 라인에 대응하는 복수 의 가숫자를 포함할 수 있다. 나아가, 가도형정보는 복수의 라인이 형성하는 각 및 각도를 나타내는 가기호 및 가숫자를 포함할 수 있다. 가도형의 코너에 각의 크기가 표시된 경우, 전자 장치는 상기 표시를 코너의 각도로 인식할 수 있다. 반대로, 가도형의 코너에 각의 크기가 표시되지 않은 경우, 전자 장치는 꼭짓점의 각도를 90도로 하 여 가도형정보로 인식할 수 있다. 이로써, 본 발명의 실시예에 따른 도면 생성 방법은, 비정형적으로 그려진 가 도형을 정형화시킴으로써, 소재의 제조 및 가공 시간을 감소시킬 수 있다. 전자 장치는 가도형정보를 획득하여, 제2최종도형을 형성하기 위한 기초 자료로 이용할 수 있다. 다음으로, 가도면 상의 가도형을 보정하는 단계에 대하여 살펴본다. 도 18은 왜곡 요소의 예를 나타낸 도면이다. 도 18을 참조하면, 본 발명의 실시예에 따른 도면 생성 방법은, 상기 가도형정보 획득 단계(S3200)에서 획득한 가도형정보에 따라 상기 가도형이 왜곡 요소를 가지는 경우, 상기 왜곡 요소를 제거하는 보정 단계를 더 포 함할 수 있다. 전자 장치는 가도면의 제3이미지로부터 가도형을 포함하는 가도형정보를 획득할 수 있으며, 이때, 가 도형은 왜곡 요소를 포함할 수 있다. 왜곡 요소는 제1유형 내지 제4유형으로 구분될 수 있다. 그러나, 이에 한정되는 것은 아니다. 제1유형은 도 18(a)와 같이 가도형이 곡선부를 포함하는 경우를 의미한다. 이때, 전자 장치는 곡 선부를 직선으로 변경하는 보정을 할 수 있다. 제2유형은 도 18(b)와 같이 가도형이 돌출부를 포함하는 경우를 의미한다. 이때, 전자 장치는 돌출부를 제거하는 보정을 할 수 있다. 제3유형은 도 18(c)와 같이 가도형이 90도가 아닌 코너를 포함하는 경우를 의미한다. 90도가 아닌 코너 를 포함하는 경우란, 가도형의 코너에 각도의 표기가 없는 경우를 의미한다. 이때, 전자 장치는 90도가 아닌 코너를 90도로 변경하는 보정을 할 수 있다. 제4유형은 도 18(d)와 같이 가도형이 절단부를 포함하는 경우를 의미한다. 이때, 전자 장치는 가 도형의 절단부에 해당하는 라인을 연장하여 연결시키는 보정을 할 수 있다. 나아가, 하나의 가도형은 복수의 왜곡 요소를 포함할 수 있다. 이때, 전자 장치는 복수의 왜곡 요소 를 모두 보정할 수 있다. 손으로 가도형을 그리는 경우, 가도형은 상술한 바와 같이 곡선부, 돌출부, 90도가 아닌 코너 및 절단부 중 적어도 하나를 포함할 수 있기 때문에, 왜곡 요소를 제거하는 보정 단계를 통해 전자 장 치는 정형화된 가도형을 획득할 수 있다. 이는 2D 도면을 새로 그리는 과정을 생략할 수 있어 소재를 제조 및 가공하는 과정에서 시간 및 비용은 감소될 수 있다. 다음으로, 심볼정보 획득 단계(S3300)에 대하여 살펴본다. 본 발명의 실시예에 따른 심볼정보 획득 단계(S3300)는, 상기 제3이미지 상에서 상기 가도형 및 상기 심볼 을 포함하는 관심영역을 특정하는 단계(S3310); 상기 관심영역 내에서 제2인공지능모델에 의해 상 기 심볼을 분류하는 단계(S3320); 및 상기 분류된 심볼에 대한 상기 심볼정보를 획득하는 단계(S333 0);를 포함할 수 있다. 먼저, 상기 제3이미지 상에서 상기 가도형 및 상기 심볼을 포함하는 관심영역을 특정하는 단계 (S3310)가 전자 장치에 의해 진행될 수 있다. 전자 장치가 심볼을 찾는 것은 관심영역 내에서 이루어질 수 있다. 제3이미지가 복수의 가도형 을 포함하는 경우, 복수의 가도형을 각각 포함하는 복수의 분석영역이 특정될 수 있으므로, 관심영 역은 복수의 분석영역 중 하나의 영역을 의미할 수 있다. 관심영역은 가도형 및 심볼을 포함할 수 있다. 전자 장치는 관심영역 내에서 가도형 상에 위치하거나 가도형과 적어도 일부가 중첩되는 심볼을 찾을 수 있다. 즉, 이 단계는 복수의 분석영 역 중 해당 가도형에 해당하는 심볼을 찾기 위해 하나의 분석영역을 관심영역으로 특정하 는 것이다. 도 19는 가도면이 정형화된 상태를 나타낸 도면이다. 도 20은 가도면이 정형화된 상태를 나타낸 도면이다. 이어서, 상기 관심영역 내에서 제2인공지능모델에 의해 상기 심볼을 분류하는 단계(S3320)가 전자 장치 에 의해 진행될 수 있다. 제2인공지능모델은 학습된 모델을 의미한다. 제2인공지능모델은 심볼을 나타내는 심볼이미지를 이용하여 학 습될 수 있다. 심볼을 나타내는 심볼이미지는 라벨링데이터로써, 제2인공지능모델을 학습시킬 수 있다. 또 한, 제2인공지능모델은 가숫자이미지 및/또는 문자이미지를 이용하여 학습될 수 있다. 가숫자이미지 및/또는 문자이미지는 라벨링데이터로써 제2인공지능모델을 학습시킬 수 있다. 학습된 제2인공지능모델은 심볼을 분류할 수 있고, 심볼에 관한 가숫자를 분류할 수 있다. 심볼의 예는 도 19(a) 내지 도 19(d) 및 도 20(e) 내지 도 20(h)의 화살표 좌측에서 확인할 수 있다. 심볼은 다음 에서 설명되는 예에 한정되는 것은 아니다. 도 19(a)의 심볼은 천공할 것을 의미한다. '30'은 가도형의 좌측라인에서부터 떨어진 거리를 의미하고, '70'은 가도형의 하측라인에서부터 떨어진 거리를 의미하며, '*?*50'은 천공할 원의 둘레를 의미한다. 도 19(b)의 심볼은 코너를 둥글게 깎을 것을 의미한다. 'R10'은 반지름 10을 가지는 곡률을 의미한다. 즉, 상기 심볼은 가도형의 코너를 R10의 곡률로 깎을 것을 의미한다. 도 19(c)의 심볼은 코너를 직선으로 깎을 것을 의미한다. '100*100'은 가로*세로 형으로 표기된 것으로 가 로 100 및 세로 100의 길이를 의미한다. 즉, 상기 심볼은 가도형의 코너를 가로 100 및 세로 100의 크 기로 깎을 것을 의미한다. 도 19(d)의 심볼은 코너를 직선으로 깎을 것을 의미한다. '100'은 코너를 깎은 후 새로 형성된 라인의 길이 를 의미한다. 즉, 상기 심볼은 가도형의 코너를 100 길이의 직선으로 깎을 것을 의미한다. 도 20(e)의 심볼은 모서리를 깎을 것을 의미한다. '100'은 가도형의 상측라인으로부터 도 20(e)의 가도 형에서 외부로 연장되는 라인까지의 거리를 의미하고, '50'은 각각 해당하는 라인의 길이를 의미한다. 즉, 상기 심볼은 도 20(e)의 화살표 우측에 나타난 바와 같이 모서리를 깎을 것을 의미한다. 도 20(f)의 심볼은 모서리를 깎을 것을 의미한다. '100'은 가도형의 상측라인으로부터 도 20(f)의 가도 형에서 외부로 연장되는 라인까지의 거리를 의미하고, '50'은 각각 해당하는 라인의 길이를 의미한다. 즉, 상기 심볼은 도 20(f)의 화살표 우측에 나타난 바와 같이 모서리를 깎을 것을 의미한다. 도 20(g)의 심볼은 코너를 사각 모양으로 깎을 것을 의미한다. '100*100'은 가로*세로 형으로 표기된 것으 로 가로 100 및 세로 100의 길이를 의미한다. 즉, 상기 심볼은 가도형의 코너를 가로 100 및 세로 100 의 길이로 깎을 것을 의미한다. 도 20(h)의 심볼은 코너를 사각 모양으로 천공할 것을 의미한다. '100'은 하측라인으로부터 해당 라인까지 의 거리를 의미한다. '50'은 각각 사각 모양의 가로 및 세로 길이를 의미한다. 즉 상기 심볼은 도 20(h)의 화살표 우측에 나타난 바와 같이 천공할 것을 의미한다. 상술한 바와 같이, 전자 장치는 관심영역 내에서 심볼을 찾을 수 있고, 제2인공지능모델에 의해 상기 심볼을 분류할 수 있다. 관심영역 내의 심볼을 복수로 존재할 수 있으므로, 전자 장치 는 제2인공지능모델에 의해 복수의 심볼을 분류할 수 있다. 또한, 전자 장치는 제2인공지능모델에 의 해 심볼에 대응하는 문자 및/또는 가숫자를 분류할 수 있다. 이어서, 상기 분류된 심볼에 대한 상기 심볼정보를 획득하는 단계(S3330)가 전자 장치에 의해 진행될 수 있다. 전자 장치는 분류된 심볼에 대한 심볼정보를 획득할 수 있다. 또한, 상기 분류된 심볼에 대응하 는 문자 및/또는 가숫자에 대한 심볼정보를 획득할 수 있다. 심볼정보는 상기 심볼과 문자 및/또는 가숫자 에 의해 가공 예정 상태에 대한 데이터를 포함할 수 있다. 이와 같은 심볼정보는 후술하게 될 제2최종도형 획득 단계(S3400)에 이용될 수 있다. 다음으로, 제2최종도형 획득 단계(S3400)에 대하여 살펴본다. 도 16을 다시 참조하면, 본 발명의 실시예에 따른 제2최종도형 획득 단계(S3400)는, 상기 획득한 가도형정 보를 이용하여 중간도형을 형성하는 단계(S3410); 상기 형성된 중간도형에 상기 심볼에 해당하는 부분을 제거하는 단계(S3420); 및 상기 중간도형 중 상기 심볼이 제거된 위치에, 상기 심볼정보를 사 용하여 상기 제2최종도형을 형성하는 단계(S3430)를 포함할 수 있다. 먼저, 상기 획득한 가도형정보를 이용하여 중간도형을 형성하는 단계(S3410)가 진행될 수 있다. 전자 장치 는 가도면의 제3이미지로부터 가도형정보 및 심볼정보를 획득할 수 있다. 전자 장치는 획득한 가도 형정보 및/또는 심볼정보를 이용하여 중간도형을 형성할 수 있다. 중간도형은 가도형 및 심볼로 이루어진 가도형을 의미한다. 중간도형은 최초에 획득한 제3이미지 상의 가도형과 심볼 로 이루어질 수 있고, 왜곡 요소를 제거하는 보정을 거친 보정된 중간도형일 수 있다. 이어서, 상기 형성된 중간도형에 상기 심볼에 해당하는 부분을 제거하는 단계(S3420)가 전자 장치 에 의해 진행될 수 있다. 중간도형에는 심볼 및 가도형이 모두 포함되어 있으므로, 심볼 부분을 삭제할 필요가 있다. 도 16의 중앙 도면을 참조하면, 전자 장치는 중간도형의 심볼을 제거할 수 있다. 즉, 전자 장치 는 심볼과 중첩되는 부분을 제거할 수 있다. 이어서, 상기 심볼정보를 사용하여 상기 제2최종도형을 형성하는 단계(S3430)가 전자 장치에 의해 진행될 수 있다. 제2최종도형에서 심볼과 중첩되는 부분이 제거되었으므로, 전자 장치는 심볼이 제거된 부분 에 제거된 심볼이 의미하는 가공 예정 상태를 적용한 제2최종도형을 형성할 수 있다. 제2최종도형 은 실제 소재의 외곽선 및 가공될 상태를 나타낸 도면을 의미한다. 즉, 전자 장치는 중간도형 을 이용하여 제2최종도형을 형성하여, 가도면을 정형화시킬 수 있다. 이와 같이, 제2최종도형 획득 단계(S3400)를 통해 전자 장치는 자동으로 캐드 등의 도면파일을 생성 하기 위한 도면 자료를 얻을 수 있다. 이로써, 본 발명의 실시예에 따른 도면 생성 방법에 의해 수작업으로 간 략하게 도시된 가도면을 통해 도면 작업을 수행하는 시간을 절약할 수 있다. 다음으로, 더 구체적으로 심볼정보를 사용하여 제2최종도형을 형성하는 단계(S3430)에 대하여 살펴본다. 본 발명의 실시예에 따른, 상기 심볼정보를 사용하여 상기 제2최종도형을 형성하는 단계는, 상기 심볼정보 의 심볼수치부를 이용하여 상기 심볼정보의 도형부에 대응하는 정형화 데이터를 상기 중간도형에 대입하는 단계일 수 있다. 도 16을 다시 참조하면, 심볼정보는 심볼수치부 및 도형부를 포함할 수 있다. 또한, 심볼수치부는 심볼에 대응하는 가숫자 및/또는 가문자를 의미하고, 가공 예정 상태를 나타내는 가공 위치, 가공 크기 등 을 의미할 수 있다. 도형부는 심볼 형상 자체를 의미하고, 가공 예정 상태를 의미할 수 있다. 전자 장치는 심볼수치부를 이용하여 도형부에 대응하는 정형화 데이터를 획득할 수 있으며, 획득 한 정형화 데이터를 중간 가도형에 대입할 수 있다. 정형화 데이터는 도 16의 가장 우측에서 나타난 것과 같이, 가도형의 좌측상부를 곡선으로 깎는다는 가도면의 가공정보를 가지고 가도형의 우측하부를 직선 으로 깎는다는 가도면의 가공정보를 가질 수 있다. 즉, 전자 장치는 정형화 데이터를 통해 제2최종도형의 형태를 형성할 수 있다. 이로써, 전자 장치 는 심볼 제3이미지로부터 정형화 데이터를 확보함으로써, 가도면을 정형화시켜 도면 작업을 수행하는 시간을 단축시킬 수 있다. 다음으로, 본 발명의 실시예에 따른 도면 생성 방법은, 상기 제2최종도형을 이용하여 도면파일을 생성하는 단계(S3500);를 더 포함할 수 있다. 전자 장치는 제2최종도형을 형성할 수 있다. 전자 장치는 제2최종도형을 통해 도면파일 을 생성할 수 있다. 도면파일은 소재의 2D 또는 3D 이미지를 포함할 수 있다. 도면파일은 STEP, STP, STL 및 DWG 중 적어도 하나로 이루어질 수 있다. 그러나, 도면파일은 나열한 예에 한정되는 것은 아니며 컴퓨터 프로그 램으로 활용될 수 있고, 제2최종도형을 표현할 수 있는 다양한 확장자를 가질 수 있다. 다음으로, 심볼을 인식할 수 없는 경우에 대하여 살펴본다. 본 발명의 실시예에 따른, 도면 생성 방법은, 상기 심볼정보 획득 단계에서, 상기 심볼이 인식되지 않는 경 우, 상기 가도면 상의 상기 심볼을 심볼규약에 따라 다시 도시하도록 알림 신호를 출력부에 제공하는 알림 제공 단계(S3600)를 더 포함할 수 있다. 제2인공지능모델은 심볼에 관한 심볼정보를 획득할 수 있다. 그러나, 제2인공지능모델에 의해 심볼이 인식되지 않는 경우가 발생할 수 있다. 심볼이 인식되지 않는 경우는 심볼의 도형부를 인식할 수없는 경우이거나, 심볼의 심볼수치부의 필수적 요소가 흠결된 경우를 의미한다. 심볼의 도형부를 인식할 수 없는 경우란, 제2인공지능모델이 심볼을 분류할 때 심볼의 일치율 이 0.5보다 작은 경우를 의미할 수 있다. 또한, 심볼의 심볼수치부의 필수적 요소가 흠결된 경우란, 심 볼에 대응하는 가숫자가 없거나 잘못된 가문자가 기재된 경우를 의미한다. 심볼이 인식되지 않는 경우, 잘못된 심볼정보로 제2최종도형이 형성되는 경우가 발생할 수 있다. 정확 도를 높이기 위하여, 전자 장치는 제3이미지 상의 심볼을 다시 도시하도록 출력부를 통해 알림 신호를 제공할 수 있다. 이때, 전자 장치는 심볼규약에 따라 심볼을 다시 도시하도록 알림 신호를 제공할 수 있다. 전자 장치 가 인식할 수 있는 심볼은 메모리에 저장된 심볼 유형에 한정될 수 있고, 제2인공지능모델 에 의해 학습된 심볼 유형에 한정될 수 있다. 전자 장치가 활용할 수 있는 정보로써 심볼정보를 활용 하기 위해서는 심볼은 이미 약속된 심볼규약을 따라야한다. 심볼규약에 따라 도시된 예는 도 19 및 도 20에 서 화살표 좌측에서 볼 수 있다. 도 21은 심볼이 심볼규약에 어긋난 경우를 나타낸 도면이다. 도 21을 참조하면, 심볼규약에 따라 도시되지 않은 심볼은 무의미한 심볼로 전자 장치가 활용할 수 없다. 따라서, 전자 장치는 제3이미지 상의 심볼을 다시 도시하도록 출력부를 통해 알림 신 호를 제공할 수 있다. 도 21(a)의 심볼 표기는 도 19(b)와 달리 'R'이 기재되지 않아 심볼규약에 어긋난 것이고, 이것은 전자 장 치 및/또는 제2인공지능모델에 의해 심볼이 인식되지 않는 경우에 해당할 수 잇다. 도 21(b)의 심볼 표기는 도형부는 '삼각형'이고, 심볼수치부는 'R10'인 곡률을 표현하고 있어 심볼 규약에 어긋난 것이고, 이것은 심볼이 인식되지 않는 경우에 해당할 수 있다. 또한, 이경우 제2인공지능모 델이 심볼을 분류하는 과정에서 일치율이 0.5 이하로 나타날 수 있다. 도 21(c)의 심볼 표기는 도 19(b)와 달리 '10'이 기재되지 않아 심볼규약에 어긋난 것이고, 이것은 심볼 이 인식되지 않는 경우에 해당할 수 있다. 상술한 바와 같이 심볼이 심볼규약에 어긋나는 경우 또는 심볼이 인식되지 않는 경우, 전자 장치(100 0)는 심볼을 심볼규약에 따라 다시 도시할 수 있도록, 알림 신호를 출력부에 제공할 수 있다. 또한, 제2인공지능모델에 의해 가장 높은 일치율을 가지는 심볼규약에 맞는 심볼의 도형부 및 심볼수치 부의 입력 가이드를 출력부에 제공할 수 있다. 즉, 도 21(a)처럼 심볼이 인식되지 않는 경우, 전 자 장치는 도 19(b)와 같은 입력 가이드를 제공할 수 있다. 이때, 사용자는 입력 가이드를 참고하여, 심 볼규약에 맞도록 가도면을 다시 그릴 수 있다. 결국, 전자 장치는 알림 신호를 제공하는 단계(S3600)을 통하여 도면 생성 방법의 인식률 및 정확도를 향 상시킬 수 있다. 또한, 전자 장치는 정확하게 제2최종도형을 형성시키고 도면파일을 생성시킴으로써, 도면 작업의 수행 시간을 감소시킬 수 있다. 다음으로, 제3이미지에서 복수의 가도형을 포함하는 경우에 대하여 살펴본다. 본 발명의 실시예에 따른 도면 생성 방법은, 상기 제3이미지는 복수의 가도형을 포함하고, 상기 제3이미지 를 획득하는 단계 후, 상기 제3이미지에서 복수의 가도형을 각각 포함하는 복수의 분석영역을 특정하는 단계;를 더 포함하며, 상기 가도형정보를 획득하는 단계, 상기 심볼정보를 획득하는 단계 및 상기 제2최종도형 을 획득하는 단계는, 상기 복수의 분석영역에 대해 각각 이루어질 수 있다. 도 4을 다시 참조하면, 제3이미지는 하나의 가도형만을 포함할 수 있으나, 복수의 가도형을 포함할 수 있다. 이때, 전자 장치는 복수의 가도형을 인식하기 위해 각 가도형을 포함하는 복수의 분석영역 을 특정할 수 있다. 복수의 분석영역은 그 개별 단위인 관심영역으로 표현될 수 있다. 복수의 객체를 특정하기 위하여, 객체탐지모델이 이용될 수 있다. 객체탐지모델은 각 가도형을 인식할 수 있고, 각 가도형을 포함하는 복수의 분석영역을 특정할 수 있다. 객체탐지모델은 인공지능으로 이루어 진 모델일 수 있고, 대표적으로 CNN계열의 모델일 수 있다. 객체탐지모델은 다양한 가도형으로 이루어진 제3이미지를 이용하여 학습될 수 있고, 학습된 객체탐지모델은 다양한 종류의 가도형을 인식하여 분석영역 을 특정할 수 있다. 이로써, 복수의 가도형을 포함하는 가도면의 제3이미지 하나를 이용하여, 복수의 가도형을 동시에 정형 화시킴으로써, 도면 작업을 수행하는 시간 및 비용을 절약할 수 있다. 이하에서, 본 발명의 실시예에 따른 도면 생성 장치에 대하여 살펴본다. 도 22는 본 발명의 실시예에 따른 도면 생성 장치를 나타낸 블록도이다. 도 22를 참조하면, 본 발명의 실시예에 따른 도면 생성 장치는, 프로세서;를 포함하고, 상기 프로세서 는, 가도형 및 심볼을 포함하는 가도면의 제3이미지를 획득하고, 상기 제3이미지 상의 상기 가도 형에 관한 가도형정보를 획득하고, 상기 제3이미지 상의 상기 심볼에 관한 심볼정보를 획득하고, 상기 심볼정보를 상기 가도형정보에 적용하여 제2최종도형을 획득할 수 있다. 본 발명의 실시예에 따른 도면 생성 장치는 프로세서를 포함할 수 있다. 프로세서는 상술한 도면 생성 방법을 수행할 수 있다. 또한, 본 발명의 실시예에 따른 도면 생성 장치는 메모리를 더 포함할 수 있고, 메모리는 도면 생성 방법을 수행하는 프로그램을 저장할 수 있다. 또한, 메모리는 제1이미지 내지 제3이미지, 도면파일, 생성도형, 제1최종도형 및 제2최종도형 정보 중 적어도 하나를 저장 할 수 있다. 또한, 본 발명의 실시예에 따른 도면 생성 장치는 출력부를 더 포함할 수 있다. 출력부는 가공도형 , 제1최종도형 및 제2최종도형을 디스플레이할 수 있다. 또한, 출력부는 음향 출력부를 통해 알림 신호를 오디오 신호로 사용자에게 전달할 수 있고, 디스플레이부를 통해 사용자에게 전달할 수 있다. 출력부는 입력 가이드를 음향 출력부 또는 디스플레이부를 통해 사용자에게 전달할 수 있다. 또한, 본 발명의 실시예에 따른 도면 생성 장치는 통신부를 더 포함할 수 있다. 통신부는 가공도형 , 제1최종도형 및 제2최종도형 정보, 도면파일 및 제1이미지 내지 제3이미지 중 적어도 하나를 외부 장치에 송신하거나 외부 장치로부터 수신할 수 있다. 또한, 본 발명의 실시예에 따른 도면 생성 장치는 촬영수단을 더 포함할 수 있다. 촬영수단은 수치 부와 분별부 및 가도면을 촬영하여 제1이미지 내지 제3이미지를 획득할 수 있다. 한편, 컴퓨터로 판독 가능한 기록 매체는 본 발명의 실시예에 따른 도면 생성 방법을 수행하는 프로그램을 기록 할 수 있다. 상기 기록 매체는 도면 생성 장치를 동작시킬 수 있다. 상기 기록 매체는 메모리일 수 있다. 제1최종도형의 형성은 심볼이 적용되지 않은 가도형을 이용한 과정이며, 제2최종도형의 형성 은 심볼이 적용된 가도형을 이용한 과정이다. 제1최종도형 및 제2최종도형을 형성과정은 심 볼 부분을 제외한 모든 부분을 동일하게 해석할 수 있다. 제2이미지 및 제3이미지는 심볼 부분을 제외 한 모든 부분을 동일하게 해석할 수 있다. 또한, 가공도형, 제1최종도형 및 제2최종도형을 형성하는 도면 생성 방법은 프로세서에 의해 수행될 수 있으며, 구체적으로 도면 생성 장치에 의해 수행될 수 있다. 나아가, 도면 생성 장치는 전자 장 치로 이루어질 수 있다. 전술한 바와 같이, 본 발명의 바람직한 실시 예를 참조하여 설명하였지만, 해당 기술 분야의 통상의 기술자는 하기의 특허 청구범위에 기재된 본 발명의 사상 및 영역에서 벗어나지 않는 범위 내에서 본 발명을 다양하게 수 정 또는 변형하여 실시할 수 있다."}
{"patent_id": "10-2022-0029380", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 제1이미지를 이용하는 도면 생성 방법을 나타낸 순서도이다. 도 2는 도면 정보에 기반하여 생성된 가공도형을 나타낸 도면이다. 도 3은 수치부, 분별부, 수량부 및 가공부의 예를 나타낸 도면이다. 도 4는 제1인공지능모델에 의해 분류되는 숫자 및 기호를 나타내는 도면이다. 도 5는 기호의 종류에 따른 가공도형의 종류의 예시를 나타낸 도면이다. 도 6은 사각형으로 인식된 가공도형의 예시를 나타낸 도면이다. 도 7은 삼각형으로 인식된 가공도형의 예시를 나타낸 도면이다. 도 8은 원으로 인식된 가공도형의 예시를 나타낸 도면이다. 도 9는 본 발명의 실시예에 따른 제2이미지를 이용하는 도면 생성 방법을 나타낸 순서도이다. 도 10은 가도면의 제2이미지에서 구분된 분석영역을 나타낸 도면이다. 도 11은 가도형정보에 기반하여 제1최종도형이 형성되는 과정을 나타낸 도면이다. 도 12는 본 발명의 실시예에 따른 제3이미지를 이용하는 도면 생성 방법을 나타낸 순서도이다. 도 13은 복수의 가도형을 포함하는 가도면의 제3이미지를 나타낸 도면이다. 도 14는 가도면의 제3이미지에서 구분된 분석영역을 나타낸 도면이다. 도 15는 관심영역 내에서 인식되는 심볼을 나타낸 도면이다. 도 16은 중간도형으로부터 제2최종도형이 형성되는 과정을 나타내는 도면이다. 도 17은 제2최종도형을 나타낸 도면이다. 도 18은 왜곡 요소의 예를 나타낸 도면이다. 도 19는 가도면이 정형화된 상태를 나타낸 도면이다. 도 20은 가도면이 정형화된 상태를 나타낸 도면이다. 도 21은 심볼이 심볼규약에 어긋난 경우를 나타낸 도면이다. 도 22는 본 발명의 실시예에 따른 도면 생성 장치를 나타낸 블록도이다."}
