{"patent_id": "10-2023-0131358", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0048827", "출원번호": "10-2023-0131358", "발명의 명칭": "서스펜드 파라미터 결정 장치 및 그 방법", "출원인": "에스케이하이닉스 주식회사", "발명자": "정인호"}}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스토리지 장치의 전력 소비량 정보를 모니터링하는 전력 모니터링 회로;인공 지능 모델을 저장하는 메모리 장치; 및상기 인공 지능 모델을 로드하고,상기 스토리지 장치에 대한 성능 정보 및 상기 전력 모니터링 회로에서 입력받은 상기 스토리지 장치의 전력 소비량 정보를 상기 인공 지능 모델에 입력하고,상기 인공 지능 모델이 출력한 서스펜드 파라미터를 상기 스토리지 장치로 전송하는 제어 회로;를 포함하고,상기 서스펜드 파라미터는,상기 스토리지 장치가 실행 중인 프로그램 동작 또는 소거 동작에 대한 서스펜드 동작을 제어하기 위해 사용되는 파라미터인 서스펜드 파라미터 결정 장치."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 성능 정보는,소정의 시구간 동안 상기 스토리지 장치에 리드 또는 라이트된 데이터의 크기를 지시하는 데이터 스루풋 정보및 상기 스토리지 장치에 전송한 리드 커맨드들 중 기준 처리 시간 내에 처리된 리드 커맨드들의 비율을 지시하는 지연 정보 중 적어도 하나를 포함하는 서스펜드 파라미터 결정 장치."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 전력 소비량 정보는,소정의 시구간 동안 상기 스토리지 장치의 피크 전력 소비량 정보 및 상기 스토리지 장치의 평균 전력 소비량정보 중 적어도 하나를 포함하는 서스펜드 파라미터 결정 장치."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 인공 지능 모델은,강화 학습 모델인 서스펜드 파라미터 결정 장치."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 강화 학습 모델은,공개특허 10-2025-0048827-3-유전 알고리즘 모델, 입자 군집 최적화 모델 또는 개미 군집 최적화 모델인 서스펜드 파라미터 결정 장치."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 서스펜드 파라미터는,하나의 프로그램 동작이 서스펜드될 수 있는 최대 카운트를 지시하는 최대 프로그램 서스펜드 카운트, 하나의소거 동작이 서스펜드될 수 있는 최대 카운트를 지시하는 최대값을 지시하는 최대 소거 서스펜트 카운트, 하나의 프로그램 동작이 재개된 이후 서스펜드 불가능한 상태로 지속되는 시간을 지시하는 프로그램 재개 후 서스펜드 지연값 및 하나의 소거 동작이 재개된 이후 서스펜드 불가능한 상태로 지속되는 시간을 지시하는 소거 재개후 서스펜드 지연값 중 적어도 하나를 포함하는 서스펜드 파라미터 결정 장치."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "스토리지 장치에 대한 성능 정보를 측정하는 단계;상기 스토리지 장치의 전력 소비량 정보를 모니터링하는 단계;상기 성능 정보 및 상기 전력 소비량 정보를 인공 지능 모델에 입력하는 단계; 및상기 인공 지능 모델이 출력한 서스펜드 파라미터를 상기 스토리지 장치로 전송하는 단계;를 포함하고,상기 서스펜드 파라미터는,상기 스토리지 장치가 실행 중인 프로그램 동작 또는 소거 동작에 대한 서스펜드 동작을 제어하기 위해 사용되는 파라미터인 서스펜드 파라미터 결정 방법."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 성능 정보는,소정의 시구간 동안 상기 스토리지 장치에 리드 또는 라이트된 데이터의 크기를 지시하는 데이터 스루풋 정보및 상기 스토리지 장치에 전송한 리드 커맨드들 중 기준 처리 시간 내에 처리된 리드 커맨드들의 비율을 지시하는 지연 정보 중 적어도 하나를 포함하는 서스펜드 파라미터 결정 방법."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 전력 소비량 정보는,소정의 시구간 동안 상기 스토리지 장치의 피크 전력 소비량 정보 및 상기 스토리지 장치의 평균 전력 소비량정보 중 적어도 하나를 포함하는 서스펜드 파라미터 결정 방법."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 서스펜드 파라미터는,하나의 프로그램 동작이 서스펜드될 수 있는 최대 카운트를 지시하는 최대 프로그램 서스펜드 카운트, 하나의공개특허 10-2025-0048827-4-소거 동작이 서스펜드될 수 있는 최대 카운트를 지시하는 최대값을 지시하는 최대 소거 서스펜트 카운트, 하나의 프로그램 동작이 재개된 이후 서스펜드 불가능한 상태로 지속되는 시간을 지시하는 프로그램 재개 후 서스펜드 지연값 및 하나의 소거 동작이 재개된 이후 서스펜드 불가능한 상태로 지속되는 시간을 지시하는 소거 재개후 서스펜드 지연값 중 적어도 하나를 포함하는 서스펜드 파라미터 결정 방법."}
{"patent_id": "10-2023-0131358", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "스토리지 장치; 및상기 스토리지 장치의 전력 소비량 정보를 모니터링하고,상기 스토리지 장치에 대한 성능 정보 및 상기 스토리지 장치의 전력 소비량 정보를 인공 지능 모델에입력하고,상기 인공 지능 모델이 출력한 서스펜드 파라미터를 상기 스토리지 장치로 전송하는 서스펜드 파라미터 결정 장치;를 포함하고,상기 스토리지 장치는,상기 서스펜드 파라미터를 서스펜드 파라미터 테이블에 저장하고,상기 서스펜드 파라미터 테이블에 저장된 서스펜드 파라미터를 기초로, 실행 중인 프로그램 동작 또는 소거 동작에 대한 서스펜드 동작을 제어하는 시스템."}
{"patent_id": "10-2023-0131358", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "서스펜드 파라미터 결정 장치는 스토리지 장치의 전력 소비량 정보를 모니터링하는 전력 모니터링 회로, 인공 지 능 모델을 저장하는 메모리 장치 및 인공 지능 모델을 로드하고, 스토리지 장치에 대한 성능 정보 및 전력 모니 터링 회로에서 입력받은 스토리지 장치의 전력 소비량 정보를 인공 지능 모델에 입력하고, 인공 지능 모델이 출 력한 서스펜드 파라미터를 스토리지 장치로 전송하는 제어 회로를 포함할 수 있다."}
{"patent_id": "10-2023-0131358", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 서스펜드 파라미터 결정 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0131358", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스토리지 장치는 컴퓨터와, 스마트폰, 태블릿 등의 모바일 단말, 또는 각종 전자 기기와 같은 외부 장치의 요청 을 기초로 데이터를 저장하는 장치이다. 스토리지 장치는 메모리(e.g. 휘발성 메모리/비휘발성 메모리)를 제어하기 위한 컨트롤러를 더 포함할 수 있으 며, 이러한 컨트롤러는 외부 장치로부터 커맨드(Command)를 입력 받아, 입력 받은 커맨드에 기초하여 스토리지 장치에 포함된 메모리에 데이터를 리드(Read), 라이트(Write), 또는 소거(Erase) 하기 위한 동작들을 실행하거 나 제어할 수 있다. 스토리지 장치는 리드 동작에 대해 낮은 지연(latency)을 보장하기 위해서, 실행 중인 프로그램 동작 또는 소거 동작을 서스펜드하고 대신 리드 동작을 높은 우선 순위로 실행할 수 있다. 한편, 스토리지 장치가 프로그램 동작 또는 소거 동작을 서스펜드하는 횟수가 증가할 경우, 스토리지 장치에 대 한 사용자의 요구 성능을 만족할 가능성은 높아질 수 있다. 그러나, 서스펜드 동작으로 인해 프로그램 동작 또 는 소거 동작이 연장되어 스토리지 장치의 전력 소비량이 증가할 수 있다."}
{"patent_id": "10-2023-0131358", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 스토리지 장치에 대한 사용자의 요구 성능을 만족하면서 동시에 스토리지 장치의 전력 소 비량을 최적화할 수 있는 서스펜드 파라미터 결정 장치 및 그 방법을 제공할 수 있다."}
{"patent_id": "10-2023-0131358", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측면에서, 본 발명의 실시예들은 i) 스토리지 장치의 전력 소비량 정보를 모니터링하는 전력 모니터링 회로, ii) 인공 지능 모델을 저장하는 메모리 장치 및 iii) 인공 지능 모델을 로드하고, 스토리지 장치에 대한 성능 정보 및 전력 모니터링 회로에서 입력받은 스토리지 장치의 전력 소비량 정보를 인공 지능 모델에 입력하고, 인공 지능 모델이 출력한 서스펜드 파라미터를 스토리지 장치로 전송하는 제어 회로를 포함하는 서스펜드 파라미 터 결정 장치를 제공할 수 있다. 이때, 서스펜드 파라미터는 스토리지 장치가 실행 중인 프로그램 동작 또는 소 거 동작에 대한 서스펜드 동작을 제어하기 위해 사용될 수 있다. 다른 측면에서, 본 발명의 실시예들은 i) 스토리지 장치에 대한 성능 정보를 측정하는 단계, ii) 스토리지 장치 의 전력 소비량 정보를 모니터링하는 단계, iii) 성능 정보 및 전력 소비량 정보를 인공 지능 모델에 입력하는 단계 및 iv) 인공 지능 모델이 출력한 서스펜드 파라미터를 스토리지 장치로 전송하는 단계를 포함하는 서스펜 드 파라미터 결정 방법을 제공할 수 있다. 이때, 서스펜드 파라미터는 스토리지 장치가 실행 중인 프로그램 동 작 또는 소거 동작에 대한 서스펜드 동작을 제어하기 위해 사용될 수 있다. 또 다른 측면에서, 본 발명의 실시예들은 i) 스토리지 장치 및 ii) 스토리지 장치의 전력 소비량 정보를 모니터 링하고, 스토리지 장치에 대한 성능 정보 및 스토리지 장치의 전력 소비량 정보를 인공 지능 모델에 입력하고, 인공 지능 모델이 출력한 서스펜드 파라미터를 스토리지 장치로 전송하는 서스펜드 파라미터 결정 장치를 포함 하는 시스템을 제공할 수 있다. 이때, 스토리지 장치는 서스펜드 파라미터를 서스펜드 파라미터 테이블에 저장 하고, 서스펜드 파라미터 테이블에 저장된 서스펜드 파라미터를 기초로, 실행 중인 프로그램 동작 또는 소거 동 작에 대한 서스펜드 동작을 제어할 수 있다."}
{"patent_id": "10-2023-0131358", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 의하면, 스토리지 장치에 대한 사용자의 요구 성능을 만족하면서 동시에 스토리지 장치의 전력 소비량을 최적화할 수 있다."}
{"patent_id": "10-2023-0131358", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 본 발명의 실시예들을 첨부된 도면을 참조하여 상세히 설명한다. 도 1은 본 발명의 실시예들에 따른 스토리지 장치의 개략적인 구성도이다. 도 1을 참조하면, 본 발명의 실시예들에 따른 스토리지 장치는 데이터를 저장하는 메모리와, 메모리 를 제어하는 컨트롤러 등을 포함할 수 있다. 메모리는 다수의 메모리 블록(Memory Block)을 포함하며, 컨트롤러의 제어에 응답하여 동작한다. 여 기서, 메모리의 동작은 일 예로, 리드 동작(Read Operation), 프로그램 동작(Program Operation; \"Write Operation\" 이라고도 함) 및 소거 동작(Erasure Operation) 등을 포함할 수 있다. 메모리는 데이터를 저장하는 복수의 메모리 셀(Memory Cell; 간단히 줄여서 \"셀\" 이라고도 함)을 포함하는 메모리 셀 어레이(Memory Cell Array)를 포함할 수 있다. 이러한 메모리 셀 어레이는 메모리 블록 내에 존재할 수 있다. 예를 들어, 메모리는 낸드 플래시 메모리(NAND Flash Memory), 3차원 낸드 플래시 메모리(3D NAND Flash Memory), 노아 플래시 메모리(NOR Flash memory), 저항성 램(Resistive Random Access Memory: RRAM), 상변화 메모리(Phase-Change Memory: PRAM), 자기저항 메모리(Magnetoresistive Random Access Memory: MRAM), 강유전 체 메모리(Ferroelectric Random Access Memory: FRAM), 또는 스핀주입 자화반전 메모리(Spin Transfer Torque Random Access Memory: STT-RAM) 등으로 다양한 타입으로 구현될 수 있다. 한편, 메모리는 3차원 어레이 구조(three-Dimensional Array structure)로 구현될 수 있다. 본 발명의 실 시예들은 전하 저장층이 전도성 부유 게이트(Floating Gate)로 구성된 플래시 메모리는 물론, 전하 저장층이 절 연막으로 구성된 차지 트랩형 플래시(Charge Trap Flash; CTF)에도 적용될 수 있다. 메모리는 컨트롤러로부터 커맨드 및 어드레스 등을 수신하고, 메모리 셀 어레이 중 어드레스에 의해 선택된 영역을 액세스할 수 있다. 즉, 메모리는 어드레스에 의해 선택된 영역에 대해 커맨드가 지시하는 동작을 수행할 수 있다. 예를 들면, 메모리는 프로그램 동작, 리드 동작 및 소거 동작 등을 수행할 수 있다. 이와 관련하여, 프로 그램 동작을 수행할 때, 메모리는 어드레스에 의해 선택된 영역에 데이터를 프로그램 할 수 있다. 리드 동 작을 수행할 때, 메모리는 어드레스에 의해 선택된 영역으로부터 데이터를 읽을 수 있다. 소거 동작 시, 메모리는 어드레스에 의해 선택된 영역에 저장된 데이터를 소거할 수 있다. 컨트롤러는 메모리에 대한 쓰기(프로그램), 읽기, 소거 및 백그라운드(background) 동작을 제어할 수 있다. 여기서, 백그라운드 동작은 일 예로 가비지 컬렉션(GC, Garbage Collection), 웨어 레벨링(WL, Wear Leveling), 리드 리클레임(RR, Read Reclaim) 또는 배드 블록 관리(BBM, Bad Block Management) 동작 등 중 하 나 이상을 포함할 수 있다. 컨트롤러는 스토리지 장치의 외부에 위치하는 장치(e.g. 호스트(HOST))의 요청에 따라 메모리의 동작을 제어할 수 있다. 반면, 컨트롤러는 호스트(HOST)의 요청과 무관하게 메모리의 동작을 제어할 수도 있다. 호스트(HOST)는 컴퓨터, UMPC(Ultra Mobile PC), 워크스테이션, PDA(Personal Digital Assistants), 타블렛 (tablet), 모바일 폰(mobile phone), 스마트폰(smart phone), e-북(e-book), PMP(portable multimedia player), 휴대용 게임기, 네비게이션(navigation) 장치, 블랙박스(black box), 디지털 카메라(digital camera), DMB(Digital Multimedia Broadcasting) 재생기, 스마트 텔레비전(smart television), 디지털 음성 녹 음기(digital audio recorder), 디지털 음성 재생기(digital audio player), 디지털 영상 녹화기(digital picture recorder), 디지털 영상 재생기(digital picture player), 디지털 동영상 녹화기(digital video recorder), 디지털 동영상 재생기(digital video player), 데이터 센터를 구성하는 스토리지, 홈 네트워크를 구 성하는 다양한 전자 장치들 중 하나, 컴퓨터 네트워크를 구성하는 다양한 전자 장치들 중 하나, 텔레매틱스 네 트워크를 구성하는 다양한 전자 장치들 중 하나, RFID(radio frequency identification) 장치, 인간의 제어에 따라 주행하거나 또는 자율 주행이 가능한 이동 장치(e.g. 차량, 로봇, 드론) 등일 수 있다. 또는, 호스트 (HOST)는, 2차원 또는 3차원의 가상 현실 이미지를 제공하는 가상 현실(VR, virtual reality) 장치 또는 증강 현실 이미지를 제공하는 증강 현실(AR, augmented reality) 장치일 수 있다. 호스트(HOST)는, 이외에도, 데이터 를 저장할 수 있는 스토리지 장치가 요구되는 각종 전자 장치의 어느 하나일 수 있다. 호스트(HOST)는 적어도 하나의 운영 시스템(OS, operating system)을 포함할 수 있다. 운영 시스템은 호스트 (HOST)의 기능 및 동작을 전반적으로 관리 및 제어할 수 있고, 호스트(HOST)와 스토리지 장치 간의 상호 동작을 제어할 수 있다. 운영 시스템은 호스트(HOST)의 이동성(mobility)에 따라 일반 운영 시스템과 모바일 운 영 시스템으로 구분할 수 있다. 한편, 컨트롤러와 호스트(HOST)는 서로 분리된 장치일 수도 있다. 경우에 따라서, 컨트롤러와 호스트 (HOST)는 하나의 장치로 통합되어 구현될 수도 있다. 아래에서는, 설명의 편의를 위하여, 컨트롤러와 호스 트(HOST)가 서로 분리된 장치인 것을 예로 들어 설명한다. 도 1을 참조하면, 컨트롤러는 메모리 인터페이스 및 제어 회로 등을 포함할 수 있으며, 호스트 인터페이스 등을 더 포함할 수 있다. 호스트 인터페이스는 호스트(HOST)와의 통신을 위한 인터페이스를 제공한다. 예시적으로 호스트 인터페이 스는 USB (Universal Serial Bus) 프로토콜, MMC (multimedia card) 프로토콜, PCI (peripheral component interconnection) 프로토콜, PCI-E (PCI-express) 프로토콜, ATA (Advanced Technology Attachment) 프로토콜, Serial-ATA 프로토콜, Parallel-ATA 프로토콜, SCSI (small computer small interface) 프로토콜, ESDI (enhanced small disk interface) 프로토콜, SMBus(System Management Bus) 프로토콜, I2C(Inter-Integrated Circuit) 프로토콜, I3C(Improved Inter-Integrated Circuit) 프로토콜, 그리고 IDE (Integrated Drive Electronics) 프로토콜, 사유(private) 프로토콜 등과 같은 다양한 인터페이스 프로토콜들 중 적어도 하나를 사용하는 인터페이스를 제공한다.제어 회로는 호스트(HOST)로부터 커맨드를 수신할 때, 호스트 인터페이스를 통해서 커맨드를 수신하 여, 수신된 커맨드를 처리하는 동작을 수행할 수 있다. 메모리 인터페이스는, 메모리와 연결되어 메모리와의 통신을 위한 인터페이스를 제공할 수 있다. 즉, 메모리 인터페이스는 제어 회로의 제어에 응답하여 메모리와 컨트롤러 사이의 인터페이스를 제공하도록 구성될 수 있다. 제어 회로는 컨트롤러의 전반적인 제어 동작을 수행하여 메모리의 동작을 제어한다. 이를 위해, 일 예로, 제어 회로는 프로세서, 워킹 메모리 등 중 하나 이상을 포함할 수 있으며, 에러 검출 및 정정 회로(ECC Circuit, 126) 등을 선택적으로 포함할 수 있다. 프로세서는 컨트롤러의 제반 동작을 제어하고, 논리 연산을 수행할 수 있다. 프로세서는 호스트 인터페이스를 통해 호스트(HOST)와 통신하고, 메모리 인터페이스를 통해 메모리와 통신할 수 있 다. 프로세서는 플래시 변환 계층(FTL: Flash Translation Layer)의 기능을 수행하기 위해 필요한 논리 연산을 수행할 수 있다. 프로세서는 플래시 변환 계층(FTL)을 통해 호스트가 제공한 논리 블록 어드레스(LBA, logical block address)를 물리 블록 어드레스(PBA, physical block address)로 변환하는 논리 연산을 수행할 수 있다. 플래시 변환 계층(FTL)은 매핑 테이블을 이용하여 논리 블록 어드레스(LBA)를 입력 받아, 물리 블록 어드레스(PBA)로 변환시킬 수 있다. 플래시 변환 계층의 주소 맵핑 방법에는 맵핑 단위에 따라 여러 가지가 있다. 대표적인 어드레스 맵핑 방법에는 페이지 맵핑 방법(Page mapping method), 블록 맵핑 방법(Block mapping method), 그리고 혼합 맵핑 방법 (Hybrid mapping method)이 있다. 프로세서는 호스트(HOST)로부터 수신된 데이터를 랜더마이즈할 수 있다. 예를 들면, 프로세서는 설정 된 랜더마이징 시드(seed)를 이용하여 호스트(HOST)로부터 수신된 데이터를 랜더마이즈할 수 있다. 랜더마이즈 된 데이터는 메모리에 제공되고, 메모리의 메모리 셀 어레이에 프로그램될 수 있다. 프로세서는 리드 동작 시 메모리로부터 수신된 데이터를 디랜더마이즈할 수 있다. 예를 들면, 프로세 서는 디랜더마이징 시드를 이용하여 메모리로부터 수신된 데이터를 디랜더마이즈할 수 있다. 디랜더 마이즈된 데이터는 호스트(HOST)로 출력될 수 있다. 프로세서는 펌웨어(FirmWare)를 실행하여 컨트롤러의 동작을 제어할 수 있다. 다시 말해, 프로세서 는, 컨트롤러의 제반 동작을 제어하고, 논리 연산을 수행하기 위하여, 부팅 시 워킹 메모리에 로딩 된 펌웨어를 실행(구동)할 수 있다. 이하, 본 발명의 실시예들에서 설명하는 스토리지 장치의 동작은 프로세서가 해당 동작이 정의된 펌웨어를 실행하는 방식으로 구현될 수 있다. 펌웨어는 스토리지 장치를 구동하기 위해서 스토리지 장치 내에서 실행되는 프로그램으로서, 다양한 기능적 계층들을 포함할 수 있다. 일 예로, 펌웨어는 전술한 기능적 계층들 각각을 실행하기 위한 코드가 정의 된 바이너리 데이터를 포함할 수 있다. 예를 들어, 펌웨어는, 호스트(HOST)에서 스토리지 장치에 요구하는 논리 주소(Logical Address)와 메모리 의 물리 주소(Physical Address) 간의 변환 기능을 하는 플래시 변환 계층(FTL: Flash Translation Layer)와, 호스트(HOST)에서 저장 장치인 스토리지 장치에 요구하는 커맨드를 해석하여 플래시 변환 계층 (FTL)에 전달하는 역할을 하는 호스트 인터페이스 계층(HIL: Host Interface Layer)와, 플래시 변환 계층(FT L)에서 지시하는 커맨드를 메모리로 전달하는 플래시 인터페이스 계층(FIL: Flash Interface Layer) 등 중 하나 이상을 포함할 수 있다. 이러한 펌웨어는, 일 예로, 메모리 또는 메모리 외부에 위치하는 별도의 비휘발성 메모리(e.g. ROM, NOR Flash)에서 워킹 메모리로 로드될 수 있다. 프로세서는 파워 온 이후 부팅 동작을 실행할 때, 먼 저 펌웨어의 전체 또는 일부를 워킹 메모리에 로드할 수 있다. 프로세서는 컨트롤러의 제반 동작을 제어하기 위해 워킹 메모리에 로딩된 펌웨어에 정의된 논리 연산을 수행할 수 있다. 프로세서는 펌웨어에 정의된 논리 연산을 수행한 결과를 워킹 메모리에 저장 할 수 있다. 프로세서는 펌웨어에 정의된 논리 연산을 수행한 결과에 따라서, 컨트롤러가 커맨드 또 는 신호를 생성하도록 제어할 수 있다. 프로세서는 수행되어야 할 논리 연산이 정의된 펌웨어의 부분이 메 모리에는 저장되어 있으나 워킹 메모리에 로드되어 있지 않은 경우에, 펌웨어의 해당 부분을 메모리로부터 워킹 메모리에 로드하기 위한 이벤트(e.g. 인터럽트)를 발생시킬 수 있다. 한편, 프로세서는 펌웨어를 구동하는데 필요한 메타 데이터를 메모리에서 로드할 수 있다. 메타 데이 터는 메모리를 관리하기 위한 데이터로서, 메모리에 저장되는 유저 데이터에 대한 관리 정보를 포함 할 수 있다. 한편, 펌웨어는 스토리지 장치가 생산되는 중 또는 스토리지 장치가 실행되는 중에 업데이트될 수 있 다. 컨트롤러는 스토리지 장치의 외부로부터 새로운 펌웨어를 다운로드하고, 기존 펌웨어를 새로운 펌웨어로 업데이트할 수 있다. 워킹 메모리는 컨트롤러를 구동하기 위해 필요한 펌웨어, 프로그램 코드, 커맨드 또는 데이터들을 저 장할 수 있다. 이러한 워킹 메모리는, 일 예로, 휘발성 메모리로서, SRAM (Static RAM), DRAM (Dynamic RAM) 및 SDRAM(Synchronous DRAM) 등 중 하나 이상을 포함할 수 있다. 한편, 컨트롤러는 위킹 메모리 이외에, 컨트롤러의 외부에 위치한 별도의 휘발성 메모리(e.g. SRAM, DRAM, SDRAM)를 추가로 사용할 수 있다. 에러 검출 및 정정 회로는 에러 정정 코드(Error Correction Code)를 이용하여 타겟 데이터의 에러 비트를 검출하고, 검출된 에러 비트를 정정할 수 있다. 여기서, 타겟 데이터는, 일 예로, 워킹 메모리에 저장된 데이터이거나, 메모리로부터 리드한 데이터 등일 수 있다. 에러 검출 및 정정 회로는 에러 정정 코드로 데이터를 디코딩하도록 구현될 수 있다. 에러 검출 및 정정 회로는 다양한 코드 디코더로 구현될 수 있다. 예를 들어, 비체계적 코드 디코딩을 수행하는 디코더 또는 체계적 코드 디코딩을 수행하는 디코더가 이용될 수 있다. 예를 들면, 에러 검출 및 정정 회로는 리드 데이터들 각각에 대해 설정된 섹터(Sector) 단위로 에러 비트 를 검출할 수 있다. 즉, 각각의 리드 데이터는 복수의 섹터(Sector)로 구성될 수 있다. 섹터(Sector)는 플래시 메모리의 읽기 단위인 페이지(Page)보다 더 작은 데이터 단위를 의미할 수 있다. 각각의 리드 데이터를 구성하 는 섹터들은 어드레스를 매개로 서로 대응될 수 있다. 에러 검출 및 정정 회로는 비트 에러율(Bit Error Rate, BER)을 산출하고, 섹터 단위로 정정 가능 여부를 판단할 수 있다. 에러 검출 및 정정 회로는 예를 들어, 비트 에러율(BER)이 설정된 기준값(reference value)보다 높은 경우 해당 섹터를 정정 불가능(Uncorrectable or Fail)으로 판단할 수 있다. 반면에, 비트 에 러율(BER)이 기준값보다 낮은 경우 해당 섹터를 정정 가능(Correctable or Pass)으로 판단할 수 있다. 에러 검출 및 정정 회로는 모든 리드 데이터들에 대해 순차적으로 에러 검출 및 정정 동작을 수행할 수 있 다. 에러 검출 및 정정 회로는 리드 데이터에 포함된 섹터가 정정 가능한 경우 다음 리드 데이터에 대해서 는 해당 섹터에 대한 에러 검출 및 정정 동작을 생략할 수 있다. 이렇게 모든 리드 데이터들에 대한 에러 검출 및 정정 동작이 종료되면, 에러 검출 및 정정 회로는 마지막까지 정정 불가능으로 판단된 섹터를 검출할 수 있다. 정정 불가능한 것으로 판단된 섹터는 하나 또는 그 이상일 수 있다. 에러 검출 및 정정 회로는 정정 불가능으로 판단된 섹터에 대한 정보(ex. 어드레스 정보)를 프로세서로 전달할 수 있다. 버스는 컨트롤러의 구성 요소들(121, 122, 124, 125, 126) 사이의 채널(Channel)을 제공하도록 구성 될 수 있다. 이러한 버스는, 일 예로, 각종 제어 신호, 커맨드 등을 전달하기 위한 제어 버스와, 각종 데 이터를 전달하기 위한 데이터 버스 등을 포함할 수 있다. 한편, 컨트롤러의 전술한 구성 요소들(121, 122, 124, 125, 126) 중 일부의 구성 요소는 삭제되거나, 컨트 롤러의 전술한 구성 요소들 (121, 122, 124, 125, 126) 중 몇몇 구성 요소들이 하나로 통합될 수 있다. 경 우에 따라, 컨트롤러의 전술한 구성 요소들 이외에 하나 이상의 다른 구성 요소가 추가될 수도 있다. 아래에서는, 도 2를 참조하여 메모리에 대하여 더욱 상세하게 설명한다. 도 2는 도 1의 메모리를 개략적으로 나타낸 블럭도이다. 도 2를 참조하면, 본 발명의 실시예들에 따른 메모리는, 메모리 셀 어레이(Memory Cell Array, 210), 어드 레스 디코더(Address Decoder, 220), 읽기 및 쓰기 회로(Read and Write Circuit, 230), 제어 로직(Control Logic, 240) 및 전압 생성 회로(Voltage Generation Circuit, 250) 등을 포함할 수 있다. 메모리 셀 어레이는 다수의 메모리 블록(BLK1~BLKz, z는 2 이상의 자연수)을 포함할 수 있다. 다수의 메모리 블록(BLK1~BLKz)에는, 다수의 워드 라인(WL)과 다수의 비트 라인(BL)이 배치되며, 다수의 메모리 셀(MC)이 배열될 수 있다. 다수의 메모리 블록(BLK1~BLKz)은 다수의 워드 라인(WL)을 통해 어드레스 디코더와 연결될 수 있다. 다수 의 메모리 블록(BLK1~BLKz)은 다수의 비트 라인(BL)을 통해 읽기 및 쓰기 회로와 연결될 수 있다. 다수의 메모리 블록(BLK1~BLKz) 각각은 다수의 메모리 셀을 포함할 수 있다. 예를 들어, 다수의 메모리 셀은 비 휘발성 메모리 셀들이며, 수직 채널 구조를 갖는 비휘발성 메모리 셀들로 구성될 수 있다. 메모리 셀 어레이는 2차원 구조의 메모리 셀 어레이로 구성될 수 있으며, 경우에 따라서는, 3차원 구조의 메모리 셀 어레이로 구성될 수도 있다. 한편, 메모리 셀 어레이에 포함되는 복수의 메모리 셀 각각은 적어도 1비트의 데이터를 저장할 수 있다. 일 예로, 메모리 셀 어레이에 포함되는 복수의 메모리 셀 각각은 1비트의 데이터를 저장하는 싱글-레벨 셀 (SLC: Single-Level Cell)일 수 있다. 다른 예로, 메모리 셀 어레이에 포함되는 복수의 메모리 셀 각각은 2비트의 데이터를 저장하는 멀티-레벨 셀(MLC: Multi-Level Cell)일 수 있다. 또 다른 예로, 메모리 셀 어레이 에 포함되는 복수의 메모리 셀 각각은 3비트의 데이터를 저장하는 트리플-레벨 셀(TLC: Triple-Level Cell)일 수 있다. 또 다른 예로, 메모리 셀 어레이에 포함되는 복수의 메모리 셀 각각은 4비트의 데이터를 저장하는 쿼드-레벨 셀(QLC: Quad-Level Cell)일 수 있다. 또 다른 예로, 메모리 셀 어레이는 5비트 이상 의 데이터를 각각 저장하는 복수의 메모리 셀을 포함할 수도 있다. 이때, 복수의 메모리 셀 각각에 저장되는 데이터의 비트 수는 동적으로 결정될 수 있다. 예를 들어, 1비트의 데 이터를 저장하는 싱글-레벨 셀이 3비트의 데이터를 저장하는 트리플-레벨 셀로 변경될 수 있다. 도 2를 참조하면, 어드레스 디코더, 읽기 및 쓰기 회로, 제어 로직 및 전압 생성 회로 등 은 메모리 셀 어레이를 구동하는 주변 회로로서 동작할 수 있다. 어드레스 디코더는 다수의 워드 라인(WL)을 통해 메모리 셀 어레이에 연결될 수 있다. 어드레스 디코더는 제어 로직의 제어에 응답하여 동작하도록 구성될 수 있다. 어드레스 디코더는 메모리 내부의 입출력 버퍼를 통해 어드레스(Address)를 수신할 수 있다. 어드레 스 디코더는 수신된 어드레스 중 블록 어드레스(Block Address)를 디코딩하도록 구성될 수 있다. 어드레스 디코더는 디코딩된 블록 어드레스에 따라 적어도 하나의 메모리 블록을 선택할 수 있다. 어드레스 디코더는 전압 생성 회로로부터 읽기 전압(Vread) 및 패스 전압(Vpass)을 입력 받을 수 있 다. 어드레스 디코더는 리드 동작 중 읽기 전압 인가 동작 시, 선택된 메모리 블록 내 선택된 워드 라인(WL)으 로 읽기 전압(Vread)를 인가하고, 나머지 비 선택된 워드 라인들(WL)에는 패스 전압(Vpass)을 인가할 수 있다. 어드레스 디코더는 프로그램 검증 동작 시, 선택된 메모리 블록 내 선택된 워드 라인(WL)에 전압 생성 회 로에서 발생된 검증 전압을 인가하고, 나머지 비 선택된 워드 라인들(WL)에 패스 전압(Vpass)을 인가할 수 있다. 어드레스 디코더는 수신된 어드레스 중 열 어드레스를 디코딩하도록 구성될 수 있다. 어드레스 디코더 는 디코딩 된 열 어드레스를 읽기 및 쓰기 회로에 전송할 수 있다. 메모리의 리드 동작 및 프로그램 동작은 페이지 단위로 수행될 수 있다. 리드 동작 및 프로그램 동작 요청 시에 수신되는 어드레스는 블록 어드레스, 행 어드레스 및 열 어드레스 중 하나 이상을 포함할 수 있다. 어드레스 디코더는 블록 어드레스 및 행 어드레스에 따라 하나의 메모리 블록 및 하나의 워드 라인을 선택 할 수 있다. 열 어드레스는 어드레스 디코더에 의해 디코딩 되어 읽기 및 쓰기 회로에 제공될 수 있 다. 어드레스 디코더는 블록 디코더, 행 디코더, 열 디코더 및 어드레스 버퍼 등 중 하나 이상을 포함할 수 있 다. 읽기 및 쓰기 회로는 다수의 페이지 버퍼(PB)를 포함할 수 있다. 읽기 및 쓰기 회로는 메모리 셀 어 레이의 리드 동작(Read Operation) 시에는 \"읽기 회로(Read Circuit)\"로 동작하고, 쓰기 동작(WriteOperation) 시에는 \"쓰기 회로(Write Circuit)\"로 동작할 수 있다. 전술한 읽기 및 쓰기 회로는 다수의 페이지 버퍼(PB)를 포함하는 페이지 버퍼 회로(Page Buffer Circuit) 또는 데이터 레지스터 회로(Data Register Circuit)라고도 한다. 여기서, 읽기 및 쓰기 회로는 데이터 처 리 기능을 담당하는 데이터 버퍼(Data Buffer)를 포함할 수 있고, 경우에 따라서, 캐싱 기능을 담당하는 캐쉬 버퍼(Cache Buffer)를 추가로 더 포함할 수 있다. 다수의 페이지 버퍼(PB)는 다수의 비트 라인(BL)을 통해 메모리 셀 어레이에 연결될 수 있다. 다수의 페이 지 버퍼(PB)는 리드 동작 및 프로그램 검증 동작 시, 메모리 셀들의 문턱전압(Vth)을 센싱하기 위하여, 메모리 셀들과 연결된 비트 라인들(BL)에 센싱 전류를 계속적으로 공급하면서, 대응하는 메모리 셀의 프로그램 상태에 따라 흐르는 전류량이 변화되는 것을 센싱 노드를 통해 감지하여 센싱 데이터로 래치할 수 있다. 읽기 및 쓰기 회로는 제어 로직에서 출력되는 페이지 버퍼 제어 신호들에 응답하여 동작할 수 있다. 읽기 및 쓰기 회로는 리드 동작 시, 메모리 셀의 데이터를 센싱하여 독출 데이터를 임시 저장한 후, 메모 리의 입출력 버퍼로 데이터(DATA)를 출력한다. 예시적인 실시 예로서, 읽기 및 쓰기 회로는 페이지 버퍼들(PB) 또는 페이지 레지스터들 이외에도, 열 선택 회로 등을 포함할 수 있다. 제어 로직은 어드레스 디코더, 읽기 및 쓰기 회로, 및 전압 생성 회로 등과 연결될 수 있 다. 제어 로직은 메모리의 입출력 버퍼를 통해 커맨드(CMD) 및 제어 신호(CTRL)를 수신할 수 있다. 제어 로직은 제어 신호(CTRL)에 응답하여 메모리의 제반 동작을 제어하도록 구성될 수 있다. 제어 로 직은 다수의 페이지 버퍼(PB)의 센싱 노드의 프리 차지 전위 레벨을 조절하기 위한 제어 신호를 출력할 수 있다. 제어 로직은 메모리 셀 어레이의 리드 동작을 수행하도록 읽기 및 쓰기 회로를 제어할 수 있다. 전압 생성 회로는, 제어 로직에서 출력되는 전압 생성 회로 제어 신호에 응답하여, 리드 동작 시, 이 용되는 읽기 전압(Vread) 및 패스 전압(Vpass)을 생성할 수 있다. 한편, 전술한 메모리의 메모리 블록 각각은 다수의 워드 라인(WL)과 대응되는 다수의 페이지와 다수의 비 트 라인(BL)과 대응되는 다수의 스트링으로 구성될 수 있다. 메모리 블록(BLK)에는 다수의 워드 라인(WL)과 다수의 비트 라인(BL)이 교차하면서 배치될 수 있다. 예를 들어, 다수의 워드 라인(WL) 각각은 행 방향으로 배치되고, 다수의 비트 라인(BL) 각각은 열 방향으로 배치될 수 있다. 다른 예를 들어, 다수의 워드 라인(WL) 각각은 열 방향으로 배치되고, 다수의 비트 라인(BL) 각각은 행 방향으로 배치될 수 있다. 다수의 워드 라인(WL) 중 하나와 다수의 비트 라인(BL) 중 하나에 연결되는 메모리 셀이 정의될 수 있다. 각 메 모리 셀에는 트랜지스터가 배치될 수 있다. 예를 들어, 메모리 셀(MC)에 배치된 트랜지스터는 드레인, 소스 및 게이트 등을 포함할 수 있다. 트랜지스터의 드레인(또는 소스)은 해당 비트 라인(BL)과 직접 또는 다른 트랜지스터를 경유하여 연결될 수 있다. 트랜지스터 의 소스(또는 드레인)는 소스 라인(그라운드일 수 있음)과 직접 또는 다른 트랜지스터를 경유하여 연결될 수 있 다. 트랜지스터의 게이트는 절연체에 둘러싸인 플로팅 게이트(Floating Gate)와 워드 라인(WL)으로부터 게이트 전압이 인가되는 컨트롤 게이트(Control Gate)를 포함할 수 있다. 각 메모리 블록에는, 2개의 최외곽 워드 라인 중 읽기 및 쓰기 회로와 더 인접한 제1 최외곽 워드 라인의 바깥쪽에 제1 선택 라인(소스 선택 라인 또는 드레인 선택 라인이라고도 함)이 더 배치될 수 있으며, 다른 제2 최외곽 워드 라인의 바깥쪽에 제2 선택 라인(드레인 선택 라인 또는 소스 선택 라인이라고도 함)이 더 배치될 수 있다. 경우에 따라서, 제1 최외곽 워드 라인과 제1 선택 라인 사이에는 하나 이상의 더미 워드 라인이 더 배치될 수 있다. 또한, 제2 최외곽 워드 라인과 제2 선택 라인 사이에도 하나 이상의 더미 워드 라인이 더 배치될 수 있다. 전술한 메모리 블록의 리드 동작 및 프로그램 동작(쓰기 동작)은 페이지 단위로 수행될 수 있으며, 소거 (Erasure) 동작은 메모리 블록 단위로 수행될 수 있다. 도 3은 본 발명의 실시예들에 따른 시스템의 개략적인 구조를 나타낸 도면이다. 도 3을 참조하면, 시스템은 스토리지 장치 및 서스펜드 파라미터 결정 장치를 포함할 수 있다. 스토리지 장치는 데이터를 저장할 수 있는 장치이다. 일 예로, 스토리지 장치는 도 1에서 설명한 스 토리지 장치일 수 있다. 스토리지 장치는 서스펜드 파라미터 결정 장치 또는 별도의 컴퓨팅 장 치로부터 리드 요청 또는 라이트 요청을 수신하고 이를 처리할 수 있다. 서스펜드 파라미터 결정 장치는 스토리지 장치가 실행 중인 프로그램 동작 또는 소거 동작에 대한 서 스펜드 동작을 제어하기 위해 사용하는 파라미터인 서스펜드 파라미터를 결정하는 장치이다. 스토리지 장치 는 서스펜드 파라미터를 기초로 프로그램 동작 또는 소거 동작에 대한 서스펜드 동작의 실행 여부, 서스펜 드 동작의 실행 시점 및 서스펜드 동작의 실행 횟수 등을 결정할 수 있다. 일 예로, 서스펜드 파라미터 결정 장치는 도 1에서 설명한 호스트(HOST)일 수 있다. 이 경우, 서스펜드 파 라미터 결정 장치는 스토리지 장치에 리드 요청 또는 라이트 요청을 전송할 수 있고, 동시에 서스펜 드 파라미터를 결정할 수 있다. 다른 예로, 서스펜드 파라미터 결정 장치는 호스트(HOST) 및 스토리지 장치와 분리된 별도의 장치일 수 있다. 서스펜드 파라미터 결정 장치는 전력 모니터링 회로, 메모리 장치 및 제어 회로를 포함할 수 있다. 전력 모니터링 회로는 스토리지 장치의 전력 소비량 정보를 모니터링할 수 있다. 일 예로, 전력 모니터링 회로는 소정의 시구간 동안 스토리지 장치가 소비한 전력을 센싱하여 스토리 지 장치의 전력 소비량 정보를 결정할 수 있다. 다른 예로, 전력 모니터링 회로는 스토리지 장치의 전력 소비량 정보를 스토리지 장치에 요청하 고, 요청에 대한 스토리지 장치의 응답을 기초로 스토리지 장치의 전력 소비량 정보를 결정할 수 있 다. 그리고 메모리 장치는 인공 지능 모델(MDL)을 저장할 수 있다. 일 예로, 메모리 장치는 휘발성 메모 리(e.g. SRAM, DRAM) 또는 비휘발성 메모리(e.g. NAND Flash, NOR Flash)일 수 있다. 인공 지능 모델(MDL)은 스토리지 장치에 대한 서스펜드 파라미터를 결정하기 위해 사용되는 모델이다. 인공 지능 모델(MDL)은 미리 설정된 학습용 데이터를 기초로 기 학습된 모델일 수 있다. 인공 지능 모델(MDL)에 대한 학습을 수행한다는 것은, 스토리지 장치가 인공 지능 모델(MDL)에 입력된 학습용 데이터에 따라 출력 된 서스펜드 파라미터를 기초로 동작할 때 스토리지 장치에 대한 사용자의 요구 성능을 만족하면서 동시에 스토리지 장치의 전력 소비량을 최적화할 수 있도록 인공 지능 모델(MDL)의 내부 파라미터(e.g. 인공 지능 모델(MDL)에 포함된 노드들의 가중치)를 조정하는 것을 의미한다. 한편, 인공 지능 모델(MDL)의 학습 과정은 훈련(training)으로 표현하고, 그 결과를 학습(learning)으로 표현할 수도 있으나, 학습 과정이나 그 결과를 표현하기 위해 훈련 또는 학습 중 하나를 사용할 수 있다. 인공 지능 모델(MDL)에 대한 학습은 서스펜드 파라미터 결정 장치에서 직접 수행되거나 또는 별도의 컴퓨 팅 장치에서 수행될 수 있다. 서스펜드 파라미터 결정 장치는 별도의 컴퓨팅 장치에서 학습된 인공 지능 모델(MDL)을 메모리 장치에 로드할 수 있다. 제어 회로는 메모리 장치에서 인공 지능 모델(MDL)을 로드하고, 인공 지능 모델(MDL)을 이용하여 스 토리지 장치에 대한 서스펜드 파라미터를 결정할 수 있다. 제어 회로는 로드된 인공 지능 모델(MDL)을 이용하여 서스펜드 파라미터를 출력하는 연산을 수행하는 프로 세서 또는 프로세싱 코어를 포함할 수 있다. 이를 위해, 제어 회로는 인공 지능 모델(MDL)을 이용하여 서 스펜드 파라미터를 출력하는 연산이 정의된 명령어들을 포함하는 소프트웨어를 구동할 수 있다. 한편, 제어 회로는 인공 지능 모델(MDL)을 이용하여 스토리지 장치에 대한 서스펜드 파라미터를 결정 하는 동작을 미리 설정된 주기(e.g. 5~10분)마다 수행할 수 있다. 그리고 제어 회로는 스토리지 장치(31 0)에 대한 서스펜드 파라미터를 결정하는 동작을 미리 설정된 횟수(e.g. 1000회)만큼 반복할 수 있다. 제어 회로는 서스펜드 파라미터를 스토리지 장치로 전송할 수 있다. 일 예로, 제어 회로는 미리 설정된 인터페이스(e.g. UART)를 통해 서스펜드 파라미터를 스토리지 장치로 전송할 수 있다. 한편, 스토리지 장치는 수신한 서스펜드 파라미터를 내부의 서스펜드 파라미터 테이블에 저장할 수 있다. 일 예로 서스펜드 파라미터 테이블은 도 1에서 설명한 워킹 메모리 또는 메모리에 할당된 저장 공간일 수 있다. 스토리지 장치는 서스펜드 파라미터 테이블에 저장된 서스펜드 파라미터를 기초로 하여, 실행 중인 프로그램 동작 또는 소거 동작에 대한 서스펜드 동작을 제어할 수 있다. 도 4는 본 발명의 실시예들에 따른 인공 지능 모델(MDL)의 입출력을 나타낸 도면이다. 도 4를 참조하면, 인공 지능 모델(MDL)은 스토리지 장치에 대한 성능 정보 및 스토리지 장치의 전력 소비량 정보를 입력받을 수 있다. 스토리지 장치의 성능 정보는 스토리지 장치에 대한 리드 동작 및 라이트 동작 중 적어도 하나를 처 리하는 성능을 지시하는 정보이다. 일 예로, 서스펜드 파라미터 결정 장치는 스토리지 장치에 리드 동작 또는 라이트 동작을 사용자가 설정한 워크로드 타입에 따라 요청하고 스토리지 장치는 요청에 대한 처리 결과를 서스펜드 파라미터 결정 장치에 응답할 수 있다. 이때, 서스펜드 파라미터 결정 장치는 스토리지 장치의 응답을 기초로 하여 스토리지 장치의 성능 정보를 직접 측정할 수 있다. 다른 예로, 서스펜드 파라미터 결정 장치는 스토리지 장치에 리드 동작 및 라이트 동작 중 적어도 하 나를 요청하고, 스토리지 장치가 요청을 처리한 후 스토리지 장치의 성능 정보를 스토리지 장치(31 0)로부터 수신할 수 있다. 스토리지 장치의 전력 소비량 정보는 전술한 전력 모니터링 회로를 통해 입력받을 수 있다. 인공 지능 모델(MDL)은 입력받은 성능 정보 및 전력 소비량 정보를 기초로, 스토리지 장치에 대한 서스펜 드 파라미터를 출력할 수 있다. 인공 지능 모델(MDL)은 스토리지 장치의 전력 소비량을 최적화하고 스토리 지 장치에 대한 성능 정보가 스토리지 장치의 성능 요구 사항을 만족하는 범위 내에서 최적의 서스펜 드 파라미터를 출력할 수 있다. 한편, 인공 지능 모델(MDL)은 다양한 방식으로 구현될 수 있다. 인공 지능 모델(MDL)은 알고리즘 기반 기계 학습을 진행한 모델 또는 인공 신경망 기반의 학습을 진행한 모델 등과 같은 현재 또는 미래의 기계 학습 모델일 수 있다. 알고리즘 기반 기계 학습을 진행한 모델은 예를 들어 트리 기반 모델(tree-based model), k-최근접 이웃(k- Nearest Neighbors), k-평균 균집화(k-Means Clustering), PCA(Principal Component Analysis), SVM(support vector machine) 등과 같은 고전적인 기계 학습 모델일 수 있다. 트리 기반 모델은 예를 들어 결정 트리 모델(decision tree model)이거나 회귀 모델(regression model) 또는 랜덤 트리 모델(random tree model)일 수 있다. 한편, 인공 지능 모델(MDL)은 하나의 학습된 모델만을 사용하지 않고 여러 모델들을 학습시켜 결합하는 방식으 로 문제를 해결하는 앙상블 모델(ensemble model)일 수 있다. 앙상블 모델은 개별적으로 학습된 여러 모델들을 조합함으로써, 과적합(overfitting)을 막고 일반화 성능을 향 상시킬 수 있다. 앙상블 모델은 개별 모델의 성능이 확보되지 않을 때 성능 향상에 도움이 될 수 있다. 앙상블 모델은 크게 투표 방식과 부스팅 방식으로 나눌 수 있다. 투표 방식은 여러 개의 모델들이 생성한 결과들에 대한 투표를 통해 최종 결과를 도출하는 방식이다. 예를 들어, 투표 방식은 동일 유형의 알고리즘들을 조합하되 각각 학습하는 데이터를 다르게 하는 배깅(bagging) 방 식과 서로 다른 종류의 알고리즘을 결합하는 보팅(voting) 방식이 있다. 부스팅 방식은 약한 기계 학습 모델들을 결합해서 보다 정확하고 강력한 기계 학습 모델을 만드는 방식이다. 부 스팅 방식은 약한 기계 학습 모델들 각각이 순서대로 일을 하면 뒤의 기계 학습 모델들이 앞의 기계 학습 모델 이 찾지 못한 부분을 추가적으로 탐색하는 방식이다. 예를 들어, 부스팅 방식은 랜덤 포레스트, 그래디언트 부 스팅, XGBoost(eXtra Gradient Boost) 등일 수 있다.인공 신경망은 인간의 뇌의 동작 원리를 모방하여, 서로 연결된 다수의 인공 뉴런을 기초로 하여 복잡한 데이터 를 분석하고 학습하는 기계 학습 알고리즘이다. 인공 신경망은 입력층, 은닉층, 출력층으로 이루어져 있는 가장 기본적인 인공 신경망 구조인 다층 퍼셉트론(MLP, Multi-Layer Perceptron), 이미지의 특징을 추출하기 위해서 컨볼루션(convolution) 연산을 수행하고, 풀링(pooling) 연산으로 차원을 축소하는 합성곱 신경망(CNN, Convolutional Neural Network), 순서가 있는 데이터를 처리하는 데 사용되는 인공 신경망 구조인 순환 신경망 (RNN, Recurrent Neural Network) 등 어떤 인공 신경망일 수 있으며, 데이터의 복잡도와 다양성에 따라 다양하 게 변형될 수 있다. 인공 신경망 기반의 학습을 진행한 모델 역시 하나의 모델만을 학습시켜 사용하지 않고 여러 모델들을 학습시켜 결합하는 방식으로 문제를 해결하는 앙상블 모델일 수 있다. 한편, 알고리즘 기반 기계 학습 모델과 인공 신경망 기반의 학습을 진행한 모델은 서로 보완적으로 사용될 수 있다. 예를 들어, 알고리즘 기반 기계 학습 모델은 인공 신경망 기반의 학습을 진행한 모델의 결과를 사용할 수 있으며, 인공 신경망 기반의 학습을 진행한 모델이 알고리즘 기반 기계 학습 모델의 결과를 사용할 수도 있다. 알고리즘 기반 기계 학습 모델과 인공 신경망 기반의 학습을 진행한 모델 간의 앙상블 모델이 사용될 수도 있다. 일 예로, 인공 지능 모델(MDL)은 강화 학습 모델일 수 있다. 강화 학습 모델은, 강화 학습(reinforcement learning)을 통해 학습을 수행하여 내부의 파라미터를 결정하거나 지속적으로 업데이트하는 모델이다. 강화 학습은, 에이전트(Agent)가 매 순간마다 어떤 행동을 해야 좋을지 판단할 수 있는 환경(environment)이 주어진다면, 데이터 없이 경험으로 가장 좋은 행동을 선택할 수 있다는 가정에 기반한다. 일 예로, 강화 학습(Reinforcement Learning)은 마르코프 결정 과정(Markov Decision Process, MDP)에 의해 수행될 수 있다. 마르코프 결정 과정은, 먼저 에이전트가 다음 행동을 하기 위해 필요한 정보들을 포함하는 환 경이 주어지며, 그 환경에서 에이전트가 어떻게 행동할지를 정의하고, 에이전트의 행동에 따른 보상 또는 페널 티를 정의하며, 미래의 보상이 최고점에 이를 때까지 반복 경험하여 최적의 정책(policy)을 도출하는 과정이다. 예를 들어, 강화 학습 모델은 유전 알고리즘(Genetic Algorithm) 모델, 입자 군집 최적화(Particle Swarm Optimization) 모델 또는 개미 군집 최적화(Ant Colony Optimization) 모델일 수 있다. 유전 알고리즘 모델은 다양한 문제에 적용 가능하며, 해 공간의 규모가 큰 문제에 대해 효과적인 모델이다. 입자 군집 최적화 모델은 연속형 문제에 효과적이며, 전역 최적해를 찾는데 효과적인 모델이다. 개미 군집 최적화 모델은 조합 최적화 문 제나 경로 문제에 효과적인 모델이다. 도 5는 본 발명의 실시예들에 따른 인공 지능 모델(MDL)에 입력되는 정보의 일 예를 나타낸 도면이다. 도 5에서, 스토리지 장치에 대한 성능 정보는, 데이터 스루풋 정보 및 지연 정보 중 적어도 하나를 포함할 수 있다. 데이터 스루풋 정보는 소정의 시구간 동안 스토리지 장치에 리드 또는 라이트된 데이터의 크기인 데이터 스루풋을 지시하는 정보일 수 있다. 일 예로, 서스펜드 파라미터 결정 장치는 스토리지 장치로부터 소정의 시구간 동안 리드 또는 라이트된 데이터의 크기에 대한 응답을 수신하고 이를 기초로 데이터 스루풋을 결정할 수 있다. 일 예로, 데이터 스루풋의 범위는 0부터 미리 설정된 최대 스루풋 값 사이일 수 있다. 지연 정보는 소정의 시구간 동안 스토리지 장치에 전송한 리드 커맨드들 중에서, 대응하는 기준 처리 시간 내에 처리된 리드 커맨드들의 비율을 지시하는 정보일 수 있다. 리드 커맨드들의 기준 처리 시간은 리드 커맨드 마다 상이할 수 있으며, 리드 커맨드가 요청하는 데이터의 크기를 기초로 결정될 수 있다. 일 예로, 스토리지 장치에 전송한 100개의 리드 커맨드들 중에서 99개가 기준 처리 시간 내에 처리되었을 때, 지연 정보는 99% (=99/100)를 지시할 수 있다. 일 예로, 지연 정보의 범위는 0에서 미리 설정된 비율값 (e.g. 99.9999%) 사이일 수 있다. 그리고 스토리지 장치에 대한 전력 소비량 정보는, 피크 전력 소비량 정보 및 평균 전력 소비량 정보 중 적어도 하나를 포함할 수 있다. 피크 전력 소비량 정보는 소정의 시구간 동안 스토리지 장치가 소비한 최대 전력의 값을 지시하는 정보일 수 있다. 일 예로, 피크 전력 소비량 정보의 범위는 0에서 미리 설정된 최대 소비 전력값 사이일 수 있다. 평균 전력 소비량 정보는 소정의 시구간 동안 스토리지 장치가 소비한 전력의 평균값을 지시하는 정보일 수 있다. 이때, 평균 전력 소비량 정보의 범위 역시 0에서 미리 설정된 최대 소비 전력값 사이일 수 있다. 도 6은 본 발명의 실시예들에 따른 서스펜드 파라미터의 일 예를 나타낸 도면이다. 도 6을 참조하면, 서스펜드 파라미터는 최대 프로그램 서스펜드 카운트, 최대 소거 서스펜드 카운트, 프로그램 재개 후 서스펜드 지연값 및 소거 재개 후 서스펜드 지연값 중 적어도 하나를 포함할 수 있다. 이 중 최대 프로그램 서스펜드 카운트 및 프로그램 재개 후 서스펜드 지연값은 프로그램 동작에 대한 서스펜드 를 제어하기 위해 사용되고, 최대 소거 서스펜드 카운트 및 소거 재개 후 서스펜드 지연값은 소거 동작에 대한 서스펜드를 제어하기 위해 사용될 수 있다. 최대 프로그램 서스펜드 카운트는 하나의 프로그램 동작이 서스펜드될 수 있는 최대 카운트를 지시할 수 있다. 프로그램 동작이 최대 프로그램 서스펜드 카운트만큼 서스펜드된 이후에, 해당 프로그램 동작은 완료되기 전까 지 더 이상 리드 동작에 의해 서스펜드되지 않는다. 일 예로, 최대 프로그램 서스펜드 카운트의 범위는 1에서 15 사이일 수 있다. 최대 소거 서스펜드 카운트는 하나의 소거 동작이 서스펜드될 수 있는 최대 카운트를 지시할 수 있다. 소거 동 작이 최대 소거 서스펜드 카운트만큼 서스펜드된 이후에, 해당 소거 동작은 완료되기 전까지 더 이상 리드 동작 에 의해 서스펜드되지 않는다. 일 예로, 최대 소거 서스펜드 카운트의 범위는 1에서 10 사이일 수 있다. 프로그램 재개 후 서스펜드 지연값은 하나의 프로그램 동작이 재개된 이후 서스펜드 불가능한 상태로 지속되는 시간을 지시할 수 있다. 프로그램 동작이 재개된 이후에, 해당 프로그램 동작은 프로그램 재개 후 서스펜드 지 연값만큼의 시간이 경과한 이후에 리드 동작에 의해 서스펜드될 수 있다. 일 예로, 프로그램 재개 후 서스펜드 지연값은 50us에서 400us 사이일 수 있다. 소거 재개 후 서스펜드 지연값은 하나의 소거 동작이 재개된 이후 서스펜드 불가능한 상태로 지속되는 시간을 지시할 수 있다. 소거 동작이 재개된 이후에, 해당 소거 동작은 소거 재개 후 서스펜드 지연값만큼의 시간이 경 과한 이후에 리드 동작에 의해 서스펜드될 수 있다. 일 예로, 소거 재개 후 서스펜드 지연값은 1200us에서 2000us 사이일 수 있다. 도 7은 본 발명의 실시예들에 따른 서스펜드 파라미터 결정 방법을 나타낸 도면이다. 도 7을 참조하면, 서스펜드 파라미터 결정 방법은, 스토리지 장치에 대한 성능 정보를 측정하는 단계 (S710)를 포함할 수 있다. 일 예로, 성능 정보는 소정의 시구간 동안 스토리지 장치에 리드 또는 라이트된 데이터의 크기를 지시하는 데이터 스루풋 정보 및 스토리지 장치에 전송한 리드 커맨드들 중 기준 처리 시간 내에 처리된 리드 커맨 드들의 비율을 지시하는 지연 정보 중 적어도 하나를 포함할 수 있다. 그리고 서스펜드 파라미터 결정 방법은, 스토리지 장치의 전력 소비량 정보를 모니터링하는 단계(S720)를 포함할 수 있다. 일 예로, 전력 소비량 정보는 소정의 시구간 동안 스토리지 장치의 피크 전력 소비량 정보 및 스토리지 장 치의 평균 전력 소비량 정보 중 적어도 하나를 포함할 수 있다. 그리고 서스펜드 파라미터 결정 방법은, 성능 정보 및 전력 소비량 정보를 인공 지능 모델(MDL)에 입력하는 단 계(S730)를 포함할 수 있다. 그리고 서스펜드 파라미터 결정 방법은, 인공 지능 모델(MDL)이 출력한 서스펜드 파라미터를 스토리지 장치 로 전송하는 단계(S740)를 포함할 수 있다. 서스펜드 파라미터는, 스토리지 장치가 실행 중인 프로그 램 동작 또는 소거 동작에 대한 서스펜드 동작을 제어하기 위해 사용되는 파라미터이다. 일 예로, 서스펜드 파라미터는, 하나의 프로그램 동작이 서스펜드될 수 있는 최대 카운트를 지시하는 최대 프로 그램 서스펜드 카운트, 하나의 소거 동작이 서스펜드될 수 있는 최대 카운트를 지시하는 최대값을 지시하는 최 대 소거 서스펜트 카운트, 하나의 프로그램 동작이 재개된 이후 서스펜드 불가능한 상태로 지속되는 시간을 지 시하는 프로그램 재개 후 서스펜드 지연값 및 하나의 소거 동작이 재개된 이후 서스펜드 불가능한 상태로 지속 되는 시간을 지시하는 소거 재개 후 서스펜드 지연값 중 적어도 하나를 포함할 수 있다.이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 또한, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이므로 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0131358", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예들에 따른 스토리지 장치의 개략적인 구성도이다. 도 2는 도 1의 메모리를 개략적으로 나타낸 블럭도이다. 도 3은 본 발명의 실시예들에 따른 시스템의 개략적인 구조를 나타낸 도면이다. 도 4는 본 발명의 실시예들에 따른 인공 지능 모델의 입출력을 나타낸 도면이다. 도 5는 본 발명의 실시예들에 따른 인공 지능 모델에 입력되는 정보의 일 예를 나타낸 도면이다. 도 6은 본 발명의 실시예들에 따른 서스펜드 파라미터의 일 예를 나타낸 도면이다. 도 7은 본 발명의 실시예들에 따른 서스펜드 파라미터 결정 방법을 나타낸 도면이다."}
