{"patent_id": "10-2011-0145284", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2013-0083079", "출원번호": "10-2011-0145284", "발명의 명칭": "포인트 소모 리그 모드의 리그포인트 관리 방법 및 포인트 소모 리그 모드 제공 서버", "출원인": "(주)네오위즈게임즈", "발명자": "김정훈"}}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "포인트 소모 리그 모드 제공 서버가, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인트 소모 시 게임의 진행이 제한되는모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 단계; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 단계; 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 단계;및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 단계;를 포함하는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "포인트 소모 리그 모드 제공 서버가, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의 진행이 제한되는모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 단계; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 단계; 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인지 판단하는 단계; 및 상기 판단 단계에서, 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 단계;및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 단계;를 포함하는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 상기 판단 단계에서, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모시키는 단계;를 포함하는 포인트 소모 리그 모드의 리그포인트 관리방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서, 상기 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우, 상기 사용자의 기설정된공개특허 10-2013-0083079-2-리그포인트를 소모시키는 단계는, 상기 게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 대전일 경우, 상기 게임을개설한 사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항 또는 제 2항에 있어서, 상기 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대응되어소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 단계;를 더 포함하는 것을 특징으로 하는 포인트 소모리그 모드의 리그포인트 관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항 또는 제 2항에 있어서, 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인트를 획득할 수 있는것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항 또는 제 2항에 있어서, 상기 리그포인트는, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를 포함하는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항 또는 제 2항에 있어서, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 단계는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메뉴를 출력하는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항 또는 제 2항에 있어서, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 3항에 있어서, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모시키는 단계는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한 리그포인트를 환원시키는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법. 공개특허 10-2013-0083079-3-청구항 11 제 3항에 있어서, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모시키는 단계는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두접속은 유지된 상태인 경우, 상기 게임에서 상대편 사용자가 게임 시작 전에 이탈하여 게임을 진행할 수 없는사용자에게 사용한 리그포인트를 환원시키는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "사용자 단말 접속 시, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 포인트 소모 리그 모드제공부; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 게임 캐릭터 정보 제공부; 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 사용자의 기설정된 리그포인트를 소모시키는 리그포인트 관리부; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 리그 진행 여부 판단부; 및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 리그 참여 정보 제공부;를 포함하는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서, 상기 게임 캐릭터 정보 제공부는, 상기 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대응되어소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12항에 있어서, 상기 리그포인트 관리부는, 상기 게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 대전일 경우, 상기 게임을개설한 사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 12항에 있어서, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모시키는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버. 공개특허 10-2013-0083079-4-청구항 16 제 12항에 있어서, 상기 게임 캐릭터에는, 게임 캐릭터의 능력치와 게임 종료 시 소모될 리그포인트 정보가 포함된 것을 특징으로 하는 포인트 소모 리그모드의 리그포인트 관리."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 12항에 있어서, 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인트를 획득할 수 있는것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 12항 또는 제 17항에 있어서, 상기 리그포인트는, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를 포함하는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 12항에 있어서, 상기 리그 참여 정보 제공부는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메뉴를 출력하는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 12항에 있어서, 상기 리그포인트 관리부는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 12항에 있어서, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한 리그포인트를 환원시키는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 12항에 있어서, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두접속은 유지된 상태인 경우, 상기 게임에서 상대편 사용자가 게임 시작 전에 이탈하여 게임을 진행할 수 없는공개특허 10-2013-0083079-5-사용자에게 사용한 리그포인트를 환원시키는 것을 특징으로 하는 포인트 소모 리그 모드 제공 서버."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "포인트 소모 리그 모드 제공 서버가, 사용자 단말 접속 시, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 단계; 상기 사용자 단말이 상기 포인트 소모 리그 모드의 게임을 종료하면, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 단계;및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 단계;를 포함하는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 읽을 수있는 기록매체."}
{"patent_id": "10-2011-0145284", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "포인트 소모 리그 모드 제공 서버가, 사용자 단말 접속 시, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 단계; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 단계; 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인지 판단하는 단계; 및 상기 판단 단계에서, 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 단계;및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 단계;를 포함하는 것을 특징으로 하는 포인트 소모 리그 모드의 리그포인트 관리 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 읽을 수있는 기록매체. 명 세 서기 술 분 야본 발명은, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인트 소모 시 게임의 진행이 [0001]제한되는 모드인, 포인트 소모 리그 모드를 제공하는 기술에 관한 것이다. 배 경 기 술통신 네트워크의 발전에 따라서 다양한 온라인 게임 서비스가 제공되고 있다. 또한, 그래픽 기술 및 게임 유저 [0002]단말의 성능 향상으로 인해, 고사양의 게임 프로그램들이 만들어지고 있으며, 현실 세계 또는 가상의 세계를 정밀하게 묘사한 게임 컨텐츠가 제공되고 있다.이에 따라서 온라인 게임에 대한 유저들의 이용이 높아지고 있으며, 게임의 장르 또한 다양해지고 있다. 최근의 [0003]공개특허 10-2013-0083079-6-게임 중에서는 스포츠 게임, 롤플레잉 게임, 1인칭 슈팅 게임 등이 인기 있는 온라인 게임들로 각광받고 있다.이러한, 온라인 게임의 특징은 다른 사람들과 같은 게임 컨텐츠 시스템에 동시 접속하여 즐길 수 있다는 [0004]점이다. 같은 게임화면에서 각기 유저들을 대표하는 캐릭터 등을 조작하여, 다른 사람들과 협동 또는 경쟁을 통해 게임을 즐길 수 있다.온라인 게임에서는 다른 사람들과 하나의 미션을 협동하여 처리하거나, 다른 사람들과의 대전 등을 통해 컨텐츠 [0005]를 즐길 수 있다. 이때, 온라인 게임에서는 유저들 사이의 경쟁심을 유발하는 컨텐츠를 마련할 필요가 있다. 온라인 게임의 특징 상, 그 이용률을 유지하거나 증가시키기 위해서는, 유저들 사이의 경쟁심을 유발함으로써, 유저들이 계속적으로 온라인 게임에 접속하여 게임을 플레이하도록 하여야 하기 때문이다.한편, 온라인 게임 중에는 단시간에 진행되는 단일 경기(match)로 목적을 달성하는 게임도 있으며, 게임 자체에 [0006]경기의 구분 없이 계속적으로 주어진 임무를 수행하는 게임도 있다. 또한 복수개의 경기가 연속적으로 주어지고, 복수개의 경기 결과를 종합하여 목적을 달성하는 게임도 있다. [0007]이중 복수개의 경기 결과를 종합하여 목적을 달성하는 게임을 토너먼트(tournament) 형식의 게임 또는 리그 [0008](league) 형식의 게임이라 한다. 토너먼트 형식의 게임은 각각의 경기 승리한 경우에만 연속되는 다음 경기가 제공되는 방식의 게임 진행 방법으 [0009]로, 참여한 캐릭터들 또는 팀들 중 마지막까지 승리한 캐릭터 또는 팀이 우승을 차지한다. 그리고 리그 형식의 게임은 기설정된 복수개의 경기를 모두 수행한 후, 참여한 캐릭터들 또는 팀들 중 가장 높 [0010]은 승률을 획득한 캐릭터 또는 팀이 우승을 차지한다. 통상적으로 리그전에서는 참여한 모든 캐릭터들 또는 팀들이 서로 최소한 1회씩은 경기를 수행하도록 한다.이러한 토너먼트 또는 리그 형식의 게임에서 우승은 복수개의 경기를 승리해야 하므로, 단일 경기에서의 승리와 [0011]는 매우 다른 가치를 가지며, 사용자의 충분한 게임 실력이 뒷받침 되어야만 달성할 수 있다. 따라서 토너먼트또는 리그 형식의 게임에서 우승한 사용자는 상대적으로 게임에 대한 충성도가 높은 고객으로 볼 수 있다.이러한 충성도가 높은 고객은 토너먼트 또는 리그에 대해 한번 우승했다고 해서, 곧바로 그 게임을 그만두지 않 [0012]는다. 이러한 사용자는 일반적으로 동일 토너먼트나 리그를 다시 수행하거나, 다른 토너먼트나 리그를 수행하게된다. 그러나 기존의 게임들은 토너먼트나 리그의 우승에 대한 보상 아이템을 제공함에 따라 토너먼트나 리그에서 한 [0013]번이라도 우승한 사용자는 재도전하여 짧은 시간 내에 여러 번의 토너먼트나 리그의 우승에 과도하게 도전하게되는 문제점이 있다. 발명의 내용해결하려는 과제이에 본 발명은, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인트 소모 시 게임의 [0014]진행이 제한되는 모드인, 포인트 소모 리그 모드를 제공하고, 게임 플레이를 종료할 때마다 사용자의 리그포인트를 소모시킴으로써 사용자가 해당 리그를 과도하게 이용하는 것을 방지할 수 있는 방법을 제공하는데 그 목적이 있다. 과제의 해결 수단상기 목적을 달성하기 위하여, 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은, [0015]포인트 소모 리그 모드 제공 서버가, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 단계; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 단계; 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계; 상기 포인트 소모 리그 모드에 참가한상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 단계; 및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을공개특허 10-2013-0083079-7-알리는 정보를 상기 사용자 단말로 출력하는 단계;를 포함하는 것을 특징으로 한다. 본 발명의 다른 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은, 포인트 소모 리그 모드 제공 [0016]서버가, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 단계; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 단계; 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 포인트 소모리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인지 판단하는 단계; 및 상기 판단 단계에서, 포인트소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우, 상기 사용자의 기설정된 리그포인트를소모시키는 단계; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를판단하는 단계; 및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 단계;를 포함하는 것을 특징으로 한다. 상기 판단 단계에서, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레 [0017]벨에 대응되도록 설정된 리그포인트를 소모시키는 단계;를 더 포함할 수 있다. 상기 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우, 상기 사용자의 기설정된 [0018]리그포인트를 소모시키는 단계는, 상기 게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 대전일 경우, 상기 게임을 개설한 사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것이 바람직하다. 상기 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가능한 적 [0019]어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대응되어소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 단계;를 더 포함할 수 있다. 여기서, 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 [0020]리그포인트를 획득할 수 있는 것이 바람직하다. 또한 상기 리그포인트는, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 [0021]사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를포함하는 것이 바람직하다. 한편, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 [0022]단계는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메뉴를 출력하는 것이 바람직하다. 상기 사용자의 기설정된 리그포인트를 소모시키는 단계는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 [0023]후 사용자가 상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하다. 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정 [0024]된 리그포인트를 소모시키는 단계는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 또한 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 [0025]설정된 리그포인트를 소모시키는 단계는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 상대편 사용자가 게임시작 전에 이탈하여 게임을 진행할 수 없는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드 제공 서버는 사용자 단말 접속 시, 기설정된 기간 동안 기 [0026]설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 포인트 소모 리그 모드 제공부; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 게임 캐릭터 정보 제공부; 상기공개특허 10-2013-0083079-8-사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 사용자의 기설정된 리그포인트를 소모시키는 리그포인트 관리부; 상기 포인트 소모 리그 모드에 참가한 상기사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 리그 진행 여부 판단부; 및 상기 포인트 소모 리그모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그 모드에서 게임을 진행할수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 리그 참여 정보 제공부;를 포함하는 것을 특징으로한다. 상기 게임 캐릭터 정보 제공부는, 상기 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 [0027]경우, 상기 게임에 이용 가능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료시 상기 게임 캐릭터에 대응되어 소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 것이 바람직하다. 상기 리그포인트 관리부는, 상기 게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 [0028]대전일 경우, 상기 게임을 개설한 사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것이바람직하다. 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터 [0029]의 레벨에 대응되도록 설정된 리그포인트를 소모시키는 것이 바람직하다. 상기 게임 캐릭터에는, 게임 캐릭터의 능력치와 게임 종료 시 소모될 리그포인트 정보가 포함된 것이 바람직하 [0030]다. 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인 [0031]트를 획득할 수 있는 것이 바람직하다. 또한 상기 리그포인트는, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 [0032]사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를포함하는 것이 바람직하다. 또한 상기 리그 참여 정보 제공부는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링 [0033]크 메뉴를 출력하는 것이 바람직하다. 상기 리그포인트 관리부는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 [0034]것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하다. 한편, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 [0035]접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한리그포인트를 환원시키는 것이 바람직하다. 반면에, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 [0036]접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 상대편 사용자가 게임 시작 전에 이탈하여 게임을 진행할 수 없는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 발명의 효과본 발명에 따르면, 온라인 대전 게임에서 사용자가 생성한 사용자 리그 모임에 등록한 사용자 간 리그를 운영할 [0037]수 있는 방법을 제공함으로써 사용자가 과도하게 여러 번의 토너먼트나 리그의 우승에 도전하게 되는 문제를 차단할 수 있는 뛰어난 효과가 있다. 도면의 간단한 설명도 1은 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 나타낸 플로우차트이다. [0038]도 2는 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드 제공 서버의 구성을 나타낸 기능블록도이다. 도 3은 본 발명의 다른 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 나타낸 플로우차트이다. 도 4는 도 1 및 도 3에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법에서 포인트 소모 리그 인터페이스가 사용자 단말에 출력된 화면을 나타낸 도면이다. 공개특허 10-2013-0083079-9-도 5는 도 1 및 도 3에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법에서 게임 캐릭터 선택 시 사용자단말에 출력된 화면을 나타낸 도면이다. 도 6은 도 1 및 도 3에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법에서 리그포인트가 모두 소모된 포인트 소모 리그를 진행할 수 없음을 나타내는 정보가 사용자 단말에 출력된 모습을 나타낸 도면이다. 도 5는 도 1 및 도 3에 따라 사용자 모임 리그에 참가한 사용자 단말에 사용자 모임 리그 인터페이스가 출력된화면을 나타낸 도면이다. 발명을 실시하기 위한 구체적인 내용이하, 첨부된 도면을 참조하여 본 발명의 각 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법 및 [0039]포인트 소모 리그 모드 제공 서버에 대하여 설명하기로 한다.이하의 실시 예는 본 발명의 이해를 돕기 위한 상세한 설명이며, 본 발명의 권리 범위를 제한하는 것이 아님은 [0040]당연할 것이다. 따라서 본 발명과 동일한 기능을 수행하는 균등한 발명 역시 본 발명의 권리 범위에 속할 것이다. 또한 각 도면의 구성요소들에 참조부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 [0041]표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어,관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그상세한 설명은 생략한다.또한, 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. [0042]이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성 요소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다.본 발명의 실시 예에서 \"통신\", \"통신망\" 및 \"네트워크\"는 동일한 의미로 사용될 수 있다. 상기 세 용어들은, [0043]파일을 사용자 단말, 다른 사용자들의 단말 및 다운로드 서버 사이에서 송수신할 수 있는 유무선의 근거리 및광역 데이터 송수신망을 의미한다.이하의 설명에서 \"게임 서버\" 사용자들이 접속하여 게임 컨텐츠를 이용하기 위하여 접속하게 되는 서버 컴퓨터 [0044]를 의미한다. 용량이 작거나 이용자 수가 작은 게임의 경우 하나의 게임 서버에 다수의 게임 프로그램이 운영될수 있다. 또한, 용량이 매우 크거나 실시간 접속 인원수가 많은 게임의 경우, 게임의 기능에 따라서 하나의 게임의 운영을 위한 게임 서버가 하나 이상 존재할 수도 있다.또한 게임 서버에는 데이터베이스에 대한 미들웨어나 결제 처리를 수행하는 서버들이 연결될 수 있으나, 본 발 [0045]명에서는 이에 대한 설명은 생략하기로 한다.본 발명에서 온라인 게임은, 상기 언급한 게임 서버에 접속하여 사용자들이 이용할 수 있는 게임 컨텐츠를 의미 [0046]한다. 특히, 게임 상에서 다수의 사용자들이 동시에 접속하여 즐길 수 있으며, 게임을 진행하여 캐릭터를 육성하면서 경험치를 획득하는 등의 행위를 통해 레벨을 상승시키는 게임을 의미한다. 이하 설명에서는 설명의 편이를 위해, 온라인 게임의 일례로 온라인 축구 게임을 선택하고, 사용자가 축구팀의 [0047]감독으로써 자신이 감독하는 팀과 상대팀과의 경기를 통해 자신이 선택한 팀을 성장시키는 형태로 게임이 운영되도록 한다. 사용자는 축구 리그가 운영되는 다수의 나라 중 하나를 선택하여 참가 리그를 결정하고, 참가 리그에 속한 팀 리스트를 제공받아 자신이 감독하고자 하는 팀을 선택한 후, 랜덤 또는 사용자 요청에 의해 선택된 상대팀과의 경기를 요청하여 게임을 시작할 수 있다. 또한, 팀에 소속된 각각의 선수에는 실제 축구 선수의실제 모습과 그 능력치가 최대한 반영되도록 하여, 사용자의 흥미가 극대화될 수 있도록 한다. 더하여, 온라인 축구 게임은 게임 결과에 따른 감독과 선수의 성장을 리그플레이 경기를 기본으로 하며, 리그 [0048]성적을 고려하여 컵 대회 출전 및 리그 등급 상승 등 팀 운영 능력치가 높아질 수 있다. 본 발명에서 스포츠는, 일반적인 의미의 스포츠를 의미하며, 온라인 게임으로 실행될 수 있는 모든 종목의 스포 [0049]츠를 의미한다. 예를 들어, 축구, 야구, 농구, 테니스, 배구, 육상, 격투기 종목 등이 포함될 수 있다.도 1은 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 나타내는 플로우차트이 [0050]공개특허 10-2013-0083079-10-고, 도 2는 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드 제공 서버를 나타낸 기능블록도이다. 도 1에 도시된 바와 같이, 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은 도 2 [0051]에 도시된 바와 같이 별다른 수행 주체가 없는 이상 포인트 소모 리그 모드 제공 서버(100)에 의해 수행된다. 이러한, 포인트 소모 리그 모드 제공 서버(100)는 적어도 하나 이상의 사용자 단말(200)과 연결되어 있다. [0052]먼저, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인트 소모 시 게임의 진행이 제한 [0053]되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공한다(S110). 여기서, 상기 포인트 소모 리그 모드는 복수개의 경기 결과를 종합하여 목적을 달성하는 게임을 토너먼트(tournament) 형식의 게임 또는 리그(league) 형식의 게임일 수 있다. 이때, 토너먼트 형식의 게임은 각각의 경기 승리한 경우에만 연속되는 다음경기가 제공되는 방식의 게임 진행 방법으로, 참여한 캐릭터들 또는 팀들 중 마지막까지 승리한 캐릭터 또는 팀이 우승을 차지한다. 그리고 리그 형식의 게임은 기설정된 복수개의 경기를 모두 수행한 후, 참여한 캐릭터들또는 팀들 중 가장 높은 승률을 획득한 캐릭터 또는 팀이 우승을 차지한다. 통상적으로 리그전에서는 참여한 모든 캐릭터들 또는 팀들이 서로 최소한 1회씩은 경기를 수행하도록 한다. 본 발명의 일 실시 예에서의 포인트 소모 리그 모드는 월드컵 본선 방식으로 게임 모드를 진행하되, 사용자가 [0054]인공지능이 운영하는 상대방과의 게임을 플레이하는 것으로 한다. 여기서, 월드컵 본선 방식은 32개국이 리그를8개의 조로 나뉘어 운영되어 각 조의 1위와 2위가 결선에 진출하는 방식이다. 따라서 사용자는 월드컵 본선에진출한 나라 중 한 나라를 자신의 게임 캐릭터로 선택할 수 있다. 상기 게임 캐릭터는 11명의 선수 캐릭터로 이루어진 팀을 의미한다. [0055]상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인 [0056]트를 획득할 수 있는 것이 바람직하며, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그고정포인트와 사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그유동포인트를 포함하는 것이 바람직하다. 그리고 포인트 소모 리그 모드의 기설정된 기간은 일 일로 설정하는 것이 바람직하며, 기설정된 리그포인트는 [0057]20점인 것이 바람직하되, 이를 한정하지는 않는다. 이후, 접속한 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하 [0058]기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 사용자 단말에 출력한다(S120). 여기서, 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에이용 가능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대응되어 소모될 리그포인트 정보를 사용자 단말로 출력하는 것이 바람직하다. 그러면, 사용자 단말에는도 4에 도시된 바와 같이 적어도 하나 이상의 게임 캐릭터, 각 게임 캐릭터에 대응되도록 설정된 능력치 정보및 각 게임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보가 포함된 게임 캐릭터 정보(212)를 포함하는포인트 소모 리그 인터페이스가 출력된다. 예를 들어, 하기에서의 게임 캐릭터는 팀을 의미하며, 게임 캐릭터의 능력치 정보는 팀의 스탯을 의미한다. [0059]만약, 사용자가 임의의 게임 캐릭터를 선택하면, 사용자 단말에는 도 5에 도시된 바와 같이 사용자가 선택한 게 [0060]임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보(222)가 포함된 게임 캐릭터 정보창(221)이 출력될 수있다. 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상 [0061]기 사용자의 기설정된 리그포인트를 소모시킨다(S130). 이후, 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단한다 [0062](S140). 상기 판단 단계(S140)에서 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우 [0063](YES), 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력한다(S150). 또한 상기 단계(S150)는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메뉴를 출 [0064]력하는 것이 바람직하다. 공개특허 10-2013-0083079-11-그러면, 사용자 단말에는 도 6에 도시된 바와 같이 포인트 소모 리그에서 게임을 진행할 수 없음을 알리는 정보 [0065](232)와 다른 리그 링크시켜주는 다른 리그 링크 메뉴(233)가 포함된 게임 캐릭터 정보창(231)을 출력할 수 있다. 뿐만 아니라, 상기 단계(S150)는, 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 [0066]진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하다. 본 발명의 다른 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법에 대하여 도 3을 참조하여 설명 [0067]하기로 한다. 도 3에 도시된 바와 같이, 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은 별다 [0068]른 수행 주체가 없는 이상 포인트 소모 리그 모드 제공 서버(100)에 의해 수행된다. 먼저, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의 진행이 제한되는 [0069]모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공한다(S210). 여기서, 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인트를 획득할 수 있는 것이 바람직하며, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 사용자가 직접아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를 포함하는 것이바람직하다. 이어서, 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 [0070]진행하기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자단말에 출력한다(S220). 그러면, 사용자 단말에는 도 4에 도시된 바와 같이 적어도 하나 이상의 게임 캐릭터,각 게임 캐릭터에 대응되도록 설정된 능력치 정보 및 각 게임 캐릭터에 대응되도록 설정된 소모될 리그포인트정보가 포함된 게임 캐릭터 정보(212)를 포함하는 포인트 소모 리그 인터페이스가 출력된다. 여기서, 상기 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가 [0071]능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대응되어 소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 것이 바람직하다. 만약, 사용자가 임의의 게임 캐릭터를 선택하면, 사용자 단말에는 도 5에 도시된 바와 같이 사용자가 선택한 게 [0072]임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보(222)가 포함된 게임 캐릭터 정보창(221)이 출력될 수있다. 이후, 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 [0073]완료(S230)하면, 상기 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인지 판단한다(S240). 상기 판단 단계(S240)에서, 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우 [0074](YES), 상기 사용자의 기설정된 리그포인트를 소모시킨다(S250). 이때, 상기 단계(S250)는, 상기 게임이 복수의사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 대전일 경우, 상기 게임을 개설한 사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것이 바람직하다. 또한 상기 단계(S250)는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 [0075]것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하다. 이어서, 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단한다 [0076](S260). 상기 판단 단계(S260)에서 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우 [0077](YES), 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력한다(S270). 또한 상기 단계(S270)는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크메뉴를 출력하는 것이 바람직하다. 그러면, 사용자 단말에는 도 6에 도시된 바와 같이 포인트 소모 리그에서 게임을 진행할 수 없음을 알리는 정보(232)와 다른 리그 링크시켜주는 다른 리그 링크 메뉴(233)가 포함된 게임캐릭터 정보창(231)을 출력할 수 있다. 한편, 상기 판단 단계(S240)에서, 상기 게임이 사용자 사이의 대전일 경우(NO), 상기 사용자가 게임에 이용한 [0078]게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모시킨다(S280). 따라서 상기 단계(S280)에서는 사용공개특허 10-2013-0083079-12-자가 선택한 게임 캐릭터 즉, 팀의 능력치(스탯)가 16000 이상일 경우 리그포인트는 5, 155000 이상일 경우4.5, 15000 이상일 경우 4, 14000 이상일 경우 3.5, 13000 이상일 경우 3, 12000 이상일 경우 2.5, 11000 이상일 경우 2, 10000 이상일 경우 1.5, 9000 이상일 경우 1, 9000 미만일 경우 0.5의 리그포인트를 소모시키는 것으로 이를 한정하지는 않는다. 이때, 상기 단계(S280)는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 [0079]차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 또한 상기 단계(S280)는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차 [0080]단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 상대편 사용자가 게임 시작 전에 이탈하여 게임을 진행할 수 없는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 이하의 설명에서 도 1 내지 2에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. [0081]도 2에 도시된 바와 같이 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드 제공 서버(100)는 사용자 단말 [0082](200)과 적어도 하나 이상의 등록 사용자 단말(201)에 연결되어 있다. 전술한 구성에서, 포인트 소모 리그 모드 제공 서버(100)는 포인트 소모 리그 모드 제공부(101), 게임 캐릭터 [0083]정보 제공부(102), 리그포인트 관리부(103), 리그 진행 여부 판단부(104) 및 리그 참여 정보 제공부(105)를 포함한다. 포인트 소모 리그 모드 제공부는 사용자 단말 접속 시, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, [0084]상기 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공한다. 여기서, 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인트를 획득할 수 있는 것이 바람직하다. 또한 상기 리그포인트는, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 [0085]사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를포함하는 것이 바람직하다. 그리고 게임 캐릭터 정보 제공부; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 [0086]소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택인터페이스를 상기 사용자 단말에 출력한다. 그러면, 사용자 단말에는 도 4에 도시된 바와 같이 적어도 하나 이상의 게임 캐릭터, 각 게임 캐릭터에 대응되도록 설정된 능력치 정보 및 각 게임 캐릭터에 대응되도록 설정된소모될 리그포인트 정보가 포함된 게임 캐릭터 정보(212)를 포함하는 포인트 소모 리그 인터페이스가 출력된다. 이때, 상기 게임 캐릭터 정보 제공부는, 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 [0087]경우, 상기 게임에 이용 가능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료시 상기 게임 캐릭터에 대응되어 소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 것이 바람직하다. 만약, 사용자가 임의의 게임 캐릭터를 선택하면, 사용자 단말에는 도 5에 도시된 바와 같이 사용자가 선택한 게 [0088]임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보(222)가 포함된 게임 캐릭터 정보창(221)이 출력될 수있다. 한편, 상기 게임 캐릭터에는, 게임 캐릭터의 능력치와 게임 종료 시 소모될 리그포인트 정보가 포함된 것이 바 [0089]람직하다. 또한 리그포인트 관리부는 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 [0090]게임 플레이를 완료하면, 상기 사용자의 기설정된 리그포인트를 소모시킨다. 이때, 리그포인트 관리부는, 상기게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 대전일 경우, 상기 게임을 개설한사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것이 바람직하며, 상기 게임이 사용자사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모시키는 것이 바람직하다. 그 뿐만 아니라, 상기 리그포인트 관리부는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 [0091]상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하다. 공개특허 10-2013-0083079-13-한편, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 [0092]접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한리그포인트를 환원시키는 것이 바람직하며, 상기 게임에서 상대편 사용자가 게임 시작 전에 이탈하여 게임을 진행할 수 없는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 그리고 리그 진행 여부 판단부는 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모 [0093]되었는지 여부를 판단한다. 또한 리그 참여 정보 제공부는 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 [0094]경우, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력한다.이때, 리그 참여 정보 제공부는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메뉴를 출력하는 것이 바람직하다. 그러면, 사용자 단말에는 도 6에 도시된 바와 같이 포인트 소모 리그에서 게임을 진행할 수 없음을 알리는 정보(232)와 다른 리그 링크시켜주는 다른 리그 링크 메뉴(233)가 포함된 게임 캐릭터 정보창(231)을 출력할 수 있다. 이상에서 전술한 본 발명의 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은, 사용자 단말에 [0095]기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 사용자 단말에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은 사용자 단말에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 사용자 단말 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 이러한 프로그램은 컴퓨터에 의해 읽힐 수 있는 기록매체에 기록되고 컴퓨터에 의해 실행됨으로써 전술한 기능 [0096]들이 실행될 수 있다. 이와 같이, 본 발명의 각 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 실행시키기 위하여, [0097]전술한 프로그램은 컴퓨터의 프로세서(CPU)가 읽힐 수 있는 C, C++, JAVA, 기계어 등의 컴퓨터 언어로 코드화된코드(Code)를 포함할 수 있다. 이러한 코드는 전술한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Function Code)를 포함할 수 있고, 전 [0098]술한 기능들을 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할수도 있다. 또한, 이러한 코드는 전술한 기능들을 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 컴퓨터 [0099]의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조 되어야 하는지에 대한 메모리 참조 관련 코드를 더포함할 수 있다. 또한, 컴퓨터의 프로세서가 전술한 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서 [0100]버 등과 통신이 필요한 경우, 코드는 컴퓨터의 프로세서가 컴퓨터의 통신 모듈(예: 유선 및/또는 무선 통신 모듈)을 이용하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야만 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등에 대한 통신 관련 코드를 더 포함할 수도 있다. 그리고 본 발명을 구현하기 위한 기능적인(Functional) 프로그램과 이와 관련된 코드 및 코드 세그먼트 등은, [0101]기록매체를 읽어서 프로그램을 실행시키는 컴퓨터의 시스템 환경 등을 고려하여, 본 발명이 속하는 기술 분야의프로그래머들에 의해 용이하게 추론되거나 변경될 수도 있다.이상에서 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는, 일 예로, ROM, RAM, CD-ROM, [0102]자기 테이프, 플로피디스크, 광 미디어 저장장치 등이 있다. 또한 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는 네트워크로 커넥션된 컴퓨터 시스 [0103]템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이 경우, 다수의 분산된컴퓨터 중 어느 하나 이상의 컴퓨터는 상기에 제시된 기능들 중 일부를 실행하고, 그 결과를 다른 분산된 컴퓨터들 중 하나 이상에 그 실행 결과를 전송할 수 있으며, 그 결과를 전송받은 컴퓨터 역시 상기에 제시된 기능들중 일부를 실행하여, 그 결과를 역시 다른 분산된 컴퓨터들에 제공할 수 있다.특히, 본 발명의 각 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 실행시키기 위한 프로그 [0104]램인 애플리케이션을 기록한 컴퓨터로 읽을 수 있는 기록매체는, 애플리케이션 스토어 서버(Application Store공개특허 10-2013-0083079-14-Server), 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버(Application ProviderServer)에 포함된 저장매체(예: 하드디스크 등)이거나, 애플리케이션 제공 서버 그 자체일 수도 있다.본 발명의 각 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 실행시키기 위한 프로그램인 애 [0105]플리케이션을 기록한 기록매체를 읽을 수 있는 컴퓨터는, 일반적인 데스크 탑이나 노트북 등의 일반 PC 뿐만 아니라, 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기를 포함할 수 있으며, 이뿐만 아니라, 컴퓨팅(Computing) 가능한 모든 기기로 해석되어야 할 것이다. 또한, 본 발명의 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 실행시키기 위한 프로그램인 [0106]애플리케이션을 기록한 기록매체를 읽을 수 있는 컴퓨터가 스마트 폰, 태블릿 PC, PDA(Personal DigitalAssistants) 및 이동통신 단말기 등의 모바일 단말기인 경우, 애플리케이션은 애플리케이션 제공 서버에서 일반PC로 다운로드 되어 동기화 프로그램을 통해 모바일 단말기에 설치될 수도 있다.이상에서, 본 발명의 실 시예를 구성하는 모든 구성 요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설 [0107]명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성 요소들이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는컴퓨터 프로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실 시예를 구현할 수 있다. 컴퓨터 프로그램의 저장매체로서는 자기 기록매체, 광 기록매체, 등이 포함될 수 있다.또한, 이상에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, [0108]해당 구성 요소가 내재될 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과동일한 의미를 가진다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미와일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인의미로 해석되지 않는다.이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 [0109]서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가능할 것이다. 따라서 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다.부호의 설명100 : 포인트 소모 리그 모드 제공 서버 [0110]101 : 사용자 모임 리그 설정부 102 : 사용자 모임 리그 참여자 모집부103 : 사용자 모임 리그 신청 판단부104 : 사용자 모임 리그 제공부 105 : 사용자 모임 리그 정보 제공부200 : 사용자 단말 210 : 등록 사용자 단말 공개특허 10-2013-0083079-15-도면도면1공개특허 10-2013-0083079-16-도면2공개특허 10-2013-0083079-17-도면3공개특허 10-2013-0083079-18-도면4도면5공개특허 10-2013-0083079-19-도면6공개특허 10-2013-0083079-20-"}
{"patent_id": "10-2011-0145284", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은, 포인트 소모 리그 모드 제공 서 버가, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 모든 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 사용자 단말에 제공하는 단계; 접속한 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 포인트 소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐 릭터 정보 선택 인터페이스를 사용자 단말에 출력하는 단계; 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 포인트 소모 리그 모드의 게임 플레이를 완료하면, 사용자의 기설정된 리그포인트를 소모시키는 단계; 포인트 소 모 리그 모드에 참가한 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 단계; 및 포인트 소모 리그 모드에 참가한 사용자의 리그포인트가 모두 소모될 경우, 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 사용자 단말로 출력하는 단계;를 포함하는 것을 특징으로 하는 것을 특징으로 한다."}
{"patent_id": "10-2011-0145284", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 제공하는 기술에 관한 것이다."}
{"patent_id": "10-2011-0145284", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 네트워크의 발전에 따라서 다양한 온라인 게임 서비스가 제공되고 있다. 또한, 그래픽 기술 및 게임 유저 단말의 성능 향상으로 인해, 고사양의 게임 프로그램들이 만들어지고 있으며, 현실 세계 또는 가상의 세계를 정 밀하게 묘사한 게임 컨텐츠가 제공되고 있다. 이에 따라서 온라인 게임에 대한 유저들의 이용이 높아지고 있으며, 게임의 장르 또한 다양해지고 있다. 최근의 게임 중에서는 스포츠 게임, 롤플레잉 게임, 1인칭 슈팅 게임 등이 인기 있는 온라인 게임들로 각광받고 있다. 이러한, 온라인 게임의 특징은 다른 사람들과 같은 게임 컨텐츠 시스템에 동시 접속하여 즐길 수 있다는 점이다. 같은 게임화면에서 각기 유저들을 대표하는 캐릭터 등을 조작하여, 다른 사람들과 협동 또는 경쟁을 통 해 게임을 즐길 수 있다. 온라인 게임에서는 다른 사람들과 하나의 미션을 협동하여 처리하거나, 다른 사람들과의 대전 등을 통해 컨텐츠 를 즐길 수 있다. 이때, 온라인 게임에서는 유저들 사이의 경쟁심을 유발하는 컨텐츠를 마련할 필요가 있다. 온 라인 게임의 특징 상, 그 이용률을 유지하거나 증가시키기 위해서는, 유저들 사이의 경쟁심을 유발함으로써, 유 저들이 계속적으로 온라인 게임에 접속하여 게임을 플레이하도록 하여야 하기 때문이다. 한편, 온라인 게임 중에는 단시간에 진행되는 단일 경기(match)로 목적을 달성하는 게임도 있으며, 게임 자체에 경기의 구분 없이 계속적으로 주어진 임무를 수행하는 게임도 있다. 또한 복수개의 경기가 연속적으로 주어지고, 복수개의 경기 결과를 종합하여 목적을 달성하는 게임도 있다. 이중 복수개의 경기 결과를 종합하여 목적을 달성하는 게임을 토너먼트(tournament) 형식의 게임 또는 리그 (league) 형식의 게임이라 한다. 토너먼트 형식의 게임은 각각의 경기 승리한 경우에만 연속되는 다음 경기가 제공되는 방식의 게임 진행 방법으 로, 참여한 캐릭터들 또는 팀들 중 마지막까지 승리한 캐릭터 또는 팀이 우승을 차지한다. 그리고 리그 형식의 게임은 기설정된 복수개의 경기를 모두 수행한 후, 참여한 캐릭터들 또는 팀들 중 가장 높 은 승률을 획득한 캐릭터 또는 팀이 우승을 차지한다. 통상적으로 리그전에서는 참여한 모든 캐릭터들 또는 팀 들이 서로 최소한 1회씩은 경기를 수행하도록 한다. 이러한 토너먼트 또는 리그 형식의 게임에서 우승은 복수개의 경기를 승리해야 하므로, 단일 경기에서의 승리와 는 매우 다른 가치를 가지며, 사용자의 충분한 게임 실력이 뒷받침 되어야만 달성할 수 있다. 따라서 토너먼트 또는 리그 형식의 게임에서 우승한 사용자는 상대적으로 게임에 대한 충성도가 높은 고객으로 볼 수 있다. 이러한 충성도가 높은 고객은 토너먼트 또는 리그에 대해 한번 우승했다고 해서, 곧바로 그 게임을 그만두지 않 는다. 이러한 사용자는 일반적으로 동일 토너먼트나 리그를 다시 수행하거나, 다른 토너먼트나 리그를 수행하게 된다. 그러나 기존의 게임들은 토너먼트나 리그의 우승에 대한 보상 아이템을 제공함에 따라 토너먼트나 리그에서 한 번이라도 우승한 사용자는 재도전하여 짧은 시간 내에 여러 번의 토너먼트나 리그의 우승에 과도하게 도전하게 되는 문제점이 있다."}
{"patent_id": "10-2011-0145284", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 제공하고, 게임 플레이를 종료할 때마다 사용자의 리그포인 트를 소모시킴으로써 사용자가 해당 리그를 과도하게 이용하는 것을 방지할 수 있는 방법을 제공하는데 그 목적 이 있다."}
{"patent_id": "10-2011-0145284", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은, 포인트 소모 리그 모드 제공 서버가, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인 트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 단계; 접속 한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기 위 한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력 하는 단계; 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레 이를 완료하면, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 단계; 및 상기 포인트 소모 리그 모드에 참가 한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을알리는 정보를 상기 사용자 단말로 출력하는 단계;를 포함하는 것을 특징으로 한다. 본 발명의 다른 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은, 포인트 소모 리그 모드 제공 서버가, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의 진행이 제한되 는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공하는 단계; 접속한 상기 사용자 단말이 적어도 하 나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 단계; 상기 사용자 단말이 사 용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인지 판단하는 단계; 및 상기 판단 단계에서, 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 단계; 및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 단계;를 포함 하는 것을 특징으로 한다. 상기 판단 단계에서, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레 벨에 대응되도록 설정된 리그포인트를 소모시키는 단계;를 더 포함할 수 있다. 상기 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우, 상기 사용자의 기설정된 리그포인트를 소모시키는 단계는, 상기 게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대 방과의 대전일 경우, 상기 게임을 개설한 사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키 는 것이 바람직하다. 상기 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가능한 적 어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대응되어 소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 단계;를 더 포함할 수 있다. 여기서, 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인트를 획득할 수 있는 것이 바람직하다. 또한 상기 리그포인트는, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를 포함하는 것이 바람직하다. 한편, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 단계는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메뉴를 출력하는 것이 바람 직하다. 상기 사용자의 기설정된 리그포인트를 소모시키는 단계는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것 이 바람직하다. 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정 된 리그포인트를 소모시키는 단계는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간 의 접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사 용한 리그포인트를 환원시키는 것이 바람직하다. 또한 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모시키는 단계는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용 자간의 접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 상대편 사용자가 게임 시작 전에 이탈하여 게임을 진행할 수 없는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드 제공 서버는 사용자 단말 접속 시, 기설정된 기간 동안 기 설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모 드를 상기 사용자 단말에 제공하는 포인트 소모 리그 모드 제공부; 접속한 상기 사용자 단말이 적어도 하나 이 상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는 인터 페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력하는 게임 캐릭터 정보 제공부; 상기사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상 기 사용자의 기설정된 리그포인트를 소모시키는 리그포인트 관리부; 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단하는 리그 진행 여부 판단부; 및 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력하는 리그 참여 정보 제공부;를 포함하는 것을 특징으로 한다. 상기 게임 캐릭터 정보 제공부는, 상기 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대응되어 소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 것이 바람직하다. 상기 리그포인트 관리부는, 상기 게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 대전일 경우, 상기 게임을 개설한 사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것이 바람직하다. 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터 의 레벨에 대응되도록 설정된 리그포인트를 소모시키는 것이 바람직하다. 상기 게임 캐릭터에는, 게임 캐릭터의 능력치와 게임 종료 시 소모될 리그포인트 정보가 포함된 것이 바람직하 다. 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인 트를 획득할 수 있는 것이 바람직하다. 또한 상기 리그포인트는, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를 포함하는 것이 바람직하다. 또한 상기 리그 참여 정보 제공부는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링 크 메뉴를 출력하는 것이 바람직하다. 상기 리그포인트 관리부는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하다. 한편, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 반면에, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 상대편 사용자가 게임 시작 전 에 이탈하여 게임을 진행할 수 없는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다."}
{"patent_id": "10-2011-0145284", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 온라인 대전 게임에서 사용자가 생성한 사용자 리그 모임에 등록한 사용자 간 리그를 운영할 수 있는 방법을 제공함으로써 사용자가 과도하게 여러 번의 토너먼트나 리그의 우승에 도전하게 되는 문제를 차 단할 수 있는 뛰어난 효과가 있다."}
{"patent_id": "10-2011-0145284", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 각 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법 및 포인트 소모 리그 모드 제공 서버에 대하여 설명하기로 한다. 이하의 실시 예는 본 발명의 이해를 돕기 위한 상세한 설명이며, 본 발명의 권리 범위를 제한하는 것이 아님은 당연할 것이다. 따라서 본 발명과 동일한 기능을 수행하는 균등한 발명 역시 본 발명의 권리 범위에 속할 것이다. 또한 각 도면의 구성요소들에 참조부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본 질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\" 된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구 성 요소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 본 발명의 실시 예에서 \"통신\", \"통신망\" 및 \"네트워크\"는 동일한 의미로 사용될 수 있다. 상기 세 용어들은, 파일을 사용자 단말, 다른 사용자들의 단말 및 다운로드 서버 사이에서 송수신할 수 있는 유무선의 근거리 및 광역 데이터 송수신망을 의미한다. 이하의 설명에서 \"게임 서버\" 사용자들이 접속하여 게임 컨텐츠를 이용하기 위하여 접속하게 되는 서버 컴퓨터 를 의미한다. 용량이 작거나 이용자 수가 작은 게임의 경우 하나의 게임 서버에 다수의 게임 프로그램이 운영될 수 있다. 또한, 용량이 매우 크거나 실시간 접속 인원수가 많은 게임의 경우, 게임의 기능에 따라서 하나의 게 임의 운영을 위한 게임 서버가 하나 이상 존재할 수도 있다. 또한 게임 서버에는 데이터베이스에 대한 미들웨어나 결제 처리를 수행하는 서버들이 연결될 수 있으나, 본 발 명에서는 이에 대한 설명은 생략하기로 한다. 본 발명에서 온라인 게임은, 상기 언급한 게임 서버에 접속하여 사용자들이 이용할 수 있는 게임 컨텐츠를 의미 한다. 특히, 게임 상에서 다수의 사용자들이 동시에 접속하여 즐길 수 있으며, 게임을 진행하여 캐릭터를 육성 하면서 경험치를 획득하는 등의 행위를 통해 레벨을 상승시키는 게임을 의미한다. 이하 설명에서는 설명의 편이를 위해, 온라인 게임의 일례로 온라인 축구 게임을 선택하고, 사용자가 축구팀의 감독으로써 자신이 감독하는 팀과 상대팀과의 경기를 통해 자신이 선택한 팀을 성장시키는 형태로 게임이 운영 되도록 한다. 사용자는 축구 리그가 운영되는 다수의 나라 중 하나를 선택하여 참가 리그를 결정하고, 참가 리 그에 속한 팀 리스트를 제공받아 자신이 감독하고자 하는 팀을 선택한 후, 랜덤 또는 사용자 요청에 의해 선택 된 상대팀과의 경기를 요청하여 게임을 시작할 수 있다. 또한, 팀에 소속된 각각의 선수에는 실제 축구 선수의 실제 모습과 그 능력치가 최대한 반영되도록 하여, 사용자의 흥미가 극대화될 수 있도록 한다. 더하여, 온라인 축구 게임은 게임 결과에 따른 감독과 선수의 성장을 리그플레이 경기를 기본으로 하며, 리그 성적을 고려하여 컵 대회 출전 및 리그 등급 상승 등 팀 운영 능력치가 높아질 수 있다. 본 발명에서 스포츠는, 일반적인 의미의 스포츠를 의미하며, 온라인 게임으로 실행될 수 있는 모든 종목의 스포 츠를 의미한다. 예를 들어, 축구, 야구, 농구, 테니스, 배구, 육상, 격투기 종목 등이 포함될 수 있다. 도 1은 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 나타내는 플로우차트이 고, 도 2는 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드 제공 서버를 나타낸 기능블록도이다. 도 1에 도시된 바와 같이, 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은 도 2 에 도시된 바와 같이 별다른 수행 주체가 없는 이상 포인트 소모 리그 모드 제공 서버에 의해 수행된다. 이러한, 포인트 소모 리그 모드 제공 서버는 적어도 하나 이상의 사용자 단말과 연결되어 있다. 먼저, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 모든 리그포인트 소모 시 게임의 진행이 제한 되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공한다(S110). 여기서, 상기 포인트 소모 리그 모 드는 복수개의 경기 결과를 종합하여 목적을 달성하는 게임을 토너먼트(tournament) 형식의 게임 또는 리그 (league) 형식의 게임일 수 있다. 이때, 토너먼트 형식의 게임은 각각의 경기 승리한 경우에만 연속되는 다음 경기가 제공되는 방식의 게임 진행 방법으로, 참여한 캐릭터들 또는 팀들 중 마지막까지 승리한 캐릭터 또는 팀 이 우승을 차지한다. 그리고 리그 형식의 게임은 기설정된 복수개의 경기를 모두 수행한 후, 참여한 캐릭터들 또는 팀들 중 가장 높은 승률을 획득한 캐릭터 또는 팀이 우승을 차지한다. 통상적으로 리그전에서는 참여한 모 든 캐릭터들 또는 팀들이 서로 최소한 1회씩은 경기를 수행하도록 한다. 본 발명의 일 실시 예에서의 포인트 소모 리그 모드는 월드컵 본선 방식으로 게임 모드를 진행하되, 사용자가 인공지능이 운영하는 상대방과의 게임을 플레이하는 것으로 한다. 여기서, 월드컵 본선 방식은 32개국이 리그를 8개의 조로 나뉘어 운영되어 각 조의 1위와 2위가 결선에 진출하는 방식이다. 따라서 사용자는 월드컵 본선에 진출한 나라 중 한 나라를 자신의 게임 캐릭터로 선택할 수 있다. 상기 게임 캐릭터는 11명의 선수 캐릭터로 이루어진 팀을 의미한다. 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인 트를 획득할 수 있는 것이 바람직하며, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를 포함하는 것이 바람직하다. 그리고 포인트 소모 리그 모드의 기설정된 기간은 일 일로 설정하는 것이 바람직하며, 기설정된 리그포인트는 20점인 것이 바람직하되, 이를 한정하지는 않는다. 이후, 접속한 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하 기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 사용자 단말에 출력 한다(S120). 여기서, 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭 터에 대응되어 소모될 리그포인트 정보를 사용자 단말로 출력하는 것이 바람직하다. 그러면, 사용자 단말에는 도 4에 도시된 바와 같이 적어도 하나 이상의 게임 캐릭터, 각 게임 캐릭터에 대응되도록 설정된 능력치 정보 및 각 게임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보가 포함된 게임 캐릭터 정보를 포함하는 포인트 소모 리그 인터페이스가 출력된다. 예를 들어, 하기에서의 게임 캐릭터는 팀을 의미하며, 게임 캐릭터의 능력치 정보는 팀의 스탯을 의미한다. 만약, 사용자가 임의의 게임 캐릭터를 선택하면, 사용자 단말에는 도 5에 도시된 바와 같이 사용자가 선택한 게 임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보가 포함된 게임 캐릭터 정보창이 출력될 수 있다. 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상 기 사용자의 기설정된 리그포인트를 소모시킨다(S130). 이후, 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단한다 (S140). 상기 판단 단계(S140)에서 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우 (YES), 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력한다 (S150). 또한 상기 단계(S150)는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메뉴를 출 력하는 것이 바람직하다. 그러면, 사용자 단말에는 도 6에 도시된 바와 같이 포인트 소모 리그에서 게임을 진행할 수 없음을 알리는 정보 와 다른 리그 링크시켜주는 다른 리그 링크 메뉴가 포함된 게임 캐릭터 정보창을 출력할 수 있 다. 뿐만 아니라, 상기 단계(S150)는, 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하다. 본 발명의 다른 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법에 대하여 도 3을 참조하여 설명 하기로 한다. 도 3에 도시된 바와 같이, 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은 별다 른 수행 주체가 없는 이상 포인트 소모 리그 모드 제공 서버에 의해 수행된다. 먼저, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공한다(S210). 여기서, 상기 리그포인트는, 상기 포인 트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설정된 리그포인트를 획득할 수 있는 것이 바 람직하며, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를 포함하는 것이 바람직하다. 이어서, 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력한다(S220). 그러면, 사용자 단말에는 도 4에 도시된 바와 같이 적어도 하나 이상의 게임 캐릭터, 각 게임 캐릭터에 대응되도록 설정된 능력치 정보 및 각 게임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보가 포함된 게임 캐릭터 정보를 포함하는 포인트 소모 리그 인터페이스가 출력된다. 여기서, 상기 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가 능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대 응되어 소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 것이 바람직하다. 만약, 사용자가 임의의 게임 캐릭터를 선택하면, 사용자 단말에는 도 5에 도시된 바와 같이 사용자가 선택한 게 임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보가 포함된 게임 캐릭터 정보창이 출력될 수 있다. 이후, 상기 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료(S230)하면, 상기 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인지 판단한다 (S240). 상기 판단 단계(S240)에서, 포인트 소모 리그 모드의 게임이 인공지능이 운영하는 상대방과의 게임인 경우 (YES), 상기 사용자의 기설정된 리그포인트를 소모시킨다(S250). 이때, 상기 단계(S250)는, 상기 게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 대전일 경우, 상기 게임을 개설한 사용자를 제외 한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것이 바람직하다. 또한 상기 단계(S250)는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하다. 이어서, 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모되었는지 여부를 판단한다 (S260). 상기 판단 단계(S260)에서 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우 (YES), 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력한다 (S270). 또한 상기 단계(S270)는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메뉴를 출력하는 것이 바람직하다. 그러면, 사용자 단말에는 도 6에 도시된 바와 같이 포인트 소모 리그에서 게 임을 진행할 수 없음을 알리는 정보와 다른 리그 링크시켜주는 다른 리그 링크 메뉴가 포함된 게임 캐릭터 정보창을 출력할 수 있다. 한편, 상기 판단 단계(S240)에서, 상기 게임이 사용자 사이의 대전일 경우(NO), 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모시킨다(S280). 따라서 상기 단계(S280)에서는 사용자가 선택한 게임 캐릭터 즉, 팀의 능력치(스탯)가 16000 이상일 경우 리그포인트는 5, 155000 이상일 경우 4.5, 15000 이상일 경우 4, 14000 이상일 경우 3.5, 13000 이상일 경우 3, 12000 이상일 경우 2.5, 11000 이상 일 경우 2, 10000 이상일 경우 1.5, 9000 이상일 경우 1, 9000 미만일 경우 0.5의 리그포인트를 소모시키는 것으로 이를 한정하지는 않는다. 이때, 상기 단계(S280)는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한 리그포 인트를 환원시키는 것이 바람직하다. 또한 상기 단계(S280)는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차 단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 상대편 사용자가 게임 시작 전에 이탈하 여 게임을 진행할 수 없는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 이하의 설명에서 도 1 내지 2에 대한 설명과 중복되는 부분은 그 설명을 생략하기로 한다. 도 2에 도시된 바와 같이 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드 제공 서버는 사용자 단말 과 적어도 하나 이상의 등록 사용자 단말에 연결되어 있다. 전술한 구성에서, 포인트 소모 리그 모드 제공 서버는 포인트 소모 리그 모드 제공부, 게임 캐릭터 정보 제공부, 리그포인트 관리부, 리그 진행 여부 판단부 및 리그 참여 정보 제공부를 포 함한다. 포인트 소모 리그 모드 제공부는 사용자 단말 접속 시, 기설정된 기간 동안 기설정된 리그포인트가 할당되며, 상기 리그포인트 소모 시 게임의 진행이 제한되는 모드인, 포인트 소모 리그 모드를 상기 사용자 단말에 제공한 다. 여기서, 상기 리그포인트는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 게임을 진행할 경우, 기설 정된 리그포인트를 획득할 수 있는 것이 바람직하다. 또한 상기 리그포인트는, 기설정된 기간 동안 기설정된 리그포인트가 사용자에게 주어지는 리그 고정포인트와 사용자가 직접 아이템의 형태로 제공받아 상기 리그포인트에 관계없이 추가로 사용 가능한 리그 유동포인트를 포함하는 것이 바람직하다. 그리고 게임 캐릭터 정보 제공부; 접속한 상기 사용자 단말이 적어도 하나 이상의 게임 캐릭터 중 상기 포인트 소모 리그 모드의 게임을 진행하기 위한 게임 캐릭터를 선택할 수 있는 인터페이스인, 게임 캐릭터 정보 선택 인터페이스를 상기 사용자 단말에 출력한다. 그러면, 사용자 단말에는 도 4에 도시된 바와 같이 적어도 하나 이 상의 게임 캐릭터, 각 게임 캐릭터에 대응되도록 설정된 능력치 정보 및 각 게임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보가 포함된 게임 캐릭터 정보를 포함하는 포인트 소모 리그 인터페이스가 출력된다. 이때, 상기 게임 캐릭터 정보 제공부는, 사용자 단말이 상기 게임에 이용할 게임 캐릭터에 대한 선택을 입력할 경우, 상기 게임에 이용 가능한 적어도 하나 이상의 게임 캐릭터 정보, 게임 캐릭터의 능력치 정보와 게임 종료 시 상기 게임 캐릭터에 대응되어 소모될 리그포인트 정보를 상기 사용자 단말로 출력하는 것이 바람직하다. 만약, 사용자가 임의의 게임 캐릭터를 선택하면, 사용자 단말에는 도 5에 도시된 바와 같이 사용자가 선택한 게 임 캐릭터에 대응되도록 설정된 소모될 리그포인트 정보가 포함된 게임 캐릭터 정보창이 출력될 수 있다. 한편, 상기 게임 캐릭터에는, 게임 캐릭터의 능력치와 게임 종료 시 소모될 리그포인트 정보가 포함된 것이 바 람직하다. 또한 리그포인트 관리부는 사용자 단말이 사용자가 선택한 게임 캐릭터를 통해 상기 포인트 소모 리그 모드의 게임 플레이를 완료하면, 상기 사용자의 기설정된 리그포인트를 소모시킨다. 이때, 리그포인트 관리부는, 상기 게임이 복수의 사용자를 포함하는 팀과 상기 인공지능이 운영하는 상대방과의 대전일 경우, 상기 게임을 개설한 사용자를 제외한 다른 사용자의 리그포인트는 소모 대상에서 제외시키는 것이 바람직하며, 상기 게임이 사용자 사이의 대전일 경우, 상기 사용자가 게임에 이용한 게임 캐릭터의 레벨에 대응되도록 설정된 리그포인트를 소모 시키는 것이 바람직하다. 그 뿐만 아니라, 상기 리그포인트 관리부는, 상기 사용자 단말과의 접속이 상기 게임 도중 차단된 후 사용자가 상기 경기에서 진 것으로 판단되고, 다음 경기로 진행되는 경우, 상기 리그포인트를 소모시키는 것이 바람직하 다. 한편, 상기 리그포인트 관리부는, 상기 게임이 사용자 사이의 대전일 경우, 상기 게임에서 대전한 사용자간의 접속은 차단되고, 두 사용자가 모두 접속은 유지된 상태인 경우, 상기 게임에서 이기고 있는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하며, 상기 게임에서 상대편 사용자가 게임 시작 전에 이탈하여 게임을 진 행할 수 없는 사용자에게 사용한 리그포인트를 환원시키는 것이 바람직하다. 그리고 리그 진행 여부 판단부는 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모 되었는지 여부를 판단한다. 또한 리그 참여 정보 제공부는 상기 포인트 소모 리그 모드에 참가한 상기 사용자의 리그포인트가 모두 소모될 경우, 상기 포인트 소모 리그 모드에서 게임을 진행할 수 없음을 알리는 정보를 상기 사용자 단말로 출력한다. 이때, 리그 참여 정보 제공부는, 상기 포인트 소모 리그 모드를 제외한 다른 모드의 실행이 가능하도록 링크 메 뉴를 출력하는 것이 바람직하다. 그러면, 사용자 단말에는 도 6에 도시된 바와 같이 포인트 소모 리그에서 게임 을 진행할 수 없음을 알리는 정보와 다른 리그 링크시켜주는 다른 리그 링크 메뉴가 포함된 게임 캐 릭터 정보창을 출력할 수 있다. 이상에서 전술한 본 발명의 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법은, 사용자 단말에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램 을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비 스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 사용자 단말에 직접 설치한 애플리케이션(즉, 프로그 램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 실시 예에 따른 포인트 소모 리그 모드의 리 그포인트 관리 방법은 사용자 단말에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로 그램)으로 구현되고 사용자 단말 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 이러한 프로그램은 컴퓨터에 의해 읽힐 수 있는 기록매체에 기록되고 컴퓨터에 의해 실행됨으로써 전술한 기능 들이 실행될 수 있다. 이와 같이, 본 발명의 각 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 실행시키기 위하여, 전술한 프로그램은 컴퓨터의 프로세서(CPU)가 읽힐 수 있는 C, C++, JAVA, 기계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 전술한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Function Code)를 포함할 수 있고, 전 술한 기능들을 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수도 있다. 또한, 이러한 코드는 전술한 기능들을 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 컴퓨터 의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조 되어야 하는지에 대한 메모리 참조 관련 코드를 더 포함할 수 있다. 또한, 컴퓨터의 프로세서가 전술한 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서 버 등과 통신이 필요한 경우, 코드는 컴퓨터의 프로세서가 컴퓨터의 통신 모듈(예: 유선 및/또는 무선 통신 모 듈)을 이용하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야만 하는지, 통신 시 어떠 한 정보나 미디어를 송수신해야 하는지 등에 대한 통신 관련 코드를 더 포함할 수도 있다. 그리고 본 발명을 구현하기 위한 기능적인(Functional) 프로그램과 이와 관련된 코드 및 코드 세그먼트 등은, 기록매체를 읽어서 프로그램을 실행시키는 컴퓨터의 시스템 환경 등을 고려하여, 본 발명이 속하는 기술 분야의 프로그래머들에 의해 용이하게 추론되거나 변경될 수도 있다. 이상에서 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는, 일 예로, ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 미디어 저장장치 등이 있다. 또한 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는 네트워크로 커넥션된 컴퓨터 시스 템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이 경우, 다수의 분산된 컴퓨터 중 어느 하나 이상의 컴퓨터는 상기에 제시된 기능들 중 일부를 실행하고, 그 결과를 다른 분산된 컴퓨 터들 중 하나 이상에 그 실행 결과를 전송할 수 있으며, 그 결과를 전송받은 컴퓨터 역시 상기에 제시된 기능들 중 일부를 실행하여, 그 결과를 역시 다른 분산된 컴퓨터들에 제공할 수 있다. 특히, 본 발명의 각 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 실행시키기 위한 프로그 램인 애플리케이션을 기록한 컴퓨터로 읽을 수 있는 기록매체는, 애플리케이션 스토어 서버(Application StoreServer), 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버(Application Provider Server)에 포함된 저장매체(예: 하드디스크 등)이거나, 애플리케이션 제공 서버 그 자체일 수도 있다. 본 발명의 각 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 실행시키기 위한 프로그램인 애 플리케이션을 기록한 기록매체를 읽을 수 있는 컴퓨터는, 일반적인 데스크 탑이나 노트북 등의 일반 PC 뿐만 아 니라, 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기를 포 함할 수 있으며, 이뿐만 아니라, 컴퓨팅(Computing) 가능한 모든 기기로 해석되어야 할 것이다. 또한, 본 발명의 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 실행시키기 위한 프로그램인 애플리케이션을 기록한 기록매체를 읽을 수 있는 컴퓨터가 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기인 경우, 애플리케이션은 애플리케이션 제공 서버에서 일반 PC로 다운로드 되어 동기화 프로그램을 통해 모바일 단말기에 설치될 수도 있다. 이상에서, 본 발명의 실 시예를 구성하는 모든 구성 요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설 명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서 라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성 요소 들이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발 명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실 시 예를 구현할 수 있다. 컴퓨터 프로그램의 저장매체로서는 자기 기록매체, 광 기록매체, 등이 포함될 수 있다. 또한, 이상에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소가 내재될 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요 소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미와 일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보 호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명 의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2011-0145284", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 나타낸 플로우차트이다. 도 2는 본 발명의 일 실시 예에 따른 포인트 소모 리그 모드 제공 서버의 구성을 나타낸 기능블록도이다. 도 3은 본 발명의 다른 실시 예에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법을 나타낸 플로우차트이 다. 도 4는 도 1 및 도 3에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법에서 포인트 소모 리그 인터페이스 가 사용자 단말에 출력된 화면을 나타낸 도면이다. 도 5는 도 1 및 도 3에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법에서 게임 캐릭터 선택 시 사용자 단말에 출력된 화면을 나타낸 도면이다. 도 6은 도 1 및 도 3에 따른 포인트 소모 리그 모드의 리그포인트 관리 방법에서 리그포인트가 모두 소모된 포 인트 소모 리그를 진행할 수 없음을 나타내는 정보가 사용자 단말에 출력된 모습을 나타낸 도면이다. 도 5는 도 1 및 도 3에 따라 사용자 모임 리그에 참가한 사용자 단말에 사용자 모임 리그 인터페이스가 출력된 화면을 나타낸 도면이다."}
