{"patent_id": "10-2016-0141312", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0046269", "출원번호": "10-2016-0141312", "발명의 명칭": "통신망을 이용한 재난정보 통합 서비스 제공 시스템", "출원인": "대한민국", "발명자": "정성욱"}}
{"patent_id": "10-2016-0141312", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "재난사고시 유무선 통신망을 이용하여 지휘부 및 현장 대응자를 위한 재난정보 통합 서비스 제공 시스템에 있어서,재난현장에 설치되어 재난현장의 각종 환경정보를 수집하는 검지기;재난현장의 현장정보 및 재난대응 매뉴얼정보를 구비하고, 상기 검지기로부터 상기 환경정보를 전송받는 재난정보 제공서버; 및재난대응 애플리케이션이 탑재되어 현장 대응자가 구비하고, 상기 재난정보 제공서버로부터 전송되는 상기 현장정보, 상기 재난대응 매뉴얼정보 및 상기 환경정보가 상기 애플리케이션 상에서 표시되는 현장 대응자 단말기;를 포함하는 통신망을 이용한 재난정보 통합 서비스 제공 시스템."}
{"patent_id": "10-2016-0141312", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 재난정보 제공서버는 재난현장에 위치되는 장비의 운용방법 및 재난현장에 필요한 응급조치에 대한 동영상정보를 더 구비하여 상기 현장 대응자 단말기로 전송하는 것을 특징으로 하는 통신망을 이용한 재난정보 통합서비스 제공 시스템."}
{"patent_id": "10-2016-0141312", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,재난현장 또는 재난현장과 인접한 장소에서 재난사고를 신고하는 신고자 단말기; 및상기 신고자 단말기의 재난사고 신고를 음성정보로 접수받는 신고접수서버;를 더 포함하고,상기 재난정보 제공서버는 상기 신고접수서버와 연동되어 상기 음성정보를 분석하여 재난현장의 위치정보 및 재난종류정보를 파악하는 것을 특징으로 하는 통신망을 이용한 재난정보 통합 서비스 제공 시스템."}
{"patent_id": "10-2016-0141312", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 재난정보 제공서버는 재난현장의 상기 현장 대응자 단말기로 상기 재난현장의 위치정보 및 재난종류정보에대응하는 상기 현장정보 및 상기 재난대응 매뉴얼정보를 전송하는 것을 특징으로 하는 통신망을 이용한 재난정보 통합 서비스 제공 시스템."}
{"patent_id": "10-2016-0141312", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 환경정보는 재난현장의 가스압 또는 공기압 정보, 수압 정보, 방사능 정보, 지진정보 및 기상정보 중 적어도 하나 이상을 포함하는 것을 특징으로 하는 통신망을 이용한 재난정보 통합 서비스 제공 시스템."}
{"patent_id": "10-2016-0141312", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 현장정보는 재난현장의 시설정보, 물질정보, 선박정보 및 비행기정보 중 적어도 하나 이상을 포함하는 것을 특징으로 하는 통신망을 이용한 재난정보 통합 서비스 제공 시스템."}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 유무선 통신망을 이용한 재난정보 통합 서비스 제공 시스템에 관한 것이다. 본 발명의 일실시예에 따라 재난사고시 유무선 통신망을 이용하여 지휘부 및 현장 대응자를 위한 재난정보 통합 서비스 제공 시스템은, 재난현장에 설치되어 재난현장의 각종 환경정보를 수집하는 검지기; 재난현장의 현장정보 (뒷면에 계속)"}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 재난정보 제공 시스템에 관한 것으로, 보다 상세하게는 유무선 통신망을 이용한 재난정보 통합 서비 스 제공 시스템에 관한 것이다."}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현대 사회는 급격한 발전을 거듭하면서 과거에 경험하지 못했던 수많은 재난재해의 상황에 놓이게 되었다. 침수 나 화재, 선박 사고 등 기타 다양한 재난은 구조화된 지역 사회를 순식간에 혼란에 빠트리고, 다양한 방식에 의 해 인명과 재산 손실을 가져온다. 최근, 일본의 지진 및 방사능 유출사고로 인해 재난 사고에 대한 관심이 전국 민적으로 더욱 증가하고 있다. 특히, 최근에는 기존에 없던 원인으로 복합적이고 대형화된 재난이 발생하고 있고, 다양한 상황전개로 하나도 같은 사고는 없으나 매번 비슷한 이유로 실수를 반복하고 있어 이러한 실수를 줄이는 시스템의 도입이 필요하다. 우리나라는 발달된 정보통신기술(ICT)을 바탕으로 재난관리자원 공동활용시스템과 재난안전통신망을 구축하고 있으며, 현재 시험운전중에 있다. 이는 지휘부와 현장 대응자가 사고 현장상황을 올바로 판단하고 지시하기 위 해 발달된 정보통신기술의 통해 해결하고자 함에서 시작하였다. 2015년 국민안전처 장관은 머리가 아닌 몸이 알도록 훈련하고 비슷한 사고에 비슷한 잘못을 하지 말고, 또한 국 민의 안전을 지키기 위해서는 자신의 안전이 우선이라는 요지의 언급을 하였다. 따라서, 사고현장에서 비슷한 잘못을 하지 않고 자신의 안전을 지키기 위해 현장에 과학적인 측정장비로 위험을 분석하고 회피하면서 현장 대응자의 작업 효율을 높이기 위해 충분한 대응시간이 필요하다. 그렇지 않으면 현장 대응자는 짧은 대응시간 동안 눈에 보이는 것부터 시작하고 해결할 수 밖에 없게 된다. 현장 대응자는 사고현장 정보가 부족한 상태에서 현장에 대응하는 경우가 많다. 또한, 현장 대응자 및 동원인력 등이 지원되는 모든 장비나 물자에 대해 사용법을 모두 숙지하기는 사실상 어려우며, 비슷한 장비도 작동법이 조금씩 상이하여 손에 익숙한 것만 사용하려는 경향이 높은 실정이다. 올해, 국무총리는 재난사고에 대한 대응방법이나 체계와 관련하여 홍보 강화를 지시하면서 홍보의 목적은 국민 이 이렇게 행동하면 나의 생명과 재산을 지킬 수 있다는 것을 알리기 위해서라고 하였다. 그러기 위해서는 사고 당사자나 인근의 지원하러 온 현장 대응자 등이 정말 도움이 되는 일을 하고 긍지를 갖게 하기 위해서는 사전에 교육이 되어야 한다. 그러나 모든 사고에 대해 모든 사고대응방식을 숙지하기는 불가능하 므로 이를 해결할 수 있는 적절한 정보의 제공은 적은 양의 지식과 장비를 시연하는 것만으로도 전문가에 가까 운 능력을 발휘할 수 있을 것이다. 이를 위해 사전에 사고대응자료를 준비하고 사고시에 이 자료가 올바로 전달되기 위해 우리나라의 강점인 정보 통신기술을 이용할 필요가 있다. 최근 대통령은 정부 3.0 창조경제를 주창하면서 융합(convergence)을 강조한 바 있다. 따라서 정부의 추진하는 정책을 고도화하고 현장 대응자도 발달된 정보통신기술의 혜택을 통해 원활하고 체계적인 초동 조치가 가능한 재난정보 통합 서비스 제공 시스템의 도입이 시급하다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2012-0130427호(공개일자: 2012.12.03.) \"재난 정보 알림 시스템 및 방법\""}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 종래의 문제점을 해결하기 위해 제안된 본 발명의 목적은 고위험에 노출된 최일선 현장 대응자가 재난현장의 각종 정보와 자료를 정보통신기술을 활용하여 용이하게 획득할 수 있도록 함으로써 재난현장 대응능 력의 향상과 재난사고의 체계적이고 합리적인 대응체계를 갖출 수 있도록 하는 통신망을 이용한 재난정보 통합 서비스 제공 시스템을 제공하는데 있다. 또한, 본 발명의 다른 목적은 현장 대응자가 손에 익숙한 구식장비만 고집하고 답습하는 업무 형태를 개선하여 새로운 장비조작을 현장에서 쉽게 숙달하여 사용하도록 도와줌으로써 신규장비의 활용도를 높여 원시적인 사고 처리라는 비난을 줄일 수 있는 통신망을 이용한 재난정보 통합 서비스 제공 시스템을 제공하는 것이다. 또한, 본 발명의 또 다른 목적은 추가 인력동원시 장비에 대한 지식이 많지 않거나 비슷한 종류의 장비를 가동 한 경험이 있을 경우 동영상 등으로 간단히 현대적인 장비의 조작이 가능하도록 운용정보를 제공하여 동원인력 의 효율적인 이용을 도모함으로써 체계적인 사고처리에 기여할 수 있는 통신망을 이용한 재난정보 통합 서비스 제공 시스템을 제공하기 위함이다. 본 발명이 해결하고자 하는 과제는 여기에 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재로부"}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 사람(통상의 기술자)에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위해 본 발명은 통신망을 이용한 재난정보 통합 서비스 제공 시스템을 제공한다. 본 발명의 일실시예에 따라 재난사고시 유무선 통신망을 이용하여 지휘부 및 현장 대응자를 위한 재난정보 통합 서비스 제공 시스템은, 재난현장에 설치되어 재난현장의 각종 환경정보를 수집하는 검지기; 재난현장의 현장정 보 및 재난대응 매뉴얼정보를 구비하고, 상기 검지기로부터 상기 환경정보를 전송받는 재난정보 제공서버; 및 재난대응 애플리케이션이 탑재되어 현장 대응자가 구비하고, 상기 재난정보 제공서버로부터 전송되는 상기 현장 정보, 상기 재난대응 매뉴얼정보 및 상기 환경정보가 상기 애플리케이션 상에서 표시되는 현장 대응자 단말기; 를 포함한다."}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 통신망을 이용한 재난정보 통합 서비스 제공 시스템은 고위험에 노출된 최일선 현장 대응자가 재난현장의 각종 정보와 자료를 정보통신기술을 활용하여 용이하게 획득할 수 있도록 함으로써 재난현 장 대응능력의 향상과 재난사고의 체계적이고 합리적인 대응체계를 갖출 수 있도록 한다. 또한, 본 발명의 실시예에 따른 통신망을 이용한 재난정보 통합 서비스 제공 시스템은 현장 대응자가 손에 익숙 한 구식장비만 고집하고 답습하는 업무 형태를 개선하여 새로운 장비조작을 현장에서 쉽게 숙달하여 사용하도록 도와줌으로써 신규장비의 활용도를 높여 원시적인 사고처리라는 비난을 줄일 수 있다. 또한, 본 발명의 실시예에 따른 통신망을 이용한 재난정보 통합 서비스 제공 시스템은 추가 인력동원시 장비에 대한 지식이 많지 않거나 비슷한 종류의 장비를 가동한 경험이 있을 경우 동영상 등으로 간단히 현대적인 장비 의 조작이 가능하도록 운용정보를 제공하여 동원인력의 효율적인 이용을 도모함으로써 체계적인 사고처리에 기 여할 수 있는 장점이 있다."}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부된 도면들을 참조하여 본 발명의 바람직한 실시 예를 상세하게 설명한다. 각 도면은 명확한 설 명을 위해 일부가 간략하거나 과장되게 표현되었다. 각 도면의 구성 요소들에 참조 번호를 부가함에 있어서, 동 일한 구성 요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 동일한 부호를 가지도록 도시되었음에 유의해야 한다. 또한, '포함(또는 구비)한다'로 언급된 구성 요소 및 동작은 하나 이상의 다른 구성요소 및 동 작의 존재 또는 추가를 배제하지 않는다. 더불어, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대 한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 도 1은 본 발명의 일실시예에 따른 통신망을 이용한 재난정보 통합 서비스 제공 시스템의 개념도이고, 도 2는 본 발명의 일실시예에 따른 통신망을 이용한 재난정보 통합 서비스 제공 시스템의 개략적인 구성을 나타내는 도 면이고, 도 3은 도 1의 재난정보 제공서버의 세부 구성도이다. 도 1 및 도 2를 참조하면, 통신망을 이용한 재난정보 통합 서비스 제공 시스템은 검지기, 재난정보 제 공서버 및 현장 대응자 단말기를 포함한다. 이와 같은 본 발명은 선박사고 등 재난사고시 유무선 통 신망을 이용하여 지휘부 및/또는 현장 대응자를 위해 재난정보 통합 서비스를 제공할 수 있다. 검지기는 재난현장에 다수 설치되어 재난현장의 각종 환경정보(EI)를 수집한다. 이러한 검지기는 기 압계, 수압계, 방사능 측정기 등 여러 종류의 각종 센서(sensor)들을 포함할 수 있다. 여기서, 환경정보(EI)는 재난현장의 가스압 또는 공기압 정보, 수압 정보, 방사능 정보, 지진정보 및 기상정보 중 적어도 하나 이상을 포함한다. 재난정보 제공서버는 재난현장의 현장정보(SI) 및 재난대응 매뉴얼정보(MI)를 구비한다. 또한, 재난정보 제공서버는 검지기로부터 환경정보(EI)를 전송받는다. 여기서 현장정보(SI)는 재난현장의 시설정보, 물질정보, 선박정보 및 비행기정보 중 적어도 하나 이상을 포함한 다. 상기 재난현장의 시설정보는 도면 등의 건물정보 등을 포함한다. 건물 등이 특수목적을 가질 경우 그 특수 목적 을 위해 부가되는 각종 정보를 포함할 수 있다. 상기 재난현장의 물질정보는 화학약품 등 위험물질의 종류, 물질의 특성, 유출물질의 제거 또는 대응정보 등을 포함한다. 상기 선박정보는 선박의 종류, 배수량 정보, 출항정보 및 도면정보 등을 포함한다. 상기 비행기정보는 비행기의 종류, 운항정보 및 도면정보 등을 포함한다. 재난대응 매뉴얼정보(MI)는 업체 및 각 기관의 현장대응 매뉴얼을 포함한다. 이러한 재난대응 매뉴얼정보(MI)는 현장 대응자 단말기로 제공되어 체계적인 사고처리에 도움을 줄 수 있다. 도 3을 참조하면, 재난정보 제공서버는 데이터베이스, 통신모듈, 음성정보분석모듈, 재난 정보 판정모듈, 검색모듈 및 제어모듈을 포함한다. 여기서 제어모듈은 데이터베이스, 통신모듈, 음성정보분석모듈, 재난정보 판정모듈 및 검색모듈을 모두 제어할 수 있다. 데이터베이스에는 현장정보(EI), 재난대응 매뉴얼정보(MI), 환경정보(EI) 및 후술하는 동영상정보(VI)가 저장된다. 이러한 각종 정보들은 사전 입력 혹은 수집되는 형태로 등록될 수 있다. 실시예에 따라, 현장정보(EI), 즉 물질정보, 시설정보 등은 각각의 기관 단체 혹은 업체에서 자료를 보유하고 있으므로, 검색모듈 등은 이러한 데이터를 서치(search)하여 통합적으로 확보할 수도 있다. 현장 대응자 단말기는 재난현장의 현장 대응자가 구비한다. 현장 대응자 단말기에는 재난대응 애플리 케이션(A)이 탑재된다. 현장 대응자 단말기는 스마트폰, 스마트패드 등 각종 스마트 기기를 포함한다. 현장 대응자 단말기는 통화버튼을 통해 통화가 가능하고, 마이크 및 스피커 등을 구비할 수 있다. 현장 대응자 단말기는 재난정보 제공서버로부터 현장정보(SI), 재난대응 매뉴얼정보(MI) 및 환경정보 (EI)를 전송받는다. 즉, 현장 대응자 단말기는 통신모듈을 통해 재난정보 제공서버와 통신함으 로써 재난정보 제공서버로부터 현장정보(SI) 등을 전송받는다. 현장 대응자 단말기의 애플리케이션(A) 상에는 이러한 현장정보(SI), 재난대응 매뉴얼정보(MI) 및 환경정 보(EI)가 표시된다. 재난대응 애플리케이션(A)은 재난사고 현장에서 가장 위험한 곳에 근무하는 직원들이 외부의 불확실한 음성통화 를 이용한 정보를 파악하고 사고를 처리하는 것을 개선하기 위한 것으로, 사고현장 데이터를 음성위주의 통신에 서 문자 및/또는 동영상 등으로 현장직원에게 정확하고도 효율적으로 전달하기 위함이다. 또한, 본 발명의 일실시예에 따라, 재난정보 제공서버는 재난현장에 위치되는 각종 장비의 운용방법 및/또 는 재난현장에 필요한 응급조치에 대한 동영상정보(VI)를 더 구비할 수 있다. 재난정보 제공서버는 이러한 동영상정보(VI)를 현장 대응자 단말기로 전송한다. 현장 대응자 단말기 의 애플리케이션(A) 상에는 이러한 동영상정보(VI)가 표시된다. 실시예에 따라, 위급상황에서 재난정보 제공서버가 장비나 응급조치 등 관련 자료나 데이터를 현장 대응자 (자원봉사자, 업체직원 포함)에게 원활하게 지원하지 못할 경우를 대비하여, 대응 장비마다 혹은 현장의 사고유 형마다 그에 적절한 QR(Quick Response)코드를 부착하여, 이를 통해 현장 대응자가 장비조작 동영상과 행동요령 에 필요한 정보를 용이하게 확인하여 활용하게 할 수도 있다. 도 2를 참조하면, 본 발명의 일실시예에 따른 통신망을 이용한 재난정보 통합 서비스 제공 시스템은 신고자 단말기 및 신고접수서버를 더 포함한다. 신고자 단말기는 재난현장 또는 재난현장과 인접한 장소에서 재난사고를 신고접수서버로 신고한다. 신고자 단말기는 일반적인 휴대형 전화기로 제공되면 충분하고, 통상적인 유/무선의 연락이 가능한 단말이 면 모두 가능하다. 신고접수서버는 신고자 단말기의 재난사고 신고를 음성정보(AI)로 접수받는다. 재난정보 제공서버는 신고접수서버와 연동되어 신고자 단말기가 전송한 음성정보(AI)를 분석하 여 재난현장의 위치정보(LI) 및/또는 재난종류정보(TI) 등을 파악 또는 인식할 수 있다. 재난정보 제공서버의 음성정보 분석모듈은 음성정보(AI) 중 주요 키워드(keyword)를 추출하는 등의 음성인식기술을 통해 음성정보(AI)를 분석할 수 있다. 이후, 재난정보 판정모듈은 음성정보(AI) 중의 주요 키워드 등을 통해 재난현장의 위치(서해 XX항 앞바다 등) 및 재난의 종류(선박침몰 등) 등을 판정 또는 파악할 수 있다. 실시예에 따라, 신고자 단말기는 119 또는 특정번호로 신고할 수도 있다. 이 경우, 신고접수서버는 119 또는 특정번호와 연결되는 별도의 서버 등의 장치와 연동되어 신고접수를 제공받을 수도 있다. 또한, 신고접수서버는 재난정보 제공서버의 일구성인 하나의 모듈의 형태로서 제공될 수도 있음은 물 론이다. 상기한 바와 같이, 본 발명은 음성인식기술을 기반으로 하여 신고접수의 무인화가 가능하고, 인공지능기술 기반 의 자동적인 사고대응처리가 가능하다. 사고접수의 무인화는 음성인식기술 기반으로 사람이 없이 서버(컴퓨터)가 신고를 접수하고 접수된 신고를 기계 언어로 번역하여 서버의 인공지능으로 사고대응하는 체제이다. 인공지능은 현재 각 기관마다 허가 사업체로부터 비상계획서를 검인하고 관리하고 있으며, 이에 대응장비 및 자 재도 각 기관별, 부서별로 관리하고 있어 재난자원지원시스템으로 통합할 수 있다. 이와 함께 사고판단의 예시 및 대응범위/방법을 자동으로 연산한다면 신속한 판단과 처리가 가능한 장점이 있다. 또한, 본 발명의 일실시예에 따라, 재난정보 제공서버는 재난현장의 현장 대응자 단말기로 재난현장 의 위치정보(LI) 및/또는 재난종류정보(TI)에 대응하는 현장정보(SI) 및 재난대응 매뉴얼정보(MI)를 전송한다. 실시예에 따라, 재난정보 제공서버는 재난현장의 환경정보(EI)를 전송할 수 있다. 재난현장의 환경정보 (EI)는 각종 검지기로부터 수집될 수 있다. 재난정보 제공서버의 검색모듈은 재난현장의 위치정보(LI) 및/또는 재난종류정보(TI)를 바탕으로 데 이터베이스로부터 이에 대응하는 현장정보(SI) 및 재난대응 매뉴얼정보(MI)를 검색한다. 또한, 본 발명의 일실시예에 의한 통신망을 이용한 재난정보 통합 서비스 제공 시스템은 카메라를 더 포함 한다(도 1 참조). 카메라는 재난현장에 설치되어 재난현장의 각종 이미지 정보 또는 실시간 영상정보를 수집하여 재난정보 제공서버로 전송한다. 상기 이미지 정보 또는 실시간 영상정보는 재난정보 제공서버를 통해 현장 대 응자 단말기의 애플리케이션(A) 상에 디스플레이될 수 있다. 상술한 바와 같은 구성을 갖는 본 발명은 고위험에 노출된 최일선 현장 대응자가 재난현장의 각종 정보와 자료 를 정보통신기술을 활용하여 용이하게 획득할 수 있도록 함으로써 재난현장 대응능력의 향상과 재난사고의 체계 적이고 합리적인 대응체계를 갖출 수 있도록 한다. 또한, 본 발명은 현장 대응자가 손에 익숙한 구식장비만 고집하고 답습하는 업무 형태를 개선하여 새로운 장비 조작을 현장에서 쉽게 숙달하여 사용하도록 도와줌으로써 신규장비의 활용도를 높여 원시적인 사고처리라는 비 난을 줄일 수 있다. 더불어, 본 발명은 추가 인력동원시 장비에 대한 지식이 많지 않거나 비슷한 종류의 장비를 가동한 경험이 있을 경우 동영상 등으로 간단히 현대적인 장비의 조작이 가능하도록 운용정보를 제공하여 동원인력의 효율적인 이용 을 도모함으로써 체계적인 사고처리에 기여할 수 있는 장점이 있다."}
{"patent_id": "10-2016-0141312", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술분야에 서 통상의 지식을 가진 사람이라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형 이 가능할 것이다. 따라서, 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이 고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사 상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2016-0141312", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 다음의 도면들은 본 발명의 바람직한 실시예를 예시하는 것이며, 전술한 발명의 내용과 함께 본 발명의 기술사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재된 사항에만 한정되어 해석되어서는 아니된다. 도 1은 본 발명의 일실시예에 따른 통신망을 이용한 재난정보 통합 서비스 제공 시스템의 개념도 도 2는 본 발명의 일실시예에 따른 통신망을 이용한 재난정보 통합 서비스 제공 시스템의 개략적인 구성을 나타 내는 도면 도 3은 도 2의 재난정보 제공서버의 세부 구성도"}
