{"patent_id": "10-2021-0001803", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0100739", "출원번호": "10-2021-0001803", "발명의 명칭": "개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템 및 방법", "출원인": "주식회사 강점코칭심리연구소", "발명자": "김기년"}}
{"patent_id": "10-2021-0001803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "심리척도 전문가들에 의해 개발된 심리척도들이 업로드되고, 심리 검사자들의 요구(Qurey)에 상응하여 상기 저장된 심리척도들이 분류되고 디스플레이되고 선택되도록 사용자 인터페이스를 제공하는 개방형 심리척도 전문가플랫폼 및 상기 업로드된 심리척도들을 저장하는 심리척도 DB를 포함하는 전문가 플랫폼 서버;상기 전문가 플랫폼 서버를 통해 선택된 심리척도들로 구성된 심리척도 블록을 이용하여 피검사자 맞춤형 심리검사블록을 생성하고, 상기 맞춤형 심리검사블록에 접근할 수 있는 온라인 검사 URL을 포함하는 맞춤형 심리검사 정보를 피검사자 단말로 전송하고, 상기 URL을 통해 접속한 피검사자 단말을 통한 심리검사 문항에 대한 답변을 분석하여 검사결과를 생성하는 심리검사 서버; 및상기 맞춤형 심리검사 정보를 수신하고, 상기 심리검사 정보에 포함된 온라인 검사 URL을 통해 접속하여 맞춤형심리검사 블록의 심리검사 항목에 대한 답변을 수행하는 피검사자 단말을 포함하는, 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템."}
{"patent_id": "10-2021-0001803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 심리검사 서버는상기 전문가 플랫폼 서버로부터 피검사자의 심리검사 목적에 상응하는 심리척도들이 수신되면, 상기 선택된 심리척도들로 구성된 심리척도 블록을 생성하는 심리척도블록 생성부; 상기 심리척도 블록들 중에서 검사목적에 따른 척도 문항들을 선택하고 편집할 수 있는 문항 선택/편집 사용자인터페이스를 제공하고, 선택된 문항 및 편집된 문항을 조합하여 피검사자 맞춤형 심리검사 블록을 생성하고,맞춤형 심리검사블록에 접속할 수 있는 온라인 검사 URL을 포함한 맞춤형 심리검사 정보를 피검사자 단말로 전송하는 맞춤형 심리검사 생성부;피검사자 단말이 접속하면, 상기 피검사자 단말에 상응하는 맞춤형 심리검사 블록의 문항들을 피검사자 단말에게 제공하여 심리검사를 수행하는 심리검사 수행부; 및상기 피검사자 단말을 통해 수행된 심리검사 답변을 분석하여 심리검사결과를 생성하는 검사결과 생성부를 포함하는, 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템."}
{"patent_id": "10-2021-0001803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 맞춤형 심리검사 생성부는상기 편집 및 조합된 문항들로 구성된 심리척도블록에 대해 문항들을 정제하여 새로운 심리검사 상품을 개발하고, 상기 개발된 맞춤형 심리척도 그룹에 대한 검사이름, 맞춤형 척도블록, 결과표 규격 및 상기 맞춤형 심리검사블록에 접근할 수 있는 온라인 검사 URL을 포함하는 심리검사 웹을 생성하고, 온라인 검사 URL을 포함하는 심리검사 정보를 피검사자 단말로 전송하는 것을 특징으로 하는 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템."}
{"patent_id": "10-2021-0001803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 맞춤형 심리검사 생성부는심리검사를 실시하기 전에 피검사자와의 상담을 통해 피검사자와 대화내용과 음성을 음성데이터로 수집하는 음성데이터 수집부; 상기 음성데이터 수집부에서 수집된 음성데이터를 분석하여 피검사자의 강점, 성격유형, 정서 및 인성 정보를심리배경정보로 생성하는 심리배경정보 생성부; 및상기 생성된 심리배경정보를 기반으로 하여 심리검사 문항들을 재편집 및 정제하는 사용자 인터페이스를 제공하공개특허 10-2022-0100739-3-는 검사문항편집부를 더 포함하는 것을 특징으로 하는, 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템."}
{"patent_id": "10-2021-0001803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 심리검사 수행부는심리검사를 수행할 때 심리검사 응답지의 답안 입력을 위한 인터페이스로서, 상담자 또는 인공지능을 통한 질문과 응답하기를 통해 단문 또는 장문의 음성파일을 텍스트로 변환하여 답안을 입력하는 것을 특징으로 하는 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템."}
{"patent_id": "10-2021-0001803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "전문가 플랫폼 서버에 의해 제공되는 개방형 심리척도 전문가 플랫폼을 통해 심리척도 전문가들에 의해 개발된심리척도들이 업로드 및 저장되는 단계;개방형 심리척도 전문가 플랫폼에서 제공되는 사용자 인터페이스를 통해 입력되는 심리 검사자들의 쿼리(Query)에 상응하여 저장된 심리척도들이 분류되고 디스플레이되고, 선택되는 단계;상기 개방형 심리척도 전문가 플랫폼을 통해 피검사자의 심리검사 목적에 상응하는 심리척도들이 검색되고 선택되어 상기 선택된 심리척도들이 심리검사 서버로 전송되면, 상기 심리검사 서버는 상기 심리척도들을 수신하여심리척도 블록을 생성하는 단계;문항 선택/편집 사용자 인터페이스를 통해 상기 심리척도 블록들 중에서 검사목적에 따른 척도 문항들을 선택하고 편집되면 선택된 문항 및 편집된 문항을 조합하여 피검사자 맞춤형 심리검사 블록을 생성하고, 맞춤형 심리검사블록에 접속할 수 있는 온라인 검사 URL을 포함한 맞춤형 심리검사 정보를 피검사자 단말로 전송하는 단계;피검사자 단말이 상기 온라인 검사 URL을 통해 심리검사 서버에 접속하면, 상기 피검사자 단말에 상응하는 맞춤형 심리검사 블록의 문항들을 피검사자 단말에게 제공하여 심리검사를 수행하는 단계; 및상기 피검사자 단말을 통해 수행된 심리검사 답변을 분석하여 심리검사결과를 생성하는 단계를 포함하는, 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 방법."}
{"patent_id": "10-2021-0001803", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템 및 방법에 관한 것으로서, 그 개방형 심리 척도 전문가 플랫폼을 이용한 심리검사 시스템 은 심리척도 전문가들에 의해 개발된 심리척도들이 업로드되고, 심리 검사자들의 요구(Qurey)에 상응하여 상기 저장된 심리척도들이 분류되고 디스플레이되고 선택되도록 사용자 (뒷면에 계속)"}
{"patent_id": "10-2021-0001803", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 심리검사 시스템에 관한 것으로서,강저특히 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스 템에 관한 것이다."}
{"patent_id": "10-2021-0001803", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "심리검사는 현대인의 심리건강을 지원하기 위해 상담 및 코칭에서 광범위하게 사용되고 있다. 심리검사(또는 심 리척도)를 개발하기 위해서는 많은 시간과 비용, 그리고 전문적인 지식과 기술이 필요하다. 그리고 이런 노력과 비용으로 심리검사를 개발하더라도 검사시장에 진입하는 것은 그 보다 더 어려운 실정이다. 심리검사 개발과 상용화에는 다음과 같은 문제점이 있다. 첫째, 심리검사 상용화를 위한 재정적, 기술적, 마케 팅 등에 어려움이 있다. 둘째, 기존 심리검사 연구기관의 관행적인 배타정책으로 심리척도 연구결과물이 제대로 활용되고 있지 못하다. 셋째, 심리검사 시장에서 일부 심리검사 보급 기관의 독점적 점유로 인해 신규 개발된 심리 검사의 시장 진입이 쉽지 않다. 한편, 종래의 심리검사는 대부분 오프라인 응답 방식 또는 온라인 화면 검사로 이루어지고 있다. 그런데, 양방 향 음성 검사는 활성화되어 있지 않다. 이로 인해 종래의 심리검사 방식은 피검자는 손가락만 까닥여서 응답하 는 기계에 불과하고, 심리검사에 능동적인 참여자가 되지 못한다. 즉, 종래의 심리검사는 문자 정보를 직접 입 력하는 방식으로 문항에 단지 수동적으로 응답하는 형식이 주를 이루고 있다. 이로써 기존의 심리검사 방식으로 는 피검자의 심리 상태를 정확히 파악하지 못할 수도 있고, 기존의 심리검사를 통해서는 사전에 미리 정해 놓은 특정 영역의 검사결과만을 단선적으로 제공해주는 제한이 있다. 선행기술문헌특허문헌 (특허문헌 0001) 등록특허공보 제10-0488367호 (2005. 04. 29)"}
{"patent_id": "10-2021-0001803", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 상술한 문제점을 해결하기 위해 창출된 것으로서, 상용화되지 못한 심리척도 들을 활용할 수 있는 심리검사 자동 개발 플랫폼을 구축함으로써, 척도 개발 연구물의 상용화를 위한 재정, 기 술, 마케팅 등의 어려움을 해소하고, 기존 심리척도 연구결과물을 적용한 심리검사분석 서비스를 제공함으로써 사용자 맞춤형 심리척도 조합을 통한 신개념의 심리검사결과분석 서비스를 제공하는, 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템 및 방법을 제공하는 것이다. 본 발명이 해결하고자 하는 다른 과제는 사용자 맞춤형 심리척도 조합을 통한 신개념의 심리검사결과분석 서비 스로서 자연스럽고 생동감 있게 피검자의 심리특성을 보다 정확하게 진단하기 위해, 검사자가 음성으로 질문하 고 피검사자가 음성으로 대답함으로써 피검사자와의 대화 내용을 자동 분석하여 피검자의 다양한 심리 특성, 예 를 들어 피검자의 강점, 성격, 정서 및 인성을 보다 실제적이고 통합적으로 분석할 수 있는, 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템 및 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0001803", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 이루기 위한 본 발명의 일시예에 의한 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템은, 심리척도 전문가들에 의해 개발된 심리척도들이 업로드되고, 심리 검사자들의 요구(Qurey)에 상응하 여 상기 저장된 심리척도들이 분류되고 디스플레이되고 선택되도록 사용자 인터페이스를 제공하는 개방형 심리 척도 전문가 플랫폼 및 상기 업로드된 심리척도들을 저장하는 심리척도 DB를 포함하는 전문가 플랫폼 서버; 상 기 전문가 플랫폼 서버를 통해 선택된 심리척도들로 구성된 심리척도 블록을 이용하여 피검사자 맞춤형 심리검 사블록을 생성하고, 상기 맞춤형 심리검사블록에 접근할 수 있는 온라인 검사 URL을 포함하는 맞춤형 심리검사 정보를 피검사자 단말로 전송하고, 상기 URL을 통해 접속한 피검사자 단말을 통한 심리검사 문항에 대한 답변을 분석하여 검사결과를 생성하는 심리검사 서버; 및 상기 맞춤형 심리검사 정보를 수신하고, 상기 심리검사 정보 에 포함된 온라인 검사 URL을 통해 접속하여 맞춤형 심리검사 블록의 심리검사 항목에 대한 답변을 수행하는 피 검사자 단말을 포함할 수 있다. 상기 심리검사 서버는 상기 전문가 플랫폼 서버로부터 피검사자의 심리검사 목적에 상응하는 심리척도들이 수신 되면, 상기 선택된 심리척도들로 구성된 심리척도 블록을 생성하는 심리척도블록 생성부; 상기 심리척도 블록들 중에서 검사목적에 따른 척도 문항들을 선택하고 편집할 수 있는 문항 선택/편집 사용자 인터페이스를 제공하고, 선택된 문항 및 편집된 문항을 조합하여 피검사자 맞춤형 심리검사 블록을 생성하고, 맞춤형 심리검 사블록에 접속할 수 있는 온라인 검사 URL을 포함한 맞춤형 심리검사 정보를 피검사자 단말로 전송하는 맞춤형 심리검사 생성부; 피검사자 단말이 접속하면, 상기 피검사자 단말에 상응하는 맞춤형 심리검사 블록의 문항들을 피검사자 단말에게 제공하여 심리검사를 수행하는 심리검사 수행부; 및 상기 피검사자 단말을 통해 수행된 심리 검사 답변을 분석하여 심리검사결과를 생성하는 검사결과 생성부를 포함할 수 있다. 상기 맞춤형 심리검사 생성부는 상기 편집 및 조합된 문항들로 구성된 심리척도블록에 대해 문항들을 정제하여 새로운 심리검사 상품을 개발하고, 상기 개발된 맞춤형 심리척도 그룹에 대한 검사이름, 맞춤형 척도블록, 결과 표 규격 및 상기 맞춤형 심리검사블록에 접근할 수 있는 온라인 검사 URL을 포함하는 심리검사 웹을 생성하고, 온라인 검사 URL을 포함하는 심리검사 정보를 피검사자 단말로 전송할 수 있다. 상기 맞춤형 심리검사 생성부는 심리검사를 실시하기 전에 피검사자와의 상담을 통해 피검사자와 대화내용과 음 성을 음성데이터로 수집하는 음성데이터 수집부; 상기 음성데이터 수집부에서 수집된 음성데이터를 분석하여 피 검사자의 강점, 성격유형, 정서 및 인성 정보를 심리배경정보로 생성하는 심리배경정보 생성부; 및 상기 생성된 심리배경정보를 기반으로 하여 심리검사 문항들을 재편집 및 정제하는 사용자 인터페이스를 제공하는 검사문항 편집부를 더 포함할 수 있다. 상기 심리검사 수행부는 심리검사를 수행할 때 심리검사 응답지의 답안 입력을 위한 인터페이스로서, 상담자 또 는 인공지능을 통한 질문과 응답하기를 통해 단문 또는 장문의 음성파일을 텍스트로 변환하여 답안을 입력하는 것일 수 있다. 상기 기술적 과제를 이루기 위한 본 발명의 일시예에 의한 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 방법은, 전문가 플랫폼 서버에 의해 제공되는 개방형 심리척도 전문가 플랫폼을 통해 심리척도 전문가들에 의해 개발된 심리척도들이 업로드 및 저장되는 단계; 개방형 심리척도 전문가 플랫폼에서 제공되는 사용자 인터페이 스를 통해 입력되는 심리 검사자들의 쿼리(Query)에 상응하여 저장된 심리척도들이 분류되고 디스플레이되고, 선택되는 단계; 상기 개방형 심리척도 전문가 플랫폼을 통해 피검사자의 심리검사 목적에 상응하는 심리척도들 이 검색되고 선택되어 상기 선택된 심리척도들이 심리검사 서버로 전송되면, 상기 심리검사 서버는 상기 심리척 도들을 수신하여 심리척도 블록을 생성하는 단계; 문항 선택/편집 사용자 인터페이스를 통해 상기 심리척도 블 록들 중에서 검사목적에 따른 척도 문항들을 선택하고 편집되면 선택된 문항 및 편집된 문항을 조합하여 피검사 자 맞춤형 심리검사 블록을 생성하고, 맞춤형 심리검사블록에 접속할 수 있는 온라인 검사 URL을 포함한 맞춤형 심리검사 정보를 피검사자 단말로 전송하는 단계; 피검사자 단말이 상기 온라인 검사 URL을 통해 심리검사 서버 에 접속하면, 상기 피검사자 단말에 상응하는 맞춤형 심리검사 블록의 문항들을 피검사자 단말에게 제공하여 심 리검사를 수행하는 단계; 및 상기 피검사자 단말을 통해 수행된 심리검사 답변을 분석하여 심리검사결과를 생성 하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0001803", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템 및 방법에 의하면, 전문가에 의해 개 발되었지만 활용되지 못하고 있는 기존의 수많은 심리척도를 활용할 수 있다. 그리고 본 발명에 의하면, 심리척도 개발 전문가는 저비용으로 개발된 심리척도를 온라인 심리검사 서비스를 통 해 상용화할 수 있다. 또한 본 발명에 의하면, 심리 검사자는 심리 척도 개발 전문가들에 의해 개발된 유용한 심리척도들을 데이터 베 이스로 구축하고 활용함으로써, 피검사자의 상황이나 상태에 적합한 심리검사를 맞춤형으로 제공할 수 있고, 피 검사자는 맞춤형 심리검사를 통해 양질의 심리검사 서비스를 받을 수 있다. 또한 본 발명에 의하면, 사용자 맞춤형 심리척도 조합을 통한 신개념의 심리검사결과분석 서비스에서 음성으로 질문하고 음성으로 대답함으로써 내담자와의 대화 내용을 자동 분석하여 피검자의 다양한 심리 특성, 예를 들어 피검자의 강점, 성격유형, 정서, 인성을 보다 실제적이고 통합적으로 분석할 수 있고, 자연스럽고 생동감 있게 피검사자의 심리 상태와 특성을 보다 정확하게 진단하고 분석할 수 있다."}
{"patent_id": "10-2021-0001803", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조로 본 발명의 바람직한 실시예를 상세히 설명하기로 한다. 본 명세서에 기재된 실시예 와 도면에 도시된 구성은 본 발명의 바람직한 일 실시예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 대변 하는 것은 아니므로, 본 출원 시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형예들이 있을 수 있음 을 이해하여야 한다.도 1은 본 발명에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템의 구성에 대한 일실시예를 블 록도로 나타낸 것이다. 도 1을 참조하면, 본 발명에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템은 전문가 플랫폼 서버, 심리검사 서버 및 피검사자 단말을 포함하여 이루어진다. 전문가 플랫폼 서버는 개방형 심리척도 전문가 플랫폼 및 심리척도 DB를 포함한다. 개방형 심리 척도 전문가 플랫폼은 심리척도 전문가들에 의해 개발된 심리척도들이 업로드되고, 심리 검사자들의 요구 (Qurey)에 상응하여 상기 저장된 심리척도들이 분류되고 디스플레이되고 선택되도록 사용자 인터페이스를 제공 한다. 전문가 단말(102, 104)은 개방형 전문가 플랫폼 서버에 접속하여 심리척도 전문가 플랫폼에 이 미 연구개발된 심리척도들, 예를 들어 학습태도 척도, 대인관계 척도, 의사소통 척도, 학습사고유형 척도, 자아 존중감 척도, 우울 척도, 진로유형 척도, 진로성숙도 척도 등을 업로드할 수 있다. 심리검사자는 검사자 단말 을 통해 개방형 전문가 플랫폼 서버에 접속하여 심리척도 전문가 플랫폼을 통해 제공되는 사용 자 인터페이스를 통해 심리척도들을 검색하고 검색결과 중 심리검사 목적에 관련된 심리척도들을 선택할 수 있 다. 심리척도 DB는 심리척도 전문가들에 의해 개발된 심리척도들이 업로드되면, 상기 업로드된 심리척도들 을 저장 및 관리한다. 그리고 심리척도 DB는 검사자 단말의 쿼리를 받아들여 쿼리에 상응하는 척도들 을 분류하고 디스플레이 할 수 있다. 심리검사 서버는 전문가 플랫폼 서버를 통해 선택된 심리척도들로 구성된 심리척도 블록을 이용하여 피검사자 맞춤형 심리검사블록을 생성하고, 상기 맞춤형 심리검사블록에 접근할 수 있는 온라인 검사 URL을 포 함하는 맞춤형 심리검사 정보를 피검사자 단말로 전송하고, 상기 URL을 통해 접속한 피검사자 단말을 통한 심리검사 문항에 대한 답변을 분석하여 검사결과를 생성한다. 심리검사 서버는 심리척도블록 생성부, 맞춤형 심리검사 생성부, 심리검사 수행부 및 검사 결과 생성부을 포함하여 이루어진다. 심리척도블록 생성부는 전문가 플랫폼 서버로부터 피검사자의 심리검사 목적에 상응하는 심리척도들 이 수신되면, 상기 선택된 심리척도들로 구성된 심리척도 블록을 생성한다. 맞춤형 심리검사 생성부는 상기 심리척도 블록들 중에서 검사목적에 따른 척도 문항들을 선택하고 편집할 수 있는 문항 선택/편집 사용자 인터페이스를 제공하는 편집/정제부, 선택된 문항 및 편집된 문항을 조합 하여 피검사자 맞춤형 심리검사 블록을 생성하고, 맞춤형 심리검사블록에 접속할 수 있는 온라인 검사 URL을 생 성하여 제공하는 심리검사 웹 생성부, 및 상기 온라인 검사 URL을 포함한 맞춤형 심리검사 정보를 피검사 자 단말로 전송하는 심리검사 정보 전송부을 포함한다. 맞춤형 심리검사 생성부는 상기 편집 및 조합된 문항들로 구성된 심리척도블록에 대해 문항들을 정제하여 새로운 심리검사 상품을 개발할 수 있다. 이 때, 편집/정제부는 심리검사를 실시하기 전에 피검사자와의 상담을 통해 수집된 피검사자와 대화내용과 음성을 분석하여 피검사자의 강점, 성격유형, 정서, 인성 등을 파악 하고, 파악된 피검사자의 강점, 성격유형, 정서, 인성 등을 반영하여 문항들을 재편집 및 정제할 수 있다. 예를 들어, 피검사자(내담자)의 음성신호를 주파수, 파형, 소리의 크기 등으로 구분하여 분석하며, 빅데이터 기반으 로 피검사자의 강점, 성격유형, 정서, 인성을 객관화할 수 있다. 또한 화상 대면 방식으로 상담을 할 경우에는 내담자의 표정변화 눈동자의 움직임들을 관찰하여 빅데이터를 기반으로 내담자의 강점, 성격유형, 정서, 인성을 객관화할 수도 있다. 이렇게 함으로써, 심리검사 문항을 보다 정확하게 재편집할 수 있고 정제할 수 있다. 이를 위해 맞춤형 심리검사 생성부의 편집/정제부는 음성데이터 수집부, 심리배경정보 생성부 및 검사문항편집부를 더 포함할 수 있다. 음성데이터 수집부는 심리검사를 실시하기 전에 피검사자와의 상담을 통해 피검사자와 대화내용과 음성을 음성데이터로 수집한다. 심리배경정보 생성부는 상기 음성데이터 수집부에서 수집된 음성데이터를 분석하 여 피검사자의 강점, 성격유형, 정서 및 인성 정보를 심리배경정보로 생성한다. 검사문항편집부는 상기 생 성된 심리배경정보를 기초로 심리검사 문항들을 재편집 및 정제하는 사용자 인터페이스를 제공한다. 그리고 심리검사 웹 생성부는 개발된 맞춤형 심리척도 그룹에 대한 검사이름, 맞춤형 척도블록, 결과표 규 격 및 상기 맞춤형 심리검사블록에 접근할 수 있는 온라인 검사 URL을 포함하는 심리검사 웹을 생성할 수 있다. 심리검사 수행부는 피검사자 단말이 접속하면, 피검사자 단말에 상응하는 맞춤형 심리검사 블록 의 문항들을 피검사자 단말에게 제공하여 심리검사를 수행한다. 검사결과 생성부는 피검사자 단말을 통해 수행된 심리검사 답변을 분석하여 심리검사결과를 생성한다. 피검사자 단말은 상기 맞춤형 심리검사 정보를 수신하고, 상기 심리검사 정보에 포함된 온라인 검사 URL을 통해 접속하여 맞춤형 심리검사 블록의 심리검사 항목에 대한 답변을 수행한다. 도 4는 본 발명의 일 실시예에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템의 일 예를 나타 낸 것이다. 도 4를 참조하면 심리척도 DB에는 24개의 심리척도들이 있고, 이 중에서 척도 2, 척도 5, 척도 7, 척도 11, 척도 21이 선택 및 조합되어 심리척도블록 생성부는 심리척도 블록을 생성할 수 있다. 심리척 도 블록이 생성되면, 맞춤형 심리검사 생성부를 통해 맞춤형 심리검사가 생성되고 이를 피검사 단말에게 온라인 검사 URL을 전달하고, 피검사자 단말은 URL을 통해 심리검사 서버에 접속하여 맞춤형 심리검 사 웹을 통해 맞춤형 심리검사를 수행할 수 있다. 검사결과 생성부를 통해 검사결과는 PDF 파일이나 엑셀 데이터 또는 소견서로 생성되고 피검사자 단말에게 전송될 수 있다. 도 5는 본 발명의 일 실시예에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 방법을 흐름도로 나타낸 것이다. 도 1 및 도 3을 참조하여, 본 발명의 일 실시예에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리 검사 방법을 설명하기로 한다. 전문가 플랫폼 서버에 의해 제공되는 개방형 심리척도 전문가 플랫폼을 통해 심리척도 전문가들에 의 해 개발된 심리척도들이 업로드 및 저장된다(S510단계). 개방형 심리척도 전문가 플랫폼에서 제공되는 사용자 인터페이스를 통해 입력되는 심리 검사자들의 쿼리 (Query)에 상응하여 저장된 심리척도들이 분류되고 디스플레이되고, 선택된다(S520단계). 개방형 심리척도 전문가 플랫폼를 통해 피검사자의 심리검사 목적에 상응하는 심리척도들이 검색되고 선택 되어 상기 선택된 심리척도들이 심리검사 서버로 전송되면, 심리검사 서버는 상기 심리척도들을 수신 하여 심리척도 블록을 생성한다(S530단계). 문항 선택/편집 사용자 인터페이스를 통해 상기 심리척도 블록들 중에서 검사목적에 따른 척도 문항들을 선택하 고 편집되면 선택된 문항 및 편집된 문항을 조합하여 피검사자 맞춤형 심리검사 블록을 생성하고, 맞춤형 심리 검사블록에 접속할 수 있는 온라인 검사 URL을 포함한 맞춤형 심리검사 정보를 피검사자 단말로 전송한다 (S540단계). 피검사 단말이 상기 온라인 검사 URL을 통해 심리검사 서버에 접속하면, 상기 피검사자 단말에 상응하는 맞춤형 심리검사 블록의 문항들을 피검사자 단말에 제공하여 심리검사를 수행한다(S550단계). 피검사자 단말을 통해 수행된 심리검사 답변을 분석하여 심리검사결과를 생성한다(S560단계). 도 6은 본 발명의 일 실시예에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 방법의 일 예를 나타낸 것이다. 도 1 내지 도 4를 참조하면, 심리척도 전문가 또는 심리척도 연구개발자들이 전문가 단말(102, 104)을 통해 개방형(open) 심리척도 전문가 플랫폼에 이미 연구개발된 심리척도들, 예를 들어 학습태도 척도, 대 인관계 척도, 의사소통 척도, 학습사고유형 척도, 자아존중감 척도, 우울 척도, 진로유형 척도, 진로성숙도 척 도 등을 업로드할 수 있다. 즉, 오픈 플랫폼을 통해 다양한 심리검사 척도들이 등재되고 목록화될 수 있다 . 심리척도블록 생성부는 피검사자의 상황을 고려하여 검사 목적에 따른 척도를 검사자 단말을 통해 선 택하고 조합함으로써 심리척도블록을 생성할 수 있다. 예를 들어, 척도 개발 목록에서 학습태도 척도, 대인관계 척도, 의사소통 척도, 진로유형 척도, 진로성숙도 척도를 선택하고 조합할 수 있다. 이 때 맞춤형 심리검사 생성부는 검사 목적에 따른 척도 문항을 선정하고 재편집할 수 있고 조합하여 맞춤 형 심리검사를 생성할 수 있다. 이렇게 조합이 되면, 심리검사 수행부는 조합된 심리척도들로 구성된 NEW 심리 검사를 구성하여 심리검사를 실시할 수 있다. 예를 들어, 재편집, 조합된 문항들을 정제하여 새로운 검사 상품을 개발하여 NEW 학습진로역량검사를 수행할 수 있다. 심리검사가 실시되면 검사결과 생성부은 결과분석 보고서를 생성하여 피검사자 단말로 제공할 수 있 다. 즉 NEW 학습진로 역량검사 분석 보고서를 제공하고 이를 이용하여 사후 서비스를 제공하고 상담 및 코 칭을 연계할 수 있다. 한편, 심리검사 수행부에서 심리검사를 수행할 때, 심리검사 응답지의 답안을 입력하는 방식에는 두 가지 가 있을 수 있다.첫번째는 심리검사 결과 출력을 위해 응답자의 음성을 텍스트 파일로 전환하여 답안을 입력하는 방식이고, 두번 째는 심리검사 결과 출력을 위해 응답지를 사진으로 촬영하고 전송하여 답안을 입력하는 방식이다. 첫번째 방식인 음성을 텍스트 파일로 전환하여 입력하는 방식은 화면에 나타난 심리검사 문항에 대해 음성으로 예, 아니오 혹은 1번, 2번 같은 음성을 텍스트 파일로 전환하여 답안을 입력하거나, 전문가와 1대1 대화 형식으 로 단문 또는 장문으로 응답하면서 음성을 자동으로 텍스트 파일로 전환하여 답안을 입력하거나, 인공지능을 통 한 질문과 응답하기를 통해 단문 또는 장문의 음성파일을 텍스트로 변환하여 답안을 입력할 수 있다. 두번째 방식인 응답지를 사진으로 촬영하여 답안을 입력하는 방식은 응답된 심리검사 응답지를 스마트폰으로 촬 영(스캔)하여 답안지를 전송하고, 전송된 이미지 파일을 텍스트 파일로 전환하여 답안을 입력할 수 있다. 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다. 산업상 이용가능성 본 발명은 심리검사 시스템에 이용될 수 있다."}
{"patent_id": "10-2021-0001803", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템의 구성에 대한 일실시예를 블 록도로 나타낸 것이다. 도 2는 맞춤형 심리 검사 생성부의 세부 구성의 일 예를 블록도로 나타낸 것이다. 도 3은 편집/정제부의 세부 구성의 일 예를 블록도로 나타낸 것이다. 도 4는 본 발명의 일 실시예에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 시스템의 일 예를 나타 낸 것이다. 도 5는 본 발명의 일 실시예에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 방법을 흐름도로 나타낸 것이다. 도 6은 본 발명의 일 실시예에 따른 개방형 심리척도 전문가 플랫폼을 이용한 심리검사 방법의 일 예를 나타낸 것이다."}
