{"patent_id": "10-2022-0042378", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0000948", "출원번호": "10-2022-0042378", "발명의 명칭": "탐색물질의 분포 내지 탐색물질의 생리활성과 관련이 있는 조직 내 분자적 마커 또는 생리활", "출원인": "주식회사 포트래이", "발명자": "임형준"}}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "탐색을 위한 표지물질이 결합된 탐색물질을 관심 조직에 제공하여 표지물질에 의한 조직 영상을 얻고,상기 관심 조직의 공간 정보를 공유하는 전사체 정보를 얻고, 상기 탐색물질의 표지물질에 의한 조직 영상을 상기 공간 전사체 정보와 공간 맵핑시켜 공간 맵핑 정보를 얻고,상기 공간 맵핑된 정보로부터 상기 표지물질이 결합된 탐색물질의 분포와 관련이 있는 조직 내 전사체 정보를추출하고,상기 추출을 통해 상기 탐색물질의 상기 관심 조직 내 분포와 관련있는 분자적 마커를 탐색하는 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 탐색물질의 관심 조직에의 제공은 탐색물질을 관심 조직에 직접 제공하거나, 전신 투여로대상체에게 투여한 후 관심 조직에 분포되는 것을 포함하는, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 조직 내 전사체 정보 추출은 인공지능을 이용한 영상 특성 추출 알고리즘, 표지물질의 조직내 영상 강도와 유전자 발현 정도의 상관성 분석, 세포 유형 분석 알고리즘, 및/또는 유전자 온톨로지 분석을이용하여 추출하는 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 인공지능을 이용한 영상 특성 추출 알고리즘은 SPADE((Spatial gene expressionpatterns by deep learning of tissue images) 알고리즘인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 표지물질의 조직내 영상 강도와 유전자 발현 정도의 상관성 분석은 DEG(Differentiallyexpressed genes), 상관계수의 계산에 의한 상관성 분석 또는 이미지 유사도 평가 알고리즘을 이용하는 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 상관계수 계산이 피어슨 상관계수, 스피어만 상관계수, 또는 켄달 상관계수 계산인, 탐색방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서, 상기 세포 유형 분석 알고리즘은 Fisher의 정확검정, 최대 가능성평가(maximum likelihoodestimation), 도메인적응분류, 로지스틱 회귀분석 또는 음이항 회귀분석 알고리즘인 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 세포 유형 분석 알고리즘이 MIA, CellDART 알고리즘, RCTD 알고리즘, celltypist 또는cell2location인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 공간 맵핑된 정보는 1개 이상의 클러스터의 공간 맵핑된 정보를 포함하는, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2023-0000948-3-제9항에 있어서, 상기 1개 이상의 클러스터는 상기 표지물질에 의한 영상 강도에 의해 분류되거나, 상기 탐색물질의 표지물질에 의한 조직 영상을 복수개의 패치들로 분할하고 상기 각 패치에 대한 영상 특징의 유사성에 의해 분류하는 알고리즘에 의해 분류된 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 클러스터의 공간 맵핑된 정보는, 개별 클러스터의 영상 특성 추출 알고리즘, 클러스터의영상 강도와 유전자 발현 정도의 상관성 분석, 세포 유형 분석 알고리즘, 및/또는 유전자 온톨로지 분석을 이용하여 얻어진 정보인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 내지 제11항 중 어느 하나의 항에 있어서, 상기 공간 맵핑에 있어 표지물질에 의한 조직 영상을, 평행이동변환, 회전변환, 또는 위상기하학적 변환시키는 알고리즘에 적용하여 얻어진 정합 영상을 사용하는 탐색방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 정합 영상은 Python계 오픈-소스 DiPY 패키지에 의해 제공되는 알고리즘 또는 ImageJ에서 bUnwarpJ 모듈 사용에 의해 얻어진 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 정합 영상을 추가 변환시켜, 공간 맵핑이 효과적으로 이뤄지게 하는 변환 영상을 사용하는, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 변환 영상이 영상 신호를 영상 강도에 따라 불연속적으로 변환시킨 영상인 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항 내지 제11항 중 어느 하나의 항에 있어서, 상기 공간 맵핑에 있어 공간 전사체 정보는 유전자 특징에 따른 스팟을 시각화하는 프로그램을 이용하거나 특정 개수 미만의 RNA 리드를 갖는 스팟을 제외시킨 것인, 탐색방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항 내지 제11항 중 어느 하나의 항에 있어서, 상기 관심 조직을 염색하고 염색된 조직 영상을 얻는 단계를추가로 포함하는, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항 내지 제11항 중 어느 하나의 항에 있어서, 상기 공간 맵핑은 2차원 평면으로 배치된 공간 전사체 정보의스팟의 좌표와 이에 상응하는 2차원 평면으로 배치된 탐색물질의 표지물질에 의한 조직 영상 내 픽셀의 좌표를공간적으로 일치시키는 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항 내지 제11항 중 어느 하나의 항에 있어서, 상기 공간 전사체 정보는 관심조직 내 공간 좌표를 갖는 스팟(spot) 내 전사체 RNA 리드(read)의 개수 및 RNA 종류인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제1항 내지 제11항 중 어느 하나의 항에 있어서, 상기 탐색을 위한 표지물질은 방사성 물질, 형광성 물질, 색소물질, 또는 발광성 물질인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제1항 내지 제11항 중 어느 하나의 항에 있어서, 상기 분자적 마커는, DNA, RNA, 대사물질, 단백질, 단백질 단공개특허 10-2023-0000948-4-편 등에서 유래된 단일 분자, 또는 이들의 패턴을 근거로 한 분자적 정보인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제1항 내지 제11항 중 어느 하나의 항에 있어서, 상기 탐색물질은 나노 물질, 저분자 화합물, 고분자 화합물,천연물, 압타머, 나노바디, 미생물, 항체, 엔지니어링 항체, 항체약물접합체, 세포외 소포체, 세포, 펩타이드,핵산, 단백질, 아미노산, 당, 지질, 바이오 의약품 또는 바이오 후보물질, 합성화학 의약품 또는 합성화학 후보물질, 및 천연물 의약품 또는 천연물 후보물질로 이루어진 군으로부터 선택된 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 나노 물질이, 고분자 나노입자, 지질 기반 나노입자, 고분자 이중층 구조 나노입자, 단백질 나노입자, 무기 나노입자 또는 결정성 나노입자이고, 상기 바이오 의약품 또는 바이오 후보 물질이 생물학적 제제, 유전자재조합 의약품, 세포배양 의약품, 동등생물의약품, 개량생물의약품, 첨단바이오 의약품 또는 그후보물질인, 탐색 방법,"}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "탐색을 위한 제1 표지물질이 결합된 제1 탐색물질을 관심 조직에 제공하여 상기 표지물질에 의한 조직 영상을얻고, 상기 얻어진 조직의 영상을, 상기 조직의 공간 전사체 정보와 공간 맵핑시키는 것을 포함하는, 제1 탐색물질의분포 내지 작용과 관련이 있는 관심 조직 내 생리활성 정보를 탐색하는 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서, 상기 제1 탐색물질의 관심 조직에의 제공은 탐색물질을 관심 조직에 직접 제공하거나, 전신투여에 의해 대상체에게 투여된 후 관심 조직에 분포되는 것을 포함하는, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제24항에 있어서, 상기 관심 조직 내 생리활성 정보는 생체의 기능 또는 생리에 영향을 미치는 물질에 대한 정보인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제24항에 있어서, 제2 표지물질이 결합된 제2 탐색물질의 상기 표지물질에 의한 관심 조직의 영상을, 상기 관심조직의 공간 전사체 정보와 공간 맵핑시켜 공간 맵핑 정보를 얻는 것을 추가로 포함하는, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제27항에 있어서, 상기 제2 탐색물질의 공간 맵핑 정보와 비교 및 분석하여 상기 제1 탐색물질의 생리활성 정보를 탐색하는 것을 포함하는, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제24항 내지 제28항 중 어느 하나의 항에 있어서, 상기 제1 탐색물질 또는 제2 탐색물질은 각각 나노 물질, 저분자 화합물, 고분자 화합물, 천연물, 압타머, 나노바디, 미생물, 항체, 엔지니어링 항체, 항체약물접합체, 세포외 소포체, 세포, 펩타이드, 핵산, 단백질, 아미노산, 당, 지질, 바이오 의약품 또는 바이오 후보물질, 합성화학 의약품 또는 합성화학 후보물질, 및 천연물 의약품 또는 천연물 후보물질로 이루어진 군으로부터 독립적으로 선택된 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "탐색을 위한 표지물질이 결합된 탐색물질을 관심 조직에 제공하여 표지물질에 의한 조직 영상을 얻고,상기 탐색물질의 표지물질에 의한 조직 영상을, 상기 관심 조직의 공간 전사체 정보와 공간 맵핑시켜 공간 맵핑정보를 얻되,여기서 상기 공간 맵핑 정보는 1개 이상의 클러스터의 공간 맵핑된 정보를 포함하며,공개특허 10-2023-0000948-5-각 클러스터의 공간 맵핑된 정보로부터 해당 클러스터의 전사체 정보를 추출하는 것을 포함하는,탐색물질의 관심 조직 내 생리활성 정보를 탐색하는 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제30항에 있어서, 상기 탐색물질의 관심 조직에의 제공은 탐색물질을 관심 조직에 직접 제공하거나, 전신 투여에 의해 대상체에게 투여된 후 관심 조직에 분포되는 것을 포함하는, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제30항에 있어서, 상기 1개 이상의 클러스터는 상기 표지물질에 의한 영상 강도에 의해 분류되거나, 상기 탐색물질의 표지물질에 의한 영상을 복수개의 패치들로 분할하고 상기 각 패치에 대한 영상 특징의 유사성에 의해분류된 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제32항에 있어서, 각 패치에 대한 영상 특징의 유사성에 의한 분류는 K-means clustering, unsupervisedhierarchical clustering, stochastic neighbor embedding, agglomerative clustering, spectral clustering,또는 Gaussian mixture의 클러스터링 알고리즘에 의한 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제30항 내지 제33항 중 어느 하나의 항에 있어서, 해당 클러스터의 전사체 정보는, 클러스터의 영상 특성 추출알고리즘, 클러스터의 영상 강도와 유전자 발현 정도의 상관성 분석, 세포 유형 분석 알고리즘, 및/또는 유전자온톨로지 분석을 이용하여 얻어진 것인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제30항 내지 제33항 중 어느 하나의 항에 있어서, 상기 관심 조직 내 생리활성 정보는 상기 탐색물질의 분포 또는 작용에 영향을 미치는, 화합물, DNA, RNA, 대사물질, 단백질, 단백질 단편 등에서 유래된 단일 분자, 이들의패턴을 근거로 한 분자적 정보, 또는 생체의 기능 또는 생리에 영향을 미치는 물질에 대한 정보인, 탐색 방법."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 탐색물질의 분포 또는 생리활성과 관련이 있는 조직 내 분자적 마커 또는 생리활성 정보를 탐색하는 방법에 대한 것이다."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 탐색물질의 분포 또는 탐색물질의 생리활성과 관련이 있는 조직 내 분자적 마커 또는 생리활성 정보 를 탐색하는 방법에 대한 것이다."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "나노 물질 및 저분자 화합물, 펩타이드, 세포, 항체 또는 재조합 항체 등의 약물의 분포 내지 생리 활성 관련 물질을 추정하기 위해 혈액 기반의 시뮬레이션 또는 약제에 형광물질과 같은 표지물질을 표지하여 약물의 생물 학적 분포 내지 생리 활성을 추정하고, 약제의 효과와 동역학을 추정하는 것은 신약 개발 과정에서 필수적이다. 하지만, 기존의 혈액 기반, 또는 체내 영상 기반의 약제 동역학 추정 기술은 전체 장기 수준에서의 분포를 추정 할 수 있으나, 장기 내의 불균일한 분포 등을 평가할 수 없다. 이는 정상 장기가 서로 다른 기능을 수행하는 매 우 이질적인 세포들로 이루어져 있기 때문이다. 또한 암조직 역시 암 세포 분열과정에서 나타나는 암세포 간 유전적 이질성, 그리고 조직 내에 존재하는 혈관, 면역 세포 등으로 인하여 나타나는 미세 환경의 이질성 때문 에 매우 이질적인 세포들로 구성되어 있다. 이러한 조직의 불균일성으로 인해 약제들은 조직 내에서 매우 불균 일한 흡수를 보이게 된다. 현미경적 수준에서의 분포와 이와 관련된 분자를 스크리닝하여 약물의 작용을 예측하고 분자 타겟 수준에서 분 포를 예측하는 것은 신약 개발의 최종적 성공을 예측하는 지표로 활용될 수 있으나 아직까지 약물이 조직 내에 분포하는 것이 어떠한 세포 또는 어떠한 분자 프로파일에 따라 분포하는 것인지를 해석할 수 있는 방법은 정립되어 있지 않다. 나아가 약물의 조직 내 분포에 대한 정보는 약물의 생리 작용과도 관련이 있다. 최근 개발되어 활용되는 공간 전사체 기술(Spatially Resolved Transcriptome)은 한번에 수백에서 수만가지의 유전자 발현 정보를 획득하되, 조직 위치 정보를 보존하면서 유전자 발현 정보의 획득이 가능하다. 하지만 이러한 공간 전사체 기술을 활용하여 조직 내 약물 분포와 관련한 분자적 마커 또는 생리활성 정보를 탐 색하는 것은 아직 미비한 수준이다. 선행기술문헌 특허문헌 비특허문헌 (비특허문헌 0001) Nat Rev Drug Discov. 2016 Dec;15:817-818. (비특허문헌 0002) Sindhwani, S., Syed, A. M., Ngai, J., Kingston, B. R., Maiorino, L., Rothschild, J., ... & Chan, W. C. . The entry of nanoparticles into solid tumours. Nature materials, 19, 566-575. (비특허문헌 0003) Chen, F., Ma, K., Madajewski, B., Zhuang, L., Zhang, L., Rickert, K., ... & Bradbury, M. S. . Ultrasmall targeted nanoparticles with engineered antibody fragments for imaging detection of HER2-overexpressing breast cancer. Nature communications, 9, 1-11. (비특허문헌 0004) Bolkestein, M., de Blois, E., Koelewijn, S. J., Eggermont, A. M., Grosveld, F., de Jong, M., & Koning, G. A. . Investigation of factors determining the enhanced permeability and retention effect in subcutaneous xenografts. Journal of nuclear medicine, 57, 601-607. (비특허문헌 0005) Fick, A. . \"V. On liquid diffusion\". Phil. Mag. 10 : 30-39. doi:10.1080/14786445508641925 (비특허문헌 0006) R.B. Bird, W.E. Stewart, E.N. Lightfoot. . Transport Phenomena 2nd edition. Wiley. (비특허문헌 0007) Sindhwani, S., Syed, A. M., Ngai, J., Kingston, B. R., Maiorino, L., Rothschild, J., ... & Chan, W. C. . The entry of nanoparticles into solid tumours. Nature materials, 19, 566-575. (비특허문헌 0008) Bae, S., Choi, H., & Lee, D. S. . Discovery of molecular features underlying the morphological landscape by integrating spatial transcriptomic data with deep features of tissue images. Nucleic acids research, 49, e55-e55. (비특허문헌 0009) Sebastian, A., Hum, N. R., Martin, K. A., Gilmore, S. F., Peran, I., Byers, S. W., ... & Loots, G. G. . Single-cell Transcriptomic analysis of tumor-derived fibroblasts and Normal tissue-resident fibroblasts reveals fibroblast heterogeneity in breast Cancer. Cancers, 12, 1307. (비특허문헌 0010) Cable, D. M., Murray, E., Zou, L. S., Goeva, A., Macosko, E. Z., Chen, F., & Irizarry, R. A. . Robust decomposition of cell type mixtures in spatial transcriptomics. Nature Biotechnology, 1-10. (비특허문헌 0011) https://www.biorxiv.org/content/10.1101/2021.04.26.441459v1 (비특허문헌 0012) Zhou, Y., & Luo, G. . Apolipoproteins, as the carrier proteins for lipids, are involved in the development of breast cancer. Clinical and Translational Oncology, 1-11. (비특허문헌 0013) Alfarouk, K. O. . Tumor metabolism, cancer cell transporters, andmicroenvironmental resistance. Journal of enzyme inhibition and medicinal chemistry, 31, 859-866. (비특허문헌 0014) Wang, Z., Bovik, A. C., Sheikh, H. R., & Simoncelli, E. P. . Image quality assessment: from error visibility to structural similarity. IEEE transactions on image processing, 13, 600-612. (비특허문헌 0015) Brownlee, W. J., & Seib, F. P. . Impact of the hypoxic phenotype on the uptake and efflux of nanoparticles by human breast cancer cells. Scientific reports, 8, 1-11. (비특허문헌 0016) Zhang, I., Cui, Y., Amiri, A., Ding, Y., Campbell, R. E., & Maysinger, D. . Pharmacological inhibition of lipid droplet formation enhances the effectiveness of curcumin in glioblastoma. European Journal of Pharmaceutics and Biopharmaceutics, 100, 66-76. (비특허문헌 0017) Fujimoto, T., & Parton, R. G. . Not just fat: the structure and function of the lipid droplet. Cold Spring Harbor perspectives in biology, 3, a004838. (비특허문헌 0018) Cruz, A. L., Barreto, E. D. A., Fazolini, N. P., Viola, J. P., & Bozza, P. T. . Lipid droplets: platforms with multiple functions in cancer hallmarks. Cell death & disease, 11, 1-16. (비특허문헌 0019) Li, R., Ng, T. S., Wang, S. J., Prytyskach, M., Rodell, C. B., Mikula, H., .. & Miller, M. A. . Therapeutically reprogrammed nutrient signalling enhances nanoparticulate albumin bound drug uptake and efficacy in KRAS-mutant cancer. Nature Nanotechnology, 1-10. (비특허문헌 0020) Yokoi K, Kojic M, Milosevic M, Tanei T, Ferrari M, Ziemys A. Capillary-Wall Collagen as a Biophysical Marker of Nanotherapeutic Permeability into the Tumor Microenvironment. 2014, 74: 4239-4246. (비특허문헌 0021) Moncada R, Barkley D, Wagner F, Chiodin M, Devlin JC, Baron M, et al. Integrating microarray-based spatial transcriptomics and single-cell RNA-seq reveals tissue architecture in pancreatic ductal adenocarcinomas. Nat Biotechnol 2020, 38: 333-342. (비특허문헌 0022) Bae S, Na KJ, Koh J, Lee DS, Choi H, Kim YT. CellDART: Cell type inference by domain adaptation of single-cell and spatial transcriptomic data. bioRxiv 2021: 2021.2004.2026.441- 459. (비특허문헌 0023) Castellano J, Aledo R, Sendra J, Costales P, Juan-Babot O, Badimon L, et al. Hypoxia stimulates low-density lipoprotein receptor-related protein-1 expression through hypoxia- inducible factor-1α in human vascular smooth muscle cells. Arteriosclerosis, thrombosis, and vascular biology 2011, 31: 1411-1420. (비특허문헌 0024) Perman JC, Bostrφm P, Lindbom M, Lidberg U, Sthlman M, Hδgg D, et al. The VLDL receptor promotes lipotoxicity and increases mortality in mice following an acute myocardial infarction. The Journal of clinical investigation 2011, 121: 2625-2640"}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위한 것으로, 공간 정보를 공유하는 전사체 정보를 활용하여 탐색물질의 조직 내 분포 또는 생리활성과 관련이 있는 분자적 마커 또는 생리활성 정보를 탐색하고자 한다. 또한, 약물에 대한 조직 내 현미경적 수준의 분포 또는 생리활성 정보로부터 이의 작용 메카니즘, 약물의 상승 내지 억제 작용 등에 대한 정보를 제공하고 약물의 가치의 재발견 혹은 과학적 또는 합리적 약물 개발 플랫폼을 제공하고자 한다."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 양태는, 탐색을 위한 표지물질이 결합된 탐색물질을 관심 조직에 제공하여 표지물질에 의한 조직 영상을 얻고, 상기 관심 조직의 공간 정보를 공유하는 전사체 정보를 얻고, 상기 탐색물질의 표지물질에 의한 조직 영상을 상기 공간 전사체 정보와 공간 맵핑시켜 공간 맵핑 정보를 얻고, 상기 공간 맵핑된 정보로부터 상기 표지물질이 결합된 탐색물질의 분포와 관련이 있는 조직 내 전사체 정보를 추출하고, 상기 추출을 통해 상기 탐색물질의 상기 관심 조직 내 분포와 관련있는 분자적 마커를 탐색하는 방법에 대한 것 이다. 본 발명의 다른 일 양태는, 탐색을 위한 제1 표지물질이 결합된 제1 탐색물질을 관심 조직에 제공하여 상기 표지물질에 의한 조직 영상을 얻고, 상기 얻어진 조직의 영상을, 상기 조직의 공간 전사체 정보와 공간 맵핑시키는 것을 포함하는, 제1 탐색물질의 분포 내지 작용과 관련이 있는 관심 조직 내 생리활성 정보를 탐색하는 방법에 대한 것이다. 본 발명의 또 다른 일 양태는, 탐색을 위한 표지물질이 결합된 탐색물질을 관심 조직에 제공하여 표지물질에 의한 조직 영상을 얻고, 상기 탐색물질의 표지물질에 의한 조직 영상을, 상기 관심 조직의 공간 전사체 정보와 공간 맵핑시켜 공간 맵핑 정보를 얻되, 여기서 상기 공간 맵핑 정보는 1개 이상의 클러스터의 공간 맵핑된 정보를 포함하며, 각 클러스터의 공간 맵핑된 정보로부터 각 클러스터의 전사체 정보를 추출하는 것을 포함하는, 탐색물질의 관심 조직 내 생리활성 정보를 탐색하는 방법에 대한 것이다."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 탐색 방법을 이용하면 기존의 혈액 기반 또는 체내 영상 기반의 약물 장기 내 분포 내지 작용 분석으 로부터 알 수 없었던 조직 내 분포 내지 생리활성 정보를 알 수 있다. 본 발명의 탐색 방법은 기존에 사용가능한 공간 전사체학 분석 방법과 분석 알고리즘에 기반하여 여러 연구 개 발 단계에 다양하게 활용될 수 있으며, 바이오마커 발굴, 신약 개발 등에 효과적으로 이용될 수 있다. 본 발명의 탐색 방법을 이용하여 약물의 표적을 저해 또는 증진하는 조직 내 분자적 마커 등을 확인하거나 개발 또는 알려진 약물의 표적을 최적화하는 데 활용될 수 있다. 본 발명의 탐색 방법은, 약물의 불균일한 분포를 설명할 수 있는 분자적 마커를 제공할 수 있다. 본 발명의 탐색 방법은 신약 개발 과정에서 또는 기존 약물 기전을 분석하여 효과를 예측하거나 효과를 증진시 키거나 효과가 있을 대상을 탐색하는 데 활용될 수 있다."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 일 양태는, 탐색을 위한 표지물질이 결합된 탐색물질을 관심 조직에 제공하여 표지물질에 의한 조직 영상을 얻고(S10), 상기 관심 조직의 공간 정보를 공유하는 전사체 정보를 얻고(S20), 상기 탐색물질의 표지물질에 의한 조직 영상을 상기 공간 전사체 정보와 공간 맵핑시켜 공간 맵핑 정보를 얻고 (S30), 상기 공간 맵핑된 정보로부터 상기 표지물질이 결합된 탐색물질의 분포와 관련이 있는 조직 내 전사체 정보를 추출하고(S40), 상기 추출을 통해 상기 탐색물질의 상기 관심 조직 내 분포와 관련이 있는 분자적 마커를 탐색(S50)하는 방법에 대한 것이다. 상기 양태는 도 1을 참조하여 보다 잘 이해될 수 있다. 우선 탐색을 위한 표지물질이 결합된 탐색물질을 관심 조직에 제공하여 표지물질에 의한 조직 영상(S10)을 얻을 수 있다. 상기 탐색을 위한 표지물질은 방사성 물질, 형광성 물질, 색소 물질 또는 발광성 물질일 수 있다. 상기 형광성 물질은 형광염료, 또는 GFP, YFP, CFP, 및 RFP를 포함하는 형광단백질 또는 형광을 내는 나노입자일 수 있으나, 이에 제한되는 것은 아니다. 상기 형광염료의 예로 DiO, DiA, Dil, DiR, DiD, ICG, Alexa Fluor 350, Alexa Fluor 405, Alexa Fluor 430, Alexa Fluor 488, Alexa Fluor 514, Alexa Fluor 532, Alexa Fluor 546, Alexa Fluor 555, Alexa Fluor 568, Alexa Fluor 594, Alexa Fluor 633, Alexa Fluor 635, Alexa Fluor 647, Alexa Fluor 660, Alexa Fluor 680, Alexa Fluor 700, Alexa Fluor 750, Alexa Fluor 790, fluorescein o-acrylate (FA) (λex= 490 nm, em= 514 nm), nile blue acrylamide (NBAM) (λex= 628 nm, λem= 667 nm), Indo-1, Ca saturated(λex= 331 nm,λem= 404 nm), Indo-1, Ca2+(λex= 346 nm, λem= 404 nm), Cascade Blue BSA pH 7.0, Cascade Blue, LysoTracker Blue, LysoSensor Blue pH 5.0, LysoSensor Blue, DyLight 405, DyLight 350, BFP (Blue Fluorescent Protein), 7-Amino-4-methylcoumarin pH 7.0, Amino Coumarin, AMCA conjugate, Coumarin, 7-Hydroxy-4-methylcoumarin, 7-Hydroxy-4-methylcoumarin pH 9.0, 6,8-Difluoro-7-hydroxy-4-methylcoumarin pH 9.0, Hoechst 33342, Pacific Blue, Hoechst 33258, Pacific Blue antibody conjugate pH 8.0, SYTOX Blue-DNA, CFP (Cyan Fluorescent Protein), eCFP (Enhanced Cyan Fluorescent Protein), 1- Anilinonaphthalene-8-sulfonic acid (1,8-ANS), 1,8-ANS (1-Anilinonaphthalene-8-sulfonic acid), evoglow- Pp1, evoglow-Bs1, evoglow-Bs2, Auramine O, LysoSensor Green, eGFP (Enhanced Green Fluorescent Protein), LysoTracker Green, Sapphire, BODIPY FL conjugate, MitoTracker Green, Calcein pH 9.0, FDA, DTAF, CFDA, Rhodamine 110, Acridine Orange 등이 있으나, 이에 제한되는 것은 아니다. 상기 방사성 물질은 방사성 동위원소, 예컨대, 60Cu, 61Cu, 62Cu, 64Cu, 67Cu, 66Ga, 67Ga, 68Ga, 44Sc, 47SC, 111In, 114mIn, 114In, 86Y, 90Y, 212Bi, 213Bi, 212Pb, 225Ac, 89Zr 및 177Lu 등이 있으나 이에 제한되는 것은 아니다. 상기 탐색을 위한 표지물질의 탐색물질에의 결합은 정전기적, 물리적, 화학적 또는 생물학적 결합일 수 있다. 상기 탐색물질은 관심 조직 내에서 생리활성을 나타내거나 조직 내 분포하여 탐색하고자 하는 대상이 되는 물질 로, 예컨대 나노 물질(예: 고분자 나노입자, 지질 기반 나노입자, 고분자 이중층 구조 나노입자, 단백질 나노입 자, 무기 나노입자 또는 결정성 나노입자), 저분자 화합물, 고분자 화합물, 천연물, 압타머, 나노바디, 미생물, 항체, 엔지니어링 항체, 항체약물접합체, 세포외 소포체, 세포, 펩타이드, 핵산, 단백질, 아미노산, 당, 지질, 바이오 의약품 또는 바이오 후보물질(예: 생물학적 제제, 유전자재조합 의약품, 세포배양 의약품, 동등생물의약 품, 개량생물의약품, 첨단바이오 의약품 또는 그 후보물질), 합성화학 의약품 또는 합성화학 후보물질, 및 천연 물 의약품 또는 천연물 후보물질로 이루어진 군으로부터 선택된 것일 수 있다. 상기 관심 조직은, 피부, 소장 또는 대장 등의 장, 심장, 폐, 신장, 간, 비장, 근육, 또는 종양 조직 등일 수 있으나 이에 제한되는 것은 아니 다. 상기 S10 단계에서 임의로 상기 관심 조직을 염색하고 염색된 조직 영상을 얻는 단계를 추가로 포함할 수 있다. 상기 염색법으로는 ALP assay (alkaline phosphate assay), Sirius red staining, Alcian blue staining, pH map, H&E 염색, Trichrome 염색, PAS (Periodic acid -Schiff) 염색, 면역조직화학염색 등을 이용할 수 있으며 이에 제한되는 것은 아니다. 상기 염색된 조직 영상의 결과는 본 발명의 탐색 결과를 검증하거나 분자적 마커 탐색시 유용한 정보를 추출하는 보완적 내지 보충적 일 수단으로 사용될 수 있다. 일 예에서 상기 조직 염색 영상은 그 자체로 이용되거나 인공지능을 이용한 영상 특성 추출 알고리즘, 예컨대, SPADE(Spatial gene expression patterns by deep learning of tissue images) 알고리즘을 적용하여 영상의 특성들을 추출하고, 추 출된 특성과 관련된 SPADE 유전자 정보를 얻을 수 있다. 상기 탐색물질의 관심 조직에의 제공은 탐색물질을 관심 조직 내 직접 제공하거나, 전신 투여(예: 정맥 주사)로 대상체에게 투여한 후 관심 조직에 분포되는 것을 포함할 수 있다. 상기 조직 영상은 상기 표지물질을 측정할 수 있는 현미경과 상기 표지물질을 타일링 과정을 통해 전체 슬라이드 영상으로 획득할 수 있다.상기 탐색물질의 조직 영상을 획득하기에 앞서, 관심 질환을 갖는 동물 모델을 확립할 수 있으며, 이러한 질환 이 확립된 동물 모델에 탐색물질을 제공함으로써 특정 질환에 있어서 탐색물질의 분포, 또는 생리 활성 정보를 설명할 수 있는 분자적 마커를 탐색할 수 있다(도 2 참조). 상기 관심 질환은 특별히 한정되지 않고, 각종 암, 뇌질환, 신경질환, 간질환, 장질환, 면역 질환, 바이러스성 질환, 신장 질환, 염증 질환, 대사성 질환, 피부 질환, 당뇨 질환, 감염성 질환, 심혈관 질환, 신경 퇴행성 질 환 등일 수 있으며, 보다 구체예에서, 암 질환, 뇌질환, 당뇨 질환, 염증 질환, 또는 바이러스성 질환, 감염성 질환 등일 수 있다. S10 단계에서 표지물질에 의한 조직 영상은 그대로 사용하거나, 사용하는 공간 맵핑이 효과적으로 이뤄지기 위 해, 조직 영상을 특정 알고리즘의 영상 정합 프로세스를 이용해 변환시킨 영상을 이용할 수 있다. 이러한 과정 은 공간 전사체 정보의 스팟과 상기 조직 영상을 맞추기 위해 필요할 수 있다. 이에 S10 단계 이후 필요에 따 라 얻어진 조직 영상에 대해 효과적인 공간 맵핑을 위한 알고리즘을 거친 정합 영상을 얻는 단계를 추가로 포 함할 수 있다. 상기 단계에 의해 얻어진 영상을 본원에서 '정합 영상'이라 한다. 상기 알고리즘은 이미지를 평 행이동변환, 회전변환, 기타 위상기하학적 변환시키는 알고리즘으로 그 예로는 Python계 오픈-소스 DiPY 패키지 에 의해 제공되는 알고리즘, 또는 ImageJ에서 bUnwarpJ 모듈을 사용하는 방법 등이 있으며, 이에 제한없이 공지 된 알고리즘을 사용할 수 있다. 또한 S10 단계에서 얻어진 조직 영상에 대해 상기 정합 영상을 얻는 단계에 추가하거나 이의 추가 없이, 효과적 공간 맵핑을 위해 상기 조직 영상에 대해 또는 정합 영상에 대해 변환 영상을 얻는 것을 추가로 포함할 수 있다. 상기 변환 영상은 조직 영상 또는 정합 영상에 대해 영상 강도에 따라 불연속적으로 변환시킨 영상을 말 한다. 예컨대, 이러한 변환 영상을 얻는 방법으로는 고흡수의 표지물질의 조직 영상 스팟과 저흡수 표지물질의 조직 영상 스팟으로 나누는 이진 변환을 수행하는 것일 수 있다. 상기 이진 변환은 영상 강도에 대해 특정 값을 기준으로 O 또는 1로 얻어진 조직 영상을 데이터화하는 것으로 예를 들어, 가장 강한 형광 강도 값을 기준으로 이의 25% 이내의 강도는 O으로 그 외(즉, 25% 이상의 강도)는 1로 변환된 영상을 얻는 것을 포함할 수 있다. 이러한 이진 변환 영상이 본원에서 '변환 영상'의 일 예일 수 있다. 이에 공간 맵핑에 있어 표지물질에 의한 조직 영상을 그대로 이용하거나 ' 정합 영상' 및/또는 '변환 영상'을 이용할 수 있으며, 구체적으로는 조직 영상으로부터 정합 영상을 얻고, 이 정합 영상을 영상 강도를 기준으로 변환시켜 얻은 변환 영상을 이용할 수 있다. 상기 관심 조직의 공간 정보를 공유하는 전사체 정보를 얻는다. 공간 전사체 정보(Spatially resolved transcriptome information)는 한번에 수백 내지 수만가지의 유전자 발현 정보를 제공하며, 전장 또는 부분적 유전자 발현을 공간 정보를 포함하여 획득하는 기술이다(도 3 참조). 상기 공간 전사체 정보는 상기 관심 조직 의 냉동 절편을 몰드에 고정하고 permeabilization, cDNA 합성 및 RNA 시퀀싱 등의 단계를 거쳐 분석될 수 있다. 상기 공간 전사체 정보를 얻기 위한 관심 조직의 절편은 상기 탐색물질의 조직 영상을 얻기 위한 절편 과 '연속된' 조직 절편일 수 있다. 상기 공간 전사체 정보는 관심조직 내 공간 좌표를 갖는 스팟(spot) 내 전 사체 RNA 리드(read)수 및 RNA 종류일 수 있다. RNA 종류의 예로, mouse RNA인지 human RNA인지 등, 유전자 발현을 보는지 또는 엑손을 보는지 인트론을 보는지, 이벤트 기반 대체 스플라이싱(event-based alternative splicing) 혹은 아이소폼 기반 대체 스플라이싱(isoform-based alternative splicing)을 포함하는지, mutation burden을 보는지, noncoding RNA 혹은 nontranslated RNA를 포함하는 지 등의 정보를 의미할 수 있다. 상기 공간 맵핑에 있어 공간 전사체 정보는 유전자 특징에 따른 스팟을 시각화하는 프로그램을 이용하거나 특정 개수 미만의 RNA 리드를 갖는 스팟을 제외시키는 방법을 이용할 수 있다. 예를 들어, 유전자 특징에 따른 스팟 (spot)을 시각화하기 위해 R의 Seurat 패키지를 사용하여 t-분산 확률적 이웃 임베딩(t-SNE)을 사용할 수 있다. 또한 예를 들어 1000 미만, 900 미만, 800 미만, 700 미만, 600 미만, 500 미만, 400 미만, 300 미만, 200 미 만 또는 100 미만 RNA 리드를 갖는 스팟은 분석에서 제외시킬 수 있다. 이후, 상기 탐색물질의 표지물질에 의한 조직 영상을 상기 공간 전사체 정보와 공간 맵핑시켜 공간 맵핑 정보를 얻을 수 있다(S30). 본원에서 용어 '공간 맵핑'은 2차원 평면으로 배치된 공간 전사체 정보의 스팟의 좌표와 이에 상응하는 2차원 평면으로 배치된 탐색물질의 표지물질에 의한 조직 영상 내 픽셀의 좌표를 공간적으로 일치시키는 과정을 의미 한다. '공간 맵핑'은 정합 또는 변환 이후 얻어진 정합 영상 또는 변환 영상의 픽셀 위치와 각각의 공간전사체 스팟들의 좌표를 일치시켜 하나의 정보 세트로 만드는 과정을 의미한다. 일 예에서, 상기 공간 맵핑 전 또는 후, 표지물질에 의한 조직 영상 (또는 이의 정합 영상 또는 변환 영상 포함)을 1개 이상의 클러스터로 구획화할 수 있다. 상기 1개 이상의 클러스터는 상기 표지물질에 의한 영상 강 도에 의해 분류하거나, 상기 탐색물질의 표지물질에 의한 영상을 복수개의 패치들로 분할하고 상기 각 패치에 대한 영상 특징의 유사성에 의해 분류하는 알고리즘에 의해 분류하거나, 유전적 일관성에 따라 분류할 수 있다. 상기 조직 영상은 클러스터 1, 클러스터 2, 클러스터 3 등으로 분류될 수 있으며, 전체 클러스터의 개수는 1개 이상, 구체적으로 2개, 3개, 4개, 5개, 6개, 7개, 8개, 9개, 10개, 11개, 12개, 13개, 14개, 15개, 16개, 17개, 18개, 19개, 또는 20개 등의 클러스터들로 분류할 수 있으며 이에 제한되는 것은 아니다. 표지물질에 의 한 조직 영상은 미리 설정된 크기의 패치 조직 영상으로 분할되고, 영상 특성 추출 모델을 사용하여 각 패치의 특징들을 추출하고 이후 이 특징들에 따라 1개 이상의 클러스터로 분류할 수 있다. 예를 들어, 표지물질에 의 한 조직 영상은 394 x 384의 패치들로 분할될 수 있고, 각 패치 크기는 5x5이며, 각 패치마다 512개의 특징들이 추출될 수 있고, 특징들을 기준으로 1개 이상의 클러스터로 분류될 수 있다(도 8 참조). 상기 영상 특징의 유 사성에 의해 분류하는 알고리즘의 예로는 K-평균 군집화(K-means clustering), 비지도 계층적 군집화, 추정 이 웃 임베딩(stochastic neighbor embedding), 병합 군집화(agglomerative clustering), 스펙트럼 군집화 (spectral clustering), 또는 가우시안 혼합(Gaussian mixture)의 클러스터링 알고리즘을 들 수 있으며, 보다 구체적으로는 K-평균 군집화 또는 비지도 계층적 군집화 알고리즘을 사용할 수 있다. 상기 공간 맵핑된 정보로부터 또는 상기 각 클러스터의 공간 맵핑 정보로부터 상기 표지물질이 결합된 탐색물질 의 분포와 관련이 있는 조직 내 전사체 정보를 추출할 수 있다(S40). 상기 조직 내 전사체 정보 추출(S40)은 인공지능을 이용한 영상(또는 이미지) 특성 추출 알고리즘, 표지물질의 조직내 영상 강도와 유전자 발현 정도의 상관성 분석, 세포 유형 분석 알고리즘, 및/또는 유전자 온톨로지 분석 등의 공지된 알고리즘 또는 분석법을 이용할 수 있다(도 4 참조). 상기 인공지능을 이용한 영상 특성 추출 알고리즘은 SPADE(Spatial gene expression patterns by deep learning of tissue images) 알고리즘 등이 있으며, 상기 SPADE 알고리즘은 https://doi.org/10.1101/2020.06.15.150698에 공지되어 있으며 참조에 의해 이 전체가 본원에 혼입된다. 상 기 영상 특성 추출 알고리즘은 표지물질에 의한 조직 영상 또는 영상의 각 클러스터로부터 특성들을 추출하고, 추출된 특성과 관련된 SPADE 유전자 정보를 제공한다. 상기 SPADE 알고리즘은 사전 훈련된 VGG16 모델이 각 지 점 주변의 패치당 예컨대 512개의 특징을 추출하고 특징의 차원을 줄이기 위해 주성분 분석(PCA)을 수행하며, SPADE 유전자를 식별하기 위해 주성분(PC)을 선택할 수 있다. 상기 표지물질의 조직 내 영상 강도와 유전자 발현 정도의 상관성 분석은 DEG(Differentially expressed genes), 상관계수의 계산에 의한 상관성 분석 또는 이미지 유사도 평가 알고리즘 등을 이용할 수 있다. 상기 분석법은 유전자의 발현값을 측정하고 통계적으로 처리하여 영상 강도를 기준으로 유의하게 발현된 유전자를 선 발하는 분석법이다. 상기 상관계수 계산이 피어슨 상관계수, 스피어만 상관계수, 또는 켄달 상관계수 계산일 수 있고, 상기 이미지 유사도 평가 알고리즘의 예로는 SSIM(Structed Similarity Image Matching) 일 수 있다. 상기 선발된 유전자는 탐색물질의 분포와 상관성이 있는 유전자일 수 있다. 상기 분석법은 표지물질의 강도를 기준으로 고흡수 스팟과 저흡수 스팟 사이의 차등적으로 발현된 유전자를 선별할 수 있다. 예컨대 DEG는 폴드 체인지(fold change)로 분류될 수 있다. 폴드 체인지는 디폴트값 혹은 기준값을 기준으로 몇배 증가 또는 몇배 감소된 유전자 발현 정도를 나타낸다. DEG 분석은 부위 특이적 유전자들에 대해 테스트하고, 이후 흡수 특이적 유전자들을 분석하는 방법일 수 있다. 상기 세포 유형 분석 알고리즘은 Fisher의 정확검정, 최대 가능성평가(maximum likelihood estimation), 도메 인적응분류, 로지스틱 회귀분석 또는 음이항 회귀분석 알고리즘일 수 있다. 구체예로, MIA, CellDART 알고리 즘, RCTD 알고리즘, celltypist 또는 cell2location 등이 있으며, 이에 제한되지 않고 공지된 세포 유형 분석툴 을 이용할 수 있다. MIA(Multimodal Intersection Analysis)는 공간 전사체 정보로부터 어떤 종류의 세포 유 형이 어디에 위치하는지를 알려주는 분석법으로 상기 방법은 Hypergeometric Test (Fisher's Exact Test)라는 비교적 쉬운 통계 기법을 사용한다. CellDART(Cell type inference by domain adaptation of single-cell and spatial transcriptomic data) 알고리즘은 공간전사체 정보로부터 세포를 분류하는 알고리즘이다. RCTD (Robust decomposition of cell type mixtures in spatial transcriptomics)는 Maximum Likelihood Estimation과 같은 Supervised 방식으로 세포 유형을 매칭했는데, 기존의 비지도 방식으로는 결정할 수 없었던 Cell Doublet 같은 것도 결정할 수 있으며, 이에 이를 RCTD 분석이라고 한다. 유전자 온톨로지 (Gene Ontology, GO) 분석은 유전자(단백질)을 세가지 관점, 즉, 개별 유전자에 대해 유전자가 관련된 생물학적 과정(BP), 세포 성분(CC), 및 분자적 기능(MF)에 따라 구조화된 모델에서 정리하는 데이터베이 스이다. 각 종마다 유전자(단백질)의 이름은 모두 다르지만 이것들을 공통된 용어로 정리하여 서로 다른 종간 기능 비교에 유용하고 실질적으로는 통계적으로 유의하게 변화되는 생물학적 기능을 살펴볼 수 있는 기능을 제 공한다. 관심있는 유전자의 기능을 분석하기 위해 유전자 온톨로지 데이터베이스와 대조하여 Gene annotation을 수행하고 통계적인 방법을 통해 유의한 결과를 얻을 수 있다. 조직 내 전사체 정보를 추출하는 단계(S40)은, 표지물질에 의한 전체 영상에 대해 혹은 각 클러스터 영상에 대 해, 상기한 영상 특성 추출 알고리즘, 클러스터의 영상 강도와 유전자 발현 정도의 상관성 분석, 세포 유형 분 석, 및 유전자 온톨로지 분석 중 어느 하나만을 실시할 수도 있지만, 이들 분석법 중 2개 이상을 실시하고 그 공통점을 추출하거나 분석 결과들을 종합하여 유용한 정보를 추출할 수 있다. 상기 추출을 통해 상기 탐색물질의 상기 관심 조직 내 분포를 설명하는 분자적 마커를 탐색할 수 있다(S50). 상기 분자적 마커는, DNA, RNA, 대사물질, 단백질, 단백질 단편 등에서 유래된 단일 분자, 또는 이들의 패턴을 근거로 한 분자적 정보일 수 있다. 상기 분자적 마커는 탐색물질의 분포를 증진 또는 저해하거나, 탐색물질의 표적을 억제 또는 항진시키거나, 탐색물질의 작용을 증진 또는 저해하는 물질이거나 탐색물질의 분포와 관련이 있는 물질일 수 있다. 일 구체예에서 각 클러스터의 전사체 정보를 얻은 경우, 각 클러스터별 추출된 전사체 정보들을 상호 비교하고, 탐색물질의 분포와 보다 관련이 있는 클러스터를 선별하고, 선별된 클러스터의 전사체 정보로부터 분자적 마커 를 도출하는 것을 포함할 수 있다. 또는 각 클러스터별 추출된 전사체 정보들을 상호 비교하고, 상기 비교로부 터 탐색물질의 분포를 설명할 수 있는 분자적 마커를 도출하는 것을 포함할 수 있다. 상기 분자적 마커 탐색(S50)의 일 예는, 전체 조직 영상에 대해 DEG 분석 및 SPADE 알고리즘을 실시하고 그 결 과 DEG 분석에서는 조직 표면에서 혈액 관련 작용에 대한 강력한 지표자인 Hbb-bs가 중요 유전자가 도출되고, SPADE에서는 조직 표면에서 내피와 관련된 분자적 마커인 Lbp, Apod 및 Fabp4가 상위 랭킹된 상향 조절된 유전 자들로 도출되었다면, 상기 분자적 마커 탐색 단계(S50)는 혈관, 기질, 또는 표면 관련 활동 등과 관련된 유전 자 또는 단백질이 탐색물질의 흡수와 관련된다는 결론을 도출할 수 있다. 상기 분자적 마커 탐색(S50)의 다른 일 예로는, 클러스터 1, 클러스터 2... 등에 대해 각 클러스터별로 영상 특 성 추출 알고리즘, 표지물질의 조직내 영상 강도와 유전자 발현 정도의 상관성 분석, 세포 유형 분석, 및 유전 자 온톨로지 분석 등의 하나 이상의 분석을 실시하고 여기서 나온 결과들로부터 각 클러스터의 분자적 마커를 탐색하거나 클러스터들의 결과를 통합하여 분자적 마커를 탐색하는 것을 포함할 수 있다. 구체예로 클러스터 1 의 DEG에서는 Hba-a2, Hba-a1, Hbb-bs와 같은 혈액 관련 유전자가, 클러스터 2의 DEG 및 유전자 온톨로지 분석 에서 Pfkp, Gapdh 및 Hk1과 같은 해당작용 조절 효소가 공통으로 나타난 경우, 클러스터 1은 표면 관련 경향을 가지며 따라서 혈류 역학 등의 인자가 탐색물질의 분포 내지 생리활성에 영향을 미치고, 클러스터 2는 포도당 대사가 표지물질의 분포 내지 생리활성에 중요한 관련이 있을 수 있다는 정보를 얻을 수 있다. 본 발명의 다른 일 양태는, 탐색을 위한 제1 표지물질이 결합된 제1 탐색물질들을 관심 조직에 제공하여 상기 표지물질에 의한 조직 영상을 얻고, 상기 얻어진 조직의 영상을, 상기 조직의 공간 전사체 정보와 공간 맵핑시키는 것을 포함하는, 제1 탐색물질의 분포 내지 작용과 관련이 있는 관심 조직 내 생리활성 정보의 탐색 방법에 대한 것이다. 상기 제1 탐색물질의 관심 조직에의 제공은 탐색물질을 관심 조직에 직접 제공하거나, 전신 투여에 의해 대상체 에게 투여된 후 관심 조직에 분포되는 것을 포함한다. 상기 양태에서 용어 '표지물질', '탐색물질', '공간 전사체 정보', '관심 조직', '공간 맵핑' 등에 대한 정의는 전술한 양태에서와 동일하므로 그 기재를 생략한다. 상기 양태에서 용어 '제1 표지물질'은 전술한 양태의 '표지물질'과 동일하다. 본 발명에서 '생리활성 정보'는 탐색물질과 관련하여, 분포 또는 생체의 기능 또는 생리에 영향을 미치는 물질, DNA, RNA, 대사물질, 단백질, 단백질 단편 등에서 유래된 단일 분자, 이들의 패턴을 근거로 한 분자적 정보, 또 는 생체의 기능 또는 생리에 영향을 미치는 인자에 대한 모든 정보를 말한다. 생체의 기능 또는 생리에 영향을미치는 물질은 핵산, 뉴클레오티드, 단백질, 펩타이드, 아미노산, 당, 지질, 비타민, 화합물 등으로 기능 또는 생리에 영향을 미치는 모든 물질을 나타낸다. 생리활성 정보는 분자적 마커와 동일하거나 상이할 수 있다. 일 예에서 상기 생체의 기능이나 생리에 영향을 미치는 물질은 제1 탐색물질과 서로 상호작용하거나 탐색물질의 조 직에 대한 작용을 촉진, 유도(inducing), 억제(blocking), 또는 저해(inhibiting)하는 물질 정보일 수 있다. 예컨대 DEG 및 유전자 온톨로지 분석 결과에서 Pfkp, Gapdh 및 Hk1과 같은 해당작용 조절 효소가 공통으로 나타 난 경우, 상기 조절 효소를 포함하여, 포도당 대사에 관련되거나 이를 촉진, 유도, 억제, 또는 저해하는 핵산, 뉴클레오티드, 단백질, 펩타이드, 아미노산, 당, 지질, 비타민, 화합물 등이 생리활성 정보가 될 수 있다. 일 구체예에서 상기 제1 탐색물질의 관심조직 내 생리활성 정보를 탐색하기 위해, 제2의 표지물질이 결합된 제2 탐색물질의 상기 제2 표지물질에 의한 관심 조직의 영상을, 상기 조직의 공간 전사체 정보와 공간 맵핑시켜 공 간 맵핑 정보를 얻는 것을 추가로 포함할 수 있다. 여기서 제2 표지물질은 상기 제1 표지물질과 동일하거나 상 이할 수 있다. 상기 제2 탐색물질은 상기 제1 탐색물질과 상이하다. 상기 제1 탐색물질과 제2 탐색물질의 공 간 맵핑 정보들을 비교 및 분석하여 상기 제1 탐색물질의 생리 활성 정보를 탐색할 수 있다. 상기 제1 탐색물 질 또는 제2 탐색물질은 각각 나노 물질, 저분자 화합물, 고분자 화합물, 천연물, 압타머, 나노바디, 미생물, 항체, 엔지니어링 항체, 항체약물접합체, 세포외 소포체, 세포, 펩타이드, 핵산, 단백질, 아미노산, 당, 지질, 바이오 의약품 또는 바이오 후보물질, 합성화학 의약품 또는 합성화학 후보물질, 및 천연물 의약품 또는 천연물 후보물질로 이루어진 군으로부터 독립적으로 선택된 것일 수 있다. 일 예에서 상기 제2 탐색물질은 약리 기전 이나 활성이 알려진 공지 물질일 수 있다. 일 예에서 제2 탐색물질로부터 얻어진 공간 맵핑 정보가 상기 제1 탐색물질의 공간 맵핑 정보와 유사한 경우, 양 탐색물질은 유사한 약리기전이나 활성을 갖는 것으로 추정할 수 있다. 일 예에서, 제2 탐색물질이 특정 수용체의 억제제로 작용하는 것으로 알려진 경우, 얻어진 공간 맵핑 정보가 제 1 탐색물질의 공간 맵핑 정보와 불일치한 경우, 제1 탐색물질은 상기 특정 수용체의 억제제로서 작용하지 않는 것으로 추정할 수 있다. 이와 관련하여 예를 들면, 문헌 [참조: Cancer Biotherapy and Radiopharmaceuticals, 32, 83-89.]에서는 타겟 항원의 분포와 이를 억제하는 항체의 분포가 상당히 달라서 당해 항체의 의도한 효 과가 제대로 발휘되지 못했던 것이 보고된 바 있다. 본 발명의 또 다른 일 양태는, 탐색을 위한 표지물질이 결합된 탐색물질을 관심 조직에 제공하여 표지물질에 의한 조직 영상을 얻고, 상기 탐색물질의 표지물질에 의한 조직 영상을, 상기 관심 조직의 공간 전사체 정보와 공간 맵핑시켜 공간 맵핑 정보를 얻되, 여기서 상기 공간 맵핑 정보는 1개 이상의 클러스터의 공간 맵핑된 정보들을 포함하며, 각 클러스터의 공간 맵핑된 정보로부터 해당 클러스터의 전사체 정보를 추출하는 것을 포함하는, 탐색물질의 관심 조직 내 생리활성 정보를 탐색하는 방법에 대한 것이다. 상기 양태에서 용어 '표지물질', '탐색물질', '공간 전사체 정보', '관심 조직', '공간 맵핑', '공간 맵핑 정보' 및 '생리활성 정보' 등에 대한 정의는 전술한 양태에서와 동일하므로 그 기재를 생략한다. 조직 영상의 2개 이상의 클러스터로의 분할은 상기 공간 맵핑 정보를 얻는 단계 전 또는 후에 실시할 수 있다. 클러스터로의 분할은 표지물질에 의한 조직 영상의 강도에 따라 분류할 수 있으며, 예컨대 최대 영상 강도를 기 준으로 영상 강도의 25% 이상 및 25% 미만으로의 2개의 클러스터 분류, 또는 50% 및 25% 기준으로 한 3개의 클 러스터로의 분할일 수 있으나 이에 제한되는 것은 아니다. 또는, 상기 탐색물질의 표지물질에 의한 영상을 복수개의 패치들로 분할하고 상기 각 패치에 대한 영상 특징의 유사성에 의해 분류하는 알고리즘에 의해 분류될 수 있다. 표지물질에 의한 조직 영상은 미리 설정된 크기의 패 치 조직 영상으로 분할되고, 영상 특성 추출 모델을 사용하여 각 패치의 특징들을 추출하고 이후 이 특징들에 따라 1개 이상의 클러스터로 분류할 수 있다. 예를 들어, 표지물질에 의한 조직 영상은 394 x 384의 패치들로 분할될 수 있고, 각 패치 크기는 5x5이며, 각 패치마다 512개의 특징들이 추출될 수 있고, 특징들을 기준으로 1개 이상의 클러스터로 분류될 수 있다(도 8 참 조). 상기 영상 특징의 유사성에 의해 분류하는 알고리즘의 예로는 K-평균 군집화(K-means clustering), 비지도 계층 적 군집화, 추정 이웃 임베딩(stochastic neighbor embedding), 병합 군집화(agglomerative clustering), 스펙 트럼 군집화(spectral clustering), 또는 가우시안 혼합(Gaussian mixture)의 클러스터링 알고리즘을 들 수 있 으며, 보다 구체적으로는 K-평균 군집화 또는 비지도 계층적 군집화 알고리즘을 사용할 수 있다. 이후, 각 클러스터에 대해 상기 조직의 공간 정보를 공유하는 전사체 정보와 공간 맵핑시켜 각 클러스터의 공간 맵핑된 정보를 얻을 수 있다. 예컨대, 클러스터 1에 대해, 영상 특성 추출 알고리즘, 표지물질의 조직내 영상 강도와 유전자 발현 정도의 상관성 분석, 세포 유형 분석, 및/또는 유전자 온톨로지 분석 등의 공지된 알고리즘 또는 분석 방법을 이용하여 전사체 정보를 추출할 수 있으며, 클러스터 2, 또는 3에 대해 클러스터 1과 동일한 방식으로, 전사체 정보를 추출할 수 있다. 상기 클러스터 별로 공간 전사체 정보를 비교 및 분석하여 탐색물질의 조직 내 생리활성 정보를 탐색할 수 있다. 상기 생리활성 정보는 탐색물질과 관련하여, 분포 또는 생체의 기능 또는 생리에 영향을 미치는 물질, DNA, RNA, 대사물질, 단백질, 단백질 단편 등에서 유래된 단일 분자, 이들의 패턴을 근거로 한 분자적 정보, 또는 생 체의 기능 또는 생리에 영향을 미치는 인자에 대한 모든 정보를 말한다. 상기 비교 및 분석으로부터 예컨대 어떤 세포 유형 또는 분자적 마커가 어떤 클러스터에 유의미하게 특징적인지 에 대한 정보, 또는 표지물질 강도와 유의한 상관관계가 있는 전사체에 대한 정보, 이러한 전사체가 갖는 생리 적 기능에 대한 정보 등을 얻을 수 있다."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하, 본 발명을 실시예 및 실험예에 의하여 더욱 상세하게 설명하고자 한다. 그러나 하기 실시예 및 실험예는 본 발명을 예시하기 위한 것일 뿐, 본 발명의 범위가 이들만으로 한정되는 것은 아니다. 실시예 재료 및 방법 재료 1,2-디스테아로일-sn-글리세로-3-포스포콜린(DSPC), 콜레스테롤, 1,1'-디옥타데실-3,3,3',3'-테트라메틸인도카 르보시아닌 퍼클로레이트는 한국 Sigma-Aldrich에서 구입했다. 1,2-디스테아로일-sn-글리세로-3-포스포에탄올아 민 공액 폴리에틸렌 글리콜(DSPE-PEG)은 Creative PEGworks에서 구입했다. Avanti Mino Extruder는 Avanti Polar Lipids에서 구입했다. DiI 로딩된 리포좀의 합성 및 특성화 Avanti mini-extruder로 압출법으로 리포좀을 합성하였다. 리포좀은 DSPC, DSPE-PEG, 콜레스테롤 및 DiI 형광 염료(λex= 553 nm, λem= 570 nm)로 구성되었다. 박막 지질은 유기 용매를 기화시켜 제조하고 증류수로 수화시 켰다. 수화된 형광 리포좀 층을 400 nm 및 200 nm 기공 크기 멤브레인 필터를 사용하여 순서대로 압출하였다. DiI가 로딩된 리포좀은 TEM 영상은 균일하고 둥근 형태였으며(도 16a의 상단) 이는 전형적인 리포좀의 지질 이 중층 구조였다. 상기 리포좀의 유체역학적 크기는 동적 광산란 기구(DLS)에서 128.05±46.71 nm였다(도 16a의 중단). 550nm 여기에서 최대 흡수 파장과 최대 방출 파장은 각각 550nm 및 563nm였다(도 16a의 하단). 4T1 유방암 모델 확립 및 형광 이미징 4T1 동종이식 종양 모델을 준비하기 위해 4T1 유방암 세포(106 cells/0.02 mL)를 BALB/c 마우스 오른쪽 허벅지 부위에 피하 주사하였다. 10일 후, DiI가 로딩된 리포좀을 정맥 주사했다. 생체 내(in vivo) 형광 영상화는 생 체 내 영상화 시스템을 사용하여 주사 후 0, 4, 24시간에 수행하였다. 각 장기의 리포좀 분포를 확인하기 위해 주사 24시간 후에 마우스를 희생시켰다. 주요 장기(심장, 폐, 신장, 간, 비장, 근육 및 종양)를 수집하고 형광 이미징을 위한 생체 내 이미징 시스템으로 관찰했다. 공간 전사체(ST) 라이브러리, H&E 염색 영상 및 형광 영상 획득 상기 종양 샘플 중 가장 높은 시그널을 가진 종양을 선택하여 이후의 실험에 사용하였다. 신선한 종양 샘플은 저온 절편을 위한 최적의 절단 온도(OCT) 화합물(25608-930, VWR, USA)로 몰드에 내장되었다. ST 라이브러리는 cryo-sectioning, 고정, 투과화, cDNA 합성 및 RNA 시퀀싱과 같은 여러 단계를 통해 획득되었다. 모든 방법은 10x Genomics visium 프로토콜이 권장하는 방식으로 수행되었다. 총 2개의 연속 조직 조각을 얻었고, 이중 한 조직 조각은 H&E 염색 및 공간 전사체 라이브러리를 얻는데 사용하 였고, 다른 한 조직 조각은 형광 이미징에 사용되었다. 유전자 발현에 영향을 받는 형광 패턴을 철저히 조사할 수 있도록 크라이오톰에 사용되는 얇은 블레이드를 사용하여 슬라이스를 획득했다. ST를 위한 조직 조각을 Visium 슬라이드 상에 위치시켰다(Visium Tissue Optimization Slides, 1000193, 10X Genomics, USA 및 Visium Spatial Gene Expression Slides, 1000184, 10X Genomics). 냉각 메탄올을 이용하여 권장 프로토콜 하에 고정 을 실시하였다. cDNA 라이브러리를 얻고 250M 리드-쌍(pairs) 이하의 시퀀싱 깊이에서 NovaSeq 6000 System S1200 (Illumina, USA) 상에서 시퀀싱하였다. 원 FASTQ 파일 및 H&E 영상을 Space Ranger v1.1.0 software의 샘플로 프로세싱하였다. 상기 프로세스는 세포 레인저(Ranger)에 대해 (mouse mm10 reference package), 게놈 얼라인먼트를 위해 STAR v.2.5.1b (Dobin et al., 2013)를 사용한다. 상기 프로세스는 'spaceranger count' 코멘트에 의해 실시되었다. 용어의 혼동을 피하기 위해 \"픽셀\"은 형광 영상에서만 사용되었고 \"스팟\"은 공간 전사체 프로파일에서만 사용되"}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "었다. 또한 다음의 모든 데이터 분석 방법을 여러 부분으로 요약했다(도 7 참조). 영상 정합 획득한 형광 영상의 모양을 공간 전사체 스팟에 맞추기 위해 Python 기반 오픈 소스 DiPY 패키지에서 제공하는 알고리즘을 사용하여 영상 정합 프로세스를 구현했다(도 9a 내지 도 9f 참조). 형광 영상을 opencv2 팩키지를 사용하여 회색 스케일로 변환시켰다. 정합을 위해, 양 영상의 전체의 중심을 일치시킨 후, 선형 리지드(rigid) 변환을 실시하였다. 상기 리지드 및 아핀(affine) 변환 과정은 두개의 회색 스케일의 영상 간의 상호 정보를 이용하여 최적화되었다. 선형 변환 후에, 대칭 미분동형 정합 알고리즘에 기초한 비선형 와핑(warping) 과정을, 최적화를 위해 'CCMetric'과 함께 함수 'SymmetricDiffeomorphicRegistration'을 이용하여 실시하였 다. 이 변환 영상을 가시적으로 평가하였다. 형광영상과 공간전사체 스팟이 잘 일치하는 경우 영상 정합을 생략하거나 영상 회전이나 시각적 평가를 통한 평 행이동과 같은 다른 단순화된 방법으로 대체할 수 있다. 공간 전사체 스팟의 거리 표시(annotation) 종양의 표면으로부터의 거리를 생각해 내고 왼쪽 경계 영역의 스팟의 거리를 0으로 정의했다. 거리를 하나씩 높 이면서 즉시 다음 레이어를 표시했다. 그리고 지도는 주석이 달린 거리로 채색되었다. 한편, 각 스팟에 대한 형 광 강도 값은 등록된 형광 영상에서 Python의 matplotlib.pyplot에서 imread 함수로 취하여 각 스팟 주변의 패 치의 한 길이가 스팟 간 거리와 일치하도록 평균화하여 각 스팟에 대한 형광을 나타낸다. 이 과정은 부위 특이 적 유전자와 흡수 특이적 유전자를 구분지을 때만 사용되었다. 마지막으로, 각 거리에 대한 형광 강도 값을 평 균화하고 주석 거리와 평균 형광 강도 사이의 관계를 보여주는 플롯을 작성했다. 확산의 수학적 시뮬레이션 확산의 역학을 설명할 때 일반적으로 Fick의 법칙이 사용된다."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서 C는 농도 벡터, (u,v,w)는 속도 벡터, D는 확산도, R은 소스 또는 싱크 항이다. 상기 공식의 결과를 시 뮬레이션하기 위해 두 가지 가정을 했다. 첫번째는 혈관의 틈의 개수가 Pecam1 유전자의 발현 정도에 비례한다 고 예상했다. 그리고 우리는 조직 샘플이 대략 전체 종양의 중앙 평면이라고 생각하여 평면에 수직인 유속과 농 도 구배를 무시할 수 있다고 생각했다. (u,v,w)를 문헌에 따라 null 벡터로 간주했다. 간단히 말해서, 정중면에 수직인 원통형 혈관을 고려하면 혈 관에 의한 최대 유체 속도는 실험적으로 추정된 값으로 그릴 수 있다: 혈관 직경 = 10μm 스팟 간 거리=100μm 스팟 높이 = H μm 조직의 단위 부피당 혈관의 표면적 = 0.0034 μm-1 혈관의 단위 면적당 갭(gap) 수 = 500 gaps/mm2 실험적으로 추정된 유량=0.065μm3/s·gap ∴ π x 10 μm x H μm x 최대 유체 속도="}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "따라서 최대 유체 속도 = 27.625 pm/s를 얻었다. 이는 유체 대류가 24시간 동안 한 지점을 가로지르는 나노입자 의 움직임을 설명할 수도 없음을 의미한다. 따라서 (u,v,w)를 무시하고 수치적 접근 방식을 사용하여 공식을 풀었다."}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서 Δx와 Δy는 동일하게 설정되었다. 그리고 서로 다른 D/Δx2 값과 반복 횟수를 갖는 C/k 주석이 달린 Fick 확산의 다양한 시뮬레이션 결과를 탐색했다. 4T1 고형 종양에의 형광 리포좀의 전달 확인 우리는 IVIS 형광 스펙트럼 이미지 장치를 통해 시간이 지남에 따라 Dil-로딩된 리포좀이 종양에 축적되었음을 관찰했다(도 16a 참조). 또한, 이는 주입 24시간 후 정상 장기 및 종양의 생체외 형광 영상화를 통해 확인되었다(도 16b). 형광 나노입 자의 더 높고 이질적 흡수가 종양에서 관찰되었고 간과 비장에서는 약한 흡수가 나타났다. 신장의 형광 신호는 유리된 DiI 염료로 인한 것일 수 있다. H&E 염색, 전사체학 및 형광 영상의 탐색 H&E 염색에서 3개의 대표적인 영역이 두드러졌다: 캡슐-유사 좌측 경계, 고밀도 암 영역 및 내부 괴사 영역(도 17a의 A). 따라서 H&E 영상은 주어진 샘플이 전체 종양 미세 환경을 정성적으로 나타냄을 보여주었다. RNA 리 드의 공간 매핑에서는, 암이 풍부한 영역이 가장 높은 유전자 발현을 보였고 괴사 영역이 가장 낮은 유전자 발 현을 보인 것으로 나타났다 (도 17c). 한편, 형광 영상을 이진 맵으로 처리하는 것은 여러 단계를 거친다 (도 17a의 B, C, D 내지 도 17b). 그리고 유전자 발현 패턴에 따른 클러스터링도 조사했다(도 17d). 거리에 따른 평균 형광 강도는, 단순 수동 확산의 수 학적 모델과는 상이하였고, 이는 종양 내의 형광 패턴이 단순한 물리학보다는 복잡한 종양 미세 환경의 영향을 받을 수 있음을 시사한다(도 17e). 혈관 마커인 Pecam1을 이용하여 형광 리포좀 분포의 수동 과정을 예측하기 위해, Fick의 법칙의 수적인 분석 결과를 얻었다. 상기 분포는 실제 형광 리포좀 분포와 일치하지 않았고, 특 히 나노입자의 종양 내 흡수를 설명할 수 없었다(도 17f 및 도 18 참조). 이는 다른 대표적 범내피적 마커인 Cd34에 대해서도 마찬가지였다(도 17f 및 도 18 참조). 전체 형광 분석 형광 영상의 이진 맵 생성 분할 및 병합 접근 방식을 사용하여 고흡수 지점을 확보했다. 처음에 분할 과정은 다음으로 수행되었다: 고해상 도의 형광 영상 픽셀과 저해상도의 공간 전사체 스팟을 연결하기 위해 영상 이진화를 수행했다. 이분법에 의해 형광이 높은 스팟(높은 흡수 스팟)과 형광이 낮은 스팟(낮은 흡수 스팟)을 구별했다. 이진 영상을 만들 때 최대 형광 강도의 25% 이상의 밝기를 가진 픽셀만 ImageJ에서 높은 픽셀로 선택되었다. 형광 강도는 ImageJ(ver 1.8; https://imagej.nih.gov/ij/download.html)에 의해 측정되고 분석되었다. 이진 영상이 획득되면 스팟의 중심에 해당하는 픽셀 값(즉, 0 또는 1)을 검색하여 이진 맵이 생성되었다. 그 후, 우선 고흡수 스팟을 병합하였고, 고흡수 스팟으로부터의 특정 유클리드 거리 내의 모든 스팟을 고흡수 스팟으로 할당하였다. 거리는 폴드 체인지(FC, 배수 변화) 또는 피어슨 상관 계수에 따라 결정되었다(도 10). 상기 분할 단계에서 발생하는 매개변수 종속성이 병합 단계에서 최적 거리의 선택 프로세스에 의해 완화될 것으 로 예상했다. 이진 영상과 공간 전사체 정보의 공간 맵핑 유전자 특징에 따른 스팟(spot)을 시각화하기 위해 R의 Seurat 패키지(version 4.0.5.)를 사용하여 t-분산 확률 적 이웃 임베딩(t-SNE)을 사용했다. 양질 조절을 위해 500 미만(즉, 보존적 역치)의 RNA 리드를 갖는 스팟은 다음 분석에서 제외되었다. 상기 이진 영상이 수집된 후 .json 파일을 사용(척도 정보: \"spot_diameter_fullres\": 56.50370399999998, \"tissue_hires_scalef\": 0.27979854, \"fiducial_diameter_fullres\": 91.27521500000002, \"tissue_lowres_scalef\": 0.08393957)하여 스팟을 영상 상의 특정 픽셀의 위치와 대응시킴으로써 공간 맵핑이 이뤄졌다. DEG 분석 RunTSNE의 PPL(perplexity)은 30으로 설정되었다. min.pct 및 logfc.threshold가 둘 다 0.25로 설정된 Seurat 패키지의 FindAllMarkers에 의해 고흡수 스팟과 저흡수 스팟 사이의 차등적으로 발현된 유전자(DEG)가 탐색되었 다. 또한 생성 유전자 부위-특이적으로 만들기 위해 only.pos = TRUE를 설정하였다. 마지막으로 DEG는 FC(fold change, 배수 변화)로 분류되었다. SPADE 알고리즘 분석 전체 DEG 분석에서 관찰을 확인하기 위해 조직 영상의 심층 학습(SPADE) 알고리즘에 의한 공간 유전자 발현 패 턴이라는 또 다른 접근 방식이 사용되었다(도 11a 내지 도 11k 참조). 2021년 2월에 게재된 SPADE 알고리즘 논 문은 CNN 딥러닝 알고리즘으로 ImageNet Challenge에서 우승한 VGG16을 사용한 특징 추출 알고리즘을 소개하 고 있다. 사전 훈련된 VGG16 모델은 각 스팟 주변의 패치당 512개의 특징들을 추출하고 특징들의 치수를 줄이기 위해 주성분 분석(PCA)을 수행했다. SPADE 유전자를 확인하기 위해 3개의 주성분(Principle Component, PC)을 선택했다. 패치 크기는 PC1에서 가장 큰 평균 Log FC를 갖도록 선택되었다. 각 PC의 SPADE 유전자는 경험적 Bayes 알고리즘과 선형 회귀 분석에서 발견되었다. 그런 다음 유전자를 FC(fold change) 순서대로 분류했다. GO 분석 R에서 볼케이노 플롯 및 유전자 온톨로지(GO) 분석을 수행했다. 간단히 말해서, 개선된 플롯을 얻을 때, R의 EnhancedVolcano 기능은 0.05의 pCutoff 및 0.3의 FCcutoff와 함께 사용되었다. FDR이 0.05 미만인 상위 1000 개 유전자를 선택하고 FC가 가장 높은 상위 8개 유전자의 공간적 특징 플롯을 표시했다. GO 분석을 사용할 때 R 의 enrichGO 기능을 사용했다. 상위 30개 상향 조절 또는 하향 조절 유전자를 사용하여 생물학적 과정(BP), 세 포 성분(CC) 및 분자 기능(MF)에 따라 GO 분석을 수행했다. 생물학적 표시를 특정할 때, g:Profiler (https://biit.cs.ut.ee/gprofiler/gost)가 GO 분석 대신 사용되었다. 전체 형광 분석 결과 : 약물 흡수가 혈액 순환에 의해 영향을 받음을 보여줌 전체 형광 분석 결과는 도 19a 내지 19e에 상세히 나타나 있으며, 아래에서는 각 분석법에 따른 결과를 설명한 다. DEG 분석 결과 전체 DEG 분석에서 Hbb-bs라 일컫는 단 하나의 중요한 유전자가 있었다(도 19a, 표 1). 표 1 전체 형광 분석에서 FC에 의해 도출된 전체의 DEG 리스트 Order Genelog2FC p_val_adjOrder Gene log2FC p_val_adj 1 Hbb-bs0.7557620.003345- - - - Hbb-bs는 적혈구의 헤모글로빈에서 발견되는 베타 폴리펩타이드 사슬을 인코딩하며 적혈구(RBC) 마커 중 하나로 간주된다. 헤모글로빈 mRNA는 적혈구가 살아 있는 한 분해되지 않은 채로 남아 있어 헤모글로빈 mRNA가 혈 액 관련 작용에 대한 강력한 지표로 사용될 수 있다는 것은 잘 알려져 있다. 이와 일치되게, 혈관 근처에서 우 선적으로 분포하는 것으로 잘 알려진 내피 세포(예: Pecam1, Cd34) 및 기질 세포(예: Fabp4)와 관련된 몇몇 유 전자의 발현이 Hbb-bs와 공동 국소화됨을 발견했으며, 이는 형광 리포좀의 전체 분포가 혈액 순환과 관련이 있 음을 시사한다(도 19a 및 도 19b). Hbb-bs의 발현과 약물의 분포 사이의 연관성을 더 조사하기 위해 형광 신호 강도와 높은 흡수 지점 내 Hbb-bs의 발현 수준의 상관 관계 분석을 수행했다. Hbb-bs 발현 수준과 형광 강도 사이에는 통계적으로 유의한 상관관계 가 없었다(r=0.073, p-value=0.188). SPADE 분석 결과 또한 상당히 다른 접근 방식을 사용한 SPADE 알고리즘도 표면 군에서 우선적인 형광 패턴을 보여주었다. SPADE 알고리즘의 세 가지 이미지 잠재적 특징들인 PC1, PC2, PC3을 보여주며, 이들 각각은 주성분 1, 주성분 2, 주성 분 3을 의미한다. 이 중 가장 분산량이 큰 잠재 특징(즉, PC1)이 선택되었다(도 19b). PC1에서 Lbp, Apod 및 Fabp4가 상위 랭킹되고 상향 조절된 유전자라는 점은 주목할 만하다(표 2). 가장 높은 FC(fold change)를 갖는 상위 8개의 SPADE 유전자들의 공간 특징 플롯을 도 19d에 나타내었다. 표 2 전체 형광 분석에서 FC에 의해 도출된 상위 20개의 SPADE 유전자들 리스트 Order Gene log2FC p_val_adjOrder Gene log2FC p_val_adj 1 Ctsk 0.5979088.46E-0711 Fabp4 0.4838040.000151 2 Lbp 0.5780551.81E-0612 Fosb 0.4828190.000151 3 Mbp 0.5349741.71E-0513 Aqp1 0.4786010.000180 4 Sparcl10.5322591.71E-0514 Rgs5 0.4682880.000309 5 Apod 0.5296341.71E-0515 Igfbp50.4652830.000332 6 Pik3r50.5144253.94E-0516 Gas6 0.4625850.000359 7 Plekha40.4953539.77E-0517 Mt3 0.4597510.000400 8 Nr4a10.4943699.77E-0518 Pdlim10.4561490.000467 9 Cilp 0.4942649.77E-0519 Scn7a 0.4523210.000552 10 Selenop0.4909790.00010920 Mal 0.4426380.000866 SPADE 유전자 중에서 Ctsk, Lbp, Sparcl1 및 Apod는 상위 및 상향 조절된 유전자로, 기질 영역의 세포외 기질 (ECM)에 풍부하였다(도 19d). 이 발견은 나노입자의 종양 흡수가 모세혈관벽 콜라겐과 관련이 있다는 이전의 관 찰과 일치한다. Apod가 아포지단백질 중 종양의 초기 단계에서 발견된다는 것은 잘 알려져 있으며, 이는 이 실험 조건과 일치했다. 개선된 볼케이노 플롯으로 상위 1,000개의 관련 유전자를 획득했다. 개선된 볼케이 노 플롯은 적절한 컷오프 아래에서 상향 조절된 유전자를 우선적으로 보여주었다(도 19c). GO 분석 결과 SPADE 유전자는 유전자 온톨로지 분석에서 섬유 및 세포외 기질(ECM)과 관련된 많은 유전자가 있었다(도 19e). 구체적으로 도 19e는 생물학적 과정(BP), 세포 성분(CC), 및 분자적 기능(MF)에 따른 상향 조절된, PC1에서의상위 30개의 SPADE 유전자의 GO(유전자 온톨로지) 분석 결과로, 주로 평활근 세포 증식 및 피브로넥틴 결합의 조절과 관련이 있었다. H&E 염색 이미지를 이용한 SPADE 알고리즘 분석 결과 H&E 염색 이미지를 이용하여 SPADE 알고리즘을 적용하였다. 그 결과 내피 분자 마커 그룹, 대사 및 신호 분자 마커 그룹, 용해 활성 관련 그룹을 포함한 다양한 유형의 표면 패밀리가 있었다(도 20). 도 20a 내지 도 20c는 각각 H&E 염색 이미지에 대해 SPADE 알고리즘을 적용해 각 주성분, 즉 PC1, PC2, PC3을 얻고, 이 PC1(도 20a), PC2(도 20b), 및 PC3(도 20c)에서 상위 SPADE 유전자들과 각 GO 분석 결과 및 상위 1000개의 변수 유전자들의 개선된 볼케이노 플롯이다. 형광 이미지로, SPADE 알고리즘에서 발견된 분자 마커들은 세 가지 중 내피 분자 마 커 그룹의 첫 번째 계열과 밀접한 관련이 있는 것으로 나타났다. 전체 형광 분석 결과 종합 검토 결론적으로, 전반적인 DEG 분석 및 SPADE 알고리즘을 포함한 전체 형광 분석 법으로는 혈관, 기질 또는 표면 관 련 활동과 같은 나노약물 흡수의 구조적 요인을 결정하는 유전자를 식별할 수 있었다. 이러한 접근 방식에 대한 이러한 발견은 수동적 경로의 우세를 암시하는 여러 이전 논문에 의해 지지되었다. 하지만 이는 최고-랭킹된 유전자가 있는 특징 맵은 실제로 이질적인 섭취와는 거리가 멀었다. 이것은 말초 세포와 종양 내 세포 사이의 이질성 때문인 것일 수 있다. 하위그룹 형광 분석 Hbb-bs 및 SPADE 유전자는 조직 내 나노약물의 형광 분포와 관련이 있는 것으로 밝혀졌다. 하지만, 유전자의 발 현 패턴은 종양의 내부 흡수 클러스터와 일치하지 않았다(도 17a의 B vs. 도 19a 및 19d). 종양의 표면과 내부 영역에서 나노약물의 흡수 메커니즘이 다를 수 있다고 추측하여 영상 특징 기반 클러스터를 사용하여 흡수 패턴 을 분석했다. 클러스터링 1 : 클러스터 1 및 클러스터 2로의 분류 흡수 클러스터를 획득하기 위해 분할 → 클러스터링 → 병합과 같은 접근 방식을 구성했다. 분할 단계와 병합 단계는 전체 형광 분석에서와 동일했다. 분할된 스팟의 클러스터링을 수행하기 위해 VGG16과 K-평균 군집화 알 고리즘의 조합과 비지도 계층적 클러스터링의 두 가지 접근 방식을 사용했다. 형광 영상을 패치 크기가 5 x 5인 394 x 384개의 패치들로 분할하고 각 패치의 픽셀을 VGG16 모델에 대한 패치 입력으로 사용하여 VGG16 모델을 사용하여 각 패치당 512개의 특징들을 추출했다(도 8 참조). 그런 다음 패치들을 K를 4로 설정하여 특징에 따라 클러스터링하는 K에 의해 분류하였다(도 12a 및 도 12b 및 도 22 참조). 결과적으로 형광 영상은 텍스처에 따라 4개의 ROI(관심 영역)으로 분리되었다. 위에서 언급한 이진 맵은 4개의 ROI 중 2개의 중요한 ROI로 병합되었다(도 21a 참조). 그 결과, 높은 흡수 스탓은 2개의 클러스터로 분할되었고 다른 스팟은 기본값 0으로 할당되었다. 결론적으로 총 3개의 클러스터가 형성되었다. 각 흡수 클러스터의 아웃 라이어들은, 클러스터 1과 2에서 스팟의 비지도 계층적 클러스터링을 이용하여 제거하였다. 즉, 비지도 계층적 클러스터링(unsupervised hierarchical clustering)을 수행하기 위해 VGG16 모델에서 추출한 유전자 프로파일 또는 특징에 따른 각 고흡수 스팟의 각 쌍의 상관관계로부터 히트맵을 도출했다. 고흡수 스팟이 대략 반으로 나누어져 있음을 알 수 있었다. 따라서 종양가장자리 절반은 클러스터 1에 할당되고 내부 절반은 클러스터 2에 할당되었다. 저흡수 스팟은 클러스터 0으로 할당되었다. R의 FindAllMarkers를 사용하여 디폴트(default) 클러 스터와 비교하여 각 흡수 클러스터를 나타내는 DEG가 생성되었다. 따라서, 이후 분석을 위한 클러스터는 총 3 개의 클러스터 중 고흡수 스팟을 기준으로 종양 가장자리 절반에 해당하는 클러스터 1(표면 클러스터)과 내부 절반에 해당하는 클러스터 2(내부 클러스터)를 얻었다. 클러스터 1 및 클러스터 2 에 대한 분석 방법 MIA 분석 어떤 세포 유형이 각 흡수 클러스터와 관련이 있는지 이해하기 위해 다중 모드 교차 분석(MIA: Multimodal intersection analysis)이 수행되었다. 단일 세포 RNA 시퀀싱(scRNA-seq) 데이터세트는 4T1 동종이식 종양 모델의 이전 연구에서 얻었다 (도 13a 참조). 각 세포 유형의 마커 유전자는 FindAllMarkers의 Wilcoxon 순 위 합계 테스트에서 조정된 p-값<10-5 로 결정되었다. 또한, 조정된 p-값 < 10-5 대신 조정된 p-값 < 0.01을 한 것을 제외하고 각 공간 영역의 마커 유전자를 각 세포 유형의 마커 유전자를 결정한 과정과 유사하게 결정하였 다. 그 후, 특정 세포 유형 및 특정 공간 영역에서 각각의 공통 유전자 세트를 계산하고 랜덤 아웃풋과 비교하여 풍부 또는 감소를 측정했다. 마지막으로, 어떤 세포 유형이 해당 공간 영역에서 유의미하게 특징적인 지 알아내기 위해 Fisher의 정확 검정을 사용하여 모든 공통 유전자 세트를 분석했다. 파라미터 민감도(즉, p-값 종속성)와 MIA 분석에서 파라미터 최적화를 위한 정량적 기준의 부족으로 인해 추가 적인 검증을 위해 다른 세포 유형 매칭 알고리즘을 시도하였다. RCTD 분석 검증을 위해 다른 세포 유형 매칭 알고리즘을 실시하였다. MIA 분석을 위한 대표적인 대안적 방법으로 RCTD(Robust Cell Type Decomposition)를 사용하여 감독된 최대 가능성 추정을 통해 각 세포 유형의 분포를 결 정했다. 모든 파라미터들은 디폴트 세팅으로 설정되었다. 예를 들어 run.RCTD의 파라미터 doublet_mode는 'doublet'로 설정되었다(도 14 참조) CellDART 알고리즘 분석 또한, 단일 세포의 도메인 적응 및 공간 전사체 데이터(CellDART) 알고리즘이라는 또다른 세포 유형 추론 알고 리즘이 있다. 이 알고리즘은 미리 표지된 세포 유형이 있는 단일 세포 데이터로부터 225개의 선택된 특징 유전자들로 대립적 도메인 적응 분류를 수행했다(도 15a 내지 도 15e 참조). RCTD 알고리즘을 사용하여 전 반적인 경향을 대략적으로 확인할 수 있지만 CellDART는 작은 세포 유형 분포에 대해 보다 민감한 결과를 보여 주변 미세 환경 및 생물학적 맥락의 미묘한 차이를 정확히 포착한다는 점에서 의미가 있다. DEG 및 GO 분석 각 클러스터의 특성을 조사한 후, 흡수-유도 유전자를 확인했다. 흡수-유도 유전자와 부위-특이적 유전자를 구 별하기 위해 피어슨 상관계수를 계산하였다. 형광 강도 값은 Python의 matplotlib.pyplot에서 imread 함수를 이 용하여 위와 같은 방법으로 구하였다. 클러스터 0 vs 클러스터 1 및 클러스터 0 vs 클러스터 2를 비교하여 클 러스터 1 및 2의 DEG 분석을 실시하였다. 특정 클러스터의 각 DEG에 대해, 클러스터 내에서 유전자의 발현과 형광 강도를 연관시켰다. 회귀곡선의 기울기를 중심으로 유의한 수준을 탐색하였다. p값이 0.05 미만인 유전자 들만이 상관 계수에 따라 정렬되었다. 생성된 흡수-유도 유전자는 전체 형광 DEG 분석과 동일한 방식으로 유전 자 온톨로지(GO) 분석이 실시되었다. 이러한 방식으로 처음에 DEG 확인을 하고 나중에 상관관계 분석을 하는, 2단계 접근 방식을 수행했으며, 이는 상관관계 분석만을 실시하는 경우 신뢰할 수 없는 유전자들이 쉽게 도출되 었기 때문이다. 하위그룹 형광 분석 결과 : 클러스터 1의 형광 패턴은 혈액 관련 유전자 또는 기질 유전자와 관련이 있고 클러스터 2의 형광 패턴은 저산 소증 유발 유전자와 유의한 관계가 있음 상기 클러스터링에 기술된 바와 같이 클러스터 1 및 클러스터 2로 분류하였고, 이는 구체적으로 VGG16 클러스터 링, ROI(Region of Interest) 설정, 및 이진 맵을 ROI로 병합을 포함한 일련의 프로세스를 수행하여 흡수 클러 스터를 얻는 방식이다(도 21a). 따라서 이를 고흡수 스팟과 결합시켰다(도 22). 한편, 유전자 프로파일에 따른 비지도 계층적 클러스터링(unsupervised hierarchical clustering)도 양호한 방식으로 흡수 클러스터를 생성했 다. 반면, VGG16에서 추출한 특징들에 따른 비지도 계층적 클러스터링은 내부 스팟과 주변 스팟을 거의 구별하 지 못했다 모든 스팟들에서 비지도 계층적 클러스터링은 t-SNE 알고리즘과 유사한 결과를 나타낼 수 있었다(도 17d). MIA 분석 결과 클러스터 2에서 암세포가 우선적으로 발견되었으며, 이는 H&E 염색 영상에서의 관찰 결과와 일치하였다(도 21b). 도 21b는 클러스터 1 및 2의 MIA 분석 결과를 보여주며, 그 결과로부터 클러스터 2에 암세포 유전자가 많 음을 확인할 수 있다. 또한 예상한 대로 염증성 대식세포의 종양 내 분포와 항염증성 대식세포의 말초 분포를 관찰할 수 있다. 한편, 내피 세포 또는 섬유아세포는 클러스터 1에 우세하게 위치하였고, 이는 캡슐형 가장자 리가 종양의 기질 영역과 관련이 있음을 암시한다(도 21b의 클러스터 1 결과). RCTD 결과 클러스터 2에 비해 클러스터 1에서 내피세포와 섬유아세포의 상대적 우세 분포를 확인할 수 있었으며 이는 MIA 분석과 일치하였다(도 13). 도 13b 내지 도 13d은 RCTD 알고리즘으로부터 얻어진 세포 유형 군집의 결과을 보 여주며, 도 13b는 모든 스팟에 대한 결과를 보여주는 RCTD 이중선 누적 막대 플롯이며, 도 13c는 클러스터 1의 스팟에 대한 RCTD 이중 분포 누적 막대 플롯이고 도 13d는 클러스터 2의 스팟에 대한 RCTD 이중 분포 누적 막대 플롯이다. 그 결과로부터 클러스터 2에 비해 클러스터 1에서 내피세포와 섬유아세포의 상대적 우세 분포를 확 인할 수 있고 클러스터 2에는 암세포가 우세하게 존재함을 확인할 수 있다. CellDART의 결과 CellDART의 결과는 MIA 분석 및 RCTD에서 관찰을 입증해 주었다(도 23). CellDART 결과에 따르면 종양 조직에서 는 암세포가 우세한 반면 종양 표면에서는 내피세포와 섬유아세포가 우세함이 뚜렷하게 관찰되었다. CellDART 에서 비주류 세포 유형의 분포가 강조되었고 염증성 대식세포의 분포가 암세포의 분포와 분리되어 있다는 점은 주목할 만하다. 부위 특이적 유전자의 볼케이노 플롯은 클러스터 1과 2 사이의 유전적 프로파일에서의 뚜렷한 차이를 보여주었다 (도 21c). 도 21c는 각각 클러스터 1(위)과 클러스터 2(아래)의 부위 특이적 유전자들의 볼 케이노 플롯이다. DEG 결과 또한 각 클러스터에 대한 상위 20개 유전자를 나타내는 도트 플롯은 클러스터 1과 2의 고유성을 보여주었다(도 21d). 클러스터 1의 DEG 결과 클러스터 1의 DEG는 상위 20개 DEG 중 Hba-a2, Hba-a1, Hbb-bs와 같은 RBC 마커와 Aqp1, Col3a1, Gpx3, Apoe 및 Sparcl1과 같은 기질 관련 유전자를 관찰할 수 있었다 (표 3). 표 3 하위그룹 분석에서 클러스터 1에서 FC에 의해 분류된 상위 20개의 DEG의 리스트 Order Genelog2FC p_val_adjOrder Gene log2FC p_val_adj 1 Mpz 2.3037071.75E-0611 Ccl8 1.2290443.71E-11 2 Apod2.1569082.90E-1212 Gpx3 1.2224761.83E-13 3 Pmp221.7175710.02135113 Hba-a11.2163501.79E-09 4 Col3a11.5158414.13E-1414 Col1a11.2111846.94E-14 5 Fabp41.3307234.10E-1215 Hbb-bs1.2045831.31E-11 6 Apoe1.2992341.40E-1516 Pi16 1.1838881.25E-10 7 Sparcl11.2960221.98E-1017 mt-Nd41.1709163.20E-15 8 mt-Nd11.2873723.58E-1818 mt-Cytb1.1644171.28E-18 9 Hba-a21.2796749.70E-0619 Sparc1.1630495.99E-11 10 Aqp11.2637912.22E-0720 mt-Nd21.1514131.17E-13 Note: Stroma: Mpz, Apod, Pmp22, Col3a1, Fabp4, Apoe, Sparcl1, Col1a1 Blood vessel: Hba-a2, Hba-a1, Hbb-bs Tumor associated macrophage: Ccl8, Gpx3따라서 클러스터 1은 위 전체 형광 분석에서 표면 관련 경향 형성의 주요 원인임을 알 수 있다. 클러스터 1에 는 유의미한 클러스터 내 상관 관계가 있는 유전자는 하나만 있었다(표 4). 표 4 클러스터 1에서 형광 강도와 유의한 상관성이 있는 DEG Order GeneCorrelation CoefficientP value Order Gene Correlation CoefficientP value 1 Calm10.2237450.028424 Note: Little to do with DEGs of cluster 1 이는 유전자 발현뿐만 아니라 혈류 역학을 포함한 다른 인자가 클러스터 1에서 나노입자의 흡수에 작용했을 수 있음을 시사한다. 이러한 설명은 유일한 유의한 DEG인 Hbb-bs가 고흡수 스팟에서만 유전자 발현과 형광 강도 사 이의 유의한 상관관계를 나타내지 않았다는 시뮬레이션 결과 및 전체 DEG 분석에서의 관찰 결과와 일치했다. 클러스터 2의 DEG 결과 클러스터 1과 달리, 클러스터 2는 16개의 유전자가 유의한 상관관계를 보였고, 상향 조절되고 클러스터의 형광 강도와 양의 상관 관계가 있는 유전자는 총 31개였다(도 21e, 표 5). 도 21e는 클러스터 1(위)과 클러스터 2(아 래)의 상관계수 및 p-값 간의 관계를 보여주는 플롯이다. 표 5 클러스터 2에서 형광 강도와 유의한 상관성이 있는 DEG Order Gene Correlation CoefficientP valueOrder Gene Correlation CoefficientP value 1 Krt190.2744510.0013899 Trib30.2052300.017799 2 Dock70.2486070.00390810 Ero1l0.2004470.020702 3 Ugdh 0.2418760.00503311 Hilpda0.1985120.021987 4 Gbe1 0.2418490.00503812 Egln30.1897230.028724 5 Smarce10.2291660.00797013 Plin20.1781110.040256 6 Espn 0.2235230.00970214 Areg 0.1739920.045184 7 Bnip30.2092940.01561715 Gys1 0.1733960.045938 8 Pfkp 0.2068070.01692316 Eno2 0.1707590.049396 Note: Hypoxia: Bnip3, Ero1l, Hilpda, Egln3, Plin2 Glycolysis: Ugdh, Gbe1, Pfkp, Gys1, Eno2 Apoptosis: Bnip3, Ero1l Lipid Metabolism: Hilpda, Plin2 클러스터 2에서 유의미한 상관관계가 있는 유전자는 유전자 온톨로지(GO)에서 3가지 대표적인 생리적 기능인 포 도당 대사, 세포자연사 및 저산소증을 나타내었다(도 21i). 고밀도 암 세포가 주로 클러스터 2에 있었기 때문에 저산소 상태가 발생할 가능성이 높다. 저산소 상태로 인해 암세포는 포도당의 산화적 대사를 수행할 수 없으므 로 해당 작용이 더 활성화된다. 이 현상을 Warburg 효과라 한다. 또한 이전 연구에서는 환자의 종양에서 생 체 내 양전자 방출 단층 촬영(PET)으로 평가하였고 그 결과, 저산소증의 정도와 포도당 대사 사이에 상당한 상 관 관계가 있음을 보여주었다. 따라서 저산소 상태에서 포도당 대사가 우세하다는 것을 이해하는 것은 어렵지 않다. 이 관찰은 Pfkp, Gapdh 및 Hk1과 같은 가장 중요한 해당작용 매개체가 나타난 클러스터 2에서의 DEG 목록과 일치한다(표 6). 저산소증, 포도당 대사 및 세포자연사의 점수를 플로팅할 때 점수의 공간적 분포가 모두 공동-국재화되었으며 (도 21k), 이 분포는 나노 입자의 내부 분포와 유사했다(도 17a의 B). 표 6 하위그룹 분석에서 클러스터 2의 FC에 의해 분류된 상위 20개의 DEG 리스트 OrderGene log2FC p_val_adjOrderGene log2FC p_val_adj 1 Ndrg1 0.7399250.00010611Espn 0.4583565.89E-06 2 Slc2a1 0.5499741.06E-0612Ugdh 0.4561593.04E-06 3 Rara 0.5176171.28E-0613Id2 0.4550840.000730 4 Egln1 0.5102134.32E-0514Ftl1 0.4539193.26E-08 5 Sbf2 0.5054461.47E-0515Gapdh 0.4504105.48E-08 6 Pdk1 0.4965581.36E-0516Car9 0.4429206.30E-06 7 Areg 0.4880421.14E-0717Hk1 0.4351970.000211 8 Bnip3 0.4872120.00028618Pafah1b30.4338791.53E-05 9 Ero1l 0.4865020.00011119Eno1 0.4324030.000202 10Pfkp 0.4752452.13E-0820Ppp4r3b 0.4270870.024664 Note: Hypoxia: Ndrg1, Slc2a1, Egln1, Pdk1, Bnip3, Ero1l, Car9 Glycolysis: Slc2a1, Pdk1, Pfkp, Ugdh, Gapdh, Car9, Hk1, Eno1, Ppp4r3b Apoptosis: Bnip3, Ero1l Lipid Metabolism: Ndrg1 이와 유사하게 세포자연사(apoptosis) 관련 활성들이 당해 환경과 연관될 수 있다. 저산소 대사의 낮은 효율로 인해 암세포에서 에너지 생산 부족으로 인해, 기아 유발 세포자연사가 유발될 수 있다. 따라서 이 그룹의 경우 영양부족이 시급한 과제이기 때문에 암세포는 대체 에너지원, 지질 및 소낭 내용물을 찾으려고 했을 가능성이 매우 높다. 최근에는 저산소증과 지질 대사 사이의 연관성도 밝혀졌다. 특히, 지단백질의 엔도사이토시스는 지 단백질 수용체 관련 단백질(LRP1) 및 초저밀도 지단백질 수용체(VLDLR)의 상향 조절에 의해 향상된다. 따라서 LDL 수용체 트래피킹(trafficking)를 포함한 지질 대사에 참여하는 Ndrg1는 나노약물의 흡수에 중요한 역할을 할 수 있다. 나아가 클러스터 2의 DEG 중 하나인 Plin2(FC = 0.311197, 조정된 p val = 0.034946, cor = 0.177015, cor에 대한 p val = 0.073657)는 Hif-1α와 함께 저산소증-유도가능한 지질-관련 단백질과 관련 이 있기 때문에, 상기 추측과 연결될 수 있다. 이와 일치되게, 유사한 패턴들이 고품질 스팟 상에서 클러스터 2의 상당한 상관관계를 갖는 각 DEG 쌍의 상관 관계에서 파생된 히트맵에서 나타났다(도 21j). 예를 들어, 세트 A는 상기 세트의 서로 다른 요소들와의 전반적 인 연결성을 보여주었다. 또한 하위세트 A1은 저산소 환경을 반영하고 하위세트 A2는 포도당 대사 과정과 관련 이 있다. 흥미롭게도 Hilpda와 Plin2 사이의 연속성조차도 예상대로 관찰되었다. 그러나 세트 A와 B의 관련성이 낮은 것으로 관찰되었다. 따라서 히트맵은 전부는 아니지만 대부분의 유전자들이 공통의 생물학적 맥락으로 인 한 것일 수 있는 강력한 연결성을 나타낸다는 것을 보여주었다. 클러스터링 2 : 클러스터 0 내지 클러스터 7로의 분류 상기 클러스터링 1과 동일한 방식으로 하여, ImageJ 프로그램의 seeded region growing 플러그인은 사용자가 적 절한 seed를 중심으로 동일한 질감을 갖는 영역을 설정해 주는 도구이며, 이 도구를 사용하여 ROI를 총 7개로 설정하고 이를 이진 변환 맵과 병합시켜 7개의 형광이 높은 스팟들의 클러스터들을 생성하였다. 형광이 낮은 스 팟은 모두 클러스터 0으로 할당되었다(도 24 참조). 클러스터 0 내지 클러스터 7의 DEG 분석 형광인 높은 스팟들로 구성된 7개의 각 클러스터와 클러스터 0을 비교하여 앞에서 사용한 DEG 분석법과 동일하 게 실시하였다.클러스터 0 내지 클러스터 7의 MIA 분석 각 클러스터와 관련된 세포 유형을 파악하기 위해 앞에서 사용한 MIA 분석법과 동일하게 MIA 평가를 수행하였다. 클러스터 0 내지 클러스터 7의 DEG 분석 결과 DEG 분석 결과에서는 클러스터 6 및 7의 대부분의 DEG 값이 모두 1에 가까운 값을 보여 분명한 위양성 신호를 확인할 수 있다. 나아가 총 형광은 주로 클러스터 0, 1, 4의 순서로 분포되었으며, 클러스터 0의 형광들은 최대 형광 섭취 정도 의 25% 이하의 낮은 섭취를 가지는 형광이지만, 클러스터가 포함하는 스팟이 많기 때문에 높게 나타나는 경향이 있었으며, 평균 형광 세기가 클러스터 0에서 가장 낮은 것으로 보아 이를 증명할 수 있다. 평균 형광 세기와 총 형광 세기의 도표가 반대되는 경향을 보이는 것으로 보아, 총 형광 세기에 대해 클러스터 내 스팟의 수가 지 배적으로 관여하는 것을 확인할 수 있었다(도 25a 및 25b, 표 7). [표 7] 각 클러스터의 총 형광 강도 및 평균 형광 강도"}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "평균 형광 세기로 보았을 때, 클러스터 1, 4 및 5의 순으로 리포좀 섭취에 관여하는 것을 알 수 있다. dot plot을 통해 각 클러스터별 DEG 상위 10개의 발현 정도를 도식화하였다(도 26). 클러스터 1이 가장 높은 양의 평균 형광 세기를 나타냈다는 사실과 일치하게 클러스터 1의 DEG는 전체 형광 분석 결과와 매우 유사했다. Plvap, Pecam1, 및 여러 헤모글로빈 유전자의 순위를 고려하면 클러스터 1에서 발견된 형광 패턴은 주로 혈관과 관련된 섭취임을 확인할 수 있다. 또한, 상관성 분석 결과, 클러스터 4에서 22개, 클러스터 5에서 6개의 DEG가 형광 세기와 양의 상관관계가 있는 것으로 확인되었다. 앞의 분석에서 클러스터 1, 4, 및 5가 주로 리포좀 섭취에 관여함을 알 수 있는데, 이 중 클러스터 1에서는 유전자 발현과 형광 세기의 상관관계가 발견되지 않았다. 이 결과를 통해 클러스터 1에서는 혈관을 통한 수동 작용에 의해 리포좀 섭취가 일어나지만 종양 내부의 클러스터인 4와 5에서는 능동 작용에 의 해 리포좀 섭취가 일어남을 알 수 있다. 클러스터 4에서 상관관계가 있었던 유전자를 확인해 보았을 때, 저산 소증, 포도당 대사 및 세포 사멸 기전에 관련한 유전자들이 지배적이었다(도 27a 및 27b, 표 8).[표 8] 클러스터 4에서 상관성 있는 DEG"}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "이를 통해 클러스터 4 내부에 저산소 상태가 있고, 이를 통해 와버그 효과에 의한 종양 세포들의 혐기적 포도당 대사 과정이 이루어짐과 동시에 저산소 상태로 인한 세포 사멸이 이뤄지고 있음을 유추할 수 있다. 이와 더불 어, Ndrg1, Hilpda 등의 지질 대사 관련 유전자가 상위에서 상관관계를 보이고 있음은 저산소 상태의 종양 세포 들이 대체 에너지원인 리포좀의 구성성분인 지질을 이용해 대사하려는 종양 내 상황을 추측해 볼 수 있다. 반면, 클러스터 5에서는 MIA 분석과 마찬가지로 다양한 면역 관련 유전자들이 나타났다. 클러스터 4에서처럼 특정한 생물학적 기전이 발견되지는 않았지만, 상관관계가 있었던 유전자들이 면역 체계와 관련이 있을 뿐 아니 라 혈관 신생, endosome, lysosome, phagosome 등과 관련된 유전자라는 사실은 클러스터 5에서의 나노입자의 섭 취 기전에 대해 생각할 수 있다(도 28a 및 28b, 표 9). [표 9] 클러스터 5에서 상관성 있는 DEG"}
{"patent_id": "10-2022-0042378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "클러스터 0 내지 클러스터 7의 MIA 분석 결과 MIA 결과, 클러스터 2, 3, 4, 5에서 암세포 비율이 높았으며 이는 H&E 염색 이미지 결과와 일치했다(도 29). 또한, 클러스터 1에서는 endothelial cell, fibroblast cell이 많이 발견되었고, 이는 캡슐 형태의 가장자리 부분이 종양의 stroma 부분과 관련이 있음을 시사한다. 흥미롭게도, 클러스터 2와 4는 비슷한 패턴의 발현을 보이지만 클러스터 5는 이들과 상당히 다른 패턴을 보였다. 이는 종양 내에서도 영역에 따라 다른 생물학적 메 커니즘이 이뤄지고 있음을 의미한다. 클러스터 0, 6, 7에서 명백한 세포 유형을 찾을 수 없었고, 이는 클러스 터 6 및 7에서 위양성 신호를 나타낼 수 있는 가능성을 시사한다. 그러므로 분석을 위해서는 10개 이하의 스팟 을 포함하는 클러스터링은 지양해야 함을 확인할 수 있다. 결론 수동 경로, 투과상승 및 저류 효과(EPR) 이외의 종양 내 미세 환경을 결정하는 유전자가 형광 나노 입자의 종 양 내 흡수를 지배한다고 말할 수 있다. 이 가설은 저산소 환경에서 나노 입자의 흡수가 향상되고, 활성 세 포의 소기관으로서 재조명받고 있는, 지질 방울에서 친유성 약물의 격리를 보여주는 연구(16, 17, 18)와 일치하 기 때문에 주목할 만하다. 단식과 같은 영양소 신호 재프로그래밍조차도 약물의 거대음세포증(macropinocytosis)을 증가시키는 것으로 밝 혀졌다. 나아가 거대음세포증(macropinocytosis)을 포함한 여러 경로가 협력하여 영양 스트레스를 완화시 키는 것으로 생각되었다. 산 점도에서 유전자 발현에 의해 밝혀진 통계적 변이는 유전자 발현 자체는 말할 것 도 없고 약물의 흡수와 관련된 다양한 인자들을 암시할 수 있다. 본 발명에서는 나노약물의 흡수를 결정하는 요인 또는 나노약물의 생리 활성과 관련이 있는 분자적 마커를 탐색 하기 위해, 이미지 처리, AI 알고리즘 기반 유전자 분석, 생물학적 맥락, 및 복잡한 물질 전달에 대한 유연한 해석을 포함한 학제간 개념을 모두 관련시켜 실시해 보았다. 전체 형광 분석에서는 약물 흡수가 혈액 유체 역학에 의해 영향을 받을 수 있음을 보여주었고, 하위그룹 형광 분석에서는, 클러스터링 1에서는 클러스터 1의 형광 패턴은 혈액 관련 유전자 또는 기질 유전자와 관련이 있고 클러스터 2의 형광 패턴은 저산소증 유발 유전자와 유의한 상관관계가 있을 수 있음을 밝혀내었다. 클러스터링 2에서는 클러스터 0, 6, 7에서 명백한 세포 유형을 찾을 수 없었고, 이는 클러스터 6 및 7에서 위양성 신호를 나타낼 수 있는 가능성을 시사하고, 클러스터 1, 4, 및 5가 주로 리포좀 섭취와 관련되며, 클러스터 1에서는 혈 관을 통한 수동 작용에 의해 리포좀 섭취가 일어나지만 종양 내부의 클러스터인 4와 5에서는 능동 작용에 의해 리포좀 섭취가 일어남을 알 수 있고, 클러스터 4에서 저산소증, 포도당 대사 및 세포 사멸 기전에 관련한 유전 자들이 지배적이었다. 여기에 개시된 방법은 고형 종양 및 나노 약물뿐만 아니라 다양한 조직 및 기타 형태의 약물의 새로운 분자 경 로를 확인하고 충족되지 않은 질병에 대한 전략을 탐색하는 데 활용될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9a 도면9b 도면9c 도면9d 도면9e 도면9f 도면10 도면11a 도면11b 도면11c 도면11d 도면11e 도면11f 도면11g 도면11h 도면11i 도면11j 도면11k 도면12a 도면12b 도면13a 도면13b 도면13c 도면13d 도면14 도면15a 도면15b 도면15c 도면15d 도면15e 도면16a 도면16b 도면16c 도면17a 도면17b 도면17c 도면17d 도면17e 도면17f 도면18 도면19a 도면19b 도면19c 도면19d 도면19e 도면20a 도면20b 도면20c 도면21a 도면21b 도면21c 도면21d 도면21e 도면21f 도면21g 도면21h 도면21i 도면21j 도면21k 도면22 도면23a 도면23b 도면23c 도면23d 도면23e 도면24 도면25a 도면25b 도면26 도면27a 도면27b 도면28a 도면28b 도면29"}
{"patent_id": "10-2022-0042378", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 양태에 따른 분자적 마커의 탐색 방법의 흐름도이다. 도 2는, 도 1의 본 발명의 일 양태에 있어서 표지물질에 의한 조직 영상 획득(S10) 단계에 대한 구체적 예시를 보여주는 흐름도이다. 도 3은, 도 1의 본 발명의 일 양태에 있어서 관심 조직의 공간 정보를 공유하는 전사체 정보 획득 단계(S20)를구현하는 일 방법을 보여준다. 도 4는, 도 1의 본 발명의 일 양태에 있어서, 조직 내 전사체 정보 추출(S40) 단계의 구체적 예시를 보여주는 도면으로, 여기서 예컨대 SPADE, DEG, CellDART, MIA, RCTD, 유전자 온톨로지 분석과 같은 잘 알려진 분석 알고 리즘 또는 분석 방법을 사용할 수 있다. 도 5는, 도 1의 본 발명의 일 양태에 있어서, 분자적 마커 탐색(S50) 단계의 구체적 예시를 보여준다. 도 6은 본 발명의 일 구현예에 따른 분자적 마커 탐색 방법의 흐름도이다. 도 7은 본 발명의 일 양태들에 따른 방법에 있어서 각 단계에서 적용될 수 있는 구체적 방법 및 분석법들에 대 해 단계 별로 설명하는 도면이다. 도 8은 SPADE 알고리즘을 사용하여 조직 영상을 여러개의 패치들로 나누고 이 패치들에 대해 딥러닝 기반 증강 신경망을 이용한 이미지 인식 프로그램인 VGG16(Visual Geometry Group)에 의해 주성분(PC)을 추출하는 방식을 보여준다. 도 9a 내지 도 9f는 획득한 형광 영상을 공간 전사체 스팟에 맞추기 위해 Python 기반 오픈 소스 DiPY 패키지에 서 제공하는 알고리즘을 사용시 영상 정합 프로세스의 프로그램 구현예를 보여준다. 도 10은 병합의 정도에 따른 고흡수 스팟의 공간 특징 플롯(plot)이다. 병합의 정도를 유클리드 거리로 나타내 었으며, 여기서 임의의 고흡수 스팟으로부터 주변 스팟이 고흡수 스팟으로 할당된다. 도 11a 내지 도 11k는 조직 영상에 대해 SPADE 알고리즘에 의한 공간 유전자 발현 패턴 분석의 프로그램 구현예 를 보여준다. 도 12a 내지 도 12b는 클러스터링하는 수단으로 K 평균 군집화의 프로그램 구현예를 보여준다. 도 13a 내지 도 13d은 클러스터링 1의 RCTD 알고리즘으로부터 얻어진 세포 유형 군집의 결과를 보여주며, 도 13a는 세포 유형 발생을 보여주는 파이(Pie) 플롯이고 도 13b는 모든 스팟에 대한 결과를 보여주는 RCTD 이중 분포 누적 막대 플롯이며, 도 13c는 클러스터 1의 스팟에 대한 RCTD 이중선 누적 막대 플롯이고 도 13d는 클러 스터 2의 스팟에 대한 RCTD 이중 분포 누적 막대 플롯이다. 도 14는 RCTD 알고리즘의 파라미터의 설정 예를 보여준다. 도 15a 내지 도 15e는 CellDART 알고리즘에 의해 단일 세포 데이터로부터 225개의 선택된 특징 유전자들로 대립 적 도메인 적응 분류를 수행하는 데 필요한 프로그램 구현예를 보여준다. 도 16a는 본 발명의 일 구현예에 따라 Dil-로딩된 리포좀의, 투사 전자 현미경 사진(TEM)(상단), 동적 광산란 기구(DLS) (중단) 및 마이크로플레이트 리더(하단)의 특성 프로파일 도면이다. 도 16b는 랫트의 종양 모델에 Dil-로딩된 리포좀을 정맥 주사하고 0시간, 4시간 및 24시간 후의 in vivo 형광 영상 사진으로, 리포좀이 각 장 기에 축적되었음을 보여준다. 도 16c는 상기 리포좀 주입 24시간 후 주요 장기(간, 비장, 신장, 심장, 폐, 종양 및 근육) 및 종양의 Ex vivo 형광 영상이다. 도 17a의 A는 전체 조직학적 특징을 보여주는 H&E 염색 영상이고, 도 17a의 B, C, D 및 도 17b는 형광 영상을 이진 맵으로 처리할 때 거치는 여러 단계를 보여준다. 구체적으로 도 17a에서 B는 형광 영상 정규화, C는 정합 영상, D는 이진 변환 영상을 각각 보여주며, 도 17b는 이진 변환 영상에 상응하여 얻어진 이진 맵을 도시한다. 도 17c는 바이올린(violin) 플롯(좌) 및 공간 맵핑(우)에 의해 플롯팅된 RNA 전사체 개수를 보여준다. 도 17d 는 유전자 발현 패턴에 따른 클러스터링을 조사한 결과로 유전자 특징에 따라 스팟의 t-SNE 투사를 보여준다. 도 17e는 거리에 따른 평균 형광 강도를 도시하며, 이는 표시된 거리에 따라 색이 입혀진 지도(좌측) 및 왼쪽의 가장자리 표면으로부터 거리에 따른 평균 형광 강도를 보여주는 그래프(우측)이다. 도 17f는 전체 형상 분석에 서 Pecam1 및 Cd34의 공간 특징 플롯이다. 도 18은 Fick의 법칙에 따른 수치 분석 결과로, 서로 다른 D/Δx2과 반복 수에 따른 C/k로 표시된 Fick 분산의 시뮬레이션 결과를 보여준다. 도 19a 내지 도 19e는 전체 형광 분석 결과를 보여준다. 도 19a는 유일한 DEG인 Hbb-bs의 공간 특징 플롯이고, 도 19b는 SPADE 알고리즘과 PCA 알고리즘에 의해 생성된 이미지 잠재적 특징들인 PC1, PC2, PC3을 보여주며, 이 들 각각은 주성분 1, 주성분 2, 주성분 3을 의미한다. 도 19c는 상위 1000개의 변수 유전자들의 개선된 볼 케이노 플롯이다. 도 19d는 가장 높은 FC(fold change)를 갖는 상위 8개의 SPADE 유전자들의 공간 특징 플롯이다. 도 19e는 생물학적 과정(BP), 세포 성분(CC), 및 분자적 기능(MF)에 따른 각각 상향 조절된 상위 30개의 유 전자들의 PC1 SPADE 유전자의 GO(유전자 온톨로지) 분석 결과이다. 도 20은 H&E 염색 이미지로부터 SPADE 알고리즘의 결과를 보여주며, 도 20a 내지 20c는 각각 SPADE 알고리즘의 각 주성분, 즉 PC1(도 20a), PC2(도 20b), PC3(도 20c)에서 상위 SPADE 유전자들과 각 GO 분석 결과 및 상위 1000개의 변수 유전자들의 개선된 볼케이노 플롯이다. 여기서 각 PC의 패치 크기는 서로 독립적으로 상위 10개 의 유전자들의 가장 큰 평균 log FC 값을 갖도록 결정되었다. 도 21은 하위 그룹의 형광 분석의 결과를 도시하며, 도 21a는 정합 형광 이미지로부터 시작하여 ROI(관심 영 역)를 설정하고, 이를 전체 형광 분석에서 작성한 이진 맵과 병합하여 형광 맵을 얻는 일련의 과정을 보여준다. 도 21b는 클러스터 1 및 2의 MIA 분석 결과를 보여주며, 도 21c는 클러스터 1(좌)과 2(우)의 흡수 부위-특이적 유전자들의 볼케이노 플롯을 보여준다. 도 21d는 클러스터 1과 2의 상위 20개 DEG의 발현을 보여주는 닷트 플 롯이고, 도 21e는 클러스터 1(위)과 2(아래)에서 상관계수 및 p-값 간의 관계를 보여주는 볼케이노 플롯이다. 도 21f는 병합의 정도에 대한 결정을 보여주고, 도 21g는 클러스터 2와 유의한 상관관계를 가진 4개의 예시적 DEG, 즉, Bnip3, Ero1l, Hilpda 및 Plin2의 특징 플롯이고, 도 21h는 클러스터 2에서 유의한 상관관계를 가진 모든 DEG의 스캐터(scatter) 플롯이다. 도 21i는 클러스터 2의 유의한 상관관계 있는 DEG에 대한 BP, CC 및 MF 에 따른 GO 분석 결과를 보여주며, 도 21j는 클러스터 2와 유의한 상관관계를 가진 각 쌍의 DEG들 간의 상관성 으로부터 도출된 히트맵(Heatmap)이다. 도 21k는 총 유전자들, 저산소증 유전자, 포도당 대사 유전자, 및 세포 자연사 유전자로부터 도출된 점수들의 공간 특징 플롯으로 상기 점수는 Seurat package의 AddModuleScore 로 계 산되었다. 도 22는 파라미터 K (K=3, 4, 또는 5)에 따른 KNN 평균 군집화의 결과를 도시하며, 여기서 다른 모든 파라미터 들은 보충 코드에서 디폴트로 세팅되었다. 이 알고리즘은 밝기 구동 방식으로 작동됨을 관찰할 수 있다. 이 알 고리즘은 이미지 내 패턴을 인식하여 K=4일 때 비로소 종양의 표면과 내부를 구분짓기 시작했다. 도 23은 CellDART 알고리즘의 결과이다. 도 23a는 고형 종양 모델의 4T1 세포에서 얻어진 단일 세포 RNA 시컨싱 데이터에서 세포 유형별로 표시된 UMAP 플롯이다. Leiden 알고리즘이 세포 유형 분류의 검증에 사용되었다. 도 23b는 각 세포 유형 별로 조직 내 분포 프로파일을 보여주는 공간적 특징 플롯이다. 도 23c, 23d 및 23e는 각각 순서대로 모든 스팟들(도 23c), 클러스터 1(도 23d), 클러스터 2(도 23e)에서 CellDART 알고리즘으로부터 도출 된 각 세포유형 별로 약물 분포를 보여주는 파이 차트(Pie chart) 및 표이다. 도 24는 ImageJ 프로그램을 이용하여 ROI를 총 7개로 설정하고 이를 이진 맵과 병합하여 클러스터 0 내지 클러 스터 7로 클러스터링하는 일련의 과정을 보여주는 도면이다. 도 25a는 클러스터링 2에서 각 클러스터의 총 형광 세기를 보여주는 막대 그래프이고, 도 25b는 각 클러스터의 평균 형광 세기를 보여주는 막대 그래프이다. 도 26은 클러스터링 2에서 dot plot을 통해 각 클러스터별 DEG 상위 10개의 발현 정도를 도식화한 도면이다. 도 27a는 클러스터링 2의 클러스터 4에서 상관성 있는 상위 8개의 DEG의 Scatter plot이고, 도 27b는 클러스터 링 2의 클러스터 4에서 BP, CC 및 MF에 따른 상관성 DEG의 GO 분석 결과를 보여주는 도면이다. 도 28a는 클러스터링 2의 클러스터 5에서 상관성 있는 상위 8개의 DEG의 Scatter plot이고, 도 29b는 클러스터 링 2의 클러스터 5에서 BP, CC 및 MF에 따른 상관성 DEG의 GO 분석 결과를 보여주는 도면이다. 도 29는 클러스터링 2의 각 클러스터별 MIA 분석 결과이다."}
