{"patent_id": "10-2023-0093664", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0014154", "출원번호": "10-2023-0093664", "발명의 명칭": "딥러닝 알고리즘을 이용한 음성기반 아동특성 분석 시스템", "출원인": "김기쁨", "발명자": "김기쁨"}}
{"patent_id": "10-2023-0093664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "아동의 특성 검사를 위해 아동과 대화를 수행하는 대화부;대화 데이터에서 아동의 특성 분석을 위한 데이터를 분류하고 특성 정도를 분석하여 수치화 하는 분석부로 이루어져 아동과 대화를 자동 수행하고 수집된 대화 데이터로 아동의 특성을 분석하여 제공 가능한 딥러닝 알고리즘을 이용한 음성기반 아동특성 분석 시스템."}
{"patent_id": "10-2023-0093664", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "아이들과의 대화를 통해 특성을 분석하기 위해서, 자연스러운 대화를 유도하고 대화내용을 특성별로 분류하고 특 성의 정도를 분석하는 음성기반 아동특성 분석 시스템으로 아이와 자연스러운 대화를 유도하는 대화생성부, 대화 내용을 분석가능한 특성별로 분류하는 대화분류부, 분류한 대화 데이터의 특성정도를 분석하는 대화분석부로 구 성된다. 공개특허10-2025-0014154 CPC특허분류 G10L 17/02 (2013.01) G10L 25/48 (2013.01)명 세 서 청구범위 청구항 1 아동의 특성 검사를 위해 아동과 대화를 수행하는 대화부; 대화 데이터에서 아동의 특성 분석을 위한 데이터를 분류하고 특성 정도를 분석하여 수치화 하는 분석부로 이루 어져 아동과 대화를 자동 수행하고 수집된 대화 데이터로 아동의 특성을 분석하여 제공 가능한 딥러닝 알고리즘 을 이용한 음성기반 아동특성 분석 시스템. 발명의 설명"}
{"patent_id": "10-2023-0093664", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 딥러닝 알고리즘을 이용하여 아동특성진단을 위한 대화진단검사의 수행과 특성분석 결과를 제공하는 음성기반 아동특성 분석 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0093664", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "영유아기는 뇌 발달의 핵심 기간이며, 감각 체계 발달과 사회적 상호작용의 시작이 활발히 일어나는 시기이다. 이 기간동안 아동은 인지, 언어, 사회정서적 기능을 발달시키고 사회적 규칙과 기대를 습득한다. 이 시기에 미리 아동의 특성을 파악하고 필요에 맞춰 개입하는 것이 아동의 발달 지연이나 어려움을 조기에 대 처하고 아동의 발달 가능성을 발휘하는데에 긍정적인 영향을 미친다는 다양한 증거들이 있으며, 양육자들은 아 동의 특성을 이해함으로써 개인화된 양육이 가능하고 아동과의 의사소통이 강화되며 갈등 예방과 해결에 도움이 되고 아동 개인의 성장 영역을 발견할 수 있기 때문에 양육자들의 아동 특성 파악에 대한 필요가 증대하고 있다. 이에 아동의 특성을 검사하기 위해서 다양한 도구들이 개발되어 있으며, 우리나라에서 사용되고 있는 아동발달 검사 도구에는 아동의 성격 특성을 평가하기 위한 K-PELS, 아동의 인지 능력을 평가하기 위한 K-WISE, 아동의 사회적 불안 정도를 평가하기 위한 K-SAS, 영유아의 발달 수준을 평가하는 K-DAS-II, 아동의 자폐 스펙트럼 장 애를 진단하기 위한 K-ADI-R 등이 있고 일반적으로 외국에서 사용되는 진단검사 도구를 번안하여 표준화한 것이다. 이러한 특성 검사 도구들로 아동 특성 검사를 수행함에 있어서 질문지를 통한 설문검사는 피검자인 아동의 특성 상 성인과 같이 원활히 수행하기 쉽지 않기 때문에 전문가의 판단 하에 아동의 연령대와 수준에 맞춘 수준별 진 단검사지를 수행하거나, 전문가가 직접 아동의 행동을 관찰 또는 인터뷰 및 상담을 통해서 아동의 특성을 파악 하게 된다. 이에 전문가의 이론과 경험적 근거를 바탕으로 아동의 특성에 대한 정확한 결과 도출이 가능하나 진 단에 있어 많은 비용과 시간이 소요되는 것이 사실이다. 또한 아동이 질문지를 작성하기 어렵기 때문에 양육자가 대신 작성하여 검사를 수행하는 경우도 보통이지만, 이 때에 양육자의 주관적인 바람이나 생각이 질문지 작성에 반영되기 때문에 아동을 직접 관찰하여 특성을 분석하 는 것에 비해 분석결과의 정확도가 떨어질 수 있다. 아울러 양육자는 일상생활에서 아동의 실제 행동에 대한 관찰과 의사소통 및 교류를 하기 때문에 아동에 대한 많은 정보들을 가지고 있지만, 아동의 특성과 관련된 전문지식이 없기 때문에 전문가처럼 아동의 특성을 분석하 기 어렵다. 이에, 실생활에서 아동의 특성을 분석하기 위한 대화를 직접 수집하고 양육자에게 아동의 특성 분석 결과를 비 용과 시간에 구애받지 않고 제공 가능한 보급화된 아동특성분석 도구의 개발이 절실히 요구된다."}
{"patent_id": "10-2023-0093664", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래 기술의 문제점을 해결하기 위한 것으로서, 아동특성검사 기준에 근거하여 특성을 진단하기 위한 대화 수행 용 인공지능 모델을 통해 아동과의 대화를 진행하고 아동의 실제 행동을 바탕으로 아동의 특성별 수준을 분석하 여 양육자가 지속적으로 아동의 특성과 변화과정, 대응방안에 대해 파악해 볼 수 있는 보편화된 아동특성검사 도구로서 이용될 수 있는, 아동특성진단을 위한 자동화된 인터뷰 기반 검사를 수행하는 아동특성검사 장치 및 방법을 제공하려는 것을 목적으로 한다."}
{"patent_id": "10-2023-0093664", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 아동특성검사 장치는, 사용자 단말로부터 아동특성진 단을 위해 진단검사기준에 따른 질문을 던지고 아동의 답변을 받아서 답변에 대한 반응 및 질문을 이어감으로써 아동과의 대화를 통해 아동의 특성 관련 인터뷰 정보를 획득하는 대화부; 상기 아동과의 인터뷰 정보를 고려하 여 대화 데이터 내 질문을 특성별로 분류하고, 분류된 질문-답변을 분석하여 특성 정도를 수치화 제공하는 분석 부를 포함할 수 있다. 또한, 상기 대화부에서는 아동의 특성 관련 인터뷰 정보를 획득하기 위한 아동특성검사 질문 목록을 포함하고, 대화부 내에 질문 생성 알고리즘과 질문 생성 모델의 프롬프트를 통해 아동의 연령과 수준에 맞춰서 대화를 생 성하는 질문생성모델을 포함할 수 있다. 또한, 상기 분석부에서는 아동의 특성을 파악하기 위한 아동과의 대화 내 질문-답변 데이터 쌍에 대해서 질문의 특성 분석을 위한 종류를 분류하는 질문 분류모델과 분류된 개별 영역별 특성에 대한 특성의 수치를 분석하는 특성 분석모델을 포함할 수 있다."}
{"patent_id": "10-2023-0093664", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 해결 방안에 의하면, 아동특성분석을 위한 검사와 결과를 제공하는 아동특성검사 장치 및 방 법을 제공함으로써, 아동특성분석을 양육자가 직접 원할 때 주기적으로 확인할 수 있으면서도 전문가 수준의 분 석 결과를 전문가 없이도 제공받을 수 있기 때문에 소요비용을 절감할 수 있고. 양육자가 아동을 효과적으로 돌 볼 수 있도록 아동의 현재 특성 상황을 파악하여 제공해주는 도구로서 이용되도록 할 수 있다."}
{"patent_id": "10-2023-0093664", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여 기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계 없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우 뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분 이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하, 첨부된 도면들에 기초하여 본 발명의 일 실시예에 따른 딥러닝 알고리즘을 이용한 음성기반 아동특성 분 석 시스템 및 방법을 보다 상세하게 설명하도록 한다. 본 발명의 일 실시예에 따른 딥러닝 알고리즘을 이용한 음성기반 아동특성 분석 시스템은 대화부, 분석부를 포 함한다. 본 발명의 일 실시예에 따른 딥러닝 알고리즘을 이용한 음성기반 아동특성 분석 시스템은 아동특성검사 질문 문 항에 근거하여 대화생성 알고리즘에 따라 아동이 이해하기 쉬운 언어로 변환된 질문 문장을 생성하고, 문장의 음성 변환 기술(TTS, Text-to-Speech)을 통해 아동에게 음성으로 질문을 수행한다. 이 때에, 아동특성검사 질문 문항은 사전 연구된 아동의 특성을 진단하기 위한 다양한 영역별 진단검사의 질문 문항이 될 수 있으며, 다중지능, JTCL 검사 등 다양한 질문 문항이 그 예가 될 수 있다. 아동은 음성으로 전달된 질문에 반응하여 답변을 수행하고, 이는 분석 시스템에서 음성의 문장 변환 기술(STT, Speech-to-Text)을 통해 문장으로 변환되어 데이터의 정제를 거쳐서 대화생성 알고리즘을 통해 아동의 답변에 대한 반응과 다음 질문으로의 연계 문장을 생성하는데에 반영된다. 시스템의 대화부 내에서 자동으로 이루어지는 아동의 특성 분석을 위한 대화를 통해 수집된 인터뷰 데이터는 분 석부에서 데이터의 분류 및 특성별 수치화를 통해 최종 분석 결과를 양육자에게 전달한다. 아동의 인터뷰 데이터가 분석부에 전달되면, 먼저 인터뷰 데이터에서 특성 분석을 위한 유의미한 질문들을 추출 하기 위해서 인터뷰 데이터 내에 질문-답변 데이터를 정제하고, 특성별 데이터 분석을 위해서 먼저 질문을 특성 분류모델을 통해 특성별로 분류한다. 분류된 질문-답변 데이터를 특성별 분석모델에 입력하여 개별 특성별 수치 화된 분석결과를 도출하며, 이를 취합하여 전체 특성에 대한 수치화된 결과를 생성한다."}
