{"patent_id": "10-2021-0156152", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0070149", "출원번호": "10-2021-0156152", "발명의 명칭": "온라인 건축사 매칭 플랫폼", "출원인": "홍승범", "발명자": "홍승범"}}
{"patent_id": "10-2021-0156152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "건축주; 와 건축가; 가 소속된 온라인 플랫폼; 으로, 상기 건축주; 가 건축주가 플랫폼에 제공하는 정보; 를 바탕으로 상기 건축가; 에게 플랫폼이 건축가에게 제공하는 정보; 를 제공하고 이를 바탕으로 상기 건축주; 와 상기 건축가; 를 매칭하는 것을 포함하여 구성되는 것을 특징으로 하는 온라인 건축사 매칭 플랫폼"}
{"patent_id": "10-2021-0156152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서상기 플랫폼; 은상기 건축주; 가 견적 제안 요청 단계; 를 통해 희망 정보를 입력하면인공지능의 건축가군 결정 단계; 를 바탕으로 지정 분야의 1~2군 건축가를 추리며1순위 건축가 투찰 의사 확인 단계; 를 통해 1순위 건축가군에게 투찰 의사를 물은 뒤 1순위 건축가군 투찰 인원 확인 단계; 를 거쳐 2순위 건축가 투찰 의사 확인 단계; 혹은 견적 제출 기한 설정 및 견적 요청 단계;로 진행되는데상기 1순위 건축가군 투찰 인원 확인 단계; 에서 1순위 건축가군의 특정 인원 이상이 투찰한 경우에는 상기 견적 제출 기한 설정 및 견적 요청 단계; 로 진행되며 그렇지 않은 경우에는 상기 2순위 건축가 투찰 의사 확인단계; 로 진행되며상기 2순위 건축가 투찰 의사 확인 단계; 에서는 1~2순위 건축가군 투찰 인원 확인 단계; 를 진행하며, 이 과정에서 1~2순위 건축가군의 특정 인원 이상이 투찰한 경우에는 상기 견적 제출 기한 설정 및 견적 요청 단계; 로진행되며 그렇지 않은 경우에는 투찰 실패 및 견적 요청비 반환 단계;로 진행되며상기 견적 제출 기한 설정 및 견적 요청 단계; 로 진행되는 경우 건축가의 견적 및 컨셉 제안서 작성 단계; 와견적 요청비 중 일부 (착수비) 전달 단계; 를 거친 뒤 건축주 의사 확인 단계; 를 진행하는데이 때 상기 건축주 의사 확인 단계; 는 투찰한 여러 건축가들의 견적과 제안서 중 건축주가 선호하는 제안이 있을 경우에는 나머지 견적 요청비 전달 단계; 와 매칭 성사 단계; 를 거쳐 매칭이 성사되며, 건축주가 선호하는제안이 없을 경우에는 견적 재제안 의사 확인 단계; 를 거쳐 투찰 실패 단계; 또는 상기 견적 제안 요청 단계;로 되돌아가는 흐름을 포함하여 구성되는 것을 특징으로 하는 온라인 건축사 매칭 플랫폼"}
{"patent_id": "10-2021-0156152", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 건축주와 건축가가 소속된 온라인 플랫폼으로, 건축주가 건축주가 플랫폼에 제공하는 정보를 바탕으로 상기 건축가에게 플랫폼이 건축가에게 제공하는 정보를 제공하고 이를 바탕으로 상기 건축주와 상기 건축가를 매 칭하는 것을 포함하여 구성되는 것을 특징으로 하여 건축주들로 하여금 온라인 플랫폼을 통해 더욱 쉽게 건축가 를 구할 수 있으며 건축주들이 자신이 원하는 옵션과 정보를 입력함으로써 여러 건축가들의 견적을 쉽게 받아봐 비교분석한 뒤 결정할 수 있고, 건축가들은 기존에 비해 고객을 유치하는 판로를 다양화할 수 있다는 장점이 있 는 서비스를 제공한다."}
{"patent_id": "10-2021-0156152", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 온라인 건축사 매칭 플랫폼에 관한 것으로, 더욱 상세하게는 온라인상에서 건축주가 더욱 저렴한 가 격으로 원하는 옵션의 건축가를 찾을 수 있게 하기 위해 역경매 방식을 기반으로 구축된 온라인 건축사 매칭 플 랫폼에 관한 것이다."}
{"patent_id": "10-2021-0156152", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래기술에는 건축주가 원하는 옵션의 건축가를 찾기 위해 일원화된 플랫폼이 존재하지 않아 건축주가 여러 경 로를 통해 건축가를 찾는데 어려움이 있는 문제점이 있었다. 또한 여러 경매/역경매 매칭 플랫폼이 운용되고 있 으나 건축주-건축사 매칭의 경우 관련 플랫폼이 부재하다는 문제점이 있었다."}
{"patent_id": "10-2021-0156152", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2021-0156152", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 전술한 종래의 제반 문제점을 해결하기 위하여 안출된 것으로, 이러한 발명의 목적은 건축주 로 하여금 온라인 상에서 자신이 원하는 여러 조건을 제시해 여러 건축가들의 비용 견적을 받아볼 수 있게 함은 물론, 건축가에게금 기존에 비해 많은 고객 유치 판로를 제공할 수 있으며, 신진 건축가들이 가격 경쟁력을 바 탕으로 기성 건축가들과 경쟁할 수 있는 기회를 제공하도록 한 온라인 건축사 매칭 플랫폼을 제공함에 있다."}
{"patent_id": "10-2021-0156152", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 온라인 건축사 매칭 플랫폼에 있어서 건축주; 와 건축가; 가 소속된 온라인 플랫폼; 으로, 상기 건축주; 가 건축주가 플랫폼에 제공하는 정보; 를 바 탕으로 상기 건축가; 에게 플랫폼이 건축가에게 제공하는 정보; 를 제공하고 이를 바탕으로 상기 건축주; 와 상 기 건축가; 를 매칭하는 것을 바탕으로 하는 플랫폼을 포함하여 구성된다. 플랫폼의 주요 의사 처리 단계를 자세히 하자면 상기 건축주; 가 견적 제안 요청 단계; 를 통해 희망 정보를 입력하면 인공지능의 건축가군 결정 단계; 를 바탕으로 지정 분야의 1~2군 건축가를 추리며 1순위 건축가 투찰 의사 확인 단계; 를 통해 1순위 건축가군에게 투찰 의사를 물은 뒤 1순위 건축가군 투찰 인 원 확인 단계; 를 거쳐 2순위 건축가 투찰 의사 확인 단계; 혹은 견적 제출 기한 설정 및 견적 요청 단계;로 진 행되는데, 상기 1순위 건축가군 투찰 인원 확인 단계; 에서 1순위 건축가군의 특정 인원 이상이 투찰한 경우에는 상기 견 적 제출 기한 설정 및 견적 요청 단계; 로 진행되며 그렇지 않은 경우에는 상기 2순위 건축가 투찰 의사 확인 단계; 로 진행되며 상기 2순위 건축가 투찰 의사 확인 단계; 에서는 1~2순위 건축가군 투찰 인원 확인 단계; 를 진행하며, 이 과정에서 1~2순위 건축가군의 특정 인원 이상이 투찰한 경우에는 상기 견적 제출 기한 설정 및 견 적 요청 단계; 로 진행되며 그렇지 않은 경우에는 투찰 실패 및 견적 요청비 반환 단계;로 진행되며 상기 견적 제출 기한 설정 및 견적 요청 단계; 로 진행되는 경우 건축가의 견적 및 컨셉 제안서 작성 단계; 와 견적 요청비 중 일부 (착수비) 전달 단계; 를 거친 뒤 건축주 의사 확인 단계; 를 진행하는데 이 때 상기 건축주 의사 확인 단계; 는 투찰한 여러 건축가들의 견적과 제안서 중 건축주가 선호하는 제안이 있 을 경우에는 나머지 견적 요청비 전달 단계; 와 매칭 성사 단계; 를 거쳐 매칭이 성사되며, 건축주가 선호하는 제안이 없을 경우에는 견적 재제안 의사 확인 단계; 를 거쳐 투찰 실패 단계; 또는 상기 견적 제안 요청 단계; 로 되돌아가는 흐름을 포함하여 구성되는 것을 특징으로 하는 온라인 건축사 매칭 플랫폼을 포함하여 구성된다."}
{"patent_id": "10-2021-0156152", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 본 발명에 따른 온라인 건축사 매칭 플랫폼에 의하면, 건축주들로 하여금 온라인 플랫폼을 통 해 더욱 쉽게 건축가를 구할 수 있다는 장점이 있다. 또한 건축주들이 자신이 원하는 옵션과 정보를 입력함으로써 여러 건축가들의 견적을 쉽게 받아봐 비교분석한 뒤 결정할 수 있다는 장점이 있다. 또한 건축가들은 기존에 비해 고객을 유치하는 판로를 다양화할 수 있다는 장점이 있다."}
{"patent_id": "10-2021-0156152", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있을 정도로 본 발명의 바람직한 실시예가 첨부된 도면을 참조하여 상세하게 설명하면 다음과 같다.도 1은 본 발명에 따른 온라인 건축사 매칭 플랫폼의 구조도이고, 도 2는 플랫폼의 입찰 방식을 구체화한 구조 도이다. 도 1의 본 발명에 따른 온라인 건축사 매칭 플랫폼의 구조도에서 플랫폼(P)는 크게 건축주(A)와 건축가(B)로 구 성된다. 또한 플랫폼 내부의 입찰과 의사결정의 흐름은 도 2의 방식과 같이 진행된다. 이 때 상기 플랫폼(P)은 건축주가 플랫폼에 제공하는 정보을 바탕으로 상기 건축주(A)의 의견을 정리해 상 기 건축가(B)에게 상기 플랫폼(P)이 건축가에게 제공하는 정보을 제공한다. 또 상기 건축가(B)는 상기 플랫폼(P)이 건축가에게 제공하는 정보을 바탕으로 자신의 기본 정보와 설계 약 력, 제안서 및 견적을 작성해 상기 플랫폼(P)에 건축가가 플랫폼에 제공하는 정보를 전달하고, 상기 플랫폼 (P)은 상기 건축가가 플랫폼에 제공하는 정보를 정리해 플랫폼이 건축주에게 제공하는 정보를 전달하는 역할을 수행한다. 이 과정에서 상기 플랫폼(P)는 견적 제안 요청 단계에서 견적 요청이 발생한 경우 인공지능의 건축가군 결 정 단계와 1순위 건축가 투찰 의사 확인 단계, 1순위 건축가군 투찰 인원 확인 단계를 통해 상 기 인공지능의 건축가군 결정 단계에서 결정한 1순위 건축가군 중 본 입찰에 참여할 상기 건축가(A)의 수 를 헤아리며, 이를 바탕으로 1~2순위 건축가군 투찰 인원 확인 단계를 거쳐 투찰 실패 및 견적 요청비 반 환 단계로 진행할 지, 혹은 견적 제출 기한 설정 및 견적 요청 단계로 진행할 지 결정하게 된다. 상기 견적 제출 기한 설정 및 견적 요청 단계로 진행한 경우, 상기 플랫폼(P)는 상기 건축가(B)에게 건축 가의 견적 및 컨셉 제안서 작성 단계의 수행을 요청하며, 해당 단계가 완료된 경우 상기 건축가(B)에 대해 견적 요청비 중 일부 (착수비) 전달 단계을 수행한다. 상기 견적 요청비 중 일부 (착수비) 전달 단계까지 수행한 뒤 상기 플랫폼(P)는 상기 건축주(A)에 대해 건 축주 의사 확인 단계을 수행한다. 이 때 상기 건축주(A)의 의사에 따라 선호하는 제안이 없을 견적 재제안 의사 확인 단계로 진행해 투찰 실패 단계로 진행 또는 상기 견적 제안 요청 단계로 돌아간다. 상기 건축주(A)가 선호하는 제안이 있을 경우 나머지 견적 요청비 전달 단계과 매칭 성사 단계 단계 를 진행해 매칭을 마무리한다. 이 때 상기한 내용과 같이 상기 플랫폼(P)는 원활한 서비스의 운영을 위해 상기 건축주(A)에게 견적 요청비를 징수한다. 입찰에 투찰한 상기 건축가(B)가 있을 경우 상기 건축가(B)가 제안서와 견적을 작성한 경우 일부를 투찰한 상기 건축가(B)들에게 나눠 지급하며 최총 매칭시 나머지 일부를 선택받은 상기 건축가(B)에게 지급한다. 만약 상기 건축주(A)가 제안서와 견적을 받아본 이후 최종 매칭을 하지 않게 되면 상기 플랫폼(P)는 상기 과정에서 상기 건축가(B)에게 지불한 일부 견적 요청비를 제외한 나머지 비용을 상기 건축주(A)에게 환불 하며, 상기 1~2순위 건축가군 투찰 인원 확인 단계 과정과 상기 투찰 실패 및 견적 요청비 반환 단계 단계에 의해 매칭이 진행되지 않은 경우에는 상기 건축주(A)에게 전액 반환한다. 이상에서와 같이 본 발명은 비록 상기의 실시예에 한하여 설명하였지만 반드시 여기에만 한정되는 것은 아니며 본 발명의 범주와 사상을 벗어나지 않는 범위 내에서 다양한 변형 실시가 가능함은 물론이다."}
{"patent_id": "10-2021-0156152", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 온라인 건축사 매칭 플랫폼의 구조도이다 도 2는 플랫폼의 입찰 방식을 구체화한 구조도이다"}
