{"patent_id": "10-2019-0074872", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0000076", "출원번호": "10-2019-0074872", "발명의 명칭": "교통수단 서비스 시스템", "출원인": "박혁규", "발명자": "박혁규"}}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "플랫폼 서버를 구비한 교통수단 서비스 시스템에 있어서,상기 플랫폼 서버는, 수요자 단말기로부터 구매 서비스 정보를 입력받아 구매 서비스를 등록하는 구매 서비스 등록부;상기 등록된 구매 서비스에 대하여 하나 또는 다수의 판매자 단말기로부터 판매 매칭 정보를 입력받아 수요자단말기로 전송하는 서비스 매칭부;서비스 매칭이 완료되면, 수요자와 판매자간 서비스 구매를 완료시키고, 수요자 및 판매자에게 서비스 구매가완료되었다는 정보를 전송하는 서비스 결정부; 및수요자의 요금 결제를 진행하는 과금부;를 포함하는 교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 구매 서비스 정보에는 출발지, 목적지, 인원, 및 구매 가격을 필수로 포함하며, 출발 일자 및 시간, 타수요자와의 동승 수락 여부, 선호하는 교통수단 종류, 선호하는 교통 운송수단 사업자 중에서 적어도 하나 이상이더 포함되는 교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 판매 매칭 정보는, 수요자가 등록한 구매 서비스 내용을 전적으로 수락하는 방식으로 판매 동의한다는 정보를 포함하는 교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 서비스 매칭부는 서비스 흥정을 위해 판매자로부터 구매 서비스 정보 대비 차이점이 있는 판매 서비스 정보를 전송받는 경우, 판매자가 서비스 흥정을 위해 입력한 정보를 수요자에게 전송하는 교통수단 서비스시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 판매자가 교통수단에 또 다른 수요자를 탑승시키기 위해 수요자를 추가 매칭하는 추가 매칭부를 더 포함하는 교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2021-0000076-3-제5항에 있어서, 상기 추가 매칭부는 다른 수요자들이 등록한 구매 서비스를 빅데이터 및 인공지능으로 판단하여 매칭된 운행 경로상에 출발지 및 목적지가 존재하거나 유사한 경우 자동으로 중간 기착지를 추천하여 추가 수요자를 매칭하는교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 추가 매칭부는 기존 수요자, 판매자, 또는 추가되는 수요자로부터 중간 기착지를 추천 받아 추가 수요자를매칭하고, 추천하는 자에게 소정의 포인트를 제공하는 교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 판매자 단말기로부터 판매 서비스 정보를 입력받아 판매 서비스 정보를 등록하는 판매 서비스 등록부를 더 포함하는 교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 판매 서비스 정보에는 출발지, 목적지, 허용 인원수 범위, 및 판매 가격을 포함하며, 출발 일자 및 시간,타수요자와의 동승 수락 여부, 경유지, 교통수단 정보 중 적어도 하나 이상이 더 포함되는 교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 관광지 또는 행정구역의 숙박, 관광명소, 맛집 및 교통안내를 포함하는 관광 정보를 미리 저장하고, 수요자 또는 판매자가 구매 서비스 등록부 또는 판매 서비스 등록부에 목적지를 입력하면 해당 목적지에 해당하는 관광지또는 행정구역의 관광정보를 수요자 단말기로 전송하는 부가 컨텐츠 관리부를 더 포함하는 교통수단 서비스 시스템."}
{"patent_id": "10-2019-0074872", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 플랫폼 서버를 구비한 교통수단 서비스 시스템에 있어서, 상기 플랫폼 서버는, 수요자 단말기로부터 구매 서비스 정보를 입력받아 구매 서비스를 등록하는 구매 서비스 등록부; 상기 등록된 구매 서비스에 대하여 하나 또는 다수의 판매자 단말기로부터 판매 매칭 정보를 입력받아 수요자 단말기로 전송하는 서비스 매칭부; 서 비스 매칭이 완료되면, 수요자와 판매자간 서비스 구매를 완료시키고, 수요자 및 판매자에게 서비스 구매가 완료 되었다는 정보를 전송하는 서비스 결정부; 및 수요자의 요금 결제를 진행하는 과금부;를 포함하는 교통수단 서비 스 시스템을 제공한다."}
{"patent_id": "10-2019-0074872", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 교통수단 서비스 시스템에 관한 것이다."}
{"patent_id": "10-2019-0074872", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "여기서는, 본 개시에 관한 배경기술이 제공되며, 이들이 반드시 공지기술을 의미하는 것은 아니다. 최근에 스마트폰과 인터넷의 이용이 활성화되면서 각종 정보를 제공하기 위한 서비스가 성행하고 있다. 무선통 신 및 인터넷을 통한 정보제공은 최근에 급속히 발달한 통신 프로토콜, 영상처리기술, 소프트웨어, 멀티미디어, 멀티태스크 기술을 최대한 이용한 것으로서, 각종 정보의 수집, 가공, 배포가 스마트폰 어플리케이션, 인터넷 등에서 이루어져 별도의 문서나 인력이 필요없고 실시간에 원하는 정보를 제공하고 획득할 수 있는 장점이 있어 많은 사업자에게 각광을 받고 있다.종래의 인터넷 및 스마트폰 어플리케이션을 통한 교통수단 서비스는 대중이 많이 이용하는 대중버스, 택시, 기 차 등에 집중되어 있다. 일례로 대중버스의 실시간 위치 정보를 이용한 현재 위치, 도착시간 알림 등의 서비스 와 고속버스나 기차의 운행 스캐쥴 및 실시간 예매 서비스 등이 있다. 그러나, 종래의 교통수단 서비스는 출발지, 경유지, 목적지가 기설정되어 있어 이에 해당되지 않는 수요자는 그 서비스를 이용할 수 없는 문제가 있으며, 여러 번 갈아타는 등 복잡한 경로를 이용해야 하거나, 자가용을 이용 할 수 밖에 없는 경우가 있다. 특히 대중교통수단이 발달되지 않은 비도심지에 거주하는 경우 더욱 문제된다. 실례로 전주에서 김해국제공항으로 가는 리무진 버스가 없기 때문에, 어쩔수 없이 인천국제공항으로 가거나 복 잡한 대중교통수단 경로를 이용하여 김해국제공항으로 가야 한다. 또한, 다수가 함께 관광을 하는 경우, 교통수단으로서 관광버스를 이용하는 경우가 많은데, 인원이 적은 경우 관광버스 한 대를 전세하여 이용하기는 비용적으로 어려움이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2017-0064280호"}
{"patent_id": "10-2019-0074872", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 교통수단 수요자와 판매자(교통수단 제공자)를 연결하여 편리한 교통수단이 없거나 복잡한 경로를 이 용해야 하는 수요자에게 교통수단 제공자를 매칭하여 주어 편리성을 도모하고, 교통수단의 빈자리에 적절한 수 요자를 매칭시켜 사익과 공익을 함께 실현할 수 있는 교통수단 서비스 시스템을 제공하는 것을 목적으로 한다. 그러나 본 발명의 목적들은 상기에 언급된 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0074872", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 상기의 과제를 해결하기 위한 수단으로서, 다음의 해결 수단을 제공한다. 본 발명은 플랫폼 서버를 구비한 교통수단 서비스 시스템에 있어서, 상기 플랫폼 서버는, 수요자 단말기로부터 구매 서비스 정보를 입력받아 구매 서비스를 등록하는 구매 서비스 등록부; 상기 등록된 구매 서비스에 대하여 하나 또는 다수의 판매자 단말기로부터 판매 매칭 정보를 입력받아 수요자 단말기로 전송하는 서비스 매칭부; 서비스 매칭이 완료되면, 수요자와 판매자간 서비스 구매를 완료시키고, 수요자 및 판매자에게 서비스 구매가 완료되었다는 정보를 전송하는 서비스 결정부; 및 수요자의 요금 결제를 진행하는 과금부;를 포함하는 교통수단 서비스 시스템을 제공한다. 또한, 상기 구매 서비스 정보에는 출발지, 목적지, 인원, 및 구매 가격을 필수로 포함하며, 출발 일자 및 시간, 타수요자와의 동승 수락 여부, 선호하는 교통수단 종류, 선호하는 교통 운송수단 사업자 중에서 적어도 하나 이 상이 더 포함되는 교통수단 서비스 시스템을 제공한다. 또한, 상기 판매 매칭 정보는, 수요자가 등록한 구매 서비스 내용을 전적으로 수락하는 방식으로 판매 동의한 다는 정보를 포함하는 교통수단 서비스 시스템을 제공한다. 또한, 상기 서비스 매칭부는 서비스 흥정을 위해 판매자로부터 구매 서비스 정보 대비 차이점이 있는 판매 서비 스 정보를 전송받는 경우, 판매자가 서비스 흥정을 위해 입력한 정보를 수요자에게 전송하는 교통수단 서비스 시스템을 제공한다. 또한, 판매자가 교통수단에 또 다른 수요자를 탑승시키기 위해 수요자를 추가 매칭하는 추가 매칭부를 더 포함 하는 교통수단 서비스 시스템을 제공한다. 또한, 상기 추가 매칭부는 다른 수요자들이 등록한 구매 서비스를 빅데이터 및 인공지능으로 판단하여 매칭된 운행 경로상에 출발지 및 목적지가 존재하거나 유사한 경우 자동으로 중간 기착지를 추천하여 추가 수요자를 매 칭하는 교통수단 서비스 시스템을 제공한다. 또한, 상기 추가 매칭부는 기존 수요자, 판매자, 또는 추가되는 수요자로부터 중간 기착지를 추천 받아 추가 수 요자를 매칭하고, 추천하는 자에게 소정의 포인트를 제공하는 교통수단 서비스 시스템을 제공한다. 또한, 판매자 단말기로부터 판매 서비스 정보를 입력받아 판매 서비스 정보를 등록하는 판매 서비스 등록부를 더 포함하는 교통수단 서비스 시스템을 제공한다. 또한, 상기 판매 서비스 정보에는 출발지, 목적지, 허용 인원수 범위, 및 판매 가격을 포함하며, 출발 일자 및 시간, 타수요자와의 동승 수락 여부, 경유지, 교통수단 정보 중 적어도 하나 이상이 더 포함되는 교통수단 서비 스시스템을 제공한다. 또한, 관광지 또는 행정구역의 숙박, 관광명소, 맛집 및 교통안내를 포함하는 관광 정보를 미리 저장하고, 수요 자 또는 판매자가 구매 서비스 등록부 또는 판매 서비스 등록부에 목적지를 입력하면 해당 목적지에 해당하는 관광지 또는 행정구역의 관광정보를 수요자 단말기로 전송하는 부가 컨텐츠 관리부를 더 포함하는 교통수단 서 비스 시스템을 제공한다."}
{"patent_id": "10-2019-0074872", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 교통수단 서비스 시스템은 교통수단 수요자와 판매자(교통수단 제공자)를 연결하여 편리한 교통 수단이 없거나 복잡한 경로를 이용해야 하는 수요자에게 교통수단 제공자를 매칭하여 주어 편리성을 도모하고, 교통수단의 빈자리에 적절한 수요자를 매칭시켜 사익과 공익을 함께 실현할 수 있다. 상기의 효과 및 추가적 효과에 대하여 아래에서 자세히 서술한다."}
{"patent_id": "10-2019-0074872", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에 본 발명을 상세하게 설명하기에 앞서, 본 명세서에 사용된 용어는 특정의 실시예를 기술하기 위한 것일 뿐 첨부하는 특허청구의 범위에 의해서만 한정되는 본 발명의 범위를 한정하려는 것은 아님을 이해하여야 한다. 본 명세서에 사용되는 모든 기술용어 및 과학용어는 다른 언급이 없는 한은 기술적으로 통상의 기술을 가진 자 에게 일반적으로 이해되는 것과 동일한 의미를 가진다. 본 명세서 및 청구범위의 전반에 걸쳐, 다른 언급이 없는 한 포함(comprise, comprises, comprising)이라는 용 어는 언급된 물건, 단계 또는 일군의 물건, 및 단계를 포함하는 것을 의미하고, 임의의 어떤 다른 물건, 단계 또는 일군의 물건 또는 일군의 단계를 배제하는 의미로 사용된 것은 아니다. 한편, 본 발명의 여러 가지 실시예들은 명확한 반대의 지적이 없는 한 그 외의 어떤 다른 실시예들과 결합될 수 있다. 특히 바람직하거나 유리하다고 지시하는 어떤 특징도 바람직하거나 유리하다고 지시한 그 외의 어떤 특징 및 특징들과 결합될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예 및 이에 따른 효과를 설명하기로 한다. 도 1 내지 도 4는 본 발명의 일실시예에 따른 교통수단 서비스 시스템을 설명하기 위해 도시한 도이다. 이하 도 면을 참고하여 자세히 설명한다. 도 1에 도시된 바와 같이, 본 발명의 일실시예에 따른 교통수단 서비스 시스템은 플랫폼 서버를 포함할 수 있으 며, 플랫폼 서버는 다수의 수요자 및 다수의 판매자와 유무선 통신을 통해 정보를 송수신 할 수 있으며, 그 방 식은 제한되지 않는다. 수요자 단말기 및 판매자 단말기는 PC, 스마트폰, 태블릿 PC 등 제한되지 않으며, 웹을 통해, 또는 별도의 어플리케이션을 통해 플랫폼 서버에 접속할 수 있다. 교통수단 서비스 시스템은 수요자 및판매자의 회원 가입 절차를 필수로 또는 선택적으로 진행할 수 있다. 회원가입시 아이디, 비밀번호, 휴대폰 번 호 등 개인정보 등을 입력받을 수 있으며, 휴대폰 인증 절차를 거칠 수도 있다. 한편, 판매자의 경우 서비스 신 용도 및 품질 제고를 위해 사업자등록증, 운송수단 정보, 최근 수년간의 매출액 및 손익계산서 등을 입력받을 수 있으며, 운송수단의 실존재 여부에 대한 인증 절차 등을 거칠 수 있다. 판매자, 즉 운송수단 제공자의 종류 는 제한되지 않는다. 관광회사, 렌트카, 버스회사, 택시, 운송수단을 보유한 개인 등일 수 있다. 운전자의 제공 은 필수 또는 선택적일 수 있다. 도 2에 도시된 바와 같이, 상기 플랫폼 서버는 구매 서비스 등록부, 판매 서비스 등록부, 서비스 매칭부, 서비 스 결정부, 추가 매칭부, 과금부 중에서 적어도 하나 이상 구비될 수 있으며, 도시되지 않았으나 수요자 및 판 매자 정보를 저장, 관리하고 인증을 수행하는 회원 관리부를 더 포함할 수 있다. 이하 본 발명의 일실시예에 따른 교통수단 서비스 시스템 및 서비스 방법에 대하여 보다 상세하게 설명한다. 먼저, 수요자가 구매 서비스를 먼저 등록하는 경우를 예시한다. 도 3에 도시된 바와 같이, 구매 서비스 등록부는 수요자 단말기로부터 구매 서비스 정보를 입력받아 구매 서비 스를 등록한다. 상기 구매 서비스 정보에는 출발지, 목적지, 인원, 및 구매 가격을 필수로 포함할 수 있다. 또 한, 출발 일자 및 시간, 타수요자와의 동승 수락 여부, 선호하는 교통수단 종류, 선호하는 교통 운송수단 사업 자 등이 선택적으로 더 포함될 수 있다. 상기 구매 가격은 최대 가격일 수 있다. 상기 구매 서비스 등록이 완료되면, 다수의 판매자는 이를 열람할 수 있다. 상기 서비스 매칭부는 등록된 구매 서비스에 대하여 판매자 단말기로부터 판매 매칭 정보를 입력받을 수 있다. 상기 판매 매칭 정보는 수요자가 등 록한 구매 서비스 내용을 전적으로 수락하는 방식으로 간단하게 판매 동의를 등록할 수 있다. 이 경우에는 서비 스 매칭부는 판매자가 전적으로 동의하는 방식, 즉 수요자가 제시한 구매 서비스대로 매칭되었다는 정보를 수요 자에게 전송하고, 상기 서비스 결정부는 수요자와 판매자간 서비스 구매를 완료시키고, 수요자 및 판매자에게 서비스 구매가 완료되었다는 정보를 전송하며, 과금부를 통해 수요자의 요금 결제를 진행하게 된다. 과금부는 수요자에게 요금 결제 기한을 전송하며, 결제 기한을 도과한 경우 서비스 구매를 취소하고 양 당사자에게 통지 할 수 있다. 수요자의 요금 결제가 완료되면 요금의 일부를 서비스 수수료로 징수하여 수익 모델로 삼을 수 있 다. 한편, 서비스 매칭부는 판매자의 서비스 흥정을 위해 구매 서비스 정보 대비 차이점이 있는 판매 서비스 정보 를 입력받을 수도 있다. 예를 들어, 판매자로부터 수요자가 제시한 가격과 다른 판매 가격을 별도로 입력받을 수 있으며, 기타 서비스 특화 정보를 입력받을 수 있다. 또한, 수요자가 제시한 것과 다른 부분이 있으면 그에 대한 정보도 입력 받을 수 있다. 서비스 매칭부는 판매자가 서비스 흥정을 위해 입력한 정보를 수요자에게 전송 한다. 수요자는 하나 또는 다수의 판매자가 제시한 판매 서비스 정보를 확인하고, 원하는 판매자를 결정하여 서 비스 매칭부에 전송한다. 이렇게 수요자와 판매자가 매칭 완료되면 서비스 결정부는 전술한 바와 같이 서비스 구매를 완료하고, 과금부는 요금 결제를 진행한다. 한편, 도시되지 않았으나 수요자는 판매자에게 추가 흥정을 위해 구매 서비스 정보를 다시 제시할 수 있으며, 서비스 매칭부는 수요자에게 받은 수정된 구매 서비스 정보를 플랫폼 서버에 업로드하고, 수정 구매 서비스 정 보를 판매자에게 전송할 수 있으며, 판매자는 이를 수락하거나 또 다른 판매 서비스 조건을 다시 수요자에게 제 시하여 전술한 과정을 다시 진행할 수 있다. 한편, 상기 추가 매칭부는 판매자의 교통수단에 빈자리가 존재하는 경우 판매자가 교통수단에 또 다른 수요자를 탑승시키기 위해 수요자를 추가 매칭할 수 있다. 추가 매칭부는 판매자로부터 추가 판매 서비스 정보를 입력받 아 후술하는 판매자가 판매 서비스를 먼저 등록하는 방식으로 수요자를 추가 모집할 수 있다. 다만, 수요자의 구매 서비스 정보에 타수요자의 동승을 수락하지 않은 것이 포함된 경우에는 추가 매칭부는 추가 매칭을 진행하 지 않을 수 있다. 한편, 상기 추가 매칭부는 좌석에 여유가 있을 때, 중간 기착지를 수요자 및 판매자에게 추천할 수 있다. 예를 들어 전주에서 김해공항으로 가는 교통수단이 결정되었고, 좌석이 여유가 있을 때, 진안에 사는 다른 수요자가 이 교통수단을 타려 할 때, 익산장수고속도로 내에 있는 마이산휴게소에서 승차할 수 있도록 마이산휴게소를 중 간 기착지로 추천할 수 있다. 상기 추가 매칭부는 다른 수요자들이 등록한 구매 서비스를 빅데이터 및 인공지능으로 판단하여 매칭된 운행 경 로상에 출발지 및 목적지가 존재하거나 유사한 경우 자동으로 중간 기착지를 추천할 수 있다. 중간 기착지가 추 천되는 경우 기존 수요자 및 판매자에게 기착지에 대한 정보를 제공하여, 동의하에 추가 수요자를 모집하도록 할 수 있다. 만일, 운행 경로상에 있는 중간 기착지를 추천하여 추가 매칭하는 경우, 기존 수요자에게 별 손해가 없으나, 우 회하여야 하는 등 운행 거리나 운행 시간이 늘어나는 경우 기존 수요자에게 소정의 포인트를 증정해서 기존 수 요자에게 보상을 할 수 있으며, 판매자가 수요자의 운행비용을 일부 할인하거나 일부 환불하는 형태로 보상할 수도 있다. 추가되는 수요자의 교통비는 추가 수요자와 판매자의 협의로 결정된다. 한편, 추가 매칭부는 기존 수요자, 판매자, 또는 추가되는 수요자로부터 중간 기착지를 추천 받을 수 있다. 추 천받아 추가 매칭되는 경우 추천한 자에게 소정의 포인트를 제공할 수 있다. 도 4는 본 발명의 또 다른 일실시예에 따른 교통수단 서비스 시스템 및 서비스 방법에 관한 도로서, 판매자가 판매 서비스를 먼저 등록하는 경우를 예시한다. 도 4에 도시된 바와 같이, 판매 서비스 등록부는 판매자 단말기로부터 판매 서비스 정보를 입력받아 판매 서비 스 정보를 등록한다. 상기 판매 서비스 정보에는 출발지, 목적지, 허용 인원수 범위, 및 판매 가격을 필수로 포 함할 수 있다. 또한, 출발 일자 및 시간, 타수요자와의 동승 수락 여부, 경유지, 교통수단 정보 등이 선택적으 로 더 포함될 수 있다. 상기 판매 가격은 최저 가격일 수 있다. 상기 판매 서비스 등록이 완료되면, 다수의 수요자는 이를 열람할 수 있다. 상기 서비스 매칭부는 등록된 판매 서비스에 대하여 수요자로부터 구매 매칭 정보를 입력받을 수 있다. 상기 구매 매칭 정보는 판매자가 등록한 판 매 서비스 내용을 전적으로 수락하는 방식으로 간단하게 구매 동의를 등록할 수 있다. 이 경우에는 서비스 매칭 부는 수요자가 전적으로 동의하는 방식, 즉 판매자가 제시한 판매 서비스대로 매칭되었다는 정보를 판매자에게 전송하고, 상기 서비스 결정부는 판매자와 구매자간 서비스 판매를 완료시키고, 수요자 및 판매자에게 서비스 판매가 완료되었다는 정보를 전송하며, 과금부를 통해 수요자의 요금 결제를 진행하게 된다. 과금부는 수요자에 게 요금 결제 기한을 전송하며, 결제 기한을 도과한 경우 서비스 구매를 취소하고 양 당사자에게 통지할 수 있 다. 수요자의 요금 결제가 완료되면 요금의 일부를 서비스 수수료로 징수하여 수익 모델로 삼을 수 있다. 한편, 서비스 매칭부는 수요자의 서비스 흥정을 위해 구매 서비스 정보를 입력받을 수도 있다.수요자로부터 판 매자가 제시한 가격과 다른 구매 가격을 별도로 입력받을 수 있으며, 기타 서비스 특화 정보를 입력받을 수 있 다. 또한, 판매자가 제시한 것과 다른 부분이 있으면 그에 대한 정보(일례로 경유지, 인원수 등)도 입력 받을 수 있다. 서비스 매칭부는 수요자가 서비스 흥정을 위해 입력한 정보를 판매자에게 전송한다. 판매자는 수요자 가 제시한 구매 서비스 정보를 확인하고, 원하는 수요자를 결정하여 서비스 매칭부에 전송한다. 이렇게 판매자 와 수요자가 매칭 완료되면 서비스 결정부는 전술한 바와 같이 서비스 판매를 완료하고, 과금부는 요금 결제를 진행한다. 한편, 도시되지 않았으나 판매자는 수요자에게 추가 흥정을 위해 판매 서비스 정보를 다시 제시할 수 있으며, 서비스 매칭부는 판매자에게 받은 수정된 판매 서비스 정보를 플랫폼 서버에 업로드하고, 수정 판매 서비스 정 보를 수요자에게 전송할 수 있으며, 수요자는 이를 수락하거나 또 다른 구매 서비스 조건을 다시 수요자에게 제 시하여 전술한 과정을 다시 진행할 수 있다. 또한, 추가 매칭부는 전술한 과정으로 판매된 이후에도 판매자의 교통수단에 빈자리가 존재하는 경우 판매자가 교통수단에 또 다른 수요자를 탑승시키기 위해 수요자를 추가 매칭할 수 있다. 추가 매칭부는 판매자로부터 추 가 판매 서비스 정보를 입력받아 후술하는 판매자가 판매 서비스를 먼저 등록하는 방식으로 수요자를 추가 모집 할 수 있다. 다만, 수요자의 구매 서비스 정보에 타수요자의 동승을 수락하지 않은 것이 포함된 경우에는 추가매칭부는 추가 매칭을 진행하지 않을 수 있다. 본 발명의 또 다른 일실시예로서, 도 2에 도시된 것처럼, 플랫폼 서버는 선택적으로 리뷰 관리부 또는 부가 컨 텐츠 관리부를 더 포함할 수 있다. 리뷰 관리부는 구매/판매가 완료된 후, 수요자 또는/및 판매자에게 리뷰를 받아서 업로드하고 이를 관리할 수 있으며, 평점이 낮은 자는 사용에 제한을 두고, 평점이 높은 자는 소정의 혜택을 제공할 수 있다. 부가 컨텐츠 관리부는 관광지 또는 행정구역의 숙박, 관광명소, 맛집, 교통안내 등 각종 관광 정보를 미리 저장 하고, 수요자 또는 판매자가 구매 서비스 등록부 또는 판매 서비스 등록부에 목적지를 입력하면 해당 목적지에 해당하는 관광지 또는 행정구역의 각종 관광정보를 수요자에게 전송할 수 있다. 또한, 부가 컨텐츠 관리부는 수요자 또는 판매자가 직접 제작한 관광정보를 전송받아 관광 정보를 추가하거나 업데이트할 수도 있다. 전술한 각 실시예에서 예시된 특징, 구조, 효과 등은 실시예들이 속하는 분야의 통상의 지식을 가지는 자에 의 하여 다른 실시예들에 대해서도 조합 또는 변형되어 실시 가능하다. 따라서 이러한 조합과 변형에 관계된 내용 들은 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2019-0074872", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 내지 도 4는 본 발명의 일실시예에 따른 교통수단 서비스 시스템을 설명하기 위해 도시한 도이다."}
