{"patent_id": "10-2023-0094651", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0014516", "출원번호": "10-2023-0094651", "발명의 명칭": "무선 통신 시스템에서 단말의 셀 재선택 수행 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "정상엽"}}
{"patent_id": "10-2023-0094651", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 셀 재선택(reselection)을 수행하기 위한 단말(user equipment, UE)의 동작 방법에 있어서, 기지국(base station, BS)으로부터, 셀 재선택(reselection) 정보를 포함하는 시스템 정보(system informationblock, SIB)를 수신하는 단계;상기 수신한 SIB에 기초하여, 저전력 웨이크업 신호(low power wake-up signal, LP-WUS)를 지원하는 셀의 우선순위를 결정하는 단계; 및상기 결정된 LP-WUS를 지원하는 셀의 우선 순위에 기초하여, 셀 재선택 평가 절차(cell reselectionevaluation process)를 수행하는 단계; 를 포함하고,상기 셀 재선택 정보는 상기 LP-WUS를 지원하는 셀의 우선 순위를 결정하기 위한 셀 특정 오프셋 및 저전력 웨이크업 수신기(low power wake-up receiver, LR)를 지원하는 UE에 적용될 수 있는 정보를 포함하는, 방법."}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 LTE와 같은 4G 통신 시스템 이후 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시의 일 실시예에 따른 단말(UE)은, 기지국(BS)으로부터 셀 재선택 정보를 포함하는 시스템 정보(SIB)를 수신하고, 수신한 SIB에 기초하여, 저전력 웨이크업 신호(LP-WUS)를 지원하는 셀의 우선 순위를 결 정하고, 결정된 LP-WUS를 지원하는 셀의 우선 순위에 기초하여, 셀 재선택 평가 절차를 수행할 수 있으며, 셀 재 선택 정보는 상기 LP-WUS를 지원하는 셀의 우선 순위를 결정하기 위한 셀 특정 오프셋 및 저전력 웨이크업 수신 기(LR)를 지원하는 UE에 적용될 수 있는 정보를 포함할 수 있다."}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 단말 및 기지국 동작에 관한 것이다. 구체적으로, 무선 통신 시스템에서 저전 력 웨이크업 수신기를 지원하는 단말의 셀 재선택(reselection) 수행 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수(‘Sub 6GHz’) 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불리는 초고주파 대역(‘Above 6GHz’)에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다."}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 실시예들은 무선 통신 시스템에서 단말의 전력 소모를 줄이기 위해 저전력 웨이크업 수신기를 지원하 는 단말이 셀 재선택(reselection)을 수행하는 방법 및 장치를 제공하기 위한 것이다."}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 무선 통신 시스템에서 셀 재선택(reselection)을 수행하기 위한 단말(user equipment, UE)의 동작 방법은, 기지국(base station, BS)으로부터, 셀 재선택(reselection) 정보를 포함하는 시스템 정보 (system information, SIB)를 수신하는 단계; 수신한 SIB에 기초하여, 저전력 웨이크업 신호(low power wake- up signal, LP-WUS)를 지원하는 셀의 우선 순위를 결정하는 단계; 및 상기 결정된 LP-WUS를 지원하는 셀의 우선 순위에 기초하여, 셀 재선택 평가 절차(cell reselection evaluation process)를 수행하는 단계; 를 포함하고, 상기 셀 재선택 정보는 상기 LP-WUS를 지원하는 셀의 우선 순위를 결정하기 위한 셀 특정 오프셋 및 저전력 웨 이크업 수신기(low power wake-up receiver, LR)를 지원하는 UE에 적용될 수 있는 정보를 포함할 수 있다."}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예들을 통해, 저전력 웨이크업 수신기(LR)를 지원하는 단말은, 저전력 웨이크업 신호(LP-WUS)를 지원하는 셀의 우선 순위를 결정하여 셀 재선택(reselection)을 수행함으로써 전력 소모를 줄일 수 있다."}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 개시의 동작 원리를 상세히 설명한다. 하기에서 본 개시를 설명하기에 있어 관 련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어 들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반 에 걸친 내용을 토대로 내려져야 할 것이다. 하기에서 본 개시를 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필 요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 이하 첨부된 도면을 참조하여 본 개시의 실시 예를 설명하기로 한다. 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 망 객체들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등 은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시이 후술되는 용어들에 한정되는 것은 아니며, 동등한 기 술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 이하, 기지국은 단말의 자원할당을 수행하는 주체로서, gNode B, eNode B, Node B, BS (Base Station), 무선 접속 유닛, 기지국 제어기, 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말(User Equipment, UE)은 MS (Mobile Station), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신 기능을 수행할 수 있는 멀티미디어 시스템을 포 함할 수 있다. 본 개시에서 하향링크(Downlink; DL)는 기지국이 단말에게 전송하는 신호의 무선 전송 경로이고, 상향링크는(Uplink; UL)는 단말이 기국에게 전송하는 신호의 무선 전송경로를 의미한다. 또한, 이하에서 LTE 혹은 LTE-A 시스템을 일 예로서 설명할 수도 있지만, 유사한 기술적 배경 또는 채널 형태를 갖는 다른 통신시스템에도 본 개시의 실시예가 적용될 수 있다. 예를 들어 LTE-A 이후에 개발되는 5세대 이동통 신 기술(5G, new radio, NR)이 본 개시의 실시예가 적용될 수 있는 시스템에 포함될 수 있으며, 이하의 5G는 기 존의 LTE, LTE-A 및 유사한 다른 서비스를 포함하는 개념일 수도 있다.또한, 본 개시는 숙련된 기술적 지식을 가진 자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에 도 적용될 수 있다. 이 때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행 될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가 능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들 을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예를 들면, 잇달아 도시되어 있는 두 개의 블 록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으 로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행할 수 있다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의 미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서 들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨 어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이 터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 이하 설명의 편의를 위하여, 본 개시는 3GPP LTE(3rd Generation Partnership Project Long Term Evolution) 규격(예, 3GPP Technical Specification 36 시리즈)에서 정의하고 있는 용어 및 명칭들을 사용한다. 하지만, 본 개시가 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 시스템에도 동일하게 적용될 수 있다. 예를 들면, 본 개시는 3GPP 5GS/NR (5세대 이동통신 표준) 규격 (예, 3GPP Technical Specification 38 시리즈), NR-Advance, 6세대 이동 통신 기술(6G), 또는 이후 개발되는 유사한 기술적 배경을 갖는 차세대 이 동 통신 시스템에도 적용될 수 있다. 본 개시에서 eNB는 설명의 편의를 위하여 gNB와 혼용되어 사용될 수 있다. 즉 eNB로 설명한 기지국은 gNB를 나타낼 수 있다. 도 1a는 일 실시 예에 따른 LTE 시스템의 구조를 도시한 도면이다. 도 1a을 참조하면, 도시한 바와 같이 LTE 시스템의 무선 액세스 네트워크는 차세대 기지국(Evolved Node B, 이 하 ENB, Node B 또는 기지국)(1a-05, 1a-10, 1a-15, 1a-20)과 MME (1a-25, Mobility Management Entity) 및 S-GW(1a-30, Serving-Gateway)로 구성된다. 사용자 단말(User Equipment, 이하 UE 또는 단말)(1a-35)은 ENB(1a-05 ~ 1a-20) 및 S-GW(1a-30)를 통해 외부 네트워크에 접속한다. 도 1a에서 ENB(1a-05 ~ 1a-20)는 UMTS 시스템의 기존 노드 B에 대응된다. ENB는 UE(1a-35)와 무선 채널로 연결 되며 기존 노드 B 보다 복잡한 역할을 수행한다. LTE 시스템에서는 인터넷 프로토콜을 통한 VoIP(Voice over IP)와 같은 실시간 서비스를 비롯한 모든 사용자 트래픽이 공용 채널(shared channel)을 통해 서비스 되므로, UE들의 버퍼 상태, 가용 전송 전력 상태, 채널 상태 등의 상태 정보를 취합해서 스케줄링을 하는 장치가 필요하 며, 이를 ENB(1a-05 ~ 1a-20)가 담당한다. 하나의 ENB는 통상 다수의 셀들을 제어한다. 예컨대, 100 Mbps의 전 송 속도를 구현하기 위해서 LTE 시스템은 예컨대, 20 MHz 대역폭에서 직교 주파수 분할 다중 방식(Orthogonal Frequency Division Multiplexing, 이하 OFDM이라 한다)을 무선 접속 기술로 사용한다. 또한 단말의 채널 상태 에 맞춰 변조 방식(modulation scheme)과 채널 코딩률(channel coding rate)을 결정하는 적응 변조 코딩 (Adaptive Modulation & Coding, 이하 AMC라 한다) 방식을 적용한다. S-GW(1a-30)는 데이터 베어러를 제공하는 장치이며, MME(1a-25)의 제어에 따라서 데이터 베어러를 생성하거나 제거한다. MME는 단말에 대한 이동성 관리 기능은 물론 각종 제어 기능을 담당하는 장치로 다수의 기지국 들과 연결된다. 도 1b는 일 실시 예에 따른 LTE 시스템에서 무선 프로토콜 구조를 도시한 도면이다. 도 1b를 참조하면, LTE 시스템의 무선 프로토콜은 단말과 ENB에서 각각 PDCP (Packet Data Convergence Protocol 1b-05, 1b-40), RLC (Radio Link Control 1b-10, 1b-35), MAC (Medium Access Control 1b-15, 1b- 30)으로 이루어진다. PDCP (Packet Data Convergence Protocol)(1b-05, 1b-40)는 IP 헤더 압축/복원 등의 동작"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "을 담당한다. PDCP의 주요 기능은 하기와 같이 요약된다. - 헤더 압축 및 압축 해제 기능(Header compression and decompression: ROHC only) - 사용자 데이터 전송 기능 (Transfer of user data) - 순차적 전달 기능(In-sequence delivery of upper layer PDUs at PDCP re-establishment procedure for RLC AM)- 순서 재정렬 기능(For split bearers in DC (only support for RLC AM): PDCP PDU routing for transmission and PDCP PDU reordering for reception) - 중복 탐지 기능(Duplicate detection of lower layer SDUs at PDCP re-establishment procedure for RLC AM) - 재전송 기능(Retransmission of PDCP SDUs at handover and, for split bearers in DC, of PDCP PDUs at PDCP data-recovery procedure, for RLC AM) - 암호화 및 복호화 기능(Ciphering and deciphering) - 타이머 기반 SDU 삭제 기능(Timer-based SDU discard in uplink.) 무선 링크 제어(Radio Link Control, 이하 RLC라고 한다)(1b-10, 1b-35)는 PDCP PDU(Packet Data Unit)를 적절"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한 크기로 재구성해서 ARQ 동작 등을 수행한다. RLC의 주요 기능은 하기와 같이 요약된다. - 데이터 전송 기능(Transfer of upper layer PDUs) - ARQ 기능(Error Correction through ARQ (only for AM data transfer)) - 접합, 분할, 재조립 기능(Concatenation, segmentation and reassembly of RLC SDUs (only for UM and AM data transfer)) - 재분할 기능(Re-segmentation of RLC data PDUs (only for AM data transfer)) - 순서 재정렬 기능(Reordering of RLC data PDUs (only for UM and AM data transfer) - 중복 탐지 기능(Duplicate detection (only for UM and AM data transfer)) - 오류 탐지 기능(Protocol error detection (only for AM data transfer)) - RLC SDU 삭제 기능(RLC SDU discard (only for UM and AM data transfer)) - RLC 재수립 기능(RLC re-establishment) MAC(1b-15, 1b-30)은 한 단말에 구성된 여러 RLC 계층 장치들과 연결되며, RLC PDU들을 MAC PDU에 다중화하고"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "MAC PDU로부터 RLC PDU들을 역다중화하는 동작을 수행한다. MAC의 주요 기능은 하기와 같이 요약된다. - 맵핑 기능(Mapping between logical channels and transport channels) - 다중화 및 역다중화 기능(Multiplexing/demultiplexing of MAC SDUs belonging to one or different logical channels into/from transport blocks (TB) delivered to/from the physical layer on transport channels) - 스케쥴링 정보 보고 기능(Scheduling information reporting) - HARQ 기능(Error correction through HARQ) - 로지컬 채널 간 우선 순위 조절 기능(Priority handling between logical channels of one UE) - 단말간 우선 순위 조절 기능(Priority handling between UEs by means of dynamic scheduling) - MBMS 서비스 확인 기능(MBMS service identification) - 전송 포맷 선택 기능(Transport format selection) - 패딩 기능(Padding) 물리 계층(1b-20, 1b-25)은 상위 계층 데이터를 채널 코딩 및 변조하고, OFDM 심벌로 만들어서 무선 채널로 전 송하거나, 무선 채널을 통해 수신한 OFDM 심벌을 복조하고 채널 디코딩해서 상위 계층으로 전달하는 동작을 한 다. 도 1c는 일 실시 예에 따른 차세대 무선 통신 시스템의 구조를 도시한 도면이다. 도 1c을 참조하면, 도시한 바와 같이 차세대 무선 통신 시스템(이하 NR 혹은 2g)의 무선 액세스 네트워크는 차 세대 기지국(New Radio Node B, 이하 NR gNB 혹은 NR 기지국)(1c-10) 과 NR CN (1c-05, New Radio CoreNetwork)로 구성된다. 사용자 단말(New Radio User Equipment, 이하 NR UE 또는 단말)(1c-15)은 NR gNB(1c-10) 및 NR CN (1c-05)를 통해 외부 네트워크에 접속한다. 도 1c에서 NR gNB(1c-10)는 기존 LTE 시스템의 eNB (Evolved Node B)에 대응된다. NR gNB는 NR UE(1c-15)와 무 선 채널로 연결되며 기존 노드 B 보다 더 월등한 서비스를 제공해줄 수 있다. 차세대 무선 통신 시스템에서는 모든 사용자 트래픽이 공용 채널(shared channel)을 통해 서비스 되므로, UE들의 버퍼 상태, 가용 전송 전력 상 태, 채널 상태 등의 상태 정보를 취합해서 스케줄링을 하는 장치가 필요하며, 이를 NR gNB(1c-10)가 담당한다. 하나의 NR gNB는 통상 다수의 셀들을 제어한다. 현재 LTE 대비 초고속 데이터 전송을 구현하기 위해서 기존 최 대 대역폭 이상을 가질 수 있고, 직교 주파수 분할 다중 방식(Orthogonal Frequency Division Multiplexing, 이하 OFDM이라 한다)을 무선 접속 기술로 하여 추가적으로 빔포밍 기술이 접목될 수 있다. 또한 단말의 채널 상 태에 맞춰 변조 방식(modulation scheme)과 채널 코딩률(channel coding rate)을 결정하는 적응 변조 코딩 (Adaptive Modulation & Coding, 이하 AMC라 한다) 방식을 적용한다. NR CN (1c-05)는 이동성 지원, 베어러 설 정, QoS 설정 등의 기능을 수행한다. NR CN는 단말에 대한 이동성 관리 기능은 물론 각종 제어 기능을 담당하는 장치로 다수의 기지국 들과 연결된다. 또한 차세대 무선 통신 시스템은 기존 LTE 시스템과도 연동될 수 있으며, NR CN이 MME (1c-25)와 네트워크 인터페이스를 통해 연결된다. MME는 기존 기지국인 eNB (1c-30)과 연결된다. 도 1d는 일 실시 예에 따른 차세대 무선 통신 시스템의 무선 프로토콜 구조를 도시한 도면이다. 도 1d는 본 개시가 적용될 수 있는 차세대 무선 통신 시스템의 무선 프로토콜 구조를 도시한 도면이다. . 도 1d를 참조하면, 차세대 무선 통신 시스템의 무선 프로토콜은 단말과 NR 기지국에서 각각 NR SDAP(1d-01, 1d- 45), NR PDCP(1d-05, 1d-40), NR RLC(1d-10, 1d-35), NR MAC(1d-15, 1d-30)으로 이루어진다. NR SDAP(1d-01, 1d-45)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. -사용자 데이터의 전달 기능(transfer of user plane data) -상향 링크와 하향 링크에 대해서 QoS flow와 데이터 베어러의 맵핑 기능(mapping between a QoS flow and a DRB for both DL and UL) -상향 링크와 하향 링크에 대해서 QoS flow ID를 마킹 기능(marking QoS flow ID in both DL and UL packets) -상향 링크 SDAP PDU들에 대해서 relective QoS flow를 데이터 베어러에 맵핑시키는 기능 (reflective QoS flow to DRB mapping for the UL SDAP PDUs). 상기 SDAP 계층 장치에 대해 단말은 RRC 메시지로 각 PDCP 계층 장치 별로 혹은 베어러 별로 혹은 로지컬 채널 별로 SDAP 계층 장치의 헤더를 사용할 지 여부 혹은 SDAP 계층 장치의 기능을 사용할 지 여부를 설정 받을 수 있으며, SDAP 헤더가 설정된 경우, SDAP 헤더의 NAS QoS 반영 설정 1비트 지시자(NAS reflective QoS)와 AS QoS 반영 설정 1비트 지시자(AS reflective QoS)로 단말이 상향 링크와 하향 링크의 QoS flow와 데이터 베어러 에 대한 맵핑 정보를 갱신 혹은 재설정할 수 있도록 지시할 수 있다. 상기 SDAP 헤더는 QoS를 나타내는 QoS flow ID 정보를 포함할 수 있다. 상기 QoS 정보는 원할한 서비스를 지원하기 위한 데이터 처리 우선 순위, 스케 쥴링 정보 등으로 사용될 수 있다. NR PDCP (1d-05, 1d-40)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. 헤더 압축 및 압축 해제 기능(Header compression and decompression: ROHC only) - 사용자 데이터 전송 기능 (Transfer of user data) - 순차적 전달 기능(In-sequence delivery of upper layer PDUs) - 비순차적 전달 기능 (Out-of-sequence delivery of upper layer PDUs) - 순서 재정렬 기능(PDCP PDU reordering for reception) - 중복 탐지 기능(Duplicate detection of lower layer SDUs) - 재전송 기능(Retransmission of PDCP SDUs) - 암호화 및 복호화 기능(Ciphering and deciphering) - 타이머 기반 SDU 삭제 기능(Timer-based SDU discard in uplink.) 상기에서 NR PDCP 장치의 순서 재정렬 기능(reordering)은 하위 계층에서 수신한 PDCP PDU들을 PDCP SN(sequence number)을 기반으로 순서대로 재정렬하는 기능을 말하며, 재정렬된 순서대로 데이터를 상위 계층에 전달하는 기능을 포함할 수 있으며, 혹은 순서를 고려하지 않고, 바로 전달하는 기능을 포함할 수 있으며, 순서 를 재정렬하여 유실된 PDCP PDU들을 기록하는 기능을 포함할 수 있으며, 유실된 PDCP PDU들에 대한 상태 보고를 송신 측에 하는 기능을 포함할 수 있으며, 유실된 PDCP PDU들에 대한 재전송을 요청하는 기능을 포함할 수 있다. NR RLC(1d-10, 1d-35)의 주요 기능은 다음의 기능들 중 일부를 포함할 수 있다. - 데이터 전송 기능(Transfer of upper layer PDUs) - 순차적 전달 기능(In-sequence delivery of upper layer PDUs) - 비순차적 전달 기능(Out-of-sequence delivery of upper layer PDUs) - ARQ 기능(Error Correction through ARQ) - 접합, 분할, 재조립 기능(Concatenation, segmentation and reassembly of RLC SDUs) - 재분할 기능(Re-segmentation of RLC data PDUs) - 순서 재정렬 기능(Reordering of RLC data PDUs) - 중복 탐지 기능(Duplicate detection) - 오류 탐지 기능(Protocol error detection) - RLC SDU 삭제 기능(RLC SDU discard) - RLC 재수립 기능(RLC re-establishment) 상기에서 NR RLC 장치의 순차적 전달 기능(In-sequence delivery)은 하위 계층으로부터 수신한 RLC SDU들을 순 서대로 상위 계층에 전달하는 기능을 말하며, 원래 하나의 RLC SDU가 여러 개의 RLC SDU들로 분할되어 수신된 경우, 이를 재조립하여 전달하는 기능을 포함할 수 있으며, 수신한 RLC PDU들을 RLC SN(sequence number) 혹은 PDCP SN(sequence number)를 기준으로 재정렬하는 기능을 포함할 수 있으며, 순서를 재정렬하여 유실된 RLC PDU 들을 기록하는 기능을 포함할 수 있으며, 유실된 RLC PDU들에 대한 상태 보고를 송신 측에 하는 기능을 포함할 수 있으며, 유실된 RLC PDU들에 대한 재전송을 요청하는 기능을 포함할 수 있으며, 유실된 RLC SDU가 있을 경우, 유실된 RLC SDU 이전까지의 RLC SDU들만을 순서대로 상위 계층에 전달하는 기능을 포함할 수 있으며, 혹 은 유실된 RLC SDU가 있어도 소정의 타이머가 만료되었다면 타이머가 시작되기 전에 수신된 모든 RLC SDU들을 순서대로 상위 계층에 전달하는 기능을 포함할 수 있으며, 혹은 유실된 RLC SDU가 있어도 소정의 타이머가 만료 되었다면 현재까지 수신된 모든 RLC SDU들을 순서대로 상위 계층에 전달하는 기능을 포함할 수 있다. 또한 상기 에서 RLC PDU들을 수신하는 순서대로 (일련번호, Sequence number의 순서와 상관없이, 도착하는 순으로) 처리하 여 PDCP 장치로 순서와 상관없이(Out-of sequence delivery) 전달할 수도 있으며, segment 인 경우에는 버퍼에 저장되어 있거나 추후에 수신될 segment들을 수신하여 온전한 하나의 RLC PDU로 재구성한 후, 처리하여 PDCP 장 치로 전달할 수 있다. 상기 NR RLC 계층은 접합(Concatenation) 기능을 포함하지 않을 수 있고 상기 기능을 NR MAC 계층에서 수행하거나 NR MAC 계층의 다중화(multiplexing) 기능으로 대체할 수 있다. 상기에서 NR RLC 장치의 비순차적 전달 기능(Out-of-sequence delivery)은 하위 계층으로부터 수신한 RLC SDU 들을 순서와 상관없이 바로 상위 계층으로 전달하는 기능을 말하며, 원래 하나의 RLC SDU가 여러 개의 RLC SDU 들로 분할되어 수신된 경우, 이를 재조립하여 전달하는 기능을 포함할 수 있으며, 수신한 RLC PDU들의 RLC SN 혹은 PDCP SN을 저장하고 순서를 정렬하여 유실된 RLC PDU들을 기록해두는 기능을 포함할 수 있다. NR MAC(1d-15, 1d-30)은 한 단말에 구성된 여러 NR RLC 계층 장치들과 연결될 수 있으며, NR MAC의 주요 기능 은 다음의 기능들 중 일부를 포함할 수 있다. - 맵핑 기능(Mapping between logical channels and transport channels) - 다중화 및 역다중화 기능(Multiplexing/demultiplexing of MAC SDUs) - 스케쥴링 정보 보고 기능(Scheduling information reporting) - HARQ 기능(Error correction through HARQ) - 로지컬 채널 간 우선 순위 조절 기능(Priority handling between logical channels of one UE) - 단말간 우선 순위 조절 기능(Priority handling between UEs by means of dynamic scheduling) - MBMS 서비스 확인 기능(MBMS service identification) - 전송 포맷 선택 기능(Transport format selection) - 패딩 기능(Padding) NR PHY 계층(1d-20, 1d-25)은 상위 계층 데이터를 채널 코딩 및 변조하고, OFDM 심벌로 만들어서 무선 채널로 전송하거나, 무선 채널을 통해 수신한 OFDM 심벌을 복조하고 채널 디코딩해서 상위 계층으로 전달하는 동작을 수행할 수 있다. 도 1e는 일 실시 예에 따른 차세대 무선 통신 시스템에서 RRC 유휴 모드(RRC_IDLE) 또는 RRC 비활성화 상태 (RRC_INACTIVE)에 있는 단말이 셀 재선택 평가 절차를 수행하는 방법을 설명하기 위한 도면이다. 셀 재선택 평가 절차는, RRC 유휴 모드(RRC_IDLE) 또는 RRC 비활성화 상태(RRC_INACTIVE)에 있는 단말이, 소정 의 이유 또는 이동으로 인해 현재 캠프-온(camp-on) 하고 있는 서빙 셀(Serving cell)의 서비스 품질이 주변 셀 (Neigbour cell)의 서비스 품질보다 낮아질 때, 현재 서빙 셀을 유지할 지 아니면 주변 셀로 셀을 재선택할 지 를 결정하는 절차를 의미할 수 있다. 핸드오버의 경우 망(AMF 또는 source gNB)에 의해 핸드오버 동작 여부가 결정되는 반면에, 셀 재선택의 경우 셀 측정 값을 기반으로 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말이 스스로 셀 재선택 동작 여부를 결정 할 수 있다. 상기 단말이 재선택하게 되는 셀은, 현재 캠프-온하고 있는 서빙 셀과 같은 NR 주파수(NR intra- frequency 또는 서빙 NR 주파수)를 사용하는 셀, 서빙 셀과 다른 NR 주파수(NR inter-frequency)를 사용하는 셀 또는 다른 무선 접속 기술(Radio Access, Technology, 이하 RAT)를 사용하는 주파수(inter-RAT frequency) 에 있는 셀을 의미할 수 있다. 도 1e를 참조하면, 단말(1e-01)은 NR 셀(1e-02)과 RRC 연결을 설정하여 RRC 연결 모드(RRC_CONNECTED)에 있을 수 있다(1e-03). NR 셀(1e-02)은 RRC 연결 모드에 있는 상기 단말(1e-01)과 RRC 연결을 해제하고자 RRC 연결 해제 메시지 (RRCRelease)를 전송(1e-04)할 수 있다. 상기 메시지에 유보 설정 정보(suspendConfig)가 포함되면 상기 단말 은 RRC 비활성화 모드(RRC_INACTIVE)로 천이(1e-05)할 수 있다. 상기 메시지에 suspendConfig가 포함되지 않으 면 상기 단말은 RRC 유휴 모드(RRC_IDLE)로 천이(1e-05)할 수 있다. 상기 메시지에는 상기 단말이 셀 재선택을 수행하기 위한 cellReselectionPriorities가 포함될 수 있다. cellReselectionPriorities는 freqPriorityListEUTRA, freqPriorityListNR, t320 중 적어도 하나의 값이 수납될 수 있다. 상기 단말은 t320 값이 포함되는 경우, 해당 값으로 T320 타이머를 구동할 수 있다. 구체적으로, 상기 RRCRelease 메시지에 포함 되는 설정 정보는 하기 표 0와 같을 수 있다. [표 0]"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "1e-13 단계에서 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말(1e-01)은 NR 셀(1e-02)로부터 필수 시스템 정보(essential system information)를 획득할 수 있다. 본 개시에서는 Master Information Block (MIB) 와 System Information Block 1 (SIB1)을 필수 시스템 정보로 칭할 수 있다. 1e-15 단계에서 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말(1e-01)은 1e-13 단계에서 획득한 필수 시스 템 정보를 기반으로 셀 선택 절차를 수행할 수 있다. 즉, 상기 단말은 선택한 PLMN 또는 SNPN에 속한 NR suitable cell을 찾아 해당 셀에 camp-on 할 수 있다. 상기 단말이 camp-on 한 셀을 serving cell이라고 칭할 수 있다. 본 개시에서는 3GPP 표준 문서 \"38.304: User Equipment (UE) procedures in Idle mode and RRC Inactive state\"에 기반하여 하기 표 1 조건들이 충족하는 경우 suitable cell로 정의할 수 있다. [표 1]"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "참고로, 상기 단말은 하기 수학식 1이 만족하면 셀 선택 기준(cell selection criteria)이 충족(fulfil)한다고 판단할 수 있다. [수학식 1] 수학식 1에 포함된 파라미터들의 정의는 다음과 같다."}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "1e-20 단계에서 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말(1e-01)은 셀 재선택 평가 절차를 수행하기 위해 서빙 셀(1e-02)로부터 셀 재선택 정보가 담긴 시스템 정보(일 예로, SIB2, SIB3, SIB4, SIB5)를 획득할 수 있다. SIB2에는 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말이 NR intra-frequency, NR inter- frequency, inter-RAT frequency 셀을 재선택하는데 공통으로 적용되는 정보/파라미터와 NR intra-frequency 주변 셀과 관련된 정보를 제외한 NR intra-frequency 셀 재선택 정보가 포함될 수 있다. 일 예로, SIB2 에는 서 빙 NR 주파수 (현재 캠프-온 한 셀이 속해 있는 주파수)에 대한 하나의 셀 재선택 우선 순위 설정 정보가 포함 될 수 있다. 셀 재선택 우선 순위 설정 정보란 cellReselectionPriority 와 cellReselectionSubPriority 를 의 미할 수 있다. 구체적으로, cellReselectionPriority 은 정수 값을 수납하며 (일례로, 0부터 7 중 하나의 정수 값), cellReselectionSubPriority는 소수 값을 수납 (일례로, 0.2, 0.4, 0.6, 0.8 중 하나의 소수 값)을 수납 할 수 있다. 만약 cellReselectionPriority 와 cellReselectionSubPriority이 모두 시그널링 될 경우, 단말은두 값을 더하여 셀 재선택 우선 순위 값을 도출할 수 있다. 참고로, 큰 셀 재선택 우선 순위 값이 더 높은 우선 순위를 의미한다. 구체적으로, SIB2에서 방송되는 셀 재선택 설정 정보는 하기 표 2와 같을 수 있다. [표 2]"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "SIB3은 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말이 NR intra-frequency 셀을 재선택하기 위한 주변 셀 정보/파라미터가 포함될 수 있다. 일 예로, SIB3에는 NR intra-frequency 셀을 재선택하기 위한 NR intra- frequency 셀 리스트 (intraFreqNeighCellList), NR intra-frequency 셀 재선택이 허용되는 셀 리스트 (intraFreqAllowedCellList), NR intra-frequency 셀 재선택이 허용되지 않는 셀 리스트 (intraFreqExcludedCellList)가 방송될 수 있다. 구체적으로, SIB3에는 하기 표 3의 정보가 방송될 수 있다. [표 3]"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "SIB4는 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말이 NR inter-frequency 셀을 재선택하기 위한 정보/ 파라미터가 포함될 수 있다. 일 예로, SIB4에는 하나 또는 복수 개의 NR inter-frequency를 방송할 수 있으며, 각 NR inter-frequency 별 하나의 셀 재선택 우선 순위 설정 정보를 방송할 수 있다. 각 NR inter-frequency 별 셀 재선택 우선 순위 설정 정보란 상술한 내용 (예를 들면, 각 NR inter-frequency에 매핑된 cellReselectionPriority and/or cellReselectionSubPriority)을 의미하지만, 각 inter-frequency 별 하나의 셀 재선택 우선 순위 설정 정보가 선택적(optional)으로 방송되는 특징이 있다. 구체적으로, SIB4에는 하기 표 4의 정보가 방송될 수 있다. [표 4]"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "SIB5는 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말이 inter-RAT frequency 셀을 재선택하기 위한 정보/ 파라미터가 포함될 수 있다. 일 예로, SIB5에는 하나 또는 복수 개의 EUTRA frequency를 방송할 수 있으며, 각 EUTRA frequency 별 하나의 셀 재선택 우선 순위 설정 정보를 방송할 수 있다. 각 EUTRA frequency 별 셀 재선 택 우선 순위 설정 정보란 상술한 내용 (예를 들면, 각 EUTRA frequency에 매핑된 cellReselectionPriority and/or cellReselectionSubPriority)을 의미하지만, 각 EUTRA frequency 별 하나의 셀 재선택 우선 순위 설정 정보가 선택적(optional)으로 방송되는 특징이 있다. 구체적으로, SIB5에는 하기 표 5의 정보가 방송될 수 있다.[표 5]"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말이 셀 재선택 평가 절차(cell reselection evaluation process)를 수행할 수 있다. 셀 재선택 평가 절차란 재선택 우선 순위 결정 (reselection priorities handling), 셀 재선택을 위한 측정 규칙(measurement rules for cell re-selection)을 적용하여 주파수 측정을 수행하고, 셀 재선택 기준(cell reselection criteria)를 평가하여 셀을 재선택하는 일련의 과정을 의미할 수 있다. 1e-25 단계에서 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말은 1e-04 단계에서 수신한 RRC 해제 메시지 또는 1e-20 단계에서 수신한 시스템 정보에 기반하여 재선택 우선 순위를 결정할 수 있다. 만약 1e-04 단계에서 수신한 RRC 연결 해제 메시지에 cellReselectionPriorities가 포함되어 있고 cellReselectionPriorities에 t320 타이머 값이 없는 경우 또는 t320 타이머 값이 설정되어 있어 T320 타이머가 구동 중인 경우, 상기 단말은 RRC 연결 해제 메시지에 따라 재선택 우선 순위를 결정할 수 있다. 즉, RRC 연결 해제 메시지에 포함된 celllReselectionPriorities를 적용할 수 있는 경우, 상기 단말은 RRC 연결 해제 메시지에 따라 재선택 우선 순 위를 결정할 수 있다. RRC 연결 해제 메시지에 cellReselectionPriorities가 포함되어 있지 않거나 또는 cellReselectionPriorities를 해제한 경우, 상기 단말은 1e-20 단계에서 수신한 시스템 정보에 기반하여 재선택 우선 순위를 결정할 수 있다. 본 개시를 따르는 상기 단말은 현재 캠프-온 하고 있는 서빙 셀이 속한 NR 주파수 에 매핑된 셀 재선택 우선 순위 값을 기준으로 각 NR inter-frequency 또는 inter-RAT frequency 별 셀 재선택 우선 순위가 서빙 셀이 속한 NR 주파수와 같은 셀 재선택 우선 순위를 지니는 지, 서빙 셀이 속한 NR 주파수보 다 높은 셀 재선택 우선 순위를 지니는 지, 또는 서빙 셀이 속한 NR 주파수보다 낮은 셀 재선택 우선 순위를 지니는지 결정할 수 있다. 일 예로, 1e-20 단계에서 획득한 시스템 정보에서 현재 캠프-온 하고 있는 서빙 셀이 속한 NR 주파수에 매핑된 셀 재선택 우선 순위 값이 3, inter NR frequency 1의 셀 재선택 우선 순위 값은 2, inter NR frequency 2의 셀 재선택 우선 순위 값은 3, inter NR frequency 3의 셀 재선택 우선 순위 값은 4, EUTRA frequency 1의 셀 재선택 우선 순위 값이 2 로 되어 있는 경우, 상기 단말은 inter NR frequency 1와 EUTRA frequency 1은 낮은 셀 재선택 우선 순위(lower reselection priority)로 결정하고, inter NR frequency 2의 셀 재선택 우선 순위는 동일(equal reselection priority)로 결정하고, inter NR frequency 3의 셀 재선택 우선 순위는 높은 셀 재선택 우선 순위(higher reselection priority)로 결정할 수 있다. 1e-30 단계에서 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말은 셀 재선택을 위해 주파수 측정을 수행할 수 있다. 이 때, 상기 단말은 배터리 소모를 최소화 하기 위해 1e-25 단계에서 결정한 셀 재선택 우선 순위에 따라 다음의 측정 규칙(measurement rule)을 사용하여 주파수 측정을 수행할 수 있다. -상기 단말은 하기 조건 1 이 만족하면, NR intra-frequency 측정을 수행하지 않을 수 있다. 그렇지 않을 경우 (일 예로, 하기 조건 1이 만족하지 않은 경우), 상기 단말은 NR intra-frequency 측정을 수행한다. 조건 1: 서빙 셀의 수신 레벨(Srxlev)이 SIntraSearchP 임계값보다 크고 서빙 셀의 수신 품질(Squal)이 SIntraSearchQ 임계값보다 크다 (Serving cell fulfils Srxlev > SIntraSearchP and Squal > SIntraSearchQ). -현재 서빙 셀의 NR frequency 보다 재선택 우선순위가 높은 NR inter-frequency 또는 inter-RAT frequency에 대해 단말은 3GPP TS 38.133 규격에 따라 측정을 수행할 수 있다. -현재 서빙 셀의 NR frequency 보다 재선택 우선 순위가 낮거나 같은 NR inter-frequency와 현재 서빙 셀의 NR frequency 보다 재선택 우선 순위가 낮은 inter-RAT frequency에 대해, 상기 단말은 하기 조건 2이 만족하면, 측정을 수행하지 않을 수 있다. 그렇지 않을 경우, (일 예로, 하기 조건 2이 만족하지 않은 경우), 상기 단말은 NR frequency 보다 재선택 우선 순위가 낮거나 같은 NR inter-frequency에 있는 셀들을 측정하고 또는 NR frequency 보다 재선택 우선 순위가 낮은 inter-RAT frequency에 있는 셀들을 측정한다. 조건 2: 서빙 셀의 수신 레벨(Srxlev)이 SnonIntraSearchP 임계값보다 크고 서빙 셀의 수신 품질(Squal)이 SnonIntraSearchQ 임계값보다 크다 (Serving cell fulfils Srxlev > SnonIntraSearchP and Squal > SnonIntraSearchQ). 참고로, 전술한 임계값들(SintraSearchP, SintraSearchQ, SnonIntraSearchP SnonintraSearchQ)은 1e-20 단계에 서 획득한 시스템 정보에서 방송될 수 있다. 1e-35 단계에서 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말은 1e-30 단계에서 수행한 측정 값을 기반으 로 셀 재선택 기준(cell reselection criteria)를 만족하는 셀을 재선택하고자 결정할 수 있다. 셀 재선택 기준 은 셀 재선택 우선 순위에 따라 상이한 기준이 적용될 수 있다. 셀 재선택 기준(Cell re-selection criteria)을 만족하는 여러 개의 셀이 다른 셀 재선택 우선 순위를 가지고 있을 경우 높은 셀 재선택 우선 순위를 가진 frequency/RAT 셀을 재선택하는 것이 낮은 우선순위를 가진 frequency/RAT 셀을 재선택하는 것보다 우선된다 (Cell reselection to a higher priority RAT/frequency shall take precede over a lower priority RAT/frequency if multiple cells of different priorities fulfil the cell reselection criteria). 구체적 으로, 현재 서빙 셀의 주파수보다 우선순위가 높은 inter-frequency/inter-RAT 셀의 재선택 기준에 대한 단말의 동작은 아래와 같다. -제 1 동작: 만약 SIB2에 threshServingLowQ에 대한 임계값이 포함되어 방송되며 상기 단말이 현재 서빙 셀에 캠프-온 한 지 1초가 지난 경우, inter-frequency/inter-RAT 셀의 신호 품질(Squal)이 특정 시간 TreselectionRAT 동안 임 계값 ThreshX,HighQ 보다 크면(Squal > ThreshX,HighQ during a time interval TreselectionRAT), 단말은 해당 inter-frequency/inter-RAT 셀로의 재선택을 수행한다. -제 2 동작: 상기 단말은 제 1 동작을 수행하지 못할 경우, 제 2 동작을 수행한다. 상기 단말이 현재 서빙 셀에 캠프-온 한지 1초가 지나고 inter-frequency/inter-RAT 셀의 수신 레벨 (Srxlev)이 특정 시간 TreselectionRAT 동안 임계값 ThreshX,HighP 보다 크면(Srxlev > ThreshX,HighP duringa time interval Treselection-RAT-), 단말은 해당 inter-frequency/inter-RAT 셀로의 재선택을 수행한다. 여기서 단말은 inter-frequency 셀의 신호 품질(Squal), 수신 레벨(Srxlev), 임계값들(ThreshX,HighQ, ThreshX,HighP), TreselectionRAT 값들은 서빙 셀에서 방송되는 SIB4에 포함되어 있는 정보를 기반으로 상기 제 1 동작 혹은 제 2 동작을 수행하며, inter-RAT 셀의 신호 품질(Squal), 수신 레벨(Srxlev), 임계값 (ThreshX,HighQ, ThreshX,HighP), TreselectionRAT 값들은 서빙 셀에서 방송되는 SIB5에 포함되어 있는 정보를 기반으로 상기 제 1 동작 혹은 제 2 동작을 수행한다. 일 예로, SIB4에는 값 혹은 값 등이 포함되어 있으며 이를 기반으로 inter-frequency 셀의 신호 품질(Squal) 혹은 수신 레벨(Srxlev)을 도출한다. 만약 높은 셀 재선택 우선 순위를 만족하는 NR 주파수에 있는 셀들이 복수 개가 존재하는 경우, 상기 단말은 하 기 상술하는 현재 서빙 셀의 주파수와 동일한 우선순위를 가지고 있는 intra-frequency/inter-frequency 셀의 재선택 기준을 만족하는 셀들에서 제일 rank가 높은 셀(highest ranked cell)로 재선택할 수 있다. 또한 현재 서빙 셀의 주파수와 동일한 우선순위를 가지고 있는 intra-frequency/inter-frequency 셀의 재선택 기준에 대한 단말의 동작은 아래와 같다. -제 3 동작: intra-frequency/inter-frequency 셀의 신호 품질(Squal)과 수신 레벨(Srxlev)이 0 보다 큰 경우, 측정값 (RSRP)를 기반으로 셀 별 Rank를 도출한다(The UE shall perform ranking of all cells that fulfils the cell selection criterion S). 서빙 셀과 주변 셀의 Rank는 아래의 수학식 2를 통해 각각 계산된다. [수학식 2]"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "여기서 는 서빙 셀의 RSRP 측정값, 는 주변 셀의 RSRP 측정값, 는 서빙 셀의 hysteresis 값, Qoffset은 서빙 셀과 주변 셀간의 오프셋이다. SIB2에 값이 포함되어 있으며, 해당 값은 intra-frequency/inter-frequency 셀의 재선택에 대해 공통으로 사용된다. Intra-frequency 셀의 재선택 의 경우, Qoffset은 셀 별로 시그널링 되며, 지시된 셀에 대해서만 적용되며, SIB3에 포함되어 있다. Inter- frequency 셀의 재선택의 경우, Qoffset은 셀 별로 시그널링 되며, 지시된 셀에 대해서만 적용되며, SIB4에 포 함되어 있다. 상기의 수학식 2로부터 구해진 주변 셀의 Rank가 서빙 셀의 Rank보다 큰 경우(Rn > Rs)에 대해, 주변 셀 중 최적의 셀로 재선택 한다. 여기서 는 셀에 일시적으로 적용되는 오프셋으로 SIB1에서 방송되는 ConnEstFailureControld에 포함 된 connEstFailOffset을 의미할 수 있으며, RRC 연결 실패 시(예를 들어, T300 타이머 만료시) 적용할 수 있다. 또한, 현재 서빙 셀의 주파수보다 우선순위가 낮은 inter-frequency/inter-RAT 셀의 재선택 기준에 대한 단말의 동작은 아래와 같다. -제 4 동작: 약 SIB2에 threshServingLowQ에 대한 임계값이 포함되어 방송되며 상기 단말이 현재 서빙 셀에 캠프-온 한지 1초가 지난 경우, 현재 서빙 셀의 신호 품질(Sqaul)이 임계값 ThreshServing,LowQ 보다 작고(Squal < ThreshServing,LowQ) inter-frequency/inter-RAT 셀의 신호 품질(Squal)이 특정 시간 TreselectionRAT 동안 임 계값 ThreshX,LowQ- 보다 크면(Squal > ThreshX,LowQ during a time interval TreselectionRAT), 단말은 해당 inter-frequency/inter-RAT 셀로의 재선택을 수행한다. -제 5 동작: 상기 단말은 제 4 동작을 수행하지 못할 경우, 제 5 동작을 수행한다. 상기 단말이 현재 서빙 셀에 캠프-온 한지 1초가 지나고, 현재 서빙 셀의 수신 레벨(Srxlev)이 임계값 ThreshServing,LowP 보다 작고(Srxlev < ThreshServing,LowP) inter-frequency/inter-RAT 셀의 수신 레벨 (Srxlev)이 특정 시간 TreselectionRAT 동안 임계값 ThreshX,LowP- 보다 크면(Srxlev > ThreshX,LowP during a time interval TreselectionRAT), 단말은 해당 inter-frequency/inter-RAT 셀로의 재선택을 수행한다. 여기서 단말의 inter-frequency 셀에 대한 제 4 동작 혹은 제 5 동작은 서빙 셀에서 방송되는 SIB2에 포함되어 있는 임계값들(ThreshServing,LowQ, ThreshServing,LowP)과 서빙 셀에서 방송되는 SIB4에 포함되어 있는 inter-frequency 셀의 신호 품질(Squal), 수신 레벨(Srxlev), 임계값들(ThrehX,LowQ, ThreshX,LowP), TreselectionRAT를 기반으로 수행하며, 단말의 inter-RAT 셀에 대한 제 4 동작 혹은 제 5 동작은 서빙 셀에서 방송되는 SIB2에 포함되어 있는 임계값들(ThreshServing, LowQ, ThreshServing, LowP)과 서빙 셀에서 방송되는 SIB5에 포함되어 있는 inter-RAT 셀의 신호 품질(Squal), 수신 레벨(Srxlev), 임계값들(ThreshX,LowQ, ThreshX, LowP), TreselectionRAT를 기반으로 수행한다. 일 예로, SIB4에는 값 혹은 값 등 이 포함되어 있으며 이를 기반으로 inter-frequency 셀의 신호 품질(Squal) 혹은 수신 레벨(Srxlev)을 도출한다. 만약 높은 셀 재선택 우선 순위를 만족하는 NR 주파수에 있는 셀들이 복수 개가 존재하는 경우, 상기 단말은 하기 상술하는 현재 서빙 셀의 주파수와 동일한 우선순위를 가지고 있는 intra-frequency/inter- frequency 셀의 재선택 재선택 기준을 만족하는 셀들에서 제일 rank가 높은 셀(highest ranked cell)로 재선택 할 수 있다. 1e-40 단계에서 RRC 유휴 모드 또는 RRC 비활성화 상태에 있는 단말은 후보 타겟 셀(candidate target cell)을 최종적으로 재선택하기 전에 후보 타겟 셀에서 방송되는 시스템 정보(예를 들면 MIB 혹은 SIB1)를 수신하고, 수 신한 시스템 정보에 기반하여 후보 타겟 셀의 수신 레벨(Srxlev)과 수신 품질(Squal)이 S-criterion (수학식 1) 이라고 칭해지는 셀 선택 기준(Cell selection criterion)을 충족(Srxlev > 0 AND Squal > 0)하는 지 판단한다. 상기 단말은 수학식 1이 충족하고 후보 타겟 셀이 suitable 하면, 상기 후보 타겟 셀을 재선택할 수 있다. 도 1f는 실시 예에 따른 차세대 무선 통신 시스템에서 저전력 웨이크업 수신기를 지원하는 단말이 셀 재선택을 수행하는 방법을 설명하기 위한 도면이다. 본 개시의 일 실시 예를 따르는 단말(1f-01)은 주요 라디오(Main Radio, 이하 MR)와 저전력 웨이크업 수신기 (Low Power Wake-Up Receiver, 이하 LR)을 장착하여 소정의 동작을 수행할 수 있다. 단말 내 장착된 MR (1f- 02)은 저전력 웨이크업 신호들/채널과는 별개의 NR 신호들/채널들을 위해 동작하는 송수신기 모듈 (Tx/Rx module operating for NR signals/channels apart from signals/channels related to low-power wake-up)을 의미할 수 있다., 일 예로, 상기 단말은 MR 을 통해 기지국이 전송하는 웨이크업 신호(wake-up signal, 이하 WUS)를 수신할 수 있으며, 이를 바탕으로 상기 단말은 페이징 메시지를 추가적으로 수신해야 하는 지 판단할 수 있다. 또는 상기 단말은 MR 을 통해 기지국이 전송하는 SSB (Synchronization Signal/PBCH block) 을 수신할 수 있으며, 이를 바탕으로 상기 단말은 셀을 선택 또는 재선택할 수 있다. 참고로, 전술한 실시 예를 따르는 단 말은 MR 만 장착하고 있는 단말을 의미한다. 단말 내 추가적으로 장착된 LR (1f-03)은 저전력 웨이크업과 관련 된 신호들/채널들을 수신 또는 프로세싱하기 위해 동작하는 수신기 모듈(Rx module operating for receiving/processing signals/channels related to low-power wake-up)을 의미할 수 있다. 일 예로, 상기 단 말은 LR 을 통해 기지국이 전송하는 저전력 웨이크업 신호 (low power wake-up signal, 이하 LP-WUS)를 수신할 수 있으며, 이를 바탕으로 상기 단말은 MR 을 끌 지 켤 지 판단하여 기지국이 전송하는 WUS 를 수신할 지 또는 페이징 메시지를 수신할 지 판단할 수 있다. 또는 상기 단말은 LR 을 통해 기지국이 전송하는 저전력 동기 신호 (low power synchronization signal, 이하 LP-SS)를 수신할 수 있으며, 이를 바탕으로 주변 셀들을 측정할 지 또는 LP-WUS 수신 가능성 여부 등을 판단할 수 있다. LP-WUS/LP-SS 는 WUS/SSB 대비 더 적은 채널 대역폭 (channel bandwidth), 저복잡도 채널 코딩(low complex channel coding) 등을 사용하기 때문에, LR 사용 시 소 모되는 전력은 MR 대비 적으므로, 상기 단말은 소정의 조건에 따라 MR 을 끄고 LR 을 사용함으로써 전력 절감 (power saving) 효과를 얻을 수 있다. 전력 절감을 위해, 상기 단말은 LR 을 통해 수신한 저전력 웨이크업과 관 련된 신호에 기반하여 MR 을 켜야 하는 지 꺼야 하는 지 판단할 수 있다. 참고로, 상기 단말의 MR 을 끈 상태를 ultra-deep-sleep 상태라고 칭할 수 있다. 도 1f를 참조하면, 단말(1f-01)은 NR 셀(1f-05)과 RRC 연결을 설정하여 RRC 연결 모드(RRC_CONNECTED)에 있을 수 있다(1f-06) 1f-07 단계에서, 상기 단말(1f-01)은 상기 기지국(1f-05)의 요청에 따라 단말 능력 정보 메시지 (UECapabilityInformation)을 전송할 수 있다. 상기 메시지에는 LR 을 지원 여부를 나타내는 지시자 또는 LR 지 원에 따라 수정된 셀 재선택 절차를 수행할 수 있는 지시자 중 적어도 하나가 포함될 수 있다. 1f-08 단계에서, 상기 NR 기지국(1f-05)은 RRC 연결 해제 메시지(RRCRelease)를 상기 단말(1f-01)에게 전송할 수 있다. 상기 메시지에는 LP-WUS and/or LP-SS 을 지원하는 셀을 선택 또는 재선택한 경우 상기 단말은 해당 셀이 속한 주파수를 가장 높은 셀 재선택 우선 순위로 결정하라는 지시자가 포함될 수 있다. 1f-10 단계에서, 상기 단말(1f-01)은 RRC 유휴 모드(RRC_IDLE) 또는 RRC 비활성화 모드(RRC_INACTIVE)로 천이 할 수 있다. 이는 전술한 실시 예를 따를 수 있다. 1f-15 단계에서, 상기 단말(1f-01)은 MR(1f-02)을 통해 NR 셀(1f-05)이 방송하는 필수 시스템 정보(essential system information)를 수신할 수 있다. 본 개시에서는 Master Information Block (MIB) 와 System Information Block 1 (SIB1)을 필수 시스템 정보로 칭할 수 있다. 상기 필수 시스템 정보 (MIB or SIB1)에는 LR 을 지원하는 단말에게 적용될 수 있는 소정의 정보가 포함될 수 있다. 상기 소정의 정보란 다음 중 적어도 하나를 의미할 수 있다. -Low-Power Synchronization Signal (LP-SS) 전송 여부 지시자 또는 LP-SS 에 대한 설정 정보 -Low-Power Wake-up Signal (LP-WUS) 을 전송 여부 지시자 또는 LP-WUS 에 대한 설정 정보 - :LR 을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 수 신 레벨 값 - :LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 품 질 레벨 값 - :LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 수 신 레벨 오프셋 값 - :LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 품 질 레벨 오프셋 값 1f-20 단계에서, 상기 단말(1f-01)은 1f-15 단계에서 수신한 필수 시스템 정보를 기반으로 셀 선택 절차를 수행 할 수 있다. 상기 단말은 선택한 PLMN 또는 SNPN 에 속한 NR suitable cell 을 찾아 해당 셀에 camp-on 할 수 있다. Suitable cell 에 대한 정의는 전술한 실시 예를 따를 수 있다. LR 을 지원하는 단말(1f-01)은 LP-WUS 및/또는 LP-SS 을 지원하는 셀(1f-05)을 선택 또는 재선택 하면 전력을 효율적으로 절감할 수 있기 때문에, 본 개시를 따르는 단말(1f-01)은 하기 제안하는 방법 중 적어도 하나 (즉, 하기 방법을 조합하여 수행해도 되고 또 는 하나의 방법만을 수행해도 된다)를 통해 셀 선택 수신 신호 레벨 값(Srxlev)과 셀 선택 신호 품질 값(Squa l)을 도출하고, Srxlev 와 Squal 이 모두 0 보다 큰 경우, 셀 선택 기준 (cell selection criterion)이 충족 (fulfil)한다고 판단할 수 있다. -방법 1: LR 을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 수신 레 벨 값과 최소 품질 레벨 값을 적용하여 Srxlev 와 Squal 을 도출"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "참고로, 와 를 적용하는 것을 제외한 나머지 부분들은 전술한 실시 예를 따를 수 있다. 이 때, , , , 중 적어도 하나가 상기 단말에게 적용 이 되지 않을 수 있으며, 이럴 경우 상기 단말은 해당 값을 0으로 간주 할 수 있다 (즉, 해당 파라미터를 Srxlev 와 Squal 에 고려하지 않을 수 있다). -방법 2: LR 을 지원하는 단말이 적용할 수 있는 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최 소 신호 수신 레벨 오프셋 값과 최소 품질 레벨 오프셋 값을 적용하여 Srxlev 와 Squal 을 도출(option 1)"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "(option 2)"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "참고로, 와 를 추가로 적용하는 것을 제외한 나머지 부분들은 전술한 실시 예를 따를 수 있다. 상기 제안하는 두 옵션의 차이는 상기 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 우선 시 하여 선 택하는 정도를 상대적으로 제어하는 것이다 (즉, Option 1 은 상기 단말이 LP-WUS and/or LP-SS 을 지원하는 셀 을 덜 선택하게 할 수 있는 반면, Option 2 은 상기 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 더 선택하게 할 수 있다). 물론, 와 이 시그널링될 수 있는 값의 범위가 어떻게 정의되냐에 따라 Option 1 과 Option 2 은 하나로 표현될 수도 있다. , , , , , , 중 적어도 하나가 상기 단말에게 적용이 되지 않을 수 있으며, 이 럴 경우 상기 단말은 해당 값을 0으로 간주 할 수 있다 (즉, 해당 파라미터를 Srxlev 와 Squal 에 고려하지 않 을 수 있다). - 방법 3: LR 을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 수신 레벨 값과 이에 대한 오프셋 값, 최소 품질 레벨 값과 이에 대한 오프셋 값 적용하여 Srxlev 와 Squal 을 도출"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "참고로, 와 를 적용하는 것은 방법 2 에서 제안한 Option 2 가 상기 방법 3 에 적용 될 수도 있다. 상기 단말은 MR 을 통해 (즉, MR을 통해 기지국이 전송하는 신호/메시지) 또는 LR 을 통해 (즉, LR 을 통해 기 지국이 전송하는 LP-SS 또는 LP-WUS) Srxlev 와 Squal 을 도출하여 셀을 선택할 수 있다. 또는 상기 단말은 MR 을 통해 전술한 실시 예를 바탕으로 셀 선택 기준 충족 여부를 판단한 후 LR 을 통해 본 개시에서 제안하는 방 법을 통해 추가적으로 셀 선택 기준 충족 여부를 판단하여 셀을 선택할 수도 있다. 1f-25 단계에서, 상기 단말(1f-01)은 셀 재선택 평가 절차를 수행하기 위해 서빙 셀(1f-05)로부터 셀 재선택 정 보가 담긴 시스템 정보 (일례로, SIB2, SIB3, SIB4, SIB5)를 획득할 수 있다. 이는 전술한 실시 예를 따를 수 있다. 본 개시에서는 상기 시스템 정보에 LR 을 지원하는 단말에게 적용될 수 있는 소정의 정보가 포함될 수 있 다. 상기 소정의 정보란 다음 중 적어도 하나를 의미할 수 있다. - : LR 을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 재선택할 때 요구되는 최소 신호 수신 레벨 값 상기 값은 주파수 별 시그널링 될 수 있다. - : LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 재선택할 때 요구되는 최소 신호 품질 레벨 값 상기 값은 주파수 별 시그널링 될 수 있다. - : LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 재선택할 때 요구되는 최소 신호 수신 레벨 오프셋 값 상기 값은 각 주파수 내 셀 별 시그널링 될 수 있으며, 이 때 셀을 나타내는 물리적 셀 식별자(Physical Cell Id, PhyCellId)가 시그널링 될 수 있다. - : LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 품 질 레벨 오프셋 값 상기 값은 각 주파수 내 셀 별 시그널링 될 수 있으며, 이 때 셀을 나타내는 물리적 셀 식별자(Physical Cell Id, PhyCellId)가 시그널링 될 수 있다. -주파수 별 LP-WUS and/or LP-SS 을 지원하는 단말이 허용 가능한 셀 리스트 상기 단말은 상기 리스트에 포함된 셀들만 셀 재선택을 위한 후보 셀로 간주할 수 있다. -주파수 별 LP-WUS and/or LP-SS 을 지원하는 단말이 제외해야 하는 셀 리스트 상기 단말은 상기 리스트에 포함된 셀들을 셀 재선택을 위한 후보 셀로 간주하지 않을 수 있다. -서빙 셀이 속한 주파수 (intra-frequency)에서 LP-WUS and/or LP-SS 을 지원하는 주변 셀 별 QoffsetLR 값 상기 QoffsetLR 값은 서빙 셀과 서빙 셀이 속한 주파수 내 주변 셀 간의 오프셋이다. 상기 값은 전술한 실시 예에서의 Rank (수학식 2) 도출 시 사용되며, 다음 중 적어도 하나의 방법으로 적용될 수 있다. 방법 1:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "방법 2:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "-서빙 셀과 다른 주파수 (inter-frequency) 별 LP-WUS and/or LP-SS 을 지원하는 주변 셀 별 QoffsetLR 값 상기 QoffsetLR 값은 서빙 셀과 서빙 셀과 다른 NR 주파수 내 주변 셀 간의 오프셋이다. 상기 값은 전술한 실시 예에서의 Rank (수학식 2) 도출 시 사용되며, 다음 중 적어도 하나의 방법으로 적용될 수 있다. 방법 1:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 19, "content": "방법 2:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 20, "content": "방법 3:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 21, "content": "상기 단말(1f-01)은 셀 재선택 평가 절차(cell reselection evaluation process)를 수행할 수 있다. 셀 재선택 평가 절차란 재선택 우선 순위 결정 (reselection priorities handling), 셀 재선택을 위한 측정 규칙 (measurement rules for cell re-selection)을 적용하여 주파수 측정을 수행하고, 셀 재선택 기준(cell reselection criteria)를 평가하여 셀을 재선택하는 일련의 과정을 의미할 수 있다. 1f-30 단계에서, 본 개시를 따르는 상기 단말(1f-01)은 하기 제안하는 방법 중 적어도 하나 (즉, 하기 방법을 조합하여 수행해도 되고 또는 하나의 방법만을 수행해도 된다)를 통해 셀 재선택 우선 순위를 결정할 수 있다. -방법 1: LP-WUS and/or LP-SS 을 지원하는 셀에 캠프-온 또는 재선택하는 경우, 상기 단말은 서빙 주파수를 가 장 높은 셀 재선택 우선 순위로 결정할 수 있다. -방법 2: 수신한 시스템 정보(1f-15, 1f-25)에서 서빙 주파수가 LP-WUS and/or LP-SS 를 지원한다는 지시자가 방송되는 경우, 상기 단말은 서빙 주파수를 가장 높은 셀 재선택 우선 순위로 결정할 수 있다.-방법 3: 수신한 RRC 연결 해제 메시지(1f-08)에서 LP-WUS and/or LP-SS 을 지원하는 셀을 선택 또는 재선택할 시 해당 셀이 속한 주파수를 가장 높은 셀 재선택 우선 순위로 결정하라는 지시자가 포함되어 있는 경우, 상기 단말은 서빙 주파수를 가장 높은 셀 재선택 우선 순위로 결정할 수 있다. 1f-35 단계에서, 상기 단말(1f-01)은 셀 재선택을 위해 주파수 측정을 수행할 수 있다. 이는 전술한 실시 예를 따를 수 있다. 1f-40 단계에서, 상기 단말(1f-01)은 1f-35 단계에서 수행한 측정 값을 기반으로 셀 재선택 기준(cell reselection criteria)를 만족하는 셀을 재선택하고자 결정할 수 있다. 이는 전술한 실시 예를 따를 수 있다. 본 개시를 따르는 상기 단말(1f-01)은 1f-25 단계에서 수신한 시스템 정보를 적용하여 주변 셀의 신호 수신 레 벨 값(Srxlev) 과 신호 품질 값(Squal)을 1f-20 단계에서 제안한 방법에 따라 도출할 수 있다. 본 개시를 따르 는 상기 단말(1f-01)은 전술한 실시 예 또는 1f-25 단계에서 제안하는 방법에 따라 셀 별 Rank 를 도출할 수 있 다. 1f-45 단계에서 상기 단말(1f-01)은 후보 타겟 셀(candidate target cell)을 최종적으로 재선택하기 전에 후보 타겟 셀에서 방송되는 시스템 정보(예를 들면 MIB 혹은 SIB1)를 수신하고, 수신한 시스템 정보에 기반하여 후보 타겟 셀의 셀 선택 수신 신호 레벨 값(Srxlev)과 셀 선택 신호 품질 값 (Squal)이 모두 0 보다 큰 지 (즉, 셀 선택 기준(Cell selection criterion)을 충족(Srxlev > 0 AND Squal > 0) 판단한다. 상기 단말은 셀 선택 기준 충족하고 후보 타겟 셀이 suitable 하면, 상기 후보 타겟 셀을 재선택할 수 있다. 도 1g는 일 실시 예에 따른 차세대 무선 통신 시스템에서 저전력 웨이크업 수신기를 지원하는 단말이 셀 재선택 을 수행하는 방법을 설명하기 위한 도면이다. 본 개시의 일 실시 예를 따르는 단말(1g-01)은 주요 라디오(Main Radio, 이하 MR)와 저전력 웨이크업 수신기 (Low Power Wake-Up Receiver, 이하 LR)을 장착하여 소정의 동작을 수행할 수 있다. 단말 내 장착된 MR (1f- 02)은 저전력 웨이크업 신호들/채널과는 별개의 NR 신호들/채널들을 위해 동작하는 송수신기 모듈 (Tx/Rx module operating for NR signals/channels apart from signals/channels related to low-power wake-up)을 의미할 수 있다. 일 예로, 상기 단말은 MR 을 통해 기지국이 전송하는 웨이크업 신호(wake-up signal, 이하 WUS)를 수신할 수 있으며, 이를 바탕으로 상기 단말은 페이징 메시지를 추가적으로 수신해야 하는 지 판단할 수 있다. 또는 상기 단말은 MR 을 통해 기지국이 전송하는 SSB (Synchronization Signal/PBCH block) 을 수신할 수 있으며, 이를 바탕으로 상기 단말은 셀을 선택 또는 재선택할 수 있다. 참고로, 전술한 실시 예를 따르는 단 말은 MR 만 장착하고 있는 단말을 의미한다. 단말 내 추가적으로 장착된 LR (1f-03)은 저전력 웨이크업과 관련 된 신호들/채널들을 수신 또는 프로세싱하기 위해 동작하는 수신기 모듈(Rx module operating for receiving/processing signals/channels related to low-power wake-up)을 의미할 수 있다. 일 예로, 상기 단 말은 LR 을 통해 기지국이 전송하는 저전력 웨이크업 신호 (low power wake-up signal, 이하 LP-WUS)를 수신할 수 있으며, 이를 바탕으로 상기 단말은 MR 을 끌 지 켤 지 판단하여 기지국이 전송하는 WUS 를 수신할 지 또는 페이징 메시지를 수신할 지 판단할 수 있다. 또는 상기 단말은 LR 을 통해 기지국이 전송하는 저전력 동기 신호 (low power synchronization signal, 이하 LP-SS)를 수신할 수 있으며, 이를 바탕으로 주변 셀들을 측정할 지 또는 LP-WUS 수신 가능성 여부 등을 판단할 수 있다. LP-WUS/LP-SS 는 WUS/SSB 대비 더 적은 채널 대역폭 (channel bandwidth), 저복잡도 채널 코딩(low complex channel coding) 등을 사용하기 때문에, LR 사용 시 소 모되는 전력은 MR 대비 적으므로, 상기 단말은 소정의 조건에 따라 MR 을 끄고 LR 을 사용함으로써 전력 절감 (power saving) 효과를 얻을 수 있다. 전력 절감을 위해, 상기 단말은 LR 을 통해 수신한 저전력 웨이크업과 관 련된 신호에 기반하여 MR 을 켜야 하는 지 꺼야 하는 지 판단할 수 있다. 참고로, 상기 단말의 MR 을 끈 상태를 ultra-deep-sleep 상태라고 칭할 수 있다. 도 1g를 참조하면, 단말(1g-01)은 NR 셀(1g-05)과 RRC 연결을 설정하여 RRC 연결 모드(RRC_CONNECTED)에 있을 수 있다(1g-06) 1g-07 단계에서, 상기 단말(1g-01)은 상기 기지국(1g-05)의 요청에 따라 단말 능력 정보 메시지 (UECapabilityInformation)을 전송할 수 있다. 상기 메시지에는 LR 을 지원 여부를 나타내는 지시자 또는 LR 지 원에 따라 수정된 셀 재선택 절차를 수행할 수 있는 지시자 중 적어도 하나가 포함될 수 있다. 1g-08 단계에서, 상기 NR 기지국(1g-05)은 RRC 연결 해제 메시지(RRCRelease)를 상기 단말(1g-01)에게 전송할 수 있다. 이는 전술한 실시 예들 중 적어도 하나를 따를 수 있다. 상기 메시지에는 LP-WUS and/or LP-SS 을 지 원하는 주파수 별 셀 재선택 우선 순위 값이 포함될 수 있다. 또는 상기 메시지에는 시스템 정보에서 방송되는LP-WUS and/or LP-SS 을 지원하는 주파수 별 셀 재선택 우선 순위 값을 적용하라는 지시자가 포함될 수 있다. 상기 메시지에는 상기 지시자 또는 상기 우선 순위 값과 연관된 t320 값 또는 신규 타이머 값이 포함될 수 있다. 상기 단말은 해당 값으로 타이머를 구동할 수 있다. 참고로, LP-WUS and/or LP-SS 을 지원하는 주파수 별 셀 재선택 우선 순위 값은 전술한 실시 예 (도 1e) 처럼 시그널링 될 수도 있고 또는 전술한 실시 예 (도 1e)에 서 도출한 셀 재선택 우선 순위 값에 오프셋으로 시그널링 되어 전술한 실시 예 (도 1e)에서 도출한 셀 재선택 우선 순위 값과 본 개시에서 시그널링 된 값을 더한 값이 최종 셀 재선택 우선 순위 값이 될 수 있다. 1g-10 단계에서, 상기 단말(1g-01)은 RRC 유휴 모드(RRC_IDLE) 또는 RRC 비활성화 모드(RRC_INACTIVE)로 천이 할 수 있다. 이는 전술한 실시 예를 따를 수 있다. 1g-15 단계에서, 상기 단말(1g-01)은 MR(1g-02)을 통해 NR 셀(1g-05)이 방송하는 필수 시스템 정보(essential system information)를 수신할 수 있다. 본 개시에서는 Master Information Block (MIB) 와 System Information Block 1 (SIB1)을 필수 시스템 정보로 칭할 수 있다. 상기 필수 시스템 정보 (MIB or SIB1)에는 LR 을 지원하는 단말에게 적용될 수 있는 소정의 정보가 포함될 수 있다. 상기 소정의 정보란 다음 중 적어도 하나를 의미할 수 있다. -Low-Power Synchronization Signal (LP-SS) 전송 여부 지시자 또는 LP-SS 에 대한 설정 정보 -Low-Power Wake-up Signal (LP-WUS) 을 전송 여부 지시자 또는 LP-WUS 에 대한 설정 정보 - :LR 을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 수 신 레벨 값 - :LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 품 질 레벨 값 - :LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 수 신 레벨 오프셋 값 - :LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 품 질 레벨 오프셋 값 1g-20 단계에서, 상기 단말(1g-01)은 1g-15 단계에서 수신한 필수 시스템 정보를 기반으로 셀 선택 절차를 수행 할 수 있다. 상기 단말은 선택한 PLMN 또는 SNPN 에 속한 NR suitable cell 을 찾아 해당 셀에 camp-on 할 수 있다. Suitable cell 에 대한 정의는 전술한 실시 예를 따를 수 있다. LR 을 지원하는 단말(1g-01)은 LP-WUS 및/또는 LP-SS 을 지원하는 셀(1g-05)을 선택 또는 재선택 하면 전력을 효율적으로 절감할 수 있기 때문에, 본 개시를 따르는 단말(1g-01)은 하기 제안하는 방법 중 적어도 하나 (즉, 하기 방법을 조합하여 수행해도 되고 또 는 하나의 방법만을 수행해도 된다)를 통해 셀 선택 수신 신호 레벨 값(Srxlev)과 셀 선택 신호 품질 값(Squa l)을 도출하고, Srxlev 와 Squal 이 모두 0 보다 큰 경우, 셀 선택 기준 (cell selection criterion)이 충족 (fulfil)한다고 판단할 수 있다. -방법 1: LR 을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 수신 레 벨 값과 최소 품질 레벨 값을 적용하여 Srxlev 와 Squal 을 도출"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 22, "content": "참고로, QrxlevminLP 와 QqualminLP 를 적용하는 것을 제외한 나머지 부분들은 전술한 실시 예를 따를 수 있다. 이 때, Qrxlevminoffset, Pcompensation, Qoffsettemp, Qqualminoffset 중 적어도 하나가 상기 단말에게 적용이 되지 않을 수 있으며, 이럴 경우 상기 단말은 해당 값을 0으로 간주 할 수 있다 (즉, 해당 파라미터를 Srxlev 와 Squal 에 고려하지 않을 수 있다). -방법 2: LR 을 지원하는 단말이 적용할 수 있는 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최 소 신호 수신 레벨 오프셋 값과 최소 품질 레벨 오프셋 값을 적용하여 Srxlev 와 Squal 을 도출(option 1)"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 23, "content": "(option 2)"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 24, "content": "참고로, 와 를 추가로 적용하는 것을 제외한 나머지 부분들은 전술한 실시 예를 따를 수 있다. 상기 제안하는 두 옵션의 차이는 상기 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 우선 시 하여 선 택하는 정도를 상대적으로 제어하는 것이다 (즉, Option 1 은 상기 단말이 LP-WUS and/or LP-SS 을 지원하는 셀 을 덜 선택하게 할 수 있는 반면, Option 2 은 상기 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 더 선택하게 할 수 있다). 물론, 와 이 시그널링될 수 있는 값의 범위가 어떻게 정의되냐에 따라 Option 1 과 Option 2 은 하나로 표현될 수도 있다. , , , , , , 중 적어도 하나가 상기 단말에게 적용이 되지 않을 수 있으며, 이 럴 경우 상기 단말은 해당 값을 0으로 간주 할 수 있다 (즉, 해당 파라미터를 Srxlev 와 Squal 에 고려하지 않 을 수 있다). - 방법 3: LR 을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 수신 레벨 값과 이에 대한 오프셋 값, 최소 품질 레벨 값과 이에 대한 오프셋 값 적용하여 Srxlev 와 Squal 을 도출"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 25, "content": "참고로, 와 를 적용하는 것은 방법 2 에서 제안한 Option 2 가 상기 방법 3 에 적용 될 수도 있다. 상기 단말은 MR 을 통해 (즉, MR을 통해 기지국이 전송하는 신호/메시지) 또는 LR 을 통해 (즉, LR 을 통해 기 지국이 전송하는 LP-SS 또는 LP-WUS) Srxlev 와 Squal 을 도출하여 셀을 선택할 수 있다. 또는 상기 단말은 MR 을 통해 전술한 실시 예를 바탕으로 셀 선택 기준 충족 여부를 판단한 후 LR 을 통해 본 개시에서 제안하는 방 법을 통해 추가적으로 셀 선택 기준 충족 여부를 판단하여 셀을 선택할 수도 있다. 1g-25 단계에서, 상기 단말(1g-01)은 셀 재선택 평가 절차를 수행하기 위해 서빙 셀(1g-05)로부터 셀 재선택 정 보가 담긴 시스템 정보 (일례로, SIB2, SIB3, SIB4, SIB5)를 획득할 수 있다. 이는 전술한 실시 예를 따를 수 있다. 본 개시에서는 상기 시스템 정보에 LR 을 지원하는 단말에게 적용될 수 있는 소정의 정보가 포함될 수 있 다. 상기 소정의 정보란 다음 중 적어도 하나를 의미할 수 있다. - : LR 을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 재선택할 때 요구되는 최소 신호 수신 레벨 값 상기 값은 주파수 별 시그널링 될 수 있다. - : LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 재선택할 때 요구되는 최소 신호 품질 레벨 값 상기 값은 주파수 별 시그널링 될 수 있다. - : LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 재선택할 때 요구되는 최소 신호 수신 레벨 오프셋 값 상기 값은 각 주파수 내 셀 별 시그널링 될 수 있으며, 이 때 셀을 나타내는 물리적 셀 식별자(Physical Cell Id, PhyCellId)가 시그널링 될 수 있다. - : LR을 지원하는 단말이 LP-WUS and/or LP-SS 을 지원하는 셀을 선택할 때 요구되는 최소 신호 품 질 레벨 오프셋 값 상기 값은 각 주파수 내 셀 별 시그널링 될 수 있으며, 이 때 셀을 나타내는 물리적 셀 식별자(Physical Cell Id, PhyCellId)가 시그널링 될 수 있다. -주파수 별 LP-WUS and/or LP-SS 을 지원하는 단말이 허용 가능한 셀 리스트 상기 단말은 상기 리스트에 포함된 셀들만 셀 재선택을 위한 후보 셀로 간주할 수 있다. -주파수 별 LP-WUS and/or LP-SS 을 지원하는 단말이 제외해야 하는 셀 리스트 상기 단말은 상기 리스트에 포함된 셀들을 셀 재선택을 위한 후보 셀로 간주하지 않을 수 있다. -서빙 셀이 속한 주파수 (intra-frequency)에서 LP-WUS and/or LP-SS 을 지원하는 주변 셀 별 QoffsetLR 값 상기 QoffsetLR 값은 서빙 셀과 서빙 셀이 속한 주파수 내 주변 셀 간의 오프셋이다. 상기 값은 전술한 실시 예에서의 Rank (수학식 2) 도출 시 사용되며, 다음 중 적어도 하나의 방법으로 적용될 수 있다. 방법 1:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 26, "content": "방법 2:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 27, "content": "-서빙 셀과 다른 주파수 (inter-frequency) 별 LP-WUS and/or LP-SS 을 지원하는 주변 셀 별 QoffsetLR 값 상기 QoffsetLR 값은 서빙 셀과 서빙 셀과 다른 NR 주파수 내 주변 셀 간의 오프셋이다. 상기 값은 전술한 실시 예에서의 Rank (수학식 2) 도출 시 사용되며, 다음 중 적어도 하나의 방법으로 적용될 수 있다. 방법 1:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 28, "content": "방법 2:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 29, "content": "방법 3:"}
{"patent_id": "10-2023-0094651", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 30, "content": "상기 단말(1g-01)은 셀 재선택 평가 절차(cell reselection evaluation process)를 수행할 수 있다. 셀 재선택 평가 절차란 재선택 우선 순위 결정 (reselection priorities handling), 셀 재선택을 위한 측정 규칙 (measurement rules for cell re-selection)을 적용하여 주파수 측정을 수행하고, 셀 재선택 기준(cell reselection criteria)를 평가하여 셀을 재선택하는 일련의 과정을 의미할 수 있다. 1g-30 단계에서, 본 개시를 따르는 상기 단말(1g-01)은 하기 제안하는 방법 중 적어도 하나 (즉, 하기 방법을 조합하여 수행해도 되고 또는 하나의 방법만을 수행해도 된다)를 통해 셀 재선택 우선 순위를 결정할 수 있다. -방법 1: 1g-08 단계에서 수신한 RRC 연결 해제 메시지에 LP-WUS and/or LP-SS 을 지원하는 주파수 별 셀 재선 택 우선 순위 값이 포함되어 있는 경우, 상기 단말은 이를 적용하여 셀 재선택 우선 순위를 결정할 수 있다. 만 약 상기 단말은 T320 타이머 값 또는 신규 타이머를 구동 중인 경우, 상기 단말은 해당 타이머가 만료 또는 멈 출 때까지 상기 동작을 수행할 수 있다. 즉, 상기 단말은 시스템 정보에서 방송되는 셀 재선택 우선 순위 값을 적용하지 않을 수 있다. -방법 2: 만약 1g-08 단계에서 상기 단말이 구동한 T320 타이머 값 또는 신규 타이머 값이 만료 또는 멈추게 되 는 경우 또는 1g-08 단계에서 LP-WUS and/or LP-SS 을 지원하는 주파수 별 셀 재선택 우선 순위 값을 설정받지 않은 경우, 상기 단말은 시스템 정보에서 방송하는 LP-WUS and/or LP-SS 을 지원하는 주파수 별 셀 재선택 우선 순위 값을 적용하여 셀 재선택 우선 순위를 결정할 수 있다. 이 떄, 상기 단말은 LP-WUS and/or LP-SS 을 지원 하는 주파수 별 셀 재선택 우선 순위 값들만 적용하여 셀 재선택 우선 순위를 결정할 수도 있다. 물론 상기 단 말은 주파수 별 LP-WUS and/or LP-SS 에 대한 셀 재선택 우선 순위 값이 없는 경우, 전술한 실시 예 (도 1e)에 서 설명한 셀 재선택 우선 순위 값을 적용하여 셀 재선택 우선 순위를 결정할 수도 있다 (즉, 특정 주파수에 대 해 LP-WUS and/or LP-SS 에 대한 셀 재선택 우선 순위 값이 있는 경우 이를 적용하고 그렇지 않으면 전술한 실 시 예 (도 1e)에 설명한 셀 재선택 우선 순위 값을 적용) -방법 3: 만약 1g-08 단계에서 시스템 정보에서 방송되는 LP-WUS and/or LP-SS 을 지원하는 주파수 별 셀 재선 택 우선 순위 값을 적용하라는 지시자를 수신한 경우, 상기 단말은 시스템 정보에서 방송하는 LP-WUS and/or LP-SS 을 지원하는 주파수 별 셀 재선택 우선 순위 값을 적용하여 셀 재선택 우선 순위를 결정할 수 있다. 이 떄, 상기 단말은 LP-WUS and/or LP-SS 을 지원하는 주파수 별 셀 재선택 우선 순위 값들만 적용하여 셀 재선택 우선 순위를 결정할 수도 있다. 물론 상기 단말은 주파수 별 LP-WUS and/or LP-SS 에 대한 셀 재선택 우선 순위 값이 없는 경우, 전술한 실시 예 (도 1e)에서 설명한 셀 재선택 우선 순위 값을 적용하여 셀 재선택 우선 순위 를 결정할 수도 있다 (즉, 특정 주파수에 대해 LP-WUS and/or LP-SS 에 대한 셀 재선택 우선 순위 값이 있는 경 우 이를 적용하고 그렇지 않으면 전술한 실시 예 (도 1e-)에 설명한 셀 재선택 우선 순위 값을 적용). 참고로, 상기 동작은 T320 타이머 또는 신규 타이머가 구동되는 경우에 수행될 수 있다 (물론 타이머와 무관하게 상기 동작은 수행될 수도 있다). 1g-35 단계에서, 상기 단말(1g-01)은 셀 재선택을 위해 주파수 측정을 수행할 수 있다. 이는 전술한 실시 예들 중 적어도 하나를 따를 수 있다. 1g-40 단계에서, 상기 단말(1g-01)은 1g-35 단계에서 수행한 측정 값을 기반으로 셀 재선택 기준(cell reselection criteria)를 만족하는 셀을 재선택하고자 결정할 수 있다. 이는 전술한 실시 예를 따를 수 있다. 본 개시를 따르는 상기 단말(1g-01)은 1g-25 단계에서 수신한 시스템 정보를 적용하여 주변 셀의 신호 수신 레 벨 값(Srxlev) 과 신호 품질 값(Squal)을 1g-20 단계에서 제안한 방법에 따라 도출할 수 있다. 본 개시를 따르 는 상기 단말(1g-01)은 전술한 실시 예 또는 1g-25 단계에서 제안하는 방법에 따라 셀 별 Rank 를 도출할 수 있 다. 1g-45 단계에서 상기 단말(1g-01)은 후보 타겟 셀(candidate target cell)을 최종적으로 재선택하기 전에 후보 타겟 셀에서 방송되는 시스템 정보(예를 들면 MIB 혹은 SIB1)를 수신하고, 수신한 시스템 정보에 기반하여 후보 타겟 셀의 셀 선택 수신 신호 레벨 값(Srxlev)과 셀 선택 신호 품질 값 (Squal)이 모두 0 보다 큰 지 (즉, 셀 선택 기준(Cell selection criterion)을 충족(Srxlev > 0 AND Squal > 0) 판단한다. 상기 단말은 셀 선택 기준 충족하고 후보 타겟 셀이 suitable 하면, 상기 후보 타겟 셀을 재선택할 수 있다. 도 1h은 일 실시 예에 따른 단말의 블록도이다. 상기 도면을 참고하면, 상기 단말은 RF(Radio Frequency)처리부(1h-10), 기저대역(baseband)처리부(1h-20), 저 장부(1h-30), 제어부(1h-40)를 포함한다. 상기 RF처리부(1h-10)는 신호의 대역 변환, 증폭 등 무선 채널을 통해 신호를 송수신하기 위한 기능을 수행한다. 즉, 상기 RF처리부(1h-10)는 상기 기저대역처리부(1h-20)로부터 제공되는 기저대역 신호를 RF 대역 신호로 상향 변환한 후 안테나를 통해 송신하고, 상기 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향 변환한다. 예를 들어, 상기 RF처리부(1h-10)는 송신 필터, 수신 필터, 증폭기, 믹서(mixer), 오실레이터 (oscillator), DAC(digital to analog convertor), ADC(analog to digital convertor) 등을 포함할 수 있다. 상기 도면에서, 하나의 안테나만이 도시되었으나, 상기 단말은 다수의 안테나들을 구비할 수 있다. 또한, 상기 RF처리부(1h-10)는 다수의 RF 체인들을 포함할 수 있다. 나아가, 상기 RF처리부(1h-10)는 빔포밍(beamformin g)을 수행할 수 있다. 상기 빔포밍을 위해, 상기 RF처리부(1h-10)는 다수의 안테나들 또는 안테나 요소 (element)들을 통해 송수신되는 신호들 각각의 위상 및 크기를 조절할 수 있다. 또한 상기 RF 처리부는 MIMO를 수행할 수 있으며, MIMO 동작 수행 시 여러 개의 레이어를 수신할 수 있다. 상기 기저대역처리부(1h-20)은 시스템의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기능을 수행 한다. 예를 들어, 데이터 송신 시, 상기 기저대역처리부(1h-20)은 송신 비트열을 부호화 및 변조함으로써 복소심벌들을 생성한다. 또한, 데이터 수신 시, 상기 기저대역처리부(1h-20)은 상기 RF처리부(1h-10)로부터 제공되 는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열을 복원한다. 예를 들어, OFDM(orthogonal frequency division multiplexing) 방식에 따르는 경우, 데이터 송신 시, 상기 기저대역처리부(1h-20)는 송신 비트열을 부 호화 및 변조함으로써 복소 심벌들을 생성하고, 상기 복소 심벌들을 부반송파들에 매핑한 후, IFFT(inverse fast Fourier transform) 연산 및 CP(cyclic prefix) 삽입을 통해 OFDM 심벌들을 구성한다. 또한, 데이터 수신 시, 상기 기저대역처리부(1h-20)은 상기 RF처리부(1h-10)로부터 제공되는 기저대역 신호를 OFDM 심벌 단위로 분 할하고, FFT(fast Fourier transform)를 통해 부반송파들에 매핑된 신호들을 복원한 후, 복조 및 복호화를 통해 수신 비트열을 복원한다. 상기 기저대역처리부(1h-20) 및 상기 RF처리부(1h-10)는 상술한 바와 같이 신호를 송신 및 수신한다. 이에 따라, 상기 기저대역처리부(1h-20) 및 상기 RF처리부(1h-10)는 송신부, 수신부, 송수신부 또는 통신부로 지칭될 수 있다. 나아가, 상기 기저대역처리부(1h-20) 및 상기 RF처리부(1h-10) 중 적어도 하나는 서로 다른 다수의 무 선 접속 기술들을 지원하기 위해 다수의 통신 모듈들을 포함할 수 있다. 또한, 상기 기저대역처리부(1h-20) 및 상기 RF처리부(1h-10) 중 적어도 하나는 서로 다른 주파수 대역의 신호들을 처리하기 위해 서로 다른 통신 모듈 들을 포함할 수 있다. 예를 들어, 상기 서로 다른 무선 접속 기술들은 무선 랜(예: IEEE 802.11), 셀룰러 망(예: LTE) 등을 포함할 수 있다. 또한, 상기 서로 다른 주파수 대역들은 극고단파(SHF:super high frequency)(예: 2.NRHz, NRhz) 대역, mm파(millimeter wave)(예: 60GHz) 대역을 포함할 수 있다. 상기 저장부(1h-30)는 상기 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장 한다. 특히, 상기 저장부(1h-30)는 제2무선 접속 기술을 이용하여 무선 통신을 수행하는 제2접속 노드에 관련된 정보를 저장할 수 있다. 그리고, 상기 저장부(1h-30)는 상기 제어부(1h-40)의 요청에 따라 저장된 데이터를 제 공한다. 상기 제어부(1h-40)는 상기 단말의 전반적인 동작들을 제어한다. 예를 들어, 상기 제어부(1h-40)는 상기 기저대 역처리부(1h-20) 및 상기 RF처리부(1h-10)을 통해 신호를 송수신한다. 또한, 상기 제어부(1h-40)는 상기 저장부 (1h-30)에 데이터를 기록하고, 읽는다. 이를 위해, 상기 제어부(1h-40)는 적어도 하나의 프로세서(processor)를 포함할 수 있다. 예를 들어, 상기 제어부(1h-40)는 통신을 위한 제어를 수행하는 CP(communication processor) 및 응용 프로그램 등 상위 계층을 제어하는 AP(application processor)를 포함할 수 있다. 도 1i는 일 실시 예에 따른 기지국의 블록도이다. 상기 도면에 도시된 바와 같이, 상기 기지국은 RF처리부(1i-10), 기저대역처리부(1i-20), 백홀통신부(1i-30), 저장부(1i-40), 제어부(1i-50)를 포함하여 구성된다. 상기 RF처리부(1i-10)는 신호의 대역 변환, 증폭 등 무선 채널을 통해 신호를 송수신하기 위한 기능을 수행한다. 즉, 상기 RF처리부(1i-10)는 상기 기저대역처리부(1i-20)로부터 제공되는 기저대역 신호를 RF 대역 신호로 상향변환한 후 안테나를 통해 송신하고, 상기 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향 변환한다. 예를 들어, 상기 RF처리부(1i-10)는 송신 필터, 수신 필터, 증폭기, 믹서, 오실레이터, DAC, ADC 등을 포함할 수 있다. 상기 도면에서, 하나의 안테나만이 도시되었으나, 상기 제1접속 노드는 다수의 안테 나들을 구비할 수 있다. 또한, 상기 RF처리부(1i-10)는 다수의 RF 체인들을 포함할 수 있다. 나아가, 상기 RF처 리부(1i-10)는 빔포밍을 수행할 수 있다. 상기 빔포밍을 위해, 상기 RF처리부(1i-10)는 다수의 안테나들 또는 안테나 요소들을 통해 송수신되는 신호들 각각의 위상 및 크기를 조절할 수 있다. 상기 RF 처리부는 하나 이상 의 레이어를 전송함으로써 하향 MIMO 동작을 수행할 수 있다. 상기 기저대역처리부(1i-20)는 제1무선 접속 기술의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기능을 수행한다. 예를 들어, 데이터 송신 시, 상기 기저대역처리부(1i-20)은 송신 비트열을 부호화 및 변조함 으로써 복소 심벌들을 생성한다. 또한, 데이터 수신 시, 상기 기저대역처리부(1i-20)은 상기 RF처리부(1i-10)로 부터 제공되는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열을 복원한다. 예를 들어, OFDM 방식에 따르 는 경우, 데이터 송신 시, 상기 기저대역처리부(1i-20)은 송신 비트열을 부호화 및 변조함으로써 복소 심벌들을 생성하고, 상기 복소 심벌들을 부반송파들에 매핑한 후, IFFT 연산 및 CP 삽입을 통해 OFDM 심벌들을 구성한다. 또한, 데이터 수신 시, 상기 기저대역처리부(1i-20)은 상기 RF처리부(1i-10)로부터 제공되는 기저대역 신호를 OFDM 심벌 단위로 분할하고, FFT 연산을 통해 부반송파들에 매핑된 신호들을 복원한 후, 복조 및 복호화를 통해 수신 비트열을 복원한다. 상기 기저대역처리부(1i-20) 및 상기 RF처리부(1i-10)는 상술한 바와 같이 신호를 송 신 및 수신한다. 이에 따라, 상기 기저대역처리부(1i-20) 및 상기 RF처리부(1i-10)는 송신부, 수신부, 송수신부, 통신부 또는 무선 통신부로 지칭될 수 있다.상기 백홀통신부(1i-30)는 네트워크 내 다른 노드들과 통신을 수행하기 위한 인터페이스를 제공한다. 즉, 상기 백홀통신부(1i-30)는 상기 주기지국에서 다른 노드, 예를 들어, 보조기지국, 코어망 등으로 송신되는 비트열을 물리적 신호로 변환하고, 상기 다른 노드로부터 수신되는 물리적 신호를 비트열로 변환한다. 상기 저장부(1i-40)는 상기 주기지국의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장한다. 특히, 상기 저장부(1i-40)는 접속된 단말에 할당된 베어러에 대한 정보, 접속된 단말로부터 보고된 측정 결과 등을 저장할 수 있다. 또한, 상기 저장부(1i-40)는 단말에게 다중 연결을 제공하거나, 중단할지 여부 의 판단 기준이 되는 정보를 저장할 수 있다. 그리고, 상기 저장부(1i-40)는 상기 제어부(1i-50)의 요청에 따라 저장된 데이터를 제공한다. 상기 제어부(1i-50)는 상기 주기지국의 전반적인 동작들을 제어한다. 예를 들어, 상기 제어부(1i-50)는 상기 기 저대역처리부(1i-20) 및 상기 RF처리부(1i-10)을 통해 또는 상기 백홀통신부(1i-30)을 통해 신호를 송수신한다. 또한, 상기 제어부(1i-50)는 상기 저장부(1i-40)에 데이터를 기록하고, 읽는다. 이를 위해, 상기 제어부(1i- 50)는 적어도 하나의 프로세서를 포함할 수 있다. 본 개시에 따른 실시 예를 설명하기 위한 구체적인 예시는 각 기준, 방법, 세부 방법, 동작의 하나의 조합일 뿐 이며 서술한 다양한 기법들 중 적어도 두 개 이상의 기법들의 조합을 통해 기지국 또는 단말은 상호 간 신호를 처리 할 수 있다. 또한, 이 때, 단말을 포함한 무선 통신 시스템에서의 신호 처리에 관하여 전술한 기법들 중 하나 또는 적어도 두 개 이상의 조합을 통해 결정된 방식에 따라 수행될 수 있다. 예를 들어, 일 실시예의 동작 의 일부를 다른 실시예의 동작의 일부와 조합하여 수행하는 것이 가능할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 상기 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또 는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접 근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장 치는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도 의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 발명에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시이 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다.도면 도면1a 도면1b 도면1c 도면1d 도면1e 도면1f 도면1g 도면1h 도면1i"}
{"patent_id": "10-2023-0094651", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 일 실시 예에 따른 LTE 시스템의 구조를 도시한 도면이다. 도 1b는 일 실시 예에 따른 LTE 시스템에서 무선 프로토콜 구조를 도시한 도면이다. 도 1c는 일 실시 예에 따른 차세대 무선 통신 시스템의 구조를 도시한 도면이다. 도 1d는 일 실시 예에 따른 차세대 무선 통신 시스템의 무선 프로토콜 구조를 도시한 도면이다.도 1e는 일 실시 예에 따른 차세대 무선 통신 시스템에서 RRC 유휴 모드(RRC_IDLE) 또는 RRC 비활성화 상태 (RRC_INACTIVE)에 있는 단말이 셀 재선택 평가 절차를 수행하는 방법을 설명하기 위한 도면이다. 도 1f는 일 실시 예에 따른 차세대 무선 통신 시스템에서 저전력 웨이크업 수신기를 지원하는 단말이 셀 재선택 을 수행하는 방법을 설명하기 위한 도면이다. 도 1g는 일 실시 예에 따른 차세대 무선 통신 시스템에서 저전력 웨이크업 수신기를 지원하는 단말이 셀 재선택 을 수행하는 방법을 설명하기 위한 도면이다. 도 1h은 일 실시 예에 따른 단말의 블록도이다. 도 1i는 일 실시 예에 따른 기지국의 블록도이다."}
