{"patent_id": "10-2020-0152185", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0065545", "출원번호": "10-2020-0152185", "발명의 명칭": "비정형적 외형을 갖는 제품의 불량을 검사하는 장치", "출원인": "주식회사 트윔", "발명자": "김보철"}}
{"patent_id": "10-2020-0152185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비정형적 외형을 갖는 제품의 불량을 검사하는 장치에 있어서,상기 비정형적 제품이 장착되고 상기 비정형적 제품을 선정된 알고리즘에 따라 회전시키는 회전 장착대;상기 회전 장착대에 장착되는 상기 비정형적 제품을 둘러싸는 형태로 각각의 영역마다 배치되고, 상기 회전 장착대의 회전 알고리즘에 대응하여 상기 각각의 영역에서 상기 비정형적 제품을 촬영하는 다수의 카메라;상기 다수의 카메라가 배치되는 각각의 영역마다 상기 각 카메라에 대응하여 배치되어 상기 비정형적 제품에 빛을 조사하는 다수의 조명;상기 회전 장착대의 알고리즘에 따라 상기 회전 장착대의 회전을 제어하고 그에 대응하여 상기 다수의 카메라각각의 촬영을 제어하는 회전촬영 제어부; 및상기 다수의 카메라가 촬영한 이미지를 통해 상기 비정형적 제품의 불량을 검출하는 불량 검사부를 포함하는 것을 특징으로 하는 비정형적 외형을 갖는 제품의 불량을 검사하는 장치."}
{"patent_id": "10-2020-0152185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 회전촬영 제어부는 상기 알고리즘에 따라, 상기 회전 장착대가 36도의 회전각도만큼 회전한 후 일정시간동안 정지하는 루틴(routine)을 0도부터 360도의 회전각도까지 10회 연속으로 수행하도록 상기 회전 장착대의 회전을 제어하는 것을 특징으로 하는 비정형적 외형을 갖는 제품의 불량을 검사하는 장치."}
{"patent_id": "10-2020-0152185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 회전촬영 제어부는 상기 루틴마다 상기 회전이 정지되는 시간동안 상기 다수의 카메라가 각각의 위치에서상기 비정형적 제품을 각각 촬영하여 상기 각 카메라마다 상기 10회의 루틴동안 각각 10장의 이미지를 획득하도록 제어하는 것을 특징으로 하는 비정형적 외형을 갖는 제품의 불량을 검사하는 장치."}
{"patent_id": "10-2020-0152185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 불량 검사부는 CNN(Convolution Neural Network) 신경망을 갖는 인공지능이 구비된 컴퓨팅 디바이스이고,상기 CNN 신경망을 이용한 딥러닝 이미지 학습을 통한 모델 생성을 통해 상기 비정형적 제품의 불량을 검사하는것을 특징으로 하는 비정형적 외형을 갖는 제품의 불량을 검사하는 장치."}
{"patent_id": "10-2020-0152185", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 CNN 신경망을 이용한 딥러닝 이미지 학습은 샘플 이미지 입력단계, 학습 데이터 라벨링 단계, 딥러닝 학습진행 단계, 모델 생성 단계를 통해 구현되고, 상기 불량 검사부는 상기 다수의 카메라로부터 수신하는 이미지를상기 딥러닝을 통해 생성한 모델과 비교하여 상기 비정형적 제품의 외형 불량을 검사하는 것을 특징으로 하는비정형적 외형을 갖는 제품의 불량을 검사하는 장치."}
{"patent_id": "10-2020-0152185", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치는, 상기 비정형적 제품이 장착되 고 상기 비정형적 제품을 선정된 알고리즘에 따라 회전시키는 회전 장착대; 상기 회전 장착대에 장착되는 상기 비정형적 제품을 둘러싸는 형태로 각각의 영역마다 배치되고, 상기 회전 장착대의 회전 알고리즘에 대응하여 상 기 각각의 영역에서 상기 비정형적 제품을 촬영하는 다수의 카메라; 상기 다수의 카메라가 배치되는 각각의 영역 마다 상기 각 카메라에 대응하여 배치되어 상기 비정형적 제품에 빛을 조사하는 다수의 조명; 상기 회전 장착대 의 알고리즘에 따라 상기 회전 장착대의 회전을 제어하고 그에 대응하여 상기 다수의 카메라 각각의 촬영을 제어 하는 회전촬영 제어부; 및 상기 다수의 카메라가 촬영한 이미지를 통해 상기 비정형적 제품의 불량을 검출하는 불량 검사부를 포함한다."}
{"patent_id": "10-2020-0152185", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 비정형적 외형을 갖는 제품의 불량을 검사하는 장치에 관한 것으로 더욱 상세하게는 불량검사의 대상 제품을 특정된 루틴 알고리즘에 따라 회전시키면서 다수의 카메라를 통해 다수의 이미지를 획득하고 상기 획득 한 이미지를 딥러닝 검사하여 상기 제품의 비정형적 외형에 대한 각종 불량을 보다 정확하게 검사하는 장치에 관한 것이다."}
{"patent_id": "10-2020-0152185", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 비전 검사장치는 검사 대상물을 카메라나 센서 등에 의해 촬영 또는 감지하여 제품의 형상이나 치 수 또는 이물이나 스크래치 등을 검사하여 제품의 불량여부를 판단 및 선별할 수 있도록 된 장치이다. 이러한 비전 검사장치는 대개 검사 대상물을 연속적으로 공급하여 자동적으로 불량 여부를 검사할 수 있음에 따라, 휴 대폰이나 자동차의 부품 등 각종 제품을 전수검사하는 데에 유용하게 사용되고 있다. 종래의 비전 검사방식은 2D 이미지에서 단순 그레이(Gray) 변화량을 감지하여 불량(Defect)을 검출하고 분류하 는 방식인데 이는 정형적인 외형을 갖는 제품에만 정상적으로 적용될 뿐, 비정형적인 제품의 경우 제품 면의 특 성 상 그레이(Gray) 차가 발생한 부분을 불량이라고 단정할 수 없는 문제점이 있다. 굴곡면을 가진 금속 제품 에 대해서는 굴곡면의 빛 난반사나 표면의 거칠기로 인해 컴퓨터 비전을 통한 외관의 불량(이물, 찍힘, Burr 등)을 검출하지 못한다. 종래의 방식은 단순하게 제품 이미지를 포화(Saturation)시킨 상태에서 치수 측정 혹은 구멍(Hole) 유/무 검사에 대해서만 컴퓨터 비전을 통해서 진행할 수 있다. 종래기술에 따른 제품 외형 검사는 검사자가 직접 검사 현미경을 통해 육안 검사로 진행하며 한 개의 제품을 돌 려가거나 각도를 틀어서 외관의 불량 요소를 찾아내고 있는 실정이다. 그러나 이러한 방식은 검사자마다 눈대 중으로 파악하는 방식의 한계로 인해 불량 검출의 차이가 발생할 수밖에 없으며, 검사 속도에 대해서도 빠른 사 람과 느린 사람으로 나뉘는 불합리한 문제가 있다. 또한 같은 검사자라고 할지라도 날 마다, 혹은 시간 별로 검사하는 기준이 차이가 날 수 있다는 문제점이 있다. 이와 같이 종래의 검사 방식으로는 비정형적인 금속 제 품의 외형 특성 상 컴퓨터 비전으로 검사가 불가하여 육안 검사에 의존할 수밖에 없어 비정형적 외형을 갖는 제 품의 불량을 정확하게 검출하지 못하고 있는 실정이다. 이에 비정형적 외형을 갖는 제품의 외관에 대한 불량 (defect)을 보다 정확하면서 신속하게 검출할 있는 장치의 개발이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 10-1595708호(2016년 2월 18일 공고)"}
{"patent_id": "10-2020-0152185", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술을 개선하기 위해 안출된 것으로서, 불량검사의 대상 제품을 특정된 루틴 알고 리즘에 따라 회전시키면서 다수의 카메라를 통해 다수의 이미지를 획득하고 상기 획득한 이미지를 딥러닝 검사 하여 상기 제품의 비정형적 외형에 대한 각종 불량을 보다 정확하게 검사하는 비정형적 외형을 갖는 제품의 불 량을 검사하는 장치를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2020-0152185", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 이루고 종래기술의 문제점을 해결하기 위하여, 본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치는, 상기 비정형적 제품이 장착되고 상기 비정형적 제품을 선정된 알고리즘에 따라 회전시키는 회전 장착대; 상기 회전 장착대에 장착되는 상기 비정형적 제품을 둘러싸는 형태로 각각의 영역마다 배치되고, 상기 회전 장착대의 회전 알고리즘에 대응하여 상기 각각의 영역에서 상기 비정형적 제품을 촬영하는 다수의 카메라; 상기 다수의 카메라가 배치되는 각각의 영역마다 상기 각 카메라에 대응하여 배치되어 상기 비 정형적 제품에 빛을 조사하는 다수의 조명; 상기 회전 장착대의 알고리즘에 따라 상기 회전 장착대의 회전을 제 어하고 그에 대응하여 상기 다수의 카메라 각각의 촬영을 제어하는 회전촬영 제어부; 및 상기 다수의 카메라가 촬영한 이미지를 통해 상기 비정형적 제품의 불량을 검출하는 불량 검사부를 포함한다. 또한, 본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치의 상기 회전촬영 제어부 는 상기 알고리즘에 따라, 상기 회전 장착대가 36도의 회전각도만큼 회전한 후 일정시간동안 정지하는 루틴 (routine)을 0도부터 360도의 회전각도까지 10회 연속으로 수행하도록 상기 회전 장착대의 회전을 제어하는 것 을 특징으로 한다. 또한, 본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치의 상기 회전촬영 제어부 는 상기 루틴마다 상기 회전이 정지되는 시간동안 상기 다수의 카메라가 각각의 위치에서 상기 비정형적 제품을 각각 촬영하여 상기 각 카메라마다 상기 10회의 루틴동안 각각 10장의 이미지를 획득하도록 제어하는 것을 특징 으로 한다. 또한, 본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치의 상기 불량 검사부는 CNN(Convolution Neural Network) 신경망을 갖는 인공지능이 구비된 컴퓨팅 디바이스이고, 상기 CNN 신경망을 이용한 딥러닝 이미지 학습을 통한 모델 생성을 통해 상기 비정형적 제품의 불량을 검사하는 것을 특징으로 한 다. 또한, 본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치에 있어서, 상기 CNN 신경 망을 이용한 딥러닝 이미지 학습은 샘플 이미지 입력단계, 학습 데이터 라벨링 단계, 딥러닝 학습진행 단계, 모 델 생성 단계를 통해 구현되고, 상기 불량 검사부는 상기 다수의 카메라로부터 수신하는 이미지를 상기 딥러닝 을 통해 생성한 모델과 비교하여 상기 비정형적 제품의 외형 불량을 검사하는 것을 특징으로 한다."}
{"patent_id": "10-2020-0152185", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 비정형적 외형을 갖는 제품의 불량을 검사하는 장치에 따르면, 외형에 굴곡면을 갖는 제품에 대하여 굴곡면의 빛 난반사나 표면의 거칠기에 상관없이 외관의 이물, 찍힘, Burr 등의 불량을 보다 정확하게 검출하는 효과를 얻을 수 있다. 또한, 본 발명의 비정형적 외형을 갖는 제품의 불량을 검사하는 장치에 따르면, 각종 불량 형태에 따른 다수의 검사 모델과 다수의 쓰레드로 이미지를 딥러닝 검사함으로써 보다 단축된 시간내에 다양한 형태의 불량을 보다 정확하게 검사할 수 있는 효과를 얻을 수 있다."}
{"patent_id": "10-2020-0152185", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 과제 해결 수단의 특징 및 이점을 보다 명확히 하기 위하여, 첨부된 도면에 도시된 본 발명의 특정 실시 예를 참조하여 본 발명을 더 상세하게 설명한다. 다만, 하기의 설명 및 첨부된 도면에서 본 발명의 요지를 흐릴 수 있는 공지기능 또는 구성에 대한 상세한 설명은 생략한다. 또한, 도면 전체에 걸쳐 동일한 구성 요소들 은 가능한 한 동일한 도면 부호로 나타내고 있음에 유의하여야 한다. 이하의 설명 및 도면에서 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니 되 며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위한 용어의 개념으로 적절하게 정의할 수 있다 는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 한다. 따라서 본 명세서에 기재된 실시 예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일실시예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형예들 이 있을 수 있음을 이해하여야 한다. 또한, 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하기 위해 사용하는 것으로, 하나 의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용될 뿐, 상기 구성요소들을 한정하기 위해 사용되 지 않는다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제2 구성요소는 제1 구성요소로 명명될 수 있 고, 유사하게 제1 구성요소도 제2 구성요소로 명명될 수 있다. 더하여, 어떤 구성요소가 다른 구성요소에 \"연 결되어\" 있다거나 \"접속되어\" 있다고 언급할 경우, 이는 논리적 또는 물리적으로 연결되거나, 접속될 수 있음을 의미한다.다시 말해, 구성요소가 다른 구성요소에 직접적으로 연결되거나 접속되어 있을 수 있지만, 중간에 다른 구성요 소가 존재할 수도 있으며, 간접적으로 연결되거나 접속될 수도 있다고 이해되어야 할 것이다. 또한, 본 명세서 에서 기술되는 \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 또한, 명세서에 기재된 \"…부\", \"…기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, \"일(a 또는 an)\", \"하나(one)\", \"그(the)\" 및 유사어는 본 발명을 기술하는 문맥에 있어서(특히, 이하의 청구항의 문 맥에서) 본 명세서에 달리 지시되거나 문맥에 의해 분명하게 반박되지 않는 한, 단수 및 복수 모두를 포함하는 의미로 사용될 수 있다. 이하에서는 첨부된 도면을 참조하여 본 발명의 실시예를 상세히 설명한다. 도 1은 본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치의 구성을 도시한 도면이 고, 도 2는 본 발명의 일실시예에 따른 다수의 카메라가 배치된 구성을 도시한 도면이며, 도 3은 본 발명의 일 실시예에 따른 조명의 구성을 도시한 도면이다. 본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치는 회전 장착대, 다수 의 카메라, 다수의 조명, 회전촬영 제어부, 불량 검사부를 구성으로 포함한다. 회전 장착대에는 비정형적 제품이 장착되고 상기 비정형적 제품을 선정된 알고리즘에 따라 회전시킨다. 상기 비정형적 제품은 외형이 정형적으로 구성되지 않고 비정형적인 굴곡이 외관에 형성되어 굴곡면으로 인한 빛의 난반사나 표면의 거칠기가 일정하지 않은 제품을 의미한다. 회전 장착대는 자전하는 형태로 구현될 수 있는데 이를 위하여 서보모터, 회전축, 받침대 등으로 구성될 수 있다. 다수의 카메라는 회전 장착대에 장착되는 상기 비정형적 제품을 둘러싸는 형태로 각각의 영역마다 배 치된다. 예를 들어 도 2에 도시된 바와 같이 비정형적 제품의 측면을 둘러싸는 형태로 120도 간격마다 3대의 카메라가 설치되고, 3대의 상측에 하나 이상의 카메라가 더 설치될 수 있으며, 3대의 카메라와 직교하는 형태로 제품의 상단을 향하도록 하나 이상의 카메라가 더 설치될 수 있다. 카메라의 설치 개수나 설치 방향은 검사하 고자 하는 비정형적 제품의 외형을 고려하여 관리자가 다양한 방법으로 설정하도록 구현될 수 있다. 다수의 카 메라는 회전 장착대의 회전 알고리즘에 대응하여 상기 각각의 영역에서 상기 비정형적 제품을 촬영한 다. 상기 회전 알고리즘은 회전촬영 제어부에 의해 구현된다. 다수의 조명은 다수의 카메라가 배치되는 각각의 영역마다 상기 각 카메라에 대응하여 배치되어 상기 비정형적 제품에 빛을 조사한다. 도 3에 도시된 바와 같이 다수의 조명은 확산형 C자형 조명으로 구현될 수 있다. 일반적인 직광형 조명의 경우 비정형적 제품의 굴곡면에 조사되는 빛의 난반사로 인해 Saturation 상 태가 발생하여 외관 검사 Dead Area 발생한다. 따라서, 본 발명에서는 특수 확산형 조명을 적용하여 굴곡면에 서도 외관 검사가 가능한 정도의 일정한 조건을 만들 수 있다. 회전촬영 제어부는 회전 장착대의 알고리즘에 따라 회전 장착대의 회전을 제어하고 그에 대응하 여 다수의 카메라 각각의 촬영을 제어한다. 예를 들어, 회전촬영 제어부는 상기 알고리즘에 따라, 회전 장착대가 36도의 회전각도만큼 회전한 후 일정시간동안 정지하는 루틴(routine)을 0도부터 360도의 회전각도까지 10회 연속으로 수행하도록 회전 장착대의 회전을 제어할 수 있다. 이러한 경우, 회전촬영 제어부는 상기 루틴마다 상기 회전이 정지되는 시간동안 다수의 카메라가 각각의 위치에서 상기 비정 형적 제품을 각각 촬영하여 상기 각 카메라마다 상기 10회의 루틴동안 각각 10장의 이미지를 획득하도록 제어할 수 있다. 회전 장착대의 회전 루틴 방식과 카메라의 촬영 루틴 방식은 관리자의 판단에 따라 다양한 값으 로 설정될 수 있다. 불량 검사부는 다수의 카메라가 촬영한 이미지를 통해 상기 비정형적 제품의 불량을 검출한다. 불량 검사부는 CNN(Convolution Neural Network) 신경망을 갖는 인공지능이 구비된 컴퓨팅 디바이스로 구현될 수 있다. 불량 검사부는 상기 CNN 신경망을 이용한 딥러닝 이미지 학습을 통한 모델 생성을 통해 상기 비 정형적 제품의 불량을 검사한다. 상기 CNN 신경망을 이용한 딥러닝 이미지 학습은 샘플 이미지 입력단계, 학습 데이터 라벨링 단계, 딥러닝 학습진행 단계, 모델 생성 단계를 통해 구현될 수 있다. 불량 검사부는 다수 의 카메라로부터 수신하는 이미지를 상기 딥러닝을 통해 생성한 모델과 비교하여 상기 비정형적 제품의 외형 불량을 검사할 수 있다. 기존의 검사 방식인 컴퓨터 비전(Rule 기반)으로는 비정형적인 제품의 외관 검사를 수행하기 어렵다. 기존의 컴 퓨터 비젼은 플랫(Flat)한 외형, 민무늬의 제품의 외관 검사에 적합하다. 그러나 굴곡면 둥의 비정형적인 외형 을 갖는 검사면 재질의 질감에서는 불량부와 검사면의 구분이 어렵기 때문에 외관 불량 검사를 할 수 없으며, 단순하게 치수 측정과 튀어나온 불량 정도만 검사 진행이 가능하고, 나머지 불량에 대해서는 검사자가 육안으로 검사할 수밖에 없었다. 비정형적인 금속 제품의 외관 검사에 적용되는 이미지는 단순한 신경망이나 얕은 Layer의 학습을 통해서는 불량 을 검출하기 어려운 이미지이다. 본 발명에서는 Tensorflow를 이용한 CNN 신경망을 사용하여 이미지 불량에 대한 학습을 진행한다. 이 때, 이미지의 불량 검출이 어렵기 때문에 신경망의 깊이를 101 Layer 로 적용하여 학습의 양을 증대해서 불량 검출을 최적화할 수 있다. 해당 알고리즘 및 모델은 Python 기반으로 개발되었기 때문에, 실제 검사 적용 시 이미지 획득 어플리케이션과 Python 딥러닝 검사 모델이 서로 통신으로 이미지 및 상태를 주고 받아야 하므로 검사 장치를 구성함에 있어 시 간이 오래 걸릴 수 있는데, 본 발명에서는 8개의 검사 모델을 dll화하고 이미지 획득 어플리케이션에서 직접 함 수 호출하도록 하여 Python 어플리케이션이 구동하지 않도록 함으로써 소요시간을 단축시키고 구성을 단순화할 수 있다. 검사 신뢰성을 높이기 위해 금속 불량 제품 1,000개 이상의 제품에서 각 Defect(긁힘, 찍힘, Burr, 눌림 등)을 라벨링 하고, 이를 각도 및 사이즈 등으로 증폭하여 수 만개의 데이터 세트(Data Set)를 생성하여 검사 정확도를 높일 수 있다. 비정형적 제품의 전면을 검사해야 하기 때문에 8개의 검사 Model로 학습을 진행하고, 검사 장치의 택타임(Tact Time)을 설정하기 위해 초고속의 검사 속도가 필요하므로, 단일 쓰레드(Thread)의 Sequential한 검사 방식은 지 양하고, 검사 Boost Algorithm를 적용하고 8개의 Multi Thread로 검사 수행을 진행하여 88장의 이미지를 6초 안 에 검사 완료 진행하는 방식으로 구현할 수 있다. 딥러닝 학습으로 인한 검사는 불량(Defect)의 모양을 통해 검사하며, 이러한 불량(Defect)의 모양 학습으로도 어려운 검사에 대해서는 컴퓨터 비전(영상 처리)과 딥러닝을 적용하여 검사가 가능하도록 할 수 있다. 원본 영상에서 잡영을 제거하고 필터링 처리(LOG), 이진화 알고리즘 처리(Adaptive)할 수 있다. Circle Fitting 알고리즘으로 근사치 원을 찾고, Circle을 기준으로 관심 영역을 분리한 후, 분리된 영상을 1/4씩 분리 하여 딥러닝 학습을 진행할 수 있는데 이는 하나의 모델로 검사하기 위함이다. 최종적으로 검사 신뢰성 확인하 여 비정형적 제품의 외형에 발생한 불량을 보다 정확하고 신속하게 검사할 수 있다. 이상과 같이 본 발명은 비록 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 상기의 실시예에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 그러므로, 본 발명의 범위는 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2020-0152185", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 비정형적 외형을 갖는 제품의 불량을 검사하는 장치의 구성을 도시한 도면이 다. 도 2는 본 발명의 일실시예에 따른 다수의 카메라가 배치된 구성을 도시한 도면이다. 도 3은 본 발명의 일실시예에 따른 조명의 구성을 도시한 도면이다."}
