{"patent_id": "10-2016-0110452", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0142814", "출원번호": "10-2016-0110452", "발명의 명칭": "메시지에 관련된 정보 및 기능을 제공하는 방법 및 장치", "출원인": "주식회사 인포바인", "발명자": "권성준"}}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메시지를 생성하는 단계;상기 메시지에 관련된 정보를 생성하는 단계; 및상기 메시지 및 상기 메시지에 관련된 정보를 단말로 전송하는 단계를 포함하는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 메시지에 관련된 정보를 생성하는 단계는,상기 메시지에 관련된 정보에 대한 요청을 서버로 전송하는 단계; 및상기 메시지에 관련된 정보를 상기 서버로부터 수신하는 단계를 포함하고,상기 요청은 상기 메시지를 포함하는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 메시지에 관련된 정보는 인공 지능 검색에 기반하여 생성되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 메시지에 관련된 정보는 사용자의 행위, 작성 또는 선택에 기반하여 생성되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 메시지에 관련된 정보는 상기 메시지의 메시지 제공 시스템의 다른 사용자와 공유되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "메시지를 생성하고, 상기 메시지에 관련된 정보를 생성하는 처리부; 및상기 메시지 및 상기 메시지에 관련된 정보를 전송하는 통신부를 포함하는 단말."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "단말로부터 메시지에 관련된 정보에 대한 요청을 수신하는 단계;상기 메시지에 기반하여 상기 메시지에 관련된 정보를 생성하는 단계; 및상기 메시지에 관련된 정보를 상기 단말로 전송하는 단계를 포함하는 메시지에 관련된 정보의 제공 방법.공개특허 10-2017-0142814-3-청구항 8 제7항에 있어서,상기 요청은 상기 메시지의 전송에 관련된 정보를 포함하고,상기 메시지의 전송에 관련된 정보는 상기 메시지를 전송하는 발신 단말의 전화번호 및 상기 메시지를 수신하는수신 단말의 전화번호를 포함하는 메시지에 관련된 정보의 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 메시지에 관련된 정보는 인공 지능 검색에 기반하여 생성되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 메시지에 관련된 정보는 상기 메시지 중 특정한 정보를 나타내는 일반적인 표현에 기반하여 생성되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 메시지에 관련된 정보는 상기 메시지에 관련된 정보의 생성에 사용되는 정의된 키워드에 기반하여 생성되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 메시지에 관련된 정보는 사용자의 행위, 작성 또는 선택에 기반하여 생성되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "단말로부터 메시지에 관련된 정보에 대한 요청을 수신하고, 상기 메시지에 관련된 정보를 상기 단말로 전송하는통신부; 및상기 메시지에 기반하여 상기 메시지에 관련된 정보를 생성하는 처리부를 포함하는 서버."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "메시지를 수신하는 단계;상기 메시지에 관련된 정보를 생성하는 단계; 및상기 메시지에 관련된 정보를 제공하는 단계를 포함하는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 메시지에 관련된 정보를 생성하는 단계는,상기 메시지에 관련된 정보에 대한 요청을 서버로 전송하는 단계; 및상기 메시지에 관련된 정보를 상기 서버로부터 수신하는 단계를 포함하고,공개특허 10-2017-0142814-4-상기 요청은 상기 메시지를 포함하는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 메시지에 관련된 정보와 함께 상기 메시지에 관련된 기능이 제공되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 메시지에 관련된 기능은 상기 메시지에 관련된 정보에 기반하여 결정되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제14항에 있어서,상기 메시지에 관련된 정보는 인공 지능 검색에 기반하여 생성되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제14항에 있어서,상기 메시지에 관련된 정보와 함께 상기 메시지에 대한 분류가 제공되는 메시지 제공 방법."}
{"patent_id": "10-2016-0110452", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "메시지를 수신하는 통신부; 및상기 메시지에 관련된 정보를 생성하고, 상기 메시지에 관련된 정보를 제공하는 처리부를 포함하는 단말."}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "메시지 및 메시지에 관련된 정보를 제공하기 방법 및 장치가 제공된다. 발신 단말은 메시지를 수신 단말로 전송 할 수 있다. 메시지와 함께 메시지에 관련된 정보가 수신 단말의 사용자에게 제공된다. 메시지에 관련된 정보는 발신 단말, 서버 또는 수신 단말에 의해 제공될 수 있다. 메시지에 관련된 정보는 메시지에 대한 분석, 인공 지 능 검색 및/또는 사용자에 의한 편집 등에 의해 생성된다."}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 실시예들은 단말에서 표시되는 메시지에 관한 방법 및 장치에 관한 것으로, 보다 상세히는 메시지에 관 련된 정보 및 기능을 제공하는 방법 및 장치가 개시된다."}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이동 통신 네트워크를 사용하는 스마트 폰 등이 널리 사용함에 따라, 일반적인 사용자도 단말을 통해 하루에 수 십 개의 메시지들을 수신하게 되었다. 사용자는 수신된 메시지들 중에서 자신에게 유용한 정보를 갖고 있는 메 시지를 분간해야 한다. 예를 들면, 메시지는 대출 및 광고 등에 관련된 스팸 메시지일 수 있으며, 금융 및 배송 등에 관련된 정보성 메 시지일 수 있으며, 뉴스 및 날씨 등에 관련된 생활 관련 메시지일 수 있으며, 가족 및 친구 등으로부터의 지인 메시지일 수 있다. 사용자는 메시지의 특성에 따라서 메시지를 스팸 메시지, 정보성 메시지, 생활 관련 메시지 및 지인 메시지로 분류할 수 있다. 또한, 경우에 따라서는, 사용자는 메시지를 확인하고, 인터넷의 검색 사이트 또는 포털 등에서 메시지에 관련된 정보를 추가로 검색해야 할 수 있다. 또한, 경우에 따라서는, 사용자는 메시지를 확인하고, 메시지와 관련된 단말의 기능을 실행할 수 있다."}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시예는 수신된 메시지에 대하여 메시지에 관련된 정보를 자동으로 제공하는 방법 및 장치를 제공할 수 있 다.일 실시예는 수신된 메시지에 대하여 메시지에 관련된 기능을 자동으로 제공하는 방법 및 장치를 제공할 수 있 다. 일 실시예는 수신된 메시지를 메시지의 내용에 따라 자동으로 분류하는 방법 및 장치를 제공할 수 있다."}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측에 있어서, 메시지를 생성하는 단계; 상기 메시지에 관련된 정보를 생성하는 단계; 및 상기 메시지 및 상 기 메시지에 관련된 정보를 단말로 전송하는 단계를 포함하는 메시지 제공 방법이 제공된다. 상기 메시지에 관련된 정보를 생성하는 단계는, 상기 메시지에 관련된 정보에 대한 요청을 서버로 전송하는 단 계 및 상기 메시지에 관련된 정보를 상기 서버로부터 수신하는 단계를 포함할 수 있다. 상기 요청은 상기 메시지를 포함할 수 있다. 상기 메시지에 관련된 정보는 인공 지능 검색에 기반하여 생성될 수 있다. 상기 메시지에 관련된 정보는 사용자의 행위, 작성 또는 선택에 기반하여 생성될 수 있다. 상기 메시지에 관련된 정보는 상기 메시지의 메시지 제공 시스템의 다른 사용자와 공유될 수 있다. 다른 일 측에 있어서, 메시지를 생성하고, 상기 메시지에 관련된 정보를 생성하는 처리부; 및 상기 메시지 및 상기 메시지에 관련된 정보를 전송하는 단말이 제공된다. 또 다른 일 측에 있어서, 단말로부터 메시지에 관련된 정보에 대한 요청을 수신하는 단계; 상기 메시지에 기반 하여 상기 메시지에 관련된 정보를 생성하는 단계; 및 상기 메시지에 관련된 정보를 상기 단말로 전송하는 단계 를 포함하는 메시지에 관련된 정보의 제공 방법이 제공된다. 상기 요청은 상기 메시지의 전송에 관련된 정보를 포함할 수 있다. 상기 메시지의 전송에 관련된 정보는 상기 메시지를 전송하는 발신 단말의 전화번호 및 상기 메시지를 수신하는 수신 단말의 전화번호를 포함할 수 있다. 상기 메시지에 관련된 정보는 인공 지능 검색에 기반하여 생성될 수 있다. 상기 메시지에 관련된 정보는 상기 메시지 중 특정한 정보를 나타내는 일반적인 표현에 기반하여 생성될 수 있 다. 상기 메시지에 관련된 정보는 상기 메시지에 관련된 정보의 생성에 사용될 수 있다. 상기 메시지에 관련된 정보는 사용자의 행위, 작성 또는 선택에 기반하여 생성될 수 있다. 또 다른 일 측에 있어서, 단말로부터 메시지에 관련된 정보에 대한 요청을 수신하고, 상기 메시지에 관련된 정 보를 상기 단말로 전송하는 통신부; 및 상기 메시지에 기반하여 상기 메시지에 관련된 정보를 생성하는 처리부 를 포함하는 서버가 제공된다. 또 다른 일 측에 있어서, 메시지를 수신하는 단계; 상기 메시지에 관련된 정보를 생성하는 단계; 및 상기 메시 지에 관련된 정보를 제공하는 단계를 포함하는 메시지 제공 방법이 제공된다. 상기 메시지에 관련된 정보를 생성하는 단계는, 상기 메시지에 관련된 정보에 대한 요청을 서버로 전송하는 단 계; 및 상기 메시지에 관련된 정보를 상기 서버로부터 수신하는 단계를 포함할 수 있다. 상기 요청은 상기 메시지를 포함할 수 있다. 상기 메시지에 관련된 정보와 함께 상기 메시지에 관련된 기능이 제공될 수 있다. 상기 메시지에 관련된 기능은 상기 메시지에 관련된 정보에 기반하여 결정될 수 있다. 상기 메시지에 관련된 정보는 인공 지능 검색에 기반하여 생성될 수 있다. 상기 메시지에 관련된 정보와 함께 상기 메시지에 대한 분류가 제공될 수 있다. 또 다른 일 측에 있어서, 메시지를 수신하는 통신부; 및 상기 메시지에 관련된 정보를 생성하고, 상기 메시지에 관련된 정보를 제공하는 처리부를 포함하는 단말이 제공된다."}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 예시적 실시예들에 대한 상세한 설명은, 특정 실시예를 예시로서 도시하는 첨부 도면을 참조한다. 이 들 실시예는 당업자가 실시예를 실시할 수 있기에 충분하도록 상세히 설명된다. 다양한 실시예들은 서로 다르지 만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있는 특정 형상, 구조 및 특성 은 일 실시예에 관련하여 본 발명의 정신 및 범위를 벗어나지 않으면서 다른 실시예로 구현될 수 있다. 또한, 각각의 개시된 실시예 내의 개별 구성요소의 위치 또는 배치는 실시예의 정신 및 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미로서 취하려는 것이 아니며, 예시적 실시예들의 범위는, 적절하게 설명된다면, 그 청구항들이 주장하는 것과 균등한 모든 범위와 더불어 첨 부된 청구항에 의해서만 한정된다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유사한 기능을 지칭한다. 도면에서의 요소들의 형 상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 실시예에서 사용된 용어는 실시예를 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 실시예에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다 른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않으며, 추가적인 구성이 예시적 실시예들 의 실시 또는 예시적 실시예들의 기술적 사상의 범위에 포함될 수 있음을 의미한다. 어떤 구성요소(component) 가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기의 2개의 구성요소들이 서로 간에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있으나, 상기의 2개의 구성요소들의 중간에 다른 구 성요소가 존재할 수도 있다고 이해되어야 할 것이다. 제1 및 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기의 구성요소들은 상기의 용어 들에 의해 한정되어서는 안 된다. 상기의 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하여 지칭하기 위해서 사용된다. 예를 들어, 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 또한 실시예들에 나타나는 구성요소들은 서로 다른 특징적인 기능들을 나타내기 위해 독립적으로 도시되는 것으 로, 각 구성요소가 분리된 하드웨어나 하나의 소프트웨어 구성 단위로만 이루어짐을 의미하지 않는다. 즉, 각 구성요소는 설명의 편의상 각각의 구성요소로 나열된 것이다. 예를 들면, 구성요소들 중 적어도 두 개의 구성요 소들이 하나의 구성요소로 합쳐질 수 있다. 또한, 하나의 구성요소가 복수의 구성요소들로 나뉠 수 있다. 이러 한 각 구성요소의 통합된 실시예 및 분리된 실시예 또한 본질에서 벗어나지 않는 한 권리범위에 포함된다. 또한, 일부의 구성요소는 본질적인 기능을 수행하는 필수적인 구성요소는 아니고 단지 성능을 향상시키기 위한 선택적 구성요소일 수 있다. 실시예들은 실시예의 본질을 구현하는데 필수적인 구성부만을 포함하여 구현될 수 있고, 예를 들면, 단지 성능 향상을 위해 사용되는 구성요소와 같은, 선택적 구성요소가 제외된 구조 또한 권리 범위에 포함된다."}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하에서는, 기술분야에서 통상의 지식을 가진 자가 실시예들을 용이하게 실시할 수 있도록 하기 위하여, 첨부 된 도면을 참조하여 실시예들을 상세히 설명하기로 한다. 실시예들을 설명함에 있어, 관련된 공지 구성 또는 기 능에 대한 구체적인 설명이 본 명세서의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 도 1은 일 예에 따른 메시지가 제공되는 시스템을 나타낸다. 시스템은 서버 및 복수의 단말들을 표시할 수 있다. 복수의 단말들은 서로 간에 메시지를 주고 받을 수 있다. 복수의 단말들 중 하나의 단말에서 생성된 메시지는 복수의 단말들 중 다른 단말로 전송될 수 있다. 메시지는 에스엠에스(SMS) 메시지일 수 있다. 메시지는 엠엠에스(MMS) 메시지일 수 있다. 또는, 메시지는 메시 징 어플리케이션에서 사용되는 메시지일 수 있다. 예를 들면, 시스템은 메시지 서비스를 제공하는 시스템 일 수 있다. 복수의 단말들의 각 단말은 사용자의 모바일 폰(mobile phone) 또는 스마트폰(smart phone)일 수 있다. 또 한, 복수의 단말들의 각 단말은 메시지를 처리할 수 있는 장치를 나타낼 수 있다. 예를 들면, 복수의 단말 들의 각 단말은 메시지의 전송 및/또는 수신 등과 같은 메시지에 대한 처리를 위한 컴퓨터 또는 컴퓨터 시 스템의 적어도 일부일 수 있다. 이하에서, 발신 단말은 복수의 단말들 중 메시지를 생성하고, 생성된 메시지를 수신 단말로 전 송하는 단말일 수 있다. 수신 단말은 복수의 단말들 중 발신 단말로부터 수신하는 단말일 수 있 다. 수신 단말은 메시지를 표시할 수 있다. 수신 단말은 메시지에 관련된 정보, 메시지에 관련된 기능 및 메시지에 대한 분류 중 적어도 하나를 제공 할 수 있다. 수신 단말은 메시지에 관련된 정보를 제공할 수 있다. 수신 단말은 메시지에 관련된 기 능을 제공할 수 있다. 수신 단말은 메시지에 대한 분류를 제공할 수 있다. 메시지에 관련된 정보를 표시하기 위해, 발신 단말 또는 수신 단말은 메시지에 관련된 정보를 생성할 수 있다. 발신 단말 자신이 메시지의 전송 전 메시지에 관련된 정보를 생성할 수 있다. 또는, 수신 단말 자신이 메시지의 수신 후 메시지에 관련된 정보를 생성할 수 있다. 메시지에 관련된 정보를 표시하기 위해, 서버는 메시지에 관련된 정보를 제공할 수 있다. 서버는 발 신 단말 또는 수신 단말의 메시지에 관련된 정보에 대한 요청에 따라 메시지에 관련된 정보를 생성할 수 있다. 서버는 생성된 메시지에 관련된 정보를 발신 단말 또는 수신 단말로 전송할 수 있다. 도 2는 일 실시예에 따른 서버의 블록도이다. 서버는 처리부, 통신부 및 저장부를 포함할 수 있다. 처리부는 서버의 동작을 위해 요구되는 작업을 처리할 수 있다. 처리부는 실시예들에서 설명되 는 처리부의 동작 또는 단계의 코드를 실행(execute)할 수 있다. 처리부는 데이터 또는 정보의 생성 및 처리를 수행할 수 있고, 데이터 또는 정보에 관련된 검사, 비교 및 판단 등을 수행할 수 있다. 말하자면, 실시예에서 데이터 또는 정보의 생성 및 처리와 데이터 또는 정보에 관련 된 검사, 비교 및 판단은 처리부에 의해 수행될 수 있다. 예를 들면, 처리부는 적어도 하나의 프로세서(processor)일 수 있다. 통신부는 서버의 동작을 위해 요구되는 데이터 또는 정보를 수신할 수 있으며, 서버의 동작을 위해 요구되는 데이터 또는 정보를 전송할 수 있다. 통신부는 네트워크 내의 다른 장치로 데이터 또는 정보를 전송할 수 있고, 다른 장치로부터 데이터 또는 정보를 수신할 수 있다. 말하자면, 실시예에서 데이터 또는 정보의 전송 또는 수신은 통신부에 의해 수행 될 수 있다. 예를 들면, 통신부는 네트워크 칩(chip) 또는 포트(port)일 수 있다. 저장부는 서버의 동작을 위해 요구되는 데이터 또는 정보를 저장할 수 있다. 실시예에서, 서버(11 0)가 갖는 데이터 또는 정보는 저장부 내에 저장될 수 있다. 예를 들면, 저장부는 메모리(memory)일 수 있다. 저장부는 램(RAM) 및 플레시(flash) 메모리 등과 같 은 내장형의 저장 매체를 포함할 수 있고, 메모리 카드 등과 같은 탈착가능한 저장 매체를 포함할 수 있다. 저장부는 적어도 하나의 프로그램을 저장할 수 있다. 처리부는 적어도 하나의 프로그램을 실행할 수 있다. 처리부는 저장부로부터 적어도 하나의 프로그램의 코드를 독출(read)할 수 있고, 독출된 코드 를 실행할 수 있다. 서버의 처리부, 통신부 및 저장부의 동작, 기능 및 특징에 대해서 실시예들을 참조하여 아 래에서 상세하게 설명된다. 도 3은 일 실시예에 따른 발신 단말의 블록도이다. 발신 단말은 처리부, 통신부, 저장부 및 출력부를 포함할 수 있다. 처리부는 발신 단말의 동작을 위해 요구되는 작업을 처리할 수 있다. 처리부는 실시예들에서 설 명되는 처리부의 동작 또는 단계의 코드를 실행할 수 있다. 처리부는 데이터 또는 정보의 생성 및 처리를 수행할 수 있고, 데이터 또는 정보에 관련된 검사, 비교 및 판단 등을 수행할 수 있다. 말하자면, 실시예에서 데이터 또는 정보의 생성 및 처리와 데이터 또는 정보에 관련 된 검사, 비교 및 판단은 처리부에 의해 수행될 수 있다. 예를 들면, 처리부는 적어도 하나의 프로세서일 수 있다. 통신부는 발신 단말의 동작을 위해 요구되는 데이터 또는 정보를 수신할 수 있으며, 발신 단말 의 동작을 위해 요구되는 데이터 또는 정보를 전송할 수 있다. 통신부는 네트워크 내의 다른 장치로 데이터 또는 정보를 전송할 수 있고, 다른 장치로부터 데이터 또는 정보를 수신할 수 있다. 말하자면, 실시예에서 데이터 또는 정보의 전송 또는 수신은 통신부에 의해 수행 될 수 있다. 예를 들면, 통신부는 네트워크 칩 또는 포트일 수 있다. 저장부는 발신 단말의 동작을 위해 요구되는 데이터 또는 정보를 저장할 수 있다. 실시예에서, 발신 단말가 갖는 데이터 또는 정보는 저장부 내에 저장될 수 있다. 예를 들면, 저장부는 메모리일 수 있다. 저장부는 램 및 플레시 메모리 등과 같은 내장형의 저장 매 체를 포함할 수 있고, 메모리 카드 등과 같은 탈착가능한 저장 매체를 포함할 수 있다. 저장부는 적어도 하나의 프로그램을 저장할 수 있다. 처리부는 적어도 하나의 프로그램을 실행할 수 있다. 처리부는 저장부로부터 적어도 하나의 프로그램의 코드를 독출할 수 있고, 독출된 코드를 실행 할 수 있다. 출력부는 데이터 또는 정보를 표시할 수 있다. 예를 들면, 출력부는 디스플레이(display)일 수 있다. 발신 단말의 처리부, 통신부, 저장부 및 출력부의 동작, 기능 및 특징에 대해서 실시 예들을 참조하여 아래에서 상세하게 설명된다. 도 4는 일 실시예에 따른 수신 단말의 블록도이다. 수신 단말은 처리부, 통신부, 저장부 및 출력부를 포함할 수 있다. 처리부는 수신 단말의 동작을 위해 요구되는 작업을 처리할 수 있다. 처리부는 실시예들에서 설 명되는 처리부의 동작 또는 단계의 코드를 실행할 수 있다. 처리부는 데이터 또는 정보의 생성 및 처리를 수행할 수 있고, 데이터 또는 정보에 관련된 검사, 비교 및 판단 등을 수행할 수 있다. 말하자면, 실시예에서 데이터 또는 정보의 생성 및 처리와 데이터 또는 정보에 관련 된 검사, 비교 및 판단은 처리부에 의해 수행될 수 있다. 예를 들면, 처리부는 적어도 하나의 프로세서일 수 있다. 통신부는 수신 단말의 동작을 위해 요구되는 데이터 또는 정보를 수신할 수 있으며, 수신 단말 의 동작을 위해 요구되는 데이터 또는 정보를 전송할 수 있다. 통신부는 네트워크 내의 다른 장치로 데이터 또는 정보를 전송할 수 있고, 다른 장치로부터 데이터 또는 정보를 수신할 수 있다. 말하자면, 실시예에서 데이터 또는 정보의 전송 또는 수신은 통신부에 의해 수행 될 수 있다. 예를 들면, 통신부는 네트워크 칩 또는 포트일 수 있다. 저장부는 수신 단말의 동작을 위해 요구되는 데이터 또는 정보를 저장할 수 있다. 실시예에서, 수신 단말가 갖는 데이터 또는 정보는 저장부 내에 저장될 수 있다. 예를 들면, 저장부는 메모리일 수 있다. 저장부는 램 및 플레시 메모리 등과 같은 내장형의 저장 매 체를 포함할 수 있고, 메모리 카드 등과 같은 탈착가능한 저장 매체를 포함할 수 있다. 저장부는 적어도 하나의 프로그램을 저장할 수 있다. 처리부는 적어도 하나의 프로그램을 실행할 수 있다. 처리부는 저장부로부터 적어도 하나의 프로그램의 코드를 독출할 수 있고, 독출된 코드를 실행 할 수 있다. 출력부는 데이터 또는 정보를 표시할 수 있다. 예를 들면, 출력부는 디스플레이일 수 있다. 수신 단말의 처리부, 통신부, 저장부 및 출력부의 동작, 기능 및 특징에 대해서 실시 예들을 참조하여 아래에서 상세하게 설명된다. 도 5는 일 실시예에 따른 메시지 제공 방법의 흐름도이다. 메시지 제공 방법은, 발신 단말의 측면에서는 메시지를 생성하고, 생성된 메시지를 수신 단말에게 제 공하는 방법일 수 있다. 또한, 메시지 제공 방법은, 수신 단말의 측면에서는 수신된 메시지를 사용자에게 제공하는 방법일 수 있다. 단계에서, 발신 단말의 처리부는 메시지를 생성할 수 있다. 단계에서, 발신 단말의 통신부는 메시지를 수신 단말로 전송할 수 있다. 수신 단말의 통신부는 발신 단말로부터 메시지를 수신할 수 있다. 메시지와 함께, 수신 단말의 통신부는 메시지의 전송에 관련된 정보를 수신할 수 있다. 예를 들면, 메시지의 전송에 관련된 정보는 발신 단말의 전화번호일 수 있다. 단계에서, 수신 단말의 처리부는 메시지를 표시할 수 있다. 단계에서, 수신 단말의 처리부는 메시지에 관련된 정보, 메시지에 관련된 기능 및 메시지에 대 한 분류 중 적어도 하나를 제공할 수 있다. 메시지에 관련된 정보와 함께 메시지에 관련된 기능 및/또는 메시지 에 대한 분류가 제공될 수 있다. 수신 단말의 처리부는 메시지에 관련된 정보, 메시지에 관련된 기능 및 메시지에 대한 분류 중 적어 도 하나를 표시부에 표시할 수 있다. 메시지에 관련된 정보, 메시지에 관련된 기능 및 메시지에 대한 분류 중 적어도 하나는 수신 단말의 브라 우저 또는 어플리케이션을 통해 제공될 수 있다. 도 6는 일 실시예에 따른 발신 단말이 메시지에 관련된 정보를 생성하는 방법의 흐름도이다. 단계는 도 5를 참조하여 전술된 단계 및 단계의 사이에서 수행될 수 있다. 단계에서, 발신 단말의 처리부는 메시지와 함께 메시지에 관련된 정보를 생성하게 하는 메뉴를 출력할 수 있다. 예를 들면, 메뉴는 \"정보 검색\" 버튼일 수 있다. 발신 단말의 사용자가 메뉴를 선택하면 단계에서 메시지에 관련된 정보가 생성될 수 있다. 또는, 메시지에 관련된 정보는 메뉴의 선택 없이 생성될 수 있다. 예를 들면, 단계가 수행되면, 메시지가 전송되기 전, 발신 단말의 사용자의 관여 없이도, 메시지에 관련된 정보가 자동으로 생성될 수 있다. 단계에서, 발신 단말의 처리부는 메시지에 관련된 정보를 생성할 수 있다. 단계가 수행되면, 단계에서, 메시지에 관련된 정보는 메시지와 함께 발신 단말로부터 수신 단말 로 전송될 수 있다. 발신 단말의 통신부는 메시지 및 메시지에 관련된 정보를 수신 단말로 전송할 수 있다. 수신 단말의 통신부는 발신 단말로부터 메시지 및 메시지에 관련된 정보를 수 신할 수 있다. 도 7은 일 실시예에 따른 서버가 메시지에 관련된 정보를 생성하는 방법의 흐름도이다. 서버는 발신 단말의 메시지에 관련된 정보에 대한 요청에 따라 메시지에 관련된 정보를 생성 및 전송 할 수 있다. 이 경우, 단계(710, 720 및 730)은 단계 및 단계의 사이에서 수행될 수 있다. 예를 들면, 단계에서, 발신 단말의 처리부는 메시지와 함께 메시지에 관련된 정보를 생성하는 메뉴를 출력할 수 있다. 예를 들면, 메뉴는 \"정보 검색\" 버튼일 수 있다. 발신 단말의 사용자가 메뉴를 선 택하면, 단계들(710, 720, 730)에서 메시지에 관련된 정보가 획득될 수 있다. 단계는 단계들(710, 720, 730)을 포함할 수 있다. 또는, 서버는 수신 단말의 메시지에 관련된 정보에 대한 요청에 따라 메시지에 관련된 정보를 생성 및 전송할 수 있다. 이 경우, 단계(710, 720 및 730)은 단계 및 단계의 사이에서 수행될 수 있다. 예를 들면, 단계에서, 수신 단말의 처리부는 메시지와 함께 메시지에 관련된 정보를 생성하는 메뉴를 출력할 수 있다. 예를 들면, 메뉴는 \"정보 검색\" 버튼일 수 있다. 수신 단말의 사용자가 메뉴를 선 택하면, 단계들(710, 720, 730)에서 메시지에 관련된 정보가 획득될 수 있다. 단계에서, 발신 단말의 통신부 또는 수신 단말의 통신부는 메시지에 관련된 정보에 대한 요청을 서버로 전송할 수 있다. 서버의 통신부는 발신 단말 또는 수신 단말로부터 메 시지에 관련된 정보에 대한 요청을 수신할 수 있다. 메시지에 관련된 정보에 대한 요청은, 1) 메시지 및 2) 메시지의 전송에 관련된 정보를 포함할 수 있다. 메시지 의 전송에 관련된 정보는 발신 단말의 전화번호 및 수신 단말의 전화번호를 포함할 수 있다. 단계에서, 서버의 처리부는 메시지에 관련된 정보를 생성할 수 있다. 단계에서, 서버의 통신부는 발신 단말 또는 수신 단말로 메시지에 관련된 정보를 전 송할 수 있다. 발신 단말의 통신부 또는 수신 단말의 통신부는 서버로부터 메시지에 관련된 정보를 수신할 수 있다. 메시지에 대한 검색의 요청이 발신 단말로부터 전송된 경우, 도 5를 참조하여 전술된 단계에서, 발신 단말의 통신부는 메시지 및 메시지에 관련된 정보를 수신 단말로 전송할 수 있다. 수신 단말 의 통신부는 발신 단말로부터 메시지 및 메시지에 관련된 정보를 수신할 수 있다. 도 8은 일 실시예에 따른 수신 단말이 메시지에 관련된 정보를 생성하는 방법의 흐름도이다. 단계에서, 수신 단말의 처리부는 메시지에 관련된 정보를 생성할 수 있다. 단계는 단계들(710, 720, 730)을 포함할 수 있다. 단계는 도 5를 참조하여 전술된 단계 및 단계의 사이에서 수행될 수 있다. 예를 들면, 단계 에서, 수신 단말의 처리부는 메시지와 함께 메시지에 관련된 정보를 생성하는 메뉴를 출력할 수 있다. 예를 들면, 메뉴는 \"정보 검색\" 버튼일 수 있다. 수신 단말의 사용자가 메뉴를 선택하면, 단계들 에서 메시지에 관련된 정보가 생성될 수 있다. 또는, 메시지에 관련된 정보는 메뉴의 선택 없이 생성될 수 있다. 예를 들면, 단계가 수행되면, 수신 단말 의 사용자의 관여 없이도, 메시지에 관련된 정보가 자동으로 생성될 수 있다. 메시지에 관련된 정보 아래에서는, 메시지에 관련된 정보가 설명된다. 아래의 표 1은 일 예에 따른 메시지에 관련된 정보를 나타낸다. 아래의 표 1에서는, 메시지에 관련된 정보의 예, 상기의 정보를 생성하기 위해 사용되는 데이터 및 정보의 생성의 방법이 각 행에서 설명된다. 표 1 메시지에 관련된 정 보정보의 생성을 위해 사용되는 데이터생성 방법의 일 예 및 설명 발신자 (발신자의 명칭)발신 단말의 전화번 호발신 단말의 전화번호에 대응하는 발신자가 식별되고, 발신자의 명칭이 결정됨. 발신자의 위치 발신 단말의 전화번 호발신 단말의 전화번호에 대응하는 발신자가 결정되고, 발신자에 대한 정보에 기반하여 발신자의 위치가 결정 됨. 발신자의 위치 및 수 신자의 위치 간의 경 로발신 단말의 전화번 호 및 수신 단말의 전화번호발신 단말의 전화번호를 사용하여 발신자 및 발신자의 위치가 결정되고, 수신 단말의 전화번호에 기반하여 수신자 및 수신자의 위치가 결정되고, 발신자의 위치 및 발신자의 위치에 기반하여 발신자의 위치 및 수신 자의 위치 간의 경로가 결정됨. 경로는 대중 교통의 경로 및 환승 방법 등을 포함할 수 있음.날짜 및/또는 시간메시지 메시지 중 날짜 및/또는 시간을 일반적으로 나타내는 표현(또는, 부분)이 존재하면 표현에 상응하는 \"날짜 및/또는 시간\"이 생성됨. 예를 들면, 메시지 중 \"2016/07/01\", \"2016-07-01\" 또는 \"16년 07월 01일\"이 존재하면, \"2016년 7월 1 일\"의 날짜가 도출됨. 예를 들면, 메시지 중 \"내일\", \"어제\", \"한시간 전\", \"오늘 오후\", \"내년\" 등과 같이 현 시점에 대한 특정 한 날짜 및/또는 시간을 표현하는 내용이 존재하면, 내용에 대응하는 날짜 및/또는 시간이 도출됨. 일별 일기예보 메시지 \"날짜 및/또는 시간\"에서의 \"일별 일기예보\"가 생성됨. 날짜 및/또는 시간이 현재 시간의 이후인 경 우에만 선택적으로 일기예보가 도출될 수 있음. 금액 메시지 메시지 중 금액을 일반적으로 나타내는 표현이 존재하 면 표현에 상응하는 \"금액\"이 생성됨. 예를 들면, 메시지 중 \"1달러\", \"1Dollar\" 또는 \"1 $\"가 존재하면 \"1달러\"의 금액이 도출됨. 환율 메시지 \"금액\"이 외환이면, 외환에 대한 환율 및/또는 대응하 는 원화가 도출됨. 장소 메시지 메시지 중 장소를 일반적으로 나타내는 표현이 존재하 면 표현에 상응하는 \"장소\"가 생성됨. 장소를 일반적으로 나타내는 표현은 행정구역의 명칭, 건물의 명칭, 도로명 및 기타 특정한 지명 등이 있음. 예를 들면, 메시지 중 \"서울시 서초구 서초동\", \"잠실 경기장\", \"탄천주차장, \"종로\", \"세종회관\"의 표현이 존재하면, \"서초동\", \"잠실 경기장\", \"탄천 주차장\", \"종로\" 또는 \"세종문화회관\"을 나타내는 \"장소\"가 생 성됨. 상호 메시지 메시지 중 상호에 대응하는 표현이 존재하면, 표현에 상응하는 \"상호\"가 생성됨. 업종 메시지 메지지 중 \"업종\"을 일반적으로 나타내는 표현이 존재 하면 표현에 상응하는 \"업종\"이 생성됨. 또는, \"상호\"에 해당하는 영업소의 \"업종\"이 생성됨. 위치 메시지 메지지 중 \"위치\"를 일반적으로 나타내는 표현이 존재 하면 표현에 상응하는 \"위치\"가 생성됨. 또는, \"장소\" 또는 \"상호\"에 대응하는 \"위치\"가 생성 됨. 주차 정보 메시지 \"장소\", \"상호\" 또는 \"위치\"에서의 \"주차 정보\"가 생 성됨. 지역 일기예보 메시지 \"지역\" 또는 \"위치\"에서의 \"지역 일기예보\"가 생성됨. \"지역 일기예보\"는 \"날짜 및/또는 시간\"의 특정한 시 점에서의 일기예보일 수 있음. 지도 메시지 \"장소\", \"상호\" 또는 \"위치\"에 대한 \"지도\"가 생성됨. 예약 정보 메시지 \"장소\" 또는 \"상호\"에서의 예약을 위한 \"예약 정보\"가 생성됨. 생활 정보 메시지 \"장소\" 또는 \"위치\"에서의 \"생활 정보\"가 생성됨. 예를 들면, \"생활 정보\"는 \"장소\" 또는 \"위치\"에서의 음식점 및 맛집 등일 수 있음. 쇼핑 정보 메시지 \"장소\", \"위치\" 또는 \"상호\"가 나타내는 상점에서의 \"쇼핑 정보\"가 생성됨. 예를 들면, \"쇼핑 정보\"는 \"상호\"가 나타내는 업종과 관련된 물품의 쇼핑에 대한 정보일 수 있음. 예약일 메시지 메시지 중 날짜 및/또는 시간을 일반적으로 나타내는 표현 및 예약을 나타내는 표현이 존재하면 표현에 상 응하는 \"날짜 및/또는 시간\"의 \"예약일\"이 생성됨. 일정 정보 메시지 \"날짜 및/또는 시간\"에서의 \"일정 정보\"가 생성됨.송장 번호 메시지 메시지 중 송장을 나타내는 기정의된 표현이 존재하면, 메시지 중 기정의된 조건에 따라 특정된 표 현에 상응하는 \"송장 번호\"가 생성됨. 예를 들면, 메시지 중 \"택배\", \"송장\", \"송장번호\" 및 특정한 운송회사의 명칭과 같은 기정의된 표현에 뒷따 르는 숫자열이 \"송장 번호\"를 나타내는 표현으로 간주 될 수 있음. 여기에서, 뒷따르는 숫자열은 기정의된 표현의 바로 다음에 뒷따르는 숫자열일 수 있고, 기정 의된 표현 및 띄어쓰기 공백의 다음에 뒷따르는 숫자 열일 수 있다. 배송 상태 메시지 \"송장 번호\"에 해당하는 택배의 \"배송 상태\"가 생성됨. 상태 정보 메시지 메시지 중 상태를 나타내는 기정의된 표현이 존재하면, 메시지 중 기정의된 조건에 따라 특정된 표 현에 상응하는 \"상태 정보\"가 생성됨. 예를 들면, 메시지 중 \"상태\" 등의 기정의된 표현이 존재하면, 기정의된 표현에 뒷따르는 수문자가 \"상태 정보\"를 나타내는 표현으로 간주될 수 있음. 콘텐츠 정보 메시지 메시지 중 특정한 콘텐츠를 일반적으로 나타내는 표현 또는 기정의된 표현이 존재하면, 콘텐츠에 대한 \"콘텐 츠 정보\"가 생성됨. 인증서 정보 메시지 메시지 중 인증서의 발급을 일반적으로 나타내는 표현 또는 기정의된 표현이 존재하면, 발급된 인증서에 대 한 \"인증서 정보\"가 생성됨. 날씨 메시지 및 사용자 위 치메시지 중 날씨, 기상 또는 기상 특보를 나타내는 일 반적인 표현 또는 기정의된 표현이 존재하면, 수신 단 말의 사용자의 위치에서의 \"날씨\"가 생성됨. 연락처 메시지 메시지 중 연락처를 나타내는 일반적인 표현이 존재하 면, 표현이 나타내는 \"연락처\"가 생성됨. 예를 들면, 연락처는 전화번호 및 이-메일 계정 등을 포함할 수 있음. 상기의 표 1의 설명에서, 메시지는 \"문자열\"로 구성될 수 있다. 메시지의 \"표현\"은 메시지 중 적어도 일부의 어 절 및 문자열을 나타낼 수 있다. 표 1에서, 용어 \"표현\"은 \"어절\" 또는 \"문자열\"로 대체될 수 있다. 표 1에서 설명된 것과 같이, 메시지에 관련된 정보는 메시지의 내용 및 패턴에 대한 분석을 통해 생성될 수 있 다. 또한, 메시지에 관련된 정보는 아래와 같은 방식으로 생성될 수 있다. 1) 메시지 중 특정한 정보를 나타내는 일반적인 표현에 기반하여 메시지에 관련된 정보가 생성될 수 있다. 2) 메시지에 관련된 정보의 생성에 사용되는 특정한 키워드가 정의될 수 있다. 정의된 키워드에 기반하여 메시 지에 관련된 정보가 생성될 수 있다. 말하자면, 메시지 중 정의된 키워드가 존재하면, 키워드에 대응하는 메시 지에 관련된 정보가 생성될 수 있다. 메시지에 관련된 정보를 생성하기 위해, 정의된 키워드에 대응하는 정보가 정의될 수 있다. 예를 들면, 특정한 콘텐츠 등에 대해서 약칭이 사용될 수 있다. 약칭이 키워드로서 정의될 수 있으며, 정의된 키워드가 특정한 콘텐츠를 나타낸다는 정보가 정의될 수 있다. 이러한 정의에 따라, 메시지 중 특정한 콘텐츠의 약칭을 나타내는 정의된 키워드가 존재할 경우, 콘텐츠에 대한 \"콘텐츠 정보\"가 생성될 수 있다. 또한, 예를 들 면, 키워드가 나타내는 의미가 2개 이상일 경우, 특정한 의미에 대응하는 정보가 키워드에 대응하는 정보로서 정의될 수 있다. 3) 인공지능 및/또는 빅데이터에 기반하여 메시지에 관련된 정보가 생성될 수 있다. 인공지능 및/또는 빅데이터 에 의해 특정한 메시지 또는 메시지의 특정한 표현에 대하여 사용자가 요구, 사용 또는 열람하는 정보가 식별될 수 있다. 특정한 메시지 또는 특정한 표현에 대하여 사람들이 요구, 사용 또는 열람하는 것으로 식별된 정보가 메시지에 관련된 정보로서 생성될 수 있다. 여기에서, 사용자는 발신 단말의 사용자, 수신 단말의 사용자 및/ 또는 타 사용자일 수 있다. 서버의 처리부, 발신 단말의 처리부 또는 수신 단말의 처리부는 메시지에 대한 인공 지능 검색을 수행할 수 있고, 인공 지능 검색의 결과를 메시지에 관련된 정보로서 제공할 수 있다. 인공 지능 검색은 서버에 의해 이루어질 수 있다. 예를 들면, 인공지능 및/또는 빅데이터에 기반하여 특정한 키워드가 특정한 콘텐츠(예를 들면, 현재 상영되고 있는 영화)를 나타낸다는 것이 식별될 수 있다. 이러한 경우, 인공지능 및/또는 빅데이터에 기반하여 특정한 키 워드가 특정한 콘텐츠를 나타내는 키워드로 정의될 수 있다. 이러한 정의에 따라, 메시지 중 정의된 키워드가 존재할 경우, 정의된 키워드가 나타내는 특정한 콘텐츠에 대한 \"콘텐츠 정보\"가 생성될 수 있다. 사용자의 행위에 기반하여 메시지에 관련된 정보가 생성될 수 있다. 예를 들면, 사용자가 특정한 메시지 또는 메시지의 특정한 표현을 수신 또는 확인하였을 때, 사용자가 검색하는 정보가 메시지에 관련된 정보로서 생성될 수 있다. 특정한 메시지 또는 특정한 표현에 대한 사용자의 행위가 수집될 수 있고, 수집된 사용자의 행위에 의 해 제공되는 정보가 메시지에 관련된 정보로서 생성될 수 있다. 여기에서, 사용자는 발신 단말의 사용자, 수신 단말의 사용자 및/또는 타 사용자일 수 있다. 또는, 예를 들면, 사용자가 특성한 메시지 또는 메시지의 특정한 표현을 수신 또는 확인하였을 때, 사용자가 전 화 걸기 또는 네비게이션의 실행 등과 같은 기능을 수행하였을 경우, 사용자가 수행한 기능이 메시지에 관련된 정보로서 생성될 수 있다. 사용자의 작성 또는 사용자의 선택에 의해 메시지에 관련된 정보가 생성될 수 있다. 발신 단말의 사용자는 발신 단말의 처리부 또는 서버의 처리부에 의해 제공된 메시지 에 관련된 정보의 후보들 중 일부를 메시지에 관련된 정보로서 선택할 수 있다. 메시지에 관련된 정보는 발신 단말의 사용자에 의해 작성될 수 있다. 또한, 수신 단말의 사용자는 수신 단말의 처리부 또는 서버의 처리부에 의해 제공된 메시지에 관련된 정보의 후보들 중 일부를 메시지에 관련된 정보 로서 선택할 수 있다. 메시지에 관련된 정보는 수신 단말의 사용자에 의해 작성될 수 있다. 예를 들면, 사용자에 의해 검색 및/또는 선택된 정보 및/또는 콘텐츠가 메시지에 관련된 정보로서 사용할 수 있 다. 사용자는 메시지 내에서 일부의 표현, 문자열 또는 어절을 선택할 수 있으며, 작성된 정보 또는 선택된 정보는 메시지에 관련된 정보로서 제공될 수 있다. 사용자의 작성 또는 사용자의 선택에 의해 생성된 메시지에 관련된 정보는 시스템의 사용자들 간에 공유될 수 있다. 공유를 통해 동일한 메시지 또는 유사한 메시지가 전송될 때, 메시지에 관련된 정보가 재사용될 수 있 다. 서버의 처리부, 발신 단말의 처리부 또는 수신단말의 처리부에 의해 메시지에 관련된 정보가 생성되면, 메시지에 관련된 정보는 발신 단말의 사용자 또는 수신 단말의 사용자에 의 해 편집, 추가 및/또는 삭제될 수 있다. 편집, 추가 및/또는 삭제에 의해 사용자의 의도에 부합하도록 메시지에 관련된 정보가 최적화될 수 있다. 전술된 메시지에 관련된 정보는 실시예에 따라, 발신 단말의 처리부, 수신 단말의 처리부 또는 서버의 처리부에 의해 수행될 수 있다. 하나의 메시지에 관련된 정보에 기반하여, 다른 메시지에 관련된 정보가 생성될 수 있다. 예를 들면, \"날짜 및/ 또는 시간\"이 생성되면, \"날짜 및/또는 시간\"에 기반하여 \"일별 일기예보\", \"예약일\" 또는 \"일정 정보\"가 생성 될 수 있다. 메시지에 관련된 기능 아래에서는 메시지와 관련된 기능이 설명된다. 메시지와 관련된 기능은 메시지에 관련된 정보에 기반하여 결정될 수 있다. 예를 들면, 메시지의 내용 및 분석 에 따라서, 메시지에 관련된 정보가 생성될 수 있고, 정보에 기인한 사용자의 행동이 예측될 수 있다. 예측된 사용자의 행동에 따라, 사용자가 사용할 것으로 예상되는 메시지에 관련된 기능이 제공될 수 있다. 아래의 표 2에서는 메시지에 관련된 기능, 기능에 대응하는 메시지에 관련된 정보 및 생성 방법의 일 예가 설명 된다. 표 2 메시지에 관련된 기 능기능에 대응하는 메 시지에 관련된 정보생성 방법의 일 예 및 설명 전화 걸기 연락처 메시지에 관련된 정보로서 연락처가 생성되면, 연락처 로의 \"전화걸기\"가 제공됨. 메일 전송 연락처 메시지에 관련된 정보로서 연락처가 생성되면, 연락처 로의 \"메일 전송\"가 제공됨. 네비게이션 실행 경로, 위치, 장소, 상호메시지에 관련된 정보로서 경로, 위치, 장소 또는 상 호가 생성되면, \"네비게이션 실행\"이 제공되고, 네비 게이션의 목적지로서 위치, 장소 또는 상호가 나타내 는 영업소가 설정됨. 홈페이지 접속 상호 메시지에 관련된 정보로서 상호가 생성되면, 상호에 해당하는 영업소의 홈페이지로의 \"홈페이지 접속\"이 제공됨. 알림 설정 일정 정보 메시지에 관련된 정보로서 일정 정보가 생성되면, 알 림을 설정할 수 있는 \"알림 설정\"이 제공됨. 메시지의 분류 아래에서는, 메시지에 대한 분류가 설명된다. 실시예에 따라, 발신 단말의 처리부, 수신 단말의 처리부 또는 서버의 처리부는 메시지의 특성에 따라 메시지에 대한 분류를 수행할 수 있다. 예를 들면, 메시지의 종류는 스팸 메시지, 정보성 메시지, 생활 관련 메시지 및 지인 메시지를 포함할 수 있다. 메시지는 스팸 메시지, 정보성 메시지, 생활 관련 메시지 및 지인 메시지 중 하나로 분류될 수 있다. 예를 들면, 정보성 메시지는 카드 사용을 나타내는 메시지 및 배송 상태를 나타내는 메시지 등을 포함할 수 있 다. 전술된 메시지에 관련된 정보 및 메시지에 관련된 기능은 선택적으로 제공될 수 있다. 전술된 메시지에 관련된 정보 및 메시지에 관련된 기능은 메시지가 기정의된 종류로 분류된 경우에 선택적으로 제공될 수 있다. 예를 들면, 전술된 메시지에 관련된 정보 및 메시지에 관련된 기능은 문자가 스팸 문자 외의 다른 종류의 문자 로 분류된 경우에 선택적으로 제공될 수 있다. 또는, 지정되거나 정의되지 않은 정보성 메시지에 대한 분류는 사용자에 의해 편집될 수 있다. 도 9는 일 예에 따른 메시지를 나타낸다. 도 9에서 도시된 것과 같이, 수신 단말은 메시지를 수신하면서, 메시지 및 발신 단말의 전화번호를 획득할 수 있다. 수신 단말의 표시부에서는, 발신 단말의 전화번호 및 메시지가 출력되었다. 아래의 도 10에서는 도 9의 메시지를 사용하여 생성된 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸 다. 도 10은 일 예에 따른 메시지를 사용하여 생성된 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 10에서는, 도 9의 전화번호 및 메시지로부터 \"전화번호\", \"상호\", \"날짜 및/또는 시간\" 및 \"상태\"의 종류의 표현이 추출된다. 예를 들면, 메시지에서, \"18778448\"의 표현은 전화 번호로서 추출되고, \"THE ANANTI CLUB, SEOUL\"의 표현은 상호로서 추출되고, \"2016년05월07일09시40분\"의 표현은 날짜 및/또는 시간으로서 추출되고, \"예약완료\"의 표현은 상태로서 추출된다. 또한, 추출된 내용으로부터 메시지에 관련된 정보가 생성된다. 예를 들면, \"전화번호\"에 기반하여 \"발신자\"가 결정된다. \"상호\"에 기반하여 \"업종\", \"주차 정보\", \"지역 일기예보\", \"지도\", \"예약 정보\", \"생활 정보\" 및 \" 쇼핑 정보\"이 결정된다. \"날짜 및/또는 시간\"에 기반하여 \"예약일\", \"일별 일기예보\" 및 \"일정 정보\"가 결정된 다. 또한, 추출된 내용으로부터 메시지에 관련된 기능이 결정된다. 예를 들면, \"전화번호\"에 기반하여 \"전화 걸기\" 기능이 제공된다. \"상호\"에 기반하여 \"네비게이션 실행\" 및 \"홈페이지 접속\" 기능이 제공된다. 도 11 및 도 12는 일 예에 따른 도 9의 메시지에 대해 제공되는 메시지에 관련된 정보 및 메시지에 관련된 기능 을 나타낸다. 도 11은 일 예에 따른 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 11에서는, 수신 단말의 표시부에 표시되는 메시지에 관련된 정보 및 메시지에 관련된 기능 중 첫 번째 부분이 도시되었다. 도 12는 일 예에 따른 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 12에서는, 수신 단말의 표시부에 표시되는 메시지에 관련된 정보 및 메시지에 관련된 기능의 두 번째 부분이 도시되었다. 도 13은 일 예에 따른 메시지를 나타낸다. 도 13에서는, 수신 단말의 표시부에 표시되는 메시지가 도시되었다. 메시지는 특정한 일자 및 시간의 야구 경기에 대한 메시지일 수 있다. 도 14 및 도 15는 일 예에 따른 도 13의 메시지에 대해 제공되는 메시지에 관련된 정보 및 메시지에 관련된 기 능을 나타낸다. 도 14은 일 예에 따른 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 14에서는, 수신 단말의 표시부에 표시되는 메시지에 관련된 정보 및 메시지에 관련된 기능 중 첫 번째 부분이 도시되었다. 도 15은 일 예에 따른 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 15에서는, 수신 단말의 표시부에 표시되는 메시지에 관련된 정보 및 메시지에 관련된 기능의 두 번째 부분이 도시되었다. 도 16은 일 예에 따른 메시지를 나타낸다. 도 16에서는, 수신 단말의 표시부에 표시되는 메시지가 도시되었다. 메시지는 특정한 운송사를 통해 제공되는 택배의 송장 번호를 나타낼 수 있다. 도 17는 일 예에 따른 도 16의 메시지에 대해 제공되는 메시지에 관련된 정보 및 메시지에 관련된 기능의 일부 를 나타낸다. 도 18은 일 예에 따른 메시지를 나타낸다. 도 18에서는, 수신 단말의 표시부에 표시되는 메시지가 도시되었다. 메시지는 수신 단말의 사용 자의 징병 검사의 일정을 나타낸다. 도 19는 일 예에 따른 도 18의 메시지에 대해 제공되는 메시지에 관련된 정보 및 메시지에 관련된 기능의 일부 를 나타낸다. 도 20은 일 예에 따른 메시지를 나타낸다. 도 20에서는, 수신 단말의 표시부에 표시되는 메시지가 도시되었다. 메시지는 사용자의 지인의 약속 제안을 나타낸다. 메시지 중 \"내일\", \"장충동\" 및 \"소주\"의 표현이 메시지에 관련된 정보의 생성을 위해 사용된다는 것이 도시되 었다. 도 21은 일 예에 따른 도 20의 메시지에 대해 제공되는 메시지에 관련된 정보를 나타낸다. 도 22은 일 예에 따른 메시지를 나타낸다. 도 22에서는, 수신 단말의 표시부에 표시되는 메시지가 도시되었다. 메시지는 사용자의 지인의 약속 제안을 나타낸다. 메시지 중 \"곡성\", \"이번 주말\", \"상암\" 및 \"영화\"의 표현이 메시지에 관련된 정보의 생성을 위해 사용된다는 것이 도시되었다. 도 23은 일 예에 따른 도 22의 메시지에 대해 제공되는 메시지에 관련된 정보를 나타낸다. 도 24는 일 예에 따른 메시지에 관련된 정보의 검색을 나타낸다. 도 24에서, 좌측의 그림은 발신 단말에 표시된 메시지를 나타낸다. 메시지와 함께 메시지에 관련된 정보를 출력하는 메뉴가 출력될 수 있다. 예를 들면, 메뉴는 버튼 또는 링크일 수 있다. 도 24에서, 메뉴는 \"친구 비서 연결\"로 표시되었다. 발신 단말의 사용자에 의해 메뉴가 선택되면 발신 단말에서 메시지에 관련된 정 보가 출력될 수 있으며, 사용자에 의해 메시지에 관련된 정보가 편집될 수 있다. 도 24에서, 가운데의 그림은 메시지에 관련된 정보를 나타낸다. 메시지에 관련된 정보는 발신 단말의 사용 자 및/또는 수신 단말의 사용자에 의해 편집될 수 있고, 발신 단말의 사용자, 수신 단말의 사용 자 및 시스템의 다른 사용자 간에 공유될 수 있다. 도 24에서, 우측의 그림은 수신 단말에 표시된 메시지를 나타낸다. 메시지와 함께 메시지에 관련된 정보를 출력하는 메뉴가 출력될 수 있다. 예를 들면, 메뉴는 버튼 또는 링크일 수 있다. 도 24에서, 메뉴는 \"친구 비서 연결\"로 표시되었다. 수신 단말의 사용자에 의해 메뉴가 선택되면 수신 단말에 서 메시지에 관련된 정보가 출력될 수 있으며, 사용자에 의해 메시지에 관련된 정보가 편집될 수 있다. 도 25 내지 도 28은 일 예에 따른 분류된 메시지를 나타낸다. 도 26 내지 도 29의 실시예에서, 메시지는 금융 정보, 생활 엔터, 지인 및 스팸의 종류로 분류된다. 금융 정보 는 전술된 정보성 메시지에 대응할 수 있다. 생활 엔터는 전술된 생활 관련 메시지에 대응할 수 있다. 지인은 전술된 지인 메시지에 대응할 수 있다. 스팸은 전술된 스팸 메시지에 대응할 수 있다. 도 25는 일 예에 따른 전체의 메시지를 나타낸다. 도 25에서는, 메시지의 발신인 및 메시지의 내용이 도시되었다. 도 26은 일 예에 따른 금융 정보에 관련된 메시지를 나타낸다. 도 26에서는, 전체의 메시지 중 금융 정보에 관련된 메시지가 표시되도록 선택되었고, 금융 정보의 은행, 카드 및 보험 중 카드에 관련된 메시지가 표시되도록 선택되었다. 도 27은 일 예에 따른 생활 엔터에 관련된 메시지를 나타낸다. 도 27에서는, 전체의 메시지 중 생활 엔터에 관련된 메시지가 표시되도록 선택되었고, 생활 엔터의 주문/배송 및 예약/예매 중 주문/배송에 관련된 메시지가 표시되도록 선택되었다.도 28은 일 예에 따른 지인에 관련된 메시지를 나타낸다. 도 28에서는, 전체의 메시지 중 지인에 관련된 메시지가 표시되도록 선택되었고, 등록번호 및 미등록번호 중 등 록번호의 메시지가 표시되도록 선택되었다. 등록번호는 수신 단말에 등록된 전화번호로부터의 메시지를 나 타낼 수 있다. 미등록번호는 수신 단말에 등록되지 않은 전화번호로부터의 메시지를 나타낼 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CDROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기광 매체 (magnetooptical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2016-0110452", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다."}
{"patent_id": "10-2016-0110452", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 예에 따른 메시지가 제공되는 시스템을 나타낸다. 도 2는 일 실시예에 따른 서버의 블록도이다. 도 3은 일 실시예에 따른 발신 단말의 블록도이다. 도 4는 일 실시예에 따른 수신 단말의 블록도이다. 도 5는 일 실시예에 따른 메시지 제공 방법의 흐름도이다. 도 6는 일 실시예에 따른 발신 단말이 메시지에 관련된 정보를 생성하는 방법의 흐름도이다. 도 7은 일 실시예에 따른 서버가 메시지에 관련된 정보를 생성하는 방법의 흐름도이다. 도 8은 일 실시예에 따른 수신 단말이 메시지에 관련된 정보를 생성하는 방법의 흐름도이다. 도 9는 일 예에 따른 메시지를 나타낸다. 도 10은 일 예에 따른 메시지를 사용하여 생성된 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 11은 일 예에 따른 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 12는 일 예에 따른 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 13은 일 예에 따른 메시지를 나타낸다. 도 14은 일 예에 따른 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 15은 일 예에 따른 메시지에 관련된 정보 및 메시지에 관련된 기능을 나타낸다. 도 16은 일 예에 따른 메시지를 나타낸다. 도 17는 일 예에 따른 도 16의 메시지에 대해 제공되는 메시지에 관련된 정보 및 메시지에 관련된 기능의 일부 를 나타낸다. 도 18은 일 예에 따른 메시지를 나타낸다. 도 19는 일 예에 따른 도 18의 메시지에 대해 제공되는 메시지에 관련된 정보 및 메시지에 관련된 기능의 일부 를 나타낸다. 도 20은 일 예에 따른 메시지를 나타낸다. 도 21은 일 예에 따른 도 20의 메시지에 대해 제공되는 메시지에 관련된 정보를 나타낸다. 도 22은 일 예에 따른 메시지를 나타낸다. 도 23은 일 예에 따른 도 22의 메시지에 대해 제공되는 메시지에 관련된 정보를 나타낸다. 도 24는 일 예에 따른 메시지에 관련된 정보의 검색을 나타낸다. 도 25는 일 예에 따른 전체의 메시지를 나타낸다. 도 26은 일 예에 따른 금융 정보에 관련된 메시지를 나타낸다. 도 27은 일 예에 따른 생활 엔터에 관련된 메시지를 나타낸다. 도 28은 일 예에 따른 지인에 관련된 메시지를 나타낸다."}
