{"patent_id": "10-2022-0053277", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0111216", "출원번호": "10-2022-0053277", "발명의 명칭": "민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템", "출원인": "(주)라드피온", "발명자": "김명진"}}
{"patent_id": "10-2022-0053277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재를 위탁받아서 관리 및 보존하는 물리적 수장고; 상기 물리적 수장고에 위탁된 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진을 이용하여 시스템 사용자가상기 민간 문화재를 열람하고, 대여 신청하는 것이 가능한 사이버 수장고; 및 상기 물리적 수장고 및 상기 사이버 수장고를 연동하여 제어하고 관리하는 제어부;를 포함하고, 상기 제어부는, 상기 민간 문화재가 상기 물리적 수장고에 위탁되거나, 또는 상기 물리적 수장고로부터 상기 민간 문화재가 대여되는 경우, 자동적으로 상기 사이버 수장고가 연동하여 업데이트 되어 최신화되도록 하고, 그리고 상기 시스템 사용자로부터 상기 사이버 수장고에 상기 민간 문화재의 대여 신청을 받는 경우, 상기 물리적수장고에서 연동하여 상기 민간 문화재가 대여되도록 처리하는 것을 특징으로 하는, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템."}
{"patent_id": "10-2022-0053277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 사이버 수장고에는, 상기 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진, 상기 민간 문화재의 이름,형상수치계측 정보, 소유자 정보, 특성 분석 성적서의 정보, 연대 분석 성적서의 정보, 구입 정보, 전문가 감정정보를 포함한 상기 민간 문화재의 정보를 저장하는 민간 문화재 정보 저장부;를 더 포함하는, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템."}
{"patent_id": "10-2022-0053277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 민간 문화재가 상기 물리적 수장고에 입고되면서 촬영한 제 1 영상을 인공지능으로 원 상태 복원한 제 2영상과 비교하여, 보존 상태를 분류하고, 보존 상태 점수(PR, 0≤PR≤1)를 부여하고, 상기 민간 문화재를 가치 평가하는 민간 문화재 가치 평가부;를 더 포함하고, 상기 민간 문화재 가치 평가부는, 상기 민간 문화재 정보 저장부에 저장된, 상기 민간 문화재의 3차원 영상 또는 2차원 사진, 상기 형상수치계측정보, 상기 특성 분석 성적서의 정보, 상기 연대 분석 성적서의 정보를 기초로 하여, 실제로 거래된 민간 문화재 가운데 가장 유사하다고 판정한 민간 문화재의 구입 정보에 기초하여, 아래의 수학식 4인 (P1는 상기 민간 문화재가 열람될 때의 제 1 민간 문화재 가치 평가액이고, 상기 Psimilar는 실제로 거래된 민간 문화재 가운데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t1은 실제로 거래된 민간 문화재 가운데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 거래일로부터 상기 민간 문화재가 열람될 때까지의 시간 차이) 공개특허 10-2022-0111216-3-에 따라 상기 민간 문화재의 가치 평가 정보를 제시하는 제 1 민간 문화재 가치 평가부; 상기 민간 문화재 정보 저장부에 저장된, 상기 구입 정보에 기초하여, 아래의 수학식 5인 (P2는 상기 민간 문화재가 열람될 때의 제 2 민간 문화재 가치 평가액이고, 상기 P0는 상기 민간 문화재가 구입될 때의 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t2는 상기 민간 문화재가 구입될 때부터 상기 민간 문화재가 열람될 때까지의 시간 차이) 에 따라 상기 민간 문화재의 가치 평가 정보를 제시하는 제 2 민간 문화재 가치 평가부; 및상기 민간 문화재 정보 저장부에 저장된, 상기 전문가 감정 정보에 따라 아래의 수학식 6인 (P3은 상기 민간 문화재가 열람될 때의 제 3 민간 문화재 가치 평가액이고, 상기 Pappraise는 상기 민간 문화재의 전문가 감정 정보에 따른 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t3는 상기 민간 문화재가 전문가 감정을 받은 때부터 상기 민간 문화재가 열람될 때까지의 시간 차이) 에 따라 상기 민간 문화재의 가치 평가 정보를 제시하는 제 3 민간 문화재 가치 평가부;를 포함하는 것을 특징으로 하는, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템."}
{"patent_id": "10-2022-0053277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 사이버 수장고를 통해서, 온라인 전시회를 제공하는 온라인 전시회 제공부; 및 상기 사이버 수장고를 통해서, 온라인 경매를 제공하는 온라인 경매 제공부;를 더 포함하고, 상기 온라인 경매 제공부는, 초기 경매 시작 가격으로, 상기 제 1 민간 문화재 가치 평가부, 상기 제 2 민간 문화재 가치 평가부, 및 상기 제 3 민간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보를 모두제시하는 것을 특징으로 하는, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템."}
{"patent_id": "10-2022-0053277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 민간 문화재의 위탁 관리 및 보존의 비용을 책정하는 비용 책정부;를 더 포함하고, 상기 비용 책정부는,상기 제 1 민간 문화재 가치 평가부, 상기 제 2 민간 문화재 가치 평가부, 및 상기 제 3 민간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보에 따라, 상기 민간 문화재의 위탁 관리 및 보존의 비용을 차등적으로 책정하는 것을 특징으로 하는, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템."}
{"patent_id": "10-2022-0053277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,공개특허 10-2022-0111216-4-상기 민간 문화재에 대한 보험을, 보험사 시스템과 연계하는 보험 연계부;를 더 포함하고, 상기 보험 연계부는,상기 제 1 민간 문화재 가치 평가부, 상기 제 2 민간 문화재 가치 평가부, 및 상기 제 3 민간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보에 따라, 상기 민간 문화재의 보험비를 차등적으로 책정하는 것을 특징으로 하는, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템."}
{"patent_id": "10-2022-0053277", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 사이버 수장고에 저장된 상기 민간 문화재마다 고유하게 객체를 식별하는데 사용되는 디지털 객체 식별자를 부여하고, 상기 제어부는 상기 디지털 객체 식별자에 따라서 상기 물리적 수장고 및 상기 사이버 수장고를연동하여 제어하고 관리하는 것을 특징으로 하는, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템."}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재를 위탁받아서 실제로 관리 및 보 존하는 물리적 수장고; 상기 물리적 수장고에 위탁된 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진을 이 용하여 시스템 사용자가 상기 민간 문화재를 열람하고, 대여 신청하는 것이 가능한 사이버 수장고; 및 상기 물리 (뒷면에 계속)"}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템에 관한 것으로, 보다 상세하게는, 개인, 문 중 및 회사가 소유하여 보존 및 관리에 애로를 가지고 있는 민간 문화재를 위탁 관리, 보존하는 물리적 수장고 및 이 물리적 수장고에 보관된 민간 문화재를 온라인이나 앱으로 열람하거나 대여 신청하거나, 개인 전시회나 경매를 할 수 있도록 하는 사이버 수장고를 상호 연동하는 한편, 민간 문화재의 복수의 다양한 가치 평가를 제 공하는 것이 가능한, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템에 관한 것이다."}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "문화재는 고고학, 선사학, 역사학, 문학, 예술, 과학, 종교, 민속, 생활양식 등에서 문화적 가치가 있다고 인정 되는 인류 문화 활동의 소산을 말한다. 문화재보호법에 따르면 문화재는 유형문화재, 무형문화재, 기념물, 민속 자료로 분류되며, 유형 문화재는 건조물, 전적, 서적, 고문서, 회화, 조각, 공예품 등 유형의 문화적 소산으로 서 역사상 또는 예술상 가치가 큰 것과 이에 준하는 고고자료를 말한다. 이와 같은 문화재는 국가나 지방자치단체 등 공공기관에서 보존 및 관리하는 문화재도 있지만, 개인, 문중 및 회사 등 민간이 문화재를 다수 소유하는 경우도 있다. 이것을 아래에서는 민간 문화재라고 지칭하기로 한다. 민간 문화재는 잘 보존 및 관리되는 경우도 있겠지만, 대부분의 민간 문화재는 보존 및 관리가 소홀하거나, 심 한 경우에는 전혀 보존 및 관리가 되지 않는 경우가 있었다. 예를 들어, 도자기나 서예작품 등 고미술품을 문중 내에서 전문가의 도움 없이 임의로 보관하거나 보존하여, 파손 위험성, 화재, 풍수해 등의 경우 문화재로서의 가치가 떨어지거나 훼손될 우려가 많은 실정이었다. 한편, 문중 내에서 오랫 동안 물려 받아서 보관하는 민간 문화재의 경우, 정확한 문화재 가치를 알지 못하고 단 순히 물려 받아 왔기 때문에 계속 보관하거나 보존하는 경우다 다수 존재하였다. 상당한 문화재 가치를 가지고 있다면, 필요한 경우 비용을 지불하더라도, 전문가가 보존하거나 관리하도록 하는 것이 더 합리적일 수도 있다. 하지만, 현실적으로 전문가 감정을 받는 것은 비용적으로나, 시간적으로나, 감정을 하는 도중이나 감정을 받으 로 가거나 오는 도중에 문화재가 파손되거나 문화재의 가치가 훼손될 우려 등으로 쉽지 않은 것이 현실이었다. 관련한 특허문헌으로서, 대한민국 공개특허 제10-2020-0128828호(2020.11.17. 공개)(발명의 명칭 : 내진용 유물 수장대 설치 구조(Installation structure of cultural assets for earthquake prevention))에서는, \"본 발명 은 내진용 유물 수장대 설치 구조에 관한 것으로서, 보다 상세하게는 지진이나 외부 진동 등에 의한 영향으로 유물이 보관된 유물 수장대에 전달될 시 유물 수장대의 전도나 유물의 낙하를 방지하기 위한 것으로서, 여러 개 의 유물 수장대을 다른 유물 수장대에 서로서로 연결하는데, 서로 간의 충격이나 진동 감쇄할 수 있는 충격 흡수 수단이 포함된 충격흡수 커넥터 모듈로 연결하여 넘어지거나 흔들림을 최소화할 수 있는 내진용 유물 수장대 설치 구조\"에 대해서 개시하고 있다. 또한, 대한민국 공개특허 제10-2008-0012767호(2008.02.12. 공개)(발명의 명칭 : 유비쿼터스 문화재 보호 관리 시스템(Ubiquitous cultural property protection and management system))에서는, \"비쿼터스 센서 네트워크를 이용하여 주요 문화재의 산사태 및 낙석등 절토사면 또는 도난 및 유실을 실시간으로 감지하여 안전과 기능적 정상 유무를 파악할 수 있도록 함으로써 소중한 문화재의 보호 및 지속적 관리를 유지할 수 있도록 하는 유비쿼 터스 문화재 보호 관리시스템\"에 대해서 개시하고 있다. 하지만, 상술한 관련 특허문헌에서는, 본 발명과 달리, 개인, 문중 및 회사가 소유하여 보존 및 관리에 애로를 가지고 있는 민간 문화재를 위탁 관리, 보존하는 물리적 수장고 및 이 물리적 수장고에 보관된 민간 문화재를 온라인이나 앱으로 열람하거나 대여 신청하거나, 개인 전시회나 경매를 할 수 있도록 하는 사이버 수장고를 상 호 연동하는 한편, 민간 문화재의 복수의 다양한 가치 평가를 제공하는 것이 가능한, 민간 문화재의 보존과 유 통을 위한 사이버 수장고 시스템에 대해서는 전혀 개시하지 않고 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2020-0128828호(2020.11.17. 공개)(발명의 명칭 : 내진용 유물 수장 대 설치 구조(Installation structure of cultural assets for earthquake prevention)) (특허문헌 0002) 대한민국 공개특허 제10-2008-0012767호(2008.02.12. 공개)(발명의 명칭 : 유비쿼터스 문화재 보호 관리시스템(Ubiquitous cultural property protection and management system))"}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는, 전술한 바와 같은 문제점 내지는 필요성을 해결하기 위한 것으로, 개 인, 문중 및 회사가 소유하여 보존 및 관리에 애로를 가지고 있는 민간 문화재를 위탁 관리, 보존하는 물리적 수장고 및 이 물리적 수장고에 보관된 민간 문화재를 온라인이나 앱으로 열람하거나 대여 신청하거나, 개인 전 시회나 경매를 할 수 있도록 하는 사이버 수장고를 상호 연동하는 한편, 민간 문화재의 복수의 다양한 가치 평 가를 제공하는 것이 가능한, 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템을 제공하는 것이다. 한편, 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하"}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 실현하기 위한 본원 발명의 일 실시예에 따른 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템은, 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재를 위탁받아서 실제로 관리 및 보존하는 물리적 수장고; 상기 물리적 수장고에 위탁된 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진을 이용하여 시스템 사용자가 상기 민간 문화재를 열람하고, 대여 신청하는 것이 가능한 사이버 수장고; 및 상기 물리적 수장고 및 상기 사이버 수장고를 연동하여 제어하는 제어부;를 포함하고, 상기 제어부는, 상기 민간 문 화재가 상기 물리적 수장고에 위탁되거나, 또는 상기 물리적 수장고로부터 상기 민간 문화재가 대여되는 경우, 자동적으로 상기 사이버 수장고가 연동하여 업데이트 되어 최신화되도록 하고, 그리고 상기 시스템 사용자로부 터 상기 사이버 수장고에 상기 민간 문화재의 대여 신청을 받는 경우, 상기 물리적 수장고에서 연동하여 상기 민간 문화재가 대여되도록 처리한다. 또한, 상기 사이버 수장고에는, 상기 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진, 상기 민간 문화재의 이름, 형상수치계측 정보, 소유자 정보, 특성 분석 성적서의 정보, 연대 분석 성적서의 정보, 구입 정보, 전문 가 감정 정보를 포함한 상기 민간 문화재의 정보를 저장하는 민간 문화재 정보 저장부;를 더 포함할 수 있다. 여기서, 상기 민간 문화재를 가치 평가하는 민간 문화재 가치 평가부;를 더 포함하고, 상기 민간 문화재 가치 평가부는, 상기 민간 문화재 정보 저장부에 저장된, 상기 민간 문화재의 3차원 영상 또는 2차원 사진, 상기 형 상수치계측 정보, 상기 특성 분석 성적서의 정보, 상기 연대 분석 성적서의 정보를 기초로 하여, 실제로 거래된 민간 문화재 가운데 가장 유사하다고 판정한 민간 문화재의 구입 정보에 기초하여, 아래의 수학식 1인 (P1는 상기 민간 문화재가 열람될 때의 제 1 민간 문화재 가치 평가액이고, 상기 Psimilar 는 실제로 거래된 민간 문화재 가운데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t1은 실제로 거래 된 민간 문화재 가운데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 거래일로부터 상기 민간 문 화재가 열람될 때까지의 시간 차이)에 따라 상기 민간 문화재의 가치 평가 정보를 제시하는 제 1 민간 문화재 가치 평가부; 상기 민간 문화재 정보 저장부에 저장된, 상기 구입 정보에 기초하여, 아래의 수학식 2인 (P2는 상기 민간 문화재가 열람될 때의 제 2 민간 문화재 가치 평가액이고, 상기 P0는 상기 민간 문화재가 구입될 때의 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연 평균 가치 증가율이고, t2는 상기 민간 문화재가 구입될 때부터 상기 민간 문화재가 열람될 때까지의 시간 차이)에 따라 상기 민간 문화재의 가치 평가 정보를 제시하는 제 2 민간 문화재 가치 평가부; 및 상기 민간 문 화재 정보 저장부에 저장된, 상기 전문가 감정 정보에 따라 아래의 수학식 3인 (P3은 상기 민간 문화재가 열람될 때의 제 3 민간 문화재 가치 평가액이고, 상기 Pappraise는 상기 민간 문화재의 전문가 감정 정보에 따른 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t3는 상기 민간 문화재가 전문가 감정을 받은 때부터 상기 민간 문화재가 열람될 때까지의 시간 차 이)에 따라 상기 민간 문화재의 가치 평가 정보를 제시하는 제 3 민간 문화재 가치 평가부;를 포함할 수 있다. 한편, 상기 민간 문화재가 상기 물리적 수장고에 입고되면서 촬영한 제 1 영상을 인공지능으로 원 상태 복원한 제 2 영상과 비교하여, 보존 상태를 분류하고, 보존 상태 점수(PR, 0≤PR≤1)를 부여하고, 상기 민간 문화재를 가치 평가하는 민간 문화재 가치 평가부;를 더 포함하고, 상기 민간 문화재 가치 평가부는, 상기 민간 문화재 정보 저장부에 저장된, 상기 민간 문화재의 3차원 영상 또는 2차원 사진, 상기 형상수치계측 정보, 상기 특성 분석 성적서의 정보, 상기 연대 분석 성적서의 정보를 기초로 하여, 실제로 거래된 민간 문화재 가운데 가장 유 사하다고 판정한 민간 문화재의 구입 정보에 기초하여, 아래의 수학식 4인 (P1는 상기 민 간 문화재가 열람될 때의 제 1 민간 문화재 가치 평가액이고, 상기 Psimilar는 실제로 거래된 민간 문화재 가운 데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t1은 실제로 거래된 민간 문화재 가운데 상기 민간 문 화재와 가장 유사하다고 판정한 민간 문화재의 거래일로부터 상기 민간 문화재가 열람될 때까지의 시간 차이)에 따라 상기 민간 문화재의 가치 평가 정보를 제시하는 제 1 민간 문화재 가치 평가부; 상기 민간 문화재 정보 저 장부에 저장된, 상기 구입 정보에 기초하여, 아래의 수학식 5인 (P2는 상기 민간 문화재가 열람될 때의 제 2 민간 문화재 가치 평가액이고, 상기 P0는 상기 민간 문화재가 구입될 때의 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t2는 상기 민간 문화재 가 구입될 때부터 상기 민간 문화재가 열람될 때까지의 시간 차이)에 따라 상기 민간 문화재의 가치 평가 정보 를 제시하는 제 2 민간 문화재 가치 평가부; 및 상기 민간 문화재 정보 저장부에 저장된, 상기 전문가 감정 정 보에 따라 아래의 수학식 6인 (P3은 상기 민간 문화재가 열람될 때의 제 3 민간 문화재 가치 평가액이고, 상기 Pappraise는 상기 민간 문화재의 전문가 감정 정보에 따른 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t3는 상기 민간 문화재가 전문가 감 정을 받은 때부터 상기 민간 문화재가 열람될 때까지의 시간 차이)에 따라 상기 민간 문화재의 가치 평가 정보 를 제시하는 제 3 민간 문화재 가치 평가부;를 포함할 수 있다. 또한, 상기 사이버 수장고를 통해서, 온라인 전시회를 제공하는 온라인 전시회 제공부; 및 상기 사이버 수장고 를 통해서, 온라인 경매를 제공하는 온라인 경매 제공부;를 더 포함하고, 상기 온라인 경매 제공부는, 초기 경 매 시작 가격으로, 상기 제 1 민간 문화재 가치 평가부, 상기 제 2 민간 문화재 가치 평가부, 및 상기 제 3 민 간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보를 모두 제시하는 것이 바람직하다. 또한, 상기 민간 문화재의 위탁 관리 및 보존의 비용을 책정하는 비용 책정부;를 더 포함하고, 상기 비용 책정 부는, 상기 제 1 민간 문화재 가치 평가부, 상기 제 2 민간 문화재 가치 평가부, 및 상기 제 3 민간 문화재 가 치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보에 따라, 상기 민간 문화재의 위탁 관리 및 보존의 비용 을 차등적으로 책정하는 것이 바람직하다. 또한, 상기 민간 문화재에 대한 보험을, 보험사 시스템과 연계하는 보험 연계부;를 더 포함하고, 상기 보험 연 계부는, 상기 제 1 민간 문화재 가치 평가부, 상기 제 2 민간 문화재 가치 평가부, 및 상기 제 3 민간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보에 따라, 상기 민간 문화재의 보험비를 차등적으로 책 정하는 것이 바람직하다. 또한, 상기 사이버 수장고에 저장된 상기 민간 문화재마다 고유하게 객체를 식별하는데 사용되는 디지털 객체 식별자를 부여하고, 상기 제어부는 상기 디지털 객체 식별자에 따라서 상기 물리적 수장고 및 상기 사이버 수장 고를 연동하여 제어하고 관리하는 것이 바람직하다."}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이에 본 발명에 따른 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템에 따르면, 첫째, 개인, 문중 및 회사가 소유하여 보존 및 관리에 애로를 가지고 있는 민간 문화재를 위탁 관리, 보존하는 물리적 수장고 및 이 물리적 수장고에 보관된 민간 문화재를 온라인이나 앱으로 열람하거나 대여 신청하거나, 개인 전시회나 경매를 할 수 있도록 하는 사이버 수장고를 상호 연동하는 것이 가능하다. 둘째, 사이버 수장고를 통해서 개인별로 맞춤형의 수장고를 구현하는 것이 가능하다. 셋째, 민간 문화재의 복수의 다양한 가치 평가를 제공하는 것이 가능하다. 즉, 가장 유사하다고 판정한 민간 문화재의 가치 평가 정보에 기초한 제 1 민간 문화재 가치 평가, 예전 구입 정보에 기초한 제 2 민간 문화재 가 치 평가, 전문가 감정 정보에 따른 제 3 민간 문화재 가치 평가 등을 제시할 수 있다. 넷째, 민간 문화재가 상기 물리적 수장고에 입고되면서 촬영한 제 1 영상을 인공지능으로 원 상태 복원한 제 2 영상과 비교하여, 보존 상태를 분류하고, 보존 상태 점수(PR, 0≤PR≤1)를 부여하고, 이와 같은 보존 상태 점수 를 반영하여 민간 문화재를 가치 평가하는 것도 가능하다. 다섯째, 민간 문화재의 위탁 관리 및 보존의 비용을 책정하는 비용 책정부에서, 제 1 민간 문화재 가치 평가부, 제 2 민간 문화재 가치 평가부, 및 제 3 민간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보 에 따라, 민간 문화재의 위탁 관리 및 보존의 비용을 차등적으로 책정하는 것이 가능하다. 여섯째, 민간 문화재에 대한 보험을, 보험사 시스템과 연계하는 보험 연계부에서, 제 1 민간 문화재 가치 평가 부, 제 2 민간 문화재 가치 평가부, 및 제 3 민간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보에 따라, 민간 문화재의 보험비를 차등적으로 책정하는 것이 가능하다. 일곱째, 제어부가 민간 문화재마다 고유하게 객체를 식별하는데 사용되는 디지털 객체 식별자에 따라서, 물리적 수장고 및 사이버 수장고를 연동하여 제어하고 관리할 수 있다. 여덟째, 본 시스템의 사이버 수장고를 통해서, 온라인 전시회를 제공하는 온라인 전시회 제공부 및/ 또는 사이버 수장고를 통해서, 온라인 경매를 제공하는 온라인 경매 제공부를 더 포함할 수 있다. 현 장이나 현실적으로 전시회를 하거나 경매를 할 경우, 고가의 파손이나 가치의 훼손 우려가 있는 민간 문화재를 실제로 전시할 필요가 있는데, 본 발명과 같이 온라인 전시회를 제공하거나 온라인 경매로 진행할 경우 고가의민간 문화재의 파손이나 가치의 훼손 우려를 없애는 것이 가능하다. 이를 통해서, 좀 더 활발한 민간 문화재의 유통이 이루어지는 것을 기대할 수 있다. 한편, 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효"}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에 개시되어 있는 본 발명의 개념에 따른 실시 예들에 대해서 특정한 구조적 또는 기능적 설명은 단지 본 발명의 개념에 따른 실시 예들을 설명하기 위한 목적으로 예시된 것으로서, 본 발명의 개념에 따른 실시 예 들은 다양한 형태들로 실시될 수 있으며 본 명세서에 설명된 실시 예들에 한정되지 않는다. 본 발명의 개념에 따른 실시 예들은 다양한 변경들을 가할 수 있고 여러 가지 형태들을 가질 수 있으므로 실시 예들을 도면에 예시하고 본 명세서에서 상세하게 설명하고자 한다. 그러나 이는 본 발명의 개념에 따른 실시 예 들을 특정한 개시 형태들에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물, 또는 대체물을 포함한다. 도 1은 본 발명의 바람직한 일 실시예에 따른 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템의 개략 적인 블록도이고, 도 2는 본 발명의 바람직한 일 실시예에 따른 민간 문화재의 보존과 유통을 위한 사이버 수장 고 시스템을 개략적으로 설명하기 위한 도면이다. 도 1 및 도 2에 도시된 바와 같이, 본 발명의 바람직한 일 실시예에 다른 민간 문화재의 보존과 유통을 위한 사 이버 수장고 시스템은, 물리적 수장고, 사이버 수장고, 제어부, 비용 책정부, 보험 연 계부 등을 포함한다. 여기서, 물리적 수장고는, 개인, 문중 및 회사를 포함하는 민간이 소유한 문화재인 민간 문화재를 위탁받 아서 실제로 관리 및 보존하는 시스템으로, 위탁 관리 및 보존되는 물리적인 장치와 IoT(사물인터넷)로 연계된 시스템을 말한다. 이 물리적 수장고에 위탁된 민간 문화재에 대해서는 3차원 영상 또는 고화질의 2차원 사진을 촬영하여 저장하는 데, 이것은 후술하는 사이버 수장고에서 본 시스템의 사용자가 해당 민간 문화재를 사이버나 디지털적으로 열람하고자 할 때나, 대여 신청을 할 때, 가상의 공간에서 구현하는데 활용된다. 상술한 바와 같이, 사이버 수장고는 물리적 수장고에 위탁된 민간 문화재의 3차원 영상 또는 고화질 의 2차원 사진을 이용하여 시스템 사용자가 민간 문화재를 열람하고, 대여 신청하는 것이 가능한 구성이다. 또한, 사이버 수장고를 통해서 개인별로 맞춤형의 수장고를 구현하는 것이 가능하다. 개인별로 다른 인터 페이스, 사이버 수장고 상의 레이아웃, 색상 등을 개인별로 커스터마이징하는 것이 가능하다. 다음으로, 제어부는 상술한 물리적 수장고 및 사이버 수장고를 연동하여 제어하고 관리하는 구 성이다. 제어부는, 민간 문화재가 물리적 수장고에 위탁되거나, 또는 물리적 수장고로부터 해당 민간 문화재가 대여되는 경우, 자동적으로 사이버 수장고가 연동하여 업데이트 되어 최신화되도록 하고, 그리고 시스템 사용자로부터 사이버 수장고에 민간 문화재의 대여 신청을 받는 경우, 물리적 수장고에서 연동하여 민간 문화재가 대여되도록 처리한다. 민간 문화재가 대여되도록 처리하는 것은, 사이버 수장고에서 대여 신청이 접수되는 경우, 해당 민간 문화 재의 대여를 위한 배송을 담당하는 복수의 미리 등록된 문화재 전문 배송 회사의 시스템에 몇 가지 조건을 포함 한 배송 의뢰의 청약을 보내고, 해당 배송 의뢰의 조건 등을 포함하여 배송 의뢰의 청약을 수락하는 문화재 전 문 배송 회사의 답신을 선착순으로 판단하여, 최종적으로 배송 계약이 디지털적으로, 온라인에서 성립되도록 한 다. 이와 같은 사이버 수장고에는, 민간 문화재의 3차원 영상 또는 고화질의 2차원 사진, 민간 문화재의 이름, 형상수치계측 정보, 소유자 정보, 특성 분석 성적서의 정보, 연대 분석 성적서의 정보, 구입 정보, 및 문화재 전문가의 감정 정보를 포함한 민간 문화재의 정보를 저장하는 민간 문화재 정보 저장부를 더 포함하는 것 이 바람직하다. 또한, 사이버 수장고에 저장된 민간 문화재마다 고유하게 객체를 식별하는데 사용되는 디지털 객체 식별자를 별 도로 부여하고, 제어부는 이와 같은 디지털 객체 식별자에 따라서 물리적 수장고 및 사이버 수장고 를 연동하여 제어하고 관리하는 것이 바람직하다. 또한, 민간 문화재를 가치 평가하는 민간 문화재 가치 평가부를 더 포함할 수 있다. 민간 문화재 가치 평 가부는, 제 1 민간 문화재 가치 평가부 내지 제 3 민간 문화재 가치 평가부를 포함할 수 있다. 제 1 민간 문화재 가치 평가부는, 민간 문화재 정보 저장부에 저장된, 민간 문화재의 3차원 영상 또는 2차 원 사진, 형상수치계측 정보, 특성 분석 성적서의 정보, 연대 분석 성적서의 정보를 기초로 하여, 실제로 거래 된 민간 문화재 가운데 가장 유사하다고 판정한 민간 문화재의 구입 정보에 기초하여, 아래의 수학식 1인 [수학식 1] 에 따라 상기 민간 문화재의 가치 평가 정보를 제시할 수 있다. 여기서, P1는 상기 민간 문화재가 열람될 때의 제 1 민간 문화재 가치 평가액이고, 상기 Psimilar는 실제로 거 래된 민간 문화재 가운데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 민간 문화재 가치 평가액 이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t1은 실제로 거래된 민간 문화 재 가운데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 거래일로부터 상기 민간 문화재가 열람될 때까지의 시간 차이를 말한다. 여기서, 실제로 거래된 민간 문화재 가운데 상기 민간 문화재와 가장 유사한 민간 문화재를 판정하는 방법은, 민간 문화재 정보 저장부에 저장된, 민간 문화재의 3차원 영상 또는 2차원 사진, 형상수치계측 정보, 특성 분석 성적서의 정보, 연대 분석 성적서의 정보를 기초로 하여, 비교하는 민간 문화재간 정보의 차이값에 가중치 를 곱한 값들을, 모두 더한 값이 가장 적은 값인 민간 문화재를 가장 유사한 민간 문화재로 판단하는 것이다. 가중치를 설정하는 방법은 인공지능을 통해서, 설정한다. 즉, 이미 가장 유사한 민간 문화재가 무엇인지를 알고 있는 데이터 집합을 이용하여 기계학습을 통하여 가중치를 설정한다. 가중치 초기값을 설정하고, 가중치를 변경 해 가면서, 최적의 가중치 설정값을 찾아간다. 또한, 제 2 민간 문화재 가치 평가부는 민간 문화재 정보 저장부에 저장된, 상기 구입 정보에 기초하여, 아래의 수학식 2인 [수학식 2] 에 따라 상기 민간 문화재의 가치 평가 정보를 제시할 수 있다. 여기서, P2는 상기 민간 문화재가 열람될 때의 제 2 민간 문화재 가치 평가액이고, 상기 P0는 상기 민간 문화재 가 구입될 때의 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증 가율이고, t2는 상기 민간 문화재가 구입될 때부터 상기 민간 문화재가 열람될 때까지의 시간 차이를 말한다. 또한, 제 3 민간 문화재 가치 평가부는, 민간 문화재 정보 저장부에 저장된, 상기 전문가 감정 정보에 따라 아 래의 수학식 3인[수학식 3] 에 따라 상기 민간 문화재의 가치 평가 정보를 제시할 수 있다. 여기서, P3은 상기 민간 문화재가 열람될 때의 제 3 민간 문화재 가치 평가액이고, 상기 Pappraise는 상기 민간 문화재의 전문가 감정 정보에 따른 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화 재의 연평균 가치 증가율이고, t3는 상기 민간 문화재가 전문가 감정을 받은 때부터 상기 민간 문화재가 열람될 때까지의 시간 차이를 말한다. 한편, 민간 문화재의 보존 상태를 반영한 민간 문화재 가치 평가를 하는 것도 가능하다. 다시 말해, 민간 문화 재가 상기 물리적 수장고에 입고되면서 촬영한 제 1 영상을 인공지능으로 원 상태 복원한 제 2 영상과 비교하여, 보존 상태를 분류하고, 보존 상태 점수(PR, 0≤PR≤1)를 부여하고, 이를 상술한 가치평가 금액에 곱 하는 것이 가능하다. 여기서 보존 상태 점수를 비교할 때, 인공지능으로 원 상태, 즉 원래 제작 시점의 상태로 복원한 제 2 영상과 제 1 영상 간의 객체 식별시 테두리 부분이 영상에서 떨어져 나간 비율을 보존 상태 점수로 계산하는 것이 가능 하다. 또는 복원한 3차원의 제 2 영상과 3차원의 제 1 영상 간의 객체 식별에서 떨어져 나간 부피(체적)의 비율 로 보존 상태 점수를 계산하는 것도 가능하다. 또는 서예 작품에서 글자, 통상 한자의 복원한 2차원의 제 2 영 상과 2차원 제 1 영상 간의 객체 식별시 글자를 구성하는 2차원적인 면적의 탈락 비율을 보존 상태 점수로 계산 하는 것도 가능하다. 상술했던 수학식 1은 다음의 수학식 4로, 수학식 2는 수학식 5로, 수학식 3은 수학식 6으로 변경된다. [수학식 4]"}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(P1는 상기 민간 문화재가 열람될 때의 제 1 민간 문화재 가치 평가액이고, 상기 Psimilar는 실제로 거래된 민 간 문화재 가운데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 민간 문화재 가치 평가액이고, W 는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이고, t1은 실제로 거래된 민간 문화재 가운 데 상기 민간 문화재와 가장 유사하다고 판정한 민간 문화재의 거래일로부터 상기 민간 문화재가 열람될 때까지 의 시간 차이) [수학식 5]"}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "(P2는 상기 민간 문화재가 열람될 때의 제 2 민간 문화재 가치 평가액이고, 상기 P0는 상기 민간 문화재가 구입 될 때의 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연평균 가치 증가율이 고, t2는 상기 민간 문화재가 구입될 때부터 상기 민간 문화재가 열람될 때까지의 시간 차이) [수학식 6]"}
{"patent_id": "10-2022-0053277", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "(P3은 상기 민간 문화재가 열람될 때의 제 3 민간 문화재 가치 평가액이고, 상기 Pappraise는 상기 민간 문화재 의 전문가 감정 정보에 따른 민간 문화재 가치 평가액이고, W는 상기 사이버 수장고 시스템의 민간 문화재의 연 평균 가치 증가율이고, t3는 상기 민간 문화재가 전문가 감정을 받은 때부터 상기 민간 문화재가 열람될 때까지 의 시간 차이) 한편, 본 시스템의 사이버 수장고를 통해서, 온라인 전시회를 제공하는 온라인 전시회 제공부 및/또 는 사이버 수장고를 통해서, 온라인 경매를 제공하는 온라인 경매 제공부를 더 포함할 수 있다. 현장이나 현실적으로 전시회를 하거나 경매를 할 경우, 고가의 파손이나 가치의 훼손 우려가 있는 민간 문화재 를 실제로 전시할 필요가 있는데, 본 발명과 같이 온라인 전시회를 제공하거나 온라인 경매로 진행할 경우 고가 의 민간 문화재의 파손이나 가치의 훼손 우려를 없애는 것이 가능하다. 이를 통해서, 좀 더 활발한 민간 문화재 의 유통이 이루어지는 것을 기대할 수 있다. 여기서, 온라인 경매 제공부는, 초기 경매 시작 가격으로, 상술한 바 있는, 제 1 민간 문화재 가치 평가부, 제 2 민간 문화재 가치 평가부, 및 제 3 민간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보를 모두 제시하는 것이 가능하다. 한편, 민간 문화재의 위탁 관리 및 보존의 비용을 책정하는 비용 책정부를 더 포함할 수 있다. 이 비용 책 정부는, 상술한 제 1 민간 문화재 가치 평가부, 제 2 민간 문화재 가치 평가부, 및 제 3 민간 문화재 가치 평가부에서 이용 가능한 민간 문화재 가치 평가 정보에 따라, 민간 문화재의 위탁 관리 및 보존의 비용을 차등 하여 책정하는 것이 가능하다. 또한, 민간 문화재에 대한 보험을, 보험사 시스템과 연계하는 보험 연계부를 더 포함하고, 이 보험 연계부 도, 상술한 제 1 민간 문화재 가치 평가부, 제 2 민간 문화재 가치 평가부, 및 제 3 민간 문화재 가치 평 가부에서 이용 가능한 민간 문화재 가치 평가 정보에 따라, 민간 문화재의 보험비를 차등적으로 책정하는 것이 가능하다. 즉, 보험 연계부는, 테러, 지진, 습기, 화재 등 다양한 보이지 않는 훼손 위험에 대해서 평가를 하여야 하 는데, 이와 같은 위험을 판단하면서 가장 기본이 되는 것은 문화재의 가치 평가액이라고 할 수 있다. 한편, 보험 연계부는, 물리적 수장고에 입고하면서 형상치수계측 분석(크기, 종류, 재질 정보 데이터 등 분석)을 진행하고, 촬영한 영상을 인공지능으로 원 상태 복원한 것과 비교하여, 보존 상태를 분류한다. 보존 상 태 분류에 따라서, 상술한 문화재의 가치 평가액에 비율로 곱하는 것이 가능하다. 예를 들어, 상술한 문화재의 가치 평가액이 10억이라고 할 때, 보존 상태 분류에 따라서, 상중하 등급에서 하 등급을 받은 경우, 하 등급에 배정된 0.3을 곱하여 3억으로 평가하는 것도 가능하며, 상중하 등급에서 상 등급 을 받은 경우 상 등급에 배정된 1.0을 곱하여 10억 그대로 평가하는 것이 가능하다. 이상 본 발명은 바람직한 일실시 예를 통하여 설명하였는데, 상술한 실시 예는 본 발명의 기술적 사상을 예시적 으로 설명한 것에 불과하며, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양한 변화가 가능함은 이 분야에서 통상의 지식을 가진 자라면 이해할 수 있을 것이다. 따라서 본 발명은 보호범위는 특정 실시예가 아니 라 특허 청구 범위에 기재된 사항에 의해 해석되어야 하며, 그와 도응한 범위 내에 있는 모든 기술적 사상도 본 발명의 권리범위에 포함되는 것으로 해석 되어야 될 것이다."}
{"patent_id": "10-2022-0053277", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 다음의 도면들은 본 발명의 바람직한 일실시예를 예시하는 것이며, 발명의 상세한 설명과 함께 본 발명의 기술적 사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재된 사항에 만 한정되어 해석되어서는 아니 된다. 도 1은 본 발명의 바람직한 일 실시예에 따른 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템의 개략 적인 블록도이다. 도 2는 본 발명의 바람직한 일 실시예에 따른 민간 문화재의 보존과 유통을 위한 사이버 수장고 시스템을 개략 적으로 설명하기 위한 도면이다."}
