{"patent_id": "10-2020-0134057", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0050405", "출원번호": "10-2020-0134057", "발명의 명칭": "태양광 발전소 모니터링 시스템", "출원인": "석수민", "발명자": "석수민"}}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "태양광 발전소에 설치되어 태양광 발전 장치에 의해 발전된 직류 전기를 교류 전기로 변환하는 인버터와 전기적으로 접속되며, 데이터 수집장치로서 상기 태양광 발전소 및 인버터에 대한 상태 정보와 상기 태양광 발전소의발전량 데이터를 수집하여 저장 및 외부로 무선 전송하는 RTU(Remote Terminal Unit); 및상기 RTU와 무선통신하며, 상기 RTU로부터 무선 전송된 상태 정보와 발전량데이터를 무선 수신하고, 수신한 상태 정보와 발전량 데이터를 분석하여 정전, 기기의 고장, 산사태, 화재를 포함하는 다양한 문제 상황 발생을 진단하며, 각종 정보 및 데이터를 고객에게 제공하는 모니터링 서버를 포함하는 태양광 발전소 모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 RTU는,태양광 발전 시설물과의 통신을 수행하며, 상기 태양광 발전소의 발전량 데이터와 정전, 인버터 고장, 각종 센서 고장을 포함한 태양광 발전 장치 요소들의 상태 정보를 수집하는 데이터 수집부로서의 역할을 수행하는 내부통신부와;상기 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 상기 모니터링 서버로 무선 전송하는 데이터 전송부로서의 역할을 수행하는 서버 통신부; 및상기 내부 통신부와 서버 통신부를 포함한 RTU의 모든 구성요소들의 상태 점검 및 동작을 제어하는 제어부를 포함하여 구성된 태양광 발전소 모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 RTU는,상기 내부 통신부에 의해 수집된 발전량 데이터와 정전, 인버터 고장, 각종 센서 고장을 포함한 태양광 발전 장치 요소들의 상태 정보를 저장하는 메모리와;상기 태양광 발전소 측에 이벤트(event) 발생시 상기 메모리에 저장되어 있는 태양광 발전소의 발전량 데이터및 태양광 발전 장치 요소들의 상태 정보를 바탕으로 이벤트를 분석하는 이벤트 분석부; 및상기 이벤트 분석부에 의해 분석된 이벤트의 유형에 따라 대응하는 처리를 수행하는 이벤트 처리부를 더 포함하는 태양광 발전소 모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 RTU의 내부 통신부는 RS485 통신, 이더넷(Ethernet) 통신, 와이파이(Wifi) 통신 방식 중 적어도 하나를 이용하여 태양광 발전소의 인버터나 발전소 현장에 설치된 환경센서와 화재감지 센서로부터의 신호를 수신하도록구성된 태양광 발전소 모니터링 시스템.공개특허 10-2022-0050405-3-청구항 5 제2항에 있어서,상기 RTU의 서버 통신부는 LTE 통신, LoRa 통신, WCDMA 통신 방식 중 적어도 하나를 이용하여 상기 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 상기 모니터링 서버로 무선 전송하도록 구성된태양광 발전소 모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 RTU는, 상기 내부 통신부, 서버 통신부 및 제어부를 내장하는 것으로 장치의 주요 몸체를 이루는 주몸체부와; 주몸체부의 일측에 설치되며, 상기 모니터링 서버와 통신을 위한 모뎀용 통신 안테나와; 모뎀의 상태를 서로 다른 색상으로 표시하는 모뎀 상태 표시부와; 상기 모니터링 서버로의 데이터 전송을 위한 데이터 전송 스위치와; RTU 장비의 개발이나 유지보수를 위한 디버그(Debug) 포트와; 펌웨어를 업데이트하기 위한 ISP 포트와; RTU를 재시작하기 위한 리셋 스위치와; RTU에 전원을 공급하는 어댑터의 접속을 위한 전원 접속 단자와; 상기 태양광 발전소의 인버터와의 통신을 위한 인버터 연결 포트; 및 전원 어댑터 연결, 배터리 충전, 모니터링 서버와의 통신, 인버터와의 데이터 송수신 및 통신과 같은 RTU의 여러 상태를 표시하는 상태 표시부를 포함하여 구성된 태양광 발전소 모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 RTU의 주몸체부에는 인버터의 온도를 감지하기 위한 온도 센서 및 태양광 발전소의 정전 상태를 감지하기위한 정전 센서가 더 내장된 태양광 발전소 모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 모니터링 서버는,상기 RTU의 서버 통신부에 의해 전송된 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보와, 발전소 현장에 설치된 카메라에 의해 촬영된 영상 정보와, 외부로부터의 날씨 및 기상정보와 발전금액 정보를 수신하는 데이터/정보 수집부와;상기 데이터/정보 수집부에 의해 수집된 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보와, 발전소 현장에 설치된 카메라에 의해 촬영된 영상 정보와, 외부로부터의 날씨 및 기상정보와 발전금액 정보를 포함한 각종 정보와 데이터를 바탕으로 빅데이터를 생성하는 빅데이터 생성부; 및상기 빅데이터 생성부에 의해 생성된 빅데이터에 기초하여 데이터를 분석하고, 기설정된 작업자 정보를 바탕으로 하여 가장 가까이에 있되, 문제가 있다고 판단된 인버터 분야를 해결할 수 있는 작업자를 매칭시켜주며, 상기 문제가 있는 인버터가 위치된 안내지도(전자지도)를 생성하여 작업자 스마트폰으로 제공하고, 작업자가 안내지도(전자지도) 상의 목적지에 도달하기 위한 최적 경로를 안내하는 인공지능부를 포함하여 구성된 태양광 발전공개특허 10-2022-0050405-4-소 모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 모니터링 서버는,상기 데이터/정보 수집부를 통해 수신한 상기 태양광 발전 장치 요소들의 상태 정보를 분석하여 정전, 기기의고장, 산사태, 화재를 포함하는 이벤트 상황을 예측하고, 이벤트 상황이 발생했을 때 상응하는 특정 신호를 출력하는 이벤트 예측/감지부; 및상기 이벤트 예측/감지부로부터의 특정 신호를 수신하고 알람을 발생하는 알람부를 더 포함하는 태양광 발전소모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 모니터링 서버의 데이터/정보 수집부는, 상기 RTU로부터 전송된 상기 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 수집하는 발전정보 수집부와; 발전소 현장에 설치된 카메라에 의해 촬영된 영상 정보를 수집하는 영상 수집부; 및 외부로부터의 날씨 및 기상정보와 발전금액 정보를 포함한 발전과 관련된 정보를 수집하는 관련정보 수집부를포함하여 구성된 태양광 발전소 모니터링 시스템."}
{"patent_id": "10-2020-0134057", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 태양광 발전소 모니터링 시스템에 관한 것이다. 본 발명에 따른 태양광 발전소 모니터링 시스템은, 태양광 발전소에 설치되어 태양광 발전 장치에 의해 발전된 직류 전기를 교류 전기로 변환하는 인버터와 전기적으로 접속되며, 데이터 수집장치로서 상기 태양광 발전소 및 (뒷면에 계속)"}
{"patent_id": "10-2020-0134057", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 태양광 발전소 모니터링 시스템에 관한 것으로서, 더 상세하게는 태양광 발전소 운용과 관련하여 설 정된 데이터 및 RTU(Remote Terminal Unit)의 상태를 원격으로 확인하여 이벤트(event) 발생을 예측 및 감지하 여 적절히 대처할 수 있는 태양광 발전소 모니터링 시스템에 관한 것이다."}
{"patent_id": "10-2020-0134057", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "태양광 발전(Photovoltaic Power Generation)은 태양광을 직류 전기로 바꾸어 전력을 생산하는 발전 방법으로서, 복수의 태양 전지들이 붙어 있는 태양광 패널을 대규모로 설치하여 태양광 에너지를 이용하여 전기 를 생산하게 된다. 재생 가능 에너지에 대한 수요가 증가함에 따라, 태양전지와 태양전지 어레이의 생산도 크게 늘어나고 있는 추 세이며, 현재는 계통 연계형으로 태양광 발전 시스템을 구축하고 있는 실정이다. 나아가서 태양광 전기에 대한 특혜적인 기준가격 의무 구매제와 요금상계제 같은 재정적인 장려 정책을 호주, 독일, 이스라엘, 일본 및 미국을 포함한 많은 나라에서 지원함으로써 태양광 발전 설비의 설치를 확대하고 있다. 태양광 발전은, 반영구적으로 활용할 수 있고, 태양 전지를 사용해서 유지 보수가 간편하며, 무공해ㆍ무진장의 태양 에너지원을 사용하는 점 등에서 미래의 대체 에너지원으로 각광받고 있다. 다만, 대용량의 태양광 전기를 생산하기 위해서는 넓은 지역에 많은 수의 태양광 패널이 설치되어야 하는데, 태 양광 패널에 대한 세부적인 모니터링 없이는 태양광 발전이 적합한 성능으로 작동하고 있는지 또는 문제 발생으 로 태양광 발전의 효율성이 떨어지고 있는지 등을 파악할 수 없다. 이에 따라, 태양광 발전 시스템의 효율적인 운영을 보장하기 위해 태양광 발전 설비들에 대한 효율적인 모니터 링이 대두되고 있다. 한편, 한국 공개특허공보 제10-2014-0137991호(특허문헌 1)에는 \"태양광 발전 모니터링 방법 및 모니터링 시스 템\"이 개시되어 있는바, 이에 따른 모니터링 시스템은, 태양광 발전소와 각각 연결된 복수개의 RTU(Remote Terminal Unit) 및 하나의 감시 서버를 포함하는 모니터링 시스템에 있어서, 상기 RTU는, 상기 태양광 발전소로 부터 검침 데이터를 수신받는 제1 통신부; 상기 검침 데이터를 기초로 하여 원격 데이터를 생성하는 모니터링부; 및 상기 생성된 원격 데이터를 상기 감시 서버로 전송하는 제2 통신부를 포함하고, 상기 감시 서버 는, 상기 전송된 원격 데이터를 검증하는 검증부; 및 상기 검증부의 검증결과에 기초한 RTU 제어값을 각각의 RTU로 전송하는 RTU 제어부를 포함하는 것을 특징으로 한다. 이상과 같은 특허문헌 1의 경우, 무선통신을 이용한 복수개의 태양광 발전소의 모니터링이 가능하게 됨에 따라, 여러 환경상의 문제점들로부터 영향없이 모니터링 정보 전송장비를 효율적으로 운영할 수 있는 장점이 있기는 하나, RTU와 관련된 에러에 대하여 별도로 분석하는 수단이 없어 RTU와 관련된 에러가 무엇인지 파악하기 어려 운 문제점을 내포하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 제10-2014-0137991호(2014.12.03. 공개)"}
{"patent_id": "10-2020-0134057", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 문제점을 개선하기 위하여 창출된 것으로서, RTU와 인버터 간의 통신 데이 터 패킷을 분석하여 메모리에 저장 및 서버로 전송하고, 추후에 메모리 내의 정보를 분석하여 RTU와 관련된 에 러가 무엇인지 파악함으로써, RTU와 관련된 유사한 에러 발생을 미리 예측하여 대처할 수 있는 태양광 발전소 모니터링 시스템을 제공함에 그 목적이 있다."}
{"patent_id": "10-2020-0134057", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위하여 본 발명에 따른 태양광 발전소 모니터링 시스템은, 태양광 발전소에 설치되어 태양광 발전 장치에 의해 발전된 직류 전기를 교류 전기로 변환하는 인버터와 전기적 으로 접속되며, 데이터 수집장치로서 상기 태양광 발전소 및 인버터에 대한 상태 정보와 상기 태양광 발전소의 발전량 데이터를 수집하여 저장 및 외부로 무선 전송하는 RTU(Remote Terminal Unit); 및 상기 RTU와 무선통신하며, 상기 RTU로부터 무선 전송된 상태 정보와 발전량데이터를 무선 수신하고, 수신한 상 태 정보와 발전량 데이터를 분석하여 정전, 기기의 고장, 산사태, 화재를 포함하는 다양한 문제 상황 발생을 진 단하며, 각종 정보 및 데이터를 고객에게 제공하는 모니터링 서버를 포함하는 점에 그 특징이 있다. 여기서, 상기 RTU는, 태양광 발전 시설물과의 통신을 수행하며, 상기 태양광 발전소의 발전량 데이터와 정전, 인버터 고장, 각종 센 서 고장을 포함한 태양광 발전 장치 요소들의 상태 정보를 수집하는 데이터 수집부로서의 역할을 수행하는 내부 통신부와; 상기 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 상기 모니터링 서버로 무선 전 송하는 데이터 전송부로서의 역할을 수행하는 서버 통신부; 및 상기 내부 통신부와 서버 통신부를 포함한 RTU의 모든 구성요소들의 상태 점검 및 동작을 제어하는 제어부를 포 함하여 구성될 수 있다. 여기서, 바람직하게는 상기 RTU는, 상기 내부 통신부에 의해 수집된 발전량 데이터와 정전, 인버터 고장, 각종 센서 고장을 포함한 태양광 발전 장 치 요소들의 상태 정보를 저장하는 메모리와; 상기 태양광 발전소 측에 이벤트(event) 발생시 상기 메모리에 저장되어 있는 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 바탕으로 이벤트를 분석하는 이벤트 분석부; 및 상기 이벤트 분석부에 의해 분석된 이벤트의 유형에 따라 대응하는 처리를 수행하는 이벤트 처리부를 더 포함할 수 있다. 또한, 상기 RTU의 내부 통신부는 RS485 통신, 이더넷(Ethernet) 통신, 와이파이(Wifi) 통신 방식 중 적어도 하 나를 이용하여 태양광 발전소의 인버터나 발전소 현장에 설치된 환경센서와 화재감지 센서로부터의 신호를 수신 하도록 구성될 수 있다. 또한, 상기 RTU의 서버 통신부는 LTE 통신, LoRa 통신, WCDMA 통신 방식 중 적어도 하나를 이용하여 상기 태양 광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 상기 모니터링 서버로 무선 전송하도록 구성될 수 있다. 또한, 상기 RTU는, 상기 내부 통신부, 서버 통신부 및 제어부를 내장하는 것으로 장치의 주요 몸체를 이루는 주 몸체부와; 주몸체부의 일측에 설치되며, 상기 모니터링 서버와 통신을 위한 모뎀용 통신 안테나와; 모뎀의 상태 를 서로 다른 색상으로 표시하는 모뎀 상태 표시부와; 상기 모니터링 서버로의 데이터 전송을 위한 데이터 전송 스위치와; RTU 장비의 개발이나 유지보수를 위한 디버그(Debug) 포트와; 펌웨어를 업데이트하기 위한 ISP 포트 와; RTU를 재시작하기 위한 리셋 스위치와; RTU에 전원을 공급하는 어댑터의 접속을 위한 전원 접속 단자와; 상 기 태양광 발전소의 인버터와의 통신을 위한 인버터 연결 포트; 및 전원 어댑터 연결, 배터리 충전, 모니터링 서버와의 통신, 인버터와의 데이터 송수신 및 통신과 같은 RTU의 여러 상태를 표시하는 상태 표시부를 포함하여 구성될 수 있다. 여기서, 바람직하게는 상기 RTU의 주몸체부에는 인버터의 온도를 감지하기 위한 온도 센서 및 태양광 발전소의 정전 상태를 감지하기 위한 정전 센서가 더 내장될 수 있다. 또한, 상기 모니터링 서버는, 상기 RTU의 서버 통신부에 의해 전송된 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정 보와, 발전소 현장에 설치된 카메라에 의해 촬영된 영상 정보와, 외부로부터의 날씨 및 기상정보와 발전금액 정 보를 수신하는 데이터/정보 수집부와; 상기 데이터/정보 수집부에 의해 수집된 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정 보와, 발전소 현장에 설치된 카메라에 의해 촬영된 영상 정보와, 외부로부터의 날씨 및 기상정보와 발전금액 정 보를 포함한 각종 정보와 데이터를 바탕으로 빅데이터를 생성하는 빅데이터 생성부; 및 상기 빅데이터 생성부에 의해 생성된 빅데이터에 기초하여 데이터를 분석하고, 기설정된 작업자 정보를 바탕으 로 하여 가장 가까이에 있되, 문제가 있다고 판단된 인버터 분야를 해결할 수 있는 작업자, 즉 작업자 스마트폰 을 검색하여 작업자를 매칭시켜주며, 상기 문제가 있는 인버터가 위치된 안내지도(전자지도)를 생성하여 작업자 스마트폰으로 제공하고, 작업자가 안내지도(전자지도) 상의 목적지에 도달하기 위한 최적 경로를 안내하는 인공 지능부를 포함하여 구성될 수 있다. 여기서, 바람직하게는 상기 모니터링 서버는, 상기 데이터/정보 수집부를 통해 수신한 상기 태양광 발전 장치 요소들의 상태 정보를 분석하여 정전, 기기의 고장, 산사태, 화재를 포함하는 이벤트 상황을 예측하고, 이벤트 상황이 발생했을 때 상응하는 특정 신호를 출 력하는 이벤트 예측/감지부; 및 상기 이벤트 예측/감지부로부터의 특정 신호를 수신하고 알람을 발생하는 알람부를 더 포함할 수 있다. 또한, 상기 모니터링 서버의 데이터/정보 수집부는, 상기 RTU로부터 전송된 상기 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 수집하 는 발전정보 수집부와; 발전소 현장에 설치된 카메라에 의해 촬영된 영상 정보를 수집하는 영상 수집부; 및 외부로부터의 날씨 및 기상정보와 발전금액 정보를 포함한 발전과 관련된 정보를 수집하는 관련정보 수집부를 포함하여 구성될 수 있다."}
{"patent_id": "10-2020-0134057", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같은 본 발명에 의하면, RTU와 인버터 간의 통신 데이터 패킷을 분석하여 메모리에 저장 및 서버로 전송하 고, 추후에 메모리 내의 정보를 분석하여 RTU와 관련된 에러가 무엇인지 파악함으로써, RTU와 관련된 유사한 에 러 발생을 미리 예측하여 대처할 수 있는 장점이 있다. 또한, 태양광 발전소 운용과 관련하여 설정된 데이터 및 RTU의 상태를 원격으로 확인할 수 있어 현장에 투여되 는 인력 및 시간을 절감할 수 있는 장점이 있다. 또한, RTU가 건물이나 함체 내부에서도 높은 통신 감도를 유지할 수 있어 태양광 발전 관련 정보 및 데이터를 원활하게 수집할 수 있으며, RTU가 서버와 무선으로 통신함으로써 별도의 인터넷 회선이 필요없어 통신비용을 절감할 수 있는 장점이 있다."}
{"patent_id": "10-2020-0134057", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정되어 해석되지 말아야 하며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원 칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, 명세서에 기 재된 \"…부\", \"…기\", \"모듈\", \"장치\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 이하 첨부된 도면을 참조하여 본 발명의 실시예를 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 태양광 발전소 모니터링 시스템의 전체 구성을 개략적으로 나타낸 도면이다. 도 1을 참조하면, 본 발명에 따른 태양광 발전소 모니터링 시스템은 RTU(Remote Terminal Unit); 및 모니터링 서버를 포함하여 구성된다. RTU(Remote Terminal Unit)는 태양광 발전소에 설치되어 태양광 발전 장치에 의해 발전된 직류 전기를 교 류 전기로 변환하는 인버터와 전기적으로 접속되며, 데이터 수집장치로서 상기 태양광 발전소 및 인버터에 대한 상태 정보와 상기 태양광 발전소의 발전량 데이터를 수집하여 저장 및 외부로(여기서는 모니터링 서버로) 무선 전송한다. 모니터링 서버는 상기 RTU와 무선통신하며, RTU로부터 무선 전송된 상태 정보와 발전량데이터를 무선 수신하고, 수신한 상태 정보와 발전량 데이터를 분석하여 정전, 기기의 고장, 산사태, 화재를 포함하는 다 양한 문제 상황 발생을 진단하며, 각종 정보 및 데이터를 고객(예를 들면, 사업주, 시공사, 안전관리자 등)에게 제공한다. 여기서, 이와 같은 모니터링 서버는 일반적인 컴퓨터 시스템으로 구성될 수 있다. 또한, 상기 RTU는, 도 2에 도시된 바와 같이, 태양광 발전 시설물 (도 1 참조)과의 통신을 수행하며, 상기 태양광 발전소의 발전량 데이터와 정전, 인버터 고장, 각종 센서 고장을 포함한 태양광 발전 장치 요소들 의 상태 정보를 수집하는 데이터 수집부로서의 역할을 수행하는 내부 통신부와; 상기 태양광 발전소의 발 전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 상기 모니터링 서버(도 1 참조)로 무선 전송하는데이터 전송부로서의 역할을 수행하는 서버 통신부; 및 상기 내부 통신부와 서버 통신부를 포함 한 RTU의 모든 구성요소들의 상태 점검 및 동작을 제어하는 제어부를 포함하여 구성될 수 있다. 여기서, 바람직하게는 이상과 같은 RTU는, 상기 내부 통신부에 의해 수집된 발전량 데이터와 정전, 인버터 고장, 각종 센서 고장을 포함한 태양광 발전 장치 요소들의 상태 정보를 저장하는 메모리와; 상기 태양광 발전소 측에 이벤트(event) 발생 시 상기 메모리에 저장되어 있는 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 바탕으로 이벤트를 분석하는 이벤트 분석부; 및 이벤트 분석부 에 의해 분석된 이벤트의 유형(예를 들면, 태양광 발전소의 정전)에 따라 대응하는 처리(예를 들면, 외부 시스템과 연결을 차단하기 위해 차단 스위치를 내림)를 수행하는 이벤트 처리부를 더 포함할 수 있다. 또한, 상기 RTU의 내부 통신부는 RS485 통신, 이더넷 (Ethernet) 통신, 와이파이(Wifi) 통신 방식 중 적어도 하나를 이용하여 태양광 발전소의 인버터나 발전소 현장에 설치된 환경센서와 화재감 지 센서로부터의 신호를 수신하도록 구성될 수 있다. 또한, 상기 RTU의 서버 통신부는 LTE 통신, LoRa 통신, WCDMA 통신 방식 중 적어도 하나를 이용하여 상기 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 상기 모니터 링 서버로 무선 전송하도록 구성될 수 있다. 또한, 상기 RTU는, 도 3에 도시된 바와 같이, 상기 내부 통신부, 서버 통신부 및 제어부를 몸체의 내부에 내장하는 것으로 장치의 주요 몸체를 이루는 주몸체부(110m)와; 주몸체부(110m)의 일측에 설치되 며, 상기 모니터링 서버와 통신을 위한 모뎀용 통신 안테나와; 모뎀의 상태를 서로 다른 색상으로 표 시(예를 들면, 전원이 인가되면 적색 LED가 점등되고, 기지국과 연결되면 녹색 LED도 점등됨)하는 모뎀 상태 표 시부와; 상기 모니터링 서버로의 데이터 전송을 위한 데이터 전송 스위치와; RTU 장비의 개발이 나 유지보수를 위한 디버그(Debug) 포트와; 펌웨어를 업데이트하기 위한 ISP 포트와; RTU를 재 시작하기 위한 리셋 스위치와; RTU에 전원을 공급하는 어댑터의 접속을 위한 전원 접속 단자와; 상기 태양광 발전소의 인버터와의 통신을 위한 인버터 연결 포트; 및 전원 어댑터 연결, 배터리 충전, 모 니터링 서버와의 통신, 인버터와의 데이터 송수신 및 통신과 같은 RTU의 여러 상태를 표시하는 상태 표시 부를 포함하여 구성될 수 있다. 여기서, 상기 데이터 전송 스위치는 통신 모뎀이 기지국과 연결된 상 태에서 버튼을 누르면 모니터링 서버로 데이터를 전송하되, 전원 인가 후 30초 후에 데이터를 전송하며, 그 이후로는 10분 간격으로 데이터를 전송한다. 또한, 상기 상태 표시부는 다양한 색상의 LED로 구성될 수 있으며, 다음의 표 1과 같이 각 색상별로 점등 됨으로써 주어진 의미를 표시할 수 있다. 표 1 명 칭 설 명 PWR (녹색) 전원 어댑터 연결 시 켜짐 BAT (적색) Battery 충전 상태로 충전 중일 경우 켜짐 BAT (녹색) Battery 충전 상태로 충전이 완료되었을 경우 켜짐 SVR (적색) 서버와 통신에 문제가 생겼을 경우 켜짐 TX (적색) 인버터로 데이터를 보낼 때 켜짐 RX (황색) 인버터로부터 데이터를 받을 때 켜짐 ERR (적색) 인버터와 통신 등 RTU에 문제가 생겼을 경우 켜짐 여기서, 또한 바람직하게는 상기 RTU의 주몸체부(110m)에는 인버터의 온도를 감지하기 위한 온도 센서 및 태양광 발전소의 정전 상태를 감지하기 위한 정전 센서가 더 내장될 수 있다. 또한, 상기 모니터링 서버는, 도 4에 도시된 바와 같이, 상기 RTU의 서버 통신부에 의해 전송된 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상태 정보와, 발전소 현장에 설치된 카메라에 의 해 촬영된 영상 정보와, 외부로부터의 날씨 및 기상정보와 발전금액 정보를 수신하는 데이터/정보 수집부 와; 데이터/정보 수집부에 의해 수집된 태양광 발전소의 발전량 데이터 및 태양광 발전 장치 요소들의 상 태 정보와, 발전소 현장에 설치된 카메라에 의해 촬영된 영상 정보와, 외부로부터의 날씨 및 기상정보와 발전금 액 정보를 포함한 각종 정보와 데이터를 바탕으로 빅데이터를 생성하는 빅데이터 생성부 ; 및 상기 빅데이 터 생성부에 의해 생성된 빅데이터에 기초하여 데이터를 분석하고, 기설정된 작업자 정보를 바탕으로 하여 가장 가까이에 있되, 문제가 있다고 판단된 인버터 분야를 해결할 수 있는 작업자, 즉 작업자 스마트폰을 검색하여 작업자를 매칭시켜주며, 상기 문제가 있는 인버터가 위치된 안내지도(전자지도)를 생성하여 작업자 스마트 폰으로 제공하고, 작업자가 안내지도(전자지도) 상의 목적지에 도달하기 위한 최적 경로를 안내하는 인공지능부 를 포함하여 구성될 수 있다. 여기서, 바람직하게는 상기 모니터링 서버는, 상기 데이터/정보 수집부를 통해 수신한 상기 태양광 발전 장치 요소들의 상태 정보를 분석하여 정전, 기기의 고장, 산사태, 화재를 포함하는 이벤트 상황을 예측하 고, 이벤트 상황이 발생했을 때 상응하는 특정 신호(예를 들면, 특정 전류나 주파수 신호, 적외선 신호 또는 음 파 신호 등)를 출력하는 이벤트 예측/감지부; 및 이벤트 예측/감지부로부터의 특정 신호를 수신하고 알람을 발생하는 알람부를 더 포함할 수 있다. 또한, 상기 모니터링 서버의 데이터/정보 수집부는, 상기 RTU로부터 전송된 상기 태양광 발전소의 발 전량 데이터 및 태양광 발전 장치 요소들의 상태 정보를 수집하는 발전정보 수집부(121a)와; 발전소 현장에 설 치된 카메라에 의해 촬영된 영상 정보를 수집하는 영상 수집부(121b); 및 외부로부터의 날씨 및 기상정보와 발 전금액 정보를 포함한 발전과 관련된 정보를 수집하는 관련정보 수집부(121c)를 포함하여 구성될 수 있다. 이상과 같은 구성을 가지는 본 발명에 따른 태양광 발전소 모니터링 시스템은 태양광 발전소에 설치되어 태양광 발전 장치에 의해 발전된 직류 전기를 교류 전기로 변환하는 인버터와 전기적으로 접속된 RTU가 상 기 태양광 발전소 및 인버터에 대한 상태 정보와 상기 태양광 발전소의 발전량 데이터를 수집하여 메모리 에 저장하는 한편 모니터링 서버로 무선 전송한다. 이때, RTU의 제어부는 RTU와 인버터 간 의 통신 데이터 패킷을 분석하여 메모리 에 저장하고, 서버 통신부를 통해 모니터링 서버로 전 송한다. 그러면, 모니터링 서버는 상기 RTU로부터 무선 전송된 상태 정보와 발전량데이터, 그리고 RTU와 인버터 간의 통신 데이터 패킷 분석 정보를 무선 수신하고, 수신한 상태 정보와 데이터 패킷 분석 정보를 분석 하여 정전, 기기의 고장, 산사태, 화재를 포함하는 다양한 문제 상황 발생을 진단하며, 각종 정보 및 데이터를 고객(사업주, 시공사, 안전관리자)에게 제공한다. 이상과 같은 일련의 과정에서 모니터링 서버의 인공지능부는 빅데이터 생성부에 의해 생성된 빅 데이터에 기초하여 데이터를 분석하고, 기설정된 작업자 정보를 바탕으로 하여 가장 가까이에 있되, 문제가 있 다고 판단된 인버터 분야를 해결할 수 있는 작업자, 즉 작업자 스마트폰을 검색하여 작업자를 매칭시켜주며, 상 기 문제가 있는 인버터가 위치된 안내지도(전자지도)를 생성하여 작업자 스마트폰으로 제공하고, 작업자가 안내 지도(전자지도) 상의 목적지에 도달하기 위한 최적 경로를 안내하게 된다. 또한, 모니터링 서버의 이벤트 예측/감지부는 상기 데이터/정보 수집부를 통해 수신한 태양광 발전 장치 요소들의 상태 정보를 분석 하여 정전, 기기의 고장, 산사태, 화재를 포함하는 이벤트 상황을 예측하고, 이벤트 상황이 발생했을 때 상응하 는 특정 신호(예를 들면, 특정 전류나 주파수 신호, 적외선 신호 또는 음파 신호 등)를 출력하고, 알람부 는이벤트 예측/감지부로부터의 특정 신호를 수신하고 알람을 발생한다. 이에 따라 시스템 관리자 또는 운 용자는 상황을 파악하고 적절한 조치를 취하게 된다. 이상의 설명과 같이, 본 발명에 따른 태양광 발전소 모니터링 시스템은 RTU와 인버터 간의 통신 데이터 패킷을 분석하여 메모리에 저장 및 서버로 전송하고, 추후에 메모리 내의 정보를 분석하여 RTU와 관련된 에러가 무엇인 지 파악함으로써, RTU와 관련된 유사한 에러 발생을 미리 예측하여 대처할 수 있는 장점이 있다. 또한, 태양광 발전소 운용과 관련하여 설정된 데이터 및 RTU의 상태를 원격으로 확인할 수 있어 현장에 투여되 는 인력 및 시간을 절감할 수 있는 장점이 있다. 또한, RTU가 건물이나 함체 내부에서도 높은 통신 감도를 유지할 수 있어 태양광 발전 관련 정보 및 데이터를 원활하게 수집할 수 있으며, RTU가 서버와 무선으로 통신함으로써 별도의 인터넷 회선이 필요없어 통신비용을 절감할 수 있는 장점이 있다. 이상, 바람직한 실시예를 통하여 본 발명에 관하여 상세히 설명하였으나, 본 발명은 이에 한정되는 것은"}
{"patent_id": "10-2020-0134057", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "아니며, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양하게 변경, 응용될 수 있음은 당해 기술분야 의 통상의 기술자에게 자명하다. 따라서, 본 발명의 진정한 보호 범위는 다음의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상은 본 발명의 권리 범위에 포함되는 것으로 해석되어야 할 것이다.부호의 설명 100:(본 발명)태양광 발전소 모니터링 시스템 110: RTU 120: 모니터링 서버 121: 데이터/정보 수집부 122: 빅데이터 생성부 123: 인공지능부 124: 이벤트 예측/감지부 125: 알람부 210: 내부 통신부 220: 서버 통신부 230: 제어부 240: 메모리 250: 이벤트 분석부 260: 이벤트 처리부"}
{"patent_id": "10-2020-0134057", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 태양광 발전소 모니터링 시스템의 전체 구성을 개략적으로 나타낸 도면이다. 도 2는 도 1에 도시된 태양광 발전소 모니터링 시스템의 RTU의 내부 구성을 나타낸 도면이다. 도 3은 도 1에 도시된 태양광 발전소 모니터링 시스템의 RTU의 외부 구성을 나타낸 도면이다. 도 4는 도 1에 도시된 태양광 발전소 모니터링 시스템의 모니터링 서버의 내부 구성을 나타낸 도면이다."}
