{"patent_id": "10-2022-0175986", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0093064", "출원번호": "10-2022-0175986", "발명의 명칭": "이미지 처리 장치 및 이의 동작 방법", "출원인": "주식회사 엘지화학", "발명자": "김연승"}}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 활물질들에 대한 활물질 이미지를 획득하는 이미지 획득부;인공 지능 모델에 상기 활물질 이미지를 입력하여, 이진 이미지를 생성하는 이미지 생성부; 상기 이진 이미지에 포함된 복수의 오브젝트들을 식별하는 오브젝트 식별부; 및상기 복수의 오브젝트들에 기초하여 상기 활물질 이미지에 포함된 상기 복수의 활물질들을 세그멘테이션하여 세그멘테이션 이미지를 획득하는 이미지 세그멘테이션부를 포함하는 이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,인공 지능 모델 학습부를 더 포함하고,상기 인공 지능 모델 학습부는 복수의 기준 활물질 이미지들과 상기 복수의 기준 활물질 이미지들에 대응하는 복수의 기준 이진 이미지들을 포함하는 학습 데이터를 획득하고, 상기 인공 지능 모델에 상기 복수의 기준 활물질 이미지들을 입력하여 획득되는 복수의 출력 이미지들과 상기복수의 기준 이진 이미지들 간의 차이가 지정된 기준값 이하이도록, 상기 인공 지능 모델을 학습시키는 이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 복수의 기준 활물질 이미지들은 하나 이상의 제1 기준 활물질 이미지들 및 하나 이상의 제2 기준 활물질이미지들을 포함하고, 상기 복수의 기준 이진 이미지들은 하나 이상의 제1 기준 이진 이미지들 및 하나 이상의 제2 기준 이진 이미지들을 포함하고,상기 제1 기준 활물질 이미지들은 활물질 분말을 촬영함으로써 획득되고, 상기 제2 기준 활물질 이미지들은 상기 제1 기준 활물질 이미지들에 지정된 이미지 처리 알고리즘을 적용하여 생성되고, 상기 제1 기준 이진 이미지들은 상기 제1 기준 활물질 이미지들의 이진 이미지이고, 상기 제2 기준 이진 이미지들은 상기 제2 기준 활물질 이미지들의 이진 이미지인이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 인공 지능 모델은 복수의 레이어들을 포함하고, 상기 복수의 레이어들 중 인코딩 영역에 포함된 적어도 하나의 레이어와 디코딩 영역에 포함된 적어도 하나의공개특허 10-2024-0093064-3-레이어 간은 스킵 커넥션으로 연결되는 이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 복수의 레이어들은 중 상기 디코딩 영역에 포함된 레이어들은 2D 합성곱 레이어, 배치 정규화 레이어, 활성화 레이어, 및 업 샘플링 레이어가 순차적으로 연결된 구조를 가지는 이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서,상기 복수의 레이어들은 중 상기 인코딩 영역에 포함된 레이어들은 2D 합성곱 레이어, 배치 정규화 레이어, 활성화 레이어, 및 최대 풀링 레이어가 순차적으로 연결된 구조를 가지는이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 활물질 이미지는 SEM(scanning electron microscope), TEM(transmission electron microscope),OM(optical microscope), SIM(structured illumination microscopy), 또는 FIB(fused ion beam)에 기반한 이미지인이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 이미지 세그멘테이션부는 워터쉐드(watershed) 알고리즘에 기초하여, 상기 활물질 이미지에 포함된 상기 복수의 활물질들을 세그멘테이션하는이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,정보 추출부를 더 포함하고,상기 정보 추출부는 상기 세그멘테이션 이미지에 기초하여 상기 복수의 활물질들의 정보를 추출하고,상기 복수의 활물질들의 상기 정보에는 활물질의 입경, 둘레 길이, 구형화도, 종횡비, 볼록성, 솔리디티(solidity), 분포, 분위값, 또는 이들의 조합에 대한 정보를 포함하는 공개특허 10-2024-0093064-4-이미지 처리 장치."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "복수의 활물질들에 대한 활물질 이미지를 획득하는 동작, 인공 지능 모델에 상기 활물질 이미지를 입력하여, 이진 이미지를 생성하는 동작, 상기 이진 이미지에 포함된 복수의 오브젝트들을 식별하는 동작, 및 상기 복수의 오브젝트들에 기초하여 상기 활물질 이미지에 포함된 상기 복수의 활물질들을 세그멘테이션하여 세그멘테이션 이미지를 획득하는 동작을 포함하는 이미지 처리 장치의 동작 방법."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,복수의 기준 활물질 이미지들과 상기 복수의 기준 활물질 이미지들에 대응하는 복수의 기준 이진 이미지들을 포함하는 학습 데이터를 획득하는 동작, 및 상기 인공 지능 모델에 상기 복수의 기준 활물질 이미지들을 입력하여 획득되는 복수의 출력 이미지들과 상기복수의 기준 이진 이미지들 간의 차이가 지정된 기준값 이하이도록, 상기 인공 지능 모델을 학습시키는 동작을포함하는 동작 방법."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 복수의 기준 활물질 이미지들은 하나 이상의 제1 기준 활물질 이미지들 및 하나 이상의 제2 기준 활물질이미지들을 포함하고, 상기 복수의 기준 이진 이미지들은 하나 이상의 제1 기준 이진 이미지들 및 하나 이상의 제2 기준 이진 이미지들을 포함하고,상기 제1 기준 활물질 이미지들은 활물질 분말을 촬영함으로써 획득되고, 상기 제2 기준 활물질 이미지들은 상기 제1 기준 활물질 이미지들에 지정된 이미지 처리 알고리즘에 기초하여 생성되고, 상기 제1 기준 이진 이미지들은 상기 제1 기준 활물질 이미지들의 이진 이미지들이고, 상기 제2 기준 이진 이미지들은 상기 제2 기준 활물질 이미지들의 이진 이미지들인동작 방법."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 인공 지능 모델은 복수의 레이어들을 포함하고, 상기 복수의 레이어들 중 인코딩 영역에 포함된 적어도 하나의 레이어와 디코딩 영역에 포함된 적어도 하나의레이어 간은공개특허 10-2024-0093064-5-동작 방법."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 복수의 레이어들은 중 상기 디코딩 영역에 포함된 레이어들은 2D 합성곱 레이어, 배치 정규화 레이어, 활성화 레이어, 및 업 샘플링 레이어가 순차적으로 연결된 구조를 가지는동작 방법."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 13에 있어서,상기 복수의 레이어들은 중 상기 인코딩 영역에 포함된 레이어들은 2D 합성곱 레이어, 배치 정규화 레이어, 활성화 레이어, 및 최대 풀링 레이어가 순차적으로 연결된 구조를 가지는, 동작 방법."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 10에 있어서,상기 세그멘테이션 이미지를 획득하는 동작은워터쉐드(watershed) 알고리즘에 기초하여, 상기 활물질 이미지에 포함된 상기 복수의 활물질들을 세그멘테이션하는 동작을 포함하는동작 방법."}
{"patent_id": "10-2022-0175986", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 9에 있어서,상기 세그멘테이션 이미지에 기초하여 상기 복수의 활물질들의 정보를 추출하는 동작을 더 포함하고,상기 복수의 활물질들의 상기 정보에는 활물질의 입경, 둘레 길이, 구형화도, 종횡비, 볼록성, 솔리디티(solidity), 분포, 분위값, 또는 이들의 조합에 대한 정보를 포함하는 동작 방법."}
{"patent_id": "10-2022-0175986", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에서 개시되는 일 실시 예에 따른 이미지 처리 장치는, 복수의 활물질들에 대한 활물질 이미지를 획득하 는 이미지 획득부, 인공 지능 모델에 상기 활물질 이미지를 입력하여, 이진 이미지를 생성하는 이미지 생성부, 상기 이진 이미지에 포함된 복수의 오브젝트들을 식별하는 오브젝트 식별부, 및 상기 복수의 오브젝트들에 기초 하여 상기 활물질 이미지에 포함된 상기 복수의 활물질들을 세그멘테이션하여 세그멘테이션 이미지를 획득하는 이미지 세그멘테이션부를 포함할 수 있다."}
{"patent_id": "10-2022-0175986", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 실시 예들은, 이미지 처리 장치 및 이의 동작 방법에 관한 것이다."}
{"patent_id": "10-2022-0175986", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "모바일 기기 및 전기 자동차에 대한 기술 개발 및 수요가 증가함에 따라 에너지원으로서 리튬 이차 전지의 수요 가 급격히 증가하고 있다. 리튬 이차 전지는 양극, 분리막 및 음극으로 구성된 전극 조립체를 전지 케이스에 넣고 전해액을 주입하여 제조 된다. 상기 양극은 양극 집전체 상에 양극 활물질, 도전재 및 바인더를 포함하는 양극 활물질층 형성용 조성물 을 코팅한 후, 건조하고 압연하여 제조되며, 상기 음극은 음극 집전체 상에 음극 활물질, 도전재 및 바인더를 포함하는 음극 활물질층 형성용 조성물을 코팅한 후, 건조하고 압연하여 제조된다. 한편, 리튬 이차 전지의 전기화학적 성능은 사용되는 양극 활물질 및 음극 활물질 입자의 조성뿐 아니라, 활물 질 입자의 형상 등에도 영향을 받는다. 이는 활물질 입자의 형상이나 입경 등에 따라 전극 밀도, 전기 전도도, 저항 특성 등과 같은 전기 화학적 특성이 달라지기 때문이다. 따라서, 원하는 성능을 갖는 리튬 이차 전지를 제 조하기 위해서는 활물질 입자의 형상을 정확하게 분석할 필요가 있다. 종래에는 주사 전자 현미경(scanning electron microscope, SEM)을 통해 얻어진 양극 활물질 입자의 이미지를 이용하여 양극 활물질 입자의 형상을 분석하였다. 그러나, SEM 이미지를 이용하여 양극 활물질 형상을 분석하는 종래 방법의 경우, 정성 분석은 가능하지만 정량 분석을 위해서는 사람이 SEM 이미지에서 개별 활물질 입자를 선택하여 수동으로 측정해야 하고, 자동으로 정량 분석을 수행할 수는 없었다. 따라서, 다량의 양극 활물질 입 자에 대한 정량 분석이 어려울 뿐 아니라, 측정자에 따라 측정치가 달라질 수 있어 분석 정확도가 떨어진다는 문제점이 있다."}
{"patent_id": "10-2022-0175986", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로, 대량의 양극 활물질 및/또는 전구체 입자의 형상 특성 을 자동으로 정량 분석할 수 있는 방법을 제공하고자 한다. 또한, 본 발명은 사용자에 따라 측정치가 달라질 수 있어 분석 정확도가 떨어지는 문제점을 해결하기 위해 사용 자의 관여를 최소화하는 정량 분석 방법을 제공하고자 한다."}
{"patent_id": "10-2022-0175986", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에서 개시되는 일 실시 예에 따른 이미지 처리 장치는, 복수의 활물질들에 대한 활물질 이미지를 획득하 는 이미지 획득부, 인공 지능 모델에 상기 활물질 이미지를 입력하여, 이진 이미지를 생성하는 이미지 생성부, 상기 이진 이미지에 포함된 복수의 오브젝트들을 식별하는 오브젝트 식별부, 및 상기 복수의 오브젝트들에 기초 하여 상기 활물질 이미지에 포함된 상기 복수의 활물질들을 세그멘테이션하여 세그멘테이션 이미지를 획득하는 이미지 세그멘테이션부를 포함할 수 있다. 본 문서에서 개시되는 일 실시 예에 따른 이미지 처리 장치의 동작 방법은, 복수의 활물질들에 대한 활물질 이 미지를 획득하는 동작, 인공 지능 모델에 상기 활물질 이미지를 입력하여, 이진 이미지를 생성하는 동작, 상기 이진 이미지에 포함된 복수의 오브젝트들을 식별하는 동작, 및 상기 복수의 오브젝트들에 기초하여 상기 활물질 이미지에 포함된 상기 복수의 활물질들을 세그멘테이션하여 세그멘테이션 이미지를 획득하는 동작을 포함할 수 있다."}
{"patent_id": "10-2022-0175986", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예들에 따른, 이미지 처리 장치 및 이의 동작 방법은, 복수의 활물질들에 대한 활물질 이미지를 획득하고, 인공 지능 모델에 상기 활물질 이미지를 입력하여 이진 이미지를 생성하고, 상기 이 진 이미지에 포함된 복수의 오브젝트들을 식별한 후, 상기 복수의 오브젝트들에 기초하여 상기 활물질 이미지에 포함된 상기 복수의 활물질들을 세그멘테이션함으로써, 대량의 양극 활물질 입자의 형상 특성을 자동으로 정량 분석할 수 있다. 또한, 본 문서에 개시되는 다양한 실시 예들에 따른, 이미지 처리 장치 및 이의 동작 방법은, 사용자의 입력이 최소화되는 인공 지능 모델을 활용함으로써, 사용자에 따라 측정치가 달라지는 문제점을 최소화할 수 있다. 본 문서의 개시에 따른 이미지 처리 장치 및 이의 동작 방법의 효과들은 이상에서 언급한 효과들로 제한되지 않 으며, 언급되지 않은 또다른 효과들은 본 문서의 개시에 따라 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0175986", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시 예들이 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 본 문서의 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예로 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설 명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하 는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포 함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", \"첫째\", \"둘째\", \"A\", \"B\", \"(a)\" 또는 \"(b)\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사 용될 수 있으며, 특별히 반대되는 기재가 없는 한, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한 정하지 않는다. 본 문서에서, 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어 와 함께 또는 이런 용어 없이, \"연결\", \"결합\" 또는 \"접속\"된다고 언급되거나 \"커플드\" 또는 \"커넥티드\"라고 언 급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로, 또는 무선으로), 또 는 간접적으로(예: 제3 구성요소를 통하여) 연결될 수 있다는 것을 의미한다. 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되 어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그 램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory, CD-ROM)의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두 개의 사용자 장치들 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이 션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 문서에 개시된 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 본 문서에 개시된 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략 되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수 의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 본 문서에 개시된 실시 예들에 따르 면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 1은, 본 개시의 일 실시 예에 따른 이미지 처리 장치의 블록도이다. 도 1를 참조하면, 이미지 처리 장치는 이미지 획득 장치와 유선 및/또는 무선으로 연결될 수 있다. 일 실시 예에서, 이미지 처리 장치와 이미지 획득 장치 간의 연결은 유선 및/또는 무선 네트워 크를 통한 통신 연결일 수 있다. 일 실시 예에서, 유선 네트워크는 LAN(local area network) 통신, 또는 전력선 통신에 기초할 수 있다. 일 실시 예에서, 무선 네트워크는 근거리 통신 네트워크(예: 블루투스, WiFi(wirelessfidelity) 또는 IrDA(infrared data association)), 또는 원거리 통신 네트워크(셀룰러 네트워크, 4G 네트워크, 5G 네트워크)에 기초할 수 있다. 다른 실시 예에서, 이미지 처리 장치와 이미지 획득 장치 간의 연결은 기기 간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통한 연결일 수 있다. 일 실시 예에서, 이미지 획득 장치는 현미경(예: 주사 전자 현미경)일 수 있다. 일 실시 예에서, 이미지 획득 장치는 집속된 전자빔을 시료 표면에 주사하면서 전자빔과 시료와의 상호 작용에 의해 발생되는 이차 전자(secondary electron)를 영상 신호로 전환하여 시료 표면의 이미지를 획득하는 장치일 수 있다. 일 실시 예에서, 이미지 획득 장치는 활물질 및/또는 전구체에 대한 이미지를 획득할 수 있다. 이하에서는, 활물질 및/또는 전구체에 대한 이미지가 활물질 이미지로 지칭될 수 있다. 그러나, 활물질 이미지 로 지칭되더라도 본 개시가 전구체에 대한 이미지를 배제하는 것은 아니다. 일 실시 예에서, 이미지 획득 장치는 활물질에 대한 활물질 이미지를 획득할 수 있다. 예를 들어, 이미지 획득 장치는 양극 활물질 분말에 전자빔을 주사하여 SEM(scanning electron microscope) 이미지를 획득할 수 있다. 실시 예들에 따라, SEM 이미지는 TEM(transmission electron microscope), OM(optical microscope), SIM(structured illumination microscopy), 또는 FIB(fused ion beam)에 기반한 이미지로 대체될 수 있다. 일 실시 예에서, 이미지 획득 장치는 활물질에 대한 활물질 이미지를 이미지 처리 장치에게 송신할 수 있다. 예를 들어, 이미지 획득 장치는 연결을 통해 이미지 처리 장치에게 활물질에 대한 활 물질 이미지를 송신할 수 있다. 일 실시 예에서, 이미지 처리 장치는 모바일 디바이스(예: 휴대폰, 랩탑 컴퓨터, 스마트 폰, 스마트 패 드), 컴퓨터(예: 범용 컴퓨터, 특수 목적 컴퓨터)일 수 있다. 일 실시 예에서, 이미지 처리 장치는 통신 회로, 메모리, 및 프로세서를 포함할 수 있다. 실시 예에 따라, 도 1에 도시된 이미지 처리 장치는 도 1에서 도시된 구성 요소들 이외의 적어도 하나의 구성 요소(예: 디스플레이, 입력 장치, 또는 출력 장치)를 더 포함할 수 있다. 일 실시 예에서, 통신 회로는 이미지 처리 장치 및/또는 이미지 획득 장치 간의 유선 통신 채널 및/또는 무선 통신 채널을 수립하고, 수립된 통신 채널을 통해 이미지 획득 장치와 데이터를 송수신할 수 있다. 일 실시 예에서, 메모리는 휘발성 메모리 및/또는 비휘발성 메모리를 포함할 수 있다. 일 실시 예에서, 메모리는, 이미지 처리 장치의 적어도 하나의 구성요소(예: 프로세서)에 의해 사용되는 데이터를 저장할 수 있다. 예를 들어, 데이터는 프로그램(또는, 이와 관련된 명령어 (instruction)), 입력 데이터 또는 출력 데이터를 포함할 수 있다. 일 실시 예에서, 명령어는 프로세서에 의해 실행 시 이미지 처리 장치가 명령어에 의해 정의되는 동작들을 수행하게 할 수 있다. 일 실시 예에서, 메모리는 프로그램(예: 인공 지능 모델 학습부, 인공 지능 모델, 이미지 획득부, 이미지 생성부, 오브젝트 식별부, 이미지 세그멘테이션부, 및/또는 정보 추출부 )를 포함할 수 있다. 일 실시 예에서, 프로세서는 중앙 처리 장치, 어플리케이션 프로세서, 그래픽 처리 장치, 신경망 처리 장 치(NPU, neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서 를 포함할 수 있다. 일 실시 예에서, 프로세서는 프로그램(예: 인공 지능 모델 학습부, 인공 지능 모델, 이미 지 획득부, 이미지 생성부, 오브젝트 식별부, 이미지 세그멘테이션부, 및/또는 정보 추출 부)을 실행하여 프로세서에 연결된 이미지 처리 장치의 적어도 하나의 다른 구성 요소(예: 하드 웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일 실시 예에서, 인공 지능 모델 학습부는, 학습 데이터에 기초하여 인공 지능 모델을 학습시킬 수 있다. 일 실시 예에서, 인공 지능 모델은, 활물질 이미지를 이진 이미지로 변환하기 위해 학습된 모델일 수 있다. 일 실시 예에서, 이미지 획득부는 이미지 획득 장치로부터 활물질에 대한 활물질 이미지를 획득할 수 있다. 일 실시 예에서, 이미지 생성부는 인공 지능 모델에 활물질 이미지를 입력함으로써,이진 이미지를 생성할 수 있다. 일 실시 예에서, 오브젝트 식별부는 이진 이미지에 포함된 복수의 오브젝 트들을 식별할 수 있다. 일 실시 예에서, 이미지 세그멘테이션부는 복수의 오브젝트들에 기초하여 활물질 이미지에 포함된 복수의 활물질 오브젝트들을 세그멘테이션하여 세그멘테이션 이미지를 획득할 수 있다. 일 실 시 예에서, 정보 추출부는 세그멘테이션 이미지에 포함되는 활물질 오브젝트들에 기초하여, 활물질에 대한 정보를 추출할 수 있다. 이하에서는, 도 2 내지 도 4를 참조하여, 인공 지능 모델 학습부, 인공 지능 모델, 이미지 획득부 , 이미지 생성부, 오브젝트 식별부, 이미지 세그멘테이션부, 및/또는 정보 추출부를 통해 이미지 처리 장치가 이미지 획득 장치로부터 획득되는 이미지를 처리하는 방법을 구체적으로 설 명한다. 학습 데이터 도 2는, 본 개시의 일 실시 예에 따른 학습 데이터를 예시한다. 도 2를 참조하면, 학습 데이터는 기준 활물질 이미지들(211, 213, 215, 221, 223, 225, 231, 233, 235) 및 기 준 이진(binary) 이미지들(251, 253, 255, 261, 263, 265, 271, 273, 275)을 포함할 수 있다. 학습 데이터에 포함되는 기준 활물질 이미지들(211, 213, 215, 221, 223, 225, 231, 233, 235) 및 기준 이진 이미지들(251, 253, 255, 261, 263, 265, 271, 273, 275)의 크기는 동일할 수 있다. 일 실시 예에서, 이미지의 크기는 수평 픽셀 개수 × 수직 픽셀 개수로 정의될 수 있다. 학습 데이터에 포함되는 이미지들의 수평 픽셀 개 수는 32 내지 4096 사이의 정수이고, 수직 픽셀 개수는 32 내지 4096 사이의 정수일 수 있다. 예를 들어, 이미 지의 크기는 256 × 256일 수 있다. 일 실시 예에서, 복수의 기준 활물질 이미지들(211, 213, 215, 221, 223, 225, 231, 233, 235)은 하나 이상의 제1 기준 활물질 이미지들 및 하나 이상의 제2 기준 활물질 이미지들을 포함할 수 있다. 일 실시 예에서, 제1 기준 활물질 이미지들은 활물질 분말을 촬영함으로써 획득될 수 있다. 일 실시 예에서, 제 1 기준 활물질 이미지들은 이미지 획득 장치를 통해 직접 획득된 SEM 이미지들일 수 있다. 일 실시 예에서, 제2 기준 활물질 이미지들은 제1 기준 활물질 이미지들로부터 변형된 이미지들일 수 있다. 일 실시 예에서, 제2 기준 활물질 이미지들은 제1 기준 활물질 이미지들에 지정된 제1 이미지 처리 알고리즘을 적 용하여 생성될 수 있다. 여기에서, 제1 이미지 처리 알고리즘으로는, 로테이션(rotation), 틸트(tilt), 셰어 (shear), 밝기 조정, 대비 조정, 확대, 축소, 또는 이들의 조합을 포함할 수 있다. 일 실시 예에서, 복수의 기준 이진 이미지들(251, 253, 255, 261, 263, 265, 271, 273, 275)은 하나 이상의 제 1 기준 이진 이미지들 및 하나 이상의 제2 기준 이진 이미지들을 포함할 수 있다. 일 실시 예에서, 제1 기준 이진 이미지들은 제1 기준 활물질 이미지에 제2 이미지 처리 알고리즘을 적용하여 생 성될 수 있다. 여기에서, 제2 이미지 처리 알고리즘은 평균 이동 시프트 필터, 경계 추출 알고리즘, 경계 제거 알고리즘, 이진화 알고리즘, 또는 이들의 조합을 포함할 수 있다. 일 실시 예에서, 제2 기준 이진 이미지들은 제1 기준 이진 이미지들로부터 변형된 이미지들일 수 있다. 일 실시 예에서, 제2 기준 이진 이미지들은 제1 기준 이진 이미지들에 지정된 제1 이미지 처리 알고리즘을 적용하여 생 성될 수 있다. 여기에서, 제1 이미지 처리 알고리즘으로는, 로테이션, 틸트, 셰어, 밝기 조정, 대비 조정, 확대, 축소, 또는 이들의 조합을 포함할 수 있다. 일 실시 예에서, 제1 기준 이진 이미지들은 제1 기준 활물질 이미지들의 이진 이미지이고, 제2 기준 이진 이미 지들은 제2 기준 활물질 이미지들의 이진 이미지일 수 있다. 예를 들어, 기준 이진 이미지는 기준 활물질 이미지에 대한 이진 이미지이고, 기준 이진 이미지는 기준 활물질 이미지에 대한 이진 이미지이 고, 기준 이진 이미지는 기준 활물질 이미지에 대한 이진 이미지일 수 있다. 따라서, 복수의 기준 활 물질 이미지들(211, 213, 215, 221, 223, 225, 231, 233, 235)과 복수의 기준 이진 이미지들(251, 253, 255, 261, 263, 265, 271, 273, 275)은 서로 대응하는 이미지들끼리 이미지 셋으로 구분될 수 있다. 예를 들어, 기준 활물질 이미지와 기준 이진 이미지는 하나의 이미지 셋으로 구분될 수 있다. 일 실시 예에서, 학습 데이터는 인공 지능 모델을 학습시키는 데 이용될 수 있다. 일 실시 예에서, 학습 데이터는 지정된 횟수의 에포크(epoch)만큼 인공 지능 모델을 학습시키는 데 이용될 수 있다. 여기에서, 지정된 횟수는 100 내지 10000 사이에서 결정될 수 있다. 예를 들어, 지정된 횟수는 3000회일 수 있다. 일 실시 예에서, 학습 데이터는 배치 사이즈(batch size)만큼 나뉜 미니-배치(mini-batch)로 구분될 수 있다. 여기에서, 배치 사이즈는 1 내지 512 사이에서 결정될 수 있다. 예를 들어, 배치 사이즈는 3일 수 있다. 배치 사이즈가 3인 경우, 3개의 이미지 셋(즉, 3개의 기준 활물질 이미지들과 3개의 기준 이진 이미지들)마다 미니- 배치로 구분될 수 있다. 예를 들어, 기준 활물질 이미지들(211, 213, 215)과 기준 이진 이미지들(251, 253, 255)이 제1 미니-배치를 구성하고, 기준 활물질 이미지들(221, 223, 225)과 기준 이진 이미지들(261, 263, 265)이 제2 미니-배치를 구성하고, 기준 활물질 이미지들(231, 233, 235)과 기준 이진 이미지들(271, 273, 275)이 제3 미니-배치를 구성할 수 있다. 인공 지능 모델 도 3은, 본 개시의 일 실시 예에 따른 인공 지능 모델을 예시한다. 구체적으로, 도 3은 기준 활물질 이미 지들(301, 303, 305)과 기준 이진 이미지들(391, 393, 395)로 구성되는 미니-배치를 통해 인공 지능 모델(11 5)을 학습시키는 예를 나타낸다. 일 실시 예에서, 인공 지능 모델은 CNN(convolutional neural network), 또는 U-NET에 기초한 모델일 수 있다. 일 실시 예에서, 인공 지능 모델은, 활물질 이미지를 이진 이미지로 변환하기 위해 학습된 모델일 수 있다. 도 3을 참조하면, 인공 지능 모델은 복수의 레이어들(310, 320, 330, 340, 350, 360, 370)을 포함할 수 있다. 복수의 레이어들(310, 320, 330, 340, 350, 360, 370)은 순차적으로 연결될 수 있다. 순차적으로 연결되 는 레이어들의 입력은 직전에 연결되는 레이어의 출력이고, 순차적으로 연결되는 레이어들의 출력은 직후에 연 결되는 레이어의 입력일 수 있다. 예를 들어, 레이어의 출력은 레이어의 입력일 수 있다. 상기 복수의 레이어들(310, 320, 330, 340, 350, 360, 370) 중 적어도 두 개의 레이어들(예: 레이어들(310, 370), 레이어들(320, 360), 또는 레이어들(330, 350)) 간은 스킵 커넥션(315, 325, 335)으로 연결될 수 있다. 일 실시 예에서, 스킵 커넥션(315, 325, 335)은 상기 복수의 레이어들(310, 320, 330, 340, 350, 360, 370) 중 인코딩 영역에 포함된 레이어(예: 레이어들(310, 320, 330))와 디코딩 영역에 포함된 레이어(예: 레이어들(350, 360, 370))를 연결할 수 있다. 여기에서, 스킵 커넥션(315, 325, 335)은 레이어들(310, 320, 330)의 출력을 레 이어들(350, 360, 370)에 입력하기 위한 레이어들 간의 연결을 의미할 수 있다. 예를 들어, 스킵 커넥션에 의해 레이어에는 레이어의 출력과 레이어의 출력이 입력될 수 있다. 일 실시 예에서, 복수의 레이어들(310, 320, 330, 340, 350, 360, 370)은 입력 레이어, 배치 정규화(batch normalization) 레이어, 2D 합성곱(convolution) 레이어, 활성화 레이어, 최대 풀링(max pooling) 레이어, 업 샘플링 레이어, 연결(concatenate) 레이어, 또는 이들의 조합을 포함할 수 있다. 예를 들어, 인코딩 영역에 포 함된 레이어(예: 레이어들(310, 320, 330))는 2D 합성곱 레이어, 배치 정규화 레이어, 활성화 레이어, 및 최대 풀링 레이어가 순차적으로 연결된 구조를 가질 수 있다. 다른 들어, 디코딩 영역에 포함된 레이어(예: 레이어들 (350, 360, 370))는 2D 합성곱 레이어, 배치 정규화 레이어, 활성화 레이어, 및 업 샘플링 레이어가 순차적으로 연결된 구조를 가질 수 있다. 일 실시 예에서, 입력 레이어는, 기준 활물질 이미지(301, 303, 305)에 포함된 비트 값들을 입력받는 레이어일 수 있다. 일 실시 예에서, 입력 레이어는, 수평 픽셀 개수 × 수직 픽셀 개수 × 채널 개수(또는, 뎁스)만큼의 비트 값들로 구성되는 입력을 획득할 수 있다. 예를 들어, 기준 활물질 이미지가 N × N 크기를 가지는 경우, 입력 레이어는 N × N × 1개의 비트 값들을 비트 값들을 입력받을 수 있다. 여기에서, N은 32 내지 4096 사이 의 정수(예: 256)일 수 있다. 실시 예에 따라, 채널 개수는 뎁스로도 지칭될 수 있다. 일 실시 예에서, 배치 정규화 레이어는, 배치 단위로 이전 레이어의 출력 값을 정규화하기 위한 레이어일 수 있 다. 실시 예에 따라, 배치 정규화 레이어는, 활성화 레이어 직전에 배치될 수 있다. 여기에서, 배치는 인공 지 능 모델을 학습시키기 위해 한 번의 반복(iteration) 동안 입력되는 기준 활물질 이미지를 포함할 수 있다. 예를 들어, 배치 사이즈가 3인 경우, 한 번의 반복 동안 인공 지능 모델에 입력되는 기준 활물질 이 미지의 개수는 3일 수 있다. 여기에서, 배치 사이즈는 1 내지 512 사이의 정수(예: 3)일 수 있다. 일 실시 예에서, 2D 합성곱 레이어는, 입력과 지정된 크기의 필터를 합성곱 연산하여 출력을 획득하기 위한 레 이어일 수 있다. 일 실시 예에서, 인공 지능 모델에 포함되는 2D 합성곱 레이어는, 출력의 이미지 크기(수 평 픽셀 개수 × 수직 픽셀 개수)가 입력의 이미지 크기(수평 픽셀 개수 × 수직 픽셀 개수)와 동일한 것으로 가정한다. 일 실시 예에서, 2D 합성곱 레이어의 필터의 개수(또는, 필터의 뎁스)에 따라 출력의 채널 개수는 변 경될 수 있다. 예를 들어, 필터의 개수가 2개인 경우, 입력의 채널 개수와 비교하여 출력의 채널의 개수는 2배만큼 증가할 수 있다. 일 실시 예에서, 2D 합성곱 레이어의 뎁스 방향으로의 스트라이드에 따라 출력의 채널 개 수는 변경될 수 있다. 예를 들어, 뎁스 방향으로의 스트라이드가 2인 경우, 입력의 채널 개수와 비교하여 출력 의 채널의 개수는 절반만큼 감소할 수 있다. 일 실시 예에서, 활성화 레이어는, 입력에 지정된 활성화 함수를 적용하여 출력을 획득하는 레이어일 수 있다. 예를 들어, 지정된 활성화 함수는 스텝, 시그모이드, ReLU(rectifier linear unit), ELU(exponential linear unit), 소프트맥스, 또는 이들의 조합을 포함할 수 있다. 일 실시 예에서, 최대 풀링 레이어는, 입력을 풀링 영역마다 가장 큰 값을 선택하여 출력을 획득하기 위한 레이 어일 수 있다. 일 실시 예에서, 최대 풀링 레이어의 풀링 영역의 크기에 따라 출력의 이미지 크기(즉, 수평 픽 셀 개수 및 수직 픽셀 개수)는 변경될 수 있다. 예를 들어, 풀링 영역의 크기가 2 × 2인 경우, 출력의 이미지 크기(예: 128 × 128)는 입력의 이미지 크기(예: 256 × 256)에 비해 절반으로 감소될 수 있다. 실시 예에 따라, 인공 지능 모델은 최대 풀링 레이어가 아닌 다른 방식의 풀링 레이어를 포함할 수 있다. 예를 들어, 다른 방식의 풀링 레이어는 평균 풀링 레이어를 포함할 수 있다. 일 실시 예에서, 업 샘플링 레이어는, 이미지의 해상도를 증가시키기 위한 레이어일 수 있다. 일 실시 예에서, 업 샘플링 레이어는, 지정된 보간 알고리즘을 이용하여 출력의 이미지 크기를 입력의 이미지 크기에 비해 증가 시키기 위한 레이어일 수 있다. 일 실시 예에서, 연결 레이어는 둘 이상의 입력들을 연결(concatenate)하여 출력할 수 있다. 여기에서, 연결은 뎁스 방향으로의 연결일 수 있다. 예를 들어, 제1 입력이 128 × 128 × 128이고, 제2 입력이 128 × 128 × 128인 경우, 연결 레이어의 출력은 128 × 128 × 256일 수 있다. 다른 제1 입력이 256 × 256 × 64이고, 제2 입력이 128 × 128 × 128인 경우, 연결 레이어의 출력은 256 × 256 × 128일 수 있다. 도 3에서는 레이어들(310, 320, 330, 340, 350, 360, 370)의 개수가 7개인 것으로 예시되어 있으나, 이는 예시 일 뿐이며, 레이어들의 개수는 7개에 제한되지 않는다. 예를 들어, 인공 지능 모델에 포함되는 레이어들의 개수는 32개일 수 있다. 인공 지능 모델에 포함되는 레이어들의 개수는 32개인 경우, 인공 지능 모델은, 입력 레이어, 제1 배 치 정규화 레이어, 제1 2D 합성곱 레이어, 제2 2D 합성곱 레이어를 순차적으로 연결된 구조를 가질 수 있다. 순 차적으로 연결되는 레이어들의 입력은 직전에 연결되는 레이어의 출력이고, 순차적으로 연결되는 레이어들의 출 력은 직후에 연결되는 레이어의 입력일 수 있다. 여기에서, 입력 레이어의 입력은 256 × 256 × 1이고, 출력은 256 × 256 × 1일 수 있다. 제1 배치 정규화 레이어의 출력은 256 × 256 × 1일 수 있다. 제1 2D 합성곱 레이 어의 출력은 256 × 256 × 64일 수 있다. 제2 2D 합성곱 레이어의 출력은 256 × 256 × 64일 수 있다. 제2 2D 합성곱 레이어에 이어서, 인공 지능 모델은 제2 배치 정규화 레이어, 제1 활성화 레이어, 및 제1 최대 풀링 레이어가 순차적으로 연결된 구조를 가질 수 있다. 여기에서, 제2 배치 정규화 레이어의 출력은 256 × 256 × 64일 수 있다. 제1 활성화 레이어의 출력은 256 × 256 × 64일 수 있다. 제1 최대 풀링 레이어의 출 력은 128 × 128 × 64일 수 있다. 제1 최대 풀링 레이어에 이어서, 인공 지능 모델은 제3 2D 합성곱 레이어, 제4 2D 합성곱 레이어, 제3 배 치 정규화 레이어, 제2 활성화 레이어, 및 제2 최대 풀링 레이어가 순차적으로 연결된 구조를 가질 수 있다. 여 기에서, 제3 2D 합성곱 레이어의 출력은 128 × 128 × 128일 수 있다. 제4 2D 합성곱 레이어의 출력은 128 × 128 × 128일 수 있다. 제3 배치 정규화 레이어의 출력은 128 × 128 × 128일 수 있다. 제2 활성화 레이어의 출력은 128 × 128 × 128일 수 있다. 제2 최대 풀링 레이어의 출력은 64 × 64 × 128일 수 있다. 제2 최대 풀링 레이어에 이어서, 인공 지능 모델은 제5 2D 합성곱 레이어, 제6 2D 합성곱 레이어, 제4 배 치 정규화 레이어, 제3 활성화 레이어, 및 제1 업 샘플링 레이어가 순차적으로 연결된 구조를 가질 수 있다. 여 기에서, 제5 2D 합성곱 레이어의 출력은 64 × 64 × 256일 수 있다. 제6 2D 합성곱 레이어의 출력은 64 × 64 × 256일 수 있다. 제4 배치 정규화 레이어의 출력은 64 × 64 × 256일 수 있다. 제3 활성화 레이어의 출력은 64 × 64 × 256일 수 있다. 제1 업 샘플링 레이어의 출력은 128 × 128 × 256일 수 있다. 제1 업 샘플링 레이어에 이어서, 인공 지능 모델은 제7 2D 합성곱 레이어, 제1 연결 레이어, 제8 2D 합성 곱 레이어, 제9 2D 합성곱 레이어, 제5 배치 정규화 레이어, 제4 활성화 레이어, 및 제2 업 샘플링 레이어가 순 차적으로 연결된 구조를 가질 수 있다. 제1 연결 레이어의 두 개의 입력들 중 제1 입력은 제7 2D 합성곱 레이어 의 출력이고, 제2 입력은 제4 2D 합성곱 레이어의 출력일 수 있다. 여기에서, 제7 2D 합성곱 레이어의 출력은 128 × 128 × 128일 수 있다. 제1 연결 레이어의 출력은 128 × 128 × 256일 수 있다. 제8 2D 합성곱 레이어의 출력은 128 × 128 × 128일 수 있다. 제9 2D 합성곱 레이어의 출력은 128 × 128 × 128일 수 있다. 제5 배치 정규화 레이어의 출력은 128 × 128 × 128일 수 있다. 제4 활성화 레이어의 출력은 128 × 128 × 128일 수 있다. 제2 업 샘플링 레이어의 출력은 256 × 256 × 128일 수 있다. 제2 업 샘플링 레이어에 이어서, 인공 지능 모델은 제10 2D 합성곱 레이어, 제2 연결 레이어, 제11 2D 합 성곱 레이어, 제12 2D 합성곱 레이어, 제6 배치 정규화 레이어, 제5 활성화 레이어, 제13 2D 합성곱 레이어, 및 제14 2D 합성곱 레이어가 순차적으로 연결된 구조를 가질 수 있다. 제2 연결 레이어의 두 개의 입력들 중 제1 입력은 제10 2D 합성곱 레이어의 출력이고, 제2 입력은 제2 2D 합성곱 레이어의 출력일 수 있다. 여기에서, 제 10 2D 합성곱 레이어의 출력은 256 × 256 × 64일 수 있다. 제2 연결 레이어의 출력은 256 × 256 × 128일 수 있다. 제11 2D 합성곱 레이어의 출력은 256 × 256 × 64일 수 있다. 제12 2D 합성곱 레이어의 출력은 256 × 256 × 64일 수 있다. 제6 배치 정규화 레이어의 출력은 256 × 256 × 64일 수 있다. 제5 활성화 레이어의 출 력은 256 × 256 × 64일 수 있다. 제13 2D 합성곱 레이어의 출력은 256 × 256 × 2일 수 있다. 제14 2D 합성 곱 레이어의 출력은 256 × 256 × 2일 수 있다. 인공 지능 모델 학습 도 3을 참조하여, 인공 지능 모델 학습부가 미니 배치에 포함된 이미지들(301, 303, 305, 391, 393, 39 5)을 통해 인공 지능 모델을 학습시키는 동작을 설명한다. 일 실시 예에서, 인공 지능 모델 학습부는 기준 활성화 이미지들(301, 303, 305)을 순차적으로 인공 지능 모델에 입력할 수 있다. 일 실시 예에서, 인공 지능 모델 학습부는 순차적으로 획득되는 인공 지능 모델의 출력 이미지들과 기준 이진 이미지들(391, 393, 395) 간의 차이가 지정된 기준값 이하이도록, 인공 지능 모델을 학습시킬 수 있다. 예를 들어, 인공 지능 모델 학습부는 손실 함수(또는 비용 함수)에 기초하여, 출력 이미지들과 기준 이진 이미지들(391, 393, 395) 간의 차이를 연산할 수 있다. 여기에서, 손실 함수는 평균 절대 오차 함수, 평균 제곱 근 오차, 평균 제곱 오차 함수, 또는 이진 교차 엔트로피 손실 함수(binary cross entropy loss function)를 포함할 수 있다. 실시 예에 따라, 이진 교차 엔트로피 손실 함수는 두 개의 색상들(또는, 클래스들) 중 하나의 색상(예: 검은색 및 흰색 중 흰색)에 대해 1 내지 1000 사이의 가중치가 적용된 함수일 수 있다. 이후, 인공 지능 모델 학습부는 차이가 지정된 기준값 이하이도록(또는, 최소값을 가지도록) 인공 지능 모 델의 가중치들을 조절할 수 있다. 일 실시 예에서, 인공 지능 모델 학습부는 경사하강법에 기초한 알 고리즘(예: Adam, SGD, Momentum)을 통해 차이가 지정된 기준값 이하이도록(또는, 최소값을 가지도록) 인공 지 능 모델의 가중치들을 조절할 수 있다. 여기에서, 조절되는 가중치들은 러닝 레이트(learning rate)에 따 라 결정될 수 있다. 러닝 레이트는 0.00000001 내지 0.1 사이에서 결정될 수 있다. 예시적으로 러닝 레이트는 0.0001일 수 있다. 이후, 인공 지능 모델 학습부는 다음 번의 미니 배치에 포함된 이미지들을 통해 인공 지능 모델을 학 습시킬 수 있다. 이후, 모든 미니 배치들에 포함된 이미지들을 통해 대해 인공 지능 모델을 학습시킨 경우, 인공 지능 모델 학습부는 지정된 에포크 횟수에 따라, 미니 배치들에 포함된 이미지들을 통해 인공 지능 모델을 다시 학습시킬 수 있다. 인공 지능 모델을 통한 이미지 처리 도 4는, 본 개시의 일 실시 예에 따른 이미지 처리 장치의 이미지 처리에 따른 이미지들(410, 430, 450)을 예시한다. 일 실시 예에서, 이미지 획득부는 활물질(411, 413, 415)에 대한 활물질 이미지를 획득할 수 있다. 일 실시 예에서, 이미지 획득부는 이미지 획득 장치를 통해 활물질 이미지를 획득할 수 있다. 일 실시 예에서, 이미지 생성부는 이진 이미지를 생성할 수 있다. 일 실시 예에서, 이미지 생성부 는 인공 지능 모델에 활물질 이미지를 입력함으로써, 이진 이미지를 생성할 수 있다. 일 실시 예에서, 오브젝트 식별부는 이진 이미지에 포함된 복수의 오브젝트들(431, 433, 435)을 식별 할 수 있다. 여기에서, 이진 이미지에 포함된 복수의 오브젝트들(431, 433, 435)은 활물질 이미지에 서의 활물질(411, 413, 415)에 대응할 수 있다. 일 실시 예에서, 복수의 오브젝트들(431, 433, 435)은 지정된값(예: 흰 색을 나타내는 값)을 가지는 영역으로 구성될 수 있다. 일 실시 예에서, 복수의 오브젝트들(431, 433, 435)은 지정된 다른 값(예: 검정 색을 나타내는 값)을 가지는 영역에 의해 구분될 수 있다. 도 4에서는 3 개의 오브젝트들에만 부호를 기재하였으나, 도 4를 참조하면, 이진 이미지에는 다른 오브젝트들이 더 존재 함을 알 수 있다. 일 실시 예에서, 이미지 세그멘테이션부는 복수의 오브젝트들(431, 433, 435)에 기초하여 활물질 이미지 에 포함된 복수의 활물질들(411, 413, 415)을 세그멘테이션하여 세그멘테이션 이미지를 획득할 수 있 다. 일 실시 예에서, 이미지 세그멘테이션부는 워터쉐드(watershed) 알고리즘에 기초하여, 활물질 이미지 에 포함된 복수의 활물질들(411, 413, 415)을 세그멘테이션할 수 있다. 일 실시 예에서, 정보 추출부는 세그멘테이션 이미지에 포함되는 활물질 오브젝트들(451, 453, 455) 에 기초하여, 활물질들(411, 413, 415)에 대한 정보를 추출할 수 있다. 일 실시 예에서, 활물질들(411, 413, 415)에 대한 정보는 활물질의 평균 입경, 평균 둘레길이, 평균 구형도, 평균 종횡비, 평균 볼록성, 평균 솔리디 티(solidity), 또는 이들의 분포값에 대한 정보를 포함할 수 있다. 또한, 활물질들(411, 413, 415)에 대한 정보 는 활물질 각각의 개별적인 입경이나 둘레 길이, 구형도, 종횡비, 볼록성, 및/또는 솔리디티에 대한 정보도 포 함할 수 있다. 또한, 활물질들(411, 413, 415)에 대한 정보는 각 활물질의 분위값(예: 1 내지 99 %, 또는, D5, D50, D95 등)에 대한 정보도 포함할 수 있다. 도 5는, 본 개시의 일 실시 예에 따른 이미지 처리 장치의 활물질 이미지 처리 방법을 나타내는 흐름도이 다. 도 5를 참조하면, 동작 510에서, 이미지 처리 장치는 활물질(411, 413, 415)에 대한 활물질 이미지를 획득할 수 있다. 일 실시 예에서, 이미지 처리 장치는 이미지 획득 장치를 통해 활물질 이미지 를 획득할 수 있다. 동작 520에서, 이미지 처리 장치는 인공 지능 모델에 활물질 이미지를 입력함으로써, 이진 이미 지를 생성할 수 있다. 여기에서, 인공 지능 모델은 도 6에 의한 인공 지능 모델 학습 방법에 의해 학 습된 모델일 수 있다. 동작 530에서, 이미지 처리 장치는 이진 이미지에 포함된 복수의 오브젝트들(431, 433, 435)을 식별 할 수 있다. 동작 540에서, 이미지 처리 장치는 복수의 오브젝트들(431, 433, 435)에 기초하여 활물질 이미지에 포함된 복수의 활물질들(411, 413, 415)을 세그멘테이션하여 세그멘테이션 이미지를 획득할 수 있다. 일 실시 예에서, 이미지 처리 장치는 워터쉐드 알고리즘에 기초하여, 활물질 이미지에 포함된 복수의 활 물질들(411, 413, 415)을 세그멘테이션할 수 있다. 도 6은, 본 개시의 일 실시 예에 따른 이미지 처리 장치의 인공 지능 모델 학습 방법을 나타내는 흐름도이 다. 도 6의 동작들은 학습 데이터에 대한 첫 에포크 시 적용될 수 있다. 도 6을 참조하면, 동작 610에서, 이미지 처리 장치는 인공 지능 모델의 파라미터를 설정할 수 있다. 일 실시 예에서, 이미지 처리 장치는 초기 파라미터 값에 기초하여 인공 지능 모델의 파라미터를 설 정할 수 있다. 동작 615에서, 이미지 처리 장치는 i를 1로 설정할 수 있다. i는 학습 데이터에 포함된 이미지 셋의 인덱 스를 나타낼 수 있다. 여기에서, 이미지 셋은 기준 활물질 이미지 및 이에 대한 기준 이진 이미지를 포함할 수 있다. 동작 620에서, 이미지 처리 장치는 i번째 기준 활물질 이미지에 기초하여 출력 이미지 획득할 수 있다. 일 실시 예에서, 이미지 처리 장치는 인공 지능 모델에 i번째 기준 활물질 이미지를 입력함으로써, 출력 이미지를 생성할 수 있다. 동작 630에서, 이미지 처리 장치는 출력 이미지와 i번째 기준 이진 이미지 간의 차이가 기준 이하인지를 판단할 수 있다. 일 실시 예에서, 이미지 처리 장치는 손실 함수(또는 비용 함수)에 기초하여, 출력 이미 지와 i번째 기준 이진 이미지 간의 차이를 연산할 수 있다. 여기에서, 손실 함수는 평균 절대 오차 함수, 평균 제곱근 오차, 평균 제곱 오차 함수, 또는 이진 교차 엔트로피 손실 함수(binary cross entropy loss functio n)를 포함할 수 있다. 실시 예에 따라, 이진 교차 엔트로피 손실 함수는 두 개의 색상들(또는, 클래스들) 중 하나의 색상(예: 검은색 및 흰색 중 흰색)에 대해 1 내지 1000 사이의 가중치가 적용된 함수일 수 있다. 동작 630에서의 판단 결과, 차이가 기준 이하인 경우(예 판정), 이미지 처리 장치는 동작 650으로 진행할 수 있다. 동작 630에서의 판단 결과, 차이가 기준을 초과하는 경우(아니오 판정), 이미지 처리 장치는 동 작 640으로 진행할 수 있다. 동작 640에서, 이미지 처리 장치는 인공 지능 모델의 파라미터를 조정할 수 있다. 일 실시 예에서, 이미지 처리 장치는 차이가 지정된 기준값 이하이도록(또는, 최소값을 가지도록) 인공 지능 모델의 파라미터들을 조절할 수 있다. 일 실시 예에서, 이미지 처리 장치는 경사하강법에 기초한 알고리즘(예: Adam, SGD, Momentum)을 통해 차이가 지정된 기준값 이하이도록(또는, 최소값을 가지도록) 인공 지능 모델(14 5)의 파라미터들을 조절할 수 있다. 여기에서, 조절되는 가중치들은 러닝 레이트에 따라 결정될 수 있다. 러닝 레이트는 0.00000001 내지 0.1 사이에서 결정될 수 있다. 예시적으로 러닝 레이트는 0.0001일 수 있다. 동작 650에서, 이미지 처리 장치는 학습이 완료되었는지를 판단할 수 있다. 일 실시 예에서, i가 이미지 셋의 마지막을 나타내는 경우, 학습이 완료된 것으로 판단될 수 있다. 동작 650에서의 판단 결과, 학습이 완료된 경우(예 판정), 이미지 처리 장치는 도 6에 따른 동작들을 종료 할 수 있다. 동작 650에서의 판단 결과, 학습이 완료되지 않은 경우(아니오 판정), 이미지 처리 장치는 동 작 655로 진행할 수 있다. 동작 655에서, 이미지 처리 장치는 i의 값을 1 증가시킬 수 있다. 이후, 동작 620을 다시 수행할 수 있다. 본 개시에서는, 이미지 처리 장치가 활물질 이미지에 기초하여 이미지 처리 방법을 수행하는 것으로 예시 하였으나, 이는 예시일 뿐이다. 실시 예에 따라, 이미지 처리 장치는 활물질 이미지뿐만 아니라, 전구체 이미지에 대해서도 동일한 이미지 처리를 수행함으로써, 입자를 분리 및/또는 분석할 수 있다. 이미지 획득 장 치는 활물질 및/또는 전구체에 대한 이미지를 획득할 수 있다. 또한, 본 개시에서는, 활물질 이미지가 SEM 이미지인 것으로 예시하였으나, 이는 예시일 뿐이다. 실시 예에 따 라, 활물질 이미지는 TEM(transmission electron microscope), OM(optical microscope), SIM(structured illumination microscopy), 또는 FIB(fused ion beam)에 기반한 이미지로 대체될 수 있다. 상술한 바와 같은 이미지 처리 장치 및 이의 동작 방법은, 복수의 활물질들(411, 413, 415)에 대한 활물질 이미지를 획득하고, 인공 지능 모델에 상기 활물질 이미지를 입력하여 이진 이미지를 생성 하고, 상기 이진 이미지에 포함된 복수의 오브젝트들(431, 433, 435)을 식별한 후, 상기 복수의 오브젝트 들(431, 433, 435)에 기초하여 상기 활물질 이미지에 포함된 상기 복수의 활물질들(411, 413, 415)을 세그 멘테이션함으로써, 대량의 양극 활물질 입자의 형상 특성을 자동으로 정량 분석할 수 있다. 또한, 상술한 바와 같은 이미지 처리 장치 및 이의 동작 방법은, 사용자의 입력이 최소화되는 인공 지능 모델을 활용함으로써, 사용자에 따라 측정치가 달라지는 문제점을 최소화할 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2022-0175986", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 본 개시의 일 실시 예에 따른 이미지 처리 장치의 블록도이다. 도 2는, 본 개시의 일 실시 예에 따른 학습 데이터를 예시한다. 도 3은, 본 개시의 일 실시 예에 따른 인공 지능 모델을 예시한다. 도 4는, 본 개시의 일 실시 예에 따른 이미지 처리 장치의 이미지 처리에 따른 이미지들을 예시한다.도 5는, 본 개시의 일 실시 예에 따른 이미지 처리 장치의 활물질 이미지 처리 방법을 나타내는 흐름도이다. 도 6은, 본 개시의 일 실시 예에 따른 이미지 처리 장치의 인공 지능 모델 학습 방법을 나타내는 흐름도이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
