{"patent_id": "10-2020-0174190", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0084580", "출원번호": "10-2020-0174190", "발명의 명칭": "산업 현장의 충돌 경보 시스템", "출원인": "소프트온넷", "발명자": "김성용"}}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "특정 이동형 중장비에 설치되고, 제 1 카메라 및 제 2 카메라를 구비하는 3D 카메라를 적어도 하나 이상 포함하는 영상 촬영부;상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체,차량 객체 및 장애물 객체를 식별하고, 상기 3D 카메라 개별 개소에서 식별된 객체까지의 개별 거리를 계산하여소정의 값 미만인 경우 상기 특정 이동형 중장비와 해당 객체와의 충돌 위험이 있는 것으로 판단하여 제 1 충돌위험 신호를 송신하는 충돌 위험 판단 제어부; 및상기 충돌 위험 판단 제어부로부터 제 1 충돌 위험 신호를 수신하여 상기 특정 이동형 중장비와 해당 객체와의충돌 위험 경고 알람을 출력하는 충돌 위험 알람부;를 포함하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 충돌 위험 판단 제어부는,인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 딥러닝 학습을 통해 객체 형태 관련 인공신경망을 생성하는 인공지능부;상기 인공지능부의 인공신경망을 토대로 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하는 객체 식별부;상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리를 계산하는 객체 별 거리 계산부; 및상기 객체 별 거리 계산부에서 계산된 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의개별 거리가 소정의 값 미만인 경우 상기 특정 이동형 중장비와 해당 객체와의 충돌 위험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 1 충돌 위험 신호를 송신하는 충돌 위험 판단부;를 포함하는 것을 특징으로 하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 객체 별 거리 계산부는,상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체의 위상 차이 정보를 입력받아 상기 3D 카메라개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리를 계산하도록 구성되는 것을 특징으로 하는산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 충돌 위험 판단 제어부는,식별된 객체 간 거리를 더 계산하여 소정의 값 미만인 경우 해당 객체 간 충돌 위험이 있는 것으로 판단하여 제2 충돌 위험 신호를 송신하도록 구성되고,공개특허 10-2022-0084580-3-상기 충돌 위험 알람부는,상기 충돌 위험 판단 제어부로부터 제 2 충돌 위험 신호를 수신하여 해당 객체 간의 충돌 위험 경고 알람을 출력하도록 구성되는 것을 특징으로 하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 충돌 위험 판단 제어부는,인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 딥러닝 학습을 통해 객체 형태 관련 인공신경망을 생성하는 인공지능부;상기 인공지능부의 인공신경망을 토대로 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하는 객체 식별부;상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리를 계산하는 객체 별 거리 계산부;상기 객체 식별부에서 식별된 객체 간 거리를 계산하는 객체 간 거리 계산부; 및상기 객체 별 거리 계산부에서 계산된 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의개별 거리가 소정의 값 미만인 경우 상기 특정 이동형 중장비와 해당 객체와의 충돌 위험이 있는 것으로 판단하고 상기 충돌 위험 알람부로 제 1 충돌 위험 신호를 송신하고, 상기 객체 간 거리 계산부에서 계산된 상기 객체식별부에서 식별된 객체 간 거리가 소정의 값 미만인 경우 해당 객체 간 충돌 위험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 2 충돌 위험 신호를 송신하는 충돌 위험 판단부;를 포함하는 것을 특징으로 하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 객체 별 거리 계산부는,상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체의 위상 차이 정보를 입력받아 상기 3D 카메라개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리를 계산하도록 구성되고,상기 객체 간 거리 계산부는,상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체 별 공간 좌표 값 정보를 입력받아 상기 객체식별부에서 식별된 객체 간 거리를 계산하도록 구성되는 것을 특징으로 하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 충돌 위험 알람부는,경고음을 발산 출력하는 스피커부; 및 경고빛을 발광 출력하는 램프부;를 포함하여 구성되고,상기 충돌 위험 판단부로부터 수신하는 제 1 충돌 위험 신호와 제 2 충돌 위험 신호를 서로 구분되는 방식으로출력하도록 구성되는 것을 특징으로 하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2022-0084580-4-제1항에 있어서,상기 충돌 위험 판단 제어부에서 수행되는 객체 식별 기능, 거리 계산 기능, 위험 판단 기능의 결과를 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상 위에 표시하여 시각적으로 디스플레이하는 디스플레이부;를 더 포함하는 것을 특징으로 하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 영상 촬영부는,상기 특정 이동형 중장비 주변의 전 방위를 촬영 가능하도록 상기 3D 카메라를 복수개 포함하고, 복수개의 상기3D 카메라가 상기 특정 이동형 중장비 상측에 지면에 대해 방사상 형태로 배치되는 것을 특징으로 하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 영상 촬영부, 상기 충돌 위험 판단 제어부, 상기 충돌 위험 알람부 및 상기 디스플레이부는 하나의 임베디드 장치로 설치되는 것을 특징으로 하는 산업 현장의 충돌 경보 시스템."}
{"patent_id": "10-2020-0174190", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 산업 현장의 충돌 경보 시스템에 관한 것으로, 특정 이동형 중장비에 설치되고, 제 1 카메라 및 제 2 카메라를 구비하는 3D 카메라를 적어도 하나 이상 포함하는 영상 촬영부; 상기 영상촬영부의 상기 3D 카메라 개 별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하고, (뒷면에 계속)"}
{"patent_id": "10-2020-0174190", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 산업 현장의 충돌 경보 시스템에 관한 것으로, 더욱 상세하게는 특정 이동형 중장비에 설치되는 3D 카메라에서 촬영되는 영상을 분석하여 특정 이동형 중장비 주변의 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하고 보다 정확하게 특정 이동형 중장비와 주변 객체의 충돌 위험 여부를 판단하여 충돌 위험성을 경고함으로써 산업 현장의 작업 안정성을 향상시키는 산업 현장의 충돌 경보 시스템에 관한 것이다."}
{"patent_id": "10-2020-0174190", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 각종 산업 현장에는 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체가 존재한다. 여기서, 산업 현장이라 함은 공사장, 물류센터 등을 의미하고, 인체 객체는 해당 산업 현장에 있는 사람을 의미 하고, 이동형 중장비(작업 중에는 위치 고정될 수도 있음)는 산업 현장에서 작업을 위해 사용되는 지게차, 트랙 터, 굴삭기 등을 의미하고, 차량 객체는 산업 현장에 출입하는 승용차, 자재 운반 트럭 등을 의미하고, 장애물 객체는 산업 현장에 존재하는 벽체, 쌓아놓은 자재, 구조물 등을 의미한다. 이 경우, 산업 현장에서는, 특정 이동형 중장비를 기준으로 할 때, 특정 이동형 중장비와 주변의 인체 객체의 충돌 위험, 특정 이동형 중장비와 주변의 이동형 중장비 객체의 충돌 위험, 특정 이동형 중장비와 주변의 차량 객체의 충돌 위험, 및 특정 이동형 중장비와 주변의 장애물 객체의 충돌 위험이 존재한다. 실제로 산업 현장에서의 충돌로 사고 인하여, 매년 다수의 사상자를 발생시키고 있을 뿐만 아니라, 고가의 위험 물이 파손되는 인적 물적 손해가 발생하고 있다. 이러한 문제점을 해결하고자, 산업 현장의 충돌 경보 시스템과 관련된 선행기술로서, 한국등록특허공보 제10- 1736158호(특허문헌 1), 한국등록특허공보 제10-1695904호(특허문헌 2), 및 한국공개특허공보 제10-2016- 0127881호(특허문헌 3) 등이 개시된 바 있다. 그러나, 특허문헌 1 내지 특허문헌 3을 포함하는 종래의 산업 현장의 충돌 경보 시스템은 비콘 신호의 신호도착 시간(TOA; Time of arrival), 신호도착시간차이(TDOA; Time difference of arrival), 또는 수신신호강도(RSSI; Received signal strength indicator) 중 적어도 어느 하나의 거리 측정 방법을 이용하여 위험물과 작업자 간거리를 측정하여 충돌 위험 여부를 판단하지만, 비콘의 프로토콜 특성 상 정확한 거리 측정이 힘든 한계가 있다. 아울러, 종래의 산업 현장의 충돌 경보 시스템은 특정 객체를 기준으로 특정 객체와 다른 객체의 충돌 위험성 만을 경고할 수 있는 한계가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-1736158호(2017.05.17. 공고) (특허문헌 0002) 한국등록특허공보 제10-1695904호(2017.01.16. 공고) (특허문헌 0003) 한국공개특허공보 제10-2016-0127881호(2016.11.07. 공개)"}
{"patent_id": "10-2020-0174190", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해소함에 있어, 본 발명의 목적은 특정 이동형 중장비에 설치되는 3D 카메라에서 촬영되는 영 상을 분석하여 특정 이동형 중장비 주변의 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하 고 보다 정확하게 특정 이동형 중장비와 주변 객체의 충돌 위험 여부를 판단하여 충돌 위험성을 경고함으로써 산업 현장의 작업 안정성을 향상시키는 산업 현장의 충돌 경보 시스템을 제공함에 있다. 또한, 본 발명의 목적은 특정 이동형 중장비에 설치되는 3D 카메라에서 촬영되는 영상을 분석하여 특정 이동형 중장비 주변의 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하고 주변 객체 간의 충돌 위 험 여부를 더 판단하여 충돌 위험성을 경고함으로써 산업 현장의 작업 안정성을 더욱 향상시키는 산업 현장의 충돌 경보 시스템을 제공함에 있다."}
{"patent_id": "10-2020-0174190", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 특정 이동형 중장비에 설치되고, 제 1 카메라 및 제 2 카메라를 구비하는 3D 카메라를 적어도 하나 이상 포함하는 영상 촬영부; 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하 고, 상기 3D 카메라 개별 개소에서 식별된 객체까지의 개별 거리를 계산하여 소정의 값 미만인 경우 상기 특정 이동형 중장비와 해당 객체와의 충돌 위험이 있는 것으로 판단하여 제 1 충돌 위험 신호를 송신하는 충돌 위험 판단 제어부; 및 상기 충돌 위험 판단 제어부로부터 제 1 충돌 위험 신호를 수신하여 상기 특정 이동형 중장비 와 해당 객체와의 충돌 위험 경고 알람을 출력하는 충돌 위험 알람부;를 포함하여 구성된다. 이 경우, 상기 충돌 위험 판단 제어부는, 인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 딥러닝 학습을 통해 객체 형태 관련 인공신경망을 생성하는 인공지능부; 상기 인공지능부의 인공신 경망을 토대로 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하는 객체 식별부; 상기 3D 카메라 개별 개소에서 상기 객체 식 별부에서 식별된 객체까지의 개별 거리를 계산하는 객체 별 거리 계산부; 및 상기 객체 별 거리 계산부에서 계 산된 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리가 소정의 값 미만인 경 우 상기 특정 이동형 중장비와 해당 객체와의 충돌 위험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 1 충돌 위험 신호를 송신하는 충돌 위험 판단부;를 포함하여 구성되는 것이 바람직하다. 이때, 상기 객체 별 거리 계산부는, 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체의 위상 차이 정보를 입력받아 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리를 계 산하도록 구성되는 것이 바람직하다.한편, 상기 충돌 위험 판단 제어부는, 식별된 객체 간 거리를 더 계산하여 소정의 값 미만인 경우 해당 객체 간 충돌 위험이 있는 것으로 판단하여 제 2 충돌 위험 신호를 송신하도록 구성되고, 상기 충돌 위험 알람부는, 상 기 충돌 위험 판단 제어부로부터 제 2 충돌 위험 신호를 수신하여 해당 객체 간의 충돌 위험 경고 알람을 출력 하도록 구성되는 것이 바람직하다. 이 경우, 상기 충돌 위험 판단 제어부는, 인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 딥러닝 학습을 통해 객체 형태 관련 인공신경망을 생성하는 인공지능부; 상기 인공지능부의 인공신 경망을 토대로 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하는 객체 식별부; 상기 3D 카메라 개별 개소에서 상기 객체 식 별부에서 식별된 객체까지의 개별 거리를 계산하는 객체 별 거리 계산부; 상기 객체 식별부에서 식별된 객체 간 거리를 계산하는 객체 간 거리 계산부; 및 상기 객체 별 거리 계산부에서 계산된 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리가 소정의 값 미만인 경우 상기 특정 이동형 중장비와 해당 객체와의 충돌 위험이 있는 것으로 판단하고 상기 충돌 위험 알람부로 제 1 충돌 위험 신호를 송신하고, 상기 객체 간 거리 계산부에서 계산된 상기 객체 식별부에서 식별된 객체 간 거리가 소정의 값 미만인 경우 해당 객 체 간 충돌 위험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 2 충돌 위험 신호를 송신하는 충돌 위험 판단부;를 포함하여 구성되는 것이 바람직하다. 이때, 상기 객체 별 거리 계산부는, 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체의 위상 차이 정보를 입력받아 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리를 계 산하도록 구성되고, 상기 객체 간 거리 계산부는, 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체 별 공간 좌표 값 정보를 입력받아 상기 객체 식별부에서 식별된 객체 간 거리를 계산하도록 구성되는 것이 바람직하다. 또한, 상기 충돌 위험 알람부는, 경고음을 발산 출력하는 스피커부; 및 경고빛을 발광 출력하는 램프부;를 포함 하여 구성되고, 상기 충돌 위험 판단부로부터 수신하는 제 1 충돌 위험 신호와 제 2 충돌 위험 신호를 서로 구 분되는 방식으로 출력하도록 구성되는 것이 바람직하다. 한편, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 상기 충돌 위험 판단 제어부에서 수행되는 객 체 식별 기능, 거리 계산 기능, 위험 판단 기능의 결과를 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬 영되는 영상 위에 표시하여 시각적으로 디스플레이하는 디스플레이부;를 더 포함하여 구성될 수 있다. 한편, 상기 영상 촬영부는, 상기 특정 이동형 중장비 주변의 전 방위를 촬영 가능하도록 상기 3D 카메라를 복수 개 포함하고, 복수개의 상기 3D 카메라가 상기 특정 이동형 중장비 상측에 지면에 대해 방사상 형태로 배치되는 것이 바람직하다. 한편, 제1항에 있어서, 상기 영상 촬영부, 상기 충돌 위험 판단 제어부, 상기 충돌 위험 알람부 및 상기 디스플 레이부는 하나의 임베디드 장치로 설치되는 것이 바람직하다."}
{"patent_id": "10-2020-0174190", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이, 본 발명에 의한 산업 현장의 충돌 경보 시스템은 특정 이동형 중장비에 설치되는 3D 카메라 에서 촬영되는 영상을 분석하여 특정 이동형 중장비 주변의 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애 물 객체를 식별하고 보다 정확하게 특정 이동형 중장비와 주변 객체의 충돌 위험 여부를 판단하여 충돌 위험성 을 경고함으로써 산업 현장의 작업 안정성을 향상시킨다. 아울러, 본 발명에 의한 산업 현장의 충돌 경보 시스템은 특정 이동형 중장비에 설치되는 3D 카메라에서 촬영되 는 영상을 분석하여 특정 이동형 중장비 주변의 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하고 주변 객체 간의 충돌 위험 여부를 더 판단하여 충돌 위험성을 경고함으로써 산업 현장의 작업 안정성 을 더욱 향상시킨다."}
{"patent_id": "10-2020-0174190", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 있어 첨부된 도면은 종래 기술과의 차별성 및 명료성, 그리고 기술 파악의 편의를 위해 과장된 표현 으로 도시되어 있을 수 있다. 또한, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어로써, 작업 자, 운용자의 의도 또는 관례에 따라 달라질 수 있으므로, 이러한 용어들에 대한 정의는 본 명세서 전반에 걸친 기술적 내용을 토대로 내려져야 할 것이다. 한편, 실시예는 본 발명의 청구범위에 제시된 구성요소의 예시적 사 항에 불과하고, 본 발명의 권리범위를 한정하는 것이 아니며, 권리범위는 본 발명의 명세서 전반에 걸친 기술적 사상을 토대로 해석되어야 한다. 도 1은 산업 현장에서의 충돌 위험을 설명하기 위한 개념도이고, 도 2는 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템을 설명하기 위한 블록 구성도이며, 도 3은 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템의 일 동작예를 설명하기 위한 순서 흐름도이다. 먼저, 도 1을 참조하면, 산업 현장에서는, 특정 이동형 중장비를 기준으로 할 때, 그 주변에 인체 객체 , 이동형 중장비 객체, 차량 객체 및 장애물 객체가 존재할 수 있는 영역이 존재한다. 전술한 바와 같이, 산업 현장이라 함은 공사장, 물류센터 등을 의미하고, 인체 객체는 해당 산업 현장에 있 는 사람을 의미하고, 이동형 중장비(특정 이동형 중장비 및 이동형 중장비 객체 / 작업 중에는 위치 고 정될 수도 있음)는 산업 현장에서 작업을 위해 사용되는 지게차, 트랙터, 굴삭기 등을 의미하고, 차량 객체(4 0)는 산업 현장에 출입하는 승용차, 자재 운반 트럭 등을 의미하고, 장애물 객체는 산업 현장에 존재하는 벽체, 쌓아놓은 자재, 구조물 등을 의미한다. 이 경우, 산업 현장에서는, 상기 특정 이동형 중장비를 기준으로 할 때, 상기 특정 이동형 중장비와 주 변의 인체 객체의 충돌 위험, 상기 특정 이동형 중장비와 주변의 이동형 중장비 객체의 충돌 위험, 상기 특정 이동형 중장비와 주변의 차량 객체의 충돌 위험, 및 상기 특정 이동형 중장비와 주변의 장애물 객체의 충돌 위험이 존재한다.(도 1의 파란색 화살표 참조) 아울러, 산업 현장에서는, 상기 특정 이동형 중장비 주변의 객체(20, 30, 40, 50) 간의 10가지 종류의 충돌 위험도 존재한다. 즉, 산업 현장에서는, 상기 특정 이동형 중장비 주변의 인체 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 이동형 중장비 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주 변의 차량 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 장애물 개체 간의 충돌 위험(예: 장애물 객체의 위치를 옮길 때), 상기 특정 이동형 중장비 주변의 인체 객체와 이동형 중장비 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 인체 객체와 차량 객체 간의 충돌 위험, 상 기 특정 이동형 중장비 주변의 인체 객체와 장애물 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 이동형 중장비 객체와 차량 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 이 동형 중장비 객체와 장애물 객체 간의 충돌 위험, 및 상기 특정 이동형 중장비 주변의 차량 객체 와 장애물 객체 간의 충돌 위험이 존재한다. (도 1의 빨간색 화살표 참조) 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은 이러한 충돌 위험을 경고하기 위한 시스템으로, 이하, 도 1 및 도 3을 참조하여 상술한다. 도 1 내지 도 3을 참조하면, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 영상 촬영부 , 충돌 위험 판단 제어부 및 충돌 위험 알람부를 포함하여 구성된다. 이때, 본 발명의 실시 예에 따른 산업 현장의 충돌 경보 시스템은, 디스플레이부를 더 포함하여 구성될 수 있다. 상기 영상 촬영부는, 상기 특정 이동형 중장비에 설치되고, 제 1 카메라 및 제 2 카메라(111 2)를 구비하는 3D 카메라를 적어도 하나 이상 포함하는 구성이다.한편, 상기 영상 촬영부는, 상기 특정 이동형 중장비 주변의 전 방위를 촬영 가능하도록 상기 3D 카 메라를 복수개 포함하고, 복수개의 상기 3D 카메라가 상기 특정 이동형 중장비 상측에 지면에 대해 방사상 형태로 배치되는 것이 바람직하다. 즉, 상기 영상 촬영부는, 상기 특정 이동형 중장비의 이동 중 주변의 전 방위 영상을 촬영할 수 있도록 구성되는 것이 바람직하다. 상기 영상 촬영부는, 이외에도, 촬영 영상을 처리하는 VMS(Video Management System, 비디오 관리 시스 템)부, 촬영 영상을 저장하는 영상 데이터베이스부, 촬영 영상 정보를 상기 충돌 위험 판단 제어부 에 송신할 수 있도록 구성되는 통신부를 더 포함하여 구성될 수 있다. 상기 영상 촬영부는, 상기 충돌 위험 판단 제어부로 객체 별 위상 차이 정보 및 공간 좌표 값 정보 를 제공할 수 있도록 구성될 수 있다. 상기 충돌 위험 판단 제어부는, 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하고, 상기 3D 카메라 개별 개소에서 식별된 객체까지의 개별 거리를 계산하여 소정의 값 미만인 경우 상기 특정 이 동형 중장비와 해당 객체와의 충돌 위험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 1 충돌 위험 신호를 송신하는 구성이다. 이 경우, 상기 충돌 위험 판단 제어부는, 식별된 객체 간 거리를 더 계산하여 소정의 값 미만인 경우 해 당 객체 간 충돌 위험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 2 충돌 위험 신호를 송신하도 록 구성되는 것이 바람직하다. 이 때, 상기 충돌 위험 판단 제어부는, 이러한 객체 식별 기능, 거리 계산 기능, 위험 판단 기능을 수행 하기 위하여, 인공지능부, 객체 식별부, 객체 별 거리 계산부, 객체 간 거리 계산부 및 충돌 위험 판단부를 포함하여 구성될 수 있다. 상기 인공지능부는, 인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 딥러닝 학습을 통해 객체 형태 관련 인공신경망을 생성하는 구성이다. 보다 구체적으로, 상기 인공지능부는, 외부 소스(인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 공지된 오픈 이미지 자료 제공처) 또는 상기 영상 촬영부로부터 다양한 인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 이미지 정보를 입력받을 수 있도 록 구성될 수 있다. 이때, 상기 인공지능부는, 외부 소스 또는 상기 영상 촬영부로부터 입력되는 인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 이미지 정보를 활용하여 산 업 현장에서 예상 가능한 인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태를 모델화 하여 복수의 학습 형태 데이터를 생성 및 축적하는 학습 전 형태 준비부와, 상기 학습 전 형태 준비부 에서 생성되는 학습 형태 데이터에 대해 외부 소스 또는 상기 영상 촬영부로부터 입력되는 이미지 정보를 이용하여 산업 현장에서 발생할 수 있는 날씨 변화, 주변 물체 변화, 시간에 기초한 색상 또는 음영 변 화와 같은 환경 변화를 반영하고 모델화하여 학습 복합 데이터 세트를 생성 및 축적하는 학습 전 환경 준비부 와, 상기 학습 전 형태 준비부에서 생성되는 학습 형태 데이터 및 상기 학습 전 환경 준비부(121 2)에서 생성되는 학습 복합 데이터 세트를 기초로 학습을 통해 산업 현장에서의 인체 객체 여부, 이동형 중장비 객체 여부, 차량 객체 여부, 및 장애물 객체 여부를 결정하는 학습된 인공신경망을 생성하여 제공하는 객체 형 태 학습부를 포함하여 구성될 수 있다. 이러한 딥러닝 기술과 관련하여는, 본 출원인의 선출원에 의한 한국등록특허 제10-2019031호 등 다수의 기술이 공지되어 있는 바, 본 발명의 간명한 설명을 위하여 자세한 설명을 생략한다. 상기 객체 식별부는, 상기 인공지능부의 인공신경망을 토대로 상기 영상촬영부의 상기 3D 카 메라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하는 구성이다. 상기 객체 별 거리 계산부는, 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리를 계산하는 구성이다. 이때, 상기 객체 별 거리 계산부는, 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식 별된 객체의 위상 차이 정보(상기 제 1 카메라와 상기 제 2 카메라의 위치 차이에 기인함)를 입력받아 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리를 계산하 도록 구성되는 것이 바람직하다. 이러한 상기 개체 별 거리 계산부는, 산업 현장에서 상기 특정 이동형 중장비를 기준으로 할 때, 상 기 특정 이동형 중장비와 주변의 인체 객체의 충돌 위험, 상기 특정 이동형 중장비와 주변의 이동 형 중장비 객체의 충돌 위험, 상기 특정 이동형 중장비와 주변의 차량 객체의 충돌 위험, 및 상기 특정 이동형 중장비와 주변의 장애물 객체의 충돌 위험을 판단하기 위하여 거리 계산을 수행하도록 구 성된다. 상기 객체 간 거리 계산부는, 상기 객체 식별부에서 식별된 객체 간 거리를 계산하는 구성이다. 이때, 상기 객체 간 거리 계산부는, 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식 별된 객체 별 공간 좌표 값 정보를 입력받아 상기 객체 식별부에서 식별된 객체 간 거리를 계산하도록 구 성되는 것이 바람직하다. 이러한 상기 개체 별 거리 계산부는, 산업 현장에서 상기 특정 이동형 중장비 주변의 인체 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 이동형 중장비 객체 간의 충돌 위험, 상기 특정 이동 형 중장비 주변의 차량 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 장애물 개체 간 의 충돌 위험(예: 장애물 객체의 위치를 옮길 때), 상기 특정 이동형 중장비 주변의 인체 객체와 이동형 중장비 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 인체 객체와 차량 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 인체 객체와 장애물 객체 간의 충돌 위험, 상기 특정 이동형 중장비 주변의 이동형 중장비 객체와 차량 객체 간의 충돌 위험, 상기 특정 이동형 중 장비 주변의 이동형 중장비 객체와 장애물 객체 간의 충돌 위험, 및 상기 특정 이동형 중장비 주변의 차량 객체와 장애물 객체 간의 충돌 위험상기 특정 이동형 중장비를 기준으로 할 때, 상기 특정 이동형 중장비와 주변의 인체 객체의 충돌 위험, 상기 특정 이동형 중장비와 주변의 이동형 중장비 객체의 충돌 위험, 상기 특정 이동형 중장비와 주변의 차량 객체의 충돌 위험, 및 상기 특 정 이동형 중장비와 주변의 장애물 객체 의 충돌 위험을 판단하기 위하여 거리 계산을 수행하도록 구성 된다. 상기 충돌 위험 판단부는, 상기 객체 별 거리 계산부에서 계산된 상기 3D 카메라 개별 개소 에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리가 소정의 값 미만인 경우 상기 특정 이동형 중 장비와 해당 객체와의 충돌 위험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 1 충돌 위험 신호를 송신하고, 상기 객체 간 거리 계산부에서 계산된 상기 객체 식별부에서 식별된 객체 간 거 리가 소정의 값 미만인 경우 해당 객체 간 충돌 위험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 2 충돌 위험 신호를 송신하는 구성이다. 상기 충돌 위험 판단 제어부는, 이외에도, 외부 소스, 상기 영상 촬영부, 상기 충돌 위험 알람부 , 상기 디스플레이부와 통신 가능한 통신부와, 상기 충돌 위험 판단 제어부에서 수행 되는 상기 인공지능부(별도의 데이터베이스부를 가질 수도 있다.)의 데이터, 객체 식별 결과 데이터, 거 리 계산 결과 데이터, 위험 판단 결과 데이터 등을 저장하는 데이터베이스부를 더 포함하여 구성될 수 있 다. 상기 충돌 위험 알람부는, 상기 충돌 위험 판단 제어부로부터 제 1 충돌 위험 신호를 수신하여 상 기 특정 이동형 중장비와 해당 객체와의 충돌 위험 경고 알람을 출력하고, 상기 충돌 위험 판단 제어부로 부터 제 2 충돌 위험 신호를 수신하여 해당 객체 간의 충돌 위험 경고 알람을 출력하는 구성이다. 상기 충돌 위험 알람부는, 경고음을 발산 출력하는 스피커부 및 경고빛을 발광 출력하는 램프부 를 포함하여 구성될 수 있다. 상기 충돌 위험 알람부는, 상기 특정 이동형 중장비에 설치될 수 있다. 상기 스피커부는 음성 또는 기계음 형태로 경고음을 다양한 방식(예: 경고음을 패턴화시키는 방식 등) 발 산 출력하도록 구성될 수 있고, 상기 램프부(예: 산업 현장에 흔히 사용되는 경광등 일 수 있다.)는 경고 빛을 다양한 방식(예: 점멸 패턴화시키는 방식, 색 변화 패턴화시키는 방식 등)으로 발광 출력하도록 구성될 수 있다.상기 충돌 위험 알람부는, 상기 충돌 위험 판단 제어부로부터 수신하는 제 1 충돌 위험 신호와 제 2 충돌 위험 신호를 서로 구분되는 방식(예: \"충돌 위험!\"과 \"다른 물체와 충돌 위험!\"으로 나래이션 구분, 상 이한 경고음 패턴으로 구분 등)으로 출력하도록 구성되는 것이 바람직하다. 즉, 상기 충돌 위험 알람부는, 제 1 충돌 위험 신호가 상기 특정 이동형 중장비와 다른 객체의 충돌 위험을 의미하고, 제 2 충돌 위험 신호가 다른 객체 간의 충돌 위험을 의미하기 때문에 서로 구분되는 방식으로 출력하도록 구성되는 것이 바람직하다. 더 나아가, 상기 특정 이동형 중장비와 복수개의 객체의 충돌 위험이 감지되어 제 1 충돌 위험 신호가 복수개 입력되거나, 다른 객체 간의 복수개의 충돌 위험이 감지되어 제 2 충돌 위험 신호가 감지된 경우, 복수개의 제 1 충돌 위험 신호 간에 또는 복수개의 제 1 충돌 위험 신호 간에 서로 구분되는 방식으로 출 력하도록 구성되는 것이 더욱 바람직하다. 상기 충돌 위험 알람부에 대해서는 기 공지된 다양한 기술을 채용할 수 있을 것이다. 상기 충돌 위험 알람부는, 이외에도, 상기 충돌 위험 판단 제어부와 통신 가능한 통신부를 더 포함하여 구성될 수 있다. 상기 디스플레이부는, 상기 충돌 위험 판단 제어부에서 수행되는 객체 식별 기능, 거리 계산 기능, 위험 판단 기능의 결과를 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상 위에 표 시하여 시각적으로 디스플레이하는 구성이다. 상기 디스플레이부는, 산업 현장 통제실의 모니터일 수 있고(이때, 통제실 컴퓨터에는 상기 충돌 위험 판 단 제어부의 정보를 출력하는 소프트웨어가 설치될 수 있다.), 상기 특정 이동형 중장비의 특정 부분 (예: 운전석이 있는 경우의 핸들 옆 부분)에 설치된 모니터링 디스플레이기일 수 있으며, 이 밖에도 기 공지된 모니터링 디스플레이기 기술을 채용하여 다양한 방식으로 구현될 수 있을 것이다. 상기 디스플레이부는, 이외에도, 상기 충돌 위험 판단 제어부와 통신 가능한 통신부를 더 포 함하여 구성될 수 있다. 한편, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템에서, 상기 영상 촬영부, 상기 충돌 위험 판단 제어부, 상기 충돌 위험 알람부 및 상기 디스플레이부는 하나의 임베디드 장치 (Embedded device)로 설치될 수 있다. 이때, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은 기존의 이동형 중장비에 장착 탑재 설치 하여 사용될 수 있다. 한편, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템에서, 상기 통신부(1140, 1260, 1330, 1410) 간에는 유선 또는 무선 통신 방식(와이파이(Wife) 방식, 지그비(Zigbee) 방식, 지웨이브(Z-Wave) 방식, 블루투스(Bluetooth) 방식, 엔에프씨(NFC) 방식 등)의 적용이 가능하며, 각 구성에 인가되는 전원 공급 구성에 대해서는 다수의 공지된 기술을 적용할 수 있으므로 자세한 설명을 생략한다. 이하, 특히 도 3을 참조하여 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템의 일 동작예를 설명 한다. 먼저, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 산업 현장에서의 인체 객체 여부, 이동 형 중장비 객체 여부, 차량 객체 여부, 및 장애물 객체 여부를 결정하는 학습된 인공신경망을 생성하는 인공신 경망 생성 단계(S10)를 수행(S1)한다. 보다 구체적으로, 인공신경망 생성 단계(S10)는, 상기 인공지능부의 학습 전 형태 준비부가 외부 소스 또는 상기 영상 촬영부로부터 입력되는 인체 객체 형태, 이동형 중장비 객체 형태, 차량 객체 형태 및 장애물 형태에 관한 이미지 정보를 활용하여 산업 현장에서 예상 가능한 인체 객체 형태, 이동형 중장비 객 체 형태, 차량 객체 형태 및 장애물 형태를 모델화하여 복수의 학습 형태 데이터를 생성 및 축적하고, 상기 학 습 전 환경 준비부가 상기 학습 전 형태 준비부에서 생성되는 학습 형태 데이터에 대해 외부 소스또는 상기 영상 촬영부로부터 입력되는 이미지 정보를 이용하여 산업 현장에서 발생할 수 있는 날씨 변화, 주변 물체 변화, 시간에 기초한 색상 또는 음영 변화와 같은 환경 변화를 반영하고 모델화하여 학습 복합 데이터 세트를 생성 및 축적한 후, 상기 객체 형태 학습부가 상기 학습 전 형태 준비부에서 생성되 는 학습 형태 데이터 및 상기 학습 전 환경 준비부에서 생성되는 학습 복합 데이터 세트를 기초로 학습을 통해 산업 현장에서의 인체 객체 여부, 이동형 중장비 객체 여부, 차량 객체 여부, 및 장애물 객체 여부를 결정 하는 학습된 인공신경망을 생성하여 제공하는 방식으로 수행될 수 있다. 이어, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 상기 영상촬영부의 상기 3D 카메 라 개별 개소에서 촬영되는 영상을 분석하여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하는 객체 식별 단계(S20)를 수행한다. 보다 구체적으로, 상기 객체 식별 단계(S20)는, 상기 객체 식별부가 인공신경망 생성 단계(S10)에서 생성 된 인공신경망을 토대로 상기 영상촬영부의 상기 3D 카메라 개별 개소에서 촬영되는 영상을 분석하 여 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하는 방식으로 수행될 수 있다. 이어, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 상기 3D 카메라 개별 개소에서 상기 객체 식별 단계(S20)에서 식별된 객체까지의 개별 거리를 계산하는 객체 별 거리 계산 단계(S30)를 수행한 다. 보다 구체적으로, 상기 객체 별 거리 계산 단계(S30)는, 상기 객체 별 거리 계산부가 상기 3D 카메라 개별 개소에서 상기 객체 식별 단계(S20)에서 식별된 객체의 위상 차이 정보(상기 제 1 카메라와 상기 제 2 카메라의 위치 차이에 기인함)를 입력받아 상기 3D 카메라 개별 개소에서 상기 객체 식 별 단계(S20)에서 식별된 객체까지의 개별 거리를 계산하는 방식으로 수행될 수 있다. 이어, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 상기 3D 카메라 개별 개소에서 상기 객체 식별 단계(S20)에서 식별된 객체 간 거리를 계산하는 객체 간 거리 계산 단계(S40)를 수행한다. 보다 구체적으로, 상기 객체 간 거리 계산 단계(S40)는, 상기 객체 간 거리 계산부가 상기 3D 카메라 개별 개소에서 상기 객체 식별 단계(S20)에서 식별된 객체 별 공간 좌표 값 정보를 입력받아 상기 객체 식별 단계(S20)에서 식별된 객체 간 거리를 계산하는 방식으로 수행될 수 있다. 이어, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 상기 객체 별 거리 계산 단계(S30)에서 계산된 상기 3D 카메라 개별 개소에서 상기 객체 식별부에서 식별된 객체까지의 개별 거리와 상기 객체 간 거리 계산 단계(S40)에서 계산된 상기 객체 식별부에서 식별된 객체 간 거리를 토대로 충돌 위험 여부를 판단하여 충돌 위험 신호를 송신하는 충돌 위험 판단 단계(S50)을 수행한다. 보다 구체적으로, 상기 충돌 위험 판단 단계(S50)는, 상기 충돌 위험 판단부가 상기 객체 별 거리 계산 단계(S30)에서 계산된 상기 3D 카메라 개별 개소에서 상기 객체 식별 단계(S20)에서 식별된 객체까지의 개별 거리가 소정의 값 미만인 경우 상기 특정 이동형 중장비와 해당 객체와의 충돌 위험이 있는 것으로 판 단하여 상기 충돌 위험 알람부로 제 1 충돌 위험 신호를 송신하고, 상기 객체 간 거리 계산 단계(S40)에 서 계산된 상기 객체 식별 단계(S20)에서 식별된 객체 간 거리가 소정의 값 미만인 경우 해당 객체 간 충돌 위 험이 있는 것으로 판단하여 상기 충돌 위험 알람부로 제 2 충돌 위험 신호를 송신하는 방식으로 수행될 수 있다. 이어, 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템은, 상기 충돌 위험 판단 단계(S50)에서 송 신되는 충돌 위험 신호를 토대로 충돌 위험 경고 알람을 출력하는 충돌 위험 경고 알람 출력 단계(S60)를 수행 한다. 보다 상세하게는, 상기 충돌 위험 경고 알람 출력 단계(S60)는, 상기 충돌 위험 알람부가 충돌 위험 판단 단계(S50)에서 제 1 충돌 위험 신호를 수신하여 상기 특정 이동형 중장비와 해당 객체와의 충돌 위험 경고 알람 을 출력하고, 충돌 위험 판단 단계(S50)에서 제 2 충돌 위험 신호를 수신하여 해당 객체 간의 충돌 위험 경고 알람을 출력하는 방식으로 수행될 수 있다. 이때, 전술한 바와 같이, 상기 충돌 위험 알람부는, 상기 충 돌 위험 판단 제어부로부터 수신하는 제 1 충돌 위험 신호와 제 2 충돌 위험 신호를 서로 구분되는 방식 으로 출력하도록 구성되는 것이 바람직하다.이상에서와 같이, 본 발명에 의한 산업 현장의 충돌 경보 시스템은 특정 이동형 중장비에 설치되는 3D 카메라에 서 촬영되는 영상을 분석하여 특정 이동형 중장비 주변의 인체 객체, 이동형 중장비 객체, 차량 객체 및 장애물 객체를 식별하고 보다 정확하게 특정 이동형 중장비와 주변 객체의 충돌 위험 여부를 판단하여 충돌 위험성을 경고함으로써 산업 현장의 작업 안정성을 향상시키고, 주변 객체 간의 충돌 위험 여부를 더 판단하여 충돌 위험 성을 경고함으로써 산업 현장의 작업 안정성을 더욱 향상시킨다. 상술한 바와 같이, 본 발명은 도면에 도시된 실시예를 참고로 하여 설명되었으나 이는 예시적인 것에 불과하며, 당해 기술이 속하는 분야에서 통상의 지식을 기초로 다양한 변형 및 균등한 다른 실시예가 가능하다는 점을 이 해해야 한다. 따라서 본 발명의 진정한 기술적 보호범위는 이하 기술할 청구범위에 의하며, 상술한 발명의 구체 적 내용을 토대로 정해져야 할 것이다. 산업상 이용가능성 본 발명은 산업 현장의 충돌 경보 시스템에 관한 것으로, 산업 현장의 안전과 관련된 산업 분야에 이용 가능하 다."}
{"patent_id": "10-2020-0174190", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 산업 현장에서의 충돌 위험을 설명하기 위한 개념도이다. 도 2는 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템을 설명하기 위한 블록 구성도이다. 도 3은 본 발명의 실시예에 따른 산업 현장의 충돌 경보 시스템의 일 동작예를 설명하기 위한 순서 흐름도이다."}
