{"patent_id": "10-2022-0011583", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0115065", "출원번호": "10-2022-0011583", "발명의 명칭": "통신 시스템에서 EPS 폴백을 가속화 하기 위한 사전 측정 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "투 팜티민"}}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 전자 장치에 의해 수행되는 방법에 있어서,기지국이 VoNR(voice over new radio)을 지원하는지 여부를 확인하는 과정;상기 기지국이 VoNR을 지원하지 않는 것으로 확인되면, 상기 기지국으로부터 셀 리스트에 대한 정보를 획득하는과정;상기 셀 리스트에 대한 측정이 트리거(trigger) 되는지 여부를 확인하는 과정;상기 측정이 트리거 된 것으로 확인되면, 상기 셀 리스트에 포함된 다수의 셀들에 대한 측정을 수행하는 과정;상기 측정의 결과에 기반하여, 상기 다수의 셀들 중에서 하나 이상의 후보 셀들을 확인하는 과정;상기 하나 이상의 후보 셀들에 대한 정보를 상기 기지국에게 전송하는 과정; 및상기 기지국으로부터 핸드오버 명령을 수신하는 과정을 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 단말이 상기 측정을 수행할 수 있는지 여부를 지시하는 정보를 포함하는 등록 요청 메시지를 상기 기지국에게 전송하는 과정; 및상기 기지국으로부터, 상기 기지국이 상기 측정을 수행할 수 있는지 여부를 지시하는 정보를 포함하는 등록 승인 메시지를 상기 기지국으로부터 수신하는 과정을 더 포함하고,상기 측정은 상기 단말 및 상기 기지국이 상기 측정을 수행할 수 있는 경우에 수행되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 셀 리스트에 대한 정보를 획득하는 과정은,상기 셀 리스트에 대한 정보에 대한 요청 메시지를 상기 기지국에게 전송하는 과정; 및상기 기지국으로부터, 상기 셀 리스트에 대한 정보를 포함하는 시스템 정보를 수신하는 과정을 더 포함하고,상기 단말은 RRC(radio resource control) 연결 상태인 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 셀 리스트에 대한 정보를 획득하는 과정은,상기 기지국으로부터, 상기 셀 리스트에 대한 정보를 포함하는 RRC(radio resource control) 해제 메시지를 수신하는 과정;상기 RRC 해제 메시지에 기반하여, 상기 단말이 RRC 비활성 상태 또는 RRC 유휴 상태로 천이하는 과정을 더 포함하고,공개특허 10-2023-0115065-3-상기 측정은 상기 RRC 비활성 상태 또는 상기 RRC 유휴 상태에서 수행되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 기지국이 VoNR을 지원하는지 여부는 상기 단말의 로컬 데이터베이스(local database) 또는 NR 셀 리스트에기반하여 확인되고,상기 로컬 데이터베이스는 PLMN(public land mobile network), 운영자 지원 정보 또는 상기 기지국의 위치 커버리지 정보 중 적어도 하나를 포함하고,상기 NR 셀 리스트는 상기 단말이 캠프 온(camp on)한 셀들에 대한 정보를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 셀 리스트에 대한 측정은 사용자 입력에 기반하여 트리거 되고,상기 사용자 입력은 통화 어플리케이션 상에서 전화번호가 입력되는 경우 또는 SMS(short message service) 어플리케이션 상에서 SMS가 입력되는 경우 중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 하나 이상의 후보 셀들에 대한 정보는 INVITE 메시지가 송수신 된 경우, 상기 기지국에게 전송되고,상기 하나 이상의 후보 셀들에 대한 정보는 RRC(radio resource control) 재개 완료 메시지 또는 RRC 셋업 완료메시지에 포함되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 하나 이상의 후보 셀들은 상기 다수의 셀들 중에서 수신 신호 세기가 임계 값 이상인 셀들에 해당하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,타겟 셀로 핸드오버를 수행하는 과정; 및상기 타겟 셀을 통해 VoLTE(voice over long term evolution)를 수행하는 과정을 더 포함하고,상기 핸드오버 명령은 상기 하나 이상의 후보 셀들 중에서 선택된 상기 타겟 셀에 대한 정보를 포함하는 것을특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서,공개특허 10-2023-0115065-4-상기 기지국이 SMSoIMS(short message service over internet protocol multimedia system) 및 SMSoNAS(shortmessage service over non-stratum access)를 지원하는지 여부를 확인하는 과정; 및상기 기지국이 상기 SMSoIMS 및 상기 SMSoNAS를 지원하지 않는 것으로 확인되면, 사용자 입력에 기반하여, 상기기지국에게 시스템 정보를 요청하는 과정;상기 기지국으로부터 상기 셀 리스트에 대한 정보를 포함하는 상기 시스템 정보를 수신하는 과정;사용자의 SMS 입력에 기반하여, 상기 측정을 수행하는 과정을 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "무선 통신 시스템의 전자 장치에 있어서, 상기 전자 장치는,적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서에 동작 가능하게 연결된 적어도 하나의 송수신기를 포함하고, 상기 적어도 하나의프로세서는,기지국이 VoNR(voice over new radio)을 지원하는지 여부를 확인하고,상기 기지국이 VoNR을 지원하지 않는 것으로 확인되면, 상기 기지국으로부터 셀 리스트에 대한 정보를획득하고,상기 셀 리스트에 대한 측정이 트리거(trigger) 되는지 여부를 확인하고,상기 측정이 트리거 된 것으로 확인되면, 상기 셀 리스트에 포함된 다수의 셀들에 대한 측정을 수행하고,상기 측정의 결과에 기반하여, 상기 다수의 셀들 중에서 하나 이상의 후보 셀들을 확인하고,상기 하나 이상의 후보 셀들에 대한 정보를 상기 기지국에게 전송하고,상기 기지국으로부터 핸드오버 명령을 수신하도록 구성되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 적어도 하나의 프로세서는,상기 단말이 상기 측정을 수행할 수 있는지 여부를 지시하는 정보를 포함하는 등록 요청 메시지를 상기 기지국에게 전송하고,상기 기지국으로부터, 상기 기지국이 상기 측정을 수행할 수 있는지 여부를 지시하는 정보를 포함하는 등록 승인 메시지를 상기 기지국으로부터 수신하도록 더 구성되고,상기 측정은 상기 단말 및 상기 기지국이 상기 측정을 수행할 수 있는 경우에 수행하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 적어도 하나의 프로세서는,상기 셀 리스트에 대한 정보에 대한 요청 메시지를 상기 기지국에게 전송하고,상기 기지국으로부터, 상기 셀 리스트에 대한 정보를 포함하는 시스템 정보를 수신하도록 더 구성되고,상기 단말은 RRC(radio resource control) 연결 상태인 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2023-0115065-5-제11항에 있어서, 상기 적어도 하나의 프로세서는,상기 기지국으로부터, 상기 셀 리스트에 대한 정보를 포함하는 RRC(radio resource control) 해제 메시지를 수신하고,상기 RRC 해제 메시지에 기반하여, 상기 단말이 RRC 비활성 상태 또는 RRC 유휴 상태로 천이하도록 더구성되고,상기 측정은 상기 RRC 비활성 상태 또는 상기 RRC 유휴 상태에서 수행되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 기지국이 VoNR을 지원하는지 여부는 상기 단말의 로컬 데이터베이스(local database) 또는 NR 셀 리스트에기반하여 확인되고,상기 로컬 데이터베이스는 PLMN(public land mobile network), 운영자 지원 정보 또는 상기 기지국의 위치 커버리지 정보 중 적어도 하나를 포함하고,상기 NR 셀 리스트는 상기 단말이 캠프 온(camp on)한 셀들에 대한 정보를 포함하는 것을 특징으로 하는 전자장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 셀 리스트에 대한 측정은 사용자 입력에 기반하여 트리거 되고,상기 사용자 입력은 통화 어플리케이션 상에서 전화번호가 입력되는 경우 또는 SMS(short message service) 어플리케이션 상에서 SMS가 입력되는 경우 중 적어도 하나를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 하나 이상의 후보 셀들에 대한 정보는 INVITE 메시지가 송수신 된 경우, 상기 기지국에게 전송되고,상기 하나 이상의 후보 셀들에 대한 정보는 RRC(radio resource control) 재개 완료 메시지 또는 RRC 셋업 완료메시지에 포함되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 하나 이상의 후보 셀들은 상기 다수의 셀들 중에서 수신 신호 세기가 임계 값 이상인 셀들에 해당하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서, 상기 적어도 하나의 프로세서는,타겟 셀로 핸드오버를 수행하고,상기 타겟 셀을 통해 VoLTE(voice over long term evolution)를 수행하도록 더 구성되고,공개특허 10-2023-0115065-6-상기 핸드오버 명령은 상기 하나 이상의 후보 셀들 중에서 선택된 상기 타겟 셀에 대한 정보를 포함하는 것을특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0011583", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제12항에 있어서, 상기 적어도 하나의 프로세서는,상기 기지국이 SMSoIMS(short message service over internet protocol multimedia system) 및 SMSoNAS(shortmessage service over non-stratum access)를 지원하는지 여부를 확인하고,상기 기지국이 상기 SMSoIMS 및 상기 SMSoNAS를 지원하지 않는 것으로 확인되면, 사용자 입력에 기반하여, 상기기지국에게 시스템 정보를 요청하고,상기 기지국으로부터 상기 셀 리스트에 대한 정보를 포함하는 상기 시스템 정보를 수신하고,사용자의 SMS 입력에 기반하여, 상기 측정을 수행하도록 더 구성되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0011583", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시(disclosure)는 LTE(long term evolution) 통신 시스템 이후 보다 높은 데이터 전송률을 지원하기 위한 5G (5th generation) 또는 6G (6th generation) 통신 시스템에 관련된 것이다. 본 개시는 무선 통신 시스템에서 전자 장치에 의해 수행되는 방법에 관한 것으로, 기지국이 VoNR(voice over new radio)을 지원하는지 여부를 확 (뒷면에 계속)"}
{"patent_id": "10-2022-0011583", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(disclosure)는 통신 시스템에서 EPS(evolved packet system)로의 폴백(fallback)을 가속화 하기 위한 사전 측정 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0011583", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 폰(smart phone), 태블릿 PC(tablet PC), PMP(portable multimedia player), PDA(personal digital assistant), 랩탑 PC(laptop personal computer) 및 웨어러블 기기(wearable device) 등의 다양한 전자 장치들 이 보급되면서, 다양한 전자 장치들이 통신을 수행하는데 이용되는 다양한 무선 통신 기술들이 개발되고 있다. 4G 통신 시스템 상용화 이후 증가 추세에 있는 무선 데이터 트래픽 수요를 충족시키기 위해, 개선된 5G 통신 시 스템 또는 pre-5G 통신 시스템을 개발하기 위한 노력이 이루어지고 있다. 이러한 이유로, 5G 통신 시스템 또는 pre-5G 통신 시스템은 4G 네트워크 이후 (Beyond 4G Network) 통신 시스템 또는 LTE 시스템 이후 (Post LTE) 이후의 시스템이라 불리어지고 있다. 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 6G이하의 대역 외 에, 초고주파(mmWave) 대역 (예를 들어, 60기가(60GHz) 대역과 같은)에서의 구현도 고려되고 있다. 다만, 5G 통신 시스템은 높은 주파수 대역을 이용하므로, 셀의 커버리지(coverage)는 완벽하지 않을 수 있다. 따라서, 5G 통신 시스템의 배치(deployment) 시나리오 중 하나인 SA(standalone)에서는 통화 셋업(call setu p)시 EPS(evolved packet system)로 폴백(fallback)함으로써, 사용자에게 원활한 음성 서비스를 제공할 필요가 있다."}
{"patent_id": "10-2022-0011583", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술된 바와 같은 논의를 바탕으로, 본 개시(disclosure)는 통화 셋업 시간(call setup time)을 감소시키는 방 법 및 장치를 제공한다. 또한, 본 개시는 5G(5th generation) 기지국의 EPS 폴백(evolved packet system fallback) 트리거 전에 E- UTRA(evolved-universal terrestrial radio access) 셀들에 대한 측정을 수행하는 방법 및 장치를 제공한다."}
{"patent_id": "10-2022-0011583", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시(disclosure)에 따른 무선 통신 시스템에서 전자 장치에 의해 수행되는 방법은, 기지국이 VoNR(voice over new radio)을 지원하는지 여부를 확인하는 과정, 상기 기지국이 VoNR을 지원하지 않는 것으로 확인되면, 상기 기지국으로부터 셀 리스트에 대한 정보를 획득하는 과정, 상기 셀 리스트에 대한 측정이 트리거(trigger) 되는지 여부를 확인하는 과정, 상기 측정이 트리거 된 것으로 확인되면, 상기 셀 리스트에 포함된 다수의 셀들 에 대한 측정을 수행하는 과정, 상기 측정의 결과에 기반하여, 상기 다수의 셀들 중에서 하나 이상의 후보 셀들을 확인하는 과정, 상기 하나 이상의 후보 셀들에 대한 정보를 상기 기지국에게 전송하는 과정, 및 상기 기지국 으로부터 핸드오버 명령을 수신하는 과정을 포함할 수 있다. 또한, 본 개시에 따른 무선 통신 시스템의 전자 장치는 적어도 하나의 프로세서 및 상기 적어도 하나의 프로세 서에 동작 가능하게 연결된 적어도 하나의 송수신기를 포함하고, 상기 적어도 하나의 프로세서는, 기지국이 VoNR(voice over new radio)을 지원하는지 여부를 확인하고, 상기 기지국이 VoNR을 지원하지 않는 것으로 확인 되면, 상기 기지국으로부터 셀 리스트에 대한 정보를 획득하고, 상기 셀 리스트에 대한 측정이 트리거(trigger) 되는지 여부를 확인하고, 상기 측정이 트리거 된 것으로 확인되면, 상기 셀 리스트에 포함된 다수의 셀들에 대 한 측정을 수행하고, 상기 측정의 결과에 기반하여, 상기 다수의 셀들 중에서 하나 이상의 후보 셀들을 확인하 고, 상기 하나 이상의 후보 셀들에 대한 정보를 상기 기지국에게 전송하고, 상기 기지국으로부터 핸드오버 명령 을 수신하도록 구성될 수 있다."}
{"patent_id": "10-2022-0011583", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시(disclosure)의 실시 예들에 따른 장치 및 방법은 통화 셋업 시간(call setup time)을 감소시킬 수 있다. 또한, 본 개시의 실시 예들에 따른 장치 및 방법은 5G(5th generation) 기지국의 EPS 폴백(evolved packet system fallback) 트리거 전에 E-UTRA 셀들에 대한 측정을 수행할 수 있다."}
{"patent_id": "10-2022-0011583", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 개시의 동작 원리를 상세히 설명한다. 본 개시에서 사용되는 용어들은 단지 특 정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한정하려는 의도가 아니다. 단수의 표현 은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포 함해서 여기서 사용되는 용어들은 본 개시에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 개시에 사용된 용어들 중 일반적인 사전에 정의된 용어들은, 관 련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 개시에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 개시에서 정의된 용어일 지라도 본 개시의 실시 예들을 배제하도록 해석될 수는 없다. 또한, 본 개시에서, 특정 조건의 만족(satisfied), 충족(fulfilled) 여부를 판단하기 위해 초과 또는 미만의 표 현이 사용되었으나, 이는 일 예를 표현하기 위한 기재일 뿐 이상 또는 이하의 기재를 배제하는 것이 아니다. ‘ 이상’으로 기재된 조건은 ‘초과’, ‘이하’로 기재된 조건은 ‘미만’, ‘이상 및 미만’으로 기재된 조건은 ‘초과 및 이하’로 대체될 수 있다. 또한, 본 개시에서, 일부 통신 규격(예: 3GPP(3rd generation partnership project)에서 정의하는 LTE(long term evolution), NR(new radio))에서 사용되는 용어들을 이용하여 실시 예들을 설명하지만, 이는 설명을 위한 예시일 뿐이다. 본 개시의 실시 예들은 다른 통신 시스템에서도 용이하게 변형되어 적용될 수 있다. 도 1은 본 개시의 실시 예들에 따른 EPS(evolved packet system) 폴백(fallback) 절차를 도시한다. 도 1에서는 IMS(internet protocol multimedia subsystem) 음성(voice)에 대한 EPS 폴백 절차를 설명한다. 도 1은 무선 통 신 시스템의 구성 요소로서, 단말(user equipment, UE), NG RAN(new generation radio access network), E- UTRAN, AMF, MME, SGW, PGW-C, SMF, PCF, IMS를 예시한다. 여기서, NG RAN은 5G 기지국을, E-UTRAN은 4G 기지 국에 해당할 수 있다. 먼저, 단말이 5GS(5th generation system)의 NG RAN에 캠프 온(camp on)하면, MO(mobile originated) 또는 MT(mobile terminated) 음성 세션 설립 절차가 시작될 수 있다. 그 후, IMS 음성에 대한 QoS(quality of service) 흐름을 설정(setup)하기 위한 PDU 세션 수정 절차가 네트워크(network, NW)에 의해 개시될 수 있다. IMS 음성에 대한 EPS 폴백을 지원하도록 구성된 NG RAN은 단말 능력(UE capability), AMF로부터 수신된 지시(예: 음성에 대한 EPS 폴백을 위한 리디렉션이 가능함(redirection for EPS fallback for voice is possible)), 네트워크 설정(network configuration) 및 무선 조건들을 고려하여 EPS 폴백을 트리거(trigger)할 지 여부를 결정할 수 있다. 이 경우, NG RAN이 EPS 폴백을 트리거 하지 않는 것으로 결정하면, 이하의 과정은 수행되지 않을 수 있다. EPS 폴백이 트리거 되는 것으로 결정된 경우, NG RAN은 PDU 세션 수정 응답 메시지를 AMF를 통해 SMF+PGW+C에게 전송함으로써, IMS 음성에 대한 흐름(flow)을 설정하기 위한 PDU 세션 수정에 대한 거부를 응답할 수 있다. 이 경우, PDU 세션 수정 응답 메시지는 IMS 음성에 대한 폴백으로 인한 이동성 (mobility)이 진행 중임을 나타내는 지시(indication)를 포함할 수 있다. 그 후, NG RAN은 단말 능력을 고려하 여, EPS로의 시스템 간(inter-system) 리디렉션을 통한 AN(access network) 해제 또는 핸드오버를 시작할 수 있다. N26 인터페이스가 있는 시스템 간 리디렉션 또는 핸드오버를 수행하는 경우, 단말은 TAU(tracking area update) 절차를 시작할 수 있다. N26 인터페이스가 있는 시스템 간 리디렉션의 경우, TAU 요청에 활성 플래그 (active flag)가 포함될 수 있다. 한편, N26 인터페이스가 없는 시스템 간 리디렉션의 경우, 단말은 요청 유형 이 \"핸드오버\"인 PDN 연결 요청으로 접속(attach)을 시작할 수 있다. EPS로의 이동성 절차를 완료하거나 핸드오 버 절차의 일부로서, 음성에 대한 전용 베어러(dedicated bearer)를 설정하기 위한 PDN 연결 수정이 NW에 의해 개시될 수 있다. 상술된 설명을 참고하면, NG RAN(즉, 5G 기지국)이 EPS 폴백을 트리거 한 후, EUTRAN(즉, 4G 기지국)으로 접속 하기 위해 핸드오버 절차가 수행될 수 있다. 이 경우, 수행될 수 있는 핸드오버 절차 중 조건부 핸드오버 (conditional handover, CHO) 절차가 도 2에서 설명된다. 도 2는 본 개시의 실시 예들에 따른 조건부 핸드오버(conditional handover, CHO)의 절차를 도시한다. 종래 (legacy) 핸드오버는 핸드오버 준비(handover preparation) 절차에서 무선 조건이 저하될 때 트리거(trigger) 된다. 반면에, CHO는 하나 이상의 핸드오버 실행 조건들이 충족되는 경우, 단말에 의해 실행되는 핸드오버로서,무선 조건이 양호한 상태에서도 시작될 수 있다. 또한, CHO는 종래와 같이 하나의 타겟 셀이 아닌 하나 이상의 후보 타겟 셀들을 대상으로 수행될 수 있으므로, 단말의 이동 견고성(mobility robustness)를 향상시킬 수 있다. 이하 도 2에서는, 단말이 소스 기지국과 RRC(radio resource control) 연결 상태(connected state)에 있는 것을 전제로, CHO 절차를 설명한다. 도 2를 참조하면, 동작에서, 소스 기지국은 핸드오버 요청 메시지를 타겟 기지국에게 전송할 수 있다. 이 경우, 핸드오버 요청 메시지는 CHO 지시(indication)를 포함할 수 있다. 동작에서, 타겟 기지국 은 핸드오버 요청 메시지를 수신한 후, 승인 제어(admission control)를 수행하고, 핸드오버 요청 응답 메 시지를 소스 기지국에게 전송할 수 있다. 이 경우, 핸드오버 요청 응답 메시지는 CHO에 대한 정보를 포함 할 수 있다. 여기서, CHO에 대한 정보는 타겟 기지국의 CHO 실행 조건에 대한 정보, 타겟 기지국의 식별 정보(예: PCI(physical cell identifier), CGI(cell global identifier), 노드 ID), 타겟 기지국과 관련하여 CHO 이후에 사용할 무선 자원 설정 정보, CHO 실패 여부를 판단하기 위한 타이머(예: CHO 실행 타이머 (execution timer))에 대한 정보 중 적어도 하나를 포함할 수 있다. 동작에서, 소스 기지국은 타겟 기지국으로부터 수신된 CHO 정보를 단말에게 전송할 수 있다. 이 경우, CHO 정보는 RRC 재설정 (reconfiguration) 메시지 또는 CHO 명령(command)를 통해 전송될 수 있다. 한편, 도 2에서는, 소스 기지국 이 하나의 타겟 기지국에게 핸드오버 요청 메시지를 전송하고, 해당 타겟 기지국으로부터 핸드 오버 요청 응답 메시지를 수신하는 것으로 도시되어 있으나, 이는 예시일 뿐이다. 예를 들어, 소스 기지국(22 0)은 타겟 기지국 외에도 다른 후보 타겟 기지국들에게 핸드오버 요청 메시지를 전송하고, 해당 후보 타겟 기지국들로부터 핸드오버 요청 응답 메시지를 포함할 수 있다. 따라서, 동작에서, 소스 기지국은 복 수의 후보 기지국들에 대한 CHO 정보를 단말에게 전송할 수 있다. 동작에서, 단말은 수신된 CHO 정보에 포함된 CHO 실행 조건에 대한 측정을 수행하고, CHO 실행 조건으로 주어진 이벤트가 발생하는지 여부를 모니터링 할 수 있다. 동작에서, 단말은 측정 및 모니터링을 수행하는 동안 소스 기지국과 데이 터를 송수신할 수 있다. 동작에서, 단말은 CHO 실행 조건이 충족된 경우, 단말은 CHO를 수행할 수 있다. 여기서, CHO를 수행함은 단말이 소스 기지국과 연결을 끊고(detach), 타겟 기지국과 동기화를 수행하는 과정에 해당할 수 있다. 이 경우, 동기화를 수행하는 과정은 도 2의 동작에 예시된 바 와 같이 RACH(random access channel) 절차에 해당할 수 있다. 한편, CHO 정보가 설정된 하나 이상의 기지국들 중에서 복수개의 기지국들의 CHO 실행 조건이 충족된 경우, 단말은 복수개의 기지국들 중 하나를 선택할 수 있 다. 예를 들어, 단말은 CHO 실행 조건을 충족한 기지국들 중에서 신호세기가 가장 강한 기지국을 CHO를 수 행할 기지국으로 선택할 수 있다. 도 2에서는 선택된 기지국을 타겟 기지국으로 예시한다. 동작에서, 단말은 동기화가 완료되면 핸드오버 완료(complete) 메시지를 타겟 기지국에게 전송할 수 있다. 동작(21 7)에서, 타겟 기지국은 단말 컨텍스트 해제(use equipment context release) 메시지를 소스 기지국 에게 전송할 수 있다. 동작에서, 단말 컨텍스트 해제 메시지를 수신한 소스 기지국은 단말의 단 말 컨텍스트를 해제할 수 있다. 도 1 및 도 2에서 설명된 EPS 폴백 절차를 참고하면, 단말은 5G 기지국의 EPS 폴백 트리거 후, CHO 절차에서 RRC 재설정 메시지를 통해 측정을 수행할 E-UTRA 셀 리스트를 수신할 수 있다. 다만, 단말 또는 네트워크 (network, NW)가 VoNR(voice over new radio)을 지원하지 않아, EPS 폴백이 예상되는 경우에도 단말이 EPS 폴 백 트리거를 기다리는 것은 지연을 초래할 수 있다. 마찬가지로, 단말이 EPS 폴백 트리거 후 E-UTRA 셀 리스트 를 수신하는 것 또한 지연을 초래할 수 있다. 결국, 이러한 지연들은 통화 셋업 시간(call setup time)을 증가 시킴으로써, 핸드오버 후 4G 기지국에서 수행될 VoLTE(voice over long term evolution) 서비스에 대한 사용자 경험에 부정적인 영향을 미칠 수 있다. 따라서, EPS 폴백이 예상되는 경우라면, 단말이 사전에 E-UTRA 셀 리스 트에 대해 측정을 수행할 수 있도록 하여, 지연을 감소시킬 필요가 있다. 도 3은 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작을 도시한다. 도 3에서는, 단말이 사전 측정 (prior measurement)를 수행함으로써, 통화 셋업 시간(call setup time)을 감소시키는 방법에 관하여 설명한다. 도 3을 참고하면, 동작에서, 단말은 단말과 네트워크(network)의 VoNR(voice over new radio) 및 사전 측 정에 대한 능력(capability)을 결정할 수 있다. 여기서, 네트워크는 RAN(radio access network) 노드(즉, 기지 국)를 포함할 수 있다. 또한, 네트워크는 RAN 노드 뿐만 아니라, 코어 네트워크(core network, CN)의 네트워크기능(network function, NF)들 중 적어도 하나를 포함할 수 있다. 단말은 단말의 VoNR에 대한 능력 정보 및 사 전 측정에 대한 능력 정보는 이미 획득하고 있으므로, 네트워크의 VoNR에 대한 능력 정보 및 사전 측정에 대한 능력 정보를 획득할 필요가 있다. 일 실시 예에서, 단말은 로컬 데이터베이스(local database)에 기반하여 네트워크의 VoNR에 대한 능력 정보를 획득할 수 있다. 예를 들어, 단말은 PLMN(public land mobile network), 운영자 지원 정보(operation support information), 또는 위치 커버리지(location coverage) 정보 중 적어도 하나에 기반하여 네트워크의 VoNR에 대 한 능력 정보를 획득할 수 있다. 또 다른 실시 예에서, 단말은 NR 셀 리스트에 기반하여 네트워크의 VoNR에 대 한 능력 정보를 획득할 수 있다. 여기서, NR 셀 리스트는 단말이 이전에 캠프 온(camp on) 했던 NR 셀들을 포함 할 수 있다. 즉, 단말은 캠프 온 했던 NR 셀들 중 VoNR을 지원하지 않는 NR 셀들을 셀 리스트로 관리함으로써, 재접속시 해당 네트워크가 VoNR을 지원하는지 여부를 확인할 수 있다. 상술된 실시 예들에서는 단말이 로컬 데 이터베이스 또는 NR 셀 리스트에 기반하여 네트워크의 VoNR에 대한 능력 정보를 획득하는 것으로 기술하였으나, 이는 예시일 뿐이며, 본 개시에 따른 실시 예들에서는 상술한 실시 예들이 조합될 수 있다. 예를 들어, 단말은 재접속한 셀인 경우, NR 셀 리스트에 기반하여 네트워크의 VoNR에 대한 능력 정보를 확인하고, 처음 접속한 셀 인 경우 로컬 데이터 베이스에 기반하여 네트워크의 VoNR에 대한 능력 정보를 확인할 수도 있다. 일 실시 예에서, 단말이 네트워크의 사전 측정에 대한 능력 정보를 확인하기 위해, 단말 등록 절차 (registration procedure)의 단말 능력 정보(UE capability information) 및 등록 승인(registration accept) 메시지에 새로운 플래그(flag)가 포함될 수 있다. 여기서, 예를 들면, 단말 능력 정보 및 등록 승인 메시지에 포함되는 사전 측정 비트(bit)가 아래와 같이 정의될 수 있다. - 사전 측정 비트=1: 단말이 네트워크에 보고하는 단말 능력 정보에 포함된 사전 측정 비트가 1인 경우, 단말이 사전 측정을 지원함을 의미할 수 있다. 마찬가지로, 네트워크가 단말에게 전송하는 등록 승인 메시지에 포함된 사전 측정 비트가 1인 경우, 네트워크가 사전 측정을 지원함을 의미할 수 있다. - 사전 측정 비트=0: 단말이 네트워크에 보고하는 단말 능력 정보에 포함된 사전 측정 비트가 0인 경우, 단말이 사전 측정을 지원하지 않음을 의미할 수 있다. 마찬가지로, 네트워크가 단말에게 전송하는 등록 승인 메시지에 포함된 사전 측정 비트가 0인 경우, 네트워크가 사전 측정을 지원하지 않음을 의미할 수 있다. 다만, 상기의 정의는 예시일 뿐이며, 사전 측정 비트가 0인 경우, 단말 및 네트워크가 사전 측정을 지원함을 의 미할 수 있으며, 사전 측정 비트가 1인 경우, 단말 및 네트워크가 사전 측정을 지원하지 않음을 의미할 수도 있 다. 동작에서, 단말은 NW로부터 E-UTRA 셀 리스트를 수신할 수 있다. 여기서, E-UTRA 셀 리스트는 서빙 (serving) 기지국에 의해 탐지될 수 있는 E-UTRA 인접 셀들(neighbor cells)을 포함할 수 있다. 단말이 서빙 기지국의 EPS 폴백을 기다리지 않고, E-UTRA 인접 셀들에 대한 사전 측정(prior measurement)을 수행하기 위해 서는, 기지국으로부터 E-UTRA 셀 리스트에 대한 정보를 수신할 필요가 있다. 이 경우, E-UTRA 셀 리스트에 대한 정보를 수신하기 위한 시그널링의 예는 아래와 같을 수 있다. - SIB(system information block): E-UTRA 셀 리스트는 시스템 정보에 포함될 수 있다. 시스템 정보(system information, SI)는 기지국이 네트워크 설정 정보를 단말에게 전달하기 위한 메시지일 수 있다. SI는 MSI(minimum system information)와 OSI(other system information)으로 구분될 수 있다. MSI는 MIB(master information block) 및 SIB1을 포함할 수 있으며, OSI는 MIB 및 SIB1을 제외한 시스템 정보를 포함할 수 있다. 여기서, OSI는 DL-SCH를 통해 주기적으로 방송될 수 있다. 또한, OSI는 요청(on-demand)에 기반하여 방송될 수 있다(예: SIB5는 RRC 연결, RRC 비활성 또는 RRC 유휴 상태에 있는 단말의 요청에 기반하여 전송될 수 있다). 또한, OSI는 전용(dedicated) 방식으로 DL-SCH를 통해 RRC 연결 상태의 단말에게 전송될 수 있다(예: RRC 연결 상태에 있는 단말로부터의 요청이 있는 경우 또는 단말의 활성 BWP(bandwidth part)에 CSS(common search space)가 설정되지 않은 경우, OSI는 전용(dedicated) 방식으로 DL-SCH를 통해 단말에게 전송될 수 있다). SIB5는 E-UTRA 주파수 및 E-UTRA 인접 셀에 대한 정보를 전달하기 위해 지정되어 있다. 따라서, E-UTRA 셀 리스 트에 대한 정보는 SIB5에 포함되어 단말에게 전송될 수 있다. 다만, 이는 예시일 뿐이며, E-UTRA 셀 리스트에 대한 정보는 다른 시스템 정보에도 포함될 수 있다. - RRC 해제 메시지: 네트워크는 RRC 해제 메시지를 통해 RRC 비활성 또는 RRC 유휴 상태에 있는 단말에게 E- UTRA 반송파의 측정을 단말에게 요청할 수 있다. 따라서, E-UTRA 셀 리스트에 대한 정보는 RRC 해제 메시지에도 포함될 수 있다.동작에서, 단말은 수신된 E-UTRA 셀 리스트에 대한 정보를 저장하고, 갱신할 수 있다. 단말은 상술한 시스 템 정보 또는 RRC 해제 메시지를 통해 E-UTRA 셀 리스트에 대한 정보를 획득할 수 있다. 이 경우, 단말은 E- UTRA 셀 리스트에 대한 정보를 저장하고, 해당 정보에 기반하여, E-UTRA 셀 리스트를 갱신할 수 있다. 동작에서, 단말은 사전 측정(prior measurement)을 수행할 수 있다. 단말은 E-UTRA 셀 리스트에 포함된 셀 들에 대하여 사전 측정을 수행할 수 있다. 이 경우, 단말은 특정 트리거 조건에 기반하여 사전 측정을 시작할 수 있다. 예를 들면, 트리거 조건은 아래와 같이 구성될 수 있다. - INVITE 메시지 기반: 단말은 INVITE 메시지를 송신하거나 수신하는 경우에, E-UTRA 셀 리스트에 포함된 셀들 에 대하여 사전 측정을 수행할 수 있다. 이 경우, INVITE 메시지는 통화(call)을 요청하기 위한 메시지일 수 있 다. - 이벤트 기반: 단말은 사용자 입력에 기반하여 E-UTRA 셀 리스트에 포함된 셀들에 대하여 사전 측정을 수행할 수 있다. 예를 들어, 단말은 사용자가 전화번호를 입력하는 경우, E-UTRA 셀 리스트에 포함된 셀들에 대하여 사 전 측정을 수행할 수 있다. 또 다른 예를 들어, 단말은 사용자가 SMS(short message service) 메시지를 입력하 는 경우, E-UTRA 셀 리스트에 포함된 셀들에 대하여 사전 측정을 수행할 수 있다. 단말은 사전 측정에 기반하여, E-UTRA 셀 리스트에 포함된 셀들 중에서 후보(candidate) 셀들을 식별할 수 있다. 예를 들어, 단말은 E-UTRA 셀 리스트에 포함된 셀들로부터 수신된 신호들의 세기를 미리 정해진 임계 값 과 비교할 수 있다. 이 경우, 단말은 신호의 세기가 미리 정해진 임계 값을 초과하는 셀들을 후보 셀들로 식별 할 수 있다. 단말은 식별된 후보 셀들에 대한 정보를 네트워크에게 전송할 수 있다. 동작에서, 단말은 EPS로 핸드오버를 수행할 수 있다. 기지국은 수신된 후보 셀들에 대한 정보에 기반하여, 하나의 셀을 EPS 폴백의 대상이 되는 셀로 식별할 수 있다. 이 경우, 기지국은 핸드오버 준비(handover preparation) 절차를 거친 후, 단말에게 핸드오버 명령(handover command)을 전송할 수 있다. 단말은 핸드오버 명령을 수신한 후, EPS 폴백의 대상이 되는 셀과 RACH(random access channel) 절차를 수행함으로써, 해당 셀에 접속할 수 있다. 한편, 상술된 동작 및 에서는 일반적인 핸드오버가 수행되는 것으로 기술되었으나, 이는 예시일 뿐이 다. 예를 들어, 단말은 식별된 후보 셀들에 대한 정보를 네트워크에 전달하지 않고, CHO 절차와 같이 기지국과 의 연결을 끊고(detach), 후보 셀들 중 하나의 셀을 선택하여 동기화 과정을 수행할 수도 있다. 도 4는 본 개시의 실시 예들에 따른 단말 등록 절차의 신호 흐름을 도시한다. 도 4에서는 단말이 기지국의 VoNR 에 대한 능력 정보 및 사전 측정에 대한 능력 정보를 획득하는 절차를 설명한다. 본 개시의 실시 예들은 단말이 기지국의 EPS 폴백 트리거를 기다리지 않고, 사전 측정을 수행함으로써, 통화 셋 업 시간(call setup time)을 단축시키는 것을 목표로 한다. 따라서, 단말이 기지국이 추후 EPS 폴백을 트리거 할 것임을 예상할 수 있어야 한다. 즉, 단말은 단말 또는 기지국 중 적어도 하나가 VoNR을 지원하지 않는 경우 라면, 기지국이 EPS 폴백을 트리거 할 것임을 예상할 수 있다. 또한, EPS 폴백 셋업을 단축시키기 위해서는 사 전에 측정을 수행해야 하므로, 단말은 단말과 기지국이 모두 사전 측정을 지원하는지 여부를 알 수 있어야 한다. 일 실시 예에서, 단말은 기지국의 VoNR에 대한 능력 정보를 획득할 수 있다. 예를 들어, 단말은 PLMN(public land mobile network), 운영자 지원 정보(operation support information), 또는 위치 커버리지(location coverage) 정보 중 적어도 하나에 기반하여 기지국의 VoNR에 대한 능력 정보를 획득할 수 있다. 또 다른 실시 예에서, 단말은 NR 셀 리스트에 기반하여 기지국의 VoNR에 대한 능력 정보를 획득할 수 있다. 여기서, NR 셀 리 스트는 단말이 이전에 캠프 온(camp on) 했던 NR 셀들을 포함할 수 있다. 즉, 단말은 캠프 온 했던 NR 셀들 중 VoNR을 지원하지 않는 NR 셀들을 셀 리스트로 관리함으로써, 재접속시 해당 네트워크가 VoNR을 지원하는지 여부 를 확인할 수 있다. 상술된 실시 예들에서는 단말이 로컬 데이터베이스 또는 NR 셀 리스트에 기반하여 네트워크 의 VoNR에 대한 능력 정보를 획득하는 것으로 기술하였으나, 이는 예시일 뿐이며, 본 개시에 따른 실시 예들에 서는 상술한 실시 예들이 조합될 수 있다. 예를 들어, 단말은 재접속한 셀인 경우, NR 셀 리스트에 기반하여 네 트워크의 VoNR에 대한 능력 정보를 확인하고, 처음 접속한 셀인 경우 로컬 데이터 베이스에 기반하여 네트워크 의 VoNR에 대한 능력 정보를 확인할 수도 있다. 일 실시 예에서, 단말은 NAS(non-access stratum) 등록 절차를 통해 기지국의 사전 측정에 대한 능력 정보를 획 득할 수 있다. NAS 등록 절차는 다음과 같이 구성될 수 있다. 동작에서, 단말은 등록 요청 메시지를 5GC(5th generation core network)에게 전송할 수 있다. 여기서, 5GC는 AMF를 의미할 수 있다. 동작에서, 5GC는 단말의 무선 능력 확인 요청(UE radio capability check request) 메시지를 기지국에게 전송할 수 있다. 동작 및 동작에서, 기지국은 단말 능력 질의(UE radio capability enquiry) 메시지를 단말에게 전송 하고, 단말로부터 단말 능력 정보(UE capability information)를 수신할 수 있다. 동작에서, 기지국은 단 말 무선 능력 확인 응답(UE radio capability check response) 메시지를 5GC에게 전송할 수 있다. 동작에 서, 5GC는 기지국에게 초기 컨텍스트 설정 요청을 전송할 수 있다. 동작에서, 5GC는 등록 승인 (registration accept) 메시지를 단말에게 전송할 수 있다. 이러한 NAS 등록 절차에서, 단말이 기지국의 사전 측정에 대한 능력 정보를 확인하기 위해, 단말 능력 정보 및 등록 승인 메시지에 새로운 플래그(flag)가 포함될 수 있다. 여기서, 예를 들면, 단말 능력 정보 및 등록 승인 메시지에 포함되는 사전 측정 비트(bit)가 아래와 같이 정의될 수 있다. - 사전 측정 비트=1: 단말이 기지국에게 보고하는 단말 능력 정보에 포함된 사전 측정 비트가 1인 경우, 단말이 사전 측정을 지원함을 의미할 수 있다. 마찬가지로, 네트워크가 단말에게 전송하는 등록 승인 메시지에 포함된 사전 측정 비트가 1인 경우, 기지국이 사전 측정을 지원함을 의미할 수 있다. - 사전 측정 비트=0: 단말이 기지국에게 보고하는 단말 능력 정보에 포함된 사전 측정 비트가 0인 경우, 단말이 사전 측정을 지원하지 않음을 의미할 수 있다. 마찬가지로, 네트워크가 단말에게 전송하는 등록 승인 메시지에 포함된 사전 측정 비트가 0인 경우, 기지국이 사전 측정을 지원하지 않음을 의미할 수 있다. 다만, 상기의 정의는 예시일 뿐이며, 사전 측정 비트가 0인 경우, 단말 및 기지국이 사전 측정을 지원함을 의미 할 수 있으며, 사전 측정 비트가 1인 경우, 단말 및 기지국이 사전 측정을 지원하지 않음을 의미할 수도 있다. 단말은 도 4에서 설명한 과정을 통해 기지국의 VoNR에 대한 능력 정보 및 사전 측정에 대한 능력 정보를 획득할 수 있다. 이 경우, 단말은 단말과 기지국 중 적어도 하나가 VoNR을 지원하지 않는 경우, 단말 및 기지국이 사전 측정을 지원하는지 여부를 식별할 수 있다. 단말 및 기지국이 사전 측정을 지원하는 것으로 식별된 경우, 단말 은 EPS 폴백이 트리거 될 것임을 예상할 수 있다. 도 5는 본 개시의 실시 예들에 따른 E-UTRA 셀 리스트를 관리하는 단말의 동작 흐름을 도시한다. 도 5에서는 단 말이 E-UTRA 셀 리스트를 저장하고 갱신하는 단말의 동작에 대하여 설명한다. 종래(legacy) 절차에서 단말은 기지국에 의해 EPS 폴백이 트리거 된 후, CHO 절차에서 E-UTRA 셀 리스트를 수신 할 수 있다. 이 경우, EPS 폴백이 트리거 된 시간과 E-UTRA 셀 리스트를 수신한 시간의 차이만큼 통화 셋업 시 간(call setup time)이 지연된다. 따라서, 본 개시에 따른 실시 예들에서는, EPS 폴백이 트리거 되는지 여부에 관계 없이, 단말이 사전에 E-UTRA 셀 리스트를 수신할 필요가 있다. 도 5를 참조하면, 동작에서, 단말은 E-UTRA 셀 리스트에 대한 정보를 기지국으로부터 수신할 수 있다. 도 4에 설명된 바와 같이, EPS 폴백이 트리거 될 것임이 예상되는 경우, 단말이 기지국에게 시스템 정보(system information, SI)를 요청함으로써, E-UTRA 셀 리스트에 대한 정보를 수신할 수 있다. 또한, 기지국이 수신된 단 말 능력 정보에 기반하여 EPS 폴백이 트리거 될 것으로 예상되는 경우, RRC 해제 메시지에 E-UTRA 셀 리스트에 대한 정보를 포함시켜 전송할 수도 있다. 상술한 시그널링의 예는 아래와 같을 수 있다. - SIB(system information block): E-UTRA 셀 리스트는 시스템 정보에 포함될 수 있다. 시스템 정보(system information, SI)는 기지국이 네트워크 설정 정보를 단말에게 전달하기 위한 메시지일 수 있다. SI는 MSI(minimum system information)와 OSI(other system information)으로 구분될 수 있다. MSI는 MIB(master information block) 및 SIB1을 포함할 수 있으며, OSI는 MIB 및 SIB1을 제외한 시스템 정보를 포함할 수 있다. 여기서, OSI는 DL-SCH를 통해 주기적으로 방송될 수 있다. 또한, OSI는 요청(on-demand)에 기반하여 방송될 수 있다(예: SIB5는 RRC 연결, RRC 비활성 또는 RRC 유휴 상태에 있는 단말의 요청에 기반하여 전송될 수 있다). 또한, OSI는 전용(dedicated) 방식으로 DL-SCH를 통해 RRC 연결 상태의 단말에게 전송될 수 있다(예: RRC 연결 상태에 있는 단말로부터의 요청이 있는 경우 또는 단말의 활성 BWP(bandwidth part)에 CSS(common search space)가 설정되지 않은 경우, OSI는 전용(dedicated) 방식으로 DL-SCH를 통해 단말에게 전송될 수 있다). SIB5는 E-UTRA 주파수 및 E-UTRA 인접 셀에 대한 정보를 전달하기 위해 지정되어 있다. 따라서, E-UTRA 셀 리스 트에 대한 정보는 SIB5에 포함되어 단말에게 전송될 수 있다. 다만, 이는 예시일 뿐이며, E-UTRA 셀 리스트에 대한 정보는 다른 시스템 정보에도 포함될 수 있다.- RRC 해제 메시지: 네트워크는 RRC 해제 메시지를 통해 RRC 비활성 또는 RRC 유휴 상태에 있는 단말에게 E- UTRA 반송파의 측정을 단말에게 요청할 수 있다. 따라서, E-UTRA 셀 리스트에 대한 정보는 RRC 해제 메시지에도 포함될 수 있다. 단말은 상술한 시스템 정보 또는 RRC 메시지를 통해 E-UTRA 셀 리스트에 대한 정보를 수신하고, 저장할 수 있다. 동작에서, 단말은 서빙 셀(serving cell)이 변경되었는지 여부를 식별할 수 있다. 즉, 단말은 이동 또는 무선 환경의 변동으로 인해 서빙 셀이 변경된 경우, E-UTRA 셀 리스트를 갱신할 수 있다. 예를 들면, 단말은 서 빙 셀이 변경된 것으로 확인되면, 변경된 서빙 셀로부터 동작에서 예시한 시그널링을 통해 새로운 E-UTRA 셀 리스트를 수신할 수 있다. 동작에서, 단말은 새로운 서빙 셀로부터 수신된 새로운 E-UTRA 셀 리스트에 기반하여, E-UTRA 셀 리스트를 갱신할 수 있다. 도 6a 내지 도 6c는 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작 흐름을 도시한다. 도 6a 내지 도 6c에서는 종래(legacy) 통화 셋업 시간(call setup time)과 본 개시의 실시 예들에 따른 EPS 폴백 절차에 따른 통화 셋업 시간의 차이를 비교한 결과를 설명한다. 한편, 설명하기에 앞서, 도 6a 내지 도 6c에 도시된 시간들은 아래와 같이 정의될 수 있다. - t0: E-UTRA 셀 리스트에 포함된 하나의 셀을 측정하는데 소요되는 시간. - t1: 기지국에 의해 EPS 폴백이 트리거 된 시간과 단말이 E-UTRA 셀 리스트를 수신한 시간의 차이(예: 50ms). - t2: 후보 셀들을 보고한 후, HO 절차까지 소요되는 시간(예: 100ms). - t3: 측정 이벤트(예: INVITE 송신 또는 수신)가 발생한 후, 사전 측정을 수행하는데 소요되는 시간(예: 0ms) 또는 측정 이벤트가 발생한 후, 후보 셀들을 보고하는데 소요되는 시간(예: 0ms). - A: E-UTRA 셀 리스트에 포함된 셀들의 개수. 도 6a는 종래의 EPS 폴백 절차에 따른 통화 셋업 시간을 설명하기 위한 도면이다. 도 6a를 참조하면, 단말은 INVITE 메시지를 송신 또는 수신하더라도, 네트워크에 의해 EPS 폴백이 트리거 된 후, E-UTRA 셀 리스트를 수신 할 수 있으므로, 시간 t1이 소요된다. 또한, 단말은 A개의 셀들에 대해 측정을 수행하고, 후보 셀들을 보고하는 데 A t0의 시간이 소요된다. 또한, 후보 셀들을 보고한 후, 핸드오버를 완료하기까지 t2의 시간이 소요된다. 따 라서, 도 6a에 따르면, 종래의 EPS 폴백 절차에 따른 통화 셋업 시간은 A t0+t1+t2이다. 도 6b는 본 개시에 따른 실시 예들의 EPS 폴백 절차에 따른 통화 셋업 시간을 설명하기 위한 도면이다. 도 6c를 참조하면, 동작 및 동작을 통해 단말은 EPS 폴백이 트리거 될 것을 예상할 수 있다. 따라서, 동작 에서 단말은 E-UTRA 셀 리스트를 사전에 수신하여 저장 및 갱신할 수 있다. 결국, 단말은 INVITE 메시지를 송신 또는 수신하는 경우, 네트워크에 의해 EPS 폴백이 트리거 되는 것을 기다릴 필요 없이, 곧바로 E-UTRA 셀 리스트에 대한 측정을 시작할 수 있다(즉, t3=0ms). 결국, 단말이 A개의 셀들에 대해 측정을 수행하고 후보 셀 들을 보고하는데 소요되는 시간 A t0 및 단말이 후보 셀들을 보고한 후, 핸드오버를 완료하기까지 t2의 시간이 소요되므로, 통화 셋업 시간은 A t0+t2이다. 따라서, 종래의 EPS 폴백 절차에 비해 통화 셋업 시간이 t1만큼 감소된다. 도 6c는 본 개시에 따른 실시 예들의 EPS 폴백 절차에 따른 통화 셋업 시간을 설명하기 위한 도면이다. 도 6c를 참조하면, 동작 및 동작을 통해 단말은 EPS 폴백이 트리거 될 것을 예상할 수 있다. 따라서, 동작 에서 단말은 E-UTRA 셀 리스트를 사전에 수신하여 저장 및 갱신할 수 있다. 동작에서, 단말은 측정 이벤트의 발생을 식별할 수 있다. 여기서, 측정 이벤트는 사용자 입력에 기반할 수 있다. 예를 들어, 측정 이벤 트는 사용자가 전화번호를 입력하는 경우 또는 SMS(short message service) 메시지를 입력하는 경우 중 적어도 하나를 포함할 수 있다. 이 경우, 측정 이벤트는 단말에 미리 구성될(pre-configured)되거나 기지국으로부터 설 정 받을 수 있다. 동작에서, 단말은 측정 이벤트가 식별된 것에 응답하여, E-UTRA 셀 리스트에 포함되는 셀들에 대해 측정을 수행할 수 있으며, 시간 A t0가 소요될 수 있다. 또한, 단말이 INVITE 메시지를 송신 또는수신한 후, 후보 셀들을 보고하는데 소요되는 시간 t3(=0ms) 및 단말이 후보 셀들을 보고한 후, 핸드오버를 완 료하기까지 t2의 시간이 소요되므로, 통화 셋업 시간은 t2이다. 따라서, 종래의 EPS 폴백 절차에 비해 통화 셋 업 시간이 t1+ A t0만큼 감소된다. 도 6a 내지 도 6c에서 설명된 바와 같이, 본 개시에 따르면 통화 셋업 시간이 감소될 수 있다. 따라서, 단말이 보다 빠르게 VoLTE 통화를 수행할 수 있으므로, 사용자 경험(user experience)이 향상될 수 있다. 도 7은 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작 흐름을 도시한다. 도 7은 단말이 RRC 연결 (connected) 상태에 있고, INVITE 메시지의 송수신이 사전 측정(prior measurement)의 트리거 조건으로 사용되 는 실시 예를 설명하기 위한 도면이다. 동작에서, 단말은 단말 및 네트워크(network, NW)가 VoNR(voice over new radio)을 지원하는지 여부를 식 별할 수 있다. 단말은 로컬 데이터베이스(local database)에 기반하여 네트워크가 VoNR을 지원하는지 여부를 식 별할 수 있다. 예를 들어, 단말은 PLMN(public land mobile network), 운영자 지원 정보(operation support information), 또는 위치 커버리지(location coverage) 정보 중 적어도 하나에 기반하여 획득된 네트워크의 VoNR에 대한 능력 정보에 기반하여, 네트워크가 VoNR을 지원하는지 여부를 식별할 수 있다. 또한, 단말은 NR 셀 리스트에 기반하여 네트워크가 VoNR을 지원하는지 여부를 식별할 수 있다. 여기서, NR 셀 리스트는 단말이 이전 에 캠프 온(camp on) 했던 NR 셀들을 포함할 수 있다. 즉, 단말은 캠프 온 했던 NR 셀들 중 VoNR을 지원하지 않 는 셀들을 셀 리스트로 관리함으로써, 재접속시 해당 네트워크가 VoNR을 지원하는지 여부를 식별할 수 있다. 단 말은 단말 및 네트워크가 모두 VoNR을 지원하는 경우, 네트워크와 VoNR에 기반하는 통신을 수행할 수 있다. 반 면에, 단말은 단말 또는 네트워크 중 적어도 하나가 VoNR을 지원하지 않는 경우, 동작을 수행할 수 있다. 동작에서, 단말은 단말 및 네트워크가 EPS 폴백(fallback, FB)에 대한 사전 측정을 지원하는지 여부를 식 별할 수 있다. 단말은 NAS(non-access stratum) 등록 절차를 통해 획득된 네트워크의 사전 측정에 대한 능력 정 보에 기반하여, 네트워크가 사전 측정을 지원하는지 여부를 식별할 수 있다. 단말이 네트워크의 사전 측정에 대 한 능력 정보를 획득하기 위해, NAS 단말 등록 절차의 단말 능력 정보(UE capability information) 및 등록 승 인(registration accept) 메시지에 새로운 플래그(flag)가 포함될 수 있다. 여기서, 예를 들면, 단말 능력 정보 및 등록 승인 메시지에 포함되는 사전 측정 비트(bit)가 아래와 같이 정의될 수 있다. - 사전 측정 비트=1: 단말이 네트워크에 보고하는 단말 능력 정보에 포함된 사전 측정 비트가 1인 경우, 단말이 사전 측정을 지원함을 의미할 수 있다. 마찬가지로, 네트워크가 단말에게 전송하는 등록 승인 메시지에 포함된 사전 측정 비트가 1인 경우, 네트워크가 사전 측정을 지원함을 의미할 수 있다. - 사전 측정 비트=0: 단말이 네트워크에 보고하는 단말 능력 정보에 포함된 사전 측정 비트가 0인 경우, 단말이 사전 측정을 지원하지 않음을 의미할 수 있다. 마찬가지로, 네트워크가 단말에게 전송하는 등록 승인 메시지에 포함된 사전 측정 비트가 0인 경우, 네트워크가 사전 측정을 지원하지 않음을 의미할 수 있다. 다만, 상기의 정의는 예시일 뿐이며, 사전 측정 비트가 0인 경우, 단말 및 네트워크가 사전 측정을 지원함을 의 미할 수 있으며, 사전 측정 비트가 1인 경우, 단말 및 네트워크가 사전 측정을 지원하지 않음을 의미할 수도 있 다. 단말은 단말 또는 네트워크 중 적어도 하나가 사전 측정을 지원하지 않는 경우, 종래(legacy)와 같이 네트 워크에 의해 트리거 된 EPS 폴백을 기다릴 수 있다. 반면에, 단말은 단말 및 네트워크가 사전 측정을 지원하는 경우, 동작을 수행할 수 있다. 동작에서, 단말은 기지국으로부터 E-UTRA 셀 리스트를 수신할 수 있다. 여기서, E-UTRA 셀 리스트는 서빙 (serving) 기지국에 의해 탐지될 수 있는 E-UTRA 인접 셀들(neighbor cells)을 포함할 수 있다. 단말은 시스템 정보(system information, SI) 또는 RRC 해제 메시지를 통해 E-UTRA 셀 리스트에 대한 정보를 획득할 수 있다. 동작에서, 단말은 INVITE 메시지를 송신하거나 수신할 수 있다. 예를 들어, 단말은 통화를 요청하는 INVITE 메시지를 IMS에게 전송할 수 있다. 단말이 INVITE를 전송하는 경우는 MO(mobile originated)로 지칭될 수 있다. 또 다른 예를 들어, 단말은 통화를 요청하는 INVITE 메시지를 IMS로부터 수신할 수 있다. 단말이 INVITE 메시지를 수신하는 경우는 MT(mobile terminated)로 지칭될 수 있다. 단말은 INVITE 메시지가 송수신되 지 않고, 서빙 기지국이 변경되면 동작을 다시 수행할 수 있다. 반면에, 단말은 INVITE 메시지가 송신되거 나 수신되면, 동작을 수행할 수 있다. 동작에서, 단말은 E-UTRA 셀 리스트에 포함된 셀들에 대해 사전 측정(prior measurement)을 수행할 수 있 다. 동작에서, 단말은 사전 측정에 기반하여, E-UTRA 셀 리스트에 포함된 셀들 중에서 후보(candidate) 셀 들을 식별할 수 있다. 그 후, 단말은 식별된 후보 셀들을 기지국에게 보고할 수 있다. 동작에서, 단말은 기지국으로부터 수신된 핸드오버 명령(command)에 따라 EPS로 핸드오버를 수행하고, VoLTE 통화를 수행할 수 있 다. 도 8은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 8은 단말이 RRC 연결 (connected) 상태에 있고, INVITE 메시지가 사전 측정(prior measurement)의 트리거 조건으로 사용되는 실시 예를 설명하기 위한 도면이다. 도 8의 동작 내지 동작은 단말이 NAS(non-access stratum) 등록 절차를 통해 네트워크의 VoNR 및 사 전 측정에 대한 능력 정보를 획득하는 과정으로서, 도 4에 예시되어 있으므로, 설명은 생략한다. 동작에서, 단말은 기지국으로부터 시스템 정보(system information, SI)를 수신할 수 있다. 이 경우, 시스 템 정보는 E-UTRA 셀 리스트에 대한 정보를 포함할 수 있다. 여기서, 시스템 정보는 SIB(system information block)5에 해당할 수 있다. 동작에서, RRC 연결(connected) 상태에 있는 단말은 INVITE 메시지를 송수신할 수 있다. 여기서, INVITE 메시지의 송수신은 사전 측정(prior measurement)을 시작하는 트리거가 될 수 있다. 동작에서, 단 말이 INVITE 메시지를 송신하거나 수신한 경우, 단말은 E-UTRA 셀 리스트에 포함된 셀들에 대해 사전 측정을 수 행할 수 있다. 단말은 사전 측정을 수행한 결과에 기반하여, E-UTRA 셀 리스트에 포함된 셀들 중에서 후보 (candidate) 셀들을 식별할 수 있다. 그 후, 동작에서, 단말은 후보 셀들을 기지국에게 보고할 수 있다. 동작에서, 기지국은 EPS 폴백을 트리거 할 수 있다. 동작에서, 기지국은 단말에게 핸드오버 명령 (command)을 전송할 수 있다. 이 경우, 단말은 EPS의 지시된 타겟 셀로 핸드오버를 수행할 수 있다. 그 결과, 5GS(5th generation system)의 IMS 음성 세션은 EPS로 전달될 수 있다. 도 9는 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작 흐름을 도시한다. 도 9는 단말이 RRC 연결 (connected) 상태에 있고, 측정 이벤트가 사전 측정(prior measurement)의 트리거 조건으로 사용되는 실시 예를 설명하기 위한 도면이다. 도 9의 동작 내지 동작은 도 7의 동작 내지 동작에 예시된 단말의 동작으로서, 도 7에 예 시되어 있으므로, 설명은 생략한다. 동작에서, 단말은 측정 이벤트를 식별할 수 있다. 측정 이벤트는 사전 측정(prior measurement)를 시작하 는 트리거가 될 수 있다. 이러한 측정 이벤트는 사용자 입력에 기반하여 단말의 CP(communication processor)에 의해 식별될 수 있다. 예를 들어, 단말은 사용자가 전화번호를 입력하면, 측정 이벤트가 발생한 것으로 식별할 수 있다. 또 다른 예를 들어, 단말은 사용자가 SMS(short message service) 메시지를 입력하면, 측정 이벤트가 발생한 것으로 식별할 수 있다. 동작에서, 단말은 측정 이벤트가 발생된 경우, E-UTRA 셀 리스트에 포함된 셀들에 대해 사전 측정(prior measurement)을 수행할 수 있다. 동작에서, 단말은 통화가 시작되었는지 여부를 식별할 수 있다. 이 경우, 단말은 사용자 입력에 기반하여, 통화가 시작되었는지 여부를 식별할 수 있다. 예를 들어, 단말은 사용자가 통화 걸기를 입력하면 통화가 시작된 것으로 식별할 수 있다. 또 다른 예를 들어, 단말은 사용자가 SMS 메시지 전송을 입력하면, 통화가 시작된 것으 로 식별할 수 있다. 단말은 통화가 시작된 것으로 식별되지 않고, 서빙 기지국이 변경되면 동작을 다시 수 행할 수 있다. 반면에, 단말은 통화가 시작된 것으로 식별되면, 동작을 수행할 수 있다. 동작에서, 단말은 후보(candidate) 셀들을 기지국에게 보고할 수 있다. 이 경우, 후보 셀들은 E-UTRA 셀들 중에서, 사전 측정을 수행한 결과에 기반하여 식별될 수 있다. 한편, 도 9에서는 동작이 동작보다 선 행하는 것으로 도시되어 있으나, 이는 예시일 뿐이다. 만약 사용자의 입력(예: 통화 걸기 또는 SMS 메시지 전송) 전에 사전 측정이 완료되는 경우, 동작이 동작보다 선행될 수 있다. 동작에서, 단말은 기지국으로부터 수신된 핸드오버 명령(command)에 따라 EPS로 핸드오버를 수행하고, VoLTE 통화를 수행할 수 있다.도 10은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 10은 단말이 RRC 연결 (connected) 상태에 있고, 측정 이벤트가 사전 측정(prior measurement)의 트리거 조건으로 사용되는 실시 예를 설명하기 위한 도면이다. 도 10의 동작 내지 동작은 단말이 NAS(non-access stratum) 등록 절차를 통해 네트워크의 VoNR 및 사전 측정에 대한 능력 정보를 획득하는 과정으로서, 도 4에 예시되어 있으므로, 설명은 생략한다. 동작에서, 단말은 시스템 정보(system information, SI)를 기지국으로부터 수신할 수 있다. 이 경우, 시 스템 정보는 E-UTRA 셀 리스트에 대한 정보를 포함할 수 있다. 여기서, 시스템 정보는 SIB(system information block)5에 해당할 수 있다. 동작에서, RRC 연결(connected) 상태에 있는 단말은 측정 이벤트를 식별할 수 있다. 측정 이벤트는 사전 측정(prior measurement)를 시작하는 트리거가 될 수 있다. 이러한 측정 이벤트는 사용자 입력에 기반하여 식별될 수 있다. 예를 들어, 단말은 사용자가 전화번호를 입력하면, 측정 이벤트가 발생된 것으로 식별할 수 있 다. 또 다른 예를 들어, 단말은 사용자가 SMS(short message service) 메시지를 입력하면, 측정 이벤트가 발생 된 것으로 식별할 수 있다. 동작에서, 단말은 측정 이벤트가 발생된 경우, E-UTRA 셀 리스트에 포함된 셀들에 대해 사전 측정(prior measurement)를 수행할 수 있다. 동작에서, 단말은 통화가 시작되었는지 여부를 식별할 수 있다. 이 경우, 단말은 사용자 입력에 기반하여, 통화가 시작되었는지 여부를 식별할 수 있다. 예를 들어, 단말은 사용자가 통화 걸기를 입력하면 통 화가 시작된 것으로 식별할 수 있다. 또 다른 예를 들어, 단말은 사용자가 SMS 메시지 전송을 입력하면, 통화가 시작된 것으로 식별할 수 있다. 동작에서, 단말은 후보(candidate) 셀들을 기지국에게 보고할 수 있다. 이 경우, 후보 셀들은 E-UTRA 셀 들 중에서, 사전 측정을 수행한 결과에 기반하여 식별될 수 있다. 동작에서, 기지국은 EPS 폴백을 트리거 할 수 있다. 동작에서, 기지국은 단말에게 핸드오버 명령(command)을 전송할 수 있다. 이 경우, 단말은 EPS의 지시된 타겟 셀로 핸드오버를 수행할 수 있다. 그 결과, 5GS(5th generation system)의 MO(mobile originated) 음성 세션은 EPS로 전달될 수 있다. 도 11은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 11은 단말이 RRC 비활성 (inactive) 상태에 있고, INVITE 메시지의 전송이 사전 측정(prior measurement)의 트리거 조건으로 사용되는 실시 예를 설명하기 위한 도면이다. 도 11의 동작 내지 동작은 단말이 NAS(non-access stratum) 등록 절차를 통해 네트워크의 VoNR 및 사전 측정에 대한 능력 정보를 획득하는 과정으로서, 도 4에 예시되어 있으므로, 설명은 생략한다. 동작에서, 단말은 기지국으로부터 RRC 해제(release) 메시지를 수신할 수 있다. 이 경우, RRC 해제 메시 지는 전용(dedicated) 측정 설정 정보를 포함할 수 있다. 전용 측정 설정 정보는 RRC 비활성 상태에서 E-UTRA 반송파(carrier)의 측정을 요청하는 정보 또는 E-UTRA 셀 리스트에 대한 정보 중 적어도 하나를 포함할 수 있다. 동작에서, 단말은 수신된 RRC 해제 메시지에 기반하여, RRC 비활성 상태로 천이할 수 있다. 동작에 서, 단말은 통화가 시작되었는지 여부를 식별할 수 있다. 이 경우, 단말은 INVITE 메시지를 IMS에게 전송한 경 우, 통화가 시작된 것으로 식별할 수 있다. 단말이 INVITE 메시지를 전송하는 경우는 MO(mobile originated)로 지칭될 수 있다. 동작에서, 단말은, 통화가 시작된 것으로 식별된 경우, E-UTRA 셀 리스트에 포함된 셀들 에 대해 사전 측정(prior measurement)을 수행할 수 있다. 단말은 사전 측정 수행 결과에 기반하여, E-UTRA 셀 리스트에 포함된 셀들 중에서 후보 셀들을 식별할 수 있다. 동작에서, 단말은 RRC 재개 완료 메시지를 기 지국에게 전송할 수 있다. 여기서, RRC 재개 완료 메시지는 식별된 후보 셀들에 대한 정보가 포함될 수 있다. 동작에서, 기지국은 EPS 폴백을 트리거 할 수 있다. 동작에서, 단말은 핸드오버 명령(command)를 기지국으로부터 수신할 수 있다. 이 경우, 단말은 EPS의 지시된 타겟 셀로 핸드오버를 수행할 수 있다. 그 결과, 5GS(5th generation system)의 MO(mobile originated) IMS 음성 세션은 EPS로 전달될 수 있다.도 12는 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 11은 단말이 RRC 비활성 (inactive) 상태에 있고, INVITE 메시지의 수신이 사전 측정(prior measurement)의 트리거 조건으로 사용되는 실시 예를 설명하기 위한 도면이다. 도 12의 동작 내지 동작은 단말이 NAS(non-access stratum) 등록 절차를 통해 네트워크의 VoNR 및 사전 측정에 대한 능력 정보를 획득하는 과정으로서, 도 4에 예시되어 있으므로, 설명은 생략한다. 동작에서, 단말은 기지국으로부터, RRC 해제(release) 메시지를 수신할 수 있다. 이 경우, RRC 해제 메시 지는 전용(dedicated) 측정 설정 정보를 포함할 수 있다. 전용 측정 설정 정보는 RRC 비활성 상태에서 E-TURA 반송파(carrier)의 측정을 요청하는 정보 또는 E-UTRA 셀 리스트에 대한 정보 중 적어도 하나를 포함할 수 있다. 동작에서, 단말은 수신된 RRC 해제 메시지에 기반하여, RRC 비활성 상태로 천이할 수 있다. 동작에서, 단말은 페이징(paging) 메시지를 수신하고 RRC 재개 절차를 수행할 수 있다. 예를 들어, 다음 과 같이 구성될 수 있다. 단말은 기지국으로부터 페이징 메시지를 수신할 수 있다. 페이징 메시지는 단말에 착 신호가 발생하였을 때, 단말이 위치하는 영역의 기지국을 통하여 단말을 호출하는 것을 지칭할 수 있다. 이 경 우, 단말은 RRC 연결 상태로 천이하기 위해 기지국에게 RRC 재개 요청 메시지를 전송할 수 있다. 단말은 기지국 으로부터 RRC 재개 메시지를 수신하고, RRC 연결 상태로 천이할 수 있다. 단말은 RRC 연결 상태로 천이한 후, RRC 재개 완료 메시지를 기지국에게 전송할 수 있다. 동작에서, 단말은 IMS로부터 MT(mobile terminated) 음성에 대한 INVITE 메시지를 수신할 수 있다. 동작 에서, 단말은 후보 셀들에 대한 정보를 기지국에게 전송할 수 있다. 이 경우, 후보 셀들에 대한 정보는 상술한 RRC 재개 완료 메시지에 포함될 수 있다. 동작에서, 기지국은 EPS 폴백을 트리거 할 수 있다. 동 작에서, 단말은 핸드오버 명령(command)를 기지국으로부터 수신할 수 있다. 이 경우, 단말은 핸드오버 명 령에 의해 지시된 EPS의 타겟 셀로 핸드오버를 수행할 수 있다. 그 결과, 5GS(5th generation system)의 MT IMS 음성 세션은 EPS로 전달될 수 있다. 도 13은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 13은 단말이 RRC 비활성 (inactive) 상태에 있고, 측정 이벤트가 사전 측정(prior measurement)의 트리거 조건으로 사용되는 실시 예를 설명하기 위한 도면이다. 도 13의 동작 내지 동작은 단말이 NAS(non-access stratum) 등록 절차를 통해 네트워크의 VoNR 및 사전 측정에 대한 능력 정보를 획득하는 과정으로서, 도 4에 예시되어 있으므로, 설명은 생략한다. 동작에서, 단말은 기지국으로부터, RRC 해제(release) 메시지를 수신할 수 있다. 이 경우, RRC 해제 메시 지는 전용(dedicated) 측정 설정 정보를 포함할 수 있다. 전용 측정 설정 정보는 RRC 비활성 상태에서 E-UTRA 반송파(carrier)의 측정을 요청하는 정보 또는 E-UTRA 셀 리스트에 대한 정보 중 적어도 하나를 포함할 수 있다. 동작에서, 단말은 수신된 RRC 해제 메시지에 기반하여, RRC 비활성 상태로 천이할 수 있다. 동작에서, 단말은 측정 이벤트의 발생을 식별할 수 있다. 측정 이벤트는 사전 측정(prior measurement)를 시작하는 트리거가 될 수 있다. 이러한 측정 이벤트는 사용자 입력에 기반하여 식별될 수 있다. 예를 들어, 단 말은 사용자가 전화번호를 입력하면, 측정 이벤트가 발생된 것으로 식별할 수 있다. 또 다른 예를 들어, 단말은 사용자가 SMS(short message service) 메시지를 입력하면, 측정 이벤트가 발생된 것으로 식별할 수 있다. 동작에서, 단말은 측정 이벤트가 발생된 경우, E-UTRA 셀 리스트에 포함된 셀들에 대해 사전 측정(prior measurement)를 수행할 수 있다. 동작에서, 단말은 통화의 시작 여부를 식별할 수 있다. 이 경우, 단말은 사용자 입력에 기반하여, 통화의 시작 여부를 식별할 수 있다. 예를 들어, 단말은 사용자가 통화 걸기를 입력하면 통화가 시작된 것으로 식별할 수 있다. 또 다른 예를 들어, 단말은 사용자가 SMS 메시지 전송을 입력하면, 통화가 시작된 것으로 식별할 수 있다.동작에서, 단말은 통화가 시작된 것으로 식별된 경우 RRC 재개 절차를 수행할 수 있다. 예를 들어, 다음 과 같이 구성될 수 있다. 단말은 RRC 연결 상태로 천이하기 위해 기지국에게 RRC 재개 요청 메시지를 전송할 수 있다. 단말은 기지국으로부터 RRC 재개 메시지를 수신하고, RRC 연결 상태로 천이할 수 있다. 단말은 RRC 연결 상태로 천이한 후, RRC 재개 완료 메시지를 기지국에게 전송할 수 있다. 이 경우, RRC 재개 완료 메시지는 사전 측정 결과에 기반하여 식별된 후보 셀들에 대한 정보를 포함할 수 있다. 동작에서, 기지국은 EPS 폴백을 트리거 할 수 있다. 동작에서, 단말은 핸드오버 명령(handover command)를 기지국으로부터 수신할 수 있 다. 이 경우, 핸드오버 명령은 후보 셀들 중에서 선택된 타겟 셀에 대한 정보를 포함할 수 있다. 단말은 핸드오 버 명령에 의해 지시된 EPS의 타겟 셀로 핸드오버를 수행할 수 있다. 그 결과, 5GS(5th generation system)의 MO IMS 음성 세션은 EPS로 전달될 수 있다. 도 14는 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 14는 단말이 RRC 비활성 (inactive) 상태에 있고, INVITE 메시지의 전송이 사전 측정(prior measurement)의 트리거 조건으로 사용되는 실시 예를 설명하기 위한 도면이다. 도 14의 동작 내지 동작은 단말이 NAS(non-access stratum) 등록 절차를 통해 네트워크의 VoNR 및 사전 측정에 대한 능력 정보를 획득하는 과정으로서, 도 4에 예시되어 있으므로, 설명은 생략한다. 동작에서, 단말은 RRC 해제 메시지를 기지국으로부터 수신할 수 있다. 이 경우, RRC 해제 메시지는 전용 (dedicated) 측정 설정 정보를 포함할 수 있다. 전용 측정 설정 정보는 RRC 유휴 상태에서 E-UTRA 반송파 (carrier)의 측정을 요청하는 정보 또는 E-TURA 셀 리스트에 대한 정보 중 적어도 하나를 포함할 수 있다. 동작에서, 단말은 수신된 RRC 해제 메시지에 기반하여, RRC 유휴 상태로 천이할 수 있다. 동작에서, 단말은 통화의 시작 여부를 식별할 수 있다. 이 경우, 단말은 사용자 입력에 기반하여, 통화의 시작 여부를 식별할 수 있다. 예를 들어, 단말은 사용자가 통화 걸기를 입력하면 통화가 시작된 것으로 식별할 수 있다. 동작에서, 단말은 통화가 시작된 것으로 식별되면, RRC 셋업 설정 절차를 수행할 수 있다. 단말은 RRC 셋 업 요청 메시지를 기지국에게 전송할 수 있다. 단말은 기지국으로부터 RRC 셋업 메시지를 수신할 수 있다. 단말 은 RRC 연결 상태로 천이한 후, RRC 셋업 완료 메시지를 기지국에게 전송할 수 있다. 동작에서, 단말은 통화를 요청하기 위해 MO(mobile originated) 음성에 대한 INVITE 메시지를 IMS에게 전송할 수 있다. 동작에서, 단말은 INVITE 메시지를 전송한 후, 후보 셀들에 대한 정보를 기지국에게 전 송할 수 있다. 동작에서, 기지국은 EPS 폴백을 트리거 할 수 있다. 동작에서, 단말은 핸드오버 명 령(command)를 기지국으로부터 수신할 수 있다. 이 경우, 핸드오버 명령은 후보 셀들 중에서 선택된 타겟 셀에 대한 정보를 포함할 수 있다. 단말은 핸드오버 명령에 의해 지시된 EPS의 타겟 셀로 핸드오버를 수행할 수 있다. 그 결과, 5GS의 MO IMS 음성 세션은 EPS로 전달될 수 있다. 도 15는 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 15는 단말이 RRC 유휴(idle) 상태에 있고, 측정 이벤트가 사전 측정(prior measurement)의 트리거 조건으로 사용되는 실시 예를 설명하기 위 한 도면이다. 도 15의 동작 내지 동작은 단말이 NAS(non-access stratum) 등록 절차를 통해 네트워크의 VoNR 및 사전 측정에 대한 능력 정보를 획득하는 과정으로서, 도 4에 예시되어 있으므로, 설명은 생략한다. 동작에서, 단말은 RRC 해제 메시지를 기지국으로부터 수신할 수 있다. 이 경우, RRC 해제 메시지는 전용 (dedicated) 측정 설정 정보를 포함할 수 있다. 전용 측정 설정 정보는 RRC 유휴 상태에서 E-UTRA 반송파 (carrier)의 측정을 요청하는 정보 또는 E-UTRA 셀 리스트에 대한 정보 중 적어도 하나를 포함할 수 있다. 동작에서, 단말은 수신된 RRC 해제 메시지에 기반하여, RRC 유휴 상태로 천이할 수 있다. 동작에서, 단말은 측정 이벤트의 발생 여부를 식별할 수 있다. 측정 이벤트는 사전 측정(prior measurement)를 시작하는 트리거가 될 수 있다. 이러한 측정 이벤트는 사용자 입력에 기반하여 식별될 수 있다. 예를 들어, 단말은 사용자가 전화번호를 입력하면, 측정 이벤트가 발생된 것으로 식별할 수 있다. 또 다른 예를 들어, 단말은 사용자가 SMS(short message service) 메시지를 입력하면, 측정 이벤트가 발생된 것으로 식별할수 있다. 동작에서, 단말은 측정 이벤트가 발생된 경우, E-TURA 셀 리스트에 포함된 셀들에 대해 사전 측정(prior measurement)을 수행할 수 있다. 동작에서, 단말은 통화가 시작되었는지 여부를 식별할 수 있다. 이 경우, 단말은 사용자 입력에 기반하여, 통화가 시작되었는지 여부를 식별할 수 있다. 예를 들어, 단말은 사용자가 통화 걸기를 입력하면 통 화가 시작된 것으로 식별할 수 있다. 또 다른 예를 들어, 단말은 사용자가 SMS 메시지 전송을 입력하면, 통화가 시작된 것으로 식별할 수 있다. 동작에서, 단말은 통화가 시작된 것으로 식별되면, RRC 셋업 설정 절차를 수행할 수 있다. 단말은 RRC 셋 업 요청 메시지를 기지국에게 전송할 수 있다. 단말은 기지국으로부터 RRC 셋업 메시지를 수신할 수 있다. 단말 은 RRC 연결 상태로 천이한 후, RRC 셋업 완료 메시지를 기지국에게 전송할 수 있다. 동작에서, 단말은 통화를 요청하기 위해 MO(mobile originated) 음성에 대한 INVITE 메시지를 IMS에게 전송할 수 있다. 동작에서, 단말은 INVITE 메시지를 전송한 후, 후보 셀들에 대한 정보를 기지국에게 전 송할 수 있다. 동작에서, 기지국은 EPS 폴백을 트리거 할 수 있다. 동작에서, 단말은 핸드오버 명 령(command)을 기지국으로부터 수신할 수 있다. 이 경우, 핸드오버 명령은 후보 셀들 중에서 선택된 타겟 셀에 대한 정보를 포함할 수 있다. 단말은 핸드오버 명령에 의해 지시된 EPS의 타겟 셀로 핸드오버를 수행할 수 있다. 그 결과, 5GS의 MO IMS 음성 세션은 EPS로 전달될 수 있다. 도 16은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 16에서는 5GC(5th generation core network)가 SMSoIMS(short message service over internet protocol multimedia system) 및 SMSoNAS(SMS over non-access stratum)을 지원하지 않는 경우, 단말이 사전 측정을 수행하는 실시 예를 설명한다. 여기서, SMSoIMS는 SMS를 IMS를 통해 송수신하는 것을 지칭할 수 있다. 또한, SMSoNAS는 SMS를 NAS를 통해 송수신하는 것을 지칭할 수 있다. 5GC가 SMSoIMS 및 SMSoNAS를 지원하지 않는 경우에, 단말이 SMS를 전송하게 되면 EPS 폴백이 트리거 될 것으로 쉽게 예상할 수 있다. 따라서, 5GC가 SMSoIMS 및 SMSoNAS를 지원하지 않는다면, 단말이 사전에 E-UTRA 셀 리스 트에 대한 사전 측정(prior measurement)을 수행함으로써, 통화 셋업 시간(setup time)을 감소시킬 필요가 있다. 먼저, 단말은 5GC가 SMSoIMS 및 SMSoNAS를 지원하는지 여부를 확인할 필요가 있다. 도 16을 참조하면, 동작에서, 단말은 등록 요청 메시지를 5GC에게 전송할 수 있다. 여기서, 5GC는 AMF를 의미할 수 있다. 동작에서, 기지국은 5GC로부터 단말 무선 능력 확인 요청(UE radio capability check request) 메시지를 기지국에게 전송할 수 있다. 동작 및 동작에서, 기지국은 단말 능력 질의(UE radio capability enquiry) 메시지를 단말에게 전송하고, 단말로부터 단말 능력 정보(UE capability information)를 수신할 수 있다. 여기서, 단말 능력 정보는 단말의 SMSoIMS 지원 여부에 대한 정보 및 단말의 SMSoNAS 지원 여부에 대한 정보를 포함할 수 있다. 동작에서, 기지국은 단말 무선 능력 확인 응답(UE radio capability check response) 메시지를 5GC에게 전송할 수 있다. 동작에서, 5GC는 기지국에게 초기 컨텍스트 설정 요청을 전송할 수 있다. 동작에서, 5GC는 등록 승인(registration request) 메시지를 단말 에게 전송할 수 있다. 여기서, 등록 승인 메시지는 5GC의 SMSoIMS 지원 여부에 대한 정보 및 5GC의 SMSoNAS 지 원 여부에 대한 정보를 포함할 수 있다. 단말은 수신된 등록 승인 메시지에 기반하여, 5GC의 SMSoIMS 지원 여부 및 5GC의 SMSoNAS 지원 여부를 확인할 수 있다. 단말은 5GC가 SMSoIMS 및 SMSoNAS를 지원하지 않는 것으로 확인 되면, 기지국에게 시스템 정보의 전송을 요청할 수 있다. 여기서, 시스템 정보(예 SIB(system information block)5)는 E-UTRA 셀 리스트에 대한 정보를 포함할 수 있다. 동작에서, 단말은 요청된 시스템 정보를 기 지국으로부터 수신할 수 있다. 동작에서, 단말은 사용자의 SMS 입력을 식별할 수 있다. 여기서, 사용자의 SMS 입력은 사전 측정(prior measurement)을 시작하는 트리거가 될 수 있다. 동작에서, 단말은 E-UTRA 셀 리스트에 포함된 셀들에 대 해 사전 측정을 수행할 수 있다. 동작에서 단말은 5GS에서 SMS를 전송할 수 있다. 5GC는 SMSoIMS 및 SMSoNAS를 지원하지 않으므로, 단말은 곧 E-UTRA 폴백이 트리거 될 것으로 예상할 수 있다. 동작에서, 단 말은 후보 셀들에 대한 정보를 기지국에게 전송할 수 있다. 동작에서, 기지국은 E-UTRA 폴백을 트리거 할 수 있다. 동작에서, 단말은 기지국으로부터 핸드오버 명령(handover command)을 수신할 수 있다. 이 경우, 핸드오버 명령은 후보 셀들 중에서 선택된 타겟 셀에 대한 정보를 포함할 수 있다. 단말은 핸드오버 명령에 의해 지시된 EPS 타겟 셀로 핸드오버를 수행하고, LTE를 통해 SMS 송수신을 할 수 있다. 도 17은 본 개시의 실시 예들에 따른 단말의 구성을 도시한다. 도 17을 참고하면, 단말은 프로세서, 메모 리, 송수신기를 포함할 수 있다. 프로세서는 단말의 전반적인 동작을 제어할 수 있다. 예를 들어, 프로세서는 송수신기를 통 해 신호를 송신 및 수신할 수 있다. 또한, 프로세서는 통신 규격에서 요구하는 프로토콜 스택(protocol stack)의 기능들을 수행할 수 있다. 이를 위해, 프로세서는 적어도 하나의 프로세서를 포함할 수 있다. 또한, 프로세서는 단말이 전술된 실시 예들에 따른 동작들을 수행하도록 제어할 수 있다. 메모리는 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장할 수 있다. 메모리는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있다. 메모리는 프로세서의 요청에 따라 저장된 데이터를 제공할 수 있다. 송수신기는 유선 채널 또는 무선 채널을 통해 신호를 송수신하기 위한 기능들을 수행할 수 있다. 예를 들 어, 송수신기는 시스템의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기능을 수행할 수 있 다. 예를 들어, 데이터 송신 시, 송수신기는 송신 비트열을 부호화 및 변조함으로써 복소 심볼들을 생성 할 수 있다. 또한, 데이터 수신 시, 송수신기는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열로 복원할 수 있다. 또한, 송수신기는 기저대역 신호를 RF(radio frequency) 대역 신호로 상향 변환한 후 안 테나를 통해 송신하고, 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향 변환할 수 있다. 이를 위 해, 송수신기는 송신 필터, 수신 필터, 증폭기, 믹서, 오실레이터, DAC(digital-to-analog converter), ADC(analog-to-digital converter) 등을 포함할 수 있다. 또한, 송수신기는 안테나부를 포함할 수 있다. 송수신기는 다수의 안테나 요소(antenna element)들로 구성된 적어도 하나의 안테나 어레이(antenna array)를 포함할 수 있다. 하드웨어의 측면에서, 송수신기는 디지털 및 아날로그 회로(예: RFIC(radio frequency integrated circuit))로 구성될 수 있다. 여기서, 디지털 및 아날로그 회로는 하나의 패키지로 구현 될 수 있다. 또한, 송수신기는 다수의 RF 체인들을 포함할 수 있다. 또한, 송수신기는 신호를 송수 신할 수 있다. 이를 위해, 송수신기는 적어도 하나의 송수신기를 포함할 수 있다. 도 18은 본 개시의 실시 예들에 따른 기지국의 구성을 도시한다. 도 18을 참고하면, 기지국은 프로세서, 메모리, 송수신기를 포함할 수 있다. 프로세서는 기지국의 전반적인 동작을 제어할 수 있다. 예를 들어, 프로세서는 송수신기를 통해 신호를 송신 및 수신할 수 있다. 또한, 프로세서는 통신 규격에서 요구하는 프로토콜 스택(protocol stack)의 기능들을 수행할 수 있다. 이를 위해, 프로세서는 적어도 하나의 프로세서를 포함할 수 있다. 또한, 프로세서는 기지국이 전술된 실시 예들에 따른 동작들을 수행하도록 제어할 수 있다. 메모리는 기지국의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장할 수 있다. 메모리는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성 될 수 있다. 메모리는 프로세서의 요청에 따라 저장된 데이터를 제공할 수 있다. 송수신기는 유선 채널 또는 무선 채널을 통해 신호를 송수신하기 위한 기능들을 수행할 수 있다. 예를 들 어, 송수신기는 시스템의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기능을 수행할 수 있 다. 예를 들어, 데이터 송신 시, 송수신기는 송신 비트열을 부호화 및 변조함으로써 복소 심볼들을 생성 할 수 있다. 또한, 데이터 수신 시, 송수신기는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열로 복원할 수 있다. 또한, 송수신기는 기저대역 신호를 RF(radio frequency) 대역 신호로 상향 변환한 후 안 테나를 통해 송신하고, 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향 변환할 수 있다. 이를 위 해, 송수신기는 송신 필터, 수신 필터, 증폭기, 믹서, 오실레이터, DAC(digital-to-analog converter), ADC(analog-to-digital converter) 등을 포함할 수 있다. 또한, 송수신기는 안테나부를 포함할 수 있다. 송수신기는 다수의 안테나 요소(antenna element)들로 구성된 적어도 하나의 안테나 어레이(antenna array)를 포함할 수 있다. 하드웨어의 측면에서, 송수신기는 디지털 및 아날로그 회로(예: RFIC(radio frequency integrated circuit))로 구성될 수 있다. 여기서, 디지털 및 아날로그 회로는 하나의 패키지로 구현 될 수 있다. 또한, 송수신기는 다수의 RF 체인들을 포함할 수 있다. 또한, 송수신기는 신호를 송수신할 수 있다. 이를 위해, 송수신기는 적어도 하나의 송수신기를 포함할 수 있다. 도 19는 본 개시의 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 19의 전자 장치는 도 16 의 단말에 대응할 수 있다. 도 19을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크 (예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있 다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈 , 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모 듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나 의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘 발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로 세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일 부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예 에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따 르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행 되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경 망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사 항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하 여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치 와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1902, 또는 1904) 각각은 전자 장 치와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작 들의 전부 또는 일부는 외부의 전자 장치들(1902, 1904, 또는 1908) 중 하나 이상의 외부의 전자 장치들에서 실 행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로 부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대 신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라 고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달 할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어 도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅 (MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예 를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버(190 8)는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 본 개시의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또 는 복수 개를 포함할 수 있다. 본 개시에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",\"A 또는 B 중 적어도 하 나,\"\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,\"및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소 와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다 른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미 한다. 본 개시에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들 면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치 들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리 와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소 들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6a 도면6b 도면6c 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19"}
{"patent_id": "10-2022-0011583", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시 예들에 따른 EPS(evolved packet system) 폴백(fallback) 절차를 도시한다. 도 2는 본 개시의 실시 예들에 따른 조건부 핸드오버(conditional handover, CHO)의 절차를 도시한다. 도 3은 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작을 도시한다. 도 4는 본 개시의 실시 예들에 따른 단말 등록 절차의 신호 흐름을 도시한다. 도 5는 본 개시의 실시 예들에 따른 E-UTRA(evolved-universal terrestrial radio access) 셀 리스트를 관리하 는 단말의 동작 흐름을 도시한다. 도 6a는 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작 흐름을 도시한다. 도 6b는 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작 흐름을 도시한다. 도 6c는 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작 흐름을 도시한다. 도 7은 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작 흐름을 도시한다. 도 8은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 9는 본 개시의 실시 예들에 따른 EPS 폴백을 위한 단말의 동작 흐름을 도시한다. 도 10은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 11은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 12는 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 13은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 14는 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 15은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 16은 본 개시의 실시 예들에 따른 EPS 폴백 절차의 신호 흐름을 도시한다. 도 17은 본 개시의 실시 예들에 따른 단말의 구성을 도시한다. 도 18은 본 개시의 실시 예들에 따른 기지국의 구성을 도시한다. 도 19는 본 개시의 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다."}
