{"patent_id": "10-2023-0151948", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0015713", "출원번호": "10-2023-0151948", "발명의 명칭": "완충 장치 및 이를 포함하는 초음파 진단 장치 조립체", "출원인": "삼성메디슨 주식회사", "발명자": "김완기"}}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "본체 및 상기 본체에 결합되는 핸들부를 구비하는 초음파 영상 장치를 둘러싸는 완충 장치로서,상기 본체의 외주부와 상기 핸들부의 외주부를 둘러싸는 제1 완충부; 및상기 제1 완충부와 소정의 간격을 사이에 두고 이격되도록 배치되며, 상기 본체와 상기 핸들부 사이에 배치되는제2 완충부;를 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제1 완충부와 상기 제2 완충부를 연결하는 연결부;를 더 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제1 완충부, 상기 제2 완충부 및 상기 연결부 중 하나 이상은 일체로 형성되는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 제2 완충부는 일 방향을 따라 상호 이격되도록 배치되는 제2-1 완충부재 및 제2-2 완충부재를 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 핸들부는 상기 초음파 영상 장치의 두께 방향을 따라 핸들부 두께를 구비하며,상기 핸들부와 마주보도록 배치되는 상기 제1 완충부의 일부 영역은 상기 초음파 영상 장치의 두께 방향을 따라상기 핸들부 두께 이하의 두께를 구비하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 본체는 상기 초음파 영상 장치의 두께 방향을 따라 본체 두께를 구비하며,상기 제1 완충부 중 하나 이상의 영역은 상기 초음파 영상 장치의 두께 방향을 따라 상기 본체 두께를 초과하는수직 완충부 두께를 구비하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,공개특허 10-2025-0015713-3-상기 제2 완충부는 상기 본체의 일면을 지지하여 상기 제2 완충부에 대한 상기 본체의 위치를 고정시키는 제1고정부를 포함하고,상기 제1 완충부는 상기 본체의 다른 일면을 지지하여 상기 제1 완충부에 대한 상기 본체의 위치를 고정시키는제2 고정부를 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 본체의 일면에 홈부가 배치되며, 상기 제1 고정부는 상기 홈부에 대응되는 형상의 단차부를 포함하고,상기 본체의 다른 일면에 복수 개의 돌기부가 배치되며, 상기 제2 고정부는 상기 복수 개의 돌기부에 대응되는복수 개의 홈부를 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 본체의 일면을 가로지르도록 배치되며, 양 단부 또는 일 단부가 상기 제1 완충부 또는 상기 제2 완충부에탈착 가능하도록 배치되는 밴드 고정부;를 더 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 본체의 일면에 배치되는 흡기부와 소정의 간격을 사이에 두고 마주보도록 배치되는 흡기 유로부; 및상기 본체의 다른 일면에 배치되는 배기부와 소정의 간격을 사이에 두고 마주보도록 배치되는 배기 유로부;를더 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 흡기 유로부는 일 방향을 따라 연장된 복수 개의 흡기 유로를 구비하고,상기 배기 유로부는 복수 개의 배기홀을 구비하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 제1 완충부 및 상기 제2 완충부 중 하나 이상은 탄성 재질을 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 탄성 재질은 실리콘 고무, 에틸렌 초산 비닐 (EVA: Ethylene Vinyl Acetate). EPDM 고무(ethylenepropylene diene Monomer rubber), 불소 고무(fluoro elastomers), NBR 고무 (acrylonitrile butadienerubber), SBR 고무(Styrene Butadiene Rubber), NR 고무(Natural Rubber), CR 고무(chloroprene rubber), 확장형 폴리에틸렌(EPE: Expandable Polyethylene), 확장형 폴리프로필렌(EPP: Expanded polypropylene), 확장형공개특허 10-2025-0015713-4-폴리스티렌(EPS: Expanded Polystyrene), 플라스틱(Plastic) 중 하나 이상을 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서,상기 제1 완충부의 중심부에 삽입되도록 배치되는 보강 부재를 더 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서,상기 보강 부재는 상기 제1 완충부와 상이한 물질을 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 1 항에 있어서,상기 제1 완충부 및 상기 제2 완충부 중 하나 이상의 내부에 배치되며, 다각형 또는 원형 단면 중 하나 이상을구비하는 복수 개의 충격 완화부를 더 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1 항에 있어서,상기 본체의 일면에 하나 이상의 커넥터가 배치되며, 상기 하나 이상의 커넥터와 대응되는 위치에 배치되는 커넥터 홀; 및상기 커넥터 홀을 개폐하는 커넥터 홀 개폐부;를 더 포함하는완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 본체의 커넥터에 연결되는 프로브에 소정의 홈부가 배치되며,상기 홈부에 대응되는 형상으로 마련되어 상기 홈부를 지지하는 충격 완화 단차부;를 더 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 1 항에 있어서,상기 본체에 소정의 홈부가 배치되며,상기 홈부에 대응되는 형상으로 마련되며, 상기 홈부에 삽입되어 외부로부터 유입되는 이물질을 차단하는 방수부;를 더 포함하는,완충 장치."}
{"patent_id": "10-2023-0151948", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "상기 제1항 내지 제19항 중 어느 한 항에 따른 완충 장치;본체, 상기 본체에 결합되는 핸들부를 구비하는 초음파 영상 장치 및 상기 초음파 영상 장치와 연결되는 프로브공개특허 10-2025-0015713-5-를 포함하는 초음파 진단 장치;를 포함하는, 초음파 진단 장치 조립체."}
{"patent_id": "10-2023-0151948", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 예시에 따라 본체 및 상기 본체에 결합되는 핸들부를 구비하는 초음파 영상 장치를 둘러싸는 완충 장치로서, 상기 본체의 외주부와 상기 핸들부의 외주부를 둘러싸는 제1 완충부 및 상기 제1 완충부와 소정의 간격을 사이에 두고 이격되도록 배치되며, 상기 본체와 상기 핸들부 사이에 배치되는 제2 완충부를 포함할 수 있다."}
{"patent_id": "10-2023-0151948", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 완충 장치 및 이를 포함하는 초음파 진단 장치 조립체에 관한 것이다."}
{"patent_id": "10-2023-0151948", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래 의료분야에서는 각종 질병의 조기 진단 또는 수술을 목적으로 인체의 생체 조직에 대한 정보를 영상화하여 획득하기 위한 각종 의료 영상 장치가 널리 이용되고 있다. 이러한 의료 영상 장치의 대표적인 예로는 초음파 진단 장치, CT(Computed Tomography) 장치, MRI(Magnetic Resonance Imaging) 장치를 포함할 수 있다. 초음파 진단 장치는 프로브(probe)의 트랜스듀서(transducer)로부터 생성되는 초음파 신호를 대상체로 조사하고, 대상체로부터 반사된 신호의 정보를 수신하여 대상체 내부의 부위(예를 들면, 연조직 또는 혈류)에 대한 적어도 하나의 영상을 비침습으로 획득하는 장치이다. 초음파 진단 장치는 대상체 내부의 관찰, 이물질 검 출, 및 상해 측정 등 의학적 목적으로 사용될 수 있다. 이러한 초음파 진단 장치는 X선을 이용하는 영상 장치에 비하여 안정성이 높고, 실시간으로 영상의 디스플레이가 가능하며, 방사능 피폭이 없어 안전하다는 장점이 있어 서 다른 화상 영상 장치와 함께 널리 이용된다. 초음파 진단 장치는 사용 목적에 따라 이동 가능한 포터블 형태로 구현될 수 있다. 초음파 진단 장치를 이동시 키는 과정에서 외부 충격에 의해 초음파 진단 장치가 파손될 위험이 증가될 수 있다."}
{"patent_id": "10-2023-0151948", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "외부에서 인가되는 충격으로부터 초음파 진단 장치를 보호하는 완충 장치 및 이를 포함하는 초음파 진단 장치 조립체를 제공한다. 초음파 진단 장치에 완충 장치가 배치된 상태에서, 사용자 편의성이 향상된 완충 장치 및 이를 포함하는 초음파 진단 장치 조립체를 제공한다."}
{"patent_id": "10-2023-0151948", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 예시에 따른 본체 및 상기 본체에 결합되는 핸들부를 구비하는 초음파 영상 장치를 둘러싸는 완충 장치는, 상기 본체의 외주부와 상기 핸들부의 외주부를 둘러싸는 제1 완충부 및 상기 제1 완충부와 소정의 간격을 사이 에 두고 이격되도록 배치되며, 상기 본체와 상기 핸들부 사이에 배치되는 제2 완충부를 포함할 수 있다. 상기 제1 완충부와 상기 제2 완충부를 연결하는 연결부를 더 포함할 수 있다. 상기 제1 완충부, 상기 제2 완충부 및 상기 연결부 중 하나 이상은 일체로 형성될 수 있다. 상기 제2 완충부는 일 방향을 따라 상호 이격되도록 배치되는 제2-1 완충부재 및 제2-2 완충부재를 포함할 수 있다. 상기 핸들부는 상기 초음파 영상 장치의 두께 방향을 따라 핸들부 두께를 구비하며, 상기 핸들부와 마주보도록 배치되는 상기 제1 완충부의 일부 영역은 상기 초음파 영상 장치의 두께 방향을 따라 상기 핸들부 두께 이하의 두께를 구비할 수 있다. 상기 본체는 상기 초음파 영상 장치의 두께 방향을 따라 본체 두께를 구비하며, 상기 제1 완충부 중 하나 이상 의 영역은 상기 초음파 영상 장치의 두께 방향을 따라 상기 본체 두께를 초과하는 수직 완충부 두께를 구비할 수 있다. 상기 제2 완충부는 상기 본체의 일면을 지지하여 상기 제2 완충부에 대한 상기 본체의 위치를 고정시키는 제1 고정부를 포함하고, 상기 제1 완충부는 상기 본체의 다른 일면을 지지하여 상기 제1 완충부에 대한 상기 본체의위치를 고정시키는 제2 고정부를 포함할 수 있다. 상기 본체의 일면에 홈부가 배치되며, 상기 제1 고정부는 상기 홈부에 대응되는 형상의 단차부를 포함하고, 상 기 본체의 다른 일면에 복수 개의 돌기부가 배치되며, 상기 제2 고정부는 상기 복수 개의 돌기부에 대응되는 복 수 개의 홈부를 포함할 수 있다. 상기 본체의 일면을 가로지르도록 배치되며, 양 단부 또는 일 단부가 상기 제1 완충부 또는 상기 제2 완충부에 탈착 가능하도록 배치되는 밴드 고정부;를 더 포함할 수 있다. 상기 본체의 일면에 배치되는 흡기부와 소정의 간격을 사이에 두고 마주보도록 배치되는 흡기 유로부 및 상기 본체의 다른 일면에 배치되는 배기부와 소정의 간격을 사이에 두고 마주보도록 배치되는 배기 유로부를 더 포함 할 수 있다. 상기 흡기 유로부는 일 방향을 따라 연장된 복수 개의 흡기 유로를 구비하고, 상기 배기 유로부는 복수 개의 배 기홀을 구비할 수 있다. 상기 제1 완충부 및 상기 제2 완충부 중 하나 이상은 탄성 재질을 포함할 수 있다. 상기 탄성 재질은 실리콘 고무, 에틸렌 초산 비닐 (EVA: Ethylene Vinyl Acetate). EPDM 고무(ethylene propylene diene Monomer rubber), 불소 고무(fluoro elastomers), NBR 고무 (acrylonitrile butadiene rubber), SBR 고무(Styrene Butadiene Rubber), NR 고무(Natural Rubber), CR 고무(chloroprene rubber), 확 장형 폴리에틸렌(EPE: Expandable Polyethylene), 확장형 폴리프로필렌(EPP: Expanded polypropylene), 확장형 폴리스티렌(EPS: Expanded Polystyrene), 플라스틱(Plastic) 중 하나 이상을 포함할 수 있다. 상기 제1 완충부의 중심부에 삽입되도록 배치되는 보강 부재를 더 포함할 수 있다. 상기 보강 부재는 상기 제1 완충부와 상이한 물질을 포함할 수 있다. 상기 제1 완충부 및 상기 제2 완충부 중 하나 이상의 내부에 배치되며, 다각형 또는 원형 단면 중 하나 이상을 구비하는 복수 개의 충격 완화부를 더 포함할 수 있다. 상기 본체의 일면에 하나 이상의 커넥터가 배치되며, 상기 하나 이상의 커넥터와 대응되는 위치에 배치되는 커 넥터 홀 및 상기 커넥터 홀을 개폐하는 커넥터 홀 개폐부를 더 포함할 수 있다. 상기 본체의 커넥터에 연결되는 프로브에 소정의 홈부가 배치되며, 상기 홈부에 대응되는 형상으로 마련되어 상 기 홈부를 지지하는 충격 완화 단차부;를 더 포함할 수 있다. 상기 본체에 소정의 홈부가 배치되며, 상기 홈부에 대응되는 형상으로 마련되며, 상기 홈부에 삽입되어 외부로 부터 유입되는 이물질을 차단하는 방수부;를 더 포함할 수 있다. 일 예시에 따른 초음파 진단 장치 조립체는 상기 완충 장치, 본체, 상기 본체에 결합되는 핸들부를 구비하는 초 음파 영상 장치 및 상기 초음파 영상 장치와 연결되는 프로브를 포함할 수 있다."}
{"patent_id": "10-2023-0151948", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 예시에 따른 완충 장치 및 이를 포함하는 초음파 진단 장치 조립체는 외부에서 인가되는 충격으로부터 초음 파 진단 장치를 보호할 수 있다. 또한, 일 예시에 따른 완충 장치 및 이를 포함하는 초음파 진단 장치 조립체는 초음파 진단 장치에 완충 장치가 배치된 상태에서, 초음파 진단 장치의 사용자 편의성을 향상시킬 수 있다."}
{"patent_id": "10-2023-0151948", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시는 본 개시의 청구항의 권리범위를 명확히 하고, 본 개시의 실시예들이 속하는 기술분야에서 통상의 지 식을 가진 자가 본 개시의 실시예들을 실시할 수 있도록, 본 개시의 실시예들의 원리를 설명하고, 실시예들을 개시한다. 본 개시의 실시예들은 다양한 형태로 구현될 수 있다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 명세서가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2023-0151948", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 발명이 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '모듈' 또는'부'(unit)라는 용어는 소프트웨어, 하드웨어 또는 펌웨어 중 하나 또는 둘 이상의 조합으로 구현될 수 있으며, 실시예들에 따라 복수의 '모듈' 또는'부'가 하나의 요소(element)로 구 현되거나, 하나의 ''모듈' 또는 부'가 복수의 요소들을 포함하는 것도 가능하다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또 는 복수 개를 포함할 수 있다. 본 개시에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B, 또는 C\", \"A, B, 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함 께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다.\"및/또는\"이라는 용어는 복수의 관련된 기재된 구성요소들의 조합 또는 복수의 관련된 기재된 구성요소들 중의 어느 구성요소를 포함한다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 또한, 본 개시에서 사용한 '전면', '후면', '상면', '하면', '측면', '좌측', '우측', '상부', '하부' 등의 용 어는 도면을 기준으로 정의한 것이며, 이 용어에 의해 각 구성요소의 형상 및 위치가 제한되는 것은 아니다. \"포함하다\" 또는 \"가지다\"등의 용어는 본 개시에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는다. 어떤 구성요소가 다른 구성요소와 \"연결\", \"결합\", \"지지\" 또는 \"접촉\"되어 있다고 할 때, 이는 구성요소들이 직접적으로 연결, 결합, 지지 또는 접촉되는 경우뿐 아니라, 제3 구성요소를 통하여 간접적으로 연결, 결합, 지 지 또는 접촉되는 경우를 포함한다. 어떤 구성요소가 다른 구성요소 \"상에\" 위치하고 있다고 할 때, 이는 어떤 구성요소가 다른 구성요소에 접해 있 는 경우뿐 아니라 두 구성요소 사이에 또 다른 구성요소가 존재하는 경우도 포함한다. 이하에서 첨부된 도면을 참조하여 다양한 실시예에 따른 초음파 장치를 구체적으로 설명한다. 첨부된 도면을 참 조하여 설명함에 있어, 동일하거나 대응하는 구성 요소는 유사한 도면 번호를 부여하고 이에 대한 중복되는 설 명은 생략할 수 있다. 본 개시에서 영상은 자기 공명 영상(MRI) 장치, 컴퓨터 단층 촬영(CT) 장치, 초음파 영상 장치, 또는 엑스레이 영상 장치 등의 의료 영상 장치에 의해 획득된 의료 영상을 포함할 수 있다. 본 개시에서 '대상체(object)'는 촬영의 대상이 되는 것으로서, 사람, 동물, 또는 그 일부를 포함할 수 있다. 예를 들어, 대상체는 신체의 일부(장기 또는 기관 등; organ) 또는 팬텀(phantom) 등을 포함할 수 있다. 본 개시에서 '초음파 영상'이란 대상체로 송신되고, 대상체로부터 반사된 초음파 신호에 근거하여 생성 또는 처 리된 대상체(object)에 대한 영상을 의미한다. 이하에서는 도면을 참조하여 본 개시의 실시예들을 상세히 설명한다. 도 1은 본 개시의 일 실시예에 따른 초음파 영상 시스템의 구성을 도시한 블록도이다. 도 1을 참조하면, 일 예시에 따른 초음파 진단 장치는 프로브 및 초음파 영상 장치를 포함할 수 있다. 일 예시에 따른 프로브는 디스플레이, 송신 모듈, 배터리, 트랜스듀서, 충전 모 듈, 수신 모듈, 입력 인터페이스, 프로세서, 및 통신 모듈을 포함할 수 있다. 도 1에 서는 프로브가 송신 모듈 및 수신 모듈을 모두 포함하는 것으로 도시하였으나, 구현 형태에 따라, 프로브는 송신 모듈 및 수신 모듈의 구성 중 일부만을 포함할 수도 있으며, 송신 모듈 및 수신 모듈의 구성 중 일부는 초음파 영상 장치에 포함될 수도 있다. 또한, 본 개시의 일 실 시예에 따르면, 프로브는 영상 프로세서를 더 포함할 수도 있다. 트랜스듀서는, 복수의 트랜스듀서들을 포함할 수 있다. 복수의 트랜스듀서들은 소정의 배열로 나열되어 트 랜스듀서 어레이로 구현될 수 있다. 트랜스듀서 어레이는 1차원(1D) 어레이 또는 2차원(2D) 어레이에 대응할 수 있다. 복수의 트랜스듀서들은 송신 모듈로부터 인가된 송신 신호에 따라 대상체로 초음파 신호를 송출 할 수 있다. 또한, 복수의 트랜스듀서들은 대상체로부터 반사된 초음파 신호를 수신하여, 전기적인 수신 신 호를 형성 또는 생성할 수 있다. 충전 모듈은 배터리를 충전시킬 수 있다. 충전 모듈은 외부로부터 전력을 수신할 수 있다. 본 개시의 일 실시예에 따르면, 충전 모듈은 무선으로 전력을 수신할 수 있다. 또한, 본 개시의 일 실시예에 따르면, 충전 모듈은 유선으로 전력을 수신할 수도 있다. 충전 모듈은 수신한 전력을 배터리로 전달할 수 있다. 프로세서는 복수의 트랜스듀서들의 위치 및 집속점을 고려하여, 복수의 트랜스듀서들 각각에 인가될 송신 신호를 생성 또는 형성하도록 송신 모듈를 제어한다. 프로세서는 트랜스듀서로부터 수신되는 수신 신호를 아날로그 디지털 변환하고, 복수의 트랜스듀서들 의 위치 및 집속점을 고려하여, 디지털 변환된 수신 신호를 합산함으로써, 초음파 데이터를 생성하도록 수신 모 듈를 제어한다. 본 개시의 일 실시예에 따르면, 프로브가 영상 프로세서를 포함하는 경우, 생성 된 초음파 데이터를 이용하여, 초음파 영상을 생성할 수 있다. 프로브가 2차원 프로브로 구현되는 경우, 프로세서는 2차원 트랜스듀서 어레이에 포함되는 복수의 서 브 어레이들 각각에 대하여, 서브 어레이 별로 디지털 빔포밍을 위한 시간 지연 값을 산출할 수 있다. 또한, 프 로세서는 복수의 서브 어레이들 중 어느 하나의 서브 어레이에 포함된 트랜스듀서들 각각에 대한 아날로그 빔포밍을 위한 시간 지연 값을 산출할 수 있다. 프로세서는 아날로그 빔포밍을 위한 시간 지연 값 및 디지 털 빔포밍을 위한 시간 지연 값들에 따라, 복수의 트랜스듀서들 각각에 인가될 송신 신호를 형성하도록 아날로 그 빔포머 및 디지털 빔포머를 제어할 수 있다. 또한, 프로세서는 복수의 트랜스듀서들로부터 수신한 신호 들을 아날로그 빔포밍을 위한 시간 지연 값에 따라, 서브 어레이 별로 합산하도록 아날로그 빔포머를 제어할 수 있다. 또한, 프로세서는 서브 어레이 별로 합산된 신호를 아날로그 디지털 변환하도록 초음파 송수신 모듈 을 제어할 수 있다. 또한, 프로세서는 디지털 변환된 신호들을 디지털 빔포밍을 위한 시간 지연 값에 따라 합산하여, 초음파 데이터를 생성하도록 디지털 빔포머를 제어할 수 있다. 프로세서는 프로브의 전반적인 동작을 제어하고, 프로브의 구성 요소들의 동작을 제어할 수 있다. 프로세서는 메모리에 저장된 프로그램 또는 인스트럭션들을 실행함으로써, 프로브의 다양한 동작 또는 기능을 수행하거나 제어할 수 있다. 또한, 프로세서는 프로브의 입력 인터페이스 또는 외부 장치(예: 초음파 영상 장치)로부터 제어 신호를 수신하여, 프로브의 동작을 제어할 수 있다. 또한, 프 로세서는 입력 인터페이스 또는 외부 장치로부터 제어 신호를 수신하여, 프로브의 동작을 제어할 수 있다. 입력 인터페이스는, 프로브를 제어하기 위한 사용자의 입력을 수신할 수 있다. 예를 들어, 사용자의 입력은 버튼, 키 패드, 마우스, 트랙볼, 조그 스위치, 놉(knop) 등을 조작하는 입력, 터치 패드나 터 치 스크린을 터치하는 입력, 음성 입력, 모션 입력, 생체 정보 입력(예를 들어, 홍채 인식, 지문 인식 등) 등을 포함할 수 있으나 이에 한정되지 않는다. 디스플레이는 프로브에 의해 생성된 초음파 영상, 프로브에서 생성된 초음파 데이터를 처리하여 생성한 초음파 영상, 초음파 영상 장치로부터 수신된 초음파 영상, 또는 초음파 진단 장치에서 처리되 는 다양한 정보 등을 표시할 수 있다. 또한, 디스플레이는 프로브의 상태 정보를 더 표시할 수 있다. 프로브의 상태 정보는 프로브의 장치 정보, 프로브의 배터리 상태 정보, 프로브의 주파수 대역 정보, 프로브의 출력 정보, 프로브의 이상 유무 정보, 프로브의 설정 정보, 또는 프로브의 온 도 정보 중 적어도 하나를 포함할 수 있다. 프로브는 구현 형태에 따라 하나 또는 복수의 디스플레이를 포함할 수 있다. 또한, 디스플레이는 터치 패널 또는 터치 스크린을 포함할 수 있다. 또한, 디스플레이는 플렉서블 디스플레이를 포함할 수 있 다. 통신 모듈은 생성된 초음파 데이터 또는 초음파 영상을 무선 네트워크를 통하여, 초음파 영상 장치로 무선 전송할 수 있다. 또한, 통신 모듈은 초음파 영상 장치로부터 제어 신호 및 데이터를 수신할 수 있다. 초음파 영상 장치는 프로브로부터 초음파 데이터 또는 초음파 영상을 수신할 수 있다. 본 개시의 일 실시예에서, 프로브가 초음파 데이터를 이용하여 초음파 영상을 생성할 수 있는 영상 프로세 서를 포함하는 경우, 프로브는 초음파 영상 장치에게 초음파 데이터 또는 영상 프로세서에 의해 생성된 초음파 영상을 전송할 수 있다. 본 개시의 일 실시예에서, 프로브가 초음파 데이터를 이용하여 초음파 영상을 생성할 수 있는 영상 프로세 서를 포함하지 않는 경우, 프로브는 초음파 영상 장치에게 초음파 데이터를 전송할 수 있다. 초 음파 데이터는 초음파 로데이터(raw data)를 포함할 수 있고, 초음파 영상은 초음파 영상 데이터를 의미할 수 있다. 초음파 영상 장치는 프로세서, 영상 프로세서, 디스플레이, 메모리, 통신 모듈 및 입력 인터페이스를 포함할 수 있다. 영상 프로세서는 프로브로부터 수신한 초음파 데이터를 이용하여, 초음파 영상을 생성 또는 처리한다. 디스플레이는 프로브로부터 수신한 초음파 영상, 프로브로부터 수신된 초음파 데이터를 처리하여 생성한 초음파 영상, 또는 초음파 진단 장치에서 처리되는 다양한 정보 등을 표시할 수 있다. 초음파 영상 장치는 구현 형태에 따라 하나 또는 복수의 디스플레이를 포함할 수 있다. 또한, 디스플레이는 터치 패널 또는 터치 스크린을 포함할 수 있다. 또한, 디스플레이는 플렉서블 디스플레이를 포함할 수 있 다. 프로세서는 초음파 영상 장치의 전반적인 동작을 제어하고, 초음파 영상 장치의 구성 요소들의 동 작을 제어할 수 있다. 프로세서는 메모리에 저장된 프로그램 또는 어플리케이션을 실행하여, 초음파 영상 장치의 다양한 동작 또는 기능을 수행하거나 제어할 수 있다. 또한, 프로세서는 입력 인터페이스 또는 외부 장치로부터 제어 신호를 수신하여, 초음파 영상 장치의 동작을 제어할 수 있다. 초음파 영상 장치는 통신 모듈을 포함하며, 통신 모듈을 통해 외부 장치(예를 들면, 프로브, 서버, 의료 장치, 휴대 장치(스마트폰, 태블릿 PC, 웨어러블 기기 등))와 연결되고 통신할 수 있다. 통신 모듈은 외부 장치와 통신을 가능하게 하는 하나 이상의 구성 요소를 포함할 수 있다. 통신 모듈(16 0)은 예를 들어 근거리 통신 모듈, 유선 통신 모듈, 또는 무선 통신 모듈 중 적어도 하나를 포함할 수 있다. 초음파 영상 장치의 통신 모듈과 프로브의 통신 모듈은 네트워크를 이용하여 통신할 수도 있 고, 근거리 무선 통신 방법을 이용하여 통신할 수도 있다. 예를 들어, 초음파 영상 장치의 통신 모듈 과 프로브의 통신 모듈은 무선 랜(Wireless LAN), 와이파이(Wi-Fi), 블루투스(Bluetooth), 지그비 (zigbee), WFD(Wi-Fi Direct), 적외선 통신(IrDA, infrared Data Association), BLE (Bluetooth LowEnergy), NFC(Near Field Communication), 와이브로(Wireless Broadband Internet, Wibro), 와이맥스(World Interoperability for Microwave Access, WiMAX), SWAP(Shared Wireless Access Protocol), 와이기그 (Wireless Gigabit Allicance, WiGig), RF 통신, 또는 60GHz 밀리미터파(mm Wave) 근거리 통신 등을 포함하는 무선 데이터 통신 방법 중 어느 하나를 이용하여 통신할 수 있다. 이를 위해, 초음파 영상 장치의 통신 모듈과 프로브의 통신 모듈은 무선 랜(Wireless LAN) 통신 모듈, 와이파이(Wi-Fi) 통신 모듈, 블루투스(Bluetooth) 통신 모듈, 지그비(zigbee) 통신 모듈, WFD(Wi- Fi Direct) 통신 모듈, 적외선 통신(IrDA, infrared Data Association) 모듈, BLE (Bluetooth LowEnergy) 통신 모듈, NFC(Near Field Communication) 통신 모듈, 와이브로(Wireless Broadband Internet, Wibro) 통신 모듈, 와이맥스(World Interoperability for Microwave Access, WiMAX) 통신 모듈, SWAP(Shared Wireless Access Protocol) 통신 모듈, 와이기그(Wireless Gigabit Allicance, WiGig) 통신 모듈, RF 통신 모듈, 또는 60GHz 밀 리미터파(mm Wave) 근거리 통신 모듈 중 적어도 하나를 포함할 수 있다. 본 개시의 일 실시예에서, 프로브는 제1 통신 방법(예: BLE)을 이용하여 프로브의 장치 정보(예: ID 정 보)를 초음파 영상 장치로 전송하고, 초음파 영상 장치와 무선으로 페어링(paring)될 수 있다. 또한, 프로브는 페어링된 초음파 영상 장치에게 초음파 데이터 및/또는 초음파 영상을 전송할 수 있다. 프로브의 장치 정보는 프로브의 시리얼 넘버, 모델명, 또는 배터리 상태 등과 관련된 다양한 정보를 포 함할 수 있다. 초음파 영상 장치는 제1 통신 방법(예: BLE)을 이용하여 프로브로부터 프로브의 장치 정보(예: ID 정보)를 수신하고, 프로브와 무선으로 페어링(paring)될 수 있다. 또한, 초음파 영상 장치는 페어링된 프로브에게 활성화 신호를 전송하고, 프로브로부터 초음파 데이터 및/또는 초음파 영상을 수신할 수 있 다. 이 때, 활성화 신호는 프로브의 동작을 제어하기 위한 신호를 포함할 수 있다. 본 개시의 일 실시예에서, 프로브는 제1 통신 방법(예: BLE)을 이용하여 프로브의 장치 정보(예: ID 정 보)를 초음파 영상 장치로 전송하고, 초음파 영상 장치와 무선으로 페어링(paring)될 수 있다. 또한, 프로브는 제2 통신 방법(예: 60GHz 밀리미터파, 와이파이)을 이용하여 제1 통신 방법에 의해 페어링된 초음 파 영상 장치에게 초음파 데이터 및/또는 초음파 영상을 전송할 수 있다. 초음파 영상 장치는 제1 통신 방법(예: BLE)을 이용하여 프로브로부터 프로브의 장치 정보(예: ID 정보)를 수신하고, 프로브와 무선으로 페어링(paring)될 수 있다. 또한, 초음파 영상 장치는 페어링된 프로브에게 활성화 신호를 전송하고, 제2 통신 방법(예: 60GHz 밀리미터파, 와이파이)을 이용하여 프로브 로부터 초음파 데이터 및/또는 초음파 영상을 수신할 수 있다. 본 개시의 일 실시예에 따르면, 프로브와 초음파 영상 장치가 서로 페어링되는데 이용되는 제1 통신 방 법은 프로브가 초음파 영상 장치에게 초음파 데이터 및/또는 초음파 영상을 전송하는데 이용되는 제2통신 방법의 주파수 대역보다 낮은 주파수 대역을 가질 수 있다. 초음파 영상 장치의 디스플레이는 프로브의 장치 정보를 나타내는 UI(User Interface)들을 표시할 수 있다. 예를 들어, 디스플레이는 무선 초음파 프로브의 식별 정보, 프로브와의 페어링 방법을 나타내는 페어링 방법, 프로브와 초음파 영상 장치 간의 데이터 통신 상태, 초음파 영상 장치와의 데이터 통신을 수행하는 방법, 또는 프로브의 배터리 상태를 나타내는 UI 등을 표시할 수 있다. 프로브가 디스플레이를 포함하는 경우, 프로브의 디스플레이는 프로브의 장치 정보를 나 타내는 UI를 표시할 수 있다. 예를 들어, 디스플레이는 무선 초음파 프로브의 식별 정보, 프로브 와의 페어링 방법을 나타내는 페어링 방법, 프로브와 초음파 영상 장치 간의 데이터 통신 상태, 초음파 영상 장치와의 데이터 통신을 수행하는 방법, 또는 프로브의 배터리 상태를 나타내는 UI등을 표시할 수 있다. 통신 모듈은 외부 장치로부터 제어 신호 또는 데이터를 수신할 수 있다. 프로세서는 통신 모듈 을 통해 수신된 제어 신호에 따라 초음파 영상 장치의 동작을 제어할 수 있다. 또한, 프로세서가 통신 모듈을 통해 외부 장치로 제어 신호를 송신하여, 외부 장치를 송신된 제어 신 호에 따라 제어하는 것도 가능하다. 외부 장치는 초음파 영상 장치로부터 수신된 제어 신호에 따라 동작하 거나, 초음파 영상 장치로부터 수신된 데이터를 처리할 수 있다. 외부 장치는 초음파 영상 장치에 관련된 프로그램 또는 어플리케이션을 초음파 영상 장치, 프로브, 또는 서버로부터 수신 또는 다운로드하고, 프로그램 또는 어플리케이션을 외부 장치에 설치하여 실행할 수 있다. 프로그램 또는 어플리케이션을 제공하는 초음파 영상 장치, 프로브, 또는 서버는 해당 프로그램 또는 어플리케이션의 인스트럭션, 커맨드, 설치 파일, 실행 파일, 또는 관련 데이터 등을 저장하는 기록매체를 포함할 수 있다. 외부 장치는 프로그램 또는 어플리케이션이 설치된 상태로 판매되는 것도 가능하다. 메모리는 초음파 영상 장치를 구동하고 제어하기 위한 다양한 데이터 또는 프로그램, 입/출력되는 초 음파 데이터, 초음파 영상 등을 저장할 수 있다. 도 2는 일 예시에 따른 완충 장치를 포함하는 초음파 진단 장치 조립체의 사시도이다. 도 3은 일 예시에 따른 완충 장치와 초음파 진단 장치의 분리 사시도이다. 도 2 및 도 3을 참조하면, 일 예시에 따른 초음파 진단 장치 조립체는 프로브와 초음파 영상 장치를 포함하는 초음파 진단 장치 및 초음파 영상 장치를 둘러싸는 완충 장치를 포함할 수 있다. 일 예시에 따른 초음파 영상 장치는 휴대형으로도 구현될 수 있다. 휴대형 초음파 영상 장치의 예로는, 프로브 및 어플리케이션을 포함하는 스마트 폰(smart phone), 랩탑 컴퓨터, PDA, 또는 태블릿 PC 등이 있을 수 있으나, 이에 한정되지 않는다. 일 예로서, 휴대형 초음파 영상 장치는 본체 및 본체에 결합되는 핸들부를 포함 할 수 있다. 핸들부는 본체와 소정의 간격을 사이에 두고 이격되도록 배치되는 그립부, 그립부의 양 단부 에 배치되며, 그립부와 본체를 연결하는 그립부 연결부를 포함할 수 있다. 본체와 그립부 사이에 배치된 이격 공간에 사용자의 손가락이 배치되는 중공 영역이 형성될 수 있다. 본체에 핸들부가 결합되도록 배치되고, 사용자는 본체를 용이하게 파지할 수 있음에 따라, 사용자 편의성이 향 상될 수 있다. 일 예로서, 초음파 영상 장치와 프로브는 커넥터를 이용하여 상호 연결될 수 있다. 일 예로서, 초음파 영상 장치는 하나 이상의 커넥터(470: 도 20 참조)를 구비하고, 프로브는 초음파 영상 장치에 마련 된 하나 이상의 커넥터에 결합되는 커넥터를 구비할 수 있다. 다만 본 개시가 이에 제한되는 것은 아 니며, 초음파 영상 장치와 프로브는 근거리 무선 통신을 이용하여 통신을 수립하거나 페어링될 수 있다. 예를 들면, 초음파 영상 장치와 프로브는 블루투스, BLE, 와이파이, 또는 와이파이 다이렉트 등 을 이용하여 통신을 수행할 수 있다. 초음파 영상 장치는 프로브와 관련된 프로그램 또는 어플리케이션을 실행하여, 프로브를 제어하고, 프로브에 관련된 정보를 출력할 수 있다. 초음파 영상 장치는 소정의 서버와 통신하면서, 프로브와 관련된 동작을 수행할 수 있다. 프로브는 초음파 영상 장치에 등록되거나, 소정의 서버에 등록될 수 있 다. 초음파 영상 장치는 등록된 프로브와 통신하고, 프로브에 관련된 동작을 수행할 수 있다.또한, 초음파 영상 장치는 스피커, LED, 진동 장치 등의 다양한 형태의 입출력 인터페이스를 포함할 수 있 다. 예를 들면, 초음파 영상 장치는 입출력 인터페이스를 통해 다양한 정보를 그래픽, 소리, 또는 진동 등 의 형태로 출력할 수 있다. 또한, 초음파 영상 장치는 다양한 알림 또는 데이터를 입출력 인터페이스를 통 해 출력할 수 있다. 본 개시의 일 실시에에 따르면, 초음파 영상 장치는 인공지능(AI, Artificial Intelligence) 모델을 이용하 여, 초음파 영상을 처리하거나, 초음파 영상으로부터 부가 정보를 획득할 수 있다. 본 개시의 일 실시예에 따르 면, 초음파 영상 장치는 AI 모델을 이용하여, 초음파 영상을 생성하거나, 초음파 영상에 대해 보정, 화질 개선, 인코딩, 또는 디코딩 등의 처리를 수행할 수 있다. 또한, 본 개시의 일 실시예에 따르면, 초음파 영상 장 치는 AI 모델을 이용하여, 초음파 영상으로부터, 기준선 정의, 해부학적 정보 획득, 병변 정보 획득, 표면 추출, 경계 정의, 길이 측정, 넓이 측정, 부피 측정, 또는 annotation 생성 등의 처리를 수행할 수 있다. AI 모델은 초음파 영상 장치 상에 구비되거나, 서버 상에 구비될 수 있다. AI 모델은 다양한 인공 신경망 모델(Artificial Neural Network) 또는 심층 신경망 모델(Deep Neural Network)을 이용하여 구현될 수 있다. 또한, AI 모델은 다양한 기계 학습(machine learning) 알고리즘 또는 딥 러닝(deep learning) 알고리즘을 이용 하여 학습되고 생성될 수 있다. AI 모델은 예를 들면, CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), 또는 GAN(Generative Adversarial Network), LSTM(Long Short-Term Memory) 등의 모델을 이 용하여 구현될 수 있다. 도 4는 일 예시에 따른 완충 장치의 사시도이다. 도 5는 일 예시에 따른 완충 장치의 평면도이다. 도 6은 일 예 시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 평면도이다. 도 7은 도 6에 도시 된 P영역을 확대한 확대도이다. 도 8은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 저면도이다. 도 2 내지 도 3을 참조하면, 완충 장치는 초음파 영상 장치를 둘러싸도록 배치되어 초음파 영상 장치 가 외부 충격으로부터 파손되는 것을 방지할 수 있다. 상술한 바와 같이 초음파 영상 장치가 휴대형으 로 마련되는 경우, 사용자는 초음파 영상 장치를 휴대한 채 이동할 수 있다. 이때, 사용자는 초음파 영상 장치를 떨어트리거나 외부 구조물에 충돌시켜 초음파 영상 장치가 파손될 수 있다. 완충 장치는 초음파 영상 장치에 인가될 수 있는 충격을 사전에 흡수함으로써, 외부 충격에 의해 초음파 영상 장치 가 파손되는 현상을 방지할 수 있다. 도 4 내지 도 5를 참조하면, 일 예시에 따른, 완충 장치는 본체의 외주부와 핸들부의 외주부를 둘러싸는 제1 완충부, 제1 완충부와 소정의 간격을 사이에 두고 이격되도록 배치되며, 본체와 핸들부 사이에 배치되는 제2 완충부 및 제1 완충부와 제2 완충부를 연결하는 연결부 를 포함할 수 있다. 일 예시에 따르면, 본체는 본체의 외형을 형성하는 본체 케이스를 포함할 수 있다. 예를 들어, 본 체 케이스는 도 3에 도시된 바와 같이 직육면체 형상으로 마련될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 본체 케이스는 사용 목적 및 사용 환경에 따라 상이한 형상을 포함할 수도 있다. 이하에서는 본체 케이스가 직육면체 형상임을 기준으로 본체 케이스의 폭 방향을 제1 방향(X 방향), 본체 케이스 의 길이 방향을 제2 방향(Y 방향) 및 본체 케이스의 두께 방향을 제3 방향(Z 방향)으로 서술한다. 핸들부는 도 3에 도시된 바와 같이, 본체와 일 방향, 예를 들어 제2 방향(Y 방향)을 따라 소정의 간격 을 사이에 두고 이격되도록 배치되는 그립부 및 그립부와 본체를 연결하는 그립부 연결부를 포함할 수 있다. 이때, 핸들부의 외주부는 본체 케이스로부터 일 평면(XY 평면)을 따라 연장되도록 형 성될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 핸들부의 형상은 사용자의 파지 방식 및 사용 목적에 따라 그립부와 본체 사이에 소정의 중공 영역이 형성될 수 있는 임의의 형상을 포함할 수 도 있다. 일 예시에 따라 핸들부의 외주부가 본체 케이스로부터 일 평면(XY 평면)을 따라 연장되도록 형성됨에 따라, 본체 케이스의 외주부, 그립부의 외주부 및 그립부 연결부의 외주부는 실질적으 로 직육면체와 유사한 형상을 구비할 수 있다. 다시 도 4 내지 도 8을 참조하면, 제1 완충부는 본체의 외주부와 핸들부의 외주부를 둘러싸도록 배치될 수 있다. 예를 들어, 본체의 외주부와 핸들부의 외주부가 상술한 바와 같이 본체 케이스의 외주부, 그립부의 외주부 및 그립부 연결부의 외주부로 이어지는 직육면체와 유사한 형상을 구비하는 경우, 제1 완충부는 본체 케이스의 측면을 보호하기 위한 측면 완충부, 수직 충격으로부터 본체 케이스의 상판 및 하판을 보호하기 위한 수직 완충부 및 핸들부의 측면을 보호하기 위한 핸 들 완충부을 포함할 수 있다. 측면 완충부는 본체의 외주부 중 적어도 하나 이상의 측면을 보호할 수 있다. 일 예시에 따른 측면 완충부는 본체의 측면 형상에 대응되는 형상을 구비할 수 있다. 측면 완충부는 본체의 측 면의 외주부에 배치되어 일 평면(XY 평면) 방향을 따라 인가되는 외부 충격으로부터 본체의 측면을 보호할 수 있다. 일 예로서, 본체 케이스가 직육면체와 유사한 형상을 포함하는 경우, 측면 완충부는 본체 케이스 의 제1 측면의 외주부를 따라 연장되도록 배치되는 제1 측면 완충부, 본체 케이스의 제2 측면의 외주부를 따라 연장되도록 배치되는 제2 측면 완충부 및 본체 케이스의 제3 측면 의 외주부를 따라 연장되도록 배치되는 제3 측면 완충부를 포함할 수 있다. 일 예로서, 제1 측면 완충부 및 제3 측면 완충부는 본체 케이스의 제1 측면 및 본체 케 이스의 제3 측면에 직접 지지되어 일 평면(XY 평면) 방향을 따라 인가되는 외부 충격으로부터 본체 케이스의 제1 측면 및 제3 측면을 보호할 수 있다. 또한, 제2 측면 완충부는 본체 케이스의 제2 측면에 지지되어 일 평면(XY 평면) 방향을 따라 인가되는 외부 충격으로부터 본체 케이스의 제2 측면을 보호할 수 있다. 이때, 본체 케이스의 제2 측 면의 하부에는 도 8에 도시된 바와 같이 스토퍼 지지부가 배치될 수 있다. 스토퍼 지지부는 복수 개로 마련되며, 소정의 간격을 사이에 두고 이격되도록 배치될 수 있다. 예를 들어 스토퍼 지지부는 제2 방향(Y 방향)을 따라 연장되며, 일 단부가 본체 케이스의 제2 측면에 지지되고, 타 단부가 제2 측면 완충부에 지지되도록 배치될 수 있다. 이에 따라 제2 측면 완충부 및 스토퍼 지지부는 본체 케이스의 제2 측면에 지지되어 일 평면(XY 평면) 방향을 따라 인가되는 외부 충격으로부터 본체 케이스의 제2 측면을 보호할 수 있다. 수직 완충부는 수직 충격으로부터 본체 케이스의 상판 및 하판을 보호할 수 있다. 일 예시에 따른 수직 완충부는 하나 이상의 영역에 배치될 수 있다. 예를 들어 수직 완충부는 복수 개로 마련되어 제1 측면 완충부 내지 제3 측면 완충부와 후술하게 될 핸들 완충부 사이에 각각 배치될 수 있다. 환언하면, 복수 개의 수직 완충부는 본체 케이스의 외주부 및 핸들부의 외주부에 의해 형 성되는 4개의 모서리 영역에 상호 이격되도록 배치될 수 있다. 또한 일 예시에 따른 수직 완충부는, 초음 파 영상 장치의 두께 방향, 예를 들어 제3 방향(Z 방향)을 따르는 본체의 두께를 초과하는 두께를 구비 할 수 있다. 일 예로서, 수직 완충부가 제3 방향(Z 방향)을 따라 본체의 두께를 초과하는 두께를 구비하는 경우, 수직 완충부는 수직 방향(Z 방향)을 따라 인가되는 외부 충격으로부터 본체 케이스의 상부 또는 하 부를 보호할 수 있다. 수직 완충부의 두께와 본체의 두께와 관련된 사항은 도 9 및 도 10을 참조하여 보다 구체적으로 후술한다. 핸들 완충부는 핸들부의 외주부 중 적어도 하나 이상의 측면을 보호할 수 있다. 일 예시에 따른 핸들 완충부는 핸들부의 측면 형상에 대응되는 형상을 구비할 수 있다. 이때, 핸들 완충부는 핸들부 의 측면의 외주부에 배치되어 일 평면(XY 평면) 방향을 따라 인가되는 외부 충격으로부터 핸들부의 측 면을 보호할 수 있다. 일 예로서, 그립부가 일 방향, 예를 들어 제1 방향(X 방향)을 따라 연장되도록 형성되는 경우, 핸들 완충 부는 그립부의 측면의 외주부를 따라 연장되는 형상을 포함할 수 있다. 핸들 완충부는 일 평 면(XY 평면) 방향을 따라 인가되는 외부 충격으로부터 그립부의 측면을 보호할 수 있다. 제2 완충부는, 본체와 핸들부 사이에 배치되어 본체와 핸들부 사이에서 발생될 수 있는 파손을 방지할 수 있다. 일 예시에 따르면, 제2 완충부는 제1 완충부와 소정의 간격을 사이에 두고 이격되도록 배치될 수 있다. 이때, 제1 완충부와 제2 완충부 사이에 형성된 이격 공간에 핸들부 가 안착될 수 있다. 따라서, 제1 완충부와 제2 완충부 사이에 형성된 이격 간격(H)은 핸들부 의 폭과 실질적으로 동일할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 제1 완충부 또는 제2 완충부 중 하나 이상이 외부 압력에 의해 변형가능한 탄성 재질을 포함하는 경우, 제1 완충부 와 제2 완충부 사이에 형성된 이격 간격(H)은 핸들부의 폭 보다 작게 형성될 수도 있다. 이때, 핸들 부는 제1 완충부와 제2 완충부 사이에 끼워 맞춤 형태로 안착될 수 있다. 일 예시에 따른 제2 완충부는 복수 개로 마련될 수 있다. 이때, 복수 개의 제2 완충부는 일 방향을 따라 소정의 간격을 사이에 두고 이격되도록 배치될 수 있다. 일 예로서, 복수 개의 제2 완충부는 제2-1 완충부 및 제2-2 완충부을 포함할 수 있다. 제2-1 완충부 및 제2-2 완충부는 제1 방 향(X 방향)을 따라 이격되도록 배치될 수 있다. 이때, 제2-1 완충부와 제2-2 완충부 사이에 이격된 공간은 핸들부에 마련된 중공 영역과 중첩되도록 배치될 수 있다. 이에 따라 사용자의 손가락이 제2-1 완충부와 제2-2 완충부 사이에 이격된 공간과 핸들부에 마련된 중공 영역에 배치됨으로써, 사용자가 완충 장치가 포함된 초음파 진단 장치 조립체를 보다 용이하게 파지할 수 있 다. 연결부는 제1 완충부 및 제2 완충부 사이에 배치되어 제1 완충부 및 제2 완충부 를 상호 연결시킬 수 있다. 일 예로서, 연결부는 제1 완충부와 제2 완충부의 하단부 사이에 배치될 수 있다. 또한, 연결부는 제1 완충부와 제2 완충부 사이에 형성된 이격 간격 (H)과 동일한 길이로 연장될 수 있다. 이에 따라 제1 완충부, 연결부 및 제2 완충부를 따라 핸들부가 안착될 수 있는 홈 형상의 소정의 안착부가 형성될 수 있다. 일 예시에 따른 제2 완충부가 복수 개로 마련되는 경우, 연결부 또한 복수 개로 마련될 수 있다. 일 예로서, 복수 개의 제2 완충부가 제2-1 완충부 및 제2-2 완충부을 포함하는 경우, 연결부 는 복수 개로 마련되어 제1 연결부 및 제2 연결부를 포함할 수 있다. 이때, 제1 연결부 및 제2 연결부 사이에 이격된 공간은 핸들부에 마련된 중공 영역과 중첩되도록 배치될 수 있다. 일 예시에 따른 제1 완충부, 제2 완충부 및 연결부 중 하나 이상은 일체로 형성될 수 있다. 예를 들어, 제1 완충부, 제2 완충부 및 연결부는 일체로 형성됨으로써 제작 편의성을 향상시 킬 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 제1 완충부, 제2 완충부 및 연결부 각각은 별개로 마련되어 각각 연결될 수도 있음은 물론이다. 또한, 일 예시에 따른 제1 완충부, 제2 완충부 및 연결부 중 하나 이상은 탄성 재질을 포함 할 수 있다. 예를 들어 탄성 재질은 실리콘 고무, 에틸렌 초산 비닐 (EVA: Ethylene Vinyl Acetate). EPDM 고 무(ethylene propylene diene Monomer rubber), 불소 고무(fluoro elastomers), NBR 고무 (acrylonitrile butadiene rubber), SBR 고무(Styrene Butadiene Rubber), NR 고무(Natural Rubber), CR 고무(chloroprene rubber), 확장형 폴리에틸렌(EPE: Expandable Polyethylene), 확장형 폴리프로필렌(EPP: Expanded polypropylene), 확장형 폴리스티렌(EPS: Expanded Polystyrene), 플라스틱(Plastic) 중 하나 이상을 포함할 수 있다. 일 예로서, 제1 완충부 및 제2 완충부 중 하나 이상은 탄성 재질을 포함할 수 있다. 이에 따라 제1 완충부 및 제2 완충부 중 하나 이상은 외부로부터 인가되는 충격 및 본체 및 핸들부 사이에서 인가되는 충격을 흡수할 수 있다. 도 9는 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 측면도이다. 도 10 은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 측면도이다. 도 9 및 도 10를 참조하면, 일 예시에 따른 본체는 초음파 영상 장치의 두께 방향, 예를 들어 제3 방향(Z 방향)을 따라 본체 두께(h1)를 구비할 수 있다. 본체의 측면, 예를 들어 본체 케이스의 제1 측면 내지 본체 케이스의 제3 측면을 보호하기 위한 측면 완충부, 예를 들어 제1 측면 완충부 내지 제3 측면 완충부는 제3 방향(Z 방향)을 따라 본체 두께(h1) 보다 작은 측면 완충부 두께(h2)를 구비 할 수 있다. 측면 완충부 두께(h2)가 본체 두께(h1) 보다 작은 경우, 본체에 인가되는 제3 방향(Z 방향) 충 격, 예를 들어 본체를 떨어트리는 경우 본체의 상부면 또는 하부면에 인가될 수 있는 충격을 방지할 수 없다. 일 예시에 따르면, 제1 완충부 중 하나 이상의 영역, 예를 들어 수직 완충부은 초음파 영상 장치의 두께 방향, 예를 들어 제3 방향(Z 방향)을 따라 본체 두께(h1)를 초과하는 수직 완충부 두께(h3)를 구비할 수 있 다. 예를 들어 수직 완충부는 복수 개로 마련되어 본체 케이스의 외주부 및 핸들부의 외주부에 의해 형성되는 4개의 모서리 영역에 상호 이격되도록 배치될 수 있다. 예를 들어 수직 완충부는 4개로 마 련되며, 제1 수직 완충부 내지 제4 수직 완충부를 포함할 수 있다. 이때, 제1 수직 완충부 내지 제4 수직 완충부는 제3 방향(Z 방향)을 따라 본체 두께(h1)를 초과하는 수직 완충부 두께(h3)를 구비할 수 있다. 이에 따라 제1 수직 완충부 내지 제4 수직 완충부는 수직 방향(Z 방향)을 따라 인가되 는 외부 충격으로부터 본체 케이스의 상부면 또는 하부면을 보호할 수 있다. 일 예시에 따른 핸들부는 초음파 영상 장치의 두께 방향, 예를 들어 제3 방향(Z 방향)을 따라 핸들부 두께 (h4)를 구비할 수 있다. 일 예로서, 핸들부 두께(h4)는 본체 두께(h1) 보다 작게 형성될 수 있다. 이에 따라 사 용자는 핸들부를 보다 용이하게 파지할 수 있다. 핸들부와 마주보도록 배치되는 제1 완충부의 일 부 영역, 예를 들어 핸들 완충부는 초음파 영상 장치의 두께 방향, 예를 들어 제3 방향(Z 방향)을 따라 핸들부 두께(h4) 이하의 핸들 완충부 두께(h5)를 구비할 수 있다. 일 예로서, 핸들 완충부의 핸들 완충부 두께(h5)는 핸들부의 핸들부 두께(h4)와 실질적으로 동일하게 형성될 수 있다. 이에 따라 핸들 완충부는 일 평면(XY 평면) 방향을 따라 핸들부의 측면에 인가되는 외부 충격으로부터 핸들부의 측면을 보호할 수 있을 뿐만 아니라, 사용자가 핸들부를 용이하게 파지할 수 있도록 파지부의 두께를 최소화함으로써 사용자 편의성을 향상시킬 수 있다. 도 11은 도 2에 도시된 A-A선을 따라 절단한 초음파 진단 장치 조립체의 단면도이다. 도 12a는 도 11에 도시된 초음파 진단 장치 조립체의 단면도의 일부를 확대한 확대 단면도이다. 도 12b는 도 11에 도시된 초음파 진단 장 치 조립체의 단면도의 일부를 확대한 확대 단면도이다. 도 13은 일 예시에 따른 완충 장치에 초음파 영상 장치 가 배치된 초음파 진단 장치 조립체의 평면도이다. 도 3에 도시된 바와 같이 초음파 영상 장치를 외부 충격으로부터 보호하기 위해 초음파 영상 장치를 완 충 장치에 결합해야 한다. 휴대형 초음파 영상 장치의 경우, 완충 장치에 초음파 영상 장치 를 결합한 후, 이동할 수 있으므로, 초음파 영상 장치가 완충 장치에 고정되도록 결합되어야 한 다. 도 11 내지 도 12b를 참조하면, 일 예시에 따른 제1 고정부 및 제2 고정부은 초음파 영상 장치(4 0)를 완충 장치에 고정시킬 수 있다. 일 예로서, 본체의 4개의 측면은 제1 완충부 및 제2 완충 부에 지지될 수 있다. 예를 들어, 본체 케이스의 제1 측면 내지 제3 측면은 제1 완충부 에 지지되며, 제4 측면는 제2 완충부에 지지될 수 있다. 초음파 영상 장치를 완충 장치 에 고정시키기 위한 제1 고정부 및 제2 고정부는 제1 완충부 또는 제2 완충부 중 하나 이상에 배치될 수 있다. 일 예시에 따르면, 제1 고정부는 제2 완충부에 배치되어 본체의 일면을 지지함으로써, 제2 완 충부에 대한 본체의 위치를 고정시킬 수 있다. 예를 들어, 본체 케이스의 제4 측면이 제2 완충부에 지지되는 경우, 제2 완충부에 포함된 제1 고정부는, 제2 완충부에 대한 본체 케이스의 제4 측면의 위치를 고정시킬 수 있다. 일 예로서, 본체의 일면, 예를 들어 본체 케이스의 제4 측면에 홈부가 배치될 수 있다. 제1 고정부는 홈부에 대응되는 형상의 단차부 형상을 포함할 수 있다. 일 예시에 따르면, 단차부 형상의 제1 고정부와 홈부는 상호 결합하여 제2 완충부에 대한 본체의 위치를 고정시킬 수 있다. 이때, 제2 완충부에 포함된 제1 고정부는 탄성 물질을 포함할 수 있으므로, 제1 고정부는 홈 부와 끼워 맞춤 형태로 상호 결합될 수 있다. 일 예시에 따르면, 제2 고정부는 제1 완충부에 배치되어 본체의 다른 일면을 지지함으로써, 제 1 완충부에 대한 본체의 위치를 고정시킬 수 있다. 예를 들어, 본체 케이스의 제2 측면이 제1 완충부에 지지되는 경우, 제1 완충부에 포함된 제2 고정부는, 제1 완충부에 대한 본체 케이스의 제2 측면의 위치를 고정시킬 수 있다. 일 예로서, 본체의 다른 일면, 예를 들어 본체 케이스의 제2 측면에 복수 개의 돌기부가 배 치될 수 있다. 제2 고정부는 복수 개의 돌기부에 대응되는 형상의 복수 개의 홈부 형상을 포함할 수 있다. 일 예시에 따르면, 복수 개의 홈부 형상의 제2 고정부와 복수 개의 돌기부는 상호 결합하여 제1 완충부에 대한 본체의 위치를 고정시킬 수 있다. 이때, 제1 완충부에 포함된 제2 고정부 는 탄성 물질을 포함할 수 있으므로, 제2 고정부는 복수 개의 돌기부와 끼워 맞춤 형태로 상 호 결합될 수 있다. 도 13을 참조하면, 일 예시에 따른 밴드 고정부은 초음파 영상 장치를 완충 장치에 고정시킬 수 있다. 일 예로서, 본체의 상부면 또는 하부면은 밴드 고정부에 지지될 수 있다. 예를 들어, 본체케이스의 상부면 또는 하부면은, 본체 케이스의 상부면 또는 하부면을 가로지르 도록 배치되는 밴드 고정부에 의해 지지될 수 있다. 초음파 영상 장치를 완충 장치에 고정시키 기 위한 밴드 고정부는 본체 케이스의 상부면 또는 하부면 중 하나 이상에 배치될 수 있 다. 일 예시에 따르면, 밴드 고정부는 복수 개로 마련되어 본체 케이스의 상부면을 지지할 수 있다. 예를 들어, 밴드 고정부는 제1 밴드 고정부 및 제2 밴드 고정부를 포함할 수 있다. 다 만, 본 개시가 이에 제한되는 것은 아니며, 밴드 고정부는 단수 개로 마련될 수도 있다. 제1 밴드 고정부는 제1 방향(X 방향)을 따라 본체 케이스의 상부면을 가로지르도록 배치될 수 있다. 이때, 제1 밴드 고정부의 양 단부는 제1 완충부에 탈착 가능하도록 배치될 수 있다. 예를 들 어, 본체를 완충 장치에 배치시키는 경우, 제1 밴드 고정부의 양 단부 또는 일 단부를 제1 완 충부로부터 분리시킬 수 있다. 본체가 완충 장치에 결합된 경우, 제1 밴드 고정부의 양 단부는 제1 완충부에 고정되도록 결합 수 있다. 제2 밴드 고정부는 제2 방향(Y 방향)을 따라 본체 케이스의 상부면을 가로지르도록 배치될 수 있다. 이때, 제2 밴드 고정부의 일 단부는 제1 완충부에 탈착 가능하도록 배치될 수 있다. 예를 들 어, 본체를 완충 장치에 배치시키는 경우, 제2 밴드 고정부의 일 단부를 제1 완충부로부 터 분리시킬 수 있다. 본체가 완충 장치에 결합된 경우, 제2 밴드 고정부의 양 단부는 제1 완 충부에 고정되도록 결합 수 있다. 상술한 예시에서는 제1 밴드 고정부 또는 제2 밴드 고정부의 양 단부 또는 일 단부가 제1 완충부 에 탈착 가능하도록 서술하였으나, 본 개시가 이에 제한되는 것은 아니다. 제2 완충부 및 밴드 고 정부의 상대적 위치에 따라 밴드 고정부의 양 단부 또는 일 단부가 제2 완충부에 탈착 가능 하도록 배치될 수도 있다. 도 14은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 저면도이다. 도 15 은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 단면도이다. 도 16는 도 15에 도시된 초음파 진단 장치 조립체의 단면도의 일부를 확대한 확대 단면도이다. 도 17는 도 15에 도시된 초 음파 진단 장치 조립체의 단면도의 일부를 확대한 확대 단면도이다. 도 14 내지 도 17를 참조하면, 일 예시에 따른 초음파 영상 장치는 외부 공기가 내부로 유입되는 흡기부 와 내부로 유입된 공기가 외부로 배출되는 배기부를 포함할 수 있다. 일 예로서, 흡기부는 본체 의 일 면에 배치되고, 배기부는 본체의 다른 일면에 배치될 수 있다. 예를 들어, 흡기부는 본체 케이스의 제4 측면에 배치되고, 배기부는 본체 케이스의 제4 측면에 대향하는 본체 케이스의 제2 측면에 배치될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 흡기부 와 배기부는 본체의 상호 대향하는 양면이 아닌 다른 양면에 배치될 수도 있다. 일 예시에 따른 흡기 유로부는 흡기부와 소정의 간격을 사이에 두고 이격되도록 배치될 수 있다. 예 를 들어, 흡기 유로부는 흡기부와 마주보는 제2 완충부에 배치되어 흡기부와 제2 방향(Y 방향)을 따라 소정의 간격을 사이에 두고 이격되도록 배치될 수 있다. 도 16에 도시된 바와 같이 흡기부와 흡기 유로부 사이에 형성된 이격 공간은 외부 공기가 유입될 수 있는 유로를 형성할 수 있다. 일 예로서, 흡기 유로부는 외부 공기가 유입될 수 있는 유로 가이드로서, 일 방향을 따라 연장되는 복수 개의 흡기 유로를 포함할 수 있다. 이때 복수 개의 흡기 유로 각각은 흡기부에 마련된 복수 개의 흡기홀 각각과 상호 대응되도록 배치될 수 있다. 일 예시에 따른 배기 유로부는 배기부와 소정의 간격을 사이에 두고 이격되도록 배치될 수 있다. 예 를 들어, 배기 유로부는 배기부와 마주보는 제1 완충부에 배치되어 배기부와 제2 방향(Y 방향)을 따라 소정의 간격을 사이에 두고 이격되도록 배치될 수 있다. 도 17에 도시된 바와 같이 배기부와 배기 유로부 사이에 형성된 이격 공간은 외부 공기가 유입될 수 있는 유로를 형성할 수 있다. 일 예로서, 배기 유로부는 외부 공기가 유입될 수 있는 유로 가이드로서, 복수 개의 제1 배기홀을 포함할 수 있다. 이때 복수 개의 제1 배기홀 각각은 배기부에 마련된 복수 개의 제2 배기홀 각각과 상호 대응되도록 배치될 수 있다. 도 18a는 도 4에 도시된 B-B선을 따라 절단한 완충 장치의 단면도이다. 도 18b는 도 4에 도시된 C-C선을 따라 절단한 완충 장치의 단면도이다. 도 18a 내지 도 18b를 참조하면, 일 예시에 따른 제1 완충부는 본체의 측면의 외주부 및 핸들부 의 측면의 외주부를 보호할 수 있다. 예를 들어 측면 완충부는 본체의 외주부 중 적어도 하나 이상의 측면을 보호할 수 있다. 측면 완충부는 본체의 측면의 외주부에 배치되어 일 평면(XY 평면) 방향을 따라 인가되는 외부 충격으로부터 본체의 측면을 보호할 수 있다. 또한, 핸들 완충부는 핸들부의 외주부 중 적어도 하나 이상의 측면을 보호할 수 있다. 핸들 완충부는 핸들부의 측면의 외주부에 배 치되어 일 평면(XY 평면) 방향을 따라 인가되는 외부 충격으로부터 핸들부의 측면을 보호할 수 있다. 상술한 바와 같이 일 예시에 따른 제1 완충부는 탄성 재질을 포함할 수 있다. 이에 따라 제1 완충부 는 외부로부터 인가되는 충격 및 본체 및 핸들부에 인가되는 충격을 흡수할 수 있다. 다만, 본체 및 핸들부의 형상 및 무게에 따라 본체 및 핸들부에 인가되는 충격량이 증가할 수 있다. 증가 된 충격량으로부터 본체 및 핸들부를 보호하기 위해 제1 완충부에 보강 부재가 추가 배치 될 수 있다. 일 예시에 따른 보강 부재는 제1 완충부의 중심부에 삽입되도록 배치될 수 있다. 이때, 보강 부재 는 제1 완충부와 상이한 물질을 포함할 수 있다. 일 예로서, 제1 완충부가 탄성 물질을 포함 하는 경우, 보강 부재는 탄성 물질과 탄성 계수가 상이한 물질을 포함할 수 있다. 예를 들어 제1 완충부 는 금속 재질, 플라스틱 재질 등과 같은 강성 물질을 포함할 수 있다. 일 예시에 따른 보강 부재는, 도 18a에 도시된 바와 같이 제1 측면 완충부 및 제3 측면 완충부 의 중심부에 배치되는 제1 보강 부재 및 제3 보강 부재를 포함할 수 있다. 환언하면, 보강 부재는 제1 측면 완충부 및 제3 측면 완충부에 의해 각각 둘러싸이도록 배치되는 제1 보강 부재 및 제3 보강 부재를 포함할 수 있다. 이때, 제1 보강 부재 및 제3 보강 부재는 제1 측면 완충부 및 제3 측면 완충부와 같이 일 방향, 예를 들어 제2 방향(Y 방향)을 따라 연장되 도록 배치될 수 있다. 또한, 일 예시에 따른 보강 부재는, 도 18b에 도시된 바와 같이 제2 측면 완충부 및 핸들 완충부 의 중심부에 배치되는 제2 보강 부재 및 제4 보강 부재를 포함할 수 있다. 환언하면, 보강 부재는 제2 측면 완충부 및 핸들 완충부에 의해 각각 둘러싸이도록 배치되는 제2 보강 부재 및 제4 보강 부재를 포함할 수 있다. 이때, 제2 보강 부재 및 제4 보강 부재는 제2 측면 완충부 및 핸들 완충부와 같이 일 방향, 예를 들어 제1 방향(X 방향)을 따라 연장되도록 배치 될 수 있다. 상술한 예시에서는 도시하지 아니하였으나, 보강 부재에 포함된 제1 보강 부재와 제2 보강 부재 는 상호 연결되고, 제2 보강 부재와 제3 보강 부재는 상호 연결되고, 제3 보강 부재와 제4 보강 부재는 상호 연결되고, 제4 보강 부재와 제1 보강 부재는 상호 연결되는 일체 형상 으로 마련될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 제1 보강 부재 내지 제2 보강 부재 는 개별적으로 형성되어 상호 연결되도록 배치될 수도 있다. 도 19는 일 예시에 따른 완충 장치에 투영 사시도이다. 도 19를 참조하면, 일 예시에 따른 제1 완충부 및 제2 완충부는 본체 및 핸들부를 외부의 충격으로부터 보호할 수 있다. 본체 및 핸들부의 형상 및 무게에 따라 본체 및 핸들부에 인가 되는 충격량이 증가할 수 있다. 증가된 충격량으로부터 본체 및 핸들부를 보호하기 위해 제1 완충부 및 제2 완충부에 복수 개의 충격 완화부가 추가 배치될 수 있다. 일 예시에 따른 복수 개의 충격 완화부는 제1 완충부 및 제2 완충부 중 하나 이상의 내부에 배치될 수 있다. 일 예로서, 복수 개의 충격 완화부는 다각형 또는 원형 단면 중 하나 이상을 구비할 수 있다. 복수 개의 충격 완화부가 다각형 또는 원형 단면 중 하나 이상을 구비함에 따라 다각형 또는 원형 단면을 구비하는 형상의 구조적 강성에 의해 외부로부터 인가되는 충격이 본체 또는 핸들부로 인가되는 것을 방지할 수 있다. 일 예로서, 복수 개의 충격 완화부는 제1 완충부 및 제2 완충부와 동일하거나 상이한 물질을 포함할 수 있다. 일 예로서, 제1 완충부 및 제2 완충부가 탄성 물질을 포함하는 경우, 복수 개의 충격 완화부는 제1 완충부 및 제2 완충부의 탄성 물질과 동일하거나 상이한 탄성 계수를 구 비하는 물질을 포함할 수 있다. 일 예시에 따른 복수 개의 충격 완화부가 제1 완충부 및 제2 완충 부와 동일한 물질을 포함하는 경우, 복수 개의 충격 완화부는 제1 완충부 및 제2 완충부와 일체로 형성될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 복수 개의 충격 완화부는 별개로 형성되어 제1 완충부 및 제2 완충부의 내부에 결합될 수도 있다. 도 20은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 측면도이다. 도 21 은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 측면도이다. 도 22는 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 부분 단면도이다. 도 20 내지 도 22를 참조하면, 일 예시에 따른 초음파 영상 장치는 프로브가 연결될 수 있는 하나 이상 의 커넥터를 포함할 수 있다. 일 예로서, 하나 이상의 커넥터는 본체의 일면에 배치될 수 있다. 예를 들어, 하나 이상의 커넥터는 본체 케이스의 일 측면에 배치될 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 하나 이상의 커넥터는 본체 케이스의 임의의 영역에 배치될 수도 있다. 일 예시에 따른 커넥터 홀은 상술한 하나 이상의 커넥터에 대응되는 위치에 배치될 수 있다. 일 예 로서, 커넥터 홀은 하나 이상의 커넥터가 외부에 노출될 수 있는 개구 형상으로 마련될 수 있다. 예 를 들어, 하나 이상의 커넥터가 본체 케이스의 제1 측면에 배치되는 경우, 커넥터 홀은 제1 측면에 대응되는 제1 측면 완충부에 배치될 수 있다. 하나 이상의 커넥터가 외부로 노출될 수 있으므로, 외부에 배치된 이물질이 하나 이상의 커넥터에 삽입될 수 있다. 일 예시에 따른 커넥터 홀 개폐부는, 외부에 배치된 이물질이 하나 이상의 커넥터에 삽입되는 것을 방지하도록 커넥터 홀을 개폐할 수 있다. 환언하면, 커넥터 홀 개폐부는 외부에 배치된 이물질이 하나 이상의 커넥터에 삽입되는 것을 방지하는 방진 부재 및 방수 부재일 수 있다. 일 예로서, 커넥터 홀 개폐부는 커넥터 홀과 대응되는 형상을 포함할 수 있다. 또한, 커넥터 홀 개 폐부는 커넥터 홀을 개폐할 수 있도록 제1 완충부에 결합될 수 있다. 예를 들어 커넥터 홀 개폐부는 제1 완충부에 일 축을 중심으로 회전가능하도록 배치될 수 있다. 이에 따라 프로브가 커넥터에 결합되는 경우, 커넥터 홀 개폐부는 도 21에 도시된 바와 같이 커넥터 홀을 개방시 킬 수 있다. 또한, 프로브가 커넥터에 결합되지 않는 경우, 커넥터 홀 개폐부는 일 축을 중심으 로 회전하여 커넥터 홀을 차폐시킬 수 있다. 도 23은 일 예시에 따른 프로브가 결합된 초음파 진단 장치 조립체의 측면도이다. 도 24는 일 예시에 따른 프로 브가 분리된 초음파 진단 장치 조립체의 측면도이다. 도 23 및 도 24를 참조하면, 일 예시에 따른 초음파 영상 장치는 프로브가 연결될 수 있는 하나 이상의 커넥터를 포함할 수 있다. 프로브는 커넥터를 제외한 나머지 영역에 배치되는 홈부를 포함 할 수 있다. 프로브에 마련된 커넥터가 초음파 영상 장치에 마련된 하나 이상의 커넥터에 연 결되는 경우, 프로브에 마련된 홈부가 초음파 영상 장치로부터 이격된 상태로 배치될 수 있다. 프 로브에 마련된 홈부가 초음파 영상 장치로부터 이격된 상태로 배치되는 경우, 외부로부터 인가되 는 충격에 의해 프로브에 마련된 커넥터에 충격이 전달될 수 있다. 일 예시에 따른 충격 완화 단차부는 프로브에 마련된 홈부에 대응되는 형상으로 마련되어 홈부 를 지지할 수 있다. 일 예로서, 충격 완화 단차부는 커넥터 홀의 일 단부에 배치될 수 있다. 이때, 충격 완화 단차부는 제1 완충부와 일체로 마련될 수 있으며, 탄성 재질을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 충격 완화 단차부는 별개로 마련되어 커넥터 홀의 일 단부에 결합되도록 배치될 수 있다. 상술한 바와 같이, 충격 완화 단차부가 프로브에 마련된 홈부 를 지지함에 따라, 충격 완화 단차부는 외부로부터 프로브에 마련된 커넥터에 인가되는 충 격을 방지할 수 있다. 도 25는 일 예시에 따른 완충 장치의 사시도이다. 도 26은 일 예시에 따른 초음파 진단 장치 조립체의 부분 단 면도이다. 도 25 및 도 26을 참조하면, 일 예시에 따른 본체는 소정의 홈 형상을 구비하는 홈부를 포함할 수 있 다. 일 예로서, 본체에 마련된 홈부는 상이한 구성 사이의 접합부 또는 결합부일 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 홈부는, 외부에 배치된 이물질이 초음파 영상 장치에 마련된 본체 케이스의 내부에 배치된 부품과 유체 연통할 수 있는 임의의 개구 형상을 포함할 수 있다. 일 예시에 따른 방수부는 본체에 마련된 홈부에 대응되는 형상을 포함할 수 있다. 예를 들어 방 수부는 홈부에 대응되는 돌출부 형상을 포함할 수 있다. 일 예시에 따른 방수부는 제1 완충부 또는 제2 완충부 중 하나 이상에 배치될 수 있다. 예를 들어 방수부는 제1 완충부 또 는 제2 완충부 중 하나 이상의 내측면에 배치될 수 있다. 이때, 방수부는 제1 완충부 또는 제2 완충부 중 하나 이상의 둘레부를 따라 연장되도록 배치될 수 있다. 또한, 방수부는 제1 완충부 또는 제2 완충부 중 하나 이상과 일체로 형성될 수 있다. 이때, 방수부는 제1 완충부 또는 제2 완충부 중 하나 이상과 동일한 물질 예를 들어 탄성 물질을 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, 방수부는 별개로 마련되어 제1 완충부 또는 제2 완충부 중 하나 이상에 결합될 수 있다. 이때, 방수부는 제1 완충부 또는 제2 완충부 중 하나 이상과 상이한 물질을 포함할 수도 있다. 일 예시에 따른, 방수부는 홈부에 삽입되도록 배치되어 외부로부터 유입되는 이물질을 차단할 수 있 다. 일 예로서, 방수부가 탄성 물질을 포함하는 경우, 돌출부 형상으로 마련된 방수부는 끼워 맞춤 방식으로 홈부에 삽입되도록 배치되어 외부로부터 유입되는 이물질을 차단할 수 있다. 전술한 실시예 외의 많은 실시예들이 본 발명의 특허청구범위 내에 존재한다. 본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고 자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2023-0151948", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시는, 다음의 자세한 설명과 그에 수반되는 도면들의 결합으로 쉽게 이해될 수 있으며, 참조 번호 (reference numerals)들은 구조적 구성요소(structural elements)를 의미한다. 도 1은 본 개시의 일 실시예에 따른 초음파 영상 시스템의 구성을 도시한 블록도이다. 도 2는 일 예시에 따른 완충 장치를 포함하는 초음파 진단 장치 조립체의 사시도이다. 도 3은 일 예시에 따른 완충 장치와 초음파 진단 장치의 분리 사시도이다. 도 4는 일 예시에 따른 완충 장치의 사시도이다. 도 5는 일 예시에 따른 완충 장치의 평면도이다. 도 6은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 평면도이다. 도 7은 도 6에 도시된 P영역을 확대한 확대도이다. 도 8은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 저면도이다. 도 9는 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 측면도이다. 도 10은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 측면도이다. 도 11은 도 2에 도시된 A-A선을 따라 절단한 초음파 진단 장치 조립체의 단면도이다. 도 12a는 도 11에 도시된 초음파 진단 장치 조립체의 단면도의 일부를 확대한 확대 단면도이다. 도 12b는 도 11에 도시된 초음파 진단 장치 조립체의 단면도의 일부를 확대한 확대 단면도이다. 도 13은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 평면도이다. 도 14은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 저면도이다. 도 15은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 단면도이다. 도 16는 도 15에 도시된 초음파 진단 장치 조립체의 단면도의 일부를 확대한 확대 단면도이다. 도 17는 도 15에 도시된 초음파 진단 장치 조립체의 단면도의 일부를 확대한 확대 단면도이다. 도 18a는 도 4에 도시된 B-B선을 따라 절단한 완충 장치의 단면도이다. 도 18b는 도 4에 도시된 C-C선을 따라 절단한 완충 장치의 단면도이다. 도 19는 일 예시에 따른 완충 장치에 투영 사시도이다. 도 20은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 측면도이다. 도 21은 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 측면도이다. 도 22는 일 예시에 따른 완충 장치에 초음파 영상 장치가 배치된 초음파 진단 장치 조립체의 부분 단면도이다. 도 23은 일 예시에 따른 프로브가 결합된 초음파 진단 장치 조립체의 측면도이다. 도 24는 일 예시에 따른 프로브가 분리된 초음파 진단 장치 조립체의 측면도이다. 도 25는 일 예시에 따른 완충 장치의 사시도이다. 도 26은 일 예시에 따른 초음파 진단 장치 조립체의 부분 단면도이다."}
