{"patent_id": "10-1999-0039717", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원번호": "10-1999-0039717", "출원인": "김남영", "발명자": "김남영"}}
{"patent_id": "10-1999-0039717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "태양계의 행성중 지구의 공전궤도를 응용하여 지름 3억Km의 전파렌즈를 갖도록 하는 커다란 우주망원경에 관한것으로,지구의 공전궤도를 따라 무수히[2개이상] 나열되어 지름 3억Km의 타원형 전파렌즈를 형성하는 단위위성8-2공개특허특2001-0027799전파망원경군[무리],지구공전 타원궤도의 단위위성전파망원경 군으로부터 탐지한 전파들을 한곳에 모으는, 태양중심 원뿔형의 뿔끝에 위치하는 위성전파 중앙통제 우주스테이션부,우주스테이션에서 보내오는 정보자료를 수집하고 관리하는 크니우주망원경 지구본부,원뿔형 우주망원경의 단위위성전파망원경 각각과 중앙통제 우주스테이션과의 일정한 거리를 유지하도록 하며, 전파나 빛이 도달하는 시차를 계산하고 오차를 수정하여 우주의 천체영상을 제작하는 CPU제어부, 전파 및 각종 소리, 영상, 인터넷정보등을 송수신하는 안테나부, 공전궤도를 수정하거나 안테나 및 렌즈각도를 조절하는 구동부, 태양열을 이용하여 에너지를 공급하는 전력공급부, 및 각종 엔진과 서비스부대시설 등으로 구성되며, 지구의 공전궤도를 따라 일년에 한번씩 자연스럽게 각각의 단위위성전파망원경을 점검하고, 다양한 우주현상을 실험할수 있도록 하는 크니우주망원경."}
{"patent_id": "10-1999-0039717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 도 2 에서와 같이 단위위성전파망원경의 타원궤도를 지구공전궤도 및 태양계의 모든공전궤도를 포함하여 적용할 수 있도록 하며, 태양계 상부에 가상으로 임의의 공전궤도와 태양계 하부에 가상으로 임의의 공전궤도를 형성하도록 하여 각각의 단위위성전파망원경으로부터 전해오는 정보를 태양중심 원뿔형의 뿔끝에 위치하는 위성전파 중앙통제 우주스테이션에서 종합분석하여 입체적으로 영상을 표현할 수 있도록 하는 멀티입체영상 크니우주망원경."}
{"patent_id": "10-1999-0039717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 도 3 에서와 같이 단위전파망원경의 타원궤도를 지구표면에 형성하도록 하여 각각의 단위전파망원경으로부터 전해오는 정보를 지구 적도궤도 상의 위성전파 중앙통제 정지위성 우주스테이션에서 종합분석하여 입체적으로 영상을 표현할 수 있도록 하는 멀티입체영상 크니우주망원경."}
{"patent_id": "10-1999-0039717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 도 4 에서와 같이 단위위성전파망원경의 타원궤도를 달공전궤도 및 지구위성의 모든공전궤도를 포함하여 적용할수 있도록 하며, 지구 상부에 가상으로 임의의 공전궤도와 지구 하부에 가상으로 임의의 공전궤도를 형성하도록 하여 각각의 단위위성전파망원경으로부터 전해오는 정보를 지구중심 원뿔형의 뿔끝에 위치하는 위성전파 중앙통제 우주스테이션에서 종합분석하여 입체적으로 영상을 표현할 수 있도록 하는 멀티입체영상 크니우주망원경."}
{"patent_id": "10-1999-0039717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 각각의 단위위성전파망원경에는 광학망원경이 탑재되도록 하며, 도 5 의 흐름도에서와 같이 단위위성전파망원경 및 위성전파 중앙통제 우주스테이션부 등에서는 모든 작동이 퍼지이론에 따른 인공지능으로 작동되도록 하여, 스스로 오차를 수정하고 통제하여 항상 일정한 상태를 유지하도록 제어되는 것을 특징으로 하는 멀티입체영상 크니우주망원경.도면8-3공개특허특2001-0027799 도면18-4공개특허특2001-0027799 도면28-5공개특허특2001-0027799 도면38-6공개특허특2001-0027799 도면48-7공개특허특2001-0027799 도면58-8공개특허특2001-0027799"}
{"patent_id": "10-1999-0039717", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 태양계의 행성중 지구의 공전궤도를 응용하여 지름 3억Km의 전파렌즈를 갖도록 하는 커다란 우주망원경에 관한것으로, 지구의 공전궤도를 따라 무수히[2개이상] 나열되어 지름 3억Km의 타원형 전파렌즈를 형성하는 단위위성 전파망원경군[무리], 지구공전 타원궤도의 단위위성전파망원경 군으로부터 탐지한 전파들을 한곳에 모으 는, 태양중심 원뿔형의 뿔끝에 위치하는 위성전파 중앙통제 우주스테이션부, 우주스테이션에서 보내오는 정보자료를 수집하고 관리하는 크니우주망원경 지구본부, 우주의 천체영상을 제작하는 CPU제어부, 안테 나부, 렌즈각도를 조절하는 구동부, 에너지를 공급하는 전력공급부 및 각종 엔진과 서비스부대시설 등으 로 구성되며, 지구의 공전궤도를 따라 일년에 한번씩 자연스럽게 각각의 단위위성전파망원경을 점검하 고, 다양한 우주현상을 실험할 수 있도록 한다. 일반적으로, 망원경의 가장 중요한 기술적 과제는 얼마나 커다란 반사경[렌즈]으로 얼마나 멀리 섬세하 게 볼 수 있는가[해상도]에 달려 있는데, 지름 3억Km의 렌즈효과를 나타내는 크니우주망원경은 우주생성 원리와 함께 우주의 끝을 관찰하는 데 기여할 것으로 기대된다."}
