{"patent_id": "10-2013-0141293", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0057659", "출원번호": "10-2013-0141293", "발명의 명칭": "제습기 및 제어방법", "출원인": "주식회사 그린기술", "발명자": "김상희"}}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "습한공기가 유입되는 공기흡입구가 상부 일측에 형성되고, 하단에는 건조공기가 배출되는 배출구가 형성되며,내부에 수조가 형성된 본체; 상기 본체의 내부에 형성되며, 습한공기가 통과되도록 통기부가 형성된 방열판재와, 상기 방열판재의 내부에 형성되며 냉매가 순환되는 냉각코일로 이루어진 증발기와, 상기 증발기의 일측에 형성되며, 가열된 냉매를 응축하는 응축기와, 상기 증발기와 응축기에 연결되어 냉매를 압축하는 압축기로 구성된 냉각부; 상기 배출구에 장착되는 팬; 상기 본체의 상부에 형성되는 표시제어부: 및 탁찰식리모콘과 표시제어부와 연동되며 퍼지기능과 스마트폰 연동 및 감시 기능을 갖는 마이콤을 포함하며, 상부 일측에 공기흡입구에는 흡입되는 공기의 온도,습도를 감지하는 센서가 형성되고, 사용자가 표시제어부를조작하여 설정한 퍼지 기능에 따라 제습동작을 제어하도록 하는 것으로, 상기 내부에 냉각부를 통과한 습한공기는 방열판재에서 결로에 의해 하단의 수조로 낙하되어 수집되며 외부로 연속배수가 되도록 연속배수구 및 외부에서 습기를 제거 할수 있도록 후렉시블 파이프 연결 흡입구 가 이루어진 것을 특징으로 하는 스마트 제습기."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 배출구에 인접된 응축기의 발열부를 습기가 제거된 공기가 통과하면서 건조 및 가열 공기로 변환되도록 한것을 특징으로 하는 스마트 제습기."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 발열부의 일측에는 살균기가 형성되고, 상기 건조된 공기가 살균기를 통과하면서 살균된 청정 공기로 배출되도록 한 것을 특징으로 하는 스마트 제습기."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 살균기는 살균램프 또는 아크살균기로 이루어지며, 살균 ,탈취된 공기를 배출하여 청정기능을 갖는 것을특징으로 하는 스마트 제습기."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 표시제어부와 연동되는 착탈식 리모콘 또는 휴대단말기를 포함하는 것을 특징으로 하는 스마트 제습기."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "상기 제 1항 내지 제 5항 중 어느 한 항에 기재된 제습기에 있어서, 온도와 습도 측정을 통한 퍼지기능과, 대기전력 차단기능을 포함하는 것으로, 실내환경 최적화 모드를 선택시 온도 및 습도를 자동 측정하여 저,중,고 등의 모드를 제습기가 인공지능에 의해동작단계를 스스로 설정 동작하도록 하는 것을 특징으로 하는 제습기의 제어방법."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,공개특허 10-2015-0057659-3-상기 퍼지기능은 마이크로웨이브센서를 적용하여 퍼지모드 실행시 사용자가 거실 및 침실공간에 있을 경우 센서의 자동감지기능에 의해서 해당시점에만 자동제습기능을 수행하며 사람이 일정시간 감지되지 않을 경우 제습기능을 정지 및 대기전력 차단모드로 전환하도록 하는 것을 특징으로 하는 제습기의 제어방법."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,보안모드기능을 적용하여 외출시 사용자가 감지되지 않으면 자동으로 절전되고, 보안감시 모드진입(제어부에 설정시 적용,미적용/센서사용등 옵션기능제공) 에서 와이파이 연결이 되어있는 경우는 움직임 감지시 사용자의 스마트폰 또는 URL로 감지신호를 자동으로 전송 되는 것을 특징으로 하는 제습기의 제어방법."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6항에 있어서,와이파이 또는 블루투스 내장형제습기로 세대내 무선공유기 연동을 통한 원격제어 및 세대 내부에서 모드설정에따른 제어방식설정에 의한 인프라 스트럭처 또는 애드 혹 방식 설정으로 스마트폰을 이용하여 제습기를 제어하도록 하는 것을 특징으로 하는 제습기의 제어방법."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6항에 있어서,내장된 와이파이 또는 브루투스기능으로 연동하여 리모콘을 사용 않더라도 애드훅 모드 동작시 스마트폰으로 해당 어플을 다운받아 제습기의 모든기능을 컨트롤 할수 있도록 한 것을 특징으로 하는 제습기의 제어방법."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 6항에 있어서,CMOS 또는 CCD 카메라가 내장되어 인체 감지시 녹화하는 블랙박스 기능을 적용하도록 하여, 일반 주택 사용자의방범 보안 감시 기능을 갖는 것을 특징으로 하는 제습기의 제어방법."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 6항에 있어서,상기 제습기의 가동 상태를 사용자 인식을 위한 제습상황을 음성으로 통보 하는 기능을 갖는 것을 특징으로 하는 제습기의 제어방법."}
{"patent_id": "10-2013-0141293", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 6항에 있어서,상기 제습기 가동 및 상태에 따른 LED 감성조명으로 자연친화적인 공간 창출을 할 수 있는 제습기의 제어방법."}
{"patent_id": "10-2013-0141293", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 퍼지기능을 갖는 스마트 제습기 및 원격 제어방법에 관한 것이다. 본 발명은 습한공기가 유입되는 공 기흡입구가 상부 일측에 형성되고, 하단에는 건조공기가 배출되는 배출구가 형성되며, 내부에 수조가 형성된 본 체; 상기 본체의 내부에 형성되며, 습한공기가 통과되도록 통기부가 형성된 방열판재와, 상기 방열판재의 내부에 (뒷면에 계속)"}
{"patent_id": "10-2013-0141293", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 퍼지기능을 갖는 스마트 제습기 및 원격 제어방법에 관한 것으로, 더욱 상세하게는 자동으로 온도,습 도 측정을 통한 퍼지기능 내장과 에너지절약을 위한 대기전력 차단기능이 구비되어 인공지능에 의하여 동작 되 도록 하는 퍼지기능을 갖는 스마트 제습기 및 원격 제어방법에 관한 것이다."}
{"patent_id": "10-2013-0141293", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 공기 중의 습도와 관련하여, 습도가 높게 되면 부패, 부식, 응결수 현상이 일어나고, 또한 악취 및 박테리아도 발생하게 되므로 병원, 습기에 취약한 전기, 통신 및 각종 전자 장비 등에는 이러한 습기를 제거하 는 장치가 요구된다. 이러한 제습시스템은, 냉동 압축기를 이용하여 압축공기의 온도를 낮춘 뒤 압축공기에 포함된 수분을 응축시켜 제습하는 냉동식 제습시스템과, 흡착제(또는 제습제, 흡습제)를 이용하여 습한 공기에 포함된 공기를 흡착하여 제습하는 흡착식 제습시스템으로 구분된다. 이에 관련된 선행기술로는 국내 특허등록 10-1140218호의 제습기가 개시되어 있다. 상기 선행기술은 제습부와 건조부가 일체형 또는 분할 조립형 방식의 일 장치로 제공되어 제습을 도모함과 동시 에 열교환에 의한 제습시 발생된 더운 공기를 이용하여 피복류(속옷, 수건, 신발 등)를 건조시킬 수 있도록 한 것이다. 그러나 종래 기술은 습도 및 온도 측정과 연동되는 퍼지기능 및 에너지 절약 기능이 미흡하였고, 또한 스마트폰 을 이용하는 원격제어가 불가능한 문제점이 있었다."}
{"patent_id": "10-2013-0141293", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 종래 기술의 문제점을 해소하기 위해 안출된 것으로, 자동으로 온도,습도 측정을 통한 퍼지기 능 내장 과 에너지절약을 위한 대기전력 차단기능이 구비되어 인공지능에 의하여 동작 되도록 하여 사용자의 편 리성과 안전성을 극대화 하였고, 부가적으로 살균,탈취,청정기능탑제 및 제습상황 음성통보기능, 스마트폰에 의 한 외부원격제어기능을 포함하며 보안감시 기능이 구비 되어 다목적 사용할 수 있도록 한 퍼지기능을 갖는 스마 트 제습기 및 원격 제어방법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2013-0141293", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 본 발명의 목적은, 습한공기가 유입되는 공기흡입구가 상부 일측에 형성되고, 하단에는 건조공기가 배출 되는 배출구가 형성되며, 내부에 수조가 형성된 본체; 상기 본체의 내부에 형성되며, 습한공기가 통과되도록 통 기부가 형성된 방열판재와, 상기 방열판재의 내부에 형성되며 냉매가 순환되는 냉각코일로 이루어진 증발기와, 상기 증발기의 일측에 형성되며, 가열된 냉매를 응축하는 응축기와, 상기 증발기와 응축기에 연결되어 냉매를 압축하는 압축기로 구성된 냉각부; 상기 배출구에 장착되는 팬; 상기 본체의 상부에 형성되는 표시제어부; 및 상기 표시제어부와 연동되며 퍼지기능과 스마트폰 연동 기능을 갖는 마이콤을 포함하며, 상부 일측에 공기흡입 구에는 흡입되는 공기의 온도,습도를 감지하는 센서가 형성되고, 사용자가 표시제어부를 조작하여 설정한 퍼지 기능에 따라 제습동작을 제어하도록 하는 것으로, 상기 내부에 냉각부를 통과한 습한공기는 방열판재에서 결로 에 의해 하단의 수조로 낙하되어 수집되며 외부로 연속배수가 되도록 연속배수구 및 외부에서 습기를 제거 할수 있도록 후렉시블 파이프 연결 흡입구를 포함하는 스마트 제습기에 의해 달성될 수 있다. 상기 배출구에 인접된 응축기의 발열부를 습기가 제거된 공기가 통과하면서 건조 및 가열 공기로 변환되도록 한 것을 특징으로 한다. 상기 발열부의 일측에는 살균기가 형성되고, 상기 건조된 공기가 살균기를 통과하면서 살균된 청정 공기로 배출 되도록 한 것을 특징으로 한다. 상기 살균기는 살균램프 또는 아크살균기로 이루어지며, 살균 ,탈취된 공기를 배출하여 청정기능을 갖는 것을 특징으로 한다. 상기 표시제어부와 연동되는 착탈식 리모콘을 포함하는 것을 특징으로 한다. 상기 본체에는 2색 또는 3색 LED가 형성되어 제습 및 실내 감성 무드등으로 사용되는 것을 특징으로 한다. 한편, 상기한 퍼지기능을 갖는 스마트 제습기의 제어방법에 있어서, 온도와 습도 측정을 통한 퍼지기능과, 대기 전력 차단기능을 포함하는 것으로, 실내환경 최적화 모드를 선택시 온도 및 습도를 자동 측정하여 저,중,고 등의 모드를 제습기가 인공지능에 의해 동작단계를 스스로 설정 동작토록 하는 것을 특징으로 한다. 상기 퍼지기능은 마이크로웨이브센서를 적용하여 퍼지모드 실행시 사용자가 거실 및 침실공간에 있을 경우 센서 의 자동감지기능에 의해서 해당시점에만 자동제습기능을 수행하며 사람이 일정시간 감지되지 않을 경우 제습기 능을 정지 및 대기전력 차단모드로 전환되는 스마트 기능을 갖는 것을 특징으로 한다. 또한 보안모드기능을 적용하여 외출시 사용자가 감지되지 않으면 자동으로 절전되고, 보안감시 모드진입(제어부 에 설정시 적용,미적용/센서사용등 옵션기능제공) 에서 와이파이 연결이 되어있는 경우는 움직임 감지시 사용자 의 스마트폰 또는 URL로 감지신호를 자동으로 전송 되는 기능을 갖는 것을 특징으로 한다. 와이파이 또는 블루투스 내장형제습기로 세대내 무선공유기 연동을 통한 원격제어 및 세대 내부에서 모드설정에 따른 제어방식설정에 의한 인프라 스트럭처 또는 애드 혹 방식 설정으로 스마트폰을 이용하여 제습기를 제어하 도록 하는 것을 특징으로 한다. 내장된 와이파이 또는 브루투스기능으로 연동하여 리모콘을 사용 않더라도 애드훅 모드 동작시 스마트폰으로 해 당 어플을 다운받아 제습기의 모든기능을 컨트롤 할수 있도록 한 것을 특징으로 한다. CMOS 또는 CCD 카메라가 내장되어 인체 감지시 녹화하는 블랙박스 기능을 적용하도록 하여, 일반 주택 사용자의 방범 보안 감시 기능을 갖는 것을 특징으로 한다. 상기 제습기의 가동 상태를 사용자 인식을 위한 제습상황을 음성으로 통보 하는 기능을 갖는 것을 특징으로 한 다. 상기 제습기 가동시 서리 동파방지를 위한 퍼지기능으로 자동적으로 제상운전 기능을 갖는 것을 특징으로 한다."}
{"patent_id": "10-2013-0141293", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 공기 유입부를 통한 습한공기를 필터하고 냉각부의 표면과 접촉 수분을 제거하며 제거된 공 기는 발열부 와 살균기를 통과하여 청정 건조된 공기를 배출토록 하며 현재의 가동유무를 음성출력 및 외부에서 도 스마트폰으로 원격제어 및 보안감시가 가능하도록 사용자의 편리성을 극대화 하였고 퍼지 제습기능 및 살균 기능, 대기전력 차단기능이 구비되어 에너지 절감 효과를 갖는다."}
{"patent_id": "10-2013-0141293", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 바람직한 실시예를 첨부된 도면을 토대로 상세하게 설명하면 다음과 같다. 첨부된 도면 중에서, 도 1은 본 발명에 따른 퍼지기능을 갖는 스마트 제습기를 나타낸 구성도, 도 2는 본 발명 에 따른 퍼지기능을 갖는 스마트 제습기의 제어방법을 나타낸 흐름도, 도 3 및 도 4, 도 5, 도 6, 도 7, 도 8, 도 9는 본 발명에 따른 퍼지기능을 갖는 스마트 제습기와 스마트폰의 연동 및 감시기능을 나타낸 흐름도이다. 도 1에 도시된 바와 같이, 본 발명에 따른 퍼지기능을 갖는 스마트 제습기는, 크게 본체와 이 본체의 내 부에 형성되는 냉각부, 응축기,압축기,살균기,팬을 포함하고, 상기 본체의 상부에 형성되 는 표시제어부,탈착식리모콘 ,카메라, 감성조명 및 마이콤(미도시)을 포함한다. 상기 본체는, 박스 형상으로 이루어지고, 습한공기가 유입되는 공기흡입구가 상부 일측에 형성되고, 하단에 는 건조공기가 배출되는 배출구가 형성되며, 내부에 수조가 형성된다. 상기 공기흡입구는 본체의 상부 일측에 형성되며 흡입되는 공기의 온도,습도를 감지하는 센서(미도시)가 구 비된다. 상기 본체의 상부에는 표시제어부와 카메라, 감성조명 및 탈착식리모콘이 장착된다. 상기 냉각부는 상기 본체의 내부에 형성되며, 습한공기가 통과되도록 통기부가 형성된 방열판재와, 상기 방열판재의 내부에 형성되며 냉매가 순환되는 냉각코일로 이루어진 증발기와, 상기 증발기의 일측에 형성되며, 가열된 냉매를 응축하는 응축기와, 상기 증발기와 응축기에 연결되어 냉매를 압 축하는 압축기로 구성된다. 상기 냉각부의 하부에는 냉각부를 통과한 습한공기가 방열판재에 결로가 맺히게 되고, 이 결로가 방열판 재를 타고 낙하되어 수집될 수 있도록 하단에 탈착식 수조가 형성되며 결로에 의해 제거된 물은 수조의 만 수경보 통보로 사용자가 즉시 알수 있도록 구성된다. 상기 본체에 외부에서 습기를 제거 할수 있도록 후렉시블 파이프 연결 흡입구 및 외부로 연속배수가 되 도록 연속 배수구가 형성된다. 상기 마이콤은 표시제어부와 연동되며 퍼지기능과 스마트폰 연동 기능을 갖는 것으로, 사용자가 표시제어부를 직접 조작하거나 또는 리모콘을 조작하거나 또는 스마트폰과 같은 휴대단말기를 원격 조작하여 설정한 퍼지 기 능에 따라 제습동작을 제어하게 된다. 또한 상기 배출구에 인접된 응축기의 발열부를 습기가 제거된 공기가 통과하면서 건조 및 가열 공기로 변환 되어 외부로 배출될 수 있다. 여기서 상기 발열부의 일측에는 살균기가 형성되고, 상기 건조된 공기가 살균기를 통과하면서 살균된 청정 공기로 배출될 수 있다. 상기 살균기는 살균램프 또는 아크살균기로 이루어지며, 살균 ,탈취된 공기를 배출하여 청정기능을 갖는다. 한편 상기 표시제어부와 연동되는 탈착식 리모콘을 포함한다. 리모콘을 조작함으로써 원격으로 제습기 의 조작이 가능해질 수 있다. 또한 상기 표시제어부에는 2색 또는 3색 LED가 형성되어 제습 및 실내 감성 무드등으로 사용될 수 있다. 한편 도 2 및 도 3, 도4, 도 5, 도 6, 도 7, 도 8, 도 9에 도시된 바와 같이, 상기한 퍼지기능을 갖는 스마트 제습기를 제어하는 제어방법에 있어서, 습한공기가 유입되면 온도와 습도 측정을 하고, 냉각부를 가동시키고, 제습운전을 실행하여 건조공기로 배출하는 퍼지기능과, 제상운전기능과, 대기전력 차단기능을 포함하는 것으로, 실내환경 최적화 모드를 선택시 온도 및 습도를 자동 측정하여 저,중,고 등의 모드를 제습기가 인공지능에 의해 동작단계를 스스로 설정하여 동작될 수 있다. 상기 퍼지기능은, 마이크로웨이브센서를 적용하여 퍼지모드 실행시 사용자가 거실 및 침실공간에 있을 경우 센 서의 자동감지기능에 의해서 해당시점에만 자동제습기능을 수행하며 사람이 일정시간 감지되지 않을 경우 제습 기능을 정지 및 대기전력 차단모드로 전환되는 스마트 기능을 갖는다. 즉, 대기전력이 기준 이하인지 감지하고, 10초간 지속되면 대기전력 차단을 실행한다. 또한 보안모드기능을 적용하여 외출시 사용자가 감지되지 않으면 자동으로 절전되도록 한다. 보안감시 모드진입(제어부에 설정시 적용,미적용/센서사용등 옵션기능제공) 에서 와이파이 연결이 되어있는 경 우는, 움직임 감지시 사용자의 스마트폰 또는 URL로 감지신호를 자동으로 전송 되는 기능을 갖는다. 또한 와이파이 또는 블루투스 내장형제습기로 세대내 무선공유기 연동을 통한 원격제어 및 세대 내부에서 모드 설정에 따른 제어방식설정에 의한 인프라 스트럭처 또는 애드 혹 방식 설정으로 스마트폰을 이용하여 제습기를 제어하도록 한다. 따라서 내장된 와이파이 또는 블루투스기능으로 연동하여 리모콘을 사용 않더라도 애드혹 모드 동작시 스마트폰 으로 해당 어플을 다운받아 제습기의 모든기능을 컨트롤 할수 있다. 또한 CMOS 또는 CCD 카메라가 내장되어 인체 감지시 녹화하는 블랙박스 기능을 적용하도록 하여, 일반 주택 사 용자의 방범 보안 감시 기능을 갖는다. 그리고 상기 제습기의 가동 상태를 사용자 인식을 위한 제습상황을 음성으로 통보 하는 기능을 갖는다. 또한 제습기 가동시 냉각부 증발기의 서리 동파방지를 위한 퍼지기능으로 자동적으로 제상운전 기능을 갖는다. 비록 본 발명이 상기 언급된 바람직한 실시예와 관련하여 설명되어졌지만, 발명의 요지와 범위로부터 벗어남이 없이 다양한 수정 및 변형이 가능한 것은 당업자라면 용이하게 인식할 수 있을 것이며, 이러한 변경 및 수정은 모두 첨부된 청구의 범위에 속함은 자명하다."}
{"patent_id": "10-2013-0141293", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 퍼지기능을 갖는 스마트 제습기를 나타낸 구성도, 도 2는 본 발명에 따른 퍼지기능을 갖는 스마트 제습기의 제어방법을 나타낸 흐름도, 도 3 및 도 4, 도 5, 도 6, 도 7, 도 8, 도 9는 본 발명에 따른 퍼지기능을 갖는 스마트 제습기와 스마트폰의 연동 및 감시기능을 나타낸 흐름도."}
