{"patent_id": "10-2015-0059796", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0128055", "출원번호": "10-2015-0059796", "발명의 명칭": "전원 차단을 위한 전자 장치 장착 구조 및 그것을 포함하는 케이스 및 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김명규"}}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,바디; 및바디에서 힌지부를 중심으로 회전하여 일정 각도로 개폐 가능하도록 설치되는 커버를 포함하되, 상기 힌지부의 일측이 가압받으면, 상기 커버가 일정 각도로 개방됨으로써 상기 전자 장치의 전원이 차단되는것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 커버는 상기 전자 장치의 배터리를 수용하며, 상기 커버의 개방에 따라 함께 유동되는 것을 특징으로 하는전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 커버는,상기 바디에서 힌지축을 중심으로 회전 가능하게 설치되는 힌지부;상기 힌지부의 일측으로 연장 형성되어 전자 장치 내부에 수용되는 배터리를 지지하는 배터리 수용부; 및상기 힌지부의 타측으로 연장 형성되어 외부의 가압에 의해 상기 힌지부를 중심으로 상기 배터리 수용부를 개방시키는 돌기 접촉부를 포함하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 바디의 커버 회동 공간에는 적어도 하나의 고정 돌기가 형성되며, 상기 커버의 대응 위치에는 상기 커버가바디에서 폐쇄된 상태를 유지할 수 있도록 상기 고정 돌기가 억지 끼움 방식으로 수용되기 위한 고정홈이 형성되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 바디 내부의 상기 돌기 접촉부의 회동 범위에 배치되는 스토퍼를 더 포함하여, 상기 스토퍼에 상기 돌기접촉부가 선택적으로 걸림으로써 상기 커버의 개방 각도가 조절되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,공개특허 10-2016-0128055-2-상기 스토퍼는 상기 돌기 접촉부의 회동 범위내에서 일정 간격으로 형성되는 복수의 걸림 돌기를 포함하여,상기 복수의 걸림 돌기 중 어느 하나에 걸림으로써 상기 커버의 개방 각도가 조절되는 것을 특징으로 하는 전자장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 전자 장치는 휴대를 목적으로 케이스에 실장될 때, 상기 힌지부의 일측이 가압받음으로써, 상기 커버가 일정 각도로 개방되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 케이스에는 상기 전자 장치의 적어도 일부 영역을 수용하기 위한 장착부를 포함하고, 상기 장착부에는 상기 힌지부의 일측과 대응되는 위치에서 외측으로 돌출되는 가압 돌기를 더 포함하여,상기 전자 장치가 상기 장착부에 장착될 때, 상기 가압 돌기가 상기 힌지부의 일측을 가압하는 것을 특징으로하는 전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 장착부의 일측에는 상기 가압 돌기에 의해 개방되는 커버를 수용하기 위한 커버 수용 공간이 더 형성되는것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 전자 장치는 휴대용 보청기인 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "케이스에 있어서,전자 장치의 적어도 일부 영역을 수용하기 위한 장착부; 및상기 장착부에서 외측으로 돌출 형성되어, 장착되는 전자 장치의 커버 중 일부 영역을 가압하여 상기 커버를 상기 전자 장치에서 개방시키는 가압 돌기를 포함하여,상기 가압 돌기에 의해 상기 전자 장치의 커버가 개방될 경우, 상기 전자 장치의 전원이 차단되는 것을 특징으로 하는 케이스."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 커버는,공개특허 10-2016-0128055-3-상기 바디에서 힌지축을 중심으로 회전 가능하게 설치되는 힌지부;상기 힌지부의 일측으로 연장 형성되어 전자 장치 내부에 수용되는 배터리를 지지하는 배터리 수용부; 및상기 힌지부의 타측으로 연장 형성되어 외부의 가압에 의해 상기 힌지부를 중심으로 상기 배터리 수용부를 개방시키는 돌기 접촉부를 포함하되,상기 가압 돌기가 상기 돌기 접촉부를 가압하여 상기 힌지부를 회전축으로 상기 배터리 수용부를 전자 장치에서개방시키는 것을 특징으로 하는 케이스."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 커버는 상기 전자 장치의 배터리를 수용하며, 상기 커버의 개방에 따라 함께 유동되는 것을 특징으로 하는케이스."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 장착부의 일측에는 상기 가압 돌기에 의해 개방되는 상기 전자 장치의 커버를 수용하기 위한 커버 수용 공간이 더 형성되는 것을 특징으로 하는 케이스."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 전자 장치는 휴대용 보청기이며, 상기 케이스는 상기 보청기를 수용하기 위한 휴대용 케이스인 것을 특징으로 하는 케이스."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "케이스에 전자 장치를 장착하기 위한 장착 구조에 있어서,상기 전자 장치는,바디; 및바디에서 힌지부를 중심으로 회전하여 일정 각도로 개폐 가능하도록 설치되는 커버를 포함하고, 상기 케이스는,전자 장치의 적어도 일부 영역을 수용하기 위한 장착부; 및상기 장착부에서 외측으로 돌출 형성되어, 장착되는 전자 장치의 커버 중 일부 영역을 가압하여 상기 커버를 상기 전자 장치에서 개방시키는 가압 돌기를 포함하여,상기 전자 장치가 상기 장착부에 장착될 경우, 상기 가압 돌기에 의해 상기 힌지부의 일측이 가압받으면, 상기커버가 일정 각도로 개방됨으로써 상기 전자 장치의 전원이 차단되는 것을 특징으로 하는 전자 장치의 장착 구조."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,공개특허 10-2016-0128055-4-상기 커버는,상기 바디에서 힌지축을 중심으로 회전 가능하게 설치되는 힌지부;상기 힌지부의 일측으로 연장 형성되어 전자 장치 내부에 수용되는 배터리를 지지하는 배터리 수용부; 및상기 힌지부의 타측으로 연장 형성되어 외부의 가압에 의해 상기 힌지부를 중심으로 상기 배터리 수용부를 개방시키는 돌기 접촉부를 포함하되,상기 가압 돌기가 상기 돌기 접촉부를 가압하여 상기 힌지부를 회전축으로 상기 배터리 수용부를 전자 장치에서개방시키는 것을 특징으로 하는 전자 장치의 장착 구조."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 커버는 상기 전자 장치의 배터리를 수용하며, 상기 커버의 개방에 따라 함께 유동되는 것을 특징으로 하는전자 장치의 장착 구조."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서,상기 장착부의 일측에는 상기 가압 돌기에 의해 개방되는 상기 전자 장치의 커버를 수용하기 위한 커버 수용 공간이 더 형성되는 것을 특징으로 하는 전자 장치의 장착 구조."}
{"patent_id": "10-2015-0059796", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서,상기 전자 장치는 휴대용 보청기이며, 상기 케이스는 상기 보청기를 수용하기 위한 휴대용 케이스인 것을 특징으로 하는 전자 장치의 장착 구조."}
{"patent_id": "10-2015-0059796", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따르면, 바디 및 바디에서 힌지부를 중심으로 회전하여 일정 각도로 개폐 가능하도록 설치되는 커버를 포함하는 전자 장치와, 전자 장치의 적어도 일부 영역을 수용하기 위한 장착부 및 상기 장착부에서 외측 으로 돌출 형성되어, 장착되는 전자 장치의 커버 중 일부 영역을 가압하여 상기 커버를 상기 전자 장치에서 개방 시키는 가압 돌기를 포함하는 케이스로 구성되어, 상기 전자 장치가 상기 장착부에 장착될 경우, 상기 가압 돌기 에 의해 상기 힌지부의 일측이 가압받으면, 상기 커버가 일정 각도로 개방됨으로써 상기 전자 장치의 전원이 차 단될 수 있는 전자 장치, 케이스 및 전자 장치의 케이스 장착 구조를 제공할 수 있다."}
{"patent_id": "10-2015-0059796", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 전원 차단을 위한 전자 장치 장착 구조 및 그것을 포함하는 케이스 및 전자 장치 에 관한 것이다."}
{"patent_id": "10-2015-0059796", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 이동통신 기술의 발달에 따라 음성 통화는 물론 다양한 서비스를 제공하는 휴대용 전자 장치는 현대인의 필수품이 되었다. 이러한 전자 장치는 그 활용범위가 넓고 휴대의 편의성 때문에 많은 사용자가 이용할 수 있게 되었다. 이러한 휴대용 전자 장치들 중 어떤 휴대 장치들은 사용하지 않을 경우, 별도의 케이스에 보관하여 휴대할 필요 가 있으며, 이러한 경우 전자 장치의 전원을 차단시켜 휴대하여야 한다. 그러나, 전원 차단 장치가 전자 장치에 구비될 경우, 전자 장치에 별도의 실장 공간이 마련되어야 하는 바, 전 자 장치의 슬림화에 역행할 수 있으며, 케이스에 보관시 마다 전원 차단 장치를 조작하여야 하기 때문에 번거로 운 문제점이 발생할 수 있다. 또한, 전원 차단 장치를 구비하지 않은 경우 역시, 케이스에 보관시 마다 내부 전"}
{"patent_id": "10-2015-0059796", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "원(예: 배터리)을 전자 장치의 본체에서 분리해야하는 문제점이 발생하게 된다.발명의 내용"}
{"patent_id": "10-2015-0059796", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일반적으로 청각 장애인들은 음성을 송수신 하기 위한 전자 장치(예: 스마트 폰 등)를 사용할 경우 여러 어려움 이 따른다. 따라서, 청각 장애인들은 상술한 전자 장치와 연계되는 소형 전자 장치(예: 보청기)를 귀에 착용한 상태에서 전자 장치를 이용한다. 한 실시예에 따르면, 보청기의 기본 구조는 마이크로폰과 증폭부(앰프) 그리고 수화기(리시버)로 이루어져 있으며, 마이크로폰은 아날로그 신호를 디지털 신호로 변환시켜 증폭부로 보내고 증 폭부는 증폭된 소리를 다시 아날로그 신호로 바꾸어 수화기로 전달하여 청각이 좋지않은 사람에게 음성 신호를 제공할 수 있다. 또한, 보청기에 텔레 코일(Tele-Coil, T-coil)을 구비하여 전자 장치에서 발생하는 전자기파를 감지하여 음성 신호로 제공할 수도 있다. 보청기를 사용하지 않을 경우에는, 그 크기가 작기 때문에 별도의 케이스에 보관하여야 하며, 케이스에 보관할 경우, 전원을 차단시켜 케이스 내부에서의 공명 현상을 미연에 방지하고 불필요한 전원 소모를 방지할 수 있다. 그러나, 전원을 차단시키기 위한 전원 차단 장치가 전자 장치에 구비되기 때문에 보청기의 소형화에 기여할 수 없으며, 케이스에 보관시마다 전원 차단 장치를 조작하여야 하는 바, 번거로운 문제점이 발생할 수 있다. 또한, 전원 차단 장치가 없을 경우에도, 보청기 내부의 배터리를 분리하여 케이스에 실장하기 때문에 이 또한 번거로 운 문제점이 될 수 있다. 상술한 문제점을 해결하기 위하여 안출된 것으로서, 본 발명의 다양한 실시예들은 전원 차단을 위한 전자 장치 장착 구조 및 그것을 포함하는 케이스 및 전자 장치를 제공할 수 있다. 다양한 실시예에 따르면, 별도의 전원 차단 장치를 구비하지 않아 제품의 소형화에 기여할 수 있도록 구현되는 전원 차단을 위한 전자 장치 장착 구조 및 그것을 포함하는 케이스 및 전자 장치를 제공할 수 있다. 다양한 실시예에 따르면, 케이스에 장착시키는 동작만으로 전원을 차단시키도록 구성하여 조작 편의성을 향상시 킨 전원 차단을 위한 전자 장치 장착 구조 및 그것을 포함하는 케이스 및 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2015-0059796", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따르면, 바디 및 바디에서 힌지부를 중심으로 회전하여 일정 각도로 개폐 가능하도록 설치되는 커버를 포함하되, 상기 힌지부의 일측이 가압받으면, 상기 커버가 일정 각도로 개방됨으로써 상기 전자 장치의 전원이 차단되는 것을 특징으로 하는 전자 장치를 제공할 수 있다. 다양한 실시예에 따르면, 전자 장치의 적어도 일부 영역을 수용하기 위한 장착부 및 상기 장착부에서 외측으로 돌출 형성되어, 장착되는 전자 장치의 커버 중 일부 영역을 가압하여 상기 커버를 상기 전자 장치에서 개방시키 는 가압 돌기를 포함하여, 상기 가압 돌기에 의해 상기 전자 장치의 커버가 개방될 경우, 상기 전자 장치의 전 원이 차단되는 것을 특징으로 하는 케이스를 제공할 수 있다. 다양한 실시예에 따르면, 바디 및 바디에서 힌지부를 중심으로 회전하여 일정 각도로 개폐 가능하도록 설치되는 커버를 포함하는 전자 장치와, 전자 장치의 적어도 일부 영역을 수용하기 위한 장착부 및 상기 장착부에서 외측으로 돌출 형성되어, 장착되는 전자 장치의 커버 중 일부 영역을 가압하여 상기 커버를 상기 전자 장치에서 개방시키는 가압 돌기를 포함하는 케이스로 구성되어, 상기 전자 장치가 상기 장착부에 장착될 경우, 상기 가압 돌기에 의해 상기 힌지부의 일측 이 가압받으면, 상기 커버가 일정 각도로 개방됨으로써 상기 전자 장치의 전원이 차단되는 것을 특징으로 하는 전자 장치의 장착 구조를 제공할 수도 있다."}
{"patent_id": "10-2015-0059796", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예들에 따른 전자 장치는 전원 차단 장치를 전자 장치에 구비하지 않기 때문에 제품의 소형화에 기 여할 수 있으며, 케이스에 전자 장치를 보관하기 위하여 실장하는 동작만으로 전원이 차단되기 때문에 조작 편 의성이 향상될 수 있다."}
{"patent_id": "10-2015-0059796", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시예는 다양한 변경 을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있다. 그러나, 이는 본 발명의 다양한 실시예를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 다양한 실시예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성 요소에 대해서는 유사한 참조 부호가 사용되었 다. 본 발명의 다양한 실시예에서 사용될 수 있는 \"포함한다\" 또는 \"포함할 수 있다\"등의 표현은 개시(disclosure) 된 해당 기능, 동작 또는 구성 요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성 요소 등을 제한하지 않는다. 또한, 본 발명의 다양한 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상 에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하 나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시예에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시예에서 사용된 \"제1,\" \"제2\", \"첫 째\", \"둘 째\" 등의 표현들은 다양한 실시예들의 다양한 구성 요소들을 수식할 수 있지만, 해당 구성 요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성 요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성 요소를 다른 구성 요소와 구분하 기 위해 사용될 수 있다. 예를 들어, 제1사용자 기기와 제2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1구성 요소 는 제2구성 요소로 명명될 수 있고, 유사하게 제2구성 요소도 제1구성 요소로 명명될 수 있다. 어떤 구성 요소가 다른 구성 요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요 소가 상기 다른 구성 요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성 요 소와 상기 다른 구성 요소 사이에 새로운 다른 구성 요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성 요소와 상기 다른 구성 요소 사이에 새로운 다른 구성 요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명의 다 양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표 현을 포함할 수 있다.다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의 미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시예에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시예에 따른 전자 장치(예: 보청기와 같은 소형 전자 장치 또는 보청기와 기능적으로 연결 되어 통신(데이터 통신 포함) 등을 수행하는 또 다른 전자 장치)는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동전화기(mobile phone), 화상전화기, 전자북리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일의료기기, 카메라(camera), 또는 웨어러블장치(wearable device)(예: 전자 안경과 같은 head-mounted-device(HMD), 전자의복, 전자팔찌, 전자목걸이, 전자앱세서리 (appcessory), 전자문신, 또는 스마트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용전자장비(예: 선박용항법장치 및 자이로콤파스 등), 항공전자기기 (avionics), 보안기기, 차량용헤드유닛, 산업용 또는 가정용 로봇, 금융기관의 ATM(automatic teller's machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 싸인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발 명의 다양한 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 다양한 실시예에 따른 전자 장치는 플렉서블(flexible) 장치일 수 있다. 또한, 본 발명의 다양한 실 시예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1a는 본 발명의 다양한 실시예에 따른 케이스 200과 전자 장치 100의 분리사시도이다. 도 1b는 본 발명의 다 양한 실시예에 따른 케이스 200에 전자 장치 100이 장착된 상태를 도시한 사시도이다. 도 1a를 참고하면, 전자 장치 100은 청각 장애인을 위한 소형 전자 장치로써 보청기일 수 있다. 한 실시예에 따 르면, 보청기는 사용하지 않을 경우 케이스에 장착되어 휴대될 수 있다. 다양한 실시예에 따르면, 케이스 200은 외부 케이스 220과 외부 케이스 220에서 슬라이딩 방식으로 착탈 가능하 게 도시된 화살표 방향으로 동작하는 내부 케이스 210을 포함할 수 있다. 한 실시예에 따르면, 내부 케이스 210 은 외부 케이스 220에서 완전히 이탈되거나 일정 개방량만큼 개방된 후 완전히 이탈이 방지되도록 단속 받을 수 있다. 한 실시예에 따르면, 내부 케이스 210은 외부 케이스 220에서 완전히 개방되었을 때, 전자 장치 100을 수 납할 수 있는 상태가 되며, 외부 케이스 220에 완전히 잠입된 상태에서는 외부 케이스 220의 크기가 되어 편리 하게 휴대할 수 있다. 다양한 실시예에 따르면, 내부 케이스 210에는 바디 장착부 211이 외부에 노출되도록 배치될 수 있다. 한 실시 예에 따르면, 내부 케이스 210의 바디 장착부 211은 전자 장치 100의 적어도 일부 영역을 타이트하게 수납할 수 있는 구조로 형성될 수 있다.다양한 실시예에 따르면, 전자 장치 100은 바디 110과, 바디에서 인출되어 단부에 이어 피스로써 마이크로폰을 포함하는 케이블 130을 포함할 수 있다. 한 실시예에 따르면, 바디 110에는 일정 각도로 개방 가능한 배터리 커 버 120을 포함할 수 있다. 한 실시예에 따르면, 배터리 커버 120은 바디 110과 완전히 분리되지 않은 상태에서 다양한 각도로 개방될 수 있다. 한 실시예에 따르면, 배터리 커버 120은 배터리(예: 코인형 배터리)를 수용할 수 있으며, 배터리 커버 120이 바디 110에서 개방되면 전자 장치 100의 전원이 차단되는 방식으로 설치될 수 있 다. 다양한 실시예에 따르면, 배터리 커버 120은 전자 장치 100을 케이스 200의 바디 장착부 211에 장착하는 동작만 으로 일정 각도로 개방될 수 있다. 한 실시예에 따르면, 배터리 커버 120은 전자 장치 100을 케이스 200의 바디 장착부 211에 장착하는 동작만으로 일정 각도로 개방되어 자동으로 전원이 차단될 수 있다. 그러나 이에 국한되 지 않으며, 배터리 커버 120은 케이스 120에 장착되지 않더라도, 사용자에 의해 다양한 각도로 개방되어 전원이 차단될 수 있다. 한 실시예에 따르면, 전자 장치 100의 배터리 커버 120은 일정 각도로 개방된 상태에서 전자 장치 100의 배터리를 교환할 수 있는 상태를 유도할 수도 있다. 다양한 실시예에 따르면, 전자 장치 100은 내부 케이스 210의 바디 장착부 211에 장착하는 동작만으로 배터리 커버 120이 일정 각도로 개방되며, 이로 인하여 배터리 역시 전자 장치 100과 분리되어 전원이 자동으로 차단될 수 있다. 즉, 사용자는 전자 장치 100의 전원을 분리시키기 위한 별도의 조작을 수행하지 않아도 되므로 사용 편의성이 향상될 수 있다. 도 2a는 본 발명의 다양한 실시예에 따른 전자 장치 100이 케이스 200에 장착되기 전의 상태를 도시한 구성도이 다. 도 2a를 참고하면, 전자 장치 100은 바디 110과 바디 110의 후면에서 개방 가능하게 설치되는 배터리 커버 120 을 포함할 수 있다. 한 실시예에 따르면, 배터리 커버 120은 배터리(도 2c의 140)를 포함할 수 있다. 한 실시예 에 따르면, 배터리는 배터리 커버 120이 개방될 때 함께 전자 장치 100의 외부로 적어도 일부가 노출되는 방식 으로 설치될 수 있다. 한 실시예에 따르면, 배터리 커버 120은 바디 110에서 회전 가능하게 설치될 수 있다. 한 실시예에 따르면, 배 터리 커버 120은 바디 110과 힌지 결합되어 회동가능하게 설치되는 힌지부 122와 힌지부 122의 일측에 연장 형 성되는 배터리 수용부 121 및 힌지부 121의 타측에 연장 형성되는 돌기 접촉부 123을 포함할 수 있다. 한 실시 예에 따르면, 돌기 접촉부 123을 바디 방향으로 가압하면, 배터리 수용부 121은 힌지부 122를 중심으로 외측으 로 회전하여 개방될 수 있다. 한 실시예에 따르면, 배터리 커버 120은 배터리 140으로써 코인형 배터리를 수용 할 경우, 코인형 배터리의 양 측면의 적어도 일부 영역을 고정시킬 수 있는 고정부를 더 포함할 수도 있다. 도 2b는 본 발명의 다양한 실시예에 따른 전자 장치 100이 안착되기 위한 바디 장착부 211을 포함하는 내부 케 이스 210의 요부 사시도이다. 도 2a 및 도 2b를 참고하면, 내부 케이스 210은 전자 장치 100의 바디 110을 수용할 수 있는 바디 장착부 211을 포함할 수 있다. 한 실시예에 따르면, 바디 장착부 211은 전자 장치 100의 양 측면의 적어도 일부 영역을 타이 트하게 지지할 수 있는 구조로 형성될 수 있다. 한 실시예에 따르면, 바디 장착부 211의 근처에는 전자 장치 100이 바디 장착부 211에 장착되었을 경우, 개방되는 배터리 커버 120을 수용하기 위한 커버 수용 공간 212를 더 포함할 수 있다. 한 실시예에 따르면, 커버 수용 공간 212는 전자 장치 100이 바디 장착부 211에 장착되었을 때 하측으로 개방되는 배터리 커버 120을 수용할 수 있는 충분한 공간으로 형성될 수 있다. 다양한 실시예에 따르면, 바디 장착부 211에는 상방향으로 일정 길이 만큼 돌출된 가압 돌기 2111을 포함할 수 있다. 한 실시예에 따르면, 가압 돌기 2111은 상기 전자 장치 100이 장착되었을 때, 상기 전자 장치 100의 배터 리 커버 120의 돌기 접촉부 123과 대응하는 위치에 배치될 수 있다. 한 실시예에 따르면, 가압 돌기 2111은 내 부 케이스 210을 사출시 함께 형성되거나, 별도로 내부 케이스 210의 바디 장착부 211에 설치될 수도 있다. 도 2c는 본 발명의 다양한 실시예에 따른 전자 장치 100이 내부 케이스 210에 장착된 상태를 도시한 구성도이다.도 2c를 참고하면, 전자 장치가 내부 케이스의 바디 장착부에 장착될 경우, 배터리 커버의 돌기 접촉부는 바디 장착부에서 돌출 형성된 접촉 돌기에 접촉될 수 있다. 한 실시예에 따르면, 전자 장치를 하측으로 지속적으로 가압할 경우, 배터리 커버의 돌기 접촉부는 바디 장착부의 가압 돌기에 의해 전자 장치의 내부 방향으로 밀리게 되며, 이때, 배터리 커버의 배터리 수용부는 힌지부를 중심으로 회전하여 전자 장치의 외측으로 일정 각도 θ만 큼 개방될 수 있다. 한 실시예에 따르면, 개방된 배터리 커버의 배터리 수용부는 내부 케이스의 바디 장착부 근 처에 형성된 커버 수용 공간에 수용될 수 있다. 다양한 실시예에 따르면, 상기 배터리 커버의 개방 각도는 θ는 특정 각도 없이 커버 수용 공간이 수용하는 공 간 만큼 개방될 수 있다. 한 실시예에 따르면, 개방 각도 θ는 배터리 수용 공간이 수용하는 범위내에서 기 설 정된 특정 개방 각도만큼 개방될 수도 있다. 한 실시예에 따르면, 배터리 커버의 개방 각도 θ는 20도, 35도, 50도, 65도 중 적어도 하나의 각도로 개방될 수 있다. 그러나 이에 국한되지 않으며, 설정된 다양한 개방 각도 로 개방될 수 있다. 도 3은 본 발명의 다양한 실시예에 따른 배터리 커버 고정 구조를 도시한 전자 장치의 요부 사시도이다. 다양한 실시예에 따르면, 배터리 커버 120은 개방된 상태에서 전자 장치 100을 다시 사용할 경우(예를 들어, 전 자 장치를 내부 케이스에서 분리시킬 경우), 사용자에 의해 배터리 커버 120을 다시 전자 장치에 초기 상태로 폐쇄시킬 수 있다. 한 실시예에 따르면, 이러한 경우, 배터리 커버 120은 전자 장치 100에 폐쇄된 상태에서 그 상태를 지속적으로 유지시킬 수 있는 장착 구조를 가질 수 있다. 한 실시예에 따르면, 전자 장치 100의 배터리 커버 120이 회동하는 바디 110의 내측에는 적어도 하나의 고정 돌기 1101이 돌출 형성될 수 있으며, 배터리 커 버 120에는 상기 고정 돌기 1101이 삽입될 수 있는 고정홈 1211이 형성될 수 있다. 한 실시예에 따르면, 배터리 커버 120은 전자 장치 100에 장착될 경우 고정홈 1211에 바디 110의 고정 돌기 1101이 타이트하게 결합됨으로써 그 위치가 유지될 수 있다. 그러나, 고정 돌기 1101이 고정홈 1211에 결합되는 유지력은 전자 장치 100이 바디 장착부 211에 장착될 때, 가압 돌기 2111이 배터리 커버 120의 돌기 접촉부 123을 가압하여 힌지부 122를 중심 으로 개방되려는 힘보다 약하 힘으로 설정될 수 있다. 따라서, 배터리 커버 120은 전자 장치 100이 내부 케이스 210의 바디 장착부 211에 장착될 경우 배터리 커버 120이 힌지부 122를 중심으로 개방될 수 있으며, 전자 장치 100을 사용할 때, 배터리 커버 120이 전자 장치 100 에서 폐쇄된 경우에는 자중에 의해 외부로 개방되지는 않는다. 다양한 실시예에 따르면, 상술한 고정홈 1211 및 고정 돌기 1101의 결합 구조를 배제시키고, 배터리 커버 120을 항상 전자 장치 100에 닫히게 하는 탄성 부재를 적용할 수 있다. 예를 들어, 힌지부 122의 힌지축을 중심으로 토션 스프링을 설치하여, 배터리 커버 120은 내부 케이스 210에서 분리시키는 동작만으로 배터리 커버 120이 토 션 스프링의 탄성력에 의해 자동으로 전자 장치로 닫히게 할 수도 있을 것이다. 도 4는 본 발명의 다양한 실시예에 따르면, 배터리 커버 420의 개방 각도 조절을 위한 스토퍼 430을 포함하는 전자 장치 400의 구성도이다. 도 4를 참고하면, 전자 장치 400은 바디 410과 바디 410의 후면에서 개방 가능하게 설치되는 배터리 커버 420을 포함할 수 있다. 한 실시예에 따르면, 배터리 커버 420은 배터리 440을 포함할 수 있다. 한 실시예에 따르면, 배터리 440은 배터리 커버 420이 개방될 때, 함께 전자 장치 100의 외부로 적어도 일부가 노출되는 방식으로 설 치될 수 있다. 한 실시예에 따르면, 배터리 커버 420은 바디 410에서 회전 가능하게 설치될 수 있다. 한 실시예에 따르면, 배 터리 커버 420은 바디 410과 힌지 결합되어 회동가능하게 설치되는 힌지부 422와 힌지부 422의 일측에 연장 형 성되는 배터리 수용부 421 및 힌지부 422의 타측에 연장 형성되는 돌기 접촉부 423을 포함할 수 있다. 다양한 실시예에 따르면, 상술한 구성과 같이, 내부 케이스 210의 바디 장착부 211에 전자 장치 400을 장착할 경우, 가압 돌기 2111이 돌기 접촉부 423을 바디 방향으로 가압하면, 배터리 수용부 421은 힌지부 422를 중심으 로 외측으로 회전하여 개방될 수 있다. 한 실시예에 따르면, 배터리 커버 420은 배터리 440으로써 코인형 배터 리를 수용할 경우, 코인형 배터리의 양 측면의 적어도 일부 영역을 고정시킬 수 있는 고정부를 더 포함할 수도 있다. 다양한 실시예에 따르면, 전자 장치 400은 케이스에 장착하는 동작이 아니더라도, 예를 들어 배터리 440을 교환 시키거나 전자 장치 400의 전원을 임의로 차단할 목적으로 배터리 커버 420을 개방시킬 수도 있다. 한 실시예에 따르면, 돌기 접촉부 423의 회동 범위내에는 스토퍼 430이 설치될 수 있다. 한 실시예에 따르면 스토퍼 430에는 일정 간격으로 복수의 걸림 돌기들 431, 432, 433, 434가 형성될 수 있다. 한 실시예에 따르면 배터리 커버 420 은 돌기 접촉부 423이 복수의 걸림 돌기 431, 432, 433, 434 마다 걸리는 위치에 따라 다양한 각도로 개방되며, 개방된 각도를 유지하도록 구성될 수 있다. 도 5a 내지 도 5d는 본 발명의 다양한 실시예에 따라 도 4의 스토퍼 430에 의해 다양한 각도로 개방되는 배터리 커버 420의 작동도이다. 도 5a는 돌기 접촉부 423이 제1걸림 돌기 431에 걸림으로써 배터리 커버 420이 20도의 각도로 개방된 상태를 도 시하고 있다. 도 5b는 돌기 접촉부 423이 제2걸림 돌기 432에 걸림으로써 배터리 커버 420이 35도의 각도로 개방된 상태를 도 시하고 있다. 한 실시예에 따르면, 이러한 경우, 배터리 커버 420의 돌기 접촉부 423은 제1걸림 돌기 431을 타 고 넘어 제2걸림 돌기 432에 걸리는 구성으로써, 돌기 접촉부 423은 제1걸림 돌기 431과 제2걸림 돌기 432 사이 에서 그 위치(배터리 커버의 35도의 개방 각도)가 유지될 수 있다. 도 5c는 돌기 접촉부 423이 제3걸림 돌기 433에 걸림으로써 배터리 커버 420이 50도의 각도로 개방된 상태를 도 시하고 있다. 한 실시예에 따르면, 이러한 경우, 배터리 커버 420의 돌기 접촉부 423은 제2걸림 돌기 432를 타 고 넘어 제3걸림 돌기 433에 걸리는 구성으로써, 돌기 접촉부 423은 제2걸림 돌기 432와 제3걸림 돌기 433 사이 에서 그 위치(배터리 커버의 50도의 개방 각도)가 유지될 수 있다. 도 5d는 돌기 접촉부 423이 제4걸림 돌기 434에 걸림으로써 배터리 커버 420이 65도의 각도로 개방된 상태를 도 시하고 있다. 한 실시예에 따르면, 이러한 경우, 배터리 커버 420의 돌기 접촉부 423은 제3걸림 돌기 433을 타 고 넘어 제4걸림 돌기 434에 걸리는 구성으로써, 돌기 접촉부 423은 제3걸림 돌기 433과 제4걸림 돌기 434 사이 에서 그 위치(배터리 커버의 65도의 개방 각도)가 유지될 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 실시예에 따른 기술 내용을 쉽게 설명하고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 개시된 실시예들 이외에도 본 발명의 다 양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범 위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0059796", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명의 다양한 실시예에 따른 케이스와 전자 장치의 분리사시도이다. 도 1b는 본 발명의 다양한 실시예에 따른 케이스에 전자 장치가 장착된 상태를 도시한 사시도이다. 도 2a는 본 발명의 다양한 실시예에 따른 전자 장치가 케이스에 장착되기 전의 상태를 도시한 구성도이다. 도 2b는 본 발명의 다양한 실시예에 따른 전자 장치가 안착되기 위한 바디 장착부를 포함하는 내부 케이스의 요 부 사시도이다. 도 2c는 본 발명의 다양한 실시예에 따른 전자 장치가 내부 케이스에 장착된 상태를 도시한 구성도이다. 도 3은 본 발명의 다양한 실시예에 따른 배터리 커버 고정 구조를 도시한 전자 장치의 요부 사시도이다. 도 4는 본 발명의 다양한 실시예에 따르면, 배터리 커버의 개방 각도 조절을 위한 스토퍼를 포함하는 전자 장치 의 구성도이다. 도 5a 내지 도 5d는 본 발명의 다양한 실시예에 따라 도 4의 스토퍼에 의해 다양한 각도로 개방되는 배터리 커 버의 작동도이다."}
