{"patent_id": "10-2015-0111149", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0017351", "출원번호": "10-2015-0111149", "발명의 명칭": "전자 장치에서 전원을 관리하는 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "오지수"}}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치의 동작 방법에 있어서,수신 신호 세기와 상기 전자 장치의 상태 중 적어도 하나를 기반으로 비콘 주기와 DTIM((Delivery TrafficIndication Map) 주기 중 적어도 하나를 결정하는 과정과,상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 기반으로 상기 웨이크업 주기를 결정하는 과정과,상기 웨이크업 주기에 따라 무선 통신 모듈을 제어하는 과정을 포함하는 방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 전자 장치의 상태는, 상기 전자 장치의 이동 속도, 실행 중인 어플리케이션의 종류, 상기 전자 장치의 액티브/슬립 모드, 알림에 대한 상기 전자 장치의 상태 변화, 어플리케이션 네트워크 사용 정보 중 적어도 하나를포함하는 방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정은, 실행 중인 어플리케이션의 종류와 상기수신 신호 세기 중 적어도 하나를 기반으로 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정을 포함하는 방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정은, 상기 전자 장치의 액티브 모드에서 상기 실행 중인 어플리케이션의 종류가 컨텐츠에 대한 스트리밍 어플리케이션인 경우, 상기 컨텐츠의 평균 비트율과 현재 수신 속도를 비교하는 과정과,상기 비교 결과를 기반으로 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정을 포함하는방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정은, 수신된 패킷의 알림에 대한 상기 전자 장치의 상태 변화와 상기 전자 장치의 이동 속도와 상기 수신 신호 세기 중 적어도 하나를 기반으로 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정을 포함하는 방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정은, 공개특허 10-2017-0017351-3-상기 전자 장치의 액티브 모드에서 상기 수신된 패킷의 알림을 출력하는 과정과,상기 알림에 대한 사용자의 입력을 검출하는 과정과,상기 사용자의 입력을 기반으로 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정을 포함하는방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 계산하는 과정은, 상기 수신 신호 세기와 상기 전자 장치의이동 속도 중 적어도 하나를 기반으로 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정을 포함하는 방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정은, 상기 수신 신호 세기가 미리 지정된 제1기준값을 초과하며, 상기 전자 장치의 이동 속도가 미리 지정된 제2기준값 이하인 경우, 상기 전자 장치의 슬립모드에서 웨이크업 횟수를 나타내는 비콘 카운트를 기반으로 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 과정을 포함하는 방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 웨이크업 주기에 따라 상기 무선 통신 모듈을 제어하는 과정은, 상기 웨이크업 주기에 따라 상기 무선 통신 모듈의 전원 절약 모드를 실행하는 과정을 포함하는 방법."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치에 있어서,무선 통신 모듈과,수신 신호 세기와 상기 전자 장치의 상태 중 적어도 하나를 기반으로 비콘 주기와 DTIM(Delivery TrafficIndication Map) 주기 중 적어도 하나를 결정하며, 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 기반으로 상기 웨이크업 주기를 결정하고, 상기 웨이크업 주기에 따라 상기 무선 통신 모듈을 제어하는 제1프로세서를포함하는 전자 장치."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 전자 장치의 상태는, 상기 전자 장치의 이동 속도, 실행 중인 어플리케이션의 종류, 상기 전자 장치의 액티브/슬립 모드, 알림에 대한 상기 전자 장치의 상태 변화, 어플리케이션 네트워크 사용 정보 중 적어도 하나를포함하는 전자 장치."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2017-0017351-4-제10항에 있어서,상기 제1프로세서는, 실행 중인 어플리케이션의 종류와 상기 수신 신호 세기 중 적어도 하나를 기반으로 상기비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 전자 장치."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제1프로세서는, 상기 실행 중인 어플리케이션의 종류가 컨텐츠에 대한 스트리밍 어플리케이션인 경우, 상기 컨텐츠의 평균 비트율과 현재 수신 속도를 비교하고, 상기 비교 결과를 기반으로 상기 비콘 주기와 상기DTIM 주기 중 적어도 하나를 결정하는 전자 장치."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,상기 제1프로세서는, 수신된 패킷의 알림에 대한 상기 전자 장치의 상태 변화와 상기 전자 장치의 이동 속도와상기 수신 신호 세기 중 적어도 하나를 기반으로 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는전자 장치."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 전자 장치의 액티브 모드에서 상기 수신된 패킷의 알림을 출력하며, 상기 알림에 대한 사용자의 입력을 검출하고, 상기 사용자의 입력을 기반으로 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 전자 장치."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서,상기 제1프로세서의 슬립 모드에서 상기 전자 장치의 상태를 확인하며, 상기 전자 장치의 상태를 기반으로 상기비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하며, 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를기반으로 웨이크업 주기를 결정하고, 상기 웨이크업 주기에 따라 상기 무선 통신 모듈을 제어하는 제2프로세서를 포함하는 전자 장치."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제2프로세서는, 상기 수신 신호 세기와 상기 전자 장치의 이동 속도 중 적어도 하나를 기반으로 상기 비콘주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 전자 장치."}
{"patent_id": "10-2015-0111149", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제2프로세서는, 상기 수신 신호 세기가 미리 지정된 제1기준값을 초과하며, 상기 전자 장치의 이동 속도가미리 지정된 제2기준값 이하인 경우, 상기 슬립 모드에서 웨이크업 횟수를 나타내는 비콘 카운트를 기반으로 상공개특허 10-2017-0017351-5-기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 결정하는 전자 장치."}
{"patent_id": "10-2015-0111149", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전자 장치에서 전원을 관리하는 장치 및 방법에 관한 것이다. 본 발명은, 수신 신호 세기와 상기 전자 장치의 상태 중 적어도 하나를 기반으로 비콘 주기와 DTIM((Delivery Traffic Indication Map) 주기 중 적어도 하나를 결정하며, 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 기반으로 상기 웨이크업 주기를 결정하고, 상기 웨이크업 주기에 따라 무선 통신 모듈을 제어할 수 있다."}
{"patent_id": "10-2015-0111149", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전자 장치에서 전원을 관리하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2015-0111149", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 무선 네트워크 접속을 가능하게 하는 무선랜 기능을 구비한 전자 장치가 개발되고 있다. 스마트폰과 같은 전자 장치는 무선랜 모듈을 이용하여 전자 장치와 무선 네트워크 사이에서 브리지 및 라우터로서 동작하는 AP(Access Point)를 통해 무선 네트워크에 접속한다. 무선랜 모듈을 이용한 통신은 통신 속도가 다른 근거리 무 선 통신 기술보다 뛰어나지만, 무선랜 모듈의 전원을 항상 온 상태로 유지한다면, 전자 장치의 전력 소모가 빠 르다. 이러한 전력 소모를 줄이기 위해, 전원 절약 메카니즘(PSM: Power Save Mechanism)이 제안되고 있다. 예를 들어, 전원 절약 메커니즘을 따르는 전자 장치는 비콘 구간 동안에 어웨이크 상태(Awake status)와 도즈 상태 (doze status 혹은 sleep status)의 전환을 반복함으로써 무선랜 모듈의 전력 소모를 줄일 수 있다. 그러나 전자 장치는 전자 장치의 상태에 관계없이 무선랜 모듈에 전원 절약 메커니즘을 수행함으로써 불필요한 전력이 소비될 수 있다."}
{"patent_id": "10-2015-0111149", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 실시 예들은 전자 장치의 상태를 기반으로 전원 절약 메커니즘을 수행하는 장치 및 방법을 제공하기 위한 것이다. 또한, 본 발명의 실시 예들은 전자 장치의 상태를 기반으로 전원 절약 메커니즘을 수행하기 위한 웨이크업 주기 를 결정하는 장치 및 방법을 제공하기 위한 것이다. 또한, 본 발명의 실시 예들은 전자 장치의 주 프로세서가 슬림 모드에 진입해 있더라도 보조 프로세서를 이용하 여 웨이크업 주기를 결정하는 장치 및 방법을 제공하기 위한 것이다."}
{"patent_id": "10-2015-0111149", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따른, 전자 장치의 동작 방법은, 수신 신호 세기와 상기 전자 장치의 상태 중 적어 도 하나를 기반으로 비콘 주기와 DTIM((Delivery Traffic Indication Map) 주기 중 적어도 하나를 결정하며, 상기 비콘 주기와 상기 DTIM 주기 중 적어도 하나를 기반으로 상기 웨이크업 주기를 결정하고, 상기 웨이크업 주기에 따라 무선 통신 모듈을 제어하는 과정을 포함할 수 있다. 본 발명의 다양한 실시 예에 따른, 전자 장치는, 무선 통신 모듈과, 수신 신호 세기와 상기 전자 장치의 상태 중 적어도 하나를 기반으로 비콘 주기와 DTIM 주기 중 적어도 하나를 결정하며, 상기 비콘 주기와 상기 DTIM 주 기 중 적어도 하나를 기반으로 상기 웨이크업 주기를 결정하고, 상기 웨이크업 주기에 따라 상기 무선 통신 모 듈을 제어하는 제1프로세서를 포함할 수 있다."}
{"patent_id": "10-2015-0111149", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예들은 전자 장치의 상태를 기반으로 전원 절약 메커니즘을 수행함으로써 전력 소모를 최소화할 수 있다. 또한, 본 발명의 실시 예들은 본 발명은 전자 장치의 상태를 기반으로 전원 절약 메커니즘을 수행하기 위한 웨 이크업 주기를 결정함으로써 전력 소모를 최소화할 수 있다. 또한, 본 발명의 실시 예들은 전자 장치의 주 프로세서가 슬림 모드에 진입해 있더라도 보조 프로세서를 이용하 여 웨이크업 주기를 결정함으로써 전력 소모를 최소화할 수 있다."}
{"patent_id": "10-2015-0111149", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나 이는 본 문서에 기재된 기술을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시 예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크 스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수있다. 다양한 실시 예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택 트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부 착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포 함할 수 있다. 어떤 실시 예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예들에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈 압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 다양한 실시 예에 따른 통신 시스템의 구성도이다. 도 1을 참조하면, 통신 시스템은 억세스 포인트(Access Point, AP) 110과 기지국(Base Station, BS) 120과 전 자 장치 100을 포함할 수 있다. 각 구성요소를 살펴보면, BS 120은 신호를 송/수신할 수 있는 셀 121을 가지며, 셀 121 내에 존재하는 전자 장 치(예: 전자 장치 100)로 신호를 전송하거나 전자 장치로부터 신호를 수신할 수 있다. 예를 들면, BS 120은 eNode B(eNB)라고 불릴 수 있다. 예를 들면, BS 120은 제3세대 통신 네트워크(3G) 도는 제4세대 통신 네트워크 (LTE)를 지원할 수 있다. AP 110은 신호를 송/수신할 수 있는 셀 111을 가지며, 셀 111 내에 존재하는 전자 장치(예: 전자 장치 100)로 신호를 전송하거나 전자 장치로부터 신호를 수신할 수 있다. 예를 들면, AP 110은 IEEE 802.11 계열 무선랜 프 로토콜을 지원할 수 있다. 다른 예로, AP 110은 미리 설정된 비콘 구간(Beacon Interval)에 따라 비콘 프레임 (Beacon Frame)을 주기적으로 방송할 수 있다. 예를 들면, 비콘 구간은 비콘 프레임이 전송되는 구간이 될 수 있다. 예를 들면, 도 2와 같이, 비콘 구간 201은 100ms가 될 수 있다. 예를 들면, 비콘 프레임은, AP 110에 의해 주기적으로 전송되는 패킷으로, AP 110의 SSID(Service Set Identifier) 정보와 TIM(Trafic Indication Map)와 DTIM(Delivery Traffic Indication Map) 등을 포함할 수 있 다. 예를 들면, SSID는 AP 110의 고유 식별자를 의미할 수 있다. 예를 들면, TIM은 AP 110으로부터 유니캐스트 (unicast) 통신 방식으로 데이터를 수신할 호스트 리스트(Host List)를 포함하는 패킷일 수 있다. 예를 들면, Host List는 전자 장치(예: 전자 장치 100)의 식별자(예: 맥 어드레스(MAC address)를 포함할 수 있다. 예를 들면, DTIM은 AP 110으로부터 멀티캐스트(multicast) 통신 방식으로 데이터를 수신할 호스트 그룹 리스트 (host group list)를 포함하는 패킷이며, AP 110가 브로드캐스팅(broadcasting)할 패킷이 존재함을 나타내는 패킷일 수 있다. DTIM은 넓은 의미로 TIM의 한 종류일 수 있다. 예를 들면, TIM에 포함된 DTIM 카운트(count)가 0일 경우, TIM 패킷은 DTIM 패킷이 될 수 있다. 예를 들면, AP 110은 DTIM 구간(DTIM Interval)에 따라 DTIM 패킷을 주기적으로 방송할 수 있다. 예를 들면, DTIM 구간은 비콘 구간의 배수이며, 도 2와 같이, 300ms 203이 될 수 있다. 전자 장치 100은 AP 100의 셀 111내에 위치하는 경우, AP 100과 통신을 수행할 수 있다. 전자 장치 100은 AP 100과 통신하기 위한 무선랜 모듈을 포함할 수 있다. 만일, 무선랜 모듈을 사용하지 않는 경우, 전자 장치 100 은 전원 절약 메커니즘(Power Save Mechanism, PSM)에 따라 무선랜 모듈을 제어할 수 있다. 예를 들면, PSM은 비콘 구간 동안에 무선랜 모듈을 어웨이크 상태(Awake Status)와 도즈 상태(Doze status 또는 Sleep Status)의 전환을 반복하는 것을 의미할 수 있다. 예를 들면, 어웨이크 상태는 AP 100과 데이터를 송/수신하는 상태를 의 미하며, 도즈 상태는 무선랜 모듈의 전원을 최소한으로 사용하는 상태로, AP 100과 통신을 수행하지만 데이터를 송/수신하지 않는 상태를 의미할 수 있다. 예를 들면, 어웨이크 상태는 도즈 상태보다 전원을 더 많이 소비할 수 있다. 전자 장치 100은 비콘 구간 동안에 PSM에 따라 무선랜 모듈을 어웨이크 상태와 도즈 상태로 전환하는 것을 반복 할 수 있다. 전자 장치 100은 어웨이크 상태에서 TIM 패킷을 수신함으로써 자신이 유니캐스트 통신 방식으로 수 신할 데이터가 존재하는지를 확인할 수 있다. 그리고 전자 장치 100은 DTIM 패킷을 수신함으로써 자신이 멀티캐 스트 또는 브로드캐스트 통신 방식으로 수신할 데이터가 존재하는지를 확인할 수 있다. 한편, PSM에 따른 무선랜 모듈이 어웨이크 상태와 도즈 상태를 반복하는 웨이크업(wake up) 주기는 비콘 주기와 DTIM 주기를 기반으로 결정될 수 있다. 예를 들면, 비콘 주기는 TIM 패킷을 수신하는 주기를 의미하며, DTIM 주 기는 DTIM 패킷을 수신하는 주기를 의미할 수 있다. 예를 들면, 비콘 주기가 100 ms이고, DTIM 주기가 300 ms인 경우, 무선랜 모듈의 웨이크업 주기는 100 ms가 될 수 있다. 왜냐하면, 무선랜 모듈이 비콘 주기마다 도즈 상태 로부터 어웨이크 상태로 변경되어 TIM 패킷을 수신하여야 하기 때문이다. 예를 들면, DTIM 주기는 비콘 주기의 정수배가 될 수 있다. 예를 들면, 웨이크업 주기는 DTIM 주기와 비콘 주기 의 최소 공배수가 될 수 있다. 이와 같이, 전자 장치 100은 웨이크업 주기를 가지는 PSM에 따라 무선랜 모듈을 동작시킴으로써 전자 장치의 전 원을 절약할 수 있다. 예를 들면, 전자 장치 100은 AP 110의 수신 신호 세기와 전자 장치 100의 상태 중 적어도 하나를 기반으로 웨이크업 주기를 제어할 수 있다. 예를 들면, 전자 장치 100의 상태는, 전자 장치 100의 이동 속도, 현재 실행 중인 어플리케이션의 종류, 전자 장치 100의 액티브/슬립 모드, 알림에 대한 전자 장치 100의 상태 변경, 어플리케이션 네트워크 사용 정보 중 적어도 하나를 포함할 수 있다. 예를 들면, 전자 장치 100의 액티브 모드는 전자 장치 100에 포함된 제1프로세서(예: CPU 또는 AP)가 활성화된 모드를 의미할 수 있다. 예를 들면, 전자 장치 100의 슬립 모드는 제1프로세서(예: CPU 또는 AP)가 비활성화된 모드를 의미할 수 있다. 예를 들면, 비활성화는 제1프로세서의 최소한의 기능(예: 사용자의 입력 또는 다른 구 성요소(예: 무선랜 모듈)로부터 액티브 모드 전환 요청을 수신하는 기능)만을 수행하는 것을 말할 수 있다. 한 실시 예에서, 전자 장치 100은 AP 110의 수신 신호 세기와 전자 장치 100의 액티브/슬립 모드와 현재 실행 중인 어플리케이션의 종류 중 적어도 하나를 기반으로 웨이크업 주기를 제어할 수 있다. 다른 실시 예에서, 전자 장치 100은 AP 110의 수신 신호 세기와 전자 장치 100의 액티브/슬립 모드와 전자 장치 100의 이동 속도와 알림에 대한 전자 장치 100의 상태 변경 중 적어도 하나를 기반으로 웨이크업 주기를 제어할 수 있다. 또 다른 실시 예에서, 전자 장치 100은 AP 110의 수신 신호 세기와 전자 장치 100의 액티브/슬립 모드와 전자 장치 100의 이동 속도 중 적어도 하나를 기반으로 웨이크업 주기를 제어할 수 있다. 도 3은 본 발명의 제1실시 예에 따른 전자 장치의 블록 구성도이다. 도 3을 참조하면, 전자 장치 100은 제1프로세서 301과 무선랜 모듈 303과 무선랜 모듈 303 내에 포함되는 제2프 로세서 305와 센서 모듈 307과 디스플레이 모듈 309와 입력 모듈 311과 메모리 313을 포함할 수 있다. 각 구성요소를 살펴보면, 입력 모듈 311은 예를 들면, 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키(key), 또는 초음파(ultrasonic) 입력 모듈을 포함할 수 있다. 예를 들면, 터치 패널은, 정전식, 감 압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 터치 패널은 택타일 레이어 (tactile layer)를 더 포함하여 사용자에게 촉각 반응을 제공할 수 있다. 예를 들면, (디지털) 펜 센서는 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 예를 들면, 키는 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 모듈은 마이크를 통해 입력 도구에서 발생된 초음파를 감지하여 상 기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이 모듈 309는 패널, 홀로그램 모듈, 또는 프로젝터를 포함할 수 있다. 예를 들면, 패널은, 유연하게 (flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널은 터치 패널과 하 나의 모듈로 구성될 수도 있다. 홀로그램 모듈은 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프 로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 예를 들면, 스크린은 전자 장치 100의 내부 또는 외 부에 위치할 수 있다. 센서 모듈 307은 예를 들면, 물리량을 계측하거나 전자 장치 110의 작동 상태를 감지하여 계측 또는 감지된 정 보를 전기 신호로 변환할 수 있다. 예를 들면, 센서 모듈 307은 제스처 센서, 자이로 센서, 기압 센서, 마그네 틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서(예: RGB(red, green, blue) 센서), 생체 센서, 온/습 도 센서, 조도 센서, UV(ultra violet) 센서 중 적어도 하나를 포함할 수 있다. 센서 모듈 307은 내부에 포함된 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 메모리 313은, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 예를 들면, 내장 메모리는 휘발성 메모리(예를 들면, 동적 램(Dynamic Random Access Memory, DRAM), 정적 램(Static RAM, SRAM), 또는 동기 동 적 램(Synchronous Dynamic RAM, SDRAM) 등), 비휘발성 메모리(non-volatile Memory)(예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예를 들면, 낸드 플래시(NAND flash) 또는 노어 플래시(NOR flash) 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro- SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 또 는 메모리 스틱(memory stick) 등을 더 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 전자 장치 110와 기능적으로 및/또는 물리적으로 연결될 수 있다. 무선랜 모듈 303은 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등을 제공할 수 있다. 한 실시 예에 따르면, 무선랜 모듈 303은 전원을 공급받아 전원이 온(on)될 수 있다. 예를 들면, 전원은, 제1프로세서 301의 제어에 따라 공급될 수 있다. 무선랜 모듈 303은 제1프로세서 801로부터 전원 절약 모드 전환 요청을 수신하는지 여부를 확인할 수 있다. 예 를 들면, 전원 절약 모드는 PSM에 따라 동작하는 모드를 의미할 수 있다. 예를 들면, 전원 절약 모드 전환 요청 은, 무선랜 모듈 805에게 PSM에 따라 동작하도록 요청하는 지시 메시지일 수 있다. 예를 들면, 전원 절약 모드 전환 요청은 제1프로세서 301에 의해 결정된 웨이크업 주기와 함께 수신될 수 있다. 확인 결과, 전원 절약 모드 전환 요청이 수신되지 않으면, 무선랜 모듈 303은 전원 절약 모드 전환 요청의 수신을 대기할 수 있다. 만약에, 전원 절약 모드 전환 요청이 수신되면, 무선랜 모듈 303은 전원 절약 모드를 실행할 수 있다. 예를 들 면, 전원 절약 모드 전환 요청만 수신되는 경우, 무선랜 모듈 303는 미리 지정된 액티브 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 다른 예로, 전원 절약 모드 전환 요청과 결정된 웨이크업 주기가 함께 수신 되는 경우, 무선랜 모듈 303는 결정된 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 무선랜 모듈 303는 제1프로세서 301로부터 슬립 모드 진입 알림을 수신하는지 여부를 확인할 수 있다. 확인 결 과, 슬립 모드 진입 알림을 수신하지 않으면, 무선랜 모듈 303은 슬립 모드 진입 알림의 수신을 대기할 수 있다, 만약에, 슬립 모드 진입 알림을 수신하면, 무선랜 모듈 303은 미리 지정된 디폴트 슬립 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 슬립 모드 진입 알림은 제1프로세서 301이 액티브 모드로부터 슬 립 모드로 전환된다는 것을 알리는 메시지일 수 있다. 예를 들면, 디폴트 슬립 웨이크업 주기가 100 ms인 경우, 무선랜 모듈 303은 100 ms 마다 도즈 상태로부터 어웨이크 상태로 전환할 수 있다. 무선랜 모듈 303은 제2프로세서 305로부터 웨이크업 주기 변경 요청을 수신하는지 여부를 확인할 수 있다. 예를 들면, 웨이크업 주기 변경 요청은 무선랜 모듈 303의 웨이크업 주기를 변경할 것을 요청하는 지시 메시지일 수 있다. 확인 결과, 웨이크업 주기 변경 요청이 수신되면, 무선랜 모듈 303은 결정된 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 현재 웨이크업 주기가 100 ms이고, 결정된 웨이크업 주기가 200 ms인 경우, 무선랜 모듈 303은 웨이크업 주기를 100 ms로부터 200 ms로 변경하고, 변경된 200 ms에 따라 전원 절약 모드를 실행할 수 있다. 웨이크업 주기 변경 요청을 수신하지 못하거나 웨이크업 주기 변경 요청에 따라 전원 절약 모드를 실행한 경우, 무선랜 모듈 303은 외부로부터 패킷을 수신하는지 여부를 확인할 수 있다. 예를 들면, AP 110과 통신 중인 경우, 무선랜 모듈 303은 AP 110으로부터 데이터가 수신되는지 여부를 확인할 수 있다. 확인 결과, 패킷이 수신되지 않으면, 무선랜 모듈 303은 패킷 수신을 대기할 수 있다. 만약에, 패킷이 수신되면, 무선랜 모듈 303은 제1프로세서 301로 액티브 모드 진입 요청을 전송할 수 있다. 예를 들면, 액티브 모드 진입 요청은 제1프로세서 301에게 슬립 모드로부터 액티브 모드로 전환할 것을 요청하는 지시 메시지일 수 있다. 그리고 무선랜 모듈 303은 미리 지정된 액티브 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 액티브 웨이크업 주기가 50 ms인 경우, 무선랜 모듈 303은 50 ms마다 도즈 상태로부터 어웨이크 상 태로 전환할 수 있다. 무선랜 모듈 303은 제1프로세서 301로부터 웨이크업 주기 변경 요청을 수신하는지 여부를 확인할 수 있다. 예를 들면, 무선랜 모듈 303은 웨이크업 주기 변경 요청과 함께 제1프로세서 301에 의해 결정된 웨이크업 주기를 수 신할 수 있다. 확인 결과, 웨이크업 주기 변경 요청이 수신되지 않으면, 무선랜 모듈 303은 웨이크업 주기 변경 요청의 수신을 대기할 수 있다. 만약에, 웨이크업 주기 변경 요청이 수신되면, 무선랜 모듈 303은 제1프로세서 301에 의해 결 정된 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 결정된 웨이크업 주기가 200 ms인 경 우, 무선랜 모듈 303은 200 ms마다 도즈 상태로부터 어웨이크 상태로 전환할 수 있다. 제2프로세서 305는 제1프로세서 301가 슬립 모드로 진입할 때, 전자 장치 110의 일부 구성요소를 제어할 수 있 다. 예를 들면, 제2프로세서 305는 제1프로세서 301이 슬립 모드로 진입하면, 센서 모듈 307과 무선랜 모듈 303 을 제어할 수 있다. 한 실시 예에 따르면, 제2프로세서 305는 제1프로세서로부터 웨이크업 주기 계산 요청을 수신하는지 여부를 확 인할 수 있다. 예를 들면, 웨이크업 주기 계산 요청은 무선랜 모듈 303의 웨이크업 주기를 계산할 것을 요청하 는 지시 메시지일 수 있다. 확인 결과, 웨이크업 주기 계산 요청이 수신되지 않으면, 제2프로세서 305는 웨이크업 주기 계산 요청의 수신을 대기할 수 있다. 만약에, 웨이크업 주기 계산 요청이 수신되면, 제2프로세서 305는 전자 장치 100의 상태와 수 신 신호 세기 중 적어도 하나를 기반으로 무선랜 모듈 303의 비콘 주기와 DTIM 주기 중 적어도 하나를 결정할 수 있다. 그리고 제2프로세서 305는 결정된 비콘 주기와 DTIM 주기 중 적어도 하나를 기반으로 웨이크업 주기를 결정하고, 웨이크업 주기 변경 요청을 무선랜 모듈 303으로 전할 수 있다. 예를 들면, 제2프로세서 305는 전자 장치 100의 이동 속도와 수신 신호 세기를 기반으로 비콘 주기와 DTIM 주기 중 적어도 하나를 결정할 수 있다. 예를 들면, 웨이크업 주기 변경 요청은 결정된 웨이크업 주기를 포함할 수 있다. 제2프로세서 305는 제1프로세서 301로부터 웨이크업 주기 계산 중지 요청을 수신하는지 여부를 확인할 수 있다. 예를 들면, 웨이크업 주기 계산 중지 요청은 제2프로세서 305에게 웨이크업 주기를 계산하는 동작을 중지할 것 을 요청하는 지시 메시지일 수 있다. 확인 결과, 웨이크업 주기 계산 중지 요청이 수신되지 않으면, 제2프로세서 305는 웨이크업 주기 계산 중지 요 청의 수신을 대기할 수 있다. 이와 달리, 웨이크업 주기 계산 중지 요청이 수신되면, 제2프로세서 305는 웨이크 업 주기를 계산하는 동작을 중지할 수 있다. 한 실시 예에 따르면, 제2프로세서 305는 무선랜 모듈 303의 웨이크업 주기를 기반으로 액티브 모드와 슬립 모 드를 전환할 수 있다. 예를 들면, 무선랜 모듈 303이 어웨이크 상태일 때, 제2프로세서 305는 액티브 모드이며, 무선랜 모듈 303이 도즈 상태일 때, 슬립 모드일 수 있다. 예를 들면, 제2프로세서 305은 무선랜 모듈 303이 어웨이크 상태일 때, 웨이크업 주기를 계산할 수 있다. 한 실시 예에 따르면, 제2프로세서 305는 전자 장치 100의 이동 속도와 수신 신호 세기를 기반으로 웨이크업 주 기를 결정할 수 있다. 예를 들면, 제2프로세서 305는 통신 중인 AP 110의 수신 신호 세기를 확인할 수 있다. 제2프로세서 305는 수신 신호 세기가 미리 지정된 제2기준값을 초과하는지 여부를 확인할 수 있다. 예를 들면, 제2기준값은 확인된 수신 신호 세기의 중간 레벨에 대응되는 값이 될 수 있다. 확인 결과, 수신 신호 세기가 제2기준값 이하이면, 제2프로세서 305는 미리 지정된 액티브 웨이크업 주기로 웨 이크업 주기를 결정하고, 무선랜 모듈에게 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 제2프로세서 305는 웨이크업 주기 변경 요청을 전송할 수 있다. 다른 예로, 제2프로세서 305는 웨이크업 주기 변경 요청과 액티브 웨이크업 주기에 따라 전원 절약 모드를 실행할 것을 요청하는 지시자를 함께 전송할 수 있다. 또 다른 예로, 제2프로세서 305는 웨이크업 주기 변경 요청과 액티브 웨이크업 주기를 함께 전송할 수 있다. 확인 결과, 수신 신호 세기가 제2기준값을 초과하는 경우, 제2프로세서 305는 전자 장치 100이 이동중인지 여부 를 확인할 수 있다. 예를 들면, 제2프로세서 305는 수신 신호 세기의 변경을 기반으로 전자 장치 100의 이동 여 부를 확인할 수 있다. 예를 들면, 이전에 수신된 신호에 대한 제1수신 신호 세기와 현재 수신된 신호에 대한 제 2수신 신호 세기가 다르면, 제2프로세서 305는 전자 장치 100이 이동 중인 것으로 결정할 수 있다. 다른 예로, 제1수신 신호 세기와 제2수신 신호 세기가 동일하면, 제2프로세서 305는 전자 장치 100이 이동하고 있지 않다고 결정할 수 있다. 다른 예로, 제2프로세서 305는 센서 모듈 307에 포함된 가속도 센서를 이용하여 전자 장치 100이 이동 중인지 여부를 확인할 수 있다. 예를 들면, 가속도 센서는 가속도 센서의 값을 모니터링하여 버퍼(예: 메모리 313)에 저장하고, 제2프로세서 305는 버퍼에 저장된 가속도 센서의 값을 기반으로 전자 장치 100의 이동 여부를 확인할 수 있다. 또 다른 예로, 제2프로세서 305는 위성 항법 시스템(GPS) 모듈을 이용하여 전자 장치 100이 이동 중인 지 여부를 확인할 수 있다. 확인 결과, 전자 장치 100이 이동중인 경우, 제2프로세서 305는 전자 장치 100의 이동 속도를 확인할 수 있다. 예를 들면, 제2프로세서 803은 센서 모듈 307에 포함된 가속도 센서를 기반으로 전자 장치 100의 이동 속도를 계산할 수 있다. 다른 예로, 제2프로세서 803은 수신 신호 세기를 기반으로 전자 장치 100의 이동 거리를 계산 하고, 계산된 이동 거리를 기반으로 전자 장치 100의 이동 속도를 계산할 수 있다. 또 다른 예로, 제2프로세서 803은 위성 항법 시스템 모듈의 좌표값을 이용하여 전자 장치 100의 이동 거리를 계산하고, 계산된 이동 거리를 기반으로 전자 장치 100의 이동 속도를 계산할 수 있다. 그리고 제2프로세서 305는 확인된 이동 속도가 제3기준값을 초과하거나 수신 신호 세기가 제4기준값 미만인지 여부를 확인할 수 있다. 예를 들면, 제3기준값은 사용자의 달리기 또는 자전거/자동차 탑승을 기반으로 결정될 수 있다. 예를 들면, 제4기준값은 AP 110의 수신 범위를 벗어났을 때의 수신 신호 세기를 기반으로 결정될 수 있다. 확인 결과, 확인된 이동 속도가 제3기준값을 초과하거나 수신 신호 세기가 제4기준값 미만인 경우, 제2프로세서 305는 미리 지정된 액티브 웨이크업 주기로 웨이크업 주기를 결정하고, 무선랜 모듈 303에게 웨이크업 주기 변 경 요청을 전송할 수 있다. 이와 달리, 확인된 이동 속도가 제3기준값 이상이고 수신 신호 세기가 제4기준값 이상이면, 제2프로세서 305는 비콘 카운트를 확인할 수 있다. 예를 들면, 비콘 카운트는 슬립 모드에서 도즈 상태로부터 전환하는 웨이크업의 횟수를 의미할 수 있다. 예를 들면, 비콘 카운트가 1이라는 것은 슬립 모드에서 첫번째로 웨이크업을 수행한다 는 의미일 수 있다. 그리고 제2프로세서 305는 확인된 비콘 카운트가 1인지 여부를 확인할 수 있다. 만약에, 확인된 비콘 카운트가 1이면, 제2프로세서 305는 웨이크업 주기를 디폴트 슬립 웨이크업 주기로 결정하고 무선랜 모듈에게 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 제2프로세서 305는 웨이크업 주기 변경 요청만을 전송할 수 있다. 다른 예로, 제2프로세서 305는 웨이크업 주기 변경 요청과, 디폴트 슬립 웨이크업 주기에 따라 전원 절약 모드를 실행할 것을 요청하는 지시자를 함께 전송할 수 있다. 또 다른 예로, 제2프로세서 305는 웨이크업 주기 변경 요청과 디폴트 슬립 웨이크업 주기를 함께 전송할 수 있다.만약에, 확인된 비콘 카운트가 1이 아니면, 제2프로세서 305는 웨이크업 주기를 결정할 수 있다. 예를 들면, 제 2프로세서 305는 현재 웨이크업 주기를 두 배로 증가함으로써 새로운 웨이크업 주기를 결정할 수 있다. 예를 들 면, 제2프로세서는 현재 웨이크업 주기의 DTIM 주기와 비콘 주기 중 적어도 하나를 두 배로 증가시킴으로써 새 로운 DTIM 주기 및 비콘 주기를 결정하고, 결정된 DTIM 주기와 비콘 주기를 기반으로 새로운 웨이크업 주기를 결정할 수 있다. 그리고 제2프로세서 305는 결정된 웨이크업 주기가 미리 지정된 최대 주기 이하인지 여부를 확인할 수 있다. 확인 결과, 결정된 웨이크업 주기가 최대 주기를 초과하면, 제2프로세서 305는 웨이크업 주기를 결정하는 동작 을 종료할 수 있다. 이와 달리, 결정된 웨이크업 주기가 최대 주기 이하이면, 제2프로세서 305는 무선랜 모듈 303에게 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 제2프로세서 305는 웨이크업 주기 변경 요청과 결정된 웨이크업 주기를 함께 전송할 수 있다. 제1프로세서 301은 운영 체제 또는 응용 프로그램(어플리케이션)을 구동하여 제1프로세서 301에 연결된 다수의 하드웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 예를 들 면, 제1프로세서 301은, 시스템 온 칩(System on Chip, SoC)으로 구현될 수 있다. 제1프로세서 301은 다른 구성 요소들(예를 들면, 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 한 실시 예에 따르면, 제1프 로세서 301은 제어부라고 불릴 수도 있다. 예를 들면, 제1프로세서 301은 복수의 코어(Multi-core)를 포함할 수 있다. 한 실시 예에 따르면, 제1프로세서 301은 무선랜 모듈 303을 이용하는 어플리케이션이 실행되는지 여부를 확인 할 수 있다. 예를 들면, 무선랜 모듈 303을 이용하는 어플리케이션은 사용자에 의해 또는 자동적으로 실행될 수 있다. 예를 들면, 무선랜 모듈 303을 이용하는 어플리케이션은 오디오 스트리밍 어플리케이션, 비디오 스트리밍 어플리케이션, 인터넷 서비스를 제공하는 어플리케이션, 이메일 송/수신 서비스를 제공하는 어플리케이션 또는 게임 서비스를 제공하는 어플리케이션 등이 될 수 있다. 확인 결과, 무선랜 모듈 303을 이용하는 어플리케이션이 실행되지 않으면, 제1프로세서 301은 무선랜 모듈 303 을 이용하는 어플리케이션의 실행을 대기할 수 있다. 이와 달리, 무선랜 모듈 303을 이용하는 어플리케이션이 실행되면, 제1프로세서 301은 무선랜 모듈 805에 전원을 공급하며, 전자 장치 100의 상태와 수신 신호 세기 중 적어도 하나를 기반으로 무선랜 모듈 303의 웨이크업 주기를 결정하고, 전원 절약 모드 전환 요청을 전송할 수 있다. 예를 들면, 제1프로세서 301은 현재 실행 중인 어플리케이션의 종류와 전자 장치 100의 액티브/슬립 모드와 전 자 장치 100의 이동 속도를 기반으로 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 301은 전원 절 약 모드 전환 요청만을 전송할 수 있다. 다른 예로, 제1프로세서 301은 전원 절약 모드 전환 요청과, 결정된 웨 이크업 주기를 함께 전송할 수 있다. 제1프로세서 301은 미리 지정된 시간 동안에 사용자 입력이 미발생되는지 여부를 확인할 수 있다. 예를 들면, 제1프로세서 301은 미리 지정된 시간 동안에 입력 모듈을 통해 입력이 수신되지 않으면, 사용자 입력이 미발생 한 것으로 결정할 수 있다. 확인 결과, 사용자 입력이 미발생되면, 제1프로세서 301은 사용자 입력의 발생을 대기할 수 있다. 이와 달리, 사용자 입력이 발생되면, 제1프로세서 301은 슬립 모드 진입 알림을 무선랜 모듈 303으로 전송하고, 웨이크업 주기 계산 요청을 제2프로세서 305로 전송할 수 있다. 그리고 제1프로세서 301은 슬립 모드에 진입할 수 있다. 제1프로세서 301은 무선랜 모듈 303으로부터 액티브 모드 진입 요청을 수신하는지 여부를 확인한다. 예를 들면, 액티브 모드 진입 요청은 외부로부터 패킷 수신에 의해 발생된 것일 수 있다. 확인 결과, 액티브 모드 진입 요청이 수신되지 않으면, 제1프로세서 301은 액티브 모드 진입 요청의 수신을 대 기할 수 있다. 이와 달리, 액티브 모드 진입 요청이 수신되면, 제1프로세서 301은 액티브 모드로 진입하고, 웨 이크업 주기 계산 중지 요청을 제2프로세서 305로 전송할 수 있다. 그리고 제1프로세서 301은 수신된 패킷의 알림에 대한 전자 장치 100의 상태를 기반으로 무선랜 모듈 303의 웨 이크업 주기를 결정하고, 무선랜 모듈 303에게 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 제1프로 세서 301은 수신된 패킷에 대한 알림을 출력한 후, 미리 지정된 시간 동안에 전자 장치 100의 상태 변화를 검출할 수 있다. 그리고 제1프로세서 301은 검출된 전자 장치 100의 상태 변화를 기반으로 무선랜 모듈 303의 웨이 크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 301은 전자 장치 100의 액티브/슬립 모드와 알림에 대한 전자 장치 100의 상태 변경과 전자 장치 100의 이동 속도를 기반으로 웨이크업 주기를 결정할 수 있다. 한 실시 예에 따르면, 제1프로세서 301은 현재 실행 중인 어플리케이션의 종류와 전자 장치 100의 액티브/슬립 모드와 전자 장치 100의 이동 속도를 기반으로 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 301은 무선랜 모듈 303이 사용 중지되는지 여부를 확인할 수 있다. 예를 들면, 제1프로 세서 301은 미리 지정된 시간 동안에 데이터 패킷이 수신되지 않으면, 무선랜 모듈 303이 사용 중지된 것으로 결정할 수 있다. 확인 결과, 무선랜 모듈 303이 사용 중지되면, 제1프로세서 301은 무선랜 모듈 805에게 전원 절약 모드 전환 요 청을 전송한 후, 웨이크업 주기를 결정하는 동작을 종료할 수 있다. 이와 달리, 무선랜 모듈 303이 사용 중지되지 않으면, 제1프로세서 301은 현재 실행된 어플리케이션의 종류를 확인할 수 있다. 제1프로세서 801은 확인된 어플리케이션이 오디오 스트리밍 어플리케이션인지 여부를 확인할 수 있다. 확인 결과, 확인된 어플리케이션이 오디오 스트리밍 어플리케이션이 아닌 경우, 제1프로세서 301은 확 인된 어플리케이션이 비디오 스트리밍 어플리케이션인지 여부를 확인할 수 있다. 확인 결과, 확인된 어플리케이션이 비디오 스트리밍 어플리케이션이 아닌 경우, 제1프로세서 301은 웨이크업 주 기를 결정하는 동작을 종료할 수 있다. 이와 달리, 확인된 어플리케이션이 비디오 스트리밍 어플리케이션인 경 우, 제1프로세서 301은 디스플레이가 오프되는지 여부를 확인할 수 있다. 예를 들면, 디스플레이의 오프는 사용 자의 요청에 의해 또는 미리 지정된 시간 동안에 사용자의 요청이 입력되지 않는 경우에 수행될 수 있다. 확인 결과, 디스플레이가 오프되지 않으면, 제1프로세서 301은 무선랜 모듈 303의 어웨이크 모드를 유지하기로 결정 할 수 있다. 이와 달리, 디스플레이가 오프되거나 확인된 어플리케이션이 오디오 스트리밍 어플리케이션인 경우, 제1프로세 서 301은 현재 통신 중인 AP 110에 대한 수신 신호 세기를 확인할 수 있다. 제1프로세서 301은 수신 신호 세기 가 제1기준값 이상인지 여부를 확인할 수 있다. 예를 들면, 제1기준값은, 확인된 수신 신호 세기의 중간 레벨에 대응되는 값이 될 수 있다. 확인 결과, 수신 신호 세기가 제1기준값 미만이면, 제1프로세서 301은 무선랜 모듈 303의 어웨이크 모드를 유지 하기로 결정할 수 있다. 예를 들면, 수신 신호 세기가 제1기준값 미만이면, 수신 신호 세기의 레벨이 중간 미만 이라는 것을 의미할 수 있다. 이와 같이, 수신 신호 세기의 레벨이 중간 미만이라면, AP 110과 전자 장치 100 간의 통신 상태가 보통 미만이라고 볼 수 있다. 이와 같이, 통신 상태가 보통 미만인 경우, 웨이크업 주기를 변 경하는 것은 현재 제공중인 컨텐츠 서비스의 품질을 떨어뜨릴 수 있으므로, 무선랜 모듈 303의 상태를 어웨이크 상태로 유지하는 것이 바람직할 수 있다. 확인 결과, 수신 신호 세기가 제1기준값 이상이면, 제1프로세서 301은 컨텐츠의 평균 비트율(bit rate) 및 현재 전송 속도를 계산할 수 있다. 예를 들면, 현재 실행 중인 어플리케이션이 오디오 스트리밍 어플리케이션인 경우, 오디오 컨텐츠의 평균 비트율을 계산할 수 있다. 다른 예로, 현재 실행 중인 어플리케이션이 비디오 스트 리임 어플레케이션인 경우, 비디오 컨텐츠의 평균 비트율을 계산할 수 있다. 컨텐츠의 종류에 따라 비트율이 가 변적이거나 고정적일 수 있으므로, 평균 비트율을 기준으로 한다. 제1프로세서 301은 현재 전송 속도가 평균 비트율보다 충분히 큰지 여부를 확인할 수 있다. 예를 들면, 현재 전 송 속도가 평균 비트율의 1.5배 이상미면, 제1프로세서 301은 현재 전송 속도가 평균 비트율보다 충분히 크다고 결정할 수 있다. 확인 결과, 현재 전송 속도가 평균 비트율보다 충분히 크지 않으면, 무선랜 모듈 303을 어웨이 크 상태로 유지할 것으로 결정할 수 있다. 예를 들면, 현재 전송 속도가 평균 비트율보다 충분히 크지 않으면, 현재 전송 속도와 평균 비트율이 유사하다 고 볼 수 있다. 이와 같이, 현재 전송 속도와 평균 비트율이 유사한 경우, 웨이크업 주기를 변경하는 것은 현재 제공중인 컨텐츠 서비스의 품질을 떨어뜨릴 수 있으므로, 무선랜 모듈 303의 상태를 어웨이크 상태로 유지하는 것이 바람직할 수 있다. 만약에, 현재 전송 속도가 평균 비트율보다 충분히 크면, 제1프로세서 301은 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 301은 현재 전송 속도와 평균 비트율을 기반으로 웨이크업 주기를 결정할 수 있다. 예를 들면, 컨텐츠의 평균 비트율이 200KB/sec이고, 현재 전송 속도가 1MB/sec인 경우, 1MB의 컨텐츠로 총 5초 동 안의 컨텐츠를 버퍼링할 수 있다. 즉, 1초의 컨텐츠 분량을 버퍼링하기 위해서는 200 ms가 필요하다. 이러한 경 우, 비콘 주기가 500 ms로 설정되더라도, 1초의 컨텐츠(200 KB의 데이터)를 수신한 후 300 ms의 시간적인 여유 가 있으므로, 스트리밍의 끊김 현상 등에 의한 서비스 품질을 떨어뜨리지 않으면서 기기의 소모전력을 줄일 수 있다. 따라서, 제1프로세서 301은 비콘 주기를 500 ms로 결정하고, 결정된 비콘 주기 500 ms를 기반으로 웨이크 업 주기를 결정할 수 있다. 그리고 제1프로세서 301은 무선랜 모듈 805로 전원 절약 모드 전환 요청을 전송할 수 있다. 예를 들면, 제1프로 세서 301은 결정된 웨이크업 주기와 전원 절약 모드 전환 요청을 함께 전송할 수 있다. 다른 실시 예에 따르면, 제1프로세서 301은 수신된 패킷의 알림에 대한 전자 장치 100의 상태를 기반으로 무선 랜 모듈 303의 웨이크업 주기를 결정할 수 있다. 특히, 제1프로세서 301은 수신된 패킷에 대한 알림을 출력할 수 있다. 예를 들면, 제1프로세서 301은 메모리 313으로부터 현재 수신된 패킷을 검출하고, 검출된 패킷이 영상 데이터인 경우, 디스플레이에 표시할 수 있다. 다른 예로, 제1프로세서 301은 메모리 313으로부터 현재 수신된 패킷을 검출하고, 검출된 패킷이 음성 데이터인 경우, 스피커를 통해 출력할 수 있다. 예를 들면, 도 17과 같이, 제1프로세서 301은 디스플레이에 알림 1703을 표시할 수 있다. 그리고 제1프로세서 301은 디스플레이가 오프되거나 오프된 상태인지 여부를 확인할 수 있다. 확인 결과, 디스 플레이가 오프되지 않은 경우, 제1프로세서 301은 디스플레이의 오프를 대기할 수 있다. 이와 달리, 디스플레이가 오프되거나 오프된 경우, 제1프로세서 301은 알림이 무시되거나 미리 지정된 시간 동 안에 입력이 미발생되는지 여부를 확인할 수 있다. 예를 들면, 도 17의 1705 화면과 같이, 디스플레이가 오프된 후, 미리 지정된 시간 동안에 사용자 입력이 수신되지 않으면, 제1프로세서 301은 입력이 미발생된 것으로 결정 할 수 있다. 다른 예로, 사용자에 의해 알림을 무시하는 제스처가 입력되면, 제1프로세서 301은 알림이 무시된 것으로 결정할 수 있다. 예를 들면, 도 17과 같이, 알림을 출력한 후, 사용자 의해 전자 장치 100이 뒤집어지는 제스처가 감지되면, 제1프로세서 301은 알림이 무시된 것으로 결정할 수 있다. 예를 들면, 사용자의 제스처는 센서 모듈 307에 의해 감지될 수 있다. 확인 결과, 알림이 무시되거나 입력이 미발생되면, 제1프로세서 301은 웨이크업 주기를 최대 크기로 결정하고 무선랜 모듈에게 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 제1프로세서 301은 최대 크기를 가지 는 웨이크업 주기와 함께 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 최대 크기는 미리 지정된 값 일 수 있다. 예를 들면, 최대 크기는 1초일 수 있다. 예를 들면, 제1프로세서 301은 비콘 주기를 최대 크기로 결정하고, 결정된 비콘 주기를 기반으로 웨이크업 주기를 결정할 수 있다. 이와 달리, 알림이 무시되지 않고 입력이 발생되면, 제1프로세서 301은 전자 장치 100과 통신 중인 AP 110에 대 한 수신 신호 세기를 확인할 수 있다. 제1프로세서 801은 수신 신호 세기가 미리 지정된 제2기준값을 초과하는 지 여부를 확인할 수 있다. 확인 결과, 수신 신호 세기가 제2기준값 이하이면, 제1프로세서 301은 미리 지정된 액티브 웨이크업 주기로 웨이크업 주기를 결정하고, 무선랜 모듈에게 웨이크업 주기 변경 요청을 전송할 수 있 다. 이와 달리, 수신 신호 세기가 제2기준값을 초과하면, 제1프로세서 301은 전자 장치 100가 이동 중인지 여부를 확인할 수 있다. 확인 결과, 전자 장치 100이 이동 중이면, 제1프로세서 301은 전자 장치 100의 이동 속도를 확 인할 수 있다. 그리고 제1프로세서 301은 확인된 이동 속도가 제3기준값을 초과하거나 수신 신호 세기가 제4기 준값 미만인지 여부를 확인할 수 있다. 확인 결과, 확인된 이동 속도가 제3기준값 이하이거나 수신 신호 세기가 제4기준값 이하인 경우, 제1프로세서 301은 제1프로세서 301은 미리 지정된 액티브 웨이크업 주기로 웨이크업 주기를 결정하고, 무선랜 모듈에게 웨 이크업 주기 변경 요청을 전송할 수 있다. 이와 달리, 전자 장치 100이 정지하거나 확인된 이동 속도가 제3기준값을 초과하거나 수신 신호 세기가 제4기준 값 미만인 경우, 제1프로세서 301은 웨이크업 주기를 결정하고, 무선랜 모듈 805에게 웨이크업 주기 변경 요청 을 전송할 수 있다. 예를 들면, 제1프로세서 301은 현재 웨이크업 주기를 두 배로 증가함으로써 새로운 웨이크 업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 301은 현재 웨이크업 주기의 DTIM 주기 및 비콘 주기 중 적어도 하나를 두 배로 증가시키고, 증가된 DTIM 주기 및 비콘 주기 중 적어도 하나를 기반으로 웨이크업 주기를 결정할 수 있다. 도 4는 본 발명의 제2실시 예에 따른 전자 장치의 블록 구성도이다. 도 4를 참조하면, 전자 장치 100은 제1프로세서 401과 무선랜 모듈 403과 센서 모듈 405와 센서 모듈 405 내에 포함되는 제2프로세서 407과 디스플레이 모듈 409와 입력 모듈 411과 메모리 413을 포함할 수 있다. 도 3과 비교하면, 제2프로세서 407이 센서 모듈 405 내에 포함된다는 것을 제외하고, 제1프로세서 401과 무선랜 모듈 403과 센서 모듈 405와 제2프로세서 407과 디스플레이 모듈 409와 입력 모듈 411과 메모리 413은 도 3의 제1프로세서 301과 무선랜 모듈 303과 제2프로세서 305와 센서 모듈 307과 디스플레이 모듈 309와 입력 모듈 311과 메모리 313에 각각 대응될 수 있다. 따라서, 제1프로세서 401과 무선랜 모듈 403과 센서 모듈 405와 제2프로세서 407과 디스플레이 모듈 409와 입력 모듈 411과 메모리 413에 대한 자세한 설명은 생략한다. 도 5는 본 발명의 제3실시 예에 따른 전자 장치의 블록 구성도이다. 도 5를 참조하면, 전자 장치 100은 제1프로세서 501과 제1프로세서 501 내에 포함되는 제2프로세서 503과 무선 랜 모듈 505과 센서 모듈 507와 디스플레이 모듈 509와 입력 모듈 511과 메모리 513을 포함할 수 있다. 도 3과 비교하면, 제2프로세서 503이 제1프로세서 501 내에 포함된다는 것을 제외하고, 제1프로세서 501과 제2 프로세서 503과 무선랜 모듈 505과 센서 모듈 507와 디스플레이 모듈 509와 입력 모듈 511과 메모리 513은 도 3 의 제1프로세서 301과 무선랜 모듈 303과 제2프로세서 305와 센서 모듈 307과 디스플레이 모듈 309와 입력 모듈 311과 메모리 313에 각각 대응될 수 있다. 예를 들면, 제1프로세서 501이 복수의 코어로 구성되는 경우, 제2프 로세서 503은 복수의 코어들 중에서 하나가 될 수 있다. 따라서, 제1프로세서 501과 제2프로세서 503과 무선랜 모듈 505과 센서 모듈 507와 디스플레이 모듈 509와 입력 모듈 511과 메모리 513에 대한 자세한 설명은 생략한다. 도 6은 본 발명의 제4실시 예에 따른 전자 장치의 블록 구성도이다. 도 6을 참조하면, 전자 장치 100은 제1프로세서 601과 제2프로세서 603과 무선랜 모듈 605과 센서 모듈 607와 디스플레이 모듈 609와 입력 모듈 611과 메모리 613을 포함할 수 있다. 도 3과 비교하면, 제2프로세서 603이 무선랜 모듈 605에 포함되지 않는 별개의 구성요소라는 것을 제외하고, 제 1프로세서 601과 제2프로세서 603과 무선랜 모듈 605과 센서 모듈 607와 디스플레이 모듈 609와 입력 모듈 611 과 메모리 613은 도 3의 제1프로세서 301과 무선랜 모듈 303과 제2프로세서 305와 센서 모듈 307과 디스플레이 모듈 309와 입력 모듈 311과 메모리 313에 각각 대응될 수 있다. 따라서, 제1프로세서 601과 제2프로세서 603과 무선랜 모듈 605과 센서 모듈 607와 디스플레이 모듈 609와 입력 모듈 611과 메모리 613에 대한 자세한 설명은 생략한다. 도 7은 본 발명의 다양한 실시 예에 따른 전자 장치에서 무선랜 모듈을 제어하는 흐름도이다. 도 7을 참조하면, 701 단계에서, 전자 장치 100은 AP 110로부터 수신된 신호의 수신 신호 세기를 검출할 수 있 다. 예를 들면, 수신 신호 세기는 RSSI(Received Signal Strength Indicator)가 될 수 있다. 예를 들면, RSSI 의 범위는 -99에서 -35이며, 숫자가 높을수록 신호의 강도가 강하다고 볼 수 있다. 예를 들면, 전자 장치 100은 수신된 비콘 프레임을 이용하여 수신 신호 세기를 검출할 수 있다. 703 단계에서, 전자 장치 100은 전자 장치 100의 상태를 확인할 수 있다. 예를 들면, 전자 장치 100의 상태는, 전자 장치 100의 이동 속도, 현재 실행 중인 어플리케이션의 종류, 전자 장치 100의 액티브/슬립 모드, 알림에 대한 전자 장치 100의 상태 변경, 사용자의 전자 장치 사용 히스트리 중 적어도 하나를 포함할 수 있다. 705 단계에서, 전자 장치 100은 전자 장치 100의 상태와 수신 신호 세기 중 적어도 하나를 기반으로 무선랜 모 듈의 웨이크업 주기를 결정할 수 있다. 예를 들면, 웨이크업 주기는, PSM에 따른 무선랜 모듈이 도즈 상태에서 어웨이크 상태로 전환하는 주기를 의미할 수 있다. 예를 들면, 전자 장치 100은 수신 신호 세기와 전자 장치 100의 이동 속도와 액티브/슬립 모드를 기반으로 DTIM 주기 및 비콘 주기를 결정하고, 결정된 DTIM 주기 및 비콘 주기를 기반으로 웨이크업 주기를 결정할 수 있다. 다른 예로, 전자 장치 100은 전자 장치 100의 이동 속도와 전자 장치 100의 액티브/슬립 모드와 현재 실행 중인 어플리케이션의 종류를 기반으로 DTIM 주기 및 비콘 주기를 결정하고, 결정된 DTIM 주기 및 비콘 주기를 기반으 로 웨이크업 주기를 결정할 수 있다. 또 다른 예로, 전자 장치 100은 전자 장치 100의 액티브/슬립 모드, 알림 에 대한 전자 장치 100의 상태 변경, 어플리케이션별 네트워크 사용 정보를 기반으로 DTIM 주기 및 비콘 주기를 결정하고, 결정된 DTIM 주기 및 비콘 주기를 기반으로 웨이크업 주기를 결정할 수 있다. 707 단계에서, 전자 장치 100은 결정된 웨이크업 주기를 기반으로 무선랜 모듈을 제어할 수 있다. 예를 들면, 결정된 웨이크업 주기가 200 ms인 경우, 전자 장치 100은 200 ms마다 도즈 상태에서 어웨이크 상태로 전환할 수 있다. 도 8a 및 8b는 본 발명의 다양한 실시 예에 따른 전자 장치에서 무선랜 모듈의 전원 절약 모드를 실행하는 흐름 도이다. 도 8a 및 8b를 참조하면, 807 단계에서, 제1프로세서 801은 무선랜 모듈 805를 이용하는 어플리케이션이 실행되 는지 여부를 확인할 수 있다. 예를 들면, 무선랜 모듈 805를 이용하는 어플리케이션은 사용자에 의해 또는 자동 적으로 실행될 수 있다. 예를 들면, 무선랜 모듈 805를 이용하는 어플리케이션은 음악이나 라디오 방송과 같은 컨텐츠에 대한 오디오 스트리밍 서비스를 제공하는 어플리케이션(오디오 스트리밍 어플리케이션), 동영상과 같 은 컨텐츠에 대한 비디오 스트리밍 서비스를 제공하는 어플리케이션(비디오 스트리밍 어플리케이션), 인터넷 서 비스를 제공하는 어플리케이션, 이메일 송/수신 서비스를 제공하는 어플리케이션 또는 게임 서비스를 제공하는 어플리케이션 등이 될 수 있다. 확인 결과, 무선랜 모듈 805를 이용하는 어플리케이션이 실행되면, 제1프로세서 801은 809 단계로 진행하고, 그 렇지 않으면, 807 단계를 반복적으로 수행할 수 있다. 만약에, 809 단계로 진행하면, 제1프로세서 801은 무선랜 모듈 805에 전원을 공급함으로써 무선랜 모듈 805의 전원을 온(on)시킬 수 있다. 811 단계에서, 제1프로세서 807은 전자 장치 100의 상태와 수신 신호 세기 중 적어 도 하나를 기반으로 무선랜 모듈 805의 웨이크업 주기를 결정할 수 있다. 예를 들면, 전자 장치 100의 상태는, 전자 장치 100의 이동 속도, 현재 실행 중인 어플리케이션의 종류, 전자 장치 100의 액티브/슬립 모드, 알림에 대한 전자 장치 100의 상태 변경, 사용자의 전자 장치 사용 히스트리 중 적어도 하나를 포함할 수 있다. 예를 들면, 제1프로세서 801은 현재 실행 중인 어플리케이션의 종류와 전자 장 치 100의 액티브/슬립 모드와 전자 장치 100의 이동 속도를 기반으로 웨이크업 주기를 결정할 수 있다. 813 단계에서, 제1프로세서 801은 전원 절약 모드 전환 요청을 무선랜 모듈 805로 전송할 수 있다. 예를 들면, 전원 절약 모드는 PSM에 따라 동작하는 모드를 의미할 수 있다. 예를 들면, 전원 절약 모드 전환 요청은, 무선 랜 모듈 805에게 PSM에 따라 동작하도록 요청하는 지시 메시지일 수 있다. 예를 들면, 제1프로세서 801은 전원 절약 모드 전환 요청과 함께 811 단계에서 결정된 웨이크업 주기를 함께 전송할 수 있다. 815 단계에서, 무선랜 모듈 805는 전원 절약 모드를 실행할 수 있다. 예를 들면, 무선랜 모듈 805는 제1프로세 서 801이 액티브 모드일 때 미리 지정된 웨이크업 주기(액티브 웨이크업 주기)로 전원 절약 모드를 실행할 수 있다. 다른 예로, 결정된 웨이크업 주기가 수신되는 경우, 무선랜 모듈 805는 결정된 웨이크업 주기에 따라 전 원 절약 모드를 실행할 수 있다. 817 단계에서, 제1프로세서 801은 미리 지정된 시간 동안에 사용자 입력이 미발생되는지 여부를 확인할 수 있다. 예를 들면, 제1프로세서 801은 미리 지정된 시간 동안에 입력 모듈을 통해 입력이 수신되지 않으면, 사용 자 입력이 미발생한 것으로 결정할 수 있다. 확인 결과, 사용자 입력이 미발생되면, 제1프로세서 801은 819 단계로 진행하고, 그렇지 않으면, 817 단계를 반 복적으로 수행할 수 있다. 만약에, 819 단계로 진행하면, 제1프로세서 801은 슬립 모드 진입 알림을 무선랜 모듈 805로 전송할 수 있다. 예를 들면, 슬립 모드 진입 알림은 제1프로세서 801이 액티브 모드로부터 슬립 모드로 전환된다는 것을 알리는 메시지일 수 있다. 821 단계에서, 제1프로세서 801은 웨이크업 주기 계산 요청을 제2프로세서 803로 전송할 수 있다. 예를 들면, 웨이크업 주기 계산 요청은 무선랜 모듈 805의 웨이크업 주기를 계산할 것을 요청하는 지시 메시지일 수 있다. 823 단계에서, 제1프로세서 801은 슬립 모드에 진입할 수 있다. 825 단계에서, 무선랜 모듈 805는 디폴트 슬립 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 디폴트 슬립 웨이크업 주기는, 제1프로세서 801이 슬립 모드일 때 디폴트로 미리 지정된 웨이크업 주기를 의미할 수 있다. 827 단계에서, 제2프로세서 803은 전자 장치 100의 상태와 수신 신호 세기 중 적어도 하나를 기반으로 무선랜 모듈 805의 웨이크업 주기를 결정할 수 있다. 예를 들면, 제2프로세서 803은 전자 장치 100의 이동 속도와 수신 신호 세기를 기반으로 웨이크업 주기를 결정할 수 있다. 829 단계에서, 제2프로세서 803은 웨이크업 주기 변경 요청을 무선랜 모듈 805로 진행할 수 있다. 예를 들면, 웨이크업 주기 변경 요청은 무선랜 모듈 805의 웨이크업 주기를 변경할 것을 요청하는 지시 메시지일 수 있다. 예를 들면, 웨이크업 주기 변경 요청은 결정된 웨이크업 주기를 포함할 수 있다. 831 단계에서, 무선랜 모듈 805는 결정된 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 현재 웨이크업 주기가 100 ms이고, 결정된 웨이크업 주기가 200 ms인 경우, 무선랜 모듈 805는 웨이크업 주기를 100 ms로부터 200 ms로 변경하고, 변경된 200 ms에 따라 전원 절약 모드를 실행할 수 있다. 833 단계에서, 무선랜 모듈 805는 외부로부터 패킷이 수신되는지 여부를 확인할 수 있다. 예를 들면, AP 110과 통신 중인 경우, 무선랜 모듈 805는 AP 110으로부터 데이터가 수신되는지 여부를 확인할 수 있다. 확인 결과, 패킷이 수신되는 경우, 무선랜 모듈 805는 835 단계로 진행하고, 그렇지 않으면, 833 단계를 반복적으로 수행할 수 있다. 만약에, 835 단계로 진행하면, 무선랜 모듈 805는 액티브 모드 진입 요청을 제1프로세서 801로 전송할 수 있다. 예를 들면, 액티브 모드 진입 요청은 제1프로세서 801에게 슬립 모드로부터 액티브 모드로 전환할 것을 요청하 는 지시 메시지일 수 있다. 837 단계에서, 무선랜 모듈 805는 액티브 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 839 단계에서, 제1프로세서 801은 액티브 모드에 진입할 수 있다. 예를 들면, 제1프로세서 801은 슬립 모드로부 터 액티브 모드로 전환할 수 있다. 841 단계에서, 제1프로세서 801은 웨이크업 주기 계산 중지 요청을 제2프로 세서 803으로 전송할 수 있다. 예를 들면, 웨이크업 주기 계산 중지 요청은 제2프로세서 803에게 웨이크업 주기 를 계산하는 동작을 중지할 것을 요청하는 지시 메시지일 수 있다. 예를 들면, 제2프로세서 803은 웨이크업 주 기 계산 중지 요청을 수신하면, 웨이크업 주기 계산 동작을 중지할 수 있다. 843 단계에서, 제1프로세서 801은 수신된 패킷의 알림(notification)에 대한 전자 장치 100의 상태를 기반으로 무선랜 모듈 805의 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 801은 수신된 패킷에 대한 알림을 출력한 후, 미리 지정된 시간 동안에 전자 장치 100의 상태 변화를 검출할 수 있다. 그리고 제1프로세서 801은 검출된 전자 장치 100의 상태 변화를 기반으로 무선랜 모듈 805의 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 801은 전자 장치 100의 액티브/슬립 모드와 알림에 대한 전자 장치 100의 상태 변경과 전자 장치 100의 이동 속도를 기반으로 웨이크업 주기를 결정할 수 있다. 845 단계에서, 제1프로세서 801은 웨이크업 주기 변경 요청을 무선랜 모듈 805로 전송할 수 있다. 예를 들면, 웨이크업 주기 변경 요청은 무선랜 모듈 805의 웨이크업 주기를 변경할 것을 요청하는 지시 메시지일 수 있다. 예를 들면, 웨이크업 주기 변경 요청은 결정된 웨이크업 주기를 포함할 수 있다. 847 단계에서, 무선랜 모듈 805는 결정된 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 현재 웨이크업 주기가 50 ms이고, 결정된 웨이크업 주기가 200 ms인 경우, 무선랜 모듈 805는 웨이크업 주기를 50 ms로부터 200 ms로 변경하고, 변경된 200 ms에 따라 전원 절약 모드를 실행할 수 있다. 한 실시 예에 따르면, 제2프로세서 803은 전자 장치 100에서, 전자 장치의 다양한 구성에 따라 특정 모듈에 포 함되거나 개별적으로 존재할 수 있다. 예를 들면, 도 3과 같이, 제2프로세서 803은 무선랜 모듈 805에 포함될 수 있다. 다른 예로, 도 4와 같이, 제2프로세서 803은 센서 모듈에 포함될 수 있다. 또 다른 예로, 도 5와 같이, 제2프로세서 803은 제1프로세서 801에 포함될 수 있다. 또 다른 예로, 도 6과 같이, 제2프로세서 803은다른 모듈과 별개로 구성될 수 있다. 다른 실시 예에 따르면, 제2프로세서 803은 무선랜 모듈 805의 웨이크업 주기를 기반으로 액티브 모드와 슬립 모드를 전환할 수 있다. 예를 들면, 무선랜 모듈 805가 어웨이크 상태일 때, 제2프로세서 803은 액티브 모드이 며, 무선랜 모듈 805가 도즈 상태일 때, 슬립 모드일 수 있다. 예를 들면, 제2프로세서 803은 무선랜 모듈 805 가 어웨이크 상태일 때, 웨이크업 주기를 계산할 수 있다. 도 9는 본 발명의 다양한 실시 예에 따른 제1프로세서에서 무선랜 모듈의 웨이크업 주기를 제어하는 흐름도이다. 도 9를 참조하면, 901 단계에서, 제1프로세서 801은 무선랜 모듈 805를 이용하는 어플리케이션이 실행되는지 여 부를 확인할 수 있다. 예를 들면, 무선랜 모듈 805를 이용하는 어플리케이션은 사용자에 의해 또는 자동적으로 실행될 수 있다. 예를 들면, 무선랜 모듈 805를 이용하는 어플리케이션은 오디오 스트리밍 어플리케이션, 비디 오 스트리밍 어플리케이션, 인터넷 서비스를 제공하는 어플리케이션, 이메일 송/수신 서비스를 제공하는 어플리 케이션 또는 게임 서비스를 제공하는 어플리케이션 등이 될 수 있다. 확인 결과, 무선랜 모듈 805를 이용하는 어플리케이션이 실행되면, 제1프로세서 801은 903 단계로 진행하고, 그 렇지 않으면, 901 단계를 반복적으로 수행할 수 있다. 만약에, 903 단계로 진행하면, 제1프로세서 801은 무선랜 모듈 805에 전원을 공급하며, 전자 장치 100의 상태와 수신 신호 세기 중 적어도 하나를 기반으로 무선랜 모듈 805의 웨이크업 주기를 결정하고, 전원 절약 모드 전환 요청을 전송할 수 있다. 예를 들면, 제1프로세서 801은 현재 실행 중인 어플리케이션의 종류와 전자 장치 100의 액티브/슬립 모드와 전자 장치 100의 이동 속도를 기반으로 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프 로세서 801은 전원 절약 모드 전환 요청만을 전송할 수 있다. 다른 예로, 제1프로세서 801은 전원 절약 모드 전 환 요청과 함께 903 단계에서 결정된 웨이크업 주기를 함께 전송할 수 있다. 905 단계에서, 제1프로세서 801은 미리 지정된 시간 동안에 사용자 입력이 미발생되는지 여부를 확인할 수 있다. 예를 들면, 제1프로세서 801은 미리 지정된 시간 동안에 입력 모듈을 통해 입력이 수신되지 않으면, 사용 자 입력이 미발생한 것으로 결정할 수 있다. 확인 결과, 사용자 입력이 미발생되면, 제1프로세서 801은 907 단 계로 진행하고, 그렇지 않으면, 905 단계를 반복적으로 수행할 수 있다. 만약에, 907 단계로 진행하면, 제1프로세서 801은 슬립 모드 진입 알림을 무선랜 모듈 805로 전송하고, 웨이크 업 주기 계산 요청을 제2프로세서 803로 전송할 수 있다. 909 단계에서, 제1프로세서 801은 슬립 모드에 진입할 수 있다. 911 단계에서, 제1프로세서 801은 무선랜 모듈 805로부터 액티브 모드 진입 요청을 수신하는지 여부를 확인한다. 예를 들면, 액티브 모드 진입 요청은 외부로부터 패킷 수신에 의해 발생된 것일 수 있다. 확인 결과, 액티브 모드 진입 요청이 수신되면, 제1프로세서 801은 913 단계로 진행하고, 그렇지 않으면, 911 단계를 반복 적으로 수행할 수 있다. 만약에, 913 단계로 진행하면, 제1프로세서 801은 액티브 모드로 진입하고, 웨이크업 주기 계산 중지 요청을 제 2프로세서 803으로 전송할 수 있다. 915 단계에서, 제1프로세서 801은 수신된 패킷의 알림에 대한 전자 장치 100의 상태를 기반으로 무선랜 모듈 805의 웨이크업 주기를 결정하고, 무선랜 모듈 805에게 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 제1프로세서 801은 수신된 패킷에 대한 알림을 출력한 후, 미리 지정된 시 간 동안에 전자 장치 100의 상태 변화를 검출할 수 있다. 그리고 제1프로세서 801은 검출된 전자 장치 100의 상 태 변화를 기반으로 무선랜 모듈 805의 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 801은 전자 장치 100의 액티브/슬립 모드와 알림에 대한 전자 장치 100의 상태 변경과 전자 장치 100의 이동 속도를 기반으로 웨이크업 주기를 결정할 수 있다. 예를 들면, 웨이크업 주기 변경 요청 은 결정된 웨이크업 주기를 포함할 수 있다. 도 10은 본 발명의 제1실시 예에 따른 제1프로세서에서 웨이크업 주기를 결정하는 흐름도이다. 도 10을 참조하면, 1001 단계에서, 제1프로세서 801은 무선랜 모듈 805이 사용 중지되는지 여부를 확인할 수 있 다. 예를 들면, 제1프로세서 801은 미리 지정된 시간 동안에 데이터 패킷이 수신되지 않으면, 무선랜 모듈 805이 사용 중지된 것으로 결정할 수 있다. 확인 결과, 무선랜 모듈 805이 사용 중지되면, 제1프로세서 801은 1003 단계로 진행하고, 그렇지 않으면, 1005 단계로 진행할 수 있다. 만약에, 1003 단계로 진행하면, 제1프로세서 801은 무선랜 모듈 805에게 전원 절약 모드 전환 요청을 전송한 후, 웨이크업 주기를 결정하는 동작을 종료할 수 있다. 이와 달리, 1005 단계로 진행하면, 제1프로세서 801은 현재 실행된 어플리케이션의 종류를 확인할 수 있다. 1007 단계에서, 제1프로세서 801은 확인된 어플리케이션이 오디오 스트리밍 어플리케이션인지 여부를 확인할 수 있다. 확인된 어플리케이션이 오디오 스트리밍 어플리케이션인 경우, 제1프로세서 801은 1013 단계로 진행하고, 그렇지 않으면, 1009 단계로 진행할 수 있다. 만약에, 1009 단계로 진행하면, 제1프로세서 801은 확인된 어플리케이션이 비디오 스트리밍 어플리케이션인지 여부룰 확인할 수 있다. 확인 결과, 확인된 어플리케이션이 비디오 스트리밍 어플리케이션인 경우, 제1프로세서 801은 1011 단계로 진행하고, 그렇지 않으면, 웨이크업 주기를 결정하는 동작을 종료할 수 있다. 만약에, 1011 단계로 진행하면, 제1프로세서 801은 디스플레이가 오프되는지 여부를 확인할 수 있다. 예를 들면, 디스플레이의 오프는 사용자의 요청에 의해 또는 미리 지정된 시간 동안에 사용자의 요청이 입력되지 않 는 경우에 수행될 수 있다. 확인 결과, 디스플레이가 오프되면, 제1프로세서 801은 1013 단계로 진행하고, 그렇 지 않으면, 1017 단계로 진행할 수 있다. 만약에, 1013 단계로 진행하면, 제1프로세서 801은 현재 통신 중인 AP 110에 대한 수신 신호 세기를 확인할 수 있다. 1015 단계에서, 제1프로세서 801은 수신 신호 세기가 제1기준값 이상인지 여부를 확인할 수 있다. 예를 들면, 제1기준값은, 확인된 수신 신호 세기의 중간 레벨에 대응되는 값이 될 수 있다. 확인 결과, 수신 신호 세 기가 제1기준값 이상이면, 제1프로세서 801은 1019 단계로 진행하고, 그렇지 않으면, 1017 단계로 진행할 수 있 다. 만약에, 1019 단계로 진행하면, 제1프로세서 801은 컨텐츠의 평균 비트율(bit rate) 및 현재 전송 속도를 계산 할 수 있다. 예를 들면, 현재 실행 중인 어플리케이션이 오디오 스트리밍 어플리케이션인 경우, 오디오 컨텐츠 의 평균 비트율을 계산할 수 있다. 다른 예로, 현재 실행 중인 어플리케이션이 비디오 스트리임 어플레케이션인 경우, 비디오 컨텐츠의 평균 비트율을 계산할 수 있다. 컨텐츠의 종류에 따라 비트율이 가변적이거나 고정적일 수 있으므로, 평균 비트율을 기준으로 한다. 1021 단계에서, 제1프로세서 801은 현재 전송 속도가 평균 비트율보다 충분히 큰지 여부를 확인할 수 있다. 예 를 들면, 현재 전송 속도가 평균 비트율의 1.5배 이상미면, 제1프로세서 801는 현재 전송 속도가 평균 비트율보 다 충분히 크다고 결정할 수 있다. 확인 결과, 현재 전송 속도가 평균 비트율 이상이면, 제1프로세서 801은 1023 단계로 진행하고, 그렇지 않으면, 1017 단계로 진행할 수 있다. 만약에, 1017 단계로 진행하면, 제1프로세서 801은 무선랜 모듈 805을 어웨이크 상태로 유지할 것으로 결정할 수 있다. 예를 들면, 수신 신호 세기가 제1기준값 미만이면, 수신 신호 세기의 레벨이 중간 미만이라는 것을 의 미할 수 있다. 이와 같이, 수신 신호 세기의 레벨이 중간 미만이라면, AP 110과 전자 장치 100 간의 통신 상태 가 보통 미만이라고 볼 수 있다. 이와 같이, 통신 상태가 보통 미만인 경우, 웨이크업 주기를 변경하는 것은 현 재 제공중인 컨텐츠 서비스의 품질을 떨어뜨릴 수 있으므로, 무선랜 모듈 805의 상태를 어웨이크 상태로 유지하 는 것이 바람직할 수 있다. 다른 예로, 현재 전송 속도가 평균 비트율보다 충분히 크지 않으면, 현재 전송 속도와 평균 비트율이 유사하다 고 볼 수 있다. 이와 같이, 현재 전송 속도와 평균 비트율이 유사한 경우, 웨이크업 주기를 변경하는 것은 현재 제공중인 컨텐츠 서비스의 품질을 떨어뜨릴 수 있으므로, 무선랜 모듈 805의 상태를 어웨이크 상태로 유지하는 것이 바람직할 수 있다. 만약에, 1023 단계로 진행하면, 제1프로세서 801은 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 801은 현재 전송 속도와 평균 비트율을 기반으로 웨이크업 주기를 결정할 수 있다. 예를 들면, 컨텐츠의 평균 비트율이 200KB/sec이고, 현재 전송 속도가 1MB/sec인 경우, 1MB의 컨텐츠로 총 5초 동안의 컨텐츠를 버퍼링할 수 있다. 즉, 1초의 컨텐츠 분량을 버퍼링하기 위해서는 200 ms가 필요하다. 이러한 경우, 비콘 주기가 500 ms 로 설정되더라도, 1초의 컨텐츠(200 KB의 데이터)를 수신한 후 300 ms의 시간적인 여유가 있으므로, 스트리밍의 끊김 현상 등에 의한 서비스 품질을 해치지 않으면서 기기의 소모전력을 줄일 수 있다. 따라서, 제1프로세서 801은 비콘 주기를 500 ms로 결정하고, 결정된 비콘 주기를 기반으로 웨이크업 주기를 변경할 수 있다. 1025 단계에서, 제1프로세서 801은 무선랜 모듈 805로 전원 절약 모드 전환 요청을 전송할 수 있다. 예를 들면, 제1프로세서 801은 결정된 웨이크업 주기와 전원 절약 모드 전환 요청을 함께 전송할 수 있다. 도 11은 본 발명의 제2실시 예에 따른 제1프로세서에서 웨이크업 주기를 결정하는 흐름도이다. 도 11을 참조하면, 1101 단계에서, 제1프로세서 801은 수신된 패킷에 대한 알림을 출력할 수 있다. 예를 들면, 제1프로세서 801은 메모리 313으로부터 현재 수신된 패킷을 검출하고, 검출된 패킷이 영상 데이터인 경우, 디스 플레이에 표시할 수 있다. 다른 예로, 제1프로세서 801은 메모리 313으로부터 현재 수신된 패킷을 검출하고, 검 출된 패킷이 음성 데이터인 경우, 스피커를 통해 출력할 수 있다. 예를 들면, 도 17과 같이, 제1프로세서 801은 전자 장치 1701의 디스플레이에 알림 1703을 표시할 수 있다. 1103 단계에서, 제1프로세서 801은 디스플레이가 오프되거나 오프된 상태인지 여부를 확인할 수 있다. 예를 들 면, 디스플레이의 오프는 디플레이의 전원이 꺼지는 것을 의미할 수 있다. 예를 들면, 디스플레이 오프는 사용 자의 요청에 의해 또는 미리 지정된 시간 동안에 사용자의 입력이 미발생되는 경우에 수행될 수 있다. 확인 결 과, 디스플레이가 오프되거나 오프된 상태이면, 제1프로세서 801은 1105 단계로 진행하고, 그렇지 않으면, 1103 단계를 반복적으로 수행할 수 있다. 만약에, 1105 단계로 진행하면, 제1프로세서 801은 알림이 무시되거나 미리 지정된 시간 동안에 입력이 미발생 되는지 여부를 확인할 수 있다. 예를 들면, 도 17의 1705 화면과 같이, 디스플레이가 오프된 후, 미리 지정된 시간 동안에 사용자 입력이 수신되지 않으면, 제1프로세서 801은 입력이 미발생된 것으로 결정할 수 있다. 다른 예로, 사용자에 의해 알림을 무시하는 제스처가 입력되면, 제1프로세서 801은 알림이 무시된 것으로 결정할 수 있다. 예를 들면, 도 17과 같이, 알림을 출력한 후, 사용자 의해 전자 장치 100이 뒤집어지는 제스처가 감지되 면, 제1프로세서 801은 알림이 무시된 것으로 결정할 수 있다. 예를 들면, 사용자의 제스처는 센서 모듈 307에 의해 감지될 수 있다. 확인 결과, 알림이 무시되거나 입력이 미발생되면, 제1프로세서 801은 1107 단계로 진행하고, 그렇지 않으면, 1109 단계로 진행할 수 있다. 만약에, 1107 단계로 진행하면, 제1프로세서 801은 웨이크업 주기를 최대 크기로 결정하고 무선랜 모듈에게 웨 이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 제1프로세서 801은 최대 크기를 가지는 웨이크업 주기와 함께 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 최대 크기는 미리 지정된 값일 수 있다. 예를 들 면, 최대 크기는 1초일 수 있다. 예를 들면, 제1프로세서 801은 비콘 주기를 최대 크기로 결정하고, 결정된 비 콘 주기를 기반으로 웨이크업 주기를 결정할 수 있다. 만약에, 1109 단계로 진행하면, 제1프로세서 801은 통신 중인 AP 110에 대한 수신 신호 세기를 확인할 수 있다. 1111 단계에서, 제1프로세서 801은 수신 신호 세기가 미리 지정된 제2기준값을 초과하는지 여부를 확인할 수 있 다. 예를 들면, 제2기준값은 확인된 수신 신호 세기의 중간 레벨에 대응되는 값이 될 수 있다. 확인 결과, 수신 신호 세기가 제2기준값을 초과하면, 제1프로세서 801은 1113 단계로 진행하고, 그렇지 않으면, 1119 단계로 진 행할 수 있다. 만약에, 1113 단계로 진행하면, 제1프로세서 801은 전자 장치 100가 이동 중인지 여부를 확인할 수 있다. 예를 들면, 제1프로세서 801은 수신 신호 세기의 변경을 기반으로 전자 장치 100의 이동 여부를 확인할 수 있다. 예 를 들면, 이전에 수신된 신호에 대한 제1수신 신호 세기와 현재 수신된 신호에 대한 제2수신 신호 세기가 다르 면, 제1프로세서 801은 전자 장치 100이 이동 중인 것으로 결정할 수 있다. 다른 예로, 제1수신 신호 세기와 제 2수신 신호 세기가 동일하면, 제1프로세서 801은 전자 장치 100이 이동하고 있지 않다고 결정할 수 있다. 다른 예로, 제1프로세서 801은 센서 모듈 307에 포함된 가속도 센서를 이용하여 전자 장치 100이 이동 중인지 여부를 확인할 수 있다. 예를 들면, 가속도 센서는 가속도 센서의 값을 모니터링하여 버퍼(예: 메모리 313)에 저장하고, 제1프로세서 801은 버퍼에 저장된 가속도 센서의 값을 기반으로 전자 장치 100의 이동 여부를 확인할 수 있다. 또 다른 예로, 제1프로세서 801은 위성 항법 시스템 모듈을 이용하여 전자 장치 100이 이동 중인지 여 부를 확인할 수 있다. 확인 결과, 전자 장치 100이 이동 중이면, 제1프로세서 801은 1115 단계로 진행하고, 그렇지 않으면, 1117 단계 로 진행할 수 있다. 만약에, 1115 단계로 진행하면, 제1프로세서 801은 전자 장치 100의 이동 속도를 확인할 수 있다. 예를 들면, 제1프로세서 801은 센서 모듈 307에 포함된 가속도 센서를 기반으로 전자 장치 100의 이동 속도를 계산할 수 있다. 다른 예로, 제1프로세서 801은 수신 신호 세기를 기반으로 전자 장치 100의 이동 거리를 계산하고, 계산된 이동 거리를 기반으로 전자 장치 100의 이동 속도를 계산할 수 있다. 또 다른 예로, 제1프로 세서 801은 위성 항법 시스템 모듈을 이용하여 전자 장치 100의 이동 거리를 계산하고, 계산된 이동 거리를 기 반으로 전자 장치 100의 이동 속도를 계산할 수 있다. 그리고 제1프로세서 801은 확인된 이동 속도가 제3기준값을 초과하거나 수신 신호 세기가 제4기준값 미만인지 여부를 확인할 수 있다. 예를 들면, 제3기준값은 사용자의 달리기 또는 자전거/자동차 탑승을 기반으로 결정될 수 있다. 예를 들면, 제4기준값은 AP 110의 수신 범위를 벗어났을 때의 수신 신호 세기를 기반으로 결정될 수 있다. 확인 결과, 확인된 이동 속도가 제3기준값을 초과하거나 수신 신호 세기가 제4기준값 미만인 경우, 제1프로세서 801은 1119 단계로 진행하고, 그렇지 않으면, 1117 단계로 진행할 수 있다. 만약에, 1117 단계로 진행하면, 제1프로세서 801은 웨이크업 주기를 결정하고, 무선랜 모듈 805에게 웨이크업 주기 변경 요청을 전송할 수 있다. 이때, 제1프로세서 801은 전자 장치 100가 정지 중이거나 낮은 이동 속도로 이동 중이면서 AP 110의 셀 111 내에 존재하는 것으로 결정한 후, 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 801은 현재 웨이크업 주기를 두 배로 증가함으로써 새로운 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 801은 웨이크업 주기 변경 요청과 결정된 웨이크업 주기를 함께 전송할 수 있다. 만약에, 1119 단계로 진행하면, 제1프로세서 801은 미리 지정된 액티브 웨이크업 주기로 웨이크업 주기를 결정 하고, 무선랜 모듈에게 웨이크업 주기 변경 요청을 전송할 수 있다. 이때, 제1프로세서 801은 전자 장치 100가 AP 110과의 수신 신호 세기가 보통 이하이거나 빠른 속도로 이동 중이거나 AP 110의 셀 111을 벗어난 것으로 결 정한 후, 웨이크업 주기를 결정할 수 있다. 예를 들면, 제1프로세서 801은 웨이크업 주기 변경 요청을 전송할 수 있다. 다른 예로, 제1프로세서 801은 웨이크업 주기 변경 요청과 액티브 웨이크업 주기에 따라 전원 절약 모 드를 실행할 것을 요청하는 지시자를 함께 전송할 수 있다. 도 12는 본 발명의 다양한 실시 예에 따른 제2프로세서에서 무선랜 모듈의 웨이크업 주기를 제어하는 흐름도이 다. 도 12를 참조하면, 1201 단계에서, 제2프로세서 803은 제1프로세서로부터 웨이크업 주기 계산 요청을 수신하는 지 여부를 확인할 수 있다. 확인 결과, 웨이크업 주기 계산 요청을 수신하면, 제2프로세서 803은 1203 단계로 진행하고, 그렇지 않으면, 1201 단계를 반복적으로 수행할 수 있다. 만약에, 1203 단계로 진행하면, 제2프로세서 803은 전자 장치 100의 상태와 수신 신호 세기 중 적어도 하나를 기반으로 무선랜 모듈 805의 웨이크업 주기를 결정하고, 웨이크업 주기 변경 요청을 무선랜 모듈 805로 전할 수 있다. 예를 들면, 제2프로세서 803은 전자 장치 100의 이동 속도와 수신 신호 세기를 기반으로 웨이크업 주기를 결정할 수 있다. 예를 들면, 웨이크업 주기 변경 요청은 결정된 웨이크업 주기를 포함할 수 있다. 1205 단계에서, 제2프로세서 803은 제1프로세서 801로부터 웨이크업 주기 계산 중지 요청을 수신하는지 여부를 확인할 수 있다. 확인 결과, 웨이크업 주기 계산 중지 요청이 수신되면, 제2프로세서 803은 1207 단계로 진행하 고, 그렇지 않으면, 1205 단계를 반복적으로 수행할 수 있다. 만약에, 1207 단계로 진행하면, 제2프로세서 803은 웨이크업 주기를 계산하는 동작을 중지할 수 있다. 한 실시 예에 따르면, 제2프로세서 803은 무선랜 모듈 805의 웨이크업 주기를 기반으로 액티브 모드와 슬립 모 드를 전환할 수 있다. 예를 들면, 무선랜 모듈 805가 어웨이크 상태일 때, 제2프로세서 803은 액티브 모드이며, 무선랜 모듈 805가 도즈 상태일 때, 슬립 모드일 수 있다. 예를 들면, 제2프로세서 803은 무선랜 모듈 805가 어 웨이크 상태일 때, 웨이크업 주기를 계산할 수 있다. 도 13은 본 발명의 다양한 실시 예에 따른 제2프로세서에서 웨이크업 주기를 결정하는 흐름도이다. 도 13을 참조하면, 1301 단계에서, 제2프로세서 803은 통신 중인 AP 110의 수신 신호 세기를 확인할 수 있다. 1303 단계에서, 제2프로세서 803은 수신 신호 세기가 미리 지정된 제2기준값을 초과하는지 여부를 확인할 수 있 다. 예를 들면, 제2기준값은 확인된 수신 신호 세기의 중간 레벨에 대응되는 값이 될 수 있다. 확인 결과, 수신 신호 세기가 제2기준값을 초과하면, 제2프로세서 803은 1305 단계로 진행하고, 그렇지 않으면, 1309 단계로 진행할 수 있다. 만약에, 1305 단계로 진행하면, 제2프로세서 803은 전자 장치 100가 이동 중인지 여부를 확인할 수 있다. 예를 들면, 제2프로세서 803은 수신 신호 세기의 변경을 기반으로 전자 장치 100의 이동 여부를 확인할 수 있다. 예 를 들면, 이전에 수신된 신호에 대한 제1수신 신호 세기와 현재 수신된 신호에 대한 제2수신 신호 세기가 다르 면, 제2프로세서 803은 전자 장치 100이 이동 중인 것으로 결정할 수 있다. 다른 예로, 제1수신 신호 세기와 제 2수신 신호 세기가 동일하면, 제2프로세서 803은 전자 장치 100이 이동하고 있지 않다고 결정할 수 있다. 다른 예로, 제2프로세서 803은 센서 모듈 307에 포함된 가속도 센서를 이용하여 전자 장치 100이 이동 중인지 여부를 확인할 수 있다. 예를 들면, 가속도 센서는 가속도 센서의 값을 모니터링하여 버퍼(예: 메모리 313)에 저장하고, 제2프로세서 803은 버퍼에 저장된 가속도 센서의 값을 기반으로 전자 장치 100의 이동 여부를 확인할 수 있다. 또 다른 예로, 제2프로세서 803은 위성 항법 시스템 모듈을 이용하여 전자 장치 100이 이동 중인지 여 부를 확인할 수 있다. 확인 결과, 전자 장치 100이 이동 중이면, 제2프로세서 803은 1307 단계로 진행하고, 그렇지 않으면, 1311 단계 로 진행할 수 있다. 만약에, 1307 단계로 진행하면, 제2프로세서 803은 전자 장치 100의 이동 속도를 확인할 수 있다. 예를 들면, 제2프로세서 803은 센서 모듈 307에 포함된 가속도 센서를 기반으로 전자 장치 100의 이동 속 도를 계산할 수 있다. 다른 예로, 제2프로세서 803은 수신 신호 세기를 기반으로 전자 장치 100의 이동 거리를 계산하고, 계산된 이동 거리를 기반으로 전자 장치 100의 이동 속도를 계산할 수 있다. 또 다른 예로, 제2프로 세서 803은 위성 항법 시스템 모듈을 이용하여 전자 장치 100의 이동 거리를 계산하고, 계산된 이동 거리를 기 반으로 전자 장치 100의 이동 속도를 계산할 수 있다. 그리고 제2프로세서 803은 확인된 이동 속도가 제3기준값을 초과하거나 수신 신호 세기가 제4기준값 미만인지 여부를 확인할 수 있다. 예를 들면, 제3기준값은 사용자의 달리기 또는 자전거/자동차 탑승을 기반으로 결정될 수 있다. 예를 들면, 제4기준값은 AP 110의 수신 범위를 벗어났을 때의 수신 신호 세기를 기반으로 결정될 수 있다. 확인 결과, 확인된 이동 속도가 제3기준값을 초과하거나 수신 신호 세기가 제4기준값 미만인 경우, 제2프로세서 803은 1309 단계로 진행하고, 그렇지 않으면, 1311 단계로 진행할 수 있다. 만약에, 1309 단계로 진행하면, 제2프로세서 803은 미리 지정된 액티브 웨이크업 주기로 웨이크업 주기를 결정 하고, 무선랜 모듈에게 웨이크업 주기 변경 요청을 전송할 수 있다. 이때, 제2프로세서 803은 전자 장치 100가 AP 110과의 수신 신호 세기가 보통 이하이거나 빠른 속도로 이동 중이거나 AP 110의 셀 111을 벗어난 것으로 결 정한 후, 웨이크업 주기를 결정할 수 있다. 예를 들면, 제2프로세서 803은 웨이크업 주기 변경 요청을 전송할 수 있다. 다른 예로, 제2프로세서 803은 웨이크업 주기 변경 요청과 액티브 웨이크업 주기에 따라 전원 절약 모 드를 실행할 것을 요청하는 지시자를 함께 전송할 수 있다. 또 다른 예로, 제2프로세서 803은 웨이크업 주기 변 경 요청과 액티브 웨이크업 주기를 함께 전송할 수 있다. 만약에, 1311 단계로 진행하면, 제2프로세서 803은 비콘 카운트를 확인할 수 있다. 예를 들면, 비콘 카운트는 슬립 모드에서 도즈 상태로부터 전환하는 웨이크업의 횟수를 의미할 수 있다. 예를 들면, 비콘 카운트가 1이라 는 것은 슬립 모드에서 첫번째로 웨이크업을 수행한다는 의미일 수 있다. 1313 단계에서, 제2프로세서 803은 비콘 카운트가 1인지 여부를 확인할 수 있다. 만약에, 비콘 카운트가 1이면, 제2프로세서 803은 1315 단계로 진행하고, 그렇지 않으면, 1317 단계로 진행할 수 있다. 예를 들면, 웨이크업 주기 계산 요청이 수신되면, 제2프로세서 803은 비콘 카운트를 카운팅할 수 있다. 만약에, 1315 단계로 진행하면, 제2프로세서 803은 웨이크업 주기를 디폴트 슬립 웨이크업 주기로 결정하고 무 선랜 모듈에게 웨이크업 주기 변경 요청을 전송할 수 있다. 이때, 제2프로세서 803은 슬립 모드에서 웨이크업이 첫번째로 수행되는 것으로 결정한 후, 웨이크업 주기를 디폴트 슬립 웨이크업 주기로 결정할 수 있다. 예를 들 면, 제2프로세서 803은 웨이크업 주기 변경 요청만을 전송할 수 있다. 다른 예로, 제2프로세서 803은 웨이크업 주기 변경 요청과 디폴트 슬립 웨이크업 주기에 따라 전원 절약 모드를 실행할 것을 요청하는 지시자를 함께 전 송할 수 있다. 또 다른 예로, 제2프로세서 803은 웨이크업 주기 변경 요청과 디폴트 슬립 웨이크업 주기를 함께 전송할 수 있다. 만약에, 1317 단계로 진행하면, 제2프로세서 803은 웨이크업 주기를 결정할 수 있다. 예를 들면, 제2프로세서 803은 현재 웨이크업 주기를 두 배로 증가함으로써 새로운 웨이크업 주기를 결정할 수 있다. 예를 들면, 제2프 로세서 803은 현재 웨이크업 주기의 DTIM 주기 및 비콘 주기 중 적어도 하나를 두 배로 증가시키고, 증가된DTIM 주기 및 비콘 주기 중 하나를 기반으로 웨이크업 주기를 결정할 수 있다. 1319 단계에서, 제2프로세서 803은 결정된 웨이크업 주기가 미리 지정된 최대 주기 이하인지 여부를 확인할 수 있다. 확인 결과, 결정된 웨이크업 주기가 최대 주기 이하이면, 1321 단계로 진행하고, 그렇지 않으면, 웨이크 업 주기를 결정하는 동작을 종료할 수 있다. 만약에 1321 단계로 진행하면, 제2프로세서 803은 무선랜 모듈 805에게 웨이크업 주기 변경 요청을 전송할 수 있다. 예를 들면, 제2프로세서 803은 웨이크업 주기 변경 요청과 결정된 웨이크업 주기를 함께 전송할 수 있다. 도 14a 및 14b는 본 발명의 다양한 실시 예에 따른 무선랜 모듈에서 웨이크업 주기에 따라 전원 절약 모드를 실 행하는 흐름도이다. 도 14a 및 14b를 참조하면, 1401 단계에서, 무선랜 모듈 805는 전원을 공급받아 전원이 온(on)될 수 있다. 예를 들면, 전원은, 제1프로세서 801의 제어에 따라 공급될 수 있다. 1403 단계에서, 무선랜 모듈 805는 제1프로세서 801로부터 전원 절약 모드 전환 요청을 수신하는지 여부를 확인 할 수 있다. 예를 들면, 전원 절약 모드 전환 요청은 제1프로세서 801에 의해 결정된 웨이크업 주기와 함께 수 신될 수 있다. 확인 결과, 전원 절약 모드 전환 요청이 수신되면, 무선랜 모듈 805는 1405 단계로 진행하고, 그 렇지 않으면, 1403 단계를 반복적으로 수행할 수 있다. 1405 단계로 진행하면, 무선랜 모듈 805는 전원 절약 모드를 실행할 수 있다. 예를 들면, 전원 절약 모드 전환 요청만 수신되는 경우, 무선랜 모듈 805는 미리 지정된 액티브 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 다른 예로, 전원 절약 모드 전환 요청과 결정된 웨이크업 주기가 함께 수신되는 경우, 무선랜 모듈 805는 결정된 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 1407 단계에서, 무선랜 모듈 805는 제1프로세서 801로부터 슬립 모드 진입 알림을 수신하는지 여부를 확인할 수 있다. 확인 결과, 슬립 모드 진입 알림이 수신되면, 제1프로세서 801은 1409 단계로 진행하고, 그렇지 않으면, 1407 단계를 반복적으로 수행할 수 있다. 만약에, 1409 단계로 진행하면, 무선랜 모듈 805는 미리 지정된 디폴트 슬립 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 디폴트 슬립 웨이크업 주기가 100 ms인 경우, 무선랜 모듈 805는 100 ms 마 다 도즈 상태로부터 어웨이크 상태로 전환할 수 있다. 1411 단계에서, 무선랜 모듈 805는 제2프로세서 803으로부터 웨이크업 주기 변경 요청을 수신하는지 여부를 확 인할 수 있다. 예를 들면, 웨이크업 주기 변경 요청은 제2프로세서 803에 의해 결정된 웨이크업 주기와 함께 수 신될 수 있다. 확인 결과, 웨이크업 주기 변경 요청이 수신되면, 무선랜 모듈 805는 1413 단계로 진행하고, 그 렇지 않으면, 1415 단계로 진행할 수 있다. 만약에, 1413 단계로 진행하면, 무선랜 모듈 805는 결정된 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 현재 웨이크업 주기가 100 ms이고, 결정된 웨이크업 주기가 200 ms인 경우, 무선랜 모듈 805 는 웨이크업 주기를 100 ms로부터 200 ms로 변경하고, 변경된 200 ms에 따라 전원 절약 모드를 실행할 수 있다. 1415 단계로 진행하면, 무선랜 모듈 805는 외부로부터 패킷을 수신하는지 여부를 확인할 수 있다. 예를 들면, AP 110과 통신 중인 경우, 무선랜 모듈 805는 AP 110으로부터 데이터가 수신되는지 여부를 확인할 수 있다. 확 인 결과, 외부로부터 패킷이 수신되면, 무선랜 모듈 805는 1417 단계로 진행할 수 있고, 그렇지 않으면, 1415 단계를 반복적으로 수행할 수 있다. 1417 단계에서, 무선랜 모듈 805는 제1프로세서 801로 액티브 모드 진입 요청을 전송할 수 있다. 1419 단계에서, 무선랜 모듈 805는 미리 지정된 액티브 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예 를 들면, 액티브 웨이크업 주기가 50 ms인 경우, 무선랜 모듈 805는 50 ms마다 도즈 상태로부터 어웨이크 상태 로 전환할 수 있다. 1421 단계에서, 무선랜 모듈 805는 제1프로세서 801로부터 웨이크업 주기 변경 요청을 수신하는지 여부를 확인 할 수 있다. 예를 들면, 무선랜 모듈 805는 웨이크업 주기 변경 요청과 함께 제1프로세서 801에 의해 결정된 웨 이크업 주기를 수신할 수 있다. 확인 결과, 웨이크업 주기 변경 요청이 수신되면, 무선랜 모듈 805는 1423 단계 로 진행하고, 그렇지 않으면, 1421 단계를 반복적으로 수행할 수 있다.만약에, 1423 단계로 진행하면, 무선랜 모듈 805는 결정된 웨이크업 주기에 따라 전원 절약 모드를 실행할 수 있다. 예를 들면, 결정된 웨이크업 주기가 200 ms인 경우, 무선랜 모듈 805는 200 ms마다 도즈 상태로부터 어웨 이크 상태로 전환할 수 있다. 도 15는 본 발명의 다양한 실시 예에 따라 AP들 간에 핸드오버를 실행하는 전자 장치를 도시한 도면이다. 도 15를 참조하면, 통신 시스템은 AP1 1510, AP2 1520 및 AP3 1530과 전자 장치 1500을 포함할 수 있다. AP1 1510, AP2 1520 및 AP3 1530은 셀1 1511, 셀2 1521 및 셀3 1531을 각각 가지며, 자신의 셀 내에 위치하는 전자 장치 1500과 통신을 수행할 수 있다. AP1 1510, AP2 1520 및 AP3 1530은 핸드오버가 가능하도록 인접하여 설치될 수 있다. 전자 장치 1500가 셀1 1511로부터 셀2 1521로 이동하는 경우, 전자 장치 1500의 제1프로세서 301, 제2프로세서 305 또는 무선랜모듈 303은 현재 접속 중인 AP(예: AP1 1510)와 동일한 SSID를 가지는 AP(예: AP2 1520)로 핸 드오버할 수 있다. 그러나 핸드오버가 불가능한 경우, 제1프로세서 301, 제2프로세서 305 또는 무선랜모듈 303은 어웨이크 상태에 서 사용하는 웨이크업 주기마다 수신 신호 세기(예: RSSI)를 모니터링함으로써 AP1 1510과의 연결이 해제되는지 여부를 확인할 수 있다. 만일, AP1 1510과 연결이 끊긴 후에, 전자 장치 1500이 동일한 속도로 이동하는 경우, 제1프로세서 301, 제2프로세서 305 또는 무선랜모듈 303은 새로운 AP와의 연결을 위한 AP 스캐닝 주기를 늘림으 로써 불필요한 AP 연결 해제를 방지할 수 있다. 예를 들면, 전자 장치 1500의 사용자가 무선랜 핸드오버 기능을 포함하는 AP 밀집 지역을 도보로 이동한다면, 전자 장치 1500은 무선랜 핸드오버 기능을 이용하여 AP 간에 핸드오버를 수행함으로써 무선랜/이동통신(3G/LTE) 간의 전환을 방지할 수 있다. 이에 따라, 전자 장치 1500은 배터리의 전력 소모를 줄일 수 있다. 다른 예로, 전자 장치 1500의 사용자가 달리거나 자전거/차량 탑승으로 인하여 전자 장치 1500가 빠른 속도로 이동하는 경우, 전자 장치 1500과 현재 연결된 AP의 접속은 곧 해제되거나 전자 장치 1500과 새로이 연결된 AP 의 접속도 수신 신호 세기(예: RSSI)가 낮아져 곧 해제될 것이다. 이러한 경우, 제1프로세서 303, 제2프로세서 305 또는 무선랜모듈 303은 어웨이크 상태의 웨이크업 주기(비콘 주기 및 DTIM 주기)를 이용하여 현재 연결된 AP와의 끊김을 미리 감지하고, 연결 가능한 새로운 AP를 스캐닝하는 동작을 수행하지 않거나 스캐닝 주기를 늘 림으로써 빈번한 무선랜/무선이동통신(3G/LTE)간의 전환을 줄일 수 있다. 이에 따라, 전자 장치 1500은 전력 소 모를 줄일 수 있다. 도 16은 본 발명의 다양한 실시 예에 따라 AP와 일정 속도를 유지하는 전자 장치를 도시한 도면이다. 도 16을 참조하면, AP 1603은 차량(예: 버스, 자가용, 지하철, 비행기, 배 등) 내에 위치하고, 전자 장치 1601 은 차량 내에 위치할 수 있다. 차량 또는 사용자에 의해 전자 장치 1601가 이동하는 경우, 제1프로세서 303, 제2프로세서 305 또는 무선랜모듈 303은 전자 장치 1601의 이동 속도와 AP 1603 간의 상대 속도를 기반으로 웨이크업 주기(비콘 주기와 DTIM 주기 중에서 적어도 하나)를 제어할 수 있다. 전자 장치 1601의 이동 여부는 여러 가지 방법을 이용하여 확인될 수 있다. 예를 들면, 전자 장치 1601의 이동 여부는 수신 신호 세기(RSSI)의 변화를 기반으로 결정될 수 있다. 다른 예로, 전자 장치 1601이 슬립 모드에 진 입한 경우, 센서 모듈 307이 활성화되어 있으면, 전자 장치 1601은 전자 장치 1601의 이동 여부를 센서 모듈 307을 이용하여 결정할 수 있다. 예를 들면, 센서 모듈 307이 가속도 센서의 값을 모니터링하여 버퍼(예: 메모 리 313)에 저장하는 경우, 제2프로세서 305는 저장된 가속도 센서의 값을 이용하여 전자 장치 1601의 이동 여부 를 결정할 수 있다. 또 다른 예로, 만약에, 스포츠 트래킹 어플리케이션이 사용되면서 전자 장치 1601이 이동되 는 경우, 센서 모듈 307이 GPS 신호를 수신하여 이동 속도를 계산할 수 있다. 이러한 경우, 제2프로세서 305는 GPS의 좌표값이나 좌표값을 기반으로 계산된 속도값을 이용하여 전자 장치 1601의 이동 여부를 결정할 수 있다. 전자 장치 1601이 이동하는 중에 AP 1603의 수신 신호 세기가 감소하지 않는다면, 제1프로세서 301 또는 제2프 로세서 305는 전자 장치 1601과 AP 1603이 동일한 속도로 이동하는 것으로 결정할 수 있다. 이러한 경우, 제1프 로세서 301 또는 제2프로세서 305는 전자 장치 1601가 정지한 것으로 가정하고, 웨이크업 주기(비콘 주기와DTIM 주기 중 적어도 어느 하나)를 결정할 수 있다. 지금까지, 도 15와 16을 참고하여, 제1프로세서 301 또는 제2프로세서 305가 전자 장치 100의 이동 속도와 AP 110의 수신 신호 세기를 기반으로 무선랜 모듈 303의 웨이크업 주기를 결정하는 것을 설명하였다. 한 실예에서, 제1프로세서 301 또는 제2프로세서 305는 전자 장치 100의 이동 속도와 AP 110의 수신 신호 세기 뿐만 아니라, 디스플레이의 켜짐/꺼짐(on/off), 전자 장치 100 또는 어플리케이션별 네트워크 사용 정보(예: 사 용빈도, 사용률), 어플리케이션의 특성 및 알림에 대한 전자 장치 100의 상태 변화 중 적어도 하나를 기반으로 무선랜 모듈 303의 웨이크업 주기를 결정할 수 있다. 예를 들면, 현재 사용중인(또는, 최근에 사용한) 어플리케이션이 무선랜/무선통신 네트워크의 사용 빈도가 낮은 어플리케이션인 경우, 전자 장치 100은 무선랜/무선이동통신을 이용하여 패킷을 수신할 확률이 낮다고 결정할 수 있다. 이러한 경우, 전자 장치 100은 무선랜 모듈 303의 웨이크업 주기를 증가시킬 수 있다. 다른 예로, 현 재 사용중인 어플리케이션이 무선랜/무선통신 네트워크의 사용 빈도가 높은 어플리케이션인 경우, 전자 장치 100은 무선랜/무선통신 네트워크를 통하여 패킷을 받을 확률이 높다고 결정할 수 있다. 이러한 경우, 전자 장치 100은 무선랜 모듈 303의 웨이크업 주기를 유지하거나 감소시킬 수 있다. 따라서, 전자 장치 100은 어플리케이 션 별 네트워크 사용률과 어플리케이션 특성을 기반으로 무선랜 모듈 303의 웨이크업 주기를 제어할 수 있다. 다른 실시 예에서, 전자 장치 100은 현재 사용중인 어플리케이션의 네트워크 사용률과 네트워크 사용 이력을 기 반으로 무선랜 모듈 305의 웨이크업 주기를 결정할 수 있다. 예를 들면, 현재 사용중인 어플리케이션이 웹 브라우저인 경우, 웹 브라우저는 무선랜 모듈 305를 통하여 URI(Uniform Resource Identifier)를 요청하여 수신할 수 있다. 수신 완료 후에, 해당 웹 브라우저가 웹 소켓 통신을 이용하여 서버와 데이터를 송/수신하거나 수시로 화면을 갱신하지 않는 경우, 사용자가 명시적으로 다른 URI를 요청할 때까지 전자 장치 100은 무선랜 모듈 305를 사용하지 않을 것이다. 이러한 경우, 전자 장치 100은 웨이크업 주기(비콘 주기와 DTIM 주기 중 적어도 하나)를 증가시킬 수 있다. 왜냐하면, 패킷 전달의 지연이 발 생할 확률이 낮을 수 있다. 다른 실시 예에서, 현재 실행중인 어플리케이션이 무선 네트워크 사용량이 많은 경우, 전자 장치 100은 어플리 케이션의 특정을 기반으로 웨이크업 주기를 조절할 수 있다. 예를 들면, 현재 실행중인 어플리케이션이 빈번하게 무선 네트워크를 사용하는 경우, 전자 장치 100은 미리 지 정된 시간 동안 웨이크업 주기를 증가시키지 않을 수 있다. 예를 들면, 현재 실행 중인 어플리케이션이 메시징 어플리케이션이며, 메시징 어플리케이션이 빈번하게 사용되는 경우, 전자 장치 100은 디스플레이가 오프된 상태 라 하더라도, 무선랜 모듈 303을 통해 새로운 메시지를 수신할 확률이 높다고 결정할 수 있다. 이러한 경우, 제 1프로세서 301이 슬립 모드에 진입한다 하더라도, 제2프로세서 304는 메시지 응답성을 해치지 않기 위해, 미리 지정된 시간 동안 웨이크업 주기를 증가시키지 않고, 그 이후에 웨이크업 주기를 점차 증가시킬 수 있다. 도 17은 본 발명의 다양한 실시 예에 따라 수신된 패킷의 알림에 대한 전자 장치의 상태 변화을 도시한 도면이 다. 전자 장치 100은 알림에 대한 전자 장치 100의 상태 변화를 기반으로 웨이크업 주기를 조절할 수 있다. 예를 들 면, 제1프로세서 301가 슬립 모드에 진입한 상태에서 무선랜 모듈 303이 패킷을 수신하면, 수신된 패킷을 메모 리 313에 저장하고, 액티브 모드 진입 요청을 제1프로세서 301로 전송할 수 있다. 그리고 제1프로세서 301은 액 티브 모드 진입 요청에 따라 슬립 모드로부터 액티브 모드로 전환하고, 메시지 313에 저장된 패킷을 수신하고, 수신된 패킷에 대응되는 알림을 출력할 수 있다. 예를 들면, 수신된 패킷은 메시지(SMS 또는 MMS), 콜(Call), 이메일, 광고 등이 될 수 있다. 예를 들면, 알림은 메시지 수신 알림, 콜 수신 알림, 이메일 수신 알림, 광고 수신 알림 등이 될 수 있다. 예를 들면, 패킷이 메시 지인 경우, 전자 장치 1701은 디스플레이에 메시지 내용 1703을 표시할 수 있다. 알림이 미리 지정된 시간 동안에 사용자에 의해 확인되지 않거나 무시되는 경우, 제1프로세서 301은 미리 지정 된 시간이 경과한 시점에서 사용자가 전자 장치 100를 사용하고 있지 않거나 휴대하고 있지 않다고 결정할 수있다. 예를 들면, 1705와 같이, 디스플레이가 오프된 후, 미리 지정된 시간 동안에 사용자의 입력이 수신되지 않으면, 제1프로세서 301은 사용자가 전자 장치 100를 사용하고 있지 않거나 휴대하고 있지 않다고 결정할 수 있다. 다른 예로, 1707과 같이, 사용자에 의해 전자 장치가 뒤집힌 경우, 제1프로세서 301은 사용자가 전자 장 치 100를 사용하고 있지 않다고 결정할 수 있다. 그리고 제1프로세서 301은 해당 시점에서 미리 지정된 시간 동안에 발생하는 패킷 전달의 지연은 사용자가 인지 할 수 없다고 결정하고, 무선랜 모듈 305의 웨이크업 주기를 증가시킬 수 있다. 이에 따라, 전자 장치 100는 배 터리의 전력 소모를 줄일 수 있다. 한 실시 예에서, 전자 장치 100은 알림에 대한 전자 장치 100의 상태 변화와 사용자 생활 히스토리를 기반으로 무선랜 모듈 305의 웨이크업 주기를 조절할 수 있다. 예를 들면, 알림이 미리 지정된 시간 동안에 사용자에 의 해 확인되지 않거나 무시되는 경우, 제1프로세서 301은 미리 지정된 시간이 경과한 시점에서 사용자가 전자 장 치 100를 사용하고 있지 않거나 휴대하고 있지 않다고 결정할 수 있다. 그리고 전자 장치는 사용자 생활 히스토리를 기반으로 해당 시점의 사용자 행동을 추정할 수 있다. 만약에, 해 당 시점이 사용자의 취침 시간인 경우, 제1프로세서 301은 무선랜 모듈 305의 웨이크업 주기를 증가시킬 수 있 다. 이에 따라, 전자 장치 100는 배터리의 전력 소모를 줄일 수 있다. 한편, 알림에 관한 다양한 실시 예는 수신 신호 세기를 고려하지 않은 것이다. 한 실시 예에서, 수신 신호 세기 를 고려하여 무선랜 모듈 305의 웨이크업 주기를 조절할 수 있다. 예를 들면, 수신 신호 세기가 낮은 경우, 웨 이크업 주기를 과도하게 증가시키면 AP 110과의 통신이 끊겨 무선랜으로부터 무선통신 네트워크로 전환됨으로써 전력 소모가 증가하고, 무선통신 네트워크를 통해 수신되는 패킷이 증가할 수 있다. 따라서, 제1프로세서 301은 웨이크업 주기의 조절 상한선을 제한할 수 있다. 도 18a 및 18b는 본 발명의 다양한 실시 예에 따른 무선 랜 모듈의 전류 소모량을 도시한 도면이다. 도 18a 및 18b를 참조하면, 1801 그래프는 웨이크업 주기가 100 ms인 경우에 무선랜 모듈 305의 전류 소모량을 도시한 것이다. 1803 그래프는 웨이크업 주기가 200 ms인 경우에 뭄선랜 모듈 305의 전류 소모량을 도시한 것이다. 두 그래프의 전류 소모량은 다음과 같은 표 1로 나타낼 수 있다. 표 1 웨이크업 주기 100 ms 200 ms 평균 전력 58.36 mW 28.16 mW 평균 전류 14.59 mW 7.04 mA 소비된 에너지 4.04 uAh 1.95 uAh 표 1을 참조하면, 200 ms의 웨이크업 주기에 대한 평균 전력, 평균 전류 및 소비된 에너지는 100 ms의 웨이크업 주기에 대한 평균 전력, 평균 전류 및 소비된 에너지보다 절반으로 감소한다. 따라서, 웨이크업 주기의 감소는 무선랜 모듈 305에 대한 에너지 소비를 감소시킴으로써 전자 장치 100의 배터 리 소모를 감소시킬 수 있다. 이러한 배터리 소모의 감소는 전자 장치 100의 사용 시간을 증가시킬 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서(예를 들면, 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프 로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모 리가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장 치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 문서에 서 기재된 기술의 범위를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 문서의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0111149", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시 예에 따른 통신 시스템의 구성도이다. 도 2는 본 발명의 다양한 실시 예에 따른 통신 시스템에서 비콘 구간과 DTIM 구간을 도시한 도면이다. 도 3은 본 발명의 제1실시 예에 따른 전자 장치의 블록 구성도이다. 도 4는 본 발명의 제2실시 예에 따른 전자 장치의 블록 구성도이다. 도 5는 본 발명의 제3실시 예에 따른 전자 장치의 블록 구성도이다. 도 6은 본 발명의 제4실시 예에 따른 전자 장치의 블록 구성도이다. 도 7은 본 발명의 다양한 실시 예에 따른 전자 장치에서 무선랜 모듈을 제어하는 흐름도이다. 도 8a 및 8b은 본 발명의 다양한 실시 예에 따른 전자 장치에서 무선랜 모듈의 전원 절약 모드를 실행하는 흐름 도이다. 도 9는 본 발명의 다양한 실시 예에 따른 제1프로세서에서 무선랜 모듈의 웨이크업 주기를 제어하는 흐름도이다. 도 10은 본 발명의 제1실시 예에 따른 제1프로세서에서 웨이크업 주기를 결정하는 흐름도이다. 도 11은 본 발명의 제2실시 예에 따른 제1프로세서에서 웨이크업 주기를 결정하는 흐름도이다. 도 12는 본 발명의 다양한 실시 예에 따른 제2프로세서에서 무선랜 모듈의 웨이크업 주기를 제어하는 흐름도이 다. 도 13은 본 발명의 다양한 실시 예에 따른 제2프로세서에서 웨이크업 주기를 결정하는 흐름도이다. 도 14a 및 14b는 본 발명의 다양한 실시 예에 따른 무선랜 모듈에서 웨이크업 주기에 따라 전원 절약 모드를 실 행하는 흐름도이다. 도 15는 본 발명의 다양한 실시 예에 따라 AP들 간에 핸드오버를 실행하는 전자 장치를 도시한 도면이다. 도 16은 본 발명의 다양한 실시 예에 따라 AP와 일정 속도를 유지하는 전자 장치를 도시한 도면이다. 도 17은 본 발명의 다양한 실시 예에 따라 수신된 패킷의 알림에 대한 전자 장치의 상태 변화을 도시한 도면이 다. 도 18a 및 18b은 본 발명의 다양한 실시 예에 따른 무선 랜 모듈의 전류 소모량을 도시한 도면이다."}
