{"patent_id": "10-2022-0080709", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0002750", "출원번호": "10-2022-0080709", "발명의 명칭": "질환 발병 예측 방법 및 상기 방법을 수행하는 컴퓨팅 장치", "출원인": "이화여자대학교 산학협력단", "발명자": "박준범"}}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "심전도 측정 장치에서 정상동률동(NSR: Normal Sinus Rhythm)으로 측정된 환자의 심전도 데이터를 전처리하는단계;전처리된 환자의 심전도 데이터를 심전도 예측 모델에 적용하여 기 설정된 특정 기간 내 심장과 관련된 질환의발현 가능성을 예측하는 단계; 및심전도 예측 모델에서 심장과 관련된 질환의 발현 가능성을 예측하기 위해 집중된 심전도 데이터의 관심 영역을시각화하는 단계;를 포함하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 환자의 심전도 데이터를 전처리하는 단계는,시간 단위를 갖는 심전도 데이터에 포함된 노이즈 신호 및, 심전도 수치 중 적어도 하나를 제거하는 단계; 및상기 노이즈 신호 및, 심전도 수치 중 적어도 하나가 제거된 심전도에 제로 패딩을 수행하여 심전도 예측 모델의 입력으로 사용되기 위한 심전도 데이터를 전처리하는 단계;를 포함하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 심장과 관련된 질환의 발현 가능성을 예측하는 단계는,심전도 예측 모델에 적용된 환자의 심전도 데이터에 대응하는 베이스 라인 네트워크(Baseline Network)의 구조를 결정하는 단계;베이스 라인 네트워크의 구조에 따른 깊이, 넓이 및 해상도 간 상관 관계를 고려하여 베이스 라인 네트워크를조정(Scaling Up)하는 단계; 및조정된 베이스 라인 네트워크를 통해 심전도 데이터로부터 심장과 관련된 질환의 발현 가능성을 예측하는 단계;를 포함하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 심장과 관련된 질환의 발현 가능성을 예측하는 단계는,기 설정된 특정 기간에 따른 현재 시점 및/또는 현재 시점으로부터 일정 시간이 지난 미래 시점에서 심장과 관련된 질환의 발현 가능성을 예측하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 심전도 데이터의 관심 영역을 시각화하는 단계는,심장과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 관심 영역에 대응하는 피처 맵(Feature Map)을 보공개특허 10-2024-0002750-3-간하여 보간된 심전도 데이터의 관심 영역을 시각화하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 심전도 데이터의 관심 영역을 시각화하는 단계는,심장과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 QRS 파형을 분석하여 심전도 예측 모델에서 집중하고자 하는 심전도 데이터의 관심 영역을 시각화하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 심전도 데이터의 관심 영역을 시각화하는 단계는,심전도 데이터로부터 심실의 탈분극(Ventricular Depolarization)을 파악하기 위한 QRS 파형 각각에 대응하는피크 값을 결정하는 단계;각 QRS 파 별로 결정된 피크 값을 포함하는 어텐션 벡터(Attention Vector)를 생성하는 단계; 및심전도 데이터에 어텐션 벡터를 적용하여 심전도 예측 모델에서 집중하고자 하는 관심 영역을 시각화하는 단계;를 포함하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "심전도 측정 장치의 특성에 따라 정상동률동으로 측정된 심전도 데이터의 리드(Lead) 개수를 고려하여 미리 설정된 리드 개수로 조절하는 단계;리드 개수가 조절된 심전도 데이터를 예측하는 심전도 예측 모델의 입력으로 사용되기 위해 전처리하는 단계;전처리된 심전도 데이터를 심전도 예측 모델에 적용하여 심전도 데이터에 대응하는 베이스 라인 네트워크의 구조를 결정하는 단계;결정된 베이스 라인 네트워크의 구조를 조정하여 심전도 데이터로부터 기 설정된 특정 기간 내 심장과 관련된질환의 발현 가능성을 예측하는 단계;어텐션 메커니즘(Attention Mechanism)을 이용하여 심장과 관련된 질환의 발현 가능성이 예측된 원인으로 예측된 심전도 데이터의 관심 영역을 결정하는 단계; 및심전도 데이터의 관심 영역을 보간하여 보간된 심전도 데이터를 시각화하는 단계;를 포함하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 전처리하는 단계는,시간 단위로 측정된 환자 데이터에서 노이즈 신호 또는, '0'으로 설정된 심전도 수치 중 적어도 하나를 포함하는 샘플 데이터를 제거하는 단계; 및샘플 데이터가 제거된 심전도 데이터에 제로 패딩을 수행하여 심전도 예측 모델의 입력으로 사용되기 위해 전처리하는 단계;를 포함하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 심장과 관련된 질환의 발현 가능성을 예측하는 단계는,공개특허 10-2024-0002750-4-심전도 예측 모델에 설정된 베이스 라인 네트워크의 깊이, 넓이 및 해상도 간 상관 관계를 고려하여 베이스 라인 네트워크를 조정하는 단계; 및조정된 베이스 라인 네트워크를 통해 심전도 데이터로부터 기 설정된 특정 기간에 따른 현재 시점 또는/및 미래시점에서 심장과 관련된 질환의 발현 가능성을 예측하는 단계;를 포함하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서,상기 심전도 데이터의 관심 영역을 결정하는 단계는,어텐션 메커니즘을 이용하여 심장과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 QRS 파형을 분석하여심전도 데이터의 관심 영역을 결정하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 QRS 파형은,심전도의 기본 파형 중 심내막 내 전도 장애, 차단, 심실부정맥 중 적어도 하나에 의한 심실의 탈분극을 나타내는 파형인 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,상기 심전도 데이터의 관심 영역을 결정하는 단계는,심장과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 관심 영역에 대응하는 피처 맵을 보간하여 보간된심전도 데이터를 시각화하는 질환 발병 예측 방법."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "질환 발병 예측 방법을 수행하는 컴퓨팅 장치에 있어서,상기 컴퓨팅 장치는 프로세서를 포함하고,상기 프로세서는,심전도 측정 장치에서 정상동률동(NSR: Normal Sinus Rhythm)으로 측정된 환자의 심전도 데이터를 전처리하고,전처리 된 환자의 심전도 데이터를 심전도 예측 모델에 적용하여 기 설정된 특정 기간 내 심장과 관련된 질환의발현 가능성을 예측하고,심전도 예측 모델에서 심장과 관련된 질환의 발현 가능성을 예측하기 위해 집중된 심전도 데이터의 관심 영역을시각화하는 컴퓨팅 장치."}
{"patent_id": "10-2022-0080709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "질환 발병 예측 방법을 수행하는 컴퓨팅 장치에 있어서,상기 컴퓨팅 장치는 프로세서를 포함하고,상기 프로세서는,심전도 측정 장치의 특성에 따라 정상동률동으로 측정된 심전도 데이터의 리드(Lead) 개수를 고려하여 미리 설정된 리드 개수로 조절하고,리드 개수가 조절된 심전도 데이터를 예측하는 심전도 예측 모델의 입력으로 사용되기 위해 전처리하고,전처리된 심전도 데이터를 심전도 예측 모델에 적용하여 심전도 데이터에 대응하는 베이스 라인 네트워크의 구공개특허 10-2024-0002750-5-조를 결정하고,결정된 베이스 라인 네트워크의 구조를 조정하여 심전도 데이터로부터 기 설정된 특정 기간 내 심장과 관련된질환의 발현 가능성을 예측하고,어텐션 메커니즘을 이용하여 심장과 관련된 질환의 발현 가능성이 예측된 원인으로 예측된 심전도 데이터의 관심 영역을 결정하고,심전도 데이터의 관심 영역을 보간하여 보간된 심전도 데이터를 시각화하는 컴퓨팅 장치."}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능을 기반으로 심방세동의 특성을 조기 예측하기 위한 질환 발병 예측 방법을 개시한다. 보다 자세하게, 질환 발병 예측 방법은 정상동률동(NSR)으로 측정된 환자의 심전도 데이터를 인공지능 기반의 심 전도 예측 모델에 적용하여 기 설정된 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예측한다. 이후, 질환 발병 예측 방법은 심장과 관련된 질환의 발현 가능성을 예측하기 위해 심전도 예측 모델에서 집중하고자 하는 관 심 영역을 시각화하여 심전도 질환의 원인을 초기에 진단 및 관리되도록 유도한다."}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 질환 발병 예측 방법 및 컴퓨팅 장치에 관한 것으로, 보다 구체적으로는 딥러닝 모델을 이용하여 심 방세동의 특성을 조기에 예측하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "심방세동은 심장이 불규칙하게 뛰는 부정맥의 일종으로 일시적인 현상인 경우가 대부분이며, 별도의 치료가 필 요하지 않은 경우가 많다. 최근에는 노령화로 인해 심방세동 환자들이 지속적으로 늘어나고 있으나, 만성적 심 방세동에 적응하여 증상이 없는 환자들도 많다. 하지만, 부정맥은 치료를 진행하지 않거나 증상이 지속되면 뇌 졸중, 심부전 등과 같은 심혈관 질환의 원인이 되는 경우가 많다. 이에, 심혈관 질환은 초기에 진단되어 신속하게 치료가 이루어질 때 예후가 좋다. 이러한, 심혈관 질환은 심전 도(ECG, Electrocardiogram)를 이용한 검사 방법을 통해 진단된다. 심전도는 심장의 전기적 활동을 정해진 시 간 동안 측정하는 검사로, 피부에 부착된 전극과 신체 외부의 측정 장비에 의해 기록된다. 자세하게, 측정 장 비는 심장의 비정상적인 리듬을 측정하고 진단하며, 일반적으로 12-리드 심전도가 사용된다. 12-리드 심전도는 사지유도와 흉부유도로 이루어진다. 사지유도는 오른팔, 왼팔, 왼쪽 다리에 총 3개의 전극을 사용하여 만들어 지며 ' Lead I, II, II, aVF, aVL, aVF '로 구성된다. 흉부유도는 흉벽에 배치되는 여섯 개의 전극으로 이루어 져 있으며 ' V1, V2, V3, V4, V5, V6 '로 구성된다. 심전도의 파형은 P-QRS-T로 구성되며, 측정 장비는 반복 적으로 나타나는 P-QRS-T의 구성으로부터 심전도의 특정 파형을 분석하여 심혈관 질환의 발현 여부를 진단한다. 그러나, 측정 장치를 이용한 기존의 검사 방법은 심전도 구성에 따른 특정 알고리즘을 이용하여 현재 환자가 어 떠한 심혈관 질환을 가지고 있는지에 대한 이상 소견을 유추한다. 이후, 기존의 검사 방법은 심혈관 질환 중 심방세동(PAF: Paroxymal Atrial Fibrillation)이 의심되면 24시간 심전도 검사인 홀터 검사를 진행 및 치료를 결정한다. 하지만, 이러한 기존의 검사 방법은 측정 장치에서 사용되는 특정 알고리즘의 성능에 따라 이상 소 견으로 판독될 확률이 결정된다. 다만, 특정 알고리즘을 통해 결정된 이상 소견이 정확하고 판단된 것이라 단 정할 수 없다. 또한, 기존의 검사 방법은 일부 환자들의 경우 발작성 심방세동으로 홀터 검사 이전에 잡히지 않을 수 있으며 발작성 심방세동이 아니더라도 애매한 심전도의 경우 심방세동으로 나타나지 않는 경우도 존재 한다. 결국, 기존의 검사 방법은 심방세동과 관련해 환자에게서 나타나는 심전도의 파형이 유사하나, 어떠한 알고리즘 을 사용하느냐에 따라 현재에 질환이 없거나 찾지 못하는 경우, 판단 및 예측에 실패하게 된다."}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 심전도 기기에서 정상동률동으로 판독된 환자의 심전도 데이터를 이용하여 특정 기간 내 심장과 관련 된 질환의 발현 가능성을 예측하는 질환 발병 예측 방법을 제공한다. 본 발명은 CNN 기반의 심전도 예측 모델에 어텐션 메커니즘을 적용하여 심장과 관련된 질환의 발현 가능성이 예 측된 원인으로 예측된 심전도 데이터의 관심 영역을 시각화함으로써, 의료진 및 환자에게 심전도 진단을 위한 보다 향상된 통찰력 또는, 모델을 제공하는 질환 발병 예측 방법을 제공한다. 본 발명은 시각화 된 심전도 데이터의 관심 영역에 따른 환자의 위험군을 판별함으로써, 심장과 관련된 질환에 대한 환자의 현재 상태를 직접적으로 표현하는 질환 발병 예측 방법을 제공한다."}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 따른 질환 발병 예측 방법은 심전도 측정 장치에서 정상동률동(NSR)으로 측정된 환자의 심전도 데이터를 전처리하는 단계; 전처리된 환자의 심전도 데이터를 심전도 예측 모델에 적용하여 기 설정된 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예측하는 단계; 및 심전도 예측 모델에서 심장과 관련된 질 환의 발현 가능성을 예측하기 위해 집중된 심전도 데이터의 관심 영역을 시각화하는 단계; 를 포함할 수 있다. 본 발명의 실시예에 따른 환자의 심전도 데이터를 전처리하는 단계는, 시간 단위를 갖는 심전도 데이터에 포함 된 노이즈 신호 및, 심전도 수치 중 적어도 하나를 제거하는 단계; 및 상기 노이즈 신호 및, 심전도 수치 중 적 어도 하나가 제거된 심전도에 제로 패딩을 수행하여 심전도 예측 모델의 입력으로 사용되기 위한 심전도 데이터 를 전처리하는 단계; 를 포함할 수 있다. 본 발명의 실시예에 따른 심장과 관련된 질환의 발현 가능성을 예측하는 단계는, 심전도 예측 모델에 적용된 환 자의 심전도 데이터에 대응하는 베이스 라인 네트워크의 구조를 결정하는 단계; 베이스 라인 네트워크의 구조에 따른 깊이, 넓이 및 해상도 간 상관 관계를 고려하여 베이스 라인 네트워크를 조정하는 단계; 및 조정된 베이스 라인 네트워크를 통해 심전도 데이터로부터 심장과 관련된 질환의 발현 가능성을 예측하는 단계; 를 포함할 수 있다. 본 발명의 실시예에 따른 심장과 관련된 질환의 발현 가능성을 예측하는 단계는, 기 설정된 특정 기간에 따른 현재 시점 및/또는 현재 시점으로부터 일정 시간이 지난 미래 시점에서 심장과 관련된 질환의 발현 가능성을 예 측할 수 있다. 본 발명의 실시예에 따른 심전도 데이터의 관심 영역을 시각화하는 단계는, 심장과 관련된 질환의 발현 가능성 이 예측된 심전도 데이터의 관심 영역에 대응하는 피처 맵을 보간하여 보간된 심전도 데이터의 관심 영역을 시 각화 할 수 있다. 본 발명의 실시예에 따른 심전도 데이터의 관심 영역을 시각화하는 단계는, 심장과 관련된 질환의 발현 가능성 이 예측된 심전도 데이터의 QRS 파형을 분석하여 심전도 예측 모델에서 집중하고자 하는 심전도 데이터의 관심 영역을 시각화 할 수 있다. 본 발명의 실시예에 따른 심전도 데이터의 관심 영역을 시각화하는 단계는, 심전도 데이터로부터 심실의 탈분극 을 파악하기 위한 QRS 파형 각각에 대응하는 피크 값을 결정하는 단계; 각 QRS 파 별로 결정된 피크 값을 포함 하는 어텐션 벡터를 생성하는 단계; 및 심전도 데이터에 어텐션 벡터를 적용하여 심전도 예측 모델에서 집중하 고자 하는 관심 영역을 시각화하는 단계; 를 포함할 수 있다. 본 발명의 다른 실시예에 따른 질환 발병 예측 방법은 심전도 측정 장치의 특성에 따라 정상동률동으로 측정된 심전도 데이터의 리드(Lead) 개수를 고려하여 미리 설정된 리드 개수로 조절하는 단계; 리드 개수가 조절된 심 전도 데이터를 예측하는 심전도 예측 모델의 입력으로 사용되기 위해 전처리하는 단계; 전처리된 심전도 데이터 를 심전도 예측 모델에 적용하여 심전도 데이터에 대응하는 베이스 라인 네트워크의 구조를 결정하는 단계; 결 정된 베이스 라인 네트워크의 구조를 조정하여 심전도 데이터로부터 기 설정된 특정 기간 내 심장과 관련된 질 환의 발현 가능성을 예측하는 단계; 어텐션 메커니즘을 이용하여 심장과 관련된 질환의 발현 가능성이 예측된 원인으로 예측된 심전도 데이터의 관심 영역을 결정하는 단계; 및 심전도 데이터의 관심 영역을 보간하여 보간 된 심전도 데이터를 시각화하는 단계; 를 포함할 수 있다. 본 발명의 실시예에 따른 전처리하는 단계는, 시간 단위로 측정된 환자 데이터에 포함된 노이즈 신호 또는, ' 0'으로 설정된 심전도 수치 중 적어도 하나를 제거하는 단계; 노이즈 신호 및, 심전도 수치 중 적어도 하나가 제거된 심전도 데이터에 포함된 샘플 데이터를 제거하는 단계; 및 샘플 데이터가 제거된 심전도 데이터에 제로 패딩을 수행하여 심전도 예측 모델의 입력으로 사용되기 위해 전처리하는 단계; 를 포함할 수 있다. 본 발명의 실시예에 따른 심장과 관련된 질환의 발현 가능성을 예측하는 단계는, 심전도 예측 모델에 설정된 베 이스 라인 네트워크의 깊이, 넓이 및 해상도 간 상관 관계를 고려하여 베이스 라인 네트워크를 조정하는 단계; 및 조정된 베이스 라인 네트워크를 통해 심전도 데이터로부터 기 설정된 특정 기간에 따른 현재 시점 또는/및 미래 시점에서 심장과 관련된 질환의 발현 가능성을 예측하는 단계; 를 포함할 수 있다. 본 발명의 실시예에 따른 심전도 데이터의 관심 영역을 결정하는 단계는, 어텐션 메커니즘을 이용하여 심장과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 QRS 파형을 분석하여 심전도 데이터의 관심 영역을 결정할 수 있다. 본 발명의 실시예에 따른 QRS 파형은, 심전도의 기본 파형 중 심내막 내 전도 장애, 차단, 심실부정맥 중 적어 도 하나에 의한 심실의 탈분극을 나타내는 파형일 수 있다. 본 발명의 실시예에 따른 심전도 데이터의 관심 영역을 결정하는 단계는, 심장과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 관심 영역에 대응하는 피처 맵을 보간하여 보간된 심전도 데이터를 시각화 할 수 있다. 본 발명의 일실시예에 따른 질환 발병 예측 방법을 수행하는 컴퓨팅 장치에 있어서, 상기 컴퓨팅 장치는 프로세 서를 포함하고, 상기 프로세서는, 심전도 측정 장치에서 정상동률동으로 측정된 환자의 심전도 데이터를 전처리 하고, 전처리 된 환자의 심전도 데이터를 심전도 예측 모델에 적용하여 기 설정된 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예측하고, 심전도 예측 모델에서 심장과 관련된 질환의 발현 가능성을 예측하기 위해 집 중된 심전도 데이터의 관심 영역을 시각화 할 수 있다. 본 발명의 실시예에 따른 질환 발병 예측 방법을 수행하는 컴퓨팅 장치에 있어서, 상기 컴퓨팅 장치는 프로세서 를 포함하고, 상기 프로세서는, 심전도 측정 장치의 특성에 따라 정상동률동으로 측정된 심전도 데이터의 리드 (Lead) 개수를 고려하여 미리 설정된 리드 개수로 조절하고, 리드 개수가 조절된 심전도 데이터를 예측하는 심 전도 예측 모델의 입력으로 사용되기 위해 전처리하고, 전처리된 심전도 데이터를 심전도 예측 모델에 적용하여 심전도 데이터에 대응하는 베이스 라인 네트워크의 구조를 결정하고, 결정된 베이스 라인 네트워크의 구조를 조 정하여 심전도 데이터로부터 기 설정된 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예측하고, 어텐션 메 커니즘을 이용하여 심장과 관련된 질환의 발현 가능성이 예측된 원인으로 예측된 심전도 데이터의 관심 영역을 결정하고, 심전도 데이터의 관심 영역을 보간하여 보간된 심전도 데이터를 시각화 할 수 있다."}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일실시예에 의하면, 질환 발병 예측 방법은 심전도 기기에서 정상동률동으로 판독된 환자의 심전도 데이터를 이용하여 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예측할 수 있다. 본 발명의 일실시예에 의하면, 질환 발병 예측 방법은 딥러닝(CNN) 기반의 심전도 예측 모델에 어텐션 메커니즘 을 적용하여 심장과 관련된 질환의 발현 가능성이 예측된 원인으로 예측된 관심 영역을 시각화함으로써, 의료진 및 환자에게 심전도 진단을 위한 보다 향상된 통찰력 또는, 모델을 제공할 수 있다. 본 발명의 일실시예에 의하면, 질환 발병 예측 방법은 시각화 된 심전도 데이터의 관심 영역에 따른 환자의 위 험군을 판별함으로써, 심장과 관련된 질환에 대한 환자의 현재 상태를 직접적으로 표현할 수 있다. 본 발명의 일실시예에 의하면, 질환 발병 예측 방법은 시각화 된 심전도 데이터를 통해 환자의 현재 상태를 직 접적으로 표현함으로써, 의료진이 보다 정확한 판독을 하는데 도움을 주며, 의료진과 환자 간의 거리감을 줄일 수 있다."}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일실시예에 따른 환자의 심전도 데이터를 이용하여 특정 기간 내 심방세동을 예측하기 위한 전반적인 구성을 도시한 도면이다. 도 1을 참고하면, 컴퓨팅 장치는 심전도 측정 장치에서 실제로 심방세동이 존재하나, 심방세동이 없 는 정상동률동(NSR: Normal Sinus Rhythm)으로 측정된 심전도 데이터 상의 오류를 판독할 수 있다. 컴퓨 팅 장치는 판독된 심전도 데이터의 오류를 시각화함으로써, 심장과 관련된 질환을 보다 정확하게 진 단 및 결정할 수 있다. 보다 구체적으로, 심전도 측정 장치는 환자의 신체에 부착된 전극으로부터 전기적 생체 신호를 수집 하여 전극이 부착된 각 위치에 따른 복수의 리드로 저장할 수 있다. 심전도 측정 장치는 복수의 리 드를 포함하는 심전도 데이터를 컴퓨팅 장치에 전달할 수 있다. 컴퓨팅 장치는 심전도 측 정 장치로부터 심방세동이 없는 정상동률동으로 측정된 심전도 데이터를 수신할 수 있다. 컴퓨팅 장치는 시간 단위를 갖는 심전도 데이터에 포함된 노이즈 신호 및, 심전도 수치 중 적어도 하 나를 제거할 수 있다. 컴퓨팅 장치는 노이즈 신호 및, 심전도 수치 중 적어도 하나가 제거된 심전도에 제 로 패딩을 수행하여 심전도 예측 모델의 입력으로 사용되기 위한 심전도 데이터로 전처리할 수 있다. 컴퓨팅 장치는 심방세동이 없는 정상동률동으로 측정된 심전도 데이터에서 특정 기간 내 심방세동의 발현 가능성을 예측하는 딥러닝 기반의 심전도 예측 모델을 적용할 수 있다. 여기서, 심방세동의 발현 가능성은 특 정 기간 내 시간에 따른 심전도 데이터의 심근 활동 전류를 고려하여 정상동률동으로 측정된 심전도 데이터에서 심방세동이 나타날 수 있는 확률일 수 있다. 컴퓨팅 장치는 신경 아키텍처 검색 모델(NAS: Neural Architecture Search)를 이용한 기계 학습 모델링을 통한 심전도 예측 모델을 생성할 수 있다. 심전도 예측 모델은 확장 모델(Scaling-Up Model)을 제공하고, 자원 소모가 적으면서 심방세동의 예측 성능이 향상된 모델일 수 있다. 컴퓨팅 장치는 정상동률동으로 측정된 심전도 데이터를 심전도 예측 모델에 적용하여 기 설정된 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예 측할 수 있다. 컴퓨팅 장치은 심전도 예측 모델에서 심장과 관련된 질환의 발현 가능성을 예측하기 위해 집중된 심전도 데이터의 관심 영역을 시각화할 수 있다. 컴퓨팅 장치는 심전도 데이터의 관심 영역(10 8)을 시각화 하기 위해 어텐션 매커니즘(Attention Mechanism)을 활용할 수 있다. 어텐션 매커니즘은 심전도 데이터를 압축하는 과정에서 발생하는 정보 손실을 최소화하여, 심전도 데이터의 정확도를 높이는 기법일 수 있 다. 다시 말해, 어텐션 매커니즘은 심장과 관련된 질환의 발현 가능성을 예측하는 매 시점마다 예측해야 하는 심방세동과 심방세동과 연관이 있는 특정 영역을 집중하는 기법일 수 있다. 어텐션 매커니즘은 훈련 불가능한 어텐션 매커니즘(Non-Trainable Attention) 또는, 훈련 가능한 어텐션 매커니즘(Trainable Attention)을 포함 할 수 있다. 훈련 불가능한 어텐션 매커니즘(Non-Trainable Attention)은 실제 심전도 예측 모델에 학습이 적용되는 것이 아 니라, 학습된 이후 저장된 변화도(gradient)를 역계산할 수 있다. 이후, 훈련 불가능한 어텐션 매커니즘은 역 계산 된 변화도에 따라 해당 심전도 예측 모델이 어느 부분에 집중하고 있는지 확인할 수 있다. 훈련 가능한 어텐션 매커니즘(Trainable Attention)은 학습 시 심전도 예측 모델이 특정 부분에 집중할 수 있도 록 스코어(score)를 계산하여 좀 더 쉽게 정답을 유추할 수 있게 해주는 연산을 삽입할 수 있다. 컴퓨팅 장치는 디스플레이를 통해 심전도 데이터의 관심 영역을 표시할 수 있다. 디스플 레이에 표현되는 관심 영역은 심전도 예측 모델이 어떤 이유로 심방세동이 발현될 것으로 예측하기 위해 집중된 심전도 데이터의 일부분일 수 있다. 의료진은 시각화된 심전도 데이터의 관심 영역을 참고함으로써, 환자가 심방세동과 관련하 여 위중증(고위험군/저위험군)을 판별하는데 도움을 받을 수 있다. 다시 말해, 컴퓨팅 장치는 환자 가 현재 시점에 심방세동이 정상으로 확인되더라도 심전도 예측 모델을 통해 발현 가능성을 예측함으로써, 심전 도 질환의 원인을 초기에 진단 및 관리되도록 유도할 수 있다. 환자는 시각화 된 심전도 데이터의 관심 영역을 통해 본인의 현재 상태를 보다 정확하게 인지하는데 도움을 받을 수 있다. 결국, 본 발명은 표면적으로 정상적인 심전도 데이터에서 시간에 따라 잠재적으로 환자에게 위협을 줄 수 있는 심방세동을 예측 및 시각화함으로써, 심전도 데이터가 정상으로 판독되더라도 가까운 미래에는 심방세동이 발병 할 수 있는지를 보다 객관적인 정보를 통해 예측할 수 있는 기술을 제공한다.도 2는 본 발명의 일실시예에 따른 컴퓨팅 장치의 프로세서가 수행하는 동작을 설명하기 위해 도시한 도면이다. 도 2를 참고하면, 컴퓨팅 장치는 프로세서를 포함할 수 있다. 이에, 프로세서는 심전도 예측 모델의 입력 크기에 맞게 정상동률동으로 측정된 심전도 데이터를 전처리할 수 있다. 프로세서는 전처리 된 심전도 데이터를 심전도 예측 모델에 적용하여 심장과 관련된 질환의 발현 가능성을 예측할 수 있다. 이후, 프로세서는 어텐션 매커니즘을 통해 어떠한 이유로 질환의 발현 가능성이 예측되었는지를 시각화할 수 있 다. ① 심전도 데이터의 전처리 프로세서는 심전도 측정 장치에서 환자의 심전도 데이터를 수집할 수 있다. 환자의 심전도 데이터는 심전 도 측정 장치로부터 XML 형식으로 구성될 수 있다. XML 형식을 갖는 환자의 심전도 데이터는 환자의 기본 정보 를 포함한 다양한 값들을 포함하며, 64 진법으로 인코딩된 상태일 수 있다. 프로세서는 인코딩된 심전도 데이터를 디코딩함으로써, 실제 값을 추출할 수 있다. 또한, 프로세서는 심전도 측정 장치의 특성에 따라 정상동률동으로 측정된 심전도 데이터의 리드 개수를 고려하여 미리 설정된 리드 개수로 조절할 수 있다. 자세하게, 심전도 데이터는 서로 다른 제조사에서 개발된 심전도 측정 장치를 통해 8개 리드 또는, 12개 리드를 저장될 수 있다. 프로세서는 심전도 데이터로 저장 된 리드 개수가 12개 인 경우, 12개 리드를 모두 심전도 데이터로 활용할 수 있다. 또한, 프로세서는 심 전도 데이터에 포함된 리드 개수가 8개 인 경우, 확인되지 않는 4개의 리드 정보를 유추하는 과정을 수행할 수 있다. 일례로, 제조사 A에서 개발된 심전도 측정 장치는 LeadData의 WaveFormData 태그 내에 리드 정보를 저장할 수 있다. 또한, 제조사 B에서 개발된 심전도 측정 장치는 WaveData의 Data 내에 리드 정보를 저장할 수 있다. 프 로세서는 Data 또는, 태그를 기반으로 리드 정보가 저장된 위치에 접근하여 심전도 데이터를 확인할 수 있 다. 여기서, 심전도 데이터는 대부분 초당 500개의 데이터 또는, 10초단위로 저장된 상태일 수 있다. 심전도는 전기적 생체 신호의 특성을 가지며, 프로세서는 전기적 생체 신호의 특성에 따른 수학식 1 또는, 수학식 2를 이용하여 리드 정보를 추정할 수 있다. 수학식 1"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, 수학식 1은 심전도의 각 파형의 진폭을 이용하는 아인트호벤의 법칙(Einthoven's Law)일 수 있다. 수학식 2"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, 수학식 2는 리드 aVL, -aVR 및 aVF에 대한 각 사지 전극의 평균을 이용하는 골드 버거의 방정식 (Goldberger's Equations)일 수 있다. 자세하게, ' a '는 증강, ' V '는 전압, ' R '은 오른팔, ' L '은 왼팔, ' F '는 발을 의미할 수 있다. 리드 aVR에서 'R'은 탐험 전극이며, 기준은 왼쪽 팔과 왼쪽 다리에 해당 하는 각 사지 전극의 평균으로 결정될 수 있다. 또한, 리드 aVR는 리드 -aVR로 반전될 수 있다. 여기서, 반전은 탐색 지점 및 참조 지점이 위치가 전환되는 것을 의미한다. 프로세서는 아인트호벤의 법칙 또는, 골드 버거의 방정식을 기반으로 심전도에 관한 전기적 신호의 특성을 이용하여 정상동률동으로 측정된 심전도 데이터의 리드 개수를 조절할 수 있다. 이후, 프로세서는 리드 개수가 조절된 심전도 데이터를 예측하는 심전도 예측 모델의 입력으로 사용되기 위해 전처리할 수 있다. 보다 상세하게, 심전도 데이터는 기 설정된 단위의 데이터로 저장되며, 해당 단위의 앞 부분과 뒤 부분에는 활용 불가한 가비지 신호(Garbage Signal)를 포함하거나 또는, '0'으로 설정된 심전도 수치를 포함할 수 있다. 프로세서는 심전도 데이터에서 노이즈 신호 및, 심전도 수치 중 적어도 하나를 샘플 데이터를 제거할 수 있다. 프로세서는 샘플 데이터가 제거된 심전도 데이터에 제로 패딩(Zero Padding)을 수행하여 심전도 예 측 모델의 입력으로 사용되기 위해 전처리할 수 있다. 일례로, 프로세서는 심전도 데이터의 앞뒤로 샘플 데이터를 약 600개씩 제거하고, 0으로 제로 패딩을 진행함으로써, 심전도 데이터의 총 길이를 4096으로 조절할 수 있다. ② 질환의 발현 가능성을 예측 프로세서는 전처리된 심전도 데이터를 심전도 예측 모델에 적용하여 심전도 데이터에 대응하는 베이스 라 인 네트워크를 결정할 수 있다. 다시 말해, 프로세서는 이펙티브넷(204, EfficientNet) 기반의 신경 아키텍처 검색 모델(NAS)을 통해 심전도 데이터에 대응하는 베이스 라인 네트워크의 구조를 결정할 수 있 다. 1) 신경 아키텍처 검색 모델(NAS: Neural Architecture Search) 신경 아키텍처 검색 모델(NAS)은 딥러닝 모델로, 다양한 문제를 해결하기 위한 최적화된 모델일 수 있다. 신경 아키텍처 검색 모델(NAS)은 기 설정된 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예측하기 위해 3가지 요소를 이용하여 모델링(Architecture Engineering)을 자동화할 수 있다. 모델링을 자동화하는 구조는 아래의 표 1과 같이 나타낼 수 있다. 표 1"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "① Search Space(이하, 요소 1)요소 1은 원칙적으로 나타낼 수 있는 구조를 정의할 수 있다. 요소 1은 본발명 에서 해결하고자 하는 모델링 작업에 적합한 아키텍처의 일반적인 속성에 대한 사전 지식을 통합함으로써 검색 공간의 크기를 줄이고 검색을 단순화할 수 있다. 이는 인간의 바이어스(bias)가 들어가면서 인간의 지식을 뛰 어넘는 모델을 찾는 것을 방해할 수 있다. ② Search Strategy(이하, 요소 2) 요소 2는 신경 아키텍처 검색 모델(NAS)의 탐색 방법으로 성능이 우수한 아키텍처를 빠르게 찾는 것이 바람직하 며, 차선의 아키텍처로의 조기 수렴되는 것을 회피해야 한다. ③ Performance Estimation Strategy(이하, 요소 3) 신경 아키텍처 검색 모델(NAS)은 일반적으로 보이지 않는 데이터에서 높은 예측 성능을 달성하는 아키텍처를 찾 는 것이 목표이다. 요소 3은 신경 아키텍처 검색 모델(NAS)의 목표를 달성하기 위한 성능을 추정할 수 있다. 이를 위한 성능 추정 방법은 훈련과 검증을 수행하는 것이지만 계산 비용이 많이 들며, 탐색할 수 있는 아키텍 처의 수를 제한하며, 비용을 줄이는 방법이 필요하다.2) EfficientNet 이펙티브넷은 상술한 신경 아키텍처 검색 모델(NAS)을 이용하여 모델링을 쉽게 최적화 할 수 있는 기법일 수 있 다. 프로세서는 본 발명에서 제안하는 심전도 측정 모델의 성능을 향상시키기 위한 방법으로 NAS 기반의 이펙티브넷 방법론을 활용할 수 있다. NAS 기반의 이펙티브넷 방법론은 다음과 같은 3가지 방법을 이용할 수 있다. ① Depth : 네트워크의 Depth를 깊게 하는 방법 ② Width : 채널 width(filter 개수)를 늘리는 방법 ③ Resolution : 입력 이미지의 해상도를 올리는 방법 프로세서는 NAS 기반의 이펙티브넷 방법론에 따른 한정된 자원으로 최대한의 효율을 내기 위한 것으로 3가 지 방법을 활용함으로써, 보다 향상된 성능을 갖는 심전도 측정 모델을 생성할 수 있다. 여기서, 이펙티브넷은 모델을 압축할 수 있는 기법으로 컨볼루션 네트워크(Convolution Network)의 성능을 높이 면서도 심전도 측정 모델의 효율성이 향상시킬 수 있다. 다시 말해, 프로세서는 이펙티브넷에서 사용하는 모델 최적화 방법 중 하나로 컨볼루션 네트워크에서 자원이 제한된 상태에서 심전도 측정 모델의 정확도를 최대 화할 수 있다. 심전도 측정 모델의 정확도를 최대화하기 위한 알고리즘은 다음의 수학식 3과 같이 나타낼 수 있다. 수학식 3"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 3을 참고하면, w, d, r 각각은 Width, Depth, Resolution에 따른 상수이고 프로세서는 상수가 나 타내는 값이 일정 값 이상이 되면, 정확도가 빠르게 올라가는 특징을 활용하여 상수 값의 상관관계를 분석할 수 있다. 프로세서는 분석된 상관관계를 기반으로 NAS를 통해 심전도 측정 모델을 최적화할 수 있다. 또한, Depth, Width, Resolution은 심전도 측정 모델의 네트워크를 깊게 만들어 더 넓은 영역의 특징(feature)을 도출 하는 성능을 높일 수 있다. 프로세서는 심전도 데이터에 포함된 입력 이미지가 클수록 많은 정보를 담고 있으므로 레이어를 넓게 증가 시킬 수 있다. 이때, 레이어를 증가시키기 위한 계산량은 두 변수 및 그 제곱에 비례하므로 다음의 수학식 4와 같이 정의될 수 있다. 수학식 4"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "프로세서는 본 발명에서 제안하는 심방세동의 발현 가능성을 예측하기 위해 베이스 라인 네트워크로 ResBlock 을 이용할 수 있다.3) ResBlock 프로세서는 아래의 표 2과 같은 ResBlock 구조를 사용하여 본 발명의 베이스 라인 네트워크로 활용할 수 있다. 표 2"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "자세하게, ResBlock의 구조는 두 개의 입력을 받아 한쪽은 skip-connection을 이용한 Max Pooling과 1 x 1 Conv 레이어를 통하며 다른 한쪽은 Conv 레이어를 지나 Batch Normalization을 진행한다. 이후, ResBlock의 구조는 활성화 함수로 ReLU를 지나 Dropout을 이용해 과적합을 피하고 새로운 Conv 레이어를 통해 앞서 생성한 Skip-connection과 연결되면서, 다음 레이어로 진행된다. 여기서, 다음 레이어로 진행됨에 있어, ResBlock의 입력이 두 가지이므로 한쪽은 바로 Skip-connection으로 넘어가며 다른 한쪽은 다시 한 번 더 Batch Normalization-ReLU-Dropout을 거쳐 넘어가는 구조를 갖는다.이에, 프로세서는 현재 시점 뿐만, 아니라 미 래의 예측까지 진행하므로 이에 따른 모델의 구조 변화를 이펙티브넷 기반의 NAS를 활용하여 모델에 대한 성능 및 자원 최적화를 진행할 수 있다. 프로세서는 심전도 데이터로부터 기 설정된 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예측할 수 있다. ③ 시각화 프로세서는 어텐션 메커니즘을 이용하여 심장과 관련된 질환의 발현 가능성이 예측된 원인으로 예측된 심 전도 데이터의 관심 영역을 결정할 수 있다. 프로세서는 어텐션 메커니즘을 이용하여 심장과 관련된 질환 의 발현 가능성이 예측된 심전도 데이터의 QRS 파형을 분석하여 심전도 데이터의 관심 영역을 결정할 수 있다. 여기서, QRS 파형은, 심전도의 기본 파형 중 심내막 내 전도 장애, 차단, 심실부정맥 중 적어도 하나에 의한 심 실의 탈분극을 나타내는 파형일 수 있다. 보다 자세한 구성은 도 4를 통해 설명하도록 한다. 이후, 프로세서는 심장과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 관심 영역에 대응하는 피 처 맵을 보간하여 보간된 심전도 데이터를 시각화할 수 있다. 보다 자세한 구성은 도 5를 통해 설명하도록 한 다. 도 3은 본 발명의 일실시예에 따른 심방세동이 발생할 지를 예측하기 위한 특정 기간에 관한 윈도우 사이즈를 나타낸 도면이다. 도 3을 참고하면, 컴퓨팅 장치는 심전도 측정 장치의 특정 알고리즘을 통해 심방세동이 발생할지 여부를 예측할 수 있다. 이때, 컴퓨팅 장치는 기 설정된 특정 기간에 따른 현재 시점 및/또는 현재 시점으 로부터 일정 시간이 지난 미래 시점에서 심장과 관련된 질환의 발현 가능성을 예측할 수 있다. 여기서, 기 설 정된 특정 기간은 제1 시점으로부터 다른 어느 제2 시점까지의 사이를 나타낼 수 있다. 일례로, 기 설정된 특정 기간은 1주, 2주, 1개월 등으로 사용자에 의해 조절이 가능할 수 있다. 또한, 기 설정된 특정 기간은 제1 시점과 제2 시점 사이에 일정 시간 단위로 분할될 수 있다. 컴퓨팅 장치는 특정 기간 내 분할된 시간 단위 별로 각각 심방세동이 발생할지 여부를 예측할 수 있 다. 일례로, 특정 기간은 한 달로 설정될 수 있으며, 특정 기간으로 설정된 한 달은 세부적으로 일 주일의 시간 단위로 분할될 수 있다. 컴퓨팅 장치는 한달 간격의 일주일 단위로 심전도 데이터에서 심장 과 관련된 질환의 발현 가능성을 예측할 수 있다.도 4는 본 발명의 일실시예에 따른 심전도 예측 모델에서 심방세동을 예측하는데 집중된 심전도 데이터의 관심 영역을 도출하는 세부 동작을 설명하기 위해 도시한 도면이다. 도 4를 참고하면, 컴퓨팅 장치는 어텐션 네트워크(Attention Network)의 어텐션 매커니즘을 이용하여 심장 과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 관심 영역을 결정할 수 있다. 컴퓨팅 장치는 심 전도 데이터의 관심 영역을 결정하기 위해 어텐션 매커니즘 중 Grad-CAM을 이용할 수 있다. Grad-CAM은 Non-trainable AI의 일종으로 학습 이후 변화도(Gradient)를 계산하여 해당 모델이 어디에 주의를 집중하고 있는지를 확인하는 기법일 수 있다. Grad-CAM은 도 2의 확장 모델(Scaling-Up Model)에 어텐션 네트 워크를 부가적으로 활용함으로써 심전도 측정 모델의 내부에서 심방세동을 예측하는 데 도움을 주는 부분에 집 중할 수 있다. 이때, 컴퓨팅 장치는 self-attention에 따른 도 2에서 설명한 ResBlock과 ResBlock 간의 구조를 연결하는 과정에 Recalibrate를 하는 과정을 추가함으로써 한 구역만 보는 것이 아닌 심전도 데이터의 전반적인 전기적 생체 신호를 활용할 수 있다. 이를 통해 컴퓨팅 장치는 심전도 데이터에서 심전도 측정 모델이 집중하고자 하는 부분을 학습할 수 있다. 보다 자세하게, 컴퓨팅 장치는 어텐션 네트워크를 이용하기 위해 입력으로 들어오는 ECG 신호의 QRS파를 이용할 수 있다. ECG 신호는 P-QRS-T로 구성되며, 컴퓨팅 장치는 ECG 신호의 P, Q, S, T, R 각각의 피크 점의 정보(peak/값)를 추출할 수 있다. 이때, 컴퓨팅 장치는 ECG 신호에 존재하는 다양한 노이즈를 제거 하기 위해 밴드 패스 필터링(Band-Pass Filtering)을 수행할 수 있다. 컴퓨팅 장치는 밴드 패스 필터링을 수행하여 ECG 신호의 노이즈를 최소화하고, 이를 통해 R 피크점의 정보를 추출 할 수 있다. 또한, 컴퓨팅 장치는 P, Q, S, T의 피크점의 정보를 추출하고, 추출된 각 피크점의 정보를 ECG 신호의 정 보로 이용함으로써, Self Attention Network의 추가적인 정보로 활용할 수 있다. 여기서, 피크점의 정보는 심 전도 신호의 길이인 4,096의 길이의 벡터로 구성될 수 있다. 컴퓨팅 장치는 각 피크점의 정보를 one-hot vector로 구성함으로써 각 피크점의 정보가 최대화된 심전도 측정 모델의 정보로 활용할 수 있다. 이때, 컴퓨팅 장치는 심전도 측정 장치의 연산 과정을 최소화하기 위해 희소 벡터(Sparse Vector)를 생성 할 수 있다. 컴퓨팅 장치는 희소 벡터를 이용하여 어텐션 함수(Attention Function)에 적용할 수 있는 Query, Key, Value를 생성할 수 있다. 컴퓨팅 장치는 생성된 Query, Key, Value로부터 어텐션 스코어 (Attention Score)를 계산함으로써 심장과 관련된 질환의 발현 가능성을 예측할 수 있다. 어텐션 스코어는 Query, Key, Value로 나뉘어진 모델 내 은닉상태에서 얻어지는 벡터로 심전도 내부의 값들 간의 관계성 및 실제 질환 여부와의 관계성을 이용하여 학습할 수 있다. 어텐션 함수는 아래의 수학식 5와 같이 나타낼 수 있다. 수학식 5"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "수학식 5를 참고하면, 어텐션 함수는 ResBlock 기반의 CNN 모델이기 때문에 입력으로 들어오는 ECG 신호와 각 피크점의 정보를 포함하는 희소 벡터를 이용하여 어텐션 벡터 Vector)를 구성할 수 있다. 컴퓨팅 장치는 상술한 일련의 과정을 모듈화하여 NAS를 적용함으로써, 최적의 장소에 배치할 수 있다. 다시 말해, 컴퓨팅 장 치는 모델 내부에서 각 피크점의 값에 따른 심전도 데이터에 어텐션 벡터를 적용하여 심전도 예측 모델에 서 집중하고자 하는 관심 영역을 결정할 수 있다. 컴퓨팅 장치는 어텐션 스코어를 구하는 것과 같이 Query, Key, Value를 통해 학습되며 다만 심전도 전체의 값들이 아닌 피크점과 피크점 간의 관계, 피크점과 실 제 질환 여부와의 관계성을 학습할 수 있다. 도 5는 본 발명의 일실시예에 따른 심전도 데이터의 관심 영역을 시각화하는 세부 동작을 설명하기 위해 도시한 도면이다. 도 5를 참고하면, 컴퓨팅 장치는 심전도 예측 모델에서 심장과 관련된 질환의 발현 가능성을 예측하기 위 해 집중된 심전도 데이터의 관심 영역을 시각화 할 수 있다. 컴퓨팅 장치는 어텐션 메커니즘에 따른 Grad-CAM을 이용하여 심전도 데이터의 관심 영역을 시각화할 수 있다. 다시 말해, Grad-CAM은 일반적인 CAM과다르게, 마지막 은닉층의 변화도(Gradient)를 측정하여 심전도 데이터의 이미지 상에 중요도를 계산하는 방식일 수 있다. 이는 아래의 수학식 6과 같이 나타낼 수 있다. 수학식 6"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "수학식 6은 K번째 feature map (i, j)의 각 원소 i, j가 출력 클래스 c의 matrix multiplication 값인 에 주는 영향력의 평균을 구할 수 있다. 컴퓨팅 장치는 심전도 데이터의 관심 영역을 시각화할 경우, 변화도 (Gradient)의 픽셀별 평균값인 를 feature map에 곱하여 heatmap을 계산할 수 있다. 이후, 컴퓨팅 장치(10 1)는 pixel-wise sum을 수행한 뒤 ReLU를 적용하여 양의 가중치를 갖는 부분을 평평하게 고르면서 Grad-CAM을 형성할 수 있다. 이러한 Grad-CAM은 도 3의 확장 모델(Scaling-Up Model)의 마지막 Conv 레이어의 Gradient를 계산하여 시각화 를 진행할 수 있다. 이때, ResBlock 내의 Conv 레이어는 반복하면서 사이즈가 줄어 들어 변화도를 계산하더라 도 심전도 데이터의 길이인 4,096의 벡터를 생성함으로써, 컴퓨팅 장치는 Conv 레이어에 의해 반복적으로 줄어든 어텐션 벡터를 중심으로 심전도 데이터의 관심 영역에 대해 시각화할 수 있다. 컴퓨팅 장치는 심 전도 데이터의 길이에 맞추어 주기 위하여 보간하는 과정을 수행할 수 있다. 일례로, 컴퓨팅 장치는 Spline36을 이용하여 보간을 수행할 수 있다. 다시 말해, 컴퓨팅 장치는 4 x 4 크기의 행렬을 Spline36을 통해 보간하면 더 자연스러운 모습으로 시각화할 수 있다. 결국, 컴퓨팅 장치는 특정 기간 내 심장과 관련된 질환의 발현 가능성을 예측한 이후, 예측 결과에 대한 해석이 가능한 AI를 위해 어텐션 메커니즘을 이용하여 시각화를 진행할 수 있다. 또한, 컴퓨팅 장치는 심 전도 예측 모델이 학습 시 어디에 집중하고 있는지에 대한 시각화가 가능함에 따라 실제 의료진들의 소견에 도 움을 줄 수 있다. 도 6은 본 발명의 일실시예에 따른 질환 발병 예측 방법을 설명하기 위해 도시한 흐름도이다. 단계에서 컴퓨팅 장치는 심전도 측정 장치에서 정상동률동으로 측정된 환자의 심전도 데이터를 전처 리할 수 있다. 상세하게, 컴퓨팅 장치는 심전도 측정 장치의 특성에 따라 정상동률동으로 측정된 심전도 데이터의 리드 개수를 고려하여 미리 설정된 리드 개수로 조절할 수 있다. 컴퓨팅 장치는 시간 단위를 갖 는 심전도 데이터에 포함된 노이즈 신호 및 '0'으로 설정된 심전도 수치 중 적어도 하나를 제거할 수 있다. 컴퓨팅 장치는 심전도 데이터에서 노이즈 신호 및, 심전도 수치 중 적어도 하나를 포함하는 샘플 데이터를 제거할 수 있다. 컴퓨팅 장치는 샘플 데이터가 제거된 심전도 데이터에 제로 패딩을 수행하여 심전도 예 측 모델의 입력으로 사용되기 위해 전처리할 수 있다. 단계에서 컴퓨팅 장치는 전처리된 환자의 심전도 데이터를 심전도 예측 모델에 적용하여 특정 기간 이내 심장과 관련된 질환의 발현 가능성을 예측할 수 있다. 자세하게, 컴퓨팅 장치는 심전도 예측 모델에 적용된 환자의 심전도 데이터에 대응하는 베이스 라인 네트워크의 구조를 결정할 수 있다. 컴퓨팅 장치는 베이스 라인 네트워크의 구조에 따른 깊이, 넓이 및 해상도 간 상관 관계를 고려하여 베이스 라인 네트워크를 조정할 수 있다. 컴퓨팅 장치는 조정된 베이스 라인 네트워크를 통해 심전도 데이터로부터 심장과 관련된 질환의 발현 가능 성을 예측할 수 있다. 여기서, 컴퓨팅 장치는 특정 기간 이내에 현재 시점 및/또는 현재 시점으로부터 일 정 시간이 지난 미래 시점에서 심장과 관련된 질환의 발현 가능성을 예측할 수 있다. 단계에서 컴퓨팅 장치는 심전도 예측 모델에서 심장과 관련된 질환의 발현 가능성을 예측하기 위해 집중된 심전도 데이터의 관심 영역을 시각화할 수 있다. 컴퓨팅 장치는 심장과 관련된 질환의 발현 가능 성이 예측된 심전도 데이터의 QRS 파형을 분석하여 심전도 예측 모델에서 집중하고자 하는 심전도 데이터의 관 심 영역을 시각화할 수 있다. 컴퓨팅 장치는 심전도 데이터로부터 심실의 탈분극을 파악하기 위한 QRS 파 형 각각에 대응하는 피크 값을 결정할 수 있다. QRS 파형은 심전도의 기본 파형 중 심내막 내 전도 장애, 차단, 심실부정맥 중 적어도 하나에 의한 심실의 탈분극을 나타내는 파형일 수 있다. 컴퓨팅 장치는 각 QRS 파 별로 결정된 피크 값을 포함하는 어텐션 벡터를 생성할 수 있다. 컴퓨팅 장치 는 심전도 데이터에 어텐션 벡터를 적용하여 심전도 예측 모델에서 집중하고자 하는 관심 영역을 시각화할 수 있다. 이때, 컴퓨팅 장치는 심장과 관련된 질환의 발현 가능성이 예측된 심전도 데이터의 관심 영역에 대응하는 피처 맵을 보간하여 보간된 심전도 데이터의 관심 영역을 시각화할 수 있다. 한편, 본 발명에 따른 방법은 컴퓨터에서 실행될 수 있는 프로그램으로 작성되어 마그네틱 저장매체, 광학적 판 독매체, 디지털 저장매체 등 다양한 기록 매체로도 구현될 수 있다. 본 명세서에 설명된 각종 기술들의 구현들은 디지털 전자 회로조직으로, 또는 컴퓨터 하드웨어, 펌웨어, 소프트 웨어로, 또는 그들의 조합들로 구현될 수 있다. 구현들은 데이터 처리 장치, 예를 들어 프로그램가능 프로세서, 컴퓨터, 또는 다수의 컴퓨터들의 동작에 의한 처리를 위해, 또는 이 동작을 제어하기 위해, 컴퓨터 프로그램 제 품, 즉 정보 캐리어, 예를 들어 기계 판독가능 저장 장치(컴퓨터 판독가능 매체) 또는 전파 신호에서 유형적으 로 구체화된 컴퓨터 프로그램으로서 구현될 수 있다. 상술한 컴퓨터 프로그램(들)과 같은 컴퓨터 프로그램은 컴 파일된 또는 인터프리트된 언어들을 포함하는 임의의 형태의 프로그래밍 언어로 기록될 수 있고, 독립형 프로그 램으로서 또는 모듈, 구성요소, 서브루틴, 또는 컴퓨팅 환경에서의 사용에 적절한 다른 유닛으로서 포함하는 임 의의 형태로 전개될 수 있다. 컴퓨터 프로그램은 하나의 사이트에서 하나의 컴퓨터 또는 다수의 컴퓨터들 상에 서 처리되도록 또는 다수의 사이트들에 걸쳐 분배되고 통신 네트워크에 의해 상호 연결되도록 전개될 수 있다. 컴퓨터 프로그램의 처리에 적절한 프로세서들은 예로서, 범용 및 특수 목적 마이크로프로세서들 둘 다, 및 임의 의 종류의 디지털 컴퓨터의 임의의 하나 이상의 프로세서들을 포함한다. 일반적으로, 프로세서는 판독 전용 메 모리 또는 랜덤 액세스 메모리 또는 둘 다로부터 명령어들 및 데이터를 수신할 것이다. 컴퓨터의 요소들은 명령 어들을 실행하는 적어도 하나의 프로세서 및 명령어들 및 데이터를 저장하는 하나 이상의 메모리 장치들을 포함 할 수 있다. 일반적으로, 컴퓨터는 데이터를 저장하는 하나 이상의 대량 저장 장치들, 예를 들어 자기, 자기-광 디스크들, 또는 광 디스크들을 포함할 수 있거나, 이것들로부터 데이터를 수신하거나 이것들에 데이터를 송신하 거나 또는 양쪽으로 되도록 결합될 수도 있다. 컴퓨터 프로그램 명령어들 및 데이터를 구체화하는데 적절한 정 보 캐리어들은 예로서 반도체 메모리 장치들, 예를 들어, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD-ROM(Compact Disk Read Only Memory), DVD(Digital Video Disk)와 같은 광 기 록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media), 롬 (ROM, Read Only Memory), 램(RAM, Random Access Memory), 플래시 메모리, EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM) 등을 포함한다. 프로세서 및 메모리는 특수 목적 논리 회로조직에 의해 보충되거나, 이에 포함될 수 있다. 또한, 컴퓨터 판독가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용매체일 수 있고, 컴퓨터 저장매체 및 전송매체를 모두 포함할 수 있다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특정한 특징들 은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양한 특징들 역 시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특 정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부터의 하나 이 상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 마찬가지로, 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시형태의 다양한 장치 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되어서는 안되며, 설명한 프로그램 컴포넌트와 장치들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거나 다중 소프트웨어 제품에 패키징 될 수 있다는 점을 이해하여야 한다. 한편, 본 명세서와 도면에 개시된 본 발명의 실시 예들은 이해를 돕기 위해 특정 예를 제시한 것에 지나지 않으 며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상"}
{"patent_id": "10-2022-0080709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 에게 자명한 것이다."}
{"patent_id": "10-2022-0080709", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 환자의 심전도 데이터를 이용하여 특정 기간 내 심방세동을 예측하기 위한 전반적인 구성을 도시한 도면이다. 도 2는 본 발명의 일실시예에 따른 컴퓨팅 장치의 프로세서가 수행하는 동작을 설명하기 위해 도시한 도면이다. 도 3은 본 발명의 일실시예에 따른 심방세동이 발생할 지를 예측하기 위한 특정 기간에 관한 윈도우 사이즈를 나타낸 도면이다. 도 4는 본 발명의 일실시예에 따른 심전도 예측 모델에서 심방세동을 예측하는데 집중된 심전도 데이터의 관심 영역을 도출하는 세부 동작을 설명하기 위해 도시한 도면이다. 도 5는 본 발명의 일실시예에 따른 심전도 데이터의 관심 영역을 시각화하는 세부 동작을 설명하기 위해 도시한 도면이다. 도 6은 본 발명의 일실시예에 따른 질환 발병 예측 방법을 설명하기 위해 도시한 흐름도이다."}
