{"patent_id": "10-2007-0075127", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2009-0011490", "출원번호": "10-2007-0075127", "출원인": "(주)케이티에프테크놀로지스", "발명자": "문상빈"}}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메모리부;네트워크를 통해 발신 단말기로부터 화상 전화 기능 수행을 위한 데이터 스트림을 수신하는 수신부; 및 상기 데이터 스트림에 상응하는 데이터 중 전부 또는 일부가 상기 메모리부에 저장되도록 제어한 후, 상기 발신단말기로부터 전화 통화 요청을 다시 수신하면 상기 저장된 데이터가 출력되도록 제어 하는 제어부를 포함하는이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 데이터는 상기 이동 단말기와 상기 발신 단말기간의 전화 통화가 개시될 때까지 출력이 지속되는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 이동 단말기는 상기 데이터에 상응하는 영상이 디스플레이되는 화면부를 더 포함하는 것을 특징으로 하는이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 메모리부는 RAM(random access memory)이나 플래쉬메모리(flash memory) 또는 그 밖의 정보를 저장할 수있는 저장 매체 중 하나 이상을 포함할 수 있는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 메모리부는 상기 데이터를 임시적으로 저장하는 임시 메모리부와 상기 제어부의 제어에 의해 상기 임시 메모리부에 저장된 상기 데이터 중 일부 또는 전부의 데이터가 저장되는 고정 메모리부를 포함하는 것을 특징으로하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 임시 메모리부와 상기 고정 메모리부는 각각의 독립적인 메모리일수도 있고 하나의 메모리내의 구분되는영역을 나타낼 수도 있는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 제어부는 미리 지정된 설정 조건에 따라 상기 데이터 스트림 중 상기 설정 조건을 만족 시키는 데이터를임시 메모리부에 저장되도록 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제어부는 상기 임시 메모리부에 저장된 데이터에 대한 고정 메모리부로 이동 또는 복사 저장 명령 입력되거나, 상기 발신 단말기와의 전화 통화 종료 시점에서 상기 임시 메모리부에 저장된 데이터가 상기 고정 메모리부로 이동 또는 복사되도록 제어하는 것을 특징으로 하는 이동 단말기.- 2 -공개특허 10-2009-0011490청구항 9 제7항에 있어서, 상기 설정 조건은 정해진 시간 이후에 수신되는 데이터를 저장하도록 설정하는 조건인 것을 특징으로 하는 이동단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 설정 조건은 영상 인식 또는 음성 인식을 통한 인공지능을 이용하여 상대방을 인식할 수 있는 정보를 포함하는 데이터를 저장하는 조건인 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,단말기의 클럭 신호를 이용하여 시간 경과에 대한 정보를 생성하여 상기 제어부로 출력하는 타이머부를 더 포함하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제어부는 상기 타이머부로부터 제공되는 시간 경과에 대한 정보가 디폴트로 지정된 또는 사용자에 의해 지정된 시간에 부합하는 것으로 인식되면 상기 데이터의 저장이 개시되도록 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제어부는 디폴트로 지정된 또는 사용자에 의해 지정된 시간 동안 상기 데이터의 저장이 지속되도록 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 제어부는 상기 임시 메모리에 저장된 데이터가 상기 수신 단말기의 사용자의 선택 또는 저장된 프로그램에의해 고정 메모리부로 이동하여 저장되도록 제어하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 제어부에 의해 저장되도록 제어되는 상기 데이터는 발신 단말기 사용자의 모습을 포함하는 영상 데이터이고,상기 제어부는 상기 데이터 스트림을 해석하여 상기 영상 데이터를 추출하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 영상 데이터는 정지영상 데이터 또는 동영상 데이터인 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,상기 제어부는 상기 데이터 스트림에서 추출된 음성 데이터 중 음성인식 기술에 의해 추출된 개인 정보에 관한- 3 -공개특허 10-2009-0011490음성 데이터를 상기 메모리부에 저장하는 것을 특징으로 하는 이동 단말기."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "이동 단말기가 데이터를 저장 및 출력 하는 방법에 있어서,a)설정 조건이 저장되고 수신 데이터 스트림 중 상기 설정 조건을 만족 시키는 데이터가 저장되기 위하여 상기데이터 스트림 중 상기 설정 조건을 만족 시키는지 판단하는 단계; b)상기 수신 데이터 스트림 중 상기 설정 조건을 만족 시키는 데이터를 저장하는 단계;c)통화 종료 후 상기 저장된 데이터와 수신 전화번호가 매칭되어 저장되는 단계;d)상기 저장된 전화번호와 동일한 전화번호가 수신되는 경우, 상기 전화번호에 매칭되어 저장된 데이터가 출력되는 단계를 포함하는 이동 단말기의 데이터 저장 및 출력 방법."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 a)단계에서 상기 설정 조건은 통화 개시시 후 통화 종료시까지의 시간 중 어느 한 시간을 선택하여 상기선택 시간 이후에 상기 수신 데이터가 저장되도록 제어하기 위한 조건인 것을 특징으로 하는 이동 단말기의 데이터 저장 및 출력 방법."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서,상기 a)단계에서 상기 설정 조건은 비디오 데이터가 저장되는 경우에 상대방 영상의 초점이 맞추어지고 상기 상대방 영상이 일정 비율 이상 표시되는 조건인 것을 특징으로 하는 이동 단말기의 데이터 저장 및 출력 방법."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제18항에 있어서,상기 a)단계에서 상기 설정 조건은 오디오 데이터가 저장되는 경우에 상대방의 음성을 포함하는 상기 오디오 데이터 중 상기 상대방을 인식할 수 있는 단어나 문장이 포함되는 조건인 것을 특징으로 하는 이동 단말기의 데이터 저장 및 출력 방법."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제18항에 있어서,상기 b)단계는 상기 설정 조건에 만족되는 데이터를 임시 메모리부에 저장하는 것을 더 포함하는 단계이고,상기 c)단계는 통화 종료 후 상기 임시 메모리부에 저장된 데이터가 고정 메모리부로 복사 또는 이동되어 수신전화번호와 매칭되어 저장되는 것을 더 포함하는 것을 특징으로 하는 이동 단말기의 데이터 저장 및 출력 방법."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제18항에 있어서,상기 c)단계에서 상기 저장 데이터 중 저장 순서가 가장 오래된 순서로 상기 저장 데이터를 삭제하거나, 상기저장 데이터를 선택하여 삭제하는 과정을 더 포함하는 것을 특징으로 하는 이동 단말기의 데이터 저장 및 출력방법."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제18항에 있어서,상기 c)단계에서 상기 매칭시키는 방법은 저장되는 상기 데이터의 주소를 상기 수신 전화번호의 정보를 포함하는 데이터에 기록하고 상기 수신 전화번호는 테이블 형태의 주소록이나 전화번호부에 기록하는 방법인 것을 특징으로 하는 데이터를 저장 및 출력할 수 있는 이동 단말기의 데이터 저장 및 출력 방법.- 4 -공개특허 10-2009-0011490청구항 25 제18항에 있어서,상기 b)단계에서 상기 데이터가 비디오 데이터인 경우 상기 저장되는 데이터는 정지영상 데이터 이거나 동영상데이터인 것을 특징으로 하는 데이터를 저장 및 출력할 수 있는 이동 단말기의 데이터 저장 및 출력 방법."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제18항에 있어서,상기 c)단계에서 기존에 저장된 데이터가 존재하는 경우 상기 기존에 저장된 데이터를 업그레이드 할 것인지를판단하여 업그레이드를 하는 경우에만 상기 데이터를 저장하는 과정을 더 포함하는 것을 특징으로 하는 이동 단말기의 데이터 저장 및 출력 방법."}
{"patent_id": "10-2007-0075127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제18항에 있어서,상기 d)단계에서 상기 데이터가 출력되면서 화면 하단에 최근 통화 정보나 최근 수신 메시지가 함께 표시되는것을 특징으로 하는 이동 단말기의 데이터 저장 및 출력 방법.명 세 서발명의 상세한 설명 기 술 분 야본 발명은 상대방의 정보를 저장 및 출력하는 이동 단말기와 그 방법에 관한 것으로 보다 상세하게는 수신데이 <1>터를 전화번호와 매칭시켜 저장하고, 저장된 데이터와 매칭되는 전화번호를 수신하는 경우에 저장되어 있는 데이터를 출력할 수 있는 단말기 및 그 방법에 관한 것이다. 배 경 기 술 기존의 이동 단말기는 상대방의 정보를 사용자가 직접 입력하여 저장하는 방식이었다. 상대방의 전화번호나 이 <2>름 그 밖의 신상정보를 텍스트로 저장하였고, 카메라가 장착되어 있는 이동 단말기의 경우에는 상대방의 영상을이미지화하여 저장하였다. 그러나 상기와 같은 종래의 방법은 사용자가 직접 상대방의 정보를 알고 미리 입력해야 하고 새로운 정보를 입력 하기 위해서는 매번 사용자의 입력 행위를 필요로 한다.최근에는 영상 통신 서비스도 상용화되어 있다. 종래의 영상 이동 단말기는 통화시에 상대방의 영상을 저장함에 <3>있어 저장에 관한 제어 신호가 입력되고 상기 제어 신호가 입력된 후에 상대방의 영상이 저장되는 방법이었다.따라서 사용자는 영상 통화시에 상대방에 대한 영상을 저장 하기 위해서는 반드시 제어신호를 입력해야 하였다. 발명의 내용 해결 하고자하는 과제상기한 바와 같은 종래기술의 문제점을 해결하기 위해, 본 발명은 상대방 단말기로부터 수신된 데이터를 자동으 <4>로 저장하고, 저장된 데이터를 출력하는 이동 단말기와 그 방법을 제공하기 위한 것이다.이를 위하여, 단말에 데이터가 저장되기 위한 설정 조건이 마련되고 상기 수신 데이터 중에 상기 설정 조건에 <5>맞는 데이터가 자동으로 저장되도록 한다. 이후에 동일한 전화번호를 가진 호가 수신되면 상기 저장된 데이터가출력된다. 따라서 사용자는 통화가 개시되기 전에 상대방을 인식할 수 있다. 이외의 본 발명의 목적들은 하기의 실시예에 대한 설명을 통해 쉽게 이해될 수 있을 것이다. <6> 과제 해결수단위에 설명한 바와 같은 목적을 달성하기 위해, 본 발명의 일 측면에 따르면, 메모리부와 네트워크를 통해 발신 <7>단말기로부터 화상 전화 기능 수행을 위한 데이터 스트림을 수신하는 수신부 및 상기 데이터 스트림에 상응하는- 5 -공개특허 10-2009-0011490데이터 중 전부 또는 일부가 상기 메모리부에 저장되도록 제어한 후, 상기 발신 단말기로부터 전화 통화 요청을다시 수신하면 상기 저장된 데이터가 출력되도록 제어 하는 제어부를 포함하는 이동 단말기가 제공된다. 여기서, 상기 데이터는 상기 이동 단말기와 상기 발신 단말기간의 전화 통화가 개시될 때까지 출력이 지속되는 <8>것을 특징으로 할 수 있다. 여기서, 상기 이동 단말기는 상기 데이터에 상응하는 영상이 디스플레이되는 화면부를 더 포함할 수 있다. <9>여기서, 상기 메모리부는 RAM(random access memory)이나 플래쉬메모리(flash memory) 또는 그 밖의 정보를 저 <10>장할 수 있는 저장 매체 중 하나 이상을 더 포함할 수 있다.여기서, 상기 메모리부는 상기 데이터를 임시적으로 저장하는 임시 메모리부와 상기 제어부의 제어에 의해 상기 <11>임시 메모리부에 저장된 상기 데이터 중 일부 또는 전부의 데이터가 저장되는 고정 메모리부를 더 포함할 수 있다.여기서, 상기 임시 메모리부와 상기 고정 메모리부는 각각의 독립적인 메모리일수도 있고 하나의 메모리내의 구 <12>분되는 영역을 나타낼 수도 있는 것을 특징으로 할 수 있다.여기서, 상기 제어부는 미리 지정된 설정 조건에 따라 상기 데이터 스트림 중 상기 설정 조건을 만족 시키는 데 <13>이터를 임시 메모리부에 저장되도록 제어하는 것을 특징으로 할 수 있다.여기서, 상기 제어부는 상기 임시 메모리부에 저장된 데이터에 대한 고정 메모리부로 이동 또는 복사 저장 명령 <14>입력되거나, 상기 발신 단말기와의 전화 통화 종료 시점에서 상기 임시 메모리부에 저장된 데이터가 상기 고정메모리부로 이동 또는 복사되도록 제어하는 것을 특징으로 할 수 있다.여기서, 상기 설정 조건은 정해진 시간 이후에 수신되는 데이터를 저장하도록 설정하는 조건인 것을 특징으로 <15>할 수 있다.여기서, 상기 설정 조건은 영상 인식 또는 음성 인식을 통한 인공지능을 이용하여 상대방을 인식할 수 있는 정 <16>보를 포함하는 데이터를 저장하는 조건인 것을 특징으로 할 수 있다.여기서, 단말기의 클럭 신호를 이용하여 시간 경과에 대한 정보를 생성하여 상기 제어부로 출력하는 타이머부를 <17>더 포함할 수 있다.여기서, 상기 제어부는 상기 타이머부로부터 제공되는 시간 경과에 대한 정보가 디폴트로 지정된 또는 사용자에 <18>의해 지정된 시간에 부합하는 것으로 인식되면 상기 데이터의 저장이 개시되도록 제어하는 것을 특징으로 할 수있다.여기서, 상기 제어부는 디폴트로 지정된 또는 사용자에 의해 지정된 시간 동안 상기 데이터의 저장이 지속되도 <19>록 제어하는 것을 특징으로 할 수 있다.여기서, 상기 제어부는 상기 임시 메모리에 저장된 데이터가 상기 수신 단말기의 사용자의 선택 또는 저장된 프 <20>로그램에 의해 고정 메모리부로 이동하여 저장되도록 제어하는 것을 특징으로 할 수 있다.여기서, 상기 제어부에 의해 저장되도록 제어되는 상기 데이터는 발신 단말기 사용자의 모습을 포함하는 영상 <21>데이터이고, 상기 제어부는 상기 데이터 스트림을 해석하여 상기 영상 데이터를 추출하는 것을 특징으로 할 수있다.여기서, 상기 영상 데이터는 정지영상 데이터 또는 동영상 데이터인 것을 특징으로 할 수 있다. <22>여기서, 상기 제어부는 상기 데이터 스트림에서 추출된 음성 데이터 중 음성인식 기술에 의해 추출된 개인 정보 <23>에 관한 음성 데이터를 상기 메모리부에 저장하는 것을 특징으로 할 수 있다.또는, 이동 단말기가 데이터를 저장 및 출력 하는 방법에 있어서, a)설정 조건이 저장되고 수신 데이터 스트림 <24>중 상기 설정 조건을 만족 시키는 데이터가 저장되기 위하여 상기 데이터 스트림 중 상기 설정 조건을 만족 시키는지 판단하는 단계; b)상기 수신 데이터 스트림 중 상기 설정 조건을 만족 시키는 데이터를 저장하는 단계;c)통화 종료 후 상기 저장된 데이터와 수신 전화번호가 매칭되어 저장되는 단계; d)상기 저장된 전화번호와 동일한 전화번호가 수신되는 경우, 상기 전화번호에 매칭되어 저장된 데이터가 출력되는 단계를 포함하는 이동 단말기의 데이터 저장 및 출력 방법이 제공된다. 여기서, 상기 a)단계에서 상기 설정 조건은 통화 개시시 후 통화 종료시까지의 시간 중 어느 한 시간을 선택하 <25>- 6 -공개특허 10-2009-0011490여 상기 선택 시간 이후에 상기 수신 데이터가 저장되도록 제어하기 위한 조건인 것을 특징으로 할 수 있다.여기서, 상기 a)단계에서 상기 설정 조건은 비디오 데이터가 저장되는 경우에 상대방 영상의 초점이 맞추어지고 <26>상기 상대방 영상이 일정 비율 이상 표시되는 조건인 것을 특징으로 할 수 있다.여기서, 상기 a)단계에서 상기 설정 조건은 오디오 데이터가 저장되는 경우에 상대방의 음성을 포함하는 상기 <27>오디오 데이터 중 상기 상대방을 인식할 수 있는 단어나 문장이 포함되는 조건인 것을 특징으로 할 수 있따.여기서, 상기 b)단계는 상기 설정 조건에 만족되는 데이터를 임시 메모리부에 저장하는 것을 더 포함하는 단계 <28>이고, 상기 c)단계는 통화 종료 후 상기 임시 메모리부에 저장된 데이터가 고정 메모리부로 복사 또는 이동되어수신 전화번호와 매칭되어 저장되는 것을 더 포함하는 것을 특징으로 할 수 있다.여기서, 상기 c)단계에서 상기 저장 데이터 중 저장 순서가 가장 오래된 순서로 상기 저장 데이터를 <29>삭제하거나, 상기 저장 데이터를 선택하여 삭제하는 과정을 더 포함하는 것을 특징으로 할 수 있다.여기서, 상기 c)단계에서 상기 매칭시키는 방법은 저장되는 상기 데이터의 주소를 상기 수신 전화번호의 정보를 <30>포함하는 데이터에 기록하고 상기 수신 전화번호는 테이블 형태의 주소록이나 전화번호부에 기록하는 방법인 것을 특징으로 할 수 있다.여기서, 상기 b)단계에서 상기 데이터가 비디오 데이터인 경우 상기 저장되는 데이터는 정지영상 데이터 이거나 <31>동영상 데이터인 것을 특징으로 할 수 있다.여기서, 상기 c)단계에서 기존에 저장된 데이터가 존재하는 경우 상기 기존에 저장된 데이터를 업그레이드 할 <32>것인지를 판단하여 업그레이드를 하는 경우에만 상기 데이터를 저장하는 과정을 더 포함하는 것을 특징으로 할수 있다.여기서, 상기 d)단계에서 상기 데이터가 출력되면서 화면 하단에 최근 통화 정보나 최근 수신 메시지가 함께 표 <33>시되는 것을 특징으로 할 수 있다. 효 과상술한 바와 같이 본 발명에 따르면, 수신데이터를 자동으로 저장할 수 있는 효과가 있다. <34>또한 저장된 상대방의 동영상이나 정지영상을 통화 전에 출력하여 상대방이 누구인지를 상대방의 영상을 통해 <35>확인할 수 있는 효과가 있다.또한 저장된 상대방의 음성을 통화 전에 출력하여 상대방이 누구인지를 음성을 통해 확인할 수 있는 효과가 있 <36>다.또한 저장된 데이터를 필요에 따라 최신 정보로 업그레이드 할 수 있는 효과가 있다. <37> 발명의 실시를 위한 구체적인 내용본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 <38>상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야한다.본 명세서에서 어떤 구성요소로부터 다른 구성요소에 \"포함하는\" 또는 \"구성된\" \"생성된\" 등의 용어는 명세서 <39>상에 기재된 특징, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. <40>이하에서, 본 발명에 따른 상대방의 정보를 저장 및 출력하는 이동 단말기와 그 방법에 관한 실시예를 도면을 <41>- 7 -공개특허 10-2009-0011490참조하여 상세하게 설명하기로 한다.상술한 본 발명의 구성, 특징 및 장점은 다음의 실시예들을 통한 상세한 설명을 통하여 보다 분명해 질 것이다. <42>우선 각 도면의 구성요소들에 참조 번호를 부가함에 있어서, 동일한 구성요소들에 한해서는 비록 다른 도면상에표시되더라도 가능한 한 동일한 번호를 가지도록 하고 있음에 유의하여야 한다.도 1은 본 발명의 실시예에 따른 단말기의 기능블럭도를 나타낸 도면이다. <43>도 1을 참조하면 본 발명의 단말기는 수신부(100), 제어부(120), 메모리부(130), 화면부(140), 음성부(150), 타 <44>이머부(160)를 포함한다. 메모리부(130)는 임시 메모리부(132)와 고정 메모리부(134)를 포함할 수 있다.수신부(100)는 네트워크를 통해 상대방 단말기로부터 전송된 데이터 스트림을 수신 받는 기능을 수행 한다. <45>제어부(120)는 상기 수신된 데이터 스트림 중에 설정 조건에 맞는 데이터를 식별하고, 식별된 데이터가 메모리 <46>부(130)에 저장 및 상기 저장된 데이터가 출력되도록 제어하는 기능을 수행한다. 예를 들어 사용자는 상대방 단말기로부터 수신되는 데이터 스트림 중에 저장하고자 하는 데이터를 지정하기 위 <47>한 설정 조건을 입력부(미도시)를 이용하여 입력하며, 입력된 설정 조건은 메모리부의 고정 메모리부(134)에 저장된다. 이후, 제어부(120)는 상대방 단말기로부터 수신되는 데이터 스트림 중에서 미리 저장된 설정 조건에 맞는 데이터를 식별하여 상기 임시 메모리부(132)에 저장한다. 상기 임시 메모리부(132)에 저장된 상기 데이터는통화 종료 후에 상기 고정 메모리부(134)에 복사 또는 이동되어 확정적으로 저장된다. 또한 제어부(120)는 저장된 데이터의 타입(예를 들어, 오디오 데이터, 비디오 데이터 등)을 구분하여 데이터 타입에 맞는 출력장치로 출력하는 기능을 더 수행할 수 있다. 상술한 설정 조건은 예를 들어, 시간에 대한 조건, 인공지능을 이용하여 수신되는 데이터 스트림 중 상대방의 <48>인식 정보를 가지는 데이터를 식별 가능하도록 하는 조건 등 중 어느 하나일 수 있다.예를 들어 설정 조건이 시간에 대한 조건인 경우 제어부(120)는 통화 개시 후 특정 시간을 설정하여 수신되는 <49>데이터 스트림 중 설정된 시간 이후에 수신되는 데이터가 저장 개시되도록 제어 할 수 있다.예를 들어 비디오 데이터를 식별하도록 설정된 설정 조건인 경우, 화면부(140)에 표시되는 영상의 RGB 값, 화면 <50>대 영상의 표시비율 등을 구별을 할 수 있으며, 오디오 데이터를 식별하도록 설정된 설정 조건인 경우에는 단어및 문장의 구별을 할 수 있다. 비디오 데이터를 저장하는 경우에는 화면에 표시되는 영상이 존재하는 경우에화면에 영상으로 표시되는 비디오 데이터를 저장하도록 할 수 있다. 오디오 데이터를 저장하는 경우에는 음성으로 출력되는 오디오 데이터가 존재하는 경우에 음성으로 출력되는 오디오 데이터를 저장하도록 할 수 있다. 영상과 음성으로 출력되는 비디오 데이터와 오디오 데이터가 모두 존재하는 경우에는 음성을 포함하는 동영상 형태의 비디오 데이터와 오디오 데이터를 함께 저장 할 수 있으며, 비디오 데이터를 우선으로 하여 저장할 수도있으며 그 반대의 경우로 오디오 데이터를 우선으로 하여 저장 할 수 도 있다. 메모리부(130)는 RAM(random access memory)이나 그 밖의 정보를 저장할 수 있는 저장 매체 중 하나 이상을 포 <51>함할 수 있다. 메모리부(130)는 제어부(120)에 의해서 식별된 데이터가 저장되는 곳으로서 임시 메모리부(132)와 고정 메모리부(134)로 구별할 수 있다. 또한 메모리부(130)에는 상대방을 인식 할 수 있는 단어나 문장이저장되어 있는 DB(121)를 더 포함 할 수 있다. DB(121)는 고정 메모리부(134)에 포함될 수 있다.임시 메모리부(132)는 제어부(120)에 의해 식별된 데이터가 임시로 저장되는 곳으로 통화가 종료되기 전 또는 <52>통화 종료 후 미리 지정된 시점까지 데이터가 임시로 저장이 되는 장소이다. 이에 비해, 고정 메모리부(134)는통화 종료 후에 임시 메모리부(132)에 저장되어 있던 데이터가 이동되어 확정적으로 저장되는 장소이다. 사용자는 고정 메모리부(134)에 저장된 데이터를 키조작을 통해 삭제할 수 있음은 자명하다.또한 고정 메모리부(134)에 저장되어 있는 데이터는 제어부(120)의 제어에 의해 화면부(140) 또는 음성부(150) <53>로 출력될 수 있다. 상기 임시 메모리부(132)와 고정 메모리부(134)는 각각 독립적인 메모리일 수도 있고 하나의 메모리에 포함된 서로 다른 저장영역일 수도 있다. 화면부(140)는 LCD(Liquid Crystal Display), TFT(Thin Film Transistor), OLED(Organic Light Emitting <54>Diode)와 같은 디스플레이 모듈을 포함할 수 있다. 화상 통화 시에 화면부(140)를 통해 상대방의 영상이 디스플레이된다. 또한 호 착신시 수신된 상대방 단말기의 전화번호에 상응하도록 저장된 비디오 데이터가 미리 저장된경우 제어부(120)의 제어에 의해 해당 비디오 데이터가 사용자의 호 응답시까지 화면부(140)를 통해 출력될 수있다. 그 외에 영상으로 표현되는 정보(예를 들어 게임이나 동영상 재생 등)가 표시됨은 자명하다. - 8 -공개특허 10-2009-0011490음성부(150)는 스피커나 마이크 등을 포함하며 음성 및 음향으로 표현되는 오디오 데이터 및/또는 음원 데이터 <55>를 입력받거나 출력할 수 있다. 음성부(150)에는 스피커나 마이크 중 하나 이상이 포함될 수 있다. 음성부(150)는 음성 통화 시 상대방 단말기로부터 수신한 음성 데이터에 상응하는 음성을 출력하며, 호 착신시 수신된 상대방 단말기의 전화번호에 상응하도록 저장된 오디오 데이터가 미리 저장된 경우 제어부(120)의 제어에 의해 해당 오디오 데이터가 사용자의 호 응답시까지 음성부(150)를 통해 출력될 수 있다. 또한 단말에 구비된 멀티미디어 기능(예를 들어 엠피쓰리 데이터 재생이나 동영상 재생 등)의 이용시에 음성부(150)를 통해 음성 및 음향 출력이 가능함은 당업자에게 자명하다.타이머부(160)는 디폴트로 설정되어 있는 시간 혹은 사용자가 임의로 설정한 시간에 신호를 출력하는 기능을 수 <56>행한다. 타이머부(160)는 설정되어 있는 시간에 제어부(120)로 신호를 출력한다. 제어부(120)에서는 타이머부(160)로부터 입력되는 신호를 이용하여 데이터의 저장을 개시하도록 제어한다. 예를 들어 단말에 통화 개시 시로부터 5초 이후에 2초간 데이터를 저장하도록 설정이 되어 있다면, 타이머부(160)에서 통화 개시 5초 이후에 2초간 신호를 제어부(120)로 출력한다. 제어부(120)는 타이머부(160)로부터 신호를 입력 받는 동안 수신받는 데이터(또는 표시를 위해 디코딩된 비디오 데이터 및/또는 오디오 데이터)가 임시 메모리부(132)에 저장되도록 제어한다. 수신받는 데이터를 통화 개시 이후에 즉시 저장하지 않는 이유는 영상통화시에는 상대방의 모습이 제대로 화면 <57>부(140)에 표시 되고 상대방 (또는 발신자)의 자연스러운 표정이 화면에 표시되기까지는 얼마간의 시간이 걸릴수 있기 때문이다. 또한 음성통화의 경우에는 상대방이 자신의 신원을 나타내기까지는 통화 개시 후에 '여보세요'라는 말을 한 후이거나 사용자가 상대방이 누구인지를 물어보고 나서야 상대방이 자신의 신원을 밝히기 때문이다. 상기 설정시간은 데이터의 종류(비디오 데이터, 오디오 데이터) 및 사용자의 편의에 의해 변경이 될 수있다.도 2는 본 발명의 일 실시예로서 비디오 데이터를 저장하는 방법을 나타낸 도면이다. <58>화면부(140)의 디스플레이되는 영상 중 피사체에 해당하는 상대방의 모습이 전체 화면 중에 일정 비율 이상 표 <59>시가 되는 경우에 상기 영상을 표시하는 비디오 데이터가 저장되도록 설정한다. 도 2의 (a)는 화면부의 화면을 나타낸 것으로 전체 화면을 64등분하여 예시한 것이다. 분할된 각각의 화면을 하 <60>나의 \"셀\"이라고 가정하면 화면은 총 64개의 셀로 구성되어 있다. 상기 셀은 반드시 64개로 구성될 필요는 없으며 설정 조건 및 단말 구성에 따라 변경 가능하다. 이 분할된 화면 중에서 일정 개수 이상의 셀에 상대방의 모습이 표시되어야만 수신되는 비디오 데이터가 저장되도록 설정이 될 수 있다.예를 들어 상기 하나의 분할된 셀은 1/64=0.015625 이므로, 전체 화면의 1.5625%를 차지하게 된다. 따라서, 전 <61>체화면 중 상대방의 모습이 30%이상 표시 되어야만 수신되는 비디오 데이터가 저장되도록 설정한다면30/1.5625=19.2 이므로 약 20개 정도의 셀에 상대방의 모습이 표시되어야 한다. 그러나 상대방의 모습이 전체 화면의 30%이상 표시 된다고 하더라도, 상대방의 모습이 화면의 한쪽으로 치우쳐 <62>져 있다거나 상대방의 얼굴이 잘 나타나 있지 않는다면 상대방이 누구인지를 인식하기가 쉽지 않다. 예를 들어 도 2의 (b)를 보면 상대방의 모습이 전체 화면의 30% 이상 표시되고 있으나 상대방 얼굴이 정면으로 <63>나타나 있지 않으므로 상대방이 누구인지를 구분하기가 쉽지 않다. 따라서 상대방의 모습이 전체 화면의 30%를넘고 상대방의 얼굴이 화면의 중앙부에 위치하는 경우에만 비디오 데이터가 저장되도록 설정이 될 수 있다. 상대방의 얼굴이 화면에 표시되는 것을 인식하는 방법은 얼굴을 나타내는 색상의 값을 인식하여 알아낼 수 <64>있다. 예를 들어 사람의 피부색의 RGB 값의 범위를 설정하여 상기 설정된 RGB 색상 값이 화면에 표시되면 상대방의 얼굴이 화면에 표시된 것으로 인식할 수 있다.단 사람마다 또는 인종마다 피부색이 다르고 또한 주위 배경에 따라 얼굴 색상이 변동될 수 있으므로 상기 RGB <65>값을 특정 값으로 설정하지 않고, 인종의 피부색의 범위나 배경에 따라 일반적으로 변동될 수 있는 범위를 고려하여 범위 값으로 설정한다. 또한 상대방의 얼굴이 화면의 중앙에 위치되어야 하므로 분할된 셀 중 19, 20, 21,22, 27, 28, 29, 30, 35, 36, 37, 38, 43, 44, 45, 46번 위치의 셀에 표시되는 RGB값을 인식하여 상대방의 얼굴이 화면의 중앙부에 위치하는지를 판단한다. 예를 들어 상기 분할된 셀 중 19, 20, 21, 22, 27, 28, 29, 30, 35, 36, 37, 38, 43, 44, 45, 46번 위치의 셀 <66>에 표시되는 RGB 값 중 상기 사람의 얼굴을 표시하는 RGB값으로 설정된 범위 내에 속하는 RGB 값이 10개 이상의셀에 표시되는 경우에, 상대방의 얼굴이 화면의 중앙부에 위치하고 있다고 판단할 수 있다.- 9 -공개특허 10-2009-0011490또한 상대방의 얼굴이 정면 모습으로 표시되고 있는지 또는 측면 모습으로 표시되고 있는지는 표시되는 얼굴 이 <67>미지의 특징점 추출 및 분석(예를 들어, 눈의 위치, 코 및 입의 위치, 미간 거리 등)을 통해 식별할 수 있으며,이를 위한 특징점 추출 및 분석 방법은 당업자에게 자명하므로 이에 대한 설명은 생략한다.도 2의 (c)는 상술한 모든 것을 고려한 예로서 상대방의 모습이 전체화면의 30%이상 표시되고 상대방의 얼굴이 <68>화면의 중앙부에 위치 되여 있는 것을 나타낸 실시예이다. 도 2의 c를 보면 분할된 화면 중 20개 이상의 셀에상대방의 모습이 표시되어 있다. 또한 19, 20, 21, 22, 27, 28, 29, 30, 35, 36, 37, 38, 43, 44, 45, 46번 위치의 셀에 표시되는 RGB값을 조사하여 보면 20, 21, 28, 29, 30, 35, 36, 37, 38, 43, 44, 45, 46번 위치의 셀에 표시되는 RGB값이 사람의 얼굴을 나타내는 RGB 값의 범위 안에 포함된다고 판단할 수 있다. 따라서 도 2의(c)에 표시되는 화면은 비디오 데이터를 저장하는 설정 조건에 맞는 화면으로 메모리부(130)에 저장이 된다. 상기 화면에 표시되는 상대방의 모습과 RGB값의 판단은 제어부(120)에서 수행된다. 상술한 방법에 덧붙여 상대방 영상의 선명도 역시 고려가 된다. 상술한 조건을 만족하더라도 상대방 영상이 초 <69>점이 안 맞아 흐릿하게 표시가 되면 상대방이 누구인지를 알아보기 힘들기 때문이다. 따라서 상술한 방법에 덧붙여 상대방 영상의 초점이 제대로 맞추어진 선명한 영상인 경우에만 상대방 영상을 저장하도록 할 수 있다. 상대방 영상이 초점이 제대로 맞추어진 선명한 영상인지의 판단은 화면에 표시되는 상대방의 영상의 윤곽선을 검출 필터나 에지 검출등의 방법을 이용하여 판단하는 방법일 수 있다. 영상의 선명도를 판별하는 방법은 이 기술분야에서 통상의 지식을 가진 자에게 자명한 사항이므로 상세한 설명은 생략하도록 한다. 도 3은 본 발명의 일 실시예에 따른 오디오 데이터를 저장하는 방법을 나타낸 도면이다. <70>네트워크를 통해 수신되는 오디오 데이터 중 상대방을 식별하여 상대방의 식별 정보를 메모리부(130)에 저장하 <71>는 실시예는 다음과 같다. 메모리부(130)에 DB(121)를 더 포함하여 신분이나 직업을 나타내는 단어나 문장을 오디오 데이터 또는 덱스트 <72>형태로 DB(121)에 저장을 한다. 이어서 상대방이 전송하는 오디오 데이터와 DB(121)에 저장되어 있는 데이터를비교한다. 상기 비교는 오디오 데이터 형태로 비교 할 수 있으며, 혹은 오디오 데이터를 텍스트 형태의 데이터로 변환하여 서로 비교 할 수도 있다.상기 데이터의 비교는 제어부(120)에 의해서 수행된다. 제어부(121)는 상기 DB(210)에 저장되어 있는 단어나 문 <73>장을 포함하는 오디오 데이터가 수신되면 상기 오디오 데이터가 저장되도록 한다. 또 다른 실시예로는 음성인식과정을 통해서 사용자가 상대방의 신분을 물어본 후 상대방이 자신의 신분을 밝히 <74>는 경우에 상대방의 대답을 저장하도록 한다. 음성인식과정의 예는 다음과 같다. 통화 개시 후에 사용자가 상대방이 누구인지를 알아내기 위하여 \"여보세요?\"나 \"헬로우\"라는 문장을 발음하는 경우에 제어부(121)에 의해서상기 문장을 인식한 후 상대방이 그에 대한 대답을 하면, 상기 상대방의 대답을 저장하도록 설정할 수 있다. 혹은 통화 개시 후에 사용자가 \"누구세요?\" 라는 질문을 하는 경우에 그 질문을 인식한 후 그 에 대한 상대방의대답을 저장하도록 설정할 수도 있다. 음성인식에 관한 기술은 이 기술분야에서 통상의 지식을 가진 자에게 자명한 사항이므로 상세한 설명은 생략하도록 한다.도 4는 본 발명의 일 실시예에 따른 수신 전화번호와 저장되는 데이터를 매칭시키는 방법을 나타낸 도면이다. <75>통화 종료 후에 수신된 전화번호는 주소록이나 전화번호부에 수신된 전화번호의 정보를 포함하는 데이터 형태로 <76>저장이 된다. 또한 고정 메모리부(134)에 저장되는 데이터는 고정 메모리부(134)의 특정 영역을 나타내는 주소에 저장이 된다. 따라서 고정 메모리부(134)에 저장되는 데이터의 주소를 상기 수신된 전화번호의 정보를 포함하는 데이터에 첨부하여 상기 수신된 전화번호와 고정 메모리부(134)에 저장되는 데이터를 매칭할 수 있다. 이후에 상기 수신된 전화번호와 동일한 전화번호가 수신되는 경우에는 상기 전화번호의 정보를 포함하는 데이터에저장되어 있는 상기 주소를 읽어서 상기 주소에 저장되어 있는 데이터가 출력되도록 한다.도 5는 본 발명의 일 실시예로서 데이터를 저장하는 방법을 나타낸 순서도이다. <77>사용자 단말기와 상대방 단말기간에 화상 전화 통화가 개시된 후, 단계 S510에서 사용자 단말기의 제어부(120) <78>는 상대방 단말기로부터 수신되는 스트림 데이터 중 미리 저장된 설정 조건을 만족하는지 여부를 판단한다. 설정 조건에 관하여 앞서 설명하였으므로 이에 대한 설명은 생략한다.단계 S520에서 상기 수신 데이터가 상기 설정 조건을 만족시키는 경우에 상기 수신 데이터가 저장되도록 한다. <79>저장되는 상기 수신 데이터는 메모리부(130)의 임시 메모리부(132)에 저장이 된다. 상기 저장되는 데이터가 비- 10 -공개특허 10-2009-0011490디오 데이터인 경우에는 정지영상일 수도 있고 동영상일 수도 있다.단계 S530에서는 사용자 단말기와 상대방 단말기간의 통화 연결이 종료가 된다. <80>단계 S540에서는 임시 메모리부(132)에 저장되는 상기 수신 데이터가 고정 메모리부(134)로 복사 또는 이동하여 <81>저장되고 수신 전화번호(상대방 단말기의 전화번호)와 상기 고정 메모리부(134)에 저장된 데이터가 매칭되어 저장된다. 상술한 바와 같이 임시 메모리부(132)에 저장된 데이터는 통화 종료 후에 제어부(120)의 제어를 받아고정 메모리부(134)로 복사 또는 이동되어 저장이 된다. 또한 상기 수신 전화번호는 상기 고정 메모리부(134)에저장되는 데이터의 주소를 포함하여 테이블 형태의 주소록이나 전화번호부에 저장이 된다. 예를 들어, 메모리에저장되는 데이터는 특정의 주소를 가지게 된다. 상기 고정 메모리부(134)에 저장되는 데이터 역시 특정의 주소를 가지게 된다. 따라서 주소록이나 전화번호부에 저장되는 상기 전화번호를 포함하는 데이터의 헤더나 테일 부분에 상기 고정 메모리부(134)에 저장되는 데이터 주소의 정보를 덧붙여 저장하는 방법으로 상기 수신 전화번호와 상기 저장되는 데이터를 매칭 시킬 수 있다.도 6은 본 발명의 일 실시예로서 저장데이터를 업그레이드 하는 방법을 나타낸 순서도이다. <82>단계 S531에서 제어부(121)는 통화 종료 후에 고정 메모리부(134)에 수신 전화번호(상대방 단말기의 전화번호) <83>와 매칭되는 기존 데이터가 존재하는지 판단한다. 제어부(120)는 통화 종료 후에 수신 전화번호가 주소록이나전화번호부에 저장이 되어 있는지 판단을 한다. 만일 상기 수신 전화번호가 주소록이나 전화번호부에 저장이 되어 있는 전화번호인 경우에는 제어부(120)는 고정 메모리부(134)에 상기 수신 전화번호와 매칭되는 데이터가 있는지 여부를 더 판단 하게 된다. 수신 전화번호와 매칭되는 데이터가 있는지의 판단은 주소록이나 전화번호부에 저장되어 있는 상기 수신 전화번 <84>호의 데이터에 고정 메모리부(134)의 주소를 가지는 정보가 포함되어 있는지의 여부를 보면 된다. 주소록이나전화번호부에 저장되어 있는 전화번호의 정보를 포함하는 데이터에 상기 고정 메모리부(134)의 주소를 가지는정보가 포함되어 있다면 상기 주소록이나 전화번호부에 저장되어 있는 전화번호와 매칭되는 데이터가 존재한다고 판단한다.단계 S532에서 제어부(121)는 단계 S531에서 판단한 결과 기존의 고정 메모리부(134)에 저장된 데이터가 존재하 <85>는 경우에 상기 고정 메모리부(134)에 저장된 데이터를 업그레이드 할 것인지를 더 판단하게 된다. 제어부(120)는 주소록이나 전화번호부에 저장되어 있는 전화번호와 매칭되는 데이터가 고정 메모리부(134)에 존재하는 경우, 기존의 고정 메모리부(134)의 데이터를 유지할 것인지 임시 메모리부(132)에 저장되어 있는 데이터로 업그레이드 할 것인지를 화면에 선택 메뉴로 표시를 한다. 그러면 사용자는 선택에 의해서 기존의 고정 메모리부(134)의 데이터를 유지 또는 임시 메모리부(132)에 저장되어 있는 데이터로 업그레이드 할 수 있다.단계 S533에서 사용자는 상기 단계 S532에서 선택 결과 업그레이드를 하지 않는 경우에 임시 메모리부(132)에 <86>저장되어 있는 데이터를 삭제하고 상기 고정 메모리부(134)에 저장된 데이터를 그대로 유지한다.단계 S540에서 사용자는 상기 단계 S532에서 선택 결과 업그레이드를 하는 경우에 도 5에서 설명한 바와 같이 <87>임시 메모리부(132)에 저장되어 있는 데이터를 고정 메모리부(134)로 복사 또는 이동하여 저장하고 수신 전화번호를 상기 고정 메모리부(134)에 저장되는 데이터와 매칭 시켜 저장한다. 이후 과정은 도 5에서 설명한 과정과 유사하므로 중복된 설명은 생략하도록 한다. 도 7은 본 발명의 일 실시예로서 저장된 데이터를 출력하는 방법을 나타낸 순서도이다. <88>단계 S700에서 사용자 단말기는 상대방 단말기와 호가 연결되어 상대방 단말기의 전화번호를 수신한다. <89>단계 S710에서 제어부(120)는 상기 수신된 전화번호가 기존에 주소록이나 전화번호부에 저장되어 있는 전화번호 <90>와 동일한 전화번호인지를 판단한다. 만일 동일한 전화번호가 아닌 경우에는 도 5의 단계 S510으로 가서 이후의단계가 진행된다.단계 S720에서는 제어부(120)는 상기 단계 S710에서 판단 결과 동일한 전화번호인 경우에 상기 수신 전화번호와 <91>매칭되는 데이터가 출력되도록 한다. 제어부(120)는 수신 전화번호가 단말의 주소록이나 전화번호부에 저장되어있는 전화번호인 경우에 상술한 바와 같이 상기 전화번호와 매칭되어 있는 데이터를 출력한다. 제어부(120)는주소록이나 전화번호부에 저장되어 있는 상기 전화번호를 포함하는 데이터를 분석하여 상기 데이터에 포함되어있는 고정 메모리부(134)의 주소를 읽어서 상기 주소에 저장되어 있는 데이터를 출력한다. 상기 저장된 데이터가 비디오 데이터이면 비디오 데이터 종류에 따라 정지영상 또는 동영상으로 화면에 영상으로 표시가 되고, 오디오 데이터인 경우에는 음성부에서 음성 또는 음향으로 출력이 된다. 또한 제어부(120)는 상기 저장된 데이터- 11 -공개특허 10-2009-0011490가 출력되면서 화면에 상기 전화번호의 최근 통화 정보나 최근에 수신된 메시지가 함께 표시되도록 할 수 있다.예를 들어 수신 전화번호와 매칭되는 데이터가 출력되면서 화면에 상기 수신 전화번호와 최근에 통화한 정보(날짜 정보 또는 상기 수신 전화번호와 매칭되는 메모정보 내지는 상기 수신 전화번호로부터 수신받은 메세지등)가표시되도록 할 수 있다.단계 S730에서 제어부(120)는 사용자 단말기와 상대방 단말기가 호가 연결되어 통화가 개시되는지 판단하게 된 <92>다. 통화가 개시되지 않는 경우에는 상대방 단말기로 부터 수신 되는 전화번호와 매칭되는 데이터의 출력이 지속된다.이후에 사용자 단말기와 상대방 단말기간에 호가 연결되어 통화가 개시되면, 상기 고정 메모리부(134)에 저장되 <93>어 있는 수신 전화번호와 매칭되는 데이터의 출력이 정지되고 통화가 개시되는 단계 S740로 된다.상기한 본 발명의 실시예는 예시의 목적을 위해 개시된 것이고, 본 발명에 대해 통상의 지식을 가진 당업자라면 <94>본 발명의 사상과 범위 안에서 다양한 수정, 변경, 부가가 가능할 것이며, 이러한 수정, 변경 및 부가는 하기의특허청구범위에 속하는 것으로 보아야 할 것이다.도면의 간단한 설명도 1은 본 발명의 실시예에 따른 단말기의 기능블럭도를 나타낸 도면. <95>도 2는 본 발명의 일 실시예로서 비디오 데이터를 저장하는 방법을 나타낸 도면. <96>도 3는 본 발명의 일 실시예로서 오디오 데이터를 저장하는 방법을 나타낸 도면. <97>도 4는 본 발명의 일 실시예에 따른 수신 전화번호와 저장되는 데이터를 매칭시키는 방법을 나타낸 도면. <98>도 5는 본 발명의 일 실시예로서 데이터를 저장하는 방법을 나타낸 순서도. <99>도 6은 본 발명의 일 실시예로서 저장데이터를 업그레이드 하는 방법을 나타낸 순서도. <100>도 7은 본 발명의 일 실시예로서 저장된 데이터를 출력하는 방법을 나타낸 도면. <101><도면의 주요부분에 대한 부호의 설명> <102>100 : 수신부 <103>120 : 제어부 <104>130 : 메모리부 <105>132 : 임시 메모리부 <106>134 : 고정 메모리부 <107>140 : 화면부 <108>150 : 음성부 <109>160 : 타이머부 <110>- 12 -공개특허 10-2009-0011490도면 도면1 도면2- 13 -공개특허 10-2009-0011490 도면3 도면4 도면5- 14 -공개특허 10-2009-0011490 도면6 도면7- 15 -공개특허 10-2009-0011490"}
{"patent_id": "10-2007-0075127", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "정보를 저장 및 출력하는 이동 단말기가 개시된다. 이동 단말기는 메모리부, 화상 전화 기능 수행을 위한 데이터 스트림을 네트워크를 통해 발신 단말기로부터 수신하는 수신부, 상기 수신된 데이터 스트림에 상응하는 데이터가 상기 메모리부에 저장되도록 제어한 후 상기 발신 단말기로부터 전화 통화 요청이 다시 수신되면 상기 저장된 데 이터가 출력되도록 제어 하는 제어부를 포함한다. 따라서 본 발명에 따르면, 통화가 개시되기 전에 상대방이 식 별될 수 있는 효과가 있다."}
{"patent_id": "10-2007-0075127", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 상대방의 정보를 저장 및 출력하는 이동 단말기와 그 방법에 관한 것으로 보다 상세하게는 수신데이 <1> 터를 전화번호와 매칭시켜 저장하고, 저장된 데이터와 매칭되는 전화번호를 수신하는 경우에 저장되어 있는 데 이터를 출력할 수 있는 단말기 및 그 방법에 관한 것이다."}
{"patent_id": "10-2007-0075127", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 이동 단말기는 상대방의 정보를 사용자가 직접 입력하여 저장하는 방식이었다. 상대방의 전화번호나 이 <2> 름 그 밖의 신상정보를 텍스트로 저장하였고, 카메라가 장착되어 있는 이동 단말기의 경우에는 상대방의 영상을 이미지화하여 저장하였다. 그러나 상기와 같은 종래의 방법은 사용자가 직접 상대방의 정보를 알고 미리 입력해 야 하고 새로운 정보를 입력 하기 위해서는 매번 사용자의 입력 행위를 필요로 한다. 최근에는 영상 통신 서비스도 상용화되어 있다. 종래의 영상 이동 단말기는 통화시에 상대방의 영상을 저장함에 <3> 있어 저장에 관한 제어 신호가 입력되고 상기 제어 신호가 입력된 후에 상대방의 영상이 저장되는 방법이었다. 따라서 사용자는 영상 통화시에 상대방에 대한 영상을 저장 하기 위해서는 반드시 제어신호를 입력해야 하였다."}
{"patent_id": "10-2007-0075127", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용 해결 하고자하는 과제 상기한 바와 같은 종래기술의 문제점을 해결하기 위해, 본 발명은 상대방 단말기로부터 수신된 데이터를 자동으 <4> 로 저장하고, 저장된 데이터를 출력하는 이동 단말기와 그 방법을 제공하기 위한 것이다. 이를 위하여, 단말에 데이터가 저장되기 위한 설정 조건이 마련되고 상기 수신 데이터 중에 상기 설정 조건에 <5> 맞는 데이터가 자동으로 저장되도록 한다. 이후에 동일한 전화번호를 가진 호가 수신되면 상기 저장된 데이터가 출력된다. 따라서 사용자는 통화가 개시되기 전에 상대방을 인식할 수 있다. 이외의 본 발명의 목적들은 하기의 실시예에 대한 설명을 통해 쉽게 이해될 수 있을 것이다. <6> 과제 해결수단 위에 설명한 바와 같은 목적을 달성하기 위해, 본 발명의 일 측면에 따르면, 메모리부와 네트워크를 통해 발신 <7> 단말기로부터 화상 전화 기능 수행을 위한 데이터 스트림을 수신하는 수신부 및 상기 데이터 스트림에 상응하는 - 5 -공개특허 10-2009-0011490데이터 중 전부 또는 일부가 상기 메모리부에 저장되도록 제어한 후, 상기 발신 단말기로부터 전화 통화 요청을 다시 수신하면 상기 저장된 데이터가 출력되도록 제어 하는 제어부를 포함하는 이동 단말기가 제공된다. 여기서, 상기 데이터는 상기 이동 단말기와 상기 발신 단말기간의 전화 통화가 개시될 때까지 출력이 지속되는 <8> 것을 특징으로 할 수 있다. 여기서, 상기 이동 단말기는 상기 데이터에 상응하는 영상이 디스플레이되는 화면부를 더 포함할 수 있다. <9> 여기서, 상기 메모리부는 RAM(random access memory)이나 플래쉬메모리(flash memory) 또는 그 밖의 정보를 저 <10> 장할 수 있는 저장 매체 중 하나 이상을 더 포함할 수 있다. 여기서, 상기 메모리부는 상기 데이터를 임시적으로 저장하는 임시 메모리부와 상기 제어부의 제어에 의해 상기 <11> 임시 메모리부에 저장된 상기 데이터 중 일부 또는 전부의 데이터가 저장되는 고정 메모리부를 더 포함할 수 있 다. 여기서, 상기 임시 메모리부와 상기 고정 메모리부는 각각의 독립적인 메모리일수도 있고 하나의 메모리내의 구 <12> 분되는 영역을 나타낼 수도 있는 것을 특징으로 할 수 있다. 여기서, 상기 제어부는 미리 지정된 설정 조건에 따라 상기 데이터 스트림 중 상기 설정 조건을 만족 시키는 데 <13> 이터를 임시 메모리부에 저장되도록 제어하는 것을 특징으로 할 수 있다. 여기서, 상기 제어부는 상기 임시 메모리부에 저장된 데이터에 대한 고정 메모리부로 이동 또는 복사 저장 명령 <14> 입력되거나, 상기 발신 단말기와의 전화 통화 종료 시점에서 상기 임시 메모리부에 저장된 데이터가 상기 고정 메모리부로 이동 또는 복사되도록 제어하는 것을 특징으로 할 수 있다. 여기서, 상기 설정 조건은 정해진 시간 이후에 수신되는 데이터를 저장하도록 설정하는 조건인 것을 특징으로 <15> 할 수 있다. 여기서, 상기 설정 조건은 영상 인식 또는 음성 인식을 통한 인공지능을 이용하여 상대방을 인식할 수 있는 정 <16> 보를 포함하는 데이터를 저장하는 조건인 것을 특징으로 할 수 있다. 여기서, 단말기의 클럭 신호를 이용하여 시간 경과에 대한 정보를 생성하여 상기 제어부로 출력하는 타이머부를 <17> 더 포함할 수 있다. 여기서, 상기 제어부는 상기 타이머부로부터 제공되는 시간 경과에 대한 정보가 디폴트로 지정된 또는 사용자에 <18> 의해 지정된 시간에 부합하는 것으로 인식되면 상기 데이터의 저장이 개시되도록 제어하는 것을 특징으로 할 수 있다. 여기서, 상기 제어부는 디폴트로 지정된 또는 사용자에 의해 지정된 시간 동안 상기 데이터의 저장이 지속되도 <19> 록 제어하는 것을 특징으로 할 수 있다. 여기서, 상기 제어부는 상기 임시 메모리에 저장된 데이터가 상기 수신 단말기의 사용자의 선택 또는 저장된 프 <20> 로그램에 의해 고정 메모리부로 이동하여 저장되도록 제어하는 것을 특징으로 할 수 있다. 여기서, 상기 제어부에 의해 저장되도록 제어되는 상기 데이터는 발신 단말기 사용자의 모습을 포함하는 영상 <21> 데이터이고, 상기 제어부는 상기 데이터 스트림을 해석하여 상기 영상 데이터를 추출하는 것을 특징으로 할 수 있다. 여기서, 상기 영상 데이터는 정지영상 데이터 또는 동영상 데이터인 것을 특징으로 할 수 있다. <22> 여기서, 상기 제어부는 상기 데이터 스트림에서 추출된 음성 데이터 중 음성인식 기술에 의해 추출된 개인 정보 <23> 에 관한 음성 데이터를 상기 메모리부에 저장하는 것을 특징으로 할 수 있다. 또는, 이동 단말기가 데이터를 저장 및 출력 하는 방법에 있어서, a)설정 조건이 저장되고 수신 데이터 스트림 <24> 중 상기 설정 조건을 만족 시키는 데이터가 저장되기 위하여 상기 데이터 스트림 중 상기 설정 조건을 만족 시 키는지 판단하는 단계; b)상기 수신 데이터 스트림 중 상기 설정 조건을 만족 시키는 데이터를 저장하는 단계; c)통화 종료 후 상기 저장된 데이터와 수신 전화번호가 매칭되어 저장되는 단계; d)상기 저장된 전화번호와 동 일한 전화번호가 수신되는 경우, 상기 전화번호에 매칭되어 저장된 데이터가 출력되는 단계를 포함하는 이동 단 말기의 데이터 저장 및 출력 방법이 제공된다. 여기서, 상기 a)단계에서 상기 설정 조건은 통화 개시시 후 통화 종료시까지의 시간 중 어느 한 시간을 선택하 <25> - 6 -공개특허 10-2009-0011490여 상기 선택 시간 이후에 상기 수신 데이터가 저장되도록 제어하기 위한 조건인 것을 특징으로 할 수 있다. 여기서, 상기 a)단계에서 상기 설정 조건은 비디오 데이터가 저장되는 경우에 상대방 영상의 초점이 맞추어지고 <26> 상기 상대방 영상이 일정 비율 이상 표시되는 조건인 것을 특징으로 할 수 있다. 여기서, 상기 a)단계에서 상기 설정 조건은 오디오 데이터가 저장되는 경우에 상대방의 음성을 포함하는 상기 <27> 오디오 데이터 중 상기 상대방을 인식할 수 있는 단어나 문장이 포함되는 조건인 것을 특징으로 할 수 있따. 여기서, 상기 b)단계는 상기 설정 조건에 만족되는 데이터를 임시 메모리부에 저장하는 것을 더 포함하는 단계 <28> 이고, 상기 c)단계는 통화 종료 후 상기 임시 메모리부에 저장된 데이터가 고정 메모리부로 복사 또는 이동되어 수신 전화번호와 매칭되어 저장되는 것을 더 포함하는 것을 특징으로 할 수 있다. 여기서, 상기 c)단계에서 상기 저장 데이터 중 저장 순서가 가장 오래된 순서로 상기 저장 데이터를 <29> 삭제하거나, 상기 저장 데이터를 선택하여 삭제하는 과정을 더 포함하는 것을 특징으로 할 수 있다. 여기서, 상기 c)단계에서 상기 매칭시키는 방법은 저장되는 상기 데이터의 주소를 상기 수신 전화번호의 정보를 <30> 포함하는 데이터에 기록하고 상기 수신 전화번호는 테이블 형태의 주소록이나 전화번호부에 기록하는 방법인 것 을 특징으로 할 수 있다. 여기서, 상기 b)단계에서 상기 데이터가 비디오 데이터인 경우 상기 저장되는 데이터는 정지영상 데이터 이거나 <31> 동영상 데이터인 것을 특징으로 할 수 있다. 여기서, 상기 c)단계에서 기존에 저장된 데이터가 존재하는 경우 상기 기존에 저장된 데이터를 업그레이드 할 <32> 것인지를 판단하여 업그레이드를 하는 경우에만 상기 데이터를 저장하는 과정을 더 포함하는 것을 특징으로 할 수 있다. 여기서, 상기 d)단계에서 상기 데이터가 출력되면서 화면 하단에 최근 통화 정보나 최근 수신 메시지가 함께 표 <33> 시되는 것을 특징으로 할 수 있다. 효 과 상술한 바와 같이 본 발명에 따르면, 수신데이터를 자동으로 저장할 수 있는 효과가 있다. <34> 또한 저장된 상대방의 동영상이나 정지영상을 통화 전에 출력하여 상대방이 누구인지를 상대방의 영상을 통해 <35> 확인할 수 있는 효과가 있다. 또한 저장된 상대방의 음성을 통화 전에 출력하여 상대방이 누구인지를 음성을 통해 확인할 수 있는 효과가 있 <36> 다. 또한 저장된 데이터를 필요에 따라 최신 정보로 업그레이드 할 수 있는 효과가 있다. <37> 발명의 실시를 위한 구체적인 내용 본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 <38> 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아 니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 명세서에서 어떤 구성요소로부터 다른 구성요소에 \"포함하는\" 또는 \"구성된\" \"생성된\" 등의 용어는 명세서 <39> 상에 기재된 특징, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또 는 그 이상의 다른 특징들이나 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성 을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함 해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으 로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정 의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. <40> 이하에서, 본 발명에 따른 상대방의 정보를 저장 및 출력하는 이동 단말기와 그 방법에 관한 실시예를 도면을 <41> - 7 -공개특허 10-2009-0011490참조하여 상세하게 설명하기로 한다. 상술한 본 발명의 구성, 특징 및 장점은 다음의 실시예들을 통한 상세한 설명을 통하여 보다 분명해 질 것이다. <42> 우선 각 도면의 구성요소들에 참조 번호를 부가함에 있어서, 동일한 구성요소들에 한해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 번호를 가지도록 하고 있음에 유의하여야 한다. 도 1은 본 발명의 실시예에 따른 단말기의 기능블럭도를 나타낸 도면이다. <43> 도 1을 참조하면 본 발명의 단말기는 수신부, 제어부, 메모리부, 화면부, 음성부, 타 <44> 이머부를 포함한다. 메모리부는 임시 메모리부와 고정 메모리부를 포함할 수 있다. 수신부는 네트워크를 통해 상대방 단말기로부터 전송된 데이터 스트림을 수신 받는 기능을 수행 한다. <45> 제어부는 상기 수신된 데이터 스트림 중에 설정 조건에 맞는 데이터를 식별하고, 식별된 데이터가 메모리 <46> 부에 저장 및 상기 저장된 데이터가 출력되도록 제어하는 기능을 수행한다. 예를 들어 사용자는 상대방 단말기로부터 수신되는 데이터 스트림 중에 저장하고자 하는 데이터를 지정하기 위 <47> 한 설정 조건을 입력부(미도시)를 이용하여 입력하며, 입력된 설정 조건은 메모리부의 고정 메모리부에 저 장된다. 이후, 제어부는 상대방 단말기로부터 수신되는 데이터 스트림 중에서 미리 저장된 설정 조건에 맞 는 데이터를 식별하여 상기 임시 메모리부에 저장한다. 상기 임시 메모리부에 저장된 상기 데이터는 통화 종료 후에 상기 고정 메모리부에 복사 또는 이동되어 확정적으로 저장된다. 또한 제어부는 저장 된 데이터의 타입(예를 들어, 오디오 데이터, 비디오 데이터 등)을 구분하여 데이터 타입에 맞는 출력장치로 출 력하는 기능을 더 수행할 수 있다. 상술한 설정 조건은 예를 들어, 시간에 대한 조건, 인공지능을 이용하여 수신되는 데이터 스트림 중 상대방의 <48> 인식 정보를 가지는 데이터를 식별 가능하도록 하는 조건 등 중 어느 하나일 수 있다. 예를 들어 설정 조건이 시간에 대한 조건인 경우 제어부는 통화 개시 후 특정 시간을 설정하여 수신되는 <49> 데이터 스트림 중 설정된 시간 이후에 수신되는 데이터가 저장 개시되도록 제어 할 수 있다. 예를 들어 비디오 데이터를 식별하도록 설정된 설정 조건인 경우, 화면부에 표시되는 영상의 RGB 값, 화면 <50> 대 영상의 표시비율 등을 구별을 할 수 있으며, 오디오 데이터를 식별하도록 설정된 설정 조건인 경우에는 단어 및 문장의 구별을 할 수 있다. 비디오 데이터를 저장하는 경우에는 화면에 표시되는 영상이 존재하는 경우에 화면에 영상으로 표시되는 비디오 데이터를 저장하도록 할 수 있다. 오디오 데이터를 저장하는 경우에는 음성으 로 출력되는 오디오 데이터가 존재하는 경우에 음성으로 출력되는 오디오 데이터를 저장하도록 할 수 있다. 영 상과 음성으로 출력되는 비디오 데이터와 오디오 데이터가 모두 존재하는 경우에는 음성을 포함하는 동영상 형 태의 비디오 데이터와 오디오 데이터를 함께 저장 할 수 있으며, 비디오 데이터를 우선으로 하여 저장할 수도 있으며 그 반대의 경우로 오디오 데이터를 우선으로 하여 저장 할 수 도 있다. 메모리부는 RAM(random access memory)이나 그 밖의 정보를 저장할 수 있는 저장 매체 중 하나 이상을 포 <51> 함할 수 있다. 메모리부는 제어부에 의해서 식별된 데이터가 저장되는 곳으로서 임시 메모리부(13 2)와 고정 메모리부로 구별할 수 있다. 또한 메모리부에는 상대방을 인식 할 수 있는 단어나 문장이 저장되어 있는 DB를 더 포함 할 수 있다. DB는 고정 메모리부에 포함될 수 있다. 임시 메모리부는 제어부에 의해 식별된 데이터가 임시로 저장되는 곳으로 통화가 종료되기 전 또는 <52> 통화 종료 후 미리 지정된 시점까지 데이터가 임시로 저장이 되는 장소이다. 이에 비해, 고정 메모리부는 통화 종료 후에 임시 메모리부에 저장되어 있던 데이터가 이동되어 확정적으로 저장되는 장소이다. 사용자 는 고정 메모리부에 저장된 데이터를 키조작을 통해 삭제할 수 있음은 자명하다. 또한 고정 메모리부에 저장되어 있는 데이터는 제어부의 제어에 의해 화면부 또는 음성부 <53> 로 출력될 수 있다. 상기 임시 메모리부와 고정 메모리부는 각각 독립적인 메모리일 수도 있고 하나 의 메모리에 포함된 서로 다른 저장영역일 수도 있다. 화면부는 LCD(Liquid Crystal Display), TFT(Thin Film Transistor), OLED(Organic Light Emitting <54> Diode)와 같은 디스플레이 모듈을 포함할 수 있다. 화상 통화 시에 화면부를 통해 상대방의 영상이 디스플 레이된다. 또한 호 착신시 수신된 상대방 단말기의 전화번호에 상응하도록 저장된 비디오 데이터가 미리 저장된 경우 제어부의 제어에 의해 해당 비디오 데이터가 사용자의 호 응답시까지 화면부를 통해 출력될 수 있다. 그 외에 영상으로 표현되는 정보(예를 들어 게임이나 동영상 재생 등)가 표시됨은 자명하다. - 8 -공개특허 10-2009-0011490음성부는 스피커나 마이크 등을 포함하며 음성 및 음향으로 표현되는 오디오 데이터 및/또는 음원 데이터 <55> 를 입력받거나 출력할 수 있다. 음성부에는 스피커나 마이크 중 하나 이상이 포함될 수 있다. 음성부(15 0)는 음성 통화 시 상대방 단말기로부터 수신한 음성 데이터에 상응하는 음성을 출력하며, 호 착신시 수신된 상 대방 단말기의 전화번호에 상응하도록 저장된 오디오 데이터가 미리 저장된 경우 제어부의 제어에 의해 해 당 오디오 데이터가 사용자의 호 응답시까지 음성부를 통해 출력될 수 있다. 또한 단말에 구비된 멀티미디 어 기능(예를 들어 엠피쓰리 데이터 재생이나 동영상 재생 등)의 이용시에 음성부를 통해 음성 및 음향 출 력이 가능함은 당업자에게 자명하다. 타이머부는 디폴트로 설정되어 있는 시간 혹은 사용자가 임의로 설정한 시간에 신호를 출력하는 기능을 수 <56> 행한다. 타이머부는 설정되어 있는 시간에 제어부로 신호를 출력한다. 제어부에서는 타이머부 로부터 입력되는 신호를 이용하여 데이터의 저장을 개시하도록 제어한다. 예를 들어 단말에 통화 개시 시 로부터 5초 이후에 2초간 데이터를 저장하도록 설정이 되어 있다면, 타이머부에서 통화 개시 5초 이후에 2 초간 신호를 제어부로 출력한다. 제어부는 타이머부로부터 신호를 입력 받는 동안 수신받는 데 이터(또는 표시를 위해 디코딩된 비디오 데이터 및/또는 오디오 데이터)가 임시 메모리부에 저장되도록 제 어한다. 수신받는 데이터를 통화 개시 이후에 즉시 저장하지 않는 이유는 영상통화시에는 상대방의 모습이 제대로 화면 <57> 부에 표시 되고 상대방 (또는 발신자)의 자연스러운 표정이 화면에 표시되기까지는 얼마간의 시간이 걸릴 수 있기 때문이다. 또한 음성통화의 경우에는 상대방이 자신의 신원을 나타내기까지는 통화 개시 후에 '여보세 요'라는 말을 한 후이거나 사용자가 상대방이 누구인지를 물어보고 나서야 상대방이 자신의 신원을 밝히기 때문 이다. 상기 설정시간은 데이터의 종류(비디오 데이터, 오디오 데이터) 및 사용자의 편의에 의해 변경이 될 수 있다. 도 2는 본 발명의 일 실시예로서 비디오 데이터를 저장하는 방법을 나타낸 도면이다. <58> 화면부의 디스플레이되는 영상 중 피사체에 해당하는 상대방의 모습이 전체 화면 중에 일정 비율 이상 표 <59> 시가 되는 경우에 상기 영상을 표시하는 비디오 데이터가 저장되도록 설정한다. 도 2의 (a)는 화면부의 화면을 나타낸 것으로 전체 화면을 64등분하여 예시한 것이다. 분할된 각각의 화면을 하 <60> 나의 \"셀\"이라고 가정하면 화면은 총 64개의 셀로 구성되어 있다. 상기 셀은 반드시 64개로 구성될 필요는 없으 며 설정 조건 및 단말 구성에 따라 변경 가능하다. 이 분할된 화면 중에서 일정 개수 이상의 셀에 상대방의 모 습이 표시되어야만 수신되는 비디오 데이터가 저장되도록 설정이 될 수 있다. 예를 들어 상기 하나의 분할된 셀은 1/64=0.015625 이므로, 전체 화면의 1.5625%를 차지하게 된다. 따라서, 전 <61> 체화면 중 상대방의 모습이 30%이상 표시 되어야만 수신되는 비디오 데이터가 저장되도록 설정한다면 30/1.5625=19.2 이므로 약 20개 정도의 셀에 상대방의 모습이 표시되어야 한다. 그러나 상대방의 모습이 전체 화면의 30%이상 표시 된다고 하더라도, 상대방의 모습이 화면의 한쪽으로 치우쳐 <62> 져 있다거나 상대방의 얼굴이 잘 나타나 있지 않는다면 상대방이 누구인지를 인식하기가 쉽지 않다. 예를 들어 도 2의 (b)를 보면 상대방의 모습이 전체 화면의 30% 이상 표시되고 있으나 상대방 얼굴이 정면으로 <63> 나타나 있지 않으므로 상대방이 누구인지를 구분하기가 쉽지 않다. 따라서 상대방의 모습이 전체 화면의 30%를 넘고 상대방의 얼굴이 화면의 중앙부에 위치하는 경우에만 비디오 데이터가 저장되도록 설정이 될 수 있다. 상대방의 얼굴이 화면에 표시되는 것을 인식하는 방법은 얼굴을 나타내는 색상의 값을 인식하여 알아낼 수 <64> 있다. 예를 들어 사람의 피부색의 RGB 값의 범위를 설정하여 상기 설정된 RGB 색상 값이 화면에 표시되면 상대 방의 얼굴이 화면에 표시된 것으로 인식할 수 있다. 단 사람마다 또는 인종마다 피부색이 다르고 또한 주위 배경에 따라 얼굴 색상이 변동될 수 있으므로 상기 RGB <65> 값을 특정 값으로 설정하지 않고, 인종의 피부색의 범위나 배경에 따라 일반적으로 변동될 수 있는 범위를 고려 하여 범위 값으로 설정한다. 또한 상대방의 얼굴이 화면의 중앙에 위치되어야 하므로 분할된 셀 중 19, 20, 21, 22, 27, 28, 29, 30, 35, 36, 37, 38, 43, 44, 45, 46번 위치의 셀에 표시되는 RGB값을 인식하여 상대방의 얼 굴이 화면의 중앙부에 위치하는지를 판단한다. 예를 들어 상기 분할된 셀 중 19, 20, 21, 22, 27, 28, 29, 30, 35, 36, 37, 38, 43, 44, 45, 46번 위치의 셀 <66> 에 표시되는 RGB 값 중 상기 사람의 얼굴을 표시하는 RGB값으로 설정된 범위 내에 속하는 RGB 값이 10개 이상의 셀에 표시되는 경우에, 상대방의 얼굴이 화면의 중앙부에 위치하고 있다고 판단할 수 있다. - 9 -공개특허 10-2009-0011490또한 상대방의 얼굴이 정면 모습으로 표시되고 있는지 또는 측면 모습으로 표시되고 있는지는 표시되는 얼굴 이 <67> 미지의 특징점 추출 및 분석(예를 들어, 눈의 위치, 코 및 입의 위치, 미간 거리 등)을 통해 식별할 수 있으며, 이를 위한 특징점 추출 및 분석 방법은 당업자에게 자명하므로 이에 대한 설명은 생략한다. 도 2의 (c)는 상술한 모든 것을 고려한 예로서 상대방의 모습이 전체화면의 30%이상 표시되고 상대방의 얼굴이 <68> 화면의 중앙부에 위치 되여 있는 것을 나타낸 실시예이다. 도 2의 c를 보면 분할된 화면 중 20개 이상의 셀에 상대방의 모습이 표시되어 있다. 또한 19, 20, 21, 22, 27, 28, 29, 30, 35, 36, 37, 38, 43, 44, 45, 46번 위 치의 셀에 표시되는 RGB값을 조사하여 보면 20, 21, 28, 29, 30, 35, 36, 37, 38, 43, 44, 45, 46번 위치의 셀 에 표시되는 RGB값이 사람의 얼굴을 나타내는 RGB 값의 범위 안에 포함된다고 판단할 수 있다. 따라서 도 2의 (c)에 표시되는 화면은 비디오 데이터를 저장하는 설정 조건에 맞는 화면으로 메모리부에 저장이 된다. 상 기 화면에 표시되는 상대방의 모습과 RGB값의 판단은 제어부에서 수행된다. 상술한 방법에 덧붙여 상대방 영상의 선명도 역시 고려가 된다. 상술한 조건을 만족하더라도 상대방 영상이 초 <69> 점이 안 맞아 흐릿하게 표시가 되면 상대방이 누구인지를 알아보기 힘들기 때문이다. 따라서 상술한 방법에 덧 붙여 상대방 영상의 초점이 제대로 맞추어진 선명한 영상인 경우에만 상대방 영상을 저장하도록 할 수 있다. 상 대방 영상이 초점이 제대로 맞추어진 선명한 영상인지의 판단은 화면에 표시되는 상대방의 영상의 윤곽선을 검 출 필터나 에지 검출등의 방법을 이용하여 판단하는 방법일 수 있다. 영상의 선명도를 판별하는 방법은 이 기술 분야에서 통상의 지식을 가진 자에게 자명한 사항이므로 상세한 설명은 생략하도록 한다. 도 3은 본 발명의 일 실시예에 따른 오디오 데이터를 저장하는 방법을 나타낸 도면이다. <70> 네트워크를 통해 수신되는 오디오 데이터 중 상대방을 식별하여 상대방의 식별 정보를 메모리부에 저장하 <71> 는 실시예는 다음과 같다. 메모리부에 DB를 더 포함하여 신분이나 직업을 나타내는 단어나 문장을 오디오 데이터 또는 덱스트 <72> 형태로 DB에 저장을 한다. 이어서 상대방이 전송하는 오디오 데이터와 DB에 저장되어 있는 데이터를 비교한다. 상기 비교는 오디오 데이터 형태로 비교 할 수 있으며, 혹은 오디오 데이터를 텍스트 형태의 데이터 로 변환하여 서로 비교 할 수도 있다. 상기 데이터의 비교는 제어부에 의해서 수행된다. 제어부는 상기 DB에 저장되어 있는 단어나 문 <73> 장을 포함하는 오디오 데이터가 수신되면 상기 오디오 데이터가 저장되도록 한다. 또 다른 실시예로는 음성인식과정을 통해서 사용자가 상대방의 신분을 물어본 후 상대방이 자신의 신분을 밝히 <74> 는 경우에 상대방의 대답을 저장하도록 한다. 음성인식과정의 예는 다음과 같다. 통화 개시 후에 사용자가 상대 방이 누구인지를 알아내기 위하여 \"여보세요?\"나 \"헬로우\"라는 문장을 발음하는 경우에 제어부에 의해서 상기 문장을 인식한 후 상대방이 그에 대한 대답을 하면, 상기 상대방의 대답을 저장하도록 설정할 수 있다. 혹 은 통화 개시 후에 사용자가 \"누구세요?\" 라는 질문을 하는 경우에 그 질문을 인식한 후 그 에 대한 상대방의"}
{"patent_id": "10-2007-0075127", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "대답을 저장하도록 설정할 수도 있다. 음성인식에 관한 기술은 이 기술분야에서 통상의 지식을 가진 자에게 자 명한 사항이므로 상세한 설명은 생략하도록 한다. 도 4는 본 발명의 일 실시예에 따른 수신 전화번호와 저장되는 데이터를 매칭시키는 방법을 나타낸 도면이다. <75> 통화 종료 후에 수신된 전화번호는 주소록이나 전화번호부에 수신된 전화번호의 정보를 포함하는 데이터 형태로 <76> 저장이 된다. 또한 고정 메모리부에 저장되는 데이터는 고정 메모리부의 특정 영역을 나타내는 주소 에 저장이 된다. 따라서 고정 메모리부에 저장되는 데이터의 주소를 상기 수신된 전화번호의 정보를 포함 하는 데이터에 첨부하여 상기 수신된 전화번호와 고정 메모리부에 저장되는 데이터를 매칭할 수 있다. 이 후에 상기 수신된 전화번호와 동일한 전화번호가 수신되는 경우에는 상기 전화번호의 정보를 포함하는 데이터에 저장되어 있는 상기 주소를 읽어서 상기 주소에 저장되어 있는 데이터가 출력되도록 한다. 도 5는 본 발명의 일 실시예로서 데이터를 저장하는 방법을 나타낸 순서도이다. <77> 사용자 단말기와 상대방 단말기간에 화상 전화 통화가 개시된 후, 단계 S510에서 사용자 단말기의 제어부 <78> 는 상대방 단말기로부터 수신되는 스트림 데이터 중 미리 저장된 설정 조건을 만족하는지 여부를 판단한다. 설 정 조건에 관하여 앞서 설명하였으므로 이에 대한 설명은 생략한다. 단계 S520에서 상기 수신 데이터가 상기 설정 조건을 만족시키는 경우에 상기 수신 데이터가 저장되도록 한다. <79> 저장되는 상기 수신 데이터는 메모리부의 임시 메모리부에 저장이 된다. 상기 저장되는 데이터가 비 - 10 -공개특허 10-2009-0011490디오 데이터인 경우에는 정지영상일 수도 있고 동영상일 수도 있다. 단계 S530에서는 사용자 단말기와 상대방 단말기간의 통화 연결이 종료가 된다. <80> 단계 S540에서는 임시 메모리부에 저장되는 상기 수신 데이터가 고정 메모리부로 복사 또는 이동하여 <81> 저장되고 수신 전화번호(상대방 단말기의 전화번호)와 상기 고정 메모리부에 저장된 데이터가 매칭되어 저 장된다. 상술한 바와 같이 임시 메모리부에 저장된 데이터는 통화 종료 후에 제어부의 제어를 받아 고정 메모리부로 복사 또는 이동되어 저장이 된다. 또한 상기 수신 전화번호는 상기 고정 메모리부에 저장되는 데이터의 주소를 포함하여 테이블 형태의 주소록이나 전화번호부에 저장이 된다. 예를 들어, 메모리에 저장되는 데이터는 특정의 주소를 가지게 된다. 상기 고정 메모리부에 저장되는 데이터 역시 특정의 주소 를 가지게 된다. 따라서 주소록이나 전화번호부에 저장되는 상기 전화번호를 포함하는 데이터의 헤더나 테일 부 분에 상기 고정 메모리부에 저장되는 데이터 주소의 정보를 덧붙여 저장하는 방법으로 상기 수신 전화번호 와 상기 저장되는 데이터를 매칭 시킬 수 있다. 도 6은 본 발명의 일 실시예로서 저장데이터를 업그레이드 하는 방법을 나타낸 순서도이다. <82> 단계 S531에서 제어부는 통화 종료 후에 고정 메모리부에 수신 전화번호(상대방 단말기의 전화번호) <83> 와 매칭되는 기존 데이터가 존재하는지 판단한다. 제어부는 통화 종료 후에 수신 전화번호가 주소록이나 전화번호부에 저장이 되어 있는지 판단을 한다. 만일 상기 수신 전화번호가 주소록이나 전화번호부에 저장이 되 어 있는 전화번호인 경우에는 제어부는 고정 메모리부에 상기 수신 전화번호와 매칭되는 데이터가 있 는지 여부를 더 판단 하게 된다. 수신 전화번호와 매칭되는 데이터가 있는지의 판단은 주소록이나 전화번호부에 저장되어 있는 상기 수신 전화번 <84> 호의 데이터에 고정 메모리부의 주소를 가지는 정보가 포함되어 있는지의 여부를 보면 된다. 주소록이나 전화번호부에 저장되어 있는 전화번호의 정보를 포함하는 데이터에 상기 고정 메모리부의 주소를 가지는 정보가 포함되어 있다면 상기 주소록이나 전화번호부에 저장되어 있는 전화번호와 매칭되는 데이터가 존재한다 고 판단한다. 단계 S532에서 제어부는 단계 S531에서 판단한 결과 기존의 고정 메모리부에 저장된 데이터가 존재하 <85> 는 경우에 상기 고정 메모리부에 저장된 데이터를 업그레이드 할 것인지를 더 판단하게 된다. 제어부(12 0)는 주소록이나 전화번호부에 저장되어 있는 전화번호와 매칭되는 데이터가 고정 메모리부에 존재하는 경 우, 기존의 고정 메모리부의 데이터를 유지할 것인지 임시 메모리부에 저장되어 있는 데이터로 업그 레이드 할 것인지를 화면에 선택 메뉴로 표시를 한다. 그러면 사용자는 선택에 의해서 기존의 고정 메모리부 의 데이터를 유지 또는 임시 메모리부에 저장되어 있는 데이터로 업그레이드 할 수 있다. 단계 S533에서 사용자는 상기 단계 S532에서 선택 결과 업그레이드를 하지 않는 경우에 임시 메모리부에 <86> 저장되어 있는 데이터를 삭제하고 상기 고정 메모리부에 저장된 데이터를 그대로 유지한다. 단계 S540에서 사용자는 상기 단계 S532에서 선택 결과 업그레이드를 하는 경우에 도 5에서 설명한 바와 같이 <87> 임시 메모리부에 저장되어 있는 데이터를 고정 메모리부로 복사 또는 이동하여 저장하고 수신 전화 번호를 상기 고정 메모리부에 저장되는 데이터와 매칭 시켜 저장한다. 이후 과정은 도 5에서 설명한 과정 과 유사하므로 중복된 설명은 생략하도록 한다. 도 7은 본 발명의 일 실시예로서 저장된 데이터를 출력하는 방법을 나타낸 순서도이다. <88> 단계 S700에서 사용자 단말기는 상대방 단말기와 호가 연결되어 상대방 단말기의 전화번호를 수신한다. <89> 단계 S710에서 제어부는 상기 수신된 전화번호가 기존에 주소록이나 전화번호부에 저장되어 있는 전화번호 <90> 와 동일한 전화번호인지를 판단한다. 만일 동일한 전화번호가 아닌 경우에는 도 5의 단계 S510으로 가서 이후의 단계가 진행된다. 단계 S720에서는 제어부는 상기 단계 S710에서 판단 결과 동일한 전화번호인 경우에 상기 수신 전화번호와 <91> 매칭되는 데이터가 출력되도록 한다. 제어부는 수신 전화번호가 단말의 주소록이나 전화번호부에 저장되어 있는 전화번호인 경우에 상술한 바와 같이 상기 전화번호와 매칭되어 있는 데이터를 출력한다. 제어부는 주소록이나 전화번호부에 저장되어 있는 상기 전화번호를 포함하는 데이터를 분석하여 상기 데이터에 포함되어 있는 고정 메모리부의 주소를 읽어서 상기 주소에 저장되어 있는 데이터를 출력한다. 상기 저장된 데이터 가 비디오 데이터이면 비디오 데이터 종류에 따라 정지영상 또는 동영상으로 화면에 영상으로 표시가 되고, 오 디오 데이터인 경우에는 음성부에서 음성 또는 음향으로 출력이 된다. 또한 제어부는 상기 저장된 데이터 - 11 -공개특허 10-2009-0011490가 출력되면서 화면에 상기 전화번호의 최근 통화 정보나 최근에 수신된 메시지가 함께 표시되도록 할 수 있다. 예를 들어 수신 전화번호와 매칭되는 데이터가 출력되면서 화면에 상기 수신 전화번호와 최근에 통화한 정보(날 짜 정보 또는 상기 수신 전화번호와 매칭되는 메모정보 내지는 상기 수신 전화번호로부터 수신받은 메세지등)가 표시되도록 할 수 있다. 단계 S730에서 제어부는 사용자 단말기와 상대방 단말기가 호가 연결되어 통화가 개시되는지 판단하게 된 <92> 다. 통화가 개시되지 않는 경우에는 상대방 단말기로 부터 수신 되는 전화번호와 매칭되는 데이터의 출력이 지 속된다. 이후에 사용자 단말기와 상대방 단말기간에 호가 연결되어 통화가 개시되면, 상기 고정 메모리부에 저장되 <93> 어 있는 수신 전화번호와 매칭되는 데이터의 출력이 정지되고 통화가 개시되는 단계 S740로 된다. 상기한 본 발명의 실시예는 예시의 목적을 위해 개시된 것이고, 본 발명에 대해 통상의 지식을 가진 당업자라면 <94> 본 발명의 사상과 범위 안에서 다양한 수정, 변경, 부가가 가능할 것이며, 이러한 수정, 변경 및 부가는 하기의 특허청구범위에 속하는 것으로 보아야 할 것이다."}
