{"patent_id": "10-2014-0049459", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0022639", "출원번호": "10-2014-0049459", "발명의 명칭": "전자 디바이스 및 전자 디바이스에서 캡쳐 이미지 이용 방법", "출원인": "삼성전자주식회사", "발명자": "공규철"}}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 디바이스에 있어서,어플리케이션 실행 화면을 표시하는 표시부,상기 어플리케이션 실행 화면이 캡쳐되면, 캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하고, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 제어부를 포함하는 것을 특징으로 하는 전자디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 실행 경로 정보는 메타 데이터를 포함하는 것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 메타 데이터는 상기 어플리케이션 실행 화면에 대응된 제목, 상기 어플리케이션 실행 화면으로 복원할 수 있는 URL, 상기 어플리케이션 실행 화면에 대응된 텍스트, 상기 어플리케이션 실행 화면에 대응된 컨텐츠 파일, 상기 어플리케이션실행 화면에 대응된 드로잉 메모 정보, 상기 어플리케이션 실행 화면에 대응된 필기 인식 결과 정보, 상기 어플리케이션 실행 화면에 대응된 클립 위치 정보 중 적어도 하나를 포함하는 것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 메타 데이터는 딥 링크 정보를 더 포함하고,상기 딥 링크 정보는 어플리케이션 실행 화면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보를 포함하는 것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 딥 링크 정보는 상기 어플리케이션 실행 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보를더 포함하는 것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 공유하기 위해 상기 캡쳐된 화면 이미지와 상기 실행 경로정보를 전송하는 통신부를 더 포함하는 것을 특징으로 하는 전자 디바이스.공개특허 10-2015-0022639-3-청구항 7 제1항에 있어서,상기 캡쳐된 화면의 이미지는 캡쳐된 화면의 전체 이미지 또는 캡쳐된 화면의 일부 이미지를 포함하는 것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 캡쳐된 화면의 일부 이미지는 상기 캡쳐된 화면에 포함된 오브젝트의 이미지, 상기 캡쳐된 화면에서 사용자의 드로잉 입력에 의한 폐곡선 내에 포함된 이미지 중 적어도 하나를 포함하는 것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 캡쳐된 화면 이미지와 상기 실행 경로 정보는 미리 정해진 형식의 데이터로 저장되는 것을 특징으로 하는전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터인 것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 어플리케이션은 웹 브라우져 어플리케이션, 멀티미디어 컨텐츠 재생 어플리케이션, 클립어플리케이션 중 적어도 하나인 것을 특징으로 하는 전자 디바이스."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "전자 디바이스에서 캡쳐 화면 이용 방법에 있어서,어플리케이션 실행 화면을 캡쳐하는 과정과,상기 캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하는 과정과, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 과정을 특징으로 하는 방법."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 실행 경로 정보는 메타 데이터를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2015-0022639-4-제13항에 있어서,상기 메타 데이터는 상기 어플리케이션 실행 화면에 대응된 제목, 상기 어플리케이션 실행 화면으로 복원할 수 있는 URL, 상기 어플리케이션 실행 화면에 대응된 텍스트, 상기 어플리케이션 실행 화면에 대응된 컨텐츠 파일, 상기 어플리케이션실행 화면에 대응된 드로잉 메모 정보, 상기 어플리케이션 실행 화면에 대응된 필기 인식 결과 정보, 상기 어플리케이션 실행 화면에 대응된 클립 위치 정보 중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 메타 데이터는 딥 링크 정보를 더 포함하고,상기 딥 링크 정보는 어플리케이션 실행 화면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 딥 링크 정보는 상기 어플리케이션 실행 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보를더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서,상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 공유하기 위해 상기 캡쳐된 화면 이미지와 상기 실행 경로정보를 전송하는 과정을 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 전송하는 과정은, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 포함하는 데이터의 데이터 형식을 선택하는 과정과,상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 포함하는 데이터의 전송 방식을 선택하는 과정과,상기 선택된 데이터 형식과 상기 선택된 전송 방식에 따라 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를포함하는 데이터를 전송하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12항에 있어서,상기 캡쳐된 화면의 이미지는 캡쳐된 화면의 전체 이미지 또는 캡쳐된 화면의 일부 이미지를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서,상기 데이터 형식은 스크랩북 파일(SCC) 데이터 형식이거나 이미지 및 텍스트로 이루어진 데이터 형식인 것을특징으로 하는 방법.공개특허 10-2015-0022639-5-청구항 21 캡쳐 화면 이용 프로그램을 저장하는 저장매체에 있어서, 상기 프로그램은 전자 디바이스의 제어부에서, 어플리케이션 실행 화면을 캡쳐하는 과정과,캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하는 과정과, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 과정과,상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 공유하기 위해 상기 캡쳐된 화면 이미지와 상기 실행 경로정보를 전송하는 과정을 수행하게 하는 명령어를 포함하는 것을 특징으로 하는 저장 매체."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "데이터 공유 서버에 있어서,제1 전자 디바이스부터 업로드된 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를저장하는 저장부를 포함하고,상기 데이터가 업로드되면 상기 제1 전자 디바이스와 동일 계정으로 접속 가능한 제2 전자 디바이스에 상기 저장된 데이터를 전송하는 제어하는 제어부를 포함하는 것을 특징으로 하는 데이터 공유 서버."}
{"patent_id": "10-2014-0049459", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "데이터 공유 서버에 있어서,제1 전자 디바이스부터 업로드된, 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고,상기 데이터가 업로드되면 업로드된 데이터의 URL을 상기 제1 전자 디바이스에 전송하고, 상기 제1 전자 디바이스로부터 상기 데이터의 URL을 수신받은 제2 전자 디바이스로부터 상기 업로드된 데이터의 URL을 이용한 데이터요청을 수신받으면, 상기 업로드된 데이터를 상기 제2 전자 디바이스에 전송하도록 제어하는 제어부를 포함하는것을 특징으로 하는 데이터 공유 서버.명 세 서기 술 분 야본 발명의 다양한 실시 예들은 전자 디바이스 및 전자 디바이스에서 캡쳐된 이미지를 이용하는 기술에 관한 것 [0001]이다. 배 경 기 술최근 전자 디바이스는 개인이 휴대하고 다닐 수 있도록 휴대 단말로 개발되고 있는 경우가 많으며, 전자 디바이 [0002]스의 기능이 다양화되고 있다. 이에 따라 전자 디바이스에는 사용자의 편의를 위한 각종 기능들이 내장되고 있으며, 전자 디바이스는 각종 기 [0003]능들 별로 해당 사용자 조작에 따라 각 기능들을 활성화하여 해당 기능이 실행될 수 있다. 예를 들면, 전자 디바이스는 캡쳐 기능을 내장하고 있는 경우, 캡쳐 기능을 이용하여 전자 디바이스에서 표시되 [0004]는 다양한 화면을 캡쳐하고, 캡쳐된 이미지를 저장할 수 있다. 발명의 내용공개특허 10-2015-0022639-6-해결하려는 과제그런데 종래 화면 캡쳐 기능은 캡쳐된 이미지를 단순히 이미지로만 저장될 뿐, 캡쳐된 이미지를 이용하는 방법 [0005]은 다양하지 못한 문제점이 있다. 예를 들면, 캡쳐된 이미지는 복사되거나, 붙여넣기하는데 이용되거나, 캡쳐된이미지 내에 오브젝트를 이용하는 등과 같이 단순히 이미지 처리에만 이용되는 한계가 있다.따라서 본 발명의 다양한 실시 예들에 따르면 캡쳐 이미지를 다양한 방식으로 이용할 수 있는 전자 디바이스 및 [0006]전자 디바이스에서 캡쳐 이미지 이용 방법을 제공할 수 있다.또한 본 발명의 다양한 실시 예들에 따르면 캡쳐된 화면 이미지 저장 시, 화면 캡쳐 시의 화면을 실행시킬 수 [0007]있는 실행 경로 정보를 함께 저장하여, 추후 캡쳐된 화면 이미지를 이용하여 화면 캡쳐 시의 화면을 실행시킬수 있는 전자 디바이스 및 전자 디바이스에서 캡쳐 이미지 이용 방법을 제공할 수 있다.또한 본 발명의 다양한 실시 예들에 따르면 사용자의 전자 장치에서 캡쳐된 화면 이미지와 화면 캡쳐 시의 화면 [0008]을 실행시킬 수 있는 실행 경로 정보를 동일 사용자의 다른 전자 장치 또는 다른 사용자의 전자 장치와 공유하여 동일 사용자의 다른 전자 장치 또는 다른 사용자의 전자 장치에서도 캡쳐된 화면 이미지를 이용하여 화면 캡쳐 시의 화면을 실행시킬 수 있는 전자 디바이스 및 전자 디바이스에서 캡쳐 이미지 이용 방법을 제공할 수 있다. 과제의 해결 수단본 발명의 실시 예에 따르면 전자 디바이스에 있어서, 어플리케이션 화면을 표시하는 표시부, 상기 어플리케이 [0009]션 실행 화면이 캡쳐되면, 캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하고, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 제어부를 포함할 수 있다. 또한 본 발명의 실시 예에 따르면, 전자 디바이스에서 캡쳐 화면 이용 방법에 있어서, 어플리케이션 실행 화면 [0010]을 캡쳐하는 과정과, 상기 캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하는 과정과, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 과정을 포함할 수 있다. 또한 본 발명의 실시 예에 따르면, 캡쳐 화면 이용 프로그램을 저장하는 저장매체에 있어서, 상기 프로그램은 [0011]전자 디바이스의 제어부에서, 어플리케이션 실행 화면을 캡쳐하는 과정과, 캡쳐된 화면 이미지의 상태를 실행할수 있는 실행 경로 정보를 획득하는 과정과, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 과정과, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 공유하기 위해 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 전송하는 과정을 수행하게 하는 명령어를 포함할 수 있다. 또한 본 발명의 실시 예에 따르면, 데이터 공유 서버에 있어서, 제1 전자 디바이스부터 업로드된 캡쳐된 이미지 [0012]와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고, 상기 데이터가업로드되면 상기 제1 전자 디바이스와 동일 계정으로 접속 가능한 제2 전자 디바이스에 상기 저장된 데이터를전송하는 제어하는 제어부를 포함할 수 있다.또한 본 발명의 실시 예에 따르면, 데이터 공유 서버에 있어서, 제1 전자 디바이스부터 업로드된, 캡쳐된 이미 [0013]지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고, 상기 데이터가업로드되면 업로드된 데이터의 URL을 상기 제1 전자 디바이스에 전송하고, 상기 제1 전자 디바이스로부터 상기데이터의 URL을 수신받은 제2 전자 디바이스로부터 상기 업로드된 데이터의 URL을 이용한 데이터 요청을 수신받으면, 상기 업로드된 데이터를 상기 제2 전자 디바이스에 전송하도록 제어하는 제어부를 포함할 수 있다.발명의 효과본 발명의 다양한 실시 예들에 따르면 사용자가 어플리케이션 실행에 따른 화면을 보다가 화면을 캡쳐하면, 캡 [0014]쳐된 화면의 전체 이미지 또는 적어도 일부분과 캡쳐된 화면의 상태를 실행시킬 수 있는 실행 경로 정보를 함께저장함으로써, 사용자가 캡쳐된 화면을 이용하여 캡쳐된 화면의 상태를 실행시킬 수 있는 효과가 있다. 예를 들어 저장된 웹 페이지 화면의 전체 또는 적어도 일부 이미지를 선택하면, 해당 웹 페이지 화면의 상태를 [0015]실행시킬 수 있으므로, 사용자는 해당 웹 페이지 화면의 상태를 실행시키기 위해 웹 브라우저를 실행시키고, 웹브라우저 상에 웹 페이지 주소를 입력 하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 또한저장된 음악 재생 화면의 전체 또는 적어도 일부 이미지를 선택하면, 해당 음악 재생 화면의 상태를 실행시킬수 있으므로, 사용자는 해당 음악 재생 화면의 상태를 실행시키기 위해 음악 재생 어플리케이션을 실행시키고,공개특허 10-2015-0022639-7-음악 재생 어플리케이션에서 재생할 음악을 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 또한 저장된 클립 화면 이미지의 전체 또는 적어도 일부 이미지를 선택하면, 해당 클립 화면의 상태를 실행시킬 수 있으므로, 사용자는 클립 화면을 표시하기 위해 클립 어플리케이션을 실행 시키고, 클립 어플리케이션에서 표시할 클립 화면을 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다.또한 본 발명의 다양한 실시 예들에 따르면 사용자의 전자 디바이스에서 캡쳐된 화면 이미지와 화면 캡쳐 시의 [0016]화면을 실행시킬 수 있는 실행 경로 정보를 동일 사용자의 다른 전자 장치 또는 다른 사용자의 전자 장치와 공유하여 동일 사용자의 다른 전자 장치 또는 다른 사용자의 전자 장치에서도 캡쳐된 화면 이미지를 이용하여 화면 캡쳐 시의 화면을 실행시킬 수 있게 할 수 있다.도면의 간단한 설명도 1은 본 발명의 실시 예에 따른 전자 디바이스의 블록 구성도 [0017]도 2는 본 발명의 실시 예에 따른 전자 디바이스의 캡쳐 이미지 이용 동작을 나타낸 흐름도도 3은 본 발명의 실시 예에 따른 어플리케이션 프레임워크와 어플리케이션을 설명하기 위한 도면도 4는 본 발명의 실시 예에 따라 어플리케이션 프레임워크를 통해 실행 경로 정보를 획득하는 동작을 나타낸흐름도도 5는 본 발명의 실시 예에 따른 클래스 오브젝트에 포함 될 수 있는 정보들 중 캡쳐된 화면의 상태를 실행하는데 필요한 정보의 일 예를 나타낸 도면도 6은 본 발명의 실시 예에 따라 어플리케이션을 통해 실행 경로 정보를 획득하는 동작을 나타낸 흐름도도 4는 본 발명의 실시 예에 따라 어플리케이션 프레임워크를 통해 실행 경로 정보를 획득하는 동작을 나타낸흐름도도 5는 본 발명의 실시 예에 따른 클래스 오브젝트에 포함 될 수 있는 정보들 중 캡쳐된 화면의 상태를 실행하는데 필요한 정보의일 예를 나타낸 도면도 6은 본 발명의 실시 예에 따라 어플리케이션을 통해 실행 경로 정보를 획득하는 동작을 나타낸 흐름도도 7은 본 발명의 실시 예에 따른 캡쳐된 화면의 적어도 일부분을 선택하는 동작의 예를 설명하기 위한 도면도 8a는 본 발명의 실시 예에 따른 전자 디바이스에서 어플리케이션 화면 캡쳐하고 캡쳐된 화면의 실행 경로 정보를 획득하는 개념을 나타낸 도면도 8b는 본 발명의 실시 예에 따른 전자 디바이스에서 캡쳐된 화면의 실행 경로 정보를 이용하여 동작하는 개념을 나타낸 도면도 9는 본 발명의 실시 예에 따른 전자 디바이스에서 웹 브라우져 어플리케이션 실행 중 캡쳐된 이미지 이용 예를 나타낸 도면도 10은 본 발명의 실시 예에 따른 전자 디바이스에서 음악 재생 어플리케이션 실행 중 캡쳐된 이미지 이용 예를 나타낸 도면도 11은 본 발명의 실시 예에 따른 전자 디바이스에서 클립 어플리케이션 실행 중 캡쳐된 이미지 이용 예를 나타낸 도면도 12는 본 발명의 실시 예에 따른 디바이스에서 캡쳐된 이미지 공유 동작을 나타낸 도면도 13은 본 발명의 제1 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템을나타낸 도면도 14는 본 발명의 제1 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템의동작을 나타낸 도면도 15는 본 발명의 제2 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템을나타낸 도면도 16은 본 발명의 제2 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템의공개특허 10-2015-0022639-8-동작을 나타낸 도면도 17은 본 발명의 제3 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 개념을나타낸 도면도 18은 본 발명의 제3 실시 예에 따른 전자 디바이스들 사이에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유하는 동작을 나타낸 도면도 19 내지 도 22는 본 발명의 실시 예에 따른 전자 디바이스에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 공유하기 위한 사용자 인터페이스 화면을 나타낸 도면도 23은 본 발명의 실시 예에 따른 SCC 파일 구조를 나타낸 도면도 24는 본 발명의 실시 예에 따른 SCC 파일에 포함된 META-INF를 나타낸 도면도 25는 본 발명의 실시 예에 따른 메타 데이터를 나타낸 도면발명을 실시하기 위한 구체적인 내용본 발명의 다양한 실시 예들에서 사용되는 용어에 대해 간략히 설명하고, 본 발명의 다양한 실시 예들에 대해 [0018]구체적으로 설명하기로 한다. 본 발명의 다양한 실시 예들에서 사용되는 용어는 본 발명의 다양한 실시 예들에서의 기능을 고려하면서 가능한 [0019]현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 다양한 실시 예들의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 발명의 다양한 실시 예들에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 발명의 다양한실시 예들의 전반에 걸친 내용을 토대로 정의되어야 한다. 발명의 다양한 실시 예들에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 [0020]없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 발명의다양한 실시 예들에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다.이하, 첨부된 도면들에 기재된 내용들을 참조하여 본 발명에 따른 다양한 실시예들을 상세하게 설명한다. 다만, [0021]본 발명이 다양한 실시 예들에 의해 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일한 참조부호는 실질적으로 동일한 기능을 수행하는 부재를 나타낼 수 있다.본 개시의 다양한 실시예 가운데 사용될 수 있는\"포함한다\" 또는 \"포함할 수 있다\" 등의 표현은 개시된 해당 기 [0022]능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지않는다. 또한, 본 개시의 다양한 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징,숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리배제하지 않는 것으로 이해되어야 한다. 본 개시의 다양한 실시예에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. [0023]예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 개시의 다양한 실시예 가운데 \"제 1\", \"제2\", \"첫째,\"또는\"둘째,\"등의 표현들이 본 개시의 다양한 구성요소 [0024]들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분 짓기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 개시의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 [0025]직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 공개특허 10-2015-0022639-9-본 개시의 다양한 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 개시의 다 [0026]양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시가 [0027]속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 개시의 다양한 실시예에서 명백하게 정의하지 않는 한, 이상적이거나과도하게 형식적인 의미로 해석되지 않는다. 본 개시의 다양한 실시예에 따른 전자 디바이스(이하 ‘전자 장치’라고도 함)는, 통신 기능이 포함된 장치일 [0028]수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿PC(tablet personal computer), 이동전화기(mobile phone), 화상전화기, 전자북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑PC(laptop personal computer), 넷북 컴퓨터(netbook computer), PDA(personal digital assistant),PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head mounted device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마트 와치(smartwatCh))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 방송 채널 수신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 [0029]수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어,오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키,캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 방송 채널 수신 기능을 포함한 각종 의료기기(예: MRA(magnetic [0030]resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event datarecorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 또는 산업용 또는 가정용 로봇 중적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 방송 채널 수신 기능을 포함한 가구(furniture) 또는 건물/구조물의 [0031]일부, 전자 보드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수있다. 본 개시의 다양한 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수있다. 또한, 본 개시의 다양한 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 [0032]는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를지칭할 수 있다. 도 1은 본 발명의 실시 예에 따른 전자 디바이스의 블록 구성도이다. 도 1을 참조하면, 전자 디바이스 (100)는 [0033]제어부(110), 통신부(120), 저장부(130), 터치 스크린(140), 입출력부(150)를 포함할 수 있다. 제어부(110)는 CPU(Central Processor Unit)일 수 있다. 제어부(110)는 DSP(Digital Signal Processor)를 포함 [0034]할 수 있으며, 전자 디바이스(100) 의 제어를 위한 제어프로그램이 저장된 롬(ROM)(미도시) 및 전자 디바이스(100)의 외부로부터 입력되는 신호 또는 데이터를 기억하거나, 전자 디바이스(100)에서 수행되는 작업을 위한기억영역으로 사용되는 램(RAM)(미도시)을 포함할 수 있다. CPU는 싱글 코어, 듀얼 코어, 트리플 코어, 또는쿼드 코어를 포함할 수 있다. CPU, 롬 및 램은 내부버스(bus)를 통해 상호 연결될 수 있다. 제어부(110)는 통신부(120), 저장부(130), 터치 스크린(140), 입출력부(150)를 제어할 수 있다. 즉, 제어부 [0035](110)는 전자 디바이스(100)에 대한 전반적인 제어 기능을 수행하며, 상기 각 구성부들 간 신호 흐름을 제어할수 있다. 예컨대 제어부(110)는 본 발명의 실시 예에 따라 어플리케이션 수행에 따른 어플리케이션 화면을 터치 스크린 [0036]공개특허 10-2015-0022639-10-(140)에 표시하도록 제어할 수 있다. 제어부(110)는 터치 스크린(140)에 표시되는 어플리케이션 화면에 대한 화면 캡쳐를 수행할 수 있다. 예컨대 제어부(110)는 어플리케이션 실행 중 어플리케이션 실행에 따른 어플리케이션 화면들을 계속해서 터치 스크린(140)에 표시되도록 할 수 있으며, 어플리케이션 화면들 중, 캡쳐 요청된 어플리케이션 화면을 캡쳐할 수 있다. 또한 제어부(110)는 캡쳐된 화면에 해당하는 실행 경로 정보를 획득할 수있으며, 캡쳐된 화면에 해당하는 실행 경로 정보는 캡쳐된 화면의 상태를 실행할 수 있는 정보를 포함할 수 있다. 예를 들면, 제어부(110)는 어플리케이션 프레임워크와 어플리케이션을 포함하고, 어플리케이션 프레임워크 또는 [0037]어플리케이션을 통해 획득한 실행 경로 정보를 이용하여 해당 어플리케이션을 실행하고, 어플리케이션 실행에따른 화면들을 표시할 수 있으며, 캡쳐된 어플리케이션 화면에 해당하는 실행 경로 정보를 획득할 수 있다. 또한 제어부(110)는 캡쳐된 화면의 전체 또는 캡쳐된 화면에서 선택된 일부분의 이미지와 함께 캡쳐된 화면에 해당하는 실행 경로 정보를 저장할 수 있다. 제어부(110)는 저장된 이미지가 선택되면 선택된 이미지에 해당하는실행 경로 정보를 검출하고, 실행 경로 정보를 이용하여 선택된 이미지에 해당하는 프로세스를 실행할 수 있다.통신부(120)는 전자 디바이스(100)가 외부장치(도시되지 아니함)와 연결되도록 할 수 있다. “외부장치”는 다 [0038]른 장치(도시되지 아니함), 휴대폰(도시되지 아니함), 스마트폰(도시되지 아니함), 태블릿PC(도시되지 아니함)및 서버(도시되지 아니함)를 포함할 수 있다. 또한 통신부(120)는 제어부(110)의 제어에 따라 적어도 하나 또는복수의 안테나(도시되지 아니함)를 이용하여 이동 통신을 통해 전자 디바이스(100)가 외부 장치와 연결되도록할 수 있다. 통신부(120)는 전자 디바이스(100)에 입력되는 전화번호를 가지는 휴대폰(도시되지 아니함), 스마트폰(도시되지 아니함), 태블릿PC 또는 다른 장치(도시되지 아니함)와 음성 통화, 화상 통화, 문자메시지(SMS)또는 멀티미디어 메시지(MMS)를 위한 무선 신호를 송/수신할 수 있다. 통신부(120)는 무선랜 모듈(미도시)과 근거리통신 모듈(미도시) 중 적어도 하나를 더 포함할 수 있다. 무선랜 모듈은 제어부(110)의 제어에 따라 무선AP(access point)(도시되지 아니함)가 설치된 장소에서 인터넷에 연결될 수 있다. 무선랜 모듈은 미국전기전자학회(IEEE)의 무선랜 규격(IEEE802.11x)을 지원할 수 있다. 근거리통신 모듈은 제어부(110)의 제어에 따라 전자디바이스(100)과 화상형성장치(도시되지 아니함) 사이에 무선으로 근거리 통신을 할 수 있다. 근거리 통신방식은 블루투스(bluetooth), 적외선 통신(IrDA, infrared data association) 등이 포함될 수 있다.저장부(130)는 제어부(110)의 제어에 따라 통신부(120), 터치스크린(140), 입출력부(150) 의 동작에 대응되게 [0039]입/출력되는 신호 또는 데이터를 저장할 수 있다. 저장부(130)는 전자 디바이스(100) 또는 제어부(110)의 제어를 위한 복수의 프로그램 및 복수의 애플리케이션들과 각종 기능들을 실행하기 위한 프로그램 및 데이터를 저장할 수 있다. 또한 저장부(150)는 본 발명의 실시 예에 따른 캡쳐 화면, 캡쳐된 화면의 적어도 일부분의 이미지를 저장할 수 있고, 본 발명에서 언급되는 캡쳐 이미지를 이용하기 위한 프로그램을 저장할 수 있다. 이러한, 저장부라는 용어는 제어부(110)내 롬(ROM)(미도시), 램(RAM)(미도시) 또는 단말(100)에 장착되는 메모 [0040]리 카드(미도시)(예, SD 카드, 메모리 스틱)를 포함할 수 있다. 저장부(150)는 비휘발성 메모리, 휘발성메모리, 하드 디스크 드라이브(HDD)또는 솔리드 스테이트 드라이브(SSD)를 포함할 수 있다. 저장부(130)는 기계(예를 들어, 컴퓨터)로 읽을 수 있는 매체일 수 있으며, 기계로 읽을 수 있는 매체라는 용어 [0041]는 기계가 특정 기능을 수행할 수 있도록 상기 기계로 데이터를 제공하는 매체로 정의될 수 있다. 기계로 읽을수 있는 매체는 저장 매체일 수 있다. 상기 저장부(130)는 비휘발성 매체(non-volatile media) 및 휘발성 매체를 포함할 수 있다. 이러한 모든 매체는 상기 매체에 의해 전달되는 명령들이 상기 명령들을 상기 기계로 읽어들이는 물리적 기구에 의해 검출될 수 있도록 유형의 것이어야 한다. 상기 기계로 읽을 수 있는 매체는, 이에한정되지 않지만, 플로피 디스크(floppy disk), 플렉서블 디스크(flexible disk), 하드 디스크, 자기 테이프,시디롬(compact disc read only memory: CD ROM), 광학 디스크, 펀치 카드(punch card), 페이퍼 테이프(papertape), 램(RAM), 피롬(Programmable Read Only Memory: PROM), 이피롬(Erasable PROM: EPROM) 및 플래시 이피롬(FLASH EPROM) 중의 적어도 하나를 포함할 수 있다.입출력부(150)는 버튼(152), 마이크(154), 스피커(156), 입력 유닛(158)을 포함할 수 있다. 그리고, 이러한 입 [0042]출력부(150)는 이에 국한되지 않으며, 마우스, 트랙볼, 조이스틱 또는 커서 방향 키들과 같은 커서 컨트롤(cursor control)이 제어부(110)와의 통신 및 상기 터치 스크린(140) 상의 커서 움직임 제어를 위해 제공될 수있다.마이크(154)는 제어부(110)의 제어에 따라 각종 음원에 의한 음성(voice) 또는 각종 소리(sound)를 입력 받아 [0043]전기적인 신호를 생성할 수 있다. 공개특허 10-2015-0022639-11-스피커(156)는 제어부(110)의 제어에 따라 통신부(120) 또는 어플리케이션 실행에 의한 다양한 신호(예, 무선신 [0044]호, 방송신호, 디지털 오디오 파일, 디지털 동영상 파일 등)에 대응되는 소리를 전자 디바이스(100) 외부로 출력할 수 있다. 입력 유닛(158)은 전자 디바이스(100) 내부에 삽입되어 보관되거나 별도로 구성된 디바이스 또는 물체일 수 있 [0045]으며, 내부에 삽입되어 보관되는 경우 상기 전자 디바이스(100)로부터 인출 또는 탈착될 수 있다. 입력 유닛(158)은 스타일러스 펜(이하 ‘펜’이라 함)등과 같이 터치스크린(140)에 근접 또는 터치 등의 입력이 가능한입력 수단이거나, 사용자 손가락 등이 될 수 있다.터치 스크린(140)은 ‘표시부’일 수 있으며, 사용자에게 다양한 어플리케이션 수행 시 그래픽 유저 인터페이스 [0046]를 제공할 수 있다. 예를 들면 터치 스크린(140)은 사용자의 신체(예, 엄지를 포함하는 손가락) 또는 터치 가능한 입력 유닛(158) 예컨대 펜을 통해 적어도 하나의 근접 또는 터치 등의 각종 제스쳐 입력을 수신할 수 있다.이러한, 터치 스크린(140)은 예를 들어, 저항막(resistive) 방식, 정전용량(capacitive) 방식, 적외선(infrared) 방식 또는 초음파(acoustic wave) 방식으로 구현될 수 있다. 상기한 바와 같은 터치스크린(140)은본 발명의 실시 예에 따라 제어부(110)의 제어 하에 어플리케이션 실행에 따른 화면들 및 캡쳐된 화면들을 표시할 수 있고, 캡쳐된 화면의 적어도 일부분을 표시할 수 있다. 도 2는 본 발명의 실시 예에 따른 전자 디바이스(100)의 캡쳐 이미지 이용 동작을 나타낸 흐름도이다. 도 2를 [0047]참조하면, 전자 디바이스(100)는 210 과정에서 어플리케이션 화면을 캡쳐할 수 있다. 예를 들면, 전자 디바이스(100)는 어플리케이션 실행 중 사용자로부터 화면 캡쳐 요청에 따라 현재 표시되고 있 [0048]는 어플리케이션 화면을 캡쳐할 수 있다. 구체적으로, 전자 디바이스(100)는 웹 브라우징 어플리케이션 실행 중 사용자로부터 화면 캡쳐 요청에 따라 현 [0049]재 표시되고 있는 웹 페이지 화면을 캡쳐하거나, 음악 재생 어플리케이션 실행중 사용자로부터 화면 캡쳐 요청에 따라 현재 표시되고 있는 음악 재생 화면을 캡쳐할 수 있다. 또한 클립 어플리케이션 실행 중 사용자로부터화면 캡쳐 요청에 따라 현재 표시되고 있는 클립 화면을 캡쳐할 수 있다.전자 디바이스(100)는 220 과정에서 캡쳐된 화면에 해당하는 실행 경로 정보를 획득할 수 있다. 실행 경로 정보 [0050]는 캡쳐된 화면의 상태를 실행할 수 있는 정보를 포함할 수 있다. 예를 들면 전자 디바이스(100)는 어플리케이션 프레임워크와 어플리케이션을 이용하여 캡쳐된 어플리케이션 화 [0051]면에 해당하는 실행 경로 정보를 획득할 수 있다. 도 3은 본 발명의 실시 예에 따른 어플리케이션 프레임워크와 어플리케이션을 설명하기 위한 도면이다. [0052]도 3을 참조하면, 어플리케이션 프레임워크(310)는 어플리케이션 프로그램 표준 구조를 구현하는 클래스와 라이 [0053]브러리 모임일 수 있다. 어플리케이션 프레임워크(310)는 각종 어플리케이션에서 공통적으로 사용될 수 있는 수많은 공통 클래스 오브젝트와 특정 어플리케이션에서 사용될 수 있는 내부 클래스 오브젝트를 포함할 수 있다.어플리케이션 프레임워크(310)는 어플리케이션(320)을 실행하고, 어플리케이션 실행에 따른 화면들이 터치스크린(140)에 표시되도록 할 수 있다. 어플리케이션 프레임 워크(310)는 안드로이드(android) 운영체제 기반의 프레임워크일 수도 있고, ios 운영체제 기반의 프레임워크일 수도 있다. 본 발명의 실시예에서 언급되지 않은 전자 디바이스 운영체제 기반의 프레임워크일 수도 있다. 한편, 본 발명의 실시 예에 따르면, 디바이스(100)는 어플리케이션 프레임워크(310)를 통해 캡쳐된 어플리케이 [0054]션 화면에 해당하는 실행 경로 정보를 획득하거나, 어플리케이션(320)을 통해 캡쳐된 어플리케이션 화면에 해당하는 실행 경로 정보를 획득할 수 있다. 도 4는 본 발명의 실시 예에 따라 어플리케이션 프레임워크(310)를 통해 실행 경로 정보를 획득하는 동작을 나 [0055]타낸 흐름도이다. 도 4를 참조하면, 어플리케이션 프레임워크(310)는 410 과정에서 어플리케이션 화면이 캡쳐되는지 여부를 판단 [0056]할 수 있다. 어플리케이션 실행 중 어플리케이션 화면이 캡쳐되면 어플리케이션 프레임워크(310)는 420 과정에서 수많은 클 [0057]래스 오브젝트들 중 캡쳐된 화면에 해당하는 클래스 오브젝트를 판단할 수 있다. 어플리케이션 프레임 워크(310)는 430 과정에서 캡쳐된 화면에 해당하는 클래스 오브젝트에 포함된 정보들을 이 [0058]공개특허 10-2015-0022639-12-용하여 실행 경로 정보를 획득할 수 있다. 예를 들면, 어플리케이션 프레임 워크(310)는 클래스 오브젝트에 포함된 정보들 중 캡쳐된 화면의 상태를 실행 [0059]하는데 필요한 정보를 추출하여 실행 경로 정보를 획득할 수 있다. 도 5는 본 발명의 실시 예에 따른 클래스 오브젝트에 포함 될 수 있는 정보들 중 캡쳐된 화면의 상태를 실행하 [0060]는데 필요한 정보의 일 예를 나타낸 도면이다. 도 5를 참조하면, 클래스 오브젝트에 포함 될 수 있는 정보들 중 캡쳐된 화면의 상태를 실행하는데 필요한 정보 [0061]들은 URI, String, Boolean, byte(binary), Short, Integer, Float, Double, Date, Time, Class Object 등의정보를 포함할 수 있다. 이외에도 캡쳐된 화면을 실행할 수 있는 관련 정보라면 어떤 정보든지 가능하다.URI는 캡쳐된 화면이 실행중이었을 때의 화면에 해당하는 URI 정보일 수 있다. String은 캡쳐된 화면이 실행중 [0062]이었을 때의 문자열 정보일 수 있다. 예를 들면, String은 전화번호가 표시가 실행 중이었을 때 전화번호 이름,전화번호 어플리케이션 이름 등을 포함하는 텍스트 정보를 포함할 수 있다. Boolean은 어플리케이션의 판단 변수 값 정보(true, false)를 포함할 수 있다. Byte(binary) 정보는 이진 데이터 정보일 수 있다. 이진 데이터 정보는 이미지 파일이나, 텍스트 등 캡쳐된 화면이 실행중이었을 때의 정보를 이진화한 정보일 수 있다. Short는짧은 길이의 바이트 변수 정보로서 캡쳐된 화면이 실행중이었을 때 작은 범위의 정수 정보를 포함할 수 있다.Integer 는 0~255의 숫자 정보로서 캡쳐된 화면이 실행중이었을 때 숫자 정보를 포함할 수 있다. Float는 소수점 숫자 정보로서 캡쳐된 화면이 실행중이었을 때 소수점 숫자 정보를 포함할 수 있다. Double은 자릿수가 많은소수점 숫자 정보로서 캡쳐된 화면이 실행중이었을 때 소수점 숫자 정보를 포함할 수 있다. Date 는 날짜 정보로서 캡쳐된 화면이 실행중이었을 때 날짜 정보를 포함할 수 있다. Time 은 시간 정보로서 캡쳐된 화면이 실행중이었을 때 시간 정보를 포함할 수 있다. Class Objcet는 내부 클래스 오브젝트 정보로서 캡쳐된 화면이 실행중이었을 때 내부 클래스 오브젝트 정보를 포함할 수 있다. 이외에도 클래스 오브젝트에는 얼마든지 다른 캡쳐된 화면을 실행할 수 있는 정보가 포함될 수 있음은 자명하다.어플리케이션 프레임 워크(310)는 상기한 바와 같은 클래스 오브젝트에 포함된 정보들을 이용하여 캡쳐된 화면 [0063]의 상태를 실행할 수 있는 실행 경로 정보를 획득할 수 있다. 한편, 한 실시 예에 따르면, 전자 디바이스(100)는 어플리케이션(320)을 통해 캡쳐된 어플리케이션 화면에 해당 [0064]하는 실행 경로 정보를 획득할 수도 있다.도 6은 본 발명의 실시 예에 따라 어플리케이션(320)을 통해 실행 경로 정보를 획득하는 동작을 나타낸 흐름도 [0065]이다.도 6을 참조하면, 어플리케이션(320)은 610 과정에서 어플리케이션 화면이 캡쳐되는지 여부를 판단할 수 있다. [0066]어플리케이션 실행 중 어플리케이션 화면이 캡쳐되면 어플리케이션(320)은 620 과정에서 캡쳐된 화면에 해당하 [0067]는 URI 정보를 획득할 수 있다. URI 정보의 형식은 <ApplicationName>://<세부정보> (ex. smartclip://1.png)등이 될 수 있다.어플리케이션(320)은 630 과정에서 상기 캡쳐된 어플리케이션 화면에 대응하여 획득된 URI(Uniform Resource [0068]Identifier) 정보를 캡쳐 기능을 담당하는 어플리케이션 프레임 워크(310)로 전달할 수 있다. 다시 도 2를 참조하면, 전자 디바이스(100)는 230 과정에서 캡쳐된 화면의 적어도 일부분의 이미지를 선택할 수 [0069]있다. 도 7은 본 발명의 실시 예에 따른 캡쳐된 화면의 적어도 일부분을 선택하는 동작의 예를 설명하기 위한 도면이 [0070]다. 도 7을 참조하면, 전자 디바이스(100)는 도 7의 (a)와 같이 캡쳐된 어플리케이션 화면 전체 이미지(710)를 선택 [0071]할 수 있다. 또한 전자 디바이스(100)는 도 7의 (b)와 같이 캡쳐된 어플리케이션 화면 중 특정 오브젝트에 해당하는 이미지(720)를 선택할 수 있다. 또한 전자 디바이스(100)는 도 7의 (c)와 같이 캡쳐된 어플리케이션 화면중 전자펜 또는 사용자 손가락 등의 입력 유닛(158)에 의해 캡쳐된 어플리케이션 화면상에 드로잉된 폐곡선에내의 이미지를 선택할 수 있다. 이외에도 캡쳐된 화면의 적어도 일부분을 선택하는 방식은 화면에 존재하는 객체를 연결하는 드로잉 입력(직선, 곡선 등)에 따른 객체 선택 방식, 화면에 존재하는 특정 객체를 직접 선택하는 방식 등 다른 방식이 이용될 수 있다.전자 디바이스(100)는 240 과정에서 상기 캡쳐된 화면의 적어도 일부분의 이미지와 함께 실행 경로 정보를 저장 [0072]공개특허 10-2015-0022639-13-할 수 있다. 예컨대 전자 디바이스(100)는 캡쳐된 화면의 전체와 함께 실행 경로 정보를 저장하거나, 캡쳐된 화면 내의 오브 [0073]젝트와 함께 실행 경로 정보를 저장하거나, 캡쳐된 화면에서 전자펜, 손가락 등을 이용한 드로잉 입력에 의해사용자에 의해 선택된 부분의 이미지와 함께 실행 경로 정보를 저장할 수 있다. 이때 전자 디바이스(100)는 실행 경로 정보를 DB(DataBase) 또는 파일(File)로 저장하거나, 캡쳐된 화면의 적어 [0074]도 일부분의 이미지 내의 메타 데이터(metadata) 영역에 실행 경로 정보를 포함시켜 저장할 수 있다.상기 저장된 이미지 예컨대 캡쳐된 화면의 전체 이미지 또는 캡쳐된 화면의 적어도 일부분의 이미지는 추후 사 [0075]용자 요청에 따라 캡쳐 이미지 디스플레이 화면에 표시될 수 있다. 캡쳐 이미지 디스플레이 화면에서 사용자는상기 저장된 이미지를 선택할 수 있다. 전자 디바이스(100)는 250 과정에서 저장된 이미지가 선택되면, 260 과정에서 선택된 이미지와 함께 저장된 실 [0076]행 경로 정보를 읽어올 수 있다. 예를 들면, 전자 디바이스(100)는 실행 경로 정보가 DB(DataBase) 또는 파일(File)로 저장된 경우 해당 [0077]DB(DataBase) 또는 파일(File)을 읽어올 수 있다. 또한 전자 디바이스(100)는 실행 경로 정보가 캡쳐된 화면의적어도 일부분의 이미지 내의 메타 데이터(metadata) 영역에 저장된 경우 해당 메타 데이터 영역에서 실행 경로정보를 읽어올 수 있다.전자 디바이스(100)는 260 과정에서 상기 읽어온 실행 경로 정보를 이용하여 캡쳐된 화면의 상태를 실행할 수 [0078]있다. 예를 들면, 전자 디바이스(100)는 캡쳐된 화면의 상태가 전화번호부 어플리케이션 실행 중 전화번호 상세 정보 [0079](contact detail view)화면을 표시하는 상태였을 경우 전화번호 상세 정보를 보기 위한 전화번호부 어플리케이션 실행 요청 없이도 실행 경로 정보를 이용하여 전화번호 상세 정보 화면을 표시할 수 있다. 또한 전자 디바이스(100)는 캡쳐된 화면의 상태가 웹 브라우저 어플리케이션 실행 중 특정 웹 페이지 화면을 표 [0080]시하는 상태였을 경우 웹브라우저를 실행요청 입력 및 상기 특정 웹 페이지 화면을 보기 위한 주소 입력없이도실행 경로 정보를 이용하여 상기 특정 웹 페이지 화면을 표시할 수 있다. 또한 전자 디바이스(100)는 캡쳐된 화면의 상태가 음악 재생 어플리케이션 실행 중 특정 음악 재생 화면을 표시 [0081]하는 상태였을 경우 음악 재생 어플리케이션을 실행 요청 및 특정 음악 재생 요청 입력 없이도 실행 경로 정보를 이용하여 상기 캡쳐된 시점의 음악 재생 화면을 표시하고, 캡쳐된 시점의 음악을 재생할 수 있다. 이외에도본 발명의 다양한 실시 예에 따르면, 캡쳐된 화면의 상태는 다양한 어플리케이션 실행중의 상태일 수 있고, 상기 다양한 어플리케이션을 실행시켜 상기 캡쳐된 화면의 상태로 가기 위한 입력 없이도, 실행 경로 정보를 이용하여 즉시 캡쳐된 화면의 상태를 실행할 수 있다. 한 실시 예에 따르면 어플리케이션(320)은 전자 디바이스(100)에서 실행될 수 있는 응용 프로그램일 수 있다. [0082]어플리케이션(320)은 예를 들면, 전화번호부 어플리케이션, 웹 브라우저 어플리케이션, 음악 재생어플리케이션, 클립 어플리케이션, 스크랩북 어플리케이션 등 다양한 기능을 수행하는 어플리케이션일 수 있다. 한 실시 예에 따르면, 어플리케이션 프레임워크(310)는 다양한 어플리케이션들 중 적어도 하나 이상의 어플리케 [0083]이션을 실행하고, 어플리케이션 실행에 따른 화면들이 터치스크린(140)에 표시되도록 할 수 있다. 어플리케이션프레임워크(310)는 어플리케이션 실행 중 사용자 입력에 따라 어플리케이션 실행 화면이 캡쳐되면 캡쳐된 어플리케이션 실행 화면의 적어도 일부 이미지(이하, ‘캡쳐된 이미지’라고도 함)에 해당하는 실행 경로 정보를 획득하고, 캡쳐된 이미지와 캡쳐된 이미지에 해당하는 실행 경로 정보를 저장할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지는 캡쳐된 어플리케이션 화면 전체 이미지이거나, 캡쳐된 어플리케이션 화면에서 사용자의 드로잉입력에 의해 크롭된 일부 이미지일 수 있다.도 8a는 본 발명의 실시 예에 따른 전자 디바이스에서 어플리케이션 화면 캡쳐하고 캡쳐된 이미지에 해당하는 [0084]실행 경로 정보를 획득하는 개념을 나타낸 도면이다. 도 8a를 참조하면, 어플리케이션 프레임워크(810)는 프레임워크 레이어(801)에 해당될 수 있고, 다양한 어플리케이션들(821~824)은 어플리케이션 레이어(802)에 해당될수 있다. 한 실시 예에 따르면 다양한 어플리케이션들(821~824)은 스크랩북 어플리케이션(821), 웹 브라우저 어플리케이션(822), 동영상 서비스 어플리케이션(823), 음악 재생 어플리케이션(824)를 포함할 수 있다. 이외에도다른 어플리케이션을 더 포함할 수도 있다. 공개특허 10-2015-0022639-14-한 실시 예에 따르면 어플리케이션 프레임워크(810)는 어플리케이션 실행 화면이 표시되고 있는 상태에서, 사용 [0085]자 입력(842) 예컨대 사용자로부터 화면 캡쳐 요청 입력에 따라 어플리케이션 실행 화면을 캡쳐할 수 있고, 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 획득(844)할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 [0086]따르면 메타 데이터는 어플리케이션 실행 화면에 대응된 제목, 어플리케이션 실행 화면으로 복원할 수 있는URL, 어플리케이션 실행 화면에 대응된 텍스트, 어플리케이션 실행 화면에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 어플리케이션 실행 화면에 대응된 드로잉 메모 정보, 어플리케이션 실행 화면에 대응된 필기 인식 결과 정보, 어플리케이션 실행 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 어플리케이션 실행 화 [0087]면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 어플리케이션 실행 화면과관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 어플리케이션 실행 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 한 실시 예에 따르면 어플리케이션 프레임워크(810)는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 [0088]즉, 메타 데이터를 DB(830)(또는 파일 시스템)에 저장(846)할 수 있다. 한 실시 예에 따르면 DB(830)는 스크랩북 어플리케이션(821)에 의해 엑세스될 수 있다. 스크랩북 어플리케이션 [0089](821)은 DB(830)를 억세스하여 DB(830)에 저장된 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 예컨대 메타 데이터를 로드(844 )할 수 있고, 이에 따라 캡쳐된 어플리케이션 실행화면을 복원하여 실행되도록 할수 있다. 도 8b는 본 발명의 실시 예에 따른 전자 디바이스에서 캡쳐된 어플리케이션 실행화면을 복원하여 실행하는 개념 [0090]을 나타낸 도면이다. 도 8b를 참조하면, 스크랩북 어플리케이션(821)은 DB(830)를 억세스하여 DB(830)에 저장된 캡쳐된 이미지와 캡 [0091]쳐된 이미지에 대응된 실행 경로 정보 예컨대 메타 데이터를 로드(850)할 수 있다. 또한 스크랩북 어플리케이션(821)은 실행 경로 정보에 따라 실행 요청(854)할 수 있다. 한 실시 예에 따르면 스크랩북 어플리케이션(821)은실행 경로 정보 예컨대 메타 데이터에 따라 실행하도록 요청할 수 있다.어플리케이션 프레임워크(810)는 실행 경로 정보에 따라 해당 어플리케이션 실행화면을 복원하여 실행(854)할 [0092]수 있다. 한 실시 예에 따르면 어플리케이션 프레임워크는 적어도 하나 이상의 어플리케이션들 중 메타 데이터에 따라 해당 어플리케이션을 실행화면을 복원하여 실행할 수 있다. 도 9는 본 발명의 실시 예에 따른 전자 디바이스에서 웹 브라우져 어플리케이션 실행 중 캡쳐 이미지 이용 예를 [0093]나타낸 도면이다. 도 9의 (a)를 참조하면, 전자 디바이스(100)는 도 9의 (a)와 같이 웹 브라우져 어플리케이션 실행 중 웹 페이지 [0094]화면(910)을 표시한 상태에서 웹 페이지 화면을 캡쳐할 수 있다. 도 9의 (b)를 참조하면, 전자 디바이스(100)는 캡쳐된 웹 페이지 화면(920)에서 전체 또는 적어도 일부의 이미 [0095]지를 선택할 수 있다. 도 9의 (b)에서는 사용자에 의해 드로잉된 타원형 내의 이미지(930)가 선택된 것을 예를들고 있다. 웹 페이지 화면에서는 사각형, 원형, 다각형 등 사용자에 의해 원하는 형태의 이미지가 선택될 수있다. 전자 디바이스(100)는 선택된 이미지(930)와 캡쳐된 화면의 실행 경로 정보를 함께 저장할 수 있다. 도 9의 (c)를 참조하면, 전자 디바이스(100)는 캡쳐 이미지 표시 화면(940)에 저장된 이미지(950)를 표시하고, [0096]사용자로부터 저장된 이미지(950)를 선택받을 수 있다. 이때 저장된 이미지(950)를 직접 선택받거나, 저장된 이미지(950)의 상태를 실행하도록 요청하는 버튼(960)을 선택받을 수 있다. 도 9의 (d)를 참조하면, 전자 디바이스(100)는 저장된 이미지(950) 또는 저장된 이미지(950)의 상태를 실행하도 [0097]록 요청하는 버튼(960)이 선택되면 전자 디바이스(100)는 도 9의 (d)와 같이 저장된 이미지(950)에 해당하는 캡쳐된 화면의 상태(970)를 실행할 수 있다.도 10은 본 발명의 실시 예에 따른 전자 디바이스에서 음악 재생 어플리케이션 실행 중 캡쳐 이미지 이용 예를 [0098]나타낸 도면이다. 도 10의 (a)를 참조하면, 전자 디바이스(100)는 도 10의 (a)와 같이 음악 재생 어플리케이션 실행 중 음악 재생 [0099]공개특허 10-2015-0022639-15-화면(1010)을 표시한 상태에서 음악 재생 화면을 캡쳐할 수 있다. 도 10의 (b)를 참조하면, 전자 디바이스(100)는 캡쳐된 음악 재생 화면(1020)에서 전체 또는 적어도 일부의 이 [0100]미지를 선택할 수 있다. 도 10의 (b)에서는 사용자에 의해 드로잉된 폐곡선 내의 이미지(1030)가 선택된 것을예를 들고 있다. 캡쳐된 음악 재생 화면에서는 사각형, 원형, 다각형 등 사용자에 의해 원하는 형태의 이미지가원하는 위치에서 선택될 수 있다. 전자 디바이스(100)는 선택된 이미지(1030)와 캡쳐된 음악 재생 화면의 실행경로 정보를 함께 저장할 수 있다. 예를 들면, 선택된 이미지(1030)와 캡쳐된 음악 재생 화면의 실행 경로 정보는 캡쳐 시점에서 URI 정보 및 음악 재생 구간 정보(play time)를 포함할 수 있다.도 10의 (c)를 참조하면, 전자 디바이스(100)는 캡쳐 이미지 표시 화면(1040)에 저장된 이미지(1050)를 표시하 [0101]고, 사용자로부터 저장된 이미지(1050)를 선택받을 수 있다. 이때 저장된 이미지(1050)를 직접 선택받거나, 저장된 이미지(1050)의 상태를 실행하도록 요청하는 버튼(1060)을 선택받을 수 있다. 도 10의 (d)를 참조하면, 전자 디바이스(100)는 저장된 이미지(1050) 또는 저장된 이미지(1050)의 상태를 실행 [0102]하도록 요청하는 버튼(1060)이 선택되면 전자 디바이스(100)는 도 10의 (d)와 같이 저장된 이미지(1050)에 해당하는 캡쳐된 화면의 상태를 실행할 수 있다. 예컨대 캡쳐된 화면에 해당하는 음악 재생 지점에서 음악을 재생할수 있다. 도 11은 본 발명의 실시 예에 따른 전자 디바이스에서 클립 어플리케이션 실행 중 캡쳐 이미지 이용 예를 나타 [0103]낸 도면이다. 도 11의 (a)를 참조하면, 전자 디바이스(100)는 도 11의 (a)와 같이 음악 클립 어플리케이션 실행 중 클립된 텍 [0104]스트들이 표시된 클립 화면(1110)을 표시한 상태에서 클립 화면을 캡쳐할 수 있다. 도 11의 (b)를 참조하면, 전자 디바이스(100)는 캡쳐된 클립 화면(1120)에서 전체 또는 적어도 일부의 이미지를 [0105]선택할 수 있다. 한 실시 예에 따르면 캡쳐된 클립 화면(1120)에서 사용자의 드로잉 입력에 따라 전체 또는 적어도 일부의 이미지를 크롭하고 크롭된 이미지를 선택할 수 있다. 도 11의 (b)에서는 사용자에 의해 드로잉된폐곡선 내의 이미지(1130)가 선택된 것을 예를 들고 있다. 캡쳐된 클립 화면에서는 사각형, 원형, 다각형 등 사용자에 의해 원하는 형태의 이미지가 원하는 위치에서 선택될 수 있다. 도 11의 (c)를 참조하면, 전자 디바이스(100)는 선택된 이미지(1130)와 캡쳐된 클립 화면의 실행 경로 정보를 [0106]함께 저장할 수 있다. 캡쳐된 클립 화면의 실행 경로 정보는 “slookdemos://SmartClip” 과 같은 URI 정보를포함할 수 있다.도 11의 (d)를 참조하면, 전자 디바이스(100)는 캡쳐 이미지 표시 화면(1140)에 저장된 이미지(1150)를 표시하 [0107]고, 사용자로부터 저장된 이미지(1150)를 선택받을 수 있다. 이때 저장된 이미지(1150)를 직접 선택받거나, 저장된 이미지(1150)의 상태를 실행하도록 요청하는 아이콘(1160)을 선택받을 수 있다. 도 11의 (e)를 참조하면, 전자 디바이스(100)는 저장된 이미지(1150) 또는 저장된 이미지(1150)의 상태를 실행 [0108]하도록 요청하는 아이콘(1160)이 선택되면 전자 디바이스(100)는 도 11의 (e)와 같이 저장된 이미지(1150)에 해당하는 캡쳐된 원본 화면의 상태를 실행할 수 있다. 예컨대 캡쳐된 화면에 해당하는 클립 화면을 표시할 수 있다.상기한 바와 같은 본 발명의 다양한 실시 예들에 따르면 사용자가 어플리케이션 실행에 따른 화면을 보다가 화 [0109]면을 캡쳐하면, 캡쳐된 화면의 적어도 일부분과 캡쳐된 화면의 상태를 실행시킬 수 있는 실행 경로 정보를 함께저장함으로써, 사용자가 캡쳐된 화면을 이용하여 캡쳐된 화면의 상태를 실행시킬 수 있는 효과가 있다. 예를 들어 저장된 웹 페이지 화면의 적어도 일부 이미지를 선택하면, 해당 웹 페이지 화면의 상태를 실행시킬 [0110]수 있으므로, 사용자는 해당 웹 페이지 화면의 상태를 실행시키기 위해 웹 브라우저를 실행시키고, 웹 브라우저상에 웹 페이지 주소를 입력 하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다.또한 저장된 멀티미디어 컨텐츠 재생 화면의 적어도 일부 이미지를 선택하면, 해당 멀티미디어 컨텐츠 재생 화 [0111]면의 상태를 실행시킬 수 있으므로, 사용자는 해당 멀티미디어 컨텐츠 재생 화면의 상태를 실행시키기 위해 멀티미디어 컨텐츠 재생 어플리케이션을 실행시키고, 멀티미디어 컨텐츠 재생 어플리케이션에서 재생할 멀티미디어 컨텐츠를 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 구체적으로 멀티미디어 컨텐츠는 음악, 동영상뿐만 아니라 전자 디바이스에서 재생 가능한 다양한 컨텐츠를 포함할 수 있다. 멀티미디어 컨텐츠가 음악인 경우, 저장된 음악 및 동영상 등과 같은 멀티미디어 재생 화면의 적어도 일부 이미지를선택하면, 해당 음악 재생 화면의 상태를 실행시킬 수 있으므로, 사용자는 해당 음악 재생 화면의 상태를 실행공개특허 10-2015-0022639-16-시키기 위해 음악 재생 어플리케이션을 실행시키고, 음악 재생 어플리케이션에서 재생할 음악을 선택하는 등의사용자 입력 동작을 생략할 수 있어서 편리할 수 있다.또한 저장된 클립 화면 이미지의 적어도 일부 이미지를 선택하면, 해당 클립 화면의 상태를 실행시킬 수 있으므 [0112]로, 사용자는 클립 화면을 표시하기 위해 클립 어플리케이션을 실행 시키고, 클립 어플리케이션에서 표시할 클립 화면을 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다.한편, 상기한 다양한 실시 예들 외에도 다양한 어플리케이션에 캡쳐 화면을 이용한 실행이 적용될 수 있음은 자 [0113]명하다.본 발명의 다양한 실시 예에 따르면, 전자 디바이스(100)는 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐 [0114]된 이미지에 대응된 실행 경로 정보를 공유할 수 있다. 도 12는 본 발명의 실시 예에 따른 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 [0115]경로 정보 공유 동작을 나타낸 도면이다.도 12를 참조하면, 전자 디바이스(100)는 1210 동작에서 사용자로부터 어플리케이션 화면에서 캡쳐된 이미지와 [0116]실행 경로 정보 공유 요청이 있는지 판단할 수 있다. 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 요청이 있으면, 전자 디바이스(100)는 1220 동작 [0117]에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 생성할 수 있다. 한 실시예에 따르면 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 스크랩북 파일(SCC) 데이터 형식이거나 이미지 및 텍스트로 이루어진 데이터 형식이 될 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다.전자 디바이스(100)는 1230 동작에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이 [0118]터를 공유하기 위해 전송할 수 있다. 본 발명의 다양한 실시 예에 따르면 전자 디바이스(100)는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 [0119]정보를 포함하는 데이터를 데이터 공유 서버를 통해 동일 사용자의 다른 전자 디바이스 또는 다른 사용자의 전자 디바이스와 공유할 수 있다. 이에 따라 전자 디바이스(100)는 동일 사용자의 다른 전자 디바이스 또는 다른사용자의 전자 디바이스에서도 캡쳐된 이미지를 이용하여 캡쳐 시의 동작을 실행시킬 수 있게 할 수 있다.본 발명의 한 실시 예에 따르면, 데이터 공유 서버에 있어서, 제1 전자 디바이스부터 업로드된 캡쳐된 이미지와 [0120]캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고, 상기 데이터가 업로드되면 상기 제1 전자 디바이스와 동일 계정으로 접속 가능한 제2 전자 디바이스에 상기 저장된 데이터를 다운로드하는 제어하는 제어부를 포함할 수 있다.도 13은 본 발명의 제1 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템을 [0121]나타낸 도면이다. 도 13을 참조하면, 제1 전자 디바이스 A1(1310)는 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐된 이미지 [0122]에 대응된 실행 경로 정보를 제1 공유 서버(1330)를 통해 제2 전자 디바이스 A2(1320)와 동기화함으로써 공유할수 있다. 제1 공유 서버(1330)는 예를 들면, i-cloude 서버 등의 동일 계정의 전자 디바이스 간에 동기화를 제공하는 서버일 수 있다. 제2 전자 디바이스 A2(1320)는 제1 전자 디바이스 A1(1310)의 사용자와 동일한 사용자의 전자 디바이스일 수 있으며, 제1 전자 디바이스 A1(1310)와 동일 계정을 이용하여 제1 공유 서버(1330)에 접속할 수 있다.도 14는 본 발명의 제1 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템의 [0123]동작을 나타낸 도면이다. 도 14를 참조하면, 제1 전자 디바이스 A1(1310)는 1402 동작에서 어플리케이션 실행 화면에서 캡쳐된 이미지와 [0124]캡쳐된 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트 [0125]로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다.공개특허 10-2015-0022639-17-한 실시 예에 따르면, 캡쳐된 이미지에 대응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보 [0126]를 포함할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수있다. 한 실시 예에 따르면 메타 데이터는 어플리케이션 실행 화면에 대응된 제목, 어플리케이션 실행 화면으로복원할 수 있는 URL, 어플리케이션 실행 화면에 대응된 텍스트, 어플리케이션 실행 화면에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 어플리케이션 실행 화면에 대응된 드로잉 메모 정보, 어플리케이션 실행 화면에 대응된 필기 인식 결과 정보, 어플리케이션 실행 화면에 대응된 클립 위치 정보 등을 포함할 수있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 어플리케이션 실행 화 [0127]면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 어플리케이션 실행 화면과관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 어플리케이션 실행 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A1(1310)는 1404 동작에서 주기적 데이터 변화를 체크할 수 있다. 데이터 변화가 감지되면 [0128]제1 전자 디바이스 A1(1310)는 1406 동작에서 데이터를 통신 네트워크(1301)를 통해 제1 공유 서버(1330)에 업로드할 수 있다. 제1 공유 서버(1330)는 1408 동작에서 제1 전자 디바이스 A1(1310)로부터 업로드된 데이터를 저장할 수 있다. [0129]제1 공유 서버(1330)는 업로드된 데이터 저장 후 1410 동작에서 제1 전자 디바이스 A1(1310)와 동기화하도록 설 [0130]정된 제2 전자 디바이스 A2(1320)에 데이터를 다운로드할 수 있다. 한 실시 예에 따르면 제1 공유 서버(1330)는 푸쉬 메시지 방식 또는 폴링 방식으로 제2 전자 디바이스 A2(132 [0131]0)에 데이터를 다운로드할 수 있다.푸쉬 메시지 방식의 경우, 제1 공유 서버(1330)는 푸쉬 메시지를 이용하여 제2 전자 디바이스 A2(1320)에 데이 [0132]터가 저장됨을 알릴 수 있고,제2 전자 디바이스 A2(1320)는 푸쉬 메시지에 따라 제1 공유 서버(1330)에 저장된데이터를 요청할 수 있다. 제1 공유 서버(1330)는 저장된 데이터 요청에 따라 제2 전자 디바이스 A2(1320)에 데이터를 다운로드할 수 있다.폴링 방식의 경우, 제2 전자 디바이스 A2(1320)는 주기적으로 제1 공유 서버(1330)에 새롭게 저장된 데이터가 [0133]있는지 조회 요청할 수 있고, 제1 공유 서버(1330)는 제2 전자 디바이스 A2(1320)로부터의 조회 요청에 따라 새롭게 저장된 데이터가 있는 경우 새롭게 저장된 데이터가 있음을 알리는 응답 메시지를 보낸 후 새롭게 저장된데이터를 제2 전자 디바이스 A2(1320)에 다운로드할 수 있다.제2 전자 디바이스 A2(1320)는 1412 동작에서 다운로드받은 데이터를 저장함으로써, 제1 전자 디바이스 [0134]A1(1310)와 동기화될 수 있고, 해당 데이터를 공유할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스A1(1310)는 웹 브라우저 어플리케이션 실행 화면 즉, 웹 페이지 화면에서 사용자 입력에 따라 웹 페이지 전체화면을 캡쳐하하거나, 캡쳐된 웹 페이지 화면에서 일부 이미지를 크롭하여 캡쳐된 웹 페이지 화면의 적어도 일부 이미지를 획득할 수 있다. 제1 전자 디바이스 A1(1310)는 캡쳐된 웹 페이지 화면의 적어도 일부 이미지와 캡쳐된 웹 페이지 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 제1 공유 서버(1330)를 통해 제2 전자디바이스 A2(1320)와 공유할 수 있다. 예를 들면, 제1 전자 디바이스 A1(1310)는 웹 페이지 화면 표시 중 사용자에 입력에 따라 웹 페이지의 적어도 [0135]일부 이미지를 획득할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1(1310)는 사용자 입력에 따라 캡쳐기능을 수행하는 어플리케이이션(예컨대 SmartClip 어플리케이션)을 이용하여 웹 페이지 화면을 캡쳐하여 캡쳐된 웹 페이지 화면 이미지를 획득하거나, 캡쳐된 웹 페이지 화면에서 일부 이미지를 크롭하여 웹 페이지의 적어도 일부 이미지를 획득할 수 있다. 이하 설명에서는 캡쳐된 웹페이지 화면 이미지 또는 캡쳐된 웹 페이지 화면에서 크롭된 일부 이미지를 캡쳐된 이미지라고 설명할 수도 있다. 제1 전자 디바이스 A1(1310)는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지에 대 [0136]응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따르면캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는웹 페이지에 대응된 제목, 웹 페이지로 복원할 수 있는 URL, 웹 페이지에 대응된 텍스트, 웹 페이지에 대응된데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 웹 페이지에 대응된 드로잉 메모 정보, 웹 페이지에대응된 필기 인식 결과 정보, 웹 페이지에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면공개특허 10-2015-0022639-18-메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 웹 페이지에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다.예를 들면, 웹 페이지와 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한립 링크 정보는 웹 페이지의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다.제1 전자 디바이스 A1(1310)는 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 [0137]미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다.제1 전자 디바이스 A1(1310)는 스크랩북 어플리케이션과 관련된 DB의 데이터 변화를 주기적으로 체크할 수 [0138]있다. 데이터 변화가 감지되면 제1 전자 디바이스 A1(1310)는 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 통신 네트워크(1301)를 통해 제1 공유 서버(1330)에 업로드할 수 있다. 제1 공유 서버(1330)는 제1 전자 디바이스 A1(1310)로부터 업로드된 데이터를 저장할 수 있다. 제1 공유 서버(1330)는 업로드된 데이터 저장 후 제1 전자 디바이스 A1(1310)와 동기화하도록 설정된 제2 전자 [0139]디바이스 A2(1320)에 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는데이터를 데이터를 다운로드할 수 있다.한 실시 예에 따르면 제1 공유 서버(1330)는 푸쉬 메시지 방식 또는 폴링 방식으로 제2 전자 디바이스 A2(132 [0140]0)에 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드할 수 있다.푸쉬 메시지 방식의 경우, 제1 공유 서버(1330)는 푸쉬 메시지를 이용하여 제2 전자 디바이스 A2(1320)에 캡쳐 [0141]된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터가 저장됨을 알릴수 있고,제2 전자 디바이스 A2(1320)는 푸쉬 메시지에 따라 제1 공유 서버(1330)에 캡쳐된 웹 페이지 이미지와캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 요청할 수 있다. 제1 공유 서버(1330)는 저장된 데이터 요청에 따라 제2 전자 디바이스 A2(1320)에 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드할 수 있다.폴링 방식을 이용하는 경우, 제2 전자 디바이스 A2(1320)는 주기적으로 제1 공유 서버(1330)에 새롭게 저장된 [0142]데이터가 있는지 조회 요청할 수 있고, 제1 공유 서버(1330)는 제2 전자 디바이스 A2(1320)로부터의 조회 요청에 따라 새롭게 저장된 데이터가 있는 경우 새롭게 저장된 데이터가 있음을 알리는 응답 메시지를 보낸 후 새롭게 저장된 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를제2 전자 디바이스 A2(1320)에 다운로드할 수 있다.제2 전자 디바이스 A2(1320)는 다운로드받은 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실 [0143]행 경로 정보를 포함하는 데이터를 저장함으로써, 제1 전자 디바이스 A1(1310)와 동기화될 수 있고, 캡쳐된 웹페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 공유할 수 있다. 또한 제2 전자 디바이스A2(1320)는 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 사용자에게 표시할수 있고, 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 이용하여 해당 웹 페이지 화면이 표시되도록 실행할 수 있다.또한 한 실시 예에 따르면 제1 전자 디바이스 A1(1310)는 동영상 재생 서비스 어플리케이션 실행 화면 예컨대 [0144]유투브(Youtube)화면에서 사용자 입력에 따라 동영상 재생 서비스 어플리케이션 실행 화면을 캡쳐하하거나, 캡쳐된 동영상 재생 서비스 어플리케이션 실행 화면 에서 일부 이미지를 크롭하여 캡쳐된 동영상 재생 서비스 어플리케이션 실행 화면의 적어도 일부 이미지를 획득할 수 있다. 제1 전자 디바이스 A1(1310)는 캡쳐된 동영상재생 서비스 어플리케이션 실행 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 어플리케이션 실행 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 제1 공유 서버(1330)를 통해 제2 전자 디바이스 A2(1320)와 공유할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1(1310)는 동영상 재생 서비스 어플리케이션 실행 화면 표시 중 캡쳐 [0145]기능을 수행하는 어플리케이이션(예컨대 SmartClip 어플리케이션)을 이용하여 동영상 재생 서비스 화면을 캡쳐하여 캡쳐된 동영상 재생 서비스 화면 이미지를 획득하거나, 캡쳐된 동영상 재생 서비스 화면 이미지에서 일부공개특허 10-2015-0022639-19-이미지를 크롭하여 획득할 수 있다. 이하 에서는 캡쳐된 동영상 재생 서비스 화면 이미지 또는 캡쳐된 동영상재생 서비스 화면에서 크롭된 일부 이미지를 캡쳐된 이미지로 설명할 수 있다.한편, 제1 전자 디바이스 A1(1310)는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지 [0146]에 대응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 동영상 재생 서비스에 대응된 제목, 동영상 재생 서비스로 복원할 수 있는 URL, 동영상 재생 서비스에 대응된 텍스트, 동영상 재생 서비스에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 동영상 재생 서비스에 대응된 드로잉 메모 정보, 동영상 재생 서비스에 대응된 필기 인식 결과 정보, 동영상 재생 서비스에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 동영상 재생서비스 화면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 동영상 재생 서비스 화면과 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 동영상 재생 서비스 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다.제1 전자 디바이스 A1(1310)는 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서 [0147]비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 어플리케이션과 관련된 DB에 저장될 수 있다. 제1 전자 디바이스 A1(1310)는 스크랩북 어플리케이션과 관련된 DB의 데이터 변화를 주기적으로 체크할 수 [0148]있다. 데이터 변화가 감지되면 제1 전자 디바이스 A1(1310)는 캡쳐된 동영상 재생 서비스 화면의 적어도 일부이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를통신 네트워크(1301)를 통해 제1 공유 서버(1330)에 업로드할 수 있다. 제1 공유 서버(1330)는 제1 전자 디바이스 A1(1310)로부터 업로드된 데이터를 저장할 수 있다. 제1 공유 서버(1330)는 업로드된 데이터 저장 후 제1 전자 디바이스 A1(1310)와 동기화하도록 설정된 제2 전자 디바이스 A2(1320)에 캡쳐된 동영상 재생 서비스 화면의적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드할 수 있다.한 실시 예에 따르면 제1 공유 서버(1330)는 푸쉬 메시지 방식 또는 폴링 방식으로 제2 전자 디바이스 A2(132 [0149]0)에 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드할 수 있다.푸쉬 메시지 방식의 경우, 제1 공유 서버(1330)는 푸쉬 메시지를 이용하여 제2 전자 디바이스 A2(1320)에 데이 [0150]터가 저장됨을 알릴 수 있고, 제2 전자 디바이스 A2(1320)는 푸쉬 메시지에 따라 제1 공유 서버(1330)에 저장된데이터를 요청할 수 있다. 제1 공유 서버(1330)는 저장된 데이터 요청에 따라 제2 전자 디바이스 A2(1320)에 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드할 수 있다.폴링 방식을 이용하는 경우, 제2 전자 디바이스 A2(1320)는 주기적으로 제1 공유 서버(1330)에 새롭게 저장된 [0151]데이터가 있는지 조회 요청할 수 있고, 제1 공유 서버(1330)는 제2 전자 디바이스 A2(1320)로부터의 조회 요청에 따라 새롭게 저장된 데이터가 있는 경우 새롭게 저장된 데이터가 있음을 알리는 응답 메시지를 보낸 후 새롭게 저장된 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 전자 디바이스 A2(1320)에 다운로드할 수 있다.제2 전자 디바이스 A2(1320)는 다운로드받은 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를저장함으로써, 제1 전자 디바이스 A1(1310)와 동기화될 수 있고, 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 공유할 수있다. 또한 제2 전자 디바이스 A2(1320)는 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 사용자에게 표시할 수 있고, 캡쳐된동영상 재생 서비스 화면의 적어도 일부 이미지지에 대응된 실행 경로 정보를 이용하여 해당 동영상 재생 서비스가 실행되도록 할 수 있다.공개특허 10-2015-0022639-20-또한 한 실시 예에 따르면 제1 전자 디바이스 A1(1310)는 음악 재생 어플리케이션 실행 화면 예컨대 음악 재생 [0152]화면에서 사용자 입력에 따라 음악 재생 화면을 캡쳐하여 캡쳐된 음악 재생 화면 적어도 이미지를 획득할 수 있다. 한 실시 옝 따르면 캡쳐된 음악 재생 화면 전체 이미지를 획득하거나, 캡쳐된 음악 재생 화면에서 일부 이미지를 크롭하여 캡쳐된 음악 재생 화면의 일부 이미지를 획득할 수 있다. 제1 전자 디바이스 A1(1310)는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로정보를 제1 공유 서버(1330)를 통해 제2 전자 디바이스 A2(1320)와 공유할 수 있다 한 실시 예에 따르면 제1 전자 디바이스 A1(1310)는 음악 재생 중 사용자 입력에 따라 캡쳐 기능을 수행하는 어 [0153]플리케이션(예컨대 SmartClip 어플리케이션)을 이용하여 음악 재생 화면의 적어도 일부 이미지를 캡쳐할 수 있다. 이하 설명에서는 캡쳐된 음악 재생 화면 전체 이미지 또는 캡쳐된 음악 재생 화면에서 크롭된 일부 이미지를 캡쳐된 이미지라고 설명할 수 있다. 한편, 제1 전자 디바이스 A1(1310)는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지 [0154]에 대응된 실행 경로 정보는 캡쳐된 이미지의 음악 재생 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면메타 데이터는 음악 재생 화면에 대응된 제목, 음악 재생 화면의 상태로 복원할 수 있는 URL, 음악 재생 화면에대응된 텍스트, 음악 재생 화면에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 음악 재생화면에 대응된 드로잉 메모 정보, 음악 재생 화면에 대응된 필기 인식 결과 정보, 음악 재생 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥링크 정보는 음악 재생 화면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면,음악 재생 화면과 관련된 오디오 파일에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 음악 재생 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A1(1310)는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 [0155]일부 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1(1310)는음악 재생 화면에 대응된 오디오 파일을 데이터에 더 포함시킬 수 있다. 제1 전자 디바이스 A1(1310)는 스크랩북 어플리케이션과 관련된 DB의 데이터 변화를 주기적으로 체크할 수 [0156]있다. 데이터 변화가 감지되면 제1 전자 디바이스 A1(1310)는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와캡쳐된 음악 재생 화면의 적어도 일부 이미지를 통신 네트워크(1301)를 통해 제1 공유 서버(1330)에 업로드할수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1(1310)는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와캡쳐된 음악 재생 화면의 적어도 일부 이미지외에 오디오 파일을 더 포함하는 데이터를 통신 네트워크(1301)를통해 제1 공유 서버(1330)에 업로드할 수 있다. 한 실시 예에 따르면 오디오 파일은 미리 정해진 데이터 크기이하인 경우에만 업로드될 수 있다. 한 실시 예에 따르면 미리 정해진 데이터 크기는 15Mbyte 일 수 있다. 제1 공유 서버(1330)는 제1 전자 디바이스 A1(1310)로부터 업로드된 데이터를 저장할 수 있다. 제1 공유 서버 [0157](1330)는 업로드된 데이터 저장 후 제1 전자 디바이스 A1(1310)와 동기화하도록 설정된 제2 전자 디바이스A2(1320)에 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 다운로드할 수 있다.한 실시 예에 따르면 제1 공유 서버(1330)는 푸쉬 메시지 방식 또는 폴링 방식으로 제2 전자 디바이스 A2(132 [0158]0)에 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 다운로드할 수 있다.푸쉬 메시지 방식의 경우, 제1 공유 서버(1330)는 푸쉬 메시지를 이용하여 제2 전자 디바이스 A2(1320)에 데이 [0159]터가 저장됨을 알릴 수 있고,제2 전자 디바이스 A2(1320)는 푸쉬 메시지에 따라 제1 공유 서버(1330)에 데이터를 요청할 수 있다. 제1 공유 서버(1330)는 저장된 데이터 요청에 따라 제2 전자 디바이스 A2(1320)에 캡쳐된음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부공개특허 10-2015-0022639-21-이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 다운로드할 수 있다.폴링 방식을 이용하는 경우, 제2 전자 디바이스 A2(1320)는 주기적으로 제1 공유 서버(1330)에 새롭게 저장된 [0160]데이터가 있는지 조회 요청할 수 있고, 제1 공유 서버(1330)는 제2 전자 디바이스 A2(1320)로부터의 조회 요청에 따라 새롭게 저장된 데이터가 있는 경우 새롭게 저장된 데이터가 있음을 알리는 응답 메시지를 보낸 후 새롭게 저장된 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 제2 전자 디바이스A2(1320)에 다운로드할 수 있다.제2 전자 디바이스 A2(1320)는 저장된 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 [0161]적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 다운로드받을 수 있다. 제2 전자 디바이스 A2(1320)는 다운로드받은 캡쳐된 음악 재생 화면의 적어도 일부이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로정보와 오디오 파일을 포함하는 데이터를 저장함으로써, 제1 전자 디바이스 A1(1310)와 동기화될 수 있고, 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로정보를 공유하거나, 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 공유할 수 있다. 또한 제2 전자 디바이스 A2(1320)는 캡쳐된 음악재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 사용자에게 표시할 수 있고, 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 이용하여해당 음악이 재생되도록 할 수 있다. 또한 제2 전자 디바이스 A2(1320)는 오디오 파일을 재생할 수도 있다.한 실시 예에 따르면 데이터 공유 서버에 있어서, 제1 전자 디바이스부터 업로드된 캡쳐된 이미지와 캡쳐된 이 [0162]미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고, 상기 데이터가 업로드되면 업로드된 데이터의 URL을 상기 제1 전자 디바이스에 전송하여 상기 제1 디바이스에 의해 상기 업로드된 데이터의URL이 제2 전자 디바이스에 전달되도록 하고, 상기 제2 전자 디바이스에 의해 상기 업로드된 데이터의 URL을 이용한 데이터 요청에 따라 상기 업로드된 데이터를 상기 제2 전자 디바이스에 다운로드하도록 제어하는 제어부를포함할 수 있다.도 15는 본 발명의 제2 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템을 [0163]나타낸 도면이다. 도 15를 참조하면, 제1 전자 디바이스 A(1510)는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포 [0164]함하는 데이터를 통신 네트워크(1501)를 통해 제2 공유 서버(1530)에 업로드할 수 있다. 제1 전자 디바이스(1510)는 제2 공유 서버(1530)로부터 업로드된 데이터의 URL을 수신하여 제2 전자 디바이스 B(1520)에 제공할수 있다. 제2 공유 서버(1530)는 예를 들면, Dropbox 등의 클라우드 스토리지 서비스를 제공하는 서버일 수 있으며, 전 [0165]자 디바이스들이 데이터 업로드하고, 다운로드 받을 수 있는 서비스를 제공하는 서버일 수 있다. 제2 공유 서버(1530)는 제1 전자 디바이스 A(1510)로부터 데이터가 업로드되면 업로드된 데이터의 ULR을 제1 전자 디바이스A(1510)에 제공할 수 있다.제2 전자 디바이스 B(1520)는 통신 네트워크(1501)를 통해 제1 전자 디바이스 A(1510)로부터 제2 공유 서버 [0166](1530)에 업로드된 데이터의 URL을 수신할 수 있다. 제2 전자 디바이스 B(1520)는 제1 전자 디바이스 A(1510)의사용자와 다른 사용자의 전자 디바이스일 수 있으며, 제1 전자 디바이스 A(1510)와 다른 계정을 이용하여 제2공유 서버(1530)에 접속하여 업로드된 데이터의 ULR에 해당하는 데이터를 다운로드받을 수 있다. 제2 전자 디바이스 B(1520)는 다운로드받은 데이터를 저장함으로써, 제1 전자 디바이스 A(1510)와 데이터를 공유할 수 있다.도 16은 본 발명의 제2 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템의 [0167]동작을 나타낸 도면이다. 도 16을 참조하면, 제1 전자 디바이스 A(1510)는 1602 동작에서 어플리케이션 실행 화면에서 캡쳐된 이미지와 [0168]캡쳐된 이미지에 대응된 실행 경로 정보를 저장할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A(1510)는캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한공개특허 10-2015-0022639-22-실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 [0169]따르면 메타 데이터는 어플리케이션 실행 화면에 대응된 제목, 어플리케이션 실행 화면으로 복원할 수 있는URL, 어플리케이션 실행 화면에 대응된 텍스트, 어플리케이션 실행 화면에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 어플리케이션 실행 화면에 대응된 드로잉 메모 정보, 어플리케이션 실행 화면에 대응된 필기 인식 결과 정보, 어플리케이션 실행 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 어플리케이션 실행 화 [0170]면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 어플리케이션 실행 화면과관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 어플리케이션 실행 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A(1510)는 1604 동작에서 사용자에 의한 데이터 업로드 요청이 수신되면, 1606 동작에서 제 [0171]2 공유 서버(1630)에 데이터를 업로드할 수 있다. 제2 공유 서버(1630)는 1608 동작에서 업로드된 데이터를 저장하고, 1610 동작에서 업로드된 데이터를 엑세스할 [0172]수 있도록 하는 업로드된 데이터의 URL을 제1 전자 디바이스 A(1510)에 전송할 수 있다. 제1 전자 디바이스 A(1510)는 1612 동작에서 사용자로부터 업로드된 데이터의 URL 공유 요청을 입력받을 수 있 [0173]다. 만약 업로드된 데이터의 URL 공유 요청이 입력되면 제1 전자 디바이스 A(1510)는 1614 동작에서 업로드된데이터의 URL 전송 방식을 선택할 수 있다. 한 실시 예에 따르면 업로드된 데이터의 URL 전송 방식은 메일 전송방식, 메시지 전송 방식(SMS,MMS 등), 채팅 메시지 전송 방식(chat on), WIFI direct 전송 방식 중 어느 하나의 전송 방식일 수 있다. 이 외에도 전송 방식은 ULR 을 전송할 수 있는 전송 방식이면 어느 것이나 가능할 수있다. 제1 전자 디바이스 A(1510)는 1616 동작에서 상기 선택된 전송 방식으로 업로드된 데이터의 URL을 제2 전자 디바이스 B(1520)에 전송할 수 있다. 제2 전자 디바이스 B(1520)는 1618 동작에서 업로드된 데이터의 ULR이 수신되면 업로드된 데이터의 URL에 접속 [0174]할 수 있고 1620 동작에서 업로드된 데이터를 다운로드 받을 수 있다. 제2 전자 디바이스 B(1520)는 1622 동작에서 다운로드된 데이터를 저장함으로써, 제1 전자 디바이스 A(1510)와 데이터를 공유할 수 있다.한 실시 예에 따르면 제1 전자 디바이스 A(1510)는 웹 브라우저 어플리케이션 실행 화면 즉, 웹 페이지 화면이 [0175]캡쳐되거나 웹 페이지 화면에서 적어도 일부 이미지가 크롭되어 웹 페이지 화면의 일부 이미지가 캡쳐된 경우,캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 공유 서버(1530)에 업로드하고, 제2 공유 서버(1530)로부터 업로드된 데이터의 URL을 수신하여 제2 전자 디바이스 B(1520)에 제공할 수 있다. 예를 들면, 제1 전자 디바이스 A(1510)는 웹 페이지 화면 표시 중 사용자에 입력에 따라 웹 페이지의 적어도 일부 이미지를 캡쳐할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A(1510)는 사용자 입력에 따라 캡쳐기능을 수행하는 어플리케이이션(예컨대 SmartClip 어플리케이션)을 이용하여 웹 페이지의 적어도 일부 이미지를 캡쳐할 수 있다. 또한 제1 전자 디바이스 A(1510)는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지에 대응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다.한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에따르면 메타 데이터는 웹 페이지에 대응된 제목, 웹 페이지로 복원할 수 있는 URL, 웹 페이지에 대응된 텍스트,웹 페이지에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 웹 페이지에 대응된 드로잉 메모정보, 웹 페이지에 대응된 필기 인식 결과 정보, 웹 페이지에 대응된 클립 위치 정보 등을 포함할 수 있다. 한실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 웹 페이지에서 이용되는리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 웹 페이지와 관련된 동영상 파일, 사운드,이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 웹 페이지의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A(1510)는 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 [0176]미리 정해진 형식의 데이터로 저장할 수 있다.한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트 [0177]로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를공개특허 10-2015-0022639-23-포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 어플리케이션과 관련된 DB에 저장될 수 있다. 제1 전자 디바이스 A(1510)는 스크랩북 어플리케이션과 관련된 DB에 저장된 데이터들 중 사용자로부터 제2 공유 서버(1530)에 업로드될 데이터를 선택받을 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A(1510)는 업로드될 데이터를 선택받을 수있는 옵션을 제공할 수 있다. 제1 전자 디바이스 A(1510)는 사용자에 의해 업로드될 데이터가 선택되면 제2 공유 서버(1530)에 데이터를 업로드하고, 업로드된 데이터의 URL을 요청할 수 있다. 제2 공유 서버(1530)는 업로드된 데이터를 저장하고, 업로드된 데이터를 엑세스할 수 있도록 하는 업로드된 데이터의 URL을 생성하여 제1전자 디바이스 A(1510)에 전달할 수 있다. 제1 전자 디바이스 A(1510)는 사용자로부터 업로드된 데이터의 URL공유 요청을 입력받을 수 있다. 만약 업로드된 데이터의 URL 공유 요청이 입력되면 제1 전자 디바이스 A(1510)는 업로드된 데이터의 URL 공유 방식을 선택할 수 있다. 한 실시 예에 따르면 업로드된 데이터의 URL 공유 방식은 메일 전송 방식, 메시지 전송 방식(SMS,MMS 등), 채팅 메시지 전송 방식(chat on), WIFI direct 전송 방식중 어느 하나의 전송 방식일 수 있다. 이 외에도 전송 방식은 URL 을 전송할 수 있는 전송 방식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스 A(1510)는 상기 선택된 전송 방식으로 업로드된 데이터의 URL을 제2 전자 디바이스 B(1520)에 전송할 수 있다. 제2 전자 디바이스 B(1520)는 업로드된 데이터의 URL이 포함된 메시지를 수신할 수 있다. 제2 전자 디바이스 B(1520)는 업로드된 데이터의 URL에 접속을 하기 위해 웹 브라우져 어플리케이션을 실행할 수 있고 업로드된 데이터의 URL에 접속하여 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드 받을 수 있다. 제2 전자 디바이스 B(1520)는 다운로드된 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장할 수 있고, 실행할 수 있다. 한 실시 예에 따르면 제2 전자 디바이스 B(1520)는 스크랩북 어플리케이션 DB에다운로드된 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를저장할 수 있고, 스크랩북 어플리케이션을 통해 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 이용하여해당 웹 페이지 화면이 표시되도록 실행할 수 있다.또한 한 실시 예에 따르면 제1 전자 디바이스 A(1510)는 동영상 재생 서비스 어플리케이션 실행 화면 표시 중 [0178]예컨대 유투브 화면 표시 중 적어도 일부 이미지가 캡쳐된 경우, 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제1 공유 서버(1530)를 통해 제2 공유 서버(1530)에 업로드하고, 제2 공유 서버(1530)로부터 업로드된 데이터의 URL을 수신하여 제2 전자 디바이스 B(1520)에 제공할 수 있다. 예를 들면, 제1 전자 디바이스 A(1510)는 사용자 입력에 따라 캡쳐 기능을 수행하는 어플리케이이션을 이용하여 [0179]동영상 재생 서비스 화면의 적어도 일부 이미지를 캡쳐할 수 있다. 이하 설명에서는 캡쳐된 동영상 재생 서비스화면 이미지 또는 캡쳐된 캡쳐된 동영상 재생 서빗 화면 이미지에서 크롭된 일부 이미지를 캡쳐된 이미지라고설명할 수 있다. 또한 제1 전자 디바이스 A1(1510)는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지 [0180]에 대응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 동영상 재생 서비스에 대응된 제목, 동영상 재생 서비스로 복원할 수 있는 URL, 동영상 재생 서비스에 대응된 텍스트, 동영상 재생 서비스에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 동영상 재생 서비스에 대응된 드로잉 메모 정보, 동영상 재생 서비스에 대응된 필기 인식 결과 정보, 동영상 재생 서비스에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할수 있다. 딥 링크 정보는 동영상 재생 서비스 화면에서 이용되는 동영상에 다이렉트로 엑세스할 수 있는 정보일수 있다. 예를 들면, 동영상 재생 서비스 화면과 관련된 동영상 파일에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 동영상 재생 서비스 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A(1510)는 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서 [0181]비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스 A(1510)는 스크랩북 어플리케이션과 관련된 DB에 저장된 데이터들 중 사용자로부터 제2 공유 [0182]서버(1530)에 업로드될 데이터 즉, 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 선택받을 수 있다. 한 실공개특허 10-2015-0022639-24-시 예에 따르면 제1 전자 디바이스 A(1510)는 업로드될 데이터를 선택받을 수 있는 옵션을 제공할 수 있다. 제1전자 디바이스 A(1510)는 사용자에 의해 업로드될 데이터가 선택되면 제2 공유 서버(1530)에 데이터를 업로드하고, 업로드된 데이터의 URL을 요청할 수 있다. 제2 공유 서버(1530)는 업로드된 데이터를 저장하고, 업로드된데이터를 엑세스할 수 있도록 하는 업로드된 데이터의 URL을 생성하여 제1 전자 디바이스 A(1510)에 전달할 수있다. 제1 전자 디바이스 A(1510)는 사용자로부터 업로드된 데이터의 URL 공유 요청을 입력받을 수 있다. 만약업로드된 데이터의 URL 공유 요청이 입력되면 제1 전자 디바이스 A(1510)는 업로드된 데이터의 URL 공유 방식을선택할 수 있다. 한 실시 예에 따르면 업로드된 데이터의 URL 공유 방식은 메일 전송 방식, 메시지 전송 방식(SMS,MMS 등), 채팅 메시지 전송 방식(chat on), WIFI direct 전송 방식 중 어느 하나의 전송 방식일 수 있다.이 외에도 전송 방식은 URL 을 전송할 수 있는 전송 방식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스A(1510)는 상기 선택된 전송 방식으로 업로드된 데이터의 URL을 제2 전자 디바이스 B(1520)에 전송할 수 있다.제2 전자 디바이스 B(1520)는 업로드된 데이터의 URL이 포함된 메시지를 수신할 수 있다. 제2 전자 디바이스B(1520)는 업로드된 데이터의 URL에 접속을 하기 위해 웹 브라우져를 실행할 수 있고 웹 브라우져를 통해 업로드된 데이터의 URL에 접속하여 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드 받을 수 있다. 제2 전자 디바이스 B(1520)는 다운로드된 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장할 수 있고, 실행할수 있다. 한 실시 예에 따르면 제2 전자 디바이스 B(1520)는 스크랩북 어플리케이션 DB에 다운로드된 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 저장할 수 있고, 스크랩북 어플리케이션을 통해 동영상 재생 서비스 화면의 적어도 일부이미지에 대응된 실행 경로 정보를 이용하여 동영상 서비스 화면이 표시되도록 실행할 수 있다.또한 한 실시 예에 따르면 제1 전자 디바이스 A(1510)는 음악 재생 어플리케이션 실행 화면 표시 중 예컨대 음 [0183]악 재생 화면의 적어도 일부 이미지가 캡쳐된 경우, 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 공유 서버(1530)에 업로드하고, 제2 공유 서버(1530)로부터 업로드된 데이터의 URL을 수신하여 제2 전자 디바이스 B(1520)에 제공할 수있다. 예를 들면, 제1 전자 디바이스 A(1510)는 사용자 입력에 따라 캡쳐 기능을 수행하는 어플리케이션을 이용하여 [0184]음악 재생 어플리케이션 실행 화면의 적어도 일부 이미지를 캡쳐할 수 있다. 이하 설명에서는 캡쳐된 음악 재생화면 전체 이미지 또는 캡쳐된 음악 재생 화면에서 크롭된 일부 이미지를 캡쳐된 이미지라고 설명할 수 있다. 제1 전자 디바이스 A(1510)는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지에 대응 [0185]된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 음악 재생 화면에 대응된 제목, 음악 재생 화면으로 복원할 수 있는 URL, 음악 재생 화면에 대응된 텍스트, 음악재생 화면에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 음악 재생 화면에 대응된 드로잉메모 정보, 음악 재생 화면에 대응된 필기 인식 결과 정보, 음악 재생 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 음악 재생화면에서 이용되는 음악 파일에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 음악 재생 화면과 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 음악 재생화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A(1510)는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 [0186]일부 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A(1510)는 음악 재생 화면에 대응된 원본 오디오 파일을 캡쳐된 음악 재생 화면의 적어도 일부이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 함께 데이터에 포함시킬 수있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 어플리케이션과 관련된 DB에 저장될 수 있다. 제1 전자 디바이스 A(1510)는 스크랩북 어플리케이션과 관련된 DB에 저장된 데이터들 중 사용자로부터 제2 공유 [0187]서버(1530)에 업로드될 데이터 즉, 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미공개특허 10-2015-0022639-25-지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 선택받을 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A(1510)는 업로드될 데이터를 선택받을 수 있는옵션을 제공할 수 있다. 제1 전자 디바이스 A(1510)는 사용자에 의해 업로드될 데이터가 선택되면 제2 공유 서버(1630)에 데이터를 업로드하고, 업로드된 데이터의 URL을 요청할 수 있다. 제2 공유 서버(1530)는 업로드된데이터를 저장하고, 업로드된 데이터를 엑세스할 수 있도록 하는 업로드된 데이터의 URL을 생성하여 제1 전자디바이스 A(1510)에 전달할 수 있다. 제1 전자 디바이스 A(1510)는 사용자로부터 업로드된 데이터의 URL 공유요청을 입력받을 수 있다. 만약 업로드된 데이터의 URL 공유 요청이 입력되면 제1 전자 디바이스 A(1510)는 업로드된 데이터의 URL 공유 방식을 선택할 수 있다. 한 실시 예에 따르면 업로드된 데이터의 URL 공유 방식은 메일 전송 방식, 메시지 전송 방식(SMS,MMS 등), 채팅 메시지 전송 방식(chat on), WIRI direct 전송 방식 중 어느 하나의 전송 방식일 수 있다. 이 외에도 전송 방식은 ULR 을 전송할 수 있는 전송 방식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스 A(1510)는 상기 선택된 전송 방식으로 업로드된 데이터의 URL을 제2 전자 디바이스 B(1520)에 전송할 수 있다. 제2 전자 디바이스 B(1520)는 업로드된 데이터의 URL이 포함된 메시지를 수신할 수 있다. 제2 전자 디바이스 B(1520)는 업로드된 데이터의 URL에 접속을 하기 위해 웹 브라우져 어플리케이션을 실행할 수 있고 웹 브라우져를 통해 업로드된 데이터의 URL에 접속하여 캡쳐된 음악 재생 화면의 적어도일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 데이터를 다운로드 받을 수 있다. 제2 전자 디바이스 B(1520)는 다운로드된 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를포함하는 데이터 또는 오디오 데이터를 더 포함하는 데이터를 저장할 수 있고, 실행할 수 있다. 한 실시 예에따르면 제2 전자 디바이스 B(1520)는 스크랩북 어플리케이션 DB에 다운로드된 캡쳐된 음악 재생 화면의 적어도일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장할 수 있고, 스크랩북 어플리케이션을 통해 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를이용하여 해당 음악이 재생되도록 실행할 수 있다.도 17은 본 발명의 제3 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 개념을 [0188]나타낸 도면이다. 도 17를 참조하면, 제1 전자 디바이스 A(1710)는 어플리케이션 실행 중 어플리케이션 실행 화면에서 캡쳐된 이 [0189]미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 통신 네트워크(1701)를 통해 제2 전자 디바이스 B(1720)에 직접 전달하여 공유할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A(1710)는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 원본 그대로 이미지 및 텍스트로 이루어진형식의 데이터로 제2 전자 디바이스 B(1720)에 전달하거나, 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로정보를 포함하는 데이터를 일정한 데이터 형식으로 예컨대 스크랩북 파일(SCC) 형식의 데이터로 변환하여 전달할 수 있다.도 18은 본 발명의 제3 실시 예에 따른 전자 디바이스들 사이에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실 [0190]행 경로 정보 공유하는 동작을 나타낸 도면이다. 도 18을 참조하면, 제1 전자 디바이스 A(1710)는 1802 동작에서 어플리케이션 실행 화면에서 캡쳐된 이미지와 [0191]캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장할 수 있다. 한 실시 예에 따르면 제1 전자디바이스 A(1710)는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 [0192]따르면 메타 데이터는 어플리케이션 실행 화면에 대응된 제목, 어플리케이션 실행 화면으로 복원할 수 있는URL, 어플리케이션 실행 화면에 대응된 텍스트, 어플리케이션 실행 화면에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 어플리케이션 실행 화면에 대응된 드로잉 메모 정보, 어플리케이션 실행 화면에 대응된 필기 인식 결과 정보, 어플리케이션 실행 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 어플리케이션 실행 화면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 어플리케이션 실행 화면과 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 어플리케이션 실행공개특허 10-2015-0022639-26-화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A(1710)는 1804 동작에서 사용자 입력에 의한 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 [0193]경로 정보를 포함하는 데이터의 공유 요청을 수신할 수 있다. 만약 사용자로부터 데이터 공유 요청이 수신되면 제1 전자 디바이스 A(1710)는 1806 동작에서 데이터 공유 방식 [0194]을 선택할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A(1710)는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 원본 그대로 공유할 것인지 캡쳐된 이미지와 캡쳐된 이미지에 대응된실행 경로 정보를 포함하는 데이터를 일정한 데이터 형식으로 변환하여 공유할 것인지 판단할 수 있다. 한 실시예에 따르면 원본 그대로 공유하는 경우 캡쳐된 이미지 원본(예컨대 PNG 형식의 이미지 또는 JPG 형식의이미지)과 텍스트 형태의 캡쳐된 이미지에 대응된 실행 경로 정보를 공유할 수 있다. 또한 데이터를 일정한 형식으로 변환하여 공유하는 경우 캡쳐된 이미지 원본(예컨대 PNG 형식의 이미지 또는 JPG 형식의 이미지)과 캡쳐된 이미지에 대응된 실행 경로 정보를 한 개의 파일 예컨대 스크랩 데이터(SCC) 파일로 변환하여 공유할 수 있다.제1 전자 디바이스 A(1710)는 1808 동작에서 데이터 전송 방식을 선택할 수 있다. 한 실시 예에 따르면 제1 전 [0195]자 디바이스 A(1710)는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 복수의데이터 전송 방식 중 어떤 데이터 전송 방식을 통해 전송할 것인지 사용자로부터 선택받을 수 있다. 한 실시 예에 따르면 데이터 전송 방식은 이메일 전송 방식, 메시지 전송 방식(SMS, MMS 등), 채팅 메시지 전송 방식(Chaton), WIFI direct 전송 방식 등 다양한 전송 방식 중 적어도 하나일 수 있다. 이 외에도 데이터를 전송할 수 있는 방식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스 A(1710)는 1810 동작에서 상기 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 [0196]포함하는 데이터를 제2 전자 디바이스 B(1720)로 전송할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스A(1710)는 선택된 데이터 공유 방식과 선택된 데이터 전송 방식으로 캡쳐된 이미지와 캡쳐된 이미지에 대응된실행 경로 정보를 포함하는 데이터를 제2 전자 디바이스 B(1720)로 전송할 수 있다. 제2 전자 디바이스 B(1720)는 1812 동작에서 제1 전자 디바이스 A(1710)로부터 캡쳐된 이미지와 캡쳐된 이미지 [0197]에 대응된 실행 경로 정보를 포함하는 데이터를 수신하여 저장함으로써, 제1 전자 디바이스 A(1710)와 캡쳐된이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 공유할 수 있다.본 발명의 다양한 실시 예에 따르면 전자 디바이스(100)는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 [0198]정보를 공유하기 위해 다양한 사용자 인터페이스 화면을 제공할 수 있다.도 19 내지 도 22는 본 발명의 실시 예에 따른 전자 디바이스에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실 [0199]행 경로 정보를 공유하기 위한 사용자 인터페이스 화면을 나타낸 도면이다.도 19를 참조하면, 전자 디바이스(100)는 도 19의 (a)에 도시된 바와 같이 스크랩북 어플리케이션 실행 화면 [0200](1910)에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터(이하 ‘스크랩 데이터’라고도 함)들(1912)을 표시할 수 있다. 사용자는 스크랩북 어플리케이션 실행 화면(1910)에 표시된 스크랩 데이터들(1912) 중 공유하기를 원하는 스크랩 데이터(1914)를 선택할 수 있다.전자 디바이스(100)는 사용자에 의해 공유하고자 하는 스크랩 데이터가 선택되면 도 19의 (b)에 도시된 바와 같 [0201]이 선택된 스크랩 데이터의 캡쳐된 이미지(1924)와 캡쳐된 이미지에 대응된 실행 경로 정보(1922)를 나타내는스크랩 데이터 화면(1920)을 표시할 수 있다. 스크랩 데이터 화면(1920)에는 스크랩 데이터에 태그 정보를 추가할 수 있는 입력란(1926)이 더 표시될 수 있고, 스크랩 데이터를 공유 요청할 수 있는 공유 아이콘(1928)이 더표시될 수 있다.전자 디바이스(100)는 사용자에 의해 공유 아이콘(1920)이 선택되면 도 19의 (c)에 도시된 바와 같이 스크랩 데 [0202]이터를 어떤 파일 형식으로 공유할지 선택할 수 있는 파일 형식 선택 윈도우(1930)를 표시할 수 있다. 파일 형식 선택 윈도우(1930)에는 이미지 및 텍스트로 이루어진 파일 형식(1932)과 스크랩북 데이터(SCC) 형식(1934)등과 같은 파일 형식이 포함될 수 있다. 사용자는 파일 형식 선택 윈도우(1930)에서 스크랩 데이터의 파일 형식을선택할 수 있다.도 20을 참조하면, 전자 디바이스(100)는 도 20의 (a)와 같은 파일 형식 선택 윈도우(2010)에서 사용자에 의해 [0203]이미지 및 텍스트로 이루어진 파일 형식(2012)을 선택받을 수 있다. 전자 디바이스(100)는 이미지 및 텍스트로이루어진 파일 형식(2012)이 선택되면 전자 디바이스(100)는 도 20의 (b)에 도시된 바와 같이 스크랩 데이터 전공개특허 10-2015-0022639-27-송 방식을 선택할 수 있는 전송 방식 선택 윈도우(2020)를 표시할 수 있다. 전송 방식 선택 윈도우(2020)에는이메일 전송 방식, 메시지 전송 방식(SMS, MMS 등), 채팅 메시지 전송 방식(Chat on), WIFI direct 전송 방식등 다양한 전송 방식에 해당하는 아이콘들이 표시될 수 있다. 사용자는 전송 방식 선택 윈도우(2020)에서 스크랩 데이터의 전송 방식을 선택할 수 있다. 전자 디바이스(100)는 다양한 전송 방식 중 메시지 전송 방식(2022)이 선택되면 도 20의 (c)에 도시된 바와 같이 메시지 전송 어플리케이션을 실행하고 메시지 전송 어플리케이션화면(2030)을 표시할 수 있다. 전자 디바이스(100)는 메시지 전송 어플리케이션 화면(2030)에서 스크랩 데이터를 메시지 전송 어플리케이션 화면(2030)의 첨부파일 영역(2034)에 포함시키고, 메시지 작성 영역(2032)에 사용자의 메시지를 입력받아 스크랩 데이터를 공유할 공유 대상 전자 디바이스에게 메시지 전송 방식으로 전송할 수있다.한편, 도 21을 참조하면, 전자 디바이스(100)는 도 21의 (a)와 같은 파일 형식 선택 윈도우(2110)에서 사용자에 [0204]의해 스크랩북 데이터(SCC) 형식(2014)을 선택받을 수 있다. 전자 디바이스(100)는 스크랩북 데이터(SCC) 형식(2014) 이 선택되면 전자 디바이스(100)는 도 21의 (b)에 도시된 바와 같이 스크랩 데이터 전송 방식을 선택할수 있는 전송 방식 선택 윈도우(2120)를 표시할 수 있다. 전송 방식 선택 윈도우(2120)에는 이메일 전송 방식,메시지 전송 방식(SMS, MMS 등), 채팅 메시지 전송 방식(Chat on), WIFI direct 전송 방식 등 다양한 전송 방식에 해당하는 아이콘들이 표시될 수 있다. 사용자는 전송 방식 선택 윈도우(2120)에서 스크랩 데이터의 전송방식을 선택할 수 있다. 전자 디바이스(100)는 다양한 전송 방식 중 메일 전송 방식(2122)이 선택되면 도 21의(c)에 도시된 바와 같이 메일 전송 어플리케이션을 실행하고 메일 전송 어플리케이션 화면(2130)을 표시할 수있다. 전자 디바이스(100)는 메일 전송 어플리케이션 화면(2130)에서 스크랩 데이터를 메일 전송 어플리케이션화면(2130)의 첨부파일 영역(2132)에 포함시키고, 메일 내용 작성 영역(2134)에 사용자로부터 메일 내용을 입력받아 스크랩 데이터를 공유할 공유 대상 전자 디바이스에게 메일 전송 방식으로 전송할 수 있다.도 22를 참조하면, 전자 디바이스(100)는 다른 전자 디바이스로부터 스크랩 데이터를 다양한 전송 방식으로 수 [0205]신받아 저장함으로써 공유할 수 있다. 한 실시 예에 따르면 전자 디바이스(100)는 메일 전송 방식을 통해 스크랩 데이터를 수신하는 경우 도 22의 (a)와 같이 메일 수신 화면(2210)에서 첨부 파일에 포함된 스크랩 데이터(2212)를 저장 버튼(2214)를 선택하여 저장할 수 있다. 전자 디바이스(100)는 스크랩 데이터 저장 버튼(2214)이선택되면 도 22의 (b)와 같이 데이터 저장 화면(2220)을 통해 스크랩 데이터(2222)를 저장할 수 있다. 전자 디바이스(100)는 저장된 스크랩 데이터(2222)가 선택되면 도 22의 (c)에 도시된 바와 같이 스크랩 데이터를 어느카테고리에 저장할지 선택할 수 있는 카테고리 선택화면(2230)을 표시할 수 있다. 전자 디바이스(100)는 카테고리 선택화면(2230)에서 사용자에 의해 카테고리(2232)(예컨대 ‘New’)가 선택되면 도 22의 (d)에 도시된 바와같이 ‘New’카테고리에 스크랩 데이터(2242)를 저장함으로써 송신측과 스크랩 데이터(2242)를 공유할 수 있다.한 실시 예에 따르면 스크랩 데이터는 SCC 파일일 수 있다. [0206]도 23은 본 발명의 실시 예에 따른 SCC 파일 구조를 나타낸 도면이다. 도 23을 참조하면, SCC 파일은 “ [0207]fileName.SCC “(2310)와 같은 파일일 수 있다. SCC 파일은 Mimetype(2312), appname(2314),appicon.png(2316), thumbnail.png(2318), META-INF(2320), CONTENTS(2330), HTML(2340)을 포함할 수 있다.Mimetype(2312)은 어플별 이름을 나타내는 정보일 수 있다. 예를 들면, application/vnd.samsung.SCC.을 [0208]Prefix로 하여 App별 이름을 그 뒤에 붙인 정보로서 “Scrapbook : application/vnd.samsung.SCC.pinall”일수 있다.appname(2314)은 확장자 없는 텍스트 파일로서 스크랩 데이터에 대응된 어플리케이션 이름일 수 있다. 통합 뷰 [0209]어에서 어플리케이션 이름이 표시될 수 있다.appicon.png(2316)는 스크랩 데이터에 대응된 어플리케이션의 아이콘 파일일 수 있다. 통합 뷰어에서 해당 아이 [0210]콘이 표시될 수 있다.thumbnail.png(2318)는 스크랩 데이터의 썸네일 이미지일 수 있다. Png 파일 외에 jpg 파일일 수도 있다. [0211]META-INF(2320)는 메타 데이터들이 저장된 위치로서 메타 데이터를 포함할 수 있다. 메타 데이터들이 저장된 위 [0212]치 정보가 해당 어플리케이션에 제공될 수 있다. 메타 데이터의 형식은 XML, JSON 파일들로 구성될 수 있다. 각XML, JSON파일 구성 및 파일 내의 형식은 각 어플리케이션에서 정의될 수 있다. CONTENTS(2330)는 원본 멀티미디어 파일들이 저장된 위치로서, 예를 들면, Image, Audio, Video파일의 원본 파 [0213]일들이 HTML 파일에서 상대경로를 통해 링크될 수 있다.공개특허 10-2015-0022639-28-HTML(2340)은 통합 뷰어에서 화면을 구성할 수 있도록 HTML파일 및 HTML파일에서 사용하는 리소스(font, css, [0214]js)들일 수 있다. HTML 폴더에는 필수 파일인 index.html이 포함될 수 있으며, 그외에 추가로 필요한 html파일들도 저장될 수 있다. HTML은 HTML5 규약을 준수할 수 있고, CSS 규약을 준수할 수 있다. 또한 HTML은JavaScript를 지원할 수 있다. 도 24는 본 발명의 실시 예에 따른 SCC 파일에 포함된 META-INF(2320)를 나타낸 도면이다. 도 24를 참조하면, [0215]META-INF(2320)는 JSON 파일 구조로 이루어질 수 있다. META-INF(2320)는 카테고리 이름(2402), 컨텐츠 시작(스크랩 데이터 시작)(2404), 컨텐츠 타입(스크랩 데이터 타입)(2406), 썸네일 이미지 경로(2408), 캡쳐된 이미지 경로(2410), 캡쳐된 이미지 width(2412), 캡쳐된 이미지의 height(2414), 이미지가 캡쳐된 시간(2416), 캡쳐된 이미지 크롭 방식(2418)(예컨대 0:자유 곡선, 1: 정사각형, 2:자유 곡선 중 자동보정, 3. 스크랩부커에 의한 크롭 등), 메타 데이터(2420)를 포함할 수 있다. 도 25는 본 발명의 실시 예에 따른 메타 데이터를 나타낸 도면이다. 도 26을 참조하면, 메타 데이터는 meta [0216]key(2510), meta value(2520), meta value type(2530)으로 구분될 수 있다. meta key(2510)는 메타 데이터의종류를 나타내는 key일 수 있다. meta value(2520)는 각 메타 데이터의 종류를 나타내는 key에 해당하는 값일수 있다. meta value type(2530)은 메타 데이터의 종류를 나타내는 key의 데이터 타입일 수 있다. 한 실시 예에따르면 메타 데이터의 종류를 나타내는 key는 title, plain_text, app_deep_link, url, file_path_audio,file_path_video, file_path_image, file_path_drawing_memo, file_path_spd, dm_hand_write_text, location을 포함할 수 있다. Title은 캡쳐된 이미지에 대응된 어플리케이션 실행 화면에 대응된 제목일 수 있다. plain_text는 캡쳐된 이미 [0217]지에 대응된 텍스트일 수 있다. app_deep_link는 캡쳐된 이미지에 대응된 어플리케이션 실행 화면으로 복원할수 있는 URL일 수 있다. url은 캡쳐된 이미지에서 획득된 url 정보일 수 있다, file_path_audio,file_path_video 및 file_path_image는 캡쳐된 이미지에 대응된 어플리케이션 실행 화면과 관련된 원본 데이터파일(음악 파일, 비디오 파일 또는 이미지 파일)의 경로 일 수 있다. file_path_drawing_memo는 캡쳐된 이미지에 대응된 드로잉 메모 정보일 수 있다. file_path_spd은 드로잉 메모 경로 정보일 수 있다.dm_hand_write_text는 캡쳐된 이미지에 대응된 필기 인식 결과 정보일 수 있다. Location은 캡쳐된 이미지에 대응된 클립 위치 정보일 수 있다. 전술한 바와 같은 본 발명의 다양한 실시 예들에 따르면 사용자의 전자 디바이스에서 캡쳐된 화면 이미지와 화 [0218]면 캡쳐 시의 화면을 실행시킬 수 있는 실행 경로 정보를 동일 사용자의 다른 전자 디바이스 또는 다른 사용자의 전자 디바이스와 공유하여 동일 사용자의 다른 전자 디바이스 또는 다른 사용자의 전자 디바이스에서도 캡쳐된 화면 이미지를 이용하여 화면 캡쳐 시의 화면을 실행시킬 수 있도록 할 수 있다.본 발명의 다양한 실시예에따른 방법들은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고구성된 것들이거나 컴퓨터 소프트웨어 분야에서 통상의 지식을 가진 자에게 공지되어 사용 가능한 것일 수도 있다. 본 발명의 실시예에 따른 캡쳐 이미지 이용 방법은 하드웨어, 소프트웨어 또는 하드웨어 및 소프트웨어의 조합 [0219]의 형태로 실현 가능하다는 것을 알 수 있을 것이다. 이러한 임의의 소프트웨어는 예를 들어, 삭제 가능 또는재기록 가능 여부와 상관없이, ROM 등의 저장 장치와 같은 휘발성 또는 비휘발성 저장 장치, 또는 예를 들어,RAM, 메모리 칩, 장치 또는 집적 회로와 같은 메모리, 또는 예를 들어 CD, DVD, 자기 디스크 또는 자기 테이프등과 같은 광학 또는 자기적으로 기록 가능함과 동시에 기계(예를 들어, 컴퓨터)로 읽을 수 있는 저장 매체에저장될 수 있다. 본 발명의 실시 예에 따른 캡쳐 이미지 이용 방법은 제어부 및 메모리를 포함하는 컴퓨터 또는전자 디바이스에 의해 구현될 수 있고, 상기 메모리는 본 발명의 실시 예들을 구현하는 지시들을 포함하는 프로그램 또는 프로그램들을 저장하기에 적합한 기계로 읽을 수 있는 저장 매체의 한 예임을 알 수 있을 것이다. 따라서, 본 발명의 실시 예들은 본 명세서의 임의의 청구항에 기재된 장치 또는 방법을 구현하기 위한 코드를 포함하는 프로그램 및 이러한 프로그램을 저장하는 기계(컴퓨터 등)로 읽을 수 있는 저장 매체를 포함한다. 또한,이러한 프로그램은 유선 또는 무선 연결을 통해 전달되는 통신 신호와 같은 임의의 매체를 통해 전자적으로 이송될 수 있고, 본 발명은 이와 균등한 것을 적절하게 포함한다.또한, 본 발명의 실시예들에 따른 전자 디바이스는 유선 또는 무선으로 연결되는 프로그램 제공 장치로부터 상 [0220]기 프로그램을 수신하여 저장할 수 있다. 상기 프로그램 제공 장치는 상기 본 발명의 다양한 실시 예들에 따른공개특허 10-2015-0022639-29-캡쳐 이미지 이용에 따른 방법을 수행하도록 하는 지시들을 포함하는 프로그램을 저장하기 위한 메모리와, 상기전자 디바이스와 유선 또는 무선 통신을 수행하기 위한 통신부와, 상기 전자 디바이스의 요청 또는 자동으로 해당 프로그램을 상기 통신부를 통하여 전송되도록 제어하는 제어부를 포함할 수 있다.도면도면1도면2공개특허 10-2015-0022639-30-도면3도면4도면5공개특허 10-2015-0022639-31-도면6도면7공개특허 10-2015-0022639-32-도면8a공개특허 10-2015-0022639-33-도면8b공개특허 10-2015-0022639-34-도면9공개특허 10-2015-0022639-35-도면10공개특허 10-2015-0022639-36-도면11도면12공개특허 10-2015-0022639-37-도면13도면14도면15공개특허 10-2015-0022639-38-도면16도면17공개특허 10-2015-0022639-39-도면18공개특허 10-2015-0022639-40-도면19공개특허 10-2015-0022639-41-도면20공개특허 10-2015-0022639-42-도면21공개특허 10-2015-0022639-43-도면22공개특허 10-2015-0022639-44-도면23도면24공개특허 10-2015-0022639-45-도면25공개특허 10-2015-0022639-46-"}
{"patent_id": "10-2014-0049459", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 디바이스 및 전자 디바이스에서 캡쳐 화면 이용 방법과 관련된 다양한 실시예들이 기술된 바, 한 실시예에 따르면, 전자 디바이스에 있어서, 어플리케이션 화면을 표시하는 표시부, 상기 어플리케이션 실행 화면이 캡쳐되 면, 캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하고, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 제어부를 포함할 수 있다. 이외에도 다양한 다른 실시예들이 가능하다."}
{"patent_id": "10-2014-0049459", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 디바이스 및 전자 디바이스에서 캡쳐된 이미지를 이용하는 기술에 관한 것 이다."}
{"patent_id": "10-2014-0049459", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 전자 디바이스는 개인이 휴대하고 다닐 수 있도록 휴대 단말로 개발되고 있는 경우가 많으며, 전자 디바이 스의 기능이 다양화되고 있다. 이에 따라 전자 디바이스에는 사용자의 편의를 위한 각종 기능들이 내장되고 있으며, 전자 디바이스는 각종 기 능들 별로 해당 사용자 조작에 따라 각 기능들을 활성화하여 해당 기능이 실행될 수 있다. 예를 들면, 전자 디바이스는 캡쳐 기능을 내장하고 있는 경우, 캡쳐 기능을 이용하여 전자 디바이스에서 표시되 는 다양한 화면을 캡쳐하고, 캡쳐된 이미지를 저장할 수 있다."}
{"patent_id": "10-2014-0049459", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2014-0049459", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그런데 종래 화면 캡쳐 기능은 캡쳐된 이미지를 단순히 이미지로만 저장될 뿐, 캡쳐된 이미지를 이용하는 방법 은 다양하지 못한 문제점이 있다. 예를 들면, 캡쳐된 이미지는 복사되거나, 붙여넣기하는데 이용되거나, 캡쳐된 이미지 내에 오브젝트를 이용하는 등과 같이 단순히 이미지 처리에만 이용되는 한계가 있다. 따라서 본 발명의 다양한 실시 예들에 따르면 캡쳐 이미지를 다양한 방식으로 이용할 수 있는 전자 디바이스 및 전자 디바이스에서 캡쳐 이미지 이용 방법을 제공할 수 있다. 또한 본 발명의 다양한 실시 예들에 따르면 캡쳐된 화면 이미지 저장 시, 화면 캡쳐 시의 화면을 실행시킬 수 있는 실행 경로 정보를 함께 저장하여, 추후 캡쳐된 화면 이미지를 이용하여 화면 캡쳐 시의 화면을 실행시킬 수 있는 전자 디바이스 및 전자 디바이스에서 캡쳐 이미지 이용 방법을 제공할 수 있다. 또한 본 발명의 다양한 실시 예들에 따르면 사용자의 전자 장치에서 캡쳐된 화면 이미지와 화면 캡쳐 시의 화면 을 실행시킬 수 있는 실행 경로 정보를 동일 사용자의 다른 전자 장치 또는 다른 사용자의 전자 장치와 공유하 여 동일 사용자의 다른 전자 장치 또는 다른 사용자의 전자 장치에서도 캡쳐된 화면 이미지를 이용하여 화면 캡 쳐 시의 화면을 실행시킬 수 있는 전자 디바이스 및 전자 디바이스에서 캡쳐 이미지 이용 방법을 제공할 수 있 다."}
{"patent_id": "10-2014-0049459", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따르면 전자 디바이스에 있어서, 어플리케이션 화면을 표시하는 표시부, 상기 어플리케이 션 실행 화면이 캡쳐되면, 캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하고, 상기 캡쳐 된 화면 이미지와 상기 실행 경로 정보를 저장하는 제어부를 포함할 수 있다. 또한 본 발명의 실시 예에 따르면, 전자 디바이스에서 캡쳐 화면 이용 방법에 있어서, 어플리케이션 실행 화면 을 캡쳐하는 과정과, 상기 캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하는 과정과, 상 기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 과정을 포함할 수 있다. 또한 본 발명의 실시 예에 따르면, 캡쳐 화면 이용 프로그램을 저장하는 저장매체에 있어서, 상기 프로그램은 전자 디바이스의 제어부에서, 어플리케이션 실행 화면을 캡쳐하는 과정과, 캡쳐된 화면 이미지의 상태를 실행할 수 있는 실행 경로 정보를 획득하는 과정과, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 저장하는 과정 과, 상기 캡쳐된 화면 이미지와 상기 실행 경로 정보를 공유하기 위해 상기 캡쳐된 화면 이미지와 상기 실행 경 로 정보를 전송하는 과정을 수행하게 하는 명령어를 포함할 수 있다. 또한 본 발명의 실시 예에 따르면, 데이터 공유 서버에 있어서, 제1 전자 디바이스부터 업로드된 캡쳐된 이미지 와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고, 상기 데이터가 업로드되면 상기 제1 전자 디바이스와 동일 계정으로 접속 가능한 제2 전자 디바이스에 상기 저장된 데이터를 전송하는 제어하는 제어부를 포함할 수 있다. 또한 본 발명의 실시 예에 따르면, 데이터 공유 서버에 있어서, 제1 전자 디바이스부터 업로드된, 캡쳐된 이미 지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고, 상기 데이터가 업로드되면 업로드된 데이터의 URL을 상기 제1 전자 디바이스에 전송하고, 상기 제1 전자 디바이스로부터 상기 데이터의 URL을 수신받은 제2 전자 디바이스로부터 상기 업로드된 데이터의 URL을 이용한 데이터 요청을 수신받 으면, 상기 업로드된 데이터를 상기 제2 전자 디바이스에 전송하도록 제어하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2014-0049459", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에 따르면 사용자가 어플리케이션 실행에 따른 화면을 보다가 화면을 캡쳐하면, 캡 쳐된 화면의 전체 이미지 또는 적어도 일부분과 캡쳐된 화면의 상태를 실행시킬 수 있는 실행 경로 정보를 함께 저장함으로써, 사용자가 캡쳐된 화면을 이용하여 캡쳐된 화면의 상태를 실행시킬 수 있는 효과가 있다. 예를 들어 저장된 웹 페이지 화면의 전체 또는 적어도 일부 이미지를 선택하면, 해당 웹 페이지 화면의 상태를 실행시킬 수 있으므로, 사용자는 해당 웹 페이지 화면의 상태를 실행시키기 위해 웹 브라우저를 실행시키고, 웹 브라우저 상에 웹 페이지 주소를 입력 하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 또한 저장된 음악 재생 화면의 전체 또는 적어도 일부 이미지를 선택하면, 해당 음악 재생 화면의 상태를 실행시킬 수 있으므로, 사용자는 해당 음악 재생 화면의 상태를 실행시키기 위해 음악 재생 어플리케이션을 실행시키고,음악 재생 어플리케이션에서 재생할 음악을 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있 다. 또한 저장된 클립 화면 이미지의 전체 또는 적어도 일부 이미지를 선택하면, 해당 클립 화면의 상태를 실행 시킬 수 있으므로, 사용자는 클립 화면을 표시하기 위해 클립 어플리케이션을 실행 시키고, 클립 어플리케이션 에서 표시할 클립 화면을 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 또한 본 발명의 다양한 실시 예들에 따르면 사용자의 전자 디바이스에서 캡쳐된 화면 이미지와 화면 캡쳐 시의 화면을 실행시킬 수 있는 실행 경로 정보를 동일 사용자의 다른 전자 장치 또는 다른 사용자의 전자 장치와 공 유하여 동일 사용자의 다른 전자 장치 또는 다른 사용자의 전자 장치에서도 캡쳐된 화면 이미지를 이용하여 화 면 캡쳐 시의 화면을 실행시킬 수 있게 할 수 있다."}
{"patent_id": "10-2014-0049459", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에서 사용되는 용어에 대해 간략히 설명하고, 본 발명의 다양한 실시 예들에 대해 구체적으로 설명하기로 한다. 본 발명의 다양한 실시 예들에서 사용되는 용어는 본 발명의 다양한 실시 예들에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로 운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경 우 해당되는 발명의 다양한 실시 예들의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 발명의 다 양한 실시 예들에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 발명의 다양한 실시 예들의 전반에 걸친 내용을 토대로 정의되어야 한다. 발명의 다양한 실시 예들에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 발명의 다양한 실시 예들에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미 하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 이하, 첨부된 도면들에 기재된 내용들을 참조하여 본 발명에 따른 다양한 실시예들을 상세하게 설명한다. 다만, 본 발명이 다양한 실시 예들에 의해 제한되거나 한정되는 것은 아니다. 각 도면에 제시된 동일한 참조부호는 실 질적으로 동일한 기능을 수행하는 부재를 나타낼 수 있다. 본 개시의 다양한 실시예 가운데 사용될 수 있는\"포함한다\" 또는 \"포함할 수 있다\" 등의 표현은 개시된 해당 기 능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 개시의 다양한 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 다양한 실시예에서 \"또는\" 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한다. 예를 들어, \"A 또는 B\"는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 개시의 다양한 실시예 가운데 \"제 1\", \"제2\", \"첫째,\"또는\"둘째,\"등의 표현들이 본 개시의 다양한 구성요소 들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순 서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분 짓기 위해 사용 될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기 를 나타낸다. 예를 들어, 본 개시의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성 요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 개시의 다양한 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 개시의 다 양한 실시예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현 을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 개시의 다양한 실시예에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 개시의 다양한 실시예에 따른 전자 디바이스(이하 ‘전자 장치’라고도 함)는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿PC(tablet personal computer), 이동전화기 (mobile phone), 화상전화기, 전자북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치 (wearable device)(예: 전자 안경과 같은 head mounted device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전 자 앱세서리(appcessory), 전자 문신, 또는 스마트 와치(smartwatCh))중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 방송 채널 수신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set top box), TV 박스 (예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 방송 채널 수신 기능을 포함한 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박 용 항법 장치 및 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 또는 산업용 또는 가정용 로봇 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 방송 채널 수신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터 (projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 개시의 다양한 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하 다. 이하, 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되 는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 실시 예에 따른 전자 디바이스의 블록 구성도이다. 도 1을 참조하면, 전자 디바이스 는 제어부, 통신부, 저장부, 터치 스크린, 입출력부를 포함할 수 있다. 제어부는 CPU(Central Processor Unit)일 수 있다. 제어부는 DSP(Digital Signal Processor)를 포함 할 수 있으며, 전자 디바이스 의 제어를 위한 제어프로그램이 저장된 롬(ROM)(미도시) 및 전자 디바이스 의 외부로부터 입력되는 신호 또는 데이터를 기억하거나, 전자 디바이스에서 수행되는 작업을 위한 기억영역으로 사용되는 램(RAM)(미도시)을 포함할 수 있다. CPU는 싱글 코어, 듀얼 코어, 트리플 코어, 또는 쿼드 코어를 포함할 수 있다. CPU, 롬 및 램은 내부버스(bus)를 통해 상호 연결될 수 있다. 제어부는 통신부, 저장부, 터치 스크린, 입출력부를 제어할 수 있다. 즉, 제어부 는 전자 디바이스에 대한 전반적인 제어 기능을 수행하며, 상기 각 구성부들 간 신호 흐름을 제어할 수 있다. 예컨대 제어부는 본 발명의 실시 예에 따라 어플리케이션 수행에 따른 어플리케이션 화면을 터치 스크린 에 표시하도록 제어할 수 있다. 제어부는 터치 스크린에 표시되는 어플리케이션 화면에 대한 화 면 캡쳐를 수행할 수 있다. 예컨대 제어부는 어플리케이션 실행 중 어플리케이션 실행에 따른 어플리케이 션 화면들을 계속해서 터치 스크린에 표시되도록 할 수 있으며, 어플리케이션 화면들 중, 캡쳐 요청된 어 플리케이션 화면을 캡쳐할 수 있다. 또한 제어부는 캡쳐된 화면에 해당하는 실행 경로 정보를 획득할 수 있으며, 캡쳐된 화면에 해당하는 실행 경로 정보는 캡쳐된 화면의 상태를 실행할 수 있는 정보를 포함할 수 있 다. 예를 들면, 제어부는 어플리케이션 프레임워크와 어플리케이션을 포함하고, 어플리케이션 프레임워크 또는 어플리케이션을 통해 획득한 실행 경로 정보를 이용하여 해당 어플리케이션을 실행하고, 어플리케이션 실행에 따른 화면들을 표시할 수 있으며, 캡쳐된 어플리케이션 화면에 해당하는 실행 경로 정보를 획득할 수 있다. 또 한 제어부는 캡쳐된 화면의 전체 또는 캡쳐된 화면에서 선택된 일부분의 이미지와 함께 캡쳐된 화면에 해 당하는 실행 경로 정보를 저장할 수 있다. 제어부는 저장된 이미지가 선택되면 선택된 이미지에 해당하는 실행 경로 정보를 검출하고, 실행 경로 정보를 이용하여 선택된 이미지에 해당하는 프로세스를 실행할 수 있다. 통신부는 전자 디바이스가 외부장치(도시되지 아니함)와 연결되도록 할 수 있다. “외부장치”는 다 른 장치(도시되지 아니함), 휴대폰(도시되지 아니함), 스마트폰(도시되지 아니함), 태블릿PC(도시되지 아니함) 및 서버(도시되지 아니함)를 포함할 수 있다. 또한 통신부는 제어부의 제어에 따라 적어도 하나 또는 복수의 안테나(도시되지 아니함)를 이용하여 이동 통신을 통해 전자 디바이스가 외부 장치와 연결되도록 할 수 있다. 통신부는 전자 디바이스에 입력되는 전화번호를 가지는 휴대폰(도시되지 아니함), 스마 트폰(도시되지 아니함), 태블릿PC 또는 다른 장치(도시되지 아니함)와 음성 통화, 화상 통화, 문자메시지(SMS) 또는 멀티미디어 메시지(MMS)를 위한 무선 신호를 송/수신할 수 있다. 통신부는 무선랜 모듈(미도시)과 근 거리통신 모듈(미도시) 중 적어도 하나를 더 포함할 수 있다. 무선랜 모듈은 제어부의 제어에 따라 무선 AP(access point)(도시되지 아니함)가 설치된 장소에서 인터넷에 연결될 수 있다. 무선랜 모듈은 미국전기전자 학회(IEEE)의 무선랜 규격(IEEE802.11x)을 지원할 수 있다. 근거리통신 모듈은 제어부의 제어에 따라 전자 디바이스과 화상형성장치(도시되지 아니함) 사이에 무선으로 근거리 통신을 할 수 있다. 근거리 통신방식 은 블루투스(bluetooth), 적외선 통신(IrDA, infrared data association) 등이 포함될 수 있다. 저장부는 제어부의 제어에 따라 통신부, 터치스크린, 입출력부 의 동작에 대응되게 입/출력되는 신호 또는 데이터를 저장할 수 있다. 저장부는 전자 디바이스 또는 제어부의 제어 를 위한 복수의 프로그램 및 복수의 애플리케이션들과 각종 기능들을 실행하기 위한 프로그램 및 데이터를 저장 할 수 있다. 또한 저장부는 본 발명의 실시 예에 따른 캡쳐 화면, 캡쳐된 화면의 적어도 일부분의 이미지 를 저장할 수 있고, 본 발명에서 언급되는 캡쳐 이미지를 이용하기 위한 프로그램을 저장할 수 있다. 이러한, 저장부라는 용어는 제어부내 롬(ROM)(미도시), 램(RAM)(미도시) 또는 단말에 장착되는 메모 리 카드(미도시)(예, SD 카드, 메모리 스틱)를 포함할 수 있다. 저장부는 비휘발성 메모리, 휘발성 메모리, 하드 디스크 드라이브(HDD)또는 솔리드 스테이트 드라이브(SSD)를 포함할 수 있다. 저장부는 기계(예를 들어, 컴퓨터)로 읽을 수 있는 매체일 수 있으며, 기계로 읽을 수 있는 매체라는 용어 는 기계가 특정 기능을 수행할 수 있도록 상기 기계로 데이터를 제공하는 매체로 정의될 수 있다. 기계로 읽을 수 있는 매체는 저장 매체일 수 있다. 상기 저장부는 비휘발성 매체(non-volatile media) 및 휘발성 매체 를 포함할 수 있다. 이러한 모든 매체는 상기 매체에 의해 전달되는 명령들이 상기 명령들을 상기 기계로 읽어 들이는 물리적 기구에 의해 검출될 수 있도록 유형의 것이어야 한다. 상기 기계로 읽을 수 있는 매체는, 이에 한정되지 않지만, 플로피 디스크(floppy disk), 플렉서블 디스크(flexible disk), 하드 디스크, 자기 테이프, 시디롬(compact disc read only memory: CD ROM), 광학 디스크, 펀치 카드(punch card), 페이퍼 테이프(paper tape), 램(RAM), 피롬(Programmable Read Only Memory: PROM), 이피롬(Erasable PROM: EPROM) 및 플래시 이피 롬(FLASH EPROM) 중의 적어도 하나를 포함할 수 있다. 입출력부는 버튼, 마이크, 스피커, 입력 유닛을 포함할 수 있다. 그리고, 이러한 입 출력부는 이에 국한되지 않으며, 마우스, 트랙볼, 조이스틱 또는 커서 방향 키들과 같은 커서 컨트롤 (cursor control)이 제어부와의 통신 및 상기 터치 스크린 상의 커서 움직임 제어를 위해 제공될 수 있다. 마이크는 제어부의 제어에 따라 각종 음원에 의한 음성(voice) 또는 각종 소리(sound)를 입력 받아 전기적인 신호를 생성할 수 있다. 스피커는 제어부의 제어에 따라 통신부 또는 어플리케이션 실행에 의한 다양한 신호(예, 무선신 호, 방송신호, 디지털 오디오 파일, 디지털 동영상 파일 등)에 대응되는 소리를 전자 디바이스 외부로 출 력할 수 있다. 입력 유닛은 전자 디바이스 내부에 삽입되어 보관되거나 별도로 구성된 디바이스 또는 물체일 수 있 으며, 내부에 삽입되어 보관되는 경우 상기 전자 디바이스로부터 인출 또는 탈착될 수 있다. 입력 유닛 은 스타일러스 펜(이하 ‘펜’이라 함)등과 같이 터치스크린에 근접 또는 터치 등의 입력이 가능한 입력 수단이거나, 사용자 손가락 등이 될 수 있다. 터치 스크린은 ‘표시부’일 수 있으며, 사용자에게 다양한 어플리케이션 수행 시 그래픽 유저 인터페이스 를 제공할 수 있다. 예를 들면 터치 스크린은 사용자의 신체(예, 엄지를 포함하는 손가락) 또는 터치 가능 한 입력 유닛 예컨대 펜을 통해 적어도 하나의 근접 또는 터치 등의 각종 제스쳐 입력을 수신할 수 있다. 이러한, 터치 스크린은 예를 들어, 저항막(resistive) 방식, 정전용량(capacitive) 방식, 적외선 (infrared) 방식 또는 초음파(acoustic wave) 방식으로 구현될 수 있다. 상기한 바와 같은 터치스크린은 본 발명의 실시 예에 따라 제어부의 제어 하에 어플리케이션 실행에 따른 화면들 및 캡쳐된 화면들을 표시 할 수 있고, 캡쳐된 화면의 적어도 일부분을 표시할 수 있다. 도 2는 본 발명의 실시 예에 따른 전자 디바이스의 캡쳐 이미지 이용 동작을 나타낸 흐름도이다. 도 2를 참조하면, 전자 디바이스는 210 과정에서 어플리케이션 화면을 캡쳐할 수 있다. 예를 들면, 전자 디바이스는 어플리케이션 실행 중 사용자로부터 화면 캡쳐 요청에 따라 현재 표시되고 있 는 어플리케이션 화면을 캡쳐할 수 있다. 구체적으로, 전자 디바이스는 웹 브라우징 어플리케이션 실행 중 사용자로부터 화면 캡쳐 요청에 따라 현 재 표시되고 있는 웹 페이지 화면을 캡쳐하거나, 음악 재생 어플리케이션 실행중 사용자로부터 화면 캡쳐 요청 에 따라 현재 표시되고 있는 음악 재생 화면을 캡쳐할 수 있다. 또한 클립 어플리케이션 실행 중 사용자로부터 화면 캡쳐 요청에 따라 현재 표시되고 있는 클립 화면을 캡쳐할 수 있다. 전자 디바이스는 220 과정에서 캡쳐된 화면에 해당하는 실행 경로 정보를 획득할 수 있다. 실행 경로 정보 는 캡쳐된 화면의 상태를 실행할 수 있는 정보를 포함할 수 있다. 예를 들면 전자 디바이스는 어플리케이션 프레임워크와 어플리케이션을 이용하여 캡쳐된 어플리케이션 화 면에 해당하는 실행 경로 정보를 획득할 수 있다. 도 3은 본 발명의 실시 예에 따른 어플리케이션 프레임워크와 어플리케이션을 설명하기 위한 도면이다. 도 3을 참조하면, 어플리케이션 프레임워크는 어플리케이션 프로그램 표준 구조를 구현하는 클래스와 라이 브러리 모임일 수 있다. 어플리케이션 프레임워크는 각종 어플리케이션에서 공통적으로 사용될 수 있는 수 많은 공통 클래스 오브젝트와 특정 어플리케이션에서 사용될 수 있는 내부 클래스 오브젝트를 포함할 수 있다. 어플리케이션 프레임워크는 어플리케이션을 실행하고, 어플리케이션 실행에 따른 화면들이 터치스크 린에 표시되도록 할 수 있다. 어플리케이션 프레임 워크는 안드로이드(android) 운영체제 기반의 프 레임워크일 수도 있고, ios 운영체제 기반의 프레임워크일 수도 있다. 본 발명의 실시예에서 언급되지 않은 전 자 디바이스 운영체제 기반의 프레임워크일 수도 있다. 한편, 본 발명의 실시 예에 따르면, 디바이스는 어플리케이션 프레임워크를 통해 캡쳐된 어플리케이 션 화면에 해당하는 실행 경로 정보를 획득하거나, 어플리케이션을 통해 캡쳐된 어플리케이션 화면에 해당 하는 실행 경로 정보를 획득할 수 있다. 도 4는 본 발명의 실시 예에 따라 어플리케이션 프레임워크를 통해 실행 경로 정보를 획득하는 동작을 나 타낸 흐름도이다. 도 4를 참조하면, 어플리케이션 프레임워크는 410 과정에서 어플리케이션 화면이 캡쳐되는지 여부를 판단 할 수 있다. 어플리케이션 실행 중 어플리케이션 화면이 캡쳐되면 어플리케이션 프레임워크는 420 과정에서 수많은 클 래스 오브젝트들 중 캡쳐된 화면에 해당하는 클래스 오브젝트를 판단할 수 있다. 어플리케이션 프레임 워크는 430 과정에서 캡쳐된 화면에 해당하는 클래스 오브젝트에 포함된 정보들을 이 용하여 실행 경로 정보를 획득할 수 있다. 예를 들면, 어플리케이션 프레임 워크는 클래스 오브젝트에 포함된 정보들 중 캡쳐된 화면의 상태를 실행 하는데 필요한 정보를 추출하여 실행 경로 정보를 획득할 수 있다. 도 5는 본 발명의 실시 예에 따른 클래스 오브젝트에 포함 될 수 있는 정보들 중 캡쳐된 화면의 상태를 실행하 는데 필요한 정보의 일 예를 나타낸 도면이다. 도 5를 참조하면, 클래스 오브젝트에 포함 될 수 있는 정보들 중 캡쳐된 화면의 상태를 실행하는데 필요한 정보 들은 URI, String, Boolean, byte(binary), Short, Integer, Float, Double, Date, Time, Class Object 등의 정보를 포함할 수 있다. 이외에도 캡쳐된 화면을 실행할 수 있는 관련 정보라면 어떤 정보든지 가능하다. URI는 캡쳐된 화면이 실행중이었을 때의 화면에 해당하는 URI 정보일 수 있다. String은 캡쳐된 화면이 실행중 이었을 때의 문자열 정보일 수 있다. 예를 들면, String은 전화번호가 표시가 실행 중이었을 때 전화번호 이름, 전화번호 어플리케이션 이름 등을 포함하는 텍스트 정보를 포함할 수 있다. Boolean은 어플리케이션의 판단 변 수 값 정보(true, false)를 포함할 수 있다. Byte(binary) 정보는 이진 데이터 정보일 수 있다. 이진 데이터 정 보는 이미지 파일이나, 텍스트 등 캡쳐된 화면이 실행중이었을 때의 정보를 이진화한 정보일 수 있다. Short는 짧은 길이의 바이트 변수 정보로서 캡쳐된 화면이 실행중이었을 때 작은 범위의 정수 정보를 포함할 수 있다. Integer 는 0~255의 숫자 정보로서 캡쳐된 화면이 실행중이었을 때 숫자 정보를 포함할 수 있다. Float는 소수 점 숫자 정보로서 캡쳐된 화면이 실행중이었을 때 소수점 숫자 정보를 포함할 수 있다. Double은 자릿수가 많은 소수점 숫자 정보로서 캡쳐된 화면이 실행중이었을 때 소수점 숫자 정보를 포함할 수 있다. Date 는 날짜 정보 로서 캡쳐된 화면이 실행중이었을 때 날짜 정보를 포함할 수 있다. Time 은 시간 정보로서 캡쳐된 화면이 실행 중이었을 때 시간 정보를 포함할 수 있다. Class Objcet는 내부 클래스 오브젝트 정보로서 캡쳐된 화면이 실행 중이었을 때 내부 클래스 오브젝트 정보를 포함할 수 있다. 이외에도 클래스 오브젝트에는 얼마든지 다른 캡쳐 된 화면을 실행할 수 있는 정보가 포함될 수 있음은 자명하다. 어플리케이션 프레임 워크는 상기한 바와 같은 클래스 오브젝트에 포함된 정보들을 이용하여 캡쳐된 화면 의 상태를 실행할 수 있는 실행 경로 정보를 획득할 수 있다. 한편, 한 실시 예에 따르면, 전자 디바이스는 어플리케이션을 통해 캡쳐된 어플리케이션 화면에 해당 하는 실행 경로 정보를 획득할 수도 있다. 도 6은 본 발명의 실시 예에 따라 어플리케이션을 통해 실행 경로 정보를 획득하는 동작을 나타낸 흐름도 이다. 도 6을 참조하면, 어플리케이션은 610 과정에서 어플리케이션 화면이 캡쳐되는지 여부를 판단할 수 있다. 어플리케이션 실행 중 어플리케이션 화면이 캡쳐되면 어플리케이션은 620 과정에서 캡쳐된 화면에 해당하 는 URI 정보를 획득할 수 있다. URI 정보의 형식은 <ApplicationName>://<세부정보> (ex. smartclip://1.png) 등이 될 수 있다. 어플리케이션은 630 과정에서 상기 캡쳐된 어플리케이션 화면에 대응하여 획득된 URI(Uniform Resource Identifier) 정보를 캡쳐 기능을 담당하는 어플리케이션 프레임 워크로 전달할 수 있다. 다시 도 2를 참조하면, 전자 디바이스는 230 과정에서 캡쳐된 화면의 적어도 일부분의 이미지를 선택할 수 있다. 도 7은 본 발명의 실시 예에 따른 캡쳐된 화면의 적어도 일부분을 선택하는 동작의 예를 설명하기 위한 도면이 다. 도 7을 참조하면, 전자 디바이스는 도 7의 (a)와 같이 캡쳐된 어플리케이션 화면 전체 이미지를 선택 할 수 있다. 또한 전자 디바이스는 도 7의 (b)와 같이 캡쳐된 어플리케이션 화면 중 특정 오브젝트에 해당 하는 이미지를 선택할 수 있다. 또한 전자 디바이스는 도 7의 (c)와 같이 캡쳐된 어플리케이션 화면 중 전자펜 또는 사용자 손가락 등의 입력 유닛에 의해 캡쳐된 어플리케이션 화면상에 드로잉된 폐곡선에 내의 이미지를 선택할 수 있다. 이외에도 캡쳐된 화면의 적어도 일부분을 선택하는 방식은 화면에 존재하는 객 체를 연결하는 드로잉 입력(직선, 곡선 등)에 따른 객체 선택 방식, 화면에 존재하는 특정 객체를 직접 선택하 는 방식 등 다른 방식이 이용될 수 있다. 전자 디바이스는 240 과정에서 상기 캡쳐된 화면의 적어도 일부분의 이미지와 함께 실행 경로 정보를 저장 할 수 있다. 예컨대 전자 디바이스는 캡쳐된 화면의 전체와 함께 실행 경로 정보를 저장하거나, 캡쳐된 화면 내의 오브 젝트와 함께 실행 경로 정보를 저장하거나, 캡쳐된 화면에서 전자펜, 손가락 등을 이용한 드로잉 입력에 의해 사용자에 의해 선택된 부분의 이미지와 함께 실행 경로 정보를 저장할 수 있다. 이때 전자 디바이스는 실행 경로 정보를 DB(DataBase) 또는 파일(File)로 저장하거나, 캡쳐된 화면의 적어 도 일부분의 이미지 내의 메타 데이터(metadata) 영역에 실행 경로 정보를 포함시켜 저장할 수 있다. 상기 저장된 이미지 예컨대 캡쳐된 화면의 전체 이미지 또는 캡쳐된 화면의 적어도 일부분의 이미지는 추후 사 용자 요청에 따라 캡쳐 이미지 디스플레이 화면에 표시될 수 있다. 캡쳐 이미지 디스플레이 화면에서 사용자는 상기 저장된 이미지를 선택할 수 있다. 전자 디바이스는 250 과정에서 저장된 이미지가 선택되면, 260 과정에서 선택된 이미지와 함께 저장된 실 행 경로 정보를 읽어올 수 있다. 예를 들면, 전자 디바이스는 실행 경로 정보가 DB(DataBase) 또는 파일(File)로 저장된 경우 해당 DB(DataBase) 또는 파일(File)을 읽어올 수 있다. 또한 전자 디바이스는 실행 경로 정보가 캡쳐된 화면의 적어도 일부분의 이미지 내의 메타 데이터(metadata) 영역에 저장된 경우 해당 메타 데이터 영역에서 실행 경로 정보를 읽어올 수 있다. 전자 디바이스는 260 과정에서 상기 읽어온 실행 경로 정보를 이용하여 캡쳐된 화면의 상태를 실행할 수 있다. 예를 들면, 전자 디바이스는 캡쳐된 화면의 상태가 전화번호부 어플리케이션 실행 중 전화번호 상세 정보 (contact detail view)화면을 표시하는 상태였을 경우 전화번호 상세 정보를 보기 위한 전화번호부 어플리케이 션 실행 요청 없이도 실행 경로 정보를 이용하여 전화번호 상세 정보 화면을 표시할 수 있다. 또한 전자 디바이스는 캡쳐된 화면의 상태가 웹 브라우저 어플리케이션 실행 중 특정 웹 페이지 화면을 표 시하는 상태였을 경우 웹브라우저를 실행요청 입력 및 상기 특정 웹 페이지 화면을 보기 위한 주소 입력없이도 실행 경로 정보를 이용하여 상기 특정 웹 페이지 화면을 표시할 수 있다. 또한 전자 디바이스는 캡쳐된 화면의 상태가 음악 재생 어플리케이션 실행 중 특정 음악 재생 화면을 표시 하는 상태였을 경우 음악 재생 어플리케이션을 실행 요청 및 특정 음악 재생 요청 입력 없이도 실행 경로 정보 를 이용하여 상기 캡쳐된 시점의 음악 재생 화면을 표시하고, 캡쳐된 시점의 음악을 재생할 수 있다. 이외에도 본 발명의 다양한 실시 예에 따르면, 캡쳐된 화면의 상태는 다양한 어플리케이션 실행중의 상태일 수 있고, 상 기 다양한 어플리케이션을 실행시켜 상기 캡쳐된 화면의 상태로 가기 위한 입력 없이도, 실행 경로 정보를 이용 하여 즉시 캡쳐된 화면의 상태를 실행할 수 있다. 한 실시 예에 따르면 어플리케이션은 전자 디바이스에서 실행될 수 있는 응용 프로그램일 수 있다. 어플리케이션은 예를 들면, 전화번호부 어플리케이션, 웹 브라우저 어플리케이션, 음악 재생 어플리케이션, 클립 어플리케이션, 스크랩북 어플리케이션 등 다양한 기능을 수행하는 어플리케이션일 수 있다. 한 실시 예에 따르면, 어플리케이션 프레임워크는 다양한 어플리케이션들 중 적어도 하나 이상의 어플리케 이션을 실행하고, 어플리케이션 실행에 따른 화면들이 터치스크린에 표시되도록 할 수 있다. 어플리케이션 프레임워크는 어플리케이션 실행 중 사용자 입력에 따라 어플리케이션 실행 화면이 캡쳐되면 캡쳐된 어플 리케이션 실행 화면의 적어도 일부 이미지(이하, ‘캡쳐된 이미지’라고도 함)에 해당하는 실행 경로 정보를 획 득하고, 캡쳐된 이미지와 캡쳐된 이미지에 해당하는 실행 경로 정보를 저장할 수 있다. 한 실시 예에 따르면 캡 쳐된 이미지는 캡쳐된 어플리케이션 화면 전체 이미지이거나, 캡쳐된 어플리케이션 화면에서 사용자의 드로잉 입력에 의해 크롭된 일부 이미지일 수 있다. 도 8a는 본 발명의 실시 예에 따른 전자 디바이스에서 어플리케이션 화면 캡쳐하고 캡쳐된 이미지에 해당하는 실행 경로 정보를 획득하는 개념을 나타낸 도면이다. 도 8a를 참조하면, 어플리케이션 프레임워크는 프레 임워크 레이어에 해당될 수 있고, 다양한 어플리케이션들(821~824)은 어플리케이션 레이어에 해당될 수 있다. 한 실시 예에 따르면 다양한 어플리케이션들(821~824)은 스크랩북 어플리케이션, 웹 브라우저 어 플리케이션, 동영상 서비스 어플리케이션, 음악 재생 어플리케이션를 포함할 수 있다. 이외에도 다른 어플리케이션을 더 포함할 수도 있다. 한 실시 예에 따르면 어플리케이션 프레임워크는 어플리케이션 실행 화면이 표시되고 있는 상태에서, 사용 자 입력 예컨대 사용자로부터 화면 캡쳐 요청 입력에 따라 어플리케이션 실행 화면을 캡쳐할 수 있고, 캡 쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 어플리케이션 실행 화면에 대응된 제목, 어플리케이션 실행 화면으로 복원할 수 있는 URL, 어플리케이션 실행 화면에 대응된 텍스트, 어플리케이션 실행 화면에 대응된 데이터 파일(음악 파일, 비디 오 파일 또는 이미지 파일), 어플리케이션 실행 화면에 대응된 드로잉 메모 정보, 어플리케이션 실행 화면에 대 응된 필기 인식 결과 정보, 어플리케이션 실행 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 어플리케이션 실행 화 면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 어플리케이션 실행 화면과 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 어플리케 이션 실행 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 한 실시 예에 따르면 어플리케이션 프레임워크는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 즉, 메타 데이터를 DB(또는 파일 시스템)에 저장할 수 있다. 한 실시 예에 따르면 DB는 스크랩북 어플리케이션에 의해 엑세스될 수 있다. 스크랩북 어플리케이션 은 DB를 억세스하여 DB에 저장된 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 예컨 대 메타 데이터를 로드(844 )할 수 있고, 이에 따라 캡쳐된 어플리케이션 실행화면을 복원하여 실행되도록 할 수 있다. 도 8b는 본 발명의 실시 예에 따른 전자 디바이스에서 캡쳐된 어플리케이션 실행화면을 복원하여 실행하는 개념 을 나타낸 도면이다. 도 8b를 참조하면, 스크랩북 어플리케이션은 DB를 억세스하여 DB에 저장된 캡쳐된 이미지와 캡 쳐된 이미지에 대응된 실행 경로 정보 예컨대 메타 데이터를 로드할 수 있다. 또한 스크랩북 어플리케이션 은 실행 경로 정보에 따라 실행 요청할 수 있다. 한 실시 예에 따르면 스크랩북 어플리케이션은 실행 경로 정보 예컨대 메타 데이터에 따라 실행하도록 요청할 수 있다. 어플리케이션 프레임워크는 실행 경로 정보에 따라 해당 어플리케이션 실행화면을 복원하여 실행할 수 있다. 한 실시 예에 따르면 어플리케이션 프레임워크는 적어도 하나 이상의 어플리케이션들 중 메타 데이터 에 따라 해당 어플리케이션을 실행화면을 복원하여 실행할 수 있다. 도 9는 본 발명의 실시 예에 따른 전자 디바이스에서 웹 브라우져 어플리케이션 실행 중 캡쳐 이미지 이용 예를 나타낸 도면이다. 도 9의 (a)를 참조하면, 전자 디바이스는 도 9의 (a)와 같이 웹 브라우져 어플리케이션 실행 중 웹 페이지 화면을 표시한 상태에서 웹 페이지 화면을 캡쳐할 수 있다. 도 9의 (b)를 참조하면, 전자 디바이스는 캡쳐된 웹 페이지 화면에서 전체 또는 적어도 일부의 이미 지를 선택할 수 있다. 도 9의 (b)에서는 사용자에 의해 드로잉된 타원형 내의 이미지가 선택된 것을 예를 들고 있다. 웹 페이지 화면에서는 사각형, 원형, 다각형 등 사용자에 의해 원하는 형태의 이미지가 선택될 수 있다. 전자 디바이스는 선택된 이미지와 캡쳐된 화면의 실행 경로 정보를 함께 저장할 수 있다. 도 9의 (c)를 참조하면, 전자 디바이스는 캡쳐 이미지 표시 화면에 저장된 이미지를 표시하고, 사용자로부터 저장된 이미지를 선택받을 수 있다. 이때 저장된 이미지를 직접 선택받거나, 저장된 이 미지의 상태를 실행하도록 요청하는 버튼을 선택받을 수 있다. 도 9의 (d)를 참조하면, 전자 디바이스는 저장된 이미지 또는 저장된 이미지의 상태를 실행하도 록 요청하는 버튼이 선택되면 전자 디바이스는 도 9의 (d)와 같이 저장된 이미지에 해당하는 캡 쳐된 화면의 상태를 실행할 수 있다. 도 10은 본 발명의 실시 예에 따른 전자 디바이스에서 음악 재생 어플리케이션 실행 중 캡쳐 이미지 이용 예를 나타낸 도면이다. 도 10의 (a)를 참조하면, 전자 디바이스는 도 10의 (a)와 같이 음악 재생 어플리케이션 실행 중 음악 재생 화면을 표시한 상태에서 음악 재생 화면을 캡쳐할 수 있다. 도 10의 (b)를 참조하면, 전자 디바이스는 캡쳐된 음악 재생 화면에서 전체 또는 적어도 일부의 이 미지를 선택할 수 있다. 도 10의 (b)에서는 사용자에 의해 드로잉된 폐곡선 내의 이미지가 선택된 것을 예를 들고 있다. 캡쳐된 음악 재생 화면에서는 사각형, 원형, 다각형 등 사용자에 의해 원하는 형태의 이미지가 원하는 위치에서 선택될 수 있다. 전자 디바이스는 선택된 이미지와 캡쳐된 음악 재생 화면의 실행 경로 정보를 함께 저장할 수 있다. 예를 들면, 선택된 이미지와 캡쳐된 음악 재생 화면의 실행 경로 정보 는 캡쳐 시점에서 URI 정보 및 음악 재생 구간 정보(play time)를 포함할 수 있다. 도 10의 (c)를 참조하면, 전자 디바이스는 캡쳐 이미지 표시 화면에 저장된 이미지를 표시하 고, 사용자로부터 저장된 이미지를 선택받을 수 있다. 이때 저장된 이미지를 직접 선택받거나, 저 장된 이미지의 상태를 실행하도록 요청하는 버튼을 선택받을 수 있다. 도 10의 (d)를 참조하면, 전자 디바이스는 저장된 이미지 또는 저장된 이미지의 상태를 실행 하도록 요청하는 버튼이 선택되면 전자 디바이스는 도 10의 (d)와 같이 저장된 이미지에 해당 하는 캡쳐된 화면의 상태를 실행할 수 있다. 예컨대 캡쳐된 화면에 해당하는 음악 재생 지점에서 음악을 재생할 수 있다. 도 11은 본 발명의 실시 예에 따른 전자 디바이스에서 클립 어플리케이션 실행 중 캡쳐 이미지 이용 예를 나타 낸 도면이다. 도 11의 (a)를 참조하면, 전자 디바이스는 도 11의 (a)와 같이 음악 클립 어플리케이션 실행 중 클립된 텍 스트들이 표시된 클립 화면을 표시한 상태에서 클립 화면을 캡쳐할 수 있다. 도 11의 (b)를 참조하면, 전자 디바이스는 캡쳐된 클립 화면에서 전체 또는 적어도 일부의 이미지를 선택할 수 있다. 한 실시 예에 따르면 캡쳐된 클립 화면에서 사용자의 드로잉 입력에 따라 전체 또는 적 어도 일부의 이미지를 크롭하고 크롭된 이미지를 선택할 수 있다. 도 11의 (b)에서는 사용자에 의해 드로잉된 폐곡선 내의 이미지가 선택된 것을 예를 들고 있다. 캡쳐된 클립 화면에서는 사각형, 원형, 다각형 등 사 용자에 의해 원하는 형태의 이미지가 원하는 위치에서 선택될 수 있다. 도 11의 (c)를 참조하면, 전자 디바이스는 선택된 이미지와 캡쳐된 클립 화면의 실행 경로 정보를 함께 저장할 수 있다. 캡쳐된 클립 화면의 실행 경로 정보는 “slookdemos://SmartClip” 과 같은 URI 정보를 포함할 수 있다. 도 11의 (d)를 참조하면, 전자 디바이스는 캡쳐 이미지 표시 화면에 저장된 이미지를 표시하 고, 사용자로부터 저장된 이미지를 선택받을 수 있다. 이때 저장된 이미지를 직접 선택받거나, 저 장된 이미지의 상태를 실행하도록 요청하는 아이콘을 선택받을 수 있다. 도 11의 (e)를 참조하면, 전자 디바이스는 저장된 이미지 또는 저장된 이미지의 상태를 실행 하도록 요청하는 아이콘이 선택되면 전자 디바이스는 도 11의 (e)와 같이 저장된 이미지에 해 당하는 캡쳐된 원본 화면의 상태를 실행할 수 있다. 예컨대 캡쳐된 화면에 해당하는 클립 화면을 표시할 수 있 다. 상기한 바와 같은 본 발명의 다양한 실시 예들에 따르면 사용자가 어플리케이션 실행에 따른 화면을 보다가 화 면을 캡쳐하면, 캡쳐된 화면의 적어도 일부분과 캡쳐된 화면의 상태를 실행시킬 수 있는 실행 경로 정보를 함께 저장함으로써, 사용자가 캡쳐된 화면을 이용하여 캡쳐된 화면의 상태를 실행시킬 수 있는 효과가 있다. 예를 들어 저장된 웹 페이지 화면의 적어도 일부 이미지를 선택하면, 해당 웹 페이지 화면의 상태를 실행시킬 수 있으므로, 사용자는 해당 웹 페이지 화면의 상태를 실행시키기 위해 웹 브라우저를 실행시키고, 웹 브라우저 상에 웹 페이지 주소를 입력 하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 또한 저장된 멀티미디어 컨텐츠 재생 화면의 적어도 일부 이미지를 선택하면, 해당 멀티미디어 컨텐츠 재생 화 면의 상태를 실행시킬 수 있으므로, 사용자는 해당 멀티미디어 컨텐츠 재생 화면의 상태를 실행시키기 위해 멀 티미디어 컨텐츠 재생 어플리케이션을 실행시키고, 멀티미디어 컨텐츠 재생 어플리케이션에서 재생할 멀티미디 어 컨텐츠를 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 구체적으로 멀티미디어 컨텐 츠는 음악, 동영상뿐만 아니라 전자 디바이스에서 재생 가능한 다양한 컨텐츠를 포함할 수 있다. 멀티미디어 컨 텐츠가 음악인 경우, 저장된 음악 및 동영상 등과 같은 멀티미디어 재생 화면의 적어도 일부 이미지를 선택하면, 해당 음악 재생 화면의 상태를 실행시킬 수 있으므로, 사용자는 해당 음악 재생 화면의 상태를 실행시키기 위해 음악 재생 어플리케이션을 실행시키고, 음악 재생 어플리케이션에서 재생할 음악을 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 또한 저장된 클립 화면 이미지의 적어도 일부 이미지를 선택하면, 해당 클립 화면의 상태를 실행시킬 수 있으므 로, 사용자는 클립 화면을 표시하기 위해 클립 어플리케이션을 실행 시키고, 클립 어플리케이션에서 표시할 클 립 화면을 선택하는 등의 사용자 입력 동작을 생략할 수 있어서 편리할 수 있다. 한편, 상기한 다양한 실시 예들 외에도 다양한 어플리케이션에 캡쳐 화면을 이용한 실행이 적용될 수 있음은 자 명하다. 본 발명의 다양한 실시 예에 따르면, 전자 디바이스는 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐 된 이미지에 대응된 실행 경로 정보를 공유할 수 있다. 도 12는 본 발명의 실시 예에 따른 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 동작을 나타낸 도면이다. 도 12를 참조하면, 전자 디바이스는 1210 동작에서 사용자로부터 어플리케이션 화면에서 캡쳐된 이미지와 실행 경로 정보 공유 요청이 있는지 판단할 수 있다. 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 요청이 있으면, 전자 디바이스는 1220 동작 에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 생성할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 스크랩북 파 일(SCC) 데이터 형식이거나 이미지 및 텍스트로 이루어진 데이터 형식이 될 수 있다. 이 외에도 캡쳐된 이미지 와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것 이나 가능할 수 있다. 전자 디바이스는 1230 동작에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이 터를 공유하기 위해 전송할 수 있다. 본 발명의 다양한 실시 예에 따르면 전자 디바이스는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 데이터 공유 서버를 통해 동일 사용자의 다른 전자 디바이스 또는 다른 사용자의 전 자 디바이스와 공유할 수 있다. 이에 따라 전자 디바이스는 동일 사용자의 다른 전자 디바이스 또는 다른 사용자의 전자 디바이스에서도 캡쳐된 이미지를 이용하여 캡쳐 시의 동작을 실행시킬 수 있게 할 수 있다. 본 발명의 한 실시 예에 따르면, 데이터 공유 서버에 있어서, 제1 전자 디바이스부터 업로드된 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고, 상기 데이터가 업로 드되면 상기 제1 전자 디바이스와 동일 계정으로 접속 가능한 제2 전자 디바이스에 상기 저장된 데이터를 다운 로드하는 제어하는 제어부를 포함할 수 있다. 도 13은 본 발명의 제1 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템을 나타낸 도면이다. 도 13을 참조하면, 제1 전자 디바이스 A1는 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐된 이미지 에 대응된 실행 경로 정보를 제1 공유 서버를 통해 제2 전자 디바이스 A2와 동기화함으로써 공유할 수 있다. 제1 공유 서버는 예를 들면, i-cloude 서버 등의 동일 계정의 전자 디바이스 간에 동기화를 제 공하는 서버일 수 있다. 제2 전자 디바이스 A2는 제1 전자 디바이스 A1의 사용자와 동일한 사용자 의 전자 디바이스일 수 있으며, 제1 전자 디바이스 A1와 동일 계정을 이용하여 제1 공유 서버에 접 속할 수 있다. 도 14는 본 발명의 제1 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템의 동작을 나타낸 도면이다. 도 14를 참조하면, 제1 전자 디바이스 A1는 1402 동작에서 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트 로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다.한 실시 예에 따르면, 캡쳐된 이미지에 대응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보 를 포함할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 어플리케이션 실행 화면에 대응된 제목, 어플리케이션 실행 화면으로 복원할 수 있는 URL, 어플리케이션 실행 화면에 대응된 텍스트, 어플리케이션 실행 화면에 대응된 데이터 파일 (음악 파일, 비디오 파일 또는 이미지 파일), 어플리케이션 실행 화면에 대응된 드로잉 메모 정보, 어플리케이 션 실행 화면에 대응된 필기 인식 결과 정보, 어플리케이션 실행 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 어플리케이션 실행 화 면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 어플리케이션 실행 화면과 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 어플리케 이션 실행 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A1는 1404 동작에서 주기적 데이터 변화를 체크할 수 있다. 데이터 변화가 감지되면 제1 전자 디바이스 A1는 1406 동작에서 데이터를 통신 네트워크를 통해 제1 공유 서버에 업 로드할 수 있다. 제1 공유 서버는 1408 동작에서 제1 전자 디바이스 A1로부터 업로드된 데이터를 저장할 수 있다. 제1 공유 서버는 업로드된 데이터 저장 후 1410 동작에서 제1 전자 디바이스 A1와 동기화하도록 설 정된 제2 전자 디바이스 A2에 데이터를 다운로드할 수 있다. 한 실시 예에 따르면 제1 공유 서버는 푸쉬 메시지 방식 또는 폴링 방식으로 제2 전자 디바이스 A2(132 0)에 데이터를 다운로드할 수 있다. 푸쉬 메시지 방식의 경우, 제1 공유 서버는 푸쉬 메시지를 이용하여 제2 전자 디바이스 A2에 데이 터가 저장됨을 알릴 수 있고,제2 전자 디바이스 A2는 푸쉬 메시지에 따라 제1 공유 서버에 저장된 데이터를 요청할 수 있다. 제1 공유 서버는 저장된 데이터 요청에 따라 제2 전자 디바이스 A2에 데 이터를 다운로드할 수 있다. 폴링 방식의 경우, 제2 전자 디바이스 A2는 주기적으로 제1 공유 서버에 새롭게 저장된 데이터가 있는지 조회 요청할 수 있고, 제1 공유 서버는 제2 전자 디바이스 A2로부터의 조회 요청에 따라 새 롭게 저장된 데이터가 있는 경우 새롭게 저장된 데이터가 있음을 알리는 응답 메시지를 보낸 후 새롭게 저장된 데이터를 제2 전자 디바이스 A2에 다운로드할 수 있다. 제2 전자 디바이스 A2는 1412 동작에서 다운로드받은 데이터를 저장함으로써, 제1 전자 디바이스 A1와 동기화될 수 있고, 해당 데이터를 공유할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1는 웹 브라우저 어플리케이션 실행 화면 즉, 웹 페이지 화면에서 사용자 입력에 따라 웹 페이지 전체 화면을 캡쳐하하거나, 캡쳐된 웹 페이지 화면에서 일부 이미지를 크롭하여 캡쳐된 웹 페이지 화면의 적어도 일 부 이미지를 획득할 수 있다. 제1 전자 디바이스 A1는 캡쳐된 웹 페이지 화면의 적어도 일부 이미지와 캡 쳐된 웹 페이지 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 제1 공유 서버를 통해 제2 전자 디바이스 A2와 공유할 수 있다. 예를 들면, 제1 전자 디바이스 A1는 웹 페이지 화면 표시 중 사용자에 입력에 따라 웹 페이지의 적어도 일부 이미지를 획득할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1는 사용자 입력에 따라 캡쳐 기능을 수행하는 어플리케이이션(예컨대 SmartClip 어플리케이션)을 이용하여 웹 페이지 화면을 캡쳐하여 캡쳐 된 웹 페이지 화면 이미지를 획득하거나, 캡쳐된 웹 페이지 화면에서 일부 이미지를 크롭하여 웹 페이지의 적어 도 일부 이미지를 획득할 수 있다. 이하 설명에서는 캡쳐된 웹페이지 화면 이미지 또는 캡쳐된 웹 페이지 화면 에서 크롭된 일부 이미지를 캡쳐된 이미지라고 설명할 수도 있다. 제1 전자 디바이스 A1는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지에 대 응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 웹 페이지에 대응된 제목, 웹 페이지로 복원할 수 있는 URL, 웹 페이지에 대응된 텍스트, 웹 페이지에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 웹 페이지에 대응된 드로잉 메모 정보, 웹 페이지에 대응된 필기 인식 결과 정보, 웹 페이지에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함 할 수 있다. 딥 링크 정보는 웹 페이지에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 웹 페이지와 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 웹 페이지의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A1는 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파 일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지 와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것 이나 가능할 수 있다. 제1 전자 디바이스 A1는 스크랩북 어플리케이션과 관련된 DB의 데이터 변화를 주기적으로 체크할 수 있다. 데이터 변화가 감지되면 제1 전자 디바이스 A1는 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이 미지에 대응된 실행 경로 정보를 포함하는 데이터를 통신 네트워크를 통해 제1 공유 서버에 업로드 할 수 있다. 제1 공유 서버는 제1 전자 디바이스 A1로부터 업로드된 데이터를 저장할 수 있다. 제1 공유 서버는 업로드된 데이터 저장 후 제1 전자 디바이스 A1와 동기화하도록 설정된 제2 전자 디바이스 A2에 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 데이터를 다운로드할 수 있다. 한 실시 예에 따르면 제1 공유 서버는 푸쉬 메시지 방식 또는 폴링 방식으로 제2 전자 디바이스 A2(132 0)에 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운 로드할 수 있다. 푸쉬 메시지 방식의 경우, 제1 공유 서버는 푸쉬 메시지를 이용하여 제2 전자 디바이스 A2에 캡쳐 된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터가 저장됨을 알릴 수 있고,제2 전자 디바이스 A2는 푸쉬 메시지에 따라 제1 공유 서버에 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 요청할 수 있다. 제1 공유 서버 는 저장된 데이터 요청에 따라 제2 전자 디바이스 A2에 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이 미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드할 수 있다. 폴링 방식을 이용하는 경우, 제2 전자 디바이스 A2는 주기적으로 제1 공유 서버에 새롭게 저장된 데이터가 있는지 조회 요청할 수 있고, 제1 공유 서버는 제2 전자 디바이스 A2로부터의 조회 요청 에 따라 새롭게 저장된 데이터가 있는 경우 새롭게 저장된 데이터가 있음을 알리는 응답 메시지를 보낸 후 새롭 게 저장된 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 전자 디바이스 A2에 다운로드할 수 있다. 제2 전자 디바이스 A2는 다운로드받은 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실 행 경로 정보를 포함하는 데이터를 저장함으로써, 제1 전자 디바이스 A1와 동기화될 수 있고, 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 공유할 수 있다. 또한 제2 전자 디바이스 A2는 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 사용자에게 표시할 수 있고, 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 이용하여 해당 웹 페이지 화면이 표시되도록 실 행할 수 있다. 또한 한 실시 예에 따르면 제1 전자 디바이스 A1는 동영상 재생 서비스 어플리케이션 실행 화면 예컨대 유투브(Youtube)화면에서 사용자 입력에 따라 동영상 재생 서비스 어플리케이션 실행 화면을 캡쳐하하거나, 캡 쳐된 동영상 재생 서비스 어플리케이션 실행 화면 에서 일부 이미지를 크롭하여 캡쳐된 동영상 재생 서비스 어 플리케이션 실행 화면의 적어도 일부 이미지를 획득할 수 있다. 제1 전자 디바이스 A1는 캡쳐된 동영상 재생 서비스 어플리케이션 실행 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 어플리케이션 실행 화 면의 적어도 일부 이미지에 대응된 실행 경로 정보를 제1 공유 서버를 통해 제2 전자 디바이스 A2 와 공유할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1는 동영상 재생 서비스 어플리케이션 실행 화면 표시 중 캡쳐 기능을 수행하는 어플리케이이션(예컨대 SmartClip 어플리케이션)을 이용하여 동영상 재생 서비스 화면을 캡쳐 하여 캡쳐된 동영상 재생 서비스 화면 이미지를 획득하거나, 캡쳐된 동영상 재생 서비스 화면 이미지에서 일부이미지를 크롭하여 획득할 수 있다. 이하 에서는 캡쳐된 동영상 재생 서비스 화면 이미지 또는 캡쳐된 동영상 재생 서비스 화면에서 크롭된 일부 이미지를 캡쳐된 이미지로 설명할 수 있다. 한편, 제1 전자 디바이스 A1는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지 에 대응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따 르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이 터는 동영상 재생 서비스에 대응된 제목, 동영상 재생 서비스로 복원할 수 있는 URL, 동영상 재생 서비스에 대 응된 텍스트, 동영상 재생 서비스에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 동영상 재 생 서비스에 대응된 드로잉 메모 정보, 동영상 재생 서비스에 대응된 필기 인식 결과 정보, 동영상 재생 서비스 에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 동영상 재생 서비스 화면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 동영상 재생 서 비스 화면과 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보 는 동영상 재생 서비스 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A1는 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서 비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함 하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 미리 정 해진 형식의 데이터는 스크랩북 어플리케이션과 관련된 DB에 저장될 수 있다. 제1 전자 디바이스 A1는 스크랩북 어플리케이션과 관련된 DB의 데이터 변화를 주기적으로 체크할 수 있다. 데이터 변화가 감지되면 제1 전자 디바이스 A1는 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 통신 네트워크를 통해 제1 공유 서버에 업로드할 수 있다. 제1 공유 서버는 제1 전자 디바이 스 A1로부터 업로드된 데이터를 저장할 수 있다. 제1 공유 서버는 업로드된 데이터 저장 후 제1 전 자 디바이스 A1와 동기화하도록 설정된 제2 전자 디바이스 A2에 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함 하는 데이터를 다운로드할 수 있다. 한 실시 예에 따르면 제1 공유 서버는 푸쉬 메시지 방식 또는 폴링 방식으로 제2 전자 디바이스 A2(132 0)에 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드할 수 있다. 푸쉬 메시지 방식의 경우, 제1 공유 서버는 푸쉬 메시지를 이용하여 제2 전자 디바이스 A2에 데이 터가 저장됨을 알릴 수 있고, 제2 전자 디바이스 A2는 푸쉬 메시지에 따라 제1 공유 서버에 저장된 데이터를 요청할 수 있다. 제1 공유 서버는 저장된 데이터 요청에 따라 제2 전자 디바이스 A2에 캡 쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지 에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드할 수 있다. 폴링 방식을 이용하는 경우, 제2 전자 디바이스 A2는 주기적으로 제1 공유 서버에 새롭게 저장된 데이터가 있는지 조회 요청할 수 있고, 제1 공유 서버는 제2 전자 디바이스 A2로부터의 조회 요청 에 따라 새롭게 저장된 데이터가 있는 경우 새롭게 저장된 데이터가 있음을 알리는 응답 메시지를 보낸 후 새롭 게 저장된 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 전자 디바이스 A2에 다운로드할 수 있 다.제2 전자 디바이스 A2는 다운로드받은 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐 된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장함으로써, 제1 전자 디바이스 A1와 동기화될 수 있고, 캡쳐된 동영상 재생 서비스 화면의 적어도 일 부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 공유할 수 있다. 또한 제2 전자 디바이스 A2는 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동 영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 사용자에게 표시할 수 있고, 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지지에 대응된 실행 경로 정보를 이용하여 해당 동영상 재생 서비 스가 실행되도록 할 수 있다.또한 한 실시 예에 따르면 제1 전자 디바이스 A1는 음악 재생 어플리케이션 실행 화면 예컨대 음악 재생 화면에서 사용자 입력에 따라 음악 재생 화면을 캡쳐하여 캡쳐된 음악 재생 화면 적어도 이미지를 획득할 수 있 다. 한 실시 옝 따르면 캡쳐된 음악 재생 화면 전체 이미지를 획득하거나, 캡쳐된 음악 재생 화면에서 일부 이 미지를 크롭하여 캡쳐된 음악 재생 화면의 일부 이미지를 획득할 수 있다. 제1 전자 디바이스 A1는 캡쳐 된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 제1 공유 서버를 통해 제2 전자 디바이스 A2와 공유할 수 있다 한 실시 예에 따르면 제1 전자 디바이스 A1는 음악 재생 중 사용자 입력에 따라 캡쳐 기능을 수행하는 어 플리케이션(예컨대 SmartClip 어플리케이션)을 이용하여 음악 재생 화면의 적어도 일부 이미지를 캡쳐할 수 있 다. 이하 설명에서는 캡쳐된 음악 재생 화면 전체 이미지 또는 캡쳐된 음악 재생 화면에서 크롭된 일부 이미지 를 캡쳐된 이미지라고 설명할 수 있다. 한편, 제1 전자 디바이스 A1는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지 에 대응된 실행 경로 정보는 캡쳐된 이미지의 음악 재생 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실 시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 음악 재생 화면에 대응된 제목, 음악 재생 화면의 상태로 복원할 수 있는 URL, 음악 재생 화면에 대응된 텍스트, 음악 재생 화면에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 음악 재생 화면에 대응된 드로잉 메모 정보, 음악 재생 화면에 대응된 필기 인식 결과 정보, 음악 재생 화면에 대응된 클 립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 음악 재생 화면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 음악 재생 화면과 관련된 오디오 파일에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 음악 재생 화면의 메 인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A1는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미 리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이 터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1는 음악 재생 화면에 대응된 오디오 파일을 데이터에 더 포함시킬 수 있다. 제1 전자 디바이스 A1는 스크랩북 어플리케이션과 관련된 DB의 데이터 변화를 주기적으로 체크할 수 있다. 데이터 변화가 감지되면 제1 전자 디바이스 A1는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지를 통신 네트워크를 통해 제1 공유 서버에 업로드할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A1는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지외에 오디오 파일을 더 포함하는 데이터를 통신 네트워크를 통해 제1 공유 서버에 업로드할 수 있다. 한 실시 예에 따르면 오디오 파일은 미리 정해진 데이터 크기 이하인 경우에만 업로드될 수 있다. 한 실시 예에 따르면 미리 정해진 데이터 크기는 15Mbyte 일 수 있다. 제1 공유 서버는 제1 전자 디바이스 A1로부터 업로드된 데이터를 저장할 수 있다. 제1 공유 서버 는 업로드된 데이터 저장 후 제1 전자 디바이스 A1와 동기화하도록 설정된 제2 전자 디바이스 A2에 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대 응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 다운로드할 수 있다. 한 실시 예에 따르면 제1 공유 서버는 푸쉬 메시지 방식 또는 폴링 방식으로 제2 전자 디바이스 A2(132 0)에 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실 행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 다운로드할 수 있다. 푸쉬 메시지 방식의 경우, 제1 공유 서버는 푸쉬 메시지를 이용하여 제2 전자 디바이스 A2에 데이 터가 저장됨을 알릴 수 있고,제2 전자 디바이스 A2는 푸쉬 메시지에 따라 제1 공유 서버에 데이터 를 요청할 수 있다. 제1 공유 서버는 저장된 데이터 요청에 따라 제2 전자 디바이스 A2에 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보 를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 다운로드할 수 있다. 폴링 방식을 이용하는 경우, 제2 전자 디바이스 A2는 주기적으로 제1 공유 서버에 새롭게 저장된 데이터가 있는지 조회 요청할 수 있고, 제1 공유 서버는 제2 전자 디바이스 A2로부터의 조회 요청 에 따라 새롭게 저장된 데이터가 있는 경우 새롭게 저장된 데이터가 있음을 알리는 응답 메시지를 보낸 후 새롭 게 저장된 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응 된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 제2 전자 디바이스 A2에 다운로드할 수 있다. 제2 전자 디바이스 A2는 저장된 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이 미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이 터를 다운로드받을 수 있다. 제2 전자 디바이스 A2는 다운로드받은 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐 된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터를 저장함으로써, 제1 전자 디바이스 A1와 동기화될 수 있고, 캡쳐 된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 공유하거나, 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미 지에 대응된 실행 경로 정보와 오디오 파일을 공유할 수 있다. 또한 제2 전자 디바이스 A2는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 사 용자에게 표시할 수 있고, 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 이용하여 해당 음악이 재생되도록 할 수 있다. 또한 제2 전자 디바이스 A2는 오디오 파일을 재생할 수도 있다. 한 실시 예에 따르면 데이터 공유 서버에 있어서, 제1 전자 디바이스부터 업로드된 캡쳐된 이미지와 캡쳐된 이 미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장하는 저장부를 포함하고, 상기 데이터가 업로드되면 업 로드된 데이터의 URL을 상기 제1 전자 디바이스에 전송하여 상기 제1 디바이스에 의해 상기 업로드된 데이터의 URL이 제2 전자 디바이스에 전달되도록 하고, 상기 제2 전자 디바이스에 의해 상기 업로드된 데이터의 URL을 이 용한 데이터 요청에 따라 상기 업로드된 데이터를 상기 제2 전자 디바이스에 다운로드하도록 제어하는 제어부를 포함할 수 있다. 도 15는 본 발명의 제2 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템을 나타낸 도면이다. 도 15를 참조하면, 제1 전자 디바이스 A는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포 함하는 데이터를 통신 네트워크를 통해 제2 공유 서버에 업로드할 수 있다. 제1 전자 디바이스 는 제2 공유 서버로부터 업로드된 데이터의 URL을 수신하여 제2 전자 디바이스 B에 제공할 수 있다. 제2 공유 서버는 예를 들면, Dropbox 등의 클라우드 스토리지 서비스를 제공하는 서버일 수 있으며, 전 자 디바이스들이 데이터 업로드하고, 다운로드 받을 수 있는 서비스를 제공하는 서버일 수 있다. 제2 공유 서버 는 제1 전자 디바이스 A로부터 데이터가 업로드되면 업로드된 데이터의 ULR을 제1 전자 디바이스 A에 제공할 수 있다. 제2 전자 디바이스 B는 통신 네트워크를 통해 제1 전자 디바이스 A로부터 제2 공유 서버 에 업로드된 데이터의 URL을 수신할 수 있다. 제2 전자 디바이스 B는 제1 전자 디바이스 A의 사용자와 다른 사용자의 전자 디바이스일 수 있으며, 제1 전자 디바이스 A와 다른 계정을 이용하여 제2 공유 서버에 접속하여 업로드된 데이터의 ULR에 해당하는 데이터를 다운로드받을 수 있다. 제2 전자 디바 이스 B는 다운로드받은 데이터를 저장함으로써, 제1 전자 디바이스 A와 데이터를 공유할 수 있다. 도 16은 본 발명의 제2 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템의 동작을 나타낸 도면이다. 도 16을 참조하면, 제1 전자 디바이스 A는 1602 동작에서 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 저장할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함 하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 어플리케이션 실행 화면에 대응된 제목, 어플리케이션 실행 화면으로 복원할 수 있는 URL, 어플리케이션 실행 화면에 대응된 텍스트, 어플리케이션 실행 화면에 대응된 데이터 파일(음악 파일, 비디 오 파일 또는 이미지 파일), 어플리케이션 실행 화면에 대응된 드로잉 메모 정보, 어플리케이션 실행 화면에 대 응된 필기 인식 결과 정보, 어플리케이션 실행 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 어플리케이션 실행 화 면에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 어플리케이션 실행 화면과 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 어플리케 이션 실행 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A는 1604 동작에서 사용자에 의한 데이터 업로드 요청이 수신되면, 1606 동작에서 제 2 공유 서버에 데이터를 업로드할 수 있다. 제2 공유 서버는 1608 동작에서 업로드된 데이터를 저장하고, 1610 동작에서 업로드된 데이터를 엑세스할 수 있도록 하는 업로드된 데이터의 URL을 제1 전자 디바이스 A에 전송할 수 있다. 제1 전자 디바이스 A는 1612 동작에서 사용자로부터 업로드된 데이터의 URL 공유 요청을 입력받을 수 있 다. 만약 업로드된 데이터의 URL 공유 요청이 입력되면 제1 전자 디바이스 A는 1614 동작에서 업로드된 데이터의 URL 전송 방식을 선택할 수 있다. 한 실시 예에 따르면 업로드된 데이터의 URL 전송 방식은 메일 전송 방식, 메시지 전송 방식(SMS,MMS 등), 채팅 메시지 전송 방식(chat on), WIFI direct 전송 방식 중 어느 하나 의 전송 방식일 수 있다. 이 외에도 전송 방식은 ULR 을 전송할 수 있는 전송 방식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스 A는 1616 동작에서 상기 선택된 전송 방식으로 업로드된 데이터의 URL을 제2 전 자 디바이스 B에 전송할 수 있다. 제2 전자 디바이스 B는 1618 동작에서 업로드된 데이터의 ULR이 수신되면 업로드된 데이터의 URL에 접속 할 수 있고 1620 동작에서 업로드된 데이터를 다운로드 받을 수 있다. 제2 전자 디바이스 B는 1622 동작 에서 다운로드된 데이터를 저장함으로써, 제1 전자 디바이스 A와 데이터를 공유할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 웹 브라우저 어플리케이션 실행 화면 즉, 웹 페이지 화면이 캡쳐되거나 웹 페이지 화면에서 적어도 일부 이미지가 크롭되어 웹 페이지 화면의 일부 이미지가 캡쳐된 경우, 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 공유 서버에 업로드하 고, 제2 공유 서버로부터 업로드된 데이터의 URL을 수신하여 제2 전자 디바이스 B에 제공할 수 있 다. 예를 들면, 제1 전자 디바이스 A는 웹 페이지 화면 표시 중 사용자에 입력에 따라 웹 페이지의 적어 도 일부 이미지를 캡쳐할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 사용자 입력에 따라 캡쳐 기능을 수행하는 어플리케이이션(예컨대 SmartClip 어플리케이션)을 이용하여 웹 페이지의 적어도 일부 이미지 를 캡쳐할 수 있다. 또한 제1 전자 디바이스 A는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있 다. 캡쳐된 이미지에 대응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 웹 페이지에 대응된 제목, 웹 페이지로 복원할 수 있는 URL, 웹 페이지에 대응된 텍스트, 웹 페이지에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 웹 페이지에 대응된 드로잉 메모 정보, 웹 페이지에 대응된 필기 인식 결과 정보, 웹 페이지에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 웹 페이지에서 이용되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 웹 페이지와 관련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 웹 페이지의 메인 페이지 내의 서브 페 이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A는 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트 로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 미 리 정해진 형식의 데이터는 스크랩북 어플리케이션과 관련된 DB에 저장될 수 있다. 제1 전자 디바이스 A 는 스크랩북 어플리케이션과 관련된 DB에 저장된 데이터들 중 사용자로부터 제2 공유 서버에 업로드될 데 이터를 선택받을 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 업로드될 데이터를 선택받을 수 있는 옵션을 제공할 수 있다. 제1 전자 디바이스 A는 사용자에 의해 업로드될 데이터가 선택되면 제2 공 유 서버에 데이터를 업로드하고, 업로드된 데이터의 URL을 요청할 수 있다. 제2 공유 서버는 업로 드된 데이터를 저장하고, 업로드된 데이터를 엑세스할 수 있도록 하는 업로드된 데이터의 URL을 생성하여 제1 전자 디바이스 A에 전달할 수 있다. 제1 전자 디바이스 A는 사용자로부터 업로드된 데이터의 URL 공유 요청을 입력받을 수 있다. 만약 업로드된 데이터의 URL 공유 요청이 입력되면 제1 전자 디바이스 A 는 업로드된 데이터의 URL 공유 방식을 선택할 수 있다. 한 실시 예에 따르면 업로드된 데이터의 URL 공유 방식 은 메일 전송 방식, 메시지 전송 방식(SMS,MMS 등), 채팅 메시지 전송 방식(chat on), WIFI direct 전송 방식 중 어느 하나의 전송 방식일 수 있다. 이 외에도 전송 방식은 URL 을 전송할 수 있는 전송 방식이면 어느 것이 나 가능할 수 있다. 제1 전자 디바이스 A는 상기 선택된 전송 방식으로 업로드된 데이터의 URL을 제2 전 자 디바이스 B에 전송할 수 있다. 제2 전자 디바이스 B는 업로드된 데이터의 URL이 포함된 메시지 를 수신할 수 있다. 제2 전자 디바이스 B는 업로드된 데이터의 URL에 접속을 하기 위해 웹 브라우져 어플 리케이션을 실행할 수 있고 업로드된 데이터의 URL에 접속하여 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이 미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드 받을 수 있다. 제2 전자 디바이스 B는 다운 로드된 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저 장할 수 있고, 실행할 수 있다. 한 실시 예에 따르면 제2 전자 디바이스 B는 스크랩북 어플리케이션 DB에 다운로드된 캡쳐된 웹 페이지 이미지와 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장할 수 있고, 스크랩북 어플리케이션을 통해 캡쳐된 웹 페이지 이미지에 대응된 실행 경로 정보를 이용하여 해당 웹 페이지 화면이 표시되도록 실행할 수 있다. 또한 한 실시 예에 따르면 제1 전자 디바이스 A는 동영상 재생 서비스 어플리케이션 실행 화면 표시 중 예컨대 유투브 화면 표시 중 적어도 일부 이미지가 캡쳐된 경우, 캡쳐된 동영상 재생 서비스 화면의 적어도 일 부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이 터를 제1 공유 서버를 통해 제2 공유 서버에 업로드하고, 제2 공유 서버로부터 업로드된 데 이터의 URL을 수신하여 제2 전자 디바이스 B에 제공할 수 있다. 예를 들면, 제1 전자 디바이스 A는 사용자 입력에 따라 캡쳐 기능을 수행하는 어플리케이이션을 이용하여 동영상 재생 서비스 화면의 적어도 일부 이미지를 캡쳐할 수 있다. 이하 설명에서는 캡쳐된 동영상 재생 서비스 화면 이미지 또는 캡쳐된 캡쳐된 동영상 재생 서빗 화면 이미지에서 크롭된 일부 이미지를 캡쳐된 이미지라고 설명할 수 있다. 또한 제1 전자 디바이스 A1는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지 에 대응된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따 르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이 터는 동영상 재생 서비스에 대응된 제목, 동영상 재생 서비스로 복원할 수 있는 URL, 동영상 재생 서비스에 대 응된 텍스트, 동영상 재생 서비스에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 동영상 재 생 서비스에 대응된 드로잉 메모 정보, 동영상 재생 서비스에 대응된 필기 인식 결과 정보, 동영상 재생 서비스 에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 동영상 재생 서비스 화면에서 이용되는 동영상에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 동영상 재생 서비스 화면과 관련된 동영상 파일에 대한 직접 링크일 수 있다. 또한 립 링 크 정보는 동영상 재생 서비스 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A는 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서 비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함 하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스 A는 스크랩북 어플리케이션과 관련된 DB에 저장된 데이터들 중 사용자로부터 제2 공유 서버에 업로드될 데이터 즉, 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재 생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 선택받을 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 업로드될 데이터를 선택받을 수 있는 옵션을 제공할 수 있다. 제1 전자 디바이스 A는 사용자에 의해 업로드될 데이터가 선택되면 제2 공유 서버에 데이터를 업로드하 고, 업로드된 데이터의 URL을 요청할 수 있다. 제2 공유 서버는 업로드된 데이터를 저장하고, 업로드된 데이터를 엑세스할 수 있도록 하는 업로드된 데이터의 URL을 생성하여 제1 전자 디바이스 A에 전달할 수 있다. 제1 전자 디바이스 A는 사용자로부터 업로드된 데이터의 URL 공유 요청을 입력받을 수 있다. 만약 업로드된 데이터의 URL 공유 요청이 입력되면 제1 전자 디바이스 A는 업로드된 데이터의 URL 공유 방식을 선택할 수 있다. 한 실시 예에 따르면 업로드된 데이터의 URL 공유 방식은 메일 전송 방식, 메시지 전송 방식 (SMS,MMS 등), 채팅 메시지 전송 방식(chat on), WIFI direct 전송 방식 중 어느 하나의 전송 방식일 수 있다. 이 외에도 전송 방식은 URL 을 전송할 수 있는 전송 방식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스 A는 상기 선택된 전송 방식으로 업로드된 데이터의 URL을 제2 전자 디바이스 B에 전송할 수 있다. 제2 전자 디바이스 B는 업로드된 데이터의 URL이 포함된 메시지를 수신할 수 있다. 제2 전자 디바이스 B는 업로드된 데이터의 URL에 접속을 하기 위해 웹 브라우져를 실행할 수 있고 웹 브라우져를 통해 업로 드된 데이터의 URL에 접속하여 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서 비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 다운로드 받을 수 있다. 제2 전 자 디바이스 B는 다운로드된 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재 생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장할 수 있고, 실행할 수 있다. 한 실시 예에 따르면 제2 전자 디바이스 B는 스크랩북 어플리케이션 DB에 다운로드된 캡쳐된 동 영상 재생 서비스 화면의 적어도 일부 이미지와 캡쳐된 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응 된 실행 경로 정보를 저장할 수 있고, 스크랩북 어플리케이션을 통해 동영상 재생 서비스 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 이용하여 동영상 서비스 화면이 표시되도록 실행할 수 있다. 또한 한 실시 예에 따르면 제1 전자 디바이스 A는 음악 재생 어플리케이션 실행 화면 표시 중 예컨대 음 악 재생 화면의 적어도 일부 이미지가 캡쳐된 경우, 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음 악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 공유 서버에 업로 드하고, 제2 공유 서버로부터 업로드된 데이터의 URL을 수신하여 제2 전자 디바이스 B에 제공할 수 있다. 예를 들면, 제1 전자 디바이스 A는 사용자 입력에 따라 캡쳐 기능을 수행하는 어플리케이션을 이용하여 음악 재생 어플리케이션 실행 화면의 적어도 일부 이미지를 캡쳐할 수 있다. 이하 설명에서는 캡쳐된 음악 재생 화면 전체 이미지 또는 캡쳐된 음악 재생 화면에서 크롭된 일부 이미지를 캡쳐된 이미지라고 설명할 수 있다. 제1 전자 디바이스 A는 캡쳐된 이미지에 대응된 실행 경로 정보를 획득할 수 있다. 캡쳐된 이미지에 대응 된 실행 경로 정보는 캡쳐된 이미지의 상태를 실행할 수 있는 정보를 포함할 수 있다. 한 실시 예에 따르면 캡 쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 음 악 재생 화면에 대응된 제목, 음악 재생 화면으로 복원할 수 있는 URL, 음악 재생 화면에 대응된 텍스트, 음악 재생 화면에 대응된 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일), 음악 재생 화면에 대응된 드로잉 메모 정보, 음악 재생 화면에 대응된 필기 인식 결과 정보, 음악 재생 화면에 대응된 클립 위치 정보 등을 포함 할 수 있다. 한 실시 예에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 음악 재생 화면에서 이용되는 음악 파일에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 음악 재생 화면과 관 련된 동영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 음악 재생 화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 제 1 전자 디바이스 A는 음악 재생 화면에 대응된 원본 오디오 파일을 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 함께 데이터에 포함시킬 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정 보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르 면 미리 정해진 형식의 데이터는 스크랩북 어플리케이션과 관련된 DB에 저장될 수 있다. 제1 전자 디바이스 A는 스크랩북 어플리케이션과 관련된 DB에 저장된 데이터들 중 사용자로부터 제2 공유 서버에 업로드될 데이터 즉, 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적 어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보와 오디오 파일을 포함하는 데이터 를 선택받을 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 업로드될 데이터를 선택받을 수 있는 옵션을 제공할 수 있다. 제1 전자 디바이스 A는 사용자에 의해 업로드될 데이터가 선택되면 제2 공유 서 버에 데이터를 업로드하고, 업로드된 데이터의 URL을 요청할 수 있다. 제2 공유 서버는 업로드된 데이터를 저장하고, 업로드된 데이터를 엑세스할 수 있도록 하는 업로드된 데이터의 URL을 생성하여 제1 전자 디바이스 A에 전달할 수 있다. 제1 전자 디바이스 A는 사용자로부터 업로드된 데이터의 URL 공유 요청을 입력받을 수 있다. 만약 업로드된 데이터의 URL 공유 요청이 입력되면 제1 전자 디바이스 A는 업 로드된 데이터의 URL 공유 방식을 선택할 수 있다. 한 실시 예에 따르면 업로드된 데이터의 URL 공유 방식은 메 일 전송 방식, 메시지 전송 방식(SMS,MMS 등), 채팅 메시지 전송 방식(chat on), WIRI direct 전송 방식 중 어 느 하나의 전송 방식일 수 있다. 이 외에도 전송 방식은 ULR 을 전송할 수 있는 전송 방식이면 어느 것이나 가 능할 수 있다. 제1 전자 디바이스 A는 상기 선택된 전송 방식으로 업로드된 데이터의 URL을 제2 전자 디 바이스 B에 전송할 수 있다. 제2 전자 디바이스 B는 업로드된 데이터의 URL이 포함된 메시지를 수 신할 수 있다. 제2 전자 디바이스 B는 업로드된 데이터의 URL에 접속을 하기 위해 웹 브라우져 어플리케 이션을 실행할 수 있고 웹 브라우져를 통해 업로드된 데이터의 URL에 접속하여 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경 로 정보와 오디오 파일을 데이터를 다운로드 받을 수 있다. 제2 전자 디바이스 B는 다운로드된 캡쳐된 음 악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터 또는 오디오 데이터를 더 포함하는 데이터를 저장할 수 있고, 실행할 수 있다. 한 실시 예에 따르면 제2 전자 디바이스 B는 스크랩북 어플리케이션 DB에 다운로드된 캡쳐된 음악 재생 화면의 적어도 일부 이미지와 캡쳐된 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저 장할 수 있고, 스크랩북 어플리케이션을 통해 음악 재생 화면의 적어도 일부 이미지에 대응된 실행 경로 정보를 이용하여 해당 음악이 재생되도록 실행할 수 있다. 도 17은 본 발명의 제3 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 개념을 나타낸 도면이다. 도 17를 참조하면, 제1 전자 디바이스 A는 어플리케이션 실행 중 어플리케이션 실행 화면에서 캡쳐된 이 미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 통신 네트워크를 통해 제2 전자 디 바이스 B에 직접 전달하여 공유할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 캡쳐된 이 미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 원본 그대로 이미지 및 텍스트로 이루어진 형식의 데이터로 제2 전자 디바이스 B에 전달하거나, 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 일정한 데이터 형식으로 예컨대 스크랩북 파일(SCC) 형식의 데이터로 변환하여 전달 할 수 있다. 도 18은 본 발명의 제3 실시 예에 따른 전자 디바이스들 사이에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실 행 경로 정보 공유하는 동작을 나타낸 도면이다. 도 18을 참조하면, 제1 전자 디바이스 A는 1802 동작에서 어플리케이션 실행 화면에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 저장할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 미리 정해진 형식의 데이터로 저장할 수 있다. 한 실시 예에 따르면 미리 정해진 형식의 데이터는 스크랩북 파일(SCC) 형식의 데이터이거나 이미지 및 텍스트로 이루어진 형식의 데이터일 수 있다. 이 외에도 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실 행 경로 정보를 포함하는 데이터의 형식은 공유 가능한 데이터 형식이면 어느 것이나 가능할 수 있다. 한 실시 예에 따르면 캡쳐된 이미지에 대응된 실행 경로 정보는 메타 데이터를 포함할 수 있다. 한 실시 예에 따르면 메타 데이터는 어플리케이션 실행 화면에 대응된 제목, 어플리케이션 실행 화면으로 복원할 수 있는 URL, 어플리케이션 실행 화면에 대응된 텍스트, 어플리케이션 실행 화면에 대응된 데이터 파일(음악 파일, 비디 오 파일 또는 이미지 파일), 어플리케이션 실행 화면에 대응된 드로잉 메모 정보, 어플리케이션 실행 화면에 대 응된 필기 인식 결과 정보, 어플리케이션 실행 화면에 대응된 클립 위치 정보 등을 포함할 수 있다. 한 실시 예 에 따르면 메타 데이터는 딥 링크 정보를 더 포함할 수 있다. 딥 링크 정보는 어플리케이션 실행 화면에서 이용 되는 리소스에 다이렉트로 엑세스할 수 있는 정보일 수 있다. 예를 들면, 어플리케이션 실행 화면과 관련된 동 영상 파일, 사운드, 이미지 등의 리소스에 대한 직접 링크일 수 있다. 또한 립 링크 정보는 어플리케이션 실행화면의 메인 페이지 내의 서브 페이지에 엑세스할 수 있는 정보일 수 있다. 제1 전자 디바이스 A는 1804 동작에서 사용자 입력에 의한 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터의 공유 요청을 수신할 수 있다. 만약 사용자로부터 데이터 공유 요청이 수신되면 제1 전자 디바이스 A는 1806 동작에서 데이터 공유 방식 을 선택할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 캡쳐된 이미지와 캡쳐된 이미지에 대응 된 실행 경로 정보를 포함하는 데이터를 원본 그대로 공유할 것인지 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 일정한 데이터 형식으로 변환하여 공유할 것인지 판단할 수 있다. 한 실시 예에 따르면 원본 그대로 공유하는 경우 캡쳐된 이미지 원본(예컨대 PNG 형식의 이미지 또는 JPG 형식의 이미지)과 텍스트 형태의 캡쳐된 이미지에 대응된 실행 경로 정보를 공유할 수 있다. 또한 데이터를 일정한 형 식으로 변환하여 공유하는 경우 캡쳐된 이미지 원본(예컨대 PNG 형식의 이미지 또는 JPG 형식의 이미지)과 캡쳐 된 이미지에 대응된 실행 경로 정보를 한 개의 파일 예컨대 스크랩 데이터(SCC) 파일로 변환하여 공유할 수 있 다. 제1 전자 디바이스 A는 1808 동작에서 데이터 전송 방식을 선택할 수 있다. 한 실시 예에 따르면 제1 전 자 디바이스 A는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 복수의 데이터 전송 방식 중 어떤 데이터 전송 방식을 통해 전송할 것인지 사용자로부터 선택받을 수 있다. 한 실시 예 에 따르면 데이터 전송 방식은 이메일 전송 방식, 메시지 전송 방식(SMS, MMS 등), 채팅 메시지 전송 방식(Chat on), WIFI direct 전송 방식 등 다양한 전송 방식 중 적어도 하나일 수 있다. 이 외에도 데이터를 전송할 수 있 는 방식이면 어느 것이나 가능할 수 있다. 제1 전자 디바이스 A는 1810 동작에서 상기 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 전자 디바이스 B로 전송할 수 있다. 한 실시 예에 따르면 제1 전자 디바이스 A는 선택된 데이터 공유 방식과 선택된 데이터 전송 방식으로 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 제2 전자 디바이스 B로 전송할 수 있다. 제2 전자 디바이스 B는 1812 동작에서 제1 전자 디바이스 A로부터 캡쳐된 이미지와 캡쳐된 이미지 에 대응된 실행 경로 정보를 포함하는 데이터를 수신하여 저장함으로써, 제1 전자 디바이스 A와 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터를 공유할 수 있다. 본 발명의 다양한 실시 예에 따르면 전자 디바이스는 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 공유하기 위해 다양한 사용자 인터페이스 화면을 제공할 수 있다. 도 19 내지 도 22는 본 발명의 실시 예에 따른 전자 디바이스에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실 행 경로 정보를 공유하기 위한 사용자 인터페이스 화면을 나타낸 도면이다. 도 19를 참조하면, 전자 디바이스는 도 19의 (a)에 도시된 바와 같이 스크랩북 어플리케이션 실행 화면 에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 포함하는 데이터(이하 ‘스크랩 데이터 ’라고도 함)들을 표시할 수 있다. 사용자는 스크랩북 어플리케이션 실행 화면에 표시된 스크랩 데 이터들 중 공유하기를 원하는 스크랩 데이터를 선택할 수 있다. 전자 디바이스는 사용자에 의해 공유하고자 하는 스크랩 데이터가 선택되면 도 19의 (b)에 도시된 바와 같 이 선택된 스크랩 데이터의 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보를 나타내는 스크랩 데이터 화면을 표시할 수 있다. 스크랩 데이터 화면에는 스크랩 데이터에 태그 정보를 추가 할 수 있는 입력란이 더 표시될 수 있고, 스크랩 데이터를 공유 요청할 수 있는 공유 아이콘이 더 표시될 수 있다. 전자 디바이스는 사용자에 의해 공유 아이콘이 선택되면 도 19의 (c)에 도시된 바와 같이 스크랩 데 이터를 어떤 파일 형식으로 공유할지 선택할 수 있는 파일 형식 선택 윈도우를 표시할 수 있다. 파일 형 식 선택 윈도우에는 이미지 및 텍스트로 이루어진 파일 형식과 스크랩북 데이터(SCC) 형식등 과 같은 파일 형식이 포함될 수 있다. 사용자는 파일 형식 선택 윈도우에서 스크랩 데이터의 파일 형식을 선택할 수 있다. 도 20을 참조하면, 전자 디바이스는 도 20의 (a)와 같은 파일 형식 선택 윈도우에서 사용자에 의해 이미지 및 텍스트로 이루어진 파일 형식을 선택받을 수 있다. 전자 디바이스는 이미지 및 텍스트로 이루어진 파일 형식이 선택되면 전자 디바이스는 도 20의 (b)에 도시된 바와 같이 스크랩 데이터 전송 방식을 선택할 수 있는 전송 방식 선택 윈도우를 표시할 수 있다. 전송 방식 선택 윈도우에는 이메일 전송 방식, 메시지 전송 방식(SMS, MMS 등), 채팅 메시지 전송 방식(Chat on), WIFI direct 전송 방식 등 다양한 전송 방식에 해당하는 아이콘들이 표시될 수 있다. 사용자는 전송 방식 선택 윈도우에서 스크 랩 데이터의 전송 방식을 선택할 수 있다. 전자 디바이스는 다양한 전송 방식 중 메시지 전송 방식 이 선택되면 도 20의 (c)에 도시된 바와 같이 메시지 전송 어플리케이션을 실행하고 메시지 전송 어플리케이션 화면을 표시할 수 있다. 전자 디바이스는 메시지 전송 어플리케이션 화면에서 스크랩 데이터 를 메시지 전송 어플리케이션 화면의 첨부파일 영역에 포함시키고, 메시지 작성 영역에 사용 자의 메시지를 입력받아 스크랩 데이터를 공유할 공유 대상 전자 디바이스에게 메시지 전송 방식으로 전송할 수 있다. 한편, 도 21을 참조하면, 전자 디바이스는 도 21의 (a)와 같은 파일 형식 선택 윈도우에서 사용자에 의해 스크랩북 데이터(SCC) 형식을 선택받을 수 있다. 전자 디바이스는 스크랩북 데이터(SCC) 형식 이 선택되면 전자 디바이스는 도 21의 (b)에 도시된 바와 같이 스크랩 데이터 전송 방식을 선택할 수 있는 전송 방식 선택 윈도우를 표시할 수 있다. 전송 방식 선택 윈도우에는 이메일 전송 방식, 메시지 전송 방식(SMS, MMS 등), 채팅 메시지 전송 방식(Chat on), WIFI direct 전송 방식 등 다양한 전송 방 식에 해당하는 아이콘들이 표시될 수 있다. 사용자는 전송 방식 선택 윈도우에서 스크랩 데이터의 전송 방식을 선택할 수 있다. 전자 디바이스는 다양한 전송 방식 중 메일 전송 방식이 선택되면 도 21의 (c)에 도시된 바와 같이 메일 전송 어플리케이션을 실행하고 메일 전송 어플리케이션 화면을 표시할 수 있다. 전자 디바이스는 메일 전송 어플리케이션 화면에서 스크랩 데이터를 메일 전송 어플리케이션 화면의 첨부파일 영역에 포함시키고, 메일 내용 작성 영역에 사용자로부터 메일 내용을 입력 받아 스크랩 데이터를 공유할 공유 대상 전자 디바이스에게 메일 전송 방식으로 전송할 수 있다. 도 22를 참조하면, 전자 디바이스는 다른 전자 디바이스로부터 스크랩 데이터를 다양한 전송 방식으로 수 신받아 저장함으로써 공유할 수 있다. 한 실시 예에 따르면 전자 디바이스는 메일 전송 방식을 통해 스크 랩 데이터를 수신하는 경우 도 22의 (a)와 같이 메일 수신 화면에서 첨부 파일에 포함된 스크랩 데이터 를 저장 버튼를 선택하여 저장할 수 있다. 전자 디바이스는 스크랩 데이터 저장 버튼이 선택되면 도 22의 (b)와 같이 데이터 저장 화면을 통해 스크랩 데이터를 저장할 수 있다. 전자 디 바이스는 저장된 스크랩 데이터가 선택되면 도 22의 (c)에 도시된 바와 같이 스크랩 데이터를 어느 카테고리에 저장할지 선택할 수 있는 카테고리 선택화면을 표시할 수 있다. 전자 디바이스는 카테고 리 선택화면에서 사용자에 의해 카테고리(예컨대 ‘New’)가 선택되면 도 22의 (d)에 도시된 바와 같이 ‘New’카테고리에 스크랩 데이터를 저장함으로써 송신측과 스크랩 데이터를 공유할 수 있다. 한 실시 예에 따르면 스크랩 데이터는 SCC 파일일 수 있다. 도 23은 본 발명의 실시 예에 따른 SCC 파일 구조를 나타낸 도면이다. 도 23을 참조하면, SCC 파일은 “ fileName.SCC “와 같은 파일일 수 있다. SCC 파일은 Mimetype, appname, appicon.png, thumbnail.png, META-INF, CONTENTS, HTML을 포함할 수 있다. Mimetype은 어플별 이름을 나타내는 정보일 수 있다. 예를 들면, application/vnd.samsung.SCC.을 Prefix로 하여 App별 이름을 그 뒤에 붙인 정보로서 “Scrapbook : application/vnd.samsung.SCC.pinall”일 수 있다. appname은 확장자 없는 텍스트 파일로서 스크랩 데이터에 대응된 어플리케이션 이름일 수 있다. 통합 뷰 어에서 어플리케이션 이름이 표시될 수 있다. appicon.png는 스크랩 데이터에 대응된 어플리케이션의 아이콘 파일일 수 있다. 통합 뷰어에서 해당 아이 콘이 표시될 수 있다. thumbnail.png는 스크랩 데이터의 썸네일 이미지일 수 있다. Png 파일 외에 jpg 파일일 수도 있다. META-INF는 메타 데이터들이 저장된 위치로서 메타 데이터를 포함할 수 있다. 메타 데이터들이 저장된 위 치 정보가 해당 어플리케이션에 제공될 수 있다. 메타 데이터의 형식은 XML, JSON 파일들로 구성될 수 있다. 각 XML, JSON파일 구성 및 파일 내의 형식은 각 어플리케이션에서 정의될 수 있다. CONTENTS는 원본 멀티미디어 파일들이 저장된 위치로서, 예를 들면, Image, Audio, Video파일의 원본 파 일들이 HTML 파일에서 상대경로를 통해 링크될 수 있다.HTML은 통합 뷰어에서 화면을 구성할 수 있도록 HTML파일 및 HTML파일에서 사용하는 리소스(font, css, js)들일 수 있다. HTML 폴더에는 필수 파일인 index.html이 포함될 수 있으며, 그외에 추가로 필요한 html파일 들도 저장될 수 있다. HTML은 HTML5 규약을 준수할 수 있고, CSS 규약을 준수할 수 있다. 또한 HTML은 JavaScript를 지원할 수 있다. 도 24는 본 발명의 실시 예에 따른 SCC 파일에 포함된 META-INF를 나타낸 도면이다. 도 24를 참조하면, META-INF는 JSON 파일 구조로 이루어질 수 있다. META-INF는 카테고리 이름, 컨텐츠 시작 (스크랩 데이터 시작), 컨텐츠 타입(스크랩 데이터 타입), 썸네일 이미지 경로, 캡쳐된 이미 지 경로, 캡쳐된 이미지 width, 캡쳐된 이미지의 height, 이미지가 캡쳐된 시간, 캡 쳐된 이미지 크롭 방식(예컨대 0:자유 곡선, 1: 정사각형, 2:자유 곡선 중 자동보정, 3. 스크랩부커에 의 한 크롭 등), 메타 데이터를 포함할 수 있다. 도 25는 본 발명의 실시 예에 따른 메타 데이터를 나타낸 도면이다. 도 26을 참조하면, 메타 데이터는 meta key, meta value, meta value type으로 구분될 수 있다. meta key는 메타 데이터의 종류를 나타내는 key일 수 있다. meta value는 각 메타 데이터의 종류를 나타내는 key에 해당하는 값일 수 있다. meta value type은 메타 데이터의 종류를 나타내는 key의 데이터 타입일 수 있다. 한 실시 예에 따르면 메타 데이터의 종류를 나타내는 key는 title, plain_text, app_deep_link, url, file_path_audio, file_path_video, file_path_image, file_path_drawing_memo, file_path_spd, dm_hand_write_text, location 을 포함할 수 있다. Title은 캡쳐된 이미지에 대응된 어플리케이션 실행 화면에 대응된 제목일 수 있다. plain_text는 캡쳐된 이미 지에 대응된 텍스트일 수 있다. app_deep_link는 캡쳐된 이미지에 대응된 어플리케이션 실행 화면으로 복원할 수 있는 URL일 수 있다. url은 캡쳐된 이미지에서 획득된 url 정보일 수 있다, file_path_audio, file_path_video 및 file_path_image는 캡쳐된 이미지에 대응된 어플리케이션 실행 화면과 관련된 원본 데이터 파일(음악 파일, 비디오 파일 또는 이미지 파일)의 경로 일 수 있다. file_path_drawing_memo는 캡쳐된 이미지 에 대응된 드로잉 메모 정보일 수 있다. file_path_spd은 드로잉 메모 경로 정보일 수 있다. dm_hand_write_text는 캡쳐된 이미지에 대응된 필기 인식 결과 정보일 수 있다. Location은 캡쳐된 이미지에 대 응된 클립 위치 정보일 수 있다. 전술한 바와 같은 본 발명의 다양한 실시 예들에 따르면 사용자의 전자 디바이스에서 캡쳐된 화면 이미지와 화 면 캡쳐 시의 화면을 실행시킬 수 있는 실행 경로 정보를 동일 사용자의 다른 전자 디바이스 또는 다른 사용자 의 전자 디바이스와 공유하여 동일 사용자의 다른 전자 디바이스 또는 다른 사용자의 전자 디바이스에서도 캡쳐 된 화면 이미지를 이용하여 화면 캡쳐 시의 화면을 실행시킬 수 있도록 할 수 있다.본 발명의 다양한 실시예에 따른 방법들은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으 로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 분야에서 통상의 지식을 가진 자에게 공지되어 사용 가능한 것일 수도 있 다. 본 발명의 실시예에 따른 캡쳐 이미지 이용 방법은 하드웨어, 소프트웨어 또는 하드웨어 및 소프트웨어의 조합 의 형태로 실현 가능하다는 것을 알 수 있을 것이다. 이러한 임의의 소프트웨어는 예를 들어, 삭제 가능 또는 재기록 가능 여부와 상관없이, ROM 등의 저장 장치와 같은 휘발성 또는 비휘발성 저장 장치, 또는 예를 들어, RAM, 메모리 칩, 장치 또는 집적 회로와 같은 메모리, 또는 예를 들어 CD, DVD, 자기 디스크 또는 자기 테이프 등과 같은 광학 또는 자기적으로 기록 가능함과 동시에 기계(예를 들어, 컴퓨터)로 읽을 수 있는 저장 매체에 저장될 수 있다. 본 발명의 실시 예에 따른 캡쳐 이미지 이용 방법은 제어부 및 메모리를 포함하는 컴퓨터 또는 전자 디바이스에 의해 구현될 수 있고, 상기 메모리는 본 발명의 실시 예들을 구현하는 지시들을 포함하는 프로 그램 또는 프로그램들을 저장하기에 적합한 기계로 읽을 수 있는 저장 매체의 한 예임을 알 수 있을 것이다. 따 라서, 본 발명의 실시 예들은 본 명세서의 임의의 청구항에 기재된 장치 또는 방법을 구현하기 위한 코드를 포 함하는 프로그램 및 이러한 프로그램을 저장하는 기계(컴퓨터 등)로 읽을 수 있는 저장 매체를 포함한다. 또한, 이러한 프로그램은 유선 또는 무선 연결을 통해 전달되는 통신 신호와 같은 임의의 매체를 통해 전자적으로 이 송될 수 있고, 본 발명은 이와 균등한 것을 적절하게 포함한다. 또한, 본 발명의 실시예들에 따른 전자 디바이스는 유선 또는 무선으로 연결되는 프로그램 제공 장치로부터 상 기 프로그램을 수신하여 저장할 수 있다. 상기 프로그램 제공 장치는 상기 본 발명의 다양한 실시 예들에 따른캡쳐 이미지 이용에 따른 방법을 수행하도록 하는 지시들을 포함하는 프로그램을 저장하기 위한 메모리와, 상기 전자 디바이스와 유선 또는 무선 통신을 수행하기 위한 통신부와, 상기 전자 디바이스의 요청 또는 자동으로 해 당 프로그램을 상기 통신부를 통하여 전송되도록 제어하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2014-0049459", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 전자 디바이스의 블록 구성도 도 2는 본 발명의 실시 예에 따른 전자 디바이스의 캡쳐 이미지 이용 동작을 나타낸 흐름도 도 3은 본 발명의 실시 예에 따른 어플리케이션 프레임워크와 어플리케이션을 설명하기 위한 도면 도 4는 본 발명의 실시 예에 따라 어플리케이션 프레임워크를 통해 실행 경로 정보를 획득하는 동작을 나타낸 흐름도 도 5는 본 발명의 실시 예에 따른 클래스 오브젝트에 포함 될 수 있는 정보들 중 캡쳐된 화면의 상태를 실행하 는데 필요한 정보의 일 예를 나타낸 도면 도 6은 본 발명의 실시 예에 따라 어플리케이션을 통해 실행 경로 정보를 획득하는 동작을 나타낸 흐름도 도 4는 본 발명의 실시 예에 따라 어플리케이션 프레임워크를 통해 실행 경로 정보를 획득하는 동작을 나타낸 흐름도 도 5는 본 발명의 실시 예에 따른 클래스 오브젝트에 포함 될 수 있는 정보들 중 캡쳐된 화면의 상태를 실행하 는데 필요한 정보의일 예를 나타낸 도면 도 6은 본 발명의 실시 예에 따라 어플리케이션을 통해 실행 경로 정보를 획득하는 동작을 나타낸 흐름도 도 7은 본 발명의 실시 예에 따른 캡쳐된 화면의 적어도 일부분을 선택하는 동작의 예를 설명하기 위한 도면 도 8a는 본 발명의 실시 예에 따른 전자 디바이스에서 어플리케이션 화면 캡쳐하고 캡쳐된 화면의 실행 경로 정 보를 획득하는 개념을 나타낸 도면 도 8b는 본 발명의 실시 예에 따른 전자 디바이스에서 캡쳐된 화면의 실행 경로 정보를 이용하여 동작하는 개념 을 나타낸 도면 도 9는 본 발명의 실시 예에 따른 전자 디바이스에서 웹 브라우져 어플리케이션 실행 중 캡쳐된 이미지 이용 예 를 나타낸 도면 도 10은 본 발명의 실시 예에 따른 전자 디바이스에서 음악 재생 어플리케이션 실행 중 캡쳐된 이미지 이용 예 를 나타낸 도면 도 11은 본 발명의 실시 예에 따른 전자 디바이스에서 클립 어플리케이션 실행 중 캡쳐된 이미지 이용 예를 나 타낸 도면 도 12는 본 발명의 실시 예에 따른 디바이스에서 캡쳐된 이미지 공유 동작을 나타낸 도면 도 13은 본 발명의 제1 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템을 나타낸 도면 도 14는 본 발명의 제1 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템의 동작을 나타낸 도면 도 15는 본 발명의 제2 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템을 나타낸 도면 도 16은 본 발명의 제2 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 시스템의동작을 나타낸 도면 도 17은 본 발명의 제3 실시 예에 따른 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실행 경로 정보 공유 개념을 나타낸 도면 도 18은 본 발명의 제3 실시 예에 따른 전자 디바이스들 사이에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실 행 경로 정보 공유하는 동작을 나타낸 도면 도 19 내지 도 22는 본 발명의 실시 예에 따른 전자 디바이스에서 캡쳐된 이미지와 캡쳐된 이미지에 대응된 실 행 경로 정보를 공유하기 위한 사용자 인터페이스 화면을 나타낸 도면 도 23은 본 발명의 실시 예에 따른 SCC 파일 구조를 나타낸 도면 도 24는 본 발명의 실시 예에 따른 SCC 파일에 포함된 META-INF를 나타낸 도면 도 25는 본 발명의 실시 예에 따른 메타 데이터를 나타낸 도면"}
