{"patent_id": "10-2024-7019815", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0108476", "출원번호": "10-2024-7019815", "발명의 명칭": "스택 내의 복수의 전극 시트의 증착 정확도를 결정하는 방법 및 측정 장치", "출원인": "폭스바겐 악티엔게젤샤프트", "발명자": "마수흐 슈테펜"}}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 양극 시트(1), 하나의 음극 시트(2) 및 하나의 분리막 시트(3)를 각각 포함하는 복수의 전극 시트(1, 2, 3)의 증착 정확도를 결정하는 방법에 있어서, 상기 전극 시트(1, 2, 3)는 서로 평행한 평면(4)으로 연장되고 서로의 상부에 적층되어 배열되어 스택(5)을 형성하며; 상기 증착 정확도는 상기 스택(5) 내의 상기 양극 시트(1), 상기 음극 시트(2) 또는 상기 분리막 시트(3)의 적어도 경계 가장자리(9)의 각각의 위치(6, 7, 8)를 설명하며; 상기 방법은 적어도 카메라(11) 및 광원(12)을 갖는 측정 장치(10)를 사용하여 수행되고, 적어도:a) 상기 스택(5)을 제공하고 상기 스택(5)을 상기 측정 장치(10)에 배열하는 단계 - 상기 광원(12)과 상기 카메라(11) 사이의 연결 직선(27)은 실질적으로 상기 평면(4)에 평행함 - ;b) 광선(13)이 상기 스택(5)의 적어도 한 영역(14)을 통과하거나 상기 영역(14)으로부터 반사되도록 상기 광원(12)으로 상기 스택(5)을 조명하는 단계 - 상기 광선(13)은 상기 카메라(11)에 의해 검출됨 - ;c) 상기 카메라(11)를 사용하여 상기 스택(5)의 상기 적어도 한 영역(14)의 이미지(15)를 캡처하는 단계;d) 상기 이미지(15)를 평가하고 상기 영역(14)에 배열된 적어도 상기 양극 시트(1), 상기 음극 시트(2) 또는 상기 분리막 시트(3)의 상기 경계 가장자리(9)의 상기 위치(6, 7, 8)를 결정하는 단계를 포함하는 증착 정확도를 결정하는 방법."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 스택(5)은 상기 복수의 전극 시트(1, 2, 3)에 의해 형성된 복수의 측면(16, 17, 18, 19)을 갖고; 단계 a)에서, 상기 스택(5)은, 상기 연결 직선(27)이 서로 180도 미만의 최소 제1 각도(20)로 배열된제1 측면(16)과 제2 측면(17)을 통과하도록, 상기 광원(12)과 상기 카메라(11) 사이에 배열되는 것인, 증착 정확도를 결정하는 방법."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제1 측면(16)과 상기 제2 측면(17)은 서로 인접하게 배열되는 것인, 증착 정확도를 결정하는 방법."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 영역(14)은 상기 인접한 측면(16, 17)에 의해 형성된 상기 스택(5)의 가장자리(25)를 포함하는 것인, 증착 정확도를 결정하는 방법."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서, 단계 d)에서, 상기 양극 시트(1)와 상기 음극 시트(2)의 상기 경계가장자리(9)의 적어도 상기 위치(6, 7, 8)가 결정되는 것인, 증착 정확도를 결정하는 방법."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서, 상기 광원(12)은 가시광선을 생성하는 것인, 증착 정확도를 결정하는 방법."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서, 상기 광선(13)은 적어도 간섭성 또는 시준성이며, 실질적으로 상기평면(4)에 평행하게 진행되는 것인, 증착 정확도를 결정하는 방법."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2024-0108476-3-제1항 내지 제7항 중 어느 한 항에 있어서, 적어도 단계 d)에서는 인공 지능이 사용되는 것인, 증착 정확도를결정하는 방법."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 따른 방법을 수행하기 위한 측정 장치(10)에 있어서, 적어도 카메라(11) 및광원(12)을 포함하고, 서로 평행한 평면(4)으로 연장되는 적층된 전극 시트(1, 2, 3)의 스택(5)은, 상기 광원(12)과 상기 카메라(11) 사이의 연결 직선(27)이 본질적으로 상기 평면(4)에 평행하게 진행되는 방식으로, 상기카메라(11)와 상기 광원(12)에 대해 배열될 수 있는 것인, 측정 장치(10)."}
{"patent_id": "10-2024-7019815", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 적어도 2개의 카메라(11, 21)와 2개의 광원(12, 22)을 포함하고, 상기 스택(5)은 상기 복수의전극 시트(1, 2, 3)에 의해 형성된 복수의 측면(16, 17, 18, 19)을 가지며; 상기 카메라(11, 21)와 상기 광원(12, 22)은, 제1 카메라(11)와 제1 광원(12) 사이의 제1 연결 직선(27)이 서로 180도 미만의 최소 제1각도(20)로 배열된 상기 스택(5)의 제1 측면(16)과 제2 측면(17)을 통과하고 제2 카메라(21)와 제2 광원(22) 사이의제2 연결 직선(27)이 180도 미만의 최소 각도(20)로 서로 배열된 상기 스택(5)의 제3 측면(18)과 제4 측면(19)을 통과하도록, 배열되는 것인, 측정 장치(10)."}
{"patent_id": "10-2024-7019815", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "각각이 적어도 하나의 양극 시트, 하나의 음극 시트 및 하나의 분리막 시트를 포함하는 복수의 전극 시 트(1, 2, 3)의 증착 정확도를 결정하는 방법에 있어서, 전극 시트(1, 2, 3)는 서로 평행한 평면으로 연장되고 서로 적층되어 배열되어 스택을 형성하며; 증착 정확도는 스택 내의 전극 시트(1, 2, 3) 중 하나의 적어도 경계 가장자리의 각각의 위치(6, 7, 8)를 설명하며; 방법은 적어도 카메라 및 광원을 포함하는 측정 장치를 사용하여 수행된다. 방법을 수행하기 위한 측정 장치가 또한 제안된다."}
{"patent_id": "10-2024-7019815", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스택 내의 복수의 전극 시트의 증착 정확도를 결정하는 방법 및 측정 장치에 관한 것이다. 전극 시트 는 서로 평행한 평면으로 연장되고 서로 적층되어 배열되어 스택을 형성한다. 증착 정확도는 스택 내의 전극 시 트의 경계 가장자리의 위치를 서로 관련하여 설명한다."}
{"patent_id": "10-2024-7019815", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "배터리, 특히 리튬 이온 배터리는 자동차에 전력을 공급하는 데 점점 더 많이 사용되고 있다. 배터리는 일반적 으로 셀로 구성되며, 각각의 셀은 양극 시트, 음극 시트 및 가능한 분리막 시트 또는 분리막 재료의 복합체를 갖는다. 이러한 양극 시트, 음극 시트 및 가능한 분리막 시트는 아래에서 전극 시트로 지칭된다. 전극 시트는 일반적으로 펀칭이나 절단, 예를 들어, 레이저 절단에 의해 생성된다. 스택 내의 개별 전극 시트의 증착 정확도는 리튬 이온 배터리 셀의 안전 관련 품질 기준 및 성능에 중요한 영향 을 미친다. 배터리 셀의 전기화학적 성능은 작동 중 전극 커버리지 또는 활물질 커버리지가 적을수록 더 빠르게 감소한다. 또한, 배터리 셀의 단락 및 고장이 양극 시트와 양극 시트 간의 직접적인 접촉에 의해 유발된다. 이 러한 이유로, 스택에서 그리고 배터리 셀의 하우징에 스택을 수용하기 전에 기준을 확인해야 한다. 따라서, 증 착 정확도, 즉 개별 전극 시트의 위치 편차는 좁은 범위 내에서 유지되어야 한다. 증착 정확도를 결정하는 확립된 방법은 컴퓨터 단층 촬영(CT)이다. 긴 시간의 측정을 통해 스택의 3차원 이미지 가 생성된다. CT와 달리 X선을 사용하여 스택 또는 검사 대상의 2차원 이미지를 가능하게 하는 검사 장치도 있다. 컴퓨터 단 층 촬영과 달리, 검사를 더 빠르게 수행할 수 있다. 그러나 이러한 방식으로는 전극 시트의 서로에 대한 위치를 직접 측정하는 것이 아직 가능하지 않다. X선을 사용하기 때문에, 두 방법 모두 높은 투자, 운영 및 유지 비용 으로만 사용할 수 있다. 또한, 포괄적인 방사선 보호가 구현되어야 하며, 이는 해당 방법이 생산 라인에서 제한 된 범위에서만 사용하기에 적합하다는 것을 의미한다. 또한, CT를 사용한 검사는 측정 시간이 길기 때문에 인라 인으로 수행할 수 없다. 또한, 개별 전극 시트의 적층 프로세스 동안 전극 시트의 위치는 미리 기록될 수 있다. 여기에는 적층 프로세스 의 사이클 시간 감소, 높은 데이터 볼륨, 장력이 가해진 스택의 최종 위치를 알 수 없음과 같은 단점이 있다. US 2013/0048340 A1에는 배터리 셀용 전극 및 전극 제조 방법이 개시되어 있다. 캐리어 물질 상에 배열된 활물 질의 가장자리에 대한 광학적 검출도 제안되어 있다. 빛의 다양한 반사가 가장자리의 위치를 검출하는 데 사용 된다.US 2013/0320216 A1에는 전극 상의 이물질을 검출하는 방법이 설명되어 있다. 4㎛ 내지 10㎜ 파장의 빛이 사용 된다. 전극을 생산하는 방법은 US 6,585,846 B1에 알려져 있다. 본 발명의 목적은 언급된 문제 중 적어도 일부를 해결하는 것이다. 특히, 스택 내의 복수의 전극 시트의 증착 정확도를 결정하는 방법이 제안될 것이다. 또한, 증착 정확도를 결정하는 측정 장치가 제안될 것이다. 제1항에 따른 특징을 갖는 방법 및 제9항에 따른 특징을 갖는 측정 장치는 이러한 목적을 해결하는 데 기여한다. 유리한 추가 실시예는 종속항의 주제이다. 청구범위에 개별적으로 나열된 특징은 기술적으로 의미 있 는 방식으로 서로 결합될 수 있고, 상세한 설명로부터의 설명적 사실 및/또는 도면으로부터의 세부사항에 의해 보완될 수 있으며, 그에 따라 본 발명의 추가 실시예가 표시된다. 복수의 전극 시트의 증착 정확도를 결정하는 방법이 제안된다. 전극 시트는 각각 적어도 하나의 양극 시트(또는 복수의 양극 시트), 하나의 음극 시트(또는 복수의 음극 시트) 및 하나의 분리막 시트(또는 복수의 분리막 시트)를 포함한다. 전극 시트는 (실질적으로) 서로 평행한 평면으로 연장되고 서로 적층되어 배열된다. 전극 시 트는 스택을 형성한다. 증착 정확도는 스택 내의 양극 시트, 음극 시트 또는 분리막 시트의 적어도 경계 가장자 리의 각각의 위치를 설명한다. 이 방법은 적어도 카메라 및 광원을 포함하는 측정 장치를 사용하여 수행된다. 이 방법은 적어도 다음 단계를 포함한다: a) 측정 장치에 스택을 제공하고 스택을 배열하는 단계 - 광원과 카메라 사이의 연결 직선은 실질적으로 평면에 평행함 - ; b) 광선이 스택의 적어도 한 영역을 통과하거나 해당 영역으로부터 반사되도록 광원으로 스택을 조명하는 단계 - 광선은 카메라에 의해 검출됨 - ; c) 카메라를 사용하여 스택의 적어도 한 영역의 이미지(또는 다수의 이미지)를 캡처하는 단계; d) 이미지(또는 복수의 이미지)를 평가하고 해당 영역에 배열된 적어도 양극 시트, 음극 시트 또는 분리막 시트 의 경계 가장자리의 위치를 결정하는 단계. 프로세스 단계를 a) 내지 d)로 분류하는 위의 (비완전) 분류는 주로 차별화를 위한 것일 뿐이며, 임의의 순서 및/또는 종속성을 강제하기 위한 것은 아니다. 프로세스 단계의 빈도는, 예를 들어, 프로세스 실행 중에 달라질 수도 있다. 프로세스 단계가 시간적으로 적어도 부분적으로 겹치는 것도 가능하다. 프로세스 단계 a)는 단계 b) 내지 d) 이전에 수행되는 것이 특히 바람직하다. 특히, 단계 b)와 c)는 적어도 부분적으로 서로 평행하게 수행 된다. 특히, 단계 d)는 단계 b) 이후에 수행된다. 특히, 단계 a) 내지 d)는 지정된 순서로 수행된다. 이 방법은 특히 배터리 셀 제조 프로세스의 일부로 사용된다. 적절한 형상으로 절단된 전극 시트, 즉 적어도 하 나의 양극 시트, 적어도 하나의 음극 시트 및/또는 적어도 하나의 분리막 시트는 미리 결정된 순서로 배열되어 스택을 형성하고 서로 정렬된다. 이러한 방식으로 생성된 스택에서, 개별(동일한) 전극 시트의 경계 가장자리는 서로에 대해 가능한 한 정렬된 위치에 배열되어야 한다. 특히, 전극 시트는 서로 평행한 평면으로 연장되고 서로 적층되면 스택을 형성한다. 특히, 스택은 적어도 2개의 전극 시트, 즉 적어도 하나의 양극 시트/음극 시트 및 하나의 분리막 시트를 포함한다. 바람직하게는, 스택은 적어도 하나의 양극 시트, 적어도 하나의 음극 시트 및 이들 사이에 배열된 분리막 시트를 포함한다. 특히, 전극 시트는 각각 실질적으로 직사각형 형상을 갖는다. 필요한 경우 어레스터 탭이 이 직사각형 형상 너 머로 연장된다. 이들은 일반적으로 코팅되지 않고, 즉 활물질로 코팅되지 않고, 각각의 전극 시트, 즉 양극 또 는 음극 시트의 전기적 접촉에 사용된다. 증착 정확도는 특히 스택 내의 양극 시트, 음극 시트 및/또는 분리막 시트 또는 양극 시트, 음극 시트 또는 분 리막 시트의 적어도 경계 가장자리의 각각의 위치를 설명한다. 특히, 전극 시트는 서로에 대해 미리 결정된 위 치에 배열되어야 한다. 양극 시트와 음극 시트는 물론 존재하는 임의의 분리막 시트의 크기가 서로 상이할 수 있으므로, 증착 정확도는 특히 평면에 대해 횡방향으로 연장되는 방향을 따라 서로 정렬되어 배열된 전극 시트 의 경계 가장자리에서 결정된다. 특히, 전극 시트의 증착 정확도는 전극 시트의 한 경계 가장자리 또는 한 지점에서만 결정된다. 이 방법은 특히 적어도 하나의 카메라 및 하나의 광원을 갖는 측정 장치를 사용하여 수행된다. 여러 개의 고정 식 또는 이동식 광원이 제공될 수 있다. 여러 개의 고정식 또는 이동식 카메라도 제공될 수 있다. 특히, 각각의 광원은 하나의 카메라에만 할당되지만, 여러 개의 광원이 하나의 카메라에 할당할 수도 있다. 광원은 특히 적어도 가시광선을 포함하는 광 방사선을 방출하는 데 사용된다. 카메라는 이미지를 표시하기 위해 광 방사선을 기록하는 데 사용된다. 특히, 카메라는 적어도 하나의 렌즈(예를 들어, 텔레센트릭) 및 입사광을 전기 신호로 변환하는 센서를 포함한다. 특히, 카메라는 광원으로부터의 광선에 노출된 스택의 해당 영역의 2차원 이미지를 표시하는 것을 가능하게 한 다. 단계 a)에 따르면, 스택은 측정 장치에 제공되고, 특히 광원과 카메라 사이에 또는 광선이 스택으로부터 카메라 를 향해 반사되는 방식으로 배열되며; 여기서 광원과 카메라 사이의 연결 직선(스택을 통과하거나 스택으로부터 좀 떨어져 진행됨)은 본질적으로 평면에 평행하게 진행된다. 스택을 별도로 형성하고, 그런 다음 측정 장치에 전체적으로 배열하는 것도 가능하다. 그러나 스택 자체가 측정 장치에 (부분적으로) 형성되어 동시에 배열되는 것도 가능하다. 특히, 광선이 광원에서 카메라를 향해 방출되도록 광원은 카메라를 향해 정렬된다. 대안적으로, 스택에 의해 반사된 광선이 카메라에 의해 검출되도록 광원과 카메라는 스택의 (동일한) 영역을 향한다. 광원과 카메라는 광선(방향이 지정되어 서로 평행한 경우, 광원에서 나와 카메라를 향해 연결 직선을 따라 진행됨)이 평면에 평행하게 진행되는 방식으로 스택과 정렬된다. 단계 b)에 따르면, 광선이 스택의 적어도 한 영역을 통과하거나 스택으로부터 카메라를 향해 반사되도록 스택은 광원으로 조명된다. 광선은 카메라에 의해 캡처된다. 따라서, 스택은 적어도 부분적으로 조명된다. 스택을 통과 하는, 예를 들어, 전극 시트 사이의 자유 공간을 통과하는 광원의 광선만 카메라에 의해 검출될 수 있다. 광원의 광선은 전극 시트의 중첩된 경계 가장자리를 캡처하여 스택의 경계 가장자리의 2차원 이미지가 카메라에 의해 캡처되고 기록될 수 있다. 단계 c)에 따르면, 스택의 적어도 한 영역의 이미지가 카메라에 의해 캡처된다. 특히, 스택의 영역의 하나의 이 미지만 캡처된다. 특히, 해당 영역의 추가 이미지는 필요하지 않다. 필요한 경우, 다른 영역(다른 측면에 의해 형성됨)의 추가 이미지가 기록되고 평가될 수 있다. 양극 및 음극 시트보다 일반적으로 더 큰 분리막 시트의 경 계 가장자리를 캡처하기 위해 광원과 카메라의 다른 배열도 가능하다. 이 경우, 광선은 평면에 대해 횡방향으로 또는 비스듬히(즉, 평행하지 않음) 진행될 수도 있다. 단계 d)에 따르면, 이미지는 평가되고 해당 영역에 배열된 양극 시트, 음극 시트 및/또는 분리막 시트의 경계 가장자리의 위치가 결정된다. 특히, 평가는 데이터 처리 시스템에 의해 수행될 수 있다. 특히, 스택에 대해 하 나의 이미지만 평가되며, 다른 영역을 기록하여 생성된 추가 이미지일 수도 있다. 특히, 개별 전극 시트의 증착 정확도가 충분한 정확도로 결정되도록 이러한 절차를 여러 번 수행한다. 특히, 스 택의 여러 다른 영역이 조명되고 카메라에 의해 기록되어야 하며, 대응하는 이미지가 생성되고 평가되어야 한다. 특히, 이를 통해 목표 위치에 대한 각 전극 시트의 회전 또는 병진 이동을 결정할 수 있다. 전체 스택의 증착 정확도를 확인하고 결정하기 위해, 적어도 3개의 상이한 영역, 예를 들어 스택의 가장자리가 측정 장치를 사용하여 기록된다. 특히, 스택의 특정 가장자리(즉, 직육면체 스택 - 어레스터는 고려되지 않음 - 4개의 가장 짧은 가장자리)에서, 삼각 측량을 통해 가장자리의 공간 좌표를 결정하기 위해 2개의 방향에서 이미지가 한 번에 생성된다. 특히, 스 택은 고정 장치에 의해 카메라와 광원에 대해 회전된다. 따라서, 위에서 설명한 각각의 가장자리는 2개의 방향 에서 카메라에 의해 캡처된다. 특히, 각각의 스택에 대해 8개의 이미지가 생성된다. 특히, 측정 장치는 방법을 수행하도록 적절하게 장착, 구성 또는 프로그래밍되거나 방법을 수행하는 수단을 갖 는 데이터 처리 시스템을 포함한다. 수단은, 예를 들어, 프로세서 및 프로세서에 의해 실행될 명령어가 저장되 는 메모리뿐만 아니라 전술한 요소 사이에서 명령어, 측정값, 데이터 등의 전송을 가능하게 하는 데이터 라인 또는 전송 장치를 포함한다. 특히, 스택은 복수의 전극 시트에 의해 형성된 복수의 측면을 갖는다. 단계 a)에서, 스택은 광원과 카메라 사이 에 배열되어 연결 직선은 서로 180도 미만, 특히 150도 미만, 바람직하게는 120도 미만의 최소 각도로 배열된 제1 측면과 제2 측면을 통과한다. 특히, 측면 사이의 최소 각도는 적어도 70도, 바람직하게는 적어도 80도이다.특히, 측면은 서로 평행하거나 서로 반대로 배열되지 않는다. 본 명세서에서 고려되는 스택의 측면은 특히 전극 시트, 특히 분리막 시트의 경계 가장자리에 의해 형성되는데, 이는 단락을 피하기 위해 일반적으로 양극 시트 및 음극 시트보다 더 큰 확장을 갖기 때문이다. 이들 측면은 특 히 전극 시트가 연장되는 평면에 횡방향으로 연장된다. 특히, 제1 측면과 제2 측면은 서로 인접하게 배열된다. 특히, 영역은 인접한 측면에 의해 형성된 스택의 가장자리를 포함한다. 특히, 연결 직선은 90도 미만, 특히 75도 미만, 바람직하게는 60도 미만의 최소 제2 각도로 제1 측면 및 제2 측 면까지 연장된다. 특히, 각각의 측면과 연결 직선 사이의 최소 제2 각도는 적어도 25도, 바람직하게는 적어도 40도이다. 특히, 단계 d)에서, 적어도 하나의 양극 시트 및 적어도 하나의 음극 시트의 경계 가장자리의 적어도 위치가 결 정된다. 특히, 분리막 시트는 양극 시트 및 음극 시트보다 일반적으로 크기 때문에 분리막 시트의 경계 가장자 리를 결정할 필요가 없다. 위에서 설명한 바와 같이, 광원과 카메라의 다른 배열을 사용하여 분리막 시트의 경 계 가장자리를 결정할 수도 있다. 배터리 셀의 전기화학적 성능이 전극 커버리지 또는 활물질 커버리지가 적을수록 작동 중 더 빠르게 감소하기 때문에, 적어도 하나의 양극 시트와 적어도 하나의 음극 시트의 경계 가장자리를 결정하는 것이 특히 필요하다. 특히, 광원은 바람직하게는 적어도 365 내지 870nm[나노미터]의 파장을 갖는 가시광선을 생성한다. 특히, 광선은 간섭성 및/또는 시준성이다(즉, 서로 평행하게 정렬됨). 대안적으로, 광선은 확산성 및/또는 간섭 성이다. 특히, 본질적으로 평면에 평행하게 진행되는 빛이 주로 사용된다. 이는 이미지의 정확도를 향상시키고 평가를 단순화할 수 있다. 특히 간섭광이나 시준광을 사용하면 정확도가 더욱 향상될 수 있다. 특히, 측정 장치는 적어도 단계 b) 및 c) 동안 해당 영역에 가스 흐름을 인가할 수 있는 노즐을 포함한다. 특히, 노즐은 전극 시트가 가스 흐름에 의해 펼쳐지거나 정렬되는 방식으로 위치된다. 이는 전극 시트를 통한 광선의 통과를 향상시킬 수 있다. 특히, 전극 시트 상의, 특히 분리막 시트와 양극 또는 음극 시트 사이의 정전기 전하가 용해될 수 있도록 가스 흐름은 이온화될 수 있다. 이는 전극 시트를 통한 광선의 통과를 더욱 향상시킬 수 있다. 특히, 적어도 단계 d)에서는 인공 지능이 사용된다. 특히, 인공 지능을 사용하여 이미지에서 경계 가장자리의 위치 결정을 지원할 수 있다. 특히, 적어도 하나의 이미지는 컨볼루션 신경망(Convolutional Neural Network; CNN)을 사용하여 평가된다. 컨 볼루션 신경망은 단계 c)에 따라 캡처된 이 스택의 이미지로부터 (원하는) 전극 시트의 경계 가장자리의 위치를 결정하기 위해 전극 시트의 경계 가장자리의 위치가 알려진 스택의 합성, 즉 인위적으로 생성된, 데이터 세트로 부터 학습한다. 예를 들어, 전극 시트가 처지는 경우, 즉 이상적으로 수평면으로 진행되지 않는 경우, 다항식을 사용하여 경계 가장자리의 정확한 위치를 계산할 수 있다. 컨볼루션 신경망을 사용하는 대신, 다른 기계 또는 자동으로 작동 가능한 학습 방법을 사용하여 평가를 수행할 수도 있다. 다음에서는 컨볼루션 신경망과 사용된 프로세스 및 용어에 중점을 둔다. 이미지, 즉 카메라 이미지를 평가하기 위해 이러한 CNN을 사용하는 것은 일반적으로 알려져 있다. 본 사례에서 는 전극 시트의 (절단) 경계 가장자리의 품질 평가를 위해, 즉 배터리 구성요소 제조와 관련하여 CNN의 사용이 제안된다. CNN을 사용한 평가의 일부로 경계 가장자리에 대한 자동화되고 인라인 가능한 평가를 구현하기 위해, 훈련 데이 터 세트, 즉 합성 데이터 세트를 먼저 생성할 수 있다. 경계 가장자리의 위치는 이 훈련 데이터 세트의 각각의 이미지에 수동으로 표시될 수 있다. 이러한 수동 표시, 즉 경계 가장자리의 표시된 위치는 도구에서 수동으로 내보내진다. 픽셀 매트릭스로 코딩된 이미지의 경계 가장자리의 위치는 소위 검증 자료라고 불리는 훈련 데이터 세트에 대한 경계 가장자리의 스택 기하학적 구조 또는 배열을 나타낸다. 다음에서는 CNN을 사용하여 이미지에 표시된 경계 가장자리의 대응하는 기하학적 구조에 대한 수학적 매핑을 학 습한다. 그런 다음, 이러한 방식으로 훈련된 CNN은 이전에 학습되지 않은 카메라 이미지의 경계 가장자리 또는 기하학적 구조를 인식할 수 있다. 본질적으로 유사한 몸체(이 경우 경계 가장자리의 정의된 목표 기하학적 구조를 가진 적층된 전극 시트의 경계 가장자리)의 상이한 이미지의 낮은 변화와 많은 양의 데이터의 통계적 중요성 으로 인해, 이러한 인식은 비교 가능한 방법, 예를 들어, 추세 가장자리 인식보다 더 정확하다. 잘 알려진 바와 같이, CNN은 고정된 수의 필터를 이미지 섹션과 개별적으로 컨볼루션하는 일련의 컨볼루션층으 로 구성된다. 각 필터에 대해, 이러한 층은 소위 특징 맵을 계산한다. 이 특징 맵은 필터 파라미터에 의해 정의 된 패턴이 각각의 제2 이미지 또는 윤곽선의 대응하는 위치에서 인식되었는지 여부를 설명한다. 이러한 특징 맵 의 크기는 계산의 복잡성을 줄이기 위해 소위 최대 풀링층 또는 평균 풀링층의 도움으로 줄어든다. 최대 풀링층 또는 평균 풀링층은 특징 맵 위에 n x n 창을 푸시하고 특히 한 섹션의 최댓값만 다음 층으로 전송한다. 컨볼루션층 및 최대 풀링층 또는 평균 풀링층의 순서와 수, 그리고 각 창과 필터의 크기는 소위 하이퍼 파라미 터이다. 이러한 하이퍼 파라미터는 특히 모델 파라미터의 최적화에 영향을 주지 않는 검증 데이터 세트에 의해 최적화된다. 마지막 단계에서, 모든 특징 맵의 값을 연결하여 평탄화라고 알려진 벡터를 형성하고 피드포워드 신경망에 대한 입력의 역할을 한다. 이 신경망은 다양한 수의 은닉층과 각각의 은닉층의 다양한 수의 뉴런을 특징으로 한다. 이러한 숫자는 추가 하이퍼 파라미터를 형성한다. 평탄화에 대한 대안으로, 전치 컨볼루션을 사용하여 먼저 압축된 특징 맵을 원래 크기로 다시 변환하고 그런 다 음 컨볼루션층을 사용하여 그 크기를 다시 1로 줄일 수 있다. 출력층에서, 신경망은 각 픽셀에 0 또는 1을 할당함으로써 스택의 검증 자료의 수동으로 생성된 가장자리 기하 학적 구조를 근사화하려고 시도한다. 훈련이 시작될 때, 필터 파라미터와 피드포워드 신경망의 파라미터(둘 다 함께 CNN을 형성함)가 무작위로 초기 화될 수 있으며, 이로 인해 초기에는 부정확한 기하학적 구조의 예측이 발생한다. 훈련 중에, 모든 모델 파라미 터는 소위 경사하강법을 사용하여 조정되므로 모든 훈련 예제에서 잘못 분류된 픽셀의 수가 최소화된다. 훈련 후, CNN은 예를 들어 단계 d)의 일부로 미지의 스택에 대한 이미지 또는 새로 생성된 이미지에서 적어도 하나의 경계 가장자리의 위치를 인식하는 데 사용될 수 있다. 특히, 추가 단계에서, 각각의 스택의 생산을 위해 사용되는 적어도 하나의 프로세스 파라미터는 단계 d)에 따른 증착 정확도의 평가로부터 결정되고 변경되어, 추가 스택에 대한 증착 정확도가 향상된다. 특히, 예를 들어, 후속 측정 과정에서 한계값이 초과 및/또는 검증된 경우, 잘못 배치된 전극 시트와 목표 위치 로부터의 편차가 결정될 수 있다. 따라서, 전극 시트의 제조 프로세스는 전극 시트에 대한 지식으로부터 추적될 수 있고, 필요한 경우 조정 가능한 프로세스 파라미터가 변경될 수 있다. 설명된 방법을 수행하기 위한 측정 장치가 또한 제안되며, 이는 적어도 카메라 및 광원을 포함한다. 특히, 서로 평행한 평면으로 연장되는 적층된 전극 시트의 스택은 광원과 카메라 사이의 연결 직선이 본질적으로 평면에 평 행하게 진행되는 방식으로 카메라와 광원에 대해 배열될 수 있다. 특히, 광원은 카메라를 향해 정렬되고, 광선 이 스택의 적어도 한 영역을 통과하도록 스택은 광원과 카메라 사이에 배열된다. 대안적으로, 광원과 카메라는 스택의 (동일한) 영역에 정렬되며, 그에 따라 광선은 해당 영역에 의해 반사되고 카메라에 의해 캡처된다. 특히, 측정 장치는 적어도 2개의 카메라와 2개의 광원을 포함하며, 스택은 복수의 전극 시트에 의해 형성된 복 수의 측면을 갖는다. 카메라와 광원은 제1 카메라와 제1 광원 사이의 제1 연결 직선이 서로 180도 미만의 최소 제1 각도로 배열된 스택의 제1 측면과 제2 측면을 통과하고 제2 카메라와 제2 광원 사이의 제2 연결 직선이 서 로 180도 미만, 특히 150도 미만, 바람직하게는 120도 미만의 최소 제1 각도로 서로에 대해 배열된 스택의 제3 측면과 제4 측면을 통과하도록 배열된다. 특히, 측면 사이의 최소 제1 각도는 적어도 70도, 바람직하게는 적어 도 80도이다. 특히, 측정 장치는 3개 또는 심지어 4개의 카메라와 비슷한 수의 광원 또는 요구 사항에 적합한 수의 광원을 포 함한다. 상이하거나 동일한 영역의 이미지(다른 방향에서 취해질 수 있음)를 동시에 생성하고 평가할 수 있기 때문에, 이는 모든 전극 시트의 증착 정확도 결정을 더욱 가속화할 수 있다. 특히, 방법을 수행하도록 적절하게 장착, 구성 또는 프로그래밍되거나 방법을 수행하는 수단을 갖는 데이터 처 리 시스템이 제안된다. 수단은, 예를 들어, 프로세서 및 프로세서에 의해 실행될 명령어가 저장되는 메모리뿐만 아니라 전술한 요소 사 이에서 명령어, 측정값, 데이터 등의 전송을 가능하게 하는 데이터 라인 또는 전송 장치를 포함한다.프로그램이 컴퓨터에 의해 실행될 때, 컴퓨터로 하여금 설명된 방법 또는 설명된 방법의 단계를 수행하게 하는 명령어를 포함하는 컴퓨터 프로그램이 추가로 제안된다. 컴퓨터에 의해 실행될 때, 컴퓨터로 하여금 설명된 방법 또는 설명된 방법의 단계를 수행하게 하는 명령어를 포 함하는 컴퓨터 판독 가능 저장 매체가 추가로 제안된다. 특히, 방법의 실시예는 데이터 처리 시스템 및/또는 컴퓨터 구현 방법(즉, 컴퓨터 프로그램 및 컴퓨터 판독 가 능 저장 매체)으로 전환 가능하며 그 반대도 마찬가지이다. 특히 청구범위 및 이를 재현하는 설명에서 부정관사(\"a\", \"an\")의 사용은 숫자 단어가 아닌 그 자체로 이해되어 야 한다. 따라서, 이에 의해 도입된 용어나 구성요소는 적어도 한 번 존재하는 것으로 이해되어야 하며, 특히 한 번 이상 존재할 수도 있다. 예방 조치로서, 본 명세서에 사용된 숫자 단어(\"제1\", \"제2\",...)는 주로(오직) 여러 유사한 대상, 수량 또는 프로세스를 구별하는 데 사용되며, 즉, 특히 이러한 대상, 수량 또는 프로세스의 종속성 및/또는 순서를 서로 관련하여 반드시 지정하지는 않는다는 점에 유의해야 한다. 종속성 및/또는 순서가 필요한 경우, 이는 본 명세 서에 명시적으로 언급되거나 설명된 특정 실시예를 연구할 때 당업자에게 명백하다. 구성요소가 한 번 이상(\"적 어도 한 번\") 나타날 수 있는 한, 이러한 구성요소 중 하나에 대한 설명은 복수의 이러한 구성요소 중 전부 또 는 일부에 동일하게 적용될 수 있지만, 이는 필수 사항은 아니다."}
{"patent_id": "10-2024-7019815", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 고정 장치 내의 스택을 사시도로 도시한다. 도 2는 도 1에 따른 스택의 측면도를 도시한다. 아래에서는 도 1과 도 2를 함께 설명한다. 전극 시트(1, 2, 3)는 양극 시트, 음극 시트 및 분리막 시트를 포함한다. 전극 시트(1, 2, 3)는 서로 평행한 평면으로 연장되고 서로 적층되어 배열된다. 전극 시트(1, 2, 3)는 스택을 형성한다. 증착 정확도는 스택 내의 양극 시트, 음극 시트 또는 분리막 시트의 경계 가장자리의 각각의 위치(6, 7, 8)를 설명한다. 전극 시트(1, 2, 3)는 서로 평행한 평면으로 연장되고 서로 적층될 때 스택을 형성한다. 전극 시트(1, 2, 3)는 각각 실질적으로 직사각형 형상을 갖는다. 스택은 복수의 전극 시트(1, 2, 3)에 의해 형성되는 여러 측면(16, 17, 18, 19)을 갖는다. 스택의 측면(16, 17, 18, 19)은 전극 시트(1, 2, 3), 이 경 우는 분리막 시트의 경계 가장자리에 의해 형성되는데, 이는 단락을 방지하기 위해 일반적으로 양극 시트 및 음극 시트보다 더 큰 확장을 갖기 때문이다. 측면(16, 17, 18, 19)은 전극 시트(1, 2, 3)가 연장되는 평면에 횡방향으로 연장된다. 어레스터(플래그)는 전극 시트(1, 2, 3)의 직사각형 형상 너머로 연장된다. 이러한 어레스터는 일반적 으로 코팅되지 않고, 즉 활물질로 코팅되지 않고, 각각의 전극 시트(1, 2), 즉 양극 시트 또는 음극 시트 의 전기적 접촉에 사용된다. 도 2는 전극 시트(1, 2, 3)의 경계 가장자리가 공칭 배열로 어떻게 배열되는지에 대한 상세도를 도시한다. 전극 시트(1, 2, 3)는 적층 방향(평면에 횡방향으로 진행됨)을 따라 교대로 배열된다. 음극 시트의 제2 위치는 가장 안쪽에, 즉 제1 측면으로부터 가장 먼 거리에 배열된다. 양극 시트의 제1 위치는 제2위치와 분리막 시트의 제3 위치 사이에 위치한다. 스택의 제1 측면은 분리막 시트의 경계 가장자리에 의해 형성된다. 본 명세서에서 고정 장치는 2개의 플레이트를 포함하며, 그 사이에 스택이 배열된다. 전극 시트(1, 2, 3)는 고정 장치를 통해 위치(6, 7, 8)에 고정되며, 따라서 스택은 측정 장치에 배열될 수 있다. 도 3은 스택의 이미지(왼쪽) 및 내부에 스택이 배열된 측정 장치(오른쪽)(이를 통해 이미지를 생 성할 수 있음)를 도시한다. 도 1 및 도 2에 대한 설명을 참조한다. 측정 장치는 카메라와 광원을 갖는다. 단계 a)에서, 스택은 연결 직선(여기서는 시준된 광 선에 평행하게 진행됨)이 제1 측면과 제2 측면을 통과하는 방식으로 광원과 카메라 사이에 배열되며, 이들은 서로 90도의 최소 제1 각도로 배열되고 서로 인접해 있다. 단계 b)에 따르면, 스택은 광원으로 조명되어 광선은 스택의 영역을 통과하고 카메라에 의해 검출된다. 영역은 인접한 측면(16, 17)에 의해 형성된 스택의 가장자리를 포함한다. 연결 직선은 제1 측면 및 제2 측면에 대해 대략 45도의 최소 제2 각도로 진행된다. 따라서, 스택은 적어도 부분적으로 조명된다. 스택을 통과하는, 예를 들어, 전극 시트(1, 2, 3) 사이의 자유 공간을 통과하는 광원의 광선만 카메라에 의해 검출될 수 있다. 광원의 광선은 전극 시트(1, 2, 3)의 중첩된 경계 가장자리를 캡처하여 스택의 경계 가장자리 의 2차원 이미지가 카메라에 의해 캡처되고 기록될 수 있다. 단계 c)에 따르면, 스택의 적어도 한 영역의 이미지가 카메라에 의해 캡처된다. 스택의 영역 의 이미지가 캡처된다. 영역 또는 다른 영역의 추가 이미지가 증착 정확도를 결정하는 데 필요 할 수 있으며, 스택의 위치를 변경하거나 카메라 또는 광원의 위치를 변경함으로써 생성될 수 있다. 따라서, 적어도 하나의 다른 영역(다른 측면(18, 19)에 의해 형성됨; 도 4 참조)의 추가 이미지가 기록 되고 평가될 수 있다. 단계 d)에 따라, 이미지가 평가되고, 영역에 배열된 적어도 양극 시트 및 음극 시트의 경계 가장 자리의 위치(6, 7, 8)가 결정된다. 평가는 데이터 처리 시스템에 의해 수행된다. 도 4는 내부에 스택이 배열된 추가 측정 장치를 평면도로 도시한다. 도 1 내지 도 3에 대한 설명을 참조 한다. 전극 시트(1, 2, 3)는 각각 본질적으로 직사각형 형상을 갖는다. 스택은 복수의 전극 시트(1, 2, 3)에 의해 형성되는 여러 측면(16, 17, 18, 19)을 갖는다. 스택의 측면(16, 17, 18, 19)은 전극 시트(1, 2, 3), 이 경 우에는 분리막 시트의 경계 가장자리에 의해 형성된다. 측면(16, 17, 18, 19)은 전극 시트(1, 2, 3)가 연 장되는 평면에 횡방향으로 연장된다. 어레스터(플래그)는 전극 시트(1, 2, 3)의 직사각형 형상 너머로 연장된다. 스택은 고정 장치에 배열된다. 측정 장치는 제1 카메라와 제1 광원뿐만 아니라 제2 카메라와 제2 광원을 포함한다. 단계 a)에서, 스택은 각각의 연결 직선이 제1 측면과 제2 측면을 통과하거나, 제3 측면과 제4 측 면을 통과하는 방식으로 제1 광원과 제1 카메라 사이에 그리고 동시에 제2 광원과 제2 카메라 사이에 배열된다. 제1 측면과 제2 측면은 서로 90도의 최소 제1 각도로 배열되고 서로 인접해 있다. 단계 b)에 따르 면, 스택은 제1 광원으로 조명되어 광선은 스택의 영역을 통과하고 제1 카메라에 의해 캡처된다. 영역은 인접한 측면(16, 17)에 의해 형성된 스택의 가장자리를 포함한다. 연결 직선 은 제1 측면에 대해 대략 30도의 제2 각도로 연장되고, 제2 측면에 대해 대략 60도의 최소 제2 각 도로 연장된다. 제3 측면과 제4 측면은 서로 90도의 최소 제1 각도로 배열되고 서로 인접해 있다. 단계 b)에 따르 면, 스택은 (또한) 제2 광원으로 조명되어 광선은 스택의 추가 영역을 통과하고 제2 카메라 에 의해 검출된다. 영역은 인접한 측면(18, 19)에 의해 형성된 스택의 가장자리를 포함한다. 연 결 직선은 제3 측면에 대해 대략 30도의 최소 제2 각도로 연장되고, 제4 측면에 대해 대략 60 도의 최소 제2 각도로 연장된다.단계 c)에 따르면, 스택의 두 영역의 이미지가 각각의 카메라(11, 21)에 의해 기록된다. 스택의 두 영역의 두 개의 이미지만이 기록된다. 영역의 추가 이미지가 증착 정확도를 결정하기 위해 연속 적으로 또는 동시에 생성될 수 있다. 단계 d)에 따르면, 이미지가 평가되고, 각각의 영역에 배열된 적어도 양극 시트 및 음극 시트의 경계 가장자리의 위치(6, 7, 8)가 결정된다. 평가는 데이터 처리 시스템에 의해 수행된다. 도 5는 내부에 스택이 배열된 다른 측정 장치의 평면도를 도시한다. 도 1 내지 도 4, 특히 도 3 및 도 4 에 대한 설명을 참조한다. 측정 장치는 2개의 노즐을 포함하며, 이를 통해 적어도 단계 b) 및 c) 동안 각각의 영역에 가스 흐 름이 공급될 수 있다. 노즐은 전극 시트(1, 2, 3)가 가스 흐름에 의해 펼쳐지거나 정렬되는 방식으 로 위치된다(도 5의 오른쪽 하단의 세부 사항 참조). 이는 전극 시트(1, 2, 3)를 통한 광선의 통과를 향상 시킬 수 있다."}
{"patent_id": "10-2024-7019815", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명과 기술적 내용은 첨부된 도면을 참조하여 아래에서 더 자세히 설명된다. 본 발명은 주어진 실시예에 의 해 제한되도록 의도되지 않았다는 점에 유의해야 한다. 특히, 명시적으로 달리 나타내지 않는 한, 도면에서 설 명된 사항의 일부 측면을 추출하고 이를 본 설명의 다른 구성요소 및 발견과 결합하는 것도 가능하다. 특히, 도 면 및 특히 표시된 비율은 단지 개략적인 것이라는 점에 유의해야 한다. 도 1은 고정 장치 내의 스택을 사시도로 도시한다. 도 2는 도 1에 따른 스택의 측면도를 도시한다. 도 3은 스택의 이미지 및 내부에 스택이 배열된 측정 장치(이를 통해 이미지를 생성할 수 있음)를 도시한다. 도 4는 내부에 스택이 배열된 다른 측정 장치를 평면도로 도시한다. 도 5는 내부에 스택이 배열된 다른 측정 장치를 평면도로 도시한다."}
